[
  {
    "id": 12717,
    "hadith_number": 5440,
    "tajuk_hadith": "Menyeru dengan Nama Nabi SAW",
    "perawi_melayu": "Anas meriwayatkan bahawa seorang lelaki di Baqi' memanggil orang lain sebagai \"Abu al-Qasim,\" dan Rasulullah SAW berpaling ke arahnya. Lelaki itu berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ وَابْنُ أَبِي عُمَرَ - قَالَ أَبُو كُرَيْبٍ أَخْبَرَنَا وَقَالَ،\n ابْنُ أَبِي عُمَرَ حَدَّثَنَا وَاللَّفْظُ، لَهُ - قَالاَ حَدَّثَنَا مَرْوَانُ، - يَعْنِيَانِ الْفَزَارِيَّ - عَنْ حُمَيْدٍ، عَنْ \n أَنَسٍ، قَالَ نَادَى رَجُلٌ رَجُلاً بِالْبَقِيعِ يَا أَبَا الْقَاسِمِ ‏.‏ فَالْتَفَتَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله\n عليه وسلم ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي لَمْ أَعْنِكَ إِنَّمَا دَعَوْتُ فُلاَنًا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم ‏\n\"‏ تَسَمَّوْا بِاسْمِي وَلاَ تَكَنَّوْا بِكُنْيَتِي ‏\"‏ ‏.‏",
    "malay_translation": "Aku diberitahu oleh Abu Kuraib, Muhammad bin al-Ala' dan Ibnu Abi Umar - Abu Kuraib berkata, dia memberitakan kepadaku dan berkata, Ibnu Abi Umar memberitakan kepadaku dan lafaz ini daripada dia - mereka berdua berkata, Marwan memberitakan kepada kami, iaitu al-Fazari - daripada Humaid, daripada Anas, katanya: Seorang lelaki memanggil lelaki lain di Baqi', \"Wahai Abu al-Qasim!\" Lalu Rasulullah SAW berpaling kepadanya.  Lelaki itu berkata, \"Wahai Rasulullah, saya tidak bermaksud untuk memanggil tuan, saya memanggil fulan.\"  Rasulullah SAW bersabda, \"Gunakanlah namaku, tetapi jangan gunakan kunyaku.\""
  },
  {
    "id": 12718,
    "hadith_number": 5441,
    "tajuk_hadith": "Nama-nama yang Paling Disukai Allah",
    "perawi_melayu": "Ibnu Umar meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The names dearest to Allah are 'Abdullah and 'Abd al-Rahman.",
    "arabic_text": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ زِيَادٍ، - وَهُوَ الْمُلَقَّبُ بِسَبَلاَنَ - أَخْبَرَنَا عَبَّادُ بْنُ عَبَّادٍ، عَنْ \n عُبَيْدِ اللَّهِ بْنِ عُمَرَ، وَأَخِيهِ عَبْدِ اللَّهِ، سَمِعَهُ مِنْهُمَا، سَنَةَ أَرْبَعٍ وَأَرْبَعِينَ وَمِائَةٍ يُحَدِّثَانِ عَنْ \n نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ أَحَبَّ أَسْمَائِكُمْ إِلَى\n اللَّهِ عَبْدُ اللَّهِ وَعَبْدُ الرَّحْمَنِ ‏\"‏ ‏.‏",
    "malay_translation": "Ibnu Umar meriwayatkan bahawa Rasulullah SAW bersabda:  \"Sesungguhnya nama-nama yang paling disukai oleh Allah SWT ialah Abdullah dan Abdurrahman.\""
  },
  {
    "id": 12719,
    "hadith_number": 5442,
    "tajuk_hadith": "Menamakan Anak dengan Nama Muhammad",
    "perawi_melayu": "Jabir bin Abdullah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ عُثْمَانُ حَدَّثَنَا وَقَالَ، إِسْحَاقُ\n أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ وُلِدَ لِرَجُلٍ\n مِنَّا غُلاَمٌ فَسَمَّاهُ مُحَمَّدًا فَقَالَ لَهُ قَوْمُهُ لاَ نَدَعُكَ تُسَمِّي بِاسْمِ رَسُولِ اللَّهِ صلى الله عليه\n وسلم ‏.‏ فَانْطَلَقَ بِابْنِهِ حَامِلَهُ عَلَى ظَهْرِهِ فَأَتَى بِهِ النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ\n اللَّهِ وُلِدَ لِي غُلاَمٌ فَسَمَّيْتُهُ مُحَمَّدًا فَقَالَ لِي قَوْمِي لاَ نَدَعُكَ تُسَمِّي بِاسْمِ رَسُولِ اللَّهِ صلى\n الله عليه وسلم ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ تَسَمَّوْا بِاسْمِي وَلاَ تَكْتَنُوا بِكُنْيَتِي\n فَإِنَّمَا أَنَا قَاسِمٌ أَقْسِمُ بَيْنَكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Jabir bin Abdullah meriwayatkan bahawa seorang lelaki daripada kalangan kita dikurniakan seorang anak lelaki, lalu dia menamakannya Muhammad.  Kemudian kaumnya berkata kepadanya, \"Kami tidak akan membenarkan engkau menamakan anakmu dengan nama Rasulullah SAW.\"  Maka lelaki itu pun pergi bersama anaknya, mendukungnya di belakangnya, lalu menghadap Nabi SAW dan berkata, \"Wahai Rasulullah, saya telah dikurniakan seorang anak lelaki, dan saya telah menamakannya Muhammad, tetapi kaum saya melarang saya menamakannya dengan nama Rasulullah SAW.\"  Lalu Rasulullah SAW bersabda,  \"Namailah anak-anak kamu dengan namaku, tetapi janganlah kamu menggunakan kunyaku. Kerana sesungguhnya aku adalah Qasim, iaitu aku yang membahagikan (ghanim dan zakat) di kalangan kamu.\""
  },
  {
    "id": 12720,
    "hadith_number": 5443,
    "tajuk_hadith": "Menamakan Anak dengan Nama Muhammad",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan bahawa seorang lelaki daripada kalangan kami mempunyai seorang anak lelaki, lalu dinamakan Muhammad. Kami berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا عَبْثَرٌ، عَنْ حُصَيْنٍ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ \n جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ وُلِدَ لِرَجُلٍ مِنَّا غُلاَمٌ فَسَمَّاهُ مُحَمَّدًا فَقُلْنَا لاَ نَكْنِيكَ بِرَسُولِ اللَّهِ صلى\n الله عليه وسلم حَتَّى تَسْتَأْمِرَهُ ‏.‏ قَالَ فَأَتَاهُ فَقَالَ إِنَّهُ وُلِدَ لِي غُلاَمٌ فَسَمَّيْتُهُ بِرَسُولِ اللَّهِ\n وَإِنَّ قَوْمِي أَبَوْا أَنْ يَكْنُونِي بِهِ حَتَّى تَسْتَأْذِنَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ سَمُّوا\n بِاسْمِي وَلاَ تَكَنَّوْا بِكُنْيَتِي فَإِنَّمَا بُعِثْتُ قَاسِمًا أَقْسِمُ بَيْنَكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Jabir bin Abdullah meriwayatkan: “Seorang lelaki daripada kalangan kami dikurniakan seorang anak lelaki.  Dia menamakannya Muhammad. Kami berkata, “Kami tidak akan membenarkan engkau menamakan anakmu dengan nama utusan Allah ﷺ sehingga engkau meminta izin daripada baginda.”  Lalu lelaki itu pergi menghadap baginda dan berkata, “Wahai Rasulullah, saya dikurniakan seorang anak lelaki dan saya menamakannya sempena nama utusan Allah. Namun kaumku melarangku daripada menggunakan nama tersebut sehingga aku mendapat izin daripada Nabi ﷺ.”  Baginda ﷺ bersabda, “Namailah anak-anak kamu dengan namaku, tetapi janganlah kamu menggunakan kunyaku (gelaran Abu). Kerana aku diutuskan sebagai Qasim (yang membahagikan), aku membahagikan di antara kamu.”"
  },
  {
    "id": 12721,
    "hadith_number": 5444,
    "tajuk_hadith": "Rasulullah s.a.w. sebagai Pembahagi",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Husain dengan sanad yang sama, tetapi tidak menyebut perkataan ini:",
    "english_text": "\" (I have been sent as a distributor), so I distribute amongst you.\"",
    "arabic_text": "حَدَّثَنَا رِفَاعَةُ بْنُ الْهَيْثَمِ الْوَاسِطِيُّ، حَدَّثَنَا خَالِدٌ، - يَعْنِي الطَّحَّانَ - عَنْ حُصَيْنٍ،\n بِهَذَا الإِسْنَادِ وَلَمْ يَذْكُرْ ‏\n\"‏ فَإِنَّمَا بُعِثْتُ قَاسِمًا أَقْسِمُ بَيْنَكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Aku diutus sebagai pembahagi, maka aku akan membahagikan di antara kamu."
  },
  {
    "id": 12722,
    "hadith_number": 5445,
    "tajuk_hadith": "Menggunakan Nama Nabi dan Bukan Kunyah",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Give the name after my name, but do not give (the kunya of Abu'l-Qasim after my) kunya, for I am Abu'l-Qasim (in the sense) that I distribute amongst you (the spoils of war) and disseminate the knowledge (of revelation). This hadith has been transmitted on the authority of Abu Bakr but with a slight variation of wording.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، ح وَحَدَّثَنِي أَبُو سَعِيدٍ،\n الأَشَجُّ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الأَعْمَشُ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ\n قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تَسَمَّوْا بِاسْمِي وَلاَ تَكَنَّوْا بِكُنْيَتِي فَإِنِّي أَنَا أَبُو\n الْقَاسِمِ أَقْسِمُ بَيْنَكُمْ ‏\"‏ ‏.‏ وَفِي رِوَايَةِ أَبِي بَكْرٍ ‏\"‏ وَلاَ تَكْتَنُوا ‏\"‏ ‏.‏",
    "malay_translation": "Gunakanlah namaku, tetapi jangan gunakan kunyahku (Abu al-Qasim). Kerana aku, Abu al-Qasim, ialah yang membahagikan harta rampasan perang di kalangan kamu dan menyebarkan ilmu wahyu.  Hadis ini diriwayatkan daripada Abu Bakar, tetapi dengan sedikit perbezaan lafaz."
  },
  {
    "id": 12723,
    "hadith_number": 5446,
    "tajuk_hadith": "Perbezaan Lafaz Hadis Mengenai Tugas Nabi",
    "perawi_melayu": "Abu Kuraib melalui Abu Muawiyah daripada Al-A'mash",
    "english_text": "This hadith has been reported on the authority of A'mash with the same chain of transmitters but there is a slight variation (of wording) that, instead of the word Bu'ithat (I have been sent), the word ju'ilat (I have been made) has been used.",
    "arabic_text": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ وَقَالَ ‏\n\"‏ إِنَّمَا\n جُعِلْتُ قَاسِمًا أَقْسِمُ بَيْنَكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Al-A'mash melalui sanad yang sama,  tetapi dengan sedikit perbezaan lafaz.  Sebaliknya daripada lafaz  \"Bu'ithat\" (aku telah diutus), lafaz  \"Ju'ilat\" (aku telah diangkat/dijadikan) digunakan.  Maksudnya: \"Sesungguhnya aku hanya diangkat/dijadikan sebagai orang yang membahagikan (hak-hak), aku membahagikan di antara kamu.\""
  },
  {
    "id": 12724,
    "hadith_number": 5447,
    "tajuk_hadith": "Menamakan Anak dengan Nama Muhammad",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan bahawa seorang lelaki dari kalangan Ansar telah dikurniakan seorang anak lelaki dan dia berhasrat untuk menamakannya Muhammad. Dia telah datang kepada Rasulullah SAW dan bertanya, maka Baginda SAW bersabda:",
    "english_text": "The Ansar have done well to give the name (to your children) after my name, but do not give them the kunya after my kunya.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ،\n سَمِعْتُ قَتَادَةَ، عَنْ سَالِمٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَجُلاً، مِنَ الأَنْصَارِ وُلِدَ لَهُ غُلاَمٌ فَأَرَادَ\n أَنْ يُسَمِّيَهُ مُحَمَّدًا فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَسَأَلَهُ فَقَالَ ‏\n\"‏ أَحْسَنَتِ الأَنْصَارُ سَمُّوا\n بِاسْمِي وَلاَ تَكْتَنُوا بِكُنْيَتِي ‏\"‏ ‏.‏",
    "malay_translation": "Orang-orang Ansar telah berbuat baik dengan menamakan (anak-anak mereka) dengan namaku, tetapi janganlah kamu menggunakan kunyaku untuk mereka."
  },
  {
    "id": 12725,
    "hadith_number": 5448,
    "tajuk_hadith": "Hadis Riwayat Berbeza Mengenai Perutusan Nabi SAW",
    "perawi_melayu": "Abu Bakar bin Abi Syaibah, Muhammad bin al-Muthanna, Muhammad bin Ja'far, Syu'bah, Mansur, Muhammad bin 'Amr bin Jabalah, Ibn al-Muthanna, Ibn Abi 'Udy, Syu'bah, Husain, Basyir bin Khalid, Muhammad bin Ja'far, Syu'bah, Sulaiman, Salim bin Abi al-Ja'd, Jabir bin 'Abdullah, Ishaq bin Ibrahim al-Hanthali, Ishaq bin Mansur, Nadhr bin Syumail, Syu'bah, Qatadah, Mansur, Sulaiman, Husain bin 'Abd al-Rahman, Salim bin Abi al-Ja'd, Jabir bin 'Abdullah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، كِلاَهُمَا عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ، عَنْ \n شُعْبَةَ، عَنْ مَنْصُورٍ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ جَبَلَةَ، حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ، ح\n وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، كِلاَهُمَا عَنْ شُعْبَةَ، عَنْ حُصَيْنٍ، ح وَحَدَّثَنِي بِشْرُ،\n بْنُ خَالِدٍ أَخْبَرَنَا مُحَمَّدٌ، - يَعْنِي ابْنَ جَعْفَرٍ - حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، كُلُّهُمْ عَنْ سَالِمِ،\n بْنِ أَبِي الْجَعْدِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم ح \n وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَإِسْحَاقُ بْنُ مَنْصُورٍ، قَالاَ أَخْبَرَنَا النَّضْرُ،\n بْنُ شُمَيْلٍ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، وَمَنْصُورٍ، وَسُلَيْمَانَ، وَحُصَيْنِ بْنِ عَبْدِ الرَّحْمَنِ، قَالُوا سَمِعْنَا \n سَالِمَ بْنَ أَبِي الْجَعْدِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ بِنَحْوِ حَدِيثِ\n مَنْ ذَكَرْنَا حَدِيثَهُمْ مِنْ قَبْلُ ‏.‏ وَفِي حَدِيثِ النَّضْرِ عَنْ شُعْبَةَ قَالَ وَزَادَ فِيهِ حُصَيْنٌ وَسُلَيْمَانُ\n قَالَ حُصَيْنٌ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا بُعِثْتُ قَاسِمًا أَقْسِمُ بَيْنَكُمْ ‏\"‏\n ‏.‏ وَقَالَ سُلَيْمَانُ ‏\"‏ فَإِنَّمَا أَنَا قَاسِمٌ أَقْسِمُ بَيْنَكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini telah diriwayatkan melalui beberapa sanad yang berbeza daripada Shu'bah dengan sedikit perbezaan lafaz.  Riwayat ini disampaikan oleh Abu Bakar bin Abi Syaibah dan Muhammad bin al-Muthanna, kedua-duanya daripada Muhammad bin Ja'far, daripada Syu'bah, daripada Mansur.  Juga diriwayatkan oleh Muhammad bin 'Amr bin Jabalah yang meriwayatkan daripada Muhammad (iaitu bin Ja'far).  Begitu juga Ibn al-Muthanna yang meriwayatkan daripada Ibn Abi 'Udy, kedua-duanya daripada Syu'bah, daripada Husain.  Basyir bin Khalid pula meriwayatkan daripada Muhammad (iaitu bin Ja'far), daripada Syu'bah, daripada Sulaiman. Kesemuanya meriwayatkan daripada Salim bin Abi al-Ja'd, daripada Jabir bin 'Abdullah, daripada Nabi SAW.  Ishaq bin Ibrahim al-Hanthali dan Ishaq bin Mansur pula meriwayatkan daripada Nadhr bin Syumail, daripada Syu'bah, daripada Qatadah, Mansur, Sulaiman dan Husain bin 'Abd al-Rahman yang mendengar daripada Salim bin Abi al-Ja'd, daripada Jabir bin 'Abdullah, daripada Nabi SAW.  Isi hadisnya adalah sama seperti yang telah disebut sebelum ini. Dalam riwayat Nadhr daripada Syu'bah, terdapat tambahan daripada Husain dan Sulaiman. Husain berkata: Rasulullah SAW bersabda:  “Sesungguhnya aku diutus sebagai pembahagi, aku membahagi antara kamu.”  Sulaiman pula berkata:  “Sesungguhnya aku hanyalah seorang pembahagi, aku membahagi antara kamu.”"
  },
  {
    "id": 12726,
    "hadith_number": 5449,
    "tajuk_hadith": "Menamakan Anak",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan:",
    "english_text": "A child was born in the house of a person amongst us, and he gave him the name of Qasim. We said: We will not allow you (to give the name) to your child as Qasim (and thus adopt the kunya of Abu'l-Qasim) and coal your eyes. He (that person) came to Allah's Apostle (ﷺ) and made a mention of that to him, whereupon he said: Call your son 'Abd al-Rahman.",
    "arabic_text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، جَمِيعًا عَنْ سُفْيَانَ، قَالَ عَمْرٌو\n حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، حَدَّثَنَا ابْنُ الْمُنْكَدِرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ وُلِدَ لِرَجُلٍ\n مِنَّا غُلاَمٌ فَسَمَّاهُ الْقَاسِمَ فَقُلْنَا لاَ نَكْنِيكَ أَبَا الْقَاسِمِ وَلاَ نُنْعِمُكَ عَيْنًا ‏.‏ فَأَتَى النَّبِيَّ صلى\n الله عليه وسلم فَذَكَرَ ذَلِكَ لَهُ فَقَالَ ‏\n\"‏ أَسْمِ ابْنَكَ عَبْدَ الرَّحْمَنِ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang anak lelaki dilahirkan di rumah seseorang daripada kalangan kami, dan dia menamakannya Qasim. Kami berkata: Kami tidak akan membenarkan engkau menamakan anakmu Qasim (dan dengan itu menggunakan kunya Abu al-Qasim) dan kami tidak akan memberimu (gelaran) itu.  Lalu dia pergi kepada Rasulullah SAW dan menceritakan hal itu kepadanya, maka baginda bersabda: “Namakanlah anakmu Abdurrahman.”"
  },
  {
    "id": 12727,
    "hadith_number": 5450,
    "tajuk_hadith": "Tidak Akan Diizinkan Merenung Dengan Tenang",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Ibnu Uyaina, tetapi tiada disebut:",
    "english_text": "\" We will not allow you to cool your eyes.\"",
    "arabic_text": "وَحَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامٍ، حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ، ح وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ،\n حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنِي ابْنَ عُلَيَّةَ - كِلاَهُمَا عَنْ رَوْحِ بْنِ الْقَاسِمِ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ،\n عَنْ جَابِرٍ، ‏.‏ بِمِثْلِ حَدِيثِ ابْنِ عُيَيْنَةَ غَيْرَ أَنَّهُ لَمْ يَذْكُرْ وَلاَ نُنْعِمُكَ عَيْنًا ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan oleh Umayyah bin Bistam daripada Yazid (maksudnya Ibnu Zurai'), dan juga oleh Ali bin Hujr daripada Ismail (maksudnya Ibnu 'Ulayyah).  Kedua-duanya meriwayatkan daripada Ruh bin al-Qasim, daripada Muhammad bin al-Munkidir, daripada Jabir.  Ia serupa dengan hadis Ibnu Uyaina, cuma tidak menyebut, \"…dan Kami tidak akan membiarkan kamu menikmati ketenangan.\" "
  },
  {
    "id": 12728,
    "hadith_number": 5451,
    "tajuk_hadith": "Menamakan Anak dengan Nama Nabi SAW",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Abu al-Qasim (ﷺ) bersabda:",
    "english_text": "Give name (to your children) after my name but do not give the kunya (of Abu'l- Qasim) after my kunya. 'Amr reported from Abu Huraira that he did not say that he had heard it directly from Allah's Apostle (ﷺ).",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، وَابْنُ، نُمَيْرٍ قَالُوا\n حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ\n أَبُو الْقَاسِمِ صلى الله عليه وسلم ‏\n\"‏ تَسَمَّوْا بِاسْمِي وَلاَ تَكَنَّوْا بِكُنْيَتِي ‏\"‏ ‏.‏ قَالَ عَمْرٌو عَنْ\n أَبِي هُرَيْرَةَ وَلَمَ يَقُلْ سَمِعْتُ ‏.‏",
    "malay_translation": "Namailah anak-anak kamu dengan namaku, tetapi janganlah kamu menggunakan kunyahku (Abu al-Qasim). Amr meriwayatkan dari Abu Hurairah bahawa dia tidak mengatakan bahawa dia mendengarnya secara langsung daripada Rasulullah SAW."
  },
  {
    "id": 12729,
    "hadith_number": 5452,
    "tajuk_hadith": "Menamakan Diri Mengikut Nama Nabi-Nabi dan Orang Soleh Terdahulu",
    "perawi_melayu": "Mughira bin Syu'bah meriwayatkan:",
    "english_text": "When I came to Najran, they (the Christians of Najran) asked me: You read\" O sister of Harun\" (i. e. Hadrat Maryam) in the Qur'an, whereas Moses was born much before Jesus. When I came back to Allah's Messenger (ﷺ) I asked him about that, whereupon he said: The (people of the old age) used to give names (to their persons) after the names of Apostles and pious persons who had gone before them.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَأَبُو سَعِيدٍ الأَشَجُّ\n وَمُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ - وَاللَّفْظُ لاِبْنِ نُمَيْرٍ - قَالُوا حَدَّثَنَا ابْنُ إِدْرِيسَ، عَنْ أَبِيهِ، عَنْ \n سِمَاكِ بْنِ حَرْبٍ، عَنْ عَلْقَمَةَ بْنِ وَائِلٍ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ لَمَّا قَدِمْتُ نَجْرَانَ سَأَلُونِي\n فَقَالُوا إِنَّكُمْ تَقْرَءُونَ يَا أُخْتَ هَارُونَ وَمُوسَى قَبْلَ عِيسَى بِكَذَا وَكَذَا ‏.‏ فَلَمَّا قَدِمْتُ عَلَى\n رَسُولِ اللَّهِ صلى الله عليه وسلم سَأَلْتُهُ عَنْ ذَلِكَ فَقَالَ ‏\n\"‏ إِنَّهُمْ كَانُوا يُسَمُّونَ بِأَنْبِيَائِهِمْ\n وَالصَّالِحِينَ قَبْلَهُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila aku tiba di Najran, mereka (orang Kristian Najran) bertanya kepadaku: Kamu membaca \"Wahai adik perempuan Harun\" (iaitu, Siti Maryam) di dalam al-Quran, sedangkan Musa dilahirkan jauh sebelum Isa.  Apabila aku kembali kepada Rasulullah ﷺ, aku bertanya kepadanya tentang perkara itu, lalu baginda bersabda:  Mereka (orang-orang dahulu kala) biasa menamakan diri mereka mengikut nama-nama para Nabi dan orang-orang soleh yang terdahulu daripada mereka."
  },
  {
    "id": 12730,
    "hadith_number": 5453,
    "tajuk_hadith": "Larangan Menamakan Hamba dengan Empat Nama",
    "perawi_melayu": "Samurah bin Jundub meriwayatkan:",
    "english_text": "Allah's Messenger (ﷺ) forbade us to give names to our servants as these four names: Aflah (Successful), Rabdh (Profit), Yasar (Wealth), and Nafi' (Beneficial).",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ أَبُو بَكْرٍ حَدَّثَنَا مُعْتَمِرُ بْنُ،\n سُلَيْمَانَ عَنِ الرُّكَيْنِ، عَنْ أَبِيهِ، عَنْ سَمُرَةَ، وَقَالَ، يَحْيَى أَخْبَرَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ سَمِعْتُ \n الرُّكَيْنَ، يُحَدِّثُ عَنْ أَبِيهِ، عَنْ سَمُرَةَ بْنِ جُنْدَبٍ، قَالَ نَهَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم\n أَنْ نُسَمِّيَ رَقِيقَنَا بِأَرْبَعَةِ أَسْمَاءٍ أَفْلَحَ وَرَبَاحٍ وَيَسَارٍ وَنَافِعٍ ‏.‏",
    "malay_translation": "Rasulullah SAW melarang kita menamakan hamba kita dengan empat nama ini: Aflah (berjaya), Rabah (untung), Yasar (kekayaan), dan Nafi' (bermanfaat)."
  },
  {
    "id": 12731,
    "hadith_number": 5454,
    "tajuk_hadith": "Larangan Menamakan Hamba dengan Nama-Nama Tertentu",
    "perawi_melayu": "Samura bin Jundub meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Don't give names to your servants as Rabdh, 'Ya ar, Aflah and Nafi'.",
    "arabic_text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الرُّكَيْنِ بْنِ الرَّبِيعِ، عَنْ أَبِيهِ، عَنْ سَمُرَةَ،\n بْنِ جُنْدَبٍ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تُسَمِّ غُلاَمَكَ رَبَاحًا وَلاَ يَسَارًا\n وَلاَ أَفْلَحَ وَلاَ نَافِعًا ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah kamu menamakan hamba kamu dengan nama-nama seperti Rabah, Yasar, Aflah dan Nafi'."
  },
  {
    "id": 12732,
    "hadith_number": 5455,
    "tajuk_hadith": "Kalimat Terindah di Sisi Allah dan Larangan Menamakan Hamba",
    "perawi_melayu": "Samurah bin Jundub meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا مَنْصُورٌ، عَنِ هِلاَلِ بْنِ يَسَافٍ، عَنْ رَبِيعِ بْنِ عُمَيْلَةَ، عَنْ سَمُرَةَ بْنِ جُنْدَبٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"أَحَبُّ الْكَلاَمِ إِلَى اللَّهِ أَرْبَعٌ سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلاَ إِلَهَ إِلاَّ اللَّهُ وَاللَّهُ أَكْبَرُ‏.‏ لاَ يَضُرُّكَ بَأَيِّهِنَّ بَدَأْتَ.‏ وَلاَ تُسَمِّيَنَّ غُلاَمَكَ يَسَارًا وَلاَ رَبَاحًا وَلاَ نَجِيحًا وَلاَ أَفْلَحَ فَإِنَّكَ تَقُولُ أَثَمَّ هُوَ فَلاَ يَكُونُ فَيَقُولُ لاَ‏.\"‏‏ إِنَّمَا هُنَّ أَرْبَعٌ فَلاَ تَزِيدُنَّ عَلَىَّ ‏.‏",
    "malay_translation": "Ahmad bin Abdullah bin Yunus telah meriwayatkan daripada Zuhri, yang meriwayatkan daripada Mansur, daripada Hilal bin Yasaf, daripada Rabi’ bin Umailah, daripada Samurah bin Jundub, bahawa beliau berkata: Rasulullah SAW bersabda:  \"Kalimat yang paling dicintai oleh Allah SWT ialah empat: Subhanallah (Maha Suci Allah), Alhamdulillah (Segala puji bagi Allah), La ilaha illallah (Tiada Tuhan melainkan Allah), dan Allahuakbar (Allah Maha Besar). Tidak mengapa kamu memulakan dengan mana-mana satu daripadanya (ketika mengingati Allah).\n\nDan janganlah kamu menamakan hamba kamu dengan nama Yasar, Rabah, Najihah dan Aflah. Kerana kamu akan berkata: \"Adakah dia berdosa?\" Lalu dia akan menjawab: \"Tidak.\"  Ini hanyalah empat nama, janganlah kamu menambahnya.\" "
  },
  {
    "id": 12733,
    "hadith_number": 5456,
    "tajuk_hadith": "Perihal Menamakan Hamba dan Zikir",
    "perawi_melayu": "Ishaq bin Ibrahim, Jarir, Umayah bin Bistam, Yazid bin Zurai', Ruh bin al-Qasim, Muhammad bin al-Muthanna, dan Ibn Bashshar melalui Mansur, dengan sanad Zuhri.",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنِي جَرِيرٌ، ح وَحَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامٍ، حَدَّثَنَا \n يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا رَوْحٌ، - وَهْوَ ابْنُ الْقَاسِمِ - ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ\n قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، كُلُّهُمْ عَنْ مَنْصُورٍ، بِإِسْنَادِ زُهَيْرٍ ‏.‏ فَأَمَّا حَدِيثُ\n جَرِيرٍ وَرَوْحٍ فَكَمِثْلِ حَدِيثِ زُهَيْرٍ بِقِصَّتِهِ ‏.‏ وَأَمَّا حَدِيثُ شُعْبَةَ فَلَيْسَ فِيهِ إِلاَّ ذِكْرُ تَسْمِيَةِ\n الْغُلاَمِ وَلَمْ يَذْكُرِ الْكَلاَمَ الأَرْبَعَ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ishaq bin Ibrahim, memberitakan kepadaku Jarir, dan telah menceritakan kepadaku Umayah bin Bistam, telah menceritakan kepada kami Yazid bin Zurai', telah menceritakan kepada kami Ruh (ialah anak al-Qasim), dan telah menceritakan kepada kami Muhammad bin al-Muthanna dan Ibn Bashshar, keduanya berkata: Telah menceritakan kepada kami Muhammad bin Ja'far, telah menceritakan kepada kami Syu'bah, semuanya daripada Mansur, dengan sanad Zuhri.  Adapun hadis Jarir dan Ruh, sama seperti hadis Zuhri dengan ceritanya. Adapun hadis Syu'bah, di dalamnya hanya disebut tentang penamaan hamba sahaya dan tidak menyebut empat kalimah (zikir) tersebut."
  },
  {
    "id": 12734,
    "hadith_number": 5457,
    "tajuk_hadith": "Larangan Menamakan Anak dengan Nama-Nama Tertentu",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو\n الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ أَرَادَ النَّبِيُّ صلى الله عليه وسلم أَنْ يَنْهَى عَنْ\n أَنْ يُسَمَّى بِيَعْلَى وَبِبَرَكَةَ وَبِأَفْلَحَ وَبِيَسَارٍ وَبِنَافِعٍ وَبِنَحْوِ ذَلِكَ ثُمَّ رَأَيْتُهُ سَكَتَ بَعْدُ عَنْهَا\n فَلَمْ يَقُلْ شَيْئًا ثُمَّ قُبِضَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَلَمْ يَنْهَ عَنْ ذَلِكَ ثُمَّ أَرَادَ عُمَرُ\n أَنْ يَنْهَى عَنْ ذَلِكَ ثُمَّ تَرَكَهُ ‏.‏",
    "malay_translation": "Muhammad bin Ahmad bin Abi Khalaf telah meriwayatkan daripada Ruh, yang meriwayatkan daripada Ibnu Juraij, yang diberitakan kepadanya oleh Abu Az-Zubair bahawa dia mendengar Jabir bin Abdullah berkata: Rasulullah SAW hendak melarang daripada menamakan (anak) dengan Ya'la, Barakah, Aflah, Yasar, Nafi' dan seumpamanya. Kemudian aku melihat baginda membisu kemudiannya dan tidak berkata apa-apa sehingga Rasulullah SAW wafat, dan baginda tidak melarang (daripada melakukan perkara itu). Kemudian Umar ingin melarang (daripada perkara itu), kemudian meninggalkannya."
  },
  {
    "id": 12735,
    "hadith_number": 5458,
    "tajuk_hadith": "Perubahan Nama Asiya kepada Jamila",
    "perawi_melayu": "Ibn Umar meriwayatkan bahawa Rasulullah SAW telah menukar nama Asiya (yang bermaksud derhaka) dan berkata:",
    "english_text": "You are Jamila (i. e. good and handsome). Ahmad (one of the narrators) narrated it with a slight variation of wording.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، وَزُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ،\n وَمُحَمَّدُ بْنُ بَشَّارٍ قَالُوا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ،\n أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم غَيَّرَ اسْمَ عَاصِيَةَ وَقَالَ ‏\n\"‏ أَنْتِ جَمِيلَةُ ‏\"‏ ‏.‏ قَالَ أَحْمَدُ\n مَكَانَ أَخْبَرَنِي عَنْ ‏.‏",
    "malay_translation": "Ibn Umar meriwayatkan bahawa Rasulullah SAW telah menukar nama Asiya (yang bermaksud derhaka) dan bersabda, \"Engkau Jamila\" (yang bermaksud cantik dan jelita). Ahmad (salah seorang perawi) meriwayatkannya dengan sedikit perbezaan lafaz."
  },
  {
    "id": 12736,
    "hadith_number": 5459,
    "tajuk_hadith": "Rasulullah SAW menamakan anak perempuan Umar",
    "perawi_melayu": "Ibn Umar",
    "english_text": "Ibn 'Umar reported that 'Umar had a daughter who was called 'Asiya. Allah's Messenger (ﷺ) gave her the name of Jamila.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ،\n عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ ابْنَةً لِعُمَرَ، كَانَتْ يُقَالُ لَهَا عَاصِيَةُ فَسَمَّاهَا رَسُولُ\n اللَّهِ صلى الله عليه وسلم جَمِيلَةَ ‏.‏",
    "malay_translation": "Ibn Umar meriwayatkan bahawa Umar mempunyai seorang anak perempuan yang bernama Asiyah. Rasulullah SAW menamakannya Jamilah."
  },
  {
    "id": 12737,
    "hadith_number": 5460,
    "tajuk_hadith": "Perubahan Nama Juwairiyah",
    "perawi_melayu": "Ibn Abbas",
    "english_text": "I did not like that it should be said: He had come out from Barra (Pious). The hadith transmitted on the authority of Ibn Abi 'Umar is slightly different from it.",
    "arabic_text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَابْنُ أَبِي عُمَرَ، - وَاللَّفْظُ لِعَمْرٍو - قَالاَ حَدَّثَنَا سُفْيَانُ، عَنْ \n مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، مَوْلَى آلِ طَلْحَةَ عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَتْ جُوَيْرِيَةُ اسْمُهَا\n بَرَّةَ فَحَوَّلَ رَسُولُ اللَّهِ صلى الله عليه وسلم اسْمَهَا جُوَيْرِيَةَ وَكَانَ يَكْرَهُ أَنْ يُقَالَ خَرَجَ\n مِنْ عِنْدِ بَرَّةَ ‏.‏ وَفِي حَدِيثِ ابْنِ أَبِي عُمَرَ عَنْ كُرَيْبٍ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Amru An-Naqid dan Ibnu Abi Umar – dan lafaznya daripada Amru – mereka berdua berkata: Telah menceritakan kepada kami Sufyan daripada Muhammad bin Abdurrahman, maula keluarga Thalhah daripada Kuraib daripada Ibnu Abbas. Beliau berkata: Nama Juwairiyah pada asalnya ialah Barra (yang bertakwa).  Rasulullah ﷺ menukarkan namanya kepada Juwairiyah. Baginda tidak suka jika dikatakan, “Dia keluar dari rumah Barra.”  Dan dalam hadis Ibnu Abi Umar daripada Kuraib, beliau berkata: Saya mendengar Ibnu Abbas."
  },
  {
    "id": 12738,
    "hadith_number": 5461,
    "tajuk_hadith": "Zainab, Dahulu Bernama Barra",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa nama Zainab sebelum ini ialah Barra. Dikatakan tentangnya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالُوا حَدَّثَنَا \n مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَطَاءِ بْنِ أَبِي مَيْمُونَةَ، سَمِعْتُ أَبَا رَافِعٍ، يُحَدِّثُ عَنْ أَبِي،\n هُرَيْرَةَ ح \n وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَطَاءِ بْنِ أَبِي مَيْمُونَةَ،\n عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ زَيْنَبَ، كَانَ اسْمُهَا بَرَّةَ فَقِيلَ تُزَكِّي نَفْسَهَا ‏.‏ فَسَمَّاهَا\n رَسُولُ اللَّهِ صلى الله عليه وسلم زَيْنَبَ ‏.‏ وَلَفْظُ الْحَدِيثِ لِهَؤُلاَءِ دُونَ ابْنِ بَشَّارٍ ‏.‏ وَقَالَ ابْنُ\n أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ عَنْ شُعْبَةَ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Bakar bin Abi Syaibah, Muhammad bin al-Muthanna, dan Muhammad bin Basysyar. Mereka berkata: Telah menceritakan kepada kami Muhammad bin Ja’far, telah menceritakan kepada kami Syu’bah daripada ‘Ata’ bin Abi Maimunah, aku telah mendengar Abu Rafi’ menceritakan daripada bapanya, iaitu Abu Hurairah.\nDan telah menceritakan kepada kami ‘Ubaidullah bin Mu’adz, telah menceritakan kepada kami bapanya, telah menceritakan kepada kami Syu’bah daripada ‘Ata’ bin Abi Maimunah daripada Abu Rafi’, daripada Abu Hurairah bahawa Zainab, namanya sebelum ini ialah Barra. Kemudian dikatakan bahawa dia memuji dirinya sendiri. Maka Rasulullah SAW menamakannya Zainab.  Lafaz hadis bagi mereka ini adalah tanpa Ibn Basysyar. Dan Ibn Abi Syaibah berkata: Telah menceritakan kepada kami Muhammad bin Ja’far daripada Syu’bah."
  },
  {
    "id": 12739,
    "hadith_number": 5462,
    "tajuk_hadith": "Perubahan Nama oleh Rasulullah SAW",
    "perawi_melayu": "Zainab, binti Umm Salamah meriwayatkan:",
    "english_text": "My name first was Barra. Allah's Messenger (ﷺ) gave me the name of Zainab. Then there entered (into the house of Allah's Prophet as a wife) Zainab, daughter of Jahsh, and her name was also Barra, and he gave her the name of Zainab.",
    "arabic_text": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا \n أَبُو أُسَامَةَ، قَالاَ حَدَّثَنَا الْوَلِيدُ بْنُ كَثِيرٍ، حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ عَطَاءٍ، حَدَّثَتْنِي زَيْنَبُ،\n بِنْتُ أُمِّ سَلَمَةَ قَالَتْ كَانَ اسْمِي بَرَّةَ فَسَمَّانِي رَسُولُ اللَّهِ صلى الله عليه وسلم زَيْنَبَ ‏.‏ قَالَتْ\n وَدَخَلَتْ عَلَيْهِ زَيْنَبُ بِنْتُ جَحْشٍ وَاسْمُهَا بَرَّةُ فَسَمَّاهَا زَيْنَبَ ‏.‏",
    "malay_translation": "Nama saya pada mulanya ialah Barra. Rasulullah SAW menukar nama saya kepada Zainab. Kemudian, masuklah Zainab binti Jahsy ke rumah Rasulullah SAW sebagai isteri baginda. Namanya juga Barra, dan baginda menukarkan namanya kepada Zainab."
  },
  {
    "id": 12740,
    "hadith_number": 5463,
    "tajuk_hadith": "Larangan Menamakan Anak Perempuan Barra",
    "perawi_melayu": "Muhammad bin Amr bin Ata' meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ،\n عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، قَالَ سَمَّيْتُ ابْنَتِي بَرَّةَ فَقَالَتْ لِي زَيْنَبُ بِنْتُ أَبِي سَلَمَةَ إِنَّ\n رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ هَذَا الاِسْمِ وَسُمِّيتُ بَرَّةَ فَقَالَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم ‏\"‏ لاَ تُزَكُّوا أَنْفُسَكُمُ اللَّهُ أَعْلَمُ بِأَهْلِ الْبِرِّ مِنْكُمْ ‏\"‏ ‏.‏ فَقَالُوا بِمَ نُسَمِّيهَا قَالَ\n ‏\"‏ سَمُّوهَا زَيْنَبَ ‏\"‏ ‏.‏",
    "malay_translation": "Kami telah diberitakan oleh Amru An-Naqid, yang telah diberitakan kepadanya oleh Hashim bin Al-Qasim, yang telah diberitakan kepadanya oleh Laith, dari Yazid bin Abi Habib, daripada Muhammad bin Amr bin Ata’, bahawa dia berkata: Aku menamakan anak perempuanku Barra.  Maka Zainab binti Abi Salamah memberitahu aku bahawa Rasulullah SAW melarang nama itu.  Dan aku juga pernah dinamakan Barra, lalu Rasulullah SAW bersabda:  Janganlah kamu menyifatkan diri kamu dengan kebaikan (ketaqwaan). Allah jualah yang lebih mengetahui tentang orang-orang yang bertaqwa di kalangan kamu.  Lalu mereka bertanya: Maka apakah nama yang patut kami berikan kepadanya? Baginda menjawab: Namakanlah dia Zainab."
  },
  {
    "id": 12741,
    "hadith_number": 5464,
    "tajuk_hadith": "Nama Yang Paling Keji di Sisi Allah",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الأَشْعَثِيُّ، وَأَحْمَدُ بْنُ حَنْبَلٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ - وَاللَّفْظُ\n لأَحْمَدَ - قَالَ الأَشْعَثِيُّ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي الزِّنَادِ،\n عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ أَخْنَعَ اسْمٍ عِنْدَ\n اللَّهِ رَجُلٌ تَسَمَّى مَلِكَ الأَمْلاَكِ ‏\"‏ ‏.‏ زَادَ ابْنُ أَبِي شَيْبَةَ فِي رِوَايَتِهِ ‏\"‏ لاَ مَالِكَ إِلاَّ اللَّهُ عَزَّ وَجَلَّ\n ‏\"‏ ‏.‏ قَالَ الأَشْعَثِيُّ قَالَ سُفْيَانُ مِثْلُ شَاهَانْ شَاهْ ‏.‏ وَقَالَ أَحْمَدُ بْنُ حَنْبَلٍ سَأَلْتُ أَبَا عَمْرٍو\n عَنْ أَخْنَعَ فَقَالَ أَوْضَعَ ‏.‏",
    "malay_translation": "Sa'id bin Amru al-Asy'atsy, Ahmad bin Hanbal, dan Abu Bakar bin Abi Syaibah - dan lafaznya daripada Ahmad - berkata, al-Asy'atsy memberitahu kami, dan yang lain berdua berkata, telah meriwayatkan daripada Sufian bin Uyainah, daripada Abi az-Zinad, daripada al-A'raj, daripada Abu Hurairah, daripada Nabi SAW, baginda bersabda: \"Sesungguhnya nama yang paling hina di sisi Allah ialah seorang lelaki yang menggelarkan dirinya Malik al-Amlak (Raja segala Raja).\"  Ibn Abi Syaibah menambah dalam riwayatnya: \"Tiada Raja melainkan Allah SWT.\" Al-Asy'atsy berkata, Sufian berkata: Begitu juga Shahanshah. Dan Ahmad bin Hanbal berkata: Aku bertanya kepada Abu 'Amr tentang maksud Akhna, maka dia berkata: Yang paling hina."
  },
  {
    "id": 12742,
    "hadith_number": 5465,
    "tajuk_hadith": "Orang yang Paling Dimurkai Allah pada Hari Kiamat",
    "perawi_melayu": "Abu Hurairah meriwayatkan daripada Rasulullah SAW,  beliau menyebut beberapa hadis, antaranya sabda Rasulullah SAW:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ\n هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَغْيَظُ رَجُلٍ عَلَى اللَّهِ يَوْمَ الْقِيَامَةِ وَأَخْبَثُهُ وَأَغْيَظُهُ عَلَيْهِ\n رَجُلٌ كَانَ يُسَمَّى مَلِكَ الأَمْلاَكِ لاَ مَلِكَ إِلاَّ اللَّهُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Orang yang paling dimurkai Allah pada hari kiamat, orang yang paling jahat dan paling menimbulkan kemurkaan-Nya ialah orang yang digelar Malik al-Amlak (Raja segala Raja). Tiada Tuhan melainkan Allah.\""
  },
  {
    "id": 12743,
    "hadith_number": 5466,
    "tajuk_hadith": "Rasulullah SAW Memberi Nama Abdullah",
    "perawi_melayu": "Anas bin Malik meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ،\n بْنِ مَالِكٍ قَالَ ذَهَبْتُ بِعَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ الأَنْصَارِيِّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم\n حِينَ وُلِدَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم فِي عَبَاءَةٍ يَهْنَأُ بَعِيرًا لَهُ فَقَالَ ‏\"‏ هَلْ مَعَكَ\n تَمْرٌ ‏\"‏ ‏.‏ فَقُلْتُ نَعَمْ ‏.‏ فَنَاوَلْتُهُ تَمَرَاتٍ فَأَلْقَاهُنَّ فِي فِيهِ فَلاَكَهُنَّ ثُمَّ فَغَرَ فَا الصَّبِيِّ فَمَجَّهُ\n فِي فِيهِ فَجَعَلَ الصَّبِيُّ يَتَلَمَّظُهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ حُبُّ الأَنْصَارِ التَّمْرَ\n ‏\"‏ ‏.‏ وَسَمَّاهُ عَبْدَ اللَّهِ ‏.‏",
    "malay_translation": "Aku telah membawa Abdullah bin Abi Talhah al-Ansari kepada Rasulullah SAW ketika dia dilahirkan.  Ketika itu, Rasulullah SAW memakai jubah bulu dan sedang melapis tar pada unta-unta. Baginda bertanya, \"Adakah kamu membawa kurma?\" Aku menjawab, \"Ya.\" Lalu aku menghulurkan kurma kepadanya. Baginda meletakkan kurma itu ke dalam mulutnya, melunakannya, kemudian membuka mulut bayi itu dan memasukkan kurma tersebut ke dalamnya. Bayi itu mula menghisapnya. Lalu Rasulullah SAW bersabda, \"Orang Ansar memang menyukai kurma.\"  Baginda menamakan bayi itu Abdullah."
  },
  {
    "id": 12744,
    "hadith_number": 5467,
    "tajuk_hadith": "Anak Abu Talhah Meninggal Dunia dan Doa Rasulullah SAW",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا ابْنُ عَوْنٍ، عَنِ ابْنِ،\n سِيرِينَ عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ ابْنٌ لأَبِي طَلْحَةَ يَشْتَكِي فَخَرَجَ أَبُو طَلْحَةَ فَقُبِضَ الصَّبِيُّ\n فَلَمَّا رَجَعَ أَبُو طَلْحَةَ قَالَ مَا فَعَلَ ابْنِي قَالَتْ أُمُّ سُلَيْمٍ هُوَ أَسْكَنُ مِمَّا كَانَ ‏.‏ فَقَرَّبَتْ إِلَيْهِ\n الْعَشَاءَ فَتَعَشَّى ثُمَّ أَصَابَ مِنْهَا فَلَمَّا فَرَغَ قَالَتْ وَارُوا الصَّبِيَّ ‏.‏ فَلَمَّا أَصْبَحَ أَبُو طَلْحَةَ\n أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَخْبَرَهُ فَقَالَ ‏\"‏ أَعْرَسْتُمُ اللَّيْلَةَ ‏\"‏ ‏.‏ قَالَ نَعَمْ قَالَ\n ‏\"‏ اللَّهُمَّ بَارِكْ لَهُمَا ‏\"‏ ‏.‏ فَوَلَدَتْ غُلاَمًا فَقَالَ لِي أَبُو طَلْحَةَ احْمِلْهُ حَتَّى تَأْتِيَ بِهِ النَّبِيَّ صلى\n الله عليه وسلم ‏.‏ فَأَتَى بِهِ النَّبِيَّ صلى الله عليه وسلم وَبَعَثَتْ مَعَهُ بِتَمَرَاتٍ فَأَخَذَهُ النَّبِيُّ\n صلى الله عليه وسلم فَقَالَ ‏\"‏ أَمَعَهُ شَىْءٌ ‏\"‏ ‏.‏ قَالُوا نَعَمْ تَمَرَاتٌ ‏.‏ فَأَخَذَهَا النَّبِيُّ صلى الله\n عليه وسلم فَمَضَغَهَا ثُمَّ أَخَذَهَا مِنْ فِيهِ فَجَعَلَهَا فِي فِي الصَّبِيِّ ثُمَّ حَنَّكَهُ وَسَمَّاهُ عَبْدَ اللَّهِ\n ‏.‏",
    "malay_translation": "Anas bin Malik meriwayatkan bahawa anak Abu Talhah sakit.  Abu Talhah pergi (melakukan perjalanan) dan anaknya meninggal dunia (ketika ketiadaannya).  Apabila Abu Talhah pulang, dia bertanya kepada isterinya, “Bagaimana keadaan anakku?” Umm Sulaim menjawab, “Dia lebih tenang daripada sebelumnya.”  Kemudian Umm Sulaim menghidangkan makan malam kepadanya, lalu dia makan. Selepas itu, mereka berdua bersetubuh.  Setelah selesai, Umm Sulaim berkata, “Gantikanlah jenazah bayi itu.”  Keesokan paginya, Abu Talhah pergi menemui Rasulullah SAW dan menceritakan hal tersebut.  Rasulullah SAW bertanya, “Adakah kamu berdua bermalam bersama?”  Abu Talhah menjawab, “Ya.”  Rasulullah SAW mendoakan, “Ya Allah, berkatilah mereka berdua.”  Kemudian, Umm Sulaim melahirkan seorang bayi lelaki.  Abu Talhah menyuruhku (Anas) untuk membawa bayi itu kepada Nabi SAW.  Aku pun membawanya kepada Nabi SAW, dan Umm Sulaim turut menghantar beberapa biji tamar bersama bayi itu.  Nabi SAW mengambil bayi itu dan bertanya, “Adakah ada apa-apa (untuk Tahnik)?”  Para sahabat menjawab, “Ya, ada tamar.”  Nabi SAW mengambil tamar itu, mengunyahnya, kemudian mengambilnya dari mulut baginda dan meletakkannya ke dalam mulut bayi itu, kemudian baginda melakukan Tahnik dan menamakannya Abdullah."
  },
  {
    "id": 12745,
    "hadith_number": 5468,
    "tajuk_hadith": "Sanad Hadith daripada Anas",
    "perawi_melayu": "Muhammad bin Basar, Hammad bin Mas'adah, Ibn 'Aun, Muhammad, dan Anas.",
    "english_text": "This hadith has been reported on the authority of Anas through another chain of transmitters.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ مُحَمَّدٍ، عَنْ \n أَنَسٍ، بِهَذِهِ الْقِصَّةِ نَحْوَ حَدِيثِ يَزِيدَ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Anas melalui sanad yang lain.  (Perawi: Muhammad bin Basar, Hammad bin Mas'adah, Ibn 'Aun, Muhammad, dan Anas meriwayatkan kisah ini, lebih kurang sama dengan riwayat Yazid.)"
  },
  {
    "id": 12746,
    "hadith_number": 5469,
    "tajuk_hadith": "Penamaan Anak dan Memberi Kurma",
    "perawi_melayu": "Abu Musa meriwayatkan:",
    "english_text": "A child was born in my house and I brought him to Allah's Apostle (may peace be upon him) and he gave him the name of Ibrahim and he rubbed his palate with dates.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَبْدُ اللَّهِ بْنُ بَرَّادٍ الأَشْعَرِيُّ، وَأَبُو كُرَيْبٍ قَالُوا حَدَّثَنَا \n أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ وُلِدَ لِي غُلاَمٌ فَأَتَيْتُ بِهِ النَّبِيَّ صلى\n الله عليه وسلم فَسَمَّاهُ إِبْرَاهِيمَ وَحَنَّكَهُ بِتَمْرَةٍ ‏.‏",
    "malay_translation": "Abu Musa berkata: “Seorang anak lelaki telah lahir di rumahku, lalu aku membawanya kepada Rasulullah SAW. Baginda menamakannya Ibrahim dan mengusap lelangitnya dengan sebiji tamar.”"
  },
  {
    "id": 12747,
    "hadith_number": 5470,
    "tajuk_hadith": "Rasulullah ﷺ Memberi Nama dan Memberi Berkat kepada Abdullah bin Zubair",
    "perawi_melayu": "'Urwa bin Zubair dan Fatimah binti Munzir bin Zubair",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى أَبُو صَالِحٍ، حَدَّثَنَا شُعَيْبٌ، - يَعْنِي ابْنَ إِسْحَاقَ - أَخْبَرَنِي \n هِشَامُ بْنُ عُرْوَةَ، حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، وَفَاطِمَةُ بِنْتُ الْمُنْذِرِ بْنِ الزُّبَيْرِ، أَنَّهُمَا قَالاَ خَرَجَتْ\n أَسْمَاءُ بِنْتُ أَبِي بَكْرٍ حِينَ هَاجَرَتْ وَهِيَ حُبْلَى بِعَبْدِ اللَّهِ بْنِ الزُّبَيْرِ فَقَدِمَتْ قُبَاءً فَنُفِسَتْ\n بِعَبْدِ اللَّهِ بِقُبَاءٍ ثُمَّ خَرَجَتْ حِينَ نُفِسَتْ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم لِيُحَنِّكَهُ فَأَخَذَهُ\n رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْهَا فَوَضَعَهُ فِي حَجْرِهِ ثُمَّ دَعَا بِتَمْرَةٍ قَالَ قَالَتْ عَائِشَةُ\n فَمَكَثْنَا سَاعَةً نَلْتَمِسُهَا قَبْلَ أَنْ نَجِدَهَا فَمَضَغَهَا ثُمَّ بَصَقَهَا فِي فِيهِ فَإِنَّ أَوَّلَ شَىْءٍ دَخَلَ\n بَطْنَهُ لَرِيقُ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَتْ أَسْمَاءُ ثُمَّ مَسَحَهُ وَصَلَّى عَلَيْهِ وَسَمَّاهُ\n عَبْدَ اللَّهِ ثُمَّ جَاءَ وَهُوَ ابْنُ سَبْعِ سِنِينَ أَوْ ثَمَانٍ لِيُبَايِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم\n وَأَمَرَهُ بِذَلِكَ الزُّبَيْرُ فَتَبَسَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ رَآهُ مُقْبِلاً إِلَيْهِ ثُمَّ بَايَعَهُ\n ‏.‏",
    "malay_translation": "Kami telah diberitakan oleh al-Hakam bin Musa Abu Shaleh, yang telah diberitakan kepadanya oleh Shu’aib – iaitu Ibn Ishaq – telah memberitakan kepadaku Hisyam bin ‘Urwah, yang telah memberitakan kepadaku ‘Urwah bin Zubair dan Fatimah binti Munzir bin Zubair, bahawa mereka berdua berkata: Asma’ binti Abu Bakar ketika hijrah sedang hamil dengan Abdullah bin Zubair.  Beliau sampai di Quba’ dan melahirkan Abdullah di situ. Kemudian beliau pergi kepada Rasulullah ﷺ setelah melahirkan untuk di’tahnikkan (diberikan sapuan air liur).  Rasulullah ﷺ mengambilnya darinya dan meletakkannya di pangkuannya, kemudian Baginda meminta sebutir tamar.  ‘Aisyah berkata: Kami mengambil masa beberapa ketika mencari tamar itu sebelum menemuinya. Baginda mengunyahnya, kemudian meludahkannya ke dalam mulut bayi itu.  Perkara pertama yang masuk ke perutnya adalah air liur Rasulullah ﷺ.  Kemudian Asma’ berkata: Kemudian Baginda memercikkan air liur ke tubuhnya dan mendoakannya serta menamakannya Abdullah. Kemudian dia datang ketika usianya tujuh atau lapan tahun untuk memberi bai’ah kepada Rasulullah ﷺ, seperti yang diperintahkan oleh Zubair kepadanya. Rasulullah ﷺ tersenyum apabila melihatnya menghampiri Baginda, kemudian Baginda menerima bai’ahnya."
  },
  {
    "id": 12748,
    "hadith_number": 5471,
    "tajuk_hadith": "Kelahiran Abdullah bin Zubair dan Doa Rasulullah SAW",
    "perawi_melayu": "Asma' meriwayatkan bahawa beliau telah hamil di Mekah dengan Abdullah bin Zubair, dan beliau berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ \n أَسْمَاءَ، أَنَّهَا حَمَلَتْ بِعَبْدِ اللَّهِ بْنِ الزُّبَيْرِ بِمَكَّةَ قَالَتْ فَخَرَجْتُ وَأَنَا مُتِمٌّ، فَأَتَيْتُ الْمَدِينَةَ فَنَزَلْتُ\n بِقُبَاءٍ فَوَلَدْتُهُ بِقُبَاءٍ ثُمَّ أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَوَضَعَهُ فِي حَجْرِهِ ثُمَّ دَعَا\n بِتَمْرَةٍ فَمَضَغَهَا ثُمَّ تَفَلَ فِي فِيهِ فَكَانَ أَوَّلَ شَىْءٍ دَخَلَ جَوْفَهُ رِيقُ رَسُولِ اللَّهِ صلى الله\n عليه وسلم ثُمَّ حَنَّكَهُ بِالتَّمْرَةِ ثُمَّ دَعَا لَهُ وَبَرَّكَ عَلَيْهِ وَكَانَ أَوَّلَ مَوْلُودٍ وُلِدَ فِي الإِسْلاَمِ ‏.‏",
    "malay_translation": "Abu Kuraib, Muhammad bin Ala' meriwayatkan daripada Abu Usamah, daripada Hisyam, daripada bapanya, daripada Asma' bahawa beliau telah hamil Abdullah bin Zubair di Mekah. Beliau berkata, \"Aku berangkat dalam keadaan hampir bersalin, kemudian aku sampai ke Madinah dan singgah di Quba'. Di situlah aku melahirkan anakku. Kemudian aku datang kepada Rasulullah SAW, lalu baginda meletakkan bayi itu di pangkuannya. Baginda kemudian meminta buah kurma, mengunyahnya, dan meludahkan air liurnya ke dalam mulut bayi itu. Maka, air liur Rasulullah SAW adalah benda pertama yang masuk ke dalam perut bayi itu. Kemudian baginda menyapu lelangit bayi itu dengan kurma, berdoa untuknya dan mendoakan kesejahteraannya. Bayi itu merupakan bayi pertama yang dilahirkan dalam Islam (selepas Hijrah).\""
  },
  {
    "id": 12749,
    "hadith_number": 5472,
    "tajuk_hadith": "Hijrah Asma' binti Abu Bakar dalam Keadaan Hamil",
    "perawi_melayu": "Abu Bakar bin Abi Syaibah, Khalid bin Makhlad, Ali bin Mushir, Hisyam bin Urwah daripada bapanya, daripada Asma' binti Abu Bakar",
    "english_text": "Asma', daughter of Abu Bakr, reported that when she migrated to Allah's Messenger (ﷺ) in Medina she was in the family way with Abdullah b. Zubair in her womb.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، عَنْ عَلِيِّ بْنِ مُسْهِرٍ، عَنْ هِشَامِ،\n بْنِ عُرْوَةَ عَنْ أَبِيهِ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، أَنَّهَا هَاجَرَتْ إِلَى رَسُولِ اللَّهِ صلى الله عليه\n وسلم وَهِيَ حُبْلَى بِعَبْدِ اللَّهِ بْنِ الزُّبَيْرِ ‏.‏ فَذَكَرَ نَحْوَ حَدِيثِ أَبِي أُسَامَةَ ‏.‏",
    "malay_translation": "Asma' binti Abu Bakar meriwayatkan bahawa ketika beliau berhijrah kepada Rasulullah SAW di Madinah, beliau sedang hamil dengan Abdullah bin Zubair."
  },
  {
    "id": 12750,
    "hadith_number": 5473,
    "tajuk_hadith": "Berkat Rasulullah SAW ke atas Bayi yang Baru Lahir",
    "perawi_melayu": "Aisyah",
    "english_text": "'A'isha reported that the new-born infants were brought to Allah's Messenger (ﷺ). He blessed them and rubbed their palates with dates.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، حَدَّثَنَا هِشَامٌ، - يَعْنِي ابْنَ\n عُرْوَةَ - عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُؤْتَى بِالصِّبْيَانِ\n فَيُبَرِّكُ عَلَيْهِمْ وَيُحَنِّكُهُمْ ‏.‏",
    "malay_translation": "Aisyah meriwayatkan bahawa bayi-bayi yang baru lahir dibawa kepada Rasulullah SAW. Baginda mendoakan keberkatan ke atas mereka dan mengoleskan lelangit mereka dengan tamar."
  },
  {
    "id": 12751,
    "hadith_number": 5474,
    "tajuk_hadith": "Mencari Tamar Untuk Nabi SAW Mengusap Mulut Abdullah bin Zubair",
    "perawi_melayu": "Aisyah melaporkan:",
    "english_text": "We took 'Abdullah b. Zubair to Allah's Apostle (ﷺ) so that he should put saliva in his mouth and we had to make a good deal of effort in order to procure them.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ \n عَائِشَةَ، قَالَتْ جِئْنَا بِعَبْدِ اللَّهِ بْنِ الزُّبَيْرِ إِلَى النَّبِيِّ صلى الله عليه وسلم يُحَنِّكُهُ فَطَلَبْنَا تَمْرَةً\n فَعَزَّ عَلَيْنَا طَلَبُهَا ‏.‏",
    "malay_translation": "Kami membawa Abdullah bin Zubair kepada Rasulullah SAW agar baginda menyapukan air liurnya ke mulutnya.  Kami terpaksa bersusah payah untuk mendapatkan tamar."
  },
  {
    "id": 12752,
    "hadith_number": 5475,
    "tajuk_hadith": "Penamaan Mundhir oleh Rasulullah SAW",
    "perawi_melayu": "Sahl bin Sa'd meriwayatkan bahawa Mundzir bin Abi Usaid dibawa kepada Rasulullah SAW ketika kelahirannya.",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ، وَأَبُو بَكْرِ بْنُ إِسْحَاقَ قَالاَ حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ،\n حَدَّثَنَا مُحَمَّدٌ، - وَهُوَ ابْنُ مُطَرِّفٍ أَبُو غَسَّانَ - حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ\n أُتِيَ بِالْمُنْذِرِ بْنِ أَبِي أُسَيْدٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم حِينَ وُلِدَ فَوَضَعَهُ النَّبِيُّ\n صلى الله عليه وسلم عَلَى فَخِذِهِ وَأَبُو أُسَيْدٍ جَالِسٌ فَلَهِيَ النَّبِيُّ صلى الله عليه وسلم بِشَىْءٍ\n بَيْنَ يَدَيْهِ فَأَمَرَ أَبُو أُسَيْدٍ بِابْنِهِ فَاحْتُمِلَ مِنْ عَلَى فَخِذِ رَسُولِ اللَّهِ صلى الله عليه وسلم\n فَأَقْلَبُوهُ فَاسْتَفَاقَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَيْنَ الصَّبِيُّ ‏\"‏ ‏.‏ فَقَالَ أَبُو\n أُسَيْدٍ أَقْلَبْنَاهُ يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ ‏\"‏ مَا اسْمُهُ ‏\"‏ ‏.‏ قَالَ فُلاَنٌ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏\n لاَ وَلَكِنِ اسْمُهُ الْمُنْذِرُ ‏\"‏ ‏.‏ فَسَمَّاهُ يَوْمَئِذٍ الْمُنْذِرَ ‏.‏",
    "malay_translation": "Muhammad bin Sahl At-Tamimi dan Abu Bakar bin Ishaq berkata: Kami telah mendengar daripada Ibn Abi Maryam, yang telah mendengar daripada Muhammad bin Mutharrif Abu Ghassan, yang telah mendengar daripada Abu Hazim, daripada Sahl bin Sa’d yang berkata: Mundzir bin Abi Usaid dibawa kepada Rasulullah SAW ketika dilahirkan. Nabi SAW meletakkan bayi itu di atas pahanya, manakala Abi Usaid duduk di situ.  Nabi SAW ketika itu sibuk dengan sesuatu di hadapannya. Abi Usaid menyuruh anaknya diangkat dari pangkuan Rasulullah SAW, lalu diangkatlah dia. Selepas Rasulullah SAW selesai urusannya, baginda bertanya: “Di manakah bayi itu?”  Abi Usaid menjawab: “Kami telah mengangkatnya, wahai Rasulullah.” Baginda bertanya: “Apakah namanya?”  Abi Usaid menjawab: “Nama dia fulan, wahai Rasulullah.”  Baginda berkata: “Tidak, tetapi namanya Mundzir.”  Maka pada hari itu juga, baginda menamakannya Mundzir."
  },
  {
    "id": 12753,
    "hadith_number": 5476,
    "tajuk_hadith": "Sifat Terpuji Rasulullah SAW dan Kisah Anas dengan Abū ‘Umair",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الرَّبِيعِ، سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَبُو التَّيَّاحِ،\n حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، ح \n وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ أَبِي التَّيَّاحِ،\n عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَحْسَنَ النَّاسِ خُلُقًا وَكَانَ\n لِي أَخٌ يُقَالُ لَهُ أَبُو عُمَيْرٍ - قَالَ أَحْسِبُهُ قَالَ - كَانَ فَطِيمًا - قَالَ - فَكَانَ إِذَا جَاءَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم فَرَآهُ قَالَ ‏\n\"‏ أَبَا عُمَيْرٍ مَا فَعَلَ النُّغَيْرُ ‏\"‏ ‏.‏ قَالَ فَكَانَ يَلْعَبُ بِهِ\n ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Ar-Rabi', Sulaiman bin Dawud Al-'Atakī, telah menceritakan kepada kami 'Abdul Warits, telah menceritakan kepada kami Abu At-Tayyah, telah menceritakan kepada kami Anas bin Malik, berkata:  Rasulullah SAW ialah manusia yang paling mulia akhlaknya. Aku mempunyai seorang adik lelaki yang bernama Abu 'Umair. Aku sangka dia telah disapih.  Apabila Rasulullah SAW datang dan melihatnya, baginda bertanya: \"Wahai Abu 'Umair, bagaimana keadaan burung pipit itu?\" Anas menjawab:  Dia bermain dengannya."
  },
  {
    "id": 12754,
    "hadith_number": 5477,
    "tajuk_hadith": "Rasulullah Bersabda Kepada Anas bin Malik",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "O My Son.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي عُثْمَانَ، عَنْ أَنَسِ بْنِ،\n مَالِكٍ قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَا بُنَىَّ ‏\"‏ ‏.‏",
    "malay_translation": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda: \"Wahai anakku...\""
  },
  {
    "id": 12755,
    "hadith_number": 5478,
    "tajuk_hadith": "Kekhawatiran Mengenai Dajjal",
    "perawi_melayu": "Mughira bin Syu'bah meriwayatkan bahawa tiada seorang pun yang lebih banyak bertanya kepada Rasulullah ﷺ tentang Dajjal selain dirinya.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ أَبِي عُمَرَ، - وَاللَّفْظُ لاِبْنِ أَبِي عُمَرَ - قَالاَ\n حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، عَنِ الْمُغِيرَةِ،\n بْنِ شُعْبَةَ قَالَ مَا سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَحَدٌ عَنِ الدَّجَّالِ أَكْثَرَ مِمَّا سَأَلْتُهُ\n عَنْهُ فَقَالَ لِي ‏\"‏ أَىْ بُنَىَّ وَمَا يُنْصِبُكَ مِنْهُ إِنَّهُ لَنْ يَضُرَّكَ ‏\"‏ ‏.‏ قَالَ قُلْتُ إِنَّهُمْ يَزْعُمُونَ أَنَّ\n مَعَهُ أَنْهَارَ الْمَاءِ وَجِبَالَ الْخُبْزِ ‏.‏ قَالَ ‏\"‏ هُوَ أَهْوَنُ عَلَى اللَّهِ مِنْ ذَلِكَ ‏\"‏ ‏.‏",
    "malay_translation": "Mughirah bin Syu'bah berkata, \"Aku bertanya kepada Rasulullah ﷺ tentang Dajjal lebih daripada orang lain. Baginda bersabda,  'Wahai anakku, apa yang membuatmu risau tentangnya? Sesungguhnya dia tidak akan memudaratkanmu.' Aku berkata, 'Mereka mendakwa bahawa dia mempunyai sungai-sungai air dan gunung-gunung roti.' Baginda bersabda, 'Dia lebih mudah ditangani oleh Allah daripada itu.'"
  },
  {
    "id": 12756,
    "hadith_number": 5479,
    "tajuk_hadith": "Variasi Perawi Hadis Ismail",
    "perawi_melayu": "Ismail",
    "english_text": "This hadith has been reported on the authority of Ismail, with the same chain of transmitters but with a slight variation of wording.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا سُرَيْجُ بْنُ،\n يُونُسَ حَدَّثَنَا هُشَيْمٌ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ،\n رَافِعٍ حَدَّثَنَا أَبُو أُسَامَةَ، كُلُّهُمْ عَنْ إِسْمَاعِيلَ، بِهَذَا الإِسْنَادِ ‏.‏ وَلَيْسَ فِي حَدِيثِ أَحَدٍ مِنْهُمْ\n قَوْلُ النَّبِيِّ صلى الله عليه وسلم لِلْمُغِيرَةِ ‏\n\"‏ أَىْ بُنَىَّ ‏\"‏ ‏.‏ إِلاَّ فِي حَدِيثِ يَزِيدَ وَحْدَهُ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Ismail, dengan sanad yang sama tetapi dengan sedikit perbezaan lafaz."
  },
  {
    "id": 12757,
    "hadith_number": 5480,
    "tajuk_hadith": "Mencari Keizinan Tiga Kali",
    "perawi_melayu": "Abu Said al-Khudri meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي عَمْرُو بْنُ مُحَمَّدِ بْنِ بُكَيْرٍ النَّاقِدُ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، حَدَّثَنَا - وَاللَّهِ،\n - يَزِيدُ بْنُ خُصَيْفَةَ عَنْ بُسْرِ بْنِ سَعِيدٍ، قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ كُنْتُ جَالِسًا\n بِالْمَدِينَةِ فِي مَجْلِسِ الأَنْصَارِ فَأَتَانَا أَبُو مُوسَى فَزِعًا أَوْ مَذْعُورًا ‏.‏ قُلْنَا مَا شَأْنُكَ قَالَ\n إِنَّ عُمَرَ أَرْسَلَ إِلَىَّ أَنْ آتِيَهُ فَأَتَيْتُ بَابَهُ فَسَلَّمْتُ ثَلاَثًا فَلَمْ يَرُدَّ عَلَىَّ فَرَجَعْتُ فَقَالَ مَا مَنَعَكَ\n أَنْ تَأْتِيَنَا فَقُلْتُ إِنِّي أَتَيْتُكَ فَسَلَّمْتُ عَلَى بَابِكَ ثَلاَثًا فَلَمْ يَرُدُّوا عَلَىَّ فَرَجَعْتُ وَقَدْ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا اسْتَأْذَنَ أَحَدُكُمْ ثَلاَثًا فَلَمْ يُؤْذَنْ لَهُ فَلْيَرْجِعْ ‏\"‏ ‏.‏ فَقَالَ عُمَرُ\n أَقِمْ عَلَيْهِ الْبَيِّنَةَ وَإِلاَّ أَوْجَعْتُكَ ‏.‏ فَقَالَ أُبَىُّ بْنُ كَعْبٍ لاَ يَقُومُ مَعَهُ إِلاَّ أَصْغَرُ الْقَوْمِ ‏.‏ قَالَ أَبُو\n سَعِيدٍ قُلْتُ أَنَا أَصْغَرُ الْقَوْمِ ‏.‏ قَالَ فَاذْهَبْ بِهِ ‏.‏",
    "malay_translation": "Aku mendengar daripada Amru bin Muhammad bin Bukhair an-Naqid, yang meriwayatkan daripada Sufyan bin Uyainah, yang meriwayatkan (dengan izin Allah), daripada Yazid bin Khushaifah daripada Busr bin Said, katanya: Aku mendengar Abu Said al-Khudri berkata: Aku sedang duduk di Madinah dalam majlis kaum Ansar, maka datanglah Abu Musa dalam keadaan terkejut atau takut. Kami bertanya: Apakah halnya? Dia menjawab: Umar telah menyuruhku datang kepadanya. Maka aku pun datang ke pintu rumahnya dan memberi salam tiga kali, tetapi dia tidak menjawabku, lalu aku pun pulang.  Maka dia (Umar) berkata: Apakah yang menghalangimu daripada datang? Aku menjawab: Sesungguhnya aku telah datang kepadamu dan memberi salam di pintu rumahmu tiga kali, tetapi aku tidak dijawab, lalu aku pun pulang, kerana Rasulullah SAW telah bersabda: \"Apabila seseorang dari kalangan kamu memohon izin tiga kali, dan tidak dibenarkan, maka hendaklah dia pulang.\" Maka Umar berkata:  Bawalah saksi untuk menyokong apa yang kamu katakan, jika tidak, aku akan menghukummu. Ubay bin Ka'ab berkata: Tiada siapa yang boleh menjadi saksi bersamanya kecuali orang yang paling muda di kalangan orang ramai.  Abu Said berkata: Akulah yang paling muda di kalangan orang ramai.  Maka Umar berkata: Pergilah bersamanya."
  },
  {
    "id": 12758,
    "hadith_number": 5481,
    "tajuk_hadith": "Abu Said Memberi Kesaksian kepada Umar",
    "perawi_melayu": "Hadis ini diriwayatkan melalui Yazid bin Khusaifa dengan sanad yang sama, tetapi dengan tambahan ini:",
    "english_text": "Abu Sa'id said: So I stood up, and went to 'Umar and gave witness (to what Abu Musa had said).",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَابْنُ أَبِي عُمَرَ، قَالاَ حَدَّثَنَا سُفْيَانُ، عَنْ يَزِيدَ بْنِ خُصَيْفَةَ،\n بِهَذَا الإِسْنَادِ ‏.‏ وَزَادَ ابْنُ أَبِي عُمَرَ فِي حَدِيثِهِ قَالَ أَبُو سَعِيدٍ فَقُمْتُ مَعَهُ فَذَهَبْتُ إِلَى عُمَرَ\n فَشَهِدْتُ ‏.‏",
    "malay_translation": "Abu Said berkata: Maka aku berdiri, dan pergi kepada Umar lalu memberikan kesaksian (terhadap apa yang telah dikatakan oleh Abu Musa)."
  },
  {
    "id": 12759,
    "hadith_number": 5482,
    "tajuk_hadith": "Mencari Keizinan Masuk Rumah",
    "perawi_melayu": "Abu Said al-Khudri meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ وَهْبٍ، حَدَّثَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ \n بُكَيْرِ بْنِ الأَشَجِّ، أَنَّ بُسْرَ بْنَ سَعِيدٍ، حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ كُنَّا فِي مَجْلِسٍ\n عِنْدَ أُبَىِّ بْنِ كَعْبٍ فَأَتَى أَبُو مُوسَى الأَشْعَرِيُّ مُغْضَبًا حَتَّى وَقَفَ فَقَالَ أَنْشُدُكُمُ اللَّهَ هَلْ\n سَمِعَ أَحَدٌ مِنْكُمْ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الاِسْتِئْذَانُ ثَلاَثٌ فَإِنْ أُذِنَ لَكَ وَإِلاَّ\n فَارْجِعْ ‏\"‏ ‏.‏ قَالَ أُبَىٌّ وَمَا ذَاكَ قَالَ اسْتَأْذَنْتُ عَلَى عُمَرَ بْنِ الْخَطَّابِ أَمْسِ ثَلاَثَ مَرَّاتٍ\n فَلَمْ يُؤْذَنْ لِي فَرَجَعْتُ ثُمَّ جِئْتُهُ الْيَوْمَ فَدَخَلْتُ عَلَيْهِ فَأَخْبَرْتُهُ أَنِّي جِئْتُ أَمْسِ فَسَلَّمْتُ ثَلاَثًا\n ثُمَّ انْصَرَفْتُ قَالَ قَدْ سَمِعْنَاكَ وَنَحْنُ حِينَئِذٍ عَلَى شُغْلٍ فَلَوْ مَا اسْتَأْذَنْتَ حَتَّى يُؤْذَنَ لَكَ\n قَالَ اسْتَأْذَنْتُ كَمَا سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ فَوَاللَّهِ لأُوجِعَنَّ ظَهْرَكَ\n وَبَطْنَكَ ‏.‏ أَوْ لَتَأْتِيَنَّ بِمَنْ يَشْهَدُ لَكَ عَلَى هَذَا ‏.‏ فَقَالَ أُبَىُّ بْنُ كَعْبٍ فَوَاللَّهِ لاَ يَقُومُ مَعَكَ إِلاَّ\n أَحْدَثُنَا سِنًّا قُمْ يَا أَبَا سَعِيدٍ ‏.‏ فَقُمْتُ حَتَّى أَتَيْتُ عُمَرَ فَقُلْتُ قَدْ سَمِعْتُ رَسُولَ اللَّهِ صلى\n الله عليه وسلم يَقُولُ هَذَا ‏.‏",
    "malay_translation": "Aku telah diberitahu oleh Abu ath-Thahir, yang memberitahu aku daripada Abdullah bin Wahb, yang telah diberitahu oleh Amru bin al-Harits, daripada Bukhair bin al-Asyaj, bahawa Busr bin Sa'id telah memberitahunya bahawa dia telah mendengar Abu Said al-Khudri berkata: Kami berada dalam satu majlis di sisi Ubayy bin Ka'ab, maka datanglah Abu Musa al-Asy'ari dalam keadaan marah sehingga dia berdiri lalu berkata: Aku meminta kamu bersaksi demi Allah, adakah sesiapa di antara kamu mendengar Rasulullah SAW bersabda: \"Mencari izin itu tiga kali, jika kamu dibenarkan, maka masuklah, jika tidak, maka berpalinglah.\" Ubayy berkata: Apakah itu? Dia berkata: Aku meminta izin kepada Umar bin al-Khattab semalam sebanyak tiga kali tetapi aku tidak dibenarkan, maka aku berpatah balik; kemudian aku datang kepadanya hari ini, lalu aku masuk menemuinya dan memberitahunya bahawa aku telah datang kepadanya semalam dan memberi salam tiga kali, kemudian aku berlalu pergi. Dia berkata: Kami memang telah mendengar kamu, tetapi ketika itu kami sibuk, mengapa kamu tidak terus meminta izin sehingga dibenarkan? Dia berkata: Aku meminta izin sepertimana yang aku telah dengar Rasulullah SAW bersabda. Maka Umar berkata: Demi Allah, nescaya aku akan menyeksa punggung dan perutmu, melainkan engkau membawa seseorang yang boleh menjadi saksi bagimu tentang perkara ini. Maka Ubayy bin Ka'ab berkata: Demi Allah, tiada siapa yang akan berdiri bersamamu melainkan yang paling muda di antara kami. Maka dia berkata kepada Abu Said: Berdirilah! Maka aku berdiri sehingga aku sampai kepada Umar, lalu aku berkata: Aku telah mendengar Rasulullah SAW bersabda demikian."
  },
  {
    "id": 12760,
    "hadith_number": 5483,
    "tajuk_hadith": "Keizinan Masuk Rumah: Tiga Kali",
    "perawi_melayu": "Abu Sa'id meriwayatkan bahawa Abu Musa al-Ash'ari datang ke pintu rumah Umar dan meminta izin (untuk masuk ke rumahnya). Umar berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا بِشْرٌ، - يَعْنِي ابْنَ مُفَضَّلٍ - حَدَّثَنَا سَعِيدُ،\n بْنُ يَزِيدَ عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، أَنَّ أَبَا مُوسَى، أَتَى بَابَ عُمَرَ فَاسْتَأْذَنَ فَقَالَ عُمَرُ\n وَاحِدَةٌ ‏.‏ ثُمَّ اسْتَأْذَنَ الثَّانِيَةَ فَقَالَ عُمَرُ ثِنْتَانِ ‏.‏ ثُمَّ اسْتَأْذَنَ الثَّالِثَةَ فَقَالَ عُمَرُ ثَلاَثٌ ‏.‏ ثُمَّ\n انْصَرَفَ فَأَتْبَعَهُ فَرَدَّهُ فَقَالَ إِنْ كَانَ هَذَا شَيْئًا حَفِظْتَهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم\n فَهَا وَإِلاَّ فَلأَجْعَلَنَّكَ عِظَةً ‏.‏ قَالَ أَبُو سَعِيدٍ فَأَتَانَا فَقَالَ أَلَمْ تَعْلَمُوا أَنَّ رَسُولَ اللَّهِ صلى\n الله عليه وسلم قَالَ ‏\n\"‏ الاِسْتِئْذَانُ ثَلاَثٌ ‏\"‏ ‏.‏ قَالَ فَجَعَلُوا يَضْحَكُونَ - قَالَ - فَقُلْتُ أَتَاكُمْ\n أَخُوكُمُ الْمُسْلِمُ قَدْ أُفْزِعَ تَضْحَكُونَ انْطَلِقْ فَأَنَا شَرِيكُكَ فِي هَذِهِ الْعُقُوبَةِ ‏.‏ فَأَتَاهُ فَقَالَ\n هَذَا أَبُو سَعِيدٍ ‏.‏",
    "malay_translation": "Abu Sa'id meriwayatkan bahawa Abu Musa datang ke pintu rumah Umar lalu meminta izin. Umar berkata, “Sekali.” Kemudian Abu Musa meminta izin lagi untuk kali kedua, lalu Umar berkata, “Dua kali.” Kemudian dia meminta izin lagi untuk kali ketiga, lalu Umar berkata, “Tiga kali.” Kemudian Abu Musa pergi. Umar menyuruh orang mengejarnya dan membawanya kembali. Umar berkata, “Jika ini adalah sesuatu yang engkau hafal daripada Rasulullah SAW, maka ia dibenarkan. Jika tidak, nescaya Aku akan menjadikanmu sebagai contoh teladan (bagi orang lain).” Abu Sa’id berkata, “Kemudian Abu Musa datang kepada kami dan berkata, “Tidakkah kamu semua mengetahui bahawa Rasulullah SAW bersabda, ‘Meminta izin itu tiga kali’?” Mereka (para sahabat yang hadir) ketawa. Abu Musa berkata, “Saudara muslim kamu telah digertak, tetapi kamu semua ketawa. Pergilah, aku akan turut menanggung hukuman ini bersamamu.” Maka dia pergi kepada Umar dan berkata, “Ini adalah Abu Sa’id.”"
  },
  {
    "id": 12761,
    "hadith_number": 5484,
    "tajuk_hadith": "Sanad Riwayat Hadis daripada Abu Said al-Khudri",
    "perawi_melayu": "Hadis ini diriwayatkan melalui beberapa sanad daripada Abu Said al-Khudri.",
    "english_text": "This hadith bu been narrated on the authority of Abu Sa'id Khudri through another chain of transmitters.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ \n أَبِي مَسْلَمَةَ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، ح \n وَحَدَّثَنَا أَحْمَدُ بْنُ الْحَسَنِ بْنِ خِرَاشٍ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا شُعْبَةُ، عَنِ الْجُرَيْرِيِّ،\n وَسَعِيدِ بْنِ يَزِيدَ كِلاَهُمَا عَنْ أَبِي نَضْرَةَ، قَالاَ سَمِعْنَاهُ يُحَدِّثُ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، ‏.‏ بِمَعْنَى\n حَدِيثِ بِشْرِ بْنِ مُفَضَّلٍ عَنْ أَبِي مَسْلَمَةَ، ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan oleh Muhammad bin Muthanna dan Ibn Bashar. Mereka berkata:  Kami mendengar daripada Muhammad bin Ja’far; daripada Syu’bah; daripada Abu Muslim; daripada Abu Nadrah; daripada Abu Said.  Dan diriwayatkan juga oleh Ahmad bin Hasan bin Khirash; daripada Syababah; daripada Syu’bah; daripada al-Jurairi dan Said bin Yazid (keduanya daripada Abu Nadrah). Mereka berdua berkata: Kami mendengar baginda meriwayatkan daripada Abu Said al-Khudri. Maksudnya sama dengan hadis Bisyr bin Mufaḍḍal daripada Abu Muslim."
  },
  {
    "id": 12762,
    "hadith_number": 5485,
    "tajuk_hadith": "Keperluan Mendapatkan Bukti Sebelum Menjatuhkan Hukuman",
    "perawi_melayu": "Ubaid bin Umair meriwayatkan bahawa Abu Musa meminta izin kepada Umar (untuk memasuki rumah) sebanyak tiga kali, dan mendapati Umar sibuk lalu kembali.",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، عَنِ ابْنِ جُرَيْجٍ، حَدَّثَنَا \n عَطَاءٌ، عَنْ عُبَيْدِ بْنِ عُمَيْرٍ، أَنَّ أَبَا مُوسَى، اسْتَأْذَنَ عَلَى عُمَرَ ثَلاَثًا فَكَأَنَّهُ وَجَدَهُ مَشْغُولاً\n فَرَجَعَ فَقَالَ عُمَرُ أَلَمْ تَسْمَعْ صَوْتَ عَبْدِ اللَّهِ بْنِ قَيْسٍ ائْذَنُوا لَهُ ‏.‏ فَدُعِيَ لَهُ فَقَالَ مَا حَمَلَكَ\n عَلَى مَا صَنَعْتَ قَالَ إِنَّا كُنَّا نُؤْمَرُ بِهَذَا ‏.‏ قَالَ لَتُقِيمَنَّ عَلَى هَذَا بَيِّنَةً أَوْ لأَفْعَلَنَّ ‏.‏ فَخَرَجَ\n فَانْطَلَقَ إِلَى مَجْلِسٍ مِنَ الأَنْصَارِ فَقَالُوا لاَ يَشْهَدُ لَكَ عَلَى هَذَا إِلاَّ أَصْغَرُنَا ‏.‏ فَقَامَ أَبُو سَعِيدٍ\n فَقَالَ كُنَّا نُؤْمَرُ بِهَذَا ‏.‏ فَقَالَ عُمَرُ خَفِيَ عَلَىَّ هَذَا مِنْ أَمْرِ رَسُولِ اللَّهِ صلى الله عليه وسلم\n أَلْهَانِي عَنْهُ الصَّفْقُ بِالأَسْوَاقِ ‏.‏",
    "malay_translation": "Ubaid bin Umair meriwayatkan bahawa Abu Musa meminta izin kepada Umar (untuk memasuki rumah) sebanyak tiga kali.  Mendapati Umar sibuk, dia kembali.  Lalu Umar bertanya kepada penghuni rumahnya, “Bukankah kamu mendengar suara Abdullah bin Qais? Berikan izin kepadanya.”  Lalu Abdullah bin Qais dipanggil. Umar bertanya, “Apakah yang mendorongmu melakukan itu?”  Jawab Abu Musa, “Kami diperintahkan untuk berbuat demikian.” Umar berkata, “Kamu mesti mengemukakan bukti untuk itu, atau aku akan menghukummu.”  Abu Musa pun keluar dan pergi ke majlis Ansar. Mereka berkata, “Hanya yang termuda di antara kami yang dapat memberi kesaksian tentang hal ini.”  Lalu Abu Said al-Khudri (yang merupakan orang termuda di situ) berkata, “Kami diperintahkan untuk berbuat demikian (ketika mengunjungi rumah orang lain).”  Umar berkata, “Perintah Rasulullah SAW ini tersembunyi daripada aku sehingga kini kerana kesibukan aku di pasar.”"
  },
  {
    "id": 12763,
    "hadith_number": 5486,
    "tajuk_hadith": "Hadis daripada Ibnu Juraij: Tiada Sebutan Perniagaan di Pasar",
    "perawi_melayu": "Ibnu Juraij (dan perawi lain seperti yang disebutkan dalam teks Arab)",
    "english_text": "This hadith has been transmitted on the authority of Ibn Juraij, but there is no mention of the words \"business in the market\".",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَاصِمٍ، ح وَحَدَّثَنَا حُسَيْنُ بْنُ حُرَيْثٍ، حَدَّثَنَا \n النَّضْرُ، - يَعْنِي ابْنَ شُمَيْلٍ - قَالاَ جَمِيعًا حَدَّثَنَا ابْنُ جُرَيْجٍ، بِهَذَا الإِسْنَادِ نَحْوَهُ وَلَمْ يَذْكُرْ\n فِي حَدِيثِ النَّضْرِ أَلْهَانِي عَنْهُ الصَّفْقُ بِالأَسْوَاقِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan melalui sanad Ibnu Juraij, tetapi tidak disebut perkataan \"perniagaan di pasar\" dalam riwayat ini.  Riwayat lain daripada al-Nadhr bin Syumayl menerusi jalan yang hampir sama juga tidak menyebutnya."
  },
  {
    "id": 12764,
    "hadith_number": 5487,
    "tajuk_hadith": "Mencari Keizinan Tiga Kali",
    "perawi_melayu": "Abu Musa al-Ash'ari",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حُسَيْنُ بْنُ حُرَيْثٍ أَبُو عَمَّارٍ، حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، أَخْبَرَنَا طَلْحَةُ بْنُ،\n يَحْيَى عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، قَالَ جَاءَ أَبُو مُوسَى إِلَى عُمَرَ بْنِ الْخَطَّابِ\n فَقَالَ السَّلاَمُ عَلَيْكُمْ هَذَا عَبْدُ اللَّهِ بْنُ قَيْسٍ ‏.‏ فَلَمْ يَأْذَنْ لَهُ فَقَالَ السَّلاَمُ عَلَيْكُمْ هَذَا أَبُو مُوسَى\n السَّلاَمُ عَلَيْكُمْ هَذَا الأَشْعَرِيُّ ‏.‏ ثُمَّ انْصَرَفَ فَقَالَ رُدُّوا عَلَىَّ رُدُّوا عَلَىَّ ‏.‏ فَجَاءَ فَقَالَ يَا أَبَا\n مُوسَى مَا رَدَّكَ كُنَّا فِي شُغْلٍ ‏.‏ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الاِسْتِئْذَانُ\n ثَلاَثٌ فَإِنْ أُذِنَ لَكَ وَإِلاَّ فَارْجِعْ ‏\"‏ ‏.‏ قَالَ لَتَأْتِيَنِّي عَلَى هَذَا بِبَيِّنَةٍ وَإِلاَّ فَعَلْتُ وَفَعَلْتُ ‏.‏ فَذَهَبَ\n أَبُو مُوسَى قَالَ عُمَرُ إِنْ وَجَدَ بَيِّنَةً تَجِدُوهُ عِنْدَ الْمِنْبَرِ عَشِيَّةً وَإِنْ لَمْ يَجِدْ بَيِّنَةً فَلَمْ تَجِدُوهُ\n ‏.‏ فَلَمَّا أَنْ جَاءَ بِالْعَشِيِّ وَجَدُوهُ قَالَ يَا أَبَا مُوسَى مَا تَقُولُ أَقَدْ وَجَدْتَ قَالَ نَعَمْ أُبَىَّ بْنَ\n كَعْبٍ ‏.‏ قَالَ عَدْلٌ ‏.‏ قَالَ يَا أَبَا الطُّفَيْلِ مَا يَقُولُ هَذَا قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه\n وسلم يَقُولُ ذَلِكَ يَا ابْنَ الْخَطَّابِ فَلاَ تَكُونَنَّ عَذَابًا عَلَى أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه\n وسلم ‏.‏ قَالَ سُبْحَانَ اللَّهِ إِنَّمَا سَمِعْتُ شَيْئًا فَأَحْبَبْتُ أَنْ أَتَثَبَّتَ ‏.‏",
    "malay_translation": "Abu Musa al-Ash'ari meriwayatkan bahawa beliau pergi kepada Umar bin al-Khattab dan memberi salam, “Assalamu'alaikum, ini adalah Abdullah bin Qais.”  Umar tidak memberi izin kepadanya.  Beliau memberi salam lagi, “Assalamu'alaikum, ini adalah Abu Musa.”  Kemudian, “Assalamu'alaikum, ini adalah al-Ash'ari.” Selepas itu, beliau berpaling.  Umar berkata, “Panggil dia kembali, panggil dia kembali!” Maka beliau datang semula. Umar bertanya, “Wahai Abu Musa, mengapakah engkau kembali? Kami sedang sibuk.” Abu Musa menjawab, “Saya mendengar Rasulullah SAW bersabda, ‘Mencari izin itu tiga kali. Jika diizinkan, masuklah. Jika tidak, kembalilah.’ ” Umar berkata, “Engkau mesti membawa bukti tentang ini, jika tidak, aku akan menghukummu!” Abu Musa pergi. Umar berkata, “Jika dia menemui saksi, kamu akan menjumpainya di sisi mimbar pada waktu petang. Jika dia tidak menemui saksi, kamu tidak akan menjumpainya.”  Maka ketika tiba waktu petang, mereka menjumpainya. Umar bertanya, “Wahai Abu Musa, adakah engkau menemui saksi?” Abu Musa menjawab, “Ya, Ubayy bin Ka'b.” Umar berkata, “Saksi yang adil.”  Umar bertanya kepada Ubayy bin Ka'b, “Wahai Abu Tufail, apakah yang dikatakan oleh Abu Musa ini?” Ubayy menjawab, “Wahai Ibnu Khattab, saya mendengar Rasulullah SAW bersabda seperti itu. Janganlah engkau menjadi keras kepada sahabat-sahabat Rasulullah SAW.” Umar berkata, “Maha Suci Allah, saya pernah mendengar sesuatu (yang serupa), tetapi saya ingin memastikannya.”"
  },
  {
    "id": 12765,
    "hadith_number": 5488,
    "tajuk_hadith": "Amaran terhadap Menyeksa Sahabat Rasulullah SAW",
    "perawi_melayu": "Hadis ini diriwayatkan melalui sanad yang sama daripada Talhah bin Yahya, dengan sedikit perbezaan lafaz:",
    "english_text": "He (Hadrat 'Umar) said: Abu Mundhir (the Kunya of Ubayy b. Ka'b), did you hear this from Allah's Messenger (ﷺ)? Thereupon he said: Yes. and he further said: Ibn Khattab, do not be a torment for the Companions of Allah's Messenger (may peace he upon him). No mention has, however, been made of the words of 'Umar:\" Hallowed be Allah\" and what follows subsequently.",
    "arabic_text": "وَحَدَّثَنَاهُ عَبْدُ اللَّهِ بْنُ عُمَرَ بْنِ مُحَمَّدِ بْنِ أَبَانٍ، حَدَّثَنَا عَلِيُّ بْنُ هَاشِمٍ، عَنْ طَلْحَةَ،\n بْنِ يَحْيَى بِهَذَا الإِسْنَادِ غَيْرَ أَنَّهُ قَالَ فَقَالَ يَا أَبَا الْمُنْذِرِ آنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ\n صلى الله عليه وسلم فَقَالَ نَعَمْ فَلاَ تَكُنْ يَا ابْنَ الْخَطَّابِ عَذَابًا عَلَى أَصْحَابِ رَسُولِ اللَّهِ\n صلى الله عليه وسلم ‏.‏ وَلَمْ يَذْكُرْ مِنْ قَوْلِ عُمَرَ سُبْحَانَ اللَّهِ ‏.‏ وَمَا بَعْدَهُ ‏.‏",
    "malay_translation": "Umar berkata: Wahai Abu Mundzir (kunyah Ubayy bin Ka'ab), adakah engkau mendengar ini daripada Rasulullah SAW?  Lalu dia menjawab: Ya.  Kemudian Umar berkata lagi: Wahai Ibnu Khattab, janganlah engkau menjadi penyeksa kepada sahabat-sahabat Rasulullah SAW.  Namun, riwayat ini tidak menyebut perkataan Umar, \"Maha Suci Allah\", dan apa yang berikutnya."
  },
  {
    "id": 12766,
    "hadith_number": 5489,
    "tajuk_hadith": "Rasulullah SAW Menyambut Tetamu",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan:",
    "english_text": "I came to Allah's Apostle (ﷺ) and called him (with a view to seeking permission). whereupon Allah's Apostle (ﷺ) said: Who is it? I said: It is I. Thereupon he (the Holy Prophet) came out saying: It is I. it is I.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ شُعْبَةَ، عَنْ \n مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَدَعَوْتُ\n فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَنْ هَذَا ‏\"‏ ‏.‏ قُلْتُ أَنَا ‏.‏ قَالَ فَخَرَجَ وَهُوَ يَقُولُ ‏\"‏ أَنَا\n أَنَا ‏\"‏ ‏.‏",
    "malay_translation": "Jabir bin Abdullah berkata: Aku datang kepada Rasulullah SAW dan memanggil baginda (untuk meminta izin). Maka Rasulullah SAW bertanya: “Siapa itu?” Aku menjawab: “Saya.”  Lalu baginda keluar sambil berkata: “Saya, saya.”"
  },
  {
    "id": 12767,
    "hadith_number": 5490,
    "tajuk_hadith": "Mencari Keizinan Berjumpa Rasulullah SAW",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan:",
    "english_text": "I sought permission from Allah's Messenger (may peace be upon him) to see him. He said: Who is it? I said: It is I. Thereupon Allah's Messenger (ﷺ) said: It is I. it is I (these words lead me to no conclusion).",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ - وَاللَّفْظُ لأَبِي بَكْرٍ - قَالَ يَحْيَى\n أَخْبَرَنَا وَقَالَ أَبُو بَكْرٍ، حَدَّثَنَا - وَكِيعٌ، عَنْ شُعْبَةَ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ،\n اللَّهِ قَالَ اسْتَأْذَنْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَنْ هَذَا ‏\"‏ ‏.‏ فَقُلْتُ أَنَا ‏.‏ فَقَالَ\n النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَنَا أَنَا ‏\"‏ ‏.‏",
    "malay_translation": "Jabir bin Abdullah berkata: Aku memohon izin untuk bertemu Rasulullah SAW. Baginda bertanya, \"Siapa itu?\" Aku menjawab, \"Saya.\"  Lalu Rasulullah SAW bersabda, \"Aku, Aku.\" (Perkataan Baginda ini tidak memberikan kefahaman kepadaku)."
  },
  {
    "id": 12768,
    "hadith_number": 5491,
    "tajuk_hadith": "Rasulullah SAW dan Keengganan terhadap Sesuatu",
    "perawi_melayu": "Hadis ini diriwayatkan melalui Shu'ba dengan sedikit perbezaan lafaz iaitu:",
    "english_text": "The Prophet (ﷺ) uttered these words: It is I. it is I.\" in the manner as if he disapproved of this.",
    "arabic_text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ، وَأَبُو عَامِرٍ الْعَقَدِيُّ ح وَحَدَّثَنَا \n مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي وَهْبُ بْنُ جَرِيرٍ، ح وَحَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ، حَدَّثَنَا بَهْزٌ، كُلُّهُمْ\n عَنْ شُعْبَةَ، بِهَذَا الإِسْنَادِ ‏.‏ وَفِي حَدِيثِهِمْ كَأَنَّهُ كَرِهَ ذَلِكَ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, “Aku, Aku,” dengan cara yang seakan-akan baginda tidak menyukai perkara itu."
  },
  {
    "id": 12769,
    "hadith_number": 5492,
    "tajuk_hadith": "Keperluan Mendapatkan Keizinan Sebelum Melihat",
    "perawi_melayu": "Sahl bin Sa'd as-Sa'idi",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَمُحَمَّدُ بْنُ رُمْحٍ، قَالاَ أَخْبَرَنَا اللَّيْثُ، - وَاللَّفْظُ لِيَحْيَى -\n ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، أَنَّ سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ، أَخْبَرَهُ \n أَنَّ رَجُلاً اطَّلَعَ فِي جُحْرٍ فِي بَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَمَعَ رَسُولِ اللَّهِ صلى\n الله عليه وسلم مِدْرًى يَحُكُّ بِهِ رَأْسَهُ فَلَمَّا رَآهُ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏\n لَوْ أَعْلَمُ أَنَّكَ تَنْظُرُنِي لَطَعَنْتُ بِهِ فِي عَيْنِكَ ‏\"‏ ‏.‏ وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏\n إِنَّمَا جُعِلَ الإِذْنُ مِنْ أَجْلِ الْبَصَرِ ‏\"‏ ‏.‏",
    "malay_translation": "Sahl bin Sa'd as-Sa'idi meriwayatkan bahawa seorang lelaki mengintai melalui lubang pada pintu Rasulullah SAW. Ketika itu, Rasulullah SAW sedang memegang alat penggaru dan menggaru kepalanya.  Apabila Rasulullah SAW melihatnya, baginda bersabda:  \"Sekiranya Aku tahu engkau sedang melihat Aku, nescaya Aku akan menusuknya ke matamu.\"  Dan Rasulullah SAW juga bersabda: \"Keizinan itu diberikan semata-mata untuk menjaga pandangan.\""
  },
  {
    "id": 12770,
    "hadith_number": 5493,
    "tajuk_hadith": "Mencari Keizinan Sebelum Memasuki",
    "perawi_melayu": "Sahl bin Sa'd As-Sa'idi meriwayatkan bahawa seseorang mengintai melalui lubang pintu Rasulullah SAW, dan baginda ketika itu sedang menyisir rambutnya dengan sesuatu yang runcing.  Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَنَّأَخْبَرَهُ أَنَّ رَجُلاً اطَّلَعَ مِنْ جُحْرٍ فِي بَابِ رَسُولِ اللَّهِ صلى الله\n عليه وسلم وَمَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم مِدْرًى يُرَجِّلُ بِهِ رَأْسَهُ فَقَالَ لَهُ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَوْ أَعْلَمُ أَنَّكَ تَنْظُرُ طَعَنْتُ بِهِ فِي عَيْنِكَ إِنَّمَا جَعَلَ اللَّهُ الإِذْنَ\n مِنْ أَجْلِ الْبَصَرِ ‏\"‏ ‏.‏",
    "malay_translation": "Sahl bin Sa’d As-Sa’idi meriwayatkan bahawa seorang lelaki mengintai melalui lubang pada pintu Rasulullah SAW. Ketika itu, Rasulullah SAW sedang menyisir rambut baginda menggunakan sesuatu yang runcing.  Rasulullah SAW bersabda kepadanya, \"Sekiranya Aku tahu engkau sedang mengintai, nescaya Aku akan menusuk mata mu dengannya.  Sesungguhnya Allah SWT mewajibkan meminta izin kerana menjaga pandangan.\""
  },
  {
    "id": 12771,
    "hadith_number": 5494,
    "tajuk_hadith": "Riwayat Hadis daripada Sahl bin Saad",
    "perawi_melayu": "Abu Bakar bin Abi Syaibah, Amru al-Naqid, Zuhair bin Harb, dan Ibnu Abi Umar meriwayatkan daripada Sufian bin Uyainah, dan Abu Kamil al-Jahdari meriwayatkan daripada Abdul Wahid bin Ziyad, dan Ma'mar meriwayatkan (keduanya daripada Az- Zuhri), daripada Sahl bin Saad, daripada Nabi SAW.",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، وَابْنُ أَبِي عُمَرَ،\n قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ح وَحَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ،\n حَدَّثَنَا مَعْمَرٌ، كِلاَهُمَا عَنِ الزُّهْرِيِّ، عَنْ سَهْلِ بْنِ سَعْدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَ\n حَدِيثِ اللَّيْثِ وَيُونُسَ ‏.‏",
    "malay_translation": "Abu Bakar bin Abi Syaibah, Amru al-Naqid, Zuhair bin Harb, dan Ibnu Abi Umar berkata: Kami telah meriwayatkan daripada Sufian bin Uyainah, dan Abu Kamil al-Jahdari meriwayatkan daripada Abdul Wahid bin Ziyad, dan Ma'mar meriwayatkan (keduanya daripada Az-Zuhri), daripada Sahl bin Saad, daripada Nabi SAW.  (dengan sedikit perbezaan lafaz)."
  },
  {
    "id": 12772,
    "hadith_number": 5495,
    "tajuk_hadith": "Rasulullah SAW Hampir Ditikam",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "I perceived as if Allah's Messenger (ﷺ) was going to pierce (his eyes).",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ وَقُتَيْبَةُ بْنُ سَعِيدٍ - وَاللَّفْظُ\n لِيَحْيَى وَأَبِي كَامِلٍ - قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عُبَيْدِ،\n اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَجُلاً، اطَّلَعَ مِنْ بَعْضِ حُجَرِ النَّبِيِّ صلى الله عليه\n وسلم فَقَامَ إِلَيْهِ بِمِشْقَصٍ أَوْ مَشَاقِصَ فَكَأَنِّي أَنْظُرُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم\n يَخْتِلُهُ لِيَطْعُنَهُ ‏.‏",
    "malay_translation": "Anas bin Malik meriwayatkan bahawa seorang lelaki mengintai dari salah satu lubang (pada pintu) Rasulullah SAW, lalu berdiri di hadapan baginda dengan sebatang anak panah atau beberapa batang anak panah.  Seakan-akan aku melihat Rasulullah SAW hampir sahaja akan ditikam."
  },
  {
    "id": 12773,
    "hadith_number": 5496,
    "tajuk_hadith": "Mengintai Rumah Orang Tanpa Kebenaran",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "He who peeped into the house of people without their consent, it is permissible for them to put out his eyes.",
    "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ \n النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنِ اطَّلَعَ فِي بَيْتِ قَوْمٍ بِغَيْرِ إِذْنِهِمْ فَقَدْ حَلَّ لَهُمْ أَنْ يَفْقَئُوا\n عَيْنَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa mengintai ke dalam rumah orang tanpa kebenaran mereka, maka dihalalkan bagi mereka untuk membutakan matanya."
  },
  {
    "id": 12774,
    "hadith_number": 5497,
    "tajuk_hadith": "Mempertahankan Privasi Rumah",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "If a person were to cast a glance in your (house) without permission, and you had in your hand a staff and you would have thrust that in his eyes, there is no harm for you.",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ،\n أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَوْ أَنَّ رَجُلاً اطَّلَعَ عَلَيْكَ بِغَيْرِ إِذْنٍ فَخَذَفْتَهُ\n بِحَصَاةٍ فَفَقَأْتَ عَيْنَهُ مَا كَانَ عَلَيْكَ مِنْ جُنَاحٍ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:  \"Sekiranya seseorang mengintip kamu tanpa izin, dan kamu memegang sebatang kayu lalu menusuk matanya, maka kamu tidak berdosa.\""
  },
  {
    "id": 12775,
    "hadith_number": 5498,
    "tajuk_hadith": "Menundukkan Pandangan",
    "perawi_melayu": "Jarir bin Abdullah meriwayatkan:",
    "english_text": "I asked Allah's Messenger (ﷺ) about the sudden glance (that is cast) on the face (of a non-Mahram). He commanded me that I should turn away my eyes.",
    "arabic_text": "حَدَّثَنِي قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،\n حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، كِلاَهُمَا عَنْ يُونُسَ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا هُشَيْمٌ،\n أَخْبَرَنَا يُونُسُ، عَنْ عَمْرِو بْنِ سَعِيدٍ، عَنْ أَبِي زُرْعَةَ، عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ، قَالَ سَأَلْتُ رَسُولَ\n اللَّهِ صلى الله عليه وسلم عَنْ نَظَرِ الْفُجَاءَةِ فَأَمَرَنِي أَنْ أَصْرِفَ بَصَرِي ‏.‏",
    "malay_translation": "Aku bertanya kepada Rasulullah SAW tentang pandangan sekilas (yang dilayangkan) ke wajah (wanita bukan mahram). Baginda memerintahkan aku supaya menundukkan pandanganku."
  },
  {
    "id": 12776,
    "hadith_number": 5499,
    "tajuk_hadith": "Sanad Hadis daripada Yunus",
    "perawi_melayu": "Yunus dan periwayat lain",
    "english_text": "This hadith has been narrated on the authority of Yunus through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الأَعْلَى، وَقَالَ، إِسْحَاقُ أَخْبَرَنَا وَكِيعٌ،\n حَدَّثَنَا سُفْيَانُ، كِلاَهُمَا عَنْ يُونُسَ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Yunus melalui beberapa sanad yang lain."
  }
]
