[
  {
    "id": 13012,
    "hadith_number": 5735,
    "tajuk_hadith": "Rasulullah s.a.w. Mendengar Sajak Umayya bin Abi Salt",
    "perawi_melayu": "Amr bin Sharid meriwayatkan daripada bapanya yang berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَابْنُ أَبِي عُمَرَ، كِلاَهُمَا عَنِ ابْنِ عُيَيْنَةَ، قَالَ ابْنُ أَبِي عُمَرَ\n حَدَّثَنَا سُفْيَانُ، عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ، عَنْ عَمْرِو بْنِ الشَّرِيدِ، عَنْ أَبِيهِ، قَالَ رَدِفْتُ رَسُولَ\n اللَّهِ صلى الله عليه وسلم يَوْمًا فَقَالَ ‏\"‏ هَلْ مَعَكَ مِنْ شِعْرِ أُمَيَّةَ بْنِ أَبِي الصَّلْتِ شَيْئًا ‏\"‏\n ‏.‏ قُلْتُ نَعَمْ قَالَ ‏\"‏ هِيهِ ‏\"‏ ‏.‏ فَأَنْشَدْتُهُ بَيْتًا فَقَالَ ‏\"‏ هِيهِ ‏\"‏ ‏.‏ ثُمَّ أَنْشَدْتُهُ بَيْتًا فَقَالَ ‏\"‏ هِيهِ\n ‏\"‏ ‏.‏ حَتَّى أَنْشَدْتُهُ مِائَةَ بَيْتٍ ‏.‏ \n وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، وَأَحْمَدُ بْنُ عَبْدَةَ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، عَنْ إِبْرَاهِيمَ،\n بْنِ مَيْسَرَةَ عَنْ عَمْرِو بْنِ الشَّرِيدِ، أَوْ يَعْقُوبَ بْنِ عَاصِمٍ عَنِ الشَّرِيدِ، قَالَ أَرْدَفَنِي رَسُولُ\n اللَّهِ صلى الله عليه وسلم خَلْفَهُ ‏.‏ فَذَكَرَ بِمِثْلِهِ ‏.‏",
    "malay_translation": "Kami diberitakan oleh `Amru al-Naqid dan Ibnu Abi `Umar, keduanya daripada Ibnu `Uyainah. Ibnu Abi `Umar berkata: Kami diberitakan oleh Sufyan, daripada Ibrahim bin Maisarah, daripada `Amr bin Syarid, daripada bapanya, katanya:  Pada suatu hari aku menunggang di belakang Rasulullah SAW, baginda bertanya: \"Adakah engkau mengetahui sebarang sajak daripada Umayya bin Abi Salt?\" Aku menjawab: \"Ya.\" Baginda berkata: \"Bacalah.\" Maka aku membacakan satu bait, baginda berkata: \"Bacalah.\" Kemudian aku membacakan satu bait lagi, baginda berkata: \"Bacalah.\"  Sehinggalah aku membacakan seratus bait. \n Dan Zuhair bin Harb dan Ahmad bin `Abdah meriwayatkan kepadaku, keduanya daripada Ibnu `Uyainah, daripada Ibrahim bin Maisarah, daripada `Amr bin Syarid atau Ya`qub bin `Asim daripada Syarid, katanya: Rasulullah SAW membonceng aku di belakang baginda. Maka baginda menyebut perkara yang serupa."
  },
  {
    "id": 13013,
    "hadith_number": 5736,
    "tajuk_hadith": "Umayya hampir memeluk Islam",
    "perawi_melayu": "Amr bin Sharid meriwayatkan daripada bapanya bahawa Rasulullah SAW meminta dia untuk membaca syair, baki hadis adalah sama, tetapi dengan tambahan ini:",
    "english_text": "\"He (that is Umayya b. Abu Salt) was about to become a Muslim\", and in the hadith transmitted on the authority of Ibn Mahdi (the words are) \"He was almost a Muslim in his poetry.\"",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، ح وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ،\n حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، كِلاَهُمَا عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الطَّائِفِيِّ، عَنْ عَمْرِو،\n بْنِ الشَّرِيدِ عَنْ أَبِيهِ، قَالَ اسْتَنْشَدَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ بِمِثْلِ حَدِيثِ إِبْرَاهِيمَ\n بْنِ مَيْسَرَةَ وَزَادَ قَالَ ‏\"‏ إِنْ كَادَ لَيُسْلِمُ ‏\"‏ ‏.‏ وَفِي حَدِيثِ ابْنِ مَهْدِيٍّ قَالَ ‏\"‏ فَلَقَدْ كَادَ يُسْلِمُ\n فِي شِعْرِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Yahya bin Yahya, memberitakan kepada kami Al-Mu'tamir bin Sulaiman, dan telah menceritakan kepada kami Zuhari bin Harb, telah menceritakan kepada kami Abdur Rahman bin Mahdi, keduanya daripada Abdullah bin Abdur Rahman Ath-Thaifi, daripada Amr bin Syarid daripada bapanya, bahawa Rasulullah SAW telah meminta kepadaku untuk membaca syair yang serupa dengan hadis Ibrahim bin Maisarah dan menambah, katanya: \"Sesungguhnya dia hampir memeluk Islam.\" Dan dalam hadis daripada Ibnu Mahdi berkata: \"Sesungguhnya dia hampir memeluk Islam dalam syairnya.\""
  },
  {
    "id": 13014,
    "hadith_number": 5737,
    "tajuk_hadith": "Kata-kata Terbenar Puisi Arab Pra-Islam",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The truest word spoken by an Arab (pre-Islamic) in poetry is this verse of Labid: \"Behold! apart from Allah everything is vain.\"",
    "arabic_text": "حَدَّثَنِي أَبُو جَعْفَرٍ، مُحَمَّدُ بْنُ الصَّبَّاحِ وَعَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ جَمِيعًا عَنْ شَرِيكٍ،\n قَالَ ابْنُ حُجْرٍ أَخْبَرَنَا شَرِيكٌ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ \n النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَشْعَرُ كَلِمَةٍ تَكَلَّمَتْ بِهَا الْعَرَبُ كَلِمَةُ لَبِيدٍ أَلاَ كُلُّ شَىْءٍ\n مَا خَلاَ اللَّهَ بَاطِلٌ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Kata-kata yang paling benar yang pernah diucapkan oleh orang Arab (pra-Islam) dalam bentuk puisi ialah bait syair Labid:  'Ketahuilah! Segala sesuatu selain daripada Allah adalah sia-sia.'\""
  },
  {
    "id": 13015,
    "hadith_number": 5738,
    "tajuk_hadith": "Kata-kata Benar Penyair Labid",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The truest word uttered by a poet is this verse of Labid: \"Behold! apart from Allah everything is vain,\" and Umayya b. Abu Salt was almost a Muslim.",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ، حَدَّثَنَا ابْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ عَبْدِ الْمَلِكِ،\n بْنِ عُمَيْرٍ حَدَّثَنَا أَبُو سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏\n أَصْدَقُ كَلِمَةٍ قَالَهَا شَاعِرٌ كَلِمَةُ لَبِيدٍ أَلاَ كُلُّ شَىْءٍ مَا خَلاَ اللَّهَ بَاطِلٌ وَكَادَ أُمَيَّةُ بْنُ أَبِي الصَّلْتِ\n أَنْ يُسْلِمَ ‏\"‏ ‏.‏",
    "malay_translation": "Sabda Rasulullah SAW:  “Kata-kata yang paling benar yang pernah diucapkan oleh seorang penyair ialah bait puisi Labid:  'Ketahuilah, bahawa segala sesuatu selain daripada Allah adalah sia-sia.'  Dan Umayyah bin Abi Salt hampir memeluk Islam.”"
  },
  {
    "id": 13016,
    "hadith_number": 5739,
    "tajuk_hadith": "Bait Puisi Yang Paling Benar",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The truest verse recited by a poet is: \"Behold! apart from Allah everything is vain,\" and Ibn Abu Salt was almost a Muslim.",
    "arabic_text": "وَحَدَّثَنِي ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ زَائِدَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ \n أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏\n أَصْدَقُ بَيْتٍ قَالَهُ الشَّاعِرُ أَلاَ كُلُّ شَىْءٍ مَا خَلاَ اللَّهَ بَاطِلٌ وَكَادَ ابْنُ أَبِي الصَّلْتِ أَنْ يُسْلِمَ\n ‏\"‏ ‏.‏",
    "malay_translation": "Bait puisi yang paling benar ialah: \"Sesungguhnya, selain Allah SWT, semuanya adalah batil.\"  Dan Ibn Abu Salt hampir memeluk Islam."
  },
  {
    "id": 13017,
    "hadith_number": 5740,
    "tajuk_hadith": "Bait Puisi Paling Benar",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The truest couplet recited by a poet is: \"Behold! apart from Allah everything is vain,\" and he made no addition to it.",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ بْنِ،\n عُمَيْرٍ عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَصْدَقُ بَيْتٍ\n قَالَتْهُ الشُّعَرَاءُ أَلاَ كُلُّ شَىْءٍ مَا خَلاَ اللَّهَ بَاطِلٌ ‏\"‏ ‏.‏",
    "malay_translation": "Bait puisi yang paling benar yang pernah diungkapkan oleh penyair ialah: \"Ketahuilah! Segala sesuatu kecuali Allah adalah batil.\" Dan beliau tidak menambah apa-apa lagi kepadanya."
  },
  {
    "id": 13018,
    "hadith_number": 5741,
    "tajuk_hadith": "Kata-kata Benar Puisi Labid",
    "perawi_melayu": "Abu Hurairah meriwayatkan:",
    "english_text": "I heard Allah's Messenger (ﷺ) as saying: The truest word which the poet stated is the word of Labid: \"Behold! apart from Allah everything is vain.\"",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا يَحْيَى بْنُ زَكَرِيَّاءَ، عَنْ إِسْرَائِيلَ، عَنْ عَبْدِ الْمَلِكِ،\n بْنِ عُمَيْرٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ\n صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ أَصْدَقَ كَلِمَةٍ قَالَهَا شَاعِرٌ كَلِمَةُ لَبِيدٍ أَلاَ كُلُّ شَىْءٍ مَا خَلاَ\n اللَّهَ بَاطِلٌ ‏\"‏ ‏.‏ مَا زَادَ عَلَى ذَلِكَ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda:  \"Sesungguhnya kata-kata yang paling benar yang diucapkan oleh seorang penyair ialah kata-kata Labid: 'Ketahuilah! Segala sesuatu selain Allah adalah batil.'"
  },
  {
    "id": 13019,
    "hadith_number": 5742,
    "tajuk_hadith": "Lebih Baik Perut Penuh Nanah Daripada Hati Penuh Syair",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "It is better for a man's belly to be stuffed with pus which corrodes it than to stuff (one's mind) with frivolous poetry. Abu Bakr has reported it with a slight variation of wording.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصٌ، وَأَبُو مُعَاوِيَةَ ح وَحَدَّثَنَا أَبُو كُرَيْبٍ،\n حَدَّثَنَا أَبُو مُعَاوِيَةَ، كِلاَهُمَا عَنِ الأَعْمَشِ، ح وَحَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا \n الأَعْمَشُ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏\n لأَنْ يَمْتَلِئَ جَوْفُ الرَّجُلِ قَيْحًا يَرِيهِ خَيْرٌ مِنْ أَنْ يَمْتَلِئَ شِعْرًا ‏\"‏ ‏.‏ قَالَ أَبُو بَكْرٍ إِلاَّ أَنَّ حَفْصًا\n لَمْ يَقُلْ ‏\"‏ يَرِيهِ ‏\"‏ ‏.‏",
    "malay_translation": "Lebih baik perut seseorang itu dipenuhi nanah yang menghakisnya daripada dipenuhi dengan syair-syair yang sia-sia.  Abu Bakar meriwayatkannya dengan sedikit perbezaan lafaz."
  },
  {
    "id": 13020,
    "hadith_number": 5743,
    "tajuk_hadith": "Lebih Baik Perut Penuh Nanah Daripada Hati Penuh Puisi",
    "perawi_melayu": "Sa'd meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "It is better for the belly of any one of you to be stuffed with pus rather than to stuff (one's mind) with poetry.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ،\n عَنْ قَتَادَةَ، عَنْ يُونُسَ بْنِ جُبَيْرٍ، عَنْ مُحَمَّدِ بْنِ سَعْدٍ، عَنْ سَعْدٍ، عَنِ النَّبِيِّ صلى الله عليه\n وسلم قَالَ ‏\n\"‏ لأَنْ يَمْتَلِئَ جَوْفُ أَحَدِكُمْ قَيْحًا يَرِيهِ خَيْرٌ مِنْ أَنْ يَمْتَلِئَ شِعْرًا ‏\"‏ ‏.‏",
    "malay_translation": "Lebih baik perut seseorang di antara kamu dipenuhi nanah daripada dipenuhi puisi."
  },
  {
    "id": 13021,
    "hadith_number": 5744,
    "tajuk_hadith": "Keutamaan Menjauhi Syair daripada Mengisi Otak",
    "perawi_melayu": "Abu Sa'id Al-Khudri meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ الثَّقَفِيُّ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ الْهَادِ، عَنْ يُحَنِّسَ، مَوْلَى مُصْعَبِ\n بْنِ الزُّبَيْرِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ بَيْنَا نَحْنُ نَسِيرُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم\n بِالْعَرْجِ إِذْ عَرَضَ شَاعِرٌ يُنْشِدُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ خُذُوا الشَّيْطَانَ\n أَوْ أَمْسِكُوا الشَّيْطَانَ لأَنْ يَمْتَلِئَ جَوْفُ رَجُلٍ قَيْحًا خَيْرٌ لَهُ مِنْ أَنْ يَمْتَلِئَ شِعْرًا ‏\"‏ ‏.‏",
    "malay_translation": "Kami sedang berjalan bersama Rasulullah SAW di Arj, ketika tiba-tiba seorang penyair muncul dan membacakan syairnya.  Maka Rasulullah SAW bersabda: “Tangkaplah syaitan itu atau tahanlah syaitan itu.  Sesungguhnya perut seseorang yang penuh nanah adalah lebih baik baginya daripada otaknya yang penuh dengan syair.”"
  },
  {
    "id": 13022,
    "hadith_number": 5745,
    "tajuk_hadith": "Larangan Bermain Nardashir",
    "perawi_melayu": "Buraidah meriwayatkan daripada bapanya bahawa Rasulullah SAW bersabda:",
    "english_text": "He who played Nardashir (a game similar to backgammon) is like one who dyed his hand with the flesh and blood of swine.",
    "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ عَلْقَمَةَ بْنِ،\n مَرْثَدٍ عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ لَعِبَ بِالنَّرْدَشِيرِ\n فَكَأَنَّمَا صَبَغَ يَدَهُ فِي لَحْمِ خِنْزِيرٍ وَدَمِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa yang bermain Nardashir (sejenis permainan seperti dam), maka seakan-akan dia telah mewarnakan tangannya dengan daging dan darah babi."
  }
]
