[
  {
    "id": 14148,
    "hadith_number": 6871,
    "tajuk_hadith": "Berat Badan di Hari Kiamat",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "A bulky person would be brought on the Day of judgment and he would not carry the weight to the eye of Allah equal even to that of a gnat. Nor shall We set up a balance for them on the Day of Resurrection\" (xviii. 105).",
    "arabic_text": "حَدَّثَنِي أَبُو بَكْرِ بْنُ إِسْحَاقَ، حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنِي الْمُغِيرَةُ، - يَعْنِي الْحِزَامِيَّ\n - عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ\n ‏\"‏ إِنَّهُ لَيَأْتِي الرَّجُلُ الْعَظِيمُ السَّمِينُ يَوْمَ الْقِيَامَةِ لاَ يَزِنُ عِنْدَ اللَّهِ جَنَاحَ بَعُوضَةٍ اقْرَءُوا ‏{‏\n فَلاَ نُقِيمُ لَهُمْ يَوْمَ الْقِيَامَةِ وَزْنًا‏}‏ ‏\"‏ ‏.‏",
    "malay_translation": "Sesungguhnya akan datang pada hari kiamat nanti seorang lelaki yang besar dan gemuk, tetapi beratnya di sisi Allah tidak sama dengan berat sayap nyamuk. Bacalah:  \"Maka Kami tidak akan menimbangkan mereka pada hari kiamat.\" (al-Kahfi 18:105)"
  },
  {
    "id": 14149,
    "hadith_number": 6872,
    "tajuk_hadith": "Allah SWT memegang seluruh alam pada Hari Kiamat",
    "perawi_melayu": "Abdullah bin Mas'ud meriwayatkan bahawa seorang ulama Yahudi datang kepada Rasulullah SAW dan berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ، حَدَّثَنَا فُضَيْلٌ، - يَعْنِي ابْنَ عِيَاضٍ - عَنْ \n مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَبِيدَةَ السَّلْمَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ جَاءَ حَبْرٌ إِلَى النَّبِيِّ\n صلى الله عليه وسلم فَقَالَ يَا مُحَمَّدُ أَوْ يَا أَبَا الْقَاسِمِ إِنَّ اللَّهَ تَعَالَى يُمْسِكُ السَّمَوَاتِ يَوْمَ\n الْقِيَامَةِ عَلَى إِصْبَعٍ وَالأَرَضِينَ عَلَى إِصْبَعٍ وَالْجِبَالَ وَالشَّجَرَ عَلَى إِصْبَعٍ وَالْمَاءَ وَالثَّرَى\n عَلَى إِصْبَعٍ وَسَائِرَ الْخَلْقِ عَلَى إِصْبَعٍ ثُمَّ يَهُزُّهُنَّ فَيَقُولُ أَنَا الْمَلِكُ أَنَا الْمَلِكُ ‏.‏ فَضَحِكَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم تَعَجُّبًا مِمَّا قَالَ الْحَبْرُ تَصْدِيقًا لَهُ ثُمَّ قَرَأَ ‏{‏ وَمَا قَدَرُوا اللَّهَ حَقَّ\n قَدْرِهِ وَالأَرْضُ جَمِيعًا قَبْضَتُهُ يَوْمَ الْقِيَامَةِ وَالسَّمَوَاتُ مَطْوِيَّاتٌ بِيَمِينِهِ سُبْحَانَهُ وَتَعَالَى عَمَّا\n يُشْرِكُونَ‏}‏",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Abdullah bin Yunus, telah menceritakan kepada kami Fudhail - iaitu Ibnu Iyadh - daripada Mansur, daripada Ibrahim, daripada Abidah As-Salmani, daripada Abdullah bin Mas'ud, katanya:  Seorang ulama Yahudi datang kepada Nabi SAW, lalu berkata: Wahai Muhammad, atau wahai Abu Al-Qasim, sesungguhnya Allah SWT akan memegang langit pada hari kiamat di atas satu jari, dan bumi di atas satu jari, dan gunung-ganang serta pepohonan di atas satu jari, dan air dan tanah di atas satu jari, dan seluruh makhluk di atas satu jari. Kemudian Allah SWT akan menggoncangkannya lalu berfirman: Akulah Raja, Akulah Raja. Maka Rasulullah SAW tersenyum hairan dengan apa yang dikatakan oleh ulama itu sebagai tanda pengesahan, kemudian Baginda membaca:  \"Dan mereka tidak mengagungkan Allah dengan pengagungan yang sepatutnya, dan bumi seluruhnya akan berada dalam genggaman-Nya pada hari kiamat, dan langit digulung di tangan kanan-Nya. Maha Suci Allah dan Maha Tinggi dari apa yang mereka sekutukan.\" (Az-Zumar: 67)."
  },
  {
    "id": 14150,
    "hadith_number": 6873,
    "tajuk_hadith": "Ulama Yahudi dan Senyuman Rasulullah SAW",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Mansur dengan sanad yang sama (dan katanya):",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، كِلاَهُمَا عَنْ جَرِيرٍ، عَنْ مَنْصُورٍ،\n بِهَذَا الإِسْنَادِ قَالَ جَاءَ حَبْرٌ مِنَ الْيَهُودِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ\n فُضَيْلٍ وَلَمْ يَذْكُرْ ثُمَّ يَهُزُّهُنَّ ‏.‏ وَقَالَ فَلَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم ضَحِكَ\n حَتَّى بَدَتْ نَوَاجِذُهُ تَعَجُّبًا لِمَا قَالَ تَصْدِيقًا لَهُ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏\n ‏{‏ وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ‏}‏ ‏\"‏ ‏.‏ وَتَلاَ الآيَةَ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Usman bin Abi Syaibah, dan Ishaq bin Ibrahim, keduanya daripada Jarir, daripada Mansur, dengan sanad ini berkata:  Seorang ulama dari kalangan Yahudi datang kepada Rasulullah SAW dengan seumpamanya hadis Fudhail dan tidak menyebut “kemudian Baginda menggoncangkannya”.  Dan beliau berkata: “Sesungguhnya aku telah melihat Rasulullah SAW tersenyum sehingga nampak gigi hadapan Baginda, tanda kagum atas apa yang dikatakannya sebagai pengesahan kepadanya. Kemudian Rasulullah SAW bersabda:  {وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ}  dan Baginda membaca ayat tersebut."
  },
  {
    "id": 14151,
    "hadith_number": 6874,
    "tajuk_hadith": "Allah SWT Maha Kuasa",
    "perawi_melayu": "Abdullah meriwayatkan bahawa seorang lelaki daripada Ahli Kitab datang kepada Rasulullah SAW dan berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ سَمِعْتُ إِبْرَاهِيمَ،\n يَقُولُ سَمِعْتُ عَلْقَمَةَ، يَقُولُ قَالَ عَبْدُ اللَّهِ جَاءَ رَجُلٌ مِنْ أَهْلِ الْكِتَابِ إِلَى رَسُولِ اللَّهِ صلى\n الله عليه وسلم فَقَالَ يَا أَبَا الْقَاسِمِ إِنَّ اللَّهَ يُمْسِكُ السَّمَوَاتِ عَلَى إِصْبَعٍ وَالأَرَضِينَ عَلَى\n إِصْبَعٍ وَالشَّجَرَ وَالثَّرَى عَلَى إِصْبَعٍ وَالْخَلاَئِقَ عَلَى إِصْبَعٍ ثُمَّ يَقُولُ أَنَا الْمَلِكُ أَنَا الْمَلِكُ ‏.‏\n قَالَ فَرَأَيْتُ النَّبِيَّ صلى الله عليه وسلم ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ ثُمَّ قَرَأَ ‏{‏ وَمَا قَدَرُوا اللَّهَ\n حَقَّ قَدْرِهِ‏}‏",
    "malay_translation": "Umar bin Hafs bin Ghiyats telah meriwayatkan daripada bapanya, yang meriwayatkan daripada al-A'masy, yang berkata: Aku mendengar Ibrahim berkata: Aku mendengar Alqamah berkata: Abdullah berkata: Seorang lelaki daripada Ahli Kitab datang kepada Rasulullah SAW, lalu berkata: Wahai Abu al-Qasim, sesungguhnya Allah SWT memegang langit di atas satu jari, dan bumi di atas satu jari, dan pokok-pokok serta tanah di atas satu jari, dan seluruh makhluk di atas satu jari, kemudian Allah SWT berfirman: \"Akulah Raja, Akulah Raja.\"  Kemudian aku melihat Nabi SAW tersenyum sehingga kelihatan gigi hadapannya, lalu baginda membaca ayat:  \"Dan mereka tidak mengukur kekuasaan Allah SWT dengan hak pengukurannya.\" (Surah az-Zumar 39:67)."
  },
  {
    "id": 14152,
    "hadith_number": 6875,
    "tajuk_hadith": "Perbezaan Ringkas Dalam Riwayat Hadis",
    "perawi_melayu": "Daripada al-A'mash melalui beberapa sanad",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا إِسْحَاقُ،\n بْنُ إِبْرَاهِيمَ وَعَلِيُّ بْنُ خَشْرَمٍ قَالاَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، ح وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي،\n شَيْبَةَ حَدَّثَنَا جَرِيرٌ، كُلُّهُمْ عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّ فِي، حَدِيثِهِمْ جَمِيعًا وَالشَّجَرَ\n عَلَى إِصْبَعٍ وَالثَّرَى عَلَى إِصْبَعٍ وَلَيْسَ فِي حَدِيثِ جَرِيرٍ وَالْخَلاَئِقَ عَلَى إِصْبَعٍ ‏.‏ وَلَكِنْ فِي\n حَدِيثِهِ وَالْجِبَالَ عَلَى إِصْبَعٍ ‏.‏ وَزَادَ فِي حَدِيثِ جَرِيرٍ تَصْدِيقًا لَهُ تَعَجُّبًا لِمَا قَالَ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Bakar bin Abi Syaibah dan Abu Kuraib, mereka berdua berkata: Telah menceritakan kepada kami Abu Muawiyah. Dan telah menceritakan kepada kami Ishak bin Ibrahim dan Ali bin Khasram, mereka berdua berkata: Telah memberitakan kepada kami Isa bin Yunus. Dan telah menceritakan kepada kami Usman bin Abi Syaibah, telah menceritakan kepada kami Jarir. Kesemuanya daripada al-A'mash, dengan sanad yang sama, kecuali terdapat sedikit perbezaan perkataan dalam riwayat mereka.  Dalam semua riwayat tersebut menyebut: “…dan pokok-pokok kayu di atas satu jari dan tanah di atas satu jari…”  Manakala dalam riwayat Jarir tidak menyebut “…dan makhluk-makhluk di atas satu jari…”, tetapi menyebut “…dan gunung-ganang di atas satu jari…”.  Dan tambahan dalam riwayat Jarir adalah sebagai penegasan dan tanda hairan terhadap apa yang telah disebutkan."
  },
  {
    "id": 14153,
    "hadith_number": 6876,
    "tajuk_hadith": "Allah SWT sebagai Raja Sejagat pada Hari Kiamat",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Allah, the Exalted and Glorious, will take in His grip the Earth on the Day of Judgment and He would roll up the sky in His right hand and would say: I am the Lord; where are the sovereigns of the world?",
    "arabic_text": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي \n ابْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، كَانَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَقْبِضُ اللَّهُ\n تَبَارَكَ وَتَعَالَى الأَرْضَ يَوْمَ الْقِيَامَةِ وَيَطْوِي السَّمَاءَ بِيَمِينِهِ ثُمَّ يَقُولُ أَنَا الْمَلِكُ أَيْنَ مُلُوكُ\n الأَرْضِ ‏\"‏ ‏.‏",
    "malay_translation": "Allah SWT Yang Maha Mulia lagi Maha Agung akan menggenggam bumi pada Hari Kiamat, dan Dia akan melipat langit dengan tangan kanan-Nya, kemudian Dia akan berfirman: \"Akulah Raja, di manakah raja-raja bumi?\""
  },
  {
    "id": 14154,
    "hadith_number": 6877,
    "tajuk_hadith": "Allah SWT dan Kebesaran-Nya pada Hari Kiamat",
    "perawi_melayu": "Abdullah bin Umar meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Allah, the Exalted and Glorious, would fold the Heavens on the Day of Judgment and then He would place them on His right hand and say: I am the Lord; where are the haughty and where are the proud (today)? He would fold the' earth (placing it) on the left hand and say: I am the Lord; where are the haughty and where are the proud (today)?",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عُمَرَ بْنِ حَمْزَةَ، عَنْ سَالِمِ،\n بْنِ عَبْدِ اللَّهِ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَطْوِي\n اللَّهُ عَزَّ وَجَلَّ السَّمَوَاتِ يَوْمَ الْقِيَامَةِ ثُمَّ يَأْخُذُهُنَّ بِيَدِهِ الْيُمْنَى ثُمَّ يَقُولُ أَنَا الْمَلِكُ أَيْنَ الْجَبَّارُونَ\n أَيْنَ الْمُتَكَبِّرُونَ ثُمَّ يَطْوِي الأَرَضِينَ بِشِمَالِهِ ثُمَّ يَقُولُ أَنَا الْمَلِكُ أَيْنَ الْجَبَّارُونَ أَيْنَ الْمُتَكَبِّرُونَ\n ‏\"‏ ‏.‏",
    "malay_translation": "Pada hari kiamat, Allah SWT akan melipat langit, kemudian memegangnya dengan tangan kanan-Nya dan berfirman: \"Akulah Raja, di manakah orang-orang yang angkuh dan sombong?\"  Kemudian Dia akan melipat bumi dengan tangan kiri-Nya dan berfirman: \"Akulah Raja, di manakah orang-orang yang angkuh dan sombong?\""
  },
  {
    "id": 14155,
    "hadith_number": 6878,
    "tajuk_hadith": "Allah SWT Memegang Langit dan Bumi",
    "perawi_melayu": "Abdullah bin Miqsam melaporkan bahawa beliau melihat Abdullah bin Umar ketika beliau meriwayatkan sabda Rasulullah SAW:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ - حَدَّثَنِي أَبُو\n حَازِمٍ عَنْ عُبَيْدِ اللَّهِ بْنِ مِقْسَمٍ، أَنَّهُ نَظَرَ إِلَى عَبْدِ اللَّهِ بْنِ عُمَرَ كَيْفَ يَحْكِي رَسُولَ اللَّهِ صلى\n الله عليه وسلم قَالَ ‏\n\"‏ يَأْخُذُ اللَّهُ عَزَّ وَجَلَّ سَمَوَاتِهِ وَأَرَضِيهِ بِيَدَيْهِ فَيَقُولُ أَنَا اللَّهُ - وَيَقْبِضُ\n أَصَابِعَهُ وَيَبْسُطُهَا - أَنَا الْمَلِكُ ‏\"‏ حَتَّى نَظَرْتُ إِلَى الْمِنْبَرِ يَتَحَرَّكُ مِنْ أَسْفَلِ شَىْءٍ مِنْهُ حَتَّى\n إِنِّي لأَقُولُ أَسَاقِطٌ هُوَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم",
    "malay_translation": "Allah SWT mengambil langit dan bumi dengan kedua tangan-Nya, lalu berfirman: \"Akulah Allah.\"  Kemudian Dia menggenggam jari-jari-Nya, lalu membukanya (dan berfirman): \"Akulah Tuhan kamu.\"  Sehinggakan aku melihat mimbar itu bergoncang dari bawah, sehingga aku berkata dalam hati:  'Mungkin ia akan runtuh dengan Rasulullah SAW di atasnya.'"
  },
  {
    "id": 14156,
    "hadith_number": 6879,
    "tajuk_hadith": "Allah SWT memegang langit dan bumi",
    "perawi_melayu": "Abdullah bin Miqsam meriwayatkan daripada Abdullah bin Umar bahawa:",
    "english_text": "I saw Allah'h Messenger (ﷺ) upon the pulpit and he was saying that the Mighty Lord, the Exalted and Glorious would take hold of the Heavens and earth in His hand. The rest of the hadith is the same,",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، حَدَّثَنِي أَبِي، عَنْ عُبَيْدِ،\n اللَّهِ بْنِ مِقْسَمٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى الْمِنْبَرِ\n وَهُوَ يَقُولُ ‏\n\"‏ يَأْخُذُ الْجَبَّارُ عَزَّ وَجَلَّ سَمَوَاتِهِ وَأَرَضِيهِ بِيَدَيْهِ ‏\"‏ ‏.‏ ثُمَّ ذَكَرَ نَحْوَ حَدِيثِ يَعْقُوبَ\n ‏.‏",
    "malay_translation": "Aku melihat Rasulullah ﷺ di atas mimbar dan baginda sedang berkata, \"Allah Yang Maha Perkasa lagi Maha Mulia memegang langit dan bumi di antara kedua telapak tangan-Nya.\" Kemudian baginda menyebut sesuatu yang hampir sama dengan hadis Ya'qub."
  },
  {
    "id": 14157,
    "hadith_number": 6880,
    "tajuk_hadith": "Penciptaan Alam Semesta Menurut Hadis",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW memegang tangan saya dan berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ، وَهَارُونُ بْنُ عَبْدِ اللَّهِ، قَالاَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ،\n قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي إِسْمَاعِيلُ بْنُ أُمَيَّةَ، عَنْ أَيُّوبَ بْنِ خَالِدٍ، عَنْ عَبْدِ اللَّهِ بْنِ رَافِعٍ،\n مَوْلَى أُمِّ سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ، قَالَ أَخَذَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَدِي فَقَالَ ‏\n\"‏\n خَلَقَ اللَّهُ عَزَّ وَجَلَّ التُّرْبَةَ يَوْمَ السَّبْتِ وَخَلَقَ فِيهَا الْجِبَالَ يَوْمَ الأَحَدِ وَخَلَقَ الشَّجَرَ يَوْمَ الاِثْنَيْنِ\n وَخَلَقَ الْمَكْرُوهَ يَوْمَ الثُّلاَثَاءِ وَخَلَقَ النُّورَ يَوْمَ الأَرْبِعَاءِ وَبَثَّ فِيهَا الدَّوَابَّ يَوْمَ الْخَمِيسِ وَخَلَقَ\n آدَمَ عَلَيْهِ السَّلاَمُ بَعْدَ الْعَصْرِ مِنْ يَوْمِ الْجُمُعَةِ فِي آخِرِ الْخَلْقِ وَفِي آخِرِ سَاعَةٍ مِنْ سَاعَاتِ\n الْجُمُعَةِ فِيمَا بَيْنَ الْعَصْرِ إِلَى اللَّيْلِ ‏\"‏ ‏.‏ \n قَالَ إِبْرَاهِيمُ حَدَّثَنَا الْبِسْطَامِيُّ، - وَهُوَ الْحُسَيْنُ بْنُ عِيسَى - وَسَهْلُ بْنُ عَمَّارٍ\n وَإِبْرَاهِيمُ ابْنُ بِنْتِ حَفْصٍ وَغَيْرُهُمْ عَنْ حَجَّاجٍ، بِهَذَا الْحَدِيثِ ‏.‏",
    "malay_translation": "Suriah bin Yunus dan Harun bin Abdullah berkata:  Hajjaj bin Muhammad meriwayatkan daripada Ibn Juraij yang memberitahu bahawa Ismail bin Umayyah memberitahu daripada Ayub bin Khalid, daripada Abdullah bin Rafi', hamba kepada Ummu Salamah, daripada Abu Hurairah, bahawa Rasulullah SAW memegang tangannya dan bersabda:\n\n\"Allah SWT menciptakan tanah pada hari Sabtu, dan Dia menciptakan gunung-ganang di dalamnya pada hari Ahad, dan Dia menciptakan pokok-pokok pada hari Isnin, dan Dia menciptakan perkara-perkara yang menyusahkan pada hari Selasa, dan Dia menciptakan cahaya pada hari Rabu, dan Dia menyebarkan binatang-binatang di dalamnya pada hari Khamis, dan Dia menciptakan Adam AS selepas Asar pada hari Jumaat, sebagai makhluk terakhir pada saat terakhir waktu Jumaat, iaitu antara waktu Asar hingga malam.\"\n\nIbrahim berkata: Al-Bistami ( iaitu Hussein bin Isa ), Sahl bin Ammar, Ibrahim bin binti Hafs dan yang lain lagi meriwayatkan hadis ini daripada Hajjaj."
  },
  {
    "id": 14158,
    "hadith_number": 6881,
    "tajuk_hadith": "Perhimpunan Manusia di Hari Kiamat",
    "perawi_melayu": "Sahl bin Sa'd meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The people will be assembled on the Day of Resurrection on a white plain with a reddish tinge like the loaf of white bread with no marks set up for anyone.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ أَبِي،\n كَثِيرٍ حَدَّثَنِي أَبُو حَازِمِ بْنُ دِينَارٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم ‏\n\"‏ يُحْشَرُ النَّاسُ يَوْمَ الْقِيَامَةِ عَلَى أَرْضٍ بَيْضَاءَ عَفْرَاءَ كَقُرْصَةِ النَّقِيِّ لَيْسَ فِيهَا\n عَلَمٌ لأَحَدٍ ‏\"‏ ‏.‏",
    "malay_translation": "Manusia akan dikumpulkan pada Hari Kiamat di atas tanah yang putih sedikit kekuningan, seperti sekeping roti yang bersih, tanpa sebarang tanda untuk sesiapa pun."
  },
  {
    "id": 14159,
    "hadith_number": 6882,
    "tajuk_hadith": "Keadaan Manusia pada Hari Pertukaran Bumi dan Langit",
    "perawi_melayu": "Aisyah meriwayatkan:",
    "english_text": "I asked Allah's Messenger (ﷺ) about the words of Allah, the Exalted and Glorious:\" The day when the earth would be changed for another earth and Heaven would be changed for another Heaven (XiV. 48), (and inquired: ) (Allah's Messenger), where would the people be on that day? He said: They would be on the Sirat.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ دَاوُدَ، عَنِ الشَّعْبِيِّ، عَنْ \n مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ قَوْلِهِ عَزَّ وَجَلَّ ‏{‏\n يَوْمَ تُبَدَّلُ الأَرْضُ غَيْرَ الأَرْضِ وَالسَّمَوَاتُ‏}‏ فَأَيْنَ يَكُونُ النَّاسُ يَوْمَئِذٍ يَا رَسُولَ اللَّهِ فَقَالَ\n ‏\"‏ عَلَى الصِّرَاطِ ‏\"‏ ‏.‏",
    "malay_translation": "Aisyah berkata: Saya bertanya kepada Rasulullah ﷺ tentang firman Allah SWT: \"Pada hari bumi digantikan dengan bumi yang lain dan langit dengan langit yang lain.\" (Ibrahim: 48).  Lalu saya bertanya: Wahai Rasulullah, di manakah manusia pada hari itu? Baginda menjawab: \"Di atas Sirat.\""
  },
  {
    "id": 14160,
    "hadith_number": 6883,
    "tajuk_hadith": "Jamuan untuk Ahli Syurga di Hari Kiamat",
    "perawi_melayu": "Abu Said al-Khudri meriwayatkan bahawa Rasulullah SAW bersabda bahawa bumi akan menjadi satu roti pada Hari Kiamat dan Yang Maha Kuasa akan memutarnya di tangan-Nya sebagaimana salah seorang daripada kamu memutar sebuku roti ketika dalam perjalanan. Ia akan menjadi jamuan yang disediakan untuk penghormatan kepada ahli-ahli Syurga.  Dia (perawi) seterusnya meriwayatkan bahawa seorang lelaki dari kalangan Yahudi datang dan berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي خَالِدُ بْنُ يَزِيدَ،\n عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،\n عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ تَكُونُ الأَرْضُ يَوْمَ الْقِيَامَةِ خُبْزَةً وَاحِدَةً يَكْفَؤُهَا\n الْجَبَّارُ بِيَدِهِ كَمَا يَكْفَأُ أَحَدُكُمْ خُبْزَتَهُ فِي السَّفَرِ نُزُلاً لأَهْلِ الْجَنَّةِ ‏\"‏ ‏.‏ قَالَ فَأَتَى رَجُلٌ مِنَ\n الْيَهُودِ فَقَالَ بَارَكَ الرَّحْمَنُ عَلَيْكَ أَبَا الْقَاسِمِ أَلاَ أُخْبِرُكَ بِنُزُلِ أَهْلِ الْجَنَّةِ يَوْمَ الْقِيَامَةِ قَالَ\n ‏\"‏ بَلَى ‏\"‏ ‏.‏ قَالَ تَكُونُ الأَرْضُ خُبْزَةً وَاحِدَةً - كَمَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n - قَالَ فَنَظَرَ إِلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ قَالَ أَلاَ\n أُخْبِرُكَ بِإِدَامِهِمْ قَالَ ‏\"‏ بَلَى ‏\"‏ ‏.‏ قَالَ إِدَامُهُمْ بَالاَمُ وَنُونٌ ‏.‏ قَالُوا وَمَا هَذَا قَالَ ثَوْرٌ وَنُونٌ\n يَأْكُلُ مِنْ زَائِدَةِ كَبِدِهِمَا سَبْعُونَ أَلْفًا ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abd al-Malik bin Shu'aib bin al-Laits, telah menceritakan kepadaku ayahku, daripada datukku, telah menceritakan kepadaku Khalid bin Yazid, daripada Sa'id bin Abi Hilal, daripada Zaid bin Aslam, daripada Ath-Thaa' bin Yasar, daripada Abu Sa'id al-Khudri, daripada Rasulullah SAW, baginda bersabda: \"Bumi pada hari kiamat akan menjadi satu roti yang akan diangkat oleh Yang Maha Perkasa dengan tangan-Nya sepertimana seorang daripada kamu mengangkat rotinya ketika dalam perjalanan, sebagai hidangan untuk ahli syurga.\"  Kemudian datang seorang lelaki daripada Yahudi lalu berkata: \"Semoga Tuhan Yang Maha Pemurah memberkati engkau, wahai Abu al-Qasim.  Bolehkan aku memberitahu engkau tentang hidangan untuk ahli syurga pada hari kiamat?\" Baginda menjawab: \"Ya.\" Lelaki itu berkata: \"Bumi akan menjadi satu roti, sepertimana yang telah disebutkan oleh Rasulullah SAW.\"  Rasulullah SAW memandang ke arah kami kemudian ketawa sehingga gigi gerahamnya kelihatan. Baginda kemudian berkata: \"Bolehkan aku memberitahu engkau tentang lauknya?\" Baginda menjawab: \"Ya.\" Baginda berkata: \"Lauk mereka adalah balam dan nun.\"  Mereka bertanya: \"Apakah itu?\" Baginda menjawab: \"Lembu jantan dan ikan.  Daripada limpahan hati keduanya, tujuh puluh ribu orang akan dapat makan.\""
  },
  {
    "id": 14161,
    "hadith_number": 6884,
    "tajuk_hadith": "Pengaruh Dakwah Nabi SAW",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "If ten scholars of the Jews would follow me, no Jew would be left upon the surface of the earth who would not embrace Islam.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا قُرَّةُ، حَدَّثَنَا مُحَمَّدٌ،\n عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لَوْ تَابَعَنِي عَشْرَةٌ مِنَ الْيَهُودِ لَمْ\n يَبْقَ عَلَى ظَهْرِهَا يَهُودِيٌّ إِلاَّ أَسْلَمَ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:  \"Sekiranya sepuluh orang alim daripada kalangan Yahudi mengikutku, nescaya tidak akan tinggal seorang Yahudi pun di muka bumi ini melainkan mereka akan memeluk Islam.\""
  },
  {
    "id": 14162,
    "hadith_number": 6885,
    "tajuk_hadith": "Baginda SAW Ditanya Mengenai Roh",
    "perawi_melayu": "Abdullah ibn Mas'ud",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنِي إِبْرَاهِيمُ،\n عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ بَيْنَمَا أَنَا أَمْشِي، مَعَ النَّبِيِّ صلى الله عليه وسلم فِي حَرْثٍ\n وَهُوَ مُتَّكِئٌ عَلَى عَسِيبٍ إِذْ مَرَّ بِنَفَرٍ مِنَ الْيَهُودِ فَقَالَ بَعْضُهُمْ لِبَعْضٍ سَلُوهُ عَنِ الرُّوحِ فَقَالُوا\n مَا رَابَكُمْ إِلَيْهِ لاَ يَسْتَقْبِلُكُمْ بِشَىْءٍ تَكْرَهُونَهُ ‏.‏ فَقَالُوا سَلُوهُ فَقَامَ إِلَيْهِ بَعْضُهُمْ فَسَأَلَهُ عَنِ\n الرُّوحِ - قَالَ - فَأَسْكَتَ النَّبِيُّ صلى الله عليه وسلم فَلَمْ يَرُدَّ عَلَيْهِ شَيْئًا فَعَلِمْتُ أَنَّهُ يُوحَى\n إِلَيْهِ - قَالَ - فَقُمْتُ مَكَانِي فَلَمَّا نَزَلَ الْوَحْىُ قَالَ ‏{‏ وَيَسْأَلُونَكَ عَنِ الرُّوحِ قُلِ الرُّوحُ مِنْ\n أَمْرِ رَبِّي وَمَا أُوتِيتُمْ مِنَ الْعِلْمِ إِلاَّ قَلِيلاً‏}‏",
    "malay_translation": "Kami diberitakan oleh Umar bin Hafs bin Ghiyas, yang diberitakan oleh bapanya, yang diberitakan oleh al-A’masy, yang diberitakan oleh Ibrahim, daripada ‘Alqamah, daripada Abdullah. Beliau berkata: Ketika aku berjalan bersama Nabi SAW di tanah pertanian, baginda bersandar pada tongkat, tiba-tiba kami berselisihan dengan sekumpulan orang Yahudi. Sebahagian daripada mereka berkata kepada yang lain: “Tanyakanlah baginda tentang roh.”  Mereka berkata: “Apakah keraguan kamu terhadap baginda? Jangan-jangan baginda akan menjawab sesuatu yang kamu tidak sukai.” Mereka berkata: “Tanyakanlah juga.”  Maka, sebahagian daripada mereka bertanya kepada baginda tentang roh.  Nabi SAW berdiam diri dan tidak menjawab.  Aku tahu bahawa wahyu sedang diturunkan kepadanya. Aku pun berdiri di tempatku. Setelah wahyu itu turun, baginda bersabda:  “Dan mereka bertanya kepadamu tentang roh. Katakanlah: Roh itu daripada urusan TuhanKu, dan kamu tidak diberi ilmu melainkan sedikit.” (al-Isra’: 85)"
  },
  {
    "id": 14163,
    "hadith_number": 6886,
    "tajuk_hadith": "Perjalanan Bersama Rasulullah di Ladang Madinah",
    "perawi_melayu": "Abdullah meriwayatkan:",
    "english_text": "I was walking along with Allah's Apostle (ﷺ) in a field of Medina. The rest of the hadith is the same, but there is a slight variation of wording.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو سَعِيدٍ الأَشَجُّ قَالاَ حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا \n إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَعَلِيُّ بْنُ خَشْرَمٍ، قَالاَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، كِلاَهُمَا عَنِ \n الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ كُنْتُ أَمْشِي مَعَ النَّبِيِّ صلى الله عليه\n وسلم فِي حَرْثٍ بِالْمَدِينَةِ ‏.‏ بِنَحْوِ حَدِيثِ حَفْصٍ غَيْرَ أَنَّ فِي حَدِيثِ وَكِيعٍ وَمَا أُوتِيتُمْ مِنَ\n الْعِلْمِ إِلاَّ قَلِيلاً ‏.‏ وَفِي حَدِيثِ عِيسَى بْنِ يُونُسَ وَمَا أُوتُوا ‏.‏ مِنْ رِوَايَةِ ابْنِ خَشْرَمٍ ‏.‏",
    "malay_translation": "Aku berjalan bersama Rasulullah ﷺ di sebuah ladang di Madinah.  Baki riwayat hadis ini adalah sama, cuma sedikit perbezaan dari segi perkataan."
  },
  {
    "id": 14164,
    "hadith_number": 6887,
    "tajuk_hadith": "Rasulullah SAW Bersandar di Pokok Kurma",
    "perawi_melayu": "Abdullah bin Idris melalui jalan sanad yang meriwayatkan dari Abu Said Al-Asyaj, Al-A’masy, Abdullah bin Murrah, dan Masruq",
    "english_text": "Abdullah reported that Allah's Apostle (ﷺ) was reclining against a tree in the garden. The rest of the hadith is the same with a slight variation of wording.",
    "arabic_text": "حَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ إِدْرِيسَ، يَقُولُ سَمِعْتُ الأَعْمَشَ،\n يَرْوِيهِ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم\n فِي نَخْلٍ يَتَوَكَّأُ عَلَى عَسِيبٍ ‏.‏ ثُمَّ ذَكَرَ نَحْوَ حَدِيثِهِمْ عَنِ الأَعْمَشِ وَقَالَ فِي رِوَايَتِهِ وَمَا\n أُوتِيتُمْ مِنَ الْعِلْمِ إِلاَّ قَلِيلاً ‏.‏",
    "malay_translation": "Abdullah meriwayatkan bahawa Rasulullah SAW berada di sebuah kebun, bersandar pada sebatang pokok kurma. Kemudian disebutkan  lebih kurang seperti riwayat mereka daripada Al-A’masy dan di dalam riwayatnya disebut, “Dan apa yang diberikan kepada kamu dari ilmu hanyalah sedikit.”"
  },
  {
    "id": 14165,
    "hadith_number": 6888,
    "tajuk_hadith": "Hutang dan Iman kepada Nabi Muhammad",
    "perawi_melayu": "Khabbab meriwayatkan bahawa Al-`As bin Wa'il berhutang kepadaku. Aku datang kepadanya untuk menuntut hutang itu. Dia berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَبْدُ اللَّهِ بْنُ سَعِيدٍ الأَشَجُّ، - وَاللَّفْظُ لِعَبْدِ اللَّهِ -\n قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ خَبَّابٍ، قَالَ كَانَ لِي\n عَلَى الْعَاصِ بْنِ وَائِلٍ دَيْنٌ فَأَتَيْتُهُ أَتَقَاضَاهُ فَقَالَ لِي لَنْ أَقْضِيَكَ حَتَّى تَكْفُرَ بِمُحَمَّدٍ - قَالَ\n - فَقُلْتُ لَهُ إِنِّي لَنْ أَكْفُرَ بِمُحَمَّدٍ حَتَّى تَمُوتَ ثُمَّ تُبْعَثَ ‏.‏ قَالَ وَإِنِّي لَمَبْعُوثٌ مِنْ بَعْدِ الْمَوْتِ\n فَسَوْفَ أَقْضِيكَ إِذَا رَجَعْتُ إِلَى مَالٍ وَوَلَدٍ ‏.‏ قَالَ وَكِيعٌ كَذَا قَالَ الأَعْمَشُ قَالَ فَنَزَلَتْ هَذِهِ\n الآيَةُ ‏{‏ أَفَرَأَيْتَ الَّذِي كَفَرَ بِآيَاتِنَا وَقَالَ لأُوتَيَنَّ مَالاً وَوَلَدًا‏}‏ إِلَى قَوْلِهِ ‏{‏ وَيَأْتِينَا فَرْدًا‏}‏",
    "malay_translation": "Abu Bakar bin Abu Syaibah dan Abdullah bin Sa'id al-Asyaj meriwayatkan (dengan lafaz daripada Abdullah): Mereka berkata, Waki' meriwayatkan daripada al-A'masy daripada Abu Dhuha, daripada Masruq, daripada Khabbab yang berkata: Aku mempunyai hutang terhadap al-'Ash bin Wa'il.  Aku mendatanginya untuk menagih hutang tersebut, maka dia berkata kepadaku, \"Aku tidak akan membayarmu sehingga engkau kufur kepada Muhammad.\"  Aku menjawab, \"Aku tidak akan kufur kepada Muhammad sehingga engkau mati kemudian dibangkitkan.\" Dia berkata, \"Sesungguhnya aku akan dibangkitkan setelah mati, maka aku akan membayarmu apabila aku kembali mendapat harta dan anak.\" Waki' berkata, demikianlah yang dikatakan al-A'masy.  Lalu turunlah ayat ini: {أَفَرَأَيْتَ الَّذِي كَفَرَ بِآيَاتِنَا وَقَالَ لَأُوتَيَنَّ مَالًا وَوَلَدًا} sehingga firman-Nya {وَيَأْتِينَا فَرْدًا}."
  },
  {
    "id": 14166,
    "hadith_number": 6889,
    "tajuk_hadith": "Kisah Tukang Besi Pada Zaman Jahiliyyah",
    "perawi_melayu": "Abu Kuraib, Abu Muawiyah, Ibn Numair, Ishaq bin Ibrahim, Jarir, dan Ibn Abi Umar melalui pelbagai sanad yang meriwayatkan dari Al-A'masy.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا \n إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، ح وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، كُلُّهُمْ عَنِ الأَعْمَشِ،\n بِهَذَا الإِسْنَادِ ‏.‏ نَحْوَ حَدِيثِ وَكِيعٍ وَفِي حَدِيثِ جَرِيرٍ قَالَ كُنْتُ قَيْنًا فِي الْجَاهِلِيَّةِ فَعَمِلْتُ\n لِلْعَاصِ بْنِ وَائِلٍ عَمَلاً فَأَتَيْتُهُ أَتَقَاضَاهُ ‏.‏",
    "malay_translation": "Kami telah diberitakan oleh Abu Kuraib, yang telah diberitakan kepadanya oleh Abu Muawiyah, dan juga telah diberitakan kepada kami oleh Ibn Numair, yang telah diberitakan kepadanya oleh bapanya, dan juga telah diberitakan kepada kami oleh Ishaq bin Ibrahim yang telah diberitakan kepadanya oleh Jarir, dan juga telah diberitakan kepada kami oleh Ibn Abi Umar yang telah diberitakan kepadanya oleh Sufyan. Kesemua mereka meriwayatkan dari Al-A’masy dengan sanad seperti ini.  Seumpama hadis Waki’.  Dan dalam hadis Jarir, beliau berkata:  “Aku adalah seorang tukang besi pada zaman Jahiliyyah. Aku telah bekerja untuk Al-As bin Wa’il, lalu aku datang kepadanya untuk menuntut upahku.”"
  },
  {
    "id": 14167,
    "hadith_number": 6890,
    "tajuk_hadith": "Doa Abu Jahal dan Ayat yang Diturunkan",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa Abu Jahal berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْحَمِيدِ الزِّيَادِيِّ،\n أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ أَبُو جَهْلٍ اللَّهُمَّ إِنْ كَانَ هَذَا هُوَ الْحَقَّ مِنْ عِنْدِكَ فَأَمْطِرْ\n عَلَيْنَا حِجَارَةً مِنَ السَّمَاءِ أَوِ ائْتِنَا بِعَذَابٍ أَلِيمٍ ‏.‏ فَنَزَلَتْ ‏{‏ وَمَا كَانَ اللَّهُ لِيُعَذِّبَهُمْ وَأَنْتَ فِيهِمْ\n وَمَا كَانَ اللَّهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ * وَمَا لَهُمْ أَلاَّ يُعَذِّبَهُمُ اللَّهُ وَهُمْ يَصُدُّونَ عَنِ الْمَسْجِدِ\n الْحَرَامِ‏}‏ إِلَى آخِرِ الآيَةِ ‏.‏",
    "malay_translation": "Kami diberitakan oleh Ubaidullah bin Mu'adz Al-Anbari, yang diberitakan oleh bapanya, yang diberitakan oleh Syu'bah, daripada Abdul Hamid Az-Ziyady, bahawa dia mendengar Anas bin Malik berkata, bahawa Abu Jahal berkata: \"Ya Allah, jika ini adalah kebenaran daripada-Mu, maka hujanilah kami dengan batu dari langit atau timpakanlah kami dengan azab yang pedih.\" Maka turunlah ayat: \"Dan Allah tidak akan menyeksa mereka selagi kamu bersama mereka; dan Allah tidak akan menyeksa mereka selagi mereka memohon keampunan. Dan mengapakah Allah tidak akan menyeksa mereka, sedang mereka menghalang orang dari Masjidil Haram?\" sehingga akhir ayat."
  },
  {
    "id": 14168,
    "hadith_number": 6891,
    "tajuk_hadith": "Kisah Abu Jahal dan Malaikat",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، وَمُحَمَّدُ بْنُ عَبْدِ الأَعْلَى الْقَيْسِيُّ، قَالاَ حَدَّثَنَا الْمُعْتَمِرُ،\n عَنْ أَبِيهِ، حَدَّثَنِي نُعَيْمُ بْنُ أَبِي هِنْدٍ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ أَبُو جَهْلٍ هَلْ\n يُعَفِّرُ مُحَمَّدٌ وَجْهَهُ بَيْنَ أَظْهُرِكُمْ قَالَ فَقِيلَ نَعَمْ ‏.‏ فَقَالَ وَاللاَّتِ وَالْعُزَّى لَئِنْ رَأَيْتُهُ يَفْعَلُ ذَلِكَ\n لأَطَأَنَّ عَلَى رَقَبَتِهِ أَوْ لأُعَفِّرَنَّ وَجْهَهُ فِي التُّرَابِ - قَالَ - فَأَتَى رَسُولَ اللَّهِ صلى الله عليه\n وسلم وَهُوَ يُصَلِّي زَعَمَ لِيَطَأَ عَلَى رَقَبَتِهِ - قَالَ - فَمَا فَجِئَهُمْ مِنْهُ إِلاَّ وَهُوَ يَنْكِصُ عَلَى\n عَقِبَيْهِ وَيَتَّقِي بِيَدَيْهِ - قَالَ - فَقِيلَ لَهُ مَا لَكَ فَقَالَ إِنَّ بَيْنِي وَبَيْنَهُ لَخَنْدَقًا مِنْ نَارٍ وَهَوْلاً\n وَأَجْنِحَةً ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ دَنَا مِنِّي لاَخْتَطَفَتْهُ الْمَلاَئِكَةُ عُضْوًا\n عُضْوًا ‏\"‏ ‏.‏ قَالَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ لاَ نَدْرِي فِي حَدِيثِ أَبِي هُرَيْرَةَ أَوْ شَىْءٌ بَلَغَهُ ‏{‏ كَلاَّ\n إِنَّ الإِنْسَانَ لَيَطْغَى * أَنْ رَآهُ اسْتَغْنَى * إِنَّ إِلَى رَبِّكَ الرُّجْعَى * أَرَأَيْتَ الَّذِي يَنْهَى * عَبْدًا\n إِذَا صَلَّى * أَرَأَيْتَ إِنْ كَانَ عَلَى الْهُدَى * أَوْ أَمَرَ بِالتَّقْوَى * أَرَأَيْتَ إِنْ كَذَّبَ وَتَوَلَّى‏}‏ -\n يَعْنِي أَبَا جَهْلٍ - ‏{‏ أَلَمْ يَعْلَمْ بِأَنَّ اللَّهَ يَرَى * كَلاَّ لَئِنْ لَمْ يَنْتَهِ لَنَسْفَعًا بِالنَّاصِيَةِ * نَاصِيَةٍ\n كَاذِبَةٍ خَاطِئَةٍ * فَلْيَدْعُ نَادِيَهُ * سَنَدْعُ الزَّبَانِيَةَ * كَلاَّ لاَ تُطِعْهُ‏}‏ زَادَ عُبَيْدُ اللَّهِ فِي حَدِيثِهِ\n قَالَ وَأَمَرَهُ بِمَا أَمَرَهُ بِهِ ‏.‏ وَزَادَ ابْنُ عَبْدِ الأَعْلَى فَلْيَدْعُ نَادِيَهُ يَعْنِي قَوْمَهُ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ubaidullah bin Mu'adz dan Muhammad bin Abdul A'la al-Qaysi, keduanya berkata: Telah menceritakan kepada kami al-Mu'tamir, dari ayahnya, telah menceritakan kepadaku Nu'aim bin Abi Hind, dari Abu Hazim, dari Abu Hurairah, dia berkata: Abu Jahal berkata, \"Adakah Muhammad menundukkan wajahnya (sujud) di hadapan kamu?\" Maka dikatakan kepadanya, \"Ya.\" Maka dia berkata, \"Demi Lat dan Uzza, sekiranya aku melihatnya melakukan demikian, nescaya aku akan menginjak lehernya atau akan aku lumurkan wajahnya ke tanah.\"  Dia datang kepada Rasulullah SAW ketika Baginda sedang solat, dia berniat untuk menginjak leher Baginda. Tetapi dia tidak sampai kepada Baginda melainkan dia terundur ke belakang dan menolak sesuatu dengan kedua tangannya.  Lalu ditanya kepadanya, \"Apakah gerangan yang berlaku kepadamu?\" Dia berkata, \"Sesungguhnya di antara aku dan Baginda ada parit dari api, ketakutan dan sayap.\" Maka Rasulullah SAW bersabda, \"Sekiranya dia mendekatiku, nescaya malaikat akan mencabik-cabiknya anggota demi anggota.\" Allah SWT menurunkan ayat (kami tidak tahu sama ada ini dalam hadis Abu Hurairah atau sesuatu yang sampai kepadanya):  \"Sekali-kali tidak, sesungguhnya manusia itu benar-benar melampaui batas, kerana dia melihat dirinya cukup berkemampuan.  Sesungguhnya kepada Tuhanmulah kembali.  Adakah engkau melihat orang yang melarang, hamba ketika dia solat?  Adakah engkau melihat kalau dia berada di jalan yang benar atau menyuruh melakukan taqwa?  Adakah engkau melihat kalau dia mendustakan dan berpaling?  Tidakkah dia mengetahui bahawa sesungguhnya Allah melihat?  Sekali-kali tidak, jika dia tidak berhenti, nescaya Kami akan menariknya dari ubun-ubun, iaitu ubun-ubun yang pendusta lagi berdosa.  Maka hendaklah dia memanggil golongannya, Kami akan memanggil penjaga-penjaga neraka.  Sekali-kali tidak, janganlah engkau menurutinya.\" Ubaidullah menambah dalam hadisnya: Baginda menyuruhnya apa yang disuruhkan oleh Baginda. Dan Ibnu Abdul A'la menambah: \"Hendaklah dia memanggil golongannya,\" iaitu kaumnya."
  },
  {
    "id": 14169,
    "hadith_number": 6892,
    "tajuk_hadith": "Tafsiran Ayat Asap dan Amaran Tentang Mengatakan Apa yang Tidak Diketahui",
    "perawi_melayu": "Masruq meriwayatkan:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي الضُّحَى، عَنْ \n مَسْرُوقٍ، قَالَ كُنَّا عِنْدَ عَبْدِ اللَّهِ جُلُوسًا وَهُوَ مُضْطَجِعٌ بَيْنَنَا فَأَتَاهُ رَجُلٌ فَقَالَ يَا أَبَا عَبْدِ\n الرَّحْمَنِ إِنَّ قَاصًّا عِنْدَ أَبْوَابِ كِنْدَةَ يَقُصُّ وَيَزْعُمُ أَنَّ آيَةَ الدُّخَانِ تَجِيءُ فَتَأْخُذُ بِأَنْفَاسِ\n الْكُفَّارِ وَيَأْخُذُ الْمُؤْمِنِينَ مِنْهُ كَهَيْئَةِ الزُّكَامِ فَقَالَ عَبْدُ اللَّهِ وَجَلَسَ وَهُوَ غَضْبَانُ يَا أَيُّهَا النَّاسُ\n اتَّقُوا اللَّهَ مَنْ عَلِمَ مِنْكُمْ شَيْئًا فَلْيَقُلْ بِمَا يَعْلَمُ وَمَنْ لَمْ يَعْلَمْ فَلْيَقُلِ اللَّهُ أَعْلَمُ فَإِنَّهُ أَعْلَمُ لأَحَدِكُمْ\n أَنْ يَقُولَ لِمَا لاَ يَعْلَمُ اللَّهُ أَعْلَمُ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ قَالَ لِنَبِيِّهِ صلى الله عليه وسلم ‏{‏ قُلْ\n مَا أَسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ وَمَا أَنَا مِنَ الْمُتَكَلِّفِينَ‏}‏ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمَّا\n رَأَى مِنَ النَّاسِ إِدْبَارًا فَقَالَ ‏\"‏ اللَّهُمَّ سَبْعٌ كَسَبْعِ يُوسُفَ ‏\"‏ ‏.‏ قَالَ فَأَخَذَتْهُمْ سَنَةٌ حَصَّتْ\n كُلَّ شَىْءٍ حَتَّى أَكَلُوا الْجُلُودَ وَالْمَيْتَةَ مِنَ الْجُوعِ وَيَنْظُرُ إِلَى السَّمَاءِ أَحَدُهُمْ فَيَرَى كَهَيْئَةِ\n الدُّخَانِ فَأَتَاهُ أَبُو سُفْيَانَ فَقَالَ يَا مُحَمَّدُ إِنَّكَ جِئْتَ تَأْمُرُ بِطَاعَةِ اللَّهِ وَبِصِلَةِ الرَّحِمِ وَإِنَّ\n قَوْمَكَ قَدْ هَلَكُوا فَادْعُ اللَّهَ لَهُمْ - قَالَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ فَارْتَقِبْ يَوْمَ تَأْتِي السَّمَاءُ بِدُخَانٍ\n مُبِينٍ * يَغْشَى النَّاسَ هَذَا عَذَابٌ أَلِيمٌ‏}‏ إِلَى قَوْلِهِ ‏{‏ إِنَّكُمْ عَائِدُونَ‏}‏ ‏.‏ قَالَ أَفَيُكْشَفُ عَذَابُ\n الآخِرَةِ ‏{‏ يَوْمَ نَبْطِشُ الْبَطْشَةَ الْكُبْرَى إِنَّا مُنْتَقِمُونَ‏}‏ فَالْبَطْشَةُ يَوْمَ بَدْرٍ وَقَدْ مَضَتْ آيَةُ الدُّخَانِ\n وَالْبَطْشَةُ وَاللِّزَامُ وَآيَةُ الرُّومِ ‏.‏",
    "malay_translation": "Kami diberitahu oleh Ishak bin Ibrahim, yang diberitahu oleh Jarir, daripada Mansur, daripada Abu Dhuha, daripada Masruq, katanya: Kami sedang duduk bersama Abdullah, dan beliau sedang berbaring di antara kami, maka datanglah seorang lelaki lalu berkata: Wahai Abu Abdurrahman, sesungguhnya seorang pencerita di pintu gerbang Kinda menceritakan dan mendakwa bahawa ayat asap itu akan datang, lalu ia akan menahan nafas orang-orang kafir dan menyebabkan orang-orang mukmin mengalami seperti selesema. Maka Abdullah bangun sambil marah lalu berkata: Wahai sekalian manusia, bertaqwalah kepada Allah, sesiapa di antara kamu yang mengetahui sesuatu, maka hendaklah dia berkata dengan apa yang diketahuinya, dan sesiapa yang tidak mengetahuinya, maka hendaklah dia berkata: “Allah lebih mengetahui”, kerana sesungguhnya Allah lebih mengetahui daripada seseorang di antara kamu untuk berkata tentang apa yang tidak diketahuinya. Allah lebih mengetahui. Sesungguhnya Allah SWT berfirman kepada Nabi-Nya SAW: {Katakanlah: Aku tidak meminta sebarang upah daripada kamu dan aku bukanlah daripada orang-orang yang memaksa}. Sesungguhnya Rasulullah SAW apabila melihat orang-orang berpaling daripada agama, maka baginda bersabda: “Ya Allah, tujuh tahun kemarau seperti tujuh tahun kemarau Yusuf.” Maka mereka dilanda kemarau yang memusnahkan segala-galanya sehingga mereka memakan kulit dan bangkai kerana kelaparan, dan salah seorang daripada mereka memandang ke langit, maka dia melihat seperti asap. Kemudian datanglah Abu Sufyan lalu berkata: Wahai Muhammad, sesungguhnya engkau datang memerintahkan untuk mentaati Allah dan menyambung silaturahim, dan sesungguhnya kaummu telah binasa, maka berdoalah kepada Allah untuk mereka. Allah SWT berfirman: {Maka tunggulah hari di mana langit datang dengan asap yang nyata, yang meliputi manusia. Ini adalah azab yang pedih,} sehingga firman-Nya: {Sesungguhnya kamu pasti akan kembali (kepada kejahatan)} Adakah azab akhirat itu akan dapat dielakkan? {Pada hari Kami melakukan penangkapan yang besar, sesungguhnya Kami adalah pembalas dendam.} Maka penangkapan itu adalah pada hari Badar, dan telah berlalu tanda asap, penangkapan, keharusan dan tanda-tanda Rom."
  },
  {
    "id": 14170,
    "hadith_number": 6893,
    "tajuk_hadith": "Tafsiran Ayat Mengenai Asap pada Hari Kiamat dan Kisah Quraisy",
    "perawi_melayu": "Masruq meriwayatkan bahawa seorang lelaki datang kepada Abdullah dan berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَوَكِيعٌ، ح وَحَدَّثَنِي أَبُو سَعِيدٍ،\n الأَشَجُّ أَخْبَرَنَا وَكِيعٌ، ح وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، كُلُّهُمْ عَنِ الأَعْمَشِ، ح\n وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لِيَحْيَى - قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ،\n عَنْ مُسْلِمِ بْنِ صُبَيْحٍ، عَنْ مَسْرُوقٍ، قَالَ جَاءَ إِلَى عَبْدِ اللَّهِ رَجُلٌ فَقَالَ تَرَكْتُ فِي الْمَسْجِدِ\n رَجُلاً يُفَسِّرُ الْقُرْآنَ بِرَأْيِهِ يُفَسِّرُ هَذِهِ الآيَةَ ‏{‏ يَوْمَ تَأْتِي السَّمَاءُ بِدُخَانٍ مُبِينٍ‏}‏ قَالَ يَأْتِي\n النَّاسَ يَوْمَ الْقِيَامَةِ دُخَانٌ فَيَأْخُذُ بِأَنْفَاسِهِمْ حَتَّى يَأْخُذَهُمْ مِنْهُ كَهَيْئَةِ الزُّكَامِ ‏.‏ فَقَالَ عَبْدُ\n اللَّهِ مَنْ عَلِمَ عِلْمًا فَلْيَقُلْ بِهِ وَمَنْ لَمْ يَعْلَمْ فَلْيَقُلِ اللَّهُ أَعْلَمُ فَإِنَّ مِنْ فِقْهِ الرَّجُلِ أَنْ يَقُولَ لِمَا\n لاَ عِلْمَ لَهُ بِهِ اللَّهُ أَعْلَمُ ‏.‏ إِنَّمَا كَانَ هَذَا أَنَّ قُرَيْشًا لَمَّا اسْتَعْصَتْ عَلَى النَّبِيِّ صلى الله عليه\n وسلم دَعَا عَلَيْهِمْ بِسِنِينَ كَسِنِي يُوسُفَ فَأَصَابَهُمْ قَحْطٌ وَجَهْدٌ حَتَّى جَعَلَ الرَّجُلُ يَنْظُرُ إِلَى\n السَّمَاءِ فَيَرَى بَيْنَهُ وَبَيْنَهَا كَهَيْئَةِ الدُّخَانِ مِنَ الْجَهْدِ وَحَتَّى أَكَلُوا الْعِظَامَ فَأَتَى النَّبِيَّ صلى\n الله عليه وسلم رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ اسْتَغْفِرِ اللَّهَ لِمُضَرَ فَإِنَّهُمْ قَدْ هَلَكُوا فَقَالَ ‏\"‏ لِمُضَرَ\n إِنَّكَ لَجَرِيءٌ ‏\"‏ ‏.‏ قَالَ فَدَعَا اللَّهَ لَهُمْ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ إِنَّا كَاشِفُو الْعَذَابِ قَلِيلاً إِنَّكُمْ\n عَائِدُونَ‏}‏ قَالَ فَمُطِرُوا فَلَمَّا أَصَابَتْهُمُ الرَّفَاهِيَةُ - قَالَ - عَادُوا إِلَى مَا كَانُوا عَلَيْهِ -\n قَالَ - فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ فَارْتَقِبْ يَوْمَ تَأْتِي السَّمَاءُ بِدُخَانٍ مُبِينٍ * يَغْشَى النَّاسَ\n هَذَا عَذَابٌ أَلِيمٌ‏}‏ ‏{‏ يَوْمَ نَبْطِشُ الْبَطْشَةَ الْكُبْرَى إِنَّا مُنْتَقِمُونَ‏}‏ قَالَ يَعْنِي يَوْمَ بَدْرٍ ‏.‏",
    "malay_translation": "Masruq meriwayatkan bahawa seorang lelaki datang kepada Abdullah dan berkata, \"Saya meninggalkan di masjid seorang lelaki yang mentafsir al-Quran mengikut pandangannya sendiri. Dia mentafsir ayat ini:  'Pada hari langit membawa asap yang nyata.' Dia berkata, 'Pada hari kiamat, akan datang asap kepada manusia, lalu ia akan mengambil nafas mereka sehingga mereka akan mengalaminya seperti selesema.' Abdullah berkata, 'Barangsiapa yang mengetahui sesuatu ilmu, hendaklah dia berkata dengannya, dan barangsiapa yang tidak mengetahui, hendaklah dia berkata, “Allah lebih mengetahui.” Kerana sebahagian daripada kefahaman seseorang ialah berkata tentang perkara yang dia tidak tahu, “Allah lebih mengetahui.”  Kejadian ini berlaku kerana ketika Quraisy menderhaka kepada Nabi SAW, baginda berdoa kepada Allah agar mereka ditimpa kemarau seperti zaman Yusuf. Maka mereka ditimpa kemarau dan kesusahan sehingga seseorang itu memandang ke langit dan melihat di antara dirinya dan langit seperti asap akibat kesusahan, dan sehingga mereka memakan tulang.  Lalu datang seorang lelaki kepada Nabi SAW dan berkata, ‘Wahai Rasulullah, mohon ampun kepada Allah untuk kaum Mudar kerana mereka telah binasa.’ Baginda berkata, ‘Untuk kaum Mudar? Kamu memang berani!’  Kemudian baginda berdoa kepada Allah untuk mereka, lalu Allah SWT menurunkan wahyu: ‘Sesungguhnya Kami akan menghilangkan azab itu sedikit, sesungguhnya kamu akan kembali (kepada kejahatan).’  Dia berkata, ‘Maka mereka ditimpa hujan. Apabila mereka mendapat kesenangan, mereka kembali kepada keadaan mereka seperti sedia kala.’  Dia berkata, ‘Maka Allah SWT menurunkan wahyu:  'Maka tunggulah hari apabila langit membawa asap yang nyata, yang menyelubungi manusia. Ini adalah azab yang pedih, pada hari Kami mencengkam (mereka) dengan cengkaman yang kuat. Sesungguhnya Kami adalah Pembalas.’  Dia berkata, yang dimaksudkan ialah pada hari Perang Badar.'"
  },
  {
    "id": 14171,
    "hadith_number": 6894,
    "tajuk_hadith": "Lima Tanda Yang Telah Berlalu",
    "perawi_melayu": "Abdullah berkata bahawa lima tanda telah berlalu (dan telah membuktikan kebenaran Nabi):",
    "english_text": "(Enveloping) by the smoke, inevitable (punishment to the Meccans at Badr), (the victory of) Rome, (violent) seizing (of the Meccans at Badr) and (the splitting up of) the Moon.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ،\n عَنْ عَبْدِ اللَّهِ، قَالَ خَمْسٌ قَدْ مَضَيْنَ الدُّخَانُ وَاللِّزَامُ وَالرُّومُ وَالْبَطْشَةُ وَالْقَمَرُ ‏.‏",
    "malay_translation": "Abdullah berkata bahawa lima tanda telah berlalu: iaitu kejadian asap (yang menyelubungi Mekah),  kehancuran yang tidak dapat dielakkan (bagi penduduk Mekah di Perang Badar),  kejayaan Rom, penawanan yang ganas (penduduk Mekah di Perang Badar), dan peristiwa terbelahnya bulan."
  },
  {
    "id": 14172,
    "hadith_number": 6895,
    "tajuk_hadith": "Hadis Diriwayatkan oleh al-A'mash dengan Sanad yang Sama",
    "perawi_melayu": "Abu Said al-Asyaj daripada Wakie' daripada al-A'mash",
    "english_text": "This hadith has been narrated on the authority of A'mash with the same chain of transmitters.",
    "arabic_text": "حَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الأَعْمَشُ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada al-A'mash dengan sanad yang sama."
  },
  {
    "id": 14173,
    "hadith_number": 6896,
    "tajuk_hadith": "Tafsir Ayat Azab Dunia",
    "perawi_melayu": "Ubayy bin Ka'b meriwayatkan bahawa firman Allah SWT:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ،\n ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ \n عَزْرَةَ، عَنِ الْحَسَنِ الْعُرَنِيِّ، عَنْ يَحْيَى بْنِ الْجَزَّارِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ أُبَىِّ،\n بْنِ كَعْبٍ فِي قَوْلِهِ عَزَّ وَجَلَّ ‏{‏ وَلَنُذِيقَنَّهُمْ مِنَ الْعَذَابِ الأَدْنَى دُونَ الْعَذَابِ الأَكْبَرِ‏}‏ قَالَ مَصَائِبُ\n الدُّنْيَا وَالرُّومُ وَالْبَطْشَةُ أَوِ الدُّخَانُ ‏.‏ شُعْبَةُ الشَّاكُّ فِي الْبَطْشَةِ أَوِ الدُّخَانِ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Al-Mutsanna dan Muhammad bin Bashar, keduanya berkata; Telah menceritakan kepada kami Muhammad bin Ja'far, telah menceritakan kepada kami Syu'bah, dan telah menceritakan kepada kami Abu Bakar bin Abi Syaibah - dan lafaz ini daripada beliau - telah menceritakan kepada kami Gundar, dari Syu'bah, dari Qatadah, dari Azrah, dari Al-Hasan Al-'Urrani, dari Yahya bin Al-Jazzar, dari Abdurrahman bin Abi Lail, dari Ubay bin Ka'ab, berkenaan firman-Nya SWT: {… dan sesungguhnya Kami akan memberikan mereka merasai azab yang ringan sebelum azab yang besar…}  Beliau berkata: Musibah-musibah dunia, penaklukan Rom, penangkapan atau asap. Syu'bah ragu-ragu antara penangkapan atau asap."
  },
  {
    "id": 14174,
    "hadith_number": 6897,
    "tajuk_hadith": "Kesaksian Terhadap Pembelahan Bulan",
    "perawi_melayu": "Abu Ma'mar meriwayatkan daripada Abdullah bahawa bulan telah terbelah dua pada zaman Rasulullah ﷺ, dan Rasulullah ﷺ bersabda:",
    "english_text": "Bear testimony to this.",
    "arabic_text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ أَبِي،\n نَجِيحٍ عَنْ مُجَاهِدٍ، عَنْ أَبِي مَعْمَرٍ، عَنْ عَبْدِ اللَّهِ، قَالَ انْشَقَّ الْقَمَرُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى\n الله عليه وسلم بِشِقَّتَيْنِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اشْهَدُوا ‏\"‏ ‏.‏",
    "malay_translation": "Amru An-Naqid dan Zuhair bin Harb meriwayatkan daripada Sufyan bin Uyainah, daripada Ibnu Abi Najih, daripada Mujahid, daripada Abu Ma'mar, daripada Abdullah. Beliau berkata: \"Bulan telah terbelah dua pada zaman Rasulullah SAW menjadi dua bahagian.  Maka Rasulullah SAW bersabda:  \"Saksikanlah (perkara ini)\"."
  },
  {
    "id": 14175,
    "hadith_number": 6898,
    "tajuk_hadith": "Peristiwa Pembelahan Bulan di Mina",
    "perawi_melayu": "Hadith ini diriwayatkan daripada Abdullah bin Mas'ud.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ أَبِي،\n مُعَاوِيَةَ ح وَحَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي كِلاَهُمَا، عَنِ الأَعْمَشِ، ح وَحَدَّثَنَا \n مِنْجَابُ بْنُ الْحَارِثِ التَّمِيمِيُّ، - وَاللَّفْظُ لَهُ - أَخْبَرَنَا ابْنُ مُسْهِرٍ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ،\n عَنْ أَبِي مَعْمَرٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ بَيْنَمَا نَحْنُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم\n بِمِنًى إِذَا انْفَلَقَ الْقَمَرُ فِلْقَتَيْنِ فَكَانَتْ فِلْقَةٌ وَرَاءَ الْجَبَلِ وَفِلْقَةٌ دُونَهُ فَقَالَ لَنَا رَسُولُ اللَّهِ صلى\n الله عليه وسلم ‏\n\"‏ اشْهَدُوا ‏\"‏ ‏.‏",
    "malay_translation": "Kami bersama Rasulullah SAW di Mina, ketika bulan terbelah dua. Sebahagiannya berada di belakang gunung dan sebahagian lagi di hadapan gunung.  Rasulullah SAW bersabda kepada kami: “Saksikanlah (peristiwa ini).”"
  },
  {
    "id": 14176,
    "hadith_number": 6899,
    "tajuk_hadith": "Peristiwa Pembelahan Bulan",
    "perawi_melayu": "Abdullah bin Mas'ud",
    "english_text": "Bear witness to this.",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، عَنْ \n إِبْرَاهِيمَ، عَنْ أَبِي مَعْمَرٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ انْشَقَّ الْقَمَرُ عَلَى عَهْدِ رَسُولِ اللَّهِ\n صلى الله عليه وسلم فِلْقَتَيْنِ فَسَتَرَ الْجَبَلُ فِلْقَةً وَكَانَتْ فِلْقَةٌ فَوْقَ الْجَبَلِ فَقَالَ رَسُولُ اللَّهِ\n صلى الله عليه وسلم ‏\n\"‏ اللَّهُمَّ اشْهَدْ ‏\"‏ ‏.‏",
    "malay_translation": "Abdullah bin Mas'ud meriwayatkan bahawa bulan terbelah kepada dua bahagian pada zaman Rasulullah SAW.  Satu bahagiannya terlindung di sebalik gunung, dan satu bahagian lagi berada di atas gunung.  Lalu Rasulullah SAW bersabda:  \"Ya Allah, saksikanlah!\"."
  },
  {
    "id": 14177,
    "hadith_number": 6900,
    "tajuk_hadith": "Sanad Lain Menerangkan Perihal Sama",
    "perawi_melayu": "Sanad ini diriwayatkan oleh beberapa perawi.",
    "english_text": "Another chain of transmitters reported the like of this hadith.",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، عَنْ مُجَاهِدٍ، عَنِ \n ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَ ذَلِكَ ‏.‏",
    "malay_translation": "Satu lagi sanad meriwayatkan hadith yang serupa."
  },
  {
    "id": 14178,
    "hadith_number": 6901,
    "tajuk_hadith": "Perbezaan Ringkas Dalam Riwayat Hadis",
    "perawi_melayu": "Syuba (dengan sedikit perbezaan lafaz daripada beberapa perawi lain)",
    "english_text": "This hadith has been transmitted on the authority of Shu'ba with a slight variation of wording.",
    "arabic_text": "وَحَدَّثَنِيهِ بِشْرُ بْنُ خَالِدٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا \n ابْنُ أَبِي عَدِيٍّ، كِلاَهُمَا عَنْ شُعْبَةَ، بِإِسْنَادِ ابْنِ مُعَاذٍ عَنْ شُعْبَةَ، نَحْوَ حَدِيثِهِ غَيْرَ أَنَّ فِي،\n حَدِيثِ ابْنِ أَبِي عَدِيٍّ فَقَالَ ‏\n\"‏ اشْهَدُوا اشْهَدُوا ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Syuba dengan sedikit perbezaan lafaz.  Beberapa perawi lain seperti Bisyr bin Khalid, Muhammad bin Ja’far, Muhammad bin Basysyar dan Ibnu Abi ‘Udy telah meriwayatkan hadis ini daripada Syuba melalui sanad Ibnu Mu’adz.  Namun, terdapat sedikit perbezaan lafaz, di mana dalam riwayat Ibnu Abi ‘Udy, terdapat lafaz  \"Saksikanlah, saksikanlah\"."
  },
  {
    "id": 14179,
    "hadith_number": 6902,
    "tajuk_hadith": "Pembelahan Bulan atas Permintaan Ahli Mekah",
    "perawi_melayu": "Anas bin Malik melalui beberapa sanad",
    "english_text": "Anas reported that the people of Mecca demanded from Allah's Messenger (ﷺ) that he should show them (some) signs (miracles) and he showed twice the splitting of the moon. This hadlth has been narrated on the authority of Anas through another chain of transmitters.",
    "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالاَ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا شَيْبَانُ،\n حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ، أَنَّ أَهْلَ، مَكَّةَ سَأَلُوا رَسُولَ اللَّهِ صلى الله عليه وسلم أَنْ يُرِيَهُمْ آيَةً\n فَأَرَاهُمُ انْشِقَاقَ الْقَمَرِ مَرَّتَيْنِ ‏.‏ \n وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ،\n بِمَعْنَى حَدِيثِ شَيْبَانَ ‏.‏",
    "malay_translation": "Anas meriwayatkan bahawa penduduk Mekah meminta Rasulullah ﷺ menunjukkan kepada mereka beberapa mukjizat.  Baginda kemudian menunjukkan kepada mereka pembelahan bulan sebanyak dua kali. Hadis ini diriwayatkan daripada Anas melalui beberapa jalan sanad."
  },
  {
    "id": 14180,
    "hadith_number": 6903,
    "tajuk_hadith": "Pembelahan Bulan",
    "perawi_melayu": "Anas meriwayatkan bahawa bulan terbelah dua, dan dalam hadis yang diriwayatkan oleh Abu Daud, katanya:",
    "english_text": "\" The moon was split up into two parts during the life of Allah's Messenger (ﷺ).\"",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، وَأَبُو دَاوُدَ ح وَحَدَّثَنَا ابْنُ بَشَّارٍ،\n حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ جَعْفَرٍ، وَأَبُو دَاوُدَ كُلُّهُمْ عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ،\n قَالَ انْشَقَّ الْقَمَرُ فِرْقَتَيْنِ ‏.‏ وَفِي حَدِيثِ أَبِي دَاوُدَ انْشَقَّ الْقَمَرُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى\n الله عليه وسلم ‏.‏",
    "malay_translation": "Anas r.a. meriwayatkan bahawa bulan telah terbelah kepada dua bahagian pada zaman Rasulullah SAW.  Hadis yang diriwayatkan oleh Abu Daud juga menyebut perkara yang sama: Bulan telah terbelah ketika zaman Rasulullah SAW."
  },
  {
    "id": 14181,
    "hadith_number": 6904,
    "tajuk_hadith": "Pembelahan Bulan pada Zaman Rasulullah SAW",
    "perawi_melayu": "Ibn Abbas melalui beberapa perawi seperti Musa bin Quraisy al-Tamimi, Ishaq bin Bakar bin Mudhar, Ja’far bin Rabi’ah, ‘Irak bin Malik, dan Ubaidullah bin Abdullah bin Utbah bin Mas’ud.",
    "english_text": "Ibn 'Abbas reported that the moon was split up during the lifetime of Allah's Messenger (may peace be upon him).",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ قُرَيْشٍ التَّمِيمِيُّ، حَدَّثَنَا إِسْحَاقُ بْنُ بَكْرِ بْنِ مُضَرَ، حَدَّثَنِي أَبِي،\n حَدَّثَنَا جَعْفَرُ بْنُ رَبِيعَةَ، عَنْ عِرَاكِ بْنِ مَالِكٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ،\n عَنِ ابْنِ عَبَّاسٍ، قَالَ إِنَّ الْقَمَرَ انْشَقَّ عَلَى زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Ibn Abbas meriwayatkan bahawa bulan telah terbelah pada zaman Rasulullah SAW."
  },
  {
    "id": 14182,
    "hadith_number": 6905,
    "tajuk_hadith": "Kesabaran Allah SWT",
    "perawi_melayu": "Abu Musa meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَأَبُو أُسَامَةَ عَنِ الأَعْمَشِ، عَنْ \n سَعِيدِ بْنِ جُبَيْرٍ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ أَبِي مُوسَى، قَالَ قَالَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم ‏\"‏ لاَ أَحَدَ أَصْبَرُ عَلَى أَذًى يَسْمَعُهُ مِنَ اللَّهِ عَزَّ وَجَلَّ إِنَّهُ يُشْرَكُ بِهِ وَيُجْعَلُ\n لَهُ الْوَلَدُ ثُمَّ هُوَ يُعَافِيهِمْ وَيَرْزُقُهُمْ ‏\"‏ ‏.‏ \n حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَأَبُو سَعِيدٍ الأَشَجُّ قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا \n الأَعْمَشُ، حَدَّثَنَا سَعِيدُ بْنُ جُبَيْرٍ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ\n صلى الله عليه وسلم ‏.‏ بِمِثْلِهِ إِلاَّ قَوْلَهُ ‏\"‏ وَيُجْعَلُ لَهُ الْوَلَدُ ‏\"‏ ‏.‏ فَإِنَّهُ لَمْ يَذْكُرْهُ ‏.‏",
    "malay_translation": "Abu Musa meriwayatkan bahawa Rasulullah SAW bersabda:  \"Tiada sesiapa yang lebih sabar mendengar perkara yang menyakitkan daripada Allah SWT.  Sesungguhnya Allah SWT diseru dengan syirik dan dikaitkan dengan anak, tetapi walaupun begitu, Dia masih memberi keampunan dan rezeki kepada mereka.\""
  },
  {
    "id": 14183,
    "hadith_number": 6906,
    "tajuk_hadith": "Kesabaran Allah SWT",
    "perawi_melayu": "Abdullah bin Qais",
    "english_text": "Abdullah b. Qais reported from Allah's Messenger (ﷺ) that none is more forbearing in listening to the most irksome things than Allah, the Exalted. They associate rivals with him, attribute sonhood to Him, but in spite of this He provides them sustenance, grants them safety, confers upon them so many things.",
    "arabic_text": "وَحَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الأَعْمَشِ، حَدَّثَنَا سَعِيدُ بْنُ،\n جُبَيْرٍ عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، قَالَ قَالَ عَبْدُ اللَّهِ بْنُ قَيْسٍ قَالَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم ‏\n\"‏ مَا أَحَدٌ أَصْبَرَ عَلَى أَذًى يَسْمَعُهُ مِنَ اللَّهِ تَعَالَى إِنَّهُمْ يَجْعَلُونَ لَهُ نِدًّا وَيَجْعَلُونَ\n لَهُ وَلَدًا وَهُوَ مَعَ ذَلِكَ يَرْزُقُهُمْ وَيُعَافِيهِمْ وَيُعْطِيهِمْ ‏\"‏ ‏.‏",
    "malay_translation": "Abdullah bin Qais meriwayatkan daripada Rasulullah SAW bahawa tiada sesiapa yang lebih penyabar dalam mendengar perkara-perkara yang paling menyakitkan hati melainkan Allah SWT. Mereka mempersekutukan Allah, menjadikan anak bagi-Nya, tetapi walaupun begitu, Allah tetap memberi rezeki kepada mereka, memberi keselamatan kepada mereka, dan memberi pelbagai nikmat kepada mereka."
  },
  {
    "id": 14184,
    "hadith_number": 6907,
    "tajuk_hadith": "Allah SWT dan Janji di Alam Roh",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ،\n عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَقُولُ اللَّهُ تَبَارَكَ وَتَعَالَى لأَهْوَنِ\n أَهْلِ النَّارِ عَذَابًا لَوْ كَانَتْ لَكَ الدُّنْيَا وَمَا فِيهَا أَكُنْتَ مُفْتَدِيًا بِهَا فَيَقُولُ نَعَمْ فَيَقُولُ قَدْ أَرَدْتُ\n مِنْكَ أَهْوَنَ مِنْ هَذَا وَأَنْتَ فِي صُلْبِ آدَمَ أَنْ لاَ تُشْرِكَ - أَحْسَبُهُ قَالَ - وَلاَ أُدْخِلَكَ النَّارَ\n فَأَبَيْتَ إِلاَّ الشِّرْكَ ‏\"‏ ‏.‏",
    "malay_translation": "Allah SWT yang Maha Mulia dan Maha Tinggi akan berfirman kepada penghuni neraka yang paling ringan azabnya: \"Sekiranya engkau memiliki seluruh dunia dan isinya, adakah engkau akan menebus dirimu dengannya?\"  Maka dia akan menjawab, \"Ya.\" Allah SWT akan berfirman, \"Ketika engkau berada di dalam tulang sulbi Adam, Aku telah meminta sesuatu yang lebih mudah daripada ini darimu, iaitu agar engkau tidak menyekutukan Aku. Aku ingatkan, Allah juga berfirman,  \"Aku tidak akan memasukkanmu ke dalam neraka, tetapi engkau tetap mengingkari dan melakukan syirik.\""
  },
  {
    "id": 14185,
    "hadith_number": 6908,
    "tajuk_hadith": "Ancaman Neraka",
    "perawi_melayu": "Hadis ini diriwayatkan melalui Anas bin Malik dengan sanad yang lain, tetapi dengan sedikit perbezaan lafaz.",
    "english_text": "I shall cause him to enter Hell.\" (The words subsequent to these) have not been mentioned.",
    "arabic_text": "حَدَّثَنَاهُ مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدٌ، - يَعْنِي ابْنَ جَعْفَرٍ - حَدَّثَنَا شُعْبَةُ، عَنْ \n أَبِي عِمْرَانَ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ إِلاَّ\n قَوْلَهُ ‏\n\"‏ وَلاَ أُدْخِلَكَ النَّارَ ‏\"‏ ‏.‏ فَإِنَّهُ لَمْ يَذْكُرْهُ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Bashar, telah menceritakan kepada kami Muhammad - iaitu Ibnu Ja'far - telah menceritakan kepada kami Syu'bah, daripada Abu Imran, dia berkata: Aku mendengar Anas bin Malik menceritakan daripada Nabi SAW, seumpamanya, kecuali perkataan: \"Dan Aku tidak akan memasukkan kamu ke dalam neraka.\" Kerana perkataan itu tidak disebut."
  },
  {
    "id": 14186,
    "hadith_number": 6909,
    "tajuk_hadith": "Penebusan pada Hari Kiamat",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "It would be said to the non-believers on the Day of Resurrection: If you were to possess gold, filling the whole earth, would you like to secure your freedom by paying that? He would say: Yes. Thereupon it would be said to him: Something easier (than this) was demanded from you (but you paid no heed to it).",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ،\n بَشَّارٍ قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنَا أَبِي، عَنْ قَتَادَةَ،\n حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يُقَالُ لِلْكَافِرِ يَوْمَ الْقِيَامَةِ أَرَأَيْتَ\n لَوْ كَانَ لَكَ مِلْءُ الأَرْضِ ذَهَبًا أَكُنْتَ تَفْتَدِي بِهِ فَيَقُولُ نَعَمْ ‏.‏ فَيُقَالُ لَهُ قَدْ سُئِلْتَ أَيْسَرَ مِنْ\n ذَلِكَ ‏\"‏ ‏.‏",
    "malay_translation": "Dikatakan kepada orang-orang kafir pada hari kiamat: “Bagaimana jika kamu memiliki emas sepenuh bumi, adakah kamu sanggup menebus dirimu dengannya?” Dia akan berkata: “Ya.” Maka dikatakan kepadanya: “Sesungguhnya kamu telah diminta sesuatu yang lebih mudah daripada itu.”"
  },
  {
    "id": 14187,
    "hadith_number": 6910,
    "tajuk_hadith": "Kebohongan dan Kemudahan Iman",
    "perawi_melayu": "Anas meriwayatkan hadis ini melalui sanad lain dan lafaznya ialah:",
    "english_text": "\" It would be said to him: You have told a lie; what had been demanded from you was quite easier than this (the belief in the Oneness of Allah).\"",
    "arabic_text": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، ح وَحَدَّثَنِي عَمْرُو بْنُ زُرَارَةَ، أَخْبَرَنَا \n عَبْدُ الْوَهَّابِ، - يَعْنِي ابْنَ عَطَاءٍ - كِلاَهُمَا عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ،\n عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ ‏\n\"‏ فَيُقَالُ لَهُ كَذَبْتَ قَدْ سُئِلْتَ مَا هُوَ\n أَيْسَرُ مِنْ ذَلِكَ ‏\"‏ ‏.‏",
    "malay_translation": "Kemudian akan dikatakan kepadanya: \"Engkau telah berdusta!  Sesungguhnya apa yang diminta darimu adalah lebih mudah daripada itu (yakni, keimanan kepada keesaan Allah)."
  },
  {
    "id": 14188,
    "hadith_number": 6911,
    "tajuk_hadith": "Keupayaan Allah pada Hari Kiamat",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa seorang lelaki berkata:",
    "english_text": "Allah's Messenger, how  the non-believers be made to assemble on the Day of Resurrection (by crawling) on their faces? Thereupon he said: Is He Who is powerful to make them walk on their feet not powerful enough to make them (crawl) upon their faces on the Day of Resurrection? Qatada said: Of course, it is so. (He adjured): By the might of our Lord.",
    "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَعَبْدُ بْنُ حُمَيْدٍ، - وَاللَّفْظُ لِزُهَيْرٍ - قَالاَ حَدَّثَنَا يُونُسُ،\n بْنُ مُحَمَّدٍ حَدَّثَنَا شَيْبَانُ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، أَنَّ رَجُلاً، قَالَ يَا رَسُولَ اللَّهِ كَيْفَ\n يُحْشَرُ الْكَافِرُ عَلَى وَجْهِهِ يَوْمَ الْقِيَامَةِ قَالَ ‏\n\"‏ أَلَيْسَ الَّذِي أَمْشَاهُ عَلَى رِجْلَيْهِ فِي الدُّنْيَا\n قَادِرًا عَلَى أَنْ يُمْشِيَهُ عَلَى وَجْهِهِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ قَالَ قَتَادَةُ بَلَى وَعِزَّةِ رَبِّنَا ‏.‏",
    "malay_translation": "Seorang lelaki bertanya kepada Rasulullah SAW, \"Wahai Rasulullah, bagaimanakah orang-orang kafir akan dikumpulkan pada Hari Kiamat dengan merangkak di atas muka mereka?\"  Rasulullah SAW menjawab, \"Bukankah Allah SWT yang mampu menjadikan mereka berjalan dengan kaki di dunia ini, juga mampu menjadikan mereka merangkak dengan muka mereka pada Hari Kiamat?\" Qatadah berkata, \"Ya, demi keagungan Tuhan kita!\"."
  },
  {
    "id": 14189,
    "hadith_number": 6912,
    "tajuk_hadith": "Nikmat dan Kesusahan di Akhirat",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ،\n الْبُنَانِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يُؤْتَى بِأَنْعَمِ أَهْلِ\n الدُّنْيَا مِنْ أَهْلِ النَّارِ يَوْمَ الْقِيَامَةِ فَيُصْبَغُ فِي النَّارِ صَبْغَةً ثُمَّ يُقَالُ يَا ابْنَ آدَمَ هَلْ رَأَيْتَ\n خَيْرًا قَطُّ هَلْ مَرَّ بِكَ نَعِيمٌ قَطُّ فَيَقُولُ لاَ وَاللَّهِ يَا رَبِّ ‏.‏ وَيُؤْتَى بِأَشَدِّ النَّاسِ بُؤْسًا فِي الدُّنْيَا\n مِنْ أَهْلِ الْجَنَّةِ فَيُصْبَغُ صَبْغَةً فِي الْجَنَّةِ فَيُقَالُ لَهُ يَا ابْنَ آدَمَ هَلْ رَأَيْتَ بُؤْسًا قَطُّ هَلْ مَرَّ\n بِكَ شِدَّةٌ قَطُّ فَيَقُولُ لاَ وَاللَّهِ يَا رَبِّ مَا مَرَّ بِي بُؤُسٌ قَطُّ وَلاَ رَأَيْتُ شِدَّةً قَطُّ ‏\"‏ ‏.‏",
    "malay_translation": "Diriwayatkan oleh Amru al-Naqid, daripada Yazid bin Harun, daripada Hammad bin Salamah, daripada Tsabit al-Bunani, daripada Anas bin Malik, bahawa Rasulullah SAW bersabda:  \"Pada hari kiamat, orang yang paling menikmati kesenangan dunia daripada kalangan ahli neraka akan dibawa, lalu dicelupkan ke dalam neraka sekali sahaja. Kemudian dikatakan kepadanya: Wahai anak Adam, pernahkah engkau melihat kebaikan? Pernahkah engkau merasai nikmat?  Maka dia akan berkata: Demi Allah, tidak wahai Tuhanku. Dan orang yang paling menderita di dunia daripada kalangan ahli syurga akan dibawa, lalu dicelupkan ke dalam syurga sekali sahaja. Kemudian dikatakan kepadanya: Wahai anak Adam, pernahkah engkau melihat kesusahan? Pernahkah engkau merasai kesengsaraan? Maka dia akan berkata: Demi Allah, wahai Tuhanku, aku tidak pernah merasai kesusahan dan tidak pernah melihat kesengsaraan.\" "
  },
  {
    "id": 14190,
    "hadith_number": 6913,
    "tajuk_hadith": "Keadilan Allah terhadap Orang Mukmin dan Kafir",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Verily, Allah does not treat a believer unjustly in regard to his virtues. He would confer upon him (His blessing) in this world and would give him reward in the Hereafter. And as regards a non-believer, he would be made to taste the reward (of virtue in this world) what he has done for himself so much that when it would be the Hereafter, he would find no virtue for which he should be rewarded.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لِزُهَيْرٍ - قَالاَ حَدَّثَنَا \n يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا هَمَّامُ بْنُ يَحْيَى، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ اللَّهَ لاَ يَظْلِمُ مُؤْمِنًا حَسَنَةً يُعْطَى بِهَا فِي الدُّنْيَا وَيُجْزَى بِهَا\n فِي الآخِرَةِ وَأَمَّا الْكَافِرُ فَيُطْعَمُ بِحَسَنَاتِ مَا عَمِلَ بِهَا لِلَّهِ فِي الدُّنْيَا حَتَّى إِذَا أَفْضَى إِلَى\n الآخِرَةِ لَمْ تَكُنْ لَهُ حَسَنَةٌ يُجْزَى بِهَا ‏\"‏ ‏.‏",
    "malay_translation": "Sesungguhnya, Allah tidak akan menganiaya seorang mukmin pun kebaikan yang diberikan kepadanya di dunia dan akan diberi pahala di akhirat. Adapun orang kafir, dia akan merasai ganjaran kebaikan daripada apa yang telah dikerjakannya di dunia, sehingga apabila dia sampai ke akhirat, tidak ada kebaikan baginya yang akan diberi pahala."
  },
  {
    "id": 14191,
    "hadith_number": 6914,
    "tajuk_hadith": "Ganjaran Amalan Orang Kafir dan Mukmin",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW telah bersabda:",
    "english_text": "When a non-believer does good he is made to taste Its reward in this world. And so far as the believer is concerned, Allah stores (the reward) of his virtues for the Hereafter and provides him sustenance in accordance with his obedience to Him.",
    "arabic_text": "حَدَّثَنَا عَاصِمُ بْنُ النَّضْرِ التَّيْمِيُّ، حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ أَبِي، حَدَّثَنَا قَتَادَةُ، عَنْ \n أَنَسِ بْنِ مَالِكٍ، أَنَّهُ حَدَّثَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ الْكَافِرَ إِذَا عَمِلَ حَسَنَةً\n أُطْعِمَ بِهَا طُعْمَةً مِنَ الدُّنْيَا وَأَمَّا الْمُؤْمِنُ فَإِنَّ اللَّهَ يَدَّخِرُ لَهُ حَسَنَاتِهِ فِي الآخِرَةِ وَيُعْقِبُهُ رِزْقًا\n فِي الدُّنْيَا عَلَى طَاعَتِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Dari Anas bin Malik, bahawa Rasulullah SAW bersabda:  \"Sesungguhnya orang kafir, jika dia melakukan kebaikan, dia akan merasai ganjarannya di dunia.  Adapun orang mukmin, maka Allah akan menyimpan kebaikan-kebaikannya untuk akhirat dan memberi rezeki kepadanya di dunia berdasarkan ketaatannya.\""
  },
  {
    "id": 14192,
    "hadith_number": 6915,
    "tajuk_hadith": "Sanad Hadis daripada Anas bin Malik",
    "perawi_melayu": "Muhammad bin Abdullah ar-Razi melalui Abdul Wahhab bin Ata, daripada Sa’id, daripada Qatadah, daripada Anas, daripada Nabi SAW (berdasarkan maksud hadis mereka).",
    "english_text": "This hadith has been narrated on the authority of Anas b. Malik through another chain of transmitters.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرُّزِّيُّ، أَخْبَرَنَا عَبْدُ الْوَهَّابِ بْنُ عَطَاءٍ، عَنْ سَعِيدٍ، عَنْ \n قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَى حَدِيثِهِمَا ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Anas bin Malik melalui sanad (rantaian periwayatan) yang lain.  Muhammad bin Abdullah ar-Razi telah memberitahu kami, Abdul Wahhab bin Ata' telah memaklumkan kepada kami, daripada Sa’id, daripada Qatadah, daripada Anas, daripada Nabi SAW (berdasarkan maksud hadis mereka)."
  },
  {
    "id": 14193,
    "hadith_number": 6916,
    "tajuk_hadith": "Perumpamaan Orang Mukmin dan Munafik",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The Similitude of a believer is that of (a standing) crop which the air continues to toss from one side to another; in the same way a believer always (receives the strokes) of misfortune. The similitude of a hypocrite is that of a cypress tree which does not move until it is uprooted.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ،\n عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَثَلُ الْمُؤْمِنِ كَمَثَلِ الزَّرْعِ لاَ\n تَزَالُ الرِّيحُ تُمِيلُهُ وَلاَ يَزَالُ الْمُؤْمِنُ يُصِيبُهُ الْبَلاَءُ وَمَثَلُ الْمُنَافِقِ كَمَثَلِ شَجَرَةِ الأَرْزِ لاَ تَهْتَزُّ\n حَتَّى تَسْتَحْصِدَ ‏\"‏ ‏.‏",
    "malay_translation": "Perumpamaan orang mukmin seperti tanaman yang sentiasa ditiup angin dari satu sisi ke sisi yang lain; begitulah juga orang mukmin sentiasa ditimpa musibah.  Perumpamaan orang munafik pula seperti pokok aras yang tidak bergoyang sehingga ia ditebang."
  },
  {
    "id": 14194,
    "hadith_number": 6917,
    "tajuk_hadith": "Perbezaan Ringkas Perawi Hadis Zuhri",
    "perawi_melayu": "Zuhri",
    "english_text": "This hadith has been narrated on the authority of Zuhri with the same chain of transmitters, but with a slight variation of wording.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، عَنْ عَبْدِ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ،\n بِهَذَا الإِسْنَادِ غَيْرَ أَنَّ فِي، حَدِيثِ عَبْدِ الرَّزَّاقِ مَكَانَ قَوْلِهِ تُمِيلُهُ ‏\n\"‏ تُفِيئُهُ ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Zuhri dengan sanad yang sama, tetapi dengan sedikit perbezaan lafaz."
  },
  {
    "id": 14195,
    "hadith_number": 6918,
    "tajuk_hadith": "Perumpamaan Orang Mukmin dan Kafir",
    "perawi_melayu": "Ka'b bin Malik melalui bapanya",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَمُحَمَّدُ بْنُ بِشْرٍ، قَالاَ حَدَّثَنَا \n زَكَرِيَّاءُ بْنُ أَبِي زَائِدَةَ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، حَدَّثَنِي ابْنُ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، كَعْبٍ قَالَ\n قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَثَلُ الْمُؤْمِنِ كَمَثَلِ الْخَامَةِ مِنَ الزَّرْعِ تُفِيئُهَا الرِّيحُ\n وَتَصْرَعُهَا مَرَّةً وَتَعْدِلُهَا أُخْرَى حَتَّى تَهِيجَ وَمَثَلُ الْكَافِرِ كَمَثَلِ الأَرْزَةِ الْمُجْذِيَةِ عَلَى أَصْلِهَا\n لاَ يُفِيئُهَا شَىْءٌ حَتَّى يَكُونَ انْجِعَافُهَا مَرَّةً وَاحِدَةً ‏\"‏ ‏.‏",
    "malay_translation": "Abu Bakar bin Abi Syaibah telah meriwayatkan daripada Abdullah bin Numair dan Muhammad bin Syahr, mereka berdua berkata: Zakaria bin Abi Zaidah telah meriwayatkan daripada Saad bin Ibrahim, yang telah meriwayatkan dari Ibnu Ka'ab bin Malik, daripada bapanya, Ka'ab, bahawa Rasulullah SAW bersabda: “Perumpamaan orang mukmin seperti sebatang tumbuhan di sawah yang ditiup angin, ia akan condong tetapi akan kembali tegak semula sehingga ia tetap kukuh di akarnya.  Dan perumpamaan orang kafir seperti sebatang pokok aras yang berakar teguh di tempatnya. Tiada apa yang dapat menggoncangkannya sehingga ia tumbang sekaligus.”"
  },
  {
    "id": 14196,
    "hadith_number": 6919,
    "tajuk_hadith": "Perumpamaan Orang Mukmin dan Munafik",
    "perawi_melayu": "Ka'b bin Malik melalui bapanya",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ، وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالاَ حَدَّثَنَا \n سُفْيَانُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَثَلُ الْمُؤْمِنِ كَمَثَلِ الْخَامَةِ مِنَ الزَّرْعِ تُفِيئُهَا الرِّيَاحُ تَصْرَعُهَا\n مَرَّةً وَتَعْدِلُهَا حَتَّى يَأْتِيَهُ أَجَلُهُ وَمَثَلُ الْمُنَافِقِ مَثَلُ الأَرْزَةِ الْمُجْذِيَةِ الَّتِي لاَ يُصِيبُهَا شَىْءٌ\n حَتَّى يَكُونَ انْجِعَافُهَا مَرَّةً وَاحِدَةً ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Zuhri bin Harb, telah menceritakan kepada kami Bisr bin Syari dan Abdul Rahman bin Mahdi, keduanya berkata: Telah menceritakan kepada kami Sufyan dari Saad bin Ibrahim dari Abdul Rahman bin Ka'ab bin Malik dari bapanya, katanya: Rasulullah SAW bersabda:  \"Perumpamaan orang mukmin seperti perumpamaan tanaman yang ditiup angin, kadangkala angin itu menggoncangkannya, kadangkala merobohkannya, hingga tiba ajalnya. Dan perumpamaan orang munafik seperti perumpamaan pohon aras yang berakar kuat yang tidak terkena apa-apa sehingga ia tumbang sekaligus.\""
  },
  {
    "id": 14197,
    "hadith_number": 6920,
    "tajuk_hadith": "Perbezaan Riwayat Hadis",
    "perawi_melayu": "Muhammad bin Hatim dan Mahmud bin Ghailan meriwayatkan daripada Bishr bin Sari, daripada Sufyan, daripada Saad bin Ibrahim, daripada Abdullah bin Ka'ab bin Malik, daripada bapanya, daripada Nabi SAW.  Namun, terdapat perbezaan dalam riwayat Mahmud.",
    "english_text": "This hadith has been narrated through a couple of other chains of transmitters, one which says \"the similitude of the disbeliever\" instead and another which agrees with the wording of the previous hadith.",
    "arabic_text": "وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ حَاتِمٍ، وَمَحْمُودُ بْنُ غَيْلاَنَ، قَالاَ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ، حَدَّثَنَا \n سُفْيَانُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله\n عليه وسلم غَيْرَ أَنَّ مَحْمُودًا قَالَ فِي رِوَايَتِهِ عَنْ بِشْرٍ ‏\"‏ وَمَثَلُ الْكَافِرِ كَمَثَلِ الأَرْزَةِ ‏\"‏ ‏.‏\n وَأَمَّا ابْنُ حَاتِمٍ فَقَالَ ‏\"‏ مَثَلُ الْمُنَافِقِ ‏\"‏ ‏.‏ كَمَا قَالَ زُهَيْرٌ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan melalui beberapa sanad lain.  Satu riwayat menyebut “perumpamaan orang kafir”, manakala riwayat yang lain sependapat dengan lafaz hadis sebelumnya.  Muhammad bin Hatim dan Mahmud bin Ghailan meriwayatkan daripada Bishr bin Sari, daripada Sufyan, daripada Saad bin Ibrahim, daripada Abdullah bin Ka'ab bin Malik, daripada bapanya, daripada Nabi SAW.  Perbezaan terdapat dalam riwayat Mahmud yang menyebut perumpamaan orang kafir, berbeza dengan riwayat lain yang menyebut perumpamaan orang munafik."
  },
  {
    "id": 14198,
    "hadith_number": 6921,
    "tajuk_hadith": "Perumpamaan Orang Kafir Seperti Pokok Ara",
    "perawi_melayu": "Muhammad bin Bashar dan Abdullah bin Hashim meriwayatkan daripada Yahya (al-Qattan), daripada Sufyan, daripada Saad bin Ibrahim.  Ibn Hashim berkata daripada Abdullah bin Ka'b bin Malik daripada bapanya. Ibn Bashar pula berkata daripada Ibn Ka'b bin Malik daripada bapanya, daripada Nabi SAW.",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ بَشَّارٍ، وَعَبْدُ اللَّهِ بْنُ هَاشِمٍ، قَالاَ حَدَّثَنَا يَحْيَى، - وَهُوَ الْقَطَّانُ\n - عَنْ سُفْيَانَ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، - قَالَ ابْنُ هَاشِمٍ عَنْ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ،\n عَنْ أَبِيهِ، وَقَالَ ابْنُ بَشَّارٍ، عَنِ ابْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، - عَنِ النَّبِيِّ صلى الله عليه وسلم\n بِنَحْوِ حَدِيثِهِمْ وَقَالاَ جَمِيعًا فِي حَدِيثِهِمَا عَنْ يَحْيَى، ‏\n\"‏ وَمَثَلُ الْكَافِرِ مَثَلُ الأَرْزَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Muhammad bin Bashar dan Abdullah bin Hashim meriwayatkan daripada Yahya (al-Qattan), daripada Sufyan, daripada Saad bin Ibrahim. Ibn Hashim berkata daripada Abdullah bin Ka'b bin Malik daripada bapanya. Ibn Bashar pula berkata daripada Ibn Ka'b bin Malik daripada bapanya, daripada Nabi SAW,  dengan maksud yang sama seperti riwayat mereka. Mereka berdua menyebut dalam riwayat mereka daripada Yahya,  \"Perumpamaan orang kafir seperti pokok ara.\""
  },
  {
    "id": 14199,
    "hadith_number": 6922,
    "tajuk_hadith": "Pokok Kurma Sebagai Umpama Muslim",
    "perawi_melayu": "'Abdullah bin Umar meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، - وَاللَّفْظُ لِيَحْيَى\n - قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنُونَ ابْنَ جَعْفَرٍ - أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ دِينَارٍ، أَنَّهُ سَمِعَ عَبْدَ،\n اللَّهِ بْنَ عُمَرَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنَ الشَّجَرِ شَجَرَةً لاَ يَسْقُطُ\n وَرَقُهَا وَإِنَّهَا مَثَلُ الْمُسْلِمِ فَحَدِّثُونِي مَا هِيَ ‏\"‏ ‏.‏ فَوَقَعَ النَّاسُ فِي شَجَرِ الْبَوَادِي ‏.‏ قَالَ\n عَبْدُ اللَّهِ وَوَقَعَ فِي نَفْسِي أَنَّهَا النَّخْلَةُ فَاسْتَحْيَيْتُ ثُمَّ قَالُوا حَدِّثْنَا مَا هِيَ يَا رَسُولَ اللَّهِ\n قَالَ فَقَالَ ‏\"‏ هِيَ النَّخْلَةُ ‏\"‏ ‏.‏ قَالَ فَذَكَرْتُ ذَلِكَ لِعُمَرَ قَالَ لأَنْ تَكُونَ قُلْتَ هِيَ النَّخْلَةُ أَحَبُّ\n إِلَىَّ مِنْ كَذَا وَكَذَا ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Yahya bin Ayub, dan Qotaibah bin Sa’id, dan Ali bin Hujr As-Sa’di – dan lafaznya daripada Yahya – mereka berkata: Telah menceritakan kepada kami Ismail – iaitu Ibnu Ja’far – telah memberitakan kepadaku Abdullah bin Dinar, bahawa dia mendengar Abdullah bin Umar berkata: Rasulullah SAW bersabda:  “Sesungguhnya di antara pokok-pokok kayu itu ada sejenis pokok yang daunnya tidak gugur, dan ia adalah sebagai umpama orang Islam. Maka beritakanlah kepadaku apakah pokok itu?” Maka orang ramai pun memikirkan tentang pokok-pokok di padang pasir. Abdullah berkata:  Aku terfikir bahawa pokok itu ialah pokok kurma, maka aku merasa malu. Kemudian mereka berkata: Beritakanlah kepada kami, apakah pokok itu ya Rasulullah? Baginda menjawab: “Ia ialah pokok kurma.”  Aku menceritakan hal itu kepada Umar, lalu dia berkata: Sekiranya engkau berkata bahawa ia ialah pokok kurma, nescaya ia lebih aku sukai daripada sekian-sekian.”"
  },
  {
    "id": 14200,
    "hadith_number": 6923,
    "tajuk_hadith": "Pokok Kurma Sebagai Simbol Orang Mukmin",
    "perawi_melayu": "Ibnu Umar meriwayatkan bahawa Rasulullah SAW suatu hari berkata kepada para sahabatnya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي الْخَلِيلِ،\n الضُّبَعِيِّ عَنْ مُجَاهِدٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمًا لأَصْحَابِهِ\n ‏\"‏ أَخْبِرُونِي عَنْ شَجَرَةٍ مَثَلُهَا مَثَلُ الْمُؤْمِنِ ‏\"‏ ‏.‏ فَجَعَلَ الْقَوْمُ يَذْكُرُونَ شَجَرًا مِنْ شَجَرِ الْبَوَادِي\n ‏.‏ قَالَ ابْنُ عُمَرَ وَأُلْقِيَ فِي نَفْسِي أَوْ رُوعِيَ أَنَّهَا النَّخْلَةُ فَجَعَلْتُ أُرِيدُ أَنْ أَقُولَهَا فَإِذَا أَسْنَانُ\n الْقَوْمِ فَأَهَابُ أَنْ أَتَكَلَّمَ فَلَمَّا سَكَتُوا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هِيَ النَّخْلَةُ\n ‏\"‏ ‏.‏",
    "malay_translation": "Ibnu Umar meriwayatkan bahawa Rasulullah SAW suatu hari bertanya kepada para sahabatnya, \"Beritakan kepadaku tentang sejenis pokok yang persamaannya seperti orang beriman.\" Maka orang ramai mula menyebut pelbagai jenis pokok di padang pasir. Ibnu Umar berkata, \"Terlintas di hatiku bahawa ia adalah pokok kurma. Aku ingin menyebutkannya, tetapi aku segan kerana kehadiran orang-orang tua di situ. Apabila mereka semua telah berhenti bercakap, Rasulullah SAW bersabda, \"Ia adalah pokok kurma.\""
  },
  {
    "id": 14201,
    "hadith_number": 6924,
    "tajuk_hadith": "Kisah Mujahid Bersama Ibnu Umar",
    "perawi_melayu": "Mujahid berkata:",
    "english_text": "(I have had the privilege) of accompanying Ibn 'Umar up to Medina but I did not hear him narrate anything from Allah's Messenger (ﷺ) except one hadith. And he said: We were in the presence of Allah's Messenger (ﷺ) that there was brought to him the kernel of a date. The rest of the hadith is the same.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ أَبِي عُمَرَ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ \n ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، قَالَ صَحِبْتُ ابْنَ عُمَرَ إِلَى الْمَدِينَةِ فَمَا سَمِعْتُهُ يُحَدِّثُ، عَنْ رَسُولِ\n اللَّهِ صلى الله عليه وسلم إِلاَّ حَدِيثًا وَاحِدًا قَالَ كُنَّا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَأُتِيَ\n بِجُمَّارٍ ‏.‏ فَذَكَرَ بِنَحْوِ حَدِيثِهِمَا ‏.‏",
    "malay_translation": "Aku telah menemani Ibnu Umar ke Madinah, tetapi aku tidak pernah mendengarnya meriwayatkan sesuatu daripada Rasulullah ﷺ kecuali satu hadis.  Beliau berkata: Kami berada di sisi Rasulullah ﷺ, lalu dihidangkan kepadanya sebiji biji kurma.  Baki hadisnya adalah sama."
  },
  {
    "id": 14202,
    "hadith_number": 6925,
    "tajuk_hadith": "Rasulullah SAW Diberi Bijirin",
    "perawi_melayu": "Mujahid meriwayatkan:",
    "english_text": "I heard Ibn 'Umar as saying: There was brought to Allah's Messenger (ﷺ) the kernel. The rest of the hadith is tile same.",
    "arabic_text": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سَيْفٌ، قَالَ سَمِعْتُ مُجَاهِدًا، يَقُولُ سَمِعْتُ ابْنَ،\n عُمَرَ يَقُولُ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِجُمَّارٍ ‏.‏ فَذَكَرَ نَحْوَ حَدِيثِهِمْ ‏.‏",
    "malay_translation": "Aku mendengar daripada Ibnu Umar berkata: Telah dihadiahkan kepada Rasulullah SAW bijirin.  Baki hadis tersebut adalah sama."
  },
  {
    "id": 14203,
    "hadith_number": 6926,
    "tajuk_hadith": "Pokok Seperti Muslim yang Beriman",
    "perawi_melayu": "Ibn Umar meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ \n نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كُنَّا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ أَخْبِرُونِي بِشَجَرَةٍ\n شِبْهِ أَوْ كَالرَّجُلِ الْمُسْلِمِ لاَ يَتَحَاتُّ وَرَقُهَا ‏\"‏ ‏.‏ قَالَ إِبْرَاهِيمُ لَعَلَّ مُسْلِمًا قَالَ وَتُؤْتِي أُكُلَهَا\n ‏.‏ وَكَذَا وَجَدْتُ عِنْدَ غَيْرِي أَيْضًا وَلاَ تُؤْتِي أُكُلَهَا كُلَّ حِينٍ ‏.‏ قَالَ ابْنُ عُمَرَ فَوَقَعَ فِي نَفْسِي\n أَنَّهَا النَّخْلَةُ وَرَأَيْتُ أَبَا بَكْرٍ وَعُمَرَ لاَ يَتَكَلَّمَانِ فَكَرِهْتُ أَنْ أَتَكَلَّمَ أَوْ أَقُولَ شَيْئًا فَقَالَ عُمَرُ\n لأَنْ تَكُونَ قُلْتَهَا أَحَبُّ إِلَىَّ مِنْ كَذَا وَكَذَا ‏.‏",
    "malay_translation": "Abu Bakar bin Abi Syaibah telah meriwayatkan daripada Abu Usamah, yang meriwayatkan daripada Ubaidullah bin Umar, daripada Nafi', daripada Ibn Umar, katanya:  Kami berada di sisi Rasulullah SAW, lalu baginda bertanya, \"Ceraikan aku tentang sejenis pohon yang menyerupai atau seperti seorang muslim yang beriman, yang daunnya tidak layu.\" Ibrahim berkata, mungkin Muslim telah menyatakan demikian:  \"Ia sentiasa berbuah.\" Demikian juga yang aku jumpai pada sumber lain, tetapi ia tidak sentiasa berbuah. Ibn Umar berkata, maka terlintas di fikiran saya bahawa ia adalah pokok kurma, dan aku melihat Abu Bakar dan Umar tidak bersuara, maka aku tidak mahu berkata atau menyatakan apa-apa.  Lalu Umar berkata, sekiranya engkau mengatakannya, ia lebih aku sukai daripada sekian-sekian."
  },
  {
    "id": 14204,
    "hadith_number": 6927,
    "tajuk_hadith": "Kekecewaan Syaitan di Jazirah Arab",
    "perawi_melayu": "Jabir meriwayatkan:",
    "english_text": "I heard Allah's Apostle (ﷺ) as saying: Verily, the Satan has lost all hopes that the worshippers would ever worship (him) in the peninsula of Arabia, but he (is hopeful) that he would sow the seed of dissension amongst them.",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ،\n عُثْمَانُ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله\n عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ الشَّيْطَانَ قَدْ أَيِسَ أَنْ يَعْبُدَهُ الْمُصَلُّونَ فِي جَزِيرَةِ الْعَرَبِ وَلَكِنْ فِي\n التَّحْرِيشِ بَيْنَهُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah ﷺ bersabda:  Sesungguhnya syaitan telah hilang harapan bahawa para penyembah akan menyembahnya di Jazirah Arab.  Namun, dia masih berharap untuk menanam benih perselisihan di antara mereka."
  },
  {
    "id": 14205,
    "hadith_number": 6928,
    "tajuk_hadith": "Sanad Hadith yang Sama daripada al-A'mash",
    "perawi_melayu": "Abu Bakar bin Abi Syaibah melalui Wakie' dan Abu Kuraib melalui Abu Muawiyah, daripada al-A'mash.",
    "english_text": "This hadith has been narrated on the authority of A'mash with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو\n مُعَاوِيَةَ كِلاَهُمَا عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ ‏.‏",
    "malay_translation": "Hadith ini diriwayatkan daripada al-A'mash dengan sanad (rantaian periwayat) yang sama.  Abu Bakar bin Abi Syaibah meriwayatkan daripada Wakie', dan Abu Kuraib meriwayatkan daripada Abu Muawiyah, kedua-duanya daripada al-A'mash dengan sanad yang sama."
  },
  {
    "id": 14206,
    "hadith_number": 6929,
    "tajuk_hadith": "Takhta Iblis dan Ujian Fitnah",
    "perawi_melayu": "Jabir meriwayatkan:",
    "english_text": "I heard Allah's Messenger (way peace be upon him) as saying: The throne of Iblis is upon the ocean and he sends detachments (to different parts) inorder to put people to trial and the most important figure in his eyes is one who is most notorious in sowing the seed of dissension.",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ،\n عُثْمَانُ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله\n عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ عَرْشَ إِبْلِيسَ عَلَى الْبَحْرِ فَيَبْعَثُ سَرَايَاهُ فَيَفْتِنُونَ النَّاسَ فَأَعْظَمُهُمْ\n عِنْدَهُ أَعْظَمُهُمْ فِتْنَةً ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda: \"Sesungguhnya takhta Iblis berada di atas lautan.  Dia menghantar pasukan-pasukannya untuk menggoda manusia.  Dan orang yang paling penting di sisi Iblis ialah orang yang paling besar fitnahnya.\""
  },
  {
    "id": 14207,
    "hadith_number": 6930,
    "tajuk_hadith": "Syaitan dan Usaha Menimbulkan Perpecahan",
    "perawi_melayu": "Jabir meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ - وَاللَّفْظُ لأَبِي كُرَيْبٍ\n - قَالاَ أَخْبَرَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ إِبْلِيسَ يَضَعُ عَرْشَهُ عَلَى الْمَاءِ ثُمَّ يَبْعَثُ سَرَايَاهُ فَأَدْنَاهُمْ\n مِنْهُ مَنْزِلَةً أَعْظَمُهُمْ فِتْنَةً يَجِيءُ أَحَدُهُمْ فَيَقُولُ فَعَلْتُ كَذَا وَكَذَا فَيَقُولُ مَا صَنَعْتَ شَيْئًا قَالَ\n ثُمَّ يَجِيءُ أَحَدُهُمْ فَيَقُولُ مَا تَرَكْتُهُ حَتَّى فَرَّقْتُ بَيْنَهُ وَبَيْنَ امْرَأَتِهِ - قَالَ - فَيُدْنِيهِ مِنْهُ وَيَقُولُ\n نِعْمَ أَنْتَ ‏\"‏ ‏.‏ قَالَ الأَعْمَشُ أُرَاهُ قَالَ ‏\"‏ فَيَلْتَزِمُهُ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Kuraib, Muhammad bin Al-Ala' dan Ishaq bin Ibrahim – dan lafaznya daripada Abu Kuraib – berkata: Mereka berdua memberitakan kepada kami, Abu Muawiyah telah meriwayatkan kepada kami daripada Al-A'masy, daripada Abu Sufian, daripada Jabir, bahawa Rasulullah SAW bersabda: \"Sesungguhnya Iblis meletakkan takhtanya di atas air, kemudian dia menghantar bala tenteranya. Maka yang paling dekat kedudukannya dengannya ialah mereka yang paling besar fitnahnya. Seorang daripada mereka datang lalu berkata: Aku telah melakukan begini dan begitu. Maka Iblis berkata: Engkau tidak melakukan apa-apa. Kemudian seorang daripada mereka datang lalu berkata: Aku tidak meninggalkannya sehingga aku mencetuskan perselisihan di antara dia dengan isterinya. Maka Iblis mendekatkannya dan berkata: Engkau sungguh baik.\" Al-A'masy berkata: Aku nampak dia berkata: \"Kemudian Iblis memeluknya.\""
  },
  {
    "id": 14208,
    "hadith_number": 6931,
    "tajuk_hadith": "Fitnah dan Syaitan",
    "perawi_melayu": "Jabir meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The Satan sends detachments of his own in order to put people to trial and the highest in rank, in his eyes, is one who is most notorious in sowing the seed of dissension.",
    "arabic_text": "حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ \n جَابِرٍ، أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ يَبْعَثُ الشَّيْطَانُ سَرَايَاهُ فَيَفْتِنُونَ النَّاسَ\n فَأَعْظَمُهُمْ عِنْدَهُ مَنْزِلَةً أَعْظَمُهُمْ فِتْنَةً ‏\"‏ ‏.‏",
    "malay_translation": "Jabir meriwayatkan bahawa Nabi Muhammad SAW bersabda: \"Syaitan menghantar pasukan-pasukannya untuk menguji manusia.  Di sisi syaitan, yang paling tinggi darjatnya ialah mereka yang paling terkenal menabur benih perbalahan.\""
  },
  {
    "id": 14209,
    "hadith_number": 6932,
    "tajuk_hadith": "Malaikat dan Jin yang Diutuskan Kepada Manusia",
    "perawi_melayu": "Abdullah bin Mas'ud meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There is none amongst you with whom is not an attache from amongst the jinn (devil). They (the Companions) said: Allah's Messenger, with you too? Thereupon he said: Yes, but Allah helps me against him and so I am safe from his hand and he does not command me but for good.",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ،\n عُثْمَانُ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ،\n قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا مِنْكُمْ مِنْ أَحَدٍ إِلاَّ وَقَدْ وُكِّلَ بِهِ قَرِينُهُ مِنَ\n الْجِنِّ ‏\"‏ ‏.‏ قَالُوا وَإِيَّاكَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَإِيَّاىَ إِلاَّ أَنَّ اللَّهَ أَعَانَنِي عَلَيْهِ فَأَسْلَمَ فَلاَ\n يَأْمُرُنِي إِلاَّ بِخَيْرٍ ‏\"‏ ‏.‏",
    "malay_translation": "Tiada seorang pun di antara kamu melainkan telah diutuskan kepadanya seorang jin (syaitan).  Para sahabat bertanya: “Wahai Rasulullah, adakah engkau juga?” Baginda menjawab: “Ya, tetapi Allah menolongku terhadapnya, maka ia tunduk dan tidak memerintahkanku melainkan kepada kebaikan.”"
  },
  {
    "id": 14210,
    "hadith_number": 6933,
    "tajuk_hadith": "Perbezaan Ringkas Perawi Hadis",
    "perawi_melayu": "Mansur (dengan beberapa perawi lain)",
    "english_text": "This hadith has been narrated on the authority of Mansiir with the same chain of transmitters but with a slight variation of wording.",
    "arabic_text": "حَدَّثَنَا ابْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، - يَعْنِيَانِ ابْنَ مَهْدِيٍّ -\n عَنْ سُفْيَانَ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ عَمَّارِ بْنِ رُزَيْقٍ،\n كِلاَهُمَا عَنْ مَنْصُورٍ، بِإِسْنَادِ جَرِيرٍ ‏.‏ مِثْلَ حَدِيثِهِ غَيْرَ أَنَّ فِي حَدِيثِ سُفْيَانَ ‏\n\"‏ وَقَدْ وُكِّلَ\n بِهِ قَرِينُهُ مِنَ الْجِنِّ وَقَرِينُهُ مِنَ الْمَلاَئِكَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Mansur melalui sanad yang sama, tetapi dengan sedikit perbezaan lafaz.  (Daripada Ibn al-Muthannā dan Ibn Bashshār yang meriwayatkan daripada Abdur Rahman—maksudnya Ibn Mahdī—daripada Sufyan.  Juga diriwayatkan daripada Abu Bakar ibn Abi Syaibah yang meriwayatkan daripada Yahya ibn Adam, daripada ‘Ammar ibn Ruzaiq, kedua-duanya daripada Mansur, melalui sanad Jarir.  Sama seperti hadisnya, cuma dalam hadis Sufyan terdapat lafaz  \"Dan dia telah diamanahkan dengannya oleh qarinnya daripada kalangan jin dan qarinnya daripada kalangan malaikat.\")"
  },
  {
    "id": 14211,
    "hadith_number": 6934,
    "tajuk_hadith": "Kecemburuan Aisyah dan Syaitan",
    "perawi_melayu": "Aisyah isteri Rasulullah SAW",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي أَبُو صَخْرٍ، عَنِ ابْنِ،\n قُسَيْطٍ حَدَّثَهُ أَنَّ عُرْوَةَ حَدَّثَهُ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم حَدَّثَتْهُ أَنَّ رَسُولَ\n اللَّهِ صلى الله عليه وسلم خَرَجَ مِنْ عِنْدِهَا لَيْلاً ‏.‏ قَالَتْ فَغِرْتُ عَلَيْهِ فَجَاءَ فَرَأَى مَا أَصْنَعُ\n فَقَالَ ‏\"‏ مَا لَكِ يَا عَائِشَةُ أَغِرْتِ ‏\"‏ ‏.‏ فَقُلْتُ وَمَا لِي لاَ يَغَارُ مِثْلِي عَلَى مِثْلِكَ فَقَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\"‏ أَقَدْ جَاءَكِ شَيْطَانُكِ ‏\"‏ ‏.‏ قَالَتْ يَا رَسُولَ اللَّهِ أَوَمَعِيَ شَيْطَانٌ\n قَالَ ‏\"‏ نَعَمْ ‏\"‏ ‏.‏ قُلْتُ وَمَعَ كُلِّ إِنْسَانٍ قَالَ ‏\"‏ نَعَمْ ‏\"‏ ‏.‏ قُلْتُ وَمَعَكَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏\n نَعَمْ وَلَكِنْ رَبِّي أَعَانَنِي عَلَيْهِ حَتَّى أَسْلَمَ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Harun bin Sa'id al-Ayliy, telah menceritakan kepada kami Ibnu Wahb, telah memberitakan kepadaku Abu Sakhr, daripada Ibnu Qushayth, telah menceritakan kepadanya bahawa Urwah telah menceritakan kepadanya bahawa Aisyah, isteri Nabi SAW telah menceritakan kepadanya bahawa Rasulullah SAW keluar dari sisinya pada waktu malam.  Aisyah berkata, \"Maka aku cemburu kepadanya. Kemudian baginda datang dan melihat keadaanku. Baginda bertanya, \"Apakah yang terjadi kepadamu wahai Aisyah? Kamu cemburu?\"  Aku menjawab, \"Mengapa aku tidak cemburu sepertiku kepada seperti engkau?\" Rasulullah SAW bersabda, \"Sesungguhnya syaitanmu telah mendatangimu.\" Aku berkata, \"Wahai Rasulullah, adakah bersamaku syaitan?\" Baginda menjawab, \"Ya.\" Aku berkata, \"Dan bersama setiap manusia?\" Baginda menjawab, \"Ya.\" Aku berkata, \"Dan bersamamu juga wahai Rasulullah?\" Baginda menjawab, \"Ya, tetapi Tuhanku telah menolongku terhadapnya sehingga aku selamat darinya.\""
  },
  {
    "id": 14212,
    "hadith_number": 6935,
    "tajuk_hadith": "Keselamatan Bukan Semata-mata Kerana Amalan",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ بُكَيْرٍ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ،\n عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\"‏ لَنْ يُنْجِيَ أَحَدًا مِنْكُمْ عَمَلُهُ ‏\"‏ ‏.‏ قَالَ رَجُلٌ\n وَلاَ إِيَّاكَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَلاَ إِيَّاىَ إِلاَّ أَنْ يَتَغَمَّدَنِيَ اللَّهُ مِنْهُ بِرَحْمَةٍ وَلَكِنْ سَدِّدُوا ‏\"‏\n ‏.‏ \n وَحَدَّثَنِيهِ يُونُسُ بْنُ عَبْدِ الأَعْلَى الصَّدَفِيُّ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو،\n بْنُ الْحَارِثِ عَنْ بُكَيْرِ بْنِ الأَشَجِّ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّهُ قَالَ ‏\"‏ بِرَحْمَةٍ مِنْهُ وَفَضْلٍ ‏\"‏ ‏.‏ وَلَمْ\n يَذْكُرْ ‏\"‏ وَلَكِنْ سَدِّدُوا ‏\"‏ ‏.‏",
    "malay_translation": "Tidak seorang pun daripada kamu akan diselamatkan semata-mata kerana amalannya.  Seseorang berkata: Wahai Rasulullah, bahkan engkau juga?  Lalu baginda menjawab: Ya, bahkan aku pun tidak melainkan Allah melimpahiku dengan rahmat-Nya, tetapi kamu hendaklah bertindak secara sederhana."
  },
  {
    "id": 14213,
    "hadith_number": 6936,
    "tajuk_hadith": "Rahmat Allah SWT Jalan Masuk Syurga",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There is none whose deeds alone would entitle him to get into Paradise. It was said to him: And, Allah's Messenger, not even you? Thereupon he said: Not even I, but that my Lord wraps me in Mercy.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَمَّادٌ، - يَعْنِي ابْنَ زَيْدٍ - عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ،\n عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ مَا مِنْ أَحَدٍ يُدْخِلُهُ عَمَلُهُ الْجَنَّةَ ‏\"‏\n ‏.‏ فَقِيلَ وَلاَ أَنْتَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَلاَ أَنَا إِلاَّ أَنْ يَتَغَمَّدَنِي رَبِّي بِرَحْمَةٍ ‏\"‏ ‏.‏",
    "malay_translation": "Tiada seorang pun yang hanya dengan amalannya sahaja akan melayakkan dirinya masuk ke syurga.  Lalu dikatakan kepadanya: Wahai Rasulullah, adakah engkau juga tidak?  Maka baginda bersabda: Aku pun tidak, melainkan jika Tuhanku melimpahiku dengan rahmat."
  },
  {
    "id": 14214,
    "hadith_number": 6937,
    "tajuk_hadith": "Amal Saja Tidak Cukup untuk Keselamatan",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There is none amongst you whose deeds alone would attain salvation for him. They (the Companions) said: Allah's Messenger, not even you? He (the Holy Prophet) said: Not even I, but that Allah wraps me in Mercy and He grants me pardon. Ibn 'Aun pointed towards his head with his hand saying: Not even I, but that Allah wraps me in His Forgiveness and Mercy.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنِ ابْنِ عَوْنٍ، عَنْ مُحَمَّدٍ، عَنْ أَبِي،\n هُرَيْرَةَ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَيْسَ أَحَدٌ مِنْكُمْ يُنْجِيهِ عَمَلُهُ ‏\"‏ ‏.‏ قَالُوا وَلاَ\n أَنْتَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَلاَ أَنَا إِلاَّ أَنْ يَتَغَمَّدَنِيَ اللَّهُ مِنْهُ بِمَغْفِرَةٍ وَرَحْمَةٍ ‏\"‏ ‏.‏ وَقَالَ ابْنُ\n عَوْنٍ بِيَدِهِ هَكَذَا وَأَشَارَ عَلَى رَأْسِهِ ‏\"‏ وَلاَ أَنَا إِلاَّ أَنْ يَتَغَمَّدَنِيَ اللَّهُ مِنْهُ بِمَغْفِرَةٍ وَرَحْمَةٍ ‏\"‏\n ‏.‏",
    "malay_translation": "Tiada seorang pun di antara kamu yang hanya amalnya sahaja akan menyelamatkannya. Mereka (para Sahabat) berkata: Wahai Rasulullah, adakah engkau juga tidak? Baginda (Nabi Muhammad SAW) bersabda: Aku juga tidak, melainkan Allah melimpahiku dengan rahmat dan keampunanNya. Ibn ‘Aun menunjuk ke kepalanya dengan tangannya sambil berkata: Aku juga tidak, melainkan Allah melimpahiku dengan keampunan dan rahmatNya."
  },
  {
    "id": 14215,
    "hadith_number": 6938,
    "tajuk_hadith": "Rahmat Allah SWT: Jaminan Keselamatan",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There is none whose deeds alone can secure salvation for him. They said: Allah's Messenger, not even you? Thereupon he said: Not even I, but that, the Mercy of Allah should take hold of me.",
    "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ\n قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَيْسَ أَحَدٌ يُنْجِيهِ عَمَلُهُ ‏\"‏ ‏.‏ قَالُوا وَلاَ أَنْتَ يَا رَسُولَ\n اللَّهِ قَالَ ‏\"‏ وَلاَ أَنَا إِلاَّ أَنْ يَتَدَارَكَنِيَ اللَّهُ مِنْهُ بِرَحْمَةٍ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda: \"Tiada seorang pun yang dapat diselamatkan hanya dengan amalannya.\" Mereka berkata: \"Wahai Rasulullah, adakah termasuk anda juga?\" Baginda menjawab: \"Ya, aku juga, kecuali jika Allah SWT merahmatiku.\""
  },
  {
    "id": 14216,
    "hadith_number": 6939,
    "tajuk_hadith": "Kemahuan Allah SWT dalam Masuk Syurga",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "None amongst you can get into Paradise by virtue of his deeds alone. They said: Allah's Messenger, not even you? Thereupon he said: Not even I, but that Allah should wrap me in His Grace and Mercy.",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا أَبُو عَبَّادٍ، يَحْيَى بْنُ عَبَّادٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ،\n حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ أَبِي عُبَيْدٍ، مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَنْ يُدْخِلَ أَحَدًا مِنْكُمْ عَمَلُهُ الْجَنَّةَ ‏\"‏ ‏.‏ قَالُوا وَلاَ أَنْتَ\n يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَلاَ أَنَا إِلاَّ أَنْ يَتَغَمَّدَنِيَ اللَّهُ مِنْهُ بِفَضْلٍ وَرَحْمَةٍ ‏\"‏ ‏.‏",
    "malay_translation": "Tiada seorang pun di antara kamu akan dapat masuk syurga semata-mata dengan amal perbuatannya. Mereka berkata: Wahai Rasulullah, adakah engkau juga tidak?  Lalu baginda bersabda: Aku juga tidak, melainkan dengan kurnia dan rahmat Allah SWT."
  },
  {
    "id": 14217,
    "hadith_number": 6940,
    "tajuk_hadith": "Kesederhanaan dalam Amalan dan Rahmat Allah",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Observe moderation in deeds (and if it is not possible, try to be near moderation) and understand that none amongst you can attain salvation because of his deeds alone. They said: Allah's Messenger, not even you? Thereupon he said: Not even I, but that Allah should wrap me in His Mercy and Grace.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي صَالِحٍ،\n عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَارِبُوا وَسَدِّدُوا وَاعْلَمُوا\n أَنَّهُ لَنْ يَنْجُوَ أَحَدٌ مِنْكُمْ بِعَمَلِهِ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَلاَ أَنْتَ قَالَ ‏\"‏ وَلاَ أَنَا إِلاَّ أَنْ يَتَغَمَّدَنِيَ\n اللَّهُ بِرَحْمَةٍ مِنْهُ وَفَضْلٍ ‏\"‏ ‏.‏",
    "malay_translation": "Dekatilah kesederhanaan dan usahakanlah untuk mencapainya. Ketahuilah bahawa sesungguhnya tiada seorang pun di antara kamu akan selamat hanya dengan amalannya sahaja.  Mereka berkata: Wahai Rasulullah, adakah engkau juga tidak akan selamat? Baginda menjawab: Aku juga tidak akan selamat, melainkan dengan rahmat dan kurniaan Allah SWT."
  },
  {
    "id": 14218,
    "hadith_number": 6941,
    "tajuk_hadith": "Sanad Hadis daripada Jabir",
    "perawi_melayu": "Ibn Numair, melalui bapanya, melalui al-A'mash, daripada Abu Sufyan, daripada Jabir, daripada Nabi SAW.",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ\n صلى الله عليه وسلم مِثْلَهُ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ibn Numair, telah menceritakan kepada kami bapa saudaranya, telah menceritakan kepada kami al-A'mash, daripada Abu Sufyan, daripada Jabir, daripada Nabi SAW, seumpamanya."
  },
  {
    "id": 14219,
    "hadith_number": 6942,
    "tajuk_hadith": "Hadis Riwayat A'mash melalui Dua Sanad",
    "perawi_melayu": "Ishaq bin Ibrahim melalui Jarir daripada A'mash",
    "english_text": "A hadith like this has been narrated on the authority of A'mash through two other chains of transmitters. The wording is, however, the same.",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، بِالإِسْنَادَيْنِ جَمِيعًا كَرِوَايَةِ\n ابْنِ نُمَيْرٍ ‏.‏",
    "malay_translation": "Hadis seperti ini telah diriwayatkan daripada A'mash melalui dua sanad.  Namun, lafaznya adalah sama."
  },
  {
    "id": 14220,
    "hadith_number": 6943,
    "tajuk_hadith": "Memberi Khabar Gembira",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Abu Hurairah melalui sanad lain dengan tambahan:",
    "english_text": "\"Give them glad tidings\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ،\n عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ وَزَادَ ‏\n\"‏ وَأَبْشِرُوا\n ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Abu Bakar bin Abi Syaibah dan Abu Kuraib. Mereka berkata:  Kami telah mendengar daripada Abu Muawiyah, daripada al-A’masy, daripada Abu Shalih, daripada Abu Hurairah, daripada Nabi SAW  dengan lafaz yang sama dan ditambah dengan: \"…dan sampaikanlah khabar gembira…\""
  },
  {
    "id": 14221,
    "hadith_number": 6944,
    "tajuk_hadith": "Rahmat Allah Jalan Ke Syurga",
    "perawi_melayu": "Jabir meriwayatkan:",
    "english_text": "I heard Allah's Apostle (ﷺ) as saying: None of you would get into Paradise because of his good deeds alone, and he would not be rescued from Fire, not even I, but because of the Mercy of Allah.",
    "arabic_text": "حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ \n جَابِرٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ يُدْخِلُ أَحَدًا مِنْكُمْ عَمَلُهُ الْجَنَّةَ وَلاَ\n يُجِيرُهُ مِنَ النَّارِ وَلاَ أَنَا إِلاَّ بِرَحْمَةٍ مِنَ اللَّهِ ‏\"‏ ‏.‏",
    "malay_translation": "Jabir berkata: Aku mendengar Rasulullah SAW bersabda: \"Tiada seorang pun daripada kamu akan dimasukkan ke dalam syurga semata-mata kerana amal perbuatannya, dan tiada seorang pun akan diselamatkan daripada api neraka, bahkan aku sendiri pun, melainkan dengan rahmat Allah.\""
  },
  {
    "id": 14222,
    "hadith_number": 6945,
    "tajuk_hadith": "Kesederhanaan dalam Amalan",
    "perawi_melayu": "Aisyah, isteri Rasulullah SAW",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، أَخْبَرَنَا مُوسَى بْنُ،\n عُقْبَةَ ح وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا بَهْزٌ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا مُوسَى،\n بْنُ عُقْبَةَ قَالَ سَمِعْتُ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، يُحَدِّثُ عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ\n صلى الله عليه وسلم أَنَّهَا كَانَتْ تَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ سَدِّدُوا وَقَارِبُوا\n وَأَبْشِرُوا فَإِنَّهُ لَنْ يُدْخِلَ الْجَنَّةَ أَحَدًا عَمَلُهُ ‏\"‏ ‏.‏ قَالُوا وَلاَ أَنْتَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَلاَ\n أَنَا إِلاَّ أَنْ يَتَغَمَّدَنِيَ اللَّهُ مِنْهُ بِرَحْمَةٍ وَاعْلَمُوا أَنَّ أَحَبَّ الْعَمَلِ إِلَى اللَّهِ أَدْوَمُهُ وَإِنْ قَلَّ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ishaq bin Ibrahim, telah memberitakan kepada kami Abdul Aziz bin Muhammad, telah memberitakan kepada kami Musa bin Uqbah. Dan telah menceritakan kepadaku Muhammad bin Hatim - dan lafaznya daripada beliau - telah menceritakan kepada kami Bahz, telah menceritakan kepada kami Wahb, telah menceritakan kepada kami Musa bin Uqbah. Beliau berkata: Saya mendengar Abu Salamah bin Abdurrahman bin Auf menceritakan daripada Aisyah, isteri Nabi SAW bahawa beliau berkata: Rasulullah SAW bersabda:  “Hendaklah kamu bersungguh-sungguh dan berusahalah sedaya upaya, dan bergembiralah kerana sesungguhnya tiada seorang pun yang akan dimasukkan ke dalam syurga kerana amalannya sahaja.” Mereka berkata: “Wahai Rasulullah, adakah engkau pun tidak akan dimasukkan ke dalam syurga?” Baginda bersabda: “Aku pun tidak, melainkan Allah menyelubungi aku dengan rahmat-Nya. Ketahuilah bahawa amalan yang paling disukai oleh Allah ialah amalan yang dilakukan secara berterusan walaupun sedikit.”"
  },
  {
    "id": 14223,
    "hadith_number": 6946,
    "tajuk_hadith": "Bersukacitalah",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Musa bin Uqba dengan sanad yang sama dan beliau tidak menyebut:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَاهُ حَسَنٌ الْحُلْوَانِيُّ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ،\n بْنُ الْمُطَّلِبِ عَنْ مُوسَى بْنِ عُقْبَةَ، بِهَذَا الإِسْنَادِ وَلَمْ يَذْكُرْ ‏\n\"‏ وَأَبْشِرُوا ‏\"‏ ‏.‏",
    "malay_translation": "Dan telah menceritakan kepada kami Hasan al-Hulwani, telah menceritakan kepada kami Ya’qub bin Ibrahim bin Saad, telah menceritakan kepada kami Abdul Aziz bin al-Muttalib daripada Musa bin Uqbah, dengan sanad ini dan dia tidak menyebut “Bersukacitalah”. "
  },
  {
    "id": 14224,
    "hadith_number": 6947,
    "tajuk_hadith": "Kesyukuran Seorang Hamba",
    "perawi_melayu": "Mughirah bin Syu'bah meriwayatkan bahawa Rasulullah SAW telah beribadah sehingga kedua kakinya bengkak.  Lalu baginda ditanya:",
    "english_text": "(Why do you undergo so much hardship despite the fact that) Allah has pardoned for you your earlier and later sins? Thereupon he said: May I not (prove myself) to be a grateful servant (of Allah)?",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ زِيَادِ بْنِ عِلاَقَةَ، عَنِ الْمُغِيرَةِ بْنِ،\n شُعْبَةَ أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى حَتَّى انْتَفَخَتْ قَدَمَاهُ فَقِيلَ لَهُ أَتَكَلَّفُ هَذَا وَقَدْ\n غَفَرَ اللَّهُ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ فَقَالَ ‏\n\"‏ أَفَلاَ أَكُونُ عَبْدًا شَكُورًا ‏\"‏ ‏.‏",
    "malay_translation": "Mughirah bin Syu'bah meriwayatkan bahawa Rasulullah SAW bersolat sehingga kedua kakinya bengkak.  Lalu baginda ditanya, \"Wahai Rasulullah, mengapa tuan bersusah payah begini sedangkan Allah SWT telah mengampunkan dosa-dosa tuan yang lalu dan yang akan datang?\"  Baginda menjawab, \"Bukankah sudah sepatutnya aku menjadi hamba yang bersyukur?\"."
  },
  {
    "id": 14225,
    "hadith_number": 6948,
    "tajuk_hadith": "Rasulullah s.a.w. Berdiri Solat Sehingga Kaki Bengkak",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Mughira bin Syu'bah, dan lafaznya:",
    "english_text": "Allah's Apostle (ﷺ) kept standing in prayer (for such long hours) that his feet were swollen. They (his Companions) said: Verily, Allah has pardoned for thee the earlier and the later of thine sins. Thereupon he said: Should I not prove myself to be a grateful servant (of Allah)?",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا سُفْيَانُ، عَنْ زِيَادِ بْنِ عِلاَقَةَ،\n سَمِعَ الْمُغِيرَةَ بْنَ شُعْبَةَ، يَقُولُ قَامَ النَّبِيُّ صلى الله عليه وسلم حَتَّى وَرِمَتْ قَدَمَاهُ قَالُوا\n قَدْ غَفَرَ اللَّهُ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ ‏.‏ قَالَ ‏\n\"‏ أَفَلاَ أَكُونُ عَبْدًا شَكُورًا ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW berdiri solat begitu lama sehingga kedua kakinya bengkak. Para sahabat berkata, \"Sesungguhnya Allah SWT telah mengampunkan dosa-dosa tuan yang lalu dan yang akan datang.\"  Baginda menjawab, \"Bukankah sudah sepatutnya aku menjadi hamba yang bersyukur?\" "
  },
  {
    "id": 14226,
    "hadith_number": 6949,
    "tajuk_hadith": "Rasulullah SAW Bersyukur Kepada Allah",
    "perawi_melayu": "Aisyah meriwayatkan bahawa apabila Rasulullah SAW menumpukan diri dalam solat, baginda berdiri tegak (dalam qiyam) sehingga kedua belah kakinya bengkak. Aisyah berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، وَهَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي \n أَبُو صَخْرٍ، عَنِ ابْنِ قُسَيْطٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم إِذَا صَلَّى قَامَ حَتَّى تَفَطَّرَ رِجْلاَهُ قَالَتْ عَائِشَةُ يَا رَسُولَ اللَّهِ أَتَصْنَعُ هَذَا\n وَقَدْ غُفِرَ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ فَقَالَ ‏\n\"‏ يَا عَائِشَةُ أَفَلاَ أَكُونُ عَبْدًا شَكُورًا ‏\"‏\n ‏.‏",
    "malay_translation": "Kami diberitakan oleh Harun bin Ma'ruf dan Harun bin Sa'id al-Ayliy, mereka berkata: Kami diberitakan oleh Ibnu Wahb, dia memberitakan kepadaku daripada Abu Sakhr, daripada Ibnu Qusayt, daripada Urwah bin Zubair, daripada Aisyah, dia berkata: Rasulullah SAW, apabila solat, baginda berdiri sehingga kedua kakinya bengkak. Aisyah berkata: Wahai Rasulullah, adakah tuan melakukan ini sedangkan dosa tuan yang telah lalu dan yang akan datang telah diampunkan? Baginda menjawab: \"Wahai Aisyah, bukankah aku sepatutnya menjadi hamba yang bersyukur?\""
  },
  {
    "id": 14227,
    "hadith_number": 6950,
    "tajuk_hadith": "Rasulullah SAW dan Hikmah Mengajar",
    "perawi_melayu": "Syakiq meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، وَأَبُو مُعَاوِيَةَ ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، -\n وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، قَالَ كُنَّا جُلُوسًا عِنْدَ بَابِ عَبْدِ\n اللَّهِ نَنْتَظِرُهُ فَمَرَّ بِنَا يَزِيدُ بْنُ مُعَاوِيَةَ النَّخَعِيُّ فَقُلْنَا أَعْلِمْهُ بِمَكَانِنَا ‏.‏ فَدَخَلَ عَلَيْهِ فَلَمْ يَلْبَثْ\n أَنْ خَرَجَ عَلَيْنَا عَبْدُ اللَّهِ فَقَالَ إِنِّي أُخْبَرُ بِمَكَانِكُمْ فَمَا يَمْنَعُنِي أَنْ أَخْرُجَ إِلَيْكُمْ إِلاَّ كَرَاهِيَةُ\n أَنْ أُمِلَّكُمْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَتَخَوَّلُنَا بِالْمَوْعِظَةِ فِي الأَيَّامِ مَخَافَةَ\n السَّآمَةِ عَلَيْنَا ‏.‏",
    "malay_translation": "Abu Bakar bin Abi Syaibah telah meriwayatkan daripada Waki', dan Abu Muawiyah, dan Ibnu Numair telah meriwayatkan - dan lafaz ini daripada Abu Muawiyah - daripada al-A'masy, daripada Syakiq, katanya:  Kami duduk di depan pintu Abdullah bin Mas'ud, menunggunya. Kemudian Yazid bin Muawiyah an-Nakha'i lalu di hadapan kami. Maka kami berkata:  Beritahukan kepadanya tentang kehadiran kami.  Lalu dia masuk (kepada Abdullah bin Mas'ud), dan tidak lama kemudian Abdullah bin Mas'ud keluar kepada kami lalu berkata: Sesungguhnya aku telah diberitahu tentang kehadiran kamu, dan apa yang menghalang aku daripada keluar menemui kamu hanyalah kerana aku tidak suka membebankan kamu (dengan ceramah yang terlalu banyak). Sesungguhnya Rasulullah SAW sentiasa memberikan pengajaran kepada kami secara berselang-seli dalam beberapa hari, kerana bimbang kami akan merasa jemu."
  },
  {
    "id": 14228,
    "hadith_number": 6951,
    "tajuk_hadith": "Sanad Hadith daripada Abdullah",
    "perawi_melayu": "Abdullah melalui beberapa sanad periwayat",
    "english_text": "This hadith has been narrated on the authority of 'Abdullah through other chains of transmitters.",
    "arabic_text": "حَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا ابْنُ إِدْرِيسَ، ح وَحَدَّثَنَا مِنْجَابُ بْنُ الْحَارِثِ التَّمِيمِيُّ،\n حَدَّثَنَا ابْنُ مُسْهِرٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَلِيُّ بْنُ خَشْرَمٍ، قَالاَ أَخْبَرَنَا عِيسَى،\n بْنُ يُونُسَ ح وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، كُلُّهُمْ عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ ‏.‏ نَحْوَهُ\n ‏.‏ وَزَادَ مِنْجَابٌ فِي رِوَايَتِهِ عَنِ ابْنِ مُسْهِرٍ قَالَ الأَعْمَشُ وَحَدَّثَنِي عَمْرُو بْنُ مُرَّةَ عَنْ شَقِيقٍ\n عَنْ عَبْدِ اللَّهِ مِثْلَهُ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Abdullah melalui beberapa sanad periwayat yang lain.  Abu Said al-Asyaj meriwayatkan daripada Ibn Idris, dan juga Minjab bin al-Harits al-Tamimi meriwayatkan daripada Ibn Mushir.  Begitu juga Ishaq bin Ibrahim dan Ali bin Khasram meriwayatkan daripada Isa bin Yunus.  Ibn Abi Umar meriwayatkan daripada Sufyan. Kesemua mereka meriwayatkan daripada al-A’masy dengan sanad yang sama.  Minjab menambah dalam riwayatnya daripada Ibn Mushir bahawa al-A’masy berkata, dan Amr bin Murrah meriwayatkan daripada Syaqiq daripada Abdullah dengan lafaz yang sama."
  },
  {
    "id": 14229,
    "hadith_number": 6952,
    "tajuk_hadith": "Hadis Tentang Kesederhanaan dalam Berdakwah",
    "perawi_melayu": "Syakik bin Wa'il meriwayatkan bahawa Abdullah biasa memberi tazkirah kepada kami setiap hari Khamis. Seorang lelaki berkata:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، ح وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ،\n - وَاللَّفْظُ لَهُ - حَدَّثَنَا فُضَيْلُ بْنُ عِيَاضٍ، عَنْ مَنْصُورٍ، عَنْ شَقِيقٍ أَبِي وَائِلٍ، قَالَ كَانَ عَبْدُ\n اللَّهِ يُذَكِّرُنَا كُلَّ يَوْمِ خَمِيسٍ فَقَالَ لَهُ رَجُلٌ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنَّا نُحِبُّ حَدِيثَكَ وَنَشْتَهِيهِ\n وَلَوَدِدْنَا أَنَّكَ حَدَّثْتَنَا كُلَّ يَوْمٍ ‏.‏ فَقَالَ مَا يَمْنَعُنِي أَنْ أُحَدِّثَكُمْ إِلاَّ كَرَاهِيَةُ أَنْ أُمِلَّكُمْ ‏.‏ إِنَّ رَسُولَ\n اللَّهِ صلى الله عليه وسلم كَانَ يَتَخَوَّلُنَا بِالْمَوْعِظَةِ فِي الأَيَّامِ كَرَاهِيَةَ السَّآمَةِ عَلَيْنَا ‏.‏",
    "malay_translation": "Kami diberitakan oleh Ishaq bin Ibrahim, yang memberitakan kepada kami Jarir, daripada Mansur, dan kami juga diberitakan oleh Ibnu Abi Umar – dan lafaznya daripada beliau – bahawa kami diberitakan oleh Fudhail bin Iyadh, daripada Mansur, daripada Syakik Abi Wa'il, katanya: Abdullah biasa memberi tazkirah kepada kami setiap hari Khamis.  Maka seorang lelaki berkata kepadanya, \"Wahai Abu Abdur Rahman, sesungguhnya kami menyukai ceramahmu dan menginginkannya, dan kami amat berharap agar engkau memberi ceramah kepada kami setiap hari.\"  Maka beliau berkata, \"Tiada apa yang menghalang aku daripada memberi ceramah kepada kamu melainkan kerana aku bimbang kamu akan merasa bosan. Sesungguhnya Rasulullah SAW  biasa memberi kita nasihat pada hari-hari tertentu kerana baginda bimbang kami akan merasa jemu.\""
  }
]
