[
  {
    "id": 13618,
    "hadith_number": 6341,
    "tajuk_hadith": "Keutamaan Ibu dalam Islam",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa seorang lelaki datang kepada Rasulullah ﷺ dan bertanya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدِ بْنِ جَمِيلِ بْنِ طَرِيفٍ الثَّقَفِيُّ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا \n جَرِيرٌ، عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ\n اللَّهِ صلى الله عليه وسلم فَقَالَ مَنْ أَحَقُّ النَّاسِ بِحُسْنِ صَحَابَتِي قَالَ ‏\"‏ أُمُّكَ ‏\"‏ ‏.‏ قَالَ\n ثُمَّ مَنْ قَالَ ‏\"‏ ثُمَّ أُمُّكَ ‏\"‏ ‏.‏ قَالَ ثُمَّ مَنْ قَالَ ‏\"‏ ثُمَّ أُمُّكَ ‏\"‏ ‏.‏ قَالَ ثُمَّ مَنْ قَالَ ‏\"‏ ثُمَّ أَبُوكَ ‏\"‏\n ‏.‏ وَفِي حَدِيثِ قُتَيْبَةَ مَنْ أَحَقُّ بِحُسْنِ صَحَابَتِي وَلَمْ يَذْكُرِ النَّاسَ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah bin Sa’id bin Jamil bin Tharif Al-Tsaqafi dan Zuhair bin Harb, keduanya berkata: Telah menceritakan kepada kami Jarir dari ‘Umarah bin Al-Qa’qa’, dari Abu Zura’ah, dari Abu Hurairah, bahawa dia berkata: “Seorang lelaki datang kepada Rasulullah SAW lalu bertanya, ‘Siapakah yang paling berhak mendapat layanan baik daripada saya?’ Baginda SAW menjawab, ‘Ibumu.’ Lelaki itu bertanya lagi, ‘Kemudian siapa?’ Baginda SAW menjawab, ‘Ibumu.’ Lelaki itu bertanya lagi, ‘Kemudian siapa?’ Baginda SAW menjawab, ‘Ibumu.’ Lelaki itu bertanya lagi, ‘Kemudian siapa?’ Baginda SAW menjawab, ‘Kemudian bapa kamu.’  Dan dalam riwayat Qutaibah, ‘Siapakah yang paling berhak mendapat layanan baik daripada saya?’ dan tidak menyebut tentang ‘orang ramai’."
  },
  {
    "id": 13619,
    "hadith_number": 6342,
    "tajuk_hadith": "Keutamaan Ibu dalam Islam",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa seseorang bertanya:",
    "english_text": "Allah's Messenger, who amongst the people is most deserving of my good treatment? He said: Your mother, again your mother, again your mother, then your father, then your nearest relatives according to the order (of nearness).",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ الْهَمْدَانِيُّ حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنْ عُمَارَةَ،\n بْنِ الْقَعْقَاعِ عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ مَنْ أَحَقُّ بِحُسْنِ\n الصُّحْبَةِ قَالَ ‏\n\"‏ أُمُّكَ ثُمَّ أُمُّكَ ثُمَّ أُمُّكَ ثُمَّ أَبُوكَ ثُمَّ أَدْنَاكَ أَدْنَاكَ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa seorang lelaki bertanya, \"Wahai Rasulullah, siapakah yang paling berhak menerima layanan baik daripada saya?\" Baginda SAW menjawab, \"Ibumu, kemudian ibumu, kemudian ibumu, kemudian ayahmu, kemudian kaum kerabatmu yang terdekat mengikut susunan (kedekatan).\""
  },
  {
    "id": 13620,
    "hadith_number": 6343,
    "tajuk_hadith": "Mendapat Maklumat daripada Rasulullah SAW",
    "perawi_melayu": "Abu Hurairah meriwayatkan:",
    "english_text": "A person came to Allah's Apostle (ﷺ). The rest of the hadith is the same as transmitted by jarir but with this addition: By your father, you would get the information.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَرِيكٌ، عَنْ عُمَارَةَ، وَابْنِ، شُبْرُمَةَ عَنْ أَبِي،\n زُرْعَةَ عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم ‏.‏ فَذَكَرَ بِمِثْلِ حَدِيثِ\n جَرِيرٍ وَزَادَ فَقَالَ ‏\n\"‏ نَعَمْ وَأَبِيكَ لَتُنَبَّأَنَّ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa seorang lelaki datang kepada Rasulullah SAW.  Sebahagian daripada hadis ini sama seperti yang diriwayatkan oleh Jarir, tetapi dengan tambahan: Demi bapamu, nescaya engkau akan diberitahu."
  },
  {
    "id": 13621,
    "hadith_number": 6344,
    "tajuk_hadith": "Mereka Yang Paling Berhak Mendapat Perlakuan Baik",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Ibnu Shubruma dengan sanad yang sama.  Dalam riwayat daripada Wuhaib, terdapat sedikit perbezaan lafaz. Begitu juga dengan hadis yang diriwayatkan daripada Muhammad bin Talhah (dan katanya):",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا مُحَمَّدُ بْنُ طَلْحَةَ، ح وَحَدَّثَنِي أَحْمَدُ،\n بْنُ خِرَاشٍ حَدَّثَنَا حَبَّانُ، حَدَّثَنَا وُهَيْبٌ، كِلاَهُمَا عَنِ ابْنِ شُبْرُمَةَ، بِهَذَا الإِسْنَادِ فِي حَدِيثِ\n وُهَيْبٍ مَنْ أَبَرُّ وَفِي حَدِيثِ مُحَمَّدِ بْنِ طَلْحَةَ أَىُّ النَّاسِ أَحَقُّ مِنِّي بِحُسْنِ الصُّحْبَةِ ثُمَّ ذَكَرَ\n بِمِثْلِ حَدِيثِ جَرِيرٍ ‏.‏",
    "malay_translation": "Aku telah diberitakan oleh Muhammad bin Hatim, yang telah diberitakan kepadanya oleh Syababah, yang telah diberitakan kepadanya oleh Muhammad bin Talhah, dan aku telah diberitakan oleh Ahmad bin Khirasy, yang telah diberitakan kepadanya oleh Habban, yang telah diberitakan kepadanya oleh Wuhaib, kedua-duanya daripada Ibnu Syubrumah, dengan sanad ini dalam hadis Wuhaib: “Siapakah yang paling berbakti?” dan dalam hadis Muhammad bin Talhah: “Siapakah manusia yang paling berhak mendapat layanan baik daripada aku?” kemudian disebutkan seperti hadis Jarir."
  },
  {
    "id": 13622,
    "hadith_number": 6345,
    "tajuk_hadith": "Berbakti Kepada Ibu Bapa",
    "perawi_melayu": "Abdullah bin 'Amr meriwayatkan bahawa seorang lelaki datang kepada Rasulullah SAW meminta izin untuk berjihad, lalu baginda bertanya...",
    "english_text": "Are your parents living? He said: Yes. Thereupon he (the Holy Prophet) said: You should put in your best efforts (in their) service.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ \n حَبِيبٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، - يَعْنِي ابْنَ سَعِيدٍ الْقَطَّانَ - عَنْ سُفْيَانَ،\n وَشُعْبَةَ قَالاَ حَدَّثَنَا حَبِيبٌ، عَنْ أَبِي الْعَبَّاسِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ جَاءَ رَجُلٌ إِلَى\n النَّبِيِّ صلى الله عليه وسلم يَسْتَأْذِنُهُ فِي الْجِهَادِ فَقَالَ ‏\"‏ أَحَىٌّ وَالِدَاكَ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ\n ‏\"‏ فَفِيهِمَا فَجَاهِدْ ‏\"‏ ‏.‏",
    "malay_translation": "Abdullah bin 'Amr meriwayatkan bahawa seorang lelaki datang kepada Nabi SAW meminta izin untuk berjihad.  Baginda bertanya, \"Adakah ibu bapamu masih hidup?\" Lelaki itu menjawab, \"Ya.\" Baginda bersabda, \"Maka berjihadlah dengan mengabdikan diri kepada mereka.\""
  },
  {
    "id": 13623,
    "hadith_number": 6346,
    "tajuk_hadith": "Riwayat Hadis daripada Habib melalui Beberapa Sanad",
    "perawi_melayu": "Beberapa perawi, termasuk Ubaidullah bin Mu'adz, Abi, Syu'bah, dan Habib.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ حَبِيبٍ، سَمِعْتُ أَبَا الْعَبَّاسِ،\n سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ، يَقُولُ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم ‏.‏\n فَذَكَرَ بِمِثْلِهِ ‏.‏ قَالَ مُسْلِمٌ أَبُو الْعَبَّاسِ اسْمُهُ السَّائِبُ بْنُ فَرُّوخَ الْمَكِّيُّ ‏.‏ \n حَدَّثَنَا أَبُو كُرَيْبٍ، أَخْبَرَنَا ابْنُ بِشْرٍ، عَنْ مِسْعَرٍ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا \n مُعَاوِيَةُ بْنُ عَمْرٍو، عَنْ أَبِي إِسْحَاقَ، ح وَحَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّاءَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ،\n الْجُعْفِيُّ عَنْ زَائِدَةَ، كِلاَهُمَا عَنِ الأَعْمَشِ، جَمِيعًا عَنْ حَبِيبٍ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Habib melalui beberapa sanad (rantai periwayat).  Antara perawi termasuklah Ubaidullah bin Mu'adz, Abi, Syu'bah, dan Habib.  Mereka meriwayatkan bahawa mereka mendengar Abu al-Abbas meriwayatkan daripada Abdullah bin 'Amr bin al-'Ash bahawa seorang lelaki datang kepada Nabi SAW dan menceritakan sesuatu.  Muslim menyatakan bahawa nama Abu al-'Abbas ialah Sa'ib bin Farrukh al-Makki.  Hadis ini juga diriwayatkan melalui sanad lain daripada Abu Kuraib, Ibn Bisyr, Mis'ar, Muhammad bin Hatim, Mu'awiyah bin 'Amr, Abu Ishaq, al-Qasim bin Zakariya, dan Husain bin Ali al-Ju'fi melalui Zaidah dan al-A'mash kepada Habib dengan sanad yang serupa."
  },
  {
    "id": 13624,
    "hadith_number": 6347,
    "tajuk_hadith": "Menghormati Ibu Bapa",
    "perawi_melayu": "Yazid bin Abu Habib meriwayatkan bahawa Na'im, hamba sahaya Umm Salamah, memberitahu kepadanya bahawa Abdullah bin Amr bin al-'As berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ،\n عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، أَنَّ نَاعِمًا، مَوْلَى أُمِّ سَلَمَةَ حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ\n قَالَ أَقْبَلَ رَجُلٌ إِلَى نَبِيِّ اللَّهِ صلى الله عليه وسلم فَقَالَ أُبَايِعُكَ عَلَى الْهِجْرَةِ وَالْجِهَادِ\n أَبْتَغِي الأَجْرَ مِنَ اللَّهِ ‏.‏ قَالَ ‏\"‏ فَهَلْ مِنْ وَالِدَيْكَ أَحَدٌ حَىٌّ ‏\"‏ ‏.‏ قَالَ نَعَمْ بَلْ كِلاَهُمَا ‏.‏ قَالَ\n ‏\"‏ فَتَبْتَغِي الأَجْرَ مِنَ اللَّهِ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ فَارْجِعْ إِلَى وَالِدَيْكَ فَأَحْسِنْ صُحْبَتَهُمَا\n ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Said bin Mansur, telah menceritakan kepada kami Abdullah bin Wahb, telah memberitahu aku Amru bin al-Harits, daripada Yazid bin Abi Habib, bahawa Na'im, hamba sahaya Umm Salamah memberitahu kepadanya bahawa Abdullah bin Amr bin al-'As berkata:  Seorang lelaki datang kepada Nabi SAW lalu berkata, \"Aku ingin berbaiat kepadamu untuk berhijrah dan berjihad, semata-mata kerana menginginkan pahala daripada Allah.\"  Baginda bertanya, \"Adakah salah seorang daripada ibu bapamu masih hidup?\" Lelaki itu menjawab, \"Ya, malah kedua-duanya masih hidup.\" Baginda bertanya lagi, \"Apakah engkau benar-benar menginginkan pahala daripada Allah?\" Lelaki itu menjawab, \"Ya.\" Baginda bersabda, \"Pulanglah kepada ibu bapamu dan berbuat baiklah kepada mereka.\""
  },
  {
    "id": 13625,
    "hadith_number": 6348,
    "tajuk_hadith": "Ketaatan Juraij kepada Solat dan Hikmah di Sebaliknya",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Juraij seorang yang tekun beribadah di dalam sebuah tempat ibadat. Ibunya datang kepadanya. Humaid berkata bahawa Abu Rafi' menunjukkan kepada kami bagaimana Abu Hurairah menunjukkan kepada kami seperti yang ditunjukkan oleh Rasulullah ﷺ, ibunya memanggilnya dengan meletakkan tapak tangannya di atas keningnya, kemudian mengangkat kepalanya untuk memanggilnya dan berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، حَدَّثَنَا حُمَيْدُ بْنُ هِلاَلٍ، عَنْ \n أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ كَانَ جُرَيْجٌ يَتَعَبَّدُ فِي صَوْمَعَةٍ فَجَاءَتْ أُمُّهُ ‏.‏ قَالَ حُمَيْدٌ\n فَوَصَفَ لَنَا أَبُو رَافِعٍ صِفَةَ أَبِي هُرَيْرَةَ لِصِفَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم أُمَّهُ حِينَ\n دَعَتْهُ كَيْفَ جَعَلَتْ كَفَّهَا فَوْقَ حَاجِبِهَا ثُمَّ رَفَعَتْ رَأْسَهَا إِلَيْهِ تَدْعُوهُ فَقَالَتْ يَا جُرَيْجُ أَنَا\n أُمُّكَ كَلِّمْنِي ‏.‏ فَصَادَفَتْهُ يُصَلِّي فَقَالَ اللَّهُمَّ أُمِّي وَصَلاَتِي ‏.‏ فَاخْتَارَ صَلاَتَهُ فَرَجَعَتْ ثُمَّ عَادَتْ\n فِي الثَّانِيَةِ فَقَالَتْ يَا جُرَيْجُ أَنَا أُمُّكَ فَكَلِّمْنِي ‏.‏ قَالَ اللَّهُمَّ أُمِّي وَصَلاَتِي ‏.‏ فَاخْتَارَ صَلاَتَهُ\n فَقَالَتِ اللَّهُمَّ إِنَّ هَذَا جُرَيْجٌ وَهُوَ ابْنِي وَإِنِّي كَلَّمْتُهُ فَأَبَى أَنْ يُكَلِّمَنِي اللَّهُمَّ فَلاَ تُمِتْهُ حَتَّى\n تُرِيَهُ الْمُومِسَاتِ ‏.‏ قَالَ وَلَوْ دَعَتْ عَلَيْهِ أَنْ يُفْتَنَ لَفُتِنَ ‏.‏ قَالَ وَكَانَ رَاعِي ضَأْنٍ يَأْوِي إِلَى\n دَيْرِهِ - قَالَ - فَخَرَجَتِ امْرَأَةٌ مِنَ الْقَرْيَةِ فَوَقَعَ عَلَيْهَا الرَّاعِي فَحَمَلَتْ فَوَلَدَتْ غُلاَمًا فَقِيلَ\n لَهَا مَا هَذَا قَالَتْ مِنْ صَاحِبِ هَذَا الدَّيْرِ ‏.‏ قَالَ فَجَاءُوا بِفُئُوسِهِمْ وَمَسَاحِيهِمْ فَنَادَوْهُ فَصَادَفُوهُ\n يُصَلِّي فَلَمْ يُكَلِّمْهُمْ - قَالَ - فَأَخَذُوا يَهْدِمُونَ دَيْرَهُ فَلَمَّا رَأَى ذَلِكَ نَزَلَ إِلَيْهِمْ فَقَالُوا لَهُ سَلْ\n هَذِهِ - قَالَ - فَتَبَسَّمَ ثُمَّ مَسَحَ رَأْسَ الصَّبِيِّ فَقَالَ مَنْ أَبُوكَ قَالَ أَبِي رَاعِي الضَّأْنِ ‏.‏\n فَلَمَّا سَمِعُوا ذَلِكَ مِنْهُ قَالُوا نَبْنِي مَا هَدَمْنَا مِنْ دَيْرِكَ بِالذَّهَبِ وَالْفِضَّةِ ‏.‏ قَالَ لاَ وَلَكِنْ أَعِيدُوهُ\n تُرَابًا كَمَا كَانَ ثُمَّ عَلاَهُ ‏.‏",
    "malay_translation": "Diriwayatkan bahawa Juraij seorang yang tekun beribadah di tempat ibadatnya.  Ibunya datang menemuinya. Humaid berkata bahawa Abu Rafi' menerangkan kepada kami seperti yang ditunjukkan oleh Abu Hurairah, iaitu bagaimana Rasulullah SAW menunjukkan, ibunya memanggilnya dengan meletakkan tapak tangannya di atas kening dan mengangkat kepalanya untuk memanggilnya lalu berkata, \"Wahai Juraij, aku ini ibumu, bercakaplah denganku.\"  Ketika itu Juraij sedang solat, maka dia berdoa, \"Ya Allah, ibuku dan solatku.\"  Dia memilih untuk meneruskan solatnya.  Ibunya pulang, kemudian kembali lagi untuk kali kedua dan berkata, \"Wahai Juraij, aku ini ibumu, bercakaplah denganku.\"  Juraij berdoa, \"Ya Allah, ibuku dan solatku.\" Dia memilih untuk meneruskan solatnya.  Ibunya berdoa, \"Ya Allah, Juraij ini anakku, dan aku telah memanggilnya tetapi dia enggan bercakap denganku. Ya Allah, janganlah Engkau wafatkan dia sehingga Engkau tunjukkan kepadanya perempuan-perempuan yang melakukan zina.\"  (Humaid berkata), sekiranya ibunya mendoakan agar dia diuji, nescaya dia akan diuji.  Ada seorang gembala yang selalu berteduh di tempat ibadatnya.  Seorang wanita dari kampung itu keluar dan gembala itu berzina dengannya, lalu wanita itu hamil dan melahirkan seorang anak lelaki.  Dia ditanya, \"Siapakah anak ini?\"  Wanita itu menjawab, \"Anak lelaki ini daripada penghuni tempat ibadat ini.\"  Mereka datang dengan kapak dan cangkul, lalu memanggil Juraij.  Mereka mendapati dia sedang solat, dan dia tidak melayan mereka. Mereka mula merobohkan tempat ibadatnya.  Apabila Juraij melihat itu, dia turun menemui mereka. Mereka berkata kepadanya, \"Tanya wanita itu.\"  Juraij tersenyum, kemudian mengusap kepala bayi itu dan bertanya, \"Siapakah ayahmu?\"  Bayi itu menjawab, \"Ayahku ialah gembala kambing.\"  Setelah mendengar jawapan itu, mereka berkata, \"Kami akan membina semula apa yang telah kami robohkan daripada tempat ibadatmu dengan emas dan perak.\"  Juraij berkata, \"Tidak, tetapi bina semula dengan tanah liat seperti sediakala.\"  Kemudian dia kembali ke tempatnya untuk meneruskan ibadahnya."
  },
  {
    "id": 13626,
    "hadith_number": 6349,
    "tajuk_hadith": "Hanya Tiga Orang Yang Bercakap Dalam Buaian",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا جَرِيرُ بْنُ حَازِمٍ، حَدَّثَنَا \n مُحَمَّدُ بْنُ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لَمْ يَتَكَلَّمْ فِي الْمَهْدِ\n إِلاَّ ثَلاَثَةٌ عِيسَى ابْنُ مَرْيَمَ وَصَاحِبُ جُرَيْجٍ وَكَانَ جُرَيْجٌ رَجُلاً عَابِدًا فَاتَّخَذَ صَوْمَعَةً فَكَانَ\n فِيهَا فَأَتَتْهُ أُمُّهُ وَهُوَ يُصَلِّي فَقَالَتْ يَا جُرَيْجُ ‏.‏ فَقَالَ يَا رَبِّ أُمِّي وَصَلاَتِي ‏.‏ فَأَقْبَلَ عَلَى\n صَلاَتِهِ فَانْصَرَفَتْ فَلَمَّا كَانَ مِنَ الْغَدِ أَتَتْهُ وَهُوَ يُصَلِّي فَقَالَتْ يَا جُرَيْجُ فَقَالَ يَا رَبِّ أُمِّي\n وَصَلاَتِي فَأَقْبَلَ عَلَى صَلاَتِهِ فَانْصَرَفَتْ فَلَمَّا كَانَ مِنَ الْغَدِ أَتَتْهُ وَهُوَ يُصَلِّي فَقَالَتْ يَا جُرَيْجُ\n ‏.‏ فَقَالَ أَىْ رَبِّ أُمِّي وَصَلاَتِي ‏.‏ فَأَقْبَلَ عَلَى صَلاَتِهِ فَقَالَتِ اللَّهُمَّ لاَ تُمِتْهُ حَتَّى يَنْظُرَ إِلَى\n وُجُوهِ الْمُومِسَاتِ ‏.‏ فَتَذَاكَرَ بَنُو إِسْرَائِيلَ جُرَيْجًا وَعِبَادَتَهُ وَكَانَتِ امْرَأَةٌ بَغِيٌّ يُتَمَثَّلُ بِحُسْنِهَا\n فَقَالَتْ إِنْ شِئْتُمْ لأَفْتِنَنَّهُ لَكُمْ - قَالَ - فَتَعَرَّضَتْ لَهُ فَلَمْ يَلْتَفِتْ إِلَيْهَا فَأَتَتْ رَاعِيًا كَانَ يَأْوِي\n إِلَى صَوْمَعَتِهِ فَأَمْكَنَتْهُ مِنْ نَفْسِهَا فَوَقَعَ عَلَيْهَا فَحَمَلَتْ فَلَمَّا وَلَدَتْ قَالَتْ هُوَ مِنْ جُرَيْجٍ\n ‏.‏ فَأَتَوْهُ فَاسْتَنْزَلُوهُ وَهَدَمُوا صَوْمَعَتَهُ وَجَعَلُوا يَضْرِبُونَهُ فَقَالَ مَا شَأْنُكُمْ قَالُوا زَنَيْتَ بِهَذِهِ\n الْبَغِيِّ فَوَلَدَتْ مِنْكَ ‏.‏ فَقَالَ أَيْنَ الصَّبِيُّ فَجَاءُوا بِهِ فَقَالَ دَعُونِي حَتَّى أُصَلِّيَ فَصَلَّى فَلَمَّا\n انْصَرَفَ أَتَى الصَّبِيَّ فَطَعَنَ فِي بَطْنِهِ وَقَالَ يَا غُلاَمُ مَنْ أَبُوكَ قَالَ فُلاَنٌ الرَّاعِي - قَالَ\n - فَأَقْبَلُوا عَلَى جُرَيْجٍ يُقَبِّلُونَهُ وَيَتَمَسَّحُونَ بِهِ وَقَالُوا نَبْنِي لَكَ صَوْمَعَتَكَ مِنْ ذَهَبٍ ‏.‏ قَالَ\n لاَ أَعِيدُوهَا مِنْ طِينٍ كَمَا كَانَتْ ‏.‏ فَفَعَلُوا ‏.‏ وَبَيْنَا صَبِيٌّ يَرْضَعُ مِنْ أُمِّهِ فَمَرَّ رَجُلٌ رَاكِبٌ\n عَلَى دَابَّةٍ فَارِهَةٍ وَشَارَةٍ حَسَنَةٍ فَقَالَتْ أُمُّهُ اللَّهُمَّ اجْعَلِ ابْنِي مِثْلَ هَذَا ‏.‏ فَتَرَكَ الثَّدْىَ وَأَقْبَلَ\n إِلَيْهِ فَنَظَرَ إِلَيْهِ فَقَالَ اللَّهُمَّ لاَ تَجْعَلْنِي مِثْلَهُ ‏.‏ ثُمَّ أَقْبَلَ عَلَى ثَدْيِهِ فَجَعَلَ يَرْتَضِعُ ‏.‏ قَالَ فَكَأَنِّي\n أَنْظُرُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ يَحْكِي ارْتِضَاعَهُ بِإِصْبَعِهِ السَّبَّابَةِ فِي\n فَمِهِ فَجَعَلَ يَمُصُّهَا ‏.‏ قَالَ وَمَرُّوا بِجَارِيَةٍ وَهُمْ يَضْرِبُونَهَا وَيَقُولُونَ زَنَيْتِ سَرَقْتِ ‏.‏ وَهِيَ\n تَقُولُ حَسْبِيَ اللَّهُ وَنِعْمَ الْوَكِيلُ ‏.‏ فَقَالَتْ أُمُّهُ اللَّهُمَّ لاَ تَجْعَلِ ابْنِي مِثْلَهَا ‏.‏ فَتَرَكَ الرَّضَاعَ وَنَظَرَ\n إِلَيْهَا فَقَالَ اللَّهُمَّ اجْعَلْنِي مِثْلَهَا ‏.‏ فَهُنَاكَ تَرَاجَعَا الْحَدِيثَ فَقَالَتْ حَلْقَى مَرَّ رَجُلٌ حَسَنُ الْهَيْئَةِ\n فَقُلْتُ اللَّهُمَّ اجْعَلِ ابْنِي مِثْلَهُ ‏.‏ فَقُلْتَ اللَّهُمَّ لاَ تَجْعَلْنِي مِثْلَهُ ‏.‏ وَمَرُّوا بِهَذِهِ الأَمَةِ وَهُمْ يَضْرِبُونَهَا\n وَيَقُولُونَ زَنَيْتِ سَرَقْتِ ‏.‏ فَقُلْتُ اللَّهُمَّ لاَ تَجْعَلِ ابْنِي مِثْلَهَا ‏.‏ فَقُلْتَ اللَّهُمَّ اجْعَلْنِي مِثْلَهَا قَالَ\n إِنَّ ذَاكَ الرَّجُلَ كَانَ جَبَّارًا فَقُلْتُ اللَّهُمَّ لاَ تَجْعَلْنِي مِثْلَهُ ‏.‏ وَإِنَّ هَذِهِ يَقُولُونَ لَهَا زَنَيْتِ ‏.‏ وَلَمْ\n تَزْنِ وَسَرَقْتِ وَلَمْ تَسْرِقْ فَقُلْتُ اللَّهُمَّ اجْعَلْنِي مِثْلَهَا ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Zuhri bin Harb, telah menceritakan kepada kami Yazid bin Harun, telah mengabarkan kepada kami Jarir bin Hazim, telah menceritakan kepada kami Muhammad bin Sirin, dari Abu Hurairah, dari Nabi SAW, baginda bersabda: \"Tidak ada yang berbicara di dalam buaian melainkan tiga orang sahaja: Isa ibnu Maryam, dan sahabat Juraij. Juraij adalah seorang yang beribadah, dia telah membuat sebuah tempat pertapaan dan menetap di dalamnya. Maka datanglah ibunya ketika dia sedang solat, lalu ibunya berkata: \"Wahai Juraij!\" Dia menjawab: \"Ya Allah, ibuku dan solatku!\" Maka dia meneruskan solatnya, lalu ibunya pergi. Kemudian apabila tiba keesokan harinya, ibunya datang kepadanya ketika dia sedang solat, lalu ibunya berkata: \"Wahai Juraij!\" Dia menjawab: \"Ya Allah, ibuku dan solatku!\" Maka dia meneruskan solatnya, lalu ibunya pergi. Kemudian apabila tiba keesokan harinya, ibunya datang kepadanya ketika dia sedang solat, lalu ibunya berkata: \"Wahai Juraij!\" Dia menjawab: \"Ya Allah, ibuku dan solatku!\" Maka dia meneruskan solatnya. Kemudian ibunya berkata: \"Ya Allah, janganlah Engkau matikan dia sehingga dia melihat wajah-wajah pelacur.\" Maka Bani Israel membicarakan Juraij dan ibadahnya, dan ada seorang wanita pelacur yang terkenal dengan kecantikannya, lalu dia berkata: \"Jika kamu mahu, aku akan menggodanya untuk kamu.\" Kemudian dia menghampiri Juraij, tetapi Juraij tidak menghiraukannya. Lalu dia menghampiri seorang gembala yang berteduh di tempat pertapaan Juraij, lalu wanita itu memberikan dirinya kepada gembala itu, lalu dia hamil. Apabila dia melahirkan, dia berkata: \"Anak ini daripada Juraij.\" Maka mereka datang kepada Juraij lalu menurunkan dia dan meruntuhkan tempat pertapaannya, dan mereka memukulnya. Dia bertanya: \"Apakah hal kamu?\" Mereka menjawab: \"Engkau telah berzina dengan pelacur ini, lalu dia mengandung anak daripada engkau.\" Dia bertanya: \"Di manakah anak itu?\" Mereka membawanya, lalu dia berkata: \"Biarkanlah aku sehingga aku menunaikan solat.\" Maka dia solat, dan setelah selesai solat dia menghampiri anak itu. Dia menusuk perut anak itu, lalu dia bertanya: \"Wahai anak, siapakah ayahmu?\" Anak itu menjawab: \"Dia ialah si fulan, gembala itu.\" Maka mereka datang kepada Juraij, mencium dan menyentuh (memohon keberkatan), lalu mereka berkata: \"Kami akan membina tempat pertapaanmu daripada emas.\" Dia menjawab: \"Jangan, bina balik seperti sediakala daripada tanah liat.\" Maka mereka melakukannya. Dan ketika seorang bayi sedang menyusu ibunya, lalu lalu seorang lelaki yang menunggang haiwan tunggangan yang gagah dan berpakaian indah lalu lalu di hadapan mereka, maka ibunya berkata: \"Ya Allah, jadikanlah anakku seperti orang ini.\" Lalu bayi itu berhenti menyusu dan memandang ke arah lelaki itu, lalu berkata: \"Ya Allah, jangan jadikan aku seperti dia!\" Kemudian dia menyambung menyusu ibunya.  Abu Hurairah berkata: Aku seakan-akan melihat Rasulullah SAW menceritakan kejadian ini dengan menggunakan jari telunjuknya di dalam mulutnya seakan-akan menyusu.  Baginda juga meriwayatkan bahawa mereka telah melalui seorang gadis ketika orang ramai memukulnya sambil berkata: \"Engkau berzina dan mencuri!\" Gadis itu menjawab: \"Cukuplah Allah menjadi penolongku dan Dialah sebaik-baik pelindung.\" Maka ibunya berkata: \"Ya Allah, janganlah Engkau jadikan anakku seperti dia.\" Lalu bayi itu berhenti menyusu dan memandang gadis itu, lalu berkata: \"Ya Allah, jadikanlah aku seperti dia!\" Kemudian mereka berbincang tentang hal itu, lalu ibunya berkata: \"Anakku, aku telah melihat seorang lelaki yang rupa parasnya tampan lalu aku berdoa: \"Ya Allah, jadikan anakku seperti dia.\" Kemudian engkau berdoa: \"Ya Allah, jangan jadikan aku seperti dia.\"  Kemudian kami telah melalui seorang hamba perempuan ketika mereka memukulnya dan berkata: \"Engkau berzina dan mencuri.\" Lalu aku berdoa: \"Ya Allah, jangan jadikan anakku seperti dia.\"  Lalu engkau berdoa: \"Ya Allah, jadikan aku seperti dia.\"  Rasulullah SAW bersabda:  \"Lelaki itu adalah seorang yang zalim, maka aku berdoa: \"Ya Allah, jangan jadikan aku seperti dia.\"  Dan perempuan itu, mereka menuduhnya berzina padahal dia tidak berzina dan menuduhnya mencuri padahal dia tidak mencuri, maka aku berdoa: \"Ya Allah, jadikan aku seperti dia.\""
  },
  {
    "id": 13627,
    "hadith_number": 6350,
    "tajuk_hadith": "Tidak Masuk Syurga Bagi Mereka Yang Tidak Berbakti Kepada Ibu Bapa Yang Tua",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Let him be humbled into dust; let him be humbled into dust. It was said: Allah's Messenger, who is he? He said: He who sees either of his parents during their old age or he sees both of them, but he does not enter Paradise.",
    "arabic_text": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ،\n عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ رَغِمَ أَنْفُ ثُمَّ رَغِمَ أَنْفُ ثُمَّ رَغِمَ أَنْفُ ‏\"‏ ‏.‏ قِيلَ مَنْ\n يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ مَنْ أَدْرَكَ أَبَوَيْهِ عِنْدَ الْكِبَرِ أَحَدَهُمَا أَوْ كِلَيْهِمَا فَلَمْ يَدْخُلِ الْجَنَّةَ ‏\"‏\n ‏.‏",
    "malay_translation": "Binasalah dia! Binasalah dia! Binasalah dia!  Ada yang bertanya, \"Wahai Rasulullah, siapakah dia?\" Baginda menjawab, \"Dia ialah orang yang bertemu dengan kedua ibu bapanya ketika mereka sudah tua, sama ada seorang atau kedua-duanya, tetapi dia tidak masuk syurga.\""
  },
  {
    "id": 13628,
    "hadith_number": 6351,
    "tajuk_hadith": "Celaka Orang Yang Tidak Masuk Syurga Kerana Tidak Berbakti Kepada Ibu Bapa",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Let him be humbled, let him be humbled. It was said: Allah's Messenger, who is he? He said. He who finds his parents in old age, either one or both of them, and does not enter Paradise.",
    "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ\n قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ رَغِمَ أَنْفُهُ ثُمَّ رَغِمَ أَنْفُهُ ثُمَّ رَغِمَ أَنْفُهُ ‏\"‏ ‏.‏ قِيلَ مَنْ\n يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ مَنْ أَدْرَكَ وَالِدَيْهِ عِنْدَ الْكِبَرِ أَحَدَهُمَا أَوْ كِلَيْهِمَا ثُمَّ لَمْ يَدْخُلِ الْجَنَّةَ\n ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: “Celaka dia! Celaka dia! Celaka dia!”  Lalu ditanya, “Wahai Rasulullah, siapakah dia?” Baginda menjawab, “Ialah orang yang masih hidup ketika kedua orang tuanya sudah tua, sama ada seorang atau kedua-duanya, tetapi dia tidak masuk syurga.”"
  },
  {
    "id": 13629,
    "hadith_number": 6352,
    "tajuk_hadith": "Kerendahan Diri",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Let him be humbled thrice, and the rest of the hadith is the same.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، عَنْ سُلَيْمَانَ بْنِ بِلاَلٍ، حَدَّثَنِي \n سُهَيْلٌ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ رَغِمَ أَنْفُهُ\n ‏\"‏ ‏.‏ ثَلاَثًا ثُمَّ ذَكَرَ مِثْلَهُ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:  \"Hendaklah dia merendahkan diri sebanyak tiga kali,\" kemudian baginda menyebut perkara yang sama."
  },
  {
    "id": 13630,
    "hadith_number": 6353,
    "tajuk_hadith": "Mendidik Anak: Menjaga Hubungan Baik dengan Orang Tersayang Ayah",
    "perawi_melayu": "Ibn Dinar meriwayatkan bahawa seorang Arab Badwi bertemu Abdullah bin Umar di jalan menuju Mekah. Abdullah memberi salam kepadanya dan menaikkannya ke atas keldai yang ditungganginya dan memberikan serban yang dipakainya kepada orang itu. Ibn Dinar (lagi) meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي \n سَعِيدُ بْنُ أَبِي أَيُّوبَ، عَنِ الْوَلِيدِ بْنِ أَبِي الْوَلِيدِ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ،\n أَنَّ رَجُلاً، مِنَ الأَعْرَابِ لَقِيَهُ بِطَرِيقِ مَكَّةَ فَسَلَّمَ عَلَيْهِ عَبْدُ اللَّهِ وَحَمَلَهُ عَلَى حِمَارٍ كَانَ يَرْكَبُهُ\n وَأَعْطَاهُ عِمَامَةً كَانَتْ عَلَى رَأْسِهِ فَقَالَ ابْنُ دِينَارٍ فَقُلْنَا لَهُ أَصْلَحَكَ اللَّهُ إِنَّهُمُ الأَعْرَابُ وَإِنَّهُمْ\n يَرْضَوْنَ بِالْيَسِيرِ ‏.‏ فَقَالَ عَبْدُ اللَّهِ إِنَّ أَبَا هَذَا كَانَ وُدًّا لِعُمَرَ بْنِ الْخَطَّابِ وَإِنِّي سَمِعْتُ رَسُولَ\n اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ أَبَرَّ الْبِرِّ صِلَةُ الْوَلَدِ أَهْلَ وُدِّ أَبِيهِ ‏\"‏ ‏.‏",
    "malay_translation": "Kami berkata kepadanya (Abdullah bin Umar): Semoga Allah memberimu kebaikan, mereka ini adalah orang-orang Arab Badwi dan mereka merasa cukup dengan sedikit sahaja. Maka Abdullah berkata: Ayahnya sangat disayangi oleh Umar bin Khattab dan aku mendengar Rasulullah SAW bersabda: \"Sesungguhnya kebajikan yang paling utama bagi seorang anak ialah menyambung silaturahim dengan orang-orang yang disayangi oleh ayahnya.\""
  },
  {
    "id": 13631,
    "hadith_number": 6354,
    "tajuk_hadith": "Kebaikan Tertinggi: Menghormati Keluarga Bapa",
    "perawi_melayu": "Abdullah bin Umar meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The finest act of goodness is that a person should treat kindly the loved ones of his father.",
    "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي حَيْوَةُ بْنُ شُرَيْحٍ، عَنِ ابْنِ،\n الْهَادِ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ النَّبِيِّ صلى الله عليه وسلم قَالَ\n ‏\n\"‏ أَبَرُّ الْبِرِّ أَنْ يَصِلَ الرَّجُلُ وُدَّ أَبِيهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Kebaikan yang paling utama ialah seseorang itu berbuat baik kepada keluarga bapanya.\""
  },
  {
    "id": 13632,
    "hadith_number": 6355,
    "tajuk_hadith": "Kebajikan Menyambung Silaturahim Keluarga Bapa",
    "perawi_melayu": "Abdullah bin Dinar meriwayatkan bahawa apabila Abdullah bin Umar berangkat ke Mekah, beliau menyimpan seekor keldai untuknya yang digunakan sebagai hiburan daripada kebosanan perjalanan di atas unta dan mempunyai serban yang diikat di kepalanya. Pada suatu hari, ketika beliau menunggang keldai itu, seorang Arab Badwi kebetulan lalu di sisinya. Beliau (Abdullah bin Umar) berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي،\n وَاللَّيْثُ بْنُ سَعْدٍ جَمِيعًا عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ أُسَامَةَ بْنِ الْهَادِ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ،\n عَنِ ابْنِ عُمَرَ، أَنَّهُ كَانَ إِذَا خَرَجَ إِلَى مَكَّةَ كَانَ لَهُ حِمَارٌ يَتَرَوَّحُ عَلَيْهِ إِذَا مَلَّ رُكُوبَ الرَّاحِلَةِ\n وَعِمَامَةٌ يَشُدُّ بِهَا رَأْسَهُ فَبَيْنَا هُوَ يَوْمًا عَلَى ذَلِكَ الْحِمَارِ إِذْ مَرَّ بِهِ أَعْرَابِيٌّ فَقَالَ أَلَسْتَ\n ابْنَ فُلاَنِ بْنِ فُلاَنٍ قَالَ بَلَى ‏.‏ فَأَعْطَاهُ الْحِمَارَ وَقَالَ ارْكَبْ هَذَا وَالْعِمَامَةَ - قَالَ - اشْدُدْ\n بِهَا رَأْسَكَ ‏.‏ فَقَالَ لَهُ بَعْضُ أَصْحَابِهِ غَفَرَ اللَّهُ لَكَ أَعْطَيْتَ هَذَا الأَعْرَابِيَّ حِمَارًا كُنْتَ تَرَوَّحُ\n عَلَيْهِ وَعِمَامَةً كُنْتَ تَشُدُّ بِهَا رَأْسَكَ ‏.‏ فَقَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم\n يَقُولُ ‏\n\"‏ إِنَّ مِنْ أَبَرِّ الْبِرِّ صِلَةَ الرَّجُلِ أَهْلَ وُدِّ أَبِيهِ بَعْدَ أَنْ يُوَلِّيَ ‏\"‏ ‏.‏ وَإِنَّ أَبَاهُ كَانَ صَدِيقًا\n لِعُمَرَ ‏.‏",
    "malay_translation": "Kami diberitakan oleh Hasan bin Ali al-Hulwani, yang memberitakan kepada kami Ya'qub bin Ibrahim bin Saad, yang memberitakan kepada kami oleh ayahku, dan Laits bin Saad, semuanya daripada Yazid bin Abdullah bin Usamah bin al-Had, daripada Abdullah bin Dinar, daripada Ibnu Umar bahawa beliau apabila keluar ke Mekah, beliau mempunyai seekor keldai yang ditunggangi untuk berehat apabila penat menunggang kenderaan lain dan serban yang diikat di kepalanya.  Pada suatu hari, ketika beliau sedang menunggang keldai itu, seorang Arab Badwi lalu di sisinya.  Beliau (Ibnu Umar) bertanya, \"Bukankah engkau anak fulan bin fulan?\"  Dia menjawab, \"Ya.\"  Maka Ibnu Umar memberi keldai itu kepadanya dan berkata, \"Naiklah ini, dan serban ini - ikatlah di kepalamu.\" Kemudian beberapa sahabatnya berkata kepadanya, \"Semoga Allah mengampunimu, engkau memberi keldai yang engkau gunakan untuk berehat dan serban yang engkau ikat di kepalamu kepada Arab Badwi ini.\"  Maka Ibnu Umar berkata, \"Sesungguhnya aku mendengar Rasulullah SAW bersabda,  \"Sesungguhnya di antara kebajikan yang paling utama ialah menyambung silaturahim keluarga bapa seseorang setelah dia meninggal dunia.\" Dan bapanya adalah sahabat Umar."
  },
  {
    "id": 13633,
    "hadith_number": 6356,
    "tajuk_hadith": "Kebaikan dan Kemungkaran",
    "perawi_melayu": "Nawwas bin Sam'an al-Ansari meriwayatkan:",
    "english_text": "I asked Allah's Messenger (ﷺ) about virtue and vice. He said: Virtue is a kind disposition and vice is what rankles in your heart and that you disapprove that people should come to know of it.",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ، حَدَّثَنَا ابْنُ مَهْدِيٍّ، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، عَنْ \n عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِيهِ، عَنِ النَّوَّاسِ بْنِ سَمْعَانَ الأَنْصَارِيِّ، قَالَ سَأَلْتُ\n رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الْبِرِّ وَالإِثْمِ فَقَالَ ‏\n\"‏ الْبِرُّ حُسْنُ الْخُلُقِ وَالإِثْمُ مَا حَاكَ\n فِي صَدْرِكَ وَكَرِهْتَ أَنْ يَطَّلِعَ عَلَيْهِ النَّاسُ ‏\"‏ ‏.‏",
    "malay_translation": "Aku bertanya kepada Rasulullah ﷺ tentang kebaikan dan kemungkaran. Baginda menjawab: \"Kebaikan ialah akhlak yang mulia, dan kemungkaran ialah sesuatu yang mengganggu hatimu dan engkau tidak suka jika orang lain mengetahuinya.\""
  },
  {
    "id": 13634,
    "hadith_number": 6357,
    "tajuk_hadith": "Keistimewaan Akhlak Baik dan Definisi Kemalangan",
    "perawi_melayu": "Nawwas bin Sam'an meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، حَدَّثَنِي مُعَاوِيَةُ، - يَعْنِي\n ابْنَ صَالِحٍ - عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِيهِ، عَنْ نَوَّاسِ بْنِ سِمْعَانَ، قَالَ أَقَمْتُ\n مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِالْمَدِينَةِ سَنَةً مَا يَمْنَعُنِي مِنَ الْهِجْرَةِ إِلاَّ الْمَسْأَلَةُ كَانَ\n أَحَدُنَا إِذَا هَاجَرَ لَمْ يَسْأَلْ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ شَىْءٍ - قَالَ - فَسَأَلْتُهُ\n عَنِ الْبِرِّ وَالإِثْمِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْبِرُّ حُسْنُ الْخُلُقِ وَالإِثْمُ مَا حَاكَ\n فِي نَفْسِكَ وَكَرِهْتَ أَنْ يَطَّلِعَ عَلَيْهِ النَّاسُ ‏\"‏ ‏.‏",
    "malay_translation": "Aku tinggal bersama Rasulullah SAW di Madinah selama setahun.  Yang menghalang aku daripada berhijrah hanyalah kerana banyak bertanya kepada Baginda.  Biasanya, apabila seseorang daripada kami berhijrah, dia akan berhenti bertanya kepada Rasulullah SAW.  Maka aku bertanya kepada Baginda tentang kebaikan dan kejahatan.  Lalu Rasulullah SAW bersabda: \"Kebaikan ialah akhlak yang mulia, dan kejahatan ialah sesuatu yang mengganggu hatimu dan engkau tidak suka orang lain mengetahuinya.\""
  },
  {
    "id": 13635,
    "hadith_number": 6358,
    "tajuk_hadith": "Kepentingan Silaturahim",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدِ بْنِ جَمِيلِ بْنِ طَرِيفِ بْنِ عَبْدِ اللَّهِ الثَّقَفِيُّ، وَمُحَمَّدُ بْنُ عَبَّادٍ،\n قَالاَ حَدَّثَنَا حَاتِمٌ، - وَهُوَ ابْنُ إِسْمَاعِيلَ - عَنْ مُعَاوِيَةَ، - وَهُوَ ابْنُ أَبِي مُزَرِّدٍ مَوْلَى بَنِي\n هَاشِمٍ - حَدَّثَنِي عَمِّي أَبُو الْحُبَابِ، سَعِيدُ بْنُ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ\n صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ خَلَقَ الْخَلْقَ حَتَّى إِذَا فَرَغَ مِنْهُمْ قَامَتِ الرَّحِمُ فَقَالَتْ هَذَا\n مَقَامُ الْعَائِذِ مِنَ الْقَطِيعَةِ ‏.‏ قَالَ نَعَمْ أَمَا تَرْضَيْنَ أَنْ أَصِلَ مَنْ وَصَلَكِ وَأَقْطَعَ مَنْ قَطَعَكِ قَالَتْ\n بَلَى ‏.‏ قَالَ فَذَاكَ لَكِ ‏\"‏ ‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اقْرَءُوا إِنْ شِئْتُمْ ‏{‏\n فَهَلْ عَسَيْتُمْ إِنْ تَوَلَّيْتُمْ أَنْ تُفْسِدُوا فِي الأَرْضِ وَتُقَطِّعُوا أَرْحَامَكُمْ * أُولَئِكَ الَّذِينَ لَعَنَهُمُ\n اللَّهُ فَأَصَمَّهُمْ وَأَعْمَى أَبْصَارَهُمْ * أَفَلاَ يَتَدَبَّرُونَ الْقُرْآنَ أَمْ عَلَى قُلُوبٍ أَقْفَالُهَا‏}‏ ‏\"‏ ‏.‏",
    "malay_translation": "Allah SWT telah menciptakan alam semesta.  Setelah selesai penciptaan,  maka datanglah hubungan silaturahim dan berkata, “Inilah tempat perlindungan bagi mereka yang berlindung dari memutuskan hubungan kekeluargaan.” Allah SWT berfirman, “Ya, adakah kamu semua tidak redha sekiranya Aku menyambung hubungan sesiapa yang menyambung hubungan dengan kamu dan memutuskan hubungan sesiapa yang memutuskan hubungan dengan kamu?”  Hubungan silaturahim menjawab, “Ya, kami redha.” Allah SWT berfirman, “Maka itulah balasan untuk kamu.” Kemudian Rasulullah SAW bersabda, “Bacalah jika kamu suka:  “Maka apakah kamu sekiranya kamu berpaling, akan membuat kerosakan di muka bumi dan memutuskan hubungan kekeluargaan? Mereka itu orang-orang yang dilaknat oleh Allah, lalu Dia menjadikan mereka tuli dan buta penglihatan mereka.  Maka tidakkah mereka berfikir tentang Al-Quran? Atau adakah di atas hati mereka ada kunci-kunci?”"
  },
  {
    "id": 13636,
    "hadith_number": 6359,
    "tajuk_hadith": "Hubungan Silaturahim dan Rahmat Allah",
    "perawi_melayu": "Aisyah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The tie of kinship is suspended to the Throne and says: He who unites me Allah would unite him and he who severed me Allah would sever him.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لأَبِي بَكْرٍ - قَالاَ حَدَّثَنَا \n وَكِيعٌ، عَنْ مُعَاوِيَةَ بْنِ أَبِي مُزَرِّدٍ، عَنْ يَزِيدَ بْنِ رُومَانَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ قَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الرَّحِمُ مُعَلَّقَةٌ بِالْعَرْشِ تَقُولُ مَنْ وَصَلَنِي وَصَلَهُ اللَّهُ وَمَنْ\n قَطَعَنِي قَطَعَهُ اللَّهُ ‏\"‏ ‏.‏",
    "malay_translation": "Ikatan silaturahim digantungkan pada Arasy dan berkata: “Barangsiapa menyambungnya, Allah akan menyambungnya, dan barangsiapa memutuskan ikatannya, Allah akan memutuskannya.”"
  },
  {
    "id": 13637,
    "hadith_number": 6360,
    "tajuk_hadith": "Orang yang memutuskan silaturahim tidak akan masuk syurga",
    "perawi_melayu": "Jubair bin Mut'im meriwayatkan daripada bapanya bahawa Rasulullah SAW bersabda:",
    "english_text": "The severer would not enter Paradise. Ibn Umar said that Sufyan (explained it as): One who severs the tie of kinship would not enter Paradise.",
    "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَابْنُ أَبِي عُمَرَ، قَالاَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ مُحَمَّدِ،\n بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَدْخُلُ الْجَنَّةَ قَاطِعٌ\n ‏\"‏ ‏.‏ قَالَ ابْنُ أَبِي عُمَرَ قَالَ سُفْيَانُ يَعْنِي قَاطِعَ رَحِمٍ ‏.‏",
    "malay_translation": "Zuhri bin Harb dan Ibnu Abi Umar berkata:  Kami telah mendengar daripada Sufyan, daripada Az- Zuhri, daripada Muhammad bin Jubair bin Mut'im daripada bapanya, daripada Nabi SAW yang bersabda:  \"Tidak akan masuk syurga orang yang memutuskan silaturahim.\" Ibnu Abi Umar berkata bahawa Sufyan menjelaskan yang dimaksudkan ialah orang yang memutuskan hubungan kekeluargaan."
  },
  {
    "id": 13638,
    "hadith_number": 6361,
    "tajuk_hadith": "Orang yang memutuskan silaturahim tidak akan masuk syurga.",
    "perawi_melayu": "Jubair bin Mut'im meriwayatkan bahawa bapanya telah meriwayatkan kepadanya bahawa Rasulullah SAW bersabda:",
    "english_text": "The severer of the tie of kinship would not get into Paradise.",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ الضُّبَعِيُّ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ مَالِكٍ، عَنِ الزُّهْرِيِّ،\n أَنَّ مُحَمَّدَ بْنَ جُبَيْرِ بْنِ مُطْعِمٍ، أَخْبَرَهُ أَنَّ أَبَاهُ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم\n قَالَ ‏\n\"‏ لاَ يَدْخُلُ الْجَنَّةَ قَاطِعُ رَحِمٍ ‏\"‏ ‏.‏",
    "malay_translation": "Jubair bin Mut'im meriwayatkan bahawa bapanya telah meriwayatkan kepadanya bahawa Rasulullah SAW bersabda:  \"Orang yang memutuskan silaturahim tidak akan masuk syurga.\""
  },
  {
    "id": 13639,
    "hadith_number": 6362,
    "tajuk_hadith": "Hadis daripada Zuhri dengan Sanad yang Sama",
    "perawi_melayu": "Muhammad bin Rafi', Abd bin Humaid, melalui Abdur Razzaq, Ma'mar, dan Zuhri.",
    "english_text": "This hadith has been narrated on the authority of Zuhri with the same chain of transmitters.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، عَنْ عَبْدِ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ،\n بِهَذَا الإِسْنَادِ ‏.‏ مِثْلَهُ وَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Zuhri dengan sanad yang sama.  (Ia juga diriwayatkan bahawa)  Muhammad bin Rafi’ dan Abd bin Humaid meriwayatkan daripada Abdur Razzaq, daripada Ma’mar, daripada Zuhri, dengan sanad yang sama.  (Mereka berkata) Saya mendengar Rasulullah SAW bersabda…"
  },
  {
    "id": 13640,
    "hadith_number": 6363,
    "tajuk_hadith": "Menyambung Silaturahim untuk Memperluas Rezeki dan Umur",
    "perawi_melayu": "Anas bin Malik meriwayatkan:",
    "english_text": "I heard Allah's Messenger (ﷺ) as saying: He who is desirous that his means of sustenance should be expanded for him or his age may be lengthened, should join the tie of relationship.",
    "arabic_text": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ،\n عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ سَرَّهُ أَنْ يُبْسَطَ\n عَلَيْهِ رِزْقُهُ أَوْ يُنْسَأَ فِي أَثَرِهِ فَلْيَصِلْ رَحِمَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda: \"Barangsiapa yang menginginkan rezekinya diperluas atau umurnya dipanjangkan, hendaklah dia menyambung silaturahim.\""
  },
  {
    "id": 13641,
    "hadith_number": 6364,
    "tajuk_hadith": "Menyambung Silaturahim Memperluas Rezeki dan Men Panjangkan Umur",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "He who likes that his sustenance should be expanded and his age may be lengthened should join the tie of kinship.",
    "arabic_text": "وَحَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلُ بْنُ،\n خَالِدٍ قَالَ قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم\n قَالَ ‏\n\"‏ مَنْ أَحَبَّ أَنْ يُبْسَطَ لَهُ فِي رِزْقِهِ وَيُنْسَأَ لَهُ فِي أَثَرِهِ فَلْيَصِلْ رَحِمَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa yang menginginkan rezekinya diperluas dan umurnya dipanjangkan, hendaklah dia menyambung silaturahim."
  },
  {
    "id": 13642,
    "hadith_number": 6365,
    "tajuk_hadith": "Menyambung Silaturahim Walaupun Dikhianati",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa seorang lelaki berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا \n مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ الْعَلاَءَ بْنَ عَبْدِ الرَّحْمَنِ، يُحَدِّثُ عَنْ أَبِيهِ، عَنْ أَبِي،\n هُرَيْرَةَ أَنَّ رَجُلاً، قَالَ يَا رَسُولَ اللَّهِ إِنَّ لِي قَرَابَةً أَصِلُهُمْ وَيَقْطَعُونِي وَأُحْسِنُ إِلَيْهِمْ وَيُسِيئُونَ\n إِلَىَّ وَأَحْلُمُ عَنْهُمْ وَيَجْهَلُونَ عَلَىَّ ‏.‏ فَقَالَ ‏\n\"‏ لَئِنْ كُنْتَ كَمَا قُلْتَ فَكَأَنَّمَا تُسِفُّهُمُ الْمَلَّ وَلاَ يَزَالُ\n مَعَكَ مِنَ اللَّهِ ظَهِيرٌ عَلَيْهِمْ مَا دُمْتَ عَلَى ذَلِكَ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa seorang lelaki berkata, \"Wahai Rasulullah, saya mempunyai kaum kerabat yang saya cuba menjalin hubungan baik, tetapi mereka memutuskan hubungan dengan saya. Saya berbuat baik kepada mereka, tetapi mereka berbuat jahat kepada saya. Saya bersabar terhadap mereka, tetapi mereka bersikap kasar terhadap saya.\"  Baginda SAW bersabda: \"Jika keadaan kamu seperti yang kamu katakan, maka seolah-olah kamu sedang membakar muka mereka dengan abu yang panas, dan Allah SWT akan sentiasa menjadi pelindungmu terhadap mereka selagi kamu tetap berpegang kepada jalan yang benar.\""
  },
  {
    "id": 13643,
    "hadith_number": 6366,
    "tajuk_hadith": "Larangan Bermusuhan dan Memboikot Saudara Muslim",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Neither nurse mutual hatred, nor jealousy, nor enmity, and become as fellow brothers and servants of Allah. It is not lawful for a Muslim that he should keep his relations estranged with his brother beyond three days.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ،\n أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَبَاغَضُوا وَلاَ تَحَاسَدُوا وَلاَ تَدَابَرُوا وَكُونُوا\n عِبَادَ اللَّهِ إِخْوَانًا وَلاَ يَحِلُّ لِمُسْلِمٍ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلاَثٍ ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah kamu saling membenci, dengki, dan berpaling daripada antara satu sama lain. Jadilah kamu hamba Allah yang bersaudara. Tidak halal bagi seorang Muslim untuk memboikot saudaranya melebihi tiga hari."
  },
  {
    "id": 13644,
    "hadith_number": 6367,
    "tajuk_hadith": "Riwayat Anas bin Malik tentang Sabda Rasulullah SAW",
    "perawi_melayu": "Hajibu bin Walid, Muhammad bin Harb, Muhammad bin Walid Az-Zubaidi, dari Az- Zuhri, daripada Anas bin Malik, dan melalui sanad lain daripada Harmalah bin Yahya, daripada Ibnu Wahb, daripada Yunus, daripada Ibnu Syihab, daripada Anas daripada Nabi SAW",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَاجِبُ بْنُ الْوَلِيدِ، حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، حَدَّثَنَا مُحَمَّدُ بْنُ الْوَلِيدِ الزُّبَيْدِيُّ،\n عَنِ الزُّهْرِيِّ، أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ح \n وَحَدَّثَنِيهِ حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنِي ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ،\n عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ مَالِكٍ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Hajibu bin Walid, telah menceritakan kepada kami Muhammad bin Harb, telah menceritakan kepada kami Muhammad bin Walid Az-Zubaidi, daripada Az-Zuhri, telah memberitahu aku, Anas bin Malik, bahawa Rasulullah SAW bersabda…\nDan telah menceritakan kepadaku Harmalah bin Yahya, telah memberitahu aku Ibnu Wahb, telah memberitahu aku Yunus, daripada Ibnu Syihab, daripada Anas, daripada Nabi SAW dengan lafaz yang sama seperti riwayat Malik."
  },
  {
    "id": 13645,
    "hadith_number": 6368,
    "tajuk_hadith": "Jangan Putuskan Silaturahim",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Zuhri melalui sanad yang sama dengan tambahan daripada Ibn Uyaina (dan katanya):",
    "english_text": "\" Do not cut off (mutual relations).\"",
    "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَابْنُ أَبِي عُمَرَ، وَعَمْرٌو النَّاقِدُ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، عَنِ \n الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ وَزَادَ ابْنُ عُيَيْنَةَ ‏\n\"‏ وَلاَ تَقَاطَعُوا ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah kamu memutuskan silaturahim."
  },
  {
    "id": 13646,
    "hadith_number": 6369,
    "tajuk_hadith": "Larangan Dengki, Putus Silaturahim, dan Bermusuhan",
    "perawi_melayu": "Hadis ini diriwayatkan melalui beberapa sanad lain dan hadis yang diriwayatkan melalui Abd al-Razziq (lafaznya):",
    "english_text": "\" Neither nurse grudge nor sever (the ties of kinship), nor nurse enmity.\"",
    "arabic_text": "حَدَّثَنَا أَبُو كَامِلٍ، حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ،\n بْنُ حُمَيْدٍ كِلاَهُمَا عَنْ عَبْدِ الرَّزَّاقِ، جَمِيعًا عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ ‏.‏ أَمَّا رِوَايَةُ\n يَزِيدَ عَنْهُ فَكَرِوَايَةِ سُفْيَانَ عَنِ الزُّهْرِيِّ يَذْكُرُ الْخِصَالَ الأَرْبَعَةَ جَمِيعًا وَأَمَّا حَدِيثُ عَبْدِ الرَّزَّاقِ\n ‏\n\"‏ وَلاَ تَحَاسَدُوا وَلاَ تَقَاطَعُوا وَلاَ تَدَابَرُوا ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah kamu berdengki, memutuskan silaturahim, dan janganlah kamu bermusuhan."
  },
  {
    "id": 13647,
    "hadith_number": 6370,
    "tajuk_hadith": "Jangan Dengki, Jangan Bermusuhan, dan Jaga Silaturahim",
    "perawi_melayu": "Anas meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Nurse no grudge, nurse no aversion and do not sever ties of kinship and live like fellow-brothers as servants of Allah. This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters but with this addition:\" As Allah has commanded you.\"",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّوسلم قَالَ ‏\"‏ لاَ تَحَاسَدُوا وَلاَ تَبَاغَضُوا وَلاَ تَقَاطَعُوا وَكُونُوا عِبَادَ\n اللَّهِ إِخْوَانًا ‏\"‏ ‏.‏ \n حَدَّثَنِيهِ عَلِيُّ بْنُ نَصْرٍ الْجَهْضَمِيُّ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ\n مِثْلَهُ وَزَادَ ‏\"‏ كَمَا أَمَرَكُمُ اللَّهُ ‏\"‏ ‏.‏",
    "malay_translation": "Jangan kamu berdengki-dengki, jangan kamu bermusuhan, dan jangan kamu memutuskan silaturahim. Jadilah kamu hamba Allah yang bersaudara.  Riwayat lain daripada Syu'bah dengan sanad yang sama, menambahkan: \"Sebagaimana Allah telah memerintahkan kamu.\""
  },
  {
    "id": 13648,
    "hadith_number": 6371,
    "tajuk_hadith": "Menghindari Permusuhan Lebih Tiga Malam",
    "perawi_melayu": "Abu Ayyub Al-Ansari meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "It is not permissible for a Muslim to have estranged relations with his brother beyond three nights, the one turning one way and the other turning the other way when they meet; the better of the two is one who is the first to give a greeting.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ عَطَاءِ بْنِ يَزِيدَ،\n اللَّيْثِيِّ عَنْ أَبِي أَيُّوبَ الأَنْصَارِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَحِلُّ لِمُسْلِمٍ\n أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلاَثِ لَيَالٍ يَلْتَقِيَانِ فَيُعْرِضُ هَذَا وَيُعْرِضُ هَذَا وَخَيْرُهُمَا الَّذِي يَبْدَأُ\n بِالسَّلاَمِ ‏\"‏ ‏.‏",
    "malay_translation": "Tidak halal bagi seorang Muslim untuk memutuskan hubungan dengan saudaranya melebihi tiga malam, di mana mereka bertemu lalu saling berpaling; dan sebaik-baik mereka berdua ialah orang yang mula memberi salam."
  },
  {
    "id": 13649,
    "hadith_number": 6372,
    "tajuk_hadith": "Orang yang saling mengelak",
    "perawi_melayu": "Hadis ini diriwayatkan oleh Zuhri dengan sedikit perbezaan lafaz.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ قَالُوا حَدَّثَنَا \n سُفْيَانُ، ح وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح وَحَدَّثَنَا حَاجِبُ،\n بْنُ الْوَلِيدِ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، عَنِ الزُّبَيْدِيِّ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَمُحَمَّدُ،\n بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ عَنْ عَبْدِ الرَّزَّاقِ، عَنْ مَعْمَرٍ، كُلُّهُمْ عَنِ الزُّهْرِيِّ، بِإِسْنَادِ مَالِكٍ وَمِثْلِ\n حَدِيثِهِ إِلاَّ قَوْلَهُ ‏\"‏ فَيُعْرِضُ هَذَا وَيُعْرِضُ هَذَا ‏\"‏ ‏.‏ فَإِنَّهُمْ جَمِيعًا قَالُوا فِي حَدِيثِهِمْ غَيْرَ\n مَالِكٍ ‏\"‏ فَيَصُدُّ هَذَا وَيَصُدُّ هَذَا ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan oleh Qotaibah bin Sa'id, Abu Bakar bin Abi Syaibah dan Zuhari bin Harb. Mereka berkata: Telah menceritakan kepada kami Sufian. Dan telah menceritakan kepadaku Harmalah bin Yahya, telah memberitakan kepada kami Ibnu Wahb, telah memberitakan kepadaku Yunus. Dan telah menceritakan kepada kami Hajib bin Walid, telah menceritakan kepada kami Muhammad bin Harb daripada Az-Zubairi. Dan telah menceritakan kepada kami Ishaq bin Ibrahim Al-Hanthali, Muhammad bin Rafi' dan Abd bin Humaid daripada Abdurrazzaq, daripada Ma'mar, semuanya daripada Az-Zuhri dengan sanad Malik dan serupa dengan hadisnya kecuali katanya: “Maka seorang berpaling dan seorang lagi berpaling.” Kerana mereka semua berkata dalam hadis mereka selain Malik: “Maka seorang menolak dan seorang lagi menolak.”"
  },
  {
    "id": 13650,
    "hadith_number": 6373,
    "tajuk_hadith": "Larangan Memboikot Saudara Seagama Lebih Tiga Hari",
    "perawi_melayu": "'Abdullah bin 'Umar meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "It is not permissible for a Muslim to have estranged relations with his brother beyond three days.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي فُدَيْكٍ، أَخْبَرَنَا الضَّحَّاكُ، - وَهُوَ ابْنُ\n عُثْمَانَ - عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ\n يَحِلُّ لِلْمُؤْمِنِ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلاَثَةِ أَيَّامٍ ‏\"‏ ‏.‏",
    "malay_translation": "Tidak halal bagi seorang mukmin untuk memboikot saudaranya melebihi tiga hari."
  },
  {
    "id": 13651,
    "hadith_number": 6374,
    "tajuk_hadith": "Larangan Memutuskan Silaturahim Lebih Tiga Hari",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There should be no estranged relations beyond three days.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ مُحَمَّدٍ - عَنِ الْعَلاَءِ، عَنْ \n أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ هِجْرَةَ بَعْدَ ثَلاَثٍ ‏\"‏\n ‏.‏",
    "malay_translation": "Tidak harus memutuskan silaturahim melebihi tiga hari."
  },
  {
    "id": 13652,
    "hadith_number": 6375,
    "tajuk_hadith": "Menjauhi Syak dan Persaudaraan Islam",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Avoid suspicion, for suspicion is the gravest lie in talk and do not be inquisitive about one another and do not spy upon one another and do not feel envy with the other, and nurse no malice, and nurse no aversion and hostility against one another. And be fellow-brothers and servants of Allah.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ \n أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِيَّاكُمْ وَالظَّنَّ فَإِنَّ الظَّنَّ أَكْذَبُ الْحَدِيثِ\n وَلاَ تَحَسَّسُوا وَلاَ تَجَسَّسُوا وَلاَ تَنَافَسُوا وَلاَ تَحَاسَدُوا وَلاَ تَبَاغَضُوا وَلاَ تَدَابَرُوا وَكُونُوا\n عِبَادَ اللَّهِ إِخْوَانًا ‏\"‏ ‏.‏",
    "malay_translation": "Jauhilah sangkaan, kerana sangkaan itu adalah dusta yang paling besar. Janganlah kamu saling mencari-cari kesalahan, janganlah kamu saling mengintip, janganlah kamu saling berdengki, janganlah kamu saling membenci, janganlah kamu saling bermusuhan dan hendaklah kamu semua menjadi hamba Allah yang bersaudara."
  },
  {
    "id": 13653,
    "hadith_number": 6376,
    "tajuk_hadith": "Larangan Bermusuhan dan Bersaing dalam Perniagaan",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Don't have estranged relations (with the others) and don't nurse enmity and don't enter into a transaction when the other (has already entered) and be fellow-brothers and servants of Allah.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ مُحَمَّدٍ - عَنِ الْعَلاَءِ، عَنْ \n أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَهَجَّرُوا وَلاَ تَدَابَرُوا\n وَلاَ تَحَسَّسُوا وَلاَ يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah kamu memutuskan silaturahim, janganlah kamu saling membenci, janganlah kamu saling berebut dalam perniagaan, dan hendaklah kamu menjadi hamba Allah yang bersaudara."
  },
  {
    "id": 13654,
    "hadith_number": 6377,
    "tajuk_hadith": "Larangan Dengki, Permusuhan, dan Mengintip",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying. Don't nurse malice against one another, don't nurse aversion against one another and don't be inquisitive about one another and don't outbid one another (with a view to raising the price) and be fellow-brothers and servants of Allah.",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي،\n هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَحَاسَدُوا وَلاَ تَبَاغَضُوا وَلاَ تَجَسَّسُوا\n وَلاَ تَحَسَّسُوا وَلاَ تَنَاجَشُوا وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا ‏\"‏ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:  \"Janganlah kamu saling dengki, janganlah kamu saling bermusuhan, janganlah kamu saling mengintip, janganlah kamu saling menaikkan harga (dalam jual beli), dan hendaklah kamu menjadi hamba Allah yang bersaudara.\" "
  },
  {
    "id": 13655,
    "hadith_number": 6378,
    "tajuk_hadith": "Silaturrahim dan Persaudaraan Islam",
    "perawi_melayu": "Hadis ini diriwayatkan daripada al-A'mash melalui sanad yang sama (dan lafaznya):",
    "english_text": "\" Don't sever relations of kinship, don't bear enmity against one another, don't bear aversion against one another and don't feel envy against the other and live as fellow-brothers as Allah has commanded you.",
    "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَعَلِيُّ بْنُ نَصْرٍ الْجَهْضَمِيُّ، قَالاَ حَدَّثَنَا وَهْبُ،\n بْنُ جَرِيرٍ حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ ‏\n\"‏ لاَ تَقَاطَعُوا وَلاَ تَدَابَرُوا وَلاَ تَبَاغَضُوا\n وَلاَ تَحَاسَدُوا وَكُونُوا إِخْوَانًا كَمَا أَمَرَكُمُ اللَّهُ ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah kamu memutuskan silaturrahim, janganlah kamu bermusuhan sesama kamu, janganlah kamu saling membenci, dan janganlah kamu saling dengki.  Hendaklah kamu menjadi saudara-saudara seagama sebagaimana yang diperintahkan Allah SWT kepadamu."
  },
  {
    "id": 13656,
    "hadith_number": 6379,
    "tajuk_hadith": "Larangan Bermusuhan dan Berdengki",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Don't bear aversion against one another and don't be jealous of one another and be servants of Allah.",
    "arabic_text": "وَحَدَّثَنِي أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ، حَدَّثَنَا حَبَّانُ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا سُهَيْلٌ، عَنْ \n أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَبَاغَضُوا وَلاَ تَدَابَرُوا وَلاَ\n تَنَافَسُوا وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah kamu bermusuhan, janganlah kamu berdengki-dengki, dan hendaklah kamu menjadi hamba Allah yang bersaudara."
  },
  {
    "id": 13657,
    "hadith_number": 6380,
    "tajuk_hadith": "Persaudaraan Islam dan Larangan Menzalimi Sesama Muslim",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا دَاوُدُ، - يَعْنِي ابْنَ قَيْسٍ - عَنْ أَبِي،\n سَعِيدٍ مَوْلَى عَامِرِ بْنِ كُرَيْزٍ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n ‏\"‏ لاَ تَحَاسَدُوا وَلاَ تَنَاجَشُوا وَلاَ تَبَاغَضُوا وَلاَ تَدَابَرُوا وَلاَ يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ\n وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا ‏.‏ الْمُسْلِمُ أَخُو الْمُسْلِمِ لاَ يَظْلِمُهُ وَلاَ يَخْذُلُهُ وَلاَ يَحْقِرُهُ ‏.‏ التَّقْوَى\n هَا هُنَا ‏\"‏ ‏.‏ وَيُشِيرُ إِلَى صَدْرِهِ ثَلاَثَ مَرَّاتٍ ‏\"‏ بِحَسْبِ امْرِئٍ مِنَ الشَّرِّ أَنْ يَحْقِرَ أَخَاهُ الْمُسْلِمَ\n كُلُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ حَرَامٌ دَمُهُ وَمَالُهُ وَعِرْضُهُ ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah kamu berhasad dengki, janganlah kamu menaikkan harga secara tidak adil (menipu), janganlah kamu bermusuhan, janganlah kamu saling membelakangi, dan janganlah sebahagian daripada kamu menjual sesuatu barang  selepas orang lain telah menjual barang yang sama.  Hendaklah kamu menjadi hamba Allah yang bersaudara. Seorang Muslim adalah saudara kepada Muslim yang lain. Dia tidak akan menzaliminya, tidak akan mengecewakannya dan tidak akan menghinanya.  (Rasulullah SAW bersabda sambil) menunjuk ke dadanya sebanyak tiga kali, “Ketakwaan itu di sini.”  Sungguh merupakan kejahatan yang besar bagi seorang Muslim untuk menghina saudaranya yang Muslim.  Segala sesuatu yang dimiliki oleh seorang Muslim adalah haram bagi saudaranya sesama Muslim; darahnya, hartanya dan kehormatannya."
  },
  {
    "id": 13658,
    "hadith_number": 6381,
    "tajuk_hadith": "Allah Melihat Hati, Bukan Rupa",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Abu Hurairah dengan beberapa tambahan (dan tambahan itu adalah):",
    "english_text": "\" Verily Allah does not look to your bodies nor to your faces but He looks to your hearts,\" and he pointed towards the heart with his fingers.",
    "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ أُسَامَةَ، -\n وَهُوَ ابْنُ زَيْدٍ - أَنَّهُ سَمِعَ أَبَا سَعِيدٍ، مَوْلَى عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ كُرَيْزٍ يَقُولُ سَمِعْتُ أَبَا،\n هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ فَذَكَرَ نَحْوَ حَدِيثِ دَاوُدَ وَزَادَ وَنَقَصَ\n وَمِمَّا زَادَ فِيهِ ‏\n\"‏ إِنَّ اللَّهَ لاَ يَنْظُرُ إِلَى أَجْسَادِكُمْ وَلاَ إِلَى صُوَرِكُمْ وَلَكِنْ يَنْظُرُ إِلَى قُلُوبِكُمْ\n ‏\"‏ ‏.‏ وَأَشَارَ بِأَصَابِعِهِ إِلَى صَدْرِهِ ‏.‏",
    "malay_translation": "Sesungguhnya Allah SWT tidak melihat kepada jasad kamu dan wajah kamu, tetapi Dia melihat kepada hati kamu.”  Dan Baginda SAW menunjuk ke arah dada Baginda dengan jari Baginda."
  },
  {
    "id": 13659,
    "hadith_number": 6382,
    "tajuk_hadith": "Allah Melihat Hati dan Amalan",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Verily Allah does not look to your faces and your wealth but He looks to your heart and to your deeds.",
    "arabic_text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا كَثِيرُ بْنُ هِشَامٍ، حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ، عَنْ يَزِيدَ بْنِ،\n الأَصَمِّ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ اللَّهَ لاَ يَنْظُرُ إِلَى\n صُوَرِكُمْ وَأَمْوَالِكُمْ وَلَكِنْ يَنْظُرُ إِلَى قُلُوبِكُمْ وَأَعْمَالِكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Sesungguhnya Allah SWT tidak melihat kepada wajah dan harta kamu, tetapi Allah SWT melihat kepada hati dan amal kamu."
  },
  {
    "id": 13660,
    "hadith_number": 6383,
    "tajuk_hadith": "Pengampunan pada Hari Isnin dan Khamis",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، فِيمَا قُرِئَ عَلَيْهِ عَنْ سُهَيْلٍ، عَنْ أَبِيهِ،\n عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ تُفْتَحُ أَبْوَابُ الْجَنَّةِ يَوْمَ الاِثْنَيْنِ\n وَيَوْمَ الْخَمِيسِ فَيُغْفَرُ لِكُلِّ عَبْدٍ لاَ يُشْرِكُ بِاللَّهِ شَيْئًا إِلاَّ رَجُلاً كَانَتْ بَيْنَهُ وَبَيْنَ أَخِيهِ شَحْنَاءُ\n فَيُقَالُ أَنْظِرُوا هَذَيْنِ حَتَّى يَصْطَلِحَا أَنْظِرُوا هَذَيْنِ حَتَّى يَصْطَلِحَا أَنْظِرُوا هَذَيْنِ حَتَّى يَصْطَلِحَا\n ‏\"‏ ‏.‏ \n حَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَحْمَدُ بْنُ عَبْدَةَ،\n الضَّبِّيُّ عَنْ عَبْدِ الْعَزِيزِ الدَّرَاوَرْدِيِّ، كِلاَهُمَا عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، بِإِسْنَادِ مَالِكٍ نَحْوَ حَدِيثِهِ\n غَيْرَ أَنَّ فِي حَدِيثِ الدَّرَاوَرْدِيِّ ‏\"‏ إِلاَّ الْمُتَهَاجِرَيْنِ ‏\"‏ ‏.‏ مِنْ رِوَايَةِ ابْنِ عَبْدَةَ وَقَالَ قُتَيْبَةُ ‏\"‏\n إِلاَّ الْمُهْتَجِرَيْنِ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah bin Sa'id, dari Malik bin Anas, dalam apa yang dibacakan kepadanya dari Suhail, dari bapanya, dari Abu Hurairah, bahawa Rasulullah SAW bersabda:  \"Pintu-pintu syurga dibuka pada hari Isnin dan hari Khamis. Maka setiap hamba yang tidak menyekutukan Allah dengan sesuatu akan diampunkan, kecuali orang yang ada permusuhan di antara dia dengan saudaranya. Maka dikatakan: Tunggulah kedua-duanya sehingga mereka berdamai. Tunggulah kedua-duanya sehingga mereka berdamai. Tunggulah kedua-duanya sehingga mereka berdamai.\"  Telah menceritakan kepadaku Zuhair bin Harb, telah menceritakan kepada kami Jarir, dan telah menceritakan kepada kami Qutaibah bin Sa'id dan Ahmad bin 'Abdah Ad-Dabbi dari 'Abd al-'Aziz Ad-Darawardi, keduanya dari Suhail, dari bapanya, dengan sanad Malik, hampir sama dengan hadisnya, kecuali dalam hadis Ad-Darawardi: \"kecuali mereka yang saling memboikot.\" Dari riwayat Ibnu 'Abdah dan Qutaibah berkata: \"kecuali mereka yang saling bermusuhan.\""
  },
  {
    "id": 13661,
    "hadith_number": 6384,
    "tajuk_hadith": "Pengampunan Allah pada Hari Khamis dan Isnin",
    "perawi_melayu": "Abu Hurairah meriwayatkan hadis marfu' (dan katanya):",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ مُسْلِمِ بْنِ أَبِي مَرْيَمَ، عَنْ أَبِي صَالِحٍ، سَمِعَ \n أَبَا هُرَيْرَةَ، رَفَعَهُ مَرَّةً قَالَ ‏\n\"‏ تُعْرَضُ الأَعْمَالُ فِي كُلِّ يَوْمِ خَمِيسٍ وَاثْنَيْنِ فَيَغْفِرُ اللَّهُ عَزَّ\n وَجَلَّ فِي ذَلِكَ الْيَوْمِ لِكُلِّ امْرِئٍ لاَ يُشْرِكُ بِاللَّهِ شَيْئًا إِلاَّ امْرَأً كَانَتْ بَيْنَهُ وَبَيْنَ أَخِيهِ شَحْنَاءُ\n فَيُقَالُ ارْكُوا هَذَيْنِ حَتَّى يَصْطَلِحَا ارْكُوا هَذَيْنِ حَتَّى يَصْطَلِحَا ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ibn Abi Umar, telah menceritakan kepada kami Sufyan, daripada Muslim bin Abi Maryam, daripada Abi Salikh, telah mendengar daripada Abu Hurairah, beliau meriwayatkan hadis marfu' (dan katanya):  \"Amalan-amalan akan dibentangkan pada setiap hari Khamis dan Isnin, maka Allah SWT akan mengampunkan pada hari itu bagi setiap orang yang tidak menyekutukan Allah dengan sesuatu pun, kecuali bagi orang yang ada permusuhan di antara dia dengan saudaranya. Maka dikatakan: Tangguhkanlah kedua-duanya sehingga mereka berdamai.\" "
  },
  {
    "id": 13662,
    "hadith_number": 6385,
    "tajuk_hadith": "Pengampunan Ditolak Kerana Dendam",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda",
    "english_text": "Leave them and put them off until they are turned to reconciliation.",
    "arabic_text": "حَدَّثَنَا أَبُو الطَّاهِرِ، وَعَمْرُو بْنُ سَوَّادٍ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنَا مَالِكُ بْنُ،\n أَنَسٍ عَنْ مُسْلِمِ بْنِ أَبِي مَرْيَمَ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله\n عليه وسلم قَالَ ‏\n\"‏ تُعْرَضُ أَعْمَالُ النَّاسِ فِي كُلِّ جُمُعَةٍ مَرَّتَيْنِ يَوْمَ الاِثْنَيْنِ وَيَوْمَ الْخَمِيسِ\n فَيُغْفَرُ لِكُلِّ عَبْدٍ مُؤْمِنٍ إِلاَّ عَبْدًا بَيْنَهُ وَبَيْنَ أَخِيهِ شَحْنَاءُ فَيُقَالُ اتْرُكُوا - أَوِ ارْكُوا - هَذَيْنِ\n حَتَّى يَفِيئَا ‏\"‏ ‏.‏",
    "malay_translation": "Amalan manusia akan dibentangkan setiap minggu sebanyak dua kali, iaitu pada hari Isnin dan Khamis.  Setiap hamba yang beriman akan diampunkan dosa-dosanya kecuali hamba yang ada permusuhan di antara dia dengan saudaranya. Maka dikatakan: \"Tinggalkanlah (atau tangguhkanlah) kedua-duanya sehingga mereka berdamai.\""
  },
  {
    "id": 13663,
    "hadith_number": 6386,
    "tajuk_hadith": "Naungan Allah SWT pada Hari Kiamat",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Verily. Allah would say on the Day of Resurrection: Where are those who have mutual love for My Glory's sake? Today I shall shelter them in My shadow when there is no other shadow but the shadow of Mine.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، فِيمَا قُرِئَ عَلَيْهِ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ،\n الرَّحْمَنِ بْنِ مَعْمَرٍ عَنْ أَبِي الْحُبَابِ، سَعِيدِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ\n صلى الله عليه وسلم ‏\n\"‏ إِنَّ اللَّهَ يَقُولُ يَوْمَ الْقِيَامَةِ أَيْنَ الْمُتَحَابُّونَ بِجَلاَلِي الْيَوْمَ أُظِلُّهُمْ فِي\n ظِلِّي يَوْمَ لاَ ظِلَّ إِلاَّ ظِلِّي ‏\"‏ ‏.‏",
    "malay_translation": "Sesungguhnya, Allah SWT akan berfirman pada Hari Kiamat: \"Di manakah orang-orang yang saling mengasihi kerana keagungan-Ku? Pada hari ini Aku akan menaungi mereka di bawah naungan-Ku, pada hari yang tiada naungan melainkan naungan-Ku.\""
  },
  {
    "id": 13664,
    "hadith_number": 6387,
    "tajuk_hadith": "Cinta kerana Allah SWT",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَبِي رَافِعٍ،\n عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\n\"‏ أَنَّ رَجُلاً زَارَ أَخًا لَهُ فِي قَرْيَةٍ أُخْرَى\n فَأَرْصَدَ اللَّهُ لَهُ عَلَى مَدْرَجَتِهِ مَلَكًا فَلَمَّا أَتَى عَلَيْهِ قَالَ أَيْنَ تُرِيدُ قَالَ أُرِيدُ أَخًا لِي فِي هَذِهِ\n الْقَرْيَةِ ‏.‏ قَالَ هَلْ لَكَ عَلَيْهِ مِنْ نِعْمَةٍ تَرُبُّهَا قَالَ لاَ غَيْرَ أَنِّي أَحْبَبْتُهُ فِي اللَّهِ عَزَّ وَجَلَّ ‏.‏\n قَالَ فَإِنِّي رَسُولُ اللَّهِ إِلَيْكَ بِأَنَّ اللَّهَ قَدْ أَحَبَّكَ كَمَا أَحْبَبْتَهُ فِيهِ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:  \"Seorang lelaki melawat saudaranya di sebuah kampung yang lain. Maka Allah SWT mengutuskan seorang malaikat untuk menunggunya di perjalanan.  Apabila lelaki itu sampai kepada malaikat itu, malaikat itu bertanya, ‘Ke mana engkau hendak pergi?’ Lelaki itu menjawab, ‘Saya hendak pergi kepada saudara saya di kampung ini.’ Malaikat itu bertanya, ‘Adakah engkau mempunyai sesuatu kebaikan terhadapnya yang perlu dibalas?’ Lelaki itu menjawab, ‘Tidak, melainkan saya mencintainya kerana Allah SWT.’ Malaikat itu berkata, ‘Sesungguhnya aku adalah utusan Allah SWT kepadamu untuk memberitahu bahawa Allah SWT telah mencintaimu sebagaimana engkau mencintainya kerana-Nya.’\""
  },
  {
    "id": 13665,
    "hadith_number": 6388,
    "tajuk_hadith": "Sanad Hadith daripada Hammad bin Salama",
    "perawi_melayu": "Hammad bin Salama dan periwayat lain yang sama sanadnya.",
    "english_text": "This hadith has been narrated on the authority of Hammid b. Salama with the same of transmitters.",
    "arabic_text": "قَالَ الشَّيْخُ أَبُو أَحْمَدَ أَخْبَرَنِي أَبُو بَكْرٍ، مُحَمَّدُ بْنُ زَنْجُويَهْ الْقُشَيْرِيُّ حَدَّثَنَا عَبْدُ،\n الأَعْلَى بْنُ حَمَّادٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏",
    "malay_translation": "Sheikh Abu Ahmad berkata: Abu Bakar, Muhammad bin Zangawiyah al-Qushairi telah memberitahu saya; Abd al-A'la bin Hammad telah memberitahu kami; Hammad bin Salama telah memberitahu kami dengan sanad yang hampir sama."
  },
  {
    "id": 13666,
    "hadith_number": 6389,
    "tajuk_hadith": "Kebaikan Menziarahi Orang Sakit",
    "perawi_melayu": "Abu Rabi' meriwayatkan secara langsung daripada Rasulullah SAW bahawa:",
    "english_text": "The one who visits the sick is in fact like one who is in the fruit garden of Paradise so long as he does not return.",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَأَبُو الرَّبِيعِ الزَّهْرَانِيُّ، قَالاَ حَدَّثَنَا حَمَّادٌ، - يَعْنِيَانِ ابْنَ\n زَيْدٍ - عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي أَسْمَاءَ، عَنْ ثَوْبَانَ، قَالَ أَبُو الرَّبِيعِ رَفَعَهُ إِلَى\n النَّبِيِّ صلى الله عليه وسلم وَفِي حَدِيثِ سَعِيدٍ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n ‏\n\"‏ عَائِدُ الْمَرِيضِ فِي مَخْرَفَةِ الْجَنَّةِ حَتَّى يَرْجِعَ ‏\"‏ ‏.‏",
    "malay_translation": "Sesiapa yang melawat orang sakit, sesungguhnya dia seperti berada di dalam kebun syurga sehingga dia kembali."
  },
  {
    "id": 13667,
    "hadith_number": 6390,
    "tajuk_hadith": "Keutamaan Menziarahi Orang Sakit",
    "perawi_melayu": "Thawban, hamba yang dimerdekakan Rasulullah SAW, meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "He who visits the sick continues to remain in the fruit garden of Paradise until he returns.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، أَخْبَرَنَا هُشَيْمٌ، عَنْ خَالِدٍ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي،\n أَسْمَاءَ عَنْ ثَوْبَانَ، مَوْلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ قَالَ رَسُولُ اللَّهِ صلى الله\n عليه وسلم ‏\n\"‏ مَنْ عَادَ مَرِيضًا لَمْ يَزَلْ فِي خُرْفَةِ الْجَنَّةِ حَتَّى يَرْجِعَ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa yang melawat orang sakit, maka dia akan sentiasa berada di dalam kebun buah-buahan syurga sehingga dia kembali."
  },
  {
    "id": 13668,
    "hadith_number": 6391,
    "tajuk_hadith": "Ziarah Saudara Muslim",
    "perawi_melayu": "Thawban meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Verily, when a Muslim visits his brother in Islam he is supposed to remain in the fruit garden of Paradise until he returns.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا خَالِدٌ، عَنْ أَبِي قِلاَبَةَ،\n عَنْ أَبِي أَسْمَاءَ الرَّحَبِيِّ، عَنْ ثَوْبَانَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الْمُسْلِمَ إِذَا\n عَادَ أَخَاهُ الْمُسْلِمَ لَمْ يَزَلْ فِي خُرْفَةِ الْجَنَّةِ حَتَّى يَرْجِعَ ‏\"‏ ‏.‏",
    "malay_translation": "Sesungguhnya, apabila seorang Muslim melawat saudaranya yang Muslim, maka dia akan tetap berada di taman syurga sehingga dia kembali."
  },
  {
    "id": 13669,
    "hadith_number": 6392,
    "tajuk_hadith": "Keutamaan Menziarahi Orang Sakit",
    "perawi_melayu": "Thawban, hamba Rasulullah SAW, meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنْ يَزِيدَ، - وَاللَّفْظُ لِزُهَيْرٍ\n - حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا عَاصِمٌ الأَحْوَلُ، عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ، - وَهُوَ أَبُو قِلاَبَةَ\n - عَنْ أَبِي الأَشْعَثِ الصَّنْعَانِيِّ، عَنْ أَبِي أَسْمَاءَ الرَّحَبِيِّ، عَنْ ثَوْبَانَ، مَوْلَى رَسُولِ اللَّهِ صلى\n الله عليه وسلم عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ عَادَ مَرِيضًا لَمْ يَزَلْ فِي\n خُرْفَةِ الْجَنَّةِ ‏\"‏ ‏.‏ قِيلَ يَا رَسُولَ اللَّهِ وَمَا خُرْفَةُ الْجَنَّةِ قَالَ ‏\"‏ جَنَاهَا ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Bakar bin Abi Syaibah dan Zuhair bin Harb, keduanya daripada Yazid - dan lafaz daripada Zuhair - telah menceritakan kepada kami Yazid bin Harun, telah memberitahu kami Asim Al-Ahwal, daripada Abdullah bin Zaid - iaitu Abu Qilabah - daripada Abu Asy'ats As-San'ani, daripada Abu Asma' Ar-Rahabi, daripada Thawban, hamba Rasulullah SAW, daripada Rasulullah SAW, baginda bersabda:  \"Barangsiapa yang melawat orang sakit, maka dia tetap berada di dalam Khurfah (sebuah tempat) syurga.\"  Kemudian dikatakan: \"Wahai Rasulullah, apakah Khurfah syurga itu?\" Baginda menjawab:  \"Ia adalah taman buah-buahannya.\""
  },
  {
    "id": 13670,
    "hadith_number": 6393,
    "tajuk_hadith": "Sanad Hadith yang Sama",
    "perawi_melayu": "Suwaid bin Sa'id meriwayatkan daripada Marwan bin Muawiyah, daripada Asim al-Ahwal, melalui sanad yang sama.",
    "english_text": "This hadith has been narrated on the authority of Asim al-Ahwal with the same chain of transmitters.",
    "arabic_text": "حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، عَنْ عَاصِمٍ الأَحْوَلِ، بِهَذَا الإِسْنَادِ\n ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Asim al-Ahwal melalui jalan periwayatan yang sama."
  },
  {
    "id": 13671,
    "hadith_number": 6394,
    "tajuk_hadith": "Melawat Orang Sakit dan Memberi Makan/Minum",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ،\n عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ اللَّهَ عَزَّ\n وَجَلَّ يَقُولُ يَوْمَ الْقِيَامَةِ يَا ابْنَ آدَمَ مَرِضْتُ فَلَمْ تَعُدْنِي ‏.‏ قَالَ يَا رَبِّ كَيْفَ أَعُودُكَ وَأَنْتَ\n رَبُّ الْعَالَمِينَ ‏.‏ قَالَ أَمَا عَلِمْتَ أَنَّ عَبْدِي فُلاَنًا مَرِضَ فَلَمْ تَعُدْهُ أَمَا عَلِمْتَ أَنَّكَ لَوْ عُدْتَهُ\n لَوَجَدْتَنِي عِنْدَهُ يَا ابْنَ آدَمَ اسْتَطْعَمْتُكَ فَلَمْ تُطْعِمْنِي ‏.‏ قَالَ يَا رَبِّ وَكَيْفَ أُطْعِمُكَ وَأَنْتَ رَبُّ\n الْعَالَمِينَ ‏.‏ قَالَ أَمَا عَلِمْتَ أَنَّهُ اسْتَطْعَمَكَ عَبْدِي فُلاَنٌ فَلَمْ تُطْعِمْهُ أَمَا عَلِمْتَ أَنَّكَ لَوْ أَطْعَمْتَهُ\n لَوَجَدْتَ ذَلِكَ عِنْدِي يَا ابْنَ آدَمَ اسْتَسْقَيْتُكَ فَلَمْ تَسْقِنِي ‏.‏ قَالَ يَا رَبِّ كَيْفَ أَسْقِيكَ وَأَنْتَ رَبُّ\n الْعَالَمِينَ قَالَ اسْتَسْقَاكَ عَبْدِي فُلاَنٌ فَلَمْ تَسْقِهِ أَمَا إِنَّكَ لَوْ سَقَيْتَهُ وَجَدْتَ ذَلِكَ عِنْدِي ‏\"‏ ‏.‏",
    "malay_translation": "Sesungguhnya Allah SWT berfirman pada hari kiamat: Wahai anak Adam, Aku sakit tetapi engkau tidak melawatKu.  Dia akan berkata: Ya Tuhanku, bagaimana aku dapat melawatMu sedangkan Engkau adalah Tuhan sekalian alam?  Allah akan menjawab: Tidakkah engkau tahu bahawa hambaKu si fulan sakit tetapi engkau tidak melawatnya? Tidakkah engkau tahu bahawa sekiranya engkau melawatnya, nescaya engkau akan mendapati Aku bersamanya? Wahai anak Adam, Aku meminta makanan daripada mu tetapi engkau tidak memberi makan kepadaKu. Dia akan berkata: Ya Tuhanku, bagaimana aku dapat memberi makan kepadaMu sedangkan Engkau adalah Tuhan sekalian alam? Allah akan menjawab: Tidakkah engkau tahu bahawa hambaKu si fulan meminta makanan daripada mu tetapi engkau tidak memberinya makan? Tidakkah engkau tahu bahawa sekiranya engkau memberinya makan, nescaya engkau akan mendapati pahala itu di sisiKu? Wahai anak Adam, Aku meminta minuman daripada mu tetapi engkau tidak memberi minuman kepadaKu. Dia akan berkata: Ya Tuhanku, bagaimana aku dapat memberi minuman kepadaMu sedangkan Engkau adalah Tuhan sekalian alam? Allah akan menjawab: HambaKu si fulan meminta minuman daripada mu tetapi engkau tidak memberinya minuman. Ketahuilah bahawa sekiranya engkau memberinya minuman, nescaya engkau akan mendapati pahala itu di sisiKu."
  },
  {
    "id": 13672,
    "hadith_number": 6395,
    "tajuk_hadith": "Sengsara Rasulullah SAW",
    "perawi_melayu": "Aisyah, melalui beberapa perawi termasuk Uthman bin Abi Syaibah dan Jarir",
    "english_text": "'A'isha reported, I did not see anyone else being afflicted with more severe illness than Allah's Messenger (ﷺ). In the narration transmitted by 'Uthman there is a slight variation of wording.",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ،\n عُثْمَانُ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ مَسْرُوقٍ، قَالَ قَالَتْ عَائِشَةُ مَا رَأَيْتُ\n رَجُلاً أَشَدَّ عَلَيْهِ الْوَجَعُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ وَفِي رِوَايَةِ عُثْمَانَ مَكَانَ\n الْوَجَعِ وَجَعًا ‏.‏",
    "malay_translation": "Aisyah r.a. meriwayatkan, \"Aku tidak pernah melihat sesiapa yang lebih teruk sakitnya daripada Rasulullah SAW.\"  Dalam riwayat Uthman, terdapat sedikit perbezaan lafaz."
  },
  {
    "id": 13673,
    "hadith_number": 6396,
    "tajuk_hadith": "Sanad Hadith daripada al-A'mash",
    "perawi_melayu": "Diriwayatkan melalui beberapa sanad daripada al-A'mash",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، أَخْبَرَنِي أَبِي ح، وَحَدَّثَنَا ابْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ\n حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، ح وَحَدَّثَنِي بِشْرُ بْنُ خَالِدٍ، أَخْبَرَنَا مُحَمَّدٌ، - يَعْنِي ابْنَ جَعْفَرٍ - كُلُّهُمْ\n عَنْ شُعْبَةَ، عَنِ الأَعْمَشِ، ح وَحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، ح وَحَدَّثَنَا ابْنُ،\n نُمَيْرٍ حَدَّثَنَا مُصْعَبُ بْنُ الْمِقْدَامِ، كِلاَهُمَا عَنْ سُفْيَانَ، عَنِ الأَعْمَشِ، بِإِسْنَادِ جَرِيرٍ مِثْلَ حَدِيثِهِ\n ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan melalui beberapa jalan sanad daripada al-A’mash.  (Beberapa perawi yang disebutkan menunjukkan pelbagai sanad yang membawa kepada hadis ini melalui al-A’mash.)"
  },
  {
    "id": 13674,
    "hadith_number": 6397,
    "tajuk_hadith": "Ganjaran Sakit Bagi Seorang Muslim",
    "perawi_melayu": "'Abdullah meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ\n أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنِ الْحَارِثِ بْنِ سُوَيْدٍ،\n عَنْ عَبْدِ اللَّهِ، قَالَ دَخَلْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ يُوعَكُ فَمَسِسْتُهُ بِيَدِي\n فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّكَ لَتُوعَكُ وَعْكًا شَدِيدًا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏\n أَجَلْ إِنِّي أُوعَكُ كَمَا يُوعَكُ رَجُلاَنِ مِنْكُمْ ‏\"‏ ‏.‏ قَالَ فَقُلْتُ ذَلِكَ أَنَّ لَكَ أَجْرَيْنِ فَقَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\"‏ أَجَلْ ‏\"‏ ‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا مِنْ\n مُسْلِمٍ يُصِيبُهُ أَذًى مِنْ مَرَضٍ فَمَا سِوَاهُ إِلاَّ حَطَّ اللَّهُ بِهِ سَيِّئَاتِهِ كَمَا تَحُطُّ الشَّجَرَةُ وَرَقَهَا\n ‏\"‏ ‏.‏ وَلَيْسَ فِي حَدِيثِ زُهَيْرٍ فَمَسِسْتُهُ بِيَدِي ‏.‏",
    "malay_translation": "Kami diberitakan oleh Usman bin Abi Syaibah, Zuhair bin Harb, dan Ishaq bin Ibrahim. Ishaq berkata, “Mereka berdua memberitakan kepada kami.” Jarir meriwayatkan dari al-A’masy, dari Ibrahim al-Taymi, dari al-Harits bin Suwaid, dari Abdullah. Abdullah berkata, “Aku masuk menemui Rasulullah SAW ketika Baginda sedang sakit. Aku menyentuh Baginda dengan tanganku lalu berkata, ‘Wahai Rasulullah, sungguh engkau sedang sakit keras.’ Rasulullah SAW bersabda, ‘Ya, sesungguhnya aku sedang sakit seperti sakitnya dua orang daripada kamu.’ Aku berkata, ‘Adakah itu kerana engkau akan mendapat dua pahala?’ Rasulullah SAW bersabda, ‘Ya.’ Kemudian Rasulullah SAW bersabda, ‘Tidaklah seorang muslim ditimpa penyakit atau sebarang kesusahan melainkan Allah akan menghapuskan dosa-dosanya sebagaimana pohon menggugurkan daun-daunnya.’  Dalam riwayat Zuhair tidak disebut, ‘Aku menyentuh Baginda dengan tanganku.’"
  },
  {
    "id": 13675,
    "hadith_number": 6398,
    "tajuk_hadith": "Ketiadaan Muslim di Bumi",
    "perawi_melayu": "Hadis ini diriwayatkan melalui Jarir dan hadis yang diriwayatkan melalui Abu Mu'awiyah, terdapat tambahan kata-kata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنِي \n مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا سُفْيَانُ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا \n عِيسَى بْنُ يُونُسَ، وَيَحْيَى بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي غَنِيَّةَ، كُلُّهُمْ عَنِ الأَعْمَشِ، بِإِسْنَادِ جَرِيرٍ\n ‏.‏ نَحْوَ حَدِيثِهِ وَزَادَ فِي حَدِيثِ أَبِي مُعَاوِيَةَ قَالَ ‏\n\"‏ نَعَمْ وَالَّذِي نَفْسِي بِيَدِهِ مَا عَلَى الأَرْضِ\n مُسْلِمٌ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Bakar bin Abi Syaibah dan Abu Kuraib, keduanya berkata: Telah menceritakan kepada kami Abu Muawiyah, dan telah menceritakan kepadaku Muhammad bin Rafi', telah menceritakan kepada kami Abdur Razzaq, telah menceritakan kepada kami Sufyan, dan telah menceritakan kepada kami Ishaq bin Ibrahim, telah memberitakan kepada kami Isa bin Yunus dan Yahya bin Abd Malik bin Abi Ghuniyah, semuanya daripada Al-A'masy, dengan sanad Jarir.\nSeiring dengan hadisnya dan tambahan dalam hadis Abu Muawiyah yang menyatakan:  \"Ya, demi Allah yang jiwa ku berada di tangan-Nya, tiada seorang pun muslim di muka bumi.\" "
  },
  {
    "id": 13676,
    "hadith_number": 6399,
    "tajuk_hadith": "Pahala Bagi Muslim yang Tercedera",
    "perawi_melayu": "Aswad meriwayatkan bahawa beberapa pemuda Quraisy telah melawat Aisyah ketika beliau berada di Mina dan mereka sedang ketawa.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، جَمِيعًا عَنْ جَرِيرٍ، قَالَ زُهَيْرٌ حَدَّثَنَا \n جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، قَالَ دَخَلَ شَبَابٌ مِنْ قُرَيْشٍ عَلَى عَائِشَةَ وَهِيَ\n بِمِنًى وَهُمْ يَضْحَكُونَ فَقَالَتْ مَا يُضْحِكُكُمْ قَالُوا فُلاَنٌ خَرَّ عَلَى طُنُبِ فُسْطَاطٍ فَكَادَتْ عُنُقُهُ\n أَوْ عَيْنُهُ أَنْ تَذْهَبَ ‏.‏ فَقَالَتْ لاَ تَضْحَكُوا فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ\n ‏\n\"‏ مَا مِنْ مُسْلِمٍ يُشَاكُ شَوْكَةً فَمَا فَوْقَهَا إِلاَّ كُتِبَتْ لَهُ بِهَا دَرَجَةٌ وَمُحِيَتْ عَنْهُ بِهَا خَطِيئَةٌ\n ‏\"‏ ‏.‏",
    "malay_translation": "Zuhair bin Harb dan Ishak bin Ibrahim meriwayatkan daripada Jarir. Zuhair berkata: Jarir meriwayatkan daripada Mansur, daripada Ibrahim, daripada Aswad. Beliau berkata: Sekumpulan pemuda Quraisy telah melawat Aisyah ketika baginda berada di Mina, sedang mereka ketawa. Maka Aisyah bertanya: “Apakah yang menyebabkan kamu ketawa?” Mereka menjawab: “Si fulan terjatuh di atas tali khemah, hampir-hampir leher atau matanya patah.” Aisyah berkata: “Janganlah kamu ketawa, sesungguhnya aku telah mendengar Rasulullah SAW bersabda: “Tiada seorang Muslim pun yang tercucuk duri atau lebih dari itu melainkan akan ditulis baginya satu darjat dan dihapuskan darinya satu dosa.”"
  },
  {
    "id": 13677,
    "hadith_number": 6400,
    "tajuk_hadith": "Kenaikan Darjat atau Pengampunan Dosa",
    "perawi_melayu": "Aisyah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "A believer does not receive (the trouble) of running a thorn or more than that but Allah elevates him in rank or effaces his sins because of that.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ وَاللَّفْظُ لَهُمَا ح وَحَدَّثَنَا إِسْحَاقُ الْحَنْظَلِيُّ،\n قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ \n الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا يُصِيبُ الْمُؤْمِنَ مِنْ\n شَوْكَةٍ فَمَا فَوْقَهَا إِلاَّ رَفَعَهُ اللَّهُ بِهَا دَرَجَةً أَوْ حَطَّ عَنْهُ بِهَا خَطِيئَةً ‏\"‏ ‏.‏",
    "malay_translation": "Tidak akan menimpa seorang mukmin sesuatu pun, sama ada duri atau yang lebih besar daripadanya melainkan Allah akan meninggikan darjatnya atau menghapuskan dosanya disebabkan perkara itu."
  },
  {
    "id": 13678,
    "hadith_number": 6401,
    "tajuk_hadith": "Penghapusan Dosa Orang Mukmin",
    "perawi_melayu": "Aisyah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "A believer does not undergo (the trouble) of running a thorn or more than that when Allah effaces his sins.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ،\n عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تُصِيبُ الْمُؤْمِنَ شَوْكَةٌ فَمَا\n فَوْقَهَا إِلاَّ قَصَّ اللَّهُ بِهَا مِنْ خَطِيئَتِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Tidak akan menimpa seorang mukmin sesuatu duri atau lebih daripada itu melainkan Allah akan menghapuskan dosa-dosanya dengan sebab itu."
  },
  {
    "id": 13679,
    "hadith_number": 6402,
    "tajuk_hadith": "Sanad Hadith yang Sama daripada Hisyam",
    "perawi_melayu": "Hisham dan periwayat-periwayat sebelum beliau",
    "english_text": "The above hadith has been transmitted by Hisham with the same chain.",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا هِشَامٌ، بِهَذَا الإِسْنَادِ ‏.‏",
    "malay_translation": "Hadis di atas telah diriwayatkan oleh Hisyam dengan sanad yang sama."
  },
  {
    "id": 13680,
    "hadith_number": 6403,
    "tajuk_hadith": "Kesusahan Menghapuskan Dosa",
    "perawi_melayu": "Aisyah meriwayatkan:",
    "english_text": "Allah's Messenger (ﷺ) said: There is no trouble that comes to a believer except that it obliterates from his sins, even if it is the pricking of a thorn",
    "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ، وَيُونُسُ بْنُ يَزِيدَ،\n عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ\n ‏\n\"‏ مَا مِنْ مُصِيبَةٍ يُصَابُ بِهَا الْمُسْلِمُ إِلاَّ كُفِّرَ بِهَا عَنْهُ حَتَّى الشَّوْكَةِ يُشَاكُهَا ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: Tiada satu pun musibah yang menimpa seorang mukmin melainkan ia akan menghapuskan dosanya, walaupun hanya disebabkan duri yang menusuknya."
  },
  {
    "id": 13681,
    "hadith_number": 6404,
    "tajuk_hadith": "Penghapusan Dosa Melalui Musibah",
    "perawi_melayu": "Aisyah berkata:",
    "english_text": "No trouble comes to a believer even if it is the pricking of a thorn that it becomes (the means) whereby his sins are effaced or his sins are obliterated. Yazid says: He does not know which word 'Urwa said (whether he said Qussa or Kuffira).",
    "arabic_text": "حَدَّثَنَا أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ، عَنْ يَزِيدَ بْنِ خُصَيْفَةَ،\n عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى\n الله عليه وسلم قَالَ ‏\n\"‏ لاَ يُصِيبُ الْمُؤْمِنَ مِنْ مُصِيبَةٍ حَتَّى الشَّوْكَةِ إِلاَّ قُصَّ بِهَا مِنْ خَطَايَاهُ\n أَوْ كُفِّرَ بِهَا مِنْ خَطَايَاهُ ‏\"‏ ‏.‏ لاَ يَدْرِي يَزِيدُ أَيَّتُهُمَا قَالَ عُرْوَةُ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Thahir, memberitakan kepada kami Ibnu Wahb, memberitakan kepadaku Malik bin Anas, daripada Yazid bin Khushaifah, daripada Urwah bin Zubair, daripada Aisyah, isteri Nabi SAW bahawa Rasulullah SAW bersabda: \"Tiada sesuatu musibah pun yang menimpa orang beriman, walau sebesar duri yang menusuk, melainkan ia akan menghapuskan sebahagian dosanya atau menghapuskan seluruh dosanya.\" Yazid tidak mengetahui mana satu perkataan yang disebut oleh Urwah, sama ada 'qussa' (dihapuskan sebahagian) atau 'kuffira' (dihapuskan seluruhnya)."
  },
  {
    "id": 13682,
    "hadith_number": 6405,
    "tajuk_hadith": "Ganjaran Pahala untuk Setiap Ujian yang Dihadapi Seorang Mukmin",
    "perawi_melayu": "Aisyah meriwayatkan:",
    "english_text": "I heard Allah's Messenger (ﷺ) as saying: There is nothing (in the form of trouble) that comes to a believer even if it is the pricking of a thorn that there is decreed for him by Allah good or his sins are obliterated.",
    "arabic_text": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنَا حَيْوَةُ، حَدَّثَنَا ابْنُ الْهَادِ،\n عَنْ أَبِي بَكْرِ بْنِ حَزْمٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم\n يَقُولُ ‏\n\"‏ مَا مِنْ شَىْءٍ يُصِيبُ الْمُؤْمِنَ حَتَّى الشَّوْكَةِ تُصِيبُهُ إِلاَّ كَتَبَ اللَّهُ لَهُ بِهَا حَسَنَةً أَوْ حُطَّتْ\n عَنْهُ بِهَا خَطِيئَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda: \"Tiada sesuatu pun yang menimpa seorang mukmin, walau sekecil duri yang menusuknya, melainkan Allah akan mencatatkan baginya pahala kebaikan atau menghapuskan dosa-dosanya dengan sebab itu.\""
  },
  {
    "id": 13683,
    "hadith_number": 6406,
    "tajuk_hadith": "Pengampunan Dosa bagi Orang Mukmin yang Menghadapi Kesusahan",
    "perawi_melayu": "Abu Said dan Abu Hurairah meriwayatkan bahawa mereka mendengar Rasulullah SAW bersabda:",
    "english_text": "Never a believer is stricken with discomfort, hardship or illness, grief or even with mental worry that his sins are not expiated for him.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الْوَلِيدِ بْنِ،\n كَثِيرٍ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ، وَأَبِي، هُرَيْرَةَ أَنَّهُمَا\n سَمِعَا رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَا يُصِيبُ الْمُؤْمِنَ مِنْ وَصَبٍ وَلاَ نَصَبٍ وَلاَ\n سَقَمٍ وَلاَ حَزَنٍ حَتَّى الْهَمِّ يُهَمُّهُ إِلاَّ كُفِّرَ بِهِ مِنْ سَيِّئَاتِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Tiada sesuatu kesusahan, kesakitan, penyakit, kesedihan, malah keresahan sekalipun yang menimpa seorang mukmin melainkan ia akan menghapuskan sebahagian dosanya."
  },
  {
    "id": 13684,
    "hadith_number": 6407,
    "tajuk_hadith": "Balasan Kejahatan dan Kesabaran dalam Menghadapi Musibah",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa apabila ayat ini diturunkan:",
    "english_text": "\"Whoever does evil will be requited for it\", and when this was conveyed to the Muslims they were greatly perturbed. Thereupon Allah's Messenger (ﷺ) said: Be moderate and stand firm in trouble that falls to the lot of a Muslim (as that) is an expiation for him; even stumbling on the path or the pricking of a thorn (are an expiation for him). Muslim said that 'Umar b. Abd al-Rahman Muhaisin was from amongst the people of Mecca.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ كِلاَهُمَا عَنِ ابْنِ عُيَيْنَةَ، - وَاللَّفْظُ\n لِقُتَيْبَةَ - حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ مُحَيْصِنٍ، شَيْخٍ مِنْ قُرَيْشٍ سَمِعَ مُحَمَّدَ بْنَ قَيْسِ بْنِ مَخْرَمَةَ،\n يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ، قَالَ لَمَّا نَزَلَتْ ‏{‏ مَنْ يَعْمَلْ سُوءًا يُجْزَ بِهِ‏}‏ بَلَغَتْ مِنَ الْمُسْلِمِينَ مَبْلَغًا\n شَدِيدًا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَارِبُوا وَسَدِّدُوا فَفِي كُلِّ مَا يُصَابُ بِهِ\n الْمُسْلِمُ كَفَّارَةٌ حَتَّى النَّكْبَةِ يُنْكَبُهَا أَوِ الشَّوْكَةِ يُشَاكُهَا ‏\"‏ ‏.‏ قَالَ مُسْلِمٌ هُوَ عُمَرُ بْنُ عَبْدِ الرَّحْمَنِ\n بْنِ مُحَيْصِنٍ مِنْ أَهْلِ مَكَّةَ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa apabila ayat  \"Barangsiapa yang melakukan kejahatan nescaya dia akan dibalas dengan kejahatan itu.\" diturunkan, ia sampai kepada kaum muslimin dan mereka sangat gelisah. Maka Rasulullah SAW bersabda: “Bersabarlah dan tetap teguhlah dalam menghadapi musibah yang menimpa seorang Muslim, kerana setiap musibah yang menimpa seorang muslim adalah satu kaffarah (penebus dosa) baginya, bahkan terjatuh atau terkena duri pun adalah satu kaffarah baginya.” Muslim berkata bahawa Umar bin Abdul Rahman bin Muhaisin adalah daripada penduduk Mekah."
  },
  {
    "id": 13685,
    "hadith_number": 6408,
    "tajuk_hadith": "Kelebihan Demam Menghapuskan Dosa",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan bahawa Rasulullah SAW telah melawat Umm Sa'ib atau Umm Musayyib dan berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا الْحَجَّاجُ الصَّوَّافُ،\n حَدَّثَنِي أَبُو الزُّبَيْرِ، حَدَّثَنَا جَابِرُ بْنُ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ عَلَى\n أُمِّ السَّائِبِ أَوْ أُمِّ الْمُسَيَّبِ فَقَالَ ‏\"‏ مَا لَكِ يَا أُمَّ السَّائِبِ أَوْ يَا أُمَّ الْمُسَيَّبِ تُزَفْزِفِينَ ‏\"‏ ‏.‏\n قَالَتِ الْحُمَّى لاَ بَارَكَ اللَّهُ فِيهَا ‏.‏ فَقَالَ ‏\"‏ لاَ تَسُبِّي الْحُمَّى فَإِنَّهَا تُذْهِبُ خَطَايَا بَنِي آدَمَ\n كَمَا يُذْهِبُ الْكِيرُ خَبَثَ الْحَدِيدِ ‏\"‏ ‏.‏",
    "malay_translation": "Jabir bin Abdullah meriwayatkan bahawa Rasulullah SAW telah melawat Umm Sa'ib atau Umm Musayyib, lalu bertanya, \"Wahai Umm Sa'ib atau Umm Musayyib, mengapa kamu menggigil?\"  Beliau menjawab, \"Demam, semoga Allah tidak memberkati demam ini.\"  Rasulullah SAW bersabda, \"Janganlah kamu melaknat demam, kerana ia menghilangkan dosa-dosa anak Adam sebagaimana relau menghilangkan kekotoran besi.\""
  },
  {
    "id": 13686,
    "hadith_number": 6409,
    "tajuk_hadith": "Wanita Syurga Berkulit Hitam",
    "perawi_melayu": "Kata ‘Ata’ bin Abi Rabah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، وَبِشْرُ بْنُ الْمُفَضَّلِ،\n قَالاَ حَدَّثَنَا عِمْرَانُ أَبُو بَكْرٍ، حَدَّثَنِي عَطَاءُ بْنُ أَبِي رَبَاحٍ، قَالَ قَالَ لِي ابْنُ عَبَّاسٍ أَلاَ أُرِيكَ\n امْرَأَةً مِنْ أَهْلِ الْجَنَّةِ قُلْتُ بَلَى ‏.‏ قَالَ هَذِهِ الْمَرْأَةُ السَّوْدَاءُ أَتَتِ النَّبِيَّ صلى الله عليه وسلم\n قَالَتْ إِنِّي أُصْرَعُ وَإِنِّي أَتَكَشَّفُ فَادْعُ اللَّهَ لِي ‏.‏ قَالَ ‏\"‏ إِنْ شِئْتِ صَبَرْتِ وَلَكِ الْجَنَّةُ وَإِنْ\n شِئْتِ دَعَوْتُ اللَّهَ أَنْ يُعَافِيَكِ ‏.‏ قَالَتْ أَصْبِرُ ‏.‏ قَالَتْ فَإِنِّي أَتَكَشَّفُ فَادْعُ اللَّهَ أَنْ لاَ أَتَكَشَّفَ\n ‏.‏ فَدَعَا لَهَا ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ubaidullah bin Umar Al-Qawariri, telah menceritakan kepada kami Yahya bin Said dan Bishr bin Al-Mufaḍḍal, keduanya berkata; telah menceritakan kepada kami Imran Abu Bakar, telah menceritakan kepadaku ‘Ata’ bin Abi Rabah, dia berkata: Ibn Abbas berkata kepadaku: “Inginkah aku menunjukkan kepadamu seorang wanita dari penghuni syurga?” Aku berkata: “Ya.” Dia berkata: “Inilah wanita berkulit hitam ini. Dia datang kepada Rasulullah SAW lalu berkata: “Sesungguhnya aku sering terkena penyakit sawan dan aku menjadi bogel. Maka doakanlah aku kepada Allah.” Baginda SAW bersabda: “Jika engkau suka bersabar, maka syurga adalah untukmu. Dan jika engkau suka, aku akan berdoa kepada Allah agar Dia menyembuhkanmu.” Wanita itu berkata: “Aku ingin bersabar.” Dia berkata: “Tetapi aku menjadi bogel ketika terkena sawan. Maka doakanlah aku kepada Allah supaya aku tidak menjadi bogel.” Maka Baginda SAW mendoakannya."
  },
  {
    "id": 13687,
    "hadith_number": 6410,
    "tajuk_hadith": "Pengampunan Allah dan Kekuasaan-Nya",
    "perawi_melayu": "Abu Dzar meriwayatkan bahawa Rasulullah SAW bersabda bahawa Allah SWT berfirman:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ بَهْرَامَ الدَّارِمِيُّ، حَدَّثَنَا مَرْوَانُ، - يَعْنِي ابْنَ\n مُحَمَّدٍ الدِّمَشْقِيَّ - حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ، عَنْ رَبِيعَةَ بْنِ يَزِيدَ، عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ،\n عَنْ أَبِي ذَرٍّ، عَنِ النَّبِيِّ صلى الله عليه وسلم فِيمَا رَوَى عَنِ اللَّهِ، تَبَارَكَ وَتَعَالَى أَنَّهُ قَالَ\n ‏\n\"‏ يَا عِبَادِي إِنِّي حَرَّمْتُ الظُّلْمَ عَلَى نَفْسِي وَجَعَلْتُهُ بَيْنَكُمْ مُحَرَّمًا فَلاَ تَظَالَمُوا يَا عِبَادِي\n كُلُّكُمْ ضَالٌّ إِلاَّ مَنْ هَدَيْتُهُ فَاسْتَهْدُونِي أَهْدِكُمْ يَا عِبَادِي كُلُّكُمْ جَائِعٌ إِلاَّ مَنْ أَطْعَمْتُهُ فَاسْتَطْعِمُونِي\n أُطْعِمْكُمْ يَا عِبَادِي كُلُّكُمْ عَارٍ إِلاَّ مَنْ كَسَوْتُهُ فَاسْتَكْسُونِي أَكْسُكُمْ يَا عِبَادِي إِنَّكُمْ تُخْطِئُونَ\n بِاللَّيْلِ وَالنَّهَارِ وَأَنَا أَغْفِرُ الذُّنُوبَ جَمِيعًا فَاسْتَغْفِرُونِي أَغْفِرْ لَكُمْ يَا عِبَادِي إِنَّكُمْ لَنْ تَبْلُغُوا\n ضَرِّي فَتَضُرُّونِي وَلَنْ تَبْلُغُوا نَفْعِي فَتَنْفَعُونِي يَا عِبَادِي لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ\n كَانُوا عَلَى أَتْقَى قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ مَا زَادَ ذَلِكَ فِي مُلْكِي شَيْئًا يَا عِبَادِي لَوْ أَنَّ أَوَّلَكُمْ\n وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوا عَلَى أَفْجَرِ قَلْبِ رَجُلٍ وَاحِدٍ مَا نَقَصَ ذَلِكَ مِنْ مُلْكِي شَيْئًا\n يَا عِبَادِي لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ قَامُوا فِي صَعِيدٍ وَاحِدٍ فَسَأَلُونِي فَأَعْطَيْتُ\n كُلَّ إِنْسَانٍ مَسْأَلَتَهُ مَا نَقَصَ ذَلِكَ مِمَّا عِنْدِي إِلاَّ كَمَا يَنْقُصُ الْمِخْيَطُ إِذَا أُدْخِلَ الْبَحْرَ يَا عِبَادِي\n إِنَّمَا هِيَ أَعْمَالُكُمْ أُحْصِيهَا لَكُمْ ثُمَّ أُوَفِّيكُمْ إِيَّاهَا فَمَنْ وَجَدَ خَيْرًا فَلْيَحْمَدِ اللَّهَ وَمَنْ وَجَدَ\n غَيْرَ ذَلِكَ فَلاَ يَلُومَنَّ إِلاَّ نَفْسَهُ ‏\"‏ ‏.‏ قَالَ سَعِيدٌ كَانَ أَبُو إِدْرِيسَ الْخَوْلاَنِيُّ إِذَا حَدَّثَ بِهَذَا\n الْحَدِيثِ جَثَا عَلَى رُكْبَتَيْهِ ‏.‏",
    "malay_translation": "Wahai hamba-hambaKu, sesungguhnya Aku telah mengharamkan kezaliman ke atas diriKu sendiri dan Aku jadikannya haram di kalangan kamu, maka janganlah kamu berzalim sesama kamu. Wahai hamba-hambaKu, kamu semua sesat kecuali orang yang Aku beri petunjuk, maka mintalah petunjuk daripadaKu, nescaya Aku akan memberi petunjuk kepada kamu. Wahai hamba-hambaKu, kamu semua lapar kecuali orang yang Aku beri makan, maka mintalah makanan daripadaKu, nescaya Aku akan memberi makan kepada kamu. Wahai hamba-hambaKu, kamu semua telanjang kecuali orang yang Aku beri pakaian, maka mintalah pakaian daripadaKu, nescaya Aku akan memberi pakaian kepada kamu. Wahai hamba-hambaKu, sesungguhnya kamu melakukan kesalahan pada waktu malam dan siang, dan Aku mengampuni semua dosa, maka mintalah ampun daripadaKu, nescaya Aku akan mengampuni kamu. Wahai hamba-hambaKu, kamu tidak akan sampai kepada kemudaratanKu sehingga kamu akan memudaratkanKu, dan kamu tidak akan sampai kepada manfaatKu sehingga kamu akan memberi manfaat kepadaKu. Wahai hamba-hambaKu, sekiranya orang pertama kamu dan yang terakhir, manusia kamu dan jin kamu, berada di atas ketakwaan hati seseorang lelaki yang paling taqwa di kalangan kamu, nescaya hal itu tidak akan menambah kekuasaanKu sedikit pun. Wahai hamba-hambaKu, sekiranya orang pertama kamu dan yang terakhir, manusia kamu dan jin kamu, berada di atas kejahatan hati seseorang lelaki yang paling fasik di kalangan kamu, nescaya hal itu tidak akan mengurangkan kekuasaanKu sedikit pun. Wahai hamba-hambaKu, sekiranya orang pertama kamu dan yang terakhir, manusia kamu dan jin kamu, berdiri di satu tempat dan memohon kepadaKu, dan sekiranya Aku memberi setiap orang apa yang dimintanya, nescaya hal itu tidak akan mengurangkan apa yang ada padaKu, melainkan seperti jarum yang dimasukkan ke dalam laut. Wahai hamba-hambaKu, sesungguhnya amalan kamu sahaja yang Aku catat untuk kamu kemudian Aku membalasnya kepada kamu. Maka sesiapa yang mendapat kebaikan, hendaklah dia bersyukur kepada Allah, dan sesiapa yang mendapat sebaliknya, maka janganlah dia menyalahkan kecuali dirinya sendiri.\" Said berkata bahawa Abu Idris al-Khaulanî apabila meriwayatkan hadis ini, dia akan sujud."
  },
  {
    "id": 13688,
    "hadith_number": 6411,
    "tajuk_hadith": "Perbezaan Hadis Riwayat Abu Mushir dan Marwan",
    "perawi_melayu": "Abu Bakr bin Ishaq melalui Abu Mushir daripada Said bin Abdul Aziz.",
    "english_text": "The hadith is narrated through Abu Mushir from Sa'id bin 'Abdil'Aziz except that the previous hadith through Marwan was the more complete of the two.",
    "arabic_text": "حَدَّثَنِيهِ أَبُو بَكْرِ بْنُ إِسْحَاقَ، حَدَّثَنَا أَبُو مُسْهِرٍ، حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ، بِهَذَا\n الإِسْنَادِ غَيْرَ أَنَّ مَرْوَانَ أَتَمُّهُمَا حَدِيثًا ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan oleh Abu Bakr bin Ishaq melalui Abu Mushir daripada Said bin Abdul Aziz.  Namun, hadis yang diriwayatkan melalui Marwan adalah lebih lengkap."
  },
  {
    "id": 13689,
    "hadith_number": 6412,
    "tajuk_hadith": "Sanad Hadith melalui Beberapa Perawi",
    "perawi_melayu": "Abu Ishaq, Hasan dan Husein Ibnu Bashr, Muhammad bin Yahya, dan Abu Mushir",
    "english_text": "This hadith is also transmitted through Ibna Bashr and Muhammad bin Muhammad through Abu Mashur through the same chain, narrated to its (full) extent",
    "arabic_text": "قَالَ أَبُو إِسْحَاقَ حَدَّثَنَا بِهَذَا الْحَدِيثِ الْحَسَنُ، وَالْحُسَيْنُ، ابْنَا بِشْرٍ وَمُحَمَّدُ بْنُ يَحْيَى\n قَالُوا حَدَّثَنَا أَبُو مُسْهِرٍ، ‏.‏ فَذَكَرُوا الْحَدِيثَ بِطُولِهِ ‏.‏",
    "malay_translation": "Abu Ishaq berkata, “Hasan dan Husein Ibnu Bashr, serta Muhammad bin Yahya telah meriwayatkan hadis ini daripada kami. Mereka berkata, “Kami telah meriwayatkan hadis ini daripada Abu Mushir,” kemudian mereka menyebut hadis tersebut secara lengkap.”"
  },
  {
    "id": 13690,
    "hadith_number": 6413,
    "tajuk_hadith": "Kezaliman Diharamkan",
    "perawi_melayu": "Abu Dzar meriwayatkan bahawa Rasulullah SAW bersabda bahawa baginda meriwayatkannya daripada Tuhannya, Yang Maha Tinggi dan Maha Mulia:",
    "english_text": "Verily I have made oppression unlawful for Me and for My servants too, so do not commit oppression. The rest of the hadith is the same.",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، كِلاَهُمَا عَنْ عَبْدِ الصَّمَدِ بْنِ عَبْدِ،\n الْوَارِثِ حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي أَسْمَاءَ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم فِيمَا يَرْوِي عَنْ رَبِّهِ تَبَارَكَ وَتَعَالَى ‏\n\"‏ إِنِّي حَرَّمْتُ عَلَى\n نَفْسِي الظُّلْمَ وَعَلَى عِبَادِي فَلاَ تَظَالَمُوا ‏\"‏ ‏.‏ وَسَاقَ الْحَدِيثَ بِنَحْوِهِ وَحَدِيثُ أَبِي إِدْرِيسَ\n الَّذِي ذَكَرْنَاهُ أَتَمُّ مِنْ هَذَا ‏.‏",
    "malay_translation": "Sesungguhnya Aku telah mengharamkan kezaliman ke atas diriKu dan ke atas hamba-hambaKu, maka janganlah kamu berzalim."
  },
  {
    "id": 13691,
    "hadith_number": 6414,
    "tajuk_hadith": "Menjauhi Kezaliman dan Kedekut",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Be on your guard against committing oppression, for oppression is a darkness on the Day of Resurrection, and be on your guard against stinginess for stinginess destroyed those who were before you, as it incited them to shed blood and make lawful what was unlawful for them.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا دَاوُدُ، - يَعْنِي ابْنَ قَيْسٍ - عَنْ عُبَيْدِ،\n اللَّهِ بْنِ مِقْسَمٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ اتَّقُوا الظُّلْمَ\n فَإِنَّ الظُّلْمَ ظُلُمَاتٌ يَوْمَ الْقِيَامَةِ وَاتَّقُوا الشُّحَّ فَإِنَّ الشُّحَّ أَهْلَكَ مَنْ كَانَ قَبْلَكُمْ حَمَلَهُمْ عَلَى\n أَنْ سَفَكُوا دِمَاءَهُمْ وَاسْتَحَلُّوا مَحَارِمَهُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Jauhilah kezaliman, kerana kezaliman adalah kegelapan pada hari kiamat. Dan jauhilah kedekut, kerana kedekut telah membinasakan orang-orang sebelum kamu. Ia telah mendorong mereka untuk menumpahkan darah dan menghalalkan perkara-perkara yang diharamkan ke atas mereka."
  },
  {
    "id": 13692,
    "hadith_number": 6415,
    "tajuk_hadith": "Kezaliman sebagai Kegelapan di Hari Kiamat",
    "perawi_melayu": "Ibnu Umar meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Oppression is the darkness on the Day of Resurrection.",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ الْمَاجِشُونُ، عَنْ عَبْدِ اللَّهِ،\n بْنِ دِينَارٍ عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ الظُّلْمَ ظُلُمَاتٌ يَوْمَ\n الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Sesungguhnya kezaliman adalah kegelapan pada hari kiamat."
  },
  {
    "id": 13693,
    "hadith_number": 6416,
    "tajuk_hadith": "Persaudaraan Islam dan Pertolongan",
    "perawi_melayu": "Salim meriwayatkan daripada bapanya bahawa Rasulullah SAW bersabda:",
    "english_text": "A Muslim is the brother of a fellow-Muslim. He should neither commit oppression upon him nor ruin him, and he who meets the need of a brother, Allah would meet big needs, and he who relieved a Muslim from hardship Allah would relieve him from the hardships to which he would be put on the Day of Resurrection, and he who did not expose (the follies of a Muslim) Allah would conceal his follies on the Day of Resurrection.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ عُقَيْلٍ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ،\n أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْمُسْلِمُ أَخُو الْمُسْلِمِ لاَ يَظْلِمُهُ وَلاَ يُسْلِمُهُ مَنْ\n كَانَ فِي حَاجَةِ أَخِيهِ كَانَ اللَّهُ فِي حَاجَتِهِ وَمَنْ فَرَّجَ عَنْ مُسْلِمٍ كُرْبَةً فَرَّجَ اللَّهُ عَنْهُ بِهَا\n كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ وَمَنْ سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang Muslim adalah saudara kepada seorang Muslim yang lain.  Dia tidak seharusnya menganiaya atau membiarkan saudaranya dalam kesusahan. Sesiapa yang menolong saudaranya yang memerlukan, Allah akan menolongnya dalam keperluannya. Dan sesiapa yang meringankan kesusahan seorang Muslim, Allah akan meringankan kesusahannya pada hari kiamat. Dan sesiapa yang merahsiakan kesalahan seorang Muslim, Allah akan merahsiakan kesalahannya pada hari kiamat."
  },
  {
    "id": 13694,
    "hadith_number": 6417,
    "tajuk_hadith": "Kemiskinan di Hari Kiamat",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ، قَالاَ حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ جَعْفَرٍ\n - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ أَتَدْرُونَ\n مَا الْمُفْلِسُ ‏\"‏ ‏.‏ قَالُوا الْمُفْلِسُ فِينَا مَنْ لاَ دِرْهَمَ لَهُ وَلاَ مَتَاعَ ‏.‏ فَقَالَ ‏\"‏ إِنَّ الْمُفْلِسَ مِنْ أُمَّتِي\n يَأْتِي يَوْمَ الْقِيَامَةِ بِصَلاَةٍ وَصِيَامٍ وَزَكَاةٍ وَيَأْتِي قَدْ شَتَمَ هَذَا وَقَذَفَ هَذَا وَأَكَلَ مَالَ هَذَا وَسَفَكَ\n دَمَ هَذَا وَضَرَبَ هَذَا فَيُعْطَى هَذَا مِنْ حَسَنَاتِهِ وَهَذَا مِنْ حَسَنَاتِهِ فَإِنْ فَنِيَتْ حَسَنَاتُهُ قَبْلَ\n أَنْ يُقْضَى مَا عَلَيْهِ أُخِذَ مِنْ خَطَايَاهُمْ فَطُرِحَتْ عَلَيْهِ ثُمَّ طُرِحَ فِي النَّارِ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah bin Sa’id dan Ali bin Hujr, keduanya berkata; Telah menceritakan kepada kami Ismail - beliau adalah Ibnu Ja’far - dari Al-Ala’, dari bapanya, dari Abu Hurairah, bahawa Rasulullah SAW bersabda: “Tahukah kamu siapakah orang yang muflis (pakarut) itu?” Mereka berkata: “Orang yang muflis di kalangan kami ialah orang yang tidak mempunyai dirham dan harta benda.” Baginda bersabda: “Sesungguhnya orang yang muflis daripada umatku ialah orang yang datang pada hari kiamat dengan membawa solat, puasa dan zakat, tetapi dia datang dalam keadaan telah mencaci maki orang ini, menuduh orang ini, memakan harta orang ini, menumpahkan darah orang ini dan memukul orang ini. Maka orang-orang yang dizalimi itu akan diberi daripada kebaikannya (pahala amalnya). Jika kebaikannya telah habis sebelum selesai tuntutan orang-orang yang dizalimi itu, maka dosa-dosa mereka akan dibebankan kepadanya, kemudian dia akan dilemparkan ke dalam neraka.”"
  },
  {
    "id": 13695,
    "hadith_number": 6418,
    "tajuk_hadith": "Hak-Hak Akan Dikembalikan pada Hari Kiamat",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "“Rights will certainly be restored to those entitled to them on the Day of Resurrection, (to the point that) even the hornless sheep will lay claim upon the horned one.”",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنُونَ ابْنَ\n جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ\n ‏\n\"‏ لَتُؤَدُّنَّ الْحُقُوقَ إِلَى أَهْلِهَا يَوْمَ الْقِيَامَةِ حَتَّى يُقَادَ لِلشَّاةِ الْجَلْحَاءِ مِنَ الشَّاةِ الْقَرْنَاءِ ‏\"‏\n ‏.‏",
    "malay_translation": "Sesungguhnya hak-hak akan dikembalikan kepada yang berhak menerimanya pada hari kiamat, sehingga kambing betina yang tidak bertanduk pun akan menuntut daripada kambing betina yang bertanduk."
  },
  {
    "id": 13696,
    "hadith_number": 6419,
    "tajuk_hadith": "Allah Memberi Tempoh kepada Orang Zalim",
    "perawi_melayu": "Abu Musa meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Allah, the Exalted and Glorious, grants respite to the oppressor. But when He lays Hand upon him, He does not then let him off. Re (the Holy Prophet) then recited this verse:\" Such is the chastisement of thy Lord when He chastises the towns (inhabited by) wrongdoing persons. Surely, His punishment is painful, severe\" (xi. 103).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا بُرَيْدُ بْنُ أَبِي بُرْدَةَ،\n عَنْ أَبِيهِ، عَنْ أَبِي مُوسَى، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ\n يُمْلِي لِلظَّالِمِ فَإِذَا أَخَذَهُ لَمْ يُفْلِتْهُ ‏\"‏ ‏.‏ ثُمَّ قَرَأَ ‏{‏ وَكَذَلِكَ أَخْذُ رَبِّكَ إِذَا أَخَذَ الْقُرَى وَهِيَ ظَالِمَةٌ\n إِنَّ أَخْذَهُ أَلِيمٌ شَدِيدٌ‏}‏",
    "malay_translation": "Abu Musa meriwayatkan bahawa Rasulullah SAW bersabda: \"Sesungguhnya Allah SWT memberi tempoh kepada orang yang zalim.  Kemudian apabila Dia mengazabnya, Dia tidak akan melepaskannya.\"  Kemudian Baginda membaca ayat:  \"Dan demikianlah azab Tuhanmu apabila Dia mengazab negeri-negeri sedang mereka dalam keadaan zalim. Sesungguhnya azab-Nya adalah amat pedih lagi keras.\" (Hud: 103)"
  },
  {
    "id": 13697,
    "hadith_number": 6420,
    "tajuk_hadith": "Menolong Saudara Seagama: Sama Ada Penzalim atau yang Dizalimi",
    "perawi_melayu": "Jabir bin Abdullah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ،\n قَالَ اقْتَتَلَ غُلاَمَانِ غُلاَمٌ مِنَ الْمُهَاجِرِينَ وَغُلاَمٌ مِنَ الأَنْصَارِ فَنَادَى الْمُهَاجِرُ أَوِ الْمُهَاجِرُونَ\n يَا لَلْمُهَاجِرِينَ ‏.‏ وَنَادَى الأَنْصَارِيُّ يَا لَلأَنْصَارِ ‏.‏ فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n فَقَالَ ‏\"‏ مَا هَذَا دَعْوَى أَهْلِ الْجَاهِلِيَّةِ ‏\"‏ ‏.‏ قَالُوا لاَ يَا رَسُولَ اللَّهِ إِلاَّ أَنَّ غُلاَمَيْنِ اقْتَتَلاَ\n فَكَسَعَ أَحَدُهُمَا الآخَرَ قَالَ ‏\"‏ فَلاَ بَأْسَ وَلْيَنْصُرِ الرَّجُلُ أَخَاهُ ظَالِمًا أَوْ مَظْلُومًا إِنْ كَانَ\n ظَالِمًا فَلْيَنْهَهُ فَإِنَّهُ لَهُ نَصْرٌ وَإِنْ كَانَ مَظْلُومًا فَلْيَنْصُرْهُ ‏\"‏ ‏.‏",
    "malay_translation": "Jabir bin Abdullah meriwayatkan bahawa dua orang pemuda, seorang daripada kalangan Muhajirin dan seorang lagi daripada kalangan Ansar telah bertengkar. Pemuda Muhajirin memanggil rakan-rakan Muhajirinnya, dan pemuda Ansar memanggil kaum Ansar.  Maka Rasulullah SAW keluar lalu bersabda: “Apakah ini? Adakah ini seruan zaman jahiliyyah?” Mereka menjawab, “Tidak, wahai Rasulullah, hanyalah dua orang pemuda yang bertengkar, lalu seorang menumbuk yang lain.” Baginda bersabda: “Tidak mengapa.  Hendaklah seseorang itu menolong saudaranya sama ada dia penzalim atau yang dizalimi. Jika dia penzalim, hendaklah dia mencegahnya, kerana itulah pertolongannya. Dan jika dia yang dizalimi, hendaklah dia ditolong.”"
  },
  {
    "id": 13698,
    "hadith_number": 6421,
    "tajuk_hadith": "Larangan Membangkitkan Perselisihan Zaman Jahiliah",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَأَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ، وَابْنُ أَبِي،\n عُمَرَ - وَاللَّفْظُ لاِبْنِ أَبِي شَيْبَةَ - قَالَ ابْنُ عَبْدَةَ أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا سُفْيَانُ بْنُ،\n عُيَيْنَةَ قَالَ سَمِعَ عَمْرٌو، جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي\n غَزَاةٍ فَكَسَعَ رَجُلٌ مِنَ الْمُهَاجِرِينَ رَجُلاً مِنَ الأَنْصَارِ فَقَالَ الأَنْصَارِيُّ يَا لَلأَنْصَارِ وَقَالَ\n الْمُهَاجِرِيُّ يَا لَلْمُهَاجِرِينَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا بَالُ دَعْوَى الْجَاهِلِيَّةِ\n ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ كَسَعَ رَجُلٌ مِنَ الْمُهَاجِرِينَ رَجُلاً مِنَ الأَنْصَارِ ‏.‏ فَقَالَ ‏\"‏ دَعُوهَا\n فَإِنَّهَا مُنْتِنَةٌ ‏\"‏ ‏.‏ فَسَمِعَهَا عَبْدُ اللَّهِ بْنُ أُبَىٍّ فَقَالَ قَدْ فَعَلُوهَا وَاللَّهِ لَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ\n لَيُخْرِجَنَّ الأَعَزُّ مِنْهَا الأَذَلَّ ‏.‏ قَالَ عُمَرُ دَعْنِي أَضْرِبْ عُنُقَ هَذَا الْمُنَافِقِ فَقَالَ ‏\"‏ دَعْهُ لاَ\n يَتَحَدَّثُ النَّاسُ أَنَّ مُحَمَّدًا يَقْتُلُ أَصْحَابَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Kami bersama Rasulullah SAW dalam satu ekspedisi, seorang lelaki dari kalangan Muhajirin memukul seorang lelaki dari kalangan Ansar dari belakang. Lelaki Ansar itu berkata, \"Wahai kaum Ansar!\" dan lelaki Muhajirin itu berkata, \"Wahai kaum Muhajirin!\" Maka Rasulullah SAW bersabda, \"Apakah ini seruan zaman jahiliyyah?\" Mereka menjawab, \"Wahai Rasulullah, seorang lelaki dari kalangan Muhajirin telah memukul seorang lelaki dari kalangan Ansar.\" Baginda bersabda, \"Tinggalkanlah ia, kerana ia menjijikkan.\" Abdullah bin Ubayy mendengarnya lalu berkata, \"Mereka telah melakukannya. Demi Allah, sekiranya kami pulang ke Madinah, nescaya orang-orang yang berkuasa akan menghalau orang-orang yang lemah.\" Umar berkata, \"Benarkan aku untuk memenggal leher orang munafik ini!\" Baginda bersabda, \"Biarkanlah dia, jangan sampai orang berkata Muhammad membunuh sahabat-sahabatnya.\""
  },
  {
    "id": 13699,
    "hadith_number": 6422,
    "tajuk_hadith": "Larangan Membalas Kecederaan dengan Kecederaan",
    "perawi_melayu": "Jabir bin Abdullah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَإِسْحَاقُ بْنُ مَنْصُورٍ، وَمُحَمَّدُ بْنُ رَافِعٍ، قَالَ ابْنُ رَافِعٍ\n حَدَّثَنَا وَقَالَ الآخَرَانِ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، عَنْ عَمْرِو بْنِ دِينَارٍ،\n عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كَسَعَ رَجُلٌ مِنَ الْمُهَاجِرِينَ رَجُلاً مِنَ الأَنْصَارِ فَأَتَى النَّبِيَّ صلى\n الله عليه وسلم فَسَأَلَهُ الْقَوَدَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ دَعُوهَا فَإِنَّهَا مُنْتِنَةٌ ‏\"‏\n ‏.‏ قَالَ ابْنُ مَنْصُورٍ فِي رِوَايَتِهِ عَمْرٌو قَالَ سَمِعْتُ جَابِرًا ‏.‏",
    "malay_translation": "Ishaq bin Ibrahim, Ishaq bin Mansur, dan Muhammad bin Rafi' meriwayatkan. Ibn Rafi' berkata: Kami telah mendengar daripada mereka berdua, Abdurrazzaq telah memberitahu kami, Ma'mar telah memberitahu kami daripada Ayyub, daripada Amru bin Dinar, daripada Jabir bin Abdullah bahawa seorang lelaki daripada kalangan Muhajirin memukul seorang lelaki daripada kalangan Ansar.  Maka lelaki Ansar itu datang kepada Nabi SAW dan meminta qisas (balasan).  Lalu Nabi SAW bersabda:\n\n\"Tinggalkan sahaja, kerana ia adalah sesuatu yang menjijikkan.\"\n\nIbn Mansur berkata dalam riwayat Amru: Aku telah mendengar daripada Jabir."
  },
  {
    "id": 13700,
    "hadith_number": 6423,
    "tajuk_hadith": "Umat Islam Seperti Binaan yang Saling Menguatkan",
    "perawi_melayu": "Abu Musa meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "A believer is like a brick for another believer, the one supporting the other.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو عَامِرٍ الأَشْعَرِيُّ قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ،\n وَأَبُو أُسَامَةَ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، وَابْنُ، إِدْرِيسَ وَأَبُو\n أُسَامَةَ كُلُّهُمْ عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم ‏\n\"‏ الْمُؤْمِنُ لِلْمُؤْمِنِ كَالْبُنْيَانِ يَشُدُّ بَعْضُهُ بَعْضًا ‏\"‏ ‏.‏",
    "malay_translation": "Orang beriman dengan orang beriman yang lain adalah seperti satu bangunan, di mana bahagian-bahagiannya saling menguatkan antara satu sama lain."
  },
  {
    "id": 13701,
    "hadith_number": 6424,
    "tajuk_hadith": "Persaudaraan Umat Islam Seperti Satu Tubuh",
    "perawi_melayu": "Nu'man bin Basir meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The similitude of believers in regard to mutual love, affection, fellow-feeling is that of one body; when any limb of it aches, the whole body aches, because of sleeplessness and fever.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا زَكَرِيَّاءُ، عَنِ الشَّعْبِيِّ، عَنِ \n النُّعْمَانِ بْنِ بَشِيرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَثَلُ الْمُؤْمِنِينَ فِي تَوَادِّهِمْ\n وَتَرَاحُمِهِمْ وَتَعَاطُفِهِمْ مَثَلُ الْجَسَدِ إِذَا اشْتَكَى مِنْهُ عُضْوٌ تَدَاعَى لَهُ سَائِرُ الْجَسَدِ بِالسَّهَرِ\n وَالْحُمَّى ‏\"‏ ‏.‏",
    "malay_translation": "Perumpamaan orang-orang beriman dalam hal saling mengasihi, menyayangi dan bersimpati adalah seperti satu tubuh; apabila satu anggota tubuh itu sakit, seluruh tubuh akan merasa sakit disebabkan kurang tidur dan demam."
  },
  {
    "id": 13702,
    "hadith_number": 6425,
    "tajuk_hadith": "Hadis daripada Rasulullah SAW tentang Nu'man bin Bashir",
    "perawi_melayu": "Ishaq al-Hanthali, Jarir, Mu'tarrif, As-Sya'bi, Nu'man bin Bashir",
    "english_text": "Nu'man b. Bashir reported a hadith like this from Allah's Apostle (ﷺ).",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ الْحَنْظَلِيُّ، أَخْبَرَنَا جَرِيرٌ، عَنْ مُطَرِّفٍ، عَنِ الشَّعْبِيِّ، عَنِ النُّعْمَانِ بْنِ،\n بَشِيرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم بِنَحْوِهِ ‏.‏",
    "malay_translation": "Ishaq al-Hanthali meriwayatkan daripada Jarir, daripada Mu'tarrif, daripada As-Sya'bi, daripada Nu'man bin Bashir, daripada Nabi SAW, lebih kurang seperti ini."
  },
  {
    "id": 13703,
    "hadith_number": 6426,
    "tajuk_hadith": "Umat Islam Seperti Satu Tubuh",
    "perawi_melayu": "Nu'man bin Bashir meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The believers are like one person; if his head aches, the whole body aches with fever and sleeplessness.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو سَعِيدٍ الأَشَجُّ قَالاَ حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ،\n عَنِ الشَّعْبِيِّ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْمُؤْمِنُونَ\n كَرَجُلٍ وَاحِدٍ إِنِ اشْتَكَى رَأْسُهُ تَدَاعَى لَهُ سَائِرُ الْجَسَدِ بِالْحُمَّى وَالسَّهَرِ ‏\"‏ ‏.‏",
    "malay_translation": "Orang-orang beriman itu seperti satu tubuh; jika kepalanya sakit, seluruh tubuhnya akan turut merasa sakit dengan demam dan susah tidur."
  },
  {
    "id": 13704,
    "hadith_number": 6427,
    "tajuk_haditi": "Umat Islam Seperti Satu Tubuh",
    "perawi_melayu": "Nu'man bin Bashir",
    "english_text": "Nu'man b. Bashir reported that Muslims are like one body of a person; if the eye is sore, the whole body aches, and if the head aches, the whole body aches.",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، عَنِ الأَعْمَشِ،\n عَنْ خَيْثَمَةَ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْمُسْلِمُونَ\n كَرَجُلٍ وَاحِدٍ إِنِ اشْتَكَى عَيْنُهُ اشْتَكَى كُلُّهُ وَإِنِ اشْتَكَى رَأْسُهُ اشْتَكَى كُلُّهُ ‏\"‏ ‏.‏",
    "malay_translation": "Nu'man bin Bashir meriwayatkan bahawa umat Islam adalah seperti satu tubuh. Jika mata sakit, seluruh tubuh akan merasa sakit. Dan jika kepala sakit, seluruh tubuh akan merasa sakit."
  },
  {
    "id": 13705,
    "hadith_number": 6428,
    "tajuk_hadith": "Riwayat Lain Mengenai Hadis Nu'man bin Bashir",
    "perawi_melayu": "Ibn Numair, Humaid bin Abdur Rahman, Al-A'mash, Asy-Sya'bi, Nu'man bin Bashir",
    "english_text": "A hadith like this has been narrated on the authority of Nu'man b. Bashir through another chain of transmitters.",
    "arabic_text": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، عَنِ الأَعْمَشِ، عَنِ الشَّعْبِيِّ، عَنِ النُّعْمَانِ،\n بْنِ بَشِيرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏",
    "malay_translation": "Hadis yang seumpamanya telah diriwayatkan daripada Nu'man bin Bashir melalui sanad (rantai periwayat) yang lain.  (daripada Ibn Numair, Humaid bin Abdur Rahman, Al-A'mash, Asy-Sya'bi, dan Nu'man bin Bashir)"
  },
  {
    "id": 13706,
    "hadith_number": 6429,
    "tajuk_hadith": "Orang yang memulakan pertengkaran adalah yang berdosa",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "When two persons indulge in hurling (abuses) upon one another, it would be the first one who would be the sinner so long as the oppressed does not transgress the limits.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنُونَ ابْنَ\n جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ\n ‏\n\"‏ الْمُسْتَبَّانِ مَا قَالاَ فَعَلَى الْبَادِئِ مَا لَمْ يَعْتَدِ الْمَظْلُومُ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila dua orang saling bertengkar dan menghina antara satu sama lain, maka orang yang memulakan adalah yang berdosa, selagi mana orang yang dizalimi tidak melampaui batas."
  },
  {
    "id": 13707,
    "hadith_number": 6430,
    "tajuk_hadith": "Keutamaan Sedekah, Pengampunan, dan Kerendahan Hati",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Charity does not decrease wealth, no one forgives another except that Allah increases his honor, and no one humbles himself for the sake of Allah except that Allah raises his status.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ\n جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ\n ‏\n\"‏ مَا نَقَصَتْ صَدَقَةٌ مِنْ مَالٍ وَمَا زَادَ اللَّهُ عَبْدًا بِعَفْوٍ إِلاَّ عِزًّا وَمَا تَوَاضَعَ أَحَدٌ لِلَّهِ إِلاَّ رَفَعَهُ\n اللَّهُ ‏\"‏ ‏.‏",
    "malay_translation": "Sedekah tidak akan mengurangi harta. Allah SWT akan meninggikan darjat hambaNya yang memaafkan kesalahan orang lain. Dan sesiapa yang merendahkan dirinya kerana Allah SWT, nescaya Allah SWT akan meninggikan darjatnya."
  },
  {
    "id": 13708,
    "hadith_number": 6431,
    "tajuk_hadith": "Ghibah (Mengumpat)",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Do you know what is backbiting? They (the Companions) said: Allah and His Messenger know best. Thereupon he (the Holy Prophet) said: Backbiting implies your talking about your brother in a manner which he does not like. It was said to him: What is your opinion about this that if I actually find (that failing) in my brother which I made a mention of? He said: If (that failing) is actually found (in him) what you assert, you in fact backbited him, and if that is not in him it is a slander.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، عَنِ الْعَلاَءِ، عَنْ \n أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ أَتَدْرُونَ مَا الْغِيبَةُ ‏\"‏ ‏.‏\n قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏\"‏ ذِكْرُكَ أَخَاكَ بِمَا يَكْرَهُ ‏\"‏ ‏.‏ قِيلَ أَفَرَأَيْتَ إِنْ كَانَ فِي\n أَخِي مَا أَقُولُ قَالَ ‏\"‏ إِنْ كَانَ فِيهِ مَا تَقُولُ فَقَدِ اغْتَبْتَهُ وَإِنْ لَمْ يَكُنْ فِيهِ فَقَدْ بَهَتَّهُ ‏\"‏ ‏.‏",
    "malay_translation": "Adakah kamu tahu apakah ghibah (mengumpat)? Mereka (para sahabat) berkata: Allah dan Rasul-Nya lebih mengetahui.  Lalu baginda (Nabi Muhammad SAW) bersabda: Ghibah ialah kamu menyebut-nyebut saudaramu dengan perkara yang dia tidak suka.  Lalu dikatakan kepada baginda: Bagaimana pendapat baginda jika aku benar-benar mendapati kesalahan pada saudaraku yang kusebutkan itu? Baginda bersabda: Jika kesalahan itu benar-benar ada padanya seperti yang kau katakan, maka sesungguhnya kamu telah mengumpatnya, dan jika kesalahan itu tidak ada padanya, maka sesungguhnya kamu telah memfitnahnya."
  },
  {
    "id": 13709,
    "hadith_number": 6432,
    "tajuk_hadith": "Rahsia Allah di Dunia dan Akhirat",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The servant (whose fault) Allah conceals in this world, Allah would also conceal (his faults) on the Day of Resurrection.",
    "arabic_text": "حَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامٍ الْعَيْشِيُّ، حَدَّثَنَا يَزِيدُ، - يَعْنِي ابْنَ زُرَيْعٍ - حَدَّثَنَا رَوْحٌ،\n عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَسْتُرُ اللَّهُ\n عَلَى عَبْدٍ فِي الدُّنْيَا إِلاَّ سَتَرَهُ اللَّهُ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:  \"Sesungguhnya Allah SWT akan menutup aurat hambaNya di dunia, nescaya Allah SWT akan menutup aurat hambaNya itu pada hari kiamat.\""
  },
  {
    "id": 13710,
    "hadith_number": 6433,
    "tajuk_hadith": "Allah Menyembunyikan Kesalahan Hamba-Nya",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The servant (who conceals) the faults of others in this world, Allah would conceal his faults on the Day of Resurrection.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا سُهَيْلٌ، عَنْ أَبِيهِ،\n عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَسْتُرُ عَبْدٌ عَبْدًا فِي الدُّنْيَا إِلاَّ\n سَتَرَهُ اللَّهُ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Hamba yang menutupi kesalahan hamba Allah yang lain di dunia, nescaya Allah akan menutupi kesalahannya pada hari kiamat."
  },
  {
    "id": 13711,
    "hadith_number": 6434,
    "tajuk_hadith": "Kebaikan dan Kedudukan Manusia di Hari Kiamat",
    "perawi_melayu": "Aisyah meriwayatkan bahawa seorang lelaki meminta izin untuk bertemu Rasulullah ﷺ.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ\n وَابْنُ نُمَيْرٍ كُلُّهُمْ عَنِ ابْنِ عُيَيْنَةَ، - وَاللَّفْظُ لِزُهَيْرٍ - قَالَ حَدَّثَنَا سُفْيَانُ، - وَهُوَ ابْنُ عُيَيْنَةَ\n - عَنِ ابْنِ الْمُنْكَدِرِ، سَمِعَ عُرْوَةَ بْنَ الزُّبَيْرِ، يَقُولُ حَدَّثَتْنِي عَائِشَةُ، أَنَّ رَجُلاً، اسْتَأْذَنَ عَلَى\n النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ ائْذَنُوا لَهُ فَلَبِئْسَ ابْنُ الْعَشِيرَةِ أَوْ بِئْسَ رَجُلُ الْعَشِيرَةِ\n ‏\"‏ ‏.‏ فَلَمَّا دَخَلَ عَلَيْهِ أَلاَنَ لَهُ الْقَوْلَ قَالَتْ عَائِشَةُ فَقُلْتُ يَا رَسُولَ اللَّهِ قُلْتَ لَهُ الَّذِي قُلْتَ\n ثُمَّ أَلَنْتَ لَهُ الْقَوْلَ قَالَ ‏\"‏ يَا عَائِشَةُ إِنَّ شَرَّ النَّاسِ مَنْزِلَةً عِنْدَ اللَّهِ يَوْمَ الْقِيَامَةِ مَنْ وَدَعَهُ\n أَوْ تَرَكَهُ النَّاسُ اتِّقَاءَ فُحْشِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah bin Sa'id, Abu Bakar bin Abi Syaibah, Amru An-Naqid, Zuhair bin Harb dan Ibnu Numair, semuanya daripada Ibnu Uyainah - dan lafaz ini daripada Zuhair - berkata: Telah menceritakan kepada kami Sufian - iaitu Ibnu Uyainah - daripada Ibnu Al-Munkidir, telah mendengar Urwah bin Az-Zubair berkata: Telah menceritakan kepadaku Aisyah, bahawa seorang lelaki meminta izin untuk masuk kepada Nabi ﷺ. Baginda bersabda: \"Izinkanlah dia, sesungguhnya dia adalah anak saudara yang jahat atau lelaki saudara yang jahat.\"  Apabila dia masuk, Baginda melembutkan perkataan Baginda kepadanya. Aisyah berkata: Maka aku berkata, \"Wahai Rasulullah, engkau telah berkata kepadanya apa yang engkau telah katakan, kemudian engkau melembutkan perkataan engkau kepadanya.\" Baginda bersabda: \"Wahai Aisyah, sesungguhnya seburuk-buruk manusia kedudukannya di sisi Allah pada hari kiamat ialah orang yang ditinggalkan atau dijauhi oleh manusia kerana kekejiannya.\""
  },
  {
    "id": 13712,
    "hadith_number": 6435,
    "tajuk_hadith": "Perbezaan Ringkas Perawi Hadis",
    "perawi_melayu": "Ibn Munkadir (dengan sanad yang hampir sama)",
    "english_text": "This hadith has been reported on the authority of Ibn Munkadir with the same chain of transmitters but with a slight variation of wording.",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، كِلاَهُمَا عَنْ عَبْدِ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ،\n عَنِ ابْنِ الْمُنْكَدِرِ، فِي هَذَا الإِسْنَادِ ‏.‏ مِثْلَ مَعْنَاهُ غَيْرَ أَنَّهُ قَالَ ‏\n\"‏ بِئْسَ أَخُو الْقَوْمِ وَابْنُ الْعَشِيرَةِ\n ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Ibn Munkadir dengan sanad yang hampir sama, cuma sedikit perbezaan lafaz."
  },
  {
    "id": 13713,
    "hadith_number": 6436,
    "tajuk_hadith": "Kehilangan Kelembutan Hati, Kehilangan Kebaikan",
    "perawi_melayu": "Jarir meriwayatkan daripada Rasulullah SAW:",
    "english_text": "He who is deprived of tenderly feelings is in fact deprived of good.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، حَدَّثَنَا مَنْصُورٌ، عَنْ \n تَمِيمِ بْنِ سَلَمَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هِلاَلٍ، عَنْ جَرِيرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ\n ‏\n\"‏ مَنْ يُحْرَمِ الرِّفْقَ يُحْرَمِ الْخَيْرَ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Jarir, daripada Nabi SAW, baginda bersabda:  \"Barangsiapa yang kehilangan kelembutan (hati), maka dia kehilangan kebaikan.\""
  },
  {
    "id": 13714,
    "hadith_number": 6437,
    "tajuk_hadith": "Kehilangan Kelembutan Hati, Kehilangan Kebaikan",
    "perawi_melayu": "Jarir meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "He who is deprived of tenderly feelings is in fact deprived of good.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو سَعِيدٍ الأَشَجُّ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ\n قَالُوا حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ،\n حَدَّثَنَا حَفْصٌ، - يَعْنِي ابْنَ غِيَاثٍ - كُلُّهُمْ عَنِ الأَعْمَشِ، ح وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ،\n بْنُ إِبْرَاهِيمَ - وَاللَّفْظُ لَهُمَا - قَالَ زُهَيْرٌ حَدَّثَنَا وَقَالَ، إِسْحَاقُ أَخْبَرَنَا جَرِيرٌ، عَنِ الأَعْمَشِ،\n عَنْ تَمِيمِ بْنِ سَلَمَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هِلاَلٍ الْعَبْسِيِّ، قَالَ سَمِعْتُ جَرِيرًا، يَقُولُ سَمِعْتُ \n رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ يُحْرَمِ الرِّفْقَ يُحْرَمِ الْخَيْرَ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa yang kehilangan sifat kelembutan, maka sesungguhnya dia telah kehilangan kebaikan."
  },
  {
    "id": 13715,
    "hadith_number": 6438,
    "tajuk_hadith": "Kehilangan Kelembutan Hati dan Kebaikan",
    "perawi_melayu": "Jarir bin Abdullah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "He who is deprived of tenderly feelings is in fact deprived of good and he who is deprived of tenderly feelings is in fact deprived of good.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، عَنْ مُحَمَّدِ بْنِ أَبِي إِسْمَاعِيلَ،\n عَنْ عَبْدِ الرَّحْمَنِ بْنِ هِلاَلٍ، قَالَ سَمِعْتُ جَرِيرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله\n عليه وسلم ‏\n\"‏ مَنْ حُرِمَ الرِّفْقَ حُرِمَ الْخَيْرَ أَوْ مَنْ يُحْرَمِ الرِّفْقَ يُحْرَمِ الْخَيْرَ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa yang kehilangan sifat kelembutan, maka dia kehilangan kebaikan.  Atau barangsiapa yang dihalang daripada sifat kelembutan, maka dia dihalang daripada kebaikan."
  },
  {
    "id": 13716,
    "hadith_number": 6439,
    "tajuk_hadith": "Sifat Allah Yang Maha Lembut dan Pengasih",
    "perawi_melayu": "Aisyah, isteri Rasulullah SAW meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "'A'isha, verily Allah is kind and He loves kindness and confers upon kindness which he does not confer upon severity and does not confer upon anything else besides it (kindness).",
    "arabic_text": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي حَيْوَةُ، حَدَّثَنِي \n ابْنُ الْهَادِ، عَنْ أَبِي بَكْرِ بْنِ حَزْمٍ، عَنْ عَمْرَةَ، - يَعْنِي بِنْتَ عَبْدِ الرَّحْمَنِ - عَنْ عَائِشَةَ، زَوْجِ\n النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَا عَائِشَةُ إِنَّ اللَّهَ\n رَفِيقٌ يُحِبُّ الرِّفْقَ وَيُعْطِي عَلَى الرِّفْقِ مَا لاَ يُعْطِي عَلَى الْعُنْفِ وَمَا لاَ يُعْطِي عَلَى مَا سِوَاهُ\n ‏\"‏ ‏.‏",
    "malay_translation": "Wahai Aisyah, sesungguhnya Allah Maha Lembut, Allah menyukai kelembutan, dan Allah memberi ganjaran atas kelembutan yang tidak diberikan-Nya atas kekerasan, dan tidak diberikan-Nya atas apa jua selain kelembutan."
  },
  {
    "id": 13717,
    "hadith_number": 6440,
    "tajuk_hadith": "Keindahan Kelembutan dan Kerendahan Hati",
    "perawi_melayu": "Aisyah, isteri Rasulullah SAW, meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Kindness is not to be found in anything but that it adds to its beauty and it is not withdrawn from anything but it makes it defective.",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنِ الْمِقْدَامِ، - وَهُوَ\n ابْنُ شُرَيْحِ بْنِ هَانِئٍ - عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم عَنِ النَّبِيِّ\n صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الرِّفْقَ لاَ يَكُونُ فِي شَىْءٍ إِلاَّ زَانَهُ وَلاَ يُنْزَعُ مِنْ شَىْءٍ إِلاَّ\n شَانَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Sesungguhnya kelembutan itu tidak terdapat pada sesuatu melainkan akan menambah keindahannya, dan ia tidak dikeluarkan daripada sesuatu melainkan akan merosakkannya."
  },
  {
    "id": 13718,
    "hadith_number": 6441,
    "tajuk_hadith": "Berlaku Lembut dan Penyayang",
    "perawi_melayu": "Hadis ini diriwayatkan oleh Miqdam bin Syuraih bin Hani' dengan sanad yang sama, tetapi dengan tambahan ini:",
    "english_text": "\" 'A'isha mounted upon a wild camel and she began to make that go round and round. Thereupon Allah's Messenger (ﷺ) said: You should show kindness, and then he made a mention of this hadith.",
    "arabic_text": "حَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ،\n سَمِعْتُ الْمِقْدَامَ بْنَ شُرَيْحِ بْنِ هَانِئٍ، بِهَذَا الإِسْنَادِ وَزَادَ فِي الْحَدِيثِ رَكِبَتْ عَائِشَةُ بَعِيرًا\n فَكَانَتْ فِيهِ صُعُوبَةٌ فَجَعَلَتْ تُرَدِّدُهُ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ عَلَيْكِ بِالرِّفْقِ\n ‏\"‏ ‏.‏ ثُمَّ ذَكَرَ بِمِثْلِهِ ‏.‏",
    "malay_translation": "Aisyah menunggang unta liar dan dia mula-mula membuatnya berputar-putar.  Maka Rasulullah ﷺ bersabda:  “Hendaklah engkau berlaku lemah lembut.” Kemudian baginda menyebut hadis yang serupa."
  },
  {
    "id": 13719,
    "hadith_number": 6442,
    "tajuk_hadith": "Larangan Mendoakan Keburukan Haiwan",
    "perawi_melayu": "Imran bin Husain meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنِ ابْنِ عُلَيَّةَ، قَالَ زُهَيْرٌ\n حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الْمُهَلَّبِ، عَنْ عِمْرَانَ بْنِ،\n حُصَيْنٍ قَالَ بَيْنَمَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي بَعْضِ أَسْفَارِهِ وَامْرَأَةٌ مِنَ الأَنْصَارِ\n عَلَى نَاقَةٍ فَضَجِرَتْ فَلَعَنَتْهَا فَسَمِعَ ذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ خُذُوا\n مَا عَلَيْهَا وَدَعُوهَا فَإِنَّهَا مَلْعُونَةٌ ‏\"‏ ‏.‏ قَالَ عِمْرَانُ فَكَأَنِّي أَرَاهَا الآنَ تَمْشِي فِي النَّاسِ\n مَا يَعْرِضُ لَهَا أَحَدٌ ‏.‏",
    "malay_translation": "Abu Bakar bin Abi Syaibah dan Zuhair bin Harb meriwayatkan daripada Ibnu ‘Ulaiyyah, kata Zuhair: Ismail bin Ibrahim meriwayatkan daripada Ayyub, daripada Abu Qilabah, daripada Abu al-Muhlab, daripada Imran bin Husain.  Beliau berkata, \"Ketika Rasulullah SAW dalam salah satu perjalanan baginda, seorang wanita Ansar menunggang unta betina. Unta itu memberontak lalu wanita itu melaknatnya. Rasulullah SAW mendengarnya lalu bersabda:  \"Angkatlah muatannya dan lepaskanlah ia, kerana ia telah dilaknat.\" Imran berkata, \"Seakan-akan aku masih melihat unta itu berjalan di tengah-tengah manusia, tetapi tiada seorang pun yang mengganggunya.\""
  },
  {
    "id": 13720,
    "hadith_number": 6443,
    "tajuk_hadith": "Beban Unta dan Laknat",
    "perawi_melayu": "Imran meriwayatkan:",
    "english_text": "I perceive as if I am looking towards that dromedary, and in the hadith transmitted on the authority of Thaqafi (the words are):\" Unload it and make its back bare for it is accursed.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو الرَّبِيعِ، قَالاَ حَدَّثَنَا حَمَّادٌ، وَهُوَ ابْنُ زَيْدٍ ح وَحَدَّثَنَا \n ابْنُ أَبِي عُمَرَ، حَدَّثَنَا الثَّقَفِيُّ، كِلاَهُمَا عَنْ أَيُّوبَ، بِإِسْنَادِ إِسْمَاعِيلَ ‏.‏ نَحْوَ حَدِيثِهِ إِلاَّ أَنَّ فِي\n حَدِيثِ حَمَّادٍ قَالَ عِمْرَانُ فَكَأَنِّي أَنْظُرُ إِلَيْهَا نَاقَةً وَرْقَاءَ وَفِي حَدِيثِ الثَّقَفِيِّ فَقَالَ ‏\n\"‏ خُذُوا\n مَا عَلَيْهَا وَأَعْرُوهَا فَإِنَّهَا مَلْعُونَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qotaibah bin Sa’id dan Abu Ar-Rabi’, mereka berdua berkata: Telah menceritakan kepada kami Hammad iaitu Ibnu Zaid, dan telah menceritakan kepada kami Ibnu Abi Umar, telah menceritakan kepada kami Ats-Tsakafi, keduanya daripada Ayyub, melalui sanad Ismail.  Lebih kurang sama dengan hadisnya, kecuali dalam hadis Hammad, Imran berkata:  Seakan-akan aku melihatnya, seekor unta yang dibebani.  Dan dalam hadis Ats-Tsakafi, katanya: \"Angkatlah apa yang ada padanya dan bebaskanlah punggungnya kerana ia dilaknati.\""
  },
  {
    "id": 13721,
    "hadith_number": 6444,
    "tajuk_hadith": "Laknat Ke Atas Unta",
    "perawi_melayu": "Abu Burza al-Aslami",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، فُضَيْلُ بْنُ حُسَيْنٍ حَدَّثَنَا يَزِيدُ، - يَعْنِي ابْنَ زُرَيْعٍ -\n حَدَّثَنَا التَّيْمِيُّ، عَنْ أَبِي عُثْمَانَ، عَنْ أَبِي بَرْزَةَ الأَسْلَمِيِّ، قَالَ بَيْنَمَا جَارِيَةٌ عَلَى نَاقَةٍ عَلَيْهَا\n بَعْضُ مَتَاعِ الْقَوْمِ إِذْ بَصُرَتْ بِالنَّبِيِّ صلى الله عليه وسلم وَتَضَايَقَ بِهِمُ الْجَبَلُ فَقَالَتْ حَلْ\n اللَّهُمَّ الْعَنْهَا ‏.‏ قَالَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ تُصَاحِبُنَا نَاقَةٌ عَلَيْهَا لَعْنَةٌ ‏\"‏\n ‏.‏",
    "malay_translation": "Abu Burza al-Aslami meriwayatkan bahawa seorang hamba perempuan sedang menunggang unta, dan di atas unta itu juga terdapat beberapa barang kepunyaan orang ramai.  Apabila hamba perempuan itu ternampak Rasulullah ﷺ, dan laluan gunung itu sempit, maka dia berkata (kepada unta itu): \"Ya Allah, laknatkanlah ia!\"  Maka Rasulullah ﷺ bersabda: \"Unta yang telah dilaknat itu tidak akan menyertai perjalanan kita.\""
  },
  {
    "id": 13722,
    "hadith_number": 6445,
    "tajuk_hadith": "Menjauhi Apa Yang Di Laknati Allah",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Sulaiman Taimi dengan sanad yang sama, tetapi dengan sedikit perbezaan lafaz (iaitu):",
    "english_text": "\"By Allah, let that accompany us not which has been damned, or he said like it.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا الْمُعْتَمِرُ، ح وَحَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا \n يَحْيَى، - يَعْنِي ابْنَ سَعِيدٍ - جَمِيعًا عَنْ سُلَيْمَانَ التَّيْمِيِّ، بِهَذَا الإِسْنَادِ وَزَادَ فِي حَدِيثِ الْمُعْتَمِرِ\n ‏\n\"‏ لاَ ايْمُ اللَّهِ لاَ تُصَاحِبُنَا رَاحِلَةٌ عَلَيْهَا لَعْنَةٌ مِنَ اللَّهِ ‏\"‏ ‏.‏ أَوْ كَمَا قَالَ ‏.‏",
    "malay_translation": "Demi Allah, janganlah kita ditemani oleh kenderaan yang dilaknati Allah, atau seperti yang beliau katakan."
  },
  {
    "id": 13723,
    "hadith_number": 6446,
    "tajuk_hadith": "Orang yang Benar Tidak Sepatutnya Mencela",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "It does not seem proper for a Siddiq that he should be an invoker of curse.",
    "arabic_text": "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي سُلَيْمَانُ، - وَهُوَ ابْنُ\n بِلاَلٍ - عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، حَدَّثَهُ عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى\n الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَنْبَغِي لِصِدِّيقٍ أَنْ يَكُونَ لَعَّانًا ‏\"‏ ‏.‏",
    "malay_translation": "Tidak sepatutnya bagi seorang yang benar (Siddiq) untuk menjadi seorang yang suka mencela."
  },
  {
    "id": 13724,
    "hadith_number": 6447,
    "tajuk_hadith": "Sanad Riwayat Abu Kuraib",
    "perawi_melayu": "Abu Kuraib",
    "english_text": "This hadith has been narrated on the authority of Abu Kuraib with the same chain of transmitters.",
    "arabic_text": "حَدَّثَنِيهِ أَبُو كُرَيْبٍ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ،\n الرَّحْمَنِ بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Abu Kuraib dengan sanad yang sama."
  },
  {
    "id": 13725,
    "hadith_number": 6448,
    "tajuk_hadith": "Orang yang Melakukan Laknat Tidak Akan Menjadi Pemberi Syafaat atau Saksi di Hari Kiamat",
    "perawi_melayu": "Zaid bin Aslam meriwayatkan bahawa Abd al-Malik bin Marwan telah menghantar beberapa barang keperluan rumah kepada Ummu Darda' atas namanya sendiri, dan apabila malam tiba Abd al-Malik bangun dan memanggil hambanya. Nampaknya hamba itu lambat (untuk menjawab panggilannya), maka dia (Abd al-Malik) melaknatinya, dan apabila pagi tiba Ummu Darda' berkata kepadanya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنِي حَفْصُ بْنُ مَيْسَرَةَ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ عَبْدَ الْمَلِكِ،\n بْنَ مَرْوَانَ بَعَثَ إِلَى أُمِّ الدَّرْدَاءِ بِأَنْجَادٍ مِنْ عِنْدِهِ فَلَمَّا أَنْ كَانَ ذَاتَ لَيْلَةٍ قَامَ عَبْدُ الْمَلِكِ\n مِنَ اللَّيْلِ فَدَعَا خَادِمَهُ فَكَأَنَّهُ أَبْطَأَ عَلَيْهِ فَلَعَنَهُ فَلَمَّا أَصْبَحَ قَالَتْ لَهُ أُمُّ الدَّرْدَاءِ سَمِعْتُكَ\n اللَّيْلَةَ لَعَنْتَ خَادِمَكَ حِينَ دَعَوْتَهُ ‏.‏ فَقَالَتْ سَمِعْتُ أَبَا الدَّرْدَاءِ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم ‏\n\"‏ لاَ يَكُونُ اللَّعَّانُونَ شُفَعَاءَ وَلاَ شُهَدَاءَ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Suwaid bin Said telah meriwayatkan dari Hafs bin Maisarah, daripada Zaid bin Aslam bahawa Abd al-Malik bin Marwan telah menghantar barang-barang perhiasan daripada dirinya kepada Ummu Darda'.  Pada suatu malam, Abd al-Malik bangun dari tidur dan memanggil hambanya.  Kelihatan hambanya lambat datang, lalu dia melaknatinya.  Keesokan paginya, Ummu Darda' berkata kepadanya, \"Semalam aku mendengar engkau melaknat hambamu ketika engkau memanggilnya.\"  Dia berkata, \"Aku mendengar Abu Darda' berkata bahawa Rasulullah SAW bersabda:  \"Orang-orang yang melaknat tidak akan menjadi pemberi syafaat mahupun saksi pada hari kiamat.\""
  },
  {
    "id": 13726,
    "hadith_number": 6449,
    "tajuk_hadith": "Periwayat Hadis Zaid bin Aslam",
    "perawi_melayu": "Zaid bin Aslam",
    "english_text": "This hadith has been narrated on the authority of Zaid b. Aslam with the same chain of transmitters.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو غَسَّانَ الْمِسْمَعِيُّ وَعَاصِمُ بْنُ النَّضْرِ التَّيْمِيُّ\n قَالُوا حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، كِلاَهُمَا\n عَنْ مَعْمَرٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، فِي هَذَا الإِسْنَادِ بِمِثْلِ مَعْنَى حَدِيثِ حَفْصِ بْنِ مَيْسَرَةَ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Zaid bin Aslam dengan sanad (rantaian periwayat) yang sama.  Abu Bakar bin Abi Syaibah, Abu Ghassan al-Misma’i dan ‘Asim bin Nadhr al-Taymi berkata: Mereka telah meriwayatkan daripada Mu’tamir bin Sulaiman, dan Ishaq bin Ibrahim telah meriwayatkan daripada kami (melalui) Abdul Razzaq. Kedua-duanya daripada Ma’mar, daripada Zaid bin Aslam.  Dalam sanad ini dengan makna yang serupa dengan hadis Hafs bin Maisarah."
  },
  {
    "id": 13727,
    "hadith_number": 6450,
    "tajuk_hadith": "Orang Yang Kerap Menuturkan Laknat",
    "perawi_melayu": "Umm Darda' meriwayatkan daripada Abu Darda' bahawa:",
    "english_text": "I heard Allah's Messenger (ﷺ) as saying: The invoker of curse would neither be witness nor intercessor on the Day of Resurrection.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، عَنْ هِشَامِ بْنِ سَعْدٍ، عَنْ \n زَيْدِ بْنِ أَسْلَمَ، وَأَبِي، حَازِمٍ عَنْ أُمِّ الدَّرْدَاءِ، عَنْ أَبِي الدَّرْدَاءِ، سَمِعْتُ رَسُولَ اللَّهِ صلى الله\n عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ اللَّعَّانِينَ لاَ يَكُونُونَ شُهَدَاءَ وَلاَ شُفَعَاءَ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda:  \"Sesungguhnya orang-orang yang selalu melaknat tidak akan menjadi saksi dan tidak pula menjadi syafaat pada hari kiamat.\""
  },
  {
    "id": 13728,
    "hadith_number": 6451,
    "tajuk_hadith": "Rasulullah SAW sebagai Rahmat, Bukan Laknat",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa telah dikatakan kepada Rasulullah SAW:",
    "english_text": "Invoke curse upon the polytheists, whereupon he said: I have not been sent as the invoker of curse, but I have been sent as mercy.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، وَابْنُ أَبِي عُمَرَ، قَالاَ حَدَّثَنَا مَرْوَانُ، - يَعْنِيَانِ الْفَزَارِيَّ -\n عَنْ يَزِيدَ، - وَهُوَ ابْنُ كَيْسَانَ - عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قِيلَ يَا رَسُولَ اللَّهِ\n ادْعُ عَلَى الْمُشْرِكِينَ قَالَ ‏\n\"‏ إِنِّي لَمْ أُبْعَثْ لَعَّانًا وَإِنَّمَا بُعِثْتُ رَحْمَةً ‏\"‏ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa telah dikatakan kepada Rasulullah SAW: \"Ya Rasulullah, kutuklah orang-orang musyrik!\"  Baginda SAW bersabda:  \"Sesungguhnya aku tidak diutus untuk melaknat, tetapi aku diutus sebagai rahmat.\""
  },
  {
    "id": 13729,
    "hadith_number": 6452,
    "tajuk_hadith": "Doa Nabi SAW untuk Orang yang Dilaknat",
    "perawi_melayu": "Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ،\n عَنْ عَائِشَةَ، قَالَتْ دَخَلَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم رَجُلاَنِ فَكَلَّمَاهُ بِشَىْءٍ لاَ\n أَدْرِي مَا هُوَ فَأَغْضَبَاهُ فَلَعَنَهُمَا وَسَبَّهُمَا فَلَمَّا خَرَجَا قُلْتُ يَا رَسُولَ اللَّهِ مَنْ أَصَابَ مِنَ\n الْخَيْرِ شَيْئًا مَا أَصَابَهُ هَذَانِ قَالَ ‏\"‏ وَمَا ذَاكِ ‏\"‏ ‏.‏ قَالَتْ قُلْتُ لَعَنْتَهُمَا وَسَبَبْتَهُمَا قَالَ ‏\"‏\n أَوَمَا عَلِمْتِ مَا شَارَطْتُ عَلَيْهِ رَبِّي قُلْتُ اللَّهُمَّ إِنَّمَا أَنَا بَشَرٌ فَأَىُّ الْمُسْلِمِينَ لَعَنْتُهُ أَوْ سَبَبْتُهُ\n فَاجْعَلْهُ لَهُ زَكَاةً وَأَجْرًا ‏\"‏ ‏.‏",
    "malay_translation": "Aisyah meriwayatkan bahawa dua orang lelaki telah menghadap Rasulullah SAW. Mereka bercakap tentang sesuatu yang aku tidak tahu apa, tetapi telah menyebabkan baginda marah lalu baginda melaknat dan mencela mereka berdua. Setelah mereka keluar, aku berkata, \"Wahai Rasulullah, siapakah yang akan mendapat kebaikan seperti yang didapati oleh dua orang itu?\" Baginda bertanya, \"Mengapa demikian?\" Aku menjawab, \"Kerana baginda telah melaknat dan mencela mereka.\" Baginda menjawab, \"Tidakkah kamu tahu apa yang telah Aku perjanjiankan dengan Tuhanku? Aku berdoa, \"Ya Allah, sesungguhnya aku hanyalah seorang manusia, maka sesiapa daripada umat Islam yang aku laknat atau cela, jadikanlah ia sebagai zakat dan pahala untuknya.\""
  },
  {
    "id": 13730,
    "hadith_number": 6453,
    "tajuk_hadith": "Pertemuan Sulit dan Kutukan",
    "perawi_melayu": "Hadis ini diriwayatkan melalui jalur periwayat yang sama daripada al-A'mash, dan hadis yang diriwayatkan melalui 'Isa (dengan lafaz):",
    "english_text": "\" He had a private meeting with them and hurled malediction upon them and cursed them and sent them out.\"",
    "arabic_text": "حَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَاهُ \n عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَلِيُّ بْنُ خَشْرَمٍ، جَمِيعًا عَنْ عِيسَى بْنِ يُونُسَ،\n كِلاَهُمَا عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ ‏.‏ نَحْوَ حَدِيثِ جَرِيرٍ وَقَالَ فِي حَدِيثِ عِيسَى فَخَلَوَا\n بِهِ فَسَبَّهُمَا وَلَعَنَهُمَا وَأَخْرَجَهُمَا ‏.‏",
    "malay_translation": "Mereka mengadakan pertemuan sulit dengannya, lalu beliau mencela dan mengutuk mereka serta menghalau mereka."
  },
  {
    "id": 13731,
    "hadith_number": 6454,
    "tajuk_hadith": "Doa memohon keampunan atas celaan kepada Muslim",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "O Allah, I am a human being and for any person amongst Muslims upon whom I hurl malediction or invoke curse or give him whipping make it a source of purity and mercy.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي صَالِحٍ،\n عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اللَّهُمَّ إِنَّمَا أَنَا بَشَرٌ فَأَيُّمَا\n رَجُلٍ مِنَ الْمُسْلِمِينَ سَبَبْتُهُ أَوْ لَعَنْتُهُ أَوْ جَلَدْتُهُ فَاجْعَلْهَا لَهُ زَكَاةً وَرَحْمَةً ‏\"‏ ‏.‏",
    "malay_translation": "Ya Allah, sesungguhnya aku hanyalah manusia biasa.  Oleh itu, bagi sesiapa sahaja di kalangan umat Islam yang aku cela, kutuk, atau pukul, jadikanlah ia sebagai satu sumber kesucian dan rahmat baginya."
  },
  {
    "id": 13732,
    "hadith_number": 6455,
    "tajuk_hadith": "Hadis Jabir:  Perbezaan Ringkas Perkataan",
    "perawi_melayu": "Jabir melalui Abu Sufian, Al-A'mash, Abi dan Ibnu Numair",
    "english_text": "Jabir reported Allah's Apostle (ﷺ) a hadith like it but with a slight variation of wording.",
    "arabic_text": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ\n صلى الله عليه وسلم مِثْلَهُ إِلاَّ أَنَّ فِيهِ ‏\n\"‏ زَكَاةً وَأَجْرًا ‏\"‏ ‏.‏",
    "malay_translation": "Jabir meriwayatkan bahawa Rasulullah SAW telah meriwayatkan hadis yang serupa, tetapi dengan sedikit perbezaan perkataan."
  },
  {
    "id": 13733,
    "hadith_number": 6456,
    "tajuk_hadith": "Jadikanlah ia sebagai sumber pahala dan rahmat",
    "perawi_melayu": "Hadis ini diriwayatkan daripada al-A'masy dan dalam hadis yang diriwayatkan daripada Isa, lafaznya ialah:",
    "english_text": "Make it a source of reward, and in the hadith transmitted on the authority of Abu Huraira (the words are):\" Make it a source of mercy.\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا إِسْحَاقُ،\n بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، كِلاَهُمَا عَنِ الأَعْمَشِ، بِإِسْنَادِ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ ‏.‏\n مِثْلَ حَدِيثِهِ غَيْرَ أَنَّ فِي، حَدِيثِ عِيسَى جَعَلَ ‏\"‏ وَأَجْرًا ‏\"‏ ‏.‏ فِي حَدِيثِ أَبِي هُرَيْرَةَ وَجَعَلَ\n ‏\"‏ وَرَحْمَةً ‏\"‏ ‏.‏ فِي حَدِيثِ جَابِرٍ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Abu Bakr bin Abi Syaibah dan Abu Kuraib. Mereka berkata: “Kami telah mendengar daripada Abu Muawiyah…” dan diriwayatkan juga daripada Ishaq bin Ibrahim yang memberitakan daripada Isa bin Yunus. Kedua-duanya daripada al-A’masy melalui sanad Abdullah bin Numair.  Hadisnya sama seperti hadis ini, cuma dalam hadis Isa, lafaznya ialah “dan pahala”.  Manakala dalam hadis Abu Hurairah, lafaznya ialah “dan rahmat”.  Dalam hadis Jabir pun begitu."
  },
  {
    "id": 13734,
    "hadith_number": 6457,
    "tajuk_hadith": "Doa memohon keampunan atas kesalahan terhadap orang mukmin",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "O Allah, I make a covenant with Thee against which Thou wouldst never go. I am a human being and thus for a Muslim whom I give any harm or whom I scold or upon whom I invoke curse or whom I beat, make this a source of blessing, purification and nearness to Thee on the Day of Resurrection.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا الْمُغِيرَةُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْحِزَامِيَّ - عَنْ \n أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ اللَّهُمَّ إِنِّي\n أَتَّخِذُ عِنْدَكَ عَهْدًا لَنْ تُخْلِفَنِيهِ فَإِنَّمَا أَنَا بَشَرٌ فَأَىُّ الْمُؤْمِنِينَ آذَيْتُهُ شَتَمْتُهُ لَعَنْتُهُ جَلَدْتُهُ فَاجْعَلْهَا\n لَهُ صَلاَةً وَزَكَاةً وَقُرْبَةً تُقَرِّبُهُ بِهَا إِلَيْكَ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Ya Allah, aku berjanji kepada-Mu, satu janji yang tidak akan Engkau ingkari. Aku hanyalah seorang manusia biasa.  Maka, bagi mana-mana orang Islam yang aku telah aniaya, cela, laknat, atau pukul, jadikanlah ia sebagai satu sebab untuk mendapat keberkatan, kesucian, dan kedekatan kepadanya di sisi-Mu pada hari kiamat."
  },
  {
    "id": 13735,
    "hadith_number": 6458,
    "tajuk_hadith": "Perbezaan Ringkas Perawi Hadis",
    "perawi_melayu": "Abu Zinad",
    "english_text": "This hadith has been transmitted on the authority of Abu Zinad with a slight variation of wording.",
    "arabic_text": "حَدَّثَنَاهُ ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا أَبُو الزِّنَادِ، بِهَذَا الإِسْنَادِ نَحْوَهُ إِلاَّ\n أَنَّهُ قَالَ ‏\"‏ أَوْ جَلَدُّهُ ‏\"‏ ‏.‏ قَالَ أَبُو الزِّنَادِ وَهِيَ لُغَةُ أَبِي هُرَيْرَةَ وَإِنَّمَا هِيَ ‏\"‏ جَلَدْتُهُ ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini telah diriwayatkan daripada Abu Zinad dengan sedikit perbezaan lafaz.  Ibn Abi Umar meriwayatkan daripada Sufyan, yang meriwayatkan daripada Abu Zinad melalui sanad yang hampir sama, kecuali bahawa beliau berkata \"atau kulitnya\".  Abu Zinad berkata,  itu adalah loghat daripada Abi Hurairah dan sebenarnya ia adalah \"kulitku\"."
  },
  {
    "id": 13736,
    "hadith_number": 6459,
    "tajuk_hadith": "Hadis daripada Abu Hurairah melalui Sanad Lain",
    "perawi_melayu": "Hadis ini diriwayatkan oleh Sulaiman bin Ma'bad daripada Sulaiman bin Harb, daripada Hammad bin Zaid, daripada Ayub, daripada Abdur Rahman al-A'raj, daripada Abu Hurairah daripada Nabi SAW.",
    "english_text": "A hadith like this has been reported on the authority of Abu Huraira through another chain of transmitters.",
    "arabic_text": "حَدَّثَنِي سُلَيْمَانُ بْنُ مَعْبَدٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ،\n عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِنَحْوِهِ ‏.‏",
    "malay_translation": "Hadis yang seumpamanya telah diriwayatkan daripada Abu Hurairah melalui sanad (rantaian periwayat) yang lain."
  },
  {
    "id": 13737,
    "hadith_number": 6460,
    "tajuk_hadith": "Doa Nabi Muhammad SAW memohon keampunan atas kesalahan kepada orang mukmin",
    "perawi_melayu": "Salim, hamba sahaya yang dimerdekakan daripada kaum Nasriyyin berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ سَالِمٍ، مَوْلَى النَّصْرِيِّينَ\n قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ اللَّهُمَّ إِنَّمَا\n مُحَمَّدٌ بَشَرٌ يَغْضَبُ كَمَا يَغْضَبُ الْبَشَرُ وَإِنِّي قَدِ اتَّخَذْتُ عِنْدَكَ عَهْدًا لَنْ تُخْلِفَنِيهِ فَأَيُّمَا مُؤْمِنٍ\n آذَيْتُهُ أَوْ سَبَبْتُهُ أَوْ جَلَدْتُهُ فَاجْعَلْهَا لَهُ كَفَّارَةً وَقُرْبَةً تُقَرِّبُهُ بِهَا إِلَيْكَ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah bin Sa'id, telah menceritakan kepada kami Laith, dari Sa'id bin Abi Sa'id, dari Salim, hamba sahaya yang dimerdekakan daripada kaum Nasriyyin.\nDia berkata: Aku mendengar Abu Hurairah berkata: Aku mendengar Rasulullah SAW bersabda:\n\"Ya Allah, sesungguhnya Muhammad hanyalah seorang manusia biasa yang akan marah sebagaimana manusia biasa lainnya. Dan sesungguhnya aku telah berjanji di sisi-Mu, dan Engkau tidak akan mengingkari janji-Mu. Maka sesiapa sahaja daripada orang-orang yang beriman yang aku telah menyakiti, atau mencaci, atau menyeksa, maka jadikanlah ia sebagai penebus dosa baginya dan sebagai suatu kebaikan yang mendekatkannya kepada-Mu pada hari kiamat.\" "
  },
  {
    "id": 13738,
    "hadith_number": 6461,
    "tajuk_hadith": "Doa memohon keredaan Allah untuk hamba yang dimarahi",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa baginda Rasulullah SAW bersabda:",
    "english_text": "O Allah, for any believing servant whom I curse make that as a source of nearness to Thee on the Day of Resurrection.",
    "arabic_text": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي \n سَعِيدُ بْنُ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ اللَّهُمَّ\n فَأَيُّمَا عَبْدٍ مُؤْمِنٍ سَبَبْتُهُ فَاجْعَلْ ذَلِكَ لَهُ قُرْبَةً إِلَيْكَ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Ya Allah, bagi mana-mana hamba yang beriman yang aku cela, jadikanlah celaan itu sebagai satu sebab untuk mendekatkannya kepadaMu pada hari kiamat."
  },
  {
    "id": 13739,
    "hadith_number": 6462,
    "tajuk_hadith": "Pengampunan bagi Orang Mukmin yang Dicela atau Dipukul",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "I have held covenant with Thee which Thou wouldst not break, so for any believer whom I curse or beat, make that an expiation on the Day of Resurrection.",
    "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ زُهَيْرٌ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ،\n حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ، عَنْ عَمِّهِ، حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ\n سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ اللَّهُمَّ إِنِّي اتَّخَذْتُ عِنْدَكَ عَهْدًا لَنْ تُخْلِفَنِيهِ\n فَأَيُّمَا مُؤْمِنٍ سَبَبْتُهُ أَوْ جَلَدْتُهُ فَاجْعَلْ ذَلِكَ كَفَّارَةً لَهُ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Aku telah membuat perjanjian dengan-Mu, ya Allah, yang Engkau tidak akan mengingkari.  Maka, sesiapa sahaja di kalangan orang mukmin yang aku cela atau pukul, jadikanlah ia sebagai penebus dosa baginya pada Hari Kiamat."
  },
  {
    "id": 13740,
    "hadith_number": 6463,
    "tajuk_hadith": "Pengampunan atas Kecaman",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، وَحَجَّاجُ بْنُ الشَّاعِرِ، قَالاَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ،\n قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ سَمِعْتُ رَسُولَ\n اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّمَا أَنَا بَشَرٌ وَإِنِّي اشْتَرَطْتُ عَلَى رَبِّي عَزَّ وَجَلَّ أَىُّ\n عَبْدٍ مِنَ الْمُسْلِمِينَ سَبَبْتُهُ أَوْ شَتَمْتُهُ أَنْ يَكُونَ ذَلِكَ لَهُ زَكَاةً وَأَجْرًا ‏\"‏ ‏.‏ \n حَدَّثَنِيهِ ابْنُ أَبِي خَلَفٍ، حَدَّثَنَا رَوْحٌ، ح وَحَدَّثَنَاهُ عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا أَبُو عَاصِمٍ،\n جَمِيعًا عَنِ ابْنِ جُرَيْجٍ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
    "malay_translation": "Aku telah mendengar daripada Harun bin Abdullah dan Hajjaj bin asy-Sya'ir, mereka berdua berkata: Kami telah mendengar daripada Hajjaj bin Muhammad, beliau berkata: Ibn Juraij memberitahu aku daripada Abu az-Zubair bahawa beliau telah mendengar Jabir bin Abdullah berkata: Aku telah mendengar Rasulullah SAW bersabda: \"Sesungguhnya aku hanyalah seorang manusia, dan aku telah membuat perjanjian dengan Tuhanku, Yang Maha Agung dan Maha Mulia, bahawa sesiapa sahaja daripada umat Islam yang aku cela atau tegur, maka hendaklah ia menjadi punca kesucian dan ganjaran baginya.\"  Ibn Abi Khalaf, Rūḥ, Abd bin Humaid dan Abu ‘Āṣim semuanya meriwayatkan daripada Ibn Juraij dengan sanad yang sama."
  },
  {
    "id": 13741,
    "hadith_number": 6464,
    "tajuk_hadith": "Doa Nabi SAW untuk Anak Yatim dan Syarat Baginda dengan Allah SWT",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa ada seorang anak yatim perempuan di sisi Ummu Sulaim (yang merupakan ibu kepada Anas). Rasulullah SAW melihat anak yatim perempuan itu dan berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَأَبُو مَعْنٍ الرَّقَاشِيُّ - وَاللَّفْظُ لِزُهَيْرٍ - قَالاَ حَدَّثَنَا عُمَرُ،\n بْنُ يُونُسَ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، حَدَّثَنَا إِسْحَاقُ بْنُ أَبِي طَلْحَةَ، حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ،\n قَالَ كَانَتْ عِنْدَ أُمِّ سُلَيْمٍ يَتِيمَةٌ وَهِيَ أُمُّ أَنَسٍ فَرَأَى رَسُولُ اللَّهِ صلى الله عليه وسلم الْيَتِيمَةَ\n فَقَالَ ‏\"‏ آنْتِ هِيَهْ لَقَدْ كَبِرْتِ لاَ كَبِرَ سِنُّكِ ‏\"‏ ‏.‏ فَرَجَعَتِ الْيَتِيمَةُ إِلَى أُمِّ سُلَيْمٍ تَبْكِي فَقَالَتْ\n أُمُّ سُلَيْمٍ مَا لَكِ يَا بُنَيَّةُ قَالَتِ الْجَارِيَةُ دَعَا عَلَىَّ نَبِيُّ اللَّهِ صلى الله عليه وسلم أَنْ لاَ يَكْبَرَ\n سِنِّي فَالآنَ لاَ يَكْبَرُ سِنِّي أَبَدًا - أَوْ قَالَتْ قَرْنِي - فَخَرَجَتْ أُمُّ سُلَيْمٍ مُسْتَعْجِلَةً تَلُوثُ خِمَارَهَا\n حَتَّى لَقِيَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم\n ‏\"‏ مَا لَكِ يَا أُمَّ سُلَيْمٍ ‏\"‏ ‏.‏ فَقَالَتْ يَا نَبِيَّ اللَّهِ أَدَعَوْتَ عَلَى يَتِيمَتِي قَالَ ‏\"‏ وَمَا ذَاكِ يَا أُمَّ\n سُلَيْمٍ ‏\"‏ ‏.‏ قَالَتْ زَعَمَتْ أَنَّكَ دَعَوْتَ أَنْ لاَ يَكْبَرَ سِنُّهَا وَلاَ يَكْبَرَ قَرْنُهَا - قَالَ - فَضَحِكَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ ‏\"‏ يَا أُمَّ سُلَيْمٍ أَمَا تَعْلَمِينَ أَنَّ شَرْطِي عَلَى رَبِّي\n أَنِّي اشْتَرَطْتُ عَلَى رَبِّي فَقُلْتُ إِنَّمَا أَنَا بَشَرٌ أَرْضَى كَمَا يَرْضَى الْبَشَرُ وَأَغْضَبُ كَمَا يَغْضَبُ\n الْبَشَرُ فَأَيُّمَا أَحَدٍ دَعَوْتُ عَلَيْهِ مِنْ أُمَّتِي بِدَعْوَةٍ لَيْسَ لَهَا بِأَهْلٍ أَنْ تَجْعَلَهَا لَهُ طَهُورًا وَزَكَاةً\n وَقُرْبَةً يُقَرِّبُهُ بِهَا مِنْهُ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ وَقَالَ أَبُو مَعْنٍ يُتَيِّمَةٌ ‏.‏ بِالتَّصْغِيرِ فِي الْمَوَاضِعِ الثَّلاَثَةِ\n مِنَ الْحَدِيثِ ‏.‏",
    "malay_translation": "Anas bin Malik meriwayatkan bahawa ada seorang anak yatim perempuan tinggal bersama Ummu Sulaim (ibu Anas). Rasulullah SAW melihat anak yatim itu dan berkata, \"Awaklah ini.  Awak sudah besar, tetapi usia awak belum tua.\"  Anak yatim itu pulang kepada Ummu Sulaim sambil menangis. Ummu Sulaim bertanya, \"Ada apa gerangan, anakku?\"  Gadis itu menjawab, \"Nabi Allah SAW mendoakan agar saya tidak tua, jadi sekarang saya tidak akan tua selama-lamanya, atau beliau berkata, sepanjang hayat saya.\" Ummu Sulaim bergegas menemui Rasulullah SAW sambil menutup kepalanya.  Rasulullah SAW bertanya, \"Ada apa gerangan, wahai Ummu Sulaim?\"  Ummu Sulaim menjawab, \"Wahai Nabi Allah, adakah tuan mendoakan anak yatim saya?\"  Baginda bertanya, \"Apakah yang berlaku, wahai Ummu Sulaim?\" Ummu Sulaim berkata, \"Dia mendakwa tuan mendoakan agar dia tidak tua dan tidak bertambah usia.\"  Rasulullah SAW tersenyum dan berkata, \"Wahai Ummu Sulaim, tahukah engkau bahawa aku telah membuat perjanjian dengan Tuhanku? Aku telah membuat perjanjian dengan Tuhanku, dan aku berkata, 'Sesungguhnya aku hanyalah manusia biasa. Aku gembira seperti mana manusia lain gembira, dan aku marah seperti mana manusia lain marah.'  Oleh itu, sesiapa sahaja daripada umatku yang aku doakan dengan doa yang tidak sepatutnya untuknya, maka jadikanlah doa itu sebagai penyucian dan pembersihan serta sebagai satu kebaikan yang mendekatkannya kepada-Mu pada hari kiamat.\" Abu Ma'an berkata, 'Yatim' (dengan bentuk kecil) digunakan pada tiga tempat dalam hadis ini."
  },
  {
    "id": 13742,
    "hadith_number": 6465,
    "tajuk_hadith": "Doa Rasulullah SAW terhadap Orang yang Tidak Menghiraukan Panggilan",
    "perawi_melayu": "Ibnu Abbas meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ، ح وَحَدَّثَنَا ابْنُ بَشَّارٍ، - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى -\n قَالاَ حَدَّثَنَا أُمَيَّةُ بْنُ خَالِدٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي حَمْزَةَ الْقَصَّابِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كُنْتُ\n أَلْعَبُ مَعَ الصِّبْيَانِ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَتَوَارَيْتُ خَلْفَ بَابٍ - قَالَ -\n فَجَاءَ فَحَطَأَنِي حَطْأَةً وَقَالَ ‏\"‏ اذْهَبْ وَادْعُ لِي مُعَاوِيَةَ ‏\"‏ ‏.‏ قَالَ فَجِئْتُ فَقُلْتُ هُوَ يَأْكُلُ\n - قَالَ - ثُمَّ قَالَ لِيَ ‏\"‏ اذْهَبْ وَادْعُ لِي مُعَاوِيَةَ ‏\"‏ ‏.‏ قَالَ فَجِئْتُ فَقُلْتُ هُوَ يَأْكُلُ فَقَالَ ‏\"‏\n لاَ أَشْبَعَ اللَّهُ بَطْنَهُ ‏\"‏ ‏.‏ قَالَ ابْنُ الْمُثَنَّى قُلْتُ لأُمَيَّةَ مَا حَطَأَنِي قَالَ قَفَدَنِي قَفْدَةً ‏.‏",
    "malay_translation": "Kami diberitakan oleh Muhammad bin Muthanna Al-'Anzi, dan kami juga diberitakan oleh Ibnu Bashshar - dan lafaznya adalah daripada Ibnu Muthanna - mereka berdua berkata: Kami diberitakan oleh Umayyah bin Khalid, yang telah meriwayatkan daripada Syu'bah, daripada Abi Hamza Al-Qassab, daripada Ibnu Abbas, katanya: Aku sedang bermain dengan kanak-kanak, lalu tiba Rasulullah SAW, maka aku bersembunyi di belakang pintu. Baginda datang, lalu menepuk bahuku dan bersabda: \"Pergilah dan panggil Mu'awiyah untukku.\" Aku pun pergi lalu berkata: \"Dia sedang makan.\" Kemudian Baginda menyuruhku lagi: \"Pergilah dan panggil Mu'awiyah untukku.\" Aku pergi dan kembali lalu berkata: \"Dia sedang makan.\" Maka Baginda bersabda: \"Semoga Allah SWT tidak mengenyangkan perutnya!\" Ibnu Muthanna berkata: Aku bertanya kepada Umayyah: Apakah maksud 'Hataani'? Katanya: Maksudnya 'menepukku'."
  },
  {
    "id": 13743,
    "hadith_number": 6466,
    "tajuk_hadith": "Kisah Ibnu Abbas Bermain dan Bersembunyi daripada Rasulullah SAW",
    "perawi_melayu": "Daripada Ibnu Abbas",
    "english_text": "This hadith has been transmitted on the authority of Ibn Abbas with a slight variation of wording.",
    "arabic_text": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنَا أَبُو\n حَمْزَةَ سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ كُنْتُ أَلْعَبُ مَعَ الصِّبْيَانِ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم فَاخْتَبَأْتُ مِنْهُ ‏.‏ فَذَكَرَ بِمِثْلِهِ ‏.‏",
    "malay_translation": "Aku telah mendengar daripada Ishaq bin Mansur, yang memberitakan kepada kami daripada An Nadhr bin Syumayl, yang menceritakan kepada kami daripada Syu'bah, yang memberitakan kepada kami daripada Abu Hamza, bahawa beliau mendengar Ibnu Abbas berkata: \"Aku bermain dengan kanak-kanak, maka datanglah Rasulullah SAW, lalu aku bersembunyi daripada baginda.\" Kemudian (perawi) menyebut sesuatu yang serupa."
  },
  {
    "id": 13744,
    "hadith_number": 6467,
    "tajuk_hadith": "Orang Bermuka Dua",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The worst amongst the people is the double-faced one; he comes to some people with one face and to others with the other face.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ \n أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ مِنْ شَرِّ النَّاسِ ذَا الْوَجْهَيْنِ\n الَّذِي يَأْتِي هَؤُلاَءِ بِوَجْهٍ وَهَؤُلاَءِ بِوَجْهٍ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Abu Hurairah, Rasulullah SAW bersabda:  \"Sesungguhnya di antara manusia yang paling jahat ialah orang yang bermuka dua; iaitu orang yang datang kepada sekelompok manusia dengan satu wajah dan kepada sekelompok manusia yang lain dengan wajah yang lain.\""
  },
  {
    "id": 13745,
    "hadith_number": 6468,
    "tajuk_hadith": "Orang Bermuka Dua",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa baginda Rasulullah SAW bersabda:",
    "english_text": "The worst amongst people is one with the double face. He comes to some people with one face and to others with the other face.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ \n يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عِرَاكِ بْنِ مَالِكٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله\n عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ شَرَّ النَّاسِ ذُو الْوَجْهَيْنِ الَّذِي يَأْتِي هَؤُلاَءِ بِوَجْهٍ وَهَؤُلاَءِ بِوَجْهٍ\n ‏\"‏ ‏.‏",
    "malay_translation": "Sesungguhnya seburuk-buruk manusia ialah orang yang bermuka dua, iaitu orang yang datang kepada segolongan manusia dengan satu wajah dan kepada segolongan manusia yang lain dengan wajah yang lain."
  },
  {
    "id": 13746,
    "hadith_number": 6469,
    "tajuk_hadith": "Orang Bermuka Dua",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "You will find the worst amongst the people one having double face. He comes to some people with one face and to the others with the other face.",
    "arabic_text": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنِي ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي \n سَعِيدُ بْنُ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ح \n وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عُمَارَةَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ،\n قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ تَجِدُونَ مِنْ شَرِّ النَّاسِ ذَا الْوَجْهَيْنِ الَّذِي يَأْتِي\n هَؤُلاَءِ بِوَجْهٍ وَهَؤُلاَءِ بِوَجْهٍ ‏\"‏ ‏.‏",
    "malay_translation": "Kamu akan mendapati di antara manusia yang paling teruk ialah orang yang bermuka dua.  Dia datang kepada sekelompok orang dengan satu wajah dan kepada kelompok yang lain dengan wajah yang berlainan."
  },
  {
    "id": 13747,
    "hadith_number": 6470,
    "tajuk_hadith": "Kebebasan Berbohong dalam Tiga Keadaan",
    "perawi_melayu": "Humaid bin Abdur Rahman bin Auf meriwayatkan bahawa ibunya, Ummu Kulthum binti Uqbah bin Abi Mu'ait, seorang daripada golongan Muhajirin awal yang telah memberi bai'ah kepada Rasulullah SAW, telah memberitahu bahawa beliau mendengar Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي \n حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّ أُمَّهُ أُمَّ كُلْثُومٍ بِنْتَ عُقْبَةَ بْنِ أَبِي مُعَيْطٍ، وَكَانَتْ، مِنَ الْمُهَاجِرَاتِ\n الأُوَلِ اللاَّتِي بَايَعْنَ النَّبِيَّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صلى الله\n عليه وسلم وَهُوَ يَقُولُ ‏\n\"‏ لَيْسَ الْكَذَّابُ الَّذِي يُصْلِحُ بَيْنَ النَّاسِ وَيَقُولُ خَيْرًا وَيَنْمِي خَيْرًا\n ‏\"‏ ‏.‏ قَالَ ابْنُ شِهَابٍ وَلَمْ أَسْمَعْ يُرَخَّصُ فِي شَىْءٍ مِمَّا يَقُولُ النَّاسُ كَذِبٌ إِلاَّ فِي ثَلاَثٍ\n الْحَرْبُ وَالإِصْلاَحُ بَيْنَ النَّاسِ وَحَدِيثُ الرَّجُلِ امْرَأَتَهُ وَحَدِيثُ الْمَرْأَةِ زَوْجَهَا ‏.‏",
    "malay_translation": "Harmalah bin Yahya telah meriwayatkan dari Ibn Wahb, yang meriwayatkan dari Yunus, dari Ibn Syihab, yang meriwayatkan dari Humaid bin Abdur Rahman bin Auf, bahawa ibunya, Ummu Kulthum binti Uqbah bin Abi Mu'ait, yang merupakan salah seorang daripada golongan Muhajirin awal yang telah memberi bai'ah kepada Nabi SAW, telah memberitahu bahawa beliau mendengar Rasulullah SAW bersabda: \"Bukanlah pendusta orang yang mendamaikan di antara manusia dan berkata baik serta menyampaikan kebaikan.\" Ibn Syihab berkata: \"Aku tidak pernah mendengar diharuskan sesuatu daripada apa yang dikatakan oleh manusia sebagai dusta melainkan dalam tiga perkara: peperangan, mendamaikan di antara manusia, dan percakapan seorang lelaki kepada isterinya, dan percakapan seorang perempuan kepada suaminya.\""
  },
  {
    "id": 13748,
    "hadith_number": 6471,
    "tajuk_hadith": "Perbezaan Ringkas Dalam Sanad Hadis",
    "perawi_melayu": "Ibn Shihab dan sanad yang sama",
    "english_text": "This hadith has been narrated on the authority of Ibn Shihab with the same chain of transmitters but with a slight variation of wording.",
    "arabic_text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ،\n حَدَّثَنَا مُحَمَّدُ بْنُ مُسْلِمِ بْنِ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ شِهَابٍ، بِهَذَا الإِسْنَادِ ‏.‏ مِثْلَهُ غَيْرَ أَنَّفِي حَدِيثِ صَالِحٍ وَقَالَتْ وَلَمْ أَسْمَعْهُ يُرَخِّصُ فِي شَىْءٍ مِمَّا يَقُولُ النَّاسُ إِلاَّ فِي ثَلاَثٍ\n ‏.‏ بِمِثْلِ مَا جَعَلَهُ يُونُسُ مِنْ قَوْلِ ابْنِ شِهَابٍ ‏.‏",
    "malay_translation": "Hadis ini telah diriwayatkan daripada Ibn Shihab dengan sanad periwayat yang sama, tetapi dengan sedikit perbezaan lafaz."
  },
  {
    "id": 13749,
    "hadith_number": 6472,
    "tajuk_hadith": "Riwayat Zuhri dengan sedikit perbezaan lafaz",
    "perawi_melayu": "Amru An-Naqid melalui Isma'il bin Ibrahim daripada Ma'mar daripada Zuhri",
    "english_text": "This hadith has been transmitted on the authority of Zuhri with a slight variation of wording.",
    "arabic_text": "وَحَدَّثَنَاهُ عَمْرٌو النَّاقِدُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ،\n بِهَذَا الإِسْنَادِ إِلَى قَوْلِهِ ‏\n\"‏ وَنَمَى خَيْرًا ‏\"‏ ‏.‏ وَلَمْ يَذْكُرْ مَا بَعْدَهُ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Zuhri dengan sedikit perbezaan lafaz.  (Amru An-Naqid meriwayatkan daripada Isma'il bin Ibrahim, yang meriwayatkan daripada Ma'mar, yang meriwayatkan daripada Zuhri,  dengan sanad ini sehingga kepada perkataan  \"dan dia membesar dengan baik\".  Dia tidak menyebut apa yang selepasnya.)"
  },
  {
    "id": 13750,
    "hadith_number": 6473,
    "tajuk_hadith": "Fitnah dan Kejujuran",
    "perawi_melayu": "Abdullah bin Mas'ud meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Should I inform you that slandering, that is in fact a tale-carrying which creates dissension amongst people, (and) he (further) said: The person tells the truth until he is recorded as truthful, and lie tells a lie until lie is recorded as a liar.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، سَمِعْتُ \n أَبَا إِسْحَاقَ، يُحَدِّثُ عَنْ أَبِي الأَحْوَصِ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ إِنَّ مُحَمَّدًا صلى الله\n عليه وسلم قَالَ ‏\"‏ أَلاَ أُنَبِّئُكُمْ مَا الْعَضْهُ هِيَ النَّمِيمَةُ الْقَالَةُ بَيْنَ النَّاسِ ‏\"‏ ‏.‏ وَإِنَّ مُحَمَّدًا صلى\n الله عليه وسلم قَالَ ‏\"‏ إِنَّ الرَّجُلَ يَصْدُقُ حَتَّى يُكْتَبَ صِدِّيقًا وَيَكْذِبُ حَتَّى يُكْتَبَ كَذَّابًا ‏\"‏\n ‏.‏",
    "malay_translation": "Patutkah aku beritahu kamu apakah fitnah itu? Ia ialah mengumpat, iaitu menyebarkan cerita yang menimbulkan perselisihan di kalangan manusia.  Rasulullah SAW juga bersabda:  Sesungguhnya seseorang itu akan terus berkata benar sehingga dia dicatat sebagai orang yang benar, dan dia akan terus berdusta sehingga dia dicatat sebagai pendusta."
  },
  {
    "id": 13751,
    "hadith_number": 6474,
    "tajuk_hadith": "Kesungguhan dan Kejujuran Menuju Syurga, Kepalsuan Menuju Neraka",
    "perawi_melayu": "Abdullah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Truth leads one to Paradise and virtue leads one to Paradise and the person tells the truth until he is recorded as truthful, and lie leads to obscenity and obscenity leads to Hell, and the person tells a lie until he is recorded as a liar.",
    "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ\n أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ الصِّدْقَ يَهْدِي إِلَى الْبِرِّ وَإِنَّ الْبِرَّ يَهْدِي إِلَى الْجَنَّةِ وَإِنَّ الرَّجُلَ\n لَيَصْدُقُ حَتَّى يُكْتَبَ صِدِّيقًا وَإِنَّ الْكَذِبَ يَهْدِي إِلَى الْفُجُورِ وَإِنَّ الْفُجُورَ يَهْدِي إِلَى النَّارِ وَإِنَّ\n الرَّجُلَ لَيَكْذِبُ حَتَّى يُكْتَبَ كَذَّابًا ‏\"‏ ‏.‏",
    "malay_translation": "Sesungguhnya kejujuran membawa kepada kebaikan, dan kebaikan membawa kepada syurga.  Seseorang itu sentiasa berkata benar sehingga dia dicatatkan sebagai orang yang benar.  Dan sesungguhnya kepalsuan membawa kepada kefajaran, dan kefajaran membawa kepada neraka. Seseorang itu sentiasa berdusta sehingga dia dicatatkan sebagai pendusta."
  },
  {
    "id": 13752,
    "hadith_number": 6475,
    "tajuk_hadith": "Kejujuran dan Jalan ke Syurga",
    "perawi_melayu": "Abdullah bin Mas'ud meriwayatkan daripada Rasulullah SAW:",
    "english_text": "Telling of truth is a virtue and virtue leads to Paradise and the servant who endeavours to tell the truth is recorded as truthful, and lie is obscenity and obscenity leads to Hell-Fire, and the servant who endeavours to tell a lie is recorded as a liar. Ibn Abu Shaiba reported this from Allah's Apostle (ﷺ).",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَهَنَّادُ بْنُ السَّرِيِّ، قَالاَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ \n مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n ‏\n\"‏ إِنَّ الصِّدْقَ بِرٌّ وَإِنَّ الْبِرَّ يَهْدِي إِلَى الْجَنَّةِ وَإِنَّ الْعَبْدَ لَيَتَحَرَّى الصِّدْقَ حَتَّى يُكْتَبَ عِنْدَ اللَّهِ\n صِدِّيقًا وَإِنَّ الْكَذِبَ فُجُورٌ وَإِنَّ الْفُجُورَ يَهْدِي إِلَى النَّارِ وَإِنَّ الْعَبْدَ لَيَتَحَرَّى الْكَذِبَ حَتَّى يُكْتَبَ\n كَذَّابًا ‏\"‏ ‏.‏ قَالَ ابْنُ أَبِي شَيْبَةَ فِي رِوَايَتِهِ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Sesungguhnya kejujuran itu adalah kebaikan, dan kebaikan membawa ke syurga.  Sesungguhnya seorang hamba itu akan berusaha untuk sentiasa benar sehingga dia dicatat di sisi Allah sebagai orang yang benar. Dan sesungguhnya dusta itu adalah kefajaran, dan kefajaran membawa ke neraka. Sesungguhnya seorang hamba itu akan berusaha untuk berdusta sehingga dia dicatat sebagai pendusta.”  (Riwayat Ibn Abu Syaibah daripada Rasulullah SAW)."
  },
  {
    "id": 13753,
    "hadith_number": 6476,
    "tajuk_hadith": "Kepentingan Bercakap Benar dan Bahaya Berbohong",
    "perawi_melayu": "'Abdullah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "It is obligatory for you to tell the truth, for truth leads to virtue and virtue leads to Paradise, and the man who continues to speak the truth and endeavours to tell the truth is eventually recorded as truthful with Allah, and beware of telling of a lie for telling of a lie leads to obscenity and obscenity leads to Hell-Fire, and the person who keeps telling lies and endeavours to tell a lie is recorded as a liar with Allah.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَوَكِيعٌ، قَالاَ حَدَّثَنَا الأَعْمَشُ،\n ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الأَعْمَشُ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ عَلَيْكُمْ بِالصِّدْقِ فَإِنَّ الصِّدْقَ يَهْدِي إِلَى الْبِرِّ وَإِنَّ الْبِرَّ\n يَهْدِي إِلَى الْجَنَّةِ وَمَا يَزَالُ الرَّجُلُ يَصْدُقُ وَيَتَحَرَّى الصِّدْقَ حَتَّى يُكْتَبَ عِنْدَ اللَّهِ صِدِّيقًا وَإِيَّاكُمْ\n وَالْكَذِبَ فَإِنَّ الْكَذِبَ يَهْدِي إِلَى الْفُجُورِ وَإِنَّ الْفُجُورَ يَهْدِي إِلَى النَّارِ وَمَا يَزَالُ الرَّجُلُ يَكْذِبُ\n وَيَتَحَرَّى الْكَذِبَ حَتَّى يُكْتَبَ عِنْدَ اللَّهِ كَذَّابًا ‏\"‏ ‏.‏",
    "malay_translation": "Wahai umatku, hendaklah kamu semua mengamalkan kejujuran, kerana kejujuran membawa kepada kebaikan, dan kebaikan membawa kepada syurga. Seseorang yang sentiasa berkata benar dan berusaha untuk bercakap benar akan dicatat sebagai orang yang benar di sisi Allah.  Dan jauhilah kamu daripada berbohong, kerana berbohong membawa kepada kejahatan, dan kejahatan membawa kepada neraka.  Seseorang yang sentiasa berbohong dan berusaha untuk berbohong akan dicatat sebagai pendusta di sisi Allah."
  },
  {
    "id": 13754,
    "hadith_number": 6477,
    "tajuk_hadith": "Usaha Mencari Kebenaran dan Kesahihan",
    "perawi_melayu": "Hadis ini diriwayatkan daripada al-A'mash melalui beberapa sanad.  Hadis daripada 'Isa bin Yunus tidak menyebut frasa \"dan berusaha mencari kebenaran dan berusaha mencari kepalsuan\".  Manakala hadis daripada Ibnu Mushir menyebut frasa \"sehingga Allah SWT mencatatnya\".",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مِنْجَابُ بْنُ الْحَارِثِ التَّمِيمِيُّ، أَخْبَرَنَا ابْنُ مُسْهِرٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ،\n إِبْرَاهِيمَ الْحَنْظَلِيُّ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، كِلاَهُمَا عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ ‏.‏ وَلَمْ يَذْكُرْ\n فِي حَدِيثِ عِيسَى ‏\"‏ وَيَتَحَرَّى الصِّدْقَ وَيَتَحَرَّى الْكَذِبَ ‏\"‏ ‏.‏ وَفِي حَدِيثِ ابْنِ مُسْهِرٍ ‏\"‏ حَتَّى\n يَكْتُبَهُ اللَّهُ ‏\"‏ ‏.‏",
    "malay_translation": "Kami diberitakan oleh Minjab bin al-Harits al-Tamimi, yang memberitakan kepada kami Ibnu Mushir, dan kami diberitakan oleh Ishaq bin Ibrahim al-Hanthali, yang memberitakan kepada kami 'Isa bin Yunus. Keduanya daripada al-A'mash dengan sanad yang sama.  Namun, dalam hadis riwayat 'Isa tidak disebut, \"dan dia berusaha mencari kebenaran dan dia berusaha mencari kepalsuan\".  Dan dalam hadis riwayat Ibnu Mushir disebut, \"sehingga Allah SWT mencatatnya\"."
  },
  {
    "id": 13755,
    "hadith_number": 6478,
    "tajuk_hadith": "Definisi Orang Yang Sabar dan Kuat Mengawal Diri",
    "perawi_melayu": "Abdullah bin Mas'ud meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، - وَاللَّفْظُ لِقُتَيْبَةَ - قَالاَ حَدَّثَنَا جَرِيرٌ،\n عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنِ الْحَارِثِ بْنِ سُوَيْدٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ قَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا تَعُدُّونَ الرَّقُوبَ فِيكُمْ ‏\"‏ ‏.‏ قَالَ قُلْنَا الَّذِي لاَ يُولَدُ\n لَهُ ‏.‏ قَالَ ‏\"‏ لَيْسَ ذَاكَ بِالرَّقُوبِ وَلَكِنَّهُ الرَّجُلُ الَّذِي لَمْ يُقَدِّمْ مِنْ وَلَدِهِ شَيْئًا ‏\"‏ ‏.‏ قَالَ ‏\"‏ فَمَا\n تَعُدُّونَ الصُّرَعَةَ فِيكُمْ ‏\"‏ ‏.‏ قَالَ قُلْنَا الَّذِي لاَ يَصْرَعُهُ الرِّجَالُ ‏.‏ قَالَ ‏\"‏ لَيْسَ بِذَلِكَ وَلَكِنَّهُ\n الَّذِي يَمْلِكُ نَفْسَهُ عِنْدَ الْغَضَبِ ‏\"‏ ‏.‏",
    "malay_translation": "Kami diberitahu oleh Qotaibah bin Sa'id dan Uthman bin Abi Syaibah – dan lafaznya daripada Qotaibah – mereka berdua berkata: Kami diberitahu oleh Jarir, daripada Al-A'masy, daripada Ibrahim Al-Taymi, daripada Al-Harith bin Suwaid, daripada Abdullah bin Mas'ud, bahawa Rasulullah SAW bersabda: \"Siapakah yang kamu anggap sebagai orang yang sabar di kalangan kamu?\"  Mereka menjawab: \"Orang yang tidak mempunyai anak.\" Baginda bersabda:  \"Bukanlah itu orang yang sabar, tetapi orang yang sabar ialah orang yang tidak mendahului anak-anaknya (dalam kebaikan di akhirat).\" Baginda kemudian bersabda: \"Siapakah yang kamu anggap sebagai orang yang kuat di kalangan kamu?\" Mereka menjawab: \"Orang yang dapat mengalahkan orang lain dalam pergelutan.\" Baginda bersabda: \"Bukan begitu, tetapi orang yang kuat ialah orang yang dapat mengawal dirinya ketika marah.\""
  },
  {
    "id": 13756,
    "hadith_number": 6479,
    "tajuk_hadith": "Hadis Diriwayatkan oleh Al-A'mash dengan Sanad yang Sama",
    "perawi_melayu": "Abu Bakar bin Abi Syaibah, Abu Kuraib, Abu Muawiyah, Ishaq bin Ibrahim, dan Isa bin Yunus meriwayatkan dari Al-A'mash.",
    "english_text": "This hadith has been narrated on the authority of A'mash with the same chain of transmitters.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا إِسْحَاقُ،\n بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، كِلاَهُمَا عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ مِثْلَ مَعْنَاهُ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan melalui sanad yang sama daripada Al-A'mash.  Abu Bakar bin Abi Syaibah dan Abu Kuraib berkata:  Mereka meriwayatkan daripada Abu Muawiyah, dan Ishaq bin Ibrahim memberitahu kami (bahawa) Isa bin Yunus meriwayatkan daripada Al-A'mash dengan maksud yang sama melalui sanad ini."
  },
  {
    "id": 13757,
    "hadith_number": 6480,
    "tajuk_hadith": "Kekuatan Sejati Adalah Mengawal Amarah",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The strong-man is not one who wrestles well but the strong man is one who controls himself when he is in a fit of rage.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَعَبْدُ الأَعْلَى بْنُ حَمَّادٍ، قَالاَ كِلاَهُمَا قَرَأْتُ عَلَى مَالِكٍ\n عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم\n قَالَ ‏\n\"‏ لَيْسَ الشَّدِيدُ بِالصُّرَعَةِ إِنَّمَا الشَّدِيدُ الَّذِي يَمْلِكُ نَفْسَهُ عِنْدَ الْغَضَبِ ‏\"‏ ‏.‏",
    "malay_translation": "Bukanlah orang yang kuat itu ialah orang yang pandai bergusti, tetapi orang yang kuat itu ialah orang yang dapat mengawal dirinya ketika marah."
  },
  {
    "id": 13758,
    "hadith_number": 6481,
    "tajuk_hadith": "Kekuatan Seseorang: Mengawal Amarah",
    "perawi_melayu": "Abu Hurairah meriwayatkan:",
    "english_text": "I heard Allah's Messenger (ﷺ) as saying: One is not strong because of one's wrestling skillfully. They said: Allah's Messenger, then who is strong? He said: He who controls his anger when he is in a fit of rage.",
    "arabic_text": "حَدَّثَنَا حَاجِبُ بْنُ الْوَلِيدِ، حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، عَنِ الزُّبَيْدِيِّ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي \n حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ\n ‏\"‏ لَيْسَ الشَّدِيدُ بِالصُّرَعَةِ ‏\"‏ ‏.‏ قَالُوا فَالشَّدِيدُ أَيُّمَ هُوَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الَّذِي يَمْلِكُ نَفْسَهُ\n عِنْدَ الْغَضَبِ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda: \"Bukanlah orang yang kuat itu kerana kemahirannya dalam bergusti.\" Mereka bertanya: \"Wahai Rasulullah, maka siapakah orang yang kuat itu?\" Baginda menjawab: \"Orang yang mampu mengawal dirinya ketika marah.\""
  },
  {
    "id": 13759,
    "hadith_number": 6482,
    "tajuk_hadith": "Sanad Hadith daripada Abu Hurairah",
    "perawi_melayu": "Muhammad bin Rafi', Abd bin Humaid, Abdurrazzaq, Ma'mar, Abdullah bin Abdurrahman bin Bahram, Abu al-Yaman, dan Shu'aib; Zuhri; Humaid bin Abdurrahman bin Auf; Abu Hurairah; Nabi SAW.",
    "english_text": "This hadith has been reported on the authority of Abu Huraira through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، جَمِيعًا عَنْ عَبْدِ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ،\n ح وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ بَهْرَامَ، أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، كِلاَهُمَا\n عَنِ الزُّهْرِيِّ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه\n وسلم بِمِثْلِهِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan melalui sanad yang lain daripada Abu Hurairah.  Perawi hadis ini termasuklah Muhammad bin Rafi', Abd bin Humaid (kedua-duanya daripada Abdurrazzaq), Ma'mar, Abdullah bin Abdurrahman bin Bahram (daripada Abu al-Yaman dan Shu'aib), Zuhri, Humaid bin Abdurrahman bin Auf, dan akhirnya daripada Abu Hurairah daripada Nabi SAW."
  },
  {
    "id": 13760,
    "hadith_number": 6483,
    "tajuk_hadith": "Mencari perlindungan daripada Allah daripada syaitan yang dilaknat.",
    "perawi_melayu": "Sulaiman bin Surad",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَمُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ ابْنُ الْعَلاَءِ،\n حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ سُلَيْمَانَ بْنِ صُرَدٍ، قَالَ اسْتَبَّ رَجُلاَنِ\n عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَجَعَلَ أَحَدُهُمَا تَحْمَرُّ عَيْنَاهُ وَتَنْتَفِخُ أَوْدَاجُهُ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنِّي لأَعْرِفُ كَلِمَةً لَوْ قَالَهَا لَذَهَبَ عَنْهُ الَّذِي يَجِدُ أَعُوذُ بِاللَّهِ\n مِنَ الشَّيْطَانِ الرَّجِيمِ ‏\"‏ ‏.‏ فَقَالَ الرَّجُلُ وَهَلْ تَرَى بِي مِنْ جُنُونٍ قَالَ ابْنُ الْعَلاَءِ فَقَالَ وَهَلْ\n تَرَى ‏.‏ وَلَمْ يَذْكُرِ الرَّجُلَ",
    "malay_translation": "Telah menceritakan kepada kami Yahya bin Yahya dan Muhammad bin al-Ala', Yahya berkata: telah menceritakan kepada kami dan Ibn al-Ala' berkata: Telah menceritakan kepada kami Abu Muawiyah, dari al-A'masy, dari 'Adi bin Tsabit, dari Sulaiman bin Surad, dia berkata: Dua orang lelaki bertengkar di sisi Nabi ﷺ, lalu salah seorang daripada mereka matanya merah padam dan urat lehernya membengkak.  Maka Rasulullah ﷺ bersabda:\n\"Sesungguhnya aku mengetahui satu kalimah, sekiranya dia mengucapkannya nescaya hilanglah kemarahannya:  Aku berlindung kepada Allah daripada syaitan yang dilaknat.\"  Lalu lelaki itu berkata: \"Adakah engkau melihat aku seperti orang gila?\"  Ibn al-Ala' berkata:  Lalu dia bertanya:  \"Adakah engkau melihat?\"  (Ibn al-Ala' tidak menyebut nama lelaki itu)."
  },
  {
    "id": 13761,
    "hadith_number": 6484,
    "tajuk_hadith": "Mencari perlindungan daripada syaitan yang dilaknat ketika marah",
    "perawi_melayu": "Sulaiman bin Surad meriwayatkan bahawa dua orang lelaki bertengkar di hadapan Rasulullah SAW, dan salah seorang daripada mereka menjadi marah dan mukanya merah. Rasulullah SAW melihatnya dan berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا أَبُو أُسَامَةَ، سَمِعْتُ الأَعْمَشَ، يَقُولُ سَمِعْتُ \n عَدِيَّ بْنَ ثَابِتٍ، يَقُولُ حَدَّثَنَا سُلَيْمَانُ بْنُ صُرَدٍ، قَالَ اسْتَبَّ رَجُلاَنِ عِنْدَ النَّبِيِّ صلى الله عليه\n وسلم فَجَعَلَ أَحَدُهُمَا يَغْضَبُ وَيَحْمَرُّ وَجْهُهُ فَنَظَرَ إِلَيْهِ النَّبِيُّ صلى الله عليه وسلم فَقَالَ\n ‏\"‏ إِنِّي لأَعْلَمُ كَلِمَةً لَوْ قَالَهَا لَذَهَبَ ذَا عَنْهُ أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ ‏\"‏ ‏.‏ فَقَامَ إِلَى\n الرَّجُلِ رَجُلٌ مِمَّنْ سَمِعَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ أَتَدْرِي مَا قَالَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم آنِفًا قَالَ ‏\"‏ إِنِّي لأَعْلَمُ كَلِمَةً لَوْ قَالَهَا لَذَهَبَ ذَا عَنْهُ أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ\n الرَّجِيمِ ‏\"‏ ‏.‏ فَقَالَ لَهُ الرَّجُلُ أَمَجْنُونًا تَرَانِي",
    "malay_translation": "Nasr bin Ali al-Jahdami telah meriwayatkan daripada Abu Usamah, bahawa aku telah mendengar al-A'mas berkata, aku telah mendengar Adi bin Thabit berkata, Sulaiman bin Surad berkata: Dua orang lelaki bertengkar di hadapan Nabi SAW, dan salah seorang daripada mereka marah lalu mukanya menjadi merah. Nabi SAW memandangnya lalu berkata: \"Sesungguhnya aku mengetahui satu kalimah, sekiranya ia mengucapkannya nescaya akan hilang kemarahannya iaitu:  'Aku berlindung kepada Allah daripada syaitan yang dilaknat.'\"  Kemudian seorang lelaki yang mendengar perkataan Nabi SAW menghampiri lelaki itu dan bertanya: \"Adakah engkau tahu apa yang telah dikatakan oleh Rasulullah SAW sebentar tadi?\" Lelaki itu menjawab: \"Sesungguhnya aku mengetahui satu kalimah, sekiranya ia mengucapkannya nescaya akan hilang kemarahannya iaitu: 'Aku berlindung kepada Allah daripada syaitan yang dilaknat.'\"  Lelaki itu kemudian bertanya kepadanya: \"Adakah engkau menganggap aku gila?\" "
  },
  {
    "id": 13762,
    "hadith_number": 6485,
    "tajuk_hadith": "Sanad Hadith yang Sama",
    "perawi_melayu": "Abu Bakar bin Abi Syaibah melalui Hafs bin Ghiyas daripada Al-A'masy",
    "english_text": "This hadith has been reported on the authority of A'mash with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ\n ‏.‏",
    "malay_translation": "Hadith ini telah diriwayatkan daripada Al-A'masy melalui sanad yang sama."
  },
  {
    "id": 13763,
    "hadith_number": 6486,
    "tajuk_hadith": "Penciptaan Adam dan Sifat Manusia",
    "perawi_melayu": "Anas meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "When Allah fashioned Adam in Paradise, He left him as He liked him to leave. Then Iblis roamed round him to see what actually that was and when he found him hollow from within, he recognised that he had been created with a disposition that he would not have control over himself.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ \n ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَمَّا صَوَّرَ اللَّهُ آدَمَ فِي الْجَنَّةِ\n تَرَكَهُ مَا شَاءَ اللَّهُ أَنْ يَتْرُكَهُ فَجَعَلَ إِبْلِيسُ يُطِيفُ بِهِ يَنْظُرُ مَا هُوَ فَلَمَّا رَآهُ أَجْوَفَ عَرَفَ\n أَنَّهُ خُلِقَ خَلْقًا لاَ يَتَمَالَكُ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila Allah SWT membentuk Adam di syurga, Allah membiarkannya sebagaimana yang dikehendaki-Nya.  Kemudian Iblis mengelilinginya untuk melihat keadaan Adam. Setelah melihat kelemahan batin Adam, Iblis menyedari bahawa Adam diciptakan dengan sifat yang tidak mampu mengawal dirinya sendiri."
  },
  {
    "id": 13764,
    "hadith_number": 6487,
    "tajuk_hadith": "Hadis yang serupa melalui sanad yang sama",
    "perawi_melayu": "Humaid melalui sanad yang sama",
    "english_text": "A hadith like this has been narrated on the authority of Humaid with the same chain of transmitters.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ نَافِعٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا حَمَّادٌ، بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏",
    "malay_translation": "Hadis yang serupa telah diriwayatkan daripada Humaid dengan sanad yang sama."
  },
  {
    "id": 13765,
    "hadith_number": 6488,
    "tajuk_hadith": "Menghindari Memukul Muka Ketika Bergaduh",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "When any one of you fights with his brother he should avoid striking at the face.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا الْمُغِيرَةُ، - يَعْنِي الْحِزَامِيَّ - عَنِ أَبِي،\n الزِّنَادِ عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا قَاتَلَ\n أَحَدُكُمْ أَخَاهُ فَلْيَجْتَنِبِ الْوَجْهَ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila seseorang daripada kamu bergaduh dengan saudaranya, hendaklah dia mengelakkan daripada memukul muka."
  },
  {
    "id": 13766,
    "hadith_number": 6489,
    "tajuk_hadith": "Larangan Memukul Muka",
    "perawi_melayu": "Hadis ini diriwayatkan melalui Abu Zinad, yang menyatakan:",
    "english_text": "\" When one amongst you strikes (at the face).\"",
    "arabic_text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي الزِّنَادِ،\n بِهَذَا الإِسْنَادِ وَقَالَ ‏\n\"‏ إِذَا ضَرَبَ أَحَدُكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Amru An-Naqid dan Zuhair bin Harb, mereka berkata: Kami telah mendengar daripada Sufyan bin Uyainah daripada Abu Zinad, melalui sanad ini, beliau berkata:  \"Apabila salah seorang daripada kamu memukul…\""
  },
  {
    "id": 13767,
    "hadith_number": 6490,
    "tajuk_hadith": "Menjaga Muka Semasa Bergaduh",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "When any one of you fights with his brother, he should spare his face.",
    "arabic_text": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ،\n عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا قَاتَلَ أَحَدُكُمْ أَخَاهُ فَلْيَتَّقِ الْوَجْهَ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila seseorang daripada kamu bergaduh dengan saudaranya, maka hendaklah dia menjaga muka (jangan dihentam)."
  },
  {
    "id": 13768,
    "hadith_number": 6491,
    "tajuk_hadith": "Larangan Menampar Muka Semasa Bergaduh",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "When any one of you fights with his brother, he should not slap at the face.",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، سَمِعَ أَبَا،\n أَيُّوبَ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا قَاتَلَ أَحَدُكُمْ\n أَخَاهُ فَلاَ يَلْطِمَنَّ الْوَجْهَ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila salah seorang daripada kamu bergaduh dengan saudaranya, maka janganlah dia menampar muka."
  },
  {
    "id": 13769,
    "hadith_number": 6492,
    "tajuk_hadith": "Menghindari Muka Semasa Bergaduh",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Abu Hurairah dan dalam hadis yang diriwayatkan daripada Ibnu Hatim, Rasulullah SAW bersabda:",
    "english_text": "When any one of you fights with his brother, he should avoid his face for Allah created Adam in His own image.",
    "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنِي أَبِي، حَدَّثَنَا الْمُثَنَّى، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ،\n حَاتِمٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنِ الْمُثَنَّى بْنِ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَبِي أَيُّوبَ، عَنْ \n أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَفِي حَدِيثِ ابْنِ حَاتِمٍ عَنِ النَّبِيِّ\n صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا قَاتَلَ أَحَدُكُمْ أَخَاهُ فَلْيَجْتَنِبِ الْوَجْهَ فَإِنَّ اللَّهَ خَلَقَ آدَمَ\n عَلَى صُورَتِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila seseorang daripada kamu bergaduh dengan saudaranya, hendaklah dia mengelakkan muka saudaranya itu.  Kerana sesungguhnya Allah SWT telah menciptakan Adam a.s.  menurut  rupa-Nya."
  },
  {
    "id": 13770,
    "hadith_number": 6493,
    "tajuk_hadith": "Menghindari Muka Semasa Bergaduh",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "When any one of you fights with his brother, he should avoid the face.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي عَبْدُ الصَّمَدِ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ يَحْيَى،\n بْنِ مَالِكٍ الْمَرَاغِيِّ - وَهُوَ أَبُو أَيُّوبَ - عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم\n قَالَ ‏\n\"‏ إِذَا قَاتَلَ أَحَدُكُمْ أَخَاهُ فَلْيَجْتَنِبِ الْوَجْهَ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:  \"Apabila seseorang di antara kamu bergaduh dengan saudaranya, hendaklah dia mengelakkan muka (daripada dipukul).\""
  },
  {
    "id": 13771,
    "hadith_number": 6494,
    "tajuk_hadith": "Azab Allah ke atas Mereka Yang Menganiaya",
    "perawi_melayu": "Urwa meriwayatkan daripada bapanya bahawa Hisyam bin Hakim bin Hizam telah lalu di sisi sekumpulan orang di Syria yang telah diarah berdiri di bawah terik matahari dan minyak zaitun dituangkan ke atas kepala mereka.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ \n أَبِيهِ، عَنْ هِشَامِ بْنِ حَكِيمِ بْنِ حِزَامٍ، قَالَ مَرَّ بِالشَّامِ عَلَى أُنَاسٍ وَقَدْ أُقِيمُوا فِي الشَّمْسِ\n وَصُبَّ عَلَى رُءُوسِهِمُ الزَّيْتُ فَقَالَ مَا هَذَا قِيلَ يُعَذَّبُونَ فِي الْخَرَاجِ ‏.‏ فَقَالَ أَمَا إِنِّي سَمِعْتُ\n رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ اللَّهَ يُعَذِّبُ الَّذِينَ يُعَذِّبُونَ فِي الدُّنْيَا ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Bakar bin Abi Syaibah, telah menceritakan kepada kami Hafsh bin Ghiyas, daripada Hisyam bin Urwah, daripada bapanya, daripada Hisyam bin Hakim bin Hizam, katanya:  Aku telah melalui di Syria sekumpulan manusia yang telah dibiarkan berdiri di bawah terik matahari dan minyak zaitun telah dituangkan ke atas kepala mereka.  Maka aku bertanya, \"Apakah ini?\" Dikatakan, \"Mereka diazab kerana (tidak membayar) Kharaj (cukai kerajaan).\"  Maka aku berkata, \"Sesungguhnya aku telah mendengar Rasulullah SAW bersabda, \"Sesungguhnya Allah akan mengazab orang-orang yang mengazab (orang lain) di dunia.\" "
  },
  {
    "id": 13772,
    "hadith_number": 6495,
    "tajuk_hadith": "Azab Allah ke atas Mereka Yang Menyeksa Manusia",
    "perawi_melayu": "Hisham meriwayatkan daripada bapanya bahawa Hisyam bin Hakim bin Hizam telah lalu di sisi sekumpulan orang, iaitu petani-petani di Syria, yang telah dibiarkan berdiri di bawah terik matahari.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، قَالَ مَرَّ هِشَامُ بْنُ حَكِيمِ\n بْنِ حِزَامٍ عَلَى أُنَاسٍ مِنَ الأَنْبَاطِ بِالشَّامِ قَدْ أُقِيمُوا فِي الشَّمْسِ فَقَالَ مَا شَأْنُهُمْ قَالُوا\n حُبِسُوا فِي الْجِزْيَةِ ‏.‏ فَقَالَ هِشَامٌ أَشْهَدُ لَسَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ\n ‏\n\"‏ إِنَّ اللَّهَ يُعَذِّبُ الَّذِينَ يُعَذِّبُونَ النَّاسَ فِي الدُّنْيَا ‏\"‏ ‏.‏",
    "malay_translation": "Abu Kuraib telah meriwayatkan daripada Abu Usamah, daripada Hisyam, daripada bapanya.  Hisham bin Hakim bin Hizam telah lalu di sisi sekumpulan orang daripada penduduk Syria yang dibiarkan berdiri di bawah matahari.  Lalu beliau bertanya, \"Apakah hal mereka?\" Mereka menjawab, \"Mereka ditahan kerana jizyah.\" Maka Hisham berkata, \"Aku bersaksi bahawa aku telah mendengar Rasulullah SAW bersabda:  \"Sesungguhnya Allah akan menyeksa orang-orang yang menyeksa manusia di dunia.\" "
  },
  {
    "id": 13773,
    "hadith_number": 6496,
    "tajuk_hadith": "Kisah Hisham bin Hakim dan Pembebasan Banduan di Palestin",
    "perawi_melayu": "Hisham melalui beberapa perawi termasuk Abu Kuraib, Waki', Abu Muawiyah, dan Jarir.",
    "english_text": "This hadith has been narrated on the authority of Hisham with the same chain of transmitters and he made this addition of Jarir that (Hisham b. Hakim) went to Umair b. Sa'd who was then ruler in Palestine and he narrated to him this hadith and he (submitting before the words of the Prophet) commanded that they should be let off and so they were let off.",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، وَأَبُو مُعَاوِيَةَ ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا \n جَرِيرٌ، كُلُّهُمْ عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ وَزَادَ فِي حَدِيثِ جَرِيرٍ قَالَ وَأَمِيرُهُمْ يَوْمَئِذٍ عُمَيْرُ بْنُ\n سَعْدٍ عَلَى فِلَسْطِينَ فَدَخَلَ عَلَيْهِ فَحَدَّثَهُ فَأَمَرَ بِهِمْ فَخُلُّوا ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan melalui Hisham dengan sanad yang sama, dan Jarir menambah dalam riwayatanya bahawa Hisham bin Hakim telah pergi menemui Umair bin Saad, yang ketika itu menjadi pemerintah di Palestin.  Hisham telah meriwayatkan hadis ini kepadanya, lalu Umair (menghormati sabda Nabi SAW) memerintahkan supaya mereka dibebaskan, dan mereka pun dibebaskan."
  },
  {
    "id": 13774,
    "hadith_number": 6497,
    "tajuk_hadith": "Allah SWT Mengancam Penyeksa Manusia di Dunia",
    "perawi_melayu": "'Urwa bin Zubair meriwayatkan bahawa Hisyam bin Hakim menjumpai seorang lelaki (pemerintah Hims) yang menahan beberapa orang Nabatean berkaitan dengan bayaran Jizyah.  Dia berkata:",
    "english_text": "What is this? I heard Allah's Messenger (ﷺ) as saying: Allah would torment those persons who torment people in the world.",
    "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ،\n بْنِ الزُّبَيْرِ أَنَّ هِشَامَ بْنَ حَكِيمٍ، وَجَدَ رَجُلاً وَهُوَ عَلَى حِمْصَ يُشَمِّسُ نَاسًا مِنَ النَّبَطِ فِي\n أَدَاءِ الْجِزْيَةِ فَقَالَ مَا هَذَا إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ اللَّهَ\n يُعَذِّبُ الَّذِينَ يُعَذِّبُونَ النَّاسَ فِي الدُّنْيَا ‏\"‏ ‏.‏",
    "malay_translation": "Apakah ini?  Aku mendengar Rasulullah ﷺ bersabda:  Sesungguhnya Allah akan menyeksa orang-orang yang menyeksa manusia di dunia."
  },
  {
    "id": 13775,
    "hadith_number": 6498,
    "tajuk_hadith": "Memegang Ujung Anak Panah",
    "perawi_melayu": "'Amr mendengar Jabir berkata:",
    "english_text": "A person happened to come to the mosque with an arrow; thereupon Allah's Messenger (ﷺ) said to him: Take hold of its pointed head.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ،\n أَبُو بَكْرٍ حَدَّثَنَا - سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، سَمِعَ جَابِرًا، يَقُولُ مَرَّ رَجُلٌ فِي الْمَسْجِدِ\n بِسِهَامٍ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَمْسِكْ بِنِصَالِهَا ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki datang ke masjid membawa anak panah.  Maka Rasulullah ﷺ bersabda kepadanya: \"Peganglah bahagian mata panah itu.\""
  },
  {
    "id": 13776,
    "hadith_number": 6499,
    "tajuk_hadith": "Menjaga Keselamatan Jemaah di Masjid",
    "perawi_melayu": "Jabir bin Abdullah",
    "english_text": "Jabir b. Abdullah reported that a person happened to come to the mosque with arrows and their iron-ends were exposed, so he was commanded that he should grasp the pointed heads so that these might not do any harm to a Muslim.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو الرَّبِيعِ، قَالَ أَبُو الرَّبِيعِ حَدَّثَنَا وَقَالَ، يَحْيَى - وَاللَّفْظُ\n لَهُ - أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَجُلاً، مَرَّ بِأَسْهُمٍ\n فِي الْمَسْجِدِ قَدْ أَبْدَى نُصُولَهَا فَأُمِرَ أَنْ يَأْخُذَ بِنُصُولِهَا كَىْ لاَ يَخْدِشَ مُسْلِمًا ‏.‏",
    "malay_translation": "Jabir bin Abdullah meriwayatkan bahawa seorang lelaki datang ke masjid dengan anak panah dan hujung besi anak panah itu terdedah.  Maka dia disuruh memegang hujung yang tajam supaya tidak mencederakan orang Islam."
  },
  {
    "id": 13777,
    "hadith_number": 6500,
    "tajuk_hadith": "Larangan Mengedarkan Anak Panah di Masjid",
    "perawi_melayu": "Jabir melalui Abu Az-Zubair dan beberapa perawi lain seperti Qotaibah bin Sa'id dan Muhammad bin Rumh.",
    "english_text": "Jabir reported that Allah's Messenger (ﷺ) commanded a person who had been distributing arrows freely in the mosque that he should not move about in the mosque but by catching hold of their iron-heads. Ibn Rumh narrated this with a slight variation of wording.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ \n أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ أَمَرَ رَجُلاً كَانَ يَتَصَدَّقُ بِالنَّبْلِ\n فِي الْمَسْجِدِ أَنْ لاَ يَمُرَّ بِهَا إِلاَّ وَهُوَ آخِذٌ بِنُصُولِهَا ‏.‏ وَقَالَ ابْنُ رُمْحٍ كَانَ يَصَّدَّقُ بِالنَّبْلِ\n ‏.‏",
    "malay_translation": "Jabir meriwayatkan bahawa Rasulullah SAW telah memerintahkan seseorang yang selalu mengagihkan anak panah secara bebas di dalam masjid supaya jangan bergerak di dalam masjid melainkan dengan memegang hujung besi anak panah tersebut. Ibn Rumh meriwayatkan hadis ini dengan sedikit perbezaan lafaz."
  },
  {
    "id": 13778,
    "hadith_number": 6501,
    "tajuk_hadith": "Cara Mengendalikan Anak Panah di Majlis atau Pasar",
    "perawi_melayu": "Abu Musa meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "When any one of you happens to go to a meeting or the bazar with an arrow in his hand he must grasp its pointed head; then (he again said): He must grasp its pointed head. Abu Musa said: By Allah, we did not court death until some of us had flung arrows upon the faces of one another.",
    "arabic_text": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي،\n مُوسَى أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا مَرَّ أَحَدُكُمْ فِي مَجْلِسٍ أَوْ سُوقٍ وَبِيَدِهِ\n نَبْلٌ فَلْيَأْخُذْ بِنِصَالِهَا ثُمَّ لْيَأْخُذْ بِنِصَالِهَا ثُمَّ لْيَأْخُذْ بِنِصَالِهَا ‏\"‏ ‏.‏ قَالَ فَقَالَ أَبُو مُوسَى وَاللَّهِ\n مَا مُتْنَا حَتَّى سَدَّدْنَاهَا بَعْضُنَا فِي وُجُوهِ بَعْضٍ ‏.‏",
    "malay_translation": "Apabila seseorang daripada kamu pergi ke majlis atau pasar dengan anak panah di tangannya, hendaklah dia memegang bahagian mata panahnya; kemudian (baginda bersabda lagi): Hendaklah dia memegang bahagian mata panahnya. Abu Musa berkata: Demi Allah, kami tidak mencari kematian sehingga ada di antara kami yang melepaskan anak panah ke muka sesama sendiri."
  },
  {
    "id": 13779,
    "hadith_number": 6502,
    "tajuk_hadith": "Menangani Anak Panah di Masjid dan Pasar",
    "perawi_melayu": "Abu Musa meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "He who amongst you moves in the mosque or in the bazar and there is an arrow with him he should take hold of its iron-head in his palm, so that none amongst the Muslims should receive any injury from it, or he said, should catch its iron-head.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَرَّادٍ الأَشْعَرِيُّ، وَمُحَمَّدُ بْنُ الْعَلاَءِ، - وَاللَّفْظُ لِعَبْدِ اللَّهِ - قَالاَ\n حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم\n قَالَ ‏\"‏ إِذَا مَرَّ أَحَدُكُمْ فِي مَسْجِدِنَا أَوْ فِي سُوقِنَا وَمَعَهُ نَبْلٌ فَلْيُمْسِكْ عَلَى نِصَالِهَا بِكَفِّهِ\n أَنْ يُصِيبَ أَحَدًا مِنَ الْمُسْلِمِينَ مِنْهَا بِشَىْءٍ ‏\"‏ ‏.‏ أَوْ قَالَ ‏\"‏ لِيَقْبِضْ عَلَى نِصَالِهَا ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa di antara kamu berjalan di masjid atau di pasar dan membawa anak panah, hendaklah dia memegang hujung besi anak panah itu dengan tapak tangannya supaya tiada seorang pun daripada kalangan umat Islam yang cedera kerana anak panah itu, atau baginda bersabda, hendaklah dia memegang erat hujung besi anak panah itu."
  },
  {
    "id": 13780,
    "hadith_number": 6503,
    "tajuk_hadith": "Mengancam Saudara dengan Senjata",
    "perawi_melayu": "Abu Hurairah meriwayatkan:",
    "english_text": "Abu'l-Qasim (the kunya of Allah's Messenger, may peace be upon him), said: He who pointed a weapon towards his brother the angels invoke curse upon him even if he is his real brother so long as he does not abandon it (the pointing of weapon towards one's brother Muslim).",
    "arabic_text": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، وَابْنُ أَبِي عُمَرَ، قَالَ عَمْرٌو حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ \n أَيُّوبَ، عَنِ ابْنِ سِيرِينَ، سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ أَبُو الْقَاسِمِ صلى الله عليه وسلم ‏\n\"‏\n مَنْ أَشَارَ إِلَى أَخِيهِ بِحَدِيدَةٍ فَإِنَّ الْمَلاَئِكَةَ تَلْعَنُهُ حَتَّى وَإِنْ كَانَ أَخَاهُ لأَبِيهِ وَأُمِّهِ ‏\"‏ ‏.‏",
    "malay_translation": "Abu al-Qasim (gelaran penghormatan Rasulullah SAW) bersabda: Sesiapa yang menghala senjata ke arah saudaranya, maka para malaikat akan melaknatnya, walaupun saudaranya itu adalah saudara seayah-seibunya, selagi dia tidak meninggalkan perbuatan itu (menghala senjata kepada saudaranya yang Muslim)."
  },
  {
    "id": 13781,
    "hadith_number": 6504,
    "tajuk_hadith": "Hadis daripada Abu Hurairah melalui Sanad Lain",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "Abu Huraira reported a hadith like this from Allah's Apostle (ﷺ) through another chain of transmitters.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنِ ابْنِ عَوْنٍ، عَنْ مُحَمَّدٍ،\n عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan hadis yang serupa ini daripada Rasulullah ﷺ melalui sanad yang lain."
  },
  {
    "id": 13782,
    "hadith_number": 6505,
    "tajuk_hadith": "Larangan Menuding Senjata Kepada Saudara Seagama",
    "perawi_melayu": "Abu Hurairah meriwayatkan sebuah hadis daripada Rasulullah SAW; (antaranya ialah) bahawa Rasulullah SAW bersabda:",
    "english_text": "None amongst you should point a weapon towards his brother, for he does not know that Satan might cause the weapon (to slip) from his hand and (he may injure anyone) and thus he may fall into Hell-Fire.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ\n هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يُشِيرُ أَحَدُكُمْ إِلَى أَخِيهِ بِالسِّلاَحِ فَإِنَّهُ لاَ يَدْرِي أَحَدُكُمْ\n لَعَلَّ الشَّيْطَانَ يَنْزِعُ فِي يَدِهِ فَيَقَعُ فِي حُفْرَةٍ مِنَ النَّارِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Janganlah sesiapa di antara kamu menuding senjata kepada saudaranya, kerana sesungguhnya tidak seorang pun di antara kamu tahu, mungkin syaitan akan menyebabkan senjata itu terjatuh daripada tangannya lalu dia tercedera dan dengan itu dia akan jatuh ke dalam neraka.\" "
  },
  {
    "id": 13783,
    "hadith_number": 6506,
    "tajuk_hadith": "Pahala Mengalih Duri di Jalan",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "While a person was going along the path he found a thorny branch upon it. He pushed it to a side and Allah approved (this action) of his and (as a mark of appreciation) granted him pardon.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي،\n صَالِحٍ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ بَيْنَمَا رَجُلٌ يَمْشِي بِطَرِيقٍ\n وَجَدَ غُصْنَ شَوْكٍ عَلَى الطَّرِيقِ فَأَخَّرَهُ فَشَكَرَ اللَّهُ لَهُ فَغَفَرَ لَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Ketika seorang lelaki berjalan di jalan, dia terjumpa ranting berduri di atas jalan itu.  Lalu dia menyingkirkannya.  Maka Allah reda akan perbuatannya dan mengampunkan dosanya."
  },
  {
    "id": 13784,
    "hadith_number": 6507,
    "tajuk_hadith": "Ke Syurga Kerana Mengalih Dahan Pokok",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "A person while walking along the path saw the branches of a tree lying there. He said: By Allah, I shall remove these from this so that these may not do harm to the Muslims, and he was admitted to Paradise.",
    "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ\n قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَرَّ رَجُلٌ بِغُصْنِ شَجَرَةٍ عَلَى ظَهْرِ طَرِيقٍ فَقَالَ\n وَاللَّهِ لأُنَحِّيَنَّ هَذَا عَنِ الْمُسْلِمِينَ لاَ يُؤْذِيهِمْ ‏.‏ فَأُدْخِلَ الْجَنَّةَ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki ketika berjalan di jalan, melihat dahan pokok di tengah jalan.  Dia berkata, “Demi Allah, aku akan menyingkirkan ini daripada jalan supaya ia tidak akan mendatangkan bahaya kepada orang Islam.” Maka dia dimasukkan ke dalam syurga."
  },
  {
    "id": 13785,
    "hadith_number": 6508,
    "tajuk_hadith": "Ganjaran Membuang Halangan di Jalan",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying that he saw a person enjoying himself in Paradise because of the tree that he cut from the path which was a source of inconvenience to the people.",
    "arabic_text": "حَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، حَدَّثَنَا شَيْبَانُ، عَنِ الأَعْمَشِ، عَنْ \n أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَقَدْ رَأَيْتُ رَجُلاً يَتَقَلَّبُ\n فِي الْجَنَّةِ فِي شَجَرَةٍ قَطَعَهَا مِنْ ظَهْرِ الطَّرِيقِ كَانَتْ تُؤْذِي النَّاسَ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:  \"Sesungguhnya aku telah melihat seorang lelaki sedang menikmati nikmat di syurga disebabkan sebatang pokok yang telah ditebangnya dari tengah jalan, yang mana pokok itu mengganggu orang ramai.\""
  },
  {
    "id": 13786,
    "hadith_number": 6509,
    "tajuk_hadith": "Pohon Yang Menyusahkan dan Ganjaran Syurga",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying that there was a tree which caused inconvenience to the Muslims; a person came there and cut that (tree) (and thus entered ) Paradise).",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَبِي رَافِعٍ،\n عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ شَجَرَةً كَانَتْ تُؤْذِي الْمُسْلِمِينَ\n فَجَاءَ رَجُلٌ فَقَطَعَهَا فَدَخَلَ الْجَنَّةَ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:  \"Sesungguhnya ada sebuah pohon yang menyusahkan orang-orang Islam.  Maka datanglah seseorang lalu menebang pohon itu, kemudian dia masuk syurga.\""
  },
  {
    "id": 13787,
    "hadith_number": 6510,
    "tajuk_hadith": "Menyingkirkan Kemudaratan dari Jalan Orang Islam",
    "perawi_melayu": "Abu Barzah meriwayatkan:",
    "english_text": "I said: Allah's Messenger, teach me something so that I may derive benefit from it. He said: Remove the troublesome thing from the paths of the Muslims.",
    "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ أَبَانَ بْنِ صَمْعَةَ، حَدَّثَنِي أَبُو\n الْوَازِعِ حَدَّثَنِي أَبُو بَرْزَةَ، قَالَ قُلْتُ يَا نَبِيَّ اللَّهِ عَلِّمْنِي شَيْئًا أَنْتَفِعُ بِهِ قَالَ ‏\n\"‏ اعْزِلِ الأَذَى\n عَنْ طَرِيقِ الْمُسْلِمِينَ ‏\"‏ ‏.‏",
    "malay_translation": "Aku berkata: Wahai Rasulullah, ajarkanlah kepadaku sesuatu yang boleh aku peroleh manfaat darinya. Baginda bersabda: \"Singkirkanlah perkara yang menyusahkan daripada jalan orang-orang Islam.\""
  },
  {
    "id": 13788,
    "hadith_number": 6511,
    "tajuk_hadith": "Mencegah Kemudaratan di Jalan Raya",
    "perawi_melayu": "Abu Barzah meriwayatkan bahawa baginda berkata kepada Rasulullah SAW:",
    "english_text": "Allah's Messenger, I do not know whether I would survive after you, so confer upon me something by which Allah should benefit me. Thereupon Allah's Messenger (ﷺ) said: Do this and that and remove the troublesome things from the paths.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو بَكْرِ بْنُ شُعَيْبِ بْنِ الْحَبْحَابِ، عَنْ أَبِي الْوَازِعِ،\n الرَّاسِبِيِّ عَنْ أَبِي بَرْزَةَ الأَسْلَمِيِّ، أَنَّ أَبَا بَرْزَةَ، قَالَ قُلْتُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم\n يَا رَسُولَ اللَّهِ إِنِّي لاَ أَدْرِي لَعَسَى أَنْ تَمْضِيَ وَأَبْقَى بَعْدَكَ فَزَوِّدْنِي شَيْئًا يَنْفَعُنِي اللَّهُ بِهِ\n ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ افْعَلْ كَذَا افْعَلْ كَذَا - أَبُو بَكْرٍ نَسِيَهُ - وَأَمِرَّ\n الأَذَى عَنِ الطَّرِيقِ ‏\"‏ ‏.‏",
    "malay_translation": "Wahai Rasulullah, saya tidak tahu sama ada saya akan hidup selepas kepergian tuan.  Oleh itu, berikanlah saya sesuatu yang akan memberi manfaat kepada saya daripada Allah SWT.  Maka Rasulullah SAW bersabda: “Lakukanlah ini dan itu, dan singkirkanlah segala perkara yang merbahaya dari jalan raya.”"
  },
  {
    "id": 13789,
    "hadith_number": 6512,
    "tajuk_hadith": "Seksaan Wanita Kerana Menyiksa Kucing",
    "perawi_melayu": "Abdullah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "A woman was tormented because of a cat which she had confined until it died and she had to get into Hell. She did not allow it either to eat or drink as it was confined, nor did she free it so that it might eat the vermin of the earth.",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ بْنِ عُبَيْدٍ الضُّبَعِيُّ، حَدَّثَنَا جُوَيْرِيَةُ، - يَعْنِي\n ابْنَ أَسْمَاءَ - عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ عُذِّبَتِ\n امْرَأَةٌ فِي هِرَّةٍ سَجَنَتْهَا حَتَّى مَاتَتْ فَدَخَلَتْ فِيهَا النَّارَ لاَ هِيَ أَطْعَمَتْهَا وَسَقَتْهَا إِذْ هِيَ\n حَبَسَتْهَا وَلاَ هِيَ تَرَكَتْهَا تَأْكُلُ مِنْ خَشَاشِ الأَرْضِ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang wanita telah diseksa disebabkan seekor kucing yang telah dikurungnya sehingga mati, lalu dia masuk neraka.  Dia tidak memberi makan dan minum kepada kucing itu semasa dikurung, dan tidak juga melepaskannya supaya ia boleh memakan serangga di bumi."
  },
  {
    "id": 13790,
    "hadith_number": 6513,
    "tajuk_hadith": "Hadis Dengan Maksud Yang Sama",
    "perawi_melayu": "Harun bin Abdullah, Abdullah bin Ja'far bin Yahya bin Khalid, Ma'n bin Isa, Malik bin Anas, Nafi', Ibnu Umar, dan Nabi SAW",
    "english_text": "The above hadith is narrated through another chain of transmitters with the same meaning",
    "arabic_text": "حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، وَعَبْدُ اللَّهِ بْنُ جَعْفَرِ بْنِ يَحْيَى بْنِ خَالِدٍ، جَمِيعًا عَنْ \n مَعْنِ بْنِ عِيسَى، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم\n بِمَعْنَى حَدِيثِ جُوَيْرِيَةَ ‏.‏",
    "malay_translation": "Hadis di atas diriwayatkan melalui sanad (rantaian periwayat) lain dengan maksud yang sama."
  },
  {
    "id": 13791,
    "hadith_number": 6514,
    "tajuk_hadith": "Seorang Wanita Diseksa Kerana Seekor Kucing",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Ibnu Umar melalui beberapa sanad. Dan Ibnu Umar meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "A woman was tormented because of a cat which she had tied and thus allowed it neither to eat or drink nor set it free so that it might eat the vermin of the earth.",
    "arabic_text": "وَحَدَّثَنِيهِ نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ \n نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ عُذِّبَتِ امْرَأَةٌ فِي هِرَّةٍ\n أَوْثَقَتْهَا فَلَمْ تُطْعِمْهَا وَلَمْ تَسْقِهَا وَلَمْ تَدَعْهَا تَأْكُلُ مِنْ خَشَاشِ الأَرْضِ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang wanita telah diseksa disebabkan seekor kucing yang diikatnya.  Dia tidak memberi makan dan minum kepada kucing itu, dan tidak pula melepaskannya supaya ia boleh memakan serangga di bumi."
  },
  {
    "id": 13792,
    "hadith_number": 6515,
    "tajuk_hadith": "Sanad Hadis daripada Abu Hurairah",
    "perawi_melayu": "Nasr bin Ali al-Jahdami, Abd al-A'la, Ubaidullah, Sa'id al-Maqburi, dan Abu Hurairah",
    "english_text": "This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters.",
    "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ عُبَيْدِ اللَّهِ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ،\n عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Abu Hurairah melalui sanad yang lain.  Perawi-perawinya ialah Nasr bin Ali al-Jahdami, Abd al-A'la, Ubaidullah, Sa'id al-Maqburi, dan Abu Hurairah."
  },
  {
    "id": 13793,
    "hadith_number": 6516,
    "tajuk_hadith": "Seorang Wanita Masuk Neraka Kerana Seekor Kucing",
    "perawi_melayu": "Abu Hurairah meriwayatkan daripada Rasulullah ﷺ.  Satu hadis daripada beberapa hadis yang diriwayatkan baginda ﷺ, iaitu:",
    "english_text": "A woman got into Hell-Fire because of a cat whom she had tied, and thus it could not eat, and she did not let it free so that it could devour the vermin of the earth, until it died.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ\n هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ دَخَلَتِ امْرَأَةٌ النَّارَ مِنْ جَرَّاءِ هِرَّةٍ لَهَا - أَوْ هِرٍّ - رَبَطَتْهَا\n فَلاَ هِيَ أَطْعَمَتْهَا وَلاَ هِيَ أَرْسَلَتْهَا تُرَمِّمُ مِنْ خَشَاشِ الأَرْضِ حَتَّى مَاتَتْ هَزْلاً ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda:  \"Seorang wanita masuk neraka disebabkan seekor kucing yang diikatnya.  Wanita itu tidak memberinya makan dan tidak pula melepaskannya supaya ia boleh mencari makanan seperti serangga di bumi, sehingga kucing itu mati kelaparan.\""
  },
  {
    "id": 13794,
    "hadith_number": 6517,
    "tajuk_hadith": "Allah SWT: Kemuliaan dan Kebesaran",
    "perawi_melayu": "Abu Said al-Khudri dan Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Allah, the Exalted and Glorious, said: Glory is His lower garment and Majesty is His cloak and (Allah says, ) He who contends with Me in regard to them I shall torment him.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُوسُفَ الأَزْدِيُّ، حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا \n الأَعْمَشُ، حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ أَبِي مُسْلِمٍ الأَغَرِّ، أَنَّهُ حَدَّثَهُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، وَأَبِي،\n هُرَيْرَةَ قَالاَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْعِزُّ إِزَارُهُ وَالْكِبْرِيَاءُ رِدَاؤُهُ فَمَنْ\n يُنَازِعُنِي عَذَّبْتُهُ ‏\"‏ ‏.‏",
    "malay_translation": "Allah Yang Maha Tinggi dan Maha Mulia berfirman: Kemuliaan adalah pakaian bahagian bawah-Nya dan kebesaran adalah jubah-Nya.  Barangsiapa yang menyaingi-Ku dalam hal itu, Aku akan mengazabnya."
  },
  {
    "id": 13795,
    "hadith_number": 6518,
    "tajuk_hadith": "Pengampunan Allah SWT",
    "perawi_melayu": "Junudub meriwayatkan bahawa Rasulullah SAW menyatakan bahawa seseorang berkata:",
    "english_text": "Allah would not forgive such and such (person). Thereupon Allah the Exalted and Glorious, said: Who is he who adjures about Me that I would not grant pardon to so and so; I have granted pardon to so and so and blotted out his deeds (who took an oath that I would not grant pardon to him).",
    "arabic_text": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، عَنْ مُعْتَمِرِ بْنِ سُلَيْمَانَ، عَنْ أَبِيهِ، حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ،\n عَنْ جُنْدَبٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حَدَّثَ ‏\n\"‏ أَنَّ رَجُلاً قَالَ وَاللَّهِ لاَ يَغْفِرُ اللَّهُ\n لِفُلاَنٍ وَإِنَّ اللَّهَ تَعَالَى قَالَ مَنْ ذَا الَّذِي يَتَأَلَّى عَلَىَّ أَنْ لاَ أَغْفِرَ لِفُلاَنٍ فَإِنِّي قَدْ غَفَرْتُ لِفُلاَنٍ\n وَأَحْبَطْتُ عَمَلَكَ ‏\"‏ ‏.‏ أَوْ كَمَا قَالَ ‏.‏",
    "malay_translation": "Junudub meriwayatkan bahawa Rasulullah SAW bersabda:  \"Seorang lelaki berkata, Demi Allah, Allah SWT tidak akan mengampunkan si fulan.  Maka Allah SWT berfirman, Siapakah yang berani bersumpah dengan namaKu bahawa Aku tidak akan mengampunkan si fulan?  Sesungguhnya Aku telah mengampunkan si fulan dan Aku telah menghapuskan amalanmu.\"  Atau seperti yang baginda sabdakan."
  },
  {
    "id": 13796,
    "hadith_number": 6519,
    "tajuk_hadith": "Keutamaan Orang yang Terabaikan",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Many a person with disheveled hair and covered with dust is turned away from the doors (whereas he is held in such a high esteem by Allah) that if he were to adjure in the name of Allah (about anything) Allah would fulfil that.",
    "arabic_text": "حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنِي حَفْصُ بْنُ مَيْسَرَةَ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ،\n عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ رُبَّ أَشْعَثَ مَدْفُوعٍ\n بِالأَبْوَابِ لَوْ أَقْسَمَ عَلَى اللَّهِ لأَبَرَّهُ ‏\"‏ ‏.‏",
    "malay_translation": "Betapa banyaknya orang yang rambutnya kusut dan tubuhnya berdebu, ditolak di muka pintu (sedangkan dia sangat dimuliakan di sisi Allah) sehingga sekiranya dia bersumpah dengan nama Allah (tentang sesuatu), nescaya Allah akan mengabulkannya."
  },
  {
    "id": 13797,
    "hadith_number": 6520,
    "tajuk_hadith": "Orang Yang Menyatakan Manusia Binasa",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "When a person says that people are ruined he is himself ruined. Abu Ishaq said: I do not know whether he said\" ahlakahum or ahlakuhum.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ سُهَيْلِ بْنِ أَبِي،\n صَالِحٍ عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ح \n وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ \n أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا قَالَ الرَّجُلُ هَلَكَ النَّاسُ\n ‏.‏ فَهُوَ أَهْلَكُهُمْ ‏\"‏ ‏.‏ قَالَ أَبُو إِسْحَاقَ لاَ أَدْرِي أَهْلَكَهُمْ بِالنَّصْبِ أَوْ أَهْلَكُهُمْ بِالرَّفْعِ ‏.‏",
    "malay_translation": "Apabila seseorang berkata bahawa manusia telah binasa, maka dia sendirilah yang akan binasa. Abu Ishaq berkata: Aku tidak pasti sama ada baginda menyebut “ahlakahum” atau “ahlakuhum”."
  },
  {
    "id": 13798,
    "hadith_number": 6521,
    "tajuk_hadith": "Hadis Daripada Suhail dengan Sanad yang Sama",
    "perawi_melayu": "Suhail",
    "english_text": "This hadith has been narrated on the authority of Suhail with the same chain of transmitters.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ رَوْحِ بْنِ الْقَاسِمِ، ح وَحَدَّثَنِي \n أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، عَنْ سُلَيْمَانَ بْنِ بِلاَلٍ، جَمِيعًا عَنْ سُهَيْلٍ،\n بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Suhail dengan sanad (rantaian periwayat) yang sama.  Ia diriwayatkan oleh Yahya bin Yahya yang diberitakan oleh Yazid bin Zurai' daripada Ruh bin al-Qasim.  Begitu juga, Ahmad bin Usman bin Hakim meriwayatkan daripada Khalid bin Makhalad daripada Sulaiman bin Bilal. Kesemuanya meriwayatkan daripada Suhail dengan sanad yang serupa."
  },
  {
    "id": 13799,
    "hadith_number": 6522,
    "tajuk_hadith": "Kepentingan Memelihara Hubungan Jiran",
    "perawi_melayu": "Aisyah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، ح وَحَدَّثَنَا قُتَيْبَةُ، وَمُحَمَّدُ بْنُ رُمْحٍ، عَنِ \n اللَّيْثِ بْنِ سَعْدٍ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ، وَيَزِيدُ بْنُ هَارُونَ، كُلُّهُمْ عَنْ \n يَحْيَى بْنِ سَعِيدٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، - وَاللَّفْظُ لَهُ - حَدَّثَنَا عَبْدُ الْوَهَّابِ، - يَعْنِي\n الثَّقَفِيَّ - سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، أَخْبَرَنِي أَبُو بَكْرٍ، - وَهُوَ ابْنُ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ\n - أَنَّ عَمْرَةَ، حَدَّثَتْهُ أَنَّهَا، سَمِعَتْ عَائِشَةَ، تَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ\n ‏\n\"‏ مَا زَالَ جِبْرِيلُ يُوصِينِي بِالْجَارِ حَتَّى ظَنَنْتُ أَنَّهُ لَيُوَرِّثَنَّهُ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qotaibah bin Sa’id, dari Malik bin Anas, dan telah menceritakan kepada kami Qotaibah dan Muhammad bin Rumh, dari Laits bin Sa’ad, dan telah menceritakan kepada kami Abu Bakar bin Abi Syaibah, telah menceritakan kepada kami ‘Abdah dan Yazid bin Harun, semuanya dari Yahya bin Sa’id, dan telah menceritakan kepada kami Muhammad bin Mutsanna – dan lafaz ini daripadanya – telah menceritakan kepada kami ‘Abdul Wahhab – iaitu yang As-Tsaqafi – aku mendengar Yahya bin Sa’id memberitakan kepadaku, iaitu Abu Bakar – iaitu anak Muhammad bin ‘Amr bin Hazm – bahawa ‘Amrah telah menceritakan kepadanya bahawa dia telah mendengar Aisyah berkata: Aku telah mendengar Rasulullah SAW bersabda: Jibril sentiasa memberi wasiat kepadaku tentang jiran sehingga aku menyangka bahawa dia akan mewariskan hak kepadanya."
  },
  {
    "id": 13800,
    "hadith_number": 6523,
    "tajuk_hadith": "Sanad Hadis daripada Aisyah",
    "perawi_melayu": "Amru An-Naqid melalui beberapa perawi lain daripada Aisyah.",
    "english_text": "This hadith has been narrated on the authority of 'A'isha through another chain of transmitters.",
    "arabic_text": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، حَدَّثَنِي هِشَامُ بْنُ عُرْوَةَ،\n عَنْ أَبِيهِ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Aisyah melalui beberapa sanad (rantaian periwayatan) yang lain.  Amru An-Naqid meriwayatkan daripada Abdul Aziz bin Abi Hazim, yang meriwayatkan daripada Hisyam bin Urwah, daripada bapanya, daripada Aisyah, daripada Nabi SAW dengan maksud yang sama."
  },
  {
    "id": 13801,
    "hadith_number": 6524,
    "tajuk_hadith": "Kepentingan Memelihara Hubungan Jiran",
    "perawi_melayu": "Ibnu Umar meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Gabriel impressed upon me (the kind treatment) towards the neighbour (so much) that I thought as if he would soon confer upon him the (right) of inheritance.",
    "arabic_text": "حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ عُمَرَ بْنِ مُحَمَّدٍ،\n عَنْ أَبِيهِ، قَالَ سَمِعْتُ ابْنَ عُمَرَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا زَالَ جِبْرِيلُ\n يُوصِينِي بِالْجَارِ حَتَّى ظَنَنْتُ أَنَّهُ سَيُوَرِّثُهُ ‏\"‏ ‏.‏",
    "malay_translation": "Ibnu Umar meriwayatkan bahawa Rasulullah SAW bersabda: \" Jibril sentiasa menggesa aku supaya mementingkan jiran sehingga aku menyangka bahawa Jibril akan mewariskan hak kepada jiran tersebut.\""
  },
  {
    "id": 13802,
    "hadith_number": 6525,
    "tajuk_hadith": "Menderma kepada Jiran",
    "perawi_melayu": "Abu Dzar meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Abu Dharr, when you prepare the broth, add water to that and give that (as a present) to your neighbour.",
    "arabic_text": "حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لإِسْحَاقَ - قَالَ أَبُو\n كَامِلٍ حَدَّثَنَا وَقَالَ، إِسْحَاقُ أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ الْعَمِّيُّ، حَدَّثَنَا أَبُو عِمْرَانَ،\n الْجَوْنِيُّ عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n ‏\n\"‏ يَا أَبَا ذَرٍّ إِذَا طَبَخْتَ مَرَقَةً فَأَكْثِرْ مَاءَهَا وَتَعَاهَدْ جِيرَانَكَ ‏\"‏ ‏.‏",
    "malay_translation": "Wahai Abu Dzar, jika engkau memasak sup, maka perbanyakkan airnya dan berikan sebahagiannya kepada jiran-jiranmu."
  },
  {
    "id": 13803,
    "hadith_number": 6526,
    "tajuk_hadith": "Mengenai Memberi Jiran Daripada Masakan",
    "perawi_melayu": "Abu Dzar meriwayatkan bahawa Rasulullah SAW telah memerintahkan kepadanya:",
    "english_text": "Whenever you prepare a broth, add water to it, and have in your mind the members of the household of your neighbours and then give them out of this with courtesy.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ إِدْرِيسَ، أَخْبَرَنَا شُعْبَةُ، ح وَحَدَّثَنَا أَبُو\n كُرَيْبٍ حَدَّثَنَا ابْنُ إِدْرِيسَ، أَخْبَرَنَا شُعْبَةُ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ،\n عَنْ أَبِي ذَرٍّ، قَالَ إِنَّ خَلِيلِي صلى الله عليه وسلم أَوْصَانِي ‏\n\"‏ إِذَا طَبَخْتَ مَرَقًا فَأَكْثِرْ مَاءَهُ\n ثُمَّ انْظُرْ أَهْلَ بَيْتٍ مِنْ جِيرَانِكَ فَأَصِبْهُمْ مِنْهَا بِمَعْرُوفٍ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Dzar meriwayatkan bahawa Rasulullah SAW bersabda:  “Apabila engkau memasak sup, tambahkan airnya, kemudian ingatlah kepada ahli keluarga jiranmu, lalu berikanlah sebahagian daripadanya kepada mereka dengan cara yang baik.”"
  },
  {
    "id": 13804,
    "hadith_number": 6527,
    "tajuk_hadith": "Jangan Pandang Remeh Amalan Baik, Walaupun Hanya Tersenyum",
    "perawi_melayu": "Abu Dzar meriwayatkan:",
    "english_text": "Allah's Apostle (ﷺ) said to me: Don't consider anything insignificant out of good things even if it is that you meet your brother with a cheerful countenance.",
    "arabic_text": "حَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا أَبُو عَامِرٍ، - يَعْنِي\n الْخَزَّازَ - عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ لِيَ\n النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ تَحْقِرَنَّ مِنَ الْمَعْرُوفِ شَيْئًا وَلَوْ أَنْ تَلْقَى أَخَاكَ بِوَجْهٍ طَلْقٍ\n ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda kepadaku: \"Janganlah kamu menganggap remeh sesuatu kebaikan, walaupun hanya sekadar bertemu saudaramu dengan wajah yang ceria.\""
  },
  {
    "id": 13805,
    "hadith_number": 6528,
    "tajuk_hadith": "Menyarankan dan Ganjarannya",
    "perawi_melayu": "Abu Musa meriwayatkan bahawa apabila seseorang yang memerlukan datang kepada Rasulullah ﷺ dengan keperluannya, baginda memerintahkan para sahabatnya...",
    "english_text": "Make a recommendation for him, and you would get the reward. Allah, however, gives the verdict through the tongue of His Apostle what He likes most.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، وَحَفْصُ بْنُ غِيَاثٍ، عَنْ بُرَيْدِ،\n بْنِ عَبْدِ اللَّهِ عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا\n أَتَاهُ طَالِبُ حَاجَةٍ أَقْبَلَ عَلَى جُلَسَائِهِ فَقَالَ ‏\n\"‏ اشْفَعُوا فَلْتُؤْجَرُوا وَلْيَقْضِ اللَّهُ عَلَى لِسَانِ\n نَبِيِّهِ مَا أَحَبَّ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Musa meriwayatkan bahawa Rasulullah SAW, apabila didatangi oleh seseorang yang memerlukan sesuatu, baginda akan berpaling kepada para sahabatnya dan bersabda:  \"Berilah syafaat (cadangan), kerana kamu akan mendapat pahala. Dan Allah SWT akan memutuskan melalui lisan Nabi-Nya apa yang Dia suka.\" "
  },
  {
    "id": 13806,
    "hadith_number": 6529,
    "tajuk_hadith": "Perumpamaan Teman Baik dan Teman Jahat",
    "perawi_melayu": "Abu Musa meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ، عَنْ \n جَدِّهِ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم ح \n وَحَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ الْهَمْدَانِيُّ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ،\n عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّمَا مَثَلُ الْجَلِيسِ\n الصَّالِحِ وَالْجَلِيسِ السَّوْءِ كَحَامِلِ الْمِسْكِ وَنَافِخِ الْكِيرِ فَحَامِلُ الْمِسْكِ إِمَّا أَنْ يُحْذِيَكَ وَإِمَّا\n أَنْ تَبْتَاعَ مِنْهُ وَإِمَّا أَنْ تَجِدَ مِنْهُ رِيحًا طَيِّبَةً وَنَافِخُ الْكِيرِ إِمَّا أَنْ يُحْرِقَ ثِيَابَكَ وَإِمَّا أَنْ\n تَجِدَ رِيحًا خَبِيثَةً ‏\"‏ ‏.‏",
    "malay_translation": "Perumpamaan teman yang baik dan teman yang jahat adalah seperti orang yang membawa kasturi dan orang yang meniupkan api di dalam dapur.  Orang yang membawa kasturi, sama ada kamu akan mendapatnya secara percuma, atau kamu membelinya darinya, atau kamu akan mendapat bau yang harum darinya.  Dan orang yang meniupkan api di dalam dapur, sama ada dia akan membakar pakaianmu, atau kamu akan mendapat bau yang busuk darinya."
  },
  {
    "id": 13807,
    "hadith_number": 6530,
    "tajuk_hadith": "Perlindungan daripada Api Neraka bagi yang Mementingkan Anak Perempuan",
    "perawi_melayu": "Aisyah, isteri Rasulullah SAW, berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ قُهْزَاذَ، حَدَّثَنَا سَلَمَةُ بْنُ سُلَيْمَانَ، أَخْبَرَنَا عَبْدُ اللَّهِ،\n أَخْبَرَنَا مَعْمَرٌ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي بَكْرِ بْنِ حَزْمٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ،\n ح \n وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ بَهْرَامَ، وَأَبُو بَكْرِ بْنُ إِسْحَاقَ - وَاللَّفْظُ لَهُمَا\n - قَالاَ أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ، أَنَّأَخْبَرَهُ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ جَاءَتْنِي امْرَأَةٌ\n وَمَعَهَا ابْنَتَانِ لَهَا فَسَأَلَتْنِي فَلَمْ تَجِدْ عِنْدِي شَيْئًا غَيْرَ تَمْرَةٍ وَاحِدَةٍ فَأَعْطَيْتُهَا إِيَّاهَا فَأَخَذَتْهَا\n فَقَسَمَتْهَا بَيْنَ ابْنَتَيْهَا وَلَمْ تَأْكُلْ مِنْهَا شَيْئًا ثُمَّ قَامَتْ فَخَرَجَتْ وَابْنَتَاهَا فَدَخَلَ عَلَىَّ النَّبِيُّ\n صلى الله عليه وسلم فَحَدَّثْتُهُ حَدِيثَهَا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَنِ ابْتُلِيَ مِنَ\n الْبَنَاتِ بِشَىْءٍ فَأَحْسَنَ إِلَيْهِنَّ كُنَّ لَهُ سِتْرًا مِنَ النَّارِ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Abdullah bin Qahzazah, telah menceritakan kepada kami Salamah bin Sulaiman, telah memberitakan kepada kami Abdullah, telah memberitakan kepada kami Ma’mar, dari Ibnu Syihab, telah menceritakan kepadaku Abdullah bin Abi Bakar bin Hazm, dari Urwah, dari Aisyah, dan telah menceritakan kepadaku Abdullah bin Abdurrahman bin Bahram dan Abu Bakar bin Ishaq – dan lafaznya daripada keduanya – keduanya berkata: telah memberitakan kepada kami Abu al-Yaman, telah memberitakan kepada kami Syu’aib, dari az- Zuhri, telah menceritakan kepadaku Abdullah bin Abi Bakar, bahawa beliau telah memberitakan kepadanya bahawa Aisyah, isteri Nabi SAW, berkata: “Seorang wanita datang kepadaku bersama dua anak perempuannya. Dia meminta (sedekah) kepadaku, tetapi aku tidak menjumpai apa-apa melainkan sebiji tamar. Maka aku berikan kepadanya. Dia menerimanya lalu membahagikannya kepada kedua anak perempuannya dan dia sendiri tidak memakan sedikit pun daripadanya. Kemudian dia bangun dan pergi bersama kedua anak perempuannya. Kemudian Rasulullah SAW masuk menziarahiku, lalu aku ceritakan kepadanya kisahnya. Maka Rasulullah SAW bersabda: “Barangsiapa yang diuji dengan anak-anak perempuan lalu dia berbuat baik kepada mereka, nescaya mereka akan menjadi perisai baginya daripada api neraka.”"
  },
  {
    "id": 13808,
    "hadith_number": 6531,
    "tajuk_hadith": "Jannah untuk Wanita Miskin yang Bermurah Hati",
    "perawi_melayu": "Aisyah meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا بَكْرٌ، - يَعْنِي ابْنَ مُضَرَ - عَنِ ابْنِ الْهَادِ، أَنَّ زِيَادَ،\n بْنَ أَبِي زِيَادٍ مَوْلَى ابْنِ عَيَّاشٍ حَدَّثَهُ عَنْ عِرَاكِ بْنِ مَالِكٍ، سَمِعْتُهُ يُحَدِّثُ، عُمَرَ بْنَ عَبْدِ الْعَزِيزِ\n عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ جَاءَتْنِي مِسْكِينَةٌ تَحْمِلُ ابْنَتَيْنِ لَهَا فَأَطْعَمْتُهَا ثَلاَثَ تَمَرَاتٍ فَأَعْطَتْ\n كُلَّ وَاحِدَةٍ مِنْهُمَا تَمْرَةً وَرَفَعَتْ إِلَى فِيهَا تَمْرَةً لِتَأْكُلَهَا فَاسْتَطْعَمَتْهَا ابْنَتَاهَا فَشَقَّتِ التَّمْرَةَ\n الَّتِي كَانَتْ تُرِيدُ أَنْ تَأْكُلَهَا بَيْنَهُمَا فَأَعْجَبَنِي شَأْنُهَا فَذَكَرْتُ الَّذِي صَنَعَتْ لِرَسُولِ اللَّهِ صلى\n الله عليه وسلم فَقَالَ ‏\n\"‏ إِنَّ اللَّهَ قَدْ أَوْجَبَ لَهَا بِهَا الْجَنَّةَ أَوْ أَعْتَقَهَا بِهَا مِنَ النَّارِ ‏\"‏ ‏.‏",
    "malay_translation": "Aisyah meriwayatkan: Seorang wanita miskin datang kepadaku bersama dua orang anak perempuannya. Aku memberi dia tiga biji tamar.  Dia memberi sebiji tamar kepada setiap seorang anak perempuannya, dan dia mengangkat sebiji tamar lagi ke mulutnya untuk dimakan.  Namun anak-anak perempuannya meminta untuk memakannya juga. Maka dia membelah tamar yang ingin dimakan itu dan membahagikannya kepada kedua anaknya.  Sikapnya itu sangat mengagumkanku, lalu aku menceritakan perbuatannya kepada Rasulullah SAW. Baginda bersabda: \"Sesungguhnya Allah telah menjanjikan syurga untuknya disebabkan perbuatannya itu, atau Allah telah menyelamatkannya daripada neraka.\" "
  },
  {
    "id": 13809,
    "hadith_number": 6532,
    "tajuk_hadith": "Pahala Mendidik Dua Orang Gadis",
    "perawi_melayu": "Malik meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "He, who brought up two girls properly till they grew up, he and I would come (together) (very closely) on the Day of Resurrection, and he interlaced his fingers (for explaining the point of nearness between him and that person).",
    "arabic_text": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ، عَنْ \n عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ أَنَسٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم ‏\n\"‏ مَنْ عَالَ جَارِيَتَيْنِ حَتَّى تَبْلُغَا جَاءَ يَوْمَ الْقِيَامَةِ أَنَا وَهُوَ ‏\"‏ ‏.‏ وَضَمَّ أَصَابِعَهُ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Barang siapa yang mendidik dua orang anak perempuan sehingga mereka dewasa, maka pada hari kiamat nanti aku dan dia akan datang (bersama-sama) dengan sangat dekat.\"  Baginda kemudian menyatukan jari-jari baginda (untuk menerangkan betapa dekatnya hubungan antara baginda dan orang tersebut)."
  },
  {
    "id": 13810,
    "hadith_number": 6533,
    "tajuk_hadith": "Anak Meninggal Dunia dan Azab Neraka",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Anyone amongst the Muslims, three of whose children die, and he resigns himself calmly to the will of God, Fire will not touch him but for the fulfilment of the oath.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ،\n عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَمُوتُ لأَحَدٍ مِنَ الْمُسْلِمِينَ ثَلاَثَةٌ\n مِنَ الْوَلَدِ فَتَمَسَّهُ النَّارُ إِلاَّ تَحِلَّةَ الْقَسَمِ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:  \"Tidak akan disentuh api neraka seorang muslim yang telah meninggal tiga orang anaknya, dan dia telah reda dengan ketentuan Allah SWT, melainkan disebabkan sumpah yang telah diikrarkannya.\""
  },
  {
    "id": 13811,
    "hadith_number": 6534,
    "tajuk_hadith": "Masuk Neraka Kecuali Jika Sumpah Ditepati",
    "perawi_melayu": "Hadis ini diriwayatkan oleh Zuhri berdasarkan pendapat Malik, dan dalam hadis yang disampaikan berdasarkan pendapat Sufyan (kata-katanya adalah):",
    "english_text": "\" He would enter into Fire, except for the fulfilment of the oath.\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالُوا حَدَّثَنَا سُفْيَانُ،\n بْنُ عُيَيْنَةَ ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، وَابْنُ، رَافِعٍ عَنْ عَبْدِ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، كِلاَهُمَا عَنِ \n الزُّهْرِيِّ، ‏.‏ بِإِسْنَادِ مَالِكٍ وَبِمَعْنَى حَدِيثِهِ إِلاَّ أَنَّ فِي حَدِيثِ سُفْيَانَ ‏\n\"‏ فَيَلِجَ النَّارَ إِلاَّ تَحِلَّةَ\n الْقَسَمِ ‏\"‏ ‏.‏",
    "malay_translation": "Dia akan masuk neraka kecuali jika sumpah tersebut ditepati."
  },
  {
    "id": 13812,
    "hadith_number": 6535,
    "tajuk_hadith": "Syurga bagi Wanita yang Bersabar Kehilangan Anak",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda kepada seorang wanita daripada kalangan Ansar:",
    "english_text": "In case anyone amongst you sees the sad demise of three children of (hers) and she resigns herself to the will of God hoping to get reward, she would be admitted to Paradise. A woman from amongst them said: Allah's Messenger, even if they (the children who die) are two. Thereupon, he (the Holy Prophet, ) said: Even if they are two.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ مُحَمَّدٍ - عَنْ سُهَيْلٍ، عَنْ \n أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لِنِسْوَةٍ مِنَ الأَنْصَارِ ‏\"‏ لاَ\n يَمُوتُ لإِحْدَاكُنَّ ثَلاَثَةٌ مِنَ الْوَلَدِ فَتَحْتَسِبَهُ إِلاَّ دَخَلَتِ الْجَنَّةَ ‏\"‏ ‏.‏ فَقَالَتِ امْرَأَةٌ مِنْهُنَّ أَوِ اثْنَيْنِ\n يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ أَوِ اثْنَيْنِ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda kepada sekumpulan wanita daripada kalangan Ansar: \"Sekiranya salah seorang daripada kamu mengalami kematian tiga orang anak dan dia redha serta bersabar atas ketentuan Allah SWT dengan mengharapkan ganjaran, nescaya dia akan masuk syurga.\"  Kemudian seorang wanita daripada mereka bertanya: \"Wahai Rasulullah, bagaimana jika hanya dua orang anak?\"  Baginda SAW menjawab: \"Walaupun hanya dua orang anak.\""
  },
  {
    "id": 13813,
    "hadith_number": 6536,
    "tajuk_hadith": "Anak-Anak Sebagai Pelindung dari Api Neraka",
    "perawi_melayu": "Abu Said al-Khudri meriwayatkan bahawa seorang wanita datang kepada Rasulullah SAW dan berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، فُضَيْلُ بْنُ حُسَيْنٍ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الرَّحْمَنِ،\n بْنِ الأَصْبَهَانِيِّ عَنْ أَبِي صَالِحٍ، ذَكْوَانَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ\n اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ ذَهَبَ الرِّجَالُ بِحَدِيثِكَ فَاجْعَلْ لَنَا مِنْ نَفْسِكَ\n يَوْمًا نَأْتِيكَ فِيهِ تُعَلِّمُنَا مِمَّا عَلَّمَكَ اللَّهُ ‏.‏ قَالَ ‏\"‏ اجْتَمِعْنَ يَوْمَ كَذَا وَكَذَا ‏\"‏ ‏.‏ فَاجْتَمَعْنَ فَأَتَاهُنَّ\n رَسُولُ اللَّهِ صلى الله عليه وسلم فَعَلَّمَهُنَّ مِمَّا عَلَّمَهُ اللَّهُ ثُمَّ قَالَ ‏\"‏ مَا مِنْكُنَّ مِنِ امْرَأَةٍ تُقَدِّمُ\n بَيْنَ يَدَيْهَا مِنْ وَلَدِهَا ثَلاَثَةً إِلاَّ كَانُوا لَهَا حِجَابًا مِنَ النَّارِ ‏\"‏ ‏.‏ فَقَالَتِ امْرَأَةٌ وَاثْنَيْنِ وَاثْنَيْنِ\n وَاثْنَيْنِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَاثْنَيْنِ وَاثْنَيْنِ وَاثْنَيْنِ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Kamil al-Jahdari meriwayatkan daripada Fuḍail bin Husain, yang meriwayatkan daripada Abu ‘Awānah, daripada ‘Abd al-Rahman bin al-Aṣbahani, daripada Abu Ṣāliḥ Dhakwān, daripada Abu Sa’id al-Khudri, katanya: Seorang wanita datang kepada Rasulullah SAW lalu berkata, \"Wahai Rasulullah, kaum lelaki telah mendapat pengajaran daripada hadis tuan. Jadi, sediakanlah untuk kami satu hari di mana kami boleh datang kepada tuan dan tuan akan mengajar kami apa yang Allah telah ajarkan kepada tuan.\" Baginda SAW bersabda: \"Kumpulkanlah pada hari begini dan begini.\" Mereka pun berkumpul, lalu Rasulullah SAW datang kepada mereka dan mengajar mereka apa yang Allah telah ajarkan kepada Baginda. Kemudian Baginda bersabda: \"Sesiapa di kalangan kamu yang mendahului dengan tiga orang anaknya, nescaya mereka akan menjadi hijab (pelindung) baginya daripada api neraka.\" Seorang wanita bertanya: \"Bagaimana pula jika dua orang, dua orang, dan dua orang?\" Rasulullah SAW bersabda: \"Dua orang, dua orang, dan dua orang pun (cukup).\""
  },
  {
    "id": 13814,
    "hadith_number": 6537,
    "tajuk_hadith": "Tiga Kanak-kanak Yang Meninggal Dunia Sebelum Baligh",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Nabi SAW bersabda:",
    "english_text": "Three (children) who die in childhood.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وَحَدَّثَنَا عُبَيْدُ،\n اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَصْبَهَانِيِّ، فِي هَذَا الإِسْنَادِ\n ‏.‏ بِمِثْلِ مَعْنَاهُ وَزَادَا جَمِيعًا عَنْ شُعْبَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَصْبَهَانِيِّ قَالَ سَمِعْتُ أَبَا\n حَازِمٍ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ قَالَ ‏\n\"‏ ثَلاَثَةً لَمْ يَبْلُغُوا الْحِنْثَ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Nabi SAW bersabda: \"Tiga (kanak-kanak) yang belum mencapai umur baligh...\"  (Hadith ini tidak menyatakan secara terperinci tiga kanak-kanak tersebut.  Teks Arab menunjukkan riwayat yang panjang, tetapi bahagian akhir yang menerangkan tiga kanak-kanak itu tidak disertakan dalam teks Inggeris yang diberikan. Oleh itu, terjemahan Melayu hanya berdasarkan teks Inggeris yang sedia ada.)"
  },
  {
    "id": 13815,
    "hadith_number": 6538,
    "tajuk_hadith": "Anak-Anak Kecil sebagai Burung Syurga",
    "perawi_melayu": "Abu Hassan meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، - وَتَقَارَبَا فِي اللَّفْظِ - قَالاَ حَدَّثَنَا \n الْمُعْتَمِرُ، عَنْ أَبِيهِ، عَنْ أَبِي السَّلِيلِ، عَنْ أَبِي حَسَّانَ، قَالَ قُلْتُ لأَبِي هُرَيْرَةَ إِنَّهُ قَدْ مَاتَ لِيَ\n ابْنَانِ فَمَا أَنْتَ مُحَدِّثِي عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم بِحَدِيثٍ تُطَيِّبُ بِهِ أَنْفُسَنَا عَنْ\n مَوْتَانَا قَالَ قَالَ نَعَمْ ‏\n\"‏ صِغَارُهُمْ دَعَامِيصُ الْجَنَّةِ يَتَلَقَّى أَحَدُهُمْ أَبَاهُ - أَوْ قَالَ أَبَوَيْهِ\n - فَيَأْخُذُ بِثَوْبِهِ - أَوْ قَالَ بِيَدِهِ - كَمَا آخُذُ أَنَا بِصَنِفَةِ ثَوْبِكَ هَذَا فَلاَ يَتَنَاهَى - أَوْ قَالَ\n فَلاَ يَنْتَهِي - حَتَّى يُدْخِلَهُ اللَّهُ وَأَبَاهُ الْجَنَّةَ ‏\"‏ ‏.‏ وَفِي رِوَايَةِ سُوَيْدٍ قَالَ حَدَّثَنَا أَبُو السَّلِيلِ\n وَحَدَّثَنِيهِ عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا يَحْيَى - يَعْنِي ابْنَ سَعِيدٍ - عَنِ التَّيْمِيِّ بِهَذَا الإِسْنَادِ\n وَقَالَ فَهَلْ سَمِعْتَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم شَيْئًا تُطَيِّبُ بِهِ أَنْفُسَنَا عَنْ مَوْتَانَا\n قَالَ نَعَمْ ‏.‏",
    "malay_translation": "Aku berkata kepada Abu Hurairah bahawa dua orang anakku telah meninggal dunia. Adakah engkau akan meriwayatkan kepadaku sesuatu daripada Rasulullah ﷺ, satu hadith yang dapat menenangkan hati kami atas kematian mereka?  Dia berkata: Ya. Anak-anak kecil mereka adalah burung-burung syurga. Jika salah seorang daripada mereka bertemu bapanya (atau dia berkata ibu bapanya), dia akan memegang pakaiannya (atau dia berkata dengan tangannya) seperti aku memegang hujung pakaianmu ini. Dan dia (anak itu) tidak akan melepaskannya sehingga Allah memasukkannya dan bapanya ke dalam syurga.  Dalam riwayat Suwaid, dia berkata: Abu Salil meriwayatkan kepadaku, dan Ubaidullah bin Sa’id meriwayatkan kepadaku, Yahya (iaitu bin Sa’id) meriwayatkan dari at-Timi dengan sanad ini. Dan dia bertanya: Adakah engkau mendengar daripada Rasulullah ﷺ sesuatu yang dapat menenangkan hati kami atas kematian kami? Dia berkata: Ya."
  },
  {
    "id": 13816,
    "hadith_number": 6539,
    "tajuk_hadith": "Menghindari Azab Neraka dengan Mengurus Jenazah",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa seorang wanita datang kepada Rasulullah ﷺ dengan anaknya dan berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَأَبُو سَعِيدٍ الأَشَجُّ\n - وَاللَّفْظُ لأَبِي بَكْرٍ - قَالُوا حَدَّثَنَا حَفْصٌ، - يَعْنُونَ ابْنَ غِيَاثٍ ح وَحَدَّثَنَا عُمَرُ بْنُ حَفْصِ،\n بْنِ غِيَاثٍ حَدَّثَنَا أَبِي، عَنْ جَدِّهِ، طَلْقِ بْنِ مُعَاوِيَةَ عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ، عَنْ \n أَبِي هُرَيْرَةَ، قَالَ أَتَتِ امْرَأَةٌ النَّبِيَّ صلى الله عليه وسلم بِصَبِيٍّ لَهَا فَقَالَتْ يَا نَبِيَّ اللَّهِ ادْعُ\n اللَّهَ لَهُ فَلَقَدْ دَفَنْتُ ثَلاَثَةً قَالَ ‏\"‏ دَفَنْتِ ثَلاَثَةً ‏\"‏ ‏.‏ قَالَتْ نَعَمْ ‏.‏ قَالَ ‏\"‏ لَقَدِ احْتَظَرْتِ بِحِظَارٍ\n شَدِيدٍ مِنَ النَّارِ ‏\"‏ ‏.‏ قَالَ عُمَرُ مِنْ بَيْنِهِمْ عَنْ جَدِّهِ ‏.‏ وَقَالَ الْبَاقُونَ عَنْ طَلْقٍ ‏.‏ وَلَمْ يَذْكُرُوا\n الْجَدَّ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa seorang wanita datang kepada Nabi SAW dengan anaknya dan berkata, \"Wahai Nabi Allah, doakanlah untuk anakku.  Sesungguhnya aku telah mengebumikan tiga orang.\" Nabi SAW bertanya, \"Tiga orang?\" Wanita itu menjawab, \"Ya.\" Nabi SAW bersabda, \"Sesungguhnya engkau telah melindungi dirimu dengan perlindungan yang kuat daripada api neraka.\"  Umar di antara mereka meriwayatkan daripada datuknya, manakala yang lain meriwayatkan daripada Talq.  Mereka tidak menyebut tentang datuknya."
  },
  {
    "id": 13817,
    "hadith_number": 6540,
    "tajuk_hadith": "Kehilangan Anak Sebagai Perlindungan dari Api Neraka",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa seorang wanita datang kepada Rasulullah ﷺ dengan anaknya dan berkata:",
    "english_text": "Allah's Messenger, he is ailing, and I am afraid (that he may die), as I have already buried three. Thereupon he said: It (their sad demise) would be a protection against Hell-Fire for you. Zuhair has not mentioned the kunya of Abu Ghiyath; he has mentioned his name.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا جَرِيرٌ، عَنْ طَلْقِ بْنِ مُعَاوِيَةَ،\n النَّخَعِيِّ أَبِي غِيَاثٍ عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَتِ امْرَأَةٌ\n إِلَى النَّبِيِّ صلى الله عليه وسلم بِابْنٍ لَهَا فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّهُ يَشْتَكِي وَإِنِّي أَخَافُ\n عَلَيْهِ قَدْ دَفَنْتُ ثَلاَثَةً ‏.‏ قَالَ ‏\n\"‏ لَقَدِ احْتَظَرْتِ بِحِظَارٍ شَدِيدٍ مِنَ النَّارِ ‏\"‏ ‏.‏ قَالَ زُهَيْرٌ عَنْ\n طَلْقٍ ‏.‏ وَلَمْ يَذْكُرِ الْكُنْيَةَ ‏.‏",
    "malay_translation": "Seorang wanita datang kepada Rasulullah SAW dengan anaknya dan berkata, \"Wahai Rasulullah, anak saya sakit dan saya bimbang dia akan meninggal dunia. Saya telah mengebumikan tiga orang anak sebelum ini.\" Rasulullah SAW bersabda, \"Sesungguhnya, kamu telah mendapat perlindungan yang kuat daripada api neraka.\"  Zuhair meriwayatkan daripada Talq, tetapi tidak menyebut kunyah Abu Ghiyath, hanya namanya sahaja."
  },
  {
    "id": 13818,
    "hadith_number": 6541,
    "tajuk_hadith": "Kecintaan dan Kemurkaan Allah",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ\n قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ اللَّهَ إِذَا أَحَبَّ عَبْدًا دَعَا جِبْرِيلَ فَقَالَ إِنِّي أُحِبُّ\n فُلاَنًا فَأَحِبَّهُ - قَالَ - فَيُحِبُّهُ جِبْرِيلُ ثُمَّ يُنَادِي فِي السَّمَاءِ فَيَقُولُ إِنَّ اللَّهَ يُحِبُّ فُلاَنًا\n فَأَحِبُّوهُ ‏.‏ فَيُحِبُّهُ أَهْلُ السَّمَاءِ - قَالَ - ثُمَّ يُوضَعُ لَهُ الْقَبُولُ فِي الأَرْضِ ‏.‏ وَإِذَا أَبْغَضَ\n عَبْدًا دَعَا جِبْرِيلَ فَيَقُولُ إِنِّي أُبْغِضُ فُلاَنًا فَأَبْغِضْهُ - قَالَ - فَيُبْغِضُهُ جِبْرِيلُ ثُمَّ يُنَادِي\n فِي أَهْلِ السَّمَاءِ إِنَّ اللَّهَ يُبْغِضُ فُلاَنًا فَأَبْغِضُوهُ - قَالَ - فَيُبْغِضُونَهُ ثُمَّ تُوضَعُ لَهُ الْبَغْضَاءُ\n فِي الأَرْضِ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:  \"Sesungguhnya apabila Allah mengasihi seorang hamba, Allah akan memanggil Jibril lalu berfirman:  'Sesungguhnya Aku mengasihi si fulan, maka kasihilah dia.' Maka Jibril pun mengasihi hamba itu. Kemudian Jibril menyeru di langit, 'Sesungguhnya Allah mengasihi si fulan, maka kasihilah dia.' Maka penduduk langit pun mengasihi hamba itu. Kemudian penerimaan (daripada manusia) diletakkan untuknya di bumi.  Dan apabila Allah membenci seorang hamba, Allah memanggil Jibril lalu berfirman: 'Sesungguhnya Aku membenci si fulan, maka bencilah dia.' Maka Jibril pun membencinya. Kemudian Jibril menyeru kepada penduduk langit, 'Sesungguhnya Allah membenci si fulan, maka bencilah dia.' Maka mereka pun membencinya. Kemudian kebencian diletakkan untuknya di bumi.\""
  },
  {
    "id": 13819,
    "hadith_number": 6542,
    "tajuk_hadith": "Perbezaan Riwayat Hadis Suhail",
    "perawi_melayu": "Suhail (dengan beberapa perawi yang sama, kecuali variasi dalam riwayat Al-Ala' bin Al-Musayyib yang tidak menyebut perkataan \"kemarahan\")",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ - وَقَالَ\n قُتَيْبَةُ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي الدَّرَاوَرْدِيَّ، ح وَحَدَّثَنَاهُ سَعِيدُ بْنُ عَمْرٍو الأَشْعَثِيُّ، أَخْبَرَنَا \n عَبْثَرٌ، عَنِ الْعَلاَءِ بْنِ الْمُسَيَّبِ، ح وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنِي \n مَالِكٌ، - وَهُوَ ابْنُ أَنَسٍ - كُلُّهُمْ عَنْ سُهَيْلٍ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّ حَدِيثَ، الْعَلاَءِ بْنِ الْمُسَيَّبِ\n لَيْسَ فِيهِ ذِكْرُ الْبُغْضِ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qotaibah bin Sa’id, telah menceritakan kepada kami Ya’qub (iaitu Ibnu Abdur Rahman Al-Qari’) dan berkata Qotaibah, telah menceritakan kepada kami Abdul Aziz (iaitu Ad-Darawardi), dan telah menceritakan kepada kami Sa’id bin Amru Al-Asy’atsy, telah memberitakan kepada kami Abtsar dari Al-Ala’ bin Al-Musayyib, dan telah menceritakan kepadaku Harun bin Sa’id Al-Ayliy, telah menceritakan kepada kami Ibnu Wahb, telah menceritakan kepadaku Malik (ialah Ibnu Anas), semuanya daripada Suhail, dengan sanad ini.  Tetapi hadis Al-Ala’ bin Al-Musayyib tidak menyebut tentang kebencian."
  },
  {
    "id": 13820,
    "hadith_number": 6543,
    "tajuk_hadith": "Kecintaan Allah SWT kepada Umar bin Abdul Aziz",
    "perawi_melayu": "Suhail bin Abi Salih meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ،\n بْنِ أَبِي سَلَمَةَ الْمَاجِشُونُ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، قَالَ كُنَّا بِعَرَفَةَ فَمَرَّ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ\n وَهُوَ عَلَى الْمَوْسِمِ فَقَامَ النَّاسُ يَنْظُرُونَ إِلَيْهِ فَقُلْتُ لأَبِي يَا أَبَتِ إِنِّي أَرَى اللَّهَ يُحِبُّ عُمَرَ\n بْنَ عَبْدِ الْعَزِيزِ ‏.‏ قَالَ وَمَا ذَاكَ قُلْتُ لِمَا لَهُ مِنَ الْحُبِّ فِي قُلُوبِ النَّاسِ ‏.‏ فَقَالَ بِأَبِيكَ أَنْتَ\n سَمِعْتَ أَبَا هُرَيْرَةَ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ جَرِيرٍ\n عَنْ سُهَيْلٍ ‏.‏",
    "malay_translation": "Aku telah diceritakan oleh Amru An-Naqid, yang telah diceritakan kepadanya oleh Yazid bin Harun, yang telah diberitakan kepadanya oleh Abdul Aziz bin Abdullah bin Abi Salamah Al-Majisyun daripada Suhail bin Abi Shalih, katanya: Kami berada di Arafah, lalu lalu Umar bin Abdul Aziz, ketika beliau menjadi Amirul Hajj. Maka orang ramai berdiri untuk melihatnya. Aku berkata kepada bapaku, \"Wahai bapaku, aku melihat Allah SWT mencintai Umar bin Abdul Aziz.\"  Bapaku berkata, \"Apakah itu?\" Aku berkata, \"Kerana kecintaan baginda di hati orang ramai.\" Beliau berkata, \"Demi ayahmu, aku pernah mendengar Abu Hurairah meriwayatkan daripada Rasulullah SAW.\" Kemudian beliau menyebut hadith yang sama seperti hadith Jarir daripada Suhail."
  },
  {
    "id": 13821,
    "hadith_number": 6544,
    "tajuk_hadith": "Jiwa-jiwa Sebagai Pasukan yang Dikumpulkan",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Souls are troops collected together and those who familiarised with each other (in the heaven from where these come) would have affinity, with one another (in the world) and those amongst them who opposed each other (in the Heaven) would also be divergent (in the world).",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ مُحَمَّدٍ - عَنْ سُهَيْلٍ، عَنْ \n أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الأَرْوَاحُ جُنُودٌ مُجَنَّدَةٌ\n فَمَا تَعَارَفَ مِنْهَا ائْتَلَفَ وَمَا تَنَاكَرَ مِنْهَا اخْتَلَفَ ‏\"‏ ‏.‏",
    "malay_translation": "Jiwa-jiwa itu seperti pasukan-pasukan yang telah dikumpulkan. Maka, jiwa-jiwa yang saling mengenali di alam roh sebelum kelahiran akan saling akrab di dunia, dan jiwa-jiwa yang saling bermusuhan di alam roh akan saling berselisih di dunia."
  },
  {
    "id": 13822,
    "hadith_number": 6545,
    "tajuk_hadith": "Keunggulan Manusia Seperti Bijih Emas dan Perak",
    "perawi_melayu": "Abu Hurairah meriwayatkan daripada Rasulullah SAW bahawa baginda bersabda:",
    "english_text": "People are like mines of gold and silver; those who were excellent in Jahiliya (during the days of ignorance) are excellent In Islam, when they have, an understanding, and the souls are troops collected together and those who had a mutual familiarity amongst themselves in the store of prenatal existence would have affinity amongst them, (in this world also) and those who opposed one of them, would be at variance with one another.",
    "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا كَثِيرُ بْنُ هِشَامٍ، حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ، حَدَّثَنَا \n يَزِيدُ بْنُ الأَصَمِّ، عَنْ أَبِي هُرَيْرَةَ، بِحَدِيثٍ يَرْفَعُهُ قَالَ ‏\n\"‏ النَّاسُ مَعَادِنُ كَمَعَادِنِ الْفِضَّةِ وَالذَّهَبِ\n خِيَارُهُمْ فِي الْجَاهِلِيَّةِ خِيَارُهُمْ فِي الإِسْلاَمِ إِذَا فَقُهُوا وَالأَرْوَاحُ جُنُودٌ مُجَنَّدَةٌ فَمَا تَعَارَفَ\n مِنْهَا ائْتَلَفَ وَمَا تَنَاكَرَ مِنْهَا اخْتَلَفَ ‏\"‏ ‏.‏",
    "malay_translation": "Manusia adalah seperti bijih emas dan perak.  Orang-orang yang terbaik pada zaman Jahiliyyah (zaman jahiliah) juga akan menjadi orang-orang terbaik dalam Islam jika mereka memahami (agama Islam).  Roh-roh itu adalah seperti pasukan-pasukan yang telah diatur.  Maka, antara roh-roh yang telah saling mengenali, mereka akan bersatu, dan antara roh-roh yang saling tidak mengenali, mereka akan berselisih."
  },
  {
    "id": 13823,
    "hadith_number": 6546,
    "tajuk_hadith": "Persediaan untuk Hari Kiamat",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa seorang Badwi berkata kepada Rasulullah SAW:",
    "english_text": "When would be the Last Hour? Allah's Messenger (ﷺ) said: What preparation have you made for that? Thereupon he said: The love of Allah and of His Messenger (that is my preparation for the Last Hour) (for the Day of Resurrection). Thereupon he (the Holy Prophet) said: You would be along with one whom you love.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ،\n أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ أَعْرَابِيًّا، قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم مَتَى السَّاعَةُ\n قَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا أَعْدَدْتَ لَهَا ‏\"‏ ‏.‏ قَالَ حُبَّ اللَّهِ وَرَسُولِهِ ‏.‏\n قَالَ ‏\"‏ أَنْتَ مَعَ مَنْ أَحْبَبْتَ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang Badwi bertanya kepada Rasulullah SAW, \"Bilakah akan tiba Hari Kiamat?\" Rasulullah SAW bertanya kepadanya, \"Apakah persediaan yang telah engkau buat untuknya?\"  Badwi itu menjawab, \"Kecintaan kepada Allah dan Rasul-Nya.\"  Rasulullah SAW bersabda, \"Engkau akan bersama dengan orang yang engkau cintai.\""
  },
  {
    "id": 13824,
    "hadith_number": 6547,
    "tajuk_hadith": "Ketibaan Hari Kiamat dan Persiapan",
    "perawi_melayu": "Anas meriwayatkan bahawa seseorang bertanya kepada Rasulullah SAW:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ عَبْدِ،\n اللَّهِ بْنِ نُمَيْرٍ وَابْنُ أَبِي عُمَرَ - وَاللَّفْظُ لِزُهَيْرٍ - قَالُوا حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسٍ،\n قَالَ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ مَتَى السَّاعَةُ قَالَ ‏\"‏ وَمَا أَعْدَدْتَ لَهَا ‏\"‏ ‏.‏ فَلَمْ يَذْكُرْ كَبِيرًا\n ‏.‏ قَالَ وَلَكِنِّي أُحِبُّ اللَّهَ وَرَسُولَهُ ‏.‏ قَالَ ‏\"‏ فَأَنْتَ مَعَ مَنْ أَحْبَبْتَ ‏\"‏ ‏.‏ \n حَدَّثَنِيهِ مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ عَبْدٌ أَخْبَرَنَا وَقَالَ ابْنُ رَافِعٍ، حَدَّثَنَا \n عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ رَجُلاً، مِنَ الأَعْرَابِ أَتَى\n رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ مَا أَعْدَدْتُ لَهَا مِنْ كَثِيرٍ أَحْمَدُ عَلَيْهِ\n نَفْسِي ‏.‏",
    "malay_translation": "Anas meriwayatkan bahawa seorang lelaki bertanya kepada Rasulullah SAW, \"Wahai Rasulullah, bilakah hari kiamat?\" Rasulullah SAW bertanya, \"Apakah persediaan yang telah engkau buat untuknya?\" Lelaki itu menjawab, \"Aku tidak membuat banyak persediaan yang patut dibanggakan, tetapi aku mencintai Allah dan Rasul-Nya.\" Rasulullah SAW bersabda, \"Maka engkau akan bersama dengan orang yang engkau cintai.\"  Dalam riwayat lain, seorang lelaki Badwi bertanya soalan yang sama. Jawapannya sama, cuma lelaki Badwi itu berkata, \"Aku tidak membuat banyak persediaan yang membanggakan diriku.\""
  },
  {
    "id": 13825,
    "hadith_number": 6548,
    "tajuk_hadith": "Bersama Mereka Yang Dikasihi",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي أَبُو الرَّبِيعِ الْعَتَكِيُّ، حَدَّثَنَا حَمَّادٌ، - يَعْنِي ابْنَ زَيْدٍ - حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ،\n عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ\n اللَّهِ مَتَى السَّاعَةُ قَالَ ‏\"‏ وَمَا أَعْدَدْتَ لِلسَّاعَةِ ‏\"‏ ‏.‏ قَالَ حُبَّ اللَّهِ وَرَسُولِهِ قَالَ ‏\"‏ فَإِنَّكَ\n مَعَ مَنْ أَحْبَبْتَ ‏\"‏ ‏.‏ قَالَ أَنَسٌ فَمَا فَرِحْنَا بَعْدَ الإِسْلاَمِ فَرَحًا أَشَدَّ مِنْ قَوْلِ النَّبِيِّ صلى\n الله عليه وسلم ‏\"‏ فَإِنَّكَ مَعَ مَنْ أَحْبَبْتَ ‏\"‏ ‏.‏ قَالَ أَنَسٌ فَأَنَا أُحِبُّ اللَّهَ وَرَسُولَهُ وَأَبَا بَكْرٍ\n وَعُمَرَ فَأَرْجُو أَنْ أَكُونَ مَعَهُمْ وَإِنْ لَمْ أَعْمَلْ بِأَعْمَالِهِمْ ‏.‏",
    "malay_translation": "Abu Rabiah Al-‘Atakiy telah meriwayatkan kepada saya, Hammad – iaitu Ibnu Zaid – telah meriwayatkan kepada kami, daripada Thaabit Al-Bunani, daripada Anas bin Malik, katanya: Seorang lelaki datang kepada Rasulullah SAW lalu berkata, \"Wahai Rasulullah, bilakah hari kiamat?\" Baginda menjawab, \"Apakah persediaan yang telah engkau buat untuk hari kiamat?\" Lelaki itu menjawab, \"Kecintaan kepada Allah dan Rasul-Nya.\" Baginda berkata, \"Maka sesungguhnya engkau akan bersama dengan orang yang engkau cintai.\" Anas berkata, \"Kami tidak pernah merasa gembira setelah memeluk Islam melainkan dengan perkataan Nabi SAW, \"Sesungguhnya engkau akan bersama dengan orang yang engkau cintai.\" Anas berkata lagi, \"Aku mencintai Allah, Rasul-Nya, Abu Bakar dan Umar. Maka aku berharap dapat bersama mereka walaupun aku tidak melakukan amal seperti mereka.\""
  },
  {
    "id": 13826,
    "hadith_number": 6549,
    "tajuk_hadith": "Kecintaan dan Kesannya",
    "perawi_melayu": "Anas bin Malik meriwayatkan daripada Rasulullah SAW melalui sanad lain, tetapi beliau tidak menyebut kata-kata Anas:",
    "english_text": "I love, and what follows subsequently.",
    "arabic_text": "حَدَّثَنَاهُ مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ، حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ،\n عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم وَلَمْ يَذْكُرْ قَوْلَ أَنَسٍ فَأَنَا أُحِبُّ ‏.‏ وَمَا\n بَعْدَهُ ‏.‏",
    "malay_translation": "Aku cinta, dan apa yang berikutnya."
  },
  {
    "id": 13827,
    "hadith_number": 6550,
    "tajuk_hadith": "Cinta Kepada Allah dan Rasul",
    "perawi_melayu": "Anas bin Malik meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ،\n عُثْمَانُ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، قَالَ بَيْنَمَا\n أَنَا وَرَسُولُ اللَّهِ، صلى الله عليه وسلم خَارِجَيْنِ مِنَ الْمَسْجِدِ فَلَقِينَا رَجُلاً عِنْدَ سُدَّةِ الْمَسْجِدِ\n فَقَالَ يَا رَسُولَ اللَّهِ مَتَى السَّاعَةُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا أَعْدَدْتَ لَهَا\n ‏\"‏ ‏.‏ قَالَ فَكَأَنَّ الرَّجُلَ اسْتَكَانَ ثُمَّ قَالَ يَا رَسُولَ اللَّهِ مَا أَعْدَدْتُ لَهَا كَبِيرَ صَلاَةٍ وَلاَ صِيَامٍ\n وَلاَ صَدَقَةٍ وَلَكِنِّي أُحِبُّ اللَّهَ وَرَسُولَهُ ‏.‏ قَالَ ‏\"‏ فَأَنْتَ مَعَ مَنْ أَحْبَبْتَ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Usman bin Abi Syaibah dan Ishaq bin Ibrahim. Ishaq berkata: Dia telah menceritakan kepada kami, dan Usman berkata: Telah menceritakan kepada kami Jarir, daripada Mansur, daripada Salim bin Abi al-Ja'd, telah menceritakan kepada kami Anas bin Malik, katanya: Ketika aku dan Rasulullah ﷺ keluar dari masjid, kami bertemu seorang lelaki di muka pintu masjid. Lelaki itu bertanya, \"Wahai Rasulullah, bilakah hari kiamat?\" Rasulullah ﷺ menjawab, \"Apakah persediaan yang telah engkau buat untuknya?\"  Lelaki itu seperti terdiam, kemudian berkata, \"Wahai Rasulullah, aku tidak banyak membuat persediaan solat, puasa dan sedekah, tetapi aku mencintai Allah dan Rasul-Nya.\" Rasulullah ﷺ bersabda, \"Maka engkau akan bersama dengan orang yang engkau cintai.\""
  },
  {
    "id": 13828,
    "hadith_number": 6551,
    "tajuk_hadith": "Sanad Hadis daripada Anas",
    "perawi_melayu": "Muhammad bin Yahya bin Abdul Aziz Al-Yasykuri meriwayatkan daripada Abdullah bin Usman bin Jabalah, yang memberitahu daripada bapanya, daripada Syu’bah, daripada Amr bin Murrah, daripada Salim bin Abi Al-Ja’d, daripada Anas, daripada Nabi SAW.",
    "english_text": "This hadith has been narrated on the authority of Anas through another chain of transmitters.",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ الْعَزِيزِ الْيَشْكُرِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ بْنِ،\n جَبَلَةَ أَخْبَرَنِي أَبِي، عَنْ شُعْبَةَ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ أَنَسٍ، عَنِ \n النَّبِيِّ صلى الله عليه وسلم بِنَحْوِهِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan melalui sanad yang lain daripada Anas bin Malik R.A.  Sanadnya ialah: Muhammad bin Yahya bin Abdul Aziz Al-Yasykuri meriwayatkan daripada Abdullah bin Usman bin Jabalah, yang memberitahu daripada bapanya, daripada Syu’bah, daripada Amr bin Murrah, daripada Salim bin Abi Al-Ja’d, daripada Anas, daripada Nabi SAW."
  },
  {
    "id": 13829,
    "hadith_number": 6552,
    "tajuk_hadith": "Hadis daripada Anas dengan Sanad Berbeza",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "This hadith has been reported on the authority of Anas with different chains of transmitters.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، ح \n وَحَدَّثَنَا ابْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ \n قَتَادَةَ، سَمِعْتُ أَنَسًا، ح \n وَحَدَّثَنَا أَبُو غَسَّانَ الْمِسْمَعِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا مُعَاذٌ، - يَعْنِي ابْنَ\n هِشَامٍ - حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا الْحَدِيثِ\n ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Anas dengan beberapa sanad yang berbeza."
  },
  {
    "id": 13830,
    "hadith_number": 6553,
    "tajuk_hadith": "Individu Bersama Mereka Yang Disayanginya",
    "perawi_melayu": "Abdullah melaporkan bahawa seorang lelaki datang kepada Rasulullah SAW dan berkata kepada Rasulullah SAW:",
    "english_text": "What is your opinion about the person who loves the people but his (acts or deeds are not identical to theirs)? Thereupon Allah's Messenger (ﷺ) said: A person would be along with one whom he loves.",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ،\n عُثْمَانُ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ\n اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ تَرَى فِي رَجُلٍ أَحَبَّ قَوْمًا وَلَمَّا يَلْحَقْ\n بِهِمْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْمَرْءُ مَعَ مَنْ أَحَبَّ ‏\"‏ ‏.‏",
    "malay_translation": "Abdullah meriwayatkan bahawa seorang lelaki datang kepada Rasulullah SAW lalu bertanya, \"Wahai Rasulullah, bagaimana pandangan tuan tentang seseorang yang mencintai suatu kaum, tetapi amalannya tidak sama dengan mereka?\"  Rasulullah SAW menjawab, \"Seseorang itu akan bersama dengan orang yang dicintainya.\""
  },
  {
    "id": 13831,
    "hadith_number": 6554,
    "tajuk_hadith": "Hadis daripada Abdullah",
    "perawi_melayu": "Abdullah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، ح وَحَدَّثَنِيهِ بِشْرُ،\n بْنُ خَالِدٍ أَخْبَرَنَا مُحَمَّدٌ، - يَعْنِي ابْنَ جَعْفَرٍ - كِلاَهُمَا عَنْ شُعْبَةَ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا \n أَبُو الْجَوَّابِ، حَدَّثَنَا سُلَيْمَانُ بْنُ قَرْمٍ، جَمِيعًا عَنْ سُلَيْمَانَ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، عَنِ \n النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
    "malay_translation": "Hadis ini telah diriwayatkan daripada Abdullah.  Sanadnya: Muhammad bin Muthanna dan Ibn Bashshar berkata: “Kami telah mendengar daripada Ibn Abi ‘Udy, dan Basyar bin Khalid memberitahu kami (daripada Muhammad, iaitu Ibnu Ja’far). Keduanya daripada Syu’bah. Dan kami mendengar daripada Ibnu Numair: “Kami mendengar daripada Abu al-Jawwab, kami mendengar daripada Sulaiman bin Qarm. Kesemuanya daripada Sulaiman, daripada Abi Wa’il, daripada Abdullah, daripada Nabi SAW.”"
  },
  {
    "id": 13832,
    "hadith_number": 6555,
    "tajuk_hadith": "Ziarah kepada Rasulullah SAW",
    "perawi_melayu": "Abu Musa al-Asy'ari",
    "english_text": "Abu Musa, reported that a person came to Allah's Messenger (ﷺ) ; the rest of the hadith is the same.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا ابْنُ،\n نُمَيْرٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَمُحَمَّدُ بْنُ عُبَيْدٍ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ أَبِي مُوسَى، قَالَ\n أَتَى النَّبِيَّ صلى الله عليه وسلم رَجُلٌ ‏.‏ فَذَكَرَ بِمِثْلِ حَدِيثِ جَرِيرٍ عَنِ الأَعْمَشِ ‏.‏",
    "malay_translation": "Abu Musa al-Asy'ari meriwayatkan bahawa seorang lelaki telah datang kepada Rasulullah SAW.  (Baki riwayat hadis ini adalah sama seperti hadis yang diriwayatkan oleh Jarir melalui al-A'masy)."
  },
  {
    "id": 13833,
    "hadith_number": 6556,
    "tajuk_hadith": "Ganjaran Amal Baik dan Pujian Manusia",
    "perawi_melayu": "Abu Dzar meriwayatkan:",
    "english_text": "It was said to Allah's Messenger (ﷺ): What is your opinion about the person who has done good deeds and the people praise him? He said: It is glad tidings for a believer (which he has received in this mortal world).",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَأَبُو الرَّبِيعِ، وَأَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ - وَاللَّفْظُ\n لِيَحْيَى - قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ،\n عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ، قَالَ قِيلَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَرَأَيْتَ\n الرَّجُلَ يَعْمَلُ الْعَمَلَ مِنَ الْخَيْرِ وَيَحْمَدُهُ النَّاسُ عَلَيْهِ قَالَ ‏\n\"‏ تِلْكَ عَاجِلُ بُشْرَى الْمُؤْمِنِ ‏\"‏\n ‏.‏",
    "malay_translation": "Dikatakan kepada Rasulullah SAW: Apakah pendapat tuan tentang seseorang yang melakukan amal kebaikan dan dipuji oleh manusia? Baginda menjawab: Itulah khabar gembira segera bagi seorang mukmin."
  },
  {
    "id": 13834,
    "hadith_number": 6557,
    "tajuk_hadith": "Kecintaan dan Pujian Orang Ramai",
    "perawi_melayu": "Hadis ini diriwayatkan melalui beberapa sanad.  Riwayat daripada Syu'bah menyebut:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، عَنْ وَكِيعٍ، ح وَحَدَّثَنَا مُحَمَّدُ،\n بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي عَبْدُ الصَّمَدِ، ح وَحَدَّثَنَا \n إِسْحَاقُ، أَخْبَرَنَا النَّضْرُ، كُلُّهُمْ عَنْ شُعْبَةَ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، بِإِسْنَادِ حَمَّادِ بْنِ زَيْدٍ ‏.‏\n بِمِثْلِ حَدِيثِهِ غَيْرَ أَنَّ فِي، حَدِيثِهِمْ عَنْ شُعْبَةَ غَيْرَ عَبْدِ الصَّمَدِ وَيُحِبُّهُ النَّاسُ عَلَيْهِ ‏.‏ وَفِي\n حَدِيثِ عَبْدِ الصَّمَدِ وَيَحْمَدُهُ النَّاسُ ‏.‏ كَمَا قَالَ حَمَّادٌ ‏.‏",
    "malay_translation": "Kami diberitakan oleh Abu Bakar bin Abi Syaibah, dan Ishaq bin Ibrahim, daripada Waki', dan kami diberitakan oleh Muhammad bin Bashshar,  kami diberitakan oleh Muhammad bin Ja'far, dan kami diberitakan oleh Muhammad bin Muthanna,  memeritakan kepadaku Abdus Samad, dan kami diberitakan oleh Ishaq, memberitakan kepada kami Nadhr, semuanya daripada Syu'bah, daripada Abu Imran al-Jauni, dengan sanad Hammad bin Zaid.  Dengan lafaz yang serupa dengan hadisnya, kecuali dalam hadis mereka daripada Syu'bah selain Abdus Samad,  iaitu 'orang ramai mencintainya'. Dan dalam hadis Abdus Samad, 'orang ramai memujinya', sebagaimana yang dikatakan oleh Hammad."
  }
]
