[
  {
    "id": 9287,
    "hadith_number": 2010,
    "tajuk_hadith": "Menggalakkan Mengucapkan 'La Ilaha Illallah' kepada Orang yang Nazak",
    "perawi_melayu": "Diriwayatkan oleh Abu Sa'id al-Khudri, Rasulullah (ﷺ) bersabda:",
    "english_text": "Exhort to recite\" There is no god but Allah\" to those of you who are dying.",
    "arabic_text": "وَحَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، فُضَيْلُ بْنُ حُسَيْنٍ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ كِلاَهُمَا عَنْ بِشْرٍ، - قَالَ أَبُو كَامِلٍ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، - حَدَّثَنَا عُمَارَةُ بْنُ غَزِيَّةَ، حَدَّثَنَا يَحْيَى، بْنُ عُمَارَةَ قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَقِّنُوا مَوْتَاكُمْ لاَ إِلَهَ إِلاَّ اللَّهُ ‏\"‏ ‏.‏",
    "malay_translation": "Galakkanlah orang yang hampir mati di antara kamu untuk mengucapkan 'La Ilaha Illallah' (Tiada Tuhan yang berhak disembah melainkan Allah)."
  },
  {
    "id": 9288,
    "hadith_number": 2011,
    "tajuk_hadith": "Hadis Ini Diriwayatkan dengan Rantaian Perawi yang Sama",
    "perawi_melayu": "",
    "english_text": "This hadith has been narrated by Sulaiman b. Bilal with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي الدَّرَاوَرْدِيَّ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، جَمِيعًا بِهَذَا الإِسْنَادِ ‏.‏",
    "malay_translation": "Hadis ini telah diriwayatkan oleh Sulaiman b. Bilal dengan sanad (rantaian perawi) yang sama."
  },
  {
    "id": 9289,
    "hadith_number": 2012,
    "tajuk_hadith": "Menggalakkan Mengucapkan La Ilaha Illa Allah kepada Orang yang Nazak",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "Exhort to recite\" There is no god but Allah\" to those of you who are dying.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرٍ، وَعُثْمَانُ، ابْنَا أَبِي شَيْبَةَ ح وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، قَالُوا جَمِيعًا حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ يَزِيدَ بْنِ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَقِّنُوا مَوْتَاكُمْ لاَ إِلَهَ إِلاَّ اللَّهُ ‏\"‏ ‏.‏",
    "malay_translation": "Galakkan untuk mengucapkan \"Tiada tuhan melainkan Allah\" kepada mereka yang sedang nazak di antara kamu."
  },
  {
    "id": 9290,
    "hadith_number": 2013,
    "tajuk_hadith": "Ganjaran bagi Muslim yang Ditimpa Musibah dan Mengucapkan 'Inna lillahi wa inna ilayhi raji'un'",
    "perawi_melayu": "Umm Salama melaporkan bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "If any Muslim who suffers some calamity says, what Allah has commanded him,\" We belong to Allah and to Him shall we return; O Allah, reward me for my affliction and give me something better than it in exchange for it,\" Allah will give him something better than it in exchange. When Abu Salama died she said: What Muslim is better than Abu Salama whose family was the first to emigrate to the Messenger of Allah (ﷺ). I then said the words, and Allah gave me God's Messenger (ﷺ) in exchange. She said: The Messenger of Allah (ﷺ) sent Hatib b. Abu Balta'a to deliver me the message of marriage with him. I said to him: I have a daughter (as my dependant) and I am of jealous temperament. He (the Holy Prophet) said: So far as her daughter is concerned, we would supplicate Allah, that He may free her (of her responsibility) and I would also supplicate Allah to do away with (her) jealous (temperament).",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ جَمِيعًا عَنْ إِسْمَاعِيلَ بْنِ جَعْفَرٍ، - قَالَ ابْنُ أَيُّوبَ حَدَّثَنَا إِسْمَاعِيلُ، - أَخْبَرَنِي سَعْدُ بْنُ سَعِيدٍ، عَنْ عُمَرَ بْنِ كَثِيرِ بْنِ أَفْلَحَ، عَنِ ابْنِ، سَفِينَةَ عَنْ أُمِّ سَلَمَةَ، أَنَّهَا قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَا مِنْ مُسْلِمٍ تُصِيبُهُ مُصِيبَةٌ فَيَقُولُ مَا أَمَرَهُ اللَّهُ إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ اللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي وَأَخْلِفْ لِي خَيْرًا مِنْهَا ‏.‏ إِلاَّ أَخْلَفَ اللَّهُ لَهُ خَيْرًا مِنْهَا ‏\"‏ ‏.‏ قَالَتْ فَلَمَّا مَاتَ أَبُو سَلَمَةَ قُلْتُ أَىُّ الْمُسْلِمِينَ خَيْرٌ مِنْ أَبِي سَلَمَةَ أَوَّلُ بَيْتٍ هَاجَرَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ ثُمَّ إِنِّي قُلْتُهَا فَأَخْلَفَ اللَّهُ لِي رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَتْ أَرْسَلَ إِلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم حَاطِبَ بْنَ أَبِي بَلْتَعَةَ يَخْطُبُنِي لَهُ فَقُلْتُ إِنَّ لِي بِنْتًا وَأَنَا غَيُورٌ ‏.‏ فَقَالَ ‏\"‏ أَمَّا ابْنَتُهَا فَنَدْعُو اللَّهَ أَنْ يُغْنِيَهَا عَنْهَا وَأَدْعُو اللَّهَ أَنْ يَذْهَبَ بِالْغَيْرَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Jika ada seorang Muslim yang ditimpa musibah lalu mengucapkan sebagaimana yang diperintahkan Allah kepadanya, \"Sesungguhnya kami adalah milik Allah dan kepada-Nya kami akan kembali; Ya Allah, berilah aku pahala atas musibahku dan berikanlah ganti yang lebih baik daripadanya,\" pasti Allah akan memberinya ganti yang lebih baik daripadanya. Ketika Abu Salama meninggal dunia, beliau (Ummu Salamah) berkata: Muslim mana yang lebih baik daripada Abu Salama, keluarga pertama yang berhijrah kepada Rasulullah (ﷺ). Kemudian aku mengucapkan kata-kata tersebut, dan Allah menggantikan untukku dengan Rasulullah (ﷺ). Beliau berkata: Rasulullah (ﷺ) mengutus Hatib bin Abu Balta'a untuk menyampaikan pesan lamaran perkahwinan kepada ku. Aku berkata kepadanya: Aku mempunyai seorang anak perempuan (sebagai tanggunganku) dan aku seorang yang pencemburu. Baginda (Nabi Muhammad ﷺ) bersabda: Adapun anak perempuannya, kami akan berdoa kepada Allah agar Dia mencukupkannya darinya (tanggungannya), dan aku juga akan berdoa kepada Allah agar menghilangkan sifat cemburu (nya)."
  },
  {
    "id": 9291,
    "hadith_number": 2014,
    "tajuk_hadith": "Ganjaran bagi Orang yang Ditimpa Musibah",
    "perawi_melayu": "Umm Salama, isteri Rasulullah (ﷺ), meriwayatkan bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "If any servant (of Allah) who suffers a calamity says:\" We belong to Allah and to Him shall we return; O Allah, reward me for my affliction and give me something better than it in exchange for it,\" ' Allah will give him reward for affliction, and would give him something better than it in exchange. She (Umm Salama) said: When Abu Salama died. I uttered (these very words) as I was commanded (to do) by the Messenger of Allah (ﷺ). So Allah gave me better in exchange than him. i. e. (I was taken as the wife of) the Messenger of Allah (ﷺ).",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ سَعْدِ بْنِ سَعِيدٍ، قَالَ أَخْبَرَنِي عُمَرُ بْنُ كَثِيرِ بْنِ أَفْلَحَ، قَالَ سَمِعْتُ ابْنَ سَفِينَةَ، يُحَدِّثُ أَنَّهُ سَمِعَ أُمَّ سَلَمَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم تَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَا مِنْ عَبْدٍ تُصِيبُهُ مُصِيبَةٌ فَيَقُولُ إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ اللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي وَأَخْلِفْ لِي خَيْرًا مِنْهَا إِلاَّ أَجَرَهُ اللَّهُ فِي مُصِيبَتِهِ وَأَخْلَفَ لَهُ خَيْرًا مِنْهَا ‏\"‏ ‏.‏ قَالَتْ فَلَمَّا تُوُفِّيَ أَبُو سَلَمَةَ قُلْتُ كَمَا أَمَرَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَخْلَفَ اللَّهُ لِي خَيْرًا مِنْهُ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Jika seorang hamba (Allah) yang ditimpa musibah berkata: \"Sesungguhnya kami adalah milik Allah dan kepada-Nya kami akan kembali; Ya Allah, berilah aku pahala atas musibahku dan berilah aku ganti yang lebih baik daripadanya,\" Allah akan memberinya pahala atas musibahnya, dan akan memberinya ganti yang lebih baik daripadanya. Umm Salama berkata: Ketika Abu Salama meninggal dunia, aku mengucapkan (kata-kata ini) seperti yang diperintahkan oleh Rasulullah (ﷺ). Maka Allah memberikan ganti yang lebih baik daripadanya kepadaku, iaitu (aku dijadikan isteri) Rasulullah (ﷺ)."
  },
  {
    "id": 9292,
    "hadith_number": 2015,
    "tajuk_hadith": "Keutamaan Abu Salama dan Perkahwinan Umm Salama dengan Rasulullah ﷺ",
    "perawi_melayu": "Umm Salama, isteri Rasulullah (ﷺ), meriwayatkan bahawa Rasulullah (ﷺ) bersabda seperti hadis yang diriwayatkan oleh Abu Usama, tetapi dengan tambahan bahawa beliau berkata:",
    "english_text": "\" When Abu Salama died I said: Who is better than Abu Salama, the Companion of the Messenger of Allah (ﷺ), and Allah decided for me and I said (these words contained in the supplication mentioned above) and I was married to the Messenger of Allah (ﷺ).",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سَعْدُ بْنُ سَعِيدٍ، أَخْبَرَنِي عُمَرُ، - يَعْنِي ابْنَ كَثِيرٍ - عَنِ ابْنِ سَفِينَةَ، مَوْلَى أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ بِمِثْلِ حَدِيثِ أَبِي أُسَامَةَ وَزَادَ قَالَتْ فَلَمَّا تُوُفِّيَ أَبُو سَلَمَةَ قُلْتُ مَنْ خَيْرٌ مِنْ أَبِي سَلَمَةَ صَاحِبِ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ عَزَمَ اللَّهُ لِي فَقُلْتُهَا ‏.‏ قَالَتْ فَتَزَوَّجْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Ketika Abu Salama meninggal dunia, saya berkata: Siapakah yang lebih baik daripada Abu Salama, sahabat Rasulullah (ﷺ), dan Allah telah mentakdirkan untukku dan saya mengucapkan (kata-kata ini terkandung dalam doa yang disebutkan di atas) dan saya berkahwin dengan Rasulullah (ﷺ)."
  },
  {
    "id": 9293,
    "hadith_number": 2016,
    "tajuk_hadith": "Doa Ketika Melawat Orang Sakit atau Mati dan Doa untuk Pengganti yang Lebih Baik",
    "perawi_melayu": "Umm Salama meriwayatkan bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "Whenever you visit the sick or the dead, supplicate for good because angels say\" Amen\" to whatever you say. She added: When Abu Salama died, I went to the Messenger of Allah (ﷺ) and said: Messenger of Allah, Abu Salama has died. He told me to recite:\" O Allah! forgive me and him (Abu Salama) and give me a better substitute than he.\" So I said (this), and Allah gave me in exchange Muhammad, who is better for me than him (Abu Salama).",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا حَضَرْتُمُ الْمَرِيضَ أَوِ الْمَيِّتَ فَقُولُوا خَيْرًا فَإِنَّ الْمَلاَئِكَةَ يُؤَمِّنُونَ عَلَى مَا تَقُولُونَ ‏\"‏ ‏.‏ قَالَتْ فَلَمَّا مَاتَ أَبُو سَلَمَةَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ أَبَا سَلَمَةَ قَدْ مَاتَ قَالَ ‏\"‏ قُولِي اللَّهُمَّ اغْفِرْ لِي وَلَهُ وَأَعْقِبْنِي مِنْهُ عُقْبَى حَسَنَةً ‏\"‏ ‏.‏ قَالَتْ فَقُلْتُ فَأَعْقَبَنِي اللَّهُ مَنْ هُوَ خَيْرٌ لِي مِنْهُ مُحَمَّدًا صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Apabila kamu melawat orang sakit atau orang mati, maka katakanlah yang baik kerana malaikat akan mengucapkan 'Amin' atas apa yang kamu katakan. Beliau menambah: Ketika Abu Salama meninggal dunia, saya pergi menemui Rasulullah (ﷺ) dan berkata: Wahai Rasulullah, Abu Salama telah meninggal dunia. Baginda bersabda: 'Katakanlah: Ya Allah! Ampunilah aku dan dia (Abu Salama), dan berilah aku pengganti yang lebih baik daripadanya.' Maka saya pun mengatakannya, lalu Allah menggantikan untukku dengan (Nabi) Muhammad, yang lebih baik bagiku daripada Abu Salama."
  },
  {
    "id": 9294,
    "hadith_number": 2017,
    "tajuk_hadith": "Doa Rasulullah untuk Abu Salamah",
    "perawi_melayu": "Umm Salama meriwayatkan:",
    "english_text": "The Messenger of Allah (may peace be upon came to Abu Salama (as he died). His eyes were fixedly open. He closed them, and then said: When the soul is taken away the sight follows it. Some of the people of his family wept and wailed. So he said: Do not supplicate for yourselves anything but good, for angels say\" Amen\" to what you say. He then said: O Allah, forgive Abu Salama, raise his degree among those who are rightly guided, grant him a successor in his descendants who remain. Forgive us and him, O Lord of the Universe, and make his grave spacious, and grant him light in it.",
    "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، حَدَّثَنَا أَبُو إِسْحَاقَ الْفَزَارِيُّ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلاَبَةَ، عَنْ قَبِيصَةَ بْنِ ذُؤَيْبٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى أَبِي سَلَمَةَ وَقَدْ شَقَّ بَصَرُهُ فَأَغْمَضَهُ ثُمَّ قَالَ ‏\"‏ إِنَّ الرُّوحَ إِذَا قُبِضَ تَبِعَهُ الْبَصَرُ ‏\"‏ ‏.‏ فَضَجَّ نَاسٌ مِنْ أَهْلِهِ فَقَالَ ‏\"‏ لاَ تَدْعُوا عَلَى أَنْفُسِكُمْ إِلاَّ بِخَيْرٍ فَإِنَّ الْمَلاَئِكَةَ يُؤَمِّنُونَ عَلَى مَا تَقُولُونَ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ اللَّهُمَّ اغْفِرْ لأَبِي سَلَمَةَ وَارْفَعْ دَرَجَتَهُ فِي الْمَهْدِيِّينَ وَاخْلُفْهُ فِي عَقِبِهِ فِي الْغَابِرِينَ وَاغْفِرْ لَنَا وَلَهُ يَا رَبَّ الْعَالَمِينَ وَافْسَحْ لَهُ فِي قَبْرِهِ ‏.‏ وَنَوِّرْ لَهُ فِيهِ ‏\"‏ ‏.‏",
    "malay_translation": "Umm Salama meriwayatkan: Rasulullah (semoga selawat dan salam ke atas baginda) datang kepada Abu Salama (ketika beliau meninggal dunia). Matanya terbuka luas. Baginda menutup matanya, dan kemudian bersabda: Sesungguhnya roh apabila dicabut, pandangan mata akan mengikutinya. Sebahagian ahli keluarganya menangis dan meratap. Maka baginda bersabda: Janganlah kamu mendoakan keburukan untuk diri kamu sendiri, kerana malaikat mengaminkan apa yang kamu ucapkan. Kemudian baginda bersabda: Ya Allah, ampunilah Abu Salama, tinggikanlah darjatnya di kalangan orang-orang yang mendapat hidayah, berilah pengganti kepadanya dalam keturunannya yang masih tinggal. Ampunilah kami dan dia, wahai Tuhan semesta alam, lapangkanlah kuburnya, dan berilah cahaya di dalamnya."
  },
  {
    "id": 9295,
    "hadith_number": 2018,
    "tajuk_hadith": "Doa untuk Si Mati: Pemeliharaan Warisan dan Keluasan Kubur",
    "perawi_melayu": "Hadith ini telah diriwayatkan oleh Khalid al Hadhdha' dengan sanad yang sama tetapi dengan perubahan ini bahawa dia berkata:",
    "english_text": "(O Allah! ) let Thee be the caretaker of what is left by him, and he said: Grant him expansion of the grave, but he did not say: Make his grave spacious. Khalid said: He supplicated for the seventh (thing too) which I have forgotten.",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى الْقَطَّانُ الْوَاسِطِيُّ، حَدَّثَنَا الْمُثَنَّى بْنُ مُعَاذِ بْنِ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ الْحَسَنِ، حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، بِهَذَا الإِسْنَادِ نَحْوَهُ غَيْرَ أَنَّهُ قَالَ ‏\"‏ وَاخْلُفْهُ فِي تَرِكَتِهِ ‏\"‏ ‏.‏ وَقَالَ ‏\"‏ اللَّهُمَّ أَوْسِعْ لَهُ فِي قَبْرِهِ ‏\"‏ ‏.‏ وَلَمْ يَقُلِ ‏\"‏ افْسَحْ لَهُ ‏\"‏ ‏.‏ وَزَادَ قَالَ خَالِدٌ الْحَذَّاءُ وَدَعْوَةٌ أُخْرَى سَابِعَةٌ نَسِيتُهَا ‏.‏",
    "malay_translation": "(Ya Allah! ) jadikanlah Engkau pemelihara bagi apa yang ditinggalkan olehnya, dan dia berkata: Kurniakanlah kepadanya keluasan kubur, tetapi dia tidak berkata: Jadikan kuburnya luas. Khalid berkata: Dia berdoa untuk perkara yang ketujuh (juga) yang aku telah lupakan."
  },
  {
    "id": 9296,
    "hadith_number": 2019,
    "tajuk_hadith": "Pandangan Mata Mayat Ketika Meninggal Dunia",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "Did you not see when the man died and his eyes were fixedly open? He (Abu Huraira) said: Yes. He (the Holy Prophet) said: It is due to the fact that when (the soul leaves the body) his eyesight follows the soul.",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، عَنِ الْعَلاَءِ بْنِ، يَعْقُوبَ قَالَ أَخْبَرَنِي أَبِي أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَلَمْ تَرَوُا الإِنْسَانَ إِذَا مَاتَ شَخَصَ بَصَرُهُ ‏\"‏ ‏.‏ قَالُوا بَلَى ‏.‏ قَالَ ‏\"‏ فَذَلِكَ حِينَ يَتْبَعُ بَصَرُهُ نَفْسَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Tidakkah kamu melihat apabila seseorang lelaki meninggal dunia dan matanya terbuka luas? Beliau (Abu Hurairah) berkata: Ya. Baginda (Nabi Suci) bersabda: Ini adalah kerana apabila (roh meninggalkan badan) pandangannya mengikut roh tersebut."
  },
  {
    "id": 9297,
    "hadith_number": 2020,
    "tajuk_hadith": "Hadis Diriwayatkan dengan Sanad yang Sama",
    "perawi_melayu": "",
    "english_text": "This hadith is narrated on the authority of 'Ala' with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي الدَّرَاوَرْدِيَّ - عَنِ الْعَلاَءِ، بِهَذَا الإِسْنَادِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada 'Ala' dengan sanad yang sama."
  },
  {
    "id": 9298,
    "hadith_number": 2021,
    "tajuk_hadith": "Larangan Membawa Syaitan Kembali ke Rumah yang Dibersihkan Allah",
    "perawi_melayu": "Umm Salama meriwayatkan:",
    "english_text": "When Abu Salama died I said: I am a stranger in a strange land; I shall weep for him in a manner that would be talked of. I made preparation for weeping for him when a woman from the upper side of the city came there who intended to help me (in weeping). She happened to come across the Messenger of Allah (ﷺ) and he said: Do you intend to bring the devil into a house from which Allah has twice driven him out? I (Umm Salama), therefore, refrained from weeping and I did not weep.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ كُلُّهُمْ عَنِ ابْنِ، عُيَيْنَةَ - قَالَ ابْنُ نُمَيْرٍ حَدَّثَنَا سُفْيَانُ، - عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ أَبِيهِ، عَنْ عُبَيْدِ بْنِ عُمَيْرٍ، قَالَ قَالَتْ أُمُّ سَلَمَةَ لَمَّا مَاتَ أَبُو سَلَمَةَ قُلْتُ غَرِيبٌ وَفِي أَرْضِ غُرْبَةٍ لأَبْكِيَنَّهُ بُكَاءً يُتَحَدَّثُ عَنْهُ ‏.‏ فَكُنْتُ قَدْ تَهَيَّأْتُ لِلْبُكَاءِ عَلَيْهِ إِذْ أَقْبَلَتِ امْرَأَةٌ مِنَ الصَّعِيدِ تُرِيدُ أَنْ تُسْعِدَنِي فَاسْتَقْبَلَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏\n\"‏ أَتُرِيدِينَ أَنْ تُدْخِلِي الشَّيْطَانَ بَيْتًا أَخْرَجَهُ اللَّهُ مِنْهُ ‏\"‏ ‏.‏ مَرَّتَيْنِ فَكَفَفْتُ عَنِ الْبُكَاءِ فَلَمْ أَبْكِ ‏.‏",
    "malay_translation": "Ketika Abu Salama meninggal dunia, saya berkata: 'Saya seorang asing di negeri yang asing; saya akan menangisinya dengan tangisan yang akan diperkatakan orang.' Saya telah bersiap sedia untuk menangisinya apabila seorang wanita dari bahagian atas kota datang yang berniat untuk membantu saya (dalam menangis). Dia kebetulan bertemu dengan Rasulullah (ﷺ) dan baginda bersabda: 'Adakah kamu berniat untuk membawa syaitan ke dalam rumah yang telah Allah halau daripadanya sebanyak dua kali?' Oleh itu, saya (Umm Salama) menahan diri daripada menangis dan saya tidak menangis."
  },
  {
    "id": 9299,
    "hadith_number": 2022,
    "tajuk_hadith": "Rahmat Allah di Hati Hamba-Nya",
    "perawi_melayu": "Diriwayatkan daripada Usama bin Zaid:",
    "english_text": "While we were with the Messenger of Allah (ﷺ), one of his daughters sent to him (the Messenger) to call him and inform him that her child or her son was dying. The Messenger of Allah (ﷺ) told the messenger to go back and tell her that what Allah had taken belonged to Him, and to him belonged what He granted; and He has an appointed time for everything. So you (the messenger) order her to show endurance and seek reward from Allah. The messenger came back and said: She adjures him to come to her. He got up to go accompanied by Sa'd b. 'Ubada, Mu'adh b. Jabal, and I also went along with them. The child was lifted to him and his soul was feeling as restless as if it was in an old (waterskin). His (Prophet's) eyes welled up with tears. Sa'd said: What is this, Messenger of Allah? He replied: This is compassion which Allah has placed in the hearts of His servants, and God shows compassion only to those of His servants who are compassionate.",
    "arabic_text": "حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا حَمَّادٌ، - يَعْنِي ابْنَ زَيْدٍ - عَنْ عَاصِمٍ الأَحْوَلِ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، قَالَ كُنَّا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَأَرْسَلَتْ إِلَيْهِ إِحْدَى بَنَاتِهِ تَدْعُوهُ وَتُخْبِرُهُ أَنَّ صَبِيًّا لَهَا - أَوِ ابْنًا لَهَا - فِي الْمَوْتِ فَقَالَ لِلرَّسُولِ ‏\"‏ ارْجِعْ إِلَيْهَا فَأَخْبِرْهَا إِنَّ لِلَّهِ مَا أَخَذَ وَلَهُ مَا أَعْطَى وَكُلُّ شَىْءٍ عِنْدَهُ بِأَجَلٍ مُسَمًّى فَمُرْهَا فَلْتَصْبِرْ وَلْتَحْتَسِبْ ‏\"‏ فَعَادَ الرَّسُولُ فَقَالَ إِنَّهَا قَدْ أَقْسَمَتْ لَتَأْتِيَنَّهَا ‏.‏ قَالَ فَقَامَ النَّبِيُّ صلى الله عليه وسلم وَقَامَ مَعَهُ سَعْدُ بْنُ عُبَادَةَ وَمُعَاذُ بْنُ جَبَلٍ وَانْطَلَقْتُ مَعَهُمْ فَرُفِعَ إِلَيْهِ الصَّبِيُّ وَنَفْسُهُ تَقَعْقَعُ كَأَنَّهَا فِي شَنَّةٍ فَفَاضَتْ عَيْنَاهُ فَقَالَ لَهُ سَعْدٌ مَا هَذَا يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ هَذِهِ رَحْمَةٌ جَعَلَهَا اللَّهُ فِي قُلُوبِ عِبَادِهِ وَإِنَّمَا يَرْحَمُ اللَّهُ مِنْ عِبَادِهِ الرُّحَمَاءَ ‏\"‏ ‏.‏",
    "malay_translation": "Ketika kami bersama Rasulullah ﷺ, salah seorang puteri baginda menghantar utusan untuk memanggil baginda dan memberitahu bahawa anaknya atau puteranya sedang nazak. Rasulullah ﷺ memberitahu utusan itu untuk kembali dan memberitahunya bahawa sesungguhnya bagi Allah-lah apa yang Dia ambil dan bagi-Nya pula apa yang Dia berikan. Segala sesuatu di sisi-Nya ada batas waktu yang ditentukan. Maka perintahkanlah dia untuk bersabar dan mengharapkan pahala dari Allah. Utusan itu kembali dan berkata: Sesungguhnya dia telah bersumpah agar baginda mendatanginya. Lalu Nabi ﷺ bangkit dan bersama baginda turut bangkit Sa'd bin 'Ubadah, Mu'adh bin Jabal dan aku pun pergi bersama mereka. Anak kecil itu diangkat kepada baginda, dan jiwanya bergoncang seolah-olah berada di dalam kirbat tua. Maka berlinanglah air mata baginda. Sa'd bertanya: Wahai Rasulullah, apakah ini? Baginda menjawab: Ini adalah rahmat yang Allah jadikan dalam hati hamba-hamba-Nya. Sesungguhnya Allah hanya merahmati hamba-hamba-Nya yang penyayang."
  },
  {
    "id": 9300,
    "hadith_number": 2023,
    "tajuk_hadith": "Jalur Periwayatan Lain",
    "perawi_melayu": "",
    "english_text": "This hadith has been narrated by another chain of transmitters on the authority of 'Asim al-Ahwal.",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا ابْنُ فُضَيْلٍ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي، شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، جَمِيعًا عَنْ عَاصِمٍ الأَحْوَلِ، بِهَذَا الإِسْنَادِ ‏.‏ غَيْرَ أَنَّ حَدِيثَ حَمَّادٍ أَتَمُّ وَأَطْوَلُ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan melalui jalur periwayatan lain daripada 'Asim al-Ahwal."
  },
  {
    "id": 9301,
    "hadith_number": 2024,
    "tajuk_hadith": "Tangisan Rasulullah SAW dan Larangan Azab Lidah",
    "perawi_melayu": "'Abdullah bin 'Umar meriwayatkan bahawa Sa'd bin Ubada mengadu sakit. Rasulullah (ﷺ) datang untuk menziarahinya bersama 'Abd al-Rahman bin 'Auf, Sa'd bin Abi Waqqas dan 'Abdullah bin Mas'ud. Ketika baginda masuk (ke biliknya), baginda mendapati beliau dalam keadaan pengsan. Lalu baginda bersabda:",
    "english_text": "Has he died? They said: Messenger of Allah, it is not so. The Messenger of Allah (ﷺ) wept. When the people saw Allah's Messenger (ﷺ) weeping, they also began to weep. He said. Listen, Allah does not punish for the tears that the eye sheds or the grief the heart feels, but He punishes for this (pointing to his tongue), or He may show mercy.",
    "arabic_text": "حَدَّثَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى الصَّدَفِيُّ، وَعَمْرُو بْنُ سَوَّادٍ الْعَامِرِيُّ، قَالاَ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ سَعِيدِ بْنِ الْحَارِثِ الأَنْصَارِيِّ، عَنْ عَبْدِ، اللَّهِ بْنِ عُمَرَ قَالَ اشْتَكَى سَعْدُ بْنُ عُبَادَةَ شَكْوَى لَهُ فَأَتَى رَسُولُ اللَّهِ صلى الله عليه وسلم يَعُودُهُ مَعَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَسَعْدِ بْنِ أَبِي وَقَّاصٍ وَعَبْدِ اللَّهِ بْنِ مَسْعُودٍ فَلَمَّا دَخَلَ عَلَيْهِ وَجَدَهُ فِي غَشِيَّةٍ فَقَالَ ‏\"‏ أَقَدْ قَضَى ‏\"‏ ‏.‏ قَالُوا لاَ يَا رَسُولَ اللَّهِ ‏.‏ فَبَكَى رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمَّا رَأَى الْقَوْمُ بُكَاءَ رَسُولِ اللَّهِ صلى الله عليه وسلم بَكَوْا فَقَالَ ‏\"‏ أَلاَ تَسْمَعُونَ إِنَّ اللَّهَ لاَ يُعَذِّبُ بِدَمْعِ الْعَيْنِ وَلاَ بِحُزْنِ الْقَلْبِ وَلَكِنْ يُعَذِّبُ بِهَذَا - وَأَشَارَ إِلَى لِسَانِهِ - أَوْ يَرْحَمُ ‏\"‏ ‏.‏",
    "malay_translation": "Adakah dia telah meninggal dunia? Mereka berkata: Rasulullah, tidak. Rasulullah (ﷺ) menangis. Apabila orang ramai melihat Rasulullah (ﷺ) menangis, mereka juga turut menangis. Baginda bersabda: Dengarlah, sesungguhnya Allah tidak menyeksa kerana air mata yang mengalir dari mata atau kesedihan yang dirasai hati, tetapi Dia menyeksa kerana ini (sambil menunjuk ke lidahnya), atau Dia mungkin merahmati."
  },
  {
    "id": 9302,
    "hadith_number": 2025,
    "tajuk_hadith": "Rasulullah (ﷺ) Menziarahi Sa'd bin 'Ubada",
    "perawi_melayu": "Diriwayatkan oleh Abdullah bin 'Umar:",
    "english_text": "While we were sitting with the Messenger of Allah (ﷺ), a person, one of the Ansar, came to him and greeted him. The Ansari then turned back. Upon this the Messenger of Allah (ﷺ) said: o brother of Ansar, how is my brother Sa'd be 'Ubada? He said: He is better. The Messenger of Allah (ﷺ) said: Who amongst you would visit him? He (the Holy Prophet) stood up and we also got up along with him, and we were more than ten persons. We had neither shoes with us, nor socks, nor caps, nor shirts. We walked on the barren land till we came to him. The people around him kept away till the Messenger of Allah (ﷺ) and his Companions with him came near him (Sa'd b. 'Ubada).",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ جَهْضَمٍ، حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ جَعْفَرٍ - عَنْ عُمَارَةَ، - يَعْنِي ابْنَ غَزِيَّةَ - عَنْ سَعِيدِ بْنِ الْحَارِثِ بْنِ الْمُعَلَّى، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ كُنَّا جُلُوسًا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ جَاءَهُ رَجُلٌ مِنَ الأَنْصَارِ فَسَلَّمَ عَلَيْهِ ثُمَّ أَدْبَرَ الأَنْصَارِيُّ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا أَخَا الأَنْصَارِ كَيْفَ أَخِي سَعْدُ بْنُ عُبَادَةَ ‏\"‏ ‏.‏ فَقَالَ صَالِحٌ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ يَعُودُهُ مِنْكُمْ ‏\"‏ ‏.‏ فَقَامَ وَقُمْنَا مَعَهُ وَنَحْنُ بِضْعَةَ عَشَرَ مَا عَلَيْنَا نِعَالٌ وَلاَ خِفَافٌ وَلاَ قَلاَنِسُ وَلاَ قُمُصٌ نَمْشِي فِي تِلْكَ السِّبَاخِ حَتَّى جِئْنَاهُ فَاسْتَأْخَرَ قَوْمُهُ مِنْ حَوْلِهِ حَتَّى دَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَصْحَابُهُ الَّذِينَ مَعَهُ ‏.‏",
    "malay_translation": "Semasa kami duduk bersama Rasulullah (ﷺ), seorang lelaki, salah seorang Ansar, datang kepadanya dan memberi salam. Kemudian Ansari itu berpaling. Selepas itu Rasulullah (ﷺ) bersabda: wahai saudara Ansar, bagaimana keadaan saudaraku Sa'd bin 'Ubada? Dia menjawab: Beliau lebih baik. Rasulullah (ﷺ) bersabda: Siapa di antara kamu yang akan menziarahinya? Baginda (Nabi Suci) berdiri dan kami juga bangun bersama baginda, dan kami lebih daripada sepuluh orang. Kami tidak memakai kasut, mahupun stoking, mahupun kopiah, mahupun baju. Kami berjalan di tanah tandus sehingga kami sampai kepadanya. Orang-orang di sekelilingnya menjauh sehingga Rasulullah (ﷺ) dan para Sahabatnya yang bersama baginda menghampirinya (Sa'd bin 'Ubada)."
  },
  {
    "id": 9303,
    "hadith_number": 2026,
    "tajuk_hadith": "Kesabaran Pada Kejutan Pertama",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "Endurance is to be shown at the first blow.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ الْعَبْدِيُّ، حَدَّثَنَا مُحَمَّدٌ، - يَعْنِي ابْنَ جَعْفَرٍ - حَدَّثَنَا شُعْبَةُ، عَنْ ثَابِتٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الصَّبْرُ عِنْدَ الصَّدْمَةِ الأُولَى ‏\"‏ ‏.‏",
    "malay_translation": "Kesabaran (yang sebenar) adalah pada kejutan pertama."
  },
  {
    "id": 9304,
    "hadith_number": 2027,
    "tajuk_hadith": "Kesabaran Pada Kejutan Pertama",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa Rasulullah (ﷺ) datang kepada seorang wanita yang sedang menangis atas kematian anaknya, dan bersabda kepadanya:",
    "english_text": "Fear Allah and show endurance. She (not recognising him) said: You have not been afflicted as I have been. When he (the Holy Prophet) had departed, it was said to her that he was the Messenger of Allah (ﷺ), she was mortally shocked. She came to his door and she did not find doorkeepers at his door. She said: Messenger of Allah. I did not recognise you. He said: Endurance is to be shown at first blow, or at the first blow.",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، أَخْبَرَنَا شُعْبَةُ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَتَى عَلَى امْرَأَةٍ تَبْكِي عَلَى صَبِيٍّ لَهَا فَقَالَ لَهَا ‏\"‏ اتَّقِي اللَّهَ وَاصْبِرِي ‏\"‏ ‏.‏ فَقَالَتْ وَمَا تُبَالِي بِمُصِيبَتِي ‏.‏ فَلَمَّا ذَهَبَ قِيلَ لَهَا إِنَّهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ فَأَخَذَهَا مِثْلُ الْمَوْتِ فَأَتَتْ بَابَهُ فَلَمْ تَجِدْ عَلَى بَابِهِ بَوَّابِينَ فَقَالَتْ يَا رَسُولَ اللَّهِ لَمْ أَعْرِفْكَ ‏.‏ فَقَالَ ‏\"‏ إِنَّمَا الصَّبْرُ عِنْدَ أَوَّلِ صَدْمَةٍ ‏\"‏ ‏.‏ أَوْ قَالَ ‏\"‏ عِنْدَ أَوَّلِ الصَّدْمَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Bertakwalah kepada Allah dan tunjukkan kesabaran. Wanita itu (tidak mengenalinya) berkata: Kamu tidak ditimpa musibah seperti yang menimpa saya. Ketika baginda (Nabi Muhammad SAW) telah pergi, dikatakan kepadanya bahawa baginda adalah Rasulullah (ﷺ), dia sangat terkejut. Dia datang ke pintu rumah baginda dan tidak mendapati penjaga pintu di pintu rumah baginda. Dia berkata: Rasulullah. Saya tidak mengenali kamu. Baginda bersabda: Sesungguhnya kesabaran itu (ditunjukkan) pada kejutan pertama, atau pada kejutan pertama."
  },
  {
    "id": 9305,
    "hadith_number": 2028,
    "tajuk_hadith": "Rasulullah Melalui Seorang Wanita di Kubur",
    "perawi_melayu": "Hadis seperti ini diriwayatkan dengan sanad yang sama tetapi dengan tambahan kata-kata ini:",
    "english_text": "\" The Apostle of Allah (ﷺ) happened to pass by a woman (who was sitting) by the side of a grave.\"",
    "arabic_text": "وَحَدَّثَنَاهُ يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، ح وَحَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو، ح وَحَدَّثَنِي أَحْمَدُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، حَدَّثَنَا عَبْدُ الصَّمَدِ، قَالُوا جَمِيعًا حَدَّثَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ نَحْوَ حَدِيثِ عُثْمَانَ بْنِ عُمَرَ بِقِصَّتِهِ ‏.‏ وَفِي حَدِيثِ عَبْدِ الصَّمَدِ مَرَّ النَّبِيُّ صلى الله عليه وسلم بِامْرَأَةٍ عِنْدَ قَبْرٍ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) kebetulan lalu di sisi seorang wanita (yang sedang duduk) di tepi kubur."
  },
  {
    "id": 9306,
    "hadith_number": 2029,
    "tajuk_hadith": "Larangan Meratapi Kematian Secara Berlebihan",
    "perawi_melayu": "'Abdullah bin 'Umar meriwayatkan bahawa Hafsa menangis untuk 'Umar (ketika beliau hampir meninggal dunia). Beliau ('Umar) berkata:",
    "english_text": "Be quiet, my daughter. Don't you know that the Messenger of Allah (ﷺ) had said:\" The deceased is punished because of his family's weeping over the death\"?",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، جَمِيعًا عَنِ ابْنِ بِشْرٍ، - قَالَ أَبُو بَكْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ الْعَبْدِيُّ، - عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، قَالَ حَدَّثَنَا نَافِعٌ، عَنْ عَبْدِ اللَّهِ، أَنَّ حَفْصَةَ، بَكَتْ عَلَى عُمَرَ فَقَالَ مَهْلاً يَا بُنَيَّةُ أَلَمْ تَعْلَمِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الْمَيِّتَ يُعَذَّبُ بِبُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏ ‏.‏",
    "malay_translation": "Tenanglah, wahai anak perempuanku. Tidakkah kamu tahu bahawa Rasulullah (ﷺ) telah bersabda: \"Si mati diazab disebabkan tangisan keluarganya atas kematiannya\"?"
  },
  {
    "id": 9307,
    "hadith_number": 2030,
    "tajuk_hadith": "Azab Kubur Disebabkan Ratapan",
    "perawi_melayu": "Umar melaporkan bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "The dead is punished in the grave because of wailing on it.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنِ ابْنِ عُمَرَ، عَنْ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْمَيِّتُ يُعَذَّبُ فِي قَبْرِهِ بِمَا نِيحَ عَلَيْهِ ‏\"‏ ‏.‏",
    "malay_translation": "Si mati diazab di dalam kuburnya disebabkan ratapan ke atasnya."
  },
  {
    "id": 9308,
    "hadith_number": 2031,
    "tajuk_hadith": "Hadis daripada Umar melalui Sanad Lain",
    "perawi_melayu": "",
    "english_text": "The same hadith is narrated on the authority of 'Umar through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ، بْنِ الْمُسَيَّبِ عَنِ ابْنِ عُمَرَ، عَنْ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْمَيِّتُ يُعَذَّبُ فِي قَبْرِهِ بِمَا نِيحَ عَلَيْهِ ‏\"‏ ‏.‏",
    "malay_translation": "Hadis yang sama diriwayatkan daripada 'Umar melalui sanad yang lain."
  },
  {
    "id": 9309,
    "hadith_number": 2032,
    "tajuk_hadith": "Azab Mayat Kerana Tangisan Orang Hidup",
    "perawi_melayu": "Ibn 'Umar meriwayatkan:",
    "english_text": "When 'Umar was wounded he fainted, and there was a loud lamentation over him. When he regained consciousness he said: Didn't you know that the Messenger of Allah (ﷺ) said:\" The dead is punished because of the weeping of the living\"?",
    "arabic_text": "وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الأَعْمَشِ، عَنْ أَبِي، صَالِحٍ عَنِ ابْنِ عُمَرَ، قَالَ لَمَّا طُعِنَ عُمَرُ أُغْمِيَ عَلَيْهِ فَصِيحَ عَلَيْهِ فَلَمَّا أَفَاقَ قَالَ أَمَا عَلِمْتُمْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبُكَاءِ الْحَىِّ ‏\"‏ ‏.‏",
    "malay_translation": "Ketika 'Umar cedera, beliau pengsan, dan terdapat ratapan yang kuat ke atasnya. Apabila beliau sedar kembali, beliau berkata: Tidakkah kamu tahu bahawa Rasulullah (ﷺ) bersabda: \"Sesungguhnya mayat diazab disebabkan tangisan orang yang hidup\"?"
  },
  {
    "id": 9310,
    "hadith_number": 2033,
    "tajuk_hadith": "Larangan Meratap bagi Si Mati",
    "perawi_melayu": "Abu Burda meriwayatkan daripada bapanya bahawa ketika 'Umar terluka, Suhaib mengucapkan (dengan suara yang kuat dalam ratapan):",
    "english_text": "O brother! Upon this 'Umar said: Suhaib, did you not know that the Messenger of Allah (ﷺ) said:\" The dead is punished because of the lamentation of the living\"?",
    "arabic_text": "حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الشَّيْبَانِيِّ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، قَالَ لَمَّا أُصِيبَ عُمَرُ جَعَلَ صُهَيْبٌ يَقُولُ وَاأَخَاهْ ‏.‏ فَقَالَ لَهُ عُمَرُ يَا صُهَيْبُ أَمَا عَلِمْتَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبُكَاءِ الْحَىِّ ‏\"‏ ‏.‏",
    "malay_translation": "Wahai saudaraku! Kemudian 'Umar berkata: Suhaib, tidakkah kamu tahu bahawa Rasulullah (ﷺ) bersabda: \"Sesungguhnya mayat diazab disebabkan tangisan orang yang hidup\"?"
  },
  {
    "id": 9311,
    "hadith_number": 2034,
    "tajuk_hadith": "Larangan Meratapi Mayat dan Penjelasan Aisyah",
    "perawi_melayu": "Abu Musa meriwayatkan bahawa ketika Umar terluka, Suhaib datang dari rumahnya dan pergi kepada Umar lalu berdiri di sisinya, dan mula meratap. Kemudian Umar berkata:",
    "english_text": "What are you weeping for? Are you weeping for me? He said: By Allah, it is for you that I weep, O Commander of the believers. He said: By Allah, you already know that the Messenger of Allah (ﷺ) had said: He who is lamented upon is punished. I made a mention of it to Musa b. Talha, and he said that 'A'isha told that it concerned the Jews (only).",
    "arabic_text": "وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا شُعَيْبُ بْنُ صَفْوَانَ أَبُو يَحْيَى، عَنْ عَبْدِ الْمَلِكِ بْنِ، عُمَيْرٍ عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى، عَنْ أَبِي مُوسَى، قَالَ لَمَّا أُصِيبَ عُمَرُ أَقْبَلَ صُهَيْبٌ مِنْ مَنْزِلِهِ حَتَّى دَخَلَ عَلَى عُمَرَ فَقَامَ بِحِيَالِهِ يَبْكِي فَقَالَ عُمَرُ عَلاَمَ تَبْكِي أَعَلَىَّ تَبْكِي قَالَ إِي وَاللَّهِ لَعَلَيْكَ أَبْكِي يَا أَمِيرَ الْمُؤْمِنِينَ ‏.‏ قَالَ وَاللَّهِ لَقَدْ عَلِمْتَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ يُبْكَى عَلَيْهِ يُعَذَّبُ ‏\"‏ ‏.‏ قَالَ فَذَكَرْتُ ذَلِكَ لِمُوسَى بْنِ طَلْحَةَ فَقَالَ كَانَتْ عَائِشَةُ تَقُولُ إِنَّمَا كَانَ أُولَئِكَ الْيَهُودَ ‏.‏",
    "malay_translation": "“Kenapa kamu menangis? Adakah kamu menangis untukku?” Dia berkata: “Demi Allah, untukmu aku menangis, wahai Amirul Mukminin.” Dia berkata: “Demi Allah, kamu sudah tahu bahawa Rasulullah (ﷺ) telah bersabda: ‘Sesiapa yang diratapi akan diazab.’” Dia berkata: “Aku menyebutkannya kepada Musa bin Talha, dan dia berkata bahawa Aisyah memberitahu bahawa ia berkenaan dengan orang Yahudi (sahaja).”"
  },
  {
    "id": 9312,
    "hadith_number": 2035,
    "tajuk_hadith": "Larangan Meratapi Mayat dan Azab Bagi yang Diratapi",
    "perawi_melayu": "Diriwayatkan oleh Anas",
    "english_text": "O Hafsa, did you not hear the Messenger of Allah (ﷺ) saying:\" One who is lamented would be punished\"? Suhaib also lamented over him. 'Umar told him also: O Suhaib, didn't you know that one who is lamented is punished?",
    "arabic_text": "وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، لَمَّا طُعِنَ عَوَّلَتْ عَلَيْهِ حَفْصَةُ فَقَالَ يَا حَفْصَةُ أَمَا سَمِعْتِ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ الْمُعَوَّلُ عَلَيْهِ يُعَذَّبُ ‏\"‏ ‏.‏ وَعَوَّلَ عَلَيْهِ صُهَيْبٌ فَقَالَ عُمَرُ يَا صُهَيْبُ أَمَا عَلِمْتَ ‏\"‏ أَنَّ الْمُعَوَّلَ عَلَيْهِ يُعَذَّبُ ‏\"‏ ‏.‏",
    "malay_translation": "Wahai Hafsa, tidakkah kamu mendengar Rasulullah ﷺ bersabda: \"Seseorang yang diratapi akan diazab\"? Suhaib juga meratapinya. Umar berkata kepadanya juga: Wahai Suhaib, tidakkah kamu tahu bahawa seseorang yang diratapi akan diazab?"
  },
  {
    "id": 9313,
    "hadith_number": 2036,
    "tajuk_hadith": "Mayat Diazab Disebabkan Tangisan Keluarganya?",
    "perawi_melayu": "Diriwayatkan oleh Abdullah b. Abu Mulaika:",
    "english_text": "I was sitting by the side of Ibn 'Umar, and we were waiting for the bier of Umm Aban, daughter of 'Uthman, and there was also 'Amr b. 'Uthman. In the meanwhile there came Ibn 'Abbas led by a guide. I conceive that he was informed of the place of Ibn 'Umar. So he came till he sat by my side. While I was between them (Ibn 'Abbas and Ibn 'Umar) there came the noise (of wailing) from the house. Upon this Ibn 'Umar said (that is, he pointed out to 'Amr that he should stand and forbid them, for): I heard the Messenger of Allah (ﷺ) as saying: The dead is punished because of the lamentation of his family. 'Abdullah made it general (what was said for a particular occasion). Ibn 'Abbas said: When we were with the Commander of the believers, 'Umar b. Khattab, we reached Baida', and there was a man under the shadow of the tree. He said to me: Go and inform me who is that person. So I went and (found) that he was Suhaib. I returned to him and said: You commanded me to find out for you who that was, and he is Suhaib. He (Hadrat 'Umar) said: Command him to see us. I said: He has family along with him. He said: (That is of no account) even if he has family along with him. So he (the narrator) told him to see (the Commander of the believers and his party). When we came (to Medina), it was before long that the Commander of the believers was wounded, and Suhaib came weeping and crying: Alas for the brother, alas for the companion. Upon this 'Umar said: Didn't you know, or didn't you hear, that the Messenger of Allah (ﷺ) said:\" The dead is punished because of the lamentation of his family\"? Then 'Abdullah made it general and 'Umar told it of certain occasions. So I ('Abdullah b. Abu Mulaika) stood up and went to 'A'isha and told her what Ibn 'Umar had said. Upon this she said: I swear by Allah that Allah's Messenger (ﷺ) never said that dead would be punished because of his family's lamenting (for him). What he said was that Allah would increase the punishment of the unbeliever because of his family's lamenting for him. Verily it is Allah Who has caused laughter and weeping. No bearer of a burden will bear another's burden. Ibn Abu Mulaika said that al-Qasim b. Muhammad said that when the words of 'Umar and Ibn 'Umar were conveyed to 'A'isha, she said: You have narrated it to me from those who are neither liar nor those suspected of lying but (sometimes) hearing misleads.",
    "arabic_text": "حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، حَدَّثَنَا أَيُّوبُ، عَنْ عَبْدِ اللَّهِ بْنِ، أَبِي مُلَيْكَةَ قَالَ كُنْتُ جَالِسًا إِلَى جَنْبِ ابْنِ عُمَرَ وَنَحْنُ نَنْتَظِرُ جَنَازَةَ أُمِّ أَبَانٍ بِنْتِ عُثْمَانَ وَعِنْدَهُ عَمْرُو بْنُ عُثْمَانَ فَجَاءَ ابْنُ عَبَّاسٍ يَقُودُهُ قَائِدٌ فَأُرَاهُ أَخْبَرَهُ بِمَكَانِ ابْنِ عُمَرَ، فَجَاءَ حَتَّى جَلَسَ إِلَى جَنْبِي فَكُنْتُ بَيْنَهُمَا فَإِذَا صَوْتٌ مِنَ الدَّارِ فَقَالَ ابْنُ عُمَرَ - كَأَنَّهُ يَعْرِضُ عَلَى عَمْرٍو أَنْ يَقُومَ فَيَنْهَاهُمْ - سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبُكَاءِ أَهْلِهِ ‏\"‏ ‏.‏ قَالَ فَأَرْسَلَهَا عَبْدُ اللَّهِ مُرْسَلَةً ‏.‏\n فَقَالَ ابْنُ عَبَّاسٍ كُنَّا مَعَ أَمِيرِ الْمُؤْمِنِينَ عُمَرَ بْنِ الْخَطَّابِ حَتَّى إِذَا كُنَّا بِالْبَيْدَاءِ إِذَا هُوَ بِرَجُلٍ نَازِلٍ فِي شَجَرَةٍ فَقَالَ لِيَ اذْهَبْ فَاعْلَمْ لِي مَنْ ذَاكَ الرَّجُلُ ‏.‏ فَذَهَبْتُ فَإِذَا هُوَ صُهَيْبٌ ‏.‏ فَرَجَعْتُ إِلَيْهِ فَقُلْتُ إِنَّكَ أَمَرْتَنِي أَنْ أَعْلَمَ لَكَ مَنْ ذَاكَ وَإِنَّهُ صُهَيْبٌ ‏.‏ قَالَ مُرْهُ فَلْيَلْحَقْ بِنَا ‏.‏ فَقُلْتُ إِنَّ مَعَهُ أَهْلَهُ ‏.‏ قَالَ وَإِنْ كَانَ مَعَهُ أَهْلُهُ - وَرُبَّمَا قَالَ أَيُّوبُ مُرْهُ فَلْيَلْحَقْ بِنَا - فَلَمَّا قَدِمْنَا لَمْ يَلْبَثْ أَمِيرُ الْمُؤْمِنِينَ أَنْ أُصِيبَ فَجَاءَ صُهَيْبٌ يَقُولُ وَاأَخَاهْ وَاصَاحِبَاهْ ‏.‏ فَقَالَ عُمَرُ أَلَمْ تَعْلَمْ أَوْ لَمْ تَسْمَعْ - قَالَ أَيُّوبُ أَوْ قَالَ أَوَلَمْ تَعْلَمْ أَوَلَمْ تَسْمَعْ - أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبَعْضِ بُكَاءِ أَهْلِهِ ‏\"‏ ‏.‏ قَالَ فَأَمَّا عَبْدُ اللَّهِ فَأَرْسَلَهَا مُرْسَلَةً وَأَمَّا عُمَرُ فَقَالَ بِبَعْضٍ ‏.‏\n فَقُمْتُ فَدَخَلْتُ عَلَى عَائِشَةَ فَحَدَّثْتُهَا بِمَا، قَالَ ابْنُ عُمَرَ فَقَالَتْ لاَ وَاللَّهِ مَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَطُّ ‏\"‏ إِنَّ الْمَيِّتَ يُعَذَّبُ بِبُكَاءِ أَحَدٍ ‏\"‏ ‏.‏ وَلَكِنَّهُ قَالَ ‏\"‏ إِنَّ الْكَافِرَ يَزِيدُهُ اللَّهُ بِبُكَاءِ أَهْلِهِ عَذَابًا وَإِنَّ اللَّهَ لَهُوَ أَضْحَكَ وَأَبْكَى وَلاَ تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى ‏\"‏ ‏.‏ قَالَ أَيُّوبُ قَالَ ابْنُ أَبِي مُلَيْكَةَ حَدَّثَنِي الْقَاسِمُ بْنُ مُحَمَّدٍ قَالَ لَمَّا بَلَغَ عَائِشَةَ قَوْلُ عُمَرَ وَابْنِ عُمَرَ قَالَتْ إِنَّكُمْ لَتُحَدِّثُونِّي عَنْ غَيْرِ كَاذِبَيْنِ وَلاَ مُكَذَّبَيْنِ وَلَكِنَّ السَّمْعَ يُخْطِئُ ‏.‏",
    "malay_translation": "Saya sedang duduk di sisi Ibn 'Umar, dan kami sedang menunggu jenazah Umm Aban, anak perempuan 'Uthman, dan di sana juga ada 'Amr b. 'Uthman. Sementara itu datanglah Ibn 'Abbas yang dipimpin oleh seorang penunjuk jalan. Saya rasa dia telah diberitahu tentang tempat Ibn 'Umar. Maka dia datang sehingga dia duduk di sisi saya. Ketika saya berada di antara mereka (Ibn 'Abbas dan Ibn 'Umar) terdengar suara (ratapan) dari rumah. Atas hal ini Ibn 'Umar berkata (iaitu, dia mengisyaratkan kepada 'Amr agar dia berdiri dan melarang mereka, kerana): Saya mendengar Rasulullah (ﷺ) bersabda: Sesungguhnya mayat diazab disebabkan tangisan keluarganya. 'Abdullah menjadikannya umum (apa yang dikatakan untuk kesempatan tertentu). Ibn 'Abbas berkata: Ketika kami bersama Amirul Mukminin, 'Umar b. Khattab, kami sampai di Baida', dan di sana ada seorang lelaki di bawah naungan pohon. Dia berkata kepada saya: Pergi dan beritahu saya siapa orang itu. Maka saya pergi dan (mendapati) bahawa dia adalah Suhaib. Saya kembali kepadanya dan berkata: Anda memerintahkan saya untuk mencari tahu untuk anda siapa orang itu, dan dia adalah Suhaib. Dia (Hadrat 'Umar) berkata: Perintahkan dia untuk menemui kami. Saya berkata: Dia mempunyai keluarga bersamanya. Dia berkata: (Itu tidak menjadi masalah) walaupun dia mempunyai keluarga bersamanya. Maka dia (perawi) menyuruhnya untuk menemui (Amirul Mukminin dan rombongannya). Ketika kami tiba (di Madinah), tidak lama kemudian Amirul Mukminin terluka, dan Suhaib datang menangis dan meratap: Aduhai saudara, aduhai sahabat. Atas hal ini 'Umar berkata: Tidakkah kamu tahu, atau tidakkah kamu mendengar, bahawa Rasulullah (ﷺ) bersabda: \"Sesungguhnya mayat diazab disebabkan sebahagian tangisan keluarganya\"? Kemudian 'Abdullah menjadikannya umum dan 'Umar menceritakannya tentang kesempatan tertentu. Maka saya ('Abdullah b. Abu Mulaika) berdiri dan pergi menemui 'A'isha dan memberitahunya apa yang telah dikatakan Ibn 'Umar. Atas hal ini dia berkata: Demi Allah, Rasulullah (ﷺ) tidak pernah bersabda bahawa mayat akan diazab disebabkan ratapan keluarganya (untuknya). Apa yang baginda sabdakan adalah bahawa Allah akan menambahkan azab orang kafir disebabkan ratapan keluarganya untuknya. Sesungguhnya Allah yang menyebabkan tertawa dan menangis. Tidak ada seorang pun yang memikul beban akan memikul beban orang lain. Ibn Abu Mulaika berkata bahawa al-Qasim b. Muhammad berkata bahawa ketika perkataan 'Umar dan Ibn 'Umar disampaikan kepada 'A'isha, dia berkata: Kamu telah meriwayatkannya kepada saya dari orang-orang yang bukan pendusta dan bukan pula orang yang dicurigai berdusta tetapi (kadang-kadang) pendengaran tersalah.",
    "urdu_text": "ہم سے داؤد بن رشید نے بیان کیا، کہا کہ ہم سے اسماعیل بن علیہ نے بیان کیا، کہا کہ ہم سے ایوب نے عبداللہ بن ابی ملیکہ سے بیان کیا، انہوں نے کہا کہ میں ابن عمر رضی اللہ عنہما کے پہلو میں بیٹھا ہوا تھا اور ہم ام ابان بنت عثمان رضی اللہ عنہما کے جنازہ کا انتظار کر رہے تھے اور وہاں عمرو بن عثمان بھی موجود تھے۔ اتنے میں ابن عباس رضی اللہ عنہما آئے اور ایک شخص ان کی رہبری کر رہا تھا۔ میرا خیال ہے کہ انہیں ابن عمر رضی اللہ عنہما کے مکان کا علم ہو گیا تھا۔ پس وہ آئے اور میرے پہلو میں بیٹھ گئے۔ میں ان دونوں (ابن عباس اور ابن عمر رضی اللہ عنہم) کے بیچ میں تھا۔ کیا دیکھتا ہوں کہ گھر سے رونے پیٹنے کی آواز آ رہی ہے۔ اس پر ابن عمر رضی اللہ عنہما نے (یعنی عمرو کو اشارہ کیا کہ وہ کھڑے ہو کر انہیں منع کریں کیونکہ) فرمایا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے آپ صلی اللہ علیہ وسلم فرماتے تھے ”میت کو اس کے گھر والوں کے نوحہ کرنے سے عذاب ہوتا ہے۔“ عبداللہ بن عمر رضی اللہ عنہما نے اس حدیث کو عام رکھا (یعنی کسی خاص موقع کے ساتھ مخصوص نہیں کیا)۔ ابن عباس رضی اللہ عنہما نے کہا کہ ہم امیرالمؤمنین عمر بن خطاب رضی اللہ عنہ کے ساتھ تھے یہاں تک کہ جب ہم مقام بیداء میں پہنچے تو کیا دیکھتے ہیں کہ ایک شخص درخت کے سایہ میں اترا ہوا ہے۔ عمر رضی اللہ عنہ نے مجھ سے کہا کہ جاؤ معلوم کرو یہ کون شخص ہے۔ میں گیا تو وہ صہیب رضی اللہ عنہ تھے۔ میں ان کے پاس سے لوٹ کر آیا اور کہا کہ آپ نے مجھے حکم دیا تھا کہ میں معلوم کروں کہ یہ کون شخص ہیں؟ وہ صہیب رضی اللہ عنہ ہیں۔ عمر رضی اللہ عنہ نے کہا کہ ان سے کہو کہ ہم سے آ ملیں۔ میں نے کہا کہ ان کے ساتھ ان کے اہل و عیال بھی ہیں۔ عمر رضی اللہ عنہ نے کہا کہ اگرچہ ان کے اہل و عیال بھی ان کے ساتھ ہوں۔ بیان کیا کہ ایوب نے یہ بھی کہا کہ عمر رضی اللہ عنہ نے کہا کہ ان سے کہو کہ ہم سے آ ملیں۔ پھر جب ہم مدینہ پہنچے تو امیرالمؤمنین کو زخم لگے اور صہیب رضی اللہ عنہ روتے اور چلاتے ہوئے آئے اور کہنے لگے ہائے میرے بھائی، ہائے میرے دوست۔ اس پر عمر رضی اللہ عنہ نے کہا کیا تمہیں معلوم نہیں یا تم نے سنا نہیں، ایوب نے کہا یا یہ کہا کیا تمہیں معلوم نہیں کیا تم نے سنا نہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”میت کو اس کے گھر والوں کے بعض نوحہ کرنے سے عذاب ہوتا ہے۔“ بیان کیا کہ عبداللہ بن عمر رضی اللہ عنہما نے تو اس حدیث کو عام رکھا اور عمر رضی اللہ عنہ نے بعض کے ساتھ مقید کیا۔ بیان کیا کہ پھر میں کھڑا ہوا اور ام المؤمنین عائشہ رضی اللہ عنہا کے پاس گیا اور انہیں ابن عمر رضی اللہ عنہما کا قول بیان کیا۔ اس پر انہوں نے کہا اللہ کی قسم! رسول اللہ صلی اللہ علیہ وسلم نے کبھی یہ نہیں فرمایا کہ میت کو کسی کے نوحہ کرنے سے عذاب ہوتا ہے بلکہ آپ صلی اللہ علیہ وسلم نے تو یہ فرمایا کہ کافر کو اللہ تعالیٰ اس کے گھر والوں کے نوحہ کرنے سے عذاب میں اور زیادہ کر دے گا اور بیشک اللہ ہی ہنساتا اور رلاتا ہے اور کوئی شخص دوسرے کا بوجھ نہیں اٹھائے گا۔ ابن ابی ملیکہ نے بیان کیا کہ قاسم بن محمد نے کہا کہ جب عمر اور ابن عمر رضی اللہ عنہما کی بات عائشہ رضی اللہ عنہا کو پہنچی تو انہوں نے کہا کہ تم لوگ مجھ سے ان لوگوں کی حدیثیں بیان کرتے ہو جو نہ جھوٹے ہیں اور نہ ان پر جھوٹ کا گمان ہو سکتا ہے لیکن (کبھی) سننے میں غلطی ہو جاتی ہے۔"
  },
  {
    "id": 9314,
    "hadith_number": 2037,
    "tajuk_hadith": "Larangan Meratap dan Penjelasan Mengenai Hukuman Mayat Kerana Ratapan Keluarga",
    "perawi_melayu": "Abdullah b. Abu Mulaika berkata:",
    "english_text": "The daughter of 'Uthman b. 'Affan died in Mecca. We came to attend her (funeral). Ibn 'Umar and Ibn 'Abbas were also present there, and I was sitting between them. He added: I (first sat) by the side of one of them, then the other one came and he sat by my side. 'Abdullah b. 'Umar said to 'Amr b. 'Uthman who was sitting opposite to him: Will you not prevent the people from lamenting, for the Messenger of Allah (ﷺ) had said:\" The dead is punished because of the lamenting of his family for him\"? Ibn 'Abbas then said that Umar used to say someting of that nature, and then narrated saying: I proceeded from Mecca along with 'Umar till we reached al-Baida' and there was a party of riders under the shade of a tree. He said (to me): Go and find out who this party is. I cast a glance and there was Suhaib (in that party). So I informed him ('Umar) about it. He said: Call him to me. So I went back to Suhaib and said: Go and meet the Commander of the believers. When 'Umar was wounded, Suhaib came walling: Alas, for the brother! alas for the companion! 'Umar said: O Suhaib, do you wail for me, whereas the Messenger of Allah (ﷺ) said:\" The dead would be punished on account of the lamentation of the (members of his family)\"? Ibn 'Abbas said: When 'Umar died I made a mention of it to 'A'isha. She said: May Allah have mercy upon 'Umar! I swear by Allah that Allah's Messenger (ﷺ) never said that Allah would punish the believer because of the weeping (of any one of the members of his family), but he said that Allah would increase the punishment of the unbeliever because of the weeping of his family over him. 'A'isha said: The Qur'an is enough for you (when it states):\" No bearer of burden will bear another's burden\" (vi. 164). Thereupon Ibn 'Abbas said: Allah is He Who has caused laughter and weeping. Ibn Abu Mulaika said: By Allah, Ibn 'Umar said nothing.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ ابْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ أَبِي مُلَيْكَةَ، قَالَ تُوُفِّيَتِ ابْنَةٌ لِعُثْمَانَ بْنِ عَفَّانَ بِمَكَّةَ قَالَ فَجِئْنَا لِنَشْهَدَهَا - قَالَ - فَحَضَرَهَا ابْنُ عُمَرَ وَابْنُ عَبَّاسٍ قَالَ وَإِنِّي لَجَالِسٌ بَيْنَهُمَا - قَالَ - جَلَسْتُ إِلَى أَحَدِهِمَا ثُمَّ جَاءَ الآخَرُ فَجَلَسَ إِلَى جَنْبِي فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ لِعَمْرِو بْنِ عُثْمَانَ وَهُوَ مُوَاجِهُهُ أَلاَ تَنْهَى عَنِ الْبُكَاءِ فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏ ‏.‏\n فَقَالَ ابْنُ عَبَّاسٍ قَدْ كَانَ عُمَرُ يَقُولُ بَعْضَ ذَلِكَ ثُمَّ حَدَّثَ فَقَالَ صَدَرْتُ مَعَ عُمَرَ مِنْ مَكَّةَ حَتَّى إِذَا كُنَّا بِالْبَيْدَاءِ إِذَا هُوَ بِرَكْبٍ تَحْتَ ظِلِّ شَجَرَةٍ فَقَالَ اذْهَبْ فَانْظُرْ مَنْ هَؤُلاَءِ الرَّكْبُ فَنَظَرْتُ فَإِذَا هُوَ صُهَيْبٌ - قَالَ - فَأَخْبَرْتُهُ فَقَالَ ادْعُهُ لِي ‏.‏ قَالَ فَرَجَعْتُ إِلَى صُهَيْبٍ فَقُلْتُ ارْتَحِلْ فَالْحَقْ أَمِيرَ الْمُؤْمِنِينَ ‏.‏ فَلَمَّا أَنْ أُصِيبَ عُمَرُ دَخَلَ صُهَيْبٌ يَبْكِي يَقُولُ وَاأَخَاهْ وَاصَاحِبَاهْ ‏.‏ فَقَالَ عُمَرُ يَا صُهَيْبُ أَتَبْكِي عَلَىَّ وَقَدْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ الْمَيِّتَ يُعَذَّبُ بِبَعْضِ بُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏ ‏.‏\n فَقَالَ ابْنُ عَبَّاسٍ فَلَمَّا مَاتَ عُمَرُ ذَكَرْتُ ذَلِكَ لِعَائِشَةَ فَقَالَتْ يَرْحَمُ اللَّهُ عُمَرَ لاَ وَاللَّهِ مَا حَدَّثَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ يُعَذِّبُ الْمُؤْمِنَ بِبُكَاءِ أَحَدٍ ‏\"‏ ‏.‏ وَلَكِنْ قَالَ ‏\"‏ إِنَّ اللَّهَ يَزِيدُ الْكَافِرَ عَذَابًا بِبُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏ قَالَ وَقَالَتْ عَائِشَةُ حَسْبُكُمُ الْقُرْآنُ ‏{‏ وَلاَ تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى‏}‏ قَالَ وَقَالَ ابْنُ عَبَّاسٍ عِنْدَ ذَلِكَ وَاللَّهُ أَضْحَكَ وَأَبْكَى ‏.‏ قَالَ ابْنُ أَبِي مُلَيْكَةَ فَوَاللَّهِ مَا قَالَ ابْنُ عُمَرَ مِنْ شَىْءٍ ‏.‏",
    "malay_translation": "Anak perempuan Uthman b. Affan meninggal dunia di Mekah. Kami datang untuk menghadiri (jenazahnya). Ibn Umar dan Ibn Abbas juga hadir di sana, dan saya duduk di antara mereka. Dia menambah: Saya (mula-mula duduk) di sisi salah seorang daripada mereka, kemudian yang lain datang dan dia duduk di sisi saya. Abdullah b. Umar berkata kepada Amr b. Uthman yang duduk bertentangan dengannya: Tidakkah kamu mencegah orang ramai daripada meratap, kerana Rasulullah (ﷺ) telah bersabda: \"Sesungguhnya mayat diazab kerana ratapan keluarganya untuknya\"? Ibn Abbas kemudian berkata bahawa Umar pernah mengatakan sesuatu yang serupa, dan kemudian meriwayatkan dengan berkata: Saya bertolak dari Mekah bersama Umar sehingga kami sampai di al-Baida' dan di sana terdapat sekumpulan penunggang di bawah naungan pokok. Dia berkata (kepada saya): Pergi dan cari tahu siapa kumpulan ini. Saya melihat dan di sana ada Suhaib (dalam kumpulan itu). Jadi saya memaklumkan kepadanya ('Umar) tentangnya. Dia berkata: Panggil dia kepada saya. Jadi saya kembali kepada Suhaib dan berkata: Pergi dan temui Amirul Mukminin. Ketika Umar cedera, Suhaib datang meratap: Aduhai, saudara! Aduhai sahabat! Umar berkata: Wahai Suhaib, adakah kamu meratap untukku, sedangkan Rasulullah (ﷺ) bersabda: \"Sesungguhnya mayat akan diazab kerana ratapan (ahli keluarganya)\"? Ibn Abbas berkata: Ketika Umar meninggal dunia, saya menyebutkan hal itu kepada Aisyah. Dia berkata: Semoga Allah merahmati Umar! Demi Allah, Rasulullah (ﷺ) tidak pernah bersabda bahawa Allah akan menghukum orang mukmin kerana tangisan (mana-mana ahli keluarganya), tetapi baginda bersabda bahawa Allah akan menambah azab orang kafir kerana tangisan keluarganya ke atasnya. Aisyah berkata: Al-Quran sudah cukup untuk kamu (ketika dinyatakan): \"Seseorang yang memikul dosa tidak akan memikul dosa orang lain\" (vi. 164). Kemudian Ibn Abbas berkata: Allah adalah Dia yang menyebabkan ketawa dan menangis. Ibn Abu Mulaika berkata: Demi Allah, Ibn Umar tidak berkata apa-apa."
  },
  {
    "id": 9315,
    "hadith_number": 2038,
    "tajuk_hadith": "Mengenai Jenazah Umm Aban dan Perbandingan Riwayat Hadis",
    "perawi_melayu": "Diriwayatkan oleh 'Amr daripada Ibn Abu Mulaika:",
    "english_text": "We were with the bier of Umm Aban, daughter of 'Uthman, and the rest of the hadith is the same, but he did not narrate it as a marfu' hadith on the authority of 'Umar from the Messenger of Allah (ﷺ) as it was narrated by Ayyub and Ibn Juraij, and the hadith narrated by them (Ayyub and Ibn Juraij) is more complete than that of 'Amr.",
    "arabic_text": "وَحَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ، حَدَّثَنَا سُفْيَانُ، قَالَ عَمْرٌو عَنِ ابْنِ أَبِي مُلَيْكَةَ، كُنَّا فِي جَنَازَةِ أُمِّ أَبَانٍ بِنْتِ عُثْمَانَ وَسَاقَ الْحَدِيثَ وَلَمْ يَنُصَّ رَفْعَ الْحَدِيثِ عَنْ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم كَمَا نَصَّهُ أَيُّوبُ وَابْنُ جُرَيْجٍ وَحَدِيثُهُمَا أَتَمُّ مِنْ حَدِيثِ عَمْرٍو ‏.‏",
    "malay_translation": "Kami bersama jenazah Umm Aban, puteri Uthman, dan hadis selebihnya adalah sama, tetapi beliau tidak meriwayatkannya sebagai hadis marfu' daripada Umar daripada Rasulullah (ﷺ) seperti yang diriwayatkan oleh Ayyub dan Ibn Juraij, dan hadis yang diriwayatkan oleh mereka (Ayyub dan Ibn Juraij) adalah lebih lengkap daripada hadis 'Amr."
  },
  {
    "id": 9316,
    "hadith_number": 2039,
    "tajuk_hadith": "Azab untuk Si Mati Disebabkan Ratapan Orang Hidup",
    "perawi_melayu": "'Abdullah bin 'Umar meriwayatkan bahawa Rasulullah ﷺ bersabda:",
    "english_text": "The dead is punished because of the lamentation of the living.",
    "arabic_text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، حَدَّثَنِي عُمَرُ بْنُ مُحَمَّدٍ، أَنَّحَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الْمَيِّتَ يُعَذَّبُ بِبُكَاءِ الْحَىِّ ‏\"‏ ‏.‏",
    "malay_translation": "Si mati diazab disebabkan ratapan orang yang hidup."
  },
  {
    "id": 9317,
    "hadith_number": 2040,
    "tajuk_hadith": "Penjelasan tentang Azab Kubur dan Ratapan Keluarga",
    "perawi_melayu": "Hisham b. 'Urwa meriwayatkan daripada ayahnya bahawa perkataan Ibn 'Umar, iaitu \"Si mati akan diazab disebabkan ratapan keluarganya ke atasnya\" telah disebutkan kepada 'A'isha. Atas hal ini beliau berkata:",
    "english_text": "May Allah have mercy upon Abu 'Abd al-Rahman (the kunya of Ibn 'Umar) that he heard something but could not retain it (well). (The fact is) that the bier of a Jew passed before the Messenger of Allah (ﷺ) and (the members of his family) were waiting over him. Upon this he said: You are wailing and he is being punished.",
    "arabic_text": "وَحَدَّثَنَا خَلَفُ بْنُ هِشَامٍ، وَأَبُو الرَّبِيعِ الزَّهْرَانِيُّ، جَمِيعًا عَنْ حَمَّادٍ، - قَالَ خَلَفٌ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، - عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، قَالَ ذُكِرَ عِنْدَ عَائِشَةَ قَوْلُ ابْنِ عُمَرَ الْمَيِّتُ يُعَذَّبُ بِبُكَاءِ أَهْلِهِ عَلَيْهِ ‏.‏ فَقَالَتْ رَحِمَ اللَّهُ أَبَا عَبْدِ الرَّحْمَنِ سَمِعَ شَيْئًا فَلَمْ يَحْفَظْهُ إِنَّمَا مَرَّتْ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم جَنَازَةُ يَهُودِيٍّ وَهُمْ يَبْكُونَ عَلَيْهِ فَقَالَ ‏\n\"‏ أَنْتُمْ تَبْكُونَ وَإِنَّهُ لَيُعَذَّبُ ‏\"‏ ‏.‏",
    "malay_translation": "Semoga Allah merahmati Abu 'Abd al-Rahman (kunyah Ibn 'Umar) yang mendengar sesuatu tetapi tidak dapat mengingatinya (dengan baik). (Faktanya adalah) bahawa keranda seorang Yahudi lalu di hadapan Rasulullah (ﷺ) dan (anggota keluarganya) sedang menunggu di atasnya. Atas hal ini baginda bersabda: Kamu meratap dan dia sedang diazab."
  },
  {
    "id": 9318,
    "hadith_number": 2041,
    "tajuk_hadith": "Penjelasan Aisyah tentang Kesalahfahaman Ibn Umar Mengenai Azab Kubur dan Tangisan Keluarga",
    "perawi_melayu": "Hisham meriwayatkan daripada ayahnya bahawa telah disebutkan kepada Aisyah bahawa Ibn 'Umar telah meriwayatkan sebagai hadis marfu' daripada Rasulullah ﷺ bahawa orang mati akan diazab di dalam kubur kerana ratapan keluarganya untuknya. Maka Aisyah berkata:",
    "english_text": "He (Ibn 'Umar) missed (the point). The Messenger of Allah (ﷺ) had (in fact) said: He (the dead) is punished for his faults or for his sins, and the members of his family are wailing for him now. (This misunderstanding of Ibn 'Umar is similar to his saying: ) The Messenger of Allah (ﷺ) stood by the well in which were lying the dead bodies of those polytheists who had been killed on the Day of Badr, and he said to them what he had to say, i. e.: They hear what I say. But he (Ibn 'Umar) misunderstood. The Prophet (ﷺ) had only said: They (the dead) understand that what I used to say to them was truth. She then recited:\" Certainly, thou canst not make the dead hear the call\" (xxvii. 80), nor can you make those hear who are in the graves, nor can you inform them when they have taken their seats in Hell.",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، قَالَ ذُكِرَ عِنْدَ عَائِشَةَ أَنَّ ابْنَ عُمَرَ، يَرْفَعُ إِلَى النَّبِيِّ صلى الله عليه وسلم ‏\"‏ إِنَّ الْمَيِّتَ يُعَذَّبُ فِي قَبْرِهِ بِبُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏ ‏.‏ فَقَالَتْ وَهَلَ إِنَّمَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّهُ لَيُعَذَّبُ بِخَطِيئَتِهِ أَوْ بِذَنْبِهِ وَإِنَّ أَهْلَهُ لَيَبْكُونَ عَلَيْهِ الآنَ ‏\"‏ ‏.‏ وَذَاكَ مِثْلُ قَوْلِهِ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ عَلَى الْقَلِيبِ يَوْمَ بَدْرٍ وَفِيهِ قَتْلَى بَدْرٍ مِنَ الْمُشْرِكِينَ فَقَالَ لَهُمْ مَا قَالَ ‏\"‏ إِنَّهُمْ لَيَسْمَعُونَ مَا أَقُولُ ‏\"‏ ‏.‏ وَقَدْ وَهَلَ إِنَّمَا قَالَ ‏\"‏ إِنَّهُمْ لَيَعْلَمُونَ أَنَّ مَا كُنْتُ أَقُولُ لَهُمْ حَقٌّ ‏\"‏ ‏.‏ ثُمَّ قَرَأَتْ ‏{‏ إِنَّكَ لاَ تُسْمِعُ الْمَوْتَى‏}‏ ‏{‏ وَمَا أَنْتَ بِمُسْمِعٍ مَنْ فِي الْقُبُورِ‏}‏ يَقُولُ حِينَ تَبَوَّءُوا مَقَاعِدَهُمْ مِنَ النَّارِ ‏.‏",
    "malay_translation": "Beliau (Ibn 'Umar) telah terlepas (maksudnya). Rasulullah ﷺ sebenarnya telah bersabda: Dia (orang mati) diazab kerana kesalahannya atau kerana dosanya, dan ahli keluarganya sedang meratapinya sekarang. (Kesalahfahaman Ibn 'Umar ini serupa dengan perkataannya:) Rasulullah ﷺ berdiri di tepi telaga di mana terbaring mayat-mayat kaum musyrikin yang telah terbunuh pada Hari Badr, dan baginda bersabda kepada mereka apa yang perlu baginda sabdakan, iaitu: Mereka mendengar apa yang saya katakan. Tetapi beliau (Ibn 'Umar) salah faham. Nabi ﷺ hanya bersabda: Mereka (orang mati) memahami bahawa apa yang pernah saya katakan kepada mereka adalah benar. Kemudian beliau membaca: \"Sesungguhnya, kamu tidak dapat membuat orang-orang mati mendengar panggilan\" (xxvii. 80), dan kamu tidak dapat membuat mereka yang berada di dalam kubur mendengar, dan kamu tidak dapat memberitahu mereka apabila mereka telah mengambil tempat duduk mereka di Neraka."
  },
  {
    "id": 9319,
    "hadith_number": 2042,
    "tajuk_hadith": "Hadis daripada Ibn 'Urwa dengan Sanad yang Sama, Hadis Abu Usama Lebih Lengkap",
    "perawi_melayu": "",
    "english_text": "This hadith has been narrated by Ibn 'Urwa with the same chain of transmitters. The hadith narrated by Abu Usama is more complete.",
    "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، بِهَذَا الإِسْنَادِ بِمَعْنَى حَدِيثِ أَبِي أُسَامَةَ وَحَدِيثُ أَبِي أُسَامَةَ أَتَمُّ ‏.‏",
    "malay_translation": "Hadis ini telah diriwayatkan oleh Ibn 'Urwa dengan sanad yang sama. Hadis yang diriwayatkan oleh Abu Usama adalah lebih lengkap."
  },
  {
    "id": 9320,
    "hadith_number": 2043,
    "tajuk_hadith": "Azab Si Mati Bukan Disebabkan Ratapan Keluarga, Tetapi Azab Kubur Tetap Berlaku",
    "perawi_melayu": "'Amra binti 'Abd al Rahman meriwayatkan bahawa dia mendengar (daripada) 'Aisyah dan menyebut kepadanya tentang 'Abdullah bin 'Umar yang berkata:",
    "english_text": "The dead is punished because of the lamentation of the living. Upon this 'A'isha said: May Allah have mercy upon the father of 'Abd al-Rahman (Ibn 'Umar). He did not tell a lie, but he forgot or made a mistake. The Messenger of Allah (ﷺ) happened to pass by a (dead) Jewess who was being lamented. Upon this he said: They weep over her and she is being punished in the grave.",
    "arabic_text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، فِيمَا قُرِئَ عَلَيْهِ عَنْ عَبْدِ اللَّهِ بْنِ، أَبِي بَكْرٍ عَنْ أَبِيهِ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّهَا أَخْبَرَتْهُ أَنَّهَا، سَمِعَتْ عَائِشَةَ، وَذُكِرَ، لَهَا أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، يَقُولُ إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبُكَاءِ الْحَىِّ ‏.‏ فَقَالَتْ عَائِشَةُ يَغْفِرُ اللَّهُ لأَبِي عَبْدِ الرَّحْمَنِ أَمَا إِنَّهُ لَمْ يَكْذِبْ وَلَكِنَّهُ نَسِيَ أَوْ أَخْطَأَ إِنَّمَا مَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى يَهُودِيَّةٍ يُبْكَى عَلَيْهَا فَقَالَ ‏\n\"‏ إِنَّهُمْ لَيَبْكُونَ عَلَيْهَا وَإِنَّهَا لَتُعَذَّبُ فِي قَبْرِهَا ‏\"‏ ‏.‏",
    "malay_translation": "Si mati diazab disebabkan ratapan orang yang hidup. Atas hal ini, 'A'isha berkata: \"Semoga Allah merahmati ayah 'Abd al-Rahman (Ibn 'Umar). Dia tidak berdusta, tetapi dia lupa atau tersilap. Rasulullah (ﷺ) kebetulan lalu di sisi seorang wanita Yahudi (yang telah mati) yang sedang diratapi. Atas hal ini baginda bersabda: \"Mereka menangisinya dan dia sedang diazab di dalam kuburnya.\""
  },
  {
    "id": 9321,
    "hadith_number": 2044,
    "tajuk_hadith": "Azab bagi Orang yang Diratapi",
    "perawi_melayu": "'Ali b. Rabi'a melaporkan bahawa orang pertama yang diratapi di Kufah adalah Qaraza b. Ka'b. Mughira b. Shu'ba berkata:",
    "english_text": "I heard the Messenger of Allah (ﷺ) saying: He who is lamented upon would be punished because of the lamentation for him on the Day of judgment.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ سَعِيدِ بْنِ عُبَيْدٍ الطَّائِيِّ، وَمُحَمَّدِ، بْنِ قَيْسٍ عَنْ عَلِيِّ بْنِ رَبِيعَةَ، قَالَ أَوَّلُ مَنْ نِيحَ عَلَيْهِ بِالْكُوفَةِ قَرَظَةُ بْنُ كَعْبٍ فَقَالَ الْمُغِيرَةُ بْنُ شُعْبَةَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ نِيحَ عَلَيْهِ فَإِنَّهُ يُعَذَّبُ بِمَا نِيحَ عَلَيْهِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Saya mendengar Rasulullah (ﷺ) bersabda: Sesiapa yang diratapi akan diazab disebabkan ratapan untuknya pada Hari Kiamat."
  },
  {
    "id": 9322,
    "hadith_number": 2045,
    "tajuk_hadith": "Hadis Riwayat Mughira bin Shu'ba daripada Rasulullah (ﷺ)",
    "perawi_melayu": "Ali bin Hujr al-Sa'di, Ali bin Mushir, Muhammad bin Qais al-Asadi, Ali bin Rabi'ah al-Asadi, Mughira bin Shu'ba",
    "english_text": "A hadith like this has been narrated by Mughira b. Shu'ba from the Messenger of Allah (ﷺ).",
    "arabic_text": "وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ قَيْسٍ، الأَسْدِيُّ عَنْ عَلِيِّ بْنِ رَبِيعَةَ الأَسْدِيِّ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ ‏.‏",
    "malay_translation": "Hadis seperti ini telah diriwayatkan oleh Mughira bin Shu'ba daripada Rasulullah (ﷺ)."
  },
  {
    "id": 9323,
    "hadith_number": 2046,
    "tajuk_hadith": "Hadis Diriwayatkan Melalui Sanad Lain",
    "perawi_melayu": "",
    "english_text": "This hadith has been narrated from the Messenger of Allah (ﷺ) through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَاهُ ابْنُ أَبِي عُمَرَ، حَدَّثَنَا مَرْوَانُ، - يَعْنِي الْفَزَارِيَّ - حَدَّثَنَا سَعِيدُ بْنُ عُبَيْدٍ، الطَّائِيُّ عَنْ عَلِيِّ بْنِ رَبِيعَةَ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ ‏.‏",
    "malay_translation": "Hadis ini telah diriwayatkan daripada Rasulullah (ﷺ) melalui sanad periwayatan yang lain."
  },
  {
    "id": 9324,
    "hadith_number": 2047,
    "tajuk_hadith": "Empat Ciri Jahiliyah yang Tidak Ditinggalkan dan Azab bagi Wanita Meratap yang Tidak Bertaubat",
    "perawi_melayu": "Abu Malik al-Ash'ari meriwayatkan bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "Among my people there are four characteristics belonging to pre-Islamic period which they do not abandon: boasting of high rank, reviling other peoples' genealogies, seeking rain by stars, and wailing. And he (further) said: If the wailing woman does not repent before she dies, she will be made to stand on the Day of Resurrection wearing a garment of pitch and a chemise of mange.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ، ح وَحَدَّثَنِي إِسْحَاقُ، بْنُ مَنْصُورٍ - وَاللَّفْظُ لَهُ - أَخْبَرَنَا حَبَّانُ بْنُ هِلاَلٍ، حَدَّثَنَا أَبَانٌ، حَدَّثَنَا يَحْيَى، أَنَّ زَيْدًا، حَدَّثَهُ أَنَّ أَبَا سَلاَّمٍ حَدَّثَهُ أَنَّ أَبَا مَالِكٍ الأَشْعَرِيَّ حَدَّثَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ أَرْبَعٌ فِي أُمَّتِي مِنْ أَمْرِ الْجَاهِلِيَّةِ لاَ يَتْرُكُونَهُنَّ الْفَخْرُ فِي الأَحْسَابِ وَالطَّعْنُ فِي الأَنْسَابِ وَالاِسْتِسْقَاءُ بِالنُّجُومِ وَالنِّيَاحَةُ ‏\"‏ ‏.‏ وَقَالَ ‏\"‏ النَّائِحَةُ إِذَا لَمْ تَتُبْ قَبْلَ مَوْتِهَا تُقَامُ يَوْمَ الْقِيَامَةِ وَعَلَيْهَا سِرْبَالٌ مِنْ قَطِرَانٍ وَدِرْعٌ مِنْ جَرَبٍ ‏\"‏ ‏.‏",
    "malay_translation": "Dalam kalangan umatku terdapat empat ciri-ciri zaman jahiliyah yang tidak mereka tinggalkan: membanggakan kedudukan tinggi, mencela keturunan orang lain, mencari hujan melalui bintang, dan meratap. Dan baginda (selanjutnya) bersabda: Jika wanita yang meratap tidak bertaubat sebelum kematiannya, dia akan didirikan pada Hari Kiamat dengan memakai pakaian dari minyak tar dan baju kurung yang penuh dengan kudis."
  },
  {
    "id": 9325,
    "hadith_number": 2048,
    "tajuk_hadith": "Larangan Meratap bagi Wanita",
    "perawi_melayu": "Aisyah meriwayatkan bahawa ketika Rasulullah ﷺ diberitahu tentang kematian Ibn Haritha, Ja'far b. Abu Talib dan Abdullah b. Rawaha, baginda duduk, menunjukkan tanda-tanda kesedihan. Beliau (Aisyah) selanjutnya berkata:",
    "english_text": "I was looking (at him) through the crevice of the door. A man came to him and mentioned that Ja'far's women were lamenting. He (the Holy Prophet) commanded him to go and forbid them (to do so). So he went away but came back and told (him) that they did not obey (him). He commanded him a second time to go and forbid them (to do so). He again went but came back to him and said: I swear by God, Messenger of Allah, that they have overpowered us. She ('A'isha) said that she thought the Messenger of Allah (ﷺ) had told (her) to throw dust in their mouths. Thereupon 'A'isha said: May Allah humble you! You did not do what Allah's Messenger (ﷺ) ordered you, nor did you stop annoying Allah's Messenger (ﷺ).",
    "arabic_text": "وَحَدَّثَنَا ابْنُ الْمُثَنَّى، وَابْنُ أَبِي عُمَرَ، قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، يَقُولُ أَخْبَرَتْنِي عَمْرَةُ، أَنَّهَا سَمِعَتْ عَائِشَةَ، تَقُولُ لَمَّا جَاءَ رَسُولَ اللَّهِ صلى الله عليه وسلم قَتْلُ ابْنِ حَارِثَةَ وَجَعْفَرِ بْنِ أَبِي طَالِبٍ وَعَبْدِ اللَّهِ بْنِ رَوَاحَةَ جَلَسَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُعْرَفُ فِيهِ الْحُزْنُ قَالَتْ وَأَنَا أَنْظُرُ مِنْ صَائِرِ الْبَابِ - شَقِّ الْبَابِ - فَأَتَاهُ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ نِسَاءَ جَعْفَرٍ وَذَكَرَ بُكَاءَهُنَّ فَأَمَرَهُ أَنْ يَذْهَبَ فَيَنْهَاهُنَّ فَذَهَبَ فَأَتَاهُ فَذَكَرَ أَنَّهُنَّ لَمْ يُطِعْنَهُ فَأَمَرَهُ الثَّانِيَةَ أَنْ يَذْهَبَ فَيَنْهَاهُنَّ فَذَهَبَ ثُمَّ أَتَاهُ فَقَالَ وَاللَّهِ لَقَدْ غَلَبْنَنَا يَا رَسُولَ اللَّهِ ‏.‏ قَالَتْ فَزَعَمَتْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ اذْهَبْ فَاحْثُ فِي أَفْوَاهِهِنَّ مِنَ التُّرَابِ ‏\"‏ ‏.‏ قَالَتْ عَائِشَةُ فَقُلْتُ أَرْغَمَ اللَّهُ أَنْفَكَ وَاللَّهِ مَا تَفْعَلُ مَا أَمَرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَمَا تَرَكْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم مِنَ الْعَنَاءِ ‏.‏",
    "malay_translation": "Saya sedang melihat (baginda) melalui celah pintu. Seorang lelaki datang kepada baginda dan menyebut bahawa wanita-wanita Ja'far sedang meratap. Baginda (Nabi Suci) memerintahkannya untuk pergi dan melarang mereka (daripada berbuat demikian). Maka dia pergi tetapi kembali dan memberitahu (baginda) bahawa mereka tidak mematuhinya. Baginda memerintahkannya kali kedua untuk pergi dan melarang mereka (daripada berbuat demikian). Dia pergi lagi tetapi kembali kepada baginda dan berkata: Demi Allah, Wahai Rasulullah, sesungguhnya mereka telah mengalahkan kami. Aisyah berkata bahawa dia menyangka Rasulullah ﷺ telah memberitahu (lelaki itu) untuk melemparkan debu ke dalam mulut mereka. Kemudian Aisyah berkata: Semoga Allah menghinakan kamu! Kamu tidak melakukan apa yang diperintahkan oleh Rasulullah ﷺ, dan kamu juga tidak berhenti mengganggu Rasulullah ﷺ."
  },
  {
    "id": 9326,
    "hadith_number": 2049,
    "tajuk_hadith": "Tidak Membebankan Rasulullah SAW",
    "perawi_melayu": "Hadis ini diriwayatkan oleh Yahya bin Sa'id dengan sanad yang sama seperti yang diriwayatkan oleh 'Abd al-'Aziz (dengan perubahan kata-kata ini):",
    "english_text": "\" You did not spare the Messenger of Allah (ﷺ) the botheration.\"",
    "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، ح وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، ح وَحَدَّثَنِي أَحْمَدُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ مُسْلِمٍ - كُلُّهُمْ عَنْ يَحْيَى بْنِ سَعِيدٍ، بِهَذَا   الإِسْنَادِ ‏.‏ نَحْوَهُ ‏.‏ وَفِي حَدِيثِ عَبْدِ الْعَزِيزِ وَمَا تَرَكْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم   مِنَ الْعِيِّ ‏.‏",
    "malay_translation": "\"Anda tidak membiarkan Rasulullah SAW bersusah payah.\""
  },
  {
    "id": 9327,
    "hadith_number": 2050,
    "tajuk_hadith": "Janji untuk Tidak Meratap dan Wanita yang Menepatinya",
    "perawi_melayu": "Umm 'Atiyya meriwayatkan:",
    "english_text": "The Messenger of Allah (ﷺ) took a promise from us along with the oath of Allegiance that we would not lament. But only five among us fulfilled the promise (and they are) Umm Sulaim, and Umm al-'Ala', and the daughter of Abu Sabra the wife of Mu'adh, or daughter of Abu Sabra and wife of Mu'adh.",
    "arabic_text": "حَدَّثَنِي أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ أَخَذَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم مَعَ الْبَيْعَةِ أَلاَّ نَنُوحَ فَمَا وَفَتْ مِنَّا امْرَأَةٌ إِلاَّ خَمْسٌ أُمُّ سُلَيْمٍ وَأُمُّ الْعَلاَءِ وَابْنَةُ أَبِي سَبْرَةَ امْرَأَةُ مُعَاذٍ أَوِ ابْنَةُ أَبِي سَبْرَةَ وَامْرَأَةُ مُعَاذٍ .‏",
    "malay_translation": "Rasulullah (ﷺ) mengambil janji daripada kami bersama bai'ah (sumpah setia) bahawa kami tidak akan meratap.  Namun, hanya lima orang wanita sahaja dalam kalangan kami yang menunaikan janji ini, iaitu Umm Sulaim, Umm al-'Ala', dan anak perempuan Abu Sabra, isteri kepada Mu'adh, atau anak perempuan Abu Sabra dan isteri kepada Mu'adh."
  },
  {
    "id": 9328,
    "hadith_number": 2051,
    "tajuk_hadith": "Larangan Meratap dan Kepatuhan Ummu Sulaim",
    "perawi_melayu": "",
    "english_text": "Umm 'Atiyya reported that the Messenger of Allah (ﷺ) took pledge from us (including this promise) that we would not lament. Only five amongst us fulfilled the promise, and one of them (who fulfilled the promise) was Umm Sulaim.",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا أَسْبَاطٌ، حَدَّثَنَا هِشَامٌ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ أَخَذَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْبَيْعَةِ أَلاَّ تَنُحْنَ فَمَا وَفَتْ مِنَّا غَيْرُ خَمْسٍ مِنْهُنَّ أُمُّ سُلَيْمٍ ‏.‏",
    "malay_translation": "Ummu 'Atiyyah meriwayatkan bahawa Rasulullah (ﷺ) mengambil janji daripada kami (termasuk janji ini) bahawa kami tidak akan meratap. Hanya lima orang di antara kami yang menunaikan janji tersebut, dan salah seorang daripada mereka (yang menunaikan janji tersebut) adalah Ummu Sulaim."
  },
  {
    "id": 9329,
    "hadith_number": 2052,
    "tajuk_hadith": "Janji Setia Wanita Beriman dan Pengecualian Meratap bagi Suku Tertentu",
    "perawi_melayu": "Hafsa meriwayatkan daripada Umm 'Atiyya, beliau berkata:",
    "english_text": "When this verse was revealed:\" When believing women came to thee giving thee a pledge that they will not associate aught with Allah, and will not disobey thee in good\" (lx. 12), she (Umm Atiyya) said: In (this pledge) was also included wailing. I said: Messenger of Allah, except members of such a tribe who helped me (in lamentation) during pre-Islamic days, there is left no alternative for me, but that I should also help them. Upon this the Messenger of Allah (ﷺ) said: (Yes) but only in case of the members of such a tribe.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ، - قَالَ زُهَيْرٌ حَدَّثَنَا مُحَمَّدُ بْنُ خَازِمٍ، - حَدَّثَنَا عَاصِمٌ، عَنْ حَفْصَةَ، عَنْ أُمِّ، عَطِيَّةَ قَالَتْ لَمَّا نَزَلَتْ هَذِهِ الآيَةُ ‏{‏ يُبَايِعْنَكَ عَلَى أَنْ لاَ يُشْرِكْنَ بِاللَّهِ شَيْئًا‏}‏ ‏{‏ وَلاَ يَعْصِينَكَ فِي مَعْرُوفٍ‏}‏ قَالَتْ كَانَ مِنْهُ النِّيَاحَةُ ‏.‏ قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ إِلاَّ آلَ فُلاَنٍ فَإِنَّهُمْ كَانُوا أَسْعَدُونِي فِي الْجَاهِلِيَّةِ فَلاَ بُدَّ لِي مِنْ أَنْ أُسْعِدَهُمْ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِلاَّ آلَ فُلاَنٍ ‏\"‏ ‏.‏",
    "malay_translation": "Ketika ayat ini diturunkan: \"Apabila wanita-wanita beriman datang kepadamu untuk memberikan janji setia bahawa mereka tidak akan menyekutukan Allah dengan sesuatu pun, dan tidak akan mengingkarimu dalam perkara yang baik\" (Surah al-Mumtahanah 60:12), beliau (Umm Atiyya) berkata: Dalam (janji setia) ini juga termasuk meratap. Saya berkata: Wahai Rasulullah SAW, kecuali anggota suku tertentu yang telah membantu saya (dalam ratapan) pada zaman Jahiliyyah, tiada pilihan lain bagi saya, kecuali saya juga harus membantu mereka. Maka Rasulullah SAW bersabda: (Ya) tetapi hanya dalam hal anggota suku tersebut sahaja."
  },
  {
    "id": 9330,
    "hadith_number": 2053,
    "tajuk_hadith": "Larangan Mengiringi Jenazah Tetapi Tidak Diwajibkan",
    "perawi_melayu": "Umm 'Atiyya meriwayatkan:",
    "english_text": "We were forbidden to follow the bier, but it was not made absolute on us.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، حَدَّثَنَا ابْنُ عُلَيَّةَ، أَخْبَرَنَا أَيُّوبُ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، قَالَ قَالَتْ أُمُّ عَطِيَّةَ كُنَّا نُنْهَى عَنِ اتِّبَاعِ الْجَنَائِزِ وَلَمْ يُعْزَمْ عَلَيْنَا ‏.‏",
    "malay_translation": "Kami dilarang daripada mengiringi jenazah, tetapi ia tidak diwajibkan ke atas kami."
  },
  {
    "id": 9331,
    "hadith_number": 2054,
    "tajuk_hadith": "Larangan Mengiringi Jenazah Tetapi Tidak Diwajibkan",
    "perawi_melayu": "Umm 'Atiyya meriwayatkan:",
    "english_text": "We were refrained from following the bier, but it was not made absolute on us.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، كِلاَهُمَا عَنْ هِشَامٍ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ نُهِينَا عَنِ اتِّبَاعِ الْجَنَائِزِ، وَلَمْ يُعْزَمْ عَلَيْنَا ‏.‏",
    "malay_translation": "Kami dilarang daripada mengiringi jenazah, tetapi ia tidak diwajibkan ke atas kami."
  },
  {
    "id": 9332,
    "hadith_number": 2055,
    "tajuk_hadith": "Cara Memandikan Jenazah Anak Perempuan Rasulullah ﷺ",
    "perawi_melayu": "Umm 'Atiyya meriwayatkan:",
    "english_text": "The Apostle of Allah (ﷺ) came to us when we were bathing his daughter, and he told us: Wash her with water and (with the leaves of) the lote tree, three or five times, or more than that if you think fit, and put camphor or something like camphor in the last washing; then inform me when you have finished. So when we had finished, we informed him, and he gave to us his (own) under-garment saying:\" Put it next her body.\"",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ دَخَلَ عَلَيْنَا النَّبِيُّ صلى الله عليه وسلم وَنَحْنُ نَغْسِلُ ابْنَتَهُ فَقَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكَ إِنْ رَأَيْتُنَّ ذَلِكَ بِمَاءٍ وَسِدْرٍ وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏ ‏.‏ فَلَمَّا فَرَغْنَا آذَنَّاهُ فَأَلْقَى إِلَيْنَا حِقْوَهُ فَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ datang kepada kami ketika kami sedang memandikan puteri baginda. Baginda bersabda: \"Mandikanlah dia dengan air dan (daun) bidara, tiga atau lima kali, atau lebih daripada itu jika kamu rasa perlu, dan letakkanlah kapur barus atau sesuatu seperti kapur barus pada cucian terakhir; kemudian beritahu aku apabila kamu telah selesai.\" Apabila kami telah selesai, kami memberitahu baginda, dan baginda memberikan kepada kami kain bawahnya sambil bersabda: \"Letakkanlah ia di sisi badannya.\""
  },
  {
    "id": 9333,
    "hadith_number": 2056,
    "tajuk_hadith": "Mengepang Rambut Menjadi Tiga Jalinan",
    "perawi_melayu": "Umm 'Atiyya meriwayatkan:",
    "english_text": "We braided her hair in three plaits.",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ مَشَطْنَاهَا ثَلاَثَةَ قُرُونٍ ‏.‏",
    "malay_translation": "Kami mengepang rambutnya menjadi tiga jalinan."
  },
  {
    "id": 9334,
    "hadith_number": 2057,
    "tajuk_hadith": "Kewafatan Salah Seorang Puteri Rasulullah ﷺ",
    "perawi_melayu": "Umm 'Atiyya meriwayatkan:",
    "english_text": "One of the daughters of the Messenger of Allah (ﷺ) died. And in the hadith transmitted by Ibn 'Ulayya (the words are): The Messenger of Allah (ﷺ) came to us and we were washing his daughter. And in the hadith transmitted by Malik (the words are): There came in (our apartment) the Messenger of Allah (way peace be upon him) when his daughter died. The rest of the hadith is the same as narrated by Yazid b. Zurai' from Ayyub from Muhammad from Umm 'Atiyya.",
    "arabic_text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، ح وَحَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، وَقُتَيْبَةُ، بْنُ سَعِيدٍ قَالاَ حَدَّثَنَا حَمَّادٌ، ح وَحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، حَدَّثَنَا ابْنُ عُلَيَّةَ، كُلُّهُمْ عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ تُوُفِّيَتْ إِحْدَى بَنَاتِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَفِي حَدِيثِ ابْنِ عُلَيَّةَ قَالَتْ أَتَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَنَحْنُ نَغْسِلُ ابْنَتَهُ ‏.‏ وَفِي حَدِيثِ مَالِكٍ قَالَتْ دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ تُوُفِّيَتِ ابْنَتُهُ ‏.‏ بِمِثْلِ حَدِيثِ يَزِيدَ بْنِ زُرَيْعٍ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ عَنْ أُمِّ عَطِيَّةَ ‏.‏",
    "malay_translation": "Salah seorang puteri Rasulullah ﷺ wafat. Dan dalam hadis yang diriwayatkan oleh Ibn 'Ulayya (lafaznya): Rasulullah ﷺ datang kepada kami dan kami sedang memandikan puterinya. Dan dalam hadis yang diriwayatkan oleh Malik (lafaznya): Rasulullah ﷺ datang (ke rumah kami) ketika puterinya wafat. Selebihnya hadis ini sama seperti yang diriwayatkan oleh Yazid bin Zurai' dari Ayyub dari Muhammad dari Umm 'Atiyya."
  },
  {
    "id": 9335,
    "hadith_number": 2058,
    "tajuk_hadith": "Mandi Jenazah: Bilangan Ganjil dan Kepang Rambut",
    "perawi_melayu": "Hadis seperti ini telah diriwayatkan oleh Hafsa daripada Umm 'Atiyya dengan pengecualian (kata-kata ini bahawa Nabi meminta mereka untuk memandikan jenazahnya):",
    "english_text": "\" three times, five times, seven times, or more than that, if you deem fit:\" Hafsa (further) said on the authority of Umm 'Atiyya: We braided (the hair) of her head in three plaits.",
    "arabic_text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ، ‏.‏ بِنَحْوِهِ غَيْرَ أَنَّهُ قَالَ ‏\n\"‏ ثَلاَثًا أَوْ خَمْسًا أَوْ سَبْعًا أَوْ أَكْثَرَ مِنْ ذَلِكِ إِنْ رَأَيْتُنَّ ذَلِكِ ‏\"‏ ‏.‏ فَقَالَتْ حَفْصَةُ عَنْ أُمِّ عَطِيَّةَ وَجَعَلْنَا رَأْسَهَا ثَلاَثَةَ قُرُونٍ ‏.‏",
    "malay_translation": "\"tiga kali, lima kali, tujuh kali, atau lebih daripada itu, jika kamu rasa sesuai:\" Hafsa (selanjutnya) berkata berdasarkan autoriti Umm 'Atiyya: Kami mengepang (rambut) kepalanya menjadi tiga tocang."
  },
  {
    "id": 9336,
    "hadith_number": 2059,
    "tajuk_hadith": "Memandikan Jenazah dengan Bilangan Ganjil dan Mengepang Rambut Tiga Tocang",
    "perawi_melayu": "Umm 'Atiyya meriwayatkan:",
    "english_text": "We washed her an odd number of times, i. e. three, five or seven times; and Umm 'Atiyya (further) said: We braided her hair in three plaits.",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، حَدَّثَنَا ابْنُ عُلَيَّةَ، وَأَخْبَرَنَا أَيُّوبُ، قَالَ وَقَالَتْ حَفْصَةُ عَنْ أُمِّ عَطِيَّةَ، قَالَتِ اغْسِلْنَهَا وِتْرًا ثَلاَثًا أَوْ خَمْسًا أَوْ سَبْعًا قَالَ وَقَالَتْ أُمُّ عَطِيَّةَ مَشَطْنَاهَا ثَلاَثَةَ قُرُونٍ ‏.‏",
    "malay_translation": "Kami memandikannya dengan bilangan ganjil, iaitu tiga, lima atau tujuh kali; dan Umm 'Atiyya (selanjutnya) berkata: Kami mengikat rambutnya menjadi tiga tocang."
  },
  {
    "id": 9337,
    "hadith_number": 2060,
    "tajuk_hadith": "Arahan Memandikan Jenazah Zainab binti Rasulullah (ﷺ)",
    "perawi_melayu": "Umm 'Atiyya meriwayatkan:",
    "english_text": "When Zainab the daughter of the Messenger of Allah (ﷺ) died, he said to us: Wash her odd number of times, i. e. three or five times, and put camphor or something-like camphor at the fifth time, and after you have washed her inform me. So we informed him and he gave us his under-garment, saying:\" Put it next her body.\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ، - قَالَ عَمْرٌو حَدَّثَنَا مُحَمَّدُ بْنُ خَازِمٍ أَبُو مُعَاوِيَةَ، - حَدَّثَنَا عَاصِمٌ الأَحْوَلُ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ لَمَّا مَاتَتْ زَيْنَبُ بِنْتُ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اغْسِلْنَهَا وِتْرًا ثَلاَثًا أَوْ خَمْسًا وَاجْعَلْنَ فِي الْخَامِسَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ فَإِذَا غَسَلْتُنَّهَا فَأَعْلِمْنَنِي ‏\"‏ ‏.‏ قَالَتْ فَأَعْلَمْنَاهُ ‏.‏ فَأَعْطَانَا حِقْوَهُ وَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏ ‏.‏",
    "malay_translation": "Ketika Zainab binti Rasulullah (ﷺ) meninggal dunia, baginda bersabda kepada kami: Mandikanlah dia dengan bilangan ganjil, iaitu tiga atau lima kali, dan letakkanlah kapur barus atau sesuatu seperti kapur barus pada kali kelima, dan setelah kamu selesai memandikannya, beritahulah aku. Maka kami pun memberitahu baginda, lalu baginda memberikan kain bawahnya dan bersabda: \"Letakkanlah ia di sisi tubuhnya.\""
  },
  {
    "id": 9338,
    "hadith_number": 2061,
    "tajuk_hadith": "Arahan untuk Memandikan Jenazah dengan Bilangan Ganjil",
    "perawi_melayu": "Umm 'Atiyya melaporkan:",
    "english_text": "There came to us the Messenger of Allah (ﷺ) as we were washing one of his daughters. So he said: Wash her (dead body) an odd number of times, five times or more than that, the rest of the hadith is the same. She (further) said: We braided her hair in three plaits: (two) on the sides of her head and one on her forehead.",
    "arabic_text": "وَحَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا هِشَامُ بْنُ حَسَّانَ، عَنْ حَفْصَةَ، بِنْتِ سِيرِينَ عَنْ أُمِّ عَطِيَّةَ، قَالَتْ أَتَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَنَحْنُ نَغْسِلُ إِحْدَى بَنَاتِهِ فَقَالَ ‏\n\"‏ اغْسِلْنَهَا وِتْرًا خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكِ ‏\"‏ ‏.‏ بِنَحْوِ حَدِيثِ أَيُّوبَ وَعَاصِمٍ وَقَالَ فِي الْحَدِيثِ قَالَتْ فَضَفَرْنَا شَعْرَهَا ثَلاَثَةَ أَثْلاَثٍ قَرْنَيْهَا وَنَاصِيَتَهَا ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) datang kepada kami ketika kami sedang memandikan salah seorang puteri baginda. Baginda bersabda: Mandikanlah dia (jenazah) dengan bilangan ganjil, lima kali atau lebih daripada itu, selebihnya hadis adalah sama. Beliau (Umm 'Atiyya) berkata lagi: Kami mengepang rambutnya menjadi tiga kepang: (dua) di sisi kepalanya dan satu di dahinya."
  },
  {
    "id": 9339,
    "hadith_number": 2062,
    "tajuk_hadith": "Memulai dari Sisi Kanan dan Anggota Wuduk Ketika Memandikan Jenazah",
    "perawi_melayu": "",
    "english_text": "Umm 'Atiyya reported that when the Messenger of Allah (ﷺ) asked her to wash his daughter, he told her to start from the right side, and with those parts of the body over which Wudu' is performed.",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ خَالِدٍ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حَيْثُ أَمَرَهَا أَنْ تَغْسِلَ ابْنَتَهُ قَالَ لَهَا ‏\n\"‏ ابْدَأْنَ بِمَيَامِنِهَا وَمَوَاضِعِ الْوُضُوءِ مِنْهَا ‏\"‏ ‏.‏",
    "malay_translation": "Umm 'Atiyya meriwayatkan bahawa ketika Rasulullah (ﷺ) meminta beliau untuk memandikan puteri baginda, baginda memberitahu beliau untuk memulakan dari bahagian kanan, dan dengan bahagian-bahagian badan yang dilakukan wuduk."
  },
  {
    "id": 9340,
    "hadith_number": 2063,
    "tajuk_hadith": "Memulai dari Sebelah Kanan dan Anggota Wuduk Ketika Memandikan Jenazah",
    "perawi_melayu": "",
    "english_text": "Umm 'Atiyya reported that the Messenger of Allah (ﷺ) said to them (the women) in regard to the washing of his daughter to start from the right side and with those parts of the body over which Wudu' is performed.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ كُلُّهُمْ عَنِ ابْنِ عُلَيَّةَ، - قَالَ أَبُو بَكْرٍ حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، - عَنْ خَالِدٍ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لَهُنَّ فِي غَسْلِ ابْنَتِهِ ‏\n\"‏ ابْدَأْنَ بِمَيَامِنِهَا وَمَوَاضِعِ الْوُضُوءِ مِنْهَا ‏\"‏ ‏.‏",
    "malay_translation": "Ummu 'Atiyyah meriwayatkan bahawa Rasulullah ﷺ bersabda kepada mereka (kaum wanita) berkenaan dengan memandikan puteri baginda untuk memulakan dari bahagian kanan dan anggota-anggota badan yang dikenakan Wudu'."
  },
  {
    "id": 9341,
    "hadith_number": 2064,
    "tajuk_hadith": "Pengorbanan dalam Jalan Allah dan Ganjaran yang Dijamin",
    "perawi_melayu": "Khabbab al-Aratt meriwayatkan:",
    "english_text": "We migrated with the Messenger of Allah (ﷺ) in the path of Allah seeking Allah's pleasure alone. Thus our reward was assured with Allah. And amongst us were those who spent life (in such a state of piety and austerity) that nothing consumed their reward. Mus'ab b. 'Umair was one of them. He was killed on the Day of Uhud, and nothing but a woollen cloak was found to shroud him. When we covered his head with it, his feet became uncovered, and when we covered his feet, his head was uncovered. Upon this the Messenger of Allah (ﷺ) said: Place it (this cloak) on the side of his head and cover his feet with grass. And there is one amongst us for whom the fruit is ripened and he enjoys it.",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لِيَحْيَى قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، - عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ خَبَّابِ بْنِ الأَرَتِّ، قَالَ هَاجَرْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي سَبِيلِ اللَّهِ نَبْتَغِي وَجْهَ اللَّهِ فَوَجَبَ أَجْرُنَا عَلَى اللَّهِ فَمِنَّا مَنْ مَضَى لَمْ يَأْكُلْ مِنْ أَجْرِهِ شَيْئًا مِنْهُمْ مُصْعَبُ بْنُ عُمَيْرٍ ‏.‏ قُتِلَ يَوْمَ أُحُدٍ فَلَمْ يُوجَدْ لَهُ شَىْءٌ يُكَفَّنُ فِيهِ إِلاَّ نَمِرَةٌ فَكُنَّا إِذَا وَضَعْنَاهَا عَلَى رَأْسِهِ خَرَجَتْ رِجْلاَهُ وَإِذَا وَضَعْنَاهَا عَلَى رِجْلَيْهِ خَرَجَ رَأْسُهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ ضَعُوهَا مِمَّا يَلِي رَأْسَهُ وَاجْعَلُوا عَلَى رِجْلَيْهِ الإِذْخِرَ ‏\"‏ ‏.‏ وَمِنَّا مَنْ أَيْنَعَتْ لَهُ ثَمَرَتُهُ فَهُوَ يَهْدِبُهَا ‏.‏",
    "malay_translation": "Kami berhijrah bersama Rasulullah (ﷺ) di jalan Allah, mencari keredhaan Allah semata-mata. Maka pahala kami terjamin di sisi Allah. Dan di antara kami ada yang menghabiskan hidup (dalam keadaan soleh dan zuhud) sehingga tidak ada yang mengurangi pahala mereka. Mus'ab bin 'Umair adalah salah seorang daripada mereka. Beliau terbunuh pada Hari Uhud, dan tidak ada apa pun kecuali jubah bulu yang ditemukan untuk mengkafaninya. Ketika kami menutup kepalanya dengan jubah itu, kakinya menjadi terbuka, dan ketika kami menutup kakinya, kepalanya menjadi terbuka. Maka Rasulullah (ﷺ) bersabda: Letakkanlah (jubah ini) di sisi kepalanya dan tutuplah kakinya dengan rumput. Dan ada di antara kami yang buahnya telah masak dan dia menikmatinya."
  },
  {
    "id": 9342,
    "hadith_number": 2065,
    "tajuk_hadith": "Hadis Serupa Diriwayatkan oleh 'Uyaina dari A'mash",
    "perawi_melayu": "",
    "english_text": "A hadith like this has been narrated by 'Uyaina on the authority of A'mash with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، ح وَحَدَّثَنَا مِنْجَابُ بْنُ الْحَارِثِ التَّمِيمِيُّ، أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ ‏.‏ نَحْوَهُ ‏.‏",
    "malay_translation": "Hadis seperti ini telah diriwayatkan oleh 'Uyaina daripada A'mash dengan sanad yang sama."
  },
  {
    "id": 9343,
    "hadith_number": 2066,
    "tajuk_hadith": "Kain Kafan yang Tidak Digunakan untuk Rasulullah SAW Lalu Disumbangkan",
    "perawi_melayu": "'A'isha meriwayatkan bahawa Rasulullah SAW dikafankan dengan tiga helai kain kapas putih dari Yaman yang berasal dari Sahul, yang mana tidak ada baju atau serban bersamanya. Mengenai Hullah pula, terdapat keraguan di kalangan orang ramai mengenainya, bahawa ia dibawa untuk mengkafankan baginda, tetapi ia ditinggalkan, dan baginda dikafankan dengan tiga helai kain kapas putih dari Yaman yang berasal dari Sahul. Kemudian 'Abdullah bin Abu Bakr mengambilnya dan berkata:",
    "english_text": "I would keep it in order to shroud myself in it. He then said: If Allah, the Exalted and Majestic, would have desired it for His Apostle, he would have been shrouded with it. So he sold it and gave its price in charity.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لِيَحْيَى - قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، - عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كُفِّنَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ثَلاَثَةِ أَثْوَابٍ بِيضٍ سَحُولِيَّةٍ مِنْ كُرْسُفٍ لَيْسَ فِيهَا قَمِيصٌ وَلاَ عِمَامَةٌ أَمَّا الْحُلَّةُ فَإِنَّمَا شُبِّهَ عَلَى النَّاسِ فِيهَا أَنَّهَا اشْتُرِيَتْ لَهُ لِيُكَفَّنَ فِيهَا فَتُرِكَتِ الْحُلَّةُ وَكُفِّنَ فِي ثَلاَثَةِ أَثْوَابٍ بِيضٍ سَحُولِيَّةٍ فَأَخَذَهَا عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ فَقَالَ لأَحْبِسَنَّهَا حَتَّى أُكَفِّنَ فِيهَا نَفْسِي ثُمَّ قَالَ لَوْ رَضِيَهَا اللَّهُ عَزَّ وَجَلَّ لِنَبِيِّهِ لَكَفَّنَهُ فِيهَا ‏.‏ فَبَاعَهَا وَتَصَدَّقَ بِثَمَنِهَا ‏.‏",
    "malay_translation": "Saya akan menyimpannya untuk dijadikan kain kafan saya. Kemudian dia berkata: Sekiranya Allah Azza wa Jalla menghendakinya untuk Rasul-Nya, pasti Rasulullah SAW akan dikafankan dengannya. Lalu dia menjual kain itu dan menyedekahkan harganya."
  },
  {
    "id": 9344,
    "hadith_number": 2067,
    "tajuk_hadith": "Sedekah Kain Kafan Kerana Mengikut Sunnah Nabi ﷺ",
    "perawi_melayu": "'A'isha meriwayatkan bahawa Rasulullah ﷺ dibalut dengan kain Yaman yang merupakan milik 'Abdullah bin Abu Bakr; kemudian kain itu dikeluarkan dari baginda, dan baginda dikafankan dengan tiga helai kain kapas putih Yaman dari Sahul yang mana tidak ada baju atau serban di dalamnya. 'Abdullah mengangkat Hullah dan berkata:",
    "english_text": "I would be shrouded in it, but then said: How is it that I should be shrouded in it in which the Messenger of Allah (ﷺ) was not shrouded! So he gave it in charity.",
    "arabic_text": "وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ أُدْرِجَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حُلَّةٍ يَمَنِيَّةٍ كَانَتْ لِعَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ ثُمَّ نُزِعَتْ عَنْهُ وَكُفِّنَ فِي ثَلاَثَةِ أَثْوَابٍ سُحُولٍ يَمَانِيَةٍ لَيْسَ فِيهَا عِمَامَةٌ وَلاَ قَمِيصٌ فَرَفَعَ عَبْدُ اللَّهِ الْحُلَّةَ فَقَالَ أُكَفَّنُ فِيهَا ‏.‏ ثُمَّ قَالَ لَمْ يُكَفَّنْ فِيهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَأُكَفَّنُ فِيهَا ‏.‏ فَتَصَدَّقَ بِهَا ‏.",
    "malay_translation": "Saya ingin dikafankan dengan kain itu, tetapi kemudian berkata: 'Bagaimana mungkin saya dikafankan dengan kain yang mana Rasulullah ﷺ tidak dikafankan dengannya!' Lalu dia menyedekahkannya."
  },
  {
    "id": 9345,
    "hadith_number": 2068,
    "tajuk_hadith": "Perbezaan Riwayat Hadis Hisham",
    "perawi_melayu": "",
    "english_text": "This hadith is narrated on the authority of Hisham with the same chain of transmitters, but in the hadith narrated by him there is no mention of the story of 'Abdullah b. Abu Bakr.",
    "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، وَابْنُ، عُيَيْنَةَ وَابْنُ إِدْرِيسَ وَعَبْدَةُ وَوَكِيعٌ ح وَحَدَّثَنَاهُ يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، كُلُّهُمْ عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ وَلَيْسَ فِي حَدِيثِهِمْ قِصَّةُ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Hisham dengan sanad perawi yang sama, tetapi dalam hadis yang diriwayatkan olehnya tidak ada sebutan tentang kisah Abdullah bin Abu Bakr."
  },
  {
    "id": 9346,
    "hadith_number": 2069,
    "tajuk_hadith": "Bilangan Kain Kafan Rasulullah ﷺ",
    "perawi_melayu": "Abu Salama berkata:",
    "english_text": "I asked 'A'isha with how many garments the Messenger of Allah (ﷺ) was shourded. She said: With three garments of Sahul.",
    "arabic_text": "وَحَدَّثَنِي ابْنُ أَبِي عُمَرَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ يَزِيدَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، أَنَّهُ قَالَ سَأَلْتُ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم فَقُلْتُ لَهَا فِي كَمْ كُفِّنَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَتْ فِي ثَلاَثَةِ أَثْوَابٍ سَحُولِيَّةٍ ‏.‏",
    "malay_translation": "Saya bertanya kepada Aisyah tentang berapa banyak kain kafan yang digunakan untuk Rasulullah ﷺ. Beliau menjawab: Dengan tiga kain dari Sahul."
  },
  {
    "id": 9347,
    "hadith_number": 2070,
    "tajuk_hadith": "Rasulullah SAW Dikafankan dengan Kain Yamani",
    "perawi_melayu": "Diriwayatkan oleh 'A'isha:",
    "english_text": "When the Messenger of Allah (may peace be upom him) died, he was covered with a Yamani wrapper.",
    "arabic_text": "وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَحَسَنٌ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ عَبْدٌ أَخْبَرَنِي وَقَالَ، الآخَرَانِ حَدَّثَنَا يَعْقُوبُ، - وَهُوَ ابْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ - حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ، شِهَابٍ أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ، أَخْبَرَهُ أَنَّ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ قَالَتْ سُجِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ مَاتَ بِثَوْبِ حِبَرَةٍ ‏.‏",
    "malay_translation": "Apabila Rasulullah SAW wafat, baginda ditutup dengan kain Yamani."
  },
  {
    "id": 9348,
    "hadith_number": 2071,
    "tajuk_hadith": "Hadis Diriwayatkan oleh Zuhri dengan Sanad yang Sama",
    "perawi_melayu": "",
    "english_text": "This hadith has been narrated by Zuhri with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالاَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَخْبَرَنَا مَعْمَرٌ، ح وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ سَوَاءً ‏.‏",
    "malay_translation": "Hadis ini telah diriwayatkan oleh Zuhri dengan sanad (rantai periwayat) yang sama."
  },
  {
    "id": 9349,
    "hadith_number": 2072,
    "tajuk_hadith": "Larangan Mengebumikan pada Waktu Malam Kecuali Darurat dan Arahan Memperelok Kafan",
    "perawi_melayu": "Jabir bin 'Abdullah meriwayatkan:",
    "english_text": "Allah's Messenger (ﷺ) one day in the course of his sermon made mention of a person among his Companions who had died and had been wrapped in a shroud not long (enough to cover his whole body) and was buried during the night. The Apostle of Allah (ﷺ) reprimanded (the audience) that a person was buried during the night (in a state that) funeral prayer could not be offered (over him by the Messenger of Allah). (And this is permissible only) when it becomes a dire necessity for a man. The Apostle of Allah (ﷺ) also said: When any one of you shrouds his brother, he should shroud him well.",
    "arabic_text": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، وَحَجَّاجُ بْنُ الشَّاعِرِ، قَالاَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يُحَدِّثُ أَنَّ النَّبِيَّ صلى الله عليه وسلم خَطَبَ يَوْمًا فَذَكَرَ رَجُلاً مِنْ أَصْحَابِهِ قُبِضَ فَكُفِّنَ فِي كَفَنٍ غَيْرِ طَائِلٍ وَقُبِرَ لَيْلاً فَزَجَرَ النَّبِيُّ صلى الله عليه وسلم أَنْ يُقْبَرَ الرَّجُلُ بِاللَّيْلِ حَتَّى يُصَلَّى عَلَيْهِ إِلاَّ أَنْ يُضْطَرَّ إِنْسَانٌ إِلَى ذَلِكَ وَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِذَا كَفَّنَ أَحَدُكُمْ أَخَاهُ فَلْيُحَسِّنْ كَفَنَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) pada suatu hari dalam khutbahnya menyebut tentang seorang lelaki dari kalangan sahabatnya yang telah meninggal dunia dan telah dikafankan dengan kain kafan yang tidak panjang (mencukupi seluruh tubuhnya) dan dikebumikan pada waktu malam. Rasulullah (ﷺ) menegur (para hadirin) bahawa seseorang dikebumikan pada waktu malam (dalam keadaan) solat jenazah tidak dapat dilakukan (ke atasnya oleh Rasulullah). (Dan ini dibenarkan hanya) apabila menjadi keperluan mendesak bagi seseorang. Rasulullah (ﷺ) juga bersabda: Apabila salah seorang daripada kamu mengkafankan saudaranya, maka hendaklah dia mengkafaninya dengan baik."
  },
  {
    "id": 9350,
    "hadith_number": 2073,
    "tajuk_hadith": "Bersegera dalam Urusan Jenazah",
    "perawi_melayu": "Abu Huraira meriwayatkan bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "Make haste at a funeral; if the dead person was good, it is a good state to which you are sending him on; but if he was otherwise it is an evil of which you are ridding yourselves.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، - قَالَ أَبُو بَكْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، - عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَسْرِعُوا بِالْجَنَازَةِ فَإِنْ تَكُ صَالِحَةً فَخَيْرٌ - لَعَلَّهُ قَالَ - تُقَدِّمُونَهَا عَلَيْهِ وَإِنْ تَكُنْ غَيْرَ ذَلِكَ فَشَرٌّ تَضَعُونَهُ عَنْ رِقَابِكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Segerakanlah (urusan) jenazah; jika jenazah itu soleh, maka itu adalah keadaan baik yang kamu hantarkan dia kepadanya; tetapi jika sebaliknya, maka itu adalah keburukan yang kamu singkirkan dari diri kamu."
  },
  {
    "id": 9351,
    "hadith_number": 2074,
    "tajuk_hadith": "Keraguan Perawi Sama Ada Hadis Marfu'",
    "perawi_melayu": "Hadis ini telah diriwayatkan oleh rangkaian perawi lain kecuali dengan variasi (perkataan) ini iaitu dalam hadis yang diriwayatkan oleh Ma'mar (perkataannya adalah):",
    "english_text": "\" I do not know whether the hadith is marfu'.\"",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، جَمِيعًا عَنْ عَبْدِ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، ح وَحَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي حَفْصَةَ، كِلاَهُمَا عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم غَيْرَ أَنَّ فِي حَدِيثِ مَعْمَرٍ قَالَ لاَ أَعْلَمُهُ إِلاَّ رَفَعَ الْحَدِيثَ ‏.‏",
    "malay_translation": "\"Saya tidak tahu sama ada hadis ini marfu' atau tidak.\""
  },
  {
    "id": 9352,
    "hadith_number": 2075,
    "tajuk_hadith": "Bersegera dalam Mengurus Jenazah",
    "perawi_melayu": "Abu Hurairah meriwayatkan Rasulullah SAW bersabda:",
    "english_text": "Hasten at a funeral, for if (the dead person) is good, you would (soon) bring him close to the good. And if it is otherwise, it is an evil of which you are ridding yourselves.",
    "arabic_text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، وَهَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، قَالَ هَارُونُ حَدَّثَنَا وَقَالَ الآخَرَانِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي أَبُو أُمَامَةَ بْنُ سَهْلِ بْنِ حُنَيْفٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ أَسْرِعُوا بِالْجَنَازَةِ فَإِنْ كَانَتْ صَالِحَةً قَرَّبْتُمُوهَا إِلَى الْخَيْرِ وَإِنْ كَانَتْ غَيْرَ ذَلِكَ كَانَ شَرًّا تَضَعُونَهُ عَنْ رِقَابِكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Bersegeralah dalam (mengurus) jenazah, kerana jika (orang yang mati) itu baik, maka kamu akan segera membawanya mendekati kebaikan. Dan jika sebaliknya, maka itu adalah keburukan yang kamu singkirkan dari diri kamu."
  },
  {
    "id": 9353,
    "hadith_number": 2076,
    "tajuk_hadith": "Ganjaran Menghadiri Jenazah sehingga Selesai Solat dan Pengkebumian",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "He who attends the funeral till the prayer is offered for (the dead), for him is the reward of one qirat, and he who attends (and stays) till he is buried, for him is the reward of two qirats. It was said: What are the qirats? He said: They are equivalent to two huge mountains. Two other narrators added: Ibn 'Umar used to pray and then depart (without waiting for the burial of the dead). When the tradition of Abu Huraira reached him, he said:\" We have lost many qirats.\"",
    "arabic_text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، وَهَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، - وَاللَّفْظُ لِهَارُونَ وَحَرْمَلَةَ - قَالَ هَارُونُ حَدَّثَنَا وَقَالَ الآخَرَانِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنِ ابْنِ شِهَابٍ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ هُرْمُزَ الأَعْرَجُ أَنَّ أَبَا هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ شَهِدَ الْجَنَازَةَ حَتَّى يُصَلَّى عَلَيْهَا فَلَهُ قِيرَاطٌ وَمَنْ شَهِدَهَا حَتَّى تُدْفَنَ فَلَهُ قِيرَاطَانِ ‏\"‏ ‏.‏ قِيلَ وَمَا الْقِيرَاطَانِ قَالَ ‏\"‏ مِثْلُ الْجَبَلَيْنِ الْعَظِيمَيْنِ ‏\"‏ ‏.‏ انْتَهَى حَدِيثُ أَبِي الطَّاهِرِ وَزَادَ الآخَرَانِ قَالَ ابْنُ شِهَابٍ قَالَ سَالِمُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ وَكَانَ ابْنُ عُمَرَ يُصَلِّي عَلَيْهَا ثُمَّ يَنْصَرِفُ فَلَمَّا بَلَغَهُ حَدِيثُ أَبِي هُرَيْرَةَ قَالَ لَقَدْ ضَيَّعْنَا قَرَارِيطَ كَثِيرَةً ‏.‏",
    "malay_translation": "Sesiapa yang menghadiri jenazah sehingga solat diimamkan untuk (si mati), maka baginya ganjaran satu qirat, dan sesiapa yang menghadirinya (dan tinggal) sehingga dikebumikan, maka baginya ganjaran dua qirat.\" Ditanya: \"Apakah itu qirat?\" Baginda bersabda: \"Ia menyamai dua gunung besar.\" Dua perawi lain menambah: Ibn 'Umar biasanya solat jenazah kemudian pergi (tanpa menunggu pengkebumian si mati). Apabila hadis Abu Hurairah sampai kepadanya, beliau berkata: \"Sesungguhnya kita telah kehilangan banyak qirat.\""
  },
  {
    "id": 9354,
    "hadith_number": 2077,
    "tajuk_hadith": "Variasi Riwayat: Gunung Besar dan Pengkebumian",
    "perawi_melayu": "Hadis ini telah diriwayatkan daripada Abu Hurairah melalui rangkaian perawi lain sehingga kata-kata ini:",
    "english_text": "\" two great mountains.\" No mention is made of what followed (these words) ; and in the hadith transmitted by 'Abd al- A'la (the words are):\" till (the burial) is complete.\" In the hadith transmitted by 'Abd ar-Razzaq (the words are):\" till he is placed in the grave.\"",
    "arabic_text": "حَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الأَعْلَى، ح وَحَدَّثَنَا ابْنُ رَافِعٍ، وَعَبْدُ، بْنُ حُمَيْدٍ عَنْ عَبْدِ الرَّزَّاقِ، كِلاَهُمَا عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي، هُرَيْرَةَ عَنِ النَّبِيَّ صلى الله عليه وسلم إِلَى قَوْلِهِ الْجَبَلَيْنِ الْعَظِيمَيْنِ ‏.‏ وَلَمْ يَذْكُرَا مَا بَعْدَهُ وَفِي حَدِيثِ عَبْدِ الأَعْلَى حَتَّى يُفْرَغَ مِنْهَا وَفِي حَدِيثِ عَبْدِ الرَّزَّاقِ حَتَّى تُوضَعَ فِي اللَّحْدِ .",
    "malay_translation": "\"dua gunung yang besar.\" Tidak disebutkan apa yang menyusul (kata-kata ini); dan dalam hadis yang diriwayatkan oleh 'Abd al-A'la (kata-katanya adalah): \" sehingga (penguburan) selesai.\" Dalam hadis yang diriwayatkan oleh 'Abd ar-Razzaq (kata-katanya adalah): \" sehingga dia ditempatkan di dalam kubur.\""
  },
  {
    "id": 9355,
    "hadith_number": 2078,
    "tajuk_hadith": "Keutamaan Mengiringi Jenazah Sehingga Dikebumikan",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Abu Hurairah melalui rangkaian perawi lain (dengan kata-kata ini):",
    "english_text": "\" He who followed it (the bier) till he (the dead) is buried.\"",
    "arabic_text": "وَحَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، قَالَ حَدَّثَنِي عُقَيْلُ، بْنُ خَالِدٍ عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ حَدَّثَنِي رِجَالٌ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ بِمِثْلِ حَدِيثِ مَعْمَرٍ وَقَالَ ‏\n\"‏ وَمَنِ اتَّبَعَهَا حَتَّى تُدْفَنَ ‏\"‏ ‏.‏",
    "malay_translation": "Sesiapa yang mengiringinya (jenazah) sehingga dia (mayat) dikebumikan."
  },
  {
    "id": 9356,
    "hadith_number": 2079,
    "tajuk_hadith": "Pahala Solat Jenazah dan Mengiringi Jenazah",
    "perawi_melayu": "Abu Hurairah meriwayatkan Rasulullah (ﷺ) bersabda:",
    "english_text": "He who offered prayer over the dead, but did not follow the bier, for him is the reward of one qirat, and he who followed it, for him is the reward of two qirats. It was asked what the qirats were. He said: The smaller amongst the two is equivalent to Uhud.",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنِي سُهَيْلٌ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ صَلَّى عَلَى جَنَازَةٍ وَلَمْ يَتْبَعْهَا فَلَهُ قِيرَاطٌ فَإِنْ تَبِعَهَا فَلَهُ قِيرَاطَانِ ‏\"‏ ‏.‏ قِيلَ وَمَا الْقِيرَاطَانِ قَالَ ‏\"‏ أَصْغَرُهُمَا مِثْلُ أُحُدٍ ‏\"‏ .‏",
    "malay_translation": "Sesiapa yang menunaikan solat jenazah tetapi tidak mengiringi jenazah tersebut, maka baginya pahala satu qirat, dan sesiapa yang mengiringinya, maka baginya pahala dua qirat. Ditanya, 'Apakah itu dua qirat?' Baginda bersabda, 'Yang paling kecil di antara keduanya adalah seperti (Gunung) Uhud.'"
  },
  {
    "id": 9357,
    "hadith_number": 2080,
    "tajuk_hadith": "Ganjaran Mengiringi Jenazah",
    "perawi_melayu": "Nafi' meriwayatkan bahawa dikatakan kepada Ibn 'Umar bahawa Abu Huraira melaporkan mendengar Rasulullah (ﷺ) bersabda:",
    "english_text": "He who follows the bier, for him is the reward of one qirat. Ibn 'Umar said: Abu Huraira narrated it too often. So he sent (a messenger to) 'A'isha to ascertain (the fact). She ('A'isha) testified Abu Huraira. Ibn 'Umar said: We missed so many qirats.",
    "arabic_text": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا جَرِيرٌ، - يَعْنِي ابْنَ حَازِمٍ - حَدَّثَنَا نَافِعٌ، قَالَ قِيلَ لاِبْنِ عُمَرَ إِنَّ أَبَا هُرَيْرَةَ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ تَبِعَ جَنَازَةً فَلَهُ قِيرَاطٌ مِنَ الأَجْرِ ‏\"‏ ‏.‏ فَقَالَ ابْنُ عُمَرَ أَكْثَرَ عَلَيْنَا أَبُو هُرَيْرَةَ ‏.‏ فَبَعَثَ إِلَى عَائِشَةَ فَسَأَلَهَا فَصَدَّقَتْ أَبَا هُرَيْرَةَ فَقَالَ ابْنُ عُمَرَ لَقَدْ فَرَّطْنَا فِي قَرَارِيطَ كَثِيرَةٍ ‏.‏",
    "malay_translation": "Sesiapa yang mengikuti jenazah, baginya ganjaran satu qirat. Ibn 'Umar berkata: Abu Huraira meriwayatkannya terlalu kerap. Maka dia menghantar (utusan) kepada 'A'isha untuk memastikan (fakta tersebut). Dia ('A'isha) mengesahkan Abu Huraira. Ibn 'Umar berkata: Kami telah terlepas banyak qirat."
  },
  {
    "id": 9358,
    "hadith_number": 2081,
    "tajuk_hadith": "Pahala Solat Jenazah dan Mengiringi Jenazah",
    "perawi_melayu": "Abu Huraira meriwayatkan bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "He who offers prayer for the dead, for him is (the reward of) one qirat; and he who follows the bier till it is placed in the grave, for him (is the reward of) two qirats. I (Abu Hazim, one of the narrators) said: Abu Huraira, what is a qirat? He said: It is like the hill of Uhud.",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ يَزِيدَ بْنِ كَيْسَانَ، حَدَّثَنِي أَبُو حَازِمٍ عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ صَلَّى عَلَى جَنَازَةٍ فَلَهُ قِيرَاطٌ وَمَنِ اتَّبَعَهَا حَتَّى تُوضَعَ فِي الْقَبْرِ فَقِيرَاطَانِ ‏\"‏ ‏.‏ قَالَ قُلْتُ يَا أَبَا هُرَيْرَةَ وَمَا الْقِيرَاطُ قَالَ ‏\"‏ مِثْلُ أُحُدٍ ‏\"‏ ‏.‏",
    "malay_translation": "Sesiapa yang menunaikan solat jenazah, maka baginya (pahala) satu qirat; dan sesiapa yang mengikuti jenazah sehingga ia diletakkan di dalam kubur, maka baginya (pahala) dua qirat. Aku (Abu Hazim, salah seorang perawi) berkata: Wahai Abu Huraira, apakah itu qirat? Beliau berkata: Ia adalah seperti Bukit Uhud."
  },
  {
    "id": 9359,
    "hadith_number": 2082,
    "tajuk_hadith": "Ganjaran Mengiringi Jenazah dan Solat Jenazah",
    "perawi_melayu": "Dawud bin 'Amir bin Sa'd bin Abu Waqqas meriwayatkan daripada ayahnya bahawa ketika beliau duduk bersama Abdullah bin 'Umar, Khabbab, pemilik Maqsura, berkata:",
    "english_text": "Ibn 'Umar, do you hear what Abu Huraira says that he heard the Messenger of Allah (ﷺ) say:\" He who goes out with the bier when taken out from its residence and offers prayer for it and he then follows it till it is buried, he would have two qirats of reward, each qirat being equivalent to Uhud; and he who, after having offered prayer, (directly) came back would have his reward (as great) as Uhud\"? Ibn 'Umar sent Khabbab to 'A'isha in order to ask her about the words of Abu Huraira (and also told him) to come back to him (Ibn 'Umar) and inform him what 'A'isha said. (In the meanwhile) Ibn 'Umar took up a handful of pebbles and turned them over in his hand till the messenger (Khabbab) came back to him and told (him) that 'A'isha testified (the statement of) Abu Huraira. Ibn 'Umar threw the pebbles he had in his hand on the ground and then said: We missed a large number of qirats.",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ، حَدَّثَنِي حَيْوَةُ، حَدَّثَنِي أَبُو صَخْرٍ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ، أَنَّهُ حَدَّثَهُ أَنَّ دَاوُدَ بْنَ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ حَدَّثَهُ عَنْ أَبِيهِ، أَنَّهُ كَانَ قَاعِدًا عِنْدَ عَبْدِ اللَّهِ بْنِ عُمَرَ إِذْ طَلَعَ خَبَّابٌ صَاحِبُ الْمَقْصُورَةِ فَقَالَ يَا عَبْدَ اللَّهِ بْنَ عُمَرَ أَلاَ تَسْمَعُ مَا يَقُولُ أَبُو هُرَيْرَةَ إِنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ خَرَجَ مَعَ جَنَازَةٍ مِنْ بَيْتِهَا وَصَلَّى عَلَيْهَا ثُمَّ تَبِعَهَا حَتَّى تُدْفَنَ كَانَ لَهُ قِيرَاطَانِ مِنْ أَجْرٍ كُلُّ قِيرَاطٍ مِثْلُ أُحُدٍ وَمَنْ صَلَّى عَلَيْهَا ثُمَّ رَجَعَ كَانَ لَهُ مِنَ الأَجْرِ مِثْلُ أُحُدٍ ‏\"‏ ‏.‏ فَأَرْسَلَ ابْنُ عُمَرَ خَبَّابًا إِلَى عَائِشَةَ يَسْأَلُهَا عَنْ قَوْلِ أَبِي هُرَيْرَةَ ثُمَّ يَرْجِعُ إِلَيْهِ فَيُخْبِرُهُ مَا قَالَتْ وَأَخَذَ ابْنُ عُمَرَ قَبْضَةً مِنْ حَصَى الْمَسْجِدِ يُقَلِّبُهَا فِي يَدِهِ حَتَّى رَجَعَ إِلَيْهِ الرَّسُولُ فَقَالَ قَالَتْ عَائِشَةُ صَدَقَ أَبُو هُرَيْرَةَ ‏.‏ فَضَرَبَ ابْنُ عُمَرَ بِالْحَصَى الَّذِي كَانَ فِي يَدِهِ الأَرْضَ ثُمَّ قَالَ لَقَدْ فَرَّطْنَا فِي قَرَارِيطَ كَثِيرَةٍ ‏.‏",
    "malay_translation": "Ibnu Umar, adakah kamu mendengar apa yang Abu Hurairah katakan bahawa beliau mendengar Rasulullah (ﷺ) bersabda: \"Sesiapa yang keluar bersama jenazah dari rumahnya dan menunaikan solat jenazah untuknya, kemudian mengiringinya sehingga dikebumikan, dia akan mendapat dua qirat pahala, setiap qirat bersamaan dengan (gunung) Uhud; dan sesiapa yang, setelah menunaikan solat jenazah, terus pulang, dia akan mendapat pahala (sebesar) Uhud\"? Ibnu Umar menghantar Khabbab kepada Aisyah untuk bertanya tentang kata-kata Abu Hurairah (dan juga menyuruhnya) untuk kembali kepadanya (Ibnu Umar) dan memberitahunya apa yang Aisyah katakan. (Sementara itu) Ibnu Umar mengambil segenggam batu kerikil dan membalikkannya di tangannya sehingga utusan (Khabbab) kembali kepadanya dan memberitahu (beliau) bahawa Aisyah mengesahkan (kenyataan) Abu Hurairah. Ibnu Umar melemparkan batu kerikil yang ada di tangannya ke tanah dan kemudian berkata: Kita telah terlepas banyak qirat pahala."
  },
  {
    "id": 9360,
    "hadith_number": 2083,
    "tajuk_hadith": "Ganjaran Solat Jenazah dan Mengiringi Pengkebumian",
    "perawi_melayu": "Thauban, hamba sahaya Rasulullah (ﷺ) yang dibebaskan meriwayatkan bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "He who offered prayer for the dead, for him is the reward of one qirat, and he who attended its burial, he would have two qirats as his reward. And qirat is equivalent to Uhud.",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى، - يَعْنِي ابْنَ سَعِيدٍ - حَدَّثَنَا شُعْبَةُ، حَدَّثَنِي قَتَادَةُ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ الْيَعْمَرِيِّ، عَنْ ثَوْبَانَ، مَوْلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ صَلَّى عَلَى جَنَازَةٍ فَلَهُ قِيرَاطٌ فَإِنْ شَهِدَ دَفْنَهَا فَلَهُ قِيرَاطَانِ الْقِيرَاطُ مِثْلُ أُحُدٍ ‏\"‏ ‏.‏",
    "malay_translation": "Sesiapa yang menunaikan solat jenazah, maka baginya pahala satu qirat, dan sesiapa yang menghadiri pengkebumiannya, maka baginya dua qirat sebagai pahala. Dan qirat itu adalah seperti (Gunung) Uhud."
  },
  {
    "id": 9361,
    "hadith_number": 2084,
    "tajuk_hadith": "Pahala Qirat Seperti Uhud",
    "perawi_melayu": "Hadis ini diriwayatkan oleh Qatada dengan sanad yang sama. Dan dalam hadis yang diriwayatkan oleh Sa'id dan Hisham, (lafaznya adalah):",
    "english_text": "\" The Apostle of Allah (ﷺ) was asked about qirat, and he said: It is equivalent to Uhud.\"",
    "arabic_text": "وَحَدَّثَنِي ابْنُ بَشَّارٍ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي قَالَ، وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ سَعِيدٍ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا أَبَانٌ، كُلُّهُمْ عَنْ قَتَادَةَ، بِهَذَا الإِسْنَادِ ‏.‏ مِثْلَهُ ‏.‏ وَفِي حَدِيثِ سَعِيدٍ وَهِشَامٍ سُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنِ الْقِيرَاطِ فَقَالَ ‏\n\"‏ مِثْلُ أُحُدٍ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) ditanya tentang qirat, dan baginda bersabda: Ia sama dengan (pahala seperti) Uhud."
  },
  {
    "id": 9362,
    "hadith_number": 2085,
    "tajuk_hadith": "Syafaat Diterima Jika Seratus Muslim Solatkan Jenazah",
    "perawi_melayu": "Aisyah meriwayatkan bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "If a company of Muslims numbering one hundred pray over a dead person, all of them interceding for him, their intercession for him will be accepted.",
    "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ عِيسَى، حَدَّثَنَا ابْنُ الْمُبَارَكِ، أَخْبَرَنَا سَلاَّمُ بْنُ أَبِي مُطِيعٍ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، - رَضِيعِ عَائِشَةَ - عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا مِنْ مَيِّتٍ يُصَلِّي عَلَيْهِ أُمَّةٌ مِنَ الْمُسْلِمِينَ يَبْلُغُونَ مِائَةً كُلُّهُمْ يَشْفَعُونَ لَهُ إِلاَّ شُفِّعُوا فِيهِ ‏\"‏ ‏.‏ قَالَ فَحَدَّثْتُ بِهِ شُعَيْبَ بْنَ الْحَبْحَابِ فَقَالَ حَدَّثَنِي بِهِ أَنَسُ بْنُ مَالِكٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Jika sekumpulan Muslim yang berjumlah seratus orang solat ke atas jenazah, dan kesemuanya memberi syafaat untuknya, syafaat mereka untuknya akan diterima."
  },
  {
    "id": 9363,
    "hadith_number": 2086,
    "tajuk_hadith": "Keutamaan Solat Jenazah oleh Empat Puluh Lelaki yang Tidak Mensyirikkan Allah",
    "perawi_melayu": "'Abdullah bin 'Abbas meriwayatkan bahawa anaknya meninggal dunia di Qudaid atau 'Usfan. Beliau berkata kepada Kuraib untuk melihat berapa ramai orang yang telah berkumpul di sana untuk (jenazahnya). Beliau (Kuraib) berkata:",
    "english_text": "So I went out and I informed him about the people who had gathered there. He (Ibn 'Abbas) said: Do you think they are forty? He (Kuraib) said: Yes. Ibn 'Abbas then said to them: Bring him (the dead body) out for I have heard Allah's Messenger (ﷺ) as saying: If any Muslim dies and forty men who associate nothing with Allah stand over his prayer (they offer prayer over him), Allah will accept them as intercessors for him.",
    "arabic_text": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، وَهَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، وَالْوَلِيدُ بْنُ شُجَاعٍ السَّكُونِيُّ، قَالَ الْوَلِيدُ حَدَّثَنِي وَقَالَ الآخَرَانِ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي أَبُو صَخْرٍ، عَنْ شَرِيكِ بْنِ عَبْدِ، اللَّهِ بْنِ أَبِي نَمِرٍ عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّهُ مَاتَ ابْنٌ لَهُ بِقُدَيْدٍ أَوْ بِعُسْفَانَ فَقَالَ يَا كُرَيْبُ انْظُرْ مَا اجْتَمَعَ لَهُ مِنَ النَّاسِ ‏.‏ قَالَ فَخَرَجْتُ فَإِذَا نَاسٌ قَدِ اجْتَمَعُوا لَهُ فَأَخْبَرْتُهُ فَقَالَ تَقُولُ هُمْ أَرْبَعُونَ قَالَ نَعَمْ ‏.‏ قَالَ أَخْرِجُوهُ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَا مِنْ رَجُلٍ مُسْلِمٍ يَمُوتُ فَيَقُومُ عَلَى جَنَازَتِهِ أَرْبَعُونَ رَجُلاً لاَ يُشْرِكُونَ بِاللَّهِ شَيْئًا إِلاَّ شَفَّعَهُمُ اللَّهُ فِيهِ ‏\"‏ ‏.‏ وَفِي رِوَايَةِ ابْنِ مَعْرُوفٍ عَنْ شَرِيكِ بْنِ أَبِي نَمِرٍ عَنْ كُرَيْبٍ عَنِ ابْنِ عَبَّاسٍ ‏.‏",
    "malay_translation": "Maka saya keluar dan memberitahunya tentang orang ramai yang telah berkumpul di sana. Beliau (Ibn 'Abbas) berkata: Adakah kamu rasa mereka berjumlah empat puluh? Beliau (Kuraib) berkata: Ya. Ibn 'Abbas kemudian berkata kepada mereka: Keluarkan dia (jenazah) kerana saya telah mendengar Rasulullah (ﷺ) bersabda: Jika seorang Muslim meninggal dunia dan empat puluh orang lelaki yang tidak menyekutukan Allah berdiri untuk solat jenazahnya (mereka menunaikan solat jenazah ke atasnya), Allah akan menerima mereka sebagai pemberi syafaat baginya."
  },
  {
    "id": 9364,
    "hadith_number": 2087,
    "tajuk_hadith": "Pujian Orang Ramai Sebagai Saksi Allah",
    "perawi_melayu": "Diriwayatkan oleh Anas bin Malik:",
    "english_text": "There passed a bier (being carried by people) and it was lauded in good terms. Upon this the Messenger of Allah (ﷺ) said: It has become certain, it has become certain, it has become certain. And there passed a bier and it was condemned in bad words. Upon this the Messenger of Allah (ﷺ) said: It has become certain, it has become certain, it has become certain. 'Umar said: May my father and mother be ransom for you! There passed a bier and it was praised in good terms, and you said: It has become certain, it has become certain, it has become certain. And there passed a bier and it was condemned in bad words, and you said: It has become certain, it has become certain, it has become certain. Upon this the Messenger of Allah (way peace be upon him) said: He whom you praised in good terms, Paradise has become certain for him, and he whom you condemned in bad words, Hell has become certain for him. You are Allah's witnesses in the earth, you are Allah's witnesses in the earth, you are Allah's witnesses in the earth.",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَعَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ كُلُّهُمْ عَنِ ابْنِ عُلَيَّةَ، - وَاللَّفْظُ لِيَحْيَى قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ، - أَخْبَرَنَا عَبْدُ الْعَزِيزِ، بْنُ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ مُرَّ بِجَنَازَةٍ فَأُثْنِيَ عَلَيْهَا خَيْرٌ فَقَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَجَبَتْ وَجَبَتْ وَجَبَتْ ‏\"‏ ‏.‏ وَمُرَّ بِجَنَازَةٍ فَأُثْنِيَ عَلَيْهَا شَرٌّ فَقَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَجَبَتْ وَجَبَتْ وَجَبَتْ ‏\"‏ ‏.‏ قَالَ عُمَرُ فِدًى لَكَ أَبِي وَأُمِّي مُرَّ بِجَنَازَةٍ فَأُثْنِيَ عَلَيْهَا خَيْرًا فَقُلْتَ وَجَبَتْ وَجَبَتْ وَجَبَتْ ‏.‏ وَمُرَّ بِجَنَازَةٍ فَأُثْنِيَ عَلَيْهَا شَرٌّ فَقُلْتَ وَجَبَتْ وَجَبَتْ وَجَبَتْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَثْنَيْتُمْ عَلَيْهِ خَيْرًا وَجَبَتْ لَهُ الْجَنَّةُ وَمَنْ أَثْنَيْتُمْ عَلَيْهِ شَرًّا وَجَبَتْ لَهُ النَّارُ أَنْتُمْ شُهَدَاءُ اللَّهِ فِي الأَرْضِ أَنْتُمْ شُهَدَاءُ اللَّهِ فِي الأَرْضِ أَنْتُمْ شُهَدَاءُ اللَّهِ فِي الأَرْضِ ‏\"‏ ‏.‏",
    "malay_translation": "Pernah dibawa lalu jenazah dan dipuji dengan kata-kata yang baik. Maka Rasulullah (ﷺ) bersabda: 'Pasti, pasti, pasti.' Dan pernah dibawa lalu jenazah dan dikecam dengan kata-kata yang buruk. Maka Rasulullah (ﷺ) bersabda: 'Pasti, pasti, pasti.' Umar berkata: 'Demi ayah dan ibuku sebagai tebusan untukmu! Pernah dibawa lalu jenazah dan dipuji dengan kata-kata yang baik, dan engkau bersabda: 'Pasti, pasti, pasti.' Dan pernah dibawa lalu jenazah dan dikecam dengan kata-kata yang buruk, dan engkau bersabda: 'Pasti, pasti, pasti.' Maka Rasulullah (ﷺ) bersabda: 'Sesiapa yang kamu puji dengan kata-kata yang baik, maka pasti baginya syurga, dan sesiapa yang kamu kecam dengan kata-kata yang buruk, maka pasti baginya neraka. Kamu adalah saksi-saksi Allah di bumi, kamu adalah saksi-saksi Allah di bumi, kamu adalah saksi-saksi Allah di bumi.'"
  },
  {
    "id": 9365,
    "hadith_number": 2088,
    "tajuk_hadith": "Penyampaian Hadis Melalui Sanad Lain",
    "perawi_melayu": "",
    "english_text": "This hadith has been narrated through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنِي أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، ح وَحَدَّثَنِي يَحْيَى بْنُ، يَحْيَى أَخْبَرَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، كِلاَهُمَا عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ مُرَّ عَلَى النَّبِيِّ صلى الله عليه وسلم بِجَنَازَةٍ ‏.‏ فَذَكَرَ بِمَعْنَى حَدِيثِ عَبْدِ الْعَزِيزِ عَنْ أَنَسٍ غَيْرَ أَنَّ حَدِيثَ عَبْدِ الْعَزِيزِ أَتَمُّ ‏.‏",
    "malay_translation": "Hadis ini telah diriwayatkan melalui sanad periwayatan yang lain."
  },
  {
    "id": 9366,
    "hadith_number": 2089,
    "tajuk_hadith": "Kelegaan Kematian: Mukmin dan Dunia dari Kejahatan",
    "perawi_melayu": "Qatada b. Rib'i meriwayatkan bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "Whenever a bier passed before him, he said: He is the one to find relief and the one with (the departure of him) other will find relief. They said: Apostle of Allah, who is al-Mustarih and al-Mustarah? Upon this he said: The believing servant finds relief from the troubles of the world, and in the death of a wicked person, the people, towns, trees and animals find rellef.",
    "arabic_text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، فِيمَا قُرِئَ عَلَيْهِ عَنْ مُحَمَّدِ بْنِ عَمْرِو، بْنِ حَلْحَلَةَ عَنْ مَعْبَدِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِي قَتَادَةَ بْنِ رِبْعِيٍّ، أَنَّهُ كَانَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مُرَّ عَلَيْهِ بِجَنَازَةٍ فَقَالَ ‏\"‏ مُسْتَرِيحٌ وَمُسْتَرَاحٌ مِنْهُ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ مَا الْمُسْتَرِيحُ وَالْمُسْتَرَاحُ مِنْهُ ‏.‏ فَقَالَ ‏\"‏ الْعَبْدُ الْمُؤْمِنُ يَسْتَرِيحُ مِنْ نَصَبِ الدُّنْيَا وَالْعَبْدُ الْفَاجِرُ يَسْتَرِيحُ مِنْهُ الْعِبَادُ وَالْبِلاَدُ وَالشَّجَرُ وَالدَّوَابُّ ‏\"‏ ‏.‏",
    "malay_translation": "Setiap kali jenazah dibawa di hadapannya, baginda bersabda: 'Dia adalah orang yang menemui kelegaan dan orang lain mendapat kelegaan (dengan pemergiannya)'. Mereka bertanya: 'Wahai Rasulullah, siapakah al-Mustarih dan al-Mustarah?'. Baginda bersabda: 'Hamba yang beriman mendapat kelegaan daripada kesusahan dunia, dan dengan kematian orang yang jahat, manusia, negeri, pokok-pokok dan binatang-binatang mendapat kelegaan'."
  },
  {
    "id": 9367,
    "hadith_number": 2090,
    "tajuk_hadith": "Kelegaan Hamba Beriman daripada Kesusahan Dunia dan Rahmat Allah",
    "perawi_melayu": "Dalam hadis yang diriwayatkan oleh Yahya b. Sa'id daripada Qatada (lafaznya adalah):",
    "english_text": "(The believing servant) finds relief from the troubles of the world and its hardships and (gets into) the Mercy of Allah.",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، جَمِيعًا عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ أَبِي هِنْدٍ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنِ ابْنٍ لِكَعْبِ بْنِ مَالِكٍ، عَنْ أَبِي قَتَادَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم وَفِي حَدِيثِ يَحْيَى بْنِ سَعِيدٍ ‏\n\"‏ يَسْتَرِيحُ مِنْ أَذَى الدُّنْيَا وَنَصَبِهَا إِلَى رَحْمَةِ اللَّهِ ‏\"‏ ‏.‏",
    "malay_translation": "(Hamba yang beriman) mendapat kelegaan daripada kesusahan dunia dan kesulitannya serta (masuk ke dalam) Rahmat Allah."
  },
  {
    "id": 9368,
    "hadith_number": 2091,
    "tajuk_hadith": "Berita Kematian Najasyi dan Solat Jenazah Ghaib",
    "perawi_melayu": "",
    "english_text": "Abu Huraira reported that the Messenger of Allah (ﷺ) gave the people news of the death of Negus on the day he died, and he took them out to the place of prayer and observed four takbirs.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَعَى لِلنَّاسِ النَّجَاشِيَ فِي الْيَوْمِ الَّذِي مَاتَ فِيهِ فَخَرَجَ بِهِمْ إِلَى الْمُصَلَّى وَكَبَّرَ أَرْبَعَ تَكْبِيرَاتٍ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah (ﷺ) menyampaikan berita kematian Najasyi kepada orang ramai pada hari kematiannya, dan baginda membawa mereka ke tempat solat dan melakukan takbir empat kali."
  },
  {
    "id": 9369,
    "hadith_number": 2092,
    "tajuk_hadith": "Solat Jenazah Ghaib untuk Raja Najasyi",
    "perawi_melayu": "Abu Huraira meriwayatkan:",
    "english_text": "The Messenger of Allah (ﷺ) gave us the news of the death of Negus, the ruler of Abyssinia, on the day when he died, and he said (to us): Beg pardon for your brother. Ibn Shihab said that Sa'id b. Musayyib had told that Abu Huraira had narrated to him that the Messenger of Allah (ﷺ) drew them up in a row in a place of prayer, and offered prayer and recited four takbirs for him.",
    "arabic_text": "وَحَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، قَالَ حَدَّثَنِي عُقَيْلُ، بْنُ خَالِدٍ عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّهُمَا حَدَّثَاهُ عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ نَعَى لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم النَّجَاشِيَ صَاحِبَ الْحَبَشَةِ فِي الْيَوْمِ الَّذِي مَاتَ فِيهِ فَقَالَ ‏\n\"‏ اسْتَغْفِرُوا لأَخِيكُمْ ‏\"‏ ‏.‏ قَالَ ابْنُ شِهَابٍ وَحَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ أَنَّ أَبَا هُرَيْرَةَ حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَفَّ بِهِمْ بِالْمُصَلَّى فَصَلَّى فَكَبَّرَ عَلَيْهِ أَرْبَعَ تَكْبِيرَاتٍ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) memberikan kami berita tentang kematian Najasyi, pemerintah Habsyah, pada hari kematiannya, dan baginda bersabda (kepada kami): 'Mohonlah ampunan untuk saudara kamu.' Ibn Shihab berkata bahawa Sa'id b. Musayyib telah memberitahu bahawa Abu Huraira telah meriwayatkan kepadanya bahawa Rasulullah (ﷺ) mengatur mereka dalam barisan di tempat solat, dan menunaikan solat serta membaca empat takbir untuknya."
  },
  {
    "id": 9370,
    "hadith_number": 2093,
    "tajuk_hadith": "Hadis Diriwayatkan Melalui Sanad Lain",
    "perawi_melayu": "",
    "english_text": "This hadith is narrated through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، وَحَسَنٌ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالُوا حَدَّثَنَا يَعْقُوبُ، - وَهُوَ ابْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ - حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، كَرِوَايَةِ عُقَيْلٍ بِالإِسْنَادَيْنِ جَمِيعًا ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan melalui sanad periwayatan yang lain."
  },
  {
    "id": 9371,
    "hadith_number": 2094,
    "tajuk_hadith": "Solat Rasulullah untuk Ashama, Negus",
    "perawi_melayu": "",
    "english_text": "Jabir b. 'Abdullah reported that the Messenger of Allah (ﷺ) offered prayer for Ashama, the Negus, and recited four takbirs.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ سَلِيمِ بْنِ حَيَّانٍ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ مِينَاءَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى",
    "malay_translation": "Jabir b. 'Abdullah meriwayatkan bahawa Rasulullah (ﷺ) telah menunaikan solat untuk Ashama, Negus, dan membaca empat takbir."
  },
  {
    "id": 9372,
    "hadith_number": 2095,
    "tajuk_hadith": "Kematian Ashama dan Solat Jenazah",
    "perawi_melayu": "Jabir b. 'Abdullah meriwayatkan bahawa Rasulullah ﷺ bersabda:",
    "english_text": "There died today the pious servant of Allah, Ashama. So he stood up and led us in (funeral prayer) over him.",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَاتَ الْيَوْمَ عَبْدٌ لِلَّهِ صَالِحٌ أَصْحَمَةُ ‏\"‏ ‏.‏ فَقَامَ فَأَمَّنَا وَصَلَّى عَلَيْهِ ‏.‏",
    "malay_translation": "Pada hari ini telah meninggal dunia seorang hamba Allah yang soleh, Ashama. Kemudian baginda berdiri dan memimpin kami dalam (solat jenazah) ke atasnya."
  },
  {
    "id": 9373,
    "hadith_number": 2096,
    "tajuk_hadith": "Solat Jenazah dan Pembentukan Saf",
    "perawi_melayu": "Jabir b. 'Abdullah meriwayatkan bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "A brother of yours has died, so stand up and offer prayer over him. So we stood up and drew ourselves up into two rows.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ، بْنِ عَبْدِ اللَّهِ ح .\n وَحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا ابْنُ عُلَيَّةَ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي، الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ أَخًا لَكُمْ قَدْ مَاتَ فَقُومُوا فَصَلُّوا عَلَيْهِ ‏\"‏ ‏.‏ قَالَ فَقُمْنَا فَصَفَّنَا صَفَّيْنِ ‏.‏",
    "malay_translation": "Seorang saudara kamu telah meninggal dunia, maka berdirilah dan solatkan jenazahnya. Maka kami pun berdiri dan membentuk dua barisan."
  },
  {
    "id": 9374,
    "hadith_number": 2097,
    "tajuk_hadith": "Solat Jenazah untuk Raja Najasyi",
    "perawi_melayu": "Imran b. Husain melaporkan bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "A brother of yours has died; so stand up and offer prayer for him, i. e. Negus. And in the hadith transmitted by Zubair (the words are):\" Your brother.\"",
    "arabic_text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَعَلِيُّ بْنُ حُجْرٍ، قَالاَ حَدَّثَنَا إِسْمَاعِيلُ، ح وَحَدَّثَنَا يَحْيَى، بْنُ أَيُّوبَ حَدَّثَنَا ابْنُ عُلَيَّةَ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الْمُهَلَّبِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ أَخًا لَكُمْ قَدْ مَاتَ فَقُومُوا فَصَلُّوا عَلَيْهِ ‏\"‏ ‏.‏ يَعْنِي النَّجَاشِيَ وَفِي رِوَايَةِ زُهَيْرٍ ‏\"‏ إِنَّ أَخَاكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang saudara kamu telah meninggal dunia; maka berdirilah dan solatlah untuknya, iaitu Najasyi. Dan dalam hadis yang diriwayatkan oleh Zubair (lafaznya adalah): \"Saudara kamu.\""
  },
  {
    "id": 9375,
    "hadith_number": 2098,
    "tajuk_hadith": "Sembahyang Jenazah di Kubur Selepas Pengebumian",
    "perawi_melayu": "Sha'bi meriwayatkan bahawa Rasulullah (ﷺ) menunaikan sembahyang di atas kubur selepas jenazah dikebumikan dan baginda membaca empat takbir di atasnya. Shaibani berkata:",
    "english_text": "I said to Sha'bi: Who narrated it to you? He said: An authentic one, 'Abdullah b. 'Abbas. This is the word of a hasan hadith. In the narration of Ibn Numair (the words are): The Messenger of Allah (ﷺ) went to the grave which had been newly prepared and prayed over it, and they also prayed who were behind him and he recited four takbirs. I said to 'Amir: Who narrated it to you? He said: An authentic one who saw him, i e. Ibn 'Abbas.",
    "arabic_text": "حَدَّثَنَا حَسَنُ بْنُ الرَّبِيعِ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ، إِدْرِيسَ عَنِ الشَّيْبَانِيِّ، عَنِ الشَّعْبِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى عَلَى قَبْرٍ بَعْدَ مَا دُفِنَ فَكَبَّرَ عَلَيْهِ أَرْبَعًا ‏.‏ قَالَ الشَّيْبَانِيُّ فَقُلْتُ لِلشَّعْبِيِّ مَنْ حَدَّثَكَ بِهَذَا قَالَ الثِّقَةُ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ ‏.‏ هَذَا لَفْظُ حَدِيثِ حَسَنٍ وَفِي رِوَايَةِ ابْنِ نُمَيْرٍ قَالَ انْتَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى قَبْرٍ رَطْبٍ فَصَلَّى عَلَيْهِ وَصَفُّوا خَلْفَهُ وَكَبَّرَ أَرْبَعًا ‏.‏ قُلْتُ لِعَامِرٍ مَنْ حَدَّثَكَ قَالَ الثِّقَةُ مَنْ شَهِدَهُ ابْنُ عَبَّاسٍ ‏.‏",
    "malay_translation": "Saya berkata kepada Sha'bi: Siapa yang meriwayatkannya kepadamu? Dia berkata: Seorang yang *thiqah* (dipercayai), Abdullah b. Abbas. Ini adalah lafaz hadis *hasan*. Dalam riwayat Ibn Numair (lafaznya adalah): Rasulullah (ﷺ) pergi ke kubur yang baru digali dan sembahyang di atasnya, dan mereka juga sembahyang di belakang baginda dan baginda membaca empat takbir. Saya berkata kepada 'Amir: Siapa yang meriwayatkannya kepadamu? Dia berkata: Seorang yang *thiqah* yang menyaksikannya, iaitu Ibn 'Abbas."
  },
  {
    "id": 9376,
    "hadith_number": 2099,
    "tajuk_hadith": "Rasulullah (ﷺ) Membaca Empat Takbir",
    "perawi_melayu": "Hadis ini diriwayatkan melalui sanad lain, tetapi dalam salah satu sanad tersebut (kata-kata ini ditemukan):",
    "english_text": "\" The Apostle of Allah (ﷺ) recited four takbirs.\"",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، ح وَحَدَّثَنَا حَسَنُ بْنُ الرَّبِيعِ، وَأَبُو كَامِلٍ قَالاَ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، ح وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، كُلُّ هَؤُلاَءِ عَنِ الشَّيْبَانِيِّ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ وَلَيْسَ فِي حَدِيثِ أَحَدٍ مِنْهُمْ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَبَّرَ عَلَيْهِ أَرْبَعًا ‏.‏",
    "malay_translation": "\"Rasulullah (ﷺ) membaca empat takbir.\""
  },
  {
    "id": 9377,
    "hadith_number": 2100,
    "tajuk_hadith": "Solat Jenazah di Kubur dan Sanad Hadis Tambahan",
    "perawi_melayu": "",
    "english_text": "The hadith as narrated by Shaibani has been narrated through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَهَارُونُ بْنُ عَبْدِ اللَّهِ، جَمِيعًا عَنْ وَهْبِ بْنِ جَرِيرٍ، عَنْ شُعْبَةَ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، ح وَحَدَّثَنِي أَبُو غَسَّانَ، مُحَمَّدُ بْنُ عَمْرٍو الرَّازِيُّ حَدَّثَنَا يَحْيَى بْنُ الضُّرَيْسِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ، عَنْ أَبِي حَصِينٍ، كِلاَهُمَا عَنِ الشَّعْبِيِّ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم فِي صَلاَتِهِ عَلَى الْقَبْرِ نَحْوَ حَدِيثِ الشَّيْبَانِيِّ ‏.‏ لَيْسَ فِي حَدِيثِهِمْ وَكَبَّرَ أَرْبَعًا ‏.‏",
    "malay_translation": "Hadis yang diriwayatkan oleh Shaibani ini juga diriwayatkan melalui sanad (rangkaian perawi) yang lain."
  },
  {
    "id": 9378,
    "hadith_number": 2101,
    "tajuk_hadith": "Solat di Atas Kubur",
    "perawi_melayu": "",
    "english_text": "Anas reported that the Messenger of Allah (ﷺ) observed prayer on the grave.",
    "arabic_text": "وَحَدَّثَنِي إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ عَرْعَرَةَ السَّامِيُّ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ حَبِيبِ بْنِ الشَّهِيدِ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى عَلَى قَبْرٍ ‏.‏",
    "malay_translation": "Anas meriwayatkan bahawa Rasulullah (ﷺ) melakukan solat di atas kubur."
  },
  {
    "id": 9379,
    "hadith_number": 2102,
    "tajuk_hadith": "Keutamaan Solat Jenazah Nabi SAW di Kubur",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA bahawa seorang wanita berkulit gelap (atau seorang pemuda) biasa menyapu masjid. Rasulullah SAW merasa kehilangan dia (atau dia) dan bertanya tentang dia (atau dia). Orang ramai memberitahunya bahawa dia (atau dia) telah meninggal dunia. Baginda bertanya mengapa mereka tidak memberitahunya, dan nampaknya mereka telah menganggap urusan dia (atau dia) atau urusannya sebagai perkara kecil. Baginda (Nabi Muhammad SAW) bersabda:",
    "english_text": "Lead me to her (or his) grave. They led him to that place and he said prayer over her (or him) and then remarked: Verily, these graves are full of darkness for their dwellers. Verily, the Mighty and Glorious Allah illuminates them for their occupants by reason of my prayer over them.",
    "arabic_text": "وَحَدَّثَنِي أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، وَأَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ - وَاللَّفْظُ لأَبِي كَامِلٍ - قَالاَ حَدَّثَنَا حَمَّادٌ، - وَهُوَ ابْنُ زَيْدٍ عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي، هُرَيْرَةَ أَنَّ امْرَأَةً، سَوْدَاءَ كَانَتْ تَقُمُّ الْمَسْجِدَ - أَوْ شَابًّا - فَفَقَدَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَأَلَ عَنْهَا - أَوْ عَنْهُ - فَقَالُوا مَاتَ ‏.‏ قَالَ ‏\"‏ أَفَلاَ كُنْتُمْ آذَنْتُمُونِي ‏\"‏ ‏.‏ قَالَ فَكَأَنَّهُمْ صَغَّرُوا أَمْرَهَا - أَوْ أَمْرَهُ - فَقَالَ ‏\"‏ دُلُّونِي عَلَى قَبْرِهِ ‏\"‏ ‏.‏ فَدَلُّوهُ فَصَلَّى عَلَيْهَا ثُمَّ قَالَ ‏\"‏ إِنَّ هَذِهِ الْقُبُورَ مَمْلُوءَةٌ ظُلْمَةً عَلَى أَهْلِهَا وَإِنَّ اللَّهَ عَزَّ وَجَلَّ يُنَوِّرُهَا لَهُمْ بِصَلاَتِي عَلَيْهِمْ ‏\"‏ ‏.‏",
    "malay_translation": "Tunjukkan aku kuburnya. Mereka membawa baginda ke tempat itu, dan baginda menyembahyangkan jenazah ke atasnya, kemudian bersabda: Sesungguhnya kubur-kubur ini penuh dengan kegelapan bagi penghuninya. Sesungguhnya Allah Yang Maha Perkasa lagi Maha Mulia meneranginya bagi penghuninya dengan sebab solatku ke atas mereka."
  },
  {
    "id": 9380,
    "hadith_number": 2103,
    "tajuk_hadith": "Bilangan Takbir dalam Solat Jenazah Mengikut Sunnah Rasulullah ﷺ",
    "perawi_melayu": "Diriwayatkan daripada 'Abd al-Rahman b. Abu Laila",
    "english_text": "The Messenger of Allah (ﷺ) recited thus.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالُوا حَدَّثَنَا مُحَمَّدُ، بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ، - وَقَالَ أَبُو بَكْرٍ عَنْ شُعْبَةَ، - عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ عَبْدِ الرَّحْمَنِ، بْنِ أَبِي لَيْلَى قَالَ كَانَ زَيْدٌ يُكَبِّرُ عَلَى جَنَائِزِنَا أَرْبَعًا وَإِنَّهُ كَبَّرَ عَلَى جَنَازَةٍ خَمْسًا فَسَأَلْتُهُ فَقَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُكَبِّرُهَا ‏.‏",
    "malay_translation": "Diriwayatkan daripada 'Abd al-Rahman b. Abu Laila, bahawa Zaid biasanya bertakbir sebanyak empat kali pada jenazah kami. Namun, pada suatu jenazah, beliau bertakbir sebanyak lima kali. Saya bertanya kepadanya mengenai sebab (perbezaan ini), lalu beliau menjawab: 'Rasulullah ﷺ bertakbir sebegini (lima kali).'"
  },
  {
    "id": 9381,
    "hadith_number": 2104,
    "tajuk_hadith": "Berdiri Ketika Melihat Jenazah",
    "perawi_melayu": "Diriwayatkan daripada 'Amir bin Rabi'a (semoga Allah meredhainya) bahawa Nabi (ﷺ) bersabda:",
    "english_text": "Whenever you see a funeral procession, stand up for that until it moves away or is lowered on the ground.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، وَابْنُ، نُمَيْرٍ قَالُوا حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنْ عَامِرِ بْنِ رَبِيعَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا رَأَيْتُمُ الْجَنَازَةَ فَقُومُوا لَهَا حَتَّى تُخَلِّفَكُمْ أَوْ تُوضَعَ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila kamu melihat jenazah dibawa, maka berdirilah untuk menghormatinya sehingga jenazah itu berlalu atau diletakkan di tanah."
  },
  {
    "id": 9382,
    "hadith_number": 2105,
    "tajuk_hadith": "Perintah Berdiri Ketika Jenazah Melintas",
    "perawi_melayu": "Diriwayatkan daripada 'Amir ibn Rabi'a (semoga Allah meredhainya) bahawa Nabi (ﷺ) bersabda:",
    "english_text": "Should any one of you come across a funeral procession, and if he does not intend to accompany it, he must stand up until it passes by him or is placed upon the ground before it passes him.",
    "arabic_text": "وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، ح وَحَدَّثَنِي حَرْمَلَةُ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، جَمِيعًا عَنِ ابْنِ شِهَابٍ، بِهَذَا الإِسْنَادِ ‏.‏ وَفِي حَدِيثِ يُونُسَ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح وَحَدَّثَنَا ابْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنْ عَامِرِ بْنِ رَبِيعَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا رَأَى أَحَدُكُمُ الْجَنَازَةَ فَإِنْ لَمْ يَكُنْ مَاشِيًا مَعَهَا فَلْيَقُمْ حَتَّى تُخَلِّفَهُ أَوْ تُوضَعَ مِنْ قَبْلِ أَنْ تُخَلِّفَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Sekiranya salah seorang daripada kamu menemui jenazah, dan jika dia tidak berniat untuk mengiringinya, dia mesti berdiri sehingga jenazah itu melepasi dia atau diletakkan di tanah sebelum ia melepasinya."
  },
  {
    "id": 9383,
    "hadith_number": 2106,
    "tajuk_hadith": "Adab Berdiri Ketika Melihat Jenazah",
    "perawi_melayu": "Diriwayatkan daripada Ibn Juraij bahawa Nabi ﷺ bersabda:",
    "english_text": "Should anyone amongst you see a bier he must stand up so long as it is within sight in case he does not intend to follow it.",
    "arabic_text": "وَحَدَّثَنِي أَبُو كَامِلٍ، حَدَّثَنَا حَمَّادٌ، ح وَحَدَّثَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا إِسْمَاعِيلُ، جَمِيعًا عَنْ أَيُّوبَ، ح وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، ح وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنِ ابْنِ عَوْنٍ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، كُلُّهُمْ عَنْ نَافِعٍ، بِهَذَا الإِسْنَادِ ‏.‏ نَحْوَ حَدِيثِ اللَّيْثِ بْنِ سَعْدٍ غَيْرَ أَنَّ حَدِيثَ، ابْنِ جُرَيْجٍ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِذَا رَأَى أَحَدُكُمُ الْجَنَازَةَ فَلْيَقُمْ حِينَ يَرَاهَا حَتَّى تُخَلِّفَهُ إِذَا كَانَ غَيْرَ مُتَّبِعِهَا ‏\"‏ ‏.‏",
    "malay_translation": "Sekiranya sesiapa di antara kamu melihat keranda jenazah, maka hendaklah dia berdiri selagi keranda itu masih terlihat, jika dia tidak berniat untuk mengiringinya."
  },
  {
    "id": 9384,
    "hadith_number": 2107,
    "tajuk_hadith": "Larangan Duduk Sebelum Jenazah Diletakkan",
    "perawi_melayu": "Diriwayatkan daripada Abu Sa'id al-Khudri bahawa Nabi (ﷺ) bersabda:",
    "english_text": "When you follow a bier, do not sit until it is placed on the (ground).",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا اتَّبَعْتُمْ جَنَازَةً فَلاَ تَجْلِسُوا حَتَّى تُوضَعَ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila kamu mengiringi jenazah, jangan duduk sehingga ia diletakkan (ke tanah)."
  },
  {
    "id": 9385,
    "hadith_number": 2108,
    "tajuk_hadith": "Perintah Berdiri Ketika Melihat Jenazah",
    "perawi_melayu": "Diriwayatkan daripada Abu Sa'id al-Khudri bahawa Nabi (ﷺ) bersabda:",
    "english_text": "Whenever you come across a bier you should stand up, and he who follows it should not sit down till it is placed on the ground.",
    "arabic_text": "وَحَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ، وَعَلِيُّ بْنُ حُجْرٍ، قَالاَ حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ عُلَيَّةَ - عَنْ هِشَامٍ الدَّسْتَوَائِيِّ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، - وَاللَّفْظُ لَهُ - حَدَّثَنَا مُعَاذُ بْنُ، هِشَامٍ حَدَّثَنِي أَبِي، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، قَالَ حَدَّثَنَا أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي، سَعِيدٍ الْخُدْرِيِّ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا رَأَيْتُمُ الْجَنَازَةَ فَقُومُوا فَمَنْ تَبِعَهَا فَلاَ يَجْلِسْ حَتَّى تُوضَعَ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila kamu melihat jenazah, maka hendaklah kamu berdiri, dan sesiapa yang mengiringinya janganlah duduk sehingga ia diletakkan di tanah."
  },
  {
    "id": 9386,
    "hadith_number": 2109,
    "tajuk_hadith": "Berdiri Ketika Jenazah Lalu",
    "perawi_melayu": "Diriwayatkan daripada Jabir bin 'Abdullah:",
    "english_text": "There passed a bier and the Prophet (ﷺ) stood up for it and we also stood up along with him. We said: Messenger of Allah, that was the bier of a Jewess. Upon this he remarked: Verily, death is a matter of consternation, so whenever you come across a bier stand up.",
    "arabic_text": "وَحَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ، وَعَلِيُّ بْنُ حُجْرٍ، قَالاَ حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ عُلَيَّةَ - عَنْ هِشَامٍ الدَّسْتَوَائِيِّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ مِقْسَمٍ، عَنْ جَابِرِ، بْنِ عَبْدِ اللَّهِ قَالَ مَرَّتْ جَنَازَةٌ فَقَامَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَقُمْنَا مَعَهُ فَقُلْنَا يَا رَسُولَ اللَّهِ إِنَّهَا يَهُودِيَّةٌ ‏.‏ فَقَالَ ‏\n\"‏ إِنَّ الْمَوْتَ فَزَعٌ فَإِذَا رَأَيْتُمُ الْجَنَازَةَ فَقُومُوا ‏\"‏ ‏.‏",
    "malay_translation": "Jenazah telah lalu dan Nabi (ﷺ) berdiri untuknya, dan kami juga berdiri bersama baginda. Kami berkata: Wahai Rasulullah, itu adalah jenazah seorang wanita Yahudi. Baginda bersabda: Sesungguhnya, kematian itu adalah sesuatu yang menakutkan, jadi apabila kamu melihat jenazah, berdirilah."
  },
  {
    "id": 9387,
    "hadith_number": 2110,
    "tajuk_hadith": "Nabi (ﷺ) Berdiri untuk Jenazah sehingga Hilang dari Pandangan",
    "perawi_melayu": "",
    "english_text": "Ibn Juraij told me that Abu Zubair heard Jabir say that the Prophet (ﷺ) kept standing for a bier until it disappeared.",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرًا، يَقُولُ قَامَ النَّبِيُّ صلى الله عليه وسلم لِجَنَازَةٍ مَرَّتْ بِهِ حَتَّى تَوَارَتْ ‏.‏",
    "malay_translation": "Ibn Juraij memberitahu saya bahawa Abu Zubair mendengar Jabir berkata bahawa Nabi (ﷺ) terus berdiri untuk jenazah sehingga ia hilang dari pandangan."
  },
  {
    "id": 9388,
    "hadith_number": 2111,
    "tajuk_hadith": "Berdiri untuk Jenazah Yahudi",
    "perawi_melayu": "",
    "english_text": "Again Abu Zubair heard Jabir say that the Prophet (ﷺ) and his Companions kept standing for a bier of a Jew until it disappeared from sight.",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَيْضًا أَنَّهُ سَمِعَ جَابِرًا، يَقُولُ قَامَ النَّبِيُّ صلى الله عليه وسلم وَأَصْحَابُهُ لِجَنَازَةِ يَهُودِيٍّ حَتَّى تَوَارَتْ ‏.‏",
    "malay_translation": "Abu Zubair mendengar Jabir berkata bahawa Nabi (ﷺ) dan para Sahabatnya terus berdiri untuk jenazah seorang Yahudi sehingga ia hilang dari pandangan."
  },
  {
    "id": 9389,
    "hadith_number": 2112,
    "tajuk_hadith": "Jenazah Orang Yahudi dan Penghormatan Kepadanya",
    "perawi_melayu": "Diriwayatkan daripada Ibn Abu Laila bahawa ketika Qais b. Sa'd dan Sahl b. Hunaif berada di Qadisiyyah, sebuah jenazah berlalu di hadapan mereka lalu mereka berdua berdiri. Mereka diberitahu bahawa jenazah itu adalah dari kalangan penduduk tempatan (bukan Muslim). Mereka berkata bahawa pernah jenazah berlalu di hadapan Rasulullah (ﷺ) dan baginda berdiri. Baginda diberitahu bahawa jenazah itu adalah seorang Yahudi. Lalu baginda bersabda:",
    "english_text": "Was he not a human being or did he not have a soul? And in the hadith narrated by 'Amr b. Murra with the same chain of transmitters, (the words) are:\" There passed a bier before us.\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنِ ابْنِ أَبِي لَيْلَى، أَنَّ قَيْسَ بْنَ سَعْدٍ، وَسَهْلَ بْنَ حُنَيْفٍ، كَانَا بِالْقَادِسِيَّةِ فَمَرَّتْ بِهِمَا جَنَازَةٌ فَقَامَا فَقِيلَ لَهُمَا إِنَّهَا مِنْ أَهْلِ الأَرْضِ ‏.‏ فَقَالاَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَرَّتْ بِهِ جَنَازَةٌ فَقَامَ فَقِيلَ إِنَّهُ يَهُودِيٌّ ‏.‏ فَقَالَ ‏\n\"‏ أَلَيْسَتْ نَفْسًا ‏\"‏ ‏.‏\n وَحَدَّثَنِيهِ الْقَاسِمُ بْنُ زَكَرِيَّاءَ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ شَيْبَانَ، عَنِ الأَعْمَشِ، عَنْ عَمْرِو بْنِ مُرَّةَ، بِهَذَا الإِسْنَادِ وَفِيهِ فَقَالاَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَمَرَّتْ عَلَيْنَا جَنَازَةٌ ‏.‏",
    "malay_translation": "Bukankah dia seorang manusia? Bukankah dia mempunyai jiwa? Dan dalam hadis yang diriwayatkan oleh 'Amr b. Murra dengan sanad yang sama, (perkataannya) adalah: \"Sebuah jenazah telah berlalu di hadapan kami.\""
  },
  {
    "id": 9390,
    "hadith_number": 2113,
    "tajuk_hadith": "Berdiri dan Duduk untuk Jenazah",
    "perawi_melayu": "Diriwayatkan daripada Waqid:",
    "english_text": "Nafi' b. Jubair saw me and we were standing for a bier, while he was sitting and waiting for the bier to be placed on the ground. He said to me: What makes you keep standing? I said: I am waiting that the bier may be placed on the ground (and I am doing that) on the hadith narrated to me by Abu Sa'id al-Khudri. Upon this Nafi' said: Verily, Mas'ud b. Hakam reported to me on the authority of Hadrat 'Ali b. Abu Talib that the Prophet (ﷺ) stood up first (for a bier) and then sat down.",
    "arabic_text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا اللَّيْثُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ وَاقِدِ بْنِ عَمْرِو بْنِ سَعْدِ بْنِ مُعَاذٍ، أَنَّهُ قَالَ رَآنِي نَافِعُ بْنُ جُبَيْرٍ وَنَحْنُ فِي جَنَازَةٍ قَائِمًا وَقَدْ جَلَسَ يَنْتَظِرُ أَنْ تُوضَعَ الْجَنَازَةُ فَقَالَ لِي مَا يُقِيمُكَ فَقُلْتُ أَنْتَظِرُ أَنْ تُوضَعَ الْجَنَازَةُ لِمَا يُحَدِّثُ أَبُو سَعِيدٍ الْخُدْرِيُّ ‏.‏ فَقَالَ نَافِعٌ فَإِنَّ مَسْعُودَ بْنَ الْحَكَمِ حَدَّثَنِي عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ أَنَّهُ قَالَ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ قَعَدَ ‏.‏",
    "malay_translation": "Nafi' b. Jubair melihat saya dan kami sedang berdiri untuk jenazah, sementara dia duduk dan menunggu jenazah diletakkan di tanah. Dia berkata kepada saya: Apa yang membuat kamu terus berdiri? Saya berkata: Saya sedang menunggu jenazah diletakkan di tanah (dan saya melakukan itu) berdasarkan hadis yang diriwayatkan kepada saya oleh Abu Sa'id al-Khudri. Kemudian Nafi' berkata: Sesungguhnya, Mas'ud b. Hakam melaporkan kepada saya dari Hadrat 'Ali b. Abu Talib bahawa Nabi (ﷺ) berdiri terlebih dahulu (untuk jenazah) dan kemudian duduk."
  },
  {
    "id": 9391,
    "hadith_number": 2114,
    "tajuk_hadith": "Nabi ﷺ Berdiri Kemudian Duduk untuk Jenazah",
    "perawi_melayu": "Mas'ud b. al-Hakam al-Ansari memberitahu Nafi' bahawa beliau mendengar Hadrat 'Ali (semoga Allah meredhainya), putera Abu Talib, berkata tentang keranda jenazah:",
    "english_text": "Verily, the Prophet (ﷺ) used to stand first but later on kept sitting; but it is also narrated that Nafi' ibn Jubair saw Waqid b. 'Amr standing for a bier till it was placed down.",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنِ الثَّقَفِيِّ، - قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ، - قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، قَالَ أَخْبَرَنِي وَاقِدُ، بْنُ عَمْرِو بْنِ سَعْدِ بْنِ مُعَاذٍ الأَنْصَارِيُّ أَنَّ نَافِعَ بْنَ جُبَيْرٍ، أَخْبَرَهُ أَنَّ مَسْعُودَ بْنَ الْحَكَمِ الأَنْصَارِيَّ أَخْبَرَهُ أَنَّهُ، سَمِعَ عَلِيَّ بْنَ أَبِي طَالِبٍ، يَقُولُ فِي شَأْنِ الْجَنَائِزِ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ ثُمَّ قَعَدَ ‏.‏ وَإِنَّمَا حَدَّثَ بِذَلِكَ لأَنَّ نَافِعَ بْنَ جُبَيْرٍ رَأَى وَاقِدَ بْنَ عَمْرٍو قَامَ حَتَّى وُضِعَتِ الْجَنَازَةُ ‏.‏",
    "malay_translation": "Sesungguhnya, Nabi (ﷺ) dahulu berdiri tetapi kemudian duduk; tetapi juga diriwayatkan bahawa Nafi' ibn Jubair melihat Waqid b. 'Amr berdiri untuk keranda jenazah sehingga ia diletakkan."
  },
  {
    "id": 9392,
    "hadith_number": 2115,
    "tajuk_hadith": "Hadis Diriwayatkan dengan Sanad yang Sama",
    "perawi_melayu": "",
    "english_text": "This hadith has been narrated by Yahya b. Sa'id with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، بِهَذَا الإِسْنَادِ ‏.‏",
    "malay_translation": "Hadis ini telah diriwayatkan oleh Yahya b. Sa'id dengan sanad yang sama."
  },
  {
    "id": 9393,
    "hadith_number": 2116,
    "tajuk_hadith": "Adab Berdiri dan Duduk Ketika Jenazah (Menurut Nabi)",
    "perawi_melayu": "Diriwayatkan daripada Muhammad bin Munkadir bahawa beliau berkata:",
    "english_text": "I heard from Mas'ud b. al-Hakam who narrated it on the authority of Hadrat 'Ali that he said: We saw the Prophet (ﷺ) stood up for a (bier) and we also stood up; he sat down and we too sat down.",
    "arabic_text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ، بْنِ الْمُنْكَدِرِ قَالَ سَمِعْتُ مَسْعُودَ بْنَ الْحَكَمِ، يُحَدِّثُ عَنْ عَلِيٍّ، قَالَ رَأَيْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ فَقُمْنَا وَقَعَدَ فَقَعَدْنَا ‏.‏ يَعْنِي فِي الْجَنَازَةِ ‏.‏",
    "malay_translation": "Saya mendengar daripada Mas'ud bin al-Hakam yang meriwayatkan daripada Hadrat Ali r.a., bahawa beliau berkata: Kami melihat Rasulullah ﷺ berdiri (untuk jenazah), lalu kami pun berdiri; baginda duduk, lalu kami pun duduk."
  },
  {
    "id": 9394,
    "hadith_number": 2117,
    "tajuk_hadith": "Hadis Diriwayatkan oleh Shu'ba dengan Sanad yang Sama",
    "perawi_melayu": "",
    "english_text": "This hadith has been narrated by Shu'ba with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا يَحْيَى، - وَهُوَ الْقَطَّانُ - عَنْ شُعْبَةَ، بِهَذَا الإِسْنَادِ ‏.‏",
    "malay_translation": "Hadis ini telah diriwayatkan oleh Shu'ba dengan sanad perawi yang sama."
  },
  {
    "id": 9395,
    "hadith_number": 2118,
    "tajuk_hadith": "Doa untuk Jenazah",
    "perawi_melayu": "Jubair b. Nufair berkata:",
    "english_text": "I heard it from 'Auf b. Malik that the Prophet (ﷺ) said prayer on the dead body, and I remembered his prayer:\" O Allah! forgive him, have mercy upon him, give him peace and absolve him. Receive him with honour and make his grave spacious; wash him with water, snow and hail. Cleanse him from faults as Thou wouldst cleanse a white garment from impurity. Requite him with an abode more excellent than his abode, with a family better than his family, and with a mate better than his mate. Admit him to the Garden, and protect him from the torment of the grave and the torment of the Fire.\" ('Auf bin Malik) said: I earnestly desired that I were this dead body.",
    "arabic_text": "وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مُعَاوِيَةُ بْنُ صَالِحٍ، عَنْ حَبِيبِ بْنِ عُبَيْدٍ، عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، سَمِعَهُ يَقُولُ سَمِعْتُ عَوْفَ بْنَ مَالِكٍ، يَقُولُ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى جَنَازَةٍ فَحَفِظْتُ مِنْ دُعَائِهِ وَهُوَ يَقُولُ ‏\n\"‏ اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ وَعَافِهِ وَاعْفُ عَنْهُ وَأَكْرِمْ نُزُلَهُ وَوَسِّعْ مُدْخَلَهُ وَاغْسِلْهُ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ وَنَقِّهِ مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ وَأَبْدِلْهُ دَارًا خَيْرًا مِنْ دَارِهِ وَأَهْلاً خَيْرًا مِنْ أَهْلِهِ وَزَوْجًا خَيْرًا مِنْ زَوْجِهِ وَأَدْخِلْهُ الْجَنَّةَ وَأَعِذْهُ مِنْ عَذَابِ الْقَبْرِ أَوْ مِنْ عَذَابِ النَّارِ ‏\"‏ ‏.‏ قَالَ حَتَّى تَمَنَّيْتُ أَنْ أَكُونَ أَنَا ذَلِكَ الْمَيِّتَ ‏.‏ قَالَ وَحَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ جُبَيْرٍ حَدَّثَهُ عَنْ أَبِيهِ عَنْ عَوْفِ بْنِ مَالِكٍ عَنِ النَّبِيِّ صلى الله عليه وسلم بِنَحْوِ هَذَا الْحَدِيثِ أَيْضًا ‏.‏",
    "malay_translation": "Saya mendengarnya daripada 'Auf b. Malik bahawa Nabi (ﷺ) melakukan solat jenazah, dan saya mengingati doanya: \"Ya Allah! ampunilah dia, rahmatilah dia, berilah dia keamanan dan maafkanlah dia. Terimalah dia dengan penghormatan dan lapangkanlah kuburnya; basuhlah dia dengan air, salji dan hujan batu. Bersihkanlah dia daripada kesalahan-kesalahan sebagaimana Engkau membersihkan pakaian putih daripada kekotoran. Gantilah dia dengan tempat tinggal yang lebih baik daripada tempat tinggalnya, dengan keluarga yang lebih baik daripada keluarganya, dan dengan pasangan yang lebih baik daripada pasangannya. Masukkanlah dia ke dalam Syurga, dan lindungilah dia daripada azab kubur dan azab Neraka.\" ('Auf bin Malik) berkata: Saya sangat berharap agar saya menjadi jenazah itu."
  },
  {
    "id": 9396,
    "hadith_number": 2119,
    "tajuk_hadith": "Penyampaian Hadis Melalui Sanad Lain",
    "perawi_melayu": "",
    "english_text": "A hadith like this has been narrated through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا مُعَاوِيَةُ بْنُ، صَالِحٍ بِالإِسْنَادَيْنِ جَمِيعًا ‏.‏ نَحْوَ حَدِيثِ ابْنِ وَهْبٍ ‏.‏",
    "malay_translation": "Hadis seperti ini telah diriwayatkan melalui sanad periwayatan yang lain."
  },
  {
    "id": 9397,
    "hadith_number": 2120,
    "tajuk_hadith": "Doa untuk Jenazah",
    "perawi_melayu": "Auf b. Malik berkata:",
    "english_text": "I heard the Prophet (ﷺ) say (while offering prayer on a dead body): O Allah! forgive him, have mercy upon him. Give him peace and absolve him. Receive him with honour and make his grave spacious. Wash him with water, snow and hail, cleanse him from faults as is cleaned a white garment from impurity. Requite him with an abode more excellent than his abode, with a family better than his family, and with a mate better than his mate, and save him from the trial of the grave and torment of Hell. 'Auf b. Malik said: I earnestly desired that I were the dead person to receive the prayer of the Messenger of Allah (ﷺ) as this dead body had (received).",
    "arabic_text": "وَحَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، كِلاَهُمَا عَنْ عِيسَى بْنِ، يُونُسَ عَنْ أَبِي حَمْزَةَ الْحِمْصِيِّ، ح وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَهَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، - وَاللَّفْظُ لأَبِي الطَّاهِرِ - قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ أَبِي حَمْزَةَ بْنِ سُلَيْمٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِيهِ، عَنْ عَوْفِ بْنِ مَالِكٍ الأَشْجَعِيِّ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم وَصَلَّى عَلَى جَنَازَةٍ يَقُولُ ‏\n\"‏ اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ وَاعْفُ عَنْهُ وَعَافِهِ وَأَكْرِمْ نُزُلَهُ وَوَسِّعْ مُدْخَلَهُ وَاغْسِلْهُ بِمَاءٍ وَثَلْجٍ وَبَرَدٍ وَنَقِّهِ مِنَ الْخَطَايَا كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ وَأَبْدِلْهُ دَارًا خَيْرًا مِنْ دَارِهِ وَأَهْلاً خَيْرًا مِنْ أَهْلِهِ وَزَوْجًا خَيْرًا مِنْ زَوْجِهِ وَقِهِ فِتْنَةَ الْقَبْرِ وَعَذَابَ النَّارِ ‏\"‏ ‏.‏ قَالَ عَوْفٌ فَتَمَنَّيْتُ أَنْ لَوْ كُنْتُ أَنَا الْمَيِّتَ لِدُعَاءِ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى ذَلِكَ الْمَيِّتِ ‏.‏",
    "malay_translation": "Saya mendengar Nabi (ﷺ) bersabda (ketika melakukan solat jenazah): Ya Allah! ampunilah dia, kasihanilah dia. Berikanlah dia kedamaian dan maafkanlah dia. Terimalah dia dengan kehormatan dan lapangkanlah kuburnya. Basuhlah dia dengan air, salji dan hujan batu, bersihkanlah dia dari kesalahan sebagaimana pakaian putih dibersihkan dari kotoran. Gantilah dia dengan tempat tinggal yang lebih baik daripada tempat tinggalnya, dengan keluarga yang lebih baik daripada keluarganya, dan dengan pasangan yang lebih baik daripada pasangannya, dan selamatkanlah dia dari fitnah kubur dan azab neraka. Auf b. Malik berkata: Saya sangat berharap agar sayalah orang mati itu untuk menerima doa Rasulullah (ﷺ) sebagaimana jenazah ini telah menerimanya."
  },
  {
    "id": 9398,
    "hadith_number": 2121,
    "tajuk_hadith": "Solat Jenazah untuk Wanita Nifas",
    "perawi_melayu": "Samura b. Jundub berkata:",
    "english_text": "I prayed behind the Messenger of Allah (ﷺ) and he prayed for a woman who had died in the state of delivery. He stood in front of her waist.",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، أَخْبَرَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، عَنْ حُسَيْنِ بْنِ، ذَكْوَانَ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، عَنْ سَمُرَةَ بْنِ جُنْدَبٍ، قَالَ صَلَّيْتُ خَلْفَ النَّبِيِّ صلى الله عليه وسلم وَصَلَّى عَلَى أُمِّ كَعْبٍ مَاتَتْ وَهِيَ نُفَسَاءُ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِلصَّلاَةِ عَلَيْهَا وَسَطَهَا ‏.‏",
    "malay_translation": "Saya solat di belakang Rasulullah (ﷺ) dan baginda solat untuk seorang wanita yang meninggal dunia dalam keadaan nifas. Baginda berdiri di hadapan pinggangnya."
  },
  {
    "id": 9399,
    "hadith_number": 2122,
    "tajuk_hadith": "Hadis dari Husain dengan Sanad Sama Tanpa Sebutan Umm Ka'b",
    "perawi_melayu": "",
    "english_text": "This hadith has been narrated by Husain with the same chain of transmitters, but no mention is made of Umm Ka'b.",
    "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، وَيَزِيدُ بْنُ هَارُونَ، ح وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا ابْنُ الْمُبَارَكِ، وَالْفَضْلُ بْنُ مُوسَى، كُلُّهُمْ عَنْ حُسَيْنٍ، بِهَذَا الإِسْنَادِ وَلَمْ يَذْكُرُوا أُمَّ كَعْبٍ ‏.‏",
    "malay_translation": "Hadis ini telah diriwayatkan oleh Husain dengan sanad periwayatan yang sama, tetapi tidak menyebut tentang Umm Ka'b."
  },
  {
    "id": 9400,
    "hadith_number": 2123,
    "tajuk_hadith": "Solat Jenazah untuk Wanita yang Meninggal Dunia Semasa Bersalin dan Kedudukan Imam",
    "perawi_melayu": "Samura b. Jundub berkata:",
    "english_text": "I was a young boy during the time of the Prophet (ﷺ) and I retained in my mind (what I learnt from him), and nothing restrained me from speaking except the fact that there were persons far more advanced in age than I. Verily, I said prayer behind the Messenger of Allah (ﷺ) over a woman who had died in the state of delivery, and the Messenger of Allah (ﷺ) stood up to say prayer in front of the middle part of her body. And in the tradition narrated on the authority of Ibn Muthanna the words are:\" (The Holy Prophet) stood in the middle part of her body for offering prayer for her.\"",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَعُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ، قَالاَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ حُسَيْنٍ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، قَالَ قَالَ سَمُرَةُ بْنُ جُنْدُبٍ لَقَدْ كُنْتُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم غُلاَمًا فَكُنْتُ أَحْفَظُ عَنْهُ فَمَا يَمْنَعُنِي مِنَ الْقَوْلِ إِلاَّ أَنَّ هَا هُنَا رِجَالاً هُمْ أَسَنُّ مِنِّي وَقَدْ صَلَّيْتُ وَرَاءَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى امْرَأَةٍ مَاتَتْ فِي نِفَاسِهَا فَقَامَ عَلَيْهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الصَّلاَةِ وَسَطَهَا ‏.‏ وَفِي رِوَايَةِ ابْنِ الْمُثَنَّى قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ قَالَ فَقَامَ عَلَيْهَا لِلصَّلاَةِ وَسَطَهَا ‏.‏",
    "malay_translation": "Saya seorang kanak-kanak lelaki pada zaman Nabi (ﷺ) dan saya mengingati (apa yang saya pelajari daripada baginda), dan tidak ada yang menghalang saya daripada bercakap kecuali hakikat bahawa terdapat orang yang jauh lebih tua daripada saya. Sesungguhnya, saya menunaikan solat di belakang Rasulullah (ﷺ) ke atas seorang wanita yang meninggal dunia dalam keadaan nifas, dan Rasulullah (ﷺ) berdiri untuk menunaikan solat di hadapan bahagian tengah badannya. Dan dalam riwayat yang diriwayatkan daripada Ibn Muthanna, perkataannya adalah: \"(Nabi Suci) berdiri di bahagian tengah badannya untuk menunaikan solat jenazah untuknya.\""
  },
  {
    "id": 9401,
    "hadith_number": 2124,
    "tajuk_hadith": "Nabi ﷺ Menunggang Kuda Tanpa Pelana Selepas Solat Jenazah Ibn Dahdah",
    "perawi_melayu": "",
    "english_text": "It is reported on the authority of Jabir ibn Samura that an unsaddled horse was brought to the Prophet (ﷺ) and he rode on it when he returned after having offered the funeral prayer of Ibn Dahdah and we walked on foot around him.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ - وَاللَّفْظُ لِيَحْيَى - قَالَ أَبُو بَكْرٍ حَدَّثَنَا وَقَالَ، يَحْيَى أَخْبَرَنَا وَكِيعٌ، عَنْ مَالِكِ بْنِ مِغْوَلٍ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ جَابِرِ بْنِ، سَمُرَةَ قَالَ أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِفَرَسٍ مُعْرَوْرًى فَرَكِبَهُ حِينَ انْصَرَفَ مِنْ جَنَازَةِ ابْنِ الدَّحْدَاحِ وَنَحْنُ نَمْشِي حَوْلَهُ ‏.‏",
    "malay_translation": "Diriwayatkan dari Jabir ibn Samura bahawa seekor kuda tanpa pelana dibawa kepada Nabi ﷺ dan baginda menungganginya ketika pulang selepas menunaikan solat jenazah Ibn Dahdah dan kami berjalan kaki di sekeliling baginda."
  },
  {
    "id": 9402,
    "hadith_number": 2125,
    "tajuk_hadith": "Keutamaan Ibn Dahdah di Syurga",
    "perawi_melayu": "Jabir ibn Samura meriwayatkan bahawa Nabi (ﷺ) melakukan solat (jenazah) ke atas Ibn Dahdah:",
    "english_text": "then an unsaddled horse was brought to him and a person hobbled it, and he (the Messenger of Allah) rode upon it and it bounded and we followed it and ran after it. One of the people said that the Prophet (ﷺ) remarked: How many among hanging bunches in the Paradise are meant for Ibn Dahdah?",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى ابْنِ الدَّحْدَاحِ ثُمَّ أُتِيَ بِفَرَسٍ عُرْىٍ فَعَقَلَهُ رَجُلٌ فَرَكِبَهُ فَجَعَلَ يَتَوَقَّصُ بِهِ وَنَحْنُ نَتَّبِعُهُ نَسْعَى خَلْفَهُ - قَالَ - فَقَالَ رَجُلٌ مِنَ الْقَوْمِ إِنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ كَمْ مِنْ عِذْقٍ مُعَلَّقٍ - أَوْ مُدَلًّى - فِي الْجَنَّةِ لاِبْنِ الدَّحْدَاحِ ‏\"‏ ‏.‏ أَوْ قَالَ شُعْبَةُ ‏\"‏ لأَبِي الدَّحْدَاحِ ‏\"‏ ‏.‏",
    "malay_translation": "Kemudian seekor kuda tanpa pelana dibawa kepada baginda dan seseorang mengikat kakinya, dan baginda (Rasulullah SAW) menungganginya dan ia melonjak dan kami mengikutinya dan berlari di belakangnya. Salah seorang dari orang ramai berkata bahawa Nabi (ﷺ) bersabda: \"Berapa banyak tandan buah-buahan yang tergantung - atau terjuntai - di dalam Syurga adalah untuk Ibn Dahdah?\" atau Shu'bah berkata, \"Untuk Abu Dahdah.\""
  },
  {
    "id": 9403,
    "hadith_number": 2126,
    "tajuk_hadith": "Pesanan Saad bin Abi Waqqas Mengenai Liang Lahad dan Batu Bata di Kuburnya",
    "perawi_melayu": "'Amir bin Sa'd bin Abu Waqqas menceritakan bahawa Sa'd bin Abu Waqqas berkata semasa sakitnya yang membawa kepada kematiannya:",
    "english_text": "\" Make a niche for me in the side of the grave and set up bricks over me as was done in case of Allah's Messenger (ﷺ).",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الْمِسْوَرِيُّ، عَنْ إِسْمَاعِيلَ بْنِ، مُحَمَّدِ بْنِ سَعْدٍ عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، أَنَّ سَعْدَ بْنَ أَبِي وَقَّاصٍ، قَالَ فِي مَرَضِهِ الَّذِي هَلَكَ فِيهِ الْحَدُوا لِي لَحْدًا وَانْصِبُوا عَلَىَّ اللَّبِنَ نَصْبًا كَمَا صُنِعَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "\"Buatkan liang lahad untukku di sisi kubur dan dirikan batu bata di atasku seperti yang dilakukan kepada Rasulullah (ﷺ)."
  },
  {
    "id": 9404,
    "hadith_number": 2127,
    "tajuk_hadith": "Kain Merah di Kubur Rasulullah (ﷺ)",
    "perawi_melayu": "Ibn 'Abbas",
    "english_text": "Ibn 'Abbas said that a piece of red stuff was put in the grave of Allah's Messenger (ﷺ).",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا وَكِيعٌ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا غُنْدَرٌ، وَوَكِيعٌ، جَمِيعًا عَنْ شُعْبَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، - وَاللَّفْظُ لَهُ - قَالَ حَدَّثَنَا يَحْيَى، بْنُ سَعِيدٍ حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا أَبُو جَمْرَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ جُعِلَ فِي قَبْرِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَطِيفَةٌ حَمْرَاءُ ‏.‏ قَالَ مُسْلِمٌ أَبُو جَمْرَةَ اسْمُهُ نَصْرُ بْنُ عِمْرَانَ وَأَبُو التَّيَّاحِ اسْمُهُ يَزِيدُ بْنُ حُمَيْدٍ مَاتَا بِسَرَخْسَ ‏.‏",
    "malay_translation": "Ibn 'Abbas meriwayatkan bahawa sekeping benda berwarna merah telah diletakkan di dalam kubur Rasulullah (ﷺ)."
  },
  {
    "id": 9405,
    "hadith_number": 2128,
    "tajuk_hadith": "Perintah Meratakan Kubur",
    "perawi_melayu": "Thumama bin Shafayy meriwayatkan:",
    "english_text": "When we were with Fadala b. 'Ubaid in the country of the Romans at a place (known as) Rudis, a friend of ours died. Fadala b. 'Ubaid ordered to prepare a grave for him and then it was levelled; and then he said: I heard the Messenger of Allah (ﷺ) commanding (us) to level the grave.",
    "arabic_text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرٍو حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، ح وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنِي عَمْرُو بْنُ الْحَارِثِ، - فِي رِوَايَةِ أَبِي الطَّاهِرِ - أَنَّ أَبَا عَلِيٍّ الْهَمْدَانِيَّ، حَدَّثَهُ - وَفِي، رِوَايَةِ هَارُونَ - أَنَّ ثُمَامَةَ بْنَ، شُفَىٍّ حَدَّثَهُ قَالَ كُنَّا مَعَ فَضَالَةَ بْنِ عُبَيْدٍ بِأَرْضِ الرُّومِ بِرُودِسَ فَتُوُفِّيَ صَاحِبٌ لَنَا فَأَمَرَ فَضَالَةُ بْنُ عُبَيْدٍ بِقَبْرِهِ فَسُوِّيَ ثُمَّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْمُرُ بِتَسْوِيَتِهَا ‏.‏",
    "malay_translation": "Ketika kami bersama Fadala bin 'Ubaid di negeri Rom di suatu tempat (yang dikenali sebagai) Rudis, seorang sahabat kami meninggal dunia. Fadala bin 'Ubaid memerintahkan untuk menyediakan kubur untuknya dan kemudian ia diratakan; dan kemudian dia berkata: Saya mendengar Rasulullah (ﷺ) memerintahkan (kami) untuk meratakan kubur."
  },
  {
    "id": 9406,
    "hadith_number": 2129,
    "tajuk_hadith": "Arahan untuk Meratakan Kubur dan Menghapuskan Gambar",
    "perawi_melayu": "Abu'l-Hayyaj al-Asadi menceritakan bahawa 'Ali (b. Abu Talib) berkata kepadanya:",
    "english_text": "Should I not send you on the same mission as Allah's Messenger (ﷺ) sent me? Do not leave an image without obliterating it, or a high grave without levelling It. This hadith has been reported by Habib with the same chain of transmitters and he said: (Do not leave) a picture without obliterating it.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي، الْهَيَّاجِ الأَسَدِيِّ قَالَ قَالَ لِي عَلِيُّ بْنُ أَبِي طَالِبٍ أَلاَّ أَبْعَثُكَ عَلَى مَا بَعَثَنِي عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ لاَ تَدَعَ تِمْثَالاً إِلاَّ طَمَسْتَهُ وَلاَ قَبْرًا مُشْرِفًا إِلاَّ سَوَّيْتَهُ ‏.‏\n وَحَدَّثَنِيهِ أَبُو بَكْرِ بْنُ خَلاَّدٍ الْبَاهِلِيُّ، حَدَّثَنَا يَحْيَى، - وَهُوَ الْقَطَّانُ - حَدَّثَنَا سُفْيَانُ، حَدَّثَنِي حَبِيبٌ، بِهَذَا الإِسْنَادِ وَقَالَ وَلاَ صُورَةً إِلاَّ طَمَسْتَهَا ‏.‏",
    "malay_translation": "Tidakkah patut aku mengutus engkau dalam misi yang sama seperti Rasulullah (ﷺ) mengutus aku? Jangan biarkan satu imej pun tanpa memadamkannya, atau kubur yang tinggi tanpa meratakannya. Hadis ini diriwayatkan oleh Habib dengan sanad yang sama dan beliau berkata: (Jangan biarkan) satu gambar pun tanpa memadamkannya."
  },
  {
    "id": 9407,
    "hadith_number": 2130,
    "tajuk_hadith": "Larangan Terhadap Kubur",
    "perawi_melayu": "Jabir berkata:",
    "english_text": "Allah's Messenger (ﷺ) forbade that the graves should be plastered or they be used as sitting places (for the people), or a building should be built over them.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي، الزُّبَيْرِ عَنْ جَابِرٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُجَصَّصَ الْقَبْرُ وَأَنْ يُقْعَدَ عَلَيْهِ وَأَنْ يُبْنَى عَلَيْهِ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) melarang agar kubur-kubur disimen atau digunakan sebagai tempat duduk (bagi orang ramai), atau bangunan dibina di atasnya."
  },
  {
    "id": 9408,
    "hadith_number": 2131,
    "tajuk_hadith": "Riwayat daripada Jabir b. 'Abdullah",
    "perawi_melayu": "",
    "english_text": "A hadith like this has been transmitted on the authority of Jabir b. 'Abdullah.",
    "arabic_text": "وَحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، جَمِيعًا عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ، اللَّهِ يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
    "malay_translation": "Hadis seperti ini telah diriwayatkan daripada Jabir b. 'Abdullah."
  },
  {
    "id": 9409,
    "hadith_number": 2132,
    "tajuk_hadith": "Larangan Menurap Kubur",
    "perawi_melayu": "",
    "english_text": "Jabir said that he was forbidden to plaster graves.",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ أَيُّوبَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ نُهِيَ عَنْ تَقْصِيصِ الْقُبُورِ، ‏.‏",
    "malay_translation": "Jabir berkata bahawa beliau dilarang daripada menurap kubur."
  },
  {
    "id": 9410,
    "hadith_number": 2133,
    "tajuk_hadith": "Larangan Duduk di Atas Kubur",
    "perawi_melayu": "Abu Huraira meriwayatkan bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "It is better that one of you should sit on live coals which would burn his clothing and come in contact with his skin than that he should sit on a grave.",
    "arabic_text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لأَنْ يَجْلِسَ أَحَدُكُمْ عَلَى جَمْرَةٍ فَتُحْرِقَ ثِيَابَهُ فَتَخْلُصَ إِلَى جِلْدِهِ خَيْرٌ لَهُ مِنْ أَنْ يَجْلِسَ عَلَى قَبْرٍ ‏\"‏ ‏.‏",
    "malay_translation": "Adalah lebih baik bagi seseorang kamu untuk duduk di atas bara api yang akan membakar pakaiannya dan mengenai kulitnya daripada dia duduk di atas kubur."
  },
  {
    "id": 9411,
    "hadith_number": 2134,
    "tajuk_hadith": "Hadis daripada Suhail dengan Sanad yang Sama",
    "perawi_melayu": "",
    "english_text": "A hadith like this has been narrated by Suhail with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي الدَّرَاوَرْدِيَّ ح وَحَدَّثَنِيهِ عَمْرٌو، النَّاقِدُ حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا سُفْيَانُ، كِلاَهُمَا عَنْ سُهَيْلٍ، بِهَذَا الإِسْنَادِ ‏.‏ نَحْوَهُ.‏",
    "malay_translation": "Hadis seperti ini telah diriwayatkan oleh Suhail dengan sanad periwayatan yang sama."
  },
  {
    "id": 9412,
    "hadith_number": 2135,
    "tajuk_hadith": "Larangan Duduk di Atas Kubur dan Solat Menghadapnya",
    "perawi_melayu": "Abu Marthad al-Ghanawi meriwayatkan bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "Do not sit on the graves and do not pray facing towards them.",
    "arabic_text": "وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنِ ابْنِ جَابِرٍ، عَنْ بُسْرِ، بْنِ عُبَيْدِ اللَّهِ عَنْ وَاثِلَةَ، عَنْ أَبِي مَرْثَدٍ الْغَنَوِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَجْلِسُوا عَلَى الْقُبُورِ وَلاَ تُصَلُّوا إِلَيْهَا ‏\"‏ ‏.‏",
    "malay_translation": "Jangan duduk di atas kubur dan jangan solat menghadap ke arahnya."
  },
  {
    "id": 9413,
    "hadith_number": 2136,
    "tajuk_hadith": "Larangan Menghadap Kubur dan Duduk di Atasnya",
    "perawi_melayu": "Abu Marthad al-Ghanawi meriwayatkan bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "Do not pray facing towards the graves, and do not sit on them.",
    "arabic_text": "وَحَدَّثَنَا حَسَنُ بْنُ الرَّبِيعِ الْبَجَلِيُّ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ بُسْرِ بْنِ عُبَيْدِ اللَّهِ، عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ، عَنْ وَاثِلَةَ بْنِ الأَسْقَعِ، عَنْ أَبِي مَرْثَدٍ الْغَنَوِيِّ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ تُصَلُّوا إِلَى الْقُبُورِ وَلاَ تَجْلِسُوا عَلَيْهَا‏\"‏ ‏.‏",
    "malay_translation": "Janganlah kamu solat menghadap kubur, dan janganlah kamu duduk di atasnya."
  },
  {
    "id": 9414,
    "hadith_number": 2137,
    "tajuk_hadith": "Kelebihan Solat Jenazah di Masjid",
    "perawi_melayu": "'Abbad b. 'Abdullah b. Zubair meriwayatkan bahawa 'A'isha memerintahkan agar keranda Sa'd b. Abu Waqqas dibawa ke masjid supaya beliau dapat menyolatkannya. Orang ramai tidak menyetujui tindakan beliau ini. Lalu beliau berkata:",
    "english_text": "How soon the people have forgotten that the Messenger of Allah (ﷺ) offered not the funeral prayer of Suhail b al-Baida' but in a mosque.",
    "arabic_text": "وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، - وَاللَّفْظُ لإِسْحَاقَ - قَالَ عَلِيٌّ حَدَّثَنَا وَقَالَ، إِسْحَاقُ أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ عَبْدِ الْوَاحِدِ بْنِ حَمْزَةَ، عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، أَنَّ عَائِشَةَ، أَمَرَتْ أَنْ يُمَرَّ، بِجَنَازَةِ سَعْدِ بْنِ أَبِي وَقَّاصٍ فِي الْمَسْجِدِ فَتُصَلِّيَ عَلَيْهِ فَأَنْكَرَ النَّاسُ ذَلِكَ عَلَيْهَا فَقَالَتْ مَا أَسْرَعَ مَا نَسِيَ النَّاسُ مَا صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى سُهَيْلِ ابْنِ الْبَيْضَاءِ إِلاَّ فِي الْمَسْجِدِ ‏.‏",
    "malay_translation": "Betapa cepatnya orang ramai melupakan bahawa Rasulullah (ﷺ) tidak melakukan solat jenazah Suhail b al-Baida' melainkan di masjid."
  },
  {
    "id": 9415,
    "hadith_number": 2138,
    "tajuk_hadith": "Kecaman Terhadap Perkara Yang Tidak Diketahui",
    "perawi_melayu": "'Abbad bin 'Abdullah bin Zubair meriwayatkan daripada 'A'isha",
    "english_text": "How hastily the people criticise that about which they know little. They criticise us for carrying the bier in the mosque. The Messenger of Allah (ﷺ) offered not the funeral prayer of Suhail b. Baida' but in the innermost part of the mosque.",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ عَبْدِ الْوَاحِدِ، عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، يُحَدِّثُ عَنْ عَائِشَةَ، أَنَّهَا لَمَّا تُوُفِّيَ سَعْدُ بْنُ أَبِي وَقَّاصٍ أَرْسَلَ أَزْوَاجُ النَّبِيِّ صلى الله عليه وسلم أَنْ يَمُرُّوا بِجَنَازَتِهِ فِي الْمَسْجِدِ فَيُصَلِّينَ عَلَيْهِ فَفَعَلُوا فَوُقِفَ بِهِ عَلَى حُجَرِهِنَّ يُصَلِّينَ عَلَيْهِ أُخْرِجَ بِهِ مِنْ بَابِ الْجَنَائِزِ الَّذِي كَانَ إِلَى الْمَقَاعِدِ فَبَلَغَهُنَّ أَنَّ النَّاسَ عَابُوا ذَلِكَ وَقَالُوا مَا كَانَتِ الْجَنَائِزُ يُدْخَلُ بِهَا الْمَسْجِدَ ‏.‏ فَبَلَغَ ذَلِكَ عَائِشَةَ فَقَالَتْ مَا أَسْرَعَ النَّاسَ إِلَى أَنْ يَعِيبُوا مَا لاَ عِلْمَ لَهُمْ بِهِ ‏.‏ عَابُوا عَلَيْنَا أَنْ يُمَرَّ بِجَنَازَةٍ فِي الْمَسْجِدِ وَمَا صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى سُهَيْلِ ابْنِ بَيْضَاءَ إِلاَّ فِي جَوْفِ الْمَسْجِدِ ‏.‏",
    "malay_translation": "Betapa tergesa-gesanya orang ramai mengkritik perkara yang mereka tidak tahu. Mereka mengkritik kami kerana membawa keranda ke dalam masjid. Rasulullah (ﷺ) tidak melakukan solat jenazah Suhail bin Baida' kecuali di bahagian paling dalam masjid."
  },
  {
    "id": 9416,
    "hadith_number": 2139,
    "tajuk_hadith": "Aisyah Meminta Jenazah Saad Dibawa ke Masjid untuk Disolatkan dan Berdalil dengan Solat Rasulullah ke atas Anak Baida'",
    "perawi_melayu": "Abu Salama b. 'Abd al-Rahman meriwayatkan daripada 'A'isha bahawa ketika Sa'd b. Abu Waqqas meninggal dunia, beliau berkata:",
    "english_text": "Bring it (the bier) into the mosque so that I offer prayer for him. But, this act of hers was disapproved. She said: By Allah, the Messenger of Allah (ﷺ) offered prayer in the mosque for the two sons of Baida', viz, for Suhail and his brother.",
    "arabic_text": "وَحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، وَمُحَمَّدُ بْنُ رَافِعٍ، - وَاللَّفْظُ لاِبْنِ رَافِعٍ - قَالاَ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنَا الضَّحَّاكُ، - يَعْنِي ابْنَ عُثْمَانَ - عَنْ أَبِي النَّضْرِ، عَنْ أَبِي سَلَمَةَ بْنِ، عَبْدِ الرَّحْمَنِ أَنَّ عَائِشَةَ، لَمَّا تُوُفِّيَ سَعْدُ بْنُ أَبِي وَقَّاصٍ قَالَتِ ادْخُلُوا بِهِ الْمَسْجِدَ حَتَّى أُصَلِّيَ عَلَيْهِ ‏.‏ فَأُنْكِرَ ذَلِكَ عَلَيْهَا فَقَالَتْ وَاللَّهِ لَقَدْ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى ابْنَىْ بَيْضَاءَ فِي الْمَسْجِدِ سُهَيْلٍ وَأَخِيهِ ‏.‏ قَالَ مُسْلِمٌ سُهَيْلُ بْنُ دَعْدٍ وَهُوَ ابْنُ الْبَيْضَاءِ أُمُّهُ بَيْضَاءُ ‏.‏",
    "malay_translation": "Bawalah (keranda itu) ke dalam masjid supaya aku dapat menyembahyangkannya. Tetapi, tindakan beliau ini tidak disetujui. Beliau berkata: Demi Allah, Rasulullah (ﷺ) telah menyembahyangkan dua orang putera Baida', iaitu Suhail dan saudaranya di dalam masjid."
  },
  {
    "id": 9417,
    "hadith_number": 2140,
    "tajuk_hadith": "Ziarah Rasulullah SAW ke Baqi' dan Doa untuk Penduduknya",
    "perawi_melayu": "'A'isha meriwayatkan (bahawa setiap kali tiba giliran malamnya daripada Rasulullah SAW) baginda akan keluar pada akhir malam ke Baqi' dan bersabda:",
    "english_text": "Peace be upon you, abode of a people who are believers. What you were promised would come to you tomorrow, you receiving it after some delay; and God willing we shall join you. O Allah, grant forgiveness to the inhabitants of Baqi' al-Gharqad. Qutaiba did not mention his words:\" would come to you\".",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ شَرِيكٍ، - وَهُوَ ابْنُ أَبِي نَمِرٍ - عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم - كُلَّمَا كَانَ لَيْلَتُهَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم - يَخْرُجُ مِنْ آخِرِ اللَّيْلِ إِلَى الْبَقِيعِ فَيَقُولُ ‏\"‏ السَّلاَمُ عَلَيْكُمْ دَارَ قَوْمٍ مُؤْمِنِينَ وَأَتَاكُمْ مَا تُوعَدُونَ غَدًا مُؤَجَّلُونَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لاَحِقُونَ اللَّهُمَّ اغْفِرْ لأَهْلِ بَقِيعِ الْغَرْقَدِ ‏\"‏ ‏.‏ وَلَمْ يُقِمْ قُتَيْبَةُ قَوْلَهُ ‏\"‏ وَأَتَاكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Salam sejahtera ke atas kamu, wahai tempat kediaman kaum yang beriman. Apa yang telah dijanjikan kepada kamu akan datang kepada kamu esok, kamu menerimanya setelah sedikit penangguhan; dan insya-Allah kami akan menyertai kamu. Ya Allah, ampunilah penduduk Baqi' al-Gharqad. Qutaiba tidak menyebutkan kata-katanya: \"akan datang kepada kamu\"."
  },
  {
    "id": 9418,
    "hadith_number": 2141,
    "tajuk_hadith": "Lawatan Rasulullah ke Baqi' dan Peristiwa dengan Aisyah",
    "perawi_melayu": "Muhammad bin Qais berkata (kepada orang ramai):",
    "english_text": "Should I not narrate to you (a hadith of the Holy Prophet) on my authority and on the authority of my mother? We thought that he meant the mother who had given him birth. He (Muhammad b. Qais) then reported that it was 'A'isha who had narrated this: Should I not narrate to you about myself and about the Messenger of Allah (ﷺ)? We said: Yes. She said: When it was my turn for Allah's Messenger (ﷺ) to spend the night with me, he turned his side, put on his mantle and took off his shoes and placed them near his feet, and spread the corner of his shawl on his bed and then lay down till he thought that I had gone to sleep. He took hold of his mantle slowly and put on the shoes slowly, and opened the door and went out and then closed it lightly. I covered my head, put on my veil and tightened my waist wrapper, and then went out following his steps till he reached Baqi'. He stood there and he stood for a long time. He then lifted his hands three times, and then returned and I also returned. He hastened his steps and I also hastened my steps. He ran and I too ran. He came (to the house) and I also came (to the house). I, however, preceded him and I entered (the house), and as I lay down in the bed, he (the Holy Prophet) entered the (house), and said: Why is it, O 'A'isha, that you are out of breath? I said: There is nothing. He said: Tell me or the Subtle and the Aware would inform me. I said: Messenger of Allah, may my father and mother be ransom for you, and then I told him (the whole story). He said: Was it the darkness (of your shadow) that I saw in front of me? I said: Yes. He gave me a nudge on the chest which I felt, and then said: Did you think that Allah and His Apostle would deal unjustly with you? She said: Whatsoever the people conceal, Allah will know it. He said: Gabriel came to me when you saw me. He called me and he concealed it from you. I responded to his call, but I too concealed it from you (for he did not come to you), as you were not fully dressed. I thought that you had gone to sleep, and I did not like to awaken you, fearing that you may be frightened. He (Gabriel) said: Your Lord has commanded you to go to the inhabitants of Baqi' (to those lying in the graves) and beg pardon for them. I said: Messenger of Allah, how should I pray for them (How should I beg forgiveness for them)? He said: Say, Peace be upon the inhabitants of this city (graveyard) from among the Believers and the Muslims, and may Allah have mercy on those who have gone ahead of us, and those who come later on, and we shall, God willing, join you.",
    "arabic_text": "وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، عَنْ عَبْدِ اللَّهِ بْنِ كَثِيرِ بْنِ الْمُطَّلِبِ، أَنَّهُ سَمِعَ مُحَمَّدَ بْنَ قَيْسٍ، يَقُولُ سَمِعْتُ عَائِشَةَ، تُحَدِّثُ فَقَالَتْ أَلاَ أُحَدِّثُكُمْ عَنِ النَّبِيِّ صلى الله عليه وسلم وَعَنِّي ‏.‏ قُلْنَا بَلَى ح.\n وَحَدَّثَنِي مَنْ، سَمِعَ حَجَّاجًا الأَعْوَرَ، - وَاللَّفْظُ لَهُ - قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَبْدُ اللَّهِ، - رَجُلٌ مِنْ قُرَيْشٍ - عَنْ مُحَمَّدِ بْنِ قَيْسِ بْنِ مَخْرَمَةَ، بْنِ الْمُطَّلِبِ أَنَّهُ قَالَ يَوْمًا أَلاَ أُحَدِّثُكُمْ عَنِّي وَعَنْ أُمِّي قَالَ فَظَنَنَّا أَنَّهُ يُرِيدُ أُمَّهُ الَّتِي وَلَدَتْهُ ‏.‏ قَالَ قَالَتْ عَائِشَةُ أَلاَ أُحَدِّثُكُمْ عَنِّي وَعَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ قُلْنَا بَلَى ‏.‏ قَالَ قَالَتْ لَمَّا كَانَتْ لَيْلَتِيَ الَّتِي كَانَ النَّبِيُّ صلى الله عليه وسلم فِيهَا عِنْدِي انْقَلَبَ فَوَضَعَ رِدَاءَهُ وَخَلَعَ نَعْلَيْهِ فَوَضَعَهُمَا عِنْدَ رِجْلَيْهِ وَبَسَطَ طَرَفَ إِزَارِهِ عَلَى فِرَاشِهِ فَاضْطَجَعَ فَلَمْ يَلْبَثْ إِلاَّ رَيْثَمَا ظَنَّ أَنْ قَدْ رَقَدْتُ فَأَخَذَ رِدَاءَهُ رُوَيْدًا وَانْتَعَلَ رُوَيْدًا وَفَتَحَ الْبَابَ فَخَرَجَ ثُمَّ أَجَافَهُ رُوَيْدًا فَجَعَلْتُ دِرْعِي فِي رَأْسِي وَاخْتَمَرْتُ وَتَقَنَّعْتُ إِزَارِي ثُمَّ انْطَلَقْتُ عَلَى إِثْرِهِ حَتَّى جَاءَ الْبَقِيعَ فَقَامَ فَأَطَالَ الْقِيَامَ ثُمَّ رَفَعَ يَدَيْهِ ثَلاَثَ مَرَّاتٍ ثُمَّ انْحَرَفَ فَانْحَرَفْتُ فَأَسْرَعَ فَأَسْرَعْتُ فَهَرْوَلَ فَهَرْوَلْتُ فَأَحْضَرَ فَأَحْضَرْتُ فَسَبَقْتُهُ فَدَخَلْتُ فَلَيْسَ إِلاَّ أَنِ اضْطَجَعْتُ فَدَخَلَ فَقَالَ ‏\"‏ مَا لَكِ يَا عَائِشُ حَشْيَا رَابِيَةً ‏\"‏ ‏.‏ قَالَتْ قُلْتُ لاَ شَىْءَ ‏.‏ قَالَ ‏\"‏ لَتُخْبِرِينِي أَوْ لَيُخْبِرَنِّي اللَّطِيفُ الْخَبِيرُ ‏\"‏ ‏.‏ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي ‏.‏ فَأَخْبَرْتُهُ قَالَ ‏\"‏ فَأَنْتِ السَّوَادُ الَّذِي رَأَيْتُ أَمَامِي ‏\"‏ ‏.‏ قُلْتُ نَعَمْ ‏.‏ فَلَهَدَنِي فِي صَدْرِي لَهْدَةً أَوْجَعَتْنِي ثُمَّ قَالَ ‏\"‏ أَظَنَنْتِ أَنْ يَحِيفَ اللَّهُ عَلَيْكِ وَرَسُولُهُ ‏\"‏ ‏.‏ قَالَتْ مَهْمَا يَكْتُمِ النَّاسُ يَعْلَمْهُ اللَّهُ نَعَمْ ‏.‏ قَالَ ‏\"‏ فَإِنَّ جِبْرِيلَ أَتَانِي حِينَ رَأَيْتِ فَنَادَانِي فَأَخْفَاهُ مِنْكِ فَأَجَبْتُهُ فَأَخْفَيْتُهُ مِنْكِ وَلَمْ يَكُنْ يَدْخُلُ عَلَيْكِ وَقَدْ وَضَعْتِ ثِيَابَكِ وَظَنَنْتُ أَنْ قَدْ رَقَدْتِ فَكَرِهْتُ أَنْ أُوقِظَكِ وَخَشِيتُ أَنْ تَسْتَوْحِشِي فَقَالَ إِنَّ رَبَّكَ يَأْمُرُكَ أَنْ تَأْتِيَ أَهْلَ الْبَقِيعِ فَتَسْتَغْفِرَ لَهُمْ ‏\"‏ ‏.‏ قَالَتْ قُلْتُ كَيْفَ أَقُولُ لَهُمْ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ قُولِي السَّلاَمُ عَلَى أَهْلِ الدِّيَارِ مِنَ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ وَيَرْحَمُ اللَّهُ الْمُسْتَقْدِمِينَ مِنَّا وَالْمُسْتَأْخِرِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لَلاَحِقُونَ ‏\"‏ ‏.‏",
    "malay_translation": "Patutkah saya tidak menceritakan kepada kamu (sebuah hadis Nabi Suci) atas autoriti saya dan atas autoriti ibu saya? Kami menyangka bahawa dia bermaksudkan ibu yang telah melahirkannya. Kemudian dia (Muhammad bin Qais) melaporkan bahawa 'A'isha yang telah meriwayatkan ini: Patutkah saya tidak menceritakan kepada kamu tentang diri saya dan tentang Rasulullah (ﷺ)? Kami berkata: Ya. Beliau berkata: Apabila tiba giliran saya untuk Rasulullah (ﷺ) bermalam dengan saya, baginda berpaling sisi, memakai jubahnya dan menanggalkan kasutnya lalu meletakkannya di dekat kakinya, dan membentangkan hujung selendangnya di atas katilnya lalu berbaring sehingga baginda menyangka bahawa saya telah tertidur. Baginda memegang jubahnya perlahan-lahan dan memakai kasutnya perlahan-lahan, dan membuka pintu lalu keluar dan kemudian menutupnya dengan perlahan. Saya menutup kepala saya, memakai tudung saya dan mengetatkan kain pinggang saya, dan kemudian keluar mengikuti jejak langkah baginda sehingga baginda sampai di Baqi'. Baginda berdiri di sana dan baginda berdiri untuk waktu yang lama. Kemudian baginda mengangkat tangannya tiga kali, dan kemudian kembali dan saya juga kembali. Baginda mempercepatkan langkahnya dan saya juga mempercepatkan langkah saya. Baginda berlari dan saya juga berlari. Baginda tiba (di rumah) dan saya juga tiba (di rumah). Walau bagaimanapun, saya mendahului baginda dan saya masuk (ke dalam rumah), dan sebaik sahaja saya berbaring di katil, baginda (Nabi Suci) masuk (ke dalam rumah), dan berkata: Kenapa kamu tercungap-cungap, wahai 'A'isha? Saya berkata: Tiada apa-apa. Baginda berkata: Beritahu saya atau Yang Halus dan Yang Maha Mengetahui akan memberitahu saya. Saya berkata: Rasulullah, tebusan ayah dan ibuku untukmu, dan kemudian saya menceritakan kepadanya (seluruh kisah). Baginda berkata: Adakah kegelapan (bayangan kamu) yang saya lihat di hadapan saya? Saya berkata: Ya. Baginda menolak dada saya dengan satu tolakan yang saya rasai, dan kemudian berkata: Adakah kamu menyangka bahawa Allah dan Rasul-Nya akan berlaku zalim terhadap kamu? Beliau berkata: Apa sahaja yang disembunyikan oleh manusia, Allah akan mengetahuinya. Baginda berkata: Jibril datang kepada saya ketika kamu melihat saya. Dia memanggil saya dan dia menyembunyikannya daripada kamu. Saya menyahut panggilannya, tetapi saya juga menyembunyikannya daripada kamu (kerana dia tidak datang kepada kamu), kerana kamu tidak berpakaian lengkap. Saya menyangka bahawa kamu telah tertidur, dan saya tidak suka untuk membangunkan kamu, kerana takut kamu akan terkejut. Dia (Jibril) berkata: Tuhanmu telah memerintahkan kamu untuk pergi kepada penduduk Baqi' (kepada mereka yang berbaring di kubur) dan memohon ampunan untuk mereka. Saya berkata: Rasulullah, bagaimana saya harus berdoa untuk mereka (Bagaimana saya harus memohon keampunan untuk mereka)? Baginda berkata: Katakanlah, Salam sejahtera ke atas penduduk kota (perkuburan) ini dari kalangan orang-orang Mukmin dan Muslim, dan semoga Allah merahmati orang-orang yang telah mendahului kita, dan orang-orang yang datang kemudian, dan kami, insya-Allah, akan menyusul kamu."
  },
  {
    "id": 9419,
    "hadith_number": 2142,
    "tajuk_hadith": "Salam kepada Penghuni Kubur",
    "perawi_melayu": "Sulaiman bin Buraida meriwayatkan daripada bapanya bahawa Rasulullah (ﷺ) biasa mengajar mereka apabila mereka pergi ke tanah perkuburan. Salah seorang perawi biasa mengucapkan ini dalam riwayat yang diriwayatkan daripada Abu Bakr:",
    "english_text": "\" Peace be upon the inhabitants of the city (i. e. graveyard).\" In the hadith transmitted by Zuhair (the words are):\" Peace be upon you, the inhabitants of the city, among the believers, and Muslims, and God willing we shall join you. I beg of Allah peace for us and for you.\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ، الأَسَدِيُّ عَنْ سُفْيَانَ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُعَلِّمُهُمْ إِذَا خَرَجُوا إِلَى الْمَقَابِرِ فَكَانَ قَائِلُهُمْ يَقُولُ - فِي رِوَايَةِ أَبِي بَكْرٍ - السَّلاَمُ عَلَى أَهْلِ الدِّيَارِ - وَفِي رِوَايَةِ زُهَيْرٍ - السَّلاَمُ عَلَيْكُمْ أَهْلَ الدِّيَارِ مِنَ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ لَلَاحِقُونَ أَسْأَلُ اللَّهَ لَنَا وَلَكُمْ الْعَافِيَةَ.",
    "malay_translation": "Salam sejahtera ke atas penghuni kota ini (iaitu tanah perkuburan). Dalam hadis yang diriwayatkan oleh Zuhair (lafaznya adalah): \"Salam sejahtera ke atas kamu, wahai penghuni kota ini, daripada kalangan orang-orang beriman dan Muslim, dan insya-Allah kami akan menyusul kamu. Saya memohon kepada Allah keselamatan bagi kami dan bagi kamu.\""
  },
  {
    "id": 9420,
    "hadith_number": 2143,
    "tajuk_hadith": "Memohon Keampunan dan Ziarah Kubur Ibu",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "I sought permission to beg forgiveness for my mother, but He did not grant it to me. I sought permission from Him to visit her grave, and He granted it (permission) to me.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَمُحَمَّدُ بْنُ عَبَّادٍ، - وَاللَّفْظُ لِيَحْيَى - قَالاَ حَدَّثَنَا مَرْوَانُ، بْنُ مُعَاوِيَةَ عَنْ يَزِيدَ، - يَعْنِي ابْنَ كَيْسَانَ - عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اسْتَأْذَنْتُ رَبِّي أَنْ أَسْتَغْفِرَ لأُمِّي فَلَمْ يَأْذَنْ لِي وَاسْتَأْذَنْتُهُ أَنْ أَزُورَ قَبْرَهَا فَأَذِنَ لِي ‏\"‏ ‏.‏",
    "malay_translation": "Aku meminta izin untuk memohon ampun bagi ibuku, tetapi Dia tidak mengizinkanku. Aku meminta izin kepada-Nya untuk menziarahi kuburnya, dan Dia mengizinkanku."
  },
  {
    "id": 9421,
    "hadith_number": 2144,
    "tajuk_hadith": "Rasulullah Menziarahi Kubur Ibu dan Anjuran Menziarahi Kubur",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "The Apostle of Allah (ﷺ) visited the grave of his mother and he wept, and moved others around him to tears, and said: I sought permission from my Lord to beg forgiveness for her but it was not granted to me, and I sought permission to visit her grave and it was granted to me so visit the graves, for that makes you mindful of death.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، عَنْ يَزِيدَ بْنِ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ زَارَ النَّبِيُّ صلى الله عليه وسلم قَبْرَ أُمِّهِ فَبَكَى وَأَبْكَى مَنْ حَوْلَهُ فَقَالَ ‏\n\"‏ اسْتَأْذَنْتُ رَبِّي فِي أَنْ أَسْتَغْفِرَ لَهَا فَلَمْ يُؤْذَنْ لِي وَاسْتَأْذَنْتُهُ فِي أَنْ أَزُورَ قَبْرَهَا فَأُذِنَ لِي فَزُورُوا الْقُبُورَ فَإِنَّهَا تُذَكِّرُ الْمَوْتَ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) menziarahi kubur ibunya lalu baginda menangis, dan membuat orang-orang di sekelilingnya turut menangis, dan bersabda: 'Aku meminta izin daripada Tuhanku untuk memohon ampun baginya tetapi tidak diizinkan kepadaku, dan aku meminta izin untuk menziarahi kuburnya dan diizinkan kepadaku, maka ziarahilah kubur kerana ia mengingatkan kamu akan kematian.'"
  },
  {
    "id": 9422,
    "hadith_number": 2145,
    "tajuk_hadith": "Kelonggaran Terhadap Ziarah Kubur, Daging Korban, dan Nabidh serta Larangan Memabukkan",
    "perawi_melayu": "Diriwayatkan daripada Ibn Buraida daripada ayahnya bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "I forbade you to visit graves, but you may now visit them; I forbade you to eat the flesh of sacrificial animals after three days, but you way now keep it as along as you feel inclined; and I forbade you nabidh except in a water-skin, you may drink it from all kinds of water-skins, but you must not drink anything intoxicating.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، - وَاللَّفْظُ لأَبِي بَكْرٍ وَابْنِ نُمَيْرٍ - قَالُوا حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ أَبِي سِنَانٍ، - وَهُوَ ضِرَارُ بْنُ مُرَّةَ - عَنْ مُحَارِبِ بْنِ دِثَارٍ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ نَهَيْتُكُمْ عَنْ زِيَارَةِ الْقُبُورِ فَزُورُوهَا وَنَهَيْتُكُمْ عَنْ لُحُومِ الأَضَاحِيِّ فَوْقَ ثَلاَثٍ فَأَمْسِكُوا مَا بَدَا لَكُمْ وَنَهَيْتُكُمْ عَنِ النَّبِيذِ إِلاَّ فِي سِقَاءٍ فَاشْرَبُوا فِي الأَسْقِيَةِ كُلِّهَا وَلاَ تَشْرَبُوا مُسْكِرًا ‏\"‏ ‏.‏ قَالَ ابْنُ نُمَيْرٍ فِي رِوَايَتِهِ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ ‏.‏",
    "malay_translation": "“Dahulu aku melarang kamu menziarahi kubur, tetapi sekarang kamu boleh menziarahinya; dahulu aku melarang kamu makan daging korban selepas tiga hari, tetapi sekarang kamu boleh menyimpannya selama mana kamu suka; dan dahulu aku melarang kamu (meminum) nabidh kecuali dalam bekas kulit, tetapi sekarang kamu boleh meminumnya dari semua jenis bekas kulit, tetapi kamu tidak boleh meminum sesuatu yang memabukkan.”"
  },
  {
    "id": 9423,
    "hadith_number": 2146,
    "tajuk_hadith": "Hadis Ini Diriwayatkan Melalui Rantaian Sanad Lain",
    "perawi_melayu": "",
    "english_text": "This hadith has been narrated through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ زُبَيْدٍ الْيَامِيِّ، عَنْ مُحَارِبِ بْنِ دِثَارٍ، عَنِ ابْنِ بُرَيْدَةَ، أُرَاهُ عَنْ أَبِيهِ، - الشَّكُّ مِنْ أَبِي خَيْثَمَةَ - عَنِ النَّبِيِّ صلى الله عليه وسلم ح .\n وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا قَبِيصَةُ بْنُ عُقْبَةَ، عَنْ سُفْيَانَ، عَنْ عَلْقَمَةَ، بْنِ مَرْثَدٍ عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم ح .\n وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، وَمُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، جَمِيعًا عَنْ عَبْدِ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ عَطَاءٍ الْخُرَاسَانِيِّ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم كُلُّهُمْ بِمَعْنَى حَدِيثِ أَبِي سِنَانٍ ‏.‏",
    "malay_translation": "Hadis ini telah diriwayatkan melalui rantaian perawi yang lain."
  },
  {
    "id": 9424,
    "hadith_number": 2147,
    "tajuk_hadith": "Jenazah Pembunuh Diri Tidak Disembahyangkan oleh Nabi ﷺ",
    "perawi_melayu": "Jabir b. Samura meriwayatkan:",
    "english_text": "(The dead body) of a person who had killed himself with a broad-headed arrow was brought before the Messenger of Allah (ﷺ), but he did not offer prayers for him.",
    "arabic_text": "حَدَّثَنَا عَوْنُ بْنُ سَلاَّمٍ الْكُوفِيُّ، أَخْبَرَنَا زُهَيْرٌ، عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِرَجُلٍ قَتَلَ نَفْسَهُ بِمَشَاقِصَ فَلَمْ يُصَلِّ عَلَيْهِ ‏.‏",
    "malay_translation": "(Jenazah) seorang lelaki yang membunuh diri dengan panah berujung lebar telah dibawa ke hadapan Rasulullah (ﷺ), tetapi baginda tidak menyembahyangkannya."
  }
]
