[
  {
    "id": 9941,
    "hadith_number": 2664,
    "tajuk_hadith": "Rasulullah ﷺ Melakukan I'tikaf pada Sepuluh Hari Terakhir Ramadan",
    "perawi_melayu": "",
    "english_text": "Ibn 'Umar (Allah be pleased with both of them) reported that the Messenger of Allah (ﷺ) used to observe i'tikaf in the last ten days of Ramadan.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ الرَّازِيُّ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، رضى الله عنهما أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَعْتَكِفُ فِي الْعَشْرِ الأَوَاخِرِ مِنْ رَمَضَانَ ‏.‏",
    "malay_translation": "Ibnu Umar (semoga Allah meredhai kedua-duanya) meriwayatkan bahawa Rasulullah (ﷺ) biasa melakukan i'tikaf pada sepuluh hari terakhir bulan Ramadan."
  },
  {
    "id": 9942,
    "hadith_number": 2665,
    "tajuk_hadith": "Tempat I'tikaf Rasulullah ﷺ di Masjid",
    "perawi_melayu": "Diriwayatkan oleh Abdullah b. Umar (semoga Allah meredhai kedua-duanya) bahawa Rasulullah ﷺ biasa melakukan i'tikaf pada sepuluh hari terakhir Ramadan. Nafi' berkata:",
    "english_text": "Abdullah (Allah be pleased with him) showed me the place in the mosque where the Messenger of Allah (ﷺ) used to observe i'tikaf.",
    "arabic_text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ، أَنَّ نَافِعًا، حَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، - رضى الله عنهما - أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَعْتَكِفُ الْعَشْرَ الأَوَاخِرَ مِنْ رَمَضَانَ ‏.‏ قَالَ نَافِعٌ وَقَدْ أَرَانِي عَبْدُ اللَّهِ - رضى الله عنه - الْمَكَانَ الَّذِي كَانَ يَعْتَكِفُ فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنَ الْمَسْجِدِ ‏.‏",
    "malay_translation": "Abdullah (semoga Allah meredhainya) menunjukkan kepadaku tempat di masjid di mana Rasulullah ﷺ biasa melakukan i'tikaf."
  },
  {
    "id": 9943,
    "hadith_number": 2666,
    "tajuk_hadith": "Rasulullah ﷺ Melakukan I'tikaf pada Sepuluh Hari Terakhir Ramadan",
    "perawi_melayu": "",
    "english_text": "'A'isha (Allah be pleased with her) reported that the Messenger of Allah (ﷺ) used to observe i'tikaf in the last ten days of Ramadan.",
    "arabic_text": "وَحَدَّثَنَا سَهْلُ بْنُ عُثْمَانَ، حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ السَّكُونِيُّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَعْتَكِفُ الْعَشْرَ الأَوَاخِرَ مِنْ رَمَضَانَ ‏.‏",
    "malay_translation": "'Aisyah (semoga Allah meredhainya) meriwayatkan bahawa Rasulullah ﷺ biasa melakukan i'tikaf pada sepuluh hari terakhir bulan Ramadan."
  },
  {
    "id": 9944,
    "hadith_number": 2667,
    "tajuk_hadith": "Hadis Riwayat Aisyah melalui Sanad Lain",
    "perawi_melayu": "",
    "english_text": "This hadith has been narrated by 'A'isha (Allah be pleased with her) through another chain of transmitters.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا سَهْلُ بْنُ عُثْمَانَ، أَخْبَرَنَا حَفْصُ بْنُ غِيَاثٍ، جَمِيعًا عَنْ هِشَامٍ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لَهُمَا - قَالاَ حَدَّثَنَا ابْنُ نُمَيْرٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَعْتَكِفُ الْعَشْرَ الأَوَاخِرَ مِنْ رَمَضَانَ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan oleh Aisyah (Semoga Allah meredhainya) melalui sanad periwayatan yang lain."
  },
  {
    "id": 9945,
    "hadith_number": 2668,
    "tajuk_hadith": "Iktikaf Rasulullah SAW pada Sepuluh Akhir Ramadan",
    "perawi_melayu": "Aisyah (semoga Allah meredhainya)",
    "english_text": "'A'isha (Allah be pleased with her) reported that the Messenger of Allah (may peace he upon him) used to observe i'tikif in the last ten days of Ramadan till Allah called him back (to his heavenly home). Then his wives observed i'tikaf after him.",
    "arabic_text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ عُقَيْلٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، - رضى الله عنها - أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَعْتَكِفُ الْعَشْرَ الأَوَاخِرَ مِنْ رَمَضَانَ حَتَّى تَوَفَّاهُ اللَّهُ عَزَّ وَجَلَّ ثُمَّ اعْتَكَفَ أَزْوَاجُهُ مِنْ بَعْدِهِ ‏.‏",
    "malay_translation": "Aisyah (semoga Allah meredhainya) meriwayatkan bahawa Rasulullah (semoga selawat dan salam ke atas baginda) biasa beriktikaf pada sepuluh hari terakhir bulan Ramadan sehingga Allah memanggil baginda kembali (ke sisi-Nya). Kemudian isteri-isteri baginda beriktikaf selepas baginda."
  },
  {
    "id": 9946,
    "hadith_number": 2669,
    "tajuk_hadith": "Rasulullah ﷺ Meninggalkan Iktikaf Ramadan dan Melakukannya pada Syawal Kerana Tindakan Para Isteri",
    "perawi_melayu": "'A'isha (Semoga Allah meredhai beliau) meriwayatkan bahawa apabila Rasulullah ﷺ berhasrat untuk melakukan iktikaf, baginda solat Subuh dan kemudian masuk ke tempat iktikafnya. Baginda memerintahkan agar khemah didirikan untuknya, dan ia pun didirikan. Baginda (pernah) berhasrat untuk melakukan iktikaf pada sepuluh hari terakhir Ramadan. Zainab (isteri Nabi Suci) memerintahkan agar khemah didirikan untuknya. Ia pun didirikan. Dan beberapa isteri Rasulullah ﷺ yang lain juga memerintahkan agar khemah didirikan untuk mereka. Dan khemah-khemah itu pun didirikan. Apabila Rasulullah ﷺ selesai solat Subuh, baginda melihat dan mendapati (begitu banyak) khemah. Lalu baginda bersabda:",
    "english_text": "What is this virtue that these (ladies) have decided to acquire? He commanded his tent to be struck and abandoned i'tikaf in the month of Ramadan and postponed it to the first ten days of Shawwal.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَرَادَ أَنْ يَعْتَكِفَ صَلَّى الْفَجْرَ ثُمَّ دَخَلَ مُعْتَكَفَهُ وَإِنَّهُ أَمَرَ بِخِبَائِهِ فَضُرِبَ أَرَادَ الاِعْتِكَافَ فِي الْعَشْرِ الأَوَاخِرِ مِنْ رَمَضَانَ فَأَمَرَتْ زَيْنَبُ بِخِبَائِهَا فَضُرِبَ وَأَمَرَ غَيْرُهَا مِنْ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم بِخِبَائِهِ فَضُرِبَ فَلَمَّا صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم الْفَجْرَ نَظَرَ فَإِذَا الأَخْبِيَةُ فَقَالَ ‏\n\"‏ آلْبِرَّ تُرِدْنَ ‏\"‏ ‏.‏ فَأَمَرَ بِخِبَائِهِ فَقُوِّضَ وَتَرَكَ الاِعْتِكَافَ فِي شَهْرِ رَمَضَانَ حَتَّى اعْتَكَفَ فِي الْعَشْرِ الأَوَّلِ مِنْ شَوَّالٍ ‏.‏",
    "malay_translation": "Apakah kebaikan yang ingin diperolehi oleh wanita-wanita ini? Baginda memerintahkan agar khemahnya dicabut dan meninggalkan iktikaf pada bulan Ramadan dan menundanya ke sepuluh hari pertama bulan Syawal."
  },
  {
    "id": 9947,
    "hadith_number": 2670,
    "tajuk_hadith": "Khemah I'tikaf Para Isteri Nabi",
    "perawi_melayu": "",
    "english_text": "This hadith has been reported through another chain of transmitters, and there it is mentioned that. 'A'isha, Hafsa and Zainab (Allah be pleased with them) pitched the tents for i'tikaf.",
    "arabic_text": "وَحَدَّثَنَاهُ ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، ح وَحَدَّثَنِي عَمْرُو بْنُ سَوَّادٍ، أَخْبَرَنَا ابْنُ، وَهْبٍ أَخْبَرَنَا عَمْرُو بْنُ الْحَارِثِ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا أَبُو أَحْمَدَ، حَدَّثَنَا سُفْيَانُ، ح وَحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا أَبُو الْمُغِيرَةِ، حَدَّثَنَا الأَوْزَاعِيُّ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، كُلُّ هَؤُلاَءِ عَنْ يَحْيَى بْنِ، سَعِيدٍ عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، - رضى الله عنها - عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ بِمَعْنَى حَدِيثِ أَبِي مُعَاوِيَةَ ‏.‏ وَفِي حَدِيثِ ابْنِ عُيَيْنَةَ وَعَمْرِو بْنِ الْحَارِثِ وَابْنِ إِسْحَاقَ ذِكْرُ عَائِشَةَ وَحَفْصَةَ وَزَيْنَبَ - رضى الله عنهن - أَنَّهُنَّ ضَرَبْنَ الأَخْبِيَةَ لِلاِعْتِكَافِ ‏.‏",
    "malay_translation": "Hadis ini telah diriwayatkan melalui rangkaian perawi lain, dan di dalamnya disebutkan bahawa 'Aisyah, Hafsa dan Zainab (semoga Allah meredai mereka) mendirikan khemah-khemah untuk i'tikaf."
  },
  {
    "id": 9948,
    "hadith_number": 2671,
    "tajuk_hadith": "Rasulullah (ﷺ) Menghidupkan Malam-Malam Terakhir Ramadhan",
    "perawi_melayu": "",
    "english_text": "'A'isha (Allah be pleased with her) reported that when the last ten nights began Allah's Messenger (ﷺ) kept awake at night (for prayer and devotion), wakened his family, and prepared himself to observe prayer (with more vigour).",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، - قَالَ إِسْحَاقُ أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، - عَنْ أَبِي يَعْفُورٍ، عَنْ مُسْلِمِ بْنِ صُبَيْحٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا دَخَلَ الْعَشْرُ أَحْيَا اللَّيْلَ وَأَيْقَظَ أَهْلَهُ وَجَدَّ وَشَدَّ الْمِئْزَرَ ‏.‏",
    "malay_translation": "Aisyah (Semoga Allah meredhainya) meriwayatkan bahawa apabila sepuluh malam terakhir (Ramadhan) bermula, Rasulullah (ﷺ) berjaga malam (untuk solat dan ibadah), membangunkan keluarganya, dan bersiap sedia untuk menunaikan solat (dengan lebih bersungguh-sungguh)."
  },
  {
    "id": 9949,
    "hadith_number": 2672,
    "tajuk_hadith": "Kesungguhan Rasulullah SAW dalam Ibadah pada Sepuluh Malam Terakhir Ramadan",
    "perawi_melayu": "",
    "english_text": "'A'isha (Allah be pleased with her) reported that Allah's Messenger (ﷺ) used to exert himself in devotion during the last ten nights to a greater extent than at any other time.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو كَامِلٍ الْجَحْدَرِيُّ كِلاَهُمَا عَنْ عَبْدِ الْوَاحِدِ بْنِ زِيَادٍ، - قَالَ قُتَيْبَةُ حَدَّثَنَا عَبْدُ الْوَاحِدِ، - عَنِ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ، قَالَ سَمِعْتُ إِبْرَاهِيمَ، يَقُولُ سَمِعْتُ الأَسْوَدَ بْنَ يَزِيدَ، يَقُولُ قَالَتْ عَائِشَةُ رضى الله عنها كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَجْتَهِدُ فِي الْعَشْرِ الأَوَاخِرِ مَا لاَ يَجْتَهِدُ فِي غَيْرِهِ ‏.‏",
    "malay_translation": "Aisyah RA meriwayatkan bahawa Rasulullah SAW biasanya bersungguh-sungguh dalam beribadah pada sepuluh malam terakhir (Ramadan) melebihi daripada malam-malam yang lain."
  },
  {
    "id": 9950,
    "hadith_number": 2673,
    "tajuk_hadith": "Rasulullah ﷺ Tidak Berpuasa pada Sepuluh Hari Zulhijjah",
    "perawi_melayu": "'A'isha (Semoga Allah meredhainya) meriwayatkan:",
    "english_text": "I never saw the Messenger of Allah (ﷺ) fasting in the ten days of Dhu'I-Hijja.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ وَإِسْحَاقُ قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ، الآخَرَانِ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم صَائِمًا فِي الْعَشْرِ قَطُّ ‏.‏",
    "malay_translation": "Saya tidak pernah melihat Rasulullah (ﷺ) berpuasa dalam sepuluh hari Zulhijjah."
  },
  {
    "id": 9951,
    "hadith_number": 2674,
    "tajuk_hadith": "Rasulullah ﷺ Tidak Berpuasa pada Sepuluh Hari Zulhijjah",
    "perawi_melayu": "'Aisyah (رضى الله عنها) meriwayatkan:",
    "english_text": "The Apostle of Allah (ﷺ) did not observe fast in the ten days of Dhul-Hijja.",
    "arabic_text": "وَحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ الْعَبْدِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، - رضى الله عنها - أَنَّ النَّبِيَّ صلى الله عليه وسلم لَمْ يَصُمِ الْعَشْرَ ‏.‏",
    "malay_translation": "Rasulullah ﷺ tidak berpuasa dalam sepuluh hari Zulhijjah."
  }
]
