[
  {
    "id": 13917,
    "hadith_number": 6640,
    "tajuk_hadith": "Kedekatan Allah SWT dengan Hamba-Nya",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda bahawa Allah SWT berfirman:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَزُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لِقُتَيْبَةَ - قَالاَ حَدَّثَنَا جَرِيرٌ،\n عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n ‏\n\"‏ يَقُولُ اللَّهُ عَزَّ وَجَلَّ أَنَا عِنْدَ ظَنِّ عَبْدِي بِي وَأَنَا مَعَهُ حِينَ يَذْكُرُنِي إِنْ ذَكَرَنِي فِي نَفْسِهِ\n ذَكَرْتُهُ فِي نَفْسِي وَإِنْ ذَكَرَنِي فِي مَلإٍ ذَكَرْتُهُ فِي مَلإٍ هُمْ خَيْرٌ مِنْهُمْ وَإِنْ تَقَرَّبَ مِنِّي شِبْرًا\n تَقَرَّبْتُ إِلَيْهِ ذِرَاعًا وَإِنْ تَقَرَّبَ إِلَىَّ ذِرَاعًا تَقَرَّبْتُ مِنْهُ بَاعًا وَإِنْ أَتَانِي يَمْشِي أَتَيْتُهُ هَرْوَلَةً\n ‏\"‏ ‏.‏",
    "malay_translation": "Allah SWT berfirman: Aku sentiasa bersama dengan apa yang difikirkan hambaKu tentangKu, dan Aku bersamanya ketika dia mengingatiKu. Jika dia mengingatiKu dalam hatinya, Aku pun mengingati dia dalam hatiKu. Dan jika dia mengingatiKu di khalayak ramai, Aku mengingati dia di khalayak ramai yang lebih baik daripada mereka. Jika dia mendekat kepadaKu sejauh sehasta, Aku mendekat kepadanya sejauh sejengkal. Dan jika dia mendekat kepadaKu sejauh sejengkal, Aku mendekat kepadanya sejauh dua tapak tangan. Dan jika dia datang kepadaKu dengan berjalan kaki, Aku datang kepadanya dengan berlari."
  },
  {
    "id": 13918,
    "hadith_number": 6641,
    "tajuk_hadith": "Kedekatan Hamba dengan Allah",
    "perawi_melayu": "Hadis ini diriwayatkan melalui Abu Bakar bin Abi Syaibah dan Abu Kuraib daripada Abu Muawiyah, daripada Al-A'masy dengan sanad yang sama, tetapi tanpa menyebut perkataan:",
    "english_text": "\" He draws near Me by the space of a hand, I draw near him by the space (covered) by two hands.\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ،\n بِهَذَا الإِسْنَادِ وَلَمْ يَذْكُرْ ‏\n\"‏ وَإِنْ تَقَرَّبَ إِلَىَّ ذِرَاعًا تَقَرَّبْتُ مِنْهُ بَاعًا ‏\"‏ ‏.‏",
    "malay_translation": "“Jika seseorang hamba menghampiri-Ku sejengkal, Aku akan menghampiri dia sehasta.”"
  },
  {
    "id": 13919,
    "hadith_number": 6642,
    "tajuk_hadith": "Allah SWT Mendekatkan Diri Kepada Hamba-Nya",
    "perawi_melayu": "Hammam bin Munabbih meriwayatkan beberapa hadis daripada Abu Hurairah dan salah satunya ialah bahawa Rasulullah SAW bersabda bahawa Allah SWT berfirman:",
    "english_text": "When My servant draws close to me by the span of a palm, I draw close to him by the space of a cubit, and when he draws close to Me by the space of a cubit, I draw close to him by the space (covered) by two hands, and when he draws close to Me by the space (covered by) two hands, I go in hurry towards him.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ\n هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ اللَّهَ قَالَ إِذَا تَلَقَّانِي عَبْدِي بِشِبْرٍ تَلَقَّيْتُهُ بِذِرَاعٍ وَإِذَا\n تَلَقَّانِي بِذِرَاعٍ تَلَقَّيْتُهُ بِبَاعٍ وَإِذَا تَلَقَّانِي بِبَاعٍ أَتَيْتُهُ بِأَسْرَعَ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila hamba-Ku menghampiri Aku sejauh tapak tangan, Aku menghampiri dia sejauh satu hasta. Dan apabila dia menghampiri Aku sejauh satu hasta, Aku menghampiri dia sejauh dua tapak tangan. Dan apabila dia menghampiri Aku sejauh dua tapak tangan, Aku bergegas menghampirinya."
  },
  {
    "id": 13920,
    "hadith_number": 6643,
    "tajuk_hadith": "Orang-orang yang Banyak Berzikir",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "Proceed on, it is Jumdan, Mufarradun have gone ahead. They (the Companions of the Holy Prophet) said: Allah's Messenger, who are Mufarradun? He said: They are those males and females who remember Allah much.",
    "arabic_text": "حَدَّثَنَا أُمَيَّةُ بْنُ بِسْطَامَ الْعَيْشِيُّ، حَدَّثَنَا يَزِيدُ، - يَعْنِي ابْنَ زُرَيْعٍ - حَدَّثَنَا رَوْحُ،\n بْنُ الْقَاسِمِ عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n يَسِيرُ فِي طَرِيقِ مَكَّةَ فَمَرَّ عَلَى جَبَلٍ يُقَالُ لَهُ جُمْدَانُ فَقَالَ ‏\"‏ سِيرُوا هَذَا جُمْدَانُ سَبَقَ الْمُفَرِّدُونَ\n ‏\"‏ ‏.‏ قَالُوا وَمَا الْمُفَرِّدُونَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الذَّاكِرُونَ اللَّهَ كَثِيرًا وَالذَّاكِرَاتُ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Umaiyyah bin Bistam Al-Aisyi, telah menceritakan kepada kami Yazid -maksudnya Ibnu Zurai'- telah menceritakan kepada kami Ruh bin Al-Qasim dari Al-Ala', dari bapanya, dari Abu Hurairah, katanya: Rasulullah SAW ketika berjalan di jalan menuju Mekah, lalu Baginda melewati sebuah gunung yang bernama Jumdan. Baginda bersabda: \"Teruskan perjalanan, ini Jumdan, mereka yang banyak berzikir telah mendahului.\" Mereka bertanya: \"Wahai Rasulullah, siapakah mereka yang banyak berzikir itu?\" Baginda menjawab: \"Mereka adalah lelaki dan perempuan yang banyak mengingati Allah SWT.\""
  },
  {
    "id": 13921,
    "hadith_number": 6644,
    "tajuk_hadith": "Sembilan Puluh Sembilan Asmaul Husna dan Syurga",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There are ninety-nine names of Allah; he who commits them to memory would get into Paradise. Verily, Allah is Odd (He is one, and it is an odd number) and He loves odd number. And in the narration of Ibn 'Umar (the words are):\" He who enumerated them.\"",
    "arabic_text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنْ سُفْيَانَ، - وَاللَّفْظُ\n لِعَمْرٍو - حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ\n صلى الله عليه وسلم قَالَ ‏\"‏ لِلَّهِ تِسْعَةٌ وَتِسْعُونَ اسْمًا مَنْ حَفِظَهَا دَخَلَ الْجَنَّةَ وَإِنَّ اللَّهَ وِتْرٌ\n يُحِبُّ الْوِتْرَ ‏\"‏ ‏.‏ وَفِي رِوَايَةِ ابْنِ أَبِي عُمَرَ ‏\"‏ مَنْ أَحْصَاهَا ‏\"‏ ‏.‏",
    "malay_translation": "Allah SWT mempunyai sembilan puluh sembilan nama. Sesiapa yang menghafalnya akan masuk syurga. Sesungguhnya, Allah SWT adalah Yang Esa (Witr) dan menyukai bilangan ganjil.  Dalam riwayat Ibnu Umar pula,  berkata: “Sesiapa yang menghitungnya.”"
  },
  {
    "id": 13922,
    "hadith_number": 6645,
    "tajuk_hadith": "Sembilan Puluh Sembilan Asmaul Husna dan Kecintaan Allah pada Bilangan Ganjil",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Verily, there are ninety-nine names for Allah, i. e. hundred excepting one. He who enumerates them would get into Paradise. And Hammam has made this addition on the authority of Abu Huraira who reported it from Allah's Apostle (ﷺ) that he said:\" He is Odd (one) and loves odd number.\"",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، عَنِ ابْنِ سِيرِينَ،\n عَنْ أَبِي هُرَيْرَةَ، وَعَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ\n ‏\"‏ إِنَّ لِلَّهِ تِسْعَةً وَتِسْعِينَ اسْمًا مِائَةً إِلاَّ وَاحِدًا مَنْ أَحْصَاهَا دَخَلَ الْجَنَّةَ ‏\"‏ ‏.‏ وَزَادَ هَمَّامٌ\n عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ إِنَّهُ وِتْرٌ يُحِبُّ الْوِتْرَ ‏\"‏ ‏.‏",
    "malay_translation": "Sesungguhnya, Allah SWT mempunyai sembilan puluh sembilan nama, iaitu seratus tolak satu. Barangsiapa yang menghafal dan mengingati kesemua nama-nama itu, nescaya dia akan masuk syurga.  Dan Hammam menambah daripada riwayat Abu Hurairah daripada Rasulullah SAW yang bersabda:  \"Sesungguhnya Allah itu ganjil dan menyukai bilangan ganjil.\""
  },
  {
    "id": 13923,
    "hadith_number": 6646,
    "tajuk_hadith": "Ketegasan dalam Berdoa",
    "perawi_melayu": "Anas meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "When one of you makes supplication, he should supplicate with a will and should not say: O Allah, confer upon me if Thou likest, for there is none to coerce Allah.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنِ ابْنِ عُلَيَّةَ، قَالَ أَبُو\n بَكْرٍ حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ\n صلى الله عليه وسلم ‏\n\"‏ إِذَا دَعَا أَحَدُكُمْ فَلْيَعْزِمْ فِي الدُّعَاءِ وَلاَ يَقُلِ اللَّهُمَّ إِنْ شِئْتَ فَأَعْطِنِي\n فَإِنَّ اللَّهَ لاَ مُسْتَكْرِهَ لَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila seorang di antara kamu berdoa, hendaklah dia berazam dengan penuh keyakinan dalam doanya dan janganlah berkata: \"Ya Allah, jika Engkau berkehendak, maka berikanlah kepada saya.\" Kerana sesungguhnya Allah SWT tidak boleh dipaksa."
  },
  {
    "id": 13924,
    "hadith_number": 6647,
    "tajuk_hadith": "Ketegasan dan Keikhlasan dalam Doa",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "When one of you makes a supplication (to his Lord) one should not say: O Allah, grant me pardon, if Thou so likest, but one should beg one's (Lord) with a will and full devotion, for there is nothing so great in the eye of Allah which He cannot grant.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنُونَ ابْنَ\n جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ\n ‏\n\"‏ إِذَا دَعَا أَحَدُكُمْ فَلاَ يَقُلِ اللَّهُمَّ اغْفِرْ لِي إِنْ شِئْتَ وَلَكِنْ لِيَعْزِمِ الْمَسْأَلَةَ وَلْيُعَظِّمِ الرَّغْبَةَ\n فَإِنَّ اللَّهَ لاَ يَتَعَاظَمُهُ شَىْءٌ أَعْطَاهُ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila seseorang di antara kamu berdoa, janganlah berkata: \"Ya Allah, ampunkanlah aku jika Engkau kehendaki.\"  Tetapi hendaklah dia berazam dalam permohonannya dan memaksimumkan kerelaannya. Sesungguhnya tiada sesuatu yang besar di sisi Allah sehingga Dia tidak mampu memberikannya."
  },
  {
    "id": 13925,
    "hadith_number": 6648,
    "tajuk_hadith": "Ketegasan dalam Berdoa",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "None of you should say to Allah (like this): O Allah, grant me mercy, if thou so likest. The supplication (of his) should (be permeated with) conviction (that it would be accepted by the Lord), for Allah is the Doer of (everything) He likes to do, and there is none to force Him (to do or not to do this or that).",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى الأَنْصَارِيُّ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، حَدَّثَنَا الْحَارِثُ،\n - وَهُوَ ابْنُ عَبْدِ الرَّحْمَنِ بْنِ أَبِي ذُبَابٍ - عَنْ عَطَاءِ بْنِ مِينَاءَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ\n النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ يَقُولَنَّ أَحَدُكُمُ اللَّهُمَّ اغْفِرْ لِي إِنْ شِئْتَ اللَّهُمَّ ارْحَمْنِي إِنْ\n شِئْتَ ‏.‏ لِيَعْزِمْ فِي الدُّعَاءِ فَإِنَّ اللَّهَ صَانِعٌ مَا شَاءَ لاَ مُكْرِهَ لَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah sesiapa di antara kamu berkata kepada Allah SWT: \"Ya Allah, ampunkanlah aku jika Engkau berkehendak; Ya Allah, rahmatilah aku jika Engkau berkehendak.\" Hendaklah dia berazam (yakin) dalam berdoa, kerana Allah SWT melakukan apa sahaja yang Dia kehendaki, dan tiada seorang pun yang dapat memaksa-Nya."
  },
  {
    "id": 13926,
    "hadith_number": 6649,
    "tajuk_hadith": "Doa memohon ajal yang baik",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "O Allah, keep me alive as long as there is goodness in life for me and bring death to me when there is goodness in death for me.",
    "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنِي ابْنَ عُلَيَّةَ - عَنْ عَبْدِ الْعَزِيزِ،\n عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَتَمَنَّيَنَّ أَحَدُكُمُ الْمَوْتَ لِضُرٍّ نَزَلَ\n بِهِ فَإِنْ كَانَ لاَ بُدَّ مُتَمَنِّيًا فَلْيَقُلِ اللَّهُمَّ أَحْيِنِي مَا كَانَتِ الْحَيَاةُ خَيْرًا لِي وَتَوَفَّنِي إِذَا كَانَتِ\n الْوَفَاةُ خَيْرًا لِي ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah seorang pun di antara kamu memohon mati disebabkan kesusahan yang menimpanya.  Tetapi jika terpaksa hendak memohon, maka hendaklah dia berdoa:  \"Ya Allah, hidupkanlah aku selama mana kehidupan itu baik bagiku, dan wafatkanlah aku apabila kematian itu baik bagiku.\""
  },
  {
    "id": 13927,
    "hadith_number": 6650,
    "tajuk_hadith": "Perbezaan Ringkas Dalam Riwayat Hadis",
    "perawi_melayu": "Ibn Abi Khalaf, melalui Ruh, Shu’bah, Zuhari bin Harb, Affan, Hammad (ibn Salamah), Thabit, dan Anas",
    "english_text": "This hadith has been narrated on the authority of Anas through another chain of transmitters, but with a small variation of wording.",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي خَلَفٍ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا \n عَفَّانُ، حَدَّثَنَا حَمَّادٌ، - يَعْنِي ابْنَ سَلَمَةَ - كِلاَهُمَا عَنْ ثَابِتٍ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله\n عليه وسلم بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ ‏\n\"‏ مِنْ ضُرٍّ أَصَابَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Anas melalui sanad (rantaian periwayat) yang lain, tetapi dengan sedikit perbezaan lafaz."
  },
  {
    "id": 13928,
    "hadith_number": 6651,
    "tajuk_hadith": "Jangan Mendoakan Kematian",
    "perawi_melayu": "Nadr bin Anas meriwayatkan, ketika Anas masih hidup, bahawa beliau berkata:",
    "english_text": "Had Allah's Messenger (ﷺ) not stated this..\" None should make a request for death,\" I would have definitely done that.",
    "arabic_text": "حَدَّثَنِي حَامِدُ بْنُ عُمَرَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا عَاصِمٌ، عَنِ النَّضْرِ بْنِ أَنَسٍ، وَأَنَسٌ،\n يَوْمَئِذٍ حَىٌّ قَالَ أَنَسٌ لَوْلاَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَتَمَنَّيَنَّ أَحَدُكُمُ\n الْمَوْتَ ‏\"‏ ‏.‏ لَتَمَنَّيْتُهُ ‏.‏",
    "malay_translation": "Sekiranya Rasulullah SAW tidak bersabda, \"Janganlah seorang pun di antara kamu mendoakan kematian,\" nescaya aku pasti mendoakannya."
  },
  {
    "id": 13929,
    "hadith_number": 6652,
    "tajuk_hadith": "Khabbab dan Kecintaannya kepada Syahid",
    "perawi_melayu": "Abu Hazim meriwayatkan:",
    "english_text": "I visited Khabbab who had seven cauteries on his stomach and he said: Had Allah's Messenger (ﷺ) not forbidden us to call for death, I would have done so.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي،\n خَالِدٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، قَالَ دَخَلْنَا عَلَى خَبَّابٍ وَقَدِ اكْتَوَى سَبْعَ كَيَّاتٍ فِي بَطْنِهِ\n فَقَالَ لَوْمَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَانَا أَنْ نَدْعُوَ بِالْمَوْتِ لَدَعَوْتُ بِهِ ‏.‏",
    "malay_translation": "Kami melawat Khabbab yang ketika itu mempunyai tujuh luka bakar di bahagian perutnya.  Dia berkata: Sekiranya Rasulullah ﷺ tidak melarang kami daripada mendoakan kematian, sudah tentu saya akan mendoakannya."
  },
  {
    "id": 13930,
    "hadith_number": 6653,
    "tajuk_hadith": "Sanad Hadith daripada Ismail",
    "perawi_melayu": "Ismail dan beberapa perawi lain",
    "english_text": "This hadith has been transmitted on the authority of Isma'il through other chains of narrators.",
    "arabic_text": "حَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، وَجَرِيرُ بْنُ عَبْدِ الْحَمِيدِ،\n وَوَكِيعٌ ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، وَيَحْيَى بْنُ حَبِيبٍ،\n قَالاَ حَدَّثَنَا مُعْتَمِرٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا أَبُو أُسَامَةَ، كُلُّهُمْ عَنْ إِسْمَاعِيلَ، بِهَذَا\n الإِسْنَادِ ‏.‏",
    "malay_translation": "Hadis ini telah diriwayatkan melalui sanad daripada Ismail dan beberapa jalan perawi yang lain.  Ia diriwayatkan oleh Ishaq bin Ibrahim, yang diberitakan oleh Sufyan bin Uyainah, Jarir bin Abd al-Hamid, Waki', Ibn Numair,  Abi, Ubaidullah bin Mu'adz, Yahya bin Habib (mereka berdua berkata: mereka diberitakan oleh Mu'tamr), Muhammad bin Rafi' (yang diberitakan oleh Abu Usamah). Kesemua mereka meriwayatkan daripada Ismail melalui sanad ini."
  },
  {
    "id": 13931,
    "hadith_number": 6654,
    "tajuk_hadith": "Jangan Mendoakan Kematian",
    "perawi_melayu": "Hammam bin Munabbih berkata:",
    "english_text": "Abu Huraira narrated to us ahadith from Allah's Messenger (ﷺ) and out of these one is that Allah's Messenger (ﷺ) said: None amongst you should make a request for death, and do not call for it before it comes, for when any one of you dies, he ceases (to do good) deeds and the life of a believer is not prolonged but for goodness.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ\n هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَتَمَنَّى أَحَدُكُمُ الْمَوْتَ وَلاَ يَدْعُ بِهِ مِنْ قَبْلِ أَنْ يَأْتِيَهُ\n إِنَّهُ إِذَا مَاتَ أَحَدُكُمُ انْقَطَعَ عَمَلُهُ وَإِنَّهُ لاَ يَزِيدُ الْمُؤْمِنَ عُمْرُهُ إِلاَّ خَيْرًا ‏\"‏ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan kepada kita hadis daripada Rasulullah SAW, dan antara hadis tersebut ialah Rasulullah SAW bersabda:  \"Tiada seorang pun di antara kamu harus memohon kematian, dan janganlah kamu mendoakannya sebelum ia datang. Sesungguhnya apabila seseorang di antara kamu meninggal dunia, terputuslah amalnya. Dan sesungguhnya umur orang mukmin itu tidak ditambah melainkan dengan kebaikan.\""
  },
  {
    "id": 13932,
    "hadith_number": 6655,
    "tajuk_hadith": "Kecintaan Berjumpa Allah",
    "perawi_melayu": "Ubida bin Samit meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "He who loves to meet Allah, Allah also loves to meet him, and he who dislikes to meet Allah, Allah also abhors to meet him.",
    "arabic_text": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ عُبَادَةَ،\n بْنِ الصَّامِتِ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ\n وَمَنْ كَرِهَ لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa yang mencintai pertemuan dengan Allah, maka Allah juga mencintai pertemuan dengannya. Dan barangsiapa yang membenci pertemuan dengan Allah, maka Allah juga membenci pertemuan dengannya."
  },
  {
    "id": 13933,
    "hadith_number": 6656,
    "tajuk_hadith": "Hadis daripada Ubadah bin Samit melalui Sanad Lain",
    "perawi_melayu": "Muhammad bin al-Muthanna dan Ibn Bashshar meriwayatkan daripada Muhammad bin Ja'far, yang meriwayatkan daripada Syu'bah, daripada Qatadah, yang berkata bahawa beliau mendengar Anas bin Malik meriwayatkan daripada Ubadah bin Samit, daripada Nabi SAW.",
    "english_text": "This hadith has been narrated on the authority of 'Ubada b. Samit through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ،\n عَنْ قَتَادَةَ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يُحَدِّثُ عَنْ عُبَادَةَ بْنِ الصَّامِتِ، عَنِ النَّبِيِّ صلى الله\n عليه وسلم مِثْلَهُ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Ubadah bin Samit melalui sanad (rantai periwayat) yang lain.  Muhammad bin al-Muthanna dan Ibn Bashshar berkata: Kami mendengar daripada Muhammad bin Ja'far, yang mendengar daripada Syu'bah, daripada Qatadah, yang berkata: Aku mendengar Anas bin Malik meriwayatkan daripada Ubadah bin Samit, daripada Nabi SAW, seumpamanya."
  },
  {
    "id": 13934,
    "hadith_number": 6657,
    "tajuk_hadith": "Cinta Akan Perjumpaan dengan Allah",
    "perawi_melayu": "Aisyah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرُّزِّيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ الْهُجَيْمِيُّ، حَدَّثَنَا سَعِيدٌ،\n عَنْ قَتَادَةَ، عَنْ زُرَارَةَ، عَنْ سَعْدِ بْنِ هِشَامٍ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله\n عليه وسلم ‏\"‏ مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ وَمَنْ كَرِهَ لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ ‏\"‏ ‏.‏\n فَقُلْتُ يَا نَبِيَّ اللَّهِ أَكَرَاهِيَةُ الْمَوْتِ فَكُلُّنَا نَكْرَهُ الْمَوْتَ فَقَالَ ‏\"‏ لَيْسَ كَذَلِكِ وَلَكِنَّ الْمُؤْمِنَ إِذَا\n بُشِّرَ بِرَحْمَةِ اللَّهِ وَرِضْوَانِهِ وَجَنَّتِهِ أَحَبَّ لِقَاءَ اللَّهِ فَأَحَبَّ اللَّهُ لِقَاءَهُ وَإِنَّ الْكَافِرَ إِذَا بُشِّرَ\n بِعَذَابِ اللَّهِ وَسَخَطِهِ كَرِهَ لِقَاءَ اللَّهِ وَكَرِهَ اللَّهُ لِقَاءَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Muhammad bin Abdullah Ar-Razzi meriwayatkan daripada Khalid bin Harits Al-Hujaimi, yang meriwayatkan daripada Sa’id, daripada Qatadah, daripada Zurarah, daripada Sa’d bin Hisyam, daripada Aisyah, katanya: Rasulullah SAW bersabda: \"Barangsiapa yang mencintai pertemuan dengan Allah, nescaya Allah mencintai pertemuan dengannya, dan barangsiapa yang membenci pertemuan dengan Allah, nescaya Allah membenci pertemuan dengannya.\"  Kemudian aku bertanya, \"Wahai Nabi Allah, adakah itu kerana kebencian terhadap kematian? Kita semua membenci kematian.\" Baginda menjawab, \"Bukan begitu. Akan tetapi, apabila seorang mukmin diberikan khabar gembira dengan rahmat Allah, keredaan-Nya, dan syurga-Nya, maka dia mencintai pertemuan dengan Allah, dan Allah juga mencintai pertemuan dengannya. Dan apabila seorang kafir diberikan khabar gembira dengan azab Allah dan kemurkaan-Nya, maka dia membenci pertemuan dengan Allah, dan Allah juga membenci pertemuan dengannya.\""
  },
  {
    "id": 13935,
    "hadith_number": 6658,
    "tajuk_hadith": "Sanad Hadith daripada Qatada",
    "perawi_melayu": "Muhammad bin Bashar, Muhammad bin Bakar, dan Saeed daripada Qatada melalui sanad yang sama.",
    "english_text": "This hadith has been reported on the authority of Qatida with the same chain of transmitters.",
    "arabic_text": "حَدَّثَنَاهُ مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، بِهَذَا الإِسْنَادِ\n ‏.‏",
    "malay_translation": "Hadith ini telah diriwayatkan daripada Qatada melalui jalan periwayatan yang sama."
  },
  {
    "id": 13936,
    "hadith_number": 6659,
    "tajuk_hadith": "Cinta Akan Pertemuan dengan Allah",
    "perawi_melayu": "Aisyah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "He who loves to meet Allah, Allah also loves to meet him, and who dislikes to meet Allah, Allah abhors to meet him. There is death before (one is able to) meet Allah.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ زَكَرِيَّاءَ، عَنِ الشَّعْبِيِّ،\n عَنْ شُرَيْحِ بْنِ هَانِئٍ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ أَحَبَّ\n لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ وَمَنْ كَرِهَ لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ وَالْمَوْتُ قَبْلَ لِقَاءِ اللَّهِ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa yang mencintai pertemuan dengan Allah, nescaya Allah juga mencintai pertemuan dengannya. Dan barangsiapa yang membenci pertemuan dengan Allah, nescaya Allah juga membenci pertemuan dengannya. Dan maut itu adalah sebelum pertemuan dengan Allah."
  },
  {
    "id": 13937,
    "hadith_number": 6660,
    "tajuk_hadith": "Hadis daripada Aisyah R.A.",
    "perawi_melayu": "Ishaq bin Ibrahim, melalui Is’a bin Yunus, Zakaria, daripada Amir, melalui Syuraih bin Hani’ daripada Aisyah R.A.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا زَكَرِيَّاءُ، عَنْ عَامِرٍ،\n حَدَّثَنِي شُرَيْحُ بْنُ هَانِئٍ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ بِمِثْلِهِ\n ‏.‏",
    "malay_translation": "Kami telah diberitakan oleh Ishaq bin Ibrahim, yang telah memberitakan kepada kami oleh Isa bin Yunus, yang telah memberitakan kepada kami oleh Zakaria, daripada Amir, yang telah memberitakan kepadaku oleh Syuraih bin Hani’, bahawa Aisyah R.A. telah memberitahunya bahawa Rasulullah SAW telah bersabda seumpamanya."
  },
  {
    "id": 13938,
    "hadith_number": 6661,
    "tajuk_hadith": "Cintakan Pertemuan dengan Allah",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الأَشْعَثِيُّ، أَخْبَرَنَا عَبْثَرٌ، عَنْ مُطَرِّفٍ، عَنْ عَامِرٍ، عَنْ شُرَيْحِ،\n بْنِ هَانِئٍ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَحَبَّ لِقَاءَ اللَّهِ\n أَحَبَّ اللَّهُ لِقَاءَهُ وَمَنْ كَرِهَ لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ ‏\"‏ ‏.‏ قَالَ فَأَتَيْتُ عَائِشَةَ فَقُلْتُ يَا أُمَّ الْمُؤْمِنِينَ\n سَمِعْتُ أَبَا هُرَيْرَةَ يَذْكُرُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم حَدِيثًا إِنْ كَانَ كَذَلِكَ فَقَدْ\n هَلَكْنَا ‏.‏ فَقَالَتْ إِنَّ الْهَالِكَ مَنْ هَلَكَ بِقَوْلِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَمَا ذَاكَ قَالَ\n قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ وَمَنْ كَرِهَ لِقَاءَ\n اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ ‏\"‏ ‏.‏ وَلَيْسَ مِنَّا أَحَدٌ إِلاَّ وَهُوَ يَكْرَهُ الْمَوْتَ ‏.‏ فَقَالَتْ قَدْ قَالَهُ رَسُولُ اللَّهِ\n صلى الله عليه وسلم وَلَيْسَ بِالَّذِي تَذْهَبُ إِلَيْهِ وَلَكِنْ إِذَا شَخَصَ الْبَصَرُ وَحَشْرَجَ الصَّدْرُ\n وَاقْشَعَرَّ الْجِلْدُ وَتَشَنَّجَتِ الأَصَابِعُ فَعِنْدَ ذَلِكَ مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ وَمَنْ كَرِهَ\n لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ ‏.‏",
    "malay_translation": "Sahih Muslim meriwayatkan daripada Abu Hurairah bahawa Rasulullah SAW bersabda: \"Barangsiapa yang mencintai pertemuan dengan Allah, nescaya Allah mencintai pertemuan dengannya. Dan barangsiapa yang membenci pertemuan dengan Allah, nescaya Allah membenci pertemuan dengannya.\"  Kemudian aku (Syuraih bin Hani') menghampiri Aisyah dan berkata: \"Wahai ibu orang beriman, aku telah mendengar Abu Hurairah menyebut sebuah hadis daripada Rasulullah SAW. Jika ia benar, maka kita telah binasa.\" Aisyah menjawab: \"Sesungguhnya orang yang binasa ialah mereka yang binasa kerana perkataan Rasulullah SAW. Apakah perkataan itu?\" Aku berkata: Rasulullah SAW bersabda: \"Barangsiapa yang mencintai pertemuan dengan Allah, nescaya Allah mencintai pertemuan dengannya. Dan barangsiapa yang membenci pertemuan dengan Allah, nescaya Allah membenci pertemuan dengannya.\" Dan tiada seorang pun dari kalangan kami melainkan dia membenci kematian. Aisyah berkata: \"Rasulullah SAW memang telah bersabda demikian, tetapi ia bukan seperti apa yang kamu fahami. Akan tetapi maksudnya ialah apabila penglihatan kabur, dada sesak, kulit menggigil dan jari-jemari kejang (ketika hendak mati). Pada ketika itulah, barangsiapa yang mencintai pertemuan dengan Allah, nescaya Allah mencintai pertemuan dengannya. Dan barangsiapa yang membenci pertemuan dengan Allah, nescaya Allah membenci pertemuan dengannya.\""
  },
  {
    "id": 13939,
    "hadith_number": 6662,
    "tajuk_hadith": "Sanad Hadith Mutarrif",
    "perawi_melayu": "Ishaq bin Ibrahim al-Hanẓali melalui Jarir daripada Mutarrif",
    "english_text": "This hadith has been reported on the authority of Mutarrif with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنِي جَرِيرٌ، عَنْ مُطَرِّفٍ، بِهَذَا الإِسْنَادِ\n نَحْوَ حَدِيثِ عَبْثَرٍ ‏.‏",
    "malay_translation": "Hadith ini telah diriwayatkan daripada Mutarrif dengan sanad yang sama melalui Ishaq bin Ibrahim al-Hanẓali yang memberitakan daripada Jarir."
  },
  {
    "id": 13940,
    "hadith_number": 6663,
    "tajuk_hadith": "Cinta Menghadapi Allah",
    "perawi_melayu": "Abu Musa meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "He who loves to meet Allah, Allah too loves to meet him, and he who dislikes to meet Allah, Allah abhors to meet him.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو عَامِرٍ الأَشْعَرِيُّ وَأَبُو كُرَيْبٍ قَالُوا حَدَّثَنَا أَبُو\n أُسَامَةَ عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏\n مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ وَمَنْ كَرِهَ لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa yang mencintai pertemuan dengan Allah, maka Allah juga mencintai pertemuan dengannya. Dan barangsiapa yang membenci pertemuan dengan Allah, maka Allah juga membenci pertemuan dengannya."
  },
  {
    "id": 13941,
    "hadith_number": 6664,
    "tajuk_hadith": "Allah SWT Sentiasa Bersama Hamba-Nya",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda bahawa Allah SWT berfirman:",
    "english_text": "I live in the thought of My servant as he thinks of Me and with him as he calls Me.",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا وَكِيعٌ، عَنْ جَعْفَرِ بْنِ بُرْقَانَ، عَنْ يَزِيدَ،\n بْنِ الأَصَمِّ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ اللَّهَ يَقُولُ أَنَا\n عِنْدَ ظَنِّ عَبْدِي بِي وَأَنَا مَعَهُ إِذَا دَعَانِي ‏\"‏ ‏.‏",
    "malay_translation": "Sesungguhnya Allah SWT berfirman: Aku bersama dengan sangkaan hamba-Ku kepada-Ku, dan Aku bersama dengannya apabila dia berdoa kepada-Ku."
  },
  {
    "id": 13942,
    "hadith_number": 6665,
    "tajuk_hadith": "Allah SWT Mendekatkan Diri Kepada Hamba-Nya",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda bahawa Allah SWT berfirman:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارِ بْنِ عُثْمَانَ الْعَبْدِيُّ، حَدَّثَنَا يَحْيَى، - يَعْنِي ابْنَ سَعِيدٍ - وَابْنُ\n أَبِي عَدِيٍّ عَنْ سُلَيْمَانَ، - وَهُوَ التَّيْمِيُّ - عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ\n صلى الله عليه وسلم قَالَ ‏\n\"‏ قَالَ اللَّهُ عَزَّ وَجَلَّ إِذَا تَقَرَّبَ عَبْدِي مِنِّي شِبْرًا تَقَرَّبْتُ مِنْهُ ذِرَاعًا\n وَإِذَا تَقَرَّبَ مِنِّي ذِرَاعًا تَقَرَّبْتُ مِنْهُ بَاعًا - أَوْ بُوعًا - وَإِذَا أَتَانِي يَمْشِي أَتَيْتُهُ هَرْوَلَةً ‏\"‏\n ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Bashar bin Utsman Al-'Abdi, telah menceritakan kepada kami Yahya - iaitu Ibnu Said - dan Ibnu Abi 'Adiyy daripada Sulaiman - iaitu Al-Taymi - daripada Anas bin Malik, daripada Abu Hurairah, daripada Nabi SAW, baginda bersabda:\n\nRasulullah SAW bersabda: Allah SWT berfirman, \"Apabila hamba-Ku mendekatkan diri kepada-Ku sejengkal, Aku mendekatkan diri kepadanya sehasta. Dan apabila hamba-Ku mendekatkan diri kepada-Ku sehasta, Aku mendekatkan diri kepadanya seiku. Dan apabila hamba-Ku datang kepada-Ku dengan berjalan kaki, Aku datang kepadanya dengan berlari.\" "
  },
  {
    "id": 13943,
    "hadith_number": 6666,
    "tajuk_hadith": "Perbezaan Ringkas Perawi",
    "perawi_melayu": "Muhammad bin Abd al-A'la al-Qaysi melalui Mu'tamar daripada bapanya",
    "english_text": "This hadith has been narrated on the authority of Mu'tamar from his father with the same chain of transmitters, with a slight variation of wording.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى الْقَيْسِيُّ، حَدَّثَنَا مُعْتَمِرٌ، عَنْ أَبِيهِ، بِهَذَا الإِسْنَادِ وَلَمْ\n يَذْكُرْ ‏\n\"‏ إِذَا أَتَانِي يَمْشِي أَتَيْتُهُ هَرْوَلَةً ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini telah diriwayatkan daripada Muhammad bin Abd al-A'la al-Qaysi, yang meriwayatkan daripada Mu'tamar, daripada bapanya, dengan sanad yang sama, tetapi dengan sedikit perbezaan lafaz."
  },
  {
    "id": 13944,
    "hadith_number": 6667,
    "tajuk_hadith": "Kedekatan Allah dengan Hamba-Nya",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda bahawa Allah SWT berfirman:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لأَبِي كُرَيْبٍ - قَالاَ حَدَّثَنَا \n أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله\n عليه وسلم ‏\n\"‏ يَقُولُ اللَّهُ عَزَّ وَجَلَّ أَنَا عِنْدَ ظَنِّ عَبْدِي وَأَنَا مَعَهُ حِينَ يَذْكُرُنِي فَإِنْ ذَكَرَنِي\n فِي نَفْسِهِ ذَكَرْتُهُ فِي نَفْسِي وَإِنْ ذَكَرَنِي فِي مَلإٍ ذَكَرْتُهُ فِي مَلإٍ خَيْرٍ مِنْهُ وَإِنِ اقْتَرَبَ إِلَىَّ\n شِبْرًا تَقَرَّبْتُ إِلَيْهِ ذِرَاعًا وَإِنِ اقْتَرَبَ إِلَىَّ ذِرَاعًا اقْتَرَبْتُ إِلَيْهِ بَاعًا وَإِنْ أَتَانِي يَمْشِي أَتَيْتُهُ\n هَرْوَلَةً ‏\"‏ ‏.‏",
    "malay_translation": "Allah SWT berfirman: Aku sentiasa bersama hambaKu sebagaimana dia mengingatiKu. Jika dia mengingatiKu dalam hatinya, Aku pun mengingati dia dalam hatiKu.  Jika dia mengingatiKu di khalayak ramai, Aku pun akan mengingati dia dalam khalayak ramai yang lebih baik darinya. Jika dia mendekatiKu sejauh satu hasta (shibr), Aku akan mendekatinya sejauh satu depa (dhira'). Dan jika dia mendekatiKu sejauh satu depa, Aku akan mendekatinya sejauh dua hasta (ba'a). Dan jika dia datang kepadaKu dengan berjalan kaki, Aku akan mendatanginya dengan berlari anak (harwalah)."
  },
  {
    "id": 13945,
    "hadith_number": 6668,
    "tajuk_hadith": "Ganjaran Kebaikan dan Pengampunan Allah",
    "perawi_melayu": "Abu Dzar",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الأَعْمَشُ، عَنِ الْمَعْرُورِ بْنِ سُوَيْدٍ،\n عَنْ أَبِي ذَرٍّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَقُولُ اللَّهُ عَزَّ وَجَلَّ مَنْ جَاءَ\n بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثَالِهَا وَأَزِيدُ وَمَنْ جَاءَ بِالسَّيِّئَةِ فَجَزَاؤُهُ سَيِّئَةٌ مِثْلُهَا أَوْ أَغْفِرُ وَمَنْ\n تَقَرَّبَ مِنِّي شِبْرًا تَقَرَّبْتُ مِنْهُ ذِرَاعًا وَمَنْ تَقَرَّبَ مِنِّي ذِرَاعًا تَقَرَّبْتُ مِنْهُ بَاعًا وَمَنْ أَتَانِي\n يَمْشِي أَتَيْتُهُ هَرْوَلَةً وَمَنْ لَقِيَنِي بِقُرَابِ الأَرْضِ خَطِيئَةً لاَ يُشْرِكُ بِي شَيْئًا لَقِيتُهُ بِمِثْلِهَا مَغْفِرَةً\n ‏\"‏ ‏.‏ قَالَ إِبْرَاهِيمُ حَدَّثَنَا الْحَسَنُ بْنُ بِشْرٍ حَدَّثَنَا وَكِيعٌ بِهَذَا الْحَدِيثِ ‏.‏",
    "malay_translation": "Abu Dzar meriwayatkan bahawa Rasulullah SAW bersabda: Allah SWT berfirman, \"Barangsiapa yang datang dengan kebaikan, maka baginya sepuluh kali ganda pahala dan lebih daripada itu. Dan barangsiapa yang datang dengan kejahatan, maka balasannya adalah kejahatan yang serupa atau Aku ampunkan. Dan barangsiapa yang mendekatkan diri kepada-Ku sejauh satu hasta, Aku akan mendekatkan diri kepadanya sejauh satu depa. Dan barangsiapa yang mendekatkan diri kepada-Ku sejauh satu depa, Aku akan mendekatkan diri kepadanya sejauh dua hasta. Dan barangsiapa yang datang kepada-Ku dengan berjalan kaki, Aku akan datang kepadanya dengan berlari anak. Dan barangsiapa yang menemui-Ku dengan dosa sepenuh bumi, tetapi tidak mempersekutukan Aku dengan sesuatu pun, Aku akan menemuinya dengan pengampunan yang serupa.\" Ibrahim berkata: Al-Hasan bin Bisyr meriwayatkan hadis ini daripada Waki'."
  },
  {
    "id": 13946,
    "hadith_number": 6669,
    "tajuk_hadith": "Ganjaran Sebaiknya Amalan Baik",
    "perawi_melayu": "Hadis seumpama ini telah diriwayatkan daripada al-A'mash dengan sanad yang sama dan beliau (tambahan) berkata:",
    "english_text": "There is for him ten like that (the good he performed) or more than that.",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ ‏.‏ نَحْوَهُ غَيْرَ\n أَنَّهُ قَالَ ‏\n\"‏ فَلَهُ عَشْرُ أَمْثَالِهَا أَوْ أَزِيدُ ‏\"‏ ‏.‏",
    "malay_translation": "Baginya sepuluh kali ganda pahala amalan baik itu, atau lebih daripada itu."
  },
  {
    "id": 13947,
    "hadith_number": 6670,
    "tajuk_hadith": "Doa memohon kebaikan dunia dan akhirat",
    "perawi_melayu": "Anas meriwayatkan bahawa Rasulullah SAW melawat seorang lelaki daripada kalangan umat Islam yang telah menjadi lemah seperti anak ayam.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْخَطَّابِ، زِيَادُ بْنُ يَحْيَى الْحَسَّانِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عَدِيٍّ، عَنْ \n حُمَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم عَادَ رَجُلاً مِنَ الْمُسْلِمِينَ\n قَدْ خَفَتَ فَصَارَ مِثْلَ الْفَرْخِ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلْ كُنْتَ تَدْعُو\n بِشَىْءٍ أَوْ تَسْأَلُهُ إِيَّاهُ ‏\"‏ ‏.‏ قَالَ نَعَمْ كُنْتُ أَقُولُ اللَّهُمَّ مَا كُنْتَ مُعَاقِبِي بِهِ فِي الآخِرَةِ فَعَجِّلْهُ\n لِي فِي الدُّنْيَا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ سُبْحَانَ اللَّهِ لاَ تُطِيقُهُ - أَوْ لاَ\n تَسْتَطِيعُهُ - أَفَلاَ قُلْتَ اللَّهُمَّ آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\n ‏\"‏ ‏.‏ قَالَ فَدَعَا اللَّهَ لَهُ فَشَفَاهُ ‏.‏",
    "malay_translation": "Abu al-Khaththab, Ziyad bin Yahya al-Hassani meriwayatkan daripada Muhammad bin Abi ‘Udy, daripada Humaid, daripada Tsabit, daripada Anas bahawa Rasulullah SAW melawat seorang lelaki daripada kalangan umat Islam yang telah menjadi lemah seperti anak ayam. Rasulullah SAW bertanya kepadanya, \"Adakah engkau pernah berdoa atau meminta sesuatu daripada-Nya?\" Lelaki itu menjawab, \"Ya, aku selalu berdoa: Wahai Allah, apa sahaja azab yang Engkau tetapkan untukku di akhirat, segerakanlah ia di dunia.\" Rasulullah SAW bersabda, \"Maha Suci Allah, engkau tidak mampu atau tidak kuat menanggungnya. Mengapa engkau tidak berdoa: Wahai Allah, berikanlah kepada kami kebaikan di dunia dan kebaikan di akhirat, dan peliharalah kami daripada azab neraka.\" Kemudian Rasulullah SAW berdoa untuknya, lalu lelaki itu sembuh."
  },
  {
    "id": 13948,
    "hadith_number": 6671,
    "tajuk_hadith": "Perbezaan Ringkas Perawi",
    "perawi_melayu": "Humaid melalui Khalid bin al-Harith dan ‘Asim bin al-Nadhr",
    "english_text": "This hadith has been narrated on the authority of Humaid with the same chain of transmitters, but with a slight variation of wording.",
    "arabic_text": "حَدَّثَنَاهُ عَاصِمُ بْنُ النَّضْرِ التَّيْمِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا حُمَيْدٌ، بِهَذَا الإِسْنَادِ\n إِلَى قَوْلِهِ ‏\n\"‏ وَقِنَا عَذَابَ النَّارِ ‏\"‏ ‏.‏ وَلَمْ يَذْكُرِ الزِّيَادَةَ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Humaid melalui sanad yang sama dengan perawi-perawi sebelumnya, tetapi dengan sedikit perbezaan lafaz."
  },
  {
    "id": 13949,
    "hadith_number": 6672,
    "tajuk_hadith": "Ketidakmampuan Menghadapi Azab Allah",
    "perawi_melayu": "Anas meriwayatkan bahawa Rasulullah SAW telah melawat seorang sahabat yang telah menjadi lemah seperti anak ayam.",
    "english_text": "You have not power enough to undergo the torment imposed by Allah. And there is no mention of: He supplicated Allah for him and He cured him.",
    "arabic_text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادٌ، أَخْبَرَنَا ثَابِتٌ، عَنْ أَنَسٍ، أَنَّعليه وسلم دَخَلَ عَلَى رَجُلٍ مِنْ أَصْحَابِهِ يَعُودُهُ وَقَدْ صَارَ كَالْفَرْخِ\n ‏.‏ بِمَعْنَى حَدِيثِ حُمَيْدٍ غَيْرَ أَنَّهُ قَالَ ‏\n\"‏ لاَ طَاقَةَ لَكَ بِعَذَابِ اللَّهِ ‏\"‏ ‏.‏ وَلَمْ يَذْكُرْ فَدَعَا اللَّهَ لَهُ\n فَشَفَاهُ ‏.‏",
    "malay_translation": "Anas r.a. meriwayatkan bahawa Rasulullah SAW telah melawat seorang sahabat baginda yang sedang sakit.  Sahabat itu telah menjadi lemah seperti anak ayam.  Rasulullah SAW bersabda:  \"Kamu tidak mempunyai kekuatan untuk menanggung azab Allah.\"  (Riwayat ini tidak menyebut bahawa baginda berdoa kepada Allah untuk kesembuhan sahabat tersebut.)"
  },
  {
    "id": 13950,
    "hadith_number": 6673,
    "tajuk_hadith": "Sanad Hadith daripada Anas",
    "perawi_melayu": "Muhammad bin al-Muthanna dan Ibn Bashshar meriwayatkan daripada Salim bin Nu'h al-'Attar, daripada Sa'id bin Abi 'Aruabah, daripada Qatadah, daripada Anas, daripada Nabi SAW.",
    "english_text": "This hadith had been transmitted on the authority of Anas through another chain of narrators.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا سَالِمُ بْنُ نُوحٍ الْعَطَّارُ، عَنْ سَعِيدِ،\n بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا الْحَدِيثِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Anas melalui sanad yang lain.  (Daripada Muhammad bin al-Muthanna dan Ibn Bashshar; mereka berkata:  Daripada Salim bin Nu'h al-'Attar; daripada Sa'id bin Abi 'Aruabah; daripada Qatadah; daripada Anas; daripada Nabi SAW.)"
  },
  {
    "id": 13951,
    "hadith_number": 6674,
    "tajuk_hadith": "Malaikat dan Majlis Zikir",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا سُهَيْلٌ، عَنْ أَبِيهِ،\n عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ لِلَّهِ تَبَارَكَ وَتَعَالَى مَلاَئِكَةً سَيَّارَةً\n فُضْلاً يَتَبَّعُونَ مَجَالِسَ الذِّكْرِ فَإِذَا وَجَدُوا مَجْلِسًا فِيهِ ذِكْرٌ قَعَدُوا مَعَهُمْ وَحَفَّ بَعْضُهُمْ بَعْضًا\n بِأَجْنِحَتِهِمْ حَتَّى يَمْلَئُوا مَا بَيْنَهُمْ وَبَيْنَ السَّمَاءِ الدُّنْيَا فَإِذَا تَفَرَّقُوا عَرَجُوا وَصَعِدُوا إِلَى\n السَّمَاءِ - قَالَ - فَيَسْأَلُهُمُ اللَّهُ عَزَّ وَجَلَّ وَهُوَ أَعْلَمُ بِهِمْ مِنْ أَيْنَ جِئْتُمْ فَيَقُولُونَ جِئْنَا مِنْ\n عِنْدِ عِبَادٍ لَكَ فِي الأَرْضِ يُسَبِّحُونَكَ وَيُكَبِّرُونَكَ وَيُهَلِّلُونَكَ وَيَحْمَدُونَكَ وَيَسْأَلُونَكَ ‏.‏ قَالَ\n وَمَاذَا يَسْأَلُونِي قَالُوا يَسْأَلُونَكَ جَنَّتَكَ ‏.‏ قَالَ وَهَلْ رَأَوْا جَنَّتِي قَالُوا لاَ أَىْ رَبِّ ‏.‏ قَالَ فَكَيْفَ\n لَوْ رَأَوْا جَنَّتِي قَالُوا وَيَسْتَجِيرُونَكَ ‏.‏ قَالَ وَمِمَّ يَسْتَجِيرُونَنِي قَالُوا مِنْ نَارِكَ يَا رَبِّ ‏.‏ قَالَ\n وَهَلْ رَأَوْا نَارِي قَالُوا لاَ ‏.‏ قَالَ فَكَيْفَ لَوْ رَأَوْا نَارِي قَالُوا وَيَسْتَغْفِرُونَكَ - قَالَ - فَيَقُولُ\n قَدْ غَفَرْتُ لَهُمْ فَأَعْطَيْتُهُمْ مَا سَأَلُوا وَأَجَرْتُهُمْ مِمَّا اسْتَجَارُوا - قَالَ - فَيَقُولُونَ رَبِّ فِيهِمْ\n فُلاَنٌ عَبْدٌ خَطَّاءٌ إِنَّمَا مَرَّ فَجَلَسَ مَعَهُمْ قَالَ فَيَقُولُ وَلَهُ غَفَرْتُ هُمُ الْقَوْمُ لاَ يَشْقَى بِهِمْ جَلِيسُهُمْ\n ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  Sesungguhnya Allah SWT mempunyai malaikat-malaikat yang sentiasa bergerak, mereka mengikuti majlis-majlis zikir. Apabila mereka menjumpai majlis yang mengandungi zikir, mereka akan duduk bersama-sama dan sesetengah mereka melindungi yang lain dengan sayap mereka sehingga memenuhi ruang antara mereka dan langit dunia.  Apabila mereka bersurai, mereka akan naik ke langit.  Allah SWT bertanya kepada mereka – dan Dia Maha Mengetahui tentang mereka – dari mana kamu datang? Mereka menjawab: Kami datang daripada hamba-hambaMu di bumi yang bertasbih kepadaMu, mengagungkanMu, memujiMu, dan memohon kepadaMu.  Allah bertanya: Apakah yang mereka mohon kepadaKu? Mereka menjawab: Mereka memohon syurgaMu. Allah bertanya: Adakah mereka telah melihat syurgaKu? Mereka menjawab: Tidak, ya Tuhan kami. Allah bertanya: Bagaimana jika mereka melihat syurgaKu? Mereka menjawab: Dan mereka memohon perlindungan kepadaMu. Allah bertanya: Daripada apa mereka memohon perlindungan kepadaKu? Mereka menjawab: Daripada nerakaMu, ya Tuhan kami. Allah bertanya: Adakah mereka telah melihat nerakaKu? Mereka menjawab: Tidak. Allah bertanya: Bagaimana jika mereka melihat nerakaKu? Mereka menjawab: Dan mereka memohon keampunan kepadaMu. Allah berfirman: Aku telah mengampuni mereka, Aku telah memberi mereka apa yang mereka minta, dan Aku telah melindungi mereka daripada apa yang mereka berlindung. Mereka berkata: Ya Tuhan, di kalangan mereka ada seorang hamba yang berdosa, dia hanya lalu dan duduk bersama mereka. Allah berfirman: Aku juga mengampuninya. Mereka adalah kaum yang tidak akan celaka teman duduk mereka."
  },
  {
    "id": 13952,
    "hadith_number": 6675,
    "tajuk_hadith": "Doa Nabi SAW yang Selalu Diucapkan",
    "perawi_melayu": "Qatada bertanya kepada Anas tentang doa yang paling sering dipanjatkan oleh Rasulullah SAW.",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنِي ابْنَ عُلَيَّةَ - عَنْ عَبْدِ الْعَزِيزِ،\n - وَهُوَ ابْنُ صُهَيْبٍ - قَالَ سَأَلَ قَتَادَةُ أَنَسًا أَىُّ دَعْوَةٍ كَانَ يَدْعُو بِهَا النَّبِيُّ صلى الله\n عليه وسلم أَكْثَرَ قَالَ كَانَ أَكْثَرُ دَعْوَةٍ يَدْعُو بِهَا يَقُولُ ‏\n\"‏ اللَّهُمَّ آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي\n الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ ‏\"‏ ‏.‏ قَالَ وَكَانَ أَنَسٌ إِذَا أَرَادَ أَنْ يَدْعُوَ بِدَعْوَةٍ دَعَا بِهَا\n فَإِذَا أَرَادَ أَنْ يَدْعُوَ بِدُعَاءٍ دَعَا بِهَا فِيهِ ‏.‏",
    "malay_translation": "Zuhari bin Harb meriwayatkan daripada Ismail (iaitu Ibnu 'Ulayyah) daripada 'Abdul 'Aziz (iaitu Ibnu Suhaib) bahawa Qatadah bertanya kepada Anas, \"Apakah doa yang paling sering dipanjatkan oleh Nabi SAW?\" Anas menjawab, \"Doa yang paling sering dipanjatkan baginda ialah:  \"Ya Allah, berikanlah kepada kami kebaikan di dunia dan kebaikan di akhirat, dan peliharalah kami daripada azab neraka.\" Anas menambah, \"Apabila Anas ingin berdoa, dia akan berdoa dengan doa ini. Dan jika dia ingin berdoa dengan doa yang lain, dia akan memasukkan doa ini ke dalamnya.\""
  },
  {
    "id": 13953,
    "hadith_number": 6676,
    "tajuk_hadith": "Doa Mohon Kebaikan Dunia dan Akhirat",
    "perawi_melayu": "Anas meriwayatkan bahawa Rasulullah SAW berdoa dengan kata-kata ini:",
    "english_text": "\"Our Lord, grant us the good in this world and the good in the Hereafter and save us from the torment of Hell Fire.\"",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ كَانَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً\n وَقِنَا عَذَابَ النَّارِ ‏\"‏ ‏.‏",
    "malay_translation": "Anas r.a. meriwayatkan bahawa Rasulullah SAW biasa berdoa: \"Wahai Tuhan kami, anugerahkanlah kepada kami kebaikan di dunia dan kebaikan di akhirat, dan peliharalah kami daripada azab neraka.\""
  },
  {
    "id": 13954,
    "hadith_number": 6677,
    "tajuk_hadith": "Ganjaran Mengulang Kalimah Tauhid dan Tasbih",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ \n أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ\n شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ ‏.‏ فِي يَوْمٍ مِائَةَ مَرَّةٍ ‏.‏ كَانَتْ لَهُ عَدْلَ\n عَشْرِ رِقَابٍ وَكُتِبَتْ لَهُ مِائَةُ حَسَنَةٍ وَمُحِيَتْ عَنْهُ مِائَةُ سَيِّئَةٍ وَكَانَتْ لَهُ حِرْزًا مِنَ الشَّيْطَانِ\n يَوْمَهُ ذَلِكَ حَتَّى يُمْسِيَ وَلَمْ يَأْتِ أَحَدٌ أَفْضَلَ مِمَّا جَاءَ بِهِ إِلاَّ أَحَدٌ عَمِلَ أَكْثَرَ مِنْ ذَلِكَ ‏.‏ وَمَنْ\n قَالَ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ فِي يَوْمٍ مِائَةَ مَرَّةٍ حُطَّتْ خَطَايَاهُ وَلَوْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ ‏\"‏\n ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:  \"Barangsiapa yang mengucapkan, 'La ilaha illallah wahdahu la sharika lah, lahul mulku wa lahul hamdu wa huwa 'ala kulli syai'in qadir' (Tiada Tuhan melainkan Allah, Yang Esa, tiada sekutu bagi-Nya, bagi-Nya kerajaan dan bagi-Nya segala puji, dan Dia Maha Kuasa atas segala sesuatu) sebanyak seratus kali setiap hari, maka baginya pahala seperti memerdekakan sepuluh orang hamba, dan ditulis baginya seratus kebaikan, dan dihapuskan darinya seratus keburukan, dan ia menjadi benteng baginya daripada syaitan pada hari itu sehingga petang. Dan tiada seorang pun yang datang dengan sesuatu yang lebih baik daripada apa yang dibawanya, kecuali seseorang yang melakukan lebih daripada itu.  Dan barangsiapa yang mengucapkan, 'Subhanallah wa bihamdih' (Maha Suci Allah dan segala puji bagi-Nya) sebanyak seratus kali setiap hari, nescaya dosa-dosanya akan diampunkan walaupun ianya sebanyak buih di lautan.\""
  },
  {
    "id": 13955,
    "hadith_number": 6678,
    "tajuk_hadith": "Keutamaan Membaca \"Subhanallah Wa Bihamdih\"",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "He who recites in the morning and in the evening (these words):\" Hallowed be Allah and all praise is due to Him\" one hundred times, he would not bring on the Day of Resurrection anything excellent than this except one who utters these words or utters more than these words.",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ الأُمَوِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ، عَنْ سُهَيْلٍ،\n عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏\n مَنْ قَالَ حِينَ يُصْبِحُ وَحِينَ يُمْسِي سُبْحَانَ اللَّهِ وَبِحَمْدِهِ مِائَةَ مَرَّةٍ ‏.‏ لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ\n بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلاَّ أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa yang membaca pada waktu pagi dan petang, \"Subhanallah wa bihamdih\" (Maha Suci Allah dan segala puji bagi-Nya) sebanyak seratus kali, maka dia tidak akan datang pada hari kiamat dengan sesuatu yang lebih afdhal (lebih baik) daripada ini, kecuali seseorang yang membaca perkataan yang sama atau lebih daripada itu."
  },
  {
    "id": 13956,
    "hadith_number": 6679,
    "tajuk_hadith": "Keutamaan Mengulang Kalimah Tauhid",
    "perawi_melayu": "Amr bin Maimun meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ عُبَيْدِ اللَّهِ أَبُو أَيُّوبَ الْغَيْلاَنِيُّ، حَدَّثَنَا أَبُو عَامِرٍ، - يَعْنِي الْعَقَدِيَّ\n - حَدَّثَنَا عُمَرُ، - وَهُوَ ابْنُ أَبِي زَائِدَةَ - عَنْ أَبِي إِسْحَاقَ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، قَالَ ‏\n\"‏\n مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ\n عَشْرَ مِرَارٍ كَانَ كَمَنْ أَعْتَقَ أَرْبَعَةَ أَنْفُسٍ مِنْ وَلَدِ إِسْمَاعِيلَ ‏\"‏ ‏.‏ وَقَالَ سُلَيْمَانُ حَدَّثَنَا أَبُو\n عَامِرٍ حَدَّثَنَا عُمَرُ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي السَّفَرِ عَنِ الشَّعْبِيِّ عَنْ رَبِيعِ بْنِ خُثَيْمٍ ‏.‏ بِمِثْلِ\n ذَلِكَ قَالَ فَقُلْتُ لِلرَّبِيعِ مِمَّنْ سَمِعْتَهُ قَالَ مِنْ عَمْرِو بْنِ مَيْمُونٍ - قَالَ - فَأَتَيْتُ عَمْرَو بْنَ\n مَيْمُونٍ فَقُلْتُ مِمَّنْ سَمِعْتَهُ قَالَ مِنِ ابْنِ أَبِي لَيْلَى - قَالَ - فَأَتَيْتُ ابْنَ أَبِي لَيْلَى فَقُلْتُ مِمَّنْ\n سَمِعْتَهُ قَالَ مِنْ أَبِي أَيُّوبَ الأَنْصَارِيِّ يُحَدِّثُهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Ubaidillah Abu Ayyub Al-Ghailanni, telah menceritakan kepada kami Abu Amir - iaitu Al-Aqadi - telah menceritakan kepada kami Umar - iaitu Ibnu Abi Zaidah - daripada Abi Ishaq, daripada Amr bin Maimun, katanya:\n\n\"Barangsiapa yang berkata: \"Tiada Tuhan melainkan Allah, Yang Esa, tiada sekutu bagi-Nya, bagi-Nya kerajaan dan bagi-Nya segala puji, dan Dia Maha Kuasa atas segala sesuatu,\" sebanyak sepuluh kali, maka dia seperti orang yang telah membebaskan empat orang hamba daripada zuriat Ismail.\"\n\nDan Sulaiman berkata: Telah menceritakan kepada kami Abu Amir, telah menceritakan kepada kami Umar, telah menceritakan kepada kami Abdullah bin Abi Safar daripada As-Sya'bi daripada Rabi' bin Khuthaim dengan yang serupa. Maka aku berkata kepada Rabi', \"Daripada siapa engkau mendengarnya?\" Katanya, \"Daripada Amr bin Maimun.\" Maka aku pergi kepada Amr bin Maimun, lalu aku berkata, \"Daripada siapa engkau mendengarnya?\" Katanya, \"Daripada Ibnu Abi Laila.\" Maka aku pergi kepada Ibnu Abi Laila, lalu aku berkata, \"Daripada siapa engkau mendengarnya?\" Katanya, \"Daripada Abu Ayyub Al-Ansari yang meriwayatkannya daripada Rasulullah ﷺ."
  },
  {
    "id": 13957,
    "hadith_number": 6680,
    "tajuk_hadith": "Kalimat Ringan, Timbangan Berat",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Two are the expressions which are light on the tongue, but heavy in scale, dear to the Compassionate One:\" Hallowed be Allah and praise is due to Him\" ;\" Hallowed be Allah, the Great.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَزُهَيْرُ بْنُ حَرْبٍ، وَأَبُو كُرَيْبٍ وَمُحَمَّدُ بْنُ طَرِيفٍ\n الْبَجَلِيُّ قَالُوا حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ،\n قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ كَلِمَتَانِ خَفِيفَتَانِ عَلَى اللِّسَانِ ثَقِيلَتَانِ فِي\n الْمِيزَانِ حَبِيبَتَانِ إِلَى الرَّحْمَنِ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ سُبْحَانَ اللَّهِ الْعَظِيمِ ‏\"‏ ‏.‏",
    "malay_translation": "Dua kalimah yang ringan di lidah, tetapi berat di timbangan, disayangi oleh Yang Maha Pemurah: \"Subhanallah wa bihamdih\" (Maha Suci Allah dan segala puji bagi-Nya), dan \"Subhanallahil-'Azim\" (Maha Suci Allah Yang Maha Agung)."
  },
  {
    "id": 13958,
    "hadith_number": 6681,
    "tajuk_hadith": "Keutamaan Zikir Subhanallah, Alhamdulillah, La ilaha illallah, Wallahu Akbar",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The uttering of (these words):\" Hallowed be Allah; all praise is due to Allah, there is no god but Allah and Allah is the Greatest,\" is dearer to me than anything over which the sun rises.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ،\n عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لأَنْ أَقُولَ\n سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلاَ إِلَهَ إِلاَّ اللَّهُ وَاللَّهُ أَكْبَرُ أَحَبُّ إِلَىَّ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ ‏\"‏\n ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:  \"Aku lebih menyukai untuk mengucapkan Subhanallah, Alhamdulillah, La ilaha illallah, Wallahu Akbar daripada apa sahaja yang disinari matahari.\""
  },
  {
    "id": 13959,
    "hadith_number": 6682,
    "tajuk_hadith": "Doa Pendek untuk Orang Arab Badwi",
    "perawi_melayu": "Mus'ab bin Sa'd meriwayatkan daripada bapanya bahawa seorang Arab Badwi datang kepada Rasulullah SAW dan berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، وَابْنُ، نُمَيْرٍ عَنْ مُوسَى الْجُهَنِيِّ،\n ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا مُوسَى الْجُهَنِيُّ،\n عَنْ مُصْعَبِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، قَالَ جَاءَ أَعْرَابِيٌّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم\n فَقَالَ عَلِّمْنِي كَلاَمًا أَقُولُهُ قَالَ ‏\"‏ قُلْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ اللَّهُ أَكْبَرُ كَبِيرًا وَالْحَمْدُ\n لِلَّهِ كَثِيرًا سُبْحَانَ اللَّهِ رَبِّ الْعَالَمِينَ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ الْعَزِيزِ الْحَكِيمِ ‏\"‏ ‏.‏ قَالَ فَهَؤُلاَءِ\n لِرَبِّي فَمَا لِي قَالَ ‏\"‏ قُلِ اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَاهْدِنِي وَارْزُقْنِي ‏\"‏ ‏.‏ قَالَ مُوسَى أَمَّا\n عَافِنِي فَأَنَا أَتَوَهَّمُ وَمَا أَدْرِي ‏.‏ وَلَمْ يَذْكُرِ ابْنُ أَبِي شَيْبَةَ فِي حَدِيثِهِ قَوْلَ مُوسَى ‏.‏",
    "malay_translation": "Abu Bakar bin Abi Syaibah telah meriwayatkan daripada Ali bin Mushir dan Ibnu Numair daripada Musa al-Juhani, dan Muhammad bin Abdullah bin Numair meriwayatkan (dengan lafaznya) daripada bapanya, daripada Musa al-Juhani, daripada Mus'ab bin Sa'd, daripada bapanya, bahawa seorang Arab Badwi datang kepada Rasulullah SAW lalu berkata, \"Ajarkanlah saya beberapa kalimah yang boleh saya sebut.\" Baginda SAW bersabda, \"Katakanlah:  'La ilaha illallah wahdahu la sharika lah, Allah huakbar kabiran wal hamdu lillah katsiran, Subhanallah rabbil 'alamin, la hawla wala quwwata illa billah al-'Aziz al-Hakim.'\"  Orang Arab Badwi itu berkata, \"Kalimah-kalimah ini adalah untuk Tuhan saya.  Apakah untuk saya?\" Baginda SAW bersabda, \"Katakanlah:  'Allahummaghfirli warhamni wahdini warzuqni.'\" Musa berkata, \"Adapun 'wa'afini' (dan berikanlah kesejahteraan kepadaku), saya agak-agak sahaja dan saya tidak pasti.\"  Dan Ibnu Abi Syaibah tidak menyebut kata-kata Musa dalam riwayatnya."
  },
  {
    "id": 13960,
    "hadith_number": 6683,
    "tajuk_hadith": "Doa Setelah Memeluk Islam",
    "perawi_melayu": "Abu Malik Ashaja'i meriwayatkan daripada bapanya bahawa setiap kali seseorang memeluk Islam, Rasulullah SAW mengajarnya untuk berdoa:",
    "english_text": "\"O Allah, grant me pardon, have mercy upon me, guide me to the path of righteousness, and provide me sustenance.\"",
    "arabic_text": "حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، - يَعْنِي ابْنَ زِيَادٍ - حَدَّثَنَا أَبُو\n مَالِكٍ الأَشْجَعِيُّ عَنْ أَبِيهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُعَلِّمُ مَنْ أَسْلَمَ يَقُولُ\n ‏\n\"‏ اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَاهْدِنِي وَارْزُقْنِي ‏\"‏ ‏.‏",
    "malay_translation": "Abu Kamil al-Jahdari meriwayatkan daripada Abdul Wahid (iaitu Ibn Ziyad), yang meriwayatkan daripada Abu Malik al-Asy'aji daripada bapanya, bahawa Rasulullah SAW bersabda:  \"Ya Allah, ampunkanlah daku, rahmatilah daku, berilah petunjuk kepadaku ke jalan yang benar, dan kurniakanlah rezeki kepadaku.\""
  },
  {
    "id": 13961,
    "hadith_number": 6684,
    "tajuk_hadith": "Doa Selepas Menerima Islam",
    "perawi_melayu": "Abu Malik meriwayatkan daripada bapanya bahawa apabila seseorang itu memeluk Islam, Rasulullah SAW mengajarnya cara sembahyang dan kemudian memerintahkannya berdoa dengan kalimah-kalimah ini:",
    "english_text": "\" O Allah, grant me pardon, have mercy upon me, direct me to the path of righteousness, grant me protection and provide me sustenance.\"",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ أَزْهَرَ الْوَاسِطِيُّ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا أَبُو مَالِكٍ الأَشْجَعِيُّ،\n عَنْ أَبِيهِ، قَالَ كَانَ الرَّجُلُ إِذَا أَسْلَمَ عَلَّمَهُ النَّبِيُّ صلى الله عليه وسلم الصَّلاَةَ ثُمَّ أَمَرَهُ أَنْ\n يَدْعُوَ بِهَؤُلاَءِ الْكَلِمَاتِ ‏\n\"‏ اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَاهْدِنِي وَعَافِنِي وَارْزُقْنِي ‏\"‏ ‏.‏",
    "malay_translation": "Abu Malik meriwayatkan daripada bapanya bahawa apabila seseorang itu memeluk Islam, Rasulullah SAW mengajarnya cara sembahyang dan kemudian memerintahkannya untuk berdoa dengan kalimah-kalimah ini: \"Ya Allah, ampunkanlah daku, rahmatilah daku, tunjukkanlah daku ke jalan yang lurus, berikanlah kesejahteraan dan rezekikanlah daku.\""
  },
  {
    "id": 13962,
    "hadith_number": 6685,
    "tajuk_hadith": "Doa Ringkas untuk Dunia dan Akhirat",
    "perawi_melayu": "Abu Malik meriwayatkan daripada bapanya bahawa baginda mendengar Rasulullah SAW bersabda kepada seseorang yang datang kepadanya dan bertanya bagaimana hendak memohon kepada Tuhannya...",
    "english_text": "\" O Allah, grant me pardon, have mercy upon me, protect me, provide me sustenance,\" and he collected his fingers together except his thumb and said: It is in these words (that there is supplication) which sums up for you (the good) of this world and that of the Hereafter.",
    "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا أَبُو مَالِكٍ، عَنْ أَبِيهِ، أَنَّهُ\n سَمِعَ النَّبِيَّ صلى الله عليه وسلم وَأَتَاهُ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ أَقُولُ حِينَ أَسْأَلُ\n رَبِّي قَالَ ‏\"‏ قُلِ اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَعَافِنِي وَارْزُقْنِي ‏\"‏ ‏.‏ وَيَجْمَعُ أَصَابِعَهُ إِلاَّ الإِبْهَامَ\n ‏\"‏ فَإِنَّ هَؤُلاَءِ تَجْمَعُ لَكَ دُنْيَاكَ وَآخِرَتَكَ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda kepada seorang lelaki yang datang kepada baginda dan bertanya bagaimana hendak berdoa kepada Tuhannya:  “Ucapkanlah: ‘Ya Allah, ampunkanlah daku, rahmatilah daku, peliharalah daku, dan rezekikanlah daku.’ ” Baginda menghimpunkan jari-jarinya kecuali ibu jari, lalu bersabda: “Doa ini merangkumi kebaikan dunia dan akhiratmu.”"
  },
  {
    "id": 13963,
    "hadith_number": 6686,
    "tajuk_hadith": "Mendapat 1000 Pahala Sehari Dengan Tasbih",
    "perawi_melayu": "Mus'ab bin Sa'd meriwayatkan bahawa bapanya memberitahu bahawa dia telah berada di sisi Rasulullah ﷺ, baginda bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مَرْوَانُ، وَعَلِيُّ بْنُ مُسْهِرٍ، عَنْ مُوسَى الْجُهَنِيِّ،\n ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا مُوسَى الْجُهَنِيُّ،\n عَنْ مُصْعَبِ بْنِ سَعْدٍ، حَدَّثَنِي أَبِي قَالَ، كُنَّا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏\n أَيَعْجِزُ أَحَدُكُمْ أَنْ يَكْسِبَ كُلَّ يَوْمٍ أَلْفَ حَسَنَةٍ ‏\"‏ ‏.‏ فَسَأَلَهُ سَائِلٌ مِنْ جُلَسَائِهِ كَيْفَ يَكْسِبُ\n أَحَدُنَا أَلْفَ حَسَنَةٍ قَالَ ‏\"‏ يُسَبِّحُ مِائَةَ تَسْبِيحَةٍ فَيُكْتَبُ لَهُ أَلْفُ حَسَنَةٍ أَوْ يُحَطُّ عَنْهُ أَلْفُ خَطِيئَةٍ\n ‏\"‏ ‏.‏",
    "malay_translation": "Abu Bakar bin Abi Syaibah telah meriwayatkan daripada Marwan dan Ali bin Mushir daripada Musa al-Juhani.  Dan Muhammad bin Abdullah bin Numair meriwayatkan – dan lafaznya daripada beliau – daripada bapanya, daripada Musa al-Juhani daripada Mus'ab bin Sa'd. Bapanya berkata: Kami berada di sisi Rasulullah SAW, baginda bersabda: “Adakah di antara kamu yang tidak mampu memperoleh seribu kebaikan setiap hari?”  Maka seorang daripada yang hadir bertanya: “Bagaimanakah salah seorang daripada kami memperoleh seribu kebaikan setiap hari?” Baginda bersabda: “Dengan bertakbir seratus kali, maka akan ditulis baginya seribu kebaikan atau dihapuskan darinya seribu kesalahan.”"
  },
  {
    "id": 13964,
    "hadith_number": 6687,
    "tajuk_hadith": "Meringankan Kesusahan Orang Lain dan Menuntut Ilmu",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الْعَلاَءِ الْهَمْدَانِيُّ\n - وَاللَّفْظُ لِيَحْيَى - قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ \n أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ نَفَّسَ عَنْ\n مُؤْمِنٍ كُرْبَةً مِنْ كُرَبِ الدُّنْيَا نَفَّسَ اللَّهُ عَنْهُ كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ وَمَنْ يَسَّرَ عَلَى مُعْسِرٍ\n يَسَّرَ اللَّهُ عَلَيْهِ فِي الدُّنْيَا وَالآخِرَةِ وَمَنْ سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ فِي الدُّنْيَا وَالآخِرَةِ وَاللَّهُ\n فِي عَوْنِ الْعَبْدِ مَا كَانَ الْعَبْدُ فِي عَوْنِ أَخِيهِ وَمَنْ سَلَكَ طَرِيقًا يَلْتَمِسُ فِيهِ عِلْمًا سَهَّلَ اللَّهُ\n لَهُ بِهِ طَرِيقًا إِلَى الْجَنَّةِ وَمَا اجْتَمَعَ قَوْمٌ فِي بَيْتٍ مِنْ بُيُوتِ اللَّهِ يَتْلُونَ كِتَابَ اللَّهِ وَيَتَدَارَسُونَهُ\n بَيْنَهُمْ إِلاَّ نَزَلَتْ عَلَيْهِمُ السَّكِينَةُ وَغَشِيَتْهُمُ الرَّحْمَةُ وَحَفَّتْهُمُ الْمَلاَئِكَةُ وَذَكَرَهُمُ اللَّهُ فِيمَنْ عِنْدَهُ\n وَمَنْ بَطَّأَ بِهِ عَمَلُهُ لَمْ يُسْرِعْ بِهِ نَسَبُهُ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa meringankan kesusahan seorang mukmin daripada kesusahan-kesusahan dunia, nescaya Allah akan meringankan kesusahannya daripada kesusahan-kesusahan hari kiamat. Dan barangsiapa memudahkan urusan orang yang susah, nescaya Allah akan memudahkan urusannya di dunia dan akhirat. Dan barangsiapa menutup aib seorang Muslim, nescaya Allah akan menutup aibnya di dunia dan akhirat.  Allah sentiasa membantu hamba-Nya selagi hamba itu membantu saudaranya. Dan barangsiapa menempuh jalan untuk menuntut ilmu, nescaya Allah akan memudahkan baginya jalan ke syurga. Dan sekumpulan manusia yang berkumpul di rumah-rumah Allah (masjid) untuk membaca kitab Allah dan mempelajarinya sesama mereka, nescaya akan turun kepada mereka ketenangan, rahmat akan meliputi mereka, malaikat akan mengelilingi mereka, dan Allah akan menyebut mereka di sisi-Nya. Dan barangsiapa yang lambat dalam beramal soleh, nescaya keturunannya yang mulia tidak akan mempercepatkannya."
  },
  {
    "id": 13965,
    "hadith_number": 6688,
    "tajuk_hadith": "Perbezaan Ringkas Sanad Hadis daripada Abu Hurairah",
    "perawi_melayu": "Daripada Abu Hurairah melalui beberapa sanad dengan sedikit perbezaan lafaz.",
    "english_text": "This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters but with a slight variation of wording.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَاهُ نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ،\n حَدَّثَنَا أَبُو أُسَامَةَ، قَالاَ حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي صَالِحٍ، وَفِي حَدِيثِ أَبِي أُسَامَةَ حَدَّثَنَا أَبُو\n صَالِحٍ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ أَبِي مُعَاوِيَةَ\n غَيْرَ أَنَّ حَدِيثَ أَبِي أُسَامَةَ لَيْسَ فِيهِ ذِكْرُ التَّيْسِيرِ عَلَى الْمُعْسِرِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Abu Hurairah melalui sanad yang lain, tetapi dengan sedikit perbezaan lafaz.  (Hadis ini diriwayatkan oleh Muhammad bin Abdullah bin Numair,  daripada bapanya, dan juga oleh Nasr bin Ali al-Jahdami, daripada Abu Usamah. Mereka berdua berkata:  kami telah mendengar daripada al-A'mash, daripada Abu Shalih, dan dalam riwayat Abu Usamah, ia menyebut: kami mendengar daripada Abu Shalih daripada Abu Hurairah, yang berkata: Rasulullah SAW telah bersabda sepertimana hadis Abu Muawiyah, kecuali hadis Abu Usamah tidak menyebut tentang kemudahan bagi orang yang susah.)"
  },
  {
    "id": 13966,
    "hadith_number": 6689,
    "tajuk_hadith": "Malaikat dan Rahmat Menyelimuti Jemaah yang Berzikir",
    "perawi_melayu": "Agharr Abi Muslim meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، سَمِعْتُ \n أَبَا إِسْحَاقَ، يُحَدِّثُ عَنِ الأَغَرِّ أَبِي مُسْلِمٍ، أَنَّهُ قَالَ أَشْهَدُ عَلَى أَبِي هُرَيْرَةَ وَأَبِي سَعِيدٍ الْخُدْرِيِّ\n أَنَّهُمَا شَهِدَا عَلَى النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ لاَ يَقْعُدُ قَوْمٌ يَذْكُرُونَ اللَّهَ عَزَّ وَجَلَّ\n إِلاَّ حَفَّتْهُمُ الْمَلاَئِكَةُ وَغَشِيَتْهُمُ الرَّحْمَةُ وَنَزَلَتْ عَلَيْهِمُ السَّكِينَةُ وَذَكَرَهُمُ اللَّهُ فِيمَنْ عِنْدَهُ ‏\"‏\n ‏.‏ \n وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا شُعْبَةُ، فِي هَذَا الإِسْنَادِ نَحْوَهُ\n ‏.‏",
    "malay_translation": "Muhammad bin Muthanna dan Ibn Bashshar berkata:  Kami telah mendengar daripada Muhammad bin Ja’far, yang meriwayatkan daripada Syu’bah; aku telah mendengar daripada Abu Ishaq yang meriwayatkan daripada al-Aghar Abu Muslim, bahawa dia berkata: Aku bersaksi ke atas Abu Hurairah dan Abu Said al-Khudri bahawa mereka berdua telah mendengar daripada Nabi SAW yang bersabda: “Tidaklah sekumpulan manusia duduk mengingati Allah SWT melainkan malaikat akan melingkungi mereka, rahmat akan menyelimuti mereka, ketenangan akan turun ke atas mereka, dan Allah SWT akan menyebut mereka di sisi-Nya.”\n\nZuhair bin Harb juga meriwayatkan kepadaku, yang meriwayatkan daripada Abdur Rahman, yang meriwayatkan daripada Syu’bah dengan sanad yang hampir sama."
  },
  {
    "id": 13967,
    "hadith_number": 6690,
    "tajuk_hadith": "Muawiyah dan Zikir di Masjid",
    "perawi_melayu": "Abu Said al-Khudri meriwayatkan bahawa Muawiyah pergi ke sebuah majlis zikir di masjid dan berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مَرْحُومُ بْنُ عَبْدِ الْعَزِيزِ، عَنْ أَبِي نَعَامَةَ السَّعْدِيِّ،\n عَنْ أَبِي عُثْمَانَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ خَرَجَ مُعَاوِيَةُ عَلَى حَلْقَةٍ فِي الْمَسْجِدِ فَقَالَ\n مَا أَجْلَسَكُمْ قَالُوا جَلَسْنَا نَذْكُرُ اللَّهَ ‏.‏ قَالَ آللَّهِ مَا أَجْلَسَكُمْ إِلاَّ ذَاكَ قَالُوا وَاللَّهِ مَا أَجْلَسَنَا\n إِلاَّ ذَاكَ ‏.‏ قَالَ أَمَا إِنِّي لَمْ أَسْتَحْلِفْكُمْ تُهْمَةً لَكُمْ وَمَا كَانَ أَحَدٌ بِمَنْزِلَتِي مِنْ رَسُولِ اللَّهِ صلى\n الله عليه وسلم أَقَلَّ عَنْهُ حَدِيثًا مِنِّي وَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ عَلَى حَلْقَةٍ\n مِنْ أَصْحَابِهِ فَقَالَ ‏\"‏ مَا أَجْلَسَكُمْ ‏\"‏ ‏.‏ قَالُوا جَلَسْنَا نَذْكُرُ اللَّهَ وَنَحْمَدُهُ عَلَى مَا هَدَانَا لِلإِسْلاَمِ\n وَمَنَّ بِهِ عَلَيْنَا ‏.‏ قَالَ ‏\"‏ آللَّهِ مَا أَجْلَسَكُمْ إِلاَّ ذَاكَ ‏\"‏ ‏.‏ قَالُوا وَاللَّهِ مَا أَجْلَسَنَا إِلاَّ ذَاكَ ‏.‏ قَالَ\n ‏\"‏ أَمَا إِنِّي لَمْ أَسْتَحْلِفْكُمْ تُهْمَةً لَكُمْ وَلَكِنَّهُ أَتَانِي جِبْرِيلُ فَأَخْبَرَنِي أَنَّ اللَّهَ عَزَّ وَجَلَّ يُبَاهِي\n بِكُمُ الْمَلاَئِكَةَ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Bakar bin Abu Syaibah meriwayatkan daripada Marhum bin Abdul Aziz, daripada Abu Nu’amah al-Sa’di, daripada Abu Uthman, daripada Abu Said al-Khudri, bahawa Muawiyah pergi ke satu majlis di masjid.  Dia bertanya, “Apakah yang menyebabkan kamu semua duduk berkumpul di sini?” Mereka menjawab, “Kami duduk untuk berzikir kepada Allah.” Muawiyah bertanya lagi, “Demi Allah, adakah tujuan kamu semua berkumpul di sini hanyalah untuk berzikir?” Mereka menjawab, “Demi Allah, ya, hanya untuk berzikir.” Muawiyah berkata, “Aku tidak bersumpah untuk menuduh kamu, dan di antara sahabat Rasulullah SAW, akulah yang paling sedikit meriwayatkan hadis.  Rasulullah SAW juga pernah pergi ke satu majlis sahabat baginda dan bertanya, ‘Apakah yang menyebabkan kamu semua duduk berkumpul di sini?’ Mereka menjawab, ‘Kami duduk untuk berzikir kepada Allah dan bersyukur kepada-Nya kerana telah memberi hidayah Islam kepada kami dan melimpahkan nikmat kepada kami.’ Rasulullah SAW bertanya, ‘Demi Allah, adakah tujuan kamu semua berkumpul di sini hanyalah untuk berzikir?’ Mereka menjawab, ‘Demi Allah, ya, hanya untuk berzikir.’ Rasulullah SAW berkata, ‘Aku tidak bersumpah untuk menuduh kamu, tetapi Jibril telah datang kepadaku dan memberitahu bahawa Allah SWT bermegah-megah dengan kamu kepada para malaikat.’”"
  },
  {
    "id": 13968,
    "hadith_number": 6691,
    "tajuk_hadith": "Istighfar Rasulullah SAW Seratus Kali Sehari",
    "perawi_melayu": "Al-Agharr al-Muzani, salah seorang sahabat Rasulullah SAW meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There is (at times) some sort of shade upon my heart, and I seek forgiveness from Allah a hundred times a day.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو الرَّبِيعِ الْعَتَكِيُّ، جَمِيعًا عَنْ حَمَّادٍ،\n قَالَ يَحْيَى أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَبِي بُرْدَةَ، عَنِ الأَغَرِّ الْمُزَنِيِّ، - وَكَانَتْ لَهُ\n صُحْبَةٌ - أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّهُ لَيُغَانُ عَلَى قَلْبِي وَإِنِّي لأَسْتَغْفِرُ\n اللَّهَ فِي الْيَوْمِ مِائَةَ مَرَّةٍ ‏\"‏ ‏.‏",
    "malay_translation": "Kadang-kadang hatiku terasa seakan-akan diliputi sesuatu, maka aku memohon keampunan daripada Allah seratus kali sehari."
  },
  {
    "id": 13969,
    "hadith_number": 6692,
    "tajuk_hadith": "Taubat Kepada Allah SWT",
    "perawi_melayu": "Al-Agharr al-Muzani, seorang daripada sahabat Rasulullah SAW, meriwayatkan bahawa Ibnu Umar menyatakan kepada beliau bahawa Rasulullah SAW bersabda:",
    "english_text": "O people, seek repentance from Allah. Verily, I seek repentance from Him a hundred times a day.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ أَبِي،\n بُرْدَةَ قَالَ سَمِعْتُ الأَغَرَّ، وَكَانَ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم يُحَدِّثُ ابْنَ عُمَرَ\n قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَا أَيُّهَا النَّاسُ تُوبُوا إِلَى اللَّهِ فَإِنِّي أَتُوبُ\n فِي الْيَوْمِ إِلَيْهِ مِائَةَ مَرَّةٍ ‏\"‏ ‏.‏",
    "malay_translation": "Wahai manusia, bertaubatlah kepada Allah. Sesungguhnya, aku bertaubat kepada-Nya seratus kali sehari."
  },
  {
    "id": 13970,
    "hadith_number": 6693,
    "tajuk_hadith": "Sanad Hadith daripada Syu'bah",
    "perawi_melayu": "Syu'bah",
    "english_text": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters.",
    "arabic_text": "حَدَّثَنَاهُ عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو دَاوُدَ،\n وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ كُلُّهُمْ عَنْ شُعْبَةَ، فِي هَذَا الإِسْنَادِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan melalui sanad yang sama daripada Syu'bah.  (Ubaidullah bin Mu'adz, Abi H, Ibnul Mutsanna, Abu Daud dan Abdurrahman bin Mahdi semuanya meriwayatkan daripada Syu'bah dalam sanad ini.)"
  },
  {
    "id": 13971,
    "hadith_number": 6694,
    "tajuk_hadith": "Taubat Sebelum Terbitnya Matahari dari Barat",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "He who seeks repentance (from the Lord) before the rising of the sun from the west (before the Day of Resurrection), Allah turns to him with Mercy.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو خَالِدٍ يَعْنِي سُلَيْمَانَ بْنَ حَيَّانَ، ح وَحَدَّثَنَا \n ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنِي أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا حَفْصٌ، - يَعْنِي ابْنَ غِيَاثٍ\n - كُلُّهُمْ عَنْ هِشَامٍ، ح وَحَدَّثَنِي أَبُو خَيْثَمَةَ، زُهَيْرُ بْنُ حَرْبٍ - وَاللَّفْظُ لَهُ - حَدَّثَنَا إِسْمَاعِيلُ،\n بْنُ إِبْرَاهِيمَ عَنْ هِشَامِ بْنِ حَسَّانَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ تَابَ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا تَابَ اللَّهُ عَلَيْهِ ‏\"‏\n ‏.‏",
    "malay_translation": "Barangsiapa bertaubat kepada Allah sebelum matahari terbit dari barat (sebelum hari kiamat), nescaya Allah akan menerima taubatnya dengan penuh rahmat."
  },
  {
    "id": 13972,
    "hadith_number": 6695,
    "tajuk_hadith": "Beradab Ketika Bertakbir dan Kekuatan Zikir \"Laa Haula Wa Laa Quwwata Illa Billah\"",
    "perawi_melayu": "Abu Musa meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، وَأَبُو مُعَاوِيَةَ عَنْ عَاصِمٍ،\n عَنْ أَبِي عُثْمَانَ، عَنْ أَبِي مُوسَى، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي سَفَرٍ فَجَعَلَ\n النَّاسُ يَجْهَرُونَ بِالتَّكْبِيرِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَيُّهَا النَّاسُ ارْبَعُوا عَلَى\n أَنْفُسِكُمْ إِنَّكُمْ لَيْسَ تَدْعُونَ أَصَمَّ وَلاَ غَائِبًا إِنَّكُمْ تَدْعُونَ سَمِيعًا قَرِيبًا وَهُوَ مَعَكُمْ ‏\"‏ ‏.‏ قَالَ\n وَأَنَا خَلْفَهُ وَأَنَا أَقُولُ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ فَقَالَ ‏\"‏ يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ أَلاَ أَدُلُّكَ\n عَلَى كَنْزٍ مِنْ كُنُوزِ الْجَنَّةِ ‏\"‏ ‏.‏ فَقُلْتُ بَلَى يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ قُلْ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ\n بِاللَّهِ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Bakar bin Abi Syaibah meriwayatkan daripada Muhammad bin Fadhl, dan Abu Muawiyah daripada Aasim, daripada Abu Usman, daripada Abu Musa, katanya: Kami bersama Nabi SAW dalam perjalanan, maka orang ramai meninggikan suara ketika bertakbir. Maka Nabi SAW bersabda: \"Wahai manusia, berhati-hatilah, sesungguhnya kamu bukan memanggil yang pekak atau yang jauh. Sesungguhnya kamu memanggil Allah yang Maha Mendengar, Maha Dekat, dan Dia bersama kamu.\" Aku berada di belakang baginda, dan aku membaca: \"Laa Haula Wa Laa Quwwata Illa Billah.\" Baginda bersabda: \"Wahai Abdullah bin Qais, tidakkah aku tunjukkan kepadamu sebuah khazanah daripada khazanah syurga?\" Aku berkata: \"Ya, wahai Rasulullah.\" Baginda bersabda: \"Bacalah: \"Laa Haula Wa Laa Quwwata Illa Billah.\""
  },
  {
    "id": 13973,
    "hadith_number": 6696,
    "tajuk_hadith": "Sanad Hadith yang Sama",
    "perawi_melayu": "Ibn Numair, Ishaq bin Ibrahim, dan Abu Sa'id al-Asyaj daripada Hafs bin Ghiyath daripada 'Asim.",
    "english_text": "This hadith has been narrated on the authority of 'Asim with the same chain of transmitters.",
    "arabic_text": "حَدَّثَنَا ابْنُ نُمَيْرٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَأَبُو سَعِيدٍ الأَشَجُّ جَمِيعًا عَنْ حَفْصِ بْنِ،\n غِيَاثٍ عَنْ عَاصِمٍ، بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏",
    "malay_translation": "Hadith ini telah diriwayatkan melalui sanad yang sama daripada 'Asim.  Ibn Numair, Ishaq bin Ibrahim, dan Abu Sa'id al-Asyaj meriwayatkan daripada Hafs bin Ghiyath, yang meriwayatkan daripada 'Asim."
  },
  {
    "id": 13974,
    "hadith_number": 6697,
    "tajuk_hadith": "La Ilaha Illallah wallahual Azim dan Laa Haula Wala Quwwata Illa Billah",
    "perawi_melayu": "Abu Musa melaporkan bahawa beliau (dan sahabat-sahabatnya yang lain) sedang mendaki bukit bersama Rasulullah SAW, dan setiap kali seseorang mendaki, dia melaungkan:",
    "english_text": "\" There is no god but Allah, Allah is the Greatest.\" Thereupon Allah's Apostle (ﷺ) said: Verily, you are not supplicating One Who is deaf or absent. He said: Abu Musa or Abdullah b Qais, should I not direct you to the words (which form) the treasure of Paradise? I said: Allah's Messenger, what are these? He said:\" There is no might and no power but that of Allah.\"",
    "arabic_text": "حَدَّثَنَا أَبُو كَامِلٍ، فُضَيْلُ بْنُ حُسَيْنٍ حَدَّثَنَا يَزِيدُ، - يَعْنِي ابْنَ زُرَيْعٍ - حَدَّثَنَا التَّيْمِيُّ،\n عَنْ أَبِي عُثْمَانَ، عَنْ أَبِي مُوسَى، أَنَّهُمْ كَانُوا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُمْ يَصْعَدُونَ\n فِي ثَنِيَّةٍ - قَالَ - فَجَعَلَ رَجُلٌ كُلَّمَا عَلاَ ثَنِيَّةً نَادَى لاَ إِلَهَ إِلاَ اللَّهُ وَاللَّهُ أَكْبَرُ - قَالَ -\n فَقَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّكُمْ لاَ تُنَادُونَ أَصَمَّ وَلاَ غَائِبًا ‏\"‏ ‏.‏ قَالَ فَقَالَ ‏\"‏\n يَا أَبَا مُوسَى - أَوْ يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ - أَلاَ أَدُلُّكَ عَلَى كَلِمَةٍ مِنْ كَنْزِ الْجَنَّةِ ‏\"‏ ‏.‏ قُلْتُ\n مَا هِيَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ ‏\"‏ ‏.‏",
    "malay_translation": "Mereka berkata, \"Tiada Tuhan melainkan Allah, Allah Maha Besar.\"  Maka Rasulullah SAW bersabda, \"Sesungguhnya kamu tidak berdoa kepada Tuhan yang pekak atau tidak hadir.\" Baginda bertanya, \"Wahai Abu Musa, atau Wahai Abdullah bin Qais, patutkah aku menunjukkan kepadamu kalimah yang merupakan harta karun syurga?\" Aku menjawab, \"Apakah kalimah itu, wahai Rasulullah?\" Baginda bersabda, \"Tiada daya dan upaya melainkan dengan izin Allah.\" "
  },
  {
    "id": 13975,
    "hadith_number": 6698,
    "tajuk_hadith": "Riwayat Abu Musa dengan sedikit perbezaan lafaz",
    "perawi_melayu": "Muhammad bin Abd al-A'la meriwayatkan daripada al-Mu'tamir, daripada bapanya, daripada Abu Uthman, daripada Abu Musa",
    "english_text": "This hadith has been transmitted on the authority of Abu Musa with a slight variation of wording.",
    "arabic_text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا الْمُعْتَمِرُ، عَنْ أَبِيهِ، حَدَّثَنَا أَبُو عُثْمَانَ، عَنْ \n أَبِي مُوسَى، قَالَ بَيْنَمَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَذَكَرَ نَحْوَهُ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Abu Musa dengan sedikit perbezaan lafaz.  (Muhammad bin Abd al-A'la meriwayatkan daripada al-Mu'tamir, daripada bapanya, daripada Abu Uthman, daripada Abu Musa yang berkata:  Ketika Rasulullah SAW ... kemudian beliau menyebut perkara yang hampir sama.)"
  },
  {
    "id": 13976,
    "hadith_number": 6699,
    "tajuk_hadith": "Perjalanan Bersama Rasulullah SAW",
    "perawi_melayu": "Abu Musa meriwayatkan:",
    "english_text": "We were along with Allah's Apostle (ﷺ) on a journey; the rest of the hadith is the same as transmitted by A'sim.",
    "arabic_text": "حَدَّثَنَا خَلَفُ بْنُ هِشَامٍ، وَأَبُو الرَّبِيعِ، قَالاَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ أَبِي،\n عُثْمَانَ عَنْ أَبِي مُوسَى، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي سَفَرٍ ‏.‏ فَذَكَرَ نَحْوَ حَدِيثِ\n عَاصِمٍ ‏.‏",
    "malay_translation": "Kami bersama Rasulullah SAW dalam satu perjalanan.  Baki riwayat hadis ini adalah sama seperti yang diriwayatkan oleh A'sim."
  },
  {
    "id": 13977,
    "hadith_number": 6700,
    "tajuk_hadith": "Kedekatan Allah SWT",
    "perawi_melayu": "Abu Musa meriwayatkan. Kami bersama Rasulullah ﷺ dalam satu ekspedisi.",
    "english_text": "\" He (the Holy Prophet) said: He Whom you are sup- plicating is nearer to every one of you than the neck of his camel.\" And there is no mention of these words:\" There is no might and no power but that of Allah.\"",
    "arabic_text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الثَّقَفِيُّ، حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنْ أَبِي عُثْمَانَ،\n عَنْ أَبِي مُوسَى، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزَاةٍ ‏.‏ فَذَكَرَ الْحَدِيثَ\n وَقَالَ فِيهِ ‏\n\"‏ وَالَّذِي تَدْعُونَهُ أَقْرَبُ إِلَى أَحَدِكُمْ مِنْ عُنُقِ رَاحِلَةِ أَحَدِكُمْ ‏\"‏ ‏.‏ وَلَيْسَ فِي حَدِيثِهِ\n ذِكْرُ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Allah SWT yang kamu seru itu lebih dekat kepada setiap kamu daripada leher unta kamu.\"  Dan tidak disebut dalam hadis ini kalimah:  \"Tiada daya dan upaya melainkan dengan izin Allah SWT.\""
  },
  {
    "id": 13978,
    "hadith_number": 6701,
    "tajuk_hadith": "Kalimat daripada Khazanah Syurga",
    "perawi_melayu": "Abu Musa Al-Ash'ari meriwayatkan bahawa Rasulullah SAW bersabda kepadanya:",
    "english_text": "Should I not direct you to the words from the treasures of Paradise, or he said: Like a treasure from the treasures of Paradise? I said: Of course, do that. Thereupon he said:\" There is no might and no power but that of Allah.\"",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ، حَدَّثَنَا عُثْمَانُ، - وَهُوَ ابْنُ\n غِيَاثٍ - حَدَّثَنَا أَبُو عُثْمَانَ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله\n عليه وسلم ‏\"‏ أَلاَ أَدُلُّكَ عَلَى كَلِمَةٍ مِنْ كُنُوزِ الْجَنَّةِ - أَوْ قَالَ - عَلَى كَنْزٍ مِنْ كُنُوزِ الْجَنَّةِ\n ‏\"‏ ‏.‏ فَقُلْتُ بَلَى ‏.‏ فَقَالَ ‏\"‏ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ ‏\"‏ ‏.‏",
    "malay_translation": "Adakah aku tidak akan menunjukkan kepadamu satu kalimah daripada khazanah syurga, atau baginda bersabda:  seperti satu khazanah daripada khazanah syurga? Aku berkata: Sudah tentu, tunjukkanlah.  Maka baginda bersabda:  \"Tiada daya dan upaya melainkan dengan izin Allah.\" "
  },
  {
    "id": 13979,
    "hadith_number": 6702,
    "tajuk_hadith": "Doa dalam Solat",
    "perawi_melayu": "Abu Bakar meriwayatkan bahawa beliau berkata kepada Rasulullah ﷺ:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ \n يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، عَنْ أَبِي بَكْرٍ، أَنَّهُ قَالَ لِرَسُولِ\n اللَّهِ صلى الله عليه وسلم عَلِّمْنِي دُعَاءً أَدْعُو بِهِ فِي صَلاَتِي قَالَ ‏\n\"‏ قُلِ اللَّهُمَّ إِنِّي ظَلَمْتُ\n نَفْسِي ظُلْمًا كَبِيرًا - وَقَالَ قُتَيْبَةُ كَثِيرًا - وَلاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ فَاغْفِرْ لِي مَغْفِرَةً مِنْ\n عِنْدِكَ وَارْحَمْنِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah bin Sa'id, telah menceritakan kepada kami Laith, dan telah menceritakan kepada kami Muhammad bin Rumh, telah memberitakan kepada kami Laith, daripada Yazid bin Abi Habib, daripada Abu al-Khair, daripada Abdullah bin Amr, daripada Abu Bakar, bahawa beliau berkata kepada Rasulullah ﷺ: \"Ajarkanlah kepadaku doa yang aku bacakan dalam solatku.\" Baginda ﷺ bersabda: \"Katakanlah: 'Ya Allah, sesungguhnya aku telah menzalimi diriku sendiri dengan kezaliman yang besar.' – dan Qutaibah berkata: (dengan kezaliman yang) banyak – dan tidaklah mengampunkan dosa melainkan Engkau, maka ampunilah aku dengan keampunan daripada sisi-Mu, dan rahmatilah aku, sesungguhnya Engkaulah Yang Maha Pengampun, lagi Maha Mengasihani.\""
  },
  {
    "id": 13980,
    "hadith_number": 6703,
    "tajuk_hadith": "Doa Abu Bakar As-Siddiq",
    "perawi_melayu": "Hadis ini diriwayatkan melalui 'Amr bin al-'As bahawa Abu Bakar As-Siddiq berkata kepada Rasulullah SAW: Wahai Rasulullah, ajarkan kepadaku doa yang boleh aku baca semasa solat dan di rumahku.",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِيهِ أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي رَجُلٌ، سَمَّاهُ وَعَمْرُو\n بْنُ الْحَارِثِ عَنْ يَزِيدَ بْنَ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ،\n يَقُولُ إِنَّ أَبَا بَكْرٍ الصِّدِّيقَ قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم عَلِّمْنِي يَا رَسُولَ اللَّهِ دُعَاءً\n أَدْعُو بِهِ فِي صَلاَتِي وَفِي بَيْتِي ‏.‏ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ اللَّيْثِ غَيْرَ أَنَّهُ قَالَ ‏\n\"‏ ظُلْمًا كَثِيرًا\n ‏\"‏ ‏.‏",
    "malay_translation": "Abu Tahir meriwayatkan kepada saya, Abdullah bin Wahb memberitahu saya, seorang lelaki (yang namanya disebut oleh Amr bin al-Harith) memberitahu saya daripada Yazid bin Abi Habib, daripada Abu al-Khair, bahawa dia mendengar Abdullah bin Amr bin al-'As berkata bahawa Abu Bakar As-Siddiq berkata kepada Rasulullah SAW:  Wahai Rasulullah, ajarkanlah kepadaku satu doa yang boleh aku baca ketika solat dan di rumahku. Kemudian, dia menyebut seperti hadis al-Laith, kecuali dia berkata, \"Zulman Kathira (ظُلْمًا كَثِيرًا)\" yang bermaksud banyak kezaliman."
  },
  {
    "id": 13981,
    "hadith_number": 6704,
    "tajuk_hadith": "Doa perlindungan daripada pelbagai fitnah dan dosa",
    "perawi_melayu": "Aisyah meriwayatkan bahawa Rasulullah SAW berdoa dengan doa-doa ini:",
    "english_text": "\" O Allah, I seek refuge in Thee from the trial of Hell-Fire; and from the torment of Hell-Fire; and from the trial of the grave and torment of the grave; and from the evil of the trial of the affluence and from the evil of the trial of poverty and I seek refuge in Thee from the evil of the turmoil of the Dajjal. O Allah, wash away my sins with snow and hail water, purify my heart from the sins as is purified the white garment from the dirt, and keep away at a distance the sins from me as yawns the distance between the East and the West; O Allah, I seek refuge in Thee from sloth, from senility, from sin, and from debt.\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لأَبِي بَكْرٍ - قَالاَ حَدَّثَنَا ابْنُ،\n نُمَيْرٍ حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَدْعُو\n بِهَؤُلاَءِ الدَّعَوَاتِ ‏\n\"‏ اللَّهُمَّ فَإِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ وَفِتْنَةِ الْقَبْرِ وَعَذَابِ\n الْقَبْرِ وَمِنْ شَرِّ فِتْنَةِ الْغِنَى وَمِنْ شَرِّ فِتْنَةِ الْفَقْرِ وَأَعُوذُ بِكَ مِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ\n اللَّهُمَّ اغْسِلْ خَطَايَاىَ بِمَاءِ الثَّلْجِ وَالْبَرَدِ وَنَقِّ قَلْبِي مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ\n مِنَ الدَّنَسِ وَبَاعِدْ بَيْنِي وَبَيْنَ خَطَايَاىَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ اللَّهُمَّ فَإِنِّي أَعُوذُ\n بِكَ مِنَ الْكَسَلِ وَالْهَرَمِ وَالْمَأْثَمِ وَالْمَغْرَمِ ‏\"‏ ‏.‏",
    "malay_translation": "Ya Allah, sesungguhnya aku berlindung kepada-Mu daripada fitnah neraka dan azab neraka, dan fitnah kubur dan azab kubur, dan daripada kejahatan fitnah kekayaan dan daripada kejahatan fitnah kefakiran, dan aku berlindung kepada-Mu daripada kejahatan fitnah Dajjal. Ya Allah, basuhlah dosa-dosaku dengan air salji dan hujan batu, sucikanlah hatiku daripada dosa-dosa sebagaimana Engkau menyucikan pakaian putih daripada kekotoran, dan jauhkanlah dosa-dosa daripada diriku sebagaimana Engkau menjauhkan jarak antara timur dan barat. Ya Allah, sesungguhnya aku berlindung kepada-Mu daripada kemalasan, daripada tua, daripada dosa, dan daripada hutang."
  },
  {
    "id": 13982,
    "hadith_number": 6705,
    "tajuk_hadith": "Sanad Hadith yang Sama daripada Hisham",
    "perawi_melayu": "Abu Kuraib, Abu Muawiyah, dan Waki' melalui Hisham",
    "english_text": "This hadith has been narrated on the authority of Hisham with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَوَكِيعٌ، عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ ‏.‏",
    "malay_translation": "Hadith ini telah diriwayatkan melalui sanad yang sama daripada Hisham.  Abu Kuraib, Abu Muawiyah dan Waki’ meriwayatkan daripada Hisham."
  },
  {
    "id": 13983,
    "hadith_number": 6706,
    "tajuk_hadith": "Doa Mencari Perlindungan daripada Kelemahan dan Ujian",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW berdoa:",
    "english_text": "\" O Allah, I seek refuge in Thee from incapacity, from indolence, from cowardice, from senility, from miserliness, and I seek refuge in Thee from the torment of the grave and from trial of the life and death.\"",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، حَدَّثَنَا ابْنُ عُلَيَّةَ، قَالَ وَأَخْبَرَنَا سُلَيْمَانُ التَّيْمِيُّ، حَدَّثَنَا أَنَسُ،\n بْنُ مَالِكٍ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْعَجْزِ\n وَالْكَسَلِ وَالْجُبْنِ وَالْهَرَمِ وَالْبُخْلِ وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ ‏\"‏\n ‏.‏",
    "malay_translation": "“Ya Allah, sesungguhnya aku memohon perlindungan kepada-Mu daripada kelemahan, kemalasan, kepengecutan, keuzuran, kedekut, dan aku memohon perlindungan kepada-Mu daripada azab kubur dan ujian hidup dan mati.”"
  },
  {
    "id": 13984,
    "hadith_number": 6707,
    "tajuk_hadith": "Ujian Hidup dan Mati",
    "perawi_melayu": "Anas meriwayatkan daripada Rasulullah SAW (doa ini) tetapi dengan sedikit perbezaan iaitu perkataan-perkataan ini tidak terdapat dalam doa tersebut:",
    "english_text": "\" From the trial of life and death.\"",
    "arabic_text": "وَحَدَّثَنَا أَبُو كَامِلٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا \n مُعْتَمِرٌ، كِلاَهُمَا عَنِ التَّيْمِيِّ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ بِمِثْلِهِ غَيْرَ أَنَّ يَزِيدَ\n لَيْسَ فِي حَدِيثِهِ قَوْلُهُ ‏\n\"‏ وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada ujian hidup dan mati."
  },
  {
    "id": 13985,
    "hadith_number": 6708,
    "tajuk_hadith": "Rasulullah s.a.w. Memohon Perlindungan daripada Keburukan dan Kedekut",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "Anas b. Malik reported that Allah's Apostle (ﷺ) used to seek refuge in Allah from such things as mentioned in the above-mentioned hadith and from 'miserliness\" too.",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ أَخْبَرَنَا ابْنُ مُبَارَكٍ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ \n أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ تَعَوَّذَ مِنْ أَشْيَاءَ ذَكَرَهَا وَالْبُخْلِ ‏.‏",
    "malay_translation": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW sentiasa memohon perlindungan daripada Allah daripada perkara-perkara yang telah disebut dalam hadith sebelum ini dan daripada kedekut."
  },
  {
    "id": 13986,
    "hadith_number": 6709,
    "tajuk_hadith": "Doa Mencari Perlindungan daripada Kedekut, Kemalasan dan Kelemahan",
    "perawi_melayu": "Anas meriwayatkan bahawa Rasulullah SAW berdoa dengan doa ini:",
    "english_text": "\" O Allah, I seek refuge in Thee from miserliness, from sloth and from decrepitude.\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ نَافِعٍ الْعَبْدِيُّ، حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ الْعَمِّيُّ، حَدَّثَنَا هَارُونُ الأَعْوَرُ،\n حَدَّثَنَا شُعَيْبُ بْنُ الْحَبْحَابِ، عَنْ أَنَسٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَدْعُو بِهَؤُلاَءِ\n الدَّعَوَاتِ ‏\n\"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبُخْلِ وَالْكَسَلِ وَأَرْذَلِ الْعُمُرِ وَعَذَابِ الْقَبْرِ وَفِتْنَةِ الْمَحْيَا\n وَالْمَمَاتِ ‏\"‏ ‏.‏",
    "malay_translation": "Anas r.a. meriwayatkan bahawa Nabi Muhammad SAW berdoa: \"Ya Allah, sesungguhnya aku berlindung kepada-Mu daripada kedekut, kemalasan, kelemahan di akhir usia, azab kubur, dan fitnah di dunia dan akhirat.\""
  },
  {
    "id": 13987,
    "hadith_number": 6710,
    "tajuk_hadith": "Rasulullah SAW Bertawakkal Kepada Allah daripada Musibah",
    "perawi_melayu": "Daripada Abu Hurairah r.a.",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، حَدَّثَنِي سُمَىٌّ،\n عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَتَعَوَّذُ مِنْ سُوءِ الْقَضَاءِ\n وَمِنْ دَرَكِ الشَّقَاءِ وَمِنْ شَمَاتَةِ الأَعْدَاءِ وَمِنْ جَهْدِ الْبَلاَءِ ‏.‏ قَالَ عَمْرٌو فِي حَدِيثِهِ قَالَ سُفْيَانُ\n أَشُكُّ أَنِّي زِدْتُ وَاحِدَةً مِنْهَا ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku, Amru An-Naqid dan Zuhri bin Harb, keduanya berkata: Telah menceritakan kepada kami Sufian bin Uyainah, telah menceritakan kepadaku Sumayyah, daripada Abu Shalih, daripada Abu Hurairah r.a., bahawa Nabi SAW sentiasa memohon perlindungan kepada Allah daripada kejahatan qada’ (takdir), daripada kemerosotan nasib, daripada kegembiraan musuh-musuh dan daripada kesusahan bala’. Amru berkata dalam riwayatnya, Sufian berkata: Aku ragu-ragu bahawa aku telah menambah satu (ayat) daripada (ayat-ayat) tersebut."
  },
  {
    "id": 13988,
    "hadith_number": 6711,
    "tajuk_hadith": "Mencari perlindungan dengan kalimah Allah",
    "perawi_melayu": "Khaula binti Hakim Sulamiyya meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، وَاللَّفْظُ، لَهُ أَخْبَرَنَا \n اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنِ الْحَارِثِ بْنِ يَعْقُوبَ، أَنَّ يَعْقُوبَ بْنَ عَبْدِ اللَّهِ، حَدَّثَهُ أَنَّهُ،\n سَمِعَ بُسْرَ بْنَ سَعِيدٍ، يَقُولُ سَمِعْتُ سَعْدَ بْنَ أَبِي وَقَّاصٍ، يَقُولُ سَمِعْتُ خَوْلَةَ بِنْتَ حَكِيمٍ السُّلَمِيَّةَ،\n تَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ نَزَلَ مَنْزِلاً ثُمَّ قَالَ أَعُوذُ بِكَلِمَاتِ\n اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ ‏.‏ لَمْ يَضُرُّهُ شَىْءٌ حَتَّى يَرْتَحِلَ مِنْ مَنْزِلِهِ ذَلِكَ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qotaibah bin Sa’id, telah menceritakan kepada kami Laits, dan telah menceritakan kepada kami Muhammad bin Rumh, dan lafaznya daripada Laits, dari Yazid bin Abi Habib, dari Al-Harits bin Ya’qub, bahawa Ya’qub bin Abdullah telah menceritakan kepadanya bahawa dia telah mendengar Busr bin Sa’id berkata: Aku telah mendengar Sa’ad bin Abi Waqqash berkata: Aku telah mendengar Khaulah binti Hakim As-Sulamiyyah berkata: Aku telah mendengar Rasulullah SAW bersabda: \n\n“Barangsiapa yang berhenti di suatu tempat, kemudian dia berkata: Aku berlindung dengan kalimah-kalimah Allah yang sempurna daripada kejahatan makhluk-makhluk yang telah diciptakan-Nya, maka tidak akan membahayakannya sesuatu pun sehingga dia meninggalkan tempat itu.”"
  },
  {
    "id": 13989,
    "hadith_number": 6712,
    "tajuk_hadith": "Mencari perlindungan dengan kalimah Allah daripada kejahatan makhluk-Nya",
    "perawi_melayu": "Khaula binti Hakim Sulamiyya meriwayatkan:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، وَأَبُو الطَّاهِرِ، كِلاَهُمَا عَنِ ابْنِ وَهْبٍ، - وَاللَّفْظُ لِهَارُونَ\n - حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، قَالَ وَأَخْبَرَنَا عَمْرٌو، - وَهُوَ ابْنُ الْحَارِثِ - أَنَّ يَزِيدَ بْنَ أَبِي،\n حَبِيبٍ وَالْحَارِثَ بْنَ يَعْقُوبَ حَدَّثَاهُ عَنْ يَعْقُوبَ بْنِ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، عَنْ بُسْرِ بْنِ سَعِيدٍ،\n عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ خَوْلَةَ بِنْتِ حَكِيمٍ السُّلَمِيَّةِ، أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صلى الله\n عليه وسلم يَقُولُ ‏\"‏ إِذَا نَزَلَ أَحَدُكُمْ مَنْزِلاً فَلْيَقُلْ أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ\n ‏.‏ فَإِنَّهُ لاَ يَضُرُّهُ شَىْءٌ حَتَّى يَرْتَحِلَ مِنْهُ ‏\"‏ ‏.‏ \n قَالَ يَعْقُوبُ وَقَالَ الْقَعْقَاعُ بْنُ حَكِيمٍ عَنْ ذَكْوَانَ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ\n قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ مَا لَقِيتُ مِنْ عَقْرَبٍ\n لَدَغَتْنِي الْبَارِحَةَ قَالَ ‏\"‏ أَمَا لَوْ قُلْتَ حِينَ أَمْسَيْتَ أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا\n خَلَقَ لَمْ تَضُرُّكَ ‏\"‏ ‏.‏",
    "malay_translation": "Kami diberitakan oleh Harun bin Ma'ruf dan Abu Thahir, kedua-duanya daripada Ibnu Wahb - dan lafaz daripada Harun -  kami diberitakan oleh Abdullah bin Wahb, katanya dan memberitakan kepada kami Amru - iaitu Ibnu Al-Harith - bahawa Yazid bin Abi Habib dan Al-Harith bin Ya'qub memberitakan kepadanya daripada Ya'qub bin Abdullah bin Asyaj, daripada Busr bin Sa'id, daripada Sa'd bin Abi Waqqas, daripada Khaulah binti Hakim As-Sulamiyyah, bahawa dia mendengar Rasulullah SAW bersabda:  \"Apabila seseorang di antara kamu menetap di suatu tempat, maka hendaklah dia berkata:  Aku berlindung dengan kalimah-kalimah Allah yang sempurna daripada kejahatan apa yang Dia ciptakan.  Maka nescaya tidak akan membahayakannya sesuatu pun sehingga dia berpindah dari tempat itu.\"  Ya'qub berkata, dan Al-Qa'qa' bin Hakim berkata daripada Zakwan Abu Shalih, daripada Abu Hurairah bahawa dia berkata: Seorang lelaki datang kepada Nabi SAW lalu berkata: Wahai Rasulullah, saya telah dipatuk kala jengking semalam.  Baginda bersabda:  \"Sekiranya engkau membaca ketika masuk malam: Aku berlindung dengan kalimah-kalimah Allah yang sempurna daripada kejahatan apa yang Dia ciptakan, nescaya ia tidak akan membahayakanmu.\""
  },
  {
    "id": 13990,
    "hadith_number": 6713,
    "tajuk_hadith": "Hadis daripada Abu Hurairah tentang Sengatan Kala Jengking",
    "perawi_melayu": "Daripada Isa bin Hammad al-Misri, yang memberitakan kepadaku daripada Laith, daripada Yazid bin Abi Habib, daripada Ja'far, daripada Ya'qub, bahawa ia telah menceritakan kepadanya bahawa Abu Shalih, hamba sahaya Ghafari telah memberitakan kepadanya bahawa ia telah mendengar Abu Hurairah berkata:",
    "english_text": "This hadith has been transmitted on the authority of Abu Huraira with a slight variation of wording.",
    "arabic_text": "وَحَدَّثَنِي عِيسَى بْنُ حَمَّادٍ الْمِصْرِيُّ، أَخْبَرَنِي اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ \n جَعْفَرٍ، عَنْ يَعْقُوبَ، أَنَّهُ ذَكَرَ لَهُ أَنَّ أَبَا صَالِحٍ، مَوْلَى غَطَفَانَ أَخْبَرَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ\n قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ لَدَغَتْنِي عَقْرَبٌ ‏.‏ بِمِثْلِ حَدِيثِ ابْنِ وَهْبٍ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Abu Hurairah dengan sedikit perbezaan lafaz.  Seorang lelaki berkata, \"Wahai Rasulullah, saya telah disengat kala jengking.\" (Riwayat ini serupa dengan riwayat Ibnu Wahb)."
  },
  {
    "id": 13991,
    "hadith_number": 6714,
    "tajuk_hadith": "Doa Sebelum Tidur untuk Mendapat Kematian dalam Keadaan Islam",
    "perawi_melayu": "Al-Bara' b. 'Azib meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لِعُثْمَانَ - قَالَ إِسْحَاقُ\n أَخْبَرَنَا وَقَالَ، عُثْمَانُ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، حَدَّثَنِي الْبَرَاءُ بْنُ عَازِبٍ،\n أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا أَخَذْتَ مَضْجَعَكَ فَتَوَضَّأْ وُضُوءَكَ لِلصَّلاَةِ\n ثُمَّ اضْطَجِعْ عَلَى شِقِّكَ الأَيْمَنِ ثُمَّ قُلِ اللَّهُمَّ إِنِّي أَسْلَمْتُ وَجْهِي إِلَيْكَ وَفَوَّضْتُ أَمْرِي إِلَيْكَ\n وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ رَغْبَةً وَرَهْبَةً إِلَيْكَ لاَ مَلْجَأَ وَلاَ مَنْجَا مِنْكَ إِلاَّ إِلَيْكَ آمَنْتُ بِكِتَابِكَ الَّذِي\n أَنْزَلْتَ وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ وَاجْعَلْهُنَّ مِنْ آخِرِ كَلاَمِكَ فَإِنْ مُتَّ مِنْ لَيْلَتِكَ مُتَّ وَأَنْتَ عَلَى\n الْفِطْرَةِ ‏\"‏ ‏.‏ قَالَ فَرَدَّدْتُهُنَّ لأَسْتَذْكِرَهُنَّ فَقُلْتُ آمَنْتُ بِرَسُولِكَ الَّذِي أَرْسَلْتَ قَالَ ‏\"‏ قُلْ آمَنْتُ\n بِنَبِيِّكَ الَّذِي أَرْسَلْتَ ‏\"‏ ‏.‏",
    "malay_translation": "Kami diberitakan oleh Usman bin Abi Syaibah dan Ishak bin Ibrahim – dan lafaznya daripada Usman – Ishak berkata: “Aku diberitakan, dan Usman berkata: Kami diberitakan oleh Jarir daripada Mansur, daripada Saad bin Ubaidah, bahawa Al-Bara’ bin Azib telah memberitakan kepadaku bahawa Rasulullah SAW bersabda:  “Apabila engkau hendak tidur, maka berwuduklah sepertimana engkau berwuduk untuk solat, kemudian baringlah di sisi kananmu, lalu bacalah:  ‘Ya Allah, sesungguhnya aku pasrahkan wajahku kepada-Mu dan aku serahkan urusanku kepada-Mu, dan aku berlindung di belakang-Mu dengan penuh harap dan takut kepada-Mu. Tiada tempat perlindungan dan penyelamat daripada-Mu melainkan kepada-Mu. Aku beriman kepada kitab-Mu yang telah Engkau turunkan dan kepada Nabi-Mu yang telah Engkau utus.’  Jadikanlah doa ini sebagai kata-kata terakhirmu sebelum tidur, kerana jika engkau mati pada malam itu, maka engkau akan mati dalam keadaan Islam (Fitrah).”  Beliau berkata: Aku mengulang-ulang perkataan itu untuk mengingatnya, lalu aku berkata:  “Aku beriman kepada Rasul-Mu yang telah Engkau utus.” Baginda bersabda: “Katakanlah: ‘Aku beriman kepada Nabi-Mu yang telah Engkau utus.’”"
  },
  {
    "id": 13992,
    "hadith_number": 6715,
    "tajuk_hadith": "Kegembiraan Pagi",
    "perawi_melayu": "Hadis ini diriwayatkan daripada al-Bara’ b. ‘Azib dengan sedikit variasi perkataan dan terdapat tambahan dalam hadis yang diriwayatkan daripada Husain:",
    "english_text": "\" In case you get up in the morning, you will get up with bliss.\"",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ، - يَعْنِي ابْنَ إِدْرِيسَ - قَالَ\n سَمِعْتُ حُصَيْنًا، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم\n ‏.‏ بِهَذَا الْحَدِيثِ غَيْرَ أَنَّ مَنْصُورًا أَتَمُّ حَدِيثًا وَزَادَ فِي حَدِيثِ حُصَيْنٍ ‏\n\"‏ وَإِنْ أَصْبَحَ أَصَابَ\n خَيْرًا ‏\"‏ ‏.‏",
    "malay_translation": "Jika kamu bangun pada waktu pagi, nescaya kamu akan bangun dengan kebaikan."
  },
  {
    "id": 13993,
    "hadith_number": 6716,
    "tajuk_hadith": "Doa Sebelum Tidur",
    "perawi_melayu": "Al-Bara' bin Azib meriwayatkan bahawa Rasulullah SAW memerintahkan seseorang (dengan kata-kata ini):",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا ابْنُ بَشَّارٍ، حَدَّثَنَا \n عَبْدُ الرَّحْمَنِ، وَأَبُو دَاوُدَ قَالاَ حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، قَالَ سَمِعْتُ سَعْدَ بْنَ عُبَيْدَةَ،\n يُحَدِّثُ عَنِ الْبَرَاءِ بْنِ عَازِبٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ رَجُلاً إِذَا أَخَذَ مَضْجَعَهُ\n مِنَ اللَّيْلِ أَنْ يَقُولَ ‏\n\"‏ اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ وَوَجَّهْتُ وَجْهِي إِلَيْكَ وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ\n وَفَوَّضْتُ أَمْرِي إِلَيْكَ رَغْبَةً وَرَهْبَةً إِلَيْكَ لاَ مَلْجَأَ وَلاَ مَنْجَا مِنْكَ إِلاَّ إِلَيْكَ آمَنْتُ بِكِتَابِكَ الَّذِي\n أَنْزَلْتَ وَبِرَسُولِكَ الَّذِي أَرْسَلْتَ ‏.‏ فَإِنْ مَاتَ مَاتَ عَلَى الْفِطْرَةِ ‏\"‏ ‏.‏ وَلَمْ يَذْكُرِ ابْنُ بَشَّارٍ فِي\n حَدِيثِهِ مِنَ اللَّيْلِ ‏.‏",
    "malay_translation": "Muhammad bin Muthanna telah meriwayatkan daripada Abu Daud, yang meriwayatkan daripada Syu'bah, dan juga Ibnu Bashshar telah meriwayatkan daripada Abdur Rahman, dan Abu Daud berkata: Kami telah meriwayatkan daripada Syu'bah, daripada Amru bin Murrah, katanya: Aku telah mendengar Saad bin Ubaidah meriwayatkan daripada Al-Bara' bin Azib bahawa Rasulullah SAW memerintahkan seseorang apabila hendak tidur pada waktu malam supaya membaca doa ini: \"Ya Allah, aku menyerahkan diriku kepada-Mu, dan aku menghadapkan wajahku kepada-Mu, dan aku berserah kepada-Mu, dan aku bertawakkal kepada-Mu, kerana redha dan takut kepada-Mu. Tiada tempat berlindung dan penyelamat daripada-Mu melainkan kepada-Mu. Aku beriman kepada kitab yang telah Engkau turunkan dan kepada Rasul yang telah Engkau utuskan.\" Maka jika dia mati, dia mati dalam keadaan fitrah. Ibnu Bashshar tidak menyebut perkataan \"malam\" dalam riwayat hadisnya."
  },
  {
    "id": 13994,
    "hadith_number": 6717,
    "tajuk_hadith": "Meninggal Dunia dalam Keadaan Fitrah",
    "perawi_melayu": "Hadis ini diriwayatkan daripada al-Bara' bin 'Azib bahawa Rasulullah SAW bersabda kepada seseorang:",
    "english_text": "O, so and so, as you go to your bed; the rest of the hadith is the same but with this variation of wording that he said:\" Thine Apostle whom Thou sent.\" If you die that night you would die on Fitra and if you get up in the morning you would get up with a bliss.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ بْنِ،\n عَازِبٍ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِرَجُلٍ ‏\"‏ يَا فُلاَنُ إِذَا أَوَيْتَ إِلَى فِرَاشِكَ\n ‏\"‏ ‏.‏ بِمِثْلِ حَدِيثِ عَمْرِو بْنِ مُرَّةَ غَيْرَ أَنَّهُ قَالَ ‏\"‏ وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ ‏.‏ فَإِنْ مُتَّ مِنْ لَيْلَتِكَ\n مُتَّ عَلَى الْفِطْرَةِ وَإِنْ أَصْبَحْتَ أَصَبْتَ خَيْرًا ‏\"‏ ‏.‏",
    "malay_translation": "Wahai fulan, apabila engkau menuju ke tempat tidurmu… (sebahagian hadis ini sama seperti hadis Amru bin Murrah, cuma dengan sedikit perbezaan lafaz iaitu baginda bersabda), “…dan dengan NabiMu yang Engkau utus.” Jika engkau meninggal dunia pada malam itu, engkau akan meninggal dunia dalam keadaan fitrah, dan jika engkau bangun pada pagi harinya, engkau akan bangun dengan kebaikan."
  },
  {
    "id": 13995,
    "hadith_number": 6718,
    "tajuk_hadith": "Kegembiraan Pagi",
    "perawi_melayu": "Hadis ini diriwayatkan daripada al-Bara’ bin ‘Azib bahawa Rasulullah SAW memerintahkan seseorang (dengan kata-kata ini) dan tiada sebutan mengenainya:",
    "english_text": "\" if you get up in the morning you would get up with a bliss.\"",
    "arabic_text": "حَدَّثَنَا ابْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي،\n إِسْحَاقَ أَنَّهُ سَمِعَ الْبَرَاءَ بْنَ عَازِبٍ، يَقُولُ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَجُلاً ‏.‏ بِمِثْلِهِ\n وَلَمْ يَذْكُرْ ‏\n\"‏ وَإِنْ أَصْبَحْتَ أَصَبْتَ خَيْرًا ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Ibn al-Muthanna dan Ibn Bashshar yang berkata: “Kami telah mendengar daripada Muhammad bin Ja’far, yang telah mendengar daripada Syu’bah, daripada Abi Ishaq bahawa dia telah mendengar al-Bara’ bin ‘Azib berkata, ‘Rasulullah SAW memerintahkan seseorang (dengan kata-kata) dan tidak menyebutnya iaitu, “Dan sesungguhnya jika kamu bangun di pagi hari, nescaya kamu akan mendapat kebaikan.”’"
  },
  {
    "id": 13996,
    "hadith_number": 6719,
    "tajuk_hadith": "Doa Nabi Sebelum Tidur dan Selepas Bangun",
    "perawi_melayu": "Al-Bara' meriwayatkan bahawa setiap kali Rasulullah SAW hendak tidur, baginda bersabda:",
    "english_text": "\" O Allah, it is with Thine Name that I live and it is with Thine Name that I die.\" And when he got up he used to say:\" Praise is due to Allah, Who gave us life after our death (sleep) and unto Thee is resurrection.\"",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي السَّفَرِ،\n عَنْ أَبِي بَكْرِ بْنِ أَبِي مُوسَى، عَنِ الْبَرَاءِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا أَخَذَ مَضْجَعَهُ\n قَالَ ‏\"‏ اللَّهُمَّ بِاسْمِكَ أَحْيَا وَبِاسْمِكَ أَمُوتُ ‏\"‏ ‏.‏ وَإِذَا اسْتَيْقَظَ قَالَ ‏\"‏ الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا\n بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ ‏\"‏ ‏.‏",
    "malay_translation": "Al-Bara’ meriwayatkan bahawa Nabi Muhammad SAW, apabila hendak tidur, baginda berdoa:  \"Ya Allah, dengan nama-Mu aku hidup dan dengan nama-Mu aku mati.\"  Dan apabila baginda bangun tidur, baginda berdoa: \"Segala puji bagi Allah yang telah memberikan kehidupan kepada kami setelah kematian (tidur) kami, dan kepada-Nya lah tempat kembali (kebangkitan).\""
  },
  {
    "id": 13997,
    "hadith_number": 6720,
    "tajuk_hadith": "Doa Sebelum Tidur daripada Rasulullah SAW",
    "perawi_melayu": "Abdullah bin Umar memerintahkan seseorang supaya apabila hendak tidur, dia membaca:",
    "english_text": "\" O Allah, Thou created my being and it is for Thee to take it to its ultimate goal. And its death and life is due to Thee, and if Thou givest it life, safeguard it; and if Thou bringst death, grant it pardon. O Allah, I beg of Thee safety.\" A person said to him: Did you hear it from Umar? Thereupon he said: (I have heard from one) who is better than Umar, viz. from Allah's Messenger (ﷺ). Ibn Nafi, reported this on the authority of Abdullah b. Harith but he did not make mention of this\" that he heard it himself\".",
    "arabic_text": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ، وَأَبُو بَكْرِ بْنُ نَافِعٍ قَالاَ حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ،\n عَنْ خَالِدٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ الْحَارِثِ، يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ أَمَرَ رَجُلاً إِذَا\n أَخَذَ مَضْجَعَهُ قَالَ ‏\n\"‏ اللَّهُمَّ خَلَقْتَ نَفْسِي وَأَنْتَ تَوَفَّاهَا لَكَ مَمَاتُهَا وَمَحْيَاهَا إِنْ أَحْيَيْتَهَا\n فَاحْفَظْهَا وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ ‏\"‏ ‏.‏ فَقَالَ لَهُ رَجُلٌ أَسَمِعْتَ هَذَا\n مِنْ عُمَرَ فَقَالَ مِنْ خَيْرٍ مِنْ عُمَرَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ ابْنُ نَافِعٍ فِي\n رِوَايَتِهِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ ‏.‏ وَلَمْ يَذْكُرْ سَمِعْتُ ‏.‏",
    "malay_translation": "“Ya Allah, Engkau telah menciptakan jiwaku dan Engkaulah yang akan mencabutnya. Kematian dan kehidupan jiwaku adalah di tangan-Mu. Jika Engkau memberi kehidupan kepadanya, peliharalah ia; dan jika Engkau mendatangkan kematian kepadanya, ampunilah ia. Ya Allah, aku memohon kepada-Mu keselamatan.” Seorang lelaki bertanya kepadanya: “Adakah engkau mendengar doa ini daripada Umar?”  Lalu dia menjawab: “(Aku mendengarnya daripada seseorang) yang lebih baik daripada Umar, iaitu daripada Rasulullah SAW.” Ibn Nafi’ meriwayatkan hadis ini daripada Abdullah bin Harith, tetapi dia tidak menyebut bahawa dia sendiri mendengarnya."
  },
  {
    "id": 13998,
    "hadith_number": 6721,
    "tajuk_hadith": "Doa Sebelum Tidur",
    "perawi_melayu": "Suhail meriwayatkan bahawa Abu Salih biasa memerintahkan kami (dengan kata-kata ini):",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، قَالَ كَانَ أَبُو صَالِحٍ يَأْمُرُنَا إِذَا\n أَرَادَ أَحَدُنَا أَنْ يَنَامَ أَنْ يَضْطَجِعَ عَلَى شِقِّهِ الأَيْمَنِ ثُمَّ يَقُولُ ‏\n\"‏ اللَّهُمَّ رَبَّ السَّمَوَاتِ وَرَبَّ الأَرْضِ\n وَرَبَّ الْعَرْشِ الْعَظِيمِ رَبَّنَا وَرَبَّ كُلِّ شَىْءٍ فَالِقَ الْحَبِّ وَالنَّوَى وَمُنْزِلَ التَّوْرَاةِ وَالإِنْجِيلِ\n وَالْفُرْقَانِ أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَىْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ اللَّهُمَّ أَنْتَ الأَوَّلُ فَلَيْسَ قَبْلَكَ شَىْءٌ\n وَأَنْتَ الآخِرُ فَلَيْسَ بَعْدَكَ شَىْءٌ وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَىْءٌ وَأَنْتَ الْبَاطِنُ فَلَيْسَ\n دُونَكَ شَىْءٌ اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ ‏\"‏ ‏.‏ وَكَانَ يَرْوِي ذَلِكَ عَنْ أَبِي هُرَيْرَةَ عَنِ\n النَّبِيِّ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Suhail meriwayatkan bahawa Abu Salih biasa memerintahkan kami, apabila salah seorang daripada kami hendak tidur, hendaklah berbaring di sisi kanannya, kemudian berkata: \"Ya Allah, Tuhan sekalian langit dan Tuhan sekalian bumi, dan Tuhan Arasy yang Agung, Tuhan kami dan Tuhan segala sesuatu, Yang memecahkan biji benih dan isi buah kurma, dan Yang menurunkan Taurat dan Injil dan Al-Furqan (Al-Quran), aku berlindung kepada-Mu daripada kejahatan setiap sesuatu yang Engkau pegang ubun-ubunnya. Ya Allah, Engkaulah Yang Pertama, tiada sesuatu pun sebelum Engkau, dan Engkaulah Yang Akhir, tiada sesuatu pun selepas Engkau, dan Engkaulah Yang Zahir, tiada sesuatu pun di atas Engkau, dan Engkaulah Yang Bathin, tiada sesuatu pun di bawah Engkau.  Lunaskanlah hutang kami dan cukupkanlah rezeki kami daripada kefakiran.\" Dan beliau meriwayatkannya daripada Abu Hurairah daripada Rasulullah SAW."
  },
  {
    "id": 13999,
    "hadith_number": 6722,
    "tajuk_hadith": "Doa perlindungan daripada kejahatan haiwan",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW telah memerintahkan kita supaya apabila kita hendak tidur, kita membaca doa ini dan baginda juga bersabda:",
    "english_text": "\" From the evil of every animal, Thou hast hold upon its forelock (Thou hast full control over it).\"",
    "arabic_text": "وَحَدَّثَنِي عَبْدُ الْحَمِيدِ بْنُ بَيَانٍ الْوَاسِطِيُّ، حَدَّثَنَا خَالِدٌ، - يَعْنِي الطَّحَّانَ - عَنْ سُهَيْلٍ،\n عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَأْمُرُنَا إِذَا أَخَذْنَا مَضْجَعَنَا\n أَنْ نَقُولَ ‏.‏ بِمِثْلِ حَدِيثِ جَرِيرٍ وَقَالَ ‏\n\"‏ مِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ‏\"‏ ‏.‏",
    "malay_translation": "Daripada kejahatan setiap haiwan, Engkau memegang ubun-ubunnya (Engkau mempunyai kawalan penuh ke atasnya)."
  },
  {
    "id": 14000,
    "hadith_number": 6723,
    "tajuk_hadith": "Doa Fatimah untuk Meminta Pembantu",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Fatimah (anak perempuan Nabi) datang kepada Rasulullah ﷺ dan meminta seorang hamba.",
    "english_text": "Say:\" O Allah, the Lord of the seven heavens\" ; the rest of the hadith is the same.",
    "arabic_text": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا أَبُو أُسَامَةَ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي،\n شَيْبَةَ وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا ابْنُ أَبِي عُبَيْدَةَ، حَدَّثَنَا أَبِي كِلاَهُمَا، عَنِ الأَعْمَشِ، عَنْ أَبِي،\n صَالِحٍ عَنْ أَبِي هُرَيْرَةَ، قَالَ أَتَتْ فَاطِمَةُ النَّبِيَّ صلى الله عليه وسلم تَسْأَلُهُ خَادِمًا فَقَالَ\n لَهَا ‏\n\"‏ قُولِي اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ ‏\"‏ ‏.‏ بِمِثْلِ حَدِيثِ سُهَيْلٍ عَنْ أَبِيهِ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Fatimah, anak perempuan Nabi SAW, datang kepada Rasulullah SAW meminta seorang hamba. Baginda bersabda kepadanya, \"Katakanlah: Ya Allah, Tuhan yang memiliki tujuh langit.\""
  },
  {
    "id": 14001,
    "hadith_number": 6724,
    "tajuk_hadith": "Doa Sebelum Tidur dan Membersihkan Tempat Tidur",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى الأَنْصَارِيُّ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ،\n حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ الْمَقْبُرِيُّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله\n عليه وسلم قَالَ ‏\n\"‏ إِذَا أَوَى أَحَدُكُمْ إِلَى فِرَاشِهِ فَلْيَأْخُذْ دَاخِلَةَ إِزَارِهِ فَلْيَنْفُضْ بِهَا فِرَاشَهُ\n وَلْيُسَمِّ اللَّهَ فَإِنَّهُ لاَ يَعْلَمُ مَا خَلَفَهُ بَعْدَهُ عَلَى فِرَاشِهِ فَإِذَا أَرَادَ أَنْ يَضْطَجِعَ فَلْيَضْطَجِعْ عَلَى\n شِقِّهِ الأَيْمَنِ وَلْيَقُلْ سُبْحَانَكَ اللَّهُمَّ رَبِّي بِكَ وَضَعْتُ جَنْبِي وَبِكَ أَرْفَعُهُ إِنْ أَمْسَكْتَ نَفْسِي\n فَاغْفِرْ لَهَا وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Ishak bin Musa al-Ansari, daripada Anas bin Iyad, daripada Ubaidullah, daripada Sa’id bin Abi Sa’id al-Maqburi daripada bapanya, daripada Abu Hurairah bahawa Rasulullah SAW bersabda:  \"Apabila salah seorang daripada kamu hendak tidur di atas katilnya, hendaklah dia mengambil hujung kain sarungnya lalu membersihkan tempat tidurnya dengannya dan menyebut nama Allah SWT kerana sesungguhnya dia tidak tahu apa yang ditinggalkan di belakangnya di atas tempat tidurnya. Kemudian apabila dia hendak baring, hendaklah dia baring di sisi kanannya dan berdoa:  'Maha Suci Engkau Ya Allah Tuhanku, dengan izinMu aku membaringkan diriku dan dengan izinMu aku bangun. Jika Engkau mencabut nyawaku, maka ampunilah ia. Jika Engkau mengembalikannya, maka peliharalah ia sebagaimana Engkau memelihara hamba-hambaMu yang soleh.'\""
  },
  {
    "id": 14002,
    "hadith_number": 6725,
    "tajuk_hadith": "Doa Sebelum Tidur",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Ubaidullah bin Umar dengan sanad yang sama, dan beliau berkata:",
    "english_text": "Then utter:\" My Lord. with Thine name I place my side and if Thou keepest me alive have mercy upon myself\"",
    "arabic_text": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا عَبْدَةُ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، بِهَذَا الإِسْنَادِ وَقَالَ ‏\n\"‏\n ثُمَّ لْيَقُلْ بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي فَإِنْ أَحْيَيْتَ نَفْسِي فَارْحَمْهَا ‏\"‏ ‏.‏",
    "malay_translation": "Kemudian hendaklah dia berkata: \"Dengan nama-Mu Ya Tuhanku, aku menyandarkan tubuhku. Jika Engkau menghidupkanku semula, maka rahmatilah aku.\""
  },
  {
    "id": 14003,
    "hadith_number": 6726,
    "tajuk_hadith": "Doa Sebelum Tidur",
    "perawi_melayu": "Anas meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "When you go to bed, say:\" Praise is due to Allah Who fed us, provided us drink, sufficed us and provided us with shelter, for many a people there is none to suffice and none to provide shelter.\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ \n ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا أَوَى إِلَى فِرَاشِهِ قَالَ ‏\n\"‏ الْحَمْدُ\n لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَكَفَانَا وَآوَانَا فَكَمْ مِمَّنْ لاَ كَافِيَ لَهُ وَلاَ مُئْوِيَ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila kamu hendak tidur, bacalah: \"Segala puji bagi Allah SWT yang telah memberi makan kepada kami, memberi minum kepada kami, mencukupi keperluan kami dan memberi tempat perlindungan kepada kami.  Betapa ramai manusia yang tidak mempunyai orang yang mencukupi keperluan mereka dan tidak mempunyai tempat perlindungan.\""
  },
  {
    "id": 14004,
    "hadith_number": 6727,
    "tajuk_hadith": "Doa Rasulullah SAW memohon perlindungan daripada kejahatan perbuatan diri sendiri",
    "perawi_melayu": "Farwa' b. Naufal Ashja'i meriwayatkan:",
    "english_text": "I asked: 'A'isha, in what words did Allah's Messenger (ﷺ) supplicate Allah? She said that he used to utter:\" I seek refuge in Thee from the evil of what I did and from the evil of what I did not.\"",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لِيَحْيَى - قَالاَ أَخْبَرَنَا \n جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ هِلاَلٍ، عَنْ فَرْوَةَ بْنِ نَوْفَلٍ الأَشْجَعِيِّ، قَالَ سَأَلْتُ عَائِشَةَ عَمَّا كَانَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم يَدْعُو بِهِ اللَّهَ قَالَتْ كَانَ يَقُولُ ‏\n\"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ\n شَرِّ مَا عَمِلْتُ وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ ‏\"‏ ‏.‏",
    "malay_translation": "Aku bertanya kepada Aisyah: “Wahai Aisyah, dengan apakah Rasulullah SAW berdoa kepada Allah?” Jawabnya: “Baginda selalu berdoa: ‘Ya Allah, sesungguhnya aku berlindung kepadaMu daripada kejahatan segala amalku dan daripada kejahatan segala amal yang tidak aku kerjakan.’”"
  },
  {
    "id": 14005,
    "hadith_number": 6728,
    "tajuk_hadith": "Doa Rasulullah SAW memohon perlindungan daripada kejahatan amalan dan juga kejahatan yang tidak dilakukan",
    "perawi_melayu": "Farwa bin Naufal meriwayatkan:",
    "english_text": "I asked 'A'isha about the supplication that Allah's Messenger (ﷺ) made. She said that he used to say:\" O Allah, I seek refuge in Thee from the evil of what I have done and from the evil of what I have not done.\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ \n حُصَيْنٍ، عَنْ هِلاَلٍ، عَنْ فَرْوَةَ بْنِ نَوْفَلٍ، قَالَ سَأَلْتُ عَائِشَةَ عَنْ دُعَاءٍ، كَانَ يَدْعُو بِهِ رَسُولُ\n اللَّهِ صلى الله عليه وسلم فَقَالَتْ كَانَ يَقُولُ ‏\n\"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَشَرِّ\n مَا لَمْ أَعْمَلْ ‏\"‏ ‏.‏",
    "malay_translation": "Aku bertanya kepada Aisyah tentang doa yang dibacakan oleh Rasulullah SAW.  Beliau berkata bahawa baginda selalu berdoa: \"Ya Allah, sesungguhnya aku berlindung kepada-Mu daripada kejahatan apa yang telah aku lakukan dan daripada kejahatan apa yang aku tidak lakukan.\""
  },
  {
    "id": 14006,
    "hadith_number": 6729,
    "tajuk_hadith": "Sanad Hadith Daripada Muhammad bin Ja'far",
    "perawi_melayu": "Muhammad bin Muthanna dan Ibnu Bashshar",
    "english_text": "This hadith has been narrated on the authority of Muhammad b. ja'far through another chain of transmitters.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، ح وَحَدَّثَنَا مُحَمَّدُ،\n بْنُ عَمْرِو بْنِ جَبَلَةَ حَدَّثَنَا مُحَمَّدٌ، - يَعْنِي ابْنَ جَعْفَرٍ - كِلاَهُمَا عَنْ شُعْبَةَ، عَنْ حُصَيْنٍ، بِهَذَا\n الإِسْنَادِ مِثْلَهُ غَيْرَ أَنَّ فِي حَدِيثِ مُحَمَّدِ بْنِ جَعْفَرٍ ‏\n\"‏ وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Muhammad bin Ja'far melalui sanad (rantaian periwayat) yang lain.  Muhammad bin Muthanna dan Ibnu Bashshar berkata:  Kami mendengar daripada Ibnu Abi ‘Udy, dan Muhammad bin ‘Amr bin Jabalah berkata: Kami mendengar daripada Muhammad (iaitu Muhammad bin Ja’far). Kedua-duanya meriwayatkan daripada Syu’bah, daripada Husain, dengan sanad yang serupa, kecuali dalam riwayat Muhammad bin Ja’far terdapat tambahan:  “Dan daripada kejahatan apa yang tidak aku kerjakan.”"
  },
  {
    "id": 14007,
    "hadith_number": 6730,
    "tajuk_hadith": "Doa Mencari Perlindungan daripada Kejahatan Amalan",
    "perawi_melayu": "Farwa' bin Naufal meriwayatkan daripada Aisyah bahawa Rasulullah SAW berdoa:",
    "english_text": "\" O Allah, I seek refuge in Thee from the evil of what I did and from the evil of what I did not.\"",
    "arabic_text": "وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ هَاشِمٍ، حَدَّثَنَا وَكِيعٌ، عَنِ الأَوْزَاعِيِّ، عَنْ عَبْدَةَ بْنِ أَبِي لُبَابَةَ،\n عَنْ هِلاَلِ بْنِ يَسَافٍ، عَنْ فَرْوَةَ بْنِ نَوْفَلٍ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ\n يَقُولُ فِي دُعَائِهِ ‏\n\"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَشَرِّ مَا لَمْ أَعْمَلْ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Farwa' bin Naufal, melalui Aisyah r.a., bahawa Nabi SAW berdoa: \"Ya Allah, sesungguhnya aku berlindung kepada-Mu daripada kejahatan amalku dan kejahatan apa yang tidak aku lakukan.\""
  },
  {
    "id": 14008,
    "hadith_number": 6731,
    "tajuk_hadith": "Doa Keselamatan dan Tawakkal kepada Allah",
    "perawi_melayu": "Ibn 'Abbas meriwayatkan bahawa Rasulullah SAW berdoa:",
    "english_text": "\" O Allah, it is unto Thee that I surrender myself. I affirm my faith in Thee and repose my trust in Thee and turn to Thee in repentance and with Thy help fought my adversaries. O Allah, I seek refuge in Thee with Thine Power; there is no god but Thou, lest Thou leadest me astray. Thou art ever-living that dieth not, while the Jinn and mankind die.\"",
    "arabic_text": "حَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَمْرٍو أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ،\n حَدَّثَنَا الْحُسَيْنُ، حَدَّثَنِي ابْنُ بُرَيْدَةَ، عَنْ يَحْيَى بْنِ يَعْمُرَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى\n الله عليه وسلم كَانَ يَقُولُ ‏\n\"‏ اللَّهُمَّ لَكَ أَسْلَمْتُ وَبِكَ آمَنْتُ وَعَلَيْكَ تَوَكَّلْتُ وَإِلَيْكَ أَنَبْتُ وَبِكَ\n خَاصَمْتُ اللَّهُمَّ إِنِّي أَعُوذُ بِعِزَّتِكَ لاَ إِلَهَ إِلاَّ أَنْتَ أَنْ تُضِلَّنِي أَنْتَ الْحَىُّ الَّذِي لاَ يَمُوتُ وَالْجِنُّ\n وَالإِنْسُ يَمُوتُونَ ‏\"‏ ‏.‏",
    "malay_translation": "Ya Allah, kepadaMu aku berserah diri. Aku mengaku keimanan kepadaMu, dan aku bertawakkal kepadaMu, dan kepadaMu aku bertaubat, dan dengan pertolonganMu aku melawan musuh-musuhku. Ya Allah, aku berlindung kepadaMu dengan keagunganMu, tiada Tuhan melainkan Engkau, supaya Engkau jangan sesat kan aku. Engkaulah yang hidup, yang tidak mati, manakala jin dan manusia adalah mati."
  },
  {
    "id": 14009,
    "hadith_number": 6732,
    "tajuk_hadith": "Doa Perjalanan Rasulullah SAW",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "\" A listener listened to our praising Allah (for) His goodly trial of us. Our Lord! acompany us, guard us and bestow upon us Thy grace. I am seeker of refuge in Allah from the Fire.\"",
    "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ سُهَيْلِ،\n بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا كَانَ فِي\n سَفَرٍ وَأَسْحَرَ يَقُولُ ‏\n\"‏ سَمَّعَ سَامِعٌ بِحَمْدِ اللَّهِ وَحُسْنِ بَلاَئِهِ عَلَيْنَا رَبَّنَا صَاحِبْنَا وَأَفْضِلْ\n عَلَيْنَا عَائِذًا بِاللَّهِ مِنَ النَّارِ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada saya Abu Thahir, memberitakan kepada kami Abdullah bin Wahb, memberitakan kepadaku Sulaiman bin Bilal, dari Suhail bin Abi Shalih dari bapanya, dari Abu Hurairah, bahawa Nabi SAW apabila dalam perjalanan pada waktu pagi, baginda berdoa:  \"Semoga pendengar mendengar pujian kepada Allah dan kebaikan ujian-Nya ke atas kami. Wahai Tuhan kami, temani kami, lindungi kami dan kurniakanlah kepada kami kurnia-Mu. Aku berlindung kepada Allah daripada api neraka.\""
  },
  {
    "id": 14010,
    "hadith_number": 6733,
    "tajuk_hadith": "Doa Nabi SAW memohon keampunan",
    "perawi_melayu": "Abu Musa al-Asy'ari meriwayatkan daripada bapanya bahawa Rasulullah SAW berdoa dengan doa ini:",
    "english_text": "\" O Allah, forgive me my faults, my ignorance, my immoderation in my concerns. And Thou art better aware (of my affairs) than myself. O Allah, grant me forgiveness (of the faults which I committed) seriously or otherwise (and which I committed inadvertently and de- liberately. All these (failings) are in me. O Allah, grant me forgiveness from the fault which I did in haste or deferred, which I committed in privacy or in public and Thou art better aware of (them) than myself. Thou art the First and the Last and over all things Thou art Omnipotent.\"",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ،\n عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى الأَشْعَرِيِّ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ\n يَدْعُو بِهَذَا الدُّعَاءِ ‏\n\"‏ اللَّهُمَّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي وَإِسْرَافِي فِي أَمْرِي وَمَا أَنْتَ أَعْلَمُ\n بِهِ مِنِّي اللَّهُمَّ اغْفِرْ لِي جِدِّي وَهَزْلِي وَخَطَئِي وَعَمْدِي وَكُلُّ ذَلِكَ عِنْدِي اللَّهُمَّ اغْفِرْ لِي مَا\n قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ\n وَأَنْتَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ ‏\"‏ ‏.‏",
    "malay_translation": "Ya Allah, ampunkanlah dosa-dosaku, kebodohanku, dan sikap keterlaluan dalam urusanku. Dan Engkau lebih mengetahui (tentang urusanku) daripada aku. Ya Allah, ampunkanlah kesalahanku yang aku lakukan dengan sengaja atau tidak sengaja, yang aku lakukan secara sengaja dan tidak sengaja. Semua kekurangan itu ada padaku. Ya Allah, ampunkanlah kesalahanku yang aku lakukan dengan tergesa-gesa atau yang aku tunda, yang aku lakukan secara sembunyi atau terang-terangan, dan Engkau lebih mengetahui (tentang semuanya) daripada aku. Engkaulah yang Maha Awal dan Maha Akhir, dan Engkau Maha Kuasa atas segala sesuatu."
  },
  {
    "id": 14011,
    "hadith_number": 6734,
    "tajuk_hadith": "Sanad Hadis daripada Syu'bah",
    "perawi_melayu": "Muhammad bin Bashar meriwayatkan daripada Abd al-Malik bin ash-Shabbah al-Misma'i, meriwayatkan daripada Syu'bah.",
    "english_text": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ الصَّبَّاحِ الْمِسْمَعِيُّ، حَدَّثَنَا شُعْبَةُ،\n فِي هَذَا الإِسْنَادِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan melalui sanad yang sama daripada Syu'bah."
  },
  {
    "id": 14012,
    "hadith_number": 6735,
    "tajuk_hadith": "Doa untuk Kesejahteraan Agama, Dunia dan Akhirat",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW berdoa:",
    "english_text": "\" O Allah, set right for me my religion which is the safeguard of my affairs. And set right for me the affairs of my world wherein is my living. And set right for me my Hereafter on which depends my after-life. And make the life for me (a source) of abundance for every good and make my death a source of comfort for me protecting me against every evil.\"",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ دِينَارٍ، حَدَّثَنَا أَبُو قَطَنٍ، عَمْرُو بْنُ الْهَيْثَمِ الْقُطَعِيُّ عَنْ عَبْدِ الْعَزِيزِ،\n بْنِ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ الْمَاجِشُونِ عَنْ قُدَامَةَ بْنِ مُوسَى، عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ \n أَبِي هُرَيْرَةَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ اللَّهُمَّ أَصْلِحْ لِي دِينِيَ الَّذِي\n هُوَ عِصْمَةُ أَمْرِي وَأَصْلِحْ لِي دُنْيَاىَ الَّتِي فِيهَا مَعَاشِي وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي\n وَاجْعَلِ الْحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ وَاجْعَلِ الْمَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ ‏\"‏ ‏.‏",
    "malay_translation": "Ya Allah, perbetulkanlah agamaku, iaitu benteng pertahanan segala urusanku.  Perbetulkanlah juga urusanku di dunia, tempatku mencari rezeki, dan perbetulkanlah akhiratku, tempatku kembali. Jadikanlah hidupku sebagai sumber peningkatan kebaikan, dan jadikanlah kematianku sebagai ketenangan bagiku daripada sebarang kejahatan."
  },
  {
    "id": 14013,
    "hadith_number": 6736,
    "tajuk_hadith": "Doa Rasulullah untuk Petunjuk, Ketakwaan, Kesucian dan Kekayaan",
    "perawi_melayu": "Abdullah meriwayatkan bahawa Rasulullah SAW selalu berdoa dengan kata-kata ini:",
    "english_text": "\" O Allah. I beg of Thee the right guidance, safeguard against evils, chastity and freedom from want.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ،\n عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي الأَحْوَصِ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ\n يَقُولُ ‏\n\"‏ اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى ‏\"‏ ‏.‏",
    "malay_translation": "Abdullah meriwayatkan bahawa Rasulullah SAW bersabda: \"Ya Allah, sesungguhnya aku memohon kepada-Mu petunjuk, ketakwaan, kesucian dan kekayaan.\""
  },
  {
    "id": 14014,
    "hadith_number": 6737,
    "tajuk_hadith": "Perbezaan Ringkas Perawi Hadis",
    "perawi_melayu": "Abu Ishaq (dengan beberapa perbezaan lafaz)",
    "english_text": "This hadith has been narrated on the authority of Abu Ishaq with the same chain of transmitters but with a slight variation of wording.",
    "arabic_text": "وَحَدَّثَنَا ابْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ أَبِي،\n إِسْحَاقَ بِهَذَا الإِسْنَادِ ‏.‏ مِثْلَهُ غَيْرَ أَنَّ ابْنَ الْمُثَنَّى، قَالَ فِي رِوَايَتِهِ ‏\n\"‏ وَالْعِفَّةَ ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Abu Ishaq dengan sanad yang sama, tetapi dengan sedikit perbezaan lafaz. Ibnul Mutsanna dalam riwayatnya menyebut  \"… dan menjaga kehormatan…\"."
  },
  {
    "id": 14015,
    "hadith_number": 6738,
    "tajuk_hadith": "Doa perlindungan daripada kelemahan dan ketamakan",
    "perawi_melayu": "Zaid bin Arqam meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ،\n - وَاللَّفْظُ لاِبْنِ نُمَيْرٍ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآَخَرَانِ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ عَاصِمٍ،\n عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، وَعَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ زَيْدِ بْنِ أَرْقَمَ، قَالَ لاَ أَقُولُ لَكُمْ إِلاَّ\n كَمَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقُولُ كَانَ يَقُولُ ‏\n\"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْعَجْزِ\n وَالْكَسَلِ وَالْجُبْنِ وَالْبُخْلِ وَالْهَرَمِ وَعَذَابِ الْقَبْرِ اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا وَزَكِّهَا أَنْتَ خَيْرُ مَنْ\n زَكَّاهَا أَنْتَ وَلِيُّهَا وَمَوْلاَهَا اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لاَ يَنْفَعُ وَمِنْ قَلْبٍ لاَ يَخْشَعُ وَمِنْ\n نَفْسٍ لاَ تَشْبَعُ وَمِنْ دَعْوَةٍ لاَ يُسْتَجَابُ لَهَا ‏\"‏ ‏.‏",
    "malay_translation": "Aku hanya akan berkata kepada kamu apa yang biasa di ucapkan oleh Rasulullah SAW. Baginda SAW selalu berdoa: \"Ya Allah, aku berlindung kepada-Mu daripada kelemahan, kemalasan, kepengecutan, kedekut, tua dan azab kubur. Ya Allah, berikanlah kepada jiwaku ketakwaannya dan sucikanlah ia. Engkau adalah sebaik-baik yang mensucikannya. Engkau adalah pelindung dan penolongnya. Ya Allah, aku berlindung kepada-Mu daripada ilmu yang tidak bermanfaat, daripada hati yang tidak khusyuk, daripada jiwa yang tidak merasa puas dan daripada doa yang tidak dikabulkan.\""
  },
  {
    "id": 14016,
    "hadith_number": 6739,
    "tajuk_hadith": "Doa Petang Rasulullah SAW",
    "perawi_melayu": "Abdullah bin Mas'ud",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، عَنِ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ، حَدَّثَنَا \n إِبْرَاهِيمُ بْنُ سُوَيْدٍ النَّخَعِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ كَانَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَمْسَى قَالَ ‏\"‏ أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ وَالْحَمْدُ لِلَّهِ\n لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ ‏\"‏ ‏.‏ قَالَ الْحَسَنُ فَحَدَّثَنِي الزُّبَيْدُ أَنَّهُ حَفِظَ عَنْ إِبْرَاهِيمَ\n فِي هَذَا ‏\"‏ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ اللَّهُمَّ أَسْأَلُكَ خَيْرَ هَذِهِ اللَّيْلَةِ وَأَعُوذُ\n بِكَ مِنْ شَرِّ هَذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ اللَّهُمَّ\n إِنِّي أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah bin Sa'id, telah menceritakan kepada kami Abdul Wahid bin Ziyad, dari al-Hasan bin Ubaidillah, telah menceritakan kepada kami Ibrahim bin Suwaid an-Nakha'i, telah menceritakan kepada kami Abdur Rahman bin Yazid, dari Abdullah bin Mas'ud, dia berkata:  Rasulullah SAW apabila telah masuk waktu petang, baginda berdoa:  \"Kami telah memasuki waktu petang dan kerajaan kepunyaan Allah juga telah memasuki waktu petang, dan segala puji bagi Allah. Tiada Tuhan melainkan Allah, Yang Maha Esa, tiada sekutu bagiNya.\"  Al-Hasan berkata: Kemudian Zubair telah menceritakan kepadaku bahawa dia telah menghafal daripada Ibrahim dengan kata-kata ini: \"Kepunyaan-Nya kerajaan dan bagi-Nya segala puji, dan Dia Maha Kuasa atas segala sesuatu. Ya Allah, aku memohon kebaikan malam ini dan aku berlindung kepadaMu daripada kejahatan malam ini dan kejahatan apa yang akan datang selepasnya. Ya Allah, sesungguhnya aku berlindung kepadaMu daripada kemalasan dan kejahatan usia tua. Ya Allah, sesungguhnya aku berlindung kepadaMu daripada azab di dalam neraka dan azab di dalam kubur.\""
  },
  {
    "id": 14017,
    "hadith_number": 6740,
    "tajuk_hadith": "Doa Petang dan Pagi Rasulullah SAW",
    "perawi_melayu": "Abdullah meriwayatkan bahawa apabila menjelang petang, Rasulullah SAW berdoa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ، عَنْ إِبْرَاهِيمَ،\n بْنِ سُوَيْدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ عَبْدِ اللَّهِ، قَالَ كَانَ نَبِيُّ اللَّهِ صلى الله عليه وسلم\n إِذَا أَمْسَى قَالَ ‏\"‏ أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ وَالْحَمْدُ لِلَّهِ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ\n ‏\"‏ ‏.‏ قَالَ أُرَاهُ قَالَ فِيهِنَّ ‏\"‏ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ رَبِّ أَسْأَلُكَ خَيْرَ\n مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا\n رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ\n ‏\"‏ ‏.‏ وَإِذَا أَصْبَحَ قَالَ ذَلِكَ أَيْضًا ‏\"‏ أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ ‏\"‏ ‏.‏",
    "malay_translation": "Abdullah meriwayatkan bahawa Rasulullah SAW apabila masuk waktu petang berdoa: \"Kami telah memasuki waktu petang dan begitu juga seluruh kerajaan Allah telah memasuki waktu petang. Segala puji bagi Allah. Tiada Tuhan melainkan Allah, Yang Maha Esa, tiada sekutu bagiNya.\"  Baginda juga berdoa: \"Kepunyaan-Nya kerajaan dan bagi-Nya segala puji, dan Dia Maha Kuasa atas segala sesuatu. Ya Tuhanku, aku memohon kebaikan yang ada pada malam ini dan kebaikan yang mengikutinya, dan aku berlindung kepada-Mu daripada kejahatan yang ada pada malam ini dan kejahatan yang mengikutinya. Ya Tuhanku, aku berlindung kepada-Mu daripada kemalasan dan kejahatan keangkuhan. Ya Tuhanku, aku berlindung kepada-Mu daripada azab neraka dan azab kubur.\"  Dan apabila menjelang pagi, Baginda berdoa: \"Kami telah memasuki waktu pagi dan seluruh kerajaan Allah telah memasuki waktu pagi.\""
  },
  {
    "id": 14018,
    "hadith_number": 6741,
    "tajuk_hadith": "Doa Petang Rasulullah SAW",
    "perawi_melayu": "Abdullah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنِ الْحَسَنِ بْنِ،\n عُبَيْدِ اللَّهِ عَنْ إِبْرَاهِيمَ بْنِ سُوَيْدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ عَبْدِ اللَّهِ، قَالَ كَانَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم إِذَا أَمْسَى قَالَ ‏\"‏ أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ وَالْحَمْدُ لِلَّهِ لاَ إِلَهَ إِلاَّ\n اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ هَذِهِ اللَّيْلَةِ وَخَيْرِ مَا فِيهَا وَأَعُوذُ بِكَ\n مِنْ شَرِّهَا وَشَرِّ مَا فِيهَا اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْهَرَمِ وَسُوءِ الْكِبَرِ وَفِتْنَةِ الدُّنْيَا\n وَعَذَابِ الْقَبْرِ ‏\"‏ ‏.‏ قَالَ الْحَسَنُ بْنُ عُبَيْدِ اللَّهِ وَزَادَنِي فِيهِ زُبَيْدٌ عَنْ إِبْرَاهِيمَ بْنِ سُوَيْدٍ عَنْ\n عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ رَفَعَهُ أَنَّهُ قَالَ ‏\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ\n الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Abu Bakar bin Abi Syaibah, telah menceritakan kepada kami Husain bin Ali, daripada Zaidah, daripada al-Hasan bin Ubaidillah, daripada Ibrahim bin Suwaid, daripada Abdur Rahman bin Yazid, daripada Abdullah. Beliau berkata:  Rasulullah SAW apabila menjelang petang, baginda berdoa: \"Kami telah memasuki waktu petang dan demikian juga kerajaan kepunyaan Allah SWT telah memasuki waktu petang. Segala puji bagi Allah, tiada Tuhan melainkan Allah SWT Yang Maha Esa, tiada sekutu bagi-Nya. Ya Allah, aku memohon kepada-Mu kebaikan pada malam ini dan kebaikan apa yang ada padanya. Aku berlindung kepada-Mu daripada kejahatan malam ini dan kejahatan apa yang ada padanya. Ya Allah, aku berlindung kepada-Mu daripada kemalasan, daripada pikun, daripada kejahatan usia tua, daripada fitnah dunia dan daripada azab kubur.\" Al-Hasan bin Ubaidillah berkata: Zubaid menambah dalam doa ini daripada Ibrahim bin Suwaid, daripada Abdur Rahman bin Yazid, daripada Abdullah (dengan meriwayatkannya) bahawa baginda berkata: \"Tiada Tuhan melainkan Allah SWT Yang Maha Esa, tiada sekutu bagi-Nya. Milik-Nya kerajaan dan bagi-Nya segala puji, dan Dia Maha Kuasa atas segala sesuatu.\""
  },
  {
    "id": 14019,
    "hadith_number": 6742,
    "tajuk_hadith": "Doa Kemenangan dan pertolongan Allah",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Abu Hurairah bahawa Rasulullah SAW berdoa:",
    "english_text": "\" There is no god but Allah, the One Who conferred upon His armies the honour of victory and helped His servant rout the clans; there is nothing after that.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي،\n هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَقُولُ ‏\n\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ أَعَزَّ جُنْدَهُ\n وَنَصَرَ عَبْدَهُ وَغَلَبَ الأَحْزَابَ وَحْدَهُ فَلاَ شَىْءَ بَعْدَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Abu Hurairah r.a., bahawa Rasulullah SAW berdoa:  \"Tiada Tuhan melainkan Allah, Yang Maha Esa.  Dia yang memuliakan tentera-Nya dengan kemenangan, menolong hamba-Nya, dan menewaskan puak-puak musuh sendirian. Tiada apa lagi selepas ini.\""
  },
  {
    "id": 14020,
    "hadith_number": 6743,
    "tajuk_hadith": "Doa memohon petunjuk dan kesempurnaan",
    "perawi_melayu": "Ali meriwayatkan bahawa Rasulullah SAW bersabda kepadanya:",
    "english_text": "Say,\" O Allah, direct me to the right path and make me adhere to the straight path,\" and when you make a mention of right guidance, keep in mind the right path and when you consider of the straight (path), keep in mind the straightness of the arrow.",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا ابْنُ إِدْرِيسَ، قَالَ سَمِعْتُ عَاصِمَ بْنَ كُلَيْبٍ،\n عَنْ أَبِي بُرْدَةَ، عَنْ عَلِيٍّ، قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ قُلِ اللَّهُمَّ اهْدِنِي\n وَسَدِّدْنِي وَاذْكُرْ بِالْهُدَى هِدَايَتَكَ الطَّرِيقَ وَالسَّدَادِ سَدَادَ السَّهْمِ ‏\"‏ ‏.‏",
    "malay_translation": "“Ya Allah, berilah aku petunjuk dan teguhkanlah aku.  Dan apabila engkau menyebut petunjuk, ingatlah kepada jalan petunjukMu, dan apabila engkau menyebut kesempurnaan, ingatlah kepada ketepatan anak panah.”"
  },
  {
    "id": 14021,
    "hadith_number": 6744,
    "tajuk_hadith": "Doa memohon petunjuk dan kesempurnaan",
    "perawi_melayu": "Hadis ini diriwayatkan daripada 'Asim bin Kulaib melalui sanad yang sama bahawa Rasulullah SAW bersabda kepada saya:",
    "english_text": "Say:\" O Allah, I beg of Thee righteousness and adhering to the straight path.\"",
    "arabic_text": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ، - يَعْنِي ابْنَ إِدْرِيسَ - أَخْبَرَنَا عَاصِمُ بْنُ كُلَيْبٍ،\n بِهَذَا الإِسْنَادِ قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ قُلِ اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى\n وَالسَّدَادَ ‏\"‏ ‏.‏ ثُمَّ ذَكَرَ بِمِثْلِهِ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda kepadaku:  “Ucapkanlah, ‘Ya Allah, sesungguhnya aku memohon kepada-Mu petunjuk dan kesempurnaan (jalan yang lurus).’” Kemudian baginda menyebut sesuatu yang serupa."
  },
  {
    "id": 14022,
    "hadith_number": 6745,
    "tajuk_hadith": "Keutamaan Zikir 'Subhanallah wa bihamdih'",
    "perawi_melayu": "Juwairiyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَعَمْرٌو النَّاقِدُ، وَابْنُ أَبِي عُمَرَ، - وَاللَّفْظُ لاِبْنِ أَبِي عُمَرَ\n - قَالُوا حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، مَوْلَى آلِ طَلْحَةَ عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ،\n عَنْ جُوَيْرِيَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ مِنْ عِنْدِهَا بُكْرَةً حِينَ صَلَّى الصُّبْحَ وَهِيَ\n فِي مَسْجِدِهَا ثُمَّ رَجَعَ بَعْدَ أَنْ أَضْحَى وَهِيَ جَالِسَةٌ فَقَالَ ‏\"‏ مَا زِلْتِ عَلَى الْحَالِ الَّتِي فَارَقْتُكِ\n عَلَيْهَا ‏\"‏ ‏.‏ قَالَتْ نَعَمْ ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَقَدْ قُلْتُ بَعْدَكِ أَرْبَعَ كَلِمَاتٍ ثَلاَثَ\n مَرَّاتٍ لَوْ وُزِنَتْ بِمَا قُلْتِ مُنْذُ الْيَوْمِ لَوَزَنَتْهُنَّ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ\n وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Juwairiyah meriwayatkan bahawa Rasulullah SAW keluar dari tempat tinggalnya di pagi hari ketika beliau menunaikan solat Subuh, dan beliau mendapati Juwairiyah sedang berada di masjidnya.  Kemudian baginda kembali selepas tengah hari dan mendapati Juwairiyah masih duduk di tempat yang sama. Baginda bertanya, \"Adakah engkau masih berada di tempat yang sama ketika Aku meninggalkanmu?\" Juwairiyah menjawab, \"Ya.\" Rasulullah SAW bersabda, \"Aku telah menyebut empat kalimah tiga kali selepas Aku meninggalkanmu. Sekiranya ia ditimbang dengan apa yang engkau sebutkan sejak pagi tadi, nescaya ia akan lebih berat. Dan kalimah tersebut ialah:  \"Subhanallah wa bihamdih, 'adadi khalqihi wa rida nafsihi wa zinata 'arshihi wa midada kali matihi' (Maha Suci Allah dan segala puji bagi-Nya, sebanyak bilangan makhluk-Nya, keredaan diri-Nya, berat takhta-Nya dan tinta kalimat-kalimat-Nya).\""
  },
  {
    "id": 14023,
    "hadith_number": 6746,
    "tajuk_hadith": "Tasbih dengan Bilangan yang Agung",
    "perawi_melayu": "Juwairiya meriwayatkan bahawa Rasulullah SAW telah lalu di sisinya ketika beliau menunaikan solat Subuh; atau selepas beliau menunaikan solat Subuh.",
    "english_text": "\" Hallowed be Allah according to the number of His creation, hallowed be Allah according to the pleasure of His Self, hallowed be Allah according to the weight of His Throne, hallowed be Allah according to the ink used in recording His words.\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ وَإِسْحَاقُ عَنْ مُحَمَّدِ بْنِ بِشْرٍ، عَنْ مِسْعَرٍ،\n عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي رِشْدِينَ، عَنِ ابْنِ عَبَّاسٍ، عَنْ جُوَيْرِيَةَ، قَالَتْ مَرَّ بِهَا\n رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ صَلَّى صَلاَةَ الْغَدَاةِ أَوْ بَعْدَ مَا صَلَّى الْغَدَاةَ ‏.‏ فَذَكَرَ\n نَحْوَهُ غَيْرَ أَنَّهُ قَالَ ‏\n\"‏ سُبْحَانَ اللَّهِ عَدَدَ خَلْقِهِ سُبْحَانَ اللَّهِ رِضَا نَفْسِهِ سُبْحَانَ اللَّهِ زِنَةَ\n عَرْشِهِ سُبْحَانَ اللَّهِ مِدَادَ كَلِمَاتِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Maha Suci Allah sebanyak bilangan makhluk-Nya, Maha Suci Allah sebanyak keredaan diri-Nya, Maha Suci Allah sebanyak berat takhta-Nya, Maha Suci Allah sebanyak dakwat kalam-Nya."
  },
  {
    "id": 14024,
    "hadith_number": 6747,
    "tajuk_hadith": "Amalan Sebelum Tidur: Takbir, Tasbih, dan Tahmid",
    "perawi_melayu": "Daripada Ali r.a. bahawa Fatimah r.a. mengadu tentang sakit pada tangannya akibat bekerja di kincir tangan. Ketika itu, Rasulullah s.a.w. menerima beberapa tawanan perang. Fatimah r.a. pergi menemui Rasulullah s.a.w., tetapi tidak menjumpainya.  Beliau bertemu Aisyah r.a. dan memberitahu tentang kesusahannya. Apabila Rasulullah s.a.w. tiba, Aisyah r.a. memberitahu baginda tentang kedatangan Fatimah r.a.  Rasulullah s.a.w. datang kepada mereka (Fatimah r.a. dan keluarganya). Mereka telah pun berada di tempat tidur masing-masing. Ali r.a. berkata selanjutnya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا \n مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، قَالَ سَمِعْتُ ابْنَ أَبِي لَيْلَى، حَدَّثَنَا عَلِيٌّ، أَنَّ فَاطِمَةَ،\n اشْتَكَتْ مَا تَلْقَى مِنَ الرَّحَى فِي يَدِهَا وَأَتَى النَّبِيَّ صلى الله عليه وسلم سَبْىٌ فَانْطَلَقَتْ فَلَمْ\n تَجِدْهُ وَلَقِيَتْ عَائِشَةَ فَأَخْبَرَتْهَا فَلَمَّا جَاءَ النَّبِيُّ صلى الله عليه وسلم أَخْبَرَتْهُ عَائِشَةُ بِمَجِيءِ\n فَاطِمَةَ إِلَيْهَا فَجَاءَ النَّبِيُّ صلى الله عليه وسلم إِلَيْنَا وَقَدْ أَخَذْنَا مَضَاجِعَنَا فَذَهَبْنَا نَقُومُ\n فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ عَلَى مَكَانِكُمَا ‏\"‏ ‏.‏ فَقَعَدَ بَيْنَنَا حَتَّى وَجَدْتُ بَرْدَ قَدَمِهِ\n عَلَى صَدْرِي ثُمَّ قَالَ ‏\"‏ أَلاَ أُعَلِّمُكُمَا خَيْرًا مِمَّا سَأَلْتُمَا إِذَا أَخَذْتُمَا مَضَاجِعَكُمَا أَنْ تُكَبِّرَا\n اللَّهَ أَرْبَعًا وَثَلاَثِينَ وَتُسَبِّحَاهُ ثَلاَثًا وَثَلاَثِينَ وَتَحْمَدَاهُ ثَلاَثًا وَثَلاَثِينَ فَهُوَ خَيْرٌ لَكُمَا مِنْ خَادِمٍ\n ‏\"‏ ‏.‏",
    "malay_translation": "Kami cuba bangun (sebagai tanda hormat) tetapi Rasulullah SAW bersabda: “Tetaplah di tempat tidur kamu.” Baginda kemudian duduk di antara kami dan aku merasakan kesejukan kaki baginda di dadaku. Kemudian baginda bersabda: “Tidakkah aku mengajar kamu sesuatu yang lebih baik daripada apa yang kamu minta? Apabila kamu hendak tidur, bacalah Takbir (Allahu Akbar) sebanyak tiga puluh empat kali dan Tasbih (Subhanallah) tiga puluh tiga kali dan Tahmid (Alhamdulillah) tiga puluh tiga kali.  Amalan ini lebih baik untuk kamu daripada seorang hamba.”"
  },
  {
    "id": 14025,
    "hadith_number": 6748,
    "tajuk_hadith": "Perawi Hadis dengan Sanad yang Sama tetapi dengan sedikit perbezaan perkataan",
    "perawi_melayu": "Abu Bakar bin Abi Syaibah, Waki', Ubaidullah bin Mu'adz, Abi, dan Ibnul Mutsanna melalui Ibn Abi 'Adiyy, semuanya daripada Syu'bah.",
    "english_text": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters but. with a slight variation of wording.",
    "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا \n أَبِي ح، وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، كُلُّهُمْ عَنْ شُعْبَةَ، بِهَذَا الإِسْنَادِ وَفِي حَدِيثِ\n مُعَاذٍ ‏\n\"‏ أَخَذْتُمَا مَضْجَعَكُمَا مِنَ اللَّيْلِ ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Syu'bah dengan sanad yang sama, tetapi dengan sedikit perbezaan lafaz.  Abu Bakar bin Abi Syaibah meriwayatkan daripada Waki', Ubaidullah bin Mu'adz meriwayatkan daripada Abi, dan Ibnul Mutsanna meriwayatkan daripada Ibn Abi 'Adiyy. Kesemuanya daripada Syu'bah dengan sanad ini.  Dalam riwayat Mu'adz, terdapat lafaz  \"أَخَذْتُمَا مَضْجَعَكُمَا مِنَ اللَّيْلِ\"."
  },
  {
    "id": 14026,
    "hadith_number": 6749,
    "tajuk_hadith": "Ali dan Doa yang Sentiasa Diucapkan",
    "perawi_melayu": "Hadis ini diriwayatkan melalui Ibn Abi Laili dengan tambahan ini:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ،\n عَنْ مُجَاهِدٍ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، ح \n وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَعُبَيْدُ بْنُ يَعِيشَ، عَنْ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا \n عَبْدُ الْمَلِكِ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ عَلِيٍّ، عَنِ النَّبِيِّ\n صلى الله عليه وسلم ‏.‏ بِنَحْوِ حَدِيثِ الْحَكَمِ عَنِ ابْنِ أَبِي لَيْلَى، وَزَادَ، فِي الْحَدِيثِ قَالَ عَلِيٌّ\n مَا تَرَكْتُهُ مُنْذُ سَمِعْتُهُ مِنَ النَّبِيِّ صلى الله عليه وسلم ‏.‏ قِيلَ لَهُ وَلاَ لَيْلَةَ صِفِّينَ قَالَ وَلاَ لَيْلَةَ\n صِفِّينِ ‏.‏ وَفِي حَدِيثِ عَطَاءٍ عَنْ مُجَاهِدٍ عَنِ ابْنِ أَبِي لَيْلَى قَالَ قُلْتُ لَهُ وَلاَ لَيْلَةَ صِفِّينَ",
    "malay_translation": "Telah menceritakan kepadaku Zuhri bin Harb, telah menceritakan kepada kami Sufyan bin Uyaina, dari Ubaidullah bin Abi Yazid,\n dari Mujahid, dari Ibnu Abi Laili, dari Ali bin Abi Talib,  \n dan telah menceritakan kepada kami Muhammad bin Abdullah bin Numair, dan Ubaid bin Ya’isy, dari Abdullah bin Numair, telah menceritakan kepada kami \n Abdul Malik, dari Ata’ bin Abi Rabah, dari Mujahid, dari Ibnu Abi Laili, dari Ali, dari Nabi SAW.  Dengan lafaz yang hampir sama dengan hadis Al-Hakam dari Ibnu Abi Laili, dan ditambah dalam hadis tersebut, Ali berkata: \n Aku tidak pernah meninggalkannya sejak aku mendengarnya daripada Nabi SAW.  Dikatakan kepadanya: “Bahkan pada malam Siffin?”  Dia berkata: “Bahkan pada malam Siffin.”  Dan dalam hadis Ata’ dari Mujahid dari Ibnu Abi Laili, dia berkata: Aku bertanya kepadanya: “Bahkan pada malam Siffin?”"
  },
  {
    "id": 14027,
    "hadith_number": 6750,
    "tajuk_hadith": "Amalan Sebelum Tidur Sebagai Pengganti Pembantu Rumah",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Fatimah datang kepada Rasulullah SAW dan meminta seorang hamba kerana kesukaran kerja rumah.",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامَ الْعَيْشِيُّ، حَدَّثَنَا يَزِيدُ، - يَعْنِي ابْنَ زُرَيْعٍ - حَدَّثَنَا رَوْحٌ،\n وَهُوَ ابْنُ الْقَاسِمِ عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ فَاطِمَةَ، أَتَتِ النَّبِيَّ صلى الله عليه\n وسلم تَسْأَلُهُ خَادِمًا وَشَكَتِ الْعَمَلَ فَقَالَ ‏\"‏ مَا أَلْفَيْتِيهِ عِنْدَنَا ‏\"‏ ‏.‏ قَالَ ‏\"‏ أَلاَ أَدُلُّكِ عَلَى مَا\n هُوَ خَيْرٌ لَكِ مِنْ خَادِمٍ تُسَبِّحِينَ ثَلاَثًا وَثَلاَثِينَ وَتَحْمَدِينَ ثَلاَثًا وَثَلاَثِينَ وَتُكَبِّرِينَ أَرْبَعًا وَثَلاَثِينَ\n حِينَ تَأْخُذِينَ مَضْجَعَكِ ‏\"‏ ‏.‏ \n وَحَدَّثَنِيهِ أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ، حَدَّثَنَا حَبَّانُ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا سُهَيْلٌ، بِهَذَا\n الإِسْنَادِ ‏.‏",
    "malay_translation": "Umiyyah bin Bistam Al-Aisyi telah meriwayatkan dari Yazid (iaitu Ibn Zurai'), yang meriwayatkan dari Ruh (iaitu Ibn Al-Qasim) daripada Suhail, daripada bapanya, daripada Abu Hurairah, bahawa Fatimah datang kepada Nabi SAW meminta seorang hamba dan mengadu tentang kesukaran kerja rumah.  Baginda SAW bersabda:  \"Kami tidak mempunyai hamba.\" Baginda SAW bersabda lagi: \"Bagaimana jika Aku tunjukkan sesuatu yang lebih baik daripada seorang hamba bagimu?  Bacalah Subhanallah tiga puluh tiga kali, Alhamdulillah tiga puluh tiga kali dan Allahu Akbar tiga puluh empat kali ketika engkau hendak tidur.\"\nAhmad bin Sa'id Ad-Darimi juga meriwayatkan hadis ini melalui sanad yang sama daripada Habban, daripada Wuhaib, daripada Suhail."
  },
  {
    "id": 14028,
    "hadith_number": 6751,
    "tajuk_hadith": "Doa Ketika Mendengar Kokok Ayam dan Ringkikan Keldai",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying. When you listen to the crowing of the cock, ask Allah for His favour as it sees Angels and when you listen to the braying of the donkey, seek refuge in Allah from the Satan for it sees Satan.",
    "arabic_text": "حَدَّثَنِي قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنِ الأَعْرَجِ، عَنْ أَبِي،\n هُرَيْرَةَ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا سَمِعْتُمْ صِيَاحَ الدِّيَكَةِ فَاسْأَلُوا اللَّهَ مِنْ\n فَضْلِهِ فَإِنَّهَا رَأَتْ مَلَكًا وَإِذَا سَمِعْتُمْ نَهِيقَ الْحِمَارِ فَتَعَوَّذُوا بِاللَّهِ مِنَ الشَّيْطَانِ فَإِنَّهَا رَأَتْ\n شَيْطَانًا ‏\"‏ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:  \"Apabila kamu mendengar kokok ayam, mintalah kepada Allah SWT akan kurnia-Nya, kerana ia telah melihat malaikat.  Dan apabila kamu mendengar ringkikan keldai, berlindunglah kepada Allah SWT daripada syaitan, kerana ia telah melihat syaitan.\""
  },
  {
    "id": 14029,
    "hadith_number": 6752,
    "tajuk_hadith": "Doa Nabi SAW Ketika Kesusahan",
    "perawi_melayu": "Ibnu Abbas meriwayatkan bahawa Rasulullah SAW biasa berdoa ketika dalam kesusahan:",
    "english_text": "\" There is no god but Allah, the Great, the Tolerant, there is no god but Allah, the Lord of the Magnificent Throne There is no god but Allah, the Lord of the Heaven and the earth, the Lord of the Edifying Throne.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ - وَاللَّفْظُ لاِبْنِ سَعِيدٍ\n - قَالُوا حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ أَبِي الْعَالِيَةِ، عَنِ ابْنِ عَبَّاسٍ،\n أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم كَانَ يَقُولُ عِنْدَ الْكَرْبِ ‏\n\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ الْعَظِيمُ الْحَلِيمُ لاَ\n إِلَهَ إِلاَّ اللَّهُ رَبُّ الْعَرْشِ الْعَظِيمِ لاَ إِلَهَ إِلاَّ اللَّهُ رَبُّ السَّمَوَاتِ وَرَبُّ الأَرْضِ وَرَبُّ الْعَرْشِ الْكَرِيمِ\n ‏\"‏ ‏.‏",
    "malay_translation": "“Tiada Tuhan melainkan Allah, Yang Maha Agung, Yang Maha Penyabar. Tiada Tuhan melainkan Allah, Tuhan Yang Memiliki Arasy yang Agung. Tiada Tuhan melainkan Allah, Tuhan sekalian langit dan bumi, Tuhan Arasy yang mulia.”"
  },
  {
    "id": 14030,
    "hadith_number": 6753,
    "tajuk_hadith": "Sanad Hadith Hisyam",
    "perawi_melayu": "Abu Bakar bin Abi Syaibah, dari Waki', dari Hisyam",
    "english_text": "This hadith has been narrated on the authority of Hisham with the same chain of transmitters.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ وَحَدِيثُ مُعَاذِ\n بْنِ هِشَامٍ أَتَمُّ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Hisyam dengan sanad yang sama.  (Hadith Mu'az bin Hisyam lebih lengkap.)"
  },
  {
    "id": 14031,
    "hadith_number": 6754,
    "tajuk_hadith": "Doa Rasulullah SAW Ketika Kesusahan",
    "perawi_melayu": "Ibnu Abbas meriwayatkan bahawa Rasulullah SAW berdoa dengan kalimah ini dan menyebutnya ketika dalam kesusahan; selebihnya hadis adalah sama kecuali dengan perbezaan ini iaitu,  bukannya berkata:",
    "english_text": "\" The Lord of heaven and the earth,\" he said:\" The Lord of the heaven and that of the earth.\"",
    "arabic_text": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ بِشْرٍ الْعَبْدِيُّ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ،\n عَنْ قَتَادَةَ، أَنَّ أَبَا الْعَالِيَةِ الرِّيَاحِيَّ، حَدَّثَهُمْ عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه\n وسلم كَانَ يَدْعُو بِهِنَّ وَيَقُولُهُنَّ عِنْدَ الْكَرْبِ فَذَكَرَ بِمِثْلِ حَدِيثِ مُعَاذِ بْنِ هِشَامٍ عَنْ أَبِيهِ عَنْ\n قَتَادَةَ غَيْرَ أَنَّهُ قَالَ ‏\n\"‏ رَبُّ السَّمَوَاتِ وَالأَرْضِ ‏\"‏ ‏.‏",
    "malay_translation": "Ibnu Abbas meriwayatkan bahawa Rasulullah SAW  berdoa dengan kalimah-kalimah ini dan menyebutkannya ketika dalam kesusahan.  Baginda SAW berdoa:  \"Ya Rabb semesta alam dan bumi.\" "
  },
  {
    "id": 14032,
    "hadith_number": 6755,
    "tajuk_hadith": "Doa Nabi SAW Ketika Dilanda Masalah",
    "perawi_melayu": "Ibn Abbas melalui beberapa perawi lain",
    "english_text": "Ibn 'Abbas reported this hadith through another chain of transmitters with a slight variation of wording.",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، أَخْبَرَنِي يُوسُفُ بْنُ،\n عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ أَبِي الْعَالِيَةِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ\n إِذَا حَزَبَهُ أَمْرٌ قَالَ ‏.‏ فَذَكَرَ بِمِثْلِ حَدِيثِ مُعَاذٍ عَنْ أَبِيهِ وَزَادَ مَعَهُنَّ ‏\n\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ رَبُّ الْعَرْشِ الْكَرِيمِ ‏\"‏ ‏.‏",
    "malay_translation": "Muhammad bin Hatim telah meriwayatkan dari Bahz, yang meriwayatkan dari Hammad bin Salamah, yang diberitakan oleh Yusuf bin Abdullah bin Harits daripada Abu al-Aliah, daripada Ibnu Abbas, bahawa Nabi SAW, apabila ditimpa sesuatu masalah, baginda berdoa.  (Riwayat ini serupa dengan riwayat Mu’adz daripada bapanya, cuma ditambah dengan):  \"La ilaha illallah, Rabbul ‘Arsyil Karim\" (Tiada Tuhan melainkan Allah, Tuhan Yang Maha Pemurah di atas ‘Arsy)."
  },
  {
    "id": 14033,
    "hadith_number": 6756,
    "tajuk_hadith": "Kalimat Terbaik: Subhanallah Wa Bihamdih",
    "perawi_melayu": "Abu Dzar meriwayatkan bahawa Rasulullah SAW ditanya, apakah kalimah yang terbaik. Baginda menjawab:",
    "english_text": "Those for which Allah made a choice for His Angels and His servants (and the words are):\" Hallowed be Allah and praise is due to Him.\"",
    "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا حَبَّانُ بْنُ هِلاَلٍ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا سَعِيدٌ الْجُرَيْرِيُّ،\n عَنْ أَبِي عَبْدِ اللَّهِ الْجِسْرِيِّ، عَنِ ابْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه\n وسلم سُئِلَ أَىُّ الْكَلاَمِ أَفْضَلُ قَالَ ‏\n\"‏ مَا اصْطَفَى اللَّهُ لِمَلاَئِكَتِهِ أَوْ لِعِبَادِهِ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ\n ‏\"‏ ‏.‏",
    "malay_translation": "Abu Dzar meriwayatkan bahawa Rasulullah SAW ditanya: “Apakah kalimah yang paling baik?” Baginda SAW menjawab:  “Kalimah yang telah dipilih oleh Allah SWT untuk para malaikat dan hamba-hamba-Nya iaitu:  ‘Subhanallah wa bihamdih’ (Maha Suci Allah dan segala puji bagi-Nya).”"
  },
  {
    "id": 14034,
    "hadith_number": 6757,
    "tajuk_hadith": "Kalimat yang Paling Dicintai Allah",
    "perawi_melayu": "Abu Dzar meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Should I not inform you about the words liked most by Allah? I said: Allah's Mes- senger, do inform me about the words liked most by Allah. He said: Verily, the words liked most by Allah are:\" hallowed be Allah and praise is due to Him.\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ، عَنْ شُعْبَةَ، عَنِ الْجُرَيْرِيِّ،\n عَنْ أَبِي عَبْدِ اللَّهِ الْجَسْرِيِّ، مِنْ عَنَزَةَ عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\"‏ أَلاَ أُخْبِرُكَ بِأَحَبِّ الْكَلاَمِ إِلَى اللَّهِ ‏\"‏ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ أَخْبِرْنِي\n بِأَحَبِّ الْكَلاَمِ إِلَى اللَّهِ ‏.‏ فَقَالَ ‏\"‏ إِنَّ أَحَبَّ الْكَلاَمِ إِلَى اللَّهِ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Adakah aku tidak akan memberitahu kamu tentang kalimah yang paling disukai oleh Allah? Aku berkata: Wahai Rasulullah, beritahu aku tentang kalimah yang paling disukai oleh Allah. Baginda bersabda: Sesungguhnya kalimah yang paling disukai oleh Allah ialah: \"Subhanallah wa bihamdih\" (Maha Suci Allah dan segala puji bagi-Nya)."
  },
  {
    "id": 14035,
    "hadith_number": 6758,
    "tajuk_hadith": "Doa untuk Saudara Seagama",
    "perawi_melayu": "Abu Darda' meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There is no believing servant who supplicates for his brother behind his back (in his absence) that the Angels do not say: The same be for you too.",
    "arabic_text": "حَدَّثَنِي أَحْمَدُ بْنُ عُمَرَ بْنِ حَفْصٍ الْوَكِيعِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، حَدَّثَنَا أَبِي، عَنْ \n طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ بْنِ كَرِيزٍ، عَنْ أُمِّ الدَّرْدَاءِ، عَنْ أَبِي الدَّرْدَاءِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم ‏\n\"‏ مَا مِنْ عَبْدٍ مُسْلِمٍ يَدْعُو لأَخِيهِ بِظَهْرِ الْغَيْبِ إِلاَّ قَالَ الْمَلَكُ وَلَكَ بِمِثْلٍ ‏\"‏\n ‏.‏",
    "malay_translation": "Tidak ada seorang hamba muslim yang berdoa untuk saudaranya secara sembunyi (ketika saudaranya itu tidak hadir) melainkan para malaikat akan berkata: “Untukmu juga demikian.”"
  },
  {
    "id": 14036,
    "hadith_number": 6759,
    "tajuk_hadith": "Doa untuk Saudara Seagama",
    "perawi_melayu": "Umm Darda' meriwayatkan:",
    "english_text": "My husband reported that he heard Allah's Mes- senger (ﷺ) as saying: He who supplicates for his brother behind his back (in his absence), the Angel commissioned (for carrying supplication to his Lord) says: Amen, and it is for you also.",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ، حَدَّثَنَا مُوسَى بْنُ سَرْوَانَ،\n الْمُعَلِّمُ حَدَّثَنِي طَلْحَةُ بْنُ عُبَيْدِ اللَّهِ بْنِ كَرِيزٍ، قَالَ حَدَّثَتْنِي أُمُّ الدَّرْدَاءِ، قَالَتْ حَدَّثَنِي سَيِّدِي،\n أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ دَعَا لأَخِيهِ بِظَهْرِ الْغَيْبِ قَالَ الْمَلَكُ\n الْمُوَكَّلُ بِهِ آمِينَ وَلَكَ بِمِثْلٍ ‏\"‏ ‏.‏",
    "malay_translation": "Suami saya meriwayatkan bahawa baginda mendengar Rasulullah SAW bersabda: \"Barangsiapa yang berdoa untuk saudaranya di belakangnya (tanpa pengetahuan saudaranya itu), maka malaikat yang diamanahkan (untuk menyampaikan doa itu kepada Tuhan) akan berkata: Amin, dan untukmu juga (sama seperti doa itu).\""
  },
  {
    "id": 14037,
    "hadith_number": 6760,
    "tajuk_hadith": "Doa Seorang Muslim untuk Saudaranya",
    "perawi_melayu": "Safwan (dan beliau ialah Ibn 'Abdullah bin Safwan, dan beliau pernah berkahwin dengan Umm Darda') meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي،\n سُلَيْمَانَ عَنْ أَبِي الزُّبَيْرِ، عَنْ صَفْوَانَ، - وَهُوَ ابْنُ عَبْدِ اللَّهِ بْنِ صَفْوَانَ - وَكَانَتْ تَحْتَهُ الدَّرْدَاءُ\n قَالَ قَدِمْتُ الشَّامَ فَأَتَيْتُ أَبَا الدَّرْدَاءِ فِي مَنْزِلِهِ فَلَمْ أَجِدْهُ وَوَجَدْتُ أُمَّ الدَّرْدَاءِ فَقَالَتْ أَتُرِيدُ\n الْحَجَّ الْعَامَ فَقُلْتُ نَعَمْ ‏.‏ قَالَتْ فَادْعُ اللَّهَ لَنَا بِخَيْرٍ فَإِنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ\n يَقُولُ ‏\n\"‏ دَعْوَةُ الْمَرْءِ الْمُسْلِمِ لأَخِيهِ بِظَهْرِ الْغَيْبِ مُسْتَجَابَةٌ عِنْدَ رَأْسِهِ مَلَكٌ مُوَكَّلٌ كُلَّمَا دَعَا\n لأَخِيهِ بِخَيْرٍ قَالَ الْمَلَكُ الْمُوَكَّلُ بِهِ آمِينَ وَلَكَ بِمِثْلٍ ‏\"‏ ‏.‏ \n قَالَ فَخَرَجْتُ إِلَى السُّوقِ فَلَقِيتُ أَبَا الدَّرْدَاءِ فَقَالَ لِي مِثْلَ ذَلِكَ يَرْوِيهِ عَنِ النَّبِيِّ\n صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Aku telah datang ke Syam dan aku telah pergi ke rumah Abu Darda'.  Aku tidak menemuinya, tetapi aku menjumpai Umm Darda'.  Dia bertanya, \"Adakah kamu ingin menunaikan haji pada tahun ini?\" Aku menjawab, \"Ya.\"  Dia berkata, \"Maka berdoalah kepada Allah untuk kebaikan kami, kerana Rasulullah SAW bersabda,  \"Doa seorang Muslim untuk saudaranya yang lain walaupun ketika saudara itu tidak hadir adalah mustajab. Di sisi kepalanya terdapat malaikat yang diamanahkan. Setiap kali dia berdoa untuk kebaikan saudaranya, malaikat yang diamanahkan itu akan berkata, 'Amin, dan untukmu juga seperti itu.'\" Kemudian aku keluar ke pasar dan aku bertemu dengan Abu Darda', lalu dia memberitahu aku perkara yang sama seperti yang diriwayatkan daripada Nabi SAW."
  },
  {
    "id": 14038,
    "hadith_number": 6761,
    "tajuk_hadith": "Periwayat Hadis yang Sama",
    "perawi_melayu": "Abu Bakar bin Abi Syaibah, Yazid bin Harun, dan Abd al-Malik bin Abi Sulaiman",
    "english_text": "This hadith has been narrated on the authority of Safwan b. 'Abdullah b. Safwan with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي،\n سُلَيْمَانَ بِهَذَا الإِسْنَادِ مِثْلَهُ وَقَالَ عَنْ صَفْوَانَ بْنِ عَبْدِ اللَّهِ بْنِ صَفْوَانَ، ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Safwan bin Abdullah bin Safwan melalui sanad (rantaian periwayat) yang sama.  Abu Bakar bin Abi Syaibah meriwayatkan daripada Yazid bin Harun, yang meriwayatkan daripada Abd al-Malik bin Abi Sulaiman dengan isnad yang serupa."
  },
  {
    "id": 14039,
    "hadith_number": 6762,
    "tajuk_hadith": "Allah Redha dengan Hamba-Nya yang Berselawat ketika Makan dan Minum",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Allah is pleased with His servant who says: Al-Hamdu lillah while taking a morsel of food and while drinking.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ - وَاللَّفْظُ لاِبْنِ نُمَيْرٍ - قَالاَ حَدَّثَنَا أَبُو\n أُسَامَةَ وَمُحَمَّدُ بْنُ بِشْرٍ عَنْ زَكَرِيَّاءَ بْنِ أَبِي زَائِدَةَ، عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ، عَنْ أَنَسِ بْنِ،\n مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ اللَّهَ لَيَرْضَى عَنِ الْعَبْدِ أَنْ يَأْكُلَ الأَكْلَةَ\n فَيَحْمَدَهُ عَلَيْهَا أَوْ يَشْرَبَ الشَّرْبَةَ فَيَحْمَدَهُ عَلَيْهَا ‏\"‏ ‏.‏",
    "malay_translation": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda:  \"Sesungguhnya Allah SWT redha kepada hamba-Nya yang memakan sesuatu makanan lalu bersyukur ke atasnya, atau meminum sesuatu minuman lalu bersyukur ke atasnya.\""
  },
  {
    "id": 14040,
    "hadith_number": 6763,
    "tajuk_hadith": "Sanad Hadith melalui Ishak bin Yusuf Al-Azraq",
    "perawi_melayu": "Ishak bin Yusuf Al-Azraq melalui Zakariyya bin Abi Za'ida",
    "english_text": "This hadith is reported through Ishaaq bin Yusuf Al-Azraq from Zakariyya bin Abi Za'ida through the same chain.",
    "arabic_text": "وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ الأَزْرَقُ، حَدَّثَنَا زَكَرِيَّاءُ، بِهَذَا\n الإِسْنَادِ ‏.‏",
    "malay_translation": "Hadith ini diriwayatkan melalui Ishak bin Yusuf Al-Azraq daripada Zakariyya bin Abi Za'ida melalui sanad yang sama."
  },
  {
    "id": 14041,
    "hadith_number": 6764,
    "tajuk_hadith": "Doa Yang Dikabulkan",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The supplication of every one of you is granted if he does not grow impatient and says: I supplicated but it was not granted.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي عُبَيْدٍ، مَوْلَى\n ابْنِ أَزْهَرَ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يُسْتَجَابُ لأَحَدِكُمْ\n مَا لَمْ يَعْجَلْ فَيَقُولُ قَدْ دَعَوْتُ فَلاَ أَوْ فَلَمْ يُسْتَجَبْ لِي ‏\"‏ ‏.‏",
    "malay_translation": "Doa setiap seorang daripada kamu akan dimakbulkan selagi dia tidak berputus asa dan berkata: \"Aku telah berdoa, tetapi ia tidak dimakbulkan.\""
  },
  {
    "id": 14042,
    "hadith_number": 6765,
    "tajuk_hadith": "Doa yang Dikabulkan",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The supplication of one of you is granted if he does not grow impatient and say- I supplicated my Lord but it was not granted.",
    "arabic_text": "حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ لَيْثٍ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ،\n عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ حَدَّثَنِي أَبُو عُبَيْدٍ، مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَكَانَ مِنَ الْقُرَّاءِ\n وَأَهْلِ الْفِقْهِ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يُسْتَجَابُ\n لأَحَدِكُمْ مَا لَمْ يَعْجَلْ فَيَقُولُ قَدْ دَعَوْتُ رَبِّي فَلَمْ يَسْتَجِبْ لِي ‏\"‏ ‏.‏",
    "malay_translation": "Doa salah seorang daripada kamu akan dimakbulkan selagi dia tidak berputus asa dan berkata, \"Aku telah berdoa kepada Tuhanku, tetapi ia tidak dimakbulkan.\""
  },
  {
    "id": 14043,
    "hadith_number": 6766,
    "tajuk_hadith": "Doa Yang Dimakbul",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مُعَاوِيَةُ، - وَهُوَ ابْنُ صَالِحٍ -\n عَنْ رَبِيعَةَ بْنِ يَزِيدَ، عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه\n وسلم أَنَّهُ قَالَ ‏\"‏ لاَ يَزَالُ يُسْتَجَابُ لِلْعَبْدِ مَا لَمْ يَدْعُ بِإِثْمٍ أَوْ قَطِيعَةِ رَحِمٍ مَا لَمْ يَسْتَعْجِلْ\n ‏\"‏ ‏.‏ قِيلَ يَا رَسُولَ اللَّهِ مَا الاِسْتِعْجَالُ قَالَ ‏\"‏ يَقُولُ قَدْ دَعَوْتُ وَقَدْ دَعَوْتُ فَلَمْ أَرَ يَسْتَجِيبُ\n لِي فَيَسْتَحْسِرُ عِنْدَ ذَلِكَ وَيَدَعُ الدُّعَاءَ ‏\"‏ ‏.‏",
    "malay_translation": "Doa hamba akan dimakbulkan selagi ia tidak berdoa untuk melakukan dosa atau memutuskan silaturahim, dan selagi ia tidak berputus asa.  Dikatakan: Wahai Rasulullah, apakah maksud ‘berputus asa’ itu? Baginda menjawab:  ‘Dia berkata, “Aku telah berdoa dan berdoa, tetapi aku tidak melihat doa ku dimakbulkan,” lalu dia berasa kecewa dan meninggalkan doa.’"
  }
]
