[
  {
    "id": 12777,
    "hadith_number": 5500,
    "tajuk_hadith": "Salam daripada Penunggang, Pejalan Kaki, dan Kumpulan Kecil",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The rider should first greet the pedestrian, and the pedestrian the one who is seated and a small group should greet a larger group (with as-Salam-u-'Alaikum).",
    "arabic_text": "حَدَّثَنِي عُقْبَةُ بْنُ مُكْرَمٍ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ،\n مَرْزُوقٍ حَدَّثَنَا رَوْحٌ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي زِيَادٌ، أَنَّ ثَابِتًا، مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ زَيْدٍ\n أَخْبَرَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يُسَلِّمُ الرَّاكِبُ\n عَلَى الْمَاشِي وَالْمَاشِي عَلَى الْقَاعِدِ وَالْقَلِيلُ عَلَى الْكَثِيرِ ‏\"‏ ‏.‏",
    "malay_translation": "Penunggang hendaklah memberi salam terlebih dahulu kepada pejalan kaki, dan pejalan kaki kepada orang yang duduk, dan kumpulan kecil kepada kumpulan yang besar (dengan mengucapkan As-Salam-u-'Alaikum)."
  },
  {
    "id": 12778,
    "hadith_number": 5501,
    "tajuk_hadith": "Adab Berhimpun di Jalan Raya",
    "perawi_melayu": "Abu Talhah meriwayatkan:",
    "english_text": "While we were sitting in front of the houses and talking amongst ourselves, Allah's Messenger (ﷺ) happened to come there. He stood by us and said: What about you and your meetings on the paths? Avoid these meetings on the paths. We said: We were sitting here without (any intention of doing harm to the passers-by) ; we are sitting to discuss matters and to hold conversation amongst ourselves. Thereupon he said: If there is no help (for you but to sit on these paths), then give the paths their rights and these are lowering of the gaze, exchanging of greetings and good conversation.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا \n عُثْمَانُ بْنُ حَكِيمٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَبِيهِ، قَالَ قَالَ أَبُو طَلْحَةَ كُنَّا\n قُعُودًا بِالأَفْنِيَةِ نَتَحَدَّثُ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَامَ عَلَيْنَا فَقَالَ ‏\"‏ مَا لَكُمْ\n وَلِمَجَالِسِ الصُّعُدَاتِ اجْتَنِبُوا مَجَالِسَ الصُّعُدَاتِ ‏\"‏ ‏.‏ فَقُلْنَا إِنَّمَا قَعَدْنَا لِغَيْرِ مَا بَاسٍ قَعَدْنَا\n نَتَذَاكَرُ وَنَتَحَدَّثُ ‏.‏ قَالَ ‏\"‏ إِمَّا لاَ فَأَدُّوا حَقَّهَا غَضُّ الْبَصَرِ وَرَدُّ السَّلاَمِ وَحُسْنُ الْكَلاَمِ ‏\"‏\n ‏.‏",
    "malay_translation": "Ketika kami duduk di hadapan rumah-rumah dan berbual-bual sesama sendiri, tiba-tiba Rasulullah SAW datang. Baginda berdiri di sisi kami dan bersabda: “Apakah hal kamu dan majlis-majlis di jalan? Elakkan majlis-majlis di jalan.” Kami berkata: “Kami hanya duduk di sini tanpa niat untuk mengganggu orang yang lalu lalang; kami duduk untuk berbincang dan berbual-bual sesama sendiri.”  Lalu Baginda bersabda: “Jika kamu tidak mempunyai pilihan selain duduk di jalan, maka tunaikan haknya iaitu: menundukkan pandangan, membalas salam dan berkata-kata dengan baik.”"
  },
  {
    "id": 12779,
    "hadith_number": 5502,
    "tajuk_hadith": "Menghindari Duduk di Jalan Raya",
    "perawi_melayu": "Abu Said al-Khudri meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Avoid sitting on the paths. They (the Companions) said: Allah's Messenger, we cannot help but holding our meetings (in these paths) and discuss matters (there). Thereupon Allah's Messenger (ﷺ) said: If you insist on holding meetings, then give the path its due right. They said: What are its due rights? Upon this he said: Lowering the gaze, refraining from doing harm, exchanging of greetings. commanding of good and forbidding from evil.",
    "arabic_text": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا حَفْصُ بْنُ مَيْسَرَةَ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ،\n بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِيَّاكُمْ وَالْجُلُوسَ\n بِالطُّرُقَاتِ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ مَا لَنَا بُدٌّ مِنْ مَجَالِسِنَا نَتَحَدَّثُ فِيهَا ‏.‏ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا أَبَيْتُمْ إِلاَّ الْمَجْلِسَ فَأَعْطُوا الطَّرِيقَ حَقَّهُ ‏\"‏ ‏.‏ قَالُوا وَمَا\n حَقُّهُ قَالَ ‏\"‏ غَضُّ الْبَصَرِ وَكَفُّ الأَذَى وَرَدُّ السَّلاَمِ وَالأَمْرُ بِالْمَعْرُوفِ وَالنَّهْىُ عَنِ الْمُنْكَرِ ‏\"‏\n ‏.‏",
    "malay_translation": "Jauhilah kamu duduk di jalan raya.\" Para sahabat bertanya, \"Wahai Rasulullah, kami tidak dapat tidak melainkan mengadakan majlis kami di sini dan berbincang di sini.\" Rasulullah SAW bersabda, \"Jika kamu tetap hendak mengadakan majlis, maka berikanlah jalan itu haknya.\" Mereka bertanya, \"Apakah haknya itu?\" Baginda menjawab, \"Merenung rendah pandangan, menahan diri daripada melakukan kemudaratan, membalas salam, menyeru kepada kebaikan dan mencegah kemungkaran.\""
  },
  {
    "id": 12780,
    "hadith_number": 5503,
    "tajuk_hadith": "Sanad Hadith daripada Zaid bin Aslam",
    "perawi_melayu": "Zaid bin Aslam melalui beberapa perawi",
    "english_text": "This hadith has been narrated on the authority of Zaid b. Aslam with the same chain of transmitters.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الْمَدَنِيُّ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ،\n رَافِعٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، عَنْ هِشَامٍ، - يَعْنِي ابْنَ سَعْدٍ - كِلاَهُمَا عَنْ زَيْدِ بْنِ أَسْلَمَ، بِهَذَا\n الإِسْنَادِ ‏.‏",
    "malay_translation": "Hadith ini diriwayatkan daripada Zaid bin Aslam melalui beberapa perawi dengan sanad yang sama.  (Yahya bin Yahya meriwayatkan daripada Abd al-Aziz bin Muhammad al-Madani, dan Muhammad bin Rafi' meriwayatkan daripada Ibnu Abi Fudayk, daripada Hisyam (iaitu Ibnu Saad). Keduanya meriwayatkan daripada Zaid bin Aslam dengan sanad ini.)"
  },
  {
    "id": 12781,
    "hadith_number": 5504,
    "tajuk_hadith": "Lima Hak Seorang Muslim Terhadap Saudaranya",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنِ \n ابْنِ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ حَقُّ الْمُسْلِمِ عَلَى\n الْمُسْلِمِ خَمْسٌ ‏\"‏ ‏.‏ ح \n وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ،\n الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ خَمْسٌ تَجِبُ لِلْمُسْلِمِ\n عَلَى أَخِيهِ رَدُّ السَّلاَمِ وَتَشْمِيتُ الْعَاطِسِ وَإِجَابَةُ الدَّعْوَةِ وَعِيَادَةُ الْمَرِيضِ وَاتِّبَاعُ الْجَنَائِزِ\n ‏\"‏ ‏.‏ قَالَ عَبْدُ الرَّزَّاقِ كَانَ مَعْمَرٌ يُرْسِلُ هَذَا الْحَدِيثَ عَنِ الزُّهْرِيِّ وَأَسْنَدَهُ مَرَّةً عَنِ ابْنِ\n الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ ‏.‏",
    "malay_translation": "Harmalah bin Yahya telah menceritakan kepadaku, Ibnu Wahb telah memberitakan kepadaku, Yunus telah memberitakan kepadaku daripada Ibnu Syihab, daripada Ibnu Musayyib, bahawa Abu Hurairah berkata, Rasulullah SAW bersabda: \"Hak seorang Muslim terhadap saudaranya ada lima.\"  Dan telah menceritakan kepada kami Abdul bin Humaid, Abdul Razzaq telah memberitakan kepada kami, Ma'mar telah memberitakan kepada kami daripada Az- Zuhri, daripada Ibnu Musayyib, daripada Abu Hurairah, bahawa Rasulullah SAW bersabda: \"Lima perkara yang wajib bagi seorang Muslim terhadap saudaranya: membalas salam, mendoakan orang yang bersin (Yarhamukallah), mengiyakan seruan (doa), melawat orang sakit, dan mengiringi jenazah.\" Abdul Razzaq berkata, Ma'mar meriwayatkan hadis ini secara mursal daripada Az-Zuhri, dan beliau telah meriwayatkannya sekali lagi melalui sanad daripada Ibnu Musayyib daripada Abu Hurairah."
  },
  {
    "id": 12782,
    "hadith_number": 5505,
    "tajuk_hadith": "Enam Hak Seorang Muslim Terhadap Muslim Lain",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Six are the rights of a Muslim over another Muslim. It was said to him: Allah's Messenger, what are these? Thereupon he said: When you meet him, offer him greetings;when he invites you to a feast accept it. when he seeks your council give him, and when he sneezes and says:\" All praise is due to Allah,\" you say Yarhamuk Allah (may Allah show mercy to you) ; and when he fails ill visit him; and when he dies follow his bier.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ\n جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ\n ‏\"‏ حَقُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ سِتٌّ ‏\"‏ ‏.‏ قِيلَ مَا هُنَّ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ إِذَا لَقِيتَهُ فَسَلِّمْ عَلَيْهِ\n وَإِذَا دَعَاكَ فَأَجِبْهُ وَإِذَا اسْتَنْصَحَكَ فَانْصَحْ لَهُ وَإِذَا عَطَسَ فَحَمِدَ اللَّهَ فَسَمِّتْهُ وَإِذَا مَرِضَ\n فَعُدْهُ وَإِذَا مَاتَ فَاتَّبِعْهُ ‏\"‏ ‏.‏",
    "malay_translation": "Enam hak seorang Muslim ke atas Muslim yang lain.  Baginda ditanya: Wahai Rasulullah, apakah hak-hak itu?  Baginda menjawab:  Apabila kamu bertemu dengannya, ucapkan salam kepadanya; apabila dia mengajakmu ke kenduri, terimalah; apabila dia meminta nasihatmu, berilah nasihat kepadanya; dan apabila dia bersin lalu memuji Allah, ucapkanlah ‘Yarhamukallah’ (semoga Allah merahmatimu); dan apabila dia sakit, ziarahilah dia; dan apabila dia meninggal dunia, iringilah jenazahnya."
  },
  {
    "id": 12783,
    "hadith_number": 5506,
    "tajuk_hadith": "Balas Salam Ahli Kitab",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "When the People of the Book offer you salutations, you should say: The same to you.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، قَالَ سَمِعْتُ \n أَنَسًا، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ح \n وَحَدَّثَنِي إِسْمَاعِيلُ بْنُ سَالِمٍ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ أَبِي بَكْرٍ، عَنْ \n جَدِّهِ، أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا سَلَّمَ عَلَيْكُمْ أَهْلُ الْكِتَابِ\n فَقُولُوا وَعَلَيْكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila Ahli Kitab memberi salam kepada kamu, maka katakanlah: “Waalaikumussalam”."
  },
  {
    "id": 12784,
    "hadith_number": 5507,
    "tajuk_hadith": "Membalas Salam Ahli Kitab",
    "perawi_melayu": "Anas meriwayatkan bahawa para sahabat Rasulullah ﷺ berkata kepada baginda:",
    "english_text": "The People. of the Book offer us salutations (by saying as-Salamu- 'Alaikum). How should we reciprocate them? Thereupon he said: Say: Wa 'Alaikum (and upon you too).",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنِي يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدٌ،\n - يَعْنِي ابْنَ الْحَارِثِ - قَالاَ حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ - وَاللَّفْظُ\n لَهُمَا - قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ أَنَسٍ، أَنَّعليه وسلم قَالُوا لِلنَّبِيِّ صلى الله عليه وسلم إِنَّ أَهْلَ الْكِتَابِ يُسَلِّمُونَ\n عَلَيْنَا فَكَيْفَ نَرُدُّ عَلَيْهِمْ قَالَ ‏\n\"‏ قُولُوا وَعَلَيْكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Para sahabat Rasulullah ﷺ bertanya kepada baginda, \"Wahai Rasulullah, Ahli Kitab memberi salam kepada kita dengan mengucapkan ‘Assalamu’alaikum’. Bagaimanakah kita harus membalas salam mereka?\" Baginda menjawab, \"Ucapkanlah, ‘Wa’alaikum’ (dan juga ke atas kamu).\""
  },
  {
    "id": 12785,
    "hadith_number": 5508,
    "tajuk_hadith": "Balas Salam Orang Yahudi",
    "perawi_melayu": "Ibn Umar meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "When the Jews offer you salutations, some of them say as-Sam-u-'Alaikum (death be upon you). You should say (in response to it): Let it be upon you.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ - وَاللَّفْظُ لِيَحْيَى بْنِ\n يَحْيَى - قَالَ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ جَعْفَرٍ\n - عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّهُ سَمِعَ ابْنَ عُمَرَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n ‏\n\"‏ إِنَّ الْيَهُودَ إِذَا سَلَّمُوا عَلَيْكُمْ يَقُولُ أَحَدُهُمُ السَّامُ عَلَيْكُمْ فَقُلْ عَلَيْكَ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Yahya bin Yahya, Yahya bin Ayub, Qotaibah dan Ibnu Hujr – dan lafaz daripada Yahya bin Yahya – Yahya bin Yahya memberitahu kami dan yang lain pula berkata, telah memberitahu kami Ismail – iaitu Ibnu Ja’far – daripada Abdullah bin Dinar, bahawa dia mendengar Ibnu Umar berkata: Rasulullah SAW bersabda: “Sesungguhnya orang-orang Yahudi, apabila mereka memberi salam kepadamu, salah seorang daripada mereka berkata: ‘As-Samu ‘Alaikum’ (Semoga kematian menimpa kamu). Maka katakanlah: ‘Alaika’ (Semoga menimpa kamu).”"
  },
  {
    "id": 12786,
    "hadith_number": 5509,
    "tajuk_hadith": "Variasi Ringkas Hadis daripada Ibnu Umar",
    "perawi_melayu": "Zahir bin Harb meriwayatkan daripada Abdur Rahman, daripada Sufyan, daripada Abdullah bin Dinar, daripada Ibnu Umar, daripada Nabi SAW.",
    "english_text": "This hadith has been narrated on the authority of Ibn 'Umar through another chain of transmitters with a slight variation of wording.",
    "arabic_text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ،\n عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ ‏\n\"‏ فَقُولُوا وَعَلَيْكَ ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Ibnu Umar melalui sanad yang lain dengan sedikit perbezaan lafaz.  Zahir bin Harb meriwayatkan daripada Abdur Rahman, daripada Sufyan, daripada Abdullah bin Dinar, daripada Ibnu Umar, daripada Nabi SAW,  dengan lafaz yang hampir sama, cuma baginda berkata,  \"…maka katakanlah dan juga kamu…\"."
  },
  {
    "id": 12787,
    "hadith_number": 5510,
    "tajuk_hadith": "Kelembutan dalam Segala Perkara",
    "perawi_melayu": "Aisyah",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لِزُهَيْرٍ - قَالاَ حَدَّثَنَا سُفْيَانُ،\n بْنُ عُيَيْنَةَ عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتِ اسْتَأْذَنَ رَهْطٌ مِنَ الْيَهُودِ عَلَى رَسُولِ\n اللَّهِ صلى الله عليه وسلم فَقَالُوا السَّامُ عَلَيْكُمْ ‏.‏ فَقَالَتْ عَائِشَةُ بَلْ عَلَيْكُمُ السَّامُ وَاللَّعْنَةُ\n ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا عَائِشَةُ إِنَّ اللَّهَ يُحِبُّ الرِّفْقَ فِي الأَمْرِ كُلِّهِ\n ‏\"‏ ‏.‏ قَالَتْ أَلَمْ تَسْمَعْ مَا قَالُوا قَالَ ‏\"‏ قَدْ قُلْتُ وَعَلَيْكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Aku telah diceritakan oleh Amru An-Naqid dan Zuhri bin Harb – dan lafaznya adalah daripada Zuhri – mereka berkata:  Telah menceritakan kepada kami Sufyan bin Uyainah daripada Az-Zuhri, daripada Urwah, daripada Aisyah, katanya: Sekumpulan orang Yahudi meminta izin untuk bertemu Rasulullah SAW. Mereka berkata, “Semoga kecelakaan menimpa kamu!” Maka Aisyah berkata, “Tidak, semoga kecelakaan dan laknat menimpa kamu!”  Lalu Rasulullah SAW bersabda,  “Wahai Aisyah, sesungguhnya Allah SWT menyukai kelembutan dalam setiap perkara.” Aisyah bertanya, “Bukankah engkau mendengar apa yang mereka katakan?” Baginda menjawab,  “Aku telah membalas mereka dengan berkata, ‘Semoga kecelakaan juga menimpa kamu!’”"
  },
  {
    "id": 12788,
    "hadith_number": 5511,
    "tajuk_hadith": "Sabda Rasulullah SAW: \"Aku telah berkata kepada kamu\"",
    "perawi_melayu": "Hadis ini diriwayatkan melalui Zuhri bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَاهُ حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، جَمِيعًا عَنْ يَعْقُوبَ بْنِ إِبْرَاهِيمَ،\n بْنِ سَعْدٍ حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ،\n كِلاَهُمَا عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ ‏.‏ وَفِي حَدِيثِهِمَا جَمِيعًا قَالَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم ‏\n\"‏ قَدْ قُلْتُ عَلَيْكُمْ ‏\"‏ ‏.‏ وَلَمْ يَذْكُرُوا الْوَاوَ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Hasan bin Ali Al-Hulwani dan Abd bin Humaid, kedua-duanya daripada Ya’qub bin Ibrahim bin Saad. Telah menceritakan kepada kami ayahku daripada Shalih. Dan telah menceritakan kepada kami Abd bin Humaid, telah memberitakan kepada kami Abdur Razzaq, telah memberitakan kepada kami Ma’mar, keduanya daripada Az- Zuhri dengan sanad ini. Dan dalam hadis mereka berdua, Rasulullah SAW bersabda: \"Sesungguhnya aku telah berkata kepada kamu.\" Dan mereka tidak menyebut huruf waw (و)."
  },
  {
    "id": 12789,
    "hadith_number": 5512,
    "tajuk_hadith": "Balas Kebaikan dengan Kebaikan",
    "perawi_melayu": "Aisyah meriwayatkan bahawa beberapa orang Yahudi telah datang kepada Rasulullah SAW dan mereka berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، عَنْ \n عَائِشَةَ، قَالَتْ أَتَى النَّبِيَّ صلى الله عليه وسلم أُنَاسٌ مِنَ الْيَهُودِ فَقَالُوا السَّامُ عَلَيْكَ يَا\n أَبَا الْقَاسِمِ ‏.‏ قَالَ ‏\"‏ وَعَلَيْكُمْ ‏\"‏ ‏.‏ قَالَتْ عَائِشَةُ قُلْتُ بَلْ عَلَيْكُمُ السَّامُ وَالذَّامُ ‏.‏ فَقَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا عَائِشَةُ لاَ تَكُونِي فَاحِشَةً ‏\"‏ ‏.‏ فَقَالَتْ مَا سَمِعْتَ مَا قَالُوا\n فَقَالَ ‏\"‏ أَوَلَيْسَ قَدْ رَدَدْتُ عَلَيْهِمُ الَّذِي قَالُوا قُلْتُ وَعَلَيْكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Kuraib telah meriwayatkan daripada Abu Muawiyah, daripada Al-A'masy, daripada Muslim, daripada Masruq, daripada Aisyah, katanya: Sesetengah orang Yahudi telah datang kepada Nabi SAW, lalu mereka berkata, \"Semoga kecelakaan menimpa kamu, wahai Abu Al-Qasim!\"  Baginda menjawab, \"Semoga juga menimpa kamu.\" Aisyah berkata, \"Aku berkata, \"Tidak, semoga kecelakaan dan kehinaan menimpa kamu!\" Lalu Rasulullah SAW bersabda, \"Wahai Aisyah, janganlah kamu berkata-kata kasar.\" Aku bertanya, \"Adakah tuan mendengar apa yang mereka katakan?\" Baginda menjawab, \"Bukankah Aku telah membalas kata-kata mereka? Aku telah berkata kepada mereka, 'Semoga juga menimpa kamu.'\""
  },
  {
    "id": 12790,
    "hadith_number": 5513,
    "tajuk_hadith": "Larangan Menggunakan Kata-Kata Kasar",
    "perawi_melayu": "Hadis ini diriwayatkan oleh al-A'masy dengan sedikit perbezaan lafaz. Aisyah memahami maksud mereka dan mencaci mereka, lalu Rasulullah SAW bersabda:",
    "english_text": "'A'isha. (do not do that) for Allah does not like the use of harsh words, and it was at this stage that this verse of Allah. the Exalt. ed and Glorious. was revealed:\" And when they come to thee, they greet thee with a greeting with which Allah greets thee not\" (Iviii. 8) to the end of the verse.",
    "arabic_text": "حَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا يَعْلَى بْنُ عُبَيْدٍ، حَدَّثَنَا الأَعْمَشُ، بِهَذَا الإِسْنَادِ\n غَيْرَ أَنَّهُ قَالَ فَفَطِنَتْ بِهِمْ عَائِشَةُ فَسَبَّتْهُمْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَهْ\n يَا عَائِشَةُ فَإِنَّ اللَّهَ لاَ يُحِبُّ الْفُحْشَ وَالتَّفَحُّشَ ‏\"‏ ‏.‏ وَزَادَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ وَإِذَا جَاءُوكَ\n حَيَّوْكَ بِمَا لَمْ يُحَيِّكَ بِهِ اللَّهُ‏}‏ إِلَى آخِرِ الآيَةِ ‏.‏",
    "malay_translation": "Aisyah memahami maksud mereka lalu mencaci mereka.  Rasulullah SAW bersabda, \"Jangan begitu, wahai Aisyah!  Sesungguhnya Allah SWT tidak menyukai perkataan yang buruk dan keterlaluan.\"  Kemudian Allah SWT menurunkan ayat:  \"Dan apabila mereka datang kepadamu, mereka memberi salam kepadamu dengan salam yang Allah tidak memberi salam kepadamu dengannya…\" hingga akhir ayat tersebut."
  },
  {
    "id": 12791,
    "hadith_number": 5514,
    "tajuk_hadith": "Rasulullah SAW Membalas Laknat Orang Yahudi",
    "perawi_melayu": "Jabir bin Abdullah",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، وَحَجَّاجُ بْنُ الشَّاعِرِ، قَالاَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ،\n قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ سَلَّمَ نَاسٌ مِنْ\n يَهُودَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالُوا السَّامُ عَلَيْكَ يَا أَبَا الْقَاسِمِ ‏.‏ فَقَالَ ‏\"‏\n وَعَلَيْكُمْ ‏\"‏ ‏.‏ فَقَالَتْ عَائِشَةُ وَغَضِبَتْ أَلَمْ تَسْمَعْ مَا قَالُوا قَالَ ‏\"‏ بَلَى قَدْ سَمِعْتُ فَرَدَدْتُ\n عَلَيْهِمْ وَإِنَّا نُجَابُ عَلَيْهِمْ وَلاَ يُجَابُونَ عَلَيْنَا ‏\"‏ ‏.‏",
    "malay_translation": "Aku telah diberitahu oleh Harun bin Abdullah dan Hajjaj bin asy-Sya'ir, mereka berdua berkata: Telah menceritakan kepada kami Hajjaj bin Muhammad, katanya: telah memberitahu aku Ibnu Juraij, bahawa Abu az-Zubair telah mendengar Jabir bin Abdullah berkata:  Segelintir orang Yahudi melaknati Rasulullah SAW, lalu mereka berkata: “Semoga laknat menimpa engkau, wahai Abu al-Qasim!”. Baginda SAW menjawab: “Semoga laknat menimpa kamu juga!”.  Aishah bertanya dengan marah, “Adakah engkau tidak mendengar apa yang mereka katakan?” Baginda SAW menjawab: “Ya, aku telah mendengarnya dan aku membalas laknat mereka.  Sesungguhnya laknat kami akan diterima Allah SWT, manakala laknat mereka terhadap kami tidak akan diterima.”"
  },
  {
    "id": 12792,
    "hadith_number": 5515,
    "tajuk_hadith": "Menyambut Salam dan Pertemuan dengan Orang Yahudi dan Nasrani",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Do not greet the Jews and the Christians before they greet you and when you meet any one of them on the roads force him to go to the narrowest part of it.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي الدَّرَاوَرْدِيَّ - عَنْ سُهَيْلٍ، عَنْ \n أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَبْدَءُوا الْيَهُودَ وَلاَ النَّصَارَى\n بِالسَّلاَمِ فَإِذَا لَقِيتُمْ أَحَدَهُمْ فِي طَرِيقٍ فَاضْطَرُّوهُ إِلَى أَضْيَقِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah kamu memulakan salam kepada orang-orang Yahudi dan Nasrani.  Jika kamu bertemu dengan salah seorang daripada mereka di jalan, paksa mereka supaya melalui bahagian jalan yang paling sempit."
  },
  {
    "id": 12793,
    "hadith_number": 5516,
    "tajuk_hadith": "Bertemu dengan Ahli Kitab dan Musyrik",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Suhail dengan sanad yang sama, tetapi dengan sedikit perbezaan lafaz.  Dalam hadis riwayat Waki', lafaznya ialah \"Apabila kamu bertemu dengan Yahudi.\" Dan dalam hadis riwayat Syu'bah, lafaznya ialah:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا أَبُو بَكْرِ،\n بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا \n جَرِيرٌ، كُلُّهُمْ عَنْ سُهَيْلٍ، بِهَذَا الإِسْنَادِ وَفِي حَدِيثِ وَكِيعٍ ‏\"‏ إِذَا لَقِيتُمُ الْيَهُودَ ‏\"‏ ‏.‏ وَفِي حَدِيثِ\n ابْنِ جَعْفَرٍ عَنْ شُعْبَةَ قَالَ فِي أَهْلِ الْكِتَابِ ‏.‏ وَفِي حَدِيثِ جَرِيرٍ ‏\"‏ إِذَا لَقِيتُمُوهُمْ ‏\"‏ ‏.‏ وَلَمْ\n يُسَمِّ أَحَدًا مِنَ الْمُشْرِكِينَ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Muthanna, telah menceritakan kepada kami Muhammad bin Ja'far, telah menceritakan kepada kami Syu'bah, dan telah menceritakan kepada kami Abu Bakar bin Abi Syaibah dan Abu Kuraib, mereka berdua berkata: Telah menceritakan kepada kami Waki', daripada Sufyan, dan telah menceritakan kepadaku Zuhri bin Harb, telah menceritakan kepada kami Jarir, mereka semua daripada Suhail, dengan sanad ini.  Dan dalam hadis riwayat Waki', lafaznya: \"Apabila kamu bertemu dengan Yahudi.\" Dan dalam hadis riwayat Ibnu Ja'far daripada Syu'bah, beliau berkata: mengenai Ahli Kitab. Dan dalam hadis riwayat Jarir, lafaznya: \"Apabila kamu bertemu dengan mereka.\" Dan tidak disebut sesiapa pun daripada kalangan musyrik."
  },
  {
    "id": 12794,
    "hadith_number": 5517,
    "tajuk_hadith": "Rasulullah Menyambut Giliran Kanak-Kanak",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "Anas b. Malik reported that when Allah's Messenger (ﷺ) happened to pass by young boys he would great them.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ سَيَّارٍ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ،\n بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَرَّ عَلَى غِلْمَانٍ فَسَلَّمَ عَلَيْهِمْ ‏.‏",
    "malay_translation": "Anas bin Malik meriwayatkan bahawa apabila Rasulullah SAW  melewati kanak-kanak lelaki, baginda akan memberi salam kepada mereka."
  },
  {
    "id": 12795,
    "hadith_number": 5518,
    "tajuk_hadith": "Periwayat Hadis Dengan Sanad Yang Sama",
    "perawi_melayu": "Ismail bin Salim, melalui Hisyam, melalui Sayyar",
    "english_text": "This hadith has been narrated on the authority of Sayyar with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنِيهِ إِسْمَاعِيلُ بْنُ سَالِمٍ، أَخْبَرَنَا هُشَيْمٌ، أَخْبَرَنَا سَيَّارٌ، بِهَذَا الإِسْنَادِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan oleh Ismail bin Salim, daripada Hisyam, daripada Sayyar, dengan sanad yang sama."
  },
  {
    "id": 12796,
    "hadith_number": 5519,
    "tajuk_hadith": "Mengucap Salam Kepada Kanak-kanak",
    "perawi_melayu": "Sayyar meriwayatkan:",
    "english_text": "I was walking with Thibit al-Bunani that he happened to pass by children and he greeted them. And Thibit reported that he walked with Anas and he happened to pass by children and he greeted them. and Anas reported that he walked with Allah's Apostle (may peace be upon. him) and he happened, to pass by children and he greeted them.",
    "arabic_text": "وَحَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، وَمُحَمَّدُ بْنُ الْوَلِيدِ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا \n شُعْبَةُ، عَنْ سَيَّارٍ، قَالَ كُنْتُ أَمْشِي مَعَ ثَابِتٍ الْبُنَانِيِّ فَمَرَّ بِصِبْيَانٍ فَسَلَّمَ عَلَيْهِمْ ‏.‏ وَحَدَّثَ\n ثَابِتٌ أَنَّهُ كَانَ يَمْشِي مَعَ أَنَسٍ فَمَرَّ بِصِبْيَانٍ فَسَلَّمَ عَلَيْهِمْ ‏.‏ وَحَدَّثَ أَنَسٌ أَنَّهُ كَانَ يَمْشِي\n مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَمَرَّ بِصِبْيَانٍ فَسَلَّمَ عَلَيْهِمْ ‏.‏",
    "malay_translation": "Aku berjalan bersama Thabit al-Bunani, lalu kami bertemu dengan kanak-kanak, maka dia pun memberi salam kepada mereka. Dan Thabit meriwayatkan bahawa dia berjalan bersama Anas, lalu mereka bertemu dengan kanak-kanak, maka dia pun memberi salam kepada mereka. Dan Anas meriwayatkan bahawa dia berjalan bersama Rasulullah SAW, lalu mereka bertemu dengan kanak-kanak, maka Baginda memberi salam kepada mereka."
  },
  {
    "id": 12797,
    "hadith_number": 5520,
    "tajuk_hadith": "Tanda Keizinan Masuk Kepada Rasulullah SAW",
    "perawi_melayu": "Ibnu Mas'ud meriwayatkan:",
    "english_text": "The Messenger of Allah (ﷺ) said to me: The sign that you have been permitted to come in is that the curtain is raised or that you hear me speaking quietly until I forbid you.",
    "arabic_text": "حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، كِلاَهُمَا عَنْ عَبْدِ الْوَاحِدِ، - وَاللَّفْظُ\n لِقُتَيْبَةَ - حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا الْحَسَنُ بْنُ عُبَيْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سُوَيْدٍ،\n قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ يَزِيدَ، قَالَ سَمِعْتُ ابْنَ مَسْعُودٍ، يَقُولُ قَالَ لِي رَسُولُ اللَّهِ صلى\n الله عليه وسلم ‏\n\"‏ إِذْنُكَ عَلَىَّ أَنْ يُرْفَعَ الْحِجَابُ وَأَنْ تَسْتَمِعَ سِوَادِي حَتَّى أَنْهَاكَ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda kepadaku: \"Tanda bahawa kamu diizinkan masuk ialah apabila tirai dinaikkan atau kamu mendengar aku bercakap perlahan sehingga aku melarangmu.\""
  },
  {
    "id": 12798,
    "hadith_number": 5521,
    "tajuk_hadith": "Hadis Diriwayatkan dengan Sanad yang Sama",
    "perawi_melayu": "Abu Bakar bin Abi Syaibah, Muhammad bin Abdullah bin Numair, dan Ishaq bin Ibrahim. Ishaq berkata: “Aku diberitakan”, dan dua orang yang lain berkata: “Kami diberitakan oleh Abdullah bin Idris daripada Hasan bin Ubaidullah dengan sanad yang sama.",
    "english_text": "This hadith has been narrated on the authority of 'Ubaidullah with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ،\n قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنِ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ،\n بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Ubaidullah dengan sanad yang sama."
  },
  {
    "id": 12799,
    "hadith_number": 5522,
    "tajuk_hadith": "Keizinan Keluar untuk Memenuhi Keperluan",
    "perawi_melayu": "Aisyah meriwayatkan bahawa Saudah (semoga Allah merahmatinya) keluar (ke padang) untuk menunaikan hajatnya, walaupun selepas waktu hijab telah diwajibkan ke atas wanita.  Beliau adalah wanita yang besar tubuh badannya, menonjol di kalangan wanita lain, dan beliau tidak dapat menyembunyikan dirinya daripada orang yang mengenali beliau.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ \n أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ خَرَجَتْ سَوْدَةُ بَعْدَ مَا ضُرِبَ عَلَيْهَا الْحِجَابُ لِتَقْضِيَ حَاجَتَهَا وَكَانَتِ\n امْرَأَةً جَسِيمَةً تَفْرَعُ النِّسَاءَ جِسْمًا لاَ تَخْفَى عَلَى مَنْ يَعْرِفُهَا فَرَآهَا عُمَرُ بْنُ الْخَطَّابِ فَقَالَ\n يَا سَوْدَةُ وَاللَّهِ مَا تَخْفَيْنَ عَلَيْنَا فَانْظُرِي كَيْفَ تَخْرُجِينَ ‏.‏ قَالَتْ فَانْكَفَأَتْ رَاجِعَةً وَرَسُولُ\n اللَّهِ صلى الله عليه وسلم فِي بَيْتِي وَإِنَّهُ لَيَتَعَشَّى وَفِي يَدِهِ عَرْقٌ فَدَخَلَتْ فَقَالَتْ يَا رَسُولَ\n اللَّهِ إِنِّي خَرَجْتُ فَقَالَ لِي عُمَرُ كَذَا وَكَذَا ‏.‏ قَالَتْ فَأُوحِيَ إِلَيْهِ ثُمَّ رُفِعَ عَنْهُ وَإِنَّ الْعَرْقَ فِي\n يَدِهِ مَا وَضَعَهُ فَقَالَ ‏\n\"‏ إِنَّهُ قَدْ أُذِنَ لَكُنَّ أَنْ تَخْرُجْنَ لِحَاجَتِكُنَّ ‏\"‏ ‏.‏ وَفِي رِوَايَةِ أَبِي بَكْرٍ يَفْرَعُ\n النِّسَاءَ جِسْمُهَا ‏.‏ زَادَ أَبُو بَكْرٍ فِي حَدِيثِهِ فَقَالَ هِشَامٌ يَعْنِي الْبَرَازَ ‏.‏",
    "malay_translation": "Abu Bakar bin Abu Syaibah dan Abu Kuraib berkata: “Kami telah mendengar daripada Abu Usamah, daripada Hisyam, daripada bapanya, daripada Aisyah, katanya: Saudah keluar selepas hijab telah diwajibkan ke atasnya untuk menunaikan hajatnya. Dia adalah seorang wanita yang besar tubuh badannya, menonjol di kalangan wanita dari segi fizikal, sehingga dia tidak dapat bersembunyi daripada sesiapa yang mengenalnya. Umar bin al-Khattab melihatnya lalu berkata: ‘Wahai Saudah, demi Allah, engkau tidak dapat bersembunyi daripada kami. Oleh itu, berhati-hatilah apabila engkau keluar.’ Aisyah berkata: Maka dia pun berpatah balik. Pada ketika itu, Rasulullah SAW berada di rumahku sedang makan malam, dan di tangannya ada seketul tulang. Saudah masuk lalu berkata: ‘Wahai Rasulullah, saya telah keluar, lalu Umar berkata kepadaku begini dan begini.’ Aisyah berkata: Kemudian wahyu diturunkan kepadanya, lalu wahyu itu diangkat darinya, dan tulang itu masih di tangannya, tidak diletakkannya. Baginda bersabda: ‘Sesungguhnya kamu semua telah diizinkan untuk keluar bagi menunaikan hajat kamu.’ Dalam riwayat Abu Bakar pula, ‘tubuhnya menonjol di kalangan wanita.’ Abu Bakar menambah dalam hadisnya, Hisyam menjelaskan ia bermaksud membuang air besar.”"
  },
  {
    "id": 12800,
    "hadith_number": 5523,
    "tajuk_hadith": "Sauda binti Zam'ah: Seorang Wanita Berbadan Tegap",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Hisyam dengan sanad yang sama, dan katanya:",
    "english_text": "She (Sauda) was a woman who looked to be significant amongst the people (so far as the bulk of her) body was concerned. The rest of the hadith is the same.",
    "arabic_text": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا هِشَامٌ، بِهَذَا الإِسْنَادِ وَقَالَ وَكَانَتِ\n امْرَأَةً يَفْرَعُ النَّاسَ جِسْمُهَا ‏.‏ قَالَ وَإِنَّهُ لَيَتَعَشَّى ‏.‏ \n وَحَدَّثَنِيهِ سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ ‏.‏",
    "malay_translation": "Dan telah menceritakan kepada kami Abu Kuraib, telah menceritakan kepada kami Ibnu Numair, telah menceritakan kepada kami Hisyam, dengan sanad ini dan berkata:  Dan (Sauda) adalah seorang wanita yang tubuhnya tampak tegap di kalangan manusia.  Beliau berkata:  Sesungguhnya beliau (Sauda) makan malam. Dan telah menceritakan kepadaku Suwaid bin Sa'id, telah menceritakan kepada kami Ali bin Mushir, daripada Hisyam, dengan sanad ini."
  },
  {
    "id": 12801,
    "hadith_number": 5524,
    "tajuk_hadith": "Kisah Wanita Sahabat Rasulullah SAW dan Wahyu Mengenai Jilbab",
    "perawi_melayu": "Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلُ بْنُ،\n خَالِدٍ عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، أَنَّ أَزْوَاجَ، رَسُولِ اللَّهِ صلى الله\n عليه وسلم كُنَّ يَخْرُجْنَ بِاللَّيْلِ إِذَا تَبَرَّزْنَ إِلَى الْمَنَاصِعِ وَهُوَ صَعِيدٌ أَفْيَحُ وَكَانَ عُمَرُ بْنُ\n الْخَطَّابِ يَقُولُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم احْجُبْ نِسَاءَكَ ‏.‏ فَلَمْ يَكُنْ رَسُولُ اللَّهِ صلى\n الله عليه وسلم يَفْعَلُ فَخَرَجَتْ سَوْدَةُ بِنْتُ زَمْعَةَ زَوْجُ النَّبِيِّ صلى الله عليه وسلم لَيْلَةً مِنَ\n اللَّيَالِي عِشَاءً وَكَانَتِ امْرَأَةً طَوِيلَةً فَنَادَاهَا عُمَرُ أَلاَ قَدْ عَرَفْنَاكِ يَا سَوْدَةُ ‏.‏ حِرْصًا عَلَى\n أَنْ يُنْزِلَ الْحِجَابَ ‏.‏ قَالَتْ عَائِشَةُ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ الْحِجَابَ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abd Malik bin Syu'aib bin Laits, telah menceritakan kepadaku ayahku, daripada datukku, telah menceritakan kepadaku Uqail bin Khalid daripada Ibnu Syihab, daripada Urwah bin Zubair, daripada Aisyah, bahawa isteri-isteri Rasulullah SAW biasa keluar pada waktu malam apabila mereka hendak ke tempat-tempat lapang (di pinggir Madinah) untuk membuang hajat. Umar bin Khattab pernah berkata kepada Rasulullah SAW: “Tutupilah isteri-isterimu.”  Namun Rasulullah SAW tidak melakukannya. Kemudian keluarlah Saudah binti Zam'ah, isteri Nabi SAW pada suatu malam. Beliau seorang wanita yang tinggi. Lalu Umar memanggilnya: “Wahai Saudah, kami telah mengenali engkau.” (Dia melakukan ini dengan harapan ayat-ayat tentang hijab akan diturunkan.) Aisyah berkata: Kemudian Allah SWT menurunkan ayat-ayat tentang hijab."
  },
  {
    "id": 12802,
    "hadith_number": 5525,
    "tajuk_hadith": "Sanad Hadith yang Sama",
    "perawi_melayu": "Ibn Shihab dan Sanad yang Sama",
    "english_text": "This hadith has been narrated on the authority of Ibn Shihab with the same chain of transmitters.",
    "arabic_text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ،\n عَنِ ابْنِ شِهَابٍ، بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏",
    "malay_translation": "Hadis ini telah diriwayatkan daripada Ibn Shihab dengan sanad (rantaian periwayat) yang sama."
  },
  {
    "id": 12803,
    "hadith_number": 5526,
    "tajuk_hadith": "Larangan Bermalam dengan Wanita Berkahwin",
    "perawi_melayu": "Jabir meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Behold, no person should spend the night with a married woman, but only in case he is married to her or he is her Mahram.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَعَلِيُّ بْنُ حُجْرٍ، قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ ابْنُ حُجْرٍ، حَدَّثَنَا \n هُشَيْمٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، ح \n وَحَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا أَبُو الزُّبَيْرِ،\n عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَلاَ لاَ يَبِيتَنَّ رَجُلٌ عِنْدَ امْرَأَةٍ ثَيِّبٍ\n إِلاَّ أَنْ يَكُونَ نَاكِحًا أَوْ ذَا مَحْرَمٍ ‏\"‏ ‏.‏",
    "malay_translation": "Ingatlah, seseorang lelaki tidak boleh bermalam dengan wanita yang telah berkahwin melainkan jika dia adalah suami kepada wanita itu atau mahramnya."
  },
  {
    "id": 12804,
    "hadith_number": 5527,
    "tajuk_hadith": "Elakkan Berjumpa Wanita Secara Bersendirian",
    "perawi_melayu": "Uqba bin Amir meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Beware of getting, into the houses and meeting women (in seclusion). A person from the Ansar said: Allah's Messenger, what about husband's brother, whereupon he (ﷺ) said: Husband's brother is like death.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ \n يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم\n قَالَ ‏\"‏ إِيَّاكُمْ وَالدُّخُولَ عَلَى النِّسَاءِ ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ مِنَ الأَنْصَارِ يَا رَسُولَ اللَّهِ أَفَرَأَيْتَ\n الْحَمْوَ قَالَ ‏\"‏ الْحَمْوُ الْمَوْتُ ‏\"‏ ‏.‏",
    "malay_translation": "Jauhilah daripada memasuki rumah dan bertemu wanita secara bersendirian. Seorang lelaki daripada kalangan Ansar bertanya: Wahai Rasulullah, bagaimana pula dengan saudara ipar? Baginda SAW menjawab: Saudara ipar itu seperti maut."
  },
  {
    "id": 12805,
    "hadith_number": 5528,
    "tajuk_hadith": "Periwayat Hadis Yazid bin Abu Habib",
    "perawi_melayu": "Yazid bin Abu Habib",
    "english_text": "This hadith has been narrated on the authority of Yazid b. Abu Habib with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، وَاللَّيْثِ،\n بْنِ سَعْدٍ وَحَيْوَةَ بْنِ شُرَيْحٍ وَغَيْرِهِمْ أَنَّ يَزِيدَ بْنَ أَبِي حَبِيبٍ، حَدَّثَهُمْ بِهَذَا الإِسْنَادِ، مِثْلَهُ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan melalui Yazid bin Abu Habib dengan sanad yang sama."
  },
  {
    "id": 12806,
    "hadith_number": 5529,
    "tajuk_hadith": "Maksud Al-Hamv",
    "perawi_melayu": "Ibn Wahb meriwayatkan:",
    "english_text": "I heard Laith b. Said as saying: Al-Hamv means the brother of husband or like it from amongst the relatives of the husband, for example, cousin, etc.",
    "arabic_text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، قَالَ سَمِعْتُ اللَّيْثَ بْنَ سَعْدٍ، يَقُولُ الْحَمْوُ\n أَخُ الزَّوْجِ وَمَا أَشْبَهَهُ مِنْ أَقَارِبِ الزَّوْجِ ابْنُ الْعَمِّ وَنَحْوُهُ ‏.‏",
    "malay_translation": "Aku mendengar Laith bin Sa'ad berkata: Al-Hamv bermaksud saudara lelaki suami atau yang serupa dengannya daripada kalangan kaum kerabat suami, contohnya, sepupu dan sebagainya."
  },
  {
    "id": 12807,
    "hadith_number": 5530,
    "tajuk_hadith": "Kebebasan Asma' binti Umays dan Larangan Masuk Rumah Tanpa Teman",
    "perawi_melayu": "'Abdullah bin 'Amr bin al-'As",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، ح وَحَدَّثَنِي \n أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، أَنَّ بَكْرَ بْنَ سَوَادَةَ، حَدَّثَهُ أَنَّ\n عَبْدَ الرَّحْمَنِ بْنَ جُبَيْرٍ حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ حَدَّثَهُ أَنَّ نَفَرًا مِنْ بَنِي هَاشِمٍ\n دَخَلُوا عَلَى أَسْمَاءَ بِنْتِ عُمَيْسٍ فَدَخَلَ أَبُو بَكْرٍ الصِّدِّيقُ وَهِيَ تَحْتَهُ يَوْمَئِذٍ فَرَآهُمْ فَكَرِهَ\n ذَلِكَ فَذَكَرَ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَقَالَ لَمْ أَرَ إِلاَّ خَيْرًا ‏.‏ فَقَالَ رَسُولُ اللَّهِ\n صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ قَدْ بَرَّأَهَا مِنْ ذَلِكَ ‏\"‏ ‏.‏ ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم عَلَى الْمِنْبَرِ فَقَالَ ‏\"‏ لاَ يَدْخُلَنَّ رَجُلٌ بَعْدَ يَوْمِي هَذَا عَلَى مُغِيبَةٍ إِلاَّ وَمَعَهُ رَجُلٌ أَوِ\n اثْنَانِ ‏\"‏ ‏.‏",
    "malay_translation": "Kami telah diberitakan oleh Harun bin Ma'ruf, yang telah diberitakan kepadanya oleh Abdullah bin Wahb, yang telah menceritakan kepadaku oleh Amru, dan aku juga telah diberitakan oleh Abu Thahir, yang telah memberitakan kepada kami oleh Abdullah bin Wahb, daripada Amru bin al-Harits, bahawa Bakar bin Suadah telah menceritakan kepadanya bahawa Abdur Rahman bin Jubair telah menceritakan kepadanya bahawa Abdullah bin Amr bin al-'Ash telah menceritakan kepadanya bahawa sekumpulan daripada Bani Hashim telah masuk ke rumah Asma' binti Umays.  Kemudian Abu Bakar al-Siddiq masuk (ketika itu Asma' isterinya).  Beliau melihat mereka dan tidak menyukainya, lalu beliau menceritakan perkara itu kepada Rasulullah SAW dan berkata, \"Aku hanya melihat kebaikan.\" Maka Rasulullah SAW bersabda, \"Sesungguhnya Allah telah membersihkannya daripada perkara itu.\" Kemudian Rasulullah SAW berdiri di atas mimbar dan bersabda, \"Janganlah seorang lelaki selepas hari ini masuk ke rumah wanita yang suaminya tiada kecuali bersama seorang atau dua orang lelaki.\""
  },
  {
    "id": 12808,
    "hadith_number": 5531,
    "tajuk_hadith": "Syaitan Beredar dalam Tubuh Manusia Seperti Darah",
    "perawi_melayu": "Anas meriwayatkan bahawa ketika Rasulullah SAW berada bersama salah seorang isterinya, seorang lelaki lalu di situ.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ الْبُنَانِيِّ،\n عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ مَعَ إِحْدَى نِسَائِهِ فَمَرَّ بِهِ رَجُلٌ فَدَعَاهُ فَجَاءَ\n فَقَالَ ‏\"‏ يَا فُلاَنُ هَذِهِ زَوْجَتِي فُلاَنَةُ ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ مَنْ كُنْتُ أَظُنُّ بِهِ فَلَمْ أَكُنْ\n أَظُنُّ بِكَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ الشَّيْطَانَ يَجْرِي مِنَ الإِنْسَانِ مَجْرَى\n الدَّمِ ‏\"‏ ‏.‏",
    "malay_translation": "Abdullah bin Maslamah bin Qa'nab telah meriwayatkan daripada Hammad bin Salamah, daripada Tsabit al-Bunani, daripada Anas bahawa Nabi SAW berada bersama salah seorang isterinya. Lalu seorang lelaki lalu di situ, lalu Baginda memanggilnya.  Setelah lelaki itu datang, Baginda berkata, \"Wahai fulan, ini ialah isteriku, fulanah.\" Lelaki itu berkata, \"Wahai Rasulullah, sesungguhnya saya tidak pernah syak kepada sesiapa pun seperti yang saya tidak pernah syak kepada tuan.\" Rasulullah SAW bersabda, \"Sesungguhnya syaitan itu mengalir dalam tubuh manusia sebagaimana darah mengalir.\""
  },
  {
    "id": 12809,
    "hadith_number": 5532,
    "tajuk_hadith": "Kehati-hatian Nabi SAW terhadap bisikan syaitan",
    "perawi_melayu": "Safiyyah binti Huyay (isteri Rasulullah SAW)",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، - وَتَقَارَبَا فِي اللَّفْظِ - قَالاَ أَخْبَرَنَا \n عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، عَنْ صَفِيَّةَ بِنْتِ حُيَىٍّ، قَالَتْ\n كَانَ النَّبِيُّ صلى الله عليه وسلم مُعْتَكِفًا فَأَتَيْتُهُ أَزُورُهُ لَيْلاً فَحَدَّثْتُهُ ثُمَّ قُمْتُ لأَنْقَلِبَ فَقَامَ\n مَعِيَ لِيَقْلِبَنِي ‏.‏ وَكَانَ مَسْكَنُهَا فِي دَارِ أُسَامَةَ بْنِ زَيْدٍ فَمَرَّ رَجُلاَنِ مِنَ الأَنْصَارِ فَلَمَّا رَأَيَا\n النَّبِيَّ صلى الله عليه وسلم أَسْرَعَا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ عَلَى رِسْلِكُمَا إِنَّهَا\n صَفِيَّةُ بِنْتُ حُيَىٍّ ‏\"‏ ‏.‏ فَقَالاَ سُبْحَانَ اللَّهِ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ إِنَّ الشَّيْطَانَ يَجْرِي مِنَ\n الإِنْسَانِ مَجْرَى الدَّمِ وَإِنِّي خَشِيتُ أَنْ يَقْذِفَ فِي قُلُوبِكُمَا شَرًّا ‏\"‏ ‏.‏ أَوْ قَالَ ‏\"‏ شَيْئًا ‏\"‏ ‏.‏",
    "malay_translation": "Kami diberitakan oleh Ishaq bin Ibrahim dan Abd bin Humaid – dan keduanya hampir sama lafaznya – mereka berkata: “Telah menceritakan kepada kami Abdurrazzaq, telah menceritakan kepada kami Ma’mar dari Az Zuhri dari Ali bin Husain dari Safiyyah binti Huyay, katanya:  Rasulullah SAW sedang beriktikaf, maka aku datang melawatnya pada waktu malam, lalu aku bercakap-cakap dengan baginda, kemudian aku bangun untuk pulang, maka baginda bangun bersamaku untuk mengiringiku.  Dan tempat tinggalnya ketika itu di rumah Usamah bin Zaid.  Lalu lalu dua orang lelaki dari kalangan Ansar, maka apabila mereka melihat Rasulullah SAW, mereka segera mempercepatkan langkah. Maka Rasulullah SAW bersabda: “Perlahan-lahan kamu berdua, sesungguhnya dia itu Safiyyah binti Huyay.”  Maka mereka berdua berkata: “Maha Suci Allah, wahai Rasulullah.” Baginda bersabda: “Sesungguhnya syaitan itu mengalir dalam tubuh manusia sebagaimana aliran darah, dan sesungguhnya aku bimbang ia akan menanamkan sesuatu kejahatan di dalam hati kamu berdua.” atau baginda bersabda: “sesuatu”."
  },
  {
    "id": 12810,
    "hadith_number": 5533,
    "tajuk_hadith": "Ziarah Safiah kepada Nabi SAW semasa I'tikaf",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Safiyyah, isteri Rasulullah SAW, melalui beberapa sanad.",
    "english_text": "\" She went to Allah's Apostle (ﷺ) to visit him as he was observing I'tikaf in the mosque during Ramadan. She talked with him for some time and then stood up to go back and Allikh's Apostle (ﷺ) stood up in order to bid her good-bye.\" The rest of the hadith is the same except with the variation of the words that Allah's Apostle (ﷺ) said:\" Satan penetrates in man like the penetration of blood (in every part of body).\"",
    "arabic_text": "وَحَدَّثَنِيهِ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ،\n عَنِ الزُّهْرِيِّ، أَخْبَرَنَا عَلِيُّ بْنُ حُسَيْنٍ، أَنَّ صَفِيَّةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ\n أَنَّهَا جَاءَتْ إِلَى النَّبِيِّ صلى الله عليه وسلم تَزُورُهُ فِي اعْتِكَافِهِ فِي الْمَسْجِدِ فِي الْعَشْرِ\n الأَوَاخِرِ مِنْ رَمَضَانَ فَتَحَدَّثَتْ عِنْدَهُ سَاعَةً ثُمَّ قَامَتْ تَنْقَلِبُ وَقَامَ النَّبِيُّ صلى الله عليه وسلم\n يَقْلِبُهَا ‏.‏ ثُمَّ ذَكَرَ بِمَعْنَى حَدِيثِ مَعْمَرٍ غَيْرَ أَنَّهُ قَالَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ\n الشَّيْطَانَ يَبْلُغُ مِنَ الإِنْسَانِ مَبْلَغَ الدَّمِ ‏\"‏ ‏.‏ وَلَمْ يَقُلْ ‏\"‏ يَجْرِي ‏\"‏ ‏.‏",
    "malay_translation": "Safiyyah, isteri Nabi SAW, menceritakan bahawa beliau telah datang melawat Nabi SAW ketika baginda sedang beriktikaf di masjid pada sepuluh hari terakhir Ramadan. Beliau berbual seketika dengan baginda, kemudian bangun untuk pulang, dan Nabi SAW turut bangun untuk mengucapkan selamat tinggal kepadanya. Kemudian,  di sebutkan maksud hadis Ma'mar, kecuali bahawa Nabi SAW bersabda:  \"Sesungguhnya syaitan itu meliputi manusia seperti darah meliputi tubuh.\"  Dan tidak disebut perkataan \"mengalir\"."
  },
  {
    "id": 12811,
    "hadith_number": 5534,
    "tajuk_hadith": "Tiga Orang di Masjid",
    "perawi_melayu": "Abu Waqid al-Laith",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، فِيمَا قُرِئَ عَلَيْهِ عَنْ إِسْحَاقَ بْنِ عَبْدِ،\n اللَّهِ بْنِ أَبِي طَلْحَةَ أَنَّ أَبَا مُرَّةَ، مَوْلَى عَقِيلِ بْنِ أَبِي طَالِبٍ أَخْبَرَهُ عَنْ أَبِي وَاقِدٍ اللَّيْثِيِّ، أَنَّالله عليه وسلم بَيْنَمَا هُوَ جَالِسٌ فِي الْمَسْجِدِ وَالنَّاسُ مَعَهُ إِذْ أَقْبَلَ نَفَرٌ\n ثَلاَثَةٌ فَأَقْبَلَ اثْنَانِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَذَهَبَ وَاحِدٌ ‏.‏ قَالَ فَوَقَفَا عَلَى\n رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَمَّا أَحَدُهُمَا فَرَأَى فُرْجَةً فِي الْحَلْقَةِ فَجَلَسَ فِيهَا وَأَمَّا\n الآخَرُ فَجَلَسَ خَلْفَهُمْ وَأَمَّا الثَّالِثُ فَأَدْبَرَ ذَاهِبًا فَلَمَّا فَرَغَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n قَالَ ‏\n\"‏ أَلاَ أُخْبِرُكُمْ عَنِ النَّفَرِ الثَّلاَثَةِ أَمَّا أَحَدُهُمْ فَأَوَى إِلَى اللَّهِ فَآوَاهُ اللَّهُ وَأَمَّا الآخَرُ فَاسْتَحْيَا\n فَاسْتَحْيَا اللَّهُ مِنْهُ وَأَمَّا الآخَرُ فَأَعْرَضَ فَأَعْرَضَ اللَّهُ عَنْهُ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Waqid al-Laith meriwayatkan bahawa Rasulullah SAW sedang duduk di masjid bersama beberapa orang ramai, ketika tiba tiga orang; dua daripadanya menghampiri Rasulullah SAW, dan seorang lagi pergi. Dua orang itu berdiri di sisi Rasulullah SAW, dan seorang daripadanya menemui ruang di kalangan jemaah lalu duduk di situ; dan seorang lagi duduk di belakang mereka, manakala yang ketiga pergi. Setelah Rasulullah SAW selesai urusannya, Baginda bersabda:  \"Tidakkah aku beritahu kamu tentang tiga orang ini? Seorang daripadanya berlindung kepada Allah, maka Allah melindunginya; seorang lagi merasa malu, maka Allah merahmati kemaluannya (lalu di tempatkan dalam majlis tersebut), dan seorang lagi berpaling, maka Allah berpaling daripadanya.\""
  },
  {
    "id": 12812,
    "hadith_number": 5535,
    "tajuk_hadith": "Sanad Hadith daripada Ishaq bin Abdullah bin Talhah",
    "perawi_melayu": "Ahmad bin al-Mundzir, Abd as-Samad, Harb bin Syaddad, Ishaq bin Mansur, Habban, Aban, Yahya bin Abi Kathir, dan Ishaq bin Abdullah bin Abi Talhah.",
    "english_text": "This hadith has been reported on the authority of Ishaq b. 'Abdullah b. Talha with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَا أَحْمَدُ بْنُ الْمُنْذِرِ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا حَرْبٌ، - وَهُوَ ابْنُ شَدَّادٍ -\n ح وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا حَبَّانُ، حَدَّثَنَا أَبَانٌ، قَالاَ جَمِيعًا حَدَّثَنَا يَحْيَى بْنُ،\n أَبِي كَثِيرٍ أَنَّ إِسْحَاقَ بْنَ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، حَدَّثَهُ فِي، هَذَا الإِسْنَادِ بِمِثْلِهِ فِي الْمَعْنَى\n ‏.‏",
    "malay_translation": "Hadith ini telah diriwayatkan daripada Ishaq bin Abdullah bin Abi Talhah dengan sanad yang sama.  (Perawi: Ahmad bin al-Mundzir, Abd as-Samad, Harb bin Syaddad, Ishaq bin Mansur, Habban, Aban, Yahya bin Abi Kathir, dan Ishaq bin Abdullah bin Abi Talhah telah meriwayatkan hadith ini dengan maksud yang sama melalui sanad masing-masing.)"
  },
  {
    "id": 12813,
    "hadith_number": 5536,
    "tajuk_hadith": "Jangan Menduduki Tempat Orang Lain dalam Majlis",
    "perawi_melayu": "Ibn Umar meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "None of you should make another one stand in the meeting and then occupy his place.",
    "arabic_text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، أَخْبَرَنَا \n اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يُقِيمَنَّ أَحَدُكُمُ الرَّجُلَ\n مِنْ مَجْلِسِهِ ثُمَّ يَجْلِسُ فِيهِ ‏\"‏ ‏.‏",
    "malay_translation": "Tiada seorang pun di antara kamu hendaklah menyuruh orang lain berdiri daripada tempat duduknya dalam majlis, kemudian dia menduduki tempat itu."
  },
  {
    "id": 12814,
    "hadith_number": 5537,
    "tajuk_hadith": "Memberi Laluan dan Keselesaan",
    "perawi_melayu": "Ibnu Umar meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "No person should ask another person to stand at his place and then he should himself sit there, but he should simply say: Make room and accommodate.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي،\n ح وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى، - وَهْوَ الْقَطَّانُ - ح وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا \n عَبْدُ الْوَهَّابِ، - يَعْنِي الثَّقَفِيَّ - كُلُّهُمْ عَنْ عُبَيْدِ اللَّهِ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، -\n وَاللَّفْظُ لَهُ - حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، وَأَبُو أُسَامَةَ وَابْنُ نُمَيْرٍ قَالُوا حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ،\n عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يُقِيمُ الرَّجُلُ الرَّجُلَ مِنْ مَقْعَدِهِ ثُمَّ\n يَجْلِسُ فِيهِ وَلَكِنْ تَفَسَّحُوا وَتَوَسَّعُوا ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah seseorang meminta orang lain bangun dari tempat duduknya, kemudian dia sendiri duduk di tempat itu. Sebaliknya, hendaklah dia berkata: “Berilah ruang dan tempat.”"
  },
  {
    "id": 12815,
    "hadith_number": 5538,
    "tajuk_hadith": "Variasi Perawi Hadis daripada Ibnu Umar",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَا أَبُو الرَّبِيعِ، وَأَبُو كَامِلٍ قَالاَ حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، ح وَحَدَّثَنِي يَحْيَى،\n بْنُ حَبِيبٍ حَدَّثَنَا رَوْحٌ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَحَدَّثَنَا عَبْدُ الرَّزَّاقِ، كِلاَهُمَا عَنِ ابْنِ،\n جُرَيْجٍ ح وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنَا الضَّحَّاكُ، - يَعْنِي ابْنَ عُثْمَانَ\n - كُلُّهُمْ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ بِمِثْلِ حَدِيثِ اللَّيْثِ وَلَمْ\n يَذْكُرُوا فِي الْحَدِيثِ ‏\n\"‏ وَلَكِنْ تَفَسَّحُوا وَتَوَسَّعُوا ‏\"‏ ‏.‏ وَزَادَ فِي حَدِيثِ ابْنِ جُرَيْجٍ قُلْتُ فِي\n يَوْمِ الْجُمُعَةِ قَالَ فِي يَوْمِ الْجُمُعَةِ وَغَيْرِهَا ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Ibnu Umar melalui beberapa sanad (rantaian perawi) yang berbeza, dengan sedikit perbezaan lafaz."
  },
  {
    "id": 12816,
    "hadith_number": 5539,
    "tajuk_hadith": "Adab Duduk Bersama Saudara",
    "perawi_melayu": "Ibnu Umar meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "None should make one's brother stand and then sit at his place (and it was common with) Ibn Umar that when any person stood in the company (with a view to making room for him) he did not sit there.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ،\n عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يُقِيمَنَّ أَحَدُكُمْ أَخَاهُ ثُمَّ يَجْلِسُ فِي\n مَجْلِسِهِ ‏\"‏ ‏.‏ وَكَانَ ابْنُ عُمَرَ إِذَا قَامَ لَهُ رَجُلٌ عَنْ مَجْلِسِهِ لَمْ يَجْلِسْ فِيهِ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Janganlah seorang di antara kamu menyuruh saudaranya berdiri kemudian dia duduk di tempatnya.\"  Ibnu Umar pula, jika seseorang bangun dari tempat duduknya untuk memberi tempat kepadanya, Ibnu Umar tidak akan duduk di tempat itu."
  },
  {
    "id": 12817,
    "hadith_number": 5540,
    "tajuk_hadith": "Hadis Riwayat Ma'mar",
    "perawi_melayu": "Daripada Ma'mar melalui sanad yang sama.",
    "english_text": "This hadith has been reported on the authority of Ma'mar with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَاهُ عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Ma'mar melalui jalan periwayatan yang sama."
  },
  {
    "id": 12818,
    "hadith_number": 5541,
    "tajuk_hadith": "Menghormati Tempat Solat Jumaat",
    "perawi_melayu": "Jabir meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "None amongst you should make his brother stand on Friday (during the congregational prayer) and then occupy his-place. but he should only say to him (Accommodate me).",
    "arabic_text": "وَحَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، - وَهُوَ ابْنُ عُبَيْدِ\n اللَّهِ - عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يُقِيمَنَّ أَحَدُكُمْ\n أَخَاهُ يَوْمَ الْجُمُعَةِ ثُمَّ لْيُخَالِفْ إِلَى مَقْعَدِهِ فَيَقْعُدَ فِيهِ وَلَكِنْ يَقُولُ افْسَحُوا ‏\"‏ ‏.‏",
    "malay_translation": "Tidak sepatutnya seorang daripada kamu membuat saudaranya berdiri pada hari Jumaat (semasa solat Jumaat) kemudian menduduki tempatnya.  Sebaliknya, hendaklah dia berkata, \"Berilah laluan.\" "
  },
  {
    "id": 12819,
    "hadith_number": 5542,
    "tajuk_hadith": "Hak Keutamaan Tempat Duduk",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "When anyone amongst you stands up, and in the badltb transmitted on the authority of Abu 'Awina, the words are:\" He who stands in his place and (goes away) and then comes back to it, he his the greatest right (to occupy that).",
    "arabic_text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، أَخْبَرَنَا أَبُو عَوَانَةَ، وَقَالَ، قُتَيْبَةُ أَيْضًا حَدَّثَنَا عَبْدُ الْعَزِيزِ،\n - يَعْنِي ابْنَ مُحَمَّدٍ - كِلاَهُمَا عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى\n الله عليه وسلم قَالَ ‏\"‏ إِذَا قَامَ أَحَدُكُمْ ‏\"‏ ‏.‏ وَفِي حَدِيثِ أَبِي عَوَانَةَ ‏\"‏ مَنْ قَامَ مِنْ مَجْلِسِهِ\n ثُمَّ رَجَعَ إِلَيْهِ فَهُوَ أَحَقُّ بِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila seseorang di antara kamu bangun, dan dalam riwayat daripada Abu 'Awana, katanya: \"Barangsiapa yang bangun dari tempat duduknya kemudian kembali ke tempat itu, maka dia lebih berhak ke atasnya.\""
  },
  {
    "id": 12820,
    "hadith_number": 5543,
    "tajuk_hadith": "Larangan Mengunjungi Orang Berkelainan Jantina",
    "perawi_melayu": "Umm Salamah meriwayatkan bahawa baginda mempunyai seorang hermafrodit (sebagai hamba) di rumahnya. Rasulullah SAW pernah berada di rumah itu, lalu orang tersebut berkata kepada saudara lelaki Umm Salamah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا إِسْحَاقُ،\n بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، كُلُّهُمْ عَنْ هِشَامٍ، ح\n وَحَدَّثَنَا أَبُو كُرَيْبٍ، أَيْضًا - وَاللَّفْظُ هَذَا - حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ،\n بِنْتِ أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَ، أَنَّ مُخَنَّثًا، كَانَ عِنْدَهَا وَرَسُولُ اللَّهِ صلى الله عليه وسلم فِي\n الْبَيْتِ فَقَالَ لأَخِي أُمِّ سَلَمَةَ يَا عَبْدَ اللَّهِ بْنَ أَبِي أُمَيَّةَ إِنْ فَتَحَ اللَّهُ عَلَيْكُمُ الطَّائِفَ غَدًا فَإِنِّي\n أَدُلُّكَ عَلَى بِنْتِ غَيْلاَنَ فَإِنَّهَا تُقْبِلُ بِأَرْبَعٍ وَتُدْبِرُ بِثَمَانٍ ‏.‏ قَالَ فَسَمِعَهُ رَسُولُ اللَّهِ صلى\n الله عليه وسلم فَقَالَ ‏\n\"‏ لاَ يَدْخُلْ هَؤُلاَءِ عَلَيْكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Umm Salamah meriwayatkan bahawa baginda mempunyai seorang hermafrodit (sebagai hamba) di rumahnya. Rasulullah SAW pernah berada di rumah itu, lalu orang tersebut berkata kepada saudara lelaki Umm Salamah: \"Wahai Abdullah bin Abi Umaiyah, jika Allah SWT memberikan kemenangan kepada kamu di Taif esok hari, nescaya aku akan tunjukkan kepadamu anak perempuan Ghailān, kerana dia mempunyai empat lipatan di bahagian hadapan perutnya dan lapan lipatan di bahagian belakang.\"  Rasulullah SAW mendengarnya lalu bersabda:  \"Mereka seumpama itu tidak boleh datang melawat kamu.\""
  },
  {
    "id": 12821,
    "hadith_number": 5544,
    "tajuk_hadith": "Perihal Seorang Hermafrodit yang Mengunjungi Isteri-isteri Nabi",
    "perawi_melayu": "Aisyah",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ،\n عَنْ عَائِشَةَ، قَالَتْ كَانَ يَدْخُلُ عَلَى أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم مُخَنَّثٌ فَكَانُوا يَعُدُّونَهُ\n مِنْ غَيْرِ أُولِي الإِرْبَةِ - قَالَ - فَدَخَلَ النَّبِيُّ صلى الله عليه وسلم يَوْمًا وَهُوَ عِنْدَ بَعْضِ\n نِسَائِهِ وَهُوَ يَنْعَتُ امْرَأَةً قَالَ إِذَا أَقْبَلَتْ أَقْبَلَتْ بِأَرْبَعٍ وَإِذَا أَدْبَرَتْ أَدْبَرَتْ بِثَمَانٍ ‏.‏ فَقَالَ\n النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ أَلاَ أَرَى هَذَا يَعْرِفُ مَا هَا هُنَا لاَ يَدْخُلَنَّ عَلَيْكُنَّ ‏\"‏ ‏.‏ قَالَتْ\n فَحَجَبُوهُ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abd bin Humaid, telah memberitakan kepada kami Abdur Razzaq, dari Ma'mar, dari Az Zuhri, dari Urwah, dari Aisyah, dia berkata: “Dahulu seorang hermafrodit biasa memasuki isteri-isteri Nabi SAW. Mereka menganggapnya bukan dari kalangan yang mempunyai nafsu syahwat. Kemudian, suatu hari Nabi SAW masuk ketika dia berada di sisi sebahagian isterinya.  Baginda SAW ketika itu sedang menggambarkan ciri-ciri tubuh seorang wanita dengan berkata, ‘Apabila dia menghadap, dia kelihatan mempunyai empat lipatan, dan apabila dia membelakangi, dia kelihatan mempunyai lapan lipatan.’ Maka Nabi SAW bersabda:  ‘Tidakkah aku nampak bahawa orang ini mengetahui apa yang ada di sini? Dia tidak dibenarkan lagi masuk kepada kamu.’  Maka mereka pun menghalang (hermafrodit) itu.”"
  },
  {
    "id": 12822,
    "hadith_number": 5545,
    "tajuk_hadith": "Kehidupan Asma' binti Abu Bakar",
    "perawi_melayu": "Asma' binti Abu Bakar",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ أَبُو كُرَيْبٍ الْهَمْدَانِيُّ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، أَخْبَرَنِي \n أَبِي، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، قَالَتْ تَزَوَّجَنِي الزُّبَيْرُ وَمَا لَهُ فِي الأَرْضِ مِنْ مَالٍ وَلاَ مَمْلُوكٍ\n وَلاَ شَىْءٍ غَيْرَ فَرَسِهِ - قَالَتْ - فَكُنْتُ أَعْلِفُ فَرَسَهُ وَأَكْفِيهِ مَئُونَتَهُ وَأَسُوسُهُ وَأَدُقُّ النَّوَى\n لِنَاضِحِهِ وَأَعْلِفُهُ وَأَسْتَقِي الْمَاءَ وَأَخْرِزُ غَرْبَهُ وَأَعْجِنُ وَلَمْ أَكُنْ أُحْسِنُ أَخْبِزُ وَكَانَ يَخْبِزُ\n لِي جَارَاتٌ مِنَ الأَنْصَارِ وَكُنَّ نِسْوَةَ صِدْقٍ - قَالَتْ - وَكُنْتُ أَنْقُلُ النَّوَى مِنْ أَرْضِ الزُّبَيْرِ\n الَّتِي أَقْطَعَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى رَأْسِي وَهْىَ عَلَى ثُلُثَىْ فَرْسَخٍ - قَالَتْ\n - فَجِئْتُ يَوْمًا وَالنَّوَى عَلَى رَأْسِي فَلَقِيتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَمَعَهُ نَفَرٌ مِنْ\n أَصْحَابِهِ فَدَعَانِي ثُمَّ قَالَ ‏\n\"‏ إِخْ إِخْ ‏\"‏ ‏.‏ لِيَحْمِلَنِي خَلْفَهُ - قَالَتْ - فَاسْتَحْيَيْتُ وَعَرَفْتُ\n غَيْرَتَكَ فَقَالَ وَاللَّهِ لَحَمْلُكِ النَّوَى عَلَى رَأْسِكِ أَشَدُّ مِنْ رُكُوبِكِ مَعَهُ ‏.‏ قَالَتْ حَتَّى أَرْسَلَ إِلَىَّ\n أَبُو بَكْرٍ بَعْدَ ذَلِكَ بِخَادِمٍ فَكَفَتْنِي سِيَاسَةَ الْفَرَسِ فَكَأَنَّمَا أَعْتَقَتْنِي ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Al-Ala', Abu Kuraib Al-Hamdani, telah menceritakan kepada kami Abu Usamah, dari Hisyam, telah memberitakan kepadaku ayahku, dari Asma' binti Abu Bakar, dia berkata: Zubair menikahiku, dan dia tidak memiliki harta di dunia ini, tidak pula hamba sahaya, dan tidak pula apa pun selain kudanya.  Katanya: Maka aku memberi makan kudanya, dan aku menanggung kebutuhannya, dan aku merawatnya, dan aku menumbuk kurma untuk untanya, dan aku memberi makan untanya, dan aku mengambil air untuknya, dan aku memperbaiki timbanya yang terbuat dari kulit, dan aku menguli adonan. Tetapi aku tidak pandai memanggang roti, maka tetangga-tetanggaku dari kalangan Ansar memanggang roti untukku, dan mereka adalah wanita-wanita yang jujur. Katanya: Dan aku membawa kurma dari tanah Zubair yang telah dihadiahkan oleh Rasulullah ﷺ kepadanya di kepalaku, dan jaraknya sekitar dua pertiga farsakh. Katanya: Kemudian pada suatu hari aku datang sambil membawa kurma di kepalaku, lalu aku bertemu Rasulullah ﷺ beserta beberapa sahabatnya. Maka beliau memanggilku, kemudian beliau berkata: “ikh ikh…” agar aku naik di belakang beliau. Katanya: Maka aku merasa malu dan aku ingat rasa cemburumu. Maka dia berkata: Demi Allah, sesungguhnya membawamu kurma di kepalamu itu lebih berat daripada kamu naik bersama beliau. Katanya: Hingga kemudian Abu Bakar mengirim seorang hamba perempuan kepadaku, yang kemudian mengurus kuda itu bagiku, maka seolah-olah dia telah membebaskanku."
  },
  {
    "id": 12823,
    "hadith_number": 5546,
    "tajuk_hadith": "Asma' binti Abu Bakar RA dan Perkhidmatan Rumah Tangga serta Kebajikan",
    "perawi_melayu": "Asma' meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ،\n أَنَّ أَسْمَاءَ، قَالَتْ كُنْتُ أَخْدُمُ الزُّبَيْرَ خِدْمَةَ الْبَيْتِ وَكَانَ لَهُ فَرَسٌ وَكُنْتُ أَسُوسُهُ فَلَمْ يَكُنْ مِنَ\n الْخِدْمَةِ شَىْءٌ أَشَدَّ عَلَىَّ مِنْ سِيَاسَةِ الْفَرَسِ كُنْتُ أَحْتَشُّ لَهُ وَأَقُومُ عَلَيْهِ وَأَسُوسُهُ ‏.‏ قَالَ\n ثُمَّ إِنَّهَا أَصَابَتْ خَادِمًا جَاءَ النَّبِيَّ صلى الله عليه وسلم سَبْىٌ فَأَعْطَاهَا خَادِمًا ‏.‏ قَالَتْ\n كَفَتْنِي سِيَاسَةَ الْفَرَسِ فَأَلْقَتْ عَنِّي مَئُونَتَهُ فَجَاءَنِي رَجُلٌ فَقَالَ يَا أُمَّ عَبْدِ اللَّهِ إِنِّي رَجُلٌ\n فَقِيرٌ أَرَدْتُ أَنْ أَبِيعَ فِي ظِلِّ دَارِكِ ‏.‏ قَالَتْ إِنِّي إِنْ رَخَّصْتُ لَكَ أَبَى ذَاكَ الزُّبَيْرُ فَتَعَالَ فَاطْلُبْ\n إِلَىَّ وَالزُّبَيْرُ شَاهِدٌ فَجَاءَ فَقَالَ يَا أُمَّ عَبْدِ اللَّهِ إِنِّي رَجُلٌ فَقِيرٌ أَرَدْتُ أَنْ أَبِيعَ فِي ظِلِّ دَارِكِ\n ‏.‏ فَقَالَتْ مَا لَكَ بِالْمَدِينَةِ إِلاَّ دَارِي فَقَالَ لَهَا الزُّبَيْرُ مَا لَكِ أَنْ تَمْنَعِي رَجُلاً فَقِيرًا يَبِيعُ فَكَانَ\n يَبِيعُ إِلَى أَنْ كَسَبَ فَبِعْتُهُ الْجَارِيَةَ فَدَخَلَ عَلَىَّ الزُّبَيْرُ وَثَمَنُهَا فِي حَجْرِي ‏.‏ فَقَالَ هَبِيهَا\n لِي ‏.‏ قَالَتْ إِنِّي قَدْ تَصَدَّقْتُ بِهَا ‏.‏",
    "malay_translation": "Asma' berkata, \"Aku menguruskan kerja rumah Zubair. Dia mempunyai seekor kuda, dan akulah yang menjaga kuda itu. Tiada kerja yang lebih membebankan aku daripada menjaga kuda itu. Aku selalu mencari rumput untuknya dan menjaganya. Kemudian, aku mendapat seorang hamba perempuan kerana Rasulullah SAW mendapat beberapa orang tawanan perang. Baginda memberi aku seorang hamba perempuan. Hamba perempuan itu kemudian menjaga kuda itu dan meringankan beban kerja aku. Seorang lelaki datang dan berkata, ‘Wahai ibu Abdullah, aku seorang yang miskin dan aku ingin berniaga di bawah naungan rumahmu.’ Aku berkata, ‘Jika aku memberi keizinan, Zubair mungkin tidak akan bersetuju. Jadi, datanglah dan mintalah izin kepadaku ketika Zubair ada di sini.’ Dia datang dan berkata, ‘Wahai ibu Abdullah, aku seorang yang miskin dan aku ingin berniaga di bawah naungan rumahmu.’ Aku berkata, ‘Bukankah di Madinah ada tempat lain untuk berniaga selain rumahku?’ Zubair berkata, ‘Mengapa engkau menghalang orang miskin ini daripada berniaga di sini?’ Jadi, dia berniaga sehingga dia memperoleh keuntungan yang banyak. Aku menjual hamba perempuanku kepadanya. Zubair datang kepadaku ketika wang hasil jualan hamba perempuan itu ada di pangkuanku. Dia berkata, ‘Berikan wang itu kepadaku.’ Aku berkata, ‘Aku sudah menyedekahkannya.’\""
  },
  {
    "id": 12824,
    "hadith_number": 5547,
    "tajuk_hadith": "Larangan Berbisik Bertiga",
    "perawi_melayu": "Ibn Umar meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "When there are three (persons), two should not converse secretly between themselves to the exclusion of the (third) one.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ\n اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا كَانَ ثَلاَثَةٌ فَلاَ يَتَنَاجَى اثْنَانِ دُونَ وَاحِدٍ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila ada tiga orang, maka dua orang daripadanya janganlah berbisik sesama mereka dengan meninggalkan seorang lagi."
  },
  {
    "id": 12825,
    "hadith_number": 5548,
    "tajuk_hadith": "Hadis daripada Ibnu Umar melalui Dua Sanad",
    "perawi_melayu": "Ibnu Umar",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، وَابْنُ، نُمَيْرٍ ح وَحَدَّثَنَا ابْنُ،\n نُمَيْرٍ حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا يَحْيَى، - وَهُوَ\n ابْنُ سَعِيدٍ - كُلُّهُمْ عَنْ عُبَيْدِ اللَّهِ، ح وَحَدَّثَنَا قُتَيْبَةُ، وَابْنُ، رُمْحٍ عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وَحَدَّثَنَا \n أَبُو الرَّبِيعِ، وَأَبُو كَامِلٍ قَالاَ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، ح وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ،\n بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ أَيُّوبَ بْنَ مُوسَى، كُلُّ هَؤُلاَءِ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ،\n عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَى حَدِيثِ مَالِكٍ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Bakar bin Abi Syaibah, telah menceritakan kepada kami Muhammad bin Basyar dan Ibnu Numair.  Dan telah menceritakan kepada kami Ibnu Numair, telah menceritakan kepada kami ayahku. Dan telah menceritakan kepada kami Muhammad bin Mutsanna dan Ubaidullah bin Said, keduanya berkata: Telah menceritakan kepada kami Yahya - iaitu Ibnu Said - mereka semua daripada Ubaidullah. Dan telah menceritakan kepada kami Qutaibah dan Ibnu Rumh daripada Laits bin Saad. Dan telah menceritakan kepada kami Abu Raabi' dan Abu Kamil, keduanya berkata: Telah menceritakan kepada kami Hammad daripada Ayub. Dan telah menceritakan kepada kami Ibnu Mutsanna, telah menceritakan kepada kami Muhammad bin Ja'far, telah menceritakan kepada kami Syu'bah, dia berkata: Aku mendengar Ayub bin Musa, semua ini daripada Nafi', daripada Ibnu Umar, daripada Nabi SAW dengan maksud hadis Malik."
  },
  {
    "id": 12826,
    "hadith_number": 5549,
    "tajuk_hadith": "Menghindari Perbualan Rahsia di Hadapan Orang Ketiga",
    "perawi_melayu": "Abdullah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "If you are three, two amongst you should not converse secretly between yourselves to the exclusion of the other (third one), unti some other people join him (and dispel his loneliness), for it may hurt his feelings.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَهَنَّادُ بْنُ السَّرِيِّ، قَالاَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ \n مَنْصُورٍ، ح وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ\n لِزُهَيْرٍ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا - جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ،\n عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا كُنْتُمْ ثَلاَثَةً فَلاَ يَتَنَاجَى اثْنَانِ\n دُونَ الآخَرِ حَتَّى تَخْتَلِطُوا بِالنَّاسِ مِنْ أَجْلِ أَنْ يُحْزِنَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Jika kamu bertiga, maka janganlah dua orang daripada kamu berbisik-bisik sesama sendiri tanpa melibatkan orang ketiga sehingga kamu bercampur gaul dengan orang ramai, kerana ia boleh menyakitkan hatinya."
  },
  {
    "id": 12827,
    "hadith_number": 5550,
    "tajuk_hadith": "Larangan Berbisik Ketika Bertiga",
    "perawi_melayu": "Abdullah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "If you are three, two should not converse secretly to the exclusion of your companion for that hurts his feelings.",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ نُمَيْرٍ وَأَبُو كُرَيْبٍ - وَاللَّفْظُ\n لِيَحْيَى - قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ،\n عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا كُنْتُمْ ثَلاَثَةً فَلاَ يَتَنَاجَى اثْنَانِ\n دُونَ صَاحِبِهِمَا فَإِنَّ ذَلِكَ يُحْزِنُهُ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila kamu bertiga, maka janganlah dua orang daripada kamu berbisik-bisik tanpa melibatkan orang ketiga, kerana ia akan menyakitkan hatinya."
  },
  {
    "id": 12828,
    "hadith_number": 5551,
    "tajuk_hadith": "Sanad Hadith daripada al-A'mash",
    "perawi_melayu": "Ishaq bin Ibrahim melalui Is'a bin Yunus dan Ibn Abi Umar melalui Sufyan, kedua-duanya daripada al-A'mash",
    "english_text": "This hadith has been reported on the authority of A'mash with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، ح وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ،\n حَدَّثَنَا سُفْيَانُ، كِلاَهُمَا عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ ‏.‏",
    "malay_translation": "Hadith ini telah diriwayatkan daripada al-A'mash dengan sanad yang sama.  Ishaq bin Ibrahim meriwayatkan daripada Isa bin Yunus, dan Ibn Abi Umar meriwayatkan daripada Sufyan. Kedua-duanya meriwayatkan daripada al-A'mash dengan sanad yang sama."
  },
  {
    "id": 12829,
    "hadith_number": 5552,
    "tajuk_hadith": "Doa Jibril untuk Kesembuhan Rasulullah SAW",
    "perawi_melayu": "Aisyah (isteri Rasulullah SAW) berkata:",
    "english_text": "When Allah's Messenger (ﷺ) fell ill, Gabriel used to recite this: \"In the name of Allah, may He cure you from all kinds of illnesses and safeguard you from the evil of a jealous one when he feels jealous and from the evil influence of eye.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ الدَّرَاوَرْدِيُّ، عَنْ يَزِيدَ، - وَهُوَ\n ابْنُ عَبْدِ اللَّهِ بْنِ أُسَامَةَ بْنِ الْهَادِ - عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ،\n عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ كَانَ إِذَا اشْتَكَى رَسُولُ اللَّهِ صلى\n الله عليه وسلم رَقَاهُ جِبْرِيلُ قَالَ بِاسْمِ اللَّهِ يُبْرِيكَ وَمِنْ كُلِّ دَاءٍ يَشْفِيكَ وَمِنْ شَرِّ حَاسِدٍ\n إِذَا حَسَدَ وَشَرِّ كُلِّ ذِي عَيْنٍ ‏.‏",
    "malay_translation": "Aisyah (isteri Rasulullah SAW) berkata bahawa apabila Rasulullah SAW sakit, Jibril akan meruqyah baginda dengan membaca:  \"Dengan nama Allah, semoga Allah menyembuhkanmu daripada segala jenis penyakit dan melindungi engkau daripada kejahatan orang yang dengki apabila dia dengki dan daripada kejahatan mata hasad.\""
  },
  {
    "id": 12830,
    "hadith_number": 5553,
    "tajuk_hadith": "Jibril Meruqyah Nabi SAW",
    "perawi_melayu": "Abu Said meriwayatkan bahawa Jibril datang kepada Rasulullah SAW dan berkata:",
    "english_text": "Muhammad, have you fallen ill? Thereupon he said: Yes. He (Gabriel) said: \"In the name of Allah I exorcise you from everything and safeguard you from every evil that may harm you and from the eye of a jealous one. Allah would cure you and I invoke the name of Allah for you.\"",
    "arabic_text": "حَدَّثَنَا بِشْرُ بْنُ هِلاَلٍ الصَّوَّافُ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ،\n عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، أَنَّ جِبْرِيلَ، أَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا مُحَمَّدُ\n اشْتَكَيْتَ فَقَالَ ‏\n\"‏ نَعَمْ ‏\"‏ ‏.‏ قَالَ بِاسْمِ اللَّهِ أَرْقِيكَ مِنْ كُلِّ شَىْءٍ يُؤْذِيكَ مِنْ شَرِّ كُلِّ نَفْسٍ أَوْ\n عَيْنِ حَاسِدٍ اللَّهُ يَشْفِيكَ بِاسْمِ اللَّهِ أَرْقِيكَ ‏.‏",
    "malay_translation": "Abu Said meriwayatkan bahawa Jibril datang kepada Nabi Muhammad SAW lalu bertanya, \"Wahai Muhammad, adakah engkau sakit?\"  Nabi SAW menjawab, \"Ya.\" Jibril berkata, \"Dengan nama Allah, aku meruqyah engkau daripada segala sesuatu yang menyusahkanmu, daripada kejahatan setiap jiwa atau pandangan mata orang yang dengki. Allah akan menyembuhkanmu. Dengan nama Allah, aku meruqyah engkau.\""
  },
  {
    "id": 12831,
    "hadith_number": 5554,
    "tajuk_hadith": "Kesan Mata Hasad",
    "perawi_melayu": "Abu Hurairah meriwayatkan banyak hadis daripada Rasulullah SAW dan beliau meriwayatkan sabda Rasulullah SAW:",
    "english_text": "The influence of an evil eye is a fact.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ\n هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْعَيْنُ حَقٌّ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Rafi', telah menceritakan kepada kami Abdur Razzaq, telah menceritakan kepada kami Ma'mar, daripada Hammam bin Munabbih, katanya: Inilah yang telah diceritakan kepada kami oleh Abu Hurairah daripada Rasulullah SAW. Kemudian beliau menyebut beberapa hadis daripadanya dan berkata: Rasulullah SAW bersabda: \"Mata hasad itu adalah hak.\" "
  },
  {
    "id": 12832,
    "hadith_number": 5555,
    "tajuk_hadith": "Kesan Mata Hasad",
    "perawi_melayu": "Ibn Abbas meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The influence of an evil eye is a fact; if anything would precede the destiny it would be the influence of an evil eye, and when you are asked to take bath (as a cure) from the influence of an evil eye, you should take bath.",
    "arabic_text": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، وَحَجَّاجُ بْنُ الشَّاعِرِ، وَأَحْمَدُ بْنُ خِرَاشٍ،\n قَالَ عَبْدُ اللَّهِ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا وُهَيْبٌ، عَنِ ابْنِ،\n طَاوُسٍ عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْعَيْنُ حَقٌّ وَلَوْ\n كَانَ شَىْءٌ سَابَقَ الْقَدَرَ سَبَقَتْهُ الْعَيْنُ وَإِذَا اسْتُغْسِلْتُمْ فَاغْسِلُوا ‏\"‏ ‏.‏",
    "malay_translation": "Mata hasad itu adalah suatu yang benar. Sekiranya ada sesuatu yang mampu mendahului takdir, nescaya ia adalah mata hasad.  Oleh itu, jika kamu disuruh mandi (sebagai penawar) daripada kesan mata hasad, maka mandilah."
  },
  {
    "id": 12833,
    "hadith_number": 5556,
    "tajuk_hadith": "Sihir Terhadap Rasulullah SAW",
    "perawi_melayu": "Aisyah meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ نُمَيْرٍ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ سَحَرَ\n رَسُولَ اللَّهِ صلى الله عليه وسلم يَهُودِيٌّ مِنْ يَهُودِ بَنِي زُرَيْقٍ يُقَالُ لَهُ لَبِيدُ بْنُ الأَعْصَمِ -\n قَالَتْ - حَتَّى كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُخَيَّلُ إِلَيْهِ أَنَّهُ يَفْعَلُ الشَّىْءَ وَمَا يَفْعَلُهُ\n حَتَّى إِذَا كَانَ ذَاتَ يَوْمٍ أَوْ ذَاتَ لَيْلَةٍ دَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ دَعَا ثُمَّ دَعَا\n ثُمَّ قَالَ ‏\"‏ يَا عَائِشَةُ أَشَعَرْتِ أَنَّ اللَّهَ أَفْتَانِي فِيمَا اسْتَفْتَيْتُهُ فِيهِ جَاءَنِي رَجُلاَنِ فَقَعَدَ أَحَدُهُمَا\n عِنْدَ رَأْسِي وَالآخَرُ عِنْدَ رِجْلَىَّ ‏.‏ فَقَالَ الَّذِي عِنْدَ رَأْسِي لِلَّذِي عِنْدَ رِجْلَىَّ أَوِ الَّذِي عِنْدَ رِجْلَىَّ\n لِلَّذِي عِنْدَ رَأْسِي مَا وَجَعُ الرَّجُلِ قَالَ مَطْبُوبٌ ‏.‏ قَالَ مَنْ طَبَّهُ قَالَ لَبِيدُ بْنُ الأَعْصَمِ ‏.‏ قَالَ\n فِي أَىِّ شَىْءٍ قَالَ فِي مُشْطٍ وَمُشَاطَةٍ ‏.‏ قَالَ وَجُبِّ طَلْعَةِ ذَكَرٍ ‏.‏ قَالَ فَأَيْنَ هُوَ قَالَ فِي\n بِئْرِ ذِي أَرْوَانَ ‏\"‏ ‏.‏ قَالَتْ فَأَتَاهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي أُنَاسٍ مِنْ أَصْحَابِهِ\n ثُمَّ قَالَ ‏\"‏ يَا عَائِشَةُ وَاللَّهِ لَكَأَنَّ مَاءَهَا نُقَاعَةُ الْحِنَّاءِ وَلَكَأَنَّ نَخْلَهَا رُءُوسُ الشَّيَاطِينِ ‏\"‏\n ‏.‏ قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ أَفَلاَ أَحْرَقْتَهُ قَالَ ‏\"‏ لاَ أَمَّا أَنَا فَقَدْ عَافَانِي اللَّهُ وَكَرِهْتُ أَنْ\n أُثِيرَ عَلَى النَّاسِ شَرًّا فَأَمَرْتُ بِهَا فَدُفِنَتْ ‏\"‏ ‏.‏",
    "malay_translation": "Aisyah berkata, \"Seorang Yahudi daripada kalangan Yahudi Bani Zuraiq yang bernama Labid bin al-A’sam telah menyamun Rasulullah SAW.  Rasulullah SAW merasakan seolah-olah baginda melakukan sesuatu sedangkan sebenarnya baginda tidak melakukannya.  Sehinggalah pada suatu hari atau malam, Rasulullah SAW berdoa. Baginda berdoa lagi dan lagi, kemudian berkata, \"Wahai Aisyah, adakah engkau sedar bahawa Allah telah memberitahu aku apa yang aku tanyakan kepada-Nya? Dua orang lelaki datang kepadaku, seorang duduk di kepalaku dan seorang lagi di kakiku. Lelaki yang duduk di kepalaku berkata kepada lelaki yang duduk di kakiku, atau lelaki yang duduk di kakiku berkata kepada lelaki yang duduk di kepalaku,  ‘Apakah penyakit lelaki ini?’ Dia menjawab, ‘Dia terkena sihir.’ Dia bertanya, ‘Siapakah yang menyamunnya?’ Dia menjawab, ‘Labid bin al-A’sam.’ Dia bertanya, ‘Dengan apa dia melakukan sihir ini?’ Dia menjawab, ‘Dengan sikat dan rambut yang melekat pada sikat dan pelepah kurma.’ Dia bertanya, ‘Di manakah ia?’ Dia menjawab, ‘Di dalam perigi Dhi Arwan.’\" Aisyah berkata, \"Rasulullah SAW pergi ke sana bersama beberapa sahabat baginda, kemudian berkata, \"Wahai Aisyah, demi Allah, airnya seakan-akan warna inai dan pokok tamarnya seakan-akan kepala syaitan.\"  Aku bertanya, \"Wahai Rasulullah, mengapa tidak dibakar sahaja?\" Baginda menjawab, \"Tidak, kerana Allah telah menyembuhkan aku dan aku tidak mahu menimbulkan kemudaratan di kalangan manusia, maka aku perintahkan supaya ia ditanam.\""
  },
  {
    "id": 12834,
    "hadith_number": 5557,
    "tajuk_hadith": "Sihir ke atas Rasulullah SAW dan Tindakan Baginda",
    "perawi_melayu": "Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ سُحِرَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ وَسَاقَ أَبُو كُرَيْبٍ الْحَدِيثَ بِقِصَّتِهِ نَحْوَ حَدِيثِ ابْنِ نُمَيْرٍ\n وَقَالَ فِيهِ فَذَهَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى الْبِئْرِ فَنَظَرَ إِلَيْهَا وَعَلَيْهَا نَخْلٌ ‏.‏\n وَقَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ فَأَخْرِجْهُ ‏.‏ وَلَمْ يَقُلْ أَفَلاَ أَحْرَقْتَهُ وَلَمْ يَذْكُرْ ‏\n\"‏ فَأَمَرْتُ بِهَا فَدُفِنَتْ\n ‏\"‏ ‏.‏",
    "malay_translation": "Abu Kuraib telah meriwayatkan daripada Abu Usamah, daripada Hisyam, daripada bapanya, daripada Aisyah r.a., bahawa Baginda Rasulullah SAW telah disihir.  Abu Kuraib meriwayatkan hadis ini dengan jalan ceritanya yang hampir sama dengan riwayat Ibnu Numair.  Di dalam riwayatnya, Abu Kuraib menyebut bahawa Rasulullah SAW pergi ke perigi, lalu Baginda melihat ke arahnya, dan di situ terdapat pokok kurma. Aisyah berkata, \"Saya berkata, Wahai Rasulullah, keluarkanlah ia.\"  Dan Baginda tidak berkata, \"Mengapa engkau tidak membakarnya?\" Dan tidak disebut juga, \"Kemudian aku menyuruh supaya ia dikebumikan, lalu ia dikebumikan.\""
  },
  {
    "id": 12835,
    "hadith_number": 5558,
    "tajuk_hadith": "Usaha Pembunuhan Terhadap Rasulullah SAW",
    "perawi_melayu": "Anas",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا شُعْبَةُ، عَنْ هِشَامِ،\n بْنِ زَيْدٍ عَنْ أَنَسٍ، أَنَّ امْرَأَةً، يَهُودِيَّةً أَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم بِشَاةٍ مَسْمُومَةٍ\n فَأَكَلَ مِنْهَا فَجِيءَ بِهَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَأَلَهَا عَنْ ذَلِكَ فَقَالَتْ أَرَدْتُ\n لأَقْتُلَكَ ‏.‏ قَالَ ‏\"‏ مَا كَانَ اللَّهُ لِيُسَلِّطَكِ عَلَى ذَاكِ ‏\"‏ ‏.‏ قَالَ أَوْ قَالَ ‏\"‏ عَلَىَّ ‏\"‏ ‏.‏ قَالَ قَالُوا\n أَلاَ نَقْتُلُهَا قَالَ ‏\"‏ لاَ ‏\"‏ ‏.‏ قَالَ فَمَا زِلْتُ أَعْرِفُهَا فِي لَهَوَاتِ رَسُولِ اللَّهِ صلى الله عليه وسلم\n ‏.‏",
    "malay_translation": "Kami diberitakan oleh Yahya bin Habib al-Harithi, yang diberitakan kepadanya oleh Khalid bin al-Harith, yang diberitakan kepadanya oleh Syu'bah, daripada Hisyam bin Zaid daripada Anas, bahawa seorang wanita Yahudi datang kepada Rasulullah SAW dengan membawa seekor kambing yang telah diracun.  Rasulullah SAW memakan sebahagian daripadanya. Kemudian wanita itu dibawa kepada Rasulullah SAW, lalu baginda bertanya kepadanya tentang hal itu.  Wanita itu berkata, \"Saya berhasrat untuk membunuhmu.\" Baginda berkata, \"Allah SWT tidak akan memberi kuasa kepadamu untuk berbuat demikian.\"  Atau baginda berkata, \"...kepadaku.\"  Mereka berkata, \"Patutkah kita membunuhnya?\" Baginda berkata, \"Tidak.\"  Anas berkata, \"Saya masih lagi merasai kesan racun itu di pangkal lelangit Rasulullah SAW."
  },
  {
    "id": 12836,
    "hadith_number": 5559,
    "tajuk_hadith": "Ujian Rasulullah SAW dengan Daging Beracun",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "Anas b. Malik reported that a Jewess brought poisoned meat and then served it to Allah's Messenger (ﷺ)",
    "arabic_text": "وَحَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا شُعْبَةُ، - سَمِعْتُ هِشَامَ،\n بْنَ زَيْدٍ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يُحَدِّثُ أَنَّ يَهُودِيَّةً، جَعَلَتْ سَمًّا فِي لَحْمٍ ثُمَّ أَتَتْ بِهِ رَسُولَ\n اللَّهِ صلى الله عليه وسلم بِنَحْوِ حَدِيثِ خَالِدٍ ‏.‏",
    "malay_translation": "Anas bin Malik meriwayatkan bahawa seorang wanita Yahudi telah meletakkan racun dalam daging, kemudian membawanya kepada Rasulullah SAW.  (Riwayat ini hampir sama dengan riwayat Khalid)."
  },
  {
    "id": 12837,
    "hadith_number": 5560,
    "tajuk_hadith": "Doa Rasulullah SAW untuk Kesembuhan Orang Sakit",
    "perawi_melayu": "Aisyah meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ، زُهَيْرٌ\n - وَاللَّفْظُ لَهُ - حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ\n كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا اشْتَكَى مِنَّا إِنْسَانٌ مَسَحَهُ بِيَمِينِهِ ثُمَّ قَالَ ‏\"‏ أَذْهِبِ\n الْبَاسَ رَبَّ النَّاسِ وَاشْفِ أَنْتَ الشَّافِي لاَ شِفَاءَ إِلاَّ شِفَاؤُكَ شِفَاءً لاَ يُغَادِرُ سَقَمًا ‏\"‏ ‏.‏\n فَلَمَّا مَرِضَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَثَقُلَ أَخَذْتُ بِيَدِهِ لأَصْنَعَ بِهِ نَحْوَ مَا كَانَ يَصْنَعُ\n فَانْتَزَعَ يَدَهُ مِنْ يَدِي ثُمَّ قَالَ ‏\"‏ اللَّهُمَّ اغْفِرْ لِي وَاجْعَلْنِي مَعَ الرَّفِيقِ الأَعْلَى ‏\"‏ ‏.‏ قَالَتْ فَذَهَبْتُ\n أَنْظُرُ فَإِذَا هُوَ قَدْ قَضَى ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Zuhri bin Harb dan Ishaq bin Ibrahim. Ishaq berkata, telah menceritakan kepada kami dan Zuhri berkata (dengan lafaznya), telah menceritakan kepada kami Jarir, dari Al-A'masy, dari Abu Dhuha, dari Masruq, dari Aisyah, dia berkata:\nRasulullah SAW jika ada seseorang di antara kami yang sakit, baginda menyapunya dengan tangan kanan baginda, kemudian baginda berdoa: \"Ya Allah, Tuhan sekalian manusia, hilangkanlah penyakit ini dan sembuhkanlah, Engkaulah Yang Maha Menyembuhkan. Tiada kesembuhan melainkan kesembuhan dariMu, kesembuhan yang tidak meninggalkan sebarang penyakit.\" \nKemudian apabila Rasulullah SAW sakit dan penyakitnya semakin berat, aku memegang tangan baginda untuk melakukan seperti apa yang biasa baginda lakukan.  Maka baginda menarik tangannya dari tanganku, kemudian baginda berdoa: \"Ya Allah, ampunkanlah daku dan jadikanlah aku bersama para sahabat yang mulia.\"  Dia berkata, kemudian aku pergi melihat, maka ternyata baginda telah meninggal dunia."
  },
  {
    "id": 12838,
    "hadith_number": 5561,
    "tajuk_hadith": "Cara Rasulullah SAW Membelai",
    "perawi_melayu": "Hadis ini diriwayatkan melalui beberapa sanad daripada Syu'bah.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، ح حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ\n قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح حَدَّثَنِي بِشْرُ بْنُ خَالِدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وَحَدَّثَنَا ابْنُ،\n بَشَّارٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، كِلاَهُمَا عَنْ شُعْبَةَ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو بَكْرِ\n بْنُ خَلاَّدٍ قَالاَ حَدَّثَنَا يَحْيَى، - وَهُوَ الْقَطَّانُ - عَنْ سُفْيَانَ، كُلُّ هَؤُلاَءِ عَنِ الأَعْمَشِ، بِإِسْنَادِ\n جَرِيرٍ ‏.‏ فِي حَدِيثِ هُشَيْمٍ وَشُعْبَةَ مَسَحَهُ بِيَدِهِ ‏.‏ قَالَ وَفِي حَدِيثِ الثَّوْرِيِّ مَسَحَهُ بِيَمِينِهِ\n ‏.‏ وَقَالَ فِي عَقِبِ حَدِيثِ يَحْيَى عَنْ سُفْيَانَ عَنِ الأَعْمَشِ قَالَ فَحَدَّثْتُ بِهِ مَنْصُورًا فَحَدَّثَنِي\n عَنْ إِبْرَاهِيمَ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ بِنَحْوِهِ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Yahya bin Yahya, memberitakan kepada kami Husyaim, telah menceritakan kepada kami Abu Bakar bin Abi Syaibah dan Abu Kuraib, keduanya berkata: Telah menceritakan kepada kami Abu Muawiyah, telah menceritakan kepadaku Bisyr bin Khalid, telah menceritakan kepada kami Muhammad bin Ja'far, dan telah menceritakan kepada kami Ibnu Bashshar, telah menceritakan kepada kami Ibnu Abi 'Adiyy, keduanya daripada Syu'bah, dan telah menceritakan kepada kami Abu Bakar bin Abi Syaibah dan Abu Bakar bin Khalid, keduanya berkata: Telah menceritakan kepada kami Yahya - iaitu Al-Qattan - daripada Sufyan, semua ini daripada Al-A'masy, dengan sanad Jarir.  Dalam hadis Husyaim dan Syu'bah: Baginda SAW membelai (beliau) dengan tangan Baginda.  Dan dalam hadis Tsauri: Baginda SAW membelai (beliau) dengan tangan kanan Baginda.  Dan Baginda berkata di hujung hadis Yahya daripada Sufyan daripada Al-A'masy: Maka aku telah menceritakannya kepada Mansur, lalu dia menceritakan kepadaku daripada Ibrahim daripada Masruq daripada Aisyah dengan seumpamanya."
  },
  {
    "id": 12839,
    "hadith_number": 5562,
    "tajuk_hadith": "Doa Nabi SAW Ketika Menziarahi Orang Sakit",
    "perawi_melayu": "Aisyah melaporkan bahawa Rasulullah SAW bersabda:",
    "english_text": "When Allah's Messenger (ﷺ) visited the sick he would say: Lord of the people. remove the disease, cure him, for Thou art the great Curer, there is no cure but through Thine healing Power, which leaves nothing of the disease.",
    "arabic_text": "وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ مَسْرُوقٍ،\n عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا عَادَ مَرِيضًا يَقُولُ ‏\n\"‏ أَذْهِبِ الْبَاسَ\n رَبَّ النَّاسِ اشْفِهِ أَنْتَ الشَّافِي لاَ شِفَاءَ إِلاَّ شِفَاؤُكَ شِفَاءً لاَ يُغَادِرُ سَقَمًا ‏\"‏ ‏.‏",
    "malay_translation": "Aisyah r.a. meriwayatkan bahawa Rasulullah SAW apabila melawat orang sakit, baginda berdoa:  \"Wahai Tuhan sekalian manusia, hilangkanlah penyakit ini, sembuhkanlah dia.  Sesungguhnya Engkaulah Yang Maha Penyembuh, tiada kesembuhan melainkan kesembuhan daripada-Mu, iaitu kesembuhan yang tidak meninggalkan sebarang penyakit.\" "
  },
  {
    "id": 12840,
    "hadith_number": 5563,
    "tajuk_hadith": "Doa Nabi SAW untuk Orang Sakit",
    "perawi_melayu": "Aisyah",
    "english_text": "Lord of the people, remove the malady, cure him for Thou art a great Curer. There is no cure but through Thine healing Power which leaves no trouble, and in the narration transmitted on the authority of Abu Bakr there is a slight variation of wording.",
    "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ،\n عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا\n أَتَى الْمَرِيضَ يَدْعُو لَهُ قَالَ ‏\"‏ أَذْهِبِ الْبَاسَ رَبَّ النَّاسِ وَاشْفِ أَنْتَ الشَّافِي لاَ شِفَاءَ إِلاَّ\n شِفَاؤُكَ شِفَاءً لاَ يُغَادِرُ سَقَمًا ‏\"‏ ‏.‏ وَفِي رِوَايَةِ أَبِي بَكْرٍ فَدَعَا لَهُ وَقَالَ ‏\"‏ وَأَنْتَ الشَّافِي\n ‏\"‏ ‏.‏",
    "malay_translation": "Aisyah meriwayatkan bahawa apabila Rasulullah SAW melawat orang sakit, baginda berdoa untuknya dengan berkata: \"Wahai Tuhan sekalian manusia, hilangkanlah penyakit ini, sembuhkanlah dia, sesungguhnya Engkaulah Yang Maha Penyembuh. Tiada kesembuhan melainkan kesembuhan daripada-Mu, kesembuhan yang tidak meninggalkan sebarang penyakit.\"  Dalam riwayat Abu Bakar, baginda berdoa dengan berkata:  \"...dan Engkaulah Yang Maha Penyembuh.\""
  },
  {
    "id": 12841,
    "hadith_number": 5564,
    "tajuk_hadith": "Hadis Daripada Aisyah R.A. - Perbezaan Ringkas Lafaz",
    "perawi_melayu": "Qasim bin Zakaria, melalui jalan sanad lain daripada Ubaidullah bin Musa, daripada Israil, daripada Mansur, daripada Ibrahim, dan Muslim bin Subaih, daripada Masruq, daripada Aisyah.",
    "english_text": "This hadith has been reported on the authority of 'A'isha through another chain of transmitters with a slight variation of wording.",
    "arabic_text": "وَحَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّاءَ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، عَنْ مَنْصُورٍ،\n عَنْ إِبْرَاهِيمَ، وَمُسْلِمُ بْنُ صُبَيْحٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله\n عليه وسلم بِمِثْلِ حَدِيثِ أَبِي عَوَانَةَ وَجَرِيرٍ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Aisyah R.A. melalui sanad lain dengan sedikit perbezaan lafaz."
  },
  {
    "id": 12842,
    "hadith_number": 5565,
    "tajuk_hadith": "Doa Rasulullah SAW untuk Menyembuhkan Penyakit",
    "perawi_melayu": "Aisyah telah meriwayatkan:",
    "english_text": "Allah's Messenger (ﷺ) used to recite (this supplication) as the words of incantation:\" Lord of the people, remove the trouble for in Thine Hand is the cure; none is there to relieve him (the burden of disease) but only Thou.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لأَبِي كُرَيْبٍ - قَالاَ حَدَّثَنَا \n ابْنُ نُمَيْرٍ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَرْقِي\n بِهَذِهِ الرُّقْيَةِ ‏\n\"‏ أَذْهِبِ الْبَاسَ رَبَّ النَّاسِ بِيَدِكَ الشِّفَاءُ لاَ كَاشِفَ لَهُ إِلاَّ أَنْتَ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW berdoa dengan bacaan ini sebagai mantera: \"Wahai Tuhan sekalian manusia, hilangkanlah penyakit ini. Di tangan-Mu ada kesembuhan, tiada yang dapat menghilangkannya melainkan Engkau sahaja.\""
  },
  {
    "id": 12843,
    "hadith_number": 5566,
    "tajuk_hadith": "Hadis yang diriwayatkan oleh Hisyam dengan sanad yang sama",
    "perawi_melayu": "Hisham",
    "english_text": "This hadith has been reported on the authority of Hisham with the same chain of transmitted.",
    "arabic_text": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا \n عِيسَى بْنُ يُونُسَ، كِلاَهُمَا عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
    "malay_translation": "Hadis ini telah diriwayatkan daripada Hisyam dengan sanad yang sama."
  },
  {
    "id": 12844,
    "hadith_number": 5567,
    "tajuk_hadith": "Meniup dan Membaca Mu'awwidzat ke atas Orang Sakit",
    "perawi_melayu": "Dari Aisyah r.a.",
    "english_text": "'A'isha reported that when any of the members of the household fell ill Allah's Messenger (ﷺ) used to blow over him by reciting Mu'awwidhatan, and when he suffered from illness of which he died I used to blow over him and rubbed his body with his hand for his hand had greater healing power than my hand.",
    "arabic_text": "حَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ، وَيَحْيَى بْنُ أَيُّوبَ، قَالاَ حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ، عَنْ هِشَامِ،\n بْنِ عُرْوَةَ عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا مَرِضَ أَحَدٌ\n مِنْ أَهْلِهِ نَفَثَ عَلَيْهِ بِالْمُعَوِّذَاتِ فَلَمَّا مَرِضَ مَرَضَهُ الَّذِي مَاتَ فِيهِ جَعَلْتُ أَنْفُثُ عَلَيْهِ وَأَمْسَحُهُ\n بِيَدِ نَفْسِهِ لأَنَّهَا كَانَتْ أَعْظَمَ بَرَكَةً مِنْ يَدِي ‏.‏ وَفِي رِوَايَةِ يَحْيَى بْنِ أَيُّوبَ بِمُعَوِّذَاتٍ ‏.‏",
    "malay_translation": "Aisyah r.a. meriwayatkan bahawa apabila salah seorang ahli keluarganya sakit, Rasulullah ﷺ akan meniup ke atasnya sambil membaca Mu'awwidhatain.  Dan ketika baginda sakit penyakit yang menyebabkan baginda wafat, saya akan meniup ke atasnya dan mengusapnya dengan tangan baginda sendiri, kerana tangan baginda lebih berkat daripada tangan saya."
  },
  {
    "id": 12845,
    "hadith_number": 5568,
    "tajuk_hadith": "Mengubati Sakit dengan Membaca Mu'awwidzat",
    "perawi_melayu": "Aisyah r.a.",
    "english_text": "'A'isha reported that when Allah's Messenger (ﷺ) fell ill, he recited over his body Mu'awwidhatan and blew over him and when his sickness was aggravated I used to recite over him and rub him with his band with the hope that it was more blessed.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ \n عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا اشْتَكَى يَقْرَأُ عَلَى نَفْسِهِ بِالْمُعَوِّذَاتِ وَيَنْفُثُ\n فَلَمَّا اشْتَدَّ وَجَعُهُ كُنْتُ أَقْرَأُ عَلَيْهِ وَأَمْسَحُ عَنْهُ بِيَدِهِ رَجَاءَ بَرَكَتِهَا ‏.‏",
    "malay_translation": "Aisyah r.a. meriwayatkan bahawa apabila Rasulullah ﷺ sakit, baginda membaca Mu'awwidzat ke atas dirinya dan meniupnya.  Apabila penyakit baginda bertambah teruk, saya membacakannya ke atas baginda dan mengusapnya dengan tangan baginda dengan harapan keberkatannya."
  },
  {
    "id": 12846,
    "hadith_number": 5569,
    "tajuk_hadith": "Rasulullah SAW Mengucapkan Mu'awwidzat dan Membelai Diri Sendiri Ketika Sakit",
    "perawi_melayu": "Hadis ini diriwayatkan melalui beberapa sanad lain dengan sedikit perbezaan lafaz. Dalam hadis yang diriwayatkan melalui Yunus dan Ziyad (lafaznya):",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح وَحَدَّثَنَا \n عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ،\n حَدَّثَنَا رَوْحٌ، ح وَحَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ، وَأَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِيُّ، قَالاَ حَدَّثَنَا أَبُو عَاصِمٍ،\n كِلاَهُمَا عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي زِيَادٌ، كُلُّهُمْ عَنِ ابْنِ شِهَابٍ، بِإِسْنَادِ مَالِكٍ ‏.‏ نَحْوَ حَدِيثِهِ\n ‏.‏ وَلَيْسَ فِي حَدِيثِ أَحَدٍ مِنْهُمْ رَجَاءَ بَرَكَتِهَا ‏.‏ إِلاَّ فِي حَدِيثِ مَالِكٍ وَفِي حَدِيثِ يُونُسَ وَزِيَادٍ\n أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا اشْتَكَى نَفَثَ عَلَى نَفْسِهِ بَالْمُعَوِّذَاتِ وَمَسَحَ عَنْهُ بِيَدِهِ\n ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Abu Thahir dan Harmalah, keduanya berkata: Telah menceritakan kepada kami Ibnu Wahb, telah menceritakan kepadaku Yunus. Dan telah menceritakan kepada kami Abd bin Humaid, telah menceritakan kepada kami Abdurrazzaq, telah menceritakan kepada kami Ma'mar. Dan telah menceritakan kepadaku Muhammad bin Abdullah bin Numair, telah menceritakan kepada kami Ruh. Dan telah menceritakan kepada kami Uqbah bin Mukram dan Ahmad bin Utsman An-Naufali, keduanya berkata: Telah menceritakan kepada kami Abu 'Assim, keduanya dari Ibnu Juraij, telah menceritakan kepadaku Ziyad, semuanya dari Ibnu Syihab, dengan sanad Malik.  Lebih kurang seperti hadisnya. Dan tidak ada dalam hadis seseorang pun daripada mereka mengharapkan keberkatannya kecuali dalam hadis Malik, dan dalam hadis Yunus dan Ziyad bahawa Nabi SAW apabila sakit, beliau meniupkan pada dirinya dengan bacaan al-Mu'awwidzatain dan mengusap dirinya dengan tangannya."
  },
  {
    "id": 12847,
    "hadith_number": 5570,
    "tajuk_hadith": "Keperluan Ruqyah",
    "perawi_melayu": "'Abd al-Rahman bin al-Aswad meriwayatkan daripada bapanya:",
    "english_text": "I asked 'A'isha about incantation. She said: Allah's Messenger (ﷺ) had granted its sanction to the members of a family of the Ansar for incantation in curing every type of poison.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الشَّيْبَانِيِّ، عَنْ عَبْدِ الرَّحْمَنِ،\n بْنِ الأَسْوَدِ عَنْ أَبِيهِ، قَالَ سَأَلْتُ عَائِشَةَ عَنِ الرُّقْيَةِ، فَقَالَتْ رَخَّصَ رَسُولُ اللَّهِ صلى الله\n عليه وسلم لأَهْلِ بَيْتٍ مِنَ الأَنْصَارِ فِي الرُّقْيَةِ مِنْ كُلِّ ذِي حُمَةٍ ‏.‏",
    "malay_translation": "Aku bertanya kepada Aisyah tentang ruqyah.  Beliau berkata: Rasulullah ﷺ telah memberi kebenaran kepada satu keluarga daripada kalangan Ansar untuk melakukan ruqyah bagi merawat sebarang jenis racun."
  },
  {
    "id": 12848,
    "hadith_number": 5571,
    "tajuk_hadith": "Keizinan Rasulullah SAW untuk Ruqyah Racun Kala Jengking",
    "perawi_melayu": "Yahya bin Yahya meriwayatkan dari Hushaim, dari Mugairah, dari Ibrahim, dari Aswad, dari Aisyah",
    "english_text": "'A'isha reported that Allah's Messenger (ﷺ) granted sanction to the members of a family of the Ansar for incantation (for removing the effects) of the poison of the scorpion.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ مُغِيرَةَ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ \n عَائِشَةَ، قَالَتْ رَخَّصَ رَسُولُ اللَّهِ صلى الله عليه وسلم لأَهْلِ بَيْتٍ مِنَ الأَنْصَارِ فِي الرُّقْيَةِ\n مِنَ الْحُمَةِ ‏.‏",
    "malay_translation": "Aisyah meriwayatkan bahawa Rasulullah SAW telah memberi keizinan kepada satu keluarga daripada kalangan Ansar untuk melakukan ruqyah bagi merawat sengatan kala jengking."
  },
  {
    "id": 12849,
    "hadith_number": 5572,
    "tajuk_hadith": "Kesembuhan dengan Tanah dan Air Liur",
    "perawi_melayu": "Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَابْنُ أَبِي عُمَرَ، - وَاللَّفْظُ لاِبْنِ أَبِي\n عُمَرَ - قَالُوا حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ\n صلى الله عليه وسلم كَانَ إِذَا اشْتَكَى الإِنْسَانُ الشَّىْءَ مِنْهُ أَوْ كَانَتْ بِهِ قَرْحَةٌ أَوْ جَرْحٌ قَالَ\n النَّبِيُّ صلى الله عليه وسلم بِإِصْبَعِهِ هَكَذَا وَوَضَعَ سُفْيَانُ سَبَّابَتَهُ بِالأَرْضِ ثُمَّ رَفَعَهَا ‏\"‏\n بِاسْمِ اللَّهِ تُرْبَةُ أَرْضِنَا بِرِيقَةِ بَعْضِنَا لِيُشْفَى بِهِ سَقِيمُنَا بِإِذْنِ رَبِّنَا ‏\"‏ ‏.‏ قَالَ ابْنُ أَبِي شَيْبَةَ\n ‏\"‏ يُشْفَى ‏\"‏ ‏.‏ وَقَالَ زُهَيْرٌ ‏\"‏ لِيُشْفَى سَقِيمُنَا ‏\"‏ ‏.‏",
    "malay_translation": "Abu Bakar bin Abi Syaibah, Zuhair bin Harb, dan Ibnu Abi Umar meriwayatkan – dan lafaz Ibnu Abi Umar – mereka berkata:  Kami telah mendengar daripada Sufyan, daripada Abd Rabbih bin Said, daripada Amrah, daripada Aisyah, bahawa Rasulullah SAW, apabila seseorang itu sakit, atau ada luka atau cedera, baginda akan meletakkan jari telunjuk baginda ke tanah, kemudian mengangkatnya sambil berdoa:  “Dengan nama Allah, tanah bumi kita dengan air liur sebahagian daripada kita, semoga dengannya disembuhkan orang yang sakit di antara kita dengan izin Tuhan kita.” Ibnu Abi Syaibah berkata: “Semoga disembuhkan”.  Dan Zuhair berkata: “Semoga disembuhkan orang yang sakit di antara kita.”"
  },
  {
    "id": 12850,
    "hadith_number": 5573,
    "tajuk_hadith": "Kepercayaan dan Amalan Ruqyah untuk Penyakit Ain",
    "perawi_melayu": "Aisyah r.a.",
    "english_text": "'A'isha reported that Allah's Messenger (ﷺ) commanded the use of incantation for curing the influence of an evil eye.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ - قَالَ إِسْحَاقُ\n أَخْبَرَنَا وَقَالَ أَبُو بَكْرٍ، وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لَهُمَا - حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، عَنْ مِسْعَرٍ، حَدَّثَنَا \n مَعْبَدُ بْنُ خَالِدٍ، عَنِ ابْنِ شَدَّادٍ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَأْمُرُهَا\n أَنْ تَسْتَرْقِيَ مِنَ الْعَيْنِ ‏.‏",
    "malay_translation": "Aisyah r.a. meriwayatkan bahawa Rasulullah SAW  pernah memerintahkan supaya dilakukan rawatan ruqyah bagi penyakit ain."
  },
  {
    "id": 12851,
    "hadith_number": 5574,
    "tajuk_hadith": "Hadis Diriwayatkan oleh Mis'ar dengan Sanad yang Sama",
    "perawi_melayu": "Mis'ar",
    "english_text": "This hadith has been narrated on the authority of Mis'ar with the same chain of transmitters.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، قَالَ حَدَّثَنَا أَبِي، حَدَّثَنَا مِسْعَرٌ، بِهَذَا الإِسْنَادِ\n مِثْلَهُ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan melalui sanad yang sama daripada Mis'ar."
  },
  {
    "id": 12852,
    "hadith_number": 5575,
    "tajuk_hadith": "Menggunakan Ruqyah untuk Mengubati Penyakit Mata",
    "perawi_melayu": "Aisyah meriwayatkan:",
    "english_text": "Allah's Messenger (may peace he upon him) commanded me that I should make use of incantation for curing the influence of an evil eye.",
    "arabic_text": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سُفْيَانُ، عَنْ مَعْبَدِ بْنِ خَالِدٍ، عَنْ عَبْدِ اللَّهِ بْنِ،\n شَدَّادٍ عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَأْمُرُنِي أَنْ أَسْتَرْقِيَ مِنَ\n الْعَيْنِ ‏.‏",
    "malay_translation": "Rasulullah SAW telah memerintahkan saya untuk menggunakan ruqyah bagi mengubati penyakit mata."
  },
  {
    "id": 12853,
    "hadith_number": 5576,
    "tajuk_hadith": "Keizinan Menggunakan Ruqyah untuk Gigitan Kala Jengking dan Penyakit Kulit",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "Anas b. Malik reported in connection with incantation that he had been granted sanction (to use incantation as a remedy) for the sting of the scorpion and for curing small pustules and dispelling the influence of an evil eye.",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ عَاصِمٍ الأَحْوَلِ، عَنْ يُوسُفَ بْنِ،\n عَبْدِ اللَّهِ عَنْ أَنَسِ بْنِ مَالِكٍ، فِي الرُّقَى قَالَ رُخِّصَ فِي الْحُمَةِ وَالنَّمْلَةِ وَالْعَيْنِ ‏.‏",
    "malay_translation": "Anas bin Malik meriwayatkan berkaitan dengan ruqyah, bahawa baginda telah dibenarkan (untuk menggunakan ruqyah sebagai penawar) bagi sengatan kala jengking, dan untuk merawat bisul kecil serta menghilangkan pengaruh mata jahat."
  },
  {
    "id": 12854,
    "hadith_number": 5577,
    "tajuk_hadith": "Keizinan Rasulullah SAW untuk Ruqyah",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "Anas reported that Allah's Messenger (ﷺ) granted him sanction to use incantation (as a cure) for the, influence of an evil eye, the sting of the scorpion and small pustules.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ سُفْيَانَ، ح وَحَدَّثَنِي زُهَيْرُ،\n بْنُ حَرْبٍ حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، حَدَّثَنَا حَسَنٌ، - وَهُوَ ابْنُ صَالِحٍ - كِلاَهُمَا عَنْ عَاصِمٍ،\n عَنْ يُوسُفَ بْنِ عَبْدِ اللَّهِ، عَنْ أَنَسٍ، قَالَ رَخَّصَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الرُّقْيَةِ\n مِنَ الْعَيْنِ وَالْحُمَةِ وَالنَّمْلَةِ ‏.‏ وَفِي حَدِيثِ سُفْيَانَ يُوسُفُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَارِثِ ‏.‏",
    "malay_translation": "Anas meriwayatkan bahawa Rasulullah SAW telah memberi keizinan untuk menggunakan ruqyah (sebagai penawar) bagi terkena sihir mata, sengatan kala jengking dan bisul-bisul kecil."
  },
  {
    "id": 12855,
    "hadith_number": 5578,
    "tajuk_hadith": "Rawatan Mata Jahat ke atas Seorang Gadis",
    "perawi_melayu": "Abu al-Rabi', Sulaiman bin Dawud meriwayatkan daripada Muhammad bin Harb, meriwayatkan daripada Muhammad bin al-Walid al-Zubaidi, daripada al-Zuhrī, daripada Urwah bin Zubair, daripada Zainab binti Umm Salamah, daripada Umm Salamah, isteri Nabi ﷺ",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي أَبُو الرَّبِيعِ، سُلَيْمَانُ بْنُ دَاوُدَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، حَدَّثَنِي مُحَمَّدُ بْنُ الْوَلِيدِ،\n الزُّبَيْدِيُّ عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ\n صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لِجَارِيَةٍ فِي بَيْتِ أُمِّ سَلَمَةَ\n زَوْجِ النَّبِيِّ صلى الله عليه وسلم رَأَى بِوَجْهِهَا سَفْعَةً فَقَالَ ‏\n\"‏ بِهَا نَظْرَةٌ فَاسْتَرْقُوا لَهَا\n ‏\"‏ ‏.‏ يَعْنِي بِوَجْهِهَا صُفْرَةً ‏.‏",
    "malay_translation": "Abu al-Rabi', Sulaiman bin Dawud meriwayatkan daripada Muhammad bin Harb, meriwayatkan daripada Muhammad bin al-Walid al-Zubaidi, daripada al-Zuhrī, daripada Urwah bin Zubair, daripada Zainab binti Umm Salamah, daripada Umm Salamah, isteri Nabi ﷺ bahawa Rasulullah ﷺ  bersabda kepada seorang hamba perempuan di rumah Umm Salamah, isteri Nabi ﷺ, setelah melihat kesan hitam di wajahnya,  baginda berkata:  \"Ini disebabkan oleh pandangan mata jahat. Maka bacakanlah rawatan (ruqyah) untuknya.\"  Maksudnya, kekuningan pada wajahnya."
  },
  {
    "id": 12856,
    "hadith_number": 5579,
    "tajuk_hadith": "Keizinan Rasulullah SAW untuk Meruqyah",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan bahawa Rasulullah SAW memberi keizinan kepada keluarga Hazm untuk meruqyah (untuk mengurangkan kesan racun) ular, dan baginda berkata kepada Asma' binti Umays:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ وَأَخْبَرَنِي \n أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ رَخَّصَ النَّبِيُّ صلى الله عليه وسلم لآلِ حَزْمٍ\n فِي رُقْيَةِ الْحَيَّةِ وَقَالَ لأَسْمَاءَ بِنْتِ عُمَيْسٍ ‏\"‏ مَا لِي أَرَى أَجْسَامَ بَنِي أَخِي ضَارِعَةً تُصِيبُهُمُ\n الْحَاجَةُ ‏\"‏ ‏.‏ قَالَتْ لاَ وَلَكِنِ الْعَيْنُ تُسْرِعُ إِلَيْهِمْ ‏.‏ قَالَ ‏\"‏ ارْقِيهِمْ ‏\"‏ ‏.‏ قَالَتْ فَعَرَضْتُ عَلَيْهِ\n فَقَالَ ‏\"‏ ارْقِيهِمْ ‏\"‏ ‏.‏",
    "malay_translation": "Aku diberitahu oleh Uqbah bin Mukram al-‘Ammi, yang telah meriwayatkan dari Abu ‘Asim, dari Ibnu Juraij, katanya; dan Abu Zubair memberitahu aku bahawa dia mendengar Jabir bin Abdullah berkata: Nabi SAW telah memberi keizinan kepada keluarga Hazm untuk meruqyah (untuk mengurangkan kesan racun) ular, dan baginda berkata kepada Asma’ binti Umays: “Mengapa aku melihat tubuh anak-anak saudara lelakiku kelihatan kurus, seolah-olah mereka kekurangan sesuatu?”  Dia (Asma’) berkata: “Bukan, tetapi mereka terkena sihir.” Baginda berkata: “Bacakan ruqyah (doa) untuk mereka.” Dia (Asma’) berkata: “Maka aku membacakan (doa ruqyah) itu kepadanya (Rasulullah SAW), lalu baginda berkata: “Bacakan ruqyah (doa) itu untuk mereka.”"
  },
  {
    "id": 12857,
    "hadith_number": 5580,
    "tajuk_hadith": "Kebolehan Menolong Saudara",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan bahawa Rasulullah SAW memberikan kelonggaran untuk melakukan rawatan dengan bacaan untuk racun ular kepada kabilah 'Amr. Abu Zubair berkata:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو\n الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ أَرْخَصَ النَّبِيُّ صلى الله عليه وسلم فِي رُقْيَةِ الْحَيَّةِ\n لِبَنِي عَمْرٍو ‏.‏ \n قَالَ أَبُو الزُّبَيْرِ وَسَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ لَدَغَتْ رَجُلاً مِنَّا عَقْرَبٌ وَنَحْنُ\n جُلُوسٌ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَرْقِي قَالَ ‏\n\"‏ مَنِ\n اسْتَطَاعَ مِنْكُمْ أَنْ يَنْفَعَ أَخَاهُ فَلْيَفْعَلْ ‏\"‏ ‏.‏",
    "malay_translation": "Muhammad bin Hatim telah meriwayatkan daripada Ruh bin Ubadah, yang meriwayatkan daripada Ibnu Juraij, yang memberitakan daripada Abu Zubair bahawa dia mendengar Jabir bin Abdullah berkata:  Rasulullah SAW membenarkan rawatan dengan bacaan (ruqyah) untuk racun ular bagi Bani Amr.\nAbu Zubair berkata:  Aku juga mendengar Jabir bin Abdullah berkata:  Seekor kala jengking telah menyengat seorang daripada kami ketika kami sedang duduk bersama Rasulullah SAW.  Maka seorang lelaki berkata:  Wahai Rasulullah, bolehkah saya merawatnya dengan bacaan? Baginda SAW bersabda:  \"Barangsiapa di antara kamu yang mampu untuk memberi manfaat kepada saudaranya, hendaklah dia berbuat demikian.\""
  },
  {
    "id": 12858,
    "hadith_number": 5581,
    "tajuk_hadith": "Perbezaan Ringkas Perawi Hadis",
    "perawi_melayu": "Ibnu Juraij dan perawi lain",
    "english_text": "This hadith has been narrated on the authority of Ibn Juraij with the same chain of transmitters but with a slight variation of wording.",
    "arabic_text": "وَحَدَّثَنِي سَعِيدُ بْنُ يَحْيَى الأُمَوِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا ابْنُ جُرَيْجٍ، بِهَذَا الإِسْنَادِ ‏.‏\n مِثْلَهُ غَيْرَ أَنَّهُ قَالَ فَقَالَ رَجُلٌ مِنَ الْقَوْمِ أَرْقِيهِ يَا رَسُولَ اللَّهِ وَلَمْ يَقُلْ أَرْقِي ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Ibnu Juraij dengan sanad yang sama, tetapi dengan sedikit perbezaan lafaz.  Saeed bin Yahya Al-Umawi meriwayatkan daripada bapanya, yang meriwayatkan daripada Ibnu Juraij dengan sanad ini.  Ia serupa, cuma bezanya ialah:  beliau berkata, ‘Maka seorang lelaki daripada kalangan mereka berkata, “Bacakanlah rawatan (ruqyah) untukku, wahai Rasulullah,” dan tidak menyebut perkataan “bacakanlah rawatan” sahaja."
  },
  {
    "id": 12859,
    "hadith_number": 5582,
    "tajuk_hadith": "Rawatan Sengatan Kala Jengking",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan: Saya mempunyai seorang bapa saudara dari pihak ibu yang merawat sengatan kala jengking dengan menggunakan rawatan.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو سَعِيدٍ الأَشَجُّ قَالاَ حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ،\n عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ كَانَ لِي خَالٌ يَرْقِي مِنَ الْعَقْرَبِ فَنَهَى رَسُولُ اللَّهِ صلى\n الله عليه وسلم عَنِ الرُّقَى - قَالَ - فَأَتَاهُ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّكَ نَهَيْتَ عَنِ الرُّقَى وَأَنَا\n أَرْقِي مِنَ الْعَقْرَبِ ‏.‏ فَقَالَ ‏\n\"‏ مَنِ اسْتَطَاعَ مِنْكُمْ أَنْ يَنْفَعَ أَخَاهُ فَلْيَفْعَلْ ‏\"‏ ‏.‏",
    "malay_translation": "Jabir bin Abdullah meriwayatkan: Saya mempunyai seorang bapa saudara daripada pihak ibu yang merawat sengatan kala jengking dengan menggunakan ruqyah.  Rasulullah SAW melarang amalan ruqyah.  Lalu bapa saudara saya menghadap baginda dan berkata, \"Wahai Rasulullah, sesungguhnya tuan telah melarang amalan ruqyah, dan saya merawat sengatan kala jengking dengan ruqyah.\"  Baginda SAW bersabda:  \"Barangsiapa di antara kamu yang mampu memberi manfaat kepada saudaranya, maka hendaklah dia berbuat demikian.\""
  },
  {
    "id": 12860,
    "hadith_number": 5583,
    "tajuk_hadith": "Hadis Riwayat A'mash dengan Sanad yang Sama",
    "perawi_melayu": "A'mash",
    "english_text": "This hadith has been narrated on the authority of A'mash with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَاهُ عُثْمَانُ بْنُ أَبِي شَيْبَةَ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ مِثْلَهُ\n ‏.‏",
    "malay_translation": "Hadis ini telah diriwayatkan daripada A'mash dengan sanad (rantaian periwayat) yang sama."
  },
  {
    "id": 12861,
    "hadith_number": 5584,
    "tajuk_hadith": "Kepercayaan dan Pengubatan",
    "perawi_melayu": "Jabir",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ،\n قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الرُّقَى فَجَاءَ آلُ عَمْرِو بْنِ حَزْمٍ إِلَى رَسُولِ\n اللَّهِ صلى الله عليه وسلم فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّهُ كَانَتْ عِنْدَنَا رُقْيَةٌ نَرْقِي بِهَا مِنَ الْعَقْرَبِ\n وَإِنَّكَ نَهَيْتَ عَنِ الرُّقَى ‏.‏ قَالَ فَعَرَضُوهَا عَلَيْهِ ‏.‏ فَقَالَ ‏\n\"‏ مَا أَرَى بَأْسًا مَنِ اسْتَطَاعَ مِنْكُمْ\n أَنْ يَنْفَعَ أَخَاهُ فَلْيَنْفَعْهُ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW melarang amalan ruqyah. Kemudian datanglah kaum Amr bin Hazm kepada Rasulullah SAW lalu berkata: \"Wahai Rasulullah, kami mempunyai satu bacaan ruqyah untuk merawat sengatan kala jengking, tetapi tuan telah melarang amalan ruqyah.\" Baginda bersabda: \"Mereka membacakannya di hadapan baginda, lalu baginda bersabda: \"Aku tidak nampak apa-apa kesalahan (dalamnya). Barangsiapa di kalangan kamu mampu memberi manfaat kepada saudaranya, maka hendaklah ia berbuat demikian.\""
  },
  {
    "id": 12862,
    "hadith_number": 5585,
    "tajuk_hadith": "Pendapat Rasulullah SAW tentang Rawatan Ruqyah",
    "perawi_melayu": "Auf bin Malik Al-Asyja'i meriwayatkan: Kami mengamalkan rawatan ruqyah pada zaman jahiliyyah dan kami bertanya:",
    "english_text": "Allah's Messenger. what is your opinion about it? He said: Let me know your incantation and said: There is no harm in the incantation which does not smack of polytheism.",
    "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مُعَاوِيَةُ بْنُ صَالِحٍ، عَنْ عَبْدِ الرَّحْمَنِ،\n بْنِ جُبَيْرٍ عَنْ أَبِيهِ، عَنْ عَوْفِ بْنِ مَالِكٍ الأَشْجَعِيِّ، قَالَ كُنَّا نَرْقِي فِي الْجَاهِلِيَّةِ فَقُلْنَا يَا\n رَسُولَ اللَّهِ كَيْفَ تَرَى فِي ذَلِكَ فَقَالَ ‏\n\"‏ اعْرِضُوا عَلَىَّ رُقَاكُمْ لاَ بَأْسَ بِالرُّقَى مَا لَمْ يَكُنْ\n فِيهِ شِرْكٌ ‏\"‏ ‏.‏",
    "malay_translation": "Kami mengamalkan rawatan ruqyah pada zaman Jahiliyyah.  Lalu kami bertanya kepada Rasulullah SAW, \"Wahai Rasulullah, apakah pandangan tuan tentang amalan ini?\" Baginda menjawab, \"Tunjukkan kepadaku bacaan ruqyah kamu. Tiada apa-apa kesalahan dalam rawatan ruqyah selagi ia tidak mengandungi unsur syirik.\""
  },
  {
    "id": 12863,
    "hadith_number": 5586,
    "tajuk_hadith": "Rawatan dengan Surah Al-Fatihah",
    "perawi_melayu": "Abu Said al-Khudri",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، أَخْبَرَنَا هُشَيْمٌ، عَنْ أَبِي بِشْرٍ، عَنْ أَبِي الْمُتَوَكِّلِ،\n عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ نَاسًا، مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم كَانُوا فى\n سَفَرٍ فَمَرُّوا بِحَىٍّ مِنْ أَحْيَاءِ الْعَرَبِ فَاسْتَضَافُوهُمْ فَلَمْ يُضِيفُوهُمْ ‏.‏ فَقَالُوا لَهُمْ هَلْ فِيكُمْ\n رَاقٍ فَإِنَّ سَيِّدَ الْحَىِّ لَدِيغٌ أَوْ مُصَابٌ ‏.‏ فَقَالَ رَجُلٌ مِنْهُمْ نَعَمْ فَأَتَاهُ فَرَقَاهُ بِفَاتِحَةِ الْكِتَابِ\n فَبَرَأَ الرَّجُلُ فَأُعْطِيَ قَطِيعًا مِنْ غَنَمٍ فَأَبَى أَنْ يَقْبَلَهَا ‏.‏ وَقَالَ حَتَّى أَذْكُرَ ذَلِكَ لِلنَّبِيِّ صلى\n الله عليه وسلم ‏.‏ فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَذَكَرَ ذَلِكَ لَهُ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ وَاللَّهِ\n مَا رَقَيْتُ إِلاَّ بِفَاتِحَةِ الْكِتَابِ ‏.‏ فَتَبَسَّمَ وَقَالَ ‏\"‏ وَمَا أَدْرَاكَ أَنَّهَا رُقْيَةٌ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ خُذُوا\n مِنْهُمْ وَاضْرِبُوا لِي بِسَهْمٍ مَعَكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Yahya bin Yahya At-Tamimi, telah memberitakan kepada kami Husyaim, dari Abu Basyir, dari Abu Al-Mutawakkil, dari Abu Said Al-Khudri, bahawa sekumpulan sahabat Rasulullah SAW sedang dalam perjalanan. Mereka lalu melalui satu kampung dari kampung-kampung Arab lalu meminta tumpangan, tetapi mereka tidak dilayan. Maka mereka bertanya kepada mereka, \"Adakah di kalangan kamu ada tukang rawat? Kerana ketua kampung ini disengat atau terkena penyakit.\" Seorang dari mereka berkata, \"Ya.\" Maka dia datang kepadanya lalu merawatnya dengan Surah Al-Fatihah. Maka sembuhlah orang itu. Kemudian dia diberi seekor kambing, tetapi dia enggan menerimanya, dan berkata, \"Sampai saya beritahu Nabi SAW.\" Lalu dia datang kepada Nabi SAW dan menceritakan perkara itu. Maka katanya, \"Wahai Rasulullah, demi Allah, saya tidak merawatnya melainkan dengan Surah Al-Fatihah.\" Baginda tersenyum dan bertanya, \"Bagaimana engkau tahu bahawa ia merupakan rawatan?\" Kemudian baginda bersabda, \"Ambillah sebahagian daripadanya, dan berikan bahagianku bersama kamu.\""
  },
  {
    "id": 12864,
    "hadith_number": 5587,
    "tajuk_hadith": "Penyembuhan dengan Membaca Surah Al-Fatihah",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Abu Bishr melalui sanad yang sama (dengan lafaz ini):",
    "english_text": "That he recited Umm-ul-Qur'an (Sura Fatiha), and he collected his spittle and he applied that and the person became all right.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَأَبُو بَكْرِ بْنُ نَافِعٍ كِلاَهُمَا عَنْ غُنْدَرٍ، مُحَمَّدِ بْنِ جَعْفَرٍ\n عَنْ شُعْبَةَ، عَنْ أَبِي بِشْرٍ، بِهَذَا الإِسْنَادِ وَقَالَ فِي الْحَدِيثِ فَجَعَلَ يَقْرَأُ أُمَّ الْقُرْآنِ وَيَجْمَعُ\n بُزَاقَهُ وَيَتْفُلُ فَبَرَأَ الرَّجُلُ ‏.‏",
    "malay_translation": "Baginda membaca Ummul Qur'an (Surah Al-Fatihah), mengumpulkan air liurnya, kemudian meludahinya ke atas orang itu, lalu orang itu sembuh."
  },
  {
    "id": 12865,
    "hadith_number": 5588,
    "tajuk_hadith": "Penggunaan Surah Al-Fatihah untuk Ruqyah",
    "perawi_melayu": "Abu Said al-Khudri meriwayatkan:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا هِشَامُ بْنُ حَسَّانَ،\n عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَخِيهِ، مَعْبَدِ بْنِ سِيرِينَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ نَزَلْنَا مَنْزِلاً\n فَأَتَتْنَا امْرَأَةٌ فَقَالَتْ إِنَّ سَيِّدَ الْحَىِّ سَلِيمٌ لُدِغَ فَهَلْ فِيكُمْ مِنْ رَاقٍ فَقَامَ مَعَهَا رَجُلٌ مِنَّا مَا\n كُنَّا نَظُنُّهُ يُحْسِنُ رُقْيَةً فَرَقَاهُ بِفَاتِحَةِ الْكِتَابِ فَبَرَأَ فَأَعْطَوْهُ غَنَمًا وَسَقَوْنَا لَبَنًا فَقُلْنَا أَكُنْتَ\n تُحْسِنُ رُقْيَةً فَقَالَ مَا رَقَيْتُهُ إِلاَّ بِفَاتِحَةِ الْكِتَابِ ‏.‏ قَالَ فَقُلْتُ لاَ تُحَرِّكُوهَا حَتَّى نَأْتِيَ النَّبِيَّ\n صلى الله عليه وسلم ‏.‏ فَأَتَيْنَا النَّبِيَّ صلى الله عليه وسلم فَذَكَرْنَا ذَلِكَ لَهُ ‏.‏ فَقَالَ ‏\n\"‏ مَا\n كَانَ يُدْرِيهِ أَنَّهَا رُقْيَةٌ اقْسِمُوا وَاضْرِبُوا لِي بِسَهْمٍ مَعَكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Kami berhenti di suatu tempat, lalu datang seorang wanita kepada kami dan berkata, \"Ketua kaum kami, Salim, telah disengat kala jengking. Adakah di kalangan kamu ada yang pandai merawat dengan bacaan ruqyah?\"  Maka seorang lelaki di kalangan kami bangun dan pergi bersamanya. Kami tidak menyangka dia pandai merawat dengan ruqyah, tetapi dia merawatnya dengan Surah Al-Fatihah, lalu dia sembuh. Mereka memberi kepadanya seekor kambing dan memberi kami susu.  Kami bertanya, \"Adakah engkau pandai merawat dengan ruqyah?\" Dia menjawab, \"Aku tidak merawatnya melainkan dengan Surah Al-Fatihah.\"  Kemudian aku berkata, \"Janganlah kamu gerakkan (kambing itu) sehingga kami bertemu dengan Rasulullah ﷺ.\" Maka kami pergi kepada Rasulullah ﷺ dan menceritakan hal itu kepada baginda. Baginda bersabda, \"Bagaimana kamu tahu bahawa ia (Surah Al-Fatihah) boleh digunakan sebagai ruqyah? Bahagikanlah (kambing itu) dan berikan juga bahagianku.\" "
  },
  {
    "id": 12866,
    "hadith_number": 5589,
    "tajuk_hadith": "Seorang Lelaki Yang Tidak Dikenali Menyertai Seorang Wanita",
    "perawi_melayu": "Hadis ini diriwayatkan melalui Hisyam dengan sanad yang sama, dan beliau berkata:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا هِشَامٌ، بِهَذَا الإِسْنَادِ ‏.‏\n نَحْوَهُ غَيْرَ أَنَّهُ قَالَ فَقَامَ مَعَهَا رَجُلٌ مِنَّا مَا كُنَّا نَأْبِنُهُ بِرُقْيَةٍ ‏.‏",
    "malay_translation": "Muhammad bin Muthanna telah meriwayatkan kepadaku, Wahb bin Jarir telah meriwayatkan kepada kami, Hisyam telah meriwayatkan kepada kami, dengan sanad ini.\n Lebih kurang sama, hanya beliau berkata: Maka berdiri bersama wanita itu seorang lelaki daripada kalangan kami yang sebelum ini kami tidak kenali sebagai tukang ruqyah."
  },
  {
    "id": 12867,
    "hadith_number": 5590,
    "tajuk_hadith": "Doa untuk Kesakitan",
    "perawi_melayu": "Uthman bin Abu al-'As al-Thaqafi meriwayatkan bahawa beliau mengadu sakit kepada Rasulullah ﷺ yang dirasainya di tubuhnya sejak memeluk Islam.",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ،\n عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي نَافِعُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ الثَّقَفِيِّ، أَنَّهُ\n شَكَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَجَعًا يَجِدُهُ فِي جَسَدِهِ مُنْذُ أَسْلَمَ ‏.‏ فَقَالَ لَهُ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ ضَعْ يَدَكَ عَلَى الَّذِي تَأَلَّمَ مِنْ جَسَدِكَ وَقُلْ بِاسْمِ اللَّهِ\n ‏.‏ ثَلاَثًا ‏.‏ وَقُلْ سَبْعَ مَرَّاتٍ أَعُوذُ بِاللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ ‏\"‏ ‏.‏",
    "malay_translation": "Abu al-Thahir dan Harmalah bin Yahya meriwayatkan daripada Ibn Wahb, yang meriwayatkan daripada Yunus, daripada Ibn Syihab, yang meriwayatkan daripada Nafi' bin Jubair bin Mu'tim, daripada Uthman bin Abi al-'As al-Thaqafi, bahawa beliau mengadu sakit kepada Rasulullah SAW yang dirasainya di tubuhnya sejak memeluk Islam.  Maka Rasulullah SAW bersabda:  \"Letakkan tanganmu pada tempat yang sakit di tubuhmu dan bacalah 'Bismillah' tiga kali, dan bacalah tujuh kali: 'Aku berlindung kepada Allah dan kuasa-Nya daripada kejahatan yang aku dapati dan yang aku khuatirkan.'\""
  },
  {
    "id": 12868,
    "hadith_number": 5591,
    "tajuk_hadith": "Syaitan Khinzib dan Cara Mengatasinya",
    "perawi_melayu": "Uthman bin Abi al-'As meriwayatkan bahawa beliau datang kepada Rasulullah SAW dan berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ الْبَاهِلِيُّ، حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ سَعِيدٍ الْجُرَيْرِيِّ، عَنْ أَبِي،\n الْعَلاَءِ أَنَّ عُثْمَانَ بْنَ أَبِي الْعَاصِ، أَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ\n الشَّيْطَانَ قَدْ حَالَ بَيْنِي وَبَيْنَ صَلاَتِي وَقِرَاءَتِي يَلْبِسُهَا عَلَىَّ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله\n عليه وسلم ‏\n\"‏ ذَاكَ شَيْطَانٌ يُقَالُ لَهُ خِنْزِبٌ فَإِذَا أَحْسَسْتَهُ فَتَعَوَّذْ بِاللَّهِ مِنْهُ وَاتْفِلْ عَلَى يَسَارِكَ\n ثَلاَثًا ‏\"‏ ‏.‏ قَالَ فَفَعَلْتُ ذَلِكَ فَأَذْهَبَهُ اللَّهُ عَنِّي ‏.‏",
    "malay_translation": "Yahya bin Khalaf al-Bahili telah meriwayatkan daripada Abd al-A'la, daripada Sa'id al-Jurairi, daripada Abi al-'Ala', bahawa Uthman bin Abi al-'As telah datang kepada Nabi SAW lalu berkata, \"Wahai Rasulullah, sesungguhnya syaitan telah menghalang antara aku dengan solat dan bacaan al-Quran aku, ia telah mengelirukan aku.\"  Maka Rasulullah SAW bersabda, \"Itu adalah syaitan yang dinamakan Khinzib.  Maka apabila engkau merasainya, maka berlindunglah kepada Allah darinya dan ludahkanlah tiga kali ke sebelah kirimu.\"  Beliau berkata, \"Maka aku telah melakukannya, lalu Allah menghilangkannya daripada diriku.\""
  },
  {
    "id": 12869,
    "hadith_number": 5592,
    "tajuk_hadith": "Perbezaan Riwayat Mengenai Bilangan Ulangan",
    "perawi_melayu": "Muhammad bin al-Muthanna melalui Salim bin Nuh dan Abu Bakar bin Abi Syaibah melalui Abu Usamah, keduanya daripada al-Jurairi, daripada Abu al-Ala', daripada Uthman bin Abi al-'As",
    "english_text": "",
    "arabic_text": "حَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا سَالِمُ بْنُ نُوحٍ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،\n حَدَّثَنَا أَبُو أُسَامَةَ، كِلاَهُمَا عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي الْعَلاَءِ، عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ، أَنَّهُ\n أَتَى النَّبِيَّ صلى الله عليه وسلم ‏.‏ فَذَكَرَ بِمِثْلِهِ وَلَمْ يَذْكُرْ فِي حَدِيثِ سَالِمِ بْنِ نُوحٍ ثَلاَثًا ‏.‏",
    "malay_translation": "Kami telah diberitakan oleh Muhammad bin al-Muthanna, yang telah memberitakan kepada kami Salim bin Nuh, dan kami telah diberitakan oleh Abu Bakar bin Abi Syaibah, yang telah memberitakan kepada kami Abu Usamah. Keduanya daripada al-Jurairi, daripada Abu al-'Ala', daripada Uthman bin Abi al-'As, bahawa dia telah datang kepada Nabi SAW.  Kemudian dia menceritakan seperti itu, tetapi tidak disebut dalam riwayat Salim bin Nuh sebanyak tiga kali."
  },
  {
    "id": 12870,
    "hadith_number": 5593,
    "tajuk_hadith": "Hadis daripada Uthman bin Abu al-'As",
    "perawi_melayu": "Muhammad bin Rafi' meriwayatkan daripada Abdur Razzaq, yang diberitakan oleh Sufyan daripada Sa'id al-Jurairi. Yazid bin Abdullah bin Syikhir meriwayatkan daripada Uthman bin Abi al-'As al-Thaqafi.",
    "english_text": "This hadith has been transmitted on the authority of 'Uthman b. Abu al-'As with a slight variation of wording.",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا سُفْيَانُ، عَنْ سَعِيدٍ الْجُرَيْرِيِّ،\n حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ، عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ الثَّقَفِيِّ، قَالَ قُلْتُ يَا رَسُولَ\n اللَّهِ ‏.‏ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِهِمْ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Uthman bin Abi al-'As dengan sedikit perbezaan lafaz."
  },
  {
    "id": 12871,
    "hadith_number": 5594,
    "tajuk_hadith": "Penawar Bagi Setiap Penyakit",
    "perawi_melayu": "Jabir meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There is a remedy for every malady, and when the remedy is applied to the disease it is cured with the permission of Allah, the Exalted and Glorious.",
    "arabic_text": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، وَأَبُو الطَّاهِرِ، وَأَحْمَدُ بْنُ عِيسَى، قَالُوا حَدَّثَنَا ابْنُ وَهْبٍ،\n أَخْبَرَنِي عَمْرٌو، - وَهُوَ ابْنُ الْحَارِثِ - عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ،\n عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ لِكُلِّ دَاءٍ دَوَاءٌ فَإِذَا أُصِيبَ دَوَاءُ الدَّاءِ بَرَأَ\n بِإِذْنِ اللَّهِ عَزَّ وَجَلَّ ‏\"‏ ‏.‏",
    "malay_translation": "Setiap penyakit ada penawarnya, dan apabila penawar itu terkena penyakit tersebut, nescaya ia akan sembuh dengan izin Allah SWT."
  },
  {
    "id": 12872,
    "hadith_number": 5595,
    "tajuk_hadith": "Keberkesanan Bekam",
    "perawi_melayu": "Jabir meriwayatkan bahawa beliau melawat Muqanna’ dan kemudian berkata:",
    "english_text": "I will not go away unless you get yourself cupped, for I heard Allah's Messenger (ﷺ) say: It is a remedy.",
    "arabic_text": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، وَأَبُو الطَّاهِرِ، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو،\n أَنَّ بُكَيْرًا، حَدَّثَهُ أَنَّ عَاصِمَ بْنَ عُمَرَ بْنِ قَتَادَةَ حَدَّثَهُ أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ عَادَ الْمُقَنَّعَ ثُمَّ\n قَالَ لاَ أَبْرَحُ حَتَّى تَحْتَجِمَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ فِيهِ\n شِفَاءً ‏\"‏ ‏.‏",
    "malay_translation": "Jabir meriwayatkan bahawa beliau telah melawat Muqanna’ dan berkata, \"Aku tidak akan pergi sehingga engkau melakukan bekam, kerana aku mendengar Rasulullah ﷺ bersabda:  \"Sesungguhnya di dalamnya terdapat penyembuhan.\""
  },
  {
    "id": 12873,
    "hadith_number": 5596,
    "tajuk_hadith": "Rawatan Berkesan: Bekam, Madu, dan Kauter",
    "perawi_melayu": "'Asim b. 'Umar b. Qatada meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنِي أَبِي، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سُلَيْمَانَ،\n عَنْ عَاصِمِ بْنِ عُمَرَ بْنِ قَتَادَةَ، قَالَ جَاءَنَا جَابِرُ بْنُ عَبْدِ اللَّهِ فِي أَهْلِنَا وَرَجُلٌ يَشْتَكِي خُرَاجًا\n بِهِ أَوْ جِرَاحًا فَقَالَ مَا تَشْتَكِي قَالَ خُرَاجٌ بِي قَدْ شَقَّ عَلَىَّ ‏.‏ فَقَالَ يَا غُلاَمُ ائْتِنِي بِحَجَّامٍ\n ‏.‏ فَقَالَ لَهُ مَا تَصْنَعُ بِالْحَجَّامِ يَا أَبَا عَبْدِ اللَّهِ قَالَ أُرِيدُ أَنْ أُعَلِّقَ فِيهِ مِحْجَمًا ‏.‏ قَالَ وَاللَّهِ\n إِنَّ الذُّبَابَ لَيُصِيبُنِي أَوْ يُصِيبُنِي الثَّوْبُ فَيُؤْذِينِي وَيَشُقُّ عَلَىَّ ‏.‏ فَلَمَّا رَأَى تَبَرُّمَهُ مِنْ ذَلِكَ\n قَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِنْ كَانَ فِي شَىْءٍ مِنْ أَدْوِيَتِكُمْ\n خَيْرٌ فَفِي شَرْطَةِ مَحْجَمٍ أَوْ شَرْبَةٍ مِنْ عَسَلٍ أَوْ لَذْعَةٍ بِنَارٍ ‏\"‏ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله\n عليه وسلم ‏\"‏ وَمَا أُحِبُّ أَنْ أَكْتَوِيَ ‏\"‏ ‏.‏ قَالَ فَجَاءَ بِحَجَّامٍ فَشَرَطَهُ فَذَهَبَ عَنْهُ مَا يَجِدُ\n ‏.‏",
    "malay_translation": "Jabir bin Abdullah datang ke rumah kami bersama seorang lelaki yang mengadu sakit luka.  Lalu Jabir bertanya, “Apakah penyakitmu?” Lelaki itu menjawab, “Luka yang amat menyakitkan.” Jabir berkata, “Wahai budak, bawakan kepadaku tukang bekam.” Lelaki itu bertanya, “Wahai Aba Abdullah, apa tujuanmu dengan tukang bekam?” Jabir menjawab, “Aku ingin dibekam.” Lelaki itu berkata, “Demi Allah, sentuhan lalat atau kain pun menyakitkanku, apatah lagi bekam.” Melihat lelaki itu merintih kesakitan, Jabir berkata, “Aku pernah mendengar Rasulullah SAW bersabda:  ‘Jika terdapat kebaikan dalam rawatan kamu, maka ia adalah bekam, minum madu, atau kauter dengan api.’ Rasulullah SAW juga bersabda, ‘Aku tidak gemar kauter.’ Kemudian, tukang bekam dipanggil dan dibekamlah lelaki itu lalu sembuhlah dia."
  },
  {
    "id": 12874,
    "hadith_number": 5597,
    "tajuk_hadith": "Ummu Salamah Meminta Izin Untuk Berbekam",
    "perawi_melayu": "Jabir meriwayatkan bahawa Ummu Salamah meminta izin daripada Rasulullah ﷺ untuk berbekam.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ \n أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ أُمَّ سَلَمَةَ، اسْتَأْذَنَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي الْحِجَامَةِ\n فَأَمَرَ النَّبِيُّ صلى الله عليه وسلم أَبَا طَيْبَةَ أَنْ يَحْجُمَهَا ‏.‏ قَالَ حَسِبْتُ أَنَّهُ قَالَ كَانَ أَخَاهَا\n مِنَ الرَّضَاعَةِ أَوْ غُلاَمًا لَمْ يَحْتَلِمْ ‏.‏",
    "malay_translation": "Kami diberitakan oleh Qotaibah bin Sa'id, yang diberitakan kepadanya oleh Laith, dan kami juga diberitakan oleh Muhammad bin Rumh, yang diberitakan kepadanya oleh Laith, daripada Abu Az-Zubair, daripada Jabir, bahawa Ummu Salamah meminta izin kepada Rasulullah SAW untuk berbekam. Maka Nabi SAW menyuruh Abu Taibah untuk membekamnya.  Dia (Jabir) berkata: Aku sangka bahawa baginda berkata: Dia adalah adiknya (daripada susuan) atau seorang budak lelaki yang belum baligh."
  },
  {
    "id": 12875,
    "hadith_number": 5598,
    "tajuk_hadith": "Rasulullahﷺ Mengutus Tabib kepada Ubayy bin Ka'ab",
    "perawi_melayu": "Jabir",
    "english_text": "Jabir reported that Allah's Messenger (ﷺ) sent a physician to Ubayy b. Ka'b. He cut the vein and then cauterised it.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَ يَحْيَى - وَاللَّفْظُ\n لَهُ - أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ،\n قَالَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى أُبَىِّ بْنِ كَعْبٍ طَبِيبًا فَقَطَعَ مِنْهُ عِرْقًا ثُمَّ\n كَوَاهُ عَلَيْهِ ‏.‏",
    "malay_translation": "Jabir meriwayatkan bahawa Rasulullah ﷺ telah mengutus seorang tabib kepada Ubayy bin Ka'ab.  Tabib itu telah memotong urat beliau, kemudian membakarnya."
  },
  {
    "id": 12876,
    "hadith_number": 5599,
    "tajuk_hadith": "Riwayat A'mash Mengenai Luka",
    "perawi_melayu": "A'mash melalui beberapa perawi",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، ح وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا \n عَبْدُ الرَّحْمَنِ، أَخْبَرَنَا سُفْيَانُ، كِلاَهُمَا عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ وَلَمْ يَذْكُرَا فَقَطَعَ مِنْهُ عِرْقًا\n ‏.‏",
    "malay_translation": "Kami diberitakan oleh Usman bin Abi Syaibah, yang telah meriwayatkan daripada Jarir, dan aku juga diberitakan oleh Ishak bin Mansur, yang memberitakan daripada Abdur Rahman, yang memberitakan daripada Sufyan. Keduanya daripada A'mash, melalui sanad ini. Mereka berdua tidak menyebut tentang pemotongan urat tersebut."
  },
  {
    "id": 12877,
    "hadith_number": 5600,
    "tajuk_hadith": "Rawatan Rasulullah SAW terhadap Ubayy bin Ka'ab",
    "perawi_melayu": "Jabir bin Abdullah melalui beberapa perawi",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي بِشْرُ بْنُ خَالِدٍ، حَدَّثَنَا مُحَمَّدٌ، - يَعْنِي ابْنَ جَعْفَرٍ - عَنْ شُعْبَةَ، قَالَ سَمِعْتُ \n سُلَيْمَانَ، قَالَ سَمِعْتُ أَبَا سُفْيَانَ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، قَالَ رُمِيَ أُبَىٌّ يَوْمَ الأَحْزَابِ\n عَلَى أَكْحَلِهِ فَكَوَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Aku telah diberitakan oleh Bisyr bin Khalid, yang telah meriwayatkan dari Muhammad (maksudnya Ibnu Ja'far) daripada Syu'bah, dia berkata: Aku mendengar Sulaiman berkata: Aku mendengar Abu Sufian berkata: Aku mendengar Jabir bin Abdullah berkata: Pada hari perang Ahzab, Ubayy terkena panah pada urat nadi lengannya. Maka Rasulullah SAW membakarnya (untuk merawat luka tersebut)."
  },
  {
    "id": 12878,
    "hadith_number": 5601,
    "tajuk_hadith": "Rawatan Nabi SAW terhadap Luka Saad bin Mu'adz",
    "perawi_melayu": "Jabir",
    "english_text": "Jabir reported that Sa'd b. Mu'adh received a wound of the arrow in his vein. Allah's Messenger (ﷺ) cauterised it with a rod and it was swollen, to the Messenger of Allah (ﷺ) did it for the second time.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، ح وَحَدَّثَنَا يَحْيَى،\n بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ رُمِيَ سَعْدُ بْنُ مُعَاذٍ فِي أَكْحَلِهِ\n - قَالَ - فَحَسَمَهُ النَّبِيُّ صلى الله عليه وسلم بِيَدِهِ بِمِشْقَصٍ ثُمَّ وَرِمَتْ فَحَسَمَهُ الثَّانِيَةَ ‏.‏",
    "malay_translation": "Jabir meriwayatkan bahawa Saad bin Mu'adz terkena panah pada urat nadinya. Rasulullah SAW membakar luka itu dengan besi panas, dan kemudian bengkak.  Rasulullah SAW pun membakarnya sekali lagi."
  },
  {
    "id": 12879,
    "hadith_number": 5602,
    "tajuk_hadith": "Rasulullah ﷺ Berurut dan Memberi Upah",
    "perawi_melayu": "Ahmad bin Sa'id bin Sakhr al-Darimi, melalui Habban bin Hilal, melalui Wuhaib, melalui Abdullah bin Taawus, daripada bapanya, daripada Ibnu Abbas.",
    "english_text": "Ibn 'Abbas reported that Allah's Apostle (ﷺ) got himself cupped and gave to the cupper his wages and he put the medicine in the nostril.",
    "arabic_text": "حَدَّثَنِي أَحْمَدُ بْنُ سَعِيدِ بْنِ صَخْرٍ الدَّارِمِيُّ، حَدَّثَنَا حَبَّانُ بْنُ هِلاَلٍ، حَدَّثَنَا وُهَيْبٌ،\n حَدَّثَنَا عَبْدُ اللَّهِ بْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم احْتَجَمَ\n وَأَعْطَى الْحَجَّامَ أَجْرَهُ وَاسْتَعَطَ ‏.‏",
    "malay_translation": "Ibnu Abbas meriwayatkan bahawa Rasulullah ﷺ menjalani rawatan bekam dan memberikan upah kepada tukang bekam, dan beliau memasukkan ubat ke dalam hidung."
  },
  {
    "id": 12880,
    "hadith_number": 5603,
    "tajuk_hadith": "Rasulullah ﷺ Berbekam dan Tidak Menzalimi Upah Sesiapa",
    "perawi_melayu": "Anas bin Malik melalui beberapa perawi termasuk Amru bin Amir al-Ansari",
    "english_text": "Anas b. Malik reported that Allah's Messenger (ﷺ) got himself cupped and never withheld the wages of anyone.",
    "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالَ أَبُو بَكْرٍ حَدَّثَنَا وَكِيعٌ، وَقَالَ،\n أَبُو كُرَيْبٍ - وَاللَّفْظُ لَهُ - أَخْبَرَنَا وَكِيعٌ، عَنْ مِسْعَرٍ، عَنْ عَمْرِو بْنِ عَامِرٍ الأَنْصَارِيِّ، قَالَ\n سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ احْتَجَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَكَانَ لاَ يَظْلِمُ أَحَدًا\n أَجْرَهُ ‏.‏",
    "malay_translation": "Anas bin Malik meriwayatkan bahawa Rasulullah ﷺ berbekam dan baginda tidak pernah menzalimi sesiapa pun upahnya."
  },
  {
    "id": 12881,
    "hadith_number": 5604,
    "tajuk_hadith": "Demam sebagai Suatu Ujian dari Neraka",
    "perawi_melayu": "Ibnu Umar meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The fever from the vehement raging of the (heat of Hell), so cool it with the help of water.",
    "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا يَحْيَى، - وَهُوَ ابْنُ سَعِيدٍ\n - عَنْ عُبَيْدِ اللَّهِ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْحُمَّى\n مِنْ فَيْحِ جَهَنَّمَ فَابْرُدُوهَا بِالْمَاءِ ‏\"‏ ‏.‏",
    "malay_translation": "Demam itu adalah sebahagian daripada hembusan api neraka Jahannam, maka sejukkanlah ia dengan air."
  },
  {
    "id": 12882,
    "hadith_number": 5605,
    "tajuk_hadith": "Demam dan Panas Neraka Jahannam",
    "perawi_melayu": "Ibn Umar meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Fever is due to vehemence of the heat of Hell, so cool it with water.",
    "arabic_text": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي وَمُحَمَّدُ بْنُ بِشْرٍ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،\n حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَمُحَمَّدُ بْنُ بِشْرٍ، قَالاَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ \n النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ شِدَّةَ الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ فَابْرُدُوهَا بِالْمَاءِ ‏\"‏\n ‏.‏",
    "malay_translation": "Sesungguhnya kepanasan demam itu adalah sebahagian daripada hembusan api neraka Jahannam, maka sejukkanlah ia dengan air."
  },
  {
    "id": 12883,
    "hadith_number": 5606,
    "tajuk_hadith": "Demam Daripada Api Neraka",
    "perawi_melayu": "Ibnu Umar meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Fever is from the vehement raging of the fire of Hell, so extinguish it with water.",
    "arabic_text": "وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، حَدَّثَنِي مَالِكٌ، ح وَحَدَّثَنَا مُحَمَّدُ،\n بْنُ رَافِعٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنَا الضَّحَّاكُ، - يَعْنِي ابْنَ عُثْمَانَ - كِلاَهُمَا عَنْ نَافِعٍ،\n عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ فَأَطْفِئُوهَا\n بِالْمَاءِ ‏\"‏ ‏.‏",
    "malay_translation": "Demam adalah daripada api neraka Jahanam, maka padamkanlah ia dengan air."
  },
  {
    "id": 12884,
    "hadith_number": 5607,
    "tajuk_hadith": "Demam: Panas Api Neraka",
    "perawi_melayu": "Ibn Umar meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Fever is from the vehement Paging of the Hell-fire, so cool it with water.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنِي \n هَارُونُ بْنُ عَبْدِ اللَّهِ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا رَوْحٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عُمَرَ بْنِ مُحَمَّدِ بْنِ زَيْدٍ،\n عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ\n فَأَطْفِئُوهَا بِالْمَاءِ ‏\"‏ ‏.‏",
    "malay_translation": "Demam itu daripada hembusan api neraka Jahanam, maka padamkanlah ia dengan air."
  },
  {
    "id": 12885,
    "hadith_number": 5608,
    "tajuk_hadith": "Demam Adalah Daripada Api Neraka",
    "perawi_melayu": "Aisyah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Fever is from the vehement raging of the Hell-fire, so cool it with water.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا ابْنُ نُمَيْرٍ، عَنْ هِشَامٍ، عَنْ \n أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ فَابْرُدُوهَا\n بِالْمَاءِ ‏\"‏ ‏.‏",
    "malay_translation": "Demam itu adalah daripada hembusan api neraka Jahannam, maka sejukkanlah ia dengan air."
  },
  {
    "id": 12886,
    "hadith_number": 5609,
    "tajuk_hadith": "Riwayat Hisyam dengan Sanad yang Sama",
    "perawi_melayu": "Hisham dan periwayat-periwayat lain yang disebutkan dalam sanad.",
    "english_text": "This hadith has been narrated on the authority of Hisham with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا خَالِدُ بْنُ الْحَارِثِ، وَعَبْدَةُ بْنُ سُلَيْمَانَ، جَمِيعًا\n عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Hisyam dengan sanad (rantaian periwayat) yang sama.  Ishaq bin Ibrahim memberitakan kepada kami, Khalid bin Harith dan Abdat bin Sulaiman, semuanya meriwayatkan daripada Hisyam dengan sanad yang serupa."
  },
  {
    "id": 12887,
    "hadith_number": 5610,
    "tajuk_hadith": "Mendinginkan Demam dengan Air",
    "perawi_melayu": "Asma' meriwayatkan bahawa seorang wanita yang demam tinggi dibawa kepadanya. Dia meminta air dibawa dan kemudian menyiramkannya di bahagian atas dada dan berkata bahawa Rasulullah SAW telah bersabda:",
    "english_text": "Cool (the fever) with water. for it is because of the vehemence of the beat of Hell.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ هِشَامٍ، عَنْ فَاطِمَةَ،\n عَنْ أَسْمَاءَ، أَنَّهَا كَانَتْ تُؤْتَى بِالْمَرْأَةِ الْمَوْعُوكَةِ فَتَدْعُو بِالْمَاءِ فَتَصُبُّهُ فِي جَيْبِهَا وَتَقُولُ\n إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ ابْرُدُوهَا بِالْمَاءِ ‏\"‏ ‏.‏ وَقَالَ ‏\"‏ إِنَّهَا مِنْ فَيْحِ\n جَهَنَّمَ ‏\"‏ ‏.‏",
    "malay_translation": "Asma’ meriwayatkan bahawa seorang wanita yang demam tinggi dibawa kepadanya. Dia meminta air dibawa dan kemudian menyiramkannya ke bahagian atas dadanya sambil berkata bahawa Rasulullah SAW telah bersabda: \"Sejukkanlah (demamnya) dengan air.\" Baginda juga bersabda: \"Kerana ia adalah daripada bahang api neraka Jahanam.\""
  },
  {
    "id": 12888,
    "hadith_number": 5611,
    "tajuk_hadith": "Mencurahkan Air untuk Meredakan Haba Neraka",
    "perawi_melayu": "Hisham meriwayatkan hadis ini dengan sanad yang sama.  Dalam hadis yang diriwayatkan melalui Ibnu Numair (kata-katanya):",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ ‏.‏ وَفِي\n حَدِيثِ ابْنِ نُمَيْرٍ صَبَّتِ الْمَاءَ بَيْنَهَا وَبَيْنَ جَيْبِهَا ‏.‏ وَلَمْ يَذْكُرْ فِي حَدِيثِ أَبِي أُسَامَةَ ‏\n\"‏ أَنَّهَا\n مِنْ فَيْحِ جَهَنَّمَ ‏\"‏ ‏.‏ قَالَ أَبُو أَحْمَدَ قَالَ إِبْرَاهِيمُ حَدَّثَنَا الْحَسَنُ بْنُ بِشْرٍ حَدَّثَنَا أَبُو أُسَامَةَ\n بِهَذَا الإِسْنَادِ ‏.‏",
    "malay_translation": "Dan telah menceritakan kepada kami Abu Kuraib, telah menceritakan kepada kami Ibnu Numair, dan Abu Usamah daripada Hisyam, dengan sanad yang demikian.  Dan dalam hadis Ibnu Numair:  (ia) menyiram air di antara dirinya dan celah bajunya.  Dan tidak disebut dalam hadis Abu Usamah:  \"Bahawa ia daripada hembusan api neraka.\"  Abu Ahmad berkata, Ibrahim berkata, Hasan bin Basyar telah menceritakan kepada kami, Abu Usamah telah menceritakan kepada kami dengan sanad yang demikian."
  },
  {
    "id": 12889,
    "hadith_number": 5612,
    "tajuk_hadith": "Demam Sebagai Suatu Ujian dari Neraka",
    "perawi_melayu": "Rafi' bin Khadij meriwayatkan:",
    "english_text": "I heard Allah's messenger (ﷺ) as saying: The fever is due to the intense heat of the Hell, so cool it with water.",
    "arabic_text": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ سَعِيدِ بْنِ مَسْرُوقٍ، عَنْ عَبَايَةَ،\n بْنِ رِفَاعَةَ عَنْ جَدِّهِ، رَافِعِ بْنِ خَدِيجٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ\n ‏\n\"‏ إِنَّ الْحُمَّى فَوْرٌ مِنْ جَهَنَّمَ فَابْرُدُوهَا بِالْمَاءِ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda: \"Demam itu adalah sebahagian daripada api neraka Jahannam, oleh itu, sejukkanlah ia dengan air.\""
  },
  {
    "id": 12890,
    "hadith_number": 5613,
    "tajuk_hadith": "Demam dari Kepanasan Neraka Jahanam",
    "perawi_melayu": "Daripada riwayat Rafi' bin Khadij:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ حَاتِمٍ، وَأَبُو بَكْرِ بْنُ\n نَافِعٍ قَالُوا حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ أَبِيهِ، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ، حَدَّثَنِي \n رَافِعُ بْنُ خَدِيجٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ الْحُمَّى مِنْ فَوْرِ جَهَنَّمَ\n فَابْرُدُوهَا عَنْكُمْ بِالْمَاءِ ‏\"‏ ‏.‏ وَلَمْ يَذْكُرْ أَبُو بَكْرٍ ‏\"‏ عَنْكُمْ ‏\"‏ ‏.‏ وَقَالَ قَالَ أَخْبَرَنِي رَافِعُ بْنُ\n خَدِيجٍ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Bakar bin Abi Syaibah, Muhammad bin Al-Mutsanna, Muhammad bin Hatim dan Abu Bakar bin Nafi', mereka berkata; telah menceritakan kepada kami Abdur Rahman bin Mahdi, daripada Sufyan, daripada bapanya, daripada Abayah bin Rifaa'ah, telah menceritakan kepadaku Rafi' bin Khadij, katanya: Aku mendengar Rasulullah SAW bersabda: \"Demam itu adalah daripada suhu panas Neraka Jahanam, maka sejukkanlah dengan air.\"  Abu Bakar tidak menyebut perkataan \"daripada kamu\", dan beliau berkata bahawa Rafi' bin Khadij telah memberitahukannya."
  },
  {
    "id": 12891,
    "hadith_number": 5614,
    "tajuk_hadith": "Memberi Ubat Kepada Orang Sakit",
    "perawi_melayu": "Aisyah meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، حَدَّثَنِي مُوسَى بْنُ أَبِي،\n عَائِشَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ عَائِشَةَ، قَالَتْ لَدَدْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم\n فِي مَرَضِهِ فَأَشَارَ أَنْ لاَ تَلُدُّونِي ‏.‏ فَقُلْنَا كَرَاهِيَةُ الْمَرِيضِ لِلدَّوَاءِ ‏.‏ فَلَمَّا أَفَاقَ قَالَ ‏\n\"‏ لاَ\n يَبْقَى أَحَدٌ مِنْكُمْ إِلاَّ لُدَّ غَيْرُ الْعَبَّاسِ فَإِنَّهُ لَمْ يَشْهَدْكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Aku telah diberitakan oleh Muhammad bin Hatim, yang telah diberitakan kepadanya oleh Yahya bin Said, daripada Sufyan, yang telah diberitakan kepadanya oleh Musa bin Abi Aisyah, daripada Ubaidillah bin Abdullah, daripada Aisyah.  Aisyah berkata: Kami menghampiri Rasulullah SAW ketika baginda sakit. Baginda memberi isyarat agar kami tidak memaksa baginda minum ubat. Kami berkata: Mungkin kerana rasa kurang selesa orang sakit terhadap ubat.  Setelah baginda sedar, baginda bersabda: “Tiada seorang pun di antara kamu melainkan hendaklah diberi ubat, kecuali Ibnu Abbas kerana dia tidak berada bersama kamu.”"
  },
  {
    "id": 12892,
    "hadith_number": 5615,
    "tajuk_hadith": "Menjaga Kebersihan dan Rawatan Tradisional",
    "perawi_melayu": "Umm Qais binti Mihsan, adik perempuan kepada Ukkashah bin Mihsan berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ\n بْنُ حَرْبٍ وَابْنُ أَبِي عُمَرَ - وَاللَّفْظُ لِزُهَيْرٍ - قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا سُفْيَانُ،\n بْنُ عُيَيْنَةَ عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ، أُخْتِ عُكَّاشَةَ\n بْنِ مِحْصَنٍ قَالَتْ دَخَلْتُ بِابْنٍ لِي عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم لَمْ يَأْكُلِ الطَّعَامَ\n فَبَالَ عَلَيْهِ فَدَعَا بِمَاءٍ فَرَشَّهُ ‏.‏ \n قَالَتْ وَدَخَلْتُ عَلَيْهِ بِابْنٍ لِي قَدْ أَعْلَقْتُ عَلَيْهِ مِنَ الْعُذْرَةِ فَقَالَ ‏\n\"‏ عَلاَمَهْ تَدْغَرْنَ\n أَوْلاَدَكُنَّ بِهَذَا الْعِلاَقِ عَلَيْكُنَّ بِهَذَا الْعُودِ الْهِنْدِيِّ فَإِنَّ فِيهِ سَبْعَةَ أَشْفِيَةٍ مِنْهَا ذَاتُ الْجَنْبِ\n يُسْعَطُ مِنَ الْعُذْرَةِ وَيُلَدُّ مِنْ ذَاتِ الْجَنْبِ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Yahya bin Yahya At Tamimi, dan Abu Bakar bin Abi Syaibah, dan Amru An Naqid dan Zuhair bin Harb dan Ibnu Abi Umar - dan lafaznya daripada Zuhair - Yahya berkata: telah menceritakan kepada kami, dan yang lain berkata: telah menceritakan kepada kami Sufyan bin Uyainah daripada Az Zuhri, daripada Ubaidillah bin Abdullah, daripada Umm Qais binti Mihsan, adik perempuan kepada Ukkashah bin Mihsan, beliau berkata: Aku masuk mengadap Rasulullah SAW bersama anakku yang belum makan, lalu anakku membuang air kecil ke atas pakaianku. Baginda menyuruh membawa air lalu menyiramnya.\nBeliau berkata: Dan aku masuk mengadap Baginda bersama anakku yang aku telah menekan bengkak pada uvula (anak tekak) nya. Maka Baginda bertanya: “Mengapa kamu menyusahkan anak-anak kamu dengan cara menekan begini? Gunakanlah kayu aloes India ini, kerana di dalamnya terdapat tujuh jenis ubat, antaranya ialah ubat untuk penyakit radang selaput dada. Ia disapukan melalui hidung untuk bengkak pada uvula dan diteteskan ke sisi mulut untuk penyakit radang selaput dada.”"
  },
  {
    "id": 12893,
    "hadith_number": 5616,
    "tajuk_hadith": "Rawatan Uvula Anak dan Tindakan Rasulullah SAW",
    "perawi_melayu": "Umm Qais binti Mihsan, seorang daripada wanita Muhajirin awal yang memberi bai'ah kepada Rasulullah SAW. Baginda adalah saudara perempuan kepada Ukashah bin Mihsan, daripada keturunan Asad bin Khuzaimah.",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ، أَنَّ ابْنَ شِهَابٍ،\n أَخْبَرَهُ قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ أُمَّ قَيْسٍ بِنْتَ مِحْصَنٍ،\n - وَكَانَتْ مِنَ الْمُهَاجِرَاتِ الأُوَلِ اللاَّتِي بَايَعْنَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهِيَ أُخْتُ\n عُكَّاشَةَ بْنِ مِحْصَنٍ أَحَدِ بَنِي أَسَدِ بْنِ خُزَيْمَةَ - قَالَ أَخْبَرَتْنِي أَنَّهَا أَتَتْ رَسُولَ اللَّهِ صلى\n الله عليه وسلم بِابْنٍ لَهَا لَمْ يَبْلُغْ أَنْ يَأْكُلَ الطَّعَامَ وَقَدْ أَعْلَقَتْ عَلَيْهِ مِنَ الْعُذْرَةِ - قَالَ يُونُسُ\n أَعْلَقَتْ غَمَزَتْ فَهِيَ تَخَافُ أَنْ يَكُونَ بِهِ عُذْرَةٌ - قَالَتْ - فَقَالَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم ‏\n\"‏ عَلاَمَهْ تَدْغَرْنَ أَوْلاَدَكُنَّ بِهَذَا الإِعْلاَقِ عَلَيْكُمْ بِهَذَا الْعُودِ الْهِنْدِيِّ - يَعْنِي بِهِ الْكُسْتَ\n - فَإِنَّ فِيهِ سَبْعَةَ أَشْفِيَةٍ مِنْهَا ذَاتُ الْجَنْبِ ‏\"‏ ‏.‏ \n قَالَ عُبَيْدُ اللَّهِ وَأَخْبَرَتْنِي أَنَّ ابْنَهَا ذَاكَ بَالَ فِي حَجْرِ رَسُولِ اللَّهِ صلى الله عليه\n وسلم فَدَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِمَاءٍ فَنَضَحَهُ عَلَى بَوْلِهِ وَلَمْ يَغْسِلْهُ غَسْلاً\n ‏.‏",
    "malay_translation": "Umm Qais binti Mihsan telah menceritakan bahawa beliau datang kepada Rasulullah SAW membawa anaknya yang belum sampai umur menyusu, dan telah menekan bengkak pada uvula anaknya. (Yunus berkata: beliau menekan dan mengurut uvula anaknya kerana bimbang ia membengkak).  Rasulullah SAW bersabda: \"Mengapa kamu menyusahkan anak-anakmu dengan cara begini? Gunakanlah kayu aloes India, kerana ia mempunyai tujuh khasiat, antaranya adalah untuk merawat penyakit radang paru-paru.\" Ubaidullah memberitahu bahawa anak itu pernah membuang air kecil di pangkuan Rasulullah SAW. Rasulullah SAW telah meminta air dan menyiramkannya ke atas air kencing tersebut, tetapi baginda tidak membasuhnya dengan bersih."
  },
  {
    "id": 12894,
    "hadith_number": 5617,
    "tajuk_hadith": "Kegunaan Habbatussauda'",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa baginda Rasulullah SAW bersabda:",
    "english_text": "Nigella seed is a remedy for every disease except death.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، أَخْبَرَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي \n أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، وَسَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، أَخْبَرَهُمَا أَنَّهُ، سَمِعَ رَسُولَ\n اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ فِي الْحَبَّةِ السَّوْدَاءِ شِفَاءً مِنْ كُلِّ دَاءٍ إِلاَّ السَّامَ ‏\"‏\n ‏.‏ وَالسَّامُ الْمَوْتُ ‏.‏ وَالْحَبَّةُ السَّوْدَاءُ الشُّونِيزُ ‏.‏",
    "malay_translation": "Daripada Abu Hurairah, baginda Rasulullah SAW bersabda: \"Sesungguhnya dalam habah sauda' terdapat ubat bagi setiap penyakit kecuali kematian.\"  Sam adalah kematian. Dan habah sauda' ialah  Habbatussauda'."
  },
  {
    "id": 12895,
    "hadith_number": 5618,
    "tajuk_hadith": "Variasi Ringkas Hadis melalui Sanad Berbeza",
    "perawi_melayu": "Abu Thahir, Harmalah, Ibn Wahb, Yunus, Ibn Syihab, Sa'id bin Musayyab, Abu Hurairah, dan Nabi SAW.  Juga diriwayatkan oleh Abu Bakar bin Abi Syaibah, Amr al-Naqid, Zuhair bin Harb, Ibn Abi Umar, Sufyan bin Uyainah, Abd bin Humaid, Abd al-Razzaq, Ma'mar, Abdullah bin Abd al-Rahman al-Darimi, Abu al-Yaman, dan Syu'aib, semuanya melalui al-Zuhri, Abu Salamah, Abu Hurairah, dan Nabi SAW.",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِيهِ أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ،\n شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ح \n وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، وَابْنُ أَبِي عُمَرَ،\n قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ،\n ح وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، كُلُّهُمْ عَنِ \n الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ بِمِثْلِ حَدِيثِ عُقَيْلٍ\n وَفِي حَدِيثِ سُفْيَانَ وَيُونُسَ الْحَبَّةُ السَّوْدَاءُ ‏.‏ وَلَمْ يَقُلِ الشُّونِيزُ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan melalui beberapa sanad dengan sedikit perbezaan lafaz."
  },
  {
    "id": 12896,
    "hadith_number": 5619,
    "tajuk_hadith": "Kegunaan Habbatussauda",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There is no disease for which Nigella seed does not provide remedy.",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، -\n وَهُوَ ابْنُ جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم\n قَالَ ‏\n\"‏ مَا مِنْ دَاءٍ إِلاَّ فِي الْحَبَّةِ السَّوْدَاءِ مِنْهُ شِفَاءٌ إِلاَّ السَّامَ ‏\"‏ ‏.‏",
    "malay_translation": "Tidak ada satu penyakit pun melainkan pada habatussauda terdapat ubatnya kecuali penyakit samum."
  },
  {
    "id": 12897,
    "hadith_number": 5620,
    "tajuk_hadith": "Talbina: Penawar Hati yang Sedih",
    "perawi_melayu": "Aisyah, isteri Rasulullah SAW.",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي \n عُقَيْلُ بْنُ خَالِدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم\n أَنَّهَا كَانَتْ إِذَا مَاتَ الْمَيِّتُ مِنْ أَهْلِهَا فَاجْتَمَعَ لِذَلِكَ النِّسَاءُ ثُمَّ تَفَرَّقْنَ إِلاَّ أَهْلَهَا وَخَاصَّتَهَا\n - أَمَرَتْ بِبُرْمَةٍ مِنْ تَلْبِينَةٍ فَطُبِخَتْ ثُمَّ صُنِعَ ثَرِيدٌ فَصُبَّتِ التَّلْبِينَةُ عَلَيْهَا ثُمَّ قَالَتْ كُلْنَ مِنْهَا\n فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ التَّلْبِينَةُ مَجَمَّةٌ لِفُؤَادِ الْمَرِيضِ تُذْهِبُ\n بَعْضَ الْحُزْنِ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdul Malik bin Syu'aib bin Laits bin Saad, telah menceritakan kepadaku ayahku, daripada datukku, telah menceritakan kepadaku Uqail bin Khalid, daripada Ibnu Syihab, daripada Urwah, daripada Aisyah, isteri Nabi SAW, bahawa beliau, apabila ada yang meninggal dunia daripada keluarganya, maka berkumpul wanita-wanita untuk takziah, kemudian mereka bersurai kecuali ahli keluarganya dan beberapa orang yang tertentu. Beliau menyuruh menyediakan talbinah dalam periuk kecil, kemudian ia dimasak, lalu dibuat tharīd, kemudian talbinah itu dituang ke atasnya, kemudian beliau berkata: Makanlah daripadanya, sesungguhnya aku telah mendengar Rasulullah SAW bersabda: \"Talbinah itu penawar untuk hati yang sakit, menghilangkan sebahagian daripada kesedihan.\""
  },
  {
    "id": 12898,
    "hadith_number": 5621,
    "tajuk_hadith": "Madu sebagai Ubat Cirit-birit",
    "perawi_melayu": "Abu Said al-Khudri",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا \n مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَبِي الْمُتَوَكِّلِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ جَاءَ\n رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ إِنَّ أَخِي اسْتَطْلَقَ بَطْنُهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم ‏\"‏ اسْقِهِ عَسَلاً ‏\"‏ ‏.‏ فَسَقَاهُ ثُمَّ جَاءَهُ فَقَالَ إِنِّي سَقَيْتُهُ عَسَلاً فَلَمْ يَزِدْهُ إِلاَّ\n اسْتِطْلاَقًا ‏.‏ فَقَالَ لَهُ ثَلاَثَ مَرَّاتٍ ثُمَّ جَاءَ الرَّابِعَةَ فَقَالَ ‏\"‏ اسْقِهِ عَسَلاً ‏\"‏ ‏.‏ فَقَالَ لَقَدْ سَقَيْتُهُ\n فَلَمْ يَزِدْهُ إِلاَّ اسْتِطْلاَقًا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ صَدَقَ اللَّهُ وَكَذَبَ بَطْنُ\n أَخِيكَ ‏\"‏ ‏.‏ فَسَقَاهُ فَبَرَأَ ‏.‏",
    "malay_translation": "Daripada Abu Said al-Khudri, beliau berkata: Seorang lelaki datang kepada Nabi SAW lalu berkata, “Saudara saya mengalami cirit-birit.”  Maka Rasulullah SAW bersabda, “Berikan kepadanya madu.” Lelaki itu pun memberikan madu kepada saudaranya, kemudian dia kembali kepada Nabi SAW dan berkata, “Saya telah memberinya madu, tetapi ia hanya menyebabkan cirit-biritnya semakin teruk.”  Beliau mengulanginya tiga kali. Kemudian pada kunjungan keempat, beliau berkata lagi, “Berikan kepadanya madu.” Lelaki itu menjawab, “Saya telah memberinya, tetapi ia hanya menyebabkan cirit-biritnya semakin teruk.”  Maka Rasulullah SAW bersabda, “Allah Maha Benar, dan perut saudaramu itu pendusta.”  Lelaki itu pun memberikan madu lagi, dan saudaranya sembuh."
  },
  {
    "id": 12899,
    "hadith_number": 5622,
    "tajuk_hadith": "Rawatan dengan Madu",
    "perawi_melayu": "Daripada Abu Said al-Khudri melalui beberapa perawi lain dengan sedikit perbezaan lafaz.",
    "english_text": "This hadith has been narrated on the authority of Abu Sa'id Khudri through another chain of transmitters but with a slight variation of wording.",
    "arabic_text": "وَحَدَّثَنِيهِ عَمْرُو بْنُ زُرَارَةَ، أَخْبَرَنَا عَبْدُ الْوَهَّابِ، - يَعْنِي ابْنَ عَطَاءٍ - عَنْ سَعِيدٍ،\n عَنْ قَتَادَةَ، عَنْ أَبِي الْمُتَوَكِّلِ النَّاجِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله\n عليه وسلم فَقَالَ إِنَّ أَخِي عَرِبَ بَطْنُهُ ‏.‏ فَقَالَ لَهُ ‏\n\"‏ اسْقِهِ عَسَلاً ‏\"‏ ‏.‏ بِمَعْنَى حَدِيثِ شُعْبَةَ\n ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Amru bin Zurarah, telah memberitakan kepada kami Abdul Wahhab - iaitu Ibnu Ata’ - daripada Said, daripada Qatadah, daripada Abu al-Mutawakkil al-Naji, daripada Abu Said al-Khudri, bahawa seorang lelaki datang kepada Nabi SAW lalu berkata: “Saudara lelakiku mengalami masalah perut.”  Maka Baginda SAW bersabda: “Berikan dia madu untuk diminum.”  (Ini adalah) bermaksud sama seperti hadis Syu’bah."
  },
  {
    "id": 12900,
    "hadith_number": 5623,
    "tajuk_hadith": "Wabak Taun: Panduan daripada Rasulullah SAW",
    "perawi_melayu": "Amir bin Sa'd bin Abu Waqqas meriwayatkan daripada bapanya bahawa baginda bertanya kepada Usamah bin Zaid:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، وَأَبِي النَّضْرِ،\n مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَهُ يَسْأَلُ، أُسَامَةَ\n بْنَ زَيْدٍ مَاذَا سَمِعْتَ مِنْ، رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الطَّاعُونِ فَقَالَ أُسَامَةُ قَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الطَّاعُونُ رِجْزٌ أَوْ عَذَابٌ أُرْسِلَ عَلَى بَنِي إِسْرَائِيلَ أَوْ\n عَلَى مَنْ كَانَ قَبْلَكُمْ فَإِذَا سَمِعْتُمْ بِهِ بِأَرْضٍ فَلاَ تَقْدَمُوا عَلَيْهِ وَإِذَا وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا\n فَلاَ تَخْرُجُوا فِرَارًا مِنْهُ ‏\"‏ ‏.‏ وَقَالَ أَبُو النَّضْرِ ‏\"‏ لاَ يُخْرِجُكُمْ إِلاَّ فِرَارٌ مِنْهُ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya bin Yahya telah meriwayatkan, katanya: Aku telah membaca daripada Malik daripada Muhammad bin Munkidir dan Abu Nadhr, hamba Umar bin Abdillah daripada Amir bin Sa'd bin Abi Waqqas, daripada bapanya, bahawa baginda mendengar baginda bertanya kepada Usamah bin Zaid, apa yang engkau telah dengar daripada Rasulullah SAW tentang wabak taun? Maka Usamah berkata: Rasulullah SAW bersabda: \"Taun itu satu bala atau azab yang dihantar kepada Bani Israil atau kepada orang-orang sebelum kamu. Maka apabila kamu mendengar tentangnya di suatu negeri, janganlah kamu mendatanginya, dan apabila ia berlaku di negeri kamu berada, maka janganlah kamu lari meninggalkannya.\"  Dan Abu Nadhr berkata: \"Janganlah kamu keluar melainkan kerana melarikan diri daripadanya.\""
  },
  {
    "id": 12901,
    "hadith_number": 5624,
    "tajuk_hadith": "Wabak Penyakit: Masuk atau Lari?",
    "perawi_melayu": "Usamah bin Zaid meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Plague is the sign of a calamity with which Allah, the Exalted and Glorious, affects people from His servants. So when you hear about it, don't enter there (where it has broken out), and when it has broken out in a land and you are there, then don't run away from it.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، قَالاَ أَخْبَرَنَا الْمُغِيرَةُ، -\n وَنَسَبَهُ ابْنُ قَعْنَبٍ فَقَالَ ابْنُ عَبْدِ الرَّحْمَنِ الْقُرَشِيُّ - عَنْ أَبِي النَّضْرِ، عَنْ عَامِرِ بْنِ سَعْدِ،\n بْنِ أَبِي وَقَّاصٍ عَنْ أُسَامَةَ بْنِ زَيْدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الطَّاعُونُ\n آيَةُ الرِّجْزِ ابْتَلَى اللَّهُ عَزَّ وَجَلَّ بِهِ نَاسًا مِنْ عِبَادِهِ فَإِذَا سَمِعْتُمْ بِهِ فَلاَ تَدْخُلُوا عَلَيْهِ وَإِذَا\n وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلاَ تَفِرُّوا مِنْهُ ‏\"‏ ‏.‏ هَذَا حَدِيثُ الْقَعْنَبِيِّ وَقُتَيْبَةَ نَحْوَهُ ‏.‏",
    "malay_translation": "Wabak itu adalah satu tanda bala bencana yang Allah SWT uji ke atas sebahagian hamba-Nya.  Oleh itu, apabila kamu mendengar tentangnya, janganlah kamu memasukinya (tempat yang ditimpa wabak itu), dan jika ia telah berlaku di sesuatu tempat dan kamu berada di situ, maka janganlah kamu lari darinya."
  },
  {
    "id": 12902,
    "hadith_number": 5625,
    "tajuk_hadith": "Wabak Penyakit: Jangan Lari Daripadanya atau Masuk Ke Dalamnya",
    "perawi_melayu": "Usama meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Plague is a calamity which was inflicted on those who were before you, or upon Bani Isra'il. So when it has broken out in a land, don't run out of it, and when it has spread in a land, then don't enter it.",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ،\n عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ أُسَامَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ هَذَا الطَّاعُونَ\n رِجْزٌ سُلِّطَ عَلَى مَنْ كَانَ قَبْلَكُمْ أَوْ عَلَى بَنِي إِسْرَائِيلَ فَإِذَا كَانَ بِأَرْضٍ فَلاَ تَخْرُجُوا مِنْهَا\n فِرَارًا مِنْهُ وَإِذَا كَانَ بِأَرْضٍ فَلاَ تَدْخُلُوهَا ‏\"‏ ‏.‏",
    "malay_translation": "Sesungguhnya wabak penyakit ini adalah satu bala bencana yang ditimpakan ke atas umat sebelum kamu atau ke atas Bani Israel.  Oleh itu, jika ia berlaku di sesuatu tempat, janganlah kamu lari meninggalkannya, dan jika ia berlaku di sesuatu tempat, maka janganlah kamu memasukinya."
  },
  {
    "id": 12903,
    "hadith_number": 5626,
    "tajuk_hadith": "Wabak Taun: Tinggal atau Meninggalkan?",
    "perawi_melayu": "Amir bin Sa'd meriwayatkan bahawa seorang lelaki bertanya kepada Sa'd bin Abi Waqqas tentang wabak taun, lalu Usamah bin Zaid berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَمْرُو،\n بْنُ دِينَارٍ أَنَّ عَامِرَ بْنَ سَعْدٍ، أَخْبَرَهُ أَنَّ رَجُلاً سَأَلَ سَعْدَ بْنَ أَبِي وَقَّاصٍ عَنِ الطَّاعُونِ،\n فَقَالَ أُسَامَةُ بْنُ زَيْدٍ أَنَا أُخْبِرُكَ عَنْهُ، قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ هُوَ عَذَابٌ\n أَوْ رِجْزٌ أَرْسَلَهُ اللَّهُ عَلَى طَائِفَةٍ مِنْ بَنِي إِسْرَائِيلَ أَوْ نَاسٍ كَانُوا قَبْلَكُمْ فَإِذَا سَمِعْتُمْ بِهِ\n بِأَرْضٍ فَلاَ تَدْخُلُوهَا عَلَيْهِ وَإِذَا دَخَلَهَا عَلَيْكُمْ فَلاَ تَخْرُجُوا مِنْهَا فِرَارًا ‏\"‏ ‏.‏",
    "malay_translation": "Amir bin Sa'd meriwayatkan bahawa seorang lelaki bertanya kepada Sa'd bin Abi Waqqas tentang wabak taun.  Usamah bin Zaid menjawab,  Rasulullah SAW bersabda:  \"Ia adalah azab atau bala yang Allah SWT kirimkan ke atas segolongan Bani Israil atau manusia sebelum kamu.  Maka jika kamu mendengar tentangnya di suatu tempat, janganlah kamu memasukinya, dan jika ia telah merebak di tempat kamu, janganlah kamu melarikan diri darinya.\""
  },
  {
    "id": 12904,
    "hadith_number": 5627,
    "tajuk_hadith": "Periwayat Hadis daripada Ibnu Juraij",
    "perawi_melayu": "Abu Ar-Rabi', Sulaiman bin Dawud dan Qutaibah bin Sa'id meriwayatkan daripada Hammad bin Zaid, dan Abu Bakar bin Abi Syaibah meriwayatkan daripada Sufyan bin Uyainah. Kedua-duanya meriwayatkan daripada Amr bin Dinar melalui sanad Ibnu Juraij.",
    "english_text": "This hadith has been narrated on the authority of Ibn Juraij through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَا أَبُو الرَّبِيعِ، سُلَيْمَانُ بْنُ دَاوُدَ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالاَ حَدَّثَنَا حَمَّادٌ، وَهُوَ\n ابْنُ زَيْدٍ ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، كِلاَهُمَا عَنْ عَمْرِو بْنِ،\n دِينَارٍ بِإِسْنَادِ ابْنِ جُرَيْجٍ نَحْوَ حَدِيثِهِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan melalui beberapa sanad daripada Ibnu Juraij.  Abu Ar-Rabi', Sulaiman bin Dawud dan Qutaibah bin Sa'id berkata: Hammad bin Zaid meriwayatkan kepada kami.  Begitu juga Abu Bakar bin Abi Syaibah meriwayatkan daripada Sufyan bin Uyainah.  Kedua-duanya meriwayatkan daripada Amr bin Dinar melalui sanad Ibnu Juraij, lebih kurang seperti hadisnya."
  },
  {
    "id": 12905,
    "hadith_number": 5628,
    "tajuk_hadith": "Wabak Penyakit dan Nasihat Nabi",
    "perawi_melayu": "Usamah bin Zaid meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرٍو وَحَرْمَلَةُ بْنُ يَحْيَى قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ،\n أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عَامِرُ بْنُ سَعْدٍ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، عَنْ رَسُولِ\n اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ إِنَّ هَذَا الْوَجَعَ أَوِ السَّقَمَ رِجْزٌ عُذِّبَ بِهِ بَعْضُ الأُمَمِ\n قَبْلَكُمْ ثُمَّ بَقِيَ بَعْدُ بِالأَرْضِ فَيَذْهَبُ الْمَرَّةَ وَيَأْتِي الأُخْرَى فَمَنْ سَمِعَ بِهِ بِأَرْضٍ فَلاَ يَقْدَمَنَّ\n عَلَيْهِ وَمَنْ وَقَعَ بِأَرْضٍ وَهُوَ بِهَا فَلاَ يُخْرِجَنَّهُ الْفِرَارُ مِنْهُ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Abu Thahir, Ahmad bin Amru dan Harmalah bin Yahya berkata:  Mereka berdua memberitahu kami daripada Ibn Wahb, yang memberitahu kami daripada Yunus, daripada Ibn Syihab, yang memberitahu kami daripada Amir bin Saad, daripada Usamah bin Zaid, daripada Rasulullah SAW bahawa baginda bersabda:  \"Sesungguhnya penyakit atau wabak ini adalah satu azab yang mana sebahagian daripada umat sebelum kamu telah di azab dengannya, kemudian ia kekal di atas muka bumi.  Ia akan hilang sekali dan akan datang lagi. Maka sesiapa yang mendengar tentang kewujudannya di sesuatu tempat, maka janganlah dia mendatanginya, dan sesiapa yang berada di sesuatu tempat di mana ia telah meletus, maka janganlah dia lari meninggalkannya.\""
  },
  {
    "id": 12906,
    "hadith_number": 5629,
    "tajuk_hadith": "Hadis Dari Zuhri dengan Sanad Berbeza",
    "perawi_melayu": "Abu Kamil al-Jahdari, melalui Abdul Wahid (Ibn Ziyad), melalui Ma'mar, daripada Zuhri, dengan sanad Yunus, hampir sama dengan hadisnya.",
    "english_text": "This hadith has been narrated on the authority of Zuhri with a different chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَاهُ أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، - يَعْنِي ابْنَ زِيَادٍ - حَدَّثَنَا \n مَعْمَرٌ، عَنِ الزُّهْرِيِّ، بِإِسْنَادِ يُونُسَ نَحْوَ حَدِيثِهِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Zuhri dengan sanad (rantaian periwayat) yang berbeza."
  },
  {
    "id": 12907,
    "hadith_number": 5630,
    "tajuk_hadith": "Larangan Meninggalkan atau Memasuki Kawasan Wabak",
    "perawi_melayu": "Syu'bah meriwayatkan daripada Habib:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ حَبِيبٍ، قَالَ كُنَّا بِالْمَدِينَةِ\n فَبَلَغَنِي أَنَّ الطَّاعُونَ قَدْ وَقَعَ بِالْكُوفَةِ فَقَالَ لِي عَطَاءُ بْنُ يَسَارٍ وَغَيْرُهُ إِنَّ رَسُولَ اللَّهِ\n صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا كُنْتَ بِأَرْضٍ فَوَقَعَ بِهَا فَلاَ تَخْرُجْ مِنْهَا وَإِذَا بَلَغَكَ أَنَّهُ\n بِأَرْضٍ فَلاَ تَدْخُلْهَا ‏\"‏ ‏.‏ قَالَ قُلْتُ عَمَّنْ قَالُوا عَنْ عَامِرِ بْنِ سَعْدٍ يُحَدِّثُ بِهِ ‏.‏ قَالَ فَأَتَيْتُهُ\n فَقَالُوا غَائِبٌ - قَالَ - فَلَقِيتُ أَخَاهُ إِبْرَاهِيمَ بْنَ سَعْدٍ فَسَأَلْتُهُ فَقَالَ شَهِدْتُ أُسَامَةَ يُحَدِّثُ\n سَعْدًا قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِنَّ هَذَا الْوَجَعَ رِجْزٌ أَوْ عَذَابٌ\n أَوْ بَقِيَّةُ عَذَابٍ عُذِّبَ بِهِ أُنَاسٌ مِنْ قَبْلِكُمْ فَإِذَا كَانَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلاَ تَخْرُجُوا مِنْهَا\n وَإِذَا بَلَغَكُمْ أَنَّهُ بِأَرْضٍ فَلاَ تَدْخُلُوهَا ‏\"‏ ‏.‏ قَالَ حَبِيبٌ فَقُلْتُ لإِبْرَاهِيمَ آنْتَ سَمِعْتَ أُسَامَةَ\n يُحَدِّثُ سَعْدًا وَهُوَ لاَ يُنْكِرُ قَالَ نَعَمْ ‏.‏",
    "malay_translation": "Kami berada di Madinah, kemudian sampai kepadaku berita bahawa wabak taun telah melanda Kufah.  Lalu Ata’ bin Yasar dan yang lain memberitahu aku bahawa Rasulullah SAW bersabda:  \"Jika kamu berada di suatu tempat yang ditimpa wabak, maka janganlah kamu keluar dari tempat itu. Dan jika kamu mendapat khabar bahawa wabak itu telah melanda suatu tempat, maka janganlah kamu memasukinya.\" Aku bertanya, \"Daripada siapa (kamu mendengarnya)?\" Mereka menjawab,  \"Daripada Amir bin Sa’d.\" Maka aku pergi menemuinya, tetapi dikatakan bahawa dia tidak berada di situ. Kemudian aku bertemu dengan saudaranya, Ibrahim bin Sa’d, lalu aku bertanya kepadanya. Dia berkata,  \"Aku menyaksikan Usamah meriwayatkan kepada Sa’d bahawa dia mendengar Rasulullah SAW bersabda:  \"Sesungguhnya penyakit ini adalah azab, atau bala, atau baki daripada azab yang menimpa umat sebelum kamu.  Maka jika wabak itu berada di suatu tempat dan kamu berada di situ, janganlah kamu keluar dari tempat itu. Dan jika kamu mendapat khabar bahawa wabak itu telah melanda suatu tempat, maka janganlah kamu memasukinya.\"  Habib berkata: Aku bertanya kepada Ibrahim, \"Adakah kamu mendengar Usamah meriwayatkan kepada Sa’d, dan dia tidak menafikannya?\" Dia menjawab,  \"Ya.\""
  },
  {
    "id": 12908,
    "hadith_number": 5631,
    "tajuk_hadith": "Perbezaan Sanad Hadis",
    "perawi_melayu": "Syu'bah",
    "english_text": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters except for the fact that no mention has been made of the account of 'Ata b. Yasir as in the previous hadith.",
    "arabic_text": "وَحَدَّثَنَاهُ عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّهُ لَمْ\n يَذْكُرْ قِصَّةَ عَطَاءِ بْنِ يَسَارٍ فِي أَوَّلِ الْحَدِيثِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan melalui sanad yang sama daripada Syu'bah, kecuali tidak menyebut kisah 'Ata' bin Yasar sepertimana hadis sebelumnya."
  },
  {
    "id": 12909,
    "hadith_number": 5632,
    "tajuk_hadith": "Riwayat Saad, Khuzaimah dan Usamah",
    "perawi_melayu": "Abu Bakar bin Abi Syaibah, dari Wakie', dari Sufyan, dari Habib, dari Ibrahim bin Saad, dari Saad bin Malik, Khuzaimah bin Thabit, dan Usamah bin Zaid.",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ حَبِيبٍ، عَنْ إِبْرَاهِيمَ،\n بْنِ سَعْدٍ عَنْ سَعْدِ بْنِ مَالِكٍ، وَخُزَيْمَةَ بْنِ ثَابِتٍ، وَأُسَامَةَ بْنِ زَيْدٍ، قَالُوا قَالَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم بِمَعْنَى حَدِيثِ شُعْبَةَ ‏.‏",
    "malay_translation": "Kami telah diberitakan oleh Abu Bakar bin Abi Syaibah, yang telah meriwayatkan dari Wakie', dari Sufyan, dari Habib, dari Ibrahim bin Saad, dari Saad bin Malik, Khuzaimah bin Thabit, dan Usamah bin Zaid, mereka berkata bahawa Rasulullah SAW bersabda (maksudnya sama seperti hadis Syu'bah)."
  },
  {
    "id": 12910,
    "hadith_number": 5633,
    "tajuk_hadith": "Perbualan Usamah bin Zaid dan Saad",
    "perawi_melayu": "Ibrahim b. Sa'd b. Abu Waqqas meriwayatkan:",
    "english_text": "Usama b. Zaid and Sa'd had been sitting and they had been conversing and they said this hadith.",
    "arabic_text": "وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، كِلاَهُمَا عَنْ جَرِيرٍ، عَنِ الأَعْمَشِ،\n عَنْ حَبِيبٍ، عَنْ إِبْرَاهِيمَ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، قَالَ كَانَ أُسَامَةُ بْنُ زَيْدٍ وَسَعْدٌ جَالِسَيْنِ\n يَتَحَدَّثَانِ فَقَالاَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِنَحْوِ حَدِيثِهِمْ ‏.‏",
    "malay_translation": "Usamah bin Zaid dan Saad sedang duduk berbual-bual, lalu mereka menyebut hadis ini.  Mereka berkata, Rasulullah SAW telah bersabda (lebih kurang) seperti perbualan mereka."
  },
  {
    "id": 12911,
    "hadith_number": 5634,
    "tajuk_hadith": "Sanad Hadith daripada Ibrahim bin Saad bin Malik",
    "perawi_melayu": "Wahb bin Baqiyyah meriwayatkan daripada Khalid (yang dimaksudkan ialah Khalid al-Tahhan), daripada al-Syaibani, daripada Habib bin Abi Thabit, daripada Ibrahim bin Saad bin Malik, daripada bapanya, daripada Nabi SAW.",
    "english_text": "This hadith has been transmitted by Ibrahim b. Sa'd b. Malik on the authority of his father.",
    "arabic_text": "وَحَدَّثَنِيهِ وَهْبُ بْنُ بَقِيَّةَ، أَخْبَرَنَا خَالِدٌ، - يَعْنِي الطَّحَّانَ - عَنِ الشَّيْبَانِيِّ، عَنْ حَبِيبِ،\n بْنِ أَبِي ثَابِتٍ عَنْ إِبْرَاهِيمَ بْنِ سَعْدِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏\n بِنَحْوِ حَدِيثِهِمْ ‏.‏",
    "malay_translation": "Hadith ini diriwayatkan oleh Wahb bin Baqiyyah daripada Khalid (iaitu Khalid al-Tahhan), daripada al-Syaibani, daripada Habib bin Abi Thabit, daripada Ibrahim bin Saad bin Malik daripada bapanya, daripada Nabi SAW.  Dengan jalan periwayatan yang sama seperti mereka."
  },
  {
    "id": 12912,
    "hadith_number": 5635,
    "tajuk_hadith": "Umar bin al-Khattab dan Wabak di Syria",
    "perawi_melayu": "'Abdullah bin 'Abbas meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ،\n الْحَمِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ زَيْدِ بْنِ الْخَطَّابِ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ،\n عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، خَرَجَ إِلَى الشَّامِ حَتَّى إِذَا كَانَ بِسَرْغَ لَقِيَهُ\n أَهْلُ الأَجْنَادِ أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ وَأَصْحَابُهُ فَأَخْبَرُوهُ أَنَّ الْوَبَاءَ قَدْ وَقَعَ بِالشَّامِ ‏.‏ قَالَ\n ابْنُ عَبَّاسٍ فَقَالَ عُمَرُ ادْعُ لِيَ الْمُهَاجِرِينَ الأَوَّلِينَ ‏.‏ فَدَعَوْتُهُمْ فَاسْتَشَارَهُمْ وَأَخْبَرَهُمْ\n أَنَّ الْوَبَاءَ قَدْ وَقَعَ بِالشَّامِ فَاخْتَلَفُوا فَقَالَ بَعْضُهُمْ قَدْ خَرَجْتَ لأَمْرٍ وَلاَ نَرَى أَنْ تَرْجِعَ\n عَنْهُ ‏.‏ وَقَالَ بَعْضُهُمْ مَعَكَ بَقِيَّةُ النَّاسِ وَأَصْحَابُ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلاَ نَرَى\n أَنْ تُقْدِمَهُمْ عَلَى هَذَا الْوَبَاءِ ‏.‏ فَقَالَ ارْتَفِعُوا عَنِّي ‏.‏ ثُمَّ قَالَ ادْعُ لِيَ الأَنْصَارَ فَدَعَوْتُهُمْ لَهُ\n فَاسْتَشَارَهُمْ فَسَلَكُوا سَبِيلَ الْمُهَاجِرِينَ وَاخْتَلَفُوا كَاخْتِلاَفِهِمْ ‏.‏ فَقَالَ ارْتَفِعُوا عَنِّي ‏.‏ ثُمَّ\n قَالَ ادْعُ لِي مَنْ كَانَ هَا هُنَا مِنْ مَشْيَخَةِ قُرَيْشٍ مِنْ مُهَاجِرَةِ الْفَتْحِ ‏.‏ فَدَعَوْتُهُمْ فَلَمْ يَخْتَلِفْ\n عَلَيْهِ رَجُلاَنِ فَقَالُوا نَرَى أَنْ تَرْجِعَ بِالنَّاسِ وَلاَ تُقْدِمْهُمْ عَلَى هَذَا الْوَبَاءِ ‏.‏ فَنَادَى عُمَرُ\n فِي النَّاسِ إِنِّي مُصْبِحٌ عَلَى ظَهْرٍ فَأَصْبِحُوا عَلَيْهِ ‏.‏ فَقَالَ أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ أَفِرَارًا\n مِنْ قَدَرِ اللَّهِ فَقَالَ عُمَرُ لَوْ غَيْرُكَ قَالَهَا يَا أَبَا عُبَيْدَةَ - وَكَانَ عُمَرُ يَكْرَهُ خِلاَفَهُ - نَعَمْ\n نَفِرُّ مِنْ قَدَرِ اللَّهِ إِلَى قَدَرِ اللَّهِ أَرَأَيْتَ لَوْ كَانَتْ لَكَ إِبِلٌ فَهَبَطْتَ وَادِيًا لَهُ عِدْوَتَانِ إِحْدَاهُمَا\n خَصْبَةٌ وَالأُخْرَى جَدْبَةٌ أَلَيْسَ إِنْ رَعَيْتَ الْخَصْبَةَ رَعَيْتَهَا بِقَدَرِ اللَّهِ وَإِنْ رَعَيْتَ الْجَدْبَةَ رَعَيْتَهَا\n بِقَدَرِ اللَّهِ قَالَ فَجَاءَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ وَكَانَ مُتَغَيِّبًا فِي بَعْضِ حَاجَتِهِ فَقَالَ إِنَّ عِنْدِي\n مِنْ هَذَا عِلْمًا سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِذَا سَمِعْتُمْ بِهِ بِأَرْضٍ فَلاَ\n تَقْدَمُوا عَلَيْهِ وَإِذَا وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلاَ تَخْرُجُوا فِرَارًا مِنْهُ ‏\"‏ ‏.‏ قَالَ فَحَمِدَ اللَّهَ عُمَرُ\n بْنُ الْخَطَّابِ ثُمَّ انْصَرَفَ ‏.‏",
    "malay_translation": "Daripada Yahya bin Yahya al-Tamimi, katanya: Aku telah membaca daripada Malik daripada Ibn Syihab, daripada Abdul Hamid bin Abdur Rahman bin Zaid bin al-Khattab, daripada Abdullah bin Abdullah bin al-Harith bin Nawfal, daripada Abdullah bin Abbas, bahawa Umar bin al-Khattab telah keluar ke Syam. Sehinggalah apabila beliau berada di Sargh, beliau dijumpai oleh tentera pimpinan Abu Ubaidah bin al-Jarrah dan sahabat-sahabatnya. Mereka memaklumkan kepadanya bahawa wabak telah melanda Syam. Ibn Abbas berkata, Umar berkata: “Panggilkan bagiku kaum Muhajirin yang terawal.” Maka aku pun memanggil mereka. Maka beliau bermesyuarat dengan mereka dan memberitahu mereka bahawa wabak telah melanda Syam. Maka mereka berbeza pendapat. Sebahagian daripada mereka berkata: “Engkau telah keluar untuk suatu urusan, dan kami tidak nampak patut untuk engkau kembali.” Dan sebahagian daripada mereka berkata: “Bersamamu ada baki umat manusia dan sahabat-sahabat Rasulullah SAW, dan kami tidak nampak patut untuk engkau mendedahkan mereka kepada wabak ini.” Maka Umar berkata: “Tinggalkan aku.” Kemudian beliau berkata: “Panggilkan bagiku kaum Ansar.” Maka aku pun memanggil mereka kepadanya. Beliau bermesyuarat dengan mereka, lalu mereka mengambil jalan yang sama seperti Muhajirin, dan mereka berbeza pendapat seperti perbezaan mereka. Maka Umar berkata: “Tinggalkan aku.” Kemudian beliau berkata: “Panggilkan bagiku sesiapa yang ada di sini daripada golongan tua Quraisy yang berhijrah sebelum Fath (penaklukan Mekah).” Maka aku pun memanggil mereka. Tiada dua orang pun berbeza pendapat, mereka berkata: “Pendapat kami ialah engkau lebih baik kembali bersama rakyat dan janganlah engkau mendedahkan mereka kepada wabak ini.” Maka Umar mengumumkan kepada rakyat: “Esok aku akan berada di atas kenderaan.” Maka esoknya mereka pun berangkat. Abu Ubaidah bin al-Jarrah berkata: “Apakah ini lari daripada takdir Allah?” Maka Umar berkata: “Sekiranya bukan engkau yang berkata demikian, ya Abu Ubaidah.” – Umar membenci perbezaan pendapatnya – “Ya, kami lari daripada takdir Allah kepada takdir Allah. Bagaimana jika engkau mempunyai unta dan engkau tiba di lembah yang mempunyai dua bahagian, satu subur dan satu lagi tandus, bukankah jika engkau menggembalakan di kawasan subur, engkau melakukannya dengan takdir Allah, dan jika engkau menggembalakan di kawasan tandus, engkau juga melakukannya dengan takdir Allah?”  Kemudian datang Abdur Rahman bin Auf, dan dia telah tidak berada di tempat kerana beberapa keperluan. Dia berkata: “Aku ada pengetahuan tentang ini, aku telah mendengar Rasulullah SAW bersabda:  “Jika kamu mendengar tentangnya di sesuatu tempat, janganlah kamu pergi ke situ, dan jika ia telah berlaku di tempat kamu berada, janganlah kamu lari darinya.”  Maka Umar bin al-Khattab memuji Allah SWT, kemudian dia pun kembali."
  },
  {
    "id": 12913,
    "hadith_number": 5636,
    "tajuk_hadith": "Hikmah Pemilihan Madinah",
    "perawi_melayu": "Hadis ini diriwayatkan melalui jalur periwayat yang sama dengan tambahan daripada Ma'mar:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ ابْنُ رَافِعٍ\n حَدَّثَنَا وَقَالَ الآخَرَانِ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، بِهَذَا الإِسْنَادِ ‏.‏ نَحْوَ حَدِيثِ مَالِكٍ\n وَزَادَ فِي حَدِيثِ مَعْمَرٍ قَالَ وَقَالَ لَهُ أَيْضًا أَرَأَيْتَ أَنَّهُ لَوْ رَعَى الْجَدْبَةَ وَتَرَكَ الْخَصْبَةَ أَكُنْتَ\n مُعَجِّزَهُ قَالَ نَعَمْ ‏.‏ قَالَ فَسِرْ إِذًا ‏.‏ قَالَ فَسَارَ حَتَّى أَتَى الْمَدِينَةَ فَقَالَ هَذَا الْمَحِلُّ ‏.‏ أَوْ\n قَالَ هَذَا الْمَنْزِلُ إِنْ شَاءَ اللَّهُ ‏.‏",
    "malay_translation": "Dan telah menceritakan kepada kami Ishak bin Ibrahim, Muhammad bin Rafi', dan Abd bin Humaid. Ibn Rafi' berkata: Telah menceritakan kepada kami (dan dua orang yang lain berkata): Telah memberitakan kepada kami Abdur Razzaq, telah memberitakan kepada kami Ma'mar, dengan sanad ini.  Sehampirnya dengan hadis Malik.\nDan tambahan dalam hadis Ma'mar, beliau berkata: Dan beliau juga bertanya kepadanya: Bagaimana pendapatmu sekiranya seseorang menggembala di tanah tandus dan meninggalkan tanah subur, adakah engkau akan mencela perbuatannya? Dia berkata: Ya. Beliau berkata: Maka pergilah.  Maka dia pun berjalan sehingga sampai ke Madinah, lalu dia berkata: Inilah tempatnya. Atau dia berkata: Inilah tempat tinggal jika Allah menghendaki."
  },
  {
    "id": 12914,
    "hadith_number": 5637,
    "tajuk_hadith": "Riwayat Abdullah bin Harith dengan sedikit perbezaan lafaz",
    "perawi_melayu": "Abdullah bin Harith",
    "english_text": "This hadith has been transmitted on the authority of 'Abdullah b. Harith with a slight variation of wording.",
    "arabic_text": "وَحَدَّثَنِيهِ أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ،\n عَنِ ابْنِ شِهَابٍ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّهُ قَالَ إِنَّ عَبْدَ اللَّهِ بْنَ الْحَارِثِ حَدَّثَهُ ‏.‏ وَلَمْ يَقُلْ عَبْدِ\n اللَّهِ بْنِ عَبْدِ اللَّهِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Abdullah bin Harith dengan sedikit perbezaan dari segi lafaz.  Abu Thahir dan Harmalah bin Yahya berkata:  Ibn Wahb memberitahu kami, Yunus memberitahu saya daripada Ibn Syihab melalui sanad ini, kecuali bahawa beliau berkata bahawa Abdullah bin Harith telah meriwayatkan kepadanya, dan tidak menyebut Abdullah bin Abdullah."
  },
  {
    "id": 12915,
    "hadith_number": 5638,
    "tajuk_hadith": "Larangan Meninggalkan Tempat Wabak",
    "perawi_melayu": "'Amir bin Rabi'ah meriwayatkan:",
    "english_text": "'Umar went to Syria and as he came to Sargh, information was given to him that an epidemic had broken out in Syria. 'Abd al-Rahman b. 'Auf narrated to him that Allah's Messenger (ﷺ) had said: When you hear of its presence in a land, don't move towards it, and when it breaks out in a land and you are therein, then don't run away from it. So 'Umar b. Khattab came back from Sargh. Salim b. 'Abdullah reported that 'Umar went back, along with people on hearing the hadith reported on the authority of 'Abd al-Rahman b. 'Auf.",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ اللَّهِ بْنِ،\n عَامِرِ بْنِ رَبِيعَةَ أَنَّ عُمَرَ، خَرَجَ إِلَى الشَّامِ فَلَمَّا جَاءَ سَرْغَ بَلَغَهُ أَنَّ الْوَبَاءَ قَدْ وَقَعَ بِالشَّامِ\n ‏.‏ فَأَخْبَرَهُ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا سَمِعْتُمْ\n بِهِ بِأَرْضٍ فَلاَ تَقْدَمُوا عَلَيْهِ ‏.‏ وَإِذَا وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلاَ تَخْرُجُوا فِرَارًا مِنْهُ ‏\"‏ ‏.‏ فَرَجَعَ\n عُمَرُ بْنُ الْخَطَّابِ مِنْ سَرْغَ ‏.‏ وَعَنِ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ أَنَّ عُمَرَ إِنَّمَا انْصَرَفَ\n بِالنَّاسِ مِنْ حَدِيثِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ ‏.‏",
    "malay_translation": "Umar pergi ke Syria.  Semasa beliau sampai di Sargh, baginda dimaklumkan bahawa wabak telah merebak di Syria. Abd al-Rahman bin Auf meriwayatkan kepada beliau bahawa Rasulullah SAW telah bersabda:  \"Apabila kamu mendengar tentang kewujudannya di suatu tempat, janganlah kamu pergi ke situ. Dan apabila ia telah merebak di suatu tempat dan kamu berada di situ, maka janganlah kamu melarikan diri daripadanya.\"  Maka Umar bin Khattab kembali dari Sargh. Salim bin Abdullah meriwayatkan bahawa Umar kembali bersama-sama dengan orang ramai setelah mendengar hadis yang diriwayatkan berdasarkan keterangan Abd al-Rahman bin Auf."
  },
  {
    "id": 12916,
    "hadith_number": 5639,
    "tajuk_hadith": "Tiada Penyakit Berjangkit, Safar, atau Hama",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، - وَاللَّفْظُ لأَبِي الطَّاهِرِ - قَالاَ أَخْبَرَنَا \n ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، قَالَ ابْنُ شِهَابٍ فَحَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي،\n هُرَيْرَةَ حِينَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ عَدْوَى وَلاَ صَفَرَ وَلاَ هَامَةَ ‏\"‏ ‏.‏ فَقَالَ\n أَعْرَابِيٌّ يَا رَسُولَ اللَّهِ فَمَا بَالُ الإِبِلِ تَكُونُ فِي الرَّمْلِ كَأَنَّهَا الظِّبَاءُ فَيَجِيءُ الْبَعِيرُ الأَجْرَبُ\n فَيَدْخُلُ فِيهَا فَيُجْرِبُهَا كُلَّهَا قَالَ ‏\"‏ فَمَنْ أَعْدَى الأَوَّلَ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:  \"Tiada penyakit berjangkit, tiada penyakit safar, dan tiada hama.\"  Seorang Badwi berkata, \"Wahai Rasulullah, bagaimanakah keadaan unta-unta yang berada di padang pasir seperti kijang, kemudian datanglah unta yang berpenyakit kurap lalu bercampur dengannya, lalu semuanya dijangkiti penyakit itu?\" Baginda SAW bersabda, \"Maka siapakah yang menjangkiti yang pertama?\" "
  },
  {
    "id": 12917,
    "hadith_number": 5640,
    "tajuk_hadith": "Tiada Penyakit Berjangkit, Tiada Petanda Buruk, Tiada Safar, Tiada Hama",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There is no transitive disease, no evil omen, no safar, no hama. A desert Arab said: Allah's, Messenger.... The rest of the hadith is the same.",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، وَحَسَنٌ الْحُلْوَانِيُّ، قَالاَ حَدَّثَنَا يَعْقُوبُ، - وَهُوَ ابْنُ إِبْرَاهِيمَ\n بْنِ سَعْدٍ - حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، وَغَيْرُهُ،\n أَنَّ أَبَا هُرَيْرَةَ، قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ عَدْوَى وَلاَ طِيَرَةَ وَلاَ\n صَفَرَ وَلاَ هَامَةَ ‏\"‏ ‏.‏ فَقَالَ أَعْرَابِيٌّ يَا رَسُولَ اللَّهِ ‏.‏ بِمِثْلِ حَدِيثِ يُونُسَ ‏.‏",
    "malay_translation": "Tiada penyakit berjangkit, tiada petanda buruk, tiada pengaruh perjalanan (safar), dan tiada hama. Seorang Arab Badwi berkata: Wahai Rasulullah… (selebihnya hadis sama)."
  },
  {
    "id": 12918,
    "hadith_number": 5641,
    "tajuk_hadith": "Tiada Penyakit Berjangkit",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There is no trahsitive disease. Thereupon a desert Arab stood up. The rest of the hadith is the same and in the hadith transmitted on the authority of Zuhri' the Prophet (ﷺ) is reported to have said: There is no transitive disease, no safar, no hama.",
    "arabic_text": "وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا أَبُو الْيَمَانِ، عَنْ شُعَيْبٍ، عَنِ \n الزُّهْرِيِّ، أَخْبَرَنِي سِنَانُ بْنُ أَبِي سِنَانٍ الدُّؤَلِيُّ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه\n وسلم ‏\"‏ لاَ عَدْوَى ‏\"‏ ‏.‏ فَقَامَ أَعْرَابِيٌّ ‏.‏ فَذَكَرَ بِمِثْلِ حَدِيثِ يُونُسَ وَصَالِحٍ ‏.‏ وَعَنْ شُعَيْبٍ\n عَنِ الزُّهْرِيِّ قَالَ حَدَّثَنِي السَّائِبُ بْنُ يَزِيدَ ابْنُ أُخْتِ نَمِرٍ أَنَّ النَّبِيَّ صلى الله عليه وسلم\n قَالَ ‏\"‏ لاَ عَدْوَى وَلاَ صَفَرَ وَلاَ هَامَةَ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Abdullah bin Abdurrahman Ad-Darimi, telah memberitakan kepada kami Abu Al-Yaman, dari Syu’aib, dari Az- Zuhri, telah memberitakan kepadaku Sinan bin Abi Sinan Ad-Du’ali, bahawa Abu Hurairah berkata, bahawa Nabi SAW bersabda:  \"Tiada penyakit berjangkit.\"  Lalu seorang Arab Badwi bangun.  Kemudian dia menyebut seperti hadis Yunus dan Shaleh.  Dan dari Syu’aib, dari Az-Zuhri berkata, telah menceritakan kepadaku As-Sa’ib bin Yazid bin saudara perempuan Namir bahawa Nabi SAW bersabda:  \"Tiada penyakit berjangkit, tiada penyakit kuning, dan tiada wabah.\" "
  },
  {
    "id": 12919,
    "hadith_number": 5642,
    "tajuk_hadith": "Penyakit Berjangkit dan Pencegahannya",
    "perawi_melayu": "Abu Salama bin Abdur Rahman bin Auf meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، - وَتَقَارَبَا فِي اللَّفْظِ - قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ،\n أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، حَدَّثَهُ أَنَّ رَسُولَ\n اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ عَدْوَى ‏\"‏ ‏.‏ وَيُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم\n قَالَ ‏\"‏ لاَ يُورِدُ مُمْرِضٌ عَلَى مُصِحٍّ ‏\"‏ ‏.‏ \n قَالَ أَبُو سَلَمَةَ كَانَ أَبُو هُرَيْرَةَ يُحَدِّثُهُمَا كِلْتَيْهِمَا عَنْ رَسُولِ اللَّهِ صلى الله عليه\n وسلم ثُمَّ صَمَتَ أَبُو هُرَيْرَةَ بَعْدَ ذَلِكَ عَنْ قَوْلِهِ ‏\"‏ لاَ عَدْوَى ‏\"‏ ‏.‏ وَأَقَامَ عَلَى ‏\"‏ أَنْ لاَ يُورِدُ\n مُمْرِضٌ عَلَى مُصِحٍّ ‏\"‏ ‏.‏ قَالَ فَقَالَ الْحَارِثُ بْنُ أَبِي ذُبَابٍ - وَهُوَ ابْنُ عَمِّ أَبِي هُرَيْرَةَ -\n قَدْ كُنْتُ أَسْمَعُكَ يَا أَبَا هُرَيْرَةَ تُحَدِّثَنَا مَعَ هَذَا الْحَدِيثِ حَدِيثًا آخَرَ قَدْ سَكَتَّ عَنْهُ كُنْتَ\n تَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ عَدْوَى ‏\"‏ ‏.‏ فَأَبَى أَبُو هُرَيْرَةَ أَنْ يَعْرِفَ\n ذَلِكَ وَقَالَ ‏\"‏ لاَ يُورِدُ مُمْرِضٌ عَلَى مُصِحٍّ ‏\"‏ ‏.‏ فَمَا رَآهُ الْحَارِثُ فِي ذَلِكَ حَتَّى غَضِبَ أَبُو\n هُرَيْرَةَ فَرَطَنَ بِالْحَبَشِيَّةِ فَقَالَ لِلْحَارِثِ أَتَدْرِي مَاذَا قُلْتُ قَالَ لاَ ‏.‏ قَالَ أَبُو هُرَيْرَةَ ‏.‏ قُلْتُ\n أَبَيْتُ ‏.‏ قَالَ أَبُو سَلَمَةَ وَلَعَمْرِي لَقَدْ كَانَ أَبُو هُرَيْرَةَ يُحَدِّثُنَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه\n وسلم قَالَ ‏\"‏ لاَ عَدْوَى ‏\"‏ ‏.‏ فَلاَ أَدْرِي أَنَسِيَ أَبُو هُرَيْرَةَ أَوْ نَسَخَ أَحَدُ الْقَوْلَيْنِ الآخَرَ",
    "malay_translation": "Abu Salama bin Abdur Rahman bin Auf meriwayatkan bahawa Rasulullah SAW bersabda, \"Tiada penyakit berjangkit.\"  Dan Baginda SAW juga bersabda, \"Janganlah orang yang sakit dibawa kepada orang yang sihat.\"  Abu Salama berkata, Abu Hurairah meriwayatkan kedua-dua hadis ini daripada Rasulullah SAW. Kemudian, Abu Hurairah berhenti meriwayatkan hadis, \"Tiada penyakit berjangkit,\" tetapi beliau terus meriwayatkan hadis, \"Janganlah orang yang sakit dibawa kepada orang yang sihat.\"  Harith bin Abu Dhubab – iaitu sepupu Abu Hurairah – berkata, \"Wahai Abu Hurairah, aku pernah mendengar engkau meriwayatkan kedua-dua hadis ini, tetapi kini engkau diamkan hadis, ‘Tiada penyakit berjangkit.’ Engkau pernah berkata bahawa Rasulullah SAW bersabda, ‘Tiada penyakit berjangkit.’\"  Abu Hurairah enggan mengakuinya dan berkata, \"Janganlah orang yang sakit dibawa kepada orang yang sihat.\"  Harith tidak bersetuju dengannya sehingga Abu Hurairah marah dan berkata kepadanya dalam bahasa Habsyi.  Kemudian Abu Hurairah bertanya kepada Harith, \"Adakah engkau tahu apa yang aku katakan?\"  Harith menjawab, \"Tidak.\"  Abu Hurairah berkata, \"Aku menafikannya.\" Abu Salama berkata, \"Demi jiwaku, Abu Hurairah memang meriwayatkan bahawa Rasulullah SAW bersabda, ‘Tiada penyakit berjangkit.’ Aku tidak tahu sama ada Abu Hurairah telah lupa atau salah satu sabda tersebut telah dimansuhkan oleh yang lain."
  },
  {
    "id": 12920,
    "hadith_number": 5643,
    "tajuk_hadith": "Tiada Penyakit Berjangkit dan Larangan Membawa Orang Sakit kepada Orang Sihat",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There is no transitive disease and he also reported along with it: The ill should not be taken to the healthy.",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، وَحَسَنٌ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ عَبْدٌ حَدَّثَنِي وَقَالَ،\n الآخَرَانِ حَدَّثَنَا يَعْقُوبُ، - يَعْنُونَ ابْنَ إِبْرَاهِيمَ بْنِ سَعْدٍ - حَدَّثَنِي أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ،\n شِهَابٍ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى\n الله عليه وسلم قَالَ ‏\"‏ لاَ عَدْوَى ‏\"‏ ‏.‏ وَيُحَدِّثُ مَعَ ذَلِكَ ‏\"‏ لاَ يُورِدُ الْمُمْرِضُ عَلَى الْمُصِحِّ\n ‏\"‏ ‏.‏ بِمِثْلِ حَدِيثِ يُونُسَ ‏.‏",
    "malay_translation": "Tiada penyakit berjangkit.  Dan baginda juga meriwayatkan bersama-sama dengan itu: Orang yang sakit tidak boleh dibawa kepada orang yang sihat."
  },
  {
    "id": 12921,
    "hadith_number": 5644,
    "tajuk_hadith": "Sanad Hadis Zuhri",
    "perawi_melayu": "Abdullah bin Abdur Rahman Ad-Dariri melalui Abu Al-Yaman daripada Syu'aib daripada Zuhri",
    "english_text": "This hadith has been reported on the authority of Zuhri with the same chain of transmitters.",
    "arabic_text": "حَدَّثَنَاهُ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا أَبُو الْيَمَانِ، حَدَّثَنَا شُعَيْبٌ، عَنِ \n الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Zuhri dengan sanad yang hampir sama."
  },
  {
    "id": 12922,
    "hadith_number": 5645,
    "tajuk_hadith": "Tiada Penyakit Berjangkit, Huma, Nu'man, atau Safar",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There is no transitive disease, no huma, no star promising rain, no safar.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنُونَ ابْنَ\n جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ\n ‏\n\"‏ لاَ عَدْوَى وَلاَ هَامَةَ وَلاَ نَوْءَ وَلاَ صَفَرَ ‏\"‏ ‏.‏",
    "malay_translation": "Tidak ada penyakit berjangkit, tiada huma (burung yang dipercayai membawa tuah), tiada pengaruh bintang terhadap hujan, dan tiada pengaruh bulan Safar."
  },
  {
    "id": 12923,
    "hadith_number": 5646,
    "tajuk_hadith": "Tiada Penyakit Berjangkit, Tiada Ramalan Buruk, Tiada Hantu",
    "perawi_melayu": "Jabir meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There is no transitive disease, no ill omen, no ghoul.\n\n\nNote: The majority of scholars interpret this to mean that these things in and of themselves do not transmit or cause harm through supernatural or hidden means but that Allah is ultimately in control and any fearful superstition around these is false.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، ح \n وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ قَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ عَدْوَى وَلاَ طِيَرَةَ وَلاَ غُولَ ‏\"‏ ‏.‏",
    "malay_translation": "Tidak ada penyakit berjangkit, tidak ada ramalan buruk (tiba-tiba), dan tidak ada hantu.  Kebanyakan ulama mentafsirkan hadis ini bermaksud bahawa perkara-perkara ini sendiri tidak akan menjangkiti atau menyebabkan kemudaratan melalui cara-cara ghaib atau tersembunyi, tetapi Allah SWT sentiasa mengawal segalanya dan sebarang khurafat yang menakutkan tentang perkara ini adalah salah."
  },
  {
    "id": 12924,
    "hadith_number": 5647,
    "tajuk_hadith": "Tiada Penyakit Berjangkit, Ghul, atau Safar",
    "perawi_melayu": "Jabir meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There is no transitive disease, no ghoul, no safar.",
    "arabic_text": "وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ هَاشِمِ بْنِ حَيَّانَ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا يَزِيدُ، - وَهُوَ التُّسْتَرِيُّ\n - حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ عَدْوَى وَلاَ\n غُولَ وَلاَ صَفَرَ ‏\"‏ ‏.‏",
    "malay_translation": "Jabir meriwayatkan bahawa Rasulullah SAW bersabda:  \"Tiada penyakit berjangkit, tiada ghoul, dan tiada safar.\""
  },
  {
    "id": 12925,
    "hadith_number": 5648,
    "tajuk_hadith": "Tiada Penyakit Berjangkit, Safar, atau Ghul",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو\n الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ عَدْوَى\n وَلاَ صَفَرَ وَلاَ غُولَ ‏\"‏ ‏.‏ وَسَمِعْتُ أَبَا الزُّبَيْرِ يَذْكُرُ أَنَّ جَابِرًا فَسَّرَ لَهُمْ قَوْلَهُ ‏\"‏ وَلاَ صَفَرَ ‏\"‏\n ‏.‏ فَقَالَ أَبُو الزُّبَيْرِ الصَّفَرُ الْبَطْنُ ‏.‏ فَقِيلَ لِجَابِرٍ كَيْفَ قَالَ كَانَ يُقَالُ دَوَابُّ الْبَطْنِ ‏.‏ قَالَ وَلَمْ\n يُفَسِّرِ الْغُولَ ‏.‏ قَالَ أَبُو الزُّبَيْرِ هَذِهِ الْغُولُ الَّتِي تَغَوَّلُ ‏.‏",
    "malay_translation": "Muhammad bin Hatim telah meriwayatkan daripada Ruh bin Ubadah, yang meriwayatkan daripada Ibnu Juraij, yang diberitahu oleh Abu Zubair bahawa dia mendengar Jabir bin Abdullah berkata: Aku mendengar Nabi SAW bersabda:  \"Tiada penyakit berjangkit, tiada safar, dan tiada ghoul.\" Dan aku mendengar Abu Zubair menyebut bahawa Jabir telah menerangkan kepada mereka maksud sabda baginda  \"Tiada safar.\" Abu Zubair berkata: Safar itu ialah perut.  Lalu ditanya kepada Jabir: Bagaimanakah?  Jawabnya: Ia dikatakan sebagai cacing perut.  Tetapi dia tidak menerangkan tentang ghoul. Abu Zubair berkata: Ghoul itu ialah yang membunuh orang yang sedang musafir."
  },
  {
    "id": 12926,
    "hadith_number": 5649,
    "tajuk_hadith": "Tiada Ramalan Kecuali Petanda Baik",
    "perawi_melayu": "Abu Hurairah meriwayatkan:",
    "english_text": "I heard Allah's Messenger (ﷺ) as saying: There is no divination but the best type is the good omen. It was said to Allah's Messenger (ﷺ): What is good omen? Thereupon he said: A good word which one of you hears.",
    "arabic_text": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ،\n اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏\n لاَ طِيَرَةَ وَخَيْرُهَا الْفَأْلُ ‏\"‏ ‏.‏ قِيلَ يَا رَسُولَ اللَّهِ وَمَا الْفَأْلُ قَالَ ‏\"‏ الْكَلِمَةُ الصَّالِحَةُ يَسْمَعُهَا\n أَحَدُكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda:  \"Tiada ramalan melainkan yang terbaik adalah petanda baik.\"  Lalu seseorang bertanya kepada Rasulullah SAW: \"Apakah petanda baik itu?\" Baginda menjawab:  \"Perkataan yang baik yang didengar oleh salah seorang di antara kamu.\""
  },
  {
    "id": 12927,
    "hadith_number": 5650,
    "tajuk_hadith": "Perbezaan Ringkas Perawi Hadis",
    "perawi_melayu": "Zuhri",
    "english_text": "This hadith has been narrated on the authority of Zuhri with the same chain of transmitters but with a slight variation of wording.",
    "arabic_text": "وَحَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلُ بْنُ،\n خَالِدٍ ح وَحَدَّثَنِيهِ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، كِلاَهُمَا\n عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ ‏.‏ مِثْلَهُ ‏.‏ وَفِي حَدِيثِ عُقَيْلٍ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم\n ‏.‏ وَلَمْ يَقُلْ سَمِعْتُ ‏.‏ وَفِي حَدِيثِ شُعَيْبٍ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم كَمَا قَالَ\n مَعْمَرٌ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Zuhri dengan sanad yang sama, tetapi dengan sedikit perbezaan lafaz."
  },
  {
    "id": 12928,
    "hadith_number": 5651,
    "tajuk_hadith": "Tiada Penyakit Berjangkit Melalui Cara Ghaib dan Ramalan",
    "perawi_melayu": "Anas meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There is no transitive disease, no divination, but good omen pleases me, i. e. the good word or a good word.\n\n\n\nNote: The majority of scholars interpret this to mean that these things in and of themselves do not transmit or cause harm through supernatural or hidden means but that Allah is ultimately in control and any fearful superstition around these is false.",
    "arabic_text": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ، أَنَّ نَبِيَّ\n اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ عَدْوَى وَلاَ طِيَرَةَ وَيُعْجِبُنِي الْفَأْلُ الْكَلِمَةُ الْحَسَنَةُ الْكَلِمَةُ\n الطَّيِّبَةُ ‏\"‏ ‏.‏",
    "malay_translation": "Tidak ada penyakit berjangkit melalui cara ghaib, dan tidak ada ramalan.  Namun, firasat yang baik (omen baik)  menyukakan hatiku; iaitu kata-kata yang baik dan kata-kata yang suci.  Kebanyakan ulama mentafsirkan hadis ini bermaksud bahawa perkara-perkara tersebut dengan sendirinya tidak menjangkiti atau mendatangkan mudarat melalui cara ghaib, tetapi Allah SWT sentiasa mengawal segalanya dan sebarang kepercayaan tahyul yang dikaitkan dengannya adalah batil."
  },
  {
    "id": 12929,
    "hadith_number": 5652,
    "tajuk_hadith": "Tiada Penyakit Berjangkit dan Ramalan Buruk, Melainkan Firasat Baik",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There is no transitive disease, no divination, but good omen pleases me. It was said: What is good omen? He said: Sacred words.",
    "arabic_text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ،\n سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ عَدْوَى\n وَلاَ طِيَرَةَ وَيُعْجِبُنِي الْفَأْلُ ‏\"‏ ‏.‏ قَالَ قِيلَ وَمَا الْفَأْلُ قَالَ ‏\"‏ الْكَلِمَةُ الطَّيِّبَةُ ‏\"‏ ‏.‏",
    "malay_translation": "Tiada penyakit berjangkit dan tiada ramalan buruk.  Namun, firasat baik itu menyenangkan saya.  Ditanya, \"Apakah firasat baik itu?\"  Baginda menjawab, \"Perkataan yang baik.\""
  },
  {
    "id": 12930,
    "hadith_number": 5653,
    "tajuk_hadith": "Tiada Penyakit Berjangkit dan Ramalan",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There is no transitive disease, no divination, but I like good words.",
    "arabic_text": "وَحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنِي مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُخْتَارٍ،\n حَدَّثَنَا يَحْيَى بْنُ عَتِيقٍ، حَدَّثَنَا مُحَمَّدُ بْنُ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم ‏\n\"‏ لاَ عَدْوَى وَلاَ طِيَرَةَ وَأُحِبُّ الْفَأْلَ الصَّالِحَ ‏\"‏ ‏.‏",
    "malay_translation": "Tiada penyakit berjangkit dan tiada ramalan, tetapi aku menyukai petanda yang baik."
  },
  {
    "id": 12931,
    "hadith_number": 5654,
    "tajuk_hadith": "Tiada Penyakit Berjangkit, Tiada Hama, Tiada Ramalan Buruk",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There is no transitive disease, no hama, no divination, but I like good omen.",
    "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا هِشَامُ بْنُ حَسَّانٍ، عَنْ \n مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ عَدْوَى\n وَلاَ هَامَةَ وَلاَ طِيَرَةَ وَأُحِبُّ الْفَأْلَ الصَّالِحَ ‏\"‏ ‏.‏",
    "malay_translation": "Tiada penyakit berjangkit, tiada hama, tiada tiyara (ramalan buruk), tetapi aku menyukai petanda yang baik."
  },
  {
    "id": 12932,
    "hadith_number": 5655,
    "tajuk_hadith": "Petanda Buruk dalam Rumah, Isteri, dan Kuda",
    "perawi_melayu": "Abdullah bin Umar meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "If there be bad luck, it is in the house, and the wife, and the horse.",
    "arabic_text": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، ح وَحَدَّثَنَا يَحْيَى،\n بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ حَمْزَةَ، وَسَالِمٍ، ابْنَىْ عَبْدِ اللَّهِ بْنِ عُمَرَ\n عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الشُّؤْمُ فِي الدَّارِ وَالْمَرْأَةِ\n وَالْفَرَسِ ‏\"‏ ‏.‏",
    "malay_translation": "Petanda buruk itu terdapat pada rumah, isteri, dan kuda."
  },
  {
    "id": 12933,
    "hadith_number": 5656,
    "tajuk_hadith": "Tiada Penyakit Berjangkit, Petanda Buruk, dan Bala",
    "perawi_melayu": "Abdullah bin Umar meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There is no transitive disease, no ill omen, and bad luck is lound in the house, or wife or horse.\n\n\n\nNote: The majority of scholars interpret this to mean that these things in and of themselves do not transmit or cause harm through supernatural or hidden means but that Allah is ultimately in control and any fearful superstition around these is false.",
    "arabic_text": "وَحَدَّثَنَا أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ،\n عَنِ ابْنِ شِهَابٍ، عَنْ حَمْزَةَ، وَسَالِمٍ، ابْنَىْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ\n اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ عَدْوَى وَلاَ طِيَرَةَ وَإِنَّمَا الشُّؤْمُ فِي ثَلاَثَةٍ الْمَرْأَةِ وَالْفَرَسِ\n وَالدَّارِ ‏\"‏ ‏.‏",
    "malay_translation": "Tiada penyakit berjangkit, tiada petanda buruk, dan bala hanya terdapat pada tiga perkara: wanita, kuda, dan rumah."
  },
  {
    "id": 12934,
    "hadith_number": 5657,
    "tajuk_hadith": "Riwayat Hadis Zuhri dengan Beberapa Sanad",
    "perawi_melayu": "Zuhri dan beberapa perawi lain",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، وَحَمْزَةَ، ابْنَىْ عَبْدِ\n اللَّهِ عَنْ أَبِيهِمَا، عَنِ النَّبِيِّ صلى الله عليه وسلم ح \n وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، عَنْ سُفْيَانَ، عَنِ الزُّهْرِيِّ،\n عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم ح \n وَحَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ،\n عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، وَحَمْزَةَ، ابْنَىْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنِ النَّبِيِّ\n صلى الله عليه وسلم ح \n وَحَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي \n عُقَيْلُ بْنُ خَالِدٍ، ح وَحَدَّثَنَاهُ يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ،\n إِسْحَاقَ ح وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ،\n كُلُّهُمْ عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم فِي الشُّؤْمِ ‏.‏ بِمِثْلِ\n حَدِيثِ مَالِكٍ لاَ يَذْكُرُ أَحَدٌ مِنْهُمْ فِي حَدِيثِ ابْنِ عُمَرَ الْعَدْوَى وَالْطِّيَرَةَ غَيْرُ يُونُسَ بْنِ يَزِيدَ\n ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ibn Abi Umar, telah menceritakan kepada kami Sufyan, dari Zuhri, dari Salim dan Hamzah, anak-anak Abdullah dari bapa mereka, dari Nabi SAW.  \nDan telah menceritakan kepada kami Yahya bin Yahya, dan Amru al-Naqid, dan Zuhair bin Harb, dari Sufyan, dari Zuhri, dari Salim, dari bapanya, dari Nabi SAW. \nDan telah menceritakan kepada kami Amru al-Naqid, telah menceritakan kepada kami Ya’qub bin Ibrahim bin Saad, telah menceritakan kepada kami bapaku, dari Shalih, dari Ibn Syihab, dari Salim dan Hamzah, anak-anak Abdullah bin Umar dari Abdullah bin Umar, dari Nabi SAW. \nDan telah menceritakan kepadaku Abdul Malik bin Syu’aib bin Laits bin Saad, telah menceritakan kepadaku bapaku, dari datukku, telah menceritakan kepadaku Uqail bin Khalid. Dan telah menceritakan kepada kami Yahya bin Yahya, telah memberitahu kami Bisyr bin al-Mufaddal, dari Abdul Rahman bin Ishaq. Dan telah menceritakan kepadaku Abdullah bin Abdul Rahman ad-Darimi, telah memberitahu kami Abu al-Yaman, telah memberitahu kami Syu’aib. Mereka semua dari Zuhri, dari Salim, dari bapanya, dari Nabi SAW tentang perkara yang dianggap malang.  Seperti hadis Malik, tiada seorang pun daripada mereka menyebut dalam hadis Ibn Umar tentang perkara yang dianggap malang dan burung kecuali Yunus bin Yazid."
  },
  {
    "id": 12935,
    "hadith_number": 5658,
    "tajuk_hadith": "Petanda Buruk dalam Kuda, Wanita, dan Rumah",
    "perawi_melayu": "Umar bin Muhammad bin Zaid meriwayatkan daripada bapanya yang meriwayatkan daripada Ibnu Umar bahawa Rasulullah SAW telah bersabda:",
    "english_text": "'Umar b. Muhammad b. Zaid reported that he heard his father narrating from Ibn 'Umar that Allah's Messenger (ﷺ) had said. If bad luck is a fact, then it is in the horse, the woman and the house.",
    "arabic_text": "وَحَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ \n عُمَرَ بْنِ مُحَمَّدِ بْنِ زَيْدٍ، أَنَّهُ سَمِعَ أَبَاهُ، يُحَدِّثُ عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم\n أَنَّهُ قَالَ ‏\n\"‏ إِنْ يَكُنْ مِنَ الشُّؤْمِ شَىْءٌ حَقٌّ فَفِي الْفَرَسِ وَالْمَرْأَةِ وَالدَّارِ ‏\"‏ ‏.‏",
    "malay_translation": "Umar bin Muhammad bin Zaid meriwayatkan bahawa beliau mendengar bapanya meriwayatkan daripada Ibnu Umar bahawa Rasulullah SAW bersabda:  \"Jika ada sesuatu yang dianggap sebagai petanda buruk, maka ia terdapat pada kuda, wanita, dan rumah.\""
  },
  {
    "id": 12936,
    "hadith_number": 5659,
    "tajuk_hadith": "Riwayat Shu'ba tanpa sebutan \"Haqq\"",
    "perawi_melayu": "Harun bin Abdullah meriwayatkan daripada Ruh bin Ubadah, meriwayatkan daripada Syu'bah dengan sanad yang sama, tetapi tanpa menyebut perkataan \"Haqq\"",
    "english_text": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters but there is no mention of the word\" Haqq\"\" (fact).",
    "arabic_text": "وَحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ\n مِثْلَهُ وَلَمْ يَقُلْ ‏\n\"‏ حَقٌّ ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Syu'bah dengan sanad yang sama, tetapi tanpa menyebut perkataan \"Haqq\" (kebenaran)."
  },
  {
    "id": 12937,
    "hadith_number": 5660,
    "tajuk_hadith": "Petanda Buruk pada Kuda, Rumah, dan Wanita",
    "perawi_melayu": "Abdullah bin Umar meriwayatkan daripada bapanya bahawa Rasulullah SAW bersabda:",
    "english_text": "If there is bad luck in anything, it is the horse, the abode and the woman.",
    "arabic_text": "وَحَدَّثَنِي أَبُو بَكْرِ بْنُ إِسْحَاقَ، حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، حَدَّثَنِي \n عُتْبَةُ بْنُ مُسْلِمٍ، عَنْ حَمْزَةَ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم\n قَالَ ‏\n\"‏ إِنْ كَانَ الشُّؤْمُ فِي شَىْءٍ فَفِي الْفَرَسِ وَالْمَسْكَنِ وَالْمَرْأَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Sekiranya ada sesuatu yang membawa petanda buruk, maka ia adalah kuda, tempat tinggal, dan wanita."
  },
  {
    "id": 12938,
    "hadith_number": 5661,
    "tajuk_hadith": "Kesialan dalam Wanita, Kuda, dan Tempat Tinggal",
    "perawi_melayu": "Sahl bin Sa'd meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "If bad luck were to be in anything, it is found in the woman, the horse and the abode.",
    "arabic_text": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا مَالِكٌ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ،\n سَعْدٍ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنْ كَانَ فَفِي الْمَرْأَةِ وَالْفَرَسِ وَالْمَسْكَنِ\n ‏\"‏ ‏.‏ يَعْنِي الشُّؤْمَ ‏.‏",
    "malay_translation": "Sahl bin Sa'd meriwayatkan bahawa Rasulullah SAW bersabda:  \"Sekiranya ada sesuatu yang membawa nasib malang, ia terdapat pada wanita, kuda, dan tempat tinggal.\"  Maksudnya ialah bala atau kesialan."
  },
  {
    "id": 12939,
    "hadith_number": 5662,
    "tajuk_hadith": "Hadis daripada Sahl bin Saad dengan Sanad yang Berbeza",
    "perawi_melayu": "Abu Bakar bin Abi Syaibah, al-Fazl bin Dukain, Hisyam bin Saad, Abu Hazim, Sahl bin Saad",
    "english_text": "This hadith has been narrated on the authority of Sahl b. Sa'd with a different chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ، حَدَّثَنَا هِشَامُ بْنُ سَعْدٍ، عَنْ \n أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Sahl bin Saad dengan sanad yang berbeza.  (Perawi: Abu Bakar bin Abi Syaibah, al-Fazl bin Dukain, Hisyam bin Saad, Abu Hazim, Sahl bin Saad)."
  },
  {
    "id": 12940,
    "hadith_number": 5663,
    "tajuk_hadith": "Nasib Buruk dalam Kehidupan",
    "perawi_melayu": "Jabir meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "If bad luck were to be in anything, it is found in the land, in the servant and in the horse.",
    "arabic_text": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْحَارِثِ، عَنِ ابْنِ،\n جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرًا، يُخْبِرُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ\n ‏\n\"‏ إِنْ كَانَ فِي شَىْءٍ فَفِي الرَّبْعِ وَالْخَادِمِ وَالْفَرَسِ ‏\"‏ ‏.‏",
    "malay_translation": "Jika sesuatu bala itu ada, nescaya ia terdapat pada tanah, hamba dan kuda."
  },
  {
    "id": 12941,
    "hadith_number": 5664,
    "tajuk_hadith": "Menziarahi Kahin dan Mengambil Petanda",
    "perawi_melayu": "Mu'awiya b. al-Hakam as-Sulami meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ،\n عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ مُعَاوِيَةَ بْنِ الْحَكَمِ السُّلَمِيِّ،\n قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أُمُورًا كُنَّا نَصْنَعُهَا فِي الْجَاهِلِيَّةِ كُنَّا نَأْتِي الْكُهَّانَ ‏.‏ قَالَ ‏\"‏ فَلاَ\n تَأْتُوا الْكُهَّانَ ‏\"‏ ‏.‏ قَالَ قُلْتُ كُنَّا نَتَطَيَّرُ ‏.‏ قَالَ ‏\"‏ ذَاكَ شَىْءٌ يَجِدُهُ أَحَدُكُمْ فِي نَفْسِهِ فَلاَ يَصُدَّنَّكُمْ\n ‏\"‏ ‏.‏",
    "malay_translation": "Aku berkata, \"Wahai Rasulullah, ada beberapa perkara yang kami lakukan pada zaman jahiliyyah. Kami biasa mengunjungi kahin.\" Baginda bersabda, \"Janganlah kamu mengunjungi kahin.\" Aku berkata, \"Kami juga biasa mengambil petanda.\" Baginda bersabda, \"Itu adalah sesuatu yang difikirkan oleh seseorang di dalam hatinya, maka janganlah ia menghalang kamu (daripada melakukan sesuatu).\""
  },
  {
    "id": 12942,
    "hadith_number": 5665,
    "tajuk_hadith": "Perbezaan Ringkas Hadis daripada Zuhri",
    "perawi_melayu": "Zuhri dan beberapa perawi lain",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنِي حُجَيْنٌ، - يَعْنِي ابْنَ الْمُثَنَّى - حَدَّثَنَا اللَّيْثُ، عَنْ \n عُقَيْلٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالاَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا \n مَعْمَرٌ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، ح\n وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، أَخْبَرَنَا إِسْحَاقُ بْنُ عِيسَى، أَخْبَرَنَا مَالِكٌ، كُلُّهُمْ عَنِ الزُّهْرِيِّ، بِهَذَا\n الإِسْنَادِ ‏.‏ مِثْلَ مَعْنَى حَدِيثِ يُونُسَ غَيْرَ أَنَّ مَالِكًا فِي حَدِيثِهِ ذَكَرَ الطِّيَرَةَ وَلَيْسَ فِيهِ ذِكْرُ\n الْكُهَّانِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Zuhri dengan sedikit perbezaan lafaz.  Muhammad bin Rafi' meriwayatkan daripada Hujair (iaitu Ibn al-Mutsanna), yang meriwayatkan daripada Laith, daripada Uqail.  Ishaq bin Ibrahim dan Abd bin Humaid berkata: “Kami telah diberitakan oleh Abd ar-Razzaq, yang telah diberitakan oleh Ma'mar.” Abu Bakar bin Abi Syaibah meriwayatkan daripada Syababah bin Sawwar, yang meriwayatkan daripada Ibn Abi Dzaib. Muhammad bin Rafi' meriwayatkan: “Aku telah diberitakan oleh Ishaq bin Isa, yang telah diberitakan oleh Malik.” Kesemuanya daripada Zuhri melalui sanad ini.  Maknanya serupa dengan hadis Yunus, kecuali Malik dalam hadisnya menyebut tentang burung dan tidak menyebut tentang tukang sihir."
  },
  {
    "id": 12943,
    "hadith_number": 5666,
    "tajuk_hadith": "Ramalan Melalui Garisan",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Mu'awiya bin Hakam As-Sulami melalui beberapa sanad.  Hadis yang diriwayatkan daripada Yahya bin Abi Kathir (dengan tambahan perkataan ini):",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالاَ حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ\n ابْنُ عُلَيَّةَ - عَنْ حَجَّاجٍ الصَّوَّافِ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ،\n حَدَّثَنَا الأَوْزَاعِيُّ، كِلاَهُمَا عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ هِلاَلِ بْنِ أَبِي مَيْمُونَةَ، عَنْ عَطَاءِ بْنِ،\n يَسَارٍ عَنْ مُعَاوِيَةَ بْنِ الْحَكَمِ السُّلَمِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ بِمَعْنَى حَدِيثِ الزُّهْرِيِّ\n عَنْ أَبِي سَلَمَةَ عَنْ مُعَاوِيَةَ وَزَادَ فِي حَدِيثِ يَحْيَى بْنِ أَبِي كَثِيرٍ قَالَ قُلْتُ وَمِنَّا رِجَالٌ يَخُطُّونَ\n قَالَ ‏\n\"‏ كَانَ نَبِيٌّ مِنَ الأَنْبِيَاءِ يَخُطُّ فَمَنْ وَافَقَ خَطُّهُ فَذَاكَ ‏\"‏ ‏.‏",
    "malay_translation": "Aku berkata: Di kalangan kami ada lelaki yang melukis garisan dan dengan itu melakukan ramalan. Bagaimana dengan perkara ini?  Maka baginda (Nabi SAW) bersabda:  Ada seorang Nabi yang melukis garisan, maka sesiapa yang garisan ramalannya tepat seperti garisan Nabi itu, maka ia dibolehkan."
  },
  {
    "id": 12944,
    "hadith_number": 5667,
    "tajuk_hadith": "Perkataan Benar dan Dusta daripada Jin",
    "perawi_melayu": "Aisyah meriwayatkan:",
    "english_text": "I said: Allah's Messenger, the kahins used to tell us about things (unseen) and we found them to be true. Thereupon he said: That is a word pertaining to truth which a jinn snatches and throws into the ear of his friend, and makes an addition of one hundred lies to it.",
    "arabic_text": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ يَحْيَى،\n بْنِ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ الْكُهَّانَ كَانُوا يُحَدِّثُونَنَا\n بِالشَّىْءِ فَنَجِدُهُ حَقًّا قَالَ ‏\n\"‏ تِلْكَ الْكَلِمَةُ الْحَقُّ يَخْطَفُهَا الْجِنِّيُّ فَيَقْذِفُهَا فِي أُذُنِ وَلِيِّهِ وَيَزِيدُ\n فِيهَا مِائَةَ كَذْبَةٍ ‏\"‏ ‏.‏",
    "malay_translation": "Aku berkata: Wahai Rasulullah, para kahin dahulu sering memberitahu kami tentang perkara-perkara ghaib dan kami mendapati ia benar.  Lalu Baginda SAW bersabda: “Itu adalah perkataan yang benar yang dicuri oleh jin, kemudian dibisikkannya ke telinga sahabatnya, dan ditambah dengan seratus kepalsuan.”"
  },
  {
    "id": 12945,
    "hadith_number": 5668,
    "tajuk_hadith": "Perihal Ahli Nujum dan Jin",
    "perawi_melayu": "Urwa meriwayatkan daripada Aisyah bahawa beliau berkata bahawa orang ramai bertanya kepada Rasulullah SAW tentang ahli nujum.",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، - وَهْوَ ابْنُ عُبَيْدِ\n اللَّهِ - عَنِ الزُّهْرِيِّ، أَخْبَرَنِي يَحْيَى بْنُ عُرْوَةَ، أَنَّهُ سَمِعَ عُرْوَةَ، يَقُولُ قَالَتْ عَائِشَةُ سَأَلَ\n أُنَاسٌ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الْكُهَّانِ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه\n وسلم ‏\"‏ لَيْسُوا بِشَىْءٍ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ فَإِنَّهُمْ يُحَدِّثُونَ أَحْيَانًا الشَّىْءَ يَكُونُ حَقًّا\n ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تِلْكَ الْكَلِمَةُ مِنَ الْجِنِّ يَخْطَفُهَا الْجِنِّيُّ فَيَقُرُّهَا فِي\n أُذُنِ وَلِيِّهِ قَرَّ الدَّجَاجَةِ فَيَخْلِطُونَ فِيهَا أَكْثَرَ مِنْ مِائَةِ كَذْبَةٍ ‏\"‏ ‏.‏",
    "malay_translation": "Salmah bin Syabib telah menceritakan kepadaku, al-Hasan bin A'yan telah menceritakan kepada kami, Ma'qil (iaitu anak kepada Ubaidillah) telah menceritakan kepada kami daripada az- Zuhri, Yahya bin Urwah telah memberitahu aku bahawa dia telah mendengar Urwah berkata: Aisyah berkata bahawa segelintir orang telah bertanya kepada Rasulullah SAW tentang ahli nujum, maka Rasulullah SAW berkata kepada mereka: \"Mereka bukan apa-apa.\" Mereka berkata: \"Wahai Rasulullah, sesungguhnya mereka kadang-kadang menceritakan sesuatu yang benar.\" Rasulullah SAW bersabda: \"Perkataan itu daripada jin, jin itu merampas perkataan itu kemudian membisikkannya ke telinga sahabatnya seperti ayam berkokok, kemudian mereka mencampurkan lebih daripada seratus kepalsuan di dalamnya.\""
  },
  {
    "id": 12946,
    "hadith_number": 5669,
    "tajuk_hadith": "Riwayat Zuhri melalui Sanad yang Sama",
    "perawi_melayu": "Zuhri dan periwayat-periwayat lain yang sama sanadnya.",
    "english_text": "This hadith has been narrated on the authority of Zuhri with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي مُحَمَّدُ بْنُ عَمْرٍو، عَنِ \n ابْنِ جُرَيْجٍ، عَنِ ابْنِ شِهَابٍ، بِهَذَا الإِسْنَادِ نَحْوَ رِوَايَةِ مَعْقِلٍ عَنِ الزُّهْرِيِّ، ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Zuhri dengan sanad (rantaian periwayat) yang sama.  Abu Tahir memberitahu saya, Abdullah bin Wahb memberitahu saya, Muhammad bin Amr memberitahu saya, daripada Ibn Juraij, daripada Ibn Syihab, dengan sanad yang hampir sama dengan riwayat Ma’qil daripada Zuhri."
  },
  {
    "id": 12947,
    "hadith_number": 5670,
    "tajuk_hadith": "Perihal Bintang Jatuh dan Berita dari Langit",
    "perawi_melayu": "Abdullah bin Abbas meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ حَسَنٌ حَدَّثَنَا يَعْقُوبُ، وَقَالَ،\n عَبْدٌ حَدَّثَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي \n عَلِيُّ بْنُ حُسَيْنٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، قَالَ أَخْبَرَنِي رَجُلٌ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله\n عليه وسلم مِنَ الأَنْصَارِ أَنَّهُمْ بَيْنَمَا هُمْ جُلُوسٌ لَيْلَةً مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم\n رُمِيَ بِنَجْمٍ فَاسْتَنَارَ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَاذَا كُنْتُمْ تَقُولُونَ فِي\n الْجَاهِلِيَّةِ إِذَا رُمِيَ بِمِثْلِ هَذَا ‏\"‏ ‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ كُنَّا نَقُولُ وُلِدَ اللَّيْلَةَ رَجُلٌ عَظِيمٌ\n وَمَاتَ رَجُلٌ عَظِيمٌ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَإِنَّهَا لاَ يُرْمَى بِهَا لِمَوْتِ أَحَدٍ\n وَلاَ لِحَيَاتِهِ وَلَكِنْ رَبُّنَا تَبَارَكَ وَتَعَالَى اسْمُهُ إِذَا قَضَى أَمْرًا سَبَّحَ حَمَلَةُ الْعَرْشِ ثُمَّ سَبَّحَ\n أَهْلُ السَّمَاءِ الَّذِينَ يَلُونَهُمْ حَتَّى يَبْلُغَ التَّسْبِيحُ أَهْلَ هَذِهِ السَّمَاءِ الدُّنْيَا ثُمَّ قَالَ الَّذِينَ يَلُونَ\n حَمَلَةَ الْعَرْشِ لِحَمَلَةِ الْعَرْشِ مَاذَا قَالَ رَبُّكُمْ فَيُخْبِرُونَهُمْ مَاذَا قَالَ - قَالَ - فَيَسْتَخْبِرُ\n بَعْضُ أَهْلِ السَّمَوَاتِ بَعْضًا حَتَّى يَبْلُغَ الْخَبَرُ هَذِهِ السَّمَاءَ الدُّنْيَا فَتَخْطَفُ الْجِنُّ السَّمْعَ\n فَيَقْذِفُونَ إِلَى أَوْلِيَائِهِمْ وَيُرْمَوْنَ بِهِ فَمَا جَاءُوا بِهِ عَلَى وَجْهِهِ فَهُوَ حَقٌّ وَلَكِنَّهُمْ يَقْرِفُونَ\n فِيهِ وَيَزِيدُونَ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki daripada kalangan Ansar yang termasuk sahabat Rasulullah SAW telah memberitahu aku:  Pada suatu malam ketika kami sedang duduk bersama Rasulullah SAW, tiba-tiba sebuah meteor jatuh dan memancarkan cahaya yang terang benderang.  Rasulullah SAW bertanya kepada kami, “Apakah yang kamu katakan pada zaman jahiliyyah apabila melihat kejadian seperti ini?”  Kami menjawab, “Allah dan Rasul-Nya lebih mengetahui. Tetapi kami biasanya berkata bahawa pada malam itu, seorang tokoh besar telah dilahirkan dan seorang tokoh besar telah meninggal dunia.” Rasulullah SAW bersabda, “Bintang jatuh itu bukanlah kerana kematian atau kelahiran seseorang.  Sebenarnya, apabila Tuhan Yang Maha Berkat dan Maha Tinggi telah menetapkan sesuatu perkara, para malaikat yang mengangkat Arasy memuji-Nya. Kemudian ahli langit yang terdekat dengan mereka turut memuji-Nya, sehingga pujian itu sampai kepada ahli langit dunia ini.  Kemudian mereka yang berada berdekatan dengan para malaikat yang mengangkat Arasy bertanya kepada mereka, ‘Apakah yang telah Tuhan kamu katakan?’  Mereka pun memberitahu mereka apa yang telah Tuhan katakan.  Kemudian ahli-ahli langit saling bertanya-tanya sehingga berita itu sampai ke langit dunia.  Jin-jin pula mencuri dengar dan menyampaikannya kepada rakan-rakan mereka. Apabila malaikat-malaikat melihat jin-jin itu, mereka akan menyerang mereka dengan bintang-bintang jatuh.  Apa yang mereka sampaikan tentang perkara yang mereka dengar itu adalah benar, tetapi mereka mencampurkannya dengan dusta dan menambah-nambah.”"
  },
  {
    "id": 12948,
    "hadith_number": 5671,
    "tajuk_hadith": "Perbezaan Ringkas Dalam Sanad Hadis Zuhri",
    "perawi_melayu": "Zuhri melalui beberapa jalur perawi dengan sedikit perbezaan lafaz.",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا أَبُو عَمْرٍو الأَوْزَاعِيُّ، ح\n وَحَدَّثَنَا أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح وَحَدَّثَنِي سَلَمَةُ بْنُ،\n شَبِيبٍ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، - يَعْنِي ابْنَ عُبَيْدِ اللَّهِ - كُلُّهُمْ عَنِ الزُّهْرِيِّ،\n بِهَذَا الإِسْنَادِ غَيْرَ أَنَّ يُونُسَ، قَالَ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَخْبَرَنِي رِجَالٌ مِنْ أَصْحَابِ\n رَسُولِ اللَّهِ مِنَ الأَنْصَارِ وَفِي حَدِيثِ الأَوْزَاعِيِّ ‏\"‏ وَلَكِنْ يَقْرِفُونَ فِيهِ وَيَزِيدُونَ ‏\"‏ ‏.‏ وَفِي\n حَدِيثِ يُونُسَ ‏\"‏ وَلَكِنَّهُمْ يَرْقَوْنَ فِيهِ وَيَزِيدُونَ ‏\"‏ ‏.‏ وَزَادَ فِي حَدِيثِ يُونُسَ وَقَالَ اللَّهُ ‏\"‏\n حَتَّى إِذَا فُزِّعَ عَنْ قُلُوبِهِمْ قَالُوا مَاذَا قَالَ رَبُّكُمْ قَالُوا الْحَقَّ ‏\"‏ ‏.‏ وَفِي حَدِيثِ مَعْقِلٍ كَمَا\n قَالَ الأَوْزَاعِيُّ ‏\"‏ وَلَكِنَّهُمْ يَقْرِفُونَ فِيهِ وَيَزِيدُونَ ‏\"‏ ‏.‏",
    "malay_translation": "Kami telah dimaklumkan oleh Zuhri bin Harb, yang telah dimaklumkan kepadanya oleh Walid bin Muslim, yang telah dimaklumkan kepadanya oleh Abu Amru al-Auza'i, dan kami telah dimaklumkan oleh Abu ath-Thahir dan Harmalah, mereka berdua berkata: telah menceritakan kepada kami Ibn Wahb, yang telah menceritakan kepadaku Yunus, dan telah menceritakan kepadaku Salamah bin Syabib, yang telah dimaklumkan kepadanya oleh al-Hasan bin A'yanah, yang telah dimaklumkan kepadanya oleh Ma'qil – iaitu Ibn Ubaidillah – semuanya daripada Zuhri, dengan sanad ini, kecuali Yunus berkata daripada Abdullah bin Abbas: telah menceritakan kepada saya sekumpulan daripada sahabat Rasulullah ﷺ daripada kalangan Ansar.  Dalam hadis al-Auza'i:  “Tetapi mereka melakukan kesalahan di dalamnya dan menambah (perkara lain).” Dan dalam hadis Yunus: “Tetapi mereka melampaui batas di dalamnya dan menambah (perkara lain).” Dan Yunus menambah dan berkata Allah SWT berfirman: “Sehingga apabila ketakutan dihilangkan daripada hati mereka, mereka berkata: Apakah yang dikatakan oleh Tuhan kamu? Mereka berkata: (Yang benar).” Dan dalam hadis Ma'qil seperti yang dikatakan oleh al-Auza'i: “Tetapi mereka melakukan kesalahan di dalamnya dan menambah (perkara lain).”"
  },
  {
    "id": 12949,
    "hadith_number": 5672,
    "tajuk_hadith": "Solat Tidak Diterima Selepas Berjumpa Peramal",
    "perawi_melayu": "Safiyyah meriwayatkan daripada sebahagian isteri-isteri Rasulullah SAW, bahawa Rasulullah SAW bersabda:",
    "english_text": "He who visits a diviner ('Arraf) and asks him about anything, his prayers extending to forty nights will not be accepted.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ، حَدَّثَنَا يَحْيَى، - يَعْنِي ابْنَ سَعِيدٍ - عَنْ عُبَيْدِ اللَّهِ،\n عَنْ نَافِعٍ، عَنْ صَفِيَّةَ، عَنْ بَعْضِ، أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم عَنِ النَّبِيِّ صلى الله\n عليه وسلم قَالَ ‏\n\"‏ مَنْ أَتَى عَرَّافًا فَسَأَلَهُ عَنْ شَىْءٍ لَمْ تُقْبَلْ لَهُ صَلاَةٌ أَرْبَعِينَ لَيْلَةً ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa yang mengunjungi peramal ('Arraf) dan bertanya kepadanya tentang sesuatu, maka solatnya tidak akan diterima selama empat puluh malam."
  },
  {
    "id": 12950,
    "hadith_number": 5673,
    "tajuk_hadith": "Bai'ah dan Orang Kusta",
    "perawi_melayu": "'Amr bin Sharid meriwayatkan daripada bapanya bahawa terdapat seorang yang menghidap penyakit kusta di dalam rombongan Thaqif. Rasulullah SAW telah menghantar pesanan kepadanya:",
    "english_text": "We have accepted your allegiance, so you may go.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا \n شَرِيكُ بْنُ عَبْدِ اللَّهِ، وَهُشَيْمُ بْنُ بَشِيرٍ، عَنْ يَعْلَى بْنِ عَطَاءٍ، عَنْ عَمْرِو بْنِ الشَّرِيدِ، عَنْ أَبِيهِ،\n قَالَ كَانَ فِي وَفْدِ ثَقِيفٍ رَجُلٌ مَجْذُومٌ فَأَرْسَلَ إِلَيْهِ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِنَّا قَدْ\n بَايَعْنَاكَ فَارْجِعْ ‏\"‏ ‏.‏",
    "malay_translation": "Telah diterima bai'ah daripada kamu, maka pergilah."
  },
  {
    "id": 12951,
    "hadith_number": 5674,
    "tajuk_hadith": "Perintah membunuh ular belang",
    "perawi_melayu": "Aisyah r.a.",
    "english_text": "'A'isha reported that Allah's Messenger (ﷺ) commanded the killing of a snake having stripes over it, for it affects eyesight and miscarries pregnancy.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، وَابْنُ، نُمَيْرٍ عَنْ هِشَامٍ، ح\n وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا عَبْدَةُ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ أَمَرَ رَسُولُ اللَّهِ\n صلى الله عليه وسلم بِقَتْلِ ذِي الطُّفْيَتَيْنِ فَإِنَّهُ يَلْتَمِسُ الْبَصَرَ وَيُصِيبُ الْحَبَلَ ‏.‏",
    "malay_translation": "Aisyah r.a. meriwayatkan bahawa Rasulullah SAW memerintahkan untuk membunuh ular yang berjalur, kerana ia boleh menjejaskan penglihatan dan menyebabkan keguguran kandungan."
  },
  {
    "id": 12952,
    "hadith_number": 5675,
    "tajuk_hadith": "Membunuh Ular Pendek dan Berbelang",
    "perawi_melayu": "Hadis ini diriwayatkan melalui Hisyam. Baginda berkata:",
    "english_text": "The short-tailed snake and the snake having stripes over it should be killed.",
    "arabic_text": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، أَخْبَرَنَا هِشَامٌ، بِهَذَا الإِسْنَادِ\n وَقَالَ الأَبْتَرُ وَذُو الطُّفْيَتَيْنِ ‏.‏",
    "malay_translation": "Ular yang pendek ekornya dan ular yang berbelang hendaklah dibunuh."
  },
  {
    "id": 12953,
    "hadith_number": 5676,
    "tajuk_hadith": "Membunuh Ular Berjalur dan Pendek",
    "perawi_melayu": "Salim, daripada bapanya, meriwayatkan daripada Rasulullah SAW:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَمْرُو بْنُ مُحَمَّدٍ النَّاقِدُ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ،\n عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\n\"‏ اقْتُلُوا الْحَيَّاتِ وَذَا الطُّفْيَتَيْنِ وَالأَبْتَرَ فَإِنَّهُمَا\n يَسْتَسْقِطَانِ الْحَبَلَ وَيَلْتَمِسَانِ الْبَصَرَ ‏\"‏ ‏.‏ قَالَ فَكَانَ ابْنُ عُمَرَ يَقْتُلُ كُلَّ حَيَّةٍ وَجَدَهَا فَأَبْصَرَهُ\n أَبُو لُبَابَةَ بْنُ عَبْدِ الْمُنْذِرِ أَوْ زَيْدُ بْنُ الْخَطَّابِ وَهُوَ يُطَارِدُ حَيَّةً فَقَالَ إِنَّهُ قَدْ نَهَى عَنْ ذَوَاتِ\n الْبُيُوتِ ‏.‏",
    "malay_translation": "Daripada Amru bin Muhammad An-Naqid, telah menceritakan kepada kami Sufyan bin Uyaina, daripada Az- Zuhri, daripada Salim, daripada bapanya, daripada Nabi SAW, sabdanya:\n\"Bunuhlah ular yang berjalur dan yang pendek ekornya, kerana keduanya menyebabkan keguguran kandungan dan boleh menjejaskan penglihatan.\"  Ibn Umar membunuh setiap ular yang dijumpainya. Kemudian Abu Lubabah bin Abd Al-Munzir atau Zaid bin Khattab melihatnya memburu seekor ular, lalu berkata: \"Sesungguhnya baginda telah melarang membunuh ular yang tinggal di rumah.\""
  },
  {
    "id": 12954,
    "hadith_number": 5677,
    "tajuk_hadith": "Arahan membunuh anjing dan ular",
    "perawi_melayu": "Ibnu Umar meriwayatkan:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَا حَاجِبُ بْنُ الْوَلِيدِ، حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، عَنِ الزُّبَيْدِيِّ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي \n سَالِمُ بْنُ عَبْدِ اللَّهِ، عَنِ ابْنِ عُمَرَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْمُرُ بِقَتْلِ\n الْكِلاَبِ يَقُولُ ‏\\\"‏ اقْتُلُوا الْحَيَّاتِ وَالْكِلاَبَ وَاقْتُلُوا ذَا الطُّفْيَتَيْنِ وَالأَبْتَرَ فَإِنَّهُمَا يَلْتَمِسَانِ الْبَصَرَ\n وَيَسْتَسْقِطَانِ الْحَبَالَى ‏\\\"‏ ‏.‏ قَالَ الزُّهْرِيُّ وَنُرَى ذَلِكَ مِنْ سُمَّيْهِمَا وَاللَّهُ أَعْلَمُ ‏.‏ قَالَ سَالِمٌ\n قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ فَلَبِثْتُ لاَ أَتْرُكُ حَيَّةً أَرَاهَا إِلاَّ قَتَلْتُهَا فَبَيْنَا أَنَا أُطَارِدُ حَيَّةً يَوْمًا\n مِنْ ذَوَاتِ الْبُيُوتِ مَرَّ بِي زَيْدُ بْنُ الْخَطَّابِ أَوْ أَبُو لُبَابَةَ وَأَنَا أُطَارِدُهَا فَقَالَ مَهْلاً يَا عَبْدَ\n اللَّهِ ‏.‏ فَقُلْتُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ بِقَتْلِهِنَّ ‏.‏ قَالَ إِنَّ رَسُولَ اللَّهِ صلى\n الله عليه وسلم قَدْ نَهَى عَنْ ذَوَاتِ الْبُيُوتِ ‏.‏ \n وَحَدَّثَنِيهِ حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح وَحَدَّثَنَا عَبْدُ بْنُ،\n حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، ح وَحَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ، حَدَّثَنَا يَعْقُوبُ، حَدَّثَنَا \n أَبِي، عَنْ صَالِحٍ، كُلُّهُمْ عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّ صَالِحًا، قَالَ حَتَّى رَآنِي أَبُو لُبَابَةَ\n بْنُ عَبْدِ الْمُنْذِرِ وَزَيْدُ بْنُ الْخَطَّابِ فَقَالاَ إِنَّهُ قَدْ نَهَى عَنْ ذَوَاتِ الْبُيُوتِ ‏.‏ وَفِي حَدِيثِ يُونُسَ\n ‏\\\"‏ اقْتُلُوا الْحَيَّاتِ ‏\\\"‏ ‏.‏ وَلَمْ يَقُلْ ‏\\\"‏ ذَا الطُّفْيَتَيْنِ وَالأَبْتَرَ ‏\\\"‏ ‏.‏",
    "malay_translation": "Kami telah dimaklumkan oleh Hajib bin Walid, yang telah dimaklumkan kepadanya oleh Muhammad bin Harb, daripada Az-Zubaidi, daripada Az- Zuhri, yang telah menceritakan kepadaku, Salim bin Abdullah, daripada Ibnu Umar, yang berkata: Aku mendengar Rasulullah SAW memerintahkan untuk membunuh anjing, baginda bersabda: \"Bunuhlah ular dan anjing, dan bunuhlah ular yang belang dan yang buntung, kerana kedua-duanya boleh menjejaskan penglihatan dan menyebabkan keguguran.\" Az-Zuhri berkata: Kami berpendapat itu adalah kerana bisa keduanya, dan Allah SWT lebih mengetahui. Salim berkata: Abdullah bin Umar berkata: Maka aku tidak meninggalkan seekor ular pun yang kulihat melainkan aku bunuhnya.  Pada suatu hari ketika aku sedang memburu seekor ular di rumah, lalu berlalu di sisiku Zaid bin Khattab atau Abu Lubabah ketika aku sedang memburunya, lalu dia berkata: “Pelan-pelan wahai Abdullah!” Aku berkata: “Sesungguhnya Rasulullah SAW telah memerintahkan untuk membunuhnya.” Dia berkata: “Sesungguhnya Rasulullah SAW telah melarang membunuh ular di rumah.”\nKami juga telah dimaklumkan oleh Harmalah bin Yahya, yang telah dimaklumkan kepadanya oleh Ibnu Wahb, yang telah dimaklumkan kepadanya oleh Yunus. Dan kami telah dimaklumkan oleh Abd bin Humaid, yang telah dimaklumkan kepadanya oleh Abdur Razak, yang telah dimaklumkan kepadanya oleh Ma’mar. Dan kami telah dimaklumkan oleh Hasan Al-Hulwani, yang telah dimaklumkan kepadanya oleh Ya’qub, yang telah dimaklumkan kepadanya oleh ayahnya, daripada Saleh, semuanya daripada Az-Zuhri, dengan sanad ini, kecuali Saleh berkata: Sehingga aku terlihat oleh Abu Lubabah bin Abdil Munzir dan Zaid bin Khattab, lalu mereka berdua berkata: “Sesungguhnya Baginda telah melarang membunuh ular di rumah.” Dan dalam riwayat Yunus, “Bunuhlah ular.” Dan tidak disebut “yang belang dan yang buntung.”"
  },
  {
    "id": 12955,
    "hadith_number": 5678,
    "tajuk_hadith": "Larangan membunuh ular di rumah",
    "perawi_melayu": "Nafi' meriwayatkan bahawa Abu Lubabah bercakap dengan Ibnu Umar untuk membuka satu pintu di rumahnya yang akan membawa mereka lebih dekat ke masjid dan mereka menjumpai kulit ular yang masih segar, lalu Abdullah berkata:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَاللَّفْظُ، لَهُ حَدَّثَنَا \n لَيْثٌ، عَنْ نَافِعٍ، أَنَّ أَبَا لُبَابَةَ، كَلَّمَ ابْنَ عُمَرَ لِيَفْتَحَ لَهُ بَابًا فِي دَارِهِ يَسْتَقْرِبُ بِهِ إِلَى الْمَسْجِدِ\n فَوَجَدَ الْغِلْمَةُ جِلْدَ جَانٍّ فَقَالَ عَبْدُ اللَّهِ الْتَمِسُوهُ فَاقْتُلُوهُ ‏.‏ فَقَالَ أَبُو لُبَابَةَ لاَ تَقْتُلُوهُ فَإِنَّ\n رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ قَتْلِ الْجِنَّانِ الَّتِي فِي الْبُيُوتِ ‏.‏",
    "malay_translation": "Muhammad bin Rumh telah meriwayatkan dariku,  Laith telah memberitakan kepada kami, dan Qotaibah bin Said juga meriwayatkan, dan lafaznya adalah daripada Laith, dari Nafi’, bahawa Abu Lubabah telah bercakap dengan Ibnu Umar untuk membuka sebuah pintu di rumahnya supaya lebih dekat ke masjid.  Mereka kemudian menjumpai kulit ular yang masih segar. Abdullah berkata, “Carilah ia dan bunuhlah ia!” Abu Lubabah berkata, “Jangan bunuh ia, kerana Rasulullah SAW telah melarang membunuh ular yang berada di dalam rumah.”"
  },
  {
    "id": 12956,
    "hadith_number": 5679,
    "tajuk_hadith": "Larangan membunuh ular rumah",
    "perawi_melayu": "Nafi', melalui riwayat Abu Lubabah bin Abd al-Munzir al-Badri",
    "english_text": "Nafi' reported that Ibn 'Umar used to kill all types of snakes until Abu Lubabah b. 'Abd al-Mundhir Badri reported that Allah's Messenger (ﷺ) had forbidden the killing of the snakes of the houses, and so he abstained from it.",
    "arabic_text": "وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، حَدَّثَنَا نَافِعٌ، قَالَ كَانَ ابْنُ عُمَرَ\n يَقْتُلُ الْحَيَّاتِ كُلَّهُنَّ حَتَّى حَدَّثَنَا أَبُو لُبَابَةَ بْنُ عَبْدِ الْمُنْذِرِ الْبَدْرِيُّ، أَنَّ رَسُولَ اللَّهِ صلى الله\n عليه وسلم نَهَى عَنْ قَتْلِ جِنَّانِ الْبُيُوتِ فَأَمْسَكَ ‏.‏",
    "malay_translation": "Nafi’ meriwayatkan bahawa Ibnu Umar biasa membunuh semua jenis ular sehingga Abu Lubabah bin Abd al-Munzir al-Badri meriwayatkan bahawa Rasulullah SAW telah melarang membunuh ular rumah, maka Ibnu Umar berhenti daripada melakukannya."
  },
  {
    "id": 12957,
    "hadith_number": 5680,
    "tajuk_hadith": "Larangan membunuh ular rumah",
    "perawi_melayu": "Nafi'",
    "english_text": "Nafi' reported that he heard Abu Lubaba informing Ibn 'Umar that Allah's Messenger (ﷺ) had forbidden the killing of domestic snakes.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، - وَهُوَ الْقَطَّانُ - عَنْ عُبَيْدِ اللَّهِ، أَخْبَرَنِي \n نَافِعٌ، أَنَّهُ سَمِعَ أَبَا لُبَابَةَ، يُخْبِرُ ابْنَ عُمَرَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ قَتْلِ\n الْجِنَّانِ ‏.",
    "malay_translation": "Nafi' meriwayatkan bahawa beliau mendengar Abu Lubabah memberitahu Ibn Umar bahawa Rasulullah SAW telah melarang membunuh ular rumah."
  },
  {
    "id": 12958,
    "hadith_number": 5681,
    "tajuk_hadith": "Larangan membunuh ular di rumah",
    "perawi_melayu": "Abdullah bin Umar melalui Abu Lubabah daripada Rasulullah SAW",
    "english_text": "'Abdullah reported that Abu Lubaba had informed him that Allah's Messenger (ﷺ) had forbidden the killing of the snakes found in the house.",
    "arabic_text": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ مُوسَى الأَنْصَارِيُّ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، حَدَّثَنَا عُبَيْدُ،\n اللَّهِ عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ أَبِي لُبَابَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ح \n وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ الضُّبَعِيُّ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنْ \n عَبْدِ اللَّهِ، أَنَّ أَبَا لُبَابَةَ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ قَتْلِ الْجِنَّانِ\n الَّتِي فِي الْبُيُوتِ ‏.",
    "malay_translation": "Abdullah bin Umar telah meriwayatkan daripada Abu Lubabah bahawa Rasulullah SAW telah melarang membunuh ular yang terdapat di dalam rumah."
  },
  {
    "id": 12959,
    "hadith_number": 5682,
    "tajuk_hadith": "Larangan Membunuh Ular Rumah dan Arahan Membunuh Ular Tertentu",
    "perawi_melayu": "Nafi' meriwayatkan bahawa Abu Lubabah bin Abd al-Munzir al-Ansari (awalnya) menetap di Quba'. Kemudian beliau berpindah ke Madinah.  Ketika beliau bersama Abdullah bin Umar membuka tingkap untuknya, tiba-tiba mereka nampak seekor ular di rumah. Mereka (penduduk rumah) cuba membunuhnya.  Maka Abu Lubabah berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، - يَعْنِي الثَّقَفِيَّ - قَالَ سَمِعْتُ يَحْيَى،\n بْنَ سَعِيدٍ يَقُولُ أَخْبَرَنِي نَافِعٌ، أَنَّ أَبَا لُبَابَةَ بْنَ عَبْدِ الْمُنْذِرِ الأَنْصَارِيَّ، - وَكَانَ مَسْكَنُهُ بِقُبَاءٍ\n فَانْتَقَلَ إِلَى الْمَدِينَةِ - فَبَيْنَمَا عَبْدُ اللَّهِ بْنُ عُمَرَ جَالِسًا مَعَهُ يَفْتَحُ خَوْخَةً لَهُ إِذَا هُمْ بِحَيَّةٍ\n مِنْ عَوَامِرِ الْبُيُوتِ فَأَرَادُوا قَتْلَهَا فَقَالَ أَبُو لُبَابَةَ إِنَّهُ قَدْ نُهِيَ عَنْهُنَّ - يُرِيدُ عَوَامِرَ الْبُيُوتِ\n - وَأُمِرَ بِقَتْلِ الأَبْتَرِ وَذِي الطُّفْيَتَيْنِ وَقِيلَ هُمَا اللَّذَانِ يَلْتَمِعَانِ الْبَصَرَ وَيَطْرَحَانِ أَوْلاَدَ النِّسَاءِ\n ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin al-Mutsanna, telah menceritakan kepada kami Abd al-Wahhab – iaitu al-Tsaqafi – berkata: Aku mendengar Yahya bin Said berkata: Telah memberitakan kepadaku Nafi', bahawa Abu Lubabah bin Abd al-Munzir al-Ansari – dan tempat tinggalnya di Quba’ – kemudian berpindah ke Madinah – ketika Abdullah bin Umar duduk bersamanya membuka tingkap untuknya, tiba-tiba mereka melihat seekor ular daripada ular-ular rumah. Lalu mereka hendak membunuhnya, maka Abu Lubabah berkata: Sesungguhnya telah dilarangkan membunuh ular rumah, dan diperintahkan membunuh ular yang buntutnya pendek, dan ular yang mempunyai dua corak, dan dikatakan: Kedua-duanya itu yang boleh menjejaskan penglihatan dan menyebabkan keguguran kandungan wanita."
  },
  {
    "id": 12960,
    "hadith_number": 5683,
    "tajuk_hadith": "Larangan membunuh ular di rumah kecuali dua jenis",
    "perawi_melayu": "Nafi' meriwayatkan daripada bapanya bahawa Abdullah bin Umar suatu hari melihat kulit ular di runtuhan rumahnya dan berkata:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَهْضَمٍ، حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ\n عِنْدَنَا ابْنُ جَعْفَرٍ - عَنْ عُمَرَ بْنِ نَافِعٍ، عَنْ أَبِيهِ، قَالَ كَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ يَوْمًا عِنْدَ هَدْمٍ\n لَهُ فَرَأَى وَبِيصَ جَانٍّ فَقَالَ اتَّبِعُوا هَذَا الْجَانَّ فَاقْتُلُوهُ ‏.‏ قَالَ أَبُو لُبَابَةَ الأَنْصَارِيُّ إِنِّي\n سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ قَتْلِ الْجِنَّانِ الَّتِي تَكُونُ فِي الْبُيُوتِ إِلاَّ\n الأَبْتَرَ وَذَا الطُّفْيَتَيْنِ فَإِنَّهُمَا اللَّذَانِ يَخْطِفَانِ الْبَصَرَ وَيَتَتَبَّعَانِ مَا فِي بُطُونِ النِّسَاءِ ‏.‏",
    "malay_translation": "Dan telah menceritakan kepadaku Ishak bin Mansur, memberitakan kepada kami Muhammad bin Jahdam, menceritakan kepada kami Ismail, - iaitu menurut kami Ibn Ja'far - daripada Umar bin Nafi', daripada bapanya, katanya: Abdullah bin Umar suatu hari berada di dekat runtuhan rumahnya, lalu dia melihat kulit ular, maka dia berkata: “Kejarlah ular ini dan bunuhlah ia!” Abu Lubabah al-Ansari berkata: “Sesungguhnya aku telah mendengar Rasulullah SAW melarang membunuh ular yang terdapat di dalam rumah kecuali ular yang buntutnya pendek dan ular yang belang, kerana kedua-duanya itu yang mencuri penglihatan dan mengganggu kandungan wanita.”"
  },
  {
    "id": 12961,
    "hadith_number": 5684,
    "tajuk_hadith": "Abu Lubabah Membunuh Ular di Dekat Rumah Ibn Umar",
    "perawi_melayu": "Nafi' melalui riwayat Harun bin Said al-Ayli, Ibn Wahb, dan Usamah.",
    "english_text": "Nafi' reported that Abu Lubaba happened to pass by Ibn 'Umar who lived in the fortified place near the house of 'Umar b. Khattab and was busy in keeping his eyes upon a snake and killing it, the rest of the hadith is the same.",
    "arabic_text": "وَحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنِي أُسَامَةُ، أَنَّ نَافِعًا، حَدَّثَهُ \n أَنَّ أَبَا لُبَابَةَ مَرَّ بِابْنِ عُمَرَ وَهُوَ عِنْدَ الأُطُمِ الَّذِي عِنْدَ دَارِ عُمَرَ بْنِ الْخَطَّابِ يَرْصُدُ حَيَّةً بِنَحْوِ\n حَدِيثِ اللَّيْثِ بْنِ سَعْدٍ ‏.‏",
    "malay_translation": "Nafi' meriwayatkan bahawa Abu Lubabah telah lalu di sisi Ibn Umar. Ketika itu, Ibn Umar berada di kawasan berdinding berhampiran rumah Umar bin Khattab, sedang memerhatikan seekor ular dan membunuhnya.  Baki hadis adalah sama seperti riwayat lain."
  },
  {
    "id": 12962,
    "hadith_number": 5685,
    "tajuk_hadith": "Allah Melindungi Ular dan Para Sahabat",
    "perawi_melayu": "Abdullah melaporkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ\n - وَاللَّفْظُ لِيَحْيَى - قَالَ يَحْيَى وَإِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ \n الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَبْدِ اللَّهِ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم\n فِي غَارٍ وَقَدْ أُنْزِلَتْ عَلَيْهِ ‏{‏ وَالْمُرْسَلاَتِ عُرْفًا‏}‏ ‏.‏ فَنَحْنُ نَأْخُذُهَا مِنْ فِيهِ رَطْبَةً إِذْ خَرَجَتْ\n عَلَيْنَا حَيَّةٌ فَقَالَ ‏\"‏ اقْتُلُوهَا ‏\"‏ ‏.‏ فَابْتَدَرْنَاهَا لِنَقْتُلَهَا فَسَبَقَتْنَا فَقَالَ رَسُولُ اللَّهِ صلى الله\n عليه وسلم ‏\"‏ وَقَاهَا اللَّهُ شَرَّكُمْ كَمَا وَقَاكُمْ شَرَّهَا ‏\"‏ ‏.‏",
    "malay_translation": "Kami telah meriwayatkan daripada Yahya bin Yahya, Abu Bakar bin Abi Syaibah, Abu Kuraib dan Ishaq bin Ibrahim - dan lafaznya adalah daripada Yahya - Yahya dan Ishaq memberitakan kepada kami, dan yang lain pula berkata, telah menceritakan kepada kami Abu Muawiyah, daripada Al-A’masy, daripada Ibrahim, daripada Aswad, daripada Abdullah, katanya:  Kami berada bersama Rasulullah SAW di dalam sebuah gua, ketika itu telah diturunkan kepadanya (surah Al-Mursalat: “Demi para malaikat yang diutus dengan membawa (perintah) dengan cepat”).  Ketika kami sedang mendengar ayat-ayat tersebut daripada mulut baginda, tiba-tiba muncul seekor ular di hadapan kami. Baginda bersabda: “Bunuhlah ia!” Maka kami segera ingin membunuhnya, tetapi ia berjaya melepaskan diri. Maka Rasulullah SAW bersabda: “Allah telah melindunginya daripada kejahatan kamu, sebagaimana Allah telah melindung kamu daripada kejahatannya.”"
  },
  {
    "id": 12963,
    "hadith_number": 5686,
    "tajuk_hadith": "Sanad Hadith al-A'mash",
    "perawi_melayu": "Daripada Qotaibah bin Sa'id dan Usman bin Abi Syaibah, mereka berdua berkata:  Daripada Jarir, daripada al-A'mash",
    "english_text": "This hadith has been narrated on the authority of al-A'mash with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، قَالاَ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ،\n فِي هَذَا الإِسْنَادِ بِمِثْلِهِ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qotaibah bin Sa'id dan Usman bin Abi Syaibah, mereka berdua berkata: Telah menceritakan kepada kami Jarir, daripada al-A'mash, dalam sanad ini dengan yang serupa."
  },
  {
    "id": 12964,
    "hadith_number": 5687,
    "tajuk_hadith": "Arahan Nabi SAW membunuh ular di Mina",
    "perawi_melayu": "Abdullah",
    "english_text": "'Abdullah reported that Allah's Messenger (ﷺ) commanded a Muhrim (one who is in the state of pilgrimage) to kill the snake at Mina.",
    "arabic_text": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا حَفْصٌ، - يَعْنِي ابْنَ غِيَاثٍ - حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ،\n عَنِ الأَسْوَدِ، عَنْ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ مُحْرِمًا بِقَتْلِ حَيَّةٍ بِمِنًى\n ‏.‏",
    "malay_translation": "Abdullah meriwayatkan bahawa Rasulullah SAW memerintahkan seorang yang sedang berihram untuk membunuh seekor ular di Mina."
  },
  {
    "id": 12965,
    "hadith_number": 5688,
    "tajuk_hadith": "Di Dalam Gua Bersama Rasulullah SAW",
    "perawi_melayu": "'Abdullah meriwayatkan:",
    "english_text": "While we were with the Messenger of Allah (ﷺ) in the cave, the rest of the hadith is the same as the one narrated above.",
    "arabic_text": "وَحَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنِي إِبْرَاهِيمُ،\n عَنِ الأَسْوَدِ، عَنْ عَبْدِ اللَّهِ، قَالَ بَيْنَمَا نَحْنُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَارٍ\n ‏.‏ بِمِثْلِ حَدِيثِ جَرِيرٍ وَأَبِي مُعَاوِيَةَ ‏.‏",
    "malay_translation": "Abdullah berkata: Ketika kami berada bersama Rasulullah SAW di dalam sebuah gua, baki riwayat hadis ini adalah sama seperti hadis yang diriwayatkan di atas."
  },
  {
    "id": 12966,
    "hadith_number": 5689,
    "tajuk_hadith": "Kisah Ular dan Pemuda yang Baru Menikah di Madinah",
    "perawi_melayu": "Abu as-Sa'ib, hamba sahaya Hisyam bin Zuhrah, berkata bahawa beliau telah melawat Abu Said al-Khudri di rumahnya, (dan beliau selanjutnya) berkata:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي \n مَالِكُ بْنُ أَنَسٍ، عَنْ صَيْفِيٍّ، - وَهُوَ عِنْدَنَا مَوْلَى ابْنِ أَفْلَحَ - أَخْبَرَنِي أَبُو السَّائِبِ، مَوْلَى\n هِشَامِ بْنِ زُهْرَةَ أَنَّهُ دَخَلَ عَلَى أَبِي سَعِيدٍ الْخُدْرِيِّ فِي بَيْتِهِ قَالَ فَوَجَدْتُهُ يُصَلِّي فَجَلَسْتُ\n أَنْتَظِرُهُ حَتَّى يَقْضِيَ صَلاَتَهُ فَسَمِعْتُ تَحْرِيكًا فِي عَرَاجِينَ فِي نَاحِيَةِ الْبَيْتِ فَالْتَفَتُّ فَإِذَا\n حَيَّةٌ فَوَثَبْتُ لأَقْتُلَهَا فَأَشَارَ إِلَىَّ أَنِ اجْلِسْ ‏.‏ فَجَلَسْتُ فَلَمَّا انْصَرَفَ أَشَارَ إِلَى بَيْتٍ فِي\n الدَّارِ فَقَالَ أَتَرَى هَذَا الْبَيْتَ فَقُلْتُ نَعَمْ ‏.‏ قَالَ كَانَ فِيهِ فَتًى مِنَّا حَدِيثُ عَهْدٍ بِعُرْسٍ - قَالَ\n - فَخَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى الْخَنْدَقِ فَكَانَ ذَلِكَ الْفَتَى يَسْتَأْذِنُ رَسُولَ\n اللَّهِ صلى الله عليه وسلم بِأَنْصَافِ النَّهَارِ فَيَرْجِعُ إِلَى أَهْلِهِ فَاسْتَأْذَنَهُ يَوْمًا فَقَالَ لَهُ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\"‏ خُذْ عَلَيْكَ سِلاَحَكَ فَإِنِّي أَخْشَى عَلَيْكَ قُرَيْظَةَ ‏\"‏ ‏.‏ فَأَخَذَ الرَّجُلُ\n سِلاَحَهُ ثُمَّ رَجَعَ فَإِذَا امْرَأَتُهُ بَيْنَ الْبَابَيْنِ قَائِمَةً فَأَهْوَى إِلَيْهَا الرُّمْحَ لِيَطْعُنَهَا بِهِ وَأَصَابَتْهُ\n غَيْرَةٌ فَقَالَتْ لَهُ اكْفُفْ عَلَيْكَ رُمْحَكَ وَادْخُلِ الْبَيْتَ حَتَّى تَنْظُرَ مَا الَّذِي أَخْرَجَنِي ‏.‏ فَدَخَلَ\n فَإِذَا بِحَيَّةٍ عَظِيمَةٍ مُنْطَوِيَةٍ عَلَى الْفِرَاشِ فَأَهْوَى إِلَيْهَا بِالرُّمْحِ فَانْتَظَمَهَا بِهِ ثُمَّ خَرَجَ فَرَكَزَهُ\n فِي الدَّارِ فَاضْطَرَبَتْ عَلَيْهِ فَمَا يُدْرَى أَيُّهُمَا كَانَ أَسْرَعَ مَوْتًا الْحَيَّةُ أَمِ الْفَتَى قَالَ فَجِئْنَا\n إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرْنَا ذَلِكَ لَهُ وَقُلْنَا ادْعُ اللَّهَ يُحْيِيهِ لَنَا ‏.‏ فَقَالَ ‏\"‏\n اسْتَغْفِرُوا لِصَاحِبِكُمْ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ إِنَّ بِالْمَدِينَةِ جِنًّا قَدْ أَسْلَمُوا فَإِذَا رَأَيْتُمْ مِنْهُمْ شَيْئًا\n فَآذِنُوهُ ثَلاَثَةَ أَيَّامٍ فَإِنْ بَدَا لَكُمْ بَعْدَ ذَلِكَ فَاقْتُلُوهُ فَإِنَّمَا هُوَ شَيْطَانٌ ‏\"‏ ‏.‏",
    "malay_translation": "Aku diberitahu oleh Abu ath-Thahir, Ahmad bin Amru bin Sarh, yang telah memberitahu kami Abdullah bin Wahb, yang telah memberitahu aku Malik bin Anas, daripada Saifi – iaitu menurut kami, hamba anak Aflah – yang telah memberitahu aku Abu as-Sa'ib, hamba Hisyam bin Zuhrah, bahawa dia telah memasuki rumah Abu Said al-Khudri.  Beliau berkata, “Aku mendapati beliau sedang solat, maka aku duduk menunggunya sehingga selesai solatnya.  Aku mendengar pergerakan dalam anyaman di sudut rumah.  Aku menoleh, dan rupa-rupanya seekor ular. Aku melompat untuk membunuhnya, tetapi beliau (Abu Said al-Khudri) memberi isyarat supaya aku duduk. Maka aku duduk.  Apabila beliau selesai (solat), beliau menunjuk ke sebuah bilik di rumah dan berkata, ‘Adakah engkau nampak bilik ini?’ Aku berkata, ‘Ya.’ Beliau berkata, ‘Di dalamnya ada seorang pemuda di kalangan kami yang baru sahaja berkahwin. Kami keluar bersama Rasulullah ﷺ ke Perang Khandak. Pemuda itu selalu meminta izin kepada Rasulullah ﷺ pada tengah hari untuk pulang kepada keluarganya. Suatu hari, dia meminta izin, lalu Rasulullah ﷺ (selepas memberi izin) berkata kepadanya, ‘Bawalah senjata kamu, kerana Aku bimbang kaum Qurayzah akan membahayakan kamu.’ Lelaki itu membawa senjatanya, kemudian pulang, dan mendapati isterinya berdiri di antara dua pintu.  Dia menghala tombaknya ke arah isterinya untuk menikamnya kerana cemburu. Isterinya berkata, ‘Tarik tombakmu dan masuk ke rumah, sehingga engkau lihat apa yang menyebabkan aku keluar.’ Dia masuk, lalu mendapati seekor ular besar melilit katil. Dia menghala tombaknya ke arah ular dan menikamnya, kemudian keluar dan menancapkan tombak itu di rumah. Ular itu menggeliat dan menyerang lelaki itu. Tiada siapa tahu siapakah yang mati dahulu, ular atau pemuda itu. Kami datang kepada Rasulullah ﷺ dan menceritakan hal itu, dan kami berkata, ‘Berdoalah kepada Allah agar dia dihidupkan kembali.’ Baginda berkata, ‘Mohonkan keampunan untuk sahabat kamu.’ Kemudian Baginda berkata, ‘Sesungguhnya di Madinah terdapat jin yang telah memeluk Islam.  Apabila kamu melihat salah seorang dari mereka, beri amaran kepadanya selama tiga hari. Jika ia muncul selepas itu, bunuhlah ia, kerana ia hanyalah syaitan.’"
  },
  {
    "id": 12967,
    "hadith_number": 5690,
    "tajuk_hadith": "Ular di Rumah dan Hukum Membunuhnya",
    "perawi_melayu": "Asma' binti Ubaid meriwayatkan daripada seorang lelaki yang dikenali sebagai As-Sa'ib yang berkata:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرِ بْنِ حَازِمٍ، حَدَّثَنَا أَبِي قَالَ، سَمِعْتُ \n أَسْمَاءَ بْنَ عُبَيْدٍ، يُحَدِّثُ عَنْ رَجُلٍ، يُقَالُ لَهُ السَّائِبُ - وَهُوَ عِنْدَنَا أَبُو السَّائِبِ - قَالَ دَخَلْنَا\n عَلَى أَبِي سَعِيدٍ الْخُدْرِيِّ فَبَيْنَمَا نَحْنُ جُلُوسٌ إِذْ سَمِعْنَا تَحْتَ، سَرِيرِهِ حَرَكَةً فَنَظَرْنَا فَإِذَا\n حَيَّةٌ ‏.‏ وَسَاقَ الْحَدِيثَ بِقِصَّتِهِ نَحْوَ حَدِيثِ مَالِكٍ عَنْ صَيْفِيٍّ وَقَالَ فِيهِ فَقَالَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم ‏\"‏ إِنَّ لِهَذِهِ الْبُيُوتِ عَوَامِرَ فَإِذَا رَأَيْتُمْ شَيْئًا مِنْهَا فَحَرِّجُوا عَلَيْهَا ثَلاَثًا\n فَإِنْ ذَهَبَ وَإِلاَّ فَاقْتُلُوهُ فَإِنَّهُ كَافِرٌ ‏\"‏ ‏.‏ وَقَالَ لَهُمُ ‏\"‏ اذْهَبُوا فَادْفِنُوا صَاحِبَكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Muhammad bin Rafi' meriwayatkan daripada Wahb bin Jarir bin Hazim, yang meriwayatkan daripada bapanya yang berkata, “Aku mendengar Asma' binti Ubaid meriwayatkan daripada seorang lelaki yang dipanggil As-Sa'ib – iaitu Abu As-Sa'ib menurut kami – yang berkata, ‘Kami telah melawat Abu Said Al-Khudri. Ketika kami sedang duduk bersamanya, kami terdengar bunyi bising di bawah katilnya. Kami melihat dan mendapati seekor ular besar.’ Kemudian beliau meneruskan riwayat tersebut sepertimana riwayat Malik daripada Saifi, dan menyebut di dalamnya bahawa Rasulullah SAW telah bersabda:  “Sesungguhnya di rumah-rumah ini terdapat ular-ular tua. Maka jika kamu melihat sebarang jenis ular, maka halaulah ia selama tiga hari. Jika ia pergi, maka baiklah. Jika tidak, bunuhlah ia kerana ia adalah kafir.” Dan baginda bersabda kepada mereka, “Pergilah dan kebumikan sahabat kamu.”"
  },
  {
    "id": 12968,
    "hadith_number": 5691,
    "tajuk_hadith": "Jin Muslim di Madinah",
    "perawi_melayu": "Abu Said al-Khudri meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There is a group of jinns in Medina who accepted Islam, so he who would see anything from these occupants should warn him three times; and if he appears after that, he should kill him for he is a satan.",
    "arabic_text": "وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ عَجْلاَنَ، حَدَّثَنِي صَيْفِيٌّ،\n عَنْ أَبِي السَّائِبِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ سَمِعْتُهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم ‏\n\"‏ إِنَّ بِالْمَدِينَةِ نَفَرًا مِنَ الْجِنِّ قَدْ أَسْلَمُوا فَمَنْ رَأَى شَيْئًا مِنْ هَذِهِ الْعَوَامِرِ فَلْيُؤْذِنْهُ\n ثَلاَثًا فَإِنْ بَدَا لَهُ بَعْدُ فَلْيَقْتُلْهُ فَإِنَّهُ شَيْطَانٌ ‏\"‏ ‏.‏",
    "malay_translation": "Sesungguhnya di Madinah terdapat sekumpulan jin yang telah memeluk Islam.  Oleh itu, barang siapa yang melihat sesuatu daripada makhluk-makhluk ini, hendaklah memberi amaran kepadanya sebanyak tiga kali. Jika ia masih muncul selepas itu, hendaklah dibunuhnya kerana ia adalah syaitan."
  },
  {
    "id": 12969,
    "hadith_number": 5692,
    "tajuk_hadith": "Arahan Nabi SAW untuk membunuh cicak",
    "perawi_melayu": "Umm Sharik melalui beberapa perawi seperti Ibn Abi Shaiba, Amru al-Naqid, Ishaq ibn Ibrahim, dan Ibn Abi Umar.",
    "english_text": "Umm Sharik reported that Allah's Messenger (ﷺ) commanded her to kill geckos. This hadith has been transmitted on the authority of Ibn Abi Shaiba with a slight variation of wording.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ،\n قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَبْدِ الْحَمِيدِ بْنِ جُبَيْرِ،\n بْنِ شَيْبَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أُمِّ شَرِيكٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَهَا بِقَتْلِ\n الأَوْزَاغِ ‏.‏ وَفِي حَدِيثِ ابْنِ أَبِي شَيْبَةَ أَمَرَ ‏.‏",
    "malay_translation": "Umm Sharik meriwayatkan bahawa Rasulullah SAW memerintahkannya untuk membunuh cicak.  Hadis ini diriwayatkan daripada Ibn Abi Shaiba dengan sedikit perbezaan lafaz."
  },
  {
    "id": 12970,
    "hadith_number": 5693,
    "tajuk_hadith": "Hukum Membunuh Cicak",
    "perawi_melayu": "Daripada beberapa riwayat melalui beberapa jalan sanad yang berbeza, antaranya daripada Abu Thahir, Ibn Wahb, Ibn Juraij, Muhammad bin Ahmad bin Abi Khalaf, Ruh, Abd bin Humaid, Muhammad bin Bakar, Abd al-Hamid bin Jubair bin Syabah, dan Said bin Musayyab.",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي ابْنُ جُرَيْجٍ، ح وَحَدَّثَنِي مُحَمَّدُ،\n بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ حَدَّثَنَا رَوْحٌ، حَدَّثَنَا ابْنُ جُرَيْجٍ، ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا \n مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَبْدُ الْحَمِيدِ بْنُ جُبَيْرِ بْنِ شَيْبَةَ، أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ،\n أَخْبَرَهُ أَنَّ أُمَّ شَرِيكٍ أَخْبَرَتْهُ أَنَّهَا، اسْتَأْمَرَتِ النَّبِيَّ صلى الله عليه وسلم فِي قَتْلِ الْوِزْغَانِ\n فَأَمَرَ بِقَتْلِهَا ‏.‏ وَأُمُّ شَرِيكٍ إِحْدَى نِسَاءِ بَنِي عَامِرِ بْنِ لُؤَىٍّ ‏.‏ اتَّفَقَ لَفْظُ حَدِيثِ ابْنِ أَبِي خَلَفٍ\n وَعَبْدِ بْنِ حُمَيْدٍ وَحَدِيثُ ابْنِ وَهْبٍ قَرِيبٌ مِنْهُ ‏.‏",
    "malay_translation": "Aku telah diberitahu oleh Abu Thahir, yang memberitahu kami daripada Ibn Wahb, yang memberitahu aku daripada Ibn Juraij, dan aku telah diberitahu oleh Muhammad bin Ahmad bin Abi Khalaf, yang memberitahu kami daripada Ruh, yang memberitahu kami daripada Ibn Juraij, dan kami telah diberitahu oleh Abd bin Humaid, yang memberitahu kami daripada Muhammad bin Bakar, yang memberitahu kami daripada Ibn Juraij, yang memberitahu aku daripada Abd al-Hamid bin Jubair bin Syabah, bahawa Said bin Musayyab telah memberitahunya bahawa Umm Syarik telah memberitahunya bahawa dia telah bertanya kepada Nabi ﷺ tentang membunuh cicak, maka baginda memerintahkan untuk membunuhnya. Dan Umm Syarik adalah salah seorang wanita daripada Bani Amir bin Luai. Lafadz hadith daripada Ibn Abi Khalaf dan Abd bin Humaid adalah sama, dan hadith Ibn Wahb hampir sama maksudnya."
  },
  {
    "id": 12971,
    "hadith_number": 5694,
    "tajuk_hadith": "Arahan untuk Membunuh Cicak",
    "perawi_melayu": "Amir bin Sa’d melalui bapanya",
    "english_text": "'Amir b. Sa'd reported on the authority of his father that Allah's Apostle (ﷺ) commanded the killing of geckos, and he called them little noxious creatures.",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالاَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ،\n عَنِ الزُّهْرِيِّ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَ بِقَتْلِ الْوَزَغِ\n وَسَمَّاهُ فُوَيْسِقًا ‏.‏",
    "malay_translation": "Amir bin Sa’d meriwayatkan daripada bapanya bahawa Rasulullah SAW memerintahkan untuk membunuh cicak dan Baginda menamakannya sebagai haiwan kecil yang membahayakan."
  },
  {
    "id": 12972,
    "hadith_number": 5695,
    "tajuk_hadith": "Rasulullah SAW dan Cicak",
    "perawi_melayu": "Aisyah, melalui beberapa perawi seperti Urwah, Zuhri, Yunus, Ibn Wahb, Abu Thahir dan Harmalah.",
    "english_text": "I did not hear that he had commanded to kill them.",
    "arabic_text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ الزُّهْرِيِّ،\n عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لِلْوَزَغِ ‏\n\"‏ الْفُوَيْسِقُ ‏\"‏ ‏.‏\n زَادَ حَرْمَلَةُ قَالَتْ وَلَمْ أَسْمَعْهُ أَمَرَ بِقَتْلِهِ ‏.‏",
    "malay_translation": "Abu Thahir dan Harmalah meriwayatkan daripada Ibn Wahb, yang meriwayatkan daripada Yunus, daripada Zuhri, daripada Urwah, daripada Aisyah bahawa Rasulullah SAW bersabda tentang cicak (sebagai haiwan yang menjijikkan),  \"al-fuwasik\".  Harmalah menambah: \"Dan aku tidak pernah mendengar baginda memerintahkan untuk membunuhnya.\""
  },
  {
    "id": 12973,
    "hadith_number": 5696,
    "tajuk_hadith": "Ganjaran Membunuh Cicak",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "He who killed a gecko with the first stroke for him is such and such a reward, and he who killed it with a second stroke for him is such and such reward less than the first one, and he who killed it with the third stroke for him is such and such a reward less than the second one.",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي،\n هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ قَتَلَ وَزَغَةً فِي أَوَّلِ ضَرْبَةٍ فَلَهُ\n كَذَا وَكَذَا حَسَنَةً وَمَنْ قَتَلَهَا فِي الضَّرْبَةِ الثَّانِيَةِ فَلَهُ كَذَا وَكَذَا حَسَنَةً لِدُونِ الأُولَى وَإِنْ قَتَلَهَا\n فِي الضَّرْبَةِ الثَّالِثَةِ فَلَهُ كَذَا وَكَذَا حَسَنَةً لِدُونِ الثَّانِيَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa membunuh cicak dengan satu pukulan, maka baginya ganjaran sekian-sekian pahala. Dan barangsiapa membunuhnya dengan pukulan kedua, maka baginya ganjaran sekian-sekian pahala yang kurang daripada yang pertama. Dan barangsiapa membunuhnya dengan pukulan ketiga, maka baginya sekian-sekian pahala yang kurang daripada yang kedua."
  },
  {
    "id": 12974,
    "hadith_number": 5697,
    "tajuk_hadith": "Pahala Membunuh Cicak",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Abu Hurairah melalui beberapa sanad yang lain (dan lafaznya ialah):",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ،\n ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ زَكَرِيَّاءَ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ،\n حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، كُلُّهُمْ عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله\n عليه وسلم ‏.‏ بِمَعْنَى حَدِيثِ خَالِدٍ عَنْ سُهَيْلٍ إِلاَّ جَرِيرًا وَحْدَهُ فَإِنَّ فِي حَدِيثِهِ ‏\n\"‏ مَنْ قَتَلَ\n وَزَغًا فِي أَوَّلِ ضَرْبَةٍ كُتِبَتْ لَهُ مِائَةُ حَسَنَةٍ وَفِي الثَّانِيَةِ دُونَ ذَلِكَ وَفِي الثَّالِثَةِ دُونَ ذَلِكَ\n ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa membunuh cicak pada cubaan pertama, maka ditulis baginya seratus kebaikan, dan pada cubaan kedua kurang daripada itu, dan pada cubaan ketiga kurang daripada itu."
  },
  {
    "id": 12975,
    "hadith_number": 5698,
    "tajuk_hadith": "Ganjaran Membunuh Cicak",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying (that he who kills a gecko) with the first stroke there are seventy rewards for him.",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ زَكَرِيَّاءَ، عَنْ سُهَيْلٍ، حَدَّثَتْنِي \n أُخْتِي، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ فِي أَوَّلِ ضَرْبَةٍ سَبْعِينَ\n حَسَنَةً ‏\"‏ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda: \"Sesiapa yang membunuh cicak dengan pukulan pertama, maka baginya tujuh puluh pahala.\" "
  },
  {
    "id": 12976,
    "hadith_number": 5699,
    "tajuk_hadith": "Kisah Nabi dan Semut",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "An ant had bitten a Prophet (one amongst the earlier Prophets) and he ordered that the colony of the ants should be burnt. And Allah revealed to him:\" Because of an ant's bite you have burnt a community from amongst the communities which sings My glory.\"",
    "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ،\n عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ، عَنْ \n رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَنَّ نَمْلَةً قَرَصَتْ نَبِيًّا مِنَ الأَنْبِيَاءِ فَأَمَرَ بِقَرْيَةِ النَّمْلِ\n فَأُحْرِقَتْ فَأَوْحَى اللَّهُ إِلَيْهِ أَفِي أَنْ قَرَصَتْكَ نَمْلَةٌ أَهْلَكْتَ أُمَّةً مِنَ الأُمَمِ تُسَبِّحُ ‏\"‏ ‏.‏",
    "malay_translation": "Seekor semut telah menggigit seorang Nabi (dari kalangan Nabi-nabi terdahulu), lalu baginda memerintahkan agar sarang semut itu dibakar.  Kemudian Allah SWT mewahyukan kepadanya: \"Kerana gigitan seekor semut, engkau telah membinasakan satu umat daripada umat-umat yang bertasbih memuji-Mu.\""
  },
  {
    "id": 12977,
    "hadith_number": 5700,
    "tajuk_hadith": "Kisah Nabi yang Membakar Pokok Kerana Semut",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "An Apostle from amongst the Apostles of Allah encamped under a tree, and an ant bit him, and he commanded his belongings to be removed from underneath the tree. He then commanded and it was burnt, and Allah revealed to bin):\" Why one ant (which had bitten you) was not killed?\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا الْمُغِيرَةُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْحِزَامِيَّ - عَنْ \n أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ نَزَلَ نَبِيٌّ\n مِنَ الأَنْبِيَاءِ تَحْتَ شَجَرَةٍ فَلَدَغَتْهُ نَمْلَةٌ فَأَمَرَ بِجِهَازِهِ فَأُخْرِجَ مِنْ تَحْتِهَا ثُمَّ أَمَرَ بِهَا فَأُحْرِقَتْ\n فَأَوْحَى اللَّهُ إِلَيْهِ فَهَلاَّ نَمْلَةً وَاحِدَةً ‏\"‏ ‏.‏",
    "malay_translation": "Seorang nabi daripada kalangan nabi-nabi Allah berlindung di bawah sebatang pokok.  Seekor semut menggigitnya, lalu baginda memerintahkan barang-barangnya dikeluarkan dari bawah pokok itu. Kemudian baginda memerintahkan supaya pokok itu dibakar. Allah SWT berfirman kepadanya: \"Mengapa engkau tidak membunuh hanya seekor semut itu?\"."
  },
  {
    "id": 12978,
    "hadith_number": 5701,
    "tajuk_hadith": "Kisah Nabi dan Semut",
    "perawi_melayu": "Abu Hurairah meriwayatkan beberapa hadis, dan salah satunya ialah Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ\n هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ نَزَلَ نَبِيٌّ مِنَ الأَنْبِيَاءِ تَحْتَ شَجَرَةٍ فَلَدَغَتْهُ نَمْلَةٌ فَأَمَرَ\n بِجِهَازِهِ فَأُخْرِجَ مِنْ تَحْتِهَا وَأَمَرَ بِهَا فَأُحْرِقَتْ فِي النَّارِ - قَالَ - فَأَوْحَى اللَّهُ إِلَيْهِ فَهَلاَّ\n نَمْلَةً وَاحِدَةً ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Rafi', telah menceritakan kepada kami Abdur Razzaq, telah memberitakan kepada kami Ma'mar, daripada Hammam bin Munabbih, katanya:\nIni adalah apa yang telah menceritakan kepada kami Abu Hurairah, daripada Rasulullah SAW. Kemudian dia menyebut beberapa hadis antaranya dan berkata:\nRasulullah SAW bersabda: \"Seorang nabi daripada kalangan nabi-nabi telah duduk di bawah sebatang pokok, lalu seekor semut menggigitnya. Maka dia menyuruh barang-barangnya dikeluarkan dari bawah pokok itu, dan dia menyuruh membakarnya dalam api.  Allah SWT mewahyukan kepadanya: Mengapa tidak diseksa seekor semut sahaja?\"."
  },
  {
    "id": 12979,
    "hadith_number": 5702,
    "tajuk_hadith": "Seorang Wanita Diseksa Kerana Mengurung Kucing",
    "perawi_melayu": "Nafi' meriwayatkan daripada Abdullah bahawa Rasulullah SAW bersabda:",
    "english_text": "A woman was punished because she had kept a cat tied until it died, and (as a punishment of this offence) she was thrown into the Hell. She had not provided it with food, or drink, and had not freed her so that she could eat the vermin of the earth.",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ الضُّبَعِيُّ، حَدَّثَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ، عَنْ نَافِعٍ،\n عَنْ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ عُذِّبَتِ امْرَأَةٌ فِي هِرَّةٍ سَجَنَتْهَا\n حَتَّى مَاتَتْ فَدَخَلَتْ فِيهَا النَّارَ لاَ هِيَ أَطْعَمَتْهَا وَسَقَتْهَا إِذْ حَبَسَتْهَا وَلاَ هِيَ تَرَكَتْهَا تَأْكُلُ\n مِنْ خَشَاشِ الأَرْضِ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang wanita telah diseksa kerana mengurung seekor kucing sehingga ia mati, lalu dia dimasukkan ke dalam neraka. Dia tidak memberi makan dan minum kepada kucing itu, dan tidak juga melepaskannya supaya ia boleh memakan serangga di bumi."
  },
  {
    "id": 12980,
    "hadith_number": 5703,
    "tajuk_hadith": "Sanad Hadis daripada Abu Hurairah",
    "perawi_melayu": "Hadis ini diriwayatkan melalui beberapa sanad daripada Abu Hurairah.",
    "english_text": "This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنِي نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ \n نَافِعٍ، عَنِ ابْنِ عُمَرَ، وَعَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم\n بِمِثْلِ مَعْنَاهُ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan oleh Nasr bin Ali al-Jahdami daripada Abd al-A'la, daripada Ubaidullah bin Umar, daripada Nafi', daripada Ibn Umar, dan daripada Sa'id al-Maqburi, daripada Abu Hurairah, daripada Nabi SAW dengan maksud yang sama."
  },
  {
    "id": 12981,
    "hadith_number": 5704,
    "tajuk_hadith": "Hadis daripada Ibnu Umar",
    "perawi_melayu": "Harun bin Abdullah dan Abdullah bin Ja'far meriwayatkan daripada Ma'n bin Isa, daripada Malik, daripada Nafi', daripada Ibnu Umar, daripada Nabi SAW.",
    "english_text": "This hadith has been transmitted on the authority of Ibn 'Umar also.",
    "arabic_text": "وَحَدَّثَنَاهُ هَارُونُ بْنُ عَبْدِ اللَّهِ، وَعَبْدُ اللَّهِ بْنُ جَعْفَرٍ، عَنْ مَعْنِ بْنِ عِيسَى، عَنْ مَالِكٍ،\n عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِذَلِكَ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Ibnu Umar."
  },
  {
    "id": 12982,
    "hadith_number": 5705,
    "tajuk_hadith": "Azab Kerana Menyiksa Kucing",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "A woman was punished because of a cat. She had neither provided her with food nor drink, nor set her free so that she might eat the vermin of the earth.",
    "arabic_text": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ\n اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ عُذِّبَتِ امْرَأَةٌ فِي هِرَّةٍ لَمْ تُطْعِمْهَا وَلَمْ تَسْقِهَا وَلَمْ تَتْرُكْهَا\n تَأْكُلُ مِنْ خَشَاشِ الأَرْضِ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang wanita telah diazab disebabkan seekor kucing.  Dia tidak memberinya makan dan minum, dan tidak juga melepaskannya supaya ia boleh memakan serangga di bumi."
  },
  {
    "id": 12983,
    "hadith_number": 5706,
    "tajuk_hadith": "Perbezaan Ringkas Perawi Hadis",
    "perawi_melayu": "Hisham dan lain-lain",
    "english_text": "This hadith has been narrated on the authority of Hisham with the same chain of transmitters, but with a slight variation of wording.",
    "arabic_text": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا خَالِدُ،\n بْنُ الْحَارِثِ حَدَّثَنَا هِشَامٌ، بِهَذَا الإِسْنَادِ وَفِي حَدِيثِهِمَا ‏\"‏ رَبَطَتْهَا ‏\"‏ ‏.‏ وَفِي حَدِيثِ أَبِي مُعَاوِيَةَ\n ‏\"‏ حَشَرَاتِ الأَرْضِ ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Hisham dengan sanad yang sama, tetapi dengan sedikit perbezaan lafaz.  Riwayat lain menyebut “ربطتها (rabbat-ha)” manakala riwayat Abu Muawiyah menyebut “حشرات الأرض (hasharat al-ardh)”. "
  },
  {
    "id": 12984,
    "hadith_number": 5707,
    "tajuk_hadith": "Sanad Hadis daripada Abu Hurairah",
    "perawi_melayu": "Muhammad bin Rafi', Abd bin Humaid, Abdurrazzaq, Ma'mar, Zuhri, dan Humaid bin Abdurrahman; daripada Abu Hurairah daripada Rasulullah SAW.",
    "english_text": "Abu Huraira reported this hadith through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ عَبْدٌ أَخْبَرَنَا وَقَالَ ابْنُ رَافِعٍ، حَدَّثَنَا \n عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، قَالَ قَالَ الزُّهْرِيُّ وَحَدَّثَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ،\n عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم بِمَعْنَى حَدِيثِ هِشَامِ بْنِ عُرْوَةَ ‏.‏",
    "malay_translation": "Muhammad bin Rafi' dan Abd bin Humaid meriwayatkan hadis ini. Abd berkata, “Kami diberitakan,” dan Ibn Rafi' berkata, “Kami diberitakan oleh Abdurrazzaq. Ma'mar memberitakan kepada kami, katanya, Zuhri berkata…” Humaid bin Abdurrahman meriwayatkan kepadaku daripada Abu Hurairah daripada Rasulullah SAW. (dengan makna yang sama seperti hadis daripada Hisyam bin Urwah)."
  },
  {
    "id": 12985,
    "hadith_number": 5708,
    "tajuk_hadith": "Hadis daripada Abu Hurairah",
    "perawi_melayu": "Hammam bin Munabbih meriwayatkan hadis ini daripada Abu Hurairah.",
    "english_text": "Hammam b. Manabbih reported this hadith on the authority of Abu Huraira.",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ \n أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَ حَدِيثِهِمْ ‏.‏",
    "malay_translation": "Muhammad bin Rafi' meriwayatkan daripada Abdur Razzaq, yang diberitakan oleh Ma'mar daripada Hammam bin Munabbih, daripada Abu Hurairah, daripada Nabi SAW, lebih kurang seperti riwayat mereka."
  },
  {
    "id": 12986,
    "hadith_number": 5709,
    "tajuk_hadith": "Pahala Menolong Haiwan",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، فِيمَا قُرِئَ عَلَيْهِ عَنْ سُمَىٍّ، مَوْلَى أَبِي\n بَكْرٍ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏\n بَيْنَمَا رَجُلٌ يَمْشِي بِطَرِيقٍ اشْتَدَّ عَلَيْهِ الْعَطَشُ فَوَجَدَ بِئْرًا فَنَزَلَ فِيهَا فَشَرِبَ ثُمَّ خَرَجَ فَإِذَا\n كَلْبٌ يَلْهَثُ يَأْكُلُ الثَّرَى مِنَ الْعَطَشِ فَقَالَ الرَّجُلُ لَقَدْ بَلَغَ هَذَا الْكَلْبَ مِنَ الْعَطَشِ مِثْلُ الَّذِي\n كَانَ بَلَغَ مِنِّي ‏.‏ فَنَزَلَ الْبِئْرَ فَمَلأَ خُفَّهُ مَاءً ثُمَّ أَمْسَكَهُ بِفِيهِ حَتَّى رَقِيَ فَسَقَى الْكَلْبَ فَشَكَرَ\n اللَّهُ لَهُ فَغَفَرَ لَهُ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَإِنَّ لَنَا فِي هَذِهِ الْبَهَائِمِ لأَجْرًا فَقَالَ ‏\"‏ فِي كُلِّ\n كَبِدٍ رَطْبَةٍ أَجْرٌ ‏\"‏ ‏.‏",
    "malay_translation": "Dikisahkan bahawa seorang lelaki sedang berjalan di jalan, lalu dia merasa dahaga yang amat sangat. Dia menjumpai sebuah perigi, lalu dia turun dan minum. Kemudian dia keluar, lalu dia melihat seekor anjing yang sedang menjelirkan lidah kerana dahaga dan memakan tanah yang lembap. Lelaki itu berkata, “Anjing ini juga mengalami dahaga yang sama seperti yang aku alami.”  Lalu dia turun ke dalam perigi, mengisi kasutnya dengan air, kemudian memegangnya di mulutnya sehingga dia naik dan memberi anjing itu minum.  Maka Allah S.W.T.  menghargai perbuatannya dan mengampunkannya.  (Para sahabat bertanya), “Wahai Rasulullah, adakah bagi kami pahala dalam melayani haiwan sebegini?”  Baginda menjawab, “Ya, terdapat pahala dalam setiap makhluk yang bernyawa.”"
  },
  {
    "id": 12987,
    "hadith_number": 5710,
    "tajuk_hadith": "Pengampunan untuk Wanita Pelacur yang Memberi Minum kepada Anjing",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "A prostitute saw a dog moving around a well on a hot day and hanging out its tongue because of thirst. She drew water for it in her shoe and she was pardoned (for this act of hers).",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ هِشَامٍ، عَنْ مُحَمَّدٍ، عَنْ \n أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\n\"‏ أَنَّ امْرَأَةً بَغِيًّا رَأَتْ كَلْبًا فِي يَوْمٍ حَارٍّ يُطِيفُ\n بِبِئْرٍ قَدْ أَدْلَعَ لِسَانَهُ مِنَ الْعَطَشِ فَنَزَعَتْ لَهُ بِمُوقِهَا فَغُفِرَ لَهَا ‏\"‏ ‏.‏",
    "malay_translation": "Seorang wanita pelacur melihat seekor anjing di hari yang panas sedang berjalan di sekitar perigi, lidahnya terjuntai kerana dahaga.  Lalu wanita itu mencedok air untuk anjing itu dengan kasutnya, maka dia diampunkan (kerana perbuatannya itu)."
  },
  {
    "id": 12988,
    "hadith_number": 5711,
    "tajuk_hadith": "Pengampunan kerana memberi minum kepada anjing",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There was a dog moving around a well whom thirst would have killed. Suddenly a prostitute from the prostitutes of Bani Isra'il happened to see it and she drew water in her shoe and made it drink, and she was pardoned because of this.",
    "arabic_text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي جَرِيرُ بْنُ حَازِمٍ، عَنْ \n أَيُّوبَ السَّخْتِيَانِيِّ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله\n عليه وسلم ‏\n\"‏ بَيْنَمَا كَلْبٌ يُطِيفُ بِرَكِيَّةٍ قَدْ كَادَ يَقْتُلُهُ الْعَطَشُ إِذْ رَأَتْهُ بَغِيٌّ مِنْ بَغَايَا بَنِي\n إِسْرَائِيلَ فَنَزَعَتْ مُوقَهَا فَاسْتَقَتْ لَهُ بِهِ فَسَقَتْهُ إِيَّاهُ فَغُفِرَ لَهَا بِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Pada suatu ketika, seekor anjing sedang mengelilingi sebuah perigi, hampir mati akibat dahaga. Tiba-tiba, seorang pelacur daripada kalangan pelacur Bani Israel melihatnya.  Lalu, dia mencedok air dengan kasutnya dan memberi minum kepada anjing itu.  Dia telah diampunkan dosa-dosanya kerana perbuatan itu."
  }
]
