[
  {
    "id": 14606,
    "hadith_number": 7329,
    "tajuk_hadith": "Kisah Bani Israel dan Pengampunan Dosa",
    "perawi_melayu": "Hammim bin Munabbih meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ قِيلَ لِبَنِي إِسْرَائِيلَ ‏{‏ ادْخُلُوا الْبَابَ سُجَّدًا وَقُولُوا حِطَّةٌ يُغْفَرْ لَكُمْ خَطَايَاكُمْ‏}‏ فَبَدَّلُوا فَدَخَلُوا الْبَابَ يَزْحَفُونَ عَلَى أَسْتَاهِهِمْ وَقَالُوا حَبَّةٌ فِي شَعَرَةٍ\"‏ ‏.‏",
    "malay_translation": "Muhammad bin Rafi' meriwayatkan daripada Abdurrazzaq, meriwayatkan daripada Ma'mar, daripada Hammam bin Munabbih, katanya: Ini yang diriwayatkan oleh Abu Hurairah daripada Rasulullah SAW.  Kemudian baginda menyebut beberapa hadis di antaranya, dan sabda Rasulullah SAW:\n\n\"Dikatakan kepada Bani Israel: \"Masukilah pintu itu sambil sujud dan ucapkanlah 'Hittah' (Hilangkanlah beban dosa kami), nescaya dosa-dosa kamu akan diampunkan.\"  Tetapi mereka mengubahnya, lalu mereka memasuki pintu itu sambil merangkak  dengan punggung dan berkata: \"Sebutir bijian di dalam sehelai rambut.\""
  },
  {
    "id": 14607,
    "hadith_number": 7330,
    "tajuk_hadith": "Wahyu Berterusan Sebelum Kemangkatan Rasulullah SAW",
    "perawi_melayu": "Amru bin Muhammad bin Bukhair An-Naqid, Al-Hasan bin Ali Al-Hulwani, dan Abd bin Humaid meriwayatkan daripada Ya’qub bin Ibrahim bin Saad daripada bapanya, daripada Shalih bin Kaisan daripada Ibnu Syihab. Ibnu Syihab berkata bahawa Anas bin Malik telah memberitahu bahawa...",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي عَمْرُو بْنُ مُحَمَّدِ بْنِ بُكَيْرٍ النَّاقِدُ، وَالْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ، حُمَيْدٍ - قَالَ عَبْدٌ حَدَّثَنِي وَقَالَ الآخَرَانِ، حَدَّثَنَا يَعْقُوبُ، - يَعْنُونَ ابْنَ إِبْرَاهِيمَ بْنِ سَعْدٍ - حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، - وَهُوَ ابْنُ كَيْسَانَ - عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَنَسُ بْنُ، مَالِكٍ أَنَّ اللَّهَ، عَزَّ وَجَلَّ تَابَعَ الْوَحْىَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَبْلَ وَفَاتِهِ حَتَّى تُوُفِّيَ وَأَكْثَرُ مَا كَانَ الْوَحْىُ يَوْمَ تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Amru bin Muhammad bin Bukhair An-Naqid, Al-Hasan bin Ali Al-Hulwani, dan Abd bin Humaid meriwayatkan daripada Ya’qub bin Ibrahim bin Saad daripada bapanya, daripada Shalih bin Kaisan daripada Ibnu Syihab. Ibnu Syihab berkata bahawa Anas bin Malik telah memberitahu bahawa Allah SWT terus mewahyukan wahyu kepada Rasulullah SAW sebelum kewafatan baginda sehingga baginda wafat. Dan wahyu itu paling banyak diterima pada hari Rasulullah SAW wafat."
  },
  {
    "id": 14608,
    "hadith_number": 7331,
    "tajuk_hadith": "Ayat Penyempurnaan Agama di Arafah",
    "perawi_melayu": "Tariq bin Syihab meriwayatkan bahawa seorang Yahudi berkata kepada Umar:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي أَبُو خَيْثَمَةَ، زُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، - وَهُوَ ابْنُ مَهْدِيٍّ - حَدَّثَنَا سُفْيَانُ، عَنْ قَيْسِ بْنِ مُسْلِمٍ، عَنْ طَارِقِ، بْنِ شِهَابٍ أَنَّ الْيَهُودَ، قَالُوا لِعُمَرَ إِنَّكُمْ تَقْرَءُونَ آيَةً لَوْ أُنْزِلَتْ فِينَا لاَتَّخَذْنَا ذَلِكَ الْيَوْمَ عِيدًا ‏.‏ فَقَالَ عُمَرُ إِنِّي لأَعْلَمُ حَيْثُ أُنْزِلَتْ وَأَىَّ يَوْمٍ أُنْزِلَتْ وَأَيْنَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَيْثُ أُنْزِلَتْ أُنْزِلَتْ بِعَرَفَةَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم وَاقِفٌ بِعَرَفَةَ ‏.‏ قَالَ سُفْيَانُ أَشُكُّ كَانَ يَوْمَ جُمُعَةٍ أَمْ لاَ ‏.‏ يَعْنِي ‏{‏ الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي‏}‏",
    "malay_translation": "Abu Khaitsamah, Zuhair bin Harb dan Muhammad bin Muthanna – lafaz daripada Ibn Muthanna – berkata: Mereka berdua meriwayatkan daripada Abdul Rahman – iaitu Ibn Mahdi – meriwayatkan daripada Sufyan, daripada Kais bin Muslim, daripada Tariq bin Syihab bahawa orang-orang Yahudi berkata kepada Umar: “Sesungguhnya kamu membaca satu ayat, sekiranya ayat itu diturunkan kepada kami, nescaya kami menjadikan hari itu sebagai hari raya.” Maka Umar berkata: “Sesungguhnya aku mengetahui di mana ayat itu diturunkan, pada hari apa ia diturunkan dan di mana Rasulullah SAW berada ketika ayat itu diturunkan. Ayat itu diturunkan di Arafah dan Rasulullah SAW sedang berada di Arafah.” Sufyan berkata: “Aku ragu-ragu, adakah ia pada hari Jumaat atau tidak.” Maksudnya ayat: {Pada hari ini Aku telah menyempurnakan agama kamu untuk kamu dan Aku telah menyempurnakan nikmat-Ku ke atas kamu.}"
  },
  {
    "id": 14609,
    "hadith_number": 7332,
    "tajuk_hadith": "Wahyu Ayat Kemajuan Agama Islam di Arafah",
    "perawi_melayu": "Tariq bin Syihab melaporkan bahawa seorang Yahudi berkata kepada Umar:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لأَبِي بَكْرٍ - قَالَ حَدَّثَنَا عَبْدُ، اللَّهِ بْنُ إِدْرِيسَ عَنْ أَبِيهِ، عَنْ قَيْسِ بْنِ مُسْلِمٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، قَالَ قَالَتِ الْيَهُودُ لِعُمَرَ لَوْ عَلَيْنَا مَعْشَرَ يَهُودَ نَزَلَتْ هَذِهِ الآيَةُ ‏{‏ الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمُ الإِسْلاَمَ دِينًا‏}‏ نَعْلَمُ الْيَوْمَ الَّذِي أُنْزِلَتْ فِيهِ لاَتَّخَذْنَا ذَلِكَ الْيَوْمَ عِيدًا ‏.‏ قَالَ فَقَالَ عُمَرُ فَقَدْ عَلِمْتُ الْيَوْمَ الَّذِي أُنْزِلَتْ فِيهِ وَالسَّاعَةَ وَأَيْنَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ نَزَلَتْ نَزَلَتْ لَيْلَةَ جَمْعٍ وَنَحْنُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِعَرَفَاتٍ ‏.‏",
    "malay_translation": "Abu Bakar bin Abi Syaibah dan Abu Kuraib meriwayatkan - dan lafaz daripada Abu Bakar - bahawa Abdullah bin Idris meriwayatkan daripada bapanya, daripada Qais bin Muslim, daripada Tariq bin Syihab, katanya: Orang-orang Yahudi berkata kepada Umar: Sekiranya ayat ini, iaitu  {يَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمُ الإِسْلاَمَ دِينًا} diturunkan kepada kami, kaum Yahudi, nescaya kami akan menjadikan hari ia diturunkan sebagai hari raya. Umar berkata: Saya tahu hari ia diturunkan, waktu dan tempat Rasulullah SAW berada ketika ia diturunkan. Ia diturunkan pada malam Jumaat, dan ketika itu kami bersama Rasulullah SAW di Arafah."
  },
  {
    "id": 14610,
    "hadith_number": 7333,
    "tajuk_hadith": "Ayat Penyempurnaan Agama Islam",
    "perawi_melayu": "Tariq bin Syihab meriwayatkan bahawa seorang Yahudi datang kepada Umar dan berkata:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا جَعْفَرُ بْنُ عَوْنٍ، أَخْبَرَنَا أَبُو عُمَيْسٍ، عَنْ قَيْسِ، بْنِ مُسْلِمٍ عَنْ طَارِقِ بْنِ شِهَابٍ، قَالَ جَاءَ رَجُلٌ مِنَ الْيَهُودِ إِلَى عُمَرَ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ آيَةٌ فِي كِتَابِكُمْ تَقْرَءُونَهَا لَوْ عَلَيْنَا نَزَلَتْ مَعْشَرَ الْيَهُودِ لاَتَّخَذْنَا ذَلِكَ الْيَوْمَ عِيدًا ‏.‏ قَالَ وَأَىُّ آيَةٍ قَالَ ‏{‏ الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمُ الإِسْلاَمَ دِينًا‏}‏ فَقَالَ عُمَرُ إِنِّي لأَعْلَمُ الْيَوْمَ الَّذِي نَزَلَتْ فِيهِ وَالْمَكَانَ الَّذِي نَزَلَتْ فِيهِ نَزَلَتْ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِعَرَفَاتٍ فِي يَوْمِ جُمُعَةٍ ‏.‏",
    "malay_translation": "Dan telah menceritakan kepadaku Abd bin Humaid, memberitakan kepada kami Ja’far bin ‘Aun, memberitakan kepada kami Abu Umays, daripada Qais bin Muslim daripada Tariq bin Syihab, berkata: Seorang lelaki dari kalangan Yahudi datang kepada Umar lalu berkata, “Wahai Amirul Mukminin, terdapat satu ayat dalam kitab kamu yang kamu baca, sekiranya ayat itu diturunkan kepada kami, kaum Yahudi, nescaya kami akan menjadikan hari itu sebagai hari raya.” Umar bertanya, “Ayat apakah itu?” Lelaki itu menjawab, “{(Ayat 5:3) Hari ini Aku telah menyempurnakan agama kamu untuk kamu, dan Aku telah cukupkan nikmat-Ku kepada kamu, dan Aku telah redha Islam itu menjadi agama untuk kamu.}”  Umar berkata, “Sesungguhnya aku mengetahui hari di mana ayat itu diturunkan dan tempat di mana ia diturunkan. Ia diturunkan kepada Rasulullah SAW di Arafah pada hari Jumaat.”"
  },
  {
    "id": 14611,
    "hadith_number": 7334,
    "tajuk_hadith": "Nikah dan Keadilan terhadap Anak Yatim Perempuan",
    "perawi_melayu": "'Urwa bin Zubair meriwayatkan bahawa beliau bertanya kepada Aisyah tentang firman Allah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ وَحَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ - قَالَ أَبُو الطَّاهِرِ حَدَّثَنَا وَقَالَ، حَرْمَلَةُ أَخْبَرَنَا - ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّهُ سَأَلَ عَائِشَةَ عَنْ قَوْلِ اللَّهِ، ‏{‏ وَإِنْ خِفْتُمْ أَنْ لاَ، تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ مَثْنَى وَثُلاَثَ وَرُبَاعَ‏}‏ قَالَتْ يَا ابْنَ أُخْتِي هِيَ الْيَتِيمَةُ تَكُونُ فِي حَجْرِ وَلِيِّهَا تُشَارِكُهُ فِي مَالِهِ فَيُعْجِبُهُ مَالُهَا وَجَمَالُهَا فَيُرِيدُ وَلِيُّهَا أَنْ يَتَزَوَّجَهَا بِغَيْرِ أَنْ يُقْسِطَ فِي صَدَاقِهَا فَيُعْطِيَهَا مِثْلَ مَا يُعْطِيهَا غَيْرُهُ فَنُهُوا أَنْ يَنْكِحُوهُنَّ إِلاَّ أَنْ يُقْسِطُوا لَهُنَّ وَيَبْلُغُوا بِهِنَّ أَعْلَى سُنَّتِهِنَّ مِنَ الصَّدَاقِ وَأُمِرُوا أَنْ يَنْكِحُوا مَا طَابَ لَهُمْ مِنَ النِّسَاءِ سِوَاهُنَّ ‏.‏ قَالَ عُرْوَةُ قَالَتْ عَائِشَةُ ثُمَّ إِنَّ النَّاسَ اسْتَفْتَوْا رَسُولَ اللَّهِ صلى الله عليه وسلم بَعْدَ هَذِهِ الآيَةِ فِيهِنَّ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ وَيَسْتَفْتُونَكَ فِي النِّسَاءِ قُلِ اللَّهُ يُفْتِيكُمْ فِيهِنَّ وَمَا يُتْلَى عَلَيْكُمْ فِي الْكِتَابِ فِي يَتَامَى النِّسَاءِ اللاَّتِي لاَ تُؤْتُونَهُنَّ مَا كُتِبَ لَهُنَّ وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ‏}‏ ‏.‏ قَالَتْ وَالَّذِي ذَكَرَ اللَّهُ تَعَالَى أَنَّهُ يُتْلَى عَلَيْكُمْ فِي الْكِتَابِ الآيَةُ الأُولَى الَّتِي قَالَ اللَّهُ فِيهَا ‏{‏ وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ‏}‏ ‏.‏ قَالَتْ عَائِشَةُ وَقَوْلُ اللَّهِ فِي الآيَةِ الأُخْرَى ‏{‏ وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ‏}‏ رَغْبَةَ أَحَدِكُمْ عَنِ الْيَتِيمَةِ الَّتِي تَكُونُ فِي حَجْرِهِ حِينَ تَكُونُ قَلِيلَةَ الْمَالِ وَالْجَمَالِ فَنُهُوا أَنْ يَنْكِحُوا مَا رَغِبُوا فِي مَالِهَا وَجَمَالِهَا مِنْ يَتَامَى النِّسَاءِ إِلاَّ بِالْقِسْطِ مِنْ أَجْلِ رَغْبَتِهِمْ عَنْهُنَّ ‏.‏",
    "malay_translation": "Abu al-Thahir, Ahmad bin Amru bin Sarh dan Harmalah bin Yahya al-Tujibi meriwayatkan – Abu al-Thahir berkata, Harmalah memberitahu kami – Ibnu Wahb memberitahu Yunus, daripada Ibnu Syihab, memberitahu Urwah bin Zubair bahawa dia bertanya kepada Aisyah tentang firman Allah SWT: {وَإِنْ خِفْتُمْ أَنْ لا تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ مَثْنَى وَثُلاَثَ وَرُبَاعَ}. Aisyah berkata: Wahai anak saudara perempuan ku, anak yatim perempuan itu berada dalam jagaan walinya, berkongsi harta dengannya. Walinya tertarik dengan harta dan kecantikannya, lalu dia ingin mengahwininya tanpa berlaku adil dalam mas kahwin, tidak memberikannya seperti yang diberikan kepada perempuan lain. Maka, mereka dilarang mengahwini mereka melainkan dengan berlaku adil dan memberikan mas kahwin yang sewajarnya, dan mereka diperintahkan untuk mengahwini perempuan lain yang disukai. Urwah berkata, Aisyah berkata: Kemudian, manusia meminta fatwa kepada Rasulullah SAW selepas ayat ini diturunkan. Lalu Allah SWT menurunkan ayat: {وَيَسْتَفْتُونَكَ فِي النِّسَاءِ قُلِ اللَّهُ يُفْتِيكُمْ فِيهِنَّ وَمَا يُتْلَى عَلَيْكُمْ فِي الْكِتَابِ فِي يَتَامَى النِّسَاءِ اللاَّتِي لا تُؤْتُونَهُنَّ مَا كُتِبَ لَهُنَّ وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ}. Aisyah berkata: Ayat yang disebut oleh Allah SWT, iaitu yang dibacakan kepada kamu dalam kitab, merujuk kepada ayat pertama, iaitu: {وَإِنْ خِفْتُمْ أَنْ لا تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ}. Aisyah berkata: Dan firman Allah SWT dalam ayat yang lain: {وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ}, iaitu keinginan seseorang terhadap anak yatim perempuan yang berada dalam jagaannya, yang sedikit harta dan kecantikannya. Maka, mereka dilarang mengahwini anak yatim perempuan yang mereka inginkan harta dan kecantikannya, melainkan dengan adil, kerana keinginan mereka terhadap mereka."
  },
  {
    "id": 14612,
    "hadith_number": 7335,
    "tajuk_hadith": "Keengganan Berkahwin dengan Anak Yatim Perempuan",
    "perawi_melayu": "'Urwa meriwayatkan bahawa beliau bertanya kepada Aisyah tentang firman Allah:",
    "english_text": "\"If you fear that you will not be able to observe equity in case of orphan girls\" ; the rest of the hadith is the same but with a slight variation of wording.",
    "arabic_text": "وَحَدَّثَنَا الْحَسَنُ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، جَمِيعًا عَنْ يَعْقُوبَ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُرْوَةُ، أَنَّهُ سَأَلَ عَائِشَةَ عَنْ قَوْلِ اللَّهِ، ‏{‏وَإِنْ خِفْتُمْ أَنْ لاَ، تُقْسِطُوا فِي الْيَتَامَى‏}‏ وَسَاقَ الْحَدِيثَ بِمِثْلِ حَدِيثِ يُونُسَ عَنِ الزُّهْرِيِّ وَزَادَ فِي آخِرِهِ مِنْ أَجْلِ رَغْبَتِهِمْ عَنْهُنَّ إِذَا كُنَّ قَلِيلاَتِ الْمَالِ وَالْجَمَالِ ‏.‏",
    "malay_translation": "Dan telah menceritakan kepada kami al-Hasan al-Hulwani, dan Abd bin Humaid, kedua-duanya daripada Ya’qub bin Ibrahim bin Saad, telah menceritakan kepada kami bapaku, daripada Shalih, daripada Ibnu Syihab, telah memberitakan kepadaku ‘Urwah, bahawa dia telah bertanya kepada Aisyah tentang firman Allah SWT, {وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى}  dan meneruskan hadis itu seperti hadis Yunus daripada az- Zuhri dan menambahkan di akhirnya kerana keengganan mereka terhadap mereka (anak-anak yatim perempuan) jika mereka sedikit harta dan kecantikannya."
  },
  {
    "id": 14613,
    "hadith_number": 7336,
    "tajuk_hadith": "Ketidakadilan terhadap Anak Yatim Perempuan",
    "perawi_melayu": "Aisyah berkata bahawa berkenaan firman Allah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، فِي قَوْلِهِ ‏{‏ وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى‏}‏ قَالَتْ أُنْزِلَتْ فِي الرَّجُلِ تَكُونُ لَهُ الْيَتِيمَةُ وَهُوَ وَلِيُّهَا وَوَارِثُهَا وَلَهَا مَالٌ وَلَيْسَ لَهَا أَحَدٌ يُخَاصِمُ دُونَهَا فَلاَ يُنْكِحُهَا لِمَالِهَا فَيَضُرُّ بِهَا وَيُسِيءُ صُحْبَتَهَا فَقَالَ ‏{‏ إِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ‏}‏ يَقُولُ مَا أَحْلَلْتُ لَكُمْ وَدَعْ هَذِهِ الَّتِي تَضُرُّ بِهَا ‏.‏",
    "malay_translation": "Abu Bakar bin Abi Syaibah dan Abu Kuraib berkata:  Kami telah mendengar daripada Abu Usamah, yang telah mendengar daripada Hisyam, daripada bapanya, daripada Aisyah, berkenaan firman Allah SWT: {وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى}. Aisyah berkata bahawa ayat ini diturunkan berkenaan seorang lelaki yang mempunyai anak perempuan yatim di bawah jagaannya, di mana lelaki itu juga merupakan wali dan warisnya. Anak yatim perempuan itu mempunyai harta, tetapi tiada sesiapa yang boleh membela haknya melainkan dirinya sendiri. Lelaki itu tidak mahu menikahkannya kerana hartanya, lalu dia menzalimi dan menyeksa anak yatim itu. Maka Allah SWT berfirman: {إِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ}. Maksudnya:  Apa yang Aku halalkan untuk kamu, maka kahwinilah, dan tinggalkanlah perempuan yang kamu aniaya ini."
  },
  {
    "id": 14614,
    "hadith_number": 7337,
    "tajuk_hadith": "Hadis Tentang Wanita Yatim Piatu",
    "perawi_melayu": "Aisyah berkata berkaitan firman Allah:",
    "english_text": "\"What is recited to you in the Book about orphan women whom you give not what is ordained for them, while you like to marry them,\" these were revealed in connection with an orphan girl who was in the charge of the person and she shared with him in his property and he was reluctant to marry her himself and was also unwilling to marry her to someone else (fearing) that (that person) would share in his property (as the husband of that girl), preventing her to marry, neither marrying her himself nor marrying her to another person.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، فِي قَوْلِهِ ‏{‏ وَمَا يُتْلَى عَلَيْكُمْ فِي الْكِتَابِ فِي يَتَامَى النِّسَاءِ اللاَّتِي لاَ تُؤْتُونَهُنَّ مَا كُتِبَ لَهُنَّ وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ‏}‏ قَالَتْ أُنْزِلَتْ فِي الْيَتِيمَةِ تَكُونُ عِنْدَ الرَّجُلِ فَتَشْرَكُهُ فِي مَالِهِ فَيَرْغَبُ عَنْهَا أَنْ يَتَزَوَّجَهَا وَيَكْرَهُ أَنْ يُزَوِّجَهَا غَيْرَهُ فَيَشْرَكُهُ فِي مَالِهِ فَيَعْضِلُهَا فَلاَ يَتَزَوَّجُهَا وَلاَ يُزَوِّجُهَا غَيْرَهُ ‏.‏",
    "malay_translation": "Hadis ini diturunkan berkaitan dengan ayat  \"...dan apa yang dibacakan kepadamu dalam Kitab tentang anak-anak perempuan yatim yang kamu tidak memberikan kepada mereka hak mereka, sedang kamu ingin mengawini mereka...\"  Aisyah r.a. berkata bahawa ayat ini diturunkan berkenaan seorang gadis yatim yang berada dalam jagaan seorang lelaki. Gadis itu berkongsi harta dengan lelaki tersebut. Lelaki itu enggan mengahwininya sendiri dan juga enggan menikahkannya dengan orang lain kerana bimbang orang lain itu akan berkongsi hartanya (sebagai suami kepada gadis itu).  Oleh itu, dia menghalang gadis itu daripada berkahwin, sama ada dengan dirinya sendiri atau dengan orang lain."
  },
  {
    "id": 14615,
    "hadith_number": 7338,
    "tajuk_hadith": "Perkahwinan Gadis Yatim dan Pembahagian Harta",
    "perawi_melayu": "Hisham meriwayatkan bahawa Aisyah berkata berkaitan dengan firman Allah:",
    "english_text": "\"They ask thee the religious verdict about women, say: Allah gives you the verdict about them\" (iv. 126), that these relate to an orphan girl who is in charge of the person and she shares with him in his property (as a heir) even in the date-palm trees and he is reluctant to give her hand in marriage to any other person lest he (her husband) should partake of his property, and thus keep her in a lingering state.",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، أَخْبَرَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، فِي قَوْلِهِ ‏{‏ ويَسْتَفْتُونَكَ فِي النِّسَاءِ قُلِ اللَّهُ يُفْتِيكُمْ فِيهِنَّ‏}‏ الآيَةَ قَالَتْ هِيَ الْيَتِيمَةُ الَّتِي تَكُونُ عِنْدَ الرَّجُلِ لَعَلَّهَا أَنْ تَكُونَ قَدْ شَرِكَتْهُ فِي مَالِهِ حَتَّى فِي الْعَذْقِ فَيَرْغَبُ يَعْنِي أَنْ يَنْكِحَهَا وَيَكْرَهُ أَنْ يُنْكِحَهَا رَجُلاً فَيَشْرَكُهُ فِي مَالِهِ فَيَعْضِلُهَا ‏.‏",
    "malay_translation": "Abu Kuraib telah meriwayatkan daripada Abu Usamah, yang memberitakan daripada Hisyam, daripada bapanya, daripada Aisyah, berkenaan firman Allah SWT: {Dan mereka bertanya kepadamu tentang wanita. Katakanlah: “Allah memberi fatwa kepadamu tentang mereka.”} (Surah An-Nisaa’ 4:126).  Aisyah berkata bahawa ayat ini merujuk kepada seorang gadis yatim yang tinggal bersama seorang lelaki, dan mungkin dia telah berkongsi harta dengan lelaki itu, sehingga termasuk hasil kurma. Lelaki itu enggan menikahkannya dengan lelaki lain kerana bimbang lelaki itu akan turut berkongsi hartanya, lalu dia menangguhkan perkahwinan gadis itu."
  },
  {
    "id": 14616,
    "hadith_number": 7339,
    "tajuk_hadith": "Makan Dari Harta Yatim Piatu",
    "perawi_melayu": "Hisham meriwayatkan daripada bapanya bahawa Aisyah berkata berkaitan firman Allah:",
    "english_text": "\" And whoever is poor let him take reasonably (out of it)\" that it was revealed in connection with the custodian of the property of an orphan, who is in charge of her and looks after her; In case he is poor, he is allowed to eat out of that.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، فِي قَوْلِهِ ‏{‏ وَمَنْ كَانَ فَقِيرًا فَلْيَأْكُلْ بِالْمَعْرُوفِ‏}‏ قَالَتْ أُنْزِلَتْ فِي وَالِي مَالِ الْيَتِيمِ الَّذِي يَقُومُ عَلَيْهِ وَيُصْلِحُهُ إِذَا كَانَ مُحْتَاجًا أَنْ يَأْكُلَ مِنْهُ ‏.‏",
    "malay_translation": "Hisham meriwayatkan daripada bapanya bahawa Aisyah berkata berkaitan firman Allah SWT,  \"...dan sesiapa yang miskin, maka hendaklah dia makan dengan cara yang baik...\" (maksudnya).  Aisyah berkata bahawa ayat ini diturunkan berkaitan dengan penjaga harta anak yatim yang bertanggungjawab ke atasnya dan menguruskannya. Jika penjaga itu memerlukan, dia dibenarkan untuk mengambil makanan dari harta itu."
  },
  {
    "id": 14617,
    "hadith_number": 7340,
    "tajuk_hadith": "Kebebasan Makan bagi Wali Yatim yang Miskin",
    "perawi_melayu": "Aisyah r.a. meriwayatkan berkaitan firman Allah SWT:",
    "english_text": "\" He who is rich should abstain, and he who is poor may reasonably eat (out of it)\" that this was revealed in relation to the guardian of an orphan who is poor; he may get out of that what is reasonable keeping in view his own status of solvency.",
    "arabic_text": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، فِي قَوْلِهِ تَعَالَى ‏{‏ وَمَنْ كَانَ غَنِيًّا فَلْيَسْتَعْفِفْ وَمَنْ كَانَ فَقِيرًا فَلْيَأْكُلْ بِالْمَعْرُوفِ‏}‏ قَالَتْ أُنْزِلَتْ فِي وَلِيِّ الْيَتِيمِ أَنْ يُصِيبَ مِنْ مَالِهِ إِذَا كَانَ مُحْتَاجًا بِقَدْرِ مَالِهِ بِالْمَعْرُوفِ ‏.‏",
    "malay_translation": "Daripada ayat Allah SWT yang bermaksud: \"Dan sesiapa yang kaya, hendaklah dia menahan diri (daripada mengambil harta anak yatim), dan sesiapa yang miskin, hendaklah dia makan (dari harta anak yatim) dengan cara yang baik.\"  Aisyah r.a. berkata bahawa ayat ini diturunkan berkaitan dengan wali anak yatim.  Jika wali itu miskin, dia dibenarkan mengambil daripada harta anak yatim itu mengikut kadar keperluan dan kemampuannya dengan cara yang baik."
  },
  {
    "id": 14618,
    "hadith_number": 7341,
    "tajuk_hadith": "Sanad Hadith yang Sama",
    "perawi_melayu": "Hisham melalui sanad yang sama.",
    "english_text": "This hadith has been narrated on the authority of Hisham with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا هِشَامٌ، بِهَذَا الإِسْنَادِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Hisham melalui jalan periwayatan yang sama."
  },
  {
    "id": 14619,
    "hadith_number": 7342,
    "tajuk_hadith": "Ayat Tentang Peristiwa Perang Khandak",
    "perawi_melayu": "Aisyah meriwayatkan bahawa ayat-ayat Allah:",
    "english_text": "\"When they came upon you from above you and from below you and when the eyes turned dull and the hearts rose up to the throats\" (xxxiii. 10) pertain to the day of Ditch.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، فِي قَوْلِهِ عَزَّ وَجَلَّ ‏{‏ إِذْ جَاءُوكُمْ مِنْ فَوْقِكُمْ وَمِنْ أَسْفَلَ مِنْكُمْ وَإِذْ زَاغَتِ الأَبْصَارُ وَبَلَغَتِ الْقُلُوبُ الْحَنَاجِرَ‏}‏ قَالَتْ كَانَ ذَلِكَ يَوْمَ الْخَنْدَقِ ‏.‏",
    "malay_translation": "Aisyah meriwayatkan bahawa firman Allah SWT:  \"(Ingatlah) ketika mereka datang kepadamu dari atasmu dan dari bawahmu, dan ketika penglihatan menjadi kabur dan hati sampai ke pangkal kerongkong,\" (Al-Ahzab: 10)  merujuk kepada peristiwa Perang Khandak."
  },
  {
    "id": 14620,
    "hadith_number": 7343,
    "tajuk_hadith": "Ayat Tentang Wanita Yang Takut Akan Suami",
    "perawi_melayu": "Aisyah berkata berkaitan ayat tersebut:",
    "english_text": "\" And if a woman has reason to fear ill-treatment from her husband or that he might turn away from her\" (iv. 128) that it was revealed in case of a woman who had long association with a person (as his wife) and now he intends to divorce her and she says: Do not divorce me, but retain me (as wife in your house) and you are permitted to live with another wife. It is in this context that this verse was revealed.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، ‏{‏ وَإِنِ امْرَأَةٌ خَافَتْ مِنْ بَعْلِهَا نُشُوزًا أَوْ إِعْرَاضًا‏}‏ الآيَةَ قَالَتْ أُنْزِلَتْ فِي الْمَرْأَةِ تَكُونُ عِنْدَ الرَّجُلِ فَتَطُولُ صُحْبَتُهَا فَيُرِيدُ طَلاَقَهَا فَتَقُولُ لاَ تُطَلِّقْنِي وَأَمْسِكْنِي وَأَنْتَ فِي حِلٍّ مِنِّي ‏.‏ فَنَزَلَتْ هَذِهِ الآيَةُ ‏.‏",
    "malay_translation": "Abu Bakar bin Abi Syaibah telah meriwayatkan daripada 'Abdah bin Sulaiman, yang meriwayatkan daripada Hisyam, daripada bapanya, daripada Aisyah r.a.  berkata:  Ayat  \"وَإِنِ امْرَأَةٌ خَافَتْ مِنْ بَعْلِهَا نُشُوزًا أَوْ إِعْرَاضًا\" (dan jika seorang wanita itu takut akan nusyuz atau pengabaian dari suaminya) diturunkan berkenaan seorang wanita yang telah lama hidup bersama seorang lelaki (sebagai isterinya), kemudian lelaki itu ingin menceraikannya. Wanita itu berkata: \"Jangan ceraikan aku, dan teruslah bersamaku, walaupun engkau dibenarkan untuk berkahwin dengan wanita lain.\"  Maka ayat ini diturunkan."
  },
  {
    "id": 14621,
    "hadith_number": 7344,
    "tajuk_hadith": "Isteri yang Khuatir Akan Penganiayaan Suami",
    "perawi_melayu": "Aisyah berkata berkaitan dengan firman Allah SWT:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، فِي قَوْلِهِ عَزَّ وَجَلَّ ‏{‏ وَإِنِ امْرَأَةٌ خَافَتْ مِنْ بَعْلِهَا نُشُوزًا أَوْ إِعْرَاضًا‏}‏ قَالَتْ نَزَلَتْ فِي الْمَرْأَةِ تَكُونُ عِنْدَ الرَّجُلِ فَلَعَلَّهُ أَنْ لاَ يَسْتَكْثِرَ مِنْهَا وَتَكُونُ لَهَا صُحْبَةٌ وَوَلَدٌ فَتَكْرَهُ أَنْ يُفَارِقَهَا فَتَقُولُ لَهُ أَنْتَ فِي حِلٍّ مِنْ شَأْنِي ‏.‏",
    "malay_translation": "Abu Kuraib telah meriwayatkan kepada kami, Abu Usamah telah meriwayatkan kepada kami, Hisyam telah meriwayatkan daripada bapanya, daripada Aisyah, berkenaan firman Allah SWT: {وَإِنِ امْرَأَةٌ خَافَتْ مِنْ بَعْلِهَا نُشُوزًا أَوْ إِعْرَاضًا}  Aisyah berkata: Ayat ini diturunkan berkaitan seorang wanita yang tinggal bersama seorang lelaki, dan mungkin lelaki itu tidak mahu meneruskan hubungan dengannya, tetapi wanita itu telahpun mempunyai hubungan intim dengannya dan dikurniakan anak, lalu dia tidak mahu diceraikan, maka dia berkata kepada suaminya:  “Engkau bebas daripada urusanku.”"
  },
  {
    "id": 14622,
    "hadith_number": 7345,
    "tajuk_hadith": "Mencela Sahabat-Sahabat Nabi SAW",
    "perawi_melayu": "Urwah meriwayatkan daripada bapanya bahawa Aisyah berkata kepadanya:",
    "english_text": "O, the son of my sister, the Muslims were commanded to seek forgiveness for the Companions of Allah's Apostle (ﷺ) but they reviled them.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، قَالَ قَالَتْ لِي عَائِشَةُ يَا ابْنَ أُخْتِي أُمِرُوا أَنْ يَسْتَغْفِرُوا، لأَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فَسَبُّوهُمْ ‏.‏",
    "malay_translation": "Wahai anak saudara perempuan ku, umat Islam telah diperintahkan untuk memohon keampunan bagi sahabat-sahabat Rasulullah SAW, tetapi mereka mencela mereka."
  },
  {
    "id": 14623,
    "hadith_number": 7346,
    "tajuk_hadith": "Hadis daripada Abu Usamah dengan Sanad yang Sama",
    "perawi_melayu": "Abu Bakar bin Abi Syaibah, daripada Abu Usamah, daripada Hisyam",
    "english_text": "This hadith has been transmitted on the authority of Abu Usama with the same chain of narrators.",
    "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا هِشَامٌ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
    "malay_translation": "Hadis ini telah disampaikan melalui sanad daripada Abu Bakar bin Abi Syaibah, daripada Abu Usamah, daripada Hisyam, dengan sanad yang sama."
  },
  {
    "id": 14624,
    "hadith_number": 7347,
    "tajuk_hadith": "Pendapat Ibnu Abbas tentang Ayat Pembunuhan Orang Mukmin",
    "perawi_melayu": "Said bin Jubair meriwayatkan:",
    "english_text": "The inhabitants of Kufa differed in regard to this verse:\" But whoever slays another believer intentionally, his requital shall be Hell\" (iv. 92), so I went to Ibn 'Abbas and asked him about it, whereupon he said: This has been revealed and nothing abrogated it.",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنِ الْمُغِيرَةِ بْنِ النُّعْمَانِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ اخْتَلَفَ أَهْلُ الْكُوفَةِ فِي هَذِهِ الآيَةِ ‏{‏ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ‏}‏ فَرَحَلْتُ إِلَى ابْنِ عَبَّاسٍ فَسَأَلْتُهُ عَنْهَا فَقَالَ لَقَدْ أُنْزِلَتْ آخِرَ مَا أُنْزِلَ ثُمَّ مَا نَسَخَهَا شَىْءٌ ‏.‏",
    "malay_translation": "Penduduk Kufah berbeza pendapat mengenai ayat ini: \"Dan sesiapa yang membunuh seorang mukmin dengan sengaja, maka balasannya ialah neraka Jahannam.\" (Surah An-Nisaa', 4:92).  Maka aku pergi kepada Ibnu Abbas dan bertanya kepadanya tentangnya, lalu beliau berkata: Ayat ini telah diturunkan pada akhir wahyu dan tiada apa yang telah mensahkannya."
  },
  {
    "id": 14625,
    "hadith_number": 7348,
    "tajuk_hadith": "Perbezaan Ringkas Perawi Hadis",
    "perawi_melayu": "Shu'ba",
    "english_text": "This hadith has been transmitted on the authority of Shu'ba with the same chain of narrators but with a slight variation of wording.",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وَحَدَّثَنَا إِسْحَاقُ، بْنُ إِبْرَاهِيمَ أَخْبَرَنَا النَّضْرُ، قَالاَ جَمِيعًا حَدَّثَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ ‏.‏ فِي حَدِيثِ ابْنِ جَعْفَرٍ نَزَلَتْ فِي آخِرِ مَا أُنْزِلَ ‏.‏ وَفِي حَدِيثِ النَّضْرِ إِنَّهَا لَمِنْ آخِرِ مَا أُنْزِلَتْ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Shu'ba dengan sanad yang sama, tetapi dengan sedikit perbezaan lafaz.  Dalam riwayat Ibn Ja'far, ia turun pada akhir wahyu.  Manakala dalam riwayat An-Nadhr, ia dinyatakan sebagai antara wahyu yang terakhir diturunkan."
  },
  {
    "id": 14626,
    "hadith_number": 7349,
    "tajuk_hadith": "Hukum membunuh orang mukmin",
    "perawi_melayu": "Said bin Jubair meriwayatkan:",
    "english_text": "'Abd al Rahman b. Abzi commanded me that I should ask Ibn 'Abbas about these two verses:\" He who slays a believer intentionally his requital shall be Hell where he would abide for ever\" (iv. 92). So, I asked him and he said: Nothing has abrogated it. And as for this verse:\" And they who call not upon another god with Allah and slay not the soul which Allah has forbidden, except in the cause of justice\" (xxv. 68), he (Ibn Abbas) said: This has been revealed in regard to the polytheists.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ أَمَرَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبْزَى أَنْ أَسْأَلَ ابْنَ عَبَّاسٍ، عَنْ هَاتَيْنِ الآيَتَيْنِ، ‏{‏ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ خَالِدًا فِيهَا‏}‏ فَسَأَلْتُهُ فَقَالَ لَمْ يَنْسَخْهَا شَىْءٌ ‏.‏ وَعَنْ هَذِهِ الآيَةِ ‏{‏ وَالَّذِينَ لاَ يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ وَلاَ يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ‏}‏ قَالَ نَزَلَتْ فِي أَهْلِ الشِّرْكِ ‏.‏",
    "malay_translation": "Abd al Rahman bin Abza mengarahkan aku supaya bertanya kepada Ibnu Abbas tentang dua ayat ini: \"Barangsiapa membunuh seorang mukmin dengan sengaja, maka balasannya ialah Jahannam, kekal ia di dalamnya.\" (4:92). Maka aku bertanya kepadanya, lalu dia berkata: Tiada apa-apa yang telah menghapuskannya.  Dan berkenaan ayat ini: \"Dan orang-orang yang tidak menyembah tuhan selain Allah, dan tidak membunuh jiwa yang diharamkan Allah kecuali dengan hak.\" (25:68), katanya (Ibnu Abbas): Ayat ini diturunkan mengenai orang-orang musyrik."
  },
  {
    "id": 14627,
    "hadith_number": 7350,
    "tajuk_hadith": "Taubat Bagi Pembunuh Selepas Memeluk Islam",
    "perawi_melayu": "Ibnu Abbas berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا أَبُو النَّضْرِ، هَاشِمُ بْنُ الْقَاسِمِ اللَّيْثِيُّ حَدَّثَنَا أَبُو مُعَاوِيَةَ، - يَعْنِي شَيْبَانَ - عَنْ مَنْصُورِ بْنِ الْمُعْتَمِرِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ،قَالَ نَزَلَتْ هَذِهِ الآيَةُ بِمَكَّةَ ‏{‏ وَالَّذِينَ لاَ يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ‏}‏ إِلَى قَوْلِهِ ‏{‏ مُهَانًا‏}‏ فَقَالَ الْمُشْرِكُونَ وَمَا يُغْنِي عَنَّا الإِسْلاَمُ وَقَدْ عَدَلْنَا بِاللَّهِ وَقَدْ قَتَلْنَا النَّفْسَ الَّتِي حَرَّمَ اللَّهُ وَأَتَيْنَا الْفَوَاحِشَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ إِلاَّ مَنْ تَابَ وَآمَنَ وَعَمِلَ عَمَلاً صَالِحًا‏}‏ إِلَى آخِرِ الآيَةِ ‏.‏ قَالَ فَأَمَّا مَنْ دَخَلَ فِي الإِسْلاَمِ وَعَقَلَهُ ثُمَّ قَتَلَ فَلاَ تَوْبَةَ لَهُ ‏.‏",
    "malay_translation": "Aku telah diceritakan oleh Harun bin Abdullah, yang telah menceritakan kepadaku Abu Nadhr, Hashim bin Al-Qasim Al-Laythi telah menceritakan kepada kami Abu Muawiyah – iaitu Syibah – daripada Mansur bin Al-Mu’tamir, daripada Sa’id bin Jubair, daripada Ibnu Abbas, katanya: Ayat ini turun di Mekah: {…dan orang-orang yang tidak menyembah tuhan lain bersama Allah…} sehingga firman-Nya: {…yang hina.} Maka berkata orang-orang musyrik: Apakah faedahnya Islam kepada kami, sedangkan kami telah menyekutukan Allah, telah membunuh jiwa yang diharamkan oleh Allah dan telah melakukan perbuatan-perbuatan keji. Maka Allah SWT menurunkan ayat: {…kecuali orang yang bertaubat, beriman dan mengerjakan amal soleh…} sehingga akhir ayat.  Katanya: Adapun sesiapa yang masuk Islam dan memahaminya, kemudian membunuh, maka tidak ada taubat baginya."
  },
  {
    "id": 14628,
    "hadith_number": 7351,
    "tajuk_hadith": "Taubat Pembunuhan Sengaja Seorang Mukmin",
    "perawi_melayu": "Said bin Jubair meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ هَاشِمٍ، وَعَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ الْعَبْدِيُّ، قَالاَ حَدَّثَنَا يَحْيَى، - وَهُوَ ابْنُ سَعِيدٍ الْقَطَّانُ - عَنِ ابْنِ جُرَيْجٍ، حَدَّثَنِي الْقَاسِمُ بْنُ أَبِي بَزَّةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ قُلْتُ لاِبْنِ عَبَّاسٍ أَلِمَنْ قَتَلَ مُؤْمِنًا مُتَعَمِّدًا مِنْ تَوْبَةٍ قَالَ لاَ ‏.‏ قَالَ فَتَلَوْتُ عَلَيْهِ هَذِهِ الآيَةَ الَّتِي فِي الْفُرْقَانِ ‏{‏ وَالَّذِينَ لاَ يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ وَلاَ يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ‏}‏ إِلَى آخِرِ الآيَةِ ‏.‏ قَالَ هَذِهِ آيَةٌ مَكِّيَّةٌ نَسَخَتْهَا آيَةٌ مَدَنِيَّةٌ ‏{‏ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ خَالِدًا‏}‏ ‏.‏ وَفِي رِوَايَةِ ابْنِ هَاشِمٍ فَتَلَوْتُ هَذِهِ الآيَةَ الَّتِي فِي الْفُرْقَانِ‏{‏ إِلاَّ مَنْ تَابَ‏}‏",
    "malay_translation": "Aku bertanya kepada Ibnu Abbas: “Adakah taubat diterima daripada orang yang membunuh seorang mukmin dengan sengaja?” Jawabnya: “Tidak.”  Kemudian aku membacakan kepadanya ayat ini daripada Surah al-Furqan:  “Dan orang-orang yang tidak menyembah tuhan selain Allah, dan tidak membunuh jiwa yang diharamkan Allah kecuali dengan hak (alasan yang benar).”  hingga akhir ayat tersebut.  Dia berkata: “Ayat ini adalah ayat Makkiyyah yang telah dimansuhkan oleh ayat Madaniyyah: “Dan sesiapa yang membunuh seorang mukmin dengan sengaja, maka balasannya ialah neraka Jahannam selama-lamanya.” Dan dalam riwayat Ibnu Hashim:  Kemudian aku membacakan ayat ini daripada Surah al-Furqan: “Kecuali orang yang bertaubat.”"
  },
  {
    "id": 14629,
    "hadith_number": 7352,
    "tajuk_hadith": "Surah Akhir yang Diturunkan",
    "perawi_melayu": "Ubaidullah bin Abdullah bin Utba meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَهَارُونُ بْنُ عَبْدِ اللَّهِ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ عَبْدٌ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ، أَخْبَرَنَا أَبُو عُمَيْسٍ، عَنْ عَبْدِ الْمَجِيدِ بْنِ سُهَيْلٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، قَالَ قَالَ لِيَ ابْنُ عَبَّاسٍ تَعْلَمُ - وَقَالَ هَارُونُ تَدْرِي - آخِرَ سُورَةٍ نَزَلَتْ مِنَ الْقُرْآنِ نَزَلَتْ جَمِيعًا قُلْتُ نَعَمْ ‏.‏ ‏{‏ إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ‏}‏ قَالَ صَدَقْتَ ‏.‏ وَفِي رِوَايَةِ ابْنِ أَبِي شَيْبَةَ تَعْلَمُ أَىُّ سُورَةٍ ‏.‏ وَلَمْ يَقُلْ آخِرَ ‏.‏",
    "malay_translation": "Abu Bakar bin Abi Syaibah, Harun bin Abdullah, dan Abd bin Humaid meriwayatkan. Abd berkata, “Mereka berdua memberitakan kepada kami,” Ja’far bin ‘Aun memberitakan kepada kami, Abu Umays memberitakan kepada kami daripada Abd al-Majid bin Suhail, daripada Ubaidullah bin Abdullah bin Utba. Beliau berkata, “Ibn Abbas bertanya kepadaku, ‘Engkau tahu – dan Harun berkata, ‘Engkau sedar’ – surah yang terakhir diturunkan daripada al-Quran secara keseluruhan?’ Aku berkata, ‘Ya, iaitu surah {إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ}.’ Beliau berkata, ‘Engkau benar.’  Dalam riwayat Ibn Abi Syaibah pula,  beliau bertanya, ‘Engkau tahu surah yang mana?’ dan tidak menyebut perkataan ‘yang terakhir’."
  },
  {
    "id": 14630,
    "hadith_number": 7353,
    "tajuk_hadith": "Variasi Ringkas Hadis daripada Abu 'Umais",
    "perawi_melayu": "Daripada Abu 'Umais melalui sanad yang sama.",
    "english_text": "This hadith has been reported on the authority of Abu 'Umais through the same chain of transmitters but with a slight variation of wording.",
    "arabic_text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا أَبُو عُمَيْسٍ، بِهَذَا الإِسْنَادِ مِثْلَهُ وَقَالَ آخِرَ سُورَةٍ وَقَالَ عَبْدُ الْمَجِيدِ وَلَمْ يَقُلِ ابْنِ سُهَيْلٍ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Abu 'Umais melalui sanad perawi yang sama, tetapi dengan sedikit perbezaan lafaz."
  },
  {
    "id": 14631,
    "hadith_number": 7354,
    "tajuk_hadith": "Salam dan Kepercayaan",
    "perawi_melayu": "Ibnu Abbas melaporkan bahawa beberapa orang Muslim telah bertemu dengan seorang lelaki yang mempunyai sedikit kambing.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَأَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ، - وَاللَّفْظُ لاِبْنِ أَبِي شَيْبَةَ - قَالَ حَدَّثَنَا وَقَالَ الآخَرَانِ، أَخْبَرَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَقِيَ نَاسٌ مِنَ الْمُسْلِمِينَ رَجُلاً فِي غُنَيْمَةٍ لَهُ فَقَالَ السَّلاَمُ عَلَيْكُمْ ‏.‏ فَأَخَذُوهُ فَقَتَلُوهُ وَأَخَذُوا تِلْكَ الْغُنَيْمَةَ فَنَزَلَتْ ‏{‏ وَلاَ تَقُولُوا لِمَنْ أَلْقَى إِلَيْكُمُ السَّلَمَ لَسْتَ مُؤْمِنًا‏}‏ وَقَرَأَهَا ابْنُ عَبَّاسٍ السَّلاَمَ ‏.‏",
    "malay_translation": "Ibnu Abbas meriwayatkan bahawa segelintir umat Islam telah bertemu seorang lelaki yang mempunyai ternakan kecil. Lelaki itu mengucapkan salam, \"Assalamualaikum.\" Mereka menangkapnya, membunuhnya dan merampas ternakannya.  Lalu turunlah ayat:  \"Janganlah kamu mengatakan kepada orang yang mengucapkan salam kepadamu: Engkau bukan orang yang beriman.\" (Surah An-Nisaa': 94).  Ibnu Abbas bagaimanapun membacanya sebagai \"Assalam\"."
  },
  {
    "id": 14632,
    "hadith_number": 7355,
    "tajuk_hadith": "Cara Kemasukan ke Rumah",
    "perawi_melayu": "Bara' meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ، يَقُولُ كَانَتِ الأَنْصَارُ إِذَا حَجُّوا فَرَجَعُوا لَمْ يَدْخُلُوا الْبُيُوتَ إِلاَّ مِنْ ظُهُورِهَا - قَالَ - فَجَاءَ رَجُلٌ مِنَ الأَنْصَارِ فَدَخَلَ مِنْ بَابِهِ فَقِيلَ لَهُ فِي ذَلِكَ فَنَزَلَتْ هَذِهِ الآيَةُ ‏{‏وَلَيْسَ الْبِرُّ بِأَنْ تَأْتُوا الْبُيُوتَ مِنْ ظُهُورِهَا‏}‏ ‏.‏",
    "malay_translation": "Abu Bakar bin Abi Syaibah telah meriwayatkan kepada kami, Ghundar telah meriwayatkan kepada kami daripada Syu'bah, dan Muhammad bin Muthanna dan Ibnu Bashshar telah meriwayatkan kepada kami - dan lafaznya adalah daripada Ibnu Muthanna - mereka berkata: Muhammad bin Ja'far telah meriwayatkan kepada kami daripada Syu'bah, daripada Abi Ishaq, beliau berkata: Aku mendengar Bara' berkata:  Para Ansar, apabila mereka menunaikan haji dan pulang, mereka tidak memasuki rumah-rumah melainkan dari belakang.  Kemudian datang seorang lelaki daripada kalangan Ansar lalu memasuki rumahnya dari pintu hadapan. Maka dia ditegur atas perbuatannya itu, lalu turunlah ayat ini:  \"Dan bukanlah berbuat baik itu dengan kamu memasuki rumah-rumah dari belakang.\" (Surah al-Baqarah: 189)."
  },
  {
    "id": 14633,
    "hadith_number": 7356,
    "tajuk_hadith": "Jeda Empat Tahun Antara Penerimaan Islam dan Ayat Teguran Allah",
    "perawi_melayu": "Ibnu Mas'ud berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يُونُسُ بْنُ عَبْدِ الأَعْلَى الصَّدَفِيُّ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو، بْنُ الْحَارِثِ عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ عَوْنِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، أَنَّ ابْنَ مَسْعُودٍ، قَالَ مَا كَانَ بَيْنَ إِسْلاَمِنَا وَبَيْنَ أَنْ عَاتَبَنَا اللَّهُ بِهَذِهِ الآيَةِ ‏{‏ أَلَمْ يَأْنِ لِلَّذِينَ آمَنُوا أَنْ تَخْشَعَ قُلُوبُهُمْ لِذِكْرِ اللَّهِ‏}‏ إِلاَّ أَرْبَعُ سِنِينَ ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Yunus bin Abdul A'la Ash-Shadafi, telah memberitakan kepada kami Abdullah bin Wahb, telah memberitakan kepadaku Amru bin Harits daripada Said bin Abi Hilal, daripada Aun bin Abdullah, daripada bapanya, bahawa Ibnu Mas'ud berkata:  \"Tidak ada tempoh antara penerimaan Islam kami dan teguran Allah SWT melalui ayat ini:  {أَلَمْ يَأْنِ لِلَّذِينَ آمَنُوا أَنْ تَخْشَعَ قُلُوبُهُمْ لِذِكْرِ اللَّهِ}  kecuali selama empat tahun.\""
  },
  {
    "id": 14634,
    "hadith_number": 7357,
    "tajuk_hadith": "Wanita Bertawaf Telanjang di Zaman Jahiliah",
    "perawi_melayu": "Ibnu Abbas meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وَحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ مُسْلِمٍ الْبَطِينِ، عَنْ سَعِيدِ بْنِ، جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَتِ الْمَرْأَةُ تَطُوفُ بِالْبَيْتِ وَهِيَ عُرْيَانَةٌ فَتَقُولُ مَنْ يُعِيرُنِي تِطْوَافًا تَجْعَلُهُ عَلَى فَرْجِهَا وَتَقُولُ الْيَوْمَ يَبْدُو بَعْضُهُ أَوْ كُلُّهُ فَمَا بَدَا مِنْهُ فَلاَ أُحِلُّهُ فَنَزَلَتْ هَذِهِ الآيَةَ ‏{‏ خُذُوا زِينَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ‏}‏",
    "malay_translation": "Muhammad bin Bashar telah meriwayatkan daripada Muhammad bin Ja'far, dan Abu Bakar bin Nafi' meriwayatkan (dengan lafaznya) daripada Ghundar, yang meriwayatkan daripada Syu'bah, daripada Salamah bin Kuhil, daripada Muslim al-Bathin, daripada Sa'id bin Jubair, daripada Ibnu Abbas, katanya:  \"Pada zaman jahiliah, wanita melakukan tawaf di Baitullah dalam keadaan telanjang. Kemudian dia berkata, 'Siapakah yang akan memberi pinjaman kain untukku agar aku dapat menutup auratku ketika tawaf?' Kemudian dia berkata, 'Hari ini, sebahagian atau keseluruhan auratku akan kelihatan, maka apa yang kelihatan itu tidak halal bagiku.'  Maka turunlah ayat ini:  { خُذُوا زِينَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ } (Ambillah perhiasan kamu di setiap masjid)."
  },
  {
    "id": 14635,
    "hadith_number": 7358,
    "tajuk_hadith": "Larangan Memaksa Budak Perempuan Berzina",
    "perawi_melayu": "Jabir meriwayatkan bahawa Abdullah bin Ubay bin Salul pernah berkata kepada hamba perempuannya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ، - وَاللَّفْظُ لأَبِي كُرَيْبٍ - حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ كَانَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ ابْنُ سَلُولَ يَقُولُ لِجَارِيَةٍ لَهُ اذْهَبِي فَابْغِينَا شَيْئًا فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ وَلاَ تُكْرِهُوا فَتَيَاتِكُمْ عَلَى الْبِغَاءِ إِنْ أَرَدْنَ تَحَصُّنًا لِتَبْتَغُوا عَرَضَ الْحَيَاةِ الدُّنْيَا وَمَنْ يُكْرِهْهُنَّ فَإِنَّ اللَّهَ مِنْ بَعْدِ إِكْرَاهِهِنَّ‏}‏ لَهُنَّ ‏{‏ غَفُورٌ رَحِيمٌ‏}‏",
    "malay_translation": "Jabir meriwayatkan bahawa Abdullah bin Ubay bin Salul pernah berkata kepada hamba perempuannya, “Pergilah dan bawakan sesuatu untuk kami.”  Disebabkan peristiwa ini, Allah SWT menurunkan ayat ini:  “Dan janganlah kamu paksa hamba perempuan kamu kepada pelacuran, jika mereka sendiri ingin memelihara kesucian diri mereka untuk mencari keuntungan duniawi. Dan sesiapa yang memaksa mereka, maka sesungguhnya Allah Maha Pengampun lagi Maha Mengasihani selepas pemaksaan mereka.” (Surah An-Nur: 33)"
  },
  {
    "id": 14636,
    "hadith_number": 7359,
    "tajuk_hadith": "Larangan Memaksa Hamba Wanita Berzina",
    "perawi_melayu": "Jabir meriwayatkan bahawa Abdullah bin Ubay bin Salul mempunyai dua orang hamba wanita; seorang bernama Musaika dan seorang lagi bernama Umaima, dan dia memaksa mereka melakukan zina. Mereka mengadu hal ini kepada Rasulullah SAW, lalu ayat ini diturunkan:",
    "english_text": "\" And compel not your slave-girls to prostitute\" up to the words:\" Allah is Forgiving, Merciful.\"",
    "arabic_text": "وَحَدَّثَنِي أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، أَنَّ جَارِيَةً، لِعَبْدِ اللَّهِ بْنِ أُبَىٍّ ابْنِ سَلُولَ يُقَالُ لَهَا مُسَيْكَةُ وَأُخْرَى يُقَالُ لَهَا أُمَيْمَةُ فَكَانَ يُكْرِهُهُمَا عَلَى الزِّنَى فَشَكَتَا ذَلِكَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَنْزَلَ اللَّهُ ‏{‏ وَلاَ تُكْرِهُوا فَتَيَاتِكُمْ عَلَى الْبِغَاءِ‏}‏ إِلَى قَوْلِهِ ‏{‏ غَفُورٌ رَحِيمٌ‏}‏",
    "malay_translation": "Jabir meriwayatkan bahawa Abdullah bin Ubay bin Salul mempunyai dua orang hamba wanita; seorang bernama Musaika dan seorang lagi bernama Umaima.  Dia memaksa mereka melakukan zina.  Mereka mengadu hal ini kepada Nabi SAW, lalu Allah SWT menurunkan ayat:  \"Dan janganlah kamu paksa hamba wanita kamu kepada pelacuran.\" sehingga kepada firman:  \"Allah Maha Pengampun, lagi Maha Mengasihani.\""
  },
  {
    "id": 14637,
    "hadith_number": 7360,
    "tajuk_hadith": "Jin Yang Memeluk Islam dan Penyembahan Berterusan",
    "perawi_melayu": "Abdullah bin Mas'ud meriwayatkan berkaitan dengan firman Allah SWT:",
    "english_text": "\" Those to whom they call upon, themselves seek the means or access to their Lord as to whoever of them becomes nearest\" (xvii. 57) that it related to a party of Jinn who were being worshipped and they embraced Islam but those who worshipped them kept on worshipping them (though the Jinn whom the misguided people worshipped had become Muslims). It was then that this verse was revealed.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ أَبِي مَعْمَرٍ، عَنْ عَبْدِ اللَّهِ، فِي قَوْلِهِ عَزَّ وَجَلَّ ‏{‏ أُولَئِكَ الَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَى رَبِّهِمُ الْوَسِيلَةَ أَيُّهُمْ أَقْرَبُ‏}‏ قَالَ كَانَ نَفَرٌ مِنَ الْجِنِّ أَسْلَمُوا وَكَانُوا يُعْبَدُونَ فَبَقِيَ الَّذِينَ كَانُوا يَعْبُدُونَ عَلَى عِبَادَتِهِمْ وَقَدْ أَسْلَمَ النَّفَرُ مِنَ الْجِنِّ ‏.‏",
    "malay_translation": "Hadis ini meriwayatkan tentang sekelompok jin yang disembah, kemudian mereka memeluk Islam.  Namun, orang-orang yang menyembah mereka tetap meneruskan penyembahan meskipun jin-jin tersebut telah memeluk Islam.  Ayat (Surah Al-Isra’, 17:57)  \"Mereka yang mereka seru itu sendiri berusaha mencari jalan kepada Tuhan mereka, siapakah di antara mereka yang paling dekat.\" diturunkan berikutan peristiwa ini."
  },
  {
    "id": 14638,
    "hadith_number": 7361,
    "tajuk_hadith": "Ayat yang diturunkan berkaitan kaum jin yang memeluk Islam",
    "perawi_melayu": "Abdullah bin Mas'ud meriwayatkan berkaitan ayat:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ الْعَبْدِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ أَبِي مَعْمَرٍ، عَنْ عَبْدِ اللَّهِ، ‏{‏ أُولَئِكَ الَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَى رَبِّهِمُ الْوَسِيلَةَ‏}‏ قَالَ كَانَ نَفَرٌ مِنَ الإِنْسِ يَعْبُدُونَ نَفَرًا مِنَ الْجِنِّ فَأَسْلَمَ النَّفَرُ مِنَ الْجِنِّ ‏.‏ وَاسْتَمْسَكَ الإِنْسُ بِعِبَادَتِهِمْ فَنَزَلَتْ ‏{‏ أُولَئِكَ الَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَى رَبِّهِمُ الْوَسِيلَةَ‏}‏\n وَحَدَّثَنِيهِ بِشْرُ بْنُ خَالِدٍ، أَخْبَرَنَا مُحَمَّدٌ، - يَعْنِي ابْنَ جَعْفَرٍ - عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، بِهَذَا الإِسْنَادِ ‏.‏",
    "malay_translation": "Abu Bakar bin Nafi' al-'Abdi meriwayatkan kepada aku, Abdur Rahman meriwayatkan kepada kami, Sufyan meriwayatkan daripada al-A'masy, daripada Ibrahim, daripada Abu Ma'mar, daripada Abdullah: {Mereka yang mereka seru itu sendiri memohon wasilah kepada Tuhan mereka.}  Baginda berkata:  “Suatu kaum manusia menyembah sekumpulan jin. Kemudian sekumpulan jin itu memeluk Islam. Tetapi kaum manusia itu tetap meneruskan penyembahan mereka seperti sebelum ini. Maka turunlah ayat: {Mereka yang mereka seru itu sendiri memohon wasilah kepada Tuhan mereka.}”\n  Basyar bin Khalid juga meriwayatkan kepadaku, Muhammad (iaitu bin Ja'far) memberitakan kepada kami, daripada Syu'bah, daripada Sulaiman, dengan sanad yang sama."
  },
  {
    "id": 14639,
    "hadith_number": 7362,
    "tajuk_hadith": "Ayat Mengenai Kaum Yang Menyembah Jin",
    "perawi_melayu": "Abdullah bin Mas'ud berkata berkaitan ayat tersebut:",
    "english_text": "\" Those whom they call upon, themselves seek the means of access to their Lord,\" that that verse was revealed in connection with a party of Arabs who used to worship a group amnogst the jinn; the jinn embraced Islam but the people kept worshipping them without being conscious of it. Then this verse was revealed:\" Those whom they call upon, themselves seek the means of access to their Lord.\"",
    "arabic_text": "وَحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنِي أَبِي، حَدَّثَنَا حُسَيْنٌ، عَنْ قَتَادَةَ، عَنْ عَبْدِ اللَّهِ بْنِ مَعْبَدٍ الزِّمَّانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ، مَسْعُودٍ ‏{‏ أُولَئِكَ الَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَى رَبِّهِمُ الْوَسِيلَةَ‏}‏ قَالَ نَزَلَتْ فِي نَفَرٍ مِنَ الْعَرَبِ كَانُوا يَعْبُدُونَ نَفَرًا مِنَ الْجِنِّ فَأَسْلَمَ الْجِنِّيُّونَ وَالإِنْسُ الَّذِينَ كَانُوا يَعْبُدُونَهُمْ لاَ يَشْعُرُونَ فَنَزَلَتْ ‏{‏ أُولَئِكَ الَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَى رَبِّهِمُ الْوَسِيلَةَ‏}‏",
    "malay_translation": "Hadis ini menceritakan tentang satu kaum Arab yang menyembah sekumpulan jin.  Jin-jin tersebut memeluk Islam, tetapi kaum Arab itu tetap menyembah mereka tanpa menyedarinya.  Ayat, \"Mereka yang mereka seru,  sendiri-sendiri memohon jalan kepada Tuhan mereka,\" diturunkan berhubung dengan kejadian ini.  Ayat ini menjelaskan bahawa walaupun mereka menyembah jin, jin-jin tersebut juga memohon kepada Allah SWT."
  },
  {
    "id": 14640,
    "hadith_number": 7363,
    "tajuk_hadith": "Tafsir Ibn Abbas tentang Surah At-Taubah, Al-Anfal, dan Al-Hashr",
    "perawi_melayu": "Sa'id bin Jubair meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُطِيعٍ، حَدَّثَنَا هُشَيْمٌ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ قُلْتُ لاِبْنِ عَبَّاسٍ سُورَةُ التَّوْبَةِ قَالَ آلتَّوْبَةِ قَالَ بَلْ هِيَ الْفَاضِحَةُ مَا زَالَتْ تَنْزِلُ وَمِنْهُمْ وَمِنْهُمْ ‏.‏ حَتَّى ظَنُّوا أَنْ لاَ يَبْقَى مِنَّا أَحَدٌ إِلاَّ ذُكِرَ فِيهَا ‏.‏ قَالَ قُلْتُ سُورَةُ الأَنْفَالِ قَالَ تِلْكَ سُورَةُ بَدْرٍ ‏.‏ قَالَ قُلْتُ فَالْحَشْرُ قَالَ نَزَلَتْ فِي بَنِي النَّضِيرِ ‏.‏",
    "malay_translation": "Aku bertanya kepada Ibnu Abbas tentang surah At-Taubah, lalu beliau berkata: “Surah At-Taubah itu adalah surah yang mendedahkan (aib orang-orang kafir dan munafik). Ayat-ayatnya yang menyebut ‘minhum’ (dari kalangan mereka) dan ‘minhum’ (dari kalangan mereka) terus diturunkan sehingga mereka (orang Islam) menyangka bahawa tiada seorang pun yang akan terlepas daripada disebut dan dicela di dalamnya.” Aku bertanya lagi: “Bagaimana pula dengan surah Al-Anfal?” Beliau menjawab: “Itulah surah yang berkaitan dengan Perang Badar.” Aku bertanya lagi tentang surah Al-Hashr, lalu beliau berkata: “Ia diturunkan berkaitan dengan Bani Nadhir.”"
  },
  {
    "id": 14641,
    "hadith_number": 7364,
    "tajuk_hadith": "Larangan Arak dan Masalah-masalah Lain",
    "perawi_melayu": "Ibnu Umar meriwayatkan bahawa Umar menyampaikan khutbah di mimbar Rasulullah SAW, lalu beliau memuji Allah SWT dan seterusnya berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ أَبِي حَيَّانَ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ عُمَرَ، قَالَ خَطَبَ عُمَرُ عَلَى مِنْبَرِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ أَمَّا بَعْدُ أَلاَ وَإِنَّ الْخَمْرَ نَزَلَ تَحْرِيمُهَا يَوْمَ نَزَلَ وَهْىَ مِنْ خَمْسَةِ أَشْيَاءَ مِنَ الْحِنْطَةِ وَالشَّعِيرِ وَالتَّمْرِ وَالزَّبِيبِ وَالْعَسَلِ ‏.‏ وَالْخَمْرُ مَا خَامَرَ الْعَقْلَ وَثَلاَثَةُ أَشْيَاءَ وَدِدْتُ أَيُّهَا النَّاسُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ عَهِدَ إِلَيْنَا فِيهَا الْجَدُّ وَالْكَلاَلَةُ وَأَبْوَابٌ مِنْ أَبْوَابِ الرِّبَا ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Bakar bin Abi Syaibah, telah menceritakan kepada kami Ali bin Mushir, dari Abi Haiyan, dari Asy-Sya’bi, dari Ibnu Umar, katanya: Umar telah berkhutbah di atas mimbar Rasulullah SAW, lalu beliau memuji Allah SWT dan kemudian berkata: “Bahawasanya pengharaman arak telah turun pada hari ia turun, dan ia daripada lima perkara iaitu daripada gandum, barli, tamar, kismis dan madu. Dan arak ialah apa yang memabukkan akal. Dan tiga perkara, wahai manusia, aku amat berharap semoga Rasulullah SAW telah menjelaskan kepada kita mengenainya, iaitu pusaka datuk, harta pusaka orang yang mati tanpa zuriat, dan beberapa bab daripada bab-bab riba.”"
  },
  {
    "id": 14642,
    "hadith_number": 7365,
    "tajuk_hadith": "Larangan Arak dan Keinginan Umar terhadap Penjelasan Lebih Lanjut",
    "perawi_melayu": "Ibnu Umar meriwayatkan:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، أَخْبَرَنَا ابْنُ إِدْرِيسَ، حَدَّثَنَا أَبُو حَيَّانَ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ، عُمَرَ قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ، عَلَى مِنْبَرِ رَسُولِ اللَّهِ صلى الله عليه وسلم يَقُولُ أَمَّا بَعْدُ أَيُّهَا النَّاسُ فَإِنَّهُ نَزَلَ تَحْرِيمُ الْخَمْرِ وَهْىَ مِنْ خَمْسَةٍ مِنَ الْعِنَبِ وَالتَّمْرِ وَالْعَسَلِ وَالْحِنْطَةِ وَالشَّعِيرِ وَالْخَمْرُ مَا خَامَرَ الْعَقْلَ وَثَلاَثٌ أَيُّهَا النَّاسُ وَدِدْتُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ عَهِدَ إِلَيْنَا فِيهِنَّ عَهْدًا نَنْتَهِي إِلَيْهِ الْجَدُّ وَالْكَلاَلَةُ وَأَبْوَابٌ مِنْ أَبْوَابِ الرِّبَا ‏.‏",
    "malay_translation": "Kami diberitakan oleh Abu Kuraib, yang memberitakan kepada kami Ibnu Idris, yang memberitakan kepada kami Abu Haiyan, daripada Asy-Sya'bi, daripada Ibnu Umar. Beliau berkata: Aku mendengar Umar bin al-Khattab di atas mimbar Rasulullah ﷺ bersabda: “Setelah itu, wahai sekalian manusia, sesungguhnya telah turun larangan arak, dan ia terbuat daripada lima jenis iaitu daripada anggur, tamar, madu, gandum dan barli. Arak ialah sesuatu yang memabukkan akal.  Dan tiga perkara lagi wahai sekalian manusia, aku berharap agar Rasulullah ﷺ telah menjelaskan kepada kita tentangnya, iaitu: pusaka datuk, harta orang yang mati tanpa meninggalkan zuriat, dan beberapa bab tentang riba.”"
  },
  {
    "id": 14643,
    "hadith_number": 7366,
    "tajuk_hadith": "Perbezaan Ringkas Dalam Sanad Hadis",
    "perawi_melayu": "Abu Bakar bin Abi Syaibah, Isma'il bin 'Ulayyah, Ishaq bin Ibrahim, 'Isa bin Yunus, dan Abi Hayyan.",
    "english_text": "This hadith has been transmitted on the same authority but with a slight variation of wording.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، ح وَحَدَّثَنَا إِسْحَاقُ، بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، كِلاَهُمَا عَنْ أَبِي حَيَّانَ، بِهَذَا الإِسْنَادِ ‏.‏ بِمِثْلِ حَدِيثِهِمَا غَيْرَ أَنَّ ابْنَ عُلَيَّةَ فِي حَدِيثِهِ الْعِنَبِ ‏.‏ كَمَا قَالَ ابْنُ إِدْرِيسَ وَفِي حَدِيثِ عِيسَى الزَّبِيبِ ‏.‏ كَمَا قَالَ ابْنُ مُسْهِرٍ ‏.‏",
    "malay_translation": "Hadis ini telah diriwayatkan melalui sanad yang sama, tetapi dengan sedikit perbezaan lafaz.  Isma'il bin 'Ulayyah dalam riwayat beliau menyebut tentang anggur, seperti yang dinyatakan oleh Ibnu Idris.  Manakala dalam riwayat 'Isa bin Yunus menyebut kismis, seperti yang dinyatakan oleh Ibnu Mushir."
  },
  {
    "id": 14644,
    "hadith_number": 7367,
    "tajuk_hadith": "Ayat Perselisihan di Perang Badar",
    "perawi_melayu": "Abu Dzar telah bersumpah bahawa ayat ini:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ زُرَارَةَ، حَدَّثَنَا هُشَيْمٌ، عَنْ أَبِي هَاشِمٍ، عَنْ أَبِي مِجْلَزٍ، عَنْ قَيْسِ، بْنِ عُبَادٍ قَالَ سَمِعْتُ أَبَا ذَرٍّ، يُقْسِمُ قَسَمًا إِنَّ ‏{‏ هَذَانِ خَصْمَانِ اخْتَصَمُوا فِي رَبِّهِمْ‏}‏ إِنَّهَا نَزَلَتْ فِي الَّذِينَ بَرَزُوا يَوْمَ بَدْرٍ حَمْزَةُ وَعَلِيٌّ وَعُبَيْدَةُ بْنُ الْحَارِثِ وَعُتْبَةُ وَشَيْبَةُ ابْنَا رَبِيعَةَ وَالْوَلِيدُ بْنُ عُتْبَةَ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Amru bin Zurarah, telah menceritakan kepada kami Husyaim, daripada Abi Hashim, daripada Abi Mijlaz, daripada Qais bin Ubad, dia berkata: Aku mendengar Abu Dzar bersumpah bahawa ayat, \"(Kedua-duanya adalah orang yang bertelagah tentang Tuhan mereka)\", ayat ini turun berkenaan dengan orang-orang yang maju ke hadapan pada hari Badar, iaitu Hamza, Ali, Ubaidah bin Harith (dari pihak kaum Muslimin), dan Utbah, Syaibah, kedua-duanya anak Rabi'ah, dan Walid bin Utbah (dari pihak orang-orang musyrik Makkah)."
  },
  {
    "id": 14645,
    "hadith_number": 7368,
    "tajuk_hadith": "Hadis daripada Abu Dzar al-Ghifari",
    "perawi_melayu": "Abu Bakar bin Abi Syaibah, Waki', Muhammad bin Muthanna, Abdur Rahman, semuanya daripada Sufyan, daripada Abu Hashim, daripada Abu Mijlaz, daripada Qais bin Ubad, daripada Abu Dzar al-Ghifari",
    "english_text": "This hadith has been narrated on the authority of Abu Dharr through another chain of transmitters.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، جَمِيعًا عَنْ سُفْيَانَ، عَنْ أَبِي هَاشِمٍ، عَنْ أَبِي مِجْلَزٍ، عَنْ قَيْسِ بْنِ عُبَادٍ، قَالَ سَمِعْتُ أَبَا ذَرٍّ، يُقْسِمُ لَنَزَلَتْ ‏{‏ هَذَانِ خَصْمَانِ‏}‏ بِمِثْلِ حَدِيثِ هُشَيْمٍ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Abu Dzar melalui beberapa sanad yang lain.  Abu Bakar bin Abi Syaibah meriwayatkan, daripada Waki', dan Muhammad bin Muthanna meriwayatkan, daripada Abdur Rahman, semuanya daripada Sufyan, daripada Abu Hashim, daripada Abu Mijlaz, daripada Qais bin Ubad, yang berkata: Aku mendengar Abu Dzar bersumpah bahawa ayat  { هَذَانِ خَصْمَانِ }  turun berkaitan dengan kisah yang serupa dengan kisah Hushaim."
  }
]
