[
  {
    "id": 10553,
    "hadith_number": 3276,
    "tajuk_hadith": "Perkahwinan sebagai Pembasmi Nafsu Jahat dan Penjagaan Kesucian",
    "perawi_melayu": "'Alqama melaporkan:",
    "english_text": "While I was walking with 'Abdullah at Mina, 'Uthman happened to meet him. He stopped there and began to talk with him. Uthman said to him: Abu 'Abd al-Rahman, should we not marry you to a young girl who may recall to you some of the past of your bygone days; thereupon he said: If you say so, Allah's Messenger (ﷺ) said: 0 young men, those among you who can support a wife should marry, for it restrains eyes from casting (evil glances). and preserves one from immorality; but those who cannot should devote themselves to fasting for it is a means of controlling sexual desire.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الْعَلاَءِ الْهَمْدَانِيُّ جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ، - وَاللَّفْظُ لِيَحْيَى أَخْبَرَنَا أَبُو مُعَاوِيَةَ، - عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، قَالَ كُنْتُ أَمْشِي مَعَ عَبْدِ اللَّهِ بِمِنًى فَلَقِيَهُ عُثْمَانُ فَقَامَ مَعَهُ يُحَدِّثُهُ فَقَالَ لَهُ عُثْمَانُ يَا أَبَا عَبْدِ الرَّحْمَنِ أَلاَ نُزَوِّجُكَ جَارِيَةً شَابَّةً لَعَلَّهَا تُذَكِّرُكَ بَعْضَ مَا مَضَى مِنْ زَمَانِكَ ‏.‏ قَالَ فَقَالَ عَبْدُ اللَّهِ لَئِنْ قُلْتَ ذَاكَ لَقَدْ قَالَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَا مَعْشَرَ الشَّبَابِ مَنِ اسْتَطَاعَ مِنْكُمُ الْبَاءَةَ فَلْيَتَزَوَّجْ فَإِنَّهُ أَغَضُّ لِلْبَصَرِ وَأَحْصَنُ لِلْفَرْجِ وَمَنْ لَمْ يَسْتَطِعْ فَعَلَيْهِ بِالصَّوْمِ فَإِنَّهُ لَهُ وِجَاءٌ ‏\"‏ ‏.‏",
    "malay_translation": "Dikisahkan oleh 'Alqama, \"Ketika aku berjalan bersama 'Abdullah di Mina, 'Uthman menemuinya. Beliau berhenti dan bercakap dengannya. 'Uthman berkata kepadanya, 'Wahai Abu 'Abd al-Rahman, mengapakah kita tidak menikahkanmu dengan seorang gadis muda yang mungkin mengingatkanmu akan kenangan masa silam?' Abdullah menjawab, 'Jika demikian, Rasulullah SAW telah bersabda, \"Wahai para pemuda, sesiapa di antara kamu yang mampu menanggung nafkah isteri, hendaklah dia berkahwin, kerana ia dapat menundukkan pandangan dan memelihara kemaluan. Akan tetapi, sesiapa yang tidak mampu, hendaklah dia berpuasa, kerana ia merupakan jalan untuk mengawal nafsu.\" \""
  },
  {
    "id": 10554,
    "hadith_number": 3277,
    "tajuk_hadith": "Perbincangan Mengenai Perkahwinan dan Peringatan pada Masa Lalu",
    "perawi_melayu": "'Alqama meriwayatkan:",
    "english_text": "While I was going along with 'Abdullah b. Ma'sud (Allah he pleased with him) in Mina, 'Uthman b. 'Affan (Allah be pleased with him) happened to meet him and said: Come here, Abu 'Abd al-Rahman (kunya of Abdullah b. Mas'ud), and he isolated him (from me), and when 'Abdullah (b. Mas'ud) saw that there was no need (for this privacy), he said to me: 'Alqama, come on, and so I went there. (Then) 'Uthman said to him: Abu Abd al-Rahman, should we not marry you to a virgin girl that your past may be recalled to your mind? 'Abdullah said: If you say so, the rest of the hadith is the same as narrated above.",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، قَالَ إِنِّي لأَمْشِي مَعَ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ بِمِنًى إِذْ لَقِيَهُ عُثْمَانُ بْنُ عَفَّانَ فَقَالَ هَلُمَّ يَا أَبَا عَبْدِ الرَّحْمَنِ قَالَ فَاسْتَخْلاَهُ فَلَمَّا رَأَى عَبْدُ اللَّهِ أَنْ لَيْسَتْ لَهُ حَاجَةٌ - قَالَ - قَالَ لِي تَعَالَ يَا عَلْقَمَةُ - قَالَ - فَجِئْتُ فَقَالَ لَهُ عُثْمَانُ أَلاَ نُزَوِّجُكَ يَا أَبَا عَبْدِ الرَّحْمَنِ جَارِيَةً بِكْرًا لَعَلَّهُ يَرْجِعُ إِلَيْكَ مِنْ نَفْسِكَ مَا كُنْتَ تَعْهَدُ فَقَالَ عَبْدُ اللَّهِ لَئِنْ قُلْتَ ذَاكَ ‏.‏ فَذَكَرَ بِمِثْلِ حَدِيثِ أَبِي مُعَاوِيَةَ ‏.‏",
    "malay_translation": "Diceritakan oleh 'Alqama, bahawa aku berjalan bersama 'Abdullah bin Mas'ud di Mina, tiba-tiba 'Uthman bin 'Affan bertemu dengannya. Beliau memanggil, 'Marilah, wahai Abu Abd al-Rahman.'  Kemudian, 'Uthman mengasingkan 'Abdullah bin Mas'ud daripada aku.  Apabila 'Abdullah bin Mas'ud melihat tidak ada keperluan untuk persendirian itu, beliau memanggilku, 'Alqama, marilah.'  Kemudian aku pun datang.  Lalu 'Uthman bertanya kepadanya, 'Wahai Abu Abd al-Rahman, adakah kita tidakkah menikahkan engkau dengan gadis perawan, agar ingatanmu terhadap masa lalu dapat kembali?'  'Abdullah menjawab, 'Jika demikian, ' (selebihnya hadith sama seperti yang diriwayatkan oleh Abu Mu'awiyah.)"
  },
  {
    "id": 10555,
    "hadith_number": 3278,
    "tajuk_hadith": "Perkahwinan Sebagai Penjagaan Mata dan Kehormatan",
    "perawi_melayu": "Abdullah bin Mas'ud (رضي الله عنه) meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "0 young men, those among you who can support a wife should marry, for it restrains eyes (from casting evil glances) and preserves one from immorality; but he who cannot afford It should observe fast for it is a means of controlling the sexual desire.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَا مَعْشَرَ الشَّبَابِ مَنِ اسْتَطَاعَ مِنْكُمُ الْبَاءَةَ فَلْيَتَزَوَّجْ فَإِنَّهُ أَغَضُّ لِلْبَصَرِ وَأَحْصَنُ لِلْفَرْجِ وَمَنْ لَمْ يَسْتَطِعْ فَعَلَيْهِ بِالصَّوْمِ فَإِنَّهُ لَهُ وِجَاءٌ ‏\"‏ ‏.‏",
    "malay_translation": "Wahai para pemuda, sesiapa di antara kamu yang mampu menanggung isteri, maka hendaklah dia berkahwin. Kerana ia dapat menahan pandangan yang buruk dan memelihara kehormatan. Namun, bagi yang tidak mampu, maka berpuasalah, kerana ia merupakan jalan untuk mengawal nafsu."
  },
  {
    "id": 10556,
    "hadith_number": 3279,
    "tajuk_hadith": "Perkahwinan Sebagai Tindak Balas Kepada Hadis",
    "perawi_melayu": "Abu al-Rahman bin Yazid berkata:",
    "english_text": "I and my uncle 'Alqama and al-Aswad went to 'Abdullah b. Mas'ud (Allah be pleased with him). He (the narrator further) said: I was at that time young, and he narrated a hadith which it seemed he narrated for me that Allah's Messenger (ﷺ) said like one transmitted by Mu'awiya, and further added: I lost no time in marrying.",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، قَالَ دَخَلْتُ أَنَا وَعَمِّي، عَلْقَمَةُ وَالأَسْوَدُ عَلَى عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ وَأَنَا شَابٌّ، يَوْمَئِذٍ فَذَكَرَ حَدِيثًا رُئِيتُ أَنَّهُ حَدَّثَ بِهِ، مِنْ أَجْلِي قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ بِمِثْلِ حَدِيثِ أَبِي مُعَاوِيَةَ وَزَادَ قَالَ فَلَمْ أَلْبَثْ حَتَّى تَزَوَّجْتُ ‏.‏",
    "malay_translation": "Saya, bersama pakcik saya 'Alqama dan Al-Aswad, pergi menemui 'Abdullah bin Mas'ud (Semoga Allah redha kepadanya). Beliau (pencerita selanjutnya) berkata: Ketika itu saya masih muda, dan beliau menceritakan satu hadis yang kelihatan seperti diceritakan untuk saya, bahawa Rasulullah SAW bersabda seperti yang diriwayatkan oleh Mu'awiyah, dan tambahannya: Saya tidak lama kemudian berkahwin."
  },
  {
    "id": 10557,
    "hadith_number": 3280,
    "tajuk_hadith": "Tidak Disebutkan tentang Keinginan Menikah Walaupun Remaja",
    "perawi_melayu": "'Abd al-Rahman bin Yazid melaporkan berdasarkan Abdullah",
    "english_text": "We went to him, and I was the youngest of all (of us), but he did not mention:\" I lost no time in marrying.\"",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ سَعِيدٍ الأَشَجُّ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الأَعْمَشُ، عَنْ عُمَارَةَ بْنِ، عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ عَبْدِ اللَّهِ، قَالَ دَخَلْنَا عَلَيْهِ وَأَنَا أَحْدَثُ الْقَوْمِ، بِمِثْلِ حَدِيثِهِمْ وَلَمْ يَذْكُرْ فَلَمْ أَلْبَثْ حَتَّى تَزَوَّجْتُ ‏.‏",
    "malay_translation": "Kami pergi kepadanya, dan saya adalah yang termuda di antara kami, tetapi beliau tidak menyebut, \"Saya tidak membuang masa untuk berkahwin.\""
  },
  {
    "id": 10558,
    "hadith_number": 3281,
    "tajuk_hadith": "Larangan Menolak Sunnah Nabi dan Kepentingan Mengamalkannya",
    "perawi_melayu": "Anas bin Malik رضي الله عنه melaporkan bahawa sebahagian sahabat Rasulullah SAW bertanya kepada isteri-isteri Baginda SAW tentang amalan Baginda SAW secara peribadi. Ada di antara mereka berkata:",
    "english_text": "I will not marry women; someone among them said: I will not eat meat; and someone among them said: I will not lie down in bed. He (the Holy Prophet) praised Allah and glorified Him, and said: What has happened to these people that they say so and so, whereas I observe prayer and sleep too; I observe fast and suspend observing them; I marry women also? And he who turns away from my Sunnah, he has no relation with Me",
    "arabic_text": "وَحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ الْعَبْدِيُّ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ نَفَرًا، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم سَأَلُوا أَزْوَاجَ النَّبِيِّ صلى الله عليه وسلم عَنْ عَمَلِهِ فِي السِّرِّ فَقَالَ بَعْضُهُمْ لاَ أَتَزَوَّجُ النِّسَاءَ ‏.‏ وَقَالَ بَعْضُهُمْ لاَ آكُلُ اللَّحْمَ ‏.‏ وَقَالَ بَعْضُهُمْ لاَ أَنَامُ عَلَى فِرَاشٍ ‏.‏ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ‏.‏ فَقَالَ ‏\n\"‏ مَا بَالُ أَقْوَامٍ قَالُوا كَذَا وَكَذَا لَكِنِّي أُصَلِّي وَأَنَامُ وَأَصُومُ وَأُفْطِرُ وَأَتَزَوَّجُ النِّسَاءَ فَمَنْ رَغِبَ عَنْ سُنَّتِي فَلَيْسَ مِنِّي ‏\"‏ ‏.‏",
    "malay_translation": "Telah diceritakan kepada saya oleh Abu Bakar bin Nafi' al-Abdi, yang mendengarnya daripada Behzan, yang mendengarnya daripada Hammad bin Salamah, daripada Sabit, daripada Anas رضي الله عنه. Bahawa sebahagian sahabat Rasulullah SAW bertanya kepada isteri-isteri Baginda SAW tentang amalan Baginda SAW secara sulit. Ada di antara mereka berkata, \"Saya tidak akan mengahwini wanita.\" Ada yang berkata, \"Saya tidak akan makan daging.\" Dan ada yang berkata, \"Saya tidak akan tidur di atas katil.\" Kemudian Baginda SAW memuji Allah dan memuliakan-Nya, dan bersabda, \"Apakah yang berlaku kepada sekelompok manusia yang mengatakan demikian, sedangkan aku tetap solat dan tidur, berpuasa dan berbuka, dan juga berkahwin? Sesiapa yang mengingkari Sunnahku, maka dia bukan dari kalangan umatku.\" "
  },
  {
    "id": 10559,
    "hadith_number": 3282,
    "tajuk_hadith": "Penolakan Nabi SAW terhadap Kezuhudan Uthman bin Maz'un",
    "perawi_melayu": "Sa'd bin Abi Waqqas (رضي الله عنه) meriwayatkan:",
    "english_text": "The Messengger of Allah (ﷺ) rejected (the idea) of Uthman b. Muz'unliving in celibacy (saying): And if he (the Holy Prophet) had given me permission We would have got ourselves castrated.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ - وَاللَّفْظُ لَهُ - أَخْبَرَنَا ابْنُ الْمُبَارَكِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ، الْمُسَيَّبِ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، قَالَ رَدَّ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى عُثْمَانَ بْنِ مَظْعُونٍ التَّبَتُّلَ وَلَوْ أَذِنَ لَهُ لاَخْتَصَيْنَا ‏.‏",
    "malay_translation": "Pesuruh Allah SAW menolak amalan zuhud Uthman bin Maz'un. Baginda bersabda, 'Sekiranya baginda mengizinkan, kami akan mencacatkan diri'."
  },
  {
    "id": 10560,
    "hadith_number": 3283,
    "tajuk_hadith": "Penolakan Perbuatan Menjauhkan Diri Dari Perkahwinan oleh Nabi SAW",
    "perawi_melayu": "Sa'id bin al-Musayyib meriwayatkan:",
    "english_text": "I heard Sa'd (b. Abi Waqqas) saying that the idea of 'Uthman b. Maz'un for living in celibacy was rejected (by the Holy Prophet), and if he had been given permission they would have got themselves castrated.",
    "arabic_text": "وَحَدَّثَنِي أَبُو عِمْرَانَ، مُحَمَّدُ بْنُ جَعْفَرِ بْنِ زِيَادٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ، شِهَابٍ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، قَالَ سَمِعْتُ سَعْدًا، يَقُولُ رُدَّ عَلَى عُثْمَانَ بْنِ مَظْعُونٍ التَّبَتُّلُ وَلَوْ أُذِنَ لَهُ لاَخْتَصَيْنَا ‏.‏",
    "malay_translation": "Aku mendengar Sa'd (bin Abi Waqqas) berkata bahawa idea 'Uthman bin Maz'un untuk menjauhkan diri dari perkahwinan ditolak oleh Nabi SAW. Sekiranya beliau dibenarkan, mereka akan mencacatkan diri mereka sendiri."
  },
  {
    "id": 10561,
    "hadith_number": 3284,
    "tajuk_hadith": "Larangan Rasulullah SAW terhadap Kezuhudan yang Ekstrem",
    "perawi_melayu": "Sa'id bin al-Musayyib mendengar Sa'd bin Abi Waqqas (redha Allah dengannya) berkata bahawa Uthman bin Maz'un berhasrat untuk berzuhud, tetapi Rasulullah SAW melarangnya. Dan jika Rasulullah SAW mengizinkannya, nescaya kita akan menunaikannya.",
    "english_text": "Sa'id b. al Musayyib heard Sa'd b. Abi Waqqas (Allah be pleased with him) saying that Uthman b. Maz'un decided to live in celibacy, but Allah's Messenger (ﷺ) forbade him to do so, and if he had permitted him, we would have got ourselves castrated.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا حُجَيْنُ بْنُ الْمُثَنَّى، حَدَّثَنَا لَيْثٌ، عَنْ عُقَيْلٍ، عَنِ ابْنِ، شِهَابٍ أَنَّهُ قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّهُ سَمِعَ سَعْدَ بْنَ أَبِي وَقَّاصٍ، يَقُولُ أَرَادَ عُثْمَانُ بْنُ مَظْعُونٍ أَنْ يَتَبَتَّلَ، فَنَهَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم وَلَوْ أَجَازَ لَهُ ذَلِكَ لاَخْتَصَيْنَا ‏.‏",
    "malay_translation": "Sa'id bin al-Musayyib mendengar Sa'd bin Abi Waqqas (redha Allah dengannya) berkata bahawa Uthman bin Maz'un ingin mengamalkan zuhud.  Namun, Rasulullah SAW melarangnya daripada melakukannya. Dan sekiranya Baginda mengizinkannya, nescaya kami semua akan melakukan penyeksaan diri untuk mencapai kezuhudan yang ekstrem itu."
  },
  {
    "id": 10562,
    "hadith_number": 3285,
    "tajuk_hadith": "Peringatan Mengenai Wanita dan Kawalan Nafsu",
    "perawi_melayu": "Jabir melaporkan bahawa Rasulullah SAW melihat seorang wanita, lalu beliau mendatangi isterinya, Zainab, ketika beliau sedang menyamak kulit dan melakukan hubungan seksual dengannya. Selepas itu, baginda pergi kepada para sahabat dan berkata:",
    "english_text": "The woman advances and retires in the shape of a devil, so when one of you sees a woman, he should come to his wife, for that will repel what he feels in his heart.",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا هِشَامُ بْنُ أَبِي عَبْدِ اللَّهِ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَأَى امْرَأَةً فَأَتَى امْرَأَتَهُ زَيْنَبَ وَهْىَ تَمْعَسُ مَنِيئَةً لَهَا فَقَضَى حَاجَتَهُ ثُمَّ خَرَجَ إِلَى أَصْحَابِهِ فَقَالَ ‏\n\"‏ إِنَّ الْمَرْأَةَ تُقْبِلُ فِي صُورَةِ شَيْطَانٍ وَتُدْبِرُ فِي صُورَةِ شَيْطَانٍ فَإِذَا أَبْصَرَ أَحَدُكُمُ امْرَأَةً فَلْيَأْتِ أَهْلَهُ فَإِنَّ ذَلِكَ يَرُدُّ مَا فِي نَفْسِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Wanita itu datang dan pergi seperti iblis. Oleh itu, jika salah seorang daripada kamu melihat seorang wanita, hendaklah dia pergi kepada isterinya, kerana hal itu akan menolak apa yang ada di hatinya."
  },
  {
    "id": 10563,
    "hadith_number": 3286,
    "tajuk_hadith": "Tindakan Wanita Dalam Bentuk Syaitan",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan bahawa Rasulullah SAW melihat seorang wanita; dan selebihnya hadis itu diriwayatkan tetapi (dengan pengecualian ini) baginda bersabda bahawa baginda datang kepada isterinya Zainab, yang sedang menyamak kulit, dan baginda tidak menyebut tentang:",
    "english_text": "\" She retires in the shape of satan.\"",
    "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنَا حَرْبُ بْنُ أَبِي، الْعَالِيَةِ حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى امْرَأَةً ‏.‏ فَذَكَرَ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ فَأَتَى امْرَأَتَهُ زَيْنَبَ وَهْىَ تَمْعَسُ مَنِيئَةً ‏.‏ وَلَمْ يَذْكُرْ تُدْبِرُ فِي صُورَةِ شَيْطَانٍ ‏.‏",
    "malay_translation": "Dikatakan bahawa Rasulullah SAW melihat seorang wanita; dan selebihnya hadis itu diriwayatkan tetapi (dengan pengecualian ini) baginda bersabda, bahawa baginda pergi menemui isterinya, Zainab, sedang menyamak kulit.  Baginda tidak menyebut tentang wanita itu berundur dalam bentuk syaitan."
  },
  {
    "id": 10564,
    "hadith_number": 3287,
    "tajuk_hadith": "Mengatasi Gairah Hati dengan Istri",
    "perawi_melayu": "Jabir mendengar Rasulullah SAW bersabda:",
    "english_text": "When a woman fascinates any one of you and she captivates his heart, he should go to his wife and have an intercourse with her, for it would repel what he feels.",
    "arabic_text": "وَحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ، قَالَ قَالَ جَابِرٌ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِذَا أَحَدُكُمْ أَعْجَبَتْهُ الْمَرْأَةُ فَوَقَعَتْ فِي قَلْبِهِ فَلْيَعْمِدْ إِلَى امْرَأَتِهِ فَلْيُوَاقِعْهَا فَإِنَّ ذَلِكَ يَرُدُّ مَا فِي نَفْسِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila seorang wanita menarik perhatian salah seorang daripada kalian dan dia terpaut dalam hatinya, maka hendaklah dia mendatangi isterinya dan melakukan hubungan intim dengannya, kerana ia akan meredakan apa yang ada dalam hatinya."
  },
  {
    "id": 10565,
    "hadith_number": 3288,
    "tajuk_hadith": "Penjelasan Perkahwinan Sementara dan Larangan Mensterilkan Diri",
    "perawi_melayu": "Abdullah bin Mas'ud meriwayatkan:",
    "english_text": "We were on an expedition with Allah's Messenger (ﷺ) and we had no women with us. We said: Should we not have ourselves castrated? He (the Holy Prophet) forbade us to do so He then granted us permission that we should contract temporary marriage for a stipulated period giving her a garment, and 'Abdullah then recited this verse: 'Those who believe do not make unlawful the good things which Allah has made lawful for you, and do not transgress. Allah does not like trangressers\" (al-Qur'an, v. 87).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ الْهَمْدَانِيُّ، حَدَّثَنَا أَبِي وَوَكِيعٌ، وَابْنُ، بِشْرٍ عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ، يَقُولُ كُنَّا نَغْزُو مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم لَيْسَ لَنَا نِسَاءٌ فَقُلْنَا أَلاَ نَسْتَخْصِي فَنَهَانَا عَنْ ذَلِكَ ثُمَّ رَخَّصَ لَنَا أَنْ نَنْكِحَ الْمَرْأَةَ بِالثَّوْبِ إِلَى أَجَلٍ ثُمَّ قَرَأَ عَبْدُ اللَّهِ ‏{‏ يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تُحَرِّمُوا طَيِّبَاتِ مَا أَحَلَّ اللَّهُ لَكُمْ وَلاَ تَعْتَدُوا إِنَّ اللَّهَ لاَ يُحِبُّ الْمُعْتَدِينَ‏}‏ ‏.‏",
    "malay_translation": "Kami pernah menyertai ekspedisi bersama Rasulullah SAW, dan kami tidak mempunyai isteri. Kami bertanya, \"Adakah patut kami mensterilkan diri?\" Baginda (Rasulullah SAW) melarang kami berbuat demikian, kemudian membenarkan kami berkahwin sementara (mut'ah) untuk tempoh yang ditentukan dengan memberikan pakaian kepada wanita tersebut, dan Abdullah kemudian membaca ayat ini: \"Wahai orang-orang yang beriman, janganlah kamu mengharamkan perkara-perkara yang baik yang Allah halalkan untuk kamu, dan janganlah kamu melampaui batas. Sesungguhnya Allah tidak menyukai orang yang melampaui batas.\" (al-Quran, ayat 87)."
  },
  {
    "id": 10566,
    "hadith_number": 3289,
    "tajuk_hadith": "Hadis tentang Perbacaan Ayat dan Pernyataan Jarir",
    "perawi_melayu": "Jarir",
    "english_text": "Hadis ini diriwayatkan oleh Jarir dengan sanad yang sama dan beliau juga membacakan ayat tersebut kepada kami, namun beliau tidak mengatakan bahawa 'Abdullah membacanya.",
    "arabic_text": "وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، بِهَذَا الإِسْنَادِ ‏.‏ مِثْلَهُ وَقَالَ ثُمَّ قَرَأَ عَلَيْنَا هَذِهِ الآيَةَ ‏.‏ وَلَمْ يَقُلْ قَرَأَ عَبْدُ اللَّهِ ‏.‏",
    "malay_translation": "Hadis ini telah disampaikan kepada kami oleh Uthman bin Abi Syaibah yang mendengarnya daripada Jarir, daripada Ismail bin Abi Khalid, dengan sanad yang sama. Jarir turut membacakan ayat tersebut kepada kami, tetapi beliau tidak menyebut bahawa 'Abdullah membacanya."
  },
  {
    "id": 10567,
    "hadith_number": 3290,
    "tajuk_hadith": "Soalan Tentang Pemberian Sunat Menyamarkan Ekspedisi",
    "perawi_melayu": "Hadith ini diriwayatkan daripada Isma'il dengan sanad yang sama (dan perkataannya adalah):",
    "english_text": "\" We were young, so we said: Allah's Messenger, should we not have ourselves castrated? But he (the narrator) did not say; We were on an expedition.\"",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ إِسْمَاعِيلَ، بِهَذَا الإِسْنَادِ قَالَ كُنَّا وَنَحْنُ شَبَابٌ فَقُلْنَا يَا رَسُولَ اللَّهِ أَلاَ نَسْتَخْصِي وَلَمْ يَقُلْ نَغْزُو ‏.‏",
    "malay_translation": "\"Kami masih muda, lalu kami bertanya kepada Rasulullah: Adakah tidak patut kami melakukan sunat? Namun, beliau (perawi) tidak menyebut tentang ekspedisi.\" "
  },
  {
    "id": 10568,
    "hadith_number": 3291,
    "tajuk_hadith": "Keizinan Rasulullah SAW Mengenai Perkahwinan Sementara",
    "perawi_melayu": "Jabir bin Abdullah dan Salama bin al-Akwa berkata:",
    "english_text": "There came to us the proclaimer of Allah's Messenger (ﷺ) and said: Allah's Messenger (ﷺ) has granted you permission to benefit yourselves, i. e. to contract temporary marriage with women.",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ دِينَارٍ، قَالَ سَمِعْتُ الْحَسَنَ بْنَ مُحَمَّدٍ، يُحَدِّثُ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، وَسَلَمَةَ بْنِ الأَكْوَعِ، قَالاَ خَرَجَ عَلَيْنَا مُنَادِي رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ أَذِنَ لَكُمْ أَنْ تَسْتَمْتِعُوا ‏.‏ يَعْنِي مُتْعَةَ النِّسَاءِ ‏.‏",
    "malay_translation": "Seorang pemberi maklum Rasulullah SAW datang kepada kami dan berkata: Rasulullah SAW telah memberikan izin kepada kamu untuk mendapatkan manfaat, iaitu untuk berkahwin sementara dengan wanita."
  },
  {
    "id": 10569,
    "hadith_number": 3292,
    "tajuk_hadith": "Keizinan Perkahwinan Sementara daripada Rasulullah SAW",
    "perawi_melayu": "Salama bin al-Akwa' dan Jabir bin Abdullah meriwayatkan:",
    "english_text": "Allah's Messenger (ﷺ) came to us and permitted us to contract temporary marriage.",
    "arabic_text": "وَحَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامَ الْعَيْشِيُّ، حَدَّثَنَا يَزِيدُ، - يَعْنِي ابْنَ زُرَيْعٍ - حَدَّثَنَا رَوْحٌ، - يَعْنِي ابْنَ الْقَاسِمِ - عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ، عَنْ سَلَمَةَ بْنِ الأَكْوَعِ، وَجَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَتَانَا فَأَذِنَ لَنَا فِي الْمُتْعَةِ ‏.‏",
    "malay_translation": "Utusan Allah (ﷺ) datang kepada kami dan membenarkan kami untuk melakukan perkahwinan sementara."
  },
  {
    "id": 10570,
    "hadith_number": 3293,
    "tajuk_hadith": "Kebolehan Perkahwinan Sementara pada Zaman Nabi dan Khalifah",
    "perawi_melayu": "Ibn Uraij melaporkan:",
    "english_text": "'Ati' reported that jibir b. Abdullah came to perform 'Umra, and we came to his abode, and the people asked him about different things, and then they made a mention of temporary marriage, whereupon he said: Yes, we had been benefiting ourselves by this temporary marriage during the lifetime of the Prophet (ﷺ) and during the time of Abu Bakr and 'Umar.",
    "arabic_text": "وَحَدَّثَنَا الْحَسَنُ الْحُلْوَانِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ قَالَ عَطَاءٌ قَدِمَ جَابِرُ بْنُ عَبْدِ اللَّهِ مُعْتَمِرًا فَجِئْنَاهُ فِي مَنْزِلِهِ فَسَأَلَهُ الْقَوْمُ عَنْ أَشْيَاءَ ثُمَّ ذَكَرُوا الْمُتْعَةَ فَقَالَ نَعَمِ اسْتَمْتَعْنَا عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَبِي بَكْرٍ وَعُمَرَ ‏.‏",
    "malay_translation": "‘Ati’ melaporkan bahawa Jabir bin Abdullah datang untuk menunaikan umrah, dan kami menemui beliau di kediamannya. Orang ramai bertanya kepadanya mengenai pelbagai perkara, kemudian mereka menyebut tentang perkahwinan sementara. Lalu Jabir menjawab: Ya, kami telah menikmati faedah perkahwinan sementara pada zaman Rasulullah SAW dan zaman Abu Bakar serta Umar."
  },
  {
    "id": 10571,
    "hadith_number": 3294,
    "tajuk_hadith": "Perkahwinan Sementara dan Larangannya",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan:",
    "english_text": "Kami mengamalkan perkahwinan sementara dengan memberikan segenggam kurma atau tepung sebagai mas kahwin semasa zaman Rasulullah SAW dan zaman Abu Bakar sehingga Umar melarangnya dalam kes Amr bin Huraith.",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ كُنَّا نَسْتَمْتِعُ بِالْقُبْضَةِ مِنَ التَّمْرِ وَالدَّقِيقِ الأَيَّامَ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَبِي بَكْرٍ حَتَّى نَهَى عَنْهُ عُمَرُ فِي شَأْنِ عَمْرِو بْنِ حُرَيْثٍ ‏.‏",
    "malay_translation": "Kami mengamalkan perkahwinan sementara dengan memberikan segenggam kurma atau tepung sebagai mas kahwin pada zaman Rasulullah SAW dan Abu Bakar sehingga Umar melarangnya dalam kes Amr bin Huraith.  Kami, pada zaman Rasulullah SAW dan Abu Bakar, telah mengamalkan perkahwinan sementara dengan memberikan segenggam kurma dan tepung sebagai mas kahwin. Amalan ini berterusan sehingga Umar melarangnya dalam kes Amr bin Huraith."
  },
  {
    "id": 10572,
    "hadith_number": 3295,
    "tajuk_hadith": "Perselisihan Pendapat tentang Mut'ah dan Larangan Khalifah Umar",
    "perawi_melayu": "Abu Nadrah meriwayatkan:",
    "english_text": "While I was in the company of Jabir b. Abdullah, a person came to him and said that Ibn 'Abbas and Ibn Zubair differed on the two types of Mut'as (Tamattu' of Hajj 1846 and Tamattu' with women), whereupon Jabir said: We used to do these two during the lifetime of Allah's Messenger (ﷺ). Umar then forbade us to do them, and so we did not revert to them.",
    "arabic_text": "حَدَّثَنَا حَامِدُ بْنُ عُمَرَ الْبَكْرَاوِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، - يَعْنِي ابْنَ زِيَادٍ - عَنْ عَاصِمٍ، عَنْ أَبِي نَضْرَةَ، قَالَ كُنْتُ عِنْدَ جَابِرِ بْنِ عَبْدِ اللَّهِ فَأَتَاهُ آتٍ فَقَالَ ابْنُ عَبَّاسٍ وَابْنُ الزُّبَيْرِ اخْتَلَفَا فِي الْمُتْعَتَيْنِ فَقَالَ جَابِرٌ فَعَلْنَاهُمَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ نَهَانَا عَنْهُمَا عُمَرُ فَلَمْ نَعُدْ لَهُمَا ‏.‏",
    "malay_translation": "Ketika aku bersama Jabir bin Abdullah, seorang datang kepadanya dan berkata bahawa Ibnu Abbas dan Ibnu Zubair berselisih tentang dua jenis Mut'ah (Tamattu' haji dan Tamattu' dengan wanita), lalu Jabir berkata: Kami biasa melakukannya semasa hayat Rasulullah SAW. Kemudian Umar melarang kami melakukannya, dan kami tidak kembali kepadanya."
  },
  {
    "id": 10573,
    "hadith_number": 3296,
    "tajuk_hadith": "Keizinan dan Larangan Pernikahan Sementara (Mut'ah)",
    "perawi_melayu": "Iyas bin Salama daripada bapanya",
    "english_text": "Iyas b. Salama reported on the authority of his father that Allah's Messenger (ﷺ) gave sanction for contracting temporary marriage for three nights in the year of Autas 1847 and then forbade it.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا أَبُو عُمَيْسٍ، عَنْ إِيَاسِ بْنِ سَلَمَةَ، عَنْ أَبِيهِ، قَالَ رَخَّصَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَامَ أَوْطَاسٍ فِي الْمُتْعَةِ ثَلاَثًا ثُمَّ نَهَى عَنْهَا ‏.‏",
    "malay_translation": "Iyas bin Salama meriwayatkan daripada bapanya bahawa Rasulullah SAW mengizinkan pernikahan sementara (mut'ah) selama tiga malam pada tahun Autas 1847, kemudian melarangnya."
  },
  {
    "id": 10574,
    "hadith_number": 3297,
    "tajuk_hadith": "Keizinan Perkahwinan Sementara dan Penjelasan Rasulullah SAW",
    "perawi_melayu": "Sabra al-Juhani melaporkan:",
    "english_text": "Allah's Messenger (ﷺ) permitted temporary marriage for us. So I and another person went out and saw a woman of Bana 'Amir, who was like a young long-necked she-camel. We presented ourselves to her (for contracting temporary marriage), whereupon she said: What dower would you give me? I said: My cloak. And my companion also said: My cloak. And the cloak of-my companion was superior to my cloak, but I was younger than he. So when she looked at the cloak of my companion she liked it, and when she cast a glance at me I looked more attractive to her. She then said: Well, you and your cloak are sufficient for me. I remained with her for three nights, and then Allah's Messenger (ﷺ) said: He who has any such woman with whom he had contracted temporary marriage, he should let her off.",
    "arabic_text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنِ الرَّبِيعِ بْنِ سَبْرَةَ الْجُهَنِيِّ، عَنْ أَبِيهِ، سَبْرَةَ أَنَّهُ قَالَ أَذِنَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْمُتْعَةِ فَانْطَلَقْتُ أَنَا وَرَجُلٌ إِلَى امْرَأَةٍ مِنْ بَنِي عَامِرٍ كَأَنَّهَا بَكْرَةٌ عَيْطَاءُ فَعَرَضْنَا عَلَيْهَا أَنْفُسَنَا فَقَالَتْ مَا تُعْطِي فَقُلْتُ رِدَائِي ‏.‏ وَقَالَ صَاحِبِي رِدَائِي ‏.‏ وَكَانَ رِدَاءُ صَاحِبِي أَجْوَدَ مِنْ رِدَائِي وَ كُنْتُ أَشَبَّ مِنْهُ فَإِذَا نَظَرَتْ إِلَى رِدَاءِ صَاحِبِي أَعْجَبَهَا وَإِذَا نَظَرَتْ إِلَىَّ أَعْجَبْتُهَا ثُمَّ قَالَتْ أَنْتَ وَرِدَاؤُكَ يَكْفِينِي ‏.‏ فَمَكَثْتُ مَعَهَا ثَلاَثًا ثُمَّ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ كَانَ عِنْدَهُ شَىْءٌ مِنْ هَذِهِ النِّسَاءِ الَّتِي يَتَمَتَّعُ فَلْيُخَلِّ سَبِيلَهَا ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW membenarkan perkahwinan sementara untuk kita. Maka, saya dan seorang lelaki lain pergi mencari seorang wanita Bani Amir, yang rupa parasnya seperti unta betina muda yang gagah. Kami menawarkan diri kepada wanita itu untuk perkahwinan sementara. Dia bertanya, \"Apa hantaran yang kau berikan?\" Saya menjawab, \"Jubah saya.\"  Teman saya juga berkata, \"Jubah saya.\" Jubah teman saya lebih baik dari jubah saya, tetapi saya lebih muda darinya.  Ketika dia melihat jubah teman saya, dia menyukainya.  Ketika dia melihat saya, dia pun tertarik. Lalu dia berkata, \"Kau dan jubahmu cukup untukku.\" Saya tinggal bersamanya selama tiga malam. Kemudian, Rasulullah SAW bersabda, \"Barang siapa yang mempunyai wanita untuk perkahwinan sementara, maka lepaskanlah dia.\" "
  },
  {
    "id": 10575,
    "hadith_number": 3298,
    "tajuk_hadith": "Keizinan Perkahwinan Sementara di Mekah dan Larangannya Kemudian",
    "perawi_melayu": "Rabi' bin Sabrah meriwayatkan bahawa bapanya menyertai Rasulullah SAW dalam Fathul Mekah. Mereka tinggal di sana selama lima belas hari, dan Rasulullah SAW membenarkan perkahwinan sementara dengan wanita.  Saya dan seorang sahabat keluar, saya lebih tampan daripada dia.  Kami masing-masing membawa sehelai selendang. Selendang saya lusuh, sedangkan selendang sahabat saya baharu.",
    "english_text": "Is it possible that one of us may contract temporary marriage with you? She said: What will you give me as a dower? Each one of us spread his cloak. She began to cast a glance on both the persons. My companion also looked at her when she was casting a glance at her side and he said: This cloak of his is worn out, whereas my cloak is quite new. She, however, said twice or thrice: There is no harm in (accepting) this cloak (the old one). So I contracted temporary marriage with her, and I did not come out (of this) until Allah's Messenger (ﷺ) declared it forbidden.",
    "arabic_text": "حَدَّثَنَا أَبُو كَامِلٍ، فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ حَدَّثَنَا بِشْرٌ، - يَعْنِي ابْنَ مُفَضَّلٍ - حَدَّثَنَا عُمَارَةُ بْنُ غَزِيَّةَ، عَنِ الرَّبِيعِ بْنِ سَبْرَةَ، أَنَّ أَبَاهُ، غَزَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَتْحَ مَكَّةَ قَالَ فَأَقَمْنَا بِهَا خَمْسَ عَشْرَةَ - ثَلاَثِينَ بَيْنَ لَيْلَةٍ وَيَوْمٍ - فَأَذِنَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي مُتْعَةِ النِّسَاءِ فَخَرَجْتُ أَنَا وَرَجُلٌ مِنْ قَوْمِي وَلِي عَلَيْهِ فَضْلٌ فِي الْجَمَالِ وَهُوَ قَرِيبٌ مِنَ الدَّمَامَةِ مَعَ كُلِّ وَاحِدٍ مِنَّا بُرْدٌ فَبُرْدِي خَلَقٌ وَأَمَّا بُرْدُ ابْنِ عَمِّي فَبُرْدٌ جَدِيدٌ غَضٌّ حَتَّى إِذَا كُنَّا بِأَسْفَلِ مَكَّةَ أَوْ بِأَعْلاَهَا فَتَلَقَّتْنَا فَتَاةٌ مِثْلُ الْبَكْرَةِ الْعَنَطْنَطَةِ فَقُلْنَا هَلْ لَكِ أَنْ يَسْتَمْتِعَ مِنْكِ أَحَدُنَا قَالَتْ وَمَاذَا تَبْذُلاَنِ فَنَشَرَ كُلُّ وَاحِدٍ مِنَّا بُرْدَهُ فَجَعَلَتْ تَنْظُرُ إِلَى الرَّجُلَيْنِ وَيَرَاهَا صَاحِبِي تَنْظُرُ إِلَى عِطْفِهَا فَقَالَ إِنَّ بُرْدَ هَذَا خَلَقٌ وَبُرْدِي جَدِيدٌ غَضٌّ ‏.‏ فَتَقُولُ بُرْدُ هَذَا لاَ بَأْسَ بِهِ ‏.‏ ثَلاَثَ مِرَارٍ أَوْ مَرَّتَيْنِ ثُمَّ اسْتَمْتَعْتُ مِنْهَا فَلَمْ أَخْرُجْ حَتَّى حَرَّمَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Diceritakan bahawa bapanya menyertai Rasulullah SAW ketika Perang Fathul Mekah, mereka tinggal di sana selama lima belas hari. Rasulullah SAW mengizinkan perkahwinan sementara.  Saya dan seorang sahabat pergi bertemu seorang wanita muda yang sangat menarik.  Kami bertanya, 'Adakah engkau sudi dikahwini secara sementara?'  Dia bertanya, 'Apa yang akan kalian berikan sebagai mas kahwin?' Kami masing-masing membuka selendang kami. Wanita tersebut memandang kedua-dua kami.  Sahabat saya melihat wanita tersebut memandangnya dan berkata, 'Selendang miliknya lusuh, sedangkan selendang saya baharu.' Wanita itu berkata (berkali-kali), 'Selendang ini baik-baik saja'.  Maka aku berkahwin sementara dengannya, dan tidak keluar daripada perkara ini sehingga Rasulullah SAW mengharamkannya."
  },
  {
    "id": 10576,
    "hadith_number": 3299,
    "tajuk_hadith": "Perbincangan Mengenai Keadaan Jubah Seorang Lelaki",
    "perawi_melayu": "Rabi' bin Sabrah al-Juhani meriwayatkan daripada bapanya. Kami keluar bersama Rasulullah SAW ke Mekah pada tahun penaklukan.",
    "english_text": "\" She said: Can it be possible?\" And it is also mentioned in it:\" He said: The cloak of this (man) is old and worn out.\"",
    "arabic_text": "وَحَدَّثَنِي أَحْمَدُ بْنُ سَعِيدِ بْنِ صَخْرٍ الدَّارِمِيُّ، حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عُمَارَةُ بْنُ غَزِيَّةَ، حَدَّثَنِي الرَّبِيعُ بْنُ سَبْرَةَ الْجُهَنِيُّ، عَنْ أَبِيهِ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ الْفَتْحِ إِلَى مَكَّةَ ‏.‏ فَذَكَرَ بِمِثْلِ حَدِيثِ بِشْرٍ ‏.‏ وَزَادَ قَالَتْ وَهَلْ يَصْلُحُ ذَاكَ وَفِيهِ قَالَ إِنَّ بُرْدَ هَذَا خَلَقٌ مَحٌّ ‏.‏",
    "malay_translation": "Beliau (Rabi' bin Sabrah al-Juhani) meriwayatkan daripada bapanya, \"Kami keluar bersama Rasulullah SAW ke Mekah pada tahun Fath (penaklukan). Beliau menceritakan kisah yang serupa dengan hadis sebelumnya, yang disampaikan oleh Bishr, dan ditambah dengan kata-kata: Dia berkata, \"Adakah ini sesuai?\"  Dan terdapat juga dalam hadis ini: Dia berkata, \"Jubah lelaki ini sudah tua dan koyak.\""
  },
  {
    "id": 10577,
    "hadith_number": 3300,
    "tajuk_hadith": "Larangan Perkahwinan Sementara Sehingga Hari Kiamat",
    "perawi_melayu": "Sabra al-Juhani melaporkan daripada bapanya bahawa ketika beliau bersama Rasulullah SAW, baginda bersabda:",
    "english_text": "O people, I had permitted you to contract temporary marriage with women, but Allah has forbidden it (now) until the Day of Resurrection. So he who has any (woman with this type of marriage contract) he should let her off, and do not take back anything you have given to them (as dower).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عُمَرَ، حَدَّثَنِي الرَّبِيعُ بْنُ سَبْرَةَ الْجُهَنِيُّ، أَنَّ أَبَاهُ، حَدَّثَهُ أَنَّهُ، كَانَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ يَا أَيُّهَا النَّاسُ إِنِّي قَدْ كُنْتُ أَذِنْتُ لَكُمْ فِي الاِسْتِمْتَاعِ مِنَ النِّسَاءِ وَإِنَّ اللَّهَ قَدْ حَرَّمَ ذَلِكَ إِلَى يَوْمِ الْقِيَامَةِ فَمَنْ كَانَ عِنْدَهُ مِنْهُنَّ شَىْءٌ فَلْيُخَلِّ سَبِيلَهُ وَلاَ تَأْخُذُوا مِمَّا آتَيْتُمُوهُنَّ شَيْئًا‏\"‏ ‏.‏",
    "malay_translation": "Wahai umat manusia, sesungguhnya aku pernah mengizinkan kamu berkahwin sementara dengan wanita, tetapi Allah telah mengharamkannya hingga Hari Kiamat. Oleh itu, sesiapa yang mempunyai wanita sebegini, maka lepaskanlah dia dan janganlah kamu mengambil kembali apa yang telah kamu berikan kepada mereka sebagai mas kahwin."
  },
  {
    "id": 10578,
    "hadith_number": 3301,
    "tajuk_hadith": "Rasulullah SAW Berdiri di Antara Rukun dan Pintu Kaabah Semasa Bercerita Hadis",
    "perawi_melayu": "Hadis ini diriwayatkan melalui sanad 'Abd al-'Aziz bin 'Umar, dan beliau berkata:",
    "english_text": "I saw Allah's Messenger (ﷺ) standing between the pillar and the gate (of the Ka'ba) and he was relating a hadith as narrated by Ibn Numair.",
    "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ عَبْدِ الْعَزِيزِ بْنِ عُمَرَ، بِهَذَا الإِسْنَادِ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَائِمًا بَيْنَ الرُّكْنِ وَالْبَابِ وَهُوَ يَقُولُ بِمِثْلِ حَدِيثِ ابْنِ نُمَيْرٍ ‏.‏",
    "malay_translation": "Aku melihat Rasulullah SAW berdiri di antara Rukun dan pintu Kaabah, dan baginda sedang menyampaikan sebuah hadis seperti yang diriwayatkan oleh Ibn Numair."
  },
  {
    "id": 10579,
    "hadith_number": 3302,
    "tajuk_hadith": "Keizinan dan Larangan Pernikahan Sementara pada Tahun Pembebasan Mekah",
    "perawi_melayu": "'Abd al-Malik bin Rabi' bin Sabrah al-Juhani",
    "english_text": "'Abd al-Malik b. Rabi' b. Sabraal-Juhanni reported on the authority of his father who narrated it on the authority of his father (i e. 'Abd al-Malik's grandfather, Sabura al-Juhanniy Allah's Messenger (ﷺ) permitted us to contract temporary marriage in the Year of Victory, as we entered Mecca, and we did come out of it but he forbade us to do it.",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ عَبْدِ الْمَلِكِ بْنِ الرَّبِيعِ بْنِ سَبْرَةَ الْجُهَنِيِّ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْمُتْعَةِ عَامَ الْفَتْحِ حِينَ دَخَلْنَا مَكَّةَ ثُمَّ لَمْ نَخْرُجْ مِنْهَا حَتَّى نَهَانَا عَنْهَا‏.‏",
    "malay_translation": "Dikisahkan oleh 'Abd al-Malik bin Rabi' bin Sabrah al-Juhani dari bapanya, kemudian dari datuknya, bahawa Rasulullah SAW telah membenarkan kita melakukan perkahwinan sementara pada Tahun Pembebasan (Tahun Fathuh) ketika kita memasuki Mekah.  Kemudian, kita tidak keluar dari Mekah sehingga baginda melarang kita daripada melakukannya."
  },
  {
    "id": 10580,
    "hadith_number": 3303,
    "tajuk_hadith": "Keizinan Perkahwinan Sementara di Tahun Pembukaan Mekah",
    "perawi_melayu": "Sabra bin Ma'bad",
    "english_text": "Sabra b. Ma'bad reported that Allah's Apostle (ﷺ) permitted his Companions to contract temporary marriage with women in the Year of Victory. So I and a friend of mine from Banu Sulaim went out, until we found a young woman of Banu Amir who was like a young she-camel having a long neck. We proposed to her for contracting temporary marriage with us, and presented to her our cloaks (as dower). She began to look and found me more handsome than my friend, but found the cloak of my friend more beautiful than my cloak. She thought in her mind for a while, but then preferred me to my friend. So I remained with her for three (nights), and then Allah's Messenger (ﷺ) commanded us to part with them (such women).",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ الرَّبِيعِ بْنِ سَبْرَةَ بْنِ مَعْبَدٍ، قَالَ سَمِعْتُ أَبِي رَبِيعَ بْنَ سَبْرَةَ، يُحَدِّثُ عَنْ أَبِيهِ، سَبْرَةَ بْنِ مَعْبَدٍ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم عَامَ فَتْحِ مَكَّةَ أَمَرَ أَصْحَابَهُ بِالتَّمَتُّعِ مِنَ النِّسَاءِ - قَالَ - فَخَرَجْتُ أَنَا وَصَاحِبٌ لِي مِنْ بَنِي سُلَيْمٍ حَتَّى وَجَدْنَا جَارِيَةً مِنْ بَنِي عَامِرٍ كَأَنَّهَا بَكْرَةٌ عَيْطَاءُ فَخَطَبْنَاهَا إِلَى نَفْسِهَا وَعَرَضْنَا عَلَيْهَا بُرْدَيْنَا فَجَعَلَتْ تَنْظُرُ فَتَرَانِي أَجْمَلَ مِنْ صَاحِبِي وَتَرَى بُرْدَ صَاحِبِي أَحْسَنَ مِنْ بُرْدِي فَآمَرَتْ نَفْسَهَا سَاعَةً ثُمَّ اخْتَارَتْنِي عَلَى صَاحِبِي فَكُنَّ مَعَنَا ثَلاَثًا ثُمَّ أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِفِرَاقِهِنَّ ‏.‏",
    "malay_translation": "Perawi Sabra bin Ma'bad meriwayatkan bahawa Rasulullah SAW membenarkan para sahabatnya untuk berkahwin sementara dengan wanita pada tahun pembukaan Kota Mekah.  Saya dan seorang sahabat saya dari Bani Sulaim keluar, sehingga kami menemui seorang wanita muda dari Bani Amir yang cantik jelita, seperti unta betina muda yang lehernya panjang. Kami melamarnya untuk berkahwin sementara dengan kami, dan memberikan selendang kami sebagai mas kahwin.  Dia memerhatikan saya dan mendapati saya lebih tampan daripada sahabat saya, tetapi dia menganggap selendang sahabat saya lebih cantik daripada selendang saya. Dia berfikir sebentar, kemudian memilih saya daripada sahabat saya. Saya tinggal bersamanya selama tiga malam, kemudian Rasulullah SAW memerintahkan kami untuk berpisah dengan mereka (wanita-wanita tersebut)."
  },
  {
    "id": 10581,
    "hadith_number": 3304,
    "tajuk_hadith": "Larangan Perkahwinan Sementara",
    "perawi_melayu": "Rabi' bin Sabra daripada bapanya",
    "english_text": "Rabi' b. Sabra reported on the authority of his father that Allah's Apostle (ﷺ) prohibited the contracting of temporary marriage.",
    "arabic_text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنِ الرَّبِيعِ بْنِ سَبْرَةَ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ نِكَاحِ الْمُتْعَةِ ‏.‏",
    "malay_translation": "Rabi' bin Sabra meriwayatkan daripada bapanya bahawa Rasulullah SAW melarang perkahwinan sementara."
  },
  {
    "id": 10582,
    "hadith_number": 3305,
    "tajuk_hadith": "Larangan Nikah Sementara pada Hari Pembebasan",
    "perawi_melayu": "Rabi' b. Sabra daripada bapanya",
    "english_text": "Rabi' b. Sabra melaporkan daripada bapanya bahawa Rasulullah SAW melarang perkahwinan sementara dengan wanita pada Hari Pembebasan.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ عُلَيَّةَ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنِ الرَّبِيعِ، بْنِ سَبْرَةَ عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى يَوْمَ الْفَتْحِ عَنْ مُتْعَةِ النِّسَاءِ‏.‏",
    "malay_translation": "Rabi' bin Sabrah meriwayatkan daripada bapanya bahawa Rasulullah SAW melarang perkahwinan sementara (mut'ah) dengan wanita pada hari Fathkh (pembebasan). "
  },
  {
    "id": 10583,
    "hadith_number": 3306,
    "tajuk_hadith": "Larangan Perkahwinan Sementara (Mut'ah) Selepas Pembukaan Kota Mekah",
    "perawi_melayu": "",
    "english_text": "This hadith has been narrated on the authority of Rabi' b. Sabra that Allah's Messenger (ﷺ) forbade to contract temporary marriage with women at the time of Victory, and that his father had contracted the marriage for two red cloaks.",
    "arabic_text": "وَحَدَّثَنِيهِ حَسَنٌ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، عَنْ يَعْقُوبَ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، أَخْبَرَنَا ابْنُ شِهَابٍ، عَنِ الرَّبِيعِ بْنِ سَبْرَةَ الْجُهَنِيِّ، عَنْ أَبِيهِ، أَنَّهُ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُتْعَةِ زَمَانَ الْفَتْحِ مُتْعَةِ النِّسَاءِ وَأَنَّ أَبَاهُ كَانَ تَمَتَّعَ بِبُرْدَيْنِ أَحْمَرَيْنِ.",
    "malay_translation": "Hadith ini diriwayatkan daripada Rabi' b. Sabra bahawa Rasulullah SAW melarang perkahwinan sementara (mut'ah) dengan wanita pada masa pembukaan Kota Mekah.  Bapa beliau pernah melakukan perkahwinan sementara dengan dua helai selendang merah."
  },
  {
    "id": 10584,
    "hadith_number": 3307,
    "tajuk_hadith": "Perbahasan dan Larangan Perkahwinan Sementara (Muth'ah) Dalam Islam",
    "perawi_melayu": "'Urwa bin Zubair melaporkan bahawa Abdullah bin Zubair (رضي الله عنه) berdiri dan menyampaikan ceramah di Mekah dengan berkata:",
    "english_text": "Allah has made blind the hearts of some people as He has deprived them of eyesight that they give religious verdict in favour of temporary marriage, while he was alluding to a person (Ibn 'Abbas). Ibn Abbas called him and said: You are an uncouth person, devoid of sense. By my life, Mut'a was practised during the lifetime of the leader of the pious (he meant Allah's Messenger, may peace be upon him), and Ibn Zubair said to him: just do it yourselves, and by Allah, if you do that I will stone you with your stones. Ibn Shihab said. Khalid b. Muhajir b. Saifullah informed me: While I was sitting in the company of a person, a person came to him and he asked for a religious verdict about Mut'a and he permitted him to do it. Ibn Abu 'Amrah al-Ansari (Allah be pleased with him) said to him: Be gentle. It was permitted in- the early days of Islam, (for one) who was driven to it under the stress of necessity just as (the eating of) carrion and the blood and flesh of swine and then Allah intensified (the commands of) His religion and prohibited it (altogether). Ibn Shihab reported: Rabi' b. Sabra told me that his father (Sabra) said: I contracted temporary marriage with a woman of Banu 'Amir for two cloaks during the lifetime of Allah's Messenger (ﷺ) ; then he forbade us to do Mut'a. Ibn Shihab said: I heard Rabi' b. Sabra narrating it to Umar b. 'Abd al-'Aziz and I was sitting there.",
    "arabic_text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ، قَامَ بِمَكَّةَ فَقَالَ إِنَّ نَاسًا - أَعْمَى اللَّهُ قُلُوبَهُمْ كَمَا أَعْمَى أَبْصَارَهُمْ - يُفْتُونَ بِالْمُتْعَةِ - يُعَرِّضُ بِرَجُلٍ - فَنَادَاهُ فَقَالَ إِنَّكَ لَجِلْفٌ جَافٍ فَلَعَمْرِي لَقَدْ كَانَتِ الْمُتْعَةُ تُفْعَلُ عَلَى عَهْدِ إِمَامِ الْمُتَّقِينَ - يُرِيدُ رَسُولَ اللَّهِ صلى الله عليه وسلم - فَقَالَ لَهُ ابْنُ الزُّبَيْرِ فَجَرِّبْ بِنَفْسِكَ فَوَاللَّهِ لَئِنْ فَعَلْتَهَا لأَرْجُمَنَّكَ بِأَحْجَارِكَ ‏.‏ قَالَ ابْنُ شِهَابٍ فَأَخْبَرَنِي خَالِدُ بْنُ الْمُهَاجِرِ بْنِ سَيْفِ اللَّهِ أَنَّهُ بَيْنَا هُوَ جَالِسٌ عِنْدَ رَجُلٍ جَاءَهُ رَجُلٌ فَاسْتَفْتَاهُ فِي الْمُتْعَةِ فَأَمَرَهُ بِهَا فَقَالَ لَهُ ابْنُ أَبِي عَمْرَةَ الأَنْصَارِيُّ مَهْلاً ‏.‏ قَالَ مَا هِيَ وَاللَّهِ لَقَدْ فُعِلَتْ فِي عَهْدِ إِمَامِ الْمُتَّقِينَ ‏.‏ قَالَ ابْنُ أَبِي عَمْرَةَ إِنَّهَا كَانَتْ رُخْصَةً فِي أَوَّلِ الإِسْلاَمِ لِمَنِ اضْطُرَّ إِلَيْهَا كَالْمَيْتَةِ وَالدَّمِ وَلَحْمِ الْخِنْزِيرِ ثُمَّ أَحْكَمَ اللَّهُ الدِّينَ وَنَهَى عَنْهَا ‏.‏ قَالَ ابْنُ شِهَابٍ وَأَخْبَرَنِي رَبِيعُ بْنُ سَبْرَةَ الْجُهَنِيُّ أَنَّ أَبَاهُ قَالَ قَدْ كُنْتُ اسْتَمْتَعْتُ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم امْرَأَةً مِنْ بَنِي عَامِرٍ بِبُرْدَيْنِ أَحْمَرَيْنِ ثُمَّ نَهَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُتْعَةِ ‏.‏ قَالَ ابْنُ شِهَابٍ وَسَمِعْتُ رَبِيعَ بْنَ سَبْرَةَ يُحَدِّثُ ذَلِكَ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ وَأَنَا جَالِسٌ ‏.‏",
    "malay_translation": "Perbahasan dan Larangan Perkahwinan Sementara (Muth'ah) Dalam Islam"
  },
  {
    "id": 10585,
    "hadith_number": 3308,
    "tajuk_hadith": "Larangan Perkahwinan Sementara (Mut'ah) mengikut Sabda Rasulullah SAW",
    "perawi_melayu": "Sabra al-Juhanni meriwayatkan daripada bapanya :",
    "english_text": "Allah's Messenger (ﷺ) prohibited the contracting of temporary marriage and said: Behold, it is forbidden from this very day of yours to the Day of Resurrection, and he who has given something (as a dower) should not take it back.",
    "arabic_text": "وَحَدَّثَنِي سَلَمَةَ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنِ ابْنِ أَبِي عَبْلَةَ، عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ، قَالَ حَدَّثَنَا الرَّبِيعُ بْنُ سَبْرَةَ الْجُهَنِيُّ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُتْعَةِ وَقَالَ ‏\n\"‏ أَلاَ إِنَّهَا حَرَامٌ مِنْ يَوْمِكُمْ هَذَا إِلَى يَوْمِ الْقِيَامَةِ وَمَنْ كَانَ أَعْطَى شَيْئًا فَلاَ يَأْخُذْهُ ‏\"‏ ‏.‏",
    "malay_translation": "Pesuruhjaya Allah (ﷺ) telah melarang perkahwinan sementara (mut'ah) dan bersabda:  Sesungguhnya ia haram dari hari ini hingga Hari Kiamat, dan sesiapa yang telah memberi sesuatu (sebagai mas kahwin) janganlah ia mengambilnya kembali."
  },
  {
    "id": 10586,
    "hadith_number": 3309,
    "tajuk_hadith": "Larangan Perkahwinan Sementara dan Makan Daging Keldai di Khaibar",
    "perawi_melayu": "Ali bin Abi Talib",
    "english_text": "'Ali b. AbiTalib reported that Allah's Messenger (ﷺ) prohibited on the Day of Khaibar the contracting of temporary marriage with women and the eating of the flesh of domestic asses.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ اللَّهِ، وَالْحَسَنِ، ابْنَىْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ أَبِيهِمَا، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ مُتْعَةِ النِّسَاءِ يَوْمَ خَيْبَرَ وَعَنْ أَكْلِ لُحُومِ الْحُمُرِ الإِنْسِيَّةِ ‏.‏",
    "malay_translation": "Ali bin Abi Talib meriwayatkan bahawa Rasulullah SAW melarang perkahwinan sementara dengan wanita dan memakan daging keldai di hari Khaibar."
  },
  {
    "id": 10587,
    "hadith_number": 3310,
    "tajuk_hadith": "Larangan Perbuatan Mut'ah Menurut Rasulullah SAW",
    "perawi_melayu": "Malik meriwayatkan hadis ini dengan sanad yang sama yang mana Ali bin Abi Talib berkata kepada seseorang:",
    "english_text": "You are a person led astray; Allah's Messenger (ﷺ) forbade us (to do Mut'a), as is stated In the hadith transmitted on the authority of Yahya b. Malik.",
    "arabic_text": "وَحَدَّثَنَاهُ عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ الضُّبَعِيُّ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ مَالِكٍ، بِهَذَا الإِسْنَادِ وَقَالَ سَمِعَ عَلِيَّ بْنَ أَبِي طَالِبٍ، يَقُولُ لِفُلاَنٍ إِنَّكَ رَجُلٌ تَائِهٌ نَهَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ بِمِثْلِ حَدِيثِ يَحْيَى بْنِ يَحْيَى عَنْ مَالِكٍ ‏.‏",
    "malay_translation": "Engkau sesat; Rasulullah SAW telah melarang kami daripada melakukan Mut'ah, sebagaimana dinyatakan dalam hadis yang diriwayatkan melalui Yahya bin Malik."
  },
  {
    "id": 10588,
    "hadith_number": 3311,
    "tajuk_hadith": "Larangan Nikah Mut'ah dan Makan Daging Keldai di Hari Khaibar",
    "perawi_melayu": "Muhammad bin Ali meriwayatkan daripada bapanya, Ali, bahawa Rasulullah SAW telah melarang secara kekal nikah mut'ah dan memakan daging keldai pada Hari Khaibar.",
    "english_text": "Muhammad b. 'Ali narrated on the authority of his father 'Ali that Allah's Apostle (ﷺ) on the Day of Khaibar prohibited for ever the contracting of temporary marriage and eating of the flesh of the domestic asses.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ وَزُهَيْرُ بْنُ حَرْبٍ جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، - قَالَ زُهَيْرٌ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، - عَنِ الزُّهْرِيِّ، عَنِ الْحَسَنِ، وَعَبْدِ اللَّهِ، ابْنَىْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ أَبِيهِمَا، عَنْ عَلِيٍّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ نِكَاحِ الْمُتْعَةِ يَوْمَ خَيْبَرَ وَعَنْ لُحُومِ الْحُمُرِ الأَهْلِيَّةِ ‏.‏",
    "malay_translation": "Muhammad bin Ali meriwayatkan daripada bapanya, Ali, bahawa Rasulullah SAW telah melarang secara kekal perkahwinan sementara (nikah mut'ah) dan memakan daging keldai peliharaan pada Hari Khaibar.  Ini merupakan larangan yang kekal."
  },
  {
    "id": 10589,
    "hadith_number": 3312,
    "tajuk_hadith": "Larangan Terburu-buru dalam Hukum Agama dan Makan Daging Keledai",
    "perawi_melayu": "'Ali (رضي الله عنه) mendengar Ibn Abbas (رضي الله عنهما) memberi kelonggaran dalam hal nikah mut'ah, lalu beliau berkata:",
    "english_text": "Don't be hasty (in your religious verdict), Ibn 'Abbas, for Allah's Messenger (ﷺ) on the Day of Khaibar prohibited that forever - along with the eating of flesh of domestic asses.",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنِ ابْنِ شِهَابٍ، عَنِ الْحَسَنِ، وَعَبْدِ اللَّهِ، ابْنَىْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ أَبِيهِمَا، عَنْ عَلِيٍّ، أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ، يُلَيِّنُ فِي مُتْعَةِ النِّسَاءِ فَقَالَ مَهْلاً يَا ابْنَ عَبَّاسٍ فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْهَا يَوْمَ خَيْبَرَ وَعَنْ لُحُومِ الْحُمُرِ الإِنْسِيَّةِ ‏.‏",
    "malay_translation": "Jangan tergesa-gesa (dalam mengeluarkan hukum agama), wahai Ibn Abbas, kerana Rasulullah SAW pada hari Khaibar telah melarang selama-lamanya amalan tersebut – bersamaan dengan memakan daging keldai."
  },
  {
    "id": 10590,
    "hadith_number": 3313,
    "tajuk_hadith": "Larangan Perkahwinan Sementara dan Makan Daging Keldai di Hari Khaibar",
    "perawi_melayu": "Ali bin Abi Talib dan Ibn Abbas",
    "english_text": "'Ali (Allah be pleased with him) said to Ibn 'Abbas (Allah be pleased with them) that Allah's Messenger (ﷺ) on the Day of Khaibar forbade forever the contracting of temporary marriage and the eating of the flesh of domestic asses.",
    "arabic_text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنِ الْحَسَنِ، وَعَبْدِ اللَّهِ، ابْنَىْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ عَنْ أَبِيهِمَا، أَنَّهُ سَمِعَ عَلِيَّ بْنَ أَبِي طَالِبٍ، يَقُولُ لاِبْنِ عَبَّاسٍ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ مُتْعَةِ النِّسَاءِ يَوْمَ خَيْبَرَ وَعَنْ أَكْلِ لُحُومِ الْحُمُرِ الإِنْسِيَّةِ ‏.‏",
    "malay_translation": "Ali bin Abi Talib telah berkata kepada Ibn Abbas, \"Sesungguhnya Rasulullah SAW pada hari Khaibar telah melarang secara kekal perkahwinan sementara (mut'ah) dan memakan daging keldai.\"  "
  },
  {
    "id": 10591,
    "hadith_number": 3314,
    "tajuk_hadith": "Larangan Mengahwini Saudara Wanita Ibu dan Bapa",
    "perawi_melayu": "Abu Hurairah (radhiallahu 'anhu) meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "One should not combine a woman and her father's sister, nor a woman and her mother's sister in marriage.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، حَدَّثَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ‏\n\"‏ لاَ يُجْمَعُ بَيْنَ الْمَرْأَةِ وَعَمَّتِهَا وَلاَ بَيْنَ الْمَرْأَةِ وَخَالَتِهَا‏\"‏ ‏.‏",
    "malay_translation": "Tidak sepatutnya seseorang memperisterikan seorang wanita dengan bibinya (dari pihak ayah) dan juga tidak dengan bibinya (dari pihak ibu)."
  },
  {
    "id": 10592,
    "hadith_number": 3315,
    "tajuk_hadith": "Larangan Mengahwini Empat Wanita Tertentu",
    "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
    "english_text": "that Allah's Messenger (ﷺ) forbade combining of four women in marriage: a woman with her father's sister, and a woman with her mother's sister.",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، أَخْبَرَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عِرَاكِ بْنِ مَالِكٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ أَرْبَعِ نِسْوَةٍ أَنْ يُجْمَعَ بَيْنَهُنَّ الْمَرْأَةِ وَعَمَّتِهَا وَالْمَرْأَةِ وَخَالَتِهَا ‏.‏",
    "malay_translation": "Telah dimaklumkan kepada kami oleh Rasulullah SAW bahawa baginda melarang perkahwinan antara seorang wanita dengan bibinya (dari pihak bapa), dan antara seorang wanita dengan bibinya (dari pihak ibu)."
  },
  {
    "id": 10593,
    "hadith_number": 3316,
    "tajuk_hadith": "Larangan Mengahwini Bibi dan Anak Saudara Perempuan",
    "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
    "english_text": "I heard Allah's Messenger (ﷺ) say: Father's sister should not be combined with her brother's daughter, nor the daughter of a sister with her mother's sister.",
    "arabic_text": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْعَزِيزِ، - قَالَ ابْنُ مَسْلَمَةَ مَدَنِيٌّ مِنَ الأَنْصَارِ مِنْ وَلَدِ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ - عَنِ ابْنِ شِهَابٍ، عَنْ قَبِيصَةَ بْنِ ذُؤَيْبٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ تُنْكَحُ الْعَمَّةُ عَلَى بِنْتِ الأَخِ وَلاَ ابْنَةُ الأُخْتِ عَلَى الْخَالَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Maslamah bin Qanab, telah menceritakan kepada kami Abdul Rahman bin Abdul Aziz - berkata Ibnu Maslamah, seorang Madani dari kalangan Ansar, dari keturunan Abu Umamah bin Sahl bin Hunaif - dari Ibnu Syihab, dari Qabishah bin Zuhaib, dari Abu Hurairah, berkata: Saya mendengar Rasulullah SAW bersabda,\n\"Janganlah dikahwinkan seorang bibi dengan anak perempuan saudaranya, dan janganlah dikahwinkan anak perempuan saudara perempuan dengan bibinya (dari ibu).\""
  },
  {
    "id": 10594,
    "hadith_number": 3317,
    "tajuk_hadith": "Larangan Perkahwinan dengan Saudara Wanita Bapa dan Ibu",
    "perawi_melayu": "Abu Hurairah (رضي الله عنه) melaporkan bahawa Rasulullah SAW melarang seseorang daripada mengahwini seorang wanita dengan saudara perempuan bapanya dan saudara perempuan ibunya.",
    "english_text": "So we regarded the paternal aunt of her (wife's) father and the maternal aunt of her (wife's) father at the same level.",
    "arabic_text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي قَبِيصَةُ بْنُ ذُؤَيْبٍ الْكَعْبِيُّ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَجْمَعَ الرَّجُلُ بَيْنَ الْمَرْأَةِ وَعَمَّتِهَا وَبَيْنَ الْمَرْأَةِ وَخَالَتِهَا ‏.‏ قَالَ ابْنُ شِهَابٍ فَنُرَى خَالَةَ أَبِيهَا وَعَمَّةَ أَبِيهَا بِتِلْكَ الْمَنْزِلَةِ ‏.‏",
    "malay_translation": "Maka kami menganggap saudara perempuan bapa isterinya dan saudara perempuan ibu isterinya berada pada tahap yang sama."
  },
  {
    "id": 10595,
    "hadith_number": 3318,
    "tajuk_hadith": "Larangan Mengahwini Saudara Perempuan Bapa atau Ibu",
    "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan Rasulullah SAW bersabda:",
    "english_text": "One should not combine in marriage a woman with her father's sister, or her mother's sister.",
    "arabic_text": "وَحَدَّثَنِي أَبُو مَعْنٍ الرَّقَاشِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، أَنَّهُ كَتَبَ إِلَيْهِ عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تُنْكَحُ الْمَرْأَةُ عَلَى عَمَّتِهَا وَلاَ عَلَى خَالَتِهَا ‏\"‏ ‏.‏",
    "malay_translation": "Tidak dibenarkan seseorang memperisteri wanita dengan saudari bapanya atau saudari ibunya.  Rasulullah SAW bersabda, \"Janganlah seorang wanita dinikahi dengan bibinya atau makciknya.\"  "
  },
  {
    "id": 10596,
    "hadith_number": 3319,
    "tajuk_hadith": "Hadis Yang Dikisahkan Melalui Rangkaian Perawi Yang Berbeza",
    "perawi_melayu": "Abu Hurairah (Semoga Allah Redha kepadanya)",
    "english_text": "A hadith like this has been narrated on the authority of Abu Huraira (Allah be pleased with him) through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ شَيْبَانَ، عَنْ يَحْيَى، حَدَّثَنِي أَبُو سَلَمَةَ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمِثْلِهِ‏.‏",
    "malay_translation": "Hadis seperti ini telah diriwayatkan daripada Abu Hurairah (Semoga Allah Redha kepadanya) melalui rangkaian perawi yang berbeza.  Keadaan ini menunjukkan keberkatan dan kedinamikan dalam penyampaian hadis Nabi melalui pelbagai saluran perawi yang sah."
  },
  {
    "id": 10597,
    "hadith_number": 3320,
    "tajuk_hadith": "Larangan Berlaku Zalim dan Menggugat Hak dalam Perkahwinan",
    "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan daripada Rasulullah SAW:",
    "english_text": "A man must not make proposal of marriage to a woman when his brother has done so already. And he must not offer a price for a thing for which his brother had already offered a price; and a woman must not be combined in marriage with her father's sister, nor with her mother's sister, and a woman must not ask to have her sister divorced in order to deprive her of what belongs to her, but she must marry, because she will have what Allah has decreed for her.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَخْطُبُ الرَّجُلُ عَلَى خِطْبَةِ أَخِيهِ وَلاَ يَسُومُ عَلَى سَوْمِ أَخِيهِ وَلاَ تُنْكَحُ الْمَرْأَةُ عَلَى عَمَّتِهَا وَلاَ عَلَى خَالَتِهَا وَلاَ تَسْأَلُ الْمَرْأَةُ طَلاَقَ أُخْتِهَا لِتَكْتَفِئَ صَحْفَتَهَا وَلْتَنْكِحْ فَإِنَّمَا لَهَا مَا كَتَبَ اللَّهُ لَهَا ‏\"‏ ‏.‏",
    "malay_translation": "Tidak dibenarkan seorang lelaki melamar seorang perempuan jika saudaranya telah melamarnya terlebih dahulu. Begitu juga, tidak dibenarkan seorang lelaki menawarkan harga untuk sesuatu barang jika saudaranya telah menawarkan harga yang sama terlebih dahulu. Seorang perempuan juga tidak dibenarkan berkahwin dengan bibinya yang berasal dari pihak bapa atau ibu, atau meminta perceraian saudara perempuannya untuk mendapatkan harta miliknya. Sebaliknya, perempuan itu perlu berkahwin, kerana ia akan menerima apa yang telah Allah tetapkan untuknya."
  },
  {
    "id": 10598,
    "hadith_number": 3321,
    "tajuk_hadith": "Larangan Perkahwinan dengan Saudara Wanita Bapa dan Ibu, dan Larangan Perempuan Meminta Cerai untuk Saudara Perempuannya",
    "perawi_melayu": "Abu Hurairah رضي الله عنه",
    "english_text": "Abu Huraira (Allah be pleased with him) reported that Allah's Messenger (ﷺ) forbade the combining of a woman in marriage with her father's sister, or with her mother's sister, or that a woman should ask for divorce for her sister in order to deprive her of what belongs to her. Allah, the Exalted'and Majestic, is her Sustainer too.",
    "arabic_text": "وَحَدَّثَنِي مُحْرِزُ بْنُ عَوْنِ بْنِ أَبِي عَوْنٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ دَاوُدَ بْنِ أَبِي، هِنْدٍ عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ تُنْكَحَ الْمَرْأَةُ عَلَى عَمَّتِهَا أَوْ خَالَتِهَا أَوْ أَنْ تَسْأَلَ الْمَرْأَةُ طَلاَقَ أُخْتِهَا لِتَكْتَفِئَ مَا فِي صَحْفَتِهَا فَإِنَّ اللَّهَ عَزَّ وَجَلَّ رَازِقُهَا ‏.‏",
    "malay_translation": "Abu Hurairah رضي الله عنه meriwayatkan bahawa Rasulullah SAW melarang perkahwinan seorang wanita dengan bibinya (saudara perempuan bapanya) atau makciknya (saudara perempuan ibunya), atau seorang wanita meminta cerai untuk saudaranya agar merampas harta miliknya. Sesungguhnya Allah SWT adalah Pemberi rezeki kepadanya."
  },
  {
    "id": 10599,
    "hadith_number": 3322,
    "tajuk_hadith": "Larangan Meminang Wanita dengan Saudara Perempuan Bapa atau Ibu",
    "perawi_melayu": "Abu Hurairah رضي الله عنه",
    "english_text": "Abu Huraira (Allah be pleased with him) reported that Allah's Messenger (ﷺ) forbade to combine a woman and her father's sister, and a woman and her mother's sister.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ وَأَبُو بَكْرِ بْنُ نَافِعٍ - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى وَابْنِ نَافِعٍ - قَالُوا أَخْبَرَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُجْمَعَ بَيْنَ الْمَرْأَةِ وَعَمَّتِهَا وَبَيْنَ الْمَرْأَةِ وَخَالَتِهَا ‏.‏",
    "malay_translation": "Abu Hurairah رضي الله عنه meriwayatkan bahawa Rasulullah SAW melarang perkahwinan antara seorang wanita dengan saudara perempuan bapanya dan juga saudara perempuan ibunya."
  },
  {
    "id": 10600,
    "hadith_number": 3323,
    "tajuk_hadith": "Hadis Yang Disampaikan Oleh Amr bin Dinar",
    "perawi_melayu": "",
    "english_text": "A hadith like this has been transmitted on the authority of Amr b. Dinar",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا وَرْقَاءُ، عَنْ عَمْرِو بْنِ دِينَارٍ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
    "malay_translation": "Sebuah hadis yang serupa telah disampaikan dengan sanad daripada Amr bin Dinar."
  },
  {
    "id": 10601,
    "hadith_number": 3324,
    "tajuk_hadith": "Larangan Perkahwinan Bagi Orang Ihram",
    "perawi_melayu": "Nubaih bin Wahb melaporkan bahawa 'Umar bin Ubaidullah ingin menikahkan Talhah bin 'Umar dengan anak perempuan Shaiba bin Jubair; maka diutusnya utusan kepada Aban bin Uthman untuk menghadiri majlis perkahwinan tersebut, manakala pada ketika itu Aban adalah Amir Haji. Aban berkata:",
    "english_text": "I heard 'Uthman b. 'Affan say that Allah's Messenger (ﷺ) had stated: A Muhrim must neither marry himself, nor arrange the marriage of another one, nor should he make the proposal of marriage.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنْ نُبَيْهِ بْنِ وَهْبٍ، أَنَّفَقَالَ أَبَانٌ سَمِعْتُ عُثْمَانَ بْنَ عَفَّانَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَنْكِحُ الْمُحْرِمُ وَلاَ يُنْكَحُ وَلاَ يَخْطُبُ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar 'Uthman bin 'Affan berkata bahawa Rasulullah SAW bersabda:  Seorang yang dalam ihram tidak boleh berkahwin sendiri, tidak boleh menikahkan orang lain, dan tidak boleh melamar untuk berkahwin."
  },
  {
    "id": 10602,
    "hadith_number": 3325,
    "tajuk_hadith": "Larangan Mengahwini atau Dikahwini Ketika Ihram Haji",
    "perawi_melayu": "Nubaih bin Wahb meriwayatkan:",
    "english_text": "Umar b. Ubaidullah b. Ma'mar sent me to Aban b. Uthman as he wanted to make the proposal of the marriage of his son with the daughter of Shaiba b. Uthman. He (Aban b. Uthman) was at that time (busy) in the season of Pilgrimage. He said: I deem him to be a man of the desert (for it is a common thing) that a Muhrim can neither marry, nor is he allowed to be married to anyone. It is Uthman (b. Affan) who reported this to us from Allah's Messenger (ﷺ).",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، حَدَّثَنِي نُبَيْهُ بْنُ وَهْبٍ، قَالَ بَعَثَنِي عُمَرُ بْنُ عُبَيْدِ اللَّهِ بْنِ مَعْمَرٍ وَكَانَ يَخْطُبُ بِنْتَ شَيْبَةَ بْنِ عُثْمَانَ عَلَى ابْنِهِ فَأَرْسَلَنِي إِلَى أَبَانِ بْنِ عُثْمَانَ وَهُوَ عَلَى الْمَوْسِمِ فَقَالَ أَلاَ أُرَاهُ أَعْرَابِيًّا ‏\n\"‏ إِنَّ الْمُحْرِمَ لاَ يَنْكِحُ وَلاَ يُنْكَحُ ‏\"‏ ‏.‏ أَخْبَرَنَا بِذَلِكَ عُثْمَانُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Umar bin Ubaidillah bin Ma'mar menghantar saya kepada Aban bin Uthman kerana ingin melamar anak perempuan Shaiba bin Uthman untuk anaknya. Ketika itu, Aban bin Uthman sedang berada di musim haji. Beliau berkata, \"Aku nampak dia seorang yang berasal dari padang pasir (kerana ia perkara biasa) bahawa seorang yang berihram tidak boleh berkahwin dan tidak boleh dikahwini oleh sesiapa pun.\" Uthman bin Affan meriwayatkannya daripada Rasulullah SAW."
  },
  {
    "id": 10603,
    "hadith_number": 3326,
    "tajuk_hadith": "Larangan Perkahwinan Bagi Orang Ihram",
    "perawi_melayu": "Uthman bin Affan meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "A Muhrim should neither marry himself, nor should he be got married to anyone, nor should he make the proposal of marriage.",
    "arabic_text": "وَحَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، حَدَّثَنَا عَبْدُ الأَعْلَى، ح وَحَدَّثَنِي أَبُو الْخَطَّابِ، زِيَادُ بْنُ يَحْيَى حَدَّثَنَا مُحَمَّدُ بْنُ سَوَاءٍ، قَالاَ جَمِيعًا حَدَّثَنَا سَعِيدٌ، عَنْ مَطَرٍ، وَيَعْلَى بْنِ حَكِيمٍ، عَنْ نَافِعٍ، عَنْ نُبَيْهِ بْنِ وَهْبٍ، عَنْ أَبَانِ بْنِ عُثْمَانَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَنْكِحُ الْمُحْرِمُ وَلاَ يُنْكَحُ وَلاَ يَخْطُبُ ‏\"‏ ‏.‏",
    "malay_translation": "Seseorang yang sedang berihram tidak dibenarkan mengahwini dirinya sendiri, dan tidak dibenarkan dikahwini oleh orang lain, dan tidak dibenarkan melamar perkahwinan."
  },
  {
    "id": 10604,
    "hadith_number": 3327,
    "tajuk_hadith": "Larangan Menikah dan Memohon Perkahwinan bagi Orang Ihram",
    "perawi_melayu": "'Uthman bin 'Affan meriwayatkan daripada Rasulullah SAW bahawa Baginda bersabda:",
    "english_text": "A Muhrim should neither marry (in that state) nor make the proposal of marriage.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنِ ابْنِ، عُيَيْنَةَ - قَالَ زُهَيْرٌ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، - عَنْ أَيُّوبَ بْنِ مُوسَى، عَنْ نُبَيْهِ بْنِ وَهْبٍ، عَنْ أَبَانِ بْنِ عُثْمَانَ، عَنْ عُثْمَانَ، يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْمُحْرِمُ لاَ يَنْكِحُ وَلاَ يَخْطُبُ ‏\"‏ ‏.‏",
    "malay_translation": "Orang yang berihram tidak dibenarkan berkahwin atau melamar perempuan dalam keadaan ihram tersebut."
  },
  {
    "id": 10605,
    "hadith_number": 3328,
    "tajuk_hadith": "Larangan Perkahwinan bagi Orang dalam Ihram",
    "perawi_melayu": "Nabaih bin Wahb melaporkan bahawa Umar bin 'Ubaidullah bin Ma'mar ingin menikahkan anaknya, Talhah dengan anak perempuan Shaiba bin Jubair semasa haji. Aban bin Uthman ketika itu adalah Amir Haji.  Lalu Umar bin Ubaidullah menghantar utusan kepada Aban dengan berkata:",
    "english_text": "I intend to marry Talha b. 'Umar and I earnestly desire you to be present there (in this ceremony of marriage). Aban said to him: I find you a block-headed 'Iraqi. I heard 'Uthman b. 'Affan say that Allah's Messenger (ﷺ) said: A Muhrim should not marry.",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي خَالِدُ بْنُ يَزِيدَ، حَدَّثَنِي سَعِيدُ بْنُ أَبِي هِلاَلٍ، عَنْ نُبَيْهِ بْنِ وَهْبٍ، أَنَّ عُمَرَ بْنَ عُبَيْدِ اللَّهِ بْنِ مَعْمَرٍ، أَرَادَ أَنْ يُنْكِحَ، ابْنَهُ طَلْحَةَ بِنْتَ شَيْبَةَ بْنِ جُبَيْرٍ فِي الْحَجِّ وَأَبَانُ بْنُ عُثْمَانَ يَوْمَئِذٍ أَمِيرُ الْحَاجِّ فَأَرْسَلَ إِلَى أَبَانٍ إِنِّي قَدْ أَرَدْتُ أَنْ أُنْكِحَ، طَلْحَةَ بْنَ عُمَرَ فَأُحِبُّ أَنْ تَحْضُرَ، ذَلِكَ ‏.‏ فَقَالَ لَهُ أَبَانٌ أَلاَ أُرَاكَ عِرَاقِيًّا جَافِيًا إِنِّي سَمِعْتُ عُثْمَانَ بْنَ عَفَّانَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَنْكِحُ الْمُحْرِمُ ‏\"‏ ‏.‏",
    "malay_translation": "Aku berhasrat untuk menikahkan Talhah bin Umar dan aku ingin agar engkau hadir di majlis perkahwinan itu. Aban berkata kepadanya, 'Aku melihat engkau seorang lelaki Iraq yang degil. Aku telah mendengar 'Uthman bin 'Affan berkata bahawa Rasulullah SAW bersabda, \"Orang yang dalam ihram tidak boleh berkahwin.\""
  },
  {
    "id": 10606,
    "hadith_number": 3329,
    "tajuk_hadith": "Perkahwinan Nabi SAW dengan Maimunah dalam Keadaan Ihram",
    "perawi_melayu": "Ibn Abbas (رضي الله عنهما) meriwayatkan bahawa Rasulullah SAW mengahwini Maimunah ketika dalam keadaan Ihram. Ibn Numair menambah:",
    "english_text": "\" I narrated it to Zuhri and he said: Yazid b. al-Asamm (Allah be pleased with him) told me that he (the Holy Prophet) married her when he was not a muhrim.\"",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ وَإِسْحَاقُ الْحَنْظَلِيُّ جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، - قَالَ ابْنُ نُمَيْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، - عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ أَبِي الشَّعْثَاءِ، أَنَّ ابْنَ، عَبَّاسٍ أَخْبَرَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم تَزَوَّجَ مَيْمُونَةَ وَهُوَ مُحْرِمٌ ‏.‏ زَادَ ابْنُ نُمَيْرٍ فَحَدَّثْتُ بِهِ الزُّهْرِيَّ فَقَالَ أَخْبَرَنِي يَزِيدُ بْنُ الأَصَمِّ أَنَّهُ نَكَحَهَا وَهُوَ حَلاَلٌ ‏.‏",
    "malay_translation": "Saya meriwayatkan hadis ini kepada Zuhri, dan beliau berkata: Yazid bin al-Asamm (Allah merahmati beliau) memberitahu saya bahawa Baginda Nabi SAW telah mengahwini Maimunah ketika Baginda tidak dalam keadaan ihram."
  },
  {
    "id": 10607,
    "hadith_number": 3330,
    "tajuk_hadith": "Perkahwinan Rasulullah SAW dengan Maimunah ketika Ihram",
    "perawi_melayu": "Ibnu Abbas r.a. meriwayatkan:",
    "english_text": "Allah's Messenger (ﷺ) married Maimuna while he was a Muhrim.",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا دَاوُدُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرِ بْنِ زَيْدٍ أَبِي الشَّعْثَاءِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ قَالَ تَزَوَّجَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَيْمُونَةَ وَهُوَ مُحْرِمٌ ‏.‏",
    "malay_translation": "Utusan Allah (ﷺ) telah mengahwini Maimunah ketika baginda dalam keadaan ihram."
  },
  {
    "id": 10608,
    "hadith_number": 3331,
    "tajuk_hadith": "Perkahwinan Rasulullah SAW dengan Maimunah tanpa Ihram",
    "perawi_melayu": "Yazid bin al-Asamm meriwayatkan:",
    "english_text": "Maimuna anak perempuan al-Harith meriwayatkan kepadaku bahawa Rasulullah SAW telah mengahwininya dan baginda bukan dalam keadaan ihram. Dan dia (Maimunah) adalah kakak ipar ibuku dan kakak ipar Ibn 'Abbas (Semoga Allah meridhai mereka).",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، حَدَّثَنَا أَبُو فَزَارَةَ، عَنْ يَزِيدَ بْنِ الأَصَمِّ، حَدَّثَتْنِي مَيْمُونَةُ بِنْتُ الْحَارِثِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم تَزَوَّجَهَا وَهُوَ حَلاَلٌ قَالَ وَكَانَتْ خَالَتِي وَخَالَةَ ابْنِ عَبَّاسٍ ‏.‏",
    "malay_translation": "Maimunah binti al-Harith meriwayatkan kepada beliau bahawa Rasulullah SAW telah mengahwininya ketika baginda tidak dalam keadaan ihram. Dan beliau adalah saudara perempuan isteri bapa beliau dan juga saudara perempuan isteri kepada Ibn 'Abbas (Semoga Allah meredhai mereka). "
  },
  {
    "id": 10609,
    "hadith_number": 3332,
    "tajuk_hadith": "Larangan Bersaing dalam Perniagaan dan Perkahwinan",
    "perawi_melayu": "Ibn Umar (رضي الله عنهما) meriwayatkan daripada Rasulullah SAW bahawa:",
    "english_text": "None amongst you should outbid another in a transaction, nor should he make proposals of marriage upon the proposal made by someone else.",
    "arabic_text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا ابْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ وَلاَ يَخْطُبْ بَعْضُكُمْ عَلَى خِطْبَةِ بَعْضٍ ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah sesiapa di antara kamu menawar lebih tinggi daripada yang lain dalam urusan jual beli, dan jangan pula sesiapa di antara kamu melamar seseorang yang telah dipohon oleh orang lain."
  },
  {
    "id": 10610,
    "hadith_number": 3333,
    "tajuk_hadith": "Larangan Membuat Perjanjian atau Pertunangan Atas Perjanjian atau Pertunangan Saudara",
    "perawi_melayu": "Ibn Umar (رضي الله عنهما) meriwayatkan dari Rasulullah SAW bahawa:",
    "english_text": "A person should not enter into a transaction when his brother (had already entered into but not finalised), and he should not make proposal of marriage upon the proposal already made by his brother, until he permits it.",
    "arabic_text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، جَمِيعًا عَنْ يَحْيَى الْقَطَّانِ، قَالَ زُهَيْرٌ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَبِعِ الرَّجُلُ عَلَى بَيْعِ أَخِيهِ وَلاَ يَخْطُبْ عَلَى خِطْبَةِ أَخِيهِ إِلاَّ أَنْ يَأْذَنَ لَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Seseorang tidak sepatutnya memasuki perjanjian jual beli apabila saudaranya telah memulakannya tetapi belum selesai, dan tidak seharusnya melamar seseorang yang telah dilamar oleh saudaranya, melainkan dengan izin saudaranya tersebut."
  },
  {
    "id": 10611,
    "hadith_number": 3334,
    "tajuk_hadith": "Hadis Berkaitan Perawi Ibn Umar",
    "perawi_melayu": "Dikisahkan oleh Ibn Umar melalui sanad lain.",
    "english_text": "The above hadith has been narrated by Ibn Umar through another chain.",
    "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ عُبَيْدِ اللَّهِ، بِهَذَا الإِسْنَادِ.",
    "malay_translation": "Hadis di atas telah disampaikan oleh Ibn Umar melalui rantaian periwayatan yang lain."
  },
  {
    "id": 10612,
    "hadith_number": 3335,
    "tajuk_hadith": "Hadis yang Disampaikan dengan Sanad yang Sama",
    "perawi_melayu": "",
    "english_text": "A hadith like this has been reported on the authority of Nafi' with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنِيهِ أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، بِهَذَا الإِسْنَادِ‏.‏",
    "malay_translation": "Hadis seperti ini telah diriwayatkan melalui perawi Nafi' dengan sanad yang sama."
  },
  {
    "id": 10613,
    "hadith_number": 3336,
    "tajuk_hadith": "Larangan Perbuatan yang Menjejaskan Saudara Muslim",
    "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan bahawa Rasulullah SAW melarang seorang penduduk bandar membeli barangan seorang penduduk kampung atau menawar dalam jual beli dengan tujuan menipu orang lain, atau seorang lelaki melamar seorang wanita apabila saudaranya telah melamarnya, atau seseorang melakukan transaksi perniagaan ketika saudaranya telah melakukannya; dan seorang wanita meminta talak bagi saudarinya dengan tujuan mengambil harta saudarinya.",
    "english_text": "\" The person should not purchase in opposition to his brother.\"",
    "arabic_text": "وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، وَابْنُ أَبِي عُمَرَ، قَالَ زُهَيْرٌ حَدَّثَنَا سُفْيَانُ، بْنُ عُيَيْنَةَ عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى أَنْ يَبِيعَ حَاضِرٌ لِبَادٍ أَوْ يَتَنَاجَشُوا أَوْ يَخْطُبَ الرَّجُلُ عَلَى خِطْبَةِ أَخِيهِ أَوْ يَبِيعَ عَلَى بَيْعِ أَخِيهِ وَلاَ تَسْأَلِ الْمَرْأَةُ طَلاَقَ أُخْتِهَا لِتَكْتَفِئَ مَا فِي إِنَائِهَا أَوْ مَا فِي صَحْفَتِهَا ‏.‏ زَادَ عَمْرٌو فِي رِوَايَتِهِ وَلاَ يَسُمِ الرَّجُلُ عَلَى سَوْمِ أَخِيهِ ‏.‏",
    "malay_translation": "Rasulullah SAW melarang seseorang membeli barangan daripada saudaranya dengan cara yang menjejaskan saudaranya.  Ini termasuk menawar atau bersaing dalam proses jual beli untuk menipu orang lain; melamar wanita yang telah dilamar oleh saudara sendiri; atau melakukan transaksi perniagaan ketika saudaranya telah melakukannya.  Juga dilarang seorang wanita meminta cerai bagi saudarinya dengan tujuan merampas harta saudarinya."
  },
  {
    "id": 10614,
    "hadith_number": 3337,
    "tajuk_hadith": "Larangan Menjual dengan Menipu dan Perselisihan dalam Perniagaan dan Perkahwinan",
    "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan daripada Rasulullah SAW bahawa:",
    "english_text": "Do not outbid in a sale in order to ensnare. No man should enter into a transaction in which his brother has already entered, and no dweller of the town should sell on behalf of the villager. And no man should make a proposal of marriage which his brother has already made and no woman should ask for the divorce of another (co-wife) in order to deprive her of what belongs to her.",
    "arabic_text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَنَاجَشُوا وَلاَ يَبِعِ الْمَرْءُ عَلَى بَيْعِ أَخِيهِ وَلاَ يَبِعْ حَاضِرٌ لِبَادٍ وَلاَ يَخْطُبِ الْمَرْءُ عَلَى خِطْبَةِ أَخِيهِ وَلاَ تَسْأَلِ الْمَرْأَةُ طَلاَقَ الأُخْرَى لِتَكْتَفِئَ مَا فِي إِنَائِهَا ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah berjual beli dengan menipu untuk menjerat.  Tidak dibenarkan seseorang memasuki transaksi yang telah diusahakan oleh saudaranya, dan tidak dibenarkan penduduk bandar menjual bagi pihak penduduk kampung. Begitu juga, tidak dibenarkan seseorang melamar wanita yang telah dilamar oleh saudaranya, dan wanita tidak boleh meminta cerai isteri lain untuk mengambil harta yang dimilikinya."
  },
  {
    "id": 10615,
    "hadith_number": 3338,
    "tajuk_hadith": "Hadis yang Sama dengan Perbezaan Ringkas",
    "perawi_melayu": "Zuhri",
    "english_text": "A hadith like this has been narrated on the authority of Zuhri with the same chain of transmitters but with a slight alteration.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الأَعْلَى، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، جَمِيعًا عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ ‏.‏ مِثْلَهُ غَيْرَ أَنَّ فِي حَدِيثِ مَعْمَرٍ ‏\n\"‏ وَلاَ يَزِدِ الرَّجُلُ عَلَى بَيْعِ أَخِيهِ ‏\"‏ ‏.‏",
    "malay_translation": "Satu hadith yang serupa dengan ini telah diriwayatkan dengan sanad yang sama, tetapi dengan sedikit perubahan, melalui perawi Zuhri."
  },
  {
    "id": 10616,
    "hadith_number": 3339,
    "tajuk_hadith": "Larangan Mengganggu Perniagaan dan Perkahwinan Saudara Muslim",
    "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The Muslim should not purchase in opposition to his brother, and he should not make the proposal of marriage on the proposal already made by his brother.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ جَمِيعًا عَنْ إِسْمَاعِيلَ بْنِ جَعْفَرٍ، - قَالَ ابْنُ أَيُّوبَ حَدَّثَنَا إِسْمَاعِيلُ، - أَخْبَرَنِي الْعَلاَءُ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَسُمِ الْمُسْلِمُ عَلَى سَوْمِ أَخِيهِ وَلاَ يَخْطُبْ عَلَى خِطْبَتِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang Muslim tidak sepatutnya mengganggu urusan jual beli saudaranya, dan juga tidak sepatutnya melamar seorang perempuan yang telah dilamar oleh saudaranya."
  },
  {
    "id": 10617,
    "hadith_number": 3340,
    "tajuk_hadith": "Hadis Mengenai Perkara yang Dibenarkan dan Dilarang dalam Persaudaraan",
    "perawi_melayu": "Abu Hurairah رضي الله عنه",
    "english_text": "This hadith has been narrated on the authority of Abu Huraira (Allah be pleased with him) through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنِي أَحْمَدُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا شُعْبَةُ، عَنِ الْعَلاَءِ، وَسُهَيْلٍ عَنْ أَبِيهِمَا، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ح وَحَدَّثَنَاهُ مُحَمَّدُ، بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم إِلاَّ أَنَّهُمْ قَالُوا ‏\n\"‏ عَلَى سَوْمِ أَخِيهِ وَخِطْبَةِ أَخِيهِ ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Abu Hurairah رضي الله عنه melalui beberapa rangkaian perawi. Hadis ini menceritakan tentang hukum atau perkara yang dibenarkan dan dilarang dalam urusan sesama saudara dalam Islam, khususnya dalam aspek berjual beli dan meminang."
  },
  {
    "id": 10618,
    "hadith_number": 3341,
    "tajuk_hadith": "Larangan Membeli atau Bertunang atas Perjanjian Saudara Muslim",
    "perawi_melayu": "'Uqba bin 'Amir berkata di atas mimbar bahawa Rasulullah SAW bersabda:",
    "english_text": "A believer is the brother of a believer, so it is not lawful for a believer to outbid his brother, and he should not propose an engagement when his brother has thus proposed until he gives it up.",
    "arabic_text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنِ اللَّيْثِ، وَغَيْرِهِ، عَنْ يَزِيدَ بْنِ، أَبِي حَبِيبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ شُمَاسَةَ، أَنَّهُ سَمِعَ عُقْبَةَ بْنَ عَامِرٍ، عَلَى الْمِنْبَرِ يَقُولُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْمُؤْمِنُ أَخُو الْمُؤْمِنِ فَلاَ يَحِلُّ لِلْمُؤْمِنِ أَنْ يَبْتَاعَ عَلَى بَيْعِ أَخِيهِ وَلاَ يَخْطُبَ عَلَى خِطْبَةِ أَخِيهِ حَتَّى يَذَرَ ‏\"‏ ‏.‏",
    "malay_translation": "Saudara Muslim itu bersaudara. Oleh itu, tidak halal bagi seorang mukmin untuk menawar atau membeli sesuatu di atas tawaran saudaranya, dan dia tidak boleh melamar sesuatu yang telah dilamar oleh saudaranya sehingga saudaranya melepaskan niatnya."
  },
  {
    "id": 10619,
    "hadith_number": 3342,
    "tajuk_hadith": "Larangan Pertukaran Perkahwinan Tanpa Mas Kahwin",
    "perawi_melayu": "Ibn Umar (رضي الله عنهما)",
    "english_text": "Ibn Umar (Allah be pleased with them) said that Allah's Messenger (ﷺ) prohibited Shighar which means that a man gives his daughter in marriage on the condition that the other gives his daughter to him in marriage without any dower being paid by either.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الشِّغَارِ ‏.‏ وَالشِّغَارُ أَنْ يُزَوِّجَ الرَّجُلُ ابْنَتَهُ عَلَى أَنْ يُزَوِّجَهُ ابْنَتَهُ وَلَيْسَ بَيْنَهُمَا صَدَاقٌ ‏.‏",
    "malay_translation": "Ibn Umar (رضي الله عنهما) meriwayatkan bahawa Rasulullah SAW melarang amalan *shighar*. *Shighar* bermaksud seseorang lelaki menikahkan anak perempuannya dengan syarat lelaki lain menikahkan anak perempuannya dengannya tanpa sebarang mas kahwin dibayar oleh kedua-duanya."
  },
  {
    "id": 10620,
    "hadith_number": 3343,
    "tajuk_hadith": "Hadis dengan Perbezaan Kata-kata",
    "perawi_melayu": "Abdullah bin 'Umar (Semoga Allah Redha dengan mereka berdua)",
    "english_text": "A hadith like this has been narrated on the authority of\" Abdullah b. 'Umar (Allah be pleased with them) but with a slight variation of words.",
    "arabic_text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالُوا حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ بِمِثْلِهِ غَيْرَ أَنَّ فِي حَدِيثِ عُبَيْدِ اللَّهِ قَالَ قُلْتُ لِنَافِعٍ مَا الشِّغَارُ.",
    "malay_translation": "Hadis yang serupa dengan ini telah diriwayatkan dengan sanad daripada Abdullah bin 'Umar (Semoga Allah Redha dengan mereka berdua), tetapi terdapat sedikit perbezaan dalam perkataan.  Dikisahkan oleh beberapa perawi antaranya, Zuhair bin Harb, Muhammad bin Al-Muthanna dan Ubaidillah bin Said yang meriwayatkan dari Yahya, dari Ubaidillah, dari Nafi', dari Ibnu Umar, dari Nabi SAW.  Perbezaan ini terutamanya terdapat dalam riwayat Ubaidillah, di mana baginda berkata, \"Saya bertanya kepada Nafi', apakah itu sighar?\""
  },
  {
    "id": 10621,
    "hadith_number": 3344,
    "tajuk_hadith": "Larangan Rasulullah SAW Terhadap Shighar",
    "perawi_melayu": "Ibn Umar (رضي الله عنهما)",
    "english_text": "Ibn Umar (Allah be pleased with them) reported that Allah's Messenger (ﷺ) prohibited Shighar.",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَبْدِ الرَّحْمَنِ السَّرَّاجِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الشِّغَارِ ‏.‏",
    "malay_translation": "Ibn Umar (رضي الله عنهما) meriwayatkan bahawa Rasulullah SAW melarang Shighar."
  },
  {
    "id": 10622,
    "hadith_number": 3345,
    "tajuk_hadith": "Tiada Perkara Shighar dalam Islam",
    "perawi_melayu": "Ibn 'Umar (رضي الله عنهما) meriwayatkan daripada Rasulullah SAW bahawa:",
    "english_text": "There is no Shighar in islam.",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ شِغَارَ فِي الإِسْلاَمِ ‏\"‏ ‏.‏",
    "malay_translation": "Tidak terdapat perkara yang dinamakan \"Shighar\" dalam Islam."
  },
  {
    "id": 10623,
    "hadith_number": 3346,
    "tajuk_hadith": "Larangan Pertukaran Perkahwinan (Shighar)",
    "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan bahawa Rasulullah SAW melarang Shighar. Ibn Numair menambah:",
    "english_text": "Shighar means that a person should say to the other person: Give me the hand of your daughter in marriage and I will (in return) marry my daughter to you; or merry me your sister, and I will marry my sister to you.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الشِّغَارِ ‏.‏ زَادَ ابْنُ نُمَيْرٍ وَالشِّغَارُ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ زَوِّجْنِي ابْنَتَكَ وَأُزَوِّجُكَ ابْنَتِي أَوْ زَوِّجْنِي أُخْتَكَ وَأُزَوِّجُكَ أُخْتِي ‏.‏",
    "malay_translation": "Shighar bermaksud seseorang berkata kepada orang lain: Nikahkanlah anak perempuanmu kepadaku dan aku akan menikahkan anak perempuan ku kepadamu; atau nikahkanlah adik perempuanmu kepadaku dan aku akan menikahkan adik perempuan ku kepadamu."
  },
  {
    "id": 10624,
    "hadith_number": 3347,
    "tajuk_hadith": "Hadis tentang Penyebutan dan Ketiadaan Nama Ibn Numair dalam Sanad",
    "perawi_melayu": "",
    "english_text": "Hadith ini diriwayatkan berdasarkan Ibn Umar dengan sanad yang sama, tetapi tidak menyebut Ibn Numair.",
    "arabic_text": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا عَبْدَةُ، عَنْ عُبَيْدِ اللَّهِ، - وَهُوَ ابْنُ عُمَرَ - بِهَذَا الإِسْنَادِ وَلَمْ يَذْكُرْ زِيَادَةَ ابْنِ نُمَيْرٍ ‏.‏",
    "malay_translation": "Hadith ini diriwayatkan daripada Ibn Umar dengan sanad yang sama, tetapi tidak menyebut Ibn Numair."
  },
  {
    "id": 10625,
    "hadith_number": 3348,
    "tajuk_hadith": "Larangan Rasulullah SAW Mengenai Shighar",
    "perawi_melayu": "Jabir bin Abdullah",
    "english_text": "Jabir b. Abdullah (Allah be pleased with him) reported that Allah's Messenger (ﷺ) prohibited Shighar.",
    "arabic_text": "وَحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ ح وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ رَافِعٍ، عَنْ عَبْدِ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الشِّغَارِ ‏.‏",
    "malay_translation": "Jabir bin Abdullah melaporkan bahawa Rasulullah SAW telah melarang amalan shighar."
  },
  {
    "id": 10626,
    "hadith_number": 3349,
    "tajuk_hadith": "Syarat Perkahwinan yang Paling Utama",
    "perawi_melayu": "'Uqba bin Amir",
    "english_text": "The most worthy condition which must be fulfilled is that which makes sexual intercourse lawful. In the narration transmitted by Ibn Muthanna (instead of the word \"condition\") it is \"conditions\".",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، حَدَّثَنَا هُشَيْمٌ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، - وَهُوَ الْقَطَّانُ - عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ مَرْثَدِ بْنِ عَبْدِ، اللَّهِ الْيَزَنِيِّ عَنْ عُقْبَةَ بْنِ عَامِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ أَحَقَّ الشَّرْطِ أَنْ يُوفَى بِهِ مَا اسْتَحْلَلْتُمْ بِهِ الْفُرُوجَ ‏\"‏ ‏.‏ هَذَا لَفْظُ حَدِيثِ أَبِي بَكْرٍ وَابْنِ الْمُثَنَّى ‏.‏ غَيْرَ أَنَّ ابْنَ الْمُثَنَّى قَالَ ‏\"‏ الشُّرُوطِ ‏\"‏ ‏.‏",
    "malay_translation": "Syarat yang paling utama yang mesti dipenuhi ialah syarat yang menghalalkan persetubuhan. Dalam riwayat yang disampaikan oleh Ibn Muthanna (bukan \"syarat\"), ia menyebut \"syarat-syarat\". Rasulullah SAW bersabda, 'Sesungguhnya syarat yang paling utama untuk dipenuhi ialah syarat yang menjadikan halal persetubuhan.'"
  },
  {
    "id": 10627,
    "hadith_number": 3350,
    "tajuk_hadith": "Perkahwinan Wanita Tanpa Suami dan Perempuan Perawan:  Keperluan Pertimbangan dan Persetujuan",
    "perawi_melayu": "Abu Hurairah (Allah SWT redha kepadanya) meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "A woman without a husband (or divorced or a widow) must not be married until she is consulted, and a virgin must not be married until her permission is sought. They asked the Prophet of Allah (ﷺ): How her (virgin's) consent can be solicited? He (the Holy Prophet) said: That she keeps silence.",
    "arabic_text": "حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ الْقَوَارِيرِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، حَدَّثَنَا أَبُو سَلَمَةَ، حَدَّثَنَا أَبُو هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تُنْكَحُ الأَيِّمُ حَتَّى تُسْتَأْمَرَ وَلاَ تُنْكَحُ الْبِكْرُ حَتَّى تُسْتَأْذَنَ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَكَيْفَ إِذْنُهَا قَالَ ‏\"‏ أَنْ تَسْكُتَ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang wanita yang tidak berpasangan (atau bercerai atau janda) tidak boleh dinikahi sehingga dia dirunding, dan perempuan perawan tidak boleh dinikahi sehingga mendapat izinnya. Mereka bertanya kepada Rasulullah SAW, “Bagaimana cara mendapatkan izinnya (perempuan perawan)?” Baginda menjawab, “Dengan diamnya.”"
  },
  {
    "id": 10628,
    "hadith_number": 3351,
    "tajuk_hadith": "Hadis Ini Diriwayatkan Melalui Rantai Perawi yang Berbeza",
    "perawi_melayu": "",
    "english_text": "This hadith has been narrated through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا الْحَجَّاجُ بْنُ أَبِي، عُثْمَانَ ح وَحَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا عِيسَى، - يَعْنِي ابْنَ يُونُسَ - عَنِ الأَوْزَاعِيِّ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ، حَدَّثَنَا شَيْبَانُ، ح وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، وَمُحَمَّدُ بْنُ رَافِعٍ قَالاَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، ح وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، الدَّارِمِيُّ أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ، حَدَّثَنَا مُعَاوِيَةُ، كُلُّهُمْ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، ‏.‏ بِمِثْلِ مَعْنَى حَدِيثِ هِشَامٍ وَإِسْنَادِهِ ‏.‏ وَاتَّفَقَ لَفْظُ حَدِيثِ هِشَامٍ وَشَيْبَانَ وَمُعَاوِيَةَ بْنِ سَلاَّمٍ فِي هَذَا الْحَدِيثِ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan melalui beberapa rantai perawi yang berbeza.  Setiap perawi tersebut menyampaikan hadis ini dari sumbernya masing-masing, dengan perincian silsilah yang panjang, dan menunjukkan ketepatan dan kredibiliti para perawi yang terbabit dalam menuturkan hadis ini.  Ini menunjukkan kesinambungan dan keutuhan penyampaian pesan hadis ini.  Walaupun dengan perawi dan silsilah yang berbeza, inti sari hadis ini sama dengan riwayat Hisyam dan mempunyai cara penyampaian yang serupa."
  },
  {
    "id": 10629,
    "hadith_number": 3352,
    "tajuk_hadith": "Keperluan Perundingan dengan Gadis yang Dinikahkan oleh Wali",
    "perawi_melayu": "Dikabarkan oleh 'Aishah (radhiyallahu 'anha):",
    "english_text": "I asked Allah's Messenger (ﷺ) about a virgin whose marriage is solemnised by her guardian, whether it was necessary or not to consult her. Allah's Messerger (ﷺ) said: Yes, she must be consulted. 'A'isha reported: I told him that she feels shy, whereupon Allah's Messenger (ﷺ) said: Her silence implies her consent.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنِ ابْنِ جُرَيْجٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ رَافِعٍ، جَمِيعًا عَنْ عَبْدِ الرَّزَّاقِ، - وَاللَّفْظُ لاِبْنِ رَافِعٍ - حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ سَمِعْتُ ابْنَ أَبِي مُلَيْكَةَ، يَقُولُ قَالَ ذَكْوَانُ مَوْلَى عَائِشَةَ سَمِعْتُ عَائِشَةَ، تَقُولُ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الْجَارِيَةِ يُنْكِحُهَا أَهْلُهَا أَتُسْتَأْمَرُ أَمْ لاَ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَعَمْ تُسْتَأْمَرُ ‏\"‏ ‏.‏ فَقَالَتْ عَائِشَةُ فَقُلْتُ لَهُ فَإِنَّهَا تَسْتَحْيِي ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَذَلِكَ إِذْنُهَا إِذَا هِيَ سَكَتَتْ ‏\"‏ ‏.‏",
    "malay_translation": "Aku bertanya kepada Rasulullah ﷺ tentang seorang gadis yang masih perawan yang wali-nya menikahkannya, adakah perlu untuk berunding dengannya? Rasulullah ﷺ bersabda: Ya, perlu berunding dengannya. 'Aishah meriwayatkan: Aku berkata kepadanya, \"Sesungguhnya dia malu.\" Rasulullah ﷺ bersabda: Jika dia diam, maka diamnya itu adalah persetujuannya."
  },
  {
    "id": 10630,
    "hadith_number": 3353,
    "tajuk_hadith": "Hak Wanita dalam Perkahwinan dan Persetujuan Perempuan.",
    "perawi_melayu": "Ibn 'Abbas (رضي الله عنه) meriwayatkan daripada Rasulullah SAW :",
    "english_text": "A woman without a husband has more right to her person than her guardian, and a virgin's consent must be asked from her, and her silence implies her consent.",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا مَالِكٌ، ح وَحَدَّثَنَا يَحْيَى، بْنُ يَحْيَى - وَاللَّفْظُ لَهُ - قَالَ قُلْتُ لِمَالِكٍ حَدَّثَكَ عَبْدُ اللَّهِ بْنُ الْفَضْلِ، عَنْ نَافِعِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الأَيِّمُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا وَالْبِكْرُ تُسْتَأْذَنُ فِي نَفْسِهَا وَإِذْنُهَا صُمَاتُهَا ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏",
    "malay_translation": "Seorang wanita yang tidak berkahwin lebih berhak ke atas dirinya daripada penjaganya. Persetujuan seorang dara mestilah didapatkan, dan diamnya bererti persetujuan."
  },
  {
    "id": 10631,
    "hadith_number": 3354,
    "tajuk_hadith": "Hak Wanita Terhadap Diri Sendiri dan Pertimbangan terhadap Perempuan Perawan",
    "perawi_melayu": "Ibnu Abbas (رضي الله عنهما) meriwayatkan Rasulullah SAW bersabda:",
    "english_text": "A woman who has been previously married (Thayyib) has more right to her person than her guardian. And a virgin should also be consulted, and her silence implies her consent.",
    "arabic_text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ زِيَادِ بْنِ سَعْدٍ، عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ، سَمِعَ نَافِعَ بْنَ جُبَيْرٍ، يُخْبِرُ عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الثَّيِّبُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا وَالْبِكْرُ تُسْتَأْمَرُ وَإِذْنُهَا سُكُوتُهَا ‏\"‏ ‏.‏",
    "malay_translation": "Wanita yang sudah pernah berkahwin (Thayyib) lebih berhak terhadap dirinya sendiri daripada wali (penjaganya). Dan perempuan perawan juga perlu dirundingkan, dan diamnya menandakan persetujuannya."
  },
  {
    "id": 10632,
    "hadith_number": 3355,
    "tajuk_hadith": "Hak Wanita Berkahwin Terdahulu Atas Diri Sendiri dan Persetujuan Perempuan Dara",
    "perawi_melayu": "Sufyan melaporkan berdasarkan sanad yang sama (dan perkataannya adalah):",
    "english_text": "A woman who has been previously married (Thayyib) has more right to her person than her guardian; and a virgin's father must ask her consent from her, her consent being her silence, At times he said: Her silence is her affirmation.",
    "arabic_text": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، بِهَذَا الإِسْنَادِ وَقَالَ ‏\"‏ الثَّيِّبُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا وَالْبِكْرُ يَسْتَأْذِنُهَا أَبُوهَا فِي نَفْسِهَا وَإِذْنُهَا صُمَاتُهَا ‏\"‏ ‏.‏ وَرُبَّمَا قَالَ ‏\"‏ وَصَمْتُهَا إِقْرَارُهَا ‏\"‏ ‏.‏",
    "malay_translation": "Wanita yang sudah berkahwin (Thayyib) lebih berhak terhadap dirinya sendiri berbanding wali/penjaganya; dan bapa anak dara perlu meminta izinnya, dan persetujuannya ialah diamnya. Kadangkala, beliau berkata: Diamnya bermakna pengakuannya."
  },
  {
    "id": 10633,
    "hadith_number": 3356,
    "tajuk_hadith": "Perkahwinan Rasulullah SAW di Usia Muda dan Perawatan 'Aisyah RA",
    "perawi_melayu": "'Aisyah RA meriwayatkan:",
    "english_text": "Allah's Messenger (ﷺ) married me when I was six years old, and I was admitted to his house at the age of nine. She further said: We went to Medina and I had an attack of fever for a month, and my hair had come down to the earlobes. Umm Ruman (my mother) came to me and I was at that time on a swing along with my playmates. She called me loudly and I went to her and I did not know what she had wanted of me. She took hold of my hand and took me to the door, and I was saying: Ha, ha (as if I was gasping), until the agitation of my heart was over. She took me to a house, where had gathered the women of the Ansar. They all blessed me and wished me good luck and said: May you have share in good. She (my mother) entrusted me to them. They washed my head and embellished me and nothing frightened me. Allah's Messenger (, may peace be upon him) came there in the morning, and I was entrusted to him.",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا أَبُو أُسَامَةَ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي، شَيْبَةَ قَالَ وَجَدْتُ فِي كِتَابِي عَنْ أَبِي أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ تَزَوَّجَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم لِسِتِّ سِنِينَ وَبَنَى بِي وَأَنَا بِنْتُ تِسْعِ سِنِينَ ‏.‏ قَالَتْ فَقَدِمْنَا الْمَدِينَةَ فَوُعِكْتُ شَهْرًا فَوَفَى شَعْرِي جُمَيْمَةً فَأَتَتْنِي أُمُّ رُومَانَ وَأَنَا عَلَى أُرْجُوحَةٍ وَمَعِي صَوَاحِبِي فَصَرَخَتْ بِي فَأَتَيْتُهَا وَمَا أَدْرِي مَا تُرِيدُ بِي فَأَخَذَتْ بِيَدِي فَأَوْقَفَتْنِي عَلَى الْبَابِ ‏.‏ فَقُلْتُ هَهْ هَهْ ‏.‏ حَتَّى ذَهَبَ نَفَسِي فَأَدْخَلَتْنِي بَيْتًا فَإِذَا نِسْوَةٌ مِنَ الأَنْصَارِ فَقُلْنَ عَلَى الْخَيْرِ وَالْبَرَكَةِ وَعَلَى خَيْرِ طَائِرٍ ‏.‏ فَأَسْلَمَتْنِي إِلَيْهِنَّ فَغَسَلْنَ رَأْسِي وَأَصْلَحْنَنِي فَلَمْ يَرُعْنِي إِلاَّ وَرَسُولُ اللَّهِ صلى الله عليه وسلم ضُحًى فَأَسْلَمْنَنِي إِلَيْهِ ‏.‏",
    "malay_translation": "Rasulullah SAW mengahwini saya ketika saya berumur enam tahun, dan saya tinggal di rumah baginda pada usia sembilan tahun.  Kami kemudian pergi ke Madinah dan saya demam selama sebulan, rambut saya sampai ke telinga.  Ibu saya, Umm Ruman, datang menemui saya ketika saya sedang bermain ayunan bersama teman-teman. Beliau memanggil saya dengan kuat dan saya pun pergi ke arah beliau, namun tidak tahu apa maksudnya. Beliau memegang tangan saya dan membawa saya ke pintu.  Saya berkata 'Ha, ha' (seperti lemah), sehingga rasa gelisah itu hilang. Ibu membawa saya ke rumah yang dipenuhi kaum wanita Ansar. Mereka mendoakan kebaikan dan keberkatan serta nasib baik untuk saya.  Kemudian, ibu mempercayakan saya kepada mereka. Mereka mencuci kepala dan menghiasi saya, dan saya tidak merasa takut.  Kemudian, Rasulullah SAW datang ke sana pada waktu pagi dan saya diserahkan kepada baginda."
  },
  {
    "id": 10634,
    "hadith_number": 3357,
    "tajuk_hadith": "Perkahwinan Nabi SAW dengan 'Aisyah di Usia Muda",
    "perawi_melayu": "'Aisyah رضي الله عنها meriwayatkan:",
    "english_text": "Allah's Apostle (ﷺ) married me when I was six years old, and I was admitted to his house when I was nine years old.",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا عَبْدَةُ، - هُوَ ابْنُ سُلَيْمَانَ - عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ تَزَوَّجَنِي النَّبِيُّ صلى الله عليه وسلم وَأَنَا بِنْتُ سِتِّ سِنِينَ وَبَنَى بِي وَأَنَا بِنْتُ تِسْعِ سِنِينَ ‏.‏",
    "malay_translation": "Rasulullah SAW mengahwini saya ketika saya berumur enam tahun, dan saya diizinkan tinggal di rumahnya ketika saya berumur sembilan tahun."
  },
  {
    "id": 10635,
    "hadith_number": 3358,
    "tajuk_hadith": "Perkahwinan Rasulullah SAW dengan Aisyah RA pada Umur Muda",
    "perawi_melayu": "",
    "english_text": "'A'isha (Allah be pleased with her) reported that Allah's Apostle (ﷺ) married her when she was seven years old, and he was taken to his house as a bride when she was nine, and her dolls were with her; and when he (the Holy Prophet) died she was eighteen years old.",
    "arabic_text": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم تَزَوَّجَهَا وَهْىَ بِنْتُ سَبْعِ سِنِينَ وَزُفَّتْ إِلَيْهِ وَهِيَ بِنْتُ تِسْعِ سِنِينَ وَلُعَبُهَا مَعَهَا وَمَاتَ عَنْهَا وَهِيَ بِنْتُ ثَمَانَ عَشْرَةَ ‏.‏",
    "malay_translation": "Aisyah (Semoga Allah merahmati beliau) melaporkan bahawa Rasulullah SAW mengahwininya ketika beliau berusia tujuh tahun, dan beliau dibawa ke rumahnya sebagai pengantin ketika berusia sembilan tahun, dan mainan-mainan beliau turut dibawa bersamanya; dan ketika Baginda Rasulullah SAW wafat, beliau berusia lapan belas tahun."
  },
  {
    "id": 10636,
    "hadith_number": 3359,
    "tajuk_hadith": "Perkahwinan Nabi SAW dengan 'Aisyah r.a. pada Usia Muda",
    "perawi_melayu": "'Aisyah r.a. meriwayatkan:",
    "english_text": "'A'isha (Allah be pleased with her) reported that Allah's Apostle (ﷺ) married her when she was six years old, and he (the Holy Prophet) took her to his house when she was nine, and when he (the Holy Prophet) died she was eighteen years old",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَ يَحْيَى وَإِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ تَزَوَّجَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَهْىَ بِنْتُ سِتٍّ وَبَنَى بِهَا وَهْىَ بِنْتُ تِسْعٍ وَمَاتَ عَنْهَا وَهْىَ بِنْتُ ثَمَانَ عَشْرَةَ ‏.‏",
    "malay_translation": "'Aisyah r.a. meriwayatkan bahawa Rasulullah SAW mengahwininya ketika beliau berumur enam tahun, dan membawanya ke rumah ketika beliau berumur sembilan tahun, dan ketika baginda Rasulullah SAW wafat, beliau berumur lapan belas tahun."
  },
  {
    "id": 10637,
    "hadith_number": 3360,
    "tajuk_hadith": "Perkahwinan Rasulullah SAW dan Keutamaan Bulan Syawal",
    "perawi_melayu": "Aisyah RA meriwayatkan:",
    "english_text": "Allah's Messenger (ﷺ) contracted marriage with me in Shawwal and took me to his house as a bride during Shawwal. And who among the wives of Allah's Messenger (ﷺ) was dearer to him than I, and' A'isha liked that the women (of her family) should enter the houses as brides during the month of Shawwal.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لِزُهَيْرٍ - قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، عَنْ عَبْدِ اللَّهِ بْنِ عُرْوَةَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ تَزَوَّجَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم فِي شَوَّالٍ وَبَنَى بِي فِي شَوَّالٍ فَأَىُّ نِسَاءِ رَسُولِ اللَّهِ صلى الله عليه وسلم كَانَ أَحْظَى عِنْدَهُ مِنِّي ‏.‏ قَالَ وَكَانَتْ عَائِشَةُ تَسْتَحِبُّ أَنْ تُدْخِلَ نِسَاءَهَا فِي شَوَّالٍ ‏.‏",
    "malay_translation": "Rasulullah SAW telah mengahwini saya pada bulan Syawal dan mengambil saya sebagai isteri pada bulan Syawal itu juga. Dan siapakah di antara isteri-isteri Rasulullah SAW yang lebih dikasihi olehnya daripada saya? Aisyah RA suka wanita-wanita (dari keluarganya) memasuki rumah-rumah sebagai pengantin pada bulan Syawal."
  },
  {
    "id": 10638,
    "hadith_number": 3361,
    "tajuk_hadith": "Hadis Mengenai Pernikahan 'Aisyah",
    "perawi_melayu": "",
    "english_text": "Hadis ini diriwayatkan oleh Sufyan dengan sanad yang sama, tetapi beliau tidak menyebut tentang 'Aisyah diizinkan menjadi isteri Nabi.",
    "arabic_text": "وَحَدَّثَنَاهُ ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سُفْيَانُ، بِهَذَا الإِسْنَادِ وَلَمْ يَذْكُرْ فِعْلَ عَائِشَةَ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan oleh Sufyan dengan sanad yang sama, tetapi beliau tidak menyebut tentang tindakan 'Aisyah (dimasukkan sebagai isteri dalam rumah Nabi). "
  },
  {
    "id": 10639,
    "hadith_number": 3362,
    "tajuk_hadith": "Pertimbangan Pandangan Mata dalam Perkahwinan Ansar",
    "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
    "english_text": "I was in the company of Allah's Messenger (ﷺ) when there came a man and informed him that he had contracted to marry a woman of the Ansar. Thereupon Allah's Messenger (ﷺ) said: Did you cast a glance at her? He said: No. He said: Go and cast a glance at her, for there is something in the eyes of the Ansar.",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ يَزِيدَ بْنِ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي، هُرَيْرَةَ قَالَ كُنْتُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَأَتَاهُ رَجُلٌ فَأَخْبَرَهُ أَنَّهُ تَزَوَّجَ امْرَأَةً مِنَ الأَنْصَارِ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَنَظَرْتَ إِلَيْهَا ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَاذْهَبْ فَانْظُرْ إِلَيْهَا فَإِنَّ فِي أَعْيُنِ الأَنْصَارِ شَيْئًا ‏\"‏ ‏.‏",
    "malay_translation": "Saya berada di sisi Rasulullah SAW ketika datang seorang lelaki memberitahunya bahawa dia telah berjanji untuk mengahwini seorang wanita Ansar. Lalu Rasulullah SAW bertanya, \"Adakah engkau melihatnya?\" Lelaki itu menjawab, \"Tidak.\" Rasulullah SAW bersabda, \"Pergilah dan lihatlah dia, kerana terdapat sesuatu yang istimewa dalam pandangan mata kaum Ansar.\""
  },
  {
    "id": 10640,
    "hadith_number": 3363,
    "tajuk_hadith": "Perkahwinan dan Dower dengan Wanita Ansar",
    "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
    "english_text": "A man came to Allah's Messenger (ﷺ) and said: I have contracted marriage with a woman of the Ansar, whereupon Allah's Apostle (ﷺ) said: Did you cast a glance at her, for there is something in the eyes of the Ansar? He said: I did cast a glance at her, whereupon he said: For what (dower) did you marry her? He said: For four 'uqiyas. Thereupon Allah's Apostle (ﷺ) said: For four 'uqiyas; it seems as if you dig out silver from the side of this mountain (and that is why you are prepared to pay such a large amount of dower). We have nothing which we should give you. There is a possibility that we may send you to an (expedition) where you may get (booty). So he sent that man (in the expedition) which was despatched to Banu 'Abs.",
    "arabic_text": "وَحَدَّثَنِي يَحْيَى بْنُ مَعِينٍ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ، حَدَّثَنَا يَزِيدُ بْنُ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ إِنِّي تَزَوَّجْتُ امْرَأَةً مِنَ الأَنْصَارِ ‏.‏ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هَلْ نَظَرْتَ إِلَيْهَا فَإِنَّ فِي عُيُونِ الأَنْصَارِ شَيْئًا ‏\"‏ ‏.‏ قَالَ قَدْ نَظَرْتُ إِلَيْهَا ‏.‏ قَالَ ‏\"‏ عَلَى كَمْ تَزَوَّجْتَهَا ‏\"‏ ‏.‏ قَالَ عَلَى أَرْبَعِ أَوَاقٍ ‏.‏ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ عَلَى أَرْبَعِ أَوَاقٍ كَأَنَّمَا تَنْحِتُونَ الْفِضَّةَ مِنْ عُرْضِ هَذَا الْجَبَلِ مَا عِنْدَنَا مَا نُعْطِيكَ وَلَكِنْ عَسَى أَنْ نَبْعَثَكَ فِي بَعْثٍ تُصِيبُ مِنْهُ ‏\"‏ ‏.‏ قَالَ فَبَعَثَ بَعْثًا إِلَى بَنِي عَبْسٍ بَعَثَ ذَلِكَ الرَّجُلَ فِيهِمْ ‏.‏",
    "malay_translation": "Seorang lelaki datang kepada Rasulullah SAW dan berkata, \"Saya telah berkahwin dengan seorang wanita Ansar.\" Baginda SAW bertanya, \"Adakah engkau memandangnya? Sesungguhnya ada sesuatu dalam pandangan wanita Ansar.\" Lelaki itu menjawab, \"Ya, saya telah memandangnya.\" Baginda SAW bertanya, \"Berapakah mas kahwin yang engkau bayar?\" Lelaki itu menjawab, \"Empat uqiyah.\" Baginda SAW berkata, \"Empat uqiyah? Seakan-akan engkau menoreh perak dari gunung ini. Kita tidak mempunyai apa yang patut kita berikan. Mungkin kita akan menghantarmu dalam suatu ekspedisi untuk mendapatkan rampasan perang.\" Lalu Baginda SAW menghantar lelaki itu ke ekspedisi yang dihantar kepada Bani 'Abs."
  },
  {
    "id": 10641,
    "hadith_number": 3364,
    "tajuk_hadith": "Perkahwinan Wanita dan Kemampuan Kewangan Lelaki",
    "perawi_melayu": "Sahl bin Sa'd al-Sa'idi meriwayatkan:",
    "english_text": "A woman came to Allah's Messenger. (ﷺ) and said: Messenger of Allah, I have come to you to entrust myself to you (you may contract my marriage with anyone at your discretion). Allah's Messenger (ﷺ) saw her and cast a glance at her from head to foot. Allah's Messenger (ﷺ) then lowered his head. When the woman saw that he had made no decision in regard to her, she sat down. There stood up a person from amongst his companions and said: Messenger of Allah, marry her to me if you have no need of her. He (the Prophet) said: is there anything with you (which you con give as a dower)? He said: No, Messenger of Allah, by Allah I have nothing. Thereupon Allah's Messenger (ﷺ) said: Go to your people (family) and see if you can find something. He returned and said: I have found nothing. The Messenger of Allah (ﷺ) said: See even if it is an iron ring. He went and returned and said: No, by Allah, not even an iron ring, but only this lower garment of mine (Sahl said that he had no upper garment), half of which (I am prepared to part with) for her. Thereupon Allah's Messenger (ﷺ) said: How can your lower garment serve your purpose, for it you wear it, she would not be able to make any use of it and if she wears it there would not be anything on you? The man sat down and as the sitting prolonged he stood up (in disappointment) and as he was going back Allah's Messenger (ﷺ) commanded (him) to be called back, and as he came, he said to him: Do you know any part of the Qur'an? He said: I know such and such surahs (and he counted them), whereupon he (ﷺ) said: Can you recite them from heart (from your memory)? He said: Yes, whereupon he (Allah's Messenger) said: Go, I have given her to you in marriage for the part of the Qur'an which you know.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ الثَّقَفِيُّ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ - عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، ح\n وَحَدَّثَنَاهُ قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلِ بْنِ سَعْدٍ، السَّاعِدِيِّ قَالَ جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ جِئْتُ أَهَبُ لَكَ نَفْسِي ‏.‏ فَنَظَرَ إِلَيْهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَعَّدَ النَّظَرَ فِيهَا وَصَوَّبَهُ ثُمَّ طَأْطَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَأْسَهُ فَلَمَّا رَأَتِ الْمَرْأَةُ أَنَّهُ لَمْ يَقْضِ فِيهَا شَيْئًا جَلَسَتْ فَقَامَ رَجُلٌ مِنْ أَصْحَابِهِ فَقَالَ يَا رَسُولَ اللَّهِ إِنْ لَمْ يَكُنْ لَكَ بِهَا حَاجَةٌ فَزَوِّجْنِيهَا ‏.‏ فَقَالَ ‏\"‏ فَهَلْ عِنْدَكَ مِنْ شَىْءٍ ‏\"‏ ‏.‏ فَقَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ ‏\"‏ اذْهَبْ إِلَى أَهْلِكَ فَانْظُرْ هَلْ تَجِدُ شَيْئًا ‏\"‏ ‏.‏ فَذَهَبَ ثُمَّ رَجَعَ فَقَالَ لاَ وَاللَّهِ مَا وَجَدْتُ شَيْئًا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ انْظُرْ وَلَوْ خَاتِمًا مِنْ حَدِيدٍ ‏\"‏ ‏.‏ فَذَهَبَ ثُمَّ رَجَعَ ‏.‏ فَقَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ وَلاَ خَاتِمًا مِنْ حَدِيدٍ ‏.‏ وَلَكِنْ هَذَا إِزَارِي - قَالَ سَهْلٌ مَا لَهُ رِدَاءٌ - فَلَهَا نِصْفُهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا تَصْنَعُ بِإِزَارِكَ إِنْ لَبِسْتَهُ لَمْ يَكُنْ عَلَيْهَا مِنْهُ شَىْءٌ وَإِنْ لَبِسَتْهُ لَمْ يَكُنْ عَلَيْكَ مِنْهُ شَىْءٌ ‏\"‏ ‏.‏ فَجَلَسَ الرَّجُلُ حَتَّى إِذَا طَالَ مَجْلِسُهُ قَامَ فَرَآهُ رَسُولُ اللَّهِ صلى الله عليه وسلم مُوَلِّيًا فَأَمَرَ بِهِ فَدُعِيَ فَلَمَّا جَاءَ قَالَ ‏\"‏ مَاذَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏ ‏.‏ قَالَ مَعِي سُورَةُ كَذَا وَسُورَةُ كَذَا - عَدَّدَهَا ‏.‏ فَقَالَ ‏\"‏ تَقْرَؤُهُنَّ عَنْ ظَهْرِ قَلْبِكَ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ اذْهَبْ فَقَدْ مَلَّكْتُكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏ ‏.‏ هَذَا حَدِيثُ ابْنِ أَبِي حَازِمٍ وَحَدِيثُ يَعْقُوبَ يُقَارِبُهُ فِي اللَّفْظِ ‏.‏",
    "malay_translation": "Seorang wanita datang kepada Rasulullah SAW dan berkata, \"Wahai Rasulullah, aku datang untuk menyerahkan diriku kepadamu (kau boleh menikahkan aku dengan sesiapa yang kau kehendaki).\"  Rasulullah SAW melihatnya dan memandangnya dari kepala hingga kaki. Kemudian, Rasulullah SAW menundukkan kepalanya.  Ketika wanita itu melihat bahawa baginda tidak membuat keputusan mengenainya, dia duduk. Seorang sahabat bangun dan berkata, \"Wahai Rasulullah, jika baginda tidak memerlukannya, nikahkan dia dengan saya.\"  Baginda bertanya, \"Adakah engkau mempunyai sesuatu (mas kahwin)?\" Dia menjawab, \"Tidak, wahai Rasulullah, demi Allah, aku tidak mempunyai apa-apa.\"  Lalu Rasulullah SAW berkata, \"Pergi kepada keluargamu dan lihat jika engkau boleh menemui sesuatu.\" Dia pergi dan kembali sambil berkata, \"Demi Allah, aku tidak menemui apa-apa.\" Rasulullah SAW berkata, \"Carilah, sekalipun itu cincin besi.\" Dia pergi dan kembali sambil berkata, \"Demi Allah, wahai Rasulullah, tidak sekalipun cincin besi, tetapi hanya kain sarungku ini – (Sahl berkata baginda tidak mempunyai pakaian atas) – setengah daripada bahagiannya untuknya.\"  Rasulullah SAW berkata, \"Apa gunanya kain sarungmu? Jika kau memakainya, tidak ada apa-apa padanya dan jika dia memakainya, tidak ada apa-apa padamu.\"  Lelaki itu duduk dan setelah lama duduk, dia berdiri (dengan kecewa) dan ketika dia hendak pergi, Rasulullah SAW memerintahkan dia dipanggil balik.  Ketika dia datang, baginda bertanya, \"Apakah yang engkau ketahui daripada al-Quran?\" Lelaki itu menjawab, \"Aku tahu surah begini dan begini\" (dan dia menyebut beberapa surah).  Baginda bertanya, \"Bolehkah engkau membacanya daripada hafalan (ingatan)?\"  Dia menjawab, \"Ya.\"  Lalu baginda berkata, \"Pergilah, aku telah menikahkannya kepadamu dengan apa yang engkau ketahui daripada al-Quran.\""
  },
  {
    "id": 10642,
    "hadith_number": 3365,
    "tajuk_hadith": "Mengajarkan Al-Quran Kepada Istri Baru",
    "perawi_melayu": "Hadith ini diriwayatkan oleh Sahl bin Sa'd dengan sedikit perubahan perkataan, tetapi riwayat melalui Za'idah menyebut Nabi saw. bersabda:",
    "english_text": "Go, I have married her to you, and you teach her something of the Qur'an.",
    "arabic_text": "وَحَدَّثَنَاهُ خَلَفُ بْنُ هِشَامٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، ح وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، عَنِ الدَّرَاوَرْدِيِّ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ، أَبِي شَيْبَةَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، كُلُّهُمْ عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، بِهَذَا الْحَدِيثِ يَزِيدُ بَعْضُهُمْ عَلَى بَعْضٍ غَيْرَ أَنَّ فِي حَدِيثِ زَائِدَةَ قَالَ ‏\n\"‏ انْطَلِقْ فَقَدْ زَوَّجْتُكَهَا فَعَلِّمْهَا مِنَ الْقُرْآنِ ‏\"‏ ‏.‏",
    "malay_translation": "Pergilah, aku telah menikahkannya denganmu, dan ajarkanlah kepadanya sedikit dari Al-Quran."
  },
  {
    "id": 10643,
    "hadith_number": 3366,
    "tajuk_hadith": "Jumlah Mas Kawin Rasulullah SAW",
    "perawi_melayu": "Abu Salama bin Abd al-Rahman meriwayatkan:",
    "english_text": "I asked 'A'isha, the wife of Allah's Messenger (ﷺ): What is the amount of dower of Allah's Messenger (ﷺ)? She said: It was twelve 'uqiyas and one nash. She said: Do you know what is al-nash? I said: No. She said: It is half of uqiya, and it amounts to five hundred dirhams, and that was the dower given by Allah's Messenger (ﷺ) to his wives.",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، حَدَّثَنِي يَزِيدُ بْنُ عَبْدِ، اللَّهِ بْنِ أُسَامَةَ بْنِ الْهَادِ ح وَحَدَّثَنِي مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا عَبْدُ، الْعَزِيزِ عَنْ يَزِيدَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ قَالَ سَأَلْتُ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَمْ كَانَ صَدَاقُ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَتْ كَانَ صَدَاقُهُ لأَزْوَاجِهِ ثِنْتَىْ عَشْرَةَ أُوقِيَّةً وَنَشًّا ‏.‏ قَالَتْ أَتَدْرِي مَا النَّشُّ قَالَ قُلْتُ لاَ ‏.‏ قَالَتْ نِصْفُ أُوقِيَّةٍ ‏.‏ فَتِلْكَ خَمْسُمِائَةِ دِرْهَمٍ فَهَذَا صَدَاقُ رَسُولِ اللَّهِ صلى الله عليه وسلم لأَزْوَاجِهِ‏.‏",
    "malay_translation": "Saya bertanya kepada 'Aisyah, isteri Rasulullah SAW: Berapakah mas kawin Rasulullah SAW?  Jawabnya: Dua belas *uqiyah* dan satu *nash*.  Kemudian dia bertanya lagi: Tahukah kamu apa itu *nash*? Aku berkata: Tidak.  Dia menjawab: Ia separuh daripada *uqiyah*, iaitu sama dengan lima ratus *dirham*.  Itulah mas kawin yang diberikan Rasulullah SAW kepada isteri-isterinya."
  },
  {
    "id": 10644,
    "hadith_number": 3367,
    "tajuk_hadith": "Mengadakan Perkahwinan Walau Dengan Seekor Kambing",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW melihat tanda kekuningan pada 'Abd al-Rahman bin 'Auf dan bersabda:",
    "english_text": "What is this? Thereupon he said: Allah's Messenger, I have married a woman for a date-stone's weight of gold. He said: God bless you! Hold a wedding feast, even if only with a sheep.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَأَبُو الرَّبِيعِ، سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ وَقُتَيْبَةُ بْنُ سَعِيدٍ وَاللَّفْظُ لِيَحْيَى قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى عَلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَثَرَ صُفْرَةٍ فَقَالَ ‏\"‏ مَا هَذَا ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ إِنِّي تَزَوَّجْتُ امْرَأَةً عَلَى وَزْنِ نَوَاةٍ مِنْ ذَهَبٍ ‏.‏ قَالَ ‏\"‏ فَبَارَكَ اللَّهُ لَكَ أَوْلِمْ وَلَوْ بِشَاةٍ ‏\"‏.",
    "malay_translation": "Apa ini? Lalu dia berkata, \"Wahai Rasulullah, aku telah mengahwini seorang wanita dengan berat emas seberat biji kurma. Baginda bersabda, \"Semoga Allah memberkati engkau! Adakan kenduri walau sekadar dengan seekor kambing.\""
  },
  {
    "id": 10645,
    "hadith_number": 3368,
    "tajuk_hadith": "Memberi Jamuan Walau dengan Seekor Kambing",
    "perawi_melayu": "Anas bin Malik (Allah SWT reda dengannya) melaporkan bahawa 'Abd al-Rahman bin 'Auf (Allah SWT reda dengannya) berkahwin semasa zaman Rasulullah SAW dengan mahar seberat biji emas. Rasulullah SAW bersabda kepadanya:",
    "english_text": "Give a feast even with a sheep.",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ، تَزَوَّجَ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى وَزْنِ نَوَاةٍ مِنْ ذَهَبٍ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَوْلِمْ وَلَوْ بِشَاةٍ ‏\"‏.",
    "malay_translation": "Memberikan jamuan walaupun dengan seekor kambing.  Rasulullah SAW bersabda, \"Berilah jamuan walaupun dengan seekor kambing.\""
  },
  {
    "id": 10646,
    "hadith_number": 3369,
    "tajuk_hadith": "Adakan Jamuan Perkahwinan Walaupun Hanya dengan Seekor Kambing",
    "perawi_melayu": "Anas bin Malik (رضي الله عنه) meriwayatkan bahawa 'Abd al-Rahman bin 'Auf (رضي الله عنه) telah mengahwini seorang wanita dengan mahar seberat batu kurma daripada emas, dan Rasulullah SAW bersabda kepadanya:",
    "english_text": "Hold a wedding feast, even if only with a sheep.",
    "arabic_text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا وَكِيعٌ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، وَحُمَيْدٍ، عَنْ أَنَسٍ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ، تَزَوَّجَ امْرَأَةً عَلَى وَزْنِ نَوَاةٍ مِنْ ذَهَبٍ وَأَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لَهُ ‏\n\"‏ أَوْلِمْ وَلَوْ بِشَاةٍ ‏\"‏ ‏.‏",
    "malay_translation": "Adakanlah jamuan perkahwinan, walaupun hanya dengan seekor kambing."
  },
  {
    "id": 10647,
    "hadith_number": 3370,
    "tajuk_hadith": "Perkahwinan Seorang Lelaki",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Humaid dengan sanad yang sama kecuali (dengan perubahan perkataan kecil ini) bahawa 'Abd al-Rahman berkata:",
    "english_text": "\" I married a woman.\"",
    "arabic_text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو دَاوُدَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، وَهَارُونُ، بْنُ عَبْدِ اللَّهِ قَالاَ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، ح وَحَدَّثَنَا أَحْمَدُ بْنُ خِرَاشٍ، حَدَّثَنَا شَبَابَةُ، كُلُّهُمْ عَنْ شُعْبَةَ، عَنْ حُمَيْدٍ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّ فِي، حَدِيثِ وَهْبٍ قَالَ قَالَ عَبْدُ الرَّحْمَنِ تَزَوَّجْتُ امْرَأَةً ‏.‏",
    "malay_translation": "Aku berkahwin dengan seorang wanita."
  },
  {
    "id": 10648,
    "hadith_number": 3371,
    "tajuk_hadith": "Pernikahan dan Mahr Seorang Sahabat",
    "perawi_melayu": "Abd al-Rahman b. 'Auf (رضي الله عنه)",
    "english_text": "I have married a woman of the Ansar. He said: How much Mahr have you paid? I said: For a date-stone weight of gold. And in the hadith transmitted by Ishaq (it is): (nawat weight) of gold.",
    "arabic_text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ قُدَامَةَ، قَالاَ أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ قَالَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ رَآنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَعَلَىَّ بَشَاشَةُ الْعُرْسِ فَقُلْتُ تَزَوَّجْتُ امْرَأَةً مِنَ الأَنْصَارِ ‏.‏ فَقَالَ ‏\n\"‏ كَمْ أَصْدَقْتَهَا ‏\"‏ ‏.‏ فَقُلْتُ نَوَاةً ‏.‏ وَفِي حَدِيثِ إِسْحَاقَ مِنْ ذَهَبٍ ‏.‏",
    "malay_translation": "Aku telah mengahwini seorang wanita daripada kalangan Ansar. Baginda bertanya, \"Berapakah hantaran yang engkau berikan?\" Aku menjawab, \"Seberat biji kurma emas.\" Dan dalam riwayat daripada Ishaq (berkata), \"(berat nawat) emas.\""
  },
  {
    "id": 10649,
    "hadith_number": 3372,
    "tajuk_hadith": "Perkahwinan dengan Harga Sesuatu yang Tidak Bernilai",
    "perawi_melayu": "",
    "english_text": "Anas bin Malik meriwayatkan bahawa 'Abd al-Rahman berkahwin dengan seorang wanita dengan harga seberat batu biji kurma emas.",
    "arabic_text": "وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي حَمْزَةَ، - قَالَ شُعْبَةُ وَاسْمُهُ عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَبْدِ اللَّهِ - عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ عَبْدَ الرَّحْمَنِ، تَزَوَّجَ امْرَأَةً عَلَى وَزْنِ نَوَاةٍ مِنْ ذَهَبٍ ‏.‏",
    "malay_translation": "Anas bin Malik meriwayatkan bahawa 'Abd al-Rahman mengahwini seorang wanita dengan harga yang seberat biji buah kurma daripada emas. "
  },
  {
    "id": 10650,
    "hadith_number": 3373,
    "tajuk_hadith": "Perkataan Seorang daripada Anak-Anak Abd al-Rahman bin Auf tentang Emas",
    "perawi_melayu": "Shu'ba telah meriwayatkan hadis ini dengan sanad yang sama kecuali (perubahan ini) bahawa beliau berkata bahawa seorang lelaki daripada anak-anak Abd al-Rahman bin Auf berkata:",
    "english_text": "\" dari emas \".",
    "arabic_text": "وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا وَهْبٌ، أَخْبَرَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّهُ قَالَ فَقَالَ رَجُلٌ مِنْ وَلَدِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ مِنْ ذَهَبٍ ‏.",
    "malay_translation": "Daripada emas."
  },
  {
    "id": 10651,
    "hadith_number": 3374,
    "tajuk_hadith": "Peristiwa Penaklukan Khaibar dan Perkahwinan Rasulullah SAW dengan Sayyidah Safiyyah",
    "perawi_melayu": "Anas bin Malik r.a.",
    "english_text": "Allahu Akbar (Allah Yang Maha Besar). Khaibar musnah. Dan apabila kita turun ke lembah suatu kaum, maka pagi hari orang-orang yang diberi peringatan itu amat buruk. Dia mengulanginya sebanyak tiga kali. Sementara itu, orang-orang keluar untuk bekerja, dan berkata: Demi Allah, Muhammad (telah datang). Abd al-'Aziz atau beberapa sahabat kita berkata: Muhammad dan tentera (telah datang). Dia berkata: Kami menaklukkannya (wilayah Khaibar) dengan paksa, dan tawanan perang dikumpulkan. Dihya datang dan berkata: Wahai Rasulullah, berikanlah aku seorang wanita dari kalangan tawanan. Baginda bersabda: Pergilah dan ambillah mana-mana wanita. Dia memilih Safiyyah binti Huyayy. Seorang datang kepada Rasulullah SAW dan berkata: Wahai Rasulullah, Engkau telah berikan Safiyyah binti Huyayy, ketua kaum Quraizah dan al-Nadhir kepada Dihya, dan dia hanya layak untukmu. Baginda bersabda: Panggil dia bersamanya. Maka dia datang bersamanya. Ketika Rasulullah SAW melihatnya, Baginda bersabda: Ambillah wanita lain dari kalangan tawanan. (Perawi berkata): Baginda kemudian membebaskannya dan mengahwininya. Thabit bertanya kepadanya: Wahai Abu Hamza, berapa banyak mas kahwin yang diberikan Baginda kepadanya? Dia berkata: Baginda membebaskannya dan kemudian mengahwininya. Di sepanjang jalan, Umm Sulaim memperhiasinya dan menghantarnya kepadanya (Rasulullah SAW) pada waktu malam. Rasulullah SAW muncul seperti pengantin lelaki di pagi hari. Baginda bersabda: Barang siapa yang mempunyai sesuatu untuk dimakan, hendaklah dia bawakannya. Kemudian kain itu disebarkan. Seorang membawa keju, seorang membawa kurma, dan seorang lagi membawa mentega yang halus, dan mereka menyediakan hidangan, dan itu adalah jamuan perkahwinan Rasulullah SAW.",
    "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنِي ابْنَ عُلَيَّةَ - عَنْ عَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم غَزَا خَيْبَرَ قَالَ فَصَلَّيْنَا عِنْدَهَا صَلاَةَ الْغَدَاةِ بِغَلَسٍ فَرَكِبَ نَبِيُّ اللَّهِ صلى الله عليه وسلم وَرَكِبَ أَبُو طَلْحَةَ وَأَنَا رَدِيفُ أَبِي طَلْحَةَ فَأَجْرَى نَبِيُّ اللَّهِ صلى الله عليه وسلم فِي زُقَاقِ خَيْبَرَ وَإِنَّ رُكْبَتِي لَتَمَسُّ فَخِذَ نَبِيِّ اللَّهِ صلى الله عليه وسلم وَانْحَسَرَ الإِزَارُ عَنْ فَخِذِ نَبِيِّ اللَّهِ صلى الله عليه وسلم فَإِنِّي لأَرَى بَيَاضَ فَخِذِ نَبِيِّ اللَّهِ صلى الله عليه وسلم فَلَمَّا دَخَلَ الْقَرْيَةَ قَالَ ‏\"‏ اللَّهُ أَكْبَرُ خَرِبَتْ خَيْبَرُ إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ فَسَاءَ صَبَاحُ الْمُنْذَرِينَ ‏\"‏ ‏.‏ قَالَهَا ثَلاَثَ مَرَّاتٍ قَالَ وَقَدْ خَرَجَ الْقَوْمُ إِلَى أَعْمَالِهِمْ فَقَالُوا مُحَمَّدٌ وَاللَّهِ ‏.‏ قَالَ عَبْدُ الْعَزِيزِ وَقَالَ بَعْضُ أَصْحَابِنَا مُحَمَّدٌ وَالْخَمِيسُ ‏.‏ قَالَ وَأَصَبْنَاهَا عَنْوَةً وَجُمِعَ السَّبْىُ فَجَاءَهُ دِحْيَةُ فَقَالَ يَا رَسُولَ اللَّهِ أَعْطِنِي جَارِيَةً مِنَ السَّبْىِ ‏.‏ فَقَالَ ‏\"‏ اذْهَبْ فَخُذْ جَارِيَةً ‏\"‏ ‏.‏ فَأَخَذَ صَفِيَّةَ بِنْتَ حُيَىٍّ فَجَاءَ رَجُلٌ إِلَى نَبِيِّ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا نَبِيَّ اللَّهِ أَعْطَيْتَ دِحْيَةَ صَفِيَّةَ بِنْتَ حُيَىٍّ سَيِّدِ قُرَيْظَةَ وَالنَّضِيرِ مَا تَصْلُحُ إِلاَّ لَكَ ‏.‏ قَالَ ‏\"‏ ادْعُوهُ بِهَا ‏\"‏ ‏.‏ قَالَ فَجَاءَ بِهَا فَلَمَّا نَظَرَ إِلَيْهَا النَّبِيُّ صلى الله عليه وسلم قَالَ ‏\"‏ خُذْ جَارِيَةً مِنَ السَّبْىِ غَيْرَهَا ‏\"‏ ‏.‏ قَالَ وَأَعْتَقَهَا وَتَزَوَّجَهَا ‏.‏ فَقَالَ لَهُ ثَابِتٌ يَا أَبَا حَمْزَةَ مَا أَصْدَقَهَا قَالَ نَفْسَهَا أَعْتَقَهَا وَتَزَوَّجَهَا حَتَّى إِذَا كَانَ بِالطَّرِيقِ جَهَّزَتْهَا لَهُ أُمُّ سُلَيْمٍ فَأَهْدَتْهَا لَهُ مِنَ اللَّيْلِ فَأَصْبَحَ النَّبِيُّ صلى الله عليه وسلم عَرُوسًا فَقَالَ ‏\"‏ مَنْ كَانَ عِنْدَهُ شَىْءٌ فَلْيَجِئْ بِهِ ‏\"‏ قَالَ وَبَسَطَ نِطَعًا قَالَ فَجَعَلَ الرَّجُلُ يَجِيءُ بِالأَقِطِ وَجَعَلَ الرَّجُلُ يَجِيءُ بِالتَّمْرِ وَجَعَلَ الرَّجُلُ يَجِيءُ بِالسَّمْنِ فَحَاسُوا حَيْسًا ‏.‏ فَكَانَتْ وَلِيمَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Diceritakan oleh Anas bin Malik r.a. bahawa Rasulullah SAW telah pergi berjihad ke Khaibar.  Kami menunaikan solat Subuh di sana. Baginda dan Abu Talha menunggang kuda, dan saya menunggang di belakang Abu Talha. Rasulullah SAW lalu melintasi jalan sempit Khaibar, sehinggakan lutut saya menyentuh paha Baginda.  Jubah Baginda terjuntai sedikit, dan saya nampak kulit Baginda yang putih. Setelah sampai ke kawasan tersebut, Baginda berseru, \"Allahu Akbar! Khaibar telah musnah! Sesungguhnya jika kita turun ke lembah kaum tertentu, maka pagi hari bagi orang yang diberi peringatan itu amat buruk.\" Baginda mengulangi tiga kali.  Pada masa itu, penduduk keluar bekerja, dan mereka berkata, \"Demi Allah, Muhammad telah datang!\" Abd al-'Aziz dan beberapa sahabat kita berkata, \"Muhammad dan pasukan (telah tiba)!\" Baginda berkata, \"Kami menaklukkannya dengan paksa, dan tawanan perang dikumpulkan.\" Dihya datang dan berkata, \"Wahai Rasulullah, berikanlah aku seorang tawanan wanita.\" Baginda menjawab, \"Pergilah dan ambillah mana-mana wanita.\" Dia mengambil Safiyyah binti Huyayy. Kemudian seorang datang kepada Baginda dan berkata, \"Wahai Rasulullah, engkau telah berikan Safiyyah binti Huyayy, pemimpin Quraizah dan al-Nadhir kepada Dihya, dan dia hanya layak untukmu.\" Baginda berkata, \"Panggil dia ke sini.\" Dia datang bersama Safiyyah. Ketika Baginda melihatnya, Baginda berkata, \"Ambillah wanita lain dari kalangan tawanan.\" Perawi berkata, \"Baginda kemudian membebaskannya dan mengahwininya.\" Thabit bertanya kepadanya, \"Wahai Abu Hamza, berapa banyak mas kahwin yang diberikan Baginda kepadanya?\" Dia menjawab, \"Baginda membebaskannya dan kemudian mengahwininya.\"  Di tengah perjalanan, Umm Sulaim mempersiapkannya dan menghantarnya kepada Baginda pada malam hari.  Pada pagi hari, Rasulullah SAW muncul seperti pengantin lelaki. Baginda bersabda, \"Barang siapa yang mempunyai makanan, hendaklah dia bawakannya.\"  Kemudian, kain disebarkan. Ada yang membawa keju, ada yang membawa kurma, ada yang membawa mentega, dan mereka menyediakan jamuan hidangan, yang merupakan jamuan perkahwinan Rasulullah SAW."
  },
  {
    "id": 10652,
    "hadith_number": 3375,
    "tajuk_hadith": "Perkahwinan Nabi SAW dengan Safiyyah dan Pembebasan Beliau Sebagai Mas Kahwin",
    "perawi_melayu": "Hadis ini diriwayatkan melalui beberapa rantaian perawi dengan sandaran daripada Anas bahawa Rasulullah SAW telah membebaskan Safiyyah dan pembebasannya dijadikan sebagai mas kahwin beliau.  Terdapat juga riwayat yang menyebut perkahwinan tersebut dan pembebasan itu sebagai mas kahwin.",
    "english_text": "\" He (the Holy Prophet) married Safiyya and bestowed her emancipation as her wedding gift.\"",
    "arabic_text": "وَحَدَّثَنِي أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا حَمَّادٌ، - يَعْنِي ابْنَ زَيْدٍ - عَنْ ثَابِتٍ، وَعَبْدِ، الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسٍ، ح\n وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَمَّادٌ، - يَعْنِي ابْنَ زَيْدٍ - عَنْ ثَابِتٍ، وَشُعَيْبِ، بْنِ حَبْحَابٍ عَنْ أَنَسٍ، ح \n وَحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، وَعَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ، ح \n وَحَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي عُثْمَانَ، عَنْ أَنَسٍ، ح\n وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ شُعَيْبِ بْنِ الْحَبْحَابِ، عَنْ أَنَسٍ، ح\n وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، وَعُمَرُ بْنُ سَعْدٍ، وَعَبْدُ الرَّزَّاقِ، جَمِيعًا عَنْ سُفْيَانَ، عَنْ يُونُسَ بْنِ عُبَيْدٍ، عَنْ شُعَيْبِ بْنِ الْحَبْحَابِ، عَنْ أَنَسٍ، كُلُّهُمْ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ أَعْتَقَ صَفِيَّةَ وَجَعَلَ عِتْقَهَا صَدَاقَهَا ‏.‏ وَفِي حَدِيثِ مُعَاذٍ عَنْ أَبِيهِ تَزَوَّجَ صَفِيَّةَ وَأَصْدَقَهَا عِتْقَهَا.",
    "malay_translation": "Baginda (Nabi SAW) telah mengahwini Safiyyah dan membebaskannya sebagai mas kahwin beliau."
  },
  {
    "id": 10653,
    "hadith_number": 3376,
    "tajuk_hadith": "Dua Ganjaran Bagi Orang Yang Membebaskan dan Mengahwini Hamba Wanita",
    "perawi_melayu": "",
    "english_text": "Abu Musa melaporkan bahawa Rasulullah SAW bersabda tentang seseorang yang membebaskan seorang hamba wanita, kemudian mengahwininya, bahawa baginya ada dua ganjaran.",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ مُطَرِّفٍ، عَنْ عَامِرٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الَّذِي يُعْتِقُ جَارِيَتَهُ ثُمَّ يَتَزَوَّجُهَا ‏\n\"‏ لَهُ أَجْرَانِ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Musa meriwayatkan bahawa Rasulullah SAW bersabda tentang sesiapa yang membebaskan seorang hamba perempuan, kemudian mengahwininya, baginya ada dua ganjaran."
  },
  {
    "id": 10654,
    "hadith_number": 3377,
    "tajuk_hadith": "Peristiwa Penaklukan Khaibar dan Perkahwinan Rasulullah SAW dengan Sayyidah Safiyyah",
    "perawi_melayu": "Anas bin Malik radhiyallahu 'anhu meriwayatkan:",
    "english_text": "I was sitting behind Abu Talha on the Day of Khaibar and my feet touched the foot of Allah's Messenger (ﷺ), and we came (to the people of Khaibar) when the sun had risen and they had driven out their cattle, and had themselves come out with their axes, large baskets and hatchets, and they said: (Here come) Muhammad and the army. Allah's Messenger (ﷺ) said: Khaibar is ruined. Verily when we get down in the valley of a people, evil is the morning of the warned ones (al-Qur'an, xxxvii. 177). Allah, the Majestic and the Glorious, defeated them (the inhabitants of Khaibar), and there fell to the lot of Dihya a beautiful girl, and Allah's Messenger (ﷺ) got her in exchange of seven heads, and then entrusted her to Umm Sulaim so that she might embellish her and prepare her (for marriage) with him. He (the narrator) said: He had been under the impression that he had said that so that she might spend her period of 'Iddah in her (Umm Sulaim's) house. (The woman) was Safiyya daughter of Huyayy. Allah's Messenger (ﷺ) arranged the wedding feast consisting of dates, cheese, and refined butter, and pits were dug and tiers were set in them dining cloths, and there was brought cheese and refined butter, and these were placed there. And the people ate to their fill, and they said: We do not know whether he (the Holy Prophet) had married her (as a free woman), or as a slave woman. They said: If he (the Holy Prophet) would make her wear the veil, then she would be a (free married) woman, and if he would not make her wear the veil, then she should be a slave woman. When he intended to ride, he made her wear the veil and she sat on the hind part of the camel; so they came to know that he had married her. As they approached Medina, Allah's Messenger (ﷺ) drove (his ride) quickly and so we did. 'Adba' (the name of Allah's Apostle's camel) stumbled and Allah's Messenger (ﷺ) fell down and she (Radrat Safiyya: also fell down. He (the Holy Prophet) stood up and covered her. Women looked towards her and said: May Allah keep away the Jewess! He (the narrator) said: I said: Aba Hamza, did Allah's Messenger (ﷺ) really fall down? He said: Yes, by Allah, he in fact fell down.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، قَالَ كُنْتُ رِدْفَ أَبِي طَلْحَةَ يَوْمَ خَيْبَرَ وَقَدَمِي تَمَسُّ قَدَمَ رَسُولِ اللَّهِ صلى الله عليه وسلم - قَالَ - فَأَتَيْنَاهُمْ حِينَ بَزَغَتِ الشَّمْسُ وَقَدْ أَخْرَجُوا مَوَاشِيَهُمَ وَخَرَجُوا بِفُئُوسِهِمْ وَمَكَاتِلِهِمْ وَمُرُورِهِمْ فَقَالُوا مُحَمَّدٌ وَالْخَمِيسُ - قَالَ - وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ خَرِبَتْ خَيْبَرُ إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ فَسَاءَ صَبَاحُ الْمُنْذَرِينَ ‏\"‏ ‏.‏ قَالَ وَهَزَمَهُمُ اللَّهُ عَزَّ وَجَلَّ وَوَقَعَتْ فِي سَهْمِ دَحْيَةَ جَارِيَةٌ جَمِيلَةٌ فَاشْتَرَاهَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِسَبْعَةِ أَرْؤُسٍ ثُمَّ دَفَعَهَا إِلَى أُمِّ سُلَيْمٍ تُصَنِّعُهَا لَهُ وَتُهَيِّئُهَا - قَالَ وَأَحْسِبُهُ قَالَ - وَتَعْتَدُّ فِي بَيْتِهَا وَهِيَ صَفِيَّةُ بِنْتُ حُيَىٍّ - قَالَ - وَجَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَلِيمَتَهَا التَّمْرَ وَالأَقِطَ وَالسَّمْنَ فُحِصَتِ الأَرْضُ أَفَاحِيصَ وَجِيءَ بِالأَنْطَاعِ فَوُضِعَتْ فِيهَا وَجِيءَ بِالأَقِطِ وَالسَّمْنِ فَشَبِعَ النَّاسُ - قَالَ - وَقَالَ النَّاسُ لاَ نَدْرِي أَتَزَوَّجَهَا أَمِ اتَّخَذَهَا أُمَّ وَلَدٍ ‏.‏ قَالُوا إِنْ حَجَبَهَا فَهْىَ امْرَأَتُهُ وَإِنْ لَمْ يَحْجُبْهَا فَهْىَ أُمُّ وَلَدٍ فَلَمَّا أَرَادَ أَنْ يَرْكَبَ حَجَبَهَا فَقَعَدَتْ عَلَى عَجُزِ الْبَعِيرِ فَعَرَفُوا أَنَّهُ قَدْ تَزَوَّجَهَا ‏.‏ فَلَمَّا دَنَوْا مِنَ الْمَدِينَةِ دَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَدَفَعْنَا - قَالَ - فَعَثَرَتِ النَّاقَةُ الْعَضْبَاءُ وَنَدَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَنَدَرَتْ فَقَامَ فَسَتَرَهَا وَقَدْ أَشْرَفَتِ النِّسَاءُ فَقُلْنَ أَبْعَدَ اللَّهُ الْيَهُودِيَّةَ ‏.‏ قَالَ قُلْتُ يَا أَبَا حَمْزَةَ أَوَقَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ إِي وَاللَّهِ لَقَدْ وَقَعَ ‏.",
    "malay_translation": "Telah menceritakan kepada kami Abu Bakar bin Abi Syaibah, telah menceritakan kepada kami 'Affan, telah menceritakan kepada kami Hammad bin Salamah, telah menceritakan kepada kami Tsabit, dari Anas, dia berkata, \"Saya pernah duduk di belakang Abu Talhah pada hari penaklukan Khaibar. Kaki saya menyentuh kaki Rasulullah SAW. Kami sampai ke mereka ketika matahari terbit, mereka telah mengeluarkan ternakan mereka, dan keluar pula dengan kapak, bakul besar dan beliung. Mereka berkata, 'Muhammad dan tentaranya datang.' Rasulullah SAW bersabda, 'Khaibar akan musnah. Sesungguhnya apabila kami turun di lembah suatu kaum, maka pagi yang tidak menyenangkan bagi orang-orang yang diberi peringatan (al-Quran, 37:177).\" Allah SWT mengalahkan mereka, dan seorang gadis cantik jatuh ke dalam tangan Dihya. Rasulullah SAW membelinya dengan tujuh kepala, kemudian menyerahkannya kepada Umm Sulaim untuk dihiasi dan disiapkan untuk beliau. Dikatakan, \"Kelihatannya beliau bermaksud untuk (membiarkannya tinggal di sana) untuk menghabiskan tempoh 'iddah di rumahnya. Dia adalah Safiyyah binti Huyayy. Rasulullah SAW mengadakan kenduri perkahwinan dengan kurma, susu masin dan mentega cair. Tanah telah digali dan diletakkan tikar di atasnya. Disiapkan susu masin dan mentega cair dan diletakkan di situ. Orang ramai kenyang makan. Mereka berkata, \"Kami tidak tahu sama ada beliau telah mengahwininya sebagai seorang wanita bebas atau sebagai hamba.\" Mereka berkata, \"Jika beliau menutupinya (dengan tudung), maka dia adalah isteri yang merdeka, dan jika tidak menutupinya, maka dia adalah hamba.\" Apabila beliau mahu menunggang, beliau menutupinya dengan tudung dan dia duduk di belakang unta, maka mereka mengetahui bahawa beliau telah mengahwininya. Ketika mereka hampir sampai ke Madinah, Rasulullah SAW melaju unta beliau dan begitu jugalah kami. Unta 'Adba tergelincir dan Rasulullah SAW jatuh, dan dia juga jatuh. Beliau bangun dan menutupinya. Para wanita melihatnya dan berkata, 'Semoga Allah menghindarkan kaum Yahudi ini!' Beliau berkata, 'Wahai Abu Hamza, adakah Rasulullah SAW benar-benar jatuh?' Beliau menjawab, 'Ya, demi Allah, beliau jatuh.'"
  },
  {
    "id": 10655,
    "hadith_number": 3378,
    "tajuk_hadith": "Ketetapan Tentang Masuk Rumah Nabi SAW",
    "perawi_melayu": "Anas berkata:",
    "english_text": "I also saw the wedding feast of Zainab, and he (the Holy Prophet) served bread and meat to the people, and made them eat to their heart's content, and he (the Holy Prophet) sent me to call people, and as he was free (from the ceremony) he stood up and I followed him. Two persons were left and they were busy in talking and did not get out (of the apartment). He (the Holy Prophet) then proceeded towards (the apartments of) his wives. He greeted with as-Salamu 'alaikum to every one of them and said: Members of the household, how are you? They said: Messenger of Allah, we are in good state 'How do you find your family? He would say: In good state. When he was free from (this work of exchanging greetings) he came back, and I also came back along with him. And as he reached the door, (he found) that the two men were still busy in talking. And when they saw him having returned, they stood up and went out; and by Allah! I do not know whether I had informed him, or there was a revelation to him (to the affect) that they had gone. He (the Holy Prophet) then came back and I also returned along with him, and as he put his step on the threshold of his door he hung a curtain between me and him, and (it was on this occasion) that Allah revealed this verse: (\" O you who believe), do not enter the houses of the Prophet unless permission is given to 'you\" (xxxiii. 53).",
    "arabic_text": "قَالَ أَنَسٌ وَشَهِدْتُ وَلِيمَةَ زَيْنَبَ فَأَشْبَعَ النَّاسَ خُبْزًا وَلَحْمًا وَكَانَ يَبْعَثُنِي فَأَدْعُو النَّاسَ فَلَمَّا فَرَغَ قَامَ وَتَبِعْتُهُ فَتَخَلَّفَ رَجُلاَنِ اسْتَأْنَسَ بِهِمَا الْحَدِيثُ لَمْ يَخْرُجَا فَجَعَلَ يَمُرُّ عَلَى نِسَائِهِ فَيُسَلِّمُ عَلَى كُلِّ وَاحِدَةٍ مِنْهُنَّ ‏\"‏ سَلاَمٌ عَلَيْكُمْ كَيْفَ أَنْتُمْ يَا أَهْلَ الْبَيْتِ ‏\"‏ ‏.‏ فَيَقُولُونَ بِخَيْرٍ يَا رَسُولَ اللَّهِ كَيْفَ وَجَدْتَ أَهْلَكَ فَيَقُولُ ‏\"‏ بِخَيْرٍ ‏\"‏ ‏.‏ فَلَمَّا فَرَغَ رَجَعَ وَرَجَعْتُ مَعَهُ فَلَمَّا بَلَغَ الْبَابَ إِذَا هُوَ بِالرَّجُلَيْنِ قَدِ اسْتَأْنَسَ بِهِمَا الْحَدِيثُ فَلَمَّا رَأَيَاهُ قَدْ رَجَعَ قَامَا فَخَرَجَا فَوَاللَّهِ مَا أَدْرِي أَنَا أَخْبَرْتُهُ أَمْ أُنْزِلَ عَلَيْهِ الْوَحْىُ بِأَنَّهُمَا قَدْ خَرَجَا فَرَجَعَ وَرَجَعْتُ مَعَهُ فَلَمَّا وَضَعَ رِجْلَهُ فِي أُسْكُفَّةِ الْبَابِ أَرْخَى الْحِجَابَ بَيْنِي وَبَيْنَهُ وَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الآيَةَ ‏{‏ لاَ تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلاَّ أَنْ يُؤْذَنَ لَكُمْ‏}‏ الآيَةَ ‏.‏",
    "malay_translation": "Anas meriwayatkan, \"Saya menyaksikan kenduri pernikahan Zainab. Baginda Rasulullah SAW menyediakan roti dan daging untuk semua orang, dan mereka makan sampai kenyang. Baginda menghantar saya untuk memanggil orang ramai. Setelah selesai, Baginda bangun dan saya mengikutinya. Dua orang lelaki masih tinggal dan mereka asyik berbual dan tidak keluar. Baginda menuju ke tempat tinggal isteri-isterinya. Baginda mengucapkan salam kepada setiap seorang daripada mereka, \"Salam sejahtera ke atas kamu, wahai ahli keluarga, bagaimana keadaan kamu?\" Mereka menjawab, \"Kami baik-baik sahaja, wahai Rasulullah.\" Baginda bertanya pula, \"Bagaimana keadaan ahli keluarga kamu?\" Mereka menjawab, \"Baik-baik sahaja.\" Selepas itu Baginda kembali, dan saya juga kembali bersama Baginda.  Apabila Baginda sampai ke pintu, mendapati kedua-dua lelaki itu masih asyik berbual. Apabila mereka melihat Baginda sudah kembali, mereka bangun dan keluar. Demi Allah, saya tidak pasti sama ada saya sendiri memberitahu Baginda atau Baginda menerima wahyu bahawa mereka sudah keluar. Baginda kembali ke rumah dan saya mengikutinya. Apabila Baginda melangkahkan kaki ke ambang pintu, Baginda mendirikan tirai di antara saya dan dirinya. Pada masa itu, Allah menurunkan ayat berikut: (\"Wahai orang-orang yang beriman, janganlah kamu memasuki rumah-rumah Nabi melainkan dengan izin\" (xxxiii. 53)."
  },
  {
    "id": 10656,
    "hadith_number": 3379,
    "tajuk_hadith": "Kisah Peristiwa Safiyyah dan Peristiwa di Khaibar",
    "perawi_melayu": "Anas bin Malik (رضي الله عنه) meriwayatkan:",
    "english_text": "Safiyya (Allah SWT berdarjat kepadanya) jatuh kepada Dihya dalam rampasan perang, dan mereka memuji beliau di hadapan Rasulullah SAW dan berkata: Kami tidak melihat yang serupa dengannya di kalangan tawanan perang. Baginda menghantar utusan kepada Dihya dan dia memberikan apa yang diminta. Kemudian Baginda menghantarnya kepada ibu saya dan meminta beliau untuk mempercantiknya. Rasulullah SAW kemudian keluar dari Khaibar sehingga apabila berada di seberang Khaibar, Baginda berhenti, dan sebuah khemah didirikan untuk Baginda. Apabila pagi, Rasulullah SAW bersabda: Siapa yang mempunyai lebihan bekalan, hendaklah membawanya kepada kita. Beberapa orang membawa lebihan kurma, dan yang lain lebihan bubur barli sehingga menjadi timbunan yang banyak. Mereka mula memakan kurma dan meminum air daripada telaga yang mempunyai air hujan di sebelahnya. Anas berkata bahawa itu merupakan majlis perkahwinan Rasulullah SAW. Beliau (juga) berkata: Kami terus berjalan sehingga kami melihat dinding Madinah, dan kami gembira. Kami mempercepatkan kenderaan dan Rasulullah SAW juga mempercepatkan kenderaan Baginda. Dan Safiyya (Allah SWT berdarjat kepadanya) berada di belakang Baginda, dan Rasulullah SAW telah menungganginya di belakang Baginda. Unta Rasulullah SAW terhuyung dan Baginda terjatuh dan dia juga terjatuh. Dan tiada sesiapa di kalangan orang ramai yang melihatnya dan dia, sehingga Rasulullah SAW bangun dan menutupinya, dan kami mendatangi Baginda dan Baginda bersabda: Kami tidak mengalami sebarang kecederaan. Kami memasuki Madinah dan keluarlah para wanita di rumah. Mereka melihatnya (hadrat Safiyyah) dan menghukumnya atas kemalangannya.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا سُلَيْمَانُ، عَنْ ثَابِثٍ، عَنْ أَنَسٍ، ح\n وَحَدَّثَنِي بِهِ عَبْدُ اللَّهِ بْنُ هَاشِمِ بْنِ حَيَّانَ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا بَهْزٌ، حَدَّثَنَا سُلَيْمَانُ، بْنُ الْمُغِيرَةِ عَنْ ثَابِتٍ، حَدَّثَنَا أَنَسٌ، قَالَ صَارَتْ صَفِيَّةُ لِدَحْيَةَ فِي مَقْسَمِهِ وَجَعَلُوا يَمْدَحُونَهَا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم - قَالَ - وَيَقُولُونَ مَا رَأَيْنَا فِي السَّبْىِ مِثْلَهَا - قَالَ - فَبَعَثَ إِلَى دِحْيَةَ فَأَعْطَاهُ بِهَا مَا أَرَادَ ثُمَّ دَفَعَهَا إِلَى أُمِّي فَقَالَ ‏\"‏ أَصْلِحِيهَا ‏\"‏ ‏.‏ قَالَ ثُمَّ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ خَيْبَرَ حَتَّى إِذَا جَعَلَهَا فِي ظَهْرِهِ نَزَلَ ثُمَّ ضَرَبَ عَلَيْهَا الْقُبَّةَ فَلَمَّا أَصْبَحَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ كَانَ عِنْدَهُ فَضْلُ زَادٍ فَلْيَأْتِنَا بِهِ ‏\"‏ ‏.‏ قَالَ فَجَعَلَ الرَّجُلُ يَجِيءُ بِفَضْلِ التَّمْرِ وَفَضْلِ السَّوِيقِ حَتَّى جَعَلُوا مِنْ ذَلِكَ سَوَادًا حَيْسًا فَجَعَلُوا يَأْكُلُونَ مِنْ ذَلِكَ الْحَيْسِ وَيَشْرَبُونَ مِنْ حِيَاضٍ إِلَى جَنْبِهِمْ مِنْ مَاءِ السَّمَاءِ - قَالَ - فَقَالَ أَنَسٌ فَكَانَتْ تِلْكَ وَلِيمَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَيْهَا - قَالَ - فَانْطَلَقْنَا حَتَّى إِذَا رَأَيْنَا جُدُرَ الْمَدِينَةِ هَشِشْنَا إِلَيْهَا فَرَفَعْنَا مَطِيَّنَا وَرَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَطِيَّتَهُ - قَالَ - وَصَفِيَّةُ خَلْفَهُ قَدْ أَرْدَفَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم - قَالَ - فَعَثَرَتْ مَطِيَّةُ رَسُولِ اللَّهِ صلى الله عليه وسلم فَصُرِعَ وَصُرِعَتْ قَالَ فَلَيْسَ أَحَدٌ مِنَ النَّاسِ يَنْظُرُ إِلَيْهِ وَلاَ إِلَيْهَا حَتَّى قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَتَرَهَا - قَالَ - فَأَتَيْنَاهُ فَقَالَ ‏\"‏ لَمْ نُضَرَّ ‏\"‏ ‏.‏ قَالَ فَدَخَلْنَا الْمَدِينَةَ فَخَرَجَ جَوَارِي نِسَائِهِ يَتَرَاءَيْنَهَا وَيَشْمَتْنَ بِصَرْعَتِهَا ‏.‏",
    "malay_translation": "Anas bin Malik r.a. meriwayatkan bahawa Safiyyah telah diberikan kepada Dihya dalam pembahagian rampasan perang.  Mereka memujinya di hadapan Rasulullah SAW dengan berkata, \"Kami tidak pernah melihat yang serupa dengannya dalam kalangan tawanan perang.\" Rasulullah SAW menghantar utusan kepada Dihya, dan Dihya memberikannya apa yang diminta. Kemudian, Rasulullah SAW menghantarnya kepada ibu saya dan meminta beliau untuk mencantikkannya. Rasulullah SAW keluar dari Khaibar sehingga sampai di seberang Khaibar, lalu berhenti dan sebuah khemah didirikan untuk Baginda. Pagi harinya, Rasulullah SAW bersabda, \"Siapa yang mempunyai lebihan makanan, bawalah kepadanya.\" Orang ramai membawa lebihan kurma dan bubur barli sehingga menjadi timbunan yang banyak. Mereka mula memakan kurma dan minuman dari telaga air hujan di sebelah. Anas meriwayatkan lagi bahawa ini merupakan majlis jamuan perkahwinan Rasulullah SAW.  Kami berjalan sehingga kami sampai ke dinding Madinah dan kami gembira. Kami mempercepatkan tunggangan kami dan Rasulullah SAW juga mempercepatkan tunggangan Baginda. Safiyyah berada di belakang Baginda. Unta Rasulullah SAW tergelincir dan Baginda serta Safiyyah jatuh. Tiada seorang pun melihat mereka sehingga Rasulullah SAW bangun dan menutupinya. Kami mendekati Baginda dan Baginda bersabda, \"Kami tidak terluka.\" Kemudian, kami memasuki Madinah dan keluarlah wanita-wanita rumah tangga. Mereka melihat Safiyyah dan bergurau tentang kejatuhannya."
  },
  {
    "id": 10657,
    "hadith_number": 3380,
    "tajuk_hadith": "Ketetapan Perkahwinan Zainab dan Hukum Menziarahi Rumah Nabi SAW",
    "perawi_melayu": "Anas bin Malik r.a. meriwayatkan:",
    "english_text": "When the 'Iddah of Zainab was over, Allah's Messenger (ﷺ) said to Zaid to make a mention to her about him. Zaid went on until he came to her and she was fermenting her flour. He (Zaid) said: As I saw her I felt in my heart an idea of her greatness so much so that I could not see towards her (simply for the fact) that Allah's Messenger (ﷺ) had made a mention of her. So I turned my back towards her. and I turned upon my heels, and said: Zainab, Allah's Messenger (ﷺ) has sent (me) with a message to you. She said: I do not do anything until I solicit the will of my Lord. So she stood at her place of worship and the (verse of) the Qur'an (pertaining to her marriage) were revealed, and Allah's Messenger (ﷺ) came to her without permission. He (the narrator) said: I saw that Allah's Messenger (ﷺ) served us bread and meat until it was broad day light and the people went away, but some persons who were busy in con- versation stayed on in the house after the meal. Allah's Messenger (ﷺ) also went out and I also followed him, and he began to visit the apartments of his wives greeting them (with the words): As-Salamu 'alaikum, and they would say: Allah's Messenger, how did you find your family (hadrat Zainab)? He (the narrator) stated: I do not know whether I had informed him that the people had gone out or he (the Holy Prophet) informed me (about that). He moved on until he entered the apartment, and I also went and wanted to enter (the apartment) along with him, but he threw a curtain between me and him, as (the verfes pertaining to seclusion) had been revealed, and people were instructed in what they had been instructed. Ibn Rafii had made this addition in his narration:\" O you who believe, enter not the houses of the Prophet unless permission is given to you for a meal, not waiting for its cooking being finished...\" to the words\"... Allah forbears not from the truth.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ، حَدَّثَنَا بَهْزٌ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا أَبُو النَّضْرِ، هَاشِمُ بْنُ الْقَاسِمِ قَالاَ جَمِيعًا حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، وَهَذَا حَدِيثُ بَهْزٍ قَالَ لَمَّا انْقَضَتْ عِدَّةُ زَيْنَبَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِزَيْدٍ ‏\"‏ فَاذْكُرْهَا عَلَىَّ ‏\"‏ ‏.‏ قَالَ فَانْطَلَقَ زَيْدٌ حَتَّى أَتَاهَا وَهْىَ تُخَمِّرُ عَجِينَهَا قَالَ فَلَمَّا رَأَيْتُهَا عَظُمَتْ فِي صَدْرِي حَتَّى مَا أَسْتَطِيعُ أَنْ أَنْظُرَ إِلَيْهَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ذَكَرَهَا فَوَلَّيْتُهَا ظَهْرِي وَنَكَصْتُ عَلَى عَقِبِي فَقُلْتُ يَا زَيْنَبُ أَرْسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَذْكُرُكِ ‏.‏ قَالَتْ مَا أَنَا بِصَانِعَةٍ شَيْئًا حَتَّى أُوَامِرَ رَبِّي ‏.‏ فَقَامَتْ إِلَى مَسْجِدِهَا وَنَزَلَ الْقُرْآنُ وَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَدَخَلَ عَلَيْهَا بِغَيْرِ إِذْنٍ قَالَ فَقَالَ وَلَقَدْ رَأَيْتُنَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَطْعَمَنَا الْخُبْزَ وَاللَّحْمَ حِينَ امْتَدَّ النَّهَارُ فَخَرَجَ النَّاسُ وَبَقِيَ رِجَالٌ يَتَحَدَّثُونَ فِي الْبَيْتِ بَعْدَ الطَّعَامِ فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَاتَّبَعْتُهُ فَجَعَلَ يَتَتَبَّعُ حُجَرَ نِسَائِهِ يُسَلِّمُ عَلَيْهِنَّ وَيَقُلْنَ يَا رَسُولَ اللَّهِ كَيْفَ وَجَدْتَ أَهْلَكَ قَالَ فَمَا أَدْرِي أَنَا أَخْبَرْتُهُ أَنَّ الْقَوْمَ خَرَجُوا أَوْ أَخْبَرَنِي - قَالَ - فَانْطَلَقَ حَتَّى دَخَلَ الْبَيْتَ فَذَهَبْتُ أَدْخُلُ مَعَهُ فَأَلْقَى السِّتْرَ بَيْنِي وَبَيْنَهُ وَنَزَلَ الْحِجَابُ قَالَ وَوُعِظَ الْقَوْمُ بِمَا وُعِظُوا بِهِ ‏.‏ زَادَ ابْنُ رَافِعٍ فِي حَدِيثِهِ ‏{‏ لاَ تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلاَّ أَنْ يُؤْذَنَ لَكُمْ إِلَى طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ‏}‏ إِلَى قَوْلِهِ ‏{‏ وَاللَّهُ لاَ يَسْتَحْيِي مِنَ الْحَقِّ‏}‏",
    "malay_translation": "Setelah tempoh 'iddah Zainab tamat, Rasulullah SAW berpesan kepada Zaid untuk menyampaikan sesuatu kepadanya. Zaid pergi menemui Zainab ketika beliau sedang menguli adunan. Zaid berkata, \"Seketika melihat Zainab, hatiku terasa kagum akan keperibadiannya, sehinggakan aku tidak berani memandangnya kerana Rasulullah SAW telah menyebut namanya. Lalu, aku berpaling dan berkata, \"Wahai Zainab, Rasulullah SAW telah menghantar aku untuk menyampaikan sesuatu kepadamu.\" Zainab menjawab, \"Aku tidak akan bertindak sebarang perkara sehingga aku mendapat izin daripada Tuhanku.\" Lalu, Zainab berdoa di tempat ibadahnya, dan pada ketika itu, ayat al-Quran mengenai perkahwinannya turun. Kemudian, Rasulullah SAW datang menemui Zainab tanpa izin.  Aku melihat Rasulullah SAW menjamu kami dengan roti dan daging sehingga waktu siang hari. Orang ramai telah pulang, tetapi ada beberapa orang yang masih berbual-bual di dalam rumah. Kemudian, Rasulullah SAW keluar dan aku mengikutnya. Baginda melawat bilik-bilik isterinya dan memberi salam, lalu mereka menjawab, \"Salam sejahtera atasmu wahai Rasulullah. Bagaimana keadaan keluarga Baginda (Zainab)?\" Aku tidak pasti sama ada aku memberitahu Baginda bahawa orang ramai telah keluar, atau Baginda sendiri yang memberitahuku. Rasulullah SAW masuk ke dalam rumah, dan aku juga mahu masuk, tetapi Baginda telah memisahkan kami dengan tirai. Ini kerana ayat mengenai hijab telah turun, dan orang ramai diarahkan mengikut petunjuk.  Ibn Rafi menambahkan dalam riwayatnya, \"Wahai orang-orang yang beriman, jangan memasuki rumah Nabi melainkan dengan izin untuk makan, janganlah menunggu sehingga makanan sudah siap ...\" hingga akhir ayat,\"... Allah tidak malu dari kebenaran.\" "
  },
  {
    "id": 10658,
    "hadith_number": 3381,
    "tajuk_hadith": "Perkahwinan Nabi SAW dan Tidak Menyediakan Jamuan Perkahwinan Seperti Perkahwinan Zainab",
    "perawi_melayu": "Anas bin Malik r.a. meriwayatkan:",
    "english_text": "I did not see Allah's Messenger (ﷺ) giving a wedding feast (on the marriage) of any one (of his wives) as he did in the case of (his marriage with) Zainab, for then he sacrificed a goat (on this occasion).",
    "arabic_text": "حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، وَأَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالُوا حَدَّثَنَا حَمَّادٌ، - وَهُوَ ابْنُ زَيْدٍ - عَنْ ثَابِتٍ، عَنْ أَنَسٍ، - وَفِي رِوَايَةِ أَبِي كَامِلٍ سَمِعْتُ أَنَسًا، - قَالَ مَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَوْلَمَ عَلَى امْرَأَةٍ - وَقَالَ أَبُو كَامِلٍ عَلَى شَىْءٍ - مِنْ نِسَائِهِ مَا أَوْلَمَ عَلَى زَيْنَبَ فَإِنَّهُ ذَبَحَ شَاةً ‏.‏",
    "malay_translation": "Aku tidak melihat Rasulullah SAW mengadakan kenduri perkahwinan untuk mana-mana isterinya seperti yang dilakukan bagi Zainab.  Ketika itu baginda menyembelih seekor kambing."
  },
  {
    "id": 10659,
    "hadith_number": 3382,
    "tajuk_hadith": "Perjamuan Perkahwinan Nabi SAW yang Terindah",
    "perawi_melayu": "Anas bin Malik r.a. meriwayatkan:",
    "english_text": "Allah's Messenger (ﷺ) gave no better wedding feast than the one he did (on the occasion of his marriage with) Zainab. Thabit al-Bunani (one of the narrators) said: What did he serve in the wedding feast? He (Anas) said: He fed them bread and meat (so lavishly) that they (the guests) abandoned it (of their own accord after having taken them to their hearts' content).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ عَبَّادِ بْنِ جَبَلَةَ بْنِ أَبِي رَوَّادٍ، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدٌ، - وَهُوَ ابْنُ جَعْفَرٍ - حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ مَا أَوْلَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى امْرَأَةٍ مِنْ نِسَائِهِ أَكْثَرَ أَوْ أَفْضَلَ مِمَّا أَوْلَمَ عَلَى زَيْنَبَ ‏.‏ فَقَالَ ثَابِتٌ الْبُنَانِيُّ بِمَا أَوْلَمَ قَالَ أَطْعَمَهُمْ خُبْزًا وَلَحْمًا حَتَّى تَرَكُوهُ ‏.‏",
    "malay_translation": "Pesuruhjaya Allah (ﷺ) tidak memberikan perjamuan perkahwinan yang lebih baik daripada perjamuan yang diadakan ketika perkahwinannya dengan Zainab. Thabit al-Bunani (salah seorang perawi) bertanya, \"Apakah hidangan yang disediakan dalam perjamuan tersebut?\" Anas menjawab, \"Beliau memberi mereka roti dan daging dengan secukupnya sehingga para tetamu berhenti makan sendiri selepas kenyang.\""
  },
  {
    "id": 10660,
    "hadith_number": 3383,
    "tajuk_hadith": "Larangan Masuk Rumah Nabi SAW Tanpa Keizinanan dan Hadis Mengenai Jamuan Makan",
    "perawi_melayu": "Anas bin Malik (رضي الله عنه) meriwayatkan:",
    "english_text": "When Allah's Apostle (ﷺ) married Zainab bint jahsh, he invited people (to the wedding feast) and they ate food. They then sat there and entered into conversation. He (the Holy Prophet) made a stir as if he was preparing to stand up, but (the persons busy in talking) did not stand up. When he (the Holy Prophet) saw it, he stood up and when he did so, some other persons stood up. 'Asim and Abd al-A'la in their narrations made this addition: Three (persons) sat there, and Allah's Apostle (ﷺ) came there to enter (the apartment) but he found the people sitting there. Then they stood up and went away. He said: Then I came and informed Allah's Apostle (ﷺ) that they had gone away. He (the Holy Prophet) then came there until he entered (the apartment). I also went and was about to enter, when he hung a curtain between me and him (and it was on this occasion that) Allah, the Exalted and Majestic, revealed this verse:\" O you who believe, enter not the houses of the Prophet unless permission is given to you for a meal, not waiting for its cooking being finished to the (words)\" Surely this is serious in the sight of Allah\" (xxxiii. 53).",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، وَعَاصِمُ بْنُ النَّضْرِ التَّيْمِيُّ، وَمُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، كُلُّهُمْ عَنْ مُعْتَمِرٍ، - وَاللَّفْظُ لاِبْنِ حَبِيبٍ - حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ سَمِعْتُ أَبِي، حَدَّثَنَا أَبُو مِجْلَزٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ لَمَّا تَزَوَّجَ النَّبِيُّ صلى الله عليه وسلم زَيْنَبَ بِنْتَ جَحْشٍ دَعَا الْقَوْمَ فَطَعِمُوا ثُمَّ جَلَسُوا يَتَحَدَّثُونَ - قَالَ - فَأَخَذَ كَأَنَّهُ يَتَهَيَّأُ لِلْقِيَامِ فَلَمْ يَقُومُوا فَلَمَّا رَأَى ذَلِكَ قَامَ فَلَمَّا قَامَ قَامَ مَنْ قَامَ مِنَ الْقَوْمِ ‏.‏ زَادَ عَاصِمٌ وَابْنُ عَبْدِ الأَعْلَى فِي حَدِيثِهِمَا قَالَ فَقَعَدَ ثَلاَثَةٌ وَإِنَّ النَّبِيَّ صلى الله عليه وسلم جَاءَ لِيَدْخُلَ فَإِذَا الْقَوْمُ جُلُوسٌ ثُمَّ إِنَّهُمْ قَامُوا فَانْطَلَقُوا - قَالَ - فَجِئْتُ فَأَخْبَرْتُ النَّبِيَّ صلى الله عليه وسلم أَنَّهُمْ قَدِ انْطَلَقُوا - قَالَ - فَجَاءَ حَتَّى دَخَلَ فَذَهَبْتُ أَدْخُلُ فَأَلْقَى الْحِجَابَ بَيْنِي وَبَيْنَهُ - قَالَ - وَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلاَّ أَنْ يُؤْذَنَ لَكُمْ إِلَى طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ‏}‏ إِلَى قَوْلِهِ ‏{‏ إِنَّ ذَلِكُمْ كَانَ عِنْدَ اللَّهِ عَظِيمًا‏}‏ ‏.‏",
    "malay_translation": "Apabila Rasulullah SAW mengahwini Zainab binti Jahsy, baginda menjemput orang ramai untuk jamuan makan. Setelah makan, mereka duduk dan berbual. Baginda seolah-olah hendak berdiri, tetapi mereka tidak bangun. Apabila Baginda melihat keadaan itu, Baginda pun bangun dan beberapa orang lain turut bangun.  'Asim dan Abd al-A'la menambah dalam riwayat mereka: Tiga orang duduk, dan Rasulullah SAW datang untuk masuk, tetapi mendapati orang ramai masih duduk. Kemudian mereka bangun dan pergi.  Katanya: Lalu aku datang dan memberitahu Rasulullah SAW bahawa mereka telah pergi. Baginda kemudian datang hingga masuk ke dalam. Aku juga hendak masuk, lalu baginda mendirikan tirai antara aku dan Baginda. Dan pada ketika itu, Allah SWT menurunkan ayat ini: \"Wahai orang-orang yang beriman, janganlah kamu memasuki rumah-rumah Nabi melainkan jika diizinkan untuk makan dan janganlah menunggu sampai makanan masak. Sesungguhnya yang demikian itu adalah sangat besar dosanya di sisi Allah\" (Surah Al-Ahzab ayat 53)."
  },
  {
    "id": 10661,
    "hadith_number": 3384,
    "tajuk_hadith": "Penjelasan Tentang Hijab dan Peristiwa Perkahwinan Rasulullah SAW",
    "perawi_melayu": "Anas bin Malik r.a. meriwayatkan:",
    "english_text": "I was the best informed among the people pertaining to Hijab (veil and seclusion). Ubayy b. Ka'b used to ask me about it. Anas (Allah be pleased with him) thus narrated: The Messenger of Allah (ﷺ) got up in the morning as a bridegroom of Zainab bint jahsh (Allah be pleased witt her) as he had married her at Medina. He invited people to the wedding feast after the day had well risen. There sat Allah's Messenger (ﷺ) and there kept sitting along with him some persons after the people had stood up (for departure) ; then Allah's Messenger (ﷺ) stood up and walked on and I also walked along with him until he reached the door of the apartment of 'A'isha (Allah be pleased with her). He then thought that they (those who had been sitting there after meal) had gone away. So he returned and I also returned with him, but they were still sitting at their places. So he returned for the second time and I also returned until he reached the apartment of 'A'isha. He again returned and I also returned and they had (by that time) stood up, and he hung a curtain between me and him (at the door of the apartment of Hadrat Zainab, where he had to stay), and Allah revealed the verse pertaining to veil.",
    "arabic_text": "وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، قَالَ ابْنُ شِهَابٍ إِنَّ أَنَسَ بْنَ مَالِكٍ قَالَ أَنَا أَعْلَمُ النَّاسِ، بِالْحِجَابِ لَقَدْ كَانَ أُبَىُّ بْنُ كَعْبٍ يَسْأَلُنِي عَنْهُ ‏.‏ قَالَ أَنَسٌ أَصْبَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَرُوسًا بِزَيْنَبَ بِنْتِ جَحْشٍ - قَالَ - وَكَانَ تَزَوَّجَهَا بِالْمَدِينَةِ فَدَعَا النَّاسَ لِلطَّعَامِ بَعْدَ ارْتِفَاعِ النَّهَارِ فَجَلَسَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَجَلَسَ مَعَهُ رِجَالٌ بَعْدَ مَا قَامَ الْقَوْمُ حَتَّى قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَمَشَى فَمَشَيْتُ مَعَهُ حَتَّى بَلَغَ بَابَ حُجْرَةِ عَائِشَةَ ثُمَّ ظَنَّ أَنَّهُمْ قَدْ خَرَجُوا فَرَجَعَ وَرَجَعْتُ مَعَهُ فَإِذَا هُمْ جُلُوسٌ مَكَانَهُمْ فَرَجَعَ فَرَجَعْتُ الثَّانِيَةَ حَتَّى بَلَغَ حُجْرَةَ عَائِشَةَ فَرَجَعَ فَرَجَعْتُ فَإِذَا هُمْ قَدْ قَامُوا فَضَرَبَ بَيْنِي وَبَيْنَهُ بِالسِّتْرِ وَأَنْزَلَ اللَّهُ آيَةَ الْحِجَابِ.‏",
    "malay_translation": "Anas bin Malik r.a. berkata, \"Aku adalah orang yang paling mengetahui tentang hijab (tudung dan pengasingan). Ubayy bin Ka'b sering bertanya kepadaku tentangnya. Anas r.a. menceritakan: Rasulullah SAW bangun pagi sebagai pengantin Zainab binti Jahsy -beliau telah mengahwininya di Madinah- lalu mengundang orang ramai ke jamuan perkahwinan selepas matahari naik tinggi. Rasulullah SAW duduk dan beberapa orang duduk bersamanya setelah orang ramai berdiri untuk pulang. Kemudian Rasulullah SAW bangun dan berjalan, aku turut berjalan bersamanya sehingga sampai ke pintu bilik Aisyah r.a. Kemudian beliau menyangka mereka (yang masih duduk) telah pergi. Lalu beliau berpatah balik, dan aku turut berpatah balik. Namun, ternyata mereka masih duduk di tempat duduk mereka. Lalu Rasulullah SAW berpatah balik buat kali kedua, dan aku turut bersamanya. Sampai di bilik Aisyah r.a. Kali ketiga beliau berpatah balik dan aku turut bersamanya. Ternyata, mereka telah berdiri. Lalu baginda mendirikan tabir di antara kami (di pintu bilik Zainab r.a. ketika baginda perlu berada di situ) dan Allah menurunkan ayat tentang hijab."
  },
  {
    "id": 10662,
    "hadith_number": 3385,
    "tajuk_hadith": "Perkahwinan Rasulullah SAW dan Jamuan Makanan serta Penjelasan mengenai Perintah Menjauhi Rumah Rasulullah SAW",
    "perawi_melayu": "Anas bin Malik r.a. meriwayatkan:",
    "english_text": "Allah's Messenger (ﷺ) contracted marriage and he went to his wife. My mother Umm Sulaim prepared hais and placed it in an earthen vessel and said: Anas, take it to Allah's Messenger (ﷺ) and say: My mother has sent that to you and she offers greetings to you, and says that it is a humble gift for you on our behalf, Messenger of Allah. So I went along with it to Allah's Messenger (ﷺ) and said: My mother offers you salutations, and says that it is a humble gift for you on our behalf. He said: Place it here, and then said: Go and invite on my behalf so and so and anyone whom you meet, and he even named some persons. He (Anas) said: I invited whom he had named and whom I met. I (one of the narrators) said: I said to Anas: How many (persons) were there? He (Anas) said: They were about three hundred persons. Then Allah's Messenger (ﷺ) (said to me): Anas, bring that earthen vessel. They (the guests) then began to enter until the courtyard and the apartment were fully packed. Allah's Messenger (ﷺ) said: Make a circle of ten (guests), and every person should eat from that nearest to him. They began to eat, until they ate to their fill. A group went out (after eating the food), and another group came in until all of them had eaten. He (the Holy Prophet) said to me: Anas, lift it (the earthen vessel), so I lifted it, but I could not assess whether it had more (food) when I placed it (before Allah's Messenger) or when I lifted it (after the people had been served out of it). A group among them (the guests) began to talk in the house of Allah's Messenger (ﷺ) and the Messenger of Allah (ﷺ) was sitting and his wife had been sitting with her face turned towards the wall. It was troublesome for Allah's Messenger (ﷺ), so Allah's Messenger (ﷺ) went out and greeted his wives. He then returned. When they (the guests) saw that Allah's Messenger (ﷺ) had returned they thought that it (their overstay) was something troublesome for him. He (the narrator) said: They hastened towards the door and all of them went out. And there came Allah's Messenger (ﷺ) and he hung a curtain and went in, and I was sitting in his apartment and he did not stay but for a short while. He then came to me and these verses were revealed. Allah's Messenger (ﷺ) came out and recited them to the people:\" O you who believe, enter not the houses of the Prophet unless permission is given to you for a meal, not waiting for its cooking being finished-but when you are invited, enter, and when you have taken food, disperse not seeking to listen to talk. Surely this gives the Prophet trouble\", to the end of verse (xxxiii. 53). (Al-Ja'd said that Anas  stated: I am the first amongst the people to hear these verses), and henceforth the wives of the Apostle (ﷺ) began to observe seclusion (al-hijab).",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَعْفَرٌ، - يَعْنِي ابْنَ سُلَيْمَانَ - عَنِ الْجَعْدِ أَبِي عُثْمَانَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ تَزَوَّجَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَدَخَلَ بِأَهْلِهِ - قَالَ - فَصَنَعَتْ أُمِّي أُمُّ سُلَيْمٍ حَيْسًا فَجَعَلَتْهُ فِي تَوْرٍ فَقَالَتْ يَا أَنَسُ اذْهَبْ بِهَذَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقُلْ بَعَثَتْ بِهَذَا إِلَيْكَ أُمِّي وَهْىَ تُقْرِئُكَ السَّلاَمَ وَتَقُولُ إِنَّ هَذَا لَكَ مِنَّا قَلِيلٌ يَا رَسُولَ اللَّهِ - قَالَ - فَذَهَبْتُ بِهَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقُلْتُ إِنَّ أُمِّي تُقْرِئُكَ السَّلاَمَ وَتَقُولُ إِنَّ هَذَا لَكَ مِنَّا قَلِيلٌ يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ ‏\"‏ ضَعْهُ - ثُمَّ قَالَ - اذْهَبْ فَادْعُ لِي فُلاَنًا وَفُلاَنًا وَفُلاَنًا وَمَنْ لَقِيتَ ‏\"‏ ‏.‏ وَسَمَّى رِجَالاً - قَالَ - فَدَعَوْتُ مَنْ سَمَّى وَمَنْ لَقِيتُ ‏.‏ قَالَ قُلْتُ لأَنَسٍ عَدَدَ كَمْ كَانُوا قَالَ زُهَاءَ ثَلاَثِمِائَةٍ ‏.‏ وَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا أَنَسُ هَاتِ التَّوْرَ ‏\"‏ ‏.‏ قَالَ فَدَخَلُوا حَتَّى امْتَلأَتِ الصُّفَّةُ وَالْحُجْرَةُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لِيَتَحَلَّقْ عَشَرَةٌ عَشَرَةٌ وَلْيَأْكُلْ كُلُّ إِنْسَانٍ مِمَّا يَلِيهِ ‏\"‏ ‏.‏ قَالَ فَأَكَلُوا حَتَّى شَبِعُوا - قَالَ - فَخَرَجَتْ طَائِفَةٌ وَدَخَلَتْ طَائِفَةٌ حَتَّى أَكَلُوا كُلُّهُمْ ‏.‏ فَقَالَ لِي ‏\"‏ يَا أَنَسُ ارْفَعْ ‏\"‏ ‏.‏ قَالَ فَرَفَعْتُ فَمَا أَدْرِي حِينَ وَضَعْتُ كَانَ أَكْثَرَ أَمْ حِينَ رَفَعْتُ - قَالَ - وَجَلَسَ طَوَائِفُ مِنْهُمْ يَتَحَدَّثُونَ فِي بَيْتِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَرَسُولُ اللَّهِ صلى الله عليه وسلم جَالِسٌ وَزَوْجَتُهُ مُوَلِّيَةٌ وَجْهَهَا إِلَى الْحَائِطِ فَثَقُلُوا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَلَّمَ عَلَى نِسَائِهِ ثُمَّ رَجَعَ فَلَمَّا رَأَوْا رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ رَجَعَ ظَنُّوا أَنَّهُمْ قَدْ ثَقُلُوا عَلَيْهِ - قَالَ - فَابْتَدَرُوا الْبَابَ فَخَرَجُوا كُلُّهُمْ وَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم َتَّى أَرْخَى السِّتْرَ وَدَخَلَ وَأَنَا جَالِسٌ فِي الْحُجْرَةِ فَلَمْ يَلْبَثْ إِلاَّ يَسِيرًا حَتَّى خَرَجَ عَلَىَّ ‏.‏ وَأُنْزِلَتْ هَذِهِ الآيَةُ فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَرَأَهُنَّ عَلَى النَّاسِ ‏{‏ يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلاَّ أَنْ يُؤْذَنَ لَكُمْ إِلَى طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ وَلَكِنْ إِذَا دُعِيتُمْ فَادْخُلُوا فَإِذَا طَعِمْتُمْ فَانْتَشِرُوا وَلاَ مُسْتَأْنِسِينَ لِحَدِيثٍ إِنَّ ذَلِكُمْ كَانَ يُؤْذِي النَّبِيَّ‏}‏ إِلَى آخِرِ الآيَةِ ‏.‏ قَالَ الْجَعْدُ قَالَ أَنَسُ بْنُ مَالِكٍ أَنَا أَحْدَثُ النَّاسِ عَهْدًا بِهَذِهِ الآيَاتِ وَحُجِبْنَ نِسَاءُ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Rasulullah SAW telah berkahwin dan menemui isterinya.  Ibu saya, Umm Sulaim, telah menyediakan hidangan dan meletakkannya di dalam sebuah bekas tanah liat. Beliau berkata: \"Wahai Anas, bawalah ini kepada Rasulullah SAW dan katakan, 'Ibuku telah mengutuskan ini kepadamu dan mengucapkan salam kepadamu, dan ia sebagai hadiah kecil untukmu dari kami, wahai Rasulullah.'  Maka aku membawanya kepada Rasulullah SAW dan berkata: 'Ibuku menghantar salam kepadamu dan ia sebagai hadiah kecil dari kami kepadamu, wahai Rasulullah.'  Baginda SAW menjawab: 'Letakkanlah di sini,' dan kemudian Baginda bersabda: 'Pergi dan jemputlah fulan dan fulan, dan sesiapa yang engkau temui.' Baginda telah menyebut beberapa nama.  Aku (Anas) berkata: 'Aku telah menjemput orang-orang yang Baginda namakan dan sesiapa yang aku temui.'  Aku (pendengar) bertanya kepada Anas: 'Berapakah jumlahnya?'  Anas menjawab: 'Kira-kira tiga ratus orang.' Lalu Rasulullah SAW bersabda: 'Anas, bawakan bekas tanah liat itu.'  Mereka (tetamu) masuk sehingga halaman dan bilik penuh sesak.  Rasulullah SAW berkata: 'Suruhlah sepuluh orang berkumpul dan setiap orang makan dari hidangan yang berhampiran.'  Mereka makan sehingga kenyang. Sebahagian keluar dan sebahagian masuk sehingga semuanya makan. Kemudian Baginda bersabda: 'Anas, angkat bekas itu.' Aku mengangkatnya, tetapi aku tidak pasti adakah isinya lebih banyak ketika aku meletakkannya di hadapan Baginda atau ketika aku mengangkatnya (selepas selesai dihidangkan). Sebahagian daripada mereka berbual-bual di rumah Rasulullah SAW, sementara Baginda dan isterinya duduk. Ini menyusahkan Baginda, lalu Baginda keluar dan memberi salam kepada isteri-isterinya, kemudian kembali.  Ketika mereka melihat Baginda kembali, mereka menyedari bahawa kehadiran mereka telah menyusahkan Baginda.  Mereka segera keluar.  Rasulullah SAW menutup tirai dan masuk ke dalam rumah, sementara aku duduk di dalam bilik.  Baginda tidak lama di sana. Kemudian Baginda datang kepadaku dan ayat-ayat berikut diturunkan. Rasulullah SAW keluar dan membacakannya kepada orang ramai: \"Wahai orang-orang yang beriman, janganlah memasuki rumah Nabi melainkan dengan izin untuk makan. Jangan tunggu masakan siap, tetapi masuklah apabila dijemput. Selepas makan, bercerailah dan janganlah bertanya tentang perbualan. Sesungguhnya ini menyusahkan Nabi.\"  hingga akhir ayat (al-Ahzab, 53). (Al-Ja'd berkata bahawa Anas berkata: 'Akulah yang pertama mendengar ayat ini.') Dan sejak itu, isteri-isteri Rasulullah SAW mula mengamalkan hijab."
  },
  {
    "id": 10663,
    "hadith_number": 3386,
    "tajuk_hadith": "Larangan Masuk Rumah Nabi SAW Tanpa Izin Ketika Makan",
    "perawi_melayu": "Anas bin Malik r.a. meriwayatkan:",
    "english_text": "When Allah's Apostle (ﷺ) contracted marriage with Zainab (Allah be pleased with bet), Umm Sulaim sent him hats in a vessel of stone as a gift. Anas stated that Allah's Messenger (ﷺ) said to him: Go and invite on my behalf all the Muslims whom you meet. So I invited on his behalf everyone whom I met. They entered (his house) and they ate and went out. And Allah's Messenger (ﷺ) had kept his hand on the food, and he invoked blessing on that, and said whatever Allah wished him to say, and none whom I met was left uninvited. They ate to their fill and went out, but a group among them remained there and was engaged in lengthy discussion. Allah's Apostle (ﷺ) felt shy of saying them anything. So he went out and left them in his house and Allah the Great and Majestic revealed this verse:\" 0 you who believe, enter not the houses of the Prophet unless permission is given to you for a meal, not waiting for its cooking being finished.\" Qatada (instead of using the word Ghaira Nazirina) used the word Ghaira Mutahayyinina (i. e. not waiting for the time of the food). But when you are invited, enter...\" up to this verse. This is purer for your hearts and their hearts.",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ أَبِي عُثْمَانَ، عَنْ أَنَسٍ، قَالَ لَمَّا تَزَوَّجَ النَّبِيُّ صلى الله عليه وسلم زَيْنَبَ أَهْدَتْ لَهُ أُمُّ سُلَيْمٍ حَيْسًا فِي تَوْرٍ مِنْ حِجَارَةٍ فَقَالَ أَنَسٌ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اذْهَبْ فَادْعُ لِي مَنْ لَقِيتَ مِنَ الْمُسْلِمِينَ ‏\"‏ ‏.‏ فَدَعَوْتُ لَهُ مَنْ لَقِيتُ فَجَعَلُوا يَدْخُلُونَ عَلَيْهِ فَيَأْكُلُونَ وَيَخْرُجُونَ وَوَضَعَ النَّبِيُّ صلى الله عليه وسلم يَدَهُ عَلَى الطَّعَامِ فَدَعَا فِيهِ وَقَالَ فِيهِ مَا شَاءَ اللَّهُ أَنْ يَقُولَ وَلَمْ أَدَعْ أَحَدًا لَقِيتُهُ إِلاَّ دَعَوْتُهُ فَأَكَلُوا حَتَّى شَبِعُوا وَخَرَجُوا وَبَقِيَ طَائِفَةٌ مِنْهُمْ فَأَطَالُوا عَلَيْهِ الْحَدِيثَ فَجَعَلَ النَّبِيُّ صلى الله عليه وسلم يَسْتَحْيِي مِنْهُمْ أَنْ يَقُولَ لَهُمْ شَيْئًا فَخَرَجَ وَتَرَكَهُمْ فِي الْبَيْتِ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلاَّ أَنْ يُؤْذَنَ لَكُمْ إِلَى طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ‏}‏ قَالَ قَتَادَةُ غَيْرَ مُتَحَيِّنِينَ طَعَامًا وَلَكِنْ إِذَا دُعِيتُمْ فَادْخُلُوا حَتَّى بَلَغَ ‏{‏ ذَلِكُمْ أَطْهَرُ لِقُلُوبِكُمْ وَقُلُوبِهِنَّ‏}‏",
    "malay_translation": "Dan telah menceritakan kepadaku Muhammad bin Rafi', telah menceritakan kepada kami Abdur Razzaq, telah menceritakan kepada kami Ma'mar, daripada Abu Uthman, daripada Anas, katanya: \"Apabila Nabi SAW mengahwini Zainab, Umm Sulaim menghadiahkannya kain serban di dalam bekas batu.  Anas berkata, Rasulullah SAW bersabda, \"Pergilah dan jemputlah semua Muslim yang kamu jumpai.\"  Maka aku menjemput semua orang yang aku temui. Mereka masuk ke rumahnya, makan, dan keluar.  Rasulullah SAW meletakkan tangannya di atas makanan, memohon keberkatan, dan membaca apa yang dikehendaki Allah. Tiada seorangpun yang aku temui yang aku tinggalkan tanpa dijemput. Mereka makan sehingga kenyang dan keluar, tetapi segolongan daripada mereka tinggal di situ dan terlibat dalam perbincangan yang lama. Rasulullah SAW merasa malu untuk berkata apa-apa kepada mereka. Maka baginda keluar dan meninggalkan mereka di dalam rumah.  Kemudian Allah SWT menurunkan ayat: \"Wahai orang-orang yang beriman, janganlah kamu memasuki rumah Nabi kecuali diizinkan untuk makan, bukan menunggu hidangan habis dimasak.\"  Qatada berkata, \"Bukan menunggu hidangan habis dimasak.\", tetapi apabila kamu dijemput, masuklah...\" sehingga ayat ini.  Ini lebih suci bagi hati kamu dan hati mereka.\""
  },
  {
    "id": 10664,
    "hadith_number": 3387,
    "tajuk_hadith": "Kehadiran dalam Jamuan",
    "perawi_melayu": "Ibn Umar (رضي الله عنه) meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "When any one of you is invited to a feast, he should attend it.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا دُعِيَ أَحَدُكُمْ إِلَى الْوَلِيمَةِ فَلْيَأْتِهَا ‏\"‏ ‏.‏",
    "malay_translation": "Apabila salah seorang daripada kamu dijemput ke jamuan, hendaklah dia hadir."
  },
  {
    "id": 10665,
    "hadith_number": 3388,
    "tajuk_hadith": "Menjawab Jemputan Jamuan",
    "perawi_melayu": "Ibnu Umar (Semoga Allah Redha dengan mereka berdua) meriwayatkan dari Rasulullah SAW:",
    "english_text": "When any one of you is invited to a feast, he should accept. 'Ubaidallah took this feast to be a wedding feast.",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا دُعِيَ أَحَدُكُمْ إِلَى الْوَلِيمَةِ فَلْيُجِبْ ‏\"‏ ‏.‏ قَالَ خَالِدٌ فَإِذَا عُبَيْدُ اللَّهِ يُنَزِّلُهُ عَلَى الْعُرْسِ ‏.‏",
    "malay_translation": "Apabila seseorang daripada kamu dijemput ke majlis jamuan, hendaklah dia memenuhi jemputan tersebut.  'Ubaidallah memahami jamuan ini sebagai majlis perkahwinan."
  },
  {
    "id": 10666,
    "hadith_number": 3389,
    "tajuk_hadith": "Mengizinkan Jemputan Perkahwinan",
    "perawi_melayu": "Ibn Umar (Allah SWT redha kepadanya) meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "When any one of you is invited to a wedding feast, he should accept that.",
    "arabic_text": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا دُعِيَ أَحَدُكُمْ إِلَى وَلِيمَةِ عُرْسٍ فَلْيُجِبْ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila mana-mana daripada kamu dijemput ke jamuan perkahwinan, hendaklah dia menerima jemputan itu."
  },
  {
    "id": 10667,
    "hadith_number": 3390,
    "tajuk_hadith": "Menerima Jamuan Apabila Diundang",
    "perawi_melayu": "Ibn Umar (Allah merahmati mereka) meriwayatkan daripada Rasulullah SAW bersabda:",
    "english_text": "Accept the feast, when you are invited.",
    "arabic_text": "حَدَّثَنِي أَبُو الرَّبِيعِ، وَأَبُو كَامِلٍ قَالاَ حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، ح وَحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ ائْتُوا الدَّعْوَةَ إِذَا دُعِيتُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Terimalah jamuan apabila kamu dijemput."
  },
  {
    "id": 10668,
    "hadith_number": 3391,
    "tajuk_hadith": "Menjawab Jemputan Saudara",
    "perawi_melayu": "Ibn Umar (رضي الله عنهما) meriwayatkan daripada Rasulullah SAW:",
    "english_text": "When any one of you invites his brother, he (the latter) should accept his wedding feast, or any other like it.",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، كَانَ يَقُولُ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\n\"‏ إِذَا دَعَا أَحَدُكُمْ أَخَاهُ فَلْيُجِبْ عُرْسًا كَانَ أَوْ نَحْوَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila seseorang daripada kamu menjemput saudaranya, hendaklah dia memenuhi jemputan tersebut, sama ada jamuan perkahwinan atau lain-lain jamuan yang serupa."
  },
  {
    "id": 10669,
    "hadith_number": 3392,
    "tajuk_hadith": "Menjawab Jemputan Majlis Perkahwinan dan Yang Serupa",
    "perawi_melayu": "Ibn 'Umar (redha Allah dengan mereka) meriwayatkan daripada Rasulullah SAW bahawa:",
    "english_text": "He who is invited to a wedding feast or like it, he should accept it.",
    "arabic_text": "وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنِي عِيسَى بْنُ الْمُنْذِرِ، حَدَّثَنَا بَقِيَّةُ، حَدَّثَنَا الزُّبَيْدِيُّ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ دُعِيَ إِلَى عُرْسٍ أَوْ نَحْوِهِ فَلْيُجِبْ ‏\"‏ ‏.‏",
    "malay_translation": "Sesiapa yang dijemput ke majlis perkahwinan atau yang serupa dengannya, hendaklah dia memenuhi jemputan itu."
  },
  {
    "id": 10670,
    "hadith_number": 3393,
    "tajuk_hadith": "Menjawab Panggilan Jamuan",
    "perawi_melayu": "Abdullah bin Umar (رضي الله عنهما) meriwayatkan dari Rasulullah SAW:",
    "english_text": "Come to the feast, when you are invited.",
    "arabic_text": "حَدَّثَنِي حُمَيْدُ بْنُ مَسْعَدَةَ الْبَاهِلِيُّ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ، أُمَيَّةَ عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ ائْتُوا الدَّعْوَةَ إِذَا دُعِيتُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Datanglah ke jamuan apabila kamu dijemput."
  },
  {
    "id": 10671,
    "hadith_number": 3394,
    "tajuk_hadith": "Penerimaan Jemputan Jamuan dan Menghadiri Walaupun Berpuasa",
    "perawi_melayu": "Nafi' melaporkan:",
    "english_text": "I heard Abdullah b. Umar (Allah be pleased with them) narrating that Allah's Messenger (ﷺ) said: Accept the feast when you are invited to it. And Abdullah (b. Umar) used to come to the feast, whether it was a wedding feast or other than that, and he would come there even in the state of fasting.",
    "arabic_text": "وَحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَجِيبُوا هَذِهِ الدَّعْوَةَ إِذَا دُعِيتُمْ لَهَا ‏\"‏ ‏.‏ قَالَ وَكَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ يَأْتِي الدَّعْوَةَ فِي الْعُرْسِ وَغَيْرِ الْعُرْسِ وَيَأْتِيهَا وَهُوَ صَائِمٌ ‏.‏",
    "malay_translation": "Aku mendengar Abdullah bin Umar (Semoga Allah meridainya) meriwayatkan bahawa Rasulullah SAW bersabda:\"Jawablah jemputan ini jika kamu dijemput kepadanya.\" Abdullah bin Umar (r.a) akan menghadiri jemputan kenduri, sama ada kenduri perkahwinan atau kenduri yang lain, dan beliau akan menghadirinya walaupun sedang berpuasa."
  },
  {
    "id": 10672,
    "hadith_number": 3395,
    "tajuk_hadith": "Menerima Jemputan Makan Walaupun Hanya Sebahagian Kurniaan",
    "perawi_melayu": "Ibn Umar (Allah SWT meridhai mereka) meriwayatkan Rasulullah SAW bersabda:",
    "english_text": "When you are invited to a feast (even though it is) the leg of the sheep, you should accept it.",
    "arabic_text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، حَدَّثَنِي عُمَرُ بْنُ مُحَمَّدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا دُعِيتُمْ إِلَى كُرَاعٍ فَأَجِيبُوا ‏\"‏ ‏.‏",
    "malay_translation": "Apabila kamu dijemput ke majlis jamuan makan, (walaupun ia hanya) seperti kaki seekor biri-biri, hendaklah kamu menyambut jemputan itu."
  },
  {
    "id": 10673,
    "hadith_number": 3396,
    "tajuk_hadith": "Mengakui Jemputan Jamuan dan Kebebasan Makan",
    "perawi_melayu": "Jabir (رضي الله عنه) melaporkan bahawa Rasulullah SAW bersabda:",
    "english_text": "When any one of you is invited to a feast, he should accept it. He may eat if he likes, or he may abandon (eating) if he likes. Ibn Mathanni did not make mention of the word\" feast\".",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ، اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي قَالاَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا دُعِيَ أَحَدُكُمْ إِلَى طَعَامٍ فَلْيُجِبْ فَإِنْ شَاءَ طَعِمَ وَإِنْ شَاءَ تَرَكَ ‏\"‏ ‏.‏ وَلَمْ يَذْكُرِ ابْنُ الْمُثَنَّى ‏\"‏ إِلَى طَعَامٍ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila seseorang daripada kamu dijemput ke suatu jamuan, maka hendaklah dia mengiyakan jemputan itu.  Dia boleh makan jika dia suka, atau dia boleh meninggalkannya jika dia suka. Ibn Mathanni tidak menyebut perkataan \"jamuan\"."
  },
  {
    "id": 10674,
    "hadith_number": 3397,
    "tajuk_hadith": "Hadis yang Sama dengan Rangkaian Periwayat yang Sama",
    "perawi_melayu": "",
    "english_text": "A hadith like this has been narrated on the authority of Abd Zubair with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، بِهَذَا الإِسْنَادِ بِمِثْلِهِ.",
    "malay_translation": "Hadis seumpamanya telah diriwayatkan berdasarkan perkataan Abd Zubair dengan rangkaian periwayat yang sama."
  },
  {
    "id": 10675,
    "hadith_number": 3398,
    "tajuk_hadith": "Menjawab Jemputan dan Mengamalkan Adab di Rumah Tetamu",
    "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan daripada Rasulullah SAW bahawa:",
    "english_text": "If any one of you is invited, he should accept (the invitation). In case he is fasting, he should pray (in order to bless the inmates of the house), and if he is not fasting he should eat.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ هِشَامٍ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا دُعِيَ أَحَدُكُمْ فَلْيُجِبْ فَإِنْ كَانَ صَائِمًا فَلْيُصَلِّ وَإِنْ كَانَ مُفْطِرًا فَلْيَطْعَمْ ‏\".",
    "malay_translation": "Jika seseorang daripada kamu dijemput, hendaklah dia menerima jemputan itu. Jika dia sedang berpuasa, hendaklah dia solat (untuk mendoakan kebaikan ahli rumah itu), dan jika dia tidak berpuasa, hendaklah dia makan."
  },
  {
    "id": 10676,
    "hadith_number": 3399,
    "tajuk_hadith": "Jenis Makanan yang Tercela dan Ketaatan terhadap Allah dan Rasul-Nya dalam Perayaan.",
    "perawi_melayu": "Abu Hurairah (Semoga Allah redha dengannya) pernah berkata:",
    "english_text": "The worst kind of food is the wedding feast to which the rich are invited and the poor are ignored. He who does not come to the feast, he in fact disobeys Allah and His Messenger (ﷺ).",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ كَانَ يَقُولُ بِئْسَ الطَّعَامُ طَعَامُ الْوَلِيمَةِ يُدْعَى إِلَيْهِ الأَغْنِيَاءُ وَيُتْرَكُ الْمَسَاكِينُ فَمَنْ لَمْ يَأْتِ الدَّعْوَةَ فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ ‏.‏",
    "malay_translation": "Jenis makanan yang paling tercela ialah jamuan perkahwinan yang mengundang orang kaya dan mengabaikan orang miskin. Barangsiapa yang tidak datang ke jamuan tersebut, sesungguhnya dia telah menderhaka kepada Allah dan Rasul-Nya (ﷺ)."
  },
  {
    "id": 10677,
    "hadith_number": 3400,
    "tajuk_hadith": "Perihal Makanan Terburuk di Perjamuan Kahwin Orang Kaya",
    "perawi_melayu": "Sufyan meriwayatkan:",
    "english_text": "I said to Zuhri: Abu Bakr, what does this hadith mean:\" The worst kind of food is at a wedding feast of the rich\"? He laughed and said: The food served in the feast given by the rich is not worst (in itself). Sufyan said: My father was rich, so I felt disturbed when I heard this hadith, so I asked Zuhri who said: I heard from 'Abd al-Rahman al-Alraj that he heard Abu Huraira (Allah he pleased with him) say: The worst kind of food is that served at the wedding feast. The rest of the hadith is the same.",
    "arabic_text": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، قَالَ قُلْتُ لِلزُّهْرِيِّ يَا أَبَا بَكْرٍ كَيْفَ هَذَا الْحَدِيثُ شَرُّ الطَّعَامِ طَعَامُ الأَغْنِيَاءِ فَضَحِكَ فَقَالَ لَيْسَ هُوَ شَرُّ الطَّعَامِ طَعَامُ الأَغْنِيَاءِ ‏.‏ قَالَ سُفْيَانُ وَكَانَ أَبِي غَنِيًّا فَأَفْزَعَنِي هَذَا الْحَدِيثُ حِينَ سَمِعْتُ بِهِ فَسَأَلْتُ عَنْهُ الزُّهْرِيَّ فَقَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ الأَعْرَجُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ شَرُّ الطَّعَامِ طَعَامُ الْوَلِيمَةِ ‏.‏ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ مَالِكٍ.",
    "malay_translation": "Saya bertanya kepada Zuhri, 'Wahai Abu Bakar, apakah maksud hadith ini: \"Makanan terburuk adalah makanan perjamuan orang kaya\"?' Beliau ketawa dan berkata, \"Makanan yang dihidangkan dalam perjamuan orang kaya bukanlah makanan yang terburuk (dari segi zatnya).\" Sufyan berkata, 'Bapa saya seorang yang kaya, maka hadith ini membuatkan saya bimbang. Oleh itu, saya bertanya kepada Zuhri, lalu beliau menjawab, 'Saya mendengar dari 'Abd al-Rahman al-Alraj bahawa beliau mendengar Abu Hurairah (Allah berhamba dengannya) berkata, \"Makanan terburuk adalah makanan perjamuan.\" Kemudian, beliau menyebut hadis yang sama seperti hadis Malik."
  },
  {
    "id": 10678,
    "hadith_number": 3401,
    "tajuk_hadith": "Perihal Makanan Perjamuan Yang Tidak Disukai",
    "perawi_melayu": "Abu Hurairah (redha Allah dengannya)",
    "english_text": "This hadith has been narrated on the authority of Abu Huraira (Allah be pleased with him) through another chain of transmitters.\n\nA hadith like this has been narrated by Abu Huraira (Allah be pleased with him) through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، عَنْ عَبْدِ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَعَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ شَرُّ الطَّعَامِ طَعَامُ الْوَلِيمَةِ ‏.‏ نَحْوَ حَدِيثِ مَالِكٍ.\n\nوَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، نَحْوَ ذَلِكَ ‏.‏",
    "malay_translation": "Hadis ini telah diriwayatkan dengan sanad daripada Abu Hurairah (redha Allah dengannya) melalui beberapa rangkaian perawi lain.  Hadis serupa ini juga diriwayatkan oleh Abu Hurairah (redha Allah dengannya) melalui beberapa rangkaian perawi yang lain. Dikatakan bahawa makanan perjamuan adalah makanan yang paling tercela."
  },
  {
    "id": 10679,
    "hadith_number": 3402,
    "tajuk_hadith": "Kehinaan Makanan Perjamuan Perkahwinan dan Ketaatan Kepada Allah dan Rasul-Nya",
    "perawi_melayu": "Abu Hurairah رضي الله عنه",
    "english_text": "Abu Haraira (Allah be pleased with him) reported Allah's Apostle (ﷺ) as saying. The worst kind of food is at the wedding feast from which one who comes is turned away, and he who refuses it is invited, and he who did not accept the invitation disobeyed Allah and His Messenger (ﷺ).",
    "arabic_text": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ زِيَادَ بْنَ سَعْدٍ، قَالَ سَمِعْتُ ثَابِتًا، الأَعْرَجَ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ شَرُّ الطَّعَامِ طَعَامُ الْوَلِيمَةِ يُمْنَعُهَا مَنْ يَأْتِيهَا وَيُدْعَى إِلَيْهَا مَنْ يَأْبَاهَا وَمَنْ لَمْ يُجِبِ الدَّعْوَةَ فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Hurairah رضي الله عنه meriwayatkan bahawa Rasulullah SAW bersabda, \"Jenis makanan yang paling tercela ialah makanan di majlis kenduri kahwin di mana seseorang yang datang ditolak, dan seseorang yang menolaknya dijemput, dan sesiapa yang tidak menerima jemputan itu telah menderhaka kepada Allah dan Rasul-Nya.\" "
  },
  {
    "id": 10680,
    "hadith_number": 3403,
    "tajuk_hadith": "Perempuan Rifa'ah dan Perkahwinan yang Tidak Sempurna",
    "perawi_melayu": "'Aisyah (رضي الله عنها) meriwayatkan:",
    "english_text": "There came the wife of Rifa'a to Allah's Apostle (ﷺ) and said: I was married to Rifa'a but he divorced me, making may divorce irrevocable. Afterwards I married Abd al-Rahman b. al-Zubair, but all he possesses is like the fringe of a garment (i. e. he is sexually weak). Thereupon Allah's Messenger (ﷺ) smiled, and said: Do you wish to return to Rifa'a. (You) cannot (do it) until you have tasted his sweetness and he ('Abd al-Rahman) has tasted your sweetness. Abu Bakr was at that time near him (the Holy Prophet) and Khalid (b. Sa'id) was at the door waiting for the permission to be granted to him to enter), He (Khalid) said; Abu Bakr, do you hear what she is saying loudly in the presence of Allah's Messenger (ﷺ)?",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، - وَاللَّفْظُ لِعَمْرٍو - قَالاَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ جَاءَتِ امْرَأَةُ رِفَاعَةَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ كُنْتُ عِنْدَ رِفَاعَةَ فَطَلَّقَنِي فَبَتَّ طَلاَقِي فَتَزَوَّجْتُ عَبْدَ الرَّحْمَنِ بْنَ الزَّبِيرِ وَإِنَّ مَا مَعَهُ مِثْلُ هُدْبَةِ الثَّوْبِ فَتَبَسَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ أَتُرِيدِينَ أَنْ تَرْجِعِي إِلَى رِفَاعَةَ لاَ حَتَّى تَذُوقِي عُسَيْلَتَهُ وَيَذُوقَ عُسَيْلَتَكِ ‏\"‏ ‏.‏ قَالَتْ وَأَبُو بَكْرٍ عِنْدَهُ وَخَالِدٌ بِالْبَابِ يَنْتَظِرُ أَنْ يُؤْذَنَ لَهُ فَنَادَى يَا أَبَا بَكْرٍ أَلاَ تَسْمَعُ هَذِهِ مَا تَجْهَرُ بِهِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Datanglah isteri Rifa'ah kepada Rasulullah SAW dan berkata: Aku pernah berkahwin dengan Rifa'ah lalu dia menceraikanku dengan talak tiga. Kemudian aku berkahwin dengan Abd al-Rahman bin al-Zubair, tetapi kekuatan seksualnya seperti benang kain (iaitu lemah).  Lalu Rasulullah SAW tersenyum dan bersabda:  Apakah engkau mahu kembali kepada Rifa'ah? Tidaklah, sehingga engkau merasai nikmatnya dan dia merasai nikmatmu. Pada ketika itu, Abu Bakar berada di sisi baginda SAW dan Khalid (bin Said) di pintu menunggu izin masuk. Khalid berseru: Wahai Abu Bakar, adakah engkau dengar apa yang wanita itu berteriak di hadapan Rasulullah SAW?"
  },
  {
    "id": 10681,
    "hadith_number": 3404,
    "tajuk_hadith": "Perkara Keinginan Kembali kepada Suami Terdahulu dan Hukumnya",
    "perawi_melayu": "'A'ishah (رضي الله عنها), isteri Rasulullah (ﷺ), melaporkan bahawa Rifa'ah al-Qurzi (رضي الله عنه) menceraikan isterinya, menjadikan cerai itu tidak boleh diubah. Kemudian isterinya itu berkahwin dengan Abd al-Rahman bin al-Zubair (رضي الله عنه). Isteri itu datang kepada Rasulullah (ﷺ) dan berkata bahawa dia pernah isteri Rifa'ah (رضي الله عنه) dan dia menceraikannya sebanyak tiga kali, kemudian dia berkahwin dengan Abd al-Rahman bin al-Zubair. Demi Allah, yang dimiliki oleh Abd al-Rahman itu hanyalah seperti benang pinggiran pakaian, dan wanita itu memegang benang pinggiran pakaiannya.",
    "english_text": "Perhaps you wish to return to Rifa'a, (but you) cannot (do it) until he has tasted your sweetness and you have tasted his sweetness. Abu Bakr al-siddiq (Allah be pleased with him) was sitting at that time with Allah's Messenger (ﷺ) and Khalid b. Sa'id b. al-'As (Allah be pleased with him) was sitting at the door of his apartment and he was not permitted to (enter the room), and Kbalid called loudly saying: Abu Bakr, why don't you scold her for what she is saying loudly in the presence of Allah's Messenger (ﷺ)?",
    "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، - وَاللَّفْظُ لِحَرْمَلَةَ - قَالَ أَبُو الطَّاهِرِ حَدَّثَنَا وَقَالَ، حَرْمَلَةُ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّ رِفَاعَةَ الْقُرَظِيَّ طَلَّقَ امْرَأَتَهُ فَبَتَّ طَلاَقَهَا فَتَزَوَّجَتْ بَعْدَهُ عَبْدَ الرَّحْمَنِ بْنَ الزَّبِيرِ فَجَاءَتِ النَّبِيَّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّهَا كَانَتْ تَحْتَ رِفَاعَةَ فَطَلَّقَهَا آخِرَ ثَلاَثِ تَطْلِيقَاتٍ فَتَزَوَّجْتُ بَعْدَهُ عَبْدَ الرَّحْمَنِ بْنَ الزَّبِيرِ وَإِنَّهُ وَاللَّهِ مَا مَعَهُ إِلاَّ مِثْلُ الْهُدْبَةِ وَأَخَذَتْ بِهُدْبَةٍ مِنْ جِلْبَابِهَا ‏.‏ قَالَ فَتَبَسَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم ضَاحِكًا فَقَالَ ‏\n\"‏ لَعَلَّكِ تُرِيدِينَ أَنْ تَرْجِعِي إِلَى رِفَاعَةَ لاَ حَتَّى يَذُوقَ عُسَيْلَتَكِ وَتَذُوقِي عُسَيْلَتَهُ ‏\"‏ ‏.‏ وَأَبُو بَكْرٍ الصِّدِّيقُ جَالِسٌ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَخَالِدُ بْنُ سَعِيدِ بْنِ الْعَاصِ جَالِسٌ بِبَابِ الْحُجْرَةِ لَمْ يُؤْذَنْ لَهُ قَالَ فَطَفِقَ خَالِدٌ يُنَادِي أَبَا بَكْرٍ أَلاَ تَزْجُرُ هَذِهِ عَمَّا تَجْهَرُ بِهِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم.",
    "malay_translation": "Perkara ini berkaitan dengan keinginan seorang wanita untuk kembali kepada bekas suaminya, Rifa'ah al-Qurzi (رضي الله عنه), dan hukumnya dalam Islam. Beliau (رضي الله عنه) pernah menceraikan isterinya, sehingga menjadikan cerai itu tidak dapat diubah.  Kemudian wanita tersebut berkahwin dengan Abd al-Rahman bin al-Zubair (رضي الله عنه). Beliau datang kepada Rasulullah (ﷺ) dan menyatakan perkaranya.  Rasulullah (ﷺ) tersenyum dan bersabda, \"Mungkin kamu ingin kembali kepada Rifa'ah, tetapi tidaklah boleh sehingga dia merasa cintamu dan engkau merasakan cintanya.\" Pada masa itu, Abu Bakar al-Siddiq (رضي الله عنه) bersama Rasulullah (ﷺ), dan Khalid bin Said bin al-'As (رضي الله عنه) duduk di luar bilik, tidak dibenarkan masuk. Lalu Khalid memanggil Abu Bakar dan bertanya mengapa tidak menegur wanita itu atas apa yang dia katakan di hadapan Rasulullah (ﷺ)."
  },
  {
    "id": 10682,
    "hadith_number": 3405,
    "tajuk_hadith": "Perceraian Rifa'ah al-Qurazi dan Perkahwinan Semula",
    "perawi_melayu": "`A'ishah (رضي الله عنها) melaporkan bahawa Rifa'ah al-Qurazi menceraikan isterinya, kemudian `Abd al-Rahman bin al-Zubair mengahwininya. Isteri tersebut datang kepada Rasulullah SAW dan berkata:",
    "english_text": "Messenger of Allah, Rifa`a has divorced me by three pronouncements. (The rest of the hadith is the same.)",
    "arabic_text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ رِفَاعَةَ الْقُرَظِيَّ، طَلَّقَ امْرَأَتَهُ فَتَزَوَّجَهَا عَبْدُ الرَّحْمَنِ بْنُ الزَّبِيرِ فَجَاءَتِ النَّبِيَّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ رِفَاعَةَ طَلَّقَهَا آخِرَ ثَلاَثِ تَطْلِيقَاتٍ ‏.‏ بِمِثْلِ حَدِيثِ يُونُسَ ‏.‏",
    "malay_translation": "Wahai Rasulullah, Rifa'ah al-Qurazi telah menceraikan aku sebanyak tiga kali. (Selebihnya hadis sama seperti hadis Yunus.)"
  },
  {
    "id": 10683,
    "hadith_number": 3406,
    "tajuk_hadith": "Hukum Perempuan yang Bercerai dan Menikah Kemudian",
    "perawi_melayu": "'A'ishah (رضي الله عنها) meriwayatkan bahawa Rasulullah SAW ditanya tentang wanita yang dinikahi seorang lelaki dan kemudian diceraikan, kemudian dia mengahwini orang lain dan diceraikan sebelum melakukan hubungan seksual. Apakah wanita itu halal bagi suami pertamanya? Baginda SAW menjawab:",
    "english_text": "No, until he has tasted her sweetness.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ الْهَمْدَانِيُّ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ عَنِ الْمَرْأَةِ يَتَزَوَّجُهَا الرَّجُلُ فَيُطَلِّقُهَا فَتَتَزَوَّجُ رَجُلاً فَيُطَلِّقُهَا قَبْلَ أَنْ يَدْخُلَ بِهَا أَتَحِلُّ لِزَوْجِهَا الأَوَّلِ قَالَ ‏\n\"‏ لاَ حَتَّى يَذُوقَ عُسَيْلَتَهَا ‏\"‏‏.‏",
    "malay_translation": "Tidak, sehingga dia merasai kemanisan pergaulan dengannya."
  },
  {
    "id": 10684,
    "hadith_number": 3407,
    "tajuk_hadith": "Hadis Dengan Sanad yang Sama",
    "perawi_melayu": "",
    "english_text": "A hadith like this has been narrated on the authority of Hisham with the same chain of transmitters.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ فُضَيْلٍ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ جَمِيعًا عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ ‏.‏",
    "malay_translation": "Sebuah hadis seperti ini telah diriwayatkan dengan sanad yang sama dari Hisham."
  },
  {
    "id": 10685,
    "hadith_number": 3408,
    "tajuk_hadith": "Larangan Perkahwinan Semula Isteri yang Telah Diceraikan",
    "perawi_melayu": "'Aisyah (رضي الله عنها) meriwayatkan:",
    "english_text": "A person divorced his wife by three pronouncements; then another person married her and he also divorced her without having sexual intercourse with her. Then the first husband of her intended to remarry her. It was about such a case that Allah's Messenger (ﷺ) was asked, whereupon he said: No, until the second one has tasted her sweetness as the first one had tasted.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، قَالَتْ طَلَّقَ رَجُلٌ امْرَأَتَهُ ثَلاَثًا فَتَزَوَّجَهَا رَجُلٌ ثُمَّ طَلَّقَهَا قَبْلَ أَنْ يَدْخُلَ بِهَا فَأَرَادَ زَوْجُهَا الأَوَّلُ أَنْ يَتَزَوَّجَهَا فَسُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَقَالَ ‏\n\"‏ لاَ حَتَّى يَذُوقَ الآخِرُ مِنْ عُسَيْلَتِهَا مَا ذَاقَ الأَوَّلُ ‏\"‏ ‏.‏",
    "malay_translation": "Seseorang telah menceraikan isterinya sebanyak tiga kali. Kemudian, seorang lain mengahwininya dan menceraikannya kembali sebelum bersetubuh dengannya.  Lalu suami pertamanya ingin mengahwininya kembali.  Rasulullah صلى الله عليه وسلم ditanya tentang hal ini, lalu baginda bersabda: Tidak boleh, sehingga orang kedua itu merasai nikmat isterinya seperti yang dirasai oleh orang pertama."
  },
  {
    "id": 10686,
    "hadith_number": 3409,
    "tajuk_hadith": "Hadis Sama Dengan Rantai Perawi Yang Sama",
    "perawi_melayu": "Aishah (رضي الله عنها)",
    "english_text": "A hadith like this has been narrated on the same chain of transmitters by 'A'isha (Allah be pleased with her).",
    "arabic_text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، - يَعْنِي ابْنَ سَعِيدٍ - جَمِيعًا عَنْ عُبَيْدِ اللَّهِ، بِهَذَا الإِسْنَادِ ‏.‏ مِثْلَهُ ‏.‏ وَفِي حَدِيثِ يَحْيَى عَنْ عُبَيْدِ اللَّهِ حَدَّثَنَا الْقَاسِمُ عَنْ عَائِشَةَ ‏.‏",
    "malay_translation": "Hadis yang serupa dengannya telah diriwayatkan dengan sanad yang sama oleh 'Aishah (رضي الله عنها). "
  },
  {
    "id": 10687,
    "hadith_number": 3410,
    "tajuk_hadith": "Doa Ketika Menghampiri Isteri dan Perlindungan dari Syaitan",
    "perawi_melayu": "Ibnu Abbas (رضي الله عنه) meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "If anyone amongst you intends to go to his wife he should say: In the name of Allah,0 Allah protect us against Satan and keep away the Satan from the one that you have bestowed upon us, and if He has ordained a male child for them, Satan will never be able to do any harm to him.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لِيَحْيَى - قَالاَ أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ سَالِمٍ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَوْ أَنَّ أَحَدَهُمْ إِذَا أَرَادَ أَنْ يَأْتِيَ أَهْلَهُ قَالَ بِاسْمِ اللَّهِ اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا فَإِنَّهُ إِنْ يُقَدَّرْ بَيْنَهُمَا وَلَدٌ فِي ذَلِكَ لَمْ يَضُرَّهُ شَيْطَانٌ أَبَدًا ‏\"‏‏.‏",
    "malay_translation": "Jika seseorang di antara kamu ingin menemui isterinya, hendaklah ia berkata: Dengan nama Allah. Ya Allah, jauhkanlah kami daripada syaitan dan jauhkanlah syaitan daripada apa yang Engkau kurniakan kepada kami. Dan jika Allah telah menetapkan anak lelaki untuk mereka dalam pertemuan itu, maka syaitan tidak akan dapat mendatangkan mudarat kepadanya selama-lamanya."
  },
  {
    "id": 10688,
    "hadith_number": 3411,
    "tajuk_hadith": "Hadis tentang Ketiadaan Lafadz Basmalah dalam Beberapa Riwayat",
    "perawi_melayu": "",
    "english_text": "This hadith is narrated through another chain of transmitters and there is no mention of (the words)\" Bismillah\" (In the name of Allah) in it.",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، جَمِيعًا عَنِ الثَّوْرِيِّ، كِلاَهُمَا عَنْ مَنْصُورٍ، بِمَعْنَى حَدِيثِ جَرِيرٍ غَيْرَ أَنَّ شُعْبَةَ لَيْسَ فِي حَدِيثِهِ ذِكْرُ ‏\"‏ بِاسْمِ اللَّهِ ‏\"‏ ‏.‏ وَفِي رِوَايَةِ عَبْدِ الرَّزَّاقِ عَنِ الثَّوْرِيِّ ‏\"‏ بِاسْمِ اللَّهِ ‏\"‏ ‏.‏ وَفِي رِوَايَةِ ابْنِ نُمَيْرٍ قَالَ مَنْصُورٌ أُرَاهُ قَالَ ‏\"‏ بِاسْمِ اللَّهِ ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan melalui beberapa sanad perawi yang lain dan tiada disebut lafaz \"Bismillah\" (Dengan nama Allah) di dalamnya."
  },
  {
    "id": 10689,
    "hadith_number": 3412,
    "tajuk_hadith": "Penjelasan tentang cara bersetubuh dan kaitannya dengan kecacatan anak",
    "perawi_melayu": "Jabir (رضي الله عنه) menyatakan bahawa...",
    "english_text": "When a man has intercourse with his wife through the vagina but being on her back. the child will have squint, so the verse came down:\" Your wives are your tilth; go then unto your tilth as you may desire\" (ii. 223)",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ - وَاللَّفْظُ لأَبِي بَكْرٍ - قَالُوا حَدَّثَنَا سُفْيَانُ عَنِ ابْنِ الْمُنْكَدِرِ سَمِعَ جَابرًا يَقُولُ كَانَتِ الْيَهُودُ تَقُولُ إِذَا أَتَى الرَّجُلُ امْرَأَتَهُ مِنْ دُبُرِهَا فِي قُبُلِهَا كَانَ الْوَلَدُ أَحْوَلَ فَنَزَلَتْ ‏{‏ نِسَاؤُكُمْ حَرْثٌ لَكُمْ فَأْتُوا حَرْثَكُمْ أَنَّى شِئْتُمْ‏}‏",
    "malay_translation": "Dikatakan oleh Jabir (رضي الله عنه) bahawa orang Yahudi dahulu mengatakan bahawa sekiranya seorang lelaki bersetubuh dengan isterinya daripada belakang (berbaring di atasnya), maka anak yang dilahirkan akan mengalami rabun.  Oleh itu, turunlah ayat, \"Wanita-wanita kamu adalah ladang bagi kamu, maka datangilah ladang kamu sebagaimana yang kamu kehendaki\". (Surah Al-Baqarah, ayat 223)."
  },
  {
    "id": 10690,
    "hadith_number": 3413,
    "tajuk_hadith": "Tafsir Ayat: Perumpamaan Isteri Sebagai Ladang",
    "perawi_melayu": "Jabir bin Abdullah (رضي الله عنه)",
    "english_text": "\" Your wives are your ti'Ith; go then unto your tilth, as you may desire.\"",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنِ ابْنِ الْهَادِ، عَنْ أَبِي حَازِمٍ، عَنْ مُحَمَّدِ، بْنِ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ يَهُودَ، كَانَتْ تَقُولُ إِذَا أُتِيَتِ الْمَرْأَةُ مِنْ دُبُرِهَا فِي قُبُلِهَا ثُمَّ حَمَلَتْ كَانَ وَلَدُهَا أَحْوَلَ ‏.‏ قَالَ فَأُنْزِلَتْ ‏{‏ نِسَاؤُكُمْ حَرْثٌ لَكُمْ فَأْتُوا حَرْثَكُمْ أَنَّى شِئْتُمْ‏}‏",
    "malay_translation": "Para isteri kamu adalah ladang untuk kamu. Maka, campurilah ladang kamu sebagaimana yang kamu kehendaki."
  },
  {
    "id": 10691,
    "hadith_number": 3414,
    "tajuk_hadith": "Panduan Persetubuhan yang Diizinkan dalam Islam",
    "perawi_melayu": "Hadits ini diriwayatkan daripada Jabir melalui beberapa rangkaian perawi, namun dalam riwayat Zuhri terdapat tambahan.",
    "english_text": "\"If he likes he may (have intercourse) being on the back or in front of her, but it should be through one opening (vagina).\"",
    "arabic_text": "وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، ح وَحَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، عَنْ أَيُّوبَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، ح وَحَدَّثَنِي عُبَيْدُ اللَّهِ، بْنُ سَعِيدٍ وَهَارُونُ بْنُ عَبْدِ اللَّهِ وَأَبُو مَعْنٍ الرَّقَاشِيُّ قَالُوا حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي قَالَ، سَمِعْتُ النُّعْمَانَ بْنَ رَاشِدٍ، يُحَدِّثُ عَنِ الزُّهْرِيِّ، ح وَحَدَّثَنِي سُلَيْمَانُ بْنُ مَعْبَدٍ، حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - وَهُوَ ابْنُ الْمُخْتَارِ - عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، كُلُّ هَؤُلاَءِ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، بِهَذَا الْحَدِيثِ وَزَادَ فِي حَدِيثِ النُّعْمَانِ عَنِ الزُّهْرِيِّ إِنْ شَاءَ مُجَبِّيَةً وَإِنْ شَاءَ غَيْرَ مُجَبِّيَةٍ غَيْرَ أَنَّ ذَلِكَ فِي صِمَامٍ وَاحِدٍ ‏.‏",
    "malay_translation": "Sekiranya dia suka, dia boleh bersetubuh dengan isterinya dari belakang atau depan, namun mestilah melalui satu lubang (faraj) sahaja."
  },
  {
    "id": 10692,
    "hadith_number": 3415,
    "tajuk_hadith": "Laknat Malaikat terhadap Wanita yang Meninggalkan Tempat Tidur Suaminya",
    "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan daripada Rasulullah SAW bahawa:",
    "english_text": "When a woman spends the night away from the bed of her husband, the angels curse her until morning.",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ، بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا بَاتَتِ الْمَرْأَةُ هَاجِرَةً فِرَاشَ زَوْجِهَا لَعَنَتْهَا الْمَلاَئِكَةُ حَتَّى تُصْبِحَ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila seorang wanita menghabiskan malam di luar tempat tidur suaminya, para malaikat akan melaknatnya sehingga pagi."
  },
  {
    "id": 10693,
    "hadith_number": 3416,
    "tajuk_hadith": "Menunggu Kembalinya Seseorang",
    "perawi_melayu": "Hadith ini diriwayatkan melalui rangkaian perawi yang sama (dengan sedikit perbezaan):",
    "english_text": "\"Dia berkata: Sehingga dia kembali.\"",
    "arabic_text": "وَحَدَّثَنِيهِ يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدٌ، - يَعْنِي ابْنَ الْحَارِثِ - حَدَّثَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ وَقَالَ ‏\n\"‏ حَتَّى تَرْجِعَ ‏\"‏ ‏.‏",
    "malay_translation": "\"Beliau berkata: Hingga dia kembali.\""
  },
  {
    "id": 10694,
    "hadith_number": 3417,
    "tajuk_hadith": "Ketidakpuasan Tuhan di Atas Keengganan Isteri Kepada Suami",
    "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan Rasulullah SAW bersabda:",
    "english_text": "By Him in Whose Hand is my life, when a man calls his wife to his bed, and she does not respond, the One Who is in the heaven is displeased with her until he (her husband) is pleased with her.",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا مَرْوَانُ، عَنْ يَزِيدَ، - يَعْنِي ابْنَ كَيْسَانَ - عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ وَالَّذِي نَفْسِي بِيَدِهِ مَا مِنْ رَجُلٍ يَدْعُو امْرَأَتَهُ إِلَى فِرَاشِهَا فَتَأْبَى عَلَيْهِ إِلاَّ كَانَ الَّذِي فِي السَّمَاءِ سَاخِطًا عَلَيْهَا حَتَّى يَرْضَى عَنْهَا ‏\"‏ ‏.",
    "malay_translation": "Demi Zat yang menguasai nyawaku, jika seorang suami memanggil isterinya ke tempat tidurnya, dan isterinya enggan, maka Allah yang Maha Tinggi akan murka terhadap isterinya itu sehingga suami tersebut berpuas hati dengannya."
  },
  {
    "id": 10695,
    "hadith_number": 3418,
    "tajuk_hadith": "Kebencian Malaikat Jika Suami Marah Kepada Isteri yang Tidak Menghampirinya",
    "perawi_melayu": "Abu Hurairah radhiallahu 'anhu meriwayatkan dari Rasulullah SAW:",
    "english_text": "When a man invites his wife to his bed and she does not come, and he (the husband) spends the sight being angry with her, the angels curse her until morning.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنِي أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا جَرِيرٌ، كُلُّهُمْ عَنِ الأَعْمَشِ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا دَعَا الرَّجُلُ امْرَأَتَهُ إِلَى فِرَاشِهِ فَلَمْ تَأْتِهِ فَبَاتَ غَضْبَانَ عَلَيْهَا لَعَنَتْهَا الْمَلاَئِكَةُ حَتَّى تُصْبِحَ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila seorang lelaki mengajak isterinya ke tempat tidurnya, tetapi isterinya tidak datang, dan lelaki itu bermalam dalam keadaan marah kepadanya, maka malaikat akan mengutuknya sehingga pagi."
  },
  {
    "id": 10696,
    "hadith_number": 3419,
    "tajuk_hadith": "Kezaliman Orang Yang Mengungkap Rahsia Isterinya",
    "perawi_melayu": "Abu Sa'id al-Khudri (رضي الله عنه) meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The most wicked among the people in the eye of Allah on the Day of judgment is the men who goes to his wife and she comes to him, and then he divulges her secret.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، عَنْ عُمَرَ بْنِ حَمْزَةَ الْعُمَرِيِّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَعْدٍ، قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ مِنْ أَشَرِّ النَّاسِ عِنْدَ اللَّهِ مَنْزِلَةً يَوْمَ الْقِيَامَةِ الرَّجُلَ يُفْضِي إِلَى امْرَأَتِهِ وَتُفْضِي إِلَيْهِ ثُمَّ يَنْشُرُ سِرَّهَا ‏\"‏ ‏.‏",
    "malay_translation": "Di antara manusia yang paling jahat di sisi Allah pada Hari Kiamat ialah lelaki yang mendekati isterinya dan dia mendekatinya, kemudian dia mendedahkan rahsianya."
  },
  {
    "id": 10697,
    "hadith_number": 3420,
    "tajuk_hadith": "Kepercayaan Utama: Hubungan Suami Isteri dan Rahsia",
    "perawi_melayu": "Diriwayatkan oleh Ibn Numair dengan sedikit perbezaan perkataan",
    "english_text": "The most important of the trusts in the sight of Allah on the Day of judgment is that a man goes to his wife and she goes to him (and the breach of this trust is) that he should divulge her secret Ibn Numair narrates this hadith with a slight change of wording.",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عُمَرَ، بْنِ حَمْزَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَعْدٍ، قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنْ أَعْظَمِ الأَمَانَةِ عِنْدَ اللَّهِ يَوْمَ الْقِيَامَةِ الرَّجُلَ يُفْضِي إِلَى امْرَأَتِهِ وَتُفْضِي إِلَيْهِ ثُمَّ يَنْشُرُ سِرَّهَا ‏\"‏ ‏.‏ وَقَالَ ابْنُ نُمَيْرٍ ‏\"‏ إِنَّ أَعْظَمَ ‏\"‏ ‏.‏",
    "malay_translation": "Di antara amanah yang paling besar di sisi Allah pada Hari Kiamat ialah seorang lelaki yang jujur kepada isterinya dan isterinya juga jujur kepadanya.  Kemudian dia mendedahkan rahsia isterinya. Ibn Numair meriwayatkan hadith ini dengan sedikit perbezaan perkataan."
  },
  {
    "id": 10698,
    "hadith_number": 3421,
    "tajuk_hadith": "Keizinan Berpantang Daripada Mengandung dalam Keadaan Perang",
    "perawi_melayu": "Abu Sirma bertanya kepada Abu Sa'id al-Khudri (رضي الله عنه).",
    "english_text": "0 Abu Sa'id, did you hear Allah's Messenger (ﷺ) mentioning al-'azl? He said: Yes, and added: We went out with Allah's Messenger (ﷺ) on the expedition to the Bi'l-Mustaliq and took captive some excellent Arab women; and we desired them, for we were suffering from the absence of our wives, (but at the same time) we also desired ransom for them. So we decided to have sexual intercourse with them but by observing 'azl (Withdrawing the male sexual organ before emission of semen to avoid-conception). But we said: We are doing an act whereas Allah's Messenger is amongst us; why not ask him? So we asked Allah's Mes- senger (ﷺ), and he said: It does not matter if you do not do it, for every soul that is to be born up to the Day of Resurrection will be born.",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ، قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، بْنُ جَعْفَرٍ أَخْبَرَنِي رَبِيعَةُ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنِ ابْنِ مُحَيْرِيزٍ، أَنَّهُ قَالَ دَخَلْتُ أَنَا وَأَبُو صِرْمَةَ عَلَى أَبِي سَعِيدٍ الْخُدْرِيِّ فَسَأَلَهُ أَبُو صِرْمَةَ فَقَالَ يَا أَبَا سَعِيدٍ هَلْ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَذْكُرُ الْعَزْلَ فَقَالَ نَعَمْ غَزَوْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم غَزْوَةَ بَلْمُصْطَلِقِ فَسَبَيْنَا كَرَائِمَ الْعَرَبِ فَطَالَتْ عَلَيْنَا الْعُزْبَةُ وَرَغِبْنَا فِي الْفِدَاءِ فَأَرَدْنَا أَنْ نَسْتَمْتِعَ وَنَعْزِلَ فَقُلْنَا نَفْعَلُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ أَظْهُرِنَا لاَ نَسْأَلُهُ ‏.‏ فَسَأَلْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ لاَ عَلَيْكُمْ أَنْ لاَ تَفْعَلُوا مَا كَتَبَ اللَّهُ خَلْقَ نَسَمَةٍ هِيَ كَائِنَةٌ إِلَى يَوْمِ الْقِيَامَةِ إِلاَّ سَتَكُونُ ‏\"‏ ‏.‏",
    "malay_translation": "Telah diceritakan kepada kami oleh Yahya bin Ayub, Qatadah bin Said, dan Ali bin Hujar. Mereka berkata, telah menceritakan kepada kami Ismail bin Ja'far, yang diberitahu oleh Rabi'ah daripada Muhammad bin Yahya bin Habban daripada Ibnu Muhaizir, bahawa beliau berkata: Aku dan Abu Sirmah memasuki rumah Abu Sa'id al-Khudri. Abu Sirmah bertanya kepada Abu Sa'id, \"Adakah engkau pernah mendengar Rasulullah menyebut tentang al-'azl?\" Jawab Abu Sa'id, \"Ya.\" Kemudian beliau menambah, \"Kami keluar bersama Rasulullah dalam peperangan Bi'l-Mustaliq dan menangkap beberapa wanita Arab yang cantik. Kami merasa rindu dengan isteri-isteri kami dan turut ingin menebus tebusan mereka. Maka kami berhasrat untuk melakukan persetubuhan tetapi dengan berpantang (al-'azl) untuk mengelak daripada kehamilan. Kami berfikir, \"Rasulullah ada di tengah-tengah kami; kenapa tidak bertanya?\" Maka kami bertanya kepada Rasulullah, dan baginda menjawab, \"Tidak mengapa kamu tidak melakukannya, kerana setiap jiwa yang telah ditentukan oleh Allah untuk dilahirkan sampai Hari Kiamat pasti akan dilahirkan.\""
  },
  {
    "id": 10699,
    "hadith_number": 3422,
    "tajuk_hadith": "Allah Telah Menentukan Takdir Ciptaan Hingga Hari Kiamat",
    "perawi_melayu": "Hadis ini diriwayatkan oleh Habban dengan sanad yang sama (tetapi dengan perubahan ini) bahawa beliau berkata:",
    "english_text": "\" Allah has ordained whom he has to createuntil the Day of judgment.\"",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ الْفَرَجِ، مَوْلَى بَنِي هَاشِمٍ حَدَّثَنَا مُحَمَّدُ بْنُ الزِّبْرِقَانِ، حَدَّثَنَا مُوسَى، بْنُ عُقْبَةَ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، بِهَذَا الإِسْنَادِ فِي مَعْنَى حَدِيثِ رَبِيعَةَ غَيْرَ أَنَّهُ قَالَ ‏\n\"‏ فَإِنَّ اللَّهَ كَتَبَ مَنْ هُوَ خَالِقٌ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Allah telah menetapkan siapa yang akan diciptakan-Nya hingga Hari Kiamat."
  },
  {
    "id": 10700,
    "hadith_number": 3423,
    "tajuk_hadith": "Ketetapan Mengenai Pemisahan Hubungan Seksual dengan Tawanan Perempuan",
    "perawi_melayu": "Abu Sa'id al-Khudri (رضي الله عنه) meriwayatkan:",
    "english_text": "We took women captives, and we wanted to do 'azl with them. We then asked Allah's Messenger (ﷺ) about it, and he said to us: Verily you do it, verily you do it, verily you do it, but the soul which has to be born until the Day of judgment must be born.",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ الضُّبَعِيُّ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ مَالِكٍ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ مُحَيْرِيزٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّهُ أَخْبَرَهُ قَالَ أَصَبْنَا سَبَايَا فَكُنَّا نَعْزِلُ ثُمَّ سَأَلْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَقَالَ لَنَا ‏\n\"‏ وَإِنَّكُمْ لَتَفْعَلُونَ وَإِنَّكُمْ لَتَفْعَلُونَ وَإِنَّكُمْ لَتَفْعَلُونَ مَا مِنْ نَسَمَةٍ كَائِنَةٍ إِلَى يَوْمِ الْقِيَامَةِ إِلاَّ هِيَ كَائِنَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Kami mengambil tawanan perempuan, dan kami ingin melakukan 'azl dengan mereka. Kemudian kami bertanya kepada Rasulullah (ﷺ) tentang perkara itu, dan baginda bersabda kepada kami: Sesungguhnya kamu akan melakukannya, sesungguhnya kamu akan melakukannya, sesungguhnya kamu akan melakukannya, tetapi jiwa yang ditentukan untuk dilahirkan hingga Hari Kiamat pasti akan dilahirkan."
  },
  {
    "id": 10701,
    "hadith_number": 3424,
    "tajuk_hadith": "Tidak Ada Kerugian Jika Tidak Melakukannya, kerana Ia Sudah Ditakdirkan",
    "perawi_melayu": "Abu Sa'id al-Khudri (رضي الله عنه)",
    "english_text": "Yes. (I heard) Allah's Apostle (ﷺ) as saying: There is no harm if you do not practise it, for it (the birth of the child) is something ordained (by Allah).",
    "arabic_text": "وَحَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا شُعْبَةُ، عَنْ أَنَسِ، بْنِ سِيرِينَ عَنْ مَعْبَدِ بْنِ سِيرِينَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قُلْتُ لَهُ سَمِعْتَهُ مِنْ أَبِي سَعِيدٍ، قَالَ نَعَمْ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ عَلَيْكُمْ أَنْ لاَ تَفْعَلُوا فَإِنَّمَا هُوَ الْقَدَرُ‏\"‏ ‏.‏",
    "malay_translation": "Ya. (Aku mendengar) Rasulullah SAW bersabda: Tidak ada salahnya jika kamu tidak melakukannya, kerana ia (kelahiran anak) adalah sesuatu yang telah ditetapkan (oleh Allah).  "
  },
  {
    "id": 10702,
    "hadith_number": 3425,
    "tajuk_hadith": "Hadis Mengenai Perkara Perbuatan Berpantang (I'zâl)",
    "perawi_melayu": null,
    "english_text": "This hadith is reported on the authority of Abu Sa'id with the same chain of transmitters but with a slight variation (of words).",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وَحَدَّثَنَا يَحْيَى، بْنُ حَبِيبٍ حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، بْنُ مَهْدِيٍّ وَبَهْزٌ قَالُوا جَمِيعًا حَدَّثَنَا شُعْبَةُ، عَنْ أَنَسِ بْنِ سِيرِينَ، بِهَذَا الإِسْنَادِ مِثْلَهُ غَيْرَ أَنَّ فِي حَدِيثِهِمْ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ فِي الْعَزْلِ ‏\n\"‏ لاَ عَلَيْكُمْ أَنْ لاَ تَفْعَلُوا ذَاكُمْ فَإِنَّمَا هُوَ الْقَدَرُ ‏\"‏ ‏.‏ وَفِي رِوَايَةِ بَهْزٍ قَالَ شُعْبَةُ قُلْتُ لَهُ سَمِعْتَهُ مِنْ أَبِي سَعِيدٍ قَالَ نَعَمْ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Abu Sa'id dengan sanad yang sama tetapi dengan sedikit perbezaan dalam perkataan.  Dalam hadis ini, terdapat riwayat yang menyebut bahawa Nabi SAW bersabda berkenaan dengan i'zâl (berpantang): \"Tidak mengapa jika kalian tidak melakukannya, kerana ia hanyalah ketentuan (takdir).\" Dalam riwayat lain, disebutkan bahawa  Syu'bah berkata, \"Saya bertanya kepadanya (Abu Sa'id), 'Engkau mendengarnya daripada Abu Sa'id?' Dia menjawab, 'Ya'."
  },
  {
    "id": 10703,
    "hadith_number": 3426,
    "tajuk_hadith": "Penjelasan Mengenai Hukum ‘Azl dan Takdir Kelahiran",
    "perawi_melayu": "Abu Sa'id al-Khudri (radhiyallahu 'anhu)",
    "english_text": "There is no harm if you do not do that, for it (the birth of the child) is something ordained. Muhammad (one of the narrators) said: (The words) La 'alaykum (there is no harm) implies its Prohibition.",
    "arabic_text": "وَحَدَّثَنِي أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، وَأَبُو كَامِلٍ الْجَحْدَرِيُّ - وَاللَّفْظُ لأَبِي كَامِلٍ - قَالاَ حَدَّثَنَا حَمَّادٌ، - وَهُوَ ابْنُ زَيْدٍ - حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ بِشْرِ بْنِ مَسْعُودٍ، رَدَّهُ إِلَى أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ سُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنِ الْعَزْلِ فَقَالَ ‏\"‏ لاَ عَلَيْكُمْ أَنْ لاَ تَفْعَلُوا ذَاكُمْ فَإِنَّمَا هُوَ الْقَدَرُ ‏\"‏ ‏.‏ قَالَ مُحَمَّدٌ وَقَوْلُهُ ‏\"‏ لاَ عَلَيْكُمْ ‏\"‏ ‏.‏ أَقْرَبُ إِلَى النَّهْىِ ‏.‏",
    "malay_translation": "Tidak mengapa jika kamu tidak melakukannya, kerana kelahiran anak itu adalah sesuatu yang telah ditentukan. Muhammad (salah seorang perawi) berkata: Perkataan \"Laa 'alaykum\" (tidak mengapa) lebih cenderung menunjukkan larangannya."
  },
  {
    "id": 10704,
    "hadith_number": 3427,
    "tajuk_hadith": "Penjelasan Mengenai 'Azl dan Takdir",
    "perawi_melayu": "Abu Sa'id al-Khudri (رضي الله عنه) meriwayatkan",
    "english_text": "Why do you practise it? They said: There is a man whose wife has to suckle the child, and if that person has a sexual intercourse with her (she may conceive) which he does not like, and there is another person who has a slave-girl and he has a sexual intercourse with her, but he does not like her to have conception so that she may not become Umm Walad, whereupon he (the Holy Prophet) said: There is no harm if you do not do that, for that (the birth of the child) is something pre- ordained. Ibn 'Aun said: I made a mention of this hadith to Hasan, and he said: By Allah, (it seems) as if there is upbraiding in it (for 'azl).",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ مُحَمَّدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ بِشْرٍ الأَنْصَارِيِّ، ‏.‏ قَالَ فَرَدَّ الْحَدِيثَ حَتَّى رَدَّهُ إِلَى أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ ذُكِرَ الْعَزْلُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ وَمَا ذَاكُمْ ‏\"‏ ‏.‏ قَالُوا الرَّجُلُ تَكُونُ لَهُ الْمَرْأَةُ تُرْضِعُ فَيُصِيبُ مِنْهَا وَيَكْرَهُ أَنْ تَحْمِلَ مِنْهُ وَالرَّجُلُ تَكُونُ لَهُ الأَمَةُ فَيُصِيبُ مِنْهَا وَيَكْرَهُ أَنْ تَحْمِلَ مِنْهُ ‏.‏ قَالَ ‏\"‏ فَلاَ عَلَيْكُمْ أَنْ لاَ تَفْعَلُوا ذَاكُمْ فَإِنَّمَا هُوَ الْقَدَرُ ‏\"‏ ‏.‏ قَالَ ابْنُ عَوْنٍ فَحَدَّثْتُ بِهِ الْحَسَنَ فَقَالَ وَاللَّهِ لَكَأَنَّ هَذَا زَجْرٌ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Al-Muthanna, menceritakan kepada kami Mu'adz bin Mu'adz, menceritakan kepada kami Ibnu 'Aun, dari Muhammad, dari Abdurrahman bin Bisyr Al-Ansari. Beliau berkata, \"Hadis ini disandarkan sehingga sampai kepada Abu Sa'id al-Khudri. Beliau berkata, \"'Azl telah disebut di hadapan Rasulullah SAW. Baginda bertanya, \"Apakah itu?\" Mereka menjawab, \"Suami yang mempunyai isteri yang menyusu anak, dan dia melakukan hubungan seksual dengannya, tetapi dia tidak mahu isterinya mengandung. Begitu juga dengan seorang yang mempunyai hamba perempuan, dan dia melakukan hubungan seksual dengannya, tetapi dia tidak mahu hamba perempuan itu mengandung untuk mengelakkan daripada menjadi Umm Walad.\" Rasulullah SAW menjawab, \"Tidak mengapa kamu tidak melakukannya, kerana ia adalah takdir.\" Ibnu 'Aun berkata, \"Kemudian aku menceritakan hadis ini kepada Hasan, lalu dia berkata, 'Demi Allah, seolah-olah hadis ini merupakan teguran tentang 'azl.\""
  },
  {
    "id": 10705,
    "hadith_number": 3428,
    "tajuk_hadith": "Hadis Mengenai Hukum 'Azl yang Diriwayatkan oleh Abd al-Rahman bin Bishr",
    "perawi_melayu": "Ibn 'Aun meriwayatkan:",
    "english_text": "I reported to Muhammad on the authority of Ibrahim the hadith reported by 'Abd al-Rahmann b. Bishr (the hadith concerning 'azl), where- upon he said: That (hadith) Abd al-Rahman b. Bishr had narrated to me (also).",
    "arabic_text": "وَحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنِ ابْنِ عَوْنٍ، قَالَ حَدَّثْتُ مُحَمَّدًا، عَنْ إِبْرَاهِيمَ، بِحَدِيثِ عَبْدِ الرَّحْمَنِ بْنِ بِشْرٍ - يَعْنِي حَدِيثَ الْعَزْلِ - فَقَالَ إِيَّاىَ حَدَّثَهُ عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ، ‏.‏",
    "malay_translation": "Saya menyampaikan kepada Muhammad daripada Ibrahim Hadis yang diriwayatkan oleh Abd al-Rahman bin Bishr (tentang hukum 'azl), lalu baginda berkata: Abd al-Rahman bin Bishr telah menceritakannya kepadaku juga."
  },
  {
    "id": 10706,
    "hadith_number": 3429,
    "tajuk_hadith": "Perbincangan Mengenai 'Azl dengan Rasulullah SAW",
    "perawi_melayu": "Ma'bad bin Sirin bertanya kepada Abu Sa'id (رضي الله عنه):",
    "english_text": "Did you hear Allah's Messenger (ﷺ) making a mention of something in regard to al-'azl? Thereupon he said: Yes. The rest (of the hadith is the same)",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا هِشَامٌ، عَنْ مُحَمَّدٍ، عَنْ مَعْبَدِ، بْنِ سِيرِينَ قَالَ قُلْنَا لأَبِي سَعِيدٍ هَلْ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَذْكُرُ فِي الْعَزْلِ شَيْئًا قَالَ نَعَمْ ‏.‏ وَسَاقَ الْحَدِيثَ بِمَعْنَى حَدِيثِ ابْنِ عَوْنٍ إِلَى قَوْلِهِ ‏\n\"‏ الْقَدَرُ ‏\"‏ ‏.‏",
    "malay_translation": "Adakah engkau pernah mendengar Rasulullah SAW menyebut sesuatu berkaitan dengan 'azl? Beliau menjawab: Ya. Selebihnya (hadith ini sama seperti hadith Ibn 'Aun sehingga perkataan \"al-qadar\")"
  },
  {
    "id": 10707,
    "hadith_number": 3430,
    "tajuk_hadith": "Penjelasan Mengenai Perbuatan Al-'Azl dan Penciptaan Manusia",
    "perawi_melayu": "Abu Sa'id al-Khudri (رضي الله عنه) meriwayatkan:",
    "english_text": "Mention was made about al-'azl in the presence of Allah's Messenger (ﷺ), whereupon he said: Why any one of you practises it? (He did not say: One of you should not do it), for there is no created soul, whose creator is not Allah.",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، وَأَحْمَدُ بْنُ عَبْدَةَ، قَالَ ابْنُ عَبْدَةَ أَخْبَرَنَا وَقَالَ، عُبَيْدُ اللَّهِ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، عَنْ قَزَعَةَ، عَنْ أَبِي سَعِيدٍ، الْخُدْرِيِّ قَالَ ذُكِرَ الْعَزْلُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ وَلِمَ يَفْعَلُ ذَلِكَ أَحَدُكُمْ - وَلَمْ يَقُلْ فَلاَ يَفْعَلْ ذَلِكَ أَحَدُكُمْ - فَإِنَّهُ لَيْسَتْ نَفْسٌ مَخْلُوقَةٌ إِلاَّ اللَّهُ خَالِقُهَا ‏\"‏ ‏.‏",
    "malay_translation": "Disebutkan tentang al-'azl di hadapan Rasulullah SAW, lalu baginda bersabda: \"Mengapa salah seorang daripada kamu melakukannya? (Baginda tidak berkata: Janganlah salah seorang daripada kamu melakukannya), kerana sesungguhnya tidak ada satu jiwa pun yang diciptakan melainkan Allah yang menciptakannya.\""
  },
  {
    "id": 10708,
    "hadith_number": 3431,
    "tajuk_hadith": "Penjelasan Mengenai Kejadian Anak dan Takdir Allah",
    "perawi_melayu": "Abu Sa'id al-Khudri (رضي الله عنه)",
    "english_text": "The child does not come from all the liquid (sermen) and when Allah intends to create anything nothing can prevent it (from coming into existence).",
    "arabic_text": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي مُعَاوِيَةُ، - يَعْنِي ابْنَ صَالِحٍ - عَنْ عَلِيِّ بْنِ أَبِي طَلْحَةَ، عَنْ أَبِي الْوَدَّاكِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، سَمِعَهُ يَقُولُ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْعَزْلِ فَقَالَ ‏\n\"‏ مَا مِنْ كُلِّ الْمَاءِ يَكُونُ الْوَلَدُ وَإِذَا أَرَادَ اللَّهُ خَلْقَ شَىْءٍ لَمْ يَمْنَعْهُ شَىْءٌ ‏\"‏ ‏.‏",
    "malay_translation": "Anak tidak datang dari seluruh cecair (mani) dan apabila Allah bermaksud untuk menciptakan sesuatu, tiada apa-apa yang dapat menghalang-Nya (dari menciptakannya)."
  },
  {
    "id": 10709,
    "hadith_number": 3432,
    "tajuk_hadith": "Hadis tentang Perutusan Allah SWT",
    "perawi_melayu": "Daripada Abu Sa'id al-Khudri",
    "english_text": "A hadith like this has been transmitted by Abu Sa'id from Allah's Apostle (ﷺ).",
    "arabic_text": "حَدَّثَنِي أَحْمَدُ بْنُ الْمُنْذِرِ الْبَصْرِيُّ، حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ، حَدَّثَنَا مُعَاوِيَةُ، أَخْبَرَنِي عَلِيُّ بْنُ أَبِي طَلْحَةَ الْهَاشِمِيُّ، عَنْ أَبِي الْوَدَّاكِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
    "malay_translation": "Satu hadis seperti ini telah disampaikan oleh Abu Sa'id daripada Rasulullah SAW."
  },
  {
    "id": 10710,
    "hadith_number": 3433,
    "tajuk_hadith": "Panduan Mengelak Kehamilan dengan 'Azl",
    "perawi_melayu": "Jabir (رضي الله عنه) meriwayatkan bahawa seorang lelaki datang kepada Rasulullah SAW dan berkata:",
    "english_text": "I have a slave-girl who is our servant and she carries water for us and I have intercourse with her, but I do not want her to conceive. He said: Practise 'azl, if you so like, but what is decreed for her will come to her. The person stayed back (for some time) and then came and said: The girl has become pregnant, whereupon he said: I told you what was decreed for her would come to her.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، أَخْبَرَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَجُلاً، أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنَّ لِي جَارِيَةً هِيَ خَادِمُنَا وَسَانِيَتُنَا وَأَنَا أَطُوفُ عَلَيْهَا وَأَنَا أَكْرَهُ أَنْ تَحْمِلَ ‏.‏ فَقَالَ ‏\"‏ اعْزِلْ عَنْهَا إِنْ شِئْتَ فَإِنَّهُ سَيَأْتِيهَا مَا قُدِّرَ لَهَا ‏\"‏ ‏.‏ فَلَبِثَ الرَّجُلُ ثُمَّ أَتَاهُ فَقَالَ إِنَّ الْجَارِيَةَ قَدْ حَبِلَتْ ‏.‏ فَقَالَ ‏\"‏ قَدْ أَخْبَرْتُكَ أَنَّهُ سَيَأْتِيهَا مَا قُدِّرَ لَهَا ‏\"‏ ‏.‏",
    "malay_translation": "Aku mempunyai seorang hamba perempuan yang menjadi pembantu dan pembawa air untuk kami. Aku melakukan hubungan intim dengannya, tetapi aku tidak mahu dia mengandung. Baginda bersabda: Lakukan 'azl jika engkau suka, namun apa yang telah ditetapkan untuknya pasti akan terjadi. Lelaki itu menunggu seketika, kemudian datang dan berkata: Gadis itu telah hamil. Baginda bersabda: Aku telah memberitahu engkau bahawa apa yang ditetapkan untuknya pasti akan terjadi."
  },
  {
    "id": 10711,
    "hadith_number": 3434,
    "tajuk_hadith": "Ketidakmampuan Azl Mencegah Takdir Allah",
    "perawi_melayu": "Jabir bin Abdullah (رضي الله عنه) meriwayatkan bahawa",
    "english_text": "I have a slave-girl and I practise 'azl with her, whereupon Allah's Messenger (ﷺ) said: This cannot prevent that which Allah has decreed. The person then came (after some time) and said: Messenger of Allah, the slave-girl about whom I talked to you has conceived, whereupon Allah's Messeuger (ﷺ) said: I am the servant of Allah and His Messenger.",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الأَشْعَثِيُّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ سَعِيدِ بْنِ حَسَّانَ، عَنْ عُرْوَةَ بْنِ عِيَاضٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ سَأَلَ رَجُلٌ النَّبِيَّ صلى الله عليه وسلم فَقَالَ إِنَّ عِنْدِي جَارِيَةً لِي وَأَنَا أَعْزِلُ عَنْهَا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ ذَلِكَ لَنْ يَمْنَعَ شَيْئًا أَرَادَهُ اللَّهُ ‏\"‏ ‏.‏ قَالَ فَجَاءَ الرَّجُلُ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ الْجَارِيَةَ الَّتِي كُنْتُ ذَكَرْتُهَا لَكَ حَمَلَتْ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَنَا عَبْدُ اللَّهِ وَرَسُولُهُ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan Jabir bin Abdullah (رضي الله عنه) bahawa seorang lelaki bertanya kepada Rasulullah SAW, \"Aku mempunyai seorang hamba perempuan dan aku melakukan 'azl terhadapnya.\"  Rasulullah SAW menjawab, \"Sesungguhnya perbuatan itu tidak akan menghalang apa yang telah ditetapkan oleh Allah.\" Kemudian lelaki itu datang lagi dan berkata, \"Wahai Rasulullah, hamba perempuan yang aku ceritakan kepadaMu telah mengandung.\"  Rasulullah SAW menjawab, \"Aku adalah hamba Allah dan Rasul-Nya.\""
  },
  {
    "id": 10712,
    "hadith_number": 3435,
    "tajuk_hadith": "Kedatangan Seorang Lelaki Kepada Rasulullah SAW",
    "perawi_melayu": "Jabir bin Abdullah (رضي الله عنهما) meriwayatkan:",
    "english_text": "A person came to Allah's Apostle (the rest of the hadith is the same).",
    "arabic_text": "وَحَدَّثَنَا حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا سَعِيدُ بْنُ حَسَّانَ، قَاصُّ أَهْلِ مَكَّةَ أَخْبَرَنِي عُرْوَةُ بْنُ عِيَاضِ بْنِ عَدِيِّ بْنِ الْخِيَارِ النَّوْفَلِيُّ، عَنْ جَابِرِ بْنِ عَبْدِ، اللَّهِ قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم بِمَعْنَى حَدِيثِ سُفْيَانَ ‏.‏",
    "malay_translation": "Seorang lelaki datang kepada Rasulullah SAW (bahagian hadis yang lain adalah sama)."
  },
  {
    "id": 10713,
    "hadith_number": 3436,
    "tajuk_hadith": "Amalan 'Azl semasa Turunnya Al-Quran",
    "perawi_melayu": "Jabir bin Abdullah (رضي الله عنه) meriwayatkan:",
    "english_text": "We used to practise 'azl while the Qur'an was revealed (during the days when the Prophet was alive).",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ، أَبُو بَكْرٍ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ كُنَّا نَعْزِلُ وَالْقُرْآنُ يَنْزِلُ ‏.‏ زَادَ إِسْحَاقُ قَالَ سُفْيَانُ لَوْ كَانَ شَيْئًا يُنْهَى عَنْهُ لَنَهَانَا عَنْهُ الْقُرْآنُ.",
    "malay_translation": "Kami pernah mengamalkan 'azl semasa Al-Quran diturunkan (pada zaman Rasulullah SAW). "
  },
  {
    "id": 10714,
    "hadith_number": 3437,
    "tajuk_hadith": "Amalan 'Azl pada Zaman Rasulullah SAW",
    "perawi_melayu": "Jabir (رضي الله عنه) meriwayatkan:",
    "english_text": "Kami biasa mengamalkan 'azl semasa hayat Rasulullah SAW.",
    "arabic_text": "وَحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ عَطَاءٍ، قَالَ سَمِعْتُ جَابِرًا، يَقُولُ لَقَدْ كُنَّا نَعْزِلُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Kami biasa mengamalkan 'azl semasa hayat Rasulullah SAW."
  },
  {
    "id": 10715,
    "hadith_number": 3438,
    "tajuk_hadith": "Penggunaan Azl pada Masa Rasulullah SAW dan Tiada Larangan",
    "perawi_melayu": "Jabir (رضي الله عنه) meriwayatkan:",
    "english_text": "Kami biasa mengamalkan 'azl semasa hayat Rasulullah SAW. Berita ini sampai kepada Rasulullah SAW, dan Baginda tidak melarang kami.",
    "arabic_text": "وَحَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، حَدَّثَنَا مُعَاذٌ، - يَعْنِي ابْنَ هِشَامٍ - حَدَّثَنِي أَبِي، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ كُنَّا نَعْزِلُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَبَلَغَ ذَلِكَ نَبِيَّ اللَّهِ صلى الله عليه وسلم فَلَمْ يَنْهَنَا ‏.‏",
    "malay_translation": "Kami biasa mengamalkan 'azl semasa hayat Rasulullah SAW.  Berita ini sampai kepada Rasulullah SAW, dan Baginda tidak melarang kami.  Amalan ini diamalkan pada zaman Rasulullah SAW, namun Baginda tidak melarangnya."
  },
  {
    "id": 10716,
    "hadith_number": 3439,
    "tajuk_hadith": "Larangan Seorang Lelaki Menikah atau Memperhambakan Anak yang Dikandung oleh Wanita yang Bukan Isterinya",
    "perawi_melayu": "Abu Darda' (رضي الله عنه) meriwayatkan dari Nabi SAW bahawa baginda melihat seorang wanita hamil di pintu khemah. Baginda berkata:",
    "english_text": "Perhaps he (the man accompanying her) intends to cohabit with her. They said: Yes. Thereupon Allah's Messenger (ﷺ) said: I have decided to curse him with such a curse as may go along with him to his grave. How can he own him (the child to be born) and that is not lawful for him, and how can he take him as a servant for that is not lawful for him?",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ يَزِيدَ بْنِ خُمَيْرٍ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ جُبَيْرٍ، يُحَدِّثُ عَنْ أَبِيهِ، عَنْ أَبِي الدَّرْدَاءِ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ أَتَى بِامْرَأَةٍ مُجِحٍّ عَلَى بَابِ فُسْطَاطٍ فَقَالَ ‏\"‏ لَعَلَّهُ يُرِيدُ أَنْ يُلِمَّ بِهَا ‏\"‏ ‏.‏ فَقَالُوا نَعَمْ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَقَدْ هَمَمْتُ أَنْ أَلْعَنَهُ لَعْنًا يَدْخُلُ مَعَهُ قَبْرَهُ كَيْفَ يُوَرِّثُهُ وَهُوَ لاَ يَحِلُّ لَهُ كَيْفَ يَسْتَخْدِمُهُ وَهُوَ لاَ يَحِلُّ لَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Mungkin dia (lelaki yang bersamanya) berniat untuk berzina dengannya. Mereka berkata: Ya. Lalu Rasulullah SAW bersabda: \"Sungguh aku hampir mahu mengutuknya dengan kutukan yang akan menyertainya ke kuburnya. Bagaimanakah dia boleh mewarisinya sedangkan ia tidak halal baginya? Bagaimanakah dia boleh menjadikannya sebagai hamba sedangkan ia tidak halal baginya?\"."
  },
  {
    "id": 10717,
    "hadith_number": 3440,
    "tajuk_hadith": "Hadis yang disampaikan berdasarkan kepercayaan Shu'ba",
    "perawi_melayu": "",
    "english_text": "A hadith like this has been transmitted on the authority of Shu'ba.",
    "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو دَاوُدَ، جَمِيعًا عَنْ شُعْبَةَ، فِي هَذَا الإِسْنَادِ ‏.‏",
    "malay_translation": "Hadis seumpamanya telah disampaikan dengan kepercayaan daripada Shu'ba."
  },
  {
    "id": 10718,
    "hadith_number": 3441,
    "tajuk_hadith": "Keinginan untuk Melarang Pergaulan dengan Wanita Menyusukan",
    "perawi_melayu": "Judaima binti Wahb al-Asadiyya (Semoga Allah meridainya) meriwayatkan bahawa dia mendengar Rasulullah SAW bersabda:",
    "english_text": "I intended to prohibit cohabitation with a suckling woman until I considered that the Romans and the Persians do it without any injury being caused to their children thereby. (Imam Muslim said: Khalaf reported it from Judamat al-'Asadiyya, but the correct wording is what has been stated by Yahya.)",
    "arabic_text": "وَحَدَّثَنَا خَلَفُ بْنُ هِشَامٍ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، - وَاللَّفْظُ لَهُ - قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ عَنْ جُدَامَةَ بِنْتِ وَهْبٍ الأَسَدِيَّةِ أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لَقَدْ هَمَمْتُ أَنْ أَنْهَى عَنِ الْغِيلَةِ حَتَّى ذَكَرْتُ أَنَّ الرُّومَ وَفَارِسَ يَصْنَعُونَ ذَلِكَ فَلاَ يَضُرُّ أَوْلاَدَهُمْ ‏\"‏ ‏.‏ قَالَ مُسْلِمٌ وَأَمَّا خَلَفٌ فَقَالَ عَنْ جُذَامَةَ الأَسَدِيَّةِ ‏.‏ وَالصَّحِيحُ مَا قَالَهُ يَحْيَى بِالدَّالِ ‏.‏",
    "malay_translation": "Aku hampir mengharamkan pergaulan dengan wanita yang menyusukan anak, hingga aku teringat bahawa orang Rom dan Parsi melakukannya tanpa menjejaskan anak-anak mereka. (Imam Muslim berkata: Khalaf meriwayatkannya daripada Judamat al-Asadiyyah, tetapi lafaz yang sahih ialah apa yang dinyatakan oleh Yahya.)"
  },
  {
    "id": 10719,
    "hadith_number": 3442,
    "tajuk_hadith": "Larangan Pergaulan Dengan Wanita Menyusu dan Hukum Azl",
    "perawi_melayu": "Judama binti Wahb, adik perempuan Ukkasha (Semoga Allah meridainya). meriwayatkan:",
    "english_text": "I went to Allah's Messenger (ﷺ) along with some persons and he was saying: I intended to prohibit cohabitation with the suckling women, but I considered the Greeks and Persians, and saw that they suckle their children and this thing (cohabitation) does not do any harm to them (to the suckling women). Then they asked him about 'azl, whereupon he said. That is the secret (way of) burying alive, and Ubaidullah has made this addition in the hadith transmitted by al-Muqri and that is:\" When the one buried alive is asked.",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ أَبِي عُمَرَ، قَالاَ حَدَّثَنَا الْمُقْرِئُ، حَدَّثَنَا سَعِيدُ، بْنُ أَبِي أَيُّوبَ حَدَّثَنِي أَبُو الأَسْوَدِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، عَنْ جُدَامَةَ بِنْتِ وَهْبٍ، أُخْتِ عُكَّاشَةَ قَالَتْ حَضَرْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي أُنَاسٍ وَهُوَ يَقُولُ ‏\"‏ لَقَدْ هَمَمْتُ أَنْ أَنْهَى عَنِ الْغِيلَةِ فَنَظَرْتُ فِي الرُّومِ وَفَارِسَ فَإِذَا هُمْ يُغِيلُونَ أَوْلاَدَهُمْ فَلاَ يَضُرُّ أَوْلاَدَهُمْ ذَلِكَ شَيْئًا ‏\"‏ ‏.‏ ثُمَّ سَأَلُوهُ عَنِ الْعَزْلِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ذَلِكَ الْوَأْدُ الْخَفِيُّ ‏\"‏ ‏.‏ زَادَ عُبَيْدُ اللَّهِ فِي حَدِيثِهِ عَنِ الْمُقْرِئِ وَهْىَ ‏{‏ وَإِذَا الْمَوْءُودَةُ سُئِلَتْ‏}‏",
    "malay_translation": "Saya telah menghadap Rasulullah SAW bersama beberapa orang. Baginda bersabda: \"Sesungguhnya aku hampir melarang perbuatan mengasuh wanita yang menyusu, tetapi aku merenungkan keadaan orang-orang Rom dan Parsi. Ternyata mereka mengasuh anak-anak mereka dan perbuatan itu tidak mendatangkan bahaya kepada anak-anak mereka. Kemudian mereka bertanya kepada Baginda mengenai 'azl, Baginda menjawab: \"Itulah pembunuhan tersembunyi.\"  Ubaidullah menambahkan dalam hadis yang disampaikan oleh al-Muqri, iaitu: \"Dan apabila wanita yang dibunuh itu ditanya…\"."
  },
  {
    "id": 10720,
    "hadith_number": 3443,
    "tajuk_hadith": "Hadis tentang Azl dan Ghilah (Bersama Wanita Menyusukan)",
    "perawi_melayu": "Judamah binti Wahb al-Asadiyyah (Semoga Allah redha kepadanya) meriwayatkan:",
    "english_text": "I heard Allah's Messenger (ﷺ) saying this. The rest of the hadith is the same concerning 'azl and ghila (cohabitating with a suckling woman), but with a slight variation of words.",
    "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ، حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ الْقُرَشِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، عَنْ جُدَامَةَ بِنْتِ وَهْبٍ، الأَسَدِيَّةِ أَنَّهَا قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏ فَذَكَرَ بِمِثْلِ حَدِيثِ سَعِيدِ بْنِ أَبِي أَيُّوبَ فِي الْعَزْلِ وَالْغِيلَةِ ‏.‏ غَيْرَ أَنَّهُ قَالَ ‏\n\"‏ الْغِيَالِ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda demikian. Bahagian hadis yang lain mengenai ‘azl dan ghilah (berhubungan dengan wanita menyusukan) adalah sama, tetapi dengan sedikit perbezaan perkataan."
  },
  {
    "id": 10721,
    "hadith_number": 3444,
    "tajuk_hadith": "Penjelasan Rasulullah SAW Mengenai Pengasingan (I'zil)",
    "perawi_melayu": "Sa'd bin Abi Waqqas (رضي الله عنه) meriwayatkan bahawa seorang lelaki datang menemui Rasulullah SAW dan berkata:",
    "english_text": "I do 'azi with my wife. Thereupon Allah's Messenger (ﷺ) said: Why do you do that? The person said: I fear harm to her child or her children. Thereupon Allah's Messenger (way peace be upon him) said: If that were harmful it would harm the Persians and the Greeks.",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَزُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لاِبْنِ نُمَيْرٍ - قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمَقْبُرِيُّ، حَدَّثَنَا حَيْوَةُ، حَدَّثَنِي عَيَّاشُ بْنُ عَبَّاسٍ، أَنَّ أَبَا النَّضْرِ، حَدَّثَهُ عَنْ عَامِرِ بْنِ سَعْدٍ، أَنَّ أُسَامَةَ بْنَ زَيْدٍ، أَخْبَرَ وَالِدَهُ، سَعْدَ بْنَ أَبِي وَقَّاصٍ أَنَّ رَجُلاً، جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنِّي أَعْزِلُ عَنِ امْرَأَتِي ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لِمَ تَفْعَلُ ذَلِكَ ‏\"‏ ‏.‏ فَقَالَ الرَّجُلُ أُشْفِقُ عَلَى وَلَدِهَا أَوْ عَلَى أَوْلاَدِهَا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ كَانَ ذَلِكَ ضَارًّا ضَرَّ فَارِسَ وَالرُّومَ ‏\"‏ ‏.‏ وَقَالَ زُهَيْرٌ فِي رِوَايَتِهِ ‏\"‏ إِنْ كَانَ لِذَلِكَ فَلاَ مَا ضَارَ ذَلِكَ فَارِسَ وَلاَ الرُّومَ ‏\"‏.",
    "malay_translation": "Aku melakukan i'zil dengan isteriku. Lalu Rasulullah SAW bertanya, \"Mengapa engkau melakukan demikian?\" Orang itu menjawab, \"Aku bimbang akan mudarat kepada anaknya atau anak-anaknya.\" Lalu Rasulullah SAW bersabda, \"Sekiranya ia mendatangkan mudarat, ia akan mendatangkan mudarat kepada Parsi dan Rom.\" "
  }
]