[
  {
    "id": 14044,
    "hadith_number": 6767,
    "tajuk_hadith": "Kebanyakan penghuni syurga ialah orang miskin, dan kebanyakan penghuni neraka ialah wanita",
    "perawi_melayu": "Usamah bin Zaid meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا \n مُعَاذُ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا الْمُعْتَمِرُ، ح وَحَدَّثَنَا إِسْحَاقُ،\n بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ، كُلُّهُمْ عَنْ سُلَيْمَانَ التَّيْمِيِّ، ح وَحَدَّثَنَا أَبُو كَامِلٍ، فُضَيْلُ بْنُ حُسَيْنٍ\n - وَاللَّفْظُ لَهُ - حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا التَّيْمِيُّ، عَنْ أَبِي عُثْمَانَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ،\n قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ قُمْتُ عَلَى بَابِ الْجَنَّةِ فَإِذَا عَامَّةُ مَنْ دَخَلَهَا\n الْمَسَاكِينُ وَإِذَا أَصْحَابُ الْجَدِّ مَحْبُوسُونَ إِلاَّ أَصْحَابَ النَّارِ فَقَدْ أُمِرَ بِهِمْ إِلَى النَّارِ وَقُمْتُ\n عَلَى بَابِ النَّارِ فَإِذَا عَامَّةُ مَنْ دَخَلَهَا النِّسَاءُ ‏\"‏ ‏.‏",
    "malay_translation": "Aku berdiri di pintu syurga, maka kebanyakan orang yang masuk ke dalamnya adalah orang-orang miskin.  Dan orang-orang kaya ditahan daripada masuk melainkan penghuni neraka, kerana mereka telah diperintahkan untuk masuk ke neraka.  Aku juga berdiri di pintu neraka, maka kebanyakan orang yang masuk ke dalamnya adalah wanita."
  },
  {
    "id": 14045,
    "hadith_number": 6768,
    "tajuk_hadith": "Kebanyakan Ahli Syurga Orang Miskin, Kebanyakan Ahli Neraka Wanita",
    "perawi_melayu": "Ibnu Abbas meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "I had a chance to look into the Paradise and I found that majority of the people was poor and I looked into the Fire and there I found the majority constituted by women.",
    "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ أَيُّوبَ، عَنْ أَبِي رَجَاءٍ،\n الْعُطَارِدِيِّ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ قَالَ مُحَمَّدٌ صلى الله عليه وسلم ‏\n\"‏ اطَّلَعْتُ فِي\n الْجَنَّةِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا الْفُقَرَاءَ وَاطَّلَعْتُ فِي النَّارِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ ‏\"‏ ‏.‏",
    "malay_translation": "Aku telah diberi peluang untuk melihat syurga, dan aku dapati kebanyakan penduduknya adalah orang-orang miskin.  Aku juga telah melihat neraka, dan aku dapati kebanyakan penduduknya adalah wanita."
  },
  {
    "id": 14046,
    "hadith_number": 6769,
    "tajuk_hadith": "Sanad Riwayat Hadis daripada Ibn Abbas",
    "perawi_melayu": "Ishaq bin Ibrahim melalui beberapa perawi lain daripada al-Thaqafi dan Ayyub.",
    "english_text": "This hadith has been narrated on the authority of Ibn 'Abbas through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الثَّقَفِيُّ، أَخْبَرَنَا أَيُّوبُ، بِهَذَا الإِسْنَادِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Ibnu Abbas melalui sanad yang lain.  (Ishaq bin Ibrahim memberitahu kami, al-Thaqafi memberitahu kami, Ayyub memberitahu kami melalui sanad ini.)"
  },
  {
    "id": 14047,
    "hadith_number": 6770,
    "tajuk_hadith": "Nabi Muhammad SAW Menatap Neraka",
    "perawi_melayu": "Ibn Abbas meriwayatkan bahawa Rasulullah SAW menyatakan seperti ini:",
    "english_text": "He looked into the Fire of Hell. The rest of the hadith is the same.",
    "arabic_text": "وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا أَبُو الأَشْهَبِ، حَدَّثَنَا أَبُو رَجَاءٍ، عَنِ ابْنِ عَبَّاسٍ،\n أَنَّ النَّبِيَّ صلى الله عليه وسلم اطَّلَعَ فِي النَّارِ ‏.‏ فَذَكَرَ بِمِثْلِ حَدِيثِ أَيُّوبَ ‏.‏",
    "malay_translation": "Daripada Ibnu Abbas r.a., bahawa Nabi Muhammad SAW telah melihat ke dalam api neraka.  Kemudian baginda menceritakan sesuatu yang serupa dengan hadis Ayyub."
  },
  {
    "id": 14048,
    "hadith_number": 6771,
    "tajuk_hadith": "Hadis Diriwayatkan Melalui Sanad Lain",
    "perawi_melayu": "Abu Kuraib, daripada Abu Usamah, daripada Sa’id bin Abi ‘Aruubah, mendengar daripada Abu Rajaa’, daripada Ibnu ‘Abbas",
    "english_text": "This hadith is narrated likewise through another chain of transmitters.",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، سَمِعَ أَبَا رَجَاءٍ،\n عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَذَكَرَ مِثْلَهُ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan dengan lafaz yang sama melalui sanad yang lain.  (Abu Kuraib meriwayatkan daripada Abu Usamah, daripada Sa’id bin Abi ‘Aruubah, mendengar daripada Abu Rajaa’, daripada Ibnu ‘Abbas, katanya bahawa Rasulullah SAW telah menyebut yang serupa.)"
  },
  {
    "id": 14049,
    "hadith_number": 6772,
    "tajuk_hadith": "Keadaan Wanita di Syurga",
    "perawi_melayu": "Imran bin Husain meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Amongst the inmates of Paradise the women would form a minority.",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي التَّيَّاحِ، قَالَ كَانَ لِمُطَرِّفِ\n بْنِ عَبْدِ اللَّهِ امْرَأَتَانِ فَجَاءَ مِنْ عِنْدِ إِحْدَاهُمَا فَقَالَتِ الأُخْرَى جِئْتَ مِنْ عِنْدِ فُلاَنَةَ فَقَالَ\n جِئْتُ مِنْ عِنْدِ عِمْرَانَ بْنِ حُصَيْنٍ فَحَدَّثَنَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ\n أَقَلَّ سَاكِنِي الْجَنَّةِ النِّسَاءُ ‏\"‏ ‏.‏",
    "malay_translation": "Imran bin Husain meriwayatkan bahawa Rasulullah SAW bersabda:  \"Sesungguhnya penduduk syurga yang paling sedikit ialah kaum wanita.\""
  },
  {
    "id": 14050,
    "hadith_number": 6773,
    "tajuk_hadith": "Hadis Riwayat Mutarrif",
    "perawi_melayu": "Mutarrif (melalui beberapa perawi lain)",
    "english_text": "This hadith has been narrated on the authority of Mutarrif through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْوَلِيدِ بْنِ عَبْدِ الْحَمِيدِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ \n أَبِي التَّيَّاحِ، قَالَ سَمِعْتُ مُطَرِّفًا، يُحَدِّثُ أَنَّهُ كَانَتْ لَهُ امْرَأَتَانِ بِمَعْنَى حَدِيثِ مُعَاذٍ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Mutarrif melalui sanad (rantaian perawi) yang lain.  (وَحَدَّثَنَا مُحَمَّدُ بْنُ الْوَلِيدِ بْنِ عَبْدِ الْحَمِيدِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي التَّيَّاحِ، قَالَ سَمِعْتُ مُطَرِّفًا، يُحَدِّثُ أَنَّهُ كَانَتْ لَهُ امْرَأَتَانِ بِمَعْنَى حَدِيثِ مُعَاذٍ ‏.‏  Ini menunjukkan beberapa orang perawi yang meriwayatkan hadis ini sebelum sampai kepada Mutarrif.)"
  },
  {
    "id": 14051,
    "hadith_number": 6774,
    "tajuk_hadith": "Doa Rasulullah SAW memohon perlindungan daripada Allah SWT",
    "perawi_melayu": "Abdullah bin Umar meriwayatkan bahawa Rasulullah SAW berdoa dengan doa ini:",
    "english_text": "\" O Allah, I seek refuge in Thee from the withdrawal of Thine blessing and the change of Thine protection (from me) and from the sudden wrath of Thine, and from every displeasure of Thine.\"",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْكَرِيمِ أَبُو زُرْعَةَ، حَدَّثَنَا ابْنُ بُكَيْرٍ، حَدَّثَنِي يَعْقُوبُ بْنُ،\n عَبْدِ الرَّحْمَنِ عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ كَانَ\n مِنْ دُعَاءِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ وَتَحَوُّلِ\n عَافِيَتِكَ وَفُجَاءَةِ نِقْمَتِكَ وَجَمِيعِ سَخَطِكَ ‏\"‏ ‏.‏",
    "malay_translation": "Allahumma inni a'uzu bika min zawali ni'matika wa tahuwuli 'afiyatika wa fuja'ati niqmatika wa jamii'i sakhatika.  (Ya Allah, sesungguhnya aku berlindung kepada-Mu daripada hilangnya nikmat-Mu, daripada beralihnya kesejahteraan-Mu, daripada ketibaan azab-Mu secara tiba-tiba, dan daripada segala kemurkaan-Mu.)"
  },
  {
    "id": 14052,
    "hadith_number": 6775,
    "tajuk_hadith": "Fitnah Wanita",
    "perawi_melayu": "Usamah bin Zaid meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "I have not left after me any (chance) of turmoil more injurious to men than the harm done to the men because of women.",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا سُفْيَانُ، وَمُعْتَمِرُ بْنُ سُلَيْمَانَ، عَنْ سُلَيْمَانَ التَّيْمِيِّ،\n عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏\n مَا تَرَكْتُ بَعْدِي فِتْنَةً هِيَ أَضَرُّ عَلَى الرِّجَالِ مِنَ النِّسَاءِ ‏\"‏ ‏.‏",
    "malay_translation": "Aku tidak meninggalkan sebarang fitnah selepas aku yang lebih berbahaya kepada kaum lelaki melainkan daripada kaum wanita."
  },
  {
    "id": 14053,
    "hadith_number": 6776,
    "tajuk_hadith": "Fitnah Wanita",
    "perawi_melayu": "Usamah bin Zaid bin Harithah dan Said bin Zaid bin Amr bin Naufal meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "I have not left after me turmoil for the people but the harm done to men by women.",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، وَسُوَيْدُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، جَمِيعًا\n عَنِ الْمُعْتَمِرِ، قَالَ ابْنُ مُعَاذٍ حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ قَالَ أَبِي حَدَّثَنَا أَبُو عُثْمَانَ،\n عَنْ أُسَامَةَ بْنِ زَيْدِ بْنِ حَارِثَةَ، وَسَعِيدِ بْنِ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ، أَنَّهُمَا حَدَّثَا عَنْ رَسُولِ\n اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ مَا تَرَكْتُ بَعْدِي فِي النَّاسِ فِتْنَةً أَضَرَّ عَلَى الرِّجَالِ\n مِنَ النِّسَاءِ ‏\"‏ ‏.‏",
    "malay_translation": "Aku tidak meninggalkan selepasku bagi umat manusia sebarang fitnah yang lebih memberi mudarat kepada kaum lelaki melainkan daripada kaum wanita."
  },
  {
    "id": 14054,
    "hadith_number": 6777,
    "tajuk_hadith": "Hadis daripada Sulaiman Taimi dengan Sanad yang Sama",
    "perawi_melayu": "Abu Bakar bin Abi Syaibah, dan Ibn Numair; daripada Abu Khalid al-Ahmar; Yahya bin Yahya; daripada Husyaim; Ishaq bin Ibrahim; daripada Jarir; kesemuanya daripada Sulaiman al-Taimi.",
    "english_text": "This hadith has been narrated on the authority of Sulaiman Taimi with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، ح وَحَدَّثَنَا \n يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، كُلُّهُمْ عَنْ \n سُلَيْمَانَ التَّيْمِيِّ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Sulaiman al-Taimi dengan sanad yang sama.  Abu Bakar bin Abi Syaibah dan Ibn Numair berkata:  Kami telah mendengar daripada Abu Khalid al-Ahmar, dan Yahya bin Yahya memberitahu kami daripada Husyaim, dan Ishaq bin Ibrahim memberitahu kami daripada Jarir; kesemua mereka daripada Sulaiman al-Taimi dengan isnad yang serupa."
  },
  {
    "id": 14055,
    "hadith_number": 6778,
    "tajuk_hadith": "Dunia yang Menarik dan Fitnah Wanita",
    "perawi_melayu": "Abu Said al-Khudri meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ،\n عَنْ أَبِي مَسْلَمَةَ، قَالَ سَمِعْتُ أَبَا نَضْرَةَ، يُحَدِّثُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله\n عليه وسلم قَالَ ‏\"‏ إِنَّ الدُّنْيَا حُلْوَةٌ خَضِرَةٌ وَإِنَّ اللَّهَ مُسْتَخْلِفُكُمْ فِيهَا فَيَنْظُرُ كَيْفَ تَعْمَلُونَ\n فَاتَّقُوا الدُّنْيَا وَاتَّقُوا النِّسَاءَ فَإِنَّ أَوَّلَ فِتْنَةِ بَنِي إِسْرَائِيلَ كَانَتْ فِي النِّسَاءِ ‏\"‏ ‏.‏ وَفِي حَدِيثِ\n ابْنِ بَشَّارٍ ‏\"‏ لِيَنْظُرَ كَيْفَ تَعْمَلُونَ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin al-Muthanna dan Muhammad bin Bashshar, keduanya berkata: Telah menceritakan kepada kami Muhammad bin Ja'far, telah menceritakan kepada kami Syu'bah, dari Abu Muslim, dia berkata: Aku mendengar Abu Nadhrah menceritakan dari Abu Said al-Khudri, dari Nabi SAW, baginda bersabda:  \"Sesungguhnya dunia ini indah dan menarik, dan sesungguhnya Allah SWT menjadikan kamu sebagai khalifah di dalamnya, lalu Dia melihat bagaimana amalan kamu. Maka bertakwalah kepada dunia dan bertakwalah kepada wanita, kerana sesungguhnya fitnah pertama Bani Israil adalah dari wanita.\" Dan di dalam hadis riwayat Ibnu Bashshar: \"Supaya Dia melihat bagaimana amalan kamu.\""
  },
  {
    "id": 14056,
    "hadith_number": 6779,
    "tajuk_hadith": "Doa dan Kesabaran Menghadapi Musibah",
    "perawi_melayu": "Abdullah bin Umar meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ إِسْحَاقَ الْمُسَيَّبِيُّ، حَدَّثَنِي أَنَسٌ، - يَعْنِي ابْنَ عِيَاضٍ أَبَا ضَمْرَةَ\n - عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه\n وسلم أَنَّهُ قَالَ ‏\"‏ بَيْنَمَا ثَلاَثَةُ نَفَرٍ يَتَمَشَّوْنَ أَخَذَهُمُ الْمَطَرُ فَأَوَوْا إِلَى غَارٍ فِي جَبَلٍ فَانْحَطَّتْ\n عَلَى فَمِ غَارِهِمْ صَخْرَةٌ مِنَ الْجَبَلِ فَانْطَبَقَتْ عَلَيْهِمْ فَقَالَ بَعْضُهُمْ لِبَعْضٍ انْظُرُوا أَعْمَالاً\n عَمِلْتُمُوهَا صَالِحَةً لِلَّهِ فَادْعُوا اللَّهَ تَعَالَى بِهَا لَعَلَّ اللَّهَ يَفْرُجُهَا عَنْكُمْ ‏.‏ فَقَالَ أَحَدُهُمُ اللَّهُمَّ\n إِنَّهُ كَانَ لِي وَالِدَانِ شَيْخَانِ كَبِيرَانِ وَامْرَأَتِي وَلِيَ صِبْيَةٌ صِغَارٌ أَرْعَى عَلَيْهِمْ فَإِذَا أَرَحْتُ\n عَلَيْهِمْ حَلَبْتُ فَبَدَأْتُ بِوَالِدَىَّ فَسَقَيْتُهُمَا قَبْلَ بَنِيَّ وَأَنَّهُ نَأَى بِي ذَاتَ يَوْمٍ الشَّجَرُ فَلَمْ آتِ\n حَتَّى أَمْسَيْتُ فَوَجَدْتُهُمَا قَدْ نَامَا فَحَلَبْتُ كَمَا كُنْتُ أَحْلُبُ فَجِئْتُ بِالْحِلاَبِ فَقُمْتُ عِنْدَ رُءُوسِهِمَا\n أَكْرَهُ أَنْ أُوقِظَهُمَا مِنْ نَوْمِهِمَا وَأَكْرَهُ أَنْ أَسْقِيَ الصِّبْيَةَ قَبْلَهُمَا وَالصِّبْيَةُ يَتَضَاغَوْنَ عِنْدَ\n قَدَمَىَّ فَلَمْ يَزَلْ ذَلِكَ دَأْبِي وَدَأْبَهُمْ حَتَّى طَلَعَ الْفَجْرُ فَإِنْ كُنْتَ تَعْلَمُ أَنِّي فَعَلْتُ ذَلِكَ ابْتِغَاءَ\n وَجْهِكَ فَافْرُجْ لَنَا مِنْهَا فُرْجَةً نَرَى مِنْهَا السَّمَاءَ ‏.‏ فَفَرَجَ اللَّهُ مِنْهَا فُرْجَةً فَرَأَوْا مِنْهَا السَّمَاءَ\n ‏.‏ وَقَالَ الآخَرُ اللَّهُمَّ إِنَّهُ كَانَتْ لِيَ ابْنَةُ عَمٍّ أَحْبَبْتُهَا كَأَشَدِّ مَا يُحِبُّ الرِّجَالُ النِّسَاءَ وَطَلَبْتُ\n إِلَيْهَا نَفْسَهَا فَأَبَتْ حَتَّى آتِيَهَا بِمِائَةِ دِينَارٍ فَتَعِبْتُ حَتَّى جَمَعْتُ مِائَةَ دِينَارٍ فَجِئْتُهَا بِهَا\n فَلَمَّا وَقَعْتُ بَيْنَ رِجْلَيْهَا قَالَتْ يَا عَبْدَ اللَّهِ اتَّقِ اللَّهَ وَلاَ تَفْتَحِ الْخَاتَمَ إِلاَّ بِحَقِّهِ ‏.‏ فَقُمْتُ عَنْهَا\n فَإِنْ كُنْتَ تَعْلَمُ أَنِّي فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ فَافْرُجْ لَنَا مِنْهَا فُرْجَةً ‏.‏ فَفَرَجَ لَهُمْ ‏.‏ وَقَالَ\n الآخَرُ اللَّهُمَّ إِنِّي كُنْتُ اسْتَأْجَرْتُ أَجِيرًا بِفَرَقِ أَرُزٍّ فَلَمَّا قَضَى عَمَلَهُ قَالَ أَعْطِنِي حَقِّي ‏.‏\n فَعَرَضْتُ عَلَيْهِ فَرَقَهُ فَرَغِبَ عَنْهُ فَلَمْ أَزَلْ أَزْرَعُهُ حَتَّى جَمَعْتُ مِنْهُ بَقَرًا وَرِعَاءَهَا فَجَاءَنِي\n فَقَالَ اتَّقِ اللَّهَ وَلاَ تَظْلِمْنِي حَقِّي ‏.‏ قُلْتُ اذْهَبْ إِلَى تِلْكَ الْبَقَرِ وَرِعَائِهَا فَخُذْهَا ‏.‏ فَقَالَ اتَّقِ\n اللَّهَ وَلاَ تَسْتَهْزِئْ بِي ‏.‏ فَقُلْتُ إِنِّي لاَ أَسْتَهْزِئُ بِكَ خُذْ ذَلِكَ الْبَقَرَ وَرِعَاءَهَا ‏.‏ فَأَخَذَهُ فَذَهَبَ\n بِهِ فَإِنْ كُنْتَ تَعْلَمُ أَنِّي فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ فَافْرُجْ لَنَا مَا بَقِيَ ‏.‏ فَفَرَجَ اللَّهُ مَا بَقِيَ\n ‏.‏",
    "malay_translation": "Dikisahkan bahawa tiga orang lelaki sedang berjalan, lalu mereka ditimpa hujan. Mereka berlindung di dalam sebuah gua di gunung.  Sekeping batu dari gunung itu jatuh dan menutup mulut gua, memerangkap mereka.  Salah seorang daripada mereka berkata kepada yang lain, \"Ingatlah amalan-amalan soleh yang telah kamu lakukan kerana Allah, dan berdoalah kepada Allah SWT agar Dia melepaskan kita daripada kesusahan ini.\"  \n\nKemudian seorang daripada mereka berdoa, \"Ya Allah, aku mempunyai ibu bapa yang sudah tua, isteri dan anak-anak yang kecil. Aku menjaga mereka. Apabila aku pulang, aku memerah susu kambing, biri-biri dan lembu, dan aku memberi minuman kepada ibu bapa aku terlebih dahulu sebelum anak-anakku. Suatu hari, aku perlu pergi jauh mencari makanan ternakan dan baru dapat pulang pada waktu petang.  Aku mendapati ibu bapa aku telah tidur. Aku memerah susu seperti biasa, dan membawanya kepada mereka. Aku berdiri di sisi kepala mereka, enggan mengejutkan mereka daripada tidur, dan aku enggan memberi minum kepada anak-anakku sebelum ibu bapa aku. Anak-anakku menangis di kakiku. Begitulah keadaanku sehingga waktu pagi. Ya Allah, jika Engkau mengetahui bahawa aku melakukan semua ini kerana mencari keredaan-Mu, maka lepaskanlah kami daripada kesusahan ini.\"  Maka Allah SWT membuka sedikit celah sehingga mereka dapat melihat langit.\n\nOrang kedua berkata, \"Ya Allah, aku mempunyai seorang sepupu perempuan yang aku cintai lebih daripada seorang lelaki mencintai wanita. Aku ingin bersetubuh dengannya, tetapi dia menolak kecuali jika aku memberikannya seratus dinar. Aku bersusah payah mengumpulkan seratus dinar dan memberikannya kepadanya.  Apabila aku hendak bersetubuh dengannya, dia berkata, \"Wahai hamba Allah, takutlah kepada Allah dan janganlah membuka meterai kesucian melainkan dengan cara yang halal.\"  Maka aku bangun. Ya Allah, jika Engkau mengetahui bahawa aku melakukan ini kerana mencari keredaan-Mu, lepaskanlah kami daripada kesusahan ini.\"  Maka keadaan mereka menjadi lebih baik sedikit.\n\nOrang ketiga berkata, \"Ya Allah, aku telah mengupah seorang pekerja dengan segancu beras.  Setelah dia selesai bekerja, aku memberikan bayarannya, tetapi dia menolak.  Aku menanam beras itu dan mendapat hasil tuaian yang banyak sehingga aku kaya dan memiliki lembu dan kambing biri-biri. Kemudian dia datang kepadaku dan berkata, \"Takutlah kepada Allah dan janganlah engkau zalimi aku dengan hakku.\"  Aku berkata, \"Ambillah lembu dan kambing biri-biri itu.\" Dia berkata, \"Takutlah kepada Allah dan janganlah engkau mempermainkan aku.\"  Aku berkata, \"Aku tidak mempermainkanmu, ambillah lembu dan kambing biri-biri itu.\"  Maka dia mengambilnya. Ya Allah, jika Engkau mengetahui bahawa aku melakukan ini kerana mencari keredaan-Mu, lepaskanlah kami daripada kesusahan ini.\"  Maka Allah SWT melepaskan mereka daripada kesusahan itu."
  },
  {
    "id": 14057,
    "hadith_number": 6780,
    "tajuk_hadith": "Variasi Perawi dalam Hadith Musa bin 'Uqba",
    "perawi_melayu": "Ishaq bin Mansur, Abd bin Humaid, Abu 'Asim, Ibn Juraij, Musa bin 'Uqba, Suwaid bin Sa'id, Ali bin Mushir, Ubaidullah, Abu Kuraib, Muhammad bin Tarif al-Bajali, Ibn Fudhail, Abi, Waraqah bin Masqalah, Zuhri bin Harb, Hasan al-Hulwani, Ya'qub (Ibn Ibrahim bin Sa'd), Abi, Shalih bin Kaysan, Nafi', Ibn Umar, Nabi Muhammad SAW",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالاَ أَخْبَرَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ،\n جُرَيْجٍ أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ، ح وَحَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ \n عُبَيْدِ اللَّهِ، ح وَحَدَّثَنِي أَبُو كُرَيْبٍ، وَمُحَمَّدُ بْنُ طَرِيفٍ الْبَجَلِيُّ، قَالاَ حَدَّثَنَا ابْنُ فُضَيْلٍ، حَدَّثَنَا \n أَبِي وَرَقَبَةُ بْنُ مَسْقَلَةَ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَحَسَنٌ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالُوا\n حَدَّثَنَا يَعْقُوبُ، - يَعْنُونَ ابْنَ إِبْرَاهِيمَ بْنِ سَعْدٍ - حَدَّثَنَا أَبِي، عَنْ صَالِحِ بْنِ كَيْسَانَ، كُلُّهُمْ\n عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَى حَدِيثِ أَبِي ضَمْرَةَ عَنْ مُوسَى\n بْنِ عُقْبَةَ وَزَادُوا فِي حَدِيثِهِمْ ‏\"‏ وَخَرَجُوا يَمْشُونَ ‏\"‏ ‏.‏ وَفِي حَدِيثِ صَالِحٍ ‏\"‏ يَتَمَاشَوْنَ ‏\"‏\n ‏.‏ إِلاَّ عُبَيْدَ اللَّهِ فَإِنَّ فِي حَدِيثِهِ ‏\"‏ وَخَرَجُوا ‏\"‏ ‏.‏ وَلَمْ يَذْكُرْ بَعْدَهَا شَيْئًا ‏.‏",
    "malay_translation": "Kami telah diberitakan oleh Ishaq bin Mansur dan Abd bin Humaid, mereka berdua berkata: “Telah menceritakan kepada kami Abu Asim daripada Ibnu Juraij. Dia telah menceritakan kepadaku daripada Musa bin 'Uqbah.” Dan telah menceritakan kepadaku Suwaid bin Sa'id, telah menceritakan kepada kami Ali bin Mushir daripada Ubaidullah. Dan telah menceritakan kepadaku Abu Kuraib dan Muhammad bin Tarif al-Bajali, mereka berdua berkata: “Telah menceritakan kepada kami Ibn Fudhail, telah menceritakan kepada kami Abi dan Waraqah bin Masqalah.” Dan telah menceritakan kepadaku Zuhri bin Harb, Hasan al-Hulwani dan Abd bin Humaid, mereka berkata: “Telah menceritakan kepada kami Ya'qub (yang dimaksudkan ialah Ibnu Ibrahim bin Sa'ad), telah menceritakan kepada kami Abi daripada Shalih bin Kaysan. Mereka semua daripada Nafi', daripada Ibnu Umar, daripada Nabi SAW.  Dengan maksud yang sama seperti hadith Abu Dhamrah daripada Musa bin 'Uqbah. Mereka menambahkan dalam hadith mereka, “dan mereka keluar berjalan.” Dan dalam hadith Shalih, “mereka berjalan-jalan.” Kecuali Ubaidullah, kerana dalam hadithnya, “dan mereka keluar.” Dan tidak menyebut apa-apa selepasnya."
  },
  {
    "id": 14058,
    "hadith_number": 6781,
    "tajuk_hadith": "Tiga Orang Musafir dan Ganjaran Amal Soleh",
    "perawi_melayu": "Abdullah bin Umar meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ، وَعَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ بَهْرَامَ، وَأَبُو بَكْرِ\n بْنُ إِسْحَاقَ قَالَ ابْنُ سَهْلٍ حَدَّثَنَا وَقَالَ الآخَرَانِ، أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ \n الزُّهْرِيِّ، أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله\n عليه وسلم يَقُولُ ‏\"‏ انْطَلَقَ ثَلاَثَةُ رَهْطٍ مِمَّنْ كَانَ قَبْلَكُمْ حَتَّى آوَاهُمُ الْمَبِيتُ إِلَى غَارٍ ‏\"‏ ‏.‏\n وَاقْتَصَّ الْحَدِيثَ بِمَعْنَى حَدِيثِ نَافِعٍ عَنِ ابْنِ عُمَرَ غَيْرَ أَنَّهُ قَالَ قَالَ رَجُلٌ مِنْهُمُ ‏\"‏ اللَّهُمَّ\n كَانَ لِي أَبَوَانِ شَيْخَانِ كَبِيرَانِ فَكُنْتُ لاَ أَغْبُقُ قَبْلَهُمَا أَهْلاً وَلاَ مَالاً ‏\"‏ ‏.‏ وَقَالَ ‏\"‏ فَامْتَنَعَتْ\n مِنِّي حَتَّى أَلَمَّتْ بِهَا سَنَةٌ مِنَ السِّنِينَ فَجَاءَتْنِي فَأَعْطَيْتُهَا عِشْرِينَ وَمِائَةَ دِينَارٍ ‏\"‏ ‏.‏ وَقَالَ\n ‏\"‏ فَثَمَّرْتُ أَجْرَهُ حَتَّى كَثُرَتْ مِنْهُ الأَمْوَالُ فَارْتَعَجَتْ ‏\"‏ ‏.‏ وَقَالَ ‏\"‏ فَخَرَجُوا مِنَ الْغَارِ يَمْشُونَ",
    "malay_translation": "Aku telah mendengar daripada Rasulullah SAW bersabda: \"Tiga orang lelaki daripada umat-umat terdahulu telah melakukan perjalanan sehingga mereka terpaksa bermalam di dalam sebuah gua.\"  Kemudian riwayat ini meneruskan dengan maksud hadis yang diriwayatkan oleh Nafi' daripada Ibnu Umar, cuma perbezaannya ialah ia berkata: Seorang daripada mereka berkata: \"Ya Allah, aku mempunyai ibu bapa yang tua, maka aku tidak mengutamakan keluarga dan harta sebelum mereka.\"  Dan seorang lagi berkata: \"Isteriku enggan melayani aku sehingga dia ditimpa kemiskinan pada tahun-tahun yang susah, maka dia datang kepadaku dan aku berikan kepadanya seratus dua puluh dinar.\"  Dan seorang lagi berkata:  \"Aku melaburkan upahnya sehingga harta itu bertambah banyak dan aku memperoleh kekayaan.\"  Dan katanya, maka mereka keluar dari gua dan meneruskan perjalanan."
  }
]
