[
  {
    "id": 10950,
    "hadith_number": 3673,
    "tajuk_hadith": "Larangan Perbuatan Mulamasa dan Munabadha",
    "perawi_melayu": "Abu Hurairah (رضي الله عنه)",
    "english_text": "Abu Huraira (Allah be pleased with him) reported that Allah's Messenger (ﷺ) forbade (two types of transactions) Mulamasa and Munabadha",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ، حَبَّانَ عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُلاَمَسَةِ وَالْمُنَابَذَةِ ‏.‏",
    "malay_translation": "Abu Hurairah (رضي الله عنه) meriwayatkan bahawa Rasulullah SAW melarang (dua jenis transaksi) Mulamasa dan Munabadha."
  },
  {
    "id": 10951,
    "hadith_number": 3674,
    "tajuk_hadith": "Hadis daripada Rasulullah SAW yang Diriwayatkan oleh Abu Hurairah",
    "perawi_melayu": "Abu Hurairah (رضي الله عنه)",
    "english_text": "Abu Huraira (Allah be pleased with him) reported like this from Allah's Messenger (ﷺ).",
    "arabic_text": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، وَابْنُ أَبِي عُمَرَ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ ‏.‏",
    "malay_translation": "Abu Hurairah (Allah merahmati beliau) meriwayatkan sebegini daripada Rasulullah SAW."
  },
  {
    "id": 10952,
    "hadith_number": 3675,
    "tajuk_hadith": "Hadis Daripada Rasulullah SAW Melalui Beberapa Sanad",
    "perawi_melayu": "Abu Hurairah meriwayatkan daripada Rasulullah SAW (ﷺ) sebuah hadis yang serupa dengan ini melalui beberapa sanad.",
    "english_text": "Abu Huraira reported from Allah's Messenger (ﷺ) a hadith like this through another chain cf transmitters.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ ح وَحَدَّثَنَا مُحَمَّدُ، بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، كُلُّهُمْ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan daripada Rasulullah SAW (ﷺ) sebuah hadis yang serupa dengan ini melalui beberapa sanad. Beliau mewarisi hadis ini melalui sanad daripada banyak perawi, termasuk Abu Bakar bin Abi Syaibah, Ibn Numair, Abu Usamah, Muhammad bin Abdullah bin Numair, dan Muhammad bin Al-Muthanna. Setiap perawi tersebut mengambil hadis ini daripada Ubaidillah bin Umar, daripada Khubaib bin Abdul Rahman, daripada Hafs bin `Ashim, daripada Abu Hurairah, daripada Nabi SAW (ﷺ)."
  },
  {
    "id": 10953,
    "hadith_number": 3676,
    "tajuk_hadith": "Hadis yang Sama dengan Ini Dikisahkan Melalui Riwayat Abu Hurairah",
    "perawi_melayu": "",
    "english_text": "A hadith like this has been narrated on the authority of Abu Huraira (Allah be pleased with him) through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ - عَنْ سُهَيْلِ، بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ مِثْلَهُ ‏.‏",
    "malay_translation": "Hadis yang serupa dengan ini telah diriwayatkan melalui jalur perawi yang lain, dengan sanad yang bersambung daripada Abu Hurairah رضي الله عنه."
  },
  {
    "id": 10954,
    "hadith_number": 3677,
    "tajuk_hadith": "Larangan Dua Jenis Perniagaan: Mulamasa dan Munabadha",
    "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
    "english_text": "Two types of transactions have been forbidden (by the Holy Prophet), al-Mlulamasa and al-Munabadha. As far as Mulamasa transaction is concerned, it is that every one of them (the parties entering into transaction) should touch the garment of the other without careful consideration, and al-Munabadha is that every one of them should throw his cloth to the other and one of them should not see the cloth of his friend.",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَمْرُو، بْنُ دِينَارٍ عَنْ عَطَاءِ بْنِ مِينَاءَ، أَنَّهُ سَمِعَهُ يُحَدِّثُ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ نُهِيَ عَنْ بَيْعَتَيْنِ، الْمُلاَمَسَةِ وَالْمُنَابَذَةِ ‏.‏ أَمَّا الْمُلاَمَسَةُ فَأَنْ يَلْمِسَ كُلُّ وَاحِدٍ مِنْهُمَا ثَوْبَ صَاحِبِهِ بِغَيْرِ تَأَمُّلٍ وَالْمُنَابَذَةُ أَنْ يَنْبِذَ كُلُّ وَاحِدٍ مِنْهُمَا ثَوْبَهُ إِلَى الآخَرِ وَلَمْ يَنْظُرْ وَاحِدٌ مِنْهُمَا إِلَى ثَوْبِ صَاحِبِهِ‏.‏",
    "malay_translation": "Dua jenis urus niaga telah dilarang (oleh Nabi SAW), iaitu al-Mulamasa dan al-Munabadha.  Berhubung dengan urus niaga Mulamasa, ia bermaksud setiap pihak dalam urus niaga itu menyentuh pakaian pihak lain tanpa pertimbangan yang teliti. Manakala al-Munabadha pula bermaksud setiap pihak membuang pakaian mereka kepada pihak lain tanpa melihat pakaian pihak lain."
  },
  {
    "id": 10955,
    "hadith_number": 3678,
    "tajuk_hadith": "Larangan Dua Jenis Perniagaan dan Dua Jenis Pakaian",
    "perawi_melayu": "Abu Sa'id al-Khudri (رضي الله عنه) meriwayatkan:",
    "english_text": "Allah's Messenger (ﷺ) forbade us (from), two types of business transactions and two ways of dressing. He forbade Mulamasa and Munabadha in transactions. Mulamasa means the touching of another's garment with his hand, whether at night or by day, without turning it over except this much. Munabadha means that a man throws his garment to another and the other throws his garment, and thus confirming their contract without the inspection of mutual agreement.",
    "arabic_text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، - وَاللَّفْظُ لِحَرْمَلَةَ - قَالاَ أَخْبَرَنَا ابْنُ، وَهْبٍ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عَامِرُ بْنُ سَعْدِ بْنِ أَبِي وَقَّاصٍ، أَنَّ أَبَا سَعِيدٍ، الْخُدْرِيَّ قَالَ نَهَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعَتَيْنِ وَلِبْسَتَيْنِ نَهَى عَنِ الْمُلاَمَسَةِ وَالْمُنَابَذَةِ فِي الْبَيْعِ ‏.‏ وَالْمُلاَمَسَةُ لَمْسُ الرَّجُلِ ثَوْبَ الآخَرِ بِيَدِهِ بِاللَّيْلِ أَوْ بِالنَّهَارِ وَلاَ يَقْلِبُهُ إِلاَّ بِذَلِكَ وَالْمُنَابَذَةُ أَنْ يَنْبِذَ الرَّجُلُ إِلَى الرَّجُلِ بِثَوْبِهِ وَيَنْبِذَ الآخَرُ إِلَيْهِ ثَوْبَهُ وَيَكُونُ ذَلِكَ بَيْعَهُمَا مِنْ غَيْرِ نَظَرٍ وَلاَ تَرَاضٍ ‏.‏",
    "malay_translation": "Pesuruhjaya Allah (ﷺ) melarang kita daripada dua jenis urus niaga dan dua cara berpakaian. Baginda melarang Mulamasa dan Munabadha dalam urusan jual beli. Mulamasa bermaksud menyentuh pakaian orang lain dengan tangan, sama ada pada waktu malam atau siang, tanpa membalikkannya melainkan setakat itu. Munabadha bermaksud seorang lelaki membaling pakaiannya kepada orang lain dan orang lain membaling pakaiannya kepadanya, dengan itu mengesahkan perjanjian mereka tanpa pemeriksaan dan persetujuan bersama."
  },
  {
    "id": 10956,
    "hadith_number": 3679,
    "tajuk_hadith": "Hadis yang Diriwayatkan Melalui Sanad Ibn Shihab",
    "perawi_melayu": "",
    "english_text": "This hadith has been narrated on the authority of Ibn Shihab through the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنِيهِ عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، بِهَذَا الإِسْنَادِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Ibn Shihab melalui sanad yang sama."
  },
  {
    "id": 10957,
    "hadith_number": 3680,
    "tajuk_hadith": "Larangan Perniagaan Berasaskan Permainan Batu dan Perjanjian Tidak Jelas",
    "perawi_melayu": "Abu Hurairah رضي الله عنه",
    "english_text": "Abu Huraira (Allah be pleased with him) reported that Allah's Messenger (ﷺ) forbade a transaction determined by throwing stones, and the type which involves some uncertainty.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، وَيَحْيَى بْنُ سَعِيدٍ، وَأَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، حَدَّثَنِي أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الْحَصَاةِ وَعَنْ بَيْعِ الْغَرَرِ ‏.‏",
    "malay_translation": "Abu Hurairah رضي الله عنه meriwayatkan bahawa Rasulullah SAW melarang urus niaga yang ditentukan melalui permainan batu (pertaruhan) dan jenis urus niaga yang melibatkan ketidakpastian atau keraguan."
  },
  {
    "id": 10958,
    "hadith_number": 3681,
    "tajuk_hadith": "Larangan Perniagaan ‘Habal al-Habala’",
    "perawi_melayu": "",
    "english_text": "'Abdullah (b. 'Umar) (Allah be pleased with him) said that Allah's Messenger (ﷺ) forbade the transaction called habal al-habala.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَمُحَمَّدُ بْنُ رُمْحٍ، قَالاَ أَخْبَرَنَا اللَّيْثُ، ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ، سَعِيدٍ حَدَّثَنَا لَيْثٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ نَهَى عَنْ بَيْعِ حَبَلِ الْحَبَلَةِ ‏.‏",
    "malay_translation": "'Abdullah bin 'Umar (رضي الله عنهما) meriwayatkan bahawa Rasulullah SAW melarang urus niaga yang dikenali sebagai ‘habal al-habala’."
  },
  {
    "id": 10959,
    "hadith_number": 3682,
    "tajuk_hadith": "Larangan Menjual Daging Unta Sampai Masa Tertentu",
    "perawi_melayu": "",
    "english_text": "Ibn 'Umar (Allah be pleased with them) reported that the people of pre-Islamic days used to sell the meat of the slaughtered camel up to habal al-habala. And habal al-habala implies that a she-camel should give birth and then the (born one should grow young) and become pregnant. Allah's Messenger (ﷺ) forbade them that (this transaction).",
    "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، - وَاللَّفْظُ لِزُهَيْرٍ - قَالاَ حَدَّثَنَا يَحْيَى، - وَهُوَ الْقَطَّانُ - عَنْ عُبَيْدِ اللَّهِ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ أَهْلُ الْجَاهِلِيَّةِ يَتَبَايَعُونَ لَحْمَ الْجَزُورِ إِلَى حَبَلِ الْحَبَلَةِ ‏.‏ وَحَبَلُ الْحَبَلَةِ أَنْ تُنْتَجَ النَّاقَةُ ثُمَّ تَحْمِلَ الَّتِي نُتِجَتْ فَنَهَاهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ ‏.‏",
    "malay_translation": "Ibn 'Umar (رضي الله عنهما) meriwayatkan bahawa orang-orang Jahiliyyah dahulu membeli-belah daging unta yang disembelih sehingga tahap *habal al-habala*.  *Habal al-habala* bermaksud seekor unta betina perlu melahirkan anak dan anak unta tersebut perlu membesar dan mengandung. Rasulullah SAW melarang mereka daripada melakukan transaksi itu."
  },
  {
    "id": 10960,
    "hadith_number": 3683,
    "tajuk_hadith": "Larangan Berjual Beli Ketika Orang Lain Sedang Tawar-Menawar",
    "perawi_melayu": "Ibn 'Umar (رضي الله عنهما) meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "One amongst you should not enter into a transaction when another is bargaining.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah seseorang di antara kamu melakukan transaksi jual beli ketika orang lain sedang menawar.  Ini adalah larangan yang disampaikan oleh Rasulullah SAW."
  },
  {
    "id": 10961,
    "hadith_number": 3684,
    "tajuk_hadith": "Larangan Menjual atau Bertunang Ketika Bersamaan dengan Saudara",
    "perawi_melayu": "Ibn 'Umar (رضي الله عنهما) meriwayatkan dari Rasulullah SAW :",
    "english_text": "A person should not enter into a transaction when his brother is already making a transaction and he should not make a proposal of marriage when his brother has already made a proposal except when he gives permission.",
    "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، - وَاللَّفْظُ لِزُهَيْرٍ - قَالاَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَبِعِ الرَّجُلُ عَلَى بَيْعِ أَخِيهِ وَلاَ يَخْطُبْ عَلَى خِطْبَةِ أَخِيهِ إِلاَّ أَنْ يَأْذَنَ لَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Seseorang tidak boleh memasuki transaksi ketika saudaranya sedang melakukan transaksi, dan dia tidak boleh melamar perkahwinan ketika saudaranya sudah melamar, kecuali dengan izinnya."
  },
  {
    "id": 10962,
    "hadith_number": 3685,
    "tajuk_hadith": "Larangan Membeli Dengan Menentang Saudaranya Muslim",
    "perawi_melayu": "Abu Hurairah meriwayatkan Rasulullah SAW bersabda:",
    "english_text": "A Muslim should not purchase (in opposition) to his brother.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَسُمِ الْمُسْلِمُ عَلَى سَوْمِ أَخِيهِ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang Muslim tidak sepatutnya membeli sesuatu dengan cara yang bertentangan dengan saudaranya Muslim."
  },
  {
    "id": 10963,
    "hadith_number": 3686,
    "tajuk_hadith": "Larangan Membeli-belah Atas Kadar Saudara",
    "perawi_melayu": "Abu Hurairah melalui beberapa sanad dengan sedikit perbezaan perkataan.",
    "english_text": "This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters but with a slight change of words.",
    "arabic_text": "وَحَدَّثَنِيهِ أَحْمَدُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، حَدَّثَنِي عَبْدُ الصَّمَدِ، حَدَّثَنَا شُعْبَةُ، عَنِ الْعَلاَءِ، وَسُهَيْلٍ عَنْ أَبِيهِمَا، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ح.\n وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، عَنْ أَبِي، صَالِحٍ عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ح.\n وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيٍّ، - وَهُوَ ابْنُ ثَابِتٍ - عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى أَنْ يَسْتَامَ الرَّجُلُ عَلَى سَوْمِ أَخِيهِ ‏.‏ وَفِي رِوَايَةِ الدَّوْرَقِيِّ عَلَى سِيمَةِ أَخِيهِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Abu Hurairah melalui beberapa rangkaian perawi dengan sedikit perbezaan perkataan.  Rasulullah SAW melarang seseorang daripada membeli-belah dengan menawar harga yang rendah kepada saudaranya. Dalam riwayat al-Dawrqi, larangan ini berkaitan dengan penawaran harga yang rendah bagi barangan saudaranya.  Ini merupakan peringatan penting bagi umat Islam dalam bermuamalat sesama Muslim. Mengutamakan perlakuan baik dan keadilan ketika berurusan dalam jual beli."
  },
  {
    "id": 10964,
    "hadith_number": 3687,
    "tajuk_hadith": "Larangan Berjual Beli yang Tidak Adil dan Penjelasan Tentang Pembeli Ternak",
    "perawi_melayu": "Abu Hurairah meriwayatkan dari Rasulullah SAW bahawa:",
    "english_text": "Do not go out to meet riders to enter into transaction with them; none of you must buy in opposition to another, nor must you bid against one another; a townsman must not sell for a man from the desert, and do not tie up udders of carnels and sheep, and he who buys them after that has been done has two courses open to him: after he has milked them he may keep them if he is pleased with them, or he may return them along with a sit of dates if he is displeased with them.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يُتَلَقَّى الرُّكْبَانُ لِبَيْعٍ وَلاَ يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ وَلاَ تَنَاجَشُوا وَلاَ يَبِعْ حَاضِرٌ لِبَادٍ وَلاَ تُصَرُّوا الإِبِلَ وَالْغَنَمَ فَمَنِ ابْتَاعَهَا بَعْدَ ذَلِكَ فَهُوَ بِخَيْرِ النَّظَرَيْنِ بَعْدَ أَنْ يَحْلُبَهَا فَإِنْ رَضِيَهَا أَمْسَكَهَا وَإِنْ سَخِطَهَا رَدَّهَا وَصَاعًا مِنْ تَمْرٍ ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah pergi menemui pengembala unta untuk berjual beli dengan mereka; janganlah sesiapa di antara kamu membeli dengan cara bersaing atau menawar secara bergaduh; janganlah penduduk bandar menjual kepada penduduk desa, dan janganlah mengikat puting susu unta dan kambing. Barangsiapa membeli ternakan tersebut selepas perbuatan itu, dia mempunyai dua pilihan: setelah memerah susu, dia boleh menyimpannya jika berpuas hati, atau mengembalikannya bersama segenggam kurma jika tidak berpuas hati."
  },
  {
    "id": 10965,
    "hadith_number": 3688,
    "tajuk_hadith": "Larangan Berurus Niaga dan Perbuatan Tidak Berakhlak",
    "perawi_melayu": "",
    "english_text": "Abu Hurairah (Allah SWT redha dengannya) melaporkan bahawa Rasulullah SAW melarang (orang ramai) berurus niaga dengan kafilah (untuk memasuki urusan perniagaan dengan mereka), dan menjual barang oleh penduduk bandar bagi pihak penduduk padang pasir, dan seorang wanita meminta cerai bagi saudarinya (dari suaminya), dan menawar (antara satu sama lain), dan mengikat puting susu (haiwan), dan membeli (barang) bertentangan dengan saudaranya.",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيٍّ، - وَهُوَ ابْنُ ثَابِتٍ - عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ التَّلَقِّي لِلرُّكْبَانِ وَأَنْ يَبِيعَ حَاضِرٌ لِبَادٍ وَأَنْ تَسْأَلَ الْمَرْأَةُ طَلاَقَ أُخْتِهَا وَعَنِ النَّجْشِ وَالتَّصْرِيَةِ وَأَنْ يَسْتَامَ الرَّجُلُ عَلَى سَوْمِ أَخِيهِ ‏.‏",
    "malay_translation": "Rasulullah SAW telah melarang beberapa perbuatan yang boleh membawa kepada ketidakadilan dan kerosakan dalam urusan perniagaan dan kehidupan seharian. Antara larangan itu termasuklah transaksi dengan kafilah, menjual barang oleh penduduk bandar bagi pihak penduduk padang pasir, wanita meminta cerai bagi saudarinya, tawar-menawar yang tidak jujur, mengikat puting susu haiwan dan membeli barang dengan cara yang bertentangan dengan hak saudaranya. Ini menekankan pentingnya kejujuran, keadilan, dan akhlak mulia dalam semua urusan."
  },
  {
    "id": 10966,
    "hadith_number": 3689,
    "tajuk_hadith": "Hadis Ini Diriwayatkan Melalui Rantaian Perawi Lain",
    "perawi_melayu": null,
    "english_text": "This hadith has been narrated through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنِيهِ أَبُو بَكْرِ بْنُ نَافِعٍ، حَدَّثَنَا غُنْدَرٌ، ح وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا وَهْبُ، بْنُ جَرِيرٍ ح وَحَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ، حَدَّثَنَا أَبِي قَالُوا، جَمِيعًا حَدَّثَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ ‏.‏ فِي حَدِيثِ غُنْدَرٍ وَوَهْبٍ نُهِيَ ‏.‏ وَفِي حَدِيثِ عَبْدِ الصَّمَدِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى ‏.‏ بِمِثْلِ حَدِيثِ مُعَاذٍ عَنْ شُعْبَةَ ‏.‏",
    "malay_translation": "Hadis ini telah diriwayatkan melalui rantaian perawi yang lain. Berbagai perawi telah meriwayatkan hadis ini dengan sanad yang berbeza.  Di dalam hadis-hadis tersebut, terdapat larangan.  Rasa larangan yang disampaikan terdapat di dalam hadis Ghandar dan Wahb, dan juga dalam hadis Abd al-Warith bin Abd al-Shamad. Begitu juga di dalam hadis Mu'adz, seperti yang diriwayatkan oleh Syu'bah."
  },
  {
    "id": 10967,
    "hadith_number": 3690,
    "tajuk_hadith": "Larangan Menawar dengan Cara Mengganggu",
    "perawi_melayu": "Ibn Umar (رضي الله عنهما)",
    "english_text": "Ibn Umar (Allah be pleased with them) reported that Allah's Messenger (ﷺ) forbade the outbidding (against another).",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ النَّجْشِ ‏.‏",
    "malay_translation": "Ibn Umar (رضي الله عنهما) meriwayatkan bahawa Rasulullah SAW melarang amalan menawar dengan cara mengganggu atau merampas tawaran orang lain."
  },
  {
    "id": 10968,
    "hadith_number": 3691,
    "tajuk_hadith": "Larangan Mencari Barang Dagangan di Jalan Raya",
    "perawi_melayu": "Ibnu 'Umar (رضي الله عنهما) meriwayatkan bahawa Rasulullah SAW melarang...",
    "english_text": "Do not go out to meet merchandise in the way, (wait) until it is brought into the market. This hadith has been reported on the authority of Ibn Numair but with a slight change of words.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، ح وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي كُلُّهُمْ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى أَنْ تُتَلَقَّى السِّلَعُ حَتَّى تَبْلُغَ الأَسْوَاقَ ‏.‏ وَهَذَا لَفْظُ ابْنِ نُمَيْرٍ ‏.‏ وَقَالَ الآخَرَانِ إِنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ التَّلَقِّي ‏.‏",
    "malay_translation": "Janganlah keluar untuk menemui barang dagangan di jalan, (tunggu) sehingga ia dibawa ke pasar. Hadis ini telah diriwayatkan melalui Ibn Numair tetapi dengan sedikit perubahan perkataan."
  },
  {
    "id": 10969,
    "hadith_number": 3692,
    "tajuk_hadith": "Hadis yang Diriwayatkan Melalui 'Ubaidillah",
    "perawi_melayu": "Muhammad bin Hātim, dan Ishaq bin Manshur, keduanya daripada Ibnu Mahdi, dari Malik, dari Nafi', dari Ibnu Umar, dari Nabi SAW.",
    "english_text": "This hadith has been reported on the authority of 'Ubaidullah.",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، وَإِسْحَاقُ بْنُ مَنْصُورٍ، جَمِيعًا عَنِ ابْنِ مَهْدِيٍّ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ بِمِثْلِ حَدِيثِ ابْنِ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan melalui pengakuan 'Ubaidullah."
  },
  {
    "id": 10970,
    "hadith_number": 3693,
    "tajuk_hadith": "Larangan Bertemu Pedagang di Jalan",
    "perawi_melayu": "Abdullah bin Abi Bakar r.a telah meriwayatkan dari Rasulullah SAW:",
    "english_text": "Do not meet the traders (in the way).",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُبَارَكٍ، عَنِ التَّيْمِيِّ، عَنْ أَبِي، عُثْمَانَ عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ نَهَى عَنْ تَلَقِّي الْبُيُوعِ ‏.‏",
    "malay_translation": "Janganlah bertemu dengan para pedagang (di jalan). "
  },
  {
    "id": 10971,
    "hadith_number": 3694,
    "tajuk_hadith": "Larangan Bertemu dengan Barang Dagangan di Jalan",
    "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Do not meet the merchandise (in the way).",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ هِشَامٍ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُتَلَقَّى الْجَلَبُ ‏.",
    "malay_translation": "Janganlah bertemu dengan barang dagangan di jalan."
  },
  {
    "id": 10972,
    "hadith_number": 3695,
    "tajuk_hadith": "Larangan Bertemu Peniaga di Jalan dan Transaksi Perniagaan",
    "perawi_melayu": "Abu Hurairah (Semoga Allah Redha kepadanya) meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Do not meet the merchant in the way and enter into business transaction with him, and whoever meets him and buys from him (and in case it is done, see) that when the owner of (merchandise) comes into the market (and finds that he has been paid less price) he has the option (to declare the transaction null and void).",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا هِشَامُ بْنُ سُلَيْمَانَ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي هِشَامٌ، الْقُرْدُوسِيُّ عَنِ ابْنِ سِيرِينَ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَلَقَّوُا الْجَلَبَ ‏.‏ فَمَنْ تَلَقَّاهُ فَاشْتَرَى مِنْهُ فَإِذَا أَتَى سَيِّدُهُ السُّوقَ فَهُوَ بِالْخِيَارِ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah kamu bertemu dengan pedagang di jalan raya dan melakukan transaksi perniagaan dengannya. Barangsiapa yang bertemu dan membeli daripadanya, maka jika pemilik barangan itu datang ke pasar dan mendapati harga yang dibayar kurang daripada harga yang sepatutnya, dia mempunyai pilihan untuk membatalkan transaksi tersebut."
  },
  {
    "id": 10973,
    "hadith_number": 3696,
    "tajuk_hadith": "Larangan Penjual Bandar Memanfaatkan Kejahilan Pedagang Luar Bandar",
    "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan dari Rasulullah SAW:",
    "english_text": "The townsman'should not sell for a man from the desert (with a view to taking advantage of his ignorance of the market conditions of the city). And Zuhair reported from the Prophet (ﷺ) that he forbade the townsman to sell on behalf of the man from the desert.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالُوا حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَبِعْ حَاضِرٌ لِبَادٍ ‏\"‏ ‏.‏ وَقَالَ زُهَيْرٌ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ نَهَى أَنْ يَبِيعَ حَاضِرٌ لِبَادٍ ‏.",
    "malay_translation": "Orang bandar tidak sepatutnya menjual kepada orang luar bandar dengan mengambil kesempatan daripada kejahilan mereka tentang keadaan pasaran bandar. Dan Zuhair meriwayatkan daripada Nabi SAW bahawa Baginda melarang orang bandar daripada menjual bagi pihak orang luar bandar."
  },
  {
    "id": 10974,
    "hadith_number": 3697,
    "tajuk_hadith": "Larangan Menjual Beli Antara Pedagang dan Pedagang Luar Bandar",
    "perawi_melayu": "Ibn 'Abbas (رضي الله عنهما) meriwayatkan dari Rasulullah SAW :",
    "english_text": "The riders (carrying merchandise) should not be met in the way, and townsman should not sell for a man of the desert. The narrator reported. I said to Ibn 'Abbas: What do these words really imply-\" The townsman for the man of the desert\"? He said: That he should work as a broker on his behalf.",
    "arabic_text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالاَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ تُتَلَقَّى الرُّكْبَانُ وَأَنْ يَبِيعَ حَاضِرٌ لِبَادٍ ‏.‏ قَالَ فَقُلْتُ لاِبْنِ عَبَّاسٍ مَا قَوْلُهُ حَاضِرٌ لِبَادٍ قَالَ لاَ يَكُنْ لَهُ سِمْسَارًا.",
    "malay_translation": "Para pengembara (yang membawa barang dagangan) tidak seharusnya dijumpai di jalan, dan orang bandar tidak seharusnya menjual untuk orang luar bandar.  Perawi meriwayatkan. Saya bertanya kepada Ibn 'Abbas, \"Apakah maksud sebenar perkataan 'orang bandar untuk orang luar bandar'?\" Beliau menjawab, \"Supaya dia bertindak sebagai ejen bagi pihak orang luar bandar itu.\""
  },
  {
    "id": 10975,
    "hadith_number": 3698,
    "tajuk_hadith": "Larangan Penjual Bandar Terhadap Pedagang Luar Bandar dan Kerjasama dalam Penghidupan",
    "perawi_melayu": "Jabir (رضي الله عنه) meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The townsman should not sell for a man from the desert, leave the people alone, Allah will give them provision from one another. Yahya reported it with a slight change of words.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، ح.\n وَحَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ يَبِعْ حَاضِرٌ لِبَادٍ دَعُوا النَّاسَ يَرْزُقِ اللَّهُ بَعْضَهُمْ مِنْ بَعْضٍ‏\"‏ ‏.‏ غَيْرَ أَنَّ فِي رِوَايَةِ يَحْيَى ‏\"‏ يُرْزَقُ ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah penduduk bandar (orang kota) menjual kepada penduduk luar bandar (orang desa). Biarkan manusia berurusan antara mereka sendiri. Allah akan memberi rezeki kepada mereka antara satu sama lain. Yahya meriwayatkan dengan sedikit perbezaan lafaz."
  },
  {
    "id": 10976,
    "hadith_number": 3699,
    "tajuk_hadith": "Hadis Sama yang Seiras daripada Rasulullah SAW melalui Rantaian Perawi yang Berbeza",
    "perawi_melayu": "",
    "english_text": "Jabir (Allah SWT bersemarah dengannya) meriwayatkan hadis yang serupa daripada Rasulullah SAW melalui rantaian perawi yang lain.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
    "malay_translation": "Jabir (Allah SWT merahmati beliau) meriwayatkan satu hadis yang serupa daripada Rasulullah SAW melalui sebuah rantaian perawi yang berbeza. "
  },
  {
    "id": 10977,
    "hadith_number": 3700,
    "tajuk_hadith": "Larangan Penjual Beli antara Orang Bandar dan Orang Desa",
    "perawi_melayu": "Anas bin Malik r.a. meriwayatkan:",
    "english_text": "Kami dilarang (oleh Nabi SAW) orang bandar menjual kepada orang desa, sekalipun dia saudaranya atau bapanya.",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ يُونُسَ، عَنِ ابْنِ سِيرِينَ، عَنْ أَنَسِ، بْنِ مَالِكٍ قَالَ نُهِينَا أَنْ يَبِيعَ، حَاضِرٌ لِبَادٍ ‏.‏ وَإِنْ كَانَ أَخَاهُ أَوْ أَبَاهُ ‏.‏",
    "malay_translation": "Kami telah dilarang (oleh Nabi SAW) menjual antara orang bandar kepada orang desa, sekalipun dia adalah saudara atau bapanya.  Ini menunjukkan pentingnya keadilan dan kejujuran dalam urusan perdagangan, serta menghormati keperluan orang-orang desa."
  },
  {
    "id": 10978,
    "hadith_number": 3701,
    "tajuk_hadith": "Larangan Penjual Warganegara Bandar kepada Orang Badwi",
    "perawi_melayu": "Anas bin Malik (رضي الله عنه) berkata:",
    "english_text": "We were forbidden that a townsman should sell for a man of the desert.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنِ ابْنِ عَوْنٍ، عَنْ مُحَمَّدٍ، عَنْ أَنَسٍ،ح ‏.‏\n وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا مُعَاذٌ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ مُحَمَّدٍ، قَالَ قَالَ أَنَسُ بْنُ مَالِكٍ نُهِينَا عَنْ أَنْ يَبِيعَ حَاضِرٌ لِبَادٍ ‏.‏",
    "malay_translation": "Kami dilarang menjual seorang penduduk bandar kepada orang badwi."
  },
  {
    "id": 10979,
    "hadith_number": 3702,
    "tajuk_hadith": "Panduan Membeli Kambing dan Memulangkannya Jika Tidak Puas dengan Susunya",
    "perawi_melayu": "Abu Hurairah (Semoga Allah meridainya) meriwayatkan daripada Rasulullah SAW:",
    "english_text": "He who bought a goat having its udder tied up should go back with it, milk it, and, if he is satisfied with its milk, he should retair it, otherwise he should return it along with a sa' of dates.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ، عَنْ مُوسَى بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنِ اشْتَرَى شَاةً مُصَرَّاةً فَلْيَنْقَلِبْ بِهَا فَلْيَحْلُبْهَا فَإِنْ رَضِيَ حِلاَبَهَا أَمْسَكَهَا وَإِلاَّ رَدَّهَا وَمَعَهَا صَاعٌ مِنْ تَمْرٍ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa membeli kambing betina yang susunya diikat, hendaklah dia kembali dengannya, memerahnya, dan jika dia berpuas hati dengan susunya, hendaklah dia menyimpannya, jika tidak, hendaklah dia mengembalikannya bersama satu sa' kurma."
  },
  {
    "id": 10980,
    "hadith_number": 3703,
    "tajuk_hadith": "Kebebasan Memilih dalam Pembelian Kambing yang Dipasang Puting Susu",
    "perawi_melayu": "Abu Hurairah (radhiyallahu 'anhu) meriwayatkan daripada Rasulullah SAW:",
    "english_text": "He who buys a goat with its udder tied up has the option to retain the goat if he so desires or return it within three days, and in case he returns it he should do so along with a sa' of dates.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ - عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنِ ابْتَاعَ شَاةً مُصَرَّاةً فَهُوَ فِيهَا بِالْخِيَارِ ثَلاَثَةَ أَيَّامٍ إِنْ شَاءَ أَمْسَكَهَا وَإِنْ شَاءَ رَدَّهَا وَرَدَّ مَعَهَا صَاعًا مِنْ تَمْرٍ ‏\"‏ ‏.‏",
    "malay_translation": "Sesiapa yang membeli seekor kambing betina yang puting susunya diikat, mempunyai pilihan untuk menyimpan kambing tersebut jika dia mahu atau mengembalikannya dalam tempoh tiga hari. Sekiranya dia mengembalikannya, dia perlu mengembalikannya bersama satu sa' kurma."
  },
  {
    "id": 10981,
    "hadith_number": 3704,
    "tajuk_hadith": "Hak Pilihan Pembeli Kambing Yang Puting Susunya Terikat",
    "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan daripada Rasulullah SAW bahawa:",
    "english_text": "lie who buys a goat having its udder tied up has the option to return it within three days. If he returns it he should pay a sa' of dates. Wheat is not essential.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ جَبَلَةَ بْنِ أَبِي رَوَّادٍ، حَدَّثَنَا أَبُو عَامِرٍ، - يَعْنِي الْعَقَدِيَّ - حَدَّثَنَا قُرَّةُ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنِ اشْتَرَى شَاةً مُصَرَّاةً فَهُوَ بِالْخِيَارِ ثَلاَثَةَ أَيَّامٍ فَإِنْ رَدَّهَا رَدَّ مَعَهَا صَاعًا مِنْ طَعَامٍ لاَ سَمْرَاءَ ‏\"‏‏.‏",
    "malay_translation": "Sesiapa yang membeli kambing yang putingnya diikat, dia mempunyai pilihan untuk mengembalikannya dalam tempoh tiga hari. Jika dia mengembalikannya, dia perlu membayar satu sa' kurma. Gandum bukanlah syarat yang diperlukan."
  },
  {
    "id": 10982,
    "hadith_number": 3705,
    "tajuk_hadith": "Peraturan Membeli Kambing Yang Susunya Diikat",
    "perawi_melayu": "Abu Hurairah (Semoga Allah meridainya) meriwayatkan dari Rasulullah SAW:",
    "english_text": "He who buys a goat having its udder tied up has two courses left for him. He may retain it, and if he desires may return it along with a sa' of dates and not wheat.",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنِ اشْتَرَى شَاةً مُصَرَّاةً فَهُوَ بِخَيْرِ النَّظَرَيْنِ إِنْ شَاءَ أَمْسَكَهَا وَإِنْ شَاءَ رَدَّهَا وَصَاعًا مِنْ تَمْرٍ لاَ سَمْرَاءَ ‏\"‏ ‏.‏",
    "malay_translation": "Siapa yang membeli kambing betina yang susunya diikat, dia mempunyai dua pilihan. Dia boleh menyimpannya, atau jika dia mahu, dia boleh mengembalikannya bersama satu sa' kurma, bukan gandum."
  },
  {
    "id": 10983,
    "hadith_number": 3706,
    "tajuk_hadith": "Pilihan Pembeli Kambing",
    "perawi_melayu": "Dikisahkan oleh Ayyub melalui sanad yang sama, tetapi dengan perkataan yang sedikit berbeza:",
    "english_text": "\" Dia yang membeli seekor kambing mempunyai pilihan…\"",
    "arabic_text": "وَحَدَّثَنَاهُ ابْنُ أَبِي عُمَرَ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، عَنْ أَيُّوبَ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّهُ قَالَ ‏\n\"‏ مَنِ اشْتَرَى مِنَ الْغَنَمِ فَهُوَ بِالْخِيَارِ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa yang membeli kambing, maka ia mempunyai pilihan."
  },
  {
    "id": 10984,
    "hadith_number": 3707,
    "tajuk_hadith": "Kebebasan Memilih dalam Perjanjian Perdagangan Unta Betina yang Diikat Susunya",
    "perawi_melayu": "Hammam bin Munabbih berkata:",
    "english_text": "Out of the ahadith which Abu Huraira (Allah be pleased with him) reported to us from Allah's Messenger (ﷺ) one is this that Allah's Messenger (ﷺ) said: If one among you buys a she-camel having its udder tied up he has the two options for him after milking it either (to retain it) or return it with a sa' of dates.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا مَا أَحَدُكُمُ اشْتَرَى لِقْحَةً مُصَرَّاةً أَوْ شَاةً مُصَرَّاةً فَهُوَ بِخَيْرِ النَّظَرَيْنِ بَعْدَ أَنْ يَحْلُبَهَا إِمَّا هِيَ وَإِلاَّ فَلْيَرُدَّهَا وَصَاعًا مِنْ تَمْرٍ ‏\"‏ ‏.‏",
    "malay_translation": "Di antara hadis yang diriwayatkan oleh Abu Hurairah (رضي الله عنه) daripada Rasulullah (ﷺ) adalah sabdanya: \"Jika salah seorang daripada kamu membeli unta betina yang teteknya diikat, maka dia mempunyai dua pilihan setelah memerahnya; sama ada mengekalkannya atau mengembalikannya bersama satu sa' kurma.\""
  },
  {
    "id": 10985,
    "hadith_number": 3708,
    "tajuk_hadith": "Larangan Menjual Barang Beli Sebelum Menerima Barang",
    "perawi_melayu": "Ibn Abbas (رضي الله عنه) meriwayatkan dari Rasulullah SAW :",
    "english_text": "He who buys foodgrain should not sell it until he has taken possession of it.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، ح وَحَدَّثَنَا أَبُو الرَّبِيعِ الْعَتَكِيُّ، وَقُتَيْبَةُ، قَالاَ حَدَّثَنَا حَمَّادٌ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنِ ابْتَاعَ طَعَامًا فَلاَ يَبِعْهُ حَتَّى يَسْتَوْفِيَهُ ‏\"‏ ‏.‏ قَالَ ابْنُ عَبَّاسٍ وَأَحْسِبُ كُلَّ شَىْءٍ مِثْلَهُ ‏.‏",
    "malay_translation": "Barangsiapa yang membeli barang makanan, janganlah menjualnya sehingga ia telah menerimanya sepenuhnya.  Ibn Abbas berkata, dan aku mengira setiap barang sama nilainya."
  },
  {
    "id": 10986,
    "hadith_number": 3709,
    "tajuk_hadith": "Hadits Yang Dikisahkan Melalui Rantaian Perawi yang Sama",
    "perawi_melayu": "",
    "english_text": "A hadith like this has been narrated through the same chain of transmitters.",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، وَأَحْمَدُ بْنُ عَبْدَةَ، قَالاَ حَدَّثَنَا سُفْيَانُ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ، أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، - وَهُوَ الثَّوْرِيُّ - كِلاَهُمَا عَنْ عَمْرِو، بْنِ دِينَارٍ بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏",
    "malay_translation": "Sebuah hadits yang serupa telah diriwayatkan melalui rantaian perawi yang sama."
  },
  {
    "id": 10987,
    "hadith_number": 3710,
    "tajuk_hadith": "Larangan Menjual Makanan yang Belum Dimiliki",
    "perawi_melayu": "Ibnu Abbas (رضي الله عنه) meriwayatkan dari Rasulullah SAW:",
    "english_text": "He who buys food-rain should not sell it until he has taken possession of it. Ibn Abbas (Allah be pleased with them) said: I regard everything like food (so far as this principle is concerned).",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ ابْنُ رَافِعٍ حَدَّثَنَا وَقَالَ الآخَرَانِ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنِ ابْتَاعَ طَعَامًا فَلاَ يَبِعْهُ حَتَّى يَقْبِضَهُ ‏\"‏ ‏.‏ قَالَ ابْنُ عَبَّاسٍ وَأَحْسِبُ كُلَّ شَىْءٍ بِمَنْزِلَةِ الطَّعَامِ ‏.‏",
    "malay_translation": "Siapa yang membeli makanan, maka janganlah dia menjualnya sebelum ia memilikinya. Ibnu Abbas (رضي الله عنه) berkata: Aku menganggap semua benda seperti makanan (sejauh prinsip ini berkenaan)."
  },
  {
    "id": 10988,
    "hadith_number": 3711,
    "tajuk_hadith": "Ketetapan Penjual beli Makanan dan Timbangan",
    "perawi_melayu": "Ibn Abbas (رضي الله عنهما) meriwayatkan daripada Rasulullah SAW",
    "english_text": "He who buys foodgrain should not sell it, until he has weighed it (and then taken possession of it). I (Tawus) said to Ibn Abbas (Allah be pleased with them): Why is it so? Thereupon he said: Don't you see that they (the people) sell foodgrains against gold for the stipulated time. Abu Kuraib did not make any mention of the stipulated time.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنِ ابْتَاعَ طَعَامًا فَلاَ يَبِعْهُ حَتَّى يَكْتَالَهُ ‏\"‏ ‏.‏ فَقُلْتُ لاِبْنِ عَبَّاسٍ لِمَ فَقَالَ أَلاَ تَرَاهُمْ يَتَبَايَعُونَ بِالذَّهَبِ وَالطَّعَامُ مُرْجَأٌ وَلَمْ يَقُلْ أَبُو كُرَيْبٍ مُرْجَأٌ ‏.‏",
    "malay_translation": "Sesiapa yang membeli makanan kering, janganlah menjualnya sehingga diukur terlebih dahulu (dan kemudian diambil hak miliknya). Saya (Tawus) bertanya kepada Ibnu Abbas (redhiallahu anhuma), \"Mengapa demikian?\" Jawab beliau, \"Tidakkah engkau melihat mereka (orang ramai) berjual beli makanan kering dengan emas untuk tempoh masa tertentu? Abu Kuraib tidak menyebut tentang tempoh tersebut.\""
  },
  {
    "id": 10989,
    "hadith_number": 3712,
    "tajuk_hadith": "Larangan Menjual Makanan Sebelum Menerimanya Penuh",
    "perawi_melayu": "Ibnu Umar (رضي الله عنهما) meriwayatkan dari Rasulullah SAW bahawa:",
    "english_text": "He who buys foodgrain should not sell it until he has taken full possession of it.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، حَدَّثَنَا مَالِكٌ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنِ ابْتَاعَ طَعَامًا فَلاَ يَبِعْهُ حَتَّى يَسْتَوْفِيَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa membeli makanan kering, maka janganlah dia menjualnya sebelum dia menerimanya sepenuhnya."
  },
  {
    "id": 10990,
    "hadith_number": 3713,
    "tajuk_hadith": "Pengiriman Makanan oleh Rasulullah SAW Sebelum Dijual",
    "perawi_melayu": "Ibn Umar (رضي الله عنه) meriwayatkan:",
    "english_text": "We used to buy foodgrains during the lifetime of Allah's Messenger (ﷺ). He (the Holy Prophet) would then send to us one who commanded us to take them (the foodgrains) to a place other than the one where we had bought them before we sold it.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كُنَّا فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم نَبْتَاعُ الطَّعَامَ فَيَبْعَثُ عَلَيْنَا مَنْ يَأْمُرُنَا بِانْتِقَالِهِ مِنَ الْمَكَانِ الَّذِي ابْتَعْنَاهُ فِيهِ إِلَى مَكَانٍ سِوَاهُ قَبْلَ أَنْ نَبِيعَهُ ‏.‏",
    "malay_translation": "Kami biasa membeli barang-barang makanan semasa hayat Rasulullah SAW. Baginda (Nabi SAW) kemudiannya menghantar seseorang untuk memerintahkan kami memindahkannya dari tempat pembelian ke tempat lain sebelum menjualnya."
  },
  {
    "id": 10991,
    "hadith_number": 3714,
    "tajuk_hadith": "Larangan Menjual Barang Runcit sebelum Dimiliki",
    "perawi_melayu": "Ibnu Umar (رضي الله عنهما) meriwayatkan daripada Rasulullah SAW:",
    "english_text": "He who buys foodgrain should not sell that before taking possession of it. He (the narrator) said: We used to buy foodgrain from the caravans in bulk, but Allah's Messenger (ﷺ) forbade us to re-sell that until we had shifted it to some other place.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ عُبَيْدِ اللَّهِ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ، عُمَرَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنِ اشْتَرَى طَعَامًا فَلاَ يَبِعْهُ حَتَّى يَسْتَوْفِيَهُ‏\"‏ ‏.‏\n قَالَ وَكُنَّا نَشْتَرِي الطَّعَامَ مِنَ الرُّكْبَانِ جِزَافًا فَنَهَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ نَبِيعَهُ حَتَّى نَنْقُلَهُ مِنْ مَكَانِهِ ‏.",
    "malay_translation": "Barangsiapa membeli makanan kering, jangan menjualnya sebelum memilikinya sepenuhnya. (Perawi berkata): Kami biasa membeli makanan kering secara pukal daripada kafilah, tetapi Rasulullah SAW melarang kami menjualnya semula sehingga kami memindahkannya ke tempat lain."
  },
  {
    "id": 10992,
    "hadith_number": 3715,
    "tajuk_hadith": "Larangan Menjual Makanan sebelum Menerima Keseluruhannya",
    "perawi_melayu": "Ibnu 'Umar (رضي الله عنهما) meriwayatkan dari Rasulullah SAW bahawa:",
    "english_text": "He who bought foodgrain should not sell it until he had taken full possession of it (after measuring it).",
    "arabic_text": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، حَدَّثَنِي عُمَرُ بْنُ مُحَمَّدٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنِ اشْتَرَى طَعَامًا فَلاَ يَبِعْهُ حَتَّى يَسْتَوْفِيَهُ وَيَقْبِضَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa membeli makanan kering, maka janganlah dia menjualnya sebelum dia menerimanya sepenuhnya (selepas diukur). "
  },
  {
    "id": 10993,
    "hadith_number": 3716,
    "tajuk_hadith": "Larangan Menjual Makanan Sebelum Menerimanya",
    "perawi_melayu": "Ibnu Umar (رضي الله عنهما) meriwayatkan dari Rasulullah SAW,",
    "english_text": "He who bought foodgrain should not sell it until he had taken possession of it.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَعَلِيُّ بْنُ حُجْرٍ، قَالَ يَحْيَى أَخْبَرَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، وَقَالَ عَلِيٌّ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّهُ سَمِعَ ابْنَ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنِ ابْتَاعَ طَعَامًا فَلاَ يَبِعْهُ حَتَّى يَقْبِضَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa membeli makanan, maka janganlah ia menjualnya sehingga ia menerimanya."
  },
  {
    "id": 10994,
    "hadith_number": 3717,
    "tajuk_hadith": "Larangan Menjual Makanan Secara Borong Tanpa Mengalihkannya",
    "perawi_melayu": "Ibn 'Umar (رضي الله عنهما)",
    "english_text": "Ibn 'Umar (Allah be pleased with them) reported that they were beaten during the lifetime of Allah's Messenger (ﷺ) if they had bought foodgrains in bulk and then sold them in the spot without shifting them (to some other place).",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُمْ كَانُوا يُضْرَبُونَ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذَا اشْتَرَوْا طَعَامًا جِزَافًا أَنْ يَبِيعُوهُ فِي مَكَانِهِ حَتَّى يُحَوِّلُوهُ ‏.‏",
    "malay_translation": "Ibn 'Umar (رضي الله عنهما) meriwayatkan bahawa mereka akan disebat pada zaman Rasulullah SAW sekiranya mereka membeli makanan dalam jumlah besar dan menjualnya di tempat yang sama tanpa mengalihkannya ke tempat lain."
  },
  {
    "id": 10995,
    "hadith_number": 3718,
    "tajuk_hadith": "Larangan Menjual Makanan Grosir di Tempat Pembelian",
    "perawi_melayu": "Salim bin Abdullah (رضي الله عنهما) meriwayatkan daripada bapanya yang berkata:",
    "english_text": "I saw people being beaten during the lifetime of Allah's Messenger (ﷺ) in case they bought the foodgrain in bulk, and then sold them at that spot before taking it to their places. This hadith is narrated on the authority of 'Ubaidullah b. Abdullah b. 'Umar through another chain of transmitters (and the words are):\" His father (Ibn 'Umar) used to buy foodgrains in bulk and then carried them to his people.\"",
    "arabic_text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ أَبَاهُ، قَالَ قَدْ رَأَيْتُ النَّاسَ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذَا ابْتَاعُوا الطَّعَامَ جِزَافًا يُضْرَبُونَ فِي أَنْ يَبِيعُوهُ فِي مَكَانِهِمْ وَذَلِكَ حَتَّى يُئْوُوهُ إِلَى رِحَالِهِمْ ‏.‏ قَالَ ابْنُ شِهَابٍ وَحَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ أَبَاهُ كَانَ يَشْتَرِي الطَّعَامَ جِزَافًا فَيَحْمِلُهُ إِلَى أَهْلِهِ ‏.‏",
    "malay_translation": "Telah diceritakan kepada saya oleh Harmalah bin Yahya, beliau berkata: Telah menceritakan kepada kami Ibnu Wahb, beliau berkata: Telah diberitahu kepadaku oleh Yunus, daripada Ibnu Syihab, beliau berkata: Telah diberitahu kepadaku oleh Salim bin Abdullah, bahawa bapanya berkata: \"Aku telah melihat orang-orang di zaman Rasulullah SAW, jika mereka membeli makanan dalam kuantiti banyak, mereka akan dipukul jika menjualnya di tempat pembelian sebelum membawanya pulang. Ini diriwayatkan melalui sanad lain, dan kata-kata (yang diriwayatkan) adalah: \"Bapanya (Ibnu Umar) biasa membeli makanan dalam kuantiti banyak, kemudian membawanya kepada keluarganya.\""
  },
  {
    "id": 10996,
    "hadith_number": 3719,
    "tajuk_hadith": "Larangan Menjual Makanan Tanpa Mengukur",
    "perawi_melayu": "Abu Hurairah (radhiyallahu 'anhu) meriwayatkan Rasulullah SAW bersabda:",
    "english_text": "He who bought foodgrain should not sell it until he had measured it. In the narration of Abu Bakr there the word is Ibta' instead of Ishtara.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ وَأَبُو كُرَيْبٍ قَالُوا حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ، عَنِ الضَّحَّاكِ بْنِ عُثْمَانَ، عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ أَبِي، هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنِ اشْتَرَى طَعَامًا فَلاَ يَبِعْهُ حَتَّى يَكْتَالَهُ ‏\"‏ ‏.‏ وَفِي رِوَايَةِ أَبِي بَكْرٍ ‏\"‏ مَنِ ابْتَاعَ ‏\"‏ ‏.‏",
    "malay_translation": "Siapa yang membeli makanan kering, janganlah dia menjualnya sehingga diukur. Dalam riwayat Abu Bakar, perkataan itu ialah \"ibta'\" bukannya \"ishtara\"."
  },
  {
    "id": 10997,
    "hadith_number": 3720,
    "tajuk_hadith": "Larangan Perniagaan Riba dan Pertukaran Barang dengan Dokumen Tanpa Pemilikan Penuh",
    "perawi_melayu": "Abu Hurairah رضي الله عنه",
    "english_text": "Have you made lawful the transactions involving interest? Thereupon Marwan said: I have not done that. Thereupon Abu Huraira (ﷺ) said: You have made lawful the transactions with the help of documents only, whereas Allah's Messenger (ﷺ) forbade the transaction of foodgrains until full possession is taken of them. Marwan then addressed the people and forbade them to enter into such transactions (as are done with the help of documents). Sulaiman said: I saw the sentinels snatching (these documents) from the people.",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْحَارِثِ الْمَخْزُومِيُّ، حَدَّثَنَا الضَّحَّاكُ، بْنُ عُثْمَانَ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ لِمَرْوَانَ أَحْلَلْتَ بَيْعَ الرِّبَا ‏.‏ فَقَالَ مَرْوَانُ مَا فَعَلْتُ ‏.‏ فَقَالَ أَبُو هُرَيْرَةَ أَحْلَلْتَ بَيْعَ الصِّكَاكِ وَقَدْ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الطَّعَامِ حَتَّى يُسْتَوْفَى ‏.‏ قَالَ فَخَطَبَ مَرْوَانُ النَّاسَ فَنَهَى عَنْ بَيْعِهَا ‏.‏ قَالَ سُلَيْمَانُ فَنَظَرْتُ إِلَى حَرَسٍ يَأْخُذُونَهَا مِنْ أَيْدِي النَّاسِ ‏.‏",
    "malay_translation": "Telah diceritakan bahawa Abu Hurairah رضي الله عنه telah bertanya kepada Marwan, \"Adakah engkau menghalalkan transaksi riba?\" Marwan menjawab, \"Tidak.\" Lalu Abu Hurairah berkata, \"Engkau telah menghalalkan pertukaran barang menggunakan dokumen sahaja, padahal Rasulullah SAW telah melarang pertukaran barang makanan sehingga pemilikan penuh diperolehi. Selepas itu, Marwan berucap kepada orang ramai, melarang mereka daripada melakukan transaksi sedemikian. Sulaiman pula berkata, \"Aku melihat pengawal-pengawal merampas dokumen-dokumen tersebut daripada orang ramai.\""
  },
  {
    "id": 10998,
    "hadith_number": 3721,
    "tajuk_hadith": "Jangan Menjual Makanan Sebelum Menerimanya",
    "perawi_melayu": "Jabir bin Abdullah (رضي الله عنهما) meriwayatkan daripada Rasulullah SAW:",
    "english_text": "When you purchase foodgrains, do not sell them until you have taken possession of them.",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا رَوْحٌ، حَدَّثَنَا ابْنُ جُرَيْجٍ، حَدَّثَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِذَا ابْتَعْتَ طَعَامًا فَلاَ تَبِعْهُ حَتَّى تَسْتَوْفِيَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila kamu membeli makanan kering, jangan menjualnya sehingga engkau memilikinya sepenuhnya."
  },
  {
    "id": 10999,
    "hadith_number": 3722,
    "tajuk_hadith": "Larangan Menjual Untaian Kurma yang Tidak Diketahui Sukatannya",
    "perawi_melayu": "",
    "english_text": "Jabir b. Abdullah (Allah SWT berilah keredhaan kepada mereka) dilaporkan berkata bahawa Rasulullah SAW melarang menjual timbunan kurma yang beratnya tidak diketahui mengikut sukatan kurma yang diketahui.",
    "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ أَخْبَرَنَا ابْنُ وَهْبٍ، حَدَّثَنِي ابْنُ جُرَيْجٍ، أَنَّ أَبَا الزُّبَيْرِ، أَخْبَرَهُ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الصُّبْرَةِ مِنَ التَّمْرِ لاَ يُعْلَمُ مَكِيلَتُهَا بِالْكَيْلِ الْمُسَمَّى مِنَ التَّمْرِ ‏.‏",
    "malay_translation": "Jabir bin Abdullah (Semoga Allah SWT merahmati mereka) dilaporkan berkata bahawa Rasulullah SAW melarang menjual timbunan kurma yang beratnya tidak diketahui, mengikut sukatan kurma yang diketahui.  Rasulullah SAW melarang penjualan sebegini.  Ini kerana, tidak diketahui sukatan atau timbangan yang tepat bagi timbunan kurma tersebut berbanding sukatan kurma yang biasa."
  },
  {
    "id": 11000,
    "hadith_number": 3723,
    "tajuk_hadith": "Hadis Mengenai Larangan, Tidak Disebutkan Tarikh Kurma",
    "perawi_melayu": "Jabir bin Abdullah (رضي الله عنهما)",
    "english_text": "Hadis ini diriwayatkan daripada Jabir bin Abdullah (Allah SWT bersetuju dengan mereka) tetapi dengan variasi yang tidak menyebut tarikh (yang didapati) di penghujung hadis sebelum ini.",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ بِمِثْلِهِ غَيْرَ أَنَّهُ لَمْ يَذْكُرْ مِنَ التَّمْرِ ‏.‏ فِي آخِرِ الْحَدِيثِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Jabir bin Abdullah (رضي الله عنهما).  Ia menceritakan tentang larangan, tetapi berbeza dengan hadis sebelumnya di mana ia tidak menyebut tentang tarikh atau perincian berkaitan kurma di penghujung hadis."
  },
  {
    "id": 11001,
    "hadith_number": 3724,
    "tajuk_hadith": "Hak Kedua Pihak dalam Perniagaan Sehingga Belum Berpisah",
    "perawi_melayu": "Ibn 'Umar (رضي الله عنهما) meriwayatkan daripada Rasulullah SAW :",
    "english_text": "Both parties in a business transaction have the right to annul it so long as they have not separated; except in transactions which have been made subject to the right of parties to annul them.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْبَيِّعَانِ كُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ عَلَى صَاحِبِهِ مَا لَمْ يَتَفَرَّقَا إِلاَّ بَيْعَ الْخِيَارِ ‏\"‏ ‏.‏",
    "malay_translation": "Kedua-dua pihak dalam urus niaga mempunyai hak untuk membatalkannya selagi mereka belum berpisah; kecuali dalam urus niaga yang telah ditentukan bahawa pihak-pihak mempunyai hak untuk membatalkannya."
  },
  {
    "id": 11002,
    "hadith_number": 3725,
    "tajuk_hadith": "Hadis yang Diriwayatkan melalui Beberapa Sanad daripada Ibn 'Umar",
    "perawi_melayu": "Ibn 'Umar (رضي الله عنهما)",
    "english_text": "This hadith has been narrated on the authority of Ibn 'Umar (Allah be pleased with them) through another chain of transmitters.",
    "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا يَحْيَى، وَهُوَ الْقَطَّانُ ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي كُلُّهُمْ، عَنْ عُبَيْدِ، اللَّهِ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ح.\n وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَعَلِيُّ بْنُ حُجْرٍ، قَالاَ حَدَّثَنَا إِسْمَاعِيلُ، ح وَحَدَّثَنَا أَبُو الرَّبِيعِ وَأَبُو كَامِلٍ قَالاَ حَدَّثَنَا حَمَّادٌ، - وَهُوَ ابْنُ زَيْدٍ - جَمِيعًا عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ح.\n وَحَدَّثَنَا ابْنُ الْمُثَنَّى، وَابْنُ أَبِي عُمَرَ، قَالاَ حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ سَمِعْتُ يَحْيَى، بْنُ سَعِيدٍ ح وَحَدَّثَنَا ابْنُ رَافِعٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنَا الضَّحَّاكُ، كِلاَهُمَا عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ نَحْوَ حَدِيثِ مَالِكٍ عَنْ نَافِعٍ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan dengan beberapa sanad daripada Ibn 'Umar (رضي الله عنهما).  Hadis ini disampaikan melalui pelbagai rangkaian perawi yang berbeza."
  },
  {
    "id": 11003,
    "hadith_number": 3726,
    "tajuk_hadith": "Perjanjian Dagang dan Pilihan Tawar",
    "perawi_melayu": "Ibn 'Umar (رضي الله عنه) meriwayatkan dari Rasulullah SAW, bahawa:",
    "english_text": "When two persons enter into a transaction, each of them has the right to annul it so long as they are not separated and are together (at the place of transaction) ; or if one gives the other the right (to annul the transaction) But if one gives the other the option, the transaction is made on this condition (i. e. one has the right to annul the transaction), it becomes binding. And if they are separated after they have made the bargain and none of them annulled it, even then the transaction is binding.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ إِذَا تَبَايَعَ الرَّجُلاَنِ فَكُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا وَكَانَا جَمِيعًا أَوْ يُخَيِّرُ أَحَدُهُمَا الآخَرَ فَإِنْ خَيَّرَ أَحَدُهُمَا الآخَرَ فَتَبَايَعَا عَلَى ذَلِكَ فَقَدْ وَجَبَ الْبَيْعُ وَإِنْ تَفَرَّقَا بَعْدَ أَنْ تَبَايَعَا وَلَمْ يَتْرُكْ وَاحِدٌ مِنْهُمَا الْبَيْعَ فَقَدْ وَجَبَ الْبَيْعُ ‏\"‏ ‏.",
    "malay_translation": "Apabila dua orang melakukan transaksi perniagaan, masing-masing mempunyai hak untuk membatalkannya selagi mereka belum berpisah dan berada bersama di tempat transaksi itu; atau jika salah seorang memberikan hak (untuk membatalkan transaksi) kepada yang lain. Tetapi jika salah seorang memberikan pilihan kepada yang lain, transaksi itu dibuat dengan syarat (iaitu satu pihak mempunyai hak untuk membatalkan transaksi), maka transaksi itu sah. Dan jika mereka berpisah selepas bersetuju dan tidak ada yang membatalkan perjanjian itu, maka transaksi itu tetap sah."
  },
  {
    "id": 11004,
    "hadith_number": 3727,
    "tajuk_hadith": "Kebenaran Pembatalan Perjanjian Jual Beli dalam Islam",
    "perawi_melayu": "Abdullah bin Umar (رضي الله عنهما) meriwayatkan dari Rasulullah SAW:",
    "english_text": "When two persons enter into a transac. tion, each one of them has the right to annul it so long as they are not separated, or their transaction gives one another (as a condition) the right of annulling, and if their transaction, has the right of annulling it the transaction becomes binding. Ibn Abi Umar made this addition that whenever he (Ibn Umar) entered into a transaction with a person with the intention of not breaking it, he walked a while and then returned to him.",
    "arabic_text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَابْنُ أَبِي عُمَرَ، كِلاَهُمَا عَنْ سُفْيَانَ، - قَالَ زُهَيْرٌ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، - عَنِ ابْنِ جُرَيْجٍ، قَالَ أَمْلَى عَلَىَّ نَافِعٌ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا تَبَايَعَ الْمُتَبَايِعَانِ بِالْبَيْعِ فَكُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ مِنْ بَيْعِهِ مَا لَمْ يَتَفَرَّقَا أَوْ يَكُونُ بَيْعُهُمَا عَنْ خِيَارٍ فَإِذَا كَانَ بَيْعُهُمَا عَنْ خِيَارٍ فَقَدْ وَجَبَ ‏\"‏ ‏.‏ زَادَ ابْنُ أَبِي عُمَرَ فِي رِوَايَتِهِ قَالَ نَافِعٌ فَكَانَ إِذَا بَايَعَ رَجُلاً فَأَرَادَ أَنْ لاَ يُقِيلَهُ قَامَ فَمَشَى هُنَيَّةً ثُمَّ رَجَعَ إِلَيْهِ ‏.‏",
    "malay_translation": "Apabila dua orang bertransaksi, masing-masing mempunyai hak untuk membatalkannya selama mereka belum berpisah, atau perjanjian jual beli mereka menetapkan hak untuk membatalkan. Jika perjanjian tersebut telah menetapkan hak untuk dibatalkan, maka perjanjian tersebut menjadi sah.  Ibnu Abi Umar menambah, bahawa tatkala beliau (Ibnu Umar) membuat perjanjian dengan seseorang dengan niat untuk tidak membatalkannya, beliau akan berjalan seketika lalu kembali kepadanya."
  },
  {
    "id": 11005,
    "hadith_number": 3728,
    "tajuk_hadith": "Perjanjian Dagangan Tidak Sah Sehingga Pemisahan Kedua-dua Pihak Kecuali Pilihan Perkara",
    "perawi_melayu": "Ibn Umar melaporkan Rasulullah SAW bersabda:",
    "english_text": "There is no transaction between two persons entering a transaction until they separate, but only when there is an option to annul it.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، و يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ قَالَ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّهُ سَمِعَ ابْنَ، عُمَرَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ كُلُّ بَيِّعَيْنِ لاَ بَيْعَ بَيْنَهُمَا حَتَّى يَتَفَرَّقَا إِلاَّ بَيْعُ الْخِيَارِ ‏\"‏ ‏.‏",
    "malay_translation": "Tiada perjanjian jual beli antara dua pihak yang memasuki transaksi sehingga mereka berpisah, kecuali jual beli yang mempunyai pilihan untuk membatalkannya."
  },
  {
    "id": 11006,
    "hadith_number": 3729,
    "tajuk_hadith": "Hakim bin Hazim dan Kebaikan dalam Perjanjian Dagangan",
    "perawi_melayu": "Hakim bin Hizam meriwayatkan dari Rasulullah SAW",
    "english_text": "Both parties in a business transaction have the right to annul it so long as they have not separated; and if they speak the truth and make everything clear they will be blessed in their transaction; but if they tell a lie and conceal anything the blessing on their transaction will be blotted out.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ شُعْبَةَ، ح وَحَدَّثَنَا عَمْرُو بْنُ، عَلِيٍّ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالاَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَبِي الْخَلِيلِ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، عَنْ حَكِيمِ بْنِ حِزَامٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا فَإِنْ صَدَقَا وَبَيَّنَا بُورِكَ لَهُمَا فِي بَيْعِهِمَا وَإِنْ كَذَبَا وَكَتَمَا مُحِقَتْ بَرَكَةُ بَيْعِهِمَا ‏\"‏ ‏.‏",
    "malay_translation": "Kedua-dua pihak dalam urus niaga mempunyai hak untuk membatalkannya selagi mereka belum berpisah; dan jika mereka jujur dan menjelaskan segala perkara, maka keberkatan akan melimpah dalam urus niaga mereka; tetapi jika mereka berdusta dan menyembunyikan sesuatu, maka keberkatan dalam urus niaga mereka akan hilang."
  },
  {
    "id": 11007,
    "hadith_number": 3730,
    "tajuk_hadith": "Kelahiran dan Umur Panjang Hakim bin Hizam di Dalam Kaabah",
    "perawi_melayu": "Hadits ini diriwayatkan oleh Hakim bin Hizam (Imam Muslim) yang berkata:",
    "english_text": "Hakim b. Hizam was born inside the Ka'ba and lived for one hundred and twenty years.",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا هَمَّامٌ، عَنْ أَبِي التَّيَّاحِ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ الْحَارِثِ، يُحَدِّثُ عَنْ حَكِيمِ بْنِ حِزَامٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ بِمِثْلِهِ ‏.‏ قَالَ مُسْلِمُ بْنُ الْحَجَّاجِ وُلِدَ حَكِيمُ بْنُ حِزَامٍ فِي جَوْفِ الْكَعْبَةِ وَعَاشَ مِائَةً وَعِشْرِينَ سَنَةً ‏.‏",
    "malay_translation": "Hakim bin Hizam dilahirkan di dalam Kaabah dan hidup selama seratus dua puluh tahun."
  },
  {
    "id": 11008,
    "hadith_number": 3731,
    "tajuk_hadith": "Menghindari Penipuan dalam Perniagaan",
    "perawi_melayu": "Abdullah bin Dinar meriwayatkan bahawa beliau mendengar Ibn 'Umar (رضي الله عنهما) berkata:",
    "english_text": "A man mentioned to the Messenger of Allah (ﷺ) that he was deceived in a business transaction, whereupon Allah's Messenger (ﷺ) said: When you enter into a transaction, say: There should be no attempt to deceive.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالَ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّهُ سَمِعَ ابْنَ، عُمَرَ يَقُولُ ذَكَرَ رَجُلٌ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ يُخْدَعُ فِي الْبُيُوعِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ بَايَعْتَ فَقُلْ لاَ خِلاَبَةَ ‏\"‏ ‏.‏ فَكَانَ إِذَا بَايَعَ يَقُولُ لاَ خِيَابَةَ‏.‏",
    "malay_translation": "Seorang lelaki memberitahu Rasulullah SAW bahawa beliau telah ditipu dalam suatu urusan perniagaan.  Lalu Rasulullah SAW bersabda: \"Apabila kamu berjual beli, ucapkanlah: Semoga tiada penipuan.\"  Oleh itu, apabila mereka berjual beli, mereka akan mengucapkan: \"Semoga tiada penipuan.\""
  },
  {
    "id": 11009,
    "hadith_number": 3732,
    "tajuk_hadith": "Larangan Penipuan dalam Perjanjian",
    "perawi_melayu": "Hadis ini diriwayatkan daripada 'Abdullah bin Dinar dengan sanad yang sama, tetapi kata-kata ini tidak terdapat di dalamnya.  Apabila seseorang membuat perjanjian, hendaklah dia berkata:",
    "english_text": "There should be no attempt to deceive.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ، الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، كِلاَهُمَا عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، بِهَذَا الإِسْنَادِ مِثْلَهُ وَلَيْسَ فِي حَدِيثِهِمَا فَكَانَ إِذَا بَايَعَ يَقُولُ لاَ خِيَابَةَ ‏.‏",
    "malay_translation": "Tidak boleh ada percubaan untuk menipu. \" Apabila seseorang melakukan perjanjian, hendaklah dia berkata: \"Tiada kerugian.\""
  },
  {
    "id": 11010,
    "hadith_number": 3733,
    "tajuk_hadith": "Larangan Menjual Buah-buahan Sebelum Matang Sempurna",
    "perawi_melayu": "Ibn 'Umar (رضي الله عنهما)",
    "english_text": "Ibn 'Umar (Allah be pleased with them) reported that Allah's Messenger (ﷺ) forbade the sale of fruits until they were clearly in good condition, he forbade it both to the seller and to the buyer.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الثَّمَرِ حَتَّى يَبْدُوَ صَلاَحُهَا نَهَى الْبَائِعَ وَالْمُبْتَاعَ.",
    "malay_translation": "Ibn 'Umar (رضي الله عنهما) meriwayatkan bahawa Rasulullah SAW melarang penjualan buah-buahan sehingga keadaannya jelas baik. Beliau melarang perkara ini kepada penjual dan pembeli."
  },
  {
    "id": 11011,
    "hadith_number": 3734,
    "tajuk_hadith": "Hadis yang Sama Daripada Ibn 'Umar",
    "perawi_melayu": "",
    "english_text": "Another chain on the authority of Ibn 'Umar narrated the same as the above hadith.",
    "arabic_text": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
    "malay_translation": "Rantai sanad yang lain daripada Ibn 'Umar meriwayatkan hadis yang sama seperti hadis di atas."
  },
  {
    "id": 11012,
    "hadith_number": 3735,
    "tajuk_hadith": "Larangan Menjual Kurma dan Padi Sebelum Matang",
    "perawi_melayu": "Ibn 'Umar (Semoga Allah meridainya)",
    "english_text": "Ibn 'Umar (Allah be pleased with them) reported that Allah's Messenger (ﷺ) forbade the sale of palm-trees (i. e. their trults) until the dates began to ripen, and ears of corn until they were white and were safe from blight. He forbade the seller and the buyer.",
    "arabic_text": "وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ النَّخْلِ حَتَّى يَزْهُوَ وَعَنِ السُّنْبُلِ حَتَّى يَبْيَضَّ وَيَأْمَنَ الْعَاهَةَ نَهَى الْبَائِعَ وَالْمُشْتَرِيَ ‏.‏",
    "malay_translation": "Ibn 'Umar (Semoga Allah meridainya) meriwayatkan bahawa Rasulullah SAW melarang menjual pokok kurma (iaitu buahnya) sehingga buah kurma itu masak, dan larangan menjual padi sehingga bulir padi itu putih dan terhindar dari penyakit. Baginda melarang penjual dan pembeli."
  },
  {
    "id": 11013,
    "hadith_number": 3736,
    "tajuk_hadith": "Jangan Membeli Buah Hingga Keadaannya Baik dan Bebas Dari Penyakit",
    "perawi_melayu": "Ibn Umar (رضي الله عنهما) meriwayatkan Rasulullah SAW bersabda:",
    "english_text": "Do not buy fruit until its good condition becomes clear, and (the danger) of blight is no more. He said: Its good condition becoming clear implies that it becomes red or yellow.",
    "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَبْتَاعُوا الثَّمَرَ حَتَّى يَبْدُوَ صَلاَحُهُ وَتَذْهَبَ عَنْهُ الآفَةُ قَالَ يَبْدُوَ صَلاَحُهُ حُمْرَتُهُ وَصُفْرَتُهُ ‏.‏",
    "malay_translation": "Janganlah membeli buah-buahan sehingga keadaan baiknya jelas dan penyakitnya hilang. Beliau (maksudnya Ibn Umar) berkata: Keadaan baik yang jelas itu bererti warnanya menjadi merah atau kuning."
  },
  {
    "id": 11014,
    "hadith_number": 3737,
    "tajuk_hadith": "Perihal Penentuan Kesahihan Hadis Berdasarkan Rantaian Perawi",
    "perawi_melayu": "",
    "english_text": "This hadith is reported or the authority of Yahya with the same chain of transmitters up to \"until its good condition becomes clear,\" but lie did not mention what follows (these words).",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ أَبِي عُمَرَ، قَالاَ حَدَّثَنَا عَبْدُ الْوَهَّابِ، عَنْ يَحْيَى، بِهَذَا الإِسْنَادِ حَتَّى يَبْدُوَ صَلاَحُهُ لَمْ يَذْكُرْ مَا بَعْدَهُ",
    "malay_translation": "Hadis ini diriwayatkan daripada Yahya dengan sanad yang sama sehingga sampai pada perkataan \"sehingga keadaan baiknya jelas\", tetapi dia tidak menyebut apa yang berikutnya."
  },
  {
    "id": 11015,
    "hadith_number": 3738,
    "tajuk_hadith": "Hadis Berkaitan Perawi dan Rangkaian Periwayatan",
    "perawi_melayu": "Ibn 'Umar melalui beberapa perawi",
    "english_text": "This hadith has been narrated on the authority of Ibn 'Umar through another chain of transmitters.",
    "arabic_text": "حَدَّثَنَا ابْنُ رَافِعٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنَا الضَّحَّاكُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ عَبْدِ الْوَهَّابِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan berdasarkan perawi Ibn 'Umar melalui satu rangkaian perawi yang lain.  Ini menunjukkan keberkesanan dan kekuatan sanad dalam periwayatan hadis.  Perawi-perawi yang disebut dalam hadis ini merupakan penghubung antara Nabi saw dan perawi terakhir, Ibn 'Umar."
  },
  {
    "id": 11016,
    "hadith_number": 3739,
    "tajuk_hadith": "Hadis yang Menyerupai Hadis Sebelumnya",
    "perawi_melayu": "Nafi, berdasarkan riwayat Ibn Umar (Semoga Allah meridhai mereka berdua)",
    "english_text": "Nafi, reported on the authority of Ibn Umar (Allah be pleased with them) a hadith like that narrated before.",
    "arabic_text": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا حَفْصُ بْنُ مَيْسَرَةَ، حَدَّثَنِي مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ مَالِكٍ وَعُبَيْدِ اللَّهِ ‏.‏",
    "malay_translation": "Nafi meriwayatkan sebuah hadis daripada Ibn Umar (Semoga Allah meridhai mereka) yang menyerupai hadis yang telah diriwayatkan sebelum ini."
  },
  {
    "id": 11017,
    "hadith_number": 3740,
    "tajuk_hadith": "Jangan Beli Buah-Buahan Sehingga Keadaan Baiknya Nampak Jelas",
    "perawi_melayu": "Ibn Umar (رضي الله عنهما) meriwayatkan daripada Rasulullah SAW bahawa:",
    "english_text": "Do not buy fruits (on the trees) until their good condition becomes clear.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالَ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ جَعْفَرٍ - عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّهُ سَمِعَ ابْنَ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَبِيعُوا الثَّمَرَ حَتَّى يَبْدُوَ صَلاَحُهُ ‏\"‏ ‏.",
    "malay_translation": "Janganlah membeli buah-buahan (yang masih di pokok) sehingga keadaan baiknya jelas nyata.  Rasulullah SAW bersabda, \"Janganlah kalian membeli buah-buahan sehingga keadaan baiknya tampak jelas.\""
  },
  {
    "id": 11018,
    "hadith_number": 3741,
    "tajuk_hadith": "Keadaan Sejahtera Selepas Bencana",
    "perawi_melayu": "Dikisahkan oleh Shu'ba, dari Abdullah bin Dinar, melalui sanad yang sama, dengan tambahan, Ibn Umar (radhiyallahu 'anhu) ditanya tentang maksud 'keadaan sejahtera' yang dimaksudkan. Beliau menjawab:",
    "english_text": "Apabila (bahaya) wabak itu berlalu.",
    "arabic_text": "وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، ح وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، كِلاَهُمَا عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، بِهَذَا الإِسْنَادِ وَزَادَ فِي حَدِيثِ شُعْبَةَ فَقِيلَ لاِبْنِ عُمَرَ مَا صَلاَحُهُ قَالَ تَذْهَبُ عَاهَتُهُ ‏.‏",
    "malay_translation": "Apabila musibah wabak itu berlalu (dan keadaan selamat kembali)."
  },
  {
    "id": 11019,
    "hadith_number": 3742,
    "tajuk_hadith": "Larangan Menjual Buah Buahan Sebelum Matang",
    "perawi_melayu": "",
    "english_text": "Jabir (Allah bless him) reported that Allah's Messenger (ﷺ) forbade (or forbade us) the sale of fruits until they are ripe in a good condition.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، ح.\n وَحَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ نَهَى - أَوْ نَهَانَا - رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الثَّمَرِ حَتَّى يَطِيبَ ‏.‏",
    "malay_translation": "Jabir (Allah SWT merahmati beliau) meriwayatkan bahawa Rasulullah SAW melarang (atau melarang kita) menjual buah-buahan sehingga ia masak dan berkualiti baik."
  },
  {
    "id": 11020,
    "hadith_number": 3743,
    "tajuk_hadith": "Larangan Menjual Buah sebelum Matang",
    "perawi_melayu": "Jabir bin Abdullah (رضي الله عنهما)",
    "english_text": "Jabir b. Abdullah (Allah be pleased with them) reported Allah's Messenger (ﷺ) forbidding the sale of fruit until its good condition is obvious.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِيُّ، حَدَّثَنَا أَبُو عَاصِمٍ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا رَوْحٌ، قَالاَ حَدَّثَنَا زَكَرِيَّاءُ بْنُ إِسْحَاقَ، حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الثَّمَرِ حَتَّى يَبْدُوَ صَلاَحُهُ ‏.‏",
    "malay_translation": "Jabir bin Abdullah (رضي الله عنهما) meriwayatkan bahawa Rasulullah SAW melarang menjual buah-buahan sehingga keadaan baiknya jelas nyata."
  },
  {
    "id": 11021,
    "hadith_number": 3744,
    "tajuk_hadith": "Larangan Menjual Kurma sebelum Matang atau Ditimbang",
    "perawi_melayu": "Abu Bakhtari meriwayatkan:",
    "english_text": "I asked Ibn 'Abbas (Allah be pleased with them) about the sale of dates. He said: Allah's Messenger (ﷺ) forbade the sale of dates of the trees until one eats them or they are eaten (i. e. they are fit to be eaten) or until they are weighed (or measured). I said: What does it imply:\" Until it is weighed\"? Thereupon a person who was with him (Ibn Abbas) said: Until he is able to keep it with him (after plucking them).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ أَبِي الْبَخْتَرِيِّ، قَالَ سَأَلْتُ ابْنَ عَبَّاسٍ عَنْ بَيْعِ النَّخْلِ، فَقَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ النَّخْلِ حَتَّى يَأْكُلَ مِنْهُ أَوْ يُؤْكَلَ وَحَتَّى يُوزَنَ ‏.‏ قَالَ فَقُلْتُ مَا يُوزَنُ فَقَالَ رَجُلٌ عِنْدَهُ حَتَّى يَحْزَرَ ‏.‏",
    "malay_translation": "Aku bertanya kepada Ibn 'Abbas (semoga Allah merahmati mereka) tentang jual beli kurma. Baginda Rasulullah SAW melarang penjualan kurma dari pokok sehingga ia dimakan atau boleh dimakan, atau sehingga ditimbang. Aku bertanya, \"Apakah maksudnya 'sehingga ditimbang'?\" Seorang yang bersama Ibn 'Abbas berkata, \"Sehingga ia mampu menyimpannya (selepas memetiknya).\""
  },
  {
    "id": 11022,
    "hadith_number": 3745,
    "tajuk_hadith": "Jangan Beli Buah Sehingga Kualitinya Terlihat Jelas",
    "perawi_melayu": "Daripada Abu Hurairah (رضي الله عنه), Rasulullah SAW bersabda:",
    "english_text": "Do not sell the fruits until their good condition becomes evident.",
    "arabic_text": "حَدَّثَنِي أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنِ ابْنِ أَبِي، نُعْمٍ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَبْتَاعُوا الثِّمَارَ حَتَّى يَبْدُوَ صَلاَحُهَا ‏\"‏ ‏.‏",
    "malay_translation": "Jangan membeli buah-buahan sehingga keadaan baiknya terbukti jelas."
  },
  {
    "id": 11023,
    "hadith_number": 3746,
    "tajuk_hadith": "Larangan Menjual Buah Sebelum Matang dan Pertukaran Buah dengan Kurma",
    "perawi_melayu": "",
    "english_text": "Ibn Umar (Allah SWT redha dengan mereka) meriwayatkan bahawa Rasulullah SAW melarang menjual buah-buahan sehingga keadaan baiknya terbukti dan membeli kurma dengan kurma.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، ح وَحَدَّثَنَا ابْنُ، نُمَيْرٍ وَزُهَيْرُ بْنُ حَرْبٍ - وَاللَّفْظُ لَهُمَا - قَالاَ حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الزُّهْرِيُّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الثَّمَرِ حَتَّى يَبْدُوَ صَلاَحُهُ وَعَنْ بَيْعِ الثَّمَرِ بِالتَّمْرِ ‏.‏",
    "malay_translation": "Ibn Umar (Semoga Allah SWT meridhai mereka) meriwayatkan bahawa Rasulullah SAW melarang jual beli buah-buahan sehingga kematangan dan kualiti buah terbukti baik. Baginda juga melarang pertukaran buah dengan kurma."
  },
  {
    "id": 11024,
    "hadith_number": 3747,
    "tajuk_hadith": "Penjelasan tentang Kelonggaran dalam Perniagaan 'Arayā",
    "perawi_melayu": "",
    "english_text": "Zaid b. Thabit (Allah be pleased with him) said that Allah's Messenger (ﷺ) gave a concession in case of the sale known as al-araya, there is an addition of the word an tuba'a in the hadith transmitted by Ibn Numair.",
    "arabic_text": "قَالَ ابْنُ عُمَرَ وَحَدَّثَنَا زَيْدُ بْنُ ثَابِتٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَخَّصَ فِي بَيْعِ الْعَرَايَا ‏.‏ زَادَ ابْنُ نُمَيْرٍ فِي رِوَايَتِهِ أَنْ تُبَاعَ ‏.‏",
    "malay_translation": "Zaid bin Thabit (redho Allah ke atasnya) meriwayatkan bahawa Rasulullah SAW memberi kelonggaran dalam urusan jual beli ‘araya. Tambahan perkataan ‘an tuba’a ada dalam riwayat daripada Ibn Numair."
  },
  {
    "id": 11025,
    "hadith_number": 3748,
    "tajuk_hadith": "Larangan Membeli Buah dan Kurma sebelum Sempurna",
    "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan daripada Rasulullah SAW bahawa:",
    "english_text": "Do not buy the fruit until their condition is clear, and do not buy the fresh dates. A hadith like this has been reported by Ibn 'Umar through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، - وَاللَّفْظُ لِحَرْمَلَةَ - قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَبْتَاعُوا الثَّمَرَ حَتَّى يَبْدُوَ صَلاَحُهُ وَلاَ تَبْتَاعُوا الثَّمَرَ بِالتَّمْرِ ‏\"‏ ‏.‏ قَالَ ابْنُ شِهَابٍ وَحَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ سَوَاءً ‏.‏",
    "malay_translation": "Jangan membeli buah-buahan sehingga keadaannya jelas, dan jangan membeli kurma yang masih segar. Hadis seperti ini telah diriwayatkan oleh Ibnu 'Umar melalui rantaian perawi yang lain."
  },
  {
    "id": 11026,
    "hadith_number": 3749,
    "tajuk_hadith": "Larangan Menjual Buah dan Tarikh yang Belum Matang dan Pertukaran Tarikh dengan Tarikh Lain",
    "perawi_melayu": "Sa'id bin al-Musayyib berkata bahawa Rasulullah SAW melarang transaksi Muzabana dan Muhaqala. Muzabana bermaksud menjual buah kurma segar di pokok dengan kurma kering. Muhaqala bermaksud menjual gandum yang masih di tangkai dengan gandum dan menyewa tanah dengan gandum (yang dihasilkan). Beliau (pencerita) berkata bahawa Nabi SAW telah berkata:",
    "english_text": "Do not sell fresh fruits on the trees until their good condition becomes manifest, and do not sell fresh dates on the trees against dry dates. Salim said: Abdullah informed me on the authority of Zaid b. Thabit, Allah's Messenger (ﷺ) having given concession afterwards in case of ariyya transactions by which dry dates can be exchanged with fresh dates, but he did not permit it in other cases.",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا حُجَيْنُ بْنُ الْمُثَنَّى، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الْمُزَابَنَةِ وَالْمُحَاقَلَةِ وَالْمُزَابَنَةُ أَنْ يُبَاعَ ثَمَرُ النَّخْلِ بِالتَّمْرِ وَالْمُحَاقَلَةُ أَنْ يُبَاعَ الزَّرْعُ بِالْقَمْحِ وَاسْتِكْرَاءُ الأَرْضِ بِالْقَمْحِ ‏.‏ قَالَ وَأَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ لاَ تَبْتَاعُوا الثَّمَرَ حَتَّى يَبْدُوَ صَلاَحُهُ وَلاَ تَبْتَاعُوا الثَّمَرَ بِالتَّمْرِ ‏\"‏ ‏.‏\n وَقَالَ سَالِمٌ أَخْبَرَنِي عَبْدُ اللَّهِ، عَنْ زَيْدِ بْنِ ثَابِتٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ رَخَّصَ بَعْدَ ذَلِكَ فِي بَيْعِ الْعَرِيَّةِ بِالرُّطَبِ أَوْ بِالتَّمْرِ وَلَمْ يُرَخِّصْ فِي غَيْرِ ذَلِكَ.",
    "malay_translation": "Jangan menjual buah-buahan segar di pokok sehingga keadaan baiknya jelas, dan jangan menjual buah kurma segar di pokok dengan kurma kering. Salim berkata: Abdullah memberitahu saya dengan izin Zaid bin Thabit, Rasulullah SAW telah memberi keringanan kemudian dalam urusan transaksi *ariyya* di mana kurma kering boleh ditukar dengan kurma segar, tetapi baginda tidak mengizinkannya dalam kes-kes lain."
  },
  {
    "id": 11027,
    "hadith_number": 3750,
    "tajuk_hadith": "Keizinan Membeli Buah Kurma dalam Pinjaman 'Arid",
    "perawi_melayu": "Zaid bin Thabit (Semoga Allah meridainya)",
    "english_text": "Zaid b. Thabit (Allah be pleased with him) reported Allah's Messenger (may peace he upon him) having given concession in case of 'ariyya for selling dry dates (with) fresh dates after measuring them out.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ زَيْدِ، بْنِ ثَابِتٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَخَّصَ لِصَاحِبِ الْعَرِيَّةِ أَنْ يَبِيعَهَا بِخَرْصِهَا مِنَ التَّمْرِ ‏.‏",
    "malay_translation": "Zaid bin Thabit (Semoga Allah meridainya) meriwayatkan bahawa Rasulullah saw telah memberikan keringanan kepada pemberi pinjaman (dalam situasi ‘arīyah) untuk menjual buah kurma kering bersama kurma segar setelah diukur."
  },
  {
    "id": 11028,
    "hadith_number": 3751,
    "tajuk_hadith": "Keizinan dalam Transaksi 'Ariyyah Bagi Keluarga",
    "perawi_melayu": "Zaid bin Thabit",
    "english_text": "Zaid b. Thabit melaporkan bahawa Rasulullah SAW memberikan keringanan dalam urusan transaksi 'ariyyah di mana ahli keluarga memberikan kurma kering mengikut ukuran dan kemudian memakan kurma segar (sebagai balasannya).",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَخْبَرَنِي نَافِعٌ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ، يُحَدِّثُ أَنَّ زَيْدَ بْنَ ثَابِتٍ، حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَخَّصَ فِي الْعَرِيَّةِ يَأْخُذُهَا أَهْلُ الْبَيْتِ بِخَرْصِهَا تَمْرًا يَأْكُلُونَهَا رُطَبًا ‏.‏",
    "malay_translation": "Zaid bin Thabit telah meriwayatkan bahawa Rasulullah SAW telah memberikan keringanan dalam urusan transaksi 'ariyyah di mana ahli keluarga boleh mengambil kurma kering mengikut ukuran dan kemudian memakan kurma segar sebagai balasannya.  Ini adalah keizinan dalam transaksi 'ariyyah untuk keluarga."
  },
  {
    "id": 11029,
    "hadith_number": 3752,
    "tajuk_hadith": "Hadis yang Sama dengan Rangkaian Sanad yang Sama",
    "perawi_melayu": "",
    "english_text": "A hadith like this has been narrated on the authority of Nafi' with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، يَقُولُ أَخْبَرَنِي نَافِعٌ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
    "malay_translation": "Hadis yang serupa dengannya telah diriwayatkan melalui sanad yang sama dari Nafi'. "
  },
  {
    "id": 11030,
    "hadith_number": 3753,
    "tajuk_hadith": "Perkongsian dan Jual Beli Kurma dari Pohon Kurma yang Diwakafkan",
    "perawi_melayu": "Yahya bin Sa'id meriwayatkan hadis ini dengan sanad yang sama tetapi dengan perbezaan berikut:",
    "english_text": "'Ariyya implies that date-palm trees should be donated to the people and then they sell it with a measure of dry dates.",
    "arabic_text": "وَحَدَّثَنَاهُ يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّهُ قَالَ وَالْعَرِيَّةُ النَّخْلَةُ تُجْعَلُ لِلْقَوْمِ فَيَبِيعُونَهَا بِخَرْصِهَا تَمْرًا ‏.‏",
    "malay_translation": "'Ariyya bermaksud pohon kurma harus diwakafkan kepada masyarakat, kemudian mereka menjualnya dengan ukuran kurma kering."
  },
  {
    "id": 11031,
    "hadith_number": 3754,
    "tajuk_hadith": "Kebolehan Menukar Kurma Segar dengan Kurma Kering dalam Perniagaan 'Ariyyah",
    "perawi_melayu": "Zaid bin Thabit (رضي الله عنه) meriwayatkan bahawa Rasulullah SAW mengizinkan pertukaran kurma segar dengan kurma kering dalam transaksi 'ariyyah.",
    "english_text": "'Ariyya implies that a person should buy fresh dates on the tree for his family to eat against a measure of dry dates.",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، حَدَّثَنَا اللَّيْثُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، حَدَّثَنِي زَيْدُ بْنُ ثَابِتٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَخَّصَ فِي بَيْعِ الْعَرِيَّةِ بِخَرْصِهَا تَمْرًا ‏.‏ قَالَ يَحْيَى الْعَرِيَّةُ أَنْ يَشْتَرِيَ الرَّجُلُ ثَمَرَ النَّخَلاَتِ لِطَعَامِ أَهْلِهِ رُطَبًا بِخَرْصِهَا تَمْرًا ‏.‏",
    "malay_translation": "Perjanjian 'ariyyah membenarkan seseorang membeli kurma segar dari pokok untuk keluarganya makan dengan menukarnya dengan kadar kurma kering.  Ini merupakan kelonggaran yang diberikan oleh Rasulullah SAW dalam urusan perniagaan 'ariyyah (pertukaran barang). Kata Yahya:"
  },
  {
    "id": 11032,
    "hadith_number": 3755,
    "tajuk_hadith": "Perkenan Rasulullah SAW dalam Pertukaran Pinjam-meminjam (‘Ariyyah) dan Penukaran Kurma Kering dengan Kurma Segar",
    "perawi_melayu": "Zaid bin Thabit",
    "english_text": "Zaid b. Thabit (Allah be pleased with him) reported Allah's Messenger (ﷺ) granting concession in case of 'ariyya transactions and that implies selling of (dry dates for fresh dates) according to a measure.",
    "arabic_text": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللَّهِ، حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، عَنْ زَيْدِ بْنِ ثَابِتٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَخَّصَ فِي الْعَرَايَا أَنْ تُبَاعَ بِخَرْصِهَا كَيْلاً ‏.‏",
    "malay_translation": "Zaid bin Thabit meriwayatkan bahawa Rasulullah SAW telah memberi kelonggaran dalam urusan transaksi ‘ariyyah (pinjam-meminjam) dan ia melibatkan penjualan kurma kering dengan kurma segar mengikut sukatan."
  },
  {
    "id": 11033,
    "hadith_number": 3756,
    "tajuk_hadith": "Hadis dengan sedikit perbezaan perkataan daripada sumber yang sama",
    "perawi_melayu": "",
    "english_text": "Ubaidullah reported this hadith with a slight change of words on the same authority (as quoted above).",
    "arabic_text": "وَحَدَّثَنَاهُ ابْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، بِهَذَا الإِسْنَادِ وَقَالَ أَنْ تُؤْخَذَ بِخَرْصِهَا ‏.‏",
    "malay_translation": "Ubaidullah meriwayatkan hadis ini dengan sedikit perubahan perkataan daripada sumber yang sama (seperti yang disebut di atas)."
  },
  {
    "id": 11034,
    "hadith_number": 3757,
    "tajuk_hadith": "Keizinan dalam Pertukaran Barang Sama Jenis dengan Ukuran",
    "perawi_melayu": "",
    "english_text": "Nafi, melaporkan hadis ini dengan sanad yang sama, menyatakan bahawa Rasulullah SAW memberikan kelonggaran dalam urusan transaksi 'ariyyah (pertukaran barang sama jenis) dengan ukuran.",
    "arabic_text": "وَحَدَّثَنَا أَبُو الرَّبِيعِ، وَأَبُو كَامِلٍ قَالاَ حَدَّثَنَا حَمَّادٌ، ح وَحَدَّثَنِيهِ عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا إِسْمَاعِيلُ، كِلاَهُمَا عَنْ أَيُّوبَ، عَنْ نَافِعٍ، بِهَذَا الإِسْنَادِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَخَّصَ فِي بَيْعِ الْعَرَايَا بِخَرْصِهَا ‏.‏",
    "malay_translation": "Nafi meriwayatkan hadis ini dengan sanad yang sama, bahawa Rasulullah SAW mengizinkan dalam urusan pertukaran barang sama jenis (ariyyah) dengan menggunakan ukuran."
  },
  {
    "id": 11035,
    "hadith_number": 3758,
    "tajuk_hadith": "Larangan Menjual Kurma Segar dengan Kurma Kering dan Pengecualian untuk 'Ariyyah",
    "perawi_melayu": "",
    "english_text": "Bashair b. Yasir melaporkan berdasarkan beberapa Sahabat Rasulullah SAW dari kalangan ahli keluarganya, termasuk Sahl b. Abu Hathma, bahawa Rasulullah SAW melarang membeli kurma segar dengan kurma kering, kerana ia adalah riba dan muzabana.  Namun, Baginda membenarkan penjualan 'ariyyah (hadiah) untuk sepohon atau dua pokok kurma, di mana ahli keluarga boleh menjual kurma kering dan membeli kurma segar untuk dimakan.",
    "arabic_text": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، حَدَّثَنَا سُلَيْمَانُ، - يَعْنِي ابْنَ بِلاَلٍ - عَنْ يَحْيَى، - وَهُوَ ابْنُ سَعِيدٍ - عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ بَعْضِ، أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ أَهْلِ دَارِهِمْ مِنْهُمْ سَهْلُ بْنُ أَبِي حَثْمَةَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الثَّمَرِ بِالتَّمْرِ وَقَالَ ‏\n\"‏ ذَلِكَ الرِّبَا تِلْكَ الْمُزَابَنَةُ ‏\"‏ ‏.‏ إِلاَّ أَنَّهُ رَخَّصَ فِي بَيْعِ الْعَرِيَّةِ النَّخْلَةِ وَالنَّخْلَتَيْنِ يَأْخُذُهَا أَهْلُ الْبَيْتِ بِخَرْصِهَا تَمْرًا يَأْكُلُونَهَا رُطَبًا ‏.‏",
    "malay_translation": "Daripada Bashair bin Yasir, berdasarkan beberapa sahabat Rasulullah SAW dari kalangan ahli keluarga mereka, termasuk Sahl bin Abu Hathma, bahawa Rasulullah SAW melarang jual beli kurma segar dengan kurma kering. Baginda menyatakan ia sebagai riba dan muzabana.  Bagaimanapun, Baginda memberikan pengecualian untuk jual beli ‘ariyyah (hadiah) bagi sepohon atau dua pohon kurma, di mana ahli keluarga dibenarkan menjual kurma kering dan membeli kurma segar untuk dimakan."
  },
  {
    "id": 11036,
    "hadith_number": 3759,
    "tajuk_hadith": "Pengampunan Rasulullah SAW dalam Pertukaran Barang dengan Ukuran",
    "perawi_melayu": "Bushair bin Yasar meriwayatkan daripada beberapa sahabat Rasulullah SAW",
    "english_text": "Bushair b. Yasar reported on the authority of some of the Companion of Allah's Messenger (ﷺ) that he exempted the transactions, of 'ariyya (from the direct exchange of one kind) after measuring the dry dates (in exchange for fresh dates).",
    "arabic_text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا ابْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ يَحْيَى، بْنِ سَعِيدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ أَصْحَابِ، رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُمْ قَالُوا رَخَّصَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي بَيْعِ الْعَرِيَّةِ بِخَرْصِهَا تَمْرًا ‏.‏",
    "malay_translation": "Bushair bin Yasar meriwayatkan daripada beberapa orang sahabat Rasulullah SAW bahawa Baginda SAW mengizinkan pertukaran barang 'ariyyah (pertukaran barang yang tidak serupa) dengan mengukur kurma kering (sebagai pertukaran kurma segar).  Baginda telah memberi keringanan dalam urusan jual beli jenis pertukaran ini."
  },
  {
    "id": 11037,
    "hadith_number": 3760,
    "tajuk_hadith": "Larangan Pertukaran Barang dengan Kualiti Berbeza oleh Rasulullah SAW",
    "perawi_melayu": "",
    "english_text": "Bushair b. Yasir reported on the authority of some of the Companions of Allah's Messenger (may peace be upon him) from among the members of his family that he forbade (the direct exchange of a commodity having different qualities) but with the change that Ishaq and Ibn al-Muthanna used the word Zabn in place of Riba and Ibn Abu 'Umar used the word Riba (interest).",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنِ الثَّقَفِيِّ، قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، يَقُولُ أَخْبَرَنِي بُشَيْرُ بْنُ يَسَارٍ، عَنْ بَعْضِ، أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ أَهْلِ دَارِهِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى ‏.‏ فَذَكَرَ بِمِثْلِ حَدِيثِ سُلَيْمَانَ بْنِ بِلاَلٍ عَنْ يَحْيَى غَيْرَ أَنَّ إِسْحَاقَ وَابْنَ الْمُثَنَّى جَعَلاَ مَكَانَ الرِّبَا الزَّبْنَ وَقَالَ ابْنُ أَبِي عُمَرَ الرِّبَا ‏.‏",
    "malay_translation": "Bushair bin Yasir meriwayatkan daripada beberapa sahabat Rasulullah SAW (semoga kesejahteraan dilimpahkan ke atasnya) daripada kalangan ahli keluarganya bahawa Rasulullah SAW melarang (pertukaran barang secara langsung yang mempunyai kualiti berbeza) tetapi dengan perubahan yang berlaku, Ishaq dan Ibn al-Muthanna menggunakan perkataan Zabn sebagai ganti Riba, dan Ibn Abu 'Umar menggunakan perkataan Riba (bunga/ faedah). "
  },
  {
    "id": 11038,
    "hadith_number": 3761,
    "tajuk_hadith": "Hadis Daripada Sahl bin Abu Hathma",
    "perawi_melayu": "Amru An-Naqad, Ibn Numir, Sufyan bin Uyainah, Yahya bin Said, Bushair bin Yasar, dan Sahl bin Abu Hathma",
    "english_text": "A hadith like this has been narrated on the authority of Sahl b. Abu Hathma.",
    "arabic_text": "وَحَدَّثَنَاهُ عَمْرٌو النَّاقِدُ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ يَحْيَى بْنِ، سَعِيدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَ حَدِيثِهِمْ ‏.‏",
    "malay_translation": "Sebuah hadis yang serupa telah diriwayatkan dengan sanad daripada Sahl bin Abu Hathma."
  },
  {
    "id": 11039,
    "hadith_number": 3762,
    "tajuk_hadith": "Larangan Pertukaran Kurma Segar dengan Kurma Kering",
    "perawi_melayu": "",
    "english_text": "Sahl b. Abu Hathma melaporkan bahawa Rasulullah SAW telah melarang pertukaran kurma segar dengan kurma kering, kecuali bagi mereka yang menerima pemberian sebahagian pokok. Mereka diberikan pengecualian.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَحَسَنٌ الْحُلْوَانِيُّ، قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الْوَلِيدِ، بْنِ كَثِيرٍ حَدَّثَنِي بُشَيْرُ بْنُ يَسَارٍ، مَوْلَى بَنِي حَارِثَةَ أَنَّ رَافِعَ بْنَ خَدِيجٍ، وَسَهْلَ بْنَ أَبِي حَثْمَةَ، حَدَّثَاهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُزَابَنَةِ الثَّمَرِ بِالتَّمْرِ إِلاَّ أَصْحَابَ الْعَرَايَا فَإِنَّهُ قَدْ أَذِنَ لَهُمْ ‏.‏",
    "malay_translation": "Sahl bin Abu Hathma meriwayatkan bahawa Rasulullah SAW melarang pertukaran kurma segar dengan kurma kering, kecuali bagi mereka yang menerima pemberian sebahagian pokok. Mereka dikecualikan daripada larangan tersebut."
  },
  {
    "id": 11040,
    "hadith_number": 3763,
    "tajuk_hadith": "Perbahasan Tentang Perjanjian Sewa Menyewa 'Ariyya yang Kurang daripada Lima Wasq",
    "perawi_melayu": "Abu Hurairah (رضي الله عنه)",
    "english_text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) having given exemption of 'ariyya transactions measuring less than five wasqs or up to five wasqs (the narrator Dawud is in doubt whether it was five or less than five).",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا مَالِكٌ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، - وَاللَّفْظُ لَهُ - قَالَ قُلْتُ لِمَالِكٍ حَدَّثَكَ دَاوُدُ بْنُ الْحُصَيْنِ، عَنْ أَبِي سُفْيَانَ، - مَوْلَى ابْنِ أَبِي أَحْمَدَ - عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَخَّصَ فِي بَيْعِ الْعَرَايَا بِخَرْصِهَا فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ أَوْ فِي خَمْسَةِ - يَشُكُّ دَاوُدُ قَالَ خَمْسَةٌ أَوْ دُونَ خَمْسَةٍ - قَالَ نَعَمْ ‏.‏",
    "malay_translation": "Abu Hurairah (رضي الله عنه) meriwayatkan bahawa Rasulullah SAW telah memberikan keringanan dalam transaksi 'ariyya (pinjaman) yang berukuran kurang daripada lima wasq atau sehingga lima wasq. (Perawi Dawud ragu-ragu sama ada ia adalah lima atau kurang daripada lima)."
  },
  {
    "id": 11041,
    "hadith_number": 3764,
    "tajuk_hadith": "Larangan Menukar Tembikar dan Anggur dengan Ukuran",
    "perawi_melayu": "Ibn Umar",
    "english_text": "Ibn Umar (Allah merahmati mereka) melaporkan Rasulullah SAW melarang Muzabana, dan Muzabana bermaksud menjual kurma segar dengan kurma kering dengan ukuran dan menjual anggur dengan kismis dengan ukuran.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُزَابَنَةِ وَالْمُزَابَنَةُ بَيْعُ الثَّمَرِ بِالتَّمْرِ كَيْلاً وَبَيْعُ الْكَرْمِ بِالزَّبِيبِ كَيْلاً ‏.‏",
    "malay_translation": "Ibn Umar (Semoga Allah merahmati mereka) meriwayatkan bahawa Rasulullah SAW telah melarang Muzabana. Muzabana bermaksud menjual buah-buahan segar dengan kurma kering mengikut ukuran, dan menjual anggur dengan kismis mengikut ukuran."
  },
  {
    "id": 11042,
    "hadith_number": 3765,
    "tajuk_hadith": "Larangan Pertukaran Kurma dan Buah Anggur dengan Ukuran",
    "perawi_melayu": "Abdullah bin Umar",
    "english_text": "'Abdullah (b. Umar) reported that Allah's Apostle (ﷺ) forbade Muzabana, i. e. buying of fresh dates (on) the trees for dry dates by measure, and the buying of grapes for raisins by measure and the selling of field of corn for corn by measure.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ، بِشْرٍ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ، أَخْبَرَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ الْمُزَابَنَةِ بَيْعِ ثَمَرِ النَّخْلِ بِالتَّمْرِ كَيْلاً وَبَيْعِ الْعِنَبِ بِالزَّبِيبِ كَيْلاً وَبَيْعِ الزَّرْعِ بِالْحِنْطَةِ كَيْلاً ‏.‏",
    "malay_translation": "Abdullah bin Umar meriwayatkan bahawa Rasulullah SAW melarang Muzabana, iaitu membeli buah kurma segar di pokok untuk kurma kering mengikut ukuran, membeli anggur untuk kismis mengikut ukuran, dan menjual sawah padi untuk padi mengikut ukuran."
  },
  {
    "id": 11043,
    "hadith_number": 3766,
    "tajuk_hadith": "Hadis yang Sama dengan Rangkaian Perawi yang Sama",
    "perawi_melayu": "",
    "english_text": "A hadith like this has been narrated on the authority of 'Ubaidullah with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، عَنْ عُبَيْدِ اللَّهِ، بِهَذَا الإِسْنَادِ مِثْلَهُ.",
    "malay_translation": "Satu hadis yang serupa dengannya telah disampaikan dengan sandaran ‘Ubaidullah melalui rangkaian perawi yang sama."
  },
  {
    "id": 11044,
    "hadith_number": 3767,
    "tajuk_hadith": "Larangan Pertukaran Buah Kering dengan Buah Segar",
    "perawi_melayu": "Ibn 'Umar (رضي الله عنهما)",
    "english_text": "Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) having forbidden Muzabana, and Muzabana is the selling of dry dates by measure for fresh dates and the selling of raisins by measure for grapes and selling of all Ports of fruits on the basis of calculation.",
    "arabic_text": "حَدَّثَنِي يَحْيَى بْنُ مَعِينٍ، وَهَارُونُ بْنُ عَبْدِ اللَّهِ، وَحُسَيْنُ بْنُ عِيسَى، قَالُوا حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُزَابَنَةِ وَالْمُزَابَنَةُ بَيْعُ ثَمَرِ النَّخْلِ بِالتَّمْرِ كَيْلاً وَبَيْعُ الزَّبِيبِ بِالْعِنَبِ كَيْلاً وَعَنْ كُلِّ ثَمَرٍ بِخَرْصِهِ ‏.‏",
    "malay_translation": "Ibn 'Umar (رضي الله عنهما) meriwayatkan bahawa Rasulullah SAW telah melarang Muzabana. Muzabana ialah menjual kurma kering dengan ukuran kurma segar, menjual kismis dengan ukuran anggur, dan menjual segala jenis buah dengan ukuran yang tidak sepadan."
  },
  {
    "id": 11045,
    "hadith_number": 3768,
    "tajuk_hadith": "Larangan Pertukaran Kurma Kering dengan Kurma Segar",
    "perawi_melayu": "Ibn 'Umar (رضي الله عنهما)",
    "english_text": "Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) having forbidden Muzabana, and Muzabana implies the selling of dry dates for fresh dates on the tree with a definite measure (making it clear) that in case it increases, it belongs to me and if it is less, it is my responsibility.",
    "arabic_text": "حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ إِبْرَاهِيمَ - عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُزَابَنَةِ وَالْمُزَابَنَةُ أَنْ يُبَاعَ مَا فِي رُءُوسِ النَّخْلِ بِتَمْرٍ بِكَيْلٍ مُسَمًّى إِنْ زَادَ فَلِي وَإِنْ نَقَصَ فَعَلَىَّ ‏.‏",
    "malay_translation": "Ibn 'Umar (رضي الله عنهما) meriwayatkan bahawa Rasulullah SAW melarang perbuatan Muzabana. Muzabana bermaksud menjual kurma kering dengan kurma segar yang berada di atas pokok dengan ukuran yang pasti. Jika hasil kurma segar yang diperoleh lebih banyak daripada yang diukur, ia menjadi hak penjual. Sebaliknya, jika kurang daripada yang diukur, penjuallah yang bertanggungjawab."
  },
  {
    "id": 11046,
    "hadith_number": 3769,
    "tajuk_hadith": "Hadis Daripada Ayyub",
    "perawi_melayu": "",
    "english_text": "A hadith like this has been transmitted on the authority of Ayyub.",
    "arabic_text": "وَحَدَّثَنَاهُ أَبُو الرَّبِيعِ، وَأَبُو كَامِلٍ قَالاَ حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏",
    "malay_translation": "Sebuah hadis yang serupa telah disampaikan dengan sanad daripada Ayyub."
  },
  {
    "id": 11047,
    "hadith_number": 3770,
    "tajuk_hadith": "Larangan Pertukaran Buah-buahan Segar dengan Kering",
    "perawi_melayu": "Abdullah bin Umar (رضي الله عنهما)",
    "english_text": "Abdullah (b. Umar) (Allah be pleased with them) reported Allah's Messenger (ﷺ) having forbidden Mazabana, and it implies that one should sell the fresh fruits of his orchard (for dry fruits) or, if it is fresh dates, for dry dates with a measure, or if it is grapes for raisins or if it is corn in the field for dry corn with a measure He (the Holy Prophet) in fact forbade all such transactions. Qutaiba has narrated it with a slight variation of words.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُزَابَنَةِ أَنْ يَبِيعَ ثَمَرَ حَائِطِهِ إِنْ كَانَتْ نَخْلاً بِتَمْرٍ كَيْلاً وَإِنْ كَانَ كَرْمًا أَنْ يَبِيعَهُ بِزَبِيبٍ كَيْلاً وَإِنْ كَانَ زَرْعًا أَنْ يَبِيعَهُ بِكَيْلِ طَعَامٍ ‏.‏ نَهَى عَنْ ذَلِكَ كُلِّهِ ‏.‏ وَفِي رِوَايَةِ قُتَيْبَةَ أَوْ كَانَ زَرْعًا.",
    "malay_translation": "Abdullah bin Umar (رضي الله عنهما) meriwayatkan bahawa Rasulullah SAW telah melarang *muzâbana*, iaitu menjual hasil kebun yang segar dengan barang kering.  Contohnya, jika buahnya kurma segar, maka hendaklah dijual dengan kurma kering mengikut sukatan. Begitu juga jika anggur segar, dijual dengan kismis mengikut sukatan. Jika jagung segar, maka dijual dengan jagung kering mengikut sukatan. Baginda SAW telah melarang semua jenis pertukaran seperti itu.  Hadis ini diriwayatkan oleh Qutaiba dengan sedikit perbezaan perkataan."
  },
  {
    "id": 11048,
    "hadith_number": 3771,
    "tajuk_hadith": "Hadis Riwayat Nafi dengan Sanad Lain",
    "perawi_melayu": "Nafi",
    "english_text": "This hadith has been narrated on the authority of Nafi with another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنِيهِ أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، حَدَّثَنِي يُونُسُ، ح وَحَدَّثَنَاهُ ابْنُ رَافِعٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنِي الضَّحَّاكُ، ح وَحَدَّثَنِيهِ سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا حَفْصُ بْنُ مَيْسَرَةَ، حَدَّثَنِي مُوسَى بْنُ عُقْبَةَ، كُلُّهُمْ عَنْ نَافِعٍ، بِهَذَا الإِسْنَادِ نَحْوَ حَدِيثِهِمْ.",
    "malay_translation": "Hadis ini diriwayatkan berdasarkan perawi Nafi dengan sanad yang lain.  Terdapat beberapa perawi yang meriwayatkan hadis ini dengan pelbagai sanad."
  },
  {
    "id": 11049,
    "hadith_number": 3772,
    "tajuk_hadith": "Hak Pemilik Buah Kelapa Sawit yang Dibeli",
    "perawi_melayu": "Ibn Umar (رضي الله عنهما) meriwayatkan Rasulullah SAW bersabda:",
    "english_text": "If anyone buys palm-trees after they have been fecundated the fruit belongs to the seller unless the buyer makes a proviso.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ بَاعَ نَخْلاً قَدْ أُبِّرَتْ فَثَمَرَتُهَا لِلْبَائِعِ إِلاَّ أَنْ يَشْتَرِطَ الْمُبْتَاعُ ‏\".",
    "malay_translation": "Jika sesiapa membeli pokok kelapa sawit yang sudah berbuah, maka buahnya adalah hak milik penjual kecuali jika pembeli membuat syarat."
  },
  {
    "id": 11050,
    "hadith_number": 3773,
    "tajuk_hadith": "Hak Atas Buah Kelapa Sawit Yang Dibeli Batangnya",
    "perawi_melayu": "Nafi melaporkan daripada Ibn Umar (رضي الله عنهما) bahawa Rasulullah SAW bersabda:",
    "english_text": "Whichever tree is bought with its roots, and if it is fecundatedits fruit would belong to one who has grafted it except when the provision is laid down by the buyer.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، جَمِيعًا عَنْ عُبَيْدِ اللَّهِ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَيُّمَا نَخْلٍ اشْتُرِيَ أُصُولُهَا وَقَدْ أُبِّرَتْ فَإِنَّ ثَمَرَهَا لِلَّذِي أَبَّرَهَا إِلاَّ أَنْ يَشْتَرِطَ الَّذِي اشْتَرَاهَا‏\"‏ ‏.‏",
    "malay_translation": "Mana-mana pokok yang dibeli akarnya, dan jika ia berbuah, maka buahnya adalah kepunyaan orang yang telah mencangkoknya kecuali jika pembeli menetapkan perjanjian yang lain."
  },
  {
    "id": 11051,
    "hadith_number": 3774,
    "tajuk_hadith": "Hak Cipta Buah Pokok Yang Dicantumkan",
    "perawi_melayu": "Ibn Umar (رضي الله عنهما) meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Whosoever grafts the tree and then sells its roots, its fruit will belong to one who grafts it except when provision is laid down by the buyer.",
    "arabic_text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا ابْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَيُّمَا امْرِئٍ أَبَّرَ نَخْلاً ثُمَّ بَاعَ أَصْلَهَا فَلِلَّذِي أَبَّرَ ثَمَرُ النَّخْلِ إِلاَّ أَنْ يَشْتَرِطَ الْمُبْتَاعُ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa mencantumkan pokok dan kemudian menjual akarnya, maka hasilnya adalah kepunyaan yang mencantumkannya melainkan jika pembeli telah menetapkan syarat."
  },
  {
    "id": 11052,
    "hadith_number": 3775,
    "tajuk_hadith": "Hadis yang Diriwayatkan dengan Sanad yang Sama",
    "perawi_melayu": "",
    "english_text": "This hadith has been narrated on the authority of Nafi, with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَاهُ أَبُو الرَّبِيعِ، وَأَبُو كَامِلٍ قَالاَ حَدَّثَنَا حَمَّادٌ، ح وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ، كِلاَهُمَا عَنْ أَيُّوبَ، عَنْ نَافِعٍ، بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan berdasarkan perawi Nafi, dengan sanad yang sama."
  },
  {
    "id": 11053,
    "hadith_number": 3776,
    "tajuk_hadith": "Hukum Pemilikan Buah Pokok dan Harta Hamba yang Dibeli",
    "perawi_melayu": "Abdullah bin Umar (رضي الله عنهما) meriwayatkan dari Rasulullah SAW :",
    "english_text": "He who buys a tree after it has been fecundated, its fruit belongs to one who sells it except when the provision has been laid down by the buyer (that it will belong to him), and he who buys a slave, his property belongs to one who sells him except when a provision has been laid down by the buyer (that it will be transferred to him with the slave).",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَمُحَمَّدُ بْنُ رُمْحٍ، قَالاَ أَخْبَرَنَا اللَّيْثُ، ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ، سَعِيدٍ حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنِ ابْتَاعَ نَخْلاً بَعْدَ أَنْ تُؤَبَّرَ فَثَمَرَتُهَا لِلَّذِي بَاعَهَا إِلاَّ أَنْ يَشْتَرِطَ الْمُبْتَاعُ وَمَنِ ابْتَاعَ عَبْدًا فَمَالُهُ لِلَّذِي بَاعَهُ إِلاَّ أَنْ يَشْتَرِطَ الْمُبْتَاعُ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa membeli sebatang pokok buah-buahan setelah berbuah, maka buahnya adalah milik penjual kecuali jika pembeli telah menetapkan syarat bahawa ia menjadi miliknya. Dan barangsiapa membeli hamba, maka hartanya adalah milik penjual kecuali jika pembeli telah menetapkan syarat supaya harta tersebut berpindah kepadanya bersama hamba tersebut."
  },
  {
    "id": 11054,
    "hadith_number": 3777,
    "tajuk_hadith": "Hadis yang Diriwayatkan oleh al-Zuhri",
    "perawi_melayu": "al-Zuhri",
    "english_text": "A hadith like this has been narrated on the authority of al Zuhri.",
    "arabic_text": "وَحَدَّثَنَاهُ يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
    "malay_translation": "Sebuah hadis yang serupa telah diriwayatkan dengan sanad daripada al-Zuhri."
  },
  {
    "id": 11055,
    "hadith_number": 3778,
    "tajuk_hadith": "Hadis Mengenai Perkataan Rasulullah SAW",
    "perawi_melayu": "Ibn Umar daripada bapanya, atas dasar Rasulullah SAW",
    "english_text": "Ibn Umar reported on the authority of his father as Allah's Apostle (ﷺ) saying so.",
    "arabic_text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ أَبَاهُ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ بِمِثْلِهِ ‏.‏",
    "malay_translation": "Ibn Umar meriwayatkan daripada bapanya, bahawa beliau mendengar Rasulullah SAW bersabda demikian."
  },
  {
    "id": 11056,
    "hadith_number": 3779,
    "tajuk_hadith": "Larangan Rasulullah SAW Terhadap Beberapa Jenis Perniagaan dan Jual Beli",
    "perawi_melayu": "Jabir bin Abdullah radhiallahu 'anhu",
    "english_text": "Jabir b. Abdullah (Allah be pleased with them) reported that Allah's Messenger (ﷺ) had forbidden Muhaqala. and Muzabana, Mukhibara and the sale of fruits until their good condition becomes clear, and (he commanded) that (commodities) should not be sold but for the dinar and dirham except in case of araya.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالُوا جَمِيعًا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ وَالْمُخَابَرَةِ وَعَنْ بَيْعِ الثَّمَرِ حَتَّى يَبْدُوَ صَلاَحُهُ وَلاَ يُبَاعُ إِلاَّ بِالدِّينَارِ وَالدِّرْهَمِ إِلاَّ الْعَرَايَا ‏.‏",
    "malay_translation": "Jabir bin Abdullah radhiallahu 'anhu meriwayatkan bahawa Rasulullah SAW telah melarang Muhaqala, Muzabana, Mukhibara dan jual beli buah-buahan sehingga keadaan baiknya jelas. Baginda SAW memerintahkan supaya barangan hanya dijual dengan dinar dan dirham kecuali dalam keadaan araya."
  },
  {
    "id": 11057,
    "hadith_number": 3780,
    "tajuk_hadith": "Larangan Jenis-jenis Perniagaan Tertentu oleh Rasulullah SAW",
    "perawi_melayu": "Jabir bin Abdullah (رضي الله عنهما)",
    "english_text": "Jabir b. 'Abdullah (Allah be pleased with them) reported that Allah's Messenger (ﷺ) forbade the types of sales as described before.",
    "arabic_text": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا أَبُو عَاصِمٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، عَنْ عَطَاءٍ، وَأَبِي، الزُّبَيْرِ أَنَّهُمَا سَمِعَا جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم فَذَكَرَ بِمِثْلِهِ ‏.‏",
    "malay_translation": "Jabir bin Abdullah (رضي الله عنهما) meriwayatkan bahawa Rasulullah SAW melarang jenis-jenis jual beli yang telah disebutkan sebelum ini."
  },
  {
    "id": 11058,
    "hadith_number": 3781,
    "tajuk_hadith": "Larangan Perniagaan Tertentu dan Penjelasannya",
    "perawi_melayu": "Jabir bin Abdullah (رضي الله عنهما) melaporkan bahawa Rasulullah SAW melarang Mukhabara, Muhaqala, dan Muzabana, serta penjualan buah sebelum masak. Ia hanya boleh dijual dengan dirham dan dinar, kecuali 'araya.",
    "english_text": "Jabir explained (these terms) for us. As for Mukhabara it is this that a wasteland is given by a person to another and he makes an investment in it and then gets a share in the produce. According to him (Jabir), Muzabana is the sell of fresh dates on the tree for dry dates with a measure, and Muhaqala in agriculture implies that one should sell the standing crop for grains with a measure.",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا مَخْلَدُ بْنُ يَزِيدَ الْجَزَرِيُّ، حَدَّثَنَا ابْنُ، جُرَيْجٍ أَخْبَرَنِي عَطَاءٌ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُخَابَرَةِ وَالْمُحَاقَلَةِ وَالْمُزَابَنَةِ وَعَنْ بَيْعِ الثَّمَرَةِ حَتَّى تُطْعِمَ وَلاَ تُبَاعُ إِلاَّ بِالدَّرَاهِمِ وَالدَّنَانِيرِ إِلاَّ الْعَرَايَا ‏.‏ قَالَ عَطَاءٌ فَسَّرَ لَنَا جَابِرٌ قَالَ أَمَّا الْمُخَابَرَةُ فَالأَرْضُ الْبَيْضَاءُ يَدْفَعُهَا الرَّجُلُ إِلَى الرَّجُلِ فَيُنْفِقُ فِيهَا ثُمَّ يَأْخُذُ مِنَ الثَّمَرِ ‏.‏ وَزَعَمَ أَنَّ الْمُزَابَنَةَ بَيْعُ الرُّطَبِ فِي النَّخْلِ بِالتَّمْرِ كَيْلاً ‏.‏ وَالْمُحَاقَلَةُ فِي الزَّرْعِ عَلَى نَحْوِ ذَلِكَ يَبِيعُ الزَّرْعَ الْقَائِمَ بِالْحَبِّ كَيْلاً ‏.‏",
    "malay_translation": "Jabir telah menjelaskan (istilah-istilah ini) kepada kami. Mukhabara merujuk kepada pemberian tanah kosong oleh seseorang kepada orang lain, di mana yang kemudian membuat pelaburan di atasnya dan mengambil bahagian dalam hasil.  Menurut Jabir, Muzabana ialah penjualan kurma muda di pokok dengan kurma kering mengikut ukuran, dan Muhaqala dalam pertanian bermaksud menjual tanaman yang sedang tumbuh dengan biji-bijian mengikut ukuran."
  },
  {
    "id": 11059,
    "hadith_number": 3782,
    "tajuk_hadith": "Larangan Pertukaran Tanah dan Kurma serta Penentuan Tempoh Pematangan",
    "perawi_melayu": "Jabir bin Abdullah (رضي الله عنهما) meriwayatkan bahawa Rasulullah SAW melarang Muhaqala, Muzabana, dan Mukhabara, dan pembelian pokok kurma sehingga buahnya masak (kematangan bermaksud warnanya menjadi merah atau kuning, atau sudah boleh dimakan). Dan Muhaqala bermaksud tanah dibeli dengan ukuran makanan yang ditetapkan. Muzabana bermaksud kurma dijual dengan ukuran tamar menggunakan wisq, dan Mukhabara adalah sebahagian (dari hasil), mungkin sepertiga atau seperempat, atau yang serupa dengannya. Zaid (salah seorang perawi) berkata kepada Ata' bin Abi Rabah (perawi yang lain):",
    "english_text": "Did You bear Jabir b. Abdullah (Allah be pleased with them) making a mention of it that he had heard it directly from Allah's Messenger (ﷺ)? He said: Yes.",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ، كِلاَهُمَا عَنْ زَكَرِيَّاءَ، قَالَ ابْنُ أَبِي خَلَفٍ حَدَّثَنَا زَكَرِيَّاءُ بْنُ عَدِيٍّ، أَخْبَرَنَا عُبَيْدُ اللَّهِ، عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ، حَدَّثَنَا  أَبُو الْوَلِيدِ الْمَكِّيُّ، وَهُوَ جَالِسٌ عِنْدَ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ وَالْمُخَابَرَةِ وَأَنْ تُشْتَرَى النَّخْلُ حَتَّى تُشْقِهَ - وَالإِشْقَاهُ أَنْ يَحْمَرَّ أَوْ يَصْفَرَّ أَوْ يُؤْكَلَ مِنْهُ شَىْءٌ - وَالْمُحَاقَلَةُ أَنْ يُبَاعَ الْحَقْلُ بِكَيْلٍ مِنَ الطَّعَامِ مَعْلُومٍ وَالْمُزَابَنَةُ أَنْ يُبَاعَ النَّخْلُ بِأَوْسَاقٍ مِنَ التَّمْرِ وَالْمُخَابَرَةُ الثُّلُثُ وَالرُّبُعُ وَأَشْبَاهُ ذَلِكَ ‏.‏ قَالَ زَيْدٌ قُلْتُ لِعَطَاءِ بْنِ أَبِي رَبَاحٍ أَسَمِعْتَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَذْكُرُ هَذَا عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ ‏.‏",
    "malay_translation": "Ya, perawi ini (Jabir bin Abdullah) mendengar sendiri daripada Rasulullah SAW."
  },
  {
    "id": 11060,
    "hadith_number": 3783,
    "tajuk_hadith": "Larangan Menjual Buah Sebelum Masak dan Maknanya",
    "perawi_melayu": "Jabir bin Abdullah (رضي الله عنهما) meriwayatkan bahawa Rasulullah SAW melarang Muzabana, Muhaqala, dan Mukhabara serta penjualan buah-buahan sehingga masak.",
    "english_text": "What does ripening imply? He said: It meant that they become red or become yellow and are fit for eating.",
    "arabic_text": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ هَاشِمٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا سَلِيمُ بْنُ حَيَّانَ، حَدَّثَنَا سَعِيدُ بْنُ، مِينَاءَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُزَابَنَةِ وَالْمُحَاقَلَةِ وَالْمُخَابَرَةِ وَعَنْ بَيْعِ الثَّمَرَةِ حَتَّى تُشْقِحَ ‏.‏ قَالَ قُلْتُ لِسَعِيدٍ مَا تُشْقِحُ قَالَ تَحْمَارُّ وَتَصْفَارُّ وَيُؤْكَلُ مِنْهَا ‏.‏",
    "malay_translation": "Apakah yang dimaksudkan dengan masak? Beliau berkata: Ia bermaksud buah-buahan itu menjadi merah atau kuning dan sesuai dimakan."
  },
  {
    "id": 11061,
    "hadith_number": 3784,
    "tajuk_hadith": "Larangan Perniagaan Mu'awama dan Pengecualian untuk Perniagaan Araya",
    "perawi_melayu": "Jabir bin Abdullah (رضي الله عنهما) melaporkan Rasulullah SAW melarang Muhaqala, Muzabana, Mu'awama, dan Mukhabara. (Salah seorang perawi berkata):",
    "english_text": "Sale years ahead is Mu'awama, and making exceptional but he made an exemption of araya.",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، وَمُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ، - وَاللَّفْظُ لِعُبَيْدِ اللَّهِ - قَالاَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي الزُّبَيْرِ، وَسَعِيدِ بْنِ مِينَاءَ، عَنْ جَابِرِ بْنِ، عَبْدِ اللَّهِ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ وَالْمُعَاوَمَةِ وَالْمُخَابَرَةِ - قَالَ أَحَدُهُمَا بَيْعُ السِّنِينَ هِيَ الْمُعَاوَمَةُ - وَعَنِ الثُّنْيَا وَرَخَّصَ فِي الْعَرَايَا ‏.‏",
    "malay_translation": "Penjualan tahun-tahun mendatang adalah Mu'awama, dan membuat pengecualian tetapi beliau memberi pengecualian untuk transaksi Araya."
  },
  {
    "id": 11062,
    "hadith_number": 3785,
    "tajuk_hadith": "Hadis Tentang Perniagaan dan Perjanjian Mu'awama",
    "perawi_melayu": "Jabir (رضي الله عنه)",
    "english_text": "Satu hadis seperti ini telah diriwayatkan oleh Jabir (Allah SWT redha dengannya) daripada Rasulullah SAW. Namun, ia tidak menyebut tentang perniagaan jangka panjang (beberapa tahun akan datang), yang bermaksud Mu'awama.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ حُجْرٍ، قَالاَ حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ عُلَيَّةَ - عَنْ أَيُّوبَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ بِمِثْلِهِ غَيْرَ أَنَّهُ لاَ يَذْكُرُ بَيْعُ السِّنِينَ هِيَ الْمُعَاوَمَةُ ‏.‏",
    "malay_translation": "Satu hadis yang serupa telah diriwayatkan daripada Jabir (Allah SWT redha dengannya) melalui Rasulullah SAW. Namun, ia tidak menyebut tentang urusan jual beli jangka masa panjang yang merangkumi perjanjian Mu'awama."
  },
  {
    "id": 11063,
    "hadith_number": 3786,
    "tajuk_hadith": "Larangan Meminta Sewa Tanah, Menjual Tanah dan Buah-Buahan Awal",
    "perawi_melayu": "",
    "english_text": "Jabir b. Abdullah (Allah be pleased with them) reported that Allah's Messenger (ﷺ) forbade leasing of land, and selling ahead for years and selling of fruits before they become ripe.",
    "arabic_text": "وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ، حَدَّثَنَا رَبَاحُ بْنُ، أَبِي مَعْرُوفٍ قَالَ سَمِعْتُ عَطَاءً، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ كِرَاءِ الأَرْضِ وَعَنْ بَيْعِهَا السِّنِينَ وَعَنْ بَيْعِ الثَّمَرِ حَتَّى يَطِيبَ ‏.‏",
    "malay_translation": "Jabir bin Abdullah (Semoga Allah meridainya) meriwayatkan bahawa Rasulullah SAW melarang menyewa tanah, menjual tanah dan buah-buahan sebelum masak dan matang."
  },
  {
    "id": 11064,
    "hadith_number": 3787,
    "tajuk_hadith": "Larangan Memasarkan Tanah Sewa-menyewa",
    "perawi_melayu": "",
    "english_text": "Jabir b. Abdullah (Allah SWT bersetuju dengan mereka) melaporkan Rasulullah SAW telah melarang peminjaman tanah.",
    "arabic_text": "وَحَدَّثَنِي أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا حَمَّادٌ، - يَعْنِي ابْنَ زَيْدٍ - عَنْ مَطَرٍ الْوَرَّاقِ، عَنْ عَطَاءٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ كِرَاءِ الأَرْضِ ‏.‏",
    "malay_translation": "Jabir bin Abdullah (Allah SWT redha dengan mereka) meriwayatkan bahawa Rasulullah SAW telah melarang penyewaan tanah. "
  },
  {
    "id": 11065,
    "hadith_number": 3788,
    "tajuk_hadith": "Keutamaan Mengusahakan Tanah Sendiri atau Menerusi Saudara",
    "perawi_melayu": "Jabir bin Abdullah r.a. meriwayatkan daripada Rasulullah s.a.w.",
    "english_text": "He who has land should cultivate it himself, but if he does not cultivate it himself, then he should let his brother cultivate it.",
    "arabic_text": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ الْفَضْلِ، - لَقَبُهُ عَارِمٌ وَهُوَ أَبُو النُّعْمَانِ السَّدُوسِيُّ - حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ، حَدَّثَنَا مَطَرٌ الْوَرَّاقُ، عَنْ عَطَاءٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا فَإِنْ لَمْ يَزْرَعْهَا فَلْيُزْرِعْهَا أَخَاهُ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa yang memiliki tanah, hendaklah dia mengusahakannya sendiri. Namun, jika dia tidak mengusahakannya sendiri, maka hendaklah dia izinkan saudaranya untuk mengusahakannya."
  },
  {
    "id": 11066,
    "hadith_number": 3789,
    "tajuk_hadith": "Kegunaan Tanah Luas dan Kepentingan Pemberiannya",
    "perawi_melayu": "Jabir bin Abdullah (رضي الله عنهما) melaporkan bahawa ada di kalangan sahabat Rasulullah SAW yang memiliki tanah yang berlebihan. Lalu Rasulullah SAW bersabda:",
    "english_text": "He, who has surplus land (in his possession) should cultivate it, or he should lend it to his brother for benefit, but if he refuses to accept it, he should retain it.",
    "arabic_text": "حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى، حَدَّثَنَا هِقْلٌ، - يَعْنِي ابْنَ زِيَادٍ - عَنِ الأَوْزَاعِيِّ، عَنْ عَطَاءٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كَانَ لِرِجَالٍ فُضُولُ أَرَضِينَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ كَانَتْ لَهُ فَضْلُ أَرْضٍ فَلْيَزْرَعْهَا أَوْ لِيَمْنَحْهَا أَخَاهُ فَإِنْ أَبَى فَلْيُمْسِكْ أَرْضَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Sesiapa yang memiliki tanah yang berlebihan, hendaklah dia menanam atau menghadiahkannya kepada saudaranya untuk dimanfaatkan. Jika saudaranya enggan menerimanya, maka hendaklah dia menyimpan tanah itu untuk dirinya."
  },
  {
    "id": 11067,
    "hadith_number": 3790,
    "tajuk_hadith": "Larangan Mengambil Sewa atau Bahagian Tanah",
    "perawi_melayu": "Jabir bin Abdullah r.a.",
    "english_text": "Jabir b. Abdullah (Allah be pleased with them) reported Allah's Messenger (ﷺ) having forbidden taking of rent or share of land.",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا مُعَلَّى بْنُ مَنْصُورٍ الرَّازِيُّ، حَدَّثَنَا خَالِدٌ، أَخْبَرَنَا الشَّيْبَانِيُّ، عَنْ بُكَيْرِ بْنِ الأَخْنَسِ، عَنْ عَطَاءٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُؤْخَذَ لِلأَرْضِ أَجْرٌ أَوْ حَظٌّ ‏.‏",
    "malay_translation": "Jabir bin Abdullah r.a. meriwayatkan bahawa Rasulullah SAW melarang mengambil sewa atau sebahagian daripada tanah."
  },
  {
    "id": 11068,
    "hadith_number": 3791,
    "tajuk_hadith": "Kewajipan Mengusahakan Tanah dan Membantu Saudara Muslim",
    "perawi_melayu": "Jabir (رضي الله عنه) meriwayatkan dari Rasulullah SAW:",
    "english_text": "He who has land should cultivate it, but if he does not find it possible to cultivate it, or finds himself helpless to do so, he should lend it to his Muslim brother, but he should not accept rent from him.",
    "arabic_text": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عَبْدُ الْمَلِكِ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا فَإِنْ لَمْ يَسْتَطِعْ أَنْ يَزْرَعَهَا وَعَجَزَ عَنْهَا فَلْيَمْنَحْهَا أَخَاهُ الْمُسْلِمَ وَلاَ يُؤَاجِرْهَا إِيَّاهُ ‏\"‏ ‏.‏",
    "malay_translation": "Barang siapa yang memiliki tanah, hendaklah ia mengusahakannya. Namun, jika ia tidak mampu mengusahakannya atau merasa tidak berdaya untuk mengusahakannya, hendaklah ia meminjamkannya kepada saudaranya yang Muslim, tetapi janganlah ia mengenakan sewa padanya."
  },
  {
    "id": 11069,
    "hadith_number": 3792,
    "tajuk_hadith": "Keharusan Menyemai Tanah Sendiri atau Melalui Saudara",
    "perawi_melayu": "Sulaiman bin Musa bertanya kepada Ata':",
    "english_text": "Did Jabir b. 'Abdullah (Allah be pleased with them) reported Allah's Apostle (ﷺ) as saying:\" He who has land should cultivate it himself, or let his brother cultivate it, and should not give on rent\"? He said: Yes.",
    "arabic_text": "وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا هَمَّامٌ، قَالَ سَأَلَ سُلَيْمَانُ بْنُ مُوسَى عَطَاءً فَقَالَ أَحَدَّثَكَ جَابِرُ بْنُ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ لِيُزْرِعْهَا أَخَاهُ وَلاَ يُكْرِهَا ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏",
    "malay_translation": "Adakah Jabir bin Abdullah (semoga Allah merahmati mereka) meriwayatkan bahawa Rasulullah SAW bersabda: \"Sesiapa yang memiliki tanah, hendaklah dia menanamnya sendiri, atau biarkan saudaranya menanamnya, dan janganlah dia menyewakannya.\" Beliau (Ata') menjawab: Ya."
  },
  {
    "id": 11070,
    "hadith_number": 3793,
    "tajuk_hadith": "Larangan Mukhabara oleh Rasulullah SAW",
    "perawi_melayu": "",
    "english_text": "Jabir (redha Allah dengannya) meriwayatkan bahawa Rasulullah SAW telah melarang Mukhabara.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ الْمُخَابَرَةِ ‏.‏",
    "malay_translation": "Jabir (redha Allah dengannya) meriwayatkan bahawa Rasulullah SAW telah melarang amalan Mukhabara.  Hadis ini menerangkan larangan Rasulullah SAW terhadap amalan Mukhabara, yang mungkin merujuk kepada bentuk perjanjian atau transaksi tertentu yang dianggap tidak dibenarkan oleh Islam.  Penting untuk diperhatikan bahawa perincian tentang Mukhabara perlu dirujuk kepada tafsiran dan penjelasan yang lebih mendalam tentang hadith ini."
  },
  {
    "id": 11071,
    "hadith_number": 3794,
    "tajuk_hadith": "Keutamaan Mengusahakan Tanah dan Larangan Menjualnya",
    "perawi_melayu": "Jabir bin Abdullah r.a. mendengar Rasulullah SAW bersabda:",
    "english_text": "He who has surplus of land should either cultivate it himself, or let his brother cultivate it, an should not sell it. I (the narrator) said to Sa'id: What does his statement\" do not sell it\" mean? Does it imply\" rent\"? He said: Yes.",
    "arabic_text": "وَحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ، حَدَّثَنَا سَلِيمُ بْنُ، حَيَّانَ حَدَّثَنَا سَعِيدُ بْنُ مِينَاءَ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ كَانَ لَهُ فَضْلُ أَرْضٍ فَلْيَزْرَعْهَا أَوْ لِيُزْرِعْهَا أَخَاهُ وَلاَ تَبِيعُوهَا ‏\"‏ ‏.‏ فَقُلْتُ لِسَعِيدٍ مَا قَوْلُهُ وَلاَ تَبِيعُوهَا يَعْنِي الْكِرَاءَ ‏.‏ قَالَ نَعَمْ ‏.‏",
    "malay_translation": "Barangsiapa yang memiliki kelebihan tanah, hendaklah dia mengusahakannya sendiri, atau menyuruh saudaranya mengusahakannya, dan janganlah dia menjualnya. Aku (pencerita) berkata kepada Sa'id: Apakah maksud perkataannya \"janganlah dijual itu\"? Adakah ia bermaksud \"menyewakan\"? Dia berkata: Ya."
  },
  {
    "id": 11072,
    "hadith_number": 3795,
    "tajuk_hadith": "Kewajipan Menjaga dan Mengusahakan Tanah",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan:",
    "english_text": "Kami biasa menyewa tanah pada zaman Rasulullah SAW dan kami mendapat bahagian daripada bijirin yang tertinggal di tangkai setelah ditumbuk dan sesuatu yang tidak ditentukan. Rasulullah SAW bersabda: Sesiapa yang memiliki tanah, hendaklah dia mengusahakannya atau menyuruh saudaranya mengusahakannya; kalau tidak, biarkanlah ia.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ كُنَّا نُخَابِرُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَنُصِيبُ مِنَ الْقِصْرِيِّ وَمِنْ كَذَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ فَلْيُحْرِثْهَا أَخَاهُ وَإِلاَّ فَلْيَدَعْهَا‏\"‏ ‏.‏",
    "malay_translation": "Kami biasa menyewa tanah pada zaman Rasulullah SAW dan kami mendapat bahagian daripada bijirin yang tertinggal di tangkai setelah ditumbuk dan sesuatu yang tidak ditentukan. Rasulullah SAW bersabda: Sesiapa yang memiliki tanah, hendaklah dia mengusahakannya atau menyuruh saudaranya mengusahakannya; kalau tidak, biarkanlah ia."
  },
  {
    "id": 11073,
    "hadith_number": 3796,
    "tajuk_hadith": "Keutamaan Menjaga dan Mengusahakan Tanah",
    "perawi_melayu": "Jabir bin Abdullah r.a. meriwayatkan:",
    "english_text": "We used to get land (on rent) during the lifetime of Allah's Messeuge, (ﷺ) with a share of one-third or one-fourth (of the produce from the land irrigated) with the help of canals. Thereupon Allah's Messenger (ﷺ) stood up (to address) and said: HRe who has land should cultivate it, and if he does not cultivate it, he should lend it to his brother, and if he does not lend it to his brother, he should then retain it.",
    "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَأَحْمَدُ بْنُ عِيسَى، جَمِيعًا عَنِ ابْنِ وَهْبٍ، - قَالَ ابْنُ عِيسَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، - حَدَّثَنِي هِشَامُ بْنُ سَعْدٍ، أَنَّ أَبَا الزُّبَيْرِ الْمَكِّيَّ، حَدَّثَهُ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ كُنَّا فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم نَأْخُذُ الأَرْضَ بِالثُّلُثِ أَوِ الرُّبُعِ بِالْمَاذِيَانَاتِ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ذَلِكَ فَقَالَ ‏\n\"‏ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا فَإِنْ لَمْ يَزْرَعْهَا فَلْيَمْنَحْهَا أَخَاهُ فَإِنْ لَمْ يَمْنَحْهَا أَخَاهُ فَلْيُمْسِكْهَا ‏\"‏ ‏.‏",
    "malay_translation": "Kami pernah menerima tanah (sewa) pada zaman Rasulullah SAW dengan bahagian sepertiga atau seperempat (hasil tanaman dari tanah yang disiram) dengan bantuan terusan. Lalu Rasulullah SAW berdiri dan bersabda, \"Barang siapa yang memiliki tanah, hendaklah dia mengusahakannya. Jika dia tidak mengusahakannya, hendaklah dia meminjamkannya kepada saudaranya. Jika dia tidak meminjamkannya kepada saudaranya, hendaklah dia menyimpannya.\""
  },
  {
    "id": 11074,
    "hadith_number": 3797,
    "tajuk_hadith": "Keutamaan Memberi Sedekah Tanah",
    "perawi_melayu": "Jabir bin Abdullah رضي الله عنه melaporkan:",
    "english_text": "I heard Allah's Apostle (ﷺ) as saying: He who has (surplus) land should donate it (to others), or lend it.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سُلَيْمَانَ، حَدَّثَنَا أَبُو سُفْيَانَ، عَنْ جَابِرٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَهَبْهَا أَوْ لِيُعِرْهَا ‏\"‏ ‏.‏",
    "malay_translation": "Telah diceritakan kepada kami oleh Muhammad bin Al-Musanna, yang telah diceritakan kepadanya oleh Yahya bin Hammad, yang telah diceritakan kepadanya oleh Abu ‘Awana, dari Sulaiman, yang telah diceritakan kepadanya oleh Abu Sufyan, dari Jabir, yang berkata, \"Saya mendengar Rasulullah SAW bersabda:\" Barangsiapa yang mempunyai tanah (lebih), maka hendaklah ia sedekahkan atau pinjamkannya. \""
  },
  {
    "id": 11075,
    "hadith_number": 3798,
    "tajuk_hadith": "Perbezaan Kata-kata dalam Riwayat Hadith",
    "perawi_melayu": "",
    "english_text": "This hadith has been narrated on the authority of A'mash with the same chain of transmitters, but with a slight change of words.",
    "arabic_text": "وَحَدَّثَنِيهِ حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا أَبُو الْجَوَّابِ، حَدَّثَنَا عَمَّارُ بْنُ رُزَيْقٍ، عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّهُ قَالَ ‏\n\"‏ فَلْيَزْرَعْهَا أَوْ فَلْيُزْرِعْهَا رَجُلاً ‏\"‏ ‏.‏",
    "malay_translation": "Hadith ini diriwayatkan oleh A'mash dengan sanad yang sama, tetapi dengan sedikit perbezaan dalam perkataan."
  },
  {
    "id": 11076,
    "hadith_number": 3799,
    "tajuk_hadith": "Larangan Sewa Tanah Menurut Hadis",
    "perawi_melayu": "Jabir bin Abdullah (redha Allah dengan mereka) meriwayatkan bahawa Rasulullah SAW melarang menyewakan tanah. Bukair (salah seorang perawi) berkata:",
    "english_text": "Nafi` reported to me that he heard Ibn `Umar (Allah be pleased with them) saying: We usedto give land on rent; we then abandoned this practice when we heard the hadith of Rafi` b. Khadij.",
    "arabic_text": "وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، - وَهُوَ ابْنُ الْحَارِثِ - أَنَّ بُكَيْرًا، حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ أَبِي سَلَمَةَ حَدَّثَهُ عَنِ النُّعْمَانِ بْنِ أَبِي عَيَّاشٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ كِرَاءِ الأَرْضِ ‏.‏ \n قَالَ بُكَيْرٌ وَحَدَّثَنِي نَافِعٌ، أَنَّهُ سَمِعَ ابْنَ عُمَرَ، يَقُولُ كُنَّا نُكْرِي أَرْضَنَا ثُمَّ تَرَكْنَا ذَلِكَ حِينَ سَمِعْنَا حَدِيثَ رَافِعِ بْنِ خَدِيجٍ ‏.‏",
    "malay_translation": "Nafi' meriwayatkan kepada saya bahawa beliau mendengar Ibn `Umar (redha Allah dengan mereka) berkata: Kami pernah menyewakan tanah, kemudian kami meninggalkannya setelah mendengar hadis Rafi' bin Khadij."
  },
  {
    "id": 11077,
    "hadith_number": 3800,
    "tajuk_hadith": "Larangan Menjual Tanah Terbiar",
    "perawi_melayu": "",
    "english_text": "Jabir (redha Allah dengannya) melaporkan Rasulullah SAW melarang menjual (menyewa) tanah yang belum diusahakan selama dua tahun atau tiga tahun.",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الأَرْضِ الْبَيْضَاءِ سَنَتَيْنِ أَوْ ثَلاَثًا ‏.‏",
    "malay_translation": "Jabir (redha Allah dengannya) meriwayatkan bahawa Rasulullah SAW melarang menjual (menyewa) tanah yang belum diusahakan selama dua tahun atau tiga tahun.  Ini menunjukkan keprihatinan terhadap penggunaan sumber-sumber tanah dengan baik dan mengelakkan sebarang eksploitasi dalam sektor pertanian."
  },
  {
    "id": 11078,
    "hadith_number": 3801,
    "tajuk_hadith": "Larangan Menjual Hasil Bumi di Masa Depan",
    "perawi_melayu": "Jabir (رضي الله عنه) meriwayatkan bahawa Rasulullah SAW melarang jual beli hasil buah-buahan untuk dua tahun ke hadapan.",
    "english_text": "\" Selling of the fruits (on the tree) in advance for two years.\"",
    "arabic_text": "وَحَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَأَبُو بَكْرِ بْنُ شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ حُمَيْدٍ الأَعْرَجِ، عَنْ سُلَيْمَانَ بْنِ عَتِيقٍ، عَنْ جَابِرٍ، قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ بَيْعِ السِّنِينَ ‏.‏ وَفِي رِوَايَةِ ابْنِ أَبِي شَيْبَةَ عَنْ بَيْعِ الثَّمَرِ سِنِينَ ‏.‏",
    "malay_translation": "Rasulullah SAW melarang menjual buah-buahan (yang masih berada di pokok) untuk tempoh dua tahun ke hadapan.  Dalam riwayat lain, disebutkan larangan ini merangkumi jual beli semua jenis hasil buah-buahan untuk jangka waktu dua tahun."
  },
  {
    "id": 11079,
    "hadith_number": 3802,
    "tajuk_hadith": "Tanggungjawab Pemilik Tanah dan Amalan Bermanfaat",
    "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan dari Rasulullah SAW :",
    "english_text": "He who has land should cultivate it or lend it to his brother, but if he refuses, he should retain his land.",
    "arabic_text": "حَدَّثَنَا حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، حَدَّثَنَا أَبُو تَوْبَةَ، حَدَّثَنَا مُعَاوِيَةُ، عَنْ يَحْيَى بْنِ، أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ لِيَمْنَحْهَا أَخَاهُ فَإِنْ أَبَى فَلْيُمْسِكْ أَرْضَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa yang memiliki tanah, hendaklah dia mengusahakannya atau memberikannya kepada saudaranya. Jika saudaranya enggan, maka dia boleh menyimpan tanahnya.  Rasulullah SAW bersabda demikian."
  },
  {
    "id": 11080,
    "hadith_number": 3803,
    "tajuk_hadith": "Larangan Menjual Buah dengan Kurma dan Sewa Tanah",
    "perawi_melayu": "Jabir bin Abdullah (رضي الله عنهما) meriwayatkan:",
    "english_text": "I heard Allah's Messenger (ﷺ) forbidding Muzabana, and Huqul. Jabir b. Abdullah (Allah be pleased with them) said: Muzabana means the selling of fruits for dry dates and Huqul is the renting of land.",
    "arabic_text": "وَحَدَّثَنَا الْحَسَنُ الْحُلْوَانِيُّ، حَدَّثَنَا أَبُو تَوْبَةَ، حَدَّثَنَا مُعَاوِيَةُ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، أَنَّ يَزِيدَ بْنَ نُعَيْمٍ، أَخْبَرَهُ أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ أَخْبَرَهُ أَنَّهُ، سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَنْهَى عَنِ الْمُزَابَنَةِ وَالْحُقُولِ ‏.‏ فَقَالَ جَابِرُ بْنُ عَبْدِ اللَّهِ الْمُزَابَنَةُ الثَّمَرُ بِالتَّمْرِ ‏.‏ وَالْحُقُولُ كِرَاءُ الأَرْضِ ‏.‏",
    "malay_translation": "Telah diberitakan kepada kami oleh al-Hasan al-Hulwani, beliau berkata telah diberitakan kepada kami oleh Abu Tوبة, beliau berkata telah diberitakan kepada kami oleh Mu'awiyah, dari Yahya bin Abi Kaisir, bahawa Yazid bin Nu'aim telah memberitahunya, bahawa Jabir bin Abdullah telah memberitahunya bahawa beliau telah mendengar Rasulullah SAW melarang muzabana dan huqul. Jabir bin Abdullah berkata: Muzabana ialah pertukaran buah-buahan dengan kurma, dan huqul ialah menyewa tanah."
  },
  {
    "id": 11081,
    "hadith_number": 3804,
    "tajuk_hadith": "Larangan Rasulullah SAW terhadap Muhaqala dan Muzabana",
    "perawi_melayu": "Abu Hurairah رضي الله عنه",
    "english_text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) forbidding Muhaqala and Muzabana.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ - عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ ‏.",
    "malay_translation": "Abu Hurairah رضي الله عنه meriwayatkan bahawa Rasulullah SAW melarang Muhaqala dan Muzabana."
  },
  {
    "id": 11082,
    "hadith_number": 3805,
    "tajuk_hadith": "Larangan Rasulullah SAW terhadap Mazabana dan Muhaqala",
    "perawi_melayu": "",
    "english_text": "Abu Sa'id al-Khudri (Allah be pleased with him) reported Allah's Messenger (ﷺ) having forbidden Mazabana and Muhaqala. Muzibana means the buying of fruits on the trees and Muhaqala is the renting of land.",
    "arabic_text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، أَنَّ أَبَا سُفْيَانَ، مَوْلَى ابْنِ أَبِي أَحْمَدَ أَخْبَرَهُ أَنَّهُ، سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُزَابَنَةِ وَالْمُحَاقَلَةِ ‏.‏ وَالْمُزَابَنَةُ اشْتِرَاءُ الثَّمَرِ فِي رُءُوسِ النَّخْلِ ‏.‏ وَالْمُحَاقَلَةُ كِرَاءُ الأَرْضِ ‏.‏",
    "malay_translation": "Abu Sa'id al-Khudri (semoga Allah meridainya) melaporkan bahawa Rasulullah SAW telah melarang Mazabana dan Muhaqala. Mazabana bermaksud membeli buah-buahan yang berada di atas pokok, dan Muhaqala bermaksud menyewa tanah."
  },
  {
    "id": 11083,
    "hadith_number": 3806,
    "tajuk_hadith": "Larangan Menyewa Tanah Menurut Nabi SAW (ﷺ)",
    "perawi_melayu": "Zaid bin Amr meriwayatkan:",
    "english_text": "I heard Ibn Umar (Allah be pleased with them) say: We did not see any harm in renting of the land, but as the first year was over Rafi' alleged Allah's Apostle (ﷺ) having forbidden that.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو الرَّبِيعِ الْعَتَكِيُّ، قَالَ أَبُو الرَّبِيعِ حَدَّثَنَا وَقَالَ، يَحْيَى أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرٍو، قَالَ سَمِعْتُ ابْنَ عُمَرَ، يَقُولُ كُنَّا لاَ نَرَى بِالْخِبْرِ بَأْسًا حَتَّى كَانَ عَامُ أَوَّلَ فَزَعَمَ رَافِعٌ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم نَهَى عَنْهُ ‏.‏",
    "malay_translation": "Aku mendengar Ibn Umar (semoga Allah meridhai mereka berdua) berkata: Kami tidak melihat keburukan dalam menyewa tanah, tetapi setelah tahun pertama berlalu, Rafi' mendakwa bahawa Rasulullah SAW telah melarangnya."
  },
  {
    "id": 11084,
    "hadith_number": 3807,
    "tajuk_hadith": "Menolak Sewa atas Sebab tertentu",
    "perawi_melayu": "Hadith ini diriwayatkan daripada Amr bin Dinar dengan sanad yang sama tetapi dalam riwayat 'Uyainah terdapat tambahan.",
    "english_text": "\" We abandoned it (renting) on account of that.\"",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ، ح وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ، وَإِبْرَاهِيمُ، بْنُ دِينَارٍ قَالاَ حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ عُلَيَّةَ - عَنْ أَيُّوبَ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، كُلُّهُمْ عَنْ عَمْرِو بْنِ دِينَارٍ، بِهَذَا الإِسْنَادِ ‏.‏ مِثْلَهُ وَزَادَ فِي حَدِيثِ ابْنِ عُيَيْنَةَ فَتَرَكْنَاهُ مِنْ أَجْلِهِ ‏.‏",
    "malay_translation": "Kami meninggalkannya (menetapkan sewa) disebabkan perkara itu."
  },
  {
    "id": 11085,
    "hadith_number": 3808,
    "tajuk_hadith": "Larangan Mengambil Manfaat Tanah dari Rafi",
    "perawi_melayu": "Ibn 'Umar (رضي الله عنهما) meriwayatkan:",
    "english_text": "Rafi forbade us from benefitting from our land (in the form of rent).",
    "arabic_text": "وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ أَبِي الْخَلِيلِ، عَنْ مُجَاهِدٍ، قَالَ قَالَ ابْنُ عُمَرَ لَقَدْ مَنَعَنَا رَافِعٌ نَفْعَ أَرْضِنَا ‏.‏",
    "malay_translation": "Rafi melarang kita daripada mengambil manfaat daripada tanah kita (dalam bentuk sewa). "
  },
  {
    "id": 11086,
    "hadith_number": 3809,
    "tajuk_hadith": "Larangan Menyewa Tanah Menurut Rasulullah SAW",
    "perawi_melayu": "Nafi melaporkan bahawa Ibnu Umar (رضي الله عنهما) menyewakan tanahnya semasa hayat Rasulullah SAW dan semasa pemerintahan Khalifah Abu Bakar, Umar, dan Uthman (رضي الله عنهم) serta awal pemerintahan Muawiyah sehingga pada akhir pemerintahan Muawiyah, khabar mengenai perawi Rafi bin Khadij (رضي الله عنه) yang menceritakan larangan Rasulullah SAW mengenai perkara tersebut sampai kepadanya. Ibnu Umar kemudiannya meninggalkan amalan menyewakan tanah dan jika ditanya mengenainya, beliau menjawab:",
    "english_text": "Allah's Messenger (ﷺ) used to forbid the renting of land. So Ibn Umar (Allah be pleased with them) abandoned it, and subsequently whenever he was asked about it, he said: Rafi b. Khadij (Allah be pleased with him) alleged that Allah's Messenger (ﷺ) forbade it.",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، كَانَ يُكْرِي مَزَارِعَهُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَفِي إِمَارَةِ أَبِي بَكْرٍ وَعُمَرَ وَعُثْمَانَ وَصَدْرًا مِنْ خِلاَفَةِ مُعَاوِيَةَ حَتَّى بَلَغَهُ فِي آخِرِ خِلاَفَةِ مُعَاوِيَةَ أَنَّ رَافِعَ بْنَ خَدِيجٍ يُحَدِّثُ فِيهَا بِنَهْىٍ عَنِ النَّبِيِّ صلى الله عليه وسلم فَدَخَلَ عَلَيْهِ وَأَنَا مَعَهُ فَسَأَلَهُ فَقَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَنْهَى عَنْ كِرَاءِ الْمَزَارِعِ ‏.‏ فَتَرَكَهَا ابْنُ عُمَرَ بَعْدُ ‏.‏ وَكَانَ إِذَا سُئِلَ عَنْهَا بَعْدُ قَالَ زَعَمَ رَافِعُ بْنُ خَدِيجٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْهَا ‏.‏",
    "malay_translation": "Rasulullah SAW  biasa melarang penyewaan tanah. Oleh itu, Ibnu Umar (رضي الله عنهما) telah meninggalkannya, dan kemudiannya apabila ditanya mengenainya, beliau berkata: Rafi bin Khadij (رضي الله عنه) mendakwa bahawa Rasulullah SAW melarang penyewaan tanah."
  },
  {
    "id": 11087,
    "hadith_number": 3810,
    "tajuk_hadith": "Ibn Umar Meninggalkan Penyewaan Tanah",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Ayyub dan beliau menambah dalam hadis yang diriwayatkan oleh Ibn Ulayya dengan berkata:",
    "english_text": "Ibn Umar abandoned it afterwards and he did not rent it (the land).",
    "arabic_text": "وَحَدَّثَنَا أَبُو الرَّبِيعِ، وَأَبُو كَامِلٍ قَالاَ حَدَّثَنَا حَمَّادٌ، ح وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا إِسْمَاعِيلُ، كِلاَهُمَا عَنْ أَيُّوبَ، بِهَذَا الإِسْنَادِ ‏.‏ مِثْلَهُ وَزَادَ فِي حَدِيثِ ابْنِ عُلَيَّةَ قَالَ فَتَرَكَهَا ابْنُ عُمَرَ بَعْدَ ذَلِكَ فَكَانَ لاَ يُكْرِيهَا ‏.‏",
    "malay_translation": "Kemudian, Ibn Umar meninggalkannya dan tidak menyewakannya (tanah tersebut)."
  },
  {
    "id": 11088,
    "hadith_number": 3811,
    "tajuk_hadith": "Larangan Menyewakan Tanah Menurut Rasulullah SAW",
    "perawi_melayu": "Nafi melaporkan:",
    "english_text": "I went to Rafi b. Khadij in the company of Ibn 'Umar (All be pleased with them) until he (Ibn 'Umar) came to him at Balat (a place near Prophet's Mosque at Medina) and he (Rafi b. Khadij) informed him that Allah's Messenger (ﷺ) had forbidden the renting of land.",
    "arabic_text": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، قَالَ ذَهَبْتُ مَعَ ابْنِ عُمَرَ إِلَى رَافِعِ بْنِ خَدِيجٍ حَتَّى أَتَاهُ بِالْبَلاَطِ فَأَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ كِرَاءِ الْمَزَارِعِ ‏.‏",
    "malay_translation": "Aku pergi bersama Ibn 'Umar ke rumah Rafi bin Khadij sehingga Ibn 'Umar sampai ke tempatnya di Balat (tempat berdekatan Masjid Nabawi di Madinah). Lalu, Rafi bin Khadij memberitahunya bahawa Rasulullah SAW melarang menyewakan tanah."
  },
  {
    "id": 11089,
    "hadith_number": 3812,
    "tajuk_hadith": "Hadis tentang Perawi dan Penuturan Rasulullah SAW",
    "perawi_melayu": "Nafi, dari Ibn Umar (redha Allah dengan mereka) bahawa beliau menemui Rafi, dan Rafi meriwayatkan hadith ini daripada Rasulullah SAW.",
    "english_text": "Nafi, reported from Ibn Umar (Allah be pleated with them) that he came to Rafi and he narrated this hadith from Allah's Apostle (ﷺ).",
    "arabic_text": "وَحَدَّثَنِي ابْنُ أَبِي خَلَفٍ، وَحَجَّاجُ بْنُ الشَّاعِرِ، قَالاَ حَدَّثَنَا زَكَرِيَّاءُ بْنُ عَدِيٍّ، أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو، عَنْ زَيْدٍ، عَنِ الْحَكَمِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ أَتَى رَافِعًا فَذَكَرَ هَذَا الْحَدِيثَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Nafi, daripada Ibn Umar (redha Allah dengan mereka) meriwayatkan bahawa beliau telah menemui Rafi, dan Rafi telah meriwayatkan hadith ini daripada Rasulullah SAW. Ia diteruskan dengan perantaraan beberapa perawi yang lain seperti Ibn Abi Khalaf, Hajjaj bin Asy-Syu'air, Zakaria bin 'Adi, Ubaidullah bin 'Amru, Zaid, dan Al-Hakam."
  },
  {
    "id": 11090,
    "hadith_number": 3813,
    "tajuk_hadith": "Larangan Menyewakan Tanah Menurut Rasulullah SAW",
    "perawi_melayu": "Nafi, meriwayatkan bahawa Ibn Umar (رضي الله عنهما) pernah menyewakan tanah, dan beliau diberitahu hadis daripada Rafi bin Khadijah.",
    "english_text": "He then went to him along with me. He (Rafi) narrated from some of his uncles in which it was mentioned that Allah's Apostle (ﷺ) forbade the renting of land. Ibn 'Umar (Allah be pleased with them) then abandoned this practice of renting.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا حُسَيْنٌ، - يَعْنِي ابْنَ حَسَنِ بْنِ يَسَارٍ - حَدَّثَنَا ابْنُ، عَوْنٍ عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، كَانَ يَأْجُرُ الأَرْضَ - قَالَ - فَنُبِّئَ حَدِيثًا عَنْ رَافِعِ بْنِ خَدِيجٍ - قَالَ - فَانْطَلَقَ بِي مَعَهُ إِلَيْهِ - قَالَ - فَذَكَرَ عَنْ بَعْضِ عُمُومَتِهِ ذَكَرَ فِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ نَهَى عَنْ كِرَاءِ الأَرْضِ ‏.‏ قَالَ فَتَرَكَهُ ابْنُ عُمَرَ فَلَمْ يَأْجُرْهُ ‏.‏",
    "malay_translation": "Kemudian beliau (yang bernama Rafi) pergi bersamanya. Beliau (Rafi) meriwayatkan daripada beberapa orang pakciknya bahawa Rasulullah SAW telah melarang menyewakan tanah. Ibn Umar (رضي الله عنهما) kemudian meninggalkan amalan menyewakan tanah itu."
  },
  {
    "id": 11091,
    "hadith_number": 3814,
    "tajuk_hadith": "Hadits Berbeza Rangkaian Perawi",
    "perawi_melayu": "",
    "english_text": "This hadith has been narrated through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، حَدَّثَنَا ابْنُ عَوْنٍ، بِهَذَا الإِسْنَادِ وَقَالَ فَحَدَّثَهُ عَنْ بَعْضِ، عُمُومَتِهِ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Hadis ini telah diriwayatkan melalui rangkaian perawi yang lain."
  },
  {
    "id": 11092,
    "hadith_number": 3815,
    "tajuk_hadith": "Larangan Sewa Tanah Menurut Nabi SAW: Perbahasan dan Kekeliruan",
    "perawi_melayu": "Salim bin Abdullah melaporkan bahawa AbduUah bin Umar (redha Allah dengan mereka) biasa menyewakan tanah sehingga berita bahawa Rafi bin Khadij Ansari melarang menyewakan tanah sampai kepadanya. Abdullah menemui beliau dan berkata:",
    "english_text": "Ibn Khadij, what is this that you narrate from Allah's Messenger (ﷺ) pertaining to renting of land? Rafi b. Khadij said to Abdullah: I heard it from two uncles of mine and they had participated in the Battle of Badr who narrated to the members of the family that Allah's Messenger (ﷺ) forbade the renting of land. Abdullah said: I knew it that the land was rented during the lifetime of Allah's Messenger (ﷺ). Abdullah then apprehended that Allah's Messenger (ﷺ) might have said something new in this connection (in regard to prohibition of renting) which I failed to know. So he abandoned the renting of land.",
    "arabic_text": "وَحَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يُكْرِي أَرَضِيهِ حَتَّى بَلَغَهُ أَنَّ رَافِعَ بْنَ خَدِيجٍ الأَنْصَارِيَّ كَانَ يَنْهَى عَنْ كِرَاءِ الأَرْضِ فَلَقِيَهُ عَبْدُ اللَّهِ فَقَالَ يَا ابْنَ خَدِيجٍ مَاذَا تُحَدِّثُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي كِرَاءِ الأَرْضِ قَالَ رَافِعُ بْنُ خَدِيجٍ لِعَبْدِ اللَّهِ سَمِعْتُ عَمَّىَّ - وَكَانَا قَدْ شَهِدَا بَدْرًا - يُحَدِّثَانِ أَهْلَ الدَّارِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ كِرَاءِ الأَرْضِ ‏.‏ قَالَ عَبْدُ اللَّهِ لَقَدْ كُنْتُ أَعْلَمُ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّ الأَرْضَ تُكْرَى ثُمَّ خَشِيَ عَبْدُ اللَّهِ أَنْ يَكُونَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَحْدَثَ فِي ذَلِكَ شَيْئًا لَمْ يَكُنْ عَلِمَهُ فَتَرَكَ كِرَاءَ الأَرْضِ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdul Malik bin Syu'aib bin Laits bin Saad, telah menceritakan kepadaku ayahku, dari nenek buyutku, telah menceritakan kepadaku Uqail bin Khalid, dari Ibnu Syihab, bahawa dia berkata, telah menceritakan kepadaku Salim bin Abdul Rahman bahawa Abdullah bin Umar, dahulu menyewakan tanahnya sehingga sampai berita kepadanya bahawa Rafi bin Khadijah al-Ansari melarang menyewakan tanah. Abdullah bertemu dengannya dan bertanya, \"Wahai Ibnu Khadijah, apakah yang engkau sampaikan daripada Rasulullah صلى الله عليه وسلم mengenai menyewakan tanah?\" Rafi bin Khadijah menjawab kepada Abdullah, \"Aku mendengar daripada dua orang pakcikku – dan mereka berdua pernah turut serta dalam Perang Badar – menceritakan kepada ahli keluarga bahawa Rasulullah صلى الله عليه وسلم melarang menyewakan tanah.\" Abdullah berkata, \"Aku tahu bahawa tanah itu disewakan semasa hayat Rasulullah صلى الله عليه وسلم. Kemudian, Abdullah bimbang bahawa Rasulullah صلى الله عليه وسلم mungkin telah memperbaharui sesuatu perkara dalam hal ini (tentang larangan menyewa) yang aku tidak mengetahuinya. Oleh itu, dia berhenti daripada menyewakan tanah."
  },
  {
    "id": 11093,
    "hadith_number": 3816,
    "tajuk_hadith": "Larangan Mengkontrak Tanah Dengan Syarat Sebahagian Hasil dan Makanan Tertentu",
    "perawi_melayu": "Rafi bin Khadij (رضي الله عنه) meriwayatkan:",
    "english_text": "We used to give on rent land during the lifetime of Allah's Messenger (ﷺ). We rented it on the share of one-third or one-fourth of the (produce) along with a definite quantity of corn. One day a person from among my uncles came to us and said: Allah's Messenger (ﷺ) forbade us this act which was a source of benefit to us, but the obedience to Allah and to His Messenger (ﷺ) is more beneficial to us. He forbade us that we should rent land with one-third or one-fourth of (the produce) and the corn of a measure, and he commanded the owner of land that he should cultivate it or let it be cultivated by other (persons) but he showed disapproval of renting it or anything besides it.",
    "arabic_text": "وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالاَ حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ عُلَيَّةَ - عَنْ أَيُّوبَ، عَنْ يَعْلَى بْنِ حَكِيمٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ كُنَّا نُحَاقِلُ الأَرْضَ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَنُكْرِيهَا بِالثُّلُثِ وَالرُّبُعِ وَالطَّعَامِ الْمُسَمَّى فَجَاءَنَا ذَاتَ يَوْمٍ رَجُلٌ مِنْ عُمُومَتِي فَقَالَ نَهَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَمْرٍ كَانَ لَنَا نَافِعًا وَطَوَاعِيَةُ اللَّهِ وَرَسُولِهِ أَنْفَعُ لَنَا نَهَانَا أَنْ نُحَاقِلَ بِالأَرْضِ فَنُكْرِيَهَا عَلَى الثُّلُثِ وَالرُّبُعِ وَالطَّعَامِ الْمُسَمَّى وَأَمَرَ رَبَّ الأَرْضِ أَنْ يَزْرَعَهَا أَوْ يُزْرِعَهَا وَكَرِهَ كِرَاءَهَا وَمَا سِوَى ذَلِكَ ‏.‏",
    "malay_translation": "Kami pernah menyewakan tanah pada zaman Rasulullah SAW dengan syarat sepertiga atau seperempat daripada hasil tanaman bersama dengan jumlah makanan tertentu. Pada suatu hari, seorang saudara sepupu datang dan berkata: Rasulullah SAW telah melarang perbuatan ini yang pernah memberi manfaat kepada kita, tetapi taat kepada Allah dan Rasul-Nya lebih bermanfaat bagi kita. Baginda melarang kita menyewa tanah dengan syarat sepertiga atau seperempat daripada hasil tanaman dan makanan yang diukur, dan Baginda mewajibkan pemilik tanah untuk menanamnya sendiri atau menyuruh orang lain menanamnya. Baginda tidak menyukai penyewaan tanah dan apa-apa syarat selainnya."
  },
  {
    "id": 11094,
    "hadith_number": 3817,
    "tajuk_hadith": "Perkongsian Tanah Sewa Sewa",
    "perawi_melayu": "Rafi bin Khadij (Semoga Allah merahmatinya) meriwayatkan:",
    "english_text": "Kami biasa menyewakan tanah, dan kami menyewakannya dengan kadar sepertiga atau seperempat. Selebihnya daripada hadis ini adalah sama.",
    "arabic_text": "وَحَدَّثَنَاهُ يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، قَالَ كَتَبَ إِلَىَّ يَعْلَى بْنُ حَكِيمٍ قَالَ سَمِعْتُ سُلَيْمَانَ بْنَ يَسَارٍ، يُحَدِّثُ عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ كُنَّا نُحَاقِلُ بِالأَرْضِ فَنُكْرِيهَا عَلَى الثُّلُثِ وَالرُّبُعِ ‏.‏ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ ابْنِ عُلَيَّةَ ‏.‏",
    "malay_translation": "Kami biasa menyewakan tanah, dan kami menyewakannya dengan kadar sepertiga atau seperempat bahagian. Selebihnya daripada hadis ini adalah sama."
  },
  {
    "id": 11095,
    "hadith_number": 3818,
    "tajuk_hadith": "Sanad yang Sama dengan Hadis Terdahulu",
    "perawi_melayu": "",
    "english_text": "Another chain narrated the same as the above hadith.",
    "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، ح وَحَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الأَعْلَى، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدَةُ، كُلُّهُمْ عَنِ ابْنِ أَبِي عَرُوبَةَ، عَنْ يَعْلَى بْنِ حَكِيمٍ، بِهَذَا الإِسْنَادِ ‏.‏ مِثْلَهُ ‏.‏",
    "malay_translation": "Satu lagi rangkaian perawi meriwayatkan hadis yang sama dengan hadis di atas."
  },
  {
    "id": 11096,
    "hadith_number": 3819,
    "tajuk_hadith": "Hadis Mengenai Perawi Rafi' bin Khadij dan Tiada Sebutan tentang Sebahagian Pakcik-Pakciknya",
    "perawi_melayu": "Rafi' bin Khadij",
    "english_text": "Hadis ini diriwayatkan melalui sanad yang sama seperti riwayat sebelumnya oleh Rafi' bin Khadij, tetapi tidak menyebut tentang sebahagian pakcik-pakciknya.",
    "arabic_text": "وَحَدَّثَنِيهِ أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي جَرِيرُ بْنُ حَازِمٍ، عَنْ يَعْلَى بْنِ، حَكِيمٍ بِهَذَا الإِسْنَادِ عَنْ رَافِعِ بْنِ خَدِيجٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم وَلَمْ يَقُلْ عَنْ بَعْضِ عُمُومَتِهِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan melalui sanad yang sama seperti riwayat sebelumnya oleh Rafi' bin Khadij, tetapi tidak menyebut tentang sebahagian pakcik-pakciknya."
  },
  {
    "id": 11097,
    "hadith_number": 3820,
    "tajuk_hadith": "Larangan Rasulullah SAW Terhadap Amalan Pertanian Tertentu",
    "perawi_melayu": "Rafi (رضي الله عنه) melaporkan bahawa Zuhair bin Rafi (yang merupakan pakciknya) datang kepadaku dan berkata:",
    "english_text": "Allah's Messenger (ﷺ) forbade a practice which was useful for us. I said: What is this? (I believe) that whatever Allah's Messenger (ﷺ) says is absolutely true. He (Zuhair) said that he (the Holy Prophet) asked me: What do you do with your cultivable lands? I said: Allah's Messenger, we rent those irrigated by canals for dry dates or barley. He said: Don't do that. Cultivate them or let them be cultivated (by others) or retain them yourself.",
    "arabic_text": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا أَبُو مُسْهِرٍ، حَدَّثَنِي يَحْيَى بْنُ حَمْزَةَ، حَدَّثَنِي أَبُو عَمْرٍو الأَوْزَاعِيُّ، عَنْ أَبِي النَّجَاشِيِّ، مَوْلَى رَافِعِ بْنِ خَدِيجٍ عَنْ رَافِعٍ، أَنَّ ظُهَيْرَ بْنَ رَافِعٍ، - وَهُوَ عَمُّهُ - قَالَ أَتَانِي ظُهَيْرٌ فَقَالَ لَقَدْ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَمْرٍ كَانَ بِنَا رَافِقًا ‏.‏ فَقُلْتُ وَمَا ذَاكَ مَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَهُوَ حَقٌّ ‏.‏ قَالَ سَأَلَنِي كَيْفَ تَصْنَعُونَ بِمَحَاقِلِكُمْ فَقُلْتُ نُؤَاجِرُهَا يَا رَسُولَ اللَّهِ عَلَى الرَّبِيعِ أَوِ الأَوْسُقِ مِنَ التَّمْرِ أَوِ الشَّعِيرِ ‏.‏ قَالَ ‏\n\"‏ فَلاَ تَفْعَلُوا ازْرَعُوهَا أَوْ أَزْرِعُوهَا أَوْ أَمْسِكُوهَا ‏\"‏ ‏.‏",
    "malay_translation": "Utusan Allah SAW telah melarang suatu amalan yang dulunya bermanfaat kepada kita. Aku bertanya: Apakah amalan itu? (Aku percaya) bahawa apa yang dikatakan oleh Utusan Allah SAW adalah benar.  Katanya, baginda bertanya kepadaku: \"Bagaimana kamu menguruskan tanah-tanah kamu?\" Kataku, \"Wahai Rasulullah, kami menyewakan tanah-tanah yang disaliri air untuk mendapatkan kurma kering atau barli.\". Baginda menjawab, \"Janganlah kamu lakukan demikian. Tanamlah tanah itu atau biarkan orang lain menanamnya, atau simpanlah tanah itu untuk kamu sendiri.\""
  },
  {
    "id": 11098,
    "hadith_number": 3821,
    "tajuk_hadith": "Hadis tentang Ketidaksebutan tentang Pakcik Zuhair",
    "perawi_melayu": "",
    "english_text": "Hadis ini telah disampaikan dengan izin daripada Rafi dari Nabi saw tentang perkara ini, tetapi beliau tidak menyebut tentang pakciknya, Zuhair.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ، عَنْ أَبِي النَّجَاشِيِّ، عَنْ رَافِعٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا وَلَمْ يَذْكُرْ عَنْ عَمِّهِ ظُهَيْرٍ.",
    "malay_translation": "Hadis ini disampaikan oleh Rafi daripada Nabi SAW berkenaan perkara ini, tetapi beliau tidak menyebut tentang pakciknya, Zuhair."
  },
  {
    "id": 11099,
    "hadith_number": 3822,
    "tajuk_hadith": "Larangan Menyewakan Tanah dan Pembayaran Sewa dengan Emas dan Perak",
    "perawi_melayu": "Hanzala bin Qais meriwayatkan bahawa beliau bertanya kepada Rafi bin Khadij tentang menyewakan tanah, dan baginda menjawab:",
    "english_text": "Allah's Messenger (ﷺ) forbade the renting of land. I said: Is it forbidden (even if it is paid) in gold (dinar) and silver (dirham)? Thereupon he said: If it is paid in gold and silver, there is no harm in it.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ حَنْظَلَةَ بْنِ قَيْسٍ، أَنَّهُ سَأَلَ رَافِعَ بْنَ خَدِيجٍ عَنْ كِرَاءِ الأَرْضِ، فَقَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ كِرَاءِ الأَرْضِ قَالَ فَقُلْتُ أَبِالذَّهَبِ وَالْوَرِقِ فَقَالَ أَمَّا بِالذَّهَبِ وَالْوَرِقِ فَلاَ بَأْسَ بِهِ ‏.‏",
    "malay_translation": "Rasulullah SAW melarang menyewakan tanah. Saya bertanya, \"Adakah dilarang sekalipun bayarannya menggunakan emas (dinar) dan perak (dirham)?\" Baginda menjawab, \"Jika dibayar dengan emas dan perak, tidak mengapa.\""
  },
  {
    "id": 11100,
    "hadith_number": 3823,
    "tajuk_hadith": "Pandangan Rasulullah SAW tentang Sewa Tanah dengan Emas dan Perak",
    "perawi_melayu": "Hanzala bin Qais al-Ansari meriwayatkan:",
    "english_text": "I asked Rafi' b. Khadij about the renting of land for gold and silver, whereupon he said: There is no harm in it for the people let out land situated near canals and at the ends of the streamlets or portion of fields. (But it so happened) that at times this was destroyed and that was saved. whereas (on other occasions) this portion was saved and the other was destroyed and thus no rent was payable to the people (who let out lands) but for this one (which was saved). It was due to this that he (the Holy Prophet) prohibited it. But if there is something definite and reliable (e. g. money). there is no harm in it.",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ رَبِيعَةَ بْنِ أَبِي، عَبْدِ الرَّحْمَنِ حَدَّثَنِي حَنْظَلَةُ بْنُ قَيْسٍ الأَنْصَارِيُّ، قَالَ سَأَلْتُ رَافِعَ بْنَ خَدِيجٍ عَنْ كِرَاءِ الأَرْضِ، بِالذَّهَبِ وَالْوَرِقِ فَقَالَ لاَ بَأْسَ بِهِ إِنَّمَا كَانَ النَّاسُ يُؤَاجِرُونَ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم عَلَى الْمَاذِيَانَاتِ وَأَقْبَالِ الْجَدَاوِلِ وَأَشْيَاءَ مِنَ الزَّرْعِ فَيَهْلِكُ هَذَا وَيَسْلَمُ هَذَا وَيَسْلَمُ هَذَا وَيَهْلِكُ هَذَا فَلَمْ يَكُنْ لِلنَّاسِ كِرَاءٌ إِلاَّ هَذَا فَلِذَلِكَ زُجِرَ عَنْهُ ‏.‏ فَأَمَّا شَىْءٌ مَعْلُومٌ مَضْمُونٌ فَلاَ بَأْسَ بِهِ ‏.‏",
    "malay_translation": "Saya bertanya kepada Rafi' bin Khadij tentang menyewa tanah dengan emas dan perak, lalu beliau menjawab: Tidak mengapa melakukannya, tetapi orang-orang pada zaman Nabi SAW hanya menyewa tanah yang terletak di sekitar saluran air dan di tepi sungai atau sebahagian daripada ladang. Kadangkala sebahagian daripada tanah itu musnah sementara yang lain selamat. Begitu juga sebaliknya. Oleh itu, tidak ada sewa yang dikenakan kepada orang-orang yang menyewakan tanah melainkan tanah yang selamat sahaja. Kerana hal ini, (Nabi SAW) melarang (cara penyewaan ini). Tetapi jika sesuatu itu pasti dan boleh dipercayai (contohnya wang), tidak mengapa."
  },
  {
    "id": 11101,
    "hadith_number": 3824,
    "tajuk_hadith": "Larangan Menentukan Hasil Tanaman Secara Bersekongkol dan Penjelasan Mengenai Bayaran Wang",
    "perawi_melayu": "Hanzalah meriwayatkan daripada Rafi' bin Khadijah (رضي الله عنه) yang berkata:",
    "english_text": "We were the major agriculturists of the Ansar and so we let out land (saying): The produce of this (part of land) would be ours and (the produce) of that would be theirs. But it so happened that at times this (land) gave harvest, but the other one produced nothing. So he (the Holy Prophet) forbade this. But so far as the payment in silver (dirham, a coin) is concerned, he did not forbid.",
    "arabic_text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ حَنْظَلَةَ، الزُّرَقِيِّ أَنَّهُ سَمِعَ رَافِعَ بْنَ خَدِيجٍ، يَقُولُ كُنَّا أَكْثَرَ الأَنْصَارِ حَقْلاً - قَالَ - كُنَّا نُكْرِي الأَرْضَ عَلَى أَنَّ لَنَا هَذِهِ وَلَهُمْ هَذِهِ فَرُبَّمَا أَخْرَجَتْ هَذِهِ وَلَمْ تُخْرِجْ هَذِهِ فَنَهَانَا عَنْ ذَلِكَ وَأَمَّا الْوَرِقُ فَلَمْ يَنْهَنَا ‏.‏",
    "malay_translation": "Kami merupakan petani utama kalangan Ansar, maka kami menyewakan tanah dengan syarat hasil dari tanah ini untuk kami dan hasil dari tanah itu untuk mereka. Namun, kadangkala tanah ini menghasilkan tanaman, tetapi tanah yang lain tidak. Maka, Baginda (Nabi SAW) melarang cara demikian. Tetapi sekiranya pembayaran dalam bentuk perak (dirham), Baginda tidak melarangnya."
  },
  {
    "id": 11102,
    "hadith_number": 3825,
    "tajuk_hadith": "Hadis yang Diriwayatkan dengan Sanad yang Sama",
    "perawi_melayu": "Yahya bin Sa'id",
    "english_text": "This hadith has been narrated on the authority of Yahya b. Sa'id with the same chain of transmitters.",
    "arabic_text": "حَدَّثَنَا أَبُو الرَّبِيعِ، حَدَّثَنَا حَمَّادٌ، ح وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، جَمِيعًا عَنْ يَحْيَى بْنِ سَعِيدٍ، بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏",
    "malay_translation": "Hadis ini telah diriwayatkan dengan kuasa Yahya bin Sa'id dengan sanad yang sama."
  },
  {
    "id": 11103,
    "hadith_number": 3826,
    "tajuk_hadith": "Larangan Muzara'ah (Pertanian Bagi Hasil Bersama) Nabi SAW",
    "perawi_melayu": "Abdullah bin al Sa'ib melaporkan:",
    "english_text": "I asked Abdullah b. Ma'qil about Muzara'a (cultivating land on share basis in the produce). He said: Thabit b. Dahhak informed me that Allah's Messenger (ﷺ) forbade Muzara'a as Ibn Abu Shaiba forbade it with a slight change of words. He (the narrator) said: I asked Ibn Ma'qil but he did not name 'Abdullah.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي، شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، كِلاَهُمَا عَنِ الشَّيْبَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِ، قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ مَعْقِلٍ عَنِ الْمُزَارَعَةِ، فَقَالَ أَخْبَرَنِي ثَابِتُ بْنُ الضَّحَّاكِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُزَارَعَةِ ‏.‏ وَفِي رِوَايَةِ ابْنِ أَبِي شَيْبَةَ نَهَى عَنْهَا ‏.‏ وَقَالَ سَأَلْتُ ابْنَ مَعْقِلٍ ‏.‏ وَلَمْ يُسَمِّ عَبْدَ اللَّهِ ‏.‏",
    "malay_translation": "Saya bertanya kepada Abdullah bin Ma'qil tentang Muzara'ah (menanam tanaman secara berkongsi hasil). Beliau berkata: Thabit bin Dahhak memberitahu saya bahawa Rasulullah SAW melarang Muzara'ah. Begitu juga Ibn Abu Shaiba melarangnya dengan sedikit perbezaan perkataan. Beliau (perawi) berkata: Saya bertanya kepada Ibn Ma'qil tetapi beliau tidak menyebut nama 'Abdullah."
  },
  {
    "id": 11104,
    "hadith_number": 3827,
    "tajuk_hadith": "Larangan Muzara'ah dan Keharusan Sewa Menyewa Tanaman",
    "perawi_melayu": "Abdullah bin al-Sa'ib meriwayatkan:",
    "english_text": "We visited 'Abdullah b. Ma'qil and asked him about sharing of crops, whereupon he said: Thabit alleged that Allah's Messenger (ﷺ) forbade Muzara'a and commanded leasing it out on rent (for money) and said: There is no harm in it.",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا يَحْيَى بْنُ حَمَّادٍ، أَخْبَرَنَا أَبُو عَوَانَةَ، عَنْ سُلَيْمَانَ، الشَّيْبَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِ، قَالَ دَخَلْنَا عَلَى عَبْدِ اللَّهِ بْنِ مَعْقِلٍ فَسَأَلْنَاهُ عَنِ الْمُزَارَعَةِ، فَقَالَ زَعَمَ ثَابِتٌ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُزَارَعَةِ وَأَمَرَ بِالْمُؤَاجَرَةِ وَقَالَ ‏\n\"‏ لاَ بَأْسَ بِهَا ‏\"‏ ‏.‏",
    "malay_translation": "Kami mengunjungi 'Abdullah bin Ma'qil dan bertanya kepadanya mengenai perkongsian hasil tanaman, lalu beliau berkata: Thabit mendakwa bahawa Rasulullah SAW melarang Muzara'ah dan memerintahkan penyewaannya dengan bayaran sewa (dengan wang) dan bersabda: 'Tidak mengapa.' (Tidak mengapa melakukannya)."
  },
  {
    "id": 11105,
    "hadith_number": 3828,
    "tajuk_hadith": "Keutamaan Memanfaatkan Tanah Kepada Saudara Berbanding Memungut Sewa",
    "perawi_melayu": "Mujahid berkata kepada Tawus:",
    "english_text": "Come along with me to Ibn Rafi b. Khadij in order to listen from him the hadith transmitted on the authority of his father (pertaining to the renting of land) from Allah's Apostle (ﷺ). He (Tawus) scolded him and said: By Allah, it I were to know that Allah's Messenger (ﷺ) had forbidden it, I would have never done it. But it has been narrated to me by one who has better knowledge of it amongst them (and he meant Ibn 'Abbas) that Allah's Messenger (ﷺ) said: It is better if a person lends, his land to his brother (for cultivation) than that he gets recognised rent on it.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرٍو، أَنَّ مُجَاهِدًا، قَالَ لِطَاوُسٍ انْطَلِقْ بِنَا إِلَى ابْنِ رَافِعِ بْنِ خَدِيجٍ فَاسْمَعْ مِنْهُ الْحَدِيثَ عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم - قَالَ - فَانْتَهَرَهُ قَالَ إِنِّي وَاللَّهِ لَوْ أَعْلَمُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْهُ مَا فَعَلْتُهُ وَلَكِنْ حَدَّثَنِي مَنْ هُوَ أَعْلَمُ بِهِ مِنْهُمْ - يَعْنِي ابْنَ عَبَّاسٍ - أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لأَنْ يَمْنَحَ الرَّجُلُ أَخَاهُ أَرْضَهُ خَيْرٌ لَهُ مِنْ أَنْ يَأْخُذَ عَلَيْهَا خَرْجًا مَعْلُومًا ‏\"‏ ‏.‏",
    "malay_translation": "Telah diberitahu kepada kami oleh Yahya bin Yahya, yang diberitahu oleh Hammad bin Zaid, daripada 'Amru, bahawa Mujahid berkata kepada Tawus: Marilah kita pergi kepada Ibn Rafi bin Khadijah untuk mendengar hadis daripada bapanya tentang Rasulullah SAW (berkenaan dengan penyewaan tanah). Tawus menegurnya dan berkata: Demi Allah, sekiranya aku tahu bahawa Rasulullah SAW melarang amalan ini, aku tidak akan melakukannya. Tetapi telah diceritakan kepadaku oleh orang yang lebih arif di kalangan mereka (iaitu Ibn 'Abbas) bahawa Rasulullah SAW bersabda: Lebih baik seseorang memberi tanahnya kepada saudaranya (untuk diusahakan) daripada mengenakan sewa yang ditetapkan."
  },
  {
    "id": 11106,
    "hadith_number": 3829,
    "tajuk_hadith": "Pandangan Rasulullah SAW Tentang Pertanian Sewa Menyewa (Mukhabara)",
    "perawi_melayu": "Tawus melaporkan bahawa beliau menyewakan tanahnya, lalu Amr berkata:",
    "english_text": "I said to him: Abu Abd al-Rahrman, I wish if you abandon this renting of land, for they alleged that Allah's Apostle (ﷺ) forbade Mukhabara. He siad: Amr, one who has informed me has the best knowledge of it among them (he meant Ibn Abbas). (He said) that Allah's Apostle (ﷺ) did not prohibit it altogether, but said: Lending of land by one among you to his brother is better for him than getting a specified amount of produce from it.",
    "arabic_text": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، وَابْنُ، طَاوُسٍ عَنْ طَاوُسٍ، أَنَّهُ كَانَ يُخَابِرُ قَالَ عَمْرٌو فَقُلْتُ لَهُ يَا أَبَا عَبْدِ الرَّحْمَنِ لَوْ تَرَكْتَ هَذِهِ الْمُخَابَرَةَ فَإِنَّهُمْ يَزْعُمُونَ أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ الْمُخَابَرَةِ ‏.‏ فَقَالَ أَىْ عَمْرُو أَخْبَرَنِي أَعْلَمُهُمْ بِذَلِكَ يَعْنِي ابْنَ عَبَّاسٍ أَنَّ النَّبِيَّ صلى الله عليه وسلم لَمْ يَنْهَ عَنْهَا إِنَّمَا قَالَ ‏\n\"‏ يَمْنَحُ أَحَدُكُمْ أَخَاهُ خَيْرٌ لَهُ مِنْ أَنْ يَأْخُذَ عَلَيْهَا خَرْجًا مَعْلُومًا ‏\"‏ ‏.‏",
    "malay_translation": "Aku berkata kepadanya: Wahai Abu Abd al-Rahman, alangkah baiknya jika engkau tinggalkan amalan menyewakan tanah ini, kerana mereka mendakwa bahawa Rasulullah SAW melarang Mukhabara. Beliau berkata: Wahai Amr, orang yang memberitahuku mengenainya mempunyai pengetahuan terbaik di kalangan mereka (maksudnya Ibnu Abbas). Beliau berkata bahawa Rasulullah SAW tidak mengharamkannya sepenuhnya, tetapi bersabda: \"Memberi pinjaman tanah oleh seseorang di antara kamu kepada saudaranya adalah lebih baik baginya daripada mengambil hasil yang ditentukan darinya.\""
  },
  {
    "id": 11107,
    "hadith_number": 3830,
    "tajuk_hadith": "Hadis yang Diriwayatkan melalui Ibnu Abbas",
    "perawi_melayu": "",
    "english_text": "A hadith like this has been transmitted on the authority of Ibn Abbas (Allah be pleased with them).",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا الثَّقَفِيُّ، عَنْ أَيُّوبَ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ وَكِيعٍ، عَنْ سُفْيَانَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنِ ابْنِ جُرَيْجٍ، ح وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، عَنْ شَرِيكٍ، عَنْ شُعْبَةَ، كُلُّهُمْ عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ نَحْوَ حَدِيثِهِمْ ‏.‏",
    "malay_translation": "Sebuah hadis yang serupa dengan ini diriwayatkan berdasarkan perkataan Ibn Abbas (semoga Allah merahmati mereka). "
  },
  {
    "id": 11108,
    "hadith_number": 3831,
    "tajuk_hadith": "Keutamaan Memberi Tanah kepada Saudara",
    "perawi_melayu": "Ibn Abbas (رضي الله عنه) meriwayatkan daripada Rasulullah SAW:",
    "english_text": "If one among you lets out land to his brother, that is better for him than if he receives such and such (the definite thing). Ibn 'Abbis (Allah be pleased with them) said: It is Haql, and in the parlance of the Ansr it is Muhaqala.",
    "arabic_text": "وَحَدَّثَنِي عَبْدُ بْنُ حُمَيْدٍ، وَمُحَمَّدُ بْنُ رَافِعٍ، - قَالَ عَبْدٌ أَخْبَرَنَا وَقَالَ ابْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، - أَخْبَرَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لأَنْ يَمْنَحَ أَحَدُكُمْ أَخَاهُ أَرْضَهُ خَيْرٌ لَهُ مِنْ أَنْ يَأْخُذَ عَلَيْهَا كَذَا وَكَذَا ‏\"‏ ‏.‏ لِشَىْءٍ مَعْلُومٍ ‏.‏ قَالَ وَقَالَ ابْنُ عَبَّاسٍ هُوَ الْحَقْلُ وَهُوَ بِلِسَانِ الأَنْصَارِ الْمُحَاقَلَةُ.",
    "malay_translation": "Jika seseorang di antara kamu menyewakan tanah kepada saudaranya, itu lebih baik baginya daripada menerima sesuatu yang tertentu (perkara yang tertentu itu). Ibn 'Abbis (Allah SWT berbahagia dengannya) berkata: Ia adalah *Haql*, dan dalam bahasa kaum Ansar ia adalah *Muhaqala*."
  },
  {
    "id": 11109,
    "hadith_number": 3832,
    "tajuk_hadith": "Keutamaan Memberi Sewa Tanah Kepada Saudara",
    "perawi_melayu": "Ibnu Abbas r.a. meriwayatkan dari Rasulullah SAW bahawa:",
    "english_text": "He who has land, it is better for him that he should let it out to his brother.",
    "arabic_text": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الرَّقِّيُّ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو، عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ، عَنْ عَبْدِ الْمَلِكِ أَبِي زَيْدٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ، عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ كَانَتْ لَهُ أَرْضٌ فَإِنَّهُ أَنْ يَمْنَحَهَا أَخَاهُ خَيْرٌ ‏\"‏ ‏.‏",
    "malay_translation": "Sesiapa yang memiliki tanah, lebih baik baginya menyewakannya kepada saudaranya."
  }
]