[
  {
    "id": 14230,
    "hadith_number": 6953,
    "tajuk_hadith": "Syurga Dikelilingi Kesusahan, Neraka Dikelilingi Keinginan",
    "perawi_melayu": "Anas bin Malik meriwayatkan:",
    "english_text": "The Paradise is surrounded by hardships and the Hell-Fire is surrounded by temptations.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، وَحُمَيْدٍ، عَنْ \n أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ حُفَّتِ الْجَنَّةُ بِالْمَكَارِهِ وَحُفَّتِ\n النَّارُ بِالشَّهَوَاتِ ‏\"‏ ‏.‏",
    "malay_translation": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda:  \"Syurga itu dikelilingi oleh kesusahan, dan neraka itu dikelilingi oleh keinginan nafsu.\""
  },
  {
    "id": 14231,
    "hadith_number": 6954,
    "tajuk_hadith": "Sanad Hadis daripada Abu Hurairah",
    "perawi_melayu": "Zuhair bin Harb melalui Syababah, Warqaa', Abu Az-Zinad, Al-A'raj, dan Abu Hurairah",
    "english_text": "This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنِي وَرْقَاءُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ،\n عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Abu Hurairah melalui sanad yang lain.  Zuhair bin Harb meriwayatkan daripada Syababah, yang meriwayatkan daripada Warqaa', yang meriwayatkan daripada Abu Az-Zinad, yang meriwayatkan daripada Al-A'raj, yang meriwayatkan daripada Abu Hurairah, daripada Nabi SAW."
  },
  {
    "id": 14232,
    "hadith_number": 6955,
    "tajuk_hadith": "Ganjaran Bagi Hamba-Hamba Allah Yang Soleh",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Allah the Exalted and Glorious, said: I have prepared for My pious servants which no eye has ever seen, and no ear has ever heard, and no human heart has ever perceived but it is testified by the Book of Allah. He then recited:\" No soul knows what comfort has been concealed from them, as a reward for what they did\". (xxxii. 17)",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الأَشْعَثِيُّ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالَ زُهَيْرٌ حَدَّثَنَا وَقَالَ، سَعِيدٌ\n أَخْبَرَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم\n قَالَ ‏\"‏ قَالَ اللَّهُ عَزَّ وَجَلَّ أَعْدَدْتُ لِعِبَادِيَ الصَّالِحِينَ مَا لاَ عَيْنٌ رَأَتْ وَلاَ أُذُنٌ سَمِعَتْ وَلاَ\n خَطَرَ عَلَى قَلْبِ بَشَرٍ ‏\"‏ ‏.‏ مِصْدَاقُ ذَلِكَ فِي كِتَابِ اللَّهِ ‏{‏ فَلاَ تَعْلَمُ نَفْسٌ مَا أُخْفِيَ لَهُمْ مِنْ\n قُرَّةِ أَعْيُنٍ جَزَاءً بِمَا كَانُوا يَعْمَلُونَ‏}‏",
    "malay_translation": "Allah SWT berfirman:  Aku telah menyediakan untuk hamba-hambaKu yang soleh sesuatu yang tidak pernah dilihat oleh mata, didengar oleh telinga, mahupun terlintas di hati manusia.  Namun ia telah disahkan dalam Kitab Allah.  Kemudian baginda membaca:  \"Tiada satu jiwa pun mengetahui nikmat apa yang disembunyikan untuk mereka sebagai balasan terhadap apa yang telah mereka lakukan.\" (as-Sajadah: 17)"
  },
  {
    "id": 14233,
    "hadith_number": 6956,
    "tajuk_hadith": "Ganjaran Allah SWT untuk hamba-hambaNya yang soleh",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Allah, the Exalted and Glorious, said: I have prepared for My pious servants which no eye (has ever) seen, no ear has (ever) heard and no human heart has ever perceived those bounties leaving apart (those bounties) about which Allah has informed you.",
    "arabic_text": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ،\n عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ قَالَ اللَّهُ عَزَّ وَجَلَّ أَعْدَدْتُ\n لِعِبَادِيَ الصَّالِحِينَ مَا لاَ عَيْنٌ رَأَتْ وَلاَ أُذُنٌ سَمِعَتْ وَلاَ خَطَرَ عَلَى قَلْبِ بَشَرٍ ذُخْرًا بَلْهَ مَا\n أَطْلَعَكُمُ اللَّهُ عَلَيْهِ ‏\"‏ ‏.‏",
    "malay_translation": "Allah SWT berfirman:  Aku telah menyediakan untuk hamba-hambaKu yang soleh sesuatu yang tidak pernah dilihat oleh mata, didengar oleh telinga, dan difikirkan oleh hati manusia, selain daripada apa yang telah Aku maklumkan kepada kamu."
  },
  {
    "id": 14234,
    "hadith_number": 6957,
    "tajuk_hadith": "Ganjaran Bagi Hamba Allah Yang Soleh",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda bahawa Allah SWT berfirman:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا ابْنُ،\n نُمَيْرٍ - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَقُولُ اللَّهُ عَزَّ وَجَلَّ أَعْدَدْتُ لِعِبَادِيَ الصَّالِحِينَ مَا لاَ\n عَيْنٌ رَأَتْ وَلاَ أُذُنٌ سَمِعَتْ وَلاَ خَطَرَ عَلَى قَلْبِ بَشَرٍ ‏.‏ ذُخْرًا بَلْهَ مَا أَطْلَعَكُمُ اللَّهُ عَلَيْهِ ‏\"‏ ‏.‏\n ثُمَّ قَرَأَ ‏{‏ فَلاَ تَعْلَمُ نَفْسٌ مَا أُخْفِيَ لَهُمْ مِنْ قُرَّةِ أَعْيُنٍ‏}‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda bahawa Allah SWT berfirman:  \"Aku telah menyediakan untuk hamba-hambaKu yang soleh sesuatu yang mata tidak pernah melihat, telinga tidak pernah mendengar, dan tidak pernah terlintas di hati manusia.  Kecuali apa yang telah Allah maklumkan kepada kamu.\" Kemudian baginda membaca:  \"Maka tiada seorang pun mengetahui apa yang disembunyikan untuk mereka (dari)  kegembiraan mata.\" (Surah 32:17)"
  },
  {
    "id": 14235,
    "hadith_number": 6958,
    "tajuk_hadith": "Kurniaan Syurga yang Tak Terbayang",
    "perawi_melayu": "Sahl bin Sa'd As-Sa'idi meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، وَهَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنِي \n أَبُو صَخْرٍ، أَنَّ أَبَا حَازِمٍ، حَدَّثَهُ قَالَ سَمِعْتُ سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ، يَقُولُ شَهِدْتُ مِنْ رَسُولِ\n اللَّهِ صلى الله عليه وسلم مَجْلِسًا وَصَفَ فِيهِ الْجَنَّةَ حَتَّى انْتَهَى ثُمَّ قَالَ صلى الله عليه وسلم\n فِي آخِرِ حَدِيثِهِ ‏\"‏ فِيهَا مَا لاَ عَيْنٌ رَأَتْ وَلاَ أُذُنٌ سَمِعَتْ وَلاَ خَطَرَ عَلَى قَلْبِ بَشَرٍ ‏\"‏ ‏.‏ ثُمَّ\n اقْتَرَأَ هَذِهِ الآيَةَ ‏{‏ تَتَجَافَى جُنُوبُهُمْ عَنِ الْمَضَاجِعِ يَدْعُونَ رَبَّهُمْ خَوْفًا وَطَمَعًا وَمِمَّا رَزَقْنَاهُمْ\n يُنْفِقُونَ * فَلاَ تَعْلَمُ نَفْسٌ مَا أُخْفِيَ لَهُمْ مِنْ قُرَّةِ أَعْيُنٍ جَزَاءً بِمَا كَانُوا يَعْمَلُونَ‏}‏ ‏.‏",
    "malay_translation": "Kami telah diberitakan oleh Harun bin Ma'ruf dan Harun bin Sa'id Al-Ayliy, mereka berkata: “Kami telah diberitakan oleh Ibnu Wahb, beliau telah menceritakan kepadaku dari Abu Sakhr bahawa Abu Hazim telah menceritakan kepadanya, katanya: Aku mendengar Sahl bin Sa'd As-Sa'idi berkata: Aku menyaksikan majlis Rasulullah SAW, baginda menerangkan tentang syurga sehingga selesai, kemudian baginda SAW bersabda di akhir perbahasan baginda: “Di dalamnya terdapat sesuatu yang mata tidak pernah melihat, telinga tidak pernah mendengar, dan tidak pernah terlintas di hati manusia.” Kemudian baginda membaca ayat ini: {Mereka menjauhkan sisi mereka dari tempat tidur, mereka berdoa kepada Tuhan mereka dengan rasa takut dan harapan, dan mereka membelanjakan dari apa yang telah Kami berikan kepada mereka. Maka tidak ada seorang pun yang mengetahui apa yang telah disembunyikan untuk mereka sebagai penyejuk mata, sebagai balasan bagi apa yang telah mereka kerjakan.}"
  },
  {
    "id": 14236,
    "hadith_number": 6959,
    "tajuk_hadith": "Pokok di Syurga yang Mempunyai Bayangan Luas",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "In Paradise, there is a tree under the shadow of which a rider can travel for a hundred years.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِيهِ،\n عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ إِنَّ فِي الْجَنَّةِ لَشَجَرَةً\n يَسِيرُ الرَّاكِبُ فِي ظِلِّهَا مِائَةَ سَنَةٍ ‏\"‏ ‏.‏",
    "malay_translation": "Sesungguhnya di dalam syurga itu ada sebuah pokok yang mana seorang penunggang kuda boleh berjalan di bawah naungannya selama seratus tahun."
  },
  {
    "id": 14237,
    "hadith_number": 6960,
    "tajuk_hadith": "Ketidakmampuan Menempuh Jarak",
    "perawi_melayu": "Hadis ini diriwayatkan melalui Abu Hurairah melalui sanad lain dengan tambahan kata-kata:",
    "english_text": "\" He will not be able to cover this distance.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا الْمُغِيرَةُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْحِزَامِيَّ - عَنْ \n أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ وَزَادَ ‏\n\"‏ لاَ\n يَقْطَعُهَا ‏\"‏ ‏.‏",
    "malay_translation": "“Dia tidak akan mampu menempuh jarak ini.”"
  },
  {
    "id": 14238,
    "hadith_number": 6961,
    "tajuk_hadith": "Pokok di Syurga: Bayangan yang Luas",
    "perawi_melayu": "Sahl bin Sa'ad meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا الْمَخْزُومِيُّ، حَدَّثَنَا وُهَيْبٌ، عَنْ أَبِي،\n حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ فِي الْجَنَّةِ لَشَجَرَةً\n يَسِيرُ الرَّاكِبُ فِي ظِلِّهَا مِائَةَ عَامٍ لاَ يَقْطَعُهَا ‏\"‏ ‏.‏ \n قَالَ أَبُو حَازِمٍ فَحَدَّثْتُ بِهِ النُّعْمَانَ بْنَ أَبِي عَيَّاشٍ الزُّرَقِيَّ، فَقَالَ حَدَّثَنِي أَبُو\n سَعِيدٍ الْخُدْرِيُّ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ فِي الْجَنَّةِ شَجَرَةً يَسِيرُ الرَّاكِبُ\n الْجَوَادَ الْمُضَمَّرَ السَّرِيعَ مِائَةَ عَامٍ مَا يَقْطَعُهَا ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Ishak bin Ibrahim Al-Hanẓali, telah memberitakan kepada kami Al-Makhzumi, telah menceritakan kepada kami Wuhaib, daripada Abi Hazim daripada Sahl bin Sa’d daripada Rasulullah SAW, baginda bersabda:  \"Sesungguhnya di dalam syurga itu ada sebatang pohon, penunggang kuda boleh berjalan di bawah naungannya selama seratus tahun tanpa dapat sampai ke hujungnya.\"  Abu Hazim berkata:  Maka aku telah menceritakannya kepada Nu’man bin Abi ‘Ayyasy Az-Zuraqi, lalu dia berkata: Telah menceritakan kepadaku Abu Said Al-Khudri daripada Nabi SAW, baginda bersabda:  \"Sesungguhnya di dalam syurga itu ada sebatang pohon, penunggang kuda yang gagah dan pantas sekalipun, boleh berjalan di bawah naungannya selama seratus tahun tanpa dapat sampai ke hujungnya.\"  Di syurga terdapat keredaan Allah SWT kepada penduduk syurga dan Allah SWT tidak akan murka kepada mereka."
  },
  {
    "id": 14239,
    "hadith_number": 6962,
    "tajuk_hadith": "Keredaan Allah Ke Atas Ahli Syurga",
    "perawi_melayu": "Abu Said al-Khudri meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ سَهْمٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَخْبَرَنَا مَالِكُ،\n بْنُ أَنَسٍ ح وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، حَدَّثَنِي \n مَالِكُ بْنُ أَنَسٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ النَّبِيَّ\n صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ اللَّهَ يَقُولُ لأَهْلِ الْجَنَّةِ يَا أَهْلَ الْجَنَّةِ ‏.‏ فَيَقُولُونَ لَبَّيْكَ رَبَّنَا\n وَسَعْدَيْكَ وَالْخَيْرُ فِي يَدَيْكَ ‏.‏ فَيَقُولُ هَلْ رَضِيتُمْ فَيَقُولُونَ وَمَا لَنَا لاَ نَرْضَى يَا رَبِّ وَقَدْ\n أَعْطَيْتَنَا مَا لَمْ تُعْطِ أَحَدًا مِنْ خَلْقِكَ فَيَقُولُ أَلاَ أُعْطِيكُمْ أَفْضَلَ مِنْ ذَلِكَ فَيَقُولُونَ يَا رَبِّ وَأَىُّ\n شَىْءٍ أَفْضَلُ مِنْ ذَلِكَ فَيَقُولُ أُحِلُّ عَلَيْكُمْ رِضْوَانِي فَلاَ أَسْخَطُ عَلَيْكُمْ بَعْدَهُ أَبَدًا ‏\"‏ ‏.‏",
    "malay_translation": "Sesungguhnya Allah SWT akan berfirman kepada ahli syurga, \"Wahai ahli syurga!\" Mereka akan menjawab, \"Labbaik, ya Rabb kami, dan segala puji bagi-Mu, kebaikan adalah di tangan-Mu.\" Allah SWT akan bertanya, \"Adakah kamu semua redha?\" Mereka akan menjawab, \"Mengapa kami tidak redha, ya Rabb kami, sedangkan Engkau telah memberi kami apa yang tidak Engkau berikan kepada makhluk-makhluk Engkau yang lain?\" Allah SWT akan berfirman, \"Bagaimana jika Aku memberikan sesuatu yang lebih baik daripada itu?\" Mereka akan bertanya, \"Ya Rabb kami, apakah yang lebih baik daripada ini?\" Allah SWT akan berfirman, \"Aku limpahkan keredaan-Ku ke atas kamu, dan Aku tidak akan murka kepada kamu lagi selama-lamanya.\""
  },
  {
    "id": 14240,
    "hadith_number": 6963,
    "tajuk_hadith": "Penduduk Syurga Melihat Bilik-Bilik Syurga Seperti Melihat Bintang",
    "perawi_melayu": "Sahl bin Sa'd meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The inmates of Paradise will look to the upper apartment of Paradise as you see the planets in the sky. I narrated this hadith to Nu'man b. Abi 'Ayyash and he said: I heard Abu Sa'id al-Khudri as saying: As you see the shining planets in the eastern and western (sides of) horizon.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ - عَنْ \n أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ أَهْلَ الْجَنَّةِ\n لَيَتَرَاءَوْنَ الْغُرْفَةَ فِي الْجَنَّةِ كَمَا تَرَاءَوْنَ الْكَوْكَبَ فِي السَّمَاءِ ‏\"‏ ‏.‏ \n قَالَ فَحَدَّثْتُ بِذَلِكَ النُّعْمَانَ بْنَ أَبِي عَيَّاشٍ، فَقَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ\n كَمَا تَرَاءَوْنَ الْكَوْكَبَ الدُّرِّيَّ فِي الأُفُقِ الشَّرْقِيِّ أَوِ الْغَرْبِيِّ ‏\"‏ ‏.‏",
    "malay_translation": "Penduduk syurga akan melihat bilik-bilik di syurga sepertimana kamu melihat bintang-bintang di langit.  Aku meriwayatkan hadis ini kepada Nu'man bin Abi Ayyasy, dan dia berkata: Aku mendengar Abu Said al-Khudri berkata: Sepertimana kamu melihat bintang-bintang yang bercahaya di ufuk timur atau barat."
  },
  {
    "id": 14241,
    "hadith_number": 6964,
    "tajuk_hadith": "Sanad Riwayat Hadis daripada Abu Hazim",
    "perawi_melayu": "Ishaq bin Ibrahim melalui al-Makhzumi dan Wahb daripada Abu Hazim",
    "english_text": "This hadith has been narrated on the authority of Abu Hazim through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الْمَخْزُومِيُّ، حَدَّثَنَا وُهَيْبٌ، عَنْ أَبِي حَازِمٍ،\n بِالإِسْنَادَيْنِ جَمِيعًا نَحْوَ حَدِيثِ يَعْقُوبَ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Abu Hazim melalui dua sanad (rantai periwayat) yang hampir sama dengan riwayat Ya'qub."
  },
  {
    "id": 14242,
    "hadith_number": 6965,
    "tajuk_hadith": "Penduduk Syurga Melihat Penduduk Ghuruf",
    "perawi_melayu": "Abu Said al-Khudri meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ جَعْفَرِ بْنِ يَحْيَى بْنِ خَالِدٍ، حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكٌ، ح وَحَدَّثَنِي \n هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ،\n عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله\n عليه وسلم قَالَ ‏\"‏ إِنَّ أَهْلَ الْجَنَّةِ لَيَتَرَاءَوْنَ أَهْلَ الْغُرَفِ مِنْ فَوْقِهِمْ كَمَا تَتَرَاءَوْنَ الْكَوْكَبَ\n الدُّرِّيَّ الْغَابِرَ مِنَ الأُفُقِ مِنَ الْمَشْرِقِ أَوِ الْمَغْرِبِ لِتَفَاضُلِ مَا بَيْنَهُمْ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ\n تِلْكَ مَنَازِلُ الأَنْبِيَاءِ لاَ يَبْلُغُهَا غَيْرُهُمْ ‏.‏ قَالَ ‏\"‏ بَلَى وَالَّذِي نَفْسِي بِيَدِهِ رِجَالٌ آمَنُوا بِاللَّهِ\n وَصَدَّقُوا الْمُرْسَلِينَ ‏\"‏ ‏.‏",
    "malay_translation": "Sesungguhnya penduduk syurga akan dapat melihat penduduk ghuruf (bilik-bilik mewah di syurga) yang berada di atas mereka, sebagaimana kamu melihat bintang-bintang yang terang benderang di ufuk timur atau barat, disebabkan kelebihan yang ada di antara mereka.  Mereka bertanya: “Wahai Rasulullah, adakah tempat-tempat itu hanya untuk para nabi sahaja dan tidak akan dicapai oleh orang lain?” Baginda menjawab: “Tidak! Demi Allah yang jiwa ku berada di tangan-Nya, sesungguhnya ada lelaki-lelaki yang beriman kepada Allah dan membenarkan para rasul akan mencapai tempat-tempat itu.”"
  },
  {
    "id": 14243,
    "hadith_number": 6966,
    "tajuk_hadith": "Kecintaan Umat Terhadap Rasulullah",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The people most loved by me from amongst my Ummah would be those who would come after me but everyone amongst them would have the keenest desire to catch a glimpse of me even at the cost of his family and wealth.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ - عَنْ سُهَيْلٍ،\n عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مِنْ أَشَدِّ أُمَّتِي لِي\n حُبًّا نَاسٌ يَكُونُونَ بَعْدِي يَوَدُّ أَحَدُهُمْ لَوْ رَآنِي بِأَهْلِهِ وَمَالِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Orang-orang yang paling aku cintai daripada kalangan umatku ialah mereka yang datang selepasku, dan setiap seorang daripada mereka amat menginginkan untuk melihatku, walaupun terpaksa mengorbankan keluarga dan hartanya."
  },
  {
    "id": 14244,
    "hadith_number": 6967,
    "tajuk_hadith": "Pasar Syurga dan Kecantikan Ahli Syurga",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو عُثْمَانَ، سَعِيدُ بْنُ عَبْدِ الْجَبَّارِ الْبَصْرِيُّ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ،\n الْبُنَانِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ فِي الْجَنَّةِ لَسُوقًا\n يَأْتُونَهَا كُلَّ جُمُعَةٍ فَتَهُبُّ رِيحُ الشَّمَالِ فَتَحْثُو فِي وُجُوهِهِمْ وَثِيَابِهِمْ فَيَزْدَادُونَ حُسْنًا وَجَمَالاً\n فَيَرْجِعُونَ إِلَى أَهْلِيهِمْ وَقَدِ ازْدَادُوا حُسْنًا وَجَمَالاً فَيَقُولُ لَهُمْ أَهْلُوهُمْ وَاللَّهِ لَقَدِ ازْدَدْتُمْ\n بَعْدَنَا حُسْنًا وَجَمَالاً ‏.‏ فَيَقُولُونَ وَأَنْتُمْ وَاللَّهِ لَقَدِ ازْدَدْتُمْ بَعْدَنَا حُسْنًا وَجَمَالاً ‏\"‏ ‏.‏",
    "malay_translation": "Abu Usman, Said bin Abd al-Jabbar al-Basri telah meriwayatkan daripada Hammad bin Salamah, daripada Tsabit al-Bunani, daripada Anas bin Malik bahawa Rasulullah SAW bersabda:  \"Sesungguhnya di dalam syurga ada satu pasar yang mereka akan datang setiap hari Jumaat. Maka tiupan angin utara akan menerpa wajah dan pakaian mereka, lalu mereka akan bertambah cantik dan jelita. Kemudian mereka akan kembali kepada keluarga mereka, dan mereka telah bertambah cantik dan jelita. Maka keluarga mereka akan berkata kepada mereka: Demi Allah, sesungguhnya kamu telah bertambah cantik dan jelita selepas meninggalkan kami. Maka mereka akan berkata: Dan kamu juga, demi Allah, telah bertambah cantik dan jelita selepas kami.\""
  },
  {
    "id": 14245,
    "hadith_number": 6968,
    "tajuk_hadith": "Keindahan dan Kehidupan di Syurga",
    "perawi_melayu": "Muhammad meriwayatkan bahawa sesetengah orang menyatakan dengan rasa bangga dan sesetengahnya membincangkan sama ada akan lebih ramai lelaki di Syurga atau lebih ramai wanita.  Atas dasar itulah Abu Hurairah meriwayatkan bahawa Abu al-Qasim (Nabi SAW) bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، جَمِيعًا عَنِ ابْنِ عُلَيَّةَ، - وَاللَّفْظُ\n لِيَعْقُوبَ - قَالاَ حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، أَخْبَرَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، قَالَ إِمَّا تَفَاخَرُوا وَإِمَّا\n تَذَاكَرُوا الرِّجَالُ فِي الْجَنَّةِ أَكْثَرُ أَمِ النِّسَاءُ فَقَالَ أَبُو هُرَيْرَةَ أَوَلَمْ يَقُلْ أَبُو الْقَاسِمِ صلى\n الله عليه وسلم ‏\n\"‏ إِنَّ أَوَّلَ زُمْرَةٍ تَدْخُلُ الْجَنَّةَ عَلَى صُورَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ وَالَّتِي تَلِيهَا عَلَى\n أَضْوَإِ كَوْكَبٍ دُرِّيٍّ فِي السَّمَاءِ لِكُلِّ امْرِئٍ مِنْهُمْ زَوْجَتَانِ اثْنَتَانِ يُرَى مُخُّ سُوقِهِمَا مِنْ وَرَاءِ\n اللَّحْمِ وَمَا فِي الْجَنَّةِ أَعْزَبُ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Amru al-Naqid dan Ya'qub bin Ibrahim ad-Dauri, keduanya daripada Ibn 'Ulayyah – dan lafaznya daripada Ya'qub – mereka berdua berkata:  Kami telah mendengar daripada Ismail bin 'Ulayyah, yang memberitakan kepada kami daripadaAyyub, daripada Muhammad yang berkata: “Sekiranya mereka bermegah-megah atau berbincang, adakah lelaki lebih ramai di syurga atau wanita?” Maka Abu Hurairah berkata: “Bukankah Abu al-Qasim (Nabi SAW) telah bersabda:  “Sesungguhnya golongan pertama yang masuk syurga, wajah mereka seperti cahaya bulan pada malam purnama. Dan golongan yang seterusnya, wajah mereka seperti cahaya bintang-bintang yang bercahaya di langit. Setiap seorang daripada mereka mempunyai dua isteri, sumsum tulang kaki mereka kelihatan dari balik daging, dan tidak ada yang bujang di syurga.”"
  },
  {
    "id": 14246,
    "hadith_number": 6969,
    "tajuk_hadith": "Lelaki dan Wanita di Syurga",
    "perawi_melayu": "Ibn Abi Umar melalui Sufian, daripada Ayyub, daripada Ibn Sirin",
    "english_text": "This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters.",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنِ ابْنِ سِيرِينَ، قَالَ اخْتَصَمَ الرِّجَالُ\n وَالنِّسَاءُ أَيُّهُمْ فِي الْجَنَّةِ أَكْثَرُ فَسَأَلُوا أَبَا هُرَيْرَةَ فَقَالَ قَالَ أَبُو الْقَاسِمِ صلى الله عليه\n وسلم بِمِثْلِ حَدِيثِ ابْنِ عُلَيَّةَ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ibn Abi Umar, telah menceritakan kepada kami Sufian, daripada Ayyub, daripada Ibn Sirin, katanya:  Lelaki dan perempuan berselisih faham, siapakah yang lebih ramai di syurga. Maka mereka bertanya kepada Abu Hurairah, lalu beliau berkata:  Abu al-Qasim ﷺ telah bersabda dengan serupa dengan hadis Ibn 'Ulayyah."
  },
  {
    "id": 14247,
    "hadith_number": 6970,
    "tajuk_hadith": "Kumpulan Pertama Masuk Syurga",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Abu Hurairah melalui beberapa sanad lain bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، - يَعْنِي ابْنَ زِيَادٍ - عَنْ عُمَارَةَ بْنِ،\n الْقَعْقَاعِ حَدَّثَنَا أَبُو زُرْعَةَ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم ‏\"‏ أَوَّلُ مَنْ يَدْخُلُ الْجَنَّةَ ‏\"‏ ‏.‏ ح \n وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَزُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لِقُتَيْبَةَ - قَالاَ حَدَّثَنَا جَرِيرٌ،\n عَنْ عُمَارَةَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n ‏\"‏ إِنَّ أَوَّلَ زُمْرَةٍ يَدْخُلُونَ الْجَنَّةَ عَلَى صُورَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ وَالَّذِينَ يَلُونَهُمْ عَلَى أَشَدِّ كَوْكَبٍ\n دُرِّيٍّ فِي السَّمَاءِ إِضَاءَةً لاَ يَبُولُونَ وَلاَ يَتَغَوَّطُونَ وَلاَ يَمْتَخِطُونَ وَلاَ يَتْفُلُونَ أَمْشَاطُهُمُ الذَّهَبُ\n وَرَشْحُهُمُ الْمِسْكُ وَمَجَامِرُهُمُ الأَلُوَّةُ وَأَزْوَاجُهُمُ الْحُورُ الْعِينُ أَخْلاَقُهُمْ عَلَى خُلُقِ رَجُلٍ وَاحِدٍ\n عَلَى صُورَةِ أَبِيهِمْ آدَمَ سِتُّونَ ذِرَاعًا فِي السَّمَاءِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Kumpulan pertama yang memasuki syurga, wajah mereka akan secerah cahaya bintang di langit. Mereka tidak akan membuang air kecil atau air besar, tidak akan mengalami selsema, dan tidak akan meludah. Sisir mereka daripada emas, peluh mereka kasturi, bahan bakar tempat membakar wangi-wangian mereka adalah kayu aloes, isteri mereka adalah bidadari yang jelita, dan rupa paras mereka serupa seperti seorang lelaki, mengikut rupa bapa mereka, Adam, setinggi enam puluh hasta.\""
  },
  {
    "id": 14248,
    "hadith_number": 6971,
    "tajuk_hadith": "Kumpulan Pertama Ummah yang Masuk Syurga",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ،\n عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَوَّلُ زُمْرَةٍ\n تَدْخُلُ الْجَنَّةَ مِنْ أُمَّتِي عَلَى صُورَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ ثُمَّ الَّذِينَ يَلُونَهُمْ عَلَى أَشَدِّ نَجْمٍ فِي السَّمَاءِ\n إِضَاءَةً ثُمَّ هُمْ بَعْدَ ذَلِكَ مَنَازِلُ لاَ يَتَغَوَّطُونَ وَلاَ يَبُولُونَ وَلاَ يَمْتَخِطُونَ وَلاَ يَبْزُقُونَ أَمْشَاطُهُمُ\n الذَّهَبُ وَمَجَامِرُهُمُ الأَلُوَّةُ وَرَشْحُهُمُ الْمِسْكُ أَخْلاَقُهُمْ عَلَى خُلُقِ رَجُلٍ وَاحِدٍ عَلَى طُولِ أَبِيهِمْ\n آدَمَ سِتُّونَ ذِرَاعًا ‏\"‏ ‏.‏ قَالَ ابْنُ أَبِي شَيْبَةَ عَلَى خُلُقِ رَجُلٍ ‏.‏ وَقَالَ أَبُو كُرَيْبٍ عَلَى خَلْقِ\n رَجُلٍ ‏.‏ وَقَالَ ابْنُ أَبِي شَيْبَةَ عَلَى صُورَةِ أَبِيهِمْ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda: \"Kumpulan pertama umatku yang memasuki syurga akan seperti rupa bulan purnama pada malam bulan penuh. Kemudian mereka yang berikutnya, akan seperti bintang yang paling terang gemerlapan di langit. Kemudian selepas mereka (yang lain) mengikut  peringkat-peringkat (yang lebih rendah). Mereka tidak akan membuang najis, ataupun kencing, ataupun mengeluarkan kahak, ataupun meludah. Sisir mereka daripada emas, bara api mereka daripada kayu aloes, peluh mereka berupa minyak kasturi, dan akhlak mereka seperti akhlak seorang lelaki yang panjangnya seperti bapa mereka, Adam, iaitu enam puluh hasta.\""
  },
  {
    "id": 14249,
    "hadith_number": 6972,
    "tajuk_hadith": "Kumpulan Pertama Masuk Syurga",
    "perawi_melayu": "Hammam bin Munabbih meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ\n هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَوَّلُ زُمْرَةٍ تَلِجُ الْجَنَّةَ صُوَرُهُمْ عَلَى صُورَةِ الْقَمَرِ لَيْلَةَ\n الْبَدْرِ لاَ يَبْصُقُونَ فِيهَا وَلاَ يَمْتَخِطُونَ وَلاَ يَتَغَوَّطُونَ فِيهَا آنِيَتُهُمْ وَأَمْشَاطُهُمْ مِنَ الذَّهَبِ وَالْفِضَّةِ\n وَمَجَامِرُهُمْ مِنَ الأَلُوَّةِ وَرَشْحُهُمُ الْمِسْكُ وَلِكُلِّ وَاحِدٍ مِنْهُمْ زَوْجَتَانِ يُرَى مُخُّ سَاقِهِمَا مِنْ\n وَرَاءِ اللَّحْمِ مِنَ الْحُسْنِ لاَ اخْتِلاَفَ بَيْنَهُمْ وَلاَ تَبَاغُضَ قُلُوبُهُمْ قَلْبٌ وَاحِدٌ يُسَبِّحُونَ اللَّهَ بُكْرَةً\n وَعَشِيًّا ‏\"‏ ‏.‏",
    "malay_translation": "Muhammad bin Rafi meriwayatkan daripada Abdur Razzaq, yang meriwayatkan daripada Ma'mar, daripada Hammam bin Munabbih, katanya: Ini adalah antara hadis yang diriwayatkan oleh Abu Hurairah daripada Rasulullah SAW. Baginda SAW bersabda: \"Kumpulan pertama yang memasuki syurga, wajah mereka seperti bulan purnama pada malam pertengahan bulan. Mereka tidak akan meludah, tidak akan mengalami hingus, dan tidak akan membuang najis di dalamnya. Peralatan dan sikat mereka daripada emas dan perak, bara api mereka daripada kayu aloewood, peluh mereka adalah kasturi, dan setiap seorang daripada mereka mempunyai dua isteri yang cantik jelita sehingga sum-sum tulang kaki mereka kelihatan melalui daging kerana kecantikannya. Tiada perselisihan di antara mereka, dan tiada kebencian di dalam hati mereka. Hati mereka seperti satu hati, mereka bertasbih kepada Allah pada waktu pagi dan petang.\""
  },
  {
    "id": 14250,
    "hadith_number": 6973,
    "tajuk_hadith": "Kehidupan di Syurga: Makan, Minum, dan Kesucian",
    "perawi_melayu": "Jabir meriwayatkan:",
    "english_text": "I heard Allah's Apostle (ﷺ) as saying that the inmates of Paradise would eat and drink but would neither spit, nor pass water, nor void excrement, nor suffer catarrah. It was said: Then, what would happen with food? Thereupon he said: They would belch and sweat (and it would be over with their food), and their sweat would be that of musk and they would glorify and praise Allah as easily as you breathe.",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لِعُثْمَانَ - قَالَ عُثْمَانُ\n حَدَّثَنَا وَقَالَ، إِسْحَاقُ أَخْبَرَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ سَمِعْتُ \n النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِنَّ أَهْلَ الْجَنَّةِ يَأْكُلُونَ فِيهَا وَيَشْرَبُونَ وَلاَ يَتْفُلُونَ وَلاَ\n يَبُولُونَ وَلاَ يَتَغَوَّطُونَ وَلاَ يَمْتَخِطُونَ ‏\"‏ ‏.‏ قَالُوا فَمَا بَالُ الطَّعَامِ قَالَ ‏\"‏ جُشَاءٌ وَرَشْحٌ كَرَشْحِ\n الْمِسْكِ يُلْهَمُونَ التَّسْبِيحَ وَالتَّحْمِيدَ كَمَا يُلْهَمُونَ النَّفَسَ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda bahawa penduduk syurga akan makan dan minum, tetapi mereka tidak akan meludah, membuang air kecil, membuang air besar, atau mengalami selsema.  Lalu, ada yang bertanya:  “Bagaimana pula dengan makanan?” Baginda menjawab: “Makanan akan dikeluarkan melalui sendawa dan peluh, seperti peluh kasturi. Mereka akan diilhamkan untuk bertahmid dan bertasbih semudah mereka bernafas.”"
  },
  {
    "id": 14251,
    "hadith_number": 6974,
    "tajuk_hadith": "Riwayat Hadis daripada Al-A'mash dengan sedikit perbezaan lafaz",
    "perawi_melayu": "Abu Bakr bin Abi Syaibah dan Abu Kuraib; daripada Abu Muawiyah; daripada Al-A'mash",
    "english_text": "This hadith has been transmitted on the authority of A'mash with a slight variation of wording.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ،\n بِهَذَا الإِسْنَادِ إِلَى قَوْلِهِ ‏\n\"‏ كَرَشْحِ الْمِسْكِ ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini telah diriwayatkan daripada Al-A'mash dengan sedikit perbezaan lafaz."
  },
  {
    "id": 14252,
    "hadith_number": 6975,
    "tajuk_hadith": "Kehidupan di Syurga",
    "perawi_melayu": "Jabir bin Abdullah",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَحَجَّاجُ بْنُ الشَّاعِرِ، كِلاَهُمَا عَنْ أَبِي عَاصِمٍ،\n - قَالَ حَسَنٌ حَدَّثَنَا أَبُو عَاصِمٍ، - عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ،\n عَبْدِ اللَّهِ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَأْكُلُ أَهْلُ الْجَنَّةِ فِيهَا وَيَشْرَبُونَ\n وَلاَ يَتَغَوَّطُونَ وَلاَ يَمْتَخِطُونَ وَلاَ يَبُولُونَ وَلَكِنْ طَعَامُهُمْ ذَاكَ جُشَاءٌ كَرَشْحِ الْمِسْكِ يُلْهَمُونَ\n التَّسْبِيحَ وَالْحَمْدَ كَمَا يُلْهَمُونَ النَّفَسَ ‏\"‏ ‏.‏ قَالَ وَفِي حَدِيثِ حَجَّاجٍ ‏\"‏ طَعَامُهُمْ ذَلِكَ ‏\"‏ ‏.‏",
    "malay_translation": "Jabir bin Abdullah meriwayatkan bahawa Rasulullah SAW bersabda:  \"Ahli syurga akan makan dan minum di dalamnya, tetapi mereka tidak akan membuang air besar, tidak akan mengalami selsema, dan tidak akan membuang air kecil.  Makanan mereka akan dicerna melalui sendawa yang harum seperti bau minyak kasturi.  Mereka akan diilhamkan untuk bertahmid dan berzikir dengan mudah seperti mereka diilhamkan untuk bernafas.\""
  },
  {
    "id": 14253,
    "hadith_number": 6976,
    "tajuk_hadith": "Ilham Tasbih dan Takbir",
    "perawi_melayu": "Jabir",
    "english_text": "This hadith has been transmitted on the authority of Jabir with a slight variation of wording.",
    "arabic_text": "وَحَدَّثَنِي سَعِيدُ بْنُ يَحْيَى الأُمَوِيُّ، حَدَّثَنِي أَبِي، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ،\n عَنْ جَابِرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ ‏\n\"‏ وَيُلْهَمُونَ التَّسْبِيحَ وَالتَّكْبِيرَ\n كَمَا يُلْهَمُونَ النَّفَسَ ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Jabir dengan sedikit perbezaan lafaz.  Riwayat ini menyebut: “Mereka diilhamkan untuk bertahmid dan bertakbir sebagaimana mereka diilhamkan untuk bernafas.”"
  },
  {
    "id": 14254,
    "hadith_number": 6977,
    "tajuk_hadith": "Kenikmatan Syurga yang Kekal",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "He who would get into Paradise (would be made to enjoy such an everlasting) bliss that he would neither become destitute, nor would his clothes wear out, nor his youth would decline.",
    "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ \n ثَابِتٍ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ يَدْخُلُ\n الْجَنَّةَ يَنْعَمُ لاَ يَبْأَسُ لاَ تَبْلَى ثِيَابُهُ وَلاَ يَفْنَى شَبَابُهُ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa yang masuk syurga, dia akan mendapat nikmat yang kekal. Dia tidak akan susah, pakaiannya tidak akan lusuh, dan remajanya tidak akan pudar."
  },
  {
    "id": 14255,
    "hadith_number": 6978,
    "tajuk_hadith": "Kesihatan, Kehidupan Abadi, dan Kenikmatan di Syurga",
    "perawi_melayu": "Abu Said al-Khudri dan Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، - وَاللَّفْظُ لإِسْحَاقَ - قَالاَ أَخْبَرَنَا \n عَبْدُ الرَّزَّاقِ، قَالَ قَالَ الثَّوْرِيُّ فَحَدَّثَنِي أَبُو إِسْحَاقَ، أَنَّ الأَغَرَّ، حَدَّثَهُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،\n وَأَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ يُنَادِي مُنَادٍ إِنَّ لَكُمْ أَنْ تَصِحُّوا فَلاَ\n تَسْقَمُوا أَبَدًا وَإِنَّ لَكُمْ أَنْ تَحْيَوْا فَلاَ تَمُوتُوا أَبَدًا وَإِنَّ لَكُمْ أَنْ تَشِبُّوا فَلاَ تَهْرَمُوا أَبَدًا وَإِنَّ\n لَكُمْ أَنْ تَنْعَمُوا فَلاَ تَبْتَئِسُوا أَبَدًا ‏\"‏ ‏.‏ فَذَلِكَ قَوْلُهُ عَزَّ وَجَلَّ ‏{‏ وَنُودُوا أَنْ تِلْكُمُ الْجَنَّةُ أُورِثْتُمُوهَا\n بِمَا كُنْتُمْ تَعْمَلُونَ‏}‏",
    "malay_translation": "Daripada Ishaq bin Ibrahim dan Abd bin Humaid – dan lafaz daripada Ishaq – mereka berdua berkata:  Kami diberitakan oleh Abdurrazzaq, katanya:  Al-Thawri memberitakan kepadaku, bahawa Al-Aghar memberitakan kepadanya daripada Abu Said al-Khudri dan Abu Hurairah daripada Nabi SAW, baginda bersabda:  \"Seorang penyeru akan menyeru: Sesungguhnya kamu akan sentiasa sihat dan tidak akan sakit selama-lamanya, dan sesungguhnya kamu akan sentiasa hidup dan tidak akan mati selama-lamanya, dan sesungguhnya kamu akan sentiasa muda dan tidak akan tua selama-lamanya, dan sesungguhnya kamu akan sentiasa berada dalam kenikmatan dan tidak akan susah selama-lamanya.\" Itulah firman Allah SWT: {Dan mereka akan diseru: “Inilah syurga; kamu diwarisi syurga ini disebabkan amal kamu.”}"
  },
  {
    "id": 14256,
    "hadith_number": 6979,
    "tajuk_hadith": "Khemah Mutiara di Syurga",
    "perawi_melayu": "Abu Bakr bin Abdullah bin Qais meriwayatkan daripada bapanya",
    "english_text": "Abu Bakr b. Abdullah b. Qais reported on the authority of his father that Allah's Messenger (ﷺ) said that in Paradise there would be for a believer a tent of a single hollowed pearl the breadth of which would be sixty miles. It would be meant for a believer and the believers would go around it and none would be able to see the others.",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، عَنْ أَبِي قُدَامَةَ، - وَهُوَ الْحَارِثُ بْنُ عُبَيْدٍ - عَنْ أَبِي،\n عِمْرَانَ الْجَوْنِيِّ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ اللَّهِ بْنِ قَيْسٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم\n قَالَ ‏\n\"‏ إِنَّ لِلْمُؤْمِنِ فِي الْجَنَّةِ لَخَيْمَةً مِنْ لُؤْلُؤَةٍ وَاحِدَةٍ مُجَوَّفَةٍ طُولُهَا سِتُّونَ مِيلاً لِلْمُؤْمِنِ فِيهَا\n أَهْلُونَ يَطُوفُ عَلَيْهِمُ الْمُؤْمِنُ فَلاَ يَرَى بَعْضُهُمْ بَعْضًا ‏\"‏ ‏.‏",
    "malay_translation": "Abu Bakar bin Abdullah bin Qais meriwayatkan daripada bapanya bahawa Rasulullah SAW bersabda:  \"Sesungguhnya bagi orang beriman di syurga ada khemah daripada mutiara tunggal yang berongga, panjangnya enam puluh batu.  Khemah itu untuk seorang mukmin dan orang-orang beriman akan mengelilinginya, dan sebahagian mereka tidak akan dapat melihat sebahagian yang lain.\""
  },
  {
    "id": 14257,
    "hadith_number": 6980,
    "tajuk_hadith": "Khemah Mutiara di Syurga",
    "perawi_melayu": "Abu Bakr bin Abdullah bin Qais melalui bapanya",
    "english_text": "Abu Bakr b. Abdullah b. Qais reported on the authority of his father that Allah's Messenger (ﷺ) said that in Paradise there would be a tent made of a single hollowed pearl, the breadth of which would be sixty miles from all sides and there would live a family in each corner and the other would not be able to see the believer who goes around them.",
    "arabic_text": "وَحَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، حَدَّثَنَا أَبُو عَبْدِ الصَّمَدِ، حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ،\n عَنْ أَبِي بَكْرِ بْنِ عَبْدِ اللَّهِ بْنِ قَيْسٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏\n فِي الْجَنَّةِ خَيْمَةٌ مِنْ لُؤْلُؤَةٍ مُجَوَّفَةٍ عَرْضُهَا سِتُّونَ مِيلاً فِي كُلِّ زَاوِيَةٍ مِنْهَا أَهْلٌ مَا يَرَوْنَ\n الآخَرِينَ يَطُوفُ عَلَيْهِمُ الْمُؤْمِنُ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Bakr bin Abdullah bin Qais meriwayatkan daripada bapanya bahawa Rasulullah SAW bersabda:  \"Di dalam syurga terdapat khemah yang diperbuat daripada mutiara yang berongga, keluasannya enam puluh batu di setiap sudutnya.  Setiap sudutnya didiami oleh satu keluarga, dan mereka tidak dapat melihat antara satu sama lain. Seorang mukmin dapat mengelilingi mereka.\""
  },
  {
    "id": 14258,
    "hadith_number": 6981,
    "tajuk_hadith": "Khaimah Mutiara di Syurga",
    "perawi_melayu": "Abu Bakr bin Abu Musa bin Qais daripada bapanya, daripada Nabi SAW",
    "english_text": "This hadith has been transmitted on the authority of Abu Bakr b. Abu Musa b. Qais who, on the authority of his father, reported the Apostle (ﷺ) to have said that there would be a tent made of a pearl whose height towards the sky would be sixty miles. In each corner, there would be a family of the believer, out of sight for the others.",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا هَمَّامٌ، عَنْ أَبِي،\n عِمْرَانَ الْجَوْنِيِّ عَنْ أَبِي بَكْرِ بْنِ أَبِي مُوسَى بْنِ قَيْسٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه\n وسلم قَالَ ‏\n\"‏ الْخَيْمَةُ دُرَّةٌ طُولُهَا فِي السَّمَاءِ سِتُّونَ مِيلاً فِي كُلِّ زَاوِيَةٍ مِنْهَا أَهْلٌ لِلْمُؤْمِنِ\n لاَ يَرَاهُمُ الآخَرُونَ ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Abu Bakr bin Abu Musa bin Qais daripada bapanya, yang meriwayatkan daripada Rasulullah SAW yang bersabda:  \"Khemah itu daripada mutiara, tingginya di langit enam puluh batu. Di setiap sudutnya terdapat sebuah keluarga orang beriman, yang tidak dapat dilihat oleh keluarga yang lain.\""
  },
  {
    "id": 14259,
    "hadith_number": 6982,
    "tajuk_hadith": "Sungai-sungai Syurga",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Saihan, Jaihan, Euphrates and Nile are all among the rivers of Paradise.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، وَعَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَعَلِيُّ بْنُ مُسْهِرٍ،\n عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا \n عُبَيْدُ اللَّهِ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\n\"‏ سَيْحَانُ وَجَيْحَانُ وَالْفُرَاتُ وَالنِّيلُ كُلٌّ مِنْ أَنْهَارِ الْجَنَّةِ ‏\"‏ ‏.‏",
    "malay_translation": "Saihan, Jaihan, Furat dan Nil, kesemuanya adalah antara sungai-sungai di syurga."
  },
  {
    "id": 14260,
    "hadith_number": 6983,
    "tajuk_hadith": "Orang-orang yang Masuk Syurga dengan Hati Seperti Burung",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There would enter Paradise people whose hearts would be like those of the hearts of birds.",
    "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا أَبُو النَّضْرِ، هَاشِمُ بْنُ الْقَاسِمِ اللَّيْثِيُّ حَدَّثَنَا إِبْرَاهِيمُ،\n - يَعْنِي ابْنَ سَعْدٍ - حَدَّثَنَا أَبِي، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه\n وسلم قَالَ ‏\n\"‏ يَدْخُلُ الْجَنَّةَ أَقْوَامٌ أَفْئِدَتُهُمْ مِثْلُ أَفْئِدَةِ الطَّيْرِ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda: \"Sesungguhnya akan masuk syurga segolongan manusia yang hati mereka seperti hati burung.\""
  },
  {
    "id": 14261,
    "hadith_number": 6984,
    "tajuk_hadith": "Penciptaan Adam dan Salam",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ\n هَذَا مَا حَدَّثَنَا بِهِ أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَذَكَرَ أَحَادِيثَ مِنْهَا\n وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ خَلَقَ اللَّهُ عَزَّ وَجَلَّ آدَمَ عَلَى صُورَتِهِ طُولُهُ سِتُّونَ\n ذِرَاعًا فَلَمَّا خَلَقَهُ قَالَ اذْهَبْ فَسَلِّمْ عَلَى أُولَئِكَ النَّفَرِ وَهُمْ نَفَرٌ مِنَ الْمَلاَئِكَةِ جُلُوسٌ فَاسْتَمِعْ\n مَا يُجِيبُونَكَ فَإِنَّهَا تَحِيَّتُكَ وَتَحِيَّةُ ذُرِّيَّتِكَ قَالَ فَذَهَبَ فَقَالَ السَّلاَمُ عَلَيْكُمْ فَقَالُوا السَّلاَمُ\n عَلَيْكَ وَرَحْمَةُ اللَّهِ - قَالَ - فَزَادُوهُ وَرَحْمَةُ اللَّهِ - قَالَ - فَكُلُّ مَنْ يَدْخُلُ الْجَنَّةَ عَلَى صُورَةِ\n آدَمَ وَطُولُهُ سِتُّونَ ذِرَاعًا فَلَمْ يَزَلِ الْخَلْقُ يَنْقُصُ بَعْدَهُ حَتَّى الآنَ ‏\"‏ ‏.‏",
    "malay_translation": "Muhammad bin Rafi' meriwayatkan daripada Abdur Razzaq, yang diberitakan oleh Ma'mar daripada Hammam bin Munabbih, katanya: Ini yang diriwayatkan kepada kami oleh Abu Hurairah daripada Rasulullah SAW.  Kemudian beliau menyebutkan beberapa hadis antaranya, dan Rasulullah SAW bersabda:  \"Allah SWT telah menciptakan Adam mengikut rupa-Nya, tinggi badannya enam puluh hasta.  Setelah Allah menciptakannya, Allah berfirman: Pergilah, salamilah mereka, iaitu sekumpulan malaikat yang sedang duduk, dan dengarlah apa yang mereka jawab kepadamu, kerana itulah salammu dan salam zuriatmu.\"  Maka Adam pergi lalu berkata:  \"Salam sejahtera ke atas kamu.\" Mereka menjawab:  \"Salam sejahtera ke atasmu dan rahmat Allah.\"  Kata beliau: Mereka menambah 'dan rahmat Allah'.  Maka sesiapa yang masuk syurga akan mengikut rupa Adam, tinggi badannya enam puluh hasta, dan manusia yang datang selepasnya semakin kecil sehingga hari ini.\""
  },
  {
    "id": 14262,
    "hadith_number": 6985,
    "tajuk_hadith": "Neraka Jahannam pada Hari Kiamat",
    "perawi_melayu": "Abdullah bin Mas'ud meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Hell would be brought on that day (the Day of Judgment) with seventy thousand bridles, and seventy thousand angels dragging each bridle.",
    "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، عَنِ الْعَلاَءِ بْنِ خَالِدٍ الْكَاهِلِيِّ، عَنْ \n شَقِيقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يُؤْتَى بِجَهَنَّمَ يَوْمَئِذٍ لَهَا\n سَبْعُونَ أَلْفَ زِمَامٍ مَعَ كُلِّ زِمَامٍ سَبْعُونَ أَلْفَ مَلَكٍ يَجُرُّونَهَا ‏\"‏ ‏.‏",
    "malay_translation": "Abdullah bin Mas'ud meriwayatkan bahawa Rasulullah SAW bersabda: \"Pada hari itu (hari kiamat), neraka Jahannam akan dibawa dengan tujuh puluh ribu tali kekang, dan pada setiap tali kekang itu ada tujuh puluh ribu malaikat yang menariknya.\""
  },
  {
    "id": 14263,
    "hadith_number": 6986,
    "tajuk_hadith": "Perbandingan Api Dunia dan Api Neraka",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا الْمُغِيرَةُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْحِزَامِيَّ - عَنْ \n أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ نَارُكُمْ هَذِهِ\n الَّتِي يُوقِدُ ابْنُ آدَمَ جُزْءٌ مِنْ سَبْعِينَ جُزْءًا مِنْ حَرِّ جَهَنَّمَ ‏\"‏ ‏.‏ قَالُوا وَاللَّهِ إِنْ كَانَتْ لَكَافِيَةً\n يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ فَإِنَّهَا فُضِّلَتْ عَلَيْهَا بِتِسْعَةٍ وَسِتِّينَ جُزْءًا كُلُّهَا مِثْلُ حَرِّهَا ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qotaibah bin Sa'id, telah menceritakan kepada kami Mughirah - iaitu Ibnu Abdur Rahman Al- Hizami - daripada Abu Az-Zinad, daripada Al-A'raj, daripada Abu Hurairah, bahawa Nabi SAW bersabda: \"Api kamu yang dinyalakan oleh anak Adam ini hanyalah satu bahagian daripada tujuh puluh bahagian daripada kepanasan neraka Jahannam.\" Para sahabat bertanya: \"Demi Allah, jika api ini pun sudah memadai wahai Rasulullah.\" Baginda menjawab: \"Sesungguhnya api neraka itu lebih panas 69 bahagian daripada api dunia ini, dan setiap bahagiannya sama panasnya seperti api dunia ini.\""
  },
  {
    "id": 14264,
    "hadith_number": 6987,
    "tajuk_hadith": "Riwayat Hadis Abi Hurairah dengan Lafadz Berbeza",
    "perawi_melayu": "Muhammad bin Rafi', melalui Abdur Razzaq, Ma'mar, Hammam bin Munabbih, dan Abu Hurairah daripada Nabi SAW.",
    "english_text": "This hadith has been narrated on the authority of Abn Huraira through another chain of transmitters with a slight variation of wording.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ \n أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ أَبِي الزِّنَادِ غَيْرَ أَنَّهُ قَالَ ‏\n\"‏ كُلُّهُنَّ\n مِثْلُ حَرِّهَا ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Abu Hurairah melalui sanad yang lain dengan sedikit perbezaan lafaz.  Riwayat ini melalui Muhammad bin Rafi', yang mendengar daripada Abdur Razzaq, yang mendengar daripada Ma'mar, yang mendengar daripada Hammam bin Munabbih, yang mendengar daripada Abu Hurairah, daripada Nabi SAW,  hampir sama dengan hadis daripada Abu Zinad, kecuali perkataan  \" semuanya sama seperti panasnya\". "
  },
  {
    "id": 14265,
    "hadith_number": 6988,
    "tajuk_hadith": "Bunyi Batu di Neraka",
    "perawi_melayu": "Abu Hurairah meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، حَدَّثَنَا خَلَفُ بْنُ خَلِيفَةَ، حَدَّثَنَا يَزِيدُ بْنُ كَيْسَانَ، عَنْ أَبِي،\n حَازِمٍ عَنْ أَبِي هُرَيْرَةَ، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ سَمِعَ وَجْبَةً فَقَالَ\n النَّبِيُّ صلى الله عليه وسلم ‏\"‏ تَدْرُونَ مَا هَذَا ‏\"‏ ‏.‏ قَالَ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏\"‏\n هَذَا حَجَرٌ رُمِيَ بِهِ فِي النَّارِ مُنْذُ سَبْعِينَ خَرِيفًا فَهُوَ يَهْوِي فِي النَّارِ الآنَ حَتَّى انْتَهَى إِلَى\n قَعْرِهَا ‏\"‏ ‏.‏",
    "malay_translation": "Kami berada bersama Rasulullah SAW ketika kami mendengar satu bunyi yang kuat.  Lalu Rasulullah SAW bertanya, \"Adakah kamu tahu apakah bunyi ini?\" Kami menjawab, \"Allah dan Rasul-Nya lebih mengetahui.\" Baginda SAW bersabda, \"Ini adalah batu yang dilemparkan ke dalam neraka sejak tujuh puluh tahun yang lalu. Ia terus jatuh ke dalam neraka sehingga sampai ke dasarnya.\" "
  },
  {
    "id": 14266,
    "hadith_number": 6989,
    "tajuk_hadith": "Bunyi yang Didengar di Pangkalnya",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Abu Hurairah dengan sanad yang sama, tetapi dengan perubahan lafaz yang menyatakan bahawa Nabi SAW bersabda:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ عَبَّادٍ، وَابْنُ أَبِي عُمَرَ، قَالاَ حَدَّثَنَا مَرْوَانُ، عَنْ يَزِيدَ بْنِ كَيْسَانَ،\n عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، بِهَذَا الإِسْنَادِ وَقَالَ ‏\n\"‏ هَذَا وَقَعَ فِي أَسْفَلِهَا فَسَمِعْتُمْ وَجْبَتَهَا\n ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin ‘Abbad dan Ibnu Abi ‘Umar, mereka berdua berkata: Telah menceritakan kepada kami Marwan daripada Yazid bin Kaisan daripada Abu Hazim daripada Abu Hurairah dengan sanad ini, dan beliau berkata:  \"Ia telah sampai ke pangkalnya, lalu kamu mendengar bunyinya.\""
  },
  {
    "id": 14267,
    "hadith_number": 6990,
    "tajuk_hadith": "Azab Api Neraka",
    "perawi_melayu": "Samurah bin Jundub meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There will be some to whose ankels the fire will reach, some to whose knees, some to whose waist the fire will reach, and some to whose collar-bone the fire will reach.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا شَيْبَانُ بْنُ عَبْدِ الرَّحْمَنِ،\n قَالَ قَالَ قَتَادَةُ سَمِعْتُ أَبَا نَضْرَةَ، يُحَدِّثُ عَنْ سَمُرَةَ، أَنَّهُ سَمِعَ نَبِيَّ اللَّهِ صلى الله عليه وسلم\n يَقُولُ ‏\n\"‏ إِنَّ مِنْهُمْ مَنْ تَأْخُذُهُ النَّارُ إِلَى كَعْبَيْهِ وَمِنْهُمْ مَنْ تَأْخُذُهُ إِلَى حُجْزَتِهِ وَمِنْهُمْ مَنْ تَأْخُذُهُ\n إِلَى عُنُقِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Samurah bin Jundub, bahawa Rasulullah SAW bersabda:  \"Sesungguhnya antara mereka ada yang akan dijilat api neraka sehingga ke buku lali, dan ada yang sehingga ke lutut, dan ada yang sehingga ke pinggang, dan ada yang sehingga ke tulang selangka.\""
  },
  {
    "id": 14268,
    "hadith_number": 6991,
    "tajuk_hadith": "Azab Api Neraka di Akhirat",
    "perawi_melayu": "Samurah bin Jundub meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There would be among them those to whom the fire will reach up to their ankels and to some of them the fire would reach their knees and to some it would reach their waists and to some it would reach up to their collar-bones.",
    "arabic_text": "حَدَّثَنِي عَمْرُو بْنُ زُرَارَةَ، أَخْبَرَنَا عَبْدُ الْوَهَّابِ، - يَعْنِي ابْنَ عَطَاءٍ - عَنْ سَعِيدٍ،\n عَنْ قَتَادَةَ، قَالَ سَمِعْتُ أَبَا نَضْرَةَ، يُحَدِّثُ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ، أَنَّ النَّبِيَّ صلى الله عليه\n وسلم قَالَ ‏\n\"‏ مِنْهُمْ مَنْ تَأْخُذُهُ النَّارُ إِلَى كَعْبَيْهِ وَمِنْهُمْ مَنْ تَأْخُذُهُ النَّارُ إِلَى رُكْبَتَيْهِ وَمِنْهُمْ\n مَنْ تَأْخُذُهُ النَّارُ إِلَى حُجْزَتِهِ وَمِنْهُمْ مَنْ تَأْخُذُهُ النَّارُ إِلَى تَرْقُوَتِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Di kalangan mereka, ada yang akan dijilat api neraka sehingga ke buku lali, ada yang sehingga ke lutut, ada yang sehingga ke pinggang, dan ada yang sehingga ke tulang selangka."
  },
  {
    "id": 14269,
    "hadith_number": 6992,
    "tajuk_hadith": "Perbezaan Ringkas Dalam Perawi Hadis",
    "perawi_melayu": "Sa'id dan perawi-perawi lain dengan sanad yang hampir sama.",
    "english_text": "This hadith has been narrated on the authority of Sa'id with the same chain of transmitters but with a slight variation of wording.",
    "arabic_text": "حَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا رَوْحٌ، حَدَّثَنَا سَعِيدٌ، بِهَذَا\n الإِسْنَادِ وَجَعَلَ مَكَانَ حُجْزَتِهِ حَقْوَيْهِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Sa'id melalui sanad yang hampir sama, cuma dengan sedikit perbezaan lafaz."
  },
  {
    "id": 14270,
    "hadith_number": 6993,
    "tajuk_hadith": "Pertikaian Neraka dan Syurga",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ،\n قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ احْتَجَّتِ النَّارُ وَالْجَنَّةُ فَقَالَتْ هَذِهِ يَدْخُلُنِي\n الْجَبَّارُونَ وَالْمُتَكَبِّرُونَ ‏.‏ وَقَالَتْ هَذِهِ يَدْخُلُنِي الضُّعَفَاءُ وَالْمَسَاكِينُ فَقَالَ اللَّهُ عَزَّ وَجَلَّ لِهَذِهِ\n أَنْتِ عَذَابِي أُعَذِّبُ بِكِ مَنْ أَشَاءُ - وَرُبَّمَا قَالَ أُصِيبُ بِكِ مَنْ أَشَاءُ - وَقَالَ لِهَذِهِ أَنْتِ\n رَحْمَتِي أَرْحَمُ بِكِ مَنْ أَشَاءُ وَلِكُلِّ وَاحِدَةٍ مِنْكُمَا مِلْؤُهَا ‏\"‏ ‏.‏",
    "malay_translation": "Neraka dan Syurga berbantah-bantahan. Neraka berkata, \"Orang-orang yang sombong dan angkuh akan masuk ke dalamku.\" Syurga pula berkata, \"Orang-orang yang lemah lembut dan hina akan masuk ke dalamku.\"  Maka Allah SWT berfirman kepada Neraka, \"Engkau adalah azab-Ku, Aku akan mengazab dengan engkau sesiapa yang Aku kehendaki.\"  Dan kepada Syurga, Dia berfirman, \"Engkau adalah rahmat-Ku, Aku akan merahmati dengan engkau sesiapa yang Aku kehendaki. Dan setiap satunya daripada kamu berdua akan penuh (penghuni).\""
  },
  {
    "id": 14271,
    "hadith_number": 6994,
    "tajuk_hadith": "Pertikaian Neraka dan Syurga",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنِي وَرْقَاءُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ،\n عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ تَحَاجَّتِ النَّارُ وَالْجَنَّةُ فَقَالَتِ النَّارُ\n أُوثِرْتُ بِالْمُتَكَبِّرِينَ وَالْمُتَجَبِّرِينَ ‏.‏ وَقَالَتِ الْجَنَّةُ فَمَا لِي لاَ يَدْخُلُنِي إِلاَّ ضُعَفَاءُ النَّاسِ وَسَقَطُهُمْ\n وَعَجَزُهُمْ ‏.‏ فَقَالَ اللَّهُ لِلْجَنَّةِ أَنْتِ رَحْمَتِي أَرْحَمُ بِكِ مَنْ أَشَاءُ مِنْ عِبَادِي ‏.‏ وَقَالَ لِلنَّارِ أَنْتِ\n عَذَابِي أُعَذِّبُ بِكِ مَنْ أَشَاءُ مِنْ عِبَادِي وَلِكُلِّ وَاحِدَةٍ مِنْكُمْ مِلْؤُهَا فَأَمَّا النَّارُ فَلاَ تَمْتَلِئُ ‏.‏\n فَيَضَعُ قَدَمَهُ عَلَيْهَا فَتَقُولُ قَطْ قَطْ ‏.‏ فَهُنَالِكَ تَمْتَلِئُ وَيُزْوَى بَعْضُهَا إِلَى بَعْضٍ ‏\"‏ ‏.‏",
    "malay_translation": "Neraka dan Syurga berbalah. Neraka berkata, \"Aku dipenuhi oleh orang-orang yang sombong dan angkuh.\" Syurga berkata, \"Mengapa hanya orang-orang yang lemah, hina dina dan tidak berdaya sahaja yang masuk ke dalamku?\" Allah berfirman kepada Syurga, \"Engkau adalah rahmat-Ku, Aku merahmati sesiapa yang Aku kehendaki daripada hamba-hamba-Ku melalui engkau.\"  Allah berfirman kepada Neraka, \"Engkau adalah azab-Ku, Aku mengazab sesiapa yang Aku kehendaki daripada hamba-hamba-Ku melalui engkau.\"  Dan setiap satunya daripada kamu akan penuh.  Akan tetapi Neraka tidak akan penuh sehingga Allah meletakkan tapak kaki-Nya ke atasnya.  Maka Neraka akan berkata, \"Cukup, cukup, cukup.\"  Pada ketika itulah Neraka akan penuh dan bahagian-bahagiannya akan bergabung antara satu sama lain."
  },
  {
    "id": 14272,
    "hadith_number": 6995,
    "tajuk_hadith": "Pertikaian Syurga dan Neraka",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The Paradise and the Hell disputed with each other. The rest of the hadith is the same.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَوْنٍ الْهِلاَلِيُّ، حَدَّثَنَا أَبُو سُفْيَانَ، - يَعْنِي مُحَمَّدَ بْنَ حُمَيْدٍ -\n عَنْ مَعْمَرٍ، عَنْ أَيُّوبَ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ\n ‏\n\"‏ احْتَجَّتِ الْجَنَّةُ وَالنَّارُ ‏\"‏ ‏.‏ وَاقْتَصَّ الْحَدِيثَ بِمَعْنَى حَدِيثِ أَبِي الزِّنَادِ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda: \"Syurga dan Neraka telah berbantah-bantahan.\"  (Baki hadis ini adalah sama seperti hadis Abu Zinad.)"
  },
  {
    "id": 14273,
    "hadith_number": 6996,
    "tajuk_hadith": "Perselisihan Syurga dan Neraka",
    "perawi_melayu": "Hammam bin Munabbih meriwayatkan bahawa Abu Hurairah telah meriwayatkan beberapa hadis daripada Rasulullah ﷺ dan salah satunya ialah seperti berikut: Rasulullah ﷺ bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ\n هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ تَحَاجَّتِ الْجَنَّةُ وَالنَّارُ فَقَالَتِ النَّارُ أُوثِرْتُ بِالْمُتَكَبِّرِينَ\n وَالْمُتَجَبِّرِينَ ‏.‏ وَقَالَتِ الْجَنَّةُ فَمَا لِي لاَ يَدْخُلُنِي إِلاَّ ضُعَفَاءُ النَّاسِ وَسَقَطُهُمْ وَغِرَّتُهُمْ قَالَ\n اللَّهُ لِلْجَنَّةِ إِنَّمَا أَنْتِ رَحْمَتِي أَرْحَمُ بِكِ مَنْ أَشَاءُ مِنْ عِبَادِي ‏.‏ وَقَالَ لِلنَّارِ إِنَّمَا أَنْتِ عَذَابِي\n أُعَذِّبُ بِكِ مَنْ أَشَاءُ مِنْ عِبَادِي ‏.‏ وَلِكُلِّ وَاحِدَةٍ مِنْكُمَا مِلْؤُهَا فَأَمَّا النَّارُ فَلاَ تَمْتَلِئُ حَتَّى\n يَضَعَ اللَّهُ تَبَارَكَ وَتَعَالَى رِجْلَهُ تَقُولُ قَطْ قَطْ قَطْ ‏.‏ فَهُنَالِكَ تَمْتَلِئُ وَيُزْوَى بَعْضُهَا إِلَى بَعْضٍ\n وَلاَ يَظْلِمُ اللَّهُ مِنْ خَلْقِهِ أَحَدًا وَأَمَّا الْجَنَّةُ فَإِنَّ اللَّهَ يُنْشِئُ لَهَا خَلْقًا ‏\"‏ ‏.‏",
    "malay_translation": "Syurga dan Neraka berdebat. Neraka berkata, \"Aku diistimewakan untuk menempatkan orang-orang yang sombong dan angkuh.\" Syurga berkata, \"Mengapa hanya orang-orang yang lemah, hina dina dan sederhana sahaja yang masuk ke dalamku?\" Allah berfirman kepada Syurga, \"Sesungguhnya engkau adalah rahmat-Ku. Aku akan merahmati sesiapa yang Aku kehendaki daripada hamba-hamba-Ku melalui engkau.\"  Dan berfirman kepada Neraka, \"Sesungguhnya engkau adalah azab-Ku. Aku akan mengazab sesiapa yang Aku kehendaki daripada hamba-hamba-Ku melalui engkau.\"  Dan setiap satunya daripada kamu berdua akan penuh.  Adapun Neraka, ia tidak akan penuh sehingga Allah SWT meletakkan kaki-Nya di dalamnya.  Maka Neraka akan berkata, \"Cukup, cukup, cukup!\"  Pada ketika itulah ia penuh dan bahagian-bahagiannya akan saling berhimpit.  Allah tidak akan menganiaya seorang pun daripada makhluk-Nya. Adapun Syurga, nescaya Allah akan menciptakan makhluk baru untuknya."
  },
  {
    "id": 14274,
    "hadith_number": 6997,
    "tajuk_hadith": "Perselisihan Syurga dan Neraka",
    "perawi_melayu": "Abu Said al-Khudri meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The Paradise and the Hell disputed with each other. The rest of the hadith is the same as transmitted by Abu Huraira up to the words'.\" It is essential for Me to fill up both of you.\"",
    "arabic_text": "وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ \n أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ احْتَجَّتِ الْجَنَّةُ وَالنَّارُ ‏\"‏\n ‏.‏ فَذَكَرَ نَحْوَ حَدِيثِ أَبِي هُرَيْرَةَ إِلَى قَوْلِهِ ‏\"‏ وَلِكِلَيْكُمَا عَلَىَّ مِلْؤُهَا ‏\"‏ ‏.‏ وَلَمْ يَذْكُرْ مَا بَعْدَهُ\n مِنَ الزِّيَادَةِ ‏.‏",
    "malay_translation": "Syurga dan Neraka telah berbantah-bantah.  Baki hadis ini sama seperti yang diriwayatkan oleh Abu Hurairah sehingga kepada perkataan:  \"… dan Aku wajib memenuhi kedua-duanya.\""
  },
  {
    "id": 14275,
    "hadith_number": 6998,
    "tajuk_hadith": "Neraka Jahanam Sentiasa Menjerit Mahu Tambahan",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Is there anything more, until Allah, the Exalted and High, would place His foot therein and that would say: Enough, enough, by Your Honour, and some parts of it would draw close to the other.",
    "arabic_text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا شَيْبَانُ، عَنْ قَتَادَةَ، حَدَّثَنَا \n أَنَسُ بْنُ مَالِكٍ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَزَالُ جَهَنَّمُ تَقُولُ هَلْ مِنْ مَزِيدٍ\n ‏.‏ حَتَّى يَضَعَ فِيهَا رَبُّ الْعِزَّةِ تَبَارَكَ وَتَعَالَى قَدَمَهُ فَتَقُولُ قَطْ قَطْ وَعِزَّتِكَ ‏.‏ وَيُزْوَى بَعْضُهَا\n إِلَى بَعْضٍ ‏\"‏ ‏.‏",
    "malay_translation": "Neraka Jahanam sentiasa berkata, \"Adakah lagi (penduduk)?\" sehingga Tuhan Yang Maha Mulia dan Maha Tinggi melangkahkan kaki ke dalamnya. Maka neraka itu akan berkata, \"Cukup, cukup, demi kemuliaan-Mu!\" dan bahagian-bahagiannya akan saling mendekat."
  },
  {
    "id": 14276,
    "hadith_number": 6999,
    "tajuk_hadith": "Sanad Riwayat Hadis daripada Anas",
    "perawi_melayu": "Zuhayr bin Harb melalui beberapa perawi lain iaitu Abdus Samad bin Abdul Warits, Aban bin Yazid al-Attar dan Qatadah daripada Anas daripada Nabi SAW.",
    "english_text": "This hadith has been narrated on the authority of Anas through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ،\n الْعَطَّارِ حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَى حَدِيثِ شَيْبَانَ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Anas melalui beberapa sanad yang lain.  Zuhayr bin Harb meriwayatkan daripada Abdus Samad bin Abdul Warits, yang meriwayatkan daripada Aban bin Yazid al-Attar, yang meriwayatkan daripada Qatadah, daripada Anas, daripada Nabi SAW. (dengan maksud yang sama seperti hadis Syiban)."
  },
  {
    "id": 14277,
    "hadith_number": 7000,
    "tajuk_hadith": "Neraka Jahannam dan Keluasan Syurga",
    "perawi_melayu": "Abd al-Wahhab b. Ata' meriwayatkan berkaitan dengan firman Allah SWT:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرُّزِّيُّ، حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَطَاءٍ، فِي قَوْلِهِ عَزَّ وَجَلَّ\n ‏{‏ يَوْمَ نَقُولُ لِجَهَنَّمَ هَلِ امْتَلأْتِ وَتَقُولُ هَلْ مِنْ مَزِيدٍ‏}‏ فَأَخْبَرَنَا عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ\n أَنَسِ بْنِ مَالِكٍ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\"‏ لاَ تَزَالُ جَهَنَّمُ يُلْقَى فِيهَا وَتَقُولُ\n هَلْ مِنْ مَزِيدٍ حَتَّى يَضَعَ رَبُّ الْعِزَّةِ فِيهَا قَدَمَهُ فَيَنْزَوِي بَعْضُهَا إِلَى بَعْضٍ وَتَقُولُ قَطْ قَطْ\n بِعِزَّتِكَ وَكَرَمِكَ ‏.‏ وَلاَ يَزَالُ فِي الْجَنَّةِ فَضْلٌ حَتَّى يُنْشِئَ اللَّهُ لَهَا خَلْقًا فَيُسْكِنَهُمْ فَضْلَ الْجَنَّةِ\n ‏\"‏ ‏.‏",
    "malay_translation": "Muhammad bin Abdullah Ar-Ruzi telah meriwayatkan daripada Abd al-Wahhab bin Ata’ berkaitan dengan firman Allah SWT yang bermaksud: {Pada hari (yang dijanjikan) Kami akan berkata kepada Jahannam: “Adakah engkau telah penuh?” dan ia akan menjawab: “Adakah lagi (yang lain)?”}.  Kemudian, dari Said, daripada Qatadah, daripada Anas bin Malik, daripada Nabi SAW bahawa baginda bersabda:  “Jahannam sentiasa diisi dan ia akan berkata: ‘Adakah lagi (yang lain)?’ sehingga Tuhan Yang Maha Mulia meletakkan kakinya di dalamnya.  Maka sesetengah bahagiannya akan mendekat kepada bahagian yang lain dan ia akan berkata: ‘Cukup, cukup! Demi kemuliaan dan keagungan-Mu!’ Dan Syurga akan sentiasa mempunyai ruang yang lapang sehingga Allah SWT menciptakan makhluk baru dan menempatkan mereka di ruang lapang Syurga itu.”"
  },
  {
    "id": 14278,
    "hadith_number": 7001,
    "tajuk_hadith": "Sisa Syurga dan Ciptaan Allah",
    "perawi_melayu": "Anas meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "There would be left some space in Paradise as Allah would like that to be left. Then Allah would create another creation as He would like.",
    "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادٌ، - يَعْنِي ابْنَ سَلَمَةَ - أَخْبَرَنَا \n ثَابِتٌ، قَالَ سَمِعْتُ أَنسًا، يَقُولُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَبْقَى مِنَ الْجَنَّةِ مَا\n شَاءَ اللَّهُ أَنْ يَبْقَى ثُمَّ يُنْشِئُ اللَّهُ تَعَالَى لَهَا خَلْقًا مِمَّا يَشَاءُ ‏\"‏ ‏.‏",
    "malay_translation": "Anas meriwayatkan bahawa Rasulullah SAW bersabda:  \"Akan ada ruang yang tinggal di syurga sebagaimana yang Allah kehendaki. Kemudian Allah SWT akan menciptakan makhluk baharu untuknya sebagaimana yang Dia kehendaki.\""
  },
  {
    "id": 14279,
    "hadith_number": 7002,
    "tajuk_hadith": "Kematian pada Hari Kiamat",
    "perawi_melayu": "Abu Said meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ - وَتَقَارَبَا فِي اللَّفْظِ - قَالاَ حَدَّثَنَا \n أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله\n عليه وسلم ‏\"‏ يُجَاءُ بِالْمَوْتِ يَوْمَ الْقِيَامَةِ كَأَنَّهُ كَبْشٌ أَمْلَحُ - زَادَ أَبُو كُرَيْبٍ - فَيُوقَفُ بَيْنَ\n الْجَنَّةِ وَالنَّارِ - وَاتَّفَقَا فِي بَاقِي الْحَدِيثِ - فَيُقَالُ يَا أَهْلَ الْجَنَّةِ هَلْ تَعْرِفُونَ هَذَا فَيَشْرَئِبُّونَ\n وَيَنْظُرُونَ وَيَقُولُونَ نَعَمْ هَذَا الْمَوْتُ - قَالَ - وَيُقَالُ يَا أَهْلَ النَّارِ هَلْ تَعْرِفُونَ هَذَا قَالَ\n فَيَشْرَئِبُّونَ وَيَنْظُرُونَ وَيَقُولُونَ نَعَمْ هَذَا الْمَوْتُ - قَالَ - فَيُؤْمَرُ بِهِ فَيُذْبَحُ - قَالَ - ثُمَّ\n يُقَالُ يَا أَهْلَ الْجَنَّةِ خُلُودٌ فَلاَ مَوْتَ وَيَا أَهْلَ النَّارِ خُلُودٌ فَلاَ مَوْتَ ‏\"‏ ‏.‏ قَالَ ثُمَّ قَرَأَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏{‏ وَأَنْذِرْهُمْ يَوْمَ الْحَسْرَةِ إِذْ قُضِيَ الأَمْرُ وَهُمْ فِي غَفْلَةٍ وَهُمْ لاَ\n يُؤْمِنُونَ‏}‏ وَأَشَارَ بِيَدِهِ إِلَى الدُّنْيَا ‏.‏",
    "malay_translation": "Dikisahkan bahawa pada Hari Kiamat, kematian akan dibawa dalam rupa seekor kambing jantan berwarna putih.  Abu Kuraib menambah: Kemudian ia akan dihentikan di antara Syurga dan Neraka.  Kedua-dua perawi bersetuju dengan baki hadis ini.  Lalu dikatakan kepada penghuni Syurga: “Wahai ahli Syurga, adakah kamu mengenali ini?” Mereka akan menjulurkan leher dan memandang ke arahnya dan berkata: “Ya, ini adalah kematian.” Kemudian dikatakan kepada penghuni Neraka: “Wahai ahli Neraka, adakah kamu mengenali ini?” Mereka akan menjulurkan leher dan memandang dan berkata: “Ya, ini adalah kematian.” Kemudian diperintahkan untuk menyembelihnya, lalu dikatakan: “Wahai ahli Syurga, kamu kekal abadi tanpa kematian. Dan wahai ahli Neraka, kamu kekal abadi tanpa kematian.” Kemudian Rasulullah SAW membaca ayat ini sambil menunjuk ke dunia ini:  “Dan berilah amaran kepada mereka terhadap hari kesedihan, apabila telah diputuskan segala perkara, sedang mereka dalam keadaan lalai dan mereka tidak beriman.” (Surah Maryam, ayat 39)."
  },
  {
    "id": 14280,
    "hadith_number": 7003,
    "tajuk_hadith": "Ahli Syurga dan Ahli Neraka",
    "perawi_melayu": "Abu Sa'id meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي،\n سَعِيدٍ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا أُدْخِلَ أَهْلُ الْجَنَّةِ الْجَنَّةَ وَأَهْلُ النَّارِ\n النَّارَ قِيلَ يَا أَهْلَ الْجَنَّةِ ‏\"‏ ‏.‏ ثُمَّ ذَكَرَ بِمَعْنَى حَدِيثِ أَبِي مُعَاوِيَةَ غَيْرَ أَنَّهُ قَالَ ‏\"‏ فَذَلِكَ قَوْلُهُ\n عَزَّ وَجَلَّ ‏\"‏ ‏.‏ وَلَمْ يَقُلْ ثُمَّ قَرَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ وَلَمْ يَذْكُرْ أَيْضًا وَأَشَارَ\n بِيَدِهِ إِلَى الدُّنْيَا ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Usman bin Abi Syaibah, telah menceritakan kepada kami Jarir, dari Al-A'masy, dari Abu Shalih, dari Abi Sa'id, dia berkata: Rasulullah SAW bersabda: \"Apabila ahli syurga dimasukkan ke dalam syurga dan ahli neraka dimasukkan ke dalam neraka, maka dikatakan (kepada ahli syurga): Wahai ahli syurga!\" Kemudian beliau menyebut dengan maksud hadis Abi Muawiyah, kecuali bahawa beliau berkata: \"Maka itulah firman-Nya (Allah) Yang Maha Tinggi.\" Dan beliau tidak berkata: Kemudian Rasulullah SAW membacakan. Dan beliau juga tidak menyebut dan baginda menunjuk dengan tangan baginda ke dunia."
  },
  {
    "id": 14281,
    "hadith_number": 7004,
    "tajuk_hadith": "Kekekalan di Syurga dan Neraka",
    "perawi_melayu": "Abdullah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَالْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ عَبْدٌ أَخْبَرَنِي \n وَقَالَ الآخَرَانِ، حَدَّثَنَا يَعْقُوبُ، - وَهُوَ ابْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ - حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، حَدَّثَنَا \n نَافِعٌ، أَنَّ عَبْدَ اللَّهِ، قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يُدْخِلُ اللَّهُ أَهْلَ الْجَنَّةِ\n الْجَنَّةَ وَيُدْخِلُ أَهْلَ النَّارِ النَّارَ ثُمَّ يَقُومُ مُؤَذِّنٌ بَيْنَهُمْ فَيَقُولُ يَا أَهْلَ الْجَنَّةِ لاَ مَوْتَ وَيَا أَهْلَ\n النَّارِ لاَ مَوْتَ كُلٌّ خَالِدٌ فِيمَا هُوَ فِيهِ ‏\"‏ ‏.‏",
    "malay_translation": "Allah SWT akan memasukkan ahli syurga ke dalam syurga dan ahli neraka ke dalam neraka. Kemudian, seorang muazin akan berdiri di antara mereka dan berkata: Wahai ahli syurga, tiada kematian lagi bagi kamu, wahai ahli neraka, tiada kematian lagi bagi kamu. Kamu semua kekal selama-lamanya di tempat masing-masing."
  },
  {
    "id": 14282,
    "hadith_number": 7005,
    "tajuk_hadith": "Kematian Diantara Syurga dan Neraka",
    "perawi_melayu": "Umar bin Muhammad bin Zaid bin Abdullah bin Umar bin al-Khattab meriwayatkan daripada bapanya, Abdullah bin Umar bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنِي \n عُمَرُ بْنُ مُحَمَّدِ بْنِ زَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ، أَنَّ أَبَاهُ، حَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ،\n عُمَرَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا صَارَ أَهْلُ الْجَنَّةِ إِلَى الْجَنَّةِ وَصَارَ\n أَهْلُ النَّارِ إِلَى النَّارِ أُتِيَ بِالْمَوْتِ حَتَّى يُجْعَلَ بَيْنَ الْجَنَّةِ وَالنَّارِ ثُمَّ يُذْبَحُ ثُمَّ يُنَادِي مُنَادٍ\n يَا أَهْلَ الْجَنَّةِ لاَ مَوْتَ وَيَا أَهْلَ النَّارِ لاَ مَوْتَ ‏.‏ فَيَزْدَادُ أَهْلُ الْجَنَّةِ فَرَحًا إِلَى فَرَحِهِمْ وَيَزْدَادُ\n أَهْلُ النَّارِ حُزْنًا إِلَى حُزْنِهِمْ ‏\"‏ ‏.‏",
    "malay_translation": "Aku telah mendengar daripada Harun bin Said al-Ayli dan Harmalah bin Yahya, mereka berdua berkata: telah menceritakan kepada kami Ibn Wahb, telah menceritakan kepadaku Umar bin Muhammad bin Zaid bin Abdullah bin Umar bin al-Khattab bahawa bapanya telah menceritakan kepadanya daripada Abdullah bin Umar bahawa Rasulullah SAW bersabda: \"Apabila penduduk syurga telah sampai ke syurga dan penduduk neraka telah sampai ke neraka, maka kematian akan dibawa sehingga diletakkan di antara syurga dan neraka, kemudian disembelih.  Lalu seorang penyeru akan menyeru: Wahai penduduk syurga, tiada kematian! Wahai penduduk neraka, tiada kematian! Maka penduduk syurga akan bertambah gembira dengan kegembiraan mereka, dan penduduk neraka akan bertambah sedih dengan kesedihan mereka.\""
  },
  {
    "id": 14283,
    "hadith_number": 7006,
    "tajuk_hadith": "Gigi Kafir Seperti Gunung Uhud",
    "perawi_melayu": "Dari Abu Hurairah, Rasulullah SAW bersabda:",
    "english_text": "The molar tooth of an unbeliever or the canine teeth of an unbeliever will be like Uhud and the thickness of his skin a three night's journey.",
    "arabic_text": "حَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ، حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، عَنِ الْحَسَنِ بْنِ صَالِحٍ،\n عَنْ هَارُونَ بْنِ سَعْدٍ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم ‏\n\"‏ ضِرْسُ الْكَافِرِ أَوْ نَابُ الْكَافِرِ مِثْلُ أُحُدٍ وَغِلَظُ جِلْدِهِ مَسِيرَةُ ثَلاَثٍ ‏\"‏ ‏.‏",
    "malay_translation": "Dari Abu Hurairah, Rasulullah SAW bersabda:  \"Gigi geraham orang kafir atau gigi taring orang kafir seperti Gunung Uhud, dan ketebalan kulitnya seperti perjalanan tiga malam.\""
  },
  {
    "id": 14284,
    "hadith_number": 7007,
    "tajuk_hadith": "Jarak Bahu Kaﬁr di Neraka",
    "perawi_melayu": "Abu Hurairah meriwayatkan daripada Rasulullah SAW bahawa baginda bersabda:",
    "english_text": "The distance of the two shoulders of the non-believer in Hell will be a three-day journey for a swift rider.",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، وَأَحْمَدُ بْنُ عُمَرَ الْوَكِيعِيُّ، قَالاَ حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنْ \n أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، يَرْفَعُهُ قَالَ ‏\"‏ مَا بَيْنَ مَنْكِبَىِ الْكَافِرِ فِي النَّارِ مَسِيرَةُ ثَلاَثَةِ\n أَيَّامٍ لِلرَّاكِبِ الْمُسْرِعِ ‏\"‏ ‏.‏ وَلَمْ يَذْكُرِ الْوَكِيعِيُّ ‏\"‏ فِي النَّارِ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan daripada Rasulullah SAW bahawa baginda bersabda: \"Jarak antara kedua-dua bahu orang kafir di dalam neraka ialah perjalanan tiga hari bagi penunggang yang laju.\""
  },
  {
    "id": 14285,
    "hadith_number": 7008,
    "tajuk_hadith": "Ahli Syurga dan Ahli Neraka",
    "perawi_melayu": "Haritha bin Wahb meriwayatkan bahawa baginda Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، حَدَّثَنِي مَعْبَدُ بْنُ خَالِدٍ،\n أَنَّهُ سَمِعَ حَارِثَةَ بْنَ وَهْبٍ، أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ أَلاَ أُخْبِرُكُمْ بِأَهْلِ\n الْجَنَّةِ ‏\"‏ ‏.‏ قَالُوا بَلَى ‏.‏ قَالَ صلى الله عليه وسلم ‏\"‏ كُلُّ ضَعِيفٍ مُتَضَعَّفٍ لَوْ أَقْسَمَ عَلَى\n اللَّهِ لأَبَرَّهُ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ أَلاَ أُخْبِرُكُمْ بِأَهْلِ النَّارِ ‏\"‏ ‏.‏ قَالُوا بَلَى ‏.‏ قَالَ ‏\"‏ كُلُّ عُتُلٍّ جَوَّاظٍ\n مُسْتَكْبِرٍ ‏\"‏ ‏.‏",
    "malay_translation": "Haritha bin Wahb meriwayatkan bahawa Nabi SAW bersabda: \"Adakah kamu mahu aku beritahu tentang penghuni syurga?\" Mereka menjawab: \"Ya.\" Baginda SAW bersabda: \"Setiap orang yang lemah dan merendah diri, sekiranya dia bersumpah atas nama Allah, nescaya Allah akan mengabulkannya.\" Kemudian baginda bersabda: \"Adakah kamu mahu aku beritahu tentang penghuni neraka?\" Mereka menjawab: \"Ya.\" Baginda SAW bersabda: \"Setiap orang yang sombong, angkuh dan takbur.\""
  },
  {
    "id": 14286,
    "hadith_number": 7009,
    "tajuk_hadith": "Variasi Ringkas Hadis daripada Syu'bah",
    "perawi_melayu": "Muhammad bin Muthanna, Muhammad bin Ja'far, dan Syu'bah",
    "english_text": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters but with a slight variation of wording.",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ بِمِثْلِهِ\n غَيْرَ أَنَّهُ قَالَ ‏\n\"‏ أَلاَ أَدُلُّكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan melalui sanad yang sama daripada Syu'bah, dengan sedikit perbezaan lafaz.  (Muhammad bin Muthanna meriwayatkan daripada Muhammad bin Ja'far, yang meriwayatkan daripada Syu'bah dengan isnad yang serupa, cuma bezanya ialah beliau berkata:  \"Adakah aku tunjukkan kepada kamu?\" )"
  },
  {
    "id": 14287,
    "hadith_number": 7010,
    "tajuk_hadith": "Ahli Syurga dan Ahli Neraka",
    "perawi_melayu": "Haritha bin Wahb al-Khuza'i meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "May I not inform you about the inmates of Paradise? (And then informing about them) said: Every meek person who is considered to be humble and if they were to adjure in the name of Allah, Allah would certainly fulfil it. May I not inform you about the inmates of Hell-Fire? They are all proud, mean and haughty.",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ مَعْبَدِ بْنِ خَالِدٍ،\n قَالَ سَمِعْتُ حَارِثَةَ بْنَ وَهْبٍ الْخُزَاعِيَّ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَلاَ\n أُخْبِرُكُمْ بِأَهْلِ الْجَنَّةِ كُلُّ ضَعِيفٍ مُتَضَعَّفٍ لَوْ أَقْسَمَ عَلَى اللَّهِ لأَبَرَّهُ أَلاَ أُخْبِرُكُمْ بِأَهْلِ النَّارِ\n كُلُّ جَوَّاظٍ زَنِيمٍ مُتَكَبِّرٍ ‏\"‏ ‏.‏",
    "malay_translation": "Adakah kamu ingin Aku beritahu siapakah penghuni syurga?  (Lalu Baginda menerangkan): Setiap orang yang lemah lembut dan merendah diri, sekiranya mereka bersumpah atas nama Allah, nescaya Allah akan mengabulkan sumpah mereka. Adakah kamu ingin Aku beritahu siapakah penghuni neraka? Mereka adalah orang-orang yang sombong, keji dan angkuh."
  },
  {
    "id": 14288,
    "hadith_number": 7011,
    "tajuk_hadith": "Orang yang Berambut Kusut dan Sumpahnya",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Many a people with dishevelled hair are driven away from the door (but they are so pious) that if they are to swear in the name of Allah, He would definitely fulfil that.",
    "arabic_text": "حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنِي حَفْصُ بْنُ مَيْسَرَةَ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ،\n عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ رُبَّ أَشْعَثَ مَدْفُوعٍ\n بِالأَبْوَابِ لَوْ أَقْسَمَ عَلَى اللَّهِ لأَبَرَّهُ ‏\"‏ ‏.‏",
    "malay_translation": "Ramai orang yang berambut kusut dan dihalau dari pintu (tetapi mereka sangat taat beribadah) sehingga sekiranya mereka bersumpah dengan nama Allah, nescaya Allah akan menepati sumpah mereka."
  },
  {
    "id": 14289,
    "hadith_number": 7012,
    "tajuk_hadith": "Larangan Menyeksa Isteri dan Mencemuh Perbuatan Diri Sendiri",
    "perawi_melayu": "'Abdullah bin Zam'ah meriwayatkan bahawa Rasulullah SAW telah menyampaikan khutbah dan baginda menyebut tentang unta betina dan juga menyebut tentang orang yang memotong kaki belakangnya, dan baginda membaca:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا ابْنُ نُمَيْرٍ، عَنْ هِشَامِ بْنِ،\n عُرْوَةَ عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ زَمْعَةَ، قَالَ خَطَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَذَكَرَ\n النَّاقَةَ وَذَكَرَ الَّذِي عَقَرَهَا فَقَالَ ‏\"‏ إِذِ انْبَعَثَ أَشْقَاهَا انْبَعَثَ بِهَا رَجُلٌ عَزِيزٌ عَارِمٌ مَنِيعٌ\n فِي رَهْطِهِ مِثْلُ أَبِي زَمْعَةَ ‏\"‏ ‏.‏ ثُمَّ ذَكَرَ النِّسَاءَ فَوَعَظَ فِيهِنَّ ثُمَّ قَالَ ‏\"‏ إِلاَمَ يَجْلِدُ أَحَدُكُمُ امْرَأَتَهُ\n ‏\"‏ ‏.‏ فِي رِوَايَةِ أَبِي بَكْرٍ ‏\"‏ جَلْدَ الأَمَةِ ‏\"‏ ‏.‏ وَفِي رِوَايَةِ أَبِي كُرَيْبٍ ‏\"‏ جَلْدَ الْعَبْدِ وَلَعَلَّهُ يُضَاجِعُهَا\n مِنْ آخِرِ يَوْمِهِ ‏\"‏ ‏.‏ ثُمَّ وَعَظَهُمْ فِي ضَحِكِهِمْ مِنَ الضَّرْطَةِ فَقَالَ ‏\"‏ إِلاَمَ يَضْحَكُ أَحَدُكُمْ مِمَّا\n يَفْعَلُ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Bakar bin Abi Syaibah dan Abu Kuraib berkata:  Kami telah mendengar daripada Ibnu Numair, daripada Hisyam bin Urwah daripada bapanya, daripada Abdullah bin Zam'ah, bahawa Rasulullah SAW bersabda:  Baginda telah berkhutbah dan menyebut tentang unta betina dan orang yang menyembelihnya. Baginda bersabda:  \"Apabila orang yang paling hina di kalangan mereka melakukan kejahatan, maka ia dilakukan oleh seorang lelaki yang berpengaruh dan kuat dalam kaumnya seperti Abu Zam'ah.\" Kemudian baginda menyebut tentang kaum wanita dan memberi nasihat tentang mereka, lalu bersabda: \"Adakah sesetengah daripada kamu menyeksa isterinya?\" Dalam riwayat Abu Bakar:  \"Menyeksa seperti hamba perempuan.\"  Dan dalam riwayat Abu Kuraib:  \"Menyeksa seperti hamba lelaki, dan mungkin dia akan menidurinya di penghujung hari.\" Kemudian baginda menasihati mereka tentang ketawa mereka terhadap kentut, lalu bersabda:  \"Adakah sesetengah daripada kamu ketawa terhadap apa yang dilakukannya sendiri?\" "
  },
  {
    "id": 14290,
    "hadith_number": 7013,
    "tajuk_hadith": "Amr bin Luhayy di dalam Neraka",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "I saw 'Amr b. Luhayy b. Qam'a b. Khindif, brother of Bani Ka'b, dragging his Intestines in Fire.",
    "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ\n قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ رَأَيْتُ عَمْرَو بْنَ لُحَىِّ بْنِ قَمَعَةَ بْنِ خِنْدِفَ أَبَا بَنِي\n كَعْبٍ هَؤُلاَءِ يَجُرُّ قُصْبَهُ فِي النَّارِ ‏\"‏ ‏.‏",
    "malay_translation": "Aku melihat Amr bin Luhayy bin Qamaah bin Khindif, ketua Bani Ka'ab, sedang menjerut ususnya di dalam neraka."
  },
  {
    "id": 14291,
    "hadith_number": 7014,
    "tajuk_hadith": "Amr bin Amir al-Khuza'i di Neraka",
    "perawi_melayu": "Said bin Musayyib menjelaskan \"al-bahira\" sebagai haiwan yang tidak diperah susunya melainkan untuk berhala. Dan tiada seorang pun dari kalangan manusia yang memerah susunya, dan \"as-sa'iba\" sebagai haiwan yang dilepaskan untuk berhala. Tiada apa-apa yang dimuatkan ke atasnya, dan Ibnu Musayyib meriwayatkan bahawa Abu Hurairah menyatakan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، وَحَسَنٌ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ عَبْدٌ أَخْبَرَنِي وَقَالَ،\n الآخَرَانِ حَدَّثَنَا يَعْقُوبُ، - وَهُوَ ابْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ - حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ،\n شِهَابٍ قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ إِنَّ الْبَحِيرَةَ الَّتِي يُمْنَعُ دَرُّهَا لِلطَّوَاغِيتِ فَلاَ\n يَحْلُبُهَا أَحَدٌ مِنَ النَّاسِ وَأَمَّا السَّائِبَةُ الَّتِي كَانُوا يُسَيِّبُونَهَا لآلِهَتِهِمْ فَلاَ يُحْمَلُ عَلَيْهَا شَىْءٌ\n ‏.‏ وَقَالَ ابْنُ الْمُسَيَّبِ قَالَ أَبُو هُرَيْرَةَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ رَأَيْتُ عَمْرَو\n بْنَ عَامِرٍ الْخُزَاعِيَّ يَجُرُّ قُصْبَهُ فِي النَّارِ وَكَانَ أَوَّلَ مَنْ سَيَّبَ السُّيُوبَ ‏\"‏ ‏.‏",
    "malay_translation": "Aku telah diceritakan oleh Amru an-Naqid, Hasan al-Hulwani, dan Abd bin Humaid. Abd berkata, beliau telah memberitakan kepadaku, dan yang lain berdua telah menceritakan kepada kami, Ya'qub - iaitu Ibnu Ibrahim bin Sa'ad - telah menceritakan kepada kami daripada bapa saudaraku, daripada Shalih, daripada Ibnu Syihab. Beliau berkata, aku telah mendengar Said bin Musayyib berkata: Sesungguhnya al-Bahirah iaitu binatang yang susunya dilarang diperah untuk berhala, maka tidak seorang pun daripada manusia yang memerah susunya. Dan adapun as-Saibah iaitu binatang yang mereka lepaskan untuk tuhan-tuhan mereka, maka tiada apa-apa yang dimuatkan ke atasnya. Dan Ibnu Musayyib berkata, Abu Hurairah berkata, Rasulullah SAW bersabda:  \"Aku melihat Amr bin Amir al-Khuza'i menyeret usus-usunya di dalam api, dan dia adalah orang pertama yang melepaskan binatang untuk berhala.\""
  },
  {
    "id": 14292,
    "hadith_number": 7015,
    "tajuk_hadith": "Dua Golongan Ahli Neraka",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ\n قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ صِنْفَانِ مِنْ أَهْلِ النَّارِ لَمْ أَرَهُمَا قَوْمٌ مَعَهُمْ سِيَاطٌ\n كَأَذْنَابِ الْبَقَرِ يَضْرِبُونَ بِهَا النَّاسَ وَنِسَاءٌ كَاسِيَاتٌ عَارِيَاتٌ مُمِيلاَتٌ مَائِلاَتٌ رُءُوسُهُنَّ\n كَأَسْنِمَةِ الْبُخْتِ الْمَائِلَةِ لاَ يَدْخُلْنَ الْجَنَّةَ وَلاَ يَجِدْنَ رِيحَهَا وَإِنَّ رِيحَهَا لَتُوجَدُ مِنْ مَسِيرَةِ\n كَذَا وَكَذَا ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Zuhri bin Harb, telah menceritakan kepada kami Jarir, dari Suhail, dari bapanya, dari Abu Hurairah, bahawa beliau berkata: Rasulullah SAW bersabda: \"Dua golongan daripada penduduk neraka yang aku tidak pernah melihatnya: sekelompok orang yang membawa cemeti seperti ekor lembu, mereka memukul orang dengannya, dan wanita-wanita yang berpakaian tetapi telanjang, mereka menggoda dan digoda, kepala mereka seperti bonggol unta yang condong. Mereka tidak akan masuk syurga dan tidak akan merasa baunya, padahal baunya dihidu dari jarak sekian dan sekian.\""
  },
  {
    "id": 14293,
    "hadith_number": 7016,
    "tajuk_hadith": "Orang-orang yang sentiasa dalam Kemurkaan Allah",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "If you survive for a time you would certainly see people who would have whips in their hands like the tail of an ox. They would get up in the morning under the wrath of Allah and they would get into the evening with the anger of Allah.",
    "arabic_text": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا زَيْدٌ، - يَعْنِي ابْنَ حُبَابٍ - حَدَّثَنَا أَفْلَحُ بْنُ سَعِيدٍ، حَدَّثَنَا \n عَبْدُ اللَّهِ بْنُ رَافِعٍ، مَوْلَى أُمِّ سَلَمَةَ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله\n عليه وسلم ‏\n\"‏ يُوشِكُ إِنْ طَالَتْ بِكَ مُدَّةٌ أَنْ تَرَى قَوْمًا فِي أَيْدِيهِمْ مِثْلُ أَذْنَابِ الْبَقَرِ يَغْدُونَ\n فِي غَضَبِ اللَّهِ وَيَرُوحُونَ فِي سَخَطِ اللَّهِ ‏\"‏ ‏.‏",
    "malay_translation": "Tidak lama lagi, jika kamu hidup lebih lama, nescaya kamu akan melihat orang-orang yang tangannya seperti ekor lembu. Mereka bangun pagi dalam kemurkaan Allah dan masuk petang dalam kemurkaan Allah."
  },
  {
    "id": 14294,
    "hadith_number": 7017,
    "tajuk_hadith": "Kehidupan di Zaman Akhir",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ نَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ قَالُوا حَدَّثَنَا أَبُو\n عَامِرٍ الْعَقَدِيُّ حَدَّثَنَا أَفْلَحُ بْنُ سَعِيدٍ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ رَافِعٍ، مَوْلَى أُمِّ سَلَمَةَ قَالَ سَمِعْتُ \n أَبَا هُرَيْرَةَ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنْ طَالَتْ بِكَ مُدَّةٌ أَوْشَكْتَ\n أَنْ تَرَى قَوْمًا يَغْدُونَ فِي سَخَطِ اللَّهِ وَيَرُوحُونَ فِي لَعْنَتِهِ فِي أَيْدِيهِمْ مِثْلُ أَذْنَابِ الْبَقَرِ ‏\"‏\n ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:  \"Sekiranya kamu hidup untuk tempoh yang lama, nescaya kamu akan melihat suatu kaum yang memulakan hari dalam kemurkaan Allah dan mengakhirkannya dalam laknat-Nya, di tangan mereka ada seperti ekor lembu.\" "
  },
  {
    "id": 14295,
    "hadith_number": 7018,
    "tajuk_hadith": "Dunia Berbanding Akhirat",
    "perawi_melayu": "Hadis ini diriwayatkan melalui lima sanad yang berbeza, kesemuanya daripada Mustaurid, saudara Bani Fihr, bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ،\n حَدَّثَنَا أَبِي وَمُحَمَّدُ بْنُ بِشْرٍ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا مُوسَى بْنُ أَعْيَنَ، ح وَحَدَّثَنِي \n مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا أَبُو أُسَامَةَ، كُلُّهُمْ عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ،\n حَاتِمٍ - وَاللَّفْظُ لَهُ - حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا قَيْسٌ، قَالَ سَمِعْتُ \n مُسْتَوْرِدًا، أَخَا بَنِي فِهْرٍ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ وَاللَّهِ مَا الدُّنْيَا فِي\n الآخِرَةِ إِلاَّ مِثْلُ مَا يَجْعَلُ أَحَدُكُمْ إِصْبَعَهُ هَذِهِ - وَأَشَارَ يَحْيَى بِالسَّبَّابَةِ - فِي الْيَمِّ فَلْيَنْظُرْ\n بِمَ يَرْجِعُ ‏\"‏ ‏.‏ وَفِي حَدِيثِهِمْ جَمِيعًا غَيْرَ يَحْيَى سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم\n يَقُولُ ذَلِكَ ‏.‏ وَفِي حَدِيثِ أَبِي أُسَامَةَ عَنِ الْمُسْتَوْرِدِ بْنِ شَدَّادٍ أَخِي بَنِي فِهْرٍ وَفِي حَدِيثِهِ\n أَيْضًا قَالَ وَأَشَارَ إِسْمَاعِيلُ بِالإِبْهَامِ ‏.‏",
    "malay_translation": "Demi Allah, dunia ini dibandingkan dengan akhirat hanyalah seperti seseorang di antara kamu mencelupkan jarinya – dan Yahya menunjukkan jari telunjuknya – ke dalam lautan, kemudian hendaklah dia melihat apa yang melekat padanya."
  },
  {
    "id": 14296,
    "hadith_number": 7019,
    "tajuk_hadith": "Keadaan Manusia pada Hari Kiamat",
    "perawi_melayu": "Aisyah meriwayatkan bahawa baginda Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ حَاتِمِ بْنِ أَبِي صَغِيرَةَ، حَدَّثَنِي \n ابْنُ أَبِي مُلَيْكَةَ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه\n وسلم يَقُولُ ‏\"‏ يُحْشَرُ النَّاسُ يَوْمَ الْقِيَامَةِ حُفَاةً عُرَاةً غُرْلاً ‏\"‏ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ النِّسَاءُ\n وَالرِّجَالُ جَمِيعًا يَنْظُرُ بَعْضُهُمْ إِلَى بَعْضٍ قَالَ صلى الله عليه وسلم ‏\"‏ يَا عَائِشَةُ الأَمْرُ\n أَشَدُّ مِنْ أَنْ يَنْظُرَ بَعْضُهُمْ إِلَى بَعْضٍ ‏\"‏ ‏.‏",
    "malay_translation": "Diriwayatkan oleh Zuhri bin Harb, daripada Yahya bin Said, daripada Hatim bin Abi Shagirah, daripada Ibnu Abi Mulah, daripada al-Qasim bin Muhammad, daripada Aisyah r.a., katanya: Aku mendengar Rasulullah SAW bersabda: \" Manusia akan dihimpunkan pada hari kiamat dalam keadaan tanpa alas kaki, tanpa pakaian dan tidak bersunat.\"  Aku bertanya: \"Wahai Rasulullah, adakah lelaki dan perempuan akan bersama-sama dan saling memandang?\" Baginda SAW menjawab: \"Wahai Aisyah, keadaan pada hari itu terlalu genting sehingga mereka tidak akan saling memandang.\" "
  },
  {
    "id": 14297,
    "hadith_number": 7020,
    "tajuk_hadith": "Hadis Riwayat Hatim bin Abi Saghira Tanpa Sebutan 'Ghurlah'",
    "perawi_melayu": "Abu Bakr bin Abi Syaibah dan Ibnu Numair; daripada Abu Khalid al-Ahmar; daripada Hatim bin Abi Saghira",
    "english_text": "This hadith has been narrated on the authority of Hatim b. Abi Saghira with the same chain of transmitters and there is no mention of the word \"uncircumcised.\"",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ حَاتِمِ،\n بْنِ أَبِي صَغِيرَةَ بِهَذَا الإِسْنَادِ وَلَمْ يَذْكُرْ فِي حَدِيثِهِ ‏\n\"‏ غُرْلاً ‏\"‏ ‏.‏",
    "malay_translation": "Kami telah diberitakan oleh Abu Bakar bin Abi Syaibah dan Ibnu Numair, mereka berkata: “Telah menceritakan kepada kami Abu Khalid al-Ahmar daripada Hatim bin Abi Saghira melalui sanad yang sama.  Dan tidak disebut dalam hadisnya perkataan 'ghurlah'."
  },
  {
    "id": 14298,
    "hadith_number": 7021,
    "tajuk_hadith": "Keadaan Manusia Ketika Berjumpa Allah SWT",
    "perawi_melayu": "Ibn Abbas",
    "english_text": "Ibn Abbas reported that he heard Allah's Messenger (ﷺ) deliver an address and he was saying that they would meet Allah barefooted, naked and uncircumcised.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي،\n عُمَرَ قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ سَعِيدِ،\n بْنِ جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍ، سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَخْطُبُ وَهُوَ يَقُولُ ‏\n\"‏ إِنَّكُمْ مُلاَقُو\n اللَّهِ مُشَاةً حُفَاةً عُرَاةً غُرْلاً ‏\"‏ ‏.‏ وَلَمْ يَذْكُرْ زُهَيْرٌ فِي حَدِيثِهِ يَخْطُبُ ‏.‏",
    "malay_translation": "Ibn Abbas meriwayatkan bahawa beliau mendengar Rasulullah SAW berkhutbah, baginda bersabda:  “Sesungguhnya kamu akan bertemu Allah SWT dengan berjalan kaki, tanpa alas kaki, telanjang dan tidak bersunat.”"
  },
  {
    "id": 14299,
    "hadith_number": 7022,
    "tajuk_hadith": "Keadaan Manusia di Hari Kiamat",
    "perawi_melayu": "Hadis ini diriwayatkan melalui beberapa sanad lain daripada Ibnu Abbas, dan lafaznya adalah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا \n أَبِي كِلاَهُمَا، عَنْ شُعْبَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى\n - قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الْمُغِيرَةِ بْنِ النُّعْمَانِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ،\n عَنِ ابْنِ عَبَّاسٍ، قَالَ قَامَ فِينَا رَسُولُ اللَّهِ صلى الله عليه وسلم خَطِيبًا بِمَوْعِظَةٍ فَقَالَ ‏\"‏\n يَا أَيُّهَا النَّاسُ إِنَّكُمْ تُحْشَرُونَ إِلَى اللَّهِ حُفَاةً عُرَاةً غُرْلاً ‏{‏ كَمَا بَدَأْنَا أَوَّلَ خَلْقٍ نُعِيدُهُ وَعْدًا\n عَلَيْنَا إِنَّا كُنَّا فَاعِلِينَ‏}‏ أَلاَ وَإِنَّ أَوَّلَ الْخَلاَئِقِ يُكْسَى يَوْمَ الْقِيَامَةِ إِبْرَاهِيمُ عَلَيْهِ السَّلاَمُ\n أَلاَ وَإِنَّهُ سَيُجَاءُ بِرِجَالٍ مِنْ أُمَّتِي فَيُؤْخَذُ بِهِمْ ذَاتَ الشِّمَالِ فَأَقُولُ يَا رَبِّ أَصْحَابِي ‏.‏ فَيُقَالُ\n إِنَّكَ لاَ تَدْرِي مَا أَحْدَثُوا بَعْدَكَ ‏.‏ فَأَقُولُ كَمَا قَالَ الْعَبْدُ الصَّالِحُ ‏{‏ وَكُنْتُ عَلَيْهِمْ شَهِيدًا مَا\n دُمْتُ فِيهِمْ فَلَمَّا تَوَفَّيْتَنِي كُنْتَ أَنْتَ الرَّقِيبَ عَلَيْهِمْ وَأَنْتَ عَلَى كُلِّ شَىْءٍ شَهِيدٌ * إِنْ تُعَذِّبْهُمْ\n فَإِنَّهُمْ عِبَادُكَ وَإِنْ تَغْفِرْ لَهُمْ فَإِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ‏}‏ قَالَ فَيُقَالُ لِي إِنَّهُمْ لَمْ يَزَالُوا\n مُرْتَدِّينَ عَلَى أَعْقَابِهِمْ مُنْذُ فَارَقْتَهُمْ ‏\"‏ ‏.‏ وَفِي حَدِيثِ وَكِيعٍ وَمُعَاذٍ ‏\"‏ فَيُقَالُ إِنَّكَ لاَ تَدْرِي\n مَا أَحْدَثُوا بَعْدَكَ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Bakar bin Abi Syaibah telah meriwayatkan daripada Waki’, dan daripada Ubaidullah bin Mu’adz, keduanya daripada Syu’bah.  Muhammad bin Muthanna dan Muhammad bin Bashar juga meriwayatkan – lafaznya daripada Ibnu Muthanna – daripada Muhammad bin Ja’far, daripada Syu’bah, daripada Al-Mughirah bin Nu’man, daripada Sa’id bin Jubair, daripada Ibnu Abbas. Baginda berkata: Rasulullah SAW berdiri menyampaikan khutbah dan bersabda: “Wahai manusia! Sesungguhnya kamu akan dihimpunkan kepada Allah dalam keadaan tanpa alas kaki, telanjang dan tidak bersunat.  (Kemudian Baginda membaca ayat Al-Quran): ‘Seperti Kami menciptakan kamu pada kali pertama, Kami akan mengulangi penciptaan itu.  Itu adalah janji Kami yang pasti.  Sesungguhnya Kami akan melakukannya.’  Ketahuilah bahawa orang yang pertama kali akan dipakaikan pakaian pada hari kiamat ialah Ibrahim a.s.  Ketahuilah bahawa sesungguhnya akan datang sebilangan lelaki daripada umatku, kemudian mereka akan dibawa ke sebelah kiri. Maka aku akan berkata: “Ya Rabb, mereka adalah sahabatku!”  Maka dikatakan: “Sesungguhnya engkau tidak mengetahui apa yang mereka telah lakukan selepas engkau.” Maka aku akan berkata sepertimana hamba yang soleh itu berkata: ‘Dan aku menjadi saksi terhadap mereka selama aku berada di kalangan mereka.  Kemudian setelah Engkau wafatkan aku, Engkaulah yang sentiasa mengawasi mereka.  Dan Engkau Maha Mengetahui akan segala sesuatu.  Sekiranya Engkau mengazab mereka, maka mereka adalah hamba-hamba-Mu, dan sekiranya Engkau mengampuni mereka, maka sesungguhnya Engkau Maha Kuasa lagi Maha Bijaksana.’ Maka dikatakan kepadaku: “Sesungguhnya mereka tetap berpaling ke belakang sejak engkau meninggalkan mereka.” Dalam riwayat Waki’ dan Mu’adz, dikatakan: “Sesungguhnya engkau tidak mengetahui apa yang mereka telah lakukan selepas engkau.”"
  },
  {
    "id": 14300,
    "hadith_number": 7023,
    "tajuk_hadith": "Ketiga Kumpulan Manusia pada Hari Kiamat",
    "perawi_melayu": "Zuhair bin Harb, melalui Ahmad bin Ishaq, dan Muhammad bin Hatim melalui Bahz, semuanya melalui Wahb, melalui Abdullah bin Taous, daripada bapanya, daripada Abu Hurairah, daripada Nabi SAW.",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا أَحْمَدُ بْنُ إِسْحَاقَ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا \n بَهْزٌ، قَالاَ جَمِيعًا حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ \n النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يُحْشَرُ النَّاسُ عَلَى ثَلاَثِ طَرَائِقَ رَاغِبِينَ رَاهِبِينَ وَاثْنَانِ\n عَلَى بَعِيرٍ وَثَلاَثَةٌ عَلَى بَعِيرٍ وَأَرْبَعَةٌ عَلَى بَعِيرٍ وَعَشَرَةٌ عَلَى بَعِيرٍ وَتَحْشُرُ بَقِيَّتَهُمُ النَّارُ\n تَبِيتُ مَعَهُمْ حَيْثُ بَاتُوا وَتَقِيلُ مَعَهُمْ حَيْثُ قَالُوا وَتُصْبِحُ مَعَهُمْ حَيْثُ أَصْبَحُوا وَتُمْسِي مَعَهُمْ\n حَيْثُ أَمْسَوْا ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Zuhair bin Harb, daripada Ahmad bin Ishaq, dan daripada Muhammad bin Hatim, daripada Bahz, semuanya berkata: daripada Wahb, daripada Abdullah bin Taous, daripada bapanya, daripada Abu Hurairah, daripada Nabi SAW, baginda bersabda: \"Manusia akan dikumpulkan kepada tiga kumpulan: yang menginginkan syurga, yang takutkan neraka.  Dua orang berkongsi seekor unta, tiga orang berkongsi seekor unta, empat orang berkongsi seekor unta, dan sepuluh orang berkongsi seekor unta.  Dan selebihnya akan dikumpulkan oleh neraka, yang akan bersama mereka di tempat mereka bermalam, dan bersama mereka di tempat mereka berehat, dan bersama mereka di tempat mereka pagi, dan bersama mereka di tempat mereka petang.\""
  },
  {
    "id": 14301,
    "hadith_number": 7024,
    "tajuk_hadith": "Keadaan Manusia di Hadapan Allah SWT",
    "perawi_melayu": "Ibn Umar meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالُوا حَدَّثَنَا يَحْيَى،\n - يَعْنُونَ ابْنَ سَعِيدٍ - عَنْ عُبَيْدِ اللَّهِ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه\n وسلم ‏{‏ يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ‏}‏ قَالَ ‏\"‏ يَقُومُ أَحَدُهُمْ فِي رَشْحِهِ إِلَى أَنْصَافِ أُذُنَيْهِ\n ‏\"‏ ‏.‏ وَفِي رِوَايَةِ ابْنِ الْمُثَنَّى قَالَ ‏\"‏ يَقُومُ النَّاسُ ‏\"‏ ‏.‏ لَمْ يَذْكُرْ يَوْمَ ‏.‏",
    "malay_translation": "Zuhari bin Harb, Muhammad bin Muthanna, dan Ubaidullah bin Sa'id berkata: Mereka meriwayatkan daripada Yahya (yang dimaksudkan ialah Yahya bin Sa'id) daripada Ubaidullah, daripada Nafi', daripada Ibn Umar, daripada Nabi SAW:  \"Pada hari manusia berdiri di hadapan Tuhan semesta alam,\" baginda bersabda: \"seseorang daripada mereka akan berdiri dalam peluhnya sehingga ke tengah-tengah telinganya.\"  Dalam riwayat Ibn Muthanna, baginda bersabda:  \"Manusia akan berdiri.\"  (Riwayat ini) tidak menyebut tentang hari (kiamat)."
  },
  {
    "id": 14302,
    "hadith_number": 7025,
    "tajuk_hadith": "Peluh Melimpah Ruah",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Ibnu Umar, tetapi dengan sedikit perbezaan lafaz (dan lafaznya ialah):",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ الْمُسَيَّبِيُّ، حَدَّثَنَا أَنَسٌ يَعْنِي ابْنَ عِيَاضٍ، ح وَحَدَّثَنِي \n سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا حَفْصُ بْنُ مَيْسَرَةَ، كِلاَهُمَا عَنْ مُوسَى بْنِ عُقْبَةَ، ح وَحَدَّثَنَا أَبُو بَكْرِ،\n بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، وَعِيسَى بْنُ يُونُسَ، عَنِ ابْنِ عَوْنٍ، ح وَحَدَّثَنِي عَبْدُ،\n اللَّهِ بْنُ جَعْفَرِ بْنِ يَحْيَى حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكٌ، ح وَحَدَّثَنِي أَبُو نَصْرٍ التَّمَّارُ، حَدَّثَنَا حَمَّادُ،\n بْنُ سَلَمَةَ عَنْ أَيُّوبَ، ح وَحَدَّثَنَا الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، عَنْ يَعْقُوبَ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ،\n حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، كُلُّ هَؤُلاَءِ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم\n ‏.‏ بِمَعْنَى حَدِيثِ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ ‏.‏ غَيْرَ أَنَّ فِي حَدِيثِ مُوسَى بْنِ عُقْبَةَ وَصَالِحٍ ‏\n\"‏ حَتَّى\n يَغِيبَ أَحَدُهُمْ فِي رَشْحِهِ إِلَى أَنْصَافِ أُذُنَيْهِ ‏\"‏ ‏.‏",
    "malay_translation": "Sehinggakan salah seorang daripada mereka akan tenggelam sepenuhnya dalam peluhnya sehingga ke separuh telinga."
  },
  {
    "id": 14303,
    "hadith_number": 7026,
    "tajuk_hadith": "Peluh pada Hari Kiamat",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The perspiration would spread on the Day of Resurrection upon the earth to the extent of seventy cubits and it would reach up to their mouths or up to their ears. Thaur is not sure (which words) he used (mouth or ears).",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ مُحَمَّدٍ - عَنْ ثَوْرٍ، عَنْ \n أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الْعَرَقَ يَوْمَ الْقِيَامَةِ\n لَيَذْهَبُ فِي الأَرْضِ سَبْعِينَ بَاعًا وَإِنَّهُ لَيَبْلُغُ إِلَى أَفْوَاهِ النَّاسِ أَوْ إِلَى آذَانِهِمْ ‏\"‏ ‏.‏ يَشُكُّ\n ثَوْرٌ أَيَّهُمَا قَالَ ‏.‏",
    "malay_translation": "Peluh pada hari kiamat akan merebak di bumi sejauh tujuh puluh hasta dan akan sampai ke mulut atau telinga manusia. Thaur tidak pasti perkataan yang digunakan (mulut atau telinga)."
  },
  {
    "id": 14304,
    "hadith_number": 7027,
    "tajuk_hadith": "Kedekatan Matahari pada Hari Kiamat",
    "perawi_melayu": "Miqdad bin Aswad meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى أَبُو صَالِحٍ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ،\n جَابِرٍ حَدَّثَنِي سُلَيْمُ بْنُ عَامِرٍ، حَدَّثَنِي الْمِقْدَادُ بْنُ الأَسْوَدِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله\n عليه وسلم يَقُولُ ‏\"‏ تُدْنَى الشَّمْسُ يَوْمَ الْقِيَامَةِ مِنَ الْخَلْقِ حَتَّى تَكُونَ مِنْهُمْ كَمِقْدَارِ مِيلٍ ‏\"‏\n ‏.‏ قَالَ سُلَيْمُ بْنُ عَامِرٍ فَوَاللَّهِ مَا أَدْرِي مَا يَعْنِي بِالْمِيلِ أَمَسَافَةَ الأَرْضِ أَمِ الْمِيلَ الَّذِي تُكْتَحَلُ\n بِهِ الْعَيْنُ ‏.‏ قَالَ ‏\"‏ فَيَكُونُ النَّاسُ عَلَى قَدْرِ أَعْمَالِهِمْ فِي الْعَرَقِ فَمِنْهُمْ مَنْ يَكُونُ إِلَى كَعْبَيْهِ\n وَمِنْهُمْ مَنْ يَكُونُ إِلَى رُكْبَتَيْهِ وَمِنْهُمْ مَنْ يَكُونُ إِلَى حَقْوَيْهِ وَمِنْهُمْ مَنْ يُلْجِمُهُ الْعَرَقُ إِلْجَامًا\n ‏\"‏ ‏.‏ قَالَ وَأَشَارَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَدِهِ إِلَى فِيهِ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Al-Hakam bin Musa Abu Shalih, telah menceritakan kepada kami Yahya bin Hamzah, dari Abdurrahman bin Jabir. Sulaim bin Amir telah menceritakan kepadaku, Miqdad bin Aswad telah menceritakan kepadaku, katanya: Aku mendengar Rasulullah SAW bersabda: \"Pada hari kiamat, matahari akan didekatkan kepada manusia sehingga jaraknya hanya sejauh satu batu.\" Sulaim bin Amir berkata: Demi Allah, aku tidak tahu apa yang dimaksud dengan batu itu, adakah satu batu perjalanan di bumi atau alat untuk membasuh mata (dengan kollyrium). Baginda bersabda: \"Maka manusia akan berpeluh mengikut amal mereka, ada yang sampai ke buku lali, ada yang sampai ke lutut, ada yang sampai ke pinggang, dan ada yang sampai tercekik peluh.\" Baginda SAW sambil menunjukkan dengan tangan ke arah mulut."
  },
  {
    "id": 14305,
    "hadith_number": 7028,
    "tajuk_hadith": "Perintah Allah dan Ciri-ciri Ahli Syurga dan Neraka",
    "perawi_melayu": "'Iyad bin Himar meriwayatkan bahawa Rasulullah SAW, ketika menyampaikan khutbah suatu hari, telah bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارِ بْنِ عُثْمَانَ، -\n وَاللَّفْظُ لأَبِي غَسَّانَ وَابْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ \n مُطَرِّفِ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ، عَنْ عِيَاضِ بْنِ حِمَارٍ الْمُجَاشِعِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله\n عليه وسلم قَالَ ذَاتَ يَوْمٍ فِي خُطْبَتِهِ ‏\"‏ أَلاَ إِنَّ رَبِّي أَمَرَنِي أَنْ أُعَلِّمَكُمْ مَا جَهِلْتُمْ مِمَّا عَلَّمَنِي\n يَوْمِي هَذَا كُلُّ مَالٍ نَحَلْتُهُ عَبْدًا حَلاَلٌ وَإِنِّي خَلَقْتُ عِبَادِي حُنَفَاءَ كُلَّهُمْ وَإِنَّهُمْ أَتَتْهُمُ الشَّيَاطِينُ\n فَاجْتَالَتْهُمْ عَنْ دِينِهِمْ وَحَرَّمَتْ عَلَيْهِمْ مَا أَحْلَلْتُ لَهُمْ وَأَمَرَتْهُمْ أَنْ يُشْرِكُوا بِي مَا لَمْ أُنْزِلْ\n بِهِ سُلْطَانًا وَإِنَّ اللَّهَ نَظَرَ إِلَى أَهْلِ الأَرْضِ فَمَقَتَهُمْ عَرَبَهُمْ وَعَجَمَهُمْ إِلاَّ بَقَايَا مِنْ أَهْلِ الْكِتَابِ\n وَقَالَ إِنَّمَا بَعَثْتُكَ لأَبْتَلِيَكَ وَأَبْتَلِيَ بِكَ وَأَنْزَلْتُ عَلَيْكَ كِتَابًا لاَ يَغْسِلُهُ الْمَاءُ تَقْرَؤُهُ نَائِمًا وَيَقْظَانَ\n وَإِنَّ اللَّهَ أَمَرَنِي أَنْ أُحَرِّقَ قُرَيْشًا فَقُلْتُ رَبِّ إِذًا يَثْلَغُوا رَأْسِي فَيَدَعُوهُ خُبْزَةً قَالَ اسْتَخْرِجْهُمْ\n كَمَا اسْتَخْرَجُوكَ وَاغْزُهُمْ نُغْزِكَ وَأَنْفِقْ فَسَنُنْفِقَ عَلَيْكَ وَابْعَثْ جَيْشًا نَبْعَثْ خَمْسَةً مِثْلَهُ\n وَقَاتِلْ بِمَنْ أَطَاعَكَ مَنْ عَصَاكَ ‏.‏ قَالَ وَأَهْلُ الْجَنَّةِ ثَلاَثَةٌ ذُو سُلْطَانٍ مُقْسِطٌ مُتَصَدِّقٌ مُوَفَّقٌ\n وَرَجُلٌ رَحِيمٌ رَقِيقُ الْقَلْبِ لِكُلِّ ذِي قُرْبَى وَمُسْلِمٍ وَعَفِيفٌ مُتَعَفِّفٌ ذُو عِيَالٍ - قَالَ - وَأَهْلُ\n النَّارِ خَمْسَةٌ الضَّعِيفُ الَّذِي لاَ زَبْرَ لَهُ الَّذِينَ هُمْ فِيكُمْ تَبَعًا لاَ يَتْبَعُونَ أَهْلاً وَلاَ مَالاً وَالْخَائِنُ\n الَّذِي لاَ يَخْفَى لَهُ طَمَعٌ وَإِنْ دَقَّ إِلاَّ خَانَهُ وَرَجُلٌ لاَ يُصْبِحُ وَلاَ يُمْسِي إِلاَّ وَهُوَ يُخَادِعُكَ عَنْ\n أَهْلِكَ وَمَالِكَ ‏\"‏ ‏.‏ وَذَكَرَ الْبُخْلَ أَوِ الْكَذِبَ ‏\"‏ وَالشِّنْظِيرُ الْفَحَّاشُ ‏\"‏ ‏.‏ وَلَمْ يَذْكُرْ أَبُو غَسَّانَ\n فِي حَدِيثِهِ ‏\"‏ وَأَنْفِقْ فَسَنُنْفِقَ عَلَيْكَ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda pada suatu hari dalam khutbah baginda: “Ketahuilah, sesungguhnya Tuhanku telah memerintahkanku untuk mengajarkan kepada kamu apa yang kamu tidak ketahui daripada apa yang telah Dia ajarkan kepadaku pada hari ini. Setiap harta yang Aku berikan kepada hamba adalah halal. Dan sesungguhnya Aku telah menciptakan hamba-hambaKu dalam keadaan suci, tetapi syaitan-syaitan datang kepada mereka lalu menyesatkan mereka daripada agama mereka, dan mengharamkan ke atas mereka apa yang telah Aku halalkan bagi mereka, dan menyuruh mereka supaya menyekutukan-Ku dengan sesuatu yang Aku tidak menurunkan sebarang bukti mengenainya. Dan sesungguhnya Allah SWT melihat kepada penduduk bumi, lalu Dia membenci mereka, baik orang Arab mahupun bukan Arab, kecuali segelintir daripada Ahli Kitab. Dan baginda (Rasulullah SAW) bersabda lagi: “Sesungguhnya Aku telah mengutusmu (wahai Muhammad) untuk menguji engkau dan untuk menguji dengan engkau. Dan Aku telah menurunkan ke atasmu sebuah kitab yang tidak akan dihapuskan oleh air, supaya engkau membacanya dalam keadaan tidur mahupun jaga. Dan sesungguhnya Allah SWT telah memerintahkanku untuk membinasakan Quraisy. Maka aku berkata: Ya Tuhanku, sekiranya begitu nescaya mereka akan menghancurkan kepalaku (seperti roti). Allah SWT berfirman: Usirlah mereka sebagaimana mereka mengusirmu, dan berperanglah dengan mereka sebagaimana mereka berperang denganmu, dan belanjakanlah harta, nescaya Aku akan memberikan kepadamu rezeki. Hantarlah satu pasukan tentera, maka Aku akan menghantar lima kali ganda pasukan tentera tersebut. Perangi mereka yang mendurhakaimu dengan mereka yang mentaatimu.” Baginda SAW juga bersabda: “Ahli syurga itu ada tiga orang: seorang pemerintah yang adil dan dermawan, seorang yang penyayang dan lemah lembut terhadap kaum kerabat dan setiap orang Islam yang bertakwa, serta seorang yang tidak meminta-minta walau pun mempunyai keluarga yang ramai.” Dan baginda SAW bersabda: “Ahli neraka itu ada lima orang: orang yang lemah yang tidak mampu (menghindari kejahatan), mereka yang tidak menghiraukan keluarga dan harta mereka, dan orang yang khianat yang tamaknya tidak akan hilang walaupun sedikit, dan seseorang yang tidak akan meninggalkan amalan menipu engkau pagi dan petang mengenai keluarga dan hartamu.” Baginda SAW juga menyebut mengenai orang yang bakhil, pendusta, dan orang yang suka mencela dan berkata-kata kotor.  Abu Ghassan dalam riwayatnya tidak menyebut “Dan belanjakanlah harta, nescaya Aku akan memberikan kepadamu rezeki.”"
  },
  {
    "id": 14306,
    "hadith_number": 7029,
    "tajuk_hadith": "Perbezaan Ringkas Perawi Hadis",
    "perawi_melayu": "Muhammad bin al-Muthanna al-'Anzi",
    "english_text": "This hadith has been narrated on the authority of Qatada with the same chain of transmitters but with a slight variation of wording.",
    "arabic_text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عَدِيٍّ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ،\n بِهَذَا الإِسْنَادِ ‏.‏ وَلَمْ يَذْكُرْ فِي حَدِيثِهِ ‏\n\"‏ كُلُّ مَالٍ نَحَلْتُهُ عَبْدًا حَلاَلٌ ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Qatadah melalui sanad yang sama, tetapi dengan sedikit perbezaan lafaz."
  },
  {
    "id": 14307,
    "hadith_number": 7030,
    "tajuk_hadith": "Khutbah Rasulullah SAW",
    "perawi_melayu": "Iyad bin Himar",
    "english_text": "This hadith has been transmitted on the authority of 'Iyad b. Himar that Allah's Messenger (ﷺ) gave an address one day. The rest of the hadith is the same.",
    "arabic_text": "حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ الْعَبْدِيُّ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ هِشَامٍ، - صَاحِبِ\n الدَّسْتَوَائِيِّ - حَدَّثَنَا قَتَادَةُ، عَنْ مُطَرِّفٍ، عَنْ عِيَاضِ بْنِ حِمَارٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه\n وسلم خَطَبَ ذَاتَ يَوْمٍ ‏.‏ وَسَاقَ الْحَدِيثَ وَقَالَ فِي آخِرِهِ قَالَ يَحْيَى قَالَ شُعْبَةُ عَنْ قَتَادَةَ\n قَالَ سَمِعْتُ مُطَرِّفًا فِي هَذَا الْحَدِيثِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Iyad bin Himar bahawa Rasulullah SAW telah menyampaikan khutbah pada suatu hari.  Baki hadis adalah sama."
  },
  {
    "id": 14308,
    "hadith_number": 7031,
    "tajuk_hadith": "Kerendahan Hati dan Amaran Terhadap Kejahatan",
    "perawi_melayu": "Iyad bin Himar meriwayatkan bahawa, ketika Rasulullah SAW menyampaikan khutbah, baginda menyatakan bahawa Allah SWT memerintahkan baginda...",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي أَبُو عَمَّارٍ، حُسَيْنُ بْنُ حُرَيْثٍ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، عَنِ الْحُسَيْنِ، عَنْ \n مَطَرٍ، حَدَّثَنِي قَتَادَةُ، عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ، عَنْ عِيَاضِ بْنِ حِمَارٍ، أَخِي بَنِي\n مُجَاشِعٍ قَالَ قَامَ فِينَا رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ خَطِيبًا فَقَالَ ‏\"‏ إِنَّ اللَّهَ\n أَمَرَنِي ‏\"‏ ‏.‏ وَسَاقَ الْحَدِيثَ بِمِثْلِ حَدِيثِ هِشَامٍ عَنْ قَتَادَةَ وَزَادَ فِيهِ ‏\"‏ وَإِنَّ اللَّهَ أَوْحَى إِلَىَّ\n أَنْ تَوَاضَعُوا حَتَّى لاَ يَفْخَرَ أَحَدٌ عَلَى أَحَدٍ وَلاَ يَبْغِي أَحَدٌ عَلَى أَحَدٍ ‏\"‏ ‏.‏ وَقَالَ فِي حَدِيثِهِ\n ‏\"‏ وَهُمْ فِيكُمْ تَبَعًا لاَ يَبْغُونَ أَهْلاً وَلاَ مَالاً ‏\"‏ ‏.‏ فَقُلْتُ فَيَكُونُ ذَلِكَ يَا أَبَا عَبْدِ اللَّهِ قَالَ نَعَمْ  وَاللَّهِ لَقَدْ أَدْرَكْتُهُمْ فِي الْجَاهِلِيَّةِ وَإِنَّ الرَّجُلَ لَيَرْعَى عَلَى الْحَىِّ مَا بِهِ إِلاَّ وَلِيدَتُهُمْ يَطَؤُهَا  ‏.‏",
    "malay_translation": "Abu 'Ammar, Hussein bin Huraits telah meriwayatkan daripada al-Fazl bin Musa, daripada Hussein, daripada Matar, aku telah mendengar daripada Qatadah, daripada Mutharrif bin Abdullah bin Syakhir, daripada Iyad bin Himar, saudara Bani Mujasiah berkata: Rasulullah SAW suatu hari berdiri di hadapan kami menyampaikan khutbah, baginda bersabda: “Sesungguhnya Allah SWT telah memerintahkan aku...”  Kemudian baginda meneruskan hadis itu seperti hadis Hisyam daripada Qatadah dan menambahkan di dalamnya: “Dan sesungguhnya Allah SWT telah mewahyukan kepadaku supaya kamu semua merendah diri, supaya tiada seorang pun membanggakan diri ke atas orang lain, dan supaya tiada seorang pun menindas orang lain.” Dan baginda juga bersabda di dalam hadisnya: “Dan di antara kamu ada golongan yang mengikut (kejahatan) tanpa mempedulikan keluarga dan harta benda.” Maka aku bertanya: “Adakah keadaan sedemikian akan berlaku, wahai Abu Abdullah?” Baginda menjawab: “Ya, demi Allah, aku telah menyaksikannya pada zaman jahiliyyah. Sesungguhnya seorang lelaki itu menjaga haiwan ternakan, sedangkan di situ hanya terdapat hamba perempuan mereka, lalu dia melakukan zina dengannya.”"
  },
  {
    "id": 14309,
    "hadith_number": 7032,
    "tajuk_hadith": "Tempat Duduk di Akhirat",
    "perawi_melayu": "Ibn Umar meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "When any one of you dies, he is shown his seat (in the Hereafter) morning and evening; if he is amongst the inmates of Paradise (he is shown the seat) from amongst the inmates of Paradise and if he is one from amongst the denizens of Hell (he is shown the seat) from amongst the denizens of Hell, and it would be said to him: That is your seat until Allah raises you on the Day of Resurrection (and sends you to your proper seat).",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ\n اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ أَحَدَكُمْ إِذَا مَاتَ عُرِضَ عَلَيْهِ مَقْعَدُهُ بِالْغَدَاةِ وَالْعَشِيِّ\n إِنْ كَانَ مِنْ أَهْلِ الْجَنَّةِ فَمِنْ أَهْلِ الْجَنَّةِ وَإِنْ كَانَ مِنْ أَهْلِ النَّارِ فَمِنْ أَهْلِ النَّارِ يُقَالُ هَذَا\n مَقْعَدُكَ حَتَّى يَبْعَثَكَ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Sesungguhnya apabila seseorang di antara kamu mati, maka akan ditunjukkan kepadanya tempat duduknya pada waktu pagi dan petang. Jika dia daripada golongan ahli syurga, maka akan ditunjukkan kepadanya tempat duduk daripada kalangan ahli syurga. Dan jika dia daripada golongan ahli neraka, maka akan ditunjukkan kepadanya tempat duduk daripada kalangan ahli neraka.  Lalu dikatakan kepadanya: “Inilah tempat dudukmu sehingga Allah membangkitkanmu pada hari kiamat.”"
  },
  {
    "id": 14310,
    "hadith_number": 7033,
    "tajuk_hadith": "Tempat Duduk di Akhirat",
    "perawi_melayu": "Ibnu Umar meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "When a person dies, he is shown his seat morning and evening. If he is one amongst the inmates of Paradise (he is shown his seat) in Paradise and if he is one amongst the denizens of Hell-Fire (he is shown his seat) in the Hell-Fire. Then it is said to him: That is your seat where you would be sent on the Day of Resurrection.",
    "arabic_text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ،\n عَنِ ابْنِ عُمَرَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِذَا مَاتَ الرَّجُلُ عُرِضَ عَلَيْهِ مَقْعَدُهُ\n بِالْغَدَاةِ وَالْعَشِيِّ إِنْ كَانَ مِنْ أَهْلِ الْجَنَّةِ فَالْجَنَّةُ وَإِنْ كَانَ مِنْ أَهْلِ النَّارِ فَالنَّارُ ‏\"‏ ‏.‏ قَالَ\n ‏\"‏ ثُمَّ يُقَالُ هَذَا مَقْعَدُكَ الَّذِي تُبْعَثُ إِلَيْهِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila seseorang itu mati, dia akan ditunjukkan tempat duduknya pada waktu pagi dan petang. Jika dia daripada kalangan ahli syurga, maka dia akan ditunjukkan tempat duduknya di syurga. Dan jika dia daripada kalangan ahli neraka, maka dia akan ditunjukkan tempat duduknya di neraka. Kemudian dikatakan kepadanya: \"Inilah tempat dudukmu yang akan kau tempati pada hari kiamat.\""
  },
  {
    "id": 14311,
    "hadith_number": 7034,
    "tajuk_hadith": "Peringatan akan Azab Kubur dan Doa Mencari Perlindungan daripada Allah",
    "perawi_melayu": "Abu Said al-Khudri meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ جَمِيعًا عَنِ ابْنِ عُلَيَّةَ، قَالَ ابْنُ\n أَيُّوبَ حَدَّثَنَا ابْنُ عُلَيَّةَ، قَالَ وَأَخْبَرَنَا سَعِيدٌ الْجُرَيْرِيُّ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،\n عَنْ زَيْدِ بْنِ ثَابِتٍ، قَالَ أَبُو سَعِيدٍ وَلَمْ أَشْهَدْهُ مِنَ النَّبِيِّ صلى الله عليه وسلم وَلَكِنْ حَدَّثَنِيهِ\n زَيْدُ بْنُ ثَابِتٍ قَالَ بَيْنَمَا النَّبِيُّ صلى الله عليه وسلم فِي حَائِطٍ لِبَنِي النَّجَّارِ عَلَى بَغْلَةٍ لَهُ\n وَنَحْنُ مَعَهُ إِذْ حَادَتْ بِهِ فَكَادَتْ تُلْقِيهِ وَإِذَا أَقْبُرٌ سِتَّةٌ أَوْ خَمْسَةٌ أَوْ أَرْبَعَةٌ - قَالَ كَذَا كَانَ\n يَقُولُ الْجُرَيْرِيُّ - فَقَالَ ‏\"‏ مَنْ يَعْرِفُ أَصْحَابَ هَذِهِ الأَقْبُرِ ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ أَنَا ‏.‏ قَالَ ‏\"‏\n فَمَتَى مَاتَ هَؤُلاَءِ ‏\"‏ ‏.‏ قَالَ مَاتُوا فِي الإِشْرَاكِ ‏.‏ فَقَالَ ‏\"‏ إِنَّ هَذِهِ الأُمَّةَ تُبْتَلَى فِي قُبُورِهَا\n فَلَوْلاَ أَنْ لاَ تَدَافَنُوا لَدَعَوْتُ اللَّهَ أَنْ يُسْمِعَكُمْ مِنْ عَذَابِ الْقَبْرِ الَّذِي أَسْمَعُ مِنْهُ ‏\"‏ ‏.‏ ثُمَّ أَقْبَلَ\n عَلَيْنَا بِوَجْهِهِ فَقَالَ ‏\"‏ تَعَوَّذُوا بِاللَّهِ مِنْ عَذَابِ النَّارِ ‏\"‏ ‏.‏ قَالُوا نَعُوذُ بِاللَّهِ مِنْ عَذَابِ النَّارِ\n فَقَالَ ‏\"‏ تَعَوَّذُوا بِاللَّهِ مِنْ عَذَابِ الْقَبْرِ ‏\"‏ ‏.‏ قَالُوا نَعُوذُ بِاللَّهِ مِنْ عَذَابِ الْقَبْرِ ‏.‏ قَالَ ‏\"‏ تَعَوَّذُوا\n بِاللَّهِ مِنَ الْفِتَنِ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ ‏\"‏ ‏.‏ قَالُوا نَعُوذُ بِاللَّهِ مِنَ الْفِتَنِ مَا ظَهَرَ مِنْهَا وَمَا\n بَطَنَ قَالَ ‏\"‏ تَعَوَّذُوا بِاللَّهِ مِنْ فِتْنَةِ الدَّجَّالِ ‏\"‏ ‏.‏ قَالُوا نَعُوذُ بِاللَّهِ مِنْ فِتْنَةِ الدَّجَّالِ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Yahya bin Ayub dan Abu Bakar bin Abi Syaibah, keduanya dari Ibnu ‘Ulayyah. Ibnu Ayub berkata, telah menceritakan kepada kami Ibnu ‘Ulayyah. Dia berkata, dan telah memberitakan kepada kami Sa’id al-Jurairi, dari Abu Nadhrah, dari Abu Sa’id al-Khudri, dari Zaid bin Tsabit. Abu Sa’id berkata, aku tidak menyaksikan hal ini dari Nabi SAW, tetapi Zaid bin Tsabit yang menceritakannya kepadaku.  Dia berkata, ketika Nabi SAW berada di kebun Bani Najjar menaiki bagal beliau, dan kami bersama beliau, tiba-tiba bagal itu tersandung dan hampir saja menjatuhkan beliau. Lalu nampaklah beberapa kuburan, enam atau lima atau empat – demikianlah yang dikatakan al-Jurairi. Beliau bersabda, “Siapakah yang mengenali penghuni kuburan ini?” Seorang lelaki berkata, “Saya.” Beliau bersabda, “Bagaimana mereka meninggal dunia?” Lelaki itu menjawab, “Mereka meninggal dalam keadaan musyrik.” Beliau bersabda, “Sesungguhnya umat ini akan diuji di kuburnya. Sekiranya bukan kerana kamu akan berhenti menguburkan jenazahmu sekiranya mendengar azab kubur yang aku dengar, nescaya aku akan membiarkan kamu mendengarnya.” Kemudian Baginda menghadap kami dan bersabda, “Mohonlah perlindungan kepada Allah daripada azab neraka.” Mereka menjawab, “Kami memohon perlindungan kepada Allah daripada azab neraka.” Beliau bersabda, “Mohonlah perlindungan kepada Allah daripada azab kubur.” Mereka menjawab, “Kami memohon perlindungan kepada Allah daripada azab kubur.” Beliau bersabda, “Mohonlah perlindungan kepada Allah daripada fitnah, baik yang nampak mahupun yang tersembunyi.” Mereka menjawab, “Kami memohon perlindungan kepada Allah daripada fitnah, baik yang nampak mahupun yang tersembunyi.” Beliau bersabda, “Mohonlah perlindungan kepada Allah daripada fitnah Dajjal.” Mereka menjawab, “Kami memohon perlindungan kepada Allah daripada fitnah Dajjal.”"
  },
  {
    "id": 14312,
    "hadith_number": 7035,
    "tajuk_hadith": "Doa Nabi SAW untuk Pendengaran Azab Kubur",
    "perawi_melayu": "Anas meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "If you were not (to abandon) the burying of the dead (in the grave), I would have certainly supplicated Allah that He should make you listen the torment of the grave.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ \n قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَوْلاَ أَنْ لاَ تَدَافَنُوا لَدَعَوْتُ اللَّهَ أَنْ\n يُسْمِعَكُمْ مِنْ عَذَابِ الْقَبْرِ ‏\"‏ ‏.‏",
    "malay_translation": "Sekiranya kamu tidak saling membantu dalam pengebumian jenazah, nescaya aku akan memohon kepada Allah supaya kamu mendengar azab kubur."
  },
  {
    "id": 14313,
    "hadith_number": 7036,
    "tajuk_hadith": "Azab Yahudi di dalam Kubur",
    "perawi_melayu": "Hadis ini diriwayatkan melalui beberapa sanad daripada Abu Ayyub (dan lafaznya):",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا \n أَبِي ح، وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، كُلُّهُمْ عَنْ شُعْبَةَ،\n عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ جَمِيعًا\n عَنْ يَحْيَى الْقَطَّانِ، - وَاللَّفْظُ لِزُهَيْرٍ - حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنِي عَوْنُ،\n بْنُ أَبِي جُحَيْفَةَ عَنْ أَبِيهِ، عَنِ الْبَرَاءِ، عَنْ أَبِي أَيُّوبَ، قَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم بَعْدَ مَا غَرَبَتِ الشَّمْسُ فَسَمِعَ صَوْتًا فَقَالَ ‏\n\"‏ يَهُودُ تُعَذَّبُ فِي قُبُورِهَا ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Bakar bin Abi Syaibah, telah menceritakan kepada kami Waki', dan telah menceritakan kepada kami Ubaidullah bin Mu'adz, telah menceritakan kepada kami Abi, dan telah menceritakan kepada kami Muhammad bin Muthanna dan Ibnu Bashshar, keduanya berkata: Telah menceritakan kepada kami Muhammad bin Ja'far, semuanya daripada Syu'bah, daripada Aun bin Abi Juhaifah, dan telah menceritakan kepadaku Zuhri bin Harb, Muhammad bin Muthanna dan Ibnu Bashshar, semuanya daripada Yahya al-Qattan - dan lafaznya daripada Zuhri - telah menceritakan kepada kami Yahya bin Sa'id, telah menceritakan kepada kami Syu'bah, telah menceritakan kepadaku Aun bin Abi Juhaifah daripada bapanya, daripada al-Bara', daripada Abu Ayyub, katanya: Rasulullah ﷺ keluar selepas matahari terbenam, lalu baginda mendengar satu suara, maka baginda bersabda: \"Yahudi diseksa di dalam kubur mereka.\""
  },
  {
    "id": 14314,
    "hadith_number": 7037,
    "tajuk_hadith": "Keadaan Jenazah Muslim di Dalam Kubur",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا شَيْبَانُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ \n قَتَادَةَ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، قَالَ قَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ الْعَبْدَ إِذَا وُضِعَ\n فِي قَبْرِهِ وَتَوَلَّى عَنْهُ أَصْحَابُهُ إِنَّهُ لَيَسْمَعُ قَرْعَ نِعَالِهِمْ ‏\"‏ ‏.‏ قَالَ ‏\"‏ يَأْتِيهِ مَلَكَانِ فَيُقْعِدَانِهِ\n فَيَقُولاَنِ لَهُ مَا كُنْتَ تَقُولُ فِي هَذَا الرَّجُلِ ‏\"‏ ‏.‏ قَالَ ‏\"‏ فَأَمَّا الْمُؤْمِنُ فَيَقُولُ أَشْهَدُ أَنَّهُ عَبْدُ\n اللَّهِ وَرَسُولُهُ ‏\"‏ ‏.‏ قَالَ ‏\"‏ فَيُقَالُ لَهُ انْظُرْ إِلَى مَقْعَدِكَ مِنَ النَّارِ قَدْ أَبْدَلَكَ اللَّهُ بِهِ مَقْعَدًا مِنَ\n الْجَنَّةِ ‏\"‏ ‏.‏ قَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَيَرَاهُمَا جَمِيعًا ‏\"‏ ‏.‏ قَالَ قَتَادَةُ وَذُكِرَ\n لَنَا أَنَّهُ يُفْسَحُ لَهُ فِي قَبْرِهِ سَبْعُونَ ذِرَاعًا وَيُمْلأُ عَلَيْهِ خَضِرًا إِلَى يَوْمِ يُبْعَثُونَ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abd bin Humaid, telah menceritakan kepada kami Yunus bin Muhammad, telah menceritakan kepada kami Syiban bin Abdur Rahman, dari Qatadah, telah menceritakan kepada kami Anas bin Malik, dia berkata; Rasulullah SAW bersabda: \"Sesungguhnya apabila seorang hamba diletakkan di dalam kuburnya dan para sahabatnya telah meninggalkannya, maka sesungguhnya dia masih dapat mendengar bunyi tapak kaki mereka.\" Baginda SAW bersabda lagi: \"Kemudian datanglah dua malaikat, lalu mereka mendudukkannya dan bertanya kepadanya: Apakah yang engkau katakan tentang orang ini (Nabi Muhammad)?\"  Maka orang yang beriman akan berkata: \"Aku bersaksi bahawa baginda adalah hamba Allah dan Rasul-Nya.\" Lalu dikatakan kepadanya: \"Lihatlah tempat dudukmu di neraka, sesungguhnya Allah telah menggantikannya dengan tempat duduk di syurga.\" Rasulullah SAW bersabda: \"Maka dia akan melihat kedua-dua tempat itu.\" Qatadah berkata:  Dan telah disebut kepada kami bahawa kubur orang beriman itu akan dilebarkan sehingga tujuh puluh hasta dan dipenuhi dengan tanaman hijau sehingga hari mereka dibangkitkan."
  },
  {
    "id": 14315,
    "hadith_number": 7038,
    "tajuk_hadith": "Mayat Mendengar Bunyi Tapak Kaki",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "When the dead body is placed in the grave, he listens to the sound of the shoes (as his friends and relatives return after burying him).",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ مِنْهَالٍ الضَّرِيرُ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ،\n عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ الْمَيِّتَ إِذَا\n وُضِعَ فِي قَبْرِهِ إِنَّهُ لَيَسْمَعُ خَفْقَ نِعَالِهِمْ إِذَا انْصَرَفُوا ‏\"‏ ‏.‏",
    "malay_translation": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda:  \"Sesungguhnya, apabila jenazah diletakkan di dalam kuburnya, nescaya ia mendengar bunyi tapak kaki mereka apabila mereka berpaling pergi.\""
  },
  {
    "id": 14316,
    "hadith_number": 7039,
    "tajuk_hadith": "Apa yang berlaku kepada seorang hamba setelah dikebumikan",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "When the servant is placed in his grave and his friends retrace their steps. The rest of the hadith is the same as transmitted by Qatada.",
    "arabic_text": "حَدَّثَنِي عَمْرُو بْنُ زُرَارَةَ، أَخْبَرَنَا عَبْدُ الْوَهَّابِ، - يَعْنِي ابْنَ عَطَاءٍ - عَنْ سَعِيدٍ،\n عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الْعَبْدَ إِذَا وُضِعَ\n فِي قَبْرِهِ وَتَوَلَّى عَنْهُ أَصْحَابُهُ ‏\"‏ ‏.‏ فَذَكَرَ بِمِثْلِ حَدِيثِ شَيْبَانَ عَنْ قَتَادَةَ ‏.‏",
    "malay_translation": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda:  \"Sesungguhnya apabila seorang hamba diletakkan di dalam kuburnya dan rakan-rakannya telah meninggalkannya,\"  (Kemudian hadis ini meneruskan sepertimana riwayat daripada Qatadah)."
  },
  {
    "id": 14317,
    "hadith_number": 7040,
    "tajuk_hadith": "Keteguhan Iman di Alam Kubur",
    "perawi_melayu": "Al-Bara' bin Azib meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارِ بْنِ عُثْمَانَ الْعَبْدِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ،\n عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، عَنِ النَّبِيِّ صلى الله عليه\n وسلم قَالَ ‏\"‏ ‏{‏ يُثَبِّتُ اللَّهُ الَّذِينَ آمَنُوا بِالْقَوْلِ الثَّابِتِ‏}‏ قَالَ ‏\"‏ نَزَلَتْ فِي عَذَابِ الْقَبْرِ فَيُقَالُ\n لَهُ مَنْ رَبُّكَ فَيَقُولُ رَبِّيَ اللَّهُ وَنَبِيِّيَ مُحَمَّدٌ صلى الله عليه وسلم ‏.‏ فَذَلِكَ قَوْلُهُ عَزَّ وَجَلَّ ‏{‏\n يُثَبِّتُ اللَّهُ الَّذِينَ آمَنُوا بِالْقَوْلِ الثَّابِتِ فِي الْحَيَاةِ الدُّنْيَا وَفِي الآخِرَةِ‏}‏ ‏\"‏ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan oleh Muhammad bin Bashar bin Usman al-Abdi daripada Muhammad bin Ja'far, daripada Syu'bah, daripada Alqamah bin Marthad, daripada Saad bin Ubaidah, daripada Al-Bara' bin Azib, daripada Nabi SAW yang bersabda:  \"Allah meneguhkan orang-orang yang beriman dengan ucapan yang teguh.\"  Baginda SAW bersabda lagi:  \"Ayat ini diturunkan berkaitan dengan azab kubur.  Maka akan ditanya kepadanya: \"Siapakah Tuhanmu?\"  Lalu dia akan menjawab: \"Tuhanku ialah Allah, dan Nabiku ialah Muhammad SAW.\"  Inilah maksud firman Allah SWT: \"Allah meneguhkan orang-orang yang beriman dengan ucapan yang teguh di dunia dan di akhirat.\""
  },
  {
    "id": 14318,
    "hadith_number": 7041,
    "tajuk_hadith": "Allah Memperkukuhkan Orang Beriman",
    "perawi_melayu": "Al-Bara' b. 'Azib meriwayatkan bahawa ayat ini:",
    "english_text": "\"Allah keeps those who believe steadfast with firm word in this world and the Hereafter\" was revealed in connection with the torment of the grave.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَأَبُو بَكْرِ بْنُ نَافِعٍ قَالُوا حَدَّثَنَا \n عَبْدُ الرَّحْمَنِ، - يَعْنُونَ ابْنَ مَهْدِيٍّ - عَنْ سُفْيَانَ، عَنْ أَبِيهِ، عَنْ خَيْثَمَةَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ،\n ‏{‏ يُثَبِّتُ اللَّهُ الَّذِينَ آمَنُوا بِالْقَوْلِ الثَّابِتِ فِي الْحَيَاةِ الدُّنْيَا وَفِي الآخِرَةِ‏}‏ قَالَ نَزَلَتْ فِي\n عَذَابِ الْقَبْرِ ‏.‏",
    "malay_translation": "Al-Bara' bin Azib meriwayatkan:  Ayat  \"Allah SWT akan meneguhkan orang-orang yang beriman dengan ucapan yang teguh di dunia dan di akhirat.\"  diturunkan berkaitan dengan azab kubur."
  },
  {
    "id": 14319,
    "hadith_number": 7042,
    "tajuk_hadith": "Kematian Orang Mukmin dan Kafir",
    "perawi_melayu": "Abu Hurairah meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا بُدَيْلٌ، عَنْ عَبْدِ،\n اللَّهِ بْنِ شَقِيقٍ عَنْ أَبِي هُرَيْرَةَ، قَالَ ‏\"‏ إِذَا خَرَجَتْ رُوحُ الْمُؤْمِنِ تَلَقَّاهَا مَلَكَانِ يُصْعِدَانِهَا\n ‏\"‏ ‏.‏ قَالَ حَمَّادٌ فَذَكَرَ مِنْ طِيبِ رِيحِهَا وَذَكَرَ الْمِسْكَ ‏.‏ قَالَ ‏\"‏ وَيَقُولُ أَهْلُ السَّمَاءِ رُوحٌ\n طَيِّبَةٌ جَاءَتْ مِنْ قِبَلِ الأَرْضِ صَلَّى اللَّهُ عَلَيْكِ وَعَلَى جَسَدٍ كُنْتِ تَعْمُرِينَهُ ‏.‏ فَيُنْطَلَقُ بِهِ إِلَى\n رَبِّهِ عَزَّ وَجَلَّ ثُمَّ يَقُولُ انْطَلِقُوا بِهِ إِلَى آخِرِ الأَجَلِ ‏\"‏ ‏.‏ قَالَ ‏\"‏ وَإِنَّ الْكَافِرَ إِذَا خَرَجَتْ رُوحُهُ\n - قَالَ حَمَّادٌ وَذَكَرَ مِنْ نَتْنِهَا وَذَكَرَ لَعْنًا - وَيَقُولُ أَهْلُ السَّمَاءِ رُوحٌ خَبِيثَةٌ جَاءَتْ مِنْ\n قِبَلِ الأَرْضِ ‏.‏ قَالَ فَيُقَالُ انْطَلِقُوا بِهِ إِلَى آخِرِ الأَجَلِ ‏\"‏ ‏.‏ قَالَ أَبُو هُرَيْرَةَ فَرَدَّ رَسُولُ اللَّهِ\n صلى الله عليه وسلم رَيْطَةً كَانَتْ عَلَيْهِ عَلَى أَنْفِهِ هَكَذَا ‏.‏",
    "malay_translation": "Abu Hurairah meriwayatkan: “Apabila roh orang mukmin keluar (dari badannya), ia akan disambut oleh dua malaikat yang akan mengangkatnya ke langit.” Hammad menyebut tentang haruman yang wangi, dan berkata, “Dan penduduk langit berkata: ‘Roh yang suci telah datang dari bumi. Semoga Allah merahmati kamu dan jasad yang pernah kamu diami.’ Kemudian roh itu dibawa kepada Tuhannya, Yang Maha Agung dan Maha Mulia.  Kemudian dikatakan: ‘Bawalah ia ke destinasi akhirnya.’  Dan jika ia seorang kafir, apabila rohnya keluar – Hammad menyebut tentang bau busuknya dan laknat – penduduk langit berkata: ‘Roh yang jahat telah datang dari bumi.’ Kemudian dikatakan: ‘Bawalah ia ke destinasi akhirnya.’ Abu Hurairah berkata bahawa Rasulullah SAW memegang kain yang ada padanya ke hidung baginda ketika menyebut (bau busuk) roh orang kafir.”"
  },
  {
    "id": 14320,
    "hadith_number": 7043,
    "tajuk_hadith": "Penglihatan Hilal dan Kisah Rasulullah SAW dengan Ahli Badar",
    "perawi_melayu": "Anas bin Malik meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي إِسْحَاقُ بْنُ عُمَرَ بْنِ سَلِيطٍ الْهُذَلِيُّ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ ثَابِتٍ،\n قَالَ قَالَ أَنَسٌ كُنْتُ مَعَ عُمَرَ ح \n وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ ثَابِتٍ،\n عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كُنَّا مَعَ عُمَرَ بَيْنَ مَكَّةَ وَالْمَدِينَةِ فَتَرَاءَيْنَا الْهِلاَلَ وَكُنْتُ رَجُلاً حَدِيدَ\n الْبَصَرِ فَرَأَيْتُهُ وَلَيْسَ أَحَدٌ يَزْعُمُ أَنَّهُ رَآهُ غَيْرِي - قَالَ - فَجَعَلْتُ أَقُولُ لِعُمَرَ أَمَا تَرَاهُ\n فَجَعَلَ لاَ يَرَاهُ - قَالَ - يَقُولُ عُمَرُ سَأَرَاهُ وَأَنَا مُسْتَلْقٍ عَلَى فِرَاشِي ‏.‏ ثُمَّ أَنْشَأَ يُحَدِّثُنَا\n عَنْ أَهْلِ بَدْرٍ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُرِينَا مَصَارِعَ أَهْلِ بَدْرِ بِالأَمْسِ\n يَقُولُ ‏\"‏ هَذَا مَصْرَعُ فُلاَنٍ غَدًا إِنْ شَاءَ اللَّهُ ‏\"‏ ‏.‏ قَالَ فَقَالَ عُمَرُ فَوَالَّذِي بَعَثَهُ بِالْحَقِّ مَا\n أَخْطَئُوا الْحُدُودَ الَّتِي حَدَّ رَسُولُ اللَّهِ صلى الله عليه وسلم - قَالَ - فَجُعِلُوا فِي بِئْرٍ بَعْضُهُمْ\n عَلَى بَعْضٍ فَانْطَلَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى انْتَهَى إِلَيْهِمْ فَقَالَ ‏\"‏ يَا فُلاَنَ\n بْنَ فُلاَنٍ وَيَا فُلاَنَ بْنَ فُلاَنٍ هَلْ وَجَدْتُمْ مَا وَعَدَكُمُ اللَّهُ وَرَسُولُهُ حَقًّا فَإِنِّي قَدْ وَجَدْتُ مَا\n وَعَدَنِيَ اللَّهُ حَقًّا ‏\"‏ ‏.‏ قَالَ عُمَرُ يَا رَسُولَ اللَّهِ كَيْفَ تُكَلِّمُ أَجْسَادًا لاَ أَرْوَاحَ فِيهَا قَالَ ‏\"‏\n مَا أَنْتُمْ بِأَسْمَعَ لِمَا أَقُولُ مِنْهُمْ غَيْرَ أَنَّهُمْ لاَ يَسْتَطِيعُونَ أَنْ يَرُدُّوا عَلَىَّ شَيْئًا ‏\"‏ ‏.‏",
    "malay_translation": "Aku bersama Umar di antara Mekah dan Madinah, ketika kami mencari hilal. Aku seorang yang tajam penglihatannya, maka aku melihatnya, tetapi tiada seorang pun selain aku yang melihatnya. Aku berkata kepada Umar: “Tidakkah engkau melihatnya?” Tetapi dia tidak melihatnya.  Maka Umar berkata: “Aku akan melihatnya nanti (apabila ia lebih terang).” Aku berbaring di atas katil. Kemudian dia menceritakan kepada kami tentang penduduk Badar dan berkata: “Rasulullah SAW telah menunjukkan kepada kami sehari sebelum (pertempuran sebenar) tempat kematian penduduk (yang menyertai) peperangan Badar dan baginda bersabda: ‘Inilah tempat kematian si fulan esok, jika Allah SWT berkehendak.’ Maka Umar berkata: ‘Demi Allah SWT yang mengutus baginda dengan kebenaran, mereka tidak meleset dari tempat-tempat (kematian) yang ditunjukkan oleh Rasulullah SAW.’ Kemudian mereka semua diletakkan di dalam sebuah perigi, seorang demi seorang. Lalu Rasulullah SAW pergi kepada mereka dan bersabda: ‘Wahai si fulan bin si fulan, dan wahai si fulan bin si fulan, adakah kamu dapati apa yang dijanjikan oleh Allah SWT dan Rasul-Nya itu benar? Sesungguhnya aku telah dapati apa yang dijanjikan Allah SWT kepadaku itu benar.’ Umar berkata: ‘Wahai Rasulullah SAW, bagaimanakah baginda bercakap dengan mayat-mayat yang tidak bernyawa?’ Baginda bersabda: ‘Kamu tidak lebih mendengar perkataanKu daripada mereka, cuma mereka tidak dapat membalasKu.’"
  },
  {
    "id": 14321,
    "hadith_number": 7044,
    "tajuk_hadith": "Rasulullah Mengajak Jenazah Perang Badar",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW membiarkan mayat-mayat musuh yang terkorban dalam Perang Badar selama tiga hari.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ،\n مَالِكٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم تَرَكَ قَتْلَى بَدْرٍ ثَلاَثًا ثُمَّ أَتَاهُمْ فَقَامَ عَلَيْهِمْ فَنَادَاهُمْ\n فَقَالَ ‏\"‏ يَا أَبَا جَهْلِ بْنَ هِشَامٍ يَا أُمَيَّةَ بْنَ خَلَفٍ يَا عُتْبَةَ بْنَ رَبِيعَةَ يَا شَيْبَةَ بْنَ رَبِيعَةَ أَلَيْسَ\n قَدْ وَجَدْتُمْ مَا وَعَدَ رَبُّكُمْ حَقًّا فَإِنِّي قَدْ وَجَدْتُ مَا وَعَدَنِي رَبِّي حَقًّا ‏\"‏ ‏.‏ فَسَمِعَ عُمَرُ قَوْلَ\n النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ يَسْمَعُوا وَأَنَّى يُجِيبُوا وَقَدْ جَيَّفُوا قَالَ\n ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ مَا أَنْتُمْ بِأَسْمَعَ لِمَا أَقُولُ مِنْهُمْ وَلَكِنَّهُمْ لاَ يَقْدِرُونَ أَنْ يُجِيبُوا ‏\"‏ ‏.‏ ثُمَّ\n أَمَرَ بِهِمْ فَسُحِبُوا فَأُلْقُوا فِي قَلِيبِ بَدْرٍ ‏.‏",
    "malay_translation": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW membiarkan mayat-mayat musuh yang terkorban dalam Perang Badar selama tiga hari. Kemudian Baginda datang kepada mereka, berdiri di atas mereka dan memanggil mereka, seraya berkata: \"Wahai Abu Jahal bin Hisyam, wahai Umaiyyah bin Khalaf, wahai Utbah bin Rabi'ah, wahai Syaibah bin Rabi'ah, bukankah kamu telah mendapati janji Tuhan kamu itu benar?  Sesungguhnya Aku telah mendapati janji Tuhanku itu benar.\" Umar mendengar perkataan Rasulullah SAW, lalu berkata: \"Wahai Rasulullah, bagaimana mereka boleh mendengar dan menjawab sedangkan mereka telah menjadi mayat?\" Baginda menjawab: \"Demi Zat yang jiwaku berada di tangan-Nya, kamu tidak lebih jelas mendengar apa yang Aku katakan daripada mereka, tetapi mereka tidak mampu menjawab.\" Kemudian Baginda memerintahkan agar mereka diseret dan dibuang ke dalam perigi Badar."
  },
  {
    "id": 14322,
    "hadith_number": 7045,
    "tajuk_hadith": "Penghukuman di Pertempuran Badar",
    "perawi_melayu": "Abu Talhah meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يُوسُفُ بْنُ حَمَّادٍ الْمَعْنِيُّ، حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ \n أَنَسِ بْنِ مَالِكٍ، عَنْ أَبِي طَلْحَةَ، ح \n وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ \n قَتَادَةَ، قَالَ ذَكَرَ لَنَا أَنَسُ بْنُ مَالِكٍ عَنْ أَبِي طَلْحَةَ، قَالَ لَمَّا كَانَ يَوْمُ بَدْرٍ وَظَهَرَ عَلَيْهِمْ نَبِيُّ\n اللَّهِ صلى الله عليه وسلم أَمَرَ بِبِضْعَةٍ وَعِشْرِينَ رَجُلاً - وَفِي حَدِيثِ رَوْحٍ بِأَرْبَعَةٍ وَعِشْرِينَ\n رَجُلاً - مِنْ صَنَادِيدِ قُرَيْشٍ فَأُلْقُوا فِي طَوِيٍّ مِنْ أَطْوَاءِ بَدْرٍ ‏.‏ وَسَاقَ الْحَدِيثَ بِمَعْنَى حَدِيثِ\n ثَابِتٍ عَنْ أَنَسٍ ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Yusuf bin Hammad Al-Ma'ni, telah menceritakan kepada kami Abd Al-A'la, dari Sa'id, dari Qatadah, dari Anas bin Malik, dari Abu Talhah. Dan telah menceritakan kepadaku Muhammad bin Hatim, telah menceritakan kepada kami Ruh bin 'Ubadah, telah menceritakan kepada kami Sa'id bin Abi 'Aruubah, dari Qatadah, dia berkata: Anas bin Malik menceritakan kepada kami dari Abu Talhah, katanya: Ketika terjadi Perang Badar dan Rasulullah ﷺ telah mendapat kemenangan atas mereka (kaum Quraisy), Baginda memerintahkan lebih kurang dua puluh orang lelaki - dan dalam riwayat Ruh, dua puluh empat orang lelaki - dari kalangan pahlawan Quraisy untuk dilemparkan ke dalam sebuah perigi di Badar. Dan beliau meneruskan hadis tersebut dengan makna yang sama dengan hadis Thabit dari Anas."
  },
  {
    "id": 14323,
    "hadith_number": 7046,
    "tajuk_hadith": "Hisab dan Azab di Hari Kiamat",
    "perawi_melayu": "Aisyah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ حُجْرٍ، جَمِيعًا عَنْ إِسْمَاعِيلَ، قَالَ أَبُو بَكْرٍ\n حَدَّثَنَا ابْنُ عُلَيَّةَ، عَنْ أَيُّوبَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ\n صلى الله عليه وسلم ‏\"‏ مَنْ حُوسِبَ يَوْمَ الْقِيَامَةِ عُذِّبَ ‏\"‏ ‏.‏ فَقُلْتُ أَلَيْسَ قَدْ قَالَ اللَّهُ عَزَّ\n وَجَلَّ ‏{‏ فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا‏}‏ فَقَالَ ‏\"‏ لَيْسَ ذَاكِ الْحِسَابُ إِنَّمَا ذَاكِ الْعَرْضُ\n مَنْ نُوقِشَ الْحِسَابَ يَوْمَ الْقِيَامَةِ عُذِّبَ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Bakar bin Abi Syaibah dan Ali bin Hujr, berdua meriwayatkan daripada Ismail, kata Abu Bakar:  Kami telah mendengar daripada Ibnu ‘Ulayyah, daripada Ayub, daripada Abdullah bin Abi Mulah, daripada Aisyah, katanya: Rasulullah SAW bersabda:  \"Sesiapa yang dihisab pada hari kiamat, dia akan diazab.\" Lalu aku bertanya: Bukankah Allah SWT telah berfirman:  {…maka nescaya dia akan dihisab dengan hisab yang mudah…}  Baginda menjawab:  \"Bukan itu hisab, tetapi itu hanyalah persembahan (amalan). Sesiapa yang dipertikaikan hisabnya pada hari kiamat, dia akan diazab.\""
  },
  {
    "id": 14324,
    "hadith_number": 7047,
    "tajuk_hadith": "Hadis Diriwayatkan oleh Ayyub dengan Sanad yang Sama",
    "perawi_melayu": "Ayyub dan periwayat-periwayat lain yang sama",
    "english_text": "This hadith has been narrated on the authority of Ayyub with the same chain of transmitters.",
    "arabic_text": "حَدَّثَنِي أَبُو الرَّبِيعِ الْعَتَكِيُّ، وَأَبُو كَامِلٍ قَالاَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا أَيُّوبُ،\n بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan oleh Ayyub dengan sanad yang sama."
  },
  {
    "id": 14325,
    "hadith_number": 7048,
    "tajuk_hadith": "Hisab dan Kehancuran",
    "perawi_melayu": "Aisyah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ بِشْرِ بْنِ الْحَكَمِ الْعَبْدِيُّ، حَدَّثَنَا يَحْيَى، - يَعْنِي ابْنَ سَعِيدٍ\n الْقَطَّانَ - حَدَّثَنَا أَبُو يُونُسَ الْقُشَيْرِيُّ، حَدَّثَنَا ابْنُ أَبِي مُلَيْكَةَ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ، عَنِ \n النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لَيْسَ أَحَدٌ يُحَاسَبُ إِلاَّ هَلَكَ ‏\"‏ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ\n أَلَيْسَ اللَّهُ يَقُولُ حِسَابًا يَسِيرًا قَالَ ‏\"‏ ذَاكِ الْعَرْضُ وَلَكِنْ مَنْ نُوقِشَ الْحِسَابَ هَلَكَ ‏\"‏ ‏.‏",
    "malay_translation": "Aku telah diceritakan oleh Abdur Rahman bin Bisyr bin Al-Hakam Al-Abdi, yang telah meriwayatkan daripada Yahya - iaitu Ibnu Said Al-Qattan - yang telah meriwayatkan daripada Abu Yunus Al-Qusyairi, yang telah meriwayatkan daripada Ibnu Abi Mualikah, daripada Al-Qasim, daripada Aisyah, daripada Nabi SAW, baginda bersabda:  \"Tiada seorang pun yang dihisab melainkan dia akan binasa.\" Aku bertanya: \"Wahai Rasulullah, bukankah Allah SWT berfirman tentang hisab yang mudah?\" Baginda menjawab: \"Itu adalah persembahan (amalan), tetapi sesiapa yang dipersoalkan hisabnya, nescaya dia akan binasa.\""
  },
  {
    "id": 14326,
    "hadith_number": 7049,
    "tajuk_hadith": "Kehancuran Akibat Hisab yang Teliti",
    "perawi_melayu": "Aisyah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "He who is examined thoroughly In reckoning is undone.",
    "arabic_text": "وَحَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ، حَدَّثَنِي يَحْيَى، - وَهُوَ الْقَطَّانُ - عَنْ عُثْمَانَ بْنِ،\n الأَسْوَدِ عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ نُوقِشَ\n الْحِسَابَ هَلَكَ ‏\"‏ ‏.‏ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ أَبِي يُونُسَ ‏.‏",
    "malay_translation": "Aisyah meriwayatkan bahawa Rasulullah SAW bersabda: \"Sesiapa yang dihisab dengan teliti, maka dia akan binasa.\""
  },
  {
    "id": 14327,
    "hadith_number": 7050,
    "tajuk_hadith": "Harapan Baik Kepada Allah Sebelum Kematian",
    "perawi_melayu": "Jabir meriwayatkan:",
    "english_text": "I heard Allah's Apostle (ﷺ) as saying three days before his death: None of you should court death but only hoping good from Allah",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا يَحْيَى بْنُ زَكَرِيَّاءَ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ،\n عَنْ جَابِرٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم قَبْلَ وَفَاتِهِ بِثَلاَثٍ يَقُولُ ‏\n\"‏ لاَ يَمُوتَنَّ أَحَدُكُمْ\n إِلاَّ وَهُوَ يُحْسِنُ بِاللَّهِ الظَّنَّ ‏\"‏ ‏.‏",
    "malay_translation": "Jabir berkata: Saya mendengar Rasulullah SAW tiga hari sebelum wafatnya bersabda: \"Janganlah seorang pun di antara kamu mengharapkan kematian melainkan dengan mengharapkan kebaikan dari Allah.\""
  },
  {
    "id": 14328,
    "hadith_number": 7051,
    "tajuk_hadith": "Hadis Diriwayatkan oleh al-A'mash dengan Sanad yang Sama",
    "perawi_melayu": "Daripada al-A'mash dengan sanad yang sama.",
    "english_text": "This hadith has been narrated on the authority of A'mash with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ،\n ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، وَأَبُو مُعَاوِيَةَ كُلُّهُمْ عَنِ الأَعْمَشِ،\n بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada al-A'mash dengan sanad yang sama.  (عثمان بن أبي شيبة, جرير, أبو كريْب, أبو معاوية, إسحاق بن إبراهيم, عيسى بن يونس, dan أبو معاوية semuanya meriwayatkan daripada al-A'mash dengan sanad yang serupa.)"
  },
  {
    "id": 14329,
    "hadith_number": 7052,
    "tajuk_hadith": "Harapan Baik kepada Allah SWT Sebelum Kematian",
    "perawi_melayu": "Jabir bin Abdullah al-Ansari meriwayatkan:",
    "english_text": "I heard Allah's Messenger (ﷺ) say three days before his death: None of you should die but hoping only good from Allah, the Exalted and Glorious.",
    "arabic_text": "وَحَدَّثَنِي أَبُو دَاوُدَ، سُلَيْمَانُ بْنُ مَعْبَدٍ حَدَّثَنَا أَبُو النُّعْمَانِ، عَارِمٌ حَدَّثَنَا مَهْدِيُّ بْنُ،\n مَيْمُونٍ حَدَّثَنَا وَاصِلٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ الأَنْصَارِيِّ، قَالَ سَمِعْتُ رَسُولَ\n اللَّهِ صلى الله عليه وسلم قَبْلَ مَوْتِهِ بِثَلاَثَةِ أَيَّامٍ يَقُولُ ‏\n\"‏ لاَ يَمُوتَنَّ أَحَدُكُمْ إِلاَّ وَهُوَ يُحْسِنُ\n الظَّنَّ بِاللَّهِ عَزَّ وَجَلَّ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW, tiga hari sebelum wafatnya, bersabda: \"Janganlah seorang pun di antara kamu mati melainkan dengan memiliki harapan yang baik kepada Allah SWT yang Maha Agung dan Maha Mulia.\""
  },
  {
    "id": 14330,
    "hadith_number": 7053,
    "tajuk_hadith": "Kematian Menentukan Keadaan Kebangkitan",
    "perawi_melayu": "Jabir meriwayatkan:",
    "english_text": "I heard Allah's Apostle (ﷺ) as saying. Every servant would be raised (in the same very state) in which he dies.",
    "arabic_text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، قَالاَ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ،\n عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ يُبْعَثُ كُلُّ عَبْدٍ\n عَلَى مَا مَاتَ عَلَيْهِ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda: \"Setiap hamba akan dibangkitkan dalam keadaan sebagaimana dia meninggal dunia.\""
  },
  {
    "id": 14331,
    "hadith_number": 7054,
    "tajuk_hadith": "Perbezaan Ringkas Perawi Hadis",
    "perawi_melayu": "Abu Bakar bin Nafi' meriwayatkan daripada Abdur Rahman bin Mahdi, daripada Sufyan, daripada al-A'masy.",
    "english_text": "This hadith has been transmitted on the authority of A'mash but with a slight variation of wording.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ نَافِعٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنِ الأَعْمَشِ،\n بِهَذَا الإِسْنَادِ ‏.‏ مِثْلَهُ وَقَالَ عَنِ النَّبِيِّ صلى الله عليه وسلم وَلَمْ يَقُلْ سَمِعْتُ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan melalui sanad al-A'masy, tetapi dengan sedikit perbezaan lafaz.  Riwayat ini menyebut bahawa Nabi SAW bersabda tanpa menyebut “Saya mendengar”."
  },
  {
    "id": 14332,
    "hadith_number": 7055,
    "tajuk_hadith": "Azab Allah ke atas sesuatu kaum",
    "perawi_melayu": "Abdullah bin Umar meriwayatkan:",
    "english_text": "I heard Allah's Messenger (ﷺ) as saying: When Allah intends to chastise a people, He chastises all of them then they would be raised according to their deeds.",
    "arabic_text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ،\n شِهَابٍ أَخْبَرَنِي حَمْزَةُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ\n صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِذَا أَرَادَ اللَّهُ بِقَوْمٍ عَذَابًا أَصَابَ الْعَذَابُ مَنْ كَانَ فِيهِمْ ثُمَّ بُعِثُوا\n عَلَى أَعْمَالِهِمْ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda:  \"Apabila Allah SWT berkehendak menimpakan azab ke atas sesuatu kaum, maka azab itu akan menimpa semua mereka, kemudian mereka akan dibangkitkan semula berdasarkan amalan mereka masing-masing.\""
  }
]
