[
  {
    "id": 14127,
    "hadith_number": 6850,
    "tajuk_hadith": "Kepayahan dalam Perjalanan dan Kemunafikan",
    "perawi_melayu": "Zaid bin Arqam meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى، حَدَّثَنَا زُهَيْرُ بْنُ مُعَاوِيَةَ،\n حَدَّثَنَا أَبُو إِسْحَاقَ، أَنَّهُ سَمِعَ زَيْدَ بْنَ أَرْقَمَ، يَقُولُ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه\n وسلم فِي سَفَرٍ أَصَابَ النَّاسَ فِيهِ شِدَّةٌ فَقَالَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ لأَصْحَابِهِ لاَ تُنْفِقُوا عَلَى\n مَنْ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم حَتَّى يَنْفَضُّوا مِنْ حَوْلِهِ ‏.‏ قَالَ زُهَيْرٌ وَهِيَ قِرَاءَةُ\n مَنْ خَفَضَ حَوْلَهُ ‏.‏ وَقَالَ لَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الأَعَزُّ مِنْهَا الأَذَلَّ - قَالَ - فَأَتَيْتُ\n النَّبِيَّ صلى الله عليه وسلم فَأَخْبَرْتُهُ بِذَلِكَ فَأَرْسَلَ إِلَى عَبْدِ اللَّهِ بْنِ أُبَىٍّ فَسَأَلَهُ فَاجْتَهَدَ\n يَمِينَهُ مَا فَعَلَ فَقَالَ كَذَبَ زَيْدٌ رَسُولَ اللَّهِ صلى الله عليه وسلم - قَالَ - فَوَقَعَ فِي نَفْسِي\n مِمَّا قَالُوهُ شِدَّةٌ حَتَّى أَنْزَلَ اللَّهُ تَصْدِيقِي ‏{‏ إِذَا جَاءَكَ الْمُنَافِقُونَ‏}‏ قَالَ ثُمَّ دَعَاهُمُ النَّبِيُّ\n صلى الله عليه وسلم لِيَسْتَغْفِرَ لَهُمْ - قَالَ - فَلَوَّوْا رُءُوسَهُمْ ‏.‏ وَقَوْلُهُ ‏{‏ كَأَنَّهُمْ خُشُبٌ مُسَنَّدَةٌ‏}‏ \n وَقَالَ كَانُوا رِجَالاً أَجْمَلَ شَىْءٍ ‏.‏",
    "malay_translation": "Kami telah melakukan perjalanan bersama Rasulullah SAW, dan kami telah mengalami pelbagai kesusahan. Abdullah bin Ubayy berkata kepada sahabat-sahabatnya: “Janganlah kamu bersedekah kepada orang-orang yang bersama Rasulullah SAW sehingga mereka meninggalkan Baginda.” Zuhary berkata: Itulah bacaan orang yang membaca ‘min haulahu’ (dari sekelilingnya) dan bacaan yang lain ialah ‘man haulahia’ (yang berada di sekelilingnya). Dan sekiranya kami pulang ke Madinah, nescaya orang yang berkuasa akan menghalau orang yang lemah darinya. Maka aku datang kepada Nabi SAW dan memberitahu Baginda tentang hal itu. Baginda lalu mengutus seseorang kepada Abdullah bin Ubayy dan menyoal tentangnya. Abdullah bin Ubayy bersumpah bahawa dia tidak berkata demikian, dan menuduh Zaid berdusta kepada Rasulullah SAW. Zaid berkata: Perkara ini amat meresahkan aku sehingga Allah menurunkan ayat yang membenarkan ucapanku: “Apabila datang kepadamu orang-orang munafik…” Kemudian Nabi SAW menyeru mereka supaya memohon keampunan bagi mereka, tetapi mereka memalingkan muka mereka seolah-olah mereka kayu yang tertanam di dinding, dan mereka sebenarnya adalah orang-orang yang tampan rupanya."
  },
  {
    "id": 14128,
    "hadith_number": 6851,
    "tajuk_hadith": "Rasulullah ﷺ Menziarahi Kubur Abdullah bin Ubayy",
    "perawi_melayu": "Jabir",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَأَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ، - وَاللَّفْظُ\n لاِبْنِ أَبِي شَيْبَةَ - قَالَ ابْنُ عَبْدَةَ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو،\n أَنَّهُ سَمِعَ جَابِرًا، يَقُولُ أَتَى النَّبِيُّ صلى الله عليه وسلم قَبْرَ عَبْدِ اللَّهِ بْنِ أُبَىٍّ فَأَخْرَجَهُ مِنْ\n قَبْرِهِ فَوَضَعَهُ عَلَى رُكْبَتَيْهِ وَنَفَثَ عَلَيْهِ مِنْ رِيقِهِ وَأَلْبَسَهُ قَمِيصَهُ فَاللَّهُ أَعْلَمُ ‏.‏",
    "malay_translation": "Jabir meriwayatkan bahawa Rasulullah ﷺ telah datang ke kubur Abdullah bin Ubayy, mengeluarkannya dari kubur, meletakkannya di atas lutut baginda, dan meniupkan air liurnya ke atasnya, serta mengenakan kain baju baginda ke atasnya.  Wallahu a'lam."
  },
  {
    "id": 14129,
    "hadith_number": 6852,
    "tajuk_hadith": "Lawatan Rasulullah SAW ke Kubur Abdullah bin Ubayy",
    "perawi_melayu": "Jabir bin Abdullah",
    "english_text": "Jabir b. 'Abdullah reported that Allah's Messenger (ﷺ) came to the grave of 'Abdullah b. Ubayy as he was placed in that. The rest of the hadith is the same.",
    "arabic_text": "حَدَّثَنِي أَحْمَدُ بْنُ يُوسُفَ الأَزْدِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي \n عَمْرُو بْنُ دِينَارٍ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ جَاءَ النَّبِيُّ صلى الله عليه وسلم إِلَى\n عَبْدِ اللَّهِ بْنِ أُبَىٍّ بَعْدَ مَا أُدْخِلَ حُفْرَتَهُ ‏.‏ فَذَكَرَ بِمِثْلِ حَدِيثِ سُفْيَانَ ‏.‏",
    "malay_translation": "Jabir bin Abdullah meriwayatkan bahawa Rasulullah SAW telah datang ke kubur Abdullah bin Ubayy setelah beliau dimasukkan ke dalamnya.  Baki riwayat hadis ini adalah sama."
  },
  {
    "id": 14130,
    "hadith_number": 6853,
    "tajuk_hadith": "Solat Jenazah untuk Munafik",
    "perawi_melayu": "Ibn Umar meriwayatkan bahawa apabila Abdullah bin Ubayy bin Salul meninggal dunia, anaknya Abdullah bin Abdullah (bin Ubayy) datang kepada Rasulullah SAW dan memohon agar baginda memberikan baju baginda untuk digunakan sebagai kafan bagi bapanya. Baginda memberikannya. Kemudian dia memohon agar baginda menunaikan solat jenazah ke atasnya. Rasulullah SAW hampir sahaja bangun untuk menunaikan solat tersebut apabila Umar bangun dan memegang jubah Rasulullah SAW dan berkata,",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ \n نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ لَمَّا تُوُفِّيَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ ابْنُ سَلُولَ جَاءَ ابْنُهُ عَبْدُ اللَّهِ بْنُ عَبْدِ\n اللَّهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَأَلَهُ أَنْ يُعْطِيَهُ قَمِيصَهُ يُكَفِّنُ فِيهِ أَبَاهُ فَأَعْطَاهُ\n ثُمَّ سَأَلَهُ أَنْ يُصَلِّيَ عَلَيْهِ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِيُصَلِّيَ عَلَيْهِ فَقَامَ عُمَرُ فَأَخَذَ\n بِثَوْبِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَتُصَلِّي عَلَيْهِ وَقَدْ نَهَاكَ اللَّهُ\n أَنْ تُصَلِّيَ عَلَيْهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا خَيَّرَنِي اللَّهُ فَقَالَ اسْتَغْفِرْ\n لَهُمْ أَوْ لاَ تَسْتَغْفِرْ لَهُمْ إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً وَسَأَزِيدُهُ عَلَى سَبْعِينَ ‏\"‏ ‏.‏ قَالَ إِنَّهُ\n مُنَافِقٌ ‏.‏ فَصَلَّى عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ وَلاَ تُصَلِّ\n عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا وَلاَ تَقُمْ عَلَى قَبْرِهِ‏}‏",
    "malay_translation": "Abu Bakar bin Abi Syaibah meriwayatkan daripada Abu Usamah, daripada Ubaidullah bin Umar, daripada Nafi', daripada Ibnu Umar, bahawa ketika Abdullah bin Ubayy bin Salul meninggal dunia, anaknya Abdullah bin Abdullah datang kepada Rasulullah SAW dan meminta agar baginda memberikan baju baginda untuk dikafankan bapanya. Baginda pun memberikannya. Kemudian dia meminta agar baginda menunaikan solat jenazah ke atasnya.  Rasulullah SAW bangun untuk menunaikan solat tersebut, lalu Umar bangun dan memegang baju Rasulullah SAW lalu berkata, \"Wahai Rasulullah, adakah tuan akan menunaikan solat ke atasnya sedangkan Allah SWT telah melarang tuan daripada berbuat demikian?\" Rasulullah SAW menjawab, \"Allah SWT memberi pilihan kepadaku dengan firman-Nya:  'Mohonlah ampun bagi mereka atau janganlah kamu memohon ampun bagi mereka.  Sekiranya kamu memohon ampun bagi mereka sebanyak tujuh puluh kali, Aku akan menambahkan lagi (ampunan) di atas tujuh puluh kali itu.'  Dan aku akan menambahkan lagi di atas tujuh puluh (kali).\"  Umar berkata, \"Sesungguhnya dia adalah seorang munafik.\"  Kemudian Rasulullah SAW menunaikan solat jenazah ke atasnya.  Lalu Allah SWT menurunkan ayat:  \"Dan janganlah kamu sembahyangkan sesiapa pun dari mereka yang mati selama-lamanya dan janganlah kamu berdiri di kuburnya.\" "
  },
  {
    "id": 14131,
    "hadith_number": 6854,
    "tajuk_hadith": "Meninggalkan Solat Jenazah",
    "perawi_melayu": "Hadis ini diriwayatkan daripada Abdullah dengan sanad yang sama, tetapi dengan tambahan:",
    "english_text": "\" He then abandoned offering (funeral) prayer for them.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا يَحْيَى، - وَهُوَ الْقَطَّانُ\n - عَنْ عُبَيْدِ اللَّهِ، بِهَذَا الإِسْنَادِ نَحْوَهُ وَزَادَ قَالَ فَتَرَكَ الصَّلاَةَ عَلَيْهِمْ ‏.‏",
    "malay_translation": "Kemudian baginda meninggalkan solat jenazah untuk mereka."
  },
  {
    "id": 14132,
    "hadith_number": 6855,
    "tajuk_hadith": "Allah Maha Mendengar",
    "perawi_melayu": "Ibnu Mas'ud meriwayatkan bahawa berkumpul berhampiran Kaabah tiga orang, dua daripadanya orang Quraisy dan seorang lagi orang Thaqifi atau dua orang Thaqifi dan seorang Quraisy.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنْ أَبِي،\n مَعْمَرٍ عَنِ ابْنِ مَسْعُودٍ، قَالَ اجْتَمَعَ عِنْدَ الْبَيْتِ ثَلاَثَةُ نَفَرٍ قُرَشِيَّانِ وَثَقَفِيٌّ أَوْ ثَقَفِيَّانِ وَقُرَشِيٌّ\n قَلِيلٌ فِقْهُ قُلُوبِهِمْ كَثِيرٌ شَحْمُ بُطُونِهِمْ فَقَالَ أَحَدُهُمْ أَتَرَوْنَ اللَّهَ يَسْمَعُ مَا نَقُولُ وَقَالَ الآخَرُ\n يَسْمَعُ إِنْ جَهَرْنَا وَلاَ يَسْمَعُ إِنْ أَخْفَيْنَا وَقَالَ الآخَرُ إِنْ كَانَ يَسْمَعُ إِذَا جَهَرْنَا فَهُوَ يَسْمَعُ\n إِذَا أَخْفَيْنَا ‏.‏ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ وَمَا كُنْتُمْ تَسْتَتِرُونَ أَنْ يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَلاَ أَبْصَارُكُمْ\n وَلاَ جُلُودُكُمْ‏}‏ الآيَةَ ‏.‏",
    "malay_translation": "Ibnu Mas'ud meriwayatkan bahawa berkumpul berhampiran Kaabah tiga orang, dua daripadanya orang Quraisy dan seorang lagi orang Thaqifi atau dua orang Thaqifi dan seorang Quraisy. Mereka kurang ilmu, tetapi banyak lemak di perut mereka.  Salah seorang berkata, “Adakah kamu berpendapat bahawa Allah mendengar apa yang kita katakan?”  Yang lain berkata, “Allah mendengar jika kita bersuara lantang, tetapi tidak mendengar jika kita berbisik.”  Dan yang seorang lagi berkata, “Jika Allah mendengar apabila kita bersuara lantang, maka Allah juga mendengar apabila kita berbisik.”  Maka Allah SWT menurunkan ayat:  “Dan kamu tidak dapat menyembunyikan sesuatu pun supaya pendengaranmu, penglihatanmu dan kulitmu tidak menjadi saksi terhadap kamu.” (Fussilat: 22)"
  },
  {
    "id": 14133,
    "hadith_number": 6856,
    "tajuk_hadith": "Sanad Hadis daripada Abdullah",
    "perawi_melayu": "Abu Bakar bin Khalid Al-Bahili, Yahya (Ibn Sa'id), Sufyan, Sulaiman, Umarah bin Umayr, Wahb bin Rabi'ah, Abdullah.  Juga diriwayatkan oleh Yahya, Sufyan, Mansur, Mujahid, Abu Ma'mar, Abdullah.",
    "english_text": "This hadith has been narrated on the authority of 'Abdullah through another chain of transmitters.",
    "arabic_text": "وَحَدَّثَنِي أَبُو بَكْرِ بْنُ خَلاَّدٍ الْبَاهِلِيُّ، حَدَّثَنَا يَحْيَى، - يَعْنِي ابْنَ سَعِيدٍ - حَدَّثَنَا \n سُفْيَانُ، حَدَّثَنِي سُلَيْمَانُ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ وَهْبِ بْنِ رَبِيعَةَ، عَنْ عَبْدِ اللَّهِ، ح \n وَقَالَ حَدَّثَنَا يَحْيَى، حَدَّثَنَا سُفْيَانُ، حَدَّثَنِي مَنْصُورٌ، عَنْ مُجَاهِدٍ، عَنْ أَبِي مَعْمَرٍ،\n عَنْ عَبْدِ اللَّهِ، بِنَحْوِهِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan melalui beberapa sanad daripada Abdullah.  Sanad pertama melalui Abu Bakar bin Khalid Al-Bahili, Yahya (Ibn Sa'id), Sufyan, Sulaiman, Umarah bin Umayr, Wahb bin Rabi'ah, dan akhirnya Abdullah.  Sanad kedua pula melalui Yahya, Sufyan, Mansur, Mujahid, Abu Ma'mar, dan Abdullah dengan makna yang hampir sama."
  },
  {
    "id": 14134,
    "hadith_number": 6857,
    "tajuk_hadith": "Perselisihan Pendapat Mengenai Munafik di Uhud",
    "perawi_melayu": "Zaid bin Thabit meriwayatkan bahawa Rasulullah SAW berangkat ke Uhud. Sebahagian daripada mereka yang bersama baginda kembali. Para sahabat Rasulullah SAW terbahagi kepada dua kumpulan.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيٍّ، - وَهُوَ\n ابْنُ ثَابِتٍ - قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ يَزِيدَ، يُحَدِّثُ عَنْ زَيْدِ بْنِ ثَابِتٍ، أَنَّ النَّبِيَّ صلى الله\n عليه وسلم خَرَجَ إِلَى أُحُدٍ فَرَجَعَ نَاسٌ مِمَّنْ كَانَ مَعَهُ فَكَانَ أَصْحَابُ النَّبِيِّ صلى الله عليه\n وسلم فِيهِمْ فِرْقَتَيْنِ قَالَ بَعْضُهُمْ نَقْتُلُهُمْ ‏.‏ وَقَالَ بَعْضُهُمْ لاَ ‏.‏ فَنَزَلَتْ ‏{‏ فَمَا لَكُمْ فِي الْمُنَافِقِينَ\n فِئَتَيْنِ‏}‏",
    "malay_translation": "Diriwayatkan oleh Ubaidullah bin Mu'adz al-Anbari, daripada bapanya, daripada Syu'bah, daripada Adiyy (iaitu Ibnu Tsabit), bahawa beliau mendengar Abdullah bin Yazid meriwayatkan daripada Zaid bin Tsabit bahawa Nabi SAW berangkat ke Uhud, kemudian sebahagian daripada orang yang bersama baginda pulang.  Maka sahabat-sahabat Nabi SAW terbahagi kepada dua kumpulan. Sebahagian daripada mereka berkata: “Kita bunuh mereka.” Dan sebahagian lagi berkata: “Tidak.” Maka turunlah ayat:  “Maka mengapakah kamu menjadi dua golongan tentang orang-orang munafik?” (An-Nisaa': 88)."
  },
  {
    "id": 14135,
    "hadith_number": 6858,
    "tajuk_hadith": "Sanad Hadith daripada Syu'bah",
    "perawi_melayu": "Zuhair bin Harb melalui Yahya bin Said dan Abu Bakar bin Nafi' melalui Gundar, kedua-duanya daripada Syu'bah.",
    "english_text": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ح وَحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ،\n حَدَّثَنَا غُنْدَرٌ، كِلاَهُمَا عَنْ شُعْبَةَ، بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏",
    "malay_translation": "Hadith ini diriwayatkan daripada Syu'bah dengan sanad yang hampir sama. Zuhair bin Harb meriwayatkan daripada Yahya bin Said, dan Abu Bakar bin Nafi' meriwayatkan daripada Gundar. Kedua-duanya meriwayatkan daripada Syu'bah."
  },
  {
    "id": 14136,
    "hadith_number": 6859,
    "tajuk_hadith": "Ancaman Azab Bagi Orang Munafik",
    "perawi_melayu": "Abu Said al-Khudri",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَمُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ، قَالاَ حَدَّثَنَا ابْنُ أَبِي،\n مَرْيَمَ أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، أَخْبَرَنِي زَيْدُ بْنُ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ،\n الْخُدْرِيِّ أَنَّ رِجَالاً، مِنَ الْمُنَافِقِينَ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم كَانُوا إِذَا خَرَجَ\n النَّبِيُّ صلى الله عليه وسلم إِلَى الْغَزْوِ تَخَلَّفُوا عَنْهُ وَفَرِحُوا بِمَقْعَدِهِمْ خِلاَفَ رَسُولِ اللَّهِ\n صلى الله عليه وسلم فَإِذَا قَدِمَ النَّبِيُّ صلى الله عليه وسلم اعْتَذَرُوا إِلَيْهِ وَحَلَفُوا وَأَحَبُّوا\n أَنْ يُحْمَدُوا بِمَا لَمْ يَفْعَلُوا فَنَزَلَتْ ‏{‏ لاَ تَحْسَبَنَّ الَّذِينَ يَفْرَحُونَ بِمَا أَتَوْا وَيُحِبُّونَ أَنْ يُحْمَدُوا\n بِمَا لَمْ يَفْعَلُوا فَلاَ تَحْسَبَنَّهُمْ بِمَفَازَةٍ مِنَ الْعَذَابِ‏}‏",
    "malay_translation": "Telah menceritakan kepada kami Al-Hasan bin Ali Al-Hulwani dan Muhammad bin Sahal At-Tamimi, keduanya berkata; Telah menceritakan kepada kami Ibnu Abi Maryam, telah mengabarkan kepada kami Muhammad bin Ja'far, telah mengabarkan kepadaku Zaid bin Aslam dari Ata' bin Yasar dari Abu Said Al-Khudri, bahawa sesungguhnya pada zaman Rasulullah SAW ada beberapa orang munafik, apabila Rasulullah SAW keluar berperang, mereka tinggal di belakang dan bergembira dengan tinggal di rumah, berlawanan dengan Rasulullah SAW.  Apabila Rasulullah SAW pulang, mereka meminta maaf kepada Baginda, bersumpah dan mereka suka dipuji atas apa yang tidak mereka lakukan. Maka turunlah ayat: {Janganlah kamu mengira bahawa orang-orang yang bergembira dengan apa yang telah mereka lakukan dan suka dipuji atas apa yang tidak mereka lakukan, janganlah kamu mengira mereka akan terlepas dari azab.}"
  },
  {
    "id": 14137,
    "hadith_number": 6860,
    "tajuk_hadith": "Kegembiraan Atas Amalan dan Pujian Yang Tidak Dilakukan",
    "perawi_melayu": "Humaid bin Abd al-Rahman bin Auf meriwayatkan bahawa Marwan berkata kepada Rafi', bendaharanya, supaya pergi kepada Ibnu Abbas dan bertanya kepadanya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَهَارُونُ بْنُ عَبْدِ اللَّهِ، - وَاللَّفْظُ لِزُهَيْرٍ - قَالاَ حَدَّثَنَا حَجَّاجُ،\n بْنُ مُحَمَّدٍ عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ، أَنَّ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَخْبَرَهُ \n أَنَّ مَرْوَانَ قَالَ اذْهَبْ يَا رَافِعُ - لِبَوَّابِهِ - إِلَى ابْنِ عَبَّاسٍ فَقُلْ لَئِنْ كَانَ كُلُّ امْرِئٍ مِنَّا\n فَرِحَ بِمَا أَتَى وَأَحَبَّ أَنْ يُحْمَدَ بِمَا لَمْ يَفْعَلْ مُعَذَّبًا لَنُعَذَّبَنَّ أَجْمَعُونَ ‏.‏ فَقَالَ ابْنُ عَبَّاسٍ مَا\n لَكُمْ وَلِهَذِهِ الآيَةِ إِنَّمَا أُنْزِلَتْ هَذِهِ الآيَةُ فِي أَهْلِ الْكِتَابِ ‏.‏ ثُمَّ تَلاَ ابْنُ عَبَّاسٍ ‏{‏ وَإِذْ أَخَذَ\n اللَّهُ مِيثَاقَ الَّذِينَ أُوتُوا الْكِتَابَ لَتُبَيِّنُنَّهُ لِلنَّاسِ وَلاَ تَكْتُمُونَهُ‏}‏ هَذِهِ الآيَةَ وَتَلاَ ابْنُ عَبَّاسٍ\n ‏{‏ لاَ تَحْسَبَنَّ الَّذِينَ يَفْرَحُونَ بِمَا أَتَوْا وَيُحِبُّونَ أَنْ يُحْمَدُوا بِمَا لَمْ يَفْعَلُوا‏}‏ وَقَالَ ابْنُ عَبَّاسٍ\n سَأَلَهُمُ النَّبِيُّ صلى الله عليه وسلم عَنْ شَىْءٍ فَكَتَمُوهُ إِيَّاهُ وَأَخْبَرُوهُ بِغَيْرِهِ فَخَرَجُوا قَدْ\n أَرَوْهُ أَنْ قَدْ أَخْبَرُوهُ بِمَا سَأَلَهُمْ عَنْهُ وَاسْتَحْمَدُوا بِذَلِكَ إِلَيْهِ وَفَرِحُوا بِمَا أَتَوْا مِنْ كِتْمَانِهِمْ\n إِيَّاهُ مَا سَأَلَهُمْ عَنْهُ ‏.‏",
    "malay_translation": "Zuhari bin Harb dan Harun bin Abdullah meriwayatkan - dan lafaz Zuhari - bahawa mereka berdua meriwayatkan daripada Hajjaj bin Muhammad daripada Ibnu Juraij, yang memberitahu aku daripada Ibnu Abi Mualik bahawa Humaid bin Abd al-Rahman bin Auf memberitahunya bahawa Marwan berkata, \"Pergilah wahai Rafi' - kepada bendaharanya - kepada Ibnu Abbas dan katakan kepadanya: Sekiranya setiap seorang daripada kita gembira dengan apa yang telah dilakukan dan suka dipuji atas apa yang tidak dilakukannya, nescaya kita semua akan di azab.\" Maka Ibnu Abbas berkata, \"Apakah urusan kamu dengan ayat ini? Sesungguhnya ayat ini diturunkan berkenaan dengan Ahli Kitab.\" Kemudian Ibnu Abbas membaca:  \"Dan (ingatlah) ketika Allah mengambil perjanjian daripada orang-orang yang telah diberi Kitab: hendaklah kamu menerangkannya kepada manusia dan janganlah kamu menyembunyikannya.\" (Ali Imran: 187)  Dan Ibnu Abbas membaca: \"Janganlah kamu menyangka bahawa orang-orang yang bergembira dengan apa yang telah mereka lakukan, dan mereka suka dipuji dengan apa yang tidak mereka lakukan.\" (Ali Imran: 188)  Dan Ibnu Abbas berkata lagi, \"Nabi ﷺ bertanya kepada mereka tentang sesuatu, maka mereka menyembunyikannya daripada baginda dan memberitahu baginda perkara lain. Lalu mereka keluar dengan rasa bahawa mereka telah memberitahu baginda apa yang ditanyakannya, lalu mereka merasa senang dengan apa yang mereka sembunyikan daripada baginda, iaitu perkara yang ditanyakan baginda kepada mereka."
  },
  {
    "id": 14138,
    "hadith_number": 6861,
    "tajuk_hadith": "Pendapat 'Ammar Mengenai Pihak yang Disokongnya dan Ramalan Nabi SAW tentang Munafik",
    "perawi_melayu": "Qais meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ، حَدَّثَنَا شُعْبَةُ بْنُ الْحَجَّاجِ،\n عَنْ قَتَادَةَ، عَنْ أَبِي نَضْرَةَ، عَنْ قَيْسٍ، قَالَ قُلْتُ لِعَمَّارٍ أَرَأَيْتُمْ صَنِيعَكُمْ هَذَا الَّذِي صَنَعْتُمْ\n فِي أَمْرِ عَلِيٍّ أَرَأْيًا رَأَيْتُمُوهُ أَوْ شَيْئًا عَهِدَهُ إِلَيْكُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ\n مَا عَهِدَ إِلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم شَيْئًا لَمْ يَعْهَدْهُ إِلَى النَّاسِ كَافَّةً وَلَكِنْ حُذَيْفَةُ\n أَخْبَرَنِي عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ فِي أَصْحَابِي\n اثْنَا عَشَرَ مُنَافِقًا فِيهِمْ ثَمَانِيَةٌ لاَ يَدْخُلُونَ الْجَنَّةَ حَتَّى يَلِجَ الْجَمَلُ فِي سَمِّ الْخِيَاطِ ثَمَانِيَةٌ\n مِنْهُمْ تَكْفِيكَهُمُ الدُّبَيْلَةُ وَأَرْبَعَةٌ ‏\"‏ ‏.‏ لَمْ أَحْفَظْ مَا قَالَ شُعْبَةُ فِيهِمْ ‏.‏",
    "malay_translation": "Aku berkata kepada 'Ammar: Apakah pendapatmu tentang apa yang telah kamu lakukan dalam hal (memihak kepada Hadrat 'Ali)? Adakah itu pendapat peribadimu atau sesuatu yang kamu terima daripada Rasulullah SAW? 'Ammar berkata: Kami tidak menerima apa-apa daripada Rasulullah SAW yang tidak diterima oleh semua orang, tetapi Hudzaifah memberitahu aku bahawa Rasulullah SAW telah memberitahu dia secara khusus di kalangan sahabatnya, bahawa akan ada dua belas orang munafik, lapan daripadanya tidak akan masuk syurga sehingga unta dapat melalui lubang jarum.  Delapan dari mereka, penyakit akan cukup (untuk membunuh) mereka.  Adapun empat lagi, aku tidak ingat apa yang Shu'bah katakan tentang mereka."
  },
  {
    "id": 14139,
    "hadith_number": 6862,
    "tajuk_hadith": "Mengenai Munafik di dalam Ummah",
    "perawi_melayu": "Qais bin Ubad meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا \n مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَبِي نَضْرَةَ، عَنْ قَيْسِ بْنِ عُبَادٍ، قَالَ قُلْنَا لِعَمَّارٍ\n أَرَأَيْتَ قِتَالَكُمْ أَرَأْيًا رَأَيْتُمُوهُ فَإِنَّ الرَّأْىَ يُخْطِئُ وَيُصِيبُ أَوْ عَهْدًا عَهِدَهُ إِلَيْكُمْ رَسُولُ اللَّهِ\n صلى الله عليه وسلم فَقَالَ مَا عَهِدَ إِلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم شَيْئًا لَمْ يَعْهَدْهُ\n إِلَى النَّاسِ كَافَّةً ‏.‏ وَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ فِي أُمَّتِي ‏\"‏ ‏.‏\n قَالَ شُعْبَةُ وَأَحْسِبُهُ قَالَ حَدَّثَنِي حُذَيْفَةُ ‏.‏ وَقَالَ غُنْدَرٌ أُرَاهُ قَالَ ‏\"‏ فِي أُمَّتِي اثْنَا عَشَرَ\n مُنَافِقًا لاَ يَدْخُلُونَ الْجَنَّةَ وَلاَ يَجِدُونَ رِيحَهَا حَتَّى يَلِجَ الْجَمَلُ فِي سَمِّ الْخِيَاطِ ثَمَانِيَةٌ مِنْهُمْ\n تَكْفِيكَهُمُ الدُّبَيْلَةُ سِرَاجٌ مِنَ النَّارِ يَظْهَرُ فِي أَكْتَافِهِمْ حَتَّى يَنْجُمَ مِنْ صُدُورِهِمْ ‏\"‏ ‏.‏",
    "malay_translation": "Kami bertanya kepada Ammar: “Apakah pertempuran kamu (di pihak Ali dalam Perang Siffin) adalah atas pilihan kamu sendiri atau kamu mendapat petunjuk dari Rasulullah ﷺ? Kerana seseorang itu boleh silap dalam membuat keputusan sendiri, atau adakah ia kerana sesuatu perjanjian yang dibuat oleh Rasulullah ﷺ dengan kamu?” Dia menjawab: “Rasulullah ﷺ tidak membuat sebarang perjanjian dengan kami yang tidak dibuatnya dengan orang lain.” Dan dia berkata lagi bahawa Rasulullah ﷺ bersabda: “Di dalam umatku…”  Syu’bah berkata, dan aku kira dia berkata: “Hudzaifah memberitakan kepadaku.”  Dan Ghundar berkata (aku nampak dia berkata): “Di dalam umatku, terdapat dua belas orang munafik yang tidak akan masuk syurga dan tidak akan merasai baunya sehingga unta dapat melalui lubang jarum.  Bagi lapan daripada mereka, cukuplah penyakit Dubailah (sejenis penyakit kulit) – iaitu sejenis api neraka yang akan muncul di bahu mereka sehingga keluar dari dada mereka.”"
  },
  {
    "id": 14140,
    "hadith_number": 6863,
    "tajuk_hadith": "Pertikaian di Aqabah dan Azab Orang yang Mendahului",
    "perawi_melayu": "Abu Tufail meriwayatkan bahawa telah berlaku perselisihan faham antara Hudhaifah dan seorang daripada penduduk Aqabah sepertimana yang biasa berlaku di kalangan manusia. Baginda berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا أَبُو أَحْمَدَ الْكُوفِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ جُمَيْعٍ، حَدَّثَنَا \n أَبُو الطُّفَيْلِ، قَالَ كَانَ بَيْنَ رَجُلٍ مِنْ أَهْلِ الْعَقَبَةِ وَبَيْنَ حُذَيْفَةَ بَعْضُ مَا يَكُونُ بَيْنَ النَّاسِ\n فَقَالَ أَنْشُدُكَ بِاللَّهِ كَمْ كَانَ أَصْحَابُ الْعَقَبَةِ قَالَ فَقَالَ لَهُ الْقَوْمُ أَخْبِرْهُ إِذْ سَأَلَكَ قَالَ كُنَّا\n نُخْبَرُ أَنَّهُمْ أَرْبَعَةَ عَشَرَ فَإِنْ كُنْتَ مِنْهُمْ فَقَدْ كَانَ الْقَوْمُ خَمْسَةَ عَشَرَ وَأَشْهَدُ بِاللَّهِ أَنَّ اثْنَىْ\n عَشَرَ مِنْهُمْ حَرْبٌ لِلَّهِ وَلِرَسُولِهِ فِي الْحَيَاةِ الدُّنْيَا وَيَوْمَ يَقُومُ الأَشْهَادُ وَعَذَرَ ثَلاَثَةً قَالُوا\n مَا سَمِعْنَا مُنَادِيَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلاَ عَلِمْنَا بِمَا أَرَادَ الْقَوْمُ ‏.‏ وَقَدْ كَانَ\n فِي حَرَّةٍ فَمَشَى فَقَالَ ‏\n\"‏ إِنَّ الْمَاءَ قَلِيلٌ فَلاَ يَسْبِقُنِي إِلَيْهِ أَحَدٌ ‏\"‏ ‏.‏ فَوَجَدَ قَوْمًا قَدْ سَبَقُوهُ\n فَلَعَنَهُمْ يَوْمَئِذٍ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Zuhair bin Harb, telah menceritakan kepada kami Abu Ahmad Al-Kufi, telah menceritakan kepada kami Walid bin Jumaiah, telah menceritakan kepada kami Abu Tufail, dia berkata: Telah berlaku perselisihan faham antara seorang lelaki daripada penduduk Aqabah dan Hudzaifah sepertimana yang biasa berlaku di kalangan manusia. Maka dia bertanya: Aku bersumpah kepadamu demi Allah, berapakah jumlah sahabat-sahabat Aqabah?  Lalu orang ramai berkata kepadanya: Beritahulah dia kerana dia telah bertanya kepadamu. Dia berkata: Kami diberitahu bahawa mereka berjumlah empat belas orang. Jika engkau termasuk di antara mereka, maka mereka berjumlah lima belas orang. Dan aku bersaksi demi Allah bahawa dua belas orang daripada mereka adalah musuh kepada Allah dan Rasul-Nya di dunia ini dan pada hari orang-orang yang memberi keterangan berdiri.  Tiga orang daripada mereka pula dimaafkan kerana mereka berkata: Kami tidak mendengar seruan Rasulallah ﷺ dan kami tidak mengetahui apa yang diinginkan oleh orang ramai. Sementara itu, baginda berada di kawasan yang panas. Kemudian, baginda berjalan dan berkata: “Sesungguhnya air itu sedikit, maka jangan sesiapa mendahului aku.” Kemudian baginda mendapati orang ramai telah mendahului baginda, maka baginda melaknat mereka pada hari itu."
  },
  {
    "id": 14141,
    "hadith_number": 6864,
    "tajuk_hadith": "Pengampunan Dosa di Bukit Murar",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ، عَنْ أَبِي الزُّبَيْرِ،\n عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ يَصْعَدُ الثَّنِيَّةَ ثَنِيَّةَ\n الْمُرَارِ فَإِنَّهُ يُحَطُّ عَنْهُ مَا حُطَّ عَنْ بَنِي إِسْرَائِيلَ ‏\"‏ ‏.‏ قَالَ فَكَانَ أَوَّلَ مَنْ صَعِدَهَا خَيْلُنَا\n خَيْلُ بَنِي الْخَزْرَجِ ثُمَّ تَتَامَّ النَّاسُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَكُلُّكُمْ مَغْفُورٌ\n لَهُ إِلاَّ صَاحِبَ الْجَمَلِ الأَحْمَرِ ‏\"‏ ‏.‏ فَأَتَيْنَاهُ فَقُلْنَا لَهُ تَعَالَ يَسْتَغْفِرْ لَكَ رَسُولُ اللَّهِ صلى الله\n عليه وسلم فَقَالَ وَاللَّهِ لأَنْ أَجِدَ ضَالَّتِي أَحَبُّ إِلَىَّ مِنْ أَنْ يَسْتَغْفِرَ لِي صَاحِبُكُمْ ‏.‏ قَالَ وَكَانَ\n رَجُلٌ يَنْشُدُ ضَالَّةً لَهُ ‏.‏",
    "malay_translation": "Diriwayatkan oleh Ubaidullah bin Mu'az al-'Anbari, daripada bapanya, daripada Qurah bin Khalid, daripada Abu Zubair, daripada Jabir bin Abdullah, bahawa Rasulullah SAW bersabda:  \"Barangsiapa mendaki bukit Murar, nescaya dosanya akan diampunkan sebagaimana dosa Bani Israil diampunkan.\"  Kemudian, yang pertama mendakinya ialah pasukan berkuda daripada Bani Khazraj.  Setelah itu, ramai orang ramai datang.  Lalu Rasulullah SAW bersabda: \"Kamu semua telah diampunkan dosa kecuali pemilik unta merah.\"  Maka kami menghampirinya lalu berkata kepadanya: \"Marilah, supaya Rasulullah SAW memohon ampun untukmu.\"  Dia menjawab: \"Demi Allah, aku lebih suka mendapatkan kembali barang yang hilang daripada Rasulullah SAW memohon ampun untukku.\"  Dan dia terus mencari barangnya yang hilang."
  },
  {
    "id": 14142,
    "hadith_number": 6865,
    "tajuk_hadith": "Menaiki Bukit Murar",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "He who would climb this hill of Murar. The rest of the hadith is the same but with this variation that it was a desert Arab who was finding out his lost thing.",
    "arabic_text": "وَحَدَّثَنَاهُ يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا قُرَّةُ، حَدَّثَنَا \n أَبُو الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ يَصْعَدُ\n ثَنِيَّةَ الْمُرَارِ أَوِ الْمَرَارِ ‏\"‏ ‏.‏ بِمِثْلِ حَدِيثِ مُعَاذٍ غَيْرَ أَنَّهُ قَالَ وَإِذَا هُوَ أَعْرَابِيٌّ جَاءَ يَنْشُدُ\n ضَالَّةً لَهُ ‏.‏",
    "malay_translation": "Barangsiapa yang mendaki bukit Murar (atau Marar)...  (Baki hadis ini sama seperti hadis Mu'az, cuma dengan sedikit perbezaan iaitu ia menyebut seorang Arab Badwi yang sedang mencari barangnya yang hilang)."
  },
  {
    "id": 14143,
    "hadith_number": 6866,
    "tajuk_hadith": "Kisah Seorang Lelaki dari Bani Najjar",
    "perawi_melayu": "Anas bin Malik meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا أَبُو النَّضْرِ، حَدَّثَنَا سُلَيْمَانُ، - وَهُوَ ابْنُ الْمُغِيرَةِ\n - عَنْ ثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ مِنَّا رَجُلٌ مِنْ بَنِي النَّجَّارِ قَدْ قَرَأَ الْبَقَرَةَ وَآلَ\n عِمْرَانَ وَكَانَ يَكْتُبُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَانْطَلَقَ هَارِبًا حَتَّى لَحِقَ بِأَهْلِ الْكِتَابِ\n - قَالَ - فَرَفَعُوهُ قَالُوا هَذَا قَدْ كَانَ يَكْتُبُ لِمُحَمَّدٍ فَأُعْجِبُوا بِهِ فَمَا لَبِثَ أَنْ قَصَمَ اللَّهُ\n عُنُقَهُ فِيهِمْ فَحَفَرُوا لَهُ فَوَارَوْهُ فَأَصْبَحَتِ الأَرْضُ قَدْ نَبَذَتْهُ عَلَى وَجْهِهَا ثُمَّ عَادُوا فَحَفَرُوا\n لَهُ فَوَارَوْهُ فَأَصْبَحَتِ الأَرْضُ قَدْ نَبَذَتْهُ عَلَى وَجْهِهَا ثُمَّ عَادُوا فَحَفَرُوا لَهُ فَوَارَوْهُ فَأَصْبَحَتِ\n الأَرْضُ قَدْ نَبَذَتْهُ عَلَى وَجْهِهَا فَتَرَكُوهُ مَنْبُوذًا ‏.‏",
    "malay_translation": "Muhammad bin Rafi' meriwayatkan daripada Abu Nadhr, yang meriwayatkan daripada Sulaiman (ibn al-Mughirah) daripada Tsabit, daripada Anas bin Malik yang berkata: “Di kalangan kami ada seorang lelaki daripada Bani Najjar yang telah membaca Surah al-Baqarah dan Ali Imran, dan dia menulis untuk Rasulullah SAW.  Kemudian dia melarikan diri sehingga sampai kepada Ahli Kitab. Mereka memuliakannya dan berkata, ‘Inilah orang yang menulis untuk Muhammad.’ Mereka kagum kepadanya.  Tidak lama kemudian Allah mencabut nyawanya di sana. Mereka menggali kubur untuknya dan menguruskan pengebumiannya, tetapi tanah menolaknya ke permukaan. Mereka menggali semula dan menguburkannya, tetapi tanah menolaknya semula ke permukaan. Mereka menggali lagi dan menguburkannya, tetapi tanah menolaknya semula ke permukaan. Akhirnya, mereka membiarkannya begitu sahaja tanpa dikebumikan.”"
  },
  {
    "id": 14144,
    "hadith_number": 6867,
    "tajuk_hadith": "Angin Kencang dan Kematian Seorang Munafik",
    "perawi_melayu": "Jabir",
    "english_text": "This wind has perhaps been made to blow for the death of a hypocrite, and as he reached Medina a notorious hypocrite from amongst the hypocrites had died.",
    "arabic_text": "حَدَّثَنِي أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا حَفْصٌ، - يَعْنِي ابْنَ غِيَاثٍ - عَنِ الأَعْمَشِ،\n عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدِمَ مِنْ سَفَرٍ فَلَمَّا كَانَ\n قُرْبَ الْمَدِينَةِ هَاجَتْ رِيحٌ شَدِيدَةٌ تَكَادُ أَنْ تَدْفِنَ الرَّاكِبَ فَزَعَمَ أَنَّ رَسُولَ اللَّهِ صلى الله\n عليه وسلم قَالَ ‏\n\"‏ بُعِثَتْ هَذِهِ الرِّيحُ لِمَوْتِ مُنَافِقٍ ‏\"‏ ‏.‏ فَلَمَّا قَدِمَ الْمَدِينَةَ فَإِذَا مُنَافِقٌ عَظِيمٌ\n مِنَ الْمُنَافِقِينَ قَدْ مَاتَ ‏.‏",
    "malay_translation": "Jabir meriwayatkan bahawa Rasulullah SAW  kembali dari perjalanan.  Apabila baginda hampir sampai ke Madinah,  bertiuplah angin kencang yang hampir-hampir menimbus orang yang menunggang.  Rasulullah SAW  bersabda:  \"Angin ini ditiupkan kerana kematian seorang munafik.\"  Setelah baginda tiba di Madinah,  didapati seorang munafik yang terkenal di kalangan munafik telah meninggal dunia."
  },
  {
    "id": 14145,
    "hadith_number": 6868,
    "tajuk_hadith": "Demam yang Lebih Berat pada Hari Kiamat",
    "perawi_melayu": "Iyas meriwayatkan daripada bapanya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي عَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، حَدَّثَنَا أَبُو مُحَمَّدٍ النَّضْرُ بْنُ مُحَمَّدِ بْنِ،\n مُوسَى الْيَمَامِيُّ حَدَّثَنَا عِكْرِمَةُ، حَدَّثَنَا إِيَاسٌ، حَدَّثَنِي أَبِي قَالَ، عُدْنَا مَعَ رَسُولِ اللَّهِ صلى\n الله عليه وسلم رَجُلاً مَوْعُوكًا - قَالَ - فَوَضَعْتُ يَدِي عَلَيْهِ فَقُلْتُ وَاللَّهِ مَا رَأَيْتُ كَالْيَوْمِ\n رَجُلاً أَشَدَّ حَرًّا ‏.‏ فَقَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَلاَ أُخْبِرُكُمْ بِأَشَدَّ حَرًّا مِنْهُ يَوْمَ\n الْقِيَامَةِ هَذَيْنِكَ الرَّجُلَيْنِ الرَّاكِبَيْنِ الْمُقَفِّيَيْنِ ‏\"‏ ‏.‏ لِرَجُلَيْنِ حِينَئِذٍ مِنْ أَصْحَابِهِ ‏.‏",
    "malay_translation": "Abbas bin Abd al-Azim al-Anbari telah meriwayatkan daripada Abu Muhammad Nadhr bin Muhammad bin Musa al-Yamami, yang meriwayatkan daripada Ikrimah, yang meriwayatkan daripada Iyas, yang meriwayatkan daripada bapanya yang berkata: Kami telah mengunjungi seorang lelaki yang sedang demam bersama Rasulullah SAW.  Aku meletakkan tanganku ke atasnya dan berkata: Demi Allah, aku tidak pernah melihat seorang lelaki yang lebih panas demamnya seperti hari ini.  Maka Nabi SAW bersabda: \"Tidakkah aku beritahu kamu akan demam yang lebih hebat daripadanya pada hari kiamat? Iaitu kedua-dua lelaki yang menunggang unta ini yang tertinggal di belakang.\"  (Beliau merujuk kepada dua orang sahabatnya ketika itu)."
  },
  {
    "id": 14146,
    "hadith_number": 6869,
    "tajuk_hadith": "Perumpamaan Orang Munafik",
    "perawi_melayu": "Ibn Umar meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The similitude of a hypocrite is that of a sheep which roams aimlessly between two flocks. She goes to one at one time and to the other at another time.",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،\n حَدَّثَنَا أَبُو أُسَامَةَ، قَالاَ حَدَّثَنَا عُبَيْدُ اللَّهِ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، - وَاللَّفْظُ لَهُ - أَخْبَرَنَا \n عَبْدُ الْوَهَّابِ، - يَعْنِي الثَّقَفِيَّ - حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى\n الله عليه وسلم قَالَ ‏\n\"‏ مَثَلُ الْمُنَافِقِ كَمَثَلِ الشَّاةِ الْعَائِرَةِ بَيْنَ الْغَنَمَيْنِ تَعِيرُ إِلَى هَذِهِ مَرَّةً\n وَإِلَى هَذِهِ مَرَّةً ‏\"‏ ‏.‏",
    "malay_translation": "Perumpamaan orang munafik adalah seperti seekor kambing biri-biri yang mengembara tanpa hala tuju di antara dua kumpulan kambing.  Ia pergi kepada kumpulan yang satu pada satu masa, dan kepada kumpulan yang lain pada masa yang lain."
  },
  {
    "id": 14147,
    "hadith_number": 6870,
    "tajuk_hadith": "Kambing Yang Berpindah-randah",
    "perawi_melayu": "Ibnu Umar meriwayatkan bahawa Rasulullah SAW bersabda dengan maksud yang sama, tetapi dengan perubahan kata-kata:",
    "english_text": "\" She sometimes finds a way in one flock and then in another flock.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ - عَنْ \n مُوسَى بْنِ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ غَيْرَ أَنَّهُ\n قَالَ ‏\n\"‏ تَكِرُّ فِي هَذِهِ مَرَّةً وَفِي هَذِهِ مَرَّةً ‏\"‏ ‏.‏",
    "malay_translation": "Ibnu Umar meriwayatkan bahawa Rasulullah SAW bersabda:  “Kadang-kadang ia (kambing betina) masuk ke dalam satu kumpulan, kemudian ke kumpulan yang lain.”"
  }
]
