[
  {
    "id": 12989,
    "hadith_number": 5712,
    "tajuk_hadith": "Allah SWT sebagai Dahr (Masa)",
    "perawi_melayu": "Abu Hurairah meriwayatkan:",
    "english_text": "I heard Allah's Messenger (ﷺ) as saying: Allah, the Exalted and Glorious, said: The son of Adam abuses Dahr (the time), whereas I am Dahr since in My hand are the day and the night.",
    "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ وَحَرْمَلَةُ بْنُ يَحْيَى قَالاَ أَخْبَرَنَا \n ابْنُ وَهْبٍ، حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ قَالَ أَبُو\n هُرَيْرَةَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ قَالَ اللَّهُ عَزَّ وَجَلَّ يَسُبُّ ابْنُ آدَمَ\n الدَّهْرَ وَأَنَا الدَّهْرُ بِيَدِيَ اللَّيْلُ وَالنَّهَارُ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda: Allah SWT berfirman: Anak Adam melaknat Dahr (masa), sedangkan Akulah Dahr, kerana di tangan-Ku siang dan malam."
  },
  {
    "id": 12990,
    "hadith_number": 5713,
    "tajuk_hadith": "Allah SWT dan Keluhan Manusia Mengenai Masa",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Allah, the Exalted and Glorious, said: The son of Adam displeases Me by abusing Dahr (time), whereas I am Dahr--I alternate the night and the day.",
    "arabic_text": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ، - وَاللَّفْظُ لاِبْنِ أَبِي عُمَرَ - قَالَ\n إِسْحَاقُ أَخْبَرَنَا وَقَالَ ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ أَبِي،\n هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ قَالَ اللَّهُ عَزَّ وَجَلَّ يُؤْذِينِي ابْنُ آدَمَ\n يَسُبُّ الدَّهْرَ وَأَنَا الدَّهْرُ أُقَلِّبُ اللَّيْلَ وَالنَّهَارَ ‏\"‏ ‏.‏",
    "malay_translation": "Allah SWT berfirman: Anak Adam menyakitiKu dengan mengutuk Dahr (masa), sedangkan Akulah Dahr – Akulah yang mengganti siang dan malam."
  },
  {
    "id": 12991,
    "hadith_number": 5714,
    "tajuk_hadith": "Allah SWT Merasa Terluka dengan Ungkapan 'Wahai Kehancuran Masa'",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Allah, the Exalted and Glorious, said: The son of Adam causes Me pain as he says: Woe be upon the Time. None of you should say this: Woe be upon the Time, as I am the Time (because) I alternate the day and the night, and when I wish I can finish them up.",
    "arabic_text": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ،\n الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ قَالَ اللَّهُ عَزَّ وَجَلَّ\n يُؤْذِينِي ابْنُ آدَمَ يَقُولُ يَا خَيْبَةَ الدَّهْرِ ‏.‏ فَلاَ يَقُولَنَّ أَحَدُكُمْ يَا خَيْبَةَ الدَّهْرِ ‏.‏ فَإِنِّي أَنَا الدَّهْرُ\n أُقَلِّبُ لَيْلَهُ وَنَهَارَهُ فَإِذَا شِئْتُ قَبَضْتُهُمَا ‏\"‏ ‏.‏",
    "malay_translation": "Allah SWT berfirman: Anak Adam menyakitiKu dengan ucapannya, ‘Wahai kehancuran masa!’  Janganlah sesiapa di antara kamu berkata, ‘Wahai kehancuran masa!’, kerana Akulah masa; Aku yang menggantikan siang dan malam, dan apabila Aku kehendaki, Aku akan mengakhirinya."
  },
  {
    "id": 12992,
    "hadith_number": 5715,
    "tajuk_hadith": "Jangan Mengutuk Masa",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "None of you should say: Woe be upon the Time, for verily Allah is the Time.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ \n أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَقُولَنَّ أَحَدُكُمْ يَا خَيْبَةَ الدَّهْرِ\n ‏.‏ فَإِنَّ اللَّهَ هُوَ الدَّهْرُ ‏\"‏ ‏.‏",
    "malay_translation": "Jangan sesiapa di antara kamu berkata: “Celaka masa!”, kerana sesungguhnya Allah jualah Masa itu."
  },
  {
    "id": 12993,
    "hadith_number": 5716,
    "tajuk_hadith": "Jangan Mencela Masa",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Do not curse Time, for it is Allah Who is Time.",
    "arabic_text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ هِشَامٍ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ،\n عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَسُبُّوا الدَّهْرَ فَإِنَّ اللَّهَ هُوَ الدَّهْرُ ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah kamu mencela masa, kerana Allah jualah masa itu."
  },
  {
    "id": 12994,
    "hadith_number": 5717,
    "tajuk_hadith": "Larangan Mencela Masa dan Menggunakan Istilah 'Karm'",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "None of you should abuse Time for it is Allah Who is the Time, and none of you should call 'Inab (grape) as al-karm, for karm is a Muslim person.",
    "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، عَنِ ابْنِ،\n سِيرِينَ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَسُبُّ أَحَدُكُمُ الدَّهْرَ\n فَإِنَّ اللَّهَ هُوَ الدَّهْرُ وَلاَ يَقُولَنَّ أَحَدُكُمْ لِلْعِنَبِ الْكَرْمَ ‏.‏ فَإِنَّ الْكَرْمَ الرَّجُلُ الْمُسْلِمُ ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah sesiapa di antara kamu mencela masa, kerana Allah jualah masa itu. Dan janganlah sesiapa di antara kamu memanggil anggur dengan nama 'karm', kerana 'karm' itu merujuk kepada lelaki Muslim."
  },
  {
    "id": 12995,
    "hadith_number": 5718,
    "tajuk_hadith": "Jangan Gunakan Perkataan 'Karm'",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Do not use the word karm (for wine) for worthy of respect is the heart of a believer.",
    "arabic_text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَابْنُ أَبِي عُمَرَ، قَالاَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ،\n عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَقُولُوا كَرْمٌ ‏.‏ فَإِنَّ الْكَرْمَ قَلْبُ\n الْمُؤْمِنِ ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah kamu menggunakan perkataan \"karm\" (untuk arak), kerana yang mulia dan dihormati ialah hati orang mukmin."
  },
  {
    "id": 12996,
    "hadith_number": 5719,
    "tajuk_hadith": "Jangan Panggil Anggur Sebagai 'Karm'",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "Do not name grape as karm, for worthy of respect is a Muslim.",
    "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ هِشَامٍ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ،\n عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تُسَمُّوا الْعِنَبَ الْكَرْمَ فَإِنَّ الْكَرْمَ الرَّجُلُ الْمُسْلِمُ\n ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah kamu memanggil anggur sebagai 'karm', kerana 'karm' (yang sebenarnya) ialah lelaki Muslim yang mulia."
  },
  {
    "id": 12997,
    "hadith_number": 5720,
    "tajuk_hadith": "Jangan Menggunakan Perkataan 'Al-Karm' untuk Hati Seorang Mukmin",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "None of you should use the word al-harin (for grape) for the heart of a believer is karm (worthy of respect).",
    "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَلِيُّ بْنُ حَفْصٍ، حَدَّثَنَا وَرْقَاءُ، عَنْ أَبِي الزِّنَادِ، عَنِ \n الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَقُولَنَّ أَحَدُكُمُ الْكَرْمُ\n ‏.‏ فَإِنَّمَا الْكَرْمُ قَلْبُ الْمُؤْمِنِ ‏\"‏ ‏.‏",
    "malay_translation": "Jangan sesiapa di antara kamu menggunakan perkataan al-karm (untuk anggur), kerana sesungguhnya al-karm itu adalah hati orang yang beriman."
  },
  {
    "id": 12998,
    "hadith_number": 5721,
    "tajuk_hadith": "Jangan Panggil Anggur sebagai Al-Karm",
    "perawi_melayu": "Abu Hurairah meriwayatkan daripada Rasulullah SAW pelbagai hadis, antaranya sabdanya:",
    "english_text": "None of you should use the word al-karm for 'Inab, for karm (worthy of respect) is a Muslim person.",
    "arabic_text": "وَحَدَّثَنَا ابْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا\n مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَقُولَنَّ أَحَدُكُمْ لِلْعِنَبِ الْكَرْمَ ‏.‏ إِنَّمَا الْكَرْمُ الرَّجُلُ الْمُسْلِمُ\n ‏\"‏ ‏.‏",
    "malay_translation": "Jangan sesiapa di antara kamu memanggil anggur dengan perkataan al-karm.  Sesungguhnya al-karm (yang mulia/dihormati) ialah orang Islam."
  },
  {
    "id": 12999,
    "hadith_number": 5722,
    "tajuk_hadith": "Gunakan Perkataan \"Al-Habalah\" untuk Anggur",
    "perawi_melayu": "Alqama bin Wa'il meriwayatkan daripada bapanya, Rasulullah SAW bersabda:",
    "english_text": "Do not say al-karm (for the word vine) but say al-habala (that is grape).",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عِيسَى، - يَعْنِي ابْنَ يُونُسَ - عَنْ شُعْبَةَ، عَنْ سِمَاكِ،\n بْنِ حَرْبٍ عَنْ عَلْقَمَةَ بْنِ وَائِلٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَقُولُوا\n الْكَرْمُ ‏.‏ وَلَكِنْ قُولُوا الْحَبَلَةُ ‏\"‏ ‏.‏ يَعْنِي الْعِنَبَ ‏.‏",
    "malay_translation": "Janganlah kamu mengatakan al-karm (untuk pokok anggur), tetapi katakanlah al-habalah (iaitu buah anggur)."
  },
  {
    "id": 13000,
    "hadith_number": 5723,
    "tajuk_hadith": "Larangan Menggunakan Perkataan 'Al-Karm'",
    "perawi_melayu": "Alqama bin Wa'il melalui bapanya (daripada sanad yang berbeza dengan sedikit perbezaan lafaz)",
    "english_text": "This hadith has been reported by Alqama b. Wa'il on the authority of his father with a different chain of transmitters and with a slight variation of wording.",
    "arabic_text": "وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكٍ، قَالَ\n سَمِعْتُ عَلْقَمَةَ بْنَ وَائِلٍ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَقُولُوا الْكَرْمُ ‏.‏\n وَلَكِنْ قُولُوا الْعِنَبُ وَالْحَبَلَةُ ‏\"‏ ‏.‏",
    "malay_translation": "Zuhri bin Harb telah meriwayatkan kepadaku, Usman bin Umar telah meriwayatkan kepada kami, Syu'bah telah meriwayatkan kepada kami daripada Simaak, katanya: Aku telah mendengar Alqamah bin Wa'il daripada bapanya bahawa Nabi SAW bersabda:  \"Janganlah kamu mengatakan 'al-karm', tetapi katakanlah 'al-'inab' dan 'al-habalah'\". "
  },
  {
    "id": 13001,
    "hadith_number": 5724,
    "tajuk_hadith": "Gelaran Hamba dan Pembeda",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "None of you should say: My bondman and my slave-girl, for all of you are the bondmen of Allah, and all your women are the slave-girls of Allah; but say: My servant, my girl, and my young man and my young girl.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ\n جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ\n ‏\n\"‏ لاَ يَقُولَنَّ أَحَدُكُمْ عَبْدِي وَأَمَتِي ‏.‏ كُلُّكُمْ عَبِيدُ اللَّهِ وَكُلُّ نِسَائِكُمْ إِمَاءُ اللَّهِ وَلَكِنْ لِيَقُلْ غُلاَمِي\n وَجَارِيَتِي وَفَتَاىَ وَفَتَاتِي ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah sesiapa di antara kamu berkata: \"hambaku lelaki dan hambaku perempuan\", kerana kamu semua adalah hamba Allah, dan semua wanita kamu adalah hamba Allah.  Tetapi hendaklah kamu berkata: \"pelayan lelakiku\", \"pelayan perempuanku\", \"anak mudaku lelaki\", dan \"anak mudaku perempuan\"."
  },
  {
    "id": 13002,
    "hadith_number": 5725,
    "tajuk_hadith": "Larangan Menggunakan Gelaran 'Hamba'",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "None of you should say: My bondman, for all of you are the bondmen of Allah, but say: My young man, and the servant should not say: My Lord, but should say: My chief.",
    "arabic_text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي،\n هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَقُولَنَّ أَحَدُكُمْ عَبْدِي ‏.‏ فَكُلُّكُمْ عَبِيدُ\n اللَّهِ وَلَكِنْ لِيَقُلْ فَتَاىَ ‏.‏ وَلاَ يَقُلِ الْعَبْدُ رَبِّي ‏.‏ وَلَكِنْ لِيَقُلْ سَيِّدِي ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah sesiapa di antara kamu berkata: \"hambaku\". Kerana kamu semua adalah hamba Allah. Sebaliknya, katakanlah: \"pemuda saya\". Dan janganlah hamba berkata: \"Tuhanku\", tetapi hendaklah dia berkata: \"Tuan saya\"."
  },
  {
    "id": 13003,
    "hadith_number": 5726,
    "tajuk_hadith": "Larangan Hamba Mengatakan 'Tuanku' kepada Tuannya",
    "perawi_melayu": "Hadis ini diriwayatkan daripada al-A'mash dengan sanad yang sama, dan lafaznya ialah bahawa seorang hamba tidak sepatutnya berkata kepada tuannya:",
    "english_text": "My Lord, and Abu Mu'awiya made an addition:\" For it is Allah, the Exalted and Glorious, Who is your Lord.\"",
    "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا \n أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا وَكِيعٌ، كِلاَهُمَا عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ وَفِي حَدِيثِهِمَا ‏\"‏ وَلاَ\n يَقُلِ الْعَبْدُ لِسَيِّدِهِ مَوْلاَىَ ‏\"‏ ‏.‏ وَزَادَ فِي حَدِيثِ أَبِي مُعَاوِيَةَ ‏\"‏ فَإِنَّ مَوْلاَكُمُ اللَّهُ عَزَّ وَجَلَّ ‏\"‏\n ‏.‏",
    "malay_translation": "Dan telah menceritakan kepada kami Abu Bakar bin Abi Syaibah, dan Abu Kuraib berkata, telah menceritakan kepada kami Abu Muawiyah, dan telah menceritakan kepada kami Abu Said al-Asyaj, telah menceritakan kepada kami Waki’, kedua-duanya daripada al-A’mash, dengan sanad ini.  Dalam hadis mereka: “Dan janganlah hamba berkata kepada tuannya, ‘Tuanku’.” Dan tambahan dalam hadis Abu Muawiyah: “Kerana sesungguhnya Tuhan kamu ialah Allah SWT.”"
  },
  {
    "id": 13004,
    "hadith_number": 5727,
    "tajuk_hadith": "Larangan Menggunakan Gelaran 'Tuan' dan 'Hamba' kepada Allah",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW telah meriwayatkan banyak hadis, dan salah satunya adalah hadis ini yang menyatakan bahawa Rasulullah SAW bersabda:",
    "english_text": "None of you should say: Supply drink to your lord, feed your lord, help your lord in performing ablution, and none of you should say: My Lord. He should say: My chief, my patron; and none of you should say: My bondman, my slave-girl, but simply say: My boy, my girl, my servant.",
    "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ\n هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَقُلْ أَحَدُكُمُ اسْقِ رَبَّكَ أَطْعِمْ رَبَّكَ وَضِّئْ رَبَّكَ ‏.‏ وَلاَ\n يَقُلْ أَحَدُكُمْ رَبِّي ‏.‏ وَلْيَقُلْ سَيِّدِي مَوْلاَىَ وَلاَ يَقُلْ أَحَدُكُمْ عَبْدِي أَمَتِي ‏.‏ وَلْيَقُلْ فَتَاىَ فَتَاتِي\n غُلاَمِي ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah sesiapa di antara kamu berkata: Berikan minuman kepada Tuhanmu, beri makan kepada Tuhanmu, tolong Tuhanmu dalam berwuduk. Dan janganlah sesiapa di antara kamu berkata: Tuhanku.  Hendaklah dia berkata: Tuhanku, pelindungku. Dan janganlah sesiapa di antara kamu berkata: Hamba lelakiku, hamba perempuanku.  Hendaklah dia berkata: Pembantuku lelaki, pembantuku perempuan, hambaku."
  },
  {
    "id": 13005,
    "hadith_number": 5728,
    "tajuk_hadith": "Jangan Katakan Jiwa Saya Jahat, Tetapi Jiwa Saya Keras",
    "perawi_melayu": "Aisyah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "None of you should say: \"My soul has become evil,\" but he should say: \"My soul has become remorseless.\" This hadith has been transmitted on the authority of Abu Bakr with a slight variation of wording.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ\n بْنُ الْعَلاَءِ حَدَّثَنَا أَبُو أُسَامَةَ، كِلاَهُمَا عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ يَقُولَنَّ أَحَدُكُمْ خَبُثَتْ نَفْسِي ‏.‏ وَلَكِنْ لِيَقُلْ لَقِسَتْ نَفْسِي ‏\"‏ ‏.‏\n هَذَا حَدِيثُ أَبِي كُرَيْبٍ وَقَالَ أَبُو بَكْرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَلَمْ يَذْكُرْ ‏\"‏ لَكِنْ\n ‏\"‏ ‏.‏",
    "malay_translation": "Jangan sesiapa di antara kamu berkata: \"Jiwa saya telah menjadi jahat,\" tetapi hendaklah dia berkata: \"Jiwa saya telah menjadi keras.\"  Hadis ini diriwayatkan daripada Abu Bakar dengan sedikit perbezaan lafaz."
  },
  {
    "id": 13006,
    "hadith_number": 5729,
    "tajuk_hadith": "Hadis daripada Abi Muawiyah dengan Sanad yang Sama",
    "perawi_melayu": "Abu Kuraib melalui Abi Muawiyah",
    "english_text": "This hadith has been narrated on the authority of Abia Mu'iwiya with the same chain of transmitters.",
    "arabic_text": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، بِهَذَا الإِسْنَادِ ‏.‏",
    "malay_translation": "Hadis ini diriwayatkan daripada Abi Muawiyah melalui sanad yang sama."
  },
  {
    "id": 13007,
    "hadith_number": 5730,
    "tajuk_hadith": "Jangan Mengatakan Jiwa Menjadi Jahat",
    "perawi_melayu": "Abu Umamah bin Sahl bin Hunayf, daripada bapanya, meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "None of you should say:\" My soul has become evil,\" but he should say:\" My soul has become remorseless.\"",
    "arabic_text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ،\n شِهَابٍ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم\n قَالَ ‏\n\"‏ لاَ يَقُلْ أَحَدُكُمْ خَبُثَتْ نَفْسِي ‏.‏ وَلْيَقُلْ لَقِسَتْ نَفْسِي ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah sesiapa di antara kamu berkata: \"Jiwa ku telah menjadi jahat.\" Tetapi hendaklah dia berkata: \"Jiwa ku telah menjadi keras (tidak mahu menerima kebenaran/pedih).\""
  },
  {
    "id": 13008,
    "hadith_number": 5731,
    "tajuk_hadith": "Wanita Bani Israil yang Rendah Perawakan",
    "perawi_melayu": "Abu Said al-Khudri meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ شُعْبَةَ، حَدَّثَنِي خُلَيْدُ بْنُ جَعْفَرٍ،\n عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ كَانَتِ امْرَأَةٌ\n مِنْ بَنِي إِسْرَائِيلَ قَصِيرَةٌ تَمْشِي مَعَ امْرَأَتَيْنِ طَوِيلَتَيْنِ فَاتَّخَذَتْ رِجْلَيْنِ مِنْ خَشَبٍ وَخَاتَمًا\n مِنْ ذَهَبٍ مُغْلَقٍ مُطْبَقٍ ثُمَّ حَشَتْهُ مِسْكًا وَهُوَ أَطْيَبُ الطِّيبِ فَمَرَّتْ بَيْنَ الْمَرْأَتَيْنِ فَلَمْ يَعْرِفُوهَا\n فَقَالَتْ بِيَدِهَا هَكَذَا ‏\"‏ ‏.‏ وَنَفَضَ شُعْبَةُ يَدَهُ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Bakar bin Abi Syaibah, telah menceritakan kepada kami Abu Usamah, dari Syu’bah, telah menceritakan kepadaku Khalid bin Ja’far,\n dari Abi Nadroh, dari Abu Said al-Khudri, dari Nabi SAW, Baginda bersabda:\n\"Dahulu ada seorang wanita daripada Bani Israil yang pendek. Dia berjalan di antara dua orang wanita yang tinggi.  Dia memakai kaki palsu daripada kayu dan cincin emas yang tertutup rapat. Kemudian dia mengisinya dengan minyak kasturi, kerana ia adalah minyak wangi yang paling harum. Dia berjalan di antara dua orang wanita itu, lalu mereka tidak mengenali dia.\nKemudian dia memberi isyarat dengan tangannya begini.\"  Lalu Syu’bah menggoyangkan tangannya untuk menunjukkan bagaimana wanita itu menggoyangkan tangannya."
  },
  {
    "id": 13009,
    "hadith_number": 5732,
    "tajuk_hadith": "Wanita Bani Israel dan Wangian Kasturi",
    "perawi_melayu": "Abu Sa'id al-Khudri",
    "english_text": "Abu Sa'id Khudri reported that Allah's Messenger (ﷺ) made a mention of a woman of Bana Isra'il who had filled her ring with musk and musk is the most fragrant of the scents.",
    "arabic_text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ شُعْبَةَ، عَنْ خُلَيْدِ بْنِ جَعْفَرٍ، وَالْمُسْتَمِرِّ،\n قَالاَ سَمِعْنَا أَبَا نَضْرَةَ، يُحَدِّثُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم\n ذَكَرَ امْرَأَةً مِنْ بَنِي إِسْرَائِيلَ حَشَتْ خَاتَمَهَا مِسْكًا وَالْمِسْكُ أَطْيَبُ الطِّيبِ ‏.‏",
    "malay_translation": "Abu Said al-Khudri meriwayatkan bahawa Rasulullah SAW menceritakan tentang seorang wanita Bani Israel yang telah mengisi cincinnya dengan kasturi, dan kasturi adalah wangian yang paling harum."
  },
  {
    "id": 13010,
    "hadith_number": 5733,
    "tajuk_hadith": "Menerima Kebaikan",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "He who is presented with a flower should not reject it, for it is light to carry and pleasant in odour.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، كِلاَهُمَا عَنِ الْمُقْرِئِ، قَالَ أَبُو بَكْرٍ\n حَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ الْمُقْرِئُ، عَنْ سَعِيدِ بْنِ أَبِي أَيُّوبَ، حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ أَبِي جَعْفَرٍ،\n عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏\n مَنْ عُرِضَ عَلَيْهِ رَيْحَانٌ فَلاَ يَرُدُّهُ فَإِنَّهُ خَفِيفُ الْمَحْمِلِ طَيِّبُ الرِّيحِ ‏\"‏ ‏.‏",
    "malay_translation": "Barang siapa yang diberi sesuatu kebaikan, maka janganlah ditolaknya, kerana ia ringan untuk dibawa dan harum baunya."
  },
  {
    "id": 13011,
    "hadith_number": 5734,
    "tajuk_hadith": "Cara Rasulullah SAW melakukan penyemburan wangi-wangian",
    "perawi_melayu": "Nafi' meriwayatkan bahawa apabila Ibnu Umar hendak melakukan penyemburan wangi-wangian, baginda menggunakan kayu aloewood tanpa mencampurkan apa-apa, atau baginda mencampurkan kapur barus bersama kayu aloewood, kemudian berkata:",
    "english_text": "This is how Allah's Messenger (ﷺ) fumigated.",
    "arabic_text": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، وَأَبُو طَاهِرٍ وَأَحْمَدُ بْنُ عِيسَى قَالَ أَحْمَدُ حَدَّثَنَا \n وَقَالَ الآخَرَانِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَخْرَمَةُ، عَنْ أَبِيهِ، عَنْ نَافِعٍ، قَالَ كَانَ ابْنُ عُمَرَ\n إِذَا اسْتَجْمَرَ اسْتَجْمَرَ بِالأَلُوَّةِ غَيْرِ مُطَرَّاةٍ وَبِكَافُورٍ يَطْرَحُهُ مَعَ الأَلُوَّةِ ثُمَّ قَالَ هَكَذَا كَانَ\n يَسْتَجْمِرُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Nafi' meriwayatkan bahawa Ibnu Umar jika melakukan penyemburan wangi-wangian, baginda menggunakan kayu aloewood tanpa dicampur dengan apa-apa, atau baginda mencampurkan kapur barus bersama kayu aloewood, kemudian berkata:  \"Beginilah cara Rasulullah SAW melakukan penyemburan wangi-wangian.\""
  }
]
