[
  {
    "id": 28143,
    "hadith_number": 2363,
    "tajuk_hadith": "Sebaik-baik Saksi Memberi Keterangan Sebelum Diminta",
    "perawi_melayu": "Zaid bin Khalid Al-Juhani meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Shall l not inform you of the best of witnesses? The one who comes with his testimony before being asked for it.\"",
    "arabic_text": "حَدَّثَنَا الأَنْصَارِيُّ، حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عُثْمَانَ، عَنْ أَبِي عَمْرَةَ الأَنْصَارِيِّ، عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَلاَ أُخْبِرُكُمْ بِخَيْرِ الشُّهَدَاءِ الَّذِي يَأْتِي بِالشَّهَادَةِ قَبْلَ أَنْ يُسْأَلَهَا ‏\"‏ ‏.‏",
    "malay_translation": "“Mahukah aku khabarkan kepada kamu tentang sebaik-baik saksi? Iaitu orang yang datang dengan kesaksiannya sebelum diminta untuk memberikan kesaksian tersebut.”"
  },
  {
    "id": 28144,
    "hadith_number": 2364,
    "tajuk_hadith": "Perbezaan Riwayat tentang Abdurrahman bin Abi 'Amrah",
    "perawi_melayu": "(Sanad lain) daripada Malik yang mana beliau berkata:",
    "english_text": "Ibn Abi 'Amrah.\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ الْحَسَنِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، نَحْوَهُ وَقَالَ ابْنُ أَبِي عَمْرَةَ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَأَكْثَرُ النَّاسِ يَقُولُونَ عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَمْرَةَ وَاخْتَلَفُوا عَلَى مَالِكٍ فِي رِوَايَةِ هَذَا الْحَدِيثِ فَرَوَى بَعْضُهُمْ عَنْ أَبِي عَمْرَةَ وَرَوَى بَعْضُهُمْ عَنِ ابْنِ أَبِي عَمْرَةَ وَهُوَ عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَمْرَةَ الأَنْصَارِيُّ وَهَذَا أَصَحُّ لأَنَّهُ قَدْ رُوِيَ مِنْ غَيْرِ حَدِيثِ مَالِكٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمْرَةَ عَنْ زَيْدِ بْنِ خَالِدٍ وَقَدْ رُوِيَ عَنِ ابْنِ أَبِي عَمْرَةَ عَنْ زَيْدِ بْنِ خَالِدٍ غَيْرُ هَذَا الْحَدِيثِ وَهُوَ حَدِيثٌ صَحِيحٌ أَيْضًا وَأَبُو عَمْرَةَ مَوْلَى زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ وَلَهُ حَدِيثُ الْغُلُولِ وَأَكْثَرُ النَّاسِ يَقُولُونَ عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَمْرَةَ ‏.‏",
    "malay_translation": "Ahmad bin al-Hasan meriwayatkan kepada kami, Abdullah bin Maslamah meriwayatkan kepada kami, daripada Malik, seumpamanya, dan Ibn Abi 'Amrah berkata: \"Ini adalah Hadith Hasan.\" Kebanyakan orang mengatakan Abdurrahman bin Abi 'Amrah dan mereka berselisih pendapat tentang riwayat ini daripada Malik. Sebahagian mereka meriwayatkan daripada Abi 'Amrah, dan sebahagian lagi meriwayatkan daripada Ibn Abi 'Amrah, dan dia adalah Abdurrahman bin Abi 'Amrah al-Ansari, dan ini adalah lebih sahih kerana ia telah diriwayatkan daripada hadith selain daripada Malik daripada Abdurrahman bin Abi 'Amrah daripada Zaid bin Khalid. Dan telah diriwayatkan daripada Ibn Abi 'Amrah daripada Zaid bin Khalid hadith lain selain daripada hadith ini, dan ia juga adalah hadith sahih. Abu 'Amrah adalah maula (hamba yang dimerdekakan) Zaid bin Khalid al-Juhani dan dia memiliki hadith tentang al-ghulul (penggelapan harta rampasan perang). Kebanyakan orang mengatakan Abdurrahman bin Abi 'Amrah."
  },
  {
    "id": 28145,
    "hadith_number": 2365,
    "tajuk_hadith": "Sebaik-baik Saksi Memberi Keterangan Sebelum Diminta",
    "perawi_melayu": "Zaid bin Khalid Al-Juhani meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "\"The best of witnesses is the one who gives his testimony before  being asked  for it.\"",
    "arabic_text": "حَدَّثَنَا بِشْرُ بْنُ آدَمَ ابْنُ بِنْتِ أَزْهَرَ السَّمَّانِ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، حَدَّثَنَا أُبَىُّ بْنُ عَبَّاسِ بْنِ سَهْلِ بْنِ سَعْدٍ، حَدَّثَنِي أَبُو بَكْرِ بْنُ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ عُثْمَانَ، حَدَّثَنِي خَارِجَةُ بْنُ زَيْدِ بْنِ ثَابِتٍ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَمْرَةَ، حَدَّثَنِي زَيْدُ بْنُ خَالِدٍ الْجُهَنِيُّ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ خَيْرُ الشُّهَدَاءِ مَنْ أَدَّى شَهَادَتَهُ قَبْلَ أَنْ يُسْأَلَهَا ‏\"‏ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏",
    "malay_translation": "\"Sebaik-baik saksi adalah orang yang memberikan kesaksiannya sebelum diminta untuk itu.\""
  },
  {
    "id": 28146,
    "hadith_number": 2366,
    "tajuk_hadith": "Penerimaan Kesaksian Orang Khianat, Pesalah Hudud, dan yang Mempunyai Permusuhan",
    "perawi_melayu": "Aishah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "The testimony of a treacherous man is not acceptable nor a treacherous woman nor a man lashed for the Hadd nor a woman lashed nor one possessing malice of enmity nor a rehearsed witness nor the Qani of (one contracted by)the family on their behalf nor the one associating himself to other than his Wala or to other than his  relatives.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ، عَنْ يَزِيدَ بْنِ زِيَادٍ الدِّمَشْقِيِّ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَجُوزُ شَهَادَةُ خَائِنٍ وَلاَ خَائِنَةٍ وَلاَ مَجْلُودٍ حَدًّا وَلاَ مَجْلُودَةٍ وَلاَ ذِي غِمْرٍ لأَخِيهِ وَلاَ مُجَرَّبِ شَهَادَةٍ وَلاَ الْقَانِعِ أَهْلَ الْبَيْتِ لَهُمْ وَلاَ ظَنِينٍ فِي وَلاَءٍ وَلاَ قَرَابَةٍ ‏\"‏ ‏.‏ قَالَ الْفَزَارِيُّ الْقَانِعُ التَّابِعُ ‏.‏ هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ يَزِيدَ بْنِ زِيَادٍ الدِّمَشْقِيِّ ‏.‏ وَيَزِيدُ يُضَعَّفُ فِي الْحَدِيثِ وَلاَ يُعْرَفُ هَذَا الْحَدِيِثُ مِنْ حَدِيثِ الزُّهْرِيِّ إِلاَّ مِنْ حَدِيثِهِ ‏.‏ وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ‏.‏ قَالَ وَلاَ نَعْرِفُ مَعْنَى هَذَا الْحَدِيثِ وَلاَ يَصِحُّ عِنْدِي مِنْ قِبَلِ إِسْنَادِهِ ‏.‏ وَالْعَمَلُ عِنْدَ أَهْلِ الْعِلْمِ فِي هَذَا أَنَّ شَهَادَةَ الْقَرِيبِ جَائِزَةٌ لِقَرَابَتِهِ ‏.‏ وَاخْتَلَفَ أَهْلُ الْعِلْمِ فِي شَهَادَةِ الْوَالِدِ لِلْوَلَدِ وَالْوَلَدِ لِوَالِدِهِ وَلَمْ يُجِزْ أَكْثَرُ أَهْلِ الْعِلْمِ شَهَادَةَ الْوَالِدِ لِلْوَلَدِ وَلاَ الْوَلَدِ لِلْوَالِدِ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ إِذَا كَانَ عَدْلاً فَشَهَادَةُ الْوَالِدِ لِلْوَلَدِ جَائِزَةٌ وَكَذَلِكَ شَهَادَةُ الْوَلَدِ لِلْوَالِدِ ‏.‏ وَلَمْ يَخْتَلِفُوا فِي شَهَادَةِ الأَخِ لأَخِيهِ أَنَّهَا جَائِزَةٌ وَكَذَلِكَ شَهَادَةُ كُلِّ قَرِيبٍ لِقَرِيبِهِ ‏.‏ وَقَالَ الشَّافِعِيُّ لاَ تَجُوزُ شَهَادَةٌ لِرَجُلٍ عَلَى الآخَرِ وَإِنْ كَانَ عَدْلاً إِذَا كَانَتْ بَيْنَهُمَا عَدَاوَةٌ ‏.‏ وَذَهَبَ إِلَى حَدِيثِ عَبْدِ الرَّحْمَنِ الأَعْرَجِ عَنِ النَّبِيِّ صلى الله عليه وسلم مُرْسَلاً ‏\"‏ لاَ تَجُوزُ شَهَادَةُ صَاحِبِ إِحْنَةٍ ‏\"‏ ‏.‏ يَعْنِي صَاحِبَ عَدَاوَةٍ وَكَذَلِكَ مَعْنَى هَذَا الْحَدِيثِ حَيْثُ قَالَ ‏\"‏ لاَ تَجُوزُ شَهَادَةُ صَاحِبِ غِمْرٍ لأَخِيهِ ‏\"‏ يَعْنِي صَاحِبَ عَدَاوَةٍ ‏.‏",
    "malay_translation": "Kesaksian seorang lelaki yang khianat tidak diterima, begitu juga seorang wanita yang khianat, seorang lelaki yang disebat kerana kesalahan Hudud, seorang wanita yang disebat, seseorang yang mempunyai hasad dengki terhadap saudaranya, saksi yang dilatih, *Qani'* (orang yang dikontrak oleh) keluarga bagi pihak mereka, atau seseorang yang mengaitkan dirinya dengan selain *Wala'*nya atau selain daripada kerabatnya."
  },
  {
    "id": 28147,
    "hadith_number": 2367,
    "tajuk_hadith": "Kesaksian Palsu Setara dengan Syirik kepada Allah",
    "perawi_melayu": "Ayman bin Khuraim meriwayatkan bahawa Nabi (SAW) berdiri untuk menyampaikan Khutbah dan bersabda:",
    "english_text": "\"O you people False witness  is tantamount to Shirk with Allah\" Then the Messenger of Allah (s.a.w)recited: So shun the Rijs of the idols, and shun false speech.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، عَنْ سُفْيَانَ بْنِ زِيَادٍ الأَسَدِيِّ، عَنْ فَاتِكِ بْنِ فَضَالَةَ، عَنْ أَيْمَنَ بْنِ خُرَيْمٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَامَ خَطِيبًا فَقَالَ ‏\n\"‏ يَا أَيُّهَا النَّاسُ عُدِلَتْ شَهَادَةُ الزُّورِ إِشْرَاكًا بِاللَّهِ ‏\"‏ ‏.‏ ثُمَّ قَرَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏:‏ ‏(‏وَاجْتَنِبُوا الرِّجْسَ مِنَ الأَوْثَانِ وَاجْتَنِبُوا قَوْلَ الزُّورِ ‏)‏ ‏.‏ قَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ غَرِيبٌ إِنَّمَا نَعْرِفُهُ مِنْ حَدِيثِ سُفْيَانَ بْنِ زِيَادٍ وَاخْتَلَفُوا فِي رِوَايَةِ هَذَا الْحَدِيثِ عَنْ سُفْيَانَ بْنِ زِيَادٍ ‏.‏ وَلاَ نَعْرِفُ لأَيْمَنَ بْنِ خُرَيْمٍ سَمَاعًا مِنَ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "\"Wahai manusia, kesaksian palsu adalah setara dengan syirik kepada Allah.\" Kemudian Rasulullah (SAW) membaca: \"Oleh itu jauhilah kekotoran berhala, dan jauhilah perkataan dusta.\""
  },
  {
    "id": 28148,
    "hadith_number": 2368,
    "tajuk_hadith": "Larangan Memberikan Kesaksian Palsu Setara dengan Syirik",
    "perawi_melayu": "Khuraim bin Fatik Al-Asadi meriwayatkan bahawa Rasulullah SAW menunaikan solat Subuh. Kemudian ketika Baginda berpaling, Baginda berdiri dan bersabda:",
    "english_text": "\"O you people! False witness is tantamount to Shirk with Allah.\"Saying it three times, then he recited this Ayah And shun false speech Until the end of the Ayah.",
    "arabic_text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، حَدَّثَنَا سُفْيَانُ، وَهُوَ ابْنُ زِيَادٍ الْعُصْفُرِيُّ عَنْ أَبِيهِ، عَنْ حَبِيبِ بْنِ النُّعْمَانِ الأَسَدِيِّ، عَنْ خُرَيْمِ بْنِ فَاتِكٍ الأَسَدِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى صَلاَةَ الصُّبْحِ فَلَمَّا انْصَرَفَ قَامَ قَائِمًا فَقَالَ ‏\"‏ عُدِلَتْ شَهَادَةُ الزُّورِ بِالشِّرْكِ بِاللَّهِ ‏\"‏ ‏.‏ ثَلاَثَ مَرَّاتٍ ثُمَّ تَلاَ هَذِهِ الآيَةَ ‏(‏وَاجْتَنِبُوا قَوْلَ الزُّورِ ‏)‏ إِلَى آخِرِ الآيَةِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا عِنْدِي أَصَحُّ ‏.‏ وَخُرَيْمُ بْنُ فَاتِكٍ لَهُ صُحْبَةٌ وَقَدْ رَوَى عَنِ النَّبِيِّ صلى الله عليه وسلم أَحَادِيثَ وَهُوَ مَشْهُورٌ ‏.‏",
    "malay_translation": "\"Wahai manusia! Kesaksian palsu adalah sama dengan Syirik kepada Allah.\" Baginda mengatakannya tiga kali, kemudian Baginda membaca ayat ini: Dan jauhilah perkataan dusta (palsu) hingga akhir ayat."
  },
  {
    "id": 28149,
    "hadith_number": 2369,
    "tajuk_hadith": "Larangan Melakukan Dosa-Dosa Besar: Syirik, Derhaka Kepada Ibu Bapa, dan Saksi Palsu",
    "perawi_melayu": "'Abdur-Rahman bin Abi Bakrah meriwayatkan daripada ayahnya bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Shall I not inform you of the greatest of the major sins?\" They said: \"Of course O Messenger of Allah(s.a.w)!\" He said: \"Shirk with Allah disobeying parents, and false testimony.\" Or: \"False speech\" He said: \"So the Messenger of Allah(s.a.w) would not stop saying it until we said ( to ourselves): 'I wish he would  be quiet. \"",
    "arabic_text": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنِ الْجُرَيْرِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ أَلاَ أُخْبِرُكُمْ بِأَكْبَرِ الْكَبَائِرِ ‏\"‏ ‏.‏ قَالُوا بَلَى يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ الإِشْرَاكُ بِاللَّهِ وَعُقُوقُ الْوَالِدَيْنِ وَشَهَادَةُ الزُّورِ أَوْ قَوْلُ الزُّورِ ‏\"‏ ‏.‏ قَالَ فَمَا زَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقُولُهَا حَتَّى قُلْنَا لَيْتَهُ سَكَتَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ‏.‏",
    "malay_translation": "\"Mahukah aku beritakan kepada kamu tentang dosa-dosa besar yang paling besar?\" Mereka berkata: \"Tentu wahai Rasulullah SAW!\" Baginda bersabda: \"Syirik kepada Allah, menderhaka kepada ibu bapa, dan kesaksian palsu.\" Atau: \"Perkataan palsu.\" Dia berkata: \"Rasulullah SAW terus mengulanginya sehingga kami berkata (dalam hati kami): 'Alangkah baiknya jika baginda diam.'\""
  },
  {
    "id": 28150,
    "hadith_number": 2370,
    "tajuk_hadith": "Sebaik-baik Manusia adalah Generasiku dan Generasi Selepasnya",
    "perawi_melayu": "'Imran bin Husain meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "\"The best of people are my generation, then those who follow them,then those who follow them, then those who follow them.\"(He(s.a.w)said that) three times. \"Then, after them a people will come who increase in fatness, loving fatness, giving testimony before they are asked for it.\"",
    "arabic_text": "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنِ الأَعْمَشِ، عَنْ عَلِيِّ بْنِ مُدْرِكٍ، عَنْ هِلاَلِ بْنِ يِسَافٍ، عَنْ عِمْرَانَ بْنِ حُصَيْنِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ خَيْرُ النَّاسِ قَرْنِي ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ ثَلاَثًا ثُمَّ يَجِيءُ قَوْمٌ مِنْ بَعْدِهِمْ يَتَسَمَّنُونَ وَيُحِبُّونَ السِّمَنَ يُعْطُونَ الشَّهَادَةَ قَبْلَ أَنْ يُسْأَلُوهَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ غَرِيبٌ مِنْ حَدِيثِ الأَعْمَشِ عَنْ عَلِيِّ بْنِ مُدْرِكٍ وَأَصْحَابُ الأَعْمَشِ إِنَّمَا رَوَوْا عَنِ الأَعْمَشِ عَنْ هِلاَلِ بْنِ يِسَافٍ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ ‏.‏",
    "malay_translation": "\"Sebaik-baik manusia adalah generasiku, kemudian mereka yang mengikuti mereka, kemudian mereka yang mengikuti mereka, kemudian mereka yang mengikuti mereka.\" (Baginda SAW bersabda demikian) sebanyak tiga kali. \"Kemudian, selepas mereka akan datang suatu kaum yang bertambah gemuk, mencintai kegemukan, memberikan kesaksian sebelum diminta untuknya.\""
  },
  {
    "id": 28151,
    "hadith_number": 2371,
    "tajuk_hadith": "Pemberian Kesaksian Palsu Tanpa Diminta",
    "perawi_melayu": "Imran bin Husain",
    "english_text": "Another chain on the authority of 'Imran bin Husain narrates a similar narration.",
    "arabic_text": "حَدَّثَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ، حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، حَدَّثَنَا هِلاَلُ بْنُ يِسَافٍ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏ وَهَذَا أَصَحُّ مِنْ حَدِيثِ مُحَمَّدِ بْنِ فُضَيْلٍ ‏.‏ قَالَ وَمَعْنَى هَذَا الْحَدِيثِ عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ ‏\"‏ يُعْطُونَ الشَّهَادَةَ قَبْلَ أَنْ يُسْأَلُوهَا ‏\"‏ ‏.‏ إِنَّمَا يَعْنِي شَهَادَةَ الزُّورِ يَقُولُ يَشْهَدُ أَحَدُهُمْ مِنْ غَيْرِ أَنْ يُسْتَشْهَدَ وَبَيَانُ هَذَا فِي ...",
    "malay_translation": "Sanad lain daripada 'Imran bin Husain meriwayatkan riwayat yang serupa. Abu Ammar Al-Husain bin Huraith meriwayatkan kepada kami, Waki' meriwayatkan kepada kami, daripada Al-A'mash, Hilal bin Yasaf meriwayatkan kepada kami, daripada Imran bin Husain, daripada Nabi SAW, dengan riwayat yang serupa. Dan ini lebih sahih daripada Hadith Muhammad bin Fudail. Beliau berkata: Maksud Hadith ini menurut sebahagian ahli ilmu adalah: \"Mereka memberikan kesaksian sebelum diminta.\" Sesungguhnya yang dimaksudkan adalah kesaksian palsu, iaitu seseorang memberikan kesaksian tanpa diminta dan penjelasannya ada di..."
  },
  {
    "id": 28152,
    "hadith_number": 2372,
    "tajuk_hadith": "Sebaik-baik Manusia adalah Generasiku dan Generasi Selepasnya",
    "perawi_melayu": "Penjelasan ini terdapat dalam Hadith 'Umar bin Al-Khattab, daripada Nabi (SAW) yang bersabda:",
    "english_text": "\"The best of people are my generation, then those who follow them,then those who follow them. Then lying will spread, until a man testifies while his testimony was not requested, and a man will take an oath while an oath was not sought.\"",
    "arabic_text": "حَدِيثِ عُمَرَ بْنِ الْخَطَّابِ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ خَيْرُ النَّاسِ قَرْنِي ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ يَفْشُو الْكَذِبُ حَتَّى يَشْهَدَ الرَّجُلُ وَلاَ يُسْتَشْهَدُ وَيَحْلِفُ الرَّجُلُ وَلاَ يُسْتَحْلَفُ ‏\"‏ ‏.‏ وَمَعْنَى حَدِيثِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ خَيْرُ الشُّهَدَاءِ الَّذِي يَأْتِي بِشَهَادَتِهِ قَبْلَ أَنْ يُسْأَلَهَا ‏\"‏ ‏.‏ هُوَ عِنْدَنَا إِذَا أُشْهِدَ الرَّجُلُ عَلَى الشَّىْءِ أَنْ يُؤَدِّيَ شَهَادَتَهُ وَلاَ يَمْتَنِعَ مِنَ الشَّهَادَةِ هَكَذَا وَجْهُ الْحَدِيثِ عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ ‏.‏ كَمُلَ وَالْحَمْدُ لِلَّهِ كِتَابُ الشَّهَادَاتِ وَيَلِيهِ كِتَابُ الزُّهْدِ",
    "malay_translation": "\"Sebaik-baik manusia adalah generasiku, kemudian mereka yang mengikuti mereka, kemudian mereka yang mengikuti mereka. Kemudian kebohongan akan tersebar, sehingga seseorang memberi kesaksian padahal kesaksiannya tidak diminta, dan seseorang bersumpah padahal sumpah tidak dicari.\""
  }
]