[
  {
    "id": 26268,
    "hadith_number": 488,
    "tajuk_hadith": "Keutamaan Hari Jumaat",
    "perawi_melayu": "Daripada Abu Hurairah r.a.",
    "english_text": "the Prophet said: \"The best day that the sun has risen upon is Friday. On it Adam was created, on it he entered Paradise, and on it, he was expelled from it. And the Hour will not be established except on Friday.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ خَيْرُ يَوْمٍ طَلَعَتْ فِيهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ أُدْخِلَ الْجَنَّةَ وَفِيهِ أُخْرِجَ مِنْهَا وَلاَ تَقُومُ السَّاعَةُ إِلاَّ فِي يَوْمِ الْجُمُعَةِ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي لُبَابَةَ وَسَلْمَانَ وَأَبِي ذَرٍّ وَسَعْدِ بْنِ عُبَادَةَ وَأَوْسِ بْنِ أَوْسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Sebaik-baik hari yang terbit padanya matahari adalah hari Jumaat. Padanya Nabi Adam diciptakan, padanya baginda dimasukkan ke dalam syurga, dan padanya baginda dikeluarkan daripadanya. Dan Kiamat tidak akan berlaku kecuali pada hari Jumaat.\""
  },
  {
    "id": 26269,
    "hadith_number": 489,
    "tajuk_hadith": "Mencari Waktu yang Diharapkan pada Hari Jumaat",
    "perawi_melayu": "Anas bin Malik meriwayatkan:",
    "english_text": "the Prophet said: \"Seek out the hour that is hoped for on Friday after Asr until the sun has set.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الصَّبَّاحِ الْهَاشِمِيُّ الْبَصْرِيُّ الْعَطَّارُ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ الْحَنَفِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي حُمَيْدٍ، حَدَّثَنَا مُوسَى بْنُ وَرْدَانَ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ الْتَمِسُوا السَّاعَةَ الَّتِي تُرْجَى فِي يَوْمِ الْجُمُعَةِ بَعْدَ الْعَصْرِ إِلَى غَيْبُوبَةِ الشَّمْسِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم مِنْ غَيْرِ هَذَا الْوَجْهِ ‏.‏ وَمُحَمَّدُ بْنُ أَبِي حُمَيْدٍ يُضَعَّفُ ضَعَّفَهُ بَعْضُ أَهْلِ الْعِلْمِ مِنْ قِبَلِ حِفْظِهِ وَيُقَالُ لَهُ حَمَّادُ بْنُ أَبِي حُمَيْدٍ وَيُقَالُ هُوَ أَبُو إِبْرَاهِيمَ الأَنْصَارِيُّ وَهُوَ مُنْكَرُ الْحَدِيثِ ‏.‏ وَرَأَى بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ أَنَّ السَّاعَةَ الَّتِي تُرْجَى فِيهَا بَعْدَ الْعَصْرِ إِلَى أَنْ تَغْرُبَ الشَّمْسُ ‏.‏ وَبِهِ يَقُولُ أَحْمَدُ وَإِسْحَاقُ ‏.‏ وَقَالَ أَحْمَدُ أَكْثَرُ الأَحَادِيثِ فِي السَّاعَةِ الَّتِي تُرْجَى فِيهَا إِجَابَةُ الدَّعْوَةِ أَنَّهَا بَعْدَ صَلاَةِ الْعَصْرِ وَتُرْجَى بَعْدَ زَوَالِ الشَّمْسِ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Carilah waktu yang diharapkan pada hari Jumaat bermula selepas solat Asar sehingga terbenamnya matahari.\""
  },
  {
    "id": 26270,
    "hadith_number": 490,
    "tajuk_hadith": "Keistimewaan Waktu di Hari Jumaat",
    "perawi_melayu": "Kathir bin Abdullah bin Amr bin Awf Al-Muzani meriwayatkan daripada bapanya, daripada datuknya:",
    "english_text": "the Prophet said: \"On Friday there is an hour in which the worshipper does not ask Allah for anything  except that Allah grants it to him.\" They said: \"O Messenger of Allah! Which hour is it?\" He said: \"When the prayer is begun until it is finished.\"",
    "arabic_text": "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ الْبَغْدَادِيُّ، حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ، حَدَّثَنَا كَثِيرُ بْنُ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عَوْفٍ الْمُزَنِيُّ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ فِي الْجُمُعَةِ سَاعَةً لاَ يَسْأَلُ اللَّهَ الْعَبْدُ فِيهَا شَيْئًا إِلاَّ آتَاهُ اللَّهُ إِيَّاهُ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ أَيَّةُ سَاعَةٍ هِيَ قَالَ ‏\"‏ حِينَ تُقَامُ الصَّلاَةُ إِلَى الاِنْصِرَافِ مِنْهَا ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي مُوسَى وَأَبِي ذَرٍّ وَسَلْمَانَ وَعَبْدِ اللَّهِ بْنِ سَلاَمٍ وَأَبِي لُبَابَةَ وَسَعْدِ بْنِ عُبَادَةَ وَأَبِي أُمَامَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَمْرِو بْنِ عَوْفٍ حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Sesungguhnya pada hari Jumaat terdapat satu waktu yang mana seorang hamba tidak meminta kepada Allah sesuatu melainkan Allah akan mengurniakannya.\" Mereka bertanya: \"Wahai Rasulullah! Waktu apakah itu?\" Baginda bersabda: \"Ketika solat dimulakan sehingga selesai.\""
  },
  {
    "id": 26271,
    "hadith_number": 491,
    "tajuk_hadith": "Keutamaan Hari Jumaat dan Waktu Mustajab",
    "perawi_melayu": "Abu Hurairah meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى الأَنْصَارِيُّ، حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ خَيْرُ يَوْمٍ طَلَعَتْ فِيهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ أُدْخِلَ الْجَنَّةَ وَفِيهِ أُهْبِطَ مِنْهَا وَفِيهِ سَاعَةٌ لاَ يُوَافِقُهَا عَبْدٌ مُسْلِمٌ يُصَلِّي فَيَسْأَلُ اللَّهَ فِيهَا شَيْئًا إِلاَّ أَعْطَاهُ إِيَّاهُ ‏\"‏ ‏.‏ قَالَ أَبُو هُرَيْرَةَ فَلَقِيتُ عَبْدَ اللَّهِ بْنَ سَلاَمٍ فَذَكَرْتُ لَهُ هَذَا الْحَدِيثَ فَقَالَ أَنَا أَعْلَمُ بِتِلْكَ السَّاعَةِ ‏.‏ فَقُلْتُ أَخْبِرْنِي بِهَا وَلاَ تَضْنَنْ بِهَا عَلَىَّ قَالَ هِيَ بَعْدَ الْعَصْرِ إِلَى أَنْ تَغْرُبَ الشَّمْسُ ‏.‏ فَقُلْتُ كَيْفَ تَكُونُ بَعْدَ الْعَصْرِ وَقَدْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ يُوَافِقُهَا عَبْدٌ مَسْلِمٌ وَهُوَ يُصَلِّي ‏\"‏ ‏.‏ وَتِلْكَ السَّاعَةُ لاَ يُصَلَّى فِيهَا فَقَالَ عَبْدُ اللَّهِ بْنُ سَلاَمٍ أَلَيْسَ قَدْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ جَلَسَ مَجْلِسًا يَنْتَظِرُ الصَّلاَةَ فَهُوَ فِي صَلاَةٍ ‏\"‏ ‏.‏ قُلْتُ بَلَى ‏.‏ قَالَ فَهُوَ ذَاكَ ‏.‏ قَالَ أَبُو عِيسَى وَفِي الْحَدِيثِ قِصَّةٌ طَوِيلَةٌ ‏.‏ قَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ قَالَ وَمَعْنَى قَوْلِهِ ‏\"‏ أَخْبِرْنِي بِهَا وَلاَ تَضْنَنْ بِهَا عَلَىَّ ‏\"‏ ‏.‏ لاَ تَبْخَلْ بِهَا عَلَىَّ وَالضَّنُّ الْبُخْلُ وَالظَّنِينُ الْمُتَّهَمُ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: “Sebaik-baik hari yang matahari terbit padanya ialah hari Jumaat. Padanya Nabi Adam diciptakan, padanya dia dimasukkan ke dalam syurga, dan padanya dia diturunkan daripadanya. Dan pada hari itu ada satu waktu yang tidaklah seorang hamba Muslim berdiri untuk solat, memohon kepada Allah sesuatu melainkan Dia akan memberikannya kepadanya.” Abu Hurairah berkata: “Aku bertemu dengan Abdullah bin Salam, lalu aku menyebutkan Hadith ini kepadanya. Dia berkata: ‘Aku lebih mengetahui tentang waktu itu.’ Maka aku berkata: ‘Beritahulah aku tentangnya, dan janganlah menyembunyikannya dariku.’ Dia berkata: ‘Iaitu selepas solat Asar hingga terbenam matahari.’ Aku berkata: ‘Bagaimanakah ia boleh berlaku selepas Asar sedangkan Rasulullah ﷺ bersabda: ‘Tidaklah seorang hamba Muslim berdiri untuk solat.’ Dan waktu itu adalah waktu yang solat tidak dilakukan padanya?’” Lalu Abdullah bin Salam berkata: ‘Bukankah Rasulullah ﷺ bersabda: “Sesiapa yang duduk di dalam satu majlis menunggu solat, maka dia (seolah-olah) sedang solat?” Aku berkata: ‘Tentu.’ Dia berkata: ‘Maka itulah dia.’"
  },
  {
    "id": 26272,
    "hadith_number": 492,
    "tajuk_hadith": "Kewajipan Mandi pada Hari Jumaat",
    "perawi_melayu": "Salim meriwayatkan daripada bapanya, daripada datuknya, bahawa dia mendengar:",
    "english_text": "the Prophet saying: \"Whoever comes on Friday, then let him perform Ghusl.\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ أَتَى الْجُمُعَةَ فَلْيَغْتَسِلْ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عُمَرَ وَأَبِي سَعِيدٍ وَجَابِرٍ وَالْبَرَاءِ وَعَائِشَةَ وَأَبِي الدَّرْدَاءِ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Sesiapa yang datang (ke solat) Jumaat, maka hendaklah dia mandi Ghusl.\""
  },
  {
    "id": 26273,
    "hadith_number": 493,
    "tajuk_hadith": "Hadis Serupa dari Abdullah bin Umar",
    "perawi_melayu": "Salim meriwayatkan:",
    "english_text": "(Another chain) from Abdullah bin Umar from the Prophet which is similar",
    "arabic_text": "وَرُوِيَ عَنِ الزُّهْرِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم هَذَا الْحَدِيثُ أَيْضًا ‏.‏ حَدَّثَنَا بِذَلِكَ قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ عَنِ ابْنِ شِهَابٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صلى الله عليه وسلم مِثْلَهُ ‏.‏ وَقَالَ مُحَمَّدٌ وَحَدِيثُ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ وَحَدِيثُ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ كِلاَ الْحَدِيثَيْنِ صَحِيحٌ ‏.‏ وَقَالَ بَعْضُ أَصْحَابِ الزُّهْرِيِّ عَنِ الزُّهْرِيِّ قَالَ حَدَّثَنِي آلُ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ‏.‏",
    "malay_translation": "Diriwayatkan dari Az-Zuhri, dari Abdullah bin Abdullah bin Umar, dari ayahnya, dari Nabi صلى الله عليه وسلم hadis ini juga. Qutaibah telah menceritakan kepada kami, telah menceritakan kepada kami Al-Laith bin Sa'd dari Ibnu Syihab dari Abdullah bin Abdullah bin Umar dari ayahnya bahawa Nabi صلى الله عليه وسلم serupa dengannya. Muhammad berkata: Hadis Az-Zuhri dari Salim dari ayahnya dan hadis Abdullah bin Abdullah dari ayahnya, kedua-dua hadis adalah sahih. Dan sebahagian sahabat Az-Zuhri dari Az-Zuhri berkata: Telah menceritakan kepadaku keluarga Abdullah bin Umar dari Abdullah bin Umar."
  },
  {
    "id": 26274,
    "hadith_number": 494,
    "tajuk_hadith": "Perintah Ghusl pada Hari Jumaat",
    "perawi_melayu": "Yunus dan Ma'mar meriwayatkan daripada Az-Zuhri, daripada Salim, daripada bapanya:",
    "english_text": "\"Umar bin Al-Khattab was giving a Khutbah on Friday when a man from the Companions of the Prophet entered. So he said: \"What time is it?\" So he said: 'I don't know, I heard the call and did nothing more than perform Wudu.' So he said: And Wudu again!? I know surely that the Messenger of Allah has ordered Ghusl.'\"",
    "arabic_text": "قَالَ أَبُو عِيسَى وَقَدْ رُوِيَ عَنِ ابْنِ عُمَرَ، عَنْ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم فِي الْغُسْلِ يَوْمَ الْجُمُعَةِ أَيْضًا وَهُوَ حَدِيثٌ حَسَنٌ صَحِيحٌ رَوَاهُ يُونُسُ وَمَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ بَيْنَمَا عُمَرُ بْنُ الْخَطَّابِ يَخْطُبُ يَوْمَ الْجُمُعَةِ إِذْ دَخَلَ رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فَقَالَ أَيَّةُ سَاعَةٍ هَذِهِ فَقَالَ مَا هُوَ إِلاَّ أَنْ سَمِعْتُ النِّدَاءَ وَمَا زِدْتُ عَلَى أَنْ تَوَضَّأْتُ ‏.‏ قَالَ وَالْوُضُوءَ أَيْضًا وَقَدْ عَلِمْتَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ بِالْغُسْلِ ‏.‏ حَدَّثَنَا بِذَلِكَ أَبُو بَكْرٍ مُحَمَّدُ بْنُ أَبَانَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنِ الزُّهْرِيِّ ‏.‏",
    "malay_translation": "Ketika Umar bin Al-Khattab sedang menyampaikan khutbah pada hari Jumaat, seorang lelaki dari kalangan sahabat Nabi ﷺ masuk. Umar bertanya, \"Pukul berapa sekarang?\" Lelaki itu menjawab, \"Saya tidak tahu, saya hanya mendengar azan dan hanya berwuduk.\" Umar berkata, \"Berwuduk lagi!? Saya tahu bahawa Rasulullah ﷺ telah memerintahkan untuk mandi (ghusl).\""
  },
  {
    "id": 26275,
    "hadith_number": 495,
    "tajuk_hadith": "Umar berkhutbah pada hari Jumaat",
    "perawi_melayu": "(Rantaian lain sampai kepada Az-Zuhri) dengan Hadith ini. Malik meriwayatkan Hadith ini daripada Az-Zuhri, daripada Salim yang berkata:",
    "english_text": "\"Umar  was giving a Khutbah on Friday.\" And he mentioned this Hadith.",
    "arabic_text": "قَالَ وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، أَخْبَرَنَا أَبُو صَالِحٍ عَبْدُ اللَّهِ بْنُ صَالِحٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، بِهَذَا الْحَدِيثِ ‏.‏ وَرَوَى مَالِكٌ، هَذَا الْحَدِيثَ عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، قَالَ بَيْنَمَا عُمَرُ بْنُ الْخَطَّابِ يَخْطُبُ يَوْمَ الْجُمُعَةِ ‏.‏ فَذَكَرَ هَذَا الْحَدِيثَ ‏.‏ قَالَ أَبُو عِيسَى وَسَأَلْتُ مُحَمَّدًا عَنْ هَذَا فَقَالَ الصَّحِيحُ حَدِيثُ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ ‏.‏ قَالَ مُحَمَّدٌ وَقَدْ رُوِيَ عَنْ مَالِكٍ أَيْضًا عَنِ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ نَحْوُ هَذَا الْحَدِيثِ ‏.‏",
    "malay_translation": "Umar sedang menyampaikan Khutbah pada hari Jumaat. Dan dia menyebutkan Hadith ini."
  },
  {
    "id": 26276,
    "hadith_number": 496,
    "tajuk_hadith": "Ganjaran Mereka yang Mandi dan Pergi Awal untuk Solat Jumaat",
    "perawi_melayu": "Daripada Aus bin Aus:",
    "english_text": "\"Allah's Messenger said to me: 'Whoever performs Ghusl on Friday, and bathes completely, and goes early, arriving early, gets close and listens and is silent, there will be for him in every step he take the reward of a year of fasting and standing (in prayer).'\"",
    "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، وَأَبُو جَنَابٍ يَحْيَى بْنُ أَبِي حَيَّةَ عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى، عَنْ يَحْيَى بْنِ الْحَارِثِ، عَنْ أَبِي الأَشْعَثِ الصَّنْعَانِيِّ، عَنْ أَوْسِ بْنِ أَوْسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنِ اغْتَسَلَ يَوْمَ الْجُمُعَةِ وَغَسَّلَ وَبَكَّرَ وَابْتَكَرَ وَدَنَا وَاسْتَمَعَ وَأَنْصَتَ كَانَ لَهُ بِكُلِّ خَطْوَةٍ يَخْطُوهَا أَجْرُ سَنَةٍ صِيَامُهَا وَقِيَامُهَا ‏\"‏ ‏.‏ قَالَ مَحْمُودٌ قَالَ وَكِيعٌ اغْتَسَلَ هُوَ وَغَسَّلَ امْرَأَتَهُ ‏.‏ قَالَ وَيُرْوَى عَنْ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ أَنَّهُ قَالَ فِي هَذَا الْحَدِيثِ ‏\"‏ مَنْ غَسَّلَ وَاغْتَسَلَ ‏\"‏ ‏.‏ يَعْنِي غَسَلَ رَأْسَهُ وَاغْتَسَلَ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي بَكْرٍ وَعِمْرَانَ بْنِ حُصَيْنٍ وَسَلْمَانَ وَأَبِي ذَرٍّ وَأَبِي سَعِيدٍ وَابْنِ عُمَرَ وَأَبِي أَيُّوبَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَوْسِ بْنِ أَوْسٍ حَدِيثٌ حَسَنٌ ‏.‏ وَأَبُو الأَشْعَثِ الصَّنْعَانِيُّ اسْمُهُ شَرَاحِيلُ بْنُ آدَةَ ‏.‏ وَأَبُو جَنَابٍ يَحْيَى بْنُ حَبِيبٍ الْقَصَّابُ الْكُوفِيُّ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: 'Sesiapa yang mandi pada hari Jumaat, mandi dengan sempurna, pergi awal (ke masjid), mendapatkan tempat yang dekat (dengan imam), mendengar khutbah dan berdiam diri, maka baginya pada setiap langkah yang diambillah ganjaran seperti puasa dan solat sunat setahun.'"
  },
  {
    "id": 26277,
    "hadith_number": 497,
    "tajuk_hadith": "Keutamaan Berwudhu dan Mandi pada Hari Jumaat",
    "perawi_melayu": "Samurah bin Jundab meriwayatkan:",
    "english_text": "Allah's Messenger said: \"Whoever performs  Wudu on Friday, then he will receive the blessing, and whoever performs Ghusl then Ghusl is more virtuous.\"",
    "arabic_text": "حَدَّثَنَا أَبُو مُوسَى، مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا سَعِيدُ بْنُ سُفْيَانَ الْجَحْدَرِيُّ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ بْنِ جُنْدَبٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ تَوَضَّأَ يَوْمَ الْجُمُعَةِ فَبِهَا وَنِعْمَتْ وَمَنِ اغْتَسَلَ فَالْغُسْلُ أَفْضَلُ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ وَعَائِشَةَ وَأَنَسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ سَمُرَةَ حَدِيثٌ حَسَنٌ ‏.‏ وَقَدْ رَوَاهُ بَعْضُ أَصْحَابِ قَتَادَةَ عَنْ قَتَادَةَ عَنِ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ وَرَوَاهُ بَعْضُهُمْ عَنْ قَتَادَةَ عَنِ الْحَسَنِ عَنِ النَّبِيِّ صلى الله عليه وسلم مُرْسَلٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَمَنْ بَعْدَهُمُ اخْتَارُوا الْغُسْلَ يَوْمَ الْجُمُعَةِ وَرَأَوْا أَنْ يُجْزِئَ الْوُضُوءُ مِنَ الْغُسْلِ يَوْمَ الْجُمُعَةِ ‏.‏ قَالَ الشَّافِعِيُّ وَمِمَّا يَدُلُّ عَلَى أَنَّ أَمْرَ النَّبِيِّ صلى الله عليه وسلم بِالْغُسْلِ يَوْمَ الْجُمُعَةِ أَنَّهُ عَلَى الاِخْتِيَارِ لاَ عَلَى الْوُجُوبِ حَدِيثُ عُمَرَ حَيْثُ قَالَ لِعُثْمَانَ وَالْوُضُوءَ أَيْضًا وَقَدْ عَلِمْتَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ بِالْغُسْلِ يَوْمَ الْجُمُعَةِ ‏.‏ فَلَوْ عَلِمَا أَنَّ أَمْرَهُ عَلَى الْوُجُوبِ لاَ عَلَى الاِخْتِيَارِ لَمْ يَتْرُكْ عُمَرُ عُثْمَانَ حَتَّى يَرُدَّهُ وَيَقُولَ لَهُ ارْجِعْ فَاغْتَسِلْ وَلَمَا خَفِيَ عَلَى عُثْمَانَ ذَلِكَ مَعَ عِلْمِهِ وَلَكِنْ دَلَّ فِي هَذَا الْحَدِيثِ أَنَّ الْغُسْلَ يَوْمَ الْجُمُعَةِ فِيهِ فَضْلٌ مِنْ غَيْرِ وُجُوبٍ يَجِبُ عَلَى الْمَرْءِ فِي ذَلِكَ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Sesiapa yang berwudhu pada hari Jumaat, maka ia mendapat keberkatan, dan sesiapa yang mandi (Ghusl), maka mandi itu adalah lebih afdal.\""
  },
  {
    "id": 26278,
    "hadith_number": 498,
    "tajuk_hadith": "Keutamaan Solat Jumaat dan Larangan Perkara Sia-Sia",
    "perawi_melayu": "Abu Hurairah meriwayatkan:",
    "english_text": "Allah's Messenger said: \"Whoever performs Wudu, performing his Wudu well, then he comes to the Friday (prayer), and he gets close, listens and is silent, then whatever (sin) was between that and (the last) Friday are forgiven for him, in addition to three days. And whoever touches the pebbles, he has committed Lagha (useless activity).\"",
    "arabic_text": "حَدَّثَنَا هَنَّادٌ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ أَتَى الْجُمُعَةَ فَدَنَا وَاسْتَمَعَ وَأَنْصَتَ غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الْجُمُعَةِ وَزِيَادَةُ ثَلاَثَةِ أَيَّامٍ وَمَنْ مَسَّ الْحَصَى فَقَدْ لَغَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Sesiapa yang berwuduk dengan sempurna, kemudian dia datang ke solat Jumaat, lalu dia mendekat (kepada imam), mendengar dan diam, maka diampunkan baginya apa yang ada di antara Jumaat itu dan (Jumaat) yang berikutnya, serta ditambahkan tiga hari. Dan sesiapa yang menyentuh anak batu, sesungguhnya dia telah melakukan Lagha (perkara yang sia-sia).\""
  },
  {
    "id": 26279,
    "hadith_number": 499,
    "tajuk_hadith": "Ganjaran Datang Awal ke Solat Jumaat",
    "perawi_melayu": "Abu Hurairah meriwayatkan:",
    "english_text": "Allah's Messenger said: \"Whoever performs Ghusl on Friday - the Ghusl for Janabah - then he goes, he is like one who gave a camel in charity. Whoever goes in the second hour then he is like one who gave a cow in charity. Whoever goes in the third hour then he is like the one who have a ram in charity. Whoever goes in the fourth hour then he is like the one who gave a chicken in charity. Whoever goes in the fifth hour, then he is like one who gave an egg in charity. When the Imam comes out, the angels are present listening to the remembrance.\"",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى الأَنْصَارِيُّ، حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكٌ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنِ اغْتَسَلَ يَوْمَ الْجُمُعَةِ غُسْلَ الْجَنَابَةِ ثُمَّ رَاحَ فَكَأَنَّمَا قَرَّبَ بَدَنَةً وَمَنْ رَاحَ فِي السَّاعَةِ الثَّانِيَةِ فَكَأَنَّمَا قَرَّبَ بَقَرَةً وَمَنْ رَاحَ فِي السَّاعَةِ الثَّالِثَةِ فَكَأَنَّمَا قَرَّبَ كَبْشًا أَقْرَنَ وَمَنْ رَاحَ فِي السَّاعَةِ الرَّابِعَةِ فَكَأَنَّمَا قَرَّبَ دَجَاجَةً وَمَنْ رَاحَ فِي السَّاعَةِ الْخَامِسَةِ فَكَأَنَّمَا قَرَّبَ بَيْضَةً فَإِذَا خَرَجَ الإِمَامُ حَضَرَتِ الْمَلاَئِكَةُ يَسْتَمِعُونَ الذِّكْرَ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو وَسَمُرَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Sesiapa yang mandi pada hari Jumaat - mandi junub - kemudian dia pergi (ke masjid), maka seolah-olah dia bersedekah dengan seekor unta. Sesiapa yang pergi pada jam kedua, maka seolah-olah dia bersedekah dengan seekor lembu. Sesiapa yang pergi pada jam ketiga, maka seolah-olah dia bersedekah dengan seekor kibas yang bertanduk. Sesiapa yang pergi pada jam keempat, maka seolah-olah dia bersedekah dengan seekor ayam. Sesiapa yang pergi pada jam kelima, maka seolah-olah dia bersedekah dengan sebiji telur. Apabila Imam keluar (untuk khutbah), para malaikat hadir mendengar zikir.\""
  },
  {
    "id": 26280,
    "hadith_number": 500,
    "tajuk_hadith": "Kesan Meninggalkan Solat Jumaat Tiga Kali Berturut-turut",
    "perawi_melayu": "Abu Al-Ja'd - bermaksud Ad-Damri - meriwayatkan, dan dia adalah seorang Sahabat menurut dakwaan Muhammad bin Amr.",
    "english_text": "\"Allah's Messenger said: 'Whoever neglects the Friday prayer three times (in a row) without an excuse, then Allah sets a seal upon his heart.'\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ عَبِيدَةَ بْنِ سُفْيَانَ، عَنْ أَبِي الْجَعْدِ يَعْنِي الضَّمْرِيَّ، وَكَانَتْ، لَهُ صُحْبَةٌ فِيمَا زَعَمَ مُحَمَّدُ بْنُ عَمْرٍو قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ تَرَكَ الْجُمُعَةَ ثَلاَثَ مَرَّاتٍ تَهَاوُنًا بِهَا طَبَعَ اللَّهُ عَلَى قَلْبِهِ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عُمَرَ وَابْنِ عَبَّاسٍ وَسَمُرَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي الْجَعْدِ حَدِيثٌ حَسَنٌ ‏.‏ قَالَ وَسَأَلْتُ مُحَمَّدًا عَنِ اسْمِ أَبِي الْجَعْدِ الضَّمْرِيِّ فَلَمْ يَعْرِفِ اسْمَهُ وَقَالَ لاَ أَعْرِفُ لَهُ عَنِ النَّبِيِّ صلى الله عليه وسلم إِلاَّ هَذَا الْحَدِيثَ ‏.‏ قَالَ أَبُو عِيسَى وَلاَ نَعْرِفُ هَذَا الْحَدِيثَ إِلاَّ مِنْ حَدِيثِ مُحَمَّدِ بْنِ عَمْرٍو ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: 'Sesiapa yang meninggalkan solat Jumaat tiga kali (berturut-turut) tanpa uzur, maka Allah akan menutup hatinya.'"
  },
  {
    "id": 26281,
    "hadith_number": 501,
    "tajuk_hadith": "Solat Jumaat di Quba",
    "perawi_melayu": "Tuwair meriwayatkan daripada seorang lelaki dari penduduk Quba, daripada bapanya, yang merupakan salah seorang sahabat Nabi, bahawa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، وَمُحَمَّدُ بْنُ مَدُّويَهْ، قَالاَ حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ ثُوَيْرٍ، عَنْ رَجُلٍ، مِنْ أَهْلِ قُبَاءَ عَنْ أَبِيهِ، وَكَانَ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم - قَالَ أَمَرَنَا النَّبِيُّ صلى الله عليه وسلم أَنْ نَشْهَدَ الْجُمُعَةَ مِنْ قُبَاءَ ‏.‏ وَقَدْ رُوِيَ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي هَذَا وَلاَ يَصِحُّ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ وَلاَ يَصِحُّ فِي هَذَا الْبَابِ عَنِ النَّبِيِّ صلى الله عليه وسلم شَيْءٌ ‏.‏ وَقَدْ رُوِيَ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ الْجُمُعَةُ عَلَى مَنْ آوَاهُ اللَّيْلُ إِلَى أَهْلِهِ ‏\"‏ ‏.‏ وَهَذَا حَدِيثٌ إِسْنَادُهُ ضَعِيفٌ إِنَّمَا يُرْوَى مِنْ حَدِيثِ مُعَارِكِ بْنِ عَبَّادٍ عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدٍ الْمَقْبُرِيِّ ‏.‏ وَضَعَّفَ يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ عَبْدَ اللَّهِ بْنَ سَعِيدٍ الْمَقْبُرِيَّ فِي الْحَدِيثِ ‏.‏ قَالَ وَاخْتَلَفَ أَهْلُ الْعِلْمِ عَلَى مَنْ تَجِبُ الْجُمُعَةُ فَقَالَ بَعْضُهُمْ تَجِبُ الْجُمُعَةُ عَلَى مَنْ آوَاهُ اللَّيْلُ إِلَى مَنْزِلِهِ ‏.‏ وَقَالَ بَعْضُهُمْ لاَ تَجِبُ الْجُمُعَةُ إِلاَّ عَلَى مَنْ سَمِعَ النِّدَاءَ وَهُوَ قَوْلُ الشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏",
    "malay_translation": "Kami diberitakan oleh Abd bin Humaid dan Muhammad bin Madduyah, mereka berdua berkata: Kami diberitakan oleh Al-Fazl bin Dukain, dia memberitakan kepada kami oleh Israel, daripada Tuwair, daripada seorang lelaki daripada penduduk Quba, daripada bapanya yang merupakan salah seorang sahabat Nabi SAW – Baginda bersabda: Nabi SAW memerintahkan kami supaya menunaikan solat Jumaat di Quba.  Dan telah diriwayatkan daripada Abu Hurairah daripada Nabi SAW dalam hal ini, tetapi ia tidak sahih. Abu Isa berkata: Hadis ini tidak kami ketahui melainkan melalui jalan ini sahaja, dan tidak sahih dalam bab ini daripada Nabi SAW sesuatu pun. Dan telah diriwayatkan daripada Abu Hurairah daripada Nabi SAW bahawa baginda bersabda: \"Solat Jumaat adalah fardu ke atas sesiapa yang telah sampai malam di rumahnya.\" Dan ini adalah hadis yang lemah sanadnya, ia hanya diriwayatkan daripada hadis Mu'arik bin 'Abbad daripada Abdullah bin Sa'id Al-Maqburi. Dan Yahya bin Sa'id Al-Qattan melemahkan Abdullah bin Sa'id Al-Maqburi dalam hadis ini. Beliau berkata: Ulama berselisih pendapat tentang siapakah yang diwajibkan solat Jumaat. Sebahagian mereka mengatakan solat Jumaat diwajibkan ke atas sesiapa yang telah sampai malam di rumahnya. Dan sebahagian yang lain mengatakan solat Jumaat hanya diwajibkan ke atas sesiapa yang mendengar azan, dan inilah pendapat Syafie, Ahmad dan Ishaq."
  },
  {
    "id": 26282,
    "hadith_number": 502,
    "tajuk_hadith": "Kewajipan Solat Jumaat",
    "perawi_melayu": "Perawi tidak disebut:",
    "english_text": "",
    "arabic_text": "سَمِعْتُ أَحْمَدَ بْنَ الْحَسَنِ، يَقُولُ كُنَّا عِنْدَ أَحْمَدَ بْنِ حَنْبَلٍ فَذَكَرُوا عَلَى مَنْ تَجِبُ الْجُمُعَةُ فَلَمْ يَذْكُرْ أَحْمَدُ فِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم شَيْئًا ‏.‏ قَالَ أَحْمَدُ بْنُ الْحَسَنِ فَقُلْتُ لأَحْمَدَ بْنِ حَنْبَلٍ فِيهِ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ فَقَالَ أَحْمَدُ عَنِ النَّبِيِّ صلى الله عليه وسلم قُلْتُ نَعَمْ ‏.‏ قَالَ أَحْمَدُ بْنُ الْحَسَنِ حَدَّثَنَا حَجَّاجُ بْنُ نُصَيْرٍ حَدَّثَنَا مُعَارِكُ بْنُ عَبَّادٍ عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْجُمُعَةُ عَلَى مَنْ آوَاهُ اللَّيْلُ إِلَى أَهْلِهِ ‏\"‏ ‏.‏ قَالَ فَغَضِبَ عَلَىَّ أَحْمَدُ بْنُ حَنْبَلٍ وَقَالَ لِي اسْتَغْفِرْ رَبَّكَ اسْتَغْفِرْ رَبَّكَ ‏.‏ قَالَ أَبُو عِيسَى إِنَّمَا فَعَلَ أَحْمَدُ بْنُ حَنْبَلٍ هَذَا لأَنَّهُ لَمْ يَعُدَّ هَذَا الْحَدِيثَ شَيْئًا وَضَعَّفَهُ لِحَالِ إِسْنَادِهِ ‏.‏",
    "malay_translation": "Aku mendengar Ahmad bin Hasan berkata, \"Kami berada di sisi Ahmad bin Hanbal, maka disebutlah tentang siapa yang diwajibkan ke atasnya solat Jumaat. Ahmad tidak menyebut apa-apa mengenainya daripada Nabi ﷺ.  Ahmad bin Hasan berkata, \"Maka aku berkata kepada Ahmad bin Hanbal, 'Terdapat sesuatu mengenainya daripada Abu Hurairah daripada Nabi ﷺ.' Maka Ahmad bin Hanbal bertanya, 'Daripada Nabi ﷺ?' Aku menjawab, 'Ya.'  Ahmad bin Hasan berkata, 'Hajjaj bin Nusir telah meriwayatkan kepada kami, Mu'arik bin 'Abbad telah meriwayatkan kepada kami daripada Abdullah bin Sa'id al-Maqburi daripada bapanya daripada Abu Hurairah daripada Nabi ﷺ yang bersabda, \"Solat Jumaat adalah wajib ke atas sesiapa yang telah sampai malam di rumahnya.\" Maka Ahmad bin Hanbal marah kepadaku dan berkata kepadaku, 'Mohon keampunan daripada Tuhanmu, mohon keampunan daripada Tuhanmu.' Abu 'Isa berkata, Ahmad bin Hanbal melakukan demikian kerana dia tidak menganggap hadis ini sebagai sesuatu dan melemahkannya disebabkan keadaan sanadnya."
  },
  {
    "id": 26283,
    "hadith_number": 503,
    "tajuk_hadith": "Solat Jumaat Ketika Matahari Condong",
    "perawi_melayu": "Anas bin Malik meriwayatkan:",
    "english_text": "\"The Prophet would pray the Friday prayer when the sun was declining.\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا سُرَيْجُ بْنُ النُّعْمَانِ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، عَنْ عُثْمَانَ بْنِ عَبْدِ الرَّحْمَنِ التَّيْمِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي الْجُمُعَةَ حِينَ تَمِيلُ الشَّمْسُ ‏.‏",
    "malay_translation": "Dari Anas bin Malik, bahawa Nabi SAW biasa menunaikan solat Jumaat apabila matahari mula condong."
  },
  {
    "id": 26284,
    "hadith_number": 504,
    "tajuk_hadith": "Waktu Solat Jumaat",
    "perawi_melayu": "(Sanad lain) daripada Anas, :",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى، حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، عَنْ عُثْمَانَ بْنِ عَبْدِ الرَّحْمَنِ التَّيْمِيِّ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ سَلَمَةَ بْنِ الأَكْوَعِ وَجَابِرٍ وَالزُّبَيْرِ بْنِ الْعَوَّامِ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَنَسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهُوَ الَّذِي أَجْمَعَ عَلَيْهِ أَكْثَرُ أَهْلِ الْعِلْمِ أَنَّ وَقْتَ الْجُمُعَةِ إِذَا زَالَتِ الشَّمْسُ كَوَقْتِ الظُّهْرِ ‏.‏ وَهُوَ قَوْلُ الشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏ وَرَأَى بَعْضُهُمْ أَنَّ صَلاَةَ الْجُمُعَةِ إِذَا صُلِّيَتْ قَبْلَ الزَّوَالِ أَنَّهَا تَجُوزُ أَيْضًا ‏.‏ وَقَالَ أَحْمَدُ وَمَنْ صَلاَّهَا قَبْلَ الزَّوَالِ فَإِنَّهُ لَمْ يَرَ عَلَيْهِ إِعَادَةً ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Yahya bin Musa, telah menceritakan kepada kami Abu Daud Ath-Thayalisi, telah menceritakan kepada kami Fulaih bin Sulaiman, daripada Usman bin Abdur Rahman Ath-Thaimi, daripada Anas, daripada Nabi SAW, lebih kurang demikian.  Dikatakan, dan dalam bab ini daripada Salamah bin Al-Akwa', Jabir dan Az-Zubair bin Al-Awwam. Abu Isa berkata: Hadis Anas ini adalah hadis yang hasan sahih. Dan inilah yang telah disepakati oleh kebanyakan ulama bahawa waktu solat Jumaat ialah apabila matahari telah berlalu tengah hari, seperti waktu solat Zohor.  Dan inilah pendapat Syafie, Ahmad dan Ishak.  Dan ada di antara mereka yang berpendapat bahawa solat Jumaat jika didirikan sebelum matahari berlalu tengah hari adalah dibolehkan juga.  Ahmad berkata: Dan sesiapa yang mendirikan solat Jumaat sebelum matahari berlalu tengah hari, maka baginda tidak melihat perlu mengulanginya."
  },
  {
    "id": 26285,
    "hadith_number": 505,
    "tajuk_hadith": "Kerinduan Batang Pokok Kurma Kepada Nabi",
    "perawi_melayu": "Daripada Ibnu Umar.",
    "english_text": "\"The Prophet would give the Khutbah next to the trunk of a date palm. When he  began using the Minbar the trunk cried out for him until he came to it and held it, so it became quiet.\"",
    "arabic_text": "حَدَّثَنَا أَبُو حَفْصٍ، عَمْرُو بْنُ عَلِيٍّ الْفَلاَّسُ الصَّيْرَفِيُّ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، وَيَحْيَى بْنُ كَثِيرٍ أَبُو غَسَّانَ الْعَنْبَرِيُّ، قَالاَ حَدَّثَنَا مُعَاذُ بْنُ الْعَلاَءِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَخْطُبُ إِلَى جِذْعٍ فَلَمَّا اتَّخَذَ النَّبِيُّ صلى الله عليه وسلم الْمِنْبَرَ حَنَّ الْجِذْعُ حَتَّى أَتَاهُ فَالْتَزَمَهُ فَسَكَنَ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَنَسٍ وَجَابِرٍ وَسَهْلِ بْنِ سَعْدٍ وَأُبَىِّ بْنِ كَعْبٍ وَابْنِ عَبَّاسٍ وَأُمِّ سَلَمَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ ‏.‏ وَمُعَاذُ بْنُ الْعَلاَءِ هُوَ بَصْرِيٌّ وَهُوَ أَخُو أَبِي عَمْرِو بْنِ الْعَلاَءِ ‏.‏",
    "malay_translation": "Nabi SAW  selalu menyampaikan khutbah berhampiran batang pokok kurma.  Apabila baginda mula menggunakan mimbar, batang pokok kurma itu merindui baginda sehingga baginda datang dan memegangnya, barulah ia tenang."
  },
  {
    "id": 26286,
    "hadith_number": 506,
    "tajuk_hadith": "Khutbah Jumaat Nabi SAW",
    "perawi_melayu": "Riwayat Ibnu Umar:",
    "english_text": "\"The Prophet would give a Khutbah on Friday, then sit, then stand and give (another) Khutbah.\" He said: \"Similar to what they do today.\"",
    "arabic_text": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ الْبَصْرِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَخْطُبُ يَوْمَ الْجُمُعَةِ ثُمَّ يَجْلِسُ ثُمَّ يَقُومُ فَيَخْطُبُ قَالَ مِثْلَ مَا تَفْعَلُونَ الْيَوْمَ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ وَجَابِرِ بْنِ عَبْدِ اللَّهِ وَجَابِرِ بْنِ سَمُرَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهُوَ الَّذِي رَآهُ أَهْلُ الْعِلْمِ أَنْ يَفْصِلَ بَيْنَ الْخُطْبَتَيْنِ بِجُلُوسٍ ‏.‏",
    "malay_translation": "Daripada Ibnu Umar, bahawa Nabi SAW pada hari Jumaat, akan memberi khutbah, kemudian duduk, kemudian bangun dan memberi khutbah lagi. Baginda bersabda: \"Sama seperti yang kamu lakukan pada hari ini.\"  (Hadis ini diriwayatkan juga daripada Ibnu Abbas, Jabir bin Abdullah dan Jabir bin Samurah. Imam Abu Isa berkata: Hadis Ibnu Umar ini adalah hadis yang hasan sahih. Dan inilah pendapat para ulama, iaitu memisahkan antara dua khutbah dengan duduk)."
  },
  {
    "id": 26287,
    "hadith_number": 507,
    "tajuk_hadith": "Solat dan Khutbah Nabi SAW yang Sederhana",
    "perawi_melayu": "Jabir bin Samurah meriwayatkan:",
    "english_text": "\"I would pray with the Prophet, and his prayer was moderate, and his Khutbah was moderate.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، وَهَنَّادٌ، قَالاَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ كُنْتُ أُصَلِّي مَعَ النَّبِيِّ صلى الله عليه وسلم فَكَانَتْ صَلاَتُهُ قَصْدًا وَخُطْبَتُهُ قَصْدًا ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَمَّارِ بْنِ يَاسِرٍ وَابْنِ أَبِي أَوْفَى ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ جَابِرِ بْنِ سَمُرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Aku pernah menunaikan solat bersama Nabi SAW, dan solat baginda adalah sederhana, begitu juga khutbah baginda."
  },
  {
    "id": 26288,
    "hadith_number": 508,
    "tajuk_hadith": "Rasulullah Membaca Ayat \"Dan Mereka Akan Berseru: Wahai Malik!\"",
    "perawi_melayu": "Safwan bin Ya'la bin Umayyah meriwayatkan daripada bapanya yang berkata:",
    "english_text": "\"I heard the Prophet reciting, when on the Minbar: And they will cry: \"O Malik (keeper of Hell)!\".\"  There are narrations on this topic from Abu Hurairah and Jabir bin Samurah.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عَطَاءٍ، عَنْ صَفْوَانَ بْنِ يَعْلَى بْنِ أُمَيَّةَ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقْرَأُ عَلَى الْمِنْبَرِ ‏(‏ونَادَوُا يَا مَالِكُ‏)‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ وَجَابِرِ بْنِ سَمُرَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ يَعْلَى بْنِ أُمَيَّةَ حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ وَهُوَ حَدِيثُ ابْنِ عُيَيْنَةَ ‏.‏ وَقَدِ اخْتَارَ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ أَنْ يَقْرَأَ الإِمَامُ فِي الْخُطْبَةِ آيًا مِنَ الْقُرْآنِ ‏.‏ قَالَ الشَّافِعِيُّ وَإِذَا خَطَبَ الإِمَامُ فَلَمْ يَقْرَأْ فِي خُطْبَتِهِ شَيْئًا مِنَ الْقُرْآنِ أَعَادَ الْخُطْبَةَ ‏.‏",
    "malay_translation": "Aku mendengar Nabi SAW membacakan di atas mimbar:  \"Dan mereka akan berseru: Wahai Malik!\"  Terdapat juga riwayat mengenai topik ini daripada Abu Hurairah dan Jabir bin Samurah."
  },
  {
    "id": 26289,
    "hadith_number": 509,
    "tajuk_hadith": "Rasulullah Menghadap Jemaah Semasa di Mimbar",
    "perawi_melayu": "Abdullah bin Mas'ud meriwayatkan:",
    "english_text": "\"When Allah's Messenger descending the Minbar he would face our direction.\"",
    "arabic_text": "حَدَّثَنَا عَبَّادُ بْنُ يَعْقُوبَ الْكُوفِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ الْفَضْلِ بْنِ عَطِيَّةَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا اسْتَوَى عَلَى الْمِنْبَرِ اسْتَقْبَلْنَاهُ بِوُجُوهِنَا ‏.‏ قَالَ أَبُو عِيسَى وَفِي الْبَابِ عَنِ ابْنِ عُمَرَ وَحَدِيثُ مَنْصُورٍ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ مُحَمَّدِ بْنِ الْفَضْلِ بْنِ عَطِيَّةَ ‏.‏ وَمُحَمَّدُ بْنُ الْفَضْلِ بْنِ عَطِيَّةَ ضَعِيفٌ ذَاهِبُ الْحَدِيثِ عِنْدَ أَصْحَابِنَا ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ يَسْتَحِبُّونَ اسْتِقْبَالَ الإِمَامِ إِذَا خَطَبَ ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏ قَالَ أَبُو عِيسَى وَلاَ يَصِحُّ فِي هَذَا الْبَابِ عَنِ النَّبِيِّ صلى الله عليه وسلم شَيْءٌ ‏.‏",
    "malay_translation": "Rasulullah SAW apabila berada di atas mimbar, baginda akan menghadap ke arah kami."
  },
  {
    "id": 26290,
    "hadith_number": 510,
    "tajuk_hadith": "Solat Jumaat: Anjuran Menunaikan Solat Sebelum Khutbah",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan:",
    "english_text": "\"The Prophet was delivering a Khutbah on Friday when a man came. The Prophet said: 'Have you prayed?' He said no. So he said: 'Then stand and pray.'\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ بَيْنَا النَّبِيُّ صلى الله عليه وسلم يَخْطُبُ يَوْمَ الْجُمُعَةِ إِذْ جَاءَ رَجُلٌ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَصَلَّيْتَ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ قُمْ فَارْكَعْ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ أَصَحُّ شَيْءٍ فِي هَذَا الْبَابِ ‏.‏",
    "malay_translation": "Ketika Nabi SAW sedang menyampaikan khutbah Jumaat, tiba-tiba seorang lelaki datang.  Nabi SAW bertanya, \"Adakah engkau telah solat?\" Lelaki itu menjawab, \"Tidak.\"  Maka Nabi SAW bersabda, \"Maka berdirilah dan solatlah.\" Abu Eisa berkata: Hadith ini adalah Hadith Hasan Sahih."
  },
  {
    "id": 26291,
    "hadith_number": 511,
    "tajuk_hadith": "Solat Sunat Dua Rakaat Ketika Khutbah Jumaat",
    "perawi_melayu": "Iyad bin Abdullah bin Abi Sarh meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ مُحَمَّدِ بْنِ عَجْلاَنَ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي سَرْحٍ، أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ، دَخَلَ يَوْمَ الْجُمُعَةِ وَمَرْوَانُ يَخْطُبُ فَقَامَ يُصَلِّي فَجَاءَ الْحَرَسُ لِيُجْلِسُوهُ فَأَبَى حَتَّى صَلَّى فَلَمَّا انْصَرَفَ أَتَيْنَاهُ فَقُلْنَا رَحِمَكَ اللَّهُ إِنْ كَادُوا لَيَقَعُوا بِكَ ‏.‏ فَقَالَ مَا كُنْتُ لأَتْرُكَهُمَا بَعْدَ شَيْءٍ رَأَيْتُهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ ثُمَّ ذَكَرَ أَنَّ رَجُلاً جَاءَ يَوْمَ الْجُمُعَةِ فِي هَيْئَةٍ بَذَّةٍ وَالنَّبِيُّ صلى الله عليه وسلم يَخْطُبُ يَوْمَ الْجُمُعَةِ فَأَمَرَهُ فَصَلَّى رَكْعَتَيْنِ وَالنَّبِيُّ صلى الله عليه وسلم يَخْطُبُ ‏.‏ قَالَ ابْنُ أَبِي عُمَرَ كَانَ سُفْيَانُ بْنُ عُيَيْنَةَ يُصَلِّي رَكْعَتَيْنِ إِذَا جَاءَ وَالإِمَامُ يَخْطُبُ وَكَانَ يَأْمُرُ بِهِ وَكَانَ أَبُو عَبْدِ الرَّحْمَنِ الْمُقْرِئُ يَرَاهُ ‏.‏ قَالَ أَبُو عِيسَى وَسَمِعْتُ ابْنَ أَبِي عُمَرَ يَقُولُ قَالَ سُفْيَانُ بْنُ عُيَيْنَةَ كَانَ مُحَمَّدُ بْنُ عَجْلاَنَ ثِقَةً مَأْمُونًا فِي الْحَدِيثِ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ جَابِرٍ وَأَبِي هُرَيْرَةَ وَسَهْلِ بْنِ سَعْدٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي سَعِيدٍ الْخُدْرِيِّ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ ‏.‏ وَبِهِ يَقُولُ الشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ ‏.‏ وَقَالَ بَعْضُهُمْ إِذَا دَخَلَ وَالإِمَامُ يَخْطُبُ فَإِنَّهُ يَجْلِسُ وَلاَ يُصَلِّي ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَأَهْلِ الْكُوفَةِ ‏.‏ وَالْقَوْلُ الأَوَّلُ أَصَحُّ ‏.‏ حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا الْعَلاَءُ بْنُ خَالِدٍ الْقُرَشِيُّ قَالَ رَأَيْتُ الْحَسَنَ الْبَصْرِيَّ دَخَلَ الْمَسْجِدَ يَوْمَ الْجُمُعَةِ وَالإِمَامُ يَخْطُبُ فَصَلَّى رَكْعَتَيْنِ ثُمَّ جَلَسَ ‏.‏ إِنَّمَا فَعَلَ الْحَسَنُ اتِّبَاعًا لِلْحَدِيثِ وَهُوَ رَوَى عَنْ جَابِرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم هَذَا الْحَدِيثَ ‏.‏",
    "malay_translation": "Daripada Muhammad bin Abi Umar, yang meriwayatkan daripada Sufian bin Uyainah, daripada Muhammad bin Ajlan, daripada Iyad bin Abdullah bin Abi Sarh, bahawa Abu Said Al-Khudri telah masuk masjid pada hari Jumaat ketika Marwan sedang menyampaikan khutbah, lalu dia berdiri untuk menunaikan solat.  Pengawal datang untuk menyuruhnya duduk, tetapi dia enggan sehingga selesai solat.  Setelah selesai, kami menghampirinya dan berkata, \"Semoga Allah merahmatimu, hampir sahaja mereka mencederakanmu.\" Dia menjawab, \"Aku tidak akan meninggalkan solat dua rakaat itu setelah melihat apa yang telah aku lihat daripada Rasulullah SAW.\" Kemudian dia menyebut tentang seorang lelaki yang datang pada hari Jumaat dalam keadaan tidak kemas ketika Nabi SAW sedang menyampaikan khutbah Jumaat, lalu Nabi SAW menyuruhnya menunaikan solat dua rakaat sementara khutbah masih berlangsung.  Ibn Abi Umar berkata, Sufian bin Uyainah menunaikan solat dua rakaat apabila tiba dan imam sedang menyampaikan khutbah, dan dia juga menyuruh orang lain berbuat demikian. Abu Abdur Rahman Al-Muqri' menyaksikan perkara itu. Abu Isa berkata, aku mendengar Ibn Abi Umar berkata, Sufian bin Uyainah berkata, Muhammad bin Ajlan adalah seorang yang dipercayai dan dijamin kejujurannya dalam meriwayatkan hadis.  Di dalam bab ini juga terdapat riwayat daripada Jabir, Abu Hurairah dan Sahl bin Sa'd.  Abu Isa berkata, hadis daripada Abu Said Al-Khudri ini adalah hadis yang baik dan sahih.  Sesetengah ulama' beramal dengannya.  Imam Syafie, Ahmad dan Ishaq juga berpendapat demikian.  Ada juga yang berpendapat bahawa jika seseorang masuk masjid ketika imam sedang berkhutbah, maka dia hendaklah duduk dan tidak menunaikan solat.  Itulah pendapat Sufian Ath-Thauri dan penduduk Kufah.  Tetapi pendapat yang pertama adalah lebih sahih.  Daripada Qutaibah, yang meriwayatkan daripada Al-Ala' bin Khalid Al-Qurasyi, yang berkata, aku melihat Al-Hasan Al-Basri masuk masjid pada hari Jumaat ketika imam sedang berkhutbah, lalu dia menunaikan solat dua rakaat kemudian duduk. Al-Hasan melakukannya kerana mengikut hadis ini yang diriwayatkan oleh Jabir daripada Nabi SAW."
  },
  {
    "id": 26292,
    "hadith_number": 512,
    "tajuk_hadith": "Larangan Bercakap Ketika Imam Berkhutbah",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ قَالَ يَوْمَ الْجُمُعَةِ وَالإِمَامُ يَخْطُبُ أَنْصِتْ فَقَدْ لَغَا ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ أَبِي أَوْفَى وَجَابِرِ بْنِ عَبْدِ اللَّهِ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَيْهِ عِنْدَ أَهْلِ الْعِلْمِ كَرِهُوا لِلرَّجُلِ أَنْ يَتَكَلَّمَ وَالإِمَامُ يَخْطُبُ وَقَالُوا إِنْ تَكَلَّمَ غَيْرُهُ فَلاَ يُنْكِرْ عَلَيْهِ إِلاَّ بِالإِشَارَةِ ‏.‏ وَاخْتَلَفُوا فِي رَدِّ السَّلاَمِ وَتَشْمِيتِ الْعَاطِسِ وَالإِمَامُ يَخْطُبُ فَرَخَّصَ بَعْضُ أَهْلِ الْعِلْمِ فِي رَدِّ السَّلاَمِ وَتَشْمِيتِ الْعَاطِسِ وَالإِمَامُ يَخْطُبُ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَاقَ ‏.‏ وَكَرِهَ بَعْضُ أَهْلِ الْعِلْمِ مِنَ التَّابِعِينَ وَغَيْرِهِمْ ذَلِكَ وَهُوَ قَوْلُ الشَّافِعِيِّ ‏.‏",
    "malay_translation": "Daripada Qotaibah, daripada Laits, daripada Uqail, daripada Az- Zuhri, daripada Sa’id bin Musayyab, daripada Abu Hurairah, bahawa Nabi SAW bersabda:  \"Barangsiapa yang berkata 'Diam!' ketika Imam sedang berkhutbah, maka sesungguhnya dia telah melakukan perbuatan yang sia-sia.\"\n\nDi dalam bab ini terdapat riwayat daripada Ibnu Abu Auf dan Jabir bin Abdullah. Abu Isa berkata:  Hadis daripada Abu Hurairah adalah hadis yang baik dan sahih.\nAmalan ke atasnya dalam kalangan ahli ilmu adalah mereka tidak suka seseorang itu bercakap ketika Imam berkhutbah. Mereka berkata: Jika orang lain bercakap, maka janganlah ditegur kecuali dengan isyarat.\nMereka berselisih pendapat tentang membalas salam dan mengucapkan ‘Yarhamukallah’ kepada orang yang bersin ketika Imam sedang berkhutbah. Sebahagian ahli ilmu memberi keringanan tentang membalas salam dan mengucapkan ‘Yarhamukallah’ kepada orang yang bersin ketika Imam sedang berkhutbah, dan itulah pendapat Ahmad dan Ishaq. Sebahagian ahli ilmu daripada kalangan tabi’in dan selain mereka tidak suka akan perkara itu, dan itulah pendapat As-Syafie."
  },
  {
    "id": 26293,
    "hadith_number": 513,
    "tajuk_hadith": "Menyekat Leher Orang Ramai pada Hari Jumaat",
    "perawi_melayu": "Sahl bin Ma'adh bin Anas al Jahni meriwayatkan daripada bapanya bahawa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا رِشْدِينُ بْنُ سَعْدٍ، عَنْ زَبَّانَ بْنِ فَائِدٍ، عَنْ سَهْلِ بْنِ مُعَاذِ بْنِ أَنَسٍ الْجُهَنِيِّ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ تَخَطَّى رِقَابَ النَّاسِ يَوْمَ الْجُمُعَةِ اتَّخَذَ جِسْرًا إِلَى جَهَنَّمَ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ جَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ سَهْلِ بْنِ مُعَاذِ بْنِ أَنَسٍ الْجُهَنِيِّ حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ رِشْدِينَ بْنِ سَعْدٍ ‏.‏ وَالْعَمَلُ عَلَيْهِ عِنْدَ أَهْلِ الْعِلْمِ كَرِهُوا أَنْ يَتَخَطَّى الرَّجُلُ رِقَابَ النَّاسِ يَوْمَ الْجُمُعَةِ وَشَدَّدُوا فِي ذَلِكَ ‏.‏ وَقَدْ تَكَلَّمَ بَعْضُ أَهْلِ الْعِلْمِ فِي رِشْدِينَ بْنِ سَعْدٍ وَضَعَّفَهُ مِنْ قِبَلِ حِفْظِهِ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Barangsiapa yang menyepak leher orang ramai pada hari Jumaat, nescaya dia telah membina jambatan ke neraka.\"  (Hadis ini juga diriwayatkan oleh Jabir). Imam Abu Isa berkata: Hadis Sahl bin Mu'adz bin Anas al-Juhani ini adalah hadis yang ganjil, kami tidak mengetahuinya melainkan daripada riwayat Rasyidin bin Saad. Amalan yang diamalkan oleh para ulama adalah mereka membenci seseorang itu menyepak leher orang ramai pada hari Jumaat dan mereka amat menekankan perkara ini.  Sesetengah ulama telah mengkritik Rasyidin bin Saad dan melemahkan hadisnya daripada segi hafalannya."
  },
  {
    "id": 26294,
    "hadith_number": 514,
    "tajuk_hadith": "Larangan Berjual Beli Semasa Khutbah Jumaat",
    "perawi_melayu": "Sahl bin Ma'adz meriwayatkan daripada bapanya:",
    "english_text": "\"The Prophet prohibited Al-Habwah on Friday while the Imam is delivering the Khutbah.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ، وَعَبَّاسُ بْنُ مُحَمَّدٍ الدُّورِيُّ، قَالاَ حَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ الْمُقْرِئُ، عَنْ سَعِيدِ بْنِ أَبِي أَيُّوبَ، حَدَّثَنِي أَبُو مَرْحُومٍ، عَنْ سَهْلِ بْنِ مُعَاذٍ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ الْحَبْوَةِ يَوْمَ الْجُمُعَةِ وَالإِمَامُ يَخْطُبُ ‏.‏ قَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَأَبُو مَرْحُومٍ اسْمُهُ عَبْدُ الرَّحِيمِ بْنُ مَيْمُونٍ ‏.‏ وَقَدْ كَرِهَ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ الْحَبْوَةَ يَوْمَ الْجُمُعَةِ وَالإِمَامُ يَخْطُبُ وَرَخَّصَ فِي ذَلِكَ بَعْضُهُمْ مِنْهُمْ عَبْدُ اللَّهِ بْنُ عُمَرَ وَغَيْرُهُ وَبِهِ يَقُولُ أَحْمَدُ وَإِسْحَاقُ لاَ يَرَيَانِ بِالْحَبْوَةِ وَالإِمَامُ يَخْطُبُ بَأْسًا ‏.‏",
    "malay_translation": "Rasulullah SAW melarang jual beli (al-habwah) pada hari Jumaat ketika Imam sedang menyampaikan khutbah."
  },
  {
    "id": 26295,
    "hadith_number": 515,
    "tajuk_hadith": "Doa Rasulullah SAW",
    "perawi_melayu": "Husain meriwayatkan:",
    "english_text": "\"I heard Umarah bin Rawaibah Ath-Thaqafi - while Bishr bin Marwan was delivering Khutbah and raising his hands in supplication - so Umarah said: 'May Allah disgrace these two insignificant hands, I have seen Allah's Messenger, and he would not do any more than this;'\" and Hushaim (one of the narrators) motioned with his index finger.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا حُصَيْنٌ، قَالَ سَمِعْتُ عُمَارَةَ بْنَ، رُوَيْبَةَ الثَّقَفِيَّ، وَبِشْرُ بْنُ مَرْوَانَ، يَخْطُبُ فَرَفَعَ يَدَيْهِ فِي الدُّعَاءِ فَقَالَ عُمَارَةُ قَبَّحَ اللَّهُ هَاتَيْنِ الْيُدَيَّتَيْنِ الْقُصَيِّرَتَيْنِ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَمَا يَزِيدُ عَلَى أَنْ يَقُولَ هَكَذَا وَأَشَارَ هُشَيْمٌ بِالسَّبَّابَةِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Aku mendengar Umarah bin Rawaibah Ath-Thaqafi, ketika Bishr bin Marwan menyampaikan khutbah dan mengangkat kedua tangannya untuk berdoa.  Maka Umarah berkata:  'Semoga Allah menghinakan kedua tangan yang pendek ini.  Sesungguhnya aku telah melihat Rasulullah SAW, dan baginda tidak berbuat lebih daripada ini,' dan Hushaim (salah seorang perawi) memberi isyarat dengan jari telunjuknya."
  },
  {
    "id": 26296,
    "hadith_number": 516,
    "tajuk_hadith": "Azan pada Zaman Rasulullah SAW, Abu Bakar, dan Umar",
    "perawi_melayu": "As-Sa'ib bin Yazid meriwayatkan:",
    "english_text": "\"The Adhan during the time of Allah's Messenger, Abu Bakr, and Umar was when the Imam came out,  added a third call at Az-Zawra.\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ الْخَيَّاطُ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنِ السَّائِبِ بْنِ يَزِيدَ، قَالَ كَانَ الأَذَانُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَبِي بَكْرٍ وَعُمَرَ إِذَا خَرَجَ الإِمَامُ وَإِذَا أُقِيمَتِ الصَّلاَةُ فَلَمَّا كَانَ عُثْمَانُ رضى الله عنه زَادَ النِّدَاءَ الثَّالِثَ عَلَى الزَّوْرَاءِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Azan pada zaman Rasulullah SAW, Abu Bakar, dan Umar adalah apabila imam keluar dan apabila solat telah diqamatkan.  Kemudian, ketika zaman Uthman r.a.,  seruan ketiga ditambah di Az-Zawra.  Abu Isa berkata:  Hadis ini adalah hadis yang baik dan sahih."
  },
  {
    "id": 26297,
    "hadith_number": 517,
    "tajuk_hadith": "Nabi SAW Bercakap Selepas Turun dari Mimbar",
    "perawi_melayu": "Anas bin Malik meriwayatkan:",
    "english_text": "\"Allah's Messenger would talk as necessary after descending from the Minbar.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، عَنْ ثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُكَلَّمُ بِالْحَاجَةِ إِذَا نَزَلَ عَنِ الْمِنْبَرِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ جَرِيرِ بْنِ حَازِمٍ ‏.‏ قَالَ وَسَمِعْتُ مُحَمَّدًا يَقُولُ وَهِمَ جَرِيرُ بْنُ حَازِمٍ فِي هَذَا الْحَدِيثِ وَالصَّحِيحُ مَا رُوِيَ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَ أُقِيمَتِ الصَّلاَةُ فَأَخَذَ رَجُلٌ بِيَدِ النَّبِيِّ صلى الله عليه وسلم فَمَا زَالَ يُكَلِّمُهُ حَتَّى نَعَسَ بَعْضُ الْقَوْمِ ‏.‏ قَالَ مُحَمَّدٌ وَالْحَدِيثُ هُوَ هَذَا ‏.‏ وَجَرِيرُ بْنُ حَازِمٍ رُبَّمَا يَهِمُ فِي الشَّىْءِ وَهُوَ صَدُوقٌ ‏.‏ قَالَ مُحَمَّدٌ وَهِمَ جَرِيرُ بْنُ حَازِمٍ فِي حَدِيثِ ثَابِتٍ عَنْ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا أُقِيمَتِ الصَّلاَةُ فَلاَ تَقُومُوا حَتَّى تَرَوْنِي ‏\"‏ ‏.‏ قَالَ مُحَمَّدٌ وَيُرْوَى عَنْ حَمَّادِ بْنِ زَيْدٍ قَالَ كُنَّا عِنْدَ ثَابِتٍ الْبُنَانِيِّ فَحَدَّثَ حَجَّاجٌ الصَّوَّافُ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا أُقِيمَتِ الصَّلاَةُ فَلاَ تَقُومُوا حَتَّى تَرَوْنِي ‏\"‏ ‏.‏ فَوَهِمَ جَرِيرٌ فَظَنَّ أَنَّ ثَابِتًا حَدَّثَهُمْ عَنْ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Daripada Muhammad bin Bashar, daripada Abu Daud Ath-Thayalisi, daripada Jarir bin Hazim, daripada Tsabit, daripada Anas bin Malik, katanya: Nabi SAW biasa bercakap tentang perkara yang perlu apabila baginda turun dari mimbar. Abu Isa berkata: Ini adalah hadis yang kami tidak mengetahuinya melainkan daripada hadis Jarir bin Hazim.  Aku mendengar Muhammad berkata: Jarir bin Hazim telah silap dalam hadis ini, dan yang sahih ialah apa yang diriwayatkan daripada Tsabit daripada Anas, katanya: Solat telah diiqamatkan, lalu seorang lelaki memegang tangan Nabi SAW dan terus bercakap dengan baginda sehingga sebahagian daripada orang ramai mengantuk.  Muhammad berkata: Hadisnya begini. Dan Jarir bin Hazim kadangkala silap dalam sesuatu perkara, walaupun dia seorang yang benar. Muhammad berkata: Jarir bin Hazim telah silap dalam hadis Tsabit daripada Anas daripada Nabi SAW yang bermaksud:  \"Apabila azan berkumandang, maka janganlah kamu bangun sehingga kamu melihat aku.\" Muhammad berkata:  Juga diriwayatkan daripada Hammad bin Zaid, katanya: Kami berada di sisi Tsabit Al-Bunani, lalu Hajjaj As-Sawwaf meriwayatkan daripada Yahya bin Abi Katsir, daripada Abdullah bin Abi Qatadah, daripada bapanya daripada Nabi SAW yang bermaksud: \"Apabila azan berkumandang, maka janganlah kamu bangun sehingga kamu melihat aku.\" Jarir telah silap dan menyangka bahawa Tsabit meriwayatkan kepada mereka daripada Anas daripada Nabi SAW."
  },
  {
    "id": 26298,
    "hadith_number": 518,
    "tajuk_hadith": "Nabi Bercakap Selepas Iqamah",
    "perawi_melayu": "Anas meriwayatkan:",
    "english_text": "\"I saw the Prophet, after the Iqamah was called for Salat, talking to a man who was standing between him and the Qiblah, he did not stop talking, and I saw some of them getting sleepy from his lengthy standing the Prophet.\"",
    "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ لَقَدْ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم بَعْدَ مَا تُقَامُ الصَّلاَةُ يُكَلِّمُهُ الرَّجُلُ يَقُومُ بَيْنَهُ وَبَيْنَ الْقِبْلَةِ فَمَا يَزَالُ يُكَلِّمُهُ فَلَقَدْ رَأَيْتُ بَعْضَنَا يَنْعَسُ مِنْ طُولِ قِيَامِ النَّبِيِّ صلى الله عليه وسلم لَهُ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Aku telah melihat Nabi SAW, setelah iqamah dilaungkan untuk solat, bercakap dengan seorang lelaki yang berdiri di antara baginda dan kiblat. Baginda terus bercakap dengannya, sehingga aku melihat sebahagian daripada kami mengantuk disebabkan Nabi SAW berdiri lama untuknya.  Abu Isa berkata: “Hadis ini adalah hadis yang baik dan sahih.”"
  },
  {
    "id": 26299,
    "hadith_number": 519,
    "tajuk_hadith": "Abu Hurairah Memimpin Solat Jumaat",
    "perawi_melayu": "Ubaidullah bin Abi Rafi', hamba sahaya Rasulullah SAW berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ، مَوْلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ اسْتَخْلَفَ مَرْوَانُ أَبَا هُرَيْرَةَ عَلَى الْمَدِينَةِ وَخَرَجَ إِلَى مَكَّةَ فَصَلَّى بِنَا أَبُو هُرَيْرَةَ يَوْمَ الْجُمُعَةِ فَقَرَأَ سُورَةَ الْجُمُعَةِ وَفِي السَّجْدَةِ الثَّانِيَةِ‏:‏ ‏(‏ِإذَا جَاءَكَ الْمُنَافِقُونَ ‏)‏ قَالَ عُبَيْدُ اللَّهِ فَأَدْرَكْتُ أَبَا هُرَيْرَةَ فَقُلْتُ لَهُ تَقْرَأُ بِسُورَتَيْنِ كَانَ عَلِيٌّ يَقْرَأُ بِهِمَا بِالْكُوفَةِ قَالَ أَبُو هُرَيْرَةَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقْرَأُ بِهِمَا ‏.‏ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ وَالنُّعْمَانِ بْنِ بَشِيرٍ وَأَبِي عِنَبَةَ الْخَوْلاَنِيِّ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَرُوِيَ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ يَقْرَأُ فِي صَلاَةِ الْجُمُعَةِ بِـ  ‏(‏ سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى ‏)‏ وَ ‏(‏هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ ‏)‏ ‏.‏ عُبَيْدُ اللَّهِ بْنُ أَبِي رَافِعٍ كَاتِبُ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ ‏.‏",
    "malay_translation": "Kami diberitahu oleh Qotaibah, yang diberitahu oleh Hatim bin Ismail, daripada Ja’far bin Muhammad, daripada bapanya, daripada Ubaidullah bin Abi Rafi’, hamba Rasulullah SAW, bahawa Marwan telah melantik Abu Hurairah sebagai pengganti di Madinah dan dia pergi ke Mekah. Maka Abu Hurairah telah mengetuai solat Jumaat kami, lalu membacakan Surah Al-Jumuah dan dalam rakaat kedua:  (إذَا جَاءَكَ الْمُنَافِقُونَ). Ubaidullah berkata: “Maka aku berjumpa dengan Abu Hurairah lalu aku berkata kepadanya: “Engkau membaca dua surah yang Ali membacanya di Kufah.” Abu Hurairah berkata: “Sesungguhnya aku mendengar Rasulullah SAW membacanya.”  Dan dalam bab ini daripada Ibnu Abbas, Nu’man bin Basir dan Abu ‘Inabah Al-Khaulani. Abu ‘Isa berkata: “Hadis Abu Hurairah adalah hadis yang baik dan sahih.”  Dan diriwayatkan daripada Nabi SAW bahawa baginda membaca dalam solat Jumaat dengan (سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى) dan (هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ). Ubaidullah bin Abi Rafi’ adalah penulis Ali bin Abi Talib RA."
  },
  {
    "id": 26300,
    "hadith_number": 520,
    "tajuk_hadith": "Bacaan Rasulullah SAW Semasa Solat Subuh Jumaat",
    "perawi_melayu": "Daripada Ibnu Abbas",
    "english_text": "\"For the Fajr prayer on Friday, Allah's Messenger would recite: Alif Lam Mem (which is) revealed in (Surat) As-Sajdah and, Has there not been over man.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا شَرِيكٌ، عَنْ مُخَوَّلِ بْنِ رَاشِدٍ، عَنْ مُسْلِمٍ الْبَطِينِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْرَأُ يَوْمَ الْجُمُعَةِ فِي صَلاَةِ الْفَجْرِ * ‏(‏تَنْزِيلُ ‏)‏ السَّجْدَةَ وَ ‏(‏هَلْ أَتَى عَلَى الإِنْسَانِ ‏)‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ سَعْدٍ وَابْنِ مَسْعُودٍ وَأَبِي هُرَيْرَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رَوَاهُ سُفْيَانُ الثَّوْرِيُّ وَشُعْبَةُ وَغَيْرُ وَاحِدٍ عَنْ مُخَوَّلٍ ‏.‏",
    "malay_translation": "Daripada Ibnu Abbas, beliau berkata: Rasulullah SAW membaca pada hari Jumaat ketika solat Subuh, ayat  *Alif Laam Mim* (yang diturunkan dalam) Surah As-Sajdah dan *“Tidakkah telah sampai kepada manusia?”*.  Riwayat lain yang sama maksudnya turut diriwayatkan daripada Saad, Ibnu Mas’ud dan Abu Hurairah.  Imam Abu Isa berkata: Riwayat Ibnu Abbas ini adalah hadis yang baik dan sahih. Ia juga diriwayatkan oleh Sufian al-Thawri, Syu’bah dan beberapa orang lagi daripada Mukhawalah."
  },
  {
    "id": 26301,
    "hadith_number": 521,
    "tajuk_hadith": "Solat Sunat Dua Rakaat Selepas Solat Jumaat",
    "perawi_melayu": "Salim meriwayatkan daripada bapanya:",
    "english_text": "\"The Prophet would pray two Rak;ah after the Friday prayer.\"",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ يُصَلِّي بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ جَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رُوِيَ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ أَيْضًا ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ وَبِهِ يَقُولُ الشَّافِعِيُّ وَأَحْمَدُ ‏.‏",
    "malay_translation": "Daripada Ibnu Umar, daripada Sufyan bin Uyainah, daripada Amru bin Dinār, daripada Az- Zuhri, daripada Salim, daripada bapanya, daripada Nabi SAW bahawa baginda selalu menunaikan solat sunat dua rakaat selepas solat Jumaat.  Di dalam bab ini juga terdapat riwayat daripada Jabir. Abu Isa berkata:  Hadis daripada Ibnu Umar ini adalah hadis yang hasan sahih. Ia juga diriwayatkan daripada Nafi’ daripada Ibnu Umar.  Amalan ini diamalkan oleh sebahagian ulamak, dan Imam Syafie dan Imam Ahmad juga berpendapat demikian."
  },
  {
    "id": 26302,
    "hadith_number": 522,
    "tajuk_hadith": "Solat Sunat Dua Rakah Selepas Solat Jumaat",
    "perawi_melayu": "Nafi' meriwayatkan daripada Ibnu Umar:",
    "english_text": "\"When he prayed the Friday prayer, he left and prayed two prostrations (Rak'ah) in his house. Then he said: 'Allah's Messenger would do this.'\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ كَانَ إِذَا صَلَّى الْجُمُعَةَ انْصَرَفَ فَصَلَّى سَجْدَتَيْنِ فِي بَيْتِهِ ثُمَّ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصْنَعُ ذَلِكَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Ibnu Umar berkata bahawa jika beliau telah menunaikan solat Jumaat, beliau akan pulang ke rumah dan menunaikan dua rakaat solat sunat. Kemudian beliau berkata, \"Rasulullah SAW juga berbuat demikian.\" "
  },
  {
    "id": 26303,
    "hadith_number": 523,
    "tajuk_hadith": "Solat Selepas Solat Jumaat",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ كَانَ مِنْكُمْ مُصَلِّيًا بَعْدَ الْجُمُعَةِ فَلْيُصَلِّ أَرْبَعًا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَلِيُّ بْنُ الْمَدِينِيِّ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ قَالَ كُنَّا نَعُدُّ سُهَيْلَ بْنَ أَبِي صَالِحٍ ثَبْتًا فِي الْحَدِيثِ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ ‏.‏ وَرُوِيَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ أَنَّهُ كَانَ يُصَلِّي قَبْلَ الْجُمُعَةِ أَرْبَعًا وَبَعْدَهَا أَرْبَعًا ‏.‏ وَقَدْ رُوِيَ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رضى الله عنه أَنَّهُ أَمَرَ أَنْ يُصَلَّى بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ ثُمَّ أَرْبَعًا ‏.‏ وَذَهَبَ سُفْيَانُ الثَّوْرِيُّ وَابْنُ الْمُبَارَكِ إِلَى قَوْلِ ابْنِ مَسْعُودٍ ‏.‏ وَقَالَ إِسْحَاقُ إِنْ صَلَّى فِي الْمَسْجِدِ يَوْمَ الْجُمُعَةِ صَلَّى أَرْبَعًا وَإِنْ صَلَّى فِي بَيْتِهِ صَلَّى رَكْعَتَيْنِ ‏.‏ وَاحْتَجَّ بِأَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ فِي بَيْتِهِ وَحَدِيثِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ مَنْ كَانَ مِنْكُمْ مُصَلِّيًا بَعْدَ الْجُمُعَةِ فَلْيُصَلِّ أَرْبَعًا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى وَابْنُ عُمَرَ هُوَ الَّذِي رَوَى عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ يُصَلِّي بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ فِي بَيْتِهِ وَابْنُ عُمَرَ بَعْدَ النَّبِيِّ صلى الله عليه وسلم صَلَّى فِي الْمَسْجِدِ بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ وَصَلَّى بَعْدَ الرَّكْعَتَيْنِ أَرْبَعًا ‏.‏ \nحَدَّثَنَا بِذَلِكَ ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، قَالَ رَأَيْتُ ابْنَ عُمَرَ صَلَّى بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ ثُمَّ صَلَّى بَعْدَ ذَلِكَ أَرْبَعًا ‏.‏ حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ قَالَ مَا رَأَيْتُ أَحَدًا أَنَصَّ لِلْحَدِيثِ مِنَ الزُّهْرِيِّ وَمَا رَأَيْتُ أَحَدًا الدَّنَانِيرُ وَالدَّرَاهِمُ أَهْوَنُ عَلَيْهِ مِنْهُ إِنْ كَانَتِ الدَّنَانِيرُ وَالدَّرَاهِمُ عِنْدَهُ بِمَنْزِلَةِ الْبَعْرِ ‏.‏ قَالَ أَبُو عِيسَى سَمِعْت ابْنَ أَبِي عُمَرَ قَال سَمِعْتُ سُفْيَانَ بْنَ عُيَيْنَةَ يَقُولُ كَانَ عَمْرُو بْنُ دِينَارٍ أَسَنَّ مِنْ الزُّهْرِيِّ",
    "malay_translation": "Daripada Ibnu Abi Umar, daripada Sufyan, daripada Suhail bin Abi Shalih, daripada bapanya, daripada Abu Hurairah, katanya; Rasulullah SAW bersabda: \"Barangsiapa di antara kamu yang hendak solat selepas solat Jumaat, maka hendaklah dia solat empat rakaat.\" Abu Isa berkata: Hadis ini adalah hadis yang baik dan sahih. Daripada Hasan bin Ali, daripada Ali bin Al-Madini, daripada Sufyan bin Uyainah, katanya: Kami menganggap Suhail bin Abi Shalih sebagai orang yang teguh dalam hadis. Dan amalan berdasarkan ini terdapat di kalangan sebahagian ulama. Dan diriwayatkan daripada Abdullah bin Mas'ud bahawa beliau solat empat rakaat sebelum Jumaat dan empat rakaat selepasnya. Dan diriwayatkan daripada Ali bin Abi Talib RA bahawa beliau memerintahkan agar selepas solat Jumaat disolat dua rakaat, kemudian empat rakaat. Dan Sufyan Ats-Tsauri dan Ibnu Al-Mubarak cenderung kepada pendapat Ibnu Mas'ud. Dan Ishaq berkata: Jika dia solat di masjid pada hari Jumaat, dia solat empat rakaat, dan jika dia solat di rumahnya, dia solat dua rakaat. Dan beliau berhujjah bahawa Nabi SAW solat dua rakaat di rumahnya selepas solat Jumaat, dan hadis Nabi SAW: \"Barangsiapa di antara kamu yang hendak solat selepas solat Jumaat, maka hendaklah dia solat empat rakaat.\" Abu Isa berkata: Ibnu Umar yang meriwayatkan daripada Nabi SAW bahawa baginda solat dua rakaat di rumahnya selepas solat Jumaat, dan Ibnu Umar selepas Nabi SAW solat dua rakaat di masjid selepas solat Jumaat, dan selepas dua rakaat itu beliau solat empat rakaat.  Daripada Ibnu Abi Umar, daripada Sufyan bin Uyainah, daripada Ibnu Juraij, daripada Ataa', katanya: Aku telah melihat Ibnu Umar solat dua rakaat selepas solat Jumaat, kemudian selepas itu dia solat empat rakaat. Daripada Sa'id bin Abdur Rahman Al-Makhzumi, daripada Sufyan bin Uyainah, daripada Amru bin Dinār, katanya: Aku tidak pernah melihat sesiapa yang lebih berpegang teguh kepada hadis daripada Az- Zuhri, dan aku tidak pernah melihat sesiapa yang lebih menganggap dinar dan dirham sebagai perkara yang remeh daripada dia, jika dinar dan dirham itu ada pada dirinya seperti halnya pasir. Abu Isa berkata: Aku mendengar Ibnu Abi Umar berkata: Aku mendengar Sufyan bin Uyainah berkata: Amru bin Dinār lebih tua daripada Az-Zuhri."
  },
  {
    "id": 26304,
    "hadith_number": 524,
    "tajuk_hadith": "Mengenai Solat yang Terlaksana",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، وَسَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ، وَغَيْرُ، وَاحِدٍ، قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ أَدْرَكَ مِنَ الصَّلاَةِ رَكْعَةً فَقَدْ أَدْرَكَ الصَّلاَةَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ قَالُوا مَنْ أَدْرَكَ رَكْعَةً مِنَ الْجُمُعَةِ صَلَّى إِلَيْهَا أُخْرَى وَمَنْ أَدْرَكَهُمْ جُلُوسًا صَلَّى أَرْبَعًا ‏.‏ وَبِهِ يَقُولُ سُفْيَانُ الثَّوْرِيُّ وَابْنُ الْمُبَارَكِ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Nasr bin Ali, dan Sa’id bin Abdurrahman, dan selainnya lagi, seorang, mereka berkata; telah menceritakan kepada kami Sufyan bin Uyainah, dari Az Zuhri, dari Abu Salamah, dari Abu Hurairah, dari Nabi SAW, baginda bersabda:  \"Barangsiapa yang sempat mengerjakan satu rakaat solat, maka sesungguhnya dia telah sempat mengerjakan solat.\"  Abu Isa berkata: Hadis ini adalah hadis yang hasan sahih. Dan amalan berdasarkan hadis ini terdapat pada kebanyakan ahli ilmu daripada sahabat-sahabat Nabi SAW dan selainnya. Mereka berkata: Barangsiapa yang sempat mengerjakan satu rakaat solat Jumaat, maka dia hendaklah meneruskan solat yang lain, dan barangsiapa yang mendapati mereka sedang duduk, maka dia hendaklah solat empat rakaat. Dan berdasarkan hadis ini juga, Sufyan Ats Tsauri, Ibnu Mubarak, As Syafie, Ahmad dan Ishaq berpendapat demikian."
  },
  {
    "id": 26305,
    "hadith_number": 525,
    "tajuk_hadith": "Tidak Makan Tengah Hari dan Tidur Qailulah Sebelum Solat Jumaat",
    "perawi_melayu": "Daripada Sahl bin Sa'd, ra:",
    "english_text": "\"We would not have lunch during the time of Allah's Messenger, nor would we have a siesta, until after the Friday prayer.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، وَعَبْدُ اللَّهِ بْنُ جَعْفَرٍ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، رضى الله عنه قَالَ مَا كُنَّا نَتَغَدَّى فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلاَ نَقِيلُ إِلاَّ بَعْدَ الْجُمُعَةِ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَنَسِ بْنِ مَالِكٍ رضى الله عنه ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ سَهْلِ بْنِ سَعْدٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Kami tidak makan tengah hari dan tidak tidur qailulah pada zaman Rasulullah SAW sehingga selepas solat Jumaat."
  },
  {
    "id": 26306,
    "hadith_number": 526,
    "tajuk_hadith": "Mengalihkan Tempat Duduk Ketika Mengantuk Semasa Solat Jumaat",
    "perawi_melayu": "Ibn Umar meriwayatkan bahawa:",
    "english_text": "the Prophet said: \"When one of you becomes sleepy during the Friday prayer, then let him move from where he is sitting.\"",
    "arabic_text": "حَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، وَأَبُو خَالِدٍ الأَحْمَرُ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا نَعَسَ أَحَدُكُمْ يَوْمَ الْجُمُعَةِ فَلْيَتَحَوَّلْ مِنْ مَجْلِسِهِ ذَلِكَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Apabila salah seorang daripada kamu mengantuk pada hari Jumaat ketika solat Jumaat, maka hendaklah dia berpindah dari tempat duduknya.\""
  },
  {
    "id": 26307,
    "hadith_number": 527,
    "tajuk_hadith": "Keutamaan Mengikuti Jemaah Jumaat",
    "perawi_melayu": "Ibnu Abbas meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْحَجَّاجِ، عَنِ الْحَكَمِ، عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ بَعَثَ النَّبِيُّ صلى الله عليه وسلم عَبْدَ اللَّهِ بْنَ رَوَاحَةَ فِي سَرِيَّةٍ فَوَافَقَ ذَلِكَ يَوْمَ الْجُمُعَةِ فَغَدَا أَصْحَابُهُ فَقَالَ أَتَخَلَّفُ فَأُصَلِّي مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ أَلْحَقُهُمْ ‏.‏ فَلَمَّا صَلَّى مَعَ النَّبِيِّ صلى الله عليه وسلم رَآهُ فَقَالَ ‏\"‏ مَا مَنَعَكَ أَنْ تَغْدُوَ مَعَ أَصْحَابِكَ ‏\"‏ ‏.‏ فَقَالَ أَرَدْتُ أَنْ أُصَلِّيَ مَعَكَ ثُمَّ أَلْحَقَهُمْ ‏.‏ قَالَ ‏\"‏ لَوْ أَنْفَقْتَ مَا فِي الأَرْضِ جَمِيعًا مَا أَدْرَكْتَ فَضْلَ غَدْوَتِهِمْ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏ قَالَ عَلِيُّ بْنُ الْمَدِينِيِّ قَالَ يَحْيَى بْنُ سَعِيدٍ قَالَ شُعْبَةُ لَمْ يَسْمَعِ الْحَكَمُ مِنْ مِقْسَمٍ إِلاَّ خَمْسَةَ أَحَادِيثَ ‏.‏ وَعَدَّهَا شُعْبَةُ وَلَيْسَ هَذَا الْحَدِيثُ فِيمَا عَدَّ شُعْبَةُ فَكَأَنَّ هَذَا الْحَدِيثَ لَمْ يَسْمَعْهُ الْحَكَمُ مِنْ مِقْسَمٍ ‏.‏ وَقَدِ اخْتَلَفَ أَهْلُ الْعِلْمِ فِي السَّفَرِ يَوْمَ الْجُمُعَةِ فَلَمْ يَرَ بَعْضُهُمْ بَأْسًا بِأَنْ يَخْرُجَ يَوْمَ الْجُمُعَةِ فِي السَّفَرِ مَا لَمْ تَحْضُرِ الصَّلاَةُ ‏.‏ وَقَالَ بَعْضُهُمْ إِذَا أَصْبَحَ فَلاَ يَخْرُجْ حَتَّى يُصَلِّيَ الْجُمُعَةَ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Mani', telah menceritakan kepada kami Abu Muawiyah, dari Al-Hajjaj, dari Al-Hakam, dari Miqsam, dari Ibnu Abbas, dia berkata: Rasulullah SAW telah mengutus Abdullah bin Rawahah dalam satu pasukan tentera. Peristiwa itu bertepatan pada hari Jumaat. Maka sahabat-sahabatnya berangkat awal pagi. Abdullah bin Rawahah berkata: \"Aku akan tinggal di belakang untuk menunaikan solat bersama Rasulullah SAW, kemudian aku akan menyusul mereka.\"  Setelah dia menunaikan solat bersama Nabi SAW, Nabi SAW melihatnya dan bertanya: \"Apakah yang menghalang kamu daripada berangkat awal bersama sahabat-sahabatmu?\"  Dia menjawab: \"Aku ingin menunaikan solat bersamamu, kemudian menyusul mereka.\"  Nabi SAW bersabda: \"Sekiranya engkau membelanjakan semua harta yang ada di muka bumi ini, nescaya engkau tidak akan dapat menyamai kelebihan yang telah engkau perolehi dengan berangkat awal pagi bersama mereka.\" Abu Isa berkata: Ini adalah hadis yang gharib (asing), kami tidak mengetahuinya melainkan melalui jalan ini. Ali bin Al-Madini berkata: Yahya bin Sa'id berkata: Syu'bah berkata: Al-Hakam tidak mendengar dari Miqsam melainkan lima hadis sahaja. Syu'bah telah menghitungnya dan hadis ini bukanlah di antara hadis-hadis yang dihitung oleh Syu'bah. Maka seolah-olah hadis ini tidak didengar oleh Al-Hakam dari Miqsam. Para ulama telah berselisih pendapat mengenai perjalanan pada hari Jumaat. Sebahagian mereka tidak melihat apa-apa kesalahan sekiranya seseorang itu melakukan perjalanan pada hari Jumaat selagi solat Jumaat tidak hadir. Dan sebahagian yang lain pula mengatakan: Sekiranya seseorang itu telah berada di suatu tempat pada waktu pagi, maka dia tidak boleh keluar sehingga menunaikan solat Jumaat."
  },
  {
    "id": 26308,
    "hadith_number": 528,
    "tajuk_hadith": "Berwuduk dan Menggunakan Wangian pada Hari Jumaat",
    "perawi_melayu": "Al-Bara' bin Azib meriwayatkan bahawa:",
    "english_text": "Allah's Messenger said: \"It is a duty for the Muslims, that they perform Ghusl on Friday, and that each of them wear some of his family's perfume. If he does not find any, then water is a perfume for him.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ الْكُوفِيُّ، حَدَّثَنَا أَبُو يَحْيَى، إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ التَّيْمِيُّ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ حَقٌّ عَلَى الْمُسْلِمِينَ أَنْ يَغْتَسِلُوا يَوْمَ الْجُمُعَةِ وَلْيَمَسَّ أَحَدُهُمْ مِنْ طِيبِ أَهْلِهِ فَإِنْ لَمْ يَجِدْ فَالْمَاءُ لَهُ طِيبٌ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي سَعِيدٍ وَشَيْخٍ مِنَ الأَنْصَارِ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Wajib ke atas orang Islam untuk mandi pada hari Jumaat dan hendaklah setiap mereka memakai sedikit wangian daripada ahli keluarganya. Jika tidak menjumpai wangian, maka air adalah wangian baginya.\""
  },
  {
    "id": 26309,
    "hadith_number": 529,
    "tajuk_hadith": "Hadis Riwayat Al-Bara' bin Azib:  Perbezaan Riwayat",
    "perawi_melayu": "Daripada Al-Bara' bin Azib:",
    "english_text": "(Another route for the same chain) similar in meaning.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا هُشَيْمٌ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ الْبَرَاءِ حَدِيثٌ حَسَنٌ ‏.‏ وَرِوَايَةُ هُشَيْمٍ أَحْسَنُ مِنْ رِوَايَةِ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ ‏.‏ وَإِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ التَّيْمِيُّ يُضَعَّفُ فِي الْحَدِيثِ ‏.‏ أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Ahmad bin Mani' telah meriwayatkan kepada kami, daripada Hisyam, daripada Yazid bin Abi Ziad, dengan sanad yang hampir sama maksudnya. Abu Isa berkata: Hadis Al-Bara' ini adalah hadis yang baik. Riwayat Hisyam lebih baik daripada riwayat Isma'il bin Ibrahim Al-Taymi.  Isma'il bin Ibrahim Al-Taymi dilemahkan dalam periwayatan hadis. (Bab-bab berkaitan kedua-dua hari raya daripada Rasulullah SAW)."
  }
]
