[
  {
    "id": 26589,
    "hadith_number": 809,
    "tajuk_hadith": "Keharaman Menumpahkan Darah dan Merosakkan Pokok di Tanah Haram Makkah",
    "perawi_melayu": "Sa'eed bin Abi Sa'eed Al Maqbury meriwayatkan:",
    "english_text": "\"Abu Shuraih Al-Adawi said tat when Amr bin Sa'eed was sending troops to Makkah he said to him: 'O Amr! Allow me to tell you what the Messenger of Allah said on the day following the Conquest of Makkah. My ears heard it, my heard understood it thoroughly, and with my own eyes, I saw the Prophet when he - after glorifying and praising Allah - said: \"Indeed Allah, the Most High, made Makkah a sanctuary, it was not made a sanctuary by the people. So it is not lawful for a man who believes in Allah and the Last Day to shed blood it, nor to cut down its trees. If anybody tries to use the Messenger of Allah to make an excuse for fighting in it, then say to him: 'Indeed Allah permitted His Messenger and He did not permit you.' Allah only allowed it for me for a few hours of one day, and today its sanctity has returned as it was before. So let the one who is present convey to the one who is absent.\" Abu Shuraih was asked: \"What was Amr bin Sa'eeds reply to you?\" He said: \"I am more knowledgeable about that than you Abu Shuraih! The Haram does not give protection to a disobedient person, nor a person fleeing for murder, nor fleeing for (Kharbah) lawlessness.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي شُرَيْحٍ الْعَدَوِيِّ، أَنَّهُ قَالَ لِعَمْرِو بْنِ سَعِيدٍ وَهُوَ يَبْعَثُ الْبُعُوثَ إِلَى مَكَّةَ ائْذَنْ لِي أَيُّهَا الأَمِيرُ أُحَدِّثْكَ قَوْلاً قَامَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم الْغَدَ مِنْ يَوْمِ الْفَتْحِ سَمِعَتْهُ أُذُنَاىَ وَوَعَاهُ قَلْبِي وَأَبْصَرَتْهُ عَيْنَاىَ حِينَ تَكَلَّمَ بِهِ أَنَّهُ حَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏\"‏ إِنَّ مَكَّةَ حَرَّمَهَا اللَّهُ وَلَمْ يُحَرِّمْهَا النَّاسُ وَلاَ يَحِلُّ لاِمْرِئٍ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ يَسْفِكَ فِيهَا دَمًا أَوْ يَعْضِدَ بِهَا شَجَرَةً فَإِنْ أَحَدٌ تَرَخَّصَ بِقِتَالِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِيهَا فَقُولُوا لَهُ إِنَّ اللَّهَ أَذِنَ لِرَسُولِهِ صلى الله عليه وسلم وَلَمْ يَأْذَنْ لَكَ وَإِنَّمَا أَذِنَ لِي فِيهِ سَاعَةً مِنَ النَّهَارِ وَقَدْ عَادَتْ حُرْمَتُهَا الْيَوْمَ كَحُرْمَتِهَا بِالأَمْسِ وَلْيُبَلِّغِ الشَّاهِدُ الْغَائِبَ ‏\"‏ ‏.‏ \nفَقِيلَ لأَبِي شُرَيْحٍ مَا قَالَ لَكَ عَمْرُو بْنُ سَعِيدٍ قَالَ أَنَا أَعْلَمُ مِنْكَ بِذَلِكَ يَا أَبَا شُرَيْحٍ إِنَّ الْحَرَمَ لاَ يُعِيذُ عَاصِيًا وَلاَ فَارًّا بِدَمٍ وَلاَ فَارًّا بِخَرْبَةٍ ‏.‏ قَالَ أَبُو عِيسَى وَيُرْوَى وَلاَ فَارًّا بِخِزْيَةٍ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ وَابْنِ عَبَّاسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي شُرَيْحٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَأَبُو شُرَيْحٍ الْخُزَاعِيُّ اسْمُهُ خُوَيْلِدُ بْنُ عَمْرٍو وَهُوَ الْعَدَوِيُّ وَهُوَ الْكَعْبِيُّ ‏.‏ وَمَعْنَى قَوْلِهِ ‏\"‏ وَلاَ فَارًّا بِخَرْبَةٍ ‏\"‏ يَعْنِي الْجِنَايَةَ يَقُولُ مَنْ جَنَى جِنَايَةً أَوْ أَصَابَ دَمًا ثُمَّ لَجَأَ إِلَى الْحَرَمِ فَإِنَّهُ يُقَامُ عَلَيْهِ الْحَدُّ ‏.‏",
    "malay_translation": "Abu Shuraih Al-Adawi berkata bahawa ketika Amr bin Sa'eed menghantar pasukan ke Makkah, beliau berkata kepadanya: 'Wahai Amr! Benarkan aku memberitahu engkau apa yang telah disampaikan oleh Rasulullah SAW pada hari selepas Fathu Makkah. Telingaku mendengarnya, hatiku memahaminya sepenuhnya, dan dengan mataku sendiri, aku melihat Nabi SAW, selepas memuji dan mensyukuri Allah SWT,  berkata: \"Sesungguhnya Allah SWT telah mengharamkan Makkah, bukan manusia yang mengharamkannya. Maka tidak halal bagi sesiapa yang beriman kepada Allah SWT dan hari akhirat untuk menumpahkan darah di dalamnya, atau menebang pokok-pokoknya. Jika ada sesiapa yang cuba menggunakan Rasulullah SAW sebagai alasan untuk berperang di dalamnya, maka katakanlah kepadanya: 'Sesungguhnya Allah SWT telah memberi izin kepada Rasul-Nya SAW, tetapi tidak kepada kamu.' Allah SWT hanya memberi izin kepadaku selama beberapa jam pada satu hari, dan hari ini keharamannya telah kembali seperti sebelumnya.  Sampaikanlah orang yang hadir kepada yang tidak hadir.\"  Abu Shuraih ditanya: \"Apakah jawapan Amr bin Sa'eed kepadamu?\" Beliau berkata: \"Aku lebih mengetahui daripada engkau, wahai Abu Shuraih! Tanah haram tidak memberi perlindungan kepada orang yang derhaka, atau orang yang melarikan diri kerana membunuh, atau melarikan diri kerana (kharbah) perbuatan keji.\""
  },
  {
    "id": 26590,
    "hadith_number": 810,
    "tajuk_hadith": "Keutamaan Menjalankan Haji dan Umrah Secara Bergantian",
    "perawi_melayu": "Abdullah bin Mas'ud meriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو سَعِيدٍ الأَشَجُّ قَالاَ حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ عَمْرِو بْنِ قَيْسٍ، عَنْ عَاصِمٍ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ تَابِعُوا بَيْنَ الْحَجِّ وَالْعُمْرَةِ فَإِنَّهُمَا يَنْفِيَانِ الْفَقْرَ وَالذُّنُوبَ كَمَا يَنْفِي الْكِيرُ خَبَثَ الْحَدِيدِ وَالذَّهَبِ وَالْفِضَّةِ وَلَيْسَ لِلْحَجَّةِ الْمَبْرُورَةِ ثَوَابٌ إِلاَّ الْجَنَّةُ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عُمَرَ وَعَامِرِ بْنِ رَبِيعَةَ وَأَبِي هُرَيْرَةَ وَعَبْدِ اللَّهِ بْنِ حُبْشِيٍّ وَأُمِّ سَلَمَةَ وَجَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ مَسْعُودٍ حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ حَدِيثِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ ‏.‏",
    "malay_translation": "Abdullah bin Mas'ud meriwayatkan bahawa Rasulullah SAW bersabda:  \"Lakukanlah haji dan umrah secara bergantian, kerana kedua-duanya menghilangkan kefakiran dan dosa sebagaimana api pelebur menghilangkan kekotoran besi, emas dan perak. Dan tidak ada balasan bagi haji yang mabrur melainkan syurga.\"  (Diriwayatkan juga oleh Umar, Amir bin Rabi’ah, Abu Hurairah, Abdullah bin Hubsyi, Ummu Salamah dan Jabir. Menurut Abu Isa, hadis daripada Ibnu Mas’ud ini adalah hadis yang baik, sahih dan ganjil daripada riwayat Abdullah bin Mas’ud.)"
  },
  {
    "id": 26591,
    "hadith_number": 811,
    "tajuk_hadith": "Pengampunan Dosa Haji",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa:",
    "english_text": "The Messenger of Allah said: \"Whoever performs Hajj for Allah, and he does not have sexual relations nor commit any sin, then his previous sins will be forgiven.\"",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ مَنْصُورٍ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ حَجَّ فَلَمْ يَرْفُثْ وَلَمْ يَفْسُقْ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَأَبُو حَازِمٍ كُوفِيٌّ وَهُوَ الأَشْجَعِيُّ وَاسْمُهُ سَلْمَانُ مَوْلَى عَزَّةَ الأَشْجَعِيَّةِ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Barangsiapa menunaikan haji kerana Allah, dan dia tidak melakukan perbuatan keji dan tidak melakukan sebarang dosa, maka dosa-dosanya yang lalu akan diampunkan.\""
  },
  {
    "id": 26592,
    "hadith_number": 812,
    "tajuk_hadith": "Kewajipan Haji Bagi Mereka Yang Mempunyai Kemampuan",
    "perawi_melayu": "Ali meriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى الْقُطَعِيُّ الْبَصْرِيُّ، حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِلاَلُ بْنُ عَبْدِ اللَّهِ، مَوْلَى رَبِيعَةَ بْنِ عَمْرِو بْنِ مُسْلِمٍ الْبَاهِلِيِّ حَدَّثَنَا أَبُو إِسْحَاقَ الْهَمْدَانِيُّ، عَنِ الْحَارِثِ، عَنْ عَلِيٍّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ مَلَكَ زَادًا وَرَاحِلَةً تُبَلِّغُهُ إِلَى بَيْتِ اللَّهِ وَلَمْ يَحُجَّ فَلاَ عَلَيْهِ أَنْ يَمُوتَ يَهُودِيًّا أَوْ نَصْرَانِيًّا وَذَلِكَ أَنَّ اللَّهَ يَقُولُ فِي كِتَابِهِ ‏:‏ ‏(‏وَلِلَّهِ عَلَى النَّاسِ حِجُّ الْبَيْتِ مَنِ اسْتَطَاعَ إِلَيْهِ سَبِيلاً ‏)‏ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ وَفِي إِسْنَادِهِ مَقَالٌ ‏.‏ وَهِلاَلُ بْنُ عَبْدِ اللَّهِ مَجْهُولٌ وَالْحَارِثُ يُضَعَّفُ فِي الْحَدِيثِ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Yahya al-Qutha'i al-Basri, telah menceritakan kepada kami Muslim bin Ibrahim, telah menceritakan kepada kami Hilal bin Abdullah, hamba kepada Rabiah bin Amru bin Muslim al-Bahili, telah menceritakan kepada kami Abu Ishaq al-Hamdani daripada al-Harith, daripada Ali, katanya: Rasulullah SAW bersabda:  \"Barangsiapa yang memiliki bekalan dan kenderaan yang dapat membawanya ke Baitullah (Baitulharam) tetapi dia tidak menunaikan haji, maka tidak mengapa jika dia mati sebagai seorang Yahudi atau Nasrani.  Ini kerana Allah SWT berfirman di dalam Kitab-Nya:  '(Dan bagi Allah atas manusia mengerjakan haji ke Baitullah, iaitu bagi sesiapa yang mampu sampai ke padanya jalan.)'\" Abu Isa berkata:  Hadis ini adalah hadis yang ganjil, kami tidak mengetahuinya melainkan melalui jalan ini, dan terdapat kelemahan dalam sanadnya. Hilal bin Abdullah adalah seorang yang tidak dikenali dan al-Harith dilemahkan dalam meriwayatkan hadis."
  },
  {
    "id": 26593,
    "hadith_number": 813,
    "tajuk_hadith": "Syarat Wajib Haji",
    "perawi_melayu": "Ibn Umar meriwayatkan:",
    "english_text": "\"A man came to the Prophet and said: 'O Messenger of Allah! What is it that makes Hajj obligatory?' He said: \"The provisions and a means of conveyance.\"",
    "arabic_text": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ يَزِيدَ، عَنْ مُحَمَّدِ بْنِ عَبَّادِ بْنِ جَعْفَرٍ، عَنِ ابْنِ عُمَرَ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ مَا يُوجِبُ الْحَجَّ قَالَ ‏\n\"‏ الزَّادُ وَالرَّاحِلَةُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَالْعَمَلُ عَلَيْهِ عِنْدَ أَهْلِ الْعِلْمِ أَنَّ الرَّجُلَ إِذَا مَلَكَ زَادًا وَرَاحِلَةً وَجَبَ عَلَيْهِ الْحَجُّ ‏.‏ وَإِبْرَاهِيمُ بْنُ يَزِيدَ هُوَ الْخُوزِيُّ الْمَكِّيُّ وَقَدْ تَكَلَّمَ فِيهِ بَعْضُ أَهْلِ الْعِلْمِ مِنْ قِبَلِ حِفْظِهِ ‏.‏",
    "malay_translation": "Seorang lelaki datang kepada Nabi SAW dan berkata: \"Wahai Rasulullah! Apakah yang mewajibkan haji?\" Baginda SAW menjawab: \"Zakat dan kenderaan.\" "
  },
  {
    "id": 26594,
    "hadith_number": 814,
    "tajuk_hadith": "Haji: Ketaatan Tahunan atau Tidak?",
    "perawi_melayu": "Ali bin Abi Talib meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا مَنْصُورُ بْنُ وَرْدَانَ، عَنْ عَلِيِّ بْنِ عَبْدِ الأَعْلَى، عَنْ أَبِيهِ، عَنْ أَبِي الْبَخْتَرِيِّ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، قَالَ لَمَّا نَزَلَتْ ‏(‏ وَلِلَّهِ عَلَى النَّاسِ حِجُّ الْبَيْتِ مَنِ اسْتَطَاعَ إِلَيْهِ سَبِيلاً ‏)‏ قَالُوا يَا رَسُولَ اللَّهِ أَفِي كُلِّ عَامٍ فَسَكَتَ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ أَفِي كُلِّ عَامٍ قَالَ ‏\"‏ لاَ وَلَوْ قُلْتُ نَعَمْ لَوَجَبَتْ ‏\"‏ ‏.‏ فَأَنْزَلَ اللَّهُ ‏:‏ ‏(‏يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تَسْأَلُوا عَنْ أَشْيَاءَ إِنْ تُبْدَ لَكُمْ تَسُؤْكُمْ ‏)‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ وَأَبِي هُرَيْرَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَلِيٍّ حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ وَاسْمُ أَبِي الْبَخْتَرِيِّ سَعِيدُ بْنُ أَبِي عِمْرَانَ وَهُوَ سَعِيدُ بْنُ فَيْرُوزَ ‏.‏",
    "malay_translation": "Daripada Abu Said Al-Asyaj, telah menceritakan kepada kami Mansur bin Wardan, daripada Ali bin Abdul Ala, daripada bapanya, daripada Abu Bakhtari, daripada Ali bin Abi Talib, katanya: \"Apabila turun ayat (Dan Allah mewajibkan ke atas manusia mengerjakan haji ke Baitullah bagi sesiapa yang mampu sampai kepadanya), mereka bertanya: \"Wahai Rasulullah, adakah setiap tahun?\" Maka baginda Rasulullah SAW berdiam diri. Mereka bertanya lagi: \"Wahai Rasulullah, adakah setiap tahun?\" Baginda menjawab: \"Tidak. Dan sekiranya Aku katakan ya, nescaya ia menjadi wajib.\" Kemudian Allah menurunkan ayat: \"Wahai orang-orang yang beriman, janganlah kamu bertanya tentang perkara-perkara yang jika dijelaskan kepada kamu, akan menyusahkan kamu.\"  Juga diriwayatkan dalam bab ini daripada Ibnu Abbas dan Abu Hurairah. Abu Isa berkata: Hadis Ali ini adalah hadis yang baik dan ganjil daripada segi ini. Nama Abu Bakhtari ialah Said bin Abi Imran dan baginda juga dikenali sebagai Said bin Fairuz."
  },
  {
    "id": 26595,
    "hadith_number": 815,
    "tajuk_hadith": "Haji Nabi SAW: Tiga Haji dan Korban",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي زِيَادٍ الْكُوفِيُّ، حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ، عَنْ سُفْيَانَ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم حَجَّ ثَلاَثَ حِجَجٍ حَجَّتَيْنِ قَبْلَ أَنْ يُهَاجِرَ وَحَجَّةً بَعْدَ مَا هَاجَرَ وَمَعَهَا عُمْرَةٌ فَسَاقَ ثَلاَثًا وَسِتِّينَ بَدَنَةً وَجَاءَ عَلِيٌّ مِنَ الْيَمَنِ بِبَقِيَّتِهَا فِيهَا جَمَلٌ لأَبِي جَهْلٍ فِي أَنْفِهِ بُرَةٌ مِنْ فِضَّةٍ فَنَحَرَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ كُلِّ بَدَنَةٍ بِبَضْعَةٍ فَطُبِخَتْ وَشَرِبَ مِنْ مَرَقِهَا ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ حَدِيثِ سُفْيَانَ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ زَيْدِ بْنِ حُبَابٍ ‏.‏ وَرَأَيْتُ عَبْدَ اللَّهِ بْنَ عَبْدِ الرَّحْمَنِ رَوَى هَذَا الْحَدِيثَ فِي كُتُبِهِ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي زِيَادٍ ‏.‏ قَالَ وَسَأَلْتُ مُحَمَّدًا عَنْ هَذَا فَلَمْ يَعْرِفْهُ مِنْ حَدِيثِ الثَّوْرِيِّ عَنْ جَعْفَرٍ عَنْ أَبِيهِ عَنْ جَابِرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَرَأَيْتُهُ لاَ يَعُدُّ هَذَا الْحَدِيثَ مَحْفُوظًا ‏.‏ وَقَالَ إِنَّمَا يُرْوَى عَنِ الثَّوْرِيِّ عَنْ أَبِي إِسْحَاقَ عَنْ مُجَاهِدٍ مُرْسَلاً ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Abi Ziad Al-Kufi, telah menceritakan kepada kami Zaid bin Hubab, dari Sufyan, dari Ja'far bin Muhammad, dari bapanya, dari Jabir bin Abdullah, bahawa Nabi SAW telah menunaikan haji sebanyak tiga kali. Dua kali sebelum hijrah dan sekali selepas hijrah, dan bersama ibadah umrah. Baginda telah menyembelih enam puluh tiga ekor unta korban (badanah), dan Ali datang dari Yaman membawa baki unta korban tersebut, antaranya seekor unta milik Abu Jahal yang mempunyai cincin perak di hidungnya.  Maka Rasulullah SAW menyembelihnya, dan Rasulullah SAW memerintahkan supaya sebahagian dari setiap unta tersebut dimasak, dan baginda meminum kuahnya. Abu Isa berkata: Hadis ini adalah hadis yang ganjil daripada riwayat Sufyan, kami tidak mengetahuinya melainkan daripada riwayat Zaid bin Hubab. Dan aku telah melihat Abdullah bin Abdurrahman meriwayatkan hadis ini dalam kitab-kitabnya daripada Abdullah bin Abi Ziad.  Dia berkata: Aku telah bertanya kepada Muhammad tentang hadis ini, maka dia tidak mengetahuinya daripada riwayat Tsauri daripada Ja'far daripada bapanya daripada Jabir daripada Nabi SAW. Dan aku melihatnya tidak menganggap hadis ini sebagai hadis yang terpelihara. Dan dia berkata: Hadis ini hanya diriwayatkan daripada Tsauri daripada Abu Ishaq daripada Mujahid secara mursal."
  },
  {
    "id": 26596,
    "hadith_number": 816,
    "tajuk_hadith": "Bilangan Haji dan Umrah Nabi SAW",
    "perawi_melayu": "Qatadah meriwayatkan:",
    "english_text": "\"I said to Anas bin Malik: 'How many times did the Prophet perform Hajj?' He said: 'He performed one Hajj and he performed four Umrah: An Umrah during Dhul-Qa'dah; the Umrah of Al-Hudaibiyah, and Umrah with his Hajj, and an Umrah from Al-Ji'irranah when he divided up the war spoils of Hunain.'\"",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا حَبَّانُ بْنُ هِلاَلٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، قَالَ قُلْتُ لأَنَسِ بْنِ مَالِكٍ كَمْ حَجَّ النَّبِيُّ صلى الله عليه وسلم قَالَ حَجَّةٌ وَاحِدَةٌ وَاعْتَمَرَ أَرْبَعَ عُمَرٍ عُمْرَةٌ فِي ذِي الْقَعْدَةِ وَعُمْرَةُ الْحُدَيْبِيَةِ وَعُمْرَةٌ مَعَ حَجَّتِهِ وَعُمْرَةُ الْجِعِرَّانَةِ إِذْ قَسَّمَ غَنِيمَةَ حُنَيْنٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَحَبَّانُ بْنُ هِلاَلٍ هُوَ أَبُو حَبِيبٍ الْبَصْرِيُّ هُوَ جَلِيلٌ ثِقَةٌ وَثَّقَهُ يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ ‏.‏",
    "malay_translation": "Aku berkata kepada Anas bin Malik: ‘Berapa kali Nabi SAW menunaikan Haji?’ Jawabnya: ‘Baginda menunaikan haji sekali dan empat kali umrah: Satu umrah pada bulan Zulkaedah, umrah di Hudaibiyyah, umrah bersama-sama dengan hajinya dan umrah di Ji’ranah ketika Baginda membahagikan ghanimah Hunain.’"
  },
  {
    "id": 26597,
    "hadith_number": 817,
    "tajuk_hadith": "Empat Umrah Rasulullah",
    "perawi_melayu": "Ibn Abbas meriwayatkan:",
    "english_text": "\"The Messenger of Allah performed four Umrah: The Umrah of Al-Hudaibiyah, a second Umrah the following (year), (which was) the Umrah of Al-Qisas during Dhul-Qa'dah, a third Umrah from Al-Ji'irranah, and the fourth which accompanied his Hajj.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا دَاوُدُ بْنُ عَبْدِ الرَّحْمَنِ الْعَطَّارُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم اعْتَمَرَ أَرْبَعَ عُمَرٍ عُمْرَةَ الْحُدَيْبِيَةِ وَعُمْرَةَ الثَّانِيَةِ مِنْ قَابِلٍ وَعُمْرَةَ الْقَضَاءِ فِي ذِي الْقَعْدَةِ وَعُمْرَةَ الثَّالِثَةِ مِنَ الْجِعِرَّانَةِ وَالرَّابِعَةِ الَّتِي مَعَ حَجَّتِهِ.‏ \nقَالَ وَفِي الْبَابِ عَنْ أَنَسٍ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَابْنِ عُمَرَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏ \nوَرَوَى ابْنُ عُيَيْنَةَ، هَذَا الْحَدِيثَ عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عِكْرِمَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم اعْتَمَرَ أَرْبَعَ عُمَرٍ ‏.‏ وَلَمْ يَذْكُرْ فِيهِ عَنِ ابْنِ عَبَّاسٍ ‏.‏ قَالَ حَدَّثَنَا بِذَلِكَ سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عِكْرِمَةَ أَنَّ النَّبِيَّ صلى الله عليه وسلم فَذَكَرَ نَحْوَهُ ‏.‏",
    "malay_translation": "Rasulullah SAW telah menunaikan empat umrah: Umrah Hudaibiyyah, umrah kedua pada tahun berikutnya, iaitu umrah Qada' pada bulan Zulkaedah, umrah ketiga dari Al-Ji'irranah, dan umrah keempat yang bersamaan dengan ibadat haji baginda."
  },
  {
    "id": 26598,
    "hadith_number": 818,
    "tajuk_hadith": "Rasulullah SAW Mengumunkan Haji dan Berihram di Al-Baida'",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan:",
    "english_text": "\"When the Prophet wanted to Perform Hajj, he announced it to the people, and they gathered (to accompany him). When he reached Al-Baida he assumed Ihram\"",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ لَمَّا أَرَادَ النَّبِيُّ صلى الله عليه وسلم الْحَجَّ أَذَّنَ فِي النَّاسِ فَاجْتَمَعُوا فَلَمَّا أَتَى الْبَيْدَاءَ أَحْرَمَ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عُمَرَ وَأَنَسٍ وَالْمِسْوَرِ بْنِ مَخْرَمَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ جَابِرٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Jabir bin Abdullah berkata:  Apabila Nabi SAW hendak menunaikan haji, baginda mengumumkannya kepada orang ramai, maka mereka berkumpul (untuk menyertai baginda).  Apabila baginda sampai di Al-Baida', baginda berihram."
  },
  {
    "id": 26599,
    "hadith_number": 819,
    "tajuk_hadith": "Ketibaan Rasulullah SAW di Al-Baida'",
    "perawi_melayu": "Ibn Umar meriwayatkan:",
    "english_text": "\"Al-Baida the one they lie about regarding the Messenger of Allah. By Allah! The Messenger of Allah did not start the Talbiyah except from near the Masjid, near the tree.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنِ ابْنِ عُمَرَ، قَالَ الْبَيْدَاءُ الَّتِي يَكْذِبُونَ فِيهَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَاللَّهِ مَا أَهَلَّ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلاَّ مِنْ عِنْدِ الْمَسْجِدِ مِنْ عِنْدِ الشَّجَرَةِ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Al-Baida’ yang mereka dustakan tentang Rasulullah SAW. Demi Allah! Rasulullah SAW tidak melafazkan talbiyah melainkan berhampiran masjid, berhampiran pokok."
  },
  {
    "id": 26600,
    "hadith_number": 820,
    "tajuk_hadith": "Talbiyah Selepas Solat",
    "perawi_melayu": "Ibnu Abbas meriwayatkan:",
    "english_text": "\"The Prophet started the Talbiyah after the Salat.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ السَّلاَمِ بْنُ حَرْبٍ، عَنْ خُصَيْفٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَهَلَّ فِي دُبُرِ الصَّلاَةِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لاَ نَعْرِفُ أَحَدًا رَوَاهُ غَيْرَ عَبْدِ السَّلاَمِ بْنِ حَرْبٍ ‏.‏ وَهُوَ الَّذِي يَسْتَحِبُّهُ أَهْلُ الْعِلْمِ أَنْ يُحْرِمَ الرَّجُلُ فِي دُبُرِ الصَّلاَةِ ‏.‏",
    "malay_translation": "Ibnu Abbas meriwayatkan bahawa Nabi SAW  memulakan Talbiyah selepas solat.  Abu Isa berkata: “Hadis ini adalah hadis yang baik dan ganjil. Kami tidak mengetahui sesiapa yang meriwayatkannya selain daripada Abdus Salam bin Harb.  Dan inilah yang disukai oleh para ulama’, iaitu seorang lelaki berihram selepas solat.”"
  },
  {
    "id": 26601,
    "hadith_number": 821,
    "tajuk_hadith": "Rasulullah SAW Menunaikan Haji Ifrad",
    "perawi_melayu": "Aisyah meriwayatkan:",
    "english_text": "\"the Messenger of Allah performed the Ifrad form of Hajj.\"",
    "arabic_text": "حَدَّثَنَا أَبُو مُصْعَبٍ، قِرَاءَةً عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَفْرَدَ الْحَجَّ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ جَابِرٍ وَابْنِ عُمَرَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَائِشَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ ‏.‏ \nوَرُوِيَ عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَفْرَدَ الْحَجَّ وَأَفْرَدَ أَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ ‏.‏ \nحَدَّثَنَا بِذَلِكَ قُتَيْبَةُ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نَافِعٍ الصَّائِغُ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ بِهَذَا ‏.‏ قَالَ أَبُو عِيسَى وَقَالَ الثَّوْرِيُّ إِنْ أَفْرَدْتَ الْحَجَّ فَحَسَنٌ وَإِنْ قَرَنْتَ فَحَسَنٌ وَإِنْ تَمَتَّعْتَ فَحَسَنٌ ‏.‏ وَقَالَ الشَّافِعِيُّ مِثْلَهُ ‏.‏ وَقَالَ أَحَبُّ إِلَيْنَا الإِفْرَادُ ثُمَّ التَّمَتُّعُ ثُمَّ الْقِرَانُ ‏.‏",
    "malay_translation": "Aisyah meriwayatkan bahawa Rasulullah SAW menunaikan haji secara ifrad."
  },
  {
    "id": 26602,
    "hadith_number": 822,
    "tajuk_hadith": "Labbaik Dengan Umrah dan Haji",
    "perawi_melayu": "Anas meriwayatkan:",
    "english_text": "\"I heard the Prophet saying: (Labbaika Bi'umratin wa Hajjah) 'Here I am for 'Umrah and Hajj.'\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لَبَّيْكَ بِعُمْرَةٍ وَحَجَّةٍ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عُمَرَ وَعِمْرَانَ بْنِ حُصَيْنٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَنَسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ ذَهَبَ بَعْضُ أَهْلِ الْعِلْمِ إِلَى هَذَا ‏.‏ وَاخْتَارُوهُ مِنْ أَهْلِ الْكُوفَةِ وَغَيْرِهِمْ ‏.‏",
    "malay_translation": "Aku mendengar Nabi SAW bersabda:  \"Labbaik bi umratin wa hajjan.\" (Ya Allah, aku sambut panggilan-Mu untuk mengerjakan umrah dan haji.)"
  },
  {
    "id": 26603,
    "hadith_number": 823,
    "tajuk_hadith": "Rasulullah SAW dan Para Khulafa' Rasyidin Mempraktikkan Tamattu'",
    "perawi_melayu": "Ibn Abbas meriwayatkan:",
    "english_text": "\"The Messenger of Allah performed Tamattu, as did Abu Bakr, Umar and Uthman. And the first to prohibit it was Mu'awiyah.\"",
    "arabic_text": "حَدَّثَنَا أَبُو مُوسَى، مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ لَيْثٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ تَمَتَّعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ وَأَوَّلُ مَنْ نَهَى عَنْهَا مُعَاوِيَةُ ‏",
    "malay_translation": "Rasulullah SAW telah melakukan tamattu', begitu juga Abu Bakar, Umar, dan Uthman. Dan orang pertama yang melarangnya ialah Muawiyah."
  },
  {
    "id": 26604,
    "hadith_number": 824,
    "tajuk_hadith": "Rasulullah SAW Beramal dengan Tamattu'",
    "perawi_melayu": "Muhammad bin Abdullah bin Al-Harith bin Nawfal meriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنِ ابْنِ شِهَابٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ، أَنَّهُ سَمِعَ سَعْدَ بْنَ أَبِي وَقَّاصٍ، وَالضَّحَّاكَ بْنَ قَيْسٍ، وَهُمَا، يَذْكُرَانِ التَّمَتُّعَ بِالْعُمْرَةِ إِلَى الْحَجِّ فَقَالَ الضَّحَّاكُ بْنُ قَيْسٍ لاَ يَصْنَعُ ذَلِكَ إِلاَّ مَنْ جَهِلَ أَمْرَ اللَّهِ ‏.‏ فَقَالَ سَعْدٌ بِئْسَ مَا قُلْتَ يَا ابْنَ أَخِي ‏.‏ فَقَالَ الضَّحَّاكُ بْنُ قَيْسٍ فَإِنَّ عُمَرَ بْنَ الْخَطَّابِ قَدْ نَهَى عَنْ ذَلِكَ ‏.‏ فَقَالَ سَعْدٌ قَدْ صَنَعَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَصَنَعْنَاهَا مَعَهُ ‏.‏ قَالَ هَذَا حَدِيثٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Kutabah telah meriwayatkan daripada Malik bin Anas, daripada Ibnu Syihab, daripada Muhammad bin Abdullah bin Al-Harith bin Nawfal bahawa beliau mendengar Saad bin Abi Waqqas dan Ad-Dahhak bin Qais sedang menyebut tentang tamattu’ dengan umrah hingga haji.  Maka Ad-Dahhak bin Qais berkata: “Tiada siapa yang melakukan demikian melainkan orang yang jahil akan perintah Allah.” Saad berkata: “Betapa buruknya apa yang engkau katakan wahai anak saudaraku!”  Maka Ad-Dahhak bin Qais berkata: “Sesungguhnya Umar bin Al-Khattab telah melarang perkara itu.” Maka Saad berkata: “Rasulullah SAW telah melakukannya, dan kami telah melakukannya bersama baginda.”  (Hadis ini sahih)."
  },
  {
    "id": 26605,
    "hadith_number": 825,
    "tajuk_hadith": "Keharusan Tamattu dalam Umrah dan Haji",
    "perawi_melayu": "Salim bin Abdullah meriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنِ ابْنِ شِهَابٍ، أَنَّ سَالِمَ بْنَ عَبْدِ اللَّهِ، حَدَّثَهُ أَنَّهُ، سَمِعَ رَجُلاً، مِنْ أَهْلِ الشَّامِ وَهُوَ يَسْأَلُ عَبْدَ اللَّهِ بْنَ عُمَرَ عَنِ التَّمَتُّعِ بِالْعُمْرَةِ إِلَى الْحَجِّ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ هِيَ حَلاَلٌ ‏.‏ فَقَالَ الشَّامِيُّ إِنَّ أَبَاكَ قَدْ نَهَى عَنْهَا ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ أَرَأَيْتَ إِنْ كَانَ أَبِي نَهَى عَنْهَا وَصَنَعَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَأَمْرَ أَبِي نَتَّبِعُ أَمْ أَمْرَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ الرَّجُلُ بَلْ أَمْرَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَقَالَ لَقَدْ صَنَعَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَلِيٍّ وَعُثْمَانَ وَجَابِرٍ وَسَعْدٍ وَأَسْمَاءَ بِنْتِ أَبِي بَكْرٍ وَابْنِ عُمَرَ ‏.‏ وَقَدِ اخْتَارَ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمُ التَّمَتُّعَ بِالْعُمْرَةِ ‏.‏ وَالتَّمَتُّعُ أَنْ يَدْخُلَ الرَّجُلُ بِعُمْرَةٍ فِي أَشْهُرِ الْحَجِّ ثُمَّ يُقِيمَ حَتَّى يَحُجَّ فَهُوَ مُتَمَتِّعٌ وَعَلَيْهِ دَمٌ مَا اسْتَيْسَرَ مِنَ الْهَدْىِ فَإِنْ لَمْ يَجِدْ صَامَ ثَلاَثَةَ أَيَّامٍ فِي الْحَجِّ وَسَبْعَةً إِذَا رَجَعَ إِلَى أَهْلِهِ وَيُسْتَحَبُّ لِلْمُتَمَتِّعِ إِذَا صَامَ ثَلاَثَةَ أَيَّامٍ فِي الْحَجِّ أَنْ يَصُومَ فِي الْعَشْرِ وَيَكُونَ آخِرُهَا يَوْمَ عَرَفَةَ فَإِنْ لَمْ يَصُمْ فِي الْعَشْرِ صَامَ أَيَّامَ التَّشْرِيقِ فِي قَوْلِ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم مِنْهُمُ ابْنُ عُمَرَ وَعَائِشَةُ وَبِهِ يَقُولُ مَالِكٌ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ ‏.‏ وَقَالَ بَعْضُهُمْ لاَ يَصُومُ أَيَّامَ التَّشْرِيقِ ‏.‏ وَهُوَ قَوْلُ أَهْلِ الْكُوفَةِ ‏.‏ قَالَ أَبُو عِيسَى وَأَهْلُ الْحَدِيثِ يَخْتَارُونَ التَّمَتُّعَ بِالْعُمْرَةِ فِي الْحَجِّ وَهُوَ قَوْلُ الشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏",
    "malay_translation": "Kami telah mendengar daripada Abd bin Humaid, yang memberitahu aku (Yakub bin Ibrahim bin Saad), yang memberitahu ayahku (daripada Saleh bin Kaisan), daripada Ibnu Syihab, bahawa Salim bin Abdullah telah memberitahunya bahawa dia telah mendengar seorang lelaki dari penduduk Syam bertanya kepada Abdullah bin Umar tentang tamattu (iaitu mengerjakan umrah dahulu kemudian diikuti haji)  maka Abdullah bin Umar berkata: \"Ia adalah halal.\" Lelaki dari Syam itu berkata: \"Tetapi ayahmu melarangnya.\" Maka Abdullah bin Umar berkata: \"Adakah kita mengikut perintah ayahku atau perintah Rasulullah SAW?\" Lelaki itu berkata: \"Tentulah perintah Rasulullah SAW.\" Maka Abdullah bin Umar berkata: \"Sesungguhnya Rasulullah SAW telah melakukannya.\"  Ini adalah hadis yang hasan sahih.  Di dalam bab ini juga terdapat riwayat daripada Ali, Uthman, Jabir, Saad, Asma' binti Abu Bakar dan Ibnu Umar. Sesungguhnya segolongan ulama daripada sahabat Nabi SAW dan selainnya telah memilih tamattu dalam umrah. Tamattu ialah seseorang itu mengerjakan umrah pada bulan-bulan haji, kemudian dia tinggal sehingga mengerjakan haji, maka dia dikenali sebagai mutamatti' dan dia wajib menyembelih seekor haiwan korban sekadar kemampuannya. Jika dia tidak mampu, dia wajib berpuasa tiga hari ketika haji dan tujuh hari apabila pulang ke keluarganya.  Sunat bagi mutamatti' yang berpuasa tiga hari ketika haji untuk berpuasa pada sepuluh hari terakhir Zulhijjah yang berakhir pada hari Arafah. Jika dia tidak berpuasa pada sepuluh hari terakhir Zulhijjah, dia boleh berpuasa pada hari-hari tasyriq menurut pendapat sebahagian ulama sahabat Nabi SAW, antaranya Ibnu Umar dan Aisyah. Begitu juga pendapat Malik, Syafie, Ahmad dan Ishak. Sebahagian ulama pula mengatakan tidak perlu berpuasa pada hari-hari tasyriq. Inilah pendapat penduduk Kufah. Abu Isa berkata, dan ahli hadis memilih tamattu dalam umrah ketika haji, dan itulah pendapat Syafie, Ahmad dan Ishak."
  },
  {
    "id": 26606,
    "hadith_number": 826,
    "tajuk_hadith": "Tulisan Talbiyah Nabi SAW",
    "perawi_melayu": "Ibn Umar meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ تَلْبِيَةَ النَّبِيِّ، صلى الله عليه وسلم كَانَتْ ‏\n\"‏ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ لَبَّيْكَ لاَ شَرِيكَ لَكَ لَبَّيْكَ إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ لاَ شَرِيكَ لَكَ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ مَسْعُودٍ وَجَابِرٍ وَعَائِشَةَ وَابْنِ عَبَّاسٍ وَأَبِي هُرَيْرَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَيْهِ عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ وَهُوَ قَوْلُ سُفْيَانَ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏ قَالَ الشَّافِعِيُّ وَإِنْ زَادَ فِي التَّلْبِيَةِ شَيْئًا مِنْ تَعْظِيمِ اللَّهِ فَلاَ بَأْسَ إِنْ شَاءَ اللَّهُ وَأَحَبُّ إِلَىَّ أَنْ يَقْتَصِرَ عَلَى تَلْبِيَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ الشَّافِعِيُّ وَإِنَّمَا قُلْنَا لاَ بَأْسَ بِزِيَادَةِ تَعْظِيمِ اللَّهِ فِيهَا لِمَا جَاءَ عَنِ ابْنِ عُمَرَ وَهُوَ حَفِظَ التَّلْبِيَةَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ زَادَ ابْنُ عُمَرَ فِي تَلْبِيَتِهِ مِنْ قِبَلِهِ لَبَّيْكَ وَالرَّغْبَاءُ إِلَيْكَ وَالْعَمَلُ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Mani', telah menceritakan kepada kami Ismail bin Ibrahim, dari Ayub, dari Nafi', dari Ibnu Umar, bahawa talbiyah Nabi SAW adalah: \"Labbaikallahumma labbaik, labbaik la syarika laka labbaik, inna al-hamda wan-ni'mata laka wal-mulk, la syarika laka.\" (Aku sambut panggilan-Mu ya Allah, aku sambut panggilan-Mu, Engkau tiada sekutu, aku sambut panggilan-Mu. Sesungguhnya segala puji dan nikmat adalah bagi-Mu, dan kerajaan juga bagi-Mu, Engkau tiada sekutu).  Juga diriwayatkan dalam bab ini daripada Ibnu Mas'ud, Jabir, Aisyah, Ibnu Abbas dan Abu Hurairah. Abu Isa berkata: Hadis Ibnu Umar ini adalah hadis yang baik dan sahih.  Amalan ini diamalkan oleh sebahagian ulama daripada sahabat Nabi SAW dan selainnya.  Ini juga pendapat Sufian, Syafie, Ahmad dan Ishaq.  Syafie berkata: Jika seseorang menambah sesuatu dalam talbiyah sebagai tanda pemuliaan kepada Allah, maka tiada masalah jika Allah menghendaki.  Namun, aku lebih suka sekadar kepada talbiyah Rasulullah SAW.  Syafie berkata:  Kami berkata tiada masalah menambah pemuliaan kepada Allah di dalamnya kerana apa yang diriwayatkan daripada Ibnu Umar yang telah menghafal talbiyah daripada Rasulullah SAW, kemudian Ibnu Umar menambah dalam talbiyahnya:  Labbaik wa al-raghabaa ilaika wal-'amal."
  },
  {
    "id": 26607,
    "hadith_number": 827,
    "tajuk_hadith": "Talbiyah Ibnu Umar",
    "perawi_melayu": "Nafi' meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ أَهَلَّ فَانْطَلَقَ يُهِلُّ فَيَقُولُ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ لَبَّيْكَ لاَ شَرِيكَ لَكَ لَبَّيْكَ إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ لاَ شَرِيكَ لَكَ ‏.‏ قَالَ وَكَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ يَقُولُ هَذِهِ تَلْبِيَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ وَكَانَ يَزِيدُ مِنْ عِنْدِهِ فِي أَثَرِ تَلْبِيَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم لَبَّيْكَ لَبَّيْكَ وَسَعْدَيْكَ وَالْخَيْرُ فِي يَدَيْكَ لَبَّيْكَ وَالرَّغْبَاءُ إِلَيْكَ وَالْعَمَلُ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Kami diberitakan oleh Qotaibah, yang diberitakan oleh Laith, daripada Nafi', daripada Ibnu Umar, bahawa beliau telah mengerjakan iḥrām dan ketika itu beliau mengucapkan talbiyah dengan berkata:  \"Labbaik Allahumma labbaik, labbaik la sharika laka labbaik. Innal-hamda wan-ni`mata laka wal-mulk, la sharika laka.\" (Aku sambut seruan-Mu ya Allah! Aku sambut seruan-Mu, Engkau tiada sekutu, aku sambut seruan-Mu. Segala puji, nikmat dan kerajaan adalah bagi-Mu, Engkau tiada sekutu).  Beliau berkata: Abdullah Ibnu Umar berkata: \"Inilah talbiyah Rasulullah SAW.\" Dan beliau menambahkan daripada dirinya sendiri setelah talbiyah Rasulullah SAW:  \"Labbaik labbaika wa-sa'daik, wal-khairuu fi yadaik. Labbaika war-raghba'u ilaika wal-amal.\" (Aku sambut seruan-Mu, dan aku taat kepada perintah-Mu, segala kebaikan di dalam tangan-Mu. Aku sambut seruan-Mu dan segala permohonan dan amalan adalah untuk-Mu.) Beliau berkata: Ini adalah hadis yang baik dan sahih."
  },
  {
    "id": 26608,
    "hadith_number": 828,
    "tajuk_hadith": "Hajj yang Paling Utama",
    "perawi_melayu": "Abu Bakar As-Siddiq meriwayatkan bahawa:",
    "english_text": "The Messenger of Allah was asked: \"Which Hajj is the most virtuous?\" He said: \"That with raised voices (Al-Ajj) and the flow of blood (of the sacrifice) (Ath-Thajj).\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا ابْنُ أَبِي فُدَيْكٍ، عَنِ الضَّحَّاكِ بْنِ عُثْمَانَ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَرْبُوعٍ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم سُئِلَ أَىُّ الْحَجِّ أَفْضَلُ قَالَ ‏\n\"‏ الْعَجُّ وَالثَّجُّ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW ditanya: \"Hajj yang manakah paling utama?\" Baginda menjawab: \"Hajj yang disertai dengan suara-suara yang lantang (Al-Ajj) dan mengalirnya darah (korban) (Ath-Thajj).\""
  },
  {
    "id": 26609,
    "hadith_number": 829,
    "tajuk_hadith": "Talbiyah dan Gema Responnya",
    "perawi_melayu": "Sahl bin Sa'd meriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، عَنْ عُمَارَةَ بْنِ غَزِيَّةَ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا مِنْ مُسْلِمٍ يُلَبِّي إِلاَّ لَبَّى مَنْ عَنْ يَمِينِهِ أَوْ عَنْ شِمَالِهِ مِنْ حَجَرٍ أَوْ شَجَرٍ أَوْ مَدَرٍ حَتَّى تَنْقَطِعَ الأَرْضُ مِنْ هَا هُنَا وَهَا هُنَا ‏\"‏ ‏.‏ \nحَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ، وَعَبْدُ الرَّحْمَنِ بْنُ الأَسْوَدِ أَبُو عَمْرٍو الْبَصْرِيُّ، قَالاَ حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ، عَنْ عُمَارَةَ بْنِ غَزِيَّةَ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَ حَدِيثِ إِسْمَاعِيلَ بْنِ عَيَّاشٍ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عُمَرَ وَجَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي بَكْرٍ حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ ابْنِ أَبِي فُدَيْكٍ عَنِ الضَّحَّاكِ بْنِ عُثْمَانَ ‏.‏ وَمُحَمَّدُ بْنُ الْمُنْكَدِرِ لَمْ يَسْمَعْ مِنْ عَبْدِ الرَّحْمَنِ بْنِ يَرْبُوعٍ وَقَدْ رَوَى مُحَمَّدُ بْنُ الْمُنْكَدِرِ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَرْبُوعٍ عَنْ أَبِيهِ غَيْرَ هَذَا الْحَدِيثِ ‏.‏ وَرَوَى أَبُو نُعَيْمٍ الطَّحَّانُ ضِرَارُ بْنُ صُرَدٍ هَذَا الْحَدِيثَ عَنِ ابْنِ أَبِي فُدَيْكٍ عَنِ الضَّحَّاكِ بْنِ عُثْمَانَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَرْبُوعٍ عَنْ أَبِيهِ عَنْ أَبِي بَكْرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَأَخْطَأَ فِيهِ ضِرَارٌ ‏.‏ قَالَ أَبُو عِيسَى سَمِعْتُ أَحْمَدَ بْنَ الْحَسَنِ يَقُولُ قَالَ أَحْمَدُ بْنُ حَنْبَلٍ مَنْ قَالَ فِي هَذَا الْحَدِيثِ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنِ ابْنِ عَبْدِ الرَّحْمَنِ بْنِ يَرْبُوعٍ عَنْ أَبِيهِ فَقَدْ أَخْطَأَ ‏.‏ قَالَ وَسَمِعْتُ مُحَمَّدًا يَقُولُ وَذَكَرْتُ لَهُ حَدِيثَ ضِرَارِ بْنِ صُرَدٍ عَنِ ابْنِ أَبِي فُدَيْكٍ فَقَالَ هُوَ خَطَأٌ ‏.‏ فَقُلْتُ قَدْ رَوَاهُ غَيْرُهُ عَنِ ابْنِ أَبِي فُدَيْكٍ أَيْضًا مِثْلَ رِوَايَتِهِ ‏.‏ فَقَالَ لاَ شَىْءَ إِنَّمَا رَوَوْهُ عَنِ ابْنِ أَبِي فُدَيْكٍ وَلَمْ يَذْكُرُوا فِيهِ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ ‏.‏ وَرَأَيْتُهُ يُضَعِّفُ ضِرَارَ بْنَ صُرَدٍ ‏.‏ وَالْعَجُّ هُوَ رَفْعُ الصَّوْتِ بِالتَّلْبِيَةِ ‏.‏ وَالثَّجُّ هُوَ نَحْرُ الْبُدْنِ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Hanad, telah menceritakan kepada kami Ismail bin Ayyasy, dari Umarah bin Ghaziyyah, dari Abu Hazim, dari Sahl bin Sa'd, dia berkata, Rasulullah SAW bersabda: \"Tidaklah seorang muslim melafazkan talbiyah melainkan akan turut melafazkan talbiyah juga apa yang ada di sebelah kanan dan kirinya, sama ada batu, pokok kayu atau tanah sehingga sampai ke hujung bumi.\" Telah menceritakan kepada kami Al-Hasan bin Muhammad Az-Za'faranni dan Abdurrahman bin Al-Aswad Abu 'Amru Al-Basri, mereka berdua berkata: Telah menceritakan kepada kami 'Ubaidah bin Humaid, dari Umarah bin Ghaziyyah, dari Abu Hazim, dari Sahl bin Sa'd, dari Nabi SAW, seperti riwayat Ismail bin Ayyasy. Beliau berkata: Dan di dalam bab ini dari Ibnu Umar dan Jabir. Abu Isa berkata: Hadis Abu Bakar adalah hadis yang ganjil, kami tidak mengetahuinya melainkan dari hadis Ibnu Abi Fudayk dari Ad-Dhahhak bin Utsman. Dan Muhammad bin Munkidir tidak mendengar daripada Abdurrahman bin Yarbu' dan Muhammad bin Munkidir telah meriwayatkan dari Sa'id bin Abdurrahman bin Yarbu' dari bapanya selain hadis ini. Dan Abu Nu'aim Ath-Thahan Dhirar bin Shurad telah meriwayatkan hadis ini dari Ibnu Abi Fudayk dari Adh-Dhahhak bin Utsman dari Muhammad bin Munkidir dari Sa'id bin Abdurrahman bin Yarbu' dari bapanya dari Abu Bakar dari Nabi SAW. Dan Dhirar telah melakukan kesalahan di dalamnya. Abu Isa berkata: Aku mendengar Ahmad bin Al-Hasan berkata: Ahmad bin Hanbal berkata: Barangsiapa yang berkata dalam hadis ini dari Muhammad bin Munkidir dari Ibnu Abdurrahman bin Yarbu' dari bapanya, maka dia telah melakukan kesalahan. Beliau berkata: Dan aku mendengar Muhammad berkata: Dan aku menyebutkan kepadanya hadis Dhirar bin Shurad dari Ibnu Abi Fudayk, lalu beliau berkata: Itu adalah kesalahan. Lalu aku berkata: Ia telah diriwayatkan oleh orang lain dari Ibnu Abi Fudayk juga seperti riwayatnya. Lalu beliau berkata: Tidak ada apa-apa, mereka hanya meriwayatkannya dari Ibnu Abi Fudayk dan mereka tidak menyebutkan di dalamnya dari Sa'id bin Abdurrahman. Dan aku melihat beliau melemahkan Dhirar bin Shurad. Dan 'Ajju ialah meninggikan suara dengan talbiyah. Dan Tsajju ialah menyembelih binatang korban."
  },
  {
    "id": 26610,
    "hadith_number": 830,
    "tajuk_hadith": "Meninggikan Suara Semasa Ihlal dan Talbiyah",
    "perawi_melayu": "Khallad bin As-Sa'ib (bin Khalad) meriwayatkan daripada bapanya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، وَهُوَ ابْنُ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ خَلاَّدِ بْنِ السَّائِبِ بْنِ خَلاَّدٍ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَتَانِي جِبْرِيلُ فَأَمَرَنِي أَنْ آمُرَ أَصْحَابِي أَنْ يَرْفَعُوا أَصْوَاتَهُمْ بِالإِهْلاَلِ وَالتَّلْبِيَةِ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ زَيْدِ بْنِ خَالِدٍ وَأَبِي هُرَيْرَةَ وَابْنِ عَبَّاسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ خَلاَّدٍ عَنْ أَبِيهِ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَرَوَى بَعْضُهُمْ هَذَا الْحَدِيثَ عَنْ خَلاَّدِ بْنِ السَّائِبِ عَنْ زَيْدِ بْنِ خَالِدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَلاَ يَصِحُّ وَالصَّحِيحُ هُوَ عَنْ خَلاَّدِ بْنِ السَّائِبِ عَنْ أَبِيهِ ‏.‏ وَهُوَ خَلاَّدُ بْنُ السَّائِبِ بْنِ خَلاَّدِ بْنِ سُوَيْدٍ الأَنْصَارِيُّ عَنْ أَبِيهِ.",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Mani', telah menceritakan kepada kami Sufyan bin Uyainah, daripada Abdullah bin Abi Bakar, iaitu anak Muhammad bin Amr bin Hazm daripada Abdul Malik bin Abi Bakar bin Abdul Rahman bin Harits bin Hisyam, daripada Khallad bin Sa'ib bin Khallad, daripada bapanya, dia berkata: Rasulullah SAW bersabda: \" Jibril datang kepadaku lalu memerintahkanku supaya aku memerintahkan sahabat-sahabatku supaya meninggikan suara mereka dengan ihlal dan talbiyah.\"  Di dalam bab ini juga diriwayatkan daripada Zaid bin Khalid, Abu Hurairah dan Ibnu Abbas. Abu Isa berkata: Hadis Khallad daripada bapanya adalah hadis yang baik dan sahih. Sebahagian daripada mereka meriwayatkan hadis ini daripada Khallad bin Sa'ib daripada Zaid bin Khalid daripada Nabi SAW. Tetapi ia tidak sahih, dan yang sahih adalah daripada Khallad bin Sa'ib daripada bapanya. Iaitu Khallad bin Sa'ib bin Khallad bin Suwaid Al-Ansari daripada bapanya."
  },
  {
    "id": 26611,
    "hadith_number": 831,
    "tajuk_hadith": "Nabi SAW Berwudu dan Mandi Sebelum Ihram",
    "perawi_melayu": "Zaid bin Thabit meriwayatkan daripada bapanya:",
    "english_text": "who said that he saw the Prophet disrobing for his Ihlal and to perform Ghusl.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي زِيَادٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَعْقُوبَ الْمَدَنِيُّ، عَنِ ابْنِ أَبِي الزِّنَادِ، عَنْ أَبِيهِ، عَنْ خَارِجَةَ بْنِ زَيْدِ بْنِ ثَابِتٍ، عَنْ أَبِيهِ، أَنَّهُ رَأَى النَّبِيَّ صلى الله عليه وسلم تَجَرَّدَ لإِهْلاَلِهِ وَاغْتَسَلَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏ وَقَدِ اسْتَحَبَّ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ الاِغْتِسَالَ عِنْدَ الإِحْرَامِ وَبِهِ يَقُولُ الشَّافِعِيُّ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Abi Ziad, telah menceritakan kepada kami Abdullah bin Ya’qub al-Madani, dari Ibnu Abi Zinad, dari bapanya, dari Kharajah bin Zaid bin Tsabit, daripada bapanya, bahawa dia telah melihat Nabi SAW menanggalkan pakaiannya untuk ihram dan mandi. Abu Isa berkata: “Hadis ini adalah hadis yang baik dan ganjil.” Dan sesetengah ulama telah menggemari mandi ketika ihram dan demikianlah yang dikatakan oleh Imam Syafie."
  },
  {
    "id": 26612,
    "hadith_number": 832,
    "tajuk_hadith": "Tempat Memulai Ihram Haji",
    "perawi_melayu": "Ibn Umar meriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَجُلاً، قَالَ مِنْ أَيْنَ نُهِلُّ يَا رَسُولَ اللَّهِ فَقَالَ ‏\n\"‏ يُهِلُّ أَهْلُ الْمَدِينَةِ مِنْ ذِي الْحُلَيْفَةِ وَأَهْلُ الشَّامِ مِنَ الْجُحْفَةِ وَأَهْلُ نَجْدٍ مِنْ قَرْنٍ ‏\"‏ ‏.‏ قَالَ وَيَقُولُونَ وَأَهْلُ الْيَمَنِ مِنْ يَلَمْلَمَ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ وَجَابِرِ بْنِ عَبْدِ اللَّهِ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Mani', telah menceritakan kepada kami Ismail bin Ibrahim, daripada Ayub, daripada Nafi', daripada Ibnu Umar, bahawa seorang lelaki bertanya, \"Dari manakah kami berihram wahai Rasulullah?\" Baginda menjawab, \"Umat Madinah berihram dari Zul Hulaifah, umat Syam dari Al-Juhfah, dan umat Najd dari Qarn.\"  Dan mereka berkata, \"Dan umat Yaman dari Yalamlam.\"  Hadis Ibnu Umar adalah hadis yang hasan sahih. Amalan berdasarkan hadis ini adalah diamalkan oleh para ulama'."
  },
  {
    "id": 26613,
    "hadith_number": 833,
    "tajuk_hadith": "Al-Aqiq sebagai Miqat untuk penduduk Barat",
    "perawi_melayu": "Ibn Abbas meriwayatkan:",
    "english_text": "\"The Prophet made Al-Aqiq the Miqat for the people of the west.\"",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ مُحَمَّدِ بْنِ عَلِيٍّ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم وَقَّتَ لأَهْلِ الْمَشْرِقِ الْعَقِيقَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَمُحَمَّدُ بْنُ عَلِيٍّ هُوَ أَبُو جَعْفَرٍ مُحَمَّدُ بْنُ عَلِيِّ بْنِ حُسَيْنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ ‏.‏",
    "malay_translation": "Nabi SAW telah menetapkan Al-Aqiq sebagai Miqat bagi penduduk barat."
  },
  {
    "id": 26614,
    "hadith_number": 834,
    "tajuk_hadith": "Pakaian Ihram di Tanah Haram",
    "perawi_melayu": "Ibn Umar meriwayatkan:",
    "english_text": "\"A man stood and said 'O Messenger of Allah! What clothing do you command us to wear in Al-Haram?' The Messenger of Allah said: 'Do not wear shirts, nor pants, nor burnooses, nor turbans, nor Khuff - unless one does not have any sandals, then let him wear Khuff, but let him cut them below the ankles. And do not wear any cloth that has been touched by saffron or Wars. And the woman in Ihram is not to cover her face, nor wear gloves.'\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ قَالَ قَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ مَاذَا تَأْمُرُنَا أَنْ نَلْبَسَ مِنَ الثِّيَابِ فِي الْحَرَمِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَلْبَسُوا الْقُمُصَ وَلاَ السَّرَاوِيلاَتِ وَلاَ الْبَرَانِسَ وَلاَ الْعَمَائِمَ وَلاَ الْخِفَافَ إِلاَّ أَنْ يَكُونَ أَحَدٌ لَيْسَتْ لَهُ نَعْلاَنِ فَلْيَلْبَسِ الْخُفَّيْنِ وَلْيَقْطَعْهُمَا مَا أَسْفَلَ مِنَ الْكَعْبَيْنِ وَلاَ تَلْبَسُوا شَيْئًا مِنَ الثِّيَابِ مَسَّهُ الزَّعْفَرَانُ وَلاَ الْوَرْسُ وَلاَ تَنْتَقِبِ الْمَرْأَةُ الْحَرَامُ وَلاَ تَلْبَسِ الْقُفَّازَيْنِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَيْهِ عِنْدَ أَهْلِ الْعِلْمِ ‏.‏",
    "malay_translation": "Seorang lelaki bertanya, \"Wahai Rasulullah! Apakah pakaian yang tuan perintahkan kami pakai di Tanah Haram?\" Rasulullah SAW menjawab: \"Janganlah kamu pakai kemeja, seluar, burnus, serban, dan khuff kecuali jika seseorang itu tidak mempunyai sandal, maka bolehlah dia memakai khuff tetapi hendaklah dipotong di bawah buku lali. Dan janganlah kamu pakai apa-apa kain yang terkena pewarna kunyit atau wars. Wanita yang sedang ihram pula tidak boleh menutup muka dan memakai sarung tangan.\""
  },
  {
    "id": 26615,
    "hadith_number": 835,
    "tajuk_hadith": "Pakaian dan Kasut Ihram Sekiranya Tiada Pilihan Lain",
    "perawi_melayu": "Ibn Abbas meriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ الْبَصْرِيُّ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا أَيُّوبُ، حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، عَنْ جَابِرِ بْنِ زَيْدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ الْمُحْرِمُ إِذَا لَمْ يَجِدِ الإِزَارَ فَلْيَلْبَسِ السَّرَاوِيلَ وَإِذَا لَمْ يَجِدِ النَّعْلَيْنِ فَلْيَلْبَسِ الْخُفَّيْنِ ‏\"‏ ‏.‏ \nحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرٍو، نَحْوَهُ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عُمَرَ، وَجَابِرٍ، ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ قَالُوا إِذَا لَمْ يَجِدِ الْمُحْرِمُ الإِزَارَ لَبِسَ السَّرَاوِيلَ وَإِذَا لَمْ يَجِدِ النَّعْلَيْنِ لَبِسَ الْخُفَّيْنِ ‏.‏ وَهُوَ قَوْلُ أَحْمَدَ ‏.‏ وَقَالَ بَعْضُهُمْ عَلَى حَدِيثِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ إِذَا لَمْ يَجِدْ نَعْلَيْنِ فَلْيَلْبَسِ الْخُفَّيْنِ وَلْيَقْطَعْهُمَا أَسْفَلَ مِنَ الْكَعْبَيْنِ ‏\"‏ ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَالشَّافِعِيِّ وَبِهِ يَقُولُ مَالِكٌ ‏.‏",
    "malay_translation": "Daripada Ahmad bin Abdat Az-Zabi Al-Basri, yang meriwayatkan daripada Yazid bin Zurai', yang meriwayatkan daripada Ayub, yang meriwayatkan daripada Amru bin Dinar, daripada Jabir bin Zaid, daripada Ibnu Abbas, katanya: Aku mendengar Rasulullah SAW bersabda: \"Orang yang berihram, jika dia tidak menemui kain izar, maka hendaklah dia memakai seluar, dan jika dia tidak menemui kasut, maka hendaklah dia memakai khuf.\"  Daripada Qotaibah, yang meriwayatkan daripada Hammad bin Zaid, daripada Amru, lebih kurang begitu.  Beliau berkata: Di dalam bab ini juga terdapat riwayat daripada Ibnu Umar dan Jabir.  Abu Isa berkata: Ini adalah hadis yang hasan sahih.  Amalan berdasarkan hadis ini di kalangan sebahagian ulama, mereka berkata: Jika orang yang berihram tidak menemui kain izar, maka hendaklah dia memakai seluar, dan jika dia tidak menemui kasut, maka hendaklah dia memakai khuf.  Inilah pendapat Ahmad.  Dan sebahagian mereka pula berpendapat berdasarkan hadis Ibnu Umar daripada Nabi SAW: \"Jika dia tidak menemui kasut, maka hendaklah dia memakai khuf dan hendaklah dipotong di bawah buku lali.\" Inilah pendapat Sufyan Ats-Tsauri, As-Syafie dan Malik."
  },
  {
    "id": 26616,
    "hadith_number": 836,
    "tajuk_hadith": "Larangan Memakai Jubah Ketika Ihram",
    "perawi_melayu": "Ya'la bin Umayyah meriwayatkan:",
    "english_text": "\"The Messenger of Allah saw a Bedouin who was in Ihram wearing a cloak. So he ordered him to remove it.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ، عَنْ عَطَاءٍ، عَنْ يَعْلَى بْنِ أُمَيَّةَ، قَالَ رَأَى النَّبِيُّ صلى الله عليه وسلم أَعْرَابِيًّا قَدْ أَحْرَمَ وَعَلَيْهِ جُبَّةٌ فَأَمَرَهُ أَنْ يَنْزِعَهَا ‏.‏",
    "malay_translation": "Rasulullah SAW melihat seorang Badwi yang sedang berihram memakai jubah.  Maka baginda menyuruhnya menanggalkan jubah tersebut."
  },
  {
    "id": 26617,
    "hadith_number": 837,
    "tajuk_hadith": "Hadis Serupa Nombor 835 dengan Sanad Berbeza",
    "perawi_melayu": "Ya'la bin Umayyah meriwayatkan:",
    "english_text": "A Hadith similar to no. 835 with a different chain",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عَطَاءٍ، عَنْ صَفْوَانَ بْنِ يَعْلَى، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ بِمَعْنَاهُ ‏.‏ وَهَذَا أَصَحُّ وَفِي الْحَدِيثِ قِصَّةٌ ‏.‏ قَالَ أَبُو عِيسَى هَكَذَا رَوَاهُ قَتَادَةُ وَالْحَجَّاجُ بْنُ أَرْطَاةَ وَغَيْرُ وَاحِدٍ عَنْ عَطَاءٍ عَنْ يَعْلَى بْنِ أُمَيَّةَ ‏.‏ وَالصَّحِيحُ مَا رَوَى عَمْرُو بْنُ دِينَارٍ وَابْنُ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ صَفْوَانَ بْنِ يَعْلَى عَنْ أَبِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Hadis ini serupa dengan hadis nombor 835, tetapi dengan sanad (rantaian periwayat) yang berbeza.  Ini adalah riwayat yang lebih sahih dan mengandungi sebuah kisah. Abu Isa berkata:  Demikianlah riwayat Qatadah, al-Hajjaj bin Artath dan beberapa orang lagi daripada ‘Ataa’ daripada Ya’la bin Umayyah.  Namun, riwayat yang sahih ialah apa yang diriwayatkan oleh ‘Amru bin Dinar dan Ibn Juraij daripada ‘Ataa’, daripada Safwan bin Ya’la, daripada bapanya, daripada Nabi SAW."
  },
  {
    "id": 26618,
    "hadith_number": 838,
    "tajuk_hadith": "Lima Haiwan yang Boleh Dibunuh di Tanah Haram",
    "perawi_melayu": "Aisyah meriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ خَمْسُ فَوَاسِقَ يُقْتَلْنَ فِي الْحَرَمِ الْفَأْرَةُ وَالْعَقْرَبُ وَالْغُرَابُ وَالْحُدَيَّا وَالْكَلْبُ الْعَقُورُ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ مَسْعُودٍ وَابْنِ عُمَرَ وَأَبِي هُرَيْرَةَ وَأَبِي سَعِيدٍ وَابْنِ عَبَّاسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَائِشَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Muhammad bin Abdul Malik bin Abi Syawarib meriwayatkan daripada Yazid bin Zurai', yang meriwayatkan daripada Ma'mar, daripada Zuhri, daripada Urwah, daripada Aisyah, katanya: Rasulullah SAW bersabda: \"Lima haiwan yang boleh dibunuh di tanah haram: tikus, kala jengking, gagak, helang, dan anjing yang menggigit.\"  Diriwayatkan juga dalam bab ini daripada Ibnu Mas'ud, Ibnu Umar, Abu Hurairah, Abu Said dan Ibnu Abbas. Abu Isa berkata:  Hadis Aisyah ini adalah hadis yang baik dan sahih."
  },
  {
    "id": 26619,
    "hadith_number": 839,
    "tajuk_hadith": "Haiwan yang Boleh Dibunuh oleh Orang yang Berihram",
    "perawi_melayu": "Abu Said meriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا يَزِيدُ بْنُ أَبِي زِيَادٍ، عَنِ ابْنِ أَبِي نُعْمٍ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَقْتُلُ الْمُحْرِمُ السَّبُعَ الْعَادِيَ وَالْكَلْبَ الْعَقُورَ وَالْفَأْرَةَ وَالْعَقْرَبَ وَالْحِدَأَةَ وَالْغُرَابَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ ‏.‏ قَالُوا الْمُحْرِمُ يَقْتُلُ السَّبُعَ الْعَادِيَ ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَالشَّافِعِيِّ ‏.‏ وَقَالَ الشَّافِعِيُّ كُلُّ سَبُعٍ عَدَا عَلَى النَّاسِ أَوْ عَلَى دَوَابِّهِمْ فَلِلْمُحْرِمِ قَتْلُهُ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Orang yang berihram boleh membunuh binatang buas, anjing gila, tikus, kala jengking, helang, dan gagak.\""
  },
  {
    "id": 26620,
    "hadith_number": 840,
    "tajuk_hadith": "Bercucuk Pin Di Waktu Ihram",
    "perawi_melayu": "Daripada Ibnu Abbas;",
    "english_text": "\"The Messenger of Allah was cupped while he was a Muhrim.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ طَاوُسٍ، وَعَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم احْتَجَمَ وَهُوَ مُحْرِمٌ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَنَسٍ وَعَبْدِ اللَّهِ ابْنِ بُحَيْنَةَ وَجَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رَخَّصَ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ فِي الْحِجَامَةِ لِلْمُحْرِمِ وَقَالُوا لاَ يَحْلِقُ شَعَرًا ‏.‏ وَقَالَ مَالِكٌ لاَ يَحْتَجِمُ الْمُحْرِمُ إِلاَّ مِنْ ضَرُورَةٍ ‏.‏ وَقَالَ سُفْيَانُ الثَّوْرِيُّ وَالشَّافِعِيُّ لاَ بَأْسَ أَنْ يَحْتَجِمَ الْمُحْرِمُ وَلاَ يَنْزِعُ شَعَرًا ‏.‏",
    "malay_translation": "Daripada Ibnu Abbas, bahawa Rasulullah SAW telah bercucuk ( bekam ) ketika dalam keadaan ihram."
  },
  {
    "id": 26621,
    "hadith_number": 841,
    "tajuk_hadith": "Perkahwinan Orang Yang Berihram",
    "perawi_melayu": "Nubaih bin Wahb meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنْ نُبَيْهِ بْنِ وَهْبٍ، قَالَ أَرَادَ ابْنُ مَعْمَرٍ أَنْ يُنْكِحَ، ابْنَهُ فَبَعَثَنِي إِلَى أَبَانَ بْنِ عُثْمَانَ وَهُوَ أَمِيرُ الْمَوْسِمِ بِمَكَّةَ فَأَتَيْتُهُ فَقُلْتُ إِنَّ أَخَاكَ يُرِيدُ أَنْ يُنْكِحَ ابْنَهُ فَأَحَبَّ أَنْ يُشْهِدَكَ ذَلِكَ ‏.‏ قَالَ لاَ أُرَاهُ إِلاَّ أَعْرَابِيًّا جَافِيًا إِنَّ الْمُحْرِمَ لاَ يَنْكِحُ وَلاَ يُنْكِحُ ‏.‏ أَوْ كَمَا قَالَ ثُمَّ حَدَّثَ عَنْ عُثْمَانَ مِثْلَهُ يَرْفَعُهُ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي رَافِعٍ وَمَيْمُونَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عُثْمَانَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم مِنْهُمْ عُمَرُ بْنُ الْخَطَّابِ وَعَلِيُّ بْنُ أَبِي طَالِبٍ وَابْنُ عُمَرَ وَهُوَ قَوْلُ بَعْضِ فُقَهَاءِ التَّابِعِينَ وَبِهِ يَقُولُ مَالِكٌ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ لاَ يَرَوْنَ أَنْ يَتَزَوَّجَ الْمُحْرِمُ قَالُوا فَإِنْ نَكَحَ فَنِكَاحُهُ بَاطِلٌ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Mani', telah menceritakan kepada kami Ismail bin 'Ulaiyyah, telah menceritakan kepada kamiAyyub, dari Nafi', dari Nubaih bin Wahb, dia berkata: Ibn Ma'mar ingin menikahkan anaknya, lalu dia mengutusku kepada Aban bin Utsman, iaitu Amir musim haji di Mekah. Maka aku mendatanginya lalu berkata: 'Saudaramu ingin menikahkan anaknya, lalu dia ingin engkau menjadi saksi.' Dia berkata: 'Aku kira dia hanyalah seorang Badwi yang kasar, sesungguhnya orang yang berihram tidak boleh mengahwini dan tidak boleh menikahkan.' Atau seperti yang dia katakan. Kemudian dia meriwayatkan dari Utsman serupa dengannya, dengan mengangkatnya (kepada Nabi). Dan dalam bab ini dari Abi Rafi' dan Maimunah. Abu Isa berkata: Hadis Utsman adalah hadis yang baik dan sahih. Dan amalan berdasarkan ini ada pada sebahagian sahabat Nabi SAW, antaranya Umar bin Khattab, Ali bin Abi Talib dan Ibnu Umar. Dan ia merupakan pendapat sebahagian fuqaha' Tabi'in, dan dengannya Malik, Syafi'i, Ahmad dan Ishaq mengatakan: mereka tidak melihat (menghalalkan) orang yang berihram untuk berkahwin. Mereka berkata: jika dia berkahwin, maka perkahwinannya adalah batal."
  },
  {
    "id": 26622,
    "hadith_number": 842,
    "tajuk_hadith": "Perkahwinan Rasulullah s.a.w. dengan Maimunah",
    "perawi_melayu": "Abu Rafi meriwayatkan:",
    "english_text": "\"The Messenger of Allah married Maimunah while he was Halal, and he stayed with her while he was Halal, and I was the messenger between the two of them.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ مَطَرٍ الْوَرَّاقِ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ أَبِي رَافِعٍ، قَالَ تَزَوَّجَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَيْمُونَةَ وَهُوَ حَلاَلٌ وَبَنَى بِهَا وَهُوَ حَلاَلٌ وَكُنْتُ أَنَا الرَّسُولَ فِيمَا بَيْنَهُمَا ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَلاَ نَعْلَمُ أَحَدًا أَسْنَدَهُ غَيْرَ حَمَّادِ بْنِ زَيْدٍ عَنْ مَطَرٍ الْوَرَّاقِ عَنْ رَبِيعَةَ ‏.‏ وَرَوَى مَالِكُ بْنُ أَنَسٍ عَنْ رَبِيعَةَ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ أَنَّ النَّبِيَّ صلى الله عليه وسلم تَزَوَّجَ مَيْمُونَةَ وَهُوَ حَلاَلٌ ‏.‏ رَوَاهُ مَالِكٌ مُرْسَلاً ‏.‏ قَالَ وَرَوَاهُ أَيْضًا سُلَيْمَانُ بْنُ بِلاَلٍ عَنْ رَبِيعَةَ مُرْسَلاً ‏.‏ قَالَ أَبُو عِيسَى وَرُوِيَ عَنْ يَزِيدَ بْنِ الأَصَمِّ عَنْ مَيْمُونَةَ قَالَتْ تَزَوَّجَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ حَلاَلٌ ‏.‏ وَيَزِيدُ بْنُ الأَصَمِّ هُوَ ابْنُ أُخْتِ مَيْمُونَةَ ‏.‏",
    "malay_translation": "Rasulullah SAW mengahwini Maimunah ketika Baginda dalam keadaan halal, dan Baginda hidup bersama Maimunah ketika Baginda dalam keadaan halal, dan saya adalah utusan di antara mereka berdua."
  },
  {
    "id": 26623,
    "hadith_number": 843,
    "tajuk_hadith": "Perkahwinan Nabi SAW dengan Maimunah ketika dalam keadaan Ihram",
    "perawi_melayu": "Ibn Abbas meriwayatkan:",
    "english_text": "\"The Prophet married Maimunah while he was a Muhrim.\"",
    "arabic_text": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ الْبَصْرِيُّ، حَدَّثَنَا سُفْيَانُ بْنُ حَبِيبٍ، عَنْ هِشَامِ بْنِ حَسَّانَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم تَزَوَّجَ مَيْمُونَةَ وَهُوَ مُحْرِمٌ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَائِشَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ وَبِهِ يَقُولُ سُفْيَانُ الثَّوْرِيُّ وَأَهْلُ الْكُوفَةِ ‏.‏",
    "malay_translation": "Ibn Abbas meriwayatkan bahawa Nabi Muhammad SAW berkahwin dengan Maimunah ketika baginda berada dalam keadaan ihram."
  },
  {
    "id": 26624,
    "hadith_number": 844,
    "tajuk_hadith": "Perkahwinan Nabi SAW dengan Maimunah ketika dalam keadaan Ihram",
    "perawi_melayu": "(Sanad lain) yang diriwayatkan oleh Ibnu Abbas:",
    "english_text": "\"The Prophet married Maimunah while he was a Muhrim.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم تَزَوَّجَ مَيْمُونَةَ وَهُوَ مُحْرِمٌ ‏.‏",
    "malay_translation": "Daripada Qotaibah, telah menceritakan kepada kami Hammad bin Zaid, daripada Ayub, daripada Ikrimah, daripada Ibnu Abbas, bahawa Nabi SAW berkahwin dengan Maimunah ketika baginda dalam keadaan ihram."
  },
  {
    "id": 26625,
    "hadith_number": 845,
    "tajuk_hadith": "Perkahwinan Nabi SAW dengan Maimunah ketika dalam keadaan ihram",
    "perawi_melayu": "(Satu lagi sanad) yang diriwayatkan oleh Ibnu Abbas:",
    "english_text": "\"The Prophet married Maimunah while he was a Muhrim.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا دَاوُدُ بْنُ عَبْدِ الرَّحْمَنِ الْعَطَّارُ، عَنْ عَمْرِو بْنِ دِينَارٍ، قَالَ سَمِعْتُ أَبَا الشَّعْثَاءِ، يُحَدِّثُ عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم تَزَوَّجَ مَيْمُونَةَ وَهُوَ مُحْرِمٌ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ ‏.‏ وَأَبُو الشَّعْثَاءِ اسْمُهُ جَابِرُ بْنُ زَيْدٍ ‏.‏ وَاخْتَلَفُوا فِي تَزْوِيجِ النَّبِيِّ صلى الله عليه وسلم مَيْمُونَةَ لأَنَّ النَّبِيَّ صلى الله عليه وسلم تَزَوَّجَهَا فِي طَرِيقِ مَكَّةَ فَقَالَ بَعْضُهُمْ تَزَوَّجَهَا حَلاَلاً وَظَهَرَ أَمْرُ تَزْوِيجِهَا وَهُوَ مُحْرِمٌ ثُمَّ بَنَى بِهَا وَهُوَ حَلاَلٌ بِسَرِفَ فِي طَرِيقِ مَكَّةَ وَمَاتَتْ مَيْمُونَةُ بِسَرِفَ حَيْثُ بَنَى بِهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَدُفِنَتْ بِسَرِفَ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah, telah menceritakan kepada kami Dawud bin Abdurrahman al-'Attar, dari 'Amru bin Dinar, dia berkata: Aku mendengar Abu asy-Sya'tha' meriwayatkan dari Ibnu Abbas bahawa Nabi SAW mengahwini Maimunah ketika baginda dalam keadaan ihram. Abu Isa berkata: Hadis ini sahih.  Abu asy-Sya'tha' namanya Jabir bin Zaid.  Mereka berselisih pendapat tentang perkahwinan Nabi SAW dengan Maimunah kerana Nabi SAW mengahwininya di perjalanan ke Mekah. Maka sebahagian daripada mereka berkata: Baginda mengahwininya dalam keadaan halal dan perkahwinannya itu nyata ketika baginda dalam keadaan ihram, kemudian baginda bersetubuh dengannya dalam keadaan halal di Sarif di perjalanan ke Mekah.  Maimunah meninggal dunia di Sarif iaitu tempat Rasulullah SAW bersetubuh dengannya dan dikebumikan di Sarif."
  },
  {
    "id": 26626,
    "hadith_number": 846,
    "tajuk_hadith": "Perkahwinan Rasulullah SAW dengan Maimunah",
    "perawi_melayu": "Yazid bin Al-Asamm meriwayatkan daripada Maimunah:",
    "english_text": "\"The Messenger of Allah married he while he was Halal and he stayed with her while he was Halal. She died in Sarif, and we buried her at the (site of the) tent where he had stayed wit her.\"",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي قَالَ، سَمِعْتُ أَبَا فَزَارَةَ، يُحَدِّثُ عَنْ يَزِيدَ بْنِ الأَصَمِّ، عَنْ مَيْمُونَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم تَزَوَّجَهَا وَهُوَ حَلاَلٌ وَبَنَى بِهَا حَلاَلاً وَمَاتَتْ بِسَرِفَ وَدَفَنَّاهَا فِي الظُّلَّةِ الَّتِي بَنَى بِهَا فِيهَا ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ ‏.‏ وَرَوَى غَيْرُ وَاحِدٍ هَذَا الْحَدِيثَ عَنْ يَزِيدَ بْنِ الأَصَمِّ مُرْسَلاً أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم تَزَوَّجَ مَيْمُونَةَ وَهُوَ حَلاَلٌ ‏.‏",
    "malay_translation": "Rasulullah SAW mengahwini Maimunah ketika baginda dalam keadaan halal dan hidup bersama baginda dalam keadaan halal. Baginda wafat di Sarif, dan kami mengebumikannya di tapak khemah tempat baginda pernah tinggal bersamanya."
  },
  {
    "id": 26627,
    "hadith_number": 847,
    "tajuk_hadith": "Kehalalan Memburu Haiwan Liar Ketika Ihram",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan bahawa:",
    "english_text": "The Prophet said: \"The land game is lawful for you while you are in Ihram as long as you did not hunt it - or - it was not hunted for you.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو، عَنِ الْمُطَّلِبِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ صَيْدُ الْبَرِّ لَكُمْ حَلاَلٌ وَأَنْتُمْ حُرُمٌ مَا لَمْ تَصِيدُوهُ أَوْ يُصَدْ لَكُمْ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي قَتَادَةَ وَطَلْحَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ جَابِرٍ حَدِيثٌ مُفَسَّرٌ ‏.‏ وَالْمُطَّلِبُ لاَ نَعْرِفُ لَهُ سَمَاعًا مِنْ جَابِرٍ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ لاَ يَرَوْنَ بِأَكْلِ الصَّيْدِ لِلْمُحْرِمِ بَأْسًا إِذَا لَمْ يَصْطَدْهُ أَوْ لَمْ يُصْطَدْ مِنْ أَجْلِهِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا أَحْسَنُ حَدِيثٍ رُوِيَ فِي هَذَا الْبَابِ وَأَفْسَرُ وَالَعَمَلُ عَلَى هَذَا وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَاقَ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Haiwan buruan darat adalah halal bagi kamu ketika kamu dalam keadaan ihram, selagi kamu tidak memburunya atau ia tidak diburu untuk kamu.\""
  },
  {
    "id": 26628,
    "hadith_number": 848,
    "tajuk_hadith": "Makanan Rezeki Allah",
    "perawi_melayu": "Abu Qatadah meriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ أَبِي النَّضْرِ، عَنْ نَافِعٍ، مَوْلَى أَبِي قَتَادَةَ عَنْ أَبِي قَتَادَةَ، أَنَّهُ كَانَ مَعَ النَّبِيِّ صلى الله عليه وسلم حَتَّى إِذَا كَانَ بِبَعْضِ طَرِيقِ مَكَّةَ تَخَلَّفَ مَعَ أَصْحَابٍ لَهُ مُحْرِمِينَ وَهُوَ غَيْرُ مُحْرِمٍ فَرَأَى حِمَارًا وَحْشِيًّا فَاسْتَوَى عَلَى فَرَسِهِ فَسَأَلَ أَصْحَابَهُ أَنْ يُنَاوِلُوهُ سَوْطَهُ فَأَبَوْا فَسَأَلَهُمْ رُمْحَهُ فَأَبَوْا عَلَيْهِ فَأَخَذَهُ ثُمَّ شَدَّ عَلَى الْحِمَارِ فَقَتَلَهُ فَأَكَلَ مِنْهُ بَعْضُ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَأَبَى بَعْضُهُمْ فَأَدْرَكُوا النَّبِيَّ صلى الله عليه وسلم فَسَأَلُوهُ عَنْ ذَلِكَ فَقَالَ ‏\n\"‏ إِنَّمَا هِيَ طُعْمَةٌ أَطْعَمَكُمُوهَا اللَّهُ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Qatadah meriwayatkan bahawa beliau bersama Nabi SAW sehingga apabila mereka berada di salah satu jalan Mekah,  beberapa sahabatnya dalam keadaan ihram, manakala beliau tidak.  Beliau melihat seekor keldai liar, lalu menaiki kudanya dan meminta sahabat-sahabatnya memberikan cambuk kepadanya, tetapi mereka enggan.  Lalu beliau meminta tombaknya, tetapi mereka juga enggan. Maka beliau mengambilnya sendiri dan menikam keldai itu sehingga mati.  Sebahagian sahabat Nabi SAW memakan dagingnya, sebahagian yang lain enggan.  Apabila mereka bertemu dengan Nabi SAW, mereka bertanya baginda tentang perkara itu, lalu baginda bersabda:  \"Sesungguhnya ia hanyalah makanan yang Allah berikan kepada kamu.\""
  },
  {
    "id": 26629,
    "hadith_number": 849,
    "tajuk_hadith": "Hadis Tentang Daging Keldai Liar",
    "perawi_melayu": "(Satu lagi sanad) Dari Abu Qatadah:",
    "english_text": "About the wild donkey, and it is similar to the (previous) narrated of Abu An-Nadr except that in the narration of Zaid bin Aslam he said that the Messenger of Allah said: \"Do you have any of its meat left with you?\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي قَتَادَةَ، فِي حِمَارِ الْوَحْشِ مِثْلَ حَدِيثِ أَبِي النَّضْرِ غَيْرَ أَنَّ فِي، حَدِيثِ زَيْدِ بْنِ أَسْلَمَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ هَلْ مَعَكُمْ مِنْ لَحْمِهِ شَيْءٌ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Berkaitan dengan keldai liar, dan ia serupa dengan riwayat (sebelumnya) daripada Abu An-Nadr, kecuali bahawa dalam riwayat Zaid bin Aslam, baginda berkata bahawa Rasulullah SAW bersabda:  \"Adakah kamu masih mempunyai sebarang dagingnya?\"."
  },
  {
    "id": 26630,
    "hadith_number": 850,
    "tajuk_hadith": "Rasulullah menolak hadiah keldai liar semasa ihram",
    "perawi_melayu": "Ibn Abbas meriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، أَنَّ ابْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّ الصَّعْبَ بْنَ جَثَّامَةَ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَرَّ بِهِ بِالأَبْوَاءِ أَوْ بِوَدَّانَ فَأَهْدَى لَهُ حِمَارًا وَحْشِيًّا فَرَدَّهُ عَلَيْهِ فَلَمَّا رَأَى رَسُولُ اللَّهِ صلى الله عليه وسلم مَا فِي وَجْهِهِ مِنَ الْكَرَاهِيَةِ قَالَ ‏\n\"‏ إِنَّهُ لَيْسَ بِنَا رَدٌّ عَلَيْكَ وَلَكِنَّا حُرُمٌ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ ذَهَبَ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ إِلَى هَذَا الْحَدِيثِ وَكَرِهُوا أَكْلَ الصَّيْدِ لِلْمُحْرِمِ ‏.‏ وَقَالَ الشَّافِعِيُّ إِنَّمَا وَجْهُ هَذَا الْحَدِيثِ عِنْدَنَا إِنَّمَا رَدَّهُ عَلَيْهِ لَمَّا ظَنَّ أَنَّهُ صِيدَ مِنْ أَجْلِهِ وَتَرَكَهُ عَلَى التَّنَزُّهِ ‏.‏ وَقَدْ رَوَى بَعْضُ أَصْحَابِ الزُّهْرِيِّ عَنِ الزُّهْرِيِّ هَذَا الْحَدِيثَ وَقَالَ أَهْدَى لَهُ لَحْمَ حِمَارِ وَحْشٍ ‏.‏ وَهُوَ غَيْرُ مَحْفُوظٍ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَلِيٍّ وَزَيْدِ بْنِ أَرْقَمَ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah, telah menceritakan kepada kami Laith, dari Ibnu Syihab, dari Ubaidillah bin Abdullah, bahawa Ibnu Abbas memberitahunya bahawa As-Sha'b bin Jaththamah memberitahunya bahawa Rasulullah SAW telah melalui tempatnya di Al-Abwa atau Bawaddan. Maka dia (As-Sha'b) menghidangkan kepadanya seekor keldai liar, tetapi baginda menolaknya.  Apabila Rasulullah SAW melihat wajahnya yang menunjukkan rasa tidak senang, baginda bersabda:  \"Sesungguhnya kami tidak menolak pemberianmu, tetapi kami sedang dalam keadaan ihram.\"  Abu Isa berkata: Hadis ini adalah hadis yang baik dan sahih.  Dan sesungguhnya sebahagian ulama dari sahabat Nabi SAW dan selain mereka telah berpegang kepada hadis ini dan mereka tidak menyukai memakan haiwan buruan bagi orang yang sedang ihram.  Dan Syafie berkata:  Makna hadis ini pada pandangan kami ialah baginda menolaknya kerana menyangka ia adalah haiwan buruan dan baginda menolaknya kerana menjaga kesucian diri. Dan sebahagian sahabat Zuhri telah meriwayatkan dari Zuhri hadis ini dan berkata: Dia menghidangkan kepadanya daging keldai liar.  Dan ia bukanlah riwayat yang terpelihara.  Beliau berkata:  Di dalam bab ini terdapat riwayat daripada Ali dan Zaid bin Arqam."
  },
  {
    "id": 26631,
    "hadith_number": 851,
    "tajuk_hadith": "Memakan Belalang Semasa Haji atau Umrah",
    "perawi_melayu": "Abu Hurairah meriwayatkan:",
    "english_text": "\"We went with the Messenger of Allah during Hajj or Umrah and we encountered a swarm of locusts. We began striking at them with our whips and set our staffs, and the Prophet said: \"Eat it, for indeed it is game of the sea.\"",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ أَبِي الْمُهَزِّمِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي حَجٍّ أَوْ عُمْرَةٍ فَاسْتَقْبَلَنَا رِجْلٌ مِنْ جَرَادٍ فَجَعَلْنَا نَضْرِبُهُ بِسِيَاطِنَا وَعِصِيِّنَا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ كُلُوهُ فَإِنَّهُ مِنْ صَيْدِ الْبَحْرِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ ‏.‏ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ أَبِي الْمُهَزِّمِ عَنْ أَبِي هُرَيْرَةَ ‏.‏ وَأَبُو الْمُهَزِّمِ اسْمُهُ يَزِيدُ بْنُ سُفْيَانَ وَقَدْ تَكَلَّمَ فِيهِ شُعْبَةُ ‏.‏ وَقَدْ رَخَّصَ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ لِلْمُحْرِمِ أَنْ يَصِيدَ الْجَرَادَ وَيَأْكُلَهُ وَرَأَى بَعْضُهُمْ عَلَيْهِ صَدَقَةً إِذَا اصْطَادَهُ وَأَكَلَهُ ‏.‏",
    "malay_translation": "Kami pergi bersama Rasulullah SAW semasa mengerjakan haji atau umrah, dan kami terserempak dengan sekumpulan belalang. Kami mula memukulnya dengan cambuk dan tongkat kami, lalu Nabi SAW bersabda: \"Makanlah ia, kerana sesungguhnya ia adalah daripada haiwan buruan laut.\""
  },
  {
    "id": 26632,
    "hadith_number": 852,
    "tajuk_hadith": "Hukum Makan Daging Hyena",
    "perawi_melayu": "Ibn Abi Ammar berkata:",
    "english_text": "\"I asked Jabir bin Abdullah: 'Is the hyena game?' He said: 'Yes'\" He said: \"I said: 'Can it be eaten?' He said: 'Yes.'\" He said: \"I said: 'Did the Messenger of Allah say that?' He said: 'Yes.'\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عُمَيْرٍ، عَنِ ابْنِ أَبِي عَمَّارٍ، قَالَ قُلْتُ لِجَابِرِ بْنِ عَبْدِ اللَّهِ الضَّبُعُ أَصَيْدٌ هِيَ قَالَ نَعَمْ ‏.‏ قَالَ قُلْتُ آكُلُهَا قَالَ نَعَمْ ‏.‏ قَالَ قُلْتُ أَقَالَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ قَالَ عَلِيُّ بْنُ الْمَدِينِيِّ قَالَ يَحْيَى بْنُ سَعِيدٍ وَرَوَى جَرِيرُ بْنُ حَازِمٍ هَذَا الْحَدِيثَ فَقَالَ عَنْ جَابِرٍ عَنْ عُمَرَ ‏.‏ وَحَدِيثُ ابْنِ جُرَيْجٍ أَصَحُّ ‏.‏ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَاقَ وَالْعَمَلُ عَلَى هَذَا الْحَدِيثِ عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ فِي الْمُحْرِمِ إِذَا أَصَابَ ضَبُعًا أَنَّ عَلَيْهِ الْجَزَاءَ ‏.‏",
    "malay_translation": "Aku bertanya kepada Jabir bin Abdullah: 'Adakah haiwan hyena itu termasuk haiwan buruan?' Jawabnya: 'Ya.' Aku bertanya lagi: 'Bolehkah ia dimakan?' Jawabnya: 'Ya.' Aku bertanya lagi: 'Adakah Rasulullah SAW menyatakan demikian?' Jawabnya: 'Ya.'"
  },
  {
    "id": 26633,
    "hadith_number": 853,
    "tajuk_hadith": "Wuduk Nabi SAW Sempena Kemasukan ke Mekah",
    "perawi_melayu": "Daripada Ibnu Umar:",
    "english_text": "\"The Prophet performed Ghusl for entered Makkah at Fakhkh.\"",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى، حَدَّثَنَا هَارُونُ بْنُ صَالِحٍ الطَّلْحِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، قَالَ اغْتَسَلَ النَّبِيُّ صلى الله عليه وسلم لِدُخُولِهِ مَكَّةَ بِفَخٍّ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَيْرُ مَحْفُوظٍ ‏.‏ وَالصَّحِيحُ مَا رَوَى نَافِعٌ عَنِ ابْنِ عُمَرَ أَنَّهُ كَانَ يَغْتَسِلُ لِدُخُولِ مَكَّةَ ‏.‏ وَبِهِ يَقُولُ الشَّافِعِيُّ يُسْتَحَبُّ الاِغْتِسَالُ لِدُخُولِ مَكَّةَ ‏.‏ وَعَبْدُ الرَّحْمَنِ بْنُ زَيْدِ بْنِ أَسْلَمَ ضَعِيفٌ فِي الْحَدِيثِ ضَعَّفَهُ أَحْمَدُ بْنُ حَنْبَلٍ وَعَلِيُّ بْنُ الْمَدِينِيِّ وَغَيْرُهُمَا وَلاَ نَعْرِفُ هَذَا الْحَدِيثَ مَرْفُوعًا إِلاَّ مِنْ حَدِيثِهِ ‏.‏",
    "malay_translation": "Daripada Ibnu Umar, beliau berkata: Nabi SAW berwuduk (atau mandi besar) ketika baginda memasuki Mekah di Fakhkh. Abu Isa berkata: Hadis ini adalah hadis yang tidak dipelihara.  Hadis yang sahih ialah apa yang diriwayatkan oleh Nafi' daripada Ibnu Umar bahawa baginda selalu berwuduk (mandi besar) ketika memasuki Mekah.  Imam Syafie juga berkata:  Sunat berwuduk (mandi besar) ketika memasuki Mekah.  Abdul Rahman bin Zaid bin Aslam adalah seorang yang lemah dalam meriwayatkan hadis, kelemahannya telah dinyatakan oleh Ahmad bin Hanbal, Ali bin al-Madini dan lain-lain.  Kami tidak mengetahui hadis ini diriwayatkan secara mursal kecuali dari hadisnya."
  },
  {
    "id": 26634,
    "hadith_number": 854,
    "tajuk_hadith": "Ketibaan Nabi SAW di Mekah",
    "perawi_melayu": "Aisyah meriwayatkan:",
    "english_text": "\"When Prophet came to Makkah he entered it from its higher side, and left from its lower side.\"",
    "arabic_text": "حَدَّثَنَا أَبُو مُوسَى، مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا جَاءَ النَّبِيُّ صلى الله عليه وسلم إِلَى مَكَّةَ دَخَلَ مِنْ أَعْلاَهَا وَخَرَجَ مِنْ أَسْفَلِهَا ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عُمَرَ ‏.‏ قَاَلَ أَبُو عِيسَى حَدِيثُ عَائِشَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Aisyah meriwayatkan:  “Apabila Nabi SAW tiba di Mekah, baginda memasuki Mekah dari bahagian atasnya dan keluar dari bahagian bawahnya.”"
  },
  {
    "id": 26635,
    "hadith_number": 855,
    "tajuk_hadith": "Ketibaan Nabi SAW di Mekah pada Siang Hari",
    "perawi_melayu": "Ibn Umar meriwayatkan:",
    "english_text": "\"The Prophet entered Makkah during the daytime.\"",
    "arabic_text": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الْعُمَرِيُّ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ مَكَّةَ نَهَارًا ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏",
    "malay_translation": "Daripada Ibnu Umar r.a., bahawa Nabi Muhammad SAW memasuki Mekah pada waktu siang. Abu Isa berkata: “Hadis ini adalah hadis yang baik.”"
  },
  {
    "id": 26636,
    "hadith_number": 856,
    "tajuk_hadith": "Mengenai Mengangkat Tangan Melihat Kaabah",
    "perawi_melayu": "Al-Muhajir Al-Makki berkata:",
    "english_text": "Jabir bin Abdulla was asked about a man raising his hands when he sees the House (Ka'bah). So he said: 'We performed Hajj with the Messenger of Allah and we did it.\"",
    "arabic_text": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي قَزَعَةَ الْبَاهِلِيِّ، عَنِ الْمُهَاجِرِ الْمَكِّيِّ، قَالَ سُئِلَ جَابِرُ بْنُ عَبْدِ اللَّهِ أَيَرْفَعُ الرَّجُلُ يَدَيْهِ إِذَا رَأَى الْبَيْتَ فَقَالَ حَجَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم أَفَكُنَّا نَفْعَلُهُ ‏.‏ قَالَ أَبُو عِيسَى رَفْعُ الْيَدَيْنِ عِنْدَ رُؤْيَةِ الْبَيْتِ إِنَّمَا نَعْرِفُهُ مِنْ حَدِيثِ شُعْبَةَ عَنْ أَبِي قَزَعَةَ ‏.‏ وَأَبُو قَزَعَةَ اسْمُهُ سُوَيْدُ بْنُ حُجَيْرٍ ‏.‏",
    "malay_translation": "Jabir bin Abdullah ditanya tentang seseorang yang mengangkat tangannya apabila melihat Kaabah. Maka beliau berkata: 'Kami menunaikan Haji bersama Rasulullah SAW dan kami tidak melakukannya.'"
  },
  {
    "id": 26637,
    "hadith_number": 857,
    "tajuk_hadith": "Tindakan Nabi SAW di Masjidil Haram semasa tiba di Mekah",
    "perawi_melayu": "Jabir meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، أَخْبَرَنَا سُفْيَانُ الثَّوْرِيُّ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرٍ، قَالَ لَمَّا قَدِمَ النَّبِيُّ صلى الله عليه وسلم مَكَّةَ دَخَلَ الْمَسْجِدَ فَاسْتَلَمَ الْحَجَرَ ثُمَّ مَضَى عَلَى يَمِينِهِ فَرَمَلَ ثَلاَثًا وَمَشَى أَرْبَعًا ثُمَّ أَتَى الْمَقَامَ فَقَالَ ‏:‏ ‏(‏وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى ‏)‏ فَصَلَّى رَكْعَتَيْنِ وَالْمَقَامُ بَيْنَهُ وَبَيْنَ الْبَيْتِ ثُمَّ أَتَى الْحَجَرَ بَعْدَ الرَّكْعَتَيْنِ فَاسْتَلَمَهُ ثُمَّ خَرَجَ إِلَى الصَّفَا أَظُنُّهُ قَالََّ ‏:‏‏(‏ إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ ‏)‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عُمَرَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ جَابِرٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ ‏.‏",
    "malay_translation": "Jabir meriwayatkan:  Apabila Nabi SAW tiba di Mekah, baginda masuk ke Masjid dan mencium Hajar Aswad, kemudian baginda berjalan ke kanan baginda dan melakukan saie (berjalan pantas) sebanyak tiga pusingan dan berjalan biasa empat pusingan. Kemudian baginda pergi ke Maqam Ibrahim dan bersabda:  “Ambillah Maqam Ibrahim sebagai tempat solat.” Kemudian baginda menunaikan solat dua rakaat dengan Maqam Ibrahim di antara baginda dan Kaabah. Kemudian baginda pergi ke Hajar Aswad selepas dua rakaat itu untuk menciumnya, kemudian baginda keluar ke Safa – saya ingat – baginda bersabda: “Sesungguhnya Safa dan Marwa adalah di antara syiar-syiar Allah.”  Riwayat lain menyebut daripada Ibnu Umar. Abu Isa berkata: Hadis Jabir ini adalah hadis yang baik dan sahih. Amalan berdasarkan hadis ini adalah amalan para ulama."
  },
  {
    "id": 26638,
    "hadith_number": 858,
    "tajuk_hadith": "Rasulullah Melakukan Raml dan Berjalan Sewaktu Tawaf",
    "perawi_melayu": "Jabir meriwayatkan:",
    "english_text": "\"The Prophet performed Raml from the (Black) Stone to the (Black) Stone for three (circuits), and he walked four (circuits).\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم رَمَلَ مِنَ الْحَجَرِ إِلَى الْحَجَرِ ثَلاَثًا وَمَشَى أَرْبَعًا ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عُمَرَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ جَابِرٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ ‏.‏ قَالَ الشَّافِعِيُّ إِذَا تَرَكَ الرَّمَلَ عَمْدًا فَقَدْ أَسَاءَ وَلاَ شَىْءَ عَلَيْهِ وَإِذَا لَمْ يَرْمُلْ فِي الأَشْوَاطِ الثَّلاَثَةِ لَمْ يَرْمُلْ فِيمَا بَقِيَ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ لَيْسَ عَلَى أَهْلِ مَكَّةَ رَمَلٌ وَلاَ عَلَى مَنْ أَحْرَمَ مِنْهَا ‏.‏",
    "malay_translation": "Jabir meriwayatkan bahawa Nabi SAW melakukan Raml dari Hajar Aswad ke Hajar Aswad sebanyak tiga pusingan, dan berjalan biasa sebanyak empat pusingan."
  },
  {
    "id": 26639,
    "hadith_number": 859,
    "tajuk_hadith": "Mencium Rukun Kaabah: Pandangan Ibnu Abbas dan Muawiyah",
    "perawi_melayu": "Abu Tufail meriwayatkan:",
    "english_text": "\"I was with Ibn Abbas, and Mu'awiyah would not pass any corner without touching it. So Ibn Abbas said to him: 'the Prophet would not touch any besides the Black Stone and the Yemeni corner.' So Mu'awiyah said: 'There is no part of the House that is untouchable.'\"",
    "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا سُفْيَانُ، وَمَعْمَرٌ، عَنِ ابْنِ خُثَيْمٍ، عَنْ أَبِي الطُّفَيْلِ، قَالَ كُنْتُ مَعَ ابْنِ عَبَّاسٍ وَمُعَاوِيَةُ لاَ يَمُرُّ بِرُكْنٍ إِلاَّ اسْتَلَمَهُ فَقَالَ لَهُ ابْنُ عَبَّاسٍ إِنَّ النَّبِيَّ صلى الله عليه وسلم لَمْ يَكُنْ يَسْتَلِمُ إِلاَّ الْحَجَرَ الأَسْوَدَ وَالرُّكْنَ الْيَمَانِيَ ‏.‏ فَقَالَ مُعَاوِيَةُ لَيْسَ شَيْءٌ مِنَ الْبَيْتِ مَهْجُورًا ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عُمَرَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ أَنْ لاَ يَسْتَلِمَ إِلاَّ الْحَجَرَ الأَسْوَدَ وَالرُّكْنَ الْيَمَانِيَ ‏.‏",
    "malay_translation": "Aku berada bersama Ibnu Abbas, dan Muawiyah tidak akan melalui mana-mana sudut Kaabah tanpa menciumnya. Maka Ibnu Abbas berkata kepadanya: “Nabi SAW tidak mencium melainkan hanya Hajar Aswad dan Rukun Yamani.” Maka Muawiyah berkata: “Tiada bahagian daripada Baitullah yang ditinggalkan (tanpa dicium).”"
  },
  {
    "id": 26640,
    "hadith_number": 860,
    "tajuk_hadith": "Nabi SAW Menziarah Baitullah Dengan Memakai Burdah",
    "perawi_melayu": "Ibn Ya'la meriwayatkan daripada bapanya:",
    "english_text": "\"The Prophet performed Tawaf of the House Mudtabi'an, and he was wearing a Burd.\"",
    "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا قَبِيصَةُ، عَنْ سُفْيَانَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَبْدِ الْحَمِيدِ، عَنِ ابْنِ يَعْلَى، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم طَافَ بِالْبَيْتِ مُضْطَبِعًا وَعَلَيْهِ بُرْدٌ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثُ الثَّوْرِيِّ عَنِ ابْنِ جُرَيْجٍ وَلاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِهِ وَهُوَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَعَبْدُ الْحَمِيدِ هُوَ ابْنُ جُبَيْرِ بْنِ شَيْبَةَ ‏.‏ عَنِ ابْنِ يَعْلَى عَنْ أَبِيهِ وَهُوَ يَعْلَى بْنُ أُمَيَّةَ ‏.‏",
    "malay_translation": "Daripada Ibn Ya'la daripada bapanya; bahawa Nabi SAW telah melakukan tawaf di Baitullah dalam keadaan berpakaian ihram dan memakai burdah."
  },
  {
    "id": 26641,
    "hadith_number": 861,
    "tajuk_hadith": "Umar bin Al-Khattab Mencium Hajar Aswad",
    "perawi_melayu": "Abbas bin Rabi'ah berkata:",
    "english_text": "\"I saw Umar bin Al-Khattab kissing the (Black) Stone and saying: 'I am kissing you while I know that you are just a stone, and if I had not seen the Messenger of Allah kissing you, I would not kiss you.'\"",
    "arabic_text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَابِسِ بْنِ رَبِيعَةَ، قَالَ رَأَيْتُ عُمَرَ بْنَ الْخَطَّابِ يُقَبِّلُ الْحَجَرَ وَيَقُولُ إِنِّي أُقَبِّلُكَ وَأَعْلَمُ أَنَّكَ حَجَرٌ وَلَوْلاَ أَنِّي رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُقَبِّلُكَ لَمْ أُقَبِّلْكَ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي بَكْرٍ وَابْنِ عُمَرَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Aku melihat Umar bin Al-Khattab mencium Hajar Aswad dan berkata:  'Aku menciummu, sedangkan aku tahu bahawa engkau hanyalah batu. Sekiranya aku tidak melihat Rasulullah ﷺ menciummu, nescaya aku tidak akan menciummu.'"
  },
  {
    "id": 26642,
    "hadith_number": 862,
    "tajuk_hadith": "Mencium dan Mencium Batu Hajar Aswad",
    "perawi_melayu": "Az-Zubair bin Arabi meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنِ الزُّبَيْرِ بْنِ عَرَبِيٍّ، أَنَّ رَجُلاً، سَأَلَ ابْنَ عُمَرَ عَنِ اسْتِلاَمِ الْحَجَرِ، فَقَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَسْتَلِمُهُ وَيُقَبِّلُهُ ‏.‏ فَقَالَ الرَّجُلُ أَرَأَيْتَ إِنْ غُلِبْتُ عَلَيْهِ أَرَأَيْتَ إِنْ زُوحِمْتُ فَقَالَ ابْنُ عُمَرَ اجْعَلْ أَرَأَيْتَ بِالْيَمَنِ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَسْتَلِمُهُ وَيُقَبِّلُهُ ‏.‏ قَالَ وَهَذَا هُوَ الزُّبَيْرُ بْنُ عَرَبِيٍّ رَوَى عَنْهُ حَمَّادُ بْنُ زَيْدٍ وَالزُّبَيْرُ بْنُ عَرَبِيٍّ كُوفِيٌّ يُكْنَى أَبَا سَلَمَةَ سَمِعَ مِنْ أَنَسِ بْنِ مَالِكٍ وَغَيْرِ وَاحِدٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم رَوَى عَنْهُ سُفْيَانُ الثَّوْرِيُّ وَغَيْرُ وَاحِدٍ مِنَ الأَئِمَّةِ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ عَنْهُ مِنْ غَيْرِ وَجْهٍ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ يَسْتَحِبُّونَ تَقْبِيلَ الْحَجَرِ فَإِنْ لَمْ يُمْكِنْهُ وَلَمْ يَصِلْ إِلَيْهِ اسْتَلَمَهُ بِيَدِهِ وَقَبَّلَ يَدَهُ وَإِنْ لَمْ يَصِلْ إِلَيْهِ اسْتَقْبَلَهُ إِذَا حَاذَى بِهِ وَكَبَّرَ ‏.‏ وَهُوَ قَوْلُ الشَّافِعِيِّ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah, telah menceritakan kepada kami Hammad bin Zaid, dari Az-Zubair bin Arabi, bahawa seorang lelaki telah bertanya kepada Ibnu Umar tentang menyentuh Batu (Hitam), maka beliau berkata: \"Aku melihat Nabi SAW menyentuhnya dan menciumnya.\" Maka lelaki itu berkata: \"Apakah pandangan tuan jika aku dihimpit orang ramai dan apakah pandangan tuan jika orang ramai mengatasi aku?\" Ibnu Umar berkata: \"Tinggalkanlah persoalan 'Apakah pandangan tuan' itu di Yaman. Aku melihat Nabi SAW menyentuhnya dan menciumnya.\" Beliau berkata, dan inilah Az-Zubair bin Arabi, Hammad bin Zaid meriwayatkan darinya, dan Az-Zubair bin Arabi adalah penduduk Kufah, kunyahnya Abu Salamah, mendengar daripada Anas bin Malik dan beberapa orang sahabat Nabi SAW, Sufyan ats-Tsauri dan beberapa orang imam meriwayatkan darinya. Abu Isa berkata: Hadis Ibnu Umar adalah hadis yang baik dan sahih, dan ia telah diriwayatkan darinya melalui jalan lain. Amalan berdasarkan hadis ini di kalangan ahli ilmu, mereka menyukai mencium Hajar Aswad, jika tidak mampu dan tidak sampai kepadanya, maka ia menyentuhnya dengan tangan dan mencium tangannya, dan jika tidak sampai kepadanya, maka ia menghadapinya apabila berada di hadapannya dan bertakbir. Dan ini adalah pendapat Syafie."
  },
  {
    "id": 26643,
    "hadith_number": 863,
    "tajuk_hadith": "Cara Nabi SAW Melakukan Tawaf di Mekah",
    "perawi_melayu": "Jabir meriwayatkan:",
    "english_text": "\"When the Prophet arrived in Makkah, he performed seven (circuits) of Tawaf around the House. Then he came to the Maqam and said:  And take you (people) the Maqam (place) of Ibrahim as a place of prayer. Then he prayed behind the Maqam. Then he came to the (Black) Stone to touch it. Then he said: 'We begin with what Allah began with.' So he began at As-Safa and recited: Indeed As-Safa and Al-Marwah are among the Symbols of Allah.\"",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم حِينَ قَدِمَ مَكَّةَ طَافَ بِالْبَيْتِ سَبْعًا وَأَتَى الْمَقَامَ فَقَرَأَ ‏:‏‏(‏ وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى ‏)‏ فَصَلَّى خَلْفَ الْمَقَامِ ثُمَّ أَتَى الْحَجَرَ فَاسْتَلَمَهُ ثُمَّ قَالَ ‏\"‏ نَبْدَأُ بِمَا بَدَأَ اللَّهُ بِهِ ‏\"‏ ‏.‏ فَبَدَأَ بِالصَّفَا وَقَرَأَ ‏:‏ ‏(‏إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ ‏)‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ أَنَّهُ يَبْدَأُ بِالصَّفَا قَبْلَ الْمَرْوَةِ فَإِنْ بَدَأَ بِالْمَرْوَةِ قَبْلَ الصَّفَا لَمْ يُجْزِهِ وَبَدَأَ بِالصَّفَا ‏.‏ وَاخْتَلَفَ أَهْلُ الْعِلْمِ فِيمَنْ طَافَ بِالْبَيْتِ وَلَمْ يَطُفْ بَيْنَ الصَّفَا وَالْمَرْوَةِ حَتَّى رَجَعَ فَقَالَ بَعْضُ أَهْلِ الْعِلْمِ إِنْ لَمْ يَطُفْ بَيْنَ الصَّفَا وَالْمَرْوَةِ حَتَّى خَرَجَ مِنْ مَكَّةَ فَإِنْ ذَكَرَ وَهُوَ قَرِيبٌ مِنْهَا رَجَعَ فَطَافَ بَيْنَ الصَّفَا وَالْمَرْوَةِ وَإِنْ لَمْ يَذْكُرْ حَتَّى أَتَى بِلاَدَهُ أَجْزَأَهُ وَعَلَيْهِ دَمٌ ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ ‏.‏ وَقَالَ بَعْضُهُمْ إِنْ تَرَكَ الطَّوَافَ بَيْنَ الصَّفَا وَالْمَرْوَةِ حَتَّى رَجَعَ إِلَى بِلاَدِهِ فَإِنَّهُ لاَ يُجْزِيهِ ‏.‏ وَهُوَ قَوْلُ الشَّافِعِيِّ ‏.‏ قَالَ الطَّوَافُ بَيْنَ الصَّفَا وَالْمَرْوَةِ وَاجِبٌ لاَ يَجُوزُ الْحَجُّ إِلاَّ بِهِ ‏.‏",
    "malay_translation": "Apabila Nabi SAW tiba di Mekah, baginda melakukan tawaf tujuh pusingan mengelilingi Kaabah. Kemudian baginda pergi ke Maqam Ibrahim dan membaca, \"Dan jadikanlah Maqam Ibrahim itu tempat solat.\" Kemudian baginda mendirikan solat di belakang Maqam Ibrahim.  Selepas itu, baginda menghampiri Hajar Aswad dan menciumnya. Kemudian baginda bersabda, \"Kita mulakan dengan apa yang Allah SWT mulakan.\"  Maka baginda bermula di Safa dan membaca, \"Sesungguhnya Safa dan Marwah itu termasuk tanda-tanda kekuasaan Allah.\"  Abu Isa berkata, hadis ini adalah hadis yang baik dan sahih. Amalan berdasarkan hadis ini menurut ulama adalah bermula di Safa sebelum Marwah. Sekiranya bermula di Marwah sebelum Safa, ia tidak sah.  Para ulama berbeza pendapat tentang orang yang telah tawaf di Kaabah tetapi tidak melakukan sa'i di antara Safa dan Marwah sehingga dia kembali.  Sebahagian ulama berkata, jika dia tidak melakukan sa'i sehingga dia keluar dari Mekah, maka jika dia mengingati ketika masih dekat dengan Mekah, dia perlu kembali dan melakukan sa'i.  Jika dia tidak mengingati sehingga dia sampai ke kampung halamannya, maka ia dikira sah tetapi dia wajib membayar dam (denda). Ini adalah pendapat Sufian al-Tsauri. Sebahagian ulama yang lain pula berkata, jika dia meninggalkan sa'i sehingga dia pulang ke kampung halamannya, maka ia tidak sah. Ini adalah pendapat Imam Syafie.  Mereka berkata, sa'i di antara Safa dan Marwah adalah wajib dan haji tidak sah tanpa melakukan sa'i."
  },
  {
    "id": 26644,
    "hadith_number": 864,
    "tajuk_hadith": "Sa'i Rasulullah untuk Menunjukkan Kekuatan",
    "perawi_melayu": "Ibn Abbas meriwayatkan:",
    "english_text": "\"The Messenger of Allah only performed the Sa'i of the House and of As-Safa and Al-Marwah to show his strength to the idolaters.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ إِنَّمَا سَعَى رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ لِيُرِيَ الْمُشْرِكِينَ قُوَّتَهُ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَائِشَةَ وَابْنِ عُمَرَ وَجَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهُوَ الَّذِي يَسْتَحِبُّهُ أَهْلُ الْعِلْمِ أَنْ يَسْعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ ‏.‏ فَإِنْ لَمْ يَسْعَ وَمَشَى بَيْنَ الصَّفَا وَالْمَرْوَةِ رَأَوْهُ جَائِزًا ‏.‏",
    "malay_translation": "Rasulullah SAW hanya melakukan sa'i di antara Baitullah dan antara Safa dan Marwah untuk menunjukkan kekuatan baginda kepada orang-orang musyrik."
  },
  {
    "id": 26645,
    "hadith_number": 865,
    "tajuk_hadith": "Ibn Umar dan Perjalanannya di antara Safa dan Marwah",
    "perawi_melayu": "Kathir bin Jumhan berkata:",
    "english_text": "\"I saw Ibn Umar walking at the place of Sa'i so I said to him: 'Do you walk at the place of Sa'i between As-Safa and Al-Marwah?' He said: 'If I performed Sa'i, then it is because I saw the Messenger of Allah performing Sa'i there, and if I walked, then it is because I have seen the Messenger of Allah walking. And I am an old man.'\"",
    "arabic_text": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى، حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ كَثِيرِ بْنِ جُمْهَانَ، قَالَ رَأَيْتُ ابْنَ عُمَرَ يَمْشِي فِي السَّعْىِ فَقُلْتُ لَهُ أَتَمْشِي فِي السَّعْىِ بَيْنَ الصَّفَا وَالْمَرْوَةِ قَالَ لَئِنْ سَعَيْتُ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَسْعَى وَلَئِنْ مَشَيْتُ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَمْشِي وَأَنَا شَيْخٌ كَبِيرٌ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَرُوِيَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عُمَرَ نَحْوُهُ ‏.‏",
    "malay_translation": "Aku melihat Ibn Umar berjalan di tempat Sa'i, maka aku berkata kepadanya: 'Adakah tuan berjalan di tempat Sa'i di antara Safa dan Marwah?' Dia menjawab: 'Jika aku melakukan Sa'i, maka itu kerana aku melihat Rasulullah ﷺ melakukan Sa'i di situ, dan jika aku berjalan, maka itu kerana aku telah melihat Rasulullah ﷺ berjalan. Dan aku sudah tua.'"
  },
  {
    "id": 26646,
    "hadith_number": 866,
    "tajuk_hadith": "Nabi SAW Melakukan Tawaf di Atas Kenderaan",
    "perawi_melayu": "Ibn Abbas meriwayatkan:",
    "english_text": "\"The Prophet performed Tawaf upon his mount, so when he arrived at the (Black Stone) corner, he pointed to it.\"",
    "arabic_text": "حَدَّثَنَا بِشْرُ بْنُ هِلاَلٍ الصَّوَّافُ الْبَصْرِيُّ، حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، وَعَبْدُ الْوَهَّابِ الثَّقَفِيُّ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ طَافَ النَّبِيُّ صلى الله عليه وسلم عَلَى رَاحِلَتِهِ فَإِذَا انْتَهَى إِلَى الرُّكْنِ أَشَارَ إِلَيْهِ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ جَابِرٍ وَأَبِي الطُّفَيْلِ وَأُمِّ سَلَمَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ كَرِهَ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ أَنْ يَطُوفَ الرَّجُلُ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ رَاكِبًا إِلاَّ مِنْ عُذْرٍ ‏.‏ وَهُوَ قَوْلُ الشَّافِعِيِّ ‏.‏",
    "malay_translation": "Rasulullah SAW melakukan tawaf di atas kenderaan baginda.  Apabila baginda sampai ke sudut (Hajarul Aswad), baginda menunjuk ke arahnya."
  },
  {
    "id": 26647,
    "hadith_number": 867,
    "tajuk_hadith": "Kebebasan daripada Dosa Melalui Tawaf",
    "perawi_melayu": "Ibn Abbas meriwayatkan:",
    "english_text": "\"Whoever performed Tawaf around the House fifty time, he will be as free of his sins as the day his mother bore him.\"",
    "arabic_text": "يَحْيَى بْنُ يَمَانٍ، عَنْ شَرِيكٍ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ طَافَ بِالْبَيْتِ خَمْسِينَ مَرَّةً خَرَجَ مِنْ ذُنُوبِهِ كَيَوْمِ وَلَدَتْهُ أُمُّهُ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَنَسٍ وَابْنِ عُمَرَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ غَرِيبٌ ‏.‏ سَأَلْتُ مُحَمَّدًا عَنْ هَذَا الْحَدِيثِ فَقَالَ إِنَّمَا يُرْوَى هَذَا عَنِ ابْنِ عَبَّاسٍ قَوْلُهُ ‏.‏",
    "malay_translation": "Daripada Yahya bin Yaman, daripada Syarik, daripada Abu Ishaq, daripada Abdullah bin Sa’id bin Jubair, daripada bapanya, daripada Ibnu Abbas, katanya: Rasulullah SAW bersabda:  \"Barangsiapa yang melakukan tawaf di Baitullah sebanyak lima puluh kali, nescaya dia akan bebas daripada dosanya seperti keadaan ketika ibunya melahirkannya.\"  Di dalam bab ini juga diriwayatkan daripada Anas dan Ibnu Umar. Abu Isa berkata:  Hadis Ibnu Abbas ini adalah hadis yang ganjil. Aku telah bertanya kepada Muhammad tentang hadis ini, lalu katanya: Hadis ini hanya diriwayatkan daripada Ibnu Abbas."
  },
  {
    "id": 26648,
    "hadith_number": 868,
    "tajuk_hadith": "Keutamaan Abdullah bin Sa'eed bin Jubair",
    "perawi_melayu": "Ayyub As-Sakhtiyani berkata:",
    "english_text": "\"We considered Abdullah bin Sa'eed bin Jubair to be better than his father, and he had a brother named Abdul-Malik bin Sa'eed bin Jubair who also reported from him.\"",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَيُّوبَ السَّخْتِيَانِيِّ قَالَ كَانُوا يَعُدُّونَ عَبْدَ اللَّهِ بْنَ سَعِيدِ بْنِ جُبَيْرٍ أَفْضَلَ مِنْ أَبِيهِ ‏.‏ وَلِعَبْدِ اللَّهِ أَخٌ يُقَالُ لَهُ عَبْدُ الْمَلِكِ بْنُ سَعِيدِ بْنِ جُبَيْرٍ وَقَدْ رَوَى عَنْهُ أَيْضًا ‏.‏",
    "malay_translation": "Mereka menganggap Abdullah bin Sa'eed bin Jubair lebih baik daripada bapanya. Dan Abdullah mempunyai seorang adik beradik lelaki bernama Abdul Malik bin Sa'eed bin Jubair yang turut meriwayatkan hadis daripada beliau."
  },
  {
    "id": 26649,
    "hadith_number": 869,
    "tajuk_hadith": "Larangan Mencegah Tawaf dan Solat di Masjidil Haram",
    "perawi_melayu": "Jubair bin Mut'im meriwayatkan bahawa :",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو عَمَّارٍ، وَعَلِيُّ بْنُ خَشْرَمٍ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ عَبْدِ اللَّهِ بْنِ بَابَاهْ، عَنْ جُبَيْرِ بْنِ مُطْعِمٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَا بَنِي عَبْدِ مَنَافٍ لاَ تَمْنَعُوا أَحَدًا طَافَ بِهَذَا الْبَيْتِ وَصَلَّى أَيَّةَ سَاعَةٍ شَاءَ مِنْ لَيْلٍ أَوْ نَهَارٍ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ وَأَبِي ذَرٍّ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ جُبَيْرِ بْنِ مُطْعِمٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رَوَاهُ عَبْدُ اللَّهِ بْنُ أَبِي نَجِيحٍ عَنْ عَبْدِ اللَّهِ بْنِ بَابَاهْ أَيْضًا ‏.‏ وَقَدِ اخْتَلَفَ أَهْلُ الْعِلْمِ فِي الصَّلاَةِ بَعْدَ الْعَصْرِ وَبَعْدَ الصُّبْحِ بِمَكَّةَ فَقَالَ بَعْضُهُمْ لاَ بَأْسَ بِالصَّلاَةِ وَالطَّوَافِ بَعْدَ الْعَصْرِ وَبَعْدَ الصُّبْحِ ‏.‏ وَهُوَ قَوْلُ الشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ وَاحْتَجُّوا بِحَدِيثِ النَّبِيِّ صلى الله عليه وسلم هَذَا ‏.‏ وَقَالَ بَعْضُهُمْ إِذَا طَافَ بَعْدَ الْعَصْرِ لَمْ يُصَلِّ حَتَّى تَغْرُبَ الشَّمْسُ وَكَذَلِكَ إِنْ طَافَ بَعْدَ صَلاَةِ الصُّبْحِ لَمْ يُصَلِّ حَتَّى تَطْلُعَ الشَّمْسُ ‏.‏ وَاحْتَجُّوا بِحَدِيثِ عُمَرَ أَنَّهُ طَافَ بَعْدَ صَلاَةِ الصُّبْحِ فَلَمْ يُصَلِّ وَخَرَجَ مِنْ مَكَّةَ حَتَّى نَزَلَ بِذِي طُوًى فَصَلَّى بَعْدَ مَا طَلَعَتِ الشَّمْسُ ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَمَالِكِ بْنِ أَنَسٍ ‏.‏",
    "malay_translation": "Abu 'Ammar dan Ali bin Khasram berkata: Kami telah mendengar daripada Sufyan bin Uyaina, daripada Abu Az-Zubair, daripada Abdullah bin Babah, daripada Jubair bin Mut'im bahawa Nabi SAW telah bersabda: \"Wahai Bani Abd Manaf, janganlah kamu menghalang sesiapa pun daripada melakukan tawaf di Baitullah ini dan mendirikan solat pada bila-bila masa yang diingininya, sama ada pada waktu malam atau siang.\"  Juga diriwayatkan dalam bab ini daripada Ibnu Abbas dan Abu Dzar. Abu Isa berkata: Hadis Jubair bin Mut'im adalah hadis yang baik dan sahih. Ia juga diriwayatkan oleh Abdullah bin Abi Najih daripada Abdullah bin Babah.  Para ulama berselisih pendapat tentang solat selepas Asar dan selepas Subuh di Makkah. Sebahagian daripada mereka berkata: Tiada apa-apa masalah untuk mendirikan solat dan tawaf selepas Asar dan selepas Subuh. Ini adalah pendapat Syafie, Ahmad dan Ishaq. Mereka berhujjah dengan hadis Nabi SAW ini.  Sebahagian yang lain pula berkata: Jika seseorang itu melakukan tawaf selepas Asar, dia tidak boleh mendirikan solat sehingga matahari terbenam. Begitu juga jika dia melakukan tawaf selepas solat Subuh, dia tidak boleh mendirikan solat sehingga matahari terbit. Mereka berhujjah dengan hadis Umar bahawa baginda telah melakukan tawaf selepas solat Subuh, kemudian tidak mendirikan solat dan keluar dari Makkah sehingga sampai di Zul Tuwa, barulah baginda mendirikan solat selepas matahari terbit. Ini adalah pendapat Sufyan Ats-Tsauri dan Malik bin Anas."
  },
  {
    "id": 26650,
    "hadith_number": 870,
    "tajuk_hadith": "Surah yang Dibaca Rasulullah SAW Semasa Tawaf",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan:",
    "english_text": "During the two Rak'ah of Tawaf, the Messenger of Allah recited the two Surat of Ikhlas, \"Say: O you disbelievers!\" and: \"Say: He is Allah, (the) One.\"",
    "arabic_text": "أَخْبَرَنَا أَبُو مُصْعَبٍ الْمَدَنِيُّ، قِرَاءَةً عَنْ عَبْدِ الْعَزِيزِ بْنِ عِمْرَانَ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَرَأَ فِي رَكْعَتَىِ الطَّوَافِ بِسُورَتَىِ الإِخْلاَصِْ ‏:‏ ‏(‏ قُلْ يَا أَيُّهَا الْكَافِرُونَ ‏)‏ وَ ‏(‏ قُلْ هُوَ اللَّهُ أَحَدٌ ‏)‏‏.‏",
    "malay_translation": "Jabir bin Abdullah meriwayatkan bahawa Rasulullah SAW telah membaca Surah Al-Ikhlas dan Surah Al-Ikhlas (Qul huwallahu ahad) semasa mengerjakan dua rakaat solat tawaf."
  },
  {
    "id": 26651,
    "hadith_number": 871,
    "tajuk_hadith": "Bacaan Sunat Semasa Tawaf",
    "perawi_melayu": "Ja'far bin Muhammad meriwayatkan daripada bapanya:",
    "english_text": "that he considered it recommended for the two Rak'ah of Tawaf to recite: Say: \"O you disbelievers!\" and: Say: \"He is Allah, (the) One.\"",
    "arabic_text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يَسْتَحِبُّ أَنْ يَقْرَأَ، فِي رَكْعَتَىِ الطَّوَافِ بِـ ‏(‏ قُلْ يَا أَيُّهَا الْكَافِرُونَ ‏)‏ وَ ‏(‏ قُلْ هُوَ اللَّهُ أَحَدٌ ‏)‏ ‏.‏ قَالَ أَبُو عِيسَى وَهَذَا أَصَحُّ مِنْ حَدِيثِ عَبْدِ الْعَزِيزِ بْنِ عِمْرَانَ وَحَدِيثُ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ فِي هَذَا أَصَحُّ مِنْ حَدِيثِ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَعَبْدُ الْعَزِيزِ بْنُ عِمْرَانَ ضَعِيفٌ فِي الْحَدِيثِ ‏.‏",
    "malay_translation": "Daripada Hanaad, daripada Waki', daripada Sufyan, daripada Ja'far bin Muhammad, daripada bapanya, bahawa baginda menyukai untuk membaca, dalam dua rakaat tawaf,  (Qul ya ayyuhal kaafirun) dan (Qul huwallahu ahad). Abu Isa berkata, “Hadis ini lebih sahih daripada hadis Abdul Aziz bin Imran. Dan hadis Ja'far bin Muhammad daripada bapanya dalam hal ini lebih sahih daripada hadis Ja'far bin Muhammad daripada bapanya daripada Jabir daripada Nabi SAW.  Dan Abdul Aziz bin Imran adalah lemah dalam periwayatan hadis.”"
  },
  {
    "id": 26652,
    "hadith_number": 872,
    "tajuk_hadith": "Syarat-Syarat Masuk Syurga dan Perjanjian",
    "perawi_melayu": "Zaid bin Uthai berkata:",
    "english_text": "XI asked Ali: \"What is it that you were sent with?\" He said: \"With four things: None will be admitted into Paradise except for the soul that is a Muslim. None is to perform Tawaf around the House while naked. The Muslims and the idolaters will not be gathering (in Makkah) together after this year. And for whomever there is a covenant between him and the Prophet, then his covenant is (valid) until its term, and for that in which there was no term, then it shall be four months.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي إِسْحَاقَ، عَنْ زَيْدِ بْنِ أُثَيْعٍ، قَالَ سَأَلْتُ عَلِيًّا بِأَىِّ شَيْءٍ بُعِثْتَ قَالَ بِأَرْبَعٍ لاَ يَدْخُلُ الْجَنَّةَ إِلاَّ نَفْسٌ مُسْلِمَةٌ وَلاَ يَطُوفُ بِالْبَيْتِ عُرْيَانٌ وَلاَ يَجْتَمِعُ الْمُسْلِمُونَ وَالْمُشْرِكُونَ بَعْدَ عَامِهِمْ هَذَا وَمَنْ كَانَ بَيْنَهُ وَبَيْنَ النَّبِيِّ صلى الله عليه وسلم عَهْدٌ فَعَهْدُهُ إِلَى مُدَّتِهِ وَمَنْ لاَ مُدَّةَ لَهُ فَأَرْبَعَةُ أَشْهُرٍ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَلِيٍّ حَدِيثٌ حَسَنٌ ‏.‏",
    "malay_translation": "Aku bertanya kepada Ali: \"Dengan apakah engkau diutus?\" Jawabnya: \"Dengan empat perkara: Tiada seorang pun akan masuk syurga melainkan jiwa yang beriman. Tiada seorang pun yang mengerjakan tawaf di Baitullah dalam keadaan telanjang. Orang Islam dan orang musyrik tidak akan berkumpul (di Makkah) lagi selepas tahun ini. Dan bagi sesiapa yang mempunyai perjanjian dengan Nabi SAW, maka perjanjiannya tetap sah sehingga tempohnya tamat. Bagi yang tiada tempoh, maka ia selama empat bulan.\""
  },
  {
    "id": 26653,
    "hadith_number": 873,
    "tajuk_hadith": "Perawi Hadis: Zaid bin Yuthai",
    "perawi_melayu": "Zaid bin Yuthai berkata:",
    "english_text": "(Another chain) and they said: \"Zaid bin Yuthai\" and this is more correct.",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، وَنَصْرُ بْنُ عَلِيٍّ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي إِسْحَاقَ، نَحْوَهُ وَقَالاَ زَيْدُ بْنُ يُثَيْعٍ ‏.‏ وَهَذَا أَصَحُّ ‏.‏ قَالَ أَبُو عِيسَى وَشُعْبَةُ وَهِمَ فِيهِ فَقَالَ زَيْدُ بْنُ أُثَيْلٍ ‏.‏",
    "malay_translation": " (Satu lagi sanad) dan mereka berkata: \"Zaid bin Yuthai\" dan ini adalah lebih sahih.  Ibn Abi Umar dan Nasr bin Ali meriwayatkan daripada Sufyan bin Uyainah, daripada Abi Ishaq, seumpama itu dan mereka berkata Zaid bin Yuthai. Dan ini lebih sahih. Abu Isa dan Syu'bah keliru mengenainya lalu berkata Zaid bin Utail."
  },
  {
    "id": 26654,
    "hadith_number": 874,
    "tajuk_hadith": "Kerisauan Nabi SAW tentang Ummah",
    "perawi_melayu": "Aisyah meriwayatkan:",
    "english_text": "\"The Prophet left me while he had a joyous look of contentment and he returned to me grieving. So I asked him about that and he said: 'I entered the Ka'bah, and I wished that I had not done it. I fear that my Ummah will follow me (in that) after me.'\"",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا وَكِيعٌ، عَنْ إِسْمَاعِيلَ بْنِ عَبْدِ الْمَلِكِ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ، قَالَتْ خَرَجَ النَّبِيُّ صلى الله عليه وسلم مِنْ عِنْدِي وَهُوَ قَرِيرُ الْعَيْنِ طَيِّبُ النَّفْسِ فَرَجَعَ إِلَىَّ وَهُوَ حَزِينٌ فَقُلْتُ لَهُ فَقَالَ ‏\n\"‏ إِنِّي دَخَلْتُ الْكَعْبَةَ وَوَدِدْتُ أَنِّي لَمْ أَكُنْ فَعَلْتُ إِنِّي أَخَافُ أَنْ أَكُونَ أَتْعَبْتُ أُمَّتِي مِنْ بَعْدِي ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Nabi SAW meninggalkan saya dengan wajah yang berseri-seri dan riang gembira, kemudian baginda kembali dengan wajah yang sedih.  Maka saya bertanya kepada baginda tentang hal itu, lalu baginda menjawab:  \"Sesungguhnya aku telah memasuki Kaabah, dan aku berharap aku tidak melakukannya. Aku bimbang umatku akan mengikut jejakku (dalam hal itu) selepas aku.\""
  },
  {
    "id": 26655,
    "hadith_number": 875,
    "tajuk_hadith": "Solat Nabi di dalam Kaabah",
    "perawi_melayu": "Ibn Umar meriwayatkan daripada Bilal:",
    "english_text": "\"The Prophet performed Salat in the interior of the Ka'bah.\" And Ibn Abbas said: \"He did not perform Salat in it, but he said the Takbir.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، عَنْ بِلاَلٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى فِي جَوْفِ الْكَعْبَةِ ‏.‏ قَالَ ابْنُ عَبَّاسٍ لَمْ يُصَلِّ وَلَكِنَّهُ كَبَّرَ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أُسَامَةَ بْنِ زَيْدٍ وَالْفَضْلِ بْنِ عَبَّاسٍ وَعُثْمَانَ بْنِ طَلْحَةَ وَشَيْبَةَ بْنِ عُثْمَانَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ بِلاَلٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَيْهِ عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ لاَ يَرَوْنَ بِالصَّلاَةِ فِي الْكَعْبَةِ بَأْسًا ‏.‏ وَقَالَ مَالِكُ بْنُ أَنَسٍ لاَ بَأْسَ بِالصَّلاَةِ النَّافِلَةِ فِي الْكَعْبَةِ ‏.‏ وَكَرِهَ أَنْ تُصَلَّى الْمَكْتُوبَةُ فِي الْكَعْبَةِ ‏.‏ وَقَالَ الشَّافِعِيُّ لاَ بَأْسَ أَنْ تُصَلَّى الْمَكْتُوبَةُ وَالتَّطَوُّعُ فِي الْكَعْبَةِ لأَنَّ حُكْمَ النَّافِلَةِ وَالْمَكْتُوبَةِ فِي الطَّهَارَةِ وَالْقِبْلَةِ سَوَاءٌ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah, telah menceritakan kepada kami Hammad bin Zaid, dari Amru bin Dinar, dari Ibnu Umar, dari Bilal, bahawa Nabi SAW telah menunaikan solat di dalam Kaabah.  Ibn Abbas berkata: Baginda tidak menunaikan solat, tetapi Baginda telah melafazkan takbir.  Juga diriwayatkan dalam bab ini daripada Usamah bin Zaid, al-Fadl bin Abbas, Uthman bin Thalhah dan Syibah bin Uthman. Abu Isa berkata:  Riwayat Bilal ini adalah riwayat yang baik dan sahih.  Amalan ini diikuti oleh kebanyakan ulama; mereka tidak melihat sebarang kesalahan dengan menunaikan solat di dalam Kaabah.  Malik bin Anas berkata: Tiada kesalahan menunaikan solat sunat di dalam Kaabah.  Tetapi beliau tidak menyukai solat fardhu di dalam Kaabah.  Syafie berkata: Tiada kesalahan menunaikan solat fardhu dan sunat di dalam Kaabah kerana hukum solat sunat dan fardhu adalah sama dari segi kesucian dan kiblat."
  },
  {
    "id": 26656,
    "hadith_number": 876,
    "tajuk_hadith": "Pembangunan semula Kaabah dengan dua pintu",
    "perawi_melayu": "Al-Aswad bin Yazid meriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا أَبُو دَاوُدَ، عَنْ شُعْبَةَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ بْنِ يَزِيدَ، أَنَّ ابْنَ الزُّبَيْرِ، قَالَ لَهُ حَدِّثْنِي بِمَا، كَانَتْ تُفْضِي إِلَيْكَ أُمُّ الْمُؤْمِنِينَ يَعْنِي عَائِشَةَ فَقَالَ حَدَّثَتْنِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لَهَا ‏\n\"‏ لَوْلاَ أَنَّ قَوْمَكِ حَدِيثُو عَهْدٍ بِالْجَاهِلِيَّةِ لَهَدَمْتُ الْكَعْبَةَ وَجَعَلْتُ لَهَا بَابَيْنِ ‏\"‏ ‏.‏ قَالَ فَلَمَّا مَلَكَ ابْنُ الزُّبَيْرِ هَدَمَهَا وَجَعَلَ لَهَا بَابَيْنِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Mahmud bin Ghailan telah meriwayatkan kepada kami, Abu Daud telah meriwayatkan kepada kami daripada Syu’bah, daripada Abi Ishaq, daripada Al-Aswad bin Yazid bahawa Ibnu Zubair berkata kepadanya: \"Ceritakan kepadaku apa yang telah disampaikan oleh ibu kepada orang-orang yang beriman kepadamu\" – iaitu Aisyah – maka beliau berkata: \"Beliau telah menceritakan kepadaku bahawa Rasulullah SAW bersabda:  'Sekiranya kaummu itu tidak masih lagi dekat dengan zaman jahiliyyah, nescaya aku akan merobohkan Kaabah dan aku akan menjadikan ia dua pintu.'\" Beliau berkata: \"Maka setelah Ibnu Zubair berkuasa, beliau merobohkannya dan menjadikan ia dua pintu.\" Abu Isa berkata: \"Hadis ini adalah hadis yang baik dan sahih.\""
  },
  {
    "id": 26657,
    "hadith_number": 877,
    "tajuk_hadith": "Solat di Hijr",
    "perawi_melayu": "Aisyah meriwayatkan:",
    "english_text": "\"I wanted to enter the House to perform Salat in it, so the Messenger of Allah took me by the hand and put me in the Hijr, and he said: 'Perform Salat in the Hijri if you want to enter the House. For indeed it is part of the House, but your people considered it insignificant when they built the Ka'bah, so they put it outside the House.'\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ عَلْقَمَةَ بْنِ أَبِي عَلْقَمَةَ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أُحِبُّ أَنْ أَدْخُلَ، الْبَيْتَ فَأُصَلِّيَ فِيهِ فَأَخَذَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَدِي فَأَدْخَلَنِي الْحِجْرَ فَقَالَ ‏\n\"‏ صَلِّي فِي الْحِجْرِ إِنْ أَرَدْتِ دُخُولَ الْبَيْتِ فَإِنَّمَا هُوَ قِطْعَةٌ مِنَ الْبَيْتِ وَلَكِنَّ قَوْمَكِ اسْتَقْصَرُوهُ حِينَ بَنَوُا الْكَعْبَةَ فَأَخْرَجُوهُ مِنَ الْبَيْتِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَعَلْقَمَةُ بْنُ أَبِي عَلْقَمَةَ هُوَ عَلْقَمَةُ بْنُ بِلاَلٍ ‏.‏",
    "malay_translation": "Aku ingin masuk ke dalam Kaabah untuk menunaikan solat di dalamnya. Maka Rasulullah SAW memegang tanganku dan memasukkan aku ke dalam Hijr, lalu baginda bersabda: \"Solatlah di Hijr jika engkau ingin masuk ke dalam Kaabah. Sesungguhnya ia adalah sebahagian daripada Kaabah, tetapi kaummu telah menganggapnya remeh ketika mereka membina Kaabah, lalu mereka meletakkannya di luar Kaabah.\" "
  },
  {
    "id": 26658,
    "hadith_number": 878,
    "tajuk_hadith": "Hajar Aswad: Keaslian dan Perubahan Warna",
    "perawi_melayu": "Ibn Abbas meriwayatkan bahawa:",
    "english_text": "The Messenger of Allah said: \"The Black Stone descended from the Paradise, and it was more white than milk, then it was blackened by the sins of the children of Adam.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرٌ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ نَزَلَ الْحَجَرُ الأَسْوَدُ مِنَ الْجَنَّةِ وَهُوَ أَشَدُّ بَيَاضًا مِنَ اللَّبَنِ فَسَوَّدَتْهُ خَطَايَا بَنِي آدَمَ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو وَأَبِي هُرَيْرَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Hajar Aswad turun dari syurga. Pada asalnya ia lebih putih daripada susu, kemudian ia menjadi hitam disebabkan dosa-dosa bani Adam.\""
  },
  {
    "id": 26659,
    "hadith_number": 879,
    "tajuk_hadith": "Cahaya Rukun dan Maqam di Baitullah",
    "perawi_melayu": "Abdullah bin Amr meriwayatkan bahawa:",
    "english_text": "He heard the Messenger of Allah saying: \"Indeed the Corner and the Maqam are two corundums from the corundum of Paradise. Allah removed their lights, and if their lights had not been removed then they would illuminate what is between east and the west.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ رَجَاءٍ أَبِي يَحْيَى، قَالَ سَمِعْتُ مُسَافِعًا الْحَاجِبَ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرٍو، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ الرُّكْنَ وَالْمَقَامَ يَاقُوتَتَانِ مِنْ يَاقُوتِ الْجَنَّةِ طَمَسَ اللَّهُ نُورَهُمَا وَلَوْ لَمْ يَطْمِسْ نُورَهُمَا لأَضَاءَتَا مَا بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا يُرْوَى عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو مَوْقُوفًا قَوْلُهُ ‏.‏ وَفِيهِ عَنْ أَنَسٍ أَيْضًا وَهُوَ حَدِيثٌ غَرِيبٌ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda: \"Sesungguhnya Rukun dan Maqam Ibrahim adalah dua batu yakut daripada yakut syurga. Allah telah memadamkan cahaya keduanya. Sekiranya cahaya keduanya tidak dipadamkan, nescaya ia akan menerangi seluruh kawasan antara timur dan barat.\""
  },
  {
    "id": 26660,
    "hadith_number": 880,
    "tajuk_hadith": "Solat Nabi SAW di Mina Semasa Haji",
    "perawi_melayu": "Ata meriwayatkan bahawa Ibnu Abbas meriwayatkan:",
    "english_text": "\"The Messenger of Allah led us in Salat at Mina for Zuhr, Asr, Maghrib, Isha, and Fajr, then he left in the morning to Arafat.\"",
    "arabic_text": "حَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الأَجْلَحِ، عَنْ إِسْمَاعِيلَ بْنِ مُسْلِمٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِمِنًى الظُّهْرَ وَالْعَصْرَ وَالْمَغْرِبَ وَالْعِشَاءَ وَالْفَجْرَ ثُمَّ غَدَا إِلَى عَرَفَاتٍ ‏.‏ قَالَ أَبُو عِيسَى وَإِسْمَاعِيلُ بْنُ مُسْلِمٍ قَدْ تَكَلَّمُوا فِيهِ مِنْ قِبَلِ حِفْظِهِ ‏.‏",
    "malay_translation": "Rasulullah SAW telah mengetuai solat Zuhur, Asar, Maghrib, Isyak dan Subuh bersama kami di Mina, kemudian baginda berangkat ke Arafah pada pagi harinya."
  },
  {
    "id": 26661,
    "hadith_number": 881,
    "tajuk_hadith": "Solat Zuhur dan Fajr di Mina",
    "perawi_melayu": "Al-Hakam meriwayatkan daripada Miqsam, bahawa Ibn Abbas meriwayatkan:",
    "english_text": "That the Prophet prayed Zuhr and Fajr in Mina, then he left in the morning to Arafat.",
    "arabic_text": "حَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الأَجْلَحِ، عَنِ الأَعْمَشِ، عَنِ الْحَكَمِ، عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى بِمِنًى الظُّهْرَ وَالْفَجْرَ ثُمَّ غَدَا إِلَى عَرَفَاتٍ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ وَأَنَسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ مِقْسَمٍ عَنِ ابْنِ عَبَّاسٍ قَالَ عَلِيُّ بْنُ الْمَدِينِيِّ قَالَ يَحْيَى قَالَ شُعْبَةُ لَمْ يَسْمَعِ الْحَكَمُ مِنْ مِقْسَمٍ إِلاَّ خَمْسَةَ أَشْيَاءَ ‏.‏ وَعَدَّهَا وَلَيْسَ هَذَا الْحَدِيثُ فِيمَا عَدَّ شُعْبَةُ ‏.‏",
    "malay_translation": "Daripada Abu Said al-Asyaj, yang meriwayatkan daripada Abdullah bin al-Ajlah, daripada al-A’masy, daripada al-Hakam, daripada Miqsam, daripada Ibnu Abbas, bahawa Nabi SAW telah menunaikan solat Zuhur dan Fajr di Mina, kemudian baginda berangkat ke Arafah pada waktu pagi.  Di dalam bab ini juga terdapat riwayat daripada Abdullah bin Zubair dan Anas. Abu Isa berkata: Riwayat Miqsam daripada Ibnu Abbas. Ali bin al-Madini berkata: Yahya berkata: Syu’bah berkata: Al-Hakam hanya mendengar lima perkara sahaja daripada Miqsam.  Dan beliau telah menghuraikannya, dan hadis ini bukanlah di antara lima perkara yang dihuraikan oleh Syu’bah."
  },
  {
    "id": 26662,
    "hadith_number": 882,
    "tajuk_hadith": "Mina Sebagai Tempat Rehat",
    "perawi_melayu": "Aisyah berkata:",
    "english_text": "\"We said: 'O Messenger of Allah! Shall we build a structure to shade you at Mina? He said: 'No., Mina is a resting place for whoever arrives.'\"",
    "arabic_text": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى، وَمُحَمَّدُ بْنُ أَبَانَ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ إِسْرَائِيلَ، عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ، عَنْ يُوسُفَ بْنِ مَاهَكَ، عَنْ أُمِّهِ، مُسَيْكَةَ عَنْ عَائِشَةَ، قَالَتْ قُلْنَا يَا رَسُولَ اللَّهِ أَلاَ نَبْنِي لَكَ بَيْتًا يُظِلُّكَ بِمِنًى قَالَ ‏\n\"‏ لاَ مِنًى مُنَاخُ مَنْ سَبَقَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏",
    "malay_translation": "Kami berkata, \"Wahai Rasulullah, patutkah kami membina sebuah bangunan untuk memayungi Baginda di Mina?\" Baginda menjawab, \"Tidak. Mina adalah tempat berehat bagi sesiapa yang datang.\" "
  },
  {
    "id": 26663,
    "hadith_number": 883,
    "tajuk_hadith": "Solat Dua Rakaat di Mina",
    "perawi_melayu": "Harithah bin Wahb berkata:",
    "english_text": "\"I prayed two Rak'ah with the Prophet at Mina, and the people were as secure as they ever were, and even more so.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، عَنْ حَارِثَةَ بْنِ وَهْبٍ، قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم بِمِنًى آمَنَ مَا كَانَ النَّاسُ وَأَكْثَرَهُ رَكْعَتَيْنِ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ مَسْعُودٍ وَابْنِ عُمَرَ وَأَنَسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ حَارِثَةَ بْنِ وَهْبٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَرُوِيَ عَنِ ابْنِ مَسْعُودٍ أَنَّهُ قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم بِمِنًى رَكْعَتَيْنِ وَمَعَ أَبِي بَكْرٍ وَمَعَ عُمَرَ وَمَعَ عُثْمَانَ رَكْعَتَيْنِ صَدْرًا مِنْ إِمَارَتِهِ ‏.‏ وَقَدِ اخْتَلَفَ أَهْلُ الْعِلْمِ فِي تَقْصِيرِ الصَّلاَةِ بِمِنًى لأَهْلِ مَكَّةَ فَقَالَ بَعْضُ أَهْلِ الْعِلْمِ لَيْسَ لأَهْلِ مَكَّةَ أَنْ يَقْصُرُوا الصَّلاَةَ بِمِنًى إِلاَّ مَنْ كَانَ بِمِنًى مُسَافِرًا ‏.‏ وَهُوَ قَوْلُ ابْنِ جُرَيْجٍ وَسُفْيَانَ الثَّوْرِيِّ وَيَحْيَى بْنِ سَعِيدٍ الْقَطَّانِ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏ وَقَالَ بَعْضُهُمْ لاَ بَأْسَ لأَهْلِ مَكَّةَ أَنْ يَقْصُرُوا الصَّلاَةَ بِمِنًى ‏.‏ وَهُوَ قَوْلُ الأَوْزَاعِيِّ وَمَالِكٍ وَسُفْيَانَ بْنِ عُيَيْنَةَ وَعَبْدِ الرَّحْمَنِ بْنِ مَهْدِيٍّ ‏.‏",
    "malay_translation": "Aku menunaikan solat dua rakaat bersama Nabi SAW di Mina, dan ketika itu, orang ramai berada dalam keadaan yang lebih aman daripada sebelum ini."
  },
  {
    "id": 26664,
    "hadith_number": 884,
    "tajuk_hadith": "Kekal Dengan Ibadah Haji: Warisan Ibrahim",
    "perawi_melayu": "Amr bin Dinar meriwayatkan daripada Amr bin Abdullah bin Safwan, bahawa Yazid bin Syiban berkata:",
    "english_text": "\"Ibn Mirba Al-Ansari came to us while we were standing at our places\" (Amr bin Sinar said:) a place that Amr (bin Abdullah) indicated was far - \"and he said: 'I am a messenger whom the Messenger of Allah sent to you to say: 'Stay with your (Hajj) rites, for indeed you are following a legacy left by Ibrahim.'\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عَمْرِو بْنِ عَبْدِ اللَّهِ بْنِ صَفْوَانَ، عَنْ يَزِيدَ بْنِ شَيْبَانَ، قَالَ أَتَانَا ابْنُ مِرْبَعٍ الأَنْصَارِيُّ وَنَحْنُ وُقُوفٌ بِالْمَوْقِفِ مَكَانًا يُبَاعِدُهُ عَمْرٌو - فَقَالَ إِنِّي رَسُولُ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَيْكُمْ يَقُولُ ‏\n\"‏ كُونُوا عَلَى مَشَاعِرِكُمْ فَإِنَّكُمْ عَلَى إِرْثٍ مِنْ إِرْثِ إِبْرَاهِيمَ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَلِيٍّ وَعَائِشَةَ وَجُبَيْرِ بْنِ مُطْعِمٍ وَالشَّرِيدِ بْنِ سُوَيْدٍ الثَّقَفِيِّ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ مِرْبَعٍ الأَنْصَارِيِّ حَدِيثٌ حَسَنٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ ابْنِ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ ‏.‏ وَابْنُ مِرْبَعٍ اسْمُهُ يَزِيدُ بْنُ مِرْبَعٍ الأَنْصَارِيُّ وَإِنَّمَا يُعْرَفُ لَهُ هَذَا الْحَدِيثُ الْوَاحِدُ ‏.‏",
    "malay_translation": "Ibnu Mirba Al-Ansari datang kepada kami ketika kami sedang berdiri di tempat kami (Amr bin Sinar berkata):  sebuah tempat yang ditunjukkan oleh Amr (bin Abdullah) agak jauh - dan dia berkata: 'Aku adalah utusan yang diutus oleh Rasulullah SAW kepada kamu untuk menyampaikan: 'Tetaplah dengan ibadat Haji kamu, sesungguhnya kamu berada di atas warisan daripada warisan Ibrahim.'"
  },
  {
    "id": 26665,
    "hadith_number": 885,
    "tajuk_hadith": "Tempat Berdiri di Muzdalifah dan Arafah",
    "perawi_melayu": "Aisyah meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى الصَّنْعَانِيُّ الْبَصْرِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الطُّفَاوِيُّ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَتْ قُرَيْشٌ وَمَنْ كَانَ عَلَى دِينِهَا وَهُمُ الْحُمْسُ يَقِفُونَ بِالْمُزْدَلِفَةِ يَقُولُونَ نَحْنُ قَطِينُ اللَّهِ ‏.‏ وَكَانَ مَنْ سِوَاهُمْ يَقِفُونَ بِعَرَفَةَ فَأَنْزَلَ اللَّهُ تَعَالَى ‏:‏ ‏(‏ثُمَّ أَفِيضُوا مِنْ حَيْثُ أَفَاضَ النَّاسُ ‏)‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ قَالَ وَمَعْنَى هَذَا الْحَدِيثِ أَنَّ أَهْلَ مَكَّةَ كَانُوا لاَ يَخْرُجُونَ مِنَ الْحَرَمِ وَعَرَفَةُ خَارِجٌ مِنَ الْحَرَمِ وَأَهْلُ مَكَّةَ كَانُوا يَقِفُونَ بِالْمُزْدَلِفَةِ وَيَقُولُونَ نَحْنُ قَطِينُ اللَّهِ يَعْنِي سُكَّانَ اللَّهِ وَمَنْ سِوَى أَهْلِ مَكَّةَ كَانُوا يَقِفُونَ بِعَرَفَاتٍ ‏.‏ فَأَنْزَلَ اللَّهُ تَعَالَى‏:‏ ‏(‏ثُمَّ أَفِيضُوا مِنْ حَيْثُ أَفَاضَ النَّاسُ ‏)‏ ‏.‏ وَالْحُمْسُ هُمْ أَهْلُ الْحَرَمِ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Abdil A'la Ash-Shan'ani Al-Bashri, telah menceritakan kepada kami Muhammad bin Abdur Rahman Ath-Thufawi, telah menceritakan kepada kami Hisyam bin Urwah, dari bapanya, dari Aisyah, dia berkata:  Kaum Quraisy dan orang-orang yang menganut agama mereka, iaitu Al-Hums,  berdiri di Muzdalifah dan berkata, \"Kami adalah umat Allah.\"  Manakala orang lain berdiri di Arafah. Maka Allah SWT menurunkan ayat:  \"Kemudian, beredarlah kamu dari tempat manusia beredar.\" Abu Isa berkata, \"Ini adalah hadis yang baik dan sahih.\" Maksud hadis ini ialah penduduk Mekah tidak keluar dari kawasan haram, dan Arafah terletak di luar kawasan haram. Penduduk Mekah berdiri di Muzdalifah dan berkata, \"Kami adalah umat Allah,\" yang bermaksud penduduk Allah.  Orang-orang selain penduduk Mekah berdiri di Arafah. Maka Allah SWT menurunkan ayat: \"Kemudian, beredarlah kamu dari tempat manusia beredar.\"  Al-Hums ialah penduduk kawasan haram."
  },
  {
    "id": 26666,
    "hadith_number": 886,
    "tajuk_hadith": "Hukum-hukum Haji di Arafah, Mina dan Makkah",
    "perawi_melayu": "Ali bin Abi Talib, semoga Allah merahmati beliau, meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ عَيَّاشِ بْنِ أَبِي رَبِيعَةَ، عَنْ زَيْدِ بْنِ عَلِيٍّ، عَنْ أَبِيهِ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، رضى الله عنه قَالَ وَقَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِعَرَفَةَ فَقَالَ ‏\"‏ هَذِهِ عَرَفَةُ وَهَذَا هُوَ الْمَوْقِفُ وَعَرَفَةُ كُلُّهَا مَوْقِفٌ ‏\"‏ ‏.‏ ثُمَّ أَفَاضَ حِينَ غَرَبَتِ الشَّمْسُ وَأَرْدَفَ أُسَامَةَ بْنَ زَيْدٍ وَجَعَلَ يُشِيرُ بِيَدِهِ عَلَى هَيْئَتِهِ وَالنَّاسُ يَضْرِبُونَ يَمِينًا وَشِمَالاً يَلْتَفِتُ إِلَيْهِمْ وَيَقُولُ ‏\"‏ يَا أَيُّهَا النَّاسُ عَلَيْكُمُ السَّكِينَةَ ‏\"‏ ‏.‏ ثُمَّ أَتَى جَمْعًا فَصَلَّى بِهِمُ الصَّلاَتَيْنِ جَمِيعًا فَلَمَّا أَصْبَحَ أَتَى قُزَحَ فَوَقَفَ عَلَيْهِ وَقَالَ ‏\"‏ هَذَا قُزَحُ وَهُوَ الْمَوْقِفُ وَجَمْعٌ كُلُّهَا مَوْقِفٌ ‏\"‏ ‏.‏ ثُمَّ أَفَاضَ حَتَّى انْتَهَى إِلَى وَادِي مُحَسِّرٍ فَقَرَعَ نَاقَتَهُ فَخَبَّتْ حَتَّى جَاوَزَ الْوَادِيَ فَوَقَفَ وَأَرْدَفَ الْفَضْلَ ثُمَّ أَتَى الْجَمْرَةَ فَرَمَاهَا ثُمَّ أَتَى الْمَنْحَرَ فَقَالَ ‏\"‏ هَذَا الْمَنْحَرُ وَمِنًى كُلُّهَا مَنْحَرٌ ‏\"‏ ‏.‏ وَاسْتَفْتَتْهُ جَارِيَةٌ شَابَّةٌ مِنْ خَثْعَمٍ فَقَالَتْ إِنَّ أَبِي شَيْخٌ كَبِيرٌ قَدْ أَدْرَكَتْهُ فَرِيضَةُ اللَّهِ فِي الْحَجِّ أَفَيُجْزِئُ أَنْ أَحُجَّ عَنْهُ قَالَ ‏\"‏ حُجِّي عَنْ أَبِيكِ ‏\"‏ ‏.‏ قَالَ وَلَوَى عُنُقَ الْفَضْلِ فَقَالَ الْعَبَّاسُ يَا رَسُولَ اللَّهِ لِمَ لَوَيْتَ عُنُقَ ابْنِ عَمِّكَ قَالَ ‏\"‏ رَأَيْتُ شَابًّا وَشَابَّةً فَلَمْ آمَنِ الشَّيْطَانَ عَلَيْهِمَا ‏\"‏ ‏.‏ ثُمَّ أَتَاهُ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَفَضْتُ قَبْلَ أَنْ أَحْلِقَ ‏.‏ قَالَ ‏\"‏ احْلِقْ أَوْ قَصِّرْ وَلاَ حَرَجَ ‏\"‏ ‏.‏ قَالَ وَجَاءَ آخَرُ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي ذَبَحْتُ قَبْلَ أَنْ أَرْمِيَ ‏.‏ قَالَ ‏\"‏ ارْمِ وَلاَ حَرَجَ ‏\"‏ ‏.‏ قَالَ ثُمَّ أَتَى الْبَيْتَ فَطَافَ بِهِ ثُمَّ أَتَى زَمْزَمَ فَقَالَ ‏\"‏ يَا بَنِي عَبْدِ الْمُطَّلِبِ لَوْلاَ أَنْ يَغْلِبَكُمُ النَّاسُ عَنْهُ لَنَزَعْتُ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ جَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَلِيٍّ حَدِيثٌ حَسَنٌ صَحِيحٌ لاَ نَعْرِفُهُ مِنْ حَدِيثِ عَلِيٍّ إِلاَّ مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ عَيَّاشٍ ‏.‏ وَقَدْ رَوَاهُ غَيْرُ وَاحِدٍ عَنِ الثَّوْرِيِّ مِثْلَ هَذَا ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ رَأَوْا أَنْ يُجْمَعَ بَيْنَ الظُّهْرِ وَالْعَصْرِ بِعَرَفَةَ فِي وَقْتِ الظُّهْرِ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ إِذَا صَلَّى الرَّجُلُ فِي رَحْلِهِ وَلَمْ يَشْهَدِ الصَّلاَةَ مَعَ الإِمَامِ إِنْ شَاءَ جَمَعَ هُوَ بَيْنَ الصَّلاَتَيْنِ مِثْلَ مَا صَنَعَ الإِمَامُ ‏.‏ قَالَ وَزَيْدُ بْنُ عَلِيٍّ هُوَ ابْنُ حُسَيْنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ عَلَيْهِ السَّلاَمُ ‏.‏",
    "malay_translation": "Rasulullah SAW berhenti di Arafah dan bersabda: \"Inilah Arafah dan inilah tempat wukuf.  Seluruh Arafah adalah tempat wukuf.\" Kemudian baginda berangkat ketika matahari terbenam dan membawa Usamah bin Zaid sebagai teman tunggangan. Baginda memberi isyarat dengan tangan seperti kebiasaan baginda, dan orang ramai memukul (unta mereka) di sebelah kanan dan kiri untuk cuba menangkap mereka. Maka baginda bersabda: \"Wahai orang ramai! Bertenanglah.\" Kemudian baginda sampai di Jam’ dan menunaikan dua solat di situ secara jamak.  Apabila pagi tiba, baginda pergi ke Kuzah dan berhenti di situ serta bersabda: \"Inilah Kuzah, dan inilah tempat wukuf, dan seluruh Jam’ adalah tempat wukuf.\" Kemudian baginda berangkat sehingga sampai ke Wadi Muhasshir. Kemudian baginda menaikkan untanya dan ia berlari sehingga melepasi lembah itu. Kemudian baginda berhenti dan membawa Al-Fadl sebagai teman tunggangan dan pergi ke Jamrah untuk melontarnya. Kemudian baginda pergi ke Al-Manhar dan bersabda: \"Inilah Al-Manhar, dan seluruh Mina adalah tempat penyembelihan.\" Seorang gadis muda dari Khath’am datang meminta fatwa baginda, katanya: \"Sesungguhnya ayah saya adalah seorang lelaki tua yang telah mencapai kewajipan haji, adakah dia akan mendapat pahala jika saya menunaikan haji untuknya?\" Baginda bersabda: \"Tunaikanlah haji untuk ayahmu.\" Baginda membetulkan leher Al-Fadl. Maka Abbas berkata: \"Wahai Rasulullah! Mengapakah tuan membetulkan leher sepupu tuan?\" Baginda bersabda: \"Aku melihat seorang pemuda dan seorang gadis muda, dan aku tidak merasa selamat daripada gangguan syaitan terhadap mereka.\" Seorang lelaki datang kepada baginda dan berkata: \"Wahai Rasulullah! Saya telah melakukan tawaf ifadah sebelum bercukur.\" Baginda bersabda: \"Bercukurlah, dan tiada apa yang salah.\" atau: \"Gunting rambut dan tiada apa yang salah.\"  Seseorang yang lain datang dan berkata: \"Wahai Rasulullah! Saya telah menyembelih korban sebelum melontar jamrah.\" Maka baginda bersabda: \"Lontarkanlah, dan tiada apa yang salah.\" Kemudian baginda pergi ke Baitullah untuk melakukan tawaf, kemudian baginda pergi ke Zamzam dan bersabda: \"Wahai Bani Abdul Muttalib! Sekiranya bukan kerana bimbang orang ramai akan berebut, nescaya aku akan memindahkannya.\""
  },
  {
    "id": 26667,
    "hadith_number": 887,
    "tajuk_hadith": "Perjalanan Nabi SAW di Wadi Muhassir",
    "perawi_melayu": "Jabir meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا وَكِيعٌ، وَبِشْرُ بْنُ السَّرِيِّ، وَأَبُو نُعَيْمٍ قَالُوا حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَوْضَعَ فِي وَادِي مُحَسِّرٍ ‏.‏ وَزَادَ فِيهِ بِشْرٌ وَأَفَاضَ مِنْ جَمْعٍ وَعَلَيْهِ السَّكِينَةُ وَأَمَرَهُمْ بِالسَّكِينَةِ ‏.‏ وَزَادَ فِيهِ أَبُو نُعَيْمٍ وَأَمَرَهُمْ أَنْ يَرْمُوا بِمِثْلِ حَصَى الْخَذْفِ وَقَالَ ‏\n\"‏ لَعَلِّي لاَ أَرَاكُمْ بَعْدَ عَامِي هَذَا ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أُسَامَةَ بْنِ زَيْدٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ جَابِرٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Kami diberitakan oleh Mahmud bin Ghailan, yang diberitakan kepadanya oleh Waki', dan Bishr bin Sari', dan Abu Nu'aim, mereka berkata: Kami diberitakan oleh Sufyan, daripada Abi Az-Zubair, daripada Jabir, bahawa Nabi SAW telah melalui Wadi Muhassir. Dan Bishr menambah: Beliau berangkat dari tempat berkumpul dengan tenang dan memerintahkan mereka (manusia) supaya tenang. Dan Abu Nu'aim menambah: Dan Baginda memerintahkan mereka supaya melontar dengan batu-batu yang serupa dengan kerikil untuk al-Khadhf. Dan Baginda bersabda: \"Mungkin aku tidak akan jumpa kamu lagi selepas tahunku ini.\"  Dikatakan, dan dalam bab ini daripada Usamah bin Zaid. Abu Isa berkata: Hadis Jabir ini adalah hadis yang baik dan sahih."
  },
  {
    "id": 26668,
    "hadith_number": 888,
    "tajuk_hadith": "Ibn Umar Menggabungkan Solat di Muzdalifah",
    "perawi_melayu": "Abdullah bin Malik meriwayatkan:",
    "english_text": "\"Ibn Umar prayed at Jam (Muzdalifah), so he combined two prayers with the Iqamah, and he said: 'I saw the Messenger of Allah doing the same as this at the place.'\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَبْدِ اللَّهِ بْنِ مَالِكٍ، أَنَّ ابْنَ عُمَرَ، صَلَّى بِجَمْعٍ فَجَمَعَ بَيْنَ الصَّلاَتَيْنِ بِإِقَامَةٍ وَقَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَعَلَ مِثْلَ هَذَا فِي هَذَا الْمَكَانِ ‏.‏",
    "malay_translation": "Ibn Umar menunaikan solat jamak di Muzdalifah, iaitu menggabungkan dua solat dengan satu azan iqamah. Baginda berkata, \"Saya telah melihat Rasulullah ﷺ melakukan perkara yang sama di tempat ini.\""
  },
  {
    "id": 26669,
    "hadith_number": 889,
    "tajuk_hadith": "Riwayat Tentang Solat Maghrib dan Isyak di Muzdalifah",
    "perawi_melayu": "(Sanad lain) yang diriwayatkan oleh Said bin Jubair:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ أَبِي إِسْحَاقَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏ قَالَ مُحَمَّدُ بْنُ بَشَّارٍ قَالَ يَحْيَى وَالصَّوَابُ حَدِيثُ سُفْيَانَ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَلِيٍّ وَأَبِي أَيُّوبَ وَعَبْدِ اللَّهِ بْنِ مَسْعُودٍ وَجَابِرٍ وَأُسَامَةَ بْنِ زَيْدٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ فِي رِوَايَةِ سُفْيَانَ أَصَحُّ مِنْ رِوَايَةِ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ وَحَدِيثُ سُفْيَانَ حَدِيثٌ صَحِيحٌ حَسَنٌ ‏.‏ قَالَ أَبُو عِيسَى وَرَوَى إِسْرَائِيلُ هَذَا الْحَدِيثَ عَنْ أَبِي إِسْحَاقَ عَنْ عَبْدِ اللَّهِ وَخَالِدٍ ابْنَىْ مَالِكٍ عَنِ ابْنِ عُمَرَ ‏.‏ وَحَدِيثُ سَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عُمَرَ هُوَ حَدِيثٌ حَسَنٌ صَحِيحٌ أَيْضًا رَوَاهُ سَلَمَةُ بْنُ كُهَيْلٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ ‏.‏ وَأَمَّا أَبُو إِسْحَاقَ فَرَوَاهُ عَنْ عَبْدِ اللَّهِ وَخَالِدٍ ابْنَىْ مَالِكٍ عَنِ ابْنِ عُمَرَ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ لأَنَّهُ لاَ تُصَلَّى صَلاَةُ الْمَغْرِبِ دُونَ جَمْعٍ فَإِذَا أَتَى جَمْعًا وَهُوَ الْمُزْدَلِفَةُ جَمَعَ بَيْنَ الصَّلاَتَيْنِ بِإِقَامَةٍ وَاحِدَةٍ وَلَمْ يَتَطَوَّعْ فِيمَا بَيْنَهُمَا وَهُوَ الَّذِي اخْتَارَهُ بَعْضُ أَهْلِ الْعِلْمِ وَذَهَبَ إِلَيْهِ ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ ‏.‏ قَالَ سُفْيَانُ وَإِنْ شَاءَ صَلَّى الْمَغْرِبَ ثُمَّ تَعَشَّى وَوَضَعَ ثِيَابَهُ ثُمَّ أَقَامَ فَصَلَّى الْعِشَاءَ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ يَجْمَعُ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ بِالْمُزْدَلِفَةِ بِأَذَانٍ وَإِقَامَتَيْنِ يُؤَذِّنُ لِصَلاَةِ الْمَغْرِبِ وَيُقِيمُ وَيُصَلِّي الْمَغْرِبَ ثُمَّ يُقِيمُ وَيُصَلِّي الْعِشَاءَ ‏.‏ وَهُوَ قَوْلُ الشَّافِعِيِّ ‏.‏ \nقَالَ أَبُو عِيسَى وَرَوَى إِسْرَائِيلُ هَذَا الْحَدِيثَ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ اللَّهِ وَخَالِدٍ ابْنَيْ مَالِكٍ عَنْ ابْنِ عُمَرَ وَحَدِيثُ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عُمَرَ هُوَ حَدِيثٌ حَسَنٌ صَحِيحٌ أَيْضًا رَوَاهُ سَلَمَةُ بْنُ كُهَيْلٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ وَأَمَّا أَبُو إِسْحَقَ فَرَوَاهُ عَنْ عَبْدِ اللَّهِ وَخَالِدٍ ابْنَيْ مَالِكٍ عَنْ ابْنِ عُمَرَ.",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Basysyar, telah menceritakan kepada kami Yahya bin Saeed, dari Isma'il bin Abi Khalid, dari Abu Ishaq, dari Saeed bin Jubair, dari Ibnu Umar, dari Nabi ﷺ seumpamanya.  Muhammad bin Basysyar berkata, Yahya berkata, dan yang tepat ialah hadis Sufyan.  Dia berkata, dan dalam bab ini dari Ali, dan Abu Ayyub, dan Abdullah bin Mas'ud, dan Jabir, dan Usamah bin Zaid. Abu Isa berkata, hadis Ibnu Umar dalam riwayat Sufyan lebih sahih daripada riwayat Isma'il bin Abi Khalid, dan hadis Sufyan adalah hadis yang sahih dan hasan. Abu Isa berkata, dan Isra'il meriwayatkan hadis ini dari Abu Ishaq dari Abdullah dan Khalid anak-anak Malik dari Ibnu Umar. Dan hadis Saeed bin Jubair dari Ibnu Umar adalah hadis yang hasan dan sahih juga, diriwayatkan oleh Salamah bin Kuhil dari Saeed bin Jubair. Adapun Abu Ishaq, dia meriwayatkannya dari Abdullah dan Khalid anak-anak Malik dari Ibnu Umar. Amalan berdasarkan ini di kalangan ulama kerana solat Maghrib tidak disolatkan tanpa digabung, maka apabila sampai masa penggabungan iaitu di Muzdalifah, maka digabung kedua-dua solat dengan satu iqamat dan tidak sunat di antara keduanya. Ini adalah pilihan sebahagian ulama dan mereka berpegang kepadanya.  Ini adalah pendapat Sufyan Tsauri. Sufyan berkata, dan jika dia mahu, dia solatkan Maghrib, kemudian makan malam, dan meletakkan pakaiannya, kemudian iqamat dan solatkan Isyak.  Dan sebahagian ulama berkata, digabung antara Maghrib dan Isyak di Muzdalifah dengan dua azan dan dua iqamat.  Mendirikan azan untuk solat Maghrib, kemudian iqamat dan solatkan Maghrib, kemudian iqamat dan solatkan Isyak. Ini adalah pendapat Syafie."
  },
  {
    "id": 26670,
    "hadith_number": 890,
    "tajuk_hadith": "Haji di Arafah dan Hari-hari di Mina",
    "perawi_melayu": "Abd al-Rahman bin Ya'mar meriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالاَ حَدَّثَنَا سُفْيَانُ، عَنْ بُكَيْرِ بْنِ عَطَاءٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَعْمَرَ، أَنَّ نَاسًا، مِنْ أَهْلِ نَجْدٍ أَتَوْا رَسُولَ اللَّهِ صلى الله عليه وسلم وَهُوَ بِعَرَفَةَ فَسَأَلُوهُ فَأَمَرَ مُنَادِيًا فَنَادَى ‏\n\"‏ الْحَجُّ عَرَفَةُ مَنْ جَاءَ لَيْلَةَ جَمْعٍ قَبْلَ طُلُوعِ الْفَجْرِ فَقَدْ أَدْرَكَ الْحَجَّ أَيَّامُ مِنًى ثَلاَثَةٌ فَمَنْ تَعَجَّلَ فِي يَوْمَيْنِ فَلاَ إِثْمَ عَلَيْهِ وَمَنْ تَأَخَّرَ فَلاَ إِثْمَ عَلَيْهِ ‏\"‏ ‏.‏ قَالَ مُحَمَّدٌ وَزَادَ يَحْيَى وَأَرْدَفَ رَجُلاً فَنَادَى.",
    "malay_translation": "Muhammad bin Basar telah meriwayatkan kepada kami, Yahya bin Said dan Abd al-Rahman bin Mahdi berkata: Sufian telah meriwayatkan kepada kami daripada Bukhair bin Ata, daripada Abd al-Rahman bin Ya'mar, bahawa segolongan manusia dari penduduk Najd telah datang kepada Rasulullah SAW ketika baginda berada di Arafah. Mereka bertanya kepada baginda, lalu baginda memerintahkan seorang penyeru untuk menyeru: \"Haji ialah Arafah. Sesiapa yang datang pada malam tasyrik sebelum terbit fajar, maka sesungguhnya dia telah sampai kepada haji. Hari-hari di Mina ialah tiga hari, maka sesiapa yang menyegerakan (pergi selepas) dua hari, maka tidak ada dosa ke atasnya, dan sesiapa yang menangguhkan, maka tidak ada dosa ke atasnya.\" Muhammad berkata: Yahya menambah, \"dan dia menunggang bersama seorang lagi untuk menyeru.\""
  },
  {
    "id": 26671,
    "hadith_number": 891,
    "tajuk_hadith": "Keutamaan Berada di Arafah Sebelum Subuh",
    "perawi_melayu": "Abd al-Rahman bin Ya'mar meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ سُفْيَانَ الثَّوْرِيِّ، عَنْ بُكَيْرِ بْنِ عَطَاءٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَعْمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ بِمَعْنَاهُ ‏.‏ وَقَالَ ابْنُ أَبِي عُمَرَ قَالَ سُفْيَانُ بْنُ عُيَيْنَةَ وَهَذَا أَجْوَدُ حَدِيثٍ رَوَاهُ سُفْيَانُ الثَّوْرِيُّ ‏.‏ قَالَ أَبُو عِيسَى وَالْعَمَلُ عَلَى حَدِيثِ عَبْدِ الرَّحْمَنِ بْنِ يَعْمَرَ عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ أَنَّهُ مَنْ لَمْ يَقِفْ بِعَرَفَاتٍ قَبْلَ طُلُوعِ الْفَجْرِ فَقَدْ فَاتَهُ الْحَجُّ وَلاَ يُجْزِئُ عَنْهُ إِنْ جَاءَ بَعْدَ طُلُوعِ الْفَجْرِ وَيَجْعَلُهَا عُمْرَةً وَعَلَيْهِ الْحَجُّ مِنْ قَابِلٍ ‏.‏ وَهُوَ قَوْلُ الثَّوْرِيِّ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏ قَالَ أَبُو عِيسَى وَقَدْ رَوَى شُعْبَةُ عَنْ بُكَيْرِ بْنِ عَطَاءٍ نَحْوَ حَدِيثِ الثَّوْرِيِّ ‏.‏ قَالَ وَسَمِعْتُ الْجَارُودَ يَقُولُ سَمِعْتُ وَكِيعًا أَنَّهُ ذَكَرَ هَذَا الْحَدِيثَ فَقَالَ هَذَا الْحَدِيثُ أُمُّ الْمَنَاسِكِ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ibn Abi Umar, telah menceritakan kepada kami Sufyan bin Uyainah, daripada Sufyan al-Tsauri, daripada Bukhair bin Ata, daripada Abd al-Rahman bin Ya'mar, daripada Nabi SAW, lebih kurang dengan maksud yang sama. Dan Ibn Abi Umar berkata, Sufyan bin Uyainah berkata, dan inilah hadis yang paling baik yang diriwayatkan oleh Sufyan al-Tsauri. Abu Isa berkata, amalan berdasarkan hadis Abd al-Rahman bin Ya'mar di kalangan ahli ilmu daripada sahabat Nabi SAW dan selain mereka ialah, sesiapa yang tidak berada di Arafah sebelum terbit fajar, maka dia telah kehilangan haji dan ia tidak memadai baginya jika dia datang selepas terbit fajar, dan ia dianggap umrah dan dia wajib menunaikan haji pada masa akan datang. Dan itulah pendapat al-Tsauri, al-Syafie, Ahmad dan Ishak. Abu Isa berkata, dan telah meriwayatkan Syu'bah daripada Bukhair bin Ata, lebih kurang seperti hadis al-Tsauri. Beliau berkata, dan aku telah mendengar al-Jarud berkata, aku telah mendengar Waki' berkata bahawa dia telah menyebut hadis ini, lalu berkata, hadis ini adalah induk kepada semua manasik."
  },
  {
    "id": 26672,
    "hadith_number": 892,
    "tajuk_hadith": "Menunaikan Haji: Solat di Muzdalifah",
    "perawi_melayu": "Urwah bin Mudarris bin Aws bin Harithah bin Lam At-Ta'i meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ، وَإِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، وَزَكَرِيَّا بْنِ أَبِي زَائِدَةَ، عَنِ الشَّعْبِيِّ، عَنْ عُرْوَةَ بْنِ مُضَرِّسِ بْنِ أَوْسِ بْنِ حَارِثَةَ بْنِ لاَمٍ الطَّائِيِّ، قَالَ أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم بِالْمُزْدَلِفَةِ حِينَ خَرَجَ إِلَى الصَّلاَةِ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي جِئْتُ مِنْ جَبَلَىْ طَيِّئٍ أَكْلَلْتُ رَاحِلَتِي وَأَتْعَبْتُ نَفْسِي وَاللَّهِ مَا تَرَكْتُ مِنْ حَبْلٍ إِلاَّ وَقَفْتُ عَلَيْهِ فَهَلْ لِي مِنْ حَجٍّ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ شَهِدَ صَلاَتَنَا هَذِهِ وَوَقَفَ مَعَنَا حَتَّى نَدْفَعَ وَقَدْ وَقَفَ بِعَرَفَةَ قَبْلَ ذَلِكَ لَيْلاً أَوْ نَهَارًا فَقَدْ أَتَمَّ حَجَّهُ وَقَضَى تَفَثَهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ قَالَ قَوْلُهُ ‏\"‏ تَفَثَهُ ‏\"‏ ‏.‏ يَعْنِي نُسُكَهُ ‏.‏ قَوْلُهُ ‏\"‏ مَا تَرَكْتُ مِنْ حَبْلٍ إِلاَّ وَقَفْتُ عَلَيْهِ ‏\"‏ ‏.‏ إِذَا كَانَ مِنْ رَمْلٍ يُقَالُ لَهُ حَبْلٌ وَإِذَا كَانَ مِنْ حِجَارَةٍ يُقَالُ لَهُ جَبَلٌ ‏.‏",
    "malay_translation": "Aku datang kepada Rasulullah ﷺ di Muzdalifah ketika baginda keluar untuk solat. Aku berkata, \"Wahai Rasulullah! Aku datang dari dua gunung kaum Tai, aku telah meletihkan tungganganku dan aku telah memenatkan diriku. Demi Allah! Aku tidak meninggalkan sebarang hablah (bukit pasir) tanpa berhenti di atasnya. Maka adakah haji bagiku?\" Rasulullah ﷺ bersabda, \"Barangsiapa yang menyaksikan solat kami ini dan berhenti bersama kami sehingga kami berangkat, dan telah berhenti di Arafah sebelum itu pada waktu malam atau siang hari, maka sesungguhnya dia telah sempurnakan hajinya dan telah menunaikan ibadatnya.\" Abu Isa berkata, \"Hadis ini adalah hadis yang baik dan sahih.\" Beliau berkata, maksud perkataan \"Tafath-nya\" ialah ibadatnya. Maksud perkataan \"Aku tidak meninggalkan sebarang hablah tanpa berhenti di atasnya\" ialah jika ia daripada pasir, ia disebut hablah, dan jika ia daripada batu, ia disebut jabal."
  },
  {
    "id": 26673,
    "hadith_number": 893,
    "tajuk_hadith": "Rasulullah Mengutus Ibnu Abbas Pada Waktu Malam",
    "perawi_melayu": "Ibnu Abbas meriwayatkan:",
    "english_text": "\"The Messenger of Allah sent me with the Thaqal (load of baggage) during the night from Jam.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ثَقَلٍ مِنْ جَمْعٍ بِلَيْلٍ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَائِشَةَ وَأُمِّ حَبِيبَةَ وَأَسْمَاءَ بِنْتِ أَبِي بَكْرٍ وَالْفَضْلِ بْنِ عَبَّاسٍ.",
    "malay_translation": "Ibnu Abbas meriwayatkan: \"Rasulullah SAW telah mengutus aku dengan beban (barang-barang) pada waktu malam dari Jam.\"  (Riwayat ini juga terdapat dalam bab yang sama daripada Aisyah, Ummu Habibah, Asma' binti Abu Bakar dan al-Fadl bin Abbas)."
  },
  {
    "id": 26674,
    "hadith_number": 894,
    "tajuk_hadith": "Mentawarkan Kemudahan Kepada Orang Lemah Semasa Melontar Jamrah",
    "perawi_melayu": "Daripada Ibnu Abbas r.a.",
    "english_text": "\"The Prophet advanced the weak among his family and he said: 'Do not stone the Jamrah until the sun has risen.'\"",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، عَنِ الْمَسْعُودِيِّ، عَنِ الْحَكَمِ، عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَدَّمَ ضَعَفَةَ أَهْلِهِ وَقَالَ ‏\n\"‏ لاَ تَرْمُوا الْجَمْرَةَ حَتَّى تَطْلُعَ الشَّمْسُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا الْحَدِيثِ عِنْدَ أَهْلِ الْعِلْمِ لَمْ يَرَوْا بَأْسًا أَنْ يَتَقَدَّمَ الضَّعَفَةُ مِنَ الْمُزْدَلِفَةِ بِلَيْلٍ يَصِيرُونَ إِلَى مِنًى ‏.‏ وَقَالَ أَكْثَرُ أَهْلِ الْعِلْمِ بِحَدِيثِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُمْ لاَ يَرْمُونَ حَتَّى تَطْلُعَ الشَّمْسُ ‏.‏ وَرَخَّصَ بَعْضُ أَهْلِ الْعِلْمِ فِي أَنْ يَرْمُوا بِلَيْلٍ ‏.‏ وَالْعَمَلُ عَلَى حَدِيثِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُمْ لاَ يَرْمُونَ ‏.‏ وَهُوَ قَوْلُ الثَّوْرِيِّ وَالشَّافِعِيِّ ‏.‏ \n‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ثَقَلٍ حَدِيثٌ صَحِيحٌ رُوِيَ عَنْهُ مِنْ غَيْرِ وَجْهٍ ‏.‏ وَرَوَى شُعْبَةُ هَذَا الْحَدِيثَ عَنْ مُشَاشٍ عَنْ عَطَاءٍ عَنِ ابْنِ عَبَّاسٍ عَنِ الْفَضْلِ بْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَدَّمَ ضَعَفَةَ أَهْلِهِ مِنْ جَمْعٍ بِلَيْلٍ ‏.‏ وَهَذَا حَدِيثٌ خَطَأٌ أَخْطَأَ فِيهِ مُشَاشٌ وَزَادَ فِيهِ عَنِ الْفَضْلِ بْنِ عَبَّاسٍ ‏.‏ وَرَوَى ابْنُ جُرَيْجٍ وَغَيْرُهُ هَذَا الْحَدِيثَ عَنْ عَطَاءٍ عَنِ ابْنِ عَبَّاسٍ ‏.‏ وَلَمْ يَذْكُرُوا فِيهِ عَنِ الْفَضْلِ بْنِ عَبَّاسٍ ‏.‏ وَمُشَاشٌ بَصْرِيٌّ رَوَى عَنْهُ شُعْبَةُ ‏.‏",
    "malay_translation": "Rasulullah SAW mendahulukan orang-orang yang lemah di kalangan keluarganya dan baginda bersabda:  \"Janganlah kamu lontar jamrah sehingga matahari terbit.\""
  },
  {
    "id": 26675,
    "hadith_number": 895,
    "tajuk_hadith": "Waktu Melontar Jumrah pada Hari Raya Aidiladha",
    "perawi_melayu": "Jabir meriwayatkan:",
    "english_text": "\"The Prophet would stone on the Day of An-Nahr during the morning light, as for (the days) afterwards, then (he would do it) after the Zenith of the sun.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَرْمِي يَوْمَ النَّحْرِ ضُحًى وَأَمَّا بَعْدَ ذَلِكَ فَبَعْدَ زَوَالِ الشَّمْسِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا الْحَدِيثِ عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ أَنَّهُ لاَ يَرْمِي بَعْدَ يَوْمِ النَّحْرِ إِلاَّ بَعْدَ الزَّوَالِ ‏.‏",
    "malay_translation": "Jabir meriwayatkan bahawa Nabi SAW akan melontar jumrah pada hari raya korban di waktu dhuha.  Manakala selepas hari itu, baginda akan melakukannya selepas matahari  tengah hari."
  },
  {
    "id": 26676,
    "hadith_number": 896,
    "tajuk_hadith": "Nabi SAW Berangkat Sebelum Matahari Terbit",
    "perawi_melayu": "Ibn Abbas meriwayatkan:",
    "english_text": "\"The Prophet departed before the rising of the sun.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنِ الأَعْمَشِ، عَنِ الْحَكَمِ، عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَفَاضَ قَبْلَ طُلُوعِ الشَّمْسِ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عُمَرَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَإِنَّمَا كَانَ أَهْلُ الْجَاهِلِيَّةِ يَنْتَظِرُونَ حَتَّى تَطْلُعَ الشَّمْسُ ثُمَّ يُفِيضُونَ ‏.‏",
    "malay_translation": "Daripada Ibnu Abbas r.a., bahawa Nabi SAW berangkat sebelum matahari terbit.  Abu Isa berkata:  Hadis daripada Ibnu Abbas ini adalah hadis yang baik dan sahih.  Orang-orang jahiliyyah menunggu sehingga matahari terbit, barulah mereka berangkat."
  },
  {
    "id": 26677,
    "hadith_number": 897,
    "tajuk_hadith": "Umar bin al-Khattab Mendahului Waktu Berangkat Dari Jam",
    "perawi_melayu": "Amr bin Maimun meriwayatkan:",
    "english_text": "\"We were halted at Jama when Umar bin Al-Khattab said: 'The idolaters would not depart until the sun had risen and they would say: \"Let the sun shine on Thabir\" and indeed the Messenger of Allah contradicted them.' So Umar departed before the rising of the sun.\"",
    "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا أَبُو دَاوُدَ، قَالَ أَنْبَأَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ عَمْرَو بْنَ مَيْمُونٍ، يُحَدِّثُ يَقُولُ كُنَّا وُقُوفًا بِجَمْعٍ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ إِنَّ الْمُشْرِكِينَ كَانُوا لاَ يُفِيضُونَ حَتَّى تَطْلُعَ الشَّمْسُ وَكَانُوا يَقُولُونَ أَشْرِقْ ثَبِيرُ ‏.‏ وَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَالَفَهُمْ ‏.‏ فَأَفَاضَ عُمَرُ قَبْلَ طُلُوعِ الشَّمْسِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Kami berhenti di Jam ketika Umar bin al-Khattab berkata: 'Orang-orang musyrik tidak akan berangkat sehingga matahari terbit dan mereka akan berkata: \"Hendaklah matahari menyinari Thabir.\" Dan sesungguhnya Rasulullah SAW telah menyelisihi mereka.' Maka Umar berangkat sebelum matahari terbit."
  },
  {
    "id": 26678,
    "hadith_number": 898,
    "tajuk_hadith": "Rasulullah SAW Membaling Jumrah",
    "perawi_melayu": "Jabir meriwayatkan:",
    "english_text": "\"I saw the Messenger of Allah stoning the Jimar with what was similar to pebbles for Al-Khadhaf.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَرْمِي الْجِمَارَ بِمِثْلِ حَصَى الْخَذْفِ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الأَحْوَصِ عَنْ أُمِّهِ وَهِيَ أُمُّ جُنْدُبٍ الأَزْدِيَّةُ وَابْنِ عَبَّاسٍ وَالْفَضْلِ بْنِ عَبَّاسٍ وَعَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ التَّيْمِيِّ وَعَبْدِ الرَّحْمَنِ بْنِ مُعَاذٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهُوَ الَّذِي اخْتَارَهُ أَهْلُ الْعِلْمِ أَنْ تَكُونَ الْجِمَارُ الَّتِي يُرْمَى بِهَا مِثْلَ حَصَى الْخَذْفِ ‏.‏",
    "malay_translation": "Jabir berkata: Aku melihat Rasulullah SAW membaling jumrah dengan batu-batu yang serupa dengan batu-batu untuk al-Khadhaf.  (Hadis ini juga diriwayatkan daripada Sulaiman bin Amru bin al-Ahwas daripada ibunya, iaitu Umm Junnub al-Azdiyyah, dan daripada Ibnu Abbas, al-Fadl bin Abbas, Abdur Rahman bin Usman al-Taymi dan Abdur Rahman bin Mu'adz. Abu Isa berkata: Hadis ini adalah hadis yang baik dan sahih.  Ini juga adalah pilihan para ulama bahawa batu-batu yang digunakan untuk membaling jumrah adalah serupa dengan batu-batu untuk al-Khadhaf.)"
  },
  {
    "id": 26679,
    "hadith_number": 899,
    "tajuk_hadith": "Rasulullah SAW Memukul Jumrah Selepas Zohor",
    "perawi_melayu": "Ibn Abbas meriwayatkan:",
    "english_text": "\"The Messenger of Allah stoned the Jimar when the sun had passed the zenith.\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ الْبَصْرِيُّ، حَدَّثَنَا زِيَادُ بْنُ عَبْدِ اللَّهِ، عَنِ الْحَجَّاجِ، عَنِ الْحَكَمِ، عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَرْمِي الْجِمَارَ إِذَا زَالَتِ الشَّمْسُ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Abdat Ad-Dabbi Al-Basri, telah menceritakan kepada kami Ziyad bin Abdullah, dari Al-Hajjaj, dari Al-Hakam, dari Miqsam, dari Ibnu Abbas, dia berkata: Rasulullah SAW  melempar jumrah apabila matahari telah melewati tengah hari. Abu Isa berkata: Hadis ini adalah hadis yang baik."
  },
  {
    "id": 26680,
    "hadith_number": 900,
    "tajuk_hadith": "Rasulullah SAW Membaling Jamrah Sambil Menunggang",
    "perawi_melayu": "Ibn Abbas meriwayatkan:",
    "english_text": "\"The Prophet stoned the Jamrah on the Day of An-Nahr while riding.\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ، أَخْبَرَنَا الْحَجَّاجُ، عَنِ الْحَكَمِ، عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم رَمَى الْجَمْرَةَ يَوْمَ النَّحْرِ رَاكِبًا ‏.‏ قَالَ وَفِي الْبَابِ عَنْ جَابِرٍ وَقُدَامَةَ بْنِ عَبْدِ اللَّهِ وَأُمِّ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الأَحْوَصِ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ وَاخْتَارَ بَعْضُهُمْ أَنْ يَمْشِيَ إِلَى الْجِمَارِ ‏.‏ وَقَدْ رُوِيَ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ يَمْشِي إِلَى الْجِمَارِ ‏.‏ وَوَجْهُ هَذَا الْحَدِيثِ عِنْدَنَا أَنَّهُ رَكِبَ فِي بَعْضِ الأَيَّامِ لِيُقْتَدَى بِهِ فِي فِعْلِهِ وَكِلاَ الْحَدِيثَيْنِ مُسْتَعْمَلٌ عِنْدَ أَهْلِ الْعِلْمِ ‏.‏",
    "malay_translation": "Daripada Ahmad bin Mani', yang meriwayatkan daripada Yahya bin Zakaria bin Abi Zaidah, yang memberitakan kepada kami Al-Hajjaj, daripada Al-Hakam, daripada Miqsam, daripada Ibnu Abbas, bahawa Nabi SAW membaling jamrah pada hari Nahr sambil menunggang.  Di dalam bab ini juga terdapat riwayat daripada Jabir, Qudamah bin Abdullah dan Umm Sulaiman bin Amr bin Al-Ahwas. Abu Isa berkata: Hadis Ibnu Abbas ini adalah hadis yang hasan. Amalan berdasarkan hadis ini diamalkan oleh sebahagian ulama, dan sebahagian yang lain memilih untuk berjalan kaki ke jamrah.  Daripada Ibnu Umar juga diriwayatkan bahawa Nabi SAW berjalan kaki ke jamrah. Pendapat kami terhadap hadis ini ialah baginda menunggang pada hari-hari tertentu untuk dijadikan contoh, dan kedua-dua hadis ini digunakan oleh para ulama."
  },
  {
    "id": 26681,
    "hadith_number": 901,
    "tajuk_hadith": "Baginda SAW Berjalan Kaki Semasa Memukul Jamrah",
    "perawi_melayu": "Daripada Ibnu Umar meriwayatkan:",
    "english_text": "\"The Prophet would walk when stoning the Jimar, both going and returning.\"",
    "arabic_text": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى، حَدَّثَنَا ابْنُ نُمَيْرٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا رَمَى الْجِمَارَ مَشَى إِلَيْهَا ذَاهِبًا وَرَاجِعًا ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رَوَاهُ بَعْضُهُمْ عَنْ عُبَيْدِ اللَّهِ وَلَمْ يَرْفَعْهُ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ وَقَالَ بَعْضُهُمْ يَرْكَبُ يَوْمَ النَّحْرِ وَيَمْشِي فِي الأَيَّامِ الَّتِي بَعْدَ يَوْمَ النَّحْرِ ‏.‏ قَالَ أَبُو عِيسَى وَكَأَنَّ مَنْ قَالَ هَذَا إِنَّمَا أَرَادَ اتِّبَاعَ النَّبِيِّ صلى الله عليه وسلم فِي فِعْلِهِ لأَنَّهُ إِنَّمَا رُوِيَ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ رَكِبَ يَوْمَ النَّحْرِ حَيْثُ ذَهَبَ يَرْمِي الْجِمَارَ وَلاَ يَرْمِي يَوْمَ النَّحْرِ إِلاَّ جَمْرَةَ الْعَقَبَةِ ‏.‏",
    "malay_translation": "Daripada Ibnu Umar, bahawa Nabi SAW apabila melempar jamrah, Baginda berjalan kaki ke sana dan kembali.  Abu Isa berkata: “Hadis ini adalah hadis yang baik dan sahih.” Sebahagian daripada mereka meriwayatkan daripada Ubaidullah tanpa mensandarkannya kepada Nabi.  Amalan ini diamalkan oleh kebanyakan ulama.  Ada sebahagian yang mengatakan Baginda menunggang pada hari korban dan berjalan kaki pada hari-hari selepasnya.  Abu Isa berkata: “Seolah-olah orang yang mengatakan demikian bermaksud untuk mengikut perbuatan Nabi SAW, kerana yang diriwayatkan daripada Nabi SAW ialah Baginda menunggang pada hari korban ketika Baginda pergi untuk melempar jamrah, dan Baginda hanya melempar jamrah al-Aqabah pada hari korban.”"
  },
  {
    "id": 26682,
    "hadith_number": 902,
    "tajuk_hadith": "Cara Melontar Jamrah Al-Aqabah",
    "perawi_melayu": "Abd al-Rahman bin Yazid meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الْمَسْعُودِيُّ، عَنْ جَامِعِ بْنِ شَدَّادٍ أَبِي صَخْرَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، قَالَ لَمَّا أَتَى عَبْدُ اللَّهِ جَمْرَةَ الْعَقَبَةِ اسْتَبْطَنَ الْوَادِيَ وَاسْتَقْبَلَ الْقِبْلَةَ وَجَعَلَ يَرْمِي الْجَمْرَةَ عَلَى حَاجِبِهِ الأَيْمَنِ ثُمَّ رَمَى بِسَبْعِ حَصَيَاتٍ يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ ثُمَّ قَالَ وَاللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ مِنْ هَا هُنَا رَمَى الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ ‏.‏ \nحَدَّثَنَا هَنَّادٌ، حَدَّثَنَا وَكِيعٌ، عَنِ الْمَسْعُودِيِّ، بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ الْفَضْلِ بْنِ عَبَّاسٍ وَابْنِ عَبَّاسٍ وَابْنِ عُمَرَ وَجَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ مَسْعُودٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ يَخْتَارُونَ أَنْ يَرْمِيَ الرَّجُلُ مِنْ بَطْنِ الْوَادِي بِسَبْعِ حَصَيَاتٍ يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ ‏.‏ وَقَدْ رَخَّصَ بَعْضُ أَهْلِ الْعِلْمِ إِنْ لَمْ يُمْكِنْهُ أَنْ يَرْمِيَ مِنْ بَطْنِ الْوَادِي رَمَى مِنْ حَيْثُ قَدَرَ عَلَيْهِ وَإِنْ لَمْ يَكُنْ فِي بَطْنِ الْوَادِي ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Yusuf bin Isa, telah menceritakan kepada kami Waki', telah menceritakan kepada kami Al-Mas'udi, dari Jama'ah bin Syaddad Abu Sakrah, dari Abd al-Rahman bin Yazid, dia berkata: \"Apabila Abdullah sampai ke Jamrah Al-Aqabah, dia berada di tengah-tengah lembah, menghadap kiblat dan mula melontar jamrah di bahagian dinding selatannya. Kemudian dia melontar dengan tujuh ketulan batu sambil bertakbir (mengucapkan Allahu Akbar) pada setiap lontaran. Kemudian dia berkata: Demi Allah SWT yang tiada Tuhan melainkan Dia, dari sini tempat orang yang kepadanya diturunkan Surah Al-Baqarah melontar.\"\nTelah menceritakan kepada kami Hannad, telah menceritakan kepada kami Waki', dari Al-Mas'udi, dengan sanad yang hampir sama.  Dia berkata: Dan dalam bab ini dari Al- Fadhl bin Abbas, Ibnu Abbas, Ibnu Umar dan Jabir.  Abu Isa berkata: Hadis Ibnu Mas'ud adalah hadis yang baik dan sahih. Amalan ini adalah amalan yang dipilih oleh para ulama, iaitu seorang lelaki itu melontar dari tengah lembah dengan tujuh ketulan batu sambil bertakbir pada setiap lontaran. Dan sesetengah ulama telah memberi keringanan, jika dia tidak mampu melontar dari tengah lembah, maka dia boleh melontar dari mana-mana sahaja yang dia mampu, walaupun tidak di tengah lembah."
  },
  {
    "id": 26683,
    "hadith_number": 903,
    "tajuk_hadith": "Tujuan Memukul Jumrah dan Saie",
    "perawi_melayu": "Aisyah meriwayatkan bahawa:",
    "english_text": "The Prophet said: \"Stoning the Jimari and Sa'i between As-Safa and Al-Marwah are only done for the establishment of Allah's remembrance.\"",
    "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، وَعَلِيُّ بْنُ خَشْرَمٍ، قَالاَ حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي زِيَادٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّمَا جُعِلَ رَمْىُ الْجِمَارِ وَالسَّعْىُ بَيْنَ الصَّفَا وَالْمَرْوَةِ لإِقَامَةِ ذِكْرِ اللَّهِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Meramai batu ke Jumrah dan Saie di antara Safa dan Marwah hanyalah untuk menegakkan zikir kepada Allah.\" "
  },
  {
    "id": 26684,
    "hadith_number": 904,
    "tajuk_hadith": "Rasulullah Melontar Jumrah Dengan Tenang",
    "perawi_melayu": "Qudamah bin Abdullah berkata:",
    "english_text": "\"I saw the Prophet stoning the Jimar upon his she-camel; there was no hitting, nor crowding, nor: 'Look out! Look out!'\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، عَنْ أَيْمَنَ بْنِ نَابِلٍ، عَنْ قُدَامَةَ بْنِ عَبْدِ اللَّهِ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَرْمِي الْجِمَارَ عَلَى نَاقَةٍ لَيْسَ ضَرْبٌ وَلاَ طَرْدٌ وَلاَ إِلَيْكَ إِلَيْكَ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ حَنْظَلَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ قُدَامَةَ بْنِ عَبْدِ اللَّهِ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَإِنَّمَا يُعْرَفُ هَذَا الْحَدِيثُ مِنْ هَذَا الْوَجْهِ وَهُوَ حَدِيثُ أَيْمَنَ بْنِ نَابِلٍ وَهُوَ ثِقَةٌ عِنْدَ أَهْلِ الْحَدِيثِ ‏.‏",
    "malay_translation": "Aku melihat Nabi SAW melontar jumrah di atas untanya;  tiada sebarang pergaduhan, kesesakan, mahupun jeritan ‘awas! awas!’."
  },
  {
    "id": 26685,
    "hadith_number": 905,
    "tajuk_hadith": "Penyembelihan Haiwan Sempena Tahun Hudaibiyah",
    "perawi_melayu": "Jabir meriwayatkan:",
    "english_text": "\"We slaughtered with the Messenger of Allah during the year of Al-Hudaibiyah: a cow for seven, and a Badanah for seven.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ نَحَرْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم عَامَ الْحُدَيْبِيَةِ الْبَقَرَةَ عَنْ سَبْعَةٍ وَالْبَدَنَةَ عَنْ سَبْعَةٍ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عُمَرَ وَأَبِي هُرَيْرَةَ وَعَائِشَةَ وَابْنِ عَبَّاسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ جَابِرٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ يَرَوْنَ الْجَزُورَ عَنْ سَبْعَةٍ وَالْبَقَرَةَ عَنْ سَبْعَةٍ ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَالشَّافِعِيِّ وَأَحْمَدَ ‏.‏ وَرُوِيَ عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّ الْبَقَرَةَ عَنْ سَبْعَةٍ وَالْجَزُورَ عَنْ عَشَرَةٍ ‏.‏ وَهُوَ قَوْلُ إِسْحَاقَ وَاحْتَجَّ بِهَذَا الْحَدِيثِ ‏.‏ وَحَدِيثُ ابْنِ عَبَّاسٍ إِنَّمَا نَعْرِفُهُ مِنْ وَجْهٍ وَاحِدٍ ‏.‏",
    "malay_translation": "Kami menyembelih bersama Rasulullah SAW pada tahun Hudaibiyah: seekor lembu untuk tujuh orang, dan seekor badanah untuk tujuh orang."
  },
  {
    "id": 26686,
    "hadith_number": 906,
    "tajuk_hadith": "Perkongsian Sembelihan Qurban pada Hari Raya Aidiladha",
    "perawi_melayu": "Ibn Abbas meriwayatkan:",
    "english_text": "\"We were with the Prophet on a journey (on the Day of) Adha, so seven of us shared in a cow, and ten for a camel.\"",
    "arabic_text": "حَدَّثَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ، وَغَيْرُ، وَاحِدٍ، قَالُوا حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، عَنْ حُسَيْنِ بْنِ وَاقِدٍ، عَنْ عِلْبَاءَ بْنِ أَحْمَرَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي سَفَرٍ ‏.‏ فَحَضَرَ الأَضْحَى فَاشْتَرَكْنَا فِي الْبَقَرَةِ سَبْعَةً وَفِي الْجَزُورِ عَشَرَةً ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَهُوَ حَدِيثُ حُسَيْنِ بْنِ وَاقِدٍ ‏.‏",
    "malay_translation": "Kami bersama Nabi SAW dalam suatu perjalanan.  Ketika tiba hari raya Aidiladha, kami berkongsi seekor lembu antara tujuh orang, dan seekor unta antara sepuluh orang."
  },
  {
    "id": 26687,
    "hadith_number": 907,
    "tajuk_hadith": "Rasulullah SAW Menghias Dua Kasut dan Menanda Haiwan Qurban di Zul Hulaifah",
    "perawi_melayu": "Ibn Abbas meriwayatkan:",
    "english_text": "\"The Prophet garlanded two sandals and marked the Hadi on the right side at Dhul-Hulaifah, and removed the blood from it.\"",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامٍ الدَّسْتَوَائِيِّ، عَنْ قَتَادَةَ، عَنْ أَبِي حَسَّانَ الأَعْرَجِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَلَّدَ نَعْلَيْنِ وَأَشْعَرَ الْهَدْىَ فِي الشِّقِّ الأَيْمَنِ بِذِي الْحُلَيْفَةِ وَأَمَاطَ عَنْهُ الدَّمَ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَأَبُو حَسَّانَ الأَعْرَجُ اسْمُهُ مُسْلِمٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ يَرَوْنَ الإِشْعَارَ ‏.‏ وَهُوَ قَوْلُ الثَّوْرِيِّ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏ قَالَ أَبُو عِيسَى سَمِعْتُ يُوسُفَ بْنَ عِيسَى يَقُولُ سَمِعْتُ وَكِيعًا يَقُولُ حِينَ رَوَى هَذَا الْحَدِيثَ قَالَ لاَ تَنْظُرُوا إِلَى قَوْلِ أَهْلِ الرَّأْىِ فِي هَذَا فَإِنَّ الإِشْعَارَ سُنَّةٌ وَقَوْلَهُمْ بِدْعَةٌ ‏.‏ قَالَ وَسَمِعْتُ أَبَا السَّائِبِ يَقُولُ كُنَّا عِنْدَ وَكِيعٍ فَقَالَ لِرَجُلٍ عِنْدَهُ مِمَّنْ يَنْظُرُ فِي الرَّأْىِ أَشْعَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَيَقُولُ أَبُو حَنِيفَةَ هُوَ مُثْلَةٌ ‏.‏ قَالَ الرَّجُلُ فَإِنَّهُ قَدْ رُوِيَ عَنْ إِبْرَاهِيمَ النَّخَعِيِّ أَنَّهُ قَالَ الإِشْعَارُ مُثْلَةٌ ‏.‏ قَالَ فَرَأَيْتُ وَكِيعًا غَضِبَ غَضَبًا شَدِيدًا وَقَالَ أَقُولُ لَكَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَتَقُولُ قَالَ إِبْرَاهِيمُ مَا أَحَقَّكَ بِأَنْ تُحْبَسَ ثُمَّ لاَ تَخْرُجَ حَتَّى تَنْزِعَ عَنْ قَوْلِكَ هَذَا ‏.‏",
    "malay_translation": "Daripada Abu Kuraib, daripada Wakie', daripada Hisyam al-Dustawa'i, daripada Qatadah, daripada Abu Hassan al-A'raj, daripada Ibnu Abbas, bahawa Nabi SAW telah menghias dua kasut dan menanda haiwan korban di bahagian kanan di Zul Hulaifah, dan membersihkan darah daripadanya.  Di dalam bab ini juga terdapat riwayat daripada Miswar bin Makhramah. Abu Isa berkata: Hadis Ibnu Abbas adalah hadis yang baik dan sahih.  Abu Hassan al-A'raj, namanya Muslim. Amalan seperti ini adalah berdasarkan kepada pendapat para ulama' daripada sahabat Nabi SAW dan selainnya, mereka berpendapat bahawa perbuatan menanda itu adalah sunnah.  Dan itulah pendapat Tsauri, Syafie, Ahmad dan Ishaq. Abu Isa berkata: Saya mendengar Yusuf bin Isa berkata: Saya mendengar Wakie' berkata ketika meriwayatkan hadis ini, katanya: Janganlah kamu melihat kepada pendapat ahli ra'y dalam hal ini, kerana perbuatan menanda itu adalah sunnah dan pendapat mereka adalah bid'ah. Saya juga mendengar Abu Sa'ib berkata: Kami berada di sisi Wakie', maka beliau berkata kepada seseorang yang berada di situ daripada kalangan yang berpandangan berdasarkan ra'y: Rasulullah SAW telah menanda, dan Abu Hanifah mengatakan bahawa ia adalah suatu kecacatan. Lelaki itu berkata: Sesungguhnya telah diriwayatkan daripada Ibrahim al-Nakha'i bahawa beliau berkata: Menanda itu adalah suatu kecacatan. Maka saya melihat Wakie' marah dengan hebat dan berkata: Aku katakan kepadamu bahawa Rasulullah SAW telah berbuat demikian dan engkau berkata seperti kata Ibrahim. Betapa patutnya engkau dipenjara, kemudian tidak dilepaskan sehingga engkau menarik balik perkataanmu itu."
  },
  {
    "id": 26688,
    "hadith_number": 908,
    "tajuk_hadith": "Pembelian Hady Rasulullah di Qudaid",
    "perawi_melayu": "Ibn Umar meriwayatkan:",
    "english_text": "\"The Prophet purchased his Hadi in Qudaid.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، وَأَبُو سَعِيدٍ الأَشَجُّ قَالاَ حَدَّثَنَا يَحْيَى بْنُ الْيَمَانِ، عَنْ سُفْيَانَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم اشْتَرَى هَدْيَهُ مِنْ قُدَيْدٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ مِنْ حَدِيثِ الثَّوْرِيِّ إِلاَّ مِنْ حَدِيثِ يَحْيَى بْنِ الْيَمَانِ ‏.‏ وَرُوِيَ عَنْ نَافِعٍ أَنَّ ابْنَ عُمَرَ اشْتَرَى هَدْيَهُ مِنْ قُدَيْدٍ ‏.‏ قَالَ أَبُو عِيسَى وَهَذَا أَصَحُّ ‏.‏",
    "malay_translation": "Daripada Qotaibah dan Abu Said al-Asyaj, mereka berkata: Telah menceritakan kepada kami Yahya bin Yaman, daripada Sufian, daripada Ubaidullah, daripada Nafi', daripada Ibnu Umar bahawa Nabi SAW membeli hadinya dari Qudaid. Abu Isa berkata: Hadis ini adalah hadis yang gharib, kami tidak mengetahuinya daripada hadis Tsauri kecuali daripada hadis Yahya bin Yaman.  Diriwayatkan daripada Nafi' bahawa Ibnu Umar membeli hadinya dari Qudaid. Abu Isa berkata: Dan ini adalah lebih sahih."
  },
  {
    "id": 26689,
    "hadith_number": 909,
    "tajuk_hadith": "Aisyah r.a. Mengenai Menghias Hady Rasulullah SAW",
    "perawi_melayu": "Aisyah meriwayatkan:",
    "english_text": "\"I twisted the garlands for the Hadi of the Prophet, then he did not assume Ihram, nor did he avoid any clothing.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ فَتَلْتُ قَلاَئِدَ هَدْىِ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ لَمْ يُحْرِمْ وَلَمْ يَتْرُكْ شَيْئًا مِنَ الثِّيَابِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ قَالُوا إِذَا قَلَّدَ الرَّجُلُ الْهَدْىَ وَهُوَ يُرِيدُ الْحَجَّ لَمْ يَحْرُمْ عَلَيْهِ شَيْءٌ مِنَ الثِّيَابِ وَالطِّيبِ حَتَّى يُحْرِمَ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ إِذَا قَلَّدَ الرَّجُلُ هَدْيَهُ فَقَدْ وَجَبَ عَلَيْهِ مَا وَجَبَ عَلَى الْمُحْرِمِ ‏.‏",
    "malay_translation": "Aku telah menghias kalung untuk haiwan korban Rasulullah SAW, kemudian baginda tidak berihram dan tidak meninggalkan sebarang pakaian."
  },
  {
    "id": 26690,
    "hadith_number": 910,
    "tajuk_hadith": "Aisyah r.a. Menganyam Kalung untuk Qurban Rasulullah",
    "perawi_melayu": "Aisyah meriwayatkan:",
    "english_text": "\"I twisted the garlands for all of the Hadi of the Messenger of Allah, which were sheep, then he did not assume Ihram.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أَفْتِلُ قَلاَئِدَ هَدْىِ رَسُولِ اللَّهِ صلى الله عليه وسلم كُلَّهَا غَنَمًا ثُمَّ لاَ يُحْرِمُ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ يَرَوْنَ تَقْلِيدَ الْغَنَمِ ‏.‏",
    "malay_translation": "Aku pernah menganyam kalung untuk semua haiwan korban Rasulullah ﷺ, semuanya kambing, kemudian baginda tidak mengerjakan ihram."
  },
  {
    "id": 26691,
    "hadith_number": 911,
    "tajuk_hadith": "Cara Mengendalikan Haiwan Qurban yang Cacat",
    "perawi_melayu": "Najiyah Al-Khuza'i (sahabat Rasulullah) berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَارُونُ بْنُ إِسْحَاقَ الْهَمْدَانِيُّ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ نَاجِيَةَ الْخُزَاعِيِّ، صَاحِبِ بُدْنِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ قُلْتُ يَا رَسُولَ اللَّهِ كَيْفَ أَصْنَعُ بِمَا عَطِبَ مِنَ الْبُدْنِ قَالَ ‏\n\"‏ انْحَرْهَا ثُمَّ اغْمِسْ نَعْلَهَا فِي دَمِهَا ثُمَّ خَلِّ بَيْنَ النَّاسِ وَبَيْنَهَا فَيَأْكُلُوهَا ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ ذُؤَيْبٍ أَبِي قَبِيصَةَ الْخُزَاعِيِّ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ نَاجِيَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ قَالُوا فِي هَدْىِ التَّطَوُّعِ إِذَا عَطِبَ لاَ يَأْكُلُ هُوَ وَلاَ أَحَدٌ مِنْ أَهْلِ رُفْقَتِهِ وَيُخَلَّى بَيْنَهُ وَبَيْنَ النَّاسِ يَأْكُلُونَهُ وَقَدْ أَجْزَأَ عَنْهُ ‏.‏ وَهُوَ قَوْلُ الشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏ وَقَالُوا إِنْ أَكَلَ مِنْهُ شَيْئًا غَرِمَ بِقَدْرِ مَا أَكَلَ مِنْهُ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ إِذَا أَكَلَ مِنْ هَدْىِ التَّطَوُّعِ شَيْئًا فَقَدْ ضَمِنَ الَّذِي أَكَلَ ‏.‏",
    "malay_translation": "Aku berkata, \"Wahai Rasulullah, bagaimanakah cara saya menangani haiwan kurban yang cacat?\" Baginda menjawab, \"Sembelihlah ia, kemudian celupkan kasutmu ke dalam darahnya, kemudian biarkan ia di situ agar orang ramai boleh memakannya.\""
  },
  {
    "id": 26692,
    "hadith_number": 912,
    "tajuk_hadith": "Nabi SAW Menganjurkan Perjalanan dengan Unta Badanah",
    "perawi_melayu": "Anas bin Malik meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى رَجُلاً يَسُوقُ بَدَنَةً فَقَالَ لَهُ ‏\"‏ ارْكَبْهَا ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّهَا بَدَنَةٌ ‏.‏ قَالَ لَهُ فِي الثَّالِثَةِ أَوْ فِي الرَّابِعَةِ ‏\"‏ ارْكَبْهَا وَيْحَكَ ‏\"‏ ‏.‏ أَوْ ‏\"‏ وَيْلَكَ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَلِيٍّ وَأَبِي هُرَيْرَةَ وَجَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَنَسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رَخَّصَ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ فِي رُكُوبِ الْبَدَنَةِ إِذَا احْتَاجَ إِلَى ظَهْرِهَا ‏.‏ وَهُوَ قَوْلُ الشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏ وَقَالَ بَعْضُهُمْ لاَ يَرْكَبُ مَا لَمْ يُضْطَرَّ إِلَيْهَا ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah, telah menceritakan kepada kami Abu 'Awanah, dari Qatadah, dari Anas, bahawa Nabi SAW melihat seorang lelaki yang sedang memimpin unta Badanah, lalu Baginda bersabda kepadanya, \"Naiklah.\" Lelaki itu berkata, \"Wahai Rasulullah, ia adalah unta Badanah.\" Maka pada kali ketiga atau keempat Baginda bersabda kepadanya, \"Naiklah, celaka engkau!\" atau \"Binasalah engkau!\"  Riwayat lain yang sejenis dengan hadis ini terdapat daripada Ali, Abu Hurairah dan Jabir. Abu Isa berkata, hadis Anas adalah hadis yang baik dan sahih. Sesungguhnya sebilangan ulama dari kalangan sahabat Nabi SAW dan selain mereka telah memberi keringanan untuk menunggang unta Badanah jika memerlukannya. Demikian juga pendapat Syafie, Ahmad dan Ishaq. Sebahagian ulama lain berkata, janganlah menunggangnya kecuali jika terpaksa."
  },
  {
    "id": 26693,
    "hadith_number": 913,
    "tajuk_hadith": "Rasulullah SAW Melaksanakan Qurban dan Mengagihkan Rambut",
    "perawi_melayu": "Anas bin Malik meriwayatkan:",
    "english_text": "\"When the Messenger of Allah stoned the Jamrah, he slaughtered his sacrifice, then he presented the barber the right side (of his head) and he shaved it, then he gave (the hair) to Abu Talhah. Then he presented the left side to him and he shaved it. Then he said: 'Divide it (the hair) among the people.'\"",
    "arabic_text": "حَدَّثَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ هِشَامِ بْنِ حَسَّانَ، عَنِ ابْنِ سِيرِينَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ لَمَّا رَمَى النَّبِيُّ صلى الله عليه وسلم الْجَمْرَةَ نَحَرَ نُسُكَهُ ثُمَّ نَاوَلَ الْحَالِقَ شِقَّهُ الأَيْمَنَ فَحَلَقَهُ فَأَعْطَاهُ أَبَا طَلْحَةَ ثُمَّ نَاوَلَهُ شِقَّهُ الأَيْسَرَ فَحَلَقَهُ فَقَالَ ‏\n\"‏ اقْسِمْهُ بَيْنَ النَّاسِ ‏\"‏ ‏.‏ \nحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ هِشَامٍ، نَحْوَهُ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Anas bin Malik meriwayatkan:  Apabila Nabi SAW melontar Jamrah, baginda menyembelih korbannya, kemudian baginda menghulurkan bahagian kanan kepalanya kepada tukang gunting dan diguntingnya. Kemudian baginda memberikan (rambut itu) kepada Abu Talhah.  Kemudian baginda menghulurkan bahagian kiri kepalanya dan diguntingnya. Kemudian baginda bersabda: “Bahagikanlah (rambut ini) kepada orang ramai.”"
  },
  {
    "id": 26694,
    "hadith_number": 914,
    "tajuk_hadith": "Rahmat Allah SWT ke atas Orang yang Mencukur dan Memendekkan Rambut",
    "perawi_melayu": "Ibn Umar meriwayatkan bahawa:",
    "english_text": "The Messenger of Allah said: \"May Allah have mercy upon those who shaved\" saying it one or two times, then he said: \"And those who shortened.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ حَلَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَحَلَقَ طَائِفَةٌ مِنْ أَصْحَابِهِ وَقَصَّرَ بَعْضُهُمْ ‏.‏ قَالَ ابْنُ عُمَرَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ رَحِمَ اللَّهُ الْمُحَلِّقِينَ ‏\"‏ ‏.‏ مَرَّةً أَوْ مَرَّتَيْنِ ثُمَّ قَالَ ‏\"‏ وَالْمُقَصِّرِينَ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ وَابْنِ أُمِّ الْحُصَيْنِ وَمَارِبَ وَأَبِي سَعِيدٍ وَأَبِي مَرْيَمَ وَحُبْشِيِّ بْنِ جُنَادَةَ وَأَبِي هُرَيْرَةَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ يَخْتَارُونَ لِلرَّجُلِ أَنْ يَحْلِقَ رَأْسَهُ وَإِنْ قَصَّرَ يَرَوْنَ أَنَّ ذَلِكَ يُجْزِئُ عَنْهُ ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Semoga Allah merahmati mereka yang mencukur rambut (kepala)\"  beliau menyebutnya sekali atau dua kali, kemudian baginda bersabda: \"Dan mereka yang memendekkan (rambut kepala).\""
  },
  {
    "id": 26695,
    "hadith_number": 915,
    "tajuk_hadith": "Larangan Menggunduli Rambut Wanita",
    "perawi_melayu": "Ali meriwayatkan:",
    "english_text": "\"The Messenger of Allah prohibited that a woman should shave her head.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى الْجُرَشِيُّ الْبَصْرِيُّ، حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ خِلاَسِ بْنِ عَمْرٍو، عَنْ عَلِيٍّ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ تَحْلِقَ الْمَرْأَةُ رَأْسَهَا ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Musa al-Jurasyi al-Basri, telah menceritakan kepada kami Abu Daud ath-Thayalisi, telah menceritakan kepada kami Hammam, dari Qatadah, dari Kilaas bin Amr, dari Ali, katanya: Rasulullah SAW melarang wanita menggunduli rambutnya."
  },
  {
    "id": 26696,
    "hadith_number": 916,
    "tajuk_hadith": "Hadis Mengenai Larangan Wanita Mencukur Rambut Kepalanya",
    "perawi_melayu": "(Sanad lain) yang serupa (seperti nombor 914) daripada Khilas:",
    "english_text": "But he did not mention \"from Ali.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو دَاوُدَ، عَنْ هَمَّامٍ، عَنْ خِلاَسٍ، نَحْوَهُ ‏.‏ وَلَمْ يَذْكُرْ فِيهِ عَنْ عَلِيٍّ، ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَلِيٍّ فِيهِ اضْطِرَابٌ ‏.‏ وَرُوِيَ هَذَا الْحَدِيثُ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ قَتَادَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى أَنْ تَحْلِقَ الْمَرْأَةُ رَأْسَهَا ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ لاَ يَرَوْنَ عَلَى الْمَرْأَةِ حَلْقًا وَيَرَوْنَ أَنَّ عَلَيْهَا التَّقْصِيرَ ‏.‏",
    "malay_translation": "Tetapi ia tidak menyebut \"daripada Ali.\"  Hadis ini diriwayatkan daripada Muhammad bin Bashar, daripada Abu Dawud, daripada Hammam, daripada Khilas, lebih kurang begitu.  Dan ia tidak menyebut di dalamnya daripada Ali. Abu Isa berkata: Hadis Ali di dalamnya terdapat percanggahan.  Hadis ini juga diriwayatkan daripada Hammad bin Salamah, daripada Qatadah, daripada Aisyah, bahawa Nabi SAW melarang wanita mencukur habis rambut kepalanya. Amalan yang diamalkan oleh ahli ilmu ialah mereka tidak membenarkan wanita mencukur habis rambut, tetapi mereka berpendapat wanita hanya perlu memendekkan rambut."
  },
  {
    "id": 26697,
    "hadith_number": 917,
    "tajuk_hadith": "Mencukur Rambut Sebelum Sembelihan & Menyembelih Sebelum Melontar",
    "perawi_melayu": "Abdullah bin Amr meriwayatkan:",
    "english_text": "\"A man asked the Messenger of Allah: 'I shaved before slaughtering.' So he said: 'Slaughter, and there is no harm.' Another man asked him: 'I performed the sacrifice before stoning.' He said: 'Stone, and there is no harm.'\"",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ، وَابْنُ أَبِي عُمَرَ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عِيسَى بْنِ طَلْحَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، أَنَّ رَجُلاً، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ حَلَقْتُ قَبْلَ أَنْ أَذْبَحَ فَقَالَ ‏\"‏ اذْبَحْ وَلاَ حَرَجَ ‏\"‏ ‏.‏ وَسَأَلَهُ آخَرُ فَقَالَ نَحَرْتُ قَبْلَ أَنْ أَرْمِيَ قَالَ ‏\"‏ ارْمِ وَلاَ حَرَجَ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَلِيٍّ وَجَابِرٍ وَابْنِ عَبَّاسٍ وَابْنِ عُمَرَ وَأُسَامَةَ بْنِ شَرِيكٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَبْدِ اللَّهِ بْنِ عَمْرٍو حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَاقَ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ إِذَا قَدَّمَ نُسُكًا قَبْلَ نُسُكٍ فَعَلَيْهِ دَمٌ ‏.‏",
    "malay_translation": "Seorang lelaki bertanya kepada Rasulullah SAW, \"Saya telah mencukur rambut sebelum menyembelih.\" Baginda menjawab, \"Sembelihlah, tiada apa yang salah.\"  Lelaki lain bertanya, \"Saya telah menyembelih sebelum melontar (jamrah).\" Baginda menjawab, \"Lontarkanlah, tiada apa yang salah.\""
  },
  {
    "id": 26698,
    "hadith_number": 918,
    "tajuk_hadith": "Menggunakan Wangian Sebelum Ihram dan Hari Raya Qurban",
    "perawi_melayu": "Aisyah meriwayatkan:",
    "english_text": "\"I put perfume with musk in it on the Messenger of Allah before he assumed Ihram, and on the Day of An-Nahr before he performed Tawaf around the House.\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا مَنْصُورٌ يَعْنِي ابْنَ زَاذَانَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ طَيَّبْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَبْلَ أَنْ يُحْرِمَ وَيَوْمَ النَّحْرِ قَبْلَ أَنْ يَطُوفَ بِالْبَيْتِ بِطِيبٍ فِيهِ مِسْكٌ ‏.‏ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَائِشَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ يَرَوْنَ أَنَّ الْمُحْرِمَ إِذَا رَمَى جَمْرَةَ الْعَقَبَةِ يَوْمَ النَّحْرِ وَذَبَحَ وَحَلَقَ أَوْ قَصَّرَ فَقَدْ حَلَّ لَهُ كُلُّ شَيْءٍ حَرُمَ عَلَيْهِ إِلاَّ النِّسَاءَ ‏.‏ وَهُوَ قَوْلُ الشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏ وَقَدْ رُوِيَ عَنْ عُمَرَ بْنِ الْخَطَّابِ أَنَّهُ قَالَ حَلَّ لَهُ كُلُّ شَيْءٍ إِلاَّ النِّسَاءَ وَالطِّيبَ ‏.‏ وَقَدْ ذَهَبَ بَعْضُ أَهْلِ الْعِلْمِ إِلَى هَذَا مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ وَهُوَ قَوْلُ أَهْلِ الْكُوفَةِ ‏.‏",
    "malay_translation": "Aku telah menggunakan minyak wangi yang mengandungi kasturi ke atas Rasulullah ﷺ sebelum baginda memasuki ihram, dan pada Hari An-Nahr sebelum baginda melakukan tawaf di sekitar Kaabah."
  },
  {
    "id": 26699,
    "hadith_number": 919,
    "tajuk_hadith": "Talbiyah sehingga selesai melontar Jamrah al-Aqabah",
    "perawi_melayu": "Al-Fadl bin Abbas meriwayatkan:",
    "english_text": "\"I was a companion rider with the Messenger of Allah from Jam to Mina. He did not cease saying the Talbiyah until stoning Jamrat Al-Aqabah.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ الْفَضْلِ بْنِ عَبَّاسٍ، قَالَ أَرْدَفَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ جَمْعٍ إِلَى مِنًى فَلَمْ يَزَلْ يُلَبِّي حَتَّى رَمَى الْجَمْرَةَ ‏.‏ وَفِي الْبَابِ عَنْ عَلِيٍّ وَابْنِ مَسْعُودٍ وَابْنِ عَبَّاسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ الْفَضْلِ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ أَنَّ الْحَاجَّ لاَ يَقْطَعُ التَّلْبِيَةَ حَتَّى يَرْمِيَ الْجَمْرَةَ ‏.‏ وَهُوَ قَوْلُ الشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏",
    "malay_translation": "Aku menunggang bersama Rasulullah SAW dari Jam ke Mina. Baginda sentiasa melafazkan talbiyah sehingga selesai melontar Jamrah al-Aqabah."
  },
  {
    "id": 26700,
    "hadith_number": 920,
    "tajuk_hadith": "Mengenai Meninggalkan Talbiyah Semasa Istilam Hajar Aswad dalam Umrah",
    "perawi_melayu": "Ibn Abbas meriwayatkan:",
    "english_text": "(that the Prophet): \"Would stop saying the Talbiyah during \"Umrah when he touched the (Black) Stone.\"",
    "arabic_text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا هُشَيْمٌ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، يَرْفَعُ الْحَدِيثَ أَنَّهُ كَانَ يُمْسِكُ عَنِ التَّلْبِيَةِ، فِي الْعُمْرَةِ إِذَا اسْتَلَمَ الْحَجَرَ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَيْهِ عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ قَالُوا لاَ يَقْطَعُ الْمُعْتَمِرُ التَّلْبِيَةَ حَتَّى يَسْتَلِمَ الْحَجَرَ ‏.‏ وَقَالَ بَعْضُهُمْ إِذَا انْتَهَى إِلَى بُيُوتِ مَكَّةَ قَطَعَ التَّلْبِيَةَ ‏.‏ وَالْعَمَلُ عَلَى حَدِيثِ النَّبِيِّ صلى الله عليه وسلم وَبِهِ يَقُولُ سُفْيَانُ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Hannad, telah menceritakan kepada kami Husyaim, dari Ibnu Abi Laila, dari Ata’, dari Ibnu Abbas, bahawa beliau mengangkat hadis bahawa Nabi SAW berhenti daripada melafazkan talbiyah ketika mengerjakan umrah apabila baginda menyentuh Hajar Aswad.  Dalam bab yang sama juga diriwayatkan daripada Abdullah bin Amr. Abu Isa berkata: Hadis Ibnu Abbas ini adalah hadis yang sahih. Dan amalan yang diamalkan oleh kebanyakan ulama’ ialah mereka mengatakan: Orang yang mengerjakan umrah tidak boleh memutuskan talbiyah sehingga menyentuh Hajar Aswad. Dan sebahagian daripada mereka mengatakan: Apabila sampai ke rumah-rumah di Makkah, maka dia memutuskan talbiyah. Dan amalan itu adalah berdasarkan hadis Nabi SAW, dan dengannya (pendapat) berkata Sufyan, Syafie, Ahmad dan Ishaq."
  },
  {
    "id": 26701,
    "hadith_number": 921,
    "tajuk_hadith": "Menunda Tawaf Ziarah ke Malam Hari",
    "perawi_melayu": "Aisyah meriwayatkan:",
    "english_text": "\"The Prophet delayed the visiting Tawaf until the night.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزُّبَيْرِ، عَنِ ابْنِ عَبَّاسٍ، وَعَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَخَّرَ طَوَافَ الزِّيَارَةِ إِلَى اللَّيْلِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رَخَّصَ بَعْضُ أَهْلِ الْعِلْمِ فِي أَنْ يُؤَخَّرَ طَوَافُ الزِّيَارَةِ إِلَى اللَّيْلِ وَاسْتَحَبَّ بَعْضُهُمْ أَنْ يَزُورَ يَوْمَ النَّحْرِ وَوَسَّعَ بَعْضُهُمْ أَنْ يُؤَخَّرَ وَلَوْ إِلَى آخِرِ أَيَّامِ مِنًى ‏.‏",
    "malay_translation": "Daripada Muhammad bin Bashar, daripada Abdur Rahman bin Mahdi, daripada Sufyan, daripada Abu Zubair, daripada Ibnu Abbas dan Aisyah, bahawa Nabi SAW menangguhkan tawaf ziarah sehingga waktu malam. Abu Isa berkata: “Hadis ini adalah hadis yang baik dan sahih.”  Sesungguhnya sebahagian ulama telah memberi kelonggaran untuk menangguhkan tawaf ziarah sehingga waktu malam, dan sebahagian mereka pula mengutamakan ziarah pada hari raya korban, dan sebahagian yang lain pula memberi kelonggaran untuk menangguhkannya sehingga akhir hari-hari di Mina."
  },
  {
    "id": 26702,
    "hadith_number": 922,
    "tajuk_hadith": "Nabi SAW, Abu Bakar, Umar, dan Uthman di Al-Abtah",
    "perawi_melayu": "Dari Ibnu Umar meriwayatkan:",
    "english_text": "\"The Prophet, Abu Bakr, Umar, and Uthman would camp at Al-Abtah.\"",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم وَأَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ يَنْزِلُونَ الأَبْطَحَ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَائِشَةَ وَأَبِي رَافِعٍ وَابْنِ عَبَّاسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ صَحِيحٌ حَسَنٌ غَرِيبٌ إِنَّمَا نَعْرِفُهُ مِنْ حَدِيثِ عَبْدِ الرَّزَّاقِ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ ‏.‏ وَقَدِ اسْتَحَبَّ بَعْضُ أَهْلِ الْعِلْمِ نُزُولَ الأَبْطَحِ مِنْ غَيْرِ أَنْ يَرَوْا ذَلِكَ وَاجِبًا إِلاَّ مَنْ أَحَبَّ ذَلِكَ ‏.‏ قَالَ الشَّافِعِيُّ وَنُزُولُ الأَبْطَحِ لَيْسَ مِنَ النُّسُكِ فِي شَيْءٍ إِنَّمَا هُوَ مَنْزِلٌ نَزَلَهُ النَّبِيُّ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Dari Ibnu Umar, diriwayatkan bahawa Nabi SAW, Abu Bakar, Umar, dan Uthman pernah bermalam di Al-Abtah.  (Riwayat ini turut disokong oleh hadis daripada Aisyah, Abu Rafi', dan Ibnu Abbas). Imam Abu Isa menyatakan hadis Ibnu Umar ini adalah sahih, baik, dan ganjil (ghareeb).  Hadis ini hanya diketahui melalui riwayat Abdul Razzaq daripada Ubaidullah bin Umar. Sesetengah ulama' menyukai (bermalam di) Al-Abtah, namun tidak menganggapnya wajib kecuali bagi mereka yang menyukainya.  Imam Syafie menyatakan bahawa bermalam di Al-Abtah bukanlah termasuk dalam rukun ibadah, ia hanyalah tempat yang pernah didiami oleh Nabi SAW."
  },
  {
    "id": 26703,
    "hadith_number": 923,
    "tajuk_hadith": "At-Tahsib: Hanya Sebuah Tempat Perkhemahan Rasulullah",
    "perawi_melayu": "Daripada Ibnu Abbas meriwayatkan:",
    "english_text": "\"At-Tahsib is nothing, it is only a place that the Messenger of Allah camped at.\"",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَيْسَ التَّحْصِيبُ بِشَيْءٍ إِنَّمَا هُوَ مَنْزِلٌ نَزَلَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو عِيسَى التَّحْصِيبُ نُزُولُ الأَبْطَحِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Daripada Ibnu Abi Umar, daripada Sufian, daripada Amru bin Dinar, daripada Ataa’, daripada Ibnu Abbas, beliau berkata: \"At-Tahsib bukanlah sesuatu yang penting, ia hanyalah tempat yang Rasulullah SAW pernah bermalam.\" Abu Isa berkata: At-Tahsib ialah tempat turun di Al-Abtah. Abu Isa berkata lagi: Hadis ini adalah hadis yang baik dan sahih."
  },
  {
    "id": 26704,
    "hadith_number": 924,
    "tajuk_hadith": "Rasulullah Saw Berkemah di Al-Abtah",
    "perawi_melayu": "Aisyah meriwayatkan:",
    "english_text": "\"The Messenger of Allah only camped at Al-Abtah because it was easier for his departure.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا حَبِيبٌ الْمُعَلِّمُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ إِنَّمَا نَزَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم الأَبْطَحَ لأَنَّهُ كَانَ أَسْمَحَ لِخُرُوجِهِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ \nحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، نَحْوَهُ ‏.‏",
    "malay_translation": "Aisyah meriwayatkan bahawa Rasulullah SAW hanya berkemah di Al-Abtah kerana tempat itu memudahkan baginda untuk berangkat."
  },
  {
    "id": 26705,
    "hadith_number": 925,
    "tajuk_hadith": "Haji bagi Bayi dan Ganjaran Ibu",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan:",
    "english_text": "\"A woman held a boy of hers up for the Messenger of Allah and said: 'O Messenger of Allah! Is there Hajj for this one' He said: 'Yes, and you will be rewarded.'\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ الْكُوفِيُّ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ مُحَمَّدِ بْنِ سُوقَةَ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ رَفَعَتِ امْرَأَةٌ صَبِيًّا لَهَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ أَلِهَذَا حَجٌّ قَالَ ‏\n\"‏ نَعَمْ وَلَكِ أَجْرٌ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ ‏.‏ حَدِيثُ جَابِرٍ حَدِيثٌ غَرِيبٌ ‏.‏",
    "malay_translation": "Seorang wanita mengangkat anaknya yang masih kecil kepada Rasulullah SAW, lalu berkata: \"Wahai Rasulullah, adakah haji bagi anak ini?\"  Baginda menjawab: \"Ya, dan kamu akan mendapat pahala.\""
  },
  {
    "id": 26706,
    "hadith_number": 926,
    "tajuk_hadith": "Hajj Wada' bersama Rasulullah SAW",
    "perawi_melayu": "As-Sa'ib bin Yazid meriwayatkan:",
    "english_text": "\"My father took me for Hajj with the Messenger of Allah during the Farewell Hajj, and I was seven years old.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ مُحَمَّدِ بْنِ يُوسُفَ، عَنِ السَّائِبِ بْنِ يَزِيدَ، قَالَ حَجَّ بِي أَبِي مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ وَأَنَا ابْنُ سَبْعِ سِنِينَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Bapa saya telah membawa saya menunaikan haji bersama Rasulullah SAW semasa Haji Wada', ketika saya berusia tujuh tahun."
  },
  {
    "id": 26707,
    "hadith_number": 927,
    "tajuk_hadith": "Haji Kanak-Kanak dan Hamba",
    "perawi_melayu": "(Sanad lain) daripada Jabir bin Abdullah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا قَزَعَةُ بْنُ سُوَيْدٍ الْبَاهِلِيُّ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏ يَعْنِي حَدِيثَ مُحَمَّدِ بْنِ طَرِيفٍ ‏.‏ قَالَ أَبُو عِيسَى وَقَدْ رُوِيَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنِ النَّبِيِّ صلى الله عليه وسلم مُرْسَلاً ‏.‏ وَقَدْ أَجْمَعَ أَهْلُ الْعِلْمِ أَنَّ الصَّبِيَّ إِذَا حَجَّ قَبْلَ أَنْ يُدْرِكَ فَعَلَيْهِ الْحَجُّ إِذَا أَدْرَكَ لاَ تُجْزِئُ عَنْهُ تِلْكَ الْحَجَّةُ عَنْ حَجَّةِ الإِسْلاَمِ وَكَذَلِكَ الْمَمْلُوكُ إِذَا حَجَّ فِي رِقِّهِ ثُمَّ أُعْتِقَ فَعَلَيْهِ الْحَجُّ إِذَا وَجَدَ إِلَى ذَلِكَ سَبِيلاً وَلاَ يُجْزِئُ عَنْهُ مَا حَجَّ فِي حَالِ رِقِّهِ ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah, telah menceritakan kepada kami Qaza’ah bin Suwaid al-Bahili, dari Muhammad bin al-Munkidir, dari Jabir bin Abdullah, dari Nabi SAW, seumpamanya. Maksudnya hadis Muhammad bin Tarif. Abu Isa berkata: Dan telah diriwayatkan dari Muhammad bin al-Munkidir daripada Nabi SAW secara mursal. Para ulama telah bersepakat bahawa jika seorang kanak-kanak menunaikan haji sebelum baligh, maka dia wajib menunaikan haji apabila telah baligh. Haji yang dilakukan ketika kecil itu tidak mencukupi sebagai pengganti haji fardhu Islam. Begitu juga hamba yang menunaikan haji ketika masih dalam keadaan hamba, kemudian dibebaskan, maka dia wajib menunaikan haji apabila dia mampu. Haji yang dilakukan ketika masih menjadi hamba tidak mencukupi baginya.  Itulah pendapat Sufian al-Thawri, al-Syafie, Ahmad dan Ishaq."
  },
  {
    "id": 26708,
    "hadith_number": 928,
    "tajuk_hadith": "Talbiyah dan Melontar Jamrah bagi Pihak Wanita dan Kanak-Kanak Semasa Haji",
    "perawi_melayu": "Jabir meriwayatkan:",
    "english_text": "\"When we performed our Hajj with the Prophet we would say the Talbiyah for the women and we would stone for the boys.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ الْوَاسِطِيُّ، قَالَ سَمِعْتُ ابْنَ نُمَيْرٍ، عَنْ أَشْعَثَ بْنِ سَوَّارٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ كُنَّا إِذَا حَجَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم فَكُنَّا نُلَبِّي عَنِ النِّسَاءِ وَنَرْمِي عَنِ الصِّبْيَانِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏ وَقَدْ أَجْمَعَ أَهْلُ الْعِلْمِ عَلَى أَنَّ الْمَرْأَةَ لاَ يُلَبِّي عَنْهَا غَيْرُهَا بَلْ هِيَ تُلَبِّي عَنْ نَفْسِهَا وَيُكْرَهُ لَهَا رَفْعُ الصَّوْتِ بِالتَّلْبِيَةِ ‏.‏",
    "malay_translation": "Kami meriwayatkan daripada Jabir:  “Apabila kami menunaikan haji bersama Nabi SAW, kami akan menyebut talbiyah bagi pihak wanita dan melontar bagi pihak kanak-kanak.”  Abu ‘Isa berkata: “Hadis ini adalah hadis yang gharib (ganjil), kami tidak mengetahuinya melainkan daripada jalan ini sahaja.”  Para ulama’ telah bersepakat bahawa seorang wanita tidak diwakilkan oleh orang lain untuk menyebut talbiyah, sebaliknya dia sendiri yang menyebutnya, dan dimakruhkan baginya untuk meninggikan suara ketika menyebut talbiyah."
  },
  {
    "id": 26709,
    "hadith_number": 929,
    "tajuk_hadith": "Menunaikan Haji Bagi Pihak Orang Tua yang Tidak Mampu",
    "perawi_melayu": "Al-Fadl bin Abbas meriwayatkan:",
    "english_text": "\"A woman from Khath'am said: 'O Messenger of Allah! My father has lived until Allah has made Hajj obligatory, and he is an elderly man who is not able to sit on the back of a camel.' So he (pbuh) said: 'Perform Hajj for him.'\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي ابْنُ شِهَابٍ، قَالَ حَدَّثَنِي سُلَيْمَانُ بْنُ يَسَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، عَنِ الْفَضْلِ بْنِ عَبَّاسٍ، أَنَّ امْرَأَةً، مِنْ خَثْعَمٍ قَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أَبِي أَدْرَكَتْهُ فَرِيضَةُ اللَّهِ فِي الْحَجِّ وَهُوَ شَيْخٌ كَبِيرٌ لاَ يَسْتَطِيعُ أَنْ يَسْتَوِيَ عَلَى ظَهْرِ الْبَعِيرِ ‏.‏ قَالَ ‏\n\"‏ حُجِّي عَنْهُ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَلِيٍّ وَبُرَيْدَةَ وَحُصَيْنِ بْنِ عَوْفٍ وَأَبِي رَزِينٍ الْعُقَيْلِيِّ وَسَوْدَةَ بِنْتِ زَمْعَةَ وَابْنِ عَبَّاسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ الْفَضْلِ بْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَرُوِيَ عَنِ ابْنِ عَبَّاسٍ عَنْ حُصَيْنِ بْنِ عَوْفٍ الْمُزَنِيِّ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَرُوِيَ عَنِ ابْنِ عَبَّاسٍ أَيْضًا عَنْ سِنَانِ بْنِ عَبْدِ اللَّهِ الْجُهَنِيِّ عَنْ عَمَّتِهِ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَرُوِيَ عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ قَالَ وَسَأَلْتُ مُحَمَّدًا عَنْ هَذِهِ الرِّوَايَاتِ فَقَالَ أَصَحُّ شَيْءٍ فِي هَذَا الْبَابِ مَا رَوَى ابْنُ عَبَّاسٍ عَنِ الْفَضْلِ بْنِ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ قَالَ مُحَمَّدٌ وَيَحْتَمِلُ أَنْ يَكُونَ ابْنُ عَبَّاسٍ سَمِعَهُ مِنَ الْفَضْلِ وَغَيْرِهِ عَنِ النَّبِيِّ صلى الله عليه وسلم ثُمَّ رَوَى هَذَا عَنِ النَّبِيِّ صلى الله عليه وسلم وَأَرْسَلَهُ وَلَمْ يَذْكُرِ الَّذِي سَمِعَهُ مِنْهُ ‏.‏ قَالَ أَبُو عِيسَى وَقَدْ صَحَّ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي هَذَا الْبَابِ غَيْرُ حَدِيثٍ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ وَبِهِ يَقُولُ الثَّوْرِيُّ وَابْنُ الْمُبَارَكِ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ يَرَوْنَ أَنْ يُحَجَّ عَنِ الْمَيِّتِ ‏.‏ وَقَالَ مَالِكٌ إِذَا أَوْصَى أَنْ يُحَجَّ عَنْهُ حُجَّ عَنْهُ ‏.‏ وَقَدْ رَخَّصَ بَعْضُهُمْ أَنْ يُحَجَّ عَنِ الْحَىِّ إِذَا كَانَ كَبِيرًا أَوْ بِحَالٍ لاَ يَقْدِرُ أَنْ يَحُجَّ ‏.‏ وَهُوَ قَوْلُ ابْنِ الْمُبَارَكِ وَالشَّافِعِيِّ ‏.‏",
    "malay_translation": "Seorang wanita dari Khath'am berkata, \"Wahai Rasulullah! Bapa saya telah sampai usia di mana Allah mewajibkan haji, tetapi beliau seorang lelaki tua yang tidak mampu menunggang unta.\"  Maka baginda (SAW) bersabda, \"Tunaikanlah haji bagi pihak beliau.\""
  },
  {
    "id": 26710,
    "hadith_number": 930,
    "tajuk_hadith": "Menunaikan Haji Bagi Pihak Ibu Yang Telah Meninggal Dunia",
    "perawi_melayu": "Abdullah bin Buraidah meriwayatkan daripada bapanya yang berkata:",
    "english_text": "\"A woman came to the Prophet and said: 'My mother died and she did not perform Hajj should I perform Hajj on her behalf?' He said: 'Yes, perform Hajj on her behalf.'\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ سُفْيَانَ الثَّوْرِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَطَاءٍ، ‏.‏ قَالَ وَحَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَطَاءٍ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ جَاءَتِ امْرَأَةٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ إِنَّ أُمِّي مَاتَتْ وَلَمْ تَحُجَّ أَفَأَحُجُّ عَنْهَا قَالَ ‏\n\"‏ نَعَمْ حُجِّي عَنْهَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Seorang wanita datang kepada Nabi SAW dan berkata, ‘Ibu saya telah meninggal dunia dan beliau belum menunaikan Haji.  Bolehkah saya menunaikan Haji bagi pihak beliau?’ Baginda SAW menjawab, ‘Ya, tunaikanlah Haji bagi pihak beliau.’"
  },
  {
    "id": 26711,
    "hadith_number": 931,
    "tajuk_hadith": "Menunaikan Haji dan Umrah bagi Pihak Bapa",
    "perawi_melayu": "Abu Razin Al-Uqaili meriwayatkan:",
    "english_text": "That he went to the Prophet and said: \"O Messenger of Allah! My father is an elderly man who is not able to perform Hajj nor Umrah nor undertake a journey.' He said: 'Perform Hajj on behalf of your father and perform Umrah.'\"",
    "arabic_text": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى، حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنِ النُّعْمَانِ بْنِ سَالِمٍ، عَنْ عَمْرِو بْنِ أَوْسٍ، عَنْ أَبِي رَزِينٍ الْعُقَيْلِيِّ، أَنَّهُ أَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أَبِي شَيْخٌ كَبِيرٌ لاَ يَسْتَطِيعُ الْحَجَّ وَلاَ الْعُمْرَةَ وَلاَ الظَّعْنَ ‏.‏ قَالَ ‏\n\"‏ حُجَّ عَنْ أَبِيكَ وَاعْتَمِرْ ‏\"‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَإِنَّمَا ذُكِرَتِ الْعُمْرَةُ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي هَذَا الْحَدِيثِ أَنْ يَعْتَمِرَ الرَّجُلُ عَنْ غَيْرِهِ ‏.‏ وَأَبُو رَزِينٍ الْعُقَيْلِيُّ اسْمُهُ لَقِيطُ بْنُ عَامِرٍ ‏.‏",
    "malay_translation": "Dikisahkan bahawa seorang lelaki telah menghadap Nabi SAW dan berkata, \"Wahai Rasulullah! Bapa saya seorang lelaki tua yang tidak mampu menunaikan Haji mahupun Umrah, dan juga tidak mampu untuk melakukan perjalanan.\" Baginda SAW bersabda, \"Tunaikanlah Haji dan Umrah bagi pihak ayahmu.\""
  },
  {
    "id": 26712,
    "hadith_number": 932,
    "tajuk_hadith": "Keutamaan Umrah",
    "perawi_melayu": "Jabir meriwayatkan bahawa:",
    "english_text": "The Prophet was asked about whether Umrah was obligatory? He said: \"No. But if you perform Umrah it is more virtuous.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى الصَّنْعَانِيُّ، حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ، عَنِ الْحَجَّاجِ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم سُئِلَ عَنِ الْعُمْرَةِ أَوَاجِبَةٌ هِيَ قَالَ ‏\n\"‏ لاَ وَأَنْ تَعْتَمِرُوا هُوَ أَفْضَلُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهُوَ قَوْلُ بَعْضِ أَهْلِ الْعِلْمِ قَالُوا الْعُمْرَةُ لَيْسَتْ بِوَاجِبَةٍ ‏.‏ وَكَانَ يُقَالُ هُمَا حَجَّانِ الْحَجُّ الأَكْبَرُ يَوْمَ النَّحْرِ وَالْحَجُّ الأَصْغَرُ الْعُمْرَةُ ‏.‏ وَقَالَ الشَّافِعِيُّ الْعُمْرَةُ سُنَّةٌ لاَ نَعْلَمُ أَحَدًا رَخَّصَ فِي تَرْكِهَا وَلَيْسَ فِيهَا شَيْءٌ ثَابِتٌ بِأَنَّهَا تَطَوُّعٌ وَقَدْ رُوِيَ عَنِ النَّبِيِّ صلى الله عليه وسلم بِإِسْنَادٍ وَهُوَ ضَعِيفٌ لاَ تَقُومُ بِمِثْلِهِ الْحُجَّةُ وَقَدْ بَلَغَنَا عَنِ ابْنِ عَبَّاسٍ أَنَّهُ كَانَ يُوجِبُهَا ‏.‏ قَالَ أَبُو عِيسَى كُلُّهُ كَلاَمُ الشَّافِعِيِّ ‏.‏",
    "malay_translation": "Jabir meriwayatkan bahawa Nabi Muhammad SAW ditanya sama ada Umrah itu wajib. Baginda menjawab: \"Tidak. Tetapi jika kamu menunaikan Umrah, ia lebih afdal.\""
  },
  {
    "id": 26713,
    "hadith_number": 933,
    "tajuk_hadith": "Umrah Termasuk dalam Haji",
    "perawi_melayu": "Daripada Ibnu Abbas",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ، حَدَّثَنَا زِيَادُ بْنُ عَبْدِ اللَّهِ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ دَخَلَتِ الْعُمْرَةُ فِي الْحَجِّ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ سُرَاقَةَ بْنِ مَالِكِ بْنِ جُعْشُمٍ وَجَابِرِ بْنِ عَبْدِ اللَّهِ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ ‏.‏ وَمَعْنَى هَذَا الْحَدِيثِ أَنْ لاَ بَأْسَ بِالْعُمْرَةِ فِي أَشْهُرِ الْحَجِّ ‏.‏ وَهَكَذَا قَالَ الشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ ‏.‏ وَمَعْنَى هَذَا الْحَدِيثِ أَنَّ أَهْلَ الْجَاهِلِيَّةِ كَانُوا لاَ يَعْتَمِرُونَ فِي أَشْهُرِ الْحَجِّ فَلَمَّا جَاءَ الإِسْلاَمُ رَخَّصَ النَّبِيُّ صلى الله عليه وسلم فِي ذَلِكَ فَقَالَ ‏\"‏ دَخَلَتِ الْعُمْرَةُ فِي الْحَجِّ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏ ‏.‏ يَعْنِي لاَ بَأْسَ بِالْعُمْرَةِ فِي أَشْهُرِ الْحَجِّ ‏.‏ وَأَشْهُرُ الْحَجِّ شَوَّالٌ وَذُو الْقَعْدَةِ وَعَشْرٌ مِنْ ذِي الْحِجَّةِ لاَ يَنْبَغِي لِلرَّجُلِ أَنْ يُهِلَّ بِالْحَجِّ إِلاَّ فِي أَشْهُرِ الْحَجِّ ‏.‏ وَأَشْهُرُ الْحُرُمِ رَجَبٌ وَذُو الْقَعْدَةِ وَذُو الْحِجَّةِ وَالْمُحَرَّمُ ‏.‏ هَكَذَا قَالَ غَيْرُ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Abdah Adz-Dzabi, telah menceritakan kepada kami Ziyad bin Abdullah, dari Yazid bin Abi Ziyad, dari Mujahid, dari Ibnu Abbas, dari Nabi SAW, baginda bersabda: \"Umrah telah dimasukkan ke dalam Haji sehingga hari kiamat.\"  Di dalam bab ini juga terdapat riwayat daripada Suraqah bin Malik bin Ju'syum dan Jabir bin Abdullah. Abu Isa berkata: Hadis daripada Ibnu Abbas adalah hadis yang baik. Maksud hadis ini ialah tidak mengapa mengerjakan umrah pada bulan-bulan haji. Demikian juga yang dikatakan oleh Imam Syafie, Ahmad dan Ishaq. Maksud hadis ini ialah bahawa orang-orang jahiliyyah tidak mengerjakan umrah pada bulan-bulan haji. Maka setelah datangnya Islam, Nabi SAW memberi keringanan dalam perkara itu lalu baginda bersabda: \"Umrah telah dimasukkan ke dalam Haji sehingga hari kiamat.\" Maksudnya tidak mengapa mengerjakan umrah pada bulan-bulan haji. Bulan-bulan haji ialah Syawal, Zulkaedah dan sepuluh hari daripada Zulhijjah. Tidak sepatutnya seseorang itu berniat haji kecuali pada bulan-bulan haji. Dan bulan-bulan haram ialah Rajab, Zulkaedah, Zulhijjah dan Muharram. Demikianlah yang dikatakan oleh lebih daripada seorang ulama daripada sahabat-sahabat Nabi SAW dan selainnya."
  },
  {
    "id": 26714,
    "hadith_number": 934,
    "tajuk_hadith": "Umrah dan Haji Mabrur",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Umrah to 'Umrah atones for the\nsins between them, and for A1-Hajj\nAl-Mabrur there is no reward\nexcept Paradise.\"",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْعُمْرَةُ إِلَى الْعُمْرَةِ تُكَفِّرُ مَا بَيْنَهُمَا وَالْحَجُّ الْمَبْرُورُ لَيْسَ لَهُ جَزَاءٌ إِلاَّ الْجَنَّةُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Umrah demi umrah akan menghapuskan dosa di antara keduanya, dan bagi Haji yang mabrur, balasannya hanyalah syurga."
  },
  {
    "id": 26715,
    "hadith_number": 935,
    "tajuk_hadith": "Rasulullah Mengarahkan Abdur-Rahman bin Abi Bakr Mengiringi Aisyah Menunaikan Umrah",
    "perawi_melayu": "Amr bin Aws meriwayatkan daripada Abdur-Rahman bin Abi Bakr:",
    "english_text": "\"The Prophet ordered Abdur-RAhman bin Abi Bakr to (accompany) Aishah to perform Umrah from At-Tan'im.\"",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى، وَابْنُ أَبِي عُمَرَ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عَمْرِو بْنِ أَوْسٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ أَنْ يُعْمِرَ عَائِشَةَ مِنَ التَّنْعِيمِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Yahya bin Musa dan Ibnu Abi Umar, keduanya berkata: Telah menceritakan kepada kami Sufyan bin Uyainah daripada Amr bin Dinar, daripada Amr bin Aus, daripada Abdur-Rahman bin Abi Bakr, bahawa Nabi SAW telah memerintahkan Abdur-Rahman bin Abi Bakr untuk mengiringi Aisyah menunaikan Umrah dari Tan'im. Abu Isa berkata: Hadis ini adalah hadis yang baik dan sahih."
  },
  {
    "id": 26716,
    "hadith_number": 936,
    "tajuk_hadith": "Umrah Rahsia Rasulullah",
    "perawi_melayu": "Muharrish Al-Kabi meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ مُزَاحِمِ بْنِ أَبِي مُزَاحِمٍ، عَنْ عَبْدِ الْعَزِيزِ بْنِ عَبْدِ اللَّهِ، عَنْ مُحَرِّشٍ الْكَعْبِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ مِنَ الْجِعْرَانَةِ لَيْلاً مُعْتَمِرًا فَدَخَلَ مَكَّةَ لَيْلاً فَقَضَى عُمْرَتَهُ ثُمَّ خَرَجَ مِنْ لَيْلَتِهِ فَأَصْبَحَ بِالْجِعْرَانَةِ كَبَائِتٍ فَلَمَّا زَالَتِ الشَّمْسُ مِنَ الْغَدِ خَرَجَ مِنْ بَطْنِ سَرِفَ حَتَّى جَاءَ مَعَ الطَّرِيقِ طَرِيقِ جَمْعٍ بِبَطْنِ سَرِفَ فَمِنْ أَجْلِ ذَلِكَ خَفِيَتْ عُمْرَتُهُ عَلَى النَّاسِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏ وَلاَ نَعْرِفُ لِمُحَرِّشٍ الْكَعْبِيِّ عَنِ النَّبِيِّ صلى الله عليه وسلم غَيْرَ هَذَا الْحَدِيثِ ‏.‏",
    "malay_translation": "Kami diberitakan oleh Muhammad bin Bashar, yang diberitakan kepadanya oleh Yahya bin Said, daripada Ibnu Juraij, daripada Muzahim bin Abi Muzahim, daripada Abdul Aziz bin Abdullah, daripada Muharrish Al-Ka'bi, bahawa Rasulullah SAW keluar dari Al-Ji'ranah pada waktu malam untuk mengerjakan umrah, kemudian baginda memasuki Mekah pada waktu malam dan menunaikan umrah baginda. Kemudian baginda keluar pada waktu malam itu juga, lalu baginda berada di Al-Ji'ranah pada waktu pagi, seolah-olah baginda telah bermalam di sana. Setelah matahari melewati puncak di waktu pagi, baginda keluar dari tengah-tengah Sarif sehingga baginda sampai ke jalan dari tengah-tengah Sarif.  Atas sebab itulah umrah baginda tersembunyi daripada manusia. Abu Isa berkata: Ini adalah hadis yang baik dan ganjil. Dan kami tidak mengetahui riwayat Muharrish Al-Ka'bi daripada Nabi SAW selain daripada hadis ini."
  },
  {
    "id": 26717,
    "hadith_number": 937,
    "tajuk_hadith": "Umrah Rasulullah SAW",
    "perawi_melayu": "Urwah berkata:",
    "english_text": "Ibn Umar was asked: In which month did the Messenger of Allah perform Umrah? He said: 'During Rajab.' So Aishah said: 'The Messenger of Allah did not perform Umrah except that he was with him - meaning Ibn Umar - and he did not ever perform Umrah in the month of Rajab.'",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ، عَنِ الأَعْمَشِ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ عُرْوَةَ، قَالَ سُئِلَ ابْنُ عُمَرَ فِي أَىِّ شَهْرٍ اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ فِي رَجَبٍ ‏.‏ قَالَ فَقَالَتْ عَائِشَةُ مَا اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلاَّ وَهُوَ مَعَهُ تَعْنِي ابْنَ عُمَرَ وَمَا اعْتَمَرَ فِي شَهْرِ رَجَبٍ قَطُّ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ ‏.‏ سَمِعْتُ مُحَمَّدًا يَقُولُ حَبِيبُ بْنُ أَبِي ثَابِتٍ لَمْ يَسْمَعْ مِنْ عُرْوَةَ بْنِ الزُّبَيْرِ ‏.‏",
    "malay_translation": "Ibn Umar ditanya: Pada bulan apakah Rasulullah SAW menunaikan umrah? Baginda menjawab: 'Pada bulan Rejab.' Kemudian Aisyah berkata: 'Rasulullah SAW tidak pernah menunaikan umrah melainkan bersama beliau – iaitu Ibn Umar – dan baginda tidak pernah menunaikan umrah pada bulan Rejab.'"
  },
  {
    "id": 26718,
    "hadith_number": 938,
    "tajuk_hadith": "Nabi Muhammad SAW Menunaikan Umrah Sebanyak Empat Kali",
    "perawi_melayu": "Ibn Umar meriwayatkan:",
    "english_text": "\"The Prophet performed Umrah four times, one of them was during Rajab.\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى، حَدَّثَنَا شَيْبَانُ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم اعْتَمَرَ أَرْبَعًا إِحْدَاهُنَّ فِي رَجَبٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ ‏.‏",
    "malay_translation": "Daripada Ibnu Umar, bahawa Nabi Muhammad SAW telah menunaikan umrah sebanyak empat kali, salah satunya pada bulan Rajab.  Abu Isa berkata: “Hadis ini adalah hadis yang baik, sahih dan ganjil.”"
  },
  {
    "id": 26719,
    "hadith_number": 939,
    "tajuk_hadith": "Umrah Nabi SAW di Bulan Zulkaedah",
    "perawi_melayu": "Al-Bara meriwayatkan:",
    "english_text": "\"The Prophet performed Umrah during Dhul-Qa'dah.\"",
    "arabic_text": "حَدَّثَنَا الْعَبَّاسُ بْنُ مُحَمَّدٍ الدُّورِيُّ، حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، هُوَ السَّلُولِيُّ الْكُوفِيُّ عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم اعْتَمَرَ فِي ذِي الْقَعْدَةِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ ‏.‏",
    "malay_translation": "Al-Bara meriwayatkan bahawa Nabi Muhammad SAW telah menunaikan Umrah pada bulan Zulkaedah. Abu Isa berkata: “Hadis ini adalah hadis yang baik dan sahih.”  Di dalam bab ini juga terdapat riwayat daripada Ibnu Abbas."
  },
  {
    "id": 26720,
    "hadith_number": 940,
    "tajuk_hadith": "Umrah di Bulan Ramadan Sama Gaji Haji",
    "perawi_melayu": "Umm Ma'qil meriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ بْنِ يَزِيدَ، عَنِ ابْنِ أُمِّ مَعْقِلٍ، عَنْ أُمِّ مَعْقِلٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ عُمْرَةٌ فِي رَمَضَانَ تَعْدِلُ حَجَّةً ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ وَجَابِرٍ وَأَبِي هُرَيْرَةَ وَأَنَسٍ وَوَهْبِ بْنِ خَنْبَشٍ ‏.‏ قَالَ أَبُو عِيسَى وَيُقَالُ هَرَمُ بْنُ خَنْبَشٍ ‏.‏ قَالَ بَيَانٌ وَجَابِرٌ عَنِ الشَّعْبِيِّ عَنْ وَهْبِ بْنِ خَنْبَشٍ ‏.‏ وَقَالَ دَاوُدُ الأَوْدِيُّ عَنِ الشَّعْبِيِّ عَنْ هَرَمِ بْنِ خَنْبَشٍ ‏.‏ وَوَهْبٌ أَصَحُّ ‏.‏ وَحَدِيثُ أُمِّ مَعْقِلٍ حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ وَقَالَ أَحْمَدُ وَإِسْحَاقُ قَدْ ثَبَتَ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّ عُمْرَةً فِي رَمَضَانَ تَعْدِلُ حَجَّةً ‏.‏ قَالَ إِسْحَاقُ مَعْنَى هَذَا الْحَدِيثِ مِثْلُ مَا رُوِيَ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\"‏ مَنْ قَرَأَْ ‏:‏ ‏(‏ قُلْ هُوَ اللَّهُ أَحَدٌ ‏)‏ فَقَدْ قَرَأَ ثُلُثَ الْقُرْآنِ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Nasr bin Ali, telah menceritakan kepada kami Abu Ahmad Az-Zubairi, telah menceritakan kepada kami Israil, dari Abi Ishaq, dari Aswad bin Yazid, dari Ibnu Umm Ma'qil, dari Umm Ma'qil, dari Nabi SAW, baginda bersabda: \"Umrah pada bulan Ramadan bersamaan pahalanya dengan haji.\"  Dan dalam bab ini, dari Ibnu Abbas, Jabir, Abu Hurairah, Anas dan Wahb bin Khanbash. Abu Isa berkata, dan disebut juga Haram bin Khanbash. Bayan dan Jabir berkata dari As-Sya'bi dari Wahb bin Khanbash. Dan Daud Al-Audi berkata dari As-Sya'bi dari Haram bin Khanbash.  Wahb adalah lebih sahih. Dan hadis Umm Ma'qil adalah hadis yang hasan dan gharib dari segi ini. Ahmad dan Ishaq berkata, telah tetap dari Nabi SAW bahawa umrah pada bulan Ramadan bersamaan pahalanya dengan haji. Ishaq berkata, maksud hadis ini adalah seperti yang diriwayatkan dari Nabi SAW bahawa baginda bersabda: \"Barangsiapa membaca: (Qul huwallahu ahad), maka dia telah membaca sepertiga al-Quran.\""
  },
  {
    "id": 26721,
    "hadith_number": 941,
    "tajuk_hadith": "Hukum Haji Bagi Orang Yang Cedera Semasa Haji",
    "perawi_melayu": "Ikrimah meriwayatkan daripada Al-Hajjaj bin Amr yang meriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا حَجَّاجٌ الصَّوَّافُ، حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ عِكْرِمَةَ، قَالَ حَدَّثَنِي الْحَجَّاجُ بْنُ عَمْرٍو، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ كُسِرَ أَوْ عَرِجَ فَقَدْ حَلَّ وَعَلَيْهِ حَجَّةٌ أُخْرَى ‏\"‏ ‏.‏ فَذَكَرْتُ ذَلِكَ لأَبِي هُرَيْرَةَ وَابْنِ عَبَّاسٍ فَقَالاَ صَدَقَ ‏.‏ \nحَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ، عَنِ الْحَجَّاجِ، مِثْلَهُ ‏.‏ قَالَ وَسَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُهُ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ هَكَذَا رَوَاهُ غَيْرُ وَاحِدٍ عَنِ الْحَجَّاجِ الصَّوَّافِ نَحْوَ هَذَا الْحَدِيثِ ‏.‏ وَرَوَى مَعْمَرٌ وَمُعَاوِيَةُ بْنُ سَلاَّمٍ هَذَا الْحَدِيثَ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عِكْرِمَةَ عَنْ عَبْدِ اللَّهِ بْنِ رَافِعٍ عَنِ الْحَجَّاجِ بْنِ عَمْرٍو عَنِ النَّبِيِّ صلى الله عليه وسلم هَذَا الْحَدِيثَ ‏.‏ وَحَجَّاجٌ الصَّوَّافُ لَمْ يَذْكُرْ فِي حَدِيثِهِ عَبْدَ اللَّهِ بْنَ رَافِعٍ ‏.‏ وَحَجَّاجٌ ثِقَةٌ حَافِظٌ عِنْدَ أَهْلِ الْحَدِيثِ ‏.‏ وَسَمِعْتُ مُحَمَّدًا يَقُولُ رِوَايَةُ مَعْمَرٍ وَمُعَاوِيَةَ بْنِ سَلاَّمٍ أَصَحُّ ‏.‏\nحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عِكْرِمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ رَافِعٍ، عَنِ الْحَجَّاجِ بْنِ عَمْرٍو، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏",
    "malay_translation": "Kami diberitakan oleh Ishak bin Mansur, yang memberitakan kepada kami Ruh bin Ubadah, yang memberitakan kepada kami Hajjaj As-Sawafi, yang memberitakan kepada kami Yahya bin Abi Katsir, daripada Ikrimah, katanya: Hajjaj bin Amr telah memberitakan kepadaku, katanya: Rasulullah SAW bersabda: \"Barangsiapa yang mengalami patah tulang atau menjadi timpang, maka dia telah dihalalkan (daripada ihram) dan wajib ke atasnya mengerjakan haji yang lain.\" Maka aku ceritakan hal itu kepada Abu Hurairah dan Ibnu Abbas, lalu mereka berdua berkata: \"Dia benar.\"  Kami diberitakan oleh Ishak bin Mansur, yang memberitakan kepada kami Muhammad bin Abdullah Al-Ansari, daripada Hajjaj, seumpamanya. Dia berkata: dan aku telah mendengar Rasulullah SAW menyebutkannya. Abu Isa berkata: Ini adalah hadis yang hasan.  Begitulah diriwayatkan oleh lebih daripada seorang daripada Hajjaj As-Sawafi hampir sama dengan hadis ini.  Dan Ma'mar dan Mu'awiyah bin Sallam meriwayatkan hadis ini daripada Yahya bin Abi Katsir, daripada Ikrimah, daripada Abdullah bin Rafi', daripada Hajjaj bin Amr, daripada Nabi SAW, hadis ini. Dan Hajjaj As-Sawafi tidak menyebut dalam hadisnya Abdullah bin Rafi'. Dan Hajjaj adalah seorang yang dipercayai dan pemelihara hafalan menurut ahli hadis. Dan aku mendengar Muhammad berkata: Riwayat Ma'mar dan Mu'awiyah bin Sallam adalah lebih sahih. Kami diberitakan oleh Abd bin Humaid, yang memberitakan kepada kami Abdur Razzaq, yang memberitakan kepada kami Ma'mar, daripada Yahya bin Abi Katsir, daripada Ikrimah, daripada Abdullah bin Rafi', daripada Hajjaj bin Amr, daripada Nabi SAW, hampir sama dengannya."
  },
  {
    "id": 26722,
    "hadith_number": 942,
    "tajuk_hadith": "Syarat dalam Haji",
    "perawi_melayu": "Ibn Abbas meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ الْبَغْدَادِيُّ، حَدَّثَنَا عَبَّادُ بْنُ عَوَّامٍ، عَنْ هِلاَلِ بْنِ خَبَّابٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ ضُبَاعَةَ بِنْتَ الزُّبَيْرِ، أَتَتِ النَّبِيَّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي أُرِيدُ الْحَجَّ أَفَأَشْتَرِطُ قَالَ ‏\"‏ نَعَمْ ‏\"‏ ‏.‏ قَالَتْ كَيْفَ أَقُولُ قَالَ ‏\"‏ قُولِي لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ لَبَّيْكَ مَحِلِّي مِنَ الأَرْضِ حَيْثُ تَحْبِسُنِي ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ جَابِرٍ وَأَسْمَاءَ بِنْتِ أَبِي بَكْرٍ وَعَائِشَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ يَرَوْنَ الاِشْتِرَاطَ فِي الْحَجِّ وَيَقُولُونَ إِنِ اشْتَرَطَ فَعَرَضَ لَهُ مَرَضٌ أَوْ عُذْرٌ فَلَهُ أَنْ يَحِلَّ وَيَخْرُجَ مِنْ إِحْرَامِهِ ‏.‏ وَهُوَ قَوْلُ الشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏ وَلَمْ يَرَ بَعْضُ أَهْلِ الْعِلْمِ الاِشْتِرَاطَ فِي الْحَجِّ وَقَالُوا إِنِ اشْتَرَطَ فَلَيْسَ لَهُ أَنْ يَخْرُجَ مِنْ إِحْرَامِهِ ‏.‏ وَيَرَوْنَهُ كَمَنْ لَمْ يَشْتَرِطْ ‏.‏",
    "malay_translation": "Ziyad bin Ayub al-Baghdadi telah meriwayatkan daripada ‘Abbad bin ‘Awwam, daripada Hilal bin Khabbab, daripada ‘Ikrimah, daripada Ibnu ‘Abbas bahawa Dubabah binti Az-Zubair telah datang kepada Nabi SAW lalu berkata: \"Wahai Rasulullah, saya ingin mengerjakan haji, bolehkah saya membuat syarat?\" Baginda menjawab: \"Boleh.\"  Dubabah bertanya: \"Bagaimana caranya saya menyebutkannya?\" Baginda menjawab: \"Katakanlah: “Labbaikallahumma labbaik, labbaik laa syarika laka labbaik, innal hamda wan-ni’mata laka wal mulk, laa syarika lak.” (Aku memenuhi panggilan-Mu, ya Allah, aku memenuhi panggilan-Mu, aku memenuhi panggilan-Mu, tiada sekutu bagi-Mu, aku memenuhi panggilan-Mu, sesungguhnya segala puji dan nikmat adalah kepunyaan-Mu dan juga pemerintahan, tiada sekutu bagi-Mu.)  Mahalli mina al-ardhi haitsu tahbisuni (tempatku di bumi di mana Engkau halangi aku).\"  Juga diriwayatkan dalam bab ini daripada Jabir, Asma’ binti Abi Bakar dan Aisyah. Abu Isa berkata: Hadis Ibnu ‘Abbas ini adalah hadis yang hasan sahih.  Amalan berdasarkan hadis ini ada di kalangan sebahagian ulama yang membenarkan syarat dalam haji dan mereka berkata: sekiranya seseorang itu membuat syarat, lalu dia ditimpa sakit atau ada uzur, maka dia dibolehkan untuk keluar daripada ihramnya.  Ini merupakan pendapat Syafie, Ahmad dan Ishak.  Segelintir ulama pula tidak membenarkan syarat dalam haji dan mereka berkata: sekiranya seseorang itu membuat syarat, maka dia tidak dibenarkan keluar daripada ihramnya.  Mereka berpendapat bahawa orang yang membuat syarat itu sama seperti orang yang tidak membuat syarat."
  },
  {
    "id": 26723,
    "hadith_number": 943,
    "tajuk_hadith": "Cukuplah Sunnah Nabi dalam Haji",
    "perawi_melayu": "Salim meriwayatkan bahawa:",
    "english_text": "His father disliked making a condition during Hajj and he said: 'Is not the Sunnah of your Prophet enough for you?'",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَخْبَرَنِي مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يُنْكِرُ الاِشْتِرَاطَ فِي الْحَجِّ وَيَقُولُ أَلَيْسَ حَسْبُكُمْ سُنَّةَ نَبِيِّكُمْ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Bapanya tidak menyukai syarat-syarat tambahan dalam ibadah haji dan beliau berkata: \"Bukankah sunnah Nabi kamu sudah memadai untuk kamu?\"."
  },
  {
    "id": 26724,
    "hadith_number": 944,
    "tajuk_hadith": "Haid Safiah di Mina",
    "perawi_melayu": "Aisyah meriwayatkan:",
    "english_text": "\"It was mentioned to the Messenger of Allah that Safiyyah bint Huyai got her menses during the days of Mina, so he said: \"Will she prevent us (from departing)?\" They said: \"She has done (Tawaf) Al-Ifadah/\" So the Messenger of Allah said: \"In that case there is no harm.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ ذَكَرْتُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّ صَفِيَّةَ بِنْتَ حُيَىٍّ حَاضَتْ فِي أَيَّامِ مِنًى ‏.‏ فَقَالَ ‏\"‏ أَحَابِسَتُنَا هِيَ ‏\"‏ ‏.‏ قَالُوا إِنَّهَا قَدْ أَفَاضَتْ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَلاَ إِذًا ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عُمَرَ وَابْنِ عَبَّاسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَائِشَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ أَنَّ الْمَرْأَةَ إِذَا طَافَتْ طَوَافَ الزِّيَارَةِ ثُمَّ حَاضَتْ فَإِنَّهَا تَنْفِرُ وَلَيْسَ عَلَيْهَا شَيْءٌ ‏.‏ وَهُوَ قَوْلُ الثَّوْرِيِّ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏",
    "malay_translation": "Telah disebutkan kepada Rasulullah SAW bahawa Safiah binti Huyai mengalami haid pada hari-hari Mina. Maka Baginda bertanya, \"Adakah dia akan menghalang kita (daripada berangkat)?\" Mereka menjawab, \"Dia telah melakukan tawaf Ifadah.\" Maka Rasulullah SAW bersabda, \"Maka tidak mengapa.\" "
  },
  {
    "id": 26725,
    "hadith_number": 945,
    "tajuk_hadith": "Aktiviti Akhir Haji di Baitullah",
    "perawi_melayu": "Ibnu Umar berkata:",
    "english_text": "\"Whoever performs Hajj to the House, then let the last of their acts be at the House, except for menstruating women. The Messenger of Allah gave them permission (to leave).\" (Sahih Mawquf)",
    "arabic_text": "حَدَّثَنَا أَبُو عَمَّارٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ مَنْ حَجَّ الْبَيْتَ فَلْيَكُنْ آخِرُ عَهْدِهِ بِالْبَيْتِ إِلاَّ الْحُيَّضَ وَرَخَّصَ لَهُنَّ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ ‏.‏",
    "malay_translation": "Daripada Ibnu Umar, beliau berkata: “Barangsiapa menunaikan haji ke Baitullah, maka hendaklah amalan terakhirnya di Baitullah, kecuali bagi wanita yang sedang haid. Rasulullah SAW telah memberi keringanan kepada mereka (untuk meninggalkan Baitullah).” (Sahih Mawquf)"
  },
  {
    "id": 26726,
    "hadith_number": 946,
    "tajuk_hadith": "Ibadah Haji Ketika Haid",
    "perawi_melayu": "Aisyah meriwayatkan:",
    "english_text": "\"I got my menses do the Prophet ordered me to carry out all the rites except for Tawaf around the House.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا شَرِيكٌ، عَنْ جَابِرٍ، وَهُوَ ابْنُ يَزِيدَ الْجُعْفِيُّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَسْوَدِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ حِضْتُ فَأَمَرَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ أَقْضِيَ الْمَنَاسِكَ كُلَّهَا إِلاَّ الطَّوَافَ بِالْبَيْتِ ‏.‏ قَالَ أَبُو عِيسَى الْعَمَلُ عَلَى هَذَا الْحَدِيثِ عِنْدَ أَهْلِ الْعِلْمِ أَنَّ الْحَائِضَ تَقْضِي الْمَنَاسِكَ كُلَّهَا مَا خَلاَ الطَّوَافَ بِالْبَيْتِ ‏.‏ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ عَائِشَةَ مِنْ غَيْرِ هَذَا الْوَجْهِ أَيْضًا ‏.‏",
    "malay_translation": "Aisyah berkata: “Saya datang haid, maka Rasulullah ﷺ menyuruh saya menunaikan semua manasik kecuali tawaf di Baitullah.”  Abu Isa berkata: Amalan berdasarkan hadis ini menurut ahli ilmu ialah bahawa perempuan yang haid menunaikan semua manasik kecuali tawaf di Baitullah.  Hadis ini juga diriwayatkan daripada Aisyah melalui jalan yang lain."
  },
  {
    "id": 26727,
    "hadith_number": 947,
    "tajuk_hadith": "Ibadah Haji Wanita Haid dan Nifas",
    "perawi_melayu": "Ibn Abbas meriwayatkan :",
    "english_text": "(that the Prophet said): \"The women in past-natal bleeding and menses were to perform Ghusl, enter Ihram and carry out all of the rites except for Tawaf around the House, until they becomes clean.\"",
    "arabic_text": "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ، حَدَّثَنَا مَرْوَانُ بْنُ شُجَاعٍ الْجَزَرِيُّ، عَنْ خُصَيْفٍ، عَنْ عِكْرِمَةَ، وَمُجَاهِدٍ، وَعَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، رَفَعَ الْحَدِيثَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَنَّ النُّفَسَاءَ وَالْحَائِضَ تَغْتَسِلُ وَتُحْرِمُ وَتَقْضِي الْمَنَاسِكَ كُلَّهَا غَيْرَ أَنْ لاَ تَطُوفَ بِالْبَيْتِ حَتَّى تَطْهُرَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Wanita yang mengalami nifas dan haid hendaklah berwuduk, berihram, dan menunaikan semua manasik haji kecuali tawaf di Baitullah sehingga mereka suci.\""
  },
  {
    "id": 26728,
    "hadith_number": 948,
    "tajuk_hadith": "Akhiri Ibadah Haji atau Umrah di Baitullah",
    "perawi_melayu": "Al-Harith bin Abdullah bin Aws berkata:",
    "english_text": "\"I heard the Prophet saying: 'Whoever performs Hajj to this House, or Umrah, then let the last of his acts be at the House'\" So Umar said: \"May your hand be humiliated! You heard this from the Messenger of Allah but did not inform us of it?\"",
    "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَبْدِ الرَّحْمَنِ الْكُوفِيُّ، حَدَّثَنَا الْمُحَارِبِيُّ، عَنِ الْحَجَّاجِ بْنِ أَرْطَاةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ الْمُغِيرَةِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْبَيْلَمَانِيِّ، عَنْ عَمْرِو بْنِ أَوْسٍ، عَنِ الْحَارِثِ بْنِ عَبْدِ اللَّهِ بْنِ أَوْسٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ حَجَّ هَذَا الْبَيْتَ أَوِ اعْتَمَرَ فَلْيَكُنْ آخِرُ عَهْدِهِ بِالْبَيْتِ ‏\"‏ ‏.‏ فَقَالَ لَهُ عُمَرُ خَرَرْتَ مِنْ يَدَيْكَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلَمْ تُخْبِرْنَا بِهِ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ الْحَارِثِ بْنِ عَبْدِ اللَّهِ بْنِ أَوْسٍ حَدِيثٌ غَرِيبٌ ‏.‏ وَهَكَذَا رَوَى غَيْرُ وَاحِدٍ عَنِ الْحَجَّاجِ بْنِ أَرْطَاةَ مِثْلَ هَذَا وَقَدْ خُولِفَ الْحَجَّاجُ فِي بَعْضِ هَذَا الإِسْنَادِ ‏.‏",
    "malay_translation": "Aku mendengar Nabi SAW bersabda: “Barangsiapa menunaikan haji ke Baitullah ini atau umrah, maka hendaklah perbuatan terakhirnya di Baitullah.”  Maka Umar berkata: “Celaka engkau! Engkau mendengar ini daripada Rasulullah SAW, tetapi engkau tidak memberitahu kami?”"
  },
  {
    "id": 26729,
    "hadith_number": 949,
    "tajuk_hadith": "Qaran Haji dan Umrah",
    "perawi_melayu": "Jabir meriwayatkan:",
    "english_text": "\"The Messenger of Allah performed Qaran for Hajj and Umrah, so he performed one Tawaf for both of them.\"",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْحَجَّاجِ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَرَنَ الْحَجَّ وَالْعُمْرَةَ فَطَافَ لَهُمَا طَوَافًا وَاحِدًا ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عُمَرَ وَابْنِ عَبَّاسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ جَابِرٍ حَدِيثٌ حَسَنٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ قَالُوا الْقَارِنُ يَطُوفُ طَوَافًا وَاحِدًا ‏.‏ وَهُوَ قَوْلُ الشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ يَطُوفُ طَوَافَيْنِ وَيَسْعَى سَعْيَيْنِ ‏.‏ وَهُوَ قَوْلُ الثَّوْرِيِّ وَأَهْلِ الْكُوفَةِ ‏.‏",
    "malay_translation": "Rasulullah SAW menggabungkan haji dan umrah, lalu baginda melakukan tawaf sekali sahaja untuk kedua-duanya."
  },
  {
    "id": 26730,
    "hadith_number": 950,
    "tajuk_hadith": "Tawaf dan Saie untuk Haji dan Umrah",
    "perawi_melayu": "Ibn Umar meriwayatkan bahawa:",
    "english_text": "The Messenger of Allah said: \"Whoever assumes Ihram for Hajj and Umrah, then it is acceptable for him to perform one Tawaf and one Sa'I for them both, until he exits Ihram for both of them together.\"",
    "arabic_text": "حَدَّثَنَا خَلاَّدُ بْنُ أَسْلَمَ الْبَغْدَادِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ أَحْرَمَ بِالْحَجِّ وَالْعُمْرَةِ أَجْزَأَهُ طَوَافٌ وَاحِدٌ وَسَعْىٌ وَاحِدٌ عَنْهُمَا حَتَّى يَحِلَّ مِنْهُمَا جَمِيعًا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ تَفَرَّدَ بِهِ الدَّرَاوَرْدِيُّ عَلَى ذَلِكَ اللَّفْظِ ‏.‏ وَقَدْ رَوَاهُ غَيْرُ وَاحِدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ وَلَمْ يَرْفَعُوهُ ‏.‏ وَهُوَ أَصَحُّ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Barang siapa yang berihram untuk haji dan umrah, maka cukup baginya satu tawaf dan satu saie untuk keduanya sehingga dia selesai daripada ihram untuk kedua-duanya bersamaan.\""
  },
  {
    "id": 26731,
    "hadith_number": 951,
    "tajuk_hadith": "Tempoh Izin Berada di Mekah Selepas Menunaikan Haji",
    "perawi_melayu": "Al-Ala' bin Al-Hadrami meriwayatkan :",
    "english_text": "(that the Prophet said): \"The Muhajir may stay for three (days) in Makkah after carrying out his rites.\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ حُمَيْدٍ، سَمِعَ السَّائِبَ بْنَ يَزِيدَ، عَنِ الْعَلاَءِ بْنِ الْحَضْرَمِيِّ يَعْنِي مَرْفُوعًا، قَالَ ‏\n\"‏ يَمْكُثُ الْمُهَاجِرُ بَعْدَ قَضَاءِ نُسُكِهِ بِمَكَّةَ ثَلاَثًا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ مِنْ غَيْرِ هَذَا الْوَجْهِ بِهَذَا الإِسْنَادِ مَرْفُوعًا ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Mani', telah menceritakan kepada kami Sufian bin Uyainah, daripada Abdur Rahman bin Humaid, telah mendengar Sa'ib bin Yazid, daripada Al-Ala' bin Al-Hadrami (maksudnya: hadis yang diriwayatkan daripada Nabi SAW),  berkata: \"Muhajir dibenarkan menetap di Mekah selama tiga hari selepas menunaikan ibadahnya.\""
  },
  {
    "id": 26732,
    "hadith_number": 952,
    "tajuk_hadith": "Doa Nabi SAW Selepas Pulang Dari Pertempuran, Haji atau Umrah",
    "perawi_melayu": "Ibn Umar berkata:",
    "english_text": "\"When the Prophet would come home from a battle, or Hajj, or Umrah, when he was it a tract of land or raised area he would say 'Allahu Akbar (Allah is Most Great)' three times, then say: 'La Ilaha illallah Wahdahu la sharika lahu, lahul-mulku wa lahul-Hamdu wa Huwa ala kulli shai'in qadir. A'ibuna ta'ibun abidun saa'ihuna li Rabbina Hamiduna, Sadaqallahu wa'dahu wa nasara abdahu wa hazamal-ahzab Wahdah. (None has the right to be worshiped but Allah Alone without partners. To Him belongs the sovereignty and to Him belongs the praise, and He has power over all things. We are returning, repenting, worshipping, traveling for our Lord, and we are praising. Allah has told the truth, and kept His promise and helped His worshipper, and routed the confederates, Alone.'\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا قَفَلَ مِنْ غَزْوَةٍ أَوْ حَجٍّ أَوْ عُمْرَةٍ فَعَلاَ فَدْفَدًا مِنَ الأَرْضِ أَوْ شَرَفًا كَبَّرَ ثَلاَثًا ثُمَّ قَالَ ‏\n\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ آيِبُونَ تَائِبُونَ عَابِدُونَ سَائِحُونَ لِرَبِّنَا حَامِدُونَ صَدَقَ اللَّهُ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الأَحْزَابَ وَحْدَهُ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنِ الْبَرَاءِ وَأَنَسٍ وَجَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
    "malay_translation": "Daripada Ibnu Umar, beliau berkata bahawa Nabi SAW, apabila pulang dari peperangan, haji atau umrah, sekiranya Baginda berada di atas tanah lapang atau tempat tinggi, Baginda akan mengagungkan Allah sebanyak tiga kali, kemudian Baginda berdoa: \"La ilaha illallah wahdahu la sharika lahul mulku wa lahul hamdu wa huwa 'ala kulli syai'in qadir. A'ibuna ta'ibun 'abidun sa'ihuna li Rabbina Hamidun. Sadaqallahu wa'dahu wa nasara 'abdahuu wa hazamal ahzab wahdah.\" (Tiada Tuhan melainkan Allah, yang Esa, tiada sekutu bagi-Nya, bagi-Nya pemerintahan dan bagi-Nya pujian, dan Dia Maha Kuasa atas segala sesuatu. Kami kembali, bertaubat, beribadah, berjalan untuk Tuhan kami, dan kami memuji-Nya. Allah telah benar janji-Nya, dan menolong hamba-Nya, dan menewaskan kaum musyrikin sendirian.)"
  },
  {
    "id": 26733,
    "hadith_number": 953,
    "tajuk_hadith": "Pengurusan Jenazah Jemaah Haji yang Meninggal Dunia Ketika Dalam Perjalanan",
    "perawi_melayu": "Ibn Abbas meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي سَفَرٍ فَرَأَى رَجُلاً قَدْ سَقَطَ عَنْ بَعِيرِهِ فَوُقِصَ فَمَاتَ وَهُوَ مُحْرِمٌ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ وَكَفِّنُوهُ فِي ثَوْبَيْهِ وَلاَ تُخَمِّرُوا رَأْسَهُ فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ يُهِلُّ أَوْ يُلَبِّي ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ إِذَا مَاتَ الْمُحْرِمُ انْقَطَعَ إِحْرَامُهُ وَيُصْنَعُ بِهِ كَمَا يُصْنَعُ بِغَيْرِ الْمُحْرِمِ ‏.‏",
    "malay_translation": "Kami bersama Rasulullah SAW ketika dalam perjalanan, baginda melihat seorang lelaki jatuh dari untanya, lehernya patah dan meninggal dunia, sedang dia dalam keadaan ihram. Maka Rasulullah SAW bersabda: \"Mandikanlah dia dengan air dan daun sidr, kafankanlah dia dengan pakaiannya, dan janganlah kamu tutup kepalanya, kerana sesungguhnya dia akan dibangkitkan pada hari kiamat dalam keadaan sedang melafazkan talbiyah.\""
  },
  {
    "id": 26734,
    "hadith_number": 954,
    "tajuk_hadith": "Mengubati Mata Dengan Lidah Buaya Ketika Ihram",
    "perawi_melayu": "Nubaih bin Wahb meriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَيُّوبَ بْنِ مُوسَى، عَنْ نُبَيْهِ بْنِ وَهْبٍ، أَنَّ عُمَرَ بْنَ عُبَيْدِ اللَّهِ بْنِ مَعْمَرٍ، اشْتَكَى عَيْنَيْهِ وَهُوَ مُحْرِمٌ فَسَأَلَ أَبَانَ بْنَ عُثْمَانَ فَقَالَ اضْمِدْهُمَا بِالصَّبِرِ فَإِنِّي سَمِعْتُ عُثْمَانَ بْنَ عَفَّانَ، يَذْكُرُهَا عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ اضْمِدْهُمَا بِالصَّبِرِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ لاَ يَرَوْنَ بَأْسًا أَنْ يَتَدَاوَى الْمُحْرِمُ بِدَوَاءٍ مَا لَمْ يَكُنْ فِيهِ طِيبٌ ‏.‏",
    "malay_translation": "Umar bin Ubaidullah bin Ma'mar mengadu sakit matanya ketika dalam keadaan ihram.  Dia bertanya kepada Aban bin Uthman, lalu dijawabnya: \"Balutlah dengan lidah buaya, kerana aku pernah mendengar Uthman bin Affan menyebut bahawa Rasulullah SAW bersabda: 'Balutlah dengan lidah buaya.'\""
  },
  {
    "id": 26735,
    "hadith_number": 955,
    "tajuk_hadith": "Kafaarah Kerana Memotong Rambut Semasa Ihram",
    "perawi_melayu": "Abd al-Rahman bin Abi Laila meriwayatkan daripada Ka'b bin Ujrah bahawa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ، وَابْنِ أَبِي نَجِيحٍ، وَحُمَيْدٍ الأَعْرَجِ، وَعَبْدِ الْكَرِيمِ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم مَرَّ بِهِ وَهُوَ بِالْحُدَيْبِيَةِ قَبْلَ أَنْ يَدْخُلَ مَكَّةَ وَهُوَ مُحْرِمٌ وَهُوَ يُوقِدُ تَحْتَ قِدْرٍ وَالْقَمْلُ يَتَهَافَتُ عَلَى وَجْهِهِ فَقَالَ ‏\"‏ أَتُؤْذِيكَ هَوَامُّكَ هَذِهِ ‏\"‏ ‏.‏ فَقَالَ نَعَمْ ‏.‏ فَقَالَ ‏\"‏ احْلِقْ وَأَطْعِمْ فَرَقًا بَيْنَ سِتَّةِ مَسَاكِينَ ‏\"‏ ‏.‏ وَالْفَرَقُ ثَلاَثَةُ آصُعٍ ‏\"‏ أَوْ صُمْ ثَلاَثَةَ أَيَّامٍ أَوِ انْسُكْ نَسِيكَةً ‏\"‏ ‏.‏ قَالَ ابْنُ أَبِي نَجِيحٍ ‏\"‏ أَوِ اذْبَحْ شَاةً ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَيْهِ عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ أَنَّ الْمُحْرِمَ إِذَا حَلَقَ رَأْسَهُ أَوْ لَبِسَ مِنَ الثِّيَابِ مَا لاَ يَنْبَغِي لَهُ أَنْ يَلْبَسَ فِي إِحْرَامِهِ أَوْ تَطَيَّبَ فَعَلَيْهِ الْكَفَّارَةُ بِمِثْلِ مَا رُوِيَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Kami telah diberitakan oleh Ibnu Abi Umar, yang telah diberitakan oleh Sufyan bin Uyainah, daripadaAyyub al-Sakhtiyani, dan Ibnu Abi Naji, dan Humaid al-A'raj, dan Abd al-Karim, daripada Mujahid, daripada Abd al-Rahman bin Abi Laila, daripada Ka'b bin Ujrah, bahawa Nabi SAW telah melalui seorang lelaki di Hudaibiyyah sebelum memasuki Mekah ketika lelaki itu dalam keadaan ihram. Lelaki itu sedang menyalakan api di bawah periuk dan kutu-kutu berjatuhan di mukanya.  Maka Nabi SAW bersabda: \"Adakah kutu-kutumu ini mengganggu kamu?\"  Lelaki itu menjawab: \"Ya.\"  Nabi SAW bersabda: \"Cukurlah rambutmu dan bersedekahlah satu faraq kepada enam orang miskin.\" Dan satu faraq ialah tiga sa'  \"atau berpuasalah tiga hari, atau sembelihlah seekor haiwan korban.\" Ibnu Abi Naji berkata: \"Atau sembelihlah seekor kambing.\" Abu Isa berkata:  Hadis ini adalah hadis yang baik dan sahih. Amalan terhadapnya ada pada sebahagian ulama daripada sahabat-sahabat Nabi SAW dan selainnya, iaitu sekiranya orang yang berihram mencukur kepalanya atau memakai pakaian yang tidak sepatutnya dipakai ketika ihram, atau memakai minyak wangi, maka dia wajib membayar kaffarah seperti yang diriwayatkan daripada Nabi SAW."
  },
  {
    "id": 26736,
    "hadith_number": 956,
    "tajuk_hadith": "Keizinan Nabi SAW Mengenai Penggembalaan",
    "perawi_melayu": "Abi Al-Baddah bin Adi meriwayatkan daripada bapanya:",
    "english_text": "\"The Prophet permitted the shepherds to stone a day and leave a day.\"",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ أَبِيهِ، عَنْ أَبِي الْبَدَّاحِ بْنِ عَدِيٍّ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَرْخَصَ لِلرِّعَاءِ أَنْ يَرْمُوا يَوْمًا وَيَدَعُوا يَوْمًا ‏.‏ قَالَ أَبُو عِيسَى هَكَذَا رَوَى ابْنُ عُيَيْنَةَ ‏.‏ وَرَوَى مَالِكُ بْنُ أَنَسٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ أَبِيهِ عَنْ أَبِي الْبَدَّاحِ بْنِ عَاصِمِ بْنِ عَدِيٍّ عَنْ أَبِيهِ ‏.‏ وَرِوَايَةُ مَالِكٍ أَصَحُّ ‏.‏ وَقَدْ رَخَّصَ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ لِلرِّعَاءِ أَنْ يَرْمُوا يَوْمًا وَيَدَعُوا يَوْمًا وَهُوَ قَوْلُ الشَّافِعِيِّ ‏.‏",
    "malay_translation": "Nabi Muhammad SAW telah membenarkan para gembala untuk  melakukan kerja mereka sehari dan berehat sehari."
  },
  {
    "id": 26737,
    "hadith_number": 957,
    "tajuk_hadith": "Keizinan Rasullullah SAW Bagi Pengembala Unta Melontar Jamrah",
    "perawi_melayu": "Abi Al-Baddah bin Asim bin Adi meriwayatkan daripada bapanya:",
    "english_text": "\"The Messenger of Allah permitted the camel herders who were in the camp (at Mina) to stone on the Day of An-Nahr then to gather the stoning of two days after the Day of An-Nahr, so that they stoned them during one of them.\" Malik said: \"I think that he said about the first of them: 'They they should stone on the day of departure.'\"",
    "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَالِكُ بْنُ أَنَسٍ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ، عَنْ أَبِيهِ، عَنْ أَبِي الْبَدَّاحِ بْنِ عَاصِمِ بْنِ عَدِيٍّ، عَنْ أَبِيهِ، قَالَ رَخَّصَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِرِعَاءِ الإِبِلِ فِي الْبَيْتُوتَةِ أَنْ يَرْمُوا يَوْمَ النَّحْرِ ثُمَّ يَجْمَعُوا رَمْىَ يَوْمَيْنِ بَعْدَ يَوْمِ النَّحْرِ فَيَرْمُونَهُ فِي أَحَدِهِمَا ‏.‏ قَالَ مَالِكٌ ظَنَنْتُ أَنَّهُ قَالَ فِي الأَوَّلِ مِنْهُمَا ثُمَّ يَرْمُونَ يَوْمَ النَّفْرِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَهُوَ أَصَحُّ مِنْ حَدِيثِ ابْنِ عُيَيْنَةَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ ‏.‏",
    "malay_translation": "Rasulullah SAW telah memberi kelonggaran kepada pengembala unta yang berada di khemah (di Mina) untuk melontar jamrah pada Hari Nahar, kemudian menggabungkan lontaran dua hari selepas Hari Nahar, supaya mereka melontarnya pada salah satu hari tersebut. Malik berkata: \"Saya fikir baginda telah berkata tentang yang pertama daripada mereka: ‘Mereka hendaklah melontar pada hari berlepas.’\""
  },
  {
    "id": 26738,
    "hadith_number": 958,
    "tajuk_hadith": "Talbiyah dan Haji",
    "perawi_melayu": "Anas bin Malik meriwayatkan:",
    "english_text": "\"When Ali returned to the Messenger of Allah from Yemen he said: 'For what did you intended the Talbiyah?' He replied: 'I intended the Talbiyah for what the Messenger of Allah announced it.' So he (pbuh) said: 'If I did not have the Hadi with me then I would exit Ihram.'\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ بْنِ عَبْدِ الْوَارِثِ، حَدَّثَنِي أَبِي، حَدَّثَنَا سَلِيمُ بْنُ حَيَّانَ، قَالَ سَمِعْتُ مَرْوَانَ الأَصْفَرَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ عَلِيًّا، قَدِمَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم مِنَ الْيَمَنِ فَقَالَ ‏\"‏ بِمَ أَهْلَلْتَ ‏\"‏ ‏.‏ قَالَ أَهْلَلْتُ بِمَا أَهَلَّ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ ‏\"‏ لَوْلاَ أَنَّ مَعِي هَدْيًا لأَحْلَلْتُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏",
    "malay_translation": "Apabila Ali kembali kepada Rasulullah SAW dari Yaman, baginda bertanya, \"Apakah niatmu ketika melafazkan talbiyah?\" Jawab Ali, \"Niatku ketika melafazkan talbiyah adalah sama seperti yang Rasulullah SAW lafazkan.\"  Lalu baginda (SAW) berkata, \"Sekiranya aku tidak membawa hadyu (hewan korban), nescaya aku akan keluar daripada ihram.\""
  },
  {
    "id": 26739,
    "hadith_number": 959,
    "tajuk_hadith": "Hari Haji yang Paling Agung",
    "perawi_melayu": "Ali meriwayatkan:",
    "english_text": "\"I asked the Messenger of Allah about the day of Al-Hajj Al-Akbar and he said: 'They Day of An-Nahr.'\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ بْنِ عَبْدِ الْوَارِثِ، حَدَّثَنَا أَبِي، عَنْ أَبِيهِ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْحَارِثِ، عَنْ عَلِيٍّ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ يَوْمِ الْحَجِّ الأَكْبَرِ فَقَالَ ‏\n\"‏ يَوْمُ النَّحْرِ ‏\"‏ ‏.‏",
    "malay_translation": "Aku bertanya kepada Rasulullah SAW tentang hari Haji yang paling agung, maka baginda menjawab: \"Hari penyembelihan korban.\""
  },
  {
    "id": 26740,
    "hadith_number": 960,
    "tajuk_hadith": "Hari Haji yang Paling Agung ialah Hari Raya Korban",
    "perawi_melayu": "Daripada Ali r.a.",
    "english_text": "\"They day of Al-Hajj Al-Akbar is the Day of An-Nahr.\"",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْحَارِثِ، عَنْ عَلِيٍّ، قَالَ يَوْمُ الْحَجِّ الأَكْبَرِ يَوْمُ النَّحْرِ ‏.‏ قَالَ أَبُو عِيسَى وَلَمْ يَرْفَعْهُ وَهَذَا أَصَحُّ مِنَ الْحَدِيثِ الأَوَّلِ وَرِوَايَةُ ابْنِ عُيَيْنَةَ مَوْقُوفًا أَصَحُّ مِنْ رِوَايَةِ مُحَمَّدِ بْنِ إِسْحَاقَ مَرْفُوعًا ‏.‏ هَكَذَا رَوَى غَيْرُ وَاحِدٍ مِنَ الْحُفَّاظِ عَنْ أَبِي إِسْحَاقَ عَنِ الْحَارِثِ عَنْ عَلِيٍّ مَوْقُوفًا ‏.‏ وَقَدْ رَوَى شُعْبَةُ عَنْ أَبِي إِسْحَاقَ قَالَ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنِ الْحَارِثِ عَنْ عَلِيٍّ مَوْقُوفًا ‏.‏",
    "malay_translation": "Daripada Ali r.a. berkata:  Hari Haji yang paling agung ialah Hari Raya Korban.  Abu Isa berkata:  Hadis ini tidak diriwayatkan secara mursal (daripada Nabi SAW secara langsung), tetapi hadis ini lebih sahih daripada hadis yang sebelumnya. Riwayat Ibn Uyainah secara mauquf (daripada sahabat) lebih sahih daripada riwayat Muhammad bin Ishaq yang diriwayatkan secara marfu' (daripada Nabi SAW).  Demikianlah diriwayatkan oleh beberapa orang huffaz (para perawi hadis yang handal) daripada Abi Ishaq daripada Al-Harith daripada Ali secara mauquf.  Syu'bah meriwayatkan daripada Abi Ishaq yang berkata daripada Abdullah bin Murrah daripada Al-Harith daripada Ali secara mauquf."
  },
  {
    "id": 26741,
    "hadith_number": 961,
    "tajuk_hadith": "Keutamaan Mencium Dua Rukun Kaabah dan Tawaf",
    "perawi_melayu": "Ibn Ubaid bin Umair meriwayatkan daripada bapanya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرٌ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنِ ابْنِ عُبَيْدِ بْنِ عُمَيْرٍ، عَنْ أَبِيهِ، أَنَّ ابْنَ عُمَرَ، كَانَ يُزَاحِمُ عَلَى الرُّكْنَيْنِ زِحَامًا مَا رَأَيْتُ أَحَدًا مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم يَفْعَلُهُ ‏.‏ فَقُلْتُ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنَّكَ تُزَاحِمُ عَلَى الرُّكْنَيْنِ زِحَامًا مَا رَأَيْتُ أَحَدًا مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم يُزَاحِمُ عَلَيْهِ ‏.‏ فَقَالَ إِنْ أَفْعَلْ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِنَّ مَسْحَهُمَا كَفَّارَةٌ لِلْخَطَايَا ‏\"‏ ‏.‏ وَسَمِعْتُهُ يَقُولُ ‏\"‏ مَنْ طَافَ بِهَذَا الْبَيْتِ أُسْبُوعًا فَأَحْصَاهُ كَانَ كَعِتْقِ رَقَبَةٍ ‏\"‏ ‏.‏ وَسَمِعْتُهُ يَقُولُ ‏\"‏ لاَ يَضَعُ قَدَمًا وَلاَ يَرْفَعُ أُخْرَى إِلاَّ حَطَّ اللَّهُ عَنْهُ بِهَا خَطِيئَةً وَكَتَبَ لَهُ بِهَا حَسَنَةً ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى وَرَوَى حَمَّادُ بْنُ زَيْدٍ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنِ ابْنِ عُبَيْدِ بْنِ عُمَيْرٍ عَنِ ابْنِ عُمَرَ نَحْوَهُ ‏.‏ وَلَمْ يَذْكُرْ فِيهِ عَنْ أَبِيهِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏",
    "malay_translation": "Ibnu Umar sangat bersungguh-sungguh mencium kedua-dua rukun (dengan cara yang aku tidak pernah lihat sesiapa pun daripada sahabat Nabi melakukannya). Maka aku berkata: \"Wahai Abu Abdur-Rahman! Kamu sangat bersungguh-sungguh mencium kedua-dua rukun dengan cara yang aku tidak pernah lihat sesiapa pun daripada sahabat Nabi melakukannya.\"  Maka dia berkata: \"Aku melakukannya kerana aku mendengar Rasulullah SAW bersabda:  \"Sesungguhnya mencium kedua-duanya adalah penebus dosa.\" Dan aku mendengar baginda bersabda:  \"Barangsiapa yang melakukan tawaf mengelilingi rumah ini sebanyak tujuh kali dan dia menghitungnya, maka ia seolah-olah telah memerdekakan seorang hamba.\" Dan aku mendengar baginda bersabda: \"Tidaklah seseorang itu meletakkan kaki dan mengangkat kaki yang lain melainkan Allah menghapuskan darinya satu dosa dan menuliskan baginya satu kebaikan.\""
  },
  {
    "id": 26742,
    "hadith_number": 962,
    "tajuk_hadith": "Tawaf dan Percakapan",
    "perawi_melayu": "Ibn Abbas meriwayatkan bahawa:",
    "english_text": "the Prophet said: \"Tawaf around the House is similar to Salat except that you talk during it. So whoever talks in it, then let him not say but good.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرٌ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الطَّوَافُ حَوْلَ الْبَيْتِ مِثْلُ الصَّلاَةِ إِلاَّ أَنَّكُمْ تَتَكَلَّمُونَ فِيهِ فَمَنْ تَكَلَّمَ فِيهِ فَلاَ يَتَكَلَّمَنَّ إِلاَّ بِخَيْرٍ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى وَقَدْ رُوِي هَذَا الْحَدِيثُ عَنِ ابْنِ طَاوُسٍ وَغَيْرِهِ عَنْ طَاوُسٍ عَنِ ابْنِ عَبَّاسٍ مَوْقُوفًا ‏.‏ وَلاَ نَعْرِفُهُ مَرْفُوعًا إِلاَّ مِنْ حَدِيثِ عَطَاءِ بْنِ السَّائِبِ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ يَسْتَحِبُّونَ أَنْ لاَ يَتَكَلَّمَ الرَّجُلُ فِي الطَّوَافِ إِلاَّ لَحَاجَةٍ أَوْ بِذِكْرِ اللَّهِ تَعَالَى أَوْ مِنَ الْعِلْمِ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Tawaf mengelilingi Kaabah adalah seperti solat, kecuali bahawa kamu semua boleh bercakap di dalamnya.  Oleh itu, sesiapa yang bercakap di dalamnya, hendaklah dia tidak berkata melainkan kebaikan.\""
  },
  {
    "id": 26743,
    "hadith_number": 963,
    "tajuk_hadith": "Hajar Aswad pada Hari Kiamat",
    "perawi_melayu": "Ibn Abbas meriwayatkan bahawa:",
    "english_text": "The Messenger of Allah said about the (Black) Stone: \"By Allah! Allah will raise it on the Day of Resurrection with two eyes by which it sees and a tongue that it speaks with, testifying to whoever touched it in truth.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، عَنْ جَرِيرٍ، عَنِ ابْنِ خُثَيْمٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْحَجَرِ ‏\n\"‏ وَاللَّهِ لَيَبْعَثَنَّهُ اللَّهُ يَوْمَ الْقِيَامَةِ لَهُ عَيْنَانِ يُبْصِرُ بِهِمَا وَلِسَانٌ يَنْطِقُ بِهِ يَشْهَدُ عَلَى مَنِ اسْتَلَمَهُ بِحَقٍّ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda tentang Hajar Aswad:  \"Demi Allah! Allah SWT akan membangkitkannya pada Hari Kiamat nanti dengan dua biji mata yang dapat melihat dan lidah yang dapat bertutur, untuk memberi kesaksian kepada sesiapa yang menyentuhnya dengan benar.\""
  },
  {
    "id": 26744,
    "hadith_number": 964,
    "tajuk_hadith": "Nabi SAW Menggunakan Minyak Tidak Berwangian Ketika Ihram",
    "perawi_melayu": "Ibnu Umar meriwayatkan:",
    "english_text": "\"The Prophet would apply oil that is not scented (Ghair Muqattat) while he was a Muhrim.\"",
    "arabic_text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا وَكِيعٌ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ فَرْقَدٍ السَّبَخِيِّ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَدَّهِنُ بِالزَّيْتِ وَهُوَ مُحْرِمٌ غَيْرَ الْمُقَتَّتِ ‏.‏ قَالَ أَبُو عِيسَى الْمُقَتَّتُ الْمُطَيَّبُ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ فَرْقَدٍ السَّبَخِيِّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ ‏.‏ وَقَدْ تَكَلَّمَ يَحْيَى بْنُ سَعِيدٍ فِي فَرْقَدٍ السَّبَخِيِّ وَرَوَى عَنْهُ النَّاسُ ‏.‏",
    "malay_translation": "Daripada Ibnu Umar, bahawa Nabi SAW  menggunakan minyak yang tidak berwangian ketika dalam keadaan ihram. Abu Isa berkata, “Minyak yang berwangian ialah minyak yang telah diberi pewangi.”  Abu Isa juga berkata, “Hadis ini adalah hadis yang ganjil, kami tidak mengetahuinya melainkan daripada riwayat Farqad As-Sabakhi daripada Said Ibnu Jubair. Yahya Ibnu Said telah mengkritik Farqad As-Sabakhi, tetapi ramai orang meriwayatkan hadis daripada Farqad.”"
  },
  {
    "id": 26745,
    "hadith_number": 965,
    "tajuk_hadith": "Aisyah r.a. Membawa Air Zamzam",
    "perawi_melayu": "Hisham bin Urwah meriwayatkan :",
    "english_text": "from his father about Aishah, that she would carry some Zamzam water, and she would say: \"Indeed the Messenger of Allah would carry it.\"",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا خَلاَّدُ بْنُ يَزِيدَ الْجُعْفِيُّ، حَدَّثَنَا زُهَيْرُ بْنُ مُعَاوِيَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، رضى الله عنها أَنَّهَا كَانَتْ تَحْمِلُ مِنْ مَاءِ زَمْزَمَ وَتُخْبِرُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَحْمِلُهُ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏",
    "malay_translation": "Daripada bapanya tentang Aisyah r.a., bahawa beliau membawa sedikit air Zamzam, dan beliau berkata: \"Sesungguhnya Rasulullah SAW pun membawanya.\"."
  },
  {
    "id": 26746,
    "hadith_number": 966,
    "tajuk_hadith": "Solat Zuhur dan Asar Rasulullah SAW pada Hari Tarwiyah dan Hari Taufik",
    "perawi_melayu": "Abdul-Aziz bin Rufai meriwayatkan:",
    "english_text": "\"I said to Anas bin Malik: 'Narrated something to me that you understand about where the Messenger of Allah performed Zuhr on the Day of Tarwiyah.' He said: 'In Mina.'\" \"I said: 'So where did he pray Asr on the day of departure?' He said: 'In Al-Abtab.' Then he said: 'Do what your leaders do.'\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، وَمُحَمَّدُ بْنُ الْوَزِيرِ الْوَاسِطِيُّ الْمَعْنَى، وَاحِدٌ، قَالاَ حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ الأَزْرَقُ، عَنْ سُفْيَانَ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، قَالَ قُلْتُ لأَنَسِ بْنِ مَالِكٍ حَدِّثْنِي بِشَيْءٍ، عَقَلْتَهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَيْنَ صَلَّى الظُّهْرَ يَوْمَ التَّرْوِيَةِ قَالَ بِمِنًى ‏.‏ قَالَ قُلْتُ فَأَيْنَ صَلَّى الْعَصْرَ يَوْمَ النَّفْرِ قَالَ بِالأَبْطَحِ ‏.‏ ثُمَّ قَالَ افْعَلْ كَمَا يَفْعَلُ أُمَرَاؤُكَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ يُسْتَغْرَبُ مِنْ حَدِيثِ إِسْحَاقَ بْنِ يُوسُفَ الأَزْرَقِ عَنِ الثَّوْرِيِّ ‏.‏",
    "malay_translation": "Aku berkata kepada Anas bin Malik: “Ceritakan kepadaku sesuatu yang engkau fahami tentang di mana Rasulullah SAW menunaikan solat Zuhur pada Hari Tarwiyah.” Dia menjawab: “Di Mina.” Aku berkata: “Maka di mana baginda menunaikan solat Asar pada hari berlepas?” Dia menjawab: “Di Al-Abtah.” Kemudian dia berkata: “Lakukanlah apa yang dilakukan oleh pemimpin-pemimpinmu.”"
  }
]
