[
  {
    "id": 36532,
    "hadith_number": 369,
    "tajuk_hadith": "Peristiwa Bai'ah Abu Bakar dan Nasihat Umar",
    "perawi_melayu": "Ia diriwayatkan daripada Ubaidullah bin Abdullah bin Utbah bin Mas'ud bahawa Ibnu Abbas memberitahunya bahawa Abdur Rahman bin Auf kembali ke tempat perhentiannya. Ibnu Abbas berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى الطَّبَّاعُ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، حَدَّثَنِي ابْنُ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ ابْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ رَجَعَ إِلَى رَحْلِهِ قَالَ ابْنُ عَبَّاسٍ وَكُنْتُ أُقْرِئُ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ فَوَجَدَنِي وَأَنَا أَنْتَظِرُهُ، وَذَلِكَ، بِمِنًى فِي آخِرِ حَجَّةٍ حَجَّهَا عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ إِنَّ رَجُلًا أَتَى عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ فَقَالَ إِنَّ فُلَانًا يَقُولُ لَوْ قَدْ مَاتَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ بَايَعْتُ فُلَانًا فَقَالَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ إِنِّي قَائِمٌ الْعَشِيَّةَ فِي النَّاسِ فَمُحَذِّرُهُمْ هَؤُلَاءِ الرَّهْطَ الَّذِينَ يُرِيدُونَ أَنْ يَغْصِبُوهُمْ أَمْرَهُمْ قَالَ عَبْدُ الرَّحْمَنِ فَقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ لَا تَفْعَلْ فَإِنَّ الْمَوْسِمَ يَجْمَعُ رَعَاعَ النَّاسِ وَغَوْغَاءَهُمْ وَإِنَّهُمْ الَّذِينَ يَغْلِبُونَ عَلَى مَجْلِسِكَ إِذَا قُمْتَ فِي النَّاسِ فَأَخْشَى أَنْ تَقُولَ مَقَالَةً يَطِيرُ بِهَا أُولَئِكَ فَلَا يَعُوهَا وَلَا يَضَعُوهَا عَلَى مَوَاضِعِهَا وَلَكِنْ حَتَّى تَقْدَمَ الْمَدِينَةَ فَإِنَّهَا دَارُ الْهِجْرَةِ وَالسُّنَّةِ وَتَخْلُصَ بِعُلَمَاءِ النَّاسِ وَأَشْرَافِهِمْ فَتَقُولَ مَا قُلْتَ مُتَمَكِّنًا فَيَعُونَ مَقَالَتَكَ وَيَضَعُونَهَا مَوَاضِعَهَا فَقَالَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ لَئِنْ قَدِمْتُ الْمَدِينَةَ سَالِمًا صَالِحًا لَأُكَلِّمَنَّ بِهَا النَّاسَ فِي أَوَّلِ مَقَامٍ أَقُومُهُ فَلَمَّا قَدِمْنَا الْمَدِينَةَ فِي عَقِبِ ذِي الْحِجَّةِ وَكَانَ يَوْمَ الْجُمُعَةِ عَجَّلْتُ الرَّوَاحَ صَكَّةَ الْأَعْمَى فَقُلْتُ لِمَالِكٍ وَمَا صَكَّةُ الْأَعْمَى قَالَ إِنَّهُ لَا يُبَالِي أَيَّ سَاعَةٍ خَرَجَ لَا يَعْرِفُ الْحَرَّ وَالْبَرْدَ وَنَحْوَ هَذَا فَوَجَدْتُ سَعِيدَ بْنَ زَيْدٍ عِنْدَ رُكْنِ الْمِنْبَرِ الْأَيْمَنِ قَدْ سَبَقَنِي فَجَلَسْتُ حِذَاءَهُ تَحُكُّ رُكْبَتِي رُكْبَتَهُ فَلَمْ أَنْشَبْ أَنْ طَلَعَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ فَلَمَّا رَأَيْتُهُ قُلْتُ لَيَقُولَنَّ الْعَشِيَّةَ عَلَى هَذَا الْمِنْبَرِ مَقَالَةً مَا قَالَهَا عَلَيْهِ أَحَدٌ قَبْلَهُ قَالَ فَأَنْكَرَ سَعِيدُ بْنُ زَيْدٍ ذَلِكَ فَقَالَ مَا عَسَيْتَ أَنْ يَقُولَ مَا لَمْ يَقُلْ أَحَدٌ فَجَلَسَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ عَلَى الْمِنْبَرِ فَلَمَّا سَكَتَ الْمُؤَذِّنُ قَامَ فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ أَمَّا بَعْدُ أَيُّهَا النَّاسُ فَإِنِّي قَائِلٌ مَقَالَةً قَدْ قُدِّرَ لِي أَنْ أَقُولَهَا لَا أَدْرِي لَعَلَّهَا بَيْنَ يَدَيْ أَجَلِي فَمَنْ وَعَاهَا وَعَقَلَهَا فَلْيُحَدِّثْ بِهَا حَيْثُ انْتَهَتْ بِهِ رَاحِلَتُهُ وَمَنْ لَمْ يَعِهَا فَلَا أُحِلُّ لَهُ أَنْ يَكْذِبَ عَلَيَّ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى بَعَثَ مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْحَقِّ وَأَنْزَلَ عَلَيْهِ الْكِتَابَ وَكَانَ مِمَّا أَنْزَلَ عَلَيْهِ آيَةُ الرَّجْمِ فَقَرَأْنَاهَا وَوَعَيْنَاهَا وَرَجَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَجَمْنَا بَعْدَهُ فَأَخْشَى إِنْ طَالَ بِالنَّاسِ زَمَانٌ أَنْ يَقُولَ قَائِلٌ لَا نَجِدُ آيَةَ الرَّجْمِ فِي كِتَابِ اللَّهِ عَزَّ وَجَلَّ فَيَضِلُّوا بِتَرْكِ فَرِيضَةٍ قَدْ أَنْزَلَهَا اللَّهُ عَزَّ وَجَلَّ فَالرَّجْمُ فِي كِتَابِ اللَّهِ حَقٌّ عَلَى مَنْ زَنَى إِذَا أُحْصِنَ مِنْ الرِّجَالِ وَالنِّسَاءِ إِذَا قَامَتْ الْبَيِّنَةُ أَوْ الْحَبَلُ أَوْ الِاعْتِرَافُ أَلَا وَإِنَّا قَدْ كُنَّا نَقْرَأُ لَا تَرْغَبُوا عَنْ آبَائِكُمْ فَإِنَّ كُفْرًا بِكُمْ أَنْ تَرْغَبُوا عَنْ آبَائِكُمْ أَلَا وَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُطْرُونِي كَمَا أُطْرِيَ عِيسَى ابْنُ مَرْيَمَ عَلَيْهِ السَّلَام فَإِنَّمَا أَنَا عَبْدُ اللَّهِ فَقُولُوا عَبْدُ اللَّهِ وَرَسُولُهُ وَقَدْ بَلَغَنِي أَنَّ قَائِلًا مِنْكُمْ يَقُولُ لَوْ قَدْ مَاتَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ بَايَعْتُ فُلَانًا فَلَا يَغْتَرَّنَّ امْرُؤٌ أَنْ يَقُولَ إِنَّ بَيْعَةَ أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ كَانَتْ فَلْتَةً أَلَا وَإِنَّهَا كَانَتْ كَذَلِكَ أَلَا وَإِنَّ اللَّهَ عَزَّ وَجَلَّ وَقَى شَرَّهَا وَلَيْسَ فِيكُمْ الْيَوْمَ مَنْ تُقْطَعُ إِلَيْهِ الْأَعْنَاقُ مِثْلُ أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ أَلَا وَإِنَّهُ كَانَ مِنْ خَبَرِنَا حِينَ تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ عَلِيًّا وَالزُّبَيْرَ وَمَنْ كَانَ مَعَهُمَا تَخَلَّفُوا فِي بَيْتِ فَاطِمَةَ رَضِيَ اللَّهُ عَنْهَا بِنْتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَتَخَلَّفَتْ عَنَّا الْأَنْصَارُ بِأَجْمَعِهَا فِي سَقِيفَةِ بَنِي سَاعِدَةَ وَاجْتَمَعَ الْمُهَاجِرُونَ إِلَى أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَقُلْتُ لَهُ يَا أَبَا بَكْرٍ انْطَلِقْ بِنَا إِلَى إِخْوَانِنَا مِنْ الْأَنْصَارِ فَانْطَلَقْنَا نَؤُمُّهُمْ حَتَّى لَقِيَنَا رَجُلَانِ صَالِحَانِ فَذَكَرَا لَنَا الَّذِي صَنَعَ الْقَوْمُ فَقَالَا أَيْنَ تُرِيدُونَ يَا مَعْشَرَ الْمُهَاجِرِينَ فَقُلْتُ نُرِيدُ إِخْوَانَنَا هَؤُلَاءِ مِنْ الْأَنْصَارِ فَقَالَا لَا عَلَيْكُمْ أَنْ لَا تَقْرَبُوهُمْ وَاقْضُوا أَمْرَكُمْ يَا مَعْشَرَ الْمُهَاجِرِينَ فَقُلْتُ وَاللَّهِ لَنَأْتِيَنَّهُمْ فَانْطَلَقْنَا حَتَّى جِئْنَاهُمْ فِي سَقِيفَةِ بَنِي سَاعِدَةَ فَإِذَا هُمْ مُجْتَمِعُونَ وَإِذَا بَيْنَ ظَهْرَانَيْهِمْ رَجُلٌ مُزَمَّلٌ فَقُلْتُ مَنْ هَذَا فَقَالُوا سَعْدُ بْنُ عُبَادَةَ فَقُلْتُ مَا لَهُ قَالُوا وَجِعٌ فَلَمَّا جَلَسْنَا قَامَ خَطِيبُهُمْ فَأَثْنَى عَلَى اللَّهِ عَزَّ وَجَلَّ بِمَا هُوَ أَهْلُهُ وَقَالَ أَمَّا بَعْدُ فَنَحْنُ أَنْصَارُ اللَّهِ عَزَّ وَجَلَّ وَكَتِيبَةُ الْإِسْلَامِ وَأَنْتُمْ يَا مَعْشَرَ الْمُهَاجِرِينَ رَهْطٌ مِنَّا وَقَدْ دَفَّتْ دَافَّةٌ مِنْكُمْ يُرِيدُونَ أَنْ يَخْزِلُونَا مِنْ أَصْلِنَا وَيَحْضُنُونَا مِنْ الْأَمْرِ فَلَمَّا سَكَتَ أَرَدْتُ أَنْ أَتَكَلَّمَ وَكُنْتُ قَدْ زَوَّرْتُ مَقَالَةً أَعْجَبَتْنِي أَرَدْتُ أَنْ أَقُولَهَا بَيْنَ يَدَيْ أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ وَقَدْ كُنْتُ أُدَارِي مِنْهُ بَعْضَ الْحَدِّ وَهُوَ كَانَ أَحْلَمَ مِنِّي وَأَوْقَرَ فَقَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ عَلَى رِسْلِكَ فَكَرِهْتُ أَنْ أُغْضِبَهُ وَكَانَ أَعْلَمَ مِنِّي وَأَوْقَرَ وَاللَّهِ مَا تَرَكَ مِنْ كَلِمَةٍ أَعْجَبَتْنِي فِي تَزْوِيرِي إِلَّا قَالَهَا فِي بَدِيهَتِهِ وَأَفْضَلَ حَتَّى سَكَتَ فَقَالَ أَمَّا بَعْدُ فَمَا ذَكَرْتُمْ مِنْ خَيْرٍ فَأَنْتُمْ أَهْلُهُ وَلَمْ تَعْرِفْ الْعَرَبُ هَذَا الْأَمْرَ إِلَّا لِهَذَا الْحَيِّ مِنْ قُرَيْشٍ هُمْ أَوْسَطُ الْعَرَبِ نَسَبًا وَدَارًا وَقَدْ رَضِيتُ لَكُمْ أَحَدَ هَذَيْنِ الرَّجُلَيْنِ أَيَّهُمَا شِئْتُمْ وَأَخَذَ بِيَدِي وَبِيَدِ أَبِي عُبَيْدَةَ بْنِ الْجَرَّاحِ فَلَمْ أَكْرَهْ مِمَّا قَالَ غَيْرَهَا وَكَانَ وَاللَّهِ أَنْ أُقَدَّمَ فَتُضْرَبَ عُنُقِي لَا يُقَرِّبُنِي ذَلِكَ إِلَى إِثْمٍ أَحَبَّ إِلَيَّ مِنْ أَنْ أَتَأَمَّرَ عَلَى قَوْمٍ فِيهِمْ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ إِلَّا أَنْ تَغَيَّرَ نَفْسِي عِنْدَ الْمَوْتِ فَقَالَ قَائِلٌ مِنْ الْأَنْصَارِ أَنَا جُذَيْلُهَا الْمُحَكَّكُ وَعُذَيْقُهَا الْمُرَجَّبُ مِنَّا أَمِيرٌ وَمِنْكُمْ أَمِيرٌ يَا مَعْشَرَ قُرَيْشٍ فَقُلْتُ لِمَالِكٍ مَا مَعْنَى أَنَا جُذَيْلُهَا الْمُحَكَّكُ وَعُذَيْقُهَا الْمُرَجَّبُ قَالَ كَأَنَّهُ يَقُولُ أَنَا دَاهِيَتُهَا قَالَ وَكَثُرَ اللَّغَطُ وَارْتَفَعَتْ الْأَصْوَاتُ حَتَّى خَشِيتُ الِاخْتِلَافَ فَقُلْتُ ابْسُطْ يَدَكَ يَا أَبَا بَكْرٍ فَبَسَطَ يَدَهُ فَبَايَعْتُهُ وَبَايَعَهُ الْمُهَاجِرُونَ ثُمَّ بَايَعَهُ الْأَنْصَارُ وَنَزَوْنَا عَلَى سَعْدِ بْنِ عُبَادَةَ فَقَالَ قَائِلٌ مِنْهُمْ قَتَلْتُمْ سَعْدًا فَقُلْتُ قَتَلَ اللَّهُ سَعْدًا وَقَالَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ أَمَا وَاللَّهِ مَا وَجَدْنَا فِيمَا حَضَرْنَا أَمْرًا هُوَ أَقْوَى مِنْ مُبَايَعَةِ أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ خَشِينَا إِنْ فَارَقْنَا الْقَوْمَ وَلَمْ تَكُنْ بَيْعَةٌ أَنْ يُحْدِثُوا بَعْدَنَا بَيْعَةً فَإِمَّا أَنْ نُتَابِعَهُمْ عَلَى مَا لَا نَرْضَى وَإِمَّا أَنْ نُخَالِفَهُمْ فَيَكُونَ فِيهِ فَسَادٌ فَمَنْ بَايَعَ أَمِيرًا عَنْ غَيْرِ مَشُورَةِ الْمُسْلِمِينَ فَلَا بَيْعَةَ لَهُ وَلَا بَيْعَةَ لِلَّذِي بَايَعَهُ تَغِرَّةً أَنْ يُقْتَلَا قَالَ مَالِكٌ وَأَخْبَرَنِي ابْنُ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ أَنَّ الرَّجُلَيْنِ اللَّذَيْنِ لَقِيَاهُمَا عُوَيْمِرُ بْنُ سَاعِدَةَ وَمَعْنُ بْنُ عَدِيٍّ قَالَ ابْنُ شِهَابٍ وَأَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ أَنَّ الَّذِي قَالَ أَنَا جُذَيْلُهَا الْمُحَكَّكُ وَعُذَيْقُهَا الْمُرَجَّبُ الْحُبَابُ بْنُ الْمُنْذِرِ‏.‏",
    "malay_translation": "Isḥāq bin ‘Īsā aṭ-Ṭabbā’ telah meriwayatkan kepada kami, Mālīk bin Anas telah meriwayatkan kepada kami, Ibnu Shīhāb telah meriwayatkan kepadaku, daripada ‘Ubaydullah bin ‘Abdullah bin ‘Utbah bin Mas’ūd, bahawa Ibnu ‘Abbās telah memaklumkan kepadanya bahawa ‘Abd ar-Raḥmān bin ‘Auf telah kembali ke tempat perhentiannya. Ibnu ‘Abbās berkata: Aku selalu membacakan hadis kepada ‘Abd ar-Raḥmān bin ‘Auf, lalu beliau mendapatiku sedang menunggunya.  Peristiwa ini berlaku di Mina pada haji terakhir yang dilakukan oleh ‘Umar bin al-Khaṭṭāb رضي الله عنه. ‘Abd ar-Raḥmān bin ‘Auf berkata: Seorang lelaki datang kepada ‘Umar bin al-Khaṭṭāb رضي الله عنه lalu berkata: “Fulan berkata, sekiranya ‘Umar رضي الله عنه meninggal dunia, nescaya aku akan menyatakan bai’ah kepada fulan.”  Lalu ‘Umar رضي الله عنه berkata: “Aku akan berdiri di hadapan masyarakat pada petang ini untuk memberi amaran kepada mereka tentang golongan ini yang ingin merampas hak mereka.” ‘Abd ar-Raḥmān berkata: Aku berkata: “Wahai Amirul Mukminin, janganlah lakukan demikian kerana musim haji menghimpunkan orang ramai dan golongan yang tidak bertamadun, dan merekalah yang kebanyakannya akan hadir dan mendengar perkataan tuan. Jika tuan berdiri di hadapan masyarakat, aku bimbang tuan akan mengucapkan sesuatu yang akan mereka sebarkan tanpa memahami atau mentafsirkannya dengan tepat. Sebaiknya tunggulah sehingga tuan sampai ke Madinah, kerana ia adalah tanah hijrah dan sunnah, dan tuan akan bertemu dengan golongan yang paling berilmu dan mulia di sana. Di sana tuan boleh berkata apa sahaja yang tuan inginkan dengan penuh keyakinan; mereka akan memahami perkataan tuan dan mentafsirkannya dengan betul.”  ‘Umar رضي الله عنه berkata: “Sekiranya aku sampai ke Madinah dengan selamat dan sihat, nescaya aku akan bercakap dengan masyarakat di sana dalam ucapan pertamaku.”  Apabila kami sampai ke Madinah pada penghujung Zulhijjah, dan hari itu adalah hari Jumaat, aku segera pergi.  Aku berkata kepada Mālīk: Apakah maksud “sakkah al-a’mā”?  Beliau menjawab: Maksudnya, dia tidak kisah pada waktu apa dia keluar, dia tidak menghiraukan panas dan sejuk dan sebagainya. Aku mendapati Sa’īd bin Zayd di sudut kanan mimbar, dia telahpun sampai di sana sebelumku. Aku duduk di sebelahnya, lututku menyentuh lututnya, dan tidak lama kemudian ‘Umar رضي الله عنه pun datang.  Apabila aku melihatnya, aku berkata: “Nescaya pada petang ini dia akan berucap di mimbar ini dan mengatakan sesuatu yang belum pernah diucapkan oleh sesiapa pun sebelum ini.”  Sa’īd bin Zayd menafikannya lalu berkata: “Apakah agaknya yang akan diucapkannya yang belum pernah diucapkan oleh sesiapa?” ‘Umar رضي الله عنه duduk di mimbar, dan apabila muazin berhenti, beliau bangun lalu memuji dan memuliakan Allah SWT sebagaimana yang layak bagi-Nya, kemudian beliau berkata: “Sesungguhnya wahai masyarakat, aku akan mengatakan sesuatu yang telah ditakdirkan untukku katakan. Aku tidak tahu, mungkin ia merupakan petanda ajalku. Maka sesiapa yang memahaminya dan mengingatnya, hendaklah dia meriwayatkannya kepada orang lain ke mana sahaja tunggangannya membawanya; dan sesiapa yang tidak memahaminya, maka tidak dibenarkan baginya untuk berdusta tentangku. Sesungguhnya Allah SWT telah mengutus Muhammad ﷺ dengan kebenaran dan menurunkan kitab kepadanya; dan antara apa yang diturunkan kepadanya ialah ayat tentang rajam. Maka kami membacanya, memahaminya, dan Rasulullah ﷺ telah melakukan rajam, dan kami juga melakukan rajam selepas baginda. Aku bimbang sekiranya masa berlalu panjang di kalangan masyarakat, seseorang akan berkata, “Kami tidak dapati ayat rajam dalam kitabullah SWT,” lalu mereka sesat kerana meninggalkan suatu fardu yang telah diturunkan oleh Allah SWT. Maka rajam dalam kitabullah SWT adalah hak bagi orang yang berzina setelah mereka mencapai usia baligh, sama ada lelaki atau perempuan, jika terdapat bukti, atau kehamilan, atau pengakuan. Ketahuilah, sesungguhnya kami telah membaca, “Janganlah kamu berpaling daripada nenek moyang kamu, kerana sesungguhnya berpaling daripada nenek moyang kamu adalah kekufuran bagi kamu.”  Ketahuilah, sesungguhnya Rasulullah ﷺ bersabda: “Janganlah kamu memujiku sebagaimana Isa bin Maryam alaihissalam dipuji, kerana aku hanyalah hamba Allah. Maka katakanlah, hamba Allah dan rasul-Nya.” Dan telah sampai kepadaku bahawa ada di kalangan kamu yang berkata, “Sekiranya ‘Umar رضي الله عنه telah meninggal dunia, nescaya aku akan menyatakan bai’ah kepada fulan.”  Maka janganlah sesiapa terpedaya untuk berkata bahawa bai’ah Abu Bakar رضي الله عنه adalah sesuatu yang terburu-buru, kerana sesungguhnya ia adalah demikian.  Sesungguhnya Allah SWT telah menolak keburukannya, dan tidak ada di kalangan kamu pada hari ini yang layak diputuskan lehernya kecuali Abu Bakar رضي الله عنه. Ketahuilah, ketika Rasulullah ﷺ wafat, Ali dan az-Zubair serta orang yang bersama mereka, telah tinggal di rumah Fatimah رضي الله عنها, puteri Rasulullah ﷺ, dan seluruh kaum Ansar telah tinggal di Saqifah Bani Sa’adah. Dan kaum Muhajirin telah berkumpul dengan Abu Bakar رضي الله عنه. Maka aku berkata kepadanya: “Wahai Abu Bakar, marilah kita pergi kepada saudara-saudara kita daripada kaum Ansar.”  Lalu kami pergi menemui mereka sehingga kami bertemu dengan dua orang yang soleh, lalu mereka menceritakan kepada kami apa yang telah dilakukan oleh masyarakat. Mereka bertanya: “Ke manakah kamu hendak pergi wahai kaum Muhajirin?” Aku menjawab: “Kami ingin bertemu dengan saudara-saudara kami daripada kaum Ansar.”  Mereka berkata: “Tidak mengapa bagi kamu sekiranya kamu tidak menghampiri mereka; selesaikanlah urusan kamu wahai kaum Muhajirin.” Aku berkata: “Demi Allah, nescaya kami akan pergi kepada mereka.”  Lalu kami pergi sehingga kami sampai kepada mereka di Saqifah Bani Sa’adah.  Maka kami mendapati mereka sedang berkumpul, dan di tengah-tengah mereka terdapat seorang lelaki yang berselimut. Aku bertanya: “Siapakah ini?” Mereka menjawab: “Sa’d bin ‘Ubādah.” Aku bertanya: “Apakah keadaannya?” Mereka menjawab: “Dia sakit.” Apabila kami duduk, pemimpin mereka bangun, lalu memuji Allah SWT sebagaimana yang layak bagi-Nya, dan berkata: “Sesungguhnya kami adalah kaum Ansar bagi Allah SWT dan pasukan Islam, dan kamu wahai kaum Muhajirin adalah sekumpulan daripada kami, dan ada sekelompok daripada kamu yang ingin menjatuhkan kami daripada kedudukan asal kami dan menghalang kami daripada urusan ini.”  Apabila dia berhenti, aku ingin berucap, dan aku telahpun menyusun kata-kata yang menarik perhatianku, dan aku ingin mengatakannya di hadapan Abu Bakar رضي الله عنه, dan aku cuba untuk tidak terlalu keras dengannya kerana dia lebih bijaksana dan berhemah daripada aku.  Abu Bakar رضي الله عنه berkata: “Jangan terburu-buru.”  Aku enggan membuatnya marah kerana dia lebih berilmu dan berhemah daripada aku. Demi Allah, dia tidak meninggalkan satu pun daripada kata-kata yang menarik perhatianku di dalam susunan kata-kata aku, melainkan dia mengatakannya dengan serta-merta, dan dia berucap dengan lebih baik sehingga dia berhenti.  Kemudian dia berkata: “Sesungguhnya apa sahaja kebaikan yang telah kamu sebutkan, kamu adalah ahlinya. Dan orang Arab tidak mengetahui urusan ini kecuali bagi kaum Quraisy ini, mereka adalah orang tengah di kalangan Arab dari segi keturunan dan tempat tinggal. Dan aku telah pun meredhai untuk kamu salah seorang daripada dua lelaki ini, sesiapa sahaja yang kamu suka.”  Lalu dia memegang tanganku dan tangan Abu ‘Ubaydah bin al-Jarrāḥ. Aku tidak benci apa-apa yang dikatakannya selain daripada itu. Demi Allah, aku lebih suka dipancung leherku daripada menjadi pemimpin ke atas orang ramai yang di dalamnya terdapat Abu Bakar رضي الله عنه, melainkan jika nafsuku berubah ketika maut.  Seseorang daripada kaum Ansar berkata: “Aku adalah batang pokok yang digaru oleh unta yang sakit kulit, dan aku adalah pokok kurma yang tinggi. Di antara kita ada Amir dan di antara kamu ada Amir, wahai kaum Quraisy.”  Aku bertanya kepada Mālīk: Apakah maksud, “Aku adalah batang pokok yang digaru oleh unta yang sakit kulit, dan aku adalah pokok kurma yang tinggi”?  Beliau menjawab: Ia seolah-olah dia berkata, “Aku adalah orang yang bijak.”  Lalu berlakulah banyak percakapan dan suara-suara yang meninggi sehingga aku bimbang akan berlaku perselisihan, lalu aku berkata: “Hulurkan tanganmu wahai Abu Bakar.”  Lalu dia menghulurkan tangannya, maka aku menyatakan bai’ah kepadanya, dan kaum Muhajirin menyatakan bai’ah kepadanya, kemudian kaum Ansar menyatakan bai’ah kepadanya, dan kami menghimpit Sa’d bin ‘Ubādah.  Seseorang daripada mereka berkata: “Kamu telah membunuh Sa’d.” Aku menjawab: “Semoga Allah membunuh Sa’d!”  ‘Umar رضي الله عنه berkata: “Demi Allah, tidaklah kami dapati dalam apa yang telah kami hadiri sesuatu yang lebih sukar daripada bai’ah Abu Bakar رضي الله عنه. Kami bimbang sekiranya kami meninggalkan masyarakat tanpa bai’ah, maka mereka akan membuat bai’ah selepas kami pergi, maka sama ada kami mengikut mereka dengan sesuatu yang tidak kami redhai atau kami berselisih dengan mereka lalu membawa kepada kerosakan. Sesiapa yang menyatakan bai’ah kepada seorang Amir tanpa perundingan orang Islam, maka tiada bai’ah baginya dan tiada bai’ah bagi orang yang menyatakan bai’ah kepadanya, dikhuatiri mereka berdua akan dibunuh.” Mālīk berkata: Ibnu Shīhāb telah memberitahu aku, daripada ‘Urwah bin az-Zubayr, bahawa kedua-dua lelaki yang mereka temui ialah ‘Uwāimir bin Sā’idah dan Ma’n bin ‘Adī. Ibnu Shīhāb berkata: Sa’īd bin al-Musayyab telah memberitahu aku bahawa orang yang berkata, “Aku adalah batang pokok yang digaru oleh unta yang sakit kulit, dan aku adalah pokok kurma yang tinggi,” ialah al-Ḥubāb bin al-Mundhir."
  },
  {
    "id": 36533,
    "hadith_number": 370,
    "tajuk_hadith": "Puak Ansar yang Terbaik",
    "perawi_melayu": "Dari Yahya bin Sa'eed bahawa beliau mendengar Anas bin Malik berkata:",
    "english_text": "The Messenger of Allah (ﷺ)  said: “Shall I not tell you of the best tribe of the Ansar? Banun-Najjar, then Banu `Abdul Ashhal, then Banul-Harith bin al-Khazraj. then Banu Sa`idah.` and he said: `In each tribe of the Ansar there is goodness.”",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى، أَخْبَرَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا أُخْبِرُكُمْ بِخَيْرِ دُورِ الْأَنْصَارِ بَنِي النَّجَّارِ ثُمَّ بَنِي عَبْدِ الْأَشْهَلِ ثُمَّ بَلْحَارِثِ بْنِ الْخَزْرَجِ ثُمَّ بَنِي سَاعِدَةَ وَقَالَ فِي كُلِّ دُورِ الْأَنْصَارِ خَيْرٌ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: “Ingin aku beritahu kamu tentang puak Ansar yang terbaik? Bani Najjar, kemudian Bani Abdul Asyhal, kemudian Bani Harits bin Khazraj, kemudian Bani Sa’idah.” Baginda juga bersabda: “Dalam setiap puak Ansar terdapat kebaikan.”"
  },
  {
    "id": 36534,
    "hadith_number": 371,
    "tajuk_hadith": "Pilihan Membatalkan Transaksi",
    "perawi_melayu": "Daripada Ibnu Umar رضي الله عنه, baginda berkata:",
    "english_text": "The Messenger of Allah   (ﷺ) said: “The two parties to a transaction have the option (of cancelling it) so long as they have not parted or there is a condition which gives the option to cancel.`",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى، حَدَّثَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُتَبَايِعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا أَوْ يَكُونُ الْبَيْعُ خِيَارًا‏.‏",
    "malay_translation": "Daripada Ibnu Umar رضي الله عنه, bahawa Rasulullah ﷺ bersabda:  “Kedua-dua pihak yang berjual beli mempunyai pilihan (untuk membatalkannya) selagi mereka belum berpisah atau terdapat syarat yang membenarkan pembatalan.”"
  },
  {
    "id": 36535,
    "hadith_number": 372,
    "tajuk_hadith": "Larangan Menjual Anak Unta yang Masih di Kandungan",
    "perawi_melayu": "Ibn Umar",
    "english_text": "It was narrated from Ibn `Umar that  the Messenger of Allah (ﷺ) forbade selling the offspring of the offspring that is still in the womb of a camel.",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى، أَنْبَأَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ حَبَلِ الْحَبَلَةِ‏.‏",
    "malay_translation": "Daripada Ibnu Umar,  Rasulullah SAW melarang penjualan anak unta yang masih di dalam kandungan."
  },
  {
    "id": 36536,
    "hadith_number": 373,
    "tajuk_hadith": "Memindahkan Makanan Sebelum Dijual Pada Zaman Rasulullah SAW",
    "perawi_melayu": "Daripada Ibnu Umar (رضي الله عنه) diriwayatkan bahawa:",
    "english_text": "We used to buy and sell foodstuff at the time of the Messenger of Allah (ﷺ), and he would send someone to tell us to transfer the food from the place we have bought it to another place before selling it.",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى، أَنْبَأَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، رَضِيَ اللَّهُ عَنْهُ قَالَ كُنَّا نَتَبَايَعُ الطَّعَامَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَبْعَثُ عَلَيْنَا مَنْ يَأْمُرُنَا بِنَقْلِهِ مِنْ الْمَكَانِ الَّذِي ابْتَعْنَاهُ فِيهِ إِلَى مَكَانٍ سِوَاهُ قَبْلَ أَنْ نَبِيعَهُ‏.‏",
    "malay_translation": "Kami biasa membeli dan menjual makanan pada zaman Rasulullah SAW. Baginda akan mengutus seseorang untuk menyuruh kami memindahkan makanan tersebut dari tempat kami membelinya ke tempat lain sebelum menjualnya."
  },
  {
    "id": 36537,
    "hadith_number": 374,
    "tajuk_hadith": "Larangan Menjual Makanan Sebelum Menerimanya Keseluruhannya",
    "perawi_melayu": "Daripada Ibnu Umar (رضي الله عنه) berkata:",
    "english_text": "The Messenger of Allah        (ﷺ)said: “Whoever buys foodstuff should not sell it until he takes possession of all of it.”",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ ابْتَاعَ طَعَامًا فَلَا يَبِعْهُ حَتَّى يَسْتَوْفِيَهُ‏.‏",
    "malay_translation": "Daripada Ibnu Umar (رضي الله عنه), bahawa Rasulullah ﷺ bersabda: “Barangsiapa yang membeli makanan, maka janganlah dia menjualnya sehingga dia mengambilnya sepenuhnya.”"
  },
  {
    "id": 36538,
    "hadith_number": 375,
    "tajuk_hadith": "Membebaskan Hamba Saham",
    "perawi_melayu": "Daripada Ibnu Umar (رضي الله عنهما) bahawa Rasulullah ﷺ bersabda:",
    "english_text": "“If a person frees his share of a slave, and has enough Money to pay the full price of the slave, a fair price should be worked out for the slave, and his partners should be given their shares, then he may free the slave, otherwise he has freed only what he has freed.”",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى، أَنْبَأَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَعْتَقَ شِرْكًا لَهُ فِي عَبْدٍ فَكَانَ لَهُ مَا يَبْلُغُ ثَمَنَ الْعَبْدِ فَإِنَّهُ يُقَوَّمُ قِيمَةَ عَدْلٍ فَيُعْطَى شُرَكَاؤُهُ حَقَّهُمْ وَعَتَقَ عَلَيْهِ الْعَبْدَ وَإِلَّا فَقَدْ أَعْتَقَ مَا أَعْتَقَ‏.‏",
    "malay_translation": "Barang siapa yang membebaskan bahagiannya daripada seorang hamba, dan dia mempunyai wang yang cukup untuk membayar harga penuh hamba itu, maka hendaklah dinilai harga yang adil untuk hamba itu, dan diberikan bahagian kepada rakan-rakannya, kemudian dia boleh membebaskan hamba itu. Jika tidak, maka dia hanya membebaskan apa yang telah dibebaskannya."
  },
  {
    "id": 36539,
    "hadith_number": 376,
    "tajuk_hadith": "Perceraian Pasangan yang Melakukan Li'an",
    "perawi_melayu": "Daripada riwayat Saeed;",
    "english_text": "I said to IbnʼUmar (رضي الله عنه): What about a man who engaged in li`an with his wife? He said: The Messenger of Allah (ﷺ)  would separate them - and he mentioned the hadeeth.",
    "arabic_text": "حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنْ سَعِيدٍ، قَالَ قُلْتُ لِابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُ رَجُلٌ لَاعَنَ امْرَأَتَهُ فَقَالَ فَرَّقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَهُمَا وَذَكَرَ الْحَدِيثَ‏.‏",
    "malay_translation": "Aku berkata kepada Ibn Umar (رضي الله عنه): Bagaimana dengan seorang lelaki yang melakukan li'an dengan isterinya?  Beliau menjawab: Rasulullah ﷺ akan memisahkan mereka – dan beliau menyebut hadis tersebut."
  }
]
