[
  {
    "id": 36540,
    "hadith_number": 377,
    "tajuk_hadith": "Penempatan Surah Al-Anfal dan Surah Bara'ah dalam Mushaf",
    "perawi_melayu": "Daripada riwayat Yazid:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا عَوْفٌ، حَدَّثَنَا يَزِيدُ يَعْنِي الْفَارِسِيَّ، قَالَ أَبِي أَحْمَدُ بْنُ حَنْبَلٍ و حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا عَوْفٌ، عَنْ يَزِيدَ، قَالَ قَالَ لَنَا ابْنُ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُ قُلْتُ لِعُثْمَانَ بْنِ عَفَّانَ مَا حَمَلَكُمْ عَلَى أَنْ عَمَدْتُمْ، إِلَى الْأَنْفَالِ وَهِيَ مِنْ الْمَثَانِي وَإِلَى بَرَاءَةٌ وَهِيَ مِنْ الْمِئِينَ فَقَرَنْتُمْ بَيْنَهُمَا وَلَمْ تَكْتُبُوا قَالَ ابْنُ جَعْفَرٍ بَيْنَهُمَا سَطْرًا بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ وَوَضَعْتُمُوهَا فِي السَّبْعِ الطِّوَالِ مَا حَمَلَكُمْ عَلَى ذَلِكَ قَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ مِمَّا يَأْتِي عَلَيْهِ الزَّمَانُ يُنْزَلُ عَلَيْهِ مِنْ السُّوَرِ ذَوَاتِ الْعَدَدِ وَكَانَ إِذَا أُنْزِلَ عَلَيْهِ الشَّيْءُ يَدْعُو بَعْضَ مَنْ يَكْتُبُ عِنْدَهُ يَقُولُ ضَعُوا هَذَا فِي السُّورَةِ الَّتِي يُذْكَرُ فِيهَا كَذَا وَكَذَا وَيُنْزَلُ عَلَيْهِ الْآيَاتُ فَيَقُولُ ضَعُوا هَذِهِ الْآيَاتِ فِي السُّورَةِ الَّتِي يُذْكَرُ فِيهَا كَذَا وَكَذَا وَيُنْزَلُ عَلَيْهِ الْآيَةُ فَيَقُولُ ضَعُوا هَذِهِ الْآيَةَ فِي السُّورَةِ الَّتِي يُذْكَرُ فِيهَا كَذَا وَكَذَا وَكَانَتْ الْأَنْفَالُ مِنْ أَوَائِلِ مَا أُنْزِلَ بِالْمَدِينَةِ وَبَرَاءَةٌ مِنْ آخِرِ الْقُرْآنِ فَكَانَتْ قِصَّتُهَا شَبِيهًا بِقِصَّتِهَا فَقُبِضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يُبَيِّنْ لَنَا أَنَّهَا مِنْهَا وَظَنَنْتُ أَنَّهَا مِنْهَا فَمِنْ ثَمَّ قَرَنْتُ بَيْنَهُمَا وَلَمْ أَكْتُبْ بَيْنَهُمَا سَطْرًا بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ قَالَ ابْنُ جَعْفَرٍ وَوَضَعْتُهَا فِ السَّبْعِ الطِّوَالِ‏.‏",
    "malay_translation": "Ibnu Abbas (رضي الله عنه) berkata kepada kami. Aku bertanya kepada Uthman bin Affan: Apakah yang mendorong kamu untuk meletakkan Surah Al-Anfal, yang merupakan salah satu daripada surah-surah yang panjang (Al-Mathani), dan Surah Baraah, yang merupakan salah satu daripada surah-surah yang mempunyai seratus ayat atau lebih (Al-Mi’een), bersebelahan dan tidak menulis – kata Ibnu Ja’far: satu baris di antaranya yang berbunyi “Bismillahir Rahmanir Rahim” – dan kamu meletakkannya bersama tujuh surah yang panjang? Apakah yang mendorong kamu berbuat demikian? Uthman (رضي الله عنه) berkata:  Kadang kala banyak surah diturunkan (tidak lengkap) kepada Rasulullah ﷺ, dan apabila sesuatu ayat diturunkan, Baginda akan memanggil salah seorang penulis untuk menuliskannya dan bersabda: “Letakkan ini dalam surah yang menyebut tentang perkara begini dan begitu”; dan ayat-ayat akan diturunkan kepada Baginda dan Baginda bersabda, “Letakkan ayat-ayat ini dalam surah yang menyebut tentang perkara begini dan begitu”; dan satu ayat akan diturunkan kepada Baginda dan Baginda bersabda: “Letakkan ayat ini dalam surah yang menyebut tentang perkara begini dan begitu.” Surah Al-Anfal adalah antara surah-surah yang terawal diturunkan di Madinah dan Surah Baraah adalah antara surah-surah yang terakhir dalam Al-Quran, dan kisah dan kandungan kedua-dua surah itu adalah serupa. Kemudian Rasulullah ﷺ wafat tanpa menjelaskan kepada kami dengan jelas bahawa ia adalah sebahagian daripadanya, tetapi kami menyangka bahawa ia adalah sebahagian daripadanya, maka sebab itu saya meletakkan kedua-duanya bersama dan saya tidak menulis di antaranya baris “Bismillahir Rahmanir Rahim”. Ibnu Ja’far berkata: Saya meletakkannya bersama tujuh surah yang panjang."
  },
  {
    "id": 36541,
    "hadith_number": 378,
    "tajuk_hadith": "Pengampunan Dosa Selepas Wuduk dan Solat",
    "perawi_melayu": "Daripada Hisyam bin Urwah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، أَخْبَرَنِي أَبِي أَنَّ حُمْرَانَ، أَخْبَرَهُ قَالَ تَوَضَّأَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ عَلَى الْبَلَاطِ ثُمَّ قَالَ لَأُحَدِّثَنَّكُمْ حَدِيثًا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْلَا آيَةٌ فِي كِتَابِ اللَّهِ مَا حَدَّثْتُكُمُوهُ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ دَخَلَ فَصَلَّى غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الصَّلَاةِ الْأُخْرَى حَتَّى يُصَلِّيَهَا‏.‏",
    "malay_translation": "Yahya bin Sa'id telah meriwayatkan daripada Hisyam bin Urwah, yang memberitahu bahawa bapanya telah diberitahu oleh Humran yang berkata: Usman r.a. telah berwuduk di atas batu-bata (di Madinah), kemudian beliau berkata, \"Aku akan menceritakan kepada kamu sebuah hadis yang aku dengar daripada Rasulullah SAW. Sekiranya bukan kerana satu ayat di dalam kitab Allah, nescaya aku tidak akan menceritakannya kepada kamu.\" Aku mendengar Nabi SAW bersabda: \"Barangsiapa yang berwuduk dengan sempurna, kemudian masuk dan solat, maka akan diampunkan dosanya di antara solat itu dengan solat yang berikutnya sehingga dia menunaikannya.\""
  },
  {
    "id": 36542,
    "hadith_number": 379,
    "tajuk_hadith": "Larangan Menikah, Mempelai, dan Melamar Semasa Ihram",
    "perawi_melayu": "Daripada Aban bin Utsman (رضي الله عنه) daripada bapanya bahawa Nabi  (ﷺ)  bersabda:",
    "english_text": "`The pilgrim in ihram should not get married, arrange a marriage or propose marriage.`",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ مَالِكٍ، حَدَّثَنِي نَافِعٌ، عَنْ نُبَيْهِ بْنِ وَهْبٍ، عَنْ أَبَانَ بْنِ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ عَنْ أَبِيهِ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُحْرِمُ لَا يَنْكِحُ وَلَا يُنْكِحُ وَلَا يَخْطُبُ‏.‏",
    "malay_translation": "Orang yang sedang ihram tidak boleh berkahwin, menikahkan orang lain, mahupun melamar."
  },
  {
    "id": 36543,
    "hadith_number": 380,
    "tajuk_hadith": "Kisah Ali dan Uthman tentang Tamattu'",
    "perawi_melayu": "Ia diriwayatkan bahawa Ibnu Harmalah berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى، عَنِ ابْنِ حَرْمَلَةَ، قَالَ سَمِعْتُ سَعِيدًا يَعْنِي ابْنَ الْمُسَيَّبِ، قَالَ خَرَجَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ حَاجًّا حَتَّى إِذَا كَانَ بِبَعْضِ الطَّرِيقِ قِيلَ لِعَلِيٍّ رِضْوَانُ اللَّهِ عَلَيْهِمَا إِنَّهُ قَدْ نَهَى عَنْ التَّمَتُّعِ بِالْعُمْرَةِ إِلَى الْحَجِّ فَقَالَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ لِأَصْحَابِهِ إِذَا ارْتَحَلَ فَارْتَحِلُوا فَأَهَلَّ عَلِيٌّ وَأَصْحَابُهُ بِعُمْرَةٍ فَلَمْ يُكَلِّمْهُ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ فِي ذَلِكَ فَقَالَ لَهُ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ أَلَمْ أُخْبَرْ أَنَّكَ نَهَيْتَ عَنْ التَّمَتُّعِ بِالْعُمْرَةِ قَالَ فَقَالَ بَلَى قَالَ فَلَمْ تَسْمَعْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَمَتَّعَ قَالَ بَلَى‏.‏",
    "malay_translation": "Kami diberitakan oleh Yahya, daripada Ibnu Harmalah, katanya: Aku mendengar Saeed (yakni Ibnu Musayyab) berkata: Uthman r.a. keluar mengerjakan haji, sehingga apabila berada di suatu tempat di jalan, maka dikatakan kepada Ali r.a.: Sesungguhnya dia telah melarang daripada tamattu’ dengan umrah sebelum haji. Maka Ali r.a. berkata kepada sahabat-sahabatnya: Apabila dia berangkat, maka berangkatlah kamu juga. Maka Ali dan sahabat-sahabatnya berihram dengan umrah, maka Uthman r.a. tidak berkata apa-apa kepadanya dalam hal itu. Maka Ali r.a. berkata kepadanya: Bukankah aku diberitahu bahawa engkau telah melarang daripada tamattu’ dengan umrah? Uthman berkata: Ya. Ali berkata: Tidakkah engkau mendengar bahawa Rasulullah SAW telah melakukan tamattu’? Uthman berkata: Ya."
  },
  {
    "id": 36544,
    "hadith_number": 381,
    "tajuk_hadith": "Wuduk Rasulullah SAW",
    "perawi_melayu": "Daripada Uthman",
    "english_text": "It was narrated from `Uthman that the Messenger of Allah (ﷺ) did wudoo’ washing each part of the body three times.",
    "arabic_text": "حَدَّثَنَا وَكِيعٌ، عَنْ إِسْرَائِيلَ، عَنْ عَامِرِ بْنِ شَقِيقٍ، عَنْ أَبِي وَائِلٍ، عَنْ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ ثَلَاثًا ثَلَاثًا‏.‏",
    "malay_translation": "Daripada Uthman r.a., bahawa Rasulullah SAW melakukan wuduk dengan membasuh setiap anggota badan sebanyak tiga kali."
  },
  {
    "id": 36545,
    "hadith_number": 382,
    "tajuk_hadith": "Wuduk Rasulullah SAW",
    "perawi_melayu": "Daripada Abu Anas, bahawa Uthman (رضي الله عنه) melakukan wuduk di al-Maqa'id, membasuh setiap anggota badan tiga kali.  Beberapa sahabat Rasulullah SAW berada bersamanya. Baginda bertanya:",
    "english_text": "Didn`t you see the Messenger of Allah (ﷺ)  do wudoo like this? They said: Yes",
    "arabic_text": "حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي النَّضْرِ، عَنْ أَبُو أَنَسٍ، أَنَّ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ تَوَضَّأَ بِالْمَقَاعِدِ ثَلَاثًا ثَلَاثًا وَعِنْدَهُ رِجَالٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَلَيْسَ هَكَذَا رَأَيْتُمْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَوَضَّأُ قَالُوا نَعَمْ‏.‏",
    "malay_translation": "Bukankah kamu telah melihat Rasulullah SAW berwuduk seperti ini? Mereka menjawab: Ya."
  },
  {
    "id": 36546,
    "hadith_number": 383,
    "tajuk_hadith": "Keutamaan Mempelajari dan Mengajar Al-Quran",
    "perawi_melayu": "Daripada Uthman (رضي الله عنه) berkata:",
    "english_text": "The Messenger of Allah       (ﷺ)  said: `The best of you is the one who learns Qur`an and teaches it.”",
    "arabic_text": "حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، وَعَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْضَلُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Waki', telah menceritakan kepada kami Sufyan dan Abdur Rahman, daripada Sufyan, daripada Alqamah bin Martsad, daripada Abi Abdur Rahman, daripada Uthman r.a. bahawa Rasulullah SAW bersabda: \"Sebaik-baik kamu ialah orang yang mempelajari Al-Quran dan mengajarkannya.\""
  },
  {
    "id": 36547,
    "hadith_number": 384,
    "tajuk_hadith": "Wudhu' Sempurna Menghapuskan Dosa Antara Solat",
    "perawi_melayu": "Daripada Usman r.a.",
    "english_text": "The Messenger of Allah      (ﷺ) said: `Whoever does wudoo’ as Allah, may he be glorified and exalted, has commanded him, the prescribed prayers will be an expiation for  between them.”",
    "arabic_text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا شُعْبَةُ، عَنْ جَامِعِ بْنِ شَدَّادٍ، قَالَ سَمِعْتُ حُمْرَانَ بْنَ أَبَانَ، يُحَدِّثُ عَنْ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَتَمَّ الْوُضُوءَ كَمَا أَمَرَهُ اللَّهُ عَزَّ وَجَلَّ فَالصَّلَوَاتُ الْمَكْتُوبَاتُ كَفَّارَاتٌ لِمَا بَيْنَهُنَّ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: “Barangsiapa yang menyempurnakan wudhunya sebagaimana yang diperintahkan oleh Allah SWT, maka solat-solat fardhu itu akan menjadi penebus dosa di antara solat-solat tersebut.”"
  },
  {
    "id": 36548,
    "hadith_number": 385,
    "tajuk_hadith": "Kesabaran Usman bin Affan pada Hari Dar",
    "perawi_melayu": "Abu Sahlah meriwayatkan bahawa Usman (رضي الله عنه) berkata, pada Hari Dar ketika beliau dikepung. Rasulullah (ﷺ) memberi nasihat kepadaku dan aku berjanji untuk mematuhinya, maka aku akan menanggungnya dengan sabar. Qais berkata:",
    "english_text": "People thought that it was that day (when he was killed).",
    "arabic_text": "حَدَّثَنَا وَكِيعٌ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، قَالَ قَالَ قَيْسٌ فَحَدَّثَنِي أَبُو سَهْلَةَ، أَنَّ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ يَوْمَ الدَّارِ حِينَ حُصِرَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَهِدَ إِلَيَّ عَهْدًا فَأَنَا صَابِرٌ عَلَيْهِ قَالَ قَيْسٌ فَكَانُوا يَرَوْنَهُ ذَلِكَ الْيَوْمَ‏.‏",
    "malay_translation": "Mereka menyangka bahawa itulah hari (ketika beliau terbunuh)."
  },
  {
    "id": 36549,
    "hadith_number": 386,
    "tajuk_hadith": "Keutamaan Solat Isyak dan Subuh Berjemaah",
    "perawi_melayu": "Daripada Uthman bin Affan (رضي الله عنه). Abdur-Razzaq berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، وَعَبْدُ الرَّزَّاقِ، قَالَا حَدَّثَنَا سُفْيَانُ، عَنْ عُثْمَانَ بْنِ حَكِيمٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمْرَةَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ عَبْدُ الرَّزَّاقِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَلَّى صَلَاةَ الْعِشَاءِ وَالصُّبْحِ فِي جَمَاعَةٍ فَهُوَ كَقِيَامِ لَيْلَةٍ وَقَالَ عَبْدُ الرَّحْمَنِ مَنْ صَلَّى الْعِشَاءَ فِي جَمَاعَةٍ فَهُوَ كَقِيَامِ نِصْفِ لَيْلَةٍ وَمَنْ صَلَّى الصُّبْحَ فِي جَمَاعَةٍ فَهُوَ كَقِيَامِ لَيْلَةٍ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdur Rahman, telah menceritakan kepada kami Sufyan dan Abdur Razzaq, keduanya berkata; telah menceritakan kepada kami Sufyan dari Uthman bin Hakim, dari Abdur Rahman bin Abi ‘Amrah, dari Uthman bin Affan r.a., Abdur Razzaq berkata: Dari Nabi SAW, Baginda bersabda: “Barangsiapa menunaikan solat Isyak dan Subuh secara berjemaah, maka ia adalah seperti orang yang berqiamullail (bangun malam untuk solat). Dan Abdur Rahman berkata: Barangsiapa menunaikan solat Isyak secara berjemaah, maka ia adalah seperti orang yang berqiamullail setengah malam, dan barangsiapa menunaikan solat Subuh secara berjemaah, maka ia adalah seperti orang yang berqiamullail sepanjang malam.”"
  },
  {
    "id": 36550,
    "hadith_number": 387,
    "tajuk_hadith": "Keutamaan Solat Isyak dan Subuh Berjemaah",
    "perawi_melayu": "Daripada Usman bin Affan (رضي الله عنه) bahawa Nabi ﷺ bersabda:",
    "english_text": "“whoever prays ‘Isha in congregation is like one who spent half the night in prayer, and whoever prays Fajr in congregation is like one who spent the entire night in prayer.”",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو، حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى يَعْنِي ابْنَ أَبِي كَثِيرٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَلَّى الْعِشَاءَ فِي جَمَاعَةٍ فَهُوَ كَمَنْ قَامَ نِصْفَ اللَّيْلِ وَمَنْ صَلَّى الصُّبْحَ فِي جَمَاعَةٍ فَهُوَ كَمَنْ قَامَ اللَّيْلَ كُلَّهُ‏.‏",
    "malay_translation": "“Barangsiapa menunaikan solat Isyak secara berjemaah, maka ia sepertimana orang yang telah mendirikan solat tahajjud setengah malam. Dan barangsiapa menunaikan solat Subuh secara berjemaah, maka ia sepertimana orang yang telah mendirikan solat sepanjang malam.”"
  },
  {
    "id": 36551,
    "hadith_number": 388,
    "tajuk_hadith": "Kemudahan dalam Urus Niaga",
    "perawi_melayu": "‘Ata` bin Farrukh, hamba yang dimerdekakan daripada kaum Quraisy meriwayatkan bahawa ‘Uthman (رضي الله عنه) telah membeli sebidang tanah daripada seorang lelaki, dan lelaki itu lambat untuk meminta bayarannya.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا يُونُسُ يَعْنِي ابْنَ عُبَيْدٍ، حَدَّثَنِي عَطَاءُ بْنُ فَرُّوخَ، مَوْلَى الْقُرَشِيِّينَ أَنَّ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ اشْتَرَى مِنْ رَجُلٍ أَرْضًا فَأَبْطَأَ عَلَيْهِ فَلَقِيَهُ فَقَالَ لَهُ مَا مَنَعَكَ مِنْ قَبْضِ مَالِكَ قَالَ إِنَّكَ غَبَنْتَنِي فَمَا أَلْقَى مِنْ النَّاسِ أَحَدًا إِلَّا وَهُوَ يَلُومُنِي قَالَ أَوَ ذَلِكَ يَمْنَعُكَ قَالَ نَعَمْ قَالَ فَاخْتَرْ بَيْنَ أَرْضِكَ وَمَالِكَ ثُمَّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَدْخَلَ اللَّهُ عَزَّ وَجَلَّ الْجَنَّةَ رَجُلًا كَانَ سَهْلًا مُشْتَرِيًا وَبَائِعًا وَقَاضِيًا وَمُقْتَضِيًا‏.‏",
    "malay_translation": "Ismail bin Ibrahim telah meriwayatkan daripada Yunus (iaitu Ibnu Ubaid), yang meriwayatkan daripada ‘Ata’ bin Farrukh, seorang hamba yang dimerdekakan daripada kaum Quraisy, bahawa ‘Uthman (رضي الله عنه) telah membeli sebidang tanah daripada seorang lelaki. Lelaki itu lambat untuk meminta bayarannya.  Kemudian ‘Uthman bertemu dengannya dan bertanya, \"Apakah yang menghalangmu daripada mengambil wangmu?\" Lelaki itu menjawab, \"Engkau telah berlaku tidak adil kepadaku. Aku tidak bertemu sesiapa pun melainkan mereka mencela aku.\" ‘Uthman bertanya, \"Adakah itu yang menghalangmu?\" Lelaki itu menjawab, \"Ya.\" ‘Uthman berkata, \"Pilihlah sama ada tanahmu atau wangmu.\" Kemudian ‘Uthman berkata, \"Rasulullah ﷺ bersabda: Allah SWT memasukkan ke dalam syurga seorang lelaki yang mudah dalam urusan jual beli, ketika membayar hutang dan ketika menuntut hutang yang terhutang kepadanya.\""
  },
  {
    "id": 36552,
    "hadith_number": 389,
    "tajuk_hadith": "Perkahwinan Sebagai Penjaga Pandangan dan Kehormatan",
    "perawi_melayu": "Daripada riwayat Alqamah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا يُونُسُ بْنُ عُبَيْدٍ، عَنْ أَبِي مَعْشَرٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، قَالَ كُنْتُ مَعَ ابْنِ مَسْعُودٍ وَهُوَ عِنْدَ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ فَقَالَ لَهُ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ مَا بَقِيَ لِلنِّسَاءِ مِنْكَ قَالَ فَلَمَّا ذُكِرَتْ النِّسَاءُ قَالَ ابْنُ مَسْعُودٍ ادْنُ يَا عَلْقَمَةُ قَالَ وَأَنَا رَجُلٌ شَابٌّ فَقَالَ لَهُ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى فِتْيَةٍ مِنْ الْمُهَاجِرِينَ فَقَالَ مَنْ كَانَ مِنْكُمْ ذَا طَوْلٍ فَلْيَتَزَوَّجْ فَإِنَّهُ أَغَضُّ لِلطَّرْفِ وَأَحْصَنُ لِلْفَرْجِ وَمَنْ لَا فَإِنَّ الصَّوْمَ لَهُ وِجَاءٌ‏.‏",
    "malay_translation": "Daripada riwayat Ismail, daripada riwayat Yunus bin Ubaid, daripada Abu Ma'syar, daripada Ibrahim, daripada Alqamah, katanya: Aku berada bersama Ibnu Mas'ud ketika beliau berada di sisi Uthman رضي الله عنه.  Maka Uthman رضي الله عنه bertanya kepadanya, \"Adakah engkau masih lagi mempunyai keinginan terhadap wanita?\"  Apabila wanita disebut, Ibnu Mas'ud berkata, \"Dekatilah wahai Alqamah.\" Katanya lagi, \"Aku ketika itu masih muda.\"  Kemudian Uthman رضي الله عنه berkata, \"Rasulullah ﷺ telah keluar menemui sekumpulan pemuda daripada kalangan Muhajirin, lalu baginda bersabda:  \"Barangsiapa di antara kamu yang berkemampuan untuk berkahwin, maka hendaklah berkahwin, kerana ia lebih dapat menundukkan pandangan dan memelihara kehormatan. Dan barangsiapa yang tidak mampu, maka puasa adalah perisai baginya.\""
  },
  {
    "id": 36553,
    "hadith_number": 390,
    "tajuk_hadith": "Keutamaan Mempelajari dan Mengajar Al-Quran",
    "perawi_melayu": "Daripada Usman bin Affan (رضي الله عنه), bahawa Nabi (ﷺ) bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، وَبَهْزٌ، وَحَجَّاجٌ، قَالُوا حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ عَلْقَمَةَ بْنَ مَرْثَدٍ، يُحَدِّثُ عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِنَّ خَيْرَكُمْ مَنْ عَلَّمَ الْقُرْآنَ أَوْ تَعَلَّمَهُ قَالَ مُحَمَّدُ بْنُ جَعْفَرٍ وَحَجَّاجٌ فَقَالَ أَبُو عَبْدِ الرَّحْمَنِ فَذَاكَ الَّذِي أَقْعَدَنِي هَذَا الْمَقْعَدَ قَالَ حَجَّاجٌ قَالَ شُعْبَةُ وَلَمْ يَسْمَعْ أَبُو عَبْدِ الرَّحْمَنِ مِنْ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ وَلَا مِنْ عَبْدِ اللَّهِ وَلَكِنْ قَدْ سَمِعَ مِنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ أَبِي وَقَالَ بَهْزٌ عَنْ شُعْبَةَ قَالَ عَلْقَمَةُ بْنُ مَرْثَدٍ أَخْبَرَنِي وَقَالَ خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ.\n\nحَدَّثَنَا عَفَّانُ حَدَّثَنَا شُعْبَةُ أَخْبَرَنِي عَلْقَمَةُ بْنُ مَرْثَدٍ وَقَالَ فِيهِ مَنْ تَعَلَّمَ الْقُرْآنَ أَوْ عَلَّمَهُ‏.‏",
    "malay_translation": "Muhammad bin Ja'far, Bahz, dan Hajjaj berkata:  Mereka telah meriwayatkan daripada Syu'bah, yang berkata: Aku mendengar Alqamah bin Marthad meriwayatkan daripada Saad bin Ubaidah, daripada Abi Abdur Rahman As-Sulami, daripada Usman bin Affan (رضي الله عنه), daripada Nabi (ﷺ) bahawa baginda bersabda:  \"Sesungguhnya sebaik-baik kamu ialah orang yang mempelajari Al-Quran atau mengajarnya.\" Muhammad bin Ja'far dan Hajjaj berkata: Maka Abu Abdur Rahman berkata: Itulah yang menyebabkan aku duduk di tempat ini (iaitu menjadi seorang guru). Hajjaj berkata: Syu'bah berkata: Abu Abdur Rahman tidak mendengarnya daripada Usman (رضي الله عنه) atau daripada Abdullah, tetapi dia mendengarnya daripada Ali (رضي الله عنه). Ayahku berkata dan Bahz berkata: (Ia diriwayatkan daripada) Syu'bah yang berkata: Alqamah bin Marthad memberitahu aku, dan beliau berkata di dalamnya: \"Sebaik-baik kamu ialah orang yang mempelajari Al-Quran dan mengajarnya.\" \n\nAffan telah meriwayatkan kepada kami, Syu'bah telah meriwayatkan kepada kami, Alqamah bin Marthad telah memberitahu aku... dan beliau berkata di dalamnya: \"Barangsiapa mempelajari Al-Quran atau mengajarnya.\""
  },
  {
    "id": 36554,
    "hadith_number": 391,
    "tajuk_hadith": "Kehidupan yang Mudah dalam Perniagaan dan Keadilan Membawa ke Syurga",
    "perawi_melayu": "Daripada Amr bin Deenar berkata:",
    "english_text": "I heard a man narrate from `Uthman bin `Affan (رضي الله عنه) from the Prophet (ﷺ)  who said: `A man was easy-going when buying and selling, and when paying his dues and asking for what he was owe then he will enter Paradise.”",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، وَحَجَّاجٌ، قَالَا حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ دِينَارٍ، قَالَ سَمِعْتُ رَجُلًا، يُحَدِّثُ عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كَانَ رَجُلٌ سَمْحًا بَائِعًا وَمُبْتَاعًا وَقَاضِيًا وَمُقْتَضِيًا فَدَخَلَ الْجَنَّةَ‏.‏",
    "malay_translation": "Aku mendengar seorang lelaki menceritakan daripada Usman bin Affan (رضي الله عنه) daripada Nabi ﷺ yang bersabda:  “Seseorang lelaki yang bersikap mudah dalam jual beli,  dan dalam membayar hutang dan menuntut hutangnya, maka dia akan masuk syurga.”"
  },
  {
    "id": 36555,
    "hadith_number": 392,
    "tajuk_hadith": "Keutamaan Wuduk dan Penghapusan Dosa",
    "perawi_melayu": "Daripada Aban daripada Uthman (رضي الله عنه) bahawa baginda telah meminta air dan berwuduk:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ مُسْلِمِ بْنِ يَسَارٍ، عَنْ حُمْرَانَ بْنِ أَبَانَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ أَنَّهُ دَعَا بِمَاءٍ فَتَوَضَّأَ وَمَضْمَضَ وَاسْتَنْشَقَ ثُمَّ غَسَلَ وَجْهَهُ ثَلَاثًا وَذِرَاعَيْهِ ثَلَاثًا ثَلَاثًا وَمَسَحَ بِرَأْسِهِ وَظَهْرِ قَدَمَيْهِ ثُمَّ ضَحِكَ فَقَالَ لِأَصْحَابِهِ أَلَا تَسْأَلُونِي عَمَّا أَضْحَكَنِي فَقَالُوا مِمَّ ضَحِكْتَ يَا أَمِيرَ الْمُؤْمِنِينَ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعَا بِمَاءٍ قَرِيبًا مِنْ هَذِهِ الْبُقْعَةِ فَتَوَضَّأَ كَمَا تَوَضَّأْتُ ثُمَّ ضَحِكَ فَقَالَ أَلَا تَسْأَلُونِي مَا أَضْحَكَنِي فَقَالُوا مَا أَضْحَكَكَ يَا رَسُولَ اللَّهِ فَقَالَ إِنَّ الْعَبْدَ إِذَا دَعَا بِوَضُوءٍ فَغَسَلَ وَجْهَهُ حَطَّ اللَّهُ عَنْهُ كُلَّ خَطِيئَةٍ أَصَابَهَا بِوَجْهِهِ فَإِذَا غَسَلَ ذِرَاعَيْهِ كَانَ كَذَلِكَ وَإِنْ مَسَحَ بِرَأْسِهِ كَانَ كَذَلِكَ وَإِذَا طَهَّرَ قَدَمَيْهِ كَانَ كَذَلِكَ‏.‏",
    "malay_translation": "Daripada Muhammad bin Ja'afar, telah menceritakan kepada kami Said, daripada Qatadah, daripada Muslim bin Yasar, daripada Humran bin Aban, daripada Uthman bin Affan (رضي الله عنه) bahawa beliau telah meminta air, kemudian berwuduk, berkumur dan menghirup air ke dalam hidung.  Kemudian beliau membasuh mukanya tiga kali, kedua-dua tangannya tiga kali setiap satu, dan menyapu kepalanya dan bahagian atas kedua-dua kakinya. Kemudian beliau tersenyum dan berkata kepada sahabat-sahabatnya, “Tidakkah kamu bertanya kepadaku apa yang menyebabkan aku tersenyum?” Mereka berkata, “Apakah yang menyebabkanmu tersenyum, wahai Amirul Mukminin?” Beliau berkata, “Aku melihat Rasulullah ﷺ meminta air di dekat tempat ini, kemudian berwuduk seperti yang aku lakukan.  Kemudian baginda tersenyum dan bertanya, ‘Tidakkah kamu bertanya kepadaku apa yang menyebabkan aku tersenyum?’ Mereka bertanya, ‘Apakah yang menyebabkanmu tersenyum, wahai Rasulullah ﷺ?’ Baginda menjawab, ‘Sesungguhnya hamba apabila meminta air untuk berwuduk, kemudian membasuh mukanya, Allah akan menghapuskan setiap dosa yang telah dilakukannya dengan mukanya.  Apabila membasuh kedua-dua tangannya, demikian juga.  Apabila menyapu kepalanya, demikian juga. Dan apabila membersihkan kedua-dua kakinya, demikian juga.’"
  },
  {
    "id": 36556,
    "hadith_number": 393,
    "tajuk_hadith": "Hukum Anak Luar Nikah Menurut Rasulullah SAW",
    "perawi_melayu": "Daripada al-Hasan bin Sa'd, hamba sahaya yang dimerdekakan Hasan bin Ali, bahawa Rabah berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا بَهْزٌ، أَخْبَرَنَا مَهْدِيُّ بْنُ مَيْمُونٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي يَعْقُوبَ، عَنِ الْحَسَنِ بْنِ سَعْدٍ، مَوْلَى حَسَنِ بْنِ عَلِيٍّ عَنْ رَبَاحٍ، قَالَ زَوَّجَنِي أَهْلِي أَمَةً لَهُمْ رُومِيَّةً فَوَقَعْتُ عَلَيْهَا فَوَلَدَتْ لِي غُلَامًا أَسْوَدَ مِثْلِي فَسَمَّيْتُهُ عَبْدَ اللَّهِ ثُمَّ وَقَعْتُ عَلَيْهَا فَوَلَدَتْ لِي غُلَامًا أَسْوَدَ مِثْلِي فَسَمَّيْتُهُ عُبَيْدَ اللَّهِ ثُمَّ طَبِنَ لَهَا غُلَامٌ لِأَهْلِي رُومِيٌّ يُقَالُ لَهُ يُوحَنَّسُ فَرَاطَنَهَا بِلِسَانِهِ قَالَ فَوَلَدَتْ غُلَامًا كَأَنَّهُ وَزَغَةٌ مِنْ الْوَزَغَاتِ فَقُلْتُ لَهَا مَا هَذَا قَالَتْ هُوَ لِيُوحَنَّسَ قَالَ فَرُفِعْنَا إِلَى أَمِيرِ الْمُؤْمِنِينَ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ قَالَ مَهْدِيٌّ أَحْسَبُهُ قَالَ سَأَلَهُمَا فَاعْتَرَفَا فَقَالَ أَتَرْضَيَانِ أَنْ أَقْضِيَ بَيْنَكُمَا بِقَضَاءِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى أَنَّ الْوَلَدَ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرَ قَالَ مَهْدِيٌّ وَأَحْسَبُهُ قَالَ جَلَدَهَا وَجَلَدَهُ وَكَانَا مَمْلُوكَيْنِ\n\n حَدَّثَنَا شَيْبَانُ أَبُو مُحَمَّدٍ حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي يَعْقُوبَ عَنِ الْحَسَنِ بْنِ سَعْدٍ عَنْ رَبَاحٍ فَذَكَرَ الْحَدِيثَ قَالَ فَرَفَعْتُهُمَا إِلَى أَمِيرِ الْمُؤْمِنِينَ عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى أَنَّ الْوَلَدَ لِلْفِرَاشِ فَذَكَرَ مِثْلَهُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Bahz, telah memberitakan kepada kami Mahdi bin Maimun, telah menceritakan kepada kami Muhammad bin Abdullah bin Abi Ya'qub, daripada al-Hasan bin Sa'd, hamba sahaya yang dimerdekakan Hasan bin Ali, daripada Rabah. Dia berkata, “Keluargaku telah menikahkan aku dengan seorang hamba perempuan mereka, iaitu perempuan Rom. Aku telah bersetubuh dengannya, lalu dia melahirkan seorang anak lelaki yang berkulit hitam sepertiku, maka aku menamakannya Abdullah. Kemudian aku bersetubuh lagi dengannya, lalu dia melahirkan seorang anak lelaki yang berkulit hitam sepertiku, maka aku menamakannya Ubaidullah. Kemudian seorang hamba lelaki Rom daripada keluargaku bernama Yohanes telah berzina dengannya dengan menggunakan bahasa mereka. Lalu dia melahirkan seorang anak lelaki yang seakan-akan cicak (iaitu sangat putih). Aku bertanya kepadanya, “Apakah ini?” Dia menjawab, “Dia adalah anak Yohanes.” Maka kami mengadukan perkara ini kepada Amirul Mukminin Uthman r.a. Mahdi berkata, “Aku ingatkan dia berkata, ‘Dia bertanya kepada mereka berdua, lalu mereka mengaku. Kemudian dia berkata, ‘Adakah kamu berdua bersetuju jika aku menghakimi di antara kamu berdua mengikut hukum Rasulullah SAW?’ Dia berkata, ‘Rasulullah SAW telah memutuskan bahawa anak itu adalah milik suami (isteri itu) dan bagi pezina itu tiada apa-apa.’ Mahdi berkata, “Aku ingatkan dia berkata, ‘Dia menyeksa mereka berdua dan mereka berdua adalah hamba.’\n\nTelah menceritakan kepada kami Syaiban Abu Muhammad, telah memberitakan kepada kami Mahdi bin Maimun, telah menceritakan kepada kami Muhammad bin Abdullah bin Abi Ya’qub, daripada al-Hasan bin Sa’d, daripada Rabah. Kemudian dia menyebutkan hadis tersebut. Dia berkata, “Maka aku membawa mereka berdua kepada Amirul Mukminin Uthman bin Affan r.a., lalu dia berkata, ‘Sesungguhnya Rasulullah SAW telah memutuskan bahawa anak itu adalah milik suami (isteri itu).’ Kemudian dia menyebutkan perkara yang serupa.”"
  },
  {
    "id": 36557,
    "hadith_number": 394,
    "tajuk_hadith": "Pengampunan Dosa dengan Wuduk dan Solat Dua Rakaat",
    "perawi_melayu": "Daripada Humran, hamba yang dimerdekakan Uthman, bahawa dia melihat Uthman (رضي الله عنه) meminta air...",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو كَامِلٍ، حَدَّثَنَا إِبْرَاهِيمُ يَعْنِي ابْنَ سَعْدٍ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ عَطَاءِ بْنِ يَزِيدَ، عَنْ حُمْرَانَ، قَالَ دَعَا عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ بِمَاءٍ وَهُوَ عَلَى الْمَقَاعِدِ فَسَكَبَ عَلَى يَمِينِهِ فَغَسَلَهَا ثُمَّ أَدْخَلَ يَمِينَهُ فِي الْإِنَاءِ فَغَسَلَ كَفَّيْهِ ثَلَاثًا ثُمَّ غَسَلَ وَجْهَهُ ثَلَاثَ مِرَارٍ وَمَضْمَضَ وَاسْتَنْثَرَ وَغَسَلَ ذِرَاعَيْهِ إِلَى الْمِرْفَقَيْنِ ثَلَاثَ مَرَّاتٍ ثُمَّ مَسَحَ بِرَأْسِهِ ثُمَّ غَسَلَ رِجْلَيْهِ إِلَى الْكَعْبَيْنِ ثَلَاثَ مِرَارٍ ثُمَّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ تَوَضَّأَ نَحْوَ وُضُوئِي هَذَا ثُمَّ صَلَّى رَكْعَتَيْنِ لَا يُحَدِّثُ نَفْسَهُ فِيهِمَا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ حَدَّثَنَا إِبْرَاهِيمُ بْنُ نَصْرٍ التِّرْمِذِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنِ ابْنِ شِهَابٍ عَنْ عَطَاءِ بْنِ يَزِيدَ عَنْ حُمْرَانَ مَوْلَى عُثْمَانَ أَنَّهُ رَأَى عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ دَعَا بِإِنَاءٍ فَذَكَرَ نَحْوَهُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Kamil, telah menceritakan kepada kami Ibrahim iaitu Ibnu Saad, telah menceritakan kepada kami Ibnu Syihab, daripada Ata’ bin Yazid, daripada Humran, katanya: Uthman (رضي الله عنه) telah meminta air ketika dia berada di tempat duduk.  Maka dia menyiram air ke tangan kanannya dan membasuhnya, kemudian dia memasukkan tangan kanannya ke dalam bekas dan membasuh kedua-dua tapak tangannya sebanyak tiga kali, kemudian dia membasuh mukanya sebanyak tiga kali, dan dia berkumur-kumur dan membersihkan hidungnya, dia membasuh kedua-dua lengannya sehingga ke siku sebanyak tiga kali, kemudian dia menyapu kepalanya, kemudian dia membasuh kedua-dua kakinya sehingga ke buku lali sebanyak tiga kali. Kemudian dia berkata: Saya mendengar Rasulullah ﷺ bersabda:  Sesiapa yang berwuduk seperti wudukku ini, kemudian menunaikan solat dua rakaat tanpa lalai fikirannya di dalamnya, maka akan diampunkan dosanya yang telah lalu.  Telah menceritakan kepada kami Ibrahim bin Nasr ath-Tarmizi, telah menceritakan kepada kami Ibrahim bin Saad daripada Ibnu Syihab, daripada Ata’ bin Yazid, daripada Humran, hamba Uthman, bahawa dia melihat Uthman (رضي الله عنه) meminta sebuah bekas, maka dia menyebutkan perkara yang hampir sama."
  },
  {
    "id": 36558,
    "hadith_number": 395,
    "tajuk_hadith": "Keistimewaan Saidina Uthman bin Affan",
    "perawi_melayu": "Daripada Abu Salamah bin Abdul Rahman, katanya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو قَطَنٍ، حَدَّثَنَا يُونُسُ يَعْنِي ابْنَ أَبِي إِسْحَاقَ، عَنْ أَبِيهِ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ أَشْرَفَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ مِنْ الْقَصْرِ وَهُوَ مَحْصُورٌ فَقَالَ أَنْشُدُ بِاللَّهِ مَنْ شَهِدَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ حِرَاءٍ إِذْ اهْتَزَّ الْجَبَلُ فَرَكَلَهُ بِقَدَمِهِ ثُمَّ قَالَ اسْكُنْ حِرَاءُ لَيْسَ عَلَيْكَ إِلَّا نَبِيٌّ أَوْ صِدِّيقٌ أَوْ شَهِيدٌ وَأَنَا مَعَهُ فَانْتَشَدَ لَهُ رِجَالٌ قَالَ أَنْشُدُ بِاللَّهِ مَنْ شَهِدَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ بَيْعَةِ الرِّضْوَانِ إِذْ بَعَثَنِي إِلَى الْمُشْرِكِينَ إِلَى أَهْلِ مَكَّةَ قَالَ هَذِهِ يَدِي وَهَذِهِ يَدُ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ فَبَايَعَ لِي فَانْتَشَدَ لَهُ رِجَالٌ قَالَ أَنْشُدُ بِاللَّهِ مَنْ شَهِدَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ يُوَسِّعُ لَنَا بِهَذَا الْبَيْتِ فِي الْمَسْجِدِ بِبَيْتٍ فِي الْجَنَّةِ فَابْتَعْتُهُ مِنْ مَالِي فَوَسَّعْتُ بِهِ الْمَسْجِدَ فَانْتَشَدَ لَهُ رِجَالٌ قَالَ وَأَنْشُدُ بِاللَّهِ مَنْ شَهِدَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ جَيْشِ الْعُسْرَةِ قَالَ مَنْ يُنْفِقُ الْيَوْمَ نَفَقَةً مُتَقَبَّلَةً فَجَهَّزْتُ نِصْفَ الْجَيْشِ مِنْ مَالِي قَالَ فَانْتَشَدَ لَهُ رِجَالٌ وَأَنْشُدُ بِاللَّهِ مَنْ شَهِدَ رُومَةَ يُبَاعُ مَاؤُهَا ابْنَ السَّبِيلِ فَابْتَعْتُهَا مِنْ مَالِي فَأَبَحْتُهَا لِابْنِ السَّبِيلِ قَالَ فَانْتَشَدَ لَهُ رِجَالٌ‏.‏",
    "malay_translation": "Ketika Saidina Uthman berada dalam keadaan terkepung, baginda menengadah dari istana dan berkata, \"Aku bersumpah demi Allah, sesiapa yang menyaksikan Rasulullah SAW pada hari Hira', ketika gunung itu bergoncang dan baginda Rasulullah SAW menendangnya dengan kaki baginda lalu bersabda, 'Tenanglah wahai Hira', kerana di atasmu hanyalah seorang Nabi, seorang Siddiq atau seorang Syahid,' dan aku berada bersama baginda.\" Kemudian beberapa orang lelaki memberi saksi terhadap perkataan baginda. Kemudian baginda berkata, \"Aku bersumpah demi Allah, sesiapa yang menyaksikan Rasulullah SAW pada hari Bai'atul-Ridwan, ketika baginda menghantar aku kepada orang-orang musyrik di Mekah, dan baginda bersabda, 'Inilah tanganku dan inilah tangan Uthman,' lalu baginda memberi bai'ah bagi pihakku.\" Kemudian beberapa orang lelaki memberi saksi terhadap perkataan baginda. Kemudian baginda berkata, \"Aku bersumpah demi Allah, sesiapa yang menyaksikan Rasulullah SAW bersabda, 'Siapakah yang akan melebarkan masjid ini dengan memasukkan rumah ini ke dalamnya sebagai balasan sebuah rumah di syurga?' maka aku membelinya dengan hartaku dan melebarkan masjid dengan memasukkannya ke dalamnya.\" Kemudian beberapa orang lelaki memberi saksi terhadap perkataan baginda. Kemudian baginda berkata, \"Aku bersumpah demi Allah, sesiapa yang menyaksikan Rasulullah SAW pada hari tentera yang mengalami kesukaran (iaitu Tabuk), ketika baginda bersabda, 'Siapakah yang akan berinfak pada hari ini dengan infak yang diterima Allah?' maka aku melengkapkan separuh daripada tentera itu dengan hartaku.\" Kemudian beberapa orang lelaki memberi saksi terhadap perkataan baginda. Kemudian baginda berkata, \"Aku bersumpah demi Allah, sesiapa yang menyaksikan air Ruma (sebuah perigi) dijual kepada orang yang sedang musafir, maka aku membelinya dengan hartaku sendiri dan memberikannya kepada orang yang sedang musafir secara percuma.\" Kemudian beberapa orang lelaki memberi saksi terhadap perkataan baginda."
  },
  {
    "id": 36559,
    "hadith_number": 396,
    "tajuk_hadith": "Wuduk Usman bin Affan dan Pengampunan Dosa",
    "perawi_melayu": "Telah diriwayatkan bahawa Humran bin Aban berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَنْبَأَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ حُمْرَانَ بْنِ أَبَانَ، قَالَ رَأَيْتُ عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ تَوَضَّأَ فَأَفْرَغَ عَلَى يَدَيْهِ ثَلَاثًا فَغَسَلَهُمَا ثُمَّ مَضْمَضَ وَاسْتَنْثَرَ ثُمَّ غَسَلَ وَجْهَهُ ثَلَاثًا ثُمَّ غَسَلَ يَدَهُ الْيُمْنَى إِلَى الْمِرْفَقِ ثَلَاثًا ثُمَّ الْيُسْرَى مِثْلَ ذَلِكَ ثُمَّ مَسَحَ بِرَأْسِهِ ثُمَّ غَسَلَ قَدَمَهُ الْيُمْنَى ثَلَاثًا ثُمَّ الْيُسْرَى مِثْلَ ذَلِكَ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ نَحْوًا مِنْ وُضُوئِي هَذَا ثُمَّ قَالَ مَنْ تَوَضَّأَ وُضُوئِي هَذَا ثُمَّ صَلَّى رَكْعَتَيْنِ لَا يُحَدِّثُ فِيهِمَا نَفْسَهُ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdurrazzaq, telah memberitakan kepada kami Ma'mar, dari Az Zuhri, dari Ata' bin Yazid Al Laithi, dari Humran bin Aban, dia berkata: Aku melihat Usman bin Affan رضي الله عنه berwuduk, maka dia menuangkan air ke atas kedua tangannya tiga kali lalu membasuhnya, kemudian berkumur-kumur dan membersihkan hidung, kemudian membasuh mukanya tiga kali, kemudian membasuh tangan kanannya hingga ke siku tiga kali, kemudian tangan kirinya seperti itu, kemudian menyapu kepalanya, kemudian membasuh kaki kanannya tiga kali, kemudian kaki kirinya seperti itu. Dia berkata: Aku melihat Rasulullah ﷺ berwuduk hampir sama dengan wudukku ini, kemudian Baginda bersabda: “Barangsiapa berwuduk seperti wudukku ini, kemudian menunaikan solat dua rakaat tanpa membiarkan fikirannya melayang, maka dosa-dosanya yang lalu akan diampunkan.”"
  },
  {
    "id": 36560,
    "hadith_number": 397,
    "tajuk_hadith": "Menggunakan Kayu Aloes untuk Mata Semasa Ihram",
    "perawi_melayu": "Daripada Nubaih bin Wahb berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنْ نُبَيْهِ بْنِ وَهْبٍ، قَالَ أَرْسَلَ عُمَرُ بْنُ عُبَيْدِ اللَّهِ إِلَى أَبَانَ بْنِ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ أَيُكَحِّلُ عَيْنَيْهِ وَهُوَ مُحْرِمٌ أَوْ بِأَيِّ شَيْءٍ يُكَحِّلُهُمَا وَهُوَ مُحْرِمٌ فَأَرْسَلَ إِلَيْهِ أَنْ يُضَمِّدَهُمَا بِالصَّبِرِ فَإِنِّي سَمِعْتُ عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ يُحَدِّثُ ذَلِكَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdur Razzaq, memberitakan kepada kami Ma'mar, daripada Ayyub, daripada Nafi', daripada Nubaih bin Wahb, katanya: Umar bin Ubaidillah telah menghantar pesanan kepada Aban bin Uthman (رضي الله عنه)  sama ada boleh meletakkan sesuatu pada matanya ketika dalam keadaan ihram, atau apa yang boleh diletakkan pada matanya ketika dalam keadaan ihram. Maka dijawab kepadanya supaya dibalut matanya dengan kayu aloes.  Sesungguhnya aku telah mendengar Uthman bin Affan (رضي الله عنه) meriwayatkannya daripada Rasulullah ﷺ."
  },
  {
    "id": 36561,
    "hadith_number": 398,
    "tajuk_hadith": "Solat: Jalan Ke Syurga",
    "perawi_melayu": "Daripada Usman bin Affan, bahawa Nabi SAW bersabda:",
    "english_text": "“Whoever knows that prayer is an obligatory duty will enter Paradise.`",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا عِمْرَانُ بْنُ حُدَيْرٍ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُبَيْدٍ، عَنْ حُمْرَانَ بْنِ أَبَانَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ عَلِمَ أَنَّ الصَّلَاةَ حَقٌّ وَاجِبٌ دَخَلَ الْجَنَّةَ‏.‏",
    "malay_translation": "Daripada Abdullah, katanya daripada Ubaidullah bin Umar, katanya daripada Usman bin Umar, katanya daripada Imran bin Hudir, daripada Abdul Malik bin Ubaid, daripada Humran bin Aban, daripada Usman bin Affan, radiallahu ‘anhu, bahawa Nabi Muhammad SAW bersabda: “Barangsiapa yang mengetahui bahawa solat adalah satu kewajipan, nescaya dia akan masuk syurga.”"
  },
  {
    "id": 36562,
    "hadith_number": 399,
    "tajuk_hadith": "Larangan Tamattu' dan Amalan Rasulullah SAW",
    "perawi_melayu": "Daripada Said bin al-Musayyab, katanya:  Uthman pergi menunaikan haji, dan ketika di tengah perjalanan, Ali diberitahu bahawa Uthman telah melarang sahabat-sahabatnya daripada melakukan tamattu'. Ali berkata kepada sahabat-sahabatnya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنِي أَبُو مَعْشَرٍ يَعْنِي الْبَرَّاءَ، وَاسْمُهُ، يُوسُفُ بْنُ يَزِيدَ حَدَّثَنَا ابْنُ حَرْمَلَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، قَالَ حَجَّ عُثْمَانُ حَتَّى إِذَا كَانَ فِي بَعْضِ الطَّرِيقِ أُخْبِرَ عَلِيٌّ أَنَّ عُثْمَانَ نَهَى أَصْحَابَهُ عَنْ التَّمَتُّعِ بِالْعُمْرَةِ وَالْحَجِّ فَقَالَ عَلِيٌّ لِأَصْحَابِهِ إِذَا رَاحَ فَرُوحُوا فَأَهَلَّ عَلِيٌّ وَأَصْحَابُهُ بِعُمْرَةٍ فَلَمْ يُكَلِّمْهُمْ عُثْمَانُ فَقَالَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ أَلَمْ أُخْبَرْ أَنَّكَ نَهَيْتَ عَنْ التَّمَتُّعِ أَلَمْ يَتَمَتَّعْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَمَا أَدْرِي مَا أَجَابَهُ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah, telah menceritakan kepada kami Muhammad bin Abi Bakar al-Muqaddami, telah menceritakan kepadaku Abu Ma'syar iaitu al-Barra', dan namanya ialah Yusuf bin Yazid. Telah menceritakan kepada kami Ibn Harmalah, daripada Sa'id bin al-Musayyab, katanya: Uthman pergi menunaikan haji sehingga apabila berada di sebahagian jalan, Ali diberitahu bahawa Uthman telah melarang sahabat-sahabatnya daripada melakukan tamattu' dengan umrah dan haji. Maka Ali berkata kepada sahabat-sahabatnya: \"Apabila dia pergi, pergilah juga kamu.\" Maka Ali dan sahabat-sahabatnya berihram untuk umrah.  Uthman tidak berkata apa-apa kepada mereka. Maka Ali berkata: \"Bukankah aku telah diberitahu bahawa engkau melarang daripada melakukan tamattu'? Bukankah Rasulullah SAW telah melakukan tamattu'?\" Katanya: \"Maka aku tidak tahu apa jawapan yang diberikan oleh Uthman.\" "
  },
  {
    "id": 36563,
    "hadith_number": 400,
    "tajuk_hadith": "Pembahagian Fai’ oleh Rasulullah SAW",
    "perawi_melayu": "Malik bin Aws bin al-Hadathan berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ، قَالَ أَرْسَلَ إِلَيَّ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ فَبَيْنَا أَنَا كَذَلِكَ، إِذْ جَاءَهُ مَوْلَاهُ يَرْفَأُ فَقَالَ هَذَا عُثْمَانُ وَعَبْدُ الرَّحْمَنِ وَسَعْدٌ وَالزُّبَيْرُ بْنُ الْعَوَّامِ قَالَ وَلَا أَدْرِي أَذَكَرَ طَلْحَةَ أَمْ لَا يَسْتَأْذِنُونَ عَلَيْكَ قَالَ ائْذَنْ لَهُمْ ثُمَّ مَكَثَ سَاعَةً ثُمَّ جَاءَ فَقَالَ هَذَا الْعَبَّاسُ وَعَلِيٌّ رَضِيَ اللَّهُ عَنْهُمَا يَسْتَأْذِنَانِ عَلَيْكَ قَالَ ائْذَنْ لَهُمَا فَلَمَّا دَخَلَ الْعَبَّاسُ قَالَ يَا أَمِيرَ الْمُؤْمِنِينَ اقْضِ بَيْنِي وَبَيْنَ هَذَا وَهُمَا حِينَئِذٍ يَخْتَصِمَانِ فِيمَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ مِنْ أَمْوَالِ بَنِي النَّضِيرِ فَقَالَ الْقَوْمُ اقْضِ بَيْنَهُمَا يَا أَمِيرَ الْمُؤْمِنِينَ وَأَرِحْ كُلَّ وَاحِدٍ مِنْ صَاحِبِهِ فَقَدْ طَالَتْ خُصُومَتُهُمَا فَقَالَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ أَنْشُدُكُمْ اللَّهَ الَّذِي بِإِذْنِهِ تَقُومُ السَّمَوَاتُ وَالْأَرْضُ أَتَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا نُورَثُ مَا تَرَكْنَا صَدَقَةٌ قَالُوا قَدْ قَالَ ذَلِكَ وَقَالَ لَهُمَا مِثْلَ ذَلِكَ فَقَالَا نَعَمْ قَالَ فَإِنِّي سَأُخْبِرُكُمْ عَنْ هَذَا الْفَيْءِ إِنَّ اللَّهَ عَزَّ وَجَلَّ خَصَّ نَبِيَّهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهُ بِشَيْءٍ لَمْ يُعْطِهِ غَيْرَهُ فَقَالَ ‏{‏وَمَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ مِنْهُمْ فَمَا أَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ وَلَا رِكَابٍ‏}‏ وَكَانَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَاصَّةً وَاللَّهِ مَا احْتَازَهَا دُونَكُمْ وَلَا اسْتَأْثَرَ بِهَا عَلَيْكُمْ لَقَدْ قَسَمَهَا بَيْنَكُمْ وَبَثَّهَا فِيكُمْ حَتَّى بَقِيَ مِنْهَا هَذَا الْمَالُ فَكَانَ يُنْفِقُ عَلَى أَهْلِهِ مِنْهُ سَنَةً ثُمَّ يَجْعَلُ مَا بَقِيَ مِنْهُ مَجْعَلَ مَالِ اللَّهِ فَلَمَّا قُبِضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ أَنَا وَلِيُّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَهُ أَعْمَلُ فِيهَا بِمَا كَانَ يَعْمَلُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهَا‏.‏",
    "malay_translation": "Malik bin Aws bin al-Hadathan meriwayatkan bahawa Umar bin al-Khattab telah menghantar utusan kepadaku. Ketika itu, hamba dibebaskannya, Yarfa’, datang dan berkata: ‘Uthman, Abdur-Rahman, Saad dan Zubair bin al-Awwam di sini – (perawi berkata): aku tidak pasti sama ada dia menyebut Talhah atau tidak – dan mereka memohon izin untuk masuk menghadap tuan.  Umar berkata: Benarkan mereka masuk. Selepas beberapa ketika, (Yarfa’) datang lagi dan berkata: al-Abbas dan Ali memohon izin untuk masuk menghadap tuan. Umar berkata: Benarkan mereka masuk.  Apabila al-Abbas masuk, dia berkata: Wahai Amirul Mukminin, putuskanlah perselisihan antara aku dan orang ini. Mereka ketika itu berselisih faham tentang fai’ (ganjaran perang) yang Allah SWT berikan kepada Rasulullah SAW daripada harta benda Bani Nadhir.  Orang ramai berkata: Putuskanlah perselisihan mereka, wahai Amirul Mukminin, dan ringankan beban masing-masing, kerana perselisihan mereka telah berpanjangan. Umar berkata: Aku bersumpah kepada kamu dengan nama Allah SWT, Yang dengan izin-Nya langit dan bumi tercipta, adakah kamu tahu bahawa Rasulullah SAW bersabda, “Kami tidak diwarisi; apa yang kami tinggalkan adalah sedekah”? Mereka menjawab: Baginda SAW memang bersabda demikian. Umar kemudian menerangkan kepada mereka tentang fai’ tersebut: Sesungguhnya Allah SWT telah memberikan sesuatu yang khusus kepada Nabi-Nya SAW yang tidak diberikan kepada orang lain. Kemudian, beliau membaca ayat:  “Dan apa yang Allah SWT berikan sebagai ganjaran perang (Fai’) kepada Rasul-Nya daripada mereka – maka kamu tidak berjuang untuk mendapatkannya dengan menunggang kuda atau unta.”  Fai’ tersebut adalah khusus untuk Rasulullah SAW. Demi Allah, Baginda SAW tidak menyimpannya untuk diri Baginda SAW sahaja tanpa berkongsi dengan kamu dan tidak mengutamakan diri Baginda SAW daripada kamu dalam hal ini. Sebaliknya, Baginda SAW membahagikannya di kalangan kamu sehingga tidak tinggal apa-apa kecuali harta ini. Baginda SAW membelanjakannya untuk keperluan keluarganya selama setahun, kemudian Baginda SAW menjadikan baki harta tersebut sebagai harta Allah SWT.  Setelah Rasulullah SAW wafat, Abu Bakar berkata: “Aku adalah pengganti Rasulullah SAW, dan aku akan menguruskannya seperti yang dilakukan oleh Rasulullah SAW.”"
  },
  {
    "id": 36564,
    "hadith_number": 401,
    "tajuk_hadith": "Menghormati Jenazah: Teladan Rasulullah SAW",
    "perawi_melayu": "Daripada Usman r.a. bahawa beliau melihat jenazah lalu berdiri hormat dan berkata:",
    "english_text": "I saw the Messenger of Allah (ﷺ)  see a funeral and stand up for it.",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا إِسْمَاعِيلُ أَبُو مَعْمَرٍ، حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ الطَّائِفِيُّ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، عَنْ مُوسَى بْنِ عِمْرَانَ بْنِ مَنَّاحٍ، عَنْ أَبَانَ بْنِ عُثْمَانَ، عَنْ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ أَنَّهُ رَأَى جَنَازَةً فَقَامَ إِلَيْهَا وَقَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى جَنَازَةً فَقَامَ لَهَا‏.‏",
    "malay_translation": "Daripada Usman r.a., bahawa beliau melihat jenazah lalu berdiri menghormatinya.  Beliau berkata, \"Saya melihat Rasulullah SAW melihat jenazah lalu berdiri menghormatinya.\""
  },
  {
    "id": 36565,
    "hadith_number": 402,
    "tajuk_hadith": "Larangan Berpuasa pada Hari Raya Fitri dan Raya Aidiladha",
    "perawi_melayu": "Daripada Abu Ubaid, beliau berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدِ بْنِ عَبْدِ اللَّهِ بْنِ قَارِظٍ، عَنْ أَبِي عُبَيْدٍ، قَالَ شَهِدْتُ عَلِيًّا وَعُثْمَانَ رَضِيَ اللَّهُ عَنْهُمَا فِي يَوْمِ الْفِطْرِ وَالنَّحْرِ يُصَلِّيَانِ ثُمَّ يَنْصَرِفَانِ فَيُذَكِّرَانِ النَّاسَ فَسَمِعْتُهُمَا يَقُولَانِ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَوْمِ هَذَيْنِ الْيَوْمَيْنِ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ حَدَّثَنِي ابْنُ شِهَابٍ عَنْ عَطَاءِ بْنِ يَزِيدَ الْجُنْدَعِيِّ أَنَّهُ سَمِعَ حُمْرَانَ مَوْلَى عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ قَالَ رَأَيْتُ أَمِيرَ الْمُؤْمِنِينَ عُثْمَانَ يَتَوَضَّأُ فَأَهْرَاقَ عَلَى يَدَيْهِ ثَلَاثَ مَرَّاتٍ ثُمَّ اسْتَنْثَرَ ثَلَاثَ مَرَّاتٍ وَمَضْمَضَ ثَلَاثًا وَذَكَرَ الْحَدِيثَ مِثْلَ مَعْنَى حَدِيثِ مَعْمَرٍ‏.‏",
    "malay_translation": "Kami diberitakan oleh Abdullah, yang diberitakan kepadanya oleh Muhammad bin Abi Bakar, yang diberitakan kepadanya oleh Khalid bin al-Harits, yang diberitakan kepadanya oleh Ibnu Abi Dzaib, daripada Said bin Abdullah bin Qari'z, daripada Abu Ubaid, katanya: Aku menyaksikan Ali dan Uthman (رضي الله عنهما) pada hari raya Fitri dan Aidiladha, mereka solat, kemudian apabila selesai mereka mengingatkan manusia. Maka aku mendengar mereka berkata, Rasulullah (ﷺ) melarang berpuasa pada dua hari ini.\n\nKami diberitakan oleh Muhammad bin Bakar, yang memberitakan kepada kami Ibnu Juraij, yang memberitakan kepadaku Ibnu Syihab daripada Athah bin Yazid al-Junda'i bahawa dia mendengar Humran, hamba Uthman bin Affan (رضي الله عنه), berkata: Aku melihat Amirul Mukminin Uthman berwuduk, lalu dia menyiram air ke atas kedua belah tangannya sebanyak tiga kali, kemudian membasuh hidungnya sebanyak tiga kali dan berkumur sebanyak tiga kali… dan dia menyebutkan hadis yang serupa maksudnya dengan hadis Ma'mar."
  },
  {
    "id": 36566,
    "hadith_number": 403,
    "tajuk_hadith": "Cara Wuduk Rasulullah SAW",
    "perawi_melayu": "Daripada seorang Ansar, daripada bapanya, bahawa Usman (رضي الله عنه) berkata:",
    "english_text": "Shall l not show you how the Messenger of Allah (ﷺ)  did wudoo? They said: Yes. So he called for water, and he rinsed his mouth three times and his nose three times, and he washed his face and arms three times, and he wiped his head and washed his feet three times. Then he said: You should know that the ears are part of the head. Then he said: I have tried to do wudoo’ for you as the Messenger of Allah (ﷺ) did it.",
    "arabic_text": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا الْجُرَيْرِيُّ، عَنْ عُرْوَةَ بْنِ قَبِيصَةَ، عَنْ رَجُلٍ، مِنْ الْأَنْصَارِ عَنْ أَبِيهِ، أَنَّ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ أَلَا أُرِيكُمْ كَيْفَ كَانَ وُضُوءُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالُوا بَلَى فَدَعَا بِمَاءٍ فَتَمَضْمَضَ ثَلَاثًا وَاسْتَنْثَرَ ثَلَاثًا وَغَسَلَ وَجْهَهُ وَذِرَاعَيْهِ ثَلَاثًا وَمَسَحَ بِرَأْسِهِ وَغَسَلَ قَدَمَيْهِ ثَلَاثًا ثُمَّ قَالَ وَاعْلَمُوا أَنَّ الْأُذُنَيْنِ مِنْ الرَّأْسِ ثُمَّ قَالَ قَدْ تَحَرَّيْتُ لَكُمْ وُضُوءَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏",
    "malay_translation": "Adakah kamu tidak mahu aku tunjukkan bagaimana Rasulullah SAW berwuduk? Mereka berkata: Ya. Maka baginda memanggil air, kemudian baginda berkumur tiga kali dan membersihkan hidung tiga kali, dan membasuh muka dan kedua-dua lengan tiga kali, dan mengusap kepala dan membasuh kedua-dua kaki tiga kali. Kemudian baginda bersabda: Ketahuilah bahawa telinga adalah sebahagian daripada kepala. Kemudian baginda bersabda: Aku telah berusaha menunjukkan kepada kamu cara berwuduk Rasulullah SAW."
  },
  {
    "id": 36567,
    "hadith_number": 404,
    "tajuk_hadith": "Kesucian Wudhu' dan Solat",
    "perawi_melayu": "Telah diriwayatkan bahawa Humran bin Aban berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ، حَدَّثَنَا عَوْفٌ الْأَعْرَابِيُّ، عَنْ مَعْبَدٍ الْجُهَنِيِّ، عَنْ حُمْرَانَ بْنِ أَبَانَ، قَالَ كُنَّا عِنْدَ عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ فَدَعَا بِمَاءٍ فَتَوَضَّأَ فَلَمَّا فَرَغَ مِنْ وُضُوئِهِ تَبَسَّمَ فَقَالَ هَلْ تَدْرُونَ مِمَّا ضَحِكْتُ قَالَ فَقَالَ تَوَضَّأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا تَوَضَّأْتُ ثُمَّ تَبَسَّمَ ثُمَّ قَالَ هَلْ تَدْرُونَ مِمَّ ضَحِكْتُ قَالَ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ إِنَّ الْعَبْدَ إِذَا تَوَضَّأَ فَأَتَمَّ وُضُوءَهُ ثُمَّ دَخَلَ فِي صَلَاتِهِ فَأَتَمَّ صَلَاتَهُ خَرَجَ مِنْ صَلَاتِهِ كَمَا خَرَجَ مِنْ بَطْنِ أُمِّهِ مِنْ الذُّنُوبِ‏.‏",
    "malay_translation": "Kami berada di sisi Uthman bin Affan (radiyallahu 'anhu).  Beliau meminta air dan berwuduk. Setelah selesai wuduknya, beliau tersenyum dan berkata, \"Adakah kamu tahu mengapa aku tersenyum?\" Beliau berkata, \"Rasulullah SAW berwuduk seperti wudukku, kemudian Baginda tersenyum dan bertanya, ‘Adakah kamu tahu mengapa aku tersenyum?’ Kami menjawab, ‘Allah dan Rasul-Nya lebih mengetahui.’ Baginda berkata, ‘Sesungguhnya seorang hamba apabila berwuduk dan menyempurnakan wuduknya, kemudian masuk ke dalam solatnya dan menyempurnakan solatnya, maka dia akan keluar dari solatnya seperti dia keluar dari perut ibunya, iaitu bebas dari dosa.’"
  },
  {
    "id": 36568,
    "hadith_number": 405,
    "tajuk_hadith": "Perbezaan Pendapat Uthman dan Ali Mengenai Mut'ah",
    "perawi_melayu": "Daripada Qatadah, katanya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا رَوْحٌ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ شَقِيقٍ، يَقُولُ كَانَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ يَنْهَى عَنْ الْمُتْعَةِ وَعَلِيٌّ رَضِيَ اللَّهُ عَنْهُ يُفْتِي بِهَا فَقَالَ لَهُ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ قَوْلًا فَقَالَ لَهُ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ لَقَدْ عَلِمْتَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَلَ ذَلِكَ قَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ أَجَلْ وَلَكِنَّا كُنَّا خَائِفِينَ قَالَ شُعْبَةُ فَقُلْتُ لِقَتَادَةَ مَا كَانَ خَوْفُهُمْ قَالَ لَا أَدْرِي‏.‏",
    "malay_translation": "Kami diberitakan oleh Ruh, yang diberitakan kepadanya oleh Syu'bah, daripada Qatadah, katanya: Aku mendengar Abdullah bin Syaqiq berkata: Uthman (رضي الله عنه) melarang mut'ah dan Ali (رضي الله عنه) membenarkannya. Maka Uthman (رضي الله عنه) berkata sesuatu, lalu Ali (رضي الله عنه) berkata kepadanya:  Sesungguhnya engkau tahu bahawa Rasulullah ﷺ telah melakukannya. Uthman (رضي الله عنه) berkata: Ya, tetapi kami berada dalam keadaan takut. Syu'bah berkata: Kemudian aku bertanya kepada Qatadah: Apakah yang mereka takutkan? Dia berkata: Aku tidak tahu."
  },
  {
    "id": 36569,
    "hadith_number": 406,
    "tajuk_hadith": "Larangan dan Anjuran Mengenai Mut'ah (dalam Haji)",
    "perawi_melayu": "Daripada Qatadah. Abdullah bin Shaqeeq berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ قَالَ عَبْدُ اللَّهِ بْنُ شَقِيقٍ كَانَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ يَنْهَى عَنْ الْمُتْعَةِ وَعَلِيٌّ رَضِيَ اللَّهُ عَنْهُ يَأْمُرُ بِهَا فَقَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ لِعَلِيٍّ قَوْلًا ثُمَّ قَالَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ لَقَدْ عَلِمْتَ أَنَّا قَدْ تَمَتَّعْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَجَلْ وَلَكِنَّا كُنَّا خَائِفِينَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Ja'far, telah menceritakan kepada kami Syu'bah, daripada Qatadah, katanya; Abdullah bin Syakik berkata: Usman r.a. melarang mut'ah (dalam Haji) dan Ali r.a. memerintahkannya.  Usman r.a. berkata sesuatu kepada Ali, kemudian Ali r.a. berkata: Kamu tahu bahawa kami telah melakukan tamattu' bersama Rasulullah SAW. Usman berkata: Ya, tetapi ketika itu kami berada dalam keadaan takut."
  },
  {
    "id": 36570,
    "hadith_number": 407,
    "tajuk_hadith": "Keutamaan Berjaga Satu Malam di Jalan Allah",
    "perawi_melayu": "Daripada Abdullah bin az-Zubair, katanya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا رَوْحٌ، حَدَّثَنَا كَهْمَسٌ، عَنْ مُصْعَبِ بْنِ ثَابِتٍ، عَنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، قَالَ قَالَ عُثْمَانُ بْنُ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ وَهُوَ يَخْطُبُ عَلَى مِنْبَرِهِ إِنِّي مُحَدِّثُكُمْ حَدِيثًا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا كَانَ يَمْنَعُنِي أَنْ أُحَدِّثَكُمْ إِلَّا الضِّنُّ عَلَيْكُمْ وَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ حَرَسُ لَيْلَةٍ فِي سَبِيلِ اللَّهِ تَعَالَى أَفْضَلُ مِنْ أَلْفِ لَيْلَةٍ يُقَامُ لَيْلُهَا وَيُصَامُ نَهَارُهَا‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ruh, telah menceritakan kepada kami Kahmas, dari Mus’ab bin Tsabit, dari Abdullah bin az-Zubair, katanya: Uthman bin Affan رضي الله عنه berkata ketika berkhutbah di atas mimbarnya: “Sesungguhnya aku akan menceritakan kepada kamu sebuah hadis yang aku dengar daripada Rasulullah ﷺ.  Yang menghalang aku daripada menceritakannya kepada kamu hanyalah kerana rasa simpatiku kepada kamu. Dan sesungguhnya aku telah mendengar Rasulullah ﷺ bersabda: “Berjaga satu malam di jalan Allah Taala lebih afdal daripada seribu malam yang diqiamkan malamnya dan dipuasakan siangnya.”"
  },
  {
    "id": 36571,
    "hadith_number": 408,
    "tajuk_hadith": "Pahala Membina Masjid",
    "perawi_melayu": "Daripada Usman bin Affan رضي الله عنه",
    "english_text": "I heard the Messenger of Allah (ﷺ)  say: `Whoever builds a mosque for the sake of Allah, may He be glorified and exalted. Allah will build something like it for him in Paradise.”",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْكَبِيرِ بْنُ عَبْدِ الْمَجِيدِ أَبُو بَكْرٍ الْحَنَفِيُّ، حَدَّثَنَا عَبْدُ الْحَمِيدِ يَعْنِي ابْنَ جَعْفَرٍ، عَنْ أَبِيهِ، عَنْ مَحْمُودِ بْنِ لَبِيدٍ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ بَنَى مَسْجِدًا لِلَّهِ عَزَّ وَجَلَّ بَنَى اللَّهُ لَهُ مِثْلَهُ فِي الْجَنَّةِ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah ﷺ bersabda:  \"Barangsiapa yang membina masjid kerana Allah SWT, nescaya Allah SWT akan membina baginya yang serupa di dalam syurga.\""
  },
  {
    "id": 36572,
    "hadith_number": 409,
    "tajuk_hadith": "Larangan Berpuasa pada Hari Raya Fitri dan Raya Aidiladha serta Larangan Menyimpan Daging Korban Lebih Tiga Hari",
    "perawi_melayu": "Daripada Abu ‘Ubaid, hamba sahaya yang dimerdekakan ‘AbdurRahman bin Azhar, berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدِ بْنِ خَالِدِ بْنِ عَبْدِ اللَّهِ بْنِ قَارِظٍ، عَنْ أَبِي عُبَيْدٍ، مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ أَزْهَرَ قَالَ رَأَيْتُ عَلِيًّا رَضِيَ اللَّهُ عَنْهُ وَعُثْمَانَ يُصَلِّيَانِ يَوْمَ الْفِطْرِ وَالْأَضْحَى ثُمَّ يَنْصَرِفَانِ يُذَكِّرَانِ النَّاسَ قَالَ وَسَمِعْتُهُمَا يَقُولَانِ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ صِيَامِ هَذَيْنِ الْيَوْمَيْنِ‏.‏\n\nقَالَ و سَمِعْت عَلِيًّا، رَضِيَ اللَّهُ عَنْهُ يَقُولُ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَبْقَى مِنْ نُسُكِكُمْ عِنْدَكُمْ شَيْءٌ بَعْدَ ثَلَاثٍ‏.‏",
    "malay_translation": "Aku telah melihat Ali رضي الله عنه dan Uthman رضي الله عنه menunaikan solat pada hari raya Fitri dan Aidiladha, kemudian mereka berdua beredar untuk mengingatkan orang ramai.  Aku mendengar mereka berdua berkata:  Rasulullah ﷺ telah melarang berpuasa pada dua hari ini.  Dan aku mendengar Ali رضي الله عنه berkata: Rasulullah ﷺ melarang menyimpan sebarang daging korban lebih daripada tiga hari."
  },
  {
    "id": 36573,
    "hadith_number": 410,
    "tajuk_hadith": "Cara Wuduk Rasulullah SAW",
    "perawi_melayu": "Daripada riwayat Muhammad bin Abdullah bin Abi Maryam yang berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي مَرْيَمَ، قَالَ دَخَلْتُ عَلَى ابْنِ دَارَةَ مَوْلَى عُثْمَانَ قَالَ فَسَمِعَنِي أُمَضْمِضُ، قَالَ فَقَالَ يَا مُحَمَّدُ قَالَ قُلْتُ لَبَّيْكَ قَالَ أَلَا أُخْبِرُكَ عَنْ وُضُوءِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رَأَيْتُ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ وَهُوَ بِالْمَقَاعِدِ دَعَا بِوَضُوءٍ فَمَضْمَضَ ثَلَاثًا وَاسْتَنْشَقَ ثَلَاثًا وَغَسَلَ وَجْهَهُ ثَلَاثًا وَذِرَاعَيْهِ ثَلَاثًا وَمَسَحَ بِرَأْسِهِ ثَلَاثًا وَغَسَلَ قَدَمَيْهِ ثُمَّ قَالَ مَنْ أَحَبَّ أَنْ يَنْظُرَ إِلَى وُضُوءِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهَذَا وُضُوءُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏",
    "malay_translation": "Kami diberitakan oleh Safwan bin Isa, daripada Muhammad bin Abdullah bin Abi Maryam, yang berkata: Aku telah masuk menemui Ibnu Darah, hamba saudara Usman. Dia mendengar aku berkumur. Lalu dia berkata: Wahai Muhammad! Kataku:  Saya mendengar. Dia berkata: Tidakkah aku beritahu engkau tentang cara berwuduk Rasulullah SAW?  Katanya lagi: Aku melihat Usman RA ketika di al-Maqa’id, dia meminta air untuk berwuduk, kemudian dia berkumur tiga kali, membersihkan hidung tiga kali, membasuh mukanya tiga kali, membasuh kedua tangannya tiga kali, mengusap kepalanya tiga kali dan membasuh kedua kakinya. Kemudian dia berkata: Barangsiapa yang ingin melihat cara berwuduk Rasulullah SAW, maka inilah cara berwuduk Rasulullah SAW."
  },
  {
    "id": 36574,
    "hadith_number": 411,
    "tajuk_hadith": "Keharaman Menumpahkan Darah Seorang Muslim",
    "perawi_melayu": "Daripada Abu Umamah bin Sahl berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، وَعَفَّانُ الْمَعْنَى، قَالَا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ، قَالَ كُنَّا مَعَ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ وَهُوَ مَحْصُورٌ فِي الدَّارِ فَدَخَلَ مَدْخَلًا كَانَ إِذَا دَخَلَهُ يَسْمَعُ كَلَامَهُ مَنْ عَلَى الْبَلَاطِ قَالَ فَدَخَلَ ذَلِكَ الْمَدْخَلَ وَخَرَجَ إِلَيْنَا فَقَالَ إِنَّهُمْ يَتَوَعَّدُونِي بِالْقَتْلِ آنِفًا قَالَ قُلْنَا يَكْفِيكَهُمُ اللَّهُ يَا أَمِيرَ الْمُؤْمِنِينَ قَالَ وَبِمَ يَقْتُلُونَنِي إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلَّا بِإِحْدَى ثَلَاثٍ رَجُلٌ كَفَرَ بَعْدَ إِسْلَامِهِ أَوْ زَنَى بَعْدَ إِحْصَانِهِ أَوْ قَتَلَ نَفْسًا فَيُقْتَلُ بِهَا فَوَاللَّهِ مَا أَحْبَبْتُ أَنَّ لِي بِدِينِي بَدَلًا مُنْذُ هَدَانِي اللَّهُ وَلَا زَنَيْتُ فِي جَاهِلِيَّةٍ وَلَا فِي إِسْلَامٍ قَطُّ وَلَا قَتَلْتُ نَفْسًا فَبِمَ يَقْتُلُونَنِي حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا أَبُو أُمَامَةَ بْنُ سَهْلِ بْنِ حُنَيْفٍ قَالَ إِنِّي لَمَعَ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ فِي الدَّارِ وَهُوَ مَحْصُورٌ وَقَالَ كُنَّا نَدْخُلُ مَدْخَلًا فَذَكَرَ الْحَدِيثَ مِثْلَهُ وَقَالَ قَدْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فَذَكَرَ الْحَدِيثَ مِثْلَهُ أَوْ نَحْوَهُ‏.‏",
    "malay_translation": "Kami bersama Uthman ketika beliau dikepung di dalam rumah. Beliau masuk ke pintu rumah, di mana perkataannya dapat didengar oleh orang yang berada di pelataran.  Beliau masuk ke pintu itu, kemudian keluar menemui kami lalu berkata: \"Mereka baru sahaja mengancam untuk membunuhku.\" Kami berkata: \"Allah akan mencukupimu terhadap mereka, wahai Amirul Mukminin.\" Beliau berkata: \"Mengapa mereka hendak membunuhku?  Sesungguhnya aku telah mendengar Rasulullah SAW bersabda: \"Tidak halal darah seorang Muslim melainkan dengan tiga perkara: seseorang yang murtad selepas memeluk Islam, atau berzina selepas berkahwin, atau membunuh seseorang lalu dibunuh sebagai balasan.\" Demi Allah, aku tidak pernah menginginkan perubahan agamaku selepas Allah memberi hidayah kepadaku; dan aku tidak pernah berzina sama ada pada zaman Jahiliyyah atau dalam Islam; dan aku tidak pernah membunuh sesiapa. Jadi, mengapakah mereka hendak membunuhku?\"\n\nAbu Umamah bin Sahl bin Hunaif meriwayatkan: Aku bersama Uthman RA di dalam rumah ketika beliau dikepung.  Kami masuk melalui satu pintu... dan beliau meriwayatkan hadis yang serupa. Dan beliau berkata: Aku telah mendengar Rasulullah SAW bersabda:... dan beliau meriwayatkan hadis yang serupa."
  },
  {
    "id": 36575,
    "hadith_number": 412,
    "tajuk_hadith": "Kesabaran Keluarga Yasir dan Keutamaan Bani Hashim",
    "perawi_melayu": "Daripada Salim bin Abi al-Ja'd, diriwayatkan bahawa Uthman (رضي الله عنه) memanggil beberapa sahabat Rasulullah ﷺ, antaranya ialah Ammar bin Yasir, dan berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا الْقَاسِمُ يَعْنِي ابْنَ الْفَضْلِ، حَدَّثَنَا عَمْرُو بْنُ مُرَّةَ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، قَالَ دَعَا عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ نَاسًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهِمْ عَمَّارُ بْنُ يَاسِرٍ فَقَالَ إِنِّي سَائِلُكُمْ وَإِنِّي أُحِبُّ أَنْ تَصْدُقُونِي نَشَدْتُكُمْ اللَّهَ أَتَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُؤْثِرُ قُرَيْشًا عَلَى سَائِرِ النَّاسِ وَيُؤْثِرُ بَنِي هَاشِمٍ عَلَى سَائِرِ قُرَيْشٍ فَسَكَتَ الْقَوْمُ فَقَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ لَوْ أَنَّ بِيَدِي مَفَاتِيحَ الْجَنَّةِ لَأَعْطَيْتُهَا بَنِي أُمَيَّةَ حَتَّى يَدْخُلُوا مِنْ عِنْدِ آخِرِهِمْ فَبَعَثَ إِلَى طَلْحَةَ وَالزُّبَيْرِ فَقَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ أَلَا أُحَدِّثُكُمَا عَنْهُ يَعْنِي عَمَّارًا أَقْبَلْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ آخِذًا بِيَدِي نَتَمَشَّى فِي الْبَطْحَاءِ حَتَّى أَتَى عَلَى أَبِيهِ وَأُمِّهِ وَعَلَيْهِ يُعَذَّبُونَ فَقَالَ أَبُو عَمَّارٍ يَا رَسُولَ اللَّهِ الدَّهْرَ هَكَذَا فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اصْبِرْ ثُمَّ قَالَ اللَّهُمَّ اغْفِرْ لِآلِ يَاسِرٍ وَقَدْ فَعَلْتُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdus Samad, telah menceritakan kepada kami Al-Qasim (yakni Ibnu Fadhl), telah menceritakan kepada kami Amru bin Murrah, dari Salim bin Abi al-Ja'd, dia berkata: Uthman r.a. memanggil beberapa orang sahabat Rasulullah ﷺ, di antara mereka ialah Ammar bin Yasir, lalu dia berkata: “Sesungguhnya aku akan bertanya kepada kamu dan aku suka kamu jujur kepadaku. Aku bersumpah demi Allah, adakah kamu tahu bahawa Rasulullah ﷺ sentiasa mengutamakan Quraisy daripada semua orang dan Baginda mengutamakan Bani Hashim daripada semua Quraisy?” Maka diamlah orang ramai. Lalu Uthman r.a. berkata: “Sekiranya aku memegang kunci-kunci syurga, nescaya aku akan memberikannya kepada Bani Umaiyyah sehingga mereka masuk dari kalangan yang terakhir.” Kemudian dia menghantar utusan kepada Thalhah dan Az-Zubair. Lalu Uthman r.a. berkata: “Wahai keduanya, tidakkah aku bercerita kepada kamu tentangnya (yakni Ammar)? Aku berjalan bersama Rasulullah ﷺ sambil memegang tangan Baginda, lalu kami berjalan-jalan di al-Bathah sehingga kami sampai kepada bapanya dan ibunya sedang mereka diseksa. Maka bapa Ammar berkata: “Wahai Rasulullah ﷺ, adakah kami akan sentiasa begini?” Maka Nabi ﷺ bersabda kepadanya: “Bersabarlah!” Kemudian Baginda bersabda: “Ya Allah, ampunilah keluarga Yasir dan sesungguhnya Engkau telah melakukannya.”"
  },
  {
    "id": 36576,
    "hadith_number": 413,
    "tajuk_hadith": "Hak Anak Adam Terhadap Harta",
    "perawi_melayu": "Daripada Usman bin Affan r.a. bahawa Rasulullah SAW bersabda:",
    "english_text": "`Everything apart from the shade of a house, a sack of bread, a garment to cover his `awrah and water, anything more than that the son of Adam has no right to.”",
    "arabic_text": "حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا حُرَيْثُ بْنُ السَّائِبِ، قَالَ سَمِعْتُ الْحَسَنَ، يَقُولُ حَدَّثَنِي حُمْرَانُ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُلُّ شَيْءٍ سِوَى ظِلِّ بَيْتٍ وَجِلْفِ الْخُبْزِ وَثَوْبٍ يُوَارِي عَوْرَتَهُ وَالْمَاءِ فَمَا فَضَلَ عَنْ هَذَا فَلَيْسَ لِابْنِ آدَمَ فِيهِ حَقٌّ‏.‏",
    "malay_translation": "Segala sesuatu selain daripada tempat berteduh (bayangan rumah), makanan (sekeping roti), pakaian untuk menutup aurat dan air, maka apa yang lebih daripada itu, anak Adam tidak berhak ke atasnya."
  },
  {
    "id": 36577,
    "hadith_number": 414,
    "tajuk_hadith": "Mencontohi Amalan Nabi SAW",
    "perawi_melayu": "Daripada seorang lelaki tua dari suku Thaqif - Humaid yang dirakamkan sebagai orang yang soleh - menyatakan bahawa bapa saudaranya memberitahu bahawa beliau telah melihat Uthman bin Affan (رضي الله عنه) duduk di pintu kedua Masjid Rasulullah SAW.",
    "english_text": "I sat where the Prophet (ﷺ) sat and I ate what the Prophet (ﷺ) ate, and I did what the Prophet (ﷺ) did.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَكْرٍ، حَدَّثَنَا حُمَيْدٌ الطَّوِيلُ، عَنْ شَيْخٍ، مِنْ ثَقِيفٍ ذَكَرَهُ حُمَيْدٌ بِصَلَاحٍ ذَكَرَ أَنَّ عَمَّهُ أخْبَرَهُ أَنَّهُ رَأَى عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ جَلَسَ عَلَى الْبَابِ الثَّانِي مِنْ مَسْجِدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَعَا بِكَتِفٍ فَتَعَرَّقَهَا ثُمَّ قَامَ فَصَلَّى وَلَمْ يَتَوَضَّأْ ثُمَّ قَالَ جَلَسْتُ مَجْلِسَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَكَلْتُ مَا أَكَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَصَنَعْتُ مَا صَنَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏",
    "malay_translation": "Kemudian beliau berkata: \"Saya duduk di tempat yang Nabi SAW duduk, saya makan apa yang Nabi SAW makan, dan saya melakukan apa yang Nabi SAW lakukan.\""
  },
  {
    "id": 36578,
    "hadith_number": 415,
    "tajuk_hadith": "Keutamaan Berjaga di Sempadan",
    "perawi_melayu": "Daripada Abu Salih, bekas hamba Uthman, katanya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو سَعِيدٍ، مَوْلَى بَنِي هَاشِمٍ حَدَّثَنَا ابْنُ لَهِيعَةَ، حَدَّثَنَا زُهْرَةُ بْنُ مَعْبَدٍ، عَنْ أَبِي صَالِحٍ، مَوْلَى عُثْمَانَ أَنَّهُ حَدَّثَهُ قَالَ سَمِعْتُ عُثْمَانَ، بِمِنًى يَقُولُ يَا أَيُّهَا النَّاسُ إِنِّي أُحَدِّثُكُمْ حَدِيثًا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ رِبَاطُ يَوْمٍ فِي سَبِيلِ اللَّهِ أَفْضَلُ مِنْ أَلْفِ يَوْمٍ فِيمَا سِوَاهُ فَلْيُرَابِطْ امْرُؤٌ كَيْفَ شَاءَ هَلْ بَلَّغْتُ قَالُوا نَعَمْ قَالَ اللَّهُمَّ اشْهَدْ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Said, bekas hamba Bani Hashim, telah menceritakan kepada kami Ibnu Lahi’ah, telah menceritakan kepada kami Zuhrah bin Ma’bad, daripada Abu Shalih, bekas hamba Uthman bahawa dia telah menceritakan kepadanya, katanya: Aku mendengar Uthman di Mina berkata: Wahai manusia, sesungguhnya aku akan menceritakan kepada kamu sebuah hadis yang aku dengar daripada Rasulullah SAW, baginda bersabda: \"Berjaga (berjuang) di sempadan selama sehari di jalan Allah lebih utama daripada seribu hari melakukan perkara-perkara yang lain. Maka hendaklah seseorang itu berjaga di sempadan selama mana yang dia suka.\"  Mereka bertanya: \"Adakah engkau telah menyampaikannya?\"  Uthman menjawab: \"Ya.\" Uthman kemudian berdoa: \"Ya Allah, jadikanlah saksi.\" "
  },
  {
    "id": 36579,
    "hadith_number": 416,
    "tajuk_hadith": "Solat Orang Berkahwin di Sebuah Bandar",
    "perawi_melayu": "Abdullah bin ‘AbdurRahman bin Abi Dhubab meriwayatkan daripada bapanya bahawa ‘Uthman bin ‘Affan (رضي الله عنه) menunaikan solat empat rakaat di Mina dan orang ramai membantahnya.  Baginda berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو سَعِيدٍ يَعْنِي مَوْلَى بَنِي هَاشِمٍ، حَدَّثَنَا عِكْرِمَةُ بْنُ إِبْرَاهِيمَ الْبَاهِلِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أَبِي ذُبَابٍ، عَنْ أَبِيهِ، أَنَّ عُثْمَانَ بْنَ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ صَلَّى بِمِنًى أَرْبَعَ رَكَعَاتٍ فَأَنْكَرَهُ النَّاسُ عَلَيْهِ فَقَالَ يَا أَيُّهَا النَّاسُ إِنِّي تَأَهَّلْتُ بِمَكَّةَ مُنْذُ قَدِمْتُ وَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ تَأَهَّلَ فِي بَلَدٍ فَلْيُصَلِّ صَلَاةَ الْمُقِيمِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Said iaitu hamba sahaya Bani Hashim, telah menceritakan kepada kami ‘Ikrimah bin Ibrahim Al-Bahili, telah menceritakan kepada kami Abdullah bin Abdur Rahman bin Abi Dhubab, daripada bapanya, bahawa Usman bin ‘Affan (رضي الله عنه) telah menunaikan solat empat rakaat di Mina, lalu manusia membantahnya. Maka beliau berkata, \"Wahai sekalian manusia, sesungguhnya aku telah berkahwin di Mekah sejak aku tiba, dan sesungguhnya aku telah mendengar Rasulullah ﷺ bersabda: Barangsiapa yang berkahwin di sesuatu negeri, maka hendaklah dia menunaikan solat seperti penduduk tetap.\" "
  },
  {
    "id": 36580,
    "hadith_number": 417,
    "tajuk_hadith": "Kejujuran dalam Perniagaan",
    "perawi_melayu": "Sae'ed bin al-Musayyab berkata: Aku mendengar 'Uthman (رضي الله عنه) menyampaikan khutbah di mimbar.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو سَعِيدٍ، مَوْلَى بَنِي هَاشِمٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ لَهِيعَةَ، حَدَّثَنَا مُوسَى بْنُ وَرْدَانَ، قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ سَمِعْتُ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ يَخْطُبُ عَلَى الْمِنْبَرِ وَهُوَ يَقُولُ كُنْتُ أَبْتَاعُ التَّمْرَ مِنْ بَطْنٍ مِنْ الْيَهُودِ يُقَالُ لَهُمْ بَنُو قَيْنُقَاعَ فَأَبِيعُهُ بِرِبْحٍ فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا عُثْمَانُ إِذَا اشْتَرَيْتَ فَاكْتَلْ وَإِذَا بِعْتَ فَكِلْ حَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ حَدَّثَنَا ابْنُ لَهِيعَةَ حَدَّثَنَا مُوسَى بْنُ وَرْدَانَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ فَذَكَرَ مِثْلَهُ‏.‏",
    "malay_translation": "Aku mendengar daripada Said bin al-Musayyab, bahawa beliau berkata: Aku mendengar 'Uthman bin Affan (رضي الله عنه) menyampaikan khutbah di atas mimbar, sambil berkata: Aku selalu membeli tamar daripada kabilah Yahudi yang dikenali sebagai Bani Qainuqa' dan menjualnya dengan mengambil untung. Perkara ini sampai kepada Rasulullah ﷺ, lalu baginda bersabda: Wahai 'Uthman, apabila engkau membeli, maka cukupkan hakmu dan janganlah meminta lebih, dan apabila engkau menjual, maka cukupkan hak orang lain dan janganlah mengurangkannya."
  },
  {
    "id": 36581,
    "hadith_number": 418,
    "tajuk_hadith": "Perlindungan dengan menyebut Nama Allah",
    "perawi_melayu": "Daripada Aban bin Utsman bahawa bapanya berkata:",
    "english_text": "The Messenger of Allah (ﷺ) said: `Whoever says in the Name of Allah, with whose name nothing on earth or in heaven can cause harm, and He is the All-Hearing, All-Knowing, nothing will harm him.`",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ بْنُ أَبِي قُرَّةَ، حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ، عَنْ أَبِيهِ، عَنْ أَبَانَ بْنِ عُثْمَانَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَالَ بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ لَمْ يَضُرَّهُ شَيْءٌ‏.‏",
    "malay_translation": "Daripada Aban bin Utsman bahawa bapanya berkata, Rasulullah SAW bersabda:  \"Barangsiapa yang berkata, 'Bismillah (Dengan Nama Allah) yang dengan menyebut nama-Nya tiada sesuatu pun di bumi mahupun di langit yang mampu mendatangkan mudarat, dan Dia Maha Mendengar lagi Maha Mengetahui,' maka tiadalah sesuatu pun yang akan membahayakannya.\""
  },
  {
    "id": 36582,
    "hadith_number": 419,
    "tajuk_hadith": "Kalimat yang Menjamin Selamat daripada Api Neraka",
    "perawi_melayu": "Daripada Hurman bin Aban bahawa Uthman bin Affan (رضي الله عنه) berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْوَهَّابِ الْخَفَّافُ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ مُسْلِمِ بْنِ يَسَارٍ، عَنْ حُمْرَانَ بْنِ أَبَانَ، أَنَّ عُثْمَانَ بْنَ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنِّي لَأَعْلَمُ كَلِمَةً لَا يَقُولُهَا عَبْدٌ حَقًّا مِنْ قَلْبِهِ إِلَّا حُرِّمَ عَلَى النَّارِ فَقَالَ لَهُ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ أَنَا أُحَدِّثُكَ مَا هِيَ هِيَ كَلِمَةُ الْإِخْلَاصِ الَّتِي أَعَزَّ اللَّهُ تَبَارَكَ وَتَعَالَى بِهَا مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابَهُ وَهِيَ كَلِمَةُ التَّقْوَى الَّتِي أَلَاصَ عَلَيْهَا نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَمَّهُ أَبَا طَالِبٍ عِنْدَ الْمَوْتِ شَهَادَةُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abd al-Wahhab al-Khaffaf, telah menceritakan kepada kami Sa'id, dari Qatadah, dari Muslim bin Yasar, dari Hurman bin Aban, bahawa Uthman bin Affan (رضي الله عنه) berkata: Aku mendengar Rasulullah ﷺ bersabda:  \"Sesungguhnya aku mengetahui satu kalimah yang jika seorang hamba mengucapkannya dengan benar dari hatinya, nescaya dia akan diharamkan daripada api neraka.\"  Lalu Umar bin al-Khattab (رضي الله عنه) berkata kepadanya: \"Aku akan beritahu engkau apa ia. Ia adalah kalimah ikhlas yang dengannya Allah SWT memuliakan Muhammad ﷺ dan sahabat-sahabatnya. Dan ia juga adalah kalimah taqwa yang Nabi ﷺ pesan kepada bapa saudaranya, Abu Talib, ketika hampir mati, iaitu syahadah:  \"Tiada Tuhan melainkan Allah.\""
  },
  {
    "id": 36583,
    "hadith_number": 420,
    "tajuk_hadith": "Wuduk Selepas Jimak Tanpa Pancutan Mani",
    "perawi_melayu": "Abu Salamah meriwayatkan bahawa ‘Ata’ bin Yasar memberitahunya bahawa Zaid bin Khalid al-Juhani memberitahunya bahawa dia bertanya kepada ‘Uthman bin ‘Affan (رضي الله عنه):",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنِي أَبِي، حَدَّثَنَا الْحُسَيْنُ يَعْنِي الْمُعَلِّمَ، عَنْ يَحْيَى يَعْنِي ابْنَ أَبِي كَثِيرٍ، أَخْبَرَنِي أَبُو سَلَمَةَ، أَنَّ عَطَاءَ بْنَ يَسَارٍ، أخْبَرَهُ أَنَّ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ أَخْبَرَهُ أَنَّهُ، سَأَلَ عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ قُلْتُ أَرَأَيْتَ إِذَا جَامَعَ امْرَأَتَهُ وَلَمْ يُمْنِ فَقَالَ عُثْمَانُ يَتَوَضَّأُ كَمَا يَتَوَضَّأُ لِلصَّلَاةِ وَيَغْسِلُ ذَكَرَهُ وَقَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلْتُ عَنْ ذَلِكَ عَلِيَّ بْنَ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ وَالزُّبَيْرَ بْنَ الْعَوَّامِ وَطَلْحَةَ بْنَ عُبَيْدِ اللَّهِ وَأُبَيَّ بْنَ كَعْبٍ فَأَمَرُوهُ بِذَلِكَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdus Samad, telah menceritakan kepadaku ayahku, telah menceritakan kepada kami Al-Husain iaitu Al-Mu'allim, dari Yahya iaitu Ibnu Abi Katsir, telah memberitakan kepadaku Abu Salamah, bahawa ‘Ata’ bin Yasar, telah memberitahunya bahawa Zaid bin Khalid Al-Juhani memberitahunya bahawa dia telah bertanya kepada ‘Uthman bin Affan (رضي الله عنه): Aku berkata, “Bagaimana pendapatmu jika seseorang itu melakukan hubungan intim dengan isterinya tetapi tidak pancut mani?” Maka ‘Uthman berkata, “Hendaklah dia berwuduk seperti berwuduk untuk solat dan membasuh zakarnya.” Dan ‘Uthman (رضي الله عنه) berkata, “Aku mendengarnya daripada Rasulullah ﷺ.  Maka aku bertanya tentang hal itu kepada Ali bin Abi Talib (رضي الله عنه), Az-Zubair bin Al-Awwam, Thalhah bin Ubaidillah dan Ubayy bin Ka’ab, lalu mereka menyuruhnya berbuat demikian.”"
  },
  {
    "id": 36584,
    "hadith_number": 421,
    "tajuk_hadith": "Meninggikan Darjat Melalui Ilmu",
    "perawi_melayu": "Ubaid bin Abi Qurrah berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ بْنُ أَبِي قُرَّةَ، قَالَ سَمِعْتُ مَالِكَ بْنَ أَنَسٍ، يَقُولُ نَرْفَعُ دَرَجَاتٍ مَنْ نَشَاءُ قَالَ بِالْعِلْمِ قُلْتُ مَنْ حَدَّثَكَ قَالَ زَعَمَ ذَاكَ زَيْدُ بْنُ أَسْلَمَ‏.‏",
    "malay_translation": "Ubaid bin Abi Qurrah meriwayatkan: Aku mendengar Malik bin Anas berkata, \"Kami meninggikan darjat sesiapa yang Kami kehendaki.\"  Beliau berkata, \"Melalui ilmu.\" Aku bertanya, \"Siapakah yang memberitahu engkau?\" Beliau menjawab, \"Zaid bin Aslam yang mengatakan demikian.\""
  },
  {
    "id": 36585,
    "hadith_number": 422,
    "tajuk_hadith": "Surah Tambahan Dua Sujud",
    "perawi_melayu": "Daripada Usman bin Affan (رضي الله عنه)",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، حَدَّثَنَا مَسَرَّةُ بْنُ مَعْبَدٍ، عَنْ يَزِيدَ بْنِ أَبِي كَبْشَةَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي صَلَّيْتُ فَلَمْ أَدْرِ أَشَفَعْتُ أَمْ أَوْتَرْتُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِيَّايَ وَأَنْ يَتَلَعَّبَ بِكُمْ الشَّيْطَانُ فِي صَلَاتِكُمْ مَنْ صَلَّى مِنْكُمْ فَلَمْ يَدْرِ أَشَفَعَ أَوْ أَوْتَرَ فَلْيَسْجُدْ سَجْدَتَيْنِ فَإِنَّهُمَا تَمَامُ صَلَاتِهِ.\n\nحَدَّثَنَا يَحْيَى بْنُ مَعِينٍ وَزِيَادُ بْنُ أَيُّوبَ قَالَا حَدَّثَنَا سَوَّارٌ أَبُو عُمَارَةَ الرَّمْلِيُّ عَنْ مَسِيرَةَ بْنِ مَعْبَدٍ قَالَ صَلَّى بِنَا يَزِيدُ بْنُ أَبِي كَبْشَةَ الْعَصْرَ فَانْصَرَفَ إِلَيْنَا بَعْدَ صَلَاتِهِ فَقَالَ إِنِّي صَلَّيْتُ مَعَ مَرْوَانَ بْنِ الْحَكَمِ فَسَجَدَ مِثْلَ هَاتَيْنِ السَّجْدَتَيْنِ ثُمَّ انْصَرَفَ إِلَيْنَا فَأَعْلَمَنَا أَنَّهُ صَلَّى مَعَ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ وَحَدَّثَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مِثْلَهُ نَحْوَهُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Abdullah bin Zubair, telah menceritakan kepada kami Masrah bin Ma'bad, daripada Yazid bin Abi Kabshah, daripada Usman bin Affan (رضي الله عنه), bahawa baginda berkata:  Seorang lelaki datang kepada Nabi SAW lalu berkata: Wahai Rasulullah, saya telah solat tetapi saya tidak pasti sama ada solat saya genap atau ganjil bilangan rakaatnya. Maka Rasulullah SAW bersabda:  Aku wasiatkan kepadamu dan supaya syaitan jangan mempermainkan kamu dalam solat kamu. Sesiapa di antara kamu yang solat dan tidak pasti sama ada solatnya genap atau ganjil bilangan rakaatnya, hendaklah dia melakukan dua kali sujud kerana ia adalah penyempurnaan solatnya.\n\nTelah menceritakan kepada kami Yahya bin Ma'in dan Ziyad bin Ayyub, keduanya berkata: Telah menceritakan kepada kami Sawwar Abu Umarah ar-Ramli daripada Masirah bin Ma'bad, bahawa Yazid bin Abi Kabshah telah menjadi imam solat Asar kami. Kemudian dia berpaling kepada kami selepas solat dan berkata: Sesungguhnya aku telah solat bersama Marwan bin al-Hakam, lalu dia melakukan dua kali sujud seperti ini. Kemudian dia berpaling kepada kami dan memberitahu kami bahawa dia telah solat bersama Usman (رضي الله عنه) dan telah meriwayatkan daripada Nabi SAW, lalu dia menyebut perkara yang serupa."
  },
  {
    "id": 36586,
    "hadith_number": 423,
    "tajuk_hadith": "Hukum Menumpahkan Darah Seorang Muslim",
    "perawi_melayu": "Daripada Nafi' daripada Ibnu Umar, bahawa Uthman (رضي الله عنه) melihat kepada sahabat-sahabatnya ketika beliau terkepung dan berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ سُلَيْمَانَ، قَالَ سَمِعْتُ مُغِيرَةَ بْنَ مُسْلِمٍ أَبَا سَلَمَةَ، يَذْكُرُ عَنْ مَطَرٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ أَشْرَفَ عَلَى أَصْحَابِهِ وَهُوَ مَحْصُورٌ فَقَالَ عَلَامَ تَقْتُلُونِي فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلَّا بِإِحْدَى ثَلَاثٍ رَجُلٌ زَنَى بَعْدَ إِحْصَانِهِ فَعَلَيْهِ الرَّجْمُ أَوْ قَتَلَ عَمْدًا فَعَلَيْهِ الْقَوَدُ أَوْ ارْتَدَّ بَعْدَ إِسْلَامِهِ فَعَلَيْهِ الْقَتْلُ فَوَاللَّهِ مَا زَنَيْتُ فِي جَاهِلِيَّةٍ وَلَا إِسْلَامٍ وَلَا قَتَلْتُ أَحَدًا فَأُقِيدَ نَفْسِي مِنْهُ وَلَا ارْتَدَدْتُ مُنْذُ أَسْلَمْتُ إِنِّي أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ishaq bin Sulaiman, dia berkata: Aku mendengar Mughirah bin Muslim Abu Salamah menyebutkan daripada Matar, daripada Nafi', daripada Ibnu Umar, bahawa Uthman (رضي الله عنه) memandang ke arah sahabat-sahabatnya ketika beliau terkepung lalu berkata: “Mengapa kamu membunuhku?  Sesungguhnya aku mendengar Rasulullah ﷺ bersabda: “Tidak halal darah seorang muslim melainkan dengan salah satu daripada tiga perkara:  seorang lelaki berzina setelah memelihara kehormatannya maka hukumannya ialah rejam; atau membunuh dengan sengaja maka hukumannya ialah qisas (balasan); atau murtad setelah memeluk Islam maka hukumannya ialah dibunuh.” Demi Allah, aku tidak pernah berzina sama ada pada zaman Jahiliyyah mahupun dalam Islam, dan aku tidak pernah membunuh sesiapa sehingga nyawaku dibalas, dan aku tidak pernah murtad sejak aku memeluk Islam. Sesungguhnya aku bersaksi bahawa tiada Tuhan melainkan Allah dan bahawa Muhammad adalah hamba dan rasul-Nya.”"
  },
  {
    "id": 36587,
    "hadith_number": 424,
    "tajuk_hadith": "Keutamaan Menunaikan Hak Allah",
    "perawi_melayu": "Daripada Abu Dzar yang datang meminta izin untuk bertemu Usman bin Affan r.a.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَسَنُ بْنُ مُوسَى، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ لَهِيعَةَ، حَدَّثَنَا أَبُو قَبِيلٍ، قَالَ سَمِعْتُ مَالِكَ بْنَ عَبْدِ اللَّهِ الْبَرْدَادِيَّ، يُحَدِّثُ عَنْ أَبِي ذَرٍّ، أَنَّهُ جَاءَ يَسْتَأْذِنُ عَلَى عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ فَأَذِنَ لَهُ وَبِيَدِهِ عَصَاهُ فَقَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ يَا كَعْبُ إِنَّ عَبْدَ الرَّحْمَنِ تُوُفِّيَ وَتَرَكَ مَالًا فَمَا تَرَى فِيهِ فَقَالَ إِنْ كَانَ يَصِلُ فِيهِ حَقَّ اللَّهِ فَلَا بَأْسَ عَلَيْهِ فَرَفَعَ أَبُو ذَرٍّ عَصَاهُ فَضَرَبَ كَعْبًا وَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا أُحِبُّ لَوْ أَنَّ لِي هَذَا الْجَبَلَ ذَهَبًا أُنْفِقُهُ وَيُتَقَبَّلُ مِنِّي أَذَرُ خَلْفِي مِنْهُ سِتَّ أَوَاقٍ أَنْشُدُكَ اللَّهَ يَا عُثْمَانُ أَسَمِعْتَهُ ثَلَاثَ مَرَّاتٍ قَالَ نَعَمْ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Hasan bin Musa, telah menceritakan kepada kami Abdullah bin Lahi'ah, telah menceritakan kepada kami Abu Qabil, dia berkata; aku mendengar Malik bin Abdullah Al-Bardadli menceritakan dari Abu Dzar bahawa dia datang meminta izin kepada Usman bin Affan r.a., lalu Usman r.a. memberi izin kepadanya. Di tangan Abu Dzar ada sebatang tongkat. Usman r.a. berkata: Wahai Ka'ab, sesungguhnya Abdurrahman telah meninggal dunia dan meninggalkan harta. Apakah pendapatmu tentang hartanya? Ka'ab menjawab: Jika dia telah menunaikan hak Allah ke atas hartanya, maka tidak mengapa. Lalu Abu Dzar mengangkat tongkatnya dan memukul Ka'ab sambil berkata: Aku mendengar Rasulullah SAW bersabda: Aku tidak suka sekalipun aku memiliki gunung emas, lalu aku menginfakkannya dan diterima oleh Allah SWT, tetapi aku masih meninggalkan enam oqiyyah daripadanya. Aku bersumpah kepadamu wahai Usman (tiga kali), adakah engkau mendengarnya? Usman menjawab: Ya."
  },
  {
    "id": 36588,
    "hadith_number": 425,
    "tajuk_hadith": "Kegerunan Kubur: Tahap Pertama Akhirat",
    "perawi_melayu": "Daripada riwayat Hani`, hamba sahaya yang dimerdekakan Usman (رضي الله عنه), katanya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ، حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بَحِيرٍ الْقَاصُّ، عَنْ هَانِئٍ، مَوْلَى عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ قَالَ كَانَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ إِذَا وَقَفَ عَلَى قَبْرٍ بَكَى حَتَّى يَبُلَّ لِحْيَتَهُ فَقِيلَ لَهُ تَذْكُرُ الْجَنَّةَ وَالنَّارَ فَلَا تَبْكِي وَتَبْكِي مِنْ هَذَا فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْقَبْرُ أَوَّلُ مَنَازِلِ الْآخِرَةِ فَإِنْ يَنْجُ مِنْهُ فَمَا بَعْدَهُ أَيْسَرُ مِنْهُ وَإِنْ لَمْ يَنْجُ مِنْهُ فَمَا بَعْدَهُ أَشَدُّ مِنْهُ قَالَ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاللَّهِ مَا رَأَيْتُ مَنْظَرًا قَطُّ إِلَّا وَالْقَبْرُ أَفْظَعُ مِنْهُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah, telah menceritakan kepada kami Yahya bin Ma'in, telah menceritakan kepada kami Hisyam bin Yusuf, telah menceritakan kepadaku Abdullah bin Bahirah al-Qashsh, daripada Hani', hamba sahaya Usman (رضي الله عنه), katanya: Usman (رضي الله عنه) apabila berdiri di sisi kubur, dia menangis sehingga janggutnya basah. Lalu dikatakan kepadanya: “Engkau mengingati syurga dan neraka, tetapi engkau tidak menangis, akan tetapi engkau menangis kerana ini?”  Dia berkata: “Sesungguhnya Rasulullah ﷺ bersabda: ‘Kubur adalah tempat tinggal pertama di akhirat. Jika seseorang terselamat daripadanya (iaitu, azabnya), maka apa yang selepasnya lebih mudah darinya. Tetapi jika seseorang tidak terselamat daripadanya (iaitu, azabnya), maka apa yang selepasnya lebih berat darinya.’  Rasulullah ﷺ juga bersabda: Demi Allah, aku tidak pernah melihat pemandangan yang menakutkan melainkan kubur lebih menakutkan darinya.”"
  },
  {
    "id": 36589,
    "hadith_number": 426,
    "tajuk_hadith": "Pelantikan Khalifah oleh Uthman",
    "perawi_melayu": "Daripada Hisyam bin Urwah daripada bapanya daripada Marwan, dan kami tidak mempunyai sebab untuk syak padanya, yang berkata, Uthman (رضي الله عنه) mengalami pendarahan hidung pada tahun pendarahan hidung, (yang begitu teruk sehingga dia ketinggalan daripada menunaikan haji dan memberi wasiat terakhirnya (kerana dia fikir dia akan mati). Seorang lelaki dari Quraish masuk mengunjunginya dan berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ مَرْوَانَ، وَمَا إِخَالُهُ يُتَّهَمُ عَلَيْنَا قَالَ أَصَابَ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ رُعَافٌ سَنَةَ الرُّعَافِ حَتَّى تَخَلَّفَ عَنْ الْحَجِّ وَأَوْصَى فَدَخَلَ عَلَيْهِ رَجُلٌ مِنْ قُرَيْشٍ فَقَالَ اسْتَخْلِفْ قَالَ وَقَالُوهُ قَالَ نَعَمْ قَالَ مَنْ هُوَ قَالَ فَسَكَتَ قَالَ ثُمَّ دَخَلَ عَلَيْهِ رَجُلٌ آخَرُ فَقَالَ لَهُ مِثْلَ مَا قَالَ لَهُ الْأَوَّلُ وَرَدَّ عَلَيْهِ نَحْوَ ذَلِكَ قَالَ فَقَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ قَالُوا الزُّبَيْرَ قَالَ نَعَمْ قَالَ أَمَا وَالَّذِي نَفْسِي بِيَدِهِ إِنْ كَانَ لَخَيْرَهُمْ مَا عَلِمْتُ وَأَحَبَّهُمْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَاه سُوَيْدٌ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ بِإِسْنَادِهِ مِثْلَهُ‏.‏",
    "malay_translation": "Zakaria bin Adi telah meriwayatkan kepada kami, Ali bin Mushir telah meriwayatkan kepada kami, daripada Hisyam bin Urwah, daripada bapanya, daripada Marwan, dan kami tidak menyangka dia dituduh, yang berkata, Uthman (رضي الله عنه) mengalami pendarahan hidung pada tahun pendarahan hidung, sehingga dia tertinggal daripada menunaikan haji dan memberi wasiat. Kemudian seorang lelaki dari Quraisy masuk mengunjunginya dan berkata, \"Lantiklah pengganti.\" Uthman bertanya, \"Adakah mereka mencadangkannya?\" Lelaki itu menjawab, \"Ya.\" Uthman bertanya lagi, \"Siapa yang mereka cadangkan?\" Lelaki itu terdiam. Kemudian seorang lelaki lain masuk dan berkata seperti yang dikatakan lelaki pertama, dan Uthman menjawab dengan serupa.  Lalu Uthman (رضي الله عنه) berkata, \"Mereka mencadangkan Zubair?\" Jawabnya, \"Ya.\" Uthman berkata, \"Demi Allah yang memegang jiwaku, sesungguhnya dia adalah sebaik-baik mereka yang aku ketahui dan paling disayangi oleh Rasulullah ﷺ.\" Abdullah telah meriwayatkan kepada kami; Suwaid telah meriwayatkan kepada kami; Ali bin Mushir telah meriwayatkan dengan sanadnya yang serupa."
  },
  {
    "id": 36590,
    "hadith_number": 427,
    "tajuk_hadith": "Berdiri Sempena Jenazah",
    "perawi_melayu": "Daripada Musa bin Imran bin Mannah berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا زَكَرِيَّا بْنُ أَبِي زَكَرِيَّا، حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أُمَيَّةَ، عَنْ مُوسَى بْنِ عِمْرَانَ بْنِ مَنَّاحٍ، قَالَ رَأَى أَبَانُ بْنُ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ جَنَازَةً فَقَامَ لَهَا وَقَالَ رَأَى عُثْمَانُ بْنُ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ جَنَازَةً فَقَامَ لَهَا ثُمَّ حَدَّثَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى جَنَازَةً فَقَامَ لَهَا‏.‏",
    "malay_translation": "Zakaria bin Abi Zakaria telah meriwayatkan kepada kami, Yahya bin Sulaiman telah meriwayatkan kepada kami, Ismail bin Umaiyyah telah meriwayatkan kepada kami, daripada Musa bin Imran bin Mannah, berkata: Aban bin Uthman رضي الله عنه melihat jenazah lalu berdiri menghormatinya. Dan dia berkata: Uthman bin Affan رضي الله عنه melihat jenazah lalu berdiri menghormatinya, kemudian dia meriwayatkan bahawa Rasulullah ﷺ melihat jenazah lalu berdiri menghormatinya."
  },
  {
    "id": 36591,
    "hadith_number": 428,
    "tajuk_hadith": "Wuduk Selepas Jima' Tanpa Pancutan Mani",
    "perawi_melayu": "Daripada Zaid bin Khalid al-Juhani yang bertanya kepada Uthman bin Affan (رضي الله عنه):",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَسَنُ بْنُ مُوسَى، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، أَنَّ عَطَاءَ بْنَ يَسَارٍ، أَخْبَرَهُ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَخْبَرَهُ أَنَّهُ، سَأَلَ عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ قَالَ قُلْتُ أَرَأَيْتَ إِذَا جَامَعَ الرَّجُلُ امْرَأَتَهُ وَلَمْ يُمْنِ فَقَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ يَتَوَضَّأُ كَمَا يَتَوَضَّأُ لِلصَّلَاةِ وَيَغْسِلُ ذَكَرَهُ قَالَ وَقَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلْتُ عَنْ ذَلِكَ عَلِيَّ بْنَ أَبِي طَالِبٍ وَالزُّبَيْرَ وَطَلْحَةَ وَأُبَيَّ بْنَ كَعْبٍ فَأَمَرُوهُ بِذَلِكَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Hasan bin Musa, telah menceritakan kepada kami Syaiban, daripada Yahya bin Abi Katsir, daripada Abi Salamah, bahawa Ata’ bin Yasar, memberitahunya daripada Zaid bin Khalid al-Juhani, memberitahunya bahawa dia telah bertanya kepada Uthman bin Affan (رضي الله عنه), katanya: Aku bertanya, “Bagaimana jika seseorang melakukan jima’ dengan isterinya tetapi tidak pancut mani?” Maka Uthman (رضي الله عنه) berkata: “Dia hendaklah berwuduk seperti berwuduk untuk solat dan membasuh zakarnya.”  Uthman (رضي الله عنه) berkata lagi: “Aku mendengarnya daripada Rasulullah ﷺ.  Kemudian aku bertanya tentang hal itu kepada Ali bin Abi Talib, Zubair, Thalhah dan Ubay bin Ka’ab, dan mereka semua menyuruh melakukan perkara yang sama.”"
  },
  {
    "id": 36592,
    "hadith_number": 429,
    "tajuk_hadith": "Pengampunan Dosa Selepas Wuduk dan Solat Dua Rakaat",
    "perawi_melayu": "Mu'adz bin 'Abdur-Rahman meriwayatkan daripada Humran bin Aban yang memberitahunya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَسَنُ بْنُ مُوسَى، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، قَالَ أَخْبَرَنِي مُعَاذُ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ حُمْرَانَ بْنَ أَبَانَ، أَخْبَرَهُ قَالَ أَتَيْتُ عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ وَهُوَ جَالِسٌ فِي الْمَقَاعِدِ فَتَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي هَذَا الْمَجْلِسِ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ قَالَ مَنْ تَوَضَّأَ مِثْلَ وُضُوئِي هَذَا ثُمَّ أَتَى الْمَسْجِدَ فَرَكَعَ فِيهِ رَكْعَتَيْنِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا تَغْتَرُّوا‏.‏",
    "malay_translation": "Hassan bin Musa telah meriwayatkan kepada kami, daripada Syaiban, daripada Yahya, daripada Muhammad bin Ibrahim bin Harits al-Tamiimi, katanya: Mu'adz bin 'Abdur-Rahman telah memberitahu aku bahawa Humran bin Aban telah memberitahunya: Aku telah datang kepada Uthman bin Affan (radiallahu 'anhu) ketika beliau sedang duduk di al-Maqa'id. Maka beliau berwuduk dan berwuduk dengan sempurna, kemudian berkata: Aku telah melihat Rasulullah Sallallahu 'alaihi Wasallam ketika baginda berada di tempat ini berwuduk dan berwuduk dengan sempurna, kemudian baginda bersabda: \"Barangsiapa berwuduk seperti wudukku ini, kemudian pergi ke masjid dan mendirikan solat dua rakaat, nescaya dosa-dosanya yang telah lalu akan diampunkan.\" Dan beliau berkata: Rasulullah Sallallahu 'alaihi Wasallam bersabda: \"Dan janganlah kamu terlalu yakin (dengan amalanmu).\""
  },
  {
    "id": 36593,
    "hadith_number": 430,
    "tajuk_hadith": "Menghormati Bangsa Quraisy",
    "perawi_melayu": "’Ubaidullah bin Muhammad bin Hafs bin `Umar at-Taimi berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ حَفْصٍ بْنِ عُمَرَ التَّيْمِيُّ، قَالَ سَمِعْتُ أَبِي يَقُولُ، سَمِعْتُ عَمِّي، عُبَيْدَ اللَّهِ بْنَ عُمَرَ بْنِ مُوسَى يَقُولُ كُنْتُ عِنْدَ سُلَيْمَانَ بْنِ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ فَدَخَلَ شَيْخٌ مِنْ قُرَيْشٍ فَقَالَ سُلَيْمَانُ انْظُرْ إِلَى الشَّيْخِ فَأَقْعِدْهُ مَقْعَدًا صَالِحًا فَإِنَّ لِقُرَيْشٍ حَقًّا فَقُلْتُ أَيُّهَا الْأَمِيرُ أَلَا أُحَدِّثُكَ حَدِيثًا بَلَغَنِي عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَلَى قَالَ قُلْتُ لَهُ بَلَغَنِي أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَهَانَ قُرَيْشًا أَهَانَهُ اللَّهُ قَالَ سُبْحَانَ اللَّهِ مَا أَحْسَنَ هَذَا مَنْ حَدَّثَكَ هَذَا قَالَ قُلْتُ حَدَّثَنِيهِ رَبِيعَةُ بْنُ أَبِي عَبْدِ الرَّحْمَنِ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ عَمْرِو بْنِ عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ لِي أَبِي يَا بُنَيَّ إِنْ وَلِيتَ مِنْ أَمْرِ النَّاسِ شَيْئًا فَأَكْرِمْ قُرَيْشًا فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ أَهَانَ قُرَيْشًا أَهَانَهُ اللَّهُ‏.‏",
    "malay_translation": "Aku mendengar bapaku berkata: Aku mendengar bapa saudaraku, Ubaidullah bin Umar bin Musa berkata: Aku berada di sisi Sulaiman bin Ali رضي الله عنه, lalu masuklah seorang lelaki tua daripada kalangan Quraisy. Sulaiman berkata: Lihatlah orang tua ini, tempatkanlah dia di tempat duduk yang baik, kerana Quraisy mempunyai hak. Aku berkata: Wahai Amir, bolehkah aku menceritakan kepadamu sebuah hadis yang sampai kepadaku daripada Rasulullah ﷺ? Dia berkata: Boleh. Aku berkata kepadanya: Telah sampai kepadaku bahawa Rasulullah ﷺ bersabda: “Barangsiapa yang menghina Quraisy, nescaya Allah akan menghinanya.” Dia berkata: Subhanallah, betapa baiknya hadis ini! Siapakah yang memberitahu kamu hadis ini? Aku berkata: Rabiah bin Abi Abdur Rahman memberitahu aku, daripada Sa’id bin al-Musayyab, daripada Amr bin Uthman bin Affan رضي الله عنه yang berkata: Bapaku berkata kepadaku: Wahai anakku, jika engkau diangkat mentadbir sesuatu urusan manusia, maka muliakanlah Quraisy, kerana sesungguhnya aku mendengar Rasulullah ﷺ bersabda: “Barangsiapa yang menghina Quraisy, nescaya Allah akan menghinanya.”"
  },
  {
    "id": 36594,
    "hadith_number": 431,
    "tajuk_hadith": "Abdullah bin Zubair dan Pengepungan di Mekah",
    "perawi_melayu": "Daripada Usman bin Affan (رضي الله عنه). Abdullah bin az-Zubair berkata kepadanya ketika beliau dikepung:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبَانَ الْوَرَّاقُ، حَدَّثَنَا يَعْقُوبُ، عَنْ جَعْفَرِ بْنِ أَبِي الْمُغِيرَةِ، عَنِ ابْنِ أَبْزَى، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ لَهُ عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ حِينَ حُصِرَ إِنَّ عِنْدِي نَجَائِبَ قَدْ أَعْدَدْتُهَا لَكَ فَهَلْ لَكَ أَنْ تَحَوَّلَ إِلَى مَكَّةَ فَيَأْتِيَكَ مَنْ أَرَادَ أَنْ يَأْتِيَكَ قَالَ لَا إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يُلْحَدُ بِمَكَّةَ كَبْشٌ مِنْ قُرَيْشٍ اسْمُهُ عَبْدُ اللَّهِ عَلَيْهِ مِثْلُ نِصْفِ أَوْزَارِ النَّاسِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ismail bin Aban al-Warraq, telah menceritakan kepada kami Ya’qub, dari Ja’far bin Abi Mughīrah, dari Ibnu Abza’, dari Usman bin ‘Affan (رضي الله عنه), beliau berkata: Abdullah bin Zubair berkata kepadanya ketika beliau dikepung, “Sesungguhnya aku mempunyai unta-unta yang telah aku sediakan untukmu.  Bagaimana pendapatmu jika engkau berpindah ke Mekah, maka sesiapa yang ingin mendatangimu boleh mendatangimu?” Beliau berkata, “Tidak, sesungguhnya aku telah mendengar Rasulullah ﷺ bersabda: “Akan dikuburkan di Mekah seekor kambing daripada Quraisy yang bernama Abdullah, di atasnya seberat separuh daripada dosa-dosa manusia.”"
  },
  {
    "id": 36595,
    "hadith_number": 432,
    "tajuk_hadith": "Larangan Menikah, Mempelawa atau Merisik Semasa Ihram",
    "perawi_melayu": "Daripada Usman bin Affan رضي الله عنه, bahawa Rasulullah ﷺ bersabda:",
    "english_text": "`The pilgrim in ihram should not get married, arrange a marriage or propose marriage.”",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَكْرٍ، وَمُحَمَّدُ بْنُ جَعْفَرٍ، قَالَا حَدَّثَنَا سَعِيدٌ، عَنْ مَطَرٍ، وَيَعْلَى بْنِ حَكِيمٍ، عَنْ نَافِعٍ، عَنْ نُبَيْهِ بْنِ وَهْبٍ، عَنْ أَبَانَ بْنِ عُثْمَانَ بْنِ عَفَّانَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَنْكِحُ الْمُحْرِمُ وَلَا يُنْكِحُ وَلَا يَخْطُبُ‏.‏",
    "malay_translation": "Daripada Usman bin Affan رضي الله عنه bahawa Rasulullah ﷺ bersabda:  Orang yang sedang ihram tidak boleh berkahwin, menikahkan orang lain, mahupun meminang."
  },
  {
    "id": 36596,
    "hadith_number": 433,
    "tajuk_hadith": "Keutamaan Berjaga Satu Malam di Jalan Allah",
    "perawi_melayu": "Daripada Abdullah bin az-Zubair, katanya:",
    "english_text": "`Uthman bin `Affan (رضي الله عنه) said, speaking from his minbar:  I am going to tell you a hadeeth that I heard from the Messenger of Allah (ﷺ) ; nothing kept me from telling it to you except the fact that I care for you. I heard the Messenger of Allah (ﷺ) say: “Standing guard for one night for the sake of Allah, may He be exalted, is better than a thousand nights spent in prayer and  days spent fasting.`",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا كَهْمَسٌ، حَدَّثَنَا مُصْعَبُ بْنُ ثَابِتٍ، عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، قَالَ قَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ وَهُوَ يَخْطُبُ عَلَى مِنْبَرِهِ إِنِّي مُحَدِّثُكُمْ حَدِيثًا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَكُنْ يَمْنَعُنِي أَنْ أُحَدِّثَكُمْ بِهِ إِلَّا الضِّنُّ بِكُمْ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ حَرَسُ لَيْلَةٍ فِي سَبِيلِ اللَّهِ أَفْضَلُ مِنْ أَلْفِ لَيْلَةٍ يُقَامُ لَيْلُهَا وَيُصَامُ نَهَارُهَا‏.‏",
    "malay_translation": "Daripada Abdullah bin az-Zubair, katanya: Usman bin Affan (رضي الله عنه) berkata ketika berkhutbah di atas mimbarnya: \"Aku akan menceritakan kepada kamu sebuah hadis yang aku dengar daripada Rasulullah ﷺ.  Tiada apa yang menghalang aku daripada menceritakannya kepadamu kecuali rasa kasih sayangku terhadap kamu.  Aku mendengar Rasulullah ﷺ bersabda:  'Berjaga satu malam di jalan Allah, Maha Tinggi keagungan-Nya, lebih afdal daripada seribu malam yang diqiamkan malamnya dan dipenuhi dengan puasa pada siang harinya.'\""
  },
  {
    "id": 36597,
    "hadith_number": 434,
    "tajuk_hadith": "Kematian dalam Iman Menerima Syurga",
    "perawi_melayu": "Daripada Usman bin Affan (رضي الله عنه), bahawa Nabi SAW bersabda:",
    "english_text": "“Whoever dies knowing that there is no god but Allah will enter Paradise.”",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ خَالِدًا، عَنْ أَبِي بِشْرٍ الْعَنْبَرِيِّ، عَنْ حُمْرَانَ بْنِ أَبَانَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ مَاتَ وَهُوَ يَعْلَمُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ دَخَلَ الْجَنَّةَ‏.‏",
    "malay_translation": "Daripada Muhammad bin Ja’far, daripada Syu’bah, katanya: Aku mendengar Khalid, daripada Abu Basyir Al-‘Anbari, daripada Humran bin Aban, daripada Usman bin Affan (رضي الله عنه), bahawa Nabi SAW bersabda: “Sesiapa yang mati dalam keadaan mengetahui bahawa tiada Tuhan melainkan Allah, nescaya dia akan masuk syurga.”"
  },
  {
    "id": 36598,
    "hadith_number": 435,
    "tajuk_hadith": "Rawatan Mata Semasa Ihram",
    "perawi_melayu": "Nubaih bin Wahb",
    "english_text": "Nubaih bin Wahb narrated that the eye of `Umar bin Ubaidullah became inflamed when he was in ihram, and he wanted to apply kohl to it, but Aban bin `Uthman (رضي الله عنه) forbade him to do that and told him to apply aloes to it. He said that `Uthman (رضي الله عنه) narrated from the Messenger of Allah (ﷺ) that he had done that.",
    "arabic_text": "حَدَّثَنَا عَفَّانُ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ بْنُ مُوسَى، حَدَّثَنِي نُبَيْهُ بْنُ وَهْبٍ، أَنَّ عُمَرَ بْنَ عُبَيْدِ اللَّهِ بْنِ مَعْمَرٍ، رَمِدَتْ عَيْنُهُ وَهُوَ مُحْرِمٌ فَأَرَادَ أَنْ يُكَحِّلَهَا فَنَهَاهُ أَبَانُ بْنُ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ وَأَمَرَهُ أَنْ يُضَمِّدَهَا بِالصَّبِرِ وَزَعَمَ أَنَّ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ حَدَّثَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ فَعَلَ ذَلِكَ‏.‏",
    "malay_translation": "Nubaih bin Wahb meriwayatkan bahawa mata Umar bin Ubaidillah menjadi radang ketika beliau dalam keadaan ihram, dan beliau ingin menggunakan kohl padanya, tetapi Aban bin Uthman (رضي الله عنه) melarangnya dan menyuruhnya menggunakan lidah buaya. Beliau berkata bahawa Uthman (رضي الله عنه) meriwayatkan daripada Rasulullah ﷺ bahawa baginda telah melakukannya."
  },
  {
    "id": 36599,
    "hadith_number": 436,
    "tajuk_hadith": "Larangan Menikah Ketika Ihram",
    "perawi_melayu": "Daripada Nubaih bin Wahb bahawa Umar bin Ubaidullah ingin menikahkan anaknya ketika dalam keadaan ihram, tetapi Aban melarangnya dan berkata bahawa Uthman meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "`The pilgrim in ihram should not get married, arrange a marriage or propose marriage.”",
    "arabic_text": "حَدَّثَنَا عَفَّانُ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ بْنُ مُوسَى، عَنْ نُبَيْهِ بْنِ وَهْبٍ، أَنَّ عُمَرَ بْنَ عُبَيْدِ اللَّهِ، أَرَادَ أَنْ يُزَوِّجَ، ابْنَهُ وَهُوَ مُحْرِمٌ فَنَهَاهُ أَبَانُ وَزَعَمَ أَنَّ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ حَدَّثَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُحْرِمُ لَا يَنْكِحُ وَلَا يُنْكِحُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Affan, telah menceritakan kepada kami Abdul Warits, telah menceritakan kepada kami Ayub bin Musa, dari Nubaih bin Wahb, bahawa Umar bin Ubaidillah ingin menikahkan anaknya ketika dia sedang dalam keadaan ihram.  Maka Aban melarangnya dan mendakwa bahawa Uthman r.a. telah meriwayatkan daripada Rasulullah SAW yang bersabda:  Orang yang sedang ihram tidak boleh mengahwini dan tidak boleh menikahkan."
  },
  {
    "id": 36600,
    "hadith_number": 437,
    "tajuk_hadith": "Hukum Anak Luar Nikah dalam Islam",
    "perawi_melayu": "Daripada riwayat Rabah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَفَّانُ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، قَالَ سَمِعْتُ مُحَمَّدَ بْنَ عَبْدِ اللَّهِ بْنِ أَبِي يَعْقُوبَ، يُحَدِّثُ عَنْ رَبَاحٍ، قَالَ زَوَّجَنِي أَهْلِي أَمَةً لَهُمْ رُومِيَّةً وَلَدَتْ لِي غُلَامًا أَسْوَدَ فَعَلِقَهَا عَبْدٌ رُومِيٌّ يُقَالُ لَهُ يُوحَنَّسُ فَجَعَلَ يُرَاطِنُهَا بِالرُّومِيَّةِ فَحَمَلَتْ وَقَدْ كَانَتْ وَلَدَتْ لِي غُلَامًا أَسْوَدَ مِثْلِي فَجَاءَتْ بِغُلَامٍ وَكَأَنَّهُ وَزَغَةٌ مِنْ الْوَزَغَاتِ فَقُلْتُ لَهَا مَا هَذَا فَقَالَتْ هُوَ مِنْ يُوحَنَّسَ فَسَأَلْتُ يُوحَنَّسَ فَاعْتَرَفَ فَأَتَيْتُ عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ فَذَكَرْتُ ذَلِكَ لَهُ فَأَرْسَلَ إِلَيْهِمَا فَسَأَلَهُمَا ثُمَّ قَالَ سَأَقْضِي بَيْنَكُمَا بِقَضَاءِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ فَأَلْحَقَهُ بِي قَالَ فَجَلَدَهُمَا فَوَلَدَتْ لِي بَعْدُ غُلَامًا أَسْوَدَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami 'Affan, telah menceritakan kepada kami Jarir bin Hazim, dia berkata; aku mendengar Muhammad bin Abdullah bin Abi Ya'qub menceritakan daripada Rabah, dia berkata; \"Keluargaku menikahkan aku dengan seorang hamba perempuan mereka, seorang perempuan Rom yang melahirkan seorang anak lelaki hitam untukku. Kemudian dia berzina dengan seorang hamba lelaki Rom yang bernama Yuhannas, lalu dia merayunya dengan bahasa Rom, lalu dia hamil. Padahal sebelum ini dia telah melahirkan seorang anak lelaki hitam sepertiku, kemudian dia melahirkan seorang anak lelaki yang seakan-akan seekor cicak (iaitu sangat putih). Lalu aku bertanya kepadanya: \"Apakah ini?\" Dia menjawab: \"Dia adalah anak Yuhannas.\" Lalu aku bertanya kepada Yuhannas, lalu dia mengaku. Lalu aku pergi kepada Usman bin 'Affan radhiallahu 'anhu, lalu aku menceritakan hal itu kepadanya. Lalu dia menyuruh memanggil mereka berdua, lalu menyoal mereka, kemudian dia berkata: \"Aku akan mengadili di antara kamu berdua dengan hukum Rasulullah sallallahu 'alaihi wa sallam, iaitu anak itu adalah untuk suami isteri itu, dan bagi pezina itu tiada apa-apa.\" Lalu dia mewalikan anak itu kepadaku, lalu dia menyeksa mereka berdua. Kemudian isteriku itu melahirkan seorang anak lelaki hitam lagi.\" "
  },
  {
    "id": 36601,
    "hadith_number": 438,
    "tajuk_hadith": "Keharaman Menumpahkan Darah Muslim",
    "perawi_melayu": "Daripada Abu Umamah bin Sahl, beliau berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ، قَالَ كُنْتُ مَعَ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ فِي الدَّارِ وَهُوَ مَحْصُورٌ قَالَ وَكُنَّا نَدْخُلُ مَدْخَلًا إِذَا دَخَلْنَاهُ سَمِعْنَا كَلَامَ مَنْ عَلَى الْبَلَاطِ قَالَ فَدَخَلَ عُثْمَانُ يَوْمًا لِحَاجَةٍ فَخَرَجَ إِلَيْنَا مُنْتَقِعًا لَوْنُهُ فَقَالَ إِنَّهُمْ لَيَتَوَعَّدُونِي بِالْقَتْلِ آنِفًا قَالَ قُلْنَا يَكْفِيكَهُمُ اللَّهُ يَا أَمِيرَ الْمُؤْمِنِينَ قَالَ فَقَالَ وَبِمَ يَقْتُلُونِي فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّهُ لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلَّا فِي إِحْدَى ثَلَاثٍ رَجُلٌ كَفَرَ بَعْدَ إِسْلَامِهِ أَوْ زَنَى بَعْدَ إِحْصَانِهِ أَوْ قَتَلَ نَفْسًا بِغَيْرِ نَفْسٍ فَوَاللَّهِ مَا زَنَيْتُ فِي جَاهِلِيَّةٍ وَلَا إِسْلَامٍ وَلَا تَمَنَّيْتُ بَدَلًا بِدِينِي مُذْ هَدَانِي اللَّهُ عَزَّ وَجَلَّ وَلَا قَتَلْتُ نَفْسًا فَبِمَ يَقْتُلُونِي‏.‏",
    "malay_translation": "Aku berada bersama Uthman رضي الله عنه di dalam rumah ketika beliau dikepung. Kami akan masuk ke satu laluan, apabila kami memasukinya, kami dapat mendengar percakapan orang ramai di al-Balat.  Pada suatu hari, Uthman masuk ke situ kerana suatu keperluan, kemudian beliau keluar dengan wajah kemerahan dan berkata: \"Mereka baru sahaja mengancam untuk membunuhku.\" Kami berkata: \"Allah akan cukup bagimu terhadap mereka, wahai Amirul Mukminin.\" Beliau berkata: \"Mengapa mereka mahu membunuhku?  Sesungguhnya aku mendengar Rasulullah ﷺ bersabda:  \"Tidak halal menumpahkan darah seorang muslim melainkan dalam tiga keadaan; seseorang yang murtad setelah memeluk Islam, atau seseorang yang melakukan zina setelah berkahwin, atau seseorang yang membunuh seseorang tanpa qisas (balasan). Demi Allah, aku tidak pernah melakukan zina sama ada pada zaman Jahiliyyah mahupun dalam Islam... dan aku tidak pernah menginginkan perubahan agamaku sejak Allah, Maha Suci dan Maha Tinggi, telah membimbingku, dan aku tidak pernah membunuh sesiapa.  Jadi, mengapa mereka mahu membunuhku?\""
  },
  {
    "id": 36602,
    "hadith_number": 439,
    "tajuk_hadith": "Larangan Bercerita Palsu Tentang Rasulullah SAW",
    "perawi_melayu": "Daripada Amir bin Sa’d disebutkan bahawa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الزِّنَادِ، ح وَسُرَيْجٌ وَحُسَيْنٌ قَالَا حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ، عَنْ أَبِيهِ، عَنْ عَامِرِ بْنِ سَعْدٍ، قَالَ حُسَيْنُ ابْنُ أَبِي وَقَّاصٍ قَالَ سَمِعْتُ عُثْمَانَ بْنَ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ يَقُولُ مَا يَمْنَعُنِي أَنْ أُحَدِّثَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ لَا أَكُونَ أَوْعَى أَصْحَابِهِ عَنْهُ وَلَكِنِّي أَشْهَدُ لَسَمِعْتُهُ يَقُولُ مَنْ قَالَ عَلَيَّ مَا لَمْ أَقُلْ فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ وَقَالَ حُسَيْنٌ أَوْعَى صَحَابَتِهِ عَنْهُ‏.‏",
    "malay_translation": "Ishaq bin Isa telah meriwayatkan kepada kami, Abdul Rahman bin Abi Zinad telah meriwayatkan kepada kami, dan Suriyaj serta Husain berkata: Ibn Abi Zinad telah meriwayatkan kepada kami daripada bapanya, daripada Amir bin Sa’d, bahawa Husain bin Abi Waqqas berkata: Aku mendengar Uthman bin Affan r.a. berkata: Apa yang menghalang aku daripada meriwayatkan daripada Rasulullah SAW ialah kerana aku bukanlah sahabat baginda yang paling memahami sabda baginda.  Namun, aku bersaksi bahawa aku mendengar baginda bersabda: “Barangsiapa yang berkata tentangku sesuatu yang tidak pernah aku katakan, maka hendaklah dia menyediakan tempat duduknya di dalam neraka.” Dan Husain berkata: Husain adalah sahabat baginda yang paling memahami sabda baginda."
  },
  {
    "id": 36603,
    "hadith_number": 440,
    "tajuk_hadith": "Keutamaan Berjaga di Perbatasan",
    "perawi_melayu": "Daripada Abu Salih, hamba sahaya Uthman bin Affan رضي الله عنه, berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَاشِمٌ، حَدَّثَنَا لَيْثٌ، حَدَّثَنِي زُهْرَةُ بْنُ مَعْبَدٍ الْقُرَشِيُّ، عَنْ أَبِي صَالِحٍ، مَوْلَى عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ قَالَ سَمِعْتُ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ يَقُولُ عَلَى الْمِنْبَرِ أَيُّهَا النَّاسُ إِنِّي كَتَمْتُكُمْ حَدِيثًا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَرَاهِيَةَ تَفَرُّقِكُمْ عَنِّي ثُمَّ بَدَا لِي أَنْ أُحَدِّثَكُمُوهُ لِيَخْتَارَ امْرُؤٌ لِنَفْسِهِ مَا بَدَا لَهُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ رِبَاطُ يَوْمٍ فِي سَبِيلِ اللَّهِ تَعَالَى خَيْرٌ مِنْ أَلْفِ يَوْمٍ فِيمَا سِوَاهُ مِنْ الْمَنَازِلِ‏.‏",
    "malay_translation": "Aku mendengar Uthman رضي الله عنه berkata di atas mimbar: Wahai sekalian manusia, sesungguhnya aku telah menyembunyikan daripada kamu sebuah hadis yang aku dengar daripada Rasulullah ﷺ kerana bimbang kamu akan berpecah daripada aku. Kemudian aku merasakan perlu untuk menceritakannya kepada kamu, supaya setiap orang boleh memilih apa yang dirasa baik olehnya.  Aku mendengar Rasulullah ﷺ bersabda: “Berjaga di sempadan selama sehari di jalan Allah SWT lebih baik daripada seribu hari melakukan amalan-amalan lain.”"
  },
  {
    "id": 36604,
    "hadith_number": 441,
    "tajuk_hadith": "Doa Ketika Keluar Rumah",
    "perawi_melayu": "Daripada Uthman bin Affan (رضي الله عنه) berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَاشِمٌ، حَدَّثَنَا أَبُو جَعْفَرٍ الرَّازِيُّ، عَنْ عَبْدِ الْعَزِيزِ بْنِ عُمَرَ، رَضِيَ اللَّهُ عَنْهُ عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنْ رَجُلٍ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ مُسْلِمٍ يَخْرُجُ مِنْ بَيْتِهِ يُرِيدُ سَفَرًا أَوْ غَيْرَهُ فَقَالَ حِينَ يَخْرُجُ بِسْمِ اللَّهِ آمَنْتُ بِاللَّهِ اعْتَصَمْتُ بِاللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ إِلَّا رُزِقَ خَيْرَ ذَلِكَ الْمَخْرَجِ وَصُرِفَ عَنْهُ شَرُّ ذَلِكَ الْمَخْرَجِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Hashim, telah menceritakan kepada kami Abu Ja’far Ar-Razi, dari Abdul Aziz bin Umar, daripada Saleh bin Kaisan, dari seorang lelaki, dari Uthman bin Affan (رضي الله عنه) berkata bahawa Rasulullah ﷺ bersabda: “Tiada seorang Muslim pun yang keluar dari rumahnya untuk melakukan perjalanan atau selainnya, kemudian membaca ketika keluar: “Dengan nama Allah, aku beriman kepada Allah, aku berpegang teguh kepada Allah, aku bertawakkal kepada Allah, tiada daya upaya kecuali dengan izin Allah”, melainkan dia akan diberi kebaikan perjalanan tersebut, dan kejahatan perjalanan itu akan dijauhkan darinya.”"
  },
  {
    "id": 36605,
    "hadith_number": 442,
    "tajuk_hadith": "Cara Wuduk Rasulullah SAW",
    "perawi_melayu": "Daripada Usman r.a. diriwayatkan bahawa:",
    "english_text": "I saw the Messenger of Allah (ﷺ) as doing wudoo’. He washed his face three times and his hands three times, and he wiped his head and washed his feet.",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنِ الْحَجَّاجِ، عَنْ عَطَاءٍ، عَنْ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ فَغَسَلَ وَجْهَهُ ثَلَاثًا وَيَدَيْهِ ثَلَاثًا وَمَسَحَ بِرَأْسِهِ وَغَسَلَ رِجْلَيْهِ غَسْلًا‏.‏",
    "malay_translation": "Aku melihat Rasulullah SAW melakukan wuduk. Baginda membasuh muka tiga kali, tangan tiga kali, mengusap kepala dan membasuh kaki."
  },
  {
    "id": 36606,
    "hadith_number": 443,
    "tajuk_hadith": "Wudhu Sempurna dan Solat Lima Waktu",
    "perawi_melayu": "Abu Sakhrah Jami’ bin Shaddad telah memberitahu bahawa beliau mendengar:",
    "english_text": "I heard Humran bin Aban tell Abu Burdah in the mosque of Basrah, when I was standing next to him, that he heard `Uthman bin `Affan (رضي الله عنه) narrating from the Prophet (ﷺ)  that he said: `Whoever does wudoo’ properly as enjoined by Allah, may He be glorified and exalted, the five prayers will be an expiation for whatever comes in between them.`",
    "arabic_text": "حَدَّثَنَا هَاشِمٌ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي أَبُو صَخْرَةَ، جَامِعُ بْنُ شَدَّادٍ قَالَ سَمِعْتُ حُمْرَانَ بْنَ أَبَانَ، يُحَدِّثُ أَبَا بُرْدَةَ فِي مَسْجِدِ الْبَصْرَةِ وَأَنَا قَائِمٌ، مَعَهُ أَنَّهُ سَمِعَ عُثْمَانَ بْنَ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ يُحَدِّثُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ أَتَمَّ الْوُضُوءَ كَمَا أَمَرَهُ اللَّهُ عَزَّ وَجَلَّ فَالصَّلَوَاتُ الْخَمْسُ كَفَّارَةٌ لِمَا بَيْنَهُنَّ‏.‏",
    "malay_translation": "Aku mendengar Humran bin Aban memberitahu Abu Burdah di Masjid Basrah, ketika aku berdiri di sebelahnya, bahawa beliau mendengar Uthman bin Affan (رضي الله عنه) meriwayatkan daripada Nabi ﷺ bahawa baginda bersabda:  \"Barangsiapa yang sempurna wudhunya sebagaimana yang diperintahkan oleh Allah SWT, maka solat lima waktu itu akan menjadi kafarah (penebus dosa) bagi apa yang di antara waktu-waktu tersebut.\""
  },
  {
    "id": 36607,
    "hadith_number": 444,
    "tajuk_hadith": "Perlindungan dengan Membaca Doa",
    "perawi_melayu": "Daripada riwayat Aban bin Utsman:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُرَيْجٌ، حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ، عَنْ أَبِيهِ، عَنْ أَبَانَ بْنِ عُثْمَانَ، قَالَ سَمِعْتُ عُثْمَانَ بْنَ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ وَهُوَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَالَ فِي أَوَّلِ يَوْمِهِ أَوْ فِي أَوَّلِ لَيْلَتِهِ بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ ثَلَاثَ مَرَّاتٍ لَمْ يَضُرَّهُ شَيْءٌ فِي ذَلِكَ الْيَوْمِ أَوْ فِي تِلْكَ اللَّيْلَةِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Suriaj, telah menceritakan kepada kami Ibnu Abi Zinad, daripada bapanya, daripada Aban bin Utsman, dia berkata: Aku mendengar Utsman bin Affan r.a. berkata: Rasulullah SAW bersabda: \"Barangsiapa yang membaca pada awal harinya atau awal malamnya, 'Dengan nama Allah yang dengan menyebut nama-Nya, tiada sesuatu pun yang membahayakan di bumi mahupun di langit, dan Dia lah Yang Maha Mendengar lagi Maha Mengetahui,' sebanyak tiga kali, maka tiadalah sesuatu pun yang akan membahayakannya pada hari atau malam itu.\""
  },
  {
    "id": 36608,
    "hadith_number": 445,
    "tajuk_hadith": "Menolak Pelantikan Hakim dan Imam",
    "perawi_melayu": "Dari Yazid bin Mawhab bahawa Usman (رضي الله عنه) berkata kepada Ibnu Umar (رضي الله عنه):",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، أَنْبَأَنَا أَبُو سِنَانٍ، عَنْ يَزِيدَ بْنِ مَوْهَبٍ، أَنَّ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ لِابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُ اقْضِ بَيْنَ النَّاسِ فَقَالَ لَا أَقْضِي بَيْنَ اثْنَيْنِ وَلَا أَؤُمُّ رَجُلَيْنِ أَمَا سَمِعْتَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ عَاذَ بِاللَّهِ فَقَدْ عَاذَ بِمَعَاذٍ قَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ بَلَى قَالَ فَإِنِّي أَعُوذُ بِاللَّهِ أَنْ تَسْتَعْمِلَنِي فَأَعْفَاهُ وَقَالَ لَا تُخْبِرْ بِهَذَا أَحَدًا‏.‏",
    "malay_translation": "Telah menceritakan kepada kami 'Affan, telah menceritakan kepada kami Hammad bin Salamah, telah memberitakan kepada kami Abu Sinan, dari Yazid bin Mawhab, bahawa Usman (رضي الله عنه) berkata kepada Ibnu Umar (رضي الله عنه): “Hakimi orang ramai.” Maka beliau berkata: “Aku tidak akan menghakimi di antara dua orang dan aku tidak akan menjadi imam kepada dua orang lelaki. Bukankah engkau telah mendengar Nabi ﷺ bersabda: ‘Barangsiapa yang berlindung kepada Allah, maka sesungguhnya dia telah berlindung kepada yang Maha Kuasa.’?” Usman (رضي الله عنه) berkata: “Ya.” Beliau berkata: “Maka aku berlindung kepada Allah daripada engkau melantikku.” Maka Usman (رضي الله عنه) melepaskan permintaannya dan berkata: “Jangan beritahu sesiapa pun tentang perkara ini.”"
  },
  {
    "id": 36609,
    "hadith_number": 446,
    "tajuk_hadith": "Kebersihan Wudhuk dan Penghapusan Dosa",
    "perawi_melayu": "Daripada Usman bin Affan r.a.",
    "english_text": "The Messenger of Allah (ﷺ) said: “Whoever does wudoo` and does wudoo’ well, his sins come out of his body, even from beneath his nails.”",
    "arabic_text": "حَدَّثَنَا عَفَّانُ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، عَنْ عُثْمَانَ بْنِ حَكِيمٍ، حَدَّثَنَا مُحَمَّدُ بْنُ الْمُنْكَدِرِ، عَنْ حُمْرَانَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ خَرَجَتْ خَطَايَاهُ مِنْ جَسَدِهِ حَتَّى تَخْرُجَ مِنْ تَحْتِ أَظْفَارِهِ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: “Barangsiapa yang berwuduk dan berwuduk dengan sempurna, nescaya akan keluar dosa-dosanya dari jasadnya, bahkan dari bawah kuku-kukunya.”"
  },
  {
    "id": 36610,
    "hadith_number": 447,
    "tajuk_hadith": "Keutamaan Berjaga di Perbatasan",
    "perawi_melayu": "Daripada Abu Salih, hamba yang dimerdekakan Uthman (رضي الله عنه), bahawa Uthman (رضي الله عنه) berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَاه سُوَيْدُ بْنُ سَعِيدٍ، سَنَةَ سِتٍّ وَعِشْرِينَ حَدَّثَنَا رِشْدِينُ بْنُ سَعْدٍ، عَنْ زُهْرَةَ بْنِ مَعْبَدٍ، عَنْ أَبِي صَالِحٍ، مَوْلَى عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ أَنَّ عُثْمَانَ قَالَ أَيُّهَا النَّاسُ هَجِّرُوا فَإِنِّي مُهَجِّرٌ فَهَجَّرَ النَّاسُ ثُمَّ قَالَ أَيُّهَا النَّاسُ إِنِّي مُحَدِّثُكُمْ بِحَدِيثٍ مَا تَكَلَّمْتُ بِهِ مُنْذُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى يَوْمِي هَذَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ رِبَاطَ يَوْمٍ فِي سَبِيلِ اللَّهِ أَفْضَلُ مِنْ أَلْفِ يَوْمٍ مِمَّا سِوَاهُ فَلْيُرَابِطْ امْرُؤٌ حَيْثُ شَاءَ هَلْ بَلَّغْتُكُمْ قَالُوا نَعَمْ قَالَ اللَّهُمَّ اشْهَدْ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah, telah menceritakan kepada kami Suwaid bin Said, pada tahun dua puluh enam, telah menceritakan kepada kami Rasyidin bin Saad, daripada Zuhrah bin Ma'bad, daripada Abu Salih, hamba Uthman (رضي الله عنه), bahawa Uthman berkata, \"Wahai sekalian manusia, berhijrahlah kerana aku juga sedang berhijrah.\" Maka, manusia pun berhijrah. Kemudian beliau berkata, \"Wahai sekalian manusia, sesungguhnya aku ingin menceritakan kepada kamu sebuah hadis yang tidak pernah aku sebutkan sejak aku mendengarnya daripada Rasulullah ﷺ sehingga hari ini. Rasulullah ﷺ bersabda,  'Sesungguhnya berjaga di perbatasan (Ribat) selama sehari di jalan Allah lebih baik daripada seribu hari yang lain, maka hendaklah seseorang itu berjaga di perbatasan di mana sahaja dia suka.' Adakah aku telah menyampaikan (hadis) ini kepada kamu?\" Mereka menjawab, \"Ya.\" Beliau berkata, \"Ya Allah, jadikanlah saksi.\" "
  },
  {
    "id": 36611,
    "hadith_number": 448,
    "tajuk_hadith": "Pengampunan Dosa dengan Wudhu dan Solat Dua Rakaat",
    "perawi_melayu": "Telah diriwayatkan bahawa Humran berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْمُغِيرَةِ، حَدَّثَنَا الْأَوْزَاعِيُّ، حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ، حَدَّثَنِي شَقِيقُ بْنُ سَلَمَةَ، عَنْ حُمْرَانَ، قَالَ كَانَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ قَاعِدًا فِي الْمَقَاعِدِ فَدَعَا بِوَضُوءٍ فَتَوَضَّأَ ثُمَّ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ فِي مَقْعَدِي هَذَا ثُمَّ قَالَ مَنْ تَوَضَّأَ مِثْلَ وُضُوئِي هَذَا ثُمَّ قَامَ فَرَكَعَ رَكْعَتَيْنِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَغْتَرُّوا‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu al-Mughirah, telah menceritakan kepada kami al-Auza'i, telah menceritakan kepada kami Yahya bin Abi Katsir, daripada Muhammad bin Ibrahim al-Taymi, telah menceritakan kepadaku Syaqiq bin Salamah, daripada Humran, katanya: Usman r.a. sedang duduk di tempat duduk. Maka dia meminta air wudhu lalu berwudhu, kemudian dia berkata: Aku melihat Rasulullah ﷺ berwudhu di tempat dudukku ini. Kemudian baginda berkata: \"Barangsiapa berwudhu seperti wudhuku ini, kemudian berdiri lalu menunaikan solat dua rakaat, maka dosa-dosanya yang lalu akan diampunkan.\"  Dan Rasulullah ﷺ bersabda: \"Janganlah kamu bersikap angkuh/takbur.\""
  },
  {
    "id": 36612,
    "hadith_number": 449,
    "tajuk_hadith": "Kematian Uthman bin Affan",
    "perawi_melayu": "Abu ‘Awn al-Ansari meriwayatkan bahawa Uthman bin ‘Affan (رضي الله عنه) berkata kepada Ibn Mas’ud:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْمُغِيرَةِ، حَدَّثَنَا أَرْطَاةُ يَعْنِي ابْنَ الْمُنْذِرِ، أَخْبَرَنِي أَبُو عَوْنٍ الْأَنْصَارِيُّ، أَنَّ عُثْمَانَ بْنَ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ لِابْنِ مَسْعُودٍ هَلْ أَنْتَ مُنْتَهٍ عَمَّا بَلَغَنِي عَنْكَ فَاعْتَذَرَ بَعْضَ الْعُذْرِ فَقَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ وَيْحَكَ إِنِّي قَدْ سَمِعْتُ وَحَفِظْتُ وَلَيْسَ كَمَا سَمِعْتَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَيُقْتَلُ أَمِيرٌ وَيَنْتَزِي مُنْتَزٍ وَإِنِّي أَنَا الْمَقْتُولُ وَلَيْسَ عُمَرَ رَضِيَ اللَّهُ عَنْهُ إِنَّمَا قَتَلَ عُمَرَ وَاحِدٌ وَإِنَّهُ يُجْتَمَعُ عَلَيَّ‏.‏",
    "malay_translation": "Abu Mughīrah meriwayatkan daripada Arṭā (iaitu Ibn al-Mundhir), yang memberitahu aku daripada Abu ‘Awn al-Anṣārī bahawa Uthman bin ‘Affan (رضي الله عنه) berkata kepada Ibn Mas’ūd: “Adakah engkau akan berhenti daripada apa yang sampai kepadaku tentangmu?” Maka Ibn Mas’ūd meminta maaf dengan beberapa alasan. Kemudian Uthman (رضي الله عنه) berkata: “Celaka kamu! Sesungguhnya aku telah mendengar dan mengingati, dan ia bukanlah seperti yang engkau dengar.  Rasulullah ﷺ bersabda:  ‘Seorang pemimpin akan dibunuh dan seorang penjenayah akan melakukan jenayah.’  Dan akulah yang akan dibunuh, dan bukan Umar (رضي الله عنه). Umar (رضي الله عنه) dibunuh oleh seorang sahaja, tetapi aku akan dibunuh oleh sekumpulan orang.”"
  },
  {
    "id": 36613,
    "hadith_number": 450,
    "tajuk_hadith": "Iman dan Kesetiaan Usman bin Affan kepada Rasulullah SAW",
    "perawi_melayu": "Usman bin Affan (رضي الله عنه) berkata kepada anak saudaranya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا بِشْرُ بْنُ شُعَيْبٍ، حَدَّثَنِي أَبِي، عَنِ الزُّهْرِيِّ، حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَدِيِّ بْنِ الْخِيَارِ، أَخْبَرَهُ أَنَّ عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ قَالَ لَهُ ابْنَ أَخِي أَدْرَكْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَقُلْتُ لَهُ لَا وَلَكِنْ خَلَصَ إِلَيَّ مِنْ عِلْمِهِ وَالْيَقِينِ مَا يَخْلُصُ إِلَى الْعَذْرَاءِ فِي سِتْرِهَا قَالَ فَتَشَهَّدَ ثُمَّ قَالَ أَمَّا بَعْدُ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ بَعَثَ مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْحَقِّ فَكُنْتُ مِمَّنْ اسْتَجَابَ لِلَّهِ وَلِرَسُولِهِ وَآمَنَ بِمَا بُعِثَ بِهِ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ هَاجَرْتُ الْهِجْرَتَيْنِ كَمَا قُلْتُ وَنِلْتُ صِهْرَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبَايَعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَاللَّهِ مَا عَصَيْتُهُ وَلَا غَشَشْتُهُ حَتَّى تَوَفَّاهُ اللَّهُ عَزَّ وَجَلَّ‏.‏",
    "malay_translation": "Usman bin Affan (رضي الله عنه) berkata kepada anak saudaranya, \"Adakah engkau bertemu Rasulullah SAW?\"  Jawabnya, \"Tidak, tetapi aku telah menerima ilmu dan keyakinan daripada baginda seperti yang diterima oleh seorang gadis dara dalam kesendiriannya.\" Kemudian dia bersolat sunat tahiyat, lalu berkata, \"Sesungguhnya Allah SWT telah mengutus Muhammad SAW dengan kebenaran.  Aku adalah antara mereka yang menerima seruan Allah dan Rasul-Nya, dan aku beriman kepada apa yang dibawa oleh Muhammad SAW. Kemudian aku berhijrah sebanyak dua kali, dan aku telah mendapat penghormatan menjadi menantu Rasulullah SAW.  Aku telah memberikan bai'ah kepada Rasulullah SAW dan demi Allah, aku tidak pernah menderhakainya atau mengkhianatinya sehingga Allah SWT menjemput roh baginda.\" "
  },
  {
    "id": 36614,
    "hadith_number": 451,
    "tajuk_hadith": "Pilihan Usman bin Affan ketika Dikepung",
    "perawi_melayu": "Daripada al-Mugheerah bin Shu`bah bahawa beliau telah masuk mengadap Usman (رضي الله عنه) ketika beliau dalam keadaan terkepung dan berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، قَالَ وَأَخْبَرَنِي الْأَوْزَاعِيُّ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الْمَلِكِ بْنِ مَرْوَانَ، أَنَّهُ حَدَّثَهُ عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، أَنَّهُ دَخَلَ عَلَى عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ وَهُوَ مَحْصُورٌ فَقَالَ إِنَّكَ إِمَامُ الْعَامَّةِ وَقَدْ نَزَلَ بِكَ مَا تَرَى وَإِنِّي أَعْرِضُ عَلَيْكَ خِصَالًا ثَلَاثًا اخْتَرْ إِحْدَاهُنَّ إِمَّا أَنْ تَخْرُجَ فَتُقَاتِلَهُمْ فَإِنَّ مَعَكَ عَدَدًا وَقُوَّةً وَأَنْتَ عَلَى الْحَقِّ وَهُمْ عَلَى الْبَاطِلِ وَإِمَّا أَنْ نَخْرِقَ لَكَ بَابًا سِوَى الْبَابِ الَّذِي هُمْ عَلَيْهِ فَتَقْعُدَ عَلَى رَوَاحِلِكَ فَتَلْحَقَ بِمَكَّةَ فَإِنَّهُمْ لَنْ يَسْتَحِلُّوكَ وَأَنْتَ بِهَا وَإِمَّا أَنْ تَلْحَقَ بِالشَّامِ فَإِنَّهُمْ أَهْلُ الشَّامِ وَفِيهِمْ مُعَاوِيَةُ فَقَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ أَمَّا أَنْ أَخْرُجَ فَأُقَاتِلَ فَلَنْ أَكُونَ أَوَّلَ مَنْ خَلَفَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أُمَّتِهِ بِسَفْكِ الدِّمَاءِ وَأَمَّا أَنْ أَخْرُجَ إِلَى مَكَّةَ فَإِنَّهُمْ لَنْ يَسْتَحِلُّونِي بِهَا فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يُلْحِدُ رَجُلٌ مِنْ قُرَيْشٍ بِمَكَّةَ يَكُونُ عَلَيْهِ نِصْفُ عَذَابِ الْعَالَمِ فَلَنْ أَكُونَ أَنَا إِيَّاهُ وَأَمَّا أَنْ أَلْحَقَ بِالشَّامِ فَإِنَّهُمْ أَهْلُ الشَّامِ وَفِيهِمْ مُعَاوِيَةُ فَلَنْ أُفَارِقَ دَارَ هِجْرَتِي وَمُجَاوَرَةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنَاه عَلِيُّ بْنُ إِسْحَاقَ عَنِ ابْنِ الْمُبَارَكِ فَذَكَرَ الْحَدِيثَ وَقَالَ يُلْحِدُ‏.‏",
    "malay_translation": "Ali bin Ayasy telah meriwayatkan daripada al-Walid bin Muslim, yang berkata, “Al-Auza’ie telah memberitakan kepadaku daripada Muhammad bin Abd al-Malik bin Marwan bahawa dia telah memberitakan kepadaku daripada al-Mughirah bin Syu’bah, bahawa dia telah masuk mengadap Usman (رضي الله عنه) ketika beliau dalam keadaan terkepung dan berkata, “Sesungguhnya engkau adalah Imam bagi masyarakat awam dan telah menimpa engkau apa yang engkau lihat. Dan aku mengemukakan kepadamu tiga pilihan, pilihlah salah satu darinya. Sama ada engkau keluar lalu memerangi mereka, kerana sesungguhnya bersamamu terdapat jumlah yang ramai dan kekuatan, dan engkau berada di atas kebenaran dan mereka berada di atas kebatilan, atau kami akan membuka untukmu satu pintu selain daripada pintu yang mereka cegah, lalu engkau naik kenderaanmu dan pergi ke Makkah kerana mereka tidak akan menganiaya engkau di sana, atau engkau pergi ke Syam, kerana mereka adalah penduduk Syam dan di antara mereka ialah Muawiyah.” Usman (رضي الله عنه) berkata, “Adapun keluar berperang, nescaya aku tidak akan menjadi orang pertama yang menggantikan Rasulullah ﷺ dalam umatnya yang menumpahkan darah. Adapun keluar ke Makkah, kerana mereka tidak akan menganiaya aku di sana, kerana aku telah mendengar Rasulullah ﷺ bersabda, ‘Seseorang daripada Quraisy akan melakukan kemungkaran di Makkah, maka dia akan menanggung separuh azab dunia,’ maka aku tidak akan menjadi orang itu. Adapun pergi ke Syam, kerana mereka adalah penduduk Syam dan Muawiyah di antara mereka, maka aku tidak akan meninggalkan tempat hijrahku dan tempatku berjiran dengan Rasulullah ﷺ.” Ali bin Ishaq meriwayatkan daripada Ibn al-Mubarak, lalu dia menyebut hadith tersebut dan berkata, ‘akan melakukan kemungkaran.’"
  },
  {
    "id": 36615,
    "hadith_number": 452,
    "tajuk_hadith": "Pengampunan Dosa Setelah Wudhu' dan Solat Fardu",
    "perawi_melayu": "Daripada Mu'adz bin Abdur-Rahman at-Taimi, daripada Humran, hamba sahaya Usman (رضي الله عنه), daripada Usman (رضي الله عنه), bahawa beliau berkata:",
    "english_text": "I heard the Messenger of Allah (ﷺ) say: “Whoever does wudoo` and does it properly, then goes and offers an obligatory prayer, his sins will be forgiven.`",
    "arabic_text": "حَدَّثَنَا حَجَّاجٌ، وَيُونُسُ، قَالَا حَدَّثَنَا لَيْثٌ، قَالَ حَجَّاجٌ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ، وَنَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ مُعَاذِ بْنِ عَبْدِ الرَّحْمَنِ التَّيْمِيِّ، عَنْ حُمْرَانَ، مَوْلَى عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ عَنْ عُثْمَانَ، أَنَّهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ تَوَضَّأَ فَأَسْبَغَ الْوُضُوءَ ثُمَّ مَشَى إِلَى صَلَاةٍ مَكْتُوبَةٍ فَصَلَّاهَا غُفِرَ لَهُ ذَنْبُهُ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah ﷺ bersabda:  \"Barangsiapa yang berwuduk dengan sempurna, kemudian pergi menunaikan solat fardu dan menunaikannya, maka nescaya akan diampunkan dosanya.\""
  },
  {
    "id": 36616,
    "hadith_number": 453,
    "tajuk_hadith": "Keutamaan Wuduk yang Sempurna",
    "perawi_melayu": "Daripada Humran diriwayatkan bahawa Uthman (رضي الله عنه) melakukan ghusl setiap hari sejak memeluk Islam.  Aku menyediakan air untuknya suatu hari untuk berwuduk bagi solat.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَفَّانُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَاصِمٍ، عَنِ الْمُسَيَّبِ، عَنْ مُوسَى بْنِ طَلْحَةَ، عَنْ حُمْرَانَ، قَالَ كَانَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ يَغْتَسِلُ كُلَّ يَوْمٍ مَرَّةً مِنْ مُنْذُ أَسْلَمَ فَوَضَعْتُ وَضُوءًا لَهُ ذَاتَ يَوْمٍ لِلصَّلَاةِ فَلَمَّا تَوَضَّأَ قَالَ إِنِّي أَرَدْتُ أَنْ أُحَدِّثَكُمْ بِحَدِيثٍ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ بَدَا لِي أَنْ لَا أُحَدِّثَكُمُوهُ فَقَالَ الْحَكَمُ بْنُ أَبِي الْعَاصِ يَا أَمِيرَ الْمُؤْمِنِينَ إِنْ كَانَ خَيْرًا فَنَأْخُذُ بِهِ أَوْ شَرًّا فَنَتَّقِيهِ قَالَ فَقَالَ فَإِنِّي مُحَدِّثُكُمْ بِهِ تَوَضَّأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذَا الْوُضُوءَ ثُمَّ قَالَ مَنْ تَوَضَّأَ هَذَا الْوُضُوءَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ قَامَ إِلَى الصَّلَاةِ فَأَتَمَّ رُكُوعَهَا وَسُجُودَهَا كَفَّرَتْ عَنْهُ مَا بَيْنَهَا وَبَيْنَ الصَّلَاةِ الْأُخْرَى مَا لَمْ يُصِبْ مَقْتَلَةً يَعْنِي كَبِيرَةً‏.‏",
    "malay_translation": "Kemudian setelah berwuduk, beliau berkata:  Sesungguhnya aku ingin menceritakan kepada kamu sebuah hadis yang aku dengar daripada Rasulullah ﷺ, kemudian aku fikirkan untuk tidak menceritakannya kepada kamu.  Lalu al-Hakam bin Abi al-`As berkata: Wahai Amirul Mukminin, jika ia adalah kebaikan, maka kita akan mengikutinya, dan jika ia adalah kejahatan, maka kita akan menjauhinya.  Beliau berkata: Maka aku akan ceritakan kepada kamu.  Rasulullah ﷺ berwuduk dengan cara ini, kemudian Baginda bersabda: Barangsiapa berwuduk dengan cara ini dan berwuduk dengan sempurna, kemudian mengerjakan solat, dan sempurnakan rukuk dan sujudnya, maka ia akan menghapuskan dosa-dosanya di antara solat itu dengan solat yang berikutnya, selama dia tidak melakukan dosa besar."
  },
  {
    "id": 36617,
    "hadith_number": 454,
    "tajuk_hadith": "Kehidupan Mudah dalam Perniagaan dan Hutang",
    "perawi_melayu": "Daripada Usman bin Affan (رضي الله عنه) berkata:",
    "english_text": "I heard the Messenger of Allah (ﷺ) say:  “Allah admitted to Paradise a man who was easy-going in buying and selling, when paying off debt and when asking for a debt that was owed to him.”",
    "arabic_text": "حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ يُونُسَ، عَنْ عَطَاءِ بْنِ فَرُّوخَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَدْخَلَ اللَّهُ الْجَنَّةَ رَجُلًا كَانَ سَهْلًا قَاضِيًا وَمُقْتَضِيًا وَبَائِعًا وَمُشْتَرِيًا‏.‏",
    "malay_translation": "Aku mendengar Rasulullah ﷺ bersabda:  “Allah SWT memasukkan ke dalam syurga seorang lelaki yang bersikap mudah dalam urusan jual beli, membayar hutang dan menuntut hutang.”"
  },
  {
    "id": 36618,
    "hadith_number": 455,
    "tajuk_hadith": "Pengampunan Dosa Dengan Bersuci dan Solat",
    "perawi_melayu": "Daripada ‘lkrimah bin Khalid:",
    "english_text": "",
    "arabic_text": "قَالَ حَدَّثَنَا عَفَّانُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ إِبْرَاهِيمَ بْنِ الْمُهَاجِرِ، عَنْ عِكْرِمَةَ بْنِ خَالِدٍ، حَدَّثَنِي رَجُلٌ، مِنْ أَهْلِ الْمَدِينَةِ أَنَّ الْمُؤَذِّنَ، أَذَّنَ لِصَلَاةِ الْعَصْرِ قَالَ فَدَعَا عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ بِطَهُورٍ فَتَطَهَّرَ قَالَ ثُمَّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ تَطَهَّرَ كَمَا أُمِرَ وَصَلَّى كَمَا أُمِرَ كُفِّرَتْ عَنْهُ ذُنُوبُهُ فَاسْتَشْهَدَ عَلَى ذَلِكَ أَرْبَعَةً مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَشَهِدُوا لَهُ بِذَلِكَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏",
    "malay_translation": "Diriwayatkan daripada ‘lkrimah bin Khalid bahawa seorang lelaki dari Madinah memberitahu bahawa muazin telah melaungkan azan untuk solat Asar.  Kemudian Usman رضي الله عنه meminta air untuk bersuci, lalu beliau bersuci.  Kemudian beliau berkata, \"Saya mendengar Rasulullah ﷺ bersabda:  'Barangsiapa bersuci sebagaimana yang diperintahkan dan menunaikan solat sebagaimana yang diperintahkan, nescaya dosa-dosanya akan diampunkan.'  Kemudian beliau meminta empat orang sahabat Rasulullah ﷺ untuk menjadi saksi akan hal itu, dan mereka telah menyaksikan bahawa Nabi ﷺ telah bersabda demikian."
  },
  {
    "id": 36619,
    "hadith_number": 456,
    "tajuk_hadith": "Wuduk Usman R.A. Mengikut Cara Rasulullah S.A.W.",
    "perawi_melayu": "Daripada riwayat Busr bin Sa`eed:",
    "english_text": "`Uthman (رضي الله عنه) came to al-Maqa`id and called for water for wudoo`. He rinsed his mouth and nose, then he washed his face three times, then he washed his hands three times each, then he wiped his head and (washed) his feet three times each. Then he said: I saw the Messenger of Allah (ﷺ) doing wudoo` like this, O people, isn`t that true? They said: Yes - i.e., a group of the Companions of the Messenger of Allah (ﷺ)  who were with him.",
    "arabic_text": "حَدَّثَنَا ابْنُ الْأَشْجَعِيِّ، حَدَّثَنَا أَبِي، عَنْ سُفْيَانَ، عَنْ سَالِمٍ أَبِي النَّضْرِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، قَالَ أَتَى عُثْمَانُ الْمَقَاعِدَ فَدَعَا بِوَضُوءٍ فَتَمَضْمَضَ وَاسْتَنْشَقَ ثُمَّ غَسَلَ وَجْهَهُ ثَلَاثًا وَيَدَيْهِ ثَلَاثًا ثَلَاثًا ثُمَّ مَسَحَ بِرَأْسِهِ وَرِجْلَيْهِ ثَلَاثًا ثَلَاثًا ثُمَّ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَكَذَا يَتَوَضَّأُ يَا هَؤُلَاءِ أَكَذَاكَ قَالُوا نَعَمْ لِنَفَرٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَهُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ibnul Asy'ajiy, telah menceritakan kepada kami ayahku, dari Sufyan, dari Salim Abi Nadhr, dari Busr bin Sa'id, dia berkata: Usman datang ke al-Maqa'id lalu meminta air wuduk. Kemudian beliau berkumur dan memasukkan air ke hidung, lalu membasuh mukanya tiga kali, dan tangannya tiga kali, setiap tangan tiga kali. Kemudian beliau menyapu kepalanya dan kakinya tiga kali, setiap kaki tiga kali. Kemudian beliau berkata: Aku melihat Rasulullah SAW berwuduk seperti ini, wahai orang-orang, bukankah begitu? Mereka berkata: Ya, iaitu beberapa sahabat Rasulullah SAW yang berada bersamanya."
  },
  {
    "id": 36620,
    "hadith_number": 457,
    "tajuk_hadith": "Wuduk Usman bin Affan",
    "perawi_melayu": "Daripada Usman bin Affan (رضي الله عنه) bahawa baginda telah meminta air dan berwuduk di al-Maqa`id. Baginda berwuduk, membasuh setiap anggota tiga kali, kemudian baginda bertanya kepada para sahabat Rasulullah (ﷺ): \"Adakah kamu melihat Rasulullah (ﷺ) berwuduk seperti ini?\"",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْوَلِيدِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنِي سَالِمٌ أَبُو النَّضْرِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ أَنَّهُ دَعَا بِمَاءٍ فَتَوَضَّأَ عِنْدَ الْمَقَاعِدِ فَتَوَضَّأَ ثَلَاثًا ثَلَاثًا ثُمَّ قَالَ لِأَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ رَأَيْتُمْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَلَ هَذَا قَالُوا نَعَمْ قَالَ أَبِي هَذَا الْعَدَنِيُّ كَانَ بِمَكَّةَ مُسْتَمْلِيَ ابْنِ عُيَيْنَةَ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Walid, telah menceritakan kepada kami Sufyan, telah menceritakan kepadaku Salim Abu Nadhr, daripada Busr bin Sa’id, daripada Usman bin Affan (رضي الله عنه), bahawa baginda telah meminta air lalu berwuduk di al-Maqa’id. Baginda berwuduk, membasuh setiap anggota tiga kali, kemudian baginda bertanya kepada para sahabat Rasulullah (ﷺ): \"Adakah kamu melihat Rasulullah (ﷺ) berwuduk seperti ini?\" Mereka menjawab: \"Ya.\" Abi al-‘Adani berkata: Beliau adalah di Mekah, seorang yang meriwayatkan hadis daripada Ibnu Uyainah."
  },
  {
    "id": 36621,
    "hadith_number": 458,
    "tajuk_hadith": "Wuduk dan Solat Dua Rakaat untuk Pengampunan Dosa",
    "perawi_melayu": "Daripada Humran bin Aban, hamba saudara Usman bin Affan رضي الله عنه, berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْقُوبُ، حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، حَدَّثَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيُّ، عَنْ مُعَاذِ بْنِ عَبْدِ الرَّحْمَنِ التَّيْمِيِّ، عَنْ حُمْرَانَ بْنِ أَبَانَ، مَوْلَى عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ قَالَ رَأَيْتُ عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ دَعَا بِوَضُوءٍ وَهُوَ عَلَى بَابِ الْمَسْجِدِ فَغَسَلَ يَدَيْهِ ثُمَّ مَضْمَضَ وَاسْتَنْشَقَ وَاسْتَنْثَرَ ثُمَّ غَسَلَ وَجْهَهُ ثَلَاثَ مَرَّاتٍ ثُمَّ غَسَلَ يَدَيْهِ إِلَى الْمِرْفَقَيْنِ ثَلَاثَ مَرَّاتٍ ثُمَّ مَسَحَ بِرَأْسِهِ وَأَمَرَّ بِيَدَيْهِ عَلَى ظَاهِرِ أُذُنَيْهِ ثُمَّ مَرَّ بِهِمَا عَلَى لِحْيَتِهِ ثُمَّ غَسَلَ رِجْلَيْهِ إِلَى الْكَعْبَيْنِ ثَلَاثَ مَرَّاتٍ ثُمَّ قَامَ فَرَكَعَ رَكْعَتَيْنِ ثُمَّ قَالَ تَوَضَّأْتُ لَكُمْ كَمَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ ثُمَّ رَكَعْتُ رَكْعَتَيْنِ كَمَا رَأَيْتُهُ رَكَعَ قَالَ ثُمَّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ فَرَغَ مِنْ رَكْعَتَيْهِ مَنْ تَوَضَّأَ كَمَا تَوَضَّأْتُ ثُمَّ رَكَعَ رَكْعَتَيْنِ لَا يُحَدِّثُ فِيهِمَا نَفْسَهُ غُفِرَ لَهُ مَا كَانَ بَيْنَهُمَا وَبَيْنَ صَلَاتِهِ بِالْأَمْسِ‏.‏",
    "malay_translation": "Aku telah melihat Usman bin Affan رضي الله عنه mengambil air wuduk di pintu masjid. Baginda membasuh kedua belah tangannya, kemudian berkumur dan memasukkan air ke dalam hidung lalu mengeluarkannya; kemudian membasuh mukanya tiga kali, kemudian membasuh tangannya sehingga ke siku tiga kali, kemudian menyapu kepalanya. Kemudian mengusap bahagian luar telinganya, kemudian janggutnya, kemudian membasuh kakinya sehingga ke buku lali tiga kali. Kemudian baginda berdiri dan menunaikan solat dua rakaat, kemudian berkata:  Aku telah berwuduk untuk kamu sepertimana aku melihat Rasulullah ﷺ berwuduk, kemudian aku solat dua rakaat sepertimana aku melihat baginda solat.  Rasulullah ﷺ bersabda ketika selesai solat dua rakaat: “Barangsiapa berwuduk sepertimana aku berwuduk, kemudian menunaikan solat dua rakaat tanpa lalai fikirannya, maka akan diampunkan dosanya di antara solat itu dengan solat sebelumnya.”"
  },
  {
    "id": 36622,
    "hadith_number": 459,
    "tajuk_hadith": "Jawapan Abdur-Rahman bin ‘Awf kepada dakwaan menjauhi Uthman",
    "perawi_melayu": "Ia telah diriwayatkan bahawa Shaqeeq berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، حَدَّثَنَا زَائِدَةُ، عَنْ عَاصِمٍ، عَنْ شَقِيقٍ، قَالَ لَقِيَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ الْوَلِيدَ بْنَ عُقْبَةَ فَقَالَ لَهُ الْوَلِيدُ مَا لِي أَرَاكَ قَدْ جَفَوْتَ أَمِيرَ الْمُؤْمِنِينَ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ فَقَالَ لَهُ عَبْدُ الرَّحْمَنِ أَبْلِغْهُ أَنِّي لَمْ أَفِرَّ يَوْمَ عَيْنَيْنِ قَالَ عَاصِمٌ يَقُولُ يَوْمَ أُحُدٍ وَلَمْ أَتَخَلَّفْ يَوْمَ بَدْرٍ وَلَمْ أَتْرُكْ سُنَّةَ عُمَرَ رَضِيَ اللَّهُ عَنْهُ قَالَ فَانْطَلَقَ فَخَبَّرَ ذَلِكَ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ قَالَ فَقَالَ أَمَّا قَوْلُهُ إِنِّي لَمْ أَفِرَّ يَوْمَ عَيْنَيْنَ فَكَيْفَ يُعَيِّرُنِي بِذَنْبٍ وَقَدْ عَفَا اللَّهُ عَنْهُ فَقَالَ ‏{‏إِنَّ الَّذِينَ تَوَلَّوْا مِنْكُمْ يَوْمَ الْتَقَى الْجَمْعَانِ إِنَّمَا اسْتَزَلَّهُمْ الشَّيْطَانُ بِبَعْضِ مَا كَسَبُوا وَلَقَدْ عَفَا اللَّهُ عَنْهُمْ‏}‏ وَأَمَّا قَوْلُهُ إِنِّي تَخَلَّفْتُ يَوْمَ بَدْرٍ فَإِنِّي كُنْتُ أُمَرِّضُ رُقَيَّةَ بِنْتَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ مَاتَتْ وَقَدْ ضَرَبَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَهْمِي وَمَنْ ضَرَبَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَهْمِهِ فَقَدْ شَهِدَ وَأَمَّا قَوْلُهُ إِنِّي لَمْ أَتْرُكْ سُنَّةَ عُمَرَ رَضِيَ اللَّهُ عَنْهُ فَإِنِّي لَا أُطِيقُهَا وَلَا هُوَ فَأْتِهِ فَحَدِّثْهُ بِذَلِكَ‏.‏",
    "malay_translation": "Abdur-Rahman bin ‘Awf bertemu dengan al-Walid bin ‘Uqbah. Al-Walid berkata kepadanya: “Mengapa aku nampak engkau telah menjauhi Amirul Mukminin Uthman رضي الله عنه?” Abdur-Rahman berkata kepadanya: “Sampaikan kepadanya bahawa aku tidak melarikan diri pada hari Ainain – kata ‘Asim: pada hari Uhud – dan aku tidak tinggal di belakang pada hari Badar, dan aku tidak meninggalkan sunnah Umar رضي الله عنه.” Maka dia pun pergi dan memberitahu hal itu kepada Uthman رضي الله عنه.  Uthman berkata: “Adapun katanya dia tidak melarikan diri pada hari Ainain, bagaimanakah dia boleh mencela aku dengan satu dosa yang Allah telah mengampuninya? Allah berfirman:  {Sesungguhnya orang-orang yang berpaling dari kalangan kamu pada hari bertemunya dua pasukan tentera, itu adalah syaitan yang menyebabkan mereka tergelincir kerana sebahagian daripada apa yang telah mereka usahakan.  Tetapi Allah telah mengampunkan mereka.} Adapun katanya aku tinggal di belakang pada hari Badar, maka sesungguhnya aku ketika itu sedang menjaga Ruqayyah, anak perempuan Rasulullah ﷺ ketika dia meninggal dunia, dan Rasulullah ﷺ telah memberi bahagian (ghanim) kepadaku. Sesiapa yang Rasulullah ﷺ telah memberi bahagian kepadanya, maka dia telah hadir. Adapun katanya aku tidak meninggalkan sunnah Umar رضي الله عنه, maka sesungguhnya aku tidak mampu melakukannya dan dia pun tidak mampu. Pergilah dan beritahu dia demikian.”"
  },
  {
    "id": 36623,
    "hadith_number": 460,
    "tajuk_hadith": "Keutamaan Solat Isyak dan Subuh Berjemaah",
    "perawi_melayu": "Daripada Usman bin Affan r.a.",
    "english_text": "The Messenger of Allah (ﷺ) said:Whoever prays `Isha` in congregation, it will be like spending half the night in prayer (qiyam) and whoever prays `Isha` and Fajr in congregation, it will be like spending the whole night in prayer.`",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي سَهْلٍ يَعْنِي عُثْمَانَ بْنَ حَكِيمٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَمْرَةَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَلَّى الْعِشَاءَ فِي جَمَاعَةٍ كَانَ كَقِيَامِ نِصْفِ لَيْلَةٍ وَمَنْ صَلَّى الْعِشَاءَ وَالْفَجْرَ فِي جَمَاعَةٍ كَانَ كَقِيَامِ لَيْلَةٍ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Barang siapa yang menunaikan solat Isyak secara berjemaah, maka ia seperti telah mendirikan solat sepanjang separuh malam, dan barang siapa yang menunaikan solat Isyak dan Subuh secara berjemaah, maka ia seperti telah mendirikan solat sepanjang malam.\""
  },
  {
    "id": 36624,
    "hadith_number": 461,
    "tajuk_hadith": "Perkahwinan Orang Berihram",
    "perawi_melayu": "Daripada Nubaih bin Wahb berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنْ نُبَيْهِ بْنِ وَهْبٍ، قَالَ أَرَادَ ابْنُ مَعْمَرٍ أَنْ يُنْكِحَ، ابْنَهُ ابْنَةَ شَيْبَةَ بْنِ جُبَيْرٍ فَبَعَثَنِي إِلَى أَبَانَ بْنِ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ وَهُوَ أَمِيرُ الْمَوْسِمِ فَأَتَيْتُهُ فَقُلْتُ لَهُ إِنَّ أَخَاكَ أَرَادَ أَنْ يُنْكِحَ ابْنَهُ فَأَرَادَ أَنْ يُشْهِدَكَ ذَاكَ فَقَالَ أَلَا أُرَاهُ عِرَاقِيًّا جَافِيًا إِنَّ الْمُحْرِمَ لَا يَنْكِحُ وَلَا يُنْكِحُ ثُمَّ حَدَّثَ عَنْ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ بِمِثْلِهِ يَرْفَعُهُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ismail, telah menceritakan kepada kami Ayyub, dari Nafi', dari Nubaih bin Wahb, dia berkata: Ibn Ma'mar ingin menikahkan anaknya dengan anak perempuan Syaibah bin Jubair, maka dia mengutusku kepada Aban bin Utsman radhiyallahu 'anhu, sedang dia ialah Amirul Mausm (Ketua musim haji). Maka aku mendatanginya lalu aku berkata kepadanya: “Saudara kamu ingin menikahkan anaknya, dan dia ingin engkau menjadi saksi.” Maka dia berkata: “Aku nampak kamu seperti orang Iraq yang kurang sopan. Sesungguhnya orang yang berihram tidak boleh berkahwin dan menikahkan orang lain.” Kemudian dia menceritakan dari Utsman radhiyallahu 'anhu seperti itu dengan meriwayatkannya (dari Nabi sallallahu 'alaihi wasallam)."
  },
  {
    "id": 36625,
    "hadith_number": 462,
    "tajuk_hadith": "Keutamaan Wuduk Seperti Rasulullah SAW",
    "perawi_melayu": "Daripada Humran, hamba sahaya Usman (رضي الله عنه), bahawa Usman melakukan wuduk di al-Maqa'id, baginda membasuh setiap anggota badan sebanyak tiga kali dan berkata:",
    "english_text": "I heard the Messenger of Allah (ﷺ) say:  “Whoever does wudoo’ as I have done then gets up to pray, his sins will fall away, i.e., from his face, his hands, his feet and his head.`",
    "arabic_text": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ حُمْرَانَ، مَوْلَى عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ أَنَّ عُثْمَانَ تَوَضَّأَ بِالْمَقَاعِدِ فَغَسَلَ ثَلَاثًا ثَلَاثًا وَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ تَوَضَّأَ وُضُوئِي هَذَا ثُمَّ قَامَ إِلَى الصَّلَاةِ سَقَطَتْ خَطَايَاهُ يَعْنِي مِنْ وَجْهِهِ وَيَدَيْهِ وَرِجْلَيْهِ وَرَأْسِهِ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda:  “Barangsiapa yang berwuduk seperti wudukku, kemudian bangun untuk solat, nescaya akan gugurlah dosa-dosanya; iaitu dari mukanya, tangannya, kakinya dan kepalanya.”"
  },
  {
    "id": 36626,
    "hadith_number": 463,
    "tajuk_hadith": "Rawatan Mata dengan Kayu Aloes",
    "perawi_melayu": "Telah diriwayatkan bahawa Nubaih bin Wahb berkata:",
    "english_text": "`Umar bin `Ubaidullah bin Ma`mar had a problem in his eyes. He sent word to Aban bin `Uthman (رضي الله عنه) - Sufyan said: He was the Ameer (of Hajj) - to ask what he should do. He said: Apply aloes to them, for I heard ‘Uthman (رضي الله عنه) narrate that from the Messenger of Allah (ﷺ).",
    "arabic_text": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَيُّوبَ بْنِ مُوسَى، عَنْ نُبَيْهِ بْنِ وَهْبٍ، قَالَ اشْتَكَى عُمَرُ بْنُ عُبَيْدِ اللَّهِ بْنِ مَعْمَرٍ عَيْنَيْهِ فَأَرْسَلَ إِلَى أَبَانَ بْنِ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ قَالَ سُفْيَانُ وَهُوَ أَمِيرٌ مَا يَصْنَعُ بِهِمَا قَالَ قَالَ ضَمَّدَهُمَا بِالصَّبِرِ فَإِنِّي سَمِعْتُ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ يُحَدِّثُ ذَلِكَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏",
    "malay_translation": "Umar bin Ubaidillah bin Ma'mar mengalami masalah pada matanya.  Dia menghantar pesanan kepada Aban bin Uthman (رضي الله عنه) – Sufyan berkata:  Beliau adalah Amir (haji) – untuk bertanya apa yang patut dilakukannya.  Aban berkata:  Balut matanya dengan kayu aloes, kerana aku mendengar Uthman (رضي الله عنه) meriwayatkannya daripada Rasulullah ﷺ."
  },
  {
    "id": 36627,
    "hadith_number": 464,
    "tajuk_hadith": "Berdiri Semasa Melihat Jenazah",
    "perawi_melayu": "Daripada Aban bin Uthman (رضي الله عنه) bahawa beliau melihat sebuah jenazah datang ke arahnya.  Apabila beliau melihatnya, beliau berdiri dan berkata:",
    "english_text": "I saw Uthman (رضي الله عنه) do that and he told me that he saw the Prophet (ﷺ) do that.",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي الْحَكَمُ بْنُ مُوسَى أَبُو صَالِحٍ، حَدَّثَنَا سَعِيدُ بْنُ مَسْلَمَةَ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، عَنْ مُوسَى بْنِ عِمْرَانَ بْنِ مَنَّاحٍ، عَنْ أَبَانَ بْنِ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ أَنَّهُ رَأَى جَنَازَةً مُقْبِلَةً فَلَمَّا رَآهَا قَامَ وَقَالَ رَأَيْتُ عُثْمَانَ يَفْعَلُ ذَلِكَ وَأَخْبَرَنِي أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُهُ‏.‏",
    "malay_translation": "Aku melihat Uthman (رضي الله عنه) melakukan demikian dan beliau memberitahu aku bahawa beliau telah melihat Nabi ﷺ melakukan demikian."
  },
  {
    "id": 36628,
    "hadith_number": 465,
    "tajuk_hadith": "Larangan Menikah dan Merisik Ketika Ihram",
    "perawi_melayu": "Daripada Aban bin Uthman (رضي الله عنه) daripada Uthman (رضي الله عنه), yang meriwayatkan daripada Nabi ﷺ, bahawa Baginda bersabda:",
    "english_text": "`The pilgrim in ihram should not get married or propose marriage.`",
    "arabic_text": "حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ بْنِ مُوسَى، عَنْ نُبَيْهِ بْنِ وَهْبٍ، عَنْ أَبَانَ بْنِ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ عَنْ عُثْمَانَ، يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَنْكِحُ الْمُحْرِمُ وَلَا يَخْطُبُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Sufian, daripada Ayub bin Musa, daripada Nubaih bin Wahb, daripada Aban bin Uthman (رضي الله عنه), daripada Uthman (رضي الله عنه), yang menyampaikan kepada Nabi ﷺ, bahawa Baginda bersabda:  \"Orang yang sedang ihram tidak boleh berkahwin dan tidak boleh meminang.\""
  },
  {
    "id": 36629,
    "hadith_number": 466,
    "tajuk_hadith": "Keizinan Menggunakan Aloe Vera untuk Mata Semasa Ihram",
    "perawi_melayu": "Daripada Aban bin Uthman (رضي الله عنه) yang meriwayatkan daripada Uthman (رضي الله عنه)",
    "english_text": "It was narrated from Aban bin `Uthman (رضي الله عنه) that he narrated from `Uthman (رضي الله عنه) that  the Messenger of Allah (ﷺ)  granted a concession, or said concerning the pilgrim in ihram, if he has a problem in his eyes, that he may apply aloes to them.",
    "arabic_text": "قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ بْنِ مُوسَى بْنِ عَمْرِو بْنِ سَعِيدٍ، عَنْ نُبَيْهِ بْنِ وَهْبٍ، رَجُلٍ مِنْ الْحَجَبَةِ عَنْ أَبَانَ بْنِ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ أَنَّهُ حَدَّثَ عَنْ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ أَوْ قَالَ فِي الْمُحْرِمِ إِذَا اشْتَكَى عَيْنَهُ أَنْ يُضَمِّدَهَا بِالصَّبِرِ‏.‏",
    "malay_translation": "Daripada Aban bin Uthman (رضي الله عنه) yang meriwayatkan daripada Uthman (رضي الله عنه) bahawa Rasulullah SAW memberi kelonggaran, atau baginda bersabda berkaitan jemaah haji yang sedang dalam keadaan ihram, sekiranya dia mengalami masalah pada matanya, bahawa dia dibenarkan untuk merawatnya dengan lidah buaya."
  },
  {
    "id": 36630,
    "hadith_number": 467,
    "tajuk_hadith": "Kematian dengan Tauhid Memastikan Syurga",
    "perawi_melayu": "Daripada Usman (رضي الله عنه) diriwayatkan bahawa:",
    "english_text": "“Whoever dies knowing that there is no God but Allah will enter Paradise.”",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنِ الْوَلِيدِ أَبِي بِشْرٍ، عَنْ حُمْرَانَ، عَنْ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ مَاتَ وَهُوَ يَعْلَمُ أَنَّهُ لَا إِلَهَ إِلَّا اللَّهُ دَخَلَ الْجَنَّةَ‏.‏",
    "malay_translation": "Daripada Usman r.a. diriwayatkan bahawa Rasulullah SAW bersabda:  “Barangsiapa yang mati dalam keadaan mengetahui bahawa tiada Tuhan melainkan Allah, nescaya dia akan masuk syurga.”"
  },
  {
    "id": 36631,
    "hadith_number": 468,
    "tajuk_hadith": "Penggabungan Surah Al-Anfal dan Baraah",
    "perawi_melayu": "Ibn Abbas (رضي الله عنه) memberitahu kita. Saya berkata kepada Uthman bin Affan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا عَوْفُ بْنُ أَبِي جَمِيلَةَ، حَدَّثَنِي يَزِيدُ الْفَارِسِيُّ، حَدَّثَنَا ابْنُ عَبَّاسٍ، قَالَ قُلْتُ لِعُثْمَانَ مَا حَمَلَكُمْ عَلَى أَنْ عَمَدْتُمْ إِلَى سُورَةِ الْأَنْفَالِ وَهِيَ مِنْ الْمَثَانِي وَإِلَى سُورَةِ بَرَاءَةٌ وَهِيَ مِنْ الْمِئِينَ فَقَرَنْتُمْ بَيْنَهُمَا وَلَمْ تَكْتُبُوا بَيْنَهُمَا سَطْرَ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ فَوَضَعْتُمُوهَا فِي السَّبْعِ الطِّوَالِ فَمَا حَمَلَكُمْ عَلَى ذَلِكَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِمَّا يَأْتِي عَلَيْهِ الزَّمَانُ وَهُوَ يُنْزَلُ عَلَيْهِ مِنْ السُّوَرِ ذَوَاتِ الْعَدَدِ فَكَانَ إِذَا أُنْزِلَ عَلَيْهِ الشَّيْءُ دَعَا بَعْضَ مَنْ يَكْتُبُ لَهُ فَيَقُولُ ضَعُوا هَذِهِ فِي السُّورَةِ الَّتِي يُذْكَرُ فِيهَا كَذَا وَكَذَا وَإِذَا أُنْزِلَتْ عَلَيْهِ الْآيَاتُ قَالَ ضَعُوا هَذِهِ الْآيَاتِ فِي السُّورَةِ الَّتِي يُذْكَرُ فِيهَا كَذَا وَكَذَا وَإِذَا أُنْزِلَتْ عَلَيْهِ الْآيَةُ قَالَ ضَعُوا هَذِهِ الْآيَةَ فِي السُّورَةِ الَّتِي يُذْكَرُ فِيهَا كَذَا وَكَذَا وَكَانَتْ سُورَةُ الْأَنْفَالِ مِنْ أَوَائِلِ مَا نَزَلَ بِالْمَدِينَةِ وَكَانَتْ سُورَةُ بَرَاءَةٌ مِنْ أَوَاخِرِ مَا أُنْزِلَ مِنْ الْقُرْآنِ قَالَ فَكَانَتْ قِصَّتُهَا شَبِيهًا بِقِصَّتِهَا فَظَنَنَّا أَنَّهَا مِنْهَا وَقُبِضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يُبَيِّنْ لَنَا أَنَّهَا مِنْهَا فَمِنْ أَجْلِ ذَلِكَ قَرَنْتُ بَيْنَهُمَا وَلَمْ أَكْتُبْ بَيْنَهُمَا سَطْرَ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ وَوَضَعْتُهَا فِي السَّبْعِ الطِّوَالِ‏.‏",
    "malay_translation": "Aku bertanya kepada Uthman: Apakah yang mendorong kamu menyatukan Surah Al-Anfal (yang merupakan salah satu daripada surah-surah yang sederhana panjangnya) dan Surah Baraah (yang merupakan salah satu daripada surah-surah yang panjang), dan tidak menulis baris “Bismillahir-Rahmanir-Rahim” di antara keduanya, lalu meletakkannya bersama tujuh surah yang panjang? Apakah yang mendorong kamu berbuat demikian?  Uthman berkata: Rasulullah SAW menerima wahyu secara berperingkat. Apabila sesuatu ayat diwahyukan, baginda akan memanggil salah seorang penulis dan berkata, “Letakkan ini dalam surah yang menyebut tentang…”. Begitu juga, jika beberapa ayat diwahyukan, baginda akan berkata, “Letakkan ayat-ayat ini dalam surah yang menyebut tentang…”. Dan jika satu ayat diwahyukan, baginda akan berkata, “Letakkan ayat ini dalam surah yang menyebut tentang…”. Surah Al-Anfal adalah antara surah-surah yang diturunkan awal di Madinah, manakala Surah Baraah adalah antara surah-surah yang diturunkan akhir dalam al-Quran. Kedua-dua surah ini mempunyai persamaan isi kandungan.  Kemudian, Rasulullah SAW wafat tanpa menjelaskan kepada kami secara jelas bahawa kedua-dua surah ini berkaitan. Oleh kerana itu, kami menyangka ia berkaitan, maka aku menyatukan kedua-duanya tanpa menulis baris “Bismillahir-Rahmanir-Rahim” di antara keduanya, dan aku meletakkannya bersama tujuh surah yang panjang."
  },
  {
    "id": 36632,
    "hadith_number": 469,
    "tajuk_hadith": "Keutamaan Mempelajari dan Mengajar Al-Quran",
    "perawi_melayu": "Daripada Usman (رضي الله عنه), bahawa Nabi ﷺ bersabda:",
    "english_text": "“The best of you are those who learn Qur`an and teach it.`",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، وَشُعْبَةَ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سُفْيَانُ أَفْضَلُكُمْ وَقَالَ شُعْبَةُ خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ‏.‏",
    "malay_translation": "Daripada Yahya bin Said, daripada Sufyan dan Syu’bah, daripada Al-‘Alaqamah bin Marthad, daripada Saad bin Ubaidah, daripada Abu Abdur Rahman, daripada Usman r.a, bahawa Nabi SAW bersabda:  Sufyan berkata: “Orang yang paling baik di antara kamu…” dan Syu’bah berkata: “…ialah orang yang mempelajari al-Quran dan mengajarkannya.”"
  },
  {
    "id": 36633,
    "hadith_number": 470,
    "tajuk_hadith": "Nasihat Nabi SAW kepada Uthman bin Affan",
    "perawi_melayu": "Abu Sahlah meriwayatkan bahawa Uthman (رضي الله عنه) berkata pada hari rumah ketika beliau dikepung. Nabi (ﷺ) memberi nasihat yang serius kepada saya dan saya akan mengikut nasihat baginda dengan sabar. Qais berkata:",
    "english_text": "They thought it (his advice) was about that day.",
    "arabic_text": "حَدَّثَنَا وَكِيعٌ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، قَالَ قَالَ قَيْسٌ فَحَدَّثَنِي أَبُو سَهْلَةَ، أَنَّ عُثْمَانَ، قَالَ يَوْمَ الدَّارِ حِينَ حُصِرَ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَهِدَ إِلَيَّ عَهْدًا فَأَنَا صَابِرٌ عَلَيْهِ قَالَ قَيْسٌ فَكَانُوا يَرَوْنَهُ ذَلِكَ الْيَوْمَ‏.‏",
    "malay_translation": "Mereka menyangka bahawa (nasihat baginda) adalah mengenai hari itu."
  },
  {
    "id": 36634,
    "hadith_number": 471,
    "tajuk_hadith": "Hukum Anak Luar Nikah Menurut Rasulullah SAW",
    "perawi_melayu": "Ia diriwayatkan daripada al-Hasan bin Sa'd bahawa Rabah berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَزِيدُ، أَنْبَأَنَا مَهْدِيُّ بْنُ مَيْمُونٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي يَعْقُوبَ، عَنِ الْحَسَنِ بْنِ سَعْدٍ، قَالَ حَدَّثَنِي رَبَاحٌ، قَالَ زَوَّجَنِي مَوْلَايَ جَارِيَةً رُومِيَّةً فَوَقَعْتُ عَلَيْهَا فَوَلَدَتْ لِي غُلَامًا أَسْوَدَ مِثْلِي فَسَمَّيْتُهُ عَبْدَ اللَّهِ ثُمَّ وَقَعْتُ عَلَيْهَا فَوَلَدَتْ لِي غُلَامًا أَسْوَدَ مِثْلِي فَسَمَّيْتُهُ عُبَيْدَ اللَّهِ ثُمَّ طَبِنَ لِي غُلَامٌ رُومِيٌّ قَالَ حَسِبْتُهُ قَالَ لِأَهْلِي رُومِيٌّ يُقَالُ لَهُ يُوحَنَّسُ فَرَاطَنَهَا بِلِسَانِهِ يَعْنِي بِالرُّومِيَّةِ فَوَقَعَ عَلَيْهَا فَوَلَدَتْ لَهُ غُلَامًا أَحْمَرَ كَأَنَّهُ وَزَغَةٌ مِنْ الْوَزَغَاتِ فَقُلْتُ لَهَا مَا هَذَا فَقَالَتْ هَذَا مِنْ يُوحَنَّسَ قَالَ فَارْتَفَعْنَا إِلَى عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ وَأَقَرَّا جَمِيعًا فَقَالَ عُثْمَانُ إِنْ شِئْتُمْ قَضَيْتُ بَيْنَكُمْ بِقَضِيَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى أَنَّ الْوَلَدَ لِلْفِرَاشِ قَالَ حَسِبْتُهُ قَالَ وَجَلَدَهُمَا‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Yazid, telah menceritakan kepada kami Mahdi bin Maymun, dari Muhammad bin Abdullah bin Abi Ya'qub, dari al-Hasan bin Sa'd, dia berkata; Telah menceritakan kepadaku Rabah, dia berkata: Tuan saya menikahkan saya dengan seorang hamba perempuan bangsa Rom.  Lalu saya melakukan hubungan intim dengannya, dan dia melahirkan seorang anak lelaki yang berkulit hitam seperti saya, lalu saya menamakannya Abdullah. Kemudian saya melakukan hubungan intim dengannya lagi, dan dia melahirkan seorang anak lelaki yang berkulit hitam seperti saya, lalu saya menamakannya Ubaidullah. Kemudian, seorang hamba lelaki bangsa Rom yang bernama Yohanes datang kepada hamba perempuan itu, dan dia berbicara kepadanya dalam bahasa Rom.  Kemudian dia melakukan hubungan intim dengannya, lalu dia melahirkan seorang anak lelaki yang berkulit merah seperti cicak. Saya bertanya kepadanya: “Apakah ini?”, dia menjawab: “Ini anak Yohanes.” Maka kami mengadu kepada Uthman bin Affan r.a., dan mereka berdua mengaku.  Uthman berkata: “Jika kamu mahu, saya akan menghakimi di antara kamu berdasarkan hukum Rasulullah SAW.” Rasulullah SAW telah memutuskan bahawa anak itu adalah anak kepada suami (isteri itu). Kemudian dia menyeksa mereka berdua."
  },
  {
    "id": 36635,
    "hadith_number": 472,
    "tajuk_hadith": "Wudhuk Sempurna dan Solat-solat Fardu",
    "perawi_melayu": "Telah diriwayatkan bahawa Jami` bin Shaddad berkata:",
    "english_text": "I heard Humran bin Aban telling Abu Burdah in the mosque that he heard `Uthman bin `Affan (رضي الله عنه) narrate from the Prophet (ﷺ)  that he said: “Whoever does wudoo’ properly as enjoined by Allah, the prescribed prayers will be expiations for whatever comes between them.`",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ جَامِعِ بْنِ شَدَّادٍ، قَالَ سَمِعْتُ حُمْرَانَ بْنَ أَبَانَ، يُحَدِّثُ أَبَا بُرْدَةَ فِي الْمَسْجِدِ أَنَّهُ سَمِعَ عُثْمَانَ بْنَ عَفَّانَ، يُحَدِّثُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ أَتَمَّ الْوُضُوءَ كَمَا أَمَرَهُ اللَّهُ فَالصَّلَوَاتُ الْمَكْتُوبَاتُ كَفَّارَاتٌ لِمَا بَيْنَهُنَّ‏.‏",
    "malay_translation": "Aku mendengar Humran bin Aban memberitahu Abu Burdah di masjid bahawa dia mendengar Uthman bin Affan (رضي الله عنه) meriwayatkan daripada Nabi ﷺ bahawa baginda bersabda:  “Barangsiapa yang menyempurnakan wuduk seperti yang diperintahkan oleh Allah, maka solat-solat fardu akan menjadi kafarah (penebus dosa) bagi apa yang ada di antara solat-solat tersebut.”"
  },
  {
    "id": 36636,
    "hadith_number": 473,
    "tajuk_hadith": "Teladan Kepemimpinan Usman bin Affan",
    "perawi_melayu": "Daripada riwayat Simak bin Harb:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، قَالَ سَمِعْتُ عَبَّادَ بْنَ زَاهِرٍ أَبَا رُوَاعٍ، قَالَ سَمِعْتُ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ يَخْطُبُ فَقَالَ إِنَّا وَاللَّهِ قَدْ صَحِبْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي السَّفَرِ وَالْحَضَرِ وَكَانَ يَعُودُ مَرْضَانَا وَيَتْبَعُ جَنَائِزَنَا وَيَغْزُو مَعَنَا وَيُوَاسِينَا بِالْقَلِيلِ وَالْكَثِيرِ وَإِنَّ نَاسًا يُعْلِمُونِي بِهِ عَسَى أَنْ لَا يَكُونَ أَحَدُهُمْ رَآهُ قَطُّ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Ja'far, telah menceritakan kepada kami Syu'bah, daripada Simaak bin Harb, dia berkata: Aku mendengar Abbad bin Zahir Abu Ruwa' berkata: Aku mendengar Uthman r.a. berkhutbah lalu berkata: Demi Allah, sesungguhnya kami telah berdampingan dengan Rasulullah SAW di waktu musafir dan menetap, dan baginda selalu melawat orang-orang yang sakit di kalangan kami, mengiringi jenazah kami, berperang bersama kami dan menghibur kami sama ada dengan sedikit atau banyak. Dan sesungguhnya ada orang yang menceritakan kepadaku tentang baginda, mungkin di antara mereka tiada yang pernah melihat baginda."
  },
  {
    "id": 36637,
    "hadith_number": 474,
    "tajuk_hadith": "Uthman r.a. Mengikuti Sunnah Rasulullah SAW",
    "perawi_melayu": "Sa'id bin al-Musayyab berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنِي شُعَيْبٌ أَبُو شَيْبَةَ، قَالَ سَمِعْتُ عَطَاءً الْخُرَاسَانِيَّ، يَقُولُ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ رَأَيْتُ عُثْمَانَ قَاعِدًا فِي الْمَقَاعِدِ فَدَعَا بِطَعَامٍ مِمَّا مَسَّتْهُ النَّارُ فَأَكَلَهُ ثُمَّ قَامَ إِلَى الصَّلَاةِ فَصَلَّى ثُمَّ قَالَ عُثْمَانُ قَعَدْتُ مَقْعَدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَكَلْتُ طَعَامَ رَسُولِ اللَّهِ وَصَلَّيْتُ صَلَاةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Al-Walid bin Muslim, telah menceritakan kepadaku Shu'aib Abu Syaibah, dia berkata; aku mendengar Ata' Al-Khurasani berkata; aku mendengar Sa'id bin Al-Musayyab berkata; aku melihat Uthman duduk di tempat duduk. Kemudian dia memanggil makanan yang telah terkena api lalu memakannya, kemudian dia bangun untuk solat, lalu dia solat. Kemudian Uthman berkata: Aku duduk di tempat duduk Rasulullah SAW, dan aku makan makanan Rasulullah SAW dan aku solat solat Rasulullah SAW."
  },
  {
    "id": 36638,
    "hadith_number": 475,
    "tajuk_hadith": "Pahala Membina Masjid",
    "perawi_melayu": "Daripada Mahmood bin Labeed bahawa Usman (رضي الله عنه) ingin membina (sambungan kepada) masjid Madinah, tetapi penduduk membantah dan mahu mengekalkannya seperti sedia ada. Usman (رضي الله عنه) berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ، حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، حَدَّثَنِي أَبِي، عَنْ مَحْمُودِ بْنِ لَبِيدٍ، أَنَّ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ أَرَادَ أَنْ يَبْنِيَ مَسْجِدَ الْمَدِينَةِ فَكَرِهَ النَّاسُ ذَاكَ وَأَحَبُّوا أَنْ يَدَعُوهُ عَلَى هَيْئَتِهِ فَقَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ بَنَى مَسْجِدًا لِلَّهِ بَنَى اللَّهُ لَهُ بَيْتًا فِي الْجَنَّةِ مِثْلَهُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ad-Dhahak bin Makhled, telah menceritakan kepada kami Abdul Hamid bin Ja’far, telah menceritakan kepadaku bapaku, daripada Mahmood bin Labeed, bahawa Usman r.a. ingin membina Masjid Madinah, tetapi penduduk tidak menyukainya dan lebih suka mengekalkannya seperti sedia ada. Usman r.a. berkata: Aku mendengar Rasulullah SAW bersabda: Barangsiapa membina masjid kerana Allah, nescaya Allah akan membina untuknya sebuah rumah di syurga yang serupa dengannya."
  },
  {
    "id": 36639,
    "hadith_number": 476,
    "tajuk_hadith": "Ancaman Neraka bagi yang Berbohong tentang Rasulullah SAW",
    "perawi_melayu": "Daripada Usman bin Affan (رضي الله عنه) berkata:",
    "english_text": "The Messenger of Allah (ﷺ) said: `Whoever tells a lie about me deliberately, let him take up his abode in Hell.`",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْكَبِيرِ بْنُ عَبْدِ الْمَجِيدِ أَبُو بَكْرٍ الْحَنَفِيُّ، حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، عَنْ أَبِيهِ، عَنْ مَحْمُودِ بْنِ لَبِيدٍ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَعَمَّدَ عَلَيَّ كَذِبًا فَلْيَتَبَوَّأْ بَيْتًا فِي النَّارِ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Sesiapa yang sengaja berbohong tentangku, maka hendaklah dia menyediakan tempat tinggal di neraka.\""
  },
  {
    "id": 36640,
    "hadith_number": 477,
    "tajuk_hadith": "Kemudahan dalam Muamalat Membawa Ke Syurga",
    "perawi_melayu": "Daripada Uthman bin Affan (رضي الله عنه) berkata:",
    "english_text": "The Messenger of Allah (ﷺ) said: `Allah admitted to Paradise a man who was easygoing in buying and selling, when paying off debt and when asking for a debt that was owed to him.`",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا يُونُسُ، حَدَّثَنَا عَطَاءُ بْنُ فَرُّوخَ، مَوْلَى الْقُرَشِيِّينَ عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَدْخَلَ اللَّهُ رَجُلًا الْجَنَّةَ كَانَ سَهْلًا مُشْتَرِيًا وَبَائِعًا وَقَاضِيًا وَمُقْتَضِيًا‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  “Allah SWT memasukkan seorang lelaki ke dalam syurga kerana dia bersikap mudah dalam urusan jual beli, membayar hutang dan menuntut hutang yang tertunggak.”"
  },
  {
    "id": 36641,
    "hadith_number": 478,
    "tajuk_hadith": "Hukum Membunuh Muslim",
    "perawi_melayu": "Daripada Abu Umamah bin Sahl bin Hunaif. Baginda berkata: Kami bersama Uthman ketika beliau dikepung di dalam rumah. Beliau berkata:",
    "english_text": "Why would they kill me? I heard the Messenger of Allah (ﷺ) say: `It is not permissible (to shed) the blood of a Muslim except in three cases: If a man disbelieves after becoming Muslim, or commits zina after being married or kills someone and is executed in retaliation.`",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، قَالَ كُنَّا مَعَ عُثْمَانَ وَهُوَ مَحْصُورٌ فِي الدَّارِ قَالَ وَلِمَ تَقْتُلُونَنِي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلَّا بِإِحْدَى ثَلَاثٍ رَجُلٌ كَفَرَ بَعْدَ إِسْلَامِهِ أَوْ زَنَى بَعْدَ إِحْصَانِهِ أَوْ قَتَلَ نَفْسًا فَيُقْتَلُ بِهَا‏.‏",
    "malay_translation": "“Mengapa mereka membunuhku? Aku mendengar Rasulullah SAW bersabda:  ‘Tidak halal darah seorang Muslim melainkan dalam tiga keadaan:  Seseorang yang murtad selepas memeluk Islam, atau berzina selepas berkahwin, atau membunuh seseorang lalu dibunuh sebagai balasan.’"
  },
  {
    "id": 36642,
    "hadith_number": 479,
    "tajuk_hadith": "Larangan Berpuasa pada Hari Raya dan Baki Daging Korban",
    "perawi_melayu": "Daripada Abu ‘Ubaid, hamba yang dimerdekakan oleh AbdurRahman bin Azhar, berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدِ بْنِ خَالِدِ بْنِ عَبْدِ اللَّهِ بْنِ قَارِظٍ، عَنْ أَبِي عُبَيْدٍ، مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ أَزْهَرَ قَالَ رَأَيْتُ عَلِيًّا وَعُثْمَانَ رَضِيَ اللَّهُ عَنْهُمَا يُصَلِّيَانِ يَوْمَ الْفِطْرِ وَالْأَضْحَى ثُمَّ يَنْصَرِفَانِ يُذَكِّرَانِ النَّاسَ قَالَ وَسَمِعْتُهُمَا يَقُولَانِ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ صِيَامِ هَذَيْنِ الْيَوْمَيْنِ‏.‏\nقَالَ وَسَمِعْتُ عَلِيًّا، يَقُولُ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَبْقَى مِنْ نُسُكِكُمْ عِنْدَكُمْ شَيْءٌ بَعْدَ ثَلَاثٍ‏.‏",
    "malay_translation": "Aku melihat Ali dan Uthman رضي الله عنهما menunaikan solat pada hari raya Fitri dan Aidiladha, kemudian mereka berdua berlalu sambil mengingatkan orang ramai. Aku mendengar mereka berdua berkata: “Sesungguhnya Rasulullah ﷺ melarang berpuasa pada dua hari ini.”\nAku juga mendengar Ali berkata: “Rasulullah ﷺ melarang supaya apa-apa yang tinggal daripada korban kamu tidak disimpan melebihi tiga hari.”"
  },
  {
    "id": 36643,
    "hadith_number": 480,
    "tajuk_hadith": "Pahala Membeli Tanah Untuk Masjid dan Menampung Perbelanjaan Perang Tabuk",
    "perawi_melayu": "Al-Ahnaf berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا بَهْزٌ، حَدَّثَنَا أَبُو عَوَانَةَ، حَدَّثَنَا حُصَيْنٌ، عَنْ عَمْرِو بْنِ جَاوَانَ، قَالَ قَالَ الْأَحْنَفُ انْطَلَقْنَا حُجَّاجًا فَمَرَرْنَا بِالْمَدِينَةِ فَبَيْنَمَا نَحْنُ فِي مَنْزِلِنَا إِذْ جَاءَنَا آتٍ فَقَالَ النَّاسُ مِنْ فَزَعٍ فِي الْمَسْجِدِ فَانْطَلَقْتُ أَنَا وَصَاحِبِي فَإِذَا النَّاسُ مُجْتَمِعُونَ عَلَى نَفَرٍ فِي الْمَسْجِدِ قَالَ فَتَخَلَّلْتُهُمْ حَتَّى قُمْتُ عَلَيْهِمْ فَإِذَا عَلِيُّ بْنُ أَبِي طَالِبٍ وَالزُّبَيْرُ وَطَلْحَةُ وَسَعْدُ بْنُ أَبِي وَقَّاصٍ قَالَ فَلَمْ يَكُنْ ذَلِكَ بِأَسْرَعَ مِنْ أَنْ جَاءَ عُثْمَانُ يَمْشِي فَقَالَ أَهَاهُنَا عَلِيٌّ قَالُوا نَعَمْ قَالَ أَهَاهُنَا الزُّبَيْرُ قَالُوا نَعَمْ قَالَ أَهَاهُنَا طَلْحَةُ قَالُوا نَعَمْ قَالَ أَهَاهُنَا سَعْدٌ قَالُوا نَعَمْ قَالَ أَنْشُدُكُمْ بِاللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ أَتَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ يَبْتَاعُ مِرْبَدَ بَنِي فُلَانٍ غَفَرَ اللَّهُ لَهُ فَابْتَعْتُهُ فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ إِنِّي قَدْ ابْتَعْتُهُ فَقَالَ اجْعَلْهُ فِي مَسْجِدِنَا وَأَجْرُهُ لَكَ قَالُوا نَعَمْ قَالَ أَنْشُدُكُمْ بِاللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ أَتَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ يَبْتَاعُ بِئْرَ رُومَةَ فَابْتَعْتُهَا بِكَذَا وَكَذَا فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ إِنِّي قَدْ ابْتَعْتُهَا يَعْنِي بِئْرَ رُومَةَ فَقَالَ اجْعَلْهَا سِقَايَةً لِلْمُسْلِمِينَ وَأَجْرُهَا لَكَ قَالُوا نَعَمْ قَالَ أَنْشُدُكُمْ بِاللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ أَتَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَظَرَ فِي وُجُوهِ الْقَوْمِ يَوْمَ جَيْشِ الْعُسْرَةِ فَقَالَ مَنْ يُجَهِّزُ هَؤُلَاءِ غَفَرَ اللَّهُ لَهُ فَجَهَّزْتُهُمْ حَتَّى مَا يَفْقِدُونَ خِطَامًا وَلَا عِقَالًا قَالُوا اللَّهُمَّ نَعَمْ قَالَ اللَّهُمَّ اشْهَدْ اللَّهُمَّ اشْهَدْ اللَّهُمَّ اشْهَدْ ثُمَّ انْصَرَفَ‏.‏",
    "malay_translation": "Kami berangkat menunaikan haji dan singgah di Madinah. Ketika kami berada di tempat penginapan, tiba-tiba datang seorang yang memberitahu bahawa orang ramai sedang panik di masjid. Saya dan sahabat saya pun bergegas ke masjid dan mendapati orang ramai berkumpul di sekitar sekumpulan orang di dalam masjid. Saya menerobos lalu menemui Ali bin Abi Talib, Az-Zubair, Talhah dan Sa’d bin Abi Waqqas. Tidak lama kemudian, datanglah Uthman berjalan kaki sambil bertanya, “Adakah Ali di sini?” Mereka menjawab, “Ya.” Dia bertanya lagi, “Adakah Az-Zubair di sini?” Mereka menjawab, “Ya.” Dia bertanya lagi, “Adakah Talhah di sini?” Mereka menjawab, “Ya.” Dia bertanya lagi, “Adakah Sa’d di sini?” Mereka menjawab, “Ya.” Uthman berkata, “Aku bersumpah demi Allah SWT yang tiada Tuhan melainkan Dia, adakah kamu semua tahu bahawa Rasulullah SAW telah bersabda: “Barangsiapa yang membeli tempat pengeringan kurma milik Bani fulan, nescaya Allah akan mengampuninya.” Maka saya membelinya dan pergi menghadap Rasulullah SAW dan berkata, “Wahai Rasulullah, saya telah membelinya.” Baginda menjawab, “Letakkanlah ia di masjid kita dan pahalanya adalah untukmu.” Mereka berkata, “Ya.” Uthman bertanya lagi, “Aku bersumpah demi Allah SWT yang tiada Tuhan melainkan Dia, adakah kamu semua tahu bahawa Rasulullah SAW telah bersabda: “Siapakah yang mahu membeli perigi Rumahah?” Maka saya membelinya dengan harga sekian-sekian dan pergi menghadap Rasulullah SAW lalu berkata, “Wahai Rasulullah, saya telah membelinya (maksudnya perigi Rumahah).” Baginda menjawab, “Jadikanlah ia sebagai sumber air untuk umat Islam dan pahalanya adalah untukmu.” Mereka berkata, “Ya.” Uthman bertanya lagi, “Aku bersumpah demi Allah SWT yang tiada Tuhan melainkan Dia, adakah kamu semua tahu bahawa Rasulullah SAW pernah memandang wajah-wajah orang ramai pada hari tentera mengalami kesusahan (Tabuk) dan bersabda: “Barangsiapa yang menyediakan kelengkapan untuk mereka, nescaya Allah akan mengampuninya.” Maka saya menyediakan kelengkapan untuk mereka sehingga mereka tidak kekurangan apa-apa pun, termasuk tali kekang dan tali pinggang.” Mereka berkata, “Demi Allah, ya.” Uthman berkata, “Ya Allah, saksikanlah! Ya Allah, saksikanlah! Ya Allah, saksikanlah!” Kemudian dia berlalu pergi."
  },
  {
    "id": 36644,
    "hadith_number": 481,
    "tajuk_hadith": "Contoh Teladan Rasulullah SAW dalam Tawaf",
    "perawi_melayu": "Telah diriwayatkan bahawa salah seorang daripada keluarga Ya'la bin Umayyah berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي سُلَيْمَانُ بْنُ عَتِيقٍ، عَنْ عَبْدِ اللَّهِ بْنِ بَابَيْهِ، عَنْ بَعْضِ بَنِي يَعْلَى بْنِ أُمَيَّةَ، قَالَ قَالَ يَعْلَى طُفْتُ مَعَ عُثْمَانَ فَاسْتَلَمْنَا الرُّكْنَ قَالَ يَعْلَى فَكُنْتُ مِمَّا يَلِي الْبَيْتَ فَلَمَّا بَلَغْنَا الرُّكْنَ الْغَرْبِيَّ الَّذِي يَلِي الْأَسْوَدَ جَرَرْتُ بِيَدِهِ لِيَسْتَلِمَ فَقَالَ مَا شَأْنُكَ فَقُلْتُ أَلَا تَسْتَلِمُ قَالَ فَقَالَ أَلَمْ تَطُفْ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ بَلَى قَالَ أَرَأَيْتَهُ يَسْتَلِمُ هَذَيْنِ الرُّكْنَيْنِ الْغَرْبِيَّيْنِ قُلْتُ لَا قَالَ أَفَلَيْسَ لَكَ فِيهِ أُسْوَةٌ حَسَنَةٌ قُلْتُ بَلَى قَالَ فَانْفُذْ عَنْكَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Bakar, telah memberitakan kepada kami Ibnu Juraij, telah memberitakan kepadaku Sulaiman bin Atiq, dari Abdullah bin Babaih, dari sebahagian daripada Bani Ya’la bin Umayyah, dia berkata; Ya’la berkata: Aku telah melakukan tawaf bersama Usman, maka kami mencium sudut (Kaabah). Ya’la berkata: Aku berada di bahagian yang berhampiran dengan Kaabah. Kemudian apabila kami sampai ke sudut barat yang berhampiran dengan Hajar Aswad, aku menarik tangannya supaya dia menciumnya, maka dia berkata: Apakah masalahmu? Aku berkata: Bukankah engkau akan menciumnya? Dia berkata: Bukankah engkau telah melakukan tawaf bersama Rasulullah SAW? Aku berkata: Ya. Dia berkata: Adakah engkau melihat baginda mencium kedua-dua sudut barat ini? Aku berkata: Tidak. Dia berkata: Bukankah baginda merupakan contoh teladan yang baik bagimu? Aku berkata: Ya. Dia berkata: Maka tinggalkanlah perkara itu."
  },
  {
    "id": 36645,
    "hadith_number": 482,
    "tajuk_hadith": "Pengampunan Dosadan Amalan Baik yang Kekal",
    "perawi_melayu": "Abu ‘Aqil meriwayatkan bahawa beliau mendengar al-Harits, hamba sahaya Uthman (رضي الله عنه) berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ الْمُقْرِئُ، حَدَّثَنَا حَيْوَةُ، أَنْبَأَنَا أَبُو عَقِيلٍ، أَنَّهُ سَمِعَ الْحَارِثَ، مَوْلَى عُثْمَانَ يَقُولُ جَلَسَ عُثْمَانُ يَوْمًا وَجَلَسْنَا مَعَهُ فَجَاءَهُ الْمُؤَذِّنُ فَدَعَا بِمَاءٍ فِي إِنَاءٍ أَظُنُّهُ سَيَكُونُ فِيهِ مُدٌّ فَتَوَضَّأَ ثُمَّ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَوَضَّأُ وُضُوئِي هَذَا ثُمَّ قَالَ وَمَنْ تَوَضَّأَ وُضُوئِي ثُمَّ قَامَ فَصَلَّى صَلَاةَ الظُّهْرِ غُفِرَ لَهُ مَا كَانَ بَيْنَهَا وَبَيْنَ الصُّبْحِ ثُمَّ صَلَّى الْعَصْرَ غُفِرَ لَهُ مَا بَيْنَهَا وَبَيْنَ صَلَاةِ الظُّهْرِ ثُمَّ صَلَّى الْمَغْرِبَ غُفِرَ لَهُ مَا بَيْنَهَا وَبَيْنَ صَلَاةِ الْعَصْرِ ثُمَّ صَلَّى الْعِشَاءَ غُفِرَ لَهُ مَا بَيْنَهَا وَبَيْنَ صَلَاةِ الْمَغْرِبِ ثُمَّ لَعَلَّهُ أَنْ يَبِيتَ يَتَمَرَّغُ لَيْلَتَهُ ثُمَّ إِنْ قَامَ فَتَوَضَّأَ وَصَلَّى الصُّبْحَ غُفِرَ لَهُ مَا بَيْنَهَا وَبَيْنَ صَلَاةِ الْعِشَاءِ وَهُنَّ الْحَسَنَاتُ يُذْهِبْنَ السَّيِّئَاتِ قَالُوا هَذِهِ الْحَسَنَاتُ فَمَا الْبَاقِيَاتُ يَا عُثْمَانُ قَالَ هُنَّ لَا إِلَهَ إِلَّا اللَّهُ وَسُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَاللَّهُ أَكْبَرُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ‏.‏",
    "malay_translation": "Abu Abdur Rahman al-Muqri’ meriwayatkan daripada Haywah, yang memberitakan daripada Abu ‘Aqil bahawa beliau mendengar al-Harits, hamba Uthman berkata:  “Suatu hari, Uthman duduk dan kami duduk bersamanya.  Kemudian datanglah muazin. Uthman menyuruh membawakan air dalam bekas yang ku sangka berisi satu mudd.  Lalu beliau berwuduk, kemudian berkata, ‘Aku melihat Rasulullah SAW berwuduk seperti wudukku ini.’ Kemudian beliau berkata, ‘Barangsiapa berwuduk seperti wudukku ini, kemudian bangun dan menunaikan solat Zuhur, maka diampunkanlah dosanya di antara solat Zuhur dan Subuh. Kemudian jika dia menunaikan solat Asar, diampunkanlah dosanya di antara solat Asar dan Zuhur. Kemudian jika dia menunaikan solat Maghrib, diampunkanlah dosanya di antara solat Maghrib dan Asar. Kemudian jika dia menunaikan solat Isya’, diampunkanlah dosanya di antara solat Isya’ dan Maghrib.  Kemudian dia mungkin akan bermalam dengan melakukan perkara-perkara yang diredai Allah.  Lalu jika dia bangun, berwuduk dan menunaikan solat Subuh, maka diampunkanlah dosanya di antara solat Subuh dan Isya’. Inilah amalan-amalan baik yang menghapuskan amalan-amalan buruk.’ Mereka bertanya, ‘Ini amalan-amalan baik, tetapi apakah amalan-amalan baik yang kekal, wahai Uthman?’ Beliau menjawab, ‘Ialah: La ilaha illallah, Subhanallah, Alhamdulillah, Wallahu Akbar, wala hawla wala quwwata illa billah (Tiada Tuhan melainkan Allah, Maha Suci Allah, Segala puji bagi Allah, Allah Maha Besar, dan tiada daya upaya melainkan dengan pertolongan Allah).’”"
  },
  {
    "id": 36646,
    "hadith_number": 483,
    "tajuk_hadith": "Kesopanan Rasulullah SAW dan Kepekaan terhadap Perasaan Sahabat",
    "perawi_melayu": "Aisyah, isteri Nabi SAW dan Uthman (رضي الله عنه) meriwayatkan bahawa Abu Bakar meminta izin untuk masuk menemui Rasulullah SAW ketika baginda sedang berbaring di atas katil, memakai kain penutup Aisyah.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَجَّاجٌ، حَدَّثَنَا لَيْثٌ، حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، عَنْ يَحْيَى بْنِ سَعِيدِ بْنِ الْعَاصِ، أَنَّ سَعِيدَ بْنَ الْعَاصِ، أَخْبَرَهُ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعُثْمَانَ حَدَّثَاهُ أَنَّ أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ اسْتَأْذَنَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُضْطَجِعٌ عَلَى فِرَاشِهِ لَابِسٌ مِرْطَ عَائِشَةَ فَأَذِنَ لِأَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ وَهُوَ كَذَلِكَ فَقَضَى إِلَيْهِ حَاجَتَهُ ثُمَّ انْصَرَفَ ثُمَّ اسْتَأْذَنَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ فَأَذِنَ لَهُ وَهُوَ عَلَى تِلْكَ الْحَالِ فَقَضَى إِلَيْهِ حَاجَتَهُ ثُمَّ انْصَرَفَ قَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ ثُمَّ اسْتَأْذَنْتُ عَلَيْهِ فَجَلَسَ وَقَالَ لِعَائِشَةَ رَضِيَ اللَّهُ عَنْهَا اجْمَعِي عَلَيْكِ ثِيَابَكِ فَقَضَى إِلَيَّ حَاجَتِي ثُمَّ انْصَرَفْتُ قَالَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا يَا رَسُولَ اللَّهِ مَا لِي لَمْ أَرَكَ فَزِعْتَ لِأَبِي بَكْرٍ وَعُمَرَ كَمَا فَزِعْتَ لِعُثْمَانَ رَضِيَ اللَّهُ عَنْهُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ عُثْمَانَ رَجُلٌ حَيِيٌّ وَإِنِّي خَشِيتُ إِنْ أَذِنْتُ لَهُ عَلَى تِلْكَ الْحَالِ أَنْ لَا يَبْلُغَ إِلَيَّ فِي حَاجَتِهِ و قَالَ اللَّيْثُ وَقَالَ جَمَاعَةُ النَّاسِ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِعَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَلَا أَسْتَحْيِي مِمَّنْ يَسْتَحْيِي مِنْهُ الْمَلَائِكَةُ.\nحَدَّثَنَا يَعْقُوبُ حَدَّثَنَا أَبِي عَنْ صَالِحٍ قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي يَحْيَى بْنُ سَعِيدِ بْنِ الْعَاصِ أَنَّ سَعِيدَ بْنَ الْعَاصِ أَخْبَرَهُ أَنَّ عُثْمَانَ وَعَائِشَةَ حَدَّثَاهُ أَنَّ أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ اسْتَأْذَنَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُضْطَجِعٌ عَلَى فِرَاشِهِ لَابِسٌ مِرْطَ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا فَذَكَرَ مَعْنَى حَدِيثِ عُقَيْلٍ‏.‏",
    "malay_translation": "Hajjaj meriwayatkan daripada Laith, yang meriwayatkan daripada Uqail, daripada Ibnu Syihab, daripada Yahya bin Sa’id bin al-As, bahawa Sa’id bin al-As memberitahunya bahawa Aisyah, isteri Nabi SAW, dan Uthman telah memberitahunya bahawa Abu Bakar RA meminta izin untuk masuk kepada Rasulullah SAW ketika baginda sedang berbaring di atas tilam, memakai kain penutup Aisyah. Maka baginda memberi izin kepada Abu Bakar RA ketika dalam keadaan sedemikian, lalu Abu Bakar RA menyelesaikan keperluan beliau dan kemudian berlalu pergi. Kemudian Umar RA meminta izin untuk masuk, dan baginda memberi izin kepadanya ketika dalam keadaan yang sama.  Umar RA pun menyelesaikan keperluan beliau dan kemudian berlalu pergi. Uthman RA berkata, kemudian aku meminta izin untuk masuk. Baginda pun duduk dan berkata kepada Aisyah RA, “Tutuplah auratmu.” Kemudian baginda menyelesaikan keperluanku, dan aku pun berlalu pergi. Aisyah RA berkata, “Wahai Rasulullah, mengapa saya tidak nampak baginda begitu risau terhadap Abu Bakar dan Umar sepertimana baginda risau terhadap Uthman RA?” Rasulullah SAW menjawab, “Sesungguhnya Uthman adalah seorang yang pemalu, dan aku bimbang sekiranya aku memberi izin kepadanya ketika dalam keadaan begini, dia tidak akan sampaikan keperluannya.” Laith berkata, dan sekelompok manusia berkata, Rasulullah SAW bersabda kepada Aisyah RA, “Bukankah aku patut malu di hadapan seseorang yang malaikat pun malu di hadapannya?”  Ya’qub meriwayatkan daripada bapanya, daripada Shalih, bahawa Ibnu Syihab memberitahunya daripada Yahya bin Sa’id bin al-As, bahawa Sa’id bin al-As telah memberitahunya bahawa Uthman dan Aisyah telah memberitahunya bahawa Abu Bakar RA meminta izin untuk masuk kepada Rasulullah SAW ketika baginda sedang berbaring di atas tilam, memakai kain penutup Aisyah RA. Kemudian dia menyebut maksud hadis Uqail."
  },
  {
    "id": 36647,
    "hadith_number": 484,
    "tajuk_hadith": "Pengampunan Dosa dengan Wuduk dan Solat Fardhu",
    "perawi_melayu": "Daripada Humran, hamba sahaya yang dimerdekakan Uthman, bahawa Uthman bin Affan berkata:",
    "english_text": "I heard the Messenger of Allah (ﷺ) say: `Whoever does wudoo’ and does it properly, then goes to offer an obligatory prayer and offers it, his sins will be forgiven.”",
    "arabic_text": "حَدَّثَنَا يُونُسُ، حَدَّثَنَا لَيْثٌ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عَبْدِ اللَّهِ يَعْنِي ابْنَ أَبِي سَلَمَةَ، وَنَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ مُعَاذِ بْنِ عَبْدِ الرَّحْمَنِ التَّيْمِيِّ، عَنْ حُمْرَانَ، مَوْلَى عُثْمَانَ عَنْ عُثْمَانَ بْنِ عَفَّانَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ تَوَضَّأَ فَأَسْبَغَ الْوُضُوءَ ثُمَّ مَشَى إِلَى صَلَاةٍ مَكْتُوبَةٍ فَصَلَّاهَا غُفِرَ لَهُ ذَنْبُهُ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda: \"Barangsiapa yang berwuduk dengan sempurna, kemudian pergi untuk menunaikan solat fardhu dan menunaikannya, maka nescaya dosa-dosanya akan diampunkan.\""
  },
  {
    "id": 36648,
    "hadith_number": 485,
    "tajuk_hadith": "Larangan Memakai Pakaian Kuning Madu (untuk Ali)",
    "perawi_melayu": "Daripada Abu Hurairah (رضي الله عنه) berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، حَدَّثَنَا عُبَيْدُ اللَّهِ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ بْنِ مَوْهَبٍ، أَخْبَرَنِي عَمِّي، عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنُ مَوْهَبٍ عَنْ أَبِي هُرَيْرَةَ، رَضِيَ اللَّهُ عَنْهُ قَالَ رَاحَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ إِلَى مَكَّةَ حَاجًّا وَدَخَلَتْ عَلَى مُحَمَّدِ بْنِ جَعْفَرِ بْنِ أَبِي طَالِبٍ امْرَأَتُهُ فَبَاتَ مَعَهَا حَتَّى أَصْبَحَ ثُمَّ غَدَا عَلَيْهِ رَدْعُ الطِّيبِ وَمِلْحَفَةٌ مُعَصْفَرَةٌ مُفْدَمَةٌ فَأَدْرَكَ النَّاسَ بِمَلَلٍ قَبْلَ أَنْ يَرُوحُوا فَلَمَّا رَآهُ عُثْمَانُ انْتَهَرَ وَأَفَّفَ وَقَالَ أَتَلْبَسُ الْمُعَصْفَرَ وَقَدْ نَهَى عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُ عَلِيُّ بْنُ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَنْهَهُ وَلَا إِيَّاكَ إِنَّمَا نَهَانِي‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Abdullah bin Az Zubair, telah menceritakan kepada kami Ubaidullah (iaitu Ibnu Abdurrahman bin Mauhab), telah memberitakan kepadaku bapaku, Ubaidullah bin Abdullah bin Mauhab daripada Abu Hurairah r.a. bahawa Usman r.a. pergi ke Mekah untuk menunaikan haji.  Isteri Muhammad bin Ja'far bin Abi Talib masuk menemui suaminya, lalu dia bermalam dengan isterinya. Kemudian pagi harinya, dia keluar dengan memakai minyak wangi dan sehelai kain berwarna kuning tua yang telah dicelup. Dia mengejar orang ramai dalam keadaan letih sebelum mereka berangkat.  Apabila Usman melihatnya, dia menegur dan menyatakan ketidakpuasan hatinya lalu berkata: “Adakah engkau memakai pakaian berwarna kuning tua sedangkan Rasulullah SAW telah melarang perkara itu?” Ali bin Abi Talib r.a. berkata kepadanya: “Rasulullah SAW tidak melarang engkau mahupun dia, baginda hanya melarangku sahaja.”"
  },
  {
    "id": 36649,
    "hadith_number": 486,
    "tajuk_hadith": "Solat Menghapuskan Dosa",
    "perawi_melayu": "Aban bin Utsman berkata:",
    "english_text": "‘Uthman said: I heard the Messenger of Allah (ﷺ) say:  “Do you think if there was a river in the courtyard of one of you and he washed himself in it five times each day, would any dirt remain on him? They said: Nothing [would remain on him). He said: `The (five daily) prayers take away sins as water takes away dirt.`",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي أَبِي وَأَبُو خَيْثَمَةَ قَالَا حَدَّثَنَا يَعْقُوبُ، قَالَ أَبِي فِي حَدِيثِهِ قَالَ أَخْبَرَنَا ابْنُ أَخِي ابْنِ شِهَابٍ، وَقَالَ أَبُو خَيْثَمَةَ، حَدَّثَنِي عَنْ عَمِّهِ، قَالَ أَخْبَرَنِي صَالِحُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي فَرْوَةَ، أَنَّ عَامِرَ بْنَ سَعْدِ بْنِ أَبِي وَقَّاصٍ، أَخْبَرَهُ أَنَّهُ، سَمِعَ أَبَانَ بْنَ عُثْمَانَ، يَقُولُ قَالَ عُثْمَانُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَرَأَيْتَ لَوْ كَانَ بِفِنَاءِ أَحَدِكُمْ نَهَرٌ يَجْرِي يَغْتَسِلُ مِنْهُ كُلَّ يَوْمٍ خَمْسَ مَرَّاتٍ مَا كَانَ يَبْقَى مِنْ دَرَنِهِ قَالُوا لَا شَيْءَ قَالَ إِنَّ الصَّلَوَاتِ تُذْهِبُ الذُّنُوبَ كَمَا يُذْهِبُ الْمَاءُ الدَّرَنَ‏.‏",
    "malay_translation": "Uthman berkata: Saya mendengar Rasulullah SAW bersabda: “Bagaimana pendapat kamu sekiranya di halaman rumah salah seorang daripada kamu terdapat sebuah sungai yang mengalir, lalu dia mandi di dalamnya sebanyak lima kali setiap hari, adakah akan ada sebarang kekotoran yang tinggal padanya? Mereka menjawab: Tiada apa-apa (kekotoran yang tinggal). Baginda bersabda:  `Sesungguhnya solat-solat (lima waktu) itu menghilangkan dosa sebagaimana air menghilangkan kekotoran.`"
  },
  {
    "id": 36650,
    "hadith_number": 487,
    "tajuk_hadith": "Pengkhianatan Terhadap Orang Arab dan Syafaat Nabi",
    "perawi_melayu": "Daripada Usman bin Affan r.a.",
    "english_text": "The Messenger of Allah (ﷺ)  said:   “Whoever betrays the Arabs will never receive my intercession or attain my love.`",
    "arabic_text": "قَالَ أَبُو عَبْد الرَّحْمَنِ وَجَدْتُ فِي كِتَابِ أَبِي حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ الْأَسْوَدِ، عَنْ حُصَيْنِ بْنِ عُمَرَ، عَنْ مُخَارِقِ بْنِ عَبْدِ اللَّهِ بْنِ جَابِرٍ الْأَحْمَسِيِّ، عَنْ طَارِقِ بْنِ شِهَابٍ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ غَشَّ الْعَرَبَ لَمْ يَدْخُلْ فِي شَفَاعَتِي وَلَمْ تَنَلْهُ مَوَدَّتِي‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: “Barangsiapa yang mengkhianati orang-orang Arab, maka dia tidak akan mendapat syafaatku dan tidak akan memperoleh kasih sayangku.”"
  },
  {
    "id": 36651,
    "hadith_number": 488,
    "tajuk_hadith": "Haiwan Tanpa Tanduk Akan Membalas Dendam Pada Hari Kiamat",
    "perawi_melayu": "Daripada Usman bahawa Rasulullah SAW bersabda:",
    "english_text": "`The hornless animal will settle the score with the horned one on the day of Resurrection.`",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي عَبَّاسُ بْنُ مُحَمَّدٍ، وَأَبُو يَحْيَى الْبَزَّازُ قَالَا حَدَّثَنَا حَجَّاجُ بْنُ نُصَيْرٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الْعَوَّامِ بْنِ مُرَاجِمٍ، مِنْ بَنِي قَيْسِ بْنِ ثَعْلَبَةَ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ عُثْمَانَ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْجَمَّاءَ لَتُقَصُّ مِنْ الْقَرْنَاءِ يَوْمَ الْقِيَامَةِ‏.‏",
    "malay_translation": "Daripada Abdullah, telah menceritakan kepadaku Abbas bin Muhammad, dan Abu Yahya al-Bazzar berkata: Telah menceritakan kepada kami Hajjaj bin Nusir, telah menceritakan kepada kami Syu’bah, daripada al-Awwam bin Murajim daripada Bani Qais bin Tsa’labah, daripada Abu Usman an-Nahdi, daripada Usman, bahawa Rasulullah SAW telah bersabda:  Sesungguhnya haiwan yang tidak bertanduk pasti akan membalas dendam terhadap haiwan yang bertanduk pada hari kiamat."
  },
  {
    "id": 36652,
    "hadith_number": 489,
    "tajuk_hadith": "Larangan Uthman terhadap Anjing dan Burung Merpati",
    "perawi_melayu": "Al-Hasan meriwayatkan:",
    "english_text": "I saw `Uthman enjoining, in his khutbah, the killing of dogs and the slaughter of pigeons.",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا شَيْبَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُبَارَكُ بْنُ فَضَالَةَ، حَدَّثَنَا الْحَسَنُ، قَالَ شَهِدْتُ عُثْمَانَ يَأْمُرُ فِي خُطْبَتِهِ بِقَتْلِ الْكِلَابِ وَذَبْحِ الْحَمَامِ‏.‏",
    "malay_translation": "Aku menyaksikan Uthman memerintahkan dalam khutbahnya untuk membunuh anjing dan menyembelih burung merpati."
  },
  {
    "id": 36653,
    "hadith_number": 490,
    "tajuk_hadith": "Ketampanan Uthman bin Affan",
    "perawi_melayu": "Daripada riwayat Ummu Musa yang menyatakan:",
    "english_text": "`Uthman was the most handsome of people.",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مُغِيرَةَ، عَنْ أُمِّ مُوسَى، قَالَتْ كَانَ عُثْمَانُ مِنْ أَجْمَلِ النَّاسِ‏.‏",
    "malay_translation": "Ummu Musa berkata:  Uthman bin Affan adalah antara orang yang paling tampan."
  },
  {
    "id": 36654,
    "hadith_number": 491,
    "tajuk_hadith": "Orang yang Melintas di Depan Orang yang Sedang Solat",
    "perawi_melayu": "Ibrahim bin Saad meriwayatkan:",
    "english_text": "My father narrated that his father said:  I was praying and a man passed in front of me; I tried to stop him but he insisted. I asked `Uthman bin `Affan (about that) and he said. It does not affect you, O son of my brother.",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنِي أَبِي، عَنْ أَبِيهِ، قَالَ كُنْتُ أُصَلِّي فَمَرَّ رَجُلٌ بَيْنَ يَدَيَّ فَمَنَعْتُهُ فَأَبَى فَسَأَلْتُ عُثْمَانَ بْنَ عَفَّانَ فَقَالَ لَا يَضُرُّكَ يَا ابْنَ أَخِي‏.‏",
    "malay_translation": "Bapak saya meriwayatkan bahawa bapanya berkata:  Aku sedang solat, lalu seorang lelaki lalu di hadapanku. Aku cuba menghalangnya tetapi dia tetap meneruskan. Aku bertanya kepada Uthman bin Affan (mengenainya) dan dia berkata, \"Ia tidak memudaratkanmu, wahai anak saudaraku.\""
  },
  {
    "id": 36655,
    "hadith_number": 492,
    "tajuk_hadith": "Ketaatan kepada Kitab Allah",
    "perawi_melayu": "Ibrahim bin Saad meriwayatkan:",
    "english_text": "My father narrated; that his father said: Uthman said: If you find in the Book of Allah, may He be glorified and exalted, that you should put my feet in fetters, then do that.",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا سُوَيْدٌ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنِي أَبِي، عَنْ أَبِيهِ، قَالَ قَالَ عُثْمَانُ إِنْ وَجَدْتُمْ فِي كِتَابِ اللَّهِ عَزَّ وَجَلَّ أَنْ تَضَعُوا رِجْلِي فِي الْقَيْدِ فَضَعُوهَا‏.‏",
    "malay_translation": "Bapaku meriwayatkan; bahawa bapanya berkata: Uthman berkata: Jika kamu dapati di dalam Kitab Allah, Maha Suci dan Maha Agung Dia, bahawa kamu hendaklah meletakkan kakiku di dalam belenggu, maka lakukanlah."
  },
  {
    "id": 36656,
    "hadith_number": 493,
    "tajuk_hadith": "Tempat Wukuf di Arafah dan Muzdalifah",
    "perawi_melayu": "Daripada ‘Ubaidullah bin Abi Rafi’, hamba sahaya Rasulullah ﷺ, daripada Ali bin Abi Talib رضي الله عنه bahawa Rasulullah ﷺ telah wukuf di Arafah dengan Usamah bin Zaid menunggang di belakang baginda, dan baginda bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الْبَصْرِيُّ، حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ الْمَخْزُومِيُّ، حَدَّثَنِي أَبِي عَبْدُ الرَّحْمَنِ بْنُ الْحَارِثِ، عَنْ زَيْدِ بْنِ عَلِيِّ بْنِ حُسَيْنٍ، عَنْ أَبِيهِ، عَلِيِّ بْنِ حُسَيْنٍ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ، مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَفَ بِعَرَفَةَ وَهُوَ مُرْدِفٌ أُسَامَةَ بْنَ زَيْدٍ فَقَالَ هَذَا الْمَوْقِفُ وَكُلُّ عَرَفَةَ مَوْقِفٌ ثُمَّ دَفَعَ يَسِيرُ الْعَنَقَ وَجَعَلَ النَّاسُ يَضْرِبُونَ يَمِينًا وَشِمَالًا وَهُوَ يَلْتَفِتُ وَيَقُولُ السَّكِينَةَ أَيُّهَا النَّاسُ السَّكِينَةَ أَيُّهَا النَّاسُ حَتَّى جَاءَ الْمُزْدَلِفَةَ وَجَمَعَ بَيْنَ الصَّلَاتَيْنِ ثُمَّ وَقَفَ بِالْمُزْدَلِفَةِ فَوَقَفَ عَلَى قُزَحَ وَأَرْدَفَ الْفَضْلَ بْنَ الْعَبَّاسِ وَقَالَ هَذَا الْمَوْقِفُ وَكُلُّ مُزْدَلِفَةَ مَوْقِفٌ ثُمَّ دَفَعَ وَجَعَلَ يَسِيرُ الْعَنَقَ وَالنَّاسُ يَضْرِبُونَ يَمِينًا وَشِمَالًا وَهُوَ يَلْتَفِتُ وَيَقُولُ السَّكِينَةَ أَيُّهَا النَّاسُ السَّكِينَةَ وَذَكَرَ الْحَدِيثَ بِطُولِهِ‏.‏",
    "malay_translation": "Baginda berdiri di Arafah, sedang Usamah bin Zaid di belakang baginda. Baginda bersabda: \"Inilah tempat wukuf, dan seluruh Arafah adalah tempat wukuf.\" Kemudian baginda bergerak perlahan-lahan, dan orang ramai mula berselerak ke kanan dan ke kiri. Baginda berpaling kepada mereka dan bersabda: \"Tenang wahai sekalian manusia, tenang wahai sekalian manusia.\"  Sehingga sampai ke Muzdalifah, lalu baginda menggabungkan dua solat. Kemudian baginda wukuf di Muzdalifah, di tempat yang dinamakan Quzah, dengan al-Fadl bin al-Abbas di belakang baginda. Baginda bersabda: \"Inilah tempat wukuf, dan seluruh Muzdalifah adalah tempat wukuf.\" Kemudian baginda bergerak perlahan-lahan, dan orang ramai mula berselerak ke kanan dan ke kiri. Baginda berpaling kepada mereka dan bersabda: \"Tenang wahai sekalian manusia, tenang wahai sekalian manusia.\"  Hadis ini disebut secara panjang lebar."
  },
  {
    "id": 36657,
    "hadith_number": 494,
    "tajuk_hadith": "Mimpi Bertemu Rasulullah SAW dan Sahabat",
    "perawi_melayu": "Daripada Muslim Abu Sa’id, hamba yang dimerdekakan oleh Uthman bin Affan (رضي الله عنه) bahawa Uthman bin Affan telah membebaskan dua puluh orang hamba, dan memanggil seluar lalu memakainya; beliau tidak pernah memakainya sebelum ini, sama ada pada zaman Jahiliyyah mahupun Islam. Dan beliau berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يُونُسُ بْنُ أَبِي الْيَعْفُورِ الْعَبْدِيُّ، عَنْ أَبِيهِ، عَنْ مُسْلِمٍ أَبِي سَعِيدٍ، مَوْلَى عُثْمَانَ بْنِ عَفَّانَ أَنَّ عُثْمَانَ بْنَ عَفَّانَ، أَعْتَقَ عِشْرِينَ مَمْلُوكًا وَدَعَا بِسَرَاوِيلَ فَشَدَّهَا عَلَيْهِ وَلَمْ يَلْبَسْهَا فِي جَاهِلِيَّةٍ وَلَا إِسْلَامٍ وَقَالَ إِنِّي رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَارِحَةَ فِي الْمَنَامِ وَرَأَيْتُ أَبَا بَكْرٍ وَعُمَرَ رَضِيَ اللَّهُ عَنْهُمَا وَإِنَّهُمْ قَالُوا لِي اصْبِرْ فَإِنَّكَ تُفْطِرُ عِنْدَنَا الْقَابِلَةَ ثُمَّ دَعَا بِمُصْحَفٍ فَنَشَرَهُ بَيْنَ يَدَيْهِ فَقُتِلَ وَهُوَ بَيْنَ يَدَيْهِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah, telah menceritakan kepada kami Usman bin Abi Syaibah, telah menceritakan kepada kami Yunus bin Abi al-Ya’fur al-‘Abdi, daripada bapanya, daripada Muslim Abi Sa’id, hamba Uthman bin Affan bahawa Uthman bin Affan telah membebaskan dua puluh orang hamba dan memanggil seluar lalu memakainya.  Beliau tidak pernah memakainya sebelum ini, sama ada pada zaman Jahiliyyah mahupun Islam.  Dan beliau berkata, “Sesungguhnya aku telah melihat Rasulullah SAW (ﷺ) malam tadi di dalam mimpi, dan aku telah melihat Abu Bakar dan Umar (رضي الله عنهما), dan mereka berkata kepadaku, “Bersabarlah, kerana engkau akan berbuka puasa bersama kami esok.” Kemudian beliau memanggil mushaf lalu membukanya di hadapannya, maka beliau dibunuh ketika mushaf itu berada di hadapannya."
  },
  {
    "id": 36658,
    "hadith_number": 495,
    "tajuk_hadith": "Cara Wuduk Rasulullah SAW",
    "perawi_melayu": "Daripada Usman r.a.",
    "english_text": "I saw the Messenger of Allah (ﷺ) do wudoo’: he washed his face three times and his hands three times, and he washed his arms three times each, and wiped his head, and washed his feet thoroughly.",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، وَأَبُو الرَّبِيعِ الزَّهْرَانِيُّ، قَالَا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنِ الْحَجَّاجِ، عَنْ عَطَاءٍ، عَنْ عُثْمَانَ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ فَغَسَلَ وَجْهَهُ ثَلَاثًا وَيَدَيْهِ ثَلَاثًا وَغَسَلَ ذِرَاعَيْهِ ثَلَاثًا ثَلَاثًا وَمَسَحَ بِرَأْسِهِ وَغَسَلَ رِجْلَيْهِ غَسْلًا‏.‏",
    "malay_translation": "Aku melihat Rasulullah SAW berwuduk. Baginda membasuh muka tiga kali, tangan tiga kali, lengan tiga kali setiap satu, mengusap kepala dan membasuh kaki dengan bersih."
  },
  {
    "id": 36659,
    "hadith_number": 496,
    "tajuk_hadith": "Perlindungan daripada Bala dengan Zikir",
    "perawi_melayu": "Daripada Aban bin Utsman, daripada Utsman, bahawa Nabi SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي مُحَمَّدُ بْنُ إِسْحَاقَ الْمُسَيَّبِيُّ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ أَبِي مَوْدُودٍ، عَنْ مُحَمَّدِ بْنِ كَعْبٍ، عَنْ أَبَانَ بْنِ عُثْمَانَ، عَنْ عُثْمَانَ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَالَ بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ ثَلَاثَ مَرَّاتٍ لَمْ تَفْجَأْهُ فَاجِئَةُ بَلَاءٍ حَتَّى اللَّيْلِ وَمَنْ قَالَهَا حِينَ يُمْسِي لَمْ تَفْجَأْهُ فَاجِئَةُ بَلَاءٍ حَتَّى يُصْبِحَ إِنْ شَاءَ اللَّهُ‏.‏",
    "malay_translation": "Daripada Abdullah, telah menceritakan kepadaku Muhammad bin Ishaq al-Musayyabi, telah menceritakan kepada kami Anas bin Iyadh, daripada Abu Maudud, daripada Muhammad bin Ka'ab, daripada Aban bin Utsman, daripada Utsman, bahawa Nabi SAW bersabda:  \"Barangsiapa yang membaca, 'Bismillahilladzi la yadhurru ma'a ismihi syai-un fil ardhi wa la fis sama-i wa huwa assami'ul 'alim' (Dengan nama Allah yang dengan nama-Nya tiada sesuatu pun di bumi mahupun di langit yang boleh membahayakan, dan Dia Maha Mendengar lagi Maha Mengetahui) sebanyak tiga kali, maka dia tidak akan ditimpa musibah secara tiba-tiba sehingga malam. Dan barangsiapa yang membacanya ketika hendak tidur, maka dia tidak akan ditimpa musibah secara tiba-tiba sehingga pagi, jika Allah SWT menghendaki.\""
  },
  {
    "id": 36660,
    "hadith_number": 497,
    "tajuk_hadith": "Menghormati Jenazah dengan Berdiri",
    "perawi_melayu": "Aban bin Uthman melalui beberapa perawi",
    "english_text": "It was narrated from Aban bin `Uthman that  He saw a funeral coming. When he saw it he stood up and said. I saw `Uthman doing that and he told me that he saw the Prophet (ﷺ) doing that.",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى، حَدَّثَنَا سَعِيدُ بْنُ مَسْلَمَةَ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، عَنْ مُوسَى بْنِ عِمْرَانَ بْنِ مَنَّاحٍ، عَنْ أَبَانَ بْنِ عُثْمَانَ، أَنَّهُ رَأَى جَنَازَةً مُقْبِلَةً فَلَمَّا رَآهَا قَامَ فَقَالَ رَأَيْتُ عُثْمَانَ يَفْعَلُ ذَلِكَ وَخَبَّرَنِي أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُهُ‏.‏",
    "malay_translation": "Daripada Aban bin Uthman, melalui beberapa perawi, bahawa beliau melihat sebuah jenazah datang.  Apabila beliau melihatnya, beliau berdiri lalu berkata, \"Aku melihat Uthman melakukan demikian, dan beliau memberitahu aku bahawa beliau melihat Nabi ﷺ melakukan perkara yang sama.\""
  },
  {
    "id": 36661,
    "hadith_number": 498,
    "tajuk_hadith": "Tidur Lewat Pagi Menahan Rezeki",
    "perawi_melayu": "Daripada Amr bin Uthman bin Affan (رضي الله عنه) bahawa bapanya berkata:",
    "english_text": "The Messenger of Allah (ﷺ) said: “Sleeping early in the day leads to withholding of provision.”",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا أَبُو إِبْرَاهِيمَ التَّرْجُمَانِيُّ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، عَنِ ابْنِ أَبِي فَرْوَةَ، عَنْ مُحَمَّدِ بْنِ يُوسُفَ، عَنْ عَمْرِو بْنِ عُثْمَانَ بْنِ عَفَّانَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصُّبْحَةُ تَمْنَعُ الرِّزْقَ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: “Tidur lewat pagi menyebabkan rezeki ditahan.”"
  },
  {
    "id": 36662,
    "hadith_number": 499,
    "tajuk_hadith": "Pengkebumian Uthman bin Affan",
    "perawi_melayu": "Daripada Ibnu Abdillah Ibnu Farrukh, bahawa bapanya berkata:",
    "english_text": "I saw `Uthman bin `Affan (رضي الله عنه) buried in his clothes soaked with his blood. he was not washed.",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ، حَدَّثَنَا مَحْبُوبُ بْنُ مُحْرِزٍ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ فَرُّوخَ، عَنْ أَبِيهِ، قَالَ شَهِدْتُ عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ دُفِنَ فِي ثِيَابِهِ بِدِمَائِهِ وَلَمْ يُغَسَّلْ‏.‏",
    "malay_translation": "Aku menyaksikan Uthman bin Affan (رضي الله عنه) dikebumikan dengan pakaiannya yang berlumuran darah, dan baginda tidak dimandikan."
  },
  {
    "id": 36663,
    "hadith_number": 500,
    "tajuk_hadith": "Naungan Allah pada Hari Kiamat",
    "perawi_melayu": "Dari Mihjan, hamba sahaya Usman, bahawa Usman berkata:",
    "english_text": "I heard the Messenger of Allah (ﷺ) say: “Allah will shade with His shade on the Day when there is no shade but His a person who gave more time to a debtor who was in difficulty or waived a debt for one who had a lot of debts.`",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي أَبُو يَحْيَى الْبَزَّازُ، مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ حَدَّثَنَا الْحَسَنُ بْنُ بِشْرِ بْنِ سَلْمٍ الْكُوفِيُّ، حَدَّثَنَا الْعَبَّاسُ بْنُ الْفَضْلِ الْأَنْصَارِيُّ، عَنْ هِشَامِ بْنِ زِيَادٍ الْقُرَشِيِّ، عَنْ أَبِيهِ، عَنْ مِحْجَنٍ، مَوْلَى عُثْمَانَ عَنْ عُثْمَانَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَظَلَّ اللَّهُ عَبْدًا فِي ظِلِّهِ يَوْمَ لَا ظِلَّ إِلَّا ظِلُّهُ أَنْظَرَ مُعْسِرًا أَوْ تَرَكَ لِغَارِمٍ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda:  \"Allah akan menaungi hambaNya di bawah naungan-Nya pada hari di mana tiada naungan melainkan naungan-Nya, iaitu orang yang memberi tempoh kepada orang yang susah atau melepaskan hutang orang yang banyak hutangnya.\""
  },
  {
    "id": 36664,
    "hadith_number": 501,
    "tajuk_hadith": "Tidur Lewat Pagi Menghalangi Rezeki",
    "perawi_melayu": "Daripada Amr bin Utsman bin Affan (رضي الله عنه) bahawa bapanya berkata:",
    "english_text": "The Messenger of Allah (ﷺ) said: “Sleeping early in the morning leads to withholding of provision.”",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي يَحْيَى بْنُ عُثْمَانَ يَعْنِي الْحَرْبِيَّ أَبُو زَكَرِيَّا، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، عَنْ رَجُلٍ، قَدْ سَمَّاهُ عَنْ مُحَمَّدِ بْنِ يُوسُفَ، عَنْ عَمْرِو بْنِ عُثْمَانَ بْنِ عَفَّانَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصُّبْحَةُ تَمْنَعُ الرِّزْقَ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  “Tidur lewat pagi menghalang rezeki.”"
  },
  {
    "id": 36665,
    "hadith_number": 502,
    "tajuk_hadith": "Larangan Menikah Semasa Ihram",
    "perawi_melayu": "Daripada Aban bin Utsman, daripada bapanya, bahawa Nabi ﷺ bersabda:",
    "english_text": "“The pilgrim in ihram should not get married, arrange a marriage or propose marriage.`",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ مَالِكٍ، حَدَّثَنِي نَافِعٌ، عَنْ نُبَيْهِ بْنِ وَهْبٍ، عَنْ أَبَانَ بْنِ عُثْمَانَ، عَنْ أَبِيهِ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُحْرِمُ لَا يَنْكِحُ وَلَا يُنْكِحُ وَلَا يَخْطُبُ‏.‏",
    "malay_translation": "Orang yang sedang ihram tidak boleh berkahwin, menikahkan orang lain, atau meminang."
  },
  {
    "id": 36666,
    "hadith_number": 503,
    "tajuk_hadith": "Perkahwinan Orang Yang Berihram",
    "perawi_melayu": "Daripada Nafi’; Nubaih bin Wahb memberitahu saya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، حَدَّثَنِي نُبَيْهُ بْنُ وَهْبٍ، قَالَ بَعَثَنِي عُمَرُ بْنُ عُبَيْدِ اللَّهِ بْنِ مَعْمَرٍ وَكَانَ يَخْطُبُ بِنْتَ شَيْبَةَ بْنِ عُثْمَانَ عَلَى ابْنِهِ فَأَرْسَلَ إِلَى أَبَانَ بْنِ عُثْمَانَ وَهُوَ عَلَى الْمَوْسِمِ فَقَالَ أَلَا أُرَاهُ أَعْرَابِيًّا إِنَّ الْمُحْرِمَ لَا يَنْكِحُ وَلَا يُنْكِحُ أَخْبَرَنِي بِذَلِكَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ و حَدَّثَنِي نُبَيْهٌ عَنْ أَبِيهِ بِنَحْوِهِ‏.‏",
    "malay_translation": "Abdullah telah meriwayatkan kepada kami, Muhammad bin Abi Bakar al-Muqaddami telah meriwayatkan kepadaku, Hammad bin Zaid telah meriwayatkan kepada kami, daripada Ayyub, daripada Nafi’, Nubaih bin Wahb telah memberitahu saya, katanya: Umar bin Ubaidillah bin Ma’mar telah menghantar saya. Ketika itu dia sedang meminang anak perempuan Syaibah bin Uthman untuk anaknya.  Maka dia menghantar (utusan) kepada Aban bin Uthman yang ketika itu berada di musim haji. Lalu (utusan) itu berkata: “Aku fikir dia seorang Badwi. Sesungguhnya orang yang berihram tidak boleh berkahwin dan tidak boleh menikahkan.” Uthman (رضي الله عنه) telah memberitahu saya demikian daripada Nabi ﷺ, dan Nubaih telah memberitahu saya perkara yang hampir sama daripada bapanya."
  },
  {
    "id": 36667,
    "hadith_number": 504,
    "tajuk_hadith": "Mimpi Uthman bin Affan Sebelum Kematiannya",
    "perawi_melayu": "Daripada Na`ilah binti al-Farafisah, isteri Uthman bin Affan (رضي الله عنه) berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرٍ، حَدَّثَنَا زُهَيْرُ بْنُ إِسْحَاقَ، حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ، عَنْ زِيَادِ بْنِ عَبْدِ اللَّهِ، عَنْ أُمِّ هِلَالٍ ابْنَةِ وَكِيعٍ، عَنْ نَائِلَةَ بِنْتِ الْفَرَافِصَةِ، امْرَأَةِ عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ قَالَتْ نَعَسَ أَمِيرُ الْمُؤْمِنِينَ عُثْمَانُ فَأَغْفَى فَاسْتَيْقَظَ فَقَالَ لَيَقْتُلَنَّنِي الْقَوْمُ قُلْتُ كَلَّا إِنْ شَاءَ اللَّهُ لَمْ يَبْلُغْ ذَاكَ إِنَّ رَعِيَّتَكَ اسْتَعْتَبُوكَ قَالَ إِنِّي رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَنَامِي وَأَبُو بَكْرٍ وَعُمَرُ رَضِيَ اللَّهُ عَنْهُمَا فَقَالُوا تُفْطِرُ عِنْدَنَا اللَّيْلَةَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah, telah menceritakan kepadaku Muhammad bin Abi Bakar, telah menceritakan kepada kami Zuhair bin Ishaq, telah menceritakan kepada kami Dawud bin Abi Hind, dari Ziyad bin Abdullah, dari Ummu Hilal binti Waki`, dari Nailah binti al-Farafisah, isteri Uthman bin Affan (رضي الله عنه), dia berkata: Amirul Mukminin Uthman merasa mengantuk lalu tidur sebentar. Setelah terjaga, dia berkata: “Sesungguhnya kaum akan membunuhku.” Aku berkata: “Tidak, jika Allah menghendaki, hal itu tidak akan terjadi. Sesungguhnya rakyatmu hanya akan meminta pertanggungjawaban kepadamu.” Dia berkata: “Sesungguhnya aku telah melihat Rasulullah ﷺ dalam mimpiku, dan Abu Bakar serta Umar (رضي الله عنهما), lalu mereka berkata: ‘Engkau akan berbuka puasa bersama kami malam ini.’”"
  },
  {
    "id": 36668,
    "hadith_number": 505,
    "tajuk_hadith": "Ketampanan Uthman bin Affan",
    "perawi_melayu": "Telah diriwayatkan bahawa al-Hasan bin Abil-Hasan berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي زِيَادُ بْنُ أَيُّوبَ، حَدَّثَنَا هُشَيْمٌ، قَالَ زَعَمَ أَبُو الْمِقْدَامِ عَنِ الْحَسَنِ بْنِ أَبِي الْحَسَنِ، قَالَ دَخَلْتُ الْمَسْجِدَ فَإِذَا أَنَا بِعُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ مُتَّكِئٌ عَلَى رِدَائِهِ فَأَتَاهُ سَقَّاءَانِ يَخْتَصِمَانِ إِلَيْهِ فَقَضَى بَيْنَهُمَا ثُمَّ أَتَيْتُهُ فَنَظَرْتُ إِلَيْهِ فَإِذَا رَجُلٌ حَسَنُ الْوَجْهِ بِوَجْنَتِهِ نَكَتَاتُ جُدَرِيٍّ وَإِذَا شَعْرُهُ قَدْ كَسَا ذِرَاعَيْهِ‏.‏",
    "malay_translation": "Aku masuk ke masjid, lalu aku melihat Uthman bin Affan (رضي الله عنه) bersandar pada kainnya. Dua orang penyedia air datang kepadanya dan mereka bertengkar di hadapannya. Maka dia menghakimi di antara mereka berdua. Kemudian aku menghampirinya dan memandangnya; dia seorang lelaki yang tampan dengan kesan cacar pada mukanya dan lengannya dipenuhi dengan rambut."
  },
  {
    "id": 36669,
    "hadith_number": 506,
    "tajuk_hadith": "Uthman Tidak Pernah Mewarnai Rambutnya",
    "perawi_melayu": "Umm Ghurab meriwayatkan bahawa Bunanah berkata:",
    "english_text": "’Uthman never dyed his hair.",
    "arabic_text": "حَدَّثَنَا وَكِيعٌ، حَدَّثَتْنِي أُمُّ غُرَابٍ، عَنْ بُنَانَةَ، قَالَتْ مَا خَضَبَ عُثْمَانُ قَطُّ‏.‏",
    "malay_translation": "Umm Ghurab meriwayatkan daripada Bunanah yang berkata: Usman tidak pernah mewarnakan rambutnya."
  },
  {
    "id": 36670,
    "hadith_number": 507,
    "tajuk_hadith": "Uthman bin Affan dan Gigi Emas",
    "perawi_melayu": "Wakid bin Abdullah At-Tameemi meriwayatkan daripada seseorang yang melihat Uthman bin Affan (رضي الله عنه) dengan giginya yang dilapisi emas.",
    "english_text": "Waqid bin ‘Abdullah At-Tameemi narrated from someone Who saw ‘Uthman bin ‘Affan (رضي الله عنه) with his teeth covered with gold.",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا أَبُو الْقَاسِمِ بْنُ أَبِي الزِّنَادِ، حَدَّثَنِي وَاقِدُ بْنُ عَبْدِ اللَّهِ التَّمِيمِيُّ، عَنْ مَنْ، رَأَى عُثْمَانَ بْنَ عَفَّانَ ضَبَّبَ أَسْنَانَهُ بِذَهَبٍ‏.‏",
    "malay_translation": "Wakid bin Abdullah At-Tameemi meriwayatkan daripada seseorang yang melihat Uthman bin Affan (رضي الله عنه) dengan giginya dilapisi emas."
  },
  {
    "id": 36671,
    "hadith_number": 508,
    "tajuk_hadith": "Uthman bin Affan Menanyakan Kabar Umat",
    "perawi_melayu": "Ia diriwayatkan bahawa Musa bin Talhah berkata:",
    "english_text": "I Heard ‘Uthman bin ‘Affan (رضي الله عنه) when he was on the minbar and the mu’adhdhin was giving the iqamah (call immediately preceding the prayer), asking the people about their news and business.",
    "arabic_text": "حَدَّثَنَا هُشَيْمُ بْنُ بُشَيْرٍ، إِمْلَاءً قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ قَيْسٍ الْأَسَدِيُّ، عَنْ مُوسَى بْنِ طَلْحَةَ، قَالَ سَمِعْتُ عُثْمَانَ بْنَ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ وَهُوَ عَلَى الْمِنْبَرِ وَالْمُؤَذِّنُ يُقِيمُ الصَّلَاةَ وَهُوَ يَسْتَخْبِرُ النَّاسَ يَسْأَلُهُمْ عَنْ أَخْبَارِهِمْ وَأَسْعَارِهِمْ‏.‏",
    "malay_translation": "Aku mendengar Usman bin Affan (رضي الله عنه) ketika baginda berada di atas mimbar dan muazin sedang memberi iqamah (seruan sebelum solat), bertanya khabar dan urusan kepada masyarakat."
  },
  {
    "id": 36672,
    "hadith_number": 509,
    "tajuk_hadith": "Uthman (رضي الله عنه) Sujud dalam Surah Sad",
    "perawi_melayu": "Daripada as-Sa’ib bin Yazid",
    "english_text": "It was narrated from as-Sa’ib bin Yazeed that ’Uthman (رضي الله عنه) Prostrated in Soorat Sad",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنِ السَّائِبِ بْنِ يَزِيدَ، أَنَّ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ سَجَدَ فِي ص‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah, telah menceritakan kepadaku Suwaid bin Sa'id, telah menceritakan kepada kami Ibrahim bin Saad, daripada Ibnu Syihab, daripada as-Sa’ib bin Yazid, bahawa Uthman (رضي الله عنه) bersujud dalam surah Sad."
  },
  {
    "id": 36673,
    "hadith_number": 510,
    "tajuk_hadith": "Solat Hari Raya Aidilfitri di Sebalik Usman",
    "perawi_melayu": "Daripada Ibnu Farrukh daripada bapanya.",
    "english_text": "I offered the Eid prayer behind `Uthman (رضي الله عنه) and he said the takbeer seven times and five times (i.e., in the first and second rak’ahs, respectively).",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ، حَدَّثَنَا مَحْبُوبُ بْنُ مُحْرِزٍ، بَيَّاعُ الْقَوَارِيرِ كُوفِيٌّ ثِقَةٌ كَذَا قَالَ سُرَيْجٌ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ يَعْنِي ابْنَ فَرُّوخَ عَنْ أَبِيهِ قَالَ صَلَّيْتُ خَلْفَ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ الْعِيدَ فَكَبَّرَ سَبْعًا وَخَمْسًا‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah, telah menceritakan kepadaku Surayj bin Yunus, telah menceritakan kepada kami Mahbub bin Muhriz, penjual kaca dari Kufah yang dipercayai – demikian kata Surayj daripada Ibrahim bin Abdullah iaitu Ibnu Farrukh daripada bapanya – katanya: Aku menunaikan solat hari raya di belakang Usman (رضي الله عنه), maka beliau melafazkan takbir sebanyak tujuh kali dan lima kali (iaitu pada rakaat pertama dan kedua)."
  },
  {
    "id": 36674,
    "hadith_number": 511,
    "tajuk_hadith": "Kesopanan Uthman bin Affan",
    "perawi_melayu": "Al-Hasan menyebut tentang kesopanan yang keterlaluan Uthman dan berkata:",
    "english_text": "If he was in a room with the door closed, and he took off his garment to pour water on himself, shyness prevented him from standing up straight.",
    "arabic_text": "حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا سَالِمٌ أَبُو جُمَيْعٍ، حَدَّثَنَا الْحَسَنُ، وَذَكَرَ، عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ وَشِدَّةَ حَيَائِهِ فَقَالَ إِنْ كَانَ لَيَكُونُ فِي الْبَيْتِ وَالْبَابُ عَلَيْهِ مُغْلَقٌ فَمَا يَضَعُ عَنْهُ الثَّوْبَ لِيُفِيضَ عَلَيْهِ الْمَاءَ يَمْنَعُهُ الْحَيَاءُ أَنْ يُقِيمَ صُلْبَهُ‏.‏",
    "malay_translation": "Al-Hasan meriwayatkan bahawa Usman r.a. mempunyai rasa malu yang sangat tinggi. Baginda berkata: \"Sekiranya Usman berada di dalam bilik yang pintunya tertutup, dan beliau menanggalkan pakaiannya untuk menyiram air ke atas badannya, rasa malunya menghalangnya daripada berdiri tegak.\""
  },
  {
    "id": 36675,
    "hadith_number": 512,
    "tajuk_hadith": "Tempoh Khilafah Uthman dan Tempoh Fitnah",
    "perawi_melayu": "Umayyah bin Shibl dan lain-lain berkata:",
    "english_text": "`Uthman held the position of caliph for twelve years and the turmoil lasted for five years.",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ خَالِدٍ الصَّنْعَانِيُّ، حَدَّثَنِي أُمَيَّةُ بْنُ شِبْلٍ، وَغَيْرُهُ، قَالُوا وَلِيَ عُثْمَانُ ثِنْتَيْ عَشْرَةَ وَكَانَتْ الْفِتْنَةُ خَمْسَ سِنِينَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ibrahim bin Khalid As-San’ani, telah menceritakan kepadaku Umayyah bin Syibl dan lain-lain, mereka berkata: Uthman telah menjadi khalifah selama dua belas tahun dan tempoh fitnah itu adalah selama lima tahun."
  },
  {
    "id": 36676,
    "hadith_number": 513,
    "tajuk_hadith": "Kemangkatan Uthman bin Affan",
    "perawi_melayu": "Daripada Abu Ma'shar, beliau berkata:",
    "english_text": "`Uthman (رضي الله عنه) was killed on the eighteenth of Dhul-Hijjah 35 AH, His caliphate lasted twelve years less twelve days.",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى بْنِ الطَّبَّاعِ، عَنْ أَبِي مَعْشَرٍ، قَالَ وَقُتِلَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ يَوْمَ الْجُمُعَةِ لِثَمَانِ عَشْرَةَ مَضَتْ مِنْ ذِي الْحِجَّةِ سَنَةَ خَمْسٍ وَثَلَاثِينَ وَكَانَتْ خِلَافَتُهُ ثِنْتَيْ عَشْرَةَ سَنَةً إِلَّا اثْنَيْ عَشَرَ يَوْمًا‏.‏",
    "malay_translation": "Diriwayatkan daripada Abu Ma'shar yang berkata:  Uthman (رضي الله عنه) telah dibunuh pada hari Jumaat, tanggal lapan belas bulan Zulhijjah, tahun 35 Hijrah. Tempoh pemerintahannya sebagai Khalifah adalah selama dua belas tahun kurang dua belas hari."
  },
  {
    "id": 36677,
    "hadith_number": 514,
    "tajuk_hadith": "Pembunuhan Uthman bin Affan",
    "perawi_melayu": "Abu Uthman",
    "english_text": "Abu `Uthman narrated that ’Uthman (رضي الله عنه) was killed in the middle of the days of al-tashreeq.",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ قَالَ أَبِي حَدَّثَنَا أَبُو عُثْمَانَ، أَنَّ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ قُتِلَ فِي أَوْسَطِ أَيَّامِ التَّشْرِيقِ‏.‏",
    "malay_translation": "Abu Uthman meriwayatkan bahawa Uthman (رضي الله عنه) telah dibunuh pada pertengahan hari-hari tasyriq."
  },
  {
    "id": 36678,
    "hadith_number": 515,
    "tajuk_hadith": "Kematian Uthman bin Affan",
    "perawi_melayu": "Qatadah",
    "english_text": "Qatadah narrated that `Uthman (رضي الله عنه) was killed when he was ninety years old or eighty-eight years old.",
    "arabic_text": "حَدَّثَنَا حَسَنُ بْنُ مُوسَى، حَدَّثَنَا أَبُو هِلَالٍ، حَدَّثَنَا قَتَادَةُ، أَنَّ عُثْمَانَ، قُتِلَ وَهُوَ ابْنُ تِسْعِينَ سَنَةً أَوْ ثَمَانٍ وَثَمَانِينَ‏.‏",
    "malay_translation": "Qatadah meriwayatkan bahawa Uthman (رضي الله عنه) dibunuh ketika berusia sembilan puluh tahun atau lapan puluh lapan tahun."
  },
  {
    "id": 36679,
    "hadith_number": 516,
    "tajuk_hadith": "Mengawal Pintu Rumah Uthman bin Affan",
    "perawi_melayu": "Daripada Abu al-'Aliyah ra.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي جَعْفَرُ بْنُ مُحَمَّدِ بْنِ فُضَيْلٍ، حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا أَبُو خَلْدَةَ، عَنْ أَبِي الْعَالِيَةِ، قَالَ كُنَّا بِبَابِ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ فِي عَشْرِ الْأَضْحَى‏.‏",
    "malay_translation": "Abu al-'Aliyah berkata:  Kami menjaga pintu rumah Uthman bin Affan (رضي الله عنه) pada sepuluh hari raya korban."
  },
  {
    "id": 36680,
    "hadith_number": 517,
    "tajuk_hadith": "Zubair Menunaikan Solat Jenazah Usman",
    "perawi_melayu": "Daripada riwayat Qatadah:",
    "english_text": "Az-Zubair offered the funeral prayer for `Uthman (رضي الله عنه) and buried him in accordance with his instructions.",
    "arabic_text": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ قَتَادَةَ، قَالَ صَلَّى الزُّبَيْرُ عَلَى عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ وَدَفَنَهُ وَكَانَ أَوْصَى إِلَيْهِ‏.‏",
    "malay_translation": "Daripada riwayat Qatadah: Zubair telah menunaikan solat jenazah untuk Usman (رضي الله عنه) dan mengebumikannya mengikut wasiat Usman."
  },
  {
    "id": 36681,
    "hadith_number": 518,
    "tajuk_hadith": "Pembunuhan Uthman dan Tempoh Fitnah",
    "perawi_melayu": "Daripada Abdullah bin Muhammad bin Aqil, katanya:",
    "english_text": "`Uthman (رضي الله عنه) was killed in 35 AH and the fitnah (turmoil) lasted for\nfive years including four months of al-Hasan`s rule.",
    "arabic_text": "حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَمْرٍو، عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، قَالَ قُتِلَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ سَنَةَ خَمْسٍ وَثَلَاثِينَ فَكَانَتْ الْفِتْنَةُ خَمْسَ سِنِينَ مِنْهَا أَرْبَعَةُ أَشْهُرٍ لِلْحَسَنِ رَضِيَ اللَّهُ عَنْهُ‏.‏",
    "malay_translation": "Diriwayatkan daripada Abdullah bin Muhammad bin Aqil, katanya: Uthman (رضي الله عنه) dibunuh pada tahun 35 Hijrah, dan fitnah (kekacauan) itu berlanjutan selama lima tahun, termasuk empat bulan pemerintahan al-Hasan (رضي الله عنه)."
  },
  {
    "id": 36682,
    "hadith_number": 519,
    "tajuk_hadith": "Mengawal Pintu Rumah Uthman ibn Affan",
    "perawi_melayu": "Daripada Abu al-'Aliyah, Baginda berkata:",
    "english_text": "We were guarding the door of `Uthman (رضي الله عنه) for the first ten days of .",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا أَبُو خَلْدَةَ، عَنْ أَبِي الْعَالِيَةِ، قَالَ كُنَّا بِبَابِ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ فِي عَشْرِ الْأَضْحَى‏.‏",
    "malay_translation": "Abu al-'Aliyah berkata: \"Kami menjaga pintu rumah Uthman ibn Affan (رضي الله عنه) selama sepuluh hari pertama Aidiladha.\""
  },
  {
    "id": 36683,
    "hadith_number": 520,
    "tajuk_hadith": "Kisah Uthman dan Talhah di Hari Pengepungan",
    "perawi_melayu": "Daripada Zaid bin Aslam, daripada bapanya yang berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنِي الْقَاسِمُ بْنُ الْحَكَمِ بْنِ أَوْسٍ الْأَنْصَارِيُّ، حَدَّثَنِي أَبُو عُبَادَةَ الزُّرَقِيُّ الْأَنْصَارِيُّ، مِنْ أَهْلِ الْمَدِينَةِ عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، قَالَ شَهِدْتُ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ يَوْمَ حُوصِرَ فِي مَوْضِعِ الْجَنَائِزِ وَلَوْ أُلْقِيَ حَجَرٌ لَمْ يَقَعْ إِلَّا عَلَى رَأْسِ رَجُلٍ فَرَأَيْتُ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ أَشْرَفَ مِنْ الْخَوْخَةِ الَّتِي تَلِي مَقَامَ جِبْرِيلَ عَلَيْهِ السَّلَام فَقَالَ أَيُّهَا النَّاسُ أَفِيكُمْ طَلْحَةُ فَسَكَتُوا ثُمَّ قَالَ أَيُّهَا النَّاسُ أَفِيكُمْ طَلْحَةُ فَسَكَتُوا ثُمَّ قَالَ يَا أَيُّهَا النَّاسُ أَفِيكُمْ طَلْحَةُ فَقَامَ طَلْحَةُ بْنُ عُبَيْدِ اللَّهِ فَقَالَ لَهُ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ أَلَا أَرَاكَ هَاهُنَا مَا كُنْتُ أَرَى أَنَّكَ تَكُونُ فِي جَمَاعَةٍ تَسْمَعُ نِدَائِي آخِرَ ثَلَاثِ مَرَّاتٍ ثُمَّ لَا تُجِيبُنِي أَنْشُدُكَ اللَّهَ يَا طَلْحَةُ تَذْكُرُ يَوْمَ كُنْتُ أَنَا وَأَنْتَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَوْضِعِ كَذَا وَكَذَا لَيْسَ مَعَهُ أَحَدٌ مِنْ أَصْحَابِهِ غَيْرِي وَغَيْرُكَ قَالَ نَعَمْ فَقَالَ لَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا طَلْحَةُ إِنَّهُ لَيْسَ مِنْ نَبِيٍّ إِلَّا وَمَعَهُ مِنْ أَصْحَابِهِ رَفِيقٌ مِنْ أُمَّتِهِ مَعَهُ فِي الْجَنَّةِ وَإِنَّ عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ هَذَا يَعْنِينِي رَفِيقِي مَعِي فِي الْجَنَّةِ قَالَ طَلْحَةُ اللَّهُمَّ نَعَمْ ثُمَّ انْصَرَفَ‏.‏",
    "malay_translation": "Aku menyaksikan Uthman (رضي الله عنه) pada hari beliau dikepung di tempat pengebumian; sekiranya sebiji batu dilambung, nescaya ia akan mengenai kepala seseorang.  Aku melihat Uthman (رضي الله عنه) menengok dari tingkap di sebelah tempat Jibril (عليه السلام) pernah berdiri, lalu beliau berkata: Wahai orang ramai, adakah Talhah di kalangan kamu? Mereka diam. Kemudian beliau berkata: Wahai orang ramai, adakah Talhah di kalangan kamu? Mereka diam. Kemudian beliau berkata: Wahai orang ramai, adakah Talhah di kalangan kamu? Maka Talhah bin Ubaidillah berdiri, lalu Uthman (رضي الله عنه) berkata kepadanya: Adakah engkau di sini? Aku tidak menyangka engkau berada dalam kumpulan yang mendengar seruan aku sebanyak tiga kali, tetapi tidak menjawab. Aku bersumpah demi Allah, wahai Talhah, adakah engkau mengingati hari di mana engkau dan aku bersama Rasulullah (ﷺ) di tempat begini dan begitu, dan tiada seorang pun daripada sahabat baginda bersama baginda melainkan aku dan engkau? Talhah menjawab: Ya. Kemudian Talhah pergi."
  },
  {
    "id": 36684,
    "hadith_number": 521,
    "tajuk_hadith": "Wuduk Usman bin Affan dan Hadis Nabi SAW",
    "perawi_melayu": "Humran bin Aban",
    "english_text": "It was narrated from Humran bin Aban that He saw `Uthman (رضي الله عنه) do wudoo` one day; he rinsed his mouth and his nose, and he washed his face three times... and he narrated a hadeeth from the Prophet (ﷺ) similar to the hadeeth of Ibn Ja`far from Sa’eed.",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي الْعَبَّاسُ بْنُ الْوَلِيدِ النَّرْسِيُّ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، حَدَّثَنَا قَتَادَةُ، عَنْ مُسْلِمِ بْنِ يَسَارٍ، عَنْ حُمْرَانَ بْنِ أَبَانَ، أَنَّهُ شَهِدَ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ تَوَضَّأَ يَوْمًا فَمَضْمَضَ وَاسْتَنْشَقَ وَغَسَلَ وَجْهَهُ ثَلَاثًا وَحَدَّثَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ حَدِيثِ ابْنِ جَعْفَرٍ عَنْ سَعِيدٍ‏.‏",
    "malay_translation": "Daripada Humran bin Aban, bahawa beliau menyaksikan Usman bin Affan (رضي الله عنه) melakukan wuduk pada suatu hari. Beliau berkumur dan membersihkan hidungnya, serta membasuh mukanya sebanyak tiga kali... dan beliau meriwayatkan sebuah hadis daripada Nabi SAW yang hampir sama dengan hadis daripada Ibnu Ja'far melalui Sa'eed."
  },
  {
    "id": 36685,
    "hadith_number": 522,
    "tajuk_hadith": "Cara Wuduk Rasulullah SAW",
    "perawi_melayu": "Daripada seorang Ansar yang menceritakan daripada bapanya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي وَهْبُ بْنُ بَقِيَّةَ الْوَاسِطِيُّ، أَنْبَأَنَا خَالِدٌ يَعْنِي ابْنَ عَبْدِ اللَّهِ، عَنِ الْجُرَيْرِيِّ، عَنْ عُرْوَةَ بْنِ قَبِيصَةَ، عَنْ رَجُلٍ، مِنْ الْأَنْصَارِ عَنْ أَبِيهِ، قَالَ كُنْتُ قَائِمًا عِنْدَ عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ فَقَالَ أَلَا أُنَبِّئُكُمْ كَيْفَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَوَضَّأُ قُلْنَا بَلَى فَدَعَا بِمَاءٍ فَغَسَلَ وَجْهَهُ ثَلَاثًا وَمَضْمَضَ وَاسْتَنْشَقَ ثَلَاثًا ثُمَّ غَسَلَ يَدَيْهِ إِلَى مِرْفَقَيْهِ ثَلَاثًا ثُمَّ مَسَحَ بِرَأْسِهِ وَأُذُنَيْهِ وَغَسَلَ رِجْلَيْهِ ثَلَاثًا ثُمَّ قَالَ هَكَذَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَوَضَّأُ‏.‏",
    "malay_translation": "Kami diberitakan oleh Abdullah, yang diberitakan kepadaku oleh Wahb bin Baqiyyah Al-Wasithi, yang memberitakan kepada kami Khalid (iaitu Khalid bin Abdullah), daripada Al-Jurairi, daripada Urwah bin Qabishah, daripada seorang lelaki daripada kalangan Ansar daripada bapanya, yang berkata: Aku berdiri di sisi Uthman bin Affan r.a. Maka beliau berkata: “Patutkah aku beritahu kamu bagaimana cara Rasulullah SAW berwuduk?” Kami berkata: “Ya”. Maka beliau memanggil air, kemudian membasuh mukanya tiga kali, berkumur dan membersihkan hidungnya tiga kali, kemudian membasuh kedua tangannya sehingga ke siku tiga kali, kemudian menyapu kepalanya dan kedua telinganya, dan membasuh kedua kakinya tiga kali. Kemudian beliau berkata: “Beginilah cara Rasulullah SAW berwuduk.”"
  },
  {
    "id": 36686,
    "hadith_number": 523,
    "tajuk_hadith": "Kisah Usman bin Affan dan Sumbangannya kepada Umat Islam",
    "perawi_melayu": "Daripada Thumamah bin Hazn al-Qushairi, baginda berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرِ بْنِ عَلِيٍّ الْمُقَدَّمِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ، حَدَّثَنَا هِلَالُ بْنُ حِقٍّ، عَنِ الْجُرَيْرِيِّ، عَنْ ثُمَامَةَ بْنِ حَزْنٍ الْقُشَيْرِيِّ، قَالَ شَهِدْتُ الدَّارَ يَوْمَ أُصِيبَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ فَاطَّلَعَ عَلَيْهِمْ اطِّلَاعَةً فَقَالَ ادْعُوا لِي صَاحِبَيْكُمْ اللَّذَيْنِ أَلَّبَاكُمْ عَلَيَّ فَدُعِيَا لَهُ فَقَالَ نَشَدْتُكُمَا اللَّهَ أَتَعْلَمَانِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا قَدِمَ الْمَدِينَةَ ضَاقَ الْمَسْجِدُ بِأَهْلِهِ فَقَالَ مَنْ يَشْتَرِي هَذِهِ الْبُقْعَةَ مِنْ خَالِصِ مَالِهِ فَيَكُونَ فِيهَا كَالْمُسْلِمِينَ وَلَهُ خَيْرٌ مِنْهَا فِي الْجَنَّةِ فَاشْتَرَيْتُهَا مِنْ خَالِصِ مَالِي فَجَعَلْتُهَا بَيْنَ الْمُسْلِمِينَ وَأَنْتُمْ تَمْنَعُونِي أَنْ أُصَلِّيَ فِيهِ رَكْعَتَيْنِ ثُمَّ قَالَ أَنْشُدُكُمْ اللَّهَ أَتَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا قَدِمَ الْمَدِينَةَ لَمْ يَكُنْ فِيهَا بِئْرٌ يُسْتَعْذَبُ مِنْهُ إِلَّا رُومَةَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ يَشْتَرِيهَا مِنْ خَالِصِ مَالِهِ فَيَكُونَ دَلْوُهُ فِيهَا كَدُلِيِّ الْمُسْلِمِينَ وَلَهُ خَيْرٌ مِنْهَا فِي الْجَنَّةِ فَاشْتَرَيْتُهَا مِنْ خَالِصِ مَالِي فَأَنْتُمْ تَمْنَعُونِي أَنْ أَشْرَبَ مِنْهَا ثُمَّ قَالَ هَلْ تَعْلَمُونَ أَنِّي صَاحِبُ جَيْشِ الْعُسْرَةِ قَالُوا اللَّهُمَّ نَعَمْ‏.‏",
    "malay_translation": "Aku menyaksikan kejadian di rumah Usman pada hari beliau dibunuh. Beliau memandang mereka dan berkata: “Panggilkan kedua orang sahabat kamu yang menghasut kamu menentangku.” Maka mereka dipanggil. Kemudian beliau berkata: “Aku bersumpah demi Allah, adakah kamu tahu bahawa ketika Rasulullah ﷺ tiba di Madinah, masjid itu sempit untuk penduduknya, lalu baginda bersabda: ‘Siapakah yang sanggup membeli sebidang tanah ini dengan hartanya sendiri dan menggunakannya seperti orang Islam yang lain (iaitu, mendermakan kepada umat Islam dan berkongsi dengan mereka), nescaya dia akan mendapat pahala yang lebih baik daripadanya di syurga?’  Maka aku membelinya dengan hartaku sendiri dan kuserahkan kepada umat Islam, tetapi sekarang kamu menghalang aku daripada menunaikan solat dua rakaat di situ!” Kemudian beliau berkata: “Aku bersumpah demi Allah, adakah kamu tahu bahawa ketika Rasulullah ﷺ tiba di Madinah, tidak ada perigi yang airnya sedap diminum kecuali perigi Ruumah. Rasulullah ﷺ bersabda: ‘Siapakah yang sanggup membelinya dengan hartanya sendiri dan baldi airnya akan sama seperti baldi orang Islam yang lain (iaitu, mendermakan perigi itu kepada umat Islam dan berkongsi dengan mereka), nescaya dia akan mendapat pahala yang lebih baik daripadanya di syurga?’ Maka aku membelinya dengan hartaku sendiri, tetapi sekarang kamu menghalang aku daripada meminum airnya.” Kemudian beliau berkata: “Adakah kamu tahu bahawa akulah yang melengkapi pasukan dalam keadaan susah (iaitu, pasukan yang pergi ke peperangan Tabuk)?” Mereka menjawab: “Demi Allah, ya.”"
  },
  {
    "id": 36687,
    "hadith_number": 524,
    "tajuk_hadith": "Abd al-Rahman bin Auf dan Amir al-Mukminin Uthman",
    "perawi_melayu": "Daripada Shaqeeq berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي أَبِي وَأَبُو خَيْثَمَةَ قَالَا حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، حَدَّثَنَا زَائِدَةُ، عَنْ عَاصِمٍ، عَنْ شَقِيقٍ، قَالَ لَقِيَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ الْوَلِيدَ بْنَ عُقْبَةَ فَقَالَ لَهُ الْوَلِيدُ مَا لِي أَرَاكَ قَدْ جَفَوْتَ أَمِيرَ الْمُؤْمِنِينَ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ قَالَ عَبْدُ الرَّحْمَنِ أَبْلِغْهُ فَذَكَرَ الْحَدِيثَ وَأَمَّا قَوْلُهُ إِنِّي تَخَلَّفْتُ يَوْمَ بَدْرٍ فَإِنِّي كُنْتُ أُمَرِّضُ رُقَيَّةَ بِنْتَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى مَاتَتْ وَقَدْ ضَرَبَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَهْمٍ وَمَنْ ضَرَبَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَهْمٍ فَقَدْ شَهِدَ فَذَكَرَ الْحَدِيثَ بِطُولِهِ إِلَى آخِرِهِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah, telah menceritakan kepadaku ayahku dan Abu Khaitsamah, keduanya berkata; telah menceritakan kepada kami Muawiyah bin Amr, telah menceritakan kepada kami Zaidah, daripada Asim, daripada Shaqeeq, dia berkata: Abdur Rahman bin Auf telah bertemu dengan Al-Walid bin Uqbah, lalu Al-Walid berkata kepadanya: “Mengapa aku melihat engkau telah menjauhi Amirul Mukminin Uthman رضي الله عنه?” Abdur Rahman berkata: “Sampaikanlah kepadanya (Uthman),” lalu dia menceritakan hadis tersebut.  Dan berkenaan dengan perkataannya, “Sesungguhnya aku telah ketinggalan pada hari Badar,” maka sesungguhnya aku ketika itu sedang menjaga Ruqayyah binti Rasulullah ﷺ sehingga dia meninggal dunia. Dan Rasulullah ﷺ telah memberi bahagian (ghanim) kepadaku. Dan sesiapa yang telah diberi bahagian oleh Rasulullah ﷺ, maka sesungguhnya dia telah hadir (perang).  Lalu dia menyebutkan hadis tersebut secara panjang lebar sehingga kesudahannya."
  },
  {
    "id": 36688,
    "hadith_number": 525,
    "tajuk_hadith": "Bai'ah Abdur Rahman bin Auf kepada Utsman",
    "perawi_melayu": "Daripada Abu Wa'il, diriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي سُفْيَانُ بْنُ وَكِيعٍ، حَدَّثَنِي قَبِيصَةُ، عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ، عَنْ عَاصِمٍ، عَنْ أَبِي وَائِلٍ، قَالَ قُلْتُ لِعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ كَيْفَ بَايَعْتُمْ عُثْمَانَ وَتَرَكْتُمْ عَلِيًّا رَضِيَ اللَّهُ عَنْهُ قَالَ مَا ذَنْبِي قَدْ بَدَأْتُ بِعَلِيٍّ فَقُلْتُ أُبَايِعُكَ عَلَى كِتَابِ اللَّهِ وَسُنَّةِ رَسُولِهِ وَسِيرَةِ أَبِي بَكْرٍ وَعُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ فَقَالَ فِيمَا اسْتَطَعْتُ قَالَ ثُمَّ عَرَضْتُهَا عَلَى عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ فَقَبِلَهَا‏.‏",
    "malay_translation": "Aku bertanya kepada Abdur Rahman bin Auf: \"Bagaimana kamu memberi bai'ah kepada Utsman dan meninggalkan Ali (رضي الله عنه)?\"  Jawabnya: \"Bukan salahku. Aku mulakan dengan Ali dan berkata: \"Aku memberi bai'ah kepadamu berdasarkan Kitabullah, Sunnah Rasul-Nya, dan cara hidup Abu Bakar dan Umar (رضي الله عنهما).\"  Lalu Ali berkata: \"Semampu yang aku mampu.\" Kemudian aku menawarkan bai'ah itu kepada Utsman (رضي الله عنه) dan dia menerimanya."
  },
  {
    "id": 36689,
    "hadith_number": 526,
    "tajuk_hadith": "Keutamaan Berjaga di Perbatasan",
    "perawi_melayu": "Daripada Abu Salih, hamba dibebaskan Usman bin Affan رضي الله عنه, berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا لَيْثٌ، حَدَّثَنَا زُهْرَةُ بْنُ مَعْبَدٍ الْقُرَشِيُّ، عَنْ أَبِي صَالِحٍ، مَوْلَى عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ قَالَ سَمِعْتُ عُثْمَانَ يَقُولُ عَلَى الْمِنْبَرِ أَيُّهَا النَّاسُ إِنِّي كَتَمْتُكُمْ حَدِيثًا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَرَاهِيَةَ تَفَرُّقِكُمْ عَنِّي ثُمَّ بَدَا لِي أَنْ أُحَدِّثَكُمُوهُ لِيَخْتَارَ امْرُؤٌ لِنَفْسِهِ مَا بَدَا لَهُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ رِبَاطُ يَوْمٍ فِي سَبِيلِ اللَّهِ خَيْرٌ مِنْ أَلْفِ يَوْمٍ فِيمَا سِوَاهُ مِنْ الْمَنَازِلِ\nحَدَّثَنَا أَبُو سَعِيدٍ مَوْلَى بَنِي هَاشِمٍ حَدَّثَنَا عِكْرِمَةُ بْنُ إِبْرَاهِيمَ بَاهِلِيٌّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أَبِي ذُبَابٍ وَذَكَرَهُ‏.‏",
    "malay_translation": "Kami telah diberitakan oleh Hashim bin Al-Qasim, yang telah diberitakan kepadanya oleh Laith, yang telah diberitakan kepadanya oleh Zuhrah bin Ma'bad Al-Qurasyi, daripada Abu Salih, hamba dibebaskan Usman رضي الله عنه, bahawa dia berkata: Aku mendengar Usman berkata di atas mimbar: Wahai sekalian manusia, sesungguhnya aku telah merahsiakan daripada kamu sebuah hadis yang aku telah dengar daripada Rasulullah ﷺ kerana aku bimbang kamu akan berpecah daripada ku. Kemudian aku merasakan bahawa aku patut menceritakannya kepada kamu, supaya setiap orang memilih untuk dirinya apa yang baik baginya. Aku mendengar Rasulullah ﷺ bersabda: \"Berjaga di perbatasan selama satu hari di jalan Allah adalah lebih baik daripada seribu hari melakukan amal yang lain.\" \n\nKami telah diberitakan oleh Abu Said, hamba dibebaskan Bani Hashim, yang telah diberitakan kepadanya oleh ‘Ikrimah bin Ibrahim, Bahili, yang telah diberitakan kepadanya oleh Abdullah bin Abdur-Rahman bin Abi Dhubab dan dia menyebutkannya."
  },
  {
    "id": 36690,
    "hadith_number": 527,
    "tajuk_hadith": "Kejujuran dalam Perniagaan",
    "perawi_melayu": "Sa'id bin al-Musayyab berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو سَعِيدٍ، حَدَّثَنَا ابْنُ لَهِيعَةَ، أَخْبَرَنَا مُوسَى بْنُ وَرْدَانَ، قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ سَمِعْتُ عُثْمَانَ، يَخْطُبُ عَلَى الْمِنْبَرِ وَهُوَ يَقُولُ كُنْتُ أَبْتَاعُ التَّمْرَ مِنْ بَطْنٍ مِنْ الْيَهُودِ يُقَالُ لَهُمْ بَنُو قَيْنُقَاعٍ فَأَبِيعُهُ بِرِبْحِ الْآصُعِ فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا عُثْمَانُ إِذَا اشْتَرَيْتَ فَاكْتَلْ وَإِذَا بِعْتَ فَكِلْ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Said, telah menceritakan kepada kami Ibnu Lahi'ah, telah memberitakan kepada kami Musa bin Wardan, katanya: Aku mendengar Sa'id bin al-Musayyab berkata: Aku mendengar Uthman (رضي الله عنه) menyampaikan khutbah di atas mimbar, sambil berkata: Aku selalu membeli tamar daripada satu kabilah Yahudi yang dikenali sebagai Bani Qainuqa', kemudian menjualnya dengan mengambil keuntungan. Perkara itu sampai kepada Rasulullah ﷺ, lalu baginda bersabda: Wahai Uthman, apabila engkau membeli, maka cukupkan timbanganmu, dan apabila engkau menjual, cukupkan sukatanmu."
  },
  {
    "id": 36691,
    "hadith_number": 528,
    "tajuk_hadith": "Keimanan dan Kesetiaan Usman bin Affan kepada Rasulullah SAW",
    "perawi_melayu": "Ubaidullah bin 'Adiyy bin al-Khiyar meriwayatkan bahawa Usman (رضي الله عنه) berkata kepadanya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا بِشْرُ بْنُ شُعَيْبِ بْنِ أَبِي حَمْزَةَ، حَدَّثَنِي أَبِي، عَنِ الزُّهْرِيِّ، حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَدِيِّ بْنِ الْخِيَارِ، أَخْبَرَهُ أَنَّ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ قَالَ لَهُ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ إِنَّ اللَّهَ قَدْ بَعَثَ مُحَمَّدًا عَلَيْهِ الصَّلَاة وَالسَّلَامُ بِالْحَقِّ فَكُنْتُ مِمَّنْ اسْتَجَابَ لِلَّهِ وَلِرَسُولِهِ وَآمَنَ بِمَا بَعَثَ بِهِ مُحَمَّدًا عَلَيْهِ الصَّلَاة وَالسَّلَامُ ثُمَّ هَاجَرْتُ الْهِجْرَتَيْنِ وَنِلْتُ صِهْرَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبَايَعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَاللَّهِ مَا عَصَيْتُهُ وَلَا غَشَشْتُهُ حَتَّى تَوَفَّاهُ اللَّهُ عَزَّ وَجَلَّ‏.‏",
    "malay_translation": "Sesungguhnya Allah SWT telah mengutus Muhammad ﷺ dengan kebenaran. Maka aku adalah antara mereka yang telah menyambut seruan Allah dan Rasul-Nya, dan aku beriman kepada apa yang telah diutuskan oleh Muhammad ﷺ. Kemudian aku berhijrah sebanyak dua kali, dan aku juga mendapat penghormatan menjadi menantu Rasulullah ﷺ. Aku telah menyatakan bai’ah kepada Rasulullah ﷺ, dan demi Allah, aku tidak pernah menderhakai atau mengkhianatinya sehingga Allah SWT menjemput rohnya."
  }
]
