[
  {
    "id": 36164,
    "hadith_number": 1,
    "tajuk_hadith": "Tanggungjawab Menangani Kemungkaran",
    "perawi_melayu": "Daripada Qais",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، قَالَ أَخْبَرَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ أَبِي خَالِدٍ، عَنْ قَيْسٍ، قَالَ قَامَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ يَا أَيُّهَا النَّاسُ إِنَّكُمْ تَقْرَءُونَ هَذِهِ الْآيَةَ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا عَلَيْكُمْ أَنْفُسَكُمْ لَا يَضُرُّكُمْ مَنْ ضَلَّ إِذَا اهْتَدَيْتُمْ‏}‏ وَإِنَّا سَمِعْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ النَّاسَ إِذَا رَأَوْا الْمُنْكَرَ فَلَمْ يُنْكِرُوهُ أَوْشَكَ أَنْ يَعُمَّهُمْ اللَّهُ بِعِقَابِهِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Numair, katanya; telah mengkhabar kami Ismail (yakni Ibnu Abi Khalid), daripada Qais, katanya; Abu Bakar r.a. bangun lalu memuji dan mensyukuri Allah, kemudian berkata: Wahai sekalian manusia, sesungguhnya kamu membaca ayat ini: {Wahai orang-orang yang beriman! Jagalah diri kamu; jika kamu mengikuti petunjuk (dan menyeru kepada kebaikan (tauhid Islam dan semua yang diperintahkan Islam) serta melarang daripada kejahatan (syirik, kufur dan segala yang dilarang Islam), nescaya tidaklah akan menimpa kamu bahaya daripada orang-orang yang sesat.} Dan sesungguhnya kami telah mendengar Rasulullah SAW bersabda: Sekiranya manusia melihat kemungkaran (kejahatan) tetapi tidak mencegahnya, maka Allah akan segera menimpakan azabNya kepada mereka semua."
  },
  {
    "id": 36165,
    "hadith_number": 2,
    "tajuk_hadith": "Pengampunan Allah SWT Selepas Bertaubat dan Solat",
    "perawi_melayu": "Daripada Ali r.a.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا وَكِيعٌ، قَالَ حَدَّثَنَا مِسْعَرٌ، وَسُفْيَانُ، عَنْ عُثْمَانَ بْنِ الْمُغِيرَةِ الثَّقَفِيِّ، عَنْ عَلِيِّ بْنِ رَبِيعَةَ الْوَالِبِيِّ، عَنْ أَسْمَاءَ بْنِ الْحَكَمِ الْفَزَارِيِّ، عَنْ عَلِيٍّ، رَضِيَ اللَّهُ عَنْهُ قَالَ كُنْتُ إِذَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثًا نَفَعَنِي اللَّهُ بِمَا شَاءَ مِنْهُ وَإِذَا حَدَّثَنِي عَنْهُ غَيْرِي اسْتَحْلَفْتُهُ فَإِذَا حَلَفَ لِي صَدَّقْتُهُ وَإِنَّ أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ حَدَّثَنِي وَصَدَقَ أَبُو بَكْرٍ أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا مِنْ رَجُلٍ يُذْنِبُ ذَنْبًا فَيَتَوَضَّأُ فَيُحْسِنُ الْوُضُوءَ قَالَ مِسْعَرٌ وَيُصَلِّي وَقَالَ سُفْيَانُ ثُمَّ يُصَلِّي رَكْعَتَيْنِ فَيَسْتَغْفِرُ اللَّهَ عَزَّ وَجَلَّ إِلَّا غَفَرَ لَهُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Waki', dia berkata; telah menceritakan kepada kami Mis'ar dan Sufyan daripada Usman bin Mughirah Ats-Tsaqafi, daripada Ali bin Rabiah Al-Walibi, daripada Asma' bin Al-Hakam Al-Fazari, daripada Ali r.a., dia berkata: \"Aku, jika mendengar hadis daripada Rasulullah SAW, Allah SWT memberi manfaat kepadaku sebagaimana yang dikehendaki-Nya. Dan jika orang lain menceritakan kepadaku hadis tersebut, aku akan meminta dia bersumpah, dan jika dia bersumpah, aku akan mempercayainya.  Sesungguhnya Abu Bakar r.a. telah menceritakan kepadaku – dan Abu Bakar r.a. adalah orang yang benar – bahawa dia mendengar Nabi SAW bersabda: “Tidak ada seorang lelaki pun yang melakukan dosa, kemudian dia berwuduk dan menyempurnakan wuduknya,” kata Mis'ar: “dan solat,” kata Sufyan: “kemudian dia solat dua rakaat, lalu memohon keampunan kepada Allah SWT, melainkan Allah SWT akan mengampuninya.”"
  },
  {
    "id": 36166,
    "hadith_number": 3,
    "tajuk_hadith": "Perjalanan Hijrah Nabi SAW dan Abu Bakar",
    "perawi_melayu": "Daripada al-Bara' bin 'Azib:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ أَبُو سَعِيدٍ يَعْنِي الْعَنْقَزِيَّ، قَالَ حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ اشْتَرَى أَبُو بَكْرٍ مِنْ عَازِبٍ سَرْجًا بِثَلَاثَةَ عَشَرَ دِرْهَمًا قَالَ فَقَالَ أَبُو بَكْرٍ لِعَازِبٍ مُرْ الْبَرَاءَ فَلْيَحْمِلْهُ إِلَى مَنْزِلِي فَقَالَ لَا حَتَّى تُحَدِّثَنَا كَيْفَ صَنَعْتَ حِينَ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنْتَ مَعَهُ قَالَ فَقَالَ أَبُو بَكْرٍ خَرَجْنَا فَأَدْلَجْنَا فَأَحْثَثْنَا يَوْمَنَا وَلَيْلَتَنَا حَتَّى أَظْهَرْنَا وَقَامَ قَائِمُ الظَّهِيرَةِ فَضَرَبْتُ بِبَصَرِي هَلْ أَرَى ظِلًّا نَأْوِي إِلَيْهِ فَإِذَا أَنَا بِصَخْرَةٍ فَأَهْوَيْتُ إِلَيْهَا فَإِذَا بَقِيَّةُ ظِلِّهَا فَسَوَّيْتُهُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفَرَشْتُ لَهُ فَرْوَةً وَقُلْتُ اضْطَجِعْ يَا رَسُولَ اللَّهِ فَاضْطَجَعَ ثُمَّ خَرَجْتُ أَنْظُرُ هَلْ أَرَى أَحَدًا مِنْ الطَّلَبِ فَإِذَا أَنَا بِرَاعِي غَنَمٍ فَقُلْتُ لِمَنْ أَنْتَ يَا غُلَامُ فَقَالَ لِرَجُلٍ مِنْ قُرَيْشٍ فَسَمَّاهُ فَعَرَفْتُهُ فَقُلْتُ هَلْ فِي غَنَمِكَ مِنْ لَبَنٍ قَالَ نَعَمْ قَالَ قُلْتُ هَلْ أَنْتَ حَالِبٌ لِي قَالَ نَعَمْ قَالَ فَأَمَرْتُهُ فَاعْتَقَلَ شَاةً مِنْهَا ثُمَّ أَمَرْتُهُ فَنَفَضَ ضَرْعَهَا مِنْ الْغُبَارِ ثُمَّ أَمَرْتُهُ فَنَفَضَ كَفَّيْهِ مِنْ الْغُبَارِ وَمَعِي إِدَاوَةٌ عَلَى فَمِهَا خِرْقَةٌ فَحَلَبَ لِي كُثْبَةً مِنْ اللَّبَنِ فَصَبَبْتُ يَعْنِي الْمَاءَ عَلَى الْقَدَحِ حَتَّى بَرَدَ أَسْفَلُهُ ثُمَّ أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَافَيْتُهُ وَقَدْ اسْتَيْقَظَ فَقُلْتُ اشْرَبْ يَا رَسُولَ اللَّهِ فَشَرِبَ حَتَّى رَضِيتُ ثُمَّ قُلْتُ هَلْ أَنَى الرَّحِيلُ قَالَ فَارْتَحَلْنَا وَالْقَوْمُ يَطْلُبُونَا فَلَمْ يُدْرِكْنَا أَحَدٌ مِنْهُمْ إِلَّا سُرَاقَةُ بْنُ مَالِكِ بْنِ جُعْشُمٍ عَلَى فَرَسٍ لَهُ فَقُلْتُ يَا رَسُولَ اللَّهِ هَذَا الطَّلَبُ قَدْ لَحِقَنَا فَقَالَ ‏{‏لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا‏}‏ حَتَّى إِذَا دَنَا مِنَّا فَكَانَ بَيْنَنَا وَبَيْنَهُ قَدْرُ رُمْحٍ أَوْ رُمْحَيْنِ أَوْ ثَلَاثَةٍ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ هَذَا الطَّلَبُ قَدْ لَحِقَنَا وَبَكَيْتُ قَالَ لِمَ تَبْكِي قَالَ قُلْتُ أَمَا وَاللَّهِ مَا عَلَى نَفْسِي أَبْكِي وَلَكِنْ أَبْكِي عَلَيْكَ قَالَ فَدَعَا عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ اللَّهُمَّ اكْفِنَاهُ بِمَا شِئْتَ فَسَاخَتْ قَوَائِمُ فَرَسِهِ إِلَى بَطْنِهَا فِي أَرْضٍ صَلْدٍ وَوَثَبَ عَنْهَا وَقَالَ يَا مُحَمَّدُ قَدْ عَلِمْتُ أَنَّ هَذَا عَمَلُكَ فَادْعُ اللَّهَ أَنْ يُنْجِيَنِي مِمَّا أَنَا فِيهِ فَوَاللَّهِ لَأُعَمِّيَنَّ عَلَى مَنْ وَرَائِي مِنْ الطَّلَبِ وَهَذِهِ كِنَانَتِي فَخُذْ مِنْهَا سَهْمًا فَإِنَّكَ سَتَمُرُّ بِإِبِلِي وَغَنَمِي فِي مَوْضِعِ كَذَا وَكَذَا فَخُذْ مِنْهَا حَاجَتَكَ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا حَاجَةَ لِي فِيهَا قَالَ وَدَعَا لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأُطْلِقَ فَرَجَعَ إِلَى أَصْحَابِهِ وَمَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا مَعَهُ حَتَّى قَدِمْنَا الْمَدِينَةَ فَتَلَقَّاهُ النَّاسُ فَخَرَجُوا فِي الطَّرِيقِ وَعَلَى الْأَجَاجِيرِ فَاشْتَدَّ الْخَدَمُ وَالصِّبْيَانُ فِي الطَّرِيقِ يَقُولُونَ اللَّهُ أَكْبَرُ جَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَاءَ مُحَمَّدٌ قَالَ وَتَنَازَعَ الْقَوْمُ أَيُّهُمْ يَنْزِلُ عَلَيْهِ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْزِلُ اللَّيْلَةَ عَلَى بَنِي النَّجَّارِ أَخْوَالِ عَبْدِ الْمُطَّلِبِ لِأُكْرِمَهُمْ بِذَلِكَ فَلَمَّا أَصْبَحَ غَدَا حَيْثُ أُمِرَ قَالَ الْبَرَاءُ بْنُ عَازِبٍ أَوَّلُ مَنْ كَانَ قَدِمَ عَلَيْنَا مِنْ الْمُهَاجِرِينَ مُصْعَبُ بْنُ عُمَيْرٍ أَخُو بَنِي عَبْدِ الدَّارِ ثُمَّ قَدِمَ عَلَيْنَا ابْنُ أُمِّ مَكْتُومٍ الْأَعْمَى أَخُو بَنِي فِهْرٍ ثُمَّ قَدِمَ عَلَيْنَا عُمَرُ بْنُ الْخَطَّابِ فِي عِشْرِينَ رَاكِبًا فَقُلْنَا مَا فَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ هُوَ عَلَى أَثَرِي ثُمَّ قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرٍ مَعَهُ قَالَ الْبَرَاءُ وَلَمْ يَقْدَمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى حَفِظْتُ سُوَرًا مِنْ الْمُفَصَّلِ قَالَ إِسْرَائِيلُ وَكَانَ الْبَرَاءُ مِنْ الْأَنْصَارِ مِنْ بَنِي حَارِثَةَ‏.‏",
    "malay_translation": "Abu Bakar membeli pelana daripada Azib dengan harga tiga belas dirham. Kemudian Abu Bakar berkata kepada Azib, \"Suruh al-Bara' membawanya ke rumahku.\" Azib berkata, \"Tidak, sehingga engkau menceritakan kepada kami bagaimana engkau berbuat ketika Rasulullah SAW keluar bersamamu.\" Abu Bakar berkata, \"Kami keluar pada awal malam dan kami bergegas selama satu hari dan satu malam, sehingga sampai tengah hari. Aku melihat ke jauh untuk mencari tempat berteduh, dan aku melihat sebongkah batu, lalu aku pergi ke situ dan ada sedikit teduh di situ. Aku meratakan tanah untuk Rasulullah SAW dan membentangkan sehelai kain bulu unta untuk Baginda, dan berkata, 'Tidurlah dan berehatlah, wahai Rasulullah.' Maka Baginda tidur, dan aku keluar untuk melihat adakah aku nampak sesiapa yang mencari kami. Kemudian aku nampak seorang pengembala dan aku berkata, 'Kepunyaan siapa engkau, wahai budak?' Dia berkata, 'Kepunyaan seorang lelaki dari Quraisy.' Dia menyebut namanya dan aku mengenali dia. Aku berkata, 'Adakah susu dalam kambing-kambingmu?' Dia berkata, 'Ya.' Aku berkata, 'Adakah engkau akan memerah susu untukku?' Dia berkata, 'Ya.' Aku menyuruhnya berbuat demikian, maka dia menangkap seekor kambing, kemudian aku menyuruhnya menyingkirkan habuk dari putingnya, kemudian menyingkirkan habuk dari tangannya. Aku ada membawa bekas kecil yang di mulutnya ada kain. Dia memerah sedikit susu untukku dan aku menuangkannya ke dalam bekas itu sehingga ia sejuk. Kemudian aku pergi kepada Rasulullah SAW. Sewaktu aku sampai kepada Baginda, Baginda telah pun bangun. Aku berkata, 'Minumlah, wahai Rasulullah.' Baginda minum sehingga aku berpuas hati, kemudian aku berkata, 'Sampaikah masanya untuk kita berangkat?' Maka kami pun berangkat dan orang ramai mengejar kami, tetapi tiada seorang pun daripada mereka dapat mengejar kami kecuali Suraqah bin Malik bin Ju'shum, yang menunggang kuda miliknya. Aku berkata, 'Wahai Rasulullah, orang yang mengejar kita telah mengejar kita.' Baginda berkata, \"Janganlah bersedih, sesungguhnya Allah bersama kita.\"  Sehinggalah dia hampir kepada kami, dan jarak antara kami dengan dia hanyalah sejauh satu, dua atau tiga tombak, aku berkata, 'Wahai Rasulullah, orang yang mengejar kita telah mengejar kita,' dan aku menangis. Baginda bertanya, \"Mengapa engkau menangis?\" Aku berkata, \"Demi Allah, aku bukan menangis kerana diriku sendiri, tetapi aku menangis kerana engkau.\" Maka Rasulullah SAW mendoakan Suraqah,  lalu kaki-kaki kudanya terkulai hingga ke perutnya di atas tanah yang keras, dan dia terjun dari kudanya dan berkata, 'Wahai Muhammad, aku tahu bahawa ini adalah perbuatanmu, maka berdoalah kepada Allah agar menyelamatkanku daripada apa yang aku alami sekarang. Demi Allah, aku akan menghalang orang yang mengejar di belakangku, dan ini adalah kendaraanku, ambillah sebahagiannya, kerana engkau akan melalui unta dan kambingku di tempat begini dan begini, maka ambillah apa yang engkau perlukan.' Rasulullah SAW berkata, 'Aku tidak memerlukannya.' Kemudian Rasulullah SAW mendoakan Suraqah dan dia dilepaskan. Dia kembali kepada sahabat-sahabatnya, dan Rasulullah SAW dan aku meneruskan perjalanan sehingga kami sampai di Madinah. Kemudian orang ramai menyambut Baginda, mereka keluar di jalan dan di atas bumbung-bumbung rumah. Anak-anak kecil dan orang dewasa di jalan raya bersorak, 'Allahu Akbar! Rasulullah SAW telah datang! Muhammad telah datang!'  Kemudian orang ramai berebut-rebut siapa yang akan menumpang Baginda. Kemudian Rasulullah SAW bersabda, 'Malam ini aku menginap di Bani Najjar, saudara-saudara Abdul Muttalib, agar aku memuliakan mereka dengan ini.'  Kemudian setelah pagi, Baginda pergi ke tempat yang diperintahkan. Al-Bara' bin Azib berkata, 'Orang pertama yang datang kepada kami daripada Muhajirin ialah Mus'ab bin Umair, saudara Bani Abdul Dar. Kemudian datang kepada kami Ibn Ummi Maktum yang buta, saudara Bani Fihr. Kemudian datang kepada kami Umar bin al-Khattab bersama dua puluh orang penunggang. Kami bertanya, 'Bagaimana dengan Rasulullah SAW?' Dia berkata, 'Baginda di belakangku.' Kemudian Rasulullah SAW dan Abu Bakar datang. Al-Bara' berkata, 'Rasulullah SAW tidak sampai sebelum aku menghafal beberapa surah daripada al-Mufassal.' Isra'il berkata, 'Al-Bara' adalah daripada kalangan Ansar daripada Bani Harithah.'"
  },
  {
    "id": 36167,
    "hadith_number": 4,
    "tajuk_hadith": "Pewartaan Surat at-Taubah dan Amanah",
    "perawi_melayu": "Daripada Abu Bakar:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا وَكِيعٌ، قَالَ قَالَ إِسْرَائِيلُ قَالَ أَبُو إِسْحَاقَ عَنْ زَيْدِ بْنِ يُثَيْعٍ، عَنْ أَبِي بَكْرٍ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَهُ بِبَرَاءَةٌ لِأَهْلِ مَكَّةَ لَا يَحُجُّ بَعْدَ الْعَامِ مُشْرِكٌ وَلَا يَطُوفُ بِالْبَيْتِ عُرْيَانٌ وَلَا يَدْخُلُ الْجَنَّةَ إِلَّا نَفْسٌ مُسْلِمَةٌ مَنْ كَانَ بَيْنَهُ وَبَيْنَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُدَّةٌ فَأَجَلُهُ إِلَى مُدَّتِهِ وَاللَّهُ بَرِيءٌ مِنْ الْمُشْرِكِينَ وَرَسُولُهُ قَالَ فَسَارَ بِهَا ثَلَاثًا ثُمَّ قَالَ لِعَلِيٍّ رَضِيَ اللَّهُ تَعَالَى عَنْهُ الْحَقْهُ فَرُدَّ عَلَيَّ أَبَا بَكْرٍ وَبَلِّغْهَا أَنْتَ قَالَ فَفَعَلَ قَالَ فَلَمَّا قَدِمَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبُو بَكْرٍ بَكَى قَالَ يَا رَسُولَ اللَّهِ حَدَثَ فِيَّ شَيْءٌ قَالَ مَا حَدَثَ فِيكَ إِلَّا خَيْرٌ وَلَكِنْ أُمِرْتُ أَنْ لَا يُبَلِّغَهُ إِلَّا أَنَا أَوْ رَجُلٌ مِنِّي‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Waki’, berkata; telah menceritakan kepada kami Isra’il, berkata; telah menceritakan kepada kami Abu Ishaq daripada Zaid bin Tsabit, daripada Abu Bakar bahawa Nabi SAW telah mengutusnya membawa Surah Bara’ah (At-Taubah) kepada penduduk Mekah supaya disampaikan bahawa sesudah tahun ini tiada lagi orang musyrik yang menunaikan haji, tiada lagi yang tawaf di Baitullah dalam keadaan bogel dan tiada siapa yang masuk syurga melainkan orang Islam. Sesiapa yang mempunyai perjanjian dengan Rasulullah SAW dalam tempoh tertentu, maka ia tetap sah sehingga tempohnya tamat. Dan Allah SWT dan Rasul-Nya berlepas daripada segala tanggungjawab terhadap orang-orang musyrik.  Beliau berjalan selama tiga hari menyampaikannya. Kemudian Nabi SAW bersabda kepada Ali RA: “Kejarlah dia, kembalikan Abu Bakar kepadaku dan sampaikanlah (surat itu) engkau.” Maka Ali pun melakukannya.  Apabila Abu Bakar sampai kepada Nabi SAW, beliau menangis lalu berkata: “Wahai Rasulullah, adakah sesuatu yang berlaku terhadap saya?” Baginda menjawab: “Tiada apa yang berlaku kepadamu melainkan kebaikan. Akan tetapi, aku telah diperintahkan agar tiada sesiapa yang menyampaikannya kecuali aku atau seorang lelaki daripada keluargaku.”"
  },
  {
    "id": 36168,
    "hadith_number": 5,
    "tajuk_hadith": "Nasihat Abu Bakar: Kesejahteraan, Kejujuran, dan Persaudaraan",
    "perawi_melayu": "Daripada riwayat Awsat yang menyatakan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ يَزِيدَ بْنِ خُمَيْرٍ، عَنْ سُلَيْمِ بْنِ عَامِرٍ، عَنْ أَوْسَطَ، قَالَ خَطَبَنَا أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَقَالَ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَقَامِي هَذَا عَامَ الْأَوَّلِ وَبَكَى أَبُو بَكْرٍ فَقَالَ أَبُو بَكْرٍ سَلُوا اللَّهَ الْمُعَافَاةَ أَوْ قَالَ الْعَافِيَةَ فَلَمْ يُؤْتَ أَحَدٌ قَطُّ بَعْدَ الْيَقِينِ أَفْضَلَ مِنْ الْعَافِيَةِ أَوْ الْمُعَافَاةِ عَلَيْكُمْ بِالصِّدْقِ فَإِنَّهُ مَعَ الْبِرِّ وَهُمَا فِي الْجَنَّةِ وَإِيَّاكُمْ وَالْكَذِبَ فَإِنَّهُ مَعَ الْفُجُورِ وَهُمَا فِي النَّارِ وَلَا تَحَاسَدُوا وَلَا تَبَاغَضُوا وَلَا تَقَاطَعُوا وَلَا تَدَابَرُوا وَكُونُوا إِخْوَانًا كَمَا أَمَرَكُمْ اللَّهُ تَعَالَى‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Ja’far, katanya; telah menceritakan kepada kami Syu’bah, daripada Yazid bin Khumair, daripada Sulaim bin Amir, daripada Ausath, katanya; Abu Bakar r.a. telah menyampaikan khutbah kepada kami, lalu beliau berkata: Rasulullah SAW telah berdiri di tempatku ini pada tahun sebelumnya.  Abu Bakar menangis, kemudian beliau berkata: “Mohonlah kepada Allah kesejahteraan (al-‘afiyah/al-mu’afah), kerana sesungguhnya sesiapa pun tidak akan diberi sesuatu yang lebih baik selepas keimanan, melainkan kesejahteraan.  Hendaklah kamu benar, kerana kejujuran itu bersama kebajikan, dan keduanya membawa ke syurga. Dan jauhilah kamu berdusta, kerana dusta itu bersama kefajaran, dan keduanya membawa ke neraka. Janganlah kamu saling dengki, jangan saling membenci, jangan saling memutuskan silaturahim, jangan saling berpaling, dan hendaklah kamu menjadi saudara seagama sebagaimana Allah telah memerintahkan kamu.”"
  },
  {
    "id": 36169,
    "hadith_number": 6,
    "tajuk_hadith": "Doa memohon keampunan, kesejahteraan, dan keimanan",
    "perawi_melayu": "Rifā’ah bin Rāfi’ berkata:",
    "english_text": "I heard Abu Bakr as-Siddeeq say on the minbar of the Messenger of Allah (ﷺ) : I heard the Messenger of Allah (ﷺ) say, and Abu Bakr wept when he remembered the Messenger of Allah (ﷺ) , then he recovered and said. I heard the Messenger of Allah (ﷺ) say, in this hot weather last year: `Ask Allah for forgiveness, well-being and certainty of faith in the Hereafter and in this world.”",
    "arabic_text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، وَأَبُو عَامِرٍ قَالَا حَدَّثَنَا زُهَيْرٌ يَعْنِي ابْنَ مُحَمَّدٍ، عَنْ عَبْدِ اللَّهِ يَعْنِي ابْنَ مُحَمَّدِ بْنِ عَقِيلٍ، عَنْ مُعَاذِ بْنِ رِفَاعَةَ بْنِ رَافِعٍ الْأَنْصَارِيِّ، عَنْ أَبِيهِ، رِفَاعَةَ بْنِ رَافِعٍ قَالَ سَمِعْتُ أَبَا بَكْرٍ الصِّدِّيقَ، رَضِيَ اللَّهُ عَنْهُ يَقُولُ عَلَى مِنْبَرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فَبَكَى أَبُو بَكْرٍ حِينَ ذَكَرَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ سُرِّيَ عَنْهُ ثُمَّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي هَذَا الْقَيْظِ عَامَ الْأَوَّلِ سَلُوا اللَّهَ الْعَفْوَ وَالْعَافِيَةَ وَالْيَقِينَ فِي الْآخِرَةِ وَالْأُولَى‏.‏",
    "malay_translation": "Aku mendengar Abu Bakar As-Siddiq berkata di mimbar Rasulullah SAW: Aku mendengar Rasulullah SAW bersabda, dan Abu Bakar menangis ketika mengingati Rasulullah SAW, kemudian beliau tenang dan berkata. Aku mendengar Rasulullah SAW bersabda pada cuaca panas tahun lalu: “Mohonlah kepada Allah SWT keampunan, kesejahteraan, dan keimanan yang pasti di akhirat dan di dunia.”"
  },
  {
    "id": 36170,
    "hadith_number": 7,
    "tajuk_hadith": "Kebersihan Siwak dan Keredaan Allah",
    "perawi_melayu": "Daripada Abu Bakar r.a., bahawa Nabi SAW bersabda:",
    "english_text": "`The siwak is cleansing to the mouth and pleasing to the Lord`",
    "arabic_text": "حَدَّثَنَا أَبُو كَامِلٍ، قَالَ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ، عَنِ ابْنِ أَبِي عَتِيقٍ، عَنْ أَبِيهِ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ السِّوَاكُ مَطْهَرَةٌ لِلْفَمِ مَرْضَاةٌ لِلرَّبِّ‏.‏",
    "malay_translation": "Daripada Abu Bakar al-Siddiq r.a., bahawa Nabi Muhammad SAW bersabda:  \"Siwak membersihkan mulut dan menjadi sesuatu yang diredai oleh Tuhan.\" "
  },
  {
    "id": 36171,
    "hadith_number": 8,
    "tajuk_hadith": "Doa untuk Solat",
    "perawi_melayu": "Daripada Abu Bakar As-Siddiq r.a. bahawa beliau berkata kepada Rasulullah SAW:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، قَالَ حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، أَنَّهُ قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلِّمْنِي دُعَاءً أَدْعُو بِهِ فِي صَلَاتِي قَالَ قُلْ اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ و قَالَ يُونُسُ كَبِيرًا حَدَّثَنَاه حَسَنٌ الْأَشْيَبُ عَنْ ابْنِ لَهِيعَةَ قَالَ قَالَ كَبِيرًا‏.‏",
    "malay_translation": "Daripada Abu Bakar As-Siddiq r.a. bahawa beliau berkata kepada Rasulullah SAW: \"Ajarkanlah kepadaku satu doa yang boleh aku baca dalam solatku.\"  Baginda SAW bersabda: \"Bacalah: Ya Allah, sesungguhnya aku telah menzalimi diriku sendiri dengan zalim yang banyak dan tiada sesiapa yang mengampunkan dosa melainkan Engkau. Maka ampunkanlah aku dengan keampunan daripadaMu dan rahmatilah aku. Sesungguhnya Engkaulah Yang Maha Pengampun, lagi Maha Mengasihani.\""
  },
  {
    "id": 36172,
    "hadith_number": 9,
    "tajuk_hadith": "Pusaka Nabi SAW dan Amal Jariyah",
    "perawi_melayu": "Daripada Aisyah; Fatimah dan Abbas datang kepada Abu Bakar untuk meminta bahagian pusaka mereka daripada Rasulullah SAW. Pada ketika itu, mereka meminta tanah Fadak dan bahagian rampasan perang Khaibar.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، رَضِيَ اللَّهُ عَنْهَا أَنَّ فَاطِمَةَ، وَالْعَبَّاسَ أَتَيَا أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ يَلْتَمِسَانِ مِيرَاثَهُمَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُمَا حِينَئِذٍ يَطْلُبَانِ أَرْضَهُ مِنْ فَدَكَ وَسَهْمَهُ مِنْ خَيْبَرَ فَقَالَ لَهُمْ أَبُو بَكْرٍ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا نُورَثُ مَا تَرَكْنَا صَدَقَةٌ إِنَّمَا يَأْكُلُ آلُ مُحَمَّدٍ فِي هَذَا الْمَالِ وَإِنِّي وَاللَّهِ لَا أَدَعُ أَمْرًا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُهُ فِيهِ إِلَّا صَنَعْتُهُ‏.‏",
    "malay_translation": "Kami diberitakan oleh Abdurrazzaq, katanya; Kami diberitakan oleh Ma'mar, daripada Zuhri, daripada Urwah, daripada Aisyah r.a., bahawa Fatimah dan Abbas datang kepada Abu Bakar r.a. untuk meminta bahagian pusaka mereka daripada Rasulullah SAW. Pada ketika itu, mereka meminta tanah Fadak dan bahagian rampasan perang Khaibar. Maka Abu Bakar berkata kepada mereka: “Sesungguhnya aku mendengar Rasulullah SAW bersabda: “Kami (para Nabi) tidak diwarisi, apa yang kami tinggalkan adalah sedekah.  Keluarga Muhammad sahaja yang memakan daripada harta ini.” Dan demi Allah, aku tidak akan mengubah sesuatu perkara yang aku lihat Rasulullah SAW melakukannya terhadapnya melainkan aku akan melakukannya.”"
  },
  {
    "id": 36173,
    "hadith_number": 10,
    "tajuk_hadith": "Keutamaan Mendoakan Keafiatan",
    "perawi_melayu": "Abu Hurairah berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ الْمُقْرِئُ، قَالَ حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ، قَالَ سَمِعْتُ عَبْدَ الْمَلِكِ بْنَ الْحَارِثِ، يَقُولُ إِنَّ أَبَا هُرَيْرَةَ قَالَ سَمِعْتُ أَبَا بَكْرٍ الصِّدِّيقَ، رَضِيَ اللَّهُ عَنْهُ عَلَى هَذَا الْمِنْبَرِ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذَا الْيَوْمِ مِنْ عَامِ الْأَوَّلِ ثُمَّ اسْتَعْبَرَ أَبُو بَكْرٍ وَبَكَى ثُمَّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَمْ تُؤْتَوْا شَيْئًا بَعْدَ كَلِمَةِ الْإِخْلَاصِ مِثْلَ الْعَافِيَةِ فَاسْأَلُوا اللَّهَ الْعَافِيَةَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Abdurrahman Al-Muqri', dia berkata; telah menceritakan kepada kami Haiwah bin Syuraih, dia berkata; aku mendengar Abd Malik bin Harits berkata; sesungguhnya Abu Hurairah berkata; aku mendengar Abu Bakar As-Siddiq r.a. di atas mimbar ini berkata: Aku mendengar Rasulullah SAW pada hari ini tahun lalu. Kemudian Abu Bakar merenung seketika dan menangis, lalu berkata: Aku mendengar Rasulullah SAW bersabda: “Kamu semua tidak akan diberi sesuatu pun selepas kalimah ikhlas ( iaitu syahadah ), seperti kebaikan kesihatan, maka mintalah kebaikan kesihatan kepada Allah.”"
  },
  {
    "id": 36174,
    "hadith_number": 11,
    "tajuk_hadith": "Allah SWT sebagai Penjaga Ketiga",
    "perawi_melayu": "Dari Anas, bahawa Abu Bakar telah menceritakan kepadanya:",
    "english_text": "I said to the Prophet (ﷺ) when he was in the cave - on one occasion he said: when we were in the cave -: If one of them looks at his feet, he will see us beneath his feet.\nHe said: `O Abu Bakr, what do you think of two, of whom Allah is the third?`",
    "arabic_text": "حَدَّثَنَا عَفَّانُ، قَالَ حَدَّثَنَا هَمَّامٌ، قَالَ أَخْبَرَنَا ثَابِتٌ، عَنْ أَنَسٍ، أَنَّ أَبَا بَكْرٍ، حَدَّثَهُ قَالَ قُلْتُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي الْغَارِ وَقَالَ مَرَّةً وَنَحْنُ فِي الْغَارِ لَوْ أَنَّ أَحَدَهُمْ نَظَرَ إِلَى قَدَمَيْهِ لَأَبْصَرَنَا تَحْتَ قَدَمَيْهِ قَالَ فَقَالَ يَا أَبَا بَكْرٍ مَا ظَنُّكَ بِاثْنَيْنِ اللَّهُ ثَالِثُهُمَا‏.‏",
    "malay_translation": "Aku berkata kepada Nabi SAW ketika baginda berada di dalam gua – pada suatu ketika baginda berkata: ketika kami berada di dalam gua – sekiranya salah seorang daripada kami melihat ke bawah kakinya, nescaya dia akan melihat kami di bawah kakinya.\nBaginda berkata: ‘Wahai Abu Bakar, apakah pendapatmu tentang dua orang, yang Allah SWT adalah yang ketiga?’"
  },
  {
    "id": 36175,
    "hadith_number": 12,
    "tajuk_hadith": "Kemunculan Dajjal dari Khurasan",
    "perawi_melayu": "Daripada Abu Bakar as-Siddiq, diriwayatkan bahawa:",
    "english_text": "The Messenger of Allah (ﷺ) said: `The Dajjal will emerge from a land in the east called Khurasan and he will be followed by peoples whose faces are like hammered shields.`",
    "arabic_text": "حَدَّثَنَا رَوْحٌ، قَالَ حَدَّثَنَا ابْنُ أَبِي عَرُوبَةَ، عَنْ أَبِي التَّيَّاحِ، عَنِ الْمُغِيرَةِ بْنِ سُبَيْعٍ، عَنْ عَمْرِو بْنِ حُرَيْثٍ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، قَالَ حَدَّثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ الدَّجَّالَ يَخْرُجُ مِنْ أَرْضٍ بِالْمَشْرِقِ يُقَالُ لَهَا خُرَاسَانُ يَتَّبِعُهُ أَقْوَامٌ كَأَنَّ وُجُوهَهُمْ الْمَجَانُّ الْمُطْرَقَةُ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Dajjal akan muncul daripada sebuah tanah di sebelah timur yang bernama Khurasan, dan dia akan diikuti oleh sekumpulan manusia yang wajah-wajah mereka seperti perisai yang ditempa.\""
  },
  {
    "id": 36176,
    "hadith_number": 13,
    "tajuk_hadith": "Syurga dan Sifat-Sifat yang Mencegah Kemasukan Ke Dalamnya",
    "perawi_melayu": "Daripada Abu Bakr As-Siddiq r.a.",
    "english_text": "The Messenger of Allah (ﷺ) said: `No miser, cheater, traitor or person who mistreats his slaves will enter Paradise. The first to knock at the gates of Paradise will be the slaves, if they fulfil their duties towards Allah and towards their masters properly.”",
    "arabic_text": "حَدَّثَنَا أَبُو سَعِيدٍ، مَوْلَى بَنِي هَاشِمٍ قَالَ حَدَّثَنَا صَدَقَةُ بْنُ مُوسَى، صَاحِبُ الدَّقِيقِ عَنْ فَرْقَدٍ، عَنْ مُرَّةَ بْنِ شَرَاحِيلَ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَدْخُلُ الْجَنَّةَ بَخِيلٌ وَلَا خَبٌّ وَلَا خَائِنٌ وَلَا سَيِّئُ الْمَلَكَةِ وَأَوَّلُ مَنْ يَقْرَعُ بَابَ الْجَنَّةِ الْمَمْلُوكُونَ إِذَا أَحْسَنُوا فِيمَا بَيْنَهُمْ وَبَيْنَ اللَّهِ عَزَّ وَجَلَّ وَفِيمَا بَيْنَهُمْ وَبَيْنَ مَوَالِيهِمْ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Tiada seorang yang bakhil, penipu, pengkhianat, dan mereka yang berlaku buruk kepada hamba sahayanya akan masuk syurga.  Orang yang pertama mengetuk pintu syurga ialah hamba sahaya, jika mereka telah berbuat baik di antara mereka dan Allah SWT, dan di antara mereka dan tuan mereka.\""
  },
  {
    "id": 36177,
    "hadith_number": 14,
    "tajuk_hadith": "Pewarisan Harta Rasulullah SAW",
    "perawi_melayu": "Daripada Abu Tufail",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَبِي شَيْبَةَ، قَالَ عَبْد اللَّهِ وَسَمِعْتُهُ مِنْ عَبْدِ اللَّهِ بْنِ أَبِي شَيْبَةَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنِ الْوَلِيدِ بْنِ جُمَيْعٍ، عَنْ أَبِي الطُّفَيْلِ، قَالَ لَمَّا قُبِضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْسَلَتْ فَاطِمَةُ إِلَى أَبِي بَكْرٍ أَنْتَ وَرِثْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمْ أَهْلُهُ قَالَ فَقَالَ لَا بَلْ أَهْلُهُ قَالَتْ فَأَيْنَ سَهْمُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَقَالَ أَبُو بَكْرٍ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ عَزَّ وَجَلَّ إِذَا أَطْعَمَ نَبِيًّا طُعْمَةً ثُمَّ قَبَضَهُ جَعَلَهُ لِلَّذِي يَقُومُ مِنْ بَعْدِهِ فَرَأَيْتُ أَنْ أَرُدَّهُ عَلَى الْمُسْلِمِينَ فَقَالَتْ فَأَنْتَ وَمَا سَمِعْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْلَمُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Muhammad bin Abi Syaibah, katanya Abdullah dan aku mendengarnya dari Abdullah bin Abi Syaibah, katanya; Telah menceritakan kepada kami Muhammad bin Fudhail, dari Al-Walid bin Jumaiah, dari Abu Thufayl, katanya: Ketika Rasulullah SAW wafat, Fatimah menghantar utusan kepada Abu Bakar: “Adakah engkau mewarisi Rasulullah SAW atau keluarganya?” Abu Bakar menjawab: “Tidak, tetapi keluarganya (yang mewarisi).” Fatimah bertanya: “Di manakah bahagian Rasulullah SAW?” Abu Bakar menjawab: “Sesungguhnya aku mendengar Rasulullah SAW bersabda: “Sesungguhnya Allah SWT jika memberikan harta kepada seorang Nabi, kemudian Dia mencabut nyawanya, maka Dia akan memberikannya kepada orang yang memimpin sesudah beliau.” Maka aku melihat patut untuk memulangkannya kepada kaum muslimin.” Fatimah berkata: “Baiklah, engkau lebih mengetahui apa yang engkau dengar dari Rasulullah SAW.”"
  },
  {
    "id": 36178,
    "hadith_number": 15,
    "tajuk_hadith": "Keagungan Syafaat Nabi Muhammad SAW",
    "perawi_melayu": "Daripada Abu Bakar As-Siddiq r.a. diriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ إِسْحَاقَ الطَّالَقَانِيُّ، قَالَ حَدَّثَنِي النَّضْرُ بْنُ شُمَيْلٍ الْمَازِنِيُّ، قَالَ حَدَّثَنِي أَبُو نَعَامَةَ، قَالَ حَدَّثَنِي أَبُو هُنَيْدَةَ الْبَرَاءُ بْنُ نَوْفَلٍ، عَنْ وَالَانَ الْعَدَوِيِّ، عَنْ حُذَيْفَةَ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، رَضِيَ اللَّهُ عَنْهُ قَالَ أَصْبَحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ فَصَلَّى الْغَدَاةَ ثُمَّ جَلَسَ حَتَّى إِذَا كَانَ مِنْ الضُّحَى ضَحِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ جَلَسَ مَكَانَهُ حَتَّى صَلَّى الْأُولَى وَالْعَصْرَ وَالْمَغْرِبَ كُلُّ ذَلِكَ لَا يَتَكَلَّمُ حَتَّى صَلَّى الْعِشَاءَ الْآخِرَةَ ثُمَّ قَامَ إِلَى أَهْلِهِ فَقَالَ النَّاسُ لِأَبِي بَكْرٍ أَلَا تَسْأَلُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا شَأْنُهُ صَنَعَ الْيَوْمَ شَيْئًا لَمْ يَصْنَعْهُ قَطُّ قَالَ فَسَأَلَهُ فَقَالَ نَعَمْ عُرِضَ عَلَيَّ مَا هُوَ كَائِنٌ مِنْ أَمْرِ الدُّنْيَا وَأَمْرِ الْآخِرَةِ فَجُمِعَ الْأَوَّلُونَ وَالْآخِرُونَ بِصَعِيدٍ وَاحِدٍ فَفَظِعَ النَّاسُ بِذَلِكَ حَتَّى انْطَلَقُوا إِلَى آدَمَ عَلَيْهِ السَّلَام وَالْعَرَقُ يَكَادُ يُلْجِمُهُمْ فَقَالُوا يَا آدَمُ أَنْتَ أَبُو الْبَشَرِ وَأَنْتَ اصْطَفَاكَ اللَّهُ عَزَّ وَجَلَّ اشْفَعْ لَنَا إِلَى رَبِّكَ قَالَ لَقَدْ لَقِيتُ مِثْلَ الَّذِي لَقِيتُمْ انْطَلِقُوا إِلَى أَبِيكُمْ بَعْدَ أَبِيكُمْ إِلَى نُوحٍ إِنَّ اللَّهَ اصْطَفَى آدَمَ وَنُوحًا وَآلَ إِبْرَاهِيمَ وَآلَ عِمْرَانَ عَلَى الْعَالَمِينَ قَالَ فَيَنْطَلِقُونَ إِلَى نُوحٍ عَلَيْهِ السَّلَام فَيَقُولُونَ اشْفَعْ لَنَا إِلَى رَبِّكَ فَأَنْتَ اصْطَفَاكَ اللَّهُ وَاسْتَجَابَ لَكَ فِي دُعَائِكَ وَلَمْ يَدَعْ عَلَى الْأَرْضِ مِنْ الْكَافِرِينَ دَيَّارًا فَيَقُولُ لَيْسَ ذَاكُمْ عِنْدِي انْطَلِقُوا إِلَى إِبْرَاهِيمَ عَلَيْهِ السَّلَام فَإِنَّ اللَّهَ عَزَّ وَجَلَّ اتَّخَذَهُ خَلِيلًا فَيَنْطَلِقُونَ إِلَى إِبْرَاهِيمَ فَيَقُولُ لَيْسَ ذَاكُمْ عِنْدِي وَلَكِنْ انْطَلِقُوا إِلَى مُوسَى عَلَيْهِ السَّلَام فَإِنَّ اللَّهَ عَزَّ وَجَلَّ كَلَّمَهُ تَكْلِيمًا فَيَقُولُ مُوسَى عَلَيْهِ السَّلَام لَيْسَ ذَاكُمْ عِنْدِي وَلَكِنْ انْطَلِقُوا إِلَى عِيسَى ابْنِ مَرْيَمَ فَإِنَّهُ يُبْرِئُ الْأَكْمَهَ وَالْأَبْرَصَ وَيُحْيِي الْمَوْتَى فَيَقُولُ عِيسَى لَيْسَ ذَاكُمْ عِنْدِي وَلَكِنْ انْطَلِقُوا إِلَى سَيِّدِ وَلَدِ آدَمَ فَإِنَّهُ أَوَّلُ مَنْ تَنْشَقُّ عَنْهُ الْأَرْضُ يَوْمَ الْقِيَامَةِ انْطَلِقُوا إِلَى مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَشْفَعَ لَكُمْ إِلَى رَبِّكُمْ عَزَّ وَجَلَّ قَالَ فَيَنْطَلِقُ فَيَأْتِي جِبْرِيلُ عَلَيْهِ السَّلَام رَبَّهُ فَيَقُولُ اللَّهُ عَزَّ وَجَلَّ ائْذَنْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ قَالَ فَيَنْطَلِقُ بِهِ جِبْرِيلُ فَيَخِرُّ سَاجِدًا قَدْرَ جُمُعَةٍ وَيَقُولُ اللَّهُ عَزَّ وَجَلَّ ارْفَعْ رَأْسَكَ يَا مُحَمَّدُ وَقُلْ يُسْمَعْ وَاشْفَعْ تُشَفَّعْ قَالَ فَيَرْفَعُ رَأْسَهُ فَإِذَا نَظَرَ إِلَى رَبِّهِ عَزَّ وَجَلَّ خَرَّ سَاجِدًا قَدْرَ جُمُعَةٍ أُخْرَى فَيَقُولُ اللَّهُ عَزَّ وَجَلَّ ارْفَعْ رَأْسَكَ وَقُلْ يُسْمَعْ وَاشْفَعْ تُشَفَّعْ قَالَ فَيَذْهَبُ لِيَقَعَ سَاجِدًا فَيَأْخُذُ جِبْرِيلُ عَلَيْهِ السَّلَام بِضَبْعَيْهِ فَيَفْتَحُ اللَّهُ عَزَّ وَجَلَّ عَلَيْهِ مِنْ الدُّعَاءِ شَيْئًا لَمْ يَفْتَحْهُ عَلَى بَشَرٍ قَطُّ فَيَقُولُ أَيْ رَبِّ خَلَقْتَنِي سَيِّدَ وَلَدِ آدَمَ وَلَا فَخْرَ وَأَوَّلَ مَنْ تَنْشَقُّ عَنْهُ الْأَرْضُ يَوْمَ الْقِيَامَةِ وَلَا فَخْرَ حَتَّى إِنَّهُ لَيَرِدُ عَلَيَّ الْحَوْضَ أَكْثَرُ مِمَّا بَيْنَ صَنْعَاءَ وَأَيْلَةَ ثُمَّ يُقَالُ ادْعُوا الصِّدِّيقِينَ فَيَشْفَعُونَ ثُمَّ يُقَالُ ادْعُوا الْأَنْبِيَاءَ قَالَ فَيَجِيءُ النَّبِيُّ وَمَعَهُ الْعِصَابَةُ وَالنَّبِيُّ وَمَعَهُ الْخَمْسَةُ وَالسِّتَّةُ وَالنَّبِيُّ وَلَيْسَ مَعَهُ أَحَدٌ ثُمَّ يُقَالُ ادْعُوا الشُّهَدَاءَ فَيَشْفَعُونَ لِمَنْ أَرَادُوا وَقَالَ فَإِذَا فَعَلَتْ الشُّهَدَاءُ ذَلِكَ قَالَ يَقُولُ اللَّهُ عَزَّ وَجَلَّ أَنَا أَرْحَمُ الرَّاحِمِينَ أَدْخِلُوا جَنَّتِي مَنْ كَانَ لَا يُشْرِكُ بِي شَيْئًا قَالَ فَيَدْخُلُونَ الْجَنَّةَ قَالَ ثُمَّ يَقُولُ اللَّهُ عَزَّ وَجَلَّ انْظُرُوا فِي النَّارِ هَلْ تَلْقَوْنَ مِنْ أَحَدٍ عَمِلَ خَيْرًا قَطُّ قَالَ فَيَجِدُونَ فِي النَّارِ رَجُلًا فَيَقُولُ لَهُ هَلْ عَمِلْتَ خَيْرًا قَطُّ فَيَقُولُ لَا غَيْرَ أَنِّي كُنْتُ أُسَامِحُ النَّاسَ فِي الْبَيْعِ وَالشِّرَاءِ فَيَقُولُ اللَّهُ عَزَّ وَجَلَّ أَسْمِحُوا لِعَبْدِي كَإِسْمَاحِهِ إِلَى عَبِيدِي ثُمَّ يُخْرِجُونَ مِنْ النَّارِ رَجُلًا فَيَقُولُ لَهُ هَلْ عَمِلْتَ خَيْرًا قَطُّ فَيَقُولُ لَا غَيْرَ أَنِّي قَدْ أَمَرْتُ وَلَدِي إِذَا مِتُّ فَأَحْرِقُونِي بِالنَّارِ ثُمَّ اطْحَنُونِي حَتَّى إِذَا كُنْتُ مِثْلَ الْكُحْلِ فَاذْهَبُوا بِي إِلَى الْبَحْرِ فَاذْرُونِي فِي الرِّيحِ فَوَاللَّهِ لَا يَقْدِرُ عَلَيَّ رَبُّ الْعَالَمِينَ أَبَدًا فَقَالَ اللَّهُ عَزَّ وَجَلَّ لِمَ فَعَلْتَ ذَلِكَ قَالَ مِنْ مَخَافَتِكَ قَالَ فَيَقُولُ اللَّهُ عَزَّ وَجَلَّ انْظُرْ إِلَى مُلْكِ أَعْظَمِ مَلِكٍ فَإِنَّ لَكَ مِثْلَهُ وَعَشَرَةَ أَمْثَالِهِ قَالَ فَيَقُولُ لِمَ تَسْخَرُ بِي وَأَنْتَ الْمَلِكُ قَالَ وَذَاكَ الَّذِي ضَحِكْتُ مِنْهُ مِنْ الضُّحَى‏.‏",
    "malay_translation": "Pada suatu hari, Rasulullah SAW bangun dan menunaikan solat Subuh, kemudian baginda duduk sehingga hampir tengah hari.  Rasulullah SAW tersenyum. Kemudian baginda terus duduk di tempat yang sama sehingga menunaikan solat Zohor, Asar dan Maghrib, dan baginda tidak berkata-kata sehingga menunaikan solat Isyak.  Kemudian baginda bangun dan pergi kepada keluarganya.  Orang ramai berkata kepada Abu Bakar: Mengapa engkau tidak bertanya kepada Rasulullah SAW apa yang terjadi? Baginda melakukan sesuatu hari ini yang belum pernah baginda lakukan sebelum ini.  Maka Abu Bakar bertanya kepada baginda, dan baginda menjawab:  Ya, aku telah diperlihatkan apa yang akan berlaku di dunia dan akhirat.  Generasi terdahulu dan generasi kemudian dikumpulkan di satu tempat, lalu manusia sangat takut. Mereka pergi kepada Nabi Adam a.s. ketika peluh hampir mencekik mereka, dan mereka berkata: Wahai Adam, engkau adalah bapa manusia dan Allah SWT telah memilih engkau.  Bersyafaatlah untuk kami kepada Tuhanmu. Adam menjawab: Aku pun mengalami keadaan seperti kamu. Pergilah kepada bapa kamu selepas bapa kamu, kepada Nabi Nuh a.s., kerana sesungguhnya Allah telah memilih Adam, Nuh, keluarga Ibrahim dan keluarga Imran daripada semua alam. (Surah Ali Imran 3:33)\n\nKemudian mereka pergi kepada Nabi Nuh a.s. dan berkata: Bersyafaatlah untuk kami kepada Tuhanmu, kerana engkau telah dipilih oleh Allah dan doa engkau dimakbul, dan Dia tidak meninggalkan sesiapa pun daripada orang-orang kafir di bumi. (rujuk Surah Al-Jinn 71:26) Nuh menjawab:  Bukan aku yang kamu cari; pergilah kepada Nabi Ibrahim a.s., kerana Allah SWT telah menjadikan baginda sebagai kekasih-Nya (Khalil). Maka mereka pergi kepada Nabi Ibrahim a.s., tetapi baginda berkata:  Bukan aku yang kamu cari; pergilah kepada Nabi Musa a.s., kerana Allah SWT telah bercakap dengan baginda secara langsung (rujuk Surah An-Nisa’ 4:164). Tetapi Nabi Musa a.s. berkata:  Bukan aku yang kamu cari; pergilah kepada Nabi Isa a.s. anak Maryam, kerana baginda menyembuhkan orang buta dan pesakit kusta, dan baginda menghidupkan orang mati.  Tetapi Nabi Isa a.s. berkata: Bukan aku yang kamu cari; pergilah kepada pemimpin anak-anak Adam, kerana baginda adalah orang pertama yang tanah akan terbelah darinya pada hari kiamat. Pergilah kepada Nabi Muhammad SAW, kerana baginda akan bersyafaat untuk kamu kepada Tuhanmu SWT.  Kemudian Nabi Muhammad SAW pergi, dan Jibril a.s. datang mengadap Tuhannya, dan Allah SWT berfirman: Berilah izin kepadanya dan sampaikan khabar gembira syurga kepadanya. Jibril membawa Nabi Muhammad SAW dan baginda sujud selama seminggu. Allah SWT berfirman: Angkatlah kepalamu wahai Muhammad; katakanlah, nescaya akan didengar, dan syafaatmu akan diterima.  Baginda mengangkat kepalanya, dan apabila baginda memandang Tuhannya SWT, baginda sujud lagi selama seminggu. Allah SWT berfirman: Angkatlah kepalamu wahai Muhammad; katakanlah, nescaya akan didengar, dan syafaatmu akan diterima. Baginda hendak sujud lagi, tetapi Jibril a.s. memegang kedua belah lengan baginda, dan Allah SWT ilhamkan kepada baginda doa yang tidak pernah diilhamkan kepada sesiapa pun. Baginda berkata: Ya Tuhanku, Engkau telah menciptakanku sebagai pemimpin anak-anak Adam, dan ini bukan riak; orang pertama yang tanah akan terbelah darinya pada hari kiamat, dan ini bukan riak; sungguh ramai yang akan datang ke telaga Haudku melebihi jumlah manusia di antara Sana’a dan Aila.\n\nKemudian diperintahkan: Panggillah golongan Siddiq supaya mereka bersyafaat.  Kemudian diperintahkan: Panggillah para Nabi.  Maka seorang Nabi datang bersama sekumpulan orang, dan seorang Nabi lagi datang bersama lima atau enam orang, dan seorang Nabi lagi datang tanpa sesiapa pun.  Kemudian diperintahkan: Panggillah para syuhada supaya mereka bersyafaat untuk sesiapa yang mereka kehendaki.  Apabila para syuhada telah melakukan demikian, Allah SWT berfirman: Aku adalah Tuhan yang Maha Pengasih, masukkanlah ke dalam syurgaku sesiapa yang tidak menyekutukanKu. \n\nLalu mereka masuk ke syurga. Kemudian Allah SWT berfirman: Lihatlah ke dalam neraka; adakah kamu jumpa sesiapa yang pernah berbuat baik?  Maka mereka menjumpai seorang lelaki di dalam neraka, dan Allah SWT bertanya kepadanya: Adakah engkau pernah berbuat baik? Lelaki itu menjawab: Tidak, kecuali aku bersikap mudah dalam jual beli.  Allah SWT berfirman: Bersikap mudahlah kepada hambaKu seperti sikap mudahnya kepada hamba-hambaKu. Kemudian mereka mengeluarkan seorang lelaki dari neraka, dan Allah SWT bertanya kepadanya: Adakah engkau pernah berbuat baik?  Lelaki itu menjawab: Tidak, kecuali aku pernah memerintahkan anak-anakku: Apabila aku mati, bakarlah aku dengan api, kemudian kisarlah aku sehingga aku menjadi seperti serbuk celak. Kemudian bawalah aku ke laut dan hamburkan aku ditiup angin, demi Allah Tuhan semesta alam, Dia tidak akan dapat menyiksaku. Allah SWT bertanya: Mengapa engkau berbuat demikian? Lelaki itu menjawab: Kerana takut kepadaMu.  Allah SWT berfirman: Lihatlah kerajaan raja yang teragung, maka engkau akan mendapat seperti itu dan sepuluh kali ganda. Lelaki itu berkata: Adakah Engkau mempermainkan aku sedangkan Engkau adalah Yang Maha Berkuasa?  (Rasulullah SAW bersabda): Itulah yang aku tersenyum pada waktu tengah hari itu."
  },
  {
    "id": 36179,
    "hadith_number": 16,
    "tajuk_hadith": "Amaran Mengenai Berdusta dan Mengabaikan Kemungkaran",
    "perawi_melayu": "Qais berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، قَالَ حَدَّثَنَا زُهَيْرٌ يَعْنِي ابْنَ مُعَاوِيَةَ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، قَالَ حَدَّثَنَا قَيْسٌ، قَالَ قَامَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَحَمِدَ اللَّهَ عَزَّ وَجَلَّ وَأَثْنَى عَلَيْهِ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّكُمْ تَقْرَءُونَ هَذِهِ الْآيَةَ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا عَلَيْكُمْ أَنْفُسَكُمْ لَا يَضُرُّكُمْ مَنْ ضَلَّ إِذَا اهْتَدَيْتُمْ‏}‏ إِلَى آخِرِ الْآيَةِ وَإِنَّكُمْ تَضَعُونَهَا عَلَى غَيْرِ مَوْضِعِهَا وَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ النَّاسَ إِذَا رَأَوْا الْمُنْكَرَ وَلَا يُغَيِّرُوهُ أَوْشَكَ اللَّهُ أَنْ يَعُمَّهُمْ بِعِقَابِهِ قَالَ وَسَمِعْتُ أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ يَقُولُ يَا أَيُّهَا النَّاسُ إِيَّاكُمْ وَالْكَذِبَ فَإِنَّ الْكَذِبَ مُجَانِبٌ لِلْإِيمَانِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Hashim bin Al-Qasim, dia berkata; telah menceritakan kepada kami Zuhri (iaitu Zuhri bin Muawiyah), dia berkata; telah menceritakan kepada kami Ismail bin Abi Khalid, dia berkata; telah menceritakan kepada kami Qais, dia berkata; Abu Bakar r.a. bangun lalu memuji dan mensyukuri Allah SWT, kemudian berkata: Wahai sekalian manusia, sesungguhnya kamu membaca ayat ini: {Wahai orang-orang yang beriman, peliharalah diri kamu; jika kamu mendapat petunjuk...} sehingga akhir ayat. Dan sesungguhnya kamu meletakkannya di tempat yang bukan tempatnya. Dan sesungguhnya aku mendengar Rasulullah SAW bersabda: Sesungguhnya jika manusia melihat kemungkaran dan tidak mengubahnya, maka Allah akan segera menimpakan azabNya kepada mereka secara menyeluruh. Dia berkata: dan aku mendengar Abu Bakar r.a berkata: Wahai sekalian manusia, jauhilah kamu daripada berdusta, kerana sesungguhnya berdusta itu jauh daripada iman."
  },
  {
    "id": 36180,
    "hadith_number": 17,
    "tajuk_hadith": "Kejujuran, Persaudaraan, dan Jauhi Kemungkaran",
    "perawi_melayu": "Daripada Awsat bin Isma'eel al-Bajali yang mendengar Abu Bakar ketika Rasulullah SAW wafat berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَاشِمٌ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي يَزِيدُ بْنُ خُمَيْرٍ، قَالَ سَمِعْتُ سُلَيْمَ بْنَ عَامِرٍ، رَجُلًا مِنْ حِمْيَرَ يُحَدِّثُ عَنْ أَوْسَطَ بْنِ إِسْمَاعِيلَ بْنِ أَوْسَطَ الْبَجَلِيِّ، يُحَدِّثُ عَنْ أَبِي بَكْرٍ، أَنَّهُ سَمِعَهُ حِينَ، تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْأَوَّلِ مَقَامِي هَذَا ثُمَّ بَكَى ثُمَّ قَالَ عَلَيْكُمْ بِالصِّدْقِ فَإِنَّهُ مَعَ الْبِرِّ وَهُمَا فِي الْجَنَّةِ وَإِيَّاكُمْ وَالْكَذِبَ فَإِنَّهُ مَعَ الْفُجُورِ وَهُمَا فِي النَّارِ وَسَلُوا اللَّهَ الْمُعَافَاةَ فَإِنَّهُ لَمْ يُؤْتَ رَجُلٌ بَعْدَ الْيَقِينِ شَيْئًا خَيْرًا مِنْ الْمُعَافَاةِ ثُمَّ قَالَ لَا تَقَاطَعُوا وَلَا تَدَابَرُوا وَلَا تَبَاغَضُوا وَلَا تَحَاسَدُوا وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Hashim, dia berkata; telah menceritakan kepada kami Syu'bah, dia berkata; telah memberitakan kepadaku Yazid bin Khumair, dia berkata; aku mendengar Sulaim bin Amir, seorang lelaki dari Himyar menceritakan daripada Awsath bin Ismail bin Awsath al-Bajali, menceritakan daripada Abu Bakar, bahawa dia mendengarnya ketika Rasulullah SAW wafat, beliau berkata: Rasulullah SAW berdiri pada tahun pertama di tempatku ini, kemudian Baginda menangis, lalu Baginda bersabda: “Hendaklah kamu berpegang teguh kepada kejujuran, kerana sesungguhnya ia bersama-sama kebajikan dan kedua-duanya membawa ke syurga. Dan jauhilah kamu daripada berdusta, kerana sesungguhnya ia bersama-sama kejahatan dan kedua-duanya membawa ke neraka. Dan mintalah kepada Allah kesejahteraan, kerana sesungguhnya tidak diberikan kepada seseorang setelah keyakinan sesuatu yang lebih baik daripada kesejahteraan.” Kemudian Baginda bersabda: “Janganlah kamu memutuskan hubungan sesama kamu, janganlah kamu berpaling daripada sesama kamu, janganlah kamu saling membenci, dan janganlah kamu saling dengki, dan jadilah kamu wahai hamba Allah, sebagai saudara-saudara.”"
  },
  {
    "id": 36181,
    "hadith_number": 18,
    "tajuk_hadith": "Kewafatan Rasulullah SAW dan Peranan Abu Bakar",
    "perawi_melayu": "Daripada Humaid bin ‘Abdur-Rahman berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَفَّانُ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ دَاوُدَ بْنِ عَبْدِ اللَّهِ الْأَوْدِيِّ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرٍ فِي طَائِفَةٍ مِنْ الْمَدِينَةِ قَالَ فَجَاءَ فَكَشَفَ عَنْ وَجْهِهِ فَقَبَّلَهُ وَقَالَ فِدَاكَ أَبِي وَأُمِّي مَا أَطْيَبَكَ حَيًّا وَمَيِّتًا مَاتَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَبِّ الْكَعْبَةِ فَذَكَرَ الْحَدِيثَ قَالَ فَانْطَلَقَ أَبُو بَكْرٍ وَعُمَرُ يَتَقَاوَدَانِ حَتَّى أَتَوْهُمْ فَتَكَلَّمَ أَبُو بَكْرٍ وَلَمْ يَتْرُكْ شَيْئًا أُنْزِلَ فِي الْأَنْصَارِ وَلَا ذَكَرَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ شَأْنِهِمْ إِلَّا وَذَكَرَهُ وَقَالَ وَلَقَدْ عَلِمْتُمْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ سَلَكَ النَّاسُ وَادِيًا وَسَلَكَتْ الْأَنْصَارُ وَادِيًا سَلَكْتُ وَادِيَ الْأَنْصَارِ وَلَقَدْ عَلِمْتَ يَا سَعْدُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَأَنْتَ قَاعِدٌ قُرَيْشٌ وُلَاةُ هَذَا الْأَمْرِ فَبَرُّ النَّاسِ تَبَعٌ لِبَرِّهِمْ وَفَاجِرُهُمْ تَبَعٌ لِفَاجِرِهِمْ قَالَ فَقَالَ لَهُ سَعْدٌ صَدَقْتَ نَحْنُ الْوُزَرَاءُ وَأَنْتُمْ الْأُمَرَاءُ‏.‏",
    "malay_translation": "Diriwayatkan bahawa Rasulullah SAW wafat ketika Abu Bakar berada di satu kawasan di Madinah.  Abu Bakar datang, membuka wajah Baginda, mencium Baginda dan berkata: “Semoga ayah dan ibuku dikorbankan untukmu. Betapa baiknya engkau semasa hidup dan mati. Muhammad SAW telah wafat, demi Tuhan Kaabah...” Kemudian Abu Bakar dan Umar pergi menemui orang ramai. Abu Bakar berucap dan tidak meninggalkan sebarang perkara yang diturunkan berkaitan dengan kaum Ansar atau yang disebut oleh Rasulullah SAW tentang mereka melainkan disebutkannya.  Beliau berkata: “Sesungguhnya kamu telah mengetahui bahawa Rasulullah SAW telah bersabda: ‘Sekiranya manusia mengambil satu jalan dan kaum Ansar mengambil satu jalan yang lain, nescaya aku akan mengambil jalan kaum Ansar.’  Wahai Saad, sesungguhnya kamu juga tahu bahawa Rasulullah SAW telah bersabda ketika engkau duduk di sini: ‘Quraisy adalah pemimpin dalam urusan ini (Islam), maka orang yang soleh daripada manusia akan mengikut orang yang soleh daripada (Quraisy), dan orang yang fasik daripada manusia akan mengikut orang yang fasik daripada (Quraisy).’” Saad berkata kepadanya: “Engkau benar. Kami adalah penasihat dan kamu adalah pemimpin.”"
  },
  {
    "id": 36182,
    "hadith_number": 19,
    "tajuk_hadith": "Usaha dan Takdir",
    "perawi_melayu": "Daripada Talhah bin Abdullah bin Abdur-Rahman bin Abi Bakr As-Siddiq, katanya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ، قَالَ حَدَّثَنَا الْعَطَّافُ بْنُ خَالِدٍ، قَالَ حَدَّثَنِي رَجُلٌ، مِنْ أَهْلِ الْبَصْرَةِ عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ، قَالَ سَمِعْتُ أَبِي يَذْكُرُ، أَنَّ أَبَاهُ، سَمِعَ أَبَا بَكْرٍ، وَهُوَ يَقُولُ قُلْتُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا رَسُولَ اللَّهِ الْعَمَلُ عَلَى مَا فُرِغَ مِنْهُ أَوْ عَلَى أَمْرٍ مُؤْتَنَفٍ قَالَ بَلْ عَلَى أَمْرٍ قَدْ فُرِغَ مِنْهُ قَالَ قُلْتُ فَفِيمَ الْعَمَلُ يَا رَسُولَ اللَّهِ قَالَ كُلٌّ مُيَسَّرٌ لِمَا خُلِقَ لَهُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ali bin Ayasy, katanya; Telah menceritakan kepada kami Al-Attâf bin Khalid, katanya; Telah menceritakan kepadaku seorang lelaki dari penduduk Basrah daripada Thalhah bin Abdullah bin Abdur-Rahman bin Abi Bakar As-Siddiq, katanya: Aku mendengar bapaku menyebut bahawa bapanya mendengar Abu Bakar berkata: Aku berkata kepada Rasulullah SAW: Wahai Rasulullah, adakah amalan itu untuk sesuatu yang telah ditetapkan atau untuk sesuatu yang baru berlaku? Baginda menjawab: “Malah ia adalah untuk sesuatu yang telah ditetapkan.” Aku berkata: Maka apakah gunanya beramal wahai Rasulullah? Baginda menjawab: “Setiap orang akan dimudahkan untuk apa yang telah dia dikhaskan untuk melakukannya.”"
  },
  {
    "id": 36183,
    "hadith_number": 20,
    "tajuk_hadith": "Kesedihan Para Sahabat dan Cara Mencari Keselamatan",
    "perawi_melayu": "Daripada az-Zuhri, katanya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي رَجُلٌ، مِنْ الْأَنْصَارِ مِنْ أَهْلِ الْفِقْهِ أَنَّهُ سَمِعَ عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ يُحَدِّثُ أَنَّ رِجَالًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ تُوُفِّيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَزِنُوا عَلَيْهِ حَتَّى كَادَ بَعْضُهُمْ يُوَسْوِسُ قَالَ عُثْمَانُ وَكُنْتُ مِنْهُمْ فَبَيْنَا أَنَا جَالِسٌ فِي ظِلِّ أُطُمٍ مِنْ الْآطَامِ مَرَّ عَلَيَّ عُمَرُ رَضِيَ اللَّهُ عَنْهُ فَسَلَّمَ عَلَيَّ فَلَمْ أَشْعُرْ أَنَّهُ مَرَّ وَلَا سَلَّمَ فَانْطَلَقَ عُمَرُ حَتَّى دَخَلَ عَلَى أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَقَالَ لَهُ مَا يُعْجِبُكَ أَنِّي مَرَرْتُ عَلَى عُثْمَانَ فَسَلَّمْتُ عَلَيْهِ فَلَمْ يَرُدَّ عَلَيَّ السَّلَامَ وَأَقْبَلَ هُوَ وَأَبُو بَكْرٍ فِي وِلَايَةِ أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ حَتَّى سَلَّمَا عَلَيَّ جَمِيعًا ثُمَّ قَالَ أَبُو بَكْرٍ جَاءَنِي أَخُوكَ عُمَرُ فَذَكَرَ أَنَّهُ مَرَّ عَلَيْكَ فَسَلَّمَ فَلَمْ تَرُدَّ عَلَيْهِ السَّلَامَ فَمَا الَّذِي حَمَلَكَ عَلَى ذَلِكَ قَالَ قُلْتُ مَا فَعَلْتُ فَقَالَ عُمَرُ بَلَى وَاللَّهِ لَقَدْ فَعَلْتَ وَلَكِنَّهَا عُبِّيَّتُكُمْ يَا بَنِي أُمَيَّةَ قَالَ قُلْتُ وَاللَّهِ مَا شَعَرْتُ أَنَّكَ مَرَرْتَ وَلَا سَلَّمْتَ قَالَ أَبُو بَكْرٍ صَدَقَ عُثْمَانُ وَقَدْ شَغَلَكَ عَنْ ذَلِكَ أَمْرٌ فَقُلْتُ أَجَلْ قَالَ مَا هُوَ فَقَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ تَوَفَّى اللَّهُ عَزَّ وَجَلَّ نَبِيَّهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْلَ أَنْ نَسْأَلَهُ عَنْ نَجَاةِ هَذَا الْأَمْرِ قَالَ أَبُو بَكْرٍ قَدْ سَأَلْتُهُ عَنْ ذَلِكَ قَالَ فَقُمْتُ إِلَيْهِ فَقُلْتُ لَهُ بِأَبِي أَنْتَ وَأُمِّي أَنْتَ أَحَقُّ بِهَا قَالَ أَبُو بَكْرٍ قُلْتُ يَا رَسُولَ اللَّهِ مَا نَجَاةُ هَذَا الْأَمْرِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَبِلَ مِنِّي الْكَلِمَةَ الَّتِي عَرَضْتُ عَلَى عَمِّي فَرَدَّهَا عَلَيَّ فَهِيَ لَهُ نَجَاةٌ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu al-Yaman, katanya; telah memberitakan kepada kami Syu’aib, daripada az-Zuhri, katanya; telah memberitakan kepadaku seorang lelaki daripada kalangan Ansar yang mempunyai ilmu fiqh bahawa dia telah mendengar Uthman bin Affan r.a. menceritakan bahawa segelintir daripada sahabat Nabi SAW ketika Nabi SAW wafat, mereka bersedih sehingga hampir ada di antara mereka yang hilang akal. Uthman berkata: Aku juga antara mereka. Ketika aku sedang duduk di bawah naungan sebuah kubu kecil, Umar r.a. lalu di sisiku dan memberi salam, tetapi aku tidak menyedari bahawa dia telah lalu dan memberi salam. Maka Umar pergi sehingga masuk kepada Abu Bakar r.a. lalu berkata kepadanya: Apakah engkau rasa wajar aku lalu di sisi Uthman dan memberi salam kepadanya, tetapi dia tidak membalas salamku? Kemudian Umar dan Abu Bakar datang ketika Abu Bakar telah dilantik menjadi khalifah dan mereka berdua memberi salam kepadaku. Kemudian Abu Bakar berkata: Saudaramu Umar datang kepadaku dan memberitahu bahawa dia telah lalu di sisimu dan memberi salam, tetapi engkau tidak membalas salamnya. Apakah yang menyebabkan engkau berbuat demikian? Aku berkata: Aku tidak melakukannya. Umar berkata: Ya, demi Allah, engkau telah melakukannya, tetapi itu adalah sifat keangkuhan kamu wahai Bani Umaiyyah. Aku berkata: Demi Allah, aku tidak menyedari bahawa engkau telah lalu dan memberi salam. Abu Bakar berkata: Uthman berkata benar, sesungguhnya ada sesuatu yang telah menyibukkanmu daripada perkara itu. Aku berkata: Ya. Dia bertanya: Apakah itu? Uthman r.a. berkata: Allah SWT telah menjemput Nabi SAW sebelum kami sempat bertanya kepadanya tentang keselamatan dalam urusan ini. Abu Bakar berkata: Aku telah bertanya kepadanya mengenai perkara itu.  Aku pun pergi menghadapnya lalu berkata kepadanya: Demi ayah dan ibuku, engkau lebih berhak untuk bertanya. Abu Bakar berkata: Aku berkata: Wahai Rasulullah SAW, apakah keselamatan dalam urusan ini? Rasulullah SAW bersabda: “Barangsiapa menerima daripada aku kalimah yang telah aku sampaikan kepada bapa saudaraku, tetapi dia menolaknya, maka itulah keselamatan baginya.”"
  },
  {
    "id": 36184,
    "hadith_number": 21,
    "tajuk_hadith": "Larangan Mengutamakan Kerabat dalam Pelantikan Jawatan",
    "perawi_melayu": "Ia diriwayatkan bahawa Yazid bin Abi Sufyan berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ رَبِّهِ، قَالَ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ، قَالَ حَدَّثَنِي شَيْخٌ، مِنْ قُرَيْشٍ عَنْ رَجَاءِ بْنِ حَيْوَةَ، عَنْ جُنَادَةَ بْنِ أَبِي أُمَيَّةَ، عَنْ يَزِيدَ بْنِ أَبِي سُفْيَانَ، قَالَ قَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ حِينَ بَعَثَنِي إِلَى الشَّامِ يَا يَزِيدُ إِنَّ لَكَ قَرَابَةً عَسَيْتَ أَنْ تُؤْثِرَهُمْ بِالْإِمَارَةِ وَذَلِكَ أَكْبَرُ مَا أَخَافُ عَلَيْكَ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ وَلِيَ مِنْ أَمْرِ الْمُسْلِمِينَ شَيْئًا فَأَمَّرَ عَلَيْهِمْ أَحَدًا مُحَابَاةً فَعَلَيْهِ لَعْنَةُ اللَّهِ لَا يَقْبَلُ اللَّهُ مِنْهُ صَرْفًا وَلَا عَدْلًا حَتَّى يُدْخِلَهُ جَهَنَّمَ وَمَنْ أَعْطَى أَحَدًا حِمَى اللَّهِ فَقَدْ انْتَهَكَ فِي حِمَى اللَّهِ شَيْئًا بِغَيْرِ حَقِّهِ فَعَلَيْهِ لَعْنَةُ اللَّهِ أَوْ قَالَ تَبَرَّأَتْ مِنْهُ ذِمَّةُ اللَّهِ عَزَّ وَجَلَّ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Yazid bin Abd Rabbih, katanya; telah menceritakan kepada kami Baqiyyah bin Al Walid, katanya; telah menceritakan kepadaku seorang syekh dari Quraisy daripada Raja' bin Haiwah, daripada Junadah bin Abi Umaiyyah, daripada Yazid bin Abi Sufyan, katanya; Abu Bakar r.a. ketika mengutusku ke Syam berkata: Wahai Yazid! Sesungguhnya engkau mempunyai kaum kerabat, dan engkau mungkin akan mengutamakan mereka dalam jawatan pemerintahan, dan itulah perkara yang paling aku khuatirkan terhadapmu. Kerana sesungguhnya Rasulullah SAW telah bersabda: \"Barangsiapa yang memegang sesuatu urusan daripada urusan orang-orang Islam, kemudian dia melantik seseorang di atas mereka kerana sikap memihak, maka ke atasnya laknat Allah. Allah SWT tidak akan menerima darinya solat fardu mahupun solat sunat sehingga Dia memasukkannya ke dalam neraka Jahannam. Dan barangsiapa memberi kepada seseorang sesuatu daripada perlindungan Allah SWT, maka sesungguhnya dia telah melanggar perlindungan Allah SWT tanpa hak, maka ke atasnya laknat Allah SWT, atau baginda bersabda: Allah SWT telah berlepas diri daripadanya.\""
  },
  {
    "id": 36185,
    "hadith_number": 22,
    "tajuk_hadith": "Tujuh Puluh Ribu Masuk Syurga Tanpa Hisab",
    "perawi_melayu": "Daripada Abu Bakar as-Siddiq r.a.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، قَالَ حَدَّثَنَا الْمَسْعُودِيُّ، قَالَ حَدَّثَنِي بُكَيْرُ بْنُ الْأَخْنَسِ، عَنْ رَجُلٍ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُعْطِيتُ سَبْعِينَ أَلْفًا يَدْخُلُونَ الْجَنَّةَ بِغَيْرِ حِسَابٍ وُجُوهُهُمْ كَالْقَمَرِ لَيْلَةَ الْبَدْرِ وَقُلُوبُهُمْ عَلَى قَلْبِ رَجُلٍ وَاحِدٍ فَاسْتَزَدْتُ رَبِّي عَزَّ وَجَلَّ فَزَادَنِي مَعَ كُلِّ وَاحِدٍ سَبْعِينَ أَلْفًا قَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَرَأَيْتُ أَنَّ ذَلِكَ آتٍ عَلَى أَهْلِ الْقُرَى وَمُصِيبٌ مِنْ حَافَّاتِ الْبَوَادِي‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Hashim bin al-Qasim, katanya telah menceritakan kepada kami al-Mas’udi, katanya telah menceritakan kepadaku Bukhairah bin al-Akhnas, daripada seorang lelaki, daripada Abu Bakar as-Siddiq r.a., bahawa Rasulullah SAW bersabda:  \"Aku telah diberikan tujuh puluh ribu orang yang akan masuk syurga tanpa hisab. Wajah mereka seperti bulan pada malam purnama, dan hati mereka seperti hati seorang lelaki.  Maka aku memohon kepada Tuhanku, Yang Maha Agung dan Maha Mulia, supaya ditambah lagi, lalu Dia menambahkan lagi, bersama setiap seorang daripada mereka tujuh puluh ribu orang.\"  Abu Bakar r.a. berkata: \"Aku berpendapat bahawa ini merujuk kepada penduduk-penduduk kampung dan juga sebahagian daripada mereka yang tinggal di pinggir kawasan padang pasir.\""
  },
  {
    "id": 36186,
    "hadith_number": 23,
    "tajuk_hadith": "Balasan Kejahatan di Dunia",
    "perawi_melayu": "Daripada Ibnu Umar, katanya:",
    "english_text": "I heard Abu Bakr say: The Messenger of Allah (ﷺ) said: `Whoever does an evil deed will be requited for it in this world.`",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَطَاءٍ، عَنْ زِيَادٍ الْجَصَّاصِ، عَنْ عَلِيِّ بْنِ زَيْدٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عُمَرَ، قَالَ سَمِعْتُ أَبَا بَكْرٍ، يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ يَعْمَلْ سُوءًا يُجْزَ بِهِ فِي الدُّنْيَا‏.‏",
    "malay_translation": "Aku mendengar Abu Bakar berkata: Rasulullah SAW bersabda: \"Sesiapa yang melakukan kejahatan nescaya dia akan menerima balasannya di dunia ini.\""
  },
  {
    "id": 36187,
    "hadith_number": 24,
    "tajuk_hadith": "Kesedihan Para Sahabat Selepas Kemangkatan Rasulullah SAW",
    "perawi_melayu": "Uthman bin 'Affan meriwayatkan bahawa ketika Rasulullah SAW wafat, sebahagian daripada sahabat Nabi SAW berdukacita sehingga hampir hilang ingatan.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْقُوبُ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، قَالَ قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي رَجُلٌ، مِنْ الْأَنْصَارٍ غَيْرُ مُتَّهَمٍ أَنَّهُ سَمِعَ عُثْمَانَ بْنَ عَفَّانَ، يُحَدِّثُ أَنَّ رِجَالًا، مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَزِنُوا عَلَيْهِ حَتَّى كَادَ بَعْضُهُمْ أَنْ يُوَسْوِسَ قَالَ عُثْمَانُ فَكُنْتُ مِنْهُمْ فَذَكَرَ مَعْنَى حَدِيثِ أَبِي الْيَمَانِ عَنْ شُعَيْبٍ‏.‏",
    "malay_translation": "Ya'qub telah meriwayatkan kepada kami,  daripada bapa saudaraku, daripada Saleh, katanya, Ibnu Syihab berkata: Seorang lelaki daripada kalangan Ansar yang tidak boleh dipertikaikan kejujurannya memberitahu aku bahawa dia telah mendengar Uthman bin Affan meriwayatkan bahawa segolongan lelaki daripada sahabat-sahabat Nabi SAW ketika Rasulullah SAW wafat, mereka berdukacita sehingga hampir hilang ingatan. Uthman berkata: Aku termasuk di antara mereka.  Kemudian dia menyebut maksud hadis Abi al- Yaman daripada Syu'aib."
  },
  {
    "id": 36188,
    "hadith_number": 25,
    "tajuk_hadith": "Pewarisan Harta Nabi ﷺ dan Pertikaian Fatimah",
    "perawi_melayu": "Urwah bin az-Zubair meriwayatkan bahawa Aisyah, isteri Nabi ﷺ memberitahu bahawa Fatimah, anak perempuan Rasulullah ﷺ, meminta Abu Bakar, selepas kewafatan Rasulullah ﷺ, untuk memberikan bahagian pusakanya daripada harta yang ditinggalkan oleh Rasulullah ﷺ, daripada fai’ yang Allah SWT anugerahkan kepadanya.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْقُوبُ، قَالَ حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، رَضِيَ اللَّهُ عَنْهَا زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَتْهُ أَنَّ فَاطِمَةَ بِنْتَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَأَلَتْ أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ بَعْدَ وَفَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَقْسِمَ لَهَا مِيرَاثَهَا مِمَّا تَرَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِمَّا أَفَاءَ اللَّهُ عَلَيْهِ فَقَالَ لَهَا أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا نُورَثُ مَا تَرَكْنَا صَدَقَةٌ فَغَضِبَتْ فَاطِمَةُ عَلَيْهَا السَّلَام فَهَجَرَتْ أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَلَمْ تَزَلْ مُهَاجِرَتَهُ حَتَّى تُوُفِّيَتْ قَالَ وَعَاشَتْ بَعْدَ وَفَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سِتَّةَ أَشْهُرٍ قَالَ وَكَانَتْ فَاطِمَةُ رَضِيَ اللَّهُ عَنْهَا تَسْأَلُ أَبَا بَكْرٍ نَصِيبَهَا مِمَّا تَرَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ خَيْبَرَ وَفَدَكَ وَصَدَقَتِهِ بِالْمَدِينَةِ فَأَبَى أَبُو بَكْرٍ عَلَيْهَا ذَلِكَ وَقَالَ لَسْتُ تَارِكًا شَيْئًا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْمَلُ بِهِ إِلَّا عَمِلْتُ بِهِ وَإِنِّي أَخْشَى إِنْ تَرَكْتُ شَيْئًا مِنْ أَمْرِهِ أَنْ أَزِيغَ فَأَمَّا صَدَقَتُهُ بِالْمَدِينَةِ فَدَفَعَهَا عُمَرُ إِلَى عَلِيٍّ وَعَبَّاسٍ فَغَلَبَهُ عَلَيْهَا عَلِيٌّ وَأَمَّا خَيْبَرُ وَفَدَكُ فَأَمْسَكَهُمَا عُمَرُ رَضِيَ اللَّهُ عَنْهُ وَقَالَ هُمَا صَدَقَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَتَا لِحُقُوقِهِ الَّتِي تَعْرُوهُ وَنَوَائِبِهِ وَأَمْرُهُمَا إِلَى مَنْ وَلِيَ الْأَمْرَ قَالَ فَهُمَا عَلَى ذَلِكَ الْيَوْمَ‏.‏",
    "malay_translation": "Ya'qub meriwayatkan daripada bapanya, daripada Shalih, bahawa Ibnu Syihab memberitahu aku daripada Urwah bin Zubair, bahawa Aisyah, isteri Nabi ﷺ, menceritakan bahawa Fatimah, anak perempuan Rasulullah ﷺ, meminta Abu Bakar selepas kewafatan Rasulullah ﷺ untuk membahagikan kepadanya harta pusakanya daripada apa yang ditinggalkan oleh Rasulullah ﷺ daripada harta rampasan perang yang Allah SWT kurniakan kepada baginda. Abu Bakar berkata kepadanya, “Sesungguhnya Rasulullah ﷺ bersabda: Kami (para Nabi) tidak mewarisi harta, apa sahaja yang kami tinggalkan adalah sedekah.” Fatimah radhiallahu ‘anha marah dan memboikot Abu Bakar sehingga beliau meninggal dunia. Fatimah hidup selama enam bulan selepas kewafatan Rasulullah ﷺ, dan beliau sentiasa meminta kepada Abu Bakar bahagiannya daripada harta yang ditinggalkan oleh Rasulullah ﷺ daripada Khaibar, Fadak dan sedekahnya di Madinah, tetapi Abu Bakar enggan memberikannya. Abu Bakar berkata: Aku tidak akan meninggalkan sesuatu amalan yang dilakukan oleh Rasulullah ﷺ melainkan aku akan meneruskannya. Aku bimbang sekiranya aku meninggalkan sesuatu daripada amalan baginda, aku akan sesat. Adapun sedekah baginda di Madinah, Umar menyerahkannya kepada Ali dan Abbas, tetapi Ali mengambil sebahagian besarnya. Adapun Khaibar dan Fadak, Umar menyimpannya dan berkata: Ianya adalah sedekah Rasulullah ﷺ, untuk menampung perbelanjaan dan keperluan baginda serta kecemasan yang dihadapinya, dan pentadbirannya diserahkan kepada pemerintah. Dan hingga kini masih begitu."
  },
  {
    "id": 36189,
    "hadith_number": 26,
    "tajuk_hadith": "Rasulullah SAW: Pengharapan Orang Miskin dan Pelindung Janda",
    "perawi_melayu": "Daripada Aisyah ra.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَسَنُ بْنُ مُوسَى، وَعَفَّانُ، قَالَا حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ عَلِيِّ بْنِ زَيْدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، رَضِيَ اللَّهُ عَنْهَا أَنَّهَا تَمَثَّلَتْ بِهَذَا الْبَيْتِ وَأَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ يَقْضِي وَأَبْيَضَ يُسْتَسْقَى الْغَمَامُ بِوَجْهِهِ رَبِيعُ الْيَتَامَى عِصْمَةٌ لِلْأَرَامِلِ فَقَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ ذَاكَ وَاللَّهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Hasan bin Musa dan Affan, keduanya berkata: Telah menceritakan kepada kami Hammad bin Salamah, dari Ali bin Zaid, dari Al-Qasim bin Muhammad, dari Aisyah r.a. bahawa beliau telah melafazkan bait syair ini ketika Abu Bakar r.a. sedang nazak:  \"Seorang lelaki berkulit putih yang dengan wajahnya hujan didoakan, harapan bagi anak yatim, dan perlindungan bagi balu.\" Maka Abu Bakar r.a. berkata: Demi Allah, yang dimaksudkan ialah Rasulullah SAW."
  },
  {
    "id": 36190,
    "hadith_number": 27,
    "tajuk_hadith": "Pengkebumian Nabi SAW",
    "perawi_melayu": "Ibnu Juraij berkata:",
    "english_text": "My father told me that the Companions of the Prophet (ﷺ) did not know where to bury the Prophet (ﷺ) until Abu Bakr said: I heard the Messenger of Allah (ﷺ) say: `A Prophet is not to be buried except where he died.” So they removed his bed and dug a grave for him beneath",
    "arabic_text": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَخْبَرَنِي ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي أَبِي أَنَّ أَصْحَابَ النَّبِيِّ، صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَدْرُوا أَيْنَ يَقْبُرُونَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى قَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَنْ يُقْبَرَ نَبِيٌّ إِلَّا حَيْثُ يَمُوتُ فَأَخَّرُوا فِرَاشَهُ وَحَفَرُوا لَهُ تَحْتَ فِرَاشِهِ‏.‏",
    "malay_translation": "Bapa saya memberitahu saya bahawa para sahabat Nabi ﷺ tidak mengetahui di mana hendak mengebumikan Nabi ﷺ sehingga Abu Bakar berkata: Saya mendengar Rasulullah ﷺ bersabda: “Tidaklah seorang nabi dikebumikan melainkan di tempat dia meninggal dunia.” Maka mereka mengalihkan tilam baginda dan menggali kubur untuk baginda di bawahnya."
  },
  {
    "id": 36191,
    "hadith_number": 28,
    "tajuk_hadith": "Doa untuk Solat",
    "perawi_melayu": "Daripada Abu Bakar As-Siddiq r.a. bahawa beliau berkata kepada Rasulullah SAW:",
    "english_text": "Teach me a du'a` that I may say in my prayer. He said: `Say: O Allah. I have wronged myself greatly and no one forgives sins except You, so grant me forgiveness from You and have mercy on me, for You are the Oft-Forgiving, Most Merciful.`",
    "arabic_text": "حَدَّثَنَا حَجَّاجٌ، قَالَ حَدَّثَنَا لَيْثٌ، قَالَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، رَضِيَ اللَّهُ عَنْهُ أَنَّهُ قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلِّمْنِي دُعَاءً أَدْعُو بِهِ فِي صَلَاتِي قَالَ قُلْ اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ‏.‏",
    "malay_translation": "Daripada Abu Bakar As-Siddiq r.a., bahawa beliau berkata kepada Rasulullah SAW: “Ajarkanlah kepadaku satu doa yang boleh aku baca dalam solatku.” Baginda SAW bersabda: “Katakanlah: Ya Allah, sesungguhnya aku telah menganiaya diriku sendiri dengan aniaya yang banyak, dan tiada sesiapa yang mengampunkan dosa melainkan Engkau. Oleh itu, ampunkanlah bagiku ampunan daripada sisi-Mu dan rahmatilah aku. Sesungguhnya Engkaulah Yang Maha Pengampun, lagi Maha Mengasihani.”"
  },
  {
    "id": 36192,
    "hadith_number": 29,
    "tajuk_hadith": "Tanggungjawab Umat Menangani Kezaliman",
    "perawi_melayu": "Daripada Qais",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَمَّادُ بْنُ أُسَامَةَ، قَالَ أَخْبَرَنَا إِسْمَاعِيلُ، عَنْ قَيْسٍ، قَالَ قَامَ أَبُو بَكْرٍ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ يَا أَيُّهَا النَّاسُ إِنَّكُمْ تَقْرَءُونَ هَذِهِ الْآيَةَ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا عَلَيْكُمْ أَنْفُسَكُمْ‏}‏ حَتَّى أَتَى عَلَى آخِرِ الْآيَةِ أَلَا وَإِنَّ النَّاسَ إِذَا رَأَوْا الظَّالِمَ لَمْ يَأْخُذُوا عَلَى يَدَيْهِ أَوْشَكَ اللَّهُ أَنْ يَعُمَّهُمْ بِعِقَابِهِ أَلَا وَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ النَّاسَ وَقَالَ مَرَّةً أُخْرَى وَإِنَّا سَمِعْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Hammad bin Usamah, dia berkata; telah menceritakan kepada kami Ismail, daripada Qais, dia berkata; Abu Bakar bangun lalu memuji dan mensyukuri Allah, kemudian dia berkata: Wahai sekalian manusia, sesungguhnya kamu membaca ayat ini: {Wahai orang-orang yang beriman, jagalah diri kamu…} sehingga sampai ke penghujung ayat itu. Ketahuilah, sekiranya manusia melihat orang yang melakukan kezaliman tetapi mereka tidak menghalangnya, maka Allah SWT hampir-hampir akan menimpakan azab kepada mereka semua. Ketahuilah, sesungguhnya aku mendengar Rasulullah SAW bersabda: Sesungguhnya manusia… dan pada satu lagi kesempatan baginda SAW bersabda: Sesungguhnya kami mendengar Rasulullah SAW."
  },
  {
    "id": 36193,
    "hadith_number": 30,
    "tajuk_hadith": "Tanggungjawab Menangani Kejahatan",
    "perawi_melayu": "Daripada Abu Bakar As-Siddiq r.a.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، قَالَ أَخْبَرَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، رَضِيَ اللَّهُ عَنْهُ قَالَ أَيُّهَا النَّاسُ إِنَّكُمْ تَقْرَءُونَ هَذِهِ الْآيَةَ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا عَلَيْكُمْ أَنْفُسَكُمْ لَا يَضُرُّكُمْ مَنْ ضَلَّ إِذَا اهْتَدَيْتُمْ‏}‏ وَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ النَّاسَ إِذَا رَأَوْا الظَّالِمَ فَلَمْ يَأْخُذُوا عَلَى يَدَيْهِ أَوْشَكَ أَنْ يَعُمَّهُمْ اللَّهُ بِعِقَابِهِ‏.‏",
    "malay_translation": "Daripada Yazid bin Harun, katanya: telah memberitakan kepada kami Ismail bin Abi Khalid, daripada Qais bin Abi Hazim, daripada Abu Bakar As-Siddiq r.a., katanya: Wahai manusia, sesungguhnya kamu membaca ayat ini: {“Wahai orang-orang yang beriman, jagalah diri kamu; tidaklah ia akan memudaratkan kamu jika kamu telah mendapat hidayah”} dan sesungguhnya aku telah mendengar Rasulullah SAW bersabda: “Sesungguhnya jika manusia melihat orang yang zalim, kemudian mereka tidak mencegahnya, maka Allah SWT hampir-hampir akan menimpakan azab kepada mereka semua.”"
  },
  {
    "id": 36194,
    "hadith_number": 31,
    "tajuk_hadith": "Tidak Masuk Syurga Bagi yang Menzalimi Hamba",
    "perawi_melayu": "Daripada Farqad as-Sabakhi dan 'Affan, daripada Murrah at-Tayyib, daripada Abu Bakar as-Siddiq رضي الله عنه, daripada Nabi SAW.",
    "english_text": "Hammam told us: Farqad told us from Murrah at-Tayyib from Abu Bakr as-Siddeeq that the Prophet (ﷺ) said: `No one who mistreats his slaves will enter Paradise.”",
    "arabic_text": "حَدَّثَنَا يَزِيدُ، قَالَ أَخْبَرَنَا هَمَّامٌ، عَنْ فَرْقَدٍ السَّبَخِيِّ، وَعَفَّانُ، قَالَا حَدَّثَنَا مُرَّةُ الطَّيِّبُ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَدْخُلُ الْجَنَّةَ سَيِّئُ الْمَلَكَةِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Yazid, katanya: telah memberitakan kepada kami Hammam, daripada Farqad as-Sabakhi dan Affan, mereka berdua berkata: telah menceritakan kepada kami Murrah at-Tayyib, daripada Abu Bakar as-Siddiq رضي الله عنه, daripada Nabi SAW, baginda bersabda:  \"Tidak akan masuk syurga sesiapa yang melayan hambanya dengan buruk.\""
  },
  {
    "id": 36195,
    "hadith_number": 32,
    "tajuk_hadith": "Syarat Masuk Syurga dan Keutamaan Hamba yang Taat",
    "perawi_melayu": "Daripada Farqad as-Sabakhi daripada Murrah at-Tayyib daripada Abu Bakr as-Siddiq r.a. bahawa Nabi SAW bersabda:",
    "english_text": "“No one will enter Paradise who is treacherous, miserly, reminds people of his favours or mistreats his slaves. The first to enter Paradise will be the slave, if he obeys Allah and obeys his master.`",
    "arabic_text": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا صَدَقَةُ بْنُ مُوسَى، عَنْ فَرْقَدٍ السَّبَخِيِّ، عَنْ مُرَّةَ الطَّيِّبِ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَدْخُلُ الْجَنَّةَ خَبٌّ وَلَا بَخِيلٌ وَلَا مَنَّانٌ وَلَا سَيِّئُ الْمَلَكَةِ وَأَوَّلُ مَنْ يَدْخُلُ الْجَنَّةَ الْمَمْلُوكُ إِذَا أَطَاعَ اللَّهَ وَأَطَاعَ سَيِّدَهُ‏.‏",
    "malay_translation": "“Tiada sesiapa yang akan masuk syurga melainkan orang yang amanah, pemurah, tidak menunjukkan jasa dan tidak menganiaya hambanya. Orang pertama yang akan masuk syurga ialah hamba sahaya, jika dia taat kepada Allah dan taat kepada tuannya.”"
  },
  {
    "id": 36196,
    "hadith_number": 33,
    "tajuk_hadith": "Kemunculan Dajjal dari Khurasan",
    "perawi_melayu": "Daripada Amr bin Huraith bahawa Abu Bakar as-Siddiq telah sembuh daripada sakitnya dan keluar menemui orang ramai.  Beliau meminta maaf atas sesuatu dan berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا رَوْحٌ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ أَبِي التَّيَّاحِ، عَنِ الْمُغِيرَةِ بْنِ سُبَيْعٍ، عَنْ عَمْرِو بْنِ حُرَيْثٍ، أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ، رَضِيَ اللَّهُ عَنْهُ أَفَاقَ مِنْ مَرْضَةٍ لَهُ فَخَرَجَ إِلَى النَّاسِ فَاعْتَذَرَ بِشَيْءٍ وَقَالَ مَا أَرَدْنَا إِلَّا الْخَيْرَ ثُمَّ قَالَ حَدَّثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ الدَّجَّالَ يَخْرُجُ مِنْ أَرْضٍ بِالْمَشْرِقِ يُقَالُ لَهَا خُرَاسَانُ يَتْبَعُهُ أَقْوَامٌ كَأَنَّ وُجُوهَهُمْ الْمَجَانُّ الْمُطْرَقَةُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ruh, berkata; Telah menceritakan kepada kami Said bin Abi ‘Aruabah, dari Abi at-Taiyah, dari al-Mughirah bin Sube’, dari ‘Amr bin Huraith, bahawa Abu Bakar ash-Shiddiq r.a. telah sedar daripada penyakitnya, lalu keluar kepada masyarakat.  Beliau memohon maaf atas sesuatu dan berkata, \"Kami tidak bermaksud melainkan kebaikan.\" Kemudian beliau berkata, \"Rasulullah SAW telah memberitahu kami bahawa Dajjal akan keluar dari sebuah tanah di sebelah timur yang dikenali sebagai Khurasan, dan akan diikuti oleh sekumpulan orang yang wajah mereka seakan-akan perisai yang telah ditempa.\""
  },
  {
    "id": 36197,
    "hadith_number": 34,
    "tajuk_hadith": "Nasihat Abu Bakar As-Siddiq: Kejujuran, Persaudaraan, dan Menjauhi Kemungkaran",
    "perawi_melayu": "Ia diriwayatkan bahawa Yazid bin Khumair berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا رَوْحٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ يَزِيدَ بْنِ خُمَيْرٍ، قَالَ سَمِعْتُ سُلَيْمَ بْنَ عَامِرٍ، رَجُلًا مِنْ أَهْلِ حِمْصَ وَكَانَ قَدْ أَدْرَكَ أَصْحَابَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ مَرَّةً قَالَ سَمِعْتُ أَوْسَطَ الْبَجَلِيَّ عَنْ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ قَالَ سَمِعْتُهُ يَخْطُبُ النَّاسَ وَقَالَ مَرَّةً حِينَ اسْتُخْلِفَ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ عَامَ الْأَوَّلِ مَقَامِي هَذَا وَبَكَى أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَقَالَ أَسْأَلُ اللَّهَ الْعَفْوَ وَالْعَافِيَةَ فَإِنَّ النَّاسَ لَمْ يُعْطَوْا بَعْدَ الْيَقِينِ شَيْئًا خَيْرًا مِنْ الْعَافِيَةِ وَعَلَيْكُمْ بِالصِّدْقِ فَإِنَّهُ فِي الْجَنَّةِ وَإِيَّاكُمْ وَالْكَذِبَ فَإِنَّهُ مَعَ الْفُجُورِ وَهُمَا فِي النَّارِ وَلَا تَقَاطَعُوا وَلَا تَبَاغَضُوا وَلَا تَحَاسَدُوا وَلَا تَدَابَرُوا وَكُونُوا إِخْوَانًا كَمَا أَمَرَكُمْ اللَّهُ عَزَّ وَجَلَّ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Roh, berkata; telah menceritakan kepada kami Syu'bah, dari Yazid bin Khumair, dia berkata; aku mendengar Sulaim bin Amir, seorang lelaki dari penduduk Hims yang telah sampai kepada zaman para sahabat Rasulullah SAW, dan dia berkata suatu ketika: Aku mendengar Ausath Al-Bajali meriwayatkan dari Abu Bakar As-Siddiq RA, dia berkata; aku mendengarnya berkhutbah kepada manusia. Dan dia berkata suatu ketika lain ketika dilantik sebagai Khalifah, maka dia berkata: Sesungguhnya Rasulullah SAW berdiri pada tahun pertama di tempatku sekarang ini. Lalu Abu Bakar RA menangis, lalu dia berkata; aku memohon kepada Allah ampunan dan kesejahteraan, sesungguhnya manusia tidak diberikan sesudah kepastian iman sesuatu yang lebih baik daripada kesejahteraan. Dan hendaklah kamu berpegang teguh kepada kejujuran, sesungguhnya ia menuju syurga, dan jauhilah kamu daripada dusta, sesungguhnya ia bersama dengan kefasikan dan keduanya menuju neraka. Dan janganlah kamu memutuskan silaturahim, dan janganlah kamu saling membenci, dan janganlah kamu saling dengki, dan janganlah kamu saling berpaling belakang, dan hendaklah kamu menjadi saudara-saudara seperti yang diperintahkan Allah SWT kepada kamu."
  },
  {
    "id": 36198,
    "hadith_number": 35,
    "tajuk_hadith": "Membaca Al-Quran sepertimana ia diturunkan",
    "perawi_melayu": "Daripada 'Asim daripada Zirr daripada Abdullah bahawa Abu Bakar dan Umar telah memberikan khabar gembira kepadanya bahawa Rasulullah SAW telah bersabda:",
    "english_text": "`Whoever would like to recite the Qur'an fresh as it was revealed, let him recite it according to the recitation of Ibn Umm 'Abd.`\n\nUmar bin al-Khattab narrated that the Prophet (ﷺ) said... a similar report, in which he said: crisp or fresh.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ آدَمَ، قَالَ حَدَّثَنَا أَبُو بَكْرٍ يَعْنِي ابْنَ عَيَّاشٍ، عَنْ عَاصِمٍ، عَنْ زِرٍّ، عَنْ عَبْدِ اللَّهِ، أَنَّ أَبَا بَكْرٍ، وَعُمَرَ، رَضِيَ اللَّهُ عَنْهُمَا بَشَّرَاهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ سَرَّهُ أَنْ يَقْرَأَ الْقُرْآنَ غَضًّا كَمَا أُنْزِلَ فَلْيَقْرَأْهُ عَلَى قِرَاءَةِ ابْنِ أُمِّ عَبْدٍ\n\nقَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا أَبُو بَكْرٍ وَيَزِيدُ بْنُ عَبْدِ الْعَزِيزِ عَنِ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ قَالَ غَضًّا أَوْ رَطْبًا‏.‏",
    "malay_translation": "Sesiapa yang ingin membaca Al-Quran dengan segar sepertimana ia diturunkan, maka hendaklah dia membacanya mengikut bacaan Ibn Umm Abd. \n\nUmar bin al-Khattab meriwayatkan bahawa Nabi SAW bersabda…  sebuah riwayat yang serupa, di mana baginda bersabda: segar atau baru."
  },
  {
    "id": 36199,
    "hadith_number": 36,
    "tajuk_hadith": "Menyampaikan Kalimat yang Dapat Menyelamatkan dari Bisikan Syaitan",
    "perawi_melayu": "Daripada Muhammad bin Jubair bin Mut'im bahawa Uthman berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو سَعِيدٍ، مَوْلَى بَنِي هَاشِمٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، وَسَعِيدُ بْنُ سَلَمَةَ بْنِ أَبِي الْحُسَامِ، عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو، عَنْ أَبِي الْحُوَيْرِثِ، عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، أَنَّ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ تَمَنَّيْتُ أَنْ أَكُونَ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَاذَا يُنْجِينَا مِمَّا يُلْقِي الشَّيْطَانُ فِي أَنْفُسِنَا فَقَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ قَدْ سَأَلْتُهُ عَنْ ذَلِكَ فَقَالَ يُنْجِيكُمْ مِنْ ذَلِكَ أَنْ تَقُولُوا مَا أَمَرْتُ عَمِّي أَنْ يَقُولَهُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Said, hamba Bani Hashim, telah menceritakan kepada kami Abdul Aziz bin Muhammad, dan Said bin Salamah bin Abi al-Husam, daripada Amru bin Abi Amru, daripada Abi Huwairth, daripada Muhammad bin Jubair bin Mutim, bahawa Uthman r.a. berkata:  Aku berharap aku telah bertanya kepada Rasulullah SAW apakah yang dapat menyelamatkan kami daripada bisikan syaitan dalam hati kami.  Lalu Abu Bakar r.a. berkata: Aku telah bertanya kepadanya tentang perkara itu, maka baginda menjawab:  Yang dapat menyelamatkan kamu daripada bisikan syaitan itu ialah dengan menyebut apa yang aku perintahkan kepada bapa saudaraku untuk menyebutkannya, tetapi dia tidak menyebutkannya."
  },
  {
    "id": 36200,
    "hadith_number": 37,
    "tajuk_hadith": "Keimanan dan Kesejahteraan",
    "perawi_melayu": "Daripada al-Hasan bahawa Abu Bakar telah menyampaikan khutbah kepada manusia dan berkata:",
    "english_text": "The Messenger of Allah (ﷺ) said: `O people, the people are not given anything better in this world than certainty of faith and well-being, so ask Allah, may He be glorified and exalted, for them.`",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ يُونُسَ، عَنِ الْحَسَنِ، أَنَّ أَبَا بَكْرٍ، رَضِيَ اللَّهُ عَنْهُ خَطَبَ النَّاسَ فَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَيُّهَا النَّاسُ إِنَّ النَّاسَ لَمْ يُعْطَوْا فِي الدُّنْيَا خَيْرًا مِنْ الْيَقِينِ وَالْمُعَافَاةِ فَسَلُوهُمَا اللَّهَ عَزَّ وَجَلَّ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: “Wahai manusia, sesungguhnya manusia tidak diberikan sesuatu yang lebih baik di dunia ini daripada keimanan yang teguh dan kesejahteraan. Oleh itu, mintalah kedua-duanya daripada Allah SWT.”"
  },
  {
    "id": 36201,
    "hadith_number": 38,
    "tajuk_hadith": "Penggalian Kubur Rasulullah SAW",
    "perawi_melayu": "Daripada Ibnu Abbas r.a.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، قَالَ وَحَدَّثَنِي حُسَيْنُ بْنُ عَبْدِ اللَّهِ، عَنْ عِكْرِمَةَ، مَوْلَى ابْنِ عَبَّاسٍ عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمَّا أَرَادُوا أَنْ يَحْفِرُوا، لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ يَضْرَحُ كَحَفْرِ أَهْلِ مَكَّةَ وَكَانَ أَبُو طَلْحَةَ زَيْدُ بْنُ سَهْلٍ يَحْفِرُ لِأَهْلِ الْمَدِينَةِ فَكَانَ يَلْحَدُ فَدَعَا الْعَبَّاسُ رَجُلَيْنِ فَقَالَ لِأَحَدِهِمَا اذْهَبْ إِلَى أَبِي عُبَيْدَةَ وَلِلْآخَرِ اذْهَبْ إِلَى أَبِي طَلْحَةَ اللَّهُمَّ خِرْ لِرَسُولِكَ قَالَ فَوَجَدَ صَاحِبُ أَبِي طَلْحَةَ أَبَا طَلْحَةَ فَجَاءَ بِهِ فَلَحَدَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ya'qub bin Ibrahim, telah menceritakan kepada kami ayahku, dari Ibnu Ishaq, katanya; dan telah menceritakan kepadaku Husein bin Abdullah, dari 'Ikrimah, hamba sahaya Ibnu Abbas dari Ibnu Abbas r.a., katanya: “Ketika mereka hendak menggali kubur untuk Rasulullah SAW, Abu Ubaidah bin al-Jarrah biasa menggali kubur seperti cara orang Mekah, dan Abu Talhah Zaid bin Sahl biasa menggali kubur untuk penduduk Madinah, maka dia membuat liang (lorong) di sisi kubur.  Lalu al-Abbas memanggil dua orang lelaki, lalu berkata kepada seorang dari mereka: “Pergilah kepada Abu Ubaidah”, dan kepada yang lain: “Pergilah kepada Abu Talhah”. Ya Allah, pilihlah untuk Rasul-Mu.  Maka sahabat Abu Talhah menemui Abu Talhah, lalu dia datang dan menggali kubur dengan liang di sisinya untuk Rasulullah SAW.”"
  },
  {
    "id": 36202,
    "hadith_number": 39,
    "tajuk_hadith": "Abu Bakar dan Hasan bin Ali",
    "perawi_melayu": "Uqbah bin al-Harith berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، حَدَّثَنَا عُمَرُ بْنُ سَعِيدٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، أَخْبَرَنِي عُقْبَةُ بْنُ الْحَارِثِ، قَالَ خَرَجْتُ مَعَ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ مِنْ صَلَاةِ الْعَصْرِ بَعْدَ وَفَاةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِلَيَالٍ وَعَلِيٌّ عَلَيْهِ السَّلَام يَمْشِي إِلَى جَنْبِهِ فَمَرَّ بِحَسَنِ بْنِ عَلِيٍّ يَلْعَبُ مَعَ غِلْمَانٍ فَاحْتَمَلَهُ عَلَى رَقَبَتِهِ وَهُوَ يَقُولُ وَا بِأَبِي شَبَهُ النَّبِيِّ لَيْسَ شَبِيهًا بِعَلِيِّ قَالَ وَعَلِيٌّ يَضْحَكُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Abdullah bin Az-Zubair, telah menceritakan kepada kami Umar bin Said, dari Ibnu Abi Mulaikah, telah memberitakan kepadaku Uqbah bin Al-Harits, dia berkata: Aku keluar bersama Abu Bakar As-Siddiq r.a. setelah solat Asar beberapa malam setelah wafatnya Nabi SAW, dan Ali a.s. berjalan di sisinya. Maka mereka lalu melewati Hasan bin Ali yang sedang bermain dengan kanak-kanak.  Lalu Abu Bakar mengangkatnya ke atas bahunya sambil berkata: “Demi ayahku, dia (Hasan) rupa seperti Nabi SAW, dan tidak serupa dengan Ali.”  Ali pun tersenyum."
  },
  {
    "id": 36203,
    "hadith_number": 40,
    "tajuk_hadith": "Kisah Ma'iz bin Malik dan Hukuman Rajam",
    "perawi_melayu": "Dari Jabir daripada Abdur-Rahman bin Abza bahawa Abu Bakar berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ جَابِرٍ، عَنْ عَامِرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِي بَكْرٍ، قَالَ كُنْتُ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَالِسًا فَجَاءَ مَاعِزُ بْنُ مَالِكٍ فَاعْتَرَفَ عِنْدَهُ مَرَّةً فَرَدَّهُ ثُمَّ جَاءَهُ فَاعْتَرَفَ عِنْدَهُ الثَّانِيَةَ فَرَدَّهُ ثُمَّ جَاءَهُ فَاعْتَرَفَ الثَّالِثَةَ فَرَدَّهُ فَقُلْتُ لَهُ إِنَّكَ إِنْ اعْتَرَفْتَ الرَّابِعَةَ رَجَمَكَ قَالَ فَاعْتَرَفَ الرَّابِعَةَ فَحَبَسَهُ ثُمَّ سَأَلَ عَنْهُ فَقَالُوا مَا نَعْلَمُ إِلَّا خَيْرًا قَالَ فَأَمَرَ بِرَجْمِهِ‏.‏",
    "malay_translation": "Aku duduk bersama Nabi ﷺ, maka datanglah Ma'iz bin Malik lalu mengaku (zina) di hadapan Baginda sekali, lalu Baginda membiarkannya pergi. Kemudian dia datang lagi dan mengaku di hadapan Baginda untuk kali kedua, lalu Baginda membiarkannya pergi. Kemudian dia datang lagi dan mengaku untuk kali ketiga, lalu Baginda membiarkannya pergi. Maka aku berkata kepadanya: “Jika engkau mengaku untuk kali keempat, nescaya Baginda akan merajam engkau.” Dia berkata, “Kemudian dia mengaku untuk kali keempat, lalu Baginda menahannya dan bertanya tentangnya, lalu mereka berkata: “Kami tidak tahu melainkan kebaikan tentangnya.” Maka Baginda memerintahkan supaya dia dirajam."
  },
  {
    "id": 36204,
    "hadith_number": 41,
    "tajuk_hadith": "Bai'ah kepada Abu Bakar",
    "perawi_melayu": "Daripada riwayat Rafi' al-Ta'i, sahabat Abu Bakar ketika Perang Salasil, katanya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، قَالَ أَخْبَرَنِي يَزِيدُ بْنُ سَعِيدِ بْنِ ذِي، عَصْوَانَ الْعَنْسِيُّ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ اللَّخْمِيِّ، عَنْ رَافِعٍ الطَّائِيِّ، رَفِيقِ أَبِي بَكْرٍ فِي غَزْوَةِ السُّلَاسِلِ قَالَ وَسَأَلْتُهُ عَمَّا قِيلَ مِنْ بَيْعَتِهِمْ فَقَالَ وَهُوَ يُحَدِّثُهُ عَمَّا تَكَلَّمَتْ بِهِ الْأَنْصَارُ وَمَا كَلَّمَهُمْ بِهِ وَمَا كَلَّمَ بِهِ عُمَرُ بْنُ الْخَطَّابِ الْأَنْصَارَ وَمَا ذَكَّرَهُمْ بِهِ مِنْ إِمَامَتِي إِيَّاهُمْ بِأَمْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَرَضِهِ فَبَايَعُونِي لِذَلِكَ وَقَبِلْتُهَا مِنْهُمْ وَتَخَوَّفْتُ أَنْ تَكُونَ فِتْنَةٌ تَكُونُ بَعْدَهَا رِدَّةٌ‏.‏",
    "malay_translation": "Aku bertanya kepadanya tentang bagaimana mereka memberi bai'ah kepada Abu Bakar, lalu katanya – ketika menceritakan apa yang dikatakan oleh Ansar dan apa yang dikatakan Abu Bakar kepada mereka, dan apa yang dikatakan Umar bin al-Khattab kepada Ansar ketika dia mengingatkan mereka tentang kepemimpinannya dalam solat atas arahan Rasulullah SAW ketika sakit.  Mereka memberi bai'ah kepadaku kerana itu, dan aku menerimanya daripada mereka. Namun, aku bimbang akan timbul fitnah yang seterusnya menyebabkan kemurtadan."
  },
  {
    "id": 36205,
    "hadith_number": 42,
    "tajuk_hadith": "Khalid bin al-Walid: Pedang Allah",
    "perawi_melayu": "Daripada Wahsyi bin Harb bahawa Abu Bakar telah melantik Khalid bin al-Walid sebagai panglima untuk memerangi orang-orang murtad dan beliau berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنِي وَحْشِيُّ بْنُ حَرْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، وَحْشِيِّ بْنِ حَرْبٍ، أَنَّ أَبَا بَكْرٍ، رَضِيَ اللَّهُ عَنْهُ عَقَدَ لِخَالِدِ بْنِ الْوَلِيدِ عَلَى قِتَالِ أَهْلِ الرِّدَّةِ وَقَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ نِعْمَ عَبْدُ اللَّهِ وَأَخُو الْعَشِيرَةِ خَالِدُ بْنُ الْوَلِيدِ وَسَيْفٌ مِنْ سُيُوفِ اللَّهِ سَلَّهُ اللَّهُ عَزَّ وَجَلَّ عَلَى الْكُفَّارِ وَالْمُنَافِقِينَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ali bin Ayasy, telah menceritakan kepada kami Walid bin Muslim, telah menceritakan kepadaku Wahsyi bin Harb, daripada bapanya, daripada datuknya, Wahsyi bin Harb, bahawa Abu Bakar r.a. telah melantik Khalid bin al-Walid untuk memerangi orang-orang murtad dan beliau berkata: Sesungguhnya aku telah mendengar Rasulullah SAW bersabda: “Alangkah baiknya hamba Allah dan saudara sepupu Khalid bin al-Walid!  Dia adalah salah satu pedang Allah yang telah Allah SWT keluarkan untuk memerangi orang-orang kafir dan munafik.”"
  },
  {
    "id": 36206,
    "hadith_number": 43,
    "tajuk_hadith": "Doa Kesejahteraan dan Amaran terhadap Dusta",
    "perawi_melayu": "Mu'awiyah bin Salih meriwayatkan daripada Sulaim bin 'Amir al-Kala'i, bahawa Awsat bin 'Amr berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا مُعَاوِيَةُ يَعْنِي ابْنَ صَالِحٍ، عَنْ سُلَيْمِ بْنِ عَامِرٍ الْكَلَاعِيِّ، عَنْ أَوْسَطَ بْنِ عَمْرٍو، قَالَ قَدِمْتُ الْمَدِينَةَ بَعْدَ وَفَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَنَةٍ فَأَلْفَيْتُ أَبَا بَكْرٍ يَخْطُبُ النَّاسَ فَقَالَ قَامَ فِينَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْأَوَّلِ فَخَنَقَتْهُ الْعَبْرَةُ ثَلَاثَ مِرَارٍ ثُمَّ قَالَ يَا أَيُّهَا النَّاسُ سَلُوا اللَّهَ الْمُعَافَاةَ فَإِنَّهُ لَمْ يُؤْتَ أَحَدٌ مِثْلَ يَقِينٍ بَعْدَ مُعَافَاةٍ وَلَا أَشَدَّ مِنْ رِيبَةٍ بَعْدَ كُفْرٍ وَعَلَيْكُمْ بِالصِّدْقِ فَإِنَّهُ يَهْدِي إِلَى الْبِرِّ وَهُمَا فِي الْجَنَّةِ وَإِيَّاكُمْ وَالْكَذِبَ فَإِنَّهُ يَهْدِي إِلَى الْفُجُورِ وَهُمَا فِي النَّارِ‏.‏",
    "malay_translation": "Aku tiba di Madinah setahun selepas kewafatan Rasulullah SAW dan aku mendapati Abu Bakar sedang menyampaikan khutbah kepada masyarakat.  Beliau berkata: Rasulullah SAW telah berdiri di hadapan kita pada tahun sebelumnya... dan air mata baginda mengalir sebanyak tiga kali, kemudian baginda bersabda: Wahai manusia, mintalah kepada Allah kesejahteraan, kerana sesungguhnya tiada sesiapa yang diberikan sesuatu seperti keyakinan selepas kesejahteraan, dan tiada yang lebih buruk daripada keraguan selepas kekafiran.  Hendaklah kamu benar, kerana kejujuran itu menunjuk kepada kebajikan dan keduanya membawa ke syurga. Jauhilah dusta, kerana dusta itu menunjuk kepada kefasikan dan keduanya membawa ke neraka."
  },
  {
    "id": 36207,
    "hadith_number": 44,
    "tajuk_hadith": "Keutamaan Hari-Hari dan Malam-Malam Dekat dengan Rasulullah SAW",
    "perawi_melayu": "Muhammad bin Muyassar Abu Sa'd as-Saghani al-Makfoot meriwayatkan:",
    "english_text": "Hisham bin 'Urwah narrated to us from his father that ‘Aʼishah said; When Abu Bakr was dying, he said: What day is it? They said: Monday. He said: if I die tonight, do not wait until tomorrow to bury me, for the dearest of days and nights to me is that which is closest to the Messenger of Allah (ﷺ).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُيَسَّرٍ أَبُو سَعْدٍ الصَّاغَانِيُّ الْمَكْفُوفُ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، رَضِيَ اللَّهُ عَنْهَا قَالَتْ إِنَّ أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ لَمَّا حَضَرَتْهُ الْوَفَاةُ قَالَ أَيُّ يَوْمٍ هَذَا قَالُوا يَوْمُ الِاثْنَيْنِ قَالَ فَإِنْ مِتُّ مِنْ لَيْلَتِي فَلَا تَنْتَظِرُوا بِي الْغَدَ فَإِنَّ أَحَبَّ الْأَيَّامِ وَاللَّيَالِي إِلَيَّ أَقْرَبُهَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏",
    "malay_translation": "Hisham bin 'Urwah meriwayatkan daripada bapanya bahawa Aisyah berkata:  Ketika Abu Bakar hampir meninggal dunia, baginda bertanya, \"Hari apa ini?\" Mereka menjawab, \"Hari Isnin.\" Baginda berkata, \"Jika aku mati malam ini, janganlah tunggu sehingga esok untuk mengebumikanku, kerana hari dan malam yang paling aku cintai ialah hari dan malam yang paling hampir dengan Rasulullah SAW.\" "
  },
  {
    "id": 36208,
    "hadith_number": 45,
    "tajuk_hadith": "Mendoakan Keafiatan dan Menjauhi Dosa",
    "perawi_melayu": "Daripada Abu 'Ubaidah, diriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، حَدَّثَنَا عَمْرُو بْنُ مُرَّةَ، عَنْ أَبِي عُبَيْدَةَ، قَالَ قَامَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ بَعْدَ وَفَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَامٍ فَقَالَ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَقَامِي عَامَ الْأَوَّلِ فَقَالَ سَلُوا اللَّهَ الْعَافِيَةَ فَإِنَّهُ لَمْ يُعْطَ عَبْدٌ شَيْئًا أَفْضَلَ مِنْ الْعَافِيَةِ وَعَلَيْكُمْ بِالصِّدْقِ وَالْبِرِّ فَإِنَّهُمَا فِي الْجَنَّةِ وَإِيَّاكُمْ وَالْكَذِبَ وَالْفُجُورَ فَإِنَّهُمَا فِي النَّارِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Waki', daripada Sufyan, telah menceritakan kepada kami Amru bin Murrah, daripada Abu Ubaidah, katanya:  Abu Bakar r.a. telah berdiri setahun selepas wafatnya Rasulullah SAW, lalu berkata:  Rasulullah SAW telah berdiri di tempatku berdiri ini pada tahun sebelumnya, lalu baginda bersabda:  “Mohonlah kepada Allah kesejahteraan (keafiatan), kerana sesungguhnya tiada sesuatu yang diberikan kepada seorang hamba lebih baik daripada kesejahteraan. Dan hendaklah kamu berpegang teguh kepada kejujuran dan kebaikan, kerana keduanya membawa ke syurga.  Jauhilah kamu daripada dusta dan kefajaran, kerana keduanya membawa ke neraka.”"
  },
  {
    "id": 36209,
    "hadith_number": 46,
    "tajuk_hadith": "Pengampunan Allah SWT bagi dosa orang Muslim",
    "perawi_melayu": "Ali berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا شُعْبَةُ، عَنْ عُثْمَانَ بْنِ الْمُغِيرَةِ، قَالَ سَمِعْتُ عَلِيَّ بْنَ رَبِيعَةَ، مِنْ بَنِي أَسَدٍ يُحَدِّثُ عَنْ أَسْمَاءَ، أَوْ ابْنِ أَسْمَاءَ مِنْ بَنِي فَزَارَةَ قَالَ قَالَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ كُنْتُ إِذَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا نَفَعَنِي اللَّهُ بِمَا شَاءَ أَنْ يَنْفَعَنِي مِنْهُ وَحَدَّثَنِي أَبُو بَكْرٍ وَصَدَقَ أَبُو بَكْرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ مُسْلِمٍ يُذْنِبُ ذَنْبًا ثُمَّ يَتَوَضَّأُ فَيُصَلِّي رَكْعَتَيْنِ ثُمَّ يَسْتَغْفِرُ اللَّهَ تَعَالَى لِذَلِكَ الذَّنْبِ إِلَّا غَفَرَ لَهُ وَقَرَأَ هَاتَيْنِ الْآيَتَيْنِ ‏{‏وَمَنْ يَعْمَلْ سُوءًا أَوْ يَظْلِمْ نَفْسَهُ ثُمَّ يَسْتَغْفِرْ اللَّهَ يَجِدْ اللَّهَ غَفُورًا رَحِيمًا‏}‏ ‏{‏وَالَّذِينَ إِذَا فَعَلُوا فَاحِشَةً أَوْ ظَلَمُوا أَنْفُسَهُمْ‏}‏ الْآيَةَ\n\nحَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ عُثْمَانَ مِنْ آلِ أَبِي عُقَيْلٍ الثَّقَفِيِّ إِلَّا أَنَّهُ قَالَ قَالَ شُعْبَةُ وَقَرَأَ إِحْدَى هَاتَيْنِ الْآيَتَيْنِ ‏{‏مَنْ يَعْمَلْ سُوءًا يُجْزَ بِهِ‏}‏ ‏{‏وَالَّذِينَ إِذَا فَعَلُوا فَاحِشَةً‏}‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdur Rahman bin Mahdi, telah menceritakan kepada kami Syu’bah, daripada Usman bin Mughirah, dia berkata: Aku mendengar Ali bin Rabiah daripada Bani Asad menceritakan daripada Asma’, atau anak Asma’ daripada Bani Fazarah, dia berkata: Ali r.a. berkata: Aku, jika mendengar sesuatu daripada Rasulullah SAW, Allah akan memberi manfaat kepadaku dengan apa yang Dia kehendaki daripada padanya. Dan telah menceritakan kepadaku Abu Bakar, dan Abu Bakar berkata benar, dia berkata: Rasulullah SAW bersabda: “Tidak ada seorang Muslim pun yang melakukan dosa, kemudian dia berwuduk, lalu mendirikan solat dua rakaat, kemudian memohon ampun kepada Allah SWT atas dosa itu, melainkan Allah akan mengampuninya.” Dan baginda membaca dua ayat ini: “Dan sesiapa yang melakukan kejahatan atau menganiaya dirinya sendiri, kemudian dia memohon keampunan daripada Allah, nescaya dia akan mendapati Allah Maha Pengampun lagi Maha Mengasihani.” (An-Nisa’ 4:110) “Dan orang-orang yang apabila mereka melakukan perbuatan keji atau menganiaya diri sendiri, mereka mengingati Allah dan memohon keampunan terhadap dosa-dosa mereka; dan siapakah yang dapat mengampuni dosa melainkan Allah? Dan mereka tidak meneruskan perbuatan yang telah mereka lakukan itu, sedang mereka mengetahui.” (Ali ‘Imran 3:135)\n\nTelah menceritakan kepada kami Muhammad bin Ja’far, telah menceritakan kepada kami Syu’bah, dia berkata: Aku mendengar Usman daripada keluarga Abu ‘Uqail Ats-Tsaqafi, kecuali bahawa dia berkata… Syu’bah berkata: Dan dia membaca salah satu daripada dua ayat ini: “Sesiapa yang melakukan kejahatan, nescaya dia akan mendapat balasannya.” (Al-Baqarah 2:286) “Dan orang-orang yang apabila mereka melakukan perbuatan keji…” (Ali ‘Imran 3:135)."
  },
  {
    "id": 36210,
    "hadith_number": 47,
    "tajuk_hadith": "Kebaikan Selepas Keimanan dan Akibat Kejujuran serta Kefajaran",
    "perawi_melayu": "Umar berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ، حَدَّثَنَا سَلِيمُ بْنُ حَيَّانَ، قَالَ سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ عُمَرَ، قَالَ إِنَّ أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ خَطَبَنَا فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ فِينَا عَامَ أَوَّلَ فَقَالَ أَلَا إِنَّهُ لَمْ يُقْسَمْ بَيْنَ النَّاسِ شَيْءٌ أَفْضَلُ مِنْ الْمُعَافَاةِ بَعْدَ الْيَقِينِ أَلَا إِنَّ الصِّدْقَ وَالْبِرَّ فِي الْجَنَّةِ أَلَا إِنَّ الْكَذِبَ وَالْفُجُورَ فِي النَّارِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Bahz bin Asad, telah menceritakan kepada kami Salim bin Haiyan, dia berkata: Aku mendengar Qatadah meriwayatkan dari Humaid bin Abdurrahman bahawa Umar berkata: Sesungguhnya Abu Bakar r.a. telah menyampaikan khutbah kepada kami, lalu beliau berkata: Sesungguhnya Rasulullah SAW telah berdiri di hadapan kami pada tahun sebelumnya lalu bersabda: Ketahuilah, sesungguhnya tidak ada sesuatu pun yang diagih-agihkan di kalangan manusia yang lebih baik daripada kesejahteraan setelah kepastian iman. Ketahuilah, sesungguhnya kejujuran dan kebaikan membawa ke syurga. Ketahuilah, sesungguhnya kepalsuan dan kejahatan membawa ke neraka."
  },
  {
    "id": 36211,
    "hadith_number": 48,
    "tajuk_hadith": "Rasulullah ﷺ Minum Susu Kambing Semasa Perjalanan dari Mekah ke Madinah",
    "perawi_melayu": "Al-Bara' berkata:",
    "english_text": "When the Messenger of Allah (ﷺ) came from Makkah to Madinah, the Messenger of Allah (ﷺ) got thirsty. They passed by a herd of sheep, Abu Bakr as Siddeeq said: I took a cup and milked a cupful of milk for the Messenger of Allah (ﷺ). I brought it to him and he drank until I was pleased,",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ أَبَا إِسْحَاقَ، يَقُولُ سَمِعْتُ الْبَرَاءَ، قَالَ لَمَّا أَقْبَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ مَكَّةَ إِلَى الْمَدِينَةِ عَطِشَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَرُّوا بِرَاعِي غَنَمٍ قَالَ أَبُو بَكْرٍ الصِّدِّيقُ رَضِيَ اللَّهُ عَنْهُ فَأَخَذْتُ قَدَحًا فَحَلَبْتُ فِيهِ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُثْبَةً مِنْ لَبَنٍ فَأَتَيْتُهُ بِهِ فَشَرِبَ حَتَّى رَضِيتُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Ja'far, telah menceritakan kepada kami Syu'bah, dia berkata: Aku mendengar Abu Ishaq berkata: Aku mendengar Al-Bara' berkata:  Apabila Rasulullah ﷺ berangkat dari Mekah ke Madinah, Rasulullah ﷺ merasa dahaga.  Mereka lalu melalui seorang pengembala kambing.  Abu Bakar As-Siddiq r.a. berkata:  Maka aku mengambil sebuah cawan dan memerah susu kambing ke dalamnya untuk Rasulullah ﷺ. Kemudian aku membawanya kepada Baginda, lalu Baginda meminumnya sehingga aku merasa puas."
  },
  {
    "id": 36212,
    "hadith_number": 49,
    "tajuk_hadith": "Doa Pagis, Petang dan Sebelum Tidur",
    "perawi_melayu": "Abu Hurairah dan Abu Bakar",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا بَهْزٌ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا يَعْلَى بْنُ عَطَاءٍ، قَالَ سَمِعْتُ عَمْرَو بْنَ عَاصِمٍ، يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ يَا رَسُولَ اللَّهِ عَلِّمْنِي شَيْئًا أَقُولُهُ إِذَا أَصْبَحْتُ وَإِذَا أَمْسَيْتُ وَإِذَا أَخَذْتُ مَضْجَعِي قَالَ قُلْ اللَّهُمَّ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ أَوْ قَالَ اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ\n\nحَدَّثَنَا عَفَّانُ حَدَّثَنَا شُعْبَةُ عَنْ يَعْلَى بْنِ عَطَاءٍ قَالَ سَمِعْتُ عَمْرَو بْنَ عَاصِمِ بْنِ عَبْدِ اللَّهِ فَذَكَرَ مَعْنَاهُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Bahz, telah menceritakan kepada kami Syu’bah, telah menceritakan kepada kami Ya’la bin ‘Ata’, dia berkata: Aku mendengar ‘Amr bin ‘Asim berkata: Aku mendengar Abu Hurairah berkata: Abu Bakar r.a. berkata: “Wahai Rasulullah, ajarkanlah kepadaku sesuatu yang boleh aku ucapkan ketika aku bangun pagi, ketika aku masuk waktu petang dan ketika aku hendak tidur.” Baginda menjawab: “Ucapkanlah: Ya Allah, Pencipta langit dan bumi, Yang Maha Mengetahui perkara yang ghaib dan yang nyata – atau baginda berkata: Ya Allah, Yang Maha Mengetahui perkara ghaib dan yang nyata, Pencipta langit dan bumi – Tuhan dan Raja segala sesuatu, aku bersaksi bahawa tiada Tuhan melainkan Engkau. Aku berlindung kepada-Mu daripada kejahatan diriku sendiri dan kejahatan syaitan serta syirik yang dia ajak manusia kepadanya.”\n\nTelah menceritakan kepada kami ‘Affan, telah menceritakan kepada kami Syu’bah daripada Ya’la bin ‘Ata’, dia berkata: Aku mendengar ‘Amr bin ‘Asim bin Abdullah, kemudian dia menyebutkan maksudnya."
  },
  {
    "id": 36213,
    "hadith_number": 50,
    "tajuk_hadith": "Tanggungjawab Menentang Kemungkaran",
    "perawi_melayu": "Daripada Abu Bakar As-Siddiq r.a. bahawa baginda menyampaikan khutbah dan berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ إِسْمَاعِيلَ، قَالَ سَمِعْتُ قَيْسَ بْنَ أَبِي حَازِمٍ، يُحَدِّثُ عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، رَضِيَ اللَّهُ عَنْهُ أَنَّهُ خَطَبَ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّكُمْ تَقْرَءُونَ هَذِهِ الْآيَةَ وَتَضَعُونَهَا عَلَى غَيْرِ مَا وَضَعَهَا اللَّهُ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا عَلَيْكُمْ أَنْفُسَكُمْ لَا يَضُرُّكُمْ مَنْ ضَلَّ إِذَا اهْتَدَيْتُمْ‏}‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ النَّاسَ إِذَا رَأَوْا الْمُنْكَرَ بَيْنَهُمْ فَلَمْ يُنْكِرُوهُ يُوشِكُ أَنْ يَعُمَّهُمْ اللَّهُ بِعِقَابِهِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Ja'far, telah menceritakan kepada kami Syu'bah, daripada Ismail, katanya: Aku mendengar Qais bin Abi Hazim menceritakan daripada Abu Bakar As-Siddiq r.a. bahawa baginda menyampaikan khutbah dan berkata: Wahai manusia! Sesungguhnya kamu membaca ayat ini dan kamu meletakkannya pada sesuatu yang bukan tempat yang Allah SWT letakkan.  {Wahai orang-orang yang beriman, peliharalah diri kamu; tidaklah akan memudaratkan kamu orang yang sesat jika kamu telah mendapat hidayah.} Aku mendengar Rasulullah SAW bersabda:  Sesungguhnya jika manusia melihat kemungkaran di kalangan mereka, tetapi mereka tidak mencegahnya, maka Allah SWT akan menurunkan azabNya kepada mereka."
  },
  {
    "id": 36214,
    "hadith_number": 51,
    "tajuk_hadith": "Larangan Membalas Kecaman Selepas Zaman Rasulullah SAW",
    "perawi_melayu": "Daripada Abu Barzah al-Aslami berkata:",
    "english_text": "A man spoke harshly to Abu Bakr asSiddeeq. Abu Barzah said: Shall I strike his neck? He [Abu Bakr, rebuked him and said: That is not for any one after the Messenger of Allah (ﷺ).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ تَوْبَةَ الْعَنْبَرِيِّ، قَالَ سَمِعْتُ أَبَا سَوَّارٍ الْقَاضِيَ، يَقُولُ عَنْ أَبِي بَرْزَةَ الْأَسْلَمِيِّ، قَالَ أَغْلَظَ رَجُلٌ لِأَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ قَالَ فَقَالَ أَبُو بَرْزَةَ أَلَا أَضْرِبُ عُنُقَهُ قَالَ فَانْتَهَرَهُ وَقَالَ مَا هِيَ لِأَحَدٍ بَعْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Ja’far, telah menceritakan kepada kami Syu’bah, daripada Tawbah al-‘Anbari, katanya: Aku mendengar Abu Sawwar al-Qadhi berkata daripada Abu Barzah al-Aslami, katanya: Seorang lelaki berkata kasar kepada Abu Bakar as-Siddiq.  Abu Barzah berkata: “Patutkah aku pukul lehernya?” Abu Bakar pun menegurnya dan berkata: “Perkara ini tidak dibenarkan bagi sesiapa pun selepas Rasulullah SAW.”"
  },
  {
    "id": 36215,
    "hadith_number": 52,
    "tajuk_hadith": "Pewarisan Harta Rasulullah SAW",
    "perawi_melayu": "Daripada Urwah bin az-Zubair bahawa Aisyah isteri Nabi ﷺ memberitahu:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، حَدَّثَنَا لَيْثٌ، حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، رَضِيَ اللَّهُ عَنْهَا زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا أَخْبَرَتْهُ أَنَّ فَاطِمَةَ بِنْتَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْسَلَتْ إِلَى أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ تَسْأَلُهُ مِيرَاثَهَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِمَّا أَفَاءَ اللَّهُ عَلَيْهِ بِالْمَدِينَةِ وَفَدَكَ وَمَا بَقِيَ مِنْ خُمُسِ خَيْبَرَ فَقَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا نُورَثُ مَا تَرَكْنَا صَدَقَةٌ إِنَّمَا يَأْكُلُ آلُ مُحَمَّدٍ فِي هَذَا الْمَالِ وَإِنِّي وَاللَّهِ لَا أُغَيِّرُ شَيْئًا مِنْ صَدَقَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ حَالِهَا الَّتِي كَانَتْ عَلَيْهَا فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَأَعْمَلَنَّ فِيهَا بِمَا عَمِلَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَبَى أَبُو بَكْرٍ أَنْ يَدْفَعَ إِلَى فَاطِمَةَ مِنْهَا شَيْئًا فَوَجَدَتْ فَاطِمَةُ عَلَى أَبِي بَكْرٍ فِي ذَلِكَ فَقَالَ أَبُو بَكْرٍ وَالَّذِي نَفْسِي بِيَدِهِ لَقَرَابَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَبُّ إِلَيَّ أَنْ أَصِلَ مِنْ قَرَابَتِي وَأَمَّا الَّذِي شَجَرَ بَيْنِي وَبَيْنَكُمْ مِنْ هَذِهِ الْأَمْوَالِ فَإِنِّي لَمْ آلُ فِيهَا عَنْ الْحَقِّ وَلَمْ أَتْرُكْ أَمْرًا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُهُ فِيهَا إِلَّا صَنَعْتُهُ‏.‏",
    "malay_translation": "Hadis ini menceritakan bahawa Fatimah binti Rasulullah SAW telah menghantar pesanan kepada Abu Bakar as-Siddiq RA meminta bahagian pusakanya daripada harta rampasan perang (fai') yang Allah SWT berikan kepada Rasulullah SAW di Madinah dan Fadak, serta baki khums daripada Khaibar. Abu Bakar RA menjawab bahawa Rasulullah SAW telah bersabda, \"Kami (para Nabi) tidak diwarisi, apa yang kami tinggalkan adalah sedekah. Keluarga Muhammad boleh mengambil rezeki daripada harta ini.\"  Abu Bakar RA bersumpah bahawa beliau tidak akan mengubah sebarang bentuk sedekah Rasulullah SAW daripada keadaannya ketika zaman Rasulullah SAW dan akan menguruskannya sepertimana Rasulullah SAW menguruskannya. Oleh itu, Abu Bakar RA enggan memberikan apa-apa daripada harta tersebut kepada Fatimah RA, dan Fatimah RA berasa marah kepada Abu Bakar RA.  Abu Bakar RA berkata, \"Demi Allah yang memegang nyawaku, keluarga Rasulullah SAW lebih aku kasihi daripada keluargaku sendiri.  Mengenai perselisihan faham antara aku dan kamu tentang harta ini, aku tidak pernah menyeleweng daripada kebenaran dan aku tidak akan meninggalkan sesuatu perkara yang aku lihat Rasulullah SAW lakukan melainkan aku akan melakukannya sepertimana baginda melakukannya.\""
  },
  {
    "id": 36216,
    "hadith_number": 53,
    "tajuk_hadith": "Pengampunan Allah SWT melalui Taubat dan Solat",
    "perawi_melayu": "Daripada Asma' bin al-Hakam al-Fazari berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو كَامِلٍ، حَدَّثَنَا أَبُو عَوَانَةَ، حَدَّثَنَا عُثْمَانُ بْنُ أَبِي زُرْعَةَ، عَنْ عَلِيِّ بْنِ رَبِيعَةَ، عَنْ أَسْمَاءَ بْنِ الْحَكَمِ الْفَزَارِيِّ، قَالَ سَمِعْتُ عَلِيًّا، كَرَّمَ اللَّهُ وَجْهَهُ قَالَ كُنْتُ إِذَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثًا نَفَعَنِي اللَّهُ بِهِ بِمَا شَاءَ أَنْ يَنْفَعَنِي مِنْهُ وَإِذَا حَدَّثَنِي غَيْرُهُ اسْتَحْلَفْتُهُ فَإِذَا حَلَفَ لِي صَدَّقْتُهُ وَحَدَّثَنِي أَبُو بَكْرٍ وَصَدَقَ أَبُو بَكْرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ عَبْدٍ مُؤْمِنٍ يُذْنِبُ ذَنْبًا فَيَتَوَضَّأُ فَيُحْسِنُ الطُّهُورَ ثُمَّ يُصَلِّي رَكْعَتَيْنِ فَيَسْتَغْفِرُ اللَّهَ تَعَالَى إِلَّا غَفَرَ اللَّهُ لَهُ ثُمَّ تَلَا ‏{‏وَالَّذِينَ إِذَا فَعَلُوا فَاحِشَةً أَوْ ظَلَمُوا أَنْفُسَهُمْ‏}‏‏.‏",
    "malay_translation": "Aku mendengar Ali r.a. berkata: “Apabila aku mendengar hadis daripada Rasulullah SAW, Allah SWT memberi manfaat kepadaku dengannya sebagaimana yang dikehendaki-Nya.  Dan jika orang lain memberitahu hadis tersebut kepadaku, aku akan menyuruhnya bersumpah. Jika dia bersumpah, aku akan mempercayainya.”  Abu Bakar r.a. memberitahuku – dan Abu Bakar r.a. adalah seorang yang benar – bahawa baginda mendengar Rasulullah SAW bersabda: “Tidaklah seorang hamba mukmin melakukan dosa, kemudian dia berwuduk dengan sempurna, lalu menunaikan solat dua rakaat dan memohon keampunan daripada Allah SWT melainkan Allah SWT akan mengampuninya.” Kemudian baginda membaca ayat:  “Dan orang-orang yang apabila mereka melakukan perbuatan keji atau menganiaya diri mereka sendiri…” (Ali Imran 3:135)."
  },
  {
    "id": 36217,
    "hadith_number": 54,
    "tajuk_hadith": "Pengumpulan Al-Quran oleh Saidina Zaid bin Thabit",
    "perawi_melayu": "Daripada Zaid bin Thabit, beliau berkata:",
    "english_text": "Abu Bakr sent for me when many of the people of al-Yamamah were killed. Abu Bakr said: O Zaid bin Thabit, you are a wise young man and we trust you; you used to write down the Revelation for the Messenger of Allah (ﷺ). Seek out the Qur'an and collect it.",
    "arabic_text": "حَدَّثَنَا أَبُو كَامِلٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ عُبَيْدِ بْنِ السَّبَّاقِ، عَنْ زَيْدِ بْنِ ثَابِتٍ، قَالَ أَرْسَلَ إِلَيَّ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ مَقْتَلَ أَهْلِ الْيَمَامَةِ فَقَالَ أَبُو بَكْرٍ يَا زَيْدُ بْنَ ثَابِتٍ أَنْتَ غُلَامٌ شَابٌّ عَاقِلٌ لَا نَتَّهِمُكَ قَدْ كُنْتَ تَكْتُبُ الْوَحْيَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَتَبَّعْ الْقُرْآنَ فَاجْمَعْهُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Kamil, telah menceritakan kepada kami Ibrahim bin Saad, telah menceritakan kepada kami Ibn Syihab, daripada Ubaid bin As-Sabbaq, daripada Zaid bin Thabit, bahawa beliau berkata: Abu Bakar telah memanggilku ketika ramai penduduk Yamamah terbunuh. Abu Bakar berkata: Wahai Zaid bin Thabit, engkau adalah seorang pemuda yang bijak dan kami mempercayai engkau; engkau pernah menulis wahyu untuk Rasulullah ﷺ.  Carilah al-Quran dan kumpulkanlah ia."
  },
  {
    "id": 36218,
    "hadith_number": 55,
    "tajuk_hadith": "Pewarisan Nabi SAW dan Harta Pusaka Baginda",
    "perawi_melayu": "Daripada Aisyah r.a. bahawa Fatimah dan Abbas datang kepada Abu Bakar untuk menuntut harta pusaka mereka daripada Rasulullah SAW.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، رَضِيَ اللَّهُ عَنْهَا أَنَّ فَاطِمَةَ، وَالْعَبَّاسَ أَتَيَا أَبَا بَكْرٍ يَلْتَمِسَانِ مِيرَاثَهُمَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُمَا حِينَئِذٍ يَطْلُبَانِ أَرْضَهُ مِنْ فَدَكَ وَسَهْمَهُ مِنْ خَيْبَرَ فَقَالَ لَهُمَا أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا نُورَثُ مَا تَرَكْنَا صَدَقَةٌ وَإِنَّمَا يَأْكُلُ آلُ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذَا الْمَالِ وَإِنِّي وَاللَّهِ لَا أَدَعُ أَمْرًا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُهُ فِيهِ إِلَّا صَنَعْتُهُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdurrazzaq, telah menceritakan kepada kami Ma'mar, dari Az Zuhri, dari Urwah, dari Aisyah r.a. bahawa Fatimah dan Abbas datang kepada Abu Bakar untuk menuntut harta pusaka mereka daripada Rasulullah SAW.  Ketika itu mereka sedang menuntut tanah baginda di Fadak dan bahagian baginda di Khaibar. Maka Abu Bakar r.a. berkata kepada mereka:  \"Sesungguhnya aku telah mendengar Rasulullah SAW bersabda:  Kami (para Nabi) tidak diwarisi, apa yang kami tinggalkan adalah sedekah, dan keluarga Muhammad SAW sahaja yang berhak memakan daripada harta ini. Demi Allah, aku tidak akan meninggalkan sesuatu perkara yang aku lihat Rasulullah SAW melakukannya melainkan aku akan melakukannya juga.\""
  },
  {
    "id": 36219,
    "hadith_number": 56,
    "tajuk_hadith": "Keredaan Abu Bakar sebagai Khalifah",
    "perawi_melayu": "Daripada Ibnu Abi Mulaikah. Dikatakan kepada Abu Bakar:",
    "english_text": "O khaleefah (caliph) of Allah. He said: I am the khaleefah (lit. successor) of the Messenger of Allah (ﷺ) and I am pleased with that.",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ دَاوُدَ، حَدَّثَنَا نَافِعٌ يَعْنِي ابْنَ عُمَرَ، عَنْ ابْنِ أَبِي مُلَيْكَةَ، قَالَ قِيلَ لِأَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ يَا خَلِيفَةَ اللَّهِ فَقَالَ أَنَا خَلِيفَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا رَاضٍ بِهِ وَأَنَا رَاضٍ بِهِ وَأَنَا رَاضٍ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Musa bin Dawud, telah menceritakan kepada kami Nafi' iaitu Ibnu Umar, daripada Ibnu Abi Mulaikah, katanya: Dikatakan kepada Abu Bakar r.a, Wahai Khalifah Allah! Maka beliau berkata: Aku adalah Khalifah Rasulullah ﷺ dan aku reda dengannya."
  },
  {
    "id": 36220,
    "hadith_number": 57,
    "tajuk_hadith": "Pewarisan Nabi SAW",
    "perawi_melayu": "Daripada Abu Salamah, bahawa Fatimah berkata kepada Abu Bakar:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، أَنَّ فَاطِمَةَ، رَضِيَ اللَّهُ عَنْهَا قَالَتْ لِأَبِي بَكْرٍ مَنْ يَرِثُكَ إِذَا مِتَّ قَالَ وَلَدِي وَأَهْلِي قَالَتْ فَمَا لَنَا لَا نَرِثُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ النَّبِيَّ لَا يُورَثُ وَلَكِنِّي أَعُولُ مَنْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعُولُ وَأُنْفِقُ عَلَى مَنْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُنْفِقُ‏.‏",
    "malay_translation": "Daripada Affan, telah menceritakan kepada kami Hammad bin Salamah, daripada Muhammad bin Amr, daripada Abu Salamah, bahawa Fatimah, radiallahuanha, berkata kepada Abu Bakar: \"Siapakah yang akan mewarisi engkau sekiranya engkau mati?\"  Abu Bakar menjawab: \"Anak-anakku dan keluargaku.\" Fatimah berkata: \"Maka mengapakah kami tidak mewarisi Nabi SAW?\" Abu Bakar menjawab:  \"Aku telah mendengar Nabi SAW bersabda:  'Sesungguhnya Nabi tidak diwarisi.'  Namun, aku akan menanggung mereka yang pernah ditanggung oleh Rasulullah SAW dan aku akan membelanjakan harta ke atas mereka yang pernah dibelanjakan oleh Rasulullah SAW.\" "
  },
  {
    "id": 36221,
    "hadith_number": 58,
    "tajuk_hadith": "Larangan Membunuh Selepas Zaman Rasulullah SAW",
    "perawi_melayu": "Daripada Abu Barzah al-Aslami, baginda berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَفَّانُ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا يُونُسُ بْنُ عُبَيْدٍ، عَنْ حُمَيْدِ بْنِ هِلَالٍ، عَنْ عَبْدِ اللَّهِ بْنِ مُطَرِّفِ بْنِ الشِّخِّيرِ، أَنَّهُ حَدَّثَهُمْ عَنْ أَبِي بَرْزَةَ الْأَسْلَمِيِّ، أَنَّهُ قَالَ كُنَّا عِنْدَ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ فِي عَمَلِهِ فَغَضِبَ عَلَى رَجُلٍ مِنْ الْمُسْلِمِينَ فَاشْتَدَّ غَضَبُهُ عَلَيْهِ جِدًّا فَلَمَّا رَأَيْتُ ذَلِكَ قُلْتُ يَا خَلِيفَةَ رَسُولِ اللَّهِ أَضْرِبُ عُنُقَهُ فَلَمَّا ذَكَرْتُ الْقَتْلَ صَرَفَ عَنْ ذَلِكَ الْحَدِيثِ أَجْمَعَ إِلَى غَيْرِ ذَلِكَ مِنْ النَّحْوِ فَلَمَّا تَفَرَّقْنَا أَرْسَلَ إِلَيَّ بَعْدَ ذَلِكَ أَبُو بَكْرٍ الصِّدِّيقُ رَضِيَ اللَّهُ عَنْهُ فَقَالَ يَا أَبَا بَرْزَةَ مَا قُلْتَ قَالَ وَنَسِيتُ الَّذِي قُلْتُ قُلْتُ ذَكِّرْنِيهِ قَالَ أَمَا تَذْكُرُ مَا قُلْتَ قَالَ قُلْتُ لَا وَاللَّهِ قَالَ أَرَأَيْتَ حِينَ رَأَيْتَنِي غَضِبْتُ عَلَى الرَّجُلِ فَقُلْتَ أَضْرِبُ عُنُقَهُ يَا خَلِيفَةَ رَسُولِ اللَّهِ أَمَا تَذْكُرُ ذَاكَ أَوَكُنْتَ فَاعِلًا ذَاكَ قَالَ قُلْتُ نَعَمْ وَاللَّهِ وَالْآنَ إِنْ أَمَرْتَنِي فَعَلْتُ قَالَ وَيْحَكَ أَوْ وَيْلَكَ إِنَّ تِلْكَ وَاللَّهِ مَا هِيَ لِأَحَدٍ بَعْدَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏",
    "malay_translation": "Kami berada di sisi Abu Bakar As-Siddiq ketika baginda menguruskan urusan khilafah.  Baginda sangat marah kepada seorang Muslim.  Apabila aku melihatnya, aku berkata: Wahai Khalifah Rasulullah, patutkah aku menyembelih lehernya?  Sebaik sahaja aku menyebut tentang pembunuhan, baginda terus menukar topik perbualan.  Setelah kami berpisah, Abu Bakar As-Siddiq menghantar utusan kepadaku dan bertanya: Wahai Abu Barzah, apakah yang engkau katakan? Aku menjawab: Aku telah lupa apa yang aku katakan; ingatkan aku. Baginda berkata: Tidakkah engkau ingat apa yang engkau katakan? Aku menjawab: Tidak, demi Allah. Baginda berkata: Ingatkah engkau, ketika engkau melihat aku marah kepada lelaki itu, engkau berkata: Patutkah aku menyembelih lehernya, wahai Khalifah Rasulullah? Tidakkah engkau ingat akan perkara itu? Adakah engkau benar-benar akan melakukannya? Aku menjawab: Ya, demi Allah. Sekiranya engkau menyuruhku sekarang, aku akan melakukannya. Baginda berkata: Celaka engkau! Demi Allah, perkara sedemikian tidak dibenarkan bagi sesiapa pun selepas Muhammad ﷺ."
  },
  {
    "id": 36222,
    "hadith_number": 59,
    "tajuk_hadith": "Kebersihan Mulut dengan Siwak",
    "perawi_melayu": "Abu Bakar As-Siddiq berkata:",
    "english_text": "The Messenger of Allah (ﷺ) said: `The siwak is purifying for the mouth and pleasing to the Lord.”",
    "arabic_text": "حَدَّثَنَا عَفَّانُ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنَا ابْنُ أَبِي عَتِيقٍ، عَنْ أَبِيهِ، قَالَ إِنَّ أَبَا بَكْرٍ الصِّدِّيقَ رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السِّوَاكُ مَطْهَرَةٌ لِلْفَمِ مَرْضَاةٌ لِلرَّبِّ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Siwak membersihkan mulut dan merupakan sesuatu yang diredai oleh Tuhan.\""
  },
  {
    "id": 36223,
    "hadith_number": 60,
    "tajuk_hadith": "Doa Abu Bakar As-Siddiq",
    "perawi_melayu": "Abu Hurairah berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَفَّانُ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ يَعْلَى بْنِ عَطَاءٍ، قَالَ سَمِعْتُ عَمْرَو بْنَ عَاصِمِ بْنِ عَبْدِ اللَّهِ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ قُلْ لِي شَيْئًا أَقُولُهُ إِذَا أَصْبَحْتُ وَإِذَا أَمْسَيْتُ قَالَ قُلْ اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ وَأَمَرَهُ أَنْ يَقُولَهُ إِذَا أَصْبَحَ وَإِذَا أَمْسَى وَإِذَا أَخَذَ مَضْجَعَهُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami ‘Affan, dia berkata; telah menceritakan kepada kami Syu’bah, dari Ya’la bin ‘Ata’, dia berkata; aku mendengar ‘Amru bin ‘Asim bin Abdullah berkata; aku mendengar Abu Hurairah berkata; Abu Bakar berkata, \"Wahai Rasulullah, beritahu aku sesuatu yang boleh aku ucapkan ketika aku bangun pagi dan ketika aku masuk waktu petang.\" Baginda bersabda, \"Ucapkanlah: ‘Ya Allah, Yang Maha Mengetahui perkara ghaib dan nyata, Pencipta langit dan bumi, Tuhan segala sesuatu dan Penguasanya, aku bersaksi bahawa tiada Tuhan melainkan Engkau, aku berlindung kepadaMu daripada kejahatan diriku sendiri dan daripada kejahatan syaitan serta syiriknya.’\" Dan baginda memerintahkannya untuk mengucapkannya ketika bangun pagi, ketika masuk waktu petang, dan ketika hendak tidur."
  },
  {
    "id": 36224,
    "hadith_number": 61,
    "tajuk_hadith": "Abu Bakar: Khalifah Muhammad, bukan Khalifah Allah",
    "perawi_melayu": "Dari Abdullah bin Abi Mulaikah, diriwayatkan bahawa:",
    "english_text": "It was said to Abu Bakr: O khaleefäh of Allah. He said: Rather slam] the khaleefah (lit successor) of Muhammad (ﷺ), and I am pleased with that,",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَزِيدَ، حَدَّثَنَا نَافِعُ بْنُ عُمَرَ الْجُمَحِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، قَالَ قِيلَ لِأَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ يَا خَلِيفَةَ اللَّهِ فَقَالَ بَلْ خَلِيفَةُ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أَرْضَى بِهِ‏.‏",
    "malay_translation": "Daripada Abdullah bin Abi Mulaikah, diriwayatkan bahawa dikatakan kepada Abu Bakar r.a., “Wahai Khalifah Allah!”  Maka Abu Bakar menjawab, “Sebenarnya aku adalah Khalifah Muhammad ﷺ, dan aku redha dengannya.”"
  },
  {
    "id": 36225,
    "hadith_number": 62,
    "tajuk_hadith": "Abu Bakar As-Siddiq dan Larangan Meminta",
    "perawi_melayu": "Daripada Ibnu Abi Mulaikah, Baginda berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ دَاوُدَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُؤَمَّلِ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، قَالَ كَانَ رُبَّمَا سَقَطَ الْخِطَامُ مِنْ يَدِ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ قَالَ فَيَضْرِبُ بِذِرَاعِ نَاقَتِهِ فَيُنِيخُهَا فَيَأْخُذُهُ قَالَ فَقَالُوا لَهُ أَفَلَا أَمَرْتَنَا نُنَاوِلُكَهُ فَقَالَ إِنَّ حَبِيبِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَنِي أَنْ لَا أَسْأَلَ النَّاسَ شَيْئًا‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Musa bin Dawud, telah menceritakan kepada kami Abdullah bin Al-Mu’ammal, daripada Ibnu Abi Mulaikah, dia berkata:  Kadangkala tali kekang jatuh daripada tangan Abu Bakar As-Siddiq r.a. Maka dia memukul kaki untanya lalu unta itu akan berlutut dan dia mengambil tali kekang itu.  Mereka berkata kepadanya, “Mengapa engkau tidak menyuruh kami menghulurkan tali kekang itu kepadamu?”  Dia menjawab, “Sesungguhnya kekasihku, Rasulullah SAW, telah memerintahkan aku supaya tidak meminta sesuatu daripada manusia.”"
  },
  {
    "id": 36226,
    "hadith_number": 63,
    "tajuk_hadith": "Keutamaan Kesejahteraan dan Amalan Baik",
    "perawi_melayu": "Daripada Abu Ubaidah, bahawa Abu Bakar berdiri setahun selepas kewafatan Rasulullah SAW dan berkata:",
    "english_text": "The Messenger of Allah (ﷺ) stood among us last year and said: `The son of Adam has not been given anything better than well-being, so ask Allah for well-being. You should be truthful and righteous, for they lead to Paradise, and you should beware of lying and immorality, for they lead to Hell.`",
    "arabic_text": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ أَبِي عُبَيْدَةَ، عَنْ أَبِي بَكْرٍ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَامَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ بَعْدَ وَفَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَامٍ فَقَالَ قَامَ فِينَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْأَوَّلِ فَقَالَ إِنَّ ابْنَ آدَمَ لَمْ يُعْطَ شَيْئًا أَفْضَلَ مِنْ الْعَافِيَةِ فَاسْأَلُوا اللَّهَ الْعَافِيَةَ وَعَلَيْكُمْ بِالصِّدْقِ وَالْبِرِّ فَإِنَّهُمَا فِي الْجَنَّةِ وَإِيَّاكُمْ وَالْكَذِبَ وَالْفُجُورَ فَإِنَّهُمَا فِي النَّارِ‏.‏",
    "malay_translation": "Rasulullah SAW berdiri di hadapan kita pada tahun lepas dan bersabda:  \"Sesungguhnya anak Adam tidak diberi sesuatu yang lebih baik daripada kesejahteraan (afiyah), maka mintalah kesejahteraan kepada Allah.  Hendaklah kamu berpegang teguh kepada kejujuran dan kebaikan, kerana keduanya membawa ke syurga, dan jauhilah kamu daripada berdusta dan perbuatan keji, kerana keduanya membawa ke neraka.\""
  },
  {
    "id": 36227,
    "hadith_number": 64,
    "tajuk_hadith": "Perintah Jihad Hingga Mengucapkan Tauhid",
    "perawi_melayu": "Dari Abu Hurairah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَزِيدَ، قَالَ أَخْبَرَنَا سُفْيَانُ بْنُ حُسَيْنٍ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ أَبِي هُرَيْرَةَ، رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لَا إِلَهَ إِلَّا اللَّهُ فَإِذَا قَالُوهَا عَصَمُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إِلَّا بِحَقِّهَا وَحِسَابُهُمْ عَلَى اللَّهِ تَعَالَى قَالَ فَلَمَّا كَانَتْ الرِّدَّةُ قَالَ عُمَرُ لِأَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ تُقَاتِلُهُمْ وَقَدْ سَمِعْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ كَذَا وَكَذَا قَالَ فَقَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ وَاللَّهِ لَا أُفَرِّقُ بَيْنَ الصَّلَاةِ وَالزَّكَاةِ وَلَأُقَاتِلَنَّ مَنْ فَرَّقَ بَيْنَهُمَا قَالَ فَقَاتَلْنَا مَعَهُ فَرَأَيْنَا ذَلِكَ رَشَدًا‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Yazid, katanya; telah mengabarkan kepada kami Sufian bin Husain, dari Az Zuhri, dari Ubaidillah bin Abdullah bin Utbah bin Mas’ud, dari Abu Hurairah r.a., dari Nabi s.a.w., Baginda bersabda: “Aku diperintahkan untuk memerangi manusia sehingga mereka mengucapkan, 'La ilaha illa Allah'. Sekiranya mereka mengucapkannya, maka darah dan harta benda mereka selamat daripada aku, kecuali jika ada hak yang mesti ditunaikan, dan perhitungan mereka adalah di sisi Allah. Ketika berlaku murtad, Umar bertanya kepada Abu Bakar r.a., “Engkau akan memerangi mereka sedangkan engkau telah mendengar Rasulullah s.a.w. bersabda sedemikian rupa?” Abu Bakar r.a. menjawab, “Demi Allah, aku tidak akan memisahkan solat dan zakat, dan aku pasti akan memerangi sesiapa yang memisahkan keduanya.” Maka kami berperang bersamanya, dan kami melihat bahawa itulah tindakan yang tepat.”"
  },
  {
    "id": 36228,
    "hadith_number": 65,
    "tajuk_hadith": "Balasan Bagi Amal Jahat",
    "perawi_melayu": "Ia diriwayatkan bahawa Abu Bakr bin Abi Zuhair berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، قَالَ أَخْبَرَنَا إِسْمَاعِيلُ، عَنْ أَبِي بَكْرِ بْنِ أَبِي زُهَيْرٍ، قَالَ أُخْبِرْتُ أَنَّ أَبَا بَكْرٍ قَالَ يَا رَسُولَ اللَّهِ كَيْفَ الصَّلَاحُ بَعْدَ هَذِهِ الْآيَةِ ‏{‏لَيْسَ بِأَمَانِيِّكُمْ وَلَا أَمَانِيِّ أَهْلِ الْكِتَابِ مَنْ يَعْمَلْ سُوءًا يُجْزَ بِهِ‏}‏ فَكُلَّ سُوءٍ عَمِلْنَا جُزِينَا بِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَفَرَ اللَّهُ لَكَ يَا أَبَا بَكْرٍ أَلَسْتَ تَمْرَضُ أَلَسْتَ تَنْصَبُ أَلَسْتَ تَحْزَنُ أَلَسْتَ تُصِيبُكَ اللَّأْوَاءُ قَالَ بَلَى قَالَ فَهُوَ مَا تُجْزَوْنَ بِهِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Numair, katanya; telah memberitakan kepada kami Ismail, daripada Abu Bakar bin Abi Zuhrair, katanya; Aku diberitahu bahawa Abu Bakar berkata: Wahai Rasulullah, bagaimanakah kebaikan itu boleh dicapai setelah ayat ini: {Ia bukanlah menurut angan-angan kamu, dan bukanlah menurut angan-angan ahli kitab. Sesiapa yang melakukan kejahatan, nescaya dia akan dibalas dengannya.}  Adakah kita akan dihukum atas setiap kejahatan yang kita lakukan? Maka Rasulullah SAW bersabda:  Semoga Allah mengampunimu wahai Abu Bakar. Tidakkah kamu sakit? Tidakkah kamu merasa letih? Tidakkah kamu bersedih? Tidakkah kamu ditimpa musibah?  Abu Bakar berkata: Ya. Baginda bersabda: Itulah balasan yang diberikan kepada kamu."
  },
  {
    "id": 36229,
    "hadith_number": 66,
    "tajuk_hadith": "Kesusahan dan Kehidupan Baik",
    "perawi_melayu": "Ibn Abi Khalid telah meriwayatkan daripada Abu Bakr bin Abi Zuhair - Aku kira beliau berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا ابْنُ أَبِي خَالِدٍ، عَنْ أَبِي بَكْرِ بْنِ أَبِي زُهَيْرٍ، أَظُنُّهُ قَالَ أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ كَيْفَ الصَّلَاحُ بَعْدَ هَذِهِ الْآيَةِ قَالَ يَرْحَمُكَ اللَّهُ يَا أَبَا بَكْرٍ أَلَسْتَ تَمْرَضُ أَلَسْتَ تَحْزَنُ أَلَسْتَ تُصِيبُكَ اللَّأْوَاءُ قَالَ بَلَى قَالَ فَإِنَّ ذَاكَ بِذَاكَ \n\nحَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ حَدَّثَنَا إِسْمَاعِيلُ عَنْ أَبِي بَكْرٍ الثَّقَفِيِّ قَالَ قَالَ أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ كَيْفَ الصَّلَاحُ بَعْدَ هَذِهِ الْآيَةِ ‏{‏مَنْ يَعْمَلْ سُوءًا يُجْزَ بِهِ‏}‏ فَذَكَرَ الْحَدِيثَ‏.‏",
    "malay_translation": "Sufyan telah meriwayatkan, katanya: Ibn Abi Khalid telah meriwayatkan daripada Abu Bakr bin Abi Zuhair, aku sangka beliau berkata: Wahai Rasulullah, bagaimanakah seseorang itu boleh berada dalam keadaan baik setelah ayat ini? Baginda SAW bersabda:  Semoga Allah merahmatimu wahai Abu Bakar. Bukankah engkau jatuh sakit? Bukankah engkau bersedih? Bukankah engkau ditimpa musibah?  Abu Bakar menjawab:  Ya. Baginda SAW bersabda: Itulah balasannya.\n\nYa'la bin Ubaid telah meriwayatkan, katanya: Isma'il telah meriwayatkan daripada Abu Bakar at-Thaqafi, katanya: Abu Bakr berkata: Wahai Rasulullah, bagaimanakah seseorang itu boleh berada dalam keadaan baik setelah ayat ini: \"Barangsiapa yang melakukan kejahatan, nescaya akan dibalas dengan kejahatan itu.\" (An-Nisa': 123)?  Kemudian beliau menyebut hadis yang sama."
  },
  {
    "id": 36230,
    "hadith_number": 67,
    "tajuk_hadith": "Balasan Bagi Setiap Perbuatan Buruk",
    "perawi_melayu": "Daripada Abu Bakar bin Abi Zuhra ath-Thaqafi, katanya:",
    "english_text": "When the verse `It will not be in accordance with your desires (Muslims), nor those of the people of the Scripture (Jews and Christians), whosoever works evil, will have the recompense thereof`  was revealed, Abu Bakr to said: O Messenger of Allah, will we receive recompense for every bad deed we do? The Messenger of Allah (ﷺ) said: `May Allah have mercy on you, O Abu Bakr. Do you not become exhausted? Do you not feel sad? Don't calamities befall you? This is the recompense that you receive.”",
    "arabic_text": "حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا ابْنُ أَبِي خَالِدٍ، عَنْ أَبِي بَكْرِ بْنِ أَبِي زُهَيْرٍ الثَّقَفِيِّ، قَالَ لَمَّا نَزَلَتْ ‏{‏لَيْسَ بِأَمَانِيِّكُمْ وَلَا أَمَانِيِّ أَهْلِ الْكِتَابِ مَنْ يَعْمَلْ سُوءًا يُجْزَ بِهِ‏}‏ قَالَ فَقَالَ أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ إِنَّا لَنُجَازَى بِكُلِّ سُوءٍ نَعْمَلُهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْحَمُكَ اللَّهُ يَا أَبَا بَكْرٍ أَلَسْتَ تَنْصَبُ أَلَسْتَ تَحْزَنُ أَلَسْتَ تُصِيبُكَ اللَّأْوَاءُ فَهَذَا مَا تُجْزَوْنَ بِهِ‏.‏",
    "malay_translation": "Setelah ayat  \"ليس بأمانيكم ولا أماني أهل الكتاب من يعمل سوءا يُجزى به\" diturunkan, Abu Bakar bertanya, \"Wahai Rasulullah, adakah kita akan menerima balasan bagi setiap perbuatan buruk yang kita lakukan?\" Rasulullah SAW menjawab, \"Semoga Allah merahmati kamu wahai Abu Bakar. Tidakkah kamu merasa letih? Tidakkah kamu berasa sedih? Tidakkah kamu ditimpa musibah? Inilah balasan yang kamu terima.\""
  },
  {
    "id": 36231,
    "hadith_number": 68,
    "tajuk_hadith": "Zakat Ke Atas Unta dan Kambing",
    "perawi_melayu": "Dari Anas bin Malik bahawa Abu Bakar menulis kepada mereka:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو كَامِلٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، قَالَ أَخَذْتُ هَذَا الْكِتَابَ مِنْ ثُمَامَةَ بْنِ عَبْدِ اللَّهِ بْنِ أَنَسٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ كَتَبَ لَهُمْ إِنَّ هَذِهِ فَرَائِضُ الصَّدَقَةِ الَّتِي فَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمُسْلِمِينَ الَّتِي أَمَرَ اللَّهُ عَزَّ وَجَلَّ بِهَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَنْ سُئِلَهَا مِنْ الْمُسْلِمِينَ عَلَى وَجْهِهَا فَلْيُعْطِهَا وَمَنْ سُئِلَ فَوْقَ ذَلِكَ فَلَا يُعْطِهِ فِيمَا دُونَ خَمْسٍ وَعِشْرِينَ مِنْ الْإِبِلِ فَفِي كُلِّ خَمْسِ ذَوْدٍ شَاةٌ فَإِذَا بَلَغَتْ خَمْسًا وَعِشْرِينَ فَفِيهَا ابْنَةُ مَخَاضٍ إِلَى خَمْسٍ وَثَلَاثِينَ فَإِنْ لَمْ تَكُنِ ابْنَةُ مَخَاضٍ فَابْنُ لَبُونٍ ذَكَرٌ فَإِذَا بَلَغَتْ سِتَّةً وَثَلَاثِينَ فَفِيهَا ابْنَةُ لَبُونٍ إِلَى خَمْسٍ وَأَرْبَعِينَ فَإِذَا بَلَغَتْ سِتَّةً وَأَرْبَعِينَ فَفِيهَا حِقَّةٌ طَرُوقَةُ الْفَحْلِ إِلَى سِتِّينَ فَإِذَا بَلَغَتْ إِحْدَى وَسِتِّينَ فَفِيهَا جَذَعَةٌ إِلَى خَمْسٍ وَسَبْعِينَ فَإِذَا بَلَغَتْ سِتَّةً وَسَبْعِينَ فَفِيهَا بِنْتَا لَبُونٍ إِلَى تِسْعِينَ فَإِذَا بَلَغَتْ إِحْدَى وَتِسْعِينَ فَفِيهَا حِقَّتَانِ طَرُوقَتَا الْفَحْلِ إِلَى عِشْرِينَ وَمِائَةٍ فَإِنْ زَادَتْ عَلَى عِشْرِينَ وَمِائَةٍ فَفِي كُلِّ أَرْبَعِينَ ابْنَةُ لَبُونٍ وَفِي كُلِّ خَمْسِينَ حِقَّةٌ فَإِذَا تَبَايَنَ أَسْنَانُ الْإِبِلِ فِي فَرَائِضِ الصَّدَقَاتِ فَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ الْجَذَعَةِ وَلَيْسَتْ عِنْدَهُ جَذَعَةٌ وَعِنْدَهُ حِقَّةٌ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيَجْعَلُ مَعَهَا شَاتَيْنِ إِنْ اسْتَيْسَرَتَا لَهُ أَوْ عِشْرِينَ دِرْهَمًا وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ الْحِقَّةِ وَلَيْسَتْ عِنْدَهُ إِلَّا جَذَعَةٌ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيُعْطِيهِ الْمُصَدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ الْحِقَّةِ وَلَيْسَتْ عِنْدَهُ وَعِنْدَهُ بِنْتُ لَبُونٍ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيَجْعَلُ مَعَهَا شَاتَيْنِ إِنْ اسْتَيْسَرَتَا لَهُ أَوْ عِشْرِينَ دِرْهَمًا وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ ابْنَةِ لَبُونٍ وَلَيْسَتْ عِنْدَهُ إِلَّا حِقَّةٌ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيُعْطِيهِ الْمُصَدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ ابْنَةِ لَبُونٍ وَلَيْسَتْ عِنْدَهُ ابْنَةُ لَبُونٍ وَعِنْدَهُ ابْنَةُ مَخَاضٍ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيَجْعَلُ مَعَهَا شَاتَيْنِ إِنْ اسْتَيْسَرَتَا لَهُ أَوْ عِشْرِينَ دِرْهَمًا وَمَنْ بَلَغَتْ صَدَقَتُهُ بِنْتَ مَخَاضٍ وَلَيْسَ عِنْدَهُ إِلَّا ابْنُ لَبُونٍ ذَكَرٌ فَإِنَّهُ يُقْبَلُ مِنْهُ وَلَيْسَ مَعَهُ شَيْءٌ وَمَنْ لَمْ يَكُنْ عِنْدَهُ إِلَّا أَرْبَعٌ مِنْ الْإِبِلِ فَلَيْسَ فِيهَا شَيْءٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا وَفِي صَدَقَةِ الْغَنَمِ فِي سَائِمَتِهَا إِذَا كَانَتْ أَرْبَعِينَ فَفِيهَا شَاةٌ إِلَى عِشْرِينَ وَمِائَةٍ فَإِنْ زَادَتْ فَفِيهَا شَاتَانِ إِلَى مِائَتَيْنِ فَإِذَا زَادَتْ وَاحِدَةٌ فَفِيهَا ثَلَاثُ شِيَاهٍ إِلَى ثَلَاثِ مِائَةٍ فَإِذَا زَادَتْ فَفِي كُلِّ مِائَةٍ شَاةٌ وَلَا تُؤْخَذُ فِي الصَّدَقَةِ هَرِمَةٌ وَلَا ذَاتُ عَوَارٍ وَلَا تَيْسٌ إِلَّا أَنْ يَشَاءَ الْمُصَدِّقُ وَلَا يُجْمَعُ بَيْنَ مُتَفَرِّقٍ وَلَا يُفَرَّقُ بَيْنَ مُجْتَمِعٍ خَشْيَةَ الصَّدَقَةِ وَمَا كَانَ مِنْ خَلِيطَيْنِ فَإِنَّهُمَا يَتَرَاجَعَانِ بَيْنَهُمَا بِالسَّوِيَّةِ وَإِذَا كَانَتْ سَائِمَةُ الرَّجُلِ نَاقِصَةً مِنْ أَرْبَعِينَ شَاةً وَاحِدَةً فَلَيْسَ فِيهَا شَيْءٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا وَفِي الرِّقَةِ رُبْعُ الْعُشْرِ فَإِذَا لَمْ يَكُنْ الْمَالُ إِلَّا تِسْعِينَ وَمِائَةَ دِرْهَمٍ فَلَيْسَ فِيهَا شَيْءٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا‏.‏",
    "malay_translation": "Hadis ini menceritakan tentang faraid zakat yang telah diwajibkan oleh Rasulullah SAW ke atas umat Islam, sebagaimana diperintahkan oleh Allah SWT.  Jika seorang Muslim diminta membayar zakat mengikut kadar yang sepatutnya, hendaklah dia membayarnya. Tetapi jika diminta melebihi kadar tersebut, dia tidak perlu membayarnya.\n\nBagi unta, jika bilangannya kurang daripada 25 ekor, bagi setiap 5 ekor, 1 ekor kambing perlu disedekahkan. Jika bilangannya mencapai 25 ekor, maka seekor unta betina berusia 2 tahun perlu disedekahkan sehingga 35 ekor. Jika tiada unta betina berusia 2 tahun, maka unta jantan berusia 3 tahun boleh disedekahkan. Jika bilangannya mencapai 36 ekor, maka seekor unta betina berusia 3 tahun perlu disedekahkan sehingga 45 ekor.  Jika mencapai 46 ekor, maka seekor unta betina berusia 4 tahun yang telah dikawinkan perlu disedekahkan sehingga 60 ekor. Jika mencapai 61 ekor, maka seekor unta betina berusia 5 tahun perlu disedekahkan sehingga 75 ekor. Jika mencapai 76 ekor, maka dua ekor unta betina berusia 2 tahun perlu disedekahkan sehingga 90 ekor. Jika mencapai 91 ekor, maka dua ekor unta betina berusia 4 tahun yang telah dikawinkan perlu disedekahkan sehingga 120 ekor. Jika melebihi 120 ekor, maka bagi setiap 40 ekor, seekor unta betina berusia 3 tahun perlu disedekahkan, dan bagi setiap 50 ekor, seekor unta betina berusia 4 tahun perlu disedekahkan.\n\nJika umur unta berbeza dan yang diwajibkan adalah unta betina berusia 5 tahun, tetapi dia tidak memilikinya, namun dia mempunyai unta betina berusia 4 tahun, maka ia diterima dan dia perlu menambah dua ekor kambing jika ada, atau 20 dirham. Jika yang diwajibkan adalah unta betina berusia 4 tahun, tetapi dia hanya mempunyai unta betina berusia 5 tahun, ia diterima dan penyelia zakat akan mengembalikan 20 dirham atau dua ekor kambing kepadanya. Jika yang diwajibkan adalah unta betina berusia 4 tahun, tetapi dia hanya mempunyai unta betina berusia 3 tahun, ia diterima dan dia perlu menambah dua ekor kambing jika ada, atau 20 dirham. Jika yang diwajibkan adalah unta betina berusia 2 tahun, tetapi dia hanya mempunyai unta jantan berusia 3 tahun, ia diterima dan tidak perlu menambah apa-apa.\n\nJika hanya ada 4 ekor unta, tiada zakat diwajibkan kecuali jika pemiliknya ingin memberi secara sukarela.\n\nBagi zakat kambing, jika bilangannya 40 ekor, maka seekor kambing perlu disedekahkan sehingga 120 ekor. Jika melebihi itu, maka dua ekor kambing perlu disedekahkan sehingga 200 ekor. Jika melebihi itu, maka tiga ekor kambing perlu disedekahkan sehingga 300 ekor.  Jika melebihi itu, maka bagi setiap 100 ekor kambing, seekor kambing perlu disedekahkan. Kambing yang tua, cacat, atau jantan tidak boleh diambil sebagai zakat kecuali jika pemiliknya membenarkannya.  Kumpulan kambing yang berasingan tidak boleh digabungkan dan kumpulan yang telah bersatu tidak boleh dipisahkan bagi mengelakkan atau mengurangkan zakat.  Jika terdapat dua orang rakan kongsi, mereka perlu berunding dengan adil. Jika kambing seseorang itu kurang seekor daripada 40 ekor, maka tiada zakat diwajibkan kecuali jika pemiliknya ingin memberi secara sukarela.  Bagi perak, zakatnya ialah seperempat daripada persepuluh. Jika harta hanya 190 dirham, tiada zakat diwajibkan kecuali jika pemiliknya ingin memberi secara sukarela."
  },
  {
    "id": 36232,
    "hadith_number": 69,
    "tajuk_hadith": "Puji-pujian terhadap Solat Ibn Juraij",
    "perawi_melayu": "Abdul Razzaq berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَهْلُ مَكَّةَ يَقُولُونَ أَخَذَ ابْنُ جُرَيْجٍ الصَّلَاةَ مِنْ عَطَاءٍ وَأَخَذَهَا عَطَاءٌ مِنْ ابْنِ الزُّبَيْرِ وَأَخَذَهَا ابْنُ الزُّبَيْرِ مِنْ أَبِي بَكْرٍ وَأَخَذَهَا أَبُو بَكْرٍ مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا رَأَيْتُ أَحَدًا أَحْسَنَ صَلَاةً مِنْ ابْنِ جُرَيْجٍ‏.‏",
    "malay_translation": "Abdul Razzaq meriwayatkan:  Penduduk Mekah berkata, “Ibn Juraij mempelajari solat daripada ‘Ata’, dan ‘Ata’ mempelajarinya daripada Ibn az-Zubair, dan Ibn az-Zubair mempelajarinya daripada Abu Bakar, dan Abu Bakar mempelajarinya daripada Nabi SAW.  Aku tidak pernah melihat sesiapa yang lebih baik solatnya daripada Ibn Juraij.”  (Ini adalah laporan pujian terhadap Ibn Juraij dan bukan hadis; ini dinyatakan oleh Ahmad Shakir)"
  },
  {
    "id": 36233,
    "hadith_number": 70,
    "tajuk_hadith": "Perkahwinan Hafsah binti Umar",
    "perawi_melayu": "Ia diriwayatkan daripada Salim daripada Ibnu Umar bahawa Umar berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، عَنْ عُمَرَ، قَالَ تَأَيَّمَتْ حَفْصَةُ بِنْتُ عُمَرَ مِنْ خُنَيْسٍ أَوْ حُذَيْفَةَ بْنِ حُذَافَةَ شَكَّ عَبْدُ الرَّزَّاقِ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِمَّنْ شَهِدَ بَدْرًا فَتُوُفِّيَ بِالْمَدِينَةِ قَالَ فَلَقِيتُ عُثْمَانَ بْنَ عَفَّانَ فَعَرَضْتُ عَلَيْهِ حَفْصَةَ فَقُلْتُ إِنْ شِئْتَ أَنْكَحْتُكَ حَفْصَةَ قَالَ سَأَنْظُرُ فِي ذَلِكَ فَلَبِثْتُ لَيَالِيَ فَلَقِيَنِي فَقَالَ مَا أُرِيدُ أَنْ أَتَزَوَّجَ يَوْمِي هَذَا قَالَ عُمَرُ فَلَقِيتُ أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَقُلْتُ إِنْ شِئْتَ أَنْكَحْتُكَ حَفْصَةَ ابْنَةَ عُمَرَ فَلَمْ يَرْجِعْ إِلَيَّ شَيْئًا فَكُنْتُ أَوْجَدَ عَلَيْهِ مِنِّي عَلَى عُثْمَانَ فَلَبِثْتُ لَيَالِيَ فَخَطَبَهَا إِلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَنْكَحْتُهَا إِيَّاهُ فَلَقِيَنِي أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَقَالَ لَعَلَّكَ وَجَدْتَ عَلَيَّ حِينَ عَرَضْتَ عَلَيَّ حَفْصَةَ فَلَمْ أَرْجِعْ إِلَيْكَ شَيْئًا قَالَ قُلْتُ نَعَمْ قَالَ فَإِنَّهُ لَمْ يَمْنَعْنِي أَنْ أَرْجِعَ إِلَيْكَ شَيْئًا حِينَ عَرَضْتَهَا عَلَيَّ إِلَّا أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَذْكُرُهَا وَلَمْ أَكُنْ لِأُفْشِيَ سِرَّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَوْ تَرَكَهَا لَنَكَحْتُهَا‏.‏",
    "malay_translation": "Umar meriwayatkan bahawa Hafsah binti Umar menjadi balu kepada Khunais atau Hudhaifah bin Hudhafah – Abdul Razzaq tidak pasti.  Beliau adalah antara sahabat Nabi SAW yang hadir di Perang Badar, dan beliau meninggal dunia di Madinah.  Umar berkata, “Kemudian aku bertemu Usman bin Affan dan aku melamar Hafsah kepadanya. Aku berkata, ‘Jika engkau mahu, aku akan menikahkan Hafsah kepadamu.’  Dia berkata, ‘Aku akan memikirkannya.’ Beberapa hari berlalu, kemudian dia bertemu aku dan berkata, ‘Aku tidak mahu berkahwin pada masa ini.’  Kemudian aku bertemu Abu Bakar dan aku berkata, ‘Jika engkau mahu, aku akan menikahkan Hafsah binti Umar kepadamu.’ Dia tidak memberikan sebarang jawapan, dan aku lebih marah kepadanya berbanding Usman. Beberapa hari berlalu, kemudian Rasulullah SAW meminang Hafsah dan aku menikahkannya dengan Baginda. Kemudian Abu Bakar bertemu aku dan berkata, ‘Mungkin engkau marah kepadaku kerana aku tidak memberikan jawapan apabila engkau melamar Hafsah kepadaku?’ Aku berkata, ‘Ya.’  Dia berkata, ‘Tiada apa yang menghalang aku untuk menjawabmu ketika engkau melamarnya kecuali aku telah mendengar Rasulullah SAW menyebut tentangnya, dan aku tidak mahu mendedahkan rahsia Rasulullah SAW. Sekiranya Baginda tidak mengahwininya, nescaya aku akan mengahwininya.’"
  },
  {
    "id": 36234,
    "hadith_number": 71,
    "tajuk_hadith": "Kekejaman Terhadap Hamba dan Ganjaran Kebaikan",
    "perawi_melayu": "Daripada Abu Bakar As-Siddiq r.a.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ سُلَيْمَانَ، قَالَ سَمِعْتُ الْمُغِيرَةَ بْنَ مُسْلِمٍ أَبَا سَلَمَةَ، عَنْ فَرْقَدٍ السَّبَخِيِّ، عَنْ مُرَّةَ الطَّيِّبِ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَدْخُلُ الْجَنَّةَ سَيِّئُ الْمَلَكَةِ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَلَيْسَ أَخْبَرْتَنَا أَنَّ هَذِهِ الْأُمَّةَ أَكْثَرُ الْأُمَمِ مَمْلُوكِينَ وَأَيْتَامًا قَالَ بَلَى فَأَكْرِمُوهُمْ كَرَامَةَ أَوْلَادِكُمْ وَأَطْعِمُوهُمْ مِمَّا تَأْكُلُونَ قَالُوا فَمَا يَنْفَعُنَا فِي الدُّنْيَا يَا رَسُولَ اللَّهِ قَالَ فَرَسٌ صَالِحٌ تَرْتَبِطُهُ تُقَاتِلُ عَلَيْهِ فِي سَبِيلِ اللَّهِ وَمَمْلُوكٌ يَكْفِيكَ فَإِذَا صَلَّى فَهُوَ أَخُوكَ‏.‏",
    "malay_translation": "Daripada Ishak bin Sulaiman, katanya: Aku mendengar Al-Mughirah bin Muslim, Abu Salamah, daripada Farqad As-Sabakhi, daripada Murrah Ath-Thayyib, daripada Abu Bakar As-Siddiq r.a., katanya: Rasulullah SAW bersabda:  \"Tiada sesiapa yang melayan hambanya dengan teruk akan masuk syurga.\"  Lalu seorang lelaki berkata: \"Wahai Rasulullah, bukankah engkau telah memberitahu kami bahawa umat ini merupakan umat yang paling ramai hamba dan anak yatim?\" Baginda menjawab: \"Ya, maka muliakanlah mereka sebagaimana kamu memuliakan anak-anak kamu dan beri makan kepada mereka daripada apa yang kamu makan.\" Mereka bertanya: \"Apakah yang memberi manfaat kepada kami di dunia ini, wahai Rasulullah?\" Baginda menjawab: \"Seekor kuda yang baik yang kamu sediakan untuk berperang di jalan Allah dan seorang hamba yang melayanmu. Jika dia masuk Islam (solat), maka dia adalah saudara kamu.\" "
  },
  {
    "id": 36235,
    "hadith_number": 72,
    "tajuk_hadith": "Pengumpulan Al-Quran oleh Abu Bakar",
    "perawi_melayu": "Ibn as-Sabbaq berkata bahawa Zaid bin Thabit memberitahunya bahawa Abu Bakar telah menghantar utusan kepadanya untuk memberitahunya bahawa sejumlah besar penduduk di Yamamah telah terkorban. Dia mendapati Umar bersamanya dan Abu Bakar berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، قَالَ أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي ابْنُ السَّبَّاقِ، قَالَ أَخْبَرَنِي زَيْدُ بْنُ ثَابِتٍ، أَنَّ أَبَا بَكْرٍ، رَضِيَ اللَّهُ عَنْهُ أَرْسَلَ إِلَيْهِ مَقْتَلَ أَهْلِ الْيَمَامَةِ فَإِذَا عُمَرُ عِنْدَهُ فَقَالَ أَبُو بَكْرٍ إِنَّ عُمَرَ أَتَانِي فَقَالَ إِنَّ الْقَتْلَ قَدْ اسْتَحَرَّ بِأَهْلِ الْيَمَامَةِ مِنْ قُرَّاءِ الْقُرْآنِ مِنْ الْمُسْلِمِينَ وَأَنَا أَخْشَى أَنْ يَسْتَحِرَّ الْقَتْلُ بِالْقُرَّاءِ فِي الْمَوَاطِنِ فَيَذْهَبَ قُرْآنٌ كَثِيرٌ لَا يُوعَى وَإِنِّي أَرَى أَنْ تَأْمُرَ بِجَمْعِ الْقُرْآنِ فَقُلْتُ لِعُمَرَ وَكَيْفَ أَفْعَلُ شَيْئًا لَمْ يَفْعَلْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ هُوَ وَاللَّهِ خَيْرٌ فَلَمْ يَزَلْ يُرَاجِعُنِي فِي ذَلِكَ حَتَّى شَرَحَ اللَّهُ بِذَلِكَ صَدْرِي وَرَأَيْتُ فِيهِ الَّذِي رَأَى عُمَرُ قَالَ زَيْدٌ وَعُمَرُ عِنْدَهُ جَالِسٌ لَا يَتَكَلَّمُ فَقَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ إِنَّكَ شَابٌّ عَاقِلٌ لَا نَتَّهِمُكَ وَقَدْ كُنْتَ تَكْتُبُ الْوَحْيَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاجْمَعْهُ قَالَ زَيْدٌ فَوَاللَّهِ لَوْ كَلَّفُونِي نَقْلَ جَبَلٍ مِنْ الْجِبَالِ مَا كَانَ بِأَثْقَلَ عَلَيَّ مِمَّا أَمَرَنِي بِهِ مِنْ جَمْعِ الْقُرْآنِ فَقُلْتُ كَيْفَ تَفْعَلُونَ شَيْئًا لَمْ يَفْعَلْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Usman bin Umar, katanya; telah menceritakan kepada kami Yunus, dari Az- Zuhri, katanya; telah menceritakan kepadaku Ibnu As-Sabbaq, katanya; telah menceritakan kepadaku Zaid bin Tsabit bahawa Abu Bakar r.a. telah menghantar utusan kepadanya mengenai pembunuhan penduduk Yamamah. Ketika itu Umar berada di sisinya. Maka Abu Bakar berkata: Umar telah datang kepadaku lalu berkata: “Sesungguhnya pembunuhan telah banyak berlaku di kalangan penduduk Yamamah daripada kalangan para huffaz al-Quran dari kalangan umat Islam. Dan aku khuatir pembunuhan itu akan terus berlaku terhadap huffaz di medan perang yang lain sehingga hilanglah banyak ayat al-Quran yang tidak dapat diganti. Dan aku berpendapat bahawa engkau perlu memerintahkan pengumpulan al-Quran.” Maka aku bertanya kepada Umar: “Bagaimanakah aku hendak melakukan sesuatu yang belum pernah dilakukan oleh Rasulullah SAW?” Umar menjawab: “Demi Allah, ini adalah satu kebaikan.” Lalu dia terus merayu kepadaku sehingga Allah membuka dadaku dan aku melihat kebaikan seperti yang dilihat oleh Umar. Zaid berkata: Ketika itu Umar duduk di sisinya tanpa berkata apa-apa. Abu Bakar r.a. berkata: “Engkau adalah seorang pemuda yang bijaksana dan kita mempercayai engkau. Engkau pernah menulis wahyu bagi Rasulullah SAW, maka kumpulkanlah ia.” Zaid berkata: Demi Allah, sekiranya mereka menyuruhku memindahkan sebuah gunung, nescaya ia tidak lebih berat dari apa yang telah mereka perintahkan kepadaku iaitu mengumpul al-Quran. Aku berkata: Bagaimanakah kamu hendak melakukan sesuatu yang tidak pernah dilakukan oleh Rasulullah SAW?"
  },
  {
    "id": 36236,
    "hadith_number": 73,
    "tajuk_hadith": "Ketetapan Abu Bakar, Umar, dan Uthman terhadap wasiat Rasulullah",
    "perawi_melayu": "Daripada Ibnu Abbas ra.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الْأَعْمَشِ، عَنْ إِسْمَاعِيلَ بْنِ رَجَاءٍ، عَنْ عُمَيْرٍ، مَوْلَى الْعَبَّاسِ عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمَّا قُبِضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاسْتُخْلِفَ أَبُو بَكْرٍ خَاصَمَ الْعَبَّاسُ عَلِيًّا فِي أَشْيَاءَ تَرَكَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ شَيْءٌ تَرَكَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يُحَرِّكْهُ فَلَا أُحَرِّكُهُ فَلَمَّا اسْتُخْلِفَ عُمَرُ اخْتَصَمَا إِلَيْهِ فَقَالَ شَيْءٌ لَمْ يُحَرِّكْهُ أَبُو بَكْرٍ فَلَسْتُ أُحَرِّكُهُ قَالَ فَلَمَّا اسْتُخْلِفَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ اخْتَصَمَا إِلَيْهِ قَالَ فَأَسْكَتَ عُثْمَانُ وَنَكَسَ رَأْسَهُ قَالَ ابْنُ عَبَّاسٍ فَخَشِيتُ أَنْ يَأْخُذَهُ فَضَرَبْتُ بِيَدِي بَيْنَ كَتِفَيْ الْعَبَّاسِ فَقُلْتُ يَا أَبَتِ أَقْسَمْتُ عَلَيْكَ إِلَّا سَلَّمْتَهُ لِعَلِيٍّ قَالَ فَسَلَّمَهُ لَهُ‏.‏",
    "malay_translation": "Ibnu Abbas berkata:  Setelah Rasulullah SAW wafat dan Abu Bakar dilantik sebagai khalifah, al-Abbas berselisih faham dengan Ali tentang beberapa perkara yang ditinggalkan oleh Rasulullah SAW.  Abu Bakar berkata: “Ia adalah sesuatu yang ditinggalkan oleh Rasulullah SAW seperti sedia ada dan aku tidak akan mengubahnya.” Kemudian, apabila Umar dilantik sebagai khalifah, mereka merujuk perselisihan itu kepadanya. Umar berkata:  “Ia adalah sesuatu yang tidak diubah oleh Abu Bakar, maka aku pun tidak akan mengubahnya.”  Apabila Uthman dilantik sebagai khalifah, mereka merujuk perselisihan itu kepadanya. Uthman berdiam diri dan menundukkan kepalanya. Ibnu Abbas berkata: “Aku bimbang beliau (Uthman) akan mengambilnya semula, lalu aku memukul bahu al-Abbas dan berkata:  Wahai bapaku, aku bersumpah atasmu, kecuali engkau serahkannya kepada Ali.” Maka, al-Abbas pun menyerahkannya kepadanya."
  },
  {
    "id": 36237,
    "hadith_number": 74,
    "tajuk_hadith": "Pengurusan Harta Pusaka Rasulullah SAW",
    "perawi_melayu": "Ia diriwayatkan bahawa 'Asim bin Kulaib berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَاصِمِ بْنِ كُلَيْبٍ، قَالَ حَدَّثَنِي شَيْخٌ، مِنْ قُرَيْشٍ مِنْ بَنِي تَيْمٍ قَالَ حَدَّثَنِي فُلَانٌ، وَفُلَانٌ، وَقَالَ، فَعَدَّ سِتَّةً أَوْ سَبْعَةً كُلُّهُمْ مِنْ قُرَيْشٍ فِيهِمْ عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ قَالَ بَيْنَا نَحْنُ جُلُوسٌ عِنْدَ عُمَرَ إِذْ دَخَلَ عَلِيٌّ وَالْعَبَّاسُ رَضِيَ اللَّهُ عَنْهُمَا قَدْ ارْتَفَعَتْ أَصْوَاتُهُمَا فَقَالَ عُمَرُ مَهْ يَا عَبَّاسُ قَدْ عَلِمْتُ مَا تَقُولُ تَقُولُ ابْنُ أَخِي وَلِي شَطْرُ الْمَالِ وَقَدْ عَلِمْتُ مَا تَقُولُ يَا عَلِيُّ تَقُولُ ابْنَتُهُ تَحْتِي وَلَهَا شَطْرُ الْمَالِ وَهَذَا مَا كَانَ فِي يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَدْ رَأَيْنَا كَيْفَ كَانَ يَصْنَعُ فِيهِ فَوَلِيَهُ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ مِنْ بَعْدِهِ فَعَمِلَ فِيهِ بِعَمَلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ وَلِيتُهُ مِنْ بَعْدِ أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَأَحْلِفُ بِاللَّهِ لَأَجْهَدَنَّ أَنْ أَعْمَلَ فِيهِ بِعَمَلِ رَسُولِ اللَّهِ وَعَمَلِ أَبِي بَكْرٍ ثُمَّ قَالَ حَدَّثَنِي أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ وَحَلَفَ بِأَنَّهُ لَصَادِقٌ أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ النَّبِيَّ لَا يُورَثُ وَإِنَّمَا مِيرَاثُهُ فِي فُقَرَاءِ الْمُسْلِمِينَ وَالْمَسَاكِينِ و حَدَّثَنِي أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ وَحَلَفَ بِاللَّهِ إِنَّهُ صَادِقٌ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ النَّبِيَّ لَا يَمُوتُ حَتَّى يَؤُمَّهُ بَعْضُ أُمَّتِهِ وَهَذَا مَا كَانَ فِي يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَدْ رَأَيْنَا كَيْفَ كَانَ يَصْنَعُ فِيهِ فَإِنْ شِئْتُمَا أَعْطَيْتُكُمَا لِتَعْمَلَا فِيهِ بِعَمَلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَمَلِ أَبِي بَكْرٍ حَتَّى أَدْفَعَهُ إِلَيْكُمَا قَالَ فَخَلَوَا ثُمَّ جَاءَا فَقَالَ الْعَبَّاسُ ادْفَعْهُ إِلَى عَلِيٍّ فَإِنِّي قَدْ طِبْتُ نَفْسًا بِهِ لَهُ‏.‏",
    "malay_translation": "Seorang lelaki tua dari Quraisy, dari Bani Taim, memberitahu saya: Si anu, dan si anu memberitahu saya - dan dia menyenaraikan enam atau tujuh orang, semuanya dari Quraisy, salah seorang daripadanya ialah Abdullah bin az-Zubair - dan berkata: Ketika kami duduk bersama Umar, Ali dan Abbas masuk, dan mereka telah meninggikan suara mereka. Umar berkata: Berhentilah, wahai Abbas! Aku tahu apa yang akan kau katakan. Kau akan berkata: Dia (Nabi SAW) adalah anak saudara lelakiku dan aku berhak mendapat separuh daripada harta itu. Dan aku tahu apa yang akan kau katakan, wahai Ali. Kau akan berkata: Anak perempuannya berkahwin denganku dan dia berhak mendapat separuh daripada harta itu. Inilah harta yang ada pada Rasulullah SAW, dan kami telah melihat bagaimana baginda menguruskannya. Kemudian Abu Bakar menguruskannya selepas baginda, dan beliau menguruskannya dengan cara yang sama seperti yang dilakukan oleh Rasulullah SAW. Kemudian aku menguruskannya selepas Abu Bakar dan aku bersumpah demi Allah bahawa aku akan berusaha sedaya upaya untuk menguruskannya seperti yang dilakukan oleh Rasulullah SAW dan Abu Bakar. Kemudian beliau berkata: Abu Bakar memberitahu saya dan beliau bersumpah demi Allah bahawa beliau berkata benar, bahawa beliau mendengar Nabi SAW bersabda:  'Nabi tidak diwarisi; sebaliknya hartanya diberikan kepada orang miskin dan fakir Muslim.' Dan Abu Bakar memberitahu saya dan bersumpah demi Allah bahawa beliau berkata benar, bahawa Nabi SAW bersabda: 'Tiada Nabi yang meninggal dunia sehingga dia diimamkan oleh salah seorang umatnya.' Inilah harta yang ada pada Rasulullah SAW dan kami telah melihat bagaimana baginda menguruskannya. Jika kamu berdua mahu, aku akan memberikannya kepada kamu untuk menguruskannya dengan cara yang sama seperti yang dilakukan oleh Rasulullah SAW dan Abu Bakar, supaya aku boleh menyerahkannya kepada kamu. Mereka berbincang secara sulit, kemudian mereka datang dan Abbas berkata: Serahkan kepada Ali, kerana aku berasa senang jika beliau yang menguruskannya."
  },
  {
    "id": 36238,
    "hadith_number": 75,
    "tajuk_hadith": "Rasulullah SAW Tiada Harta Pusaka",
    "perawi_melayu": "Daripada Abu Hurairah bahawa Fatimah datang kepada Abu Bakar dan Umar untuk meminta bahagian pusakanya daripada Rasulullah SAW. Mereka berkata:",
    "english_text": "We heard the Messenger of Allah (ﷺ) say: “I am not to be inherited from.`",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَطَاءٍ، قَالَ أَخْبَرَنَا مُحَمَّدُ بْنُ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ فَاطِمَةَ، رَضِيَ اللَّهُ عَنْهَا جَاءَتْ أَبَا بَكْرٍ وَعُمَرَ رَضِيَ اللَّهُ عَنْهُمَا تَطْلُبُ مِيرَاثَهَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَا إِنَّا سَمِعْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنِّي لَا أُورَثُ‏.‏",
    "malay_translation": "Kami telah mendengar Rasulullah SAW bersabda:  “Aku tidak diwarisi.”  (Abu Hurairah meriwayatkan bahawa Fatimah telah datang kepada Abu Bakar dan Umar untuk meminta bahagian pusakanya daripada Rasulullah SAW. Mereka berdua berkata bahawa mereka telah mendengar Rasulullah SAW bersabda sedemikian.)"
  },
  {
    "id": 36239,
    "hadith_number": 76,
    "tajuk_hadith": "Khutbah Pertama Abu Bakar as-Siddiq",
    "perawi_melayu": "Daripada Qais bin Abi Hazim berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، قَالَ حَدَّثَنَا عِيسَى يَعْنِي ابْنَ الْمُسَيَّبِ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، قَالَ إِنِّي لَجَالِسٌ عِنْدَ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ خَلِيفَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ وَفَاةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَهْرٍ فَذَكَرَ قِصَّةً فَنُودِيَ فِي النَّاسِ أَنَّ الصَّلَاةَ جَامِعَةٌ وَهِيَ أَوَّلُ صَلَاةٍ فِي الْمُسْلِمِينَ نُودِيَ بِهَا إِنَّ الصَّلَاةَ جَامِعَةٌ فَاجْتَمَعَ النَّاسُ فَصَعِدَ الْمِنْبَرَ شَيْئًا صُنِعَ لَهُ كَانَ يَخْطُبُ عَلَيْهِ وَهِيَ أَوَّلُ خُطْبَةٍ خَطَبَهَا فِي الْإِسْلَامِ قَالَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ يَا أَيُّهَا النَّاسُ وَلَوَدِدْتُ أَنَّ هَذَا كَفَانِيهِ غَيْرِي وَلَئِنْ أَخَذْتُمُونِي بِسُنَّةِ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أُطِيقُهَا إِنْ كَانَ لَمَعْصُومًا مِنْ الشَّيْطَانِ وَإِنْ كَانَ لَيَنْزِلُ عَلَيْهِ الْوَحْيُ مِنْ السَّمَاءِ‏.‏",
    "malay_translation": "Aku sedang duduk bersama Abu Bakar as-Siddiq, Khalifah Rasulullah SAW, sebulan selepas wafat Nabi SAW.  Beliau menceritakan suatu kisah, kemudian diumumkan kepada orang ramai, “Solat Jamaah!”  Ini merupakan kali pertama azan solat Jamaah dikumandangkan di kalangan umat Islam.  Orang ramai berkumpul, lalu beliau naik mimbar – iaitu tempat yang disediakan untuknya berkhutbah – dan itu merupakan khutbah pertama beliau dalam Islam. Beliau memuji dan mengagungkan Allah SWT, kemudian berkata: Wahai sekalian manusia, seandainya orang lain dapat menggalas tanggungjawab ini, kerana jika kamu mencontohiku dengan sunnah Nabi kamu SAW, aku tidak mampu melakukannya.  Nabi SAW adalah maksum daripada gangguan syaitan dan wahyu sentiasa diturunkan kepadanya dari langit."
  },
  {
    "id": 36240,
    "hadith_number": 77,
    "tajuk_hadith": "Doa Abu Bakar As-Siddiq",
    "perawi_melayu": "Daripada riwayat Mujahid:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا شَيْبَانُ، عَنْ لَيْثٍ، عَنْ مُجَاهِدٍ، قَالَ قَالَ أَبُو بَكْرٍ الصِّدِّيقُ رَضِيَ اللَّهُ عَنْهُ أَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَقُولَ إِذَا أَصْبَحْتُ وَإِذَا أَمْسَيْتُ وَإِذَا أَخَذْتُ مَضْجَعِي مِنْ اللَّيْلِ اللَّهُمَّ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ أَنْتَ رَبُّ كُلِّ شَيْءٍ وَمَلِيكُهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ",
    "malay_translation": "Telah menceritakan kepada kami Hashim bin Al-Qasim, telah menceritakan kepada kami Syaiban, dari Laits, dari Mujahid, dia berkata; Abu Bakar As-Siddiq r.a. berkata: Rasulullah SAW memerintahkanku untuk membaca doa ini apabila aku bangun pagi, petang dan sebelum tidur pada waktu malam: Ya Allah, Pencipta langit dan bumi, Yang Maha Mengetahui perkara ghaib dan nyata, Engkaulah Tuhan dan Raja segala sesuatu. Aku bersaksi bahawa tiada Tuhan melainkan Engkau seorang sahaja, tiada sekutu bagi-Mu, dan bahawa Muhammad adalah hamba dan utusan-Mu. Aku berlindung kepada-Mu daripada kejahatan diriku sendiri dan kejahatan syaitan serta syiriknya dan daripada aku melakukan kejahatan kepada diriku sendiri atau kepada seorang Muslim."
  }
]
