[
  {
    "id": 37523,
    "hadith_number": 1360,
    "tajuk_hadith": "Rambut Nabi SAW Berwarna Henna",
    "perawi_melayu": "Wakie', daripada Sufian, daripada Iyad bin Laqit As-Sadusi, daripada Abi Rimthah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ إِيَادِ بْنِ لَقِيطٍ السَّدُوسِيِّ، عَنْ أَبِي رِمْثَةَ، قَالَ خَرَجْتُ مَعَ أَبِي حَتَّى أَتَيْنَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَأَيْتُ بِرَأْسِهِ رَدْعَ حِنَّاءٍ‏.‏",
    "malay_translation": "Wakie' meriwayatkan daripada Sufian, daripada Iyad bin Laqit As-Sadusi, daripada Abi Rimthah, bahawa dia berkata:  \"Aku keluar bersama bapaku sehingga kami sampai kepada Nabi SAW, lalu aku melihat di kepalanya celupan pacar.\""
  },
  {
    "id": 37524,
    "hadith_number": 1361,
    "tajuk_hadith": "Tangan Pemberi yang Utama",
    "perawi_melayu": "Amru bin Al-Haytsam Abu Qathan dan Abu An Nadhr meriwayatkan dari Al-Mas'udi, dari Iyad bin Laqit, dari Abu Rimtha, dari Nabi SAW.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ الْهَيْثَمِ أَبُو قَطَنٍ، وَأَبُو النَّضْرِ، قَالَا حَدَّثَنَا الْمَسْعُودِيُّ، عَنْ إِيَادِ بْنِ لَقِيطٍ، عَنْ أَبِي رِمْثَةَ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَدُ الْمُعْطِي الْعُلْيَا أُمَّكَ وَأَبَاكَ وَأُخْتَكَ وَأَخَاكَ ثُمَّ أَدْنَاكَ أَدْنَاكَ وَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ هَؤُلَاءِ بَنُو يَرْبُوعٍ قَتَلَةُ فُلَانٍ قَالَ أَلَا لَا تَجْنِي نَفْسٌ عَلَى أُخْرَى و قَالَ أَبِي قَالَ أَبُو النَّضْرِ فِي حَدِيثِهِ دَخَلْتُ الْمَسْجِدَ فَإِذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ وَيَقُولُ يَدُ الْمُعْطِي الْعُلْيَا‏.‏",
    "malay_translation": "Amru bin Al-Haytsam Abu Qathan dan Abu An Nadhr meriwayatkan daripada Al-Mas'udi, daripada Iyad bin Laqit, daripada Abu Rimtha, daripada Nabi SAW, baginda bersabda: \"Tangan pemberi yang utama ialah kepada ibumu, bapamu, kakakmu, abangmu, kemudian kepada kaum kerabatmu yang terdekat.\"  Dan seorang lelaki bertanya: \"Wahai Rasulullah, mereka ini Bani Yarbu' telah membunuh si fulan.\" Baginda bersabda: \"Janganlah seseorang itu menzalimi orang lain.\"  Abu An Nadhr berkata dalam riwayat beliau: \"Aku masuk ke masjid dan mendapati Rasulullah SAW sedang berkhutbah sambil bersabda: \"Tangan pemberi yang utama...\""
  },
  {
    "id": 37525,
    "hadith_number": 1362,
    "tajuk_hadith": "Hubungan Keluarga dan Penyelesaian Perselisihan",
    "perawi_melayu": "Yunus, Hammad ibn Salamah, Abd al-Malik ibn Umair, Iyadd ibn Laqit, dan Abu Rimthah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يُونُسُ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، حَدَّثَنَا إِيَادُ بْنُ لَقِيطٍ، عَنْ أَبِي رِمْثَةَ، قَالَ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعِنْدَهُ نَاسٌ مِنْ رَبِيعَةَ يَخْتَصِمُونَ فِي دَمٍ فَقَالَ الْيَدُ الْعُلْيَا أُمُّكَ وَأَبُوكَ وَأُخْتُكَ وَأَخُوكَ وَأَدْنَاكَ أَدْنَاكَ قَالَ فَنَظَرَ فَقَالَ مَنْ هَذَا مَعَكَ أَبَا رِمْثَةَ قَالَ قُلْتُ ابْنِي قَالَ أَمَا إِنَّهُ لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ وَذَكَرَ قِصَّةَ الْخَاتَمِ‏.‏",
    "malay_translation": "Yunus telah meriwayatkan kepada kami, Hammad (iaitu Hammad ibn Salamah) telah meriwayatkan kepada kami daripada Abd al-Malik ibn Umair, Iyadd ibn Laqit telah meriwayatkan kepada kami daripada Abu Rimthah.  Abu Rimthah berkata, \"Aku datang kepada Nabi SAW, dan di sisi Baginda ada sekumpulan orang daripada kabilah Rabi’ah yang sedang bertelagah mengenai satu pembunuhan.  Maka Baginda SAW bersabda, ‘Tangan yang paling atas ialah ibu, bapa, kakak, adik lelaki dan kerabat terdekatmu.’ Kemudian Baginda SAW memandang dan bertanya, ‘Siapakah orang ini bersamamu, wahai Abu Rimthah?’ Aku menjawab, ‘Anakku.’ Baginda SAW bersabda, ‘Sesungguhnya dia tidak akan menzalimi engkau dan engkau juga tidak akan menzaliminya.’ Kemudian Baginda SAW menyebut kisah cincin."
  },
  {
    "id": 37526,
    "hadith_number": 1363,
    "tajuk_hadith": "Cinta Kepada Anak",
    "perawi_melayu": "Abu Nu'aim melalui Sufian daripada Iyad bin Laqit As-Sadusi",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ إِيَادِ بْنِ لَقِيطٍ السَّدُوسِيِّ، قَالَ سَمِعْتُ أَبَا رِمْثَةَ التَّيْمِيَّ، قَالَ جِئْتُ مَعَ أَبِي إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ ابْنُكَ هَذَا قُلْتُ نَعَمْ قَالَ أَتُحِبُّهُ قُلْتُ نَعَمْ قَالَ أَمَا إِنَّهُ لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ‏.‏",
    "malay_translation": "Abu Nu'aim meriwayatkan daripada Sufian, daripada Iyad bin Laqit As-Sadusi, katanya: Aku mendengar Abu Rimtha At-Timi berkata: Aku datang bersama bapaku kepada Nabi SAW, lalu baginda bertanya: “Inikah anakmu?” Aku menjawab: “Ya.” Baginda bertanya lagi: “Adakah engkau menyayanginya?” Aku menjawab: “Ya.” Baginda bersabda: “Ketahuilah, dia tidak akan memudaratkanmu dan engkau pun tidak akan memudaratkannya.”"
  },
  {
    "id": 37527,
    "hadith_number": 1364,
    "tajuk_hadith": "Rawatan Luka Rasulullah SAW",
    "perawi_melayu": "Yunus, Hammad bin Salamah, 'Aasim, dan Abu Rimthah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يُونُسُ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ، عَنْ عَاصِمٍ، عَنْ أَبِي رِمْثَةَ، قَالَ أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعِنْدَهُ نَاسٌ مِنْ رَبِيعَةَ يَخْتَصِمُونَ فِي دَمِ الْعَمْدِ فَسَمِعْتُهُ يَقُولُ أُمَّكَ وَأَبَاكَ وَأُخْتَكَ وَأَخَاكَ ثُمَّ أَدْنَاكَ فَأَدْنَاكَ ثُمَّ قَالَ فَنَظَرَ ثُمَّ قَالَ مَنْ هَذَا مَعَكَ يَا أَبَا رِمْثَةَ فَقُلْتُ ابْنِي قَالَ أَمَا إِنَّهُ لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ قَالَ فَنَظَرْتُ فَإِذَا فِي نُغْضِ كَتِفِهِ مِثْلُ بَعْرَةِ الْبَعِيرِ أَوْ بَيْضَةِ الْحَمَامَةِ فَقُلْتُ أَلَا أُدَاوِيكَ مِنْهَا يَا رَسُولَ اللَّهِ فَإِنَّا أَهْلُ بَيْتٍ نُطَبِّبُ فَقَالَ يُدَاوِيهَا الَّذِي وَضَعَهَا‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Yunus, telah menceritakan kepada kami Hammad (iaitu Ibnu Salamah), dari 'Aasim, dari Abu Rimthah, dia berkata: Aku datang kepada Rasulullah SAW, dan di sisi baginda ada beberapa orang dari Bani Rabiah yang bertengkar tentang darah yang disengajakan. Maka aku mendengar baginda bersabda: “Ibumu, bapa kamu, kakak perempuan kamu, adik lelaki kamu, kemudian yang terdekat kepada kamu, kemudian yang terdekat kepada kamu.” Kemudian baginda melihat, lalu bersabda: “Siapa ini yang bersamamu wahai Abu Rimthah?” Aku menjawab: “Anakku.” Baginda bersabda: “Sesungguhnya dia tidak akan mencederakan kamu dan kamu juga tidak akan mencederakan dia.”  Aku melihat, maka tampaklah di bawah ketiaknya seperti bisul unta atau telur burung merpati. Maka aku berkata: “Wahai Rasulullah, izinkanlah aku merawatnya kerana kami sekeluarga adalah ahli perubatan.” Baginda bersabda: “Orang yang menyebabkannya (luka itu) hendaklah merawatnya.”"
  },
  {
    "id": 37528,
    "hadith_number": 1365,
    "tajuk_hadith": "Pertemuan dengan Rasulullah SAW dan Doa Baginda",
    "perawi_melayu": "Hisham bin Abd al-Malik dan Affan meriwayatkan daripada Ubaidullah bin Iyad, daripada Iyad, daripada Abu Rimtha",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ، وَعَفَّانُ، قَالَا حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ إِيَادٍ، حَدَّثَنَا إِيَادٌ، عَنْ أَبِي رِمْثَةَ، قَالَ انْطَلَقْتُ مَعَ أَبِي نَحْوَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا رَأَيْتُهُ قَالَ لِي أَبِي هَلْ تَدْرِي مَنْ هَذَا قُلْتُ لَا فَقَالَ لِي أَبِي هَذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاقْشَعْرَرْتُ حِينَ قَالَ ذَاكَ وَكُنْتُ أَظُنُّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا لَا يُشْبِهُ النَّاسَ فَإِذَا بَشَرٌ لَهُ وَفْرَةٌ قَالَ عَفَّانُ فِي حَدِيثِهِ ذُو وَفْرَةٍ وَبِهَا رَدْعٌ مِنْ حِنَّاءٍ عَلَيْهِ ثَوْبَانِ أَخْضَرَانِ فَسَلَّمَ عَلَيْهِ أَبِي ثُمَّ جَلَسْنَا فَتَحَدَّثْنَا سَاعَةً ثُمَّ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأَبِي ابْنُكَ هَذَا قَالَ إِي وَرَبِّ الْكَعْبَةِ قَالَ حَقًّا قَالَ أَشْهَدُ بِهِ فَتَبَسَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَاحِكًا مِنْ ثَبْتِ شَبَهِي بِأَبِي وَمِنْ حَلِفِ أَبِي عَلَيَّ ثُمَّ قَالَ أَمَا إِنَّهُ لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ قَالَ وَقَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏{‏وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى‏}‏ قَالَ ثُمَّ نَظَرَ إِلَى مِثْلِ السِّلْعَةِ بَيْنَ كَتِفَيْهِ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي لَأَطَبُّ الرِّجَالِ أَلَا أُعَالِجُهَا لَكَ قَالَ لَا طَبِيبُهَا الَّذِي خَلَقَهَا‏.‏",
    "malay_translation": "Kami diberitakan oleh Hisyam bin Abd al-Malik dan Affan, mereka berdua berkata: Kami diberitakan oleh Ubaidullah bin Iyad, yang diberitakan oleh Iyad daripada Abu Rimtha yang berkata: Aku pergi bersama ayahku menuju Rasulullah SAW.  Apabila aku melihat Baginda, ayahku bertanya kepadaku, \"Tahukah engkau siapa ini?\" Aku menjawab, \"Tidak.\" Ayahku berkata, \"Ini Rasulullah SAW.\"  Aku menggigil ketika ayahku berkata demikian. Aku menyangka Rasulullah SAW adalah seseorang yang tidak serupa dengan manusia lain.  Namun, ternyata Baginda seorang manusia biasa yang tegap (berbadan tegap). Affan menyebut dalam riwayat beliau, Baginda tegap dan bertompok pewarna pacar pada tubuh Baginda, serta memakai dua helai baju berwarna hijau. Ayahku memberi salam kepada Baginda, kemudian kami duduk dan berbual sebentar.  Kemudian Rasulullah SAW bertanya kepada ayahku, \"Ini anakmu?\" Ayahku menjawab, \"Ya, demi Tuhan Kaabah!\" Baginda berkata, \"Benar.\" Ayahku bersaksi akan hal itu. Rasulullah SAW tersenyum dan tertawa kerana keyakinan persamaan anakku dengan ayahku, dan kerana sumpah ayahku. Kemudian Baginda bersabda, \"Sesungguhnya dia tidak akan mencelakakanmu dan engkau tidak akan mencelakakannya.\" Baginda membaca, \"Dan seseorang yang berdosa tidak akan memikul dosa orang lain.\" Kemudian Baginda melihat seperti bisul di antara dua belikatku, lalu aku berkata, \"Wahai Rasulullah, sesungguhnya aku adalah doktor yang paling mahir, tidakkah aku merawatnya untukmu?\" Baginda menjawab, \"Tidak, doktornya ialah yang menciptakannya.\""
  },
  {
    "id": 37529,
    "hadith_number": 1366,
    "tajuk_hadith": "Kepakaran Seorang Tabib",
    "perawi_melayu": "Abdullah, Abu Bakar bin Abi Syaibah, Hussein bin Ali, Ibnu Abjar, Iyad bin Laqit, dan Abu Rimthah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنِ ابْنِ أَبْجَرَ، عَنْ إِيَادِ بْنِ لَقِيطٍ، عَنْ أَبِي رِمْثَةَ، قَالَ انْطَلَقْتُ مَعَ أَبِي وَأَنَا غُلَامٌ، إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَقَالَ لَهُ أَبِي إِنِّي رَجُلٌ طَبِيبٌ فَأَرِنِي هَذِهِ السِّلْعَةَ الَّتِي بِظَهْرِكَ قَالَ وَمَا تَصْنَعُ بِهَا قَالَ أَقْطَعُهَا قَالَ لَسْتَ بِطَبِيبٍ وَلَكِنَّكَ رَفِيقٌ طَبِيبُهَا الَّذِي وَضَعَهَا وَقَالَ غَيْرُهُ الَّذِي خَلَقَهَا‏.‏",
    "malay_translation": "Kami diberitakan oleh Abdullah, yang diberitakan oleh Abu Bakar bin Abi Syaibah, yang diberitakan oleh Hussein bin Ali, daripada Ibnu Abjar, daripada Iyad bin Laqit, daripada Abu Rimthah.  Abu Rimthah berkata: “Saya pergi bersama ayah saya ketika saya masih kanak-kanak kepada Nabi SAW. Ayah saya berkata kepada Nabi SAW, ‘Saya seorang tabib, tunjukkan kepada saya barangan yang ada di belakangmu.’ Nabi SAW bertanya, ‘Apakah yang akan engkau lakukan dengannya?’ Ayah saya menjawab, ‘Saya akan memotongnya.’ Nabi SAW bersabda, ‘Engkau bukanlah seorang tabib, tetapi engkau adalah sahabat kepada tabibnya, iaitu yang menciptanya, dan (yang menciptakannya adalah) selainnya (iaitu Allah SWT).’”"
  },
  {
    "id": 37530,
    "hadith_number": 1367,
    "tajuk_hadith": "Kehebatan Rasulullah dan Doa untuk Anak",
    "perawi_melayu": "Abdullah, Said bin Abi ar-Rabi' as-Samman, Abu 'Awana, Abd al-Malik bin Umair, Iyad bin Laqit al-'Ijili, Abu Rimtha at-Taymi, Taym ar-Ribab",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي الرَّبِيعِ السَّمَّانُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ إِيَادِ بْنِ لَقِيطٍ الْعِجْلِيِّ، عَنْ أَبِي رِمْثَةَ التَّيْمِيِّ، تَيْمَ الرِّبَابِ قَالَ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعِي ابْنِي فَأَرَانِيهِ إِيَّاهُ فَقُلْتُ لِابْنِي هَذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخَذَتْهُ الرِّعْدَةُ هَيْبَةً لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ لَهُ يَا نَبِيَّ اللَّهِ إِنِّي رَجُلٌ طَبِيبٌ مِنْ أَهْلِ بَيْتٍ أَطِبَّاءَ فَأَرِنِي ظَهْرَكَ فَإِنْ تَكُنْ سِلْعَةً أَبُطُّهَا وَإِنْ تَكُ غَيْرَ ذَلِكَ أَخْبَرْتُكَ فَإِنَّهُ لَيْسَ مِنْ إِنْسَانٍ أَعْلَمَ بِجُرْحٍ أَوْ خُرَاجٍ مِنِّي قَالَ طَبِيبُهَا اللَّهُ وَعَلَيْهِ بُرْدَانِ أَخْضَرَانِ لَهُ شَعَرٌ قَدْ عَلَاهُ الْمَشِيبُ وَشَيْبُهُ أَحْمَرُ فَقَالَ ابْنُكَ هَذَا قُلْتُ إِي وَرَبِّ الْكَعْبَةِ قَالَ ابْنُ نَفْسِكَ قُلْتُ أَشْهَدُ بِهِ قَالَ فَإِنَّهُ لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ‏.‏",
    "malay_translation": "Aku datang kepada Nabi SAW bersama anakku, lalu aku memperlihatkan anakku kepada baginda. Aku berkata kepada anakku, “Ini adalah Rasulullah SAW.”  Anakku gementar kerana kagum kepada Rasulullah SAW.  Aku berkata kepada Baginda, “Wahai Nabi Allah, saya seorang doktor daripada keluarga doktor.  Perlihatkanlah belakang Baginda kepada saya. Jika ada bisul, saya akan mengubatinya; dan jika bukan, saya akan memberitahu Baginda.  Sesungguhnya tiada seorang pun yang lebih arif tentang luka atau penyakit kulit daripada saya.” Baginda menjawab, “Doktornya ialah Allah SWT.”  Baginda memakai dua helai kain berwarna hijau. Rambut Baginda telah beruban dan ubannya berwarna merah. Kemudian Baginda bertanya, “Adakah ini anakmu?” Aku menjawab, “Ya, demi Tuhan Kaabah.” Baginda berkata, “Anakmu sendiri.” Aku berkata, “Saya bersaksi akan hal itu.” Baginda bersabda, “Maka sesungguhnya dia tidak akan mendatangkan mudarat kepadamu dan engkau pun tidak akan mendatangkan mudarat kepadanya.”"
  },
  {
    "id": 37531,
    "hadith_number": 1368,
    "tajuk_hadith": "Rasulullah SAW di Kaabah",
    "perawi_melayu": "Abdullah, Abu Bakar bin Abi Syaibah, Muhammad bin Bisyr, Ali bin Shalih, Iyad bin Laqit, dan Abu Rimthah.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، عَنْ عَلِيِّ بْنِ صَالِحٍ، حَدَّثَنِي إِيَادُ بْنُ لَقِيطٍ، عَنْ أَبِي رِمْثَةَ، قَالَ حَجَجْتُ فَرَأَيْتُ رَجُلًا جَالِسًا فِي ظِلِّ الْكَعْبَةِ فَقَالَ أَبِي تَدْرِي مَنْ هَذَا هَذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا انْتَهَيْنَا إِلَيْهِ إِذَا رَجُلٌ ذُو وَفْرَةٍ بِهِ رَدْعٌ وَعَلَيْهِ ثَوْبَانِ أَخْضَرَانِ‏.‏",
    "malay_translation": "Kami diberitakan oleh Abdullah, yang diberitakan kepadanya oleh Abu Bakar bin Abi Syaibah, yang diberitakan kepadanya oleh Muhammad bin Bisyr, daripada Ali bin Shalih, yang diberitakan kepadanya oleh Iyad bin Laqit, daripada Abu Rimthah.  Dia berkata: Aku menunaikan haji, lalu aku melihat seorang lelaki duduk di bawah naungan Kaabah.  Bapaku berkata: “Tahukah engkau siapa ini? Ini adalah Rasulullah SAW.”  Kemudian setelah kami sampai kepadanya, ternyata dia seorang lelaki yang berisi, agak gemuk, dan memakai dua helai baju berwarna hijau."
  },
  {
    "id": 37532,
    "hadith_number": 1369,
    "tajuk_hadith": "Larangan Menzalimi Anak Sendiri",
    "perawi_melayu": "Abdullah, melalui Amru bin Muhammad bin Bukhair An-Naqid, melalui Hushaim (beberapa kali), yang memberitahu daripada Abd Malik bin Umair, daripada Iyad bin Laqit, daripada Abu Rimthah Al-Timi",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي عَمْرُو بْنُ مُحَمَّدِ بْنِ بُكَيْرٍ النَّاقِدُ، حَدَّثَنَا هُشَيْمٌ، غَيْرَ مَرَّةٍ قَالَ أَخْبَرَنِي عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ، عَنْ إِيَادِ بْنِ لَقِيطٍ، عَنْ أَبِي رِمْثَةَ التَّيْمِيِّ، أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعِي ابْنٌ لِي فَقَالَ ابْنُكَ هَذَا قُلْتُ أَشْهَدُ بِهِ قَالَ لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ قَالَ وَرَأَيْتُ الشَّيْبَ أَحْمَرَ‏.‏",
    "malay_translation": "Kami diberitahu oleh Abdullah, yang memberitahu daripada Amru bin Muhammad bin Bukhair An-Naqid, yang memberitahu daripada Hushaim (beberapa kali), yang memberitahu daripada Abd Malik bin Umair, daripada Iyad bin Laqit, daripada Abu Rimthah Al-Timi: Aku datang kepada Nabi SAW bersama anakku.  Nabi SAW bertanya, “Anakmu ini?” Aku menjawab, “Saya mengakuinya anak saya.” Baginda bersabda, “Janganlah kamu menzalimi dia dan janganlah dia menzalimi kamu.”  Baginda juga berkata, “Dan aku lihat rambut yang putih itu berwarna merah.”"
  },
  {
    "id": 37533,
    "hadith_number": 1370,
    "tajuk_hadith": "Pertemuan dengan Rasulullah SAW dan Kepercayaan Seorang Anak",
    "perawi_melayu": "Abdullah, Syiban bin Abi Syaibah, Yazid (Yazid bin Ibrahim Al-Tustari), Sadaqah bin Abi Imran, Thabit bin Munqidz, dan Abi Rimthah.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي شَيْبَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ إِبْرَاهِيمَ التُّسْتَرِيُّ، حَدَّثَنَا صَدَقَةُ بْنُ أَبِي عِمْرَانَ، عَنْ رَجُلٍ، هُوَ ثَابِتُ بْنُ مُنْقِذٍ عَنْ أَبِي رِمْثَةَ، قَالَ انْطَلَقْتُ أَنَا وَأَبِي، إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا كُنَّا فِي بَعْضِ الطَّرِيقِ فَلَقِينَاهُ فَقَالَ لِي أَبِي يَا بُنَيَّ هَذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَكُنْتُ أَحْسَبُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُشْبِهُ النَّاسَ فَإِذَا رَجُلٌ لَهُ وَفْرَةٌ بِهَا رَدْعٌ مِنْ حِنَّاءٍ عَلَيْهِ بُرْدَانِ أَخْضَرَانِ قَالَ كَأَنِّي أَنْظُرُ إِلَى سَاقَيْهِ قَالَ فَقَالَ لِأَبِي مَنْ هَذَا مَعَكَ قَالَ هَذَا وَاللَّهِ ابْنِي قَالَ فَضَحِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِحَلِفِ أَبِي عَلَيَّ ثُمَّ قَالَ صَدَقْتَ أَمَا إِنَّكَ لَا تَجْنِي عَلَيْهِ وَلَا يَجْنِي عَلَيْكَ قَالَ وَتَلَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏{‏وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى‏}‏‏.‏",
    "malay_translation": "Aku dan ayahku pergi menemui Rasulullah SAW.  Ketika kami berada di tengah jalan, kami bertemu baginda. Ayahku berkata kepadaku, “Wahai anakku, inilah Rasulullah SAW.”  Aku menyangka Rasulullah SAW berbeza daripada orang lain.  Rupa-rupanya baginda seorang lelaki yang tegap, dengan sedikit warna henna, memakai dua helai kain burdah berwarna hijau.  Rasanya aku masih dapat melihat betis baginda.  Rasulullah SAW bertanya kepada ayahku, “Siapakah ini bersamamu?” Ayahku menjawab, “Demi Allah, ini anakku.” Rasulullah SAW tersenyum mendengar sumpah ayahku. Kemudian baginda berkata, “Engkau benar. Sesungguhnya kamu tidak akan menanggung dosa orang lain, dan orang lain pun tidak akan menanggung dosamu.” Kemudian Rasulullah SAW membaca ayat,  “Dan seseorang yang berdosa tidak akan menanggung dosa orang lain.” (Al-An’am: 164)"
  },
  {
    "id": 37534,
    "hadith_number": 1371,
    "tajuk_hadith": "Kisah Rasulullah SAW dan Seorang Kanak-kanak",
    "perawi_melayu": "Abdullah, Muhammad bin Bakkar, Qais bin Rabiah Al-Asadi, Iyad bin Laqit, dan Abu Rimtha",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارٍ، حَدَّثَنَا قَيْسُ بْنُ الرَّبِيعِ الْأَسَدِيُّ، عَنْ إِيَادِ بْنِ لَقِيطٍ، عَنْ أَبِي رِمْثَةَ، قَالَ انْطَلَقْتُ مَعَ أَبِي وَأَنَا غُلَامٌ، فَأَتَيْنَا رَجُلًا مِنْ الْهَاجِرَةِ جَالِسًا فِي ظِلِّ بَيْتِهِ وَعَلَيْهِ بُرْدَانِ أَخْضَرَانِ وَشَعْرُهُ وَفْرَةٌ وَبِرَأْسِهِ رَدْعٌ مِنْ حِنَّاءٍ قَالَ فَقَالَ لِي أَبِي أَتَدْرِي مَنْ هَذَا فَقُلْتُ لَا قَالَ هَذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَتَحَدَّثْنَا طَوِيلًا قَالَ فَقَالَ لَهُ أَبِي إِنِّي رَجُلٌ مِنْ أَهْلِ بَيْتِ طِبٍّ فَأَرِنِي الَّذِي بِبَاطِنِ كَتِفِكَ فَإِنْ تَكُ سِلْعَةً قَطَعْتُهَا وَإِنْ تَكُ غَيْرَ ذَلِكَ أَخْبَرْتُكَ قَالَ طَبِيبُهَا الَّذِي خَلَقَهَا قَالَ ثُمَّ نَظَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيَّ فَقَالَ لَهُ ابْنُكَ هَذَا قَالَ أَشْهَدُ بِهِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْظُرْ مَا تَقُولُ قَالَ إِي وَرَبِّ الْكَعْبَةِ قَالَ فَضَحِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِشَبَهِي بِأَبِي وَلِحَلِفِ أَبِي عَلَيَّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا هَذَا لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ‏.‏",
    "malay_translation": "Aku pergi bersama ayahku ketika aku masih kanak-kanak.  Kami menemui seorang lelaki dari kalangan Muhajirin yang sedang duduk di bawah bayang-bayang rumahnya. Dia memakai dua helai kain berwarna hijau, rambutnya lebat dan kepalanya dihiasi dengan inai. Ayahku bertanya kepadaku, \"Tahukah engkau siapa dia?\" Aku menjawab, \"Tidak.\" Ayahku berkata, \"Dia ialah Rasulullah SAW.\" Kemudian kami berbual panjang dengan baginda. Ayahku berkata kepada Rasulullah SAW, \"Saya adalah seorang ahli perubatan. Tunjukkan apa yang ada di bahagian dalam bahu tuan. Jika ia penyakit kulit, saya akan mengubatinya, jika sebaliknya saya akan memberitahu tuan.\" Rasulullah SAW menjawab, \"Dia yang mencipta tubuh ini, mengetahui penyakitnya.\" Kemudian Rasulullah SAW memandangku dan berkata kepada ayahku, \"Inilah anakmu?\" Ayahku menjawab, \"Ya, saya bersaksi akan hal itu.\" Rasulullah SAW berkata, \"Lihat apa yang kau katakan.\" Ayahku menjawab, \"Demi Kaabah!\" Rasulullah SAW tertawa kerana aku mirip ayahku dan kerana sumpah ayahku. Kemudian Rasulullah SAW bersabda, \"Wahai orang ini, janganlah engkau menjatuhkan hukuman dan janganlah dia menjatuhkan hukuman ke atasmu.\""
  },
  {
    "id": 37535,
    "hadith_number": 1372,
    "tajuk_hadith": "Pertemuan dengan Rasulullah SAW dan Kesamaan Rupa dengan Bapa",
    "perawi_melayu": "Abdullah, melalui Ja’far bin Humaid al-Kufi, melalui Ubaidullah bin Iyad bin Laqit, daripada bapanya, daripada Abu Rimthah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي جَعْفَرُ بْنُ حُمَيْدٍ الْكُوفِيُّ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ إِيَادِ بْنِ لَقِيطٍ، عَنْ أَبِيهِ، عَنْ أَبِي رِمْثَةَ، قَالَ انْطَلَقْتُ مَعَ أَبِي نَحْوَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا رَأَيْتُهُ قَالَ أَبِي هَلْ تَدْرِي مَنْ هَذَا قُلْتُ لَا قَالَ هَذَا مُحَمَّدٌ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَاقْشَعْرَرْتُ حِينَ قَالَ ذَلِكَ وَكُنْتُ أَظُنُّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْءٌ لَا يُشْبِهُ النَّاسَ فَإِذَا بَشَرٌ ذُو وَفْرَةٍ وَبِهَا رَدْعُ حِنَّاءٍ وَعَلَيْهِ بُرَدَانِ أَخْضَرَانِ فَسَلَّمَ عَلَيْهِ أَبِي ثُمَّ جَلَسْنَا فَتَحَدَّثْنَا سَاعَةً ثُمَّ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأَبِي ابْنُكَ هَذَا قَالَ إِي وَرَبِّ الْكَعْبَةِ قَالَ حَقًّا قَالَ أَشْهَدُ بِهِ فَتَبَسَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَاحِكًا مِنْ تَثْبِيتِ شَبَهِي بِأَبِي وَمِنْ حَلِفِ أَبِي عَلَيَّ ثُمَّ قَالَ أَمَا إِنَّهُ لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ وَقَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏{‏وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى‏}‏ ثُمَّ نَظَرَ إِلَى مِثْلِ السِّلْعَةِ بَيْنَ كَتِفَيْهِ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي كَأَطَبِّ الرِّجَالِ أَلَا أُعَالِجُهَا لَكَ قَالَ لَا طَبِيبُهَا الَّذِي خَلَقَهَا‏.‏",
    "malay_translation": "Kami diberitakan oleh Abdullah, yang diberitakan kepadaku oleh Ja’far bin Humaid al-Kufi, yang diberitakan kepada kami oleh Ubaidullah bin Iyad bin Laqit, daripada bapanya, daripada Abu Rimthah, katanya: Aku berangkat bersama bapaku menuju Rasulullah SAW.  Apabila aku melihat baginda, bapaku bertanya, “Tahukah engkau siapakah ini?” Aku menjawab, “Tidak.” Bapaku berkata, “Ini Muhammad, Rasulullah SAW.”  Maka aku menggigil ketika bapaku berkata demikian, dan aku menyangka bahawa Rasulullah SAW adalah seseorang yang tidak menyerupai manusia.  Rupa-rupanya baginda seorang manusia yang tegap, dengan sedikit pewarna inai, dan memakai dua helai kain burdah berwarna hijau.  Bapaku memberi salam kepada baginda, kemudian kami duduk dan berbual seketika.  Kemudian Rasulullah SAW berkata kepada bapaku, “Inikah anakmu?” Bapaku menjawab, “Ya, demi Tuhan Kaabah.” Baginda berkata, “Benar.” Bapaku berkata, “Aku bersaksi akan hal itu.”  Lalu Rasulullah SAW tersenyum, tertawa kerana penegasan tentang kesamaan rupaku dengan bapaku dan sumpah bapaku terhadapku.  Kemudian baginda berkata, “Sesungguhnya dia tidak akan memudaratkan engkau, dan engkau pun tidak akan memudaratkannya.”  Rasulullah SAW membaca,  “Dan seseorang yang berdosa tidak akan memikul dosa orang lain.”  Kemudian baginda melihat seperti ketumbuhan di antara kedua bahuku, lalu aku berkata, “Wahai Rasulullah, saya seakan-akan doktor terbaik di kalangan manusia, tidakkah saya akan merawatnya untuk tuan?” Baginda menjawab, “Tidak, doktornya ialah Yang Maha Menciptakannya.”"
  },
  {
    "id": 37536,
    "hadith_number": 1373,
    "tajuk_hadith": "Ziarah Rasulullah SAW",
    "perawi_melayu": "Abdullah, melalui bapanya dan Abu Khaitsamah Zuhair bin Harb, daripada Abdur Rahman bin Mahdi, daripada Ubaidullah bin Iyad bin Laqit, daripada bapanya, daripada Abu Rimthah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي أَبِي وَأَبُو خَيْثَمَةَ زُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ إِيَادِ بْنِ لَقِيطٍ، عَنْ أَبِيهِ، عَنْ أَبِي رِمْثَةَ، قَالَ أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ بُرْدَانِ أَخْضَرَانِ‏.‏",
    "malay_translation": "Kami diberitakan oleh Abdullah, yang diberitakan kepadanya oleh bapanya dan Abu Khaitsamah Zuhair bin Harb, mereka berdua berkata: Kami diberitakan oleh Abdur Rahman bin Mahdi, yang diberitakan kepadanya oleh Ubaidullah bin Iyad bin Laqit, daripada bapanya, daripada Abu Rimthah, yang berkata: Aku telah datang kepada Rasulullah SAW, dan baginda ketika itu memakai dua helai burdah berwarna hijau."
  },
  {
    "id": 37537,
    "hadith_number": 1374,
    "tajuk_hadith": "Perjumpaan dengan Rasulullah SAW dan Kehebatan Ubat Allah",
    "perawi_melayu": "Abdullah, dari Syibaan bin Abi Syibah, dari Jarir (yakni Ibnu Hazim), dari Abdul Malik bin Umair, dari Iyad bin Laqit, dari Abu Rimthah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي شَيْبَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ يَعْنِي ابْنَ حَازِمٍ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ، عَنْ إِيَادِ بْنِ لَقِيطٍ، عَنْ أَبِي رِمْثَةَ، قَالَ قَدِمْتُ الْمَدِينَةَ وَلَمْ أَكُنْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَرَجَ وَعَلَيْهِ ثَوْبَانِ أَخْضَرَانِ فَقُلْتُ لِابْنِي هَذَا وَاللَّهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَعَلَ ابْنِي يَرْتَعِدُ هَيْبَةً لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي رَجُلٌ طَبِيبٌ وَإِنَّ أَبِي كَانَ طَبِيبًا وَإِنَّا أَهْلُ بَيْتِ طِبٍّ وَاللَّهِ مَا يَخْفَى عَلَيْنَا مِنْ الْجَسَدِ عِرْقٌ وَلَا عَظْمٌ فَأَرِنِي هَذِهِ الَّتِي عَلَى كَتِفِكَ فَإِنْ كَانَتْ سِلْعَةً قَطَعْتُهَا ثُمَّ دَاوَيْتُهَا قَالَ لَا طَبِيبُهَا اللَّهُ ثُمَّ قَالَ مَنْ هَذَا الَّذِي مَعَكَ قُلْتُ ابْنِي وَرَبِّ الْكَعْبَةِ فَقَالَ ابْنُكَ قَالَ ابْنِي أَشْهَدُ بِهِ قَالَ ابْنُكَ هَذَا لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ‏.‏",
    "malay_translation": "Abu Rimthah berkata, \"Aku tiba di Madinah dan belum pernah melihat Rasulullah SAW.  Kemudian baginda keluar, memakai dua helai baju berwarna hijau.  Aku berkata kepada anakku, ‘Demi Allah, ini Rasulullah SAW!’ Anakku gementar kerana takut kepada Rasulullah SAW.  Maka aku berkata, ‘Wahai Rasulullah, saya seorang doktor, dan ayah saya pun doktor.  Kami sekeluarga memang ahli perubatan. Demi Allah, tidak ada urat atau tulang dalam tubuh yang tersembunyi daripada pengetahuan kami.  Tunjukkan kepada saya apa yang ada di bahu tuan. Jika ia penyakit kulit, saya akan membuangnya dan kemudian mengubatinya.’ Baginda menjawab, ‘Tidak, Allah SWT jua doktornya.’ Kemudian baginda bertanya, ‘Siapa yang bersamamu?’ Aku menjawab, ‘Anakku.’ Baginda bertanya, ‘Anakmu?’ Aku menjawab, ‘Ya, anakku. Aku bersaksi akan hal itu.’ Baginda berkata, ‘Anakmu ini tidak akan merugikanmu, dan engkau pun tidak akan merugikannya.’"
  }
]
