[
  {
    "id": 38624,
    "hadith_number": 1087,
    "tajuk_hadith": "Bersegera dalam Menunaikan Ibadah Haji",
    "perawi_melayu": "Diriwayatkan daripada Ibn Abbas RA, bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ  ، حَدَّثَنَا أَبُو مُعَاوِيَةَ  ، حَدَّثَنَا الْحَسَنُ بْنُ عَمْرٍو الْفُقَيْمِيُّ  ، عَنْ مِهْرَانَ أَبِي صَفْوَانَ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَنْ أَرَادَ الْحَجَّ فَلْيَتَعَجَّلْ \"",
    "malay_translation": "\"Sesiapa yang ingin menunaikan haji, maka hendaklah dia bersegera melakukannya.\""
  },
  {
    "id": 38625,
    "hadith_number": 1088,
    "tajuk_hadith": "Ancaman Bagi Mereka Yang Mampu Tetapi Tidak Menunaikan Haji",
    "perawi_melayu": "Diriwayatkan daripada Abu Umamah R.A., Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، عَنْ شَرِيكٍ  ، عَنْ لَيْثٍ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَابِطٍ  ، عَنْ أَبِي أُمَامَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَنْ لَمْ يَمْنَعْهُ عَنْ الْحَجِّ حَاجَةٌ ظَاهِرَةٌ، أَوْ سُلْطَانٌ جَائِرٌ، أَوْ مَرَضٌ حَابِسٌ، فَمَاتَ وَلَمْ يَحُجَّ، فَلْيَمُتْ إِنْ شَاءَ يَهُودِيًّا ، وَإِنْ شَاءَ نَصْرَانِيًّا \"",
    "malay_translation": "\"Sesiapa yang tidak dihalang daripada menunaikan haji oleh keperluan yang jelas, atau penguasa yang zalim, atau penyakit yang menahannya, lalu dia mati dan tidak menunaikan haji, maka matilah dia jika dia mahu sebagai seorang Yahudi, dan jika dia mahu sebagai seorang Nasrani.\""
  },
  {
    "id": 38626,
    "hadith_number": 1089,
    "tajuk_hadith": "Nabi Muhammad SAW Menunaikan Haji Selepas Hijrah",
    "perawi_melayu": "Mujahid bin Musa, Yahya bin Adam, Zuhair, daripada Abu Ishaq, mendengar Zaid bin Arqam berkata",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُجَاهِدُ بْنُ مُوسَى  ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ  ، حَدَّثَنَا زُهَيْرٌ  ، عَنْ أَبِي إِسْحَاق  ، قَالَ : سَمِعْتُ زَيْدَ بْنَ أَرْقَمَ  ، يَقُولُ :\" حَجَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ هِجْرَتِهِ حَجَّةً \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Mujahid bin Musa, telah menceritakan kepada kami Yahya bin Adam, telah menceritakan kepada kami Zuhair, daripada Abu Ishaq, beliau berkata: Aku mendengar Zaid bin Arqam berkata: \"Nabi SAW telah menunaikan haji sekali selepas hijrahnya.\""
  },
  {
    "id": 38627,
    "hadith_number": 1090,
    "tajuk_hadith": "Haji Rasulullah SAW Sebelum Hijrah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "قَالَ : وَقَالَ أَبُو إِسْحَاق   :\" حَجَّ قَبْلَ هِجْرَتِهِ حَجَّةً \"",
    "malay_translation": "Abu Ishaq berkata: \"Baginda (Rasulullah SAW) telah menunaikan haji sekali sebelum hijrahnya.\""
  },
  {
    "id": 38628,
    "hadith_number": 1091,
    "tajuk_hadith": "Bilangan Haji dan Umrah Nabi Muhammad SAW",
    "perawi_melayu": "Diriwayatkan oleh Abu Al-Walid At-Tayalisi, daripada Hammam, daripada Qatadah, katanya:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ  ، حَدَّثَنَا هَمَّامٌ  ، حَدَّثَنَا قَتَادَةُ  ، قَالَ : قُلْتُ لِأَنَسٍ   : كَمْ حَجَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ :\" حَجَّةً وَاحِدَةً، وَاعْتَمَرَ أَرْبَعًا : عُمْرَتُهُ الْأُولَى الَّتِي صَدَّهُ الْمُشْرِكُونَ عَنْ الْبَيْتِ ، وَعُمْرَتُهُ الثَّانِيَةُ حِينَ صَالَحُوهُ فَرَجَعَ مِنْ الْعَامِ الْمُقْبِلِ، وَعُمْرَتُهُ مِنْ الْجِعْرَانَةِ حِينَ قَسَّمَ غَنِيمَةَ حُنَيْنٍ فِي ذِي الْقَعْدَةِ، وَعُمْرَتُهُ مَعَ حَجَّتِهِ \"",
    "malay_translation": "\"Saya bertanya kepada Anas RA: 'Berapa kali Nabi SAW mengerjakan haji?' Beliau menjawab: 'Baginda mengerjakan haji sekali sahaja dan umrah sebanyak empat kali: Umrah pertama baginda ialah ketika dihalang oleh kaum musyrikin daripada memasuki Baitullah; umrah kedua baginda ialah ketika mereka berdamai dengan baginda lalu baginda kembali pada tahun berikutnya; umrah baginda dari Ji'ranah ketika baginda membahagikan harta rampasan perang Hunain pada bulan Zulkaedah; dan umrah baginda bersama dengan hajinya.'\""
  },
  {
    "id": 38629,
    "hadith_number": 1092,
    "tajuk_hadith": "Kewajipan Haji Sekali Seumur Hidup",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ  ، حَدَّثَنَا سُلَيْمَانُ بْنُ كَثِيرٍ  ، عَنْ الزُّهْرِيِّ  ، عَنْ سِنَانٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" كُتِبَ عَلَيْكُمْ الْحَجُّ \".\nفَقِيلَ : يَا رَسُولَ اللَّهِ فِي كُلِّ عَامٍ؟ قَالَ : \" لَا، وَلَوْ قُلْتُهَا لَوَجَبَتْ، الْحَجُّ مَرَّةٌ فَمَا زَادَ فَهُوَ تَطَوُّعٌ \".\n أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، عَنْ شَرِيكٍ  ، عَنْ سِمَاكٍ  ، عَنْ عِكْرِمَةَ  ، عَنْ ابْنِ عَبَّاسٍ  ، نَحْوَهُ",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Kathir, telah menceritakan kepada kami Sulaiman bin Kathir, dari Az-Zuhri, dari Sinan, dari Ibnu Abbas, dia berkata: Rasulullah SAW bersabda: \"Telah diwajibkan ke atas kamu haji.\"\nLalu ditanyakan: Wahai Rasulullah, setiap tahun? Baginda bersabda: \"Tidak, dan jika aku katakan ya, nescaya ia akan menjadi wajib. Haji (wajib) adalah sekali (seumur hidup), dan apa yang lebih daripada itu adalah sunat.\"\nTelah mengkhabarkan kepada kami Ubaidullah bin Musa, dari Syarik, dari Simak, dari Ikrimah, dari Ibnu Abbas, yang serupa dengannya."
  },
  {
    "id": 38630,
    "hadith_number": 1093,
    "tajuk_hadith": "Penetapan Miqat oleh Rasulullah SAW untuk Madinah, Syam, Najd dan Yaman",
    "perawi_melayu": "Ahmad bin Abdullah bin Yunus",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ  ، قَالَ :\" وَقَّتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَهْلِ الْمَدِينَةِ ذَا الْحُلَيْفَةِ ، وَلِأَهْلِ الشَّامِ الْجُحْفَةَ ، وَلِأَهْلِ نَجْدٍ قَرْنًا \".\nقَالَ : قَالَ ابْنُ عُمَرَ : أَمَّا هَذِهِ الثَّلَاثُ فَإِنِّي سَمِعْتُهُنَّ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَبَلَغَنِي أَنَّهُ وَقَّتَ لِأَهْلِ الْيَمَنِ يَلَمْلَمَ .\nأَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارَ  ، عَنْ ابْنِ عُمَرَ  ، مِثْلَهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Ahmad bin Abdullah bin Yunus, telah menceritakan kepada kami Malik, daripada Nafi', daripada Ibn Umar, beliau berkata: \"Rasulullah SAW telah menetapkan bagi penduduk Madinah, Zul Hulaifah sebagai miqat mereka, bagi penduduk Syam, al-Juhfah, dan bagi penduduk Najd, Qarn.\"\nBeliau berkata: Ibn Umar berkata: \"Adapun tiga tempat ini, sesungguhnya aku mendengarnya daripada Rasulullah SAW, dan telah sampai kepadaku bahawa baginda menetapkan bagi penduduk Yaman, Yalamlam.\"\nTelah mengkhabarkan kepada kami Ahmad bin Abdullah, telah menceritakan kepada kami Malik, daripada Abdullah bin Dinar, daripada Ibn Umar, sepertinya."
  },
  {
    "id": 38631,
    "hadith_number": 1094,
    "tajuk_hadith": "Penetapan Miqat untuk Jemaah Haji dan Umrah",
    "perawi_melayu": "Diriwayatkan oleh Muslim bin Ibrahim, daripada Wuhaib, daripada Ibnu Tawus, daripada ayahnya, daripada Ibnu Abbas",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا وُهَيْبٌ  ، حَدَّثَنَا ابْنُ طَاوُسٍ  ، عَنْ أَبِيهِ  ، عَنْ ابْنِ عَبَّاسٍ  ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" وَقَّتَ لِأَهْلِ الْمَدِينَةِ ذَا الْحُلَيْفَةِ ، وَلِأَهْلِ الشَّامِ الْجُحْفَةَ ، وَلِأَهْلِ نَجْدٍ قَرْنَ الْمَنَازِلِ ، وَلِأَهْلِ الْيَمَنِ يَلَمْلَمَ ، هُنَّ لِأَهْلِهِنَّ، وَلِكُلِّ آتٍ أَتَى عَلَيْهِنَّ مِنْ غَيْرِهِنَّ مِمَّنْ أَرَادَ الْحَجَّ وَالْعُمْرَةَ، وَمَنْ كَانَ دُونَ ذَلِكَ فَمِنْ حَيْثُ أَنْشَأَ، حَتَّى أَهْلُ مَكَّةَ مِنْ مَكَّةَ \"",
    "malay_translation": "Telah menceritakan kepada kami Muslim bin Ibrahim, telah menceritakan kepada kami Wuhaib, telah menceritakan kepada kami Ibnu Tawus, daripada ayahnya, daripada Ibnu Abbas, bahawasanya Nabi SAW telah menetapkan bagi penduduk Madinah di Dzul Hulaifah, bagi penduduk Syam di Juhfah, bagi penduduk Najd di Qarnul Manazil, dan bagi penduduk Yaman di Yalamlam. Tempat-tempat tersebut adalah untuk penduduknya, dan bagi setiap orang yang datang melaluinya dari selain penduduknya yang berniat untuk haji dan umrah. Dan barangsiapa yang tinggal lebih dekat dari itu, maka (ihramnya) dari tempat dia mulai berniat, sehingga penduduk Makkah (ihramnya) dari Makkah."
  },
  {
    "id": 38632,
    "hadith_number": 1095,
    "tajuk_hadith": "Mencuci Kepala Ketika Berihram: Perbezaan Pendapat dan Penjelasan Abu Ayyub al-Ansari",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا ابْنُ عُيَيْنَةَ  ، عَنْ زَيْدِ بْنِ أَسْلَمَ  ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ  ، عَنْ أَبِيهِ  ، قَالَ : امْتَرَى الْمِسْوَرُ بْنُ مَخْرَمَةَ، وَابْنُ عَبَّاسٍ فِي غَسْلِ الْمُحْرِمِ رَأْسَهُ، فَأَرْسَلُونِي إِلَى أَبِي أَيُّوبَ الْأَنْصَارِيّ : كَيْفَ رَأَيْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْسِلُ رَأْسَهُ وَهُوَ مُحْرِمٌ؟ فَأَتَيْتُ أَبَا أَيُّوبَ   وَهُوَ بَيْنَ قَرْنَيْ الْبِئْرِ وَقَدْ سُتِرَ عَلَيْهِ بِثَوْبٍ، فَسَلَّمْتُ عَلَيْهِ فَضَمَّ الثَّوْبَ إِلَيْهِ، فَقُلْتُ : أَرْسَلَنِي إِلَيْكَ ابْنُ أَخِيكَ ابْنُ عَبَّاسٍ : كَيْفَ رَأَيْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْسِلُ رَأْسَهُ؟\" فَأَمَرَّ يَدَيْهِ عَلَى رَأْسِهِ مُقْبِلًا وَمُدْبِرًا \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Yusuf, telah menceritakan kepada kami Ibnu Uyainah, daripada Zaid bin Aslam, daripada Ibrahim bin Abdullah bin Hunain, daripada ayahnya, dia berkata: Al-Miswar bin Makhramah dan Ibnu Abbas berselisih pendapat tentang mencuci kepala bagi orang yang berihram. Lalu mereka mengutusku kepada Abu Ayyub al-Ansari: 'Bagaimana engkau melihat Rasulullah SAW mencuci kepalanya ketika berihram?' Maka aku mendatangi Abu Ayyub ketika dia berada di antara dua sisi telaga dan telah ditutupi dengan kain. Aku mengucapkan salam kepadanya, lalu dia merapatkan kainnya kepadanya. Aku berkata: 'Ibnu Abbas, anak saudaramu, telah mengutusku kepadamu: Bagaimana engkau melihat Rasulullah SAW mencuci kepalanya?' Lalu dia mengusapkan kedua tangannya ke kepalanya, dari depan dan belakang."
  },
  {
    "id": 38633,
    "hadith_number": 1096,
    "tajuk_hadith": "Nabi Muhammad SAW Mandi Sebelum Berihram",
    "perawi_melayu": "Diriwayatkan daripada Abdullah bin Abi Ziyad, daripada Abdullah bin Ya'qub al-Madani, daripada Ibn Abi Zinad, daripada ayahnya, daripada Kharijah bin Zaid bin Thabit, daripada ayahnya, bahawa Nabi SAW bertelanjang untuk berihram dan mandi.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ أَبِي زِيَادٍ  ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَعْقُوبَ الْمَدَنِيُّ  ، عَنْ ابْنِ أَبِي الزِّنَادِ  ، عَنْ أَبِيهِ  ، عَنْ خَارِجَةَ بْنِ زَيْدِ بْنِ ثَابِتٍ  ، عَنْ أَبِيهِ  ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" تَجَرَّدَ لِلْإِهْلَالِ وَاغْتَسَلَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abdullah bin Abi Ziyad, telah menceritakan kepada kami Abdullah bin Ya'qub al-Madani, daripada Ibn Abi Zinad, daripada ayahnya, daripada Kharijah bin Zaid bin Thabit, daripada ayahnya, bahawa Nabi SAW: \"Bertelanjang untuk berihram dan mandi.\""
  },
  {
    "id": 38634,
    "hadith_number": 1097,
    "tajuk_hadith": "Ganjaran Haji Mabrur dan Kelebihan Umrah",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، عَنْ سُفْيَانَ  ، عَنْ سُمَيٍّ  ، عَنْ أَبِي صَالِحٍ  ، عَنْ أَبِي هُرَيْرَةَ  ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :\" حَجَّةٌ مَبْرُورَةٌ لَيْسَ لَهَا ثَوَابٌ إِلَّا الْجَنَّةُ، وَعُمْرَتَانِ تُكَفِّرَانِ مَا بَيْنَهُمَا مِنْ الذُّنُوبِ \"",
    "malay_translation": "Ubaidullah bin Musa telah mengkhabarkan kepada kami, daripada Sufyan, daripada Sumay, daripada Abu Salih, daripada Abu Hurairah RA, bahawa Nabi SAW bersabda: \"Haji yang mabrur tidak ada balasan baginya melainkan syurga, dan dua umrah menghapuskan dosa di antara keduanya.\""
  },
  {
    "id": 38635,
    "hadith_number": 1098,
    "tajuk_hadith": "Keutamaan Haji yang Mabrur: Kembali Seperti Baru Lahir",
    "perawi_melayu": "Diriwayatkan dari Abu Hurairah RA, dari Nabi SAW",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ  ، حَدَّثَنَا شُعْبَةُ  ، حَدَّثَنِي مَنْصُورٌ  ، قَالَ : سَمِعْتُ أَبَا حَازِمٍ  يُحَدِّثُ، عَنْ أَبِي هُرَيْرَةَ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، أَنَّهُ قَالَ :\" مَنْ حَجَّ الْبَيْتَ فَلَمْ يَرْفُثْ وَلَمْ يَفْسُقْ، رَجَعَ كَمَا وَلَدَتْهُ أُمُّهُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Al-Walid At-Tiyalisi, telah menceritakan kepada kami Syu'bah, telah menceritakan kepadaku Mansur, dia berkata: Aku mendengar Abu Hazim menceritakan, dari Abu Hurairah RA, dari Nabi SAW, bahawa Baginda bersabda: \"Sesiapa yang mengerjakan haji di Baitullah, lalu dia tidak melakukan *rafath* (perkataan kotor atau perbuatan yang menimbulkan syahwat) dan tidak melakukan kefasikan, dia akan kembali (dari dosa-dosanya) seperti hari dia dilahirkan oleh ibunya.\""
  },
  {
    "id": 38636,
    "hadith_number": 1099,
    "tajuk_hadith": "Keutamaan Haji: Menguatkan Talbiah dan Mengalirkan Darah Qurban",
    "perawi_melayu": "Diriwayatkan oleh Muhammad bin Al-Ala, daripada Muhammad bin Ismail bin Abi Fudaik, daripada Ad-Dahhak bin Uthman, daripada Muhammad bin Al-Munkadir, daripada Abdurrahman bin Yarbu', daripada Abu Bakar RA.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ  ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيل بْنِ أَبِي فُدَيْكٍ  ، عَنْ الضَّحَّاكِ بْنِ عُثْمَانَ  ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَرْبُوعٍ  ، عَنْ أَبِي بَكْرٍ  ، قَالَ : سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : أَيُّ الْحَجِّ أَفْضَلُ؟ قَالَ :\" الْعَجُّ وَالثَّجُّ \".\n  الْعَجُّ يَعْنِي : التَّلْبِيَةَ، وَالثَّجُّ يَعْنِي : إِهْرَاقَ الدَّمِ",
    "malay_translation": "Abu Bakar RA berkata: Rasulullah SAW ditanya: “Haji yang manakah yang paling utama?” Baginda menjawab: “'Al-'Ajju dan Al-Thajju.” 'Al-'Ajju bermaksud: Talbiah, dan Al-Thajju bermaksud: Mengalirkan darah (qurban)."
  },
  {
    "id": 38637,
    "hadith_number": 1100,
    "tajuk_hadith": "Pakaian yang Dilarang Ketika Ihram",
    "perawi_melayu": "Yazid bin Harun, Yahya bin Sa'id, daripada Umar bin Nafi', daripada bapanya, daripada Ibn Umar",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا يَحْيَى هُوَ ابْنُ سَعِيدٍ  ، عَنْ عُمَرَ بْنِ نَافِعٍ  ، عَنْ أَبِيهِ  ، عَنْ ابْنِ عُمَرَ  ، أَنَّ رَجُلًا سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : مَا نَلْبَسُ مِنْ الثِّيَابِ إِذَا أَحْرَمْنَا؟ قَالَ :\" لَا تَلْبَسُوا الْقُمُصَ، وَلَا السَّرَاوِيلَاتِ، وَلَا الْعَمَائِمَ، وَلَا الْبَرَانِسَ، وَلَا الْخِفَافَ، إِلَّا أَنْ يَكُونَ أَحَدٌ لَيْسَتْ لَهُ نَعْلَانِ، فَلْيَلْبَسْ الْخُفَّيْنِ وَلْيَجْعَلْهُمَا أَسْفَلَ مِنْ الْكَعْبَيْنِ، وَلَا تَلْبَسُوا مِنْ الثِّيَابِ شَيْئًا مَسَّهُ وَرْسٌ وَلَا زَعْفَرَانٌ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah mengkhabarkan kepada kami Yahya iaitu Ibn Sa'id, daripada Umar bin Nafi', daripada bapanya, daripada Ibn Umar, bahawa seorang lelaki bertanya kepada Nabi SAW: \"Apakah jenis pakaian yang boleh kami pakai ketika berihram?\" Baginda bersabda: \"Janganlah kamu memakai baju kemeja, seluar, serban, penutup kepala, dan kasut yang menutupi buku lali, kecuali jika seseorang itu tidak mempunyai selipar, maka dia boleh memakai kasut yang menutupi buku lali dan hendaklah dia memotongnya di bawah buku lali. Dan janganlah kamu memakai pakaian yang terkena wars (sejenis pewarna) atau za'faran (kuma-kuma).\""
  },
  {
    "id": 38638,
    "hadith_number": 1101,
    "tajuk_hadith": "Kelonggaran Bagi Yang Tidak Mempunyai Kain dan Selipar Semasa Ihram",
    "perawi_melayu": "Diriwayatkan daripada Ibnu Abbas RA, beliau mendengar Nabi SAW bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ ابْنِ جُرَيْجٍ  ، عَنْ عَمْرِو بْنِ دِينَارٍ  ، عَنْ أَبِي الشَّعْثَاءِ  ، أَخْبَرَنِي ابْنُ عَبَّاسٍ  ، أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :\" مَنْ لَمْ يَجِدْ إِزَارًا، فَلْيَلْبَسْ سَرَاوِيلَ، وَمَنْ لَمْ يَجِدْ نَعْلَيْنِ، فَلْيَلْبَسْ خُفَّيْنِ \".\nقَالَ : قُلْتُ أَوْ قِيلَ : أَيَقْطَعُهُمَا؟ قَالَ : \" لَا \"",
    "malay_translation": "\"Sesiapa yang tidak menjumpai kain (untuk ihram), maka hendaklah dia memakai seluar. Dan sesiapa yang tidak menjumpai selipar, maka hendaklah dia memakai kasut.\" Beliau (Ibnu Abbas) berkata: Saya berkata atau dikatakan: \"Adakah perlu dipotong kedua-duanya?\" Baginda bersabda: \"Tidak.\""
  },
  {
    "id": 38639,
    "hadith_number": 1102,
    "tajuk_hadith": "Pakaian yang Dilarang Bagi Orang yang Berihram",
    "perawi_melayu": "Diriwayatkan dari Ibnu Umar R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ  ، قَالَ : سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَمَّا يَلْبَسُ الْمُحْرِمُ، قَالَ :\" لَا يَلْبَسُ الْقُمُصَ، وَلَا الْعَمَائِمَ، وَلَا السَّرَاوِيلَاتِ، وَلَا الْبَرَانِسَ، وَلَا الْخِفَافَ، إِلَّا أَنْ لَا يَجِدَ نَعْلَيْنِ، فَلْيَلْبَسَ خُفَّيْنِ وَيَقْطَعَهُمَا أَسْفَلَ مِنْ الْكَعْبَيْنِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Khalid bin Makhlad, telah menceritakan kepada kami Malik, dari Nafi', dari Ibnu Umar R.A., beliau berkata: Rasulullah SAW ditanya mengenai pakaian yang boleh dipakai oleh orang yang berihram. Baginda bersabda: \"Jangan memakai baju gamis, serban, seluar, burnus (pakaian yang ada penutup kepala), dan khuf (sejenis kasut). Kecuali jika dia tidak menjumpai selipar, maka dia boleh memakai khuf dan memotongnya di bawah kedua mata kaki.\""
  },
  {
    "id": 38640,
    "hadith_number": 1103,
    "tajuk_hadith": "Menggunakan Wangian Sebelum Ihram dan Selepas Melontar Jamrah pada Hari Nahr",
    "perawi_melayu": "Hajjaj bin Minhal, Hammad bin Salamah, Hisyam bin Urwah, daripada ayahnya, daripada Aisyah R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا حَجَّاجُ بْنُ مِنْهَالٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ هِشَامِ بْنِ عُرْوَةَ  ، عَنْ أَبِيهِ  ، عَنْ عَائِشَةَ  ، أَنَّهَا قَالَتْ : \"كُنْتُ أُطَيِّبُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْلَ أَنْ يُحْرِمَ بِأَطْيَبِ الطِّيبِ \"، قَالَ : وَكَانَ عُرْوَةُ يَقُولُ لَنَا : \" تَطَيَّبُوا قَبْلَ أَنْ تُحْرِمُوا وَقَبْلَ أَنْ تُفِيضُوا يَوْمَ النَّحْرِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Hajjaj bin Minhal, telah menceritakan kepada kami Hammad bin Salamah, daripada Hisyam bin Urwah, daripada ayahnya, daripada Aisyah R.A., bahawa beliau berkata: \"Aku pernah memakaikan Rasulullah SAW wangian sebelum baginda berihram dengan wangian yang paling wangi.\" Urwah berkata kepada kami: \"Berwangi-wangianlah kamu sebelum kamu berihram dan sebelum kamu melakukan *ifadah* (melontar jamrah) pada hari Nahr (Aidiladha).\""
  },
  {
    "id": 38641,
    "hadith_number": 1104,
    "tajuk_hadith": "Menggunakan Minyak Wangi Terbaik Ketika Ihram",
    "perawi_melayu": "Diriwayatkan daripada Aisyah R.A.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، حَدَّثَنِي اللَّيْثُ  ، عَنْ هِشَامٍ  ، عَنْ عُثْمَانَ بْنِ عُرْوَةَ  ، عَنْ عُرْوَةَ  ، عَنْ عَائِشَةَ  ، قَالَتْ : \" لَقَدْ كُنْتُأُطَيِّبُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ إِحْرَامِهِ بِأَطْيَبِ مَا أَجِدُ \"",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Soleh, telah menceritakan kepadaku Al-Laith, daripada Hisyam, daripada Uthman bin Urwah, daripada Urwah, daripada Aisyah R.A., beliau berkata: \"Sesungguhnya aku pernah memakaikan Rasulullah SAW minyak wangi ketika baginda berihram dengan minyak wangi yang paling wangi yang aku temui.\""
  },
  {
    "id": 38642,
    "hadith_number": 1105,
    "tajuk_hadith": "Menggunakan Wangian Sebelum Ihram dan Tawaf Ifadah",
    "perawi_melayu": "Diriwayatkan daripada Aisyah R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، وَجَعْفَرُ بْنُ عَوْنٍ  ، قَالَا : حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ  ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ  أَخْبَرَهُ، عَنْ أَبِيهِ  ، قَالَ : سَمِعْتُ عَائِشَةَ   رَضِيَ اللَّهُ عَنْهَا، تَقُولُ :\" طَيَّبْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِحُرْمِهِ، وَطَيَّبْتُهُ بِمِنًى قَبْلَ أَنْ يُفِيضَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun dan Ja'far bin Awn, mereka berdua berkata: Telah menceritakan kepada kami Yahya bin Sa'id, bahawa Abdurrahman bin al-Qasim mengkhabarkannya, daripada ayahnya, dia berkata: Aku mendengar Aisyah R.A. berkata: \"Aku telah memakaikan Rasulullah SAW wangian untuk ihramnya, dan aku telah memakaikannya di Mina sebelum baginda melakukan tawaf Ifadah.\""
  },
  {
    "id": 38643,
    "hadith_number": 1106,
    "tajuk_hadith": "Asma' Bernifas di Syajarah dan Arahan Rasulullah SAW kepada Abu Bakar",
    "perawi_melayu": "Uthman bin Muhammad",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي عُثْمَانُ بْنُ مُحَمَّدٍ  ، حَدَّثَنَا عَبْدَةُ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ  ، عَنْ أَبِيهِ  ، عَنْ عَائِشَةَ  ، قَالَتْ : \" نُفِسَتْ أَسْمَاءُ بِمُحَمَّدِ بْنِ أَبِي بَكْرٍ بِالشَّجَرَةِ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبَا بَكْرٍ أَنْ\" تَغْتَسِلَ وَتُهِلَّ \"",
    "malay_translation": "Telah menceritakan kepadaku Uthman bin Muhammad, telah menceritakan kepada kami 'Abdah, daripada Ubaidillah bin Umar, daripada Abdurrahman bin Al-Qasim, daripada ayahnya, daripada Aisyah RA, beliau berkata: \"Asma' bernifas (melahirkan) Muhammad bin Abu Bakar di Syajarah. Maka Rasulullah SAW memerintahkan Abu Bakar untuk mandi dan berihram.\""
  },
  {
    "id": 38644,
    "hadith_number": 1107,
    "tajuk_hadith": "Perintah Mandi dan Berihram bagi Wanita Nifas di Dzul Hulaifah",
    "perawi_melayu": "Uthman bin Muhammad",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُثْمَانُ بْنُ مُحَمَّدٍ  ، حَدَّثَنَا جَرِيرٌ  ، عَنْ يَحْيَى بْنِ سَعِيدٍ  ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ  ، عَنْ أَبِيهِ  ، عَنْ جَابِرٍ  ، فِي حَدِيثِ أَسْمَاءَ بِنْتِ عُمَيْسٍ ، حِينَ نُفِسَتْ بِذِي الْحُلَيْفَةِ ، فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبَا بَكْرٍ أَنْ يَأْمُرَهَا أَنْ\" تَغْتَسِلَ وَتُهِلَّ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Uthman bin Muhammad, telah menceritakan kepada kami Jarir, daripada Yahya bin Sa'id, daripada Ja'far bin Muhammad, daripada ayahnya, daripada Jabir, dalam hadith Asma' binti Umais, ketika beliau nifas di Dzul Hulaifah, maka Rasulullah SAW memerintahkan Abu Bakar untuk menyuruhnya agar \"mandi dan berihram.\""
  },
  {
    "id": 38645,
    "hadith_number": 1108,
    "tajuk_hadith": "Niat Ihram Selepas Solat",
    "perawi_melayu": "Diriwayatkan daripada Ibnu Abbas R.A bahawa Nabi SAW berniat ihram selepas solat.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ  ، أَخْبَرَنَا عَبْدُ السَّلَامِ بْنُ حَرْبٍ  ، عَنْ خُصَيْفٍ  ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ  ، عَنْ ابْنِ عَبَّاسٍ   رَضِيَ اللَّهُ عَنْهُمَا، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" أَحْرَمَ دُبُرَ الصَّلَاةِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami 'Amru bin 'Aun, telah mengkhabarkan kepada kami 'Abdus Salam bin Harb, daripada Khusaif, daripada Sa'id bin Jubair, daripada Ibnu 'Abbas R.A, bahawa Nabi SAW berihram selepas solat."
  },
  {
    "id": 38646,
    "hadith_number": 1109,
    "tajuk_hadith": "Nabi ﷺ Berihram dan Bertalbiah Selepas Solat",
    "perawi_melayu": "Diriwayatkan daripada Anas bin Malik RA bahawa Nabi ﷺ berihram dan bertalbiah selepas solat.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاق  ، قَالَ : أَخْبَرَنَا النَّضْرُ هُوَ ابْنُ شُمَيْلٍ  ، أَخْبَرَنَا أَشْعَثُ  ، عَنْ الْحَسَنِ  ، عَنْ أَنَسِ بْنِ مَالِكٍ  ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" أَحْرَمَ وَأَهَلَّ فِي دُبُرِ الصَّلَاةِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ishaq, beliau berkata: Telah mengkhabarkan kepada kami an-Nadr, iaitu Ibnu Syumail, telah mengkhabarkan kepada kami Asy'ath, daripada al-Hasan, daripada Anas bin Malik RA, bahawa Nabi ﷺ berihram dan bertalbiah selepas solat."
  },
  {
    "id": 38647,
    "hadith_number": 1110,
    "tajuk_hadith": "Talbiah Nabi Muhammad SAW dalam Haji",
    "perawi_melayu": "Yazid bin Harun, Yahya bin Sa'id, daripada Nafi', daripada Ibn Umar",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ  ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا لَبَّى، قَالَ :\" لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ، لَا شَرِيكَ لَكَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah mengkhabarkan kepada kami Yahya iaitu Ibn Sa'id, daripada Nafi', daripada Ibn Umar, bahawa Nabi SAW apabila bertalbiah, baginda bersabda: “Labbaik Allahumma Labbaik, Labbaik Laa Syarika Laka Labbaik, Innal Hamda Wan Ni’mata Laka Wal Mulk, Laa Syarika Laka.” (Aku penuhi panggilan-Mu ya Allah, aku penuhi panggilan-Mu. Aku penuhi panggilan-Mu, tiada sekutu bagi-Mu, aku penuhi panggilan-Mu. Sesungguhnya segala pujian, nikmat dan pemerintahan adalah milik-Mu, tiada sekutu bagi-Mu)."
  },
  {
    "id": 38648,
    "hadith_number": 1111,
    "tajuk_hadith": "Tambahan Lafaz Talbiah oleh Ibnu Umar",
    "perawi_melayu": "Yahya berkata: Nafi' menyebut bahawa Ibnu Umar menambah kalimah-kalimah ini: \"Labbaik, dan harapan hanya kepada-Mu, dan amalan (juga untuk-Mu). Labbaik, Labbaik.\"",
    "english_text": "",
    "arabic_text": "قَالَ يَحْيَى  : وَذَكَرَ نَافِعٌ  أَنَّ ابْنَ عُمَرَ   كَانَ يَزِيدُ هَؤُلَاءِ الْكَلِمَاتِ :\" لَبَّيْكَ وَالرَّغْبَاءُ إِلَيْكَ وَالْعَمَلُ، لَبَّيْكَ لَبَّيْكَ \"",
    "malay_translation": "Yahya berkata: Nafi' menyebut bahawa Ibnu Umar RA menambah kalimah-kalimah ini: \"Labbaik, dan harapan hanya kepada-Mu, dan amalan (juga untuk-Mu). Labbaik, Labbaik.\""
  },
  {
    "id": 38649,
    "hadith_number": 1112,
    "tajuk_hadith": "Mengangkat Suara dalam Talbiah atau Ihram",
    "perawi_melayu": "Diriwayatkan oleh Khalid bin Makhlad, daripada Malik, daripada Abdullah bin Abi Bakr, daripada Khallad bin as-Sa'ib, daripada ayahnya.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ  ، عَنْ خَلَّادِ بْنِ السَّائِبِ  ، عَنْ أَبِيهِ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" أَتَانِي جِبْرَائِيلُ ، فَقَالَ : مُرْ أَصْحَابَكَ أَوْ مَنْ مَعَكَ أَنْ يَرْفَعُوا أَصْوَاتَهُمْ بِالتَّلْبِيَةِ أَوْ بِالْإِهْلَالِ \".\nحَدَّثَنَا عُثْمَانُ بْنُ مُحَمَّدٍ  ، حَدَّثَنَا ابْنُ عُيَيْنَةَ  ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ  ، بِإِسْنَادِهِ نَحْوَهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Khalid bin Makhlad, telah menceritakan kepada kami Malik, daripada Abdullah bin Abi Bakr, daripada Khallad bin as-Sa'ib, daripada ayahnya, dia berkata: Rasulullah SAW bersabda: \"Jibril datang kepadaku dan berkata: Perintahkan sahabatmu atau sesiapa sahaja yang bersamamu untuk mengangkat suara mereka dengan talbiah atau dengan ihlal (mengangkat suara ketika berihram).\" Telah menceritakan kepada kami Uthman bin Muhammad, telah menceritakan kepada kami Ibnu Uyainah, daripada Abdullah bin Abi Bakr, dengan sanad yang serupa."
  },
  {
    "id": 38650,
    "hadith_number": 1113,
    "tajuk_hadith": "Cara Berniat Haji dengan Bersyarat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا ثَابِتُ بْنُ يَزِيدَ  ، حَدَّثَنَا هِلَالُ بْنُ خَبَّابٍ  ، قَالَ : فَحَدَّثْتُ عِكْرِمَةَ  فَحَدَّثَنِي،  عَنْ ابْنِ عَبَّاسٍ   : أَنَّ ضُبَاعَةَ بِنْتَ الزُّبَيْرِ بْنِ عَبْدِ الْمُطَّلِبِ ، أَتَتِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَتْ : يَا رَسُولَ اللَّهِ، إِنِّي أُرِيدُ أَنْ أَحُجَّ، فَكَيْفَ أَقُولُ؟ قَالَ : \" قُولِي :لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، وَمَحِلِّي حَيْثُ تَحْبِسُنِي، فَإِنَّ لَكِ عَلَى رَبِّكِ مَا اسْتَثْنَيْتِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu An-Nu'man, telah menceritakan kepada kami Thabit bin Yazid, telah menceritakan kepada kami Hilal bin Khabbab, dia berkata: Lalu aku menceritakan kepada Ikrimah, lalu dia menceritakan kepadaku, daripada Ibnu Abbas: Bahawa Dhuba'ah binti Zubair bin Abdul Muttalib telah datang kepada Nabi SAW, lalu berkata: Wahai Rasulullah, sesungguhnya aku ingin mengerjakan haji, maka bagaimana aku harus berniat? Baginda bersabda: \"Katakanlah: 'Labbayk Allahumma labbayk, wa mahilli haithu habastani' (Aku penuhi panggilan-Mu ya Allah, aku penuhi panggilan-Mu, dan tempat tahallulku adalah di mana Engkau menahanku), maka sesungguhnya bagimu atas Tuhanmu apa yang telah engkau kecualikan.\""
  },
  {
    "id": 38651,
    "hadith_number": 1114,
    "tajuk_hadith": "Rasulullah SAW Melaksanakan Haji Secara Ifrad",
    "perawi_melayu": "Diriwayatkan oleh Malik daripada Abdurrahman bin al-Qasim daripada ayahnya daripada Aisyah RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ  ، عَنْ أَبِيهِ  ، عَنْ عَائِشَةَ   رَضِيَ اللَّهُ تَعَالَى عَنْهَا، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" أَفْرَدَ الْحَجَّ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Khalid bin Makhlad, telah menceritakan kepada kami Malik, daripada Abdurrahman bin al-Qasim, daripada ayahnya, daripada Aisyah RA, bahawa Rasulullah SAW melaksanakan haji secara Ifrad (haji yang dilakukan secara terpisah dari umrah)."
  },
  {
    "id": 38652,
    "hadith_number": 1115,
    "tajuk_hadith": "Keharusan Mut'ah dalam Kitab Allah dan Pengalaman Imran bin Husain dengan Penyembuhan",
    "perawi_melayu": "Sulaiman bin Harb",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، أَخْبَرَنَا أَبُو هِلَالٍ  ، حَدَّثَنَا قَتَادَةُ  ، عَنْ مُطَرِّفٍ  ، قَالَ : قَالَ عِمْرَانُ بْنُ حُصَيْنٍ   : إِنِّي مُحَدِّثُكَ بِحَدِيثٍ لَعَلَّ اللَّهَ أَنْ يَنْفَعَكَ بِهِ بَعْدُ، إِنَّهُ كَانَ يُسَلَّمُ عَلَيَّ وَإِنَّ ابْنَ زِيَادٍ أَمَرَنِي فَاكْتَوَيْتُ، فَاحْتُبِسَ عَنِّي حَتَّى ذَهَبَ أَثَرُ الْمَكَاوِي، وَاعْلَمْ أَنَّ\" الْمُتْعَةَ حَلَالٌ فِي كِتَابِ اللَّهِ، لَمْ يَنْهَ عَنْهَا نَبِيٌّ، وَلَمْ يَنْزِلْ فِيهَا كِتَابٌ \"، قَالَ رَجُلٌ بِرَأْيِهِ مَا بَدَا لَهُ",
    "malay_translation": "Sulaiman bin Harb memberitahu kami, Abu Hilal memberitahu kami, Qatadah menceritakan kepada kami, daripada Mutarrif, dia berkata: Imran bin Husain berkata: “Sesungguhnya aku akan menceritakan kepadamu sebuah Hadith, semoga Allah memberikan manfaat kepadamu dengannya setelah ini. Sesungguhnya salam diucapkan kepadaku, dan Ibnu Ziyad memerintahkanku lalu aku berbekam, maka (keberkahan itu) tertahan dariku sehingga bekas bekam itu hilang. Ketahuilah bahawa 'Mut'ah adalah halal di dalam Kitab Allah, tidak ada seorang Nabi pun yang melarangnya, dan tidak ada kitab pun yang diturunkan mengenainya.' Kemudian seorang lelaki berkata menurut pendapatnya sendiri apa yang tampak padanya.”"
  },
  {
    "id": 38653,
    "hadith_number": 1116,
    "tajuk_hadith": "Kelebihan Tamattu' dalam Haji dan Pendapat Saidina Umar r.a.",
    "perawi_melayu": "Ahmad bin Khalid, daripada Muhammad bin Ishaq, daripada al-Zuhri, daripada Muhammad bin Abdullah bin Naufal",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ خَالِدٍ  ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاق  ، عَنْ الزُّهْرِيِّ  ، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ نَوْفَلٍ  ، قَالَ : سَمِعْتُ عَامَ حَجَّ مُعَاوِيَةُ يَسْأَلُ سَعْدَ بْنَ مَالِكٍ   :\" كَيْفَ تَقُولُ بِالتَّمَتُّعِ بِالْعُمْرَةِ إِلَى الْحَجِّ؟ قَالَ : حَسَنَةٌ جَمِيلَةٌ \".\nفَقَالَ : قَدْ كَانَ عُمَرُ يَنْهَى عَنْهَا، فَأَنْتَ خَيْرٌ مِنْ عُمَرَ؟ قَالَ : عُمَرُ خَيْرٌ مِنِّي، وَقَدْ فَعَلَ ذَلِكَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ خَيْرٌ مِنْ عُمَرَ",
    "malay_translation": "Ahmad bin Khalid memberitahu kami, Muhammad bin Ishaq menceritakan kepada kami, daripada al-Zuhri, daripada Muhammad bin Abdullah bin Naufal, dia berkata: Aku mendengar pada tahun Muawiyah mengerjakan haji, dia bertanya kepada Sa'ad bin Malik: \"Bagaimana pendapatmu tentang tamattu' umrah hingga haji?\" Dia menjawab: \"Ia adalah baik dan indah.\"\n\nMuawiyah berkata: \"Umar pernah melarangnya, adakah engkau lebih baik daripada Umar?\" Dia menjawab: \"Umar lebih baik daripadaku, dan Nabi SAW telah melakukannya dan baginda lebih baik daripada Umar.\""
  },
  {
    "id": 38654,
    "hadith_number": 1117,
    "tajuk_hadith": "Abu Musa Bertemu Rasulullah SAW di Batha' dan Arahan Baginda Mengenai Haji",
    "perawi_melayu": "Sahl bin Hammad, daripada Syu'bah, daripada Qais bin Muslim, daripada Tariq, daripada Abu Musa",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَهْلُ بْنُ حَمَّادٍ  ، حَدَّثَنَا شُعْبَةُ  ، حَدَّثَنَا قَيْسُ بْنُ مُسْلِمٍ  ، عَنْ طَارِقٍ  ، عَنْ أَبِي مُوسَى  ، قَالَ : أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ حَجَّ وَهُوَ مُنِيخٌ بِالْبَطْحَاءِ ، فَقَالَ لِي : \" أَحَجَجْتَ؟ \" قُلْتُ : نَعَمْ.\nقَالَ : \" كَيْفَ أَهْلَلْتَ؟ \".\nقَالَ : قُلْتُ : لَبَّيْكَ بِإِهْلَالٍ كَإِهْلَالِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.\nقَالَ : \" أَحْسَنْتَ،اذْهَبْ فَطُفْ بِالْبَيْتِ ، وَبِالصَّفَا وَالْمَرْوَةِ ، ثُمَّ حِلَّ \".\nقَالَ : فَطُفْتُ بِالْبَيْتِ ، وَبِالصَّفَا وَالْمَرْوَةِ ، ثُمَّ أَتَيْتُ امْرَأَةً مِنْ نِسَاءِ بَنِي قَيْسٍ فَجَعَلَتْ تَفْلِي رَأْسِي، فَجَعَلْتُ أُفْتِي النَّاسَ بِذَلِكَ، فَقَالَ لِي رَجُلٌ : يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ، رُوَيْدًا بَعْضَ فُتْيَاكَ، فَإِنَّكَ لَا تَدْرِي مَا أَحْدَثَ أَمِيرُ الْمُؤْمِنِينَ فِي النُّسُكِ بَعْدَكَ.\nفَقُلْتُ : يَا أَيُّهَا النَّاسُ، مَنْ كُنَّا أَفْتَيْنَاهُ فُتْيَا، فَلْيَتَّئِدْ، فَإِنَّ أَمِيرَ الْمُؤْمِنِينَ قَادِمٌ عَلَيْكُمْ فَبِهِ فَأْتَمُّوا.\nفَلَمَّا قَدِمَ أَتَيْتُهُ فَذَكَرْتُ ذَلِكَ لَهُ، فَقَالَ : إِنْ نَأْخُذْ بِكِتَابِ اللَّهِ، فَإِنَّ كِتَابَ اللَّهِ يَأْمُرُ بِالتَّمَامِ، وَإِنْ نَأْخُذْ بِسُنَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَحِلَّ حَتَّى بَلَغَ الْهَدْيُ مَحِلَّهُ",
    "malay_translation": "Telah menceritakan kepada kami Sahl bin Hammad, telah menceritakan kepada kami Syu'bah, telah menceritakan kepada kami Qais bin Muslim, daripada Tariq, daripada Abu Musa, dia berkata: Aku mendatangi Rasulullah SAW ketika baginda mengerjakan haji dan baginda sedang berhenti di Bathha'. Baginda bertanya kepadaku: \"Adakah kamu telah mengerjakan haji?\" Aku menjawab: \"Ya.\" Baginda bertanya: \"Bagaimana kamu berniat (ihlal)?\" Aku menjawab: \"Aku mengucapkan 'Labbaik' dengan niat seperti niat Nabi SAW.\" Baginda bersabda: \"Bagus, pergi dan tawaf di Baitullah, dan di Safa dan Marwah, kemudian bertahallul.\" Dia berkata: Maka aku pun tawaf di Baitullah, dan di Safa dan Marwah, kemudian aku mendatangi seorang wanita dari kalangan wanita Bani Qais dan dia mula membersihkan (mencabut kutu) kepalaku, lalu aku pun mula memberikan fatwa kepada orang ramai tentang hal itu. Kemudian seorang lelaki berkata kepadaku: \"Wahai Abdullah bin Qais, perlahan-lahan dengan beberapa fatwamu, kerana kamu tidak tahu apa yang telah diperbaharui oleh Amirul Mukminin dalam ibadah haji selepas kamu.\" Aku berkata: \"Wahai sekalian manusia, sesiapa yang telah kami berikan fatwa, maka hendaklah dia berhati-hati, kerana Amirul Mukminin akan datang kepada kamu, maka ikutilah dia.\" Apabila beliau (Amirul Mukminin) tiba, aku mendatanginya dan menceritakan hal itu kepadanya, lalu beliau berkata: \"Jika kita berpegang kepada Kitab Allah, maka sesungguhnya Kitab Allah memerintahkan kesempurnaan (haji), dan jika kita berpegang kepada sunnah Rasulullah SAW, maka sesungguhnya Rasulullah SAW tidak bertahallul sehingga hadyu (binatang korban) sampai ke tempatnya (Mekah).\""
  },
  {
    "id": 38655,
    "hadith_number": 1118,
    "tajuk_hadith": "Lima Haiwan yang Boleh Dibunuh Tanpa Dosa",
    "perawi_melayu": "Diriwayatkan daripada Ibnu Umar RA bahawa Nabi SAW bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا يَحْيَى  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ  ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :\" خَمْسٌ لَا جُنَاحَ فِي قَتْلِ مَنْ قُتِلَ مِنْهُنَّ : الْغُرَابُ، وَالْفَأْرَةُ، وَالْحِدَأَةُ، وَالْعَقْرَبُ، وَالْكَلْبُ الْعَقُورُ \"",
    "malay_translation": "Yazid bin Harun memberitahu kami, Yahya memberitahu kami, daripada Nafi', daripada Ibnu Umar RA, bahawa Nabi SAW bersabda: \"Lima jenis haiwan yang tidak berdosa membunuh sesiapa sahaja daripada jenisnya: gagak, tikus, helang merah, kala jengking, dan anjing gila.\""
  },
  {
    "id": 38656,
    "hadith_number": 1119,
    "tajuk_hadith": "Perintah Membunuh Lima Haiwan yang Memudaratkan di Tanah Halal dan Haram",
    "perawi_melayu": "Diriwayatkan daripada Aisyah R.A., Rasulullah SAW memerintahkan untuk membunuh lima haiwan yang memudaratkan di tanah halal dan haram: burung helang, burung gagak, tikus, kala jengking, dan anjing gila.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاق  ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ  ، حَدَّثَنَا مَعْمَرٌ  ، عَنْ الزُّهْرِيِّ  ، عَنْ عُرْوَةَ  ، عَنْ عَائِشَةَ   رَضِيَ اللَّهُ عَنْهَا، قَالَتْ : \" أَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَبِقَتْلِ خَمْسِ فَوَاسِقَ فِي الْحِلِّ وَالْحَرَمِ : الْحِدَأَةِ، وَالْغُرَابِ، وَالْفَأْرَةِ، وَالْعَقْرَبِ، وَالْكَلْبِ الْعَقُورِ \".\nقَالَ عَبْد اللَّهِ : الْكَلْبُ الْعَقُورُ، وَقَالَ بَعْضُهُمْ : الْأَسْوَدُ.\nأَخْبَرَنَا عَبْدُ الرَّزَّاقِ  ، قَالَ بَعْضُ أَصْحَابِنَا  : إِنَّ مَعْمَرًا  كَانَ يَذْكُرُهُ، عَنْ الزُّهْرِيِّ  ، عَنْ سَالِمٍ  ، عَنْ أَبِيهِ   وعُرْوَةَ  ، عَنْ عَائِشَةَ   رَضِيَ اللَّهُ عَنْهَا، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
    "malay_translation": "Telah mengkhabarkan kepada kami Ishaq, telah mengkhabarkan kepada kami Abdul Razzaq, telah menceritakan kepada kami Ma'mar, daripada az-Zuhri, daripada Urwah, daripada Aisyah R.A., beliau berkata: \"Rasulullah SAW memerintahkan untuk membunuh lima haiwan yang memudaratkan di tanah halal dan haram: burung helang, burung gagak, tikus, kala jengking, dan anjing gila.\"\nAbdullah berkata: Anjing gila, dan sebahagian daripada mereka berkata: Anjing hitam.\nTelah mengkhabarkan kepada kami Abdul Razzaq, sebahagian daripada sahabat kami berkata: Sesungguhnya Ma'mar pernah menyebutnya, daripada az-Zuhri, daripada Salim, daripada ayahnya dan Urwah, daripada Aisyah R.A., daripada Nabi SAW."
  },
  {
    "id": 38657,
    "hadith_number": 1120,
    "tajuk_hadith": "Rasulullah SAW Berbekam Ketika Berihram",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانُ  ، عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ  ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ :\" احْتَجَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُحْرِمٌ \"",
    "malay_translation": "Muhammad bin Yusuf memberitahu kami, daripada Sufyan, daripada Abdullah bin Uthman, daripada Said bin Jubair, daripada Ibnu Abbas, dia berkata: \"Rasulullah SAW berbekam ketika baginda sedang berihram.\""
  },
  {
    "id": 38658,
    "hadith_number": 1121,
    "tajuk_hadith": "Rasulullah SAW Berbekam dalam Keadaan Berihram",
    "perawi_melayu": "Diriwayatkan oleh Marwan bin Muhammad, daripada Sulaiman bin Bilal, daripada 'Alqamah bin Abi 'Alqamah, daripada 'Abdur Rahman al-A'raj, daripada 'Abdullah ibn Buhainah, katanya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ  ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ  ، حَدَّثَنَا عَلْقَمَةُ بْنُ أَبِي عَلْقَمَةَ  ، عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ  ، عَنْ عَبْدِ اللَّهِ ابْنِ بُحَيْنَةَ  ، قَالَ :\" احْتَجَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِلَحْيِ جَمَلٍ ، وَهُوَ مُحْرِمٌ \"",
    "malay_translation": "\"Rasulullah SAW berbekam di Lahyi Jamal (nama tempat), dan baginda dalam keadaan berihram.\""
  },
  {
    "id": 38659,
    "hadith_number": 1122,
    "tajuk_hadith": "Rasulullah SAW Berbekam dalam Keadaan Ihram",
    "perawi_melayu": "Diriwayatkan oleh Ishaq, daripada Sufyan, daripada 'Amr, daripada 'Ata', dan Tawus, daripada Ibn 'Abbas, bahawa Rasulullah SAW berbekam dalam keadaan ihram.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاق  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ عَمْرٍو  ، عَنْ عَطَاءٍ  ، وَطَاوُسٍ  ،  عَنْ ابْنِ عَبَّاسٍ  ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" احْتَجَمَ وَهُوَ مُحْرِمٌ \".\nقَالَ إِسْحَاق L927 : قَالَ سُفْيَانُ مَرَّةً : عَنْ عَطَاءٍ، وَمَرَّةً، عَنْ طَاوُسٍ، وَجَمَعَهُمَا مَرَّةً",
    "malay_translation": "Telah menceritakan kepada kami Ishaq, telah menceritakan kepada kami Sufyan, daripada 'Amr, daripada 'Ata', dan Tawus, daripada Ibn 'Abbas, bahawa Rasulullah SAW berbekam ketika baginda sedang berihram. Ishaq berkata: Sufyan pernah berkata: Daripada 'Ata', dan sekali lagi, daripada Tawus, dan dia menggabungkan keduanya sekali."
  },
  {
    "id": 38660,
    "hadith_number": 1123,
    "tajuk_hadith": "Nabi Muhammad SAW Berkahwin Ketika Dalam Keadaan Ihram",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ عَمْرِو بْنِ دِينَارٍ  ، عَنْ جَابِرِ بْنِ زَيْدٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ :\" تَزَوَّجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُحْرِمٌ \"",
    "malay_translation": "Telah menceritakan kepada kami Hasyim bin al-Qasim, telah menceritakan kepada kami Syu'bah, daripada 'Amru bin Dinar, daripada Jabir bin Zaid, daripada Ibn 'Abbas, beliau berkata: \"Nabi SAW telah berkahwin ketika baginda dalam keadaan ihram.\""
  },
  {
    "id": 38661,
    "hadith_number": 1124,
    "tajuk_hadith": "Larangan Nikah Bagi Orang Yang Berihram",
    "perawi_melayu": "Sulaiman bin Harb, Hammad bin Zaid, Ayyub, Nafi', Nubaid bin Wahb",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، عَنْ أَيُّوبَ  ، عَنْ نَافِعٍ  ، عَنْ نُبَيْهِ بْنِ وَهْبٍ   : أَنَّ رَجُلًا مِنْ قُرَيْشٍ خَطَبَ إِلَى أَبَانَ بْنِ عُثْمَانَ وَهُوَ أَمِيرُ الْمَوْسِمِ ، فَقَالَ أَبَانُ : لَا أُرَاهُ إِلا عِرَاقِيًّا جَافِيًا، \" إِنَّالْمُحْرِمَ لَا يَنْكِحُ وَلَا يُنْكِحُ \".\nأَخْبَرَنَا بِذَلِكَ عُثْمَانُ  ، عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.\nسُئِلَ أَبُو مُحَمَّد : تَقُولُ بِهَذَا؟ قَالَ : نَعَمْ",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Hammad bin Zaid, daripada Ayyub, daripada Nafi', daripada Nubaid bin Wahb: Bahawa seorang lelaki daripada Quraisy meminang kepada Aban bin Uthman, dan beliau adalah Amir al-Mawsim (ketua musim haji). Aban berkata: Aku tidak melihatnya melainkan seorang lelaki Iraq yang kasar. 'Sesungguhnya orang yang berihram tidak boleh menikah dan tidak boleh menikahkan.' Uthman telah mengkhabarkan kepada kami tentang perkara itu daripada Rasulullah SAW. Abu Muhammad ditanya: Adakah kamu berpendapat dengan ini? Beliau menjawab: Ya."
  },
  {
    "id": 38662,
    "hadith_number": 1125,
    "tajuk_hadith": "Pernikahan Rasulullah SAW dengan Maimunah di Sarif setelah Kembali dari Mekah dalam Keadaan Halal",
    "perawi_melayu": "Diriwayatkan oleh 'Amru bin 'Asim, daripada Hammad bin Salamah, daripada Habib bin ash-Shahid, daripada Maimun bin Mihran, daripada Yazid bin al-Asamm.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ حَبِيبِ بْنِ الشَّهِيدِ  ، عَنْ مَيْمُونِ بْنِ مِهْرَانَ  ، عَنْ يَزِيدَ بْنِ الْأَصَمِّ  ، أَنَّ مَيْمُونَةَ  ، قَالَتْ :\" تَزَوَّجَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ حَلَالَانِ بَعْدَمَا رَجَعَ مِنْ مَكَّةَ بِسَرِفَ \"",
    "malay_translation": "Maimunah RA berkata: \"Rasulullah SAW telah menikahi saya ketika kami berdua berada dalam keadaan halal, setelah baginda kembali dari Mekah di Sarif.\""
  },
  {
    "id": 38663,
    "hadith_number": 1126,
    "tajuk_hadith": "Perkahwinan Rasulullah SAW dengan Maimunah RA dalam Keadaan Halal",
    "perawi_melayu": "Diriwayatkan oleh Abu Nu'aim, daripada Hammad bin Zaid, daripada Matar Al-Warraq, daripada Rabi'ah bin Abi Abd Al-Rahman, daripada Sulaiman bin Yasar, daripada Abu Rafi'.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، عَنْ مَطَرٍ الْوَرَّاقِ  ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ  ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ  ، عَنْ أَبِي رَافِعٍ  ، قَالَ :\" تَزَوَّجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَيْمُونَةَ حَلَالًا، وَبَنَى بِهَا حَلَالًا، وَكُنْتُ الرَّسُولَ بَيْنَهُمَا \"",
    "malay_translation": "Abu Rafi' berkata: \"Rasulullah SAW menikahi Maimunah dalam keadaan halal, dan bergaul dengannya dalam keadaan halal, dan aku adalah utusan di antara mereka berdua.\""
  },
  {
    "id": 38664,
    "hadith_number": 1127,
    "tajuk_hadith": "Abu Qatadah Memburu Keldai Liar Semasa Ihram Orang Lain",
    "perawi_melayu": "Yazid bin Harun",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، حَدَّثَنَا هِشَامٌ الدَّسْتَوَائِيُّ  ، عَنْ يَحْيَى  ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ  ، قَالَ : انْطَلَقَ أَبِي   مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْحُدَيْبِيَةِ، فَأَحْرَمَ أَصْحَابُهُ وَلَمْ يُحْرِمْ أَبُو قَتَادَةَ، فَأَصَابَ حِمَارَ وَحْشٍ، فَطَعَنَهُ وَأَكَلَ مِنْ لَحْمِهِ، فَقُلْتُ : يَا رَسُولَ اللَّهِ، إِنِّي أَصَبْتُ حِمَارَ وَحْشٍ، فَطَعَنْتُهُ، فَقَالَ لِلْقَوْمِ :\" كُلُوا \" وَهُمْ مُحْرِمُونَ",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah menceritakan kepada kami Hisyam ad-Dastawa'i, daripada Yahya, daripada Abdullah bin Abi Qatadah, dia berkata: Ayahku pergi bersama Nabi SAW pada tahun Hudaibiyah. Para sahabatnya berihram tetapi Abu Qatadah tidak berihram. Dia kemudiannya mendapatkan seekor keldai liar, lalu dia menikamnya dan memakan dagingnya. Aku berkata: Wahai Rasulullah, sesungguhnya aku telah mendapatkan seekor keldai liar, lalu aku menikamnya. Maka Baginda bersabda kepada kaum: \"Makanlah,\" sedangkan mereka sedang berihram."
  },
  {
    "id": 38665,
    "hadith_number": 1128,
    "tajuk_hadith": "Memakan Daging Keldai Liar Semasa Ihram",
    "perawi_melayu": "Abu Al-Walid",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ  ، عَنْ أَبِيهِ  ، قَالَ : بَيْنَمَا نَحْنُ نَسِيرُ وَهُمْ مُحْرِمُونَ، وَأَبُو قَتَادَةَ حَلَالٌ، إِذْ رَأَيْتُ حِمَارًا، فَرَكِبْتُ فَرَسًا، فَأَصَبْتُهُ، فَأَكَلُوا مِنْ لَحْمِهِ وَهُمْ مُحْرِمُونَ وَلَمْ آكُلْ، فَأَتَوْا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلُوهُ، فَقَالَ :\" أَشَرْتُمْ، قَتَلْتُمْ؟ أَوْ قَالَ : ضَرَبْتُمْ؟ قَالُوا : لَا، قَالَ : فَكُلُوا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Al-Walid, telah menceritakan kepada kami Syu'bah, daripada Uthman bin Abdullah bin Mauhab, daripada Abdullah bin Abi Qatadah, daripada ayahnya, dia berkata: \"Ketika kami sedang berjalan sedangkan mereka dalam keadaan ihram, dan Abu Qatadah tidak berihram, tiba-tiba aku melihat seekor keldai liar. Lalu aku menunggang kuda dan memburunya, lalu aku mendapatkannya. Mereka memakan dagingnya sedangkan mereka dalam keadaan ihram, tetapi aku tidak makan. Kemudian mereka datang kepada Nabi SAW dan bertanya kepada baginda, lalu baginda bersabda: 'Adakah kamu memberi isyarat kepadanya? Adakah kamu membunuhnya?' atau baginda bersabda: 'Adakah kamu memukulnya?' Mereka menjawab: 'Tidak.' Baginda bersabda: 'Makanlah.'"
  },
  {
    "id": 38666,
    "hadith_number": 1129,
    "tajuk_hadith": "Rasulullah SAW Menolak Daging Keldai Liar Ketika Ihram",
    "perawi_melayu": "Diriwayatkan dari Ash-Sha'b bin Jaththamah RA bahwa Nabi SAW diberi daging keldai liar, lalu baginda menolaknya dan bersabda: \"Sesungguhnya kami sedang ihram, kami tidak memakan hasil buruan.\"",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، عَنْ صَالِحِ بْنِ كَيْسَانَ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ  ، عَنْ ابْنِ عَبَّاسٍ  ، عَنْ الصَّعْبِ بْنِ جَثَّامَةَ  ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِلَحْمِ حِمَارِ وَحْشٍ، فَرَدَّهُ وَقَالَ : \" إِنَّاحُرُمٌ لَا نَأْكُلُ الصَّيْدَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Isa, telah menceritakan kepada kami Hammad bin Zaid, dari Salih bin Kaisan, dari Ubaidillah bin Abdullah, dari Ibnu Abbas, dari Ash-Sha'b bin Jaththamah, bahwa Nabi SAW telah diberi daging keldai liar, lalu baginda menolaknya dan bersabda: \"Sesungguhnya kami sedang ihram, kami tidak memakan hasil buruan.\""
  },
  {
    "id": 38667,
    "hadith_number": 1130,
    "tajuk_hadith": "Memakan Buruan Semasa Ihram: Kisah Talhah bin Ubaidillah",
    "perawi_melayu": "Diriwayatkan daripada Mu'az bin Abdurrahman bin Uthman at-Taimi, daripada ayahnya, katanya:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ ابْنِ جُرَيْجٍ  ، عَنْ ابْنِ الْمُنْكَدِرِ  ، عَنْ مُعَاذِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ التَّيْمِيِّ  ، عَنْ أَبِيهِ  ، قَالَ : كُنَّا مَعَ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ  فِي سَفَرٍ، فَأُهْدِيَ لَهُ طَيْرٌ وَهُمْ مُحْرِمُونَ، وَهُوَ رَاقِدٌ، فَمِنَّا مَنْ أَكَلَ، وَمِنَّا مَنْ تَوَرَّعَ، فَاسْتَيْقَظَ طَلْحَةُ فَأَخْبَرُوهُ، فَوَفَّقَ مَنْ أَكَلَهُ، وَقَالَ : \" أَكَلْنَاهُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \"",
    "malay_translation": "Abu Asim memberitahu kami, daripada Ibnu Juraij, daripada Ibnu al-Munkadir, daripada Mu'az bin Abdurrahman bin Uthman at-Taimi, daripada ayahnya, katanya: \"Kami bersama Talhah bin Ubaidillah dalam satu perjalanan. Seekor burung dihadiahkan kepadanya ketika mereka sedang berihram, dan dia sedang tidur. Sebahagian daripada kami memakannya, dan sebahagian lagi menjauhkan diri. Kemudian Talhah bangun dan mereka memberitahunya. Dia membenarkan mereka yang memakannya, dan berkata: 'Kami telah memakannya bersama Rasulullah SAW.'"
  },
  {
    "id": 38668,
    "hadith_number": 1131,
    "tajuk_hadith": "Rasulullah SAW Menolak Hadiah Daging Keldai Liar Kerana Sedang Berihram",
    "perawi_melayu": "Muhammad bin Yusuf",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا ابْنُ عُيَيْنَةَ  ، عَنْ الزُّهْرِيِّ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ : حَدَّثَنِي الصَّعْبُ بْنُ جَثَّامَةَ  ، قَالَ : مَرَّ بِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا بِالْأَبْوَاءِ أَوْ بِوَدَّانَ ، فَأَهْدَيْتُ لَهُ لَحْمَ حِمَارِ وَحْشٍ، فَرَدَّهُ عَلَيَّ، فَلَمَّا رَأَى فِي وَجْهِي الْكَرَاهِيَةَ، قَالَ : \" إِنَّهُلَيْسَ بِنَا رَدٌّ عَلَيْكَ، وَلَكِنَّا حُرُمٌ \"",
    "malay_translation": "Muhammad bin Yusuf mengkhabarkan kepada kami, Ibn Uyainah menceritakan kepada kami, daripada Az-Zuhri, daripada Ubaidillah bin Abdullah, daripada Ibn Abbas, beliau berkata: As-Sa'b bin Jaththamah menceritakan kepadaku, beliau berkata: Rasulullah SAW lalu di hadapanku ketika aku berada di Al-Abwa' atau di Waddan, lalu aku menghadiahkan kepada baginda daging keldai liar, tetapi baginda menolaknya. Ketika baginda melihat tanda tidak senang di wajahku, baginda bersabda: \"Sesungguhnya kami tidak menolak hadiahmu itu, tetapi kami sedang berihram.\""
  },
  {
    "id": 38669,
    "hadith_number": 1132,
    "tajuk_hadith": "Haji untuk Orang Tua yang Tidak Mampu Melaksanakan Ibadah Haji",
    "perawi_melayu": "Muhammad bin Abdullah Ar-Raqashi, Wuhaib, Ma'mar, Az-Zuhri, Sulaiman bin Yasar, Ibnu Abbas, Al-Fadhl bin Abbas",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ  ، حَدَّثَنَا وُهَيْبٌ  ، عَنْ مَعْمَرٍ  ، عَنْ الزُّهْرِيِّ  ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، عَنْ الْفَضْلِ بْنِ عَبَّاسٍ  ، أَنَّهُ كَانَ رَدِيفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ، جَاءَتْ امْرَأَةٌ مِنْ خَثْعَمَ، فَقَالَتْ : إِنَّ فَرِيضَةَ اللَّهِ فِي الْحَجِّ عَلَى عِبَادِهِأَدْرَكَتْ أَبِي شَيْخًا كَبِيرًا لَا يَسْتَمْسِكُ عَلَى رَاحِلَتِهِ، وَلَمْ يَحُجَّ، أَفَأَحُجُّ عَنْهُ، قَالَ : \" نَعَمْ \".\n سُئِلَ أَبُو مُحَمَّد : تَقُولُ بِهَذَا؟ قَالَ : نَعَمْ",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Abdullah Ar-Raqashi, telah menceritakan kepada kami Wuhaib, daripada Ma'mar, daripada Az-Zuhri, daripada Sulaiman bin Yasar, daripada Ibnu Abbas, daripada Al-Fadhl bin Abbas, bahawa beliau pernah membonceng Nabi SAW dalam Haji Wada'. Seorang wanita dari Khath'am datang dan berkata: 'Sesungguhnya kewajipan haji daripada Allah ke atas hamba-hamba-Nya telah sampai kepada ayahku yang sudah tua dan tidak mampu untuk duduk tegak di atas kenderaannya, dan dia belum menunaikan haji. Bolehkah aku menunaikan haji untuknya?' Baginda bersabda: 'Ya.' Abu Muhammad ditanya: 'Adakah anda berpendapat dengan ini?' Beliau menjawab: 'Ya.'"
  },
  {
    "id": 38670,
    "hadith_number": 1133,
    "tajuk_hadith": "Menunaikan Haji Bagi Pihak Orang Tua yang Uzur",
    "perawi_melayu": "Diriwayatkan daripada Fadl bin Abbas RA bahawa seorang wanita bertanya kepada Nabi SAW mengenai ayahnya yang sudah tua dan tidak mampu lagi menunggang unta, tetapi wajib menunaikan fardhu haji. Rasulullah SAW bersabda: \"Hajikanlah untuknya.\"",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ ابْنِ جُرَيْجٍ  ، عَنْ ابْنِ شِهَابٍ  ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، عَنْ الْفَضْلِ هُوَ ابْنُ عَبَّاسٍ  ، أَنَّ امْرَأَةً سَأَلَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَتْ : إِنَّأَبِي شَيْخٌ لَا يَسْتَوِي عَلَى الْبَعِيرِ أَدْرَكَتْهُ فَرِيضَةُ اللَّهِ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" حُجِّي عَنْهُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu 'Asim, daripada Ibn Juraij, daripada Ibn Syihab, daripada Sulaiman bin Yasar, daripada Ibn 'Abbas, daripada al-Fadl, iaitu Ibn 'Abbas, bahawa seorang wanita bertanya kepada Nabi SAW, lalu dia berkata: Sesungguhnya ayahku seorang yang tua yang tidak mampu duduk di atas unta, telah sampai kepadanya kewajipan daripada Allah. Rasulullah SAW bersabda: \"Hajikanlah untuknya.\""
  },
  {
    "id": 38671,
    "hadith_number": 1134,
    "tajuk_hadith": "Menunaikan Haji Bagi Pihak Orang Tua yang Tidak Mampu",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا الْأَوْزَاعِيُّ  ، حَدَّثَنِي الزُّهْرِيُّ  ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، أَنَّ امْرَأَةً مِنْ خَثْعَمَ اسْتَفْتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ، وَالْفَضْلُ بْنُ عَبَّاسٍ رَدِيفُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَتْ : يَا رَسُولَ اللَّهِ، إِنَّ فَرِيضَةَ اللَّهِ عَلَى عِبَادِهِ أَدْرَكَتْ أَبِي شَيْخًا كَبِيرًا، لَا يَسْتَطِيعُ أَنْ يَسْتَوِيَ عَلَى الرَّاحِلَةِ،فَهَلْ يَقْضِي أَنْ أَحُجَّ عَنْهُ؟ قَالَ : \" نَعَمْ \".\nحَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا ابْنُ عُيَيْنَةَ  ، عَنْ الزُّهْرِيِّ  ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، نَحْوًا مِنْ حَدِيثِ الْأَوْزَاعِيِّ",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Yusuf, telah menceritakan kepada kami al-Auza'i, telah menceritakan kepadaku az-Zuhri, daripada Sulaiman bin Yasar, daripada Ibn Abbas, bahawa seorang wanita daripada Khath'am meminta fatwa kepada Rasulullah SAW pada Haji Wada', dan al-Fadl bin Abbas membonceng Rasulullah SAW, lalu dia berkata: 'Wahai Rasulullah, sesungguhnya kewajipan Allah ke atas hamba-hamba-Nya telah sampai kepada ayahku yang sudah tua renta, dia tidak mampu untuk duduk tegak di atas kenderaan, maka adakah boleh aku menunaikan haji baginya?' Baginda bersabda: 'Ya, boleh.'\nTelah menceritakan kepada kami Muhammad bin Yusuf, telah menceritakan kepada kami Ibn Uyainah, daripada az-Zuhri, daripada Sulaiman bin Yasar, daripada Ibn Abbas, daripada Nabi SAW, seperti hadis al-Auza'i."
  },
  {
    "id": 38672,
    "hadith_number": 1135,
    "tajuk_hadith": "Menunaikan Haji Bagi Ibu Bapa yang Uzur atau Tua",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ  ، أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ  ، عَنْ يَحْيَى بْنِ أَبِي إِسْحَاق  ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ  ، حَدَّثَنِي الْفَضْلُ بْنُ عَبَّاسٍ  أَوْ عُبَيْدُ اللَّهِ بْنُ الْعَبَّاسِ  ، أَنَّ رَجُلًا قَالَ : يَا رَسُولَ اللَّهِ، إِنَّ أَبِي أَوْ أُمِّي عَجُوزٌ كَبِيرٌ، إِنْ أَنَا حَمَلْتُهَا لَمْ تَسْتَمْسِكْ، وَإِنْ رَبَطْتُهَا، خَشِيتُ أَنْ أَقْتُلَهَا.\nقَالَ : \" أَرَأَيْتَ إِنْ كَانَ عَلَى أَبِيكَ أَوْ أُمِّكَ دَيْنٌ، أَكُنْتَ تَقْضِيهِ؟ \".\n قَالَ : نَعَمْ، قَالَ :\" فَحُجَّ عَنْ أَبِيكَ، أَوْ أُمِّكَ \"",
    "malay_translation": "Telah menceritakan kepada kami Musaddad, telah mengkhabarkan kepada kami Hammad bin Zaid, daripada Yahya bin Abi Ishaq, daripada Sulaiman bin Yasar, telah menceritakan kepadaku Al-Fadl bin Abbas atau Ubaidullah bin Abbas, bahawa seorang lelaki berkata: Wahai Rasulullah, sesungguhnya ayahku atau ibuku sudah tua dan sangat uzur. Jika aku membawanya, dia tidak dapat berpegang dengan baik, dan jika aku mengikatnya, aku khuatir akan membunuhnya.\nBaginda bersabda: \"Bagaimana pendapatmu jika ayah atau ibumu mempunyai hutang, adakah kamu akan membayarnya?\"\nDia berkata: Ya. Baginda bersabda: \"Maka tunaikanlah haji bagi ayahmu atau ibumu.\""
  },
  {
    "id": 38673,
    "hadith_number": 1136,
    "tajuk_hadith": "Menunaikan Haji Bagi Pihak Bapa yang Sudah Tua dan Tidak Mampu",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ  ، حَدَّثَنَا جَرِيرٌ  ، عَنْ مَنْصُورٍ  ، عَنْ مُجَاهِدٍ  ، عَنْ يُوسُفَ بْنِ الزُّبَيْرِ  مَوْلًى لِآلِ الْزُّبَيْرِ، عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ  ، قَالَ : جَاءَ رَجُلٌ مِنْ خَثْعَمَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ : إِنَّأَبِي أَدْرَكَهُ الْإِسْلَامُ وَهُوَ شَيْخٌ كَبِيرٌ لَا يَسْتَطِيعُ رُكُوبَ الرَّحْلِ، وَالْحَجُّ مَكْتُوبٌ عَلَيْهِ، أَفَأَحُجُّ عَنْهُ؟ قَالَ : \" أَنْتَ أَكْبَرُ وَلَدِهِ؟ \".\nقَالَ : نَعَمْ.\nقَالَ : \" أَرَأَيْتَ لَوْ كَانَ عَلَى أَبِيكَ دَيْنٌ فَقَضَيْتَهُ عَنْهُ، أَكَانَ ذَلِكَ يُجْزِئُ عَنْهُ؟ \".\nقَالَ : نَعَمْ.\nقَالَ : \" فَاحْجُجْ عَنْهُ \"",
    "malay_translation": "Muhammad bin Humaid meriwayatkan kepada kami, Jarir meriwayatkan kepada kami, daripada Mansur, daripada Mujahid, daripada Yusuf bin Zubair, hamba kepada keluarga Zubair, daripada Abdullah bin Zubair, katanya: Seorang lelaki dari Khath'am datang kepada Rasulullah SAW dan berkata: Sesungguhnya bapaku telah menemui Islam sedangkan dia seorang yang tua dan tidak mampu menunggang kenderaan, dan haji diwajibkan ke atasnya, bolehkah aku menunaikan haji untuknya? Baginda bersabda: 'Adakah kamu anak sulungnya?' Dia berkata: Ya. Baginda bersabda: 'Bagaimana pendapatmu jika bapamu mempunyai hutang lalu kamu membayarnya untuknya, adakah itu mencukupi untuknya?' Dia berkata: Ya. Baginda bersabda: 'Maka tunaikanlah haji untuknya.'"
  },
  {
    "id": 38674,
    "hadith_number": 1137,
    "tajuk_hadith": "Menunaikan Haji Bagi Pihak Orang Tua yang Tidak Mampu",
    "perawi_melayu": "Soleh bin Abdullah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا صَالِحُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا عَبْدُ الْعَزِيزِ هُوَ ابْنُ عَبْدِ الصَّمَدِ  ، عَنْ مَنْصُورٍ  ، عَنْ مُجَاهِدٍ  ، عَنْ مَوْلَى ابْنِ الزُّبَيْرِ، يُقَالُ لَهُ : يُوسُفُ بْنُ الزُّبَيْرِ أَوْ الزُّبَيْرُ بْنُ يُوسُفَ  ، عَنْ سَوْدَةَ بِنْتِ زَمْعَةَ  ، قَالَتْ : جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ : إِنَّ أَبِي شَيْخٌ كَبِيرٌ لَا يَسْتَطِيعُ أَنْ يَحُجَّ.\nقَالَ : \" أَرَأَيْتَ لَوْ كَانَ عَلَى أَبِيكَ دَيْنٌ فَقَضَيْتَهُ عَنْهُ، قُبِلَ مِنْهُ؟ \".\nقَالَ : نَعَمْ.\nقَالَ : \" اللَّهُ أَرْحَمُ،حُجَّ عَنْ أَبِيكَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Soleh bin Abdullah, telah menceritakan kepada kami Abdul Aziz iaitu Ibnu Abdul Somad, daripada Mansur, daripada Mujahid, daripada maula Ibnu Zubair, dikatakan kepadanya: Yusuf bin Zubair atau Zubair bin Yusuf, daripada Saudah binti Zam'ah, dia berkata: Seorang lelaki datang kepada Nabi SAW, lalu berkata: Sesungguhnya ayahku seorang yang tua dan tidak mampu untuk menunaikan haji.\nBaginda bersabda: 'Bagaimana pendapatmu jika ayahmu mempunyai hutang lalu engkau membayarnya, adakah diterima daripadanya?'\nDia menjawab: Ya.\nBaginda bersabda: 'Allah lebih bersifat Ar-Rahman (Maha Penyayang), tunaikanlah haji bagi pihak ayahmu.'"
  },
  {
    "id": 38675,
    "hadith_number": 1138,
    "tajuk_hadith": "Keutamaan Mengusap Dua Rukun (Hajar Aswad dan Rukun Yamani)",
    "perawi_melayu": "Diriwayatkan dari Nafi', dari Ibnu Umar",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ  ، حَدَّثَنَا يَحْيَى  ، عَنْ عُبَيْدِ اللَّهِ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ  ، قَالَ :\" مَا تَرَكْتُ اسْتِلَامَ هَذَيْنِ الرُّكْنَيْنِ فِي شِدَّةٍ وَلَا رَخَاءٍ مُنْذُ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَلِمُهُمَا \".\nقُلْتُ لِنَافِعٍ : أَكَانَ ابْنُ عُمَرَ يَمْشِي بَيْنَ الرُّكْنَيْنِ ؟ قَالَ : إِنَّمَا كَانَ يَمْشِي لِيَكُونَ أَيْسَرَ لِاسْتِلَامِهِ",
    "malay_translation": "Telah menceritakan kepada kami Musaddad, telah menceritakan kepada kami Yahya, dari Ubaidillah, dari Nafi', dari Ibnu Umar, dia berkata: \"Aku tidak pernah meninggalkan mengusap kedua rukun ini (Hajar Aswad dan Rukun Yamani) baik dalam keadaan susah mahupun senang sejak aku melihat Rasulullah SAW mengusap keduanya.\" Aku bertanya kepada Nafi': \"Adakah Ibnu Umar berjalan di antara kedua rukun tersebut?\" Dia menjawab: \"Sesungguhnya dia berjalan agar lebih mudah untuk mengusapnya.\""
  },
  {
    "id": 38676,
    "hadith_number": 1139,
    "tajuk_hadith": "Batu Hajar Aswad Bersaksi pada Hari Kiamat",
    "perawi_melayu": "Diriwayatkan oleh Hajjaj bin Minhal dan Sulaiman bin Harb, daripada Hammad bin Salamah, daripada Abdullah bin Uthman bin Khuthaym, daripada Sa'id bin Jubair, daripada Ibnu Abbas",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ  ، وَسُلَيْمَانُ بْنُ حَرْبٍ  ، قَالَا : حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ بْنِ خُثَيْمٍ  ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" لَيَبْعَثَنَّ اللَّهُ الْحَجَرَ يَوْمَ الْقِيَامَةِ لَهُ عَيْنَانِ يُبْصِرُ بِهِمَا، وَلِسَانٌ يَنْطِقُ بِهِ، يَشْهَدُ عَلَى مَنْ اسْتَلَمَهُ بِحَقٍّ \".\nقَالَ سُلَيْمَانُ : لِمَنْ اسْتَلَمَهُ",
    "malay_translation": "Daripada Ibnu Abbas RA, bahawa Rasulullah SAW bersabda: “Sesungguhnya Allah akan membangkitkan Hajar Aswad pada hari kiamat. Ia mempunyai dua mata yang dengannya ia dapat melihat, dan lidah yang dengannya ia dapat berbicara, ia akan bersaksi bagi sesiapa yang menyentuhnya dengan hak.” Sulaiman berkata: “Bagi sesiapa yang menyentuhnya.”"
  },
  {
    "id": 38677,
    "hadith_number": 1140,
    "tajuk_hadith": "Rasulullah SAW Bertawaf dengan Berjalan Cepat di Antara Hajar Aswad",
    "perawi_melayu": "Ahmad bin Abdullah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ  ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ  ، عَنْ أَبِيهِ  ، عَنْ جَابِرٍ  ، قَالَ :\" رَمَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْحَجَرِ إِلَى الْحَجَرِ ثَلَاثَةَ أَشْوَاطٍ \"",
    "malay_translation": "Ahmad bin Abdullah mengkhabarkan kepada kami, Malik bin Anas menceritakan kepada kami, daripada Ja'far bin Muhammad, daripada ayahnya, daripada Jabir, dia berkata: \"Rasulullah SAW bertawaf dengan berjalan cepat (ramal) dari Hajar Aswad ke Hajar Aswad sebanyak tiga pusingan.\""
  },
  {
    "id": 38678,
    "hadith_number": 1141,
    "tajuk_hadith": "Cara Rasulullah SAW Tawaf dan Sa'i",
    "perawi_melayu": "Diriwayatkan daripada Abdullah bin Umar RA",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ  ، حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ  ، حَدَّثَنَا عُبَيْدُ اللَّهِ  ، حَدَّثَنِي نَافِعٌ  ، عَنْ ابْنِ عُمَرَ  ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ\" إِذَا طَافَ بِالْبَيْتِ الطَّوَافَ الْأَوَّلَ، خَبَّ ثَلَاثَةً، وَمَشَى أَرْبَعَةً، وَكَانَ يَسْعَى بِبَطْنِ الْمَسِيلِ إِذَا سَعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ \".\nفَقُلْتُ لِنَافِعٍ : أَكَانَ عَبْدُ اللَّهِ يَمْشِي إِذَا بَلَغَ الرُّكْنَ الْيَمَانِيَ ؟ قَالَ : لَا، إِلَّا أَنْ يُزَاحَمَ عَلَى الرُّكْنِ ، فَإِنَّهُ كَانَ لَا يَدَعُهُ حَتَّى يَسْتَلِمَهُ",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Sa'id, telah menceritakan kepada kami Uqbah bin Khalid, telah menceritakan kepada kami Ubaidullah, telah menceritakan kepadaku Nafi', daripada Ibn Umar RA, bahawa Rasulullah SAW, \"Apabila melakukan tawaf di Baitullah pada tawaf pertama, Baginda berlari-lari anak (raml) sebanyak tiga pusingan dan berjalan biasa sebanyak empat pusingan. Dan Baginda SAW berusahasa (sa'i) di tengah-tengah *Mas'a* (tempat sa'i) apabila melakukan sa'i antara Safa dan Marwah.\"\n\nAku bertanya kepada Nafi': \"Adakah Abdullah (bin Umar) berjalan apabila sampai di Rukun Yamani?\" Dia menjawab: \"Tidak, kecuali jika berasak-asak untuk mencapai Rukun tersebut. Sesungguhnya beliau (Abdullah bin Umar) tidak pernah meninggalkannya sehingga dapat mengusapnya (Rukun Yamani).\""
  },
  {
    "id": 38679,
    "hadith_number": 1142,
    "tajuk_hadith": "Rasulullah SAW Bertawaf dengan Berjalan Cepat (Ramal) Tiga Pusingan",
    "perawi_melayu": "Abdullah bin Umar bin Aban",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ بْنِ أَبَانَ  ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ  ، أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ  ، قَالَ :\" رَمَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْحَجَرِ إِلَى الْحَجَرِ ثَلَاثًا، وَمَشَى أَرْبَعًا \"",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Umar bin Aban, telah menceritakan kepada kami Abdullah bin Al-Mubarak, telah mengkhabarkan kepada kami Ubaidullah bin Umar, daripada Nafi', daripada Ibnu Umar, beliau berkata: \"Rasulullah SAW bertawaf dengan berjalan cepat (ramal) dari Hajar Aswad ke Hajar Aswad sebanyak tiga pusingan, dan berjalan biasa sebanyak empat pusingan.\""
  },
  {
    "id": 38680,
    "hadith_number": 1143,
    "tajuk_hadith": "Tawaf dengan Idhtiba' (Meletakkan Kain di Bawah Ketiak)",
    "perawi_melayu": "Muhammad bin Yusuf, Sufyan, daripada Ibnu Juraij, daripada Abdul Hamid iaitu Ibnu Jubair, daripada Ibnu Ya'la, daripada ayahnya, daripada Nabi SAW.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ ابْنِ جُرَيْجٍ  ، عَنْ عَبْدِ الْحَمِيدِ هُوَ ابْنُ جُبَيْرٍ  ، عَنْ ابْنِ يَعْلَى  ، عَنْ أَبِيهِ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، \" أَنَّهُطَافَ مُضْطَبِعًا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Yusuf, telah menceritakan kepada kami Sufyan, daripada Ibnu Juraij, daripada Abdul Hamid iaitu Ibnu Jubair, daripada Ibnu Ya'la, daripada ayahnya, daripada Nabi SAW, \"Bahawasanya Baginda SAW melakukan tawaf dengan idhtiba'.\""
  },
  {
    "id": 38681,
    "hadith_number": 1144,
    "tajuk_hadith": "Memadai dengan Satu Tawaf untuk Haji dan Umrah",
    "perawi_melayu": "Diriwayatkan dari Ibn Umar RA bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ مَنْصُورٍ  ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :\" مَنْ أَهَلَّ بِالْحَجِّ وَالْعُمْرَةِ، كَفَاهُ لَهُمَا طَوَافٌ وَاحِدٌ، وَلَا يَحِلُّ حَتَّى يَحِلَّ مِنْهُمَا \"",
    "malay_translation": "Sesiapa yang berniat ihram untuk haji dan umrah, memadai baginya satu tawaf untuk kedua-duanya, dan dia tidak halal sehingga dia telah bertahallul daripada kedua-duanya."
  },
  {
    "id": 38682,
    "hadith_number": 1145,
    "tajuk_hadith": "Rasulullah SAW Tawaf di Baitullah di Atas Unta dan Bertakbir",
    "perawi_melayu": "Diriwayatkan daripada Ibnu Abbas RA bahawa Rasulullah SAW tawaf di Baitullah di atas unta. Setiap kali baginda sampai di Rukun (Hajar Aswad), baginda memberi isyarat kepadanya dengan sesuatu yang ada di tangannya dan bertakbir.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ  ، عَنْ خَالِدِ بْنِ عَبْدِ اللَّهِ  ، عَنْ خَالِدٍ الْحَذَّاءِ  ، عَنْ عِكْرِمَةَ  ، عَنْ ابْنِ عَبَّاسٍ  ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" طَافَ بِالْبَيْتِ عَلَى بَعِيرٍ، كُلَّمَا أَتَى عَلَى الرُّكْنِ ، أَشَارَ إِلَيْهِ بِشَيْءٍ فِي يَدِهِ، وَكَبَّرَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami 'Amru bin 'Aun, daripada Khalid bin 'Abdillah, daripada Khalid al-Hazza', daripada 'Ikrimah, daripada Ibnu 'Abbas RA, bahawa Rasulullah SAW tawaf di Baitullah di atas seekor unta. Setiap kali baginda sampai di Rukun (Hajar Aswad), baginda memberi isyarat kepadanya dengan sesuatu yang ada di tangannya dan bertakbir."
  },
  {
    "id": 38683,
    "hadith_number": 1146,
    "tajuk_hadith": "Larangan Tawaf di Baitullah Ketika Haid",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ  ، عَنْ أَبِيهِ  ، عَنْ عَائِشَةَ   رَضِيَ اللَّهُ عَنْهَا، قَالَتْ : قَدِمْتُ مَكَّةَ وَأَنَا حَائِضٌ، وَلَمْ أَطُفْ بَيْنَ الصَّفَا وَالْمَرْوَةِ ، فَشَكَوْتُ ذَلِكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ :\" افْعَلِي مَا يَفْعَلُ الْحَاجُّ، غَيْرَ أَنْ لَا تَطُوفِي بِالْبَيْتِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Khalid bin Makhlad, telah menceritakan kepada kami Malik, daripada Abdurrahman bin al-Qasim, daripada ayahnya, daripada Aisyah RA, beliau berkata: Aku tiba di Mekah dalam keadaan haid, dan aku tidak melakukan tawaf di antara Safa dan Marwah. Lalu aku mengadukan hal itu kepada Rasulullah SAW, maka Baginda bersabda: \"Lakukanlah apa yang dilakukan oleh orang yang berhaji, kecuali jangan melakukan tawaf di Baitullah.\""
  },
  {
    "id": 38684,
    "hadith_number": 1147,
    "tajuk_hadith": "Tawaf di Baitullah adalah Seperti Solat",
    "perawi_melayu": "Diriwayatkan daripada Ibnu Abbas RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحُمَيْدِيُّ  ، حَدَّثَنَا الْفُضَيْلُ بْنُ عِيَاضٍ  ، عَنْ عَطَاءِ بْنِ السَّائِبِ  ، عَنْ طَاوُسٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" الطَّوَافُ بِالْبَيْتِ صَلَاةٌ، إِلَّا أَنَّ اللَّهَ أَحَلَّ فِيهِ الْمَنْطِقَ، فَمَنْ نَطَقَ فِيهِ، فَلَا يَنْطِقْ إِلَّا بِخَيْرٍ \".\n أَخْبَرَنَا عَلِيُّ بْنُ مَعْبَدٍ  ، عَنْ مُوسَى بْنِ أَعْيَنَ  ، عَنْ عَطَاءِ بْنِ السَّائِبِ  ، عَنْ طَاوُسٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، نَحْوَهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Humaidi, telah menceritakan kepada kami al-Fudail bin Iyad, daripada 'Ata' bin as-Sa'ib, daripada Tawus, daripada Ibnu Abbas RA, beliau berkata: Rasulullah SAW bersabda: \"Tawaf di Baitullah adalah seperti solat, kecuali Allah telah menghalalkan percakapan di dalamnya. Maka barangsiapa yang berbicara di dalamnya, janganlah dia berbicara kecuali dengan perkataan yang baik.\" Telah mengkhabarkan kepada kami Ali bin Ma'bad, daripada Musa bin A'yan, daripada 'Ata' bin as-Sa'ib, daripada Tawus, daripada Ibnu Abbas RA, daripada Nabi SAW, dengan seumpamanya."
  },
  {
    "id": 38685,
    "hadith_number": 1148,
    "tajuk_hadith": "Persetujuan Umar bin al-Khattab dengan Wahyu dalam Tiga Perkara",
    "perawi_melayu": "Diriwayatkan daripada Anas RA, bahawa Umar bin al-Khattab RA berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، حَدَّثَنَا حُمَيْدٌ  ، عَنْ أَنَسٍ  ، قَالَ : قَالَ عُمَرُ بْنُ الْخَطَّابِ   رِضْوَانُ اللَّهِ عَلَيْهِ : وَافَقْتُ رَبِّي فِي ثَلَاثٍ، قُلْتُ : يَا رَسُولَ اللَّهِ،\" لَوْ اتَّخَذْتَ مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى، فَأَنْزَلَ اللَّهُ تَعَالَى : # وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى سورة البقرة آية 125 # \"",
    "malay_translation": "Yazid bin Harun telah mengkhabarkan kepada kami, Humaid telah menceritakan kepada kami, daripada Anas RA, beliau berkata: Umar bin al-Khattab RA berkata: \"Aku bersetuju dengan Tuhanku dalam tiga perkara. Aku berkata: Wahai Rasulullah, alangkah baiknya jika engkau menjadikan Maqam Ibrahim sebagai tempat solat. Lalu Allah Taala menurunkan firman-Nya: '#Dan jadikanlah sebahagian Maqam Ibrahim sebagai tempat solat.' [Surah al-Baqarah, ayat 125]."
  },
  {
    "id": 38686,
    "hadith_number": 1149,
    "tajuk_hadith": "Haji Nabi SAW: Huraian Terperinci daripada Jabir bin Abdullah RA",
    "perawi_melayu": "Jabir bin Abdullah RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْمَاعِيل بْنُ أَبَانَ  ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيل بْنُ أَبَانَ  ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ  ، عَنْ أَبِيهِ  ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ   رَضِيَ اللهِ عَنْهُمَا، قَالَ أَبُو جَعْفَرٍ : دَخَلْنَا عَلَى جَابِرِ بْنِ عَبْدِ اللَّهِ، فَسَأَلَ عَنْ الْقَوْمِ حَتَّى انْتَهَى إِلَيَّ، فَقُلْتُ أَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ الْحُسَيْنِ بْنِ عَلِيٍّ، فَأَهْوَى بِيَدِهِ إِلَى زِرِّيَ الْأَعْلَى وَزِرِّيَ الْأَسْفَلِ، ثُمَّ وَضَعَ فَمَهُ بَيْنَ ثَدْيَيَّ، وَأَنَا يَوْمَئِذٍ غُلَامٌ شَابٌّ، فَقَالَ : مَرْحَبًا بِكَ يَا ابْنَ أَخِي، سَلْ عَمَّا شِئْتَ.\nفَسَأَلْتُهُ، وَهُوَ أَعْمَى، وَجَاءَ وَقْتُ الصَّلَاةِ، فَقَامَ فِي سَاجَةٍ مُلْتَحِفًا بِهَا، كُلَّمَا وَضَعَهَا عَلَى مَنْكِبَيْهِ، رَجَعَ طَرَفُهَا إِلَيْهِ مِنْ صِغَرِهَا، وَرِدَاؤُهُ إِلَى جَنْبِهِ عَلَى الْمِشْجَبِ، فَصَلَّى، فَقُلْتُ : أَخْبِرْنِي عَنْ حَجَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ فَقَالَ بِيَدِهِ فَعَقَدَ تِسْعًا، فَقَالَ :مَكَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تِسْعَ سِنِينَ لَمْ يَحُجَّ، ثُمَّ أُذِّنَ فِي النَّاسِ بِالْحَجِّ فِي الْعَاشِرَةِ : أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَاجٌّ، فَقَدِمَ الْمَدِينَةَ بَشَرٌ كَثِيرٌ كُلُّهُمْ يَلْتَمِسُ أَنْ يَأْتَمَّ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَيَعْمَلَ مِثْلَ عَمَلِهِ، فَخَرَجْنَا مَعَهُ حَتَّى أَتَيْنَا ذَا الْحُلَيْفَةِ ، فَوَلَدَتْ أَسْمَاءُ بِنْتُ عُمَيْسٍ مُحَمَّدَ بْنَ أَبِي بَكْرٍ رَضِيَ اللهِ عَنْهُمْ، فَأَرْسَلَتْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : كَيْفَ أَصْنَعُ؟ فَقَالَ : \" اغْتَسِلِي وَاسْتَثْفِرِي بِثَوْبٍ وَأَحْرِمِي \".\nفَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ، ثُمَّ رَكِبَ الْقَصْوَاءَ حَتَّى اسْتَوَتْ بِهِ نَاقَتُهُ عَلَى الْبَيْدَاءِ، فَنَظَرْتُ إِلَى مَدِّ بَصَرِي مِنْ بَيْنِ يَدَيْهِ مِنْ رَاكِبٍ وَمَاشٍ، وَعَنْ يَمِينِهِ مِثْلُ ذَلِكَ، وَعَنْ يَسَارِهِ مِثْلُ ذَلِكَ، وَخَلْفَهُ مِثْلُ ذَلِكَ، وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ أَظْهُرِنَا، وَعَلَيْهِ يُنْزَلُ الْقُرْآنُ وَهُوَ يَعْرِفُ تَأْوِيلَهُ، فَأَهَلَّ بِالتَّوْحِيدِ : \" لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ، لَا شَرِيكَ لَكَ \".\nفَأَهَلَّ النَّاسُ بِهَذَا الَّذِي يُهِلُّونَ بِهِ، فَلَمْ يَرُدَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْهِمْ شَيْئًا، وَلَبَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَلْبِيَتَهُ حَتَّى إِذَا أَتَيْنَا الْبَيْتَ مَعَهُ.\nقَالَ جَابِرٌ : لَسْنَا نَنْوِي إِلَّا الْحَجَّ، لَسْنَا نَعْرِفُ الْعُمْرَةَ، حَتَّى إِذَا أَتَيْنَا الْبَيْتَ مَعَهُ، اسْتَلَمَ الرُّكْنَ فَرَمَلَ ثَلَاثًا، وَمَشَى أَرْبَعًا، ثُمَّ تَقَدَّمَ إِلَى مَقَامِ إِبْرَاهِيمَ فَصَلَّى، فَقَرَأَ # وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى سورة البقرة آية 125 #، فَجَعَلَ الْمَقَامَ بَيْنَهُ وَبَيْنَ الْبَيْتِ ، وَكَانَ أَبِي يَقُولُ : وَلَا أَعْلَمُهُ ذَكَرَهُ عَنْ جَابِرٍ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : كَانَ يَقْرَأُ فِي الرَّكْعَتَيْنِ : قُلْ هُوَ اللَّهُ أَحَدٌ وَقُلْ يَا أَيُّهَا الْكَافِرُونَ، ثُمَّ رَجَعَ إِلَى الرُّكْنِ فَاسْتَلَمَهُ، ثُمَّ خَرَجَ مِنْ الْبَاب إِلَى الصَّفَا ، فَلَمَّا أَتَى الصَّفَا ، قَرَأَ : # إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ سورة البقرة آية 158 #، \" أَبْدَأُ بِمَا بَدَأَ اللَّهُ بِهِ \".\nفَبَدَأَ بِالصَّفَا فَرَقِيَ عَلَيْهِ حَتَّى رَأَى الْبَيْتَ ، فَوَحَّدَ اللَّهَ وَكَبَّرَهُ، وَقَالَ : \" لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ، لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، يُحْيِي وَيُمِيتُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ، أَنْجَزَ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزَابَ وَحْدَهُ \".\nثُمَّ دَعَا بَيْنَ ذَلِكَ، فَقَالَ مِثْلَ هَذَا ثَلَاثَ مَرَّاتٍ، ثُمَّ نَزَلَ إِلَى الْمَرْوَةِ ، حَتَّى إِذَا انْصَبَّتْ قَدَمَاهُ فِي بَطْنِ الْوَادِي، قَالَ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ : يَعْنِي : فَرَمَلَ ، حَتَّى إِذَا صَعِدْنَا مَشَى، حَتَّى إِذَا أَتَيْنَا الْمَرْوَةَ ، فَفَعَلَ عَلَى الْمَرْوَةِ كَمَا فَعَلَ عَلَى الصَّفَا ، حَتَّى إِذَا كَانَ آخِرَ طَوَافٍ عَلَى الْمَرْوَةِ ، قَالَ : \" إِنِّي لَوْ اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ، لَمْ أَسُقْ الْهَدْيَ وَجَعَلْتُهَا عُمْرَةً، فَمَنْ كَانَ مِنْكُمْ لَيْسَ مَعَهُ هَدْيٌ، فَلْيُحِلَّ وَيَجْعَلْهَا عُمْرَةً \".\nفَقَامَ سُرَاقَةُ بْنُ مَالِكِ بْنِ جُعْشُمٍ، فَقَالَ : يَا رَسُولَ اللَّهِ، أَلِعَامِنَا هَذَا أَمْ لِأَبَدِ؟ فَشَبَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصَابِعَهُ فِي الْأُخْرَى، فَقَالَ : \" دَخَلَتِ الْعُمْرَةُ فِي الْحَجِّ \"، هَكَذَا مَرَّتَيْنِ \" لَا، بَلْ لِأَبَدِ أَبَدًا، لَا بَلْ لَأَبَدِ أَبَدٍ \".\nوَقَدِمَ عَلِيٌّ بِبُدْنٍ مِنْ الْيَمَنِ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَوَجَدَ فَاطِمَةَ رِضْوَانُ اللَّهِ عَلَيْهَا مِمَّنْ حَلَّ، وَلَبِسَتْ ثِيَابًا صَبِيغًا، وَاكْتَحَلَتْ، فَأَنْكَرَ عَلِيٌّ ذَلِكَ عَلَيْهَا، فَقَالَتْ : إِنَّ أَبِي أَمَرَنِي، فَكَانَ عَلِيٌّ يَقُولُ : ذَهَبْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُحَرِّشُهُ عَلَى فَاطِمَةَ فِي الَّذِي صَنَعَتْ، مُسْتَفْتِيًا لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيمَا ذَكَرَتْ، فَأَنْكَرْتُ ذَلِكَ عَلَيْهَا، فَقَالَ : \" صَدَقَتْ، مَا فَعَلْتَ حِينَ فَرَضْتَ الْحَجَّ؟ \".\nقَالَ : قُلْتُ : اللَّهُمَّ إِنِّي أُهِلُّ بِمَا أَهَلَّ بِهِ رَسُولُكَ.\nقَالَ : \" فَإِنَّ مَعِيَ الْهَدْيَ فَلَا تَحِلَّ \".\nقَالَ : فَكَانَ جَمَاعَةُ الْهَدْيِ الَّذِي قَدِمَ بِهِ عَلِيٌّ مِنْ الْيَمَنِ ، وَالَّذِي أَتَى بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِئَةَ بَدَنَةٍ، فَحَلَّ النَّاسُ كُلُّهُمْ وَقَصَّرُوا إِلَّا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَنْ كَانَ مَعَهُ هَدْيٌ، فَلَمَّا كَانَ يَوْمُ التَّرْوِيَةِ، وَجَّهَ إِلَى مِنًى ، فَأَهْلَلْنَا بِالْحَجِّ، وَرَكِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى بِمِنًى الظُّهْرَ، وَالْعَصْرَ، وَالْمَغْرِبَ، وَالْعِشَاءَ، وَالصُّبْحَ، ثُمَّ مَكَثَ قَلِيلًا حَتَّى إِذَا طَلَعَتْ الشَّمْسُ، أَمَرَ بِقُبَّةٍ مِنْ الشَّعْرِ فَضُربَتْ لَهُ بِنَمِرَةَ، ثُمَّ رَكِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَارَ لَا تَشُكُّ قُرَيْشٌ إِلَّا أَنَّهُ وَاقِفٌ عِنْدَ الْمَشْعَرِ الْحَرَامِ ، كَمَا كَانَتْ قُرَيْشٌ تَصْنَعُ فِي الْجَاهِلِيَّةِ فِي الْمُزْدَلِفَةِ ، فَسَارَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى أَتَى عَرَفَةَ ، فَوَجَدَ الْقُبَّةَ قَدْ ضُرِبَتْ بِنَمِرَةَ، فَنَزَلَهَا حَتَّى إِذَا زَاغَتِ يَعْنِي الشَّمْسَ، أَمَرَ بِالْقَصْوَاءِ فَرُحِّلَتْ لَهُ، فَأَتَى بَطْنَ الْوَادِي، فَخَطَبَ النَّاسَ وَقَالَ : \" إِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ حَرَامٌ كَحُرْمَةِ يَوْمِكُمْ هَذَا، فِي شَهْرِكُمْ هَذَا، فِي بَلَدِكُمْ هَذَا، أَلَا إِنَّ كُلَّ شَيْءٍ مِنْ أَمْرِ الْجَاهِلِيَّةِ تَحْتَ قَدَمَيَّ مَوْضُوعٌ، وَدِمَاءُ الْجَاهِلِيَّةِ مَوْضُوعَةٌ وَأَوَّلُ دَمٍ أَضَعُ دِمَاءَنَا : دَمُ ابْنِ رَبِيعَةَ بْنِ الْحَارِثِ، كَانَ مُسْتَرْضَعًا فِي بَنِي سَعْدٍ، فَقَتَلَتْهُ هُذَيْلٌ.\nوَرِبَا الْجَاهِلِيَّةِ مَوْضُوعٌ، وَأَوَّلُ رِبًا أَضَعُهُ رِبَا عَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ، فَإِنَّهُ مَوْضُوعٌ كُلُّهُ، فَاتَّقُوا اللَّهَ فِي النِّسَاءِ، فَإِنَّمَا أَخَذْتُمُوهُنَّ بِأَمَانَةِ اللَّهِ، وَاسْتَحْلَلْتُمْ فُرُوجَهُنَّ بِكَلِمَةِ اللَّهِ، وَإِنَّ لَكُمْ عَلَيْهِنَّ أَنْ لَا يُوطِئْنَ فُرُشَكُمْ أَحَدًا تَكْرَهُونَهُ، فَإِنْ فَعَلْنَ ذَلِكَ، فَاضْرِبُوهُنَّ ضَرْبًا غَيْرَ مُبَرِّحٍ، وَلَهُنَّ عَلَيْكُمْ رِزْقُهُنَّ وَكِسْوَتُهُنَّ بِالْمَعْرُوفِ.\nوَأَنْتُمْ مَسْئولونَ عَنِّي فَمَا أَنْتُمْ قَائِلُونَ؟ \" قَالُوا : نَشْهَدُ أَنَّكَ قَدْ بَلَّغْتَ وَأَدَّيْتَ وَنَصَحْتَ.\nفَقَالَ بِأُصْبُعِهِ السَّبَّابَةِ فَرَفَعَهَا إِلَى السَّمَاءِ، وَيَنْكُتُهَا إِلَى النَّاسِ : \" اللَّهُمَّ اشْهَدْ، اللَّهُمَّ اشْهَدْ، اللَّهُمَّ اشْهَدْ \".\nثُمَّ أَذَّنَ بِلَالٌ بِنِدَاءٍ وَاحِدٍ وَإِقَامَةٍ، فَصَلَّى الظُّهْرَ، ثُمَّ أَقَامَ فَصَلَّى الْعَصْرَ، لَمْ يُصَلِّ بَيْنَهُمَا شَيْئًا، ثُمَّ رَكِبَ حَتَّى وَقَفَ، فَجَعَلَ بَطْنَ نَاقَتِهِ الْقَصْوَاءِ إِلَى الصُّخَيْرَاتِ، وَقَالَ إِسْمَاعِيل : إِلَى الشُّجَيْرَاتِ ، وَجَعَلَ حَبْلَ الْمُشَاةِ بَيْنَ يَدَيْهِ، ثُمَّ اسْتَقْبَلَ الْقِبْلَةَ، فَلَمْ يَزَلْ وَاقِفًا حَتَّى غَرَبَتْ الشَّمْسُ وَذَهَبَتْ الصُّفْرَةُ، حَتَّى غَابَ الْقُرْصُ، فَأَرْدَفَ أُسَامَةَ خَلْفَهُ، ثُمَّ دَفَعَ، وَقَدْ شَنَقَ لِلْقَصْوَاءِ الزِّمَامَ، حَتَّى إِنَّهُ لَيُصِيبُ رَأْسُهَا مَوْرِكَ رَحْلِهِ، وَيَقُولُ بِيَدِهِ الْيُمْنَى : \" السَّكِينَةَ السَّكِينَةَ \".\nكُلَّمَا أَتَى حَبْلًا مِنْ الْحِبَالِ، أَرْخَى لَهَا قَلِيلًا حَتَّى تَصْعَدَ، حَتَّى أَتَى الْمُزْدَلِفَةَ ، فَصَلَّى بِهَا الْمَغْرِبَ وَالْعِشَاءَ بِأَذَانٍ وَإِقَامَتَيْنِ، ثُمَّ اضْطَجَعَ حَتَّى إِذَا طَلَعَ يَعْنِي الْفَجْرُ، صَلَّى الْفَجْرَ، بِأَذَانٍ وَإِقَامَةٍ، ثُمَّ رَكِبَ الْقَصْوَاءَ حَتَّى وَقَفَ عَلَى الْمَشْعَرِ الْحَرَامِ ، وَاسْتَقْبَلَ الْقِبْلَةَ، فَدَعَا اللَّهَ وَكَبَّرَهُ وَهَلَّلَهُ وَوَحَّدَهُ حَتَّى أَسْفَرَ جِدًا، ثُمَّ دَفَعَ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ، وَأَرْدَفَ الْفَضْلَ بْنَ عَبَّاسِ، وَكَانَ رَجُلًا حَسَنَ الشَّعْرِ، أَبْيَضَ، وَسِيمًا، فَلَمَّا دَفَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، مَرَّ بِالظُّعُنِ يَجْرِينَ، فَطَفِقَ الْفَضْلُ يَنْظُرُ إِلَيْهِنَّ، فَأَخَذَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ فَوَضَعَهَا عَلَى وَجْهِ الْفَضْلِ، فَحَوَّلَ الْفَضْلُ رَأْسَهُ مِنْ الشِّقِّ الْآخَرِ، فَوَضَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ مِنْ الشِّقِّ الْآخَرِ حَتَّى إِذَا أَتَى مُحَسِّرَ، حَرَّكَ قَلِيلًا، ثُمَّ سَلَكَ الطَّرِيقَ الْوُسْطَى الَّتِي تُخْرِجُكَ إِلَى الْجَمْرَةِ الْكُبْرَى، حَتَّى إِذَا أَتَى الْجَمْرَةَ الَّتِي عِنْدَهَا الشَّجَرَةُ، فَرَمَى بِسَبْعِ حَصَيَاتٍ يُكَبِّرُ عَلَى كُلِّ حَصَاةٍ مِنْ حَصَى الْخَذْفِ، ثُمَّ رَمَى مِنْ بَطْنِ الْوَادِي، ثُمَّ انْصَرَفَ إِلَى الْمَنْحَرِ، فَنَحَرَ ثَلَاثًا وَسِتِّينَ بَدَنَةً بِيَدِهِ، ثُمَّ أَعْطَى عَلِيًّا فَنَحَرَ مَا غَبَرَ، وَأَشْرَكَهُ فِي بُدْنِهِ، ثُمَّ أَمَرَ مِنْ كُلِّ بَدَنَةٍ بِبَضْعَةٍ، فَجُعِلَتْ فِي قِدْرٍ، فَطُبِخَتْ فَأَكَلَا مِنْ لُحُومِهَا، وَشَرِبَا مِنْ مَرَقِهَا، ثُمَّ رَكِبَ فَأَفَاضَ إِلَى الْبَيْتِ ، فَأَتَى الْبَيْتَ فَصَلَّى الظُّهْرَ بِمَكَّةَ ، وَأَتَى بَنِي عَبْدِ الْمُطَّلِبِ وَهُمْ يَسْتَقُونَ مِنْ زَمْزَمَ ، فَقَالَ : \" انْزِعُوا بَنِي عَبْدِ الْمُطَّلِبِ، فَلَوْلَا يَغْلِبَنَّكُمُ النَّاسُ عَلَى سِقَايَتِكُمْ، لَنَزَعْتُ مَعَكُمْ \".\nفَنَاوَلُوهُ دَلْوًا فَشَرِبَ.\nأَخْبَرَنَا مُحَمَّدُ بْنُ سَعِيدٍ الْأَصْبَهَانِيُّ  ، أَخْبَرَنَا حَاتِمُ بْنُ إِسْمَاعِيل  ، عَنْ جَعْفَرٍ  ، عَنْ أَبِيهِ  ، عَنْ جَابِرٍ  ، بِهَذَا",
    "malay_translation": "Diriwayatkan daripada Jabir bin Abdullah RA, beliau menceritakan tentang Haji Nabi SAW yang terperinci."
  },
  {
    "id": 38687,
    "hadith_number": 1150,
    "tajuk_hadith": "Larangan Memberi Wangi-wangian dan Menutup Kepala Bagi Orang yang Meninggal Dunia dalam Keadaan Berihram",
    "perawi_melayu": "Sulaiman bin Harb",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا حَمَّادٌ هُوَ ابْنُ زَيْدٍ  ، عَنْ أَيُّوبَ  ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ : بَيْنَا رَجُلٌ وَاقِفٌ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرَفَةَ ، فَوَقَعَ عَنْ رَاحِلَتِهِ أَوْ قَالَ : فَأَقْعَصَتْهُ ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ، وَكَفِّنُوهُ فِي ثَوْبَيْنِ، وَلَا تُحَنِّطُوهُ، وَلَا تُخَمِّرُوا رَأْسَهُ، فَإِنَّ اللَّهَ تَعَالَى يَبْعَثُهُ يَوْمَ الْقِيَامَةِ مُلَبِّيًا \"",
    "malay_translation": "Sulaiman bin Harb mengkhabarkan kepada kami, Hammad iaitu Ibnu Zaid menceritakan kepada kami, daripada Ayyub, daripada Sa'id bin Jubair, daripada Ibnu Abbas, dia berkata: Ketika seorang lelaki sedang berdiri bersama Nabi SAW di Arafah, dia terjatuh daripada kenderaannya atau perawinya berkata: lalu kenderaannya membunuhnya, maka Rasulullah SAW bersabda: \"Mandikan dia dengan air dan daun bidara, kafankan dia dengan dua helai kain, jangan kamu memberinya wangi-wangian, dan jangan kamu menutup kepalanya, kerana Allah Taala akan membangkitkannya pada hari kiamat dalam keadaan bertalbiah.\""
  },
  {
    "id": 38688,
    "hadith_number": 1151,
    "tajuk_hadith": "Tujuan Tawaf, Melontar Jamrah, dan Sa'i adalah untuk Mengingati Allah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي زِيَادٍ  ، عَنْ الْقَاسِمِ  ،  عَنْ عَائِشَةَ  ، قَالَتْ : \" إِنَّمَاجُعِلَ الطَّوَافُ بِالْبَيْتِ ، وَرَمْيُ الْجِمَارِ، وَالسَّعْيُ بَيْنَ الصَّفَا وَالْمَرْوَةِ ، لِإِقَامَةِ ذِكْرِ اللَّهِ \".\nقَالَ أَبُو عَاصِمٍ : كَانَ يَرْفَعُهُ.\n أَخْبَرَنَا أَبُو نُعَيْمٍ  ، وَمُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي زِيَادٍ  ، عَنْ الْقَاسِمِ  ، عَنْ عَائِشَةَ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، نَحْوَهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu 'Asim, daripada 'Ubaidillah bin Abi Ziyad, daripada al-Qasim, daripada 'Aisyah, beliau berkata: \"Sesungguhnya dijadikan tawaf di Baitullah, melontar jamrah, dan sa'i antara Safa dan Marwah, adalah untuk menegakkan zikir kepada Allah.\"\nAbu 'Asim berkata: Dia mengangkatnya (kepada Nabi).\nTelah mengkhabarkan kepada kami Abu Nu'aim, dan Muhammad bin Yusuf, daripada Sufyan, daripada 'Ubaidillah bin Abi Ziyad, daripada al-Qasim, daripada 'Aisyah, daripada Nabi SAW, sepertinya."
  },
  {
    "id": 38689,
    "hadith_number": 1152,
    "tajuk_hadith": "Khasnya Pembatalan Haji Bagi Sahabat Nabi SAW",
    "perawi_melayu": "Diriwayatkan daripada Bilal bin al-Harith, daripada ayahnya, beliau berkata: Aku berkata: Wahai Rasulullah, adakah pembatalan haji ini khusus bagi kami, atau bagi orang-orang selepas kami? Baginda bersabda: \"Bahkan, ia khusus bagi kami.\"",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا نُعَيْمُ بْنُ حَمَّادٍ  ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ  ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ  ، عَنْ بِلَالِ بْنِ الْحَارِثِ  ، عَنْ أَبِيهِ  ، قَالَ : قُلْتُ : يَا رَسُولَ اللَّهِ :فَسْخُ الْحَجِّ لَنَا خَاصَّةً، أَمْ لِمَنْ بَعْدَنَا؟ قَالَ : \" بَلْ لَنَا خَاصَّةً \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Nu'aim bin Hammad, telah menceritakan kepada kami Abdul Aziz bin Muhammad, daripada Rabiah bin Abi Abd al-Rahman, daripada Bilal bin al-Harith, daripada ayahnya, beliau berkata: Aku berkata: Wahai Rasulullah, adakah pembatalan haji ini khusus bagi kami, atau bagi orang-orang selepas kami? Baginda bersabda: \"Bahkan, ia khusus bagi kami.\""
  },
  {
    "id": 38690,
    "hadith_number": 1153,
    "tajuk_hadith": "Umrah dan Kesinambungannya dalam Haji Sehingga Hari Kiamat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَهْلُ بْنُ حَمَّادٍ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ الْحَكَمِ  ، عَنْ مُجَاهِدٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" هَذِهِ عُمْرَةٌ اسْتَمْتَعْنَا بِهَا، فَمَنْ لَمْ يَكُنْ مَعَهُ هَدْيٌ فَلْيَحِلَّ الْحِلَّ كُلَّهُ، فَقَدْ دَخَلَتِ الْعُمْرَةُ فِي الْحَجِّ إِلَى يَوْمِ الْقِيَامَةِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Sahl bin Hammad, telah menceritakan kepada kami Syu'bah, daripada al-Hakam, daripada Mujahid, daripada Ibnu Abbas, daripada Nabi SAW, baginda bersabda: \"Ini adalah umrah yang telah kita nikmati. Sesiapa yang tidak membawa binatang hadyu (sembelihan), maka hendaklah dia bertahallul sepenuhnya. Sesungguhnya umrah telah masuk (bergabung) dalam haji sehingga hari kiamat.\""
  },
  {
    "id": 38691,
    "hadith_number": 1154,
    "tajuk_hadith": "Kemudahan Umrah dalam Haji",
    "perawi_melayu": "Ja'far bin 'Aun telah mengkhabarkan kepada kami, 'Abdul 'Aziz bin 'Umar bin 'Abdul 'Aziz telah menceritakan kepada kami, daripada Rabi' bin Sabrah, bahawa ayahnya menceritakan kepadanya: Bahawa mereka berjalan bersama Nabi SAW sehingga mereka sampai di Usfan, lalu seorang lelaki dari Bani Mudlij bernama Malik bin Suraqah atau Suraqah bin Malik berkata kepadanya: Selesaikanlah untuk kami seperti keputusan orang yang baru dilahirkan pada hari ini. Baginda bersabda: Sesungguhnya Allah telah memasukkan umrah ke dalam haji kamu ini, maka apabila kamu telah tiba, sesiapa yang tawaf di Baitullah dan di Safa dan Marwah, maka dia telah halal kecuali orang yang membawa binatang korban.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا جَعْفَرُ بْنُ عَوْنٍ  ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ  ، عَنْ رَبِيعِ بْنِ سَبْرَةَ  ، أَنَّ أَبَاهُ   حَدَّثَهُ : أَنَّهُمْ سَارُوا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى بَلَغُوا عُسْفَانَ، فَقَالَ لَهُ رَجُلٌ مِنْ بَنِي مُدْلِجٍ يُقَالُ لَهُ مَالِكُ بْنُ سُرَاقَةَ أَوْ سُرَاقَةُ بْنُ مَالِكٍ : اقْضِ لَنَا قَضَاءَ قَوْمٍ وُلِدُوا الْيَوْمَ.\nقَالَ : \" إِنَّاللَّهَ قَدْ أَدْخَلَ عَلَيْكُمْ فِي حَجِّكُمْ هَذَا عُمْرَةً، فَإِذَا أَنْتُمْ قَدِمْتُمْ فَمَنْ تَطَوَّفَ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ ، فَقَدْ حَلَّ إِلَّا مَنْ كَانَ مَعَهُ هَدْيٌ \"",
    "malay_translation": "Ja'far bin 'Aun telah mengkhabarkan kepada kami, 'Abdul 'Aziz bin 'Umar bin 'Abdul 'Aziz telah menceritakan kepada kami, daripada Rabi' bin Sabrah, bahawa ayahnya menceritakan kepadanya: Bahawa mereka berjalan bersama Nabi SAW sehingga mereka sampai di Usfan, lalu seorang lelaki dari Bani Mudlij bernama Malik bin Suraqah atau Suraqah bin Malik berkata kepadanya: Selesaikanlah untuk kami seperti keputusan orang yang baru dilahirkan pada hari ini. Baginda bersabda: \"Sesungguhnya Allah telah memasukkan umrah ke dalam haji kamu ini, maka apabila kamu telah tiba, sesiapa yang tawaf di Baitullah dan di Safa dan Marwah, maka dia telah halal kecuali orang yang membawa binatang korban.\""
  },
  {
    "id": 38692,
    "hadith_number": 1155,
    "tajuk_hadith": "Empat Umrah yang Dilakukan oleh Nabi Muhammad SAW",
    "perawi_melayu": "Diriwayatkan daripada Ibn Abbas RA bahawa Nabi SAW melakukan empat umrah:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا شِهَابُ بْنُ عَبَّادٍ  ، حَدَّثَنَا دَاوُدُ بْنُ عَبْدِ الرَّحْمَنِ  ، عَنْ عَمْرِو بْنِ دِينَارٍ  ، عَنْ عِكْرِمَةَ  ، عَنْ ابْنِ عَبَّاسٍ  ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَاعْتَمَرَ أَرْبَعَ عُمَرٍ : عُمْرَةَ الْحُدَيْبِيَةِ ، وَعُمْرَةَ الْقَضَاءِ أَوْ قَالَ : عُمْرَةَ الْقِصَاصِ، شَكَّ شِهَابُ بْنُ عَبَّادٍ مِنْ قَابِلٍ، وَالثَّالِثَةَ مِنْ الْجِعْرَانَةِ ، وَالرَّابِعَةَ الَّتِي مَعَ حَجَّتِهِ \"",
    "malay_translation": "Shahab bin 'Abbad memberitahu kami, Daud bin 'Abd al-Rahman memberitahu kami, daripada 'Amr bin Dinar, daripada Ikrimah, daripada Ibn 'Abbas, bahawa Nabi SAW melakukan empat umrah: Umrah Hudaibiyah, Umrah Qada' atau Umrah Qisas - Shahab bin 'Abbad ragu-ragu tentang yang mana satu - yang ketiga dari Ji'ranah, dan yang keempat yang bersama dengan haji baginda."
  },
  {
    "id": 38693,
    "hadith_number": 1156,
    "tajuk_hadith": "Keutamaan Umrah di Bulan Ramadhan",
    "perawi_melayu": "Diriwayatkan daripada Ibnu Abbas R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ ابْنِ جُرَيْجٍ  ، عَنْ عَطَاءٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ لِامْرَأَةٍ :\" اعْتَمِرِي فِي رَمَضَانَ، فَإِنَّ عُمْرَةً فِي رَمَضَانَ تَعْدِلُ حَجَّةً \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Asim, daripada Ibnu Juraij, daripada 'Ata', daripada Ibnu Abbas, bahawa Rasulullah SAW bersabda kepada seorang wanita: \"Lakukanlah umrah di bulan Ramadhan, kerana umrah di bulan Ramadhan menyamai haji.\""
  },
  {
    "id": 38694,
    "hadith_number": 1157,
    "tajuk_hadith": "Keutamaan Umrah di Bulan Ramadan",
    "perawi_melayu": "Diriwayatkan daripada Ahmad bin Khalid, daripada Muhammad bin Ishaq, daripada 'Isa bin Ma'qil bin Abi Ma'qil al-Asadi Asad Khuzaimah, daripada Yusuf bin Abdullah bin Salam, daripada neneknya Ummu Ma'qil.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ خَالِدٍ  ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاق  ، عَنْ عِيسَى بْنِ مَعْقِلِ بْنِ أَبِي مَعْقَلٍ الْأَسَدِيِّ أَسَدُ خُزَيْمَةَ  ، حَدَّثَنِي يُوسُفُ بْنُ عَبْدِ اللَّهِ بْنِ سَلَامٍ  ، عَنْ جَدَّتِهِ أُمِّ مَعْقَلٍ  ، قَالَتْ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" عُمْرَةٌ فِي رَمَضَانَ تَعْدِلُ حَجَّةً \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ahmad bin Khalid, telah menceritakan kepada kami Muhammad bin Ishaq, daripada 'Isa bin Ma'qil bin Abi Ma'qil al-Asadi Asad Khuzaimah, telah menceritakan kepadaku Yusuf bin Abdullah bin Salam, daripada neneknya Ummu Ma'qil, beliau berkata: Rasulullah SAW bersabda: \"Umrah di bulan Ramadan menyamai (pahala) haji.\""
  },
  {
    "id": 38695,
    "hadith_number": 1158,
    "tajuk_hadith": "Rasulullah SAW Melaksanakan Umrah dan Kembali ke Ji'ranah",
    "perawi_melayu": "Muhammad bin Yazid al-Bazzaz",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَزِيدَ الْبَزَّازُ  ، حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا  ، حَدَّثَنَا ابْنُ جُرَيْجٍ  ، أَخْبَرَنِي مُزَاحِمُ بْنُ أَبِي مُزَاحِمٍ  ، عَنْ عَبْدِ الْعَزِيزِ بْنِ عَبْدِ اللَّهِ  ، عَنْ مُحَرِّشٍ الْكَعْبِيِّ  ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" خَرَجَ مِنْ الْجِعْرَانَةِ حِينَ أَنْشَأَ مُعْتَمِرًا، فَدَخَلَ مَكَّةَ لَيْلًا، فَقَضَى عُمْرَتَهُ ثُمَّ خَرَجَ مِنْ تَحْتِ لَيْلَتِهِ، فَأَصْبَحَ بِالْجِعْرَانَةِ كَبَائِتٍ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Yazid al-Bazzaz, telah menceritakan kepada kami Yahya bin Zakaria, telah menceritakan kepada kami Ibn Juraij, telah mengkhabarkan kepadaku Muzahim bin Abi Muzahim, daripada Abdul Aziz bin Abdullah, daripada Muharrish al-Ka'bi, bahawa Rasulullah SAW keluar dari Ji'ranah ketika memulai umrah, lalu memasuki Mekah pada waktu malam, kemudian menyelesaikan umrahnya, lalu keluar pada malam itu juga, dan pagi harinya berada di Ji'ranah seolah-olah bermalam di situ."
  },
  {
    "id": 38696,
    "hadith_number": 1159,
    "tajuk_hadith": "Aisyah RA Melakukan Umrah dari Tan'im",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ  ، حَدَّثَنَا ابْنُ عُيَيْنَةَ  ، عَنْ عَمْرٍو  ، سَمِعَ عَمْرَو بْنَ أَوْسٍ  يَقُولُ : أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرٍ   يَقُولُ : \" أَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْأُرْدِفَ عَائِشَةَ فَأُعْمِرَهَا مِنْ التَّنْعِيمِ \".\nقَالَ سُفْيَانُ : كَانَ شُعْبَةُ يُعْجِبُهُ مِثْلَ هَذَا الْإِسْنَادِ",
    "malay_translation": "Telah menceritakan kepada kami Sadaqah bin Al-Fadhl, telah menceritakan kepada kami Ibnu Uyainah, daripada 'Amru, dia mendengar 'Amru bin Aus berkata: 'Telah mengkhabarkan kepadaku Abdurrahman bin Abu Bakar berkata: 'Rasulullah SAW memerintahkan aku untuk membonceng Aisyah, lalu dia melakukan umrah dari Tan'im.' Sufyan berkata: 'Syu'bah menyukai sanad seperti ini.'"
  },
  {
    "id": 38697,
    "hadith_number": 1160,
    "tajuk_hadith": "Nabi Muhammad SAW Menyuruh Abdul Rahman Memboncengkan Aisyah RA untuk Umrah dari Tan'im",
    "perawi_melayu": "Ahmad bin Yunus, Daud Al-Attar, Ibn Khuthaim, Yusuf bin Mahak, Hafsah binti Abdul Rahman bin Abu Bakar As-Siddiq, daripada ayahnya",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ  ، حَدَّثَنَا دَاوُدُ الْعَطَّارُ  ، عَنْ ابْنِ خُثَيْمٍ  ، عَنْ يُوسُفَ بْنِ مَاهَكَ  ، عَنْ حَفْصَةَ بِنْتِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ  ، عَنْ أَبِيهَا  ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِعَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ :\" أَرْدِفْ أُخْتَكَ يَعْنِي : عَائِشَةَ وَأَعْمِرْهَا مِنْ التَّنْعِيمِ ، فَإِذَا هَبَطْتَ مِنْ الْأَكَمَةِ ، فَمُرْهَا فَلْتُحْرِمْ، فَإِنَّهَا عُمْرَةٌ مُتَقَبَّلَةٌ \"",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Yunus, telah menceritakan kepada kami Daud Al-Attar, daripada Ibn Khuthaim, daripada Yusuf bin Mahak, daripada Hafsah binti Abdul Rahman bin Abu Bakar As-Siddiq, daripada ayahnya, bahawa Nabi SAW bersabda kepada Abdul Rahman bin Abu Bakar: \"Boncengkanlah saudara perempuanmu - iaitu Aisyah - dan niatkanlah dia untuk umrah dari Tan'im. Apabila engkau turun dari bukit, perintahkanlah dia untuk berihram, kerana itu adalah umrah yang diterima.\""
  },
  {
    "id": 38698,
    "hadith_number": 1161,
    "tajuk_hadith": "Mencium Hajar Aswad Mengikut Sunnah Rasulullah SAW",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُسَدَّدٌ  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، عَنْ أَيُّوبَ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ  ، أَنَّ عُمَرَ   قَالَ : \" إِنِّيلَأُقَبِّلُكَ، وَإِنِّي لَأَعْلَمُ أَنَّكَ حَجَرٌ، وَلَكِنِّي رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَبِّلُكَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Musaddad, telah menceritakan kepada kami Hammad bin Zaid, daripada Ayyub, daripada Nafi', daripada Ibn Umar, bahawa Umar RA berkata: \"Sesungguhnya aku menciummu, dan aku tahu bahawa engkau hanyalah batu, tetapi aku melihat Rasulullah SAW menciummu.\""
  },
  {
    "id": 38699,
    "hadith_number": 1162,
    "tajuk_hadith": "Mengucup Hajar Aswad Mengikut Sunnah Rasulullah SAW",
    "perawi_melayu": "Abu Asim",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ جَعْفَرِ بْنِ عَبْدِ اللَّهِ بْنِ عُثْمَانَ  ، قَالَ : رَأَيْتُ مُحَمَّدَ بْنَ عَبَّادِ بْنِ جَعْفَرٍ  \" يَسْتَلِمُ الْحَجَرَ، ثُمَّ يُقَبِّلُهُ وَيَسْجُدُ عَلَيْهِ \"، فَقُلْتُ لَهُ : مَا هَذَا؟ فَقَالَ : رَأَيْتُ خَالَكَ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ  رِضْوَانُ اللَّهِ عَلَيْهِ يَفْعَلُهُ، ثُمَّ قَالَ : رَأَيْتُ عُمَرَ   فَعَلَهُ، ثُمَّ قَالَ : إِنِّي لَأَعْلَمُ أَنَّكَ حَجَرٌ، وَلَكِنِّي رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُ هَذَا",
    "malay_translation": "Abu Asim meriwayatkan kepada kami daripada Ja'far bin Abdullah bin Uthman, beliau berkata: Aku melihat Muhammad bin Abbad bin Ja'far menyentuh Hajar Aswad, kemudian menciumnya dan sujud di atasnya. Aku bertanya kepadanya: Apa ini? Dia menjawab: Aku melihat bapa saudaramu, Abdullah bin Abbas radhiyallahu 'anhuma, melakukannya. Kemudian dia berkata: Aku melihat Umar melakukannya. Kemudian dia berkata: Sesungguhnya aku tahu bahawa engkau hanyalah sebuah batu, tetapi aku melihat Rasulullah SAW melakukan ini."
  },
  {
    "id": 38700,
    "hadith_number": 1163,
    "tajuk_hadith": "Rasulullah SAW Masuk ke Mekah dan Solat di Dalam Kaabah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ أَيُّوبَ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ  ، قَالَ :دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ وَرَدِيفُهُ أُسَامَةُ بْنُ زَيْدٍ، فَأَنَاخَ فِي أَصْلِ الْكَعْبَةِ ، فَقَالَ ابْنُ عُمَرَ : وَسَعَى النَّاسُ، فَدَخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبِلَالٌ وَأُسَامَةُ، فَقُلْتُ لِبِلَالٍ مِنْ وَرَاءِ الْبَاب : \" أَيْنَ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ فَقَالَ : بَيْنَ السَّارِيَتَيْنِ \".\nأَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ  ، حَدَّثَنَا لَيْثٌ  ، عَنْ ابْنِ شِهَابٍ  ، عَنْ سَالِمٍ  ، عَنْ عَبْدِ اللَّهِ   ، أَنَّهُ قَالَ : دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَيْتَ هُوَ وَأُسَامَةُ بْنُ زَيْدٍ، وَبِلَالٌ، وَعُثْمَانُ بْنُ طَلْحَةَ الْحَجَبِيُّ، فَذَكَرَ نَحْوَهُ",
    "malay_translation": "Hajjaj bin Minhal telah meriwayatkan kepada kami, Hammad bin Salamah telah meriwayatkan kepada kami, daripada Ayyub, daripada Nafi', daripada Ibn Umar, beliau berkata: Rasulullah SAW memasuki Mekah dan Usamah bin Zaid membonceng di belakang baginda. Baginda berhenti di dasar Kaabah. Ibn Umar berkata: Orang ramai melakukan sa'i. Nabi SAW, Bilal dan Usamah masuk. Aku bertanya kepada Bilal dari luar pintu: \"Di manakah Rasulullah SAW solat?\" Beliau menjawab: \"Di antara dua tiang.\"\n\nAhmad bin Abdullah bin Yunus telah mengkhabarkan kepada kami, Laith telah meriwayatkan kepada kami, daripada Ibn Shihab, daripada Salim, daripada Abdullah, bahawa beliau berkata: Rasulullah SAW memasuki Baitullah bersama Usamah bin Zaid, Bilal dan Uthman bin Talhah al-Hajabi, dan beliau menyebutkan seumpamanya."
  },
  {
    "id": 38701,
    "hadith_number": 1164,
    "tajuk_hadith": "Niat Nabi Muhammad SAW Membina Semula Kaabah di Atas Asas Nabi Ibrahim AS",
    "perawi_melayu": "Diriwayatkan daripada Aisyah R.A.",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ  ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ  ، عَنْ هِشَامِ بْنِ عُرْوَةَ  ، عَنْ أَبِيهِ  ، عَنْ عَائِشَةَ  ، قَالَتْ : قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَوْلَا حَدَاثَةُ عَهْدِ قَوْمِكِ بِالْكُفْرِ، لَنَقَضْتُ الْكَعْبَةَ ثُمَّ لَبَنَيْتُهَا عَلَى أُسِّ إِبْرَاهِيمَ ، فَإِنَّ قُرَيْشًا حِينَ بَنَتْ اسْتَقْصَرَتْ، ثُمَّ جَعَلَتْ لَهَا خَلْفًا \"",
    "malay_translation": "Telah menceritakan kepadaku Farwah bin Abi Al-Maghra', telah menceritakan kepada kami Ali bin Mushir, daripada Hisham bin Urwah, daripada ayahnya, daripada Aisyah R.A., beliau berkata: Rasulullah SAW bersabda kepadaku: \"Sekiranya bukan kerana kaummu baru sahaja meninggalkan kekufuran, nescaya aku akan meruntuhkan Kaabah, kemudian aku akan membinanya di atas asas (yang dibina oleh) Ibrahim AS. Sesungguhnya kaum Quraisy ketika membinanya, mereka telah memendekkannya, kemudian mereka membuatkan baginya bahagian belakang (Hatim).\""
  },
  {
    "id": 38702,
    "hadith_number": 1165,
    "tajuk_hadith": "Pertanyaan Aisyah tentang Hajar Aswad dan Pintu Kaabah yang Tinggi",
    "perawi_melayu": "Muhammad bin Isa, daripada Abu Al-Ahwas, daripada Al-Ash'ath bin Sulaim, daripada Al-Aswad, daripada Aisyah R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى  ، حَدَّثَنَا أَبُو الْأَحْوَصِ  ، عَنْ الْأَشْعَثِ بْنِ سُلَيْمٍ  ، عَنْ الْأَسْوَدِ  ، عَنْ عَائِشَةَ  ، قَالَتْ : سَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْحَجَرِ : أَمِنَ الْبَيْتِ هُوَ؟.\nقَالَ : نَعَمْ.\nقُلْتُ : فَمَا لَهُمْ لَمْ يُدْخِلُوهُ فِي الْبَيْتِ ؟ فَقَالَ : \" إِنَّ قَوْمَكِ قَصَّرَتْ بِهِمْ النَّفَقَةُ \".\n قُلْتُ : فَمَا شَأْنُ بَابِهِ مُرْتَفِعًا؟ قَالَ : \" فَعَلَ ذَلِكَ قَوْمُكِ لِيُدْخِلُوا مَنْ شَاءُوا وَيَمْنَعُوا مَنْ شَاءُوا،وَلَوْلَا أَنَّ قَوْمَكِ حَدِيثُ عَهْدٍ بِجَاهِلِيَّةٍ فَأَخَافُ أَنْ تُنْكِرَ قُلُوبُهُمْ، لَعَمَدْتُ إِلَى الْحِجْرِ فَجَعَلْتُهُ فِي الْبَيْتِ وَأَلْزَقْتُ بَابَهُ بِالْأَرْضِ \"",
    "malay_translation": "Aisyah R.A. berkata: Aku bertanya kepada Nabi SAW tentang Hajar (Aswad): Adakah ia sebahagian daripada Baitullah (Kaabah)? Baginda bersabda: \"Ya.\". Aku bertanya: Mengapa mereka tidak memasukkannya ke dalam Baitullah? Baginda bersabda: \"Sesungguhnya kaummu kekurangan perbelanjaan (untuk membina semula Kaabah).\". Aku bertanya: Mengapa pintunya tinggi? Baginda bersabda: \"Kaummu melakukan demikian supaya mereka dapat memasukkan sesiapa yang mereka kehendaki dan menghalang sesiapa yang mereka kehendaki. Kalaulah bukan kerana kaummu baru sahaja meninggalkan zaman jahiliah, dan aku khuatir hati mereka akan menolak (perubahan ini), nescaya aku akan menuju ke Al-Hijr dan menjadikannya sebahagian daripada Baitullah, dan aku akan merapatkan pintunya ke tanah.\""
  },
  {
    "id": 38703,
    "hadith_number": 1166,
    "tajuk_hadith": "Tahsib: Tempat Persinggahan Rasulullah SAW di Mekah",
    "perawi_melayu": "Muhammad bin Ahmad, Sufyan bin Uyainah, daripada 'Amr, daripada 'Ata', daripada Ibnu Abbas",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ  ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ  ، عَنْ عَمْرٍو  ، عَنْ عَطَاءٍ  ، قَالَ : سَمِعْتُ ابْنَ عَبَّاسٍ  ، يَقُولُ : \" التَّحْصِيبُ لَيْسَ بِشَيْءٍ، إِنَّمَاهُوَ مَنْزِلٌ نَزَلَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \".\n قَالَ أَبُو مُحَمَّد : التَّحْصِيبُ مَوْضِعٌ بِمَكَّةَ ، وَهُوَ مَوْضِعٌ بِبَطْحَاءَ",
    "malay_translation": "Muhammad bin Ahmad mengkhabarkan kepada kami, Sufyan bin Uyainah menceritakan kepada kami, daripada 'Amr, daripada 'Ata', beliau berkata: Saya mendengar Ibnu Abbas berkata: \"Tahsib bukanlah sesuatu (yang penting), ia hanyalah tempat persinggahan yang Rasulullah SAW singgah di situ.\" Abu Muhammad berkata: Tahsib adalah tempat di Mekah, iaitu tempat di Bathha'."
  },
  {
    "id": 38704,
    "hadith_number": 1167,
    "tajuk_hadith": "Rasulullah SAW Menunaikan Lima Solat di Mina",
    "perawi_melayu": "Al-Aswad bin 'Amir",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْأَسْوَدُ بْنُ عَامِرٍ  ، حَدَّثَنَا أَبُو كُدَيْنَةَ هُوَ يَحْيَى بْنُ الْمُهَلَّبِ  ، عَنْ الْأَعْمَشِ  ، عَنْ الْحَكَمِ  ، عَنْ مِقْسَمٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ :\" صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى خَمْسَ صَلَوَاتٍ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Al-Aswad bin 'Amir, telah menceritakan kepada kami Abu Kudainah, iaitu Yahya bin Al-Muhallab, daripada Al-A'mash, daripada Al-Hakam, daripada Miqsam, daripada Ibnu 'Abbas, beliau berkata: \"Rasulullah SAW telah menunaikan lima solat di Mina.\""
  },
  {
    "id": 38705,
    "hadith_number": 1168,
    "tajuk_hadith": "Tempat Solat Zohor pada Hari Tarwiyah dan Asar pada Hari Nafar",
    "perawi_melayu": "Muhammad bin Ahmad dan Ahmad bin Muhammad bin Hanbal daripada Ishaq bin Yusuf, daripada Sufyan al-Thawri, daripada Abdul Aziz bin Rufai'.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ  ، وَأَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ  ، عَنْ إِسْحَاق بْنِ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ  ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ  ، قَالَ : قُلْتُ لِأَنَسِ بْنِ مَالِكٍ   : حَدِّثْنِي بِشَيْءٍ عَقَلْتَهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : أَيْنَ صَلَّى الظُّهْرَ يَوْمَ التَّرْوِيَةِ؟ قَالَ : بِمِنًى .\nقَالَ : قُلْتُ : فَأَيْنَ صَلَّى الْعَصْرَ يَوْمَ النَّفْرِ؟ قَالَ : بِالْأَبْطَحِ ، ثُمَّ قَالَ :\" اصْنَعْ مَا يَصْنَعُ أُمَرَاؤُكَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Ahmad dan Ahmad bin Muhammad bin Hanbal, daripada Ishaq bin Yusuf, telah menceritakan kepada kami Sufyan al-Thawri, daripada Abdul Aziz bin Rufai', dia berkata: Aku bertanya kepada Anas bin Malik: Ceritakan kepadaku sesuatu yang engkau ingat daripada Rasulullah ﷺ: Di manakah Baginda ﷺ solat Zohor pada hari Tarwiyah? Beliau menjawab: Di Mina.  Dia berkata: Aku bertanya: Di manakah Baginda ﷺ solat Asar pada hari Nafar? Beliau menjawab: Di al-Abtah, kemudian beliau berkata: \"Lakukanlah seperti mana yang dilakukan oleh para pemimpin kamu.\""
  },
  {
    "id": 38706,
    "hadith_number": 1169,
    "tajuk_hadith": "Rasulullah S.A.W. Menunaikan Solat Zuhur, Asar, Maghrib dan Isyak di Mina",
    "perawi_melayu": "Diriwayatkan dari Anas R.A.: Rasulullah S.A.W. menunaikan solat Zuhur, Asar, Maghrib dan Isyak, dan tidur sekejap di Mina, kemudian menunggang kenderaan ke Baitullah dan tawaf di sekelilingnya.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، حَدَّثَنِي اللَّيْثُ  ، قَالَ : حَدَّثَنِي خَالِدٌ  ، عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ  ، عَنْ قَتَادَةَ  ،  عَنْ أَنَسٍ   أَنَّهُ حَدَّثَهُ : أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" صَلَّى الظُّهْرَ وَالْعَصْرَ وَالْمَغْرِبَ وَالْعِشَاءَ، وَرَقَدَ رَقْدَةً بِمِنًى ، ثُمَّ رَكِبَ إِلَى الْبَيْتِ فَطَافَ بِهِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abdullah bin Soleh, telah menceritakan kepadaku Al-Laith, beliau berkata: Telah menceritakan kepadaku Khalid, daripada Sa'id bin Abi Hilal, daripada Qatadah, daripada Anas R.A. bahawa beliau telah menceritakan kepadanya: Sesungguhnya Rasulullah S.A.W. telah menunaikan solat Zuhur, Asar, Maghrib dan Isyak, dan tidur sekejap di Mina, kemudian menunggang kenderaan ke Baitullah dan tawaf di sekelilingnya."
  },
  {
    "id": 38707,
    "hadith_number": 1170,
    "tajuk_hadith": "Solat Empat Rakaat di Mina: Penyesalan Abdullah bin Mas'ud",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الصَّلْتِ  ، عَنْ مَنْصُورِ بْنِ أَبِي الْأَسْوَدِ  ، عَنْ سُلَيْمَانَ  ، عَنْ إِبْرَاهِيمَ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ  ، قَالَ : قَالَ عَبْدُ اللَّهِ   وَصَلَّى مَعَ عُثْمَانَ بِمِنًى أَرْبَعَ رَكَعَاتٍ : \" لَقَدْصَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذَا الْمَكَانِ رَكْعَتَيْنِ رَكْعَتَيْنِ، وَمَعَ أَبِي بَكْرٍ رَكْعَتَيْنِ رَكْعَتَيْنِ، وَمَعَ عُمَرَ رَكْعَتَيْنِ رَكْعَتَيْنِ، ثُمَّ تَفَرَّقَتْ بِكُمْ الطُّرُقُ، فَلَيْتَ حَظِّي مِنْ أَرْبَعِ رَكَعَاتٍ رَكْعَتَانِ مُتَقَبَّلَتَانِ \"",
    "malay_translation": "Muhammad bin al-Salt mengkhabarkan kepada kami, daripada Mansur bin Abi al-Aswad, daripada Sulaiman, daripada Ibrahim, daripada Abd al-Rahman bin Yazid, katanya: Abdullah berkata, dan dia solat bersama Uthman di Mina empat rakaat: \"Sesungguhnya aku telah solat bersama Rasulullah SAW di tempat ini dua rakaat, dua rakaat, dan bersama Abu Bakar dua rakaat, dua rakaat, dan bersama Umar dua rakaat, dua rakaat, kemudian kamu berpecah jalan, maka alangkah baiknya bahagianku daripada empat rakaat adalah dua rakaat yang diterima.\""
  },
  {
    "id": 38708,
    "hadith_number": 1171,
    "tajuk_hadith": "Rasulullah SAW Menunaikan Solat Dua Rakaat di Mina",
    "perawi_melayu": "Diriwayatkan oleh Muhammad bin Yusuf daripada al-Awza'i, daripada az-Zuhri, daripada Salim, daripada bapanya.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ الْأَوْزَاعِيِّ  ، عَنْ الزُّهْرِيِّ  ، عَنْ سَالِمٍ  ، عَنْ أَبِيهِ   أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" صَلَّى بِمِنًى رَكْعَتَيْنِ، وَأَبَا بَكْرٍ رَكْعَتَيْنِ، وَعُمَرَ رَكْعَتَيْنِ، وَعُثْمَانَ رَكْعَتَيْنِ صَدْرًا مِنْ إِمَارَتِهِ، ثُمَّ أَتَمَّهَا بَعْدُ \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Yusuf, daripada al-Awza'i, daripada az-Zuhri, daripada Salim, daripada bapanya: Sesungguhnya Rasulullah SAW solat di Mina dua rakaat, Abu Bakar (juga solat) dua rakaat, Umar (juga solat) dua rakaat, dan Uthman (juga solat) dua rakaat pada awal pemerintahannya, kemudian beliau menyempurnakannya selepas itu."
  },
  {
    "id": 38709,
    "hadith_number": 1172,
    "tajuk_hadith": "Perbezaan Amalan Sahabat dalam Bertalbiah dan Bertakbir Bersama Rasulullah SAW",
    "perawi_melayu": "Ubaidullah bin Musa, daripada Sufyan, daripada Yahya bin Sa'id, daripada Abdullah bin Abi Salamah al-Majishun, daripada Ibnu Umar",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، عَنْ سُفْيَانَ  ، عَنْ يَحْيَى بْنِ سَعِيدٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ الْمَاجِشُونِ  ، عَنْ ابْنِ عُمَرَ  ، قَالَ : \" خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ مِنًى ،فَمِنَّا مَنْ يُكَبِّرُ وَمِنَّا مَنْ يُلَبِّي \"",
    "malay_translation": "Ubaidullah bin Musa telah mengkhabarkan kepada kami, daripada Sufyan, daripada Yahya bin Sa'id, daripada Abdullah bin Abi Salamah al-Majishun, daripada Ibnu Umar, beliau berkata: \"Kami keluar bersama Rasulullah SAW dari Mina, maka di antara kami ada yang bertakbir dan di antara kami ada yang bertalbiah.\""
  },
  {
    "id": 38710,
    "hadith_number": 1173,
    "tajuk_hadith": "Talbiyah dan Takbir pada Zaman Rasulullah SAW",
    "perawi_melayu": "Abu Nu'aim, daripada Malik, daripada Muhammad bin Abi Bakr ath-Thaqafi, daripada Anas bin Malik RA",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا مَالِكٌ  ، حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرٍ الثَّقَفِيُّ  ، قَالَ : سَأَلْتُ أَنَسَ بْنَ مَالِكٍ   وَنَحْنُ غَادِيَانِ مِنْ مِنًى إِلَى عَرَفَاتٍ عَنْ التَّلْبِيَةِ : كَيْفَ كُنْتُمْ تَصْنَعُونَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ : \" كَانَيُلَبِّي الْمُلَبِّي فَلَا يُنْكَرُ عَلَيْهِ، وَيُكَبِّرُ الْمُكَبِّرُ فَلَا يُنْكَرُ عَلَيْهِ \"",
    "malay_translation": "Abu Nu'aim meriwayatkan kepada kami, daripada Malik, meriwayatkan kepadaku Muhammad bin Abi Bakr ath-Thaqafi, beliau berkata: Saya bertanya kepada Anas bin Malik RA ketika kami dalam perjalanan dari Mina ke Arafah tentang talbiyah: 'Bagaimana kamu semua melakukannya bersama Rasulullah SAW?' Beliau menjawab: 'Orang yang bertalbiyah akan bertalbiyah dan tidak ditegah, dan orang yang bertakbir akan bertakbir dan tidak ditegah.'"
  },
  {
    "id": 38711,
    "hadith_number": 1174,
    "tajuk_hadith": "Kebimbangan Jubair tentang Kehadiran Rasulullah SAW di Arafah",
    "perawi_melayu": "Muhammad bin Yusuf, daripada Ibnu Uyainah, daripada Amru bin Dinar, daripada Muhammad bin Jubair bin Mut'im, daripada Jubair",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا ابْنُ عُيَيْنَةَ  ، حَدَّثَنِي عَمْرُو بْنُ دِينَارٍ  ، عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ  ، قَالَ : قَالَ جُبَيْرٌ   : أَضْلَلْتُ بَعِيرًا لِي فَذَهَبْتُ أَطْلُبُهُ، فَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" وَاقِفًا مَعَ النَّاسِ بِعَرَفَةَ \"، فَقُلْتُ : وَاللَّهِ إِنَّ هَذَا لَمِنْ الْحُمْسِ، فَمَا شَأْنُهُ هَهُنَا",
    "malay_translation": "Muhammad bin Yusuf meriwayatkan kepada kami, Ibnu Uyainah meriwayatkan kepada kami, Amru bin Dinar meriwayatkan kepadaku, daripada Muhammad bin Jubair bin Mut'im, beliau berkata: Jubair berkata: \"Aku kehilangan seekor unta, lalu aku pergi mencarinya. Aku melihat Rasulullah SAW berdiri bersama orang ramai di Arafah. Lalu aku berkata: 'Demi Allah, sesungguhnya dia ini daripada golongan al-Hums (golongan yang ketat dalam agama), jadi apa urusannya di sini?'\""
  },
  {
    "id": 38712,
    "hadith_number": 1175,
    "tajuk_hadith": "Keharusan Mendahulukan Bercukur Sebelum Menyembelih dalam Ibadah Haji",
    "perawi_melayu": "Diriwayatkan daripada Jabir RA bahawa Rasulullah SAW melontar (jamrah), kemudian duduk untuk orang ramai. Seorang lelaki datang kepada baginda dan berkata: Wahai Rasulullah, sesungguhnya aku telah bercukur sebelum aku menyembelih? Baginda bersabda: 'Tidak mengapa'.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، عَنْ أُسَامَةَ بْنِ زَيْدٍ  ، عَنْ عَطَاءٍ  ، عَنْ جَابِرٍ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَمَى، ثُمَّ قَعَدَ لِلنَّاسِ، فَجَاءَهُ رَجُلٌ فَقَالَ : يَا رَسُولَ اللَّهِ، إِنِّيحَلَقْتُ قَبْلَ أَنْ أَنْحَرَ؟ قَالَ : \" لَا حَرَجَ \"",
    "malay_translation": "Telah menceritakan kepada kami Ubaidullah bin Musa, daripada Usamah bin Zaid, daripada Ata', daripada Jabir RA, bahawa Rasulullah SAW melontar (jamrah), kemudian duduk untuk orang ramai. Seorang lelaki datang kepada baginda dan berkata: Wahai Rasulullah, sesungguhnya aku telah bercukur sebelum aku menyembelih? Baginda bersabda: 'Tidak mengapa'."
  },
  {
    "id": 38713,
    "hadith_number": 1176,
    "tajuk_hadith": "Kemudahan dalam Ibadah Haji: Melakukan Tawaf Sebelum Melontar Jamrah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "ثُمَّ جَاءَهُ آخَرُ، فَقَالَ : يَا رَسُولَ اللَّهِ،طُفْتُ قَبْلَ أَنْ أَرْمِيَ؟ قَالَ : \" لَا حَرَجَ \".\nقَالَ : فَمَا سُئِلَ عَنْ شَيْءٍ إِلَّا قَالَ : \" لَا حَرَجَ \"",
    "malay_translation": "Kemudian datang seorang yang lain kepadanya, dan berkata: Wahai Rasulullah, saya telah melakukan tawaf sebelum melontar (jamrah)? Baginda bersabda: \"Tidak mengapa (tiada halangan).\". Dia berkata: Maka tidaklah Baginda ditanya tentang sesuatu pun melainkan Baginda bersabda: \"Tidak mengapa (tiada halangan).\""
  },
  {
    "id": 38714,
    "hadith_number": 1177,
    "tajuk_hadith": "Keseluruhan Arafah, Muzdalifah, Mina adalah Tempat Ibadah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" كُلُّ عَرَفَةَ مَوْقِفٌ، وَكُلُّ مُزْدَلِفَةَ مَوْقِفٌ، وَمِنًى كُلُّهَا مَنْحَرٌ، وَكُلُّ فِجَاجِ مَكَّةَ طَرِيقٌ وَمَنْحَرٌ \"",
    "malay_translation": "Kemudian Rasulullah SAW bersabda: \"Keseluruhan Arafah adalah tempat wukuf, keseluruhan Muzdalifah adalah tempat wukuf, Mina keseluruhannya adalah tempat penyembelihan, dan seluruh jalan-jalan di Mekah adalah jalan dan tempat penyembelihan.\""
  },
  {
    "id": 38715,
    "hadith_number": 1178,
    "tajuk_hadith": "Rasulullah S.A.W. Bergerak dari Arafah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ  ، عَنْ أَبِيهِ  ، عَنْ أُسَامَةَ بْنِ زَيْدٍ  ، أَنَّهُ كَانَ رَدِيفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" فَأَفَاضَ مِنْ عَرَفَةَ ، وَكَانَ يَسِيرُ الْعَنَقَ، فَإِذَا أَتَى عَلَى فَجْوَةٍ، نَصَّ \"",
    "malay_translation": "Hajjaj bin Minhal menceritakan kepada kami, Hammad bin Salamah menceritakan kepada kami, Hisham bin Urwah memberitahu kami, daripada ayahnya, daripada Usamah bin Zaid, bahawa dia pernah membonceng Nabi SAW. Baginda bergerak dari Arafah, dan Baginda berjalan dengan perlahan, dan apabila Baginda tiba di suatu kawasan lapang, Baginda mempercepatkan (unta)."
  },
  {
    "id": 38716,
    "hadith_number": 1179,
    "tajuk_hadith": "Rasulullah SAW Berwuduk dan Solat di Muzdalifah Semasa Haji",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا زُهَيْرٌ  ، عَنْ إِبْرَاهِيمَ بْنِ عُقْبَةَ  ، قَالَ : أَخْبَرَنِي كُرَيْبٌ  أَنَّهُ : سَأَلَ أُسَامَةَ بْنَ زَيْدٍ  ، قَالَ : أَخْبِرْنِي عَشِيَّةَ رَدِفْتَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : كَيْفَ فَعَلْتُمْ أَوْ صَنَعْتُمْ؟ قَالَ : \" جِئْنَا الشِّعْبَ الَّذِي يُنِيخُ النَّاسُ فِيهِ لِلْمُعَرَّسِ، فَأَنَاخَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَاقَتَهُ، ثُمَّ بَالَ وَمَا قَالَ : أَهْرَاقَ الْمَاءَ ، ثُمَّ دَعَا بِالْوَضُوءِ فَتَوَضَّأَ وُضُوءًا لَيْسَ بِالسَّابِغِ جِدًّا، ثُمَّ قُلْتُ : يَا رَسُولَ اللَّهِ، الصَّلَاةَ؟ قَالَ : الصَّلَاةُ أَمَامَكَ.\nقَالَ :فَرَكِبَ حَتَّى قَدِمْنَا الْمُزْدَلِفَةَ ، فَأَقَامَ الْمَغْرِبَ، ثُمَّ أَنَاخَ وَالنَّاسُ فِي مَنَازِلِهِمْ، فَلَمْ يَحِلُّوا حَتَّى أَقَامَ الْعِشَاءَ الْآخِرَةَ، فَصَلَّى، ثُمَّ حَلَّ النَّاسُ \".\nقَالَ : قُلْتُ : أَخْبِرْنِي كَيْفَ فَعَلْتُمْ حِينَ أَصْبَحْتُمْ؟.\n قَالَ : رَدِفَهُ الْفَضْلُ بْنُ عَبَّاسٍ، فَانْطَلَقْتُ أَنَا فِي سُبَّاقِ قُرَيْشٍ عَلَى رِجْلَيَّ.\nأَخْبَرَنَا حَجَّاجٌ  ، حَدَّثَنَا حَمَّادٌ  ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ  ، عَنْ كُرَيْبِ بْنِ أَبِي مُسْلِمٍ  ، عَنْ أُسَامَةَ  ، نَحْوَهُ",
    "malay_translation": "Abu Nu'aim meriwayatkan kepada kami, Zuhair meriwayatkan kepada kami, daripada Ibrahim bin Uqbah, dia berkata: Kuraib memberitahuku bahawa dia bertanya kepada Usamah bin Zaid, dia berkata: Beritahu aku pada petang ketika kamu membonceng Nabi SAW: Apa yang kamu lakukan? Dia berkata: \"Kami datang ke lurah tempat orang ramai berhenti untuk berehat, lalu Rasulullah SAW memberhentikan untanya, kemudian baginda kencing dan tidak berkata: 'Dia menuangkan air', kemudian baginda meminta air wuduk lalu berwuduk dengan wuduk yang tidak sempurna, kemudian aku berkata: Wahai Rasulullah, solat? Baginda bersabda: 'Solat di hadapanmu.' Dia berkata: Lalu baginda menunggang sehingga kami tiba di Muzdalifah, lalu baginda mendirikan solat Maghrib, kemudian baginda memberhentikan untanya sedangkan orang ramai berada di tempat masing-masing, dan mereka tidak bertahallul sehingga baginda mendirikan solat Isyak yang terakhir, lalu baginda bersolat, kemudian orang ramai bertahallul.\" Dia berkata: Aku berkata: Beritahu aku apa yang kamu lakukan ketika kamu masuk waktu pagi? Dia berkata: Al-Fadl bin Abbas memboncengnya, lalu aku pergi berlumba dengan orang Quraisy dengan berjalan kaki. Hajjaj memberitahu kami, Hammad memberitahu kami, Musa bin Uqbah memberitahu kami, daripada Kuraib bin Abi Muslim, daripada Usamah, sepertinya."
  },
  {
    "id": 38717,
    "hadith_number": 1180,
    "tajuk_hadith": "Menggabungkan Solat Maghrib dan Isyak",
    "perawi_melayu": "Abu Al-Walid meriwayatkan daripada Syu'bah, daripada 'Adi bin Thabit, katanya: Telah memberitahuku, katanya: Aku mendengar Abdullah bin Yazid, daripada Abu Ayyub, bahawa Rasulullah SAW \"menggabungkan antara Maghrib dan Isyak\" yakni: di Jam'in.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا شُعْبَةُ  ، قَالَ عَدِيُّ بْنُ ثَابِتٍ  : أَنْبَأَنِي، قَالَ : سَمِعْتُ عَبْدَ اللَّهِ بْنَ يَزِيدَ  ، عَنْ أَبِي أَيُّوبَ  ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" جَمَعَ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ \"يَعْنِي : بِجَمْعٍ",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Al-Walid, telah menceritakan kepada kami Syu'bah, 'Adi bin Thabit berkata: Telah memberitahu kepadaku, dia berkata: Aku mendengar Abdullah bin Yazid, daripada Abu Ayyub, bahawa Rasulullah SAW telah menggabungkan antara solat Maghrib dan Isyak, iaitu: di Jam'in."
  },
  {
    "id": 38718,
    "hadith_number": 1181,
    "tajuk_hadith": "Solat Maghrib dan Isyak di Muzdalifah dengan Iqamah Sahaja",
    "perawi_melayu": "Diriwayatkan oleh Ubaidullah bin Abdul Majid, daripada Ibnu Abi Dzi'b, daripada Ibnu Syihab, daripada Salim, daripada ayahnya (Abdullah bin Umar)",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ  ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ  ، عَنْ ابْنِ شِهَابٍ  ، عَنْ سَالِمٍ  ، عَنْ أَبِيهِ  ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" صَلَّى الْمَغْرِبَ وَالْعِشَاءَ بِالْمُزْدَلِفَةِ ، لَمْ يُنَادِ فِي وَاحِدَةٍ مِنْهُمَا إِلَّا بِالْإِقَامَةِ، وَلَمْ يُسَبِّحْ بَيْنَهُمَا، وَلَا عَلَى إِثْرِ وَاحِدَةٍ مِنْهُمَا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ubaidullah bin Abdul Majid, telah menceritakan kepada kami Ibnu Abi Dzi'b, daripada Ibnu Syihab, daripada Salim, daripada ayahnya, bahawa Nabi ﷺ solat Maghrib dan Isyak di Muzdalifah, tidak menyeru (azan) untuk salah satu pun daripada keduanya kecuali dengan iqamah, dan tidak bertasbih (solat sunat) di antara keduanya, dan tidak juga selepas salah satu daripadanya."
  },
  {
    "id": 38719,
    "hadith_number": 1182,
    "tajuk_hadith": "Perintah untuk Meninggalkan Jam' (Muzdalifah) pada Waktu Malam",
    "perawi_melayu": "Diriwayatkan daripada Abu Asim, daripada Ibn Juraij, daripada 'Ata', daripada Ibn Shawwal: Bahawa Ummu Habibah memberitahunya bahawa Rasulullah SAW memerintahkannya untuk meninggalkan Jam' (Muzdalifah) pada waktu malam.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ ابْنِ جُرَيْجٍ  ، عَنْ عَطَاءٍ  ، عَنْ ابْنِ شَوَّالٍ  : أَخْبَرَهُ أَنَّ أُمَّ حَبِيبَةَ   أَخْبَرَتْهُ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" أَمَرَهَا أَنْ تَنْفِرَ مِنْ جَمْعٍ بِلَيْلٍ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Asim, daripada Ibn Juraij, daripada 'Ata', daripada Ibn Shawwal: Bahawa Ummu Habibah telah mengkhabarkannya, bahawa Rasulullah SAW memerintahkannya untuk berangkat (meninggalkan Muzdalifah) dari Jam' pada waktu malam."
  },
  {
    "id": 38720,
    "hadith_number": 1183,
    "tajuk_hadith": "Siti Saudah Memohon Izin untuk Meninggalkan Muzdalifah Lebih Awal",
    "perawi_melayu": "Diriwayatkan oleh Aflah daripada Al-Qasim bin Muhammad daripada Aisyah R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ  ، حَدَّثَنَا أَفْلَحُ  ، قَالَ : سَمِعْتُ الْقَاسِمَ بْنَ مُحَمَّدٍ  يُحَدِّثُ،  عَنْ عَائِشَةَ  ، قَالَتْ : \" اسْتَأْذَنَتْ سَوْدَةُ بِنْتُ زَمْعَةَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْيَأْذَنَ لَهَا فَتَدْفَعَ قَبْلَ أَنْ يَدْفَعَ، فَأَذِنَ لَهَا \".\nقَالَ الْقَاسِمُ : وَكَانَتْ امْرَأَةً ثَبِطَةً قَالَ الْقَاسِمُ : الثَّبِطَةُ : الثَّقِيلَةُ ، فَدَفَعَتْ وَحُبِسْنَا مَعَهُ حَتَّى دَفَعْنَا بِدَفْعِهِ",
    "malay_translation": "Ubaidillah bin Abdul Majid memberitahu kami, Aflah memberitahu kami, dia berkata: Saya mendengar Al-Qasim bin Muhammad meriwayatkan daripada Aisyah R.A., dia berkata: \"Saudah binti Zam'ah meminta izin kepada Rasulullah SAW untuk dia diizinkan untuk berangkat (dari Muzdalifah) sebelum baginda berangkat, lalu baginda mengizinkannya.\"\nAl-Qasim berkata: Dia (Saudah) adalah seorang wanita yang lambat (pergerakannya). Al-Qasim berkata: 'Ath-Thabitah' bermaksud: yang berat (pergerakannya), lalu dia berangkat dan kami ditahan bersama baginda sehingga kami berangkat dengan keberangkatan baginda."
  },
  {
    "id": 38721,
    "hadith_number": 1184,
    "tajuk_hadith": "Keutamaan Meminta Izin Seperti Saudah untuk Meninggalkan Muzdalifah Lebih Awal",
    "perawi_melayu": "Aisyah RA",
    "english_text": "",
    "arabic_text": "قَالَتْ عَائِشَةُ   :\" فَلَأَنْ أَكُونَ اسْتَأْذَنْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا اسْتَأْذَنَتْ سَوْدَةُ ، فَأَدْفَعَ قَبْلَ النَّاسِ، أَحَبُّ إِلَيَّ مِنْ مَفْرُوحٍ بِهِ \"",
    "malay_translation": "Aisyah RA berkata: “Seandainya aku meminta izin kepada Rasulullah SAW sebagaimana Saudah meminta izin, lalu aku berangkat (meninggalkan Muzdalifah) sebelum orang ramai, itu lebih aku sukai daripada sesuatu yang menggembirakan.”"
  },
  {
    "id": 38722,
    "hadith_number": 1185,
    "tajuk_hadith": "Haji adalah Arafah: Kepentingan Menghadiri Arafah dan Keutamaan Malam Jam'i",
    "perawi_melayu": "Abu al-Walid al-Tayalisi, daripada Syu'bah, daripada Bukair bin Ata', daripada Abdul Rahman bin Ya'mur al-Dili",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ  ، حَدَّثَنَا شُعْبَةُ  ، حَدَّثَنَا بُكَيْرُ بْنُ عَطَاءٍ  ، قَالَ : سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ يَعْمُرَ الدِّيلِيَّ   يَقُولُ : سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْحَجِّ، فَقَالَ :\" الْحَجُّ عَرَفَاتٌ أَوْ قَالَ : عَرَفَةَ ، وَمَنْ أَدْرَكَ لَيْلَةَ جَمْعٍ قَبْلَ صَلَاةِ الصُّبْحِ، فَقَدْ أَدْرَكَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu al-Walid al-Tayalisi, telah menceritakan kepada kami Syu'bah, telah menceritakan kepada kami Bukair bin Ata', dia berkata: Saya mendengar Abdul Rahman bin Ya'mur al-Dili berkata: Nabi SAW ditanya tentang haji, lalu Baginda bersabda: \"Haji itu adalah Arafah (atau Baginda berkata: Arafah). Dan barangsiapa yang sempat (berada di Muzdalifah) pada malam Jam'i sebelum solat Subuh, maka dia telah mendapatkan (pahala) haji.\""
  },
  {
    "id": 38723,
    "hadith_number": 1186,
    "tajuk_hadith": "Keringanan Meninggalkan Mina Lebih Awal",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "وَقَالَ :\" أَيَّامُ مِنًى ثَلَاثَةُ أَيَّامٍ # فَمَنْ تَعَجَّلَ فِي يَوْمَيْنِ فَلا إِثْمَ عَلَيْهِ وَمَنْ تَأَخَّرَ فَلا إِثْمَ سورة البقرة آية 203 # \"",
    "malay_translation": "Dan Dia berfirman: \"Hari-hari di Mina adalah tiga hari. Sesiapa yang tergesa-gesa (meninggalkan Mina) dalam dua hari, maka tidak ada dosa baginya, dan sesiapa yang melambatkan (meninggalkan Mina), maka tidak ada dosa baginya.\" (Surah Al-Baqarah, ayat 203)"
  },
  {
    "id": 38724,
    "hadith_number": 1187,
    "tajuk_hadith": "Sesiapa yang Menghadiri Solat Ini di Arafah, Maka Cukup Hajinya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَعْلَى  ، حَدَّثَنَا إِسْمَاعِيل  ، عَنْ عَامِرٍ  ، عَنْ عُرْوَةَ بْنِ مُضَرِّسٍ  ، قَالَ : جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْمَوْقِفِ عَلَى رُؤُوسِ النَّاسِ، فَقَالَ : يَا رَسُولَ اللَّهِ، جِئْتُ مِنْ جَبَلَيْ طَيِّءٍ ، أَكْلَلْتُ مَطِيَّتِي : وَأَتْعَبْتُ نَفْسِي، وَاللَّهِ إِنْ بَقِيَ جَبَلٌ إِلَّا وَقَفْتُ عَلَيْهِ، فَهَلْ لِي مِنْ حَجٍّ؟ قَالَ :\" مَنْ شَهِدَ مَعَنَا هَذِهِ الصَّلَاةَ، وَقَدْ أَتَى عَرَفَاتٍ قَبْلَ ذَلِكَ لَيْلًا أَوْ نَهَارًا، فَقَدْ قَضَى تَفَثَهُ، وَتَمَّ حَجُّهُ \".\nأَخْبَرَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي السَّفَرِ  ، عَنْ الشَّعْبِيِّ  ، عَنْ عُرْوَةَ بْنِ مُضَرِّسِ بْنِ حَارِثَةَ بْنِ لَامٍ  ، قَالَ : أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَذَكَرَ نَحْوَهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Ya'la, telah menceritakan kepada kami Ismail, daripada Amir, daripada Urwah bin Mudarris, dia berkata: Seorang lelaki datang kepada Rasulullah SAW di al-Mauqif (Arafah) di hadapan orang ramai, lalu berkata: Wahai Rasulullah, aku datang dari dua gunung Tayyi', aku telah memenatkan tungganganku dan meletihkan diriku, demi Allah, tidak ada gunung yang tinggal melainkan aku telah berhenti di atasnya, adakah aku mendapat haji? Baginda bersabda: \"Sesiapa yang menyaksikan bersama kami solat ini, dan dia telah datang ke Arafah sebelum itu pada waktu malam atau siang, maka dia telah menunaikan *tafath*nya (membersihkan diri daripada larangan ihram) dan telah sempurna hajinya.\"\nTelah mengkhabarkan kepada kami Abu al-Walid, telah menceritakan kepada kami Syu'bah, daripada Abdullah bin Abi al-Safar, daripada al-Sya'bi, daripada Urwah bin Mudarris bin Harithah bin Lam, dia berkata: Aku telah datang kepada Rasulullah SAW, lalu dia menyebut seumpamanya."
  },
  {
    "id": 38725,
    "hadith_number": 1188,
    "tajuk_hadith": "Perbezaan Amalan Rasulullah SAW dengan Orang Jahiliyah di Muzdalifah",
    "perawi_melayu": "Diriwayatkan daripada 'Amru bin Maimun, daripada Umar bin al-Khattab RA, beliau berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو غَسَّانَ مَالِكُ بْنُ إِسْمَاعِيل  ، حَدَّثَنَا إِسْرَائِيلُ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ عَمْرِو بْنِ مَيْمُونٍ  ، عَنْ عُمَرَ بْنِ الْخَطَّابِ  ، قَالَ : كَانَ أَهْلُ الْجَاهِلِيَّةِ يُفِيضُونَ مِنْ جَمْعٍ بَعْدَ طُلُوعِ الشَّمْسِ، وَكَانُوا يَقُولُونَ : أَشْرِقْ ثَبِيرُ لَعَلَّنَا نُغِيرُ، وَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَالَفَهُمْ\" فَدَفَعَ قَبْلَ طُلُوعِ الشَّمْسِ بِقَدْرِ صَلَاةِ الْمُسْفِرِينَ أَوْ قَالَ : الْمُشْرِقِينَ بِصَلَاةِ الْغَدَاةِ \"",
    "malay_translation": "\"Orang-orang Jahiliyah bertolak dari Jam'i (Muzdalifah) setelah matahari terbit. Mereka berkata: 'Bersinarlah wahai Thabir, agar kita dapat menyerbu.' Sesungguhnya Rasulullah SAW menyelisihi mereka.\" Beliau bertolak sebelum matahari terbit sekadar waktu solat orang-orang yang melakukan Isfar (melambatkan) atau yang melakukan Isyraq (awal waktu) dengan solat Ghadat (Subuh)."
  },
  {
    "id": 38726,
    "hadith_number": 1189,
    "tajuk_hadith": "Anjuran Bertenang dan Tidak Tergesa-gesa Ketika di Arafah dan Muzdalifah",
    "perawi_melayu": "Diriwayatkan dari Ibnu Abbas, bahawa Nabi SAW bersabda pada petang Arafah dan pagi di Muzdalifah ketika mereka bergerak: 'Hendaklah kamu bertenang.' Baginda menahan untanya sehingga apabila memasuki Wadi Muhassir, barulah Baginda mempercepatkan perjalanannya.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاق بْنُ إِبْرَاهِيمَ  ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ  ، عَنْ ابْنِ جُرَيْجٍ  ، قَالَ : أَخْبَرَنِي أَبُو الزُّبَيْرِ  : أَنَّ أَبَا مَعْبَدٍ  مَوْلَى ابْنِ عَبَّاسٍ أَخْبَرَهُ، عَنْ ابْنِ عَبَّاسٍ  ، عَنْ الْفَضْلِ  ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ فِي عَشِيَّةِ عَرَفَةَ وَغَدَاةِ جَمْعٍ حِينَ دَفَعُوا : \" عَلَيْكُمْ السَّكِينَةَ \"،وَهُوَ كَافٌّ نَاقَتَهُ، حَتَّى إِذَا دَخَلَ وَادِي مُحَسِّرًا ، أَوْضَعَ.\nأَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا لَيْثٌ  ، عَنْ أَبِي الزُّبَيْرِ  ، بِإِسْنَادِهِ نَحْوَهُ.\nقَالَ عَبْد اللَّهِ : الْإِيضَاعُ لِلْإِبِلِ، وَالْإِيجَافُ لِلْخَيْلِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Ishaq bin Ibrahim, telah mengkhabarkan kepada kami Isa bin Yunus, daripada Ibnu Juraij, beliau berkata: Telah mengkhabarkan kepadaku Abu Zubair: bahawa Abu Ma'bad, maula Ibnu Abbas, telah mengkhabarkannya, daripada Ibnu Abbas, daripada Al-Fadhl, bahawa Nabi SAW bersabda pada petang Arafah dan pagi di Muzdalifah ketika mereka bergerak: 'Hendaklah kamu bertenang.' Baginda menahan untanya sehingga apabila memasuki Wadi Muhassir, barulah Baginda mempercepatkan perjalanannya.\nTelah mengkhabarkan kepada kami Ahmad bin Abdullah, telah menceritakan kepada kami Laith, daripada Abu Zubair, dengan isnad yang serupa dengannya.\nAbdullah berkata: 'Al-Idha' adalah untuk unta, dan Al-Ijaaf adalah untuk kuda.'"
  },
  {
    "id": 38727,
    "hadith_number": 1190,
    "tajuk_hadith": "Niat Umrah dan Haji Ketika Halangan Menuju Baitullah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ  ، حَدَّثَنَا أَبُو أُسَامَةَ  ، عَنْ عُبَيْدِ اللَّهِ  ، عَنْ نَافِعٍ  ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ، وَسَالِمًا كَلَّمَا ابْنَ عُمَرَ   لَيَالِيَ نَزَلَ الْحَجَّاجُ بِابْنِ الزُّبَيْرِ، قَبْلَ أَنْ يُقْتَلَ، فَقَالَا : لَا يَضُرُّكَ أَنْ لَا تَحُجَّ الْعَامَ، نَخَافُ أَنْ يُحَالَ بَيْنَكَ وَبَيْنَ الْبَيْتِ .\n فَقَالَ : \" قَدْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُعْتَمِرِينَ، فَحَالَ كُفَّارُ قُرَيْشٍ دُونَ الْبَيْتِ ،فَنَحَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَدْيَهُ، وَحَلَقَ رَأْسَهُ، ثُمَّ رَجَعَ، فَأُشْهِدُكُمْ أَنِّي قَدْ أَوْجَبْتُ عُمْرَةً، فَإِنْ خُلِّيَ بَيْنِي وَبَيْنَ الْبَيْتِ ، طُفْتُ، وَإِنْ حِيلَ بَيْنِي وَبَيْنَهُ، فَعَلْتُ كَمَا كَانَ فَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا مَعَهُ، فَأَهَلَّ بِالْعُمْرَةِ مِنْ ذِي الْحُلَيْفَةِ ، ثُمَّ سَارَ، فَقَالَ : إِنَّمَا شَأْنُهُمَا وَاحِدٌ، أُشْهِدُكُمْ أَنِّي قَدْ أَوْجَبْتُ حَجًّا مَعَ عُمْرَتِي.\nقَالَ نَافِعٌ : فَطَافَ لَهُمَا طَوَافًا وَاحِدًا، وَسَعَى لَهُمَا سَعْيًا وَاحِدًا، ثُمَّ لَمْ يَحِلَّ حَتَّى جَاءَ يَوْمَ النَّحْرِ فَأَهْدَى، وَكَانَ يَقُولُ : مَنْ جَمَعَ الْعُمْرَةَ وَالْحَجَّ فَأَهَلَّ بِهُمَا جَمِيعًا، فَلَا يَحِلَّ حَتَّى يَحِلَّ مِنْهُمَا جَمِيعًا يَوْمَ النَّحْرِ \"",
    "malay_translation": "Abdullah bin Sa'id memberitahu kami, Abu Usamah memberitahu kami, daripada Ubaidillah, daripada Nafi', bahawa Abdullah bin Abdullah dan Salim bercakap dengan Ibnu Umar pada malam-malam Hajjaj turun (berkemah) di Ibnu Zubair, sebelum dia dibunuh. Mereka berdua berkata: \"Tidak mengapa jika engkau tidak menunaikan haji pada tahun ini, kami khuatir engkau dihalang daripada (menuju) Baitullah.\"\n\nIbnu Umar berkata: \"Kami telah keluar bersama Rasulullah ﷺ untuk menunaikan umrah, lalu orang-orang kafir Quraisy menghalang kami daripada (menuju) Baitullah. Maka Rasulullah ﷺ menyembelih hadyu (binatang korban) baginda, mencukur rambut baginda, kemudian kembali. Aku mempersaksikan kepada kamu bahawa aku telah mewajibkan umrah ke atas diriku. Jika aku dibenarkan (menuju) Baitullah, aku akan tawaf. Jika aku dihalang daripada (menuju) Baitullah, aku akan melakukan sebagaimana yang telah dilakukan oleh Rasulullah ﷺ ketika aku bersama baginda.\" Lalu beliau berihram untuk umrah dari Dzul Hulaifah, kemudian meneruskan perjalanan. Beliau berkata: \"Sesungguhnya urusan keduanya (haji dan umrah) adalah satu.\" Aku mempersaksikan kepada kamu bahawa aku telah mewajibkan haji bersama umrahku.\"\n\nNafi' berkata: \"Maka beliau melakukan tawaf untuk kedua-duanya (haji dan umrah) dengan satu tawaf, dan sa'i untuk kedua-duanya dengan satu sa'i. Kemudian beliau tidak bertahallul sehingga tiba Hari Nahr (Hari Raya Korban), lalu beliau menyembelih hadyu. Dan beliau biasa berkata: \"Sesiapa yang menggabungkan umrah dan haji, lalu dia berihram untuk kedua-duanya sekali, maka dia tidak bertahallul sehingga dia bertahallul daripada kedua-duanya sekali pada Hari Nahr.\""
  },
  {
    "id": 38728,
    "hadith_number": 1191,
    "tajuk_hadith": "Haji Bagi Orang yang Cedera atau Lumpuh",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو عَاصِمٍ  ، عَنْ حَجَّاجٍ الصَّوَّافِ  ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ  ، عَنْ عِكْرِمَةَ  ، عَنْ الْحَجَّاجِ بْنِ عَمْرٍو الْأَنْصَارِيِّ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنْ كُسِرَ، أَوْ عُرِجَ، فَقَدْ حَلَّ، وَعَلَيْهِ حَجَّةٌ أُخْرَى \".\n قَالَ أَبُو مُحَمَّد : رَوَاهُ مُعَاوِيَةُ بْنُ سَلَّامٍ  ، وَمَعْمَرٌ  ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ  ، عَنْ عِكْرِمَةَ  ، عَنْ عَبْدِ اللَّهِ بْنِ رَافِعٍ  ، عَنْ الْحَجَّاجِ بْنِ عَمْرٍو  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
    "malay_translation": "Telah menceritakan kepada kami Abu 'Asim, daripada Hajjaj as-Sawwaf, daripada Yahya bin Abi Kathir, daripada Ikrimah, daripada al-Hajjaj bin 'Amru al-Ansari, daripada Nabi SAW, baginda bersabda: \"Sesiapa yang patah (tulangnya), atau tempang (kakinya), maka dia telah bertahallul, dan dia wajib mengerjakan haji yang lain.\"\nAbu Muhammad berkata: Diriwayatkan oleh Mu'awiyah bin Sallam, dan Ma'mar, daripada Yahya bin Abi Kathir, daripada Ikrimah, daripada Abdullah bin Rafi', daripada al-Hajjaj bin 'Amru, daripada Nabi SAW."
  },
  {
    "id": 38729,
    "hadith_number": 1192,
    "tajuk_hadith": "Melontar Jamrah pada Hari Nahr dan Selepasnya",
    "perawi_melayu": "Ubaidillah bin Musa meriwayatkan daripada Ibnu Juraij, daripada Abu Zubair, daripada Jabir RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، أَخْبَرَنَا ابْنُ جُرَيْجٍ  ، عَنْ أَبِي الزُّبَيْرِ  ، عَنْ جَابِرٍ  ، قَالَ :\" رَمَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجَمْرَةَ يَوْمَ النَّحْرِ : الضُّحَى، وَبَعْدَ ذَلِكَ عِنْدَ زَوَالِ الشَّمْسِ \"",
    "malay_translation": "Ubaidillah bin Musa telah mengkhabarkan kepada kami, Ibnu Juraij telah mengkhabarkan kepada kami, daripada Abu Zubair, daripada Jabir RA, beliau berkata: \"Rasulullah SAW melontar Jamrah pada Hari Nahr (Hari Raya Korban): pada waktu Dhuha, dan selepas itu ketika matahari tergelincir (waktu Zohor).\""
  },
  {
    "id": 38730,
    "hadith_number": 1193,
    "tajuk_hadith": "Keringanan bagi Pengembala Unta untuk Melontar Jamrah pada Hari Nahr dan Hari-hari Tasyrik",
    "perawi_melayu": "Abdullah bin Maslamah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ  ، عَنْ أَبِي الْبَدَّاحِ بْنِ عَاصِمٍ  ، عَنْ أَبِيهِ  ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \" أَرْخَصَ لِرِعَاءِ الْإِبِلِ أَنْيَرْمُوا يَوْمَ النَّحْرِ، ثُمَّ يَرْمُوا الْغَدَ وَمِنْ بَعْدِ الْغَدِ لِيَوْمَيْنِ، ثُمَّ يَرْمُوا يَوْمَ النَّفْرِ \".\nقَالَ أَبُو مُحَمَّد : مِنْهُمْ مَنْ يَقُولُ : عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ  ، عَنْ أَبِيهِ  ، عَنْ أَبِي الْبَدَّاحِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Abdullah bin Maslamah, telah menceritakan kepada kami Malik, daripada Abdullah bin Abi Bakar, daripada Abi al-Baddah bin Asim, daripada ayahnya, bahawa Rasulullah SAW memberikan keringanan kepada pengembala unta untuk melontar pada Hari Nahr, kemudian mereka melontar pada hari esoknya dan lusa selama dua hari, kemudian mereka melontar pada Hari Nafar (hari meninggalkan Mina).\nAbu Muhammad berkata: Di antara mereka ada yang mengatakan: Abdullah bin Abi Bakar, daripada ayahnya, daripada Abi al-Baddah."
  },
  {
    "id": 38731,
    "hadith_number": 1194,
    "tajuk_hadith": "Perintah Rasulullah SAW Melontar Jamrah dengan Batu Kecil",
    "perawi_melayu": "Uthman bin Umar",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُثْمَانُ بْنُ عُمَرَ  ، حَدَّثَنَا عُثْمَانُ بْنُ مُرَّةَ  ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ التَّيْمِيِّ  ، قَالَ : \" أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ أَنْنَرْمِيَ الْجَمْرَةَ بِمِثْلِ حَصَى الْخَذْفِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Uthman bin Umar, telah menceritakan kepada kami Uthman bin Murrah, daripada Abu Salamah bin Abdurrahman, daripada Abdurrahman bin Uthman at-Taimi, beliau berkata: \"Rasulullah SAW memerintahkan kami pada Haji Wada' agar kami melontar Jamrah dengan batu sebesar batu kerikil.\""
  },
  {
    "id": 38732,
    "hadith_number": 1195,
    "tajuk_hadith": "Perintah Melontar dengan Batu Kerikil dan Berjalan Tenang di Wadi Muhassir",
    "perawi_melayu": "Ubaidullah bin Musa",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، عَنْ سُفْيَانَ  ، عَنْ أَبِي الزُّبَيْرِ  ، عَنْ جَابِرٍ  ، قَالَ : \" أَمَرَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَفَرَمَوْا بِمِثْلِ حَصَى الْخَذْفِ، وَأَوْضَعَ فِي وَادِي مُحَسِّرٍ ، وَقَالَ : عَلَيْكُمْ السَّكِينَةَ \"",
    "malay_translation": "Ubaidullah bin Musa mengkhabarkan kepada kami, daripada Sufyan, daripada Abu al-Zubair, daripada Jabir, dia berkata: \"Rasulullah SAW memerintahkan mereka, lalu mereka melontar dengan seperti batu kerikil kecil, dan Baginda mempercepatkan langkah di Wadi Muhassir, dan bersabda: 'Hendaklah kamu semua bertenang.'"
  },
  {
    "id": 38733,
    "hadith_number": 1196,
    "tajuk_hadith": "Arahan Rasulullah SAW Mengenai Saiz Batu untuk Melontar Jamrah",
    "perawi_melayu": "Diriwayatkan daripada 'Amru bin 'Aun, daripada Khalid, daripada Humaid al-A'raj, daripada Muhammad bin Ibrahim, daripada 'Abd al-Rahman bin Mu'adh RA bahawa Rasulullah SAW memerintahkan kami untuk melontar Jamrah dengan batu sebesar batu kecil yang dilontar dengan jari.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ  ، أَخْبَرَنَا خَالِدٌ  ، عَنْ حُمَيْدٍ الْأَعْرَجِ  ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ مُعَاذٍ  ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُنَا أَنْ\" نَرْمِيَ الْجِمَارَ بِمِثْلِ حَصَى الْخَذْفِ \".\nقِيلَ لِأَبِي مُحَمَّدٍ : عَبْدُ الرَّحْمَنِ بْنُ مُعَاذٍ لَهُ صُحْبَةٌ؟ قَالَ : نَعَمْ",
    "malay_translation": "Telah mengkhabarkan kepada kami 'Amru bin 'Aun, telah mengkhabarkan kepada kami Khalid, daripada Humaid al-A'raj, daripada Muhammad bin Ibrahim, daripada 'Abd al-Rahman bin Mu'adh, bahawa Rasulullah SAW memerintahkan kami untuk melontar Jamrah dengan (batu) seperti batu lontaran kecil. Ditanyakan kepada Abu Muhammad: Adakah 'Abd al-Rahman bin Mu'adh seorang Sahabat? Beliau menjawab: Ya."
  },
  {
    "id": 38734,
    "hadith_number": 1197,
    "tajuk_hadith": "Rasulullah SAW Melontar Jamrah di Atas Unta",
    "perawi_melayu": "Abu 'Asim, al-Mu'ammal, dan Abu Nu'aim meriwayatkan daripada Aiman bin Nabil, daripada Qudamah bin Abdullah bin Ammar al-Kilabi",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، وَالْمُؤَمَّلُ  ، وَأَبُو نُعَيْمٍ  ، عَنْ أَيْمَنَ بْنِ نَابِلٍ  ، عَنْ قُدَامَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَمَّارٍ الْكِلَابِيِّ  ، قَالَ : \" رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَيَرْمِي الْجِمَارَ عَلَى نَاقَةٍ صَهْبَاءَ لَيْسَ ثَمَّ ضَرْبٌ، وَلَا طَرْدٌ، وَلَا إِلَيْكَ إِلَيْكَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu 'Asim, al-Mu'ammal, dan Abu Nu'aim, daripada Aiman bin Nabil, daripada Qudamah bin Abdullah bin Ammar al-Kilabi, beliau berkata: \"Aku melihat Rasulullah SAW melontar jamrah di atas unta kemerah-merahan, tidak ada pukulan, tidak ada halauan, dan tidak ada 'ke arahmu, ke arahmu'."
  },
  {
    "id": 38735,
    "hadith_number": 1198,
    "tajuk_hadith": "Rasulullah SAW Terus Bertalbiah Sehingga Melontar Jamrah",
    "perawi_melayu": "Diriwayatkan daripada al-Fadl, katanya:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا زَكَرِيَّا بْنُ عَدِيٍّ  ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو  ، عَنْ عَبْدِ الْكَرِيمِ هُوَ الْجَزَرِيُّ  ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، عَنْ الْفَضْلِ  ، قَالَ : كُنْتُ رِدْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \" فَلَمْ يَزَلْيُلَبِّي حَتَّى رَمَى الْجَمْرَةَ \"",
    "malay_translation": "Zakaria bin Adiy telah mengkhabarkan kepada kami, Ubaidullah bin Amru telah menceritakan kepada kami, daripada Abdul Karim iaitu al-Jazari, daripada Said bin Jubair, daripada Ibnu Abbas, daripada al-Fadl, katanya: “Saya membonceng Rasulullah SAW, dan baginda terus bertalbiah sehingga melontar Jamrah.”"
  },
  {
    "id": 38736,
    "hadith_number": 1199,
    "tajuk_hadith": "Cara Rasulullah SAW Melontar Jamrah dan Berdoa",
    "perawi_melayu": "Uthman bin Umar",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُثْمَانُ بْنُ عُمَرَ  ، أَخْبَرَنَا يُونُسُ  ، عَنْ الزُّهْرِيِّ  ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ\" إِذَا رَمَى الْجَمْرَةَ الَّتِي تَلِي الْمَسْجِدَ مَسْجِدَ مِنًى ، يَرْمِيهَا بِسَبْعِ حَصَيَاتٍ يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ، ثُمَّ تَقَدَّمَ أَمَامَهَا فَوَقَفَ مُسْتَقْبِلَ الْقِبْلَةِ رَافِعًا يَدَيْهِ، وَكَانَ يُطِيلُ الْوُقُوفَ، ثُمَّ يَأْتِي الْجَمْرَةَ الثَّانِيَةَ فَيَرْمِيهَا بِسَبْعِ حَصَيَاتٍ يُكَبِّرُ كُلَّمَا رَمَى بِحَصَاةٍ، ثُمَّ يَنْحَدِرُ مِنْ ذَاتِ الْيَسَارِ مِمَّا يَلِي الْوَادِي رَافِعًا يَدَيْهِ يَدْعُو، ثُمَّ يَأْتِي الْجَمْرَةَ الَّتِي عِنْدَ الْعَقَبَةِ، فَيَرْمِيهَا بِسَبْعِ حَصَيَاتٍ، يُكَبِّرُ كُلَّمَا رَمَى بِحَصَاةٍ، ثُمَّ يَنْصَرِفُ وَلَا يَقِفُ عِنْدَهَا \".\nقَالَ الزُّهْرِيُّ : سَمِعْتُ سَالِمَ بْنَ عَبْدِ اللَّهِ  يُحَدِّثُ بِهَذَا الْحَدِيثِ، عَنْ أَبِيهِ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ : وَكَانَ ابْنُ عُمَرَ يَفْعَلُهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Uthman bin Umar, telah mengkhabarkan kepada kami Yunus, daripada al-Zuhri, bahawa Rasulullah SAW, apabila melontar Jamrah yang berdekatan dengan Masjid Mina, baginda melontarnya dengan tujuh biji batu kecil sambil bertakbir setiap kali melontar satu batu. Kemudian baginda maju ke hadapan dan berdiri menghadap kiblat, mengangkat kedua-dua tangannya, dan baginda memanjangkan tempoh berdiri tersebut. Kemudian baginda datang ke Jamrah kedua dan melontarnya dengan tujuh biji batu kecil sambil bertakbir setiap kali melontar satu batu. Kemudian baginda turun dari sebelah kiri, dari arah yang berdekatan dengan lembah, mengangkat kedua-dua tangannya berdoa. Kemudian baginda datang ke Jamrah yang berada di Aqabah, dan melontarnya dengan tujuh biji batu kecil, bertakbir setiap kali melontar satu batu, kemudian baginda berpaling dan tidak berhenti di situ.\nAl-Zuhri berkata: Saya mendengar Salim bin Abdullah menceritakan Hadith ini, daripada ayahnya, daripada Nabi SAW. Beliau berkata: Dan Ibnu Umar melakukannya."
  },
  {
    "id": 38737,
    "hadith_number": 1200,
    "tajuk_hadith": "Menunaikan Haji dan Penyembelihan Lembu bagi Pihak Isteri",
    "perawi_melayu": "Abu Nu'aim, daripada Abdul Aziz al-Majishun, daripada Abdurrahman bin al-Qasim, daripada al-Qasim, daripada Aisyah R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا عَبْدُ الْعَزِيزِ هُوَ الْمَاجِشُونُ  ، عَنْ عَبْدِ الرَّحْمَنِ هُوَ ابْنُ الْقَاسِمِ  ، عَنْ الْقَاسِمِ  ، عَنْ عَائِشَةَ  ، قَالَتْ : خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْكُرُ إِلَّا الْحَجَّ، فَلَمَّا جِئْنَا سَرِفَ ، طَمِثْتُ، فَلَمَّا كَانَ يَوْمُ النَّحْرِ، طَهُرْتُ، فَأَرْسَلَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَفَضْتُ، فَأُتِيَ بِلَحْمِ بَقَرٍ، فَقُلْتُ : مَا هَذَا؟ قَالُوا :\" أَهْدَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نِسَائِهِ الْبَقَرَةَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Nu'aim, telah menceritakan kepada kami Abdul Aziz iaitu al-Majishun, daripada Abdurrahman iaitu Ibnu al-Qasim, daripada al-Qasim, daripada Aisyah R.A., beliau berkata: Kami keluar bersama Rasulullah SAW dan tidak menyebut kecuali haji. Ketika kami tiba di Sarif, aku mengalami haid. Ketika tiba hari Nahr (sembelihan), aku telah suci. Rasulullah SAW mengutusku dan aku melakukan tawaf Ifadah. Kemudian dibawakan daging lembu kepada baginda, lalu aku bertanya: 'Apa ini?' Mereka menjawab: 'Rasulullah SAW telah menghadiahkan (menyembelih) lembu bagi pihak isteri-isterinya.'"
  },
  {
    "id": 38738,
    "hadith_number": 1201,
    "tajuk_hadith": "Larangan Mencukur Rambut Bagi Wanita dan Kewajipan Memendekkannya",
    "perawi_melayu": "Diriwayatkan oleh Ali bin Abdullah al-Madini, daripada Hisham bin Yusuf, daripada Ibnu Juraij, daripada Abdul Hamid bin Jubair, daripada Safiyyah binti Shaibah, daripada Ummu Uthman binti Abi Sufyan, bahawa Ibnu Abbas RA berkata",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ الْمَدِينِيُّ  ، حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ  ، حَدَّثَنَا ابْنُ جُرَيْجٍ  ، أَخْبَرَنِي عَبْدُ الْحَمِيدِ بْنُ جُبَيْرٍ  ، عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ  ، قَالَتْ : أَخْبَرَتْنِي أُمُّ عُثْمَانَ بِنْتُ أَبِي سُفْيَانَ  ، أَنَّ ابْنَ عَبَّاسٍ   قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَيْسَ عَلَى النِّسَاءِ حَلْقٌ، إِنَّمَا عَلَى النِّسَاءِ التَّقْصِيرُ \"",
    "malay_translation": "Ali bin Abdullah al-Madini memberitahu kami, Hisham bin Yusuf menceritakan kepada kami, Ibnu Juraij menceritakan kepada kami, Abdul Hamid bin Jubair memberitahu saya, daripada Safiyyah binti Shaibah, katanya: Ummu Uthman binti Abi Sufyan memberitahu saya, bahawa Ibnu Abbas RA berkata: Rasulullah SAW bersabda: \"Tidak ada (kewajipan) mencukur rambut bagi wanita, sesungguhnya bagi wanita hanyalah memendekkan (rambut).\""
  },
  {
    "id": 38739,
    "hadith_number": 1202,
    "tajuk_hadith": "Keutamaan Mencukur Rambut dalam Haji dan Umrah",
    "perawi_melayu": "Diriwayatkan daripada Ibnu Umar RA, bahawa Nabi SAW bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ عُبَيْدِ اللَّهِ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : أَنَّهُ قَالَ :\" رَحِمَ اللَّهُ الْمُحَلِّقِينَ \".\nقِيلَ : وَالْمُقَصِّرِينَ؟ قَالَ : \" رَحِمَ اللَّهُ الْمُحَلِّقِينَ \".\nقَالَ فِي الرَّابِعَةِ : \" وَالْمُقَصِّرِينَ \"",
    "malay_translation": "Muhammad bin Yusuf mengkhabarkan kepada kami, Sufyan meriwayatkan kepada kami, daripada Ubaidullah, daripada Nafi', daripada Ibnu Umar, daripada Nabi SAW, bahawa Baginda bersabda: “Allah merahmati orang-orang yang mencukur rambut mereka.”\nDitanyakan: “Dan orang-orang yang memendekkan rambut?” Baginda bersabda: “Allah merahmati orang-orang yang mencukur rambut mereka.”\nPada kali keempat Baginda bersabda: “Dan (Allah merahmati) orang-orang yang memendekkan rambut.”"
  },
  {
    "id": 38740,
    "hadith_number": 1203,
    "tajuk_hadith": "Menyembelih Sebelum Melontar Jamrah: Tidak Mengapa",
    "perawi_melayu": "Diriwayatkan daripada Abdullah bin 'Amr RA, beliau berkata: Aku melihat Rasulullah SAW di Jamrah, dan Baginda ditanya. Seorang lelaki berkata: Wahai Rasulullah, aku telah menyembelih sebelum aku melontar? Baginda bersabda: \"Melontarlah dan tidak mengapa.\"",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا عَبْدُ الْعَزِيزِ هُوَ ابْنُ أَبِي سَلَمَةَ الْمَاجِشُونُ  ، عَنْ الزُّهْرِيِّ  ، عَنْ عِيسَى بْنِ طَلْحَةَ  ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو  ، قَالَ : رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ الْجَمْرَةِ وَهُوَ يُسْأَلُ، فَقَالَ رَجُلٌ : يَا رَسُولَ اللَّهِ، نَحَرْتُ قَبْلَ أَنْ أَرْمِيَ؟ قَالَ :\" ارْمِ وَلَا حَرَجَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Nu'aim, telah menceritakan kepada kami Abdul Aziz iaitu Ibnu Abi Salamah al-Majisyun, daripada az-Zuhri, daripada Isa bin Talhah, daripada Abdullah bin 'Amr RA, beliau berkata: Aku melihat Rasulullah SAW di Jamrah, dan Baginda ditanya. Seorang lelaki berkata: Wahai Rasulullah, aku telah menyembelih sebelum aku melontar? Baginda bersabda: \"Melontarlah dan tidak mengapa.\""
  },
  {
    "id": 38741,
    "hadith_number": 1204,
    "tajuk_hadith": "Kemudahan dalam Melaksanakan Ibadah Haji",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "قَالَ آخَرُ : يَا رَسُولَ اللَّهِ، حَلَقْتُ قَبْلَ أَنْ أَنْحَرَ؟ قَالَ :\" انْحَرْ وَلَا حَرَجَ \".\nقَالَ : فَمَا سُئِلَ عَنْ شَيْءٍ قُدِّمَ وَلَا أُخِّرَ إِلَّا قَالَ : \" افْعَلْ وَلَا حَرَجَ \"",
    "malay_translation": "Seorang lain berkata: “Wahai Rasulullah, saya bercukur sebelum menyembelih?” Baginda bersabda: “Sembelihlah dan tidak mengapa.”\n\nBeliau (perawi) berkata: Maka tidaklah Baginda ditanya tentang sesuatu yang didahulukan atau diakhirkan, melainkan Baginda bersabda: “Lakukanlah dan tidak mengapa.”"
  },
  {
    "id": 38742,
    "hadith_number": 1205,
    "tajuk_hadith": "Menyempurnakan Ibadah Haji: Tidak Mengapa Mendahulukan Bercukur Sebelum Menyembelih",
    "perawi_melayu": "Diriwayatkan oleh Musaddad, daripada Yahya, daripada Malik bin Anas, daripada Az-Zuhri, daripada Isa bin Talhah, daripada Abdullah bin Amr, bahawa Rasulullah SAW berhenti untuk orang ramai pada Haji Wada'. Seorang lelaki bertanya kepada Baginda: 'Wahai Rasulullah, saya bercukur sebelum saya menyembelih?' Baginda bersabda: 'Tidak mengapa'.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُسَدَّدٌ  ، حَدَّثَنَا يَحْيَى  ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ  ، حَدَّثَنَا الزُّهْرِيُّ  ، عَنْ عِيسَى بْنِ طَلْحَةَ  ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَفَ لِلنَّاسِ فِي حَجَّةِ الْوَدَاعِ، فَقَالَ لَهُ رَجُلٌ : يَا رَسُولَ اللَّهِ،حَلَقْتُ قَبْلَ أَنْ أَذْبَحَ؟ قَالَ : \" لَا حَرَجَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Musaddad, telah menceritakan kepada kami Yahya, telah menceritakan kepada kami Malik bin Anas, telah menceritakan kepada kami Az-Zuhri, daripada Isa bin Talhah, daripada Abdullah bin Amr, bahawa Rasulullah SAW berhenti untuk orang ramai pada Haji Wada'. Seorang lelaki berkata kepada Baginda: 'Wahai Rasulullah, saya bercukur sebelum saya menyembelih?' Baginda bersabda: 'Tidak mengapa'."
  },
  {
    "id": 38743,
    "hadith_number": 1206,
    "tajuk_hadith": "Kemudahan dalam Melakukan Ibadah Haji",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "قَالَ : لَمْ أَشْعُرْ،ذَبَحْتُ قَبْلَ أَنْ أَرْمِيَ؟ قَالَ : \" لَا حَرَجَ \".\nفَلَمْ يُسْأَلْ يَوْمَئِذٍ عَنْ شَيْءٍ قُدِّمَ أَوْ أُخِّرَ إِلَّا قَالَ : \" لَا حَرَجَ \".\nقَالَ عَبْد اللَّهِ : أَنَا أَقُولُ بِهَذَا، وَأَهْلُ الْكُوفَةِ يُشَدِّدُونَ",
    "malay_translation": "Dia berkata: “Saya tidak sedar, saya telah menyembelih sebelum melontar?” Baginda bersabda: “Tidak mengapa (tiada halangan).” Pada hari itu, Baginda tidak ditanya tentang sesuatu yang didahulukan atau diakhirkan melainkan Baginda bersabda: “Tidak mengapa (tiada halangan).” Abdullah berkata: “Saya berpendapat demikian, tetapi penduduk Kufah memberatkan (memperketatkan).”"
  },
  {
    "id": 38744,
    "hadith_number": 1207,
    "tajuk_hadith": "Cara Menguruskan Haiwan Korban yang Sakit",
    "perawi_melayu": "Abdul Wahhab bin Said, daripada Syuaib bin Ishaq, daripada Hisyam bin Urwah, daripada bapanya, daripada Najiyah al-Aslami",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ الْوَهَّابِ بْنُ سَعِيدٍ  ، حَدَّثَنَا شُعَيْبُ بْنُ إِسْحَاق  ، عَنْ هِشَامِ بْنِ عُرْوَةَ  ، عَنْ أَبِيهِ  ، عَنْ نَاجِيَةَ الْأَسْلَمِيِّ   صَاحِبِ هَدْيِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ : سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : كَيْفَ أَصْنَعُ بِمَا عَطِبَ مِنْ الْهَدْيِ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" كُلُّ بَدَنَةٍ عَطِبَتْ فَانْحَرْهَا، ثُمَّ أَلْقِ نَعْلَهَا فِي دَمِهَا، ثُمَّ خَلِّ بَيْنَهَا وَبَيْنَ النَّاسِ فَلْيَأْكُلُوهَا \".\nأَخْبَرَنَا مُحَمَّدُ بْنُ سَعِيدٍ  ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ  ، عَنْ هِشَامِ بْنِ عُرْوَةَ  ، عَنْ أَبِيهِ  ، عَنْ نَاجِيَةَ  ، نَحْوَهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Abdul Wahhab bin Said, telah menceritakan kepada kami Syuaib bin Ishaq, daripada Hisyam bin Urwah, daripada bapanya, daripada Najiyah al-Aslami, sahabat yang menjaga haiwan korban Rasulullah SAW, beliau berkata: Aku bertanya Rasulullah SAW: Bagaimana aku harus melakukan dengan haiwan korban yang sakit? Rasulullah SAW bersabda: \"Setiap unta yang sakit, sembelihlah ia, kemudian celupkan sandalnya ke dalam darahnya, kemudian biarkan antara ia dan orang ramai, biarkan mereka memakannya.\" Telah mengkhabarkan kepada kami Muhammad bin Said, telah menceritakan kepada kami Hafs bin Ghiath, daripada Hisyam bin Urwah, daripada bapanya, daripada Najiyah, dengan sanad yang serupa."
  },
  {
    "id": 38745,
    "hadith_number": 1208,
    "tajuk_hadith": "Rasulullah SAW Memberi Hadiah Kambing",
    "perawi_melayu": "Ya'la bin Ubaid dan Abu Nu'aim meriwayatkan daripada Al-A'mash, daripada Ibrahim, daripada Al-Aswad, daripada Aisyah R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَعْلَى بْنُ عُبَيْدٍ  ، وَأَبُو نُعَيْمٍ  ، قَالَا : حَدَّثَنَا الْأَعْمَشُ  ، عَنْ إِبْرَاهِيمَ  ، عَنْ الْأَسْوَدِ  ، عَنْ عَائِشَةَ  ، قَالَتْ :\" أَهْدَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّةً غَنَمًا \"",
    "malay_translation": "Ya'la bin Ubaid dan Abu Nu'aim memberitahu kami, mereka berkata: Al-A'mash menceritakan kepada kami, daripada Ibrahim, daripada Al-Aswad, daripada Aisyah R.A., beliau berkata: \"Rasulullah SAW pernah memberi hadiah kambing.\""
  },
  {
    "id": 38746,
    "hadith_number": 1209,
    "tajuk_hadith": "Rasulullah SAW Menunaikan Solat Zuhur di Dzul Hulaifah dan Menyembelih Unta Korban",
    "perawi_melayu": "Abu al-Walid al-Tayalisi",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ قَتَادَةَ  ، قَالَ : سَمِعْتُ أَبَا حَسَّانَ  يُحَدِّثُ، عَنْ ابْنِ عَبَّاسٍ  ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" صَلَّى الظُّهْرَ بِذِي الْحُلَيْفَةِ ، ثُمَّ دَعَا بِبَدَنَةٍ فَأَشْعَرَهَا مِنْ صَفْحَةِ سَنَامِهَا الْأَيْمَنِ، ثُمَّ سَلَتَ الدَّمَ عَنْهَا وَقَلَّدَهَا نَعْلَيْنِ، ثُمَّ أُتِيَ بِرَاحِلَتِهِ، فَلَمَّا قَعَدَ عَلَيْهَا وَاسْتَوَتْ عَلَى الْبَيْدَاءِ، أَهَلَّ بِالْحَجِّ \"",
    "malay_translation": "Abu al-Walid al-Tayalisi memberitahu kami, Syu'bah menceritakan kepada kami, daripada Qatadah, dia berkata: Saya mendengar Abu Hassan menceritakan, daripada Ibn Abbas, bahawa Rasulullah SAW menunaikan solat Zuhur di Dzul Hulaifah, kemudian baginda meminta seekor unta korban lalu menandakannya di bahagian kanan bonggolnya. Kemudian baginda membersihkan darah daripadanya dan mengalungkan dua terompah padanya. Kemudian baginda didatangkan dengan kenderaannya, dan apabila baginda duduk di atasnya dan ia berdiri tegak di atas al-Baida', baginda bertalbiah untuk haji."
  },
  {
    "id": 38747,
    "hadith_number": 1210,
    "tajuk_hadith": "Menunggang Unta Korban (Badanah) Bagi Yang Memerlukan",
    "perawi_melayu": "Abu An-Nadr Hasyim bin Al-Qasim meriwayatkan daripada Syu'bah, yang berkata: Qatadah memberitahu saya, dia berkata: Saya mendengar Anas meriwayatkan daripada Rasulullah SAW bahawa baginda tiba kepada seorang lelaki yang sedang menghalau untanya. Baginda bersabda: \"Tungganglah ia.\"",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو النَّضْرِ هَاشِمُ بْنُ الْقَاسِمِ  ، حَدَّثَنَا شُعْبَةُ  ، قَالَ : قَتَادَةُ  أَخْبَرَنِي، قَالَ : سَمِعْتُ أَنَسًا   يُحَدِّثُ، عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، أَنَّهُ انْتَهَى إِلَى رَجُلٍ يَسُوقُ بَدَنَتَهُ، قَالَ :\" ارْكَبْهَا \".\nقَالَ : إِنَّهَا بَدَنَةٌ.\nقَالَ : \" ارْكَبْهَا \".\nقَالَ : إِنَّهَا بَدَنَةٌ، قَالَ : \" ارْكَبْهَا وَيْحَكَ ! \"",
    "malay_translation": "Abu An-Nadr Hasyim bin Al-Qasim telah meriwayatkan kepada kami, Syu'bah telah menceritakan kepada kami, dia berkata: Qatadah telah memberitahu saya, dia berkata: Saya mendengar Anas meriwayatkan daripada Rasulullah SAW, bahawa baginda tiba kepada seorang lelaki yang sedang menghalau unta korbannya. Baginda bersabda: \"Tungganglah ia.\"\nLelaki itu berkata: \"Ini adalah unta korban (badanah).\"\nBaginda bersabda: \"Tungganglah ia.\"\nLelaki itu berkata: \"Ini adalah unta korban (badanah).\" Baginda bersabda: \"Tungganglah ia, celakalah kamu!\""
  },
  {
    "id": 38748,
    "hadith_number": 1211,
    "tajuk_hadith": "Menghantar Unta Qurban dalam Keadaan Berdiri dan Terikat",
    "perawi_melayu": "Muhammad bin Yusuf",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ يُونُسَ بْنِ عُبَيْدٍ  ، عَنْ زِيَادِ بْنِ جُبَيْرٍ  ،  عَنْ ابْنِ عُمَرَ  ، أَنَّهُ رَأَى رَجُلًا قَدْ أَنَاخَ بَدَنَةً، فَقَالَ :\" ابْعَثْهَا قِيَامًا مُقَيَّدَةً، سُنَّةَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \"",
    "malay_translation": "Muhammad bin Yusuf mengkhabarkan kepada kami, Sufyan menceritakan kepada kami, daripada Yunus bin Ubaid, daripada Ziyad bin Jubair, daripada Ibn Umar, bahawa dia melihat seorang lelaki telah menghentikan (menundukkan) seekor unta qurban. Lalu Ibn Umar berkata: “Hantarkan (sembelihlah) unta itu dalam keadaan berdiri dan terikat, (itulah) sunnah Muhammad ﷺ.”"
  },
  {
    "id": 38749,
    "hadith_number": 1212,
    "tajuk_hadith": "Pengutusan Abu Bakar dan Ali dalam Haji dan Pembacaan Surah Bara'ah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاق بْنُ إِبْرَاهِيمَ  ، قَالَ : قَرَأْتُ عَلَى أَبِي قُرَّةَ : هُوَ مُوسَى بْنُ طَارِقٍ  ، عَنْ ابْنِ جُرَيْجٍ  ، قَالَ : حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عُثْمَانَ بْنِ خُثَيْمٍ  ، عَنْ أَبِي الزُّبَيْرِ  ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ  ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ رَجَعَ مِنْ عُمْرَةِ الْجِعْرَانَةِ ، بَعَثَ أَبَا بَكْرٍ عَلَى الْحَجِّ، فَأَقْبَلْنَا مَعَهُ حَتَّى إِذَا كُنَّا بِالْعَرْجِ ثُوِّبَ بِالصُّبْحِ، فَلَمَّا اسْتَوَى لِيُكَبِّرَ، سَمِعَ الرَّغْوَةَ خَلْفَ ظَهْرِهِ، فَوَقَفَ عَنْ التَّكْبِيرِ، فَقَالَ : هَذِهِ رَغْوَةُ نَاقَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجَدْعَاءِ، لَقَدْ بَدَا لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْحَجِّ، فَلَعَلَّهُ أَنْ يَكُونَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنُصَلِّيَ مَعَهُ، فَإِذَا عَلِيٌّ عَلَيْهَا، فَقَالَ أَبُو بَكْرٍ : أَمِيرٌ أَمْ رَسُولٌ؟ قَالَ : لَا، بَلْ رَسُولٌ،\" أَرْسَلَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِبَرَاءَةٌ أَقْرَؤُهَا عَلَى النَّاسِ فِي مَوَاقِفِ الْحَجِّ \".\nفَقَدِمْنَا مَكَّةَ ، فَلَمَّا كَانَ قَبْلَ التَّرْوِيَةِ بِيَوْمٍ، قَامَ أَبُو بَكْرٍ فَخَطَبَ النَّاسَ، فَحَدَّثَهُمْ عَنْ مَنَاسِكِهِمْ حَتَّى إِذَا فَرَغَ، قَامَ عَلِيٌّ فَقَرَأَ عَلَى النَّاسِ بَرَاءَةٌ حَتَّى خَتَمَهَا.\nثُمَّ خَرَجْنَا مَعَهُ حَتَّى إِذَا كَانَ يَوْمُ عَرَفَةَ ، قَامَ أَبُو بَكْرٍ فَخَطَبَ النَّاسَ، فَحَدَّثَهُمْ عَنْ مَنَاسِكِهِمْ، حَتَّى إِذَا فَرَغَ، قَامَ عَلِيٌّ فَقَرَأَ عَلَى النَّاسِ بَرَاءَةٌ حَتَّى خَتَمَهَا.\nثُمَّ كَانَ يَوْمُ النَّحْرِ فَأَفَضْنَا، فَلَمَّا رَجَعَ أَبُو بَكْرٍ خَطَبَ النَّاسَ، فَحَدَّثَهُمْ عَنْ إِفَاضَتِهِمْ، وَعَنْ نَحْرِهِمْ، وَعَنْ مَنَاسِكِهِمْ، فَلَمَّا فَرَغَ، قَامَ عَلِيٌّ فَقَرَأَ عَلَى النَّاسِ بَرَاءَةٌ حَتَّى خَتَمَهَا، فَلَمَّا كَانَ يَوْمُ النَّفْرِ الْأَوَّلُ، قَامَ أَبُو بَكْرٍ فَخَطَبَ النَّاسَ، فَحَدَّثَهُمْ كَيْفَ يَنْفِرُونَ، وَكَيْفَ يَرْمُونَ، فَعَلَّمَهُمْ مَنَاسِكَهُمْ، فَلَمَّا فَرَغَ، قَامَ عَلِيٌّ فَقَرَأَ بَرَاءَةٌ عَلَى النَّاسِ حَتَّى خَتَمَهَا",
    "malay_translation": "Telah mengkhabarkan kepada kami Ishaq bin Ibrahim, dia berkata: Saya telah membaca di hadapan Abu Qurrah: iaitu Musa bin Tariq, daripada Ibnu Juraij, dia berkata: Telah menceritakan kepadaku Abdullah bin Uthman bin Khuthaiim, daripada Abu Zubair, daripada Jabir bin Abdullah, bahawa Nabi SAW ketika kembali dari Umrah Ji'ranah, mengutuskan Abu Bakar untuk menunaikan haji. Kami pun pergi bersamanya sehingga apabila kami berada di Al-'Arj, dilaungkan iqamah untuk solat Subuh. Ketika dia telah bersedia untuk bertakbir, dia mendengar suara unta di belakangnya, maka dia berhenti daripada bertakbir, lalu berkata: Ini adalah suara unta Rasulullah SAW, Al-Jad'a'. Sesungguhnya telah jelas bagi Rasulullah SAW mengenai haji, dan mungkin Rasulullah SAW akan datang lalu kita solat bersamanya. Tiba-tiba, Ali berada di atasnya. Abu Bakar bertanya: 'Adakah engkau seorang amir atau rasul?' Dia menjawab: 'Tidak, bahkan seorang rasul. Rasulullah SAW telah mengutuskan aku dengan Surah Bara'ah untuk aku bacakan kepada orang ramai di tempat-tempat haji.'\n\nKami tiba di Makkah, dan apabila tiba sehari sebelum hari Tarwiyah, Abu Bakar berdiri dan berkhutbah kepada orang ramai, lalu memberitahu mereka tentang manasik (tatacara) haji mereka sehingga selesai. Kemudian Ali berdiri dan membacakan Surah Bara'ah kepada orang ramai sehingga selesai.\n\nKemudian kami keluar bersamanya sehingga apabila tiba hari Arafah, Abu Bakar berdiri dan berkhutbah kepada orang ramai, lalu memberitahu mereka tentang manasik haji mereka, sehingga selesai. Kemudian Ali berdiri dan membacakan Surah Bara'ah kepada orang ramai sehingga selesai.\n\nKemudian tiba hari Nahr (sembelihan), lalu kami berifadhah (bergerak dari Arafah ke Muzdalifah). Apabila Abu Bakar kembali, dia berkhutbah kepada orang ramai, lalu memberitahu mereka tentang ifadhah mereka, tentang sembelihan mereka, dan tentang manasik mereka. Apabila selesai, Ali berdiri dan membacakan Surah Bara'ah kepada orang ramai sehingga selesai. Apabila tiba hari Nafar Awal (hari pertama meninggalkan Mina), Abu Bakar berdiri dan berkhutbah kepada orang ramai, lalu memberitahu mereka bagaimana mereka bergerak (meninggalkan Mina), dan bagaimana mereka melontar (jamrah), lalu mengajarkan mereka manasik mereka. Apabila selesai, Ali berdiri dan membacakan Surah Bara'ah kepada orang ramai sehingga selesai."
  },
  {
    "id": 38750,
    "hadith_number": 1213,
    "tajuk_hadith": "Kehormatan Nyawa, Harta, dan Maruah pada Hari Nahr",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو حَاتِمٍ أَشْهَلُ بْنُ حَاتِمٍ  ، حَدَّثَنَا ابْنُ عَوْنٍ  ، عَنْ مُحَمَّدٍ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ  ، عَنْ أَبِيهِ  ، قَالَ : لَمَّا كَانَ ذَلِكَ الْيَوْمُ، قَعَدَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى بَعِيرٍ لَا أَدْرِي جَمَلٌ أَوْ نَاقَةٌ، وَأَخَذَ إِنْسَانٌ بِخِطَامِهِ أَوْ قَالَ : بِزِمَامِهِ ، فَقَالَ : \" أَيُّ يَوْمٍ هَذَا؟ \" قَالَ : فَسَكَتْنَا حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ سِوَى اسْمِهِ، فَقَالَ : \" أَلَيْسَ يَوْمَ النَّحْرِ؟ \" قُلْنَا : بَلَى.\nقَالَ : \" فَأَيُّ شَهْرٍ هَذَا؟ \" قَالَ : فَسَكَتْنَا حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ سِوَى اسْمِهِ، فَقَالَ : \" أَلَيْسَ ذُو الْحِجَّةِ؟ \".\nقُلْنَا : بَلَى.\nقَالَ : \" فَأَيُّ بَلَدٍ هَذَا؟ \".\nقَالَ : فَسَكَتْنَا حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ سِوَى اسْمِهِ، فَقَالَ : \" أَلَيْسَ الْبَلْدَةَ؟ \".\nقُلْنَا : بَلَى.\nقَالَ : \" فَإِنَّدِمَاءَكُمْ وَأَمْوَالَكُمْ وَأَعْرَاضَكُمْ بَيْنَكُمْ حَرَامٌ كَحُرْمَةِ يَوْمِكُمْ هَذَا، فِي شَهْرِكُمْ هَذَا، فِي بَلَدِكُمْ هَذَا، أَلَا لِيُبَلِّغْ الشَّاهِدُ الْغَائِبَ، فَإِنَّ الشَّاهِدَ عَسَى أَنْ يُبَلِّغَ مَنْ هُوَ أَوْعَى مِنْهُ \"",
    "malay_translation": "Abu Hatim Ash'hal bin Hatim mengkhabarkan kepada kami, Ibn Aun menceritakan kepada kami, daripada Muhammad, daripada Abdurrahman bin Abi Bakrah, daripada ayahnya, dia berkata: Ketika tiba hari itu, Nabi SAW duduk di atas seekor unta, saya tidak tahu apakah ia unta jantan atau betina, dan seseorang memegang tali kendalinya, atau dia berkata: tali pengekangnya, lalu baginda bersabda: \"Hari apakah ini?\" Dia berkata: Kami terdiam sehingga kami menyangka bahawa baginda akan menamakannya dengan nama lain, lalu baginda bersabda: \"Bukankah ini Hari Nahr?\" Kami berkata: Benar.\nBaginda bersabda: \"Bulan apakah ini?\" Dia berkata: Kami terdiam sehingga kami menyangka bahawa baginda akan menamakannya dengan nama lain, lalu baginda bersabda: \"Bukankah ini Zulhijjah?\".\nKami berkata: Benar.\nBaginda bersabda: \"Negeri manakah ini?\".\nDia berkata: Kami terdiam sehingga kami menyangka bahawa baginda akan menamakannya dengan nama lain, lalu baginda bersabda: \"Bukankah ini al-Baldah (Makkah)?\".\nKami berkata: Benar.\nBaginda bersabda: \"Sesungguhnya darah kamu, harta kamu dan maruah kamu di antara kamu adalah haram seperti kehormatan hari kamu ini, di bulan kamu ini, di negeri kamu ini. Ketahuilah, hendaklah orang yang hadir menyampaikan kepada orang yang ghaib, kerana sesungguhnya orang yang hadir mungkin menyampaikan kepada orang yang lebih memahami daripadanya.\""
  },
  {
    "id": 38751,
    "hadith_number": 1214,
    "tajuk_hadith": "Safiyyah Haid dan Kebenarannya untuk Meninggalkan Makkah",
    "perawi_melayu": "Ya'la meriwayatkan daripada al-A'mash, daripada Ibrahim, daripada al-Aswad, daripada Aisyah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَعْلَى  ، حَدَّثَنَا الْأَعْمَشُ  ، عَنْ إِبْرَاهِيمَ  ، عَنْ الْأَسْوَدِ  ، عَنْ عَائِشَةَ  ، قَالَتْ : حَاضَتْ صَفِيَّةُ ، فَلَمَّا كَانَتْ لَيْلَةُ النَّفْرِ، قَالَتْ : أَيْ حَلْقَى، أَيْ عَقْرَى ! بِلُغَةٍ لَهُنَّ.\nفَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" أَلَسْتِ قَدْ طُفْتِ يَوْمَ النَّحْرِ؟ \" قَالَتْ : بَلَى.\nقَالَ : \" فَارْكَبِي \".\nحَدَّثَنَا سَهْلُ بْنُ حَمَّادٍ  ، عَنْ شُعْبَةَ  ، عَنْ الْحَكَمِ  ، عَنْ إِبْرَاهِيمَ  ، عَنْ الْأَسْوَدِ  ، عَنْ عَائِشَةَ  ، بِنَحْوِهِ",
    "malay_translation": "Ya'la memberitahu kami, al-A'mash meriwayatkan kepada kami, daripada Ibrahim, daripada al-Aswad, daripada Aisyah, dia berkata: Safiyyah mengalami haid. Apabila tiba malam keberangkatan (dari Makkah), dia berkata: 'Aduh celakalah aku! Aduh binasalah aku!' (ungkapan dalam bahasa mereka).\n\nRasulullah SAW bersabda: 'Bukankah engkau telah melakukan tawaf pada Hari Nahr (Hari Raya Korban)?' Dia menjawab: 'Benar.'\n\nBaginda bersabda: 'Kalau begitu, tunggangilah (kenderaan).'\n\nSahal bin Hammad meriwayatkan kepada kami, daripada Syu'bah, daripada al-Hakam, daripada Ibrahim, daripada al-Aswad, daripada Aisyah, dengan hadis yang serupa."
  },
  {
    "id": 38752,
    "hadith_number": 1215,
    "tajuk_hadith": "Perutusan dengan Empat Perkara: Larangan Masuk Syurga bagi yang Tidak Beriman, Larangan Tawaf dalam Keadaan Telanjang, Pemisahan Muslim dan Kafir dalam Haji, dan Tempoh Perjanjian",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَزِيدَ الْبَزَّازُ  ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ زَيْدِ بْنِ يُثَيْعٍ  ، قَالَ : سَأَلْنَا عَلِيًّا   : بِأَيِّ شَيْءٍ بُعِثْتَ؟.\nقَالَ : \" بُعِثْتُ بِأَرْبَعٍ :لَا يَدْخُلُ الْجَنَّةَ إِلَّا نَفْسٌ مُؤْمِنَةٌ، وَلَا يَطُوفُ بِالْبَيْتِ عُرْيَانٌ، وَلَا يَجْتَمِعُ مُسْلِمٌ وَكَافِرٌ فِي الْحَجِّ بَعْدَ عَامِهِمْ هَذَا، وَمَنْ كَانَ بَيْنَهُ وَبَيْنَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَهْدٌ، فَعَهْدُهُ إِلَى مُدَّتِهِ، وَمَنْ لَمْ يَكُنْ لَهُ عَهْدٌ، فَهِيَ أَرْبَعَةُ أَشْهُرٍ.\nيَقُولُ بَعْدَ يَوْمِ النَّحْرِ أَجَلُهُمْ عِشْرِينَ مِنْ ذِي الْحِجَّةِ، فَاقْتُلُوهُمْ بَعْدَ الْأَرْبَعَةِ \"",
    "malay_translation": "Muhammad bin Yazid al-Bazzaz telah mengkhabarkan kepada kami, Sufyan bin Uyainah telah menceritakan kepada kami, daripada Abu Ishaq, daripada Zaid bin Yuthai', dia berkata: Kami bertanya kepada Ali: Dengan apakah engkau diutuskan?\n\nDia berkata: \"Aku diutuskan dengan empat perkara: Tidak akan masuk syurga kecuali jiwa yang beriman, tidak boleh tawaf di Baitullah dalam keadaan telanjang, tidak boleh berkumpul orang Muslim dan kafir dalam haji selepas tahun ini, dan sesiapa yang mempunyai perjanjian dengan Rasulullah SAW, maka perjanjiannya adalah sehingga tempohnya, dan sesiapa yang tidak mempunyai perjanjian, maka tempohnya adalah empat bulan.\n\nDia berkata selepas hari Nahr (korban), tempoh mereka adalah dua puluh Zulhijjah, maka bunuhlah mereka selepas empat bulan itu.\""
  },
  {
    "id": 38753,
    "hadith_number": 1216,
    "tajuk_hadith": "Larangan Mengangkat Tangan di Baitullah Seperti Perbuatan Yahudi",
    "perawi_melayu": "Ubaidillah bin Abdul Majid al-Hanafi meriwayatkan daripada Syu'bah, yang mana Abu Qaza'ah memberitahunya, katanya: Aku mendengar Muhajir berkata: Jabir bin Abdullah ditanya tentang mengangkat tangan di Baitullah, lalu beliau menjawab: \"Sesungguhnya, orang Yahudi yang melakukan demikian. Kami mengerjakan haji bersama Rasulullah SAW, adakah kami melakukan demikian?",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ الْحَنَفِيُّ  ، حَدَّثَنَا شُعْبَةُ  ، أَخْبَرَنِي أَبُو قَزَعَةَ  ، قَالَ : سَمِعْتُ مُهَاجِرًا  يَقُولُ : سُئِلَ جَابِرُ بْنُ عَبْدِ اللَّهِ   عَنْ رَفْعِ الْأَيْدِي عِنْدَ الْبَيْتِ ، فَقَالَ : \" إِنَّمَا كَانَ يَصْنَعُ ذَلِكَ الْيَهُودُ،حَجَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفَصَنَعْنَا ذَلِكَ؟ \"",
    "malay_translation": "Ubaidillah bin Abdul Majid al-Hanafi meriwayatkan kepada kami, Syu'bah meriwayatkan kepada kami, Abu Qaza'ah memberitahuku, katanya: Aku mendengar Muhajir berkata: Jabir bin Abdullah ditanya tentang mengangkat tangan di Baitullah, lalu beliau menjawab: \"Sesungguhnya, orang Yahudi yang melakukan demikian. Kami mengerjakan haji bersama Rasulullah SAW, adakah kami melakukan demikian?\""
  },
  {
    "id": 38754,
    "hadith_number": 1217,
    "tajuk_hadith": "Larangan Kembali Kufur Selepas Kewafatan Nabi SAW dengan Membunuh Sesama Sendiri",
    "perawi_melayu": "Diriwayatkan daripada Jarir bin Abdullah RA, bahawa Rasulullah SAW bersabda dalam Haji Wada': 'Diamkanlah orang ramai,' kemudian bersabda: 'Janganlah kamu kembali menjadi kafir selepas kewafatanku dengan membunuh sesama sendiri.'",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ  ، وَحَجَّاجٌ  ، قَالَا : حَدَّثَنَا شُعْبَةُ  ، أَخْبَرَنِي عَلِيُّ بْنُ مُدْرِكٍ  ، قَالَ : سَمِعْتُ أَبَا زُرْعَةَ  يُحَدِّثُ، عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ : \" اسْتَنْصَتَ النَّاسَ \"، فِي حَجَّةِ الْوَدَاعِ، ثُمَّ قَالَ :\" لَا تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu al-Walid dan Hajjaj, mereka berdua berkata: Telah menceritakan kepada kami Syu'bah, telah mengkhabarkan kepadaku Ali bin Mudrik, dia berkata: Aku mendengar Abu Zur'ah menceritakan, daripada Jarir bin Abdullah RA, bahawa Rasulullah SAW bersabda: 'Diamkanlah orang ramai,' dalam Haji Wada', kemudian bersabda: 'Janganlah kamu kembali menjadi kafir selepas kewafatanku dengan membunuh sesama sendiri.'"
  },
  {
    "id": 38755,
    "hadith_number": 1218,
    "tajuk_hadith": "Rasulullah SAW Bersa'i Antara Safa dan Marwah dengan Perlindungan Sahabat",
    "perawi_melayu": "Ja'far bin Awn meriwayatkan daripada Ismail bin Abi Khalid, yang berkata: Saya mendengar Ibn Abi Aufa berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا جَعْفَرُ بْنُ عَوْنٍ  ، حَدَّثَنَا إِسْمَاعِيل بْنُ أَبِي خَالِدٍ  ، قَالَ : وَسَمِعْتُ ابْنَ أَبِي أَوْفَى   يَقُولُ :\" سَعَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ الصَّفَا وَالْمَرْوَةِ ، وَنَحْنُ نَسْتُرُهُ مِنْ أَهْلِ مَكَّةَ أَنْ يُصِيبَهُ أَحَدٌ بِحَجَرٍ أَوْ بِرَمْيَةٍ \"",
    "malay_translation": "Rasulullah SAW bersa'i (berjalan dengan cepat) antara Safa dan Marwah, dan kami (para sahabat) melindungi baginda daripada penduduk Makkah, agar tidak seorang pun yang mengenainya dengan batu atau panahan."
  },
  {
    "id": 38756,
    "hadith_number": 1219,
    "tajuk_hadith": "Melaksanakan Haji Tamattu' Walaupun Dilarang",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَهْلُ بْنُ حَمَّادٍ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ الْحَكَمِ  ، عَنْ عَلِيِّ بْنِ الْحُسَيْنِ  ، عَنْ مَرْوَانَ بْنِ الْحَكَمِ  ، أَنَّهُ شَهِدَ عَلِيًّا وَعُثْمَانَ بَيْنَ مَكَّةَ وَالْمَدِينَةِ ، وَعُثْمَانُ يَنْهَى عَنْ الْمُتْعَةِ، فَلَمَّا رَأَى ذَلِكَ عَلِيٌّ  ،\" أَهَلَّ بِهِمَا جَمِيعًا، فَقَالَ : لَبَّيْكَ بِحَجَّةٍ وَعُمْرَةٍ مَعًا \".\nفَقَالَ : تَرَانِي أَنْهَى عَنْهُ وَتَفْعَلُهُ؟ فَقَالَ : لَمْ أَكُنْ لِأَدَعَ سُنَّةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَوْلِ أَحَدٍ مِنْ النَّاسِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Sahl bin Hammad, telah menceritakan kepada kami Syu'bah, daripada Al-Hakam, daripada Ali bin Al-Hussein, daripada Marwan bin Al-Hakam, bahawa dia menyaksikan Ali dan Uthman antara Mekah dan Madinah, dan Uthman melarang daripada Mut'ah. Apabila Ali melihat demikian, dia berihram dengan kedua-duanya sekali, lalu berkata: 'Labbaik dengan haji dan umrah bersama.' Maka Uthman berkata: 'Adakah kamu melihat aku melarangnya dan kamu melakukannya?' Ali berkata: 'Aku tidak akan meninggalkan Sunnah Rasulullah SAW kerana perkataan seseorang pun.'"
  },
  {
    "id": 38757,
    "hadith_number": 1220,
    "tajuk_hadith": "Talbiah Nabi SAW untuk Umrah dan Haji",
    "perawi_melayu": "Diriwayatkan dari Anas RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، حَدَّثَنَا حُمَيْدٌ  ، عَنْ أَنَسٍ  ، أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" لَبَّيْكَ بِعُمْرَةٍ وَحَجٍّ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah menceritakan kepada kami Humaid, daripada Anas, bahawa beliau mendengar Nabi SAW bersabda: “Aku menyahut panggilan-Mu untuk umrah dan haji.”"
  },
  {
    "id": 38758,
    "hadith_number": 1221,
    "tajuk_hadith": "Rasulullah SAW Berihram untuk Haji dan Umrah: Pandangan Anas dan Ibn Umar",
    "perawi_melayu": "Sa'id bin 'Amir, daripada Habib bin al-Syahid, daripada Bakr bin 'Abdillah, daripada Anas",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ  ، عَنْ حَبِيبِ بْنِ الشَّهِيدِ  ، عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ  ، عَنْ أَنَسٍ  ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" أَهَلَّ بِهِمَا جَمِيعًا \"، فَلَقِيتُ ابْنَ عُمَرَ   فَأَخْبَرْتُهُ بِقَوْلِ أَنَسٍ، فَقَالَ : إِنَّمَا أَهَلَّ بِالْحَجِّ، فَرَجَعْتُ إِلَى أَنَسٍ فَأَخْبَرْتُهُ بِقَوْلِ ابْنِ عُمَرَ، فَقَالَ : مَا يَعُدُّونَا إِلَّا صِبْيَانًا",
    "malay_translation": "Telah mengkhabarkan kepada kami Sa'id bin 'Amir, daripada Habib bin al-Syahid, daripada Bakr bin 'Abdillah, daripada Anas, bahawa Rasulullah SAW telah berihram untuk kedua-duanya (Haji dan Umrah). Lalu aku bertemu Ibn Umar dan aku khabarkan kepadanya perkataan Anas, maka beliau berkata: “Sesungguhnya Baginda hanya berihram untuk Haji.” Lalu aku kembali kepada Anas dan aku khabarkan kepadanya perkataan Ibn Umar, maka beliau berkata: “Mereka tidak mengira kita melainkan seperti anak-anak kecil.”"
  },
  {
    "id": 38759,
    "hadith_number": 1222,
    "tajuk_hadith": "Larangan Menghalang Orang Tawaf dan Solat di Masjidil Haram pada Bila-Bila Masa",
    "perawi_melayu": "Diriwayatkan daripada Jubair bin Mut'im RA, bahawa Nabi SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ  ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ  ، عَنْ أَبِي الزُّبَيْرِ  ، عَنْ عَبْدِ اللَّهِ بْنِ بَابَاهُ  ، عَنْ جُبَيْرِ بْنِ مُطْعِمٍ  ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ : \" يَا بَنِي عَبْدِ مَنَافٍ،إِنْ وَلِيتُمْ هَذَا الْأَمْرَ، فَلَا تَمْنَعُوا أَحَدًا طَافَ أَوْ صَلَّى أَيَّ سَاعَةٍ شَاءَ مِنْ لَيْلٍ أَوْ نَهَارٍ \"",
    "malay_translation": "\"Wahai Bani Abdul Manaf, jika kamu memegang urusan ini (urusan Kaabah), maka janganlah kamu menghalang seseorang pun yang hendak melakukan tawaf atau solat pada bila-bila masa yang dia kehendaki, sama ada pada waktu malam atau siang.\""
  },
  {
    "id": 38760,
    "hadith_number": 1223,
    "tajuk_hadith": "Rasulullah SAW Bermalam di Dzi Tuwa Sebelum Memasuki Mekah",
    "perawi_melayu": "Diriwayatkan daripada Musaddad, daripada Yahya bin Sa'id, daripada 'Ubaidillah, mengkhabarkan kepadaku Nafi', daripada Ibnu Umar RA, bahawa Rasulullah SAW bermalam di Dzi Tuwa sehinggaSubuh, kemudian Baginda memasuki Mekah. Dan Ibnu Umar RA melakukan perkara tersebut.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ  ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ  ، عَنْ عُبَيْدِ اللَّهِ  ، أَخْبَرَنِي نَافِعٌ  ، عَنْ ابْنِ عُمَرَ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" بَاتَ بِذِي طُوًى حَتَّى أَصْبَحَ، ثُمَّ دَخَلَ مَكَّةَ \"، وَكَانَ ابْنُ عُمَرَ يَفْعَلُهُ",
    "malay_translation": "Telah menceritakan kepada kami Musaddad, telah menceritakan kepada kami Yahya bin Sa'id, daripada 'Ubaidillah, telah mengkhabarkan kepadaku Nafi', daripada Ibnu Umar RA, bahawa Rasulullah SAW bermalam di Dzi Tuwa sehingga Subuh, kemudian Baginda memasuki Mekah. Dan Ibnu Umar RA melakukan perkara tersebut."
  },
  {
    "id": 38761,
    "hadith_number": 1224,
    "tajuk_hadith": "Cara Rasulullah SAW Memasuki dan Meninggalkan Makkah",
    "perawi_melayu": "Diriwayatkan daripada Abdullah bin Umar RA bahawa Rasulullah SAW memasuki Makkah melalui Thaniyyah al-'Ulya dan keluar melalui Thaniyyah al-Sufla.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ  ، حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ  ، عَنْ عُبَيْدِ اللَّهِ  ، حَدَّثَنِي نَافِعٌ  ، عَنْ ابْنِ عُمَرَ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \" كَانَيَدْخُلُ مَكَّةَ مِنْ الثَّنِيَّةِ الْعُلْيَا ، وَيَخْرُجُ مِنْ الثَّنِيَّةِ السُّفْلَى \"",
    "malay_translation": "Abdullah bin Sa'id mengkhabarkan kepada kami, 'Uqbah bin Khalid menceritakan kepada kami, daripada 'Ubaidillah, Nafi' menceritakan kepadaku, daripada Ibn 'Umar, bahawa Rasulullah SAW biasanya memasuki Makkah dari Thaniyyah al-'Ulya dan keluar dari Thaniyyah al-Sufla."
  },
  {
    "id": 38762,
    "hadith_number": 1225,
    "tajuk_hadith": "Rasulullah SAW Berihram di Masjid Dzul Hulaifah Setelah Untanya Tegak",
    "perawi_melayu": "Diriwayatkan daripada Abdullah bin Sa'id, daripada Uqbah bin Khalid, daripada Ubaidillah, daripada Nafi', daripada Ibnu Umar RA, beliau berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ  ، حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ  عَنْ عُبَيْدِ اللَّهِ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ  ، قَالَ : كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \" إِذَا أَدْخَلَ رِجْلَهُ فِي الْغَرْزِ وَاسْتَوَتْ بِهِ نَاقَتُهُ،أَهَلَّ مِنْ مَسْجِدِ ذِي الْحُلَيْفَةِ \"",
    "malay_translation": "“Rasulullah SAW apabila memasukkan kakinya ke dalam pelana dan untanya telah tegak berdiri, baginda berihram dari Masjid Dzul Hulaifah.”"
  },
  {
    "id": 38763,
    "hadith_number": 1226,
    "tajuk_hadith": "Mengubati Mata yang Sakit Ketika Berihram",
    "perawi_melayu": "Diriwayatkan daripada Uthman bin Muhammad bin Abi Syaibah dan Muhammad bin Ahmad bin Abi Khalaf, mereka berkata: Sufyan telah menceritakan kepada kami, daripada Ayyub bin Musa, daripada Nubaih bin Wahb, daripada Aban bin Uthman, daripada ayahnya",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُثْمَانُ بْنُ مُحَمَّدِ بْنِ أَبِي شَيْبَةَ  ، وَمُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ  ، قَالَا : حَدَّثَنَا سُفْيَانُ  ، عَنْ أَيُّوبَ بْنِ مُوسَى  ، عَنْ نُبَيْهِ بْنِ وَهْبٍ  ، عَنْ أَبَانَ بْنِ عُثْمَانَ  ، عَنْ أَبِيهِ  ، أَنّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ فِي الْمُحْرِمِ إِذَا اشْتَكَى عَيْنَيْهِ :\" يَضْمِدُهَا بِالصَّبِرِ \"",
    "malay_translation": "Bahawa Nabi SAW bersabda mengenai seorang yang berihram apabila dia sakit mata: \"Hendaklah dia mengubatinya dengan *Sabar* (sejenis tumbuhan pahit yang digunakan sebagai ubat).\""
  },
  {
    "id": 38764,
    "hadith_number": 1227,
    "tajuk_hadith": "Nabi SAW Tawaf di Baitullah dan Solat di Maqam Ibrahim, Kemudian Keluar ke Safa",
    "perawi_melayu": "Hasyim bin al-Qasim, daripada Syu'bah, daripada Amru bin Dinar, daripada Ibn Umar",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا هَاشِمُ بْنُ الْقَاسِمِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ عَمْرِو بْنِ دِينَارٍ  قَالَ : سَمِعْتُ ابْنَ عُمَرَ  ، يَقُولُ : \" قَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَفَطَافَ بِالْبَيْتِ وَصَلَّى عِنْدَ الْمَقَامِ رَكْعَتَيْنِ، ثُمَّ خَرَجَ إِلَى الصَّفَا \".\nقَالَ شُعْبَةُ  : فَحَدَّثَنِي أَيُّوبُ  ، عَنْ عَمْرِو بْنِ دِينَارٍ  ، عَنْ ابْنِ عُمَرَ  ، قَالَ : هِيَ السُّنَّةُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Hasyim bin al-Qasim, telah menceritakan kepada kami Syu'bah, daripada Amru bin Dinar, beliau berkata: Saya mendengar Ibn Umar berkata: \"Nabi SAW tiba lalu tawaf di Baitullah dan solat dua rakaat di Maqam Ibrahim, kemudian keluar menuju ke Safa.\"\nSyu'bah berkata: Ayub telah menceritakan kepada saya, daripada Amru bin Dinar, daripada Ibn Umar, beliau berkata: \"Itulah sunnahnya.\""
  },
  {
    "id": 38765,
    "hadith_number": 1228,
    "tajuk_hadith": "Jangan Meninggalkan Makkah Sehingga Tawaf Wada'",
    "perawi_melayu": "Muhammad bin Yusuf, daripada Ibn Uyainah, daripada Sulaiman al-Ahwal, daripada Tawus, daripada Ibn Abbas R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ ابْنِ عُيَيْنَةَ  ، عَنْ سُلَيْمَانَ الْأَحْوَلِ  ، عَنْ طَاوُسٍ  ،  عَنْ ابْنِ عَبَّاسٍ  ، قَالَ : كَانَ النَّاسُ يَنْصَرِفُونَ فِي كُلِّ وَجْهٍ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَا يَنْفِرَنَّ أَحَدٌ حَتَّى يَكُونَ آخِرُ عَهْدِهِ بِالْبَيْتِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Yusuf, daripada Ibn Uyainah, daripada Sulaiman al-Ahwal, daripada Tawus, daripada Ibn Abbas R.A., beliau berkata: Orang ramai biasanya beredar ke semua arah (selepas menunaikan haji). Maka Rasulullah SAW bersabda: \"Janganlah seseorang itu meninggalkan (Makkah) sehingga akhir urusannya adalah dengan Baitullah (Kaabah).\""
  },
  {
    "id": 38766,
    "hadith_number": 1229,
    "tajuk_hadith": "Rukhsah Bagi Wanita Haid untuk Meninggalkan (Mekah) Setelah Tawaf Ifadhah",
    "perawi_melayu": "Muslim bin Ibrahim menceritakan kepada kami, Wahib menceritakan kepada kami, Ibnu Tawus menceritakan kepada kami, daripada ayahnya, daripada Ibnu Abbas, beliau berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا وُهَيْبٌ  ، حَدَّثَنَا ابْنُ طَاوُسٍ  ، عَنْ أَبِيهِ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ :\" رُخِّصَ لِلْحَائِضِ أَنْ تَنْفِرَ إِذَا أَفَاضَتْ \".\nقَالَ : وَسَمِعْتُ ابْنَ عُمَرَ   عَامَ أَوَّلَ : أَنَّهَا لَا تَنْفِرُ، ثُمَّ سَمِعْتُهُ، يَقُولُ : تَنْفِرُ، إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ لَهُنَّ",
    "malay_translation": "\"Diberikan keringanan (rukhsah) bagi wanita yang haid untuk meninggalkan (Mekah) apabila dia telah melakukan Tawaf Ifadhah.\"\nBeliau berkata: \"Dan aku mendengar Ibnu Umar pada tahun pertama: Bahawa dia tidak boleh meninggalkan (Mekah), kemudian aku mendengarnya, dia berkata: Boleh meninggalkan (Mekah), sesungguhnya Nabi SAW memberikan keringanan kepada mereka (wanita haid).\""
  },
  {
    "id": 38767,
    "hadith_number": 1230,
    "tajuk_hadith": "Kelonggaran bagi Wanita yang Haid Selepas Tawaf Ifadah",
    "perawi_melayu": "Abdullah bin Saleh meriwayatkan daripada Al-Laith, daripada Uqail, daripada Ibn Shihab, berkata: Telah mengkhabarkan kepadaku Tawus al-Yamani, bahawa beliau mendengar Abdullah bin Umar ditanya tentang wanita yang ditahan daripada melakukan tawaf di Baitullah apabila mereka haid sebelum Nafar, dan mereka telah melakukan Ifadah pada Hari Nahr. Beliau berkata: 'Sesungguhnya Aisyah menyebutkan keringanan (rukhsah) bagi wanita.' Peristiwa ini berlaku setahun sebelum kematian Abdullah bin Umar.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، يَقُولُ : حَدَّثَنِي اللَّيْثُ  ، حَدَّثَنِي عُقَيْلٌ  ، عَنْ ابْنِ شِهَابٍ  ، قَالَ : أَخْبَرَنِي طَاوُسٌ الْيَمَانِيُّ  ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ  وَهُوَ يُسْأَلُ عَنْ حَبْسِ النِّسَاءِ عَنْ الطَّوَافِ بِالْبَيْتِ إِذَا حِضْنَ قَبْلَ النَّفْرِ، وَقَدْ أَفَضْنَ يَوْمَ النَّحْرِ، فَقَالَ : \" إِنَّ عَائِشَةَ   كَانَتْتَذْكُرُ رُخْصَةً لِلنِّسَاءِ \".\nوَذَلِكَ قَبْلَ مَوْتِ عَبْدِ اللَّهِ بْنِ عُمَرَ بِعَامٍ",
    "malay_translation": "Abdullah bin Saleh mengkhabarkan kepada kami, katanya: Al-Laith telah menceritakan kepadaku, Uqail menceritakan kepadaku, daripada Ibn Shihab, katanya: Tawus al-Yamani telah mengkhabarkan kepadaku, bahawa dia mendengar Abdullah bin Umar ditanya tentang penahanan wanita daripada tawaf di Baitullah apabila mereka haid sebelum Nafar, sedangkan mereka telah melakukan Ifadah pada Hari Nahr. Lalu beliau berkata: 'Sesungguhnya Aisyah mengingati rukhsah (keringanan) untuk wanita.' Perkara ini berlaku setahun sebelum kematian Abdullah bin Umar."
  },
  {
    "id": 38768,
    "hadith_number": 1231,
    "tajuk_hadith": "Menguruskan Haiwan Qurban dan Batasan bagi Pengirim",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَعْلَى  ، حَدَّثَنَا إِسْمَاعِيل يَعْنِي ابْنَ أَبِي خَالِدٍ  ، عَنْ عَامِرٍ  ، عَنْ مَسْرُوقٍ  ، أَنَّهُ قَالَ لِعَائِشَةَ   : يَا أُمَّ الْمُؤْمِنِينَ، إِنَّ رِجَالًا يَبْعَثُ أَحَدُهُمْ بِالْهَدْيِ مَعَ الرَّجُلِ، فَيَقُولُ : إِذَا بَلَغْتَ مَكَانَ كَذَا وَكَذَا، فَقَلِّدْهُ، فَإِذَا بَلَغَ ذَلِكَ الْمَكَانَ، لَمْ يَزَلْ مُحْرِمًا حَتَّى يَحِلَّ النَّاسُ.\nقَالَ : فَسَمِعْتُ صَفْقَتَهَا بِيَدِهَا مِنْ وَرَاءِ الْحِجَابِ، وَقَالَتْ : \" لَقَدْكُنْتُ أَفْتِلُ الْقَلَائِدَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَيَبْعَثُ بِالْهَدْيِ إِلَى الْكَعْبَةِ ، مَا يَحْرُمُ عَلَيْهِ شَيْءٌ مِمَّا يَحِلُّ لِلرَّجُلِ مِنْ أَهْلِهِ حَتَّى يَرْجِعَ النَّاسُ \"",
    "malay_translation": "Ya'la telah mengkhabarkan kepada kami, Ismail iaitu Ibnu Abi Khalid telah menceritakan kepada kami, daripada 'Amir, daripada Masruq, bahawa dia berkata kepada Aisyah R.A: \"Wahai Ummul Mukminin, sesungguhnya ada orang yang mengirimkan haiwan qurban bersama seorang lelaki, lalu dia berkata: 'Apabila kamu sampai ke tempat yang sedemikian dan sedemikian, maka kalungkanlah ia (haiwan qurban itu).' Apabila dia sampai ke tempat itu, dia (pengirim) masih dalam keadaan ihram sehingga orang ramai bertahallul.\"\nDia (Masruq) berkata: \"Maka aku mendengar Aisyah menepuk tangannya dari balik tabir, dan dia berkata: 'Sesungguhnya aku pernah memintal kalung untuk Rasulullah SAW, lalu baginda mengirimkan haiwan qurban ke Kaabah, dan tidak ada sesuatu pun yang haram bagi baginda daripada apa yang halal bagi seorang lelaki terhadap keluarganya sehingga orang ramai kembali (dari haji).\""
  },
  {
    "id": 38769,
    "hadith_number": 1232,
    "tajuk_hadith": "Aisyah Menyirat Kalung Hadyu Rasulullah SAW",
    "perawi_melayu": "Al-Hakam bin Nafi' meriwayatkan daripada Syuaib, daripada az-Zuhri, yang berkata: Urwah bin az-Zubair dan Amrah binti Abdurrahman memberitahu saya bahawa Aisyah RA berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ  ، أَخْبَرَنَا شُعَيْبٌ  ، عَنْ الزُّهْرِيِّ  ، قَالَ : أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ  ، وَعَمْرَةُ بِنْتُ عَبْدِ الرَّحْمَنِ  ، أَنَّ عَائِشَةَ   قَالَتْ :\" كُنْتُ أَفْتِلُ قَلَائِدَ هَدْيِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَيَبْعَثُ بِهَدْيِهِ مُقَلَّدَةً، وَيُقِيمُ بِالْمَدِينَةِ وَلَا يَجْتَنِبُ شَيْئًا حَتَّى يُنْحَرَ هَدْيُهُ \"",
    "malay_translation": "\"Dahulu aku menyirat kalung hadyu Rasulullah SAW, lalu Baginda mengirimkan hadyu-nya yang berkalung, dan Baginda tetap tinggal di Madinah dan tidak menjauhi sesuatu pun sehingga hadyu-nya disembelih.\""
  },
  {
    "id": 38770,
    "hadith_number": 1233,
    "tajuk_hadith": "Mina: Tempat Singgah bagi yang Terdahulu",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاق  ، حَدَّثَنَا وَكِيعٌ  ، حَدَّثَنَا إِسْرَائِيلُ  ، عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ  ، عَنْ يُوسُفَ بْنِ مَاهَكَ  ، عَنْ أُمِّهِ مُسَيْكَةَ  وَأَثْنَى عَلَيْهَا خَيْرًا ، عَنْ عَائِشَةَ  ، قَالَتْ : قُلْتُ : يَا رَسُولَ اللَّهِ،أَلَا نَبْنِي لَكَ بِمِنًى بِنَاءً يُظِلُّكَ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" لَا، مِنًى مُنَاخُ مَنْ سَبَقَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ishaq, telah menceritakan kepada kami Waki', telah menceritakan kepada kami Israil, daripada Ibrahim bin Muhajir, daripada Yusuf bin Mahak, daripada ibunya Musaika (dan beliau memujinya dengan baik), daripada Aisyah R.A., beliau berkata: Aku berkata: Wahai Rasulullah, tidakkah kami membina untukmu di Mina sebuah bangunan yang dapat menaungimu? Maka Rasulullah SAW bersabda: \"Jangan, Mina adalah tempat singgah bagi sesiapa yang terdahulu (tiba).\""
  },
  {
    "id": 38771,
    "hadith_number": 1234,
    "tajuk_hadith": "Rasulullah SAW Memerintahkan Pembunuhan Ibn Khatal di Mekah",
    "perawi_melayu": "Abdullah bin Khalid",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ خَالِدٍ  ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ  ، عَنْ ابْنِ شِهَابٍ  ، عَنْ أَنَسِ بْنِ مَالِكٍ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ مَكَّةَ عَامَ الْفَتْحِ وَعَلَى رَأْسِهِ مِغْفَرٌ، فَلَمَّا نَزَعَهُ جَاءَهُ رَجُلٌ، فَقَالَ : يَا رَسُولَ اللَّهِ،هَذَا ابْنُ خَطَلٍ مُتَعَلِّقٌ بِأَسْتَارِ الْكَعْبَةِ ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" اقْتُلُوهُ \".\nقَالَ عَبْدُ اللَّهِ بْنُ خَالِدٍ : وَقُرِئَ عَلَى مَالِكٍ : قَالَ : قَالَ ابْنُ شِهَابٍ : وَلَمْ يَكُنْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَئِذٍ مُحْرِمًا",
    "malay_translation": "Abdullah bin Khalid mengkhabarkan kepada kami, Malik bin Anas menceritakan kepada kami, daripada Ibn Shihab, daripada Anas bin Malik, bahawa Rasulullah SAW memasuki Mekah pada tahun pembukaan (Mekah) dan di atas kepala baginda terdapat pelindung kepala (mighfar). Ketika baginda menanggalkannya, seorang lelaki datang dan berkata: \"Wahai Rasulullah, ini Ibn Khatal sedang berpegang pada kain Kaabah.\" Rasulullah SAW bersabda: \"Bunuh dia.\"\n\nAbdullah bin Khalid berkata: Dibacakan kepada Malik: Ibn Shihab berkata: Dan Rasulullah SAW pada hari itu tidak dalam keadaan berihram."
  },
  {
    "id": 38772,
    "hadith_number": 1235,
    "tajuk_hadith": "Nabi Muhammad SAW Memasuki Mekah dengan Serban Hitam",
    "perawi_melayu": "Diriwayatkan oleh Jabir RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْمَاعِيل بْنُ أَبَانَ  ، حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمَّارٍ الدُّهْنِيُّ  ، عَنْ أَبِي الزُّبَيْرِ  ، عَنْ جَابِرٍ  ، قَالَ :\" دَخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ حِينَ افْتَتَحَهَا وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ بِغَيْرِ إِحْرَامٍ \".\nقَالَ إِسْمَاعِيل : سَمِعَهُ مِنْ أَبِي الزُّبَيْرِ.\nكَانَ مَعَ أَبِيهِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Ismail bin Aban, telah menceritakan kepada kami Mu'awiyah bin Ammar ad-Duhni, daripada Abu Zubair, daripada Jabir RA, dia berkata: \"Nabi SAW memasuki Mekah ketika pembukaannya (Fathu Mekah) dan baginda memakai serban hitam tanpa ihram.\" Ismail berkata: Dia mendengarnya daripada Abu Zubair. Dia bersama ayahnya."
  },
  {
    "id": 38773,
    "hadith_number": 1236,
    "tajuk_hadith": "Arahan Nabi Muhammad SAW untuk Mengurus dan Mengagihkan Unta Korban",
    "perawi_melayu": "Diriwayatkan oleh Musaddad, Yahya, daripada Ibn Juraij, daripada Al-Hasan bin Muslim dan Abdul Karim Al-Jazari, daripada Mujahid, daripada Abdurrahman bin Abi Laila, daripada Ali RA, daripada Rasulullah SAW.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ  ، حَدَّثَنَا يَحْيَى  ، عَنْ ابْنِ جُرَيْجٍ  ، قَالَ : أَخْبَرَنِي الْحَسَنُ بْنُ مُسْلِمٍ  ، وَعَبْدُ الْكَرِيمِ الْجَزَرِيُّ  ، أَنَّ مُجَاهِدًا  أَخْبَرَهُمَا، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَبِي لَيْلَى  أَخْبَرَهُ، أَنَّ عَلِيًّا   أَخْبَرَهُ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" أَمَرَهُ أَنْ يَقُومَ عَلَى بُدْنِهِ، وَأَنْ يَقْسِمَ بُدْنَهُ كُلَّهَا : لُحُومَهَا وَجُلُودَهَا وَجِلَالَهَا، وَلَا يُعْطِيَ فِي جِزَارَتِهَا مِنْهَا شَيْئًا \"",
    "malay_translation": "Telah menceritakan kepada kami Musaddad, telah menceritakan kepada kami Yahya, daripada Ibn Juraij, beliau berkata: Telah mengkhabarkan kepadaku Al-Hasan bin Muslim dan Abdul Karim Al-Jazari, bahawa Mujahid telah mengkhabarkan kepada mereka berdua, bahawa Abdurrahman bin Abi Laila telah mengkhabarkannya, bahawa Ali RA telah mengkhabarkannya, bahawa Rasulullah SAW memerintahkannya untuk mengurus unta korban baginda, dan membahagikan semua unta korban tersebut: daging-dagingnya, kulit-kulitnya dan pelana-pelananya, dan tidak memberikan sedikitpun daripadanya kepada tukang sembelih sebagai upah."
  },
  {
    "id": 38774,
    "hadith_number": 1237,
    "tajuk_hadith": "Hukum Berburu Dhabu' (Hyena) bagi Orang yang Berihram",
    "perawi_melayu": "Diriwayatkan dari Jabir RA, Rasulullah SAW ditanya mengenai dhabu'.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ  ، قَالَ : سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُبَيْدِ بْنِ عُمَيْرٍ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمَّارٍ  ، عَنْ جَابِرٍ  ، قَالَ : سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الضَّبُعِ، فَقَالَ :\" هُوَ صَيْدٌ وَفِيهِ كَبْشٌ إِذَا أَصَابَهُ الْمُحْرِمُ \"",
    "malay_translation": "Abu Nu'aim mengkhabarkan kepada kami, Jarir bin Hazim menceritakan kepada kami, dia berkata: Aku mendengar Abdullah bin Ubaid bin Umair, daripada Abdurrahman bin Abi Ammar, daripada Jabir, dia berkata: Rasulullah SAW ditanya tentang dhabu' (hyena). Baginda bersabda: \"Ia adalah buruan, dan dikenakan (denda) seekor kibas jika orang yang berihram memburunya.\""
  },
  {
    "id": 38775,
    "hadith_number": 1238,
    "tajuk_hadith": "Hukum Memakan Dhabu' (Dubuk/Hyena)",
    "perawi_melayu": "Diriwayatkan daripada Jabir bin Abdullah RA mengenai hukum memakan dhabu'.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ ابْنِ جُرَيْجٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عُمَيْرٍ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي عَمَّارٍ  ، قَالَ :سَأَلْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ   عَنْ الضَّبُعِ آكُلُهُ؟ قَالَ : نَعَمْ، قُلْتُ : هُوَ صَيْدٌ؟ قَالَ : نَعَمْ \".\nقُلْتُ : سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ : نَعَمْ.\nقِيلَ لِأَبِي مُحَمَّدٍ : مَا تَقُولُ فِي الضَّبُعِ تَأْكُلُهُ؟ قَالَ : أَنَا أَكْرَهُ أَكْلَهُ",
    "malay_translation": "Abu 'Asim telah mengkhabarkan kepada kami, daripada Ibn Juraij, daripada Abdullah bin Ubaid bin Umair, daripada Abdul Rahman bin Abdullah bin Abi Ammar, katanya: Aku bertanya kepada Jabir bin Abdullah tentang dhabu' (dubuk/hyena), bolehkah aku memakannya? Beliau menjawab: Ya. Aku bertanya: Adakah ia buruan? Beliau menjawab: Ya.\"\nAku bertanya: Adakah engkau mendengarnya daripada Rasulullah SAW? Beliau menjawab: Ya.\nDitanya kepada Abu Muhammad: Apa pendapatmu tentang dhabu', bolehkah memakannya? Beliau menjawab: Aku tidak menyukai memakannya."
  },
  {
    "id": 38776,
    "hadith_number": 1239,
    "tajuk_hadith": "Kebenaran untuk Al-Abbas bermalam di Mekah pada malam-malam Mina kerana tugas memberi minum",
    "perawi_melayu": "Abdullah bin Sa'id",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ  ، حَدَّثَنَا أَبُو أُسَامَةَ  ، عَنْ عُبَيْدِ اللَّهِ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ   : أَنَّ الْعَّبَاسَ بْنَ عَبْدِ الْمُطَّلِبِ اسْتَأْذَنَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَلِيَبِيتَ بِمَكَّةَ لَيَالِيَ مِنًى مِنْ أَجْلِ سِقَايَتِهِ.\nفَأَذِنَ لَهُ \".\n حَدَّثَنَا سَعِيدُ بْنُ الْمُغِيرَةِ  ، عَنْ عِيسَى بْنِ يُونُسَ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ  ، نَحْوَهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Abdullah bin Sa'id, telah menceritakan kepada kami Abu Usamah, daripada Ubaidillah, daripada Nafi', daripada Ibn Umar: Bahawa al-Abbas bin Abdul Muttalib meminta izin kepada Rasulullah SAW untuk bermalam di Mekah pada malam-malam Mina kerana tugas memberi minumnya. Maka Baginda SAW mengizinkannya. Telah menceritakan kepada kami Sa'id bin al-Mughirah, daripada Isa bin Yunus, daripada Ubaidillah bin Umar, sepertinya."
  }
]
