[
  {
    "id": 39973,
    "hadith_number": 2436,
    "tajuk_hadith": "Kewajipan Menulis Wasiat bagi Seorang Muslim",
    "perawi_melayu": "Nabi Muhammad (ﷺ)",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ  ، أَخْبَرَنَا عُبَيْدُ اللَّهِ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَاحَقُّ امْرِئٍ مُسْلِمٍ يَبِيتُ لَيْلَتَيْنِ وَلَهُ شَيْءٌ يُوصِي فِيهِ، إِلَّا وَوَصِيَّتُهُ مَكْتُوبَةٌ عِنْدَهُ \"",
    "malay_translation": "Daripada Abdullah bin Umar, Rasulullah (ﷺ) bersabda: \"Tidak patut bagi seorang Muslim yang bermalam selama dua malam sedangkan dia mempunyai sesuatu untuk diwasiatkan, melainkan wasiatnya itu telah ditulis di sisinya.\""
  },
  {
    "id": 39974,
    "hadith_number": 2437,
    "tajuk_hadith": "Sifat Mukmin dalam Pengawalan Diri",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَفَّانُ  ، حَدَّثَنَا أَبُو الْأَشْهَبِ  ، حَدَّثَنَا الْحَسَنُ  ، قَالَ :\" الْمُؤْمِنُ لَا يَأْكُلُ فِي كُلِّ بَطْنِهِ، وَلَا تَزَالُ وَصِيَّتُهُ تَحْتَ جَنْبِهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Affan, telah menceritakan kepada kami Abu Al-Ashhab, telah menceritakan kepada kami Al-Hasan, dia berkata: \"Seorang mukmin tidak makan sampai memenuhi perutnya, dan wasiatnya sentiasa di sisinya (untuk diikuti).\""
  },
  {
    "id": 39975,
    "hadith_number": 2438,
    "tajuk_hadith": "Kelebihan Wasiat dalam Menyempurnakan Zakat yang Terlupa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ ، عَنْ الْقَاسِمِ بْنِ عُمَرَ ، قَالَ : \" قَالَ لِي ثُمَامَةُ بْنُ حَزْنٍ  : مَا فَعَلَ أَبُوكَ؟ قُلْتُ : مَاتَ، قَالَ : فَهَلْ أَوْصَى؟ فَإِنَّهُ كَانَ يُقَالُ :إِذَا أَوْصَى الرَّجُلُ، كَانَتْ وَصِيَّتُهُ تَمَامًا لِمَا ضَيَّعَ مِنْ زَكَاتِهِ \".\nقَالَ أَبُو مُحَمَّد ، وقال غَيْرُهُ : الْقَاسِمُ بْنُ عَمْرٍو",
    "malay_translation": "Telah mengkhabarkan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Hammad bin Salamah, daripada Daud bin Abu Hind, daripada al-Qasim bin Umar, berkata: \"Thumamah bin Hazn bertanya kepada saya: 'Apa khabar ayahmu?' Saya menjawab: 'Dia telah meninggal dunia.' Dia bertanya: 'Adakah dia telah berwasiat?' Sesungguhnya dikatakan: 'Apabila seseorang lelaki berwasiat, maka wasiatnya itu adalah penyempurna bagi zakat yang ditinggalkannya.'\" Abu Muhammad berkata, dan selainnya berkata: Al-Qasim bin Amr."
  },
  {
    "id": 39976,
    "hadith_number": 2439,
    "tajuk_hadith": "Ganjaran Orang yang Memenuhi Wasiat yang Baik",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ ، حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ ، عَنْ الشَّعْبِيِّ ، قَالَ : كَانَ يُقَالُ :\" مَنْ أَوْصَى بِوَصِيَّةٍ فَلَمْ يَجُرْ، وَلَمْ يَحِفْ، كَانَ لَهُ مِنْ الْأَجْرِ مِثْلُ مَا أَنْ لَوْ تَصَدَّقَ بِهِ فِي حَيَاتِهِ \"",
    "malay_translation": "Daripada al-Sya'bi, berkata: “Adalah dikatakan: Sesiapa yang berwasiat dengan wasiat, dan tidak pula melampaui batas, dan tidak pula menyeleweng, maka baginya ganjaran seperti mana dia bersedekah dengannya semasa hayatnya.” (Hadis ini diriwayatkan melalui sanad Abu al-Nu'man, Hammad bin Zaid, dan Daud bin Abi Hind)"
  },
  {
    "id": 39977,
    "hadith_number": 2440,
    "tajuk_hadith": "Nasihat Mengenai Ayat-Ayat Akhir Surah An-Nahl",
    "perawi_melayu": "Sahabat",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَهْلُ بْنُ حَمَّادٍ ، حَدَّثَنَا شُعْبَةُ ، عَنْ أَبِي يُونُسَ ، عَنْ قَزَعَةَ ، قَالَ : قِيلَ لِهَرِمِ بْنِ حَيَّانَ  : أَوْصِهْ، قَالَ :\" أُوصِيكُمْ بِالْآيَاتِ الْأَوَاخِرِ مِنْ سُورَةِ النَّحْلِ ، وَقَرَأَ ابْنُ حَيَّانَ : # ادْعُ إِلَى سَبِيلِ رَبِّكَ بِالْحِكْمَةِ إِلَى قَوْلِهِ : وَالَّذِينَ هُمْ مُحْسِنُونَ سورة النحل آية 125 - 128 # \"",
    "malay_translation": "Diriwayatkan daripada Qaza'ah, dia berkata: \"Dikatakan kepada Harim bin Hayyan: 'Berilah nasihat'. Dia berkata: 'Aku menasihati kamu dengan ayat-ayat terakhir dari Surah An-Nahl,' dan Ibnu Hayyan membacanya: '# Serulah (manusia) kepada jalan Tuhanmu dengan hikmah...' sehingga firman-Nya: '...dan orang-orang yang berbuat baik.' (Surah An-Nahl: 125-128)'"
  },
  {
    "id": 39978,
    "hadith_number": 2441,
    "tajuk_hadith": "Nasihat Rasulullah ﷺ: Kitabullah sebagai Wasiat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ مَالِكِ بْنِ مِغْوَلٍ  ، عَنْ طَلْحَةَ بْنِ مُصَرِّفٍ الْيَامِيِّ  ، قَالَ : سَأَلْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى   : أَوْصَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ : لَا، قُلْت : فَكَيْفَ كُتِبَ عَلَى النَّاسِ الْوَصِيَّةُ أَوْ : أُمِرُوا بِالْوَصِيَّةِ؟ فَقَالَ :أَوْصَى بِكِتَابِ اللَّهِ.\nوقَالَ هُزَيْلُ بْنُ شُرَحْبِيلَ : أَبُو بَكْرٍ كَانَ يَتَأَمَّرُ عَلَى وَصِيِّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَدَّ أَبُو بَكْرٍ أَنَّهُ وَجَدَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَهْدًا، فَخَزَمَ أَنْفَهُ بِخِزَامَةٍ ذلِكَ",
    "malay_translation": "Daripada Talhah bin Musarrif al-Yami, beliau berkata: Aku bertanya kepada Abdullah bin Abi Aufa, “Adakah Rasulullah ﷺ berwasiat?” Beliau menjawab, “Tidak.” Aku bertanya, “Mengapa wasiat itu diwajibkan ke atas manusia?” Beliau berkata, “Baginda berwasiat dengan Kitabullah (Al-Quran).”\nHuzail bin Syurahbil berkata: Abu Bakar memegang tanggungjawab ke atas wasiat Rasulullah ﷺ. Abu Bakar berharap sekiranya dia mendapat perjanjian daripada Rasulullah ﷺ, maka dia akan mematuhinya."
  },
  {
    "id": 39979,
    "hadith_number": 2442,
    "tajuk_hadith": "Tafsir Ayat: Wasiat untuk Ibu Bapa dan Kaum Kerabat",
    "perawi_melayu": "Yazid, daripada Hammam, daripada Qatadah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ ، أنبأنا هَمَّامٌ ، عَنْ قَتَادَةَ  : \" # كُتِبَ عَلَيْكُمْ إِذَا حَضَرَ أَحَدَكُمُ الْمَوْتُ إِنْ تَرَكَ خَيْرًا الْوَصِيَّةُ لِلْوَالِدَيْنِ وَالأَقْرَبِينَ بِالْمَعْرُوفِ حَقًّا عَلَى الْمُتَّقِينَ سورة البقرة آية 180 #، قَالَ :\" الْخَيْرُ : الْمَالُ، كَانَ يُقَالُ : أَلْفًا فَمَا فَوْقَ ذَلِكَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid, telah memberitahu kepada kami Hammam, daripada Qatadah: \"# Dituliskan ke atas kamu, apabila salah seorang daripada kamu didatangi kematian, jika dia meninggalkan harta, (diwajibkan) membuat wasiat untuk ibu bapa dan kaum kerabat dengan cara yang baik, sebagai satu kewajipan ke atas orang-orang yang bertaqwa.” Surah Al-Baqarah ayat 180. # Beliau berkata: \"Al-Khair (harta) ialah harta, dahulu dikatakan: seribu (dirham) atau lebih daripada itu\""
  },
  {
    "id": 39980,
    "hadith_number": 2443,
    "tajuk_hadith": "Nasihat Muhammad bin Abu 'Amrah kepada Keluarga",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ ، أَخْبَرَنَا ابْنُ عَوْنٍ ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ  : \" أَنَّهُأَوْصَى ذِكْرُ مَا أَوْصَى بِهِ، أَوْ هَذَا ذِكْرُ مَا أَوْصَى بِهِ مُحَمَّدُ بْنُ أَبِي عَمْرَةَ بَنِيهِ وَأَهْلَ بَيْتِهِ : # فَاتَّقُوا اللَّهَ وَأَصْلِحُوا ذَاتَ بَيْنِكُمْ وَأَطِيعُوا اللَّهَ وَرَسُولَهُ إِنْ كُنْتُمْ مُؤْمِنِينَ سورة الأنفال آية 1 #، وَأَوْصَاهُمْ بِمَا أَوْصَى بِهِ إِبْرَاهِيمُ بَنِيهِ، وَيَعْقُوبُ : # يَا بَنِيَّ إِنَّ اللَّهَ اصْطَفَى لَكُمُ الدِّينَ فَلا تَمُوتُنَّ إِلا وَأَنْتُمْ مُسْلِمُونَ سورة البقرة آية 132 #، وَأَوْصَاهُمْ أَنْ لَا يَرْغَبُوا أَنْ يَكُونُوا مَوَالِيَ الْأَنْصَارِ وَإِخْوَانَهُمْ فِي الدِّينِ، وَأَنَّ الْعِفَّةَ وَالصِّدْقَ خَيْرٌ وَأَتْقَى مِنْ الزِّنَا وَالْكَذِبِ، إِنْ حَدَثَ بِهِ حَدَثٌ فِي مَرَضِي هَذَا قَبْلَ أَنْ أُغَيِّرَ وَصِيَّتِي هَذِهِ، ثُمَّ ذَكَرَ حَاجَتَهُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah mengkhabarkan kepada kami Ibn 'Aun, daripada Muhammad bin Sirin: \"Sesungguhnya dia telah berwasiat (menyatakan apa yang dia wasiatkan), atau ini adalah sebutan tentang apa yang telah diwasiatkan oleh Muhammad bin Abu 'Amrah kepada anak-anaknya dan ahli keluarganya: #Maka bertaqwalah kepada Allah dan perbaikilah hubungan di antara kamu dan taatlah kepada Allah dan Rasul-Nya jika kamu orang-orang yang beriman (Surah al-Anfal: 1)#, dan dia berwasiat kepada mereka sebagaimana Ibrahim berwasiat kepada anak-anaknya dan Ya'qub: #Wahai anak-anakku, sesungguhnya Allah telah memilihkan agama ini untukmu, maka janganlah sekali-kali kamu mati melainkan dalam keadaan Muslim (Surah al-Baqarah: 132)#, dan dia berwasiat kepada mereka agar tidak ingin menjadi *mawali* (orang yang mempunyai hubungan seperti saudara) kepada golongan Ansar dan saudara mereka dalam agama, dan sesungguhnya iffah (menjaga diri daripada perkara yang haram) dan kejujuran adalah lebih baik dan lebih bertaqwa daripada zina dan berdusta, jika berlaku sesuatu dalam penyakitku ini sebelum aku mengubah wasiatku ini, kemudian dia menyebutkan hajatnya."
  },
  {
    "id": 39981,
    "hadith_number": 2444,
    "tajuk_hadith": "Wasiat Terakhir dan Pengakuan Keimanan",
    "perawi_melayu": "Anas رضي الله عنه",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا أَبُو بَكْرٍ  ، حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ  ، عَنْ ابْنِ سِيرِينَ  ، عَنْ أَنَسٍ  ، قَالَ : \" هَكَذَا كَانُوا يُوصُونَ : هَذَا مَا أَوْصَى بِهِ فُلَانُ بْنُ فُلَانٍ، أَنَّهُيَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ، وَأَنَّ السَّاعَةَ آتِيَةٌ لَا رَيْبَ فِيهَا، وَأَنَّ اللَّهَ يَبْعَثُ مَنْ فِي الْقُبُورِ، وَأَوْصَى مَنْ تَرَكَ بَعْدَهُ مِنْ أَهْلِهِ أَنْ يَتَّقُوا اللَّهَ وَيُصْلِحُوا ذَاتَ بَيْنِهِمْ، وَأَنْ يُطِيعُوا اللَّهَ وَرَسُولَهُ إِنْ كَانُوا مُؤْمِنِينَ، وَأَوْصَاهُمْ بِمَا أَوْصَى بِهِ إِبْرَاهِيمُ بَنِيهِ وَيَعْقُوبُ : # يَا بَنِيَّ إِنَّ اللَّهَ اصْطَفَى لَكُمُ الدِّينَ فَلا تَمُوتُنَّ إِلا وَأَنْتُمْ مُسْلِمُونَ سورة البقرة آية 132 #، وَأَوْصَى إِنْ حَدَثَ بِهِ حَدَثٌ مِنْ وَجَعِهِ هَذَا، أَنَّ حَاجَتَهُ كَذَا وَكَذَا \"",
    "malay_translation": "Diriwayatkan daripada Anas رضي الله عنه, beliau berkata: “Beginilah mereka (para sahabat) memberi wasiat: Inilah wasiat daripada Fulan bin Fulan, bahawa dia bersaksi tiada Tuhan yang berhak disembah melainkan Allah sahaja, tiada sekutu bagi-Nya, dan bahawa Muhammad adalah hamba dan Rasul-Nya, dan bahawa hari Kiamat pasti datang tanpa keraguan padanya, dan bahawa Allah akan membangkitkan mereka yang berada di dalam kubur. Dan beliau berwasiat kepada keluarga yang ditinggalkannya supaya bertaqwa kepada Allah, memperbaiki hubungan sesama mereka, dan supaya mentaati Allah dan Rasul-Nya sekiranya mereka beriman. Dan beliau berwasiat kepada mereka sebagaimana wasiat Ibrahim kepada anak-anaknya dan Ya’qub: “Wahai anak-anakku! Sesungguhnya Allah telah memilih agama ini bagi kamu, maka janganlah kamu mati melainkan dalam keadaan Islam.” (Surah Al-Baqarah: 132). Dan beliau berwasiat jika berlaku musibah daripada kesakitan ini, maka hajatnya adalah begini dan begini.”"
  },
  {
    "id": 39982,
    "hadith_number": 2445,
    "tajuk_hadith": "Wasiat Abu Darda' (Semoga Allah Merahmati)",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْحَكَمُ بْنُ الْمُبَارَكِ ، أَخْبَرَنَا الْوَلِيدُ ، عَنْ حَفْصِ بْنِ غَيْلَانَ ، عَنْ مَكْحُولٍ  حِينَ أَوْصَى، قَالَ : \" نَشَهُّدُ هَذَا فَاشْهَدْ بِهِ :نَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ، وَيُؤْمِنُ بِاللَّهِ، وَيَكْفُرُ بِالطَّاغُوتِ عَلَى ذَلِكَ يَحْيَا إِنْ شَاءَ اللَّهُ، وَيَمُوتُ، وَيُبْعَثُ، وَأَوْصَى فِيمَا رَزَقَهُ اللَّهُ فِيمَا تَرَكَ إِنْ حَدَثَ بِهِ حَدَثٌ وَهُوَ كَذَا وَكَذَا، إِنْ لَمْ يُغَيِّرْ شَيْئًا مِمَّا فِي هَذِهِ الْوَصِيَّةِ \".\nحَدَّثَنَا الْحَكَمُ ، حَدَّثَنَا الْوَلِيدُ ، قَالَ : أَخْبَرَنِي ابْنُ ثَوْبَانَ ، عَنْ أَبِيهِ ، عَنْ مَكْحُولٍ ، قَالَ : هَذِهِ وَصِيَّةُ أَبِي الدَّرْدَاءِ",
    "malay_translation": "Telah menceritakan kepada kami Al-Hakam bin Al-Mubarak, telah mengkhabarkan kepada kami Al-Walid, daripada Hafs bin Ghailan, daripada Makhul (ketika dia berwasiat), dia berkata: \"Kami bersaksi akan hal ini, maka saksikanlah dengannya: Kami bersaksi bahawa tiada Tuhan melainkan Allah yang Esa, tiada sekutu bagi-Nya, dan bahawa Muhammad adalah hamba dan Rasul-Nya, dan beriman kepada Allah, dan kufur kepada Taghut. Atas dasar itu dia hidup, insyaAllah, dan mati, dan dibangkitkan. Dan dia berwasiat tentang apa yang Allah rezekikan kepadanya, tentang apa yang ditinggalkannya, jika terjadi sesuatu kepadanya, dan ia adalah begini dan begini, jika dia tidak mengubah sedikit pun daripada apa yang ada dalam wasiat ini.\" Telah menceritakan kepada kami Al-Hakam, telah menceritakan kepada kami Al-Walid, dia berkata: Telah mengkhabarkan kepadaku Ibnu Tsauban, daripada ayahnya, daripada Makhul, dia berkata: \"Ini adalah wasiat Abu Darda'.\""
  },
  {
    "id": 39983,
    "hadith_number": 2446,
    "tajuk_hadith": "Wasiat Ar-Rabi' bin Khuthaym",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ ، حَدَّثَنَا أَبُو حَيَّانَ التَّيْمِيُّ ، عَنْ أَبِيهِ ، قَالَ : كَتَبَ الرَّبِيعُ بْنُ خُثَيْمٍ وَصِيَّتَهُ : بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ : \" هَذَا مَا أَوْصَى بِهِ الرَّبِيعُ بْنُ خُثَيْمٍ  وَأَشْهَدَ اللَّهَ عَلَيْهِ، وَكَفَى بِاللَّهِ شَهِيدًا، وَجَازِيًا لِعِبَادِهِ الصَّالِحِينَ وَمُثِيبًابِأَنِّي رَضِيتُ بِاللَّهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ نَبِيًّا، وَإِنِّي آمُرُ نَفْسِي وَمَنْ أَطَاعَنِي أَنْ نَعْبُدَ اللَّهَ فِي الْعَابِدِينَ، وَنَحْمَدَهُ فِي الْحَامِدِينَ، وَأَنْ نَنْصَحَ لِجَمَاعَةِ الْمُسْلِمِينَ \"",
    "malay_translation": "Daripada (Riwayat) Ja'far bin 'Aun, daripada Abu Hayyan at-Taimi, daripada bapanya, berkata: Ar-Rabi' bin Khuthaym telah menulis wasiatnya: \"Dengan nama Allah, Yang Maha Pemurah, lagi Maha Mengasihani. Ini adalah apa yang diwasiatkan oleh Ar-Rabi' bin Khuthaym, dan dia bersaksi kepada Allah, dan cukuplah Allah sebagai saksi, dan (Dia) membalas hamba-hamba-Nya yang soleh. Sesungguhnya aku redha Allah sebagai Tuhan, Islam sebagai agama, dan Muhammad sebagai Nabi. Sesungguhnya aku memerintahkan diri ini dan sesiapa yang mengikutku supaya menyembah Allah bersama orang-orang yang menyembah-Nya, memuji-Nya bersama orang-orang yang memuji-Nya, dan memberi nasihat kepada jemaah kaum Muslimin.\""
  },
  {
    "id": 39984,
    "hadith_number": 2447,
    "tajuk_hadith": "Kenyataan Ali tentang Wasiat dan Kebaikan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، عَنْ هِشَامٍ  ، عَنْ أَبِيهِ  : \" أَنَّ عَلِيًّا دَخَلَ عَلَى مَرِيضٍ، فَذَكَرُوا لَهُ الْوَصِيَّةَ، فَقال عَلِيٌّ   :قَالَ اللَّهُ : # إِنْ تَرَكَ خَيْرًا سورة البقرة آية 180 #، وَلَا أُرَاهُ تَرَكَ خَيْرًا \".\nقَالَ حَمَّادٌ : فَحَفِظْتُ أَنَّهُ تَرَكَ أَكْثَرَ مِنْ سَبْعِ مِائَةٍ",
    "malay_translation": "Diriwayatkan daripada Abu Al-Nu'man, diriwayatkan daripada Hammad bin Zaid, daripada Hisham, daripada bapanya: \"Sesungguhnya Ali masuk menemui orang yang sakit, lalu mereka menyebutkan kepadanya tentang wasiat. Kemudian Ali berkata: Allah berfirman: (Jika dia meninggalkan harta yang baik) (Surah Al-Baqarah: 180), dan aku tidak melihat dia meninggalkan harta yang baik\". Hammad berkata: Aku hafal, sesungguhnya dia meninggalkan lebih daripada tujuh ratus."
  },
  {
    "id": 39985,
    "hadith_number": 2448,
    "tajuk_hadith": "Pesanan Ali bin Abi Talib kepada Seorang yang Sakit",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كُنَاسَةَ  ، حَدَّثَنَا هِشَامٌ  ، عَنْ أَبِيهِ  ، قَالَ : \"دَخَلَ عَلِيُّ بْنُ أَبِي طَالِبٍ   عَلَى رَجُلٍ مِنْ قَوْمِهِ يَعُودُهُ، فَقَالَ : أُوصِي؟ قَالَ : لا، لَمْ تَدَعْ مَالًا، فَدَعْ مَالَكَ لِوَلَدِكَ \"",
    "malay_translation": "Muhammad bin Kunasah meriwayatkan, Hisyam meriwayatkan, daripada ayahnya, berkata: \"Ali bin Abi Talib masuk menziarahi seorang lelaki daripada kaumnya yang sakit. Beliau bertanya: 'Adakah kamu mahu membuat wasiat?' Lelaki itu menjawab: 'Tidak, saya tidak meninggalkan harta. Maka tinggalkanlah hartamu untuk anak-anakmu.'"
  },
  {
    "id": 39986,
    "hadith_number": 2449,
    "tajuk_hadith": "Hukum Wasiat Jika Waris Mengakui & Kemudian Menafikan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو زَيْدٍ ، حَدَّثَنَا شُعْبَةُ ، عَنْ مَنْصُورٍ ، عَنْ إِبْرَاهِيمَ  : \" فِي رَجُلٍ أَوْصَى وَالْوَرَثَةُ شُهُودٌ مُقِرُّونَ، فَقَالَ :لَا يَجُوزُ \".\nقَالَ أَبُو مُحَمَّد : يَعْنِي : إِذَا أَنْكَرُوا بَعْدُ",
    "malay_translation": "Telah menceritakan kepada kami Abu Zaid, telah menceritakan kepada kami Syu'bah, daripada Mansur, daripada Ibrahim: \"(Berkaitan) seorang lelaki yang berwasiat, dan para waris menjadi saksi dan mengakui. Maka (Ibrahim) berkata: 'Tidak sah.' Abu Muhammad berkata: 'Maksudnya, jika mereka (waris) menafikan kemudian.'"
  },
  {
    "id": 39987,
    "hadith_number": 2450,
    "tajuk_hadith": "Wasiat Tidak Sah Selepas Kematian",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ ، حَدَّثَنَا شُعْبَةُ ، قَالَ : سَأَلْتُ الحَكَمَ ، وَحَمَّادًا  : \" عَنِ الْأَوْلِيَاءِ يُجِيزُونَ الْوَصِيَّةَ، فَإِذَا مَاتَ لَمْ يُجِيزُوا؟ قَالَا :لَا يَجُوزُ \"",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Syu'bah, dia berkata: Aku bertanya kepada Al-Hakam dan Hammad, “Mengenai wali yang membenarkan wasiat, tetapi apabila (pewasiat) meninggal dunia, mereka tidak membenarkannya?” Mereka berdua menjawab: “Tidak boleh.”"
  },
  {
    "id": 39988,
    "hadith_number": 2451,
    "tajuk_hadith": "Hukum Wasiat Melebihi Sepertiga Harta",
    "perawi_melayu": "Yazid bin Harun (رحمه الله)",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ ، عَنْ عَامِرٍ ،  عَنْ شُرَيْحٍ  : \" فِي الرَّجُلِ يُوصِي بِأَكْثَرَ مِنْ ثُلُثِهِ، قَالَ :إِنْ أَجَازَتْهُ الْوَرَثَةُ، أَجَزْنَاهُ، وَإِنْ قَالَتِ الْوَرَثَةُ : أَجَزْنَاهُ، فَهُمْ بِالْخِيَارِ إِذَا نَفَضُوا أَيْدِيَهُمْ مِنْ الْقَبْرِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun (رحمه الله), daripada Daud bin Abi Hind, daripada 'Amir, daripada Syuraih (رحمه الله): \"(Berkaitan) seorang lelaki yang berwasiat melebihi sepertiga hartanya, beliau berkata: Jika waris-waris merestuinya, kami akan membenarkannya. Dan jika waris-waris berkata: Kami merestuinya, maka mereka mempunyai pilihan (untuk membatalkan) apabila mereka selesai menabur tanah dari kubur.\" "
  },
  {
    "id": 39989,
    "hadith_number": 2452,
    "tajuk_hadith": "Kebenaran Waris dalam Wasiat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا الْمَسْعُودِيُّ  ، عَنْ أَبِي عَوْنٍ  ، عَنْ الْقَاسِمِ  : \" أَنَّ رَجُلًا اسْتَأْذَنَ وَرَثَتَهُ أَنْ يُوصِيَ بِأَكْثَرَ مِنَ الثُّلُثِ، فَأَذِنُوا لَهُ، ثُمَّ رَجَعُوا فِيهِ بَعْدَ مَا مَاتَ، فَسُئِلَ عَبْدُ اللَّهِ   عَنْ ذَلِكَ، فَقَالَ :هَذَا التَّكَرُّهُ لَا يَجُوزُ \"",
    "malay_translation": "Abu Nu'aym meriwayatkan, Mas'udi menceritakan daripada Abi 'Aun, daripada al-Qasim: \"Sesungguhnya seorang lelaki meminta izin daripada warisnya untuk mewasiatkan lebih daripada sepertiga harta. Mereka mengizinkannya. Kemudian mereka menarik balik persetujuan itu selepas kematiannya. Abdullah ditanya mengenai perkara itu, lalu beliau berkata: 'Ini adalah pembatalan yang tidak dibenarkan'\""
  },
  {
    "id": 39990,
    "hadith_number": 2453,
    "tajuk_hadith": "Hukum Wasiat Melebihi Sepertiga dan Persetujuan Waris",
    "perawi_melayu": "Abu An-Nu'man, daripada Hammad bin Zaid, daripada Hisyam, daripada Al-Hasan",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، عَنْ هِشَامٍ  ، عَنْ الْحَسَنِ   : \" فِي الرَّجُلِ يُوصِي بِأَكْثَرَ مِنْ الثُّلُثِ فَرَضِيَ الْوَرَثَةُ، قَالَ :هُوَ جَائِزٌ \".\nقَالَ أَبُو مُحَمَّد : أَجَزْنَاهُ يَعْنِي فِي الْحَيَاةِ",
    "malay_translation": "Diriwayatkan oleh Abu An-Nu'man, Hammad bin Zaid meriwayatkan daripada Hisyam, daripada Al-Hasan: \"Mengenai seorang lelaki yang berwasiat melebihi sepertiga (harta), lalu waris bersetuju, dia berkata: 'Ia dibolehkan.' Abu Muhammad berkata: 'Kami membolehkannya, iaitu semasa hayatnya.'"
  },
  {
    "id": 39991,
    "hadith_number": 2454,
    "tajuk_hadith": "Wasiat Harta: Satu Pertiga Sudah Memadai",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ  ، حَدَّثَنَا هَمَّامٌ  ، حَدَّثَنَا قَتَادَةُ  ، عَنْ يُونُسَ بْنِ جُبَيْرٍ  ، عَنْ مُحَمَّدِ بْنِ سَعْدٍ  ، عَنْ أَبِيهِ   : أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهِ وَهُوَ بِمَكَّةَ ، وَلَيْسَ لَهُ إِلَّا ابْنَةٌ، فَقُلْتُ لَهُ : \" إِنَّهُ لَيْسَ لِي إِلَّا ابْنَةٌ وَاحِدَةٌ، فَأُوصِي بِمَالِي كُلِّهِ؟ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : لَا، قُلْتُ : فَأُوصِي بِالنِّصْفِ؟ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : لَا، قَالَ : فَأُوصِي بِالثُّلُثِ؟ قَالَ : فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :الثُّلُثُ، وَالثُّلُثُ كَثِيرٌ \"",
    "malay_translation": "Abu al-Walid at-Tayalisi meriwayatkan, daripada Hammam, daripada Qatadah, daripada Yunus bin Jubair, daripada Muhammad bin Sa'd, daripada bapanya: Bahawa Nabi SAW masuk menemuinya di Mekah, dan dia hanya mempunyai seorang anak perempuan. Lalu aku berkata kepada Baginda, \"Sesungguhnya aku hanya mempunyai seorang anak perempuan, adakah aku boleh mewasiatkan seluruh hartaku?\" Nabi SAW bersabda, \"Tidak\". Aku bertanya lagi, \"Adakah aku boleh mewasiatkan separuh?\" Nabi SAW bersabda, \"Tidak\". Dia berkata lagi, \"Adakah aku boleh mewasiatkan satu pertiga?\" Baginda bersabda, \"Satu pertiga, dan satu pertiga itu sudah banyak\"."
  },
  {
    "id": 39992,
    "hadith_number": 2455,
    "tajuk_hadith": "Wasiat Nabi SAW Mengenai Harta Ketika Sakit",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاق  ، عَنْ الزُّهْرِيِّ  ، عَنْ عَامِرِ بْنِ سَعْدٍ  ، عَنْ أَبِيهِ  ، قَالَ : \" اشْتَكَيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ حَتَّى أُدْنِفْتُ، فَدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعُودُنِي، فَقُلْتُ : يَا رَسُولَ اللَّهِ، مَا أُرَانِي إِلَّا أَلَمَّ بِي وَأَنَا ذُو مَالٍ كَثِيرٍ، وَإِنَّمَا يَرِثُنِي ابْنَةٌ لِي، أَفَأَتَصَدَّقُ بِمَالِي كُلِّهِ؟ قَالَ : لَا، قُلْتُ : فَبِنِصْفِهِ؟ قَال : لَا، قُلْتُ : فَالثُّلُثِ؟ قَالَ :الثُّلُثُ، وَالثُّلُثُ كَثِيرٌ، إِنَّكَ إِنْ تَتْرُكْ وَرَثَتَكَ أَغْنِيَاءَ، خَيْرٌ مِنْ أَنْ تَتْرُكَهُمْ فُقَرَاءَ يَتَكَفَّفُونَ النَّاسَ بِأَيْدِيهِمْ، وَإِنَّكَ لَا تُنْفِقُ نَفَقَةً إِلَّا آجَرَكَ اللَّهُ فِيهَا، حَتَّى مَا تَجْعَلُ فِي فِي امْرَأَتِكَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah menceritakan kepada kami Muhammad bin Ishaq, dari Az-Zuhri, dari 'Amir bin Sa'd, dari ayahnya, ia berkata: \"Aku sakit bersama Nabi SAW pada haji Wada' sehingga aku hampir mati. Kemudian Rasulullah SAW masuk menziarahiku, lalu aku berkata: \"Wahai Rasulullah, aku melihat diriku seakan-akan ditimpa penyakit, sedangkan aku mempunyai harta yang banyak. Sesungguhnya yang akan mewarisiku hanyalah seorang anak perempuan. Bolehkah aku bersedekah dengan seluruh hartaku?\" Baginda menjawab: \"Tidak.\" Aku berkata: \"Kalau separuhnya?\" Baginda menjawab: \"Tidak.\" Aku berkata: \"Kalau sepertiganya?\" Baginda menjawab: \"Sepertiga, dan sepertiga itu banyak. Sesungguhnya jika kamu meninggalkan warismu dalam keadaan kaya, itu lebih baik daripada kamu meninggalkan mereka dalam keadaan miskin yang meminta-minta kepada manusia dengan tangan mereka. Dan sesungguhnya tidaklah kamu membelanjakan suatu nafkah melainkan Allah akan memberi pahala kepadamu padanya, bahkan apa yang kamu berikan kepada isteri kamu.\" (Hadith ini menerangkan tentang panduan Nabi SAW berkaitan pembahagian harta ketika sakit dan pentingnya meninggalkan waris yang berkemampuan)."
  },
  {
    "id": 39993,
    "hadith_number": 2456,
    "tajuk_hadith": "Wasiat Ziyad bin Matar (Semoga Allah Merahmati)",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ ، عَنْ إِسْحَاق بْنِ سُوَيْدٍ ،  عَنْ الْعَلَاءِ بْنِ زِيَادٍ : \" أَنَّ أَبَاهُ زِيَادَ بْنَ مَطَرٍ  أَوْصَى، فَقَالَ :وَصِيَّتِي مَا اتَّفَقَ عَلَيْهِ فُقَهَاءُ أَهْلِ الْبَصْرَةِ ، فَسَأَلْتُ، فَاتَّفَقُوا عَلَى الْخُمُسِ \"",
    "malay_translation": "Diriwayatkan oleh Sulaiman bin Harb, diriwayatkan oleh Hammad bin Zaid, daripada Ishaq bin Suwaid, daripada Al-'Ala' bin Ziyad: \"Sesungguhnya bapanya, Ziyad bin Matar, telah berwasiat dan berkata: 'Wasiatku adalah apa yang telah disepakati oleh fuqaha (ahli fiqh) dari penduduk Basrah. Aku bertanya, dan mereka sepakat mengenai khumus (1/5)'\""
  },
  {
    "id": 39994,
    "hadith_number": 2457,
    "tajuk_hadith": "Hukum Wasiat bagi Waris Kekerabatan (Kalalah)",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، عَنْ إِسْحَاق بْنِ سُوَيْدٍ  ، عَنْ الْعَلَاءِ بْنِ زِيَادٍ  : أَنَّ رَجُلًا سَأَلَ عُمَرَ بْنَ الْخَطَّابِ  ، فَقَالَ : \" إِنَّ وَارِثِي كَلَالَةٌ، فَأُوصِي بِالنِّصْفِ؟ قَالَ : لَا، قَالَ : فَالثُّلُثِ؟ قَالَ : لَا، قَالَ : فَالرُّبُع؟ قَالَ : لَا، قَالَ : فَالْخُمُس؟ قَالَ : لَا، حَتَّى صَارَ إِلَى الْعُشْرِ، فَقَالَ :أَوْصِ بِالْعُشْرِ \"",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Hammad bin Zaid, dari Ishaq bin Suwaid, dari Al-'Ala' bin Ziyad: Bahawa seorang lelaki bertanya kepada Umar bin Al-Khattab, lalu berkata: \"Sesungguhnya warisku adalah kalalah, adakah aku boleh berwasiat dengan separuh (harta)?\" Beliau (Umar) menjawab: \"Tidak.\" Lelaki itu bertanya lagi: \"Adakah dengan sepertiga?\" Beliau menjawab: \"Tidak.\" Lelaki itu bertanya lagi: \"Adakah dengan seperempat?\" Beliau menjawab: \"Tidak.\" Lelaki itu bertanya lagi: \"Adakah dengan seperlima?\" Beliau menjawab: \"Tidak.\" Sehingga lelaki itu bertanya sehingga sepersepuluh. Lalu beliau (Umar) berkata: \"Berwasiatlah dengan sepersepuluh.\""
  },
  {
    "id": 39995,
    "hadith_number": 2458,
    "tajuk_hadith": "Hadis: Kadar Wasiat Maksimum dalam Islam",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْلَى ، حَدَّثَنَا إِسْمَاعِيل ، عَنْ عَامِرٍ ، قَالَ :\" إِنَّمَا كَانُوا يُوصُونَ بِالْخُمُسِ وَالرُّبُعِ، وَكَانَ الثُّلُثُ مُنْتَهَى الْجَامِحِ.\nقَالَ أَبُو مُحَمَّد : يَعْنِي بِالْجَامِحِ : الْفَرَسَ الْجَمُوحَ",
    "malay_translation": "Telah menceritakan kepada kami Ya'la, telah menceritakan kepada kami Isma'il, dari 'Amir, berkata: \"Sesungguhnya mereka memberi wasiat (harta) dengan seperlima dan seperempat, dan sepertiga adalah had maksimum.\" Abu Muhammad berkata: \"Maksudnya dengan al-Jamih adalah kuda yang liar (tidak terkawal).\""
  },
  {
    "id": 39996,
    "hadith_number": 2459,
    "tajuk_hadith": "Seseorang yang Memiliki Anak Tidak Boleh Membuat Wasiat untuk Sepertiga Harta",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ ، عَنْ حُمَيْدٍ ، عَنْ بَكْرٍ ، قَالَ : \" أَوْصَيْتُ إِلَى حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ ، فَقَالَ :مَا كُنْتُ لِأَقْبَلَ وَصِيَّةَ رَجُلٍ لَهُ وَلَدٌ يُوصِي بِالثُّلُثِ \"",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Hammad bin Salamah, dari Humaid, dari Bakr, berkata: \"Aku mewasiatkan kepada Humaid bin Abdur Rahman, lalu dia berkata: 'Aku tidak akan menerima wasiat seorang lelaki yang mempunyai anak, dia mewasiatkan sepertiga (hartanya)'\""
  },
  {
    "id": 39997,
    "hadith_number": 2460,
    "tajuk_hadith": "Penggunaan Harta Sepertiga",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قَبِيصَةُ ، أَخْبَرَنَا سُفْيَانُ ، عَنْ هِشَامٍ ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ ، عَنْ شُرَيْحٍ ، قَالَ :\" الثُّلُثُ جَهْدٌ وَهُوَ جَائِزٌ \"",
    "malay_translation": "Qabisah meriwayatkan kepada kami, Sufyan mengkhabarkan kepada kami, daripada Hisyam, daripada Muhammad bin Sirin, daripada Syuraih, berkata: \"Sepertiga (harta) adalah kesungguhan dan ia dibolehkan.\""
  },
  {
    "id": 39998,
    "hadith_number": 2461,
    "tajuk_hadith": "Suku Lebih Mereka Cintai Daripada Sepertiga",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ ، عَنْ إِسْرَائِيلَ ، عَنْ مَنْصُورٍ ، عَنْ إِبْرَاهِيمَ ، قَالَ :\" كَانَ السُّدُسُ أَحَبَّ إِلَيْهِمْ مِنْ الثُّلُثِ \"",
    "malay_translation": "Ubaidullah meriwayatkan dari Israil, dari Mansur, dari Ibrahim, beliau berkata: \"Suku (harta) lebih mereka cintai daripada sepertiga (harta).\""
  },
  {
    "id": 39999,
    "hadith_number": 2462,
    "tajuk_hadith": "Amanah Seorang Wasi",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ ، حَدَّثَنَا شَرِيكٌ ، عَنْ مُغِيرَةَ ، عَنْ إِبْرَاهِيمَ ، قَالَ :\" الْوَصِيُّ أَمِينٌ فِيمَا أُوصِيَ إِلَيْهِ بِهِ \"",
    "malay_translation": "Abu Al-Walid meriwayatkan, Syarik meriwayatkan daripada Mughirah, daripada Ibrahim, dia berkata: \"Seorang wasi (pelaksana wasiat) adalah amanah dalam apa yang diwasiatkan kepadanya.\""
  },
  {
    "id": 40000,
    "hadith_number": 2463,
    "tajuk_hadith": "Wasiat Sah dalam Semua Perkara Kecuali Pembelian",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ ، عَنْ أبي وَهْبٍ ، عَنْ مَكْحُولٍ ، قَالَ :\" أَمْرُ الْوَصِيِّ جَائِزٌ فِي كُلِّ شَيْءٍ، إِلَّا فِي الِابْتِيَاعِ، وَإِذَا بَاعَ بَيْعًا لَمْ يُقِلْ \"، وَهُوَ رَأْيُ يَحْيَى بْنِ حَمْزَةَ",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Al-Mubarak, telah menceritakan kepada kami Yahya bin Hamzah, dari Abu Wahb, dari Makhul, berkata: \"Urusan wasiat itu sah dalam segala hal, kecuali dalam pembelian. Dan jika dia menjual sesuatu, dia tidak dapat membatalkannya.\" Dan ini adalah pendapat Yahya bin Hamzah."
  },
  {
    "id": 40001,
    "hadith_number": 2464,
    "tajuk_hadith": "Amanah dalam Perwalian",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ ، حَدَّثَنَا الْوَلِيدُ ، عَنْ الْأَوْزَاعِيِّ ،  عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ ، قَالَ :\" الْوَصِيُّ أَمِينٌ فِي كُلِّ شَيْءٍ، إِلَّا فِي الْعِتْقِ، فَإِنَّ عَلَيْهِ أَنْ يُقِيمَ الْوَلَاءَ \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Al-Mubarak, telah menceritakan kepada kami Al-Walid, dari Al-Awza'i, dari Yahya bin Abu Kathir, dia berkata: \"Wasiat (pemegang amanah) adalah amanah dalam segala hal, kecuali dalam pembebasan hamba, maka sesungguhnya dia harus menegakkan wala' (kesetiaan).\""
  },
  {
    "id": 40002,
    "hadith_number": 2465,
    "tajuk_hadith": "Tindakan Penjaga Harta Anak Yatim",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ ، عَنْ إِسْرَائِيلَ ، عَنْ مَنْصُورٍ ، عَنْ إِبْرَاهِيمَ  : \" فِي مَالِ الْيَتِيمِيَعْمَلُ بِهِ الْوَصِيُّ إِذَا أَوْصَى إِلَى الرَّجُلِ \"",
    "malay_translation": "Daripada 'Ubaidullah, daripada Israil, daripada Mansur, daripada Ibrahim: (Berkenaan) harta anak yatim, hendaklah wasi (penjaga) menguruskannya jika dia telah diamanahkan kepada seorang lelaki."
  },
  {
    "id": 40003,
    "hadith_number": 2466,
    "tajuk_hadith": "Hak Wali Anak Yatim dalam Mendapatkan Syafa'ah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّلْتِ  ، حَدَّثَنَا مُوسَى بْنُ مُحَمَّدٍ  ، عَنْ إِسْمَاعِيل  ، عَنْ الْحَسَنِ  ، قَالَ :\" وَصِيُّ الْيَتِيمِ يَأْخُذُ لَهُ بِالشُّفْعَةِ، وَالْغَائِبُ عَلَى شُفْعَتِهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin As-Salt, telah menceritakan kepada kami Musa bin Muhammad, dari Ismail, dari Al-Hasan, dia berkata: \"Wali anak yatim berhak mendapatkan syafa'ah untuk anak yatim tersebut, dan orang yang ghaib (tidak hadir) tetap memiliki hak syafa'ahnya.\""
  },
  {
    "id": 40004,
    "hadith_number": 2467,
    "tajuk_hadith": "Keadilan Umar bin Abdul Aziz dalam Perkara Tanah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ ، عَنْ عِكْرِمَةَ شَيْخٍ مِنْ أَهْلِ دِمَشْقَ ، قَالَ : \" كُنْتُ عِنْدَ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ، وَعِنْدَهُ سُلَيْمَانُ بْنُ حَبِيبٍ، وَأَبُو قِلَابَةَ ، إِذْ دَخَلَ غُلَامٌ، فَقَالَ :أَرْضُنَا بِمَكَانِ كَذَا وَكَذَا، بَاعَكُمْ الْوَصِيُّ وَنَحْنُ أَطْفَالٌ، فَالْتَفَتَ إِلَى سُلَيْمَانَ بْنِ حَبِيبٍ، فَقَالَ : مَا تَقُولُ؟ قَالَ : فَأَضْجَعَ فِي الْقَوْلِ، فَالْتَفَتَ إِلَى أَبِي قِلَابَةَ، فَقَالَ : مَا تَقُولُ؟ قَالَ : رُدَّ عَلَى الْغُلَامِ أَرْضَهُ، قَالَ : إِذًا يَهْلِكُ مَالُنَا؟ قَالَ : أَنْتَ أَهْلَكْتَهُ \"",
    "malay_translation": "Diriwayatkan daripada Muhammad bin al-Mubarak, diceritakan kepada kami oleh Yahya bin Hamzah, daripada Ikrimah, seorang syeikh dari penduduk Damsyik, berkata: \"Aku berada di sisi Umar bin Abdul Aziz, bersama Sulaiman bin Habib dan Abu Qilabah. Tiba-tiba masuk seorang budak lelaki, lalu berkata: 'Tanah kami di tempat begini dan begitu, telah dijual oleh wasi (penjaga) kepada kamu, sedangkan kami masih kanak-kanak.' Lalu Umar berpaling kepada Sulaiman bin Habib dan bertanya: 'Apa pendapatmu?' Sulaiman teragak-agak dalam memberikan pendapatnya. Kemudian Umar berpaling kepada Abu Qilabah dan bertanya: 'Apa pendapatmu?' Abu Qilabah menjawab: 'Kembalikan tanah itu kepada budak lelaki tersebut.' Umar berkata: 'Jika demikian, harta kita akan binasa?' Abu Qilabah menjawab: 'Engkau yang membinasakannya.'\""
  },
  {
    "id": 40005,
    "hadith_number": 2468,
    "tajuk_hadith": "Pembahagian Harta Pusaka: Setengah dan Satu Pertiga",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ مُوسَى  ، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ  ، عَنْ أَشْعَثَ  ، عَنْ الْحَسَنِ   : \" فِي رَجُلٍ أَوْصَى لِرَجُلٍ بِنِصْفِ مَالِهِ، وَلِآخَرَ بِثُلُثِ مَالِهِ، قَالَ :يَضْرِبَانِ بِذَلِكَ فِي الثُّلُثِ : هَذَا بِالنِّصْفِ، وَهَذَا بِالثُّلُث \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ibrahim bin Musa, daripada Muhammad bin Abdullah, daripada Asy'ath, daripada Al-Hasan: \"(Mengenai) seorang lelaki yang mewasiatkan kepada seorang lelaki dengan setengah hartanya, dan kepada seorang lagi dengan satu pertiga hartanya, beliau berkata: Keduanya (penerima wasiat) akan mengambil dari satu pertiga (harta pusaka): yang ini (mengambil) setengah, dan yang ini (mengambil) satu pertiga.\" (Hadith Mursal, iaitu sanad terputus pada perawi sahabat)"
  },
  {
    "id": 40006,
    "hadith_number": 2469,
    "tajuk_hadith": "Perubahan dalam Wasiat Kecuali Pembebasan Hamba",
    "perawi_melayu": "Abu al-Walid at-Tayalisy, daripada Zaidah, daripada Syaibani, daripada as-Sya'bi",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ ، حَدَّثَنَا زَائِدَةُ ، عَنْ الشَّيْبَانِيِّ ، عَنْ الشَّعْبِيِّ ، قَالَ :\" يُغَيِّرُ صَاحِبُ الْوَصِيَّةِ مِنْهَا مَا شَاءَ، غَيْرَ الْعَتَاقَةِ \"",
    "malay_translation": "Abu al-Walid at-Tayalisy meriwayatkan: Zaidah meriwayatkan daripada as-Syaibani, daripada as-Sya'bi berkata: \"Seseorang yang memberi wasiat boleh mengubahnya sesuka hati, kecuali berkaitan dengan pembebasan hamba.\""
  },
  {
    "id": 40007,
    "hadith_number": 2470,
    "tajuk_hadith": "Perubahan dalam Wasiat Diterima",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ  ، حَدَّثَنَا هَمَّامٌ  ، حَدَّثَنَا قَتَادَةُ  ، عَنْ عَمْرِو بْنِ شُعَيْبٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي رَبِيعَةَ  : \" أَنَّ عُمَرَ بْنَ الْخَطَّابِ  ، قَالَ :\" يُحْدِثُ الرَّجُلُ فِي وَصِيَّتِهِ مَا شَاءَ، وَمِلَاكُ الْوَصِيَّةِ آخِرُهَا \"",
    "malay_translation": "Abu Al-Walid At-Tayalisiyy meriwayatkan, Hammam meriwayatkan, Qatadah meriwayatkan, daripada 'Amr bin Syu'aib, daripada Abdullah bin Abi Rabi'ah, sesungguhnya 'Umar bin Al-Khattab berkata: \"Seseorang itu boleh mengubah dalam wasiatnya mengikut kehendaknya, dan wasiat yang muktamad adalah yang terakhir.\""
  },
  {
    "id": 40008,
    "hadith_number": 2471,
    "tajuk_hadith": "Pembebasan Hamba Semasa Sakit",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَهْلُ بْنُ حَمَّادٍ ، حَدَّثَنَا هَمَّامٌ ، قَالَ : حَدَّثَنِي قَتَادَةُ ، قَالَ : حَدَّثَنِي عَمْرُو بْنُ دِينَارٍ : \" أَنَّ أَبَاهُ أَعْتَقَ رَقِيقًا لَهُ فِي مَرَضِهِ، ثُمَّ بَدَا لَهُ أَنْ يَرُدَّهُمْ وَيُعْتِقَ غَيْرَهُمْ، قَالَ : فَخَاصَمُونِي إِلَى عَبْدِ الْمَلِكِ بْنِ مَرْوَانَ ،فَأَجَازَ عِتْقَ الْآخِرِينَ، وَأَبْطَلَ عِتْقَ الْأَوَّلِينَ \"",
    "malay_translation": "Diriwayatkan oleh Sahl bin Hammad, diriwayatkan oleh Hammam, berkata: Telah menceritakan kepadaku Qatadah, berkata: Telah menceritakan kepadaku Amr bin Dinar: \"Bahawa bapanya membebaskan hamba sahayanya semasa sakitnya, kemudian dia berasa ingin menarik balik pembebasan mereka dan membebaskan orang lain. Kata perawi: Maka mereka mengadu kepadaku kepada Abdul Malik bin Marwan, lalu dia membenarkan pembebasan yang terakhir, dan membatalkan pembebasan yang terdahulu.\""
  },
  {
    "id": 40009,
    "hadith_number": 2472,
    "tajuk_hadith": "Perkataan Terakhir dalam Wasiat",
    "perawi_melayu": "Umar (radiyallahu 'anhu)",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَهْلُ بْنُ حَمَّادٍ  ، حَدَّثَنَا هَمَّامٌ  ، عَنْ عَمْرِو بْنِ شُعَيْبٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي رَبِيعَةَ  ، عَنْ الشَّرِيدِ بْنِ سُوَيْدٍ  ، قَالَ : قَالَ عُمَرُ   :\" يُحْدِثُ الرَّجُلُ فِي وَصِيَّتِهِ مَا شَاءَ، وَمِلَاكُ الْوَصِيَّةِ آخِرُهَا \".\nقَالَ أَبُو مُحَمَّد : هَمَّامٌ لَمْ يَسْمَعْ مِنْ عَمْرٍو، وَبَيْنَهُمَا قَتَادَةُ",
    "malay_translation": "Diriwayatkan daripada Sharid bin Suwaid, beliau berkata: Umar (radiyallahu 'anhu) berkata: \"Seseorang boleh melakukan perubahan dalam wasiatnya sesuka hatinya, dan yang menjadi penentu dalam wasiat adalah yang terakhir.\"\n\nKata Abu Muhammad: Hammam tidak mendengar daripada Amr, dan di antara mereka ada Qatadah."
  },
  {
    "id": 40010,
    "hadith_number": 2473,
    "tajuk_hadith": "Hukum Dua Wasiat",
    "perawi_melayu": "Ibnu al-Mubarak meriwayatkan daripada Ma'mar, daripada az-Zuhri",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ الْمُغِيرَةِ ، قَالَ : ابْنُ الْمُبَارَكِ حَدَّثَنَا، عَنْ مَعْمَرٍ ، عَنِ الزُّهْرِيِّ  : \" فِي الرَّجُلِ يُوصِي بِوَصِيَّةٍ ثُمَّ يُوصِي بِأُخْرَى، قَالَ :هُمَا جَائِزَتَانِ فِي مَالِهِ \"",
    "malay_translation": "Said bin al-Mughirah meriwayatkan: Ibnu al-Mubarak meriwayatkan daripada Ma'mar, daripada az-Zuhri: (Berkata berkenaan) seorang lelaki yang mewasiatkan satu wasiat, kemudian mewasiatkan wasiat yang lain. (Zuhri) berkata: Kedua-duanya (wasiat) itu dibenarkan pada hartanya."
  },
  {
    "id": 40011,
    "hadith_number": 2474,
    "tajuk_hadith": "Ucapan Umar bin Al-Khattab tentang Harta Pusaka",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدٌ  ، عَنْ ابْنِ الْمُبَارَكِ  ، عَنْ مَعْمَرٍ  ، عَنْ قَتَادَةَ  ، قَالَ : قَالَ عُمَرُ بْنُ الْخَطَّابِ   :\" مِلَاكُ الْوَصِيَّةِ آخِرُهَا \"",
    "malay_translation": "Telah menceritakan kepada kami Sa'id, daripada Ibnu Al-Mubarak, daripada Ma'mar, daripada Qatadah, berkata: Umar bin Al-Khattab berkata: \"Intipati wasiat itu adalah pada akhirnya.\""
  },
  {
    "id": 40012,
    "hadith_number": 2475,
    "tajuk_hadith": "Apabila Kadi Mencurigai Wasi",
    "perawi_melayu": "Diriwayatkan oleh Muhammad bin al-Mubarak, daripada al-Walid, daripada al-Awza'i, daripada Yahya. Ia berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ ، حَدَّثَنَا الْوَلِيدُ ، عَنْ الْأَوْزَاعِيِّ ،  عَنْ يَحْيَى ، قَالَ :\" إِذَا اتَّهَمَ الْقَاضِي الْوَصِيَّ لَمْ يَعْزِلْهُ، وَلَكِنْ يُوَكِّلُ مَعَهُ غَيْرَهُ \"وَهُوَ رَأْيُ الْأَوْزَاعِيِّ",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin al-Mubarak, telah menceritakan kepada kami al-Walid, daripada al-Awza'i, daripada Yahya. Ia berkata: \"Apabila kadi mencurigai wasi, dia tidak memecatnya, tetapi melantik orang lain bersamanya.\" Dan ini adalah pandangan al-Awza'i."
  },
  {
    "id": 40013,
    "hadith_number": 2476,
    "tajuk_hadith": "Jual Beli, Perkahwinan Orang Sakit",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ ، حَدَّثَنَا شَرِيكٌ ، عَنْ الشَّيْبَانِيِّ ، عَنْ عَامِرٍ ، قَالَ :\" يَجُوزُ بَيْعُ الْمَرِيضِ وَشِرَاؤُهُ وَنِكَاحُهُ، وَلَا يَكُونُ مِنَ الثُّلُثِ \"",
    "malay_translation": "Abu al-Walid meriwayatkan: Syarik meriwayatkan daripada al-Shaibani, daripada Amir, berkata: \"Harus (sah) jual beli orang sakit, perkahwinannya, dan tidak termasuk dalam harta yang diwasiatkan (sepertiga).\""
  },
  {
    "id": 40014,
    "hadith_number": 2477,
    "tajuk_hadith": "Harta Pesakit dalam Jual Beli dan Pembelian",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ ، حَدَّثَنَا أَبُو عَوَانَةَ ، عَنْ مُطَرِّفٍ ، عَنْ الْحَارِثِ الْعُكْلِيِّ ، قَالَ :\" مَا حَابَى بِهِ الْمَرِيضُ فِي مَرَضِهِ مِنْ بَيْعٍ أَوْ شِرَاءٍ، فَهُوَ فِي ثُلُثِهِ قِيمَةُ عَدْلٍ \"",
    "malay_translation": "Abu Al-Walid meriwayatkan kepada kami, dia berkata: Abu 'Awanah meriwayatkan kepada kami, dari Mutarrif, dari Al-Harith Al-'Ukli, dia berkata: \"Apa sahaja harta yang diberi oleh orang sakit dalam sakitnya dari jualan atau pembelian, maka ia adalah dalam sepertiga hartanya, dengan nilai yang adil.\""
  },
  {
    "id": 40015,
    "hadith_number": 2478,
    "tajuk_hadith": "Hukum Pemberian Wanita Hamil dari Hartanya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ ، عَنْ يَحْيَى هُوَ ابْنُ سَعِيدٍ ، قَالَ : أَعْطَتِ امْرَأَةٌ مِنْ أَهْلِنَا وَهِيَ حَامِلٌ، فَسُئِلَ الْقَاسِمُ ، فَقَالَ : \" هُوَ مِنْ جَمِيعِ الْمَالِ، قَالَ يَحْيَى : وَنَحْنُ نَقُولُ :إِذَا ضَرَبَهَا الْمَخَاضُ فَمَا أَعْطَتْ، فَمِنْ الثُّلُثِ \"",
    "malay_translation": "Abu An-Nu'man meriwayatkan, Hammad bin Zaid meriwayatkan dari Yahya, dia adalah Ibn Sa'id, berkata: Seorang wanita dari kalangan kami telah memberi ketika dia hamil. Al-Qasim ditanya tentang hal itu, lalu dia berkata: \"(Pemberian itu) dari seluruh harta.\" Yahya berkata: “Dan kami berkata: ‘Jika dia telah mengalami sakit bersalin, maka apa yang dia berikan adalah dari sepertiga harta.”"
  },
  {
    "id": 40016,
    "hadith_number": 2479,
    "tajuk_hadith": "Membebaskan Hamba dengan Syarat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا أَبُو شِهَابٍ  ، عَنْ عَمْرٍو  ، عَنْ الْحَسَنِ   : \" فِي رَجُلٍ قَالَ لِغُلَامِهِ : إِنْ دَخَلْتُ دَارَ فُلَانٍ، فَغُلَامِي حُرٌّ، ثُمَّ دَخَلَهَا وَهُوَ مَرِيضٌ، قَالَ :يُعْتَقُ مِنْ الثُّلُثِ، وَإِنْ دَخَلَ فِي صِحَّتِهِ، عُتِقَ مِنْ جَمِيعِ الْمَالِ \"",
    "malay_translation": "Diriwayatkan daripada (nama perawi tidak dinyatakan): Seorang lelaki berkata kepada hambanya: \"Jika aku memasuki rumah Fulan, maka hambaku bebas.\" Kemudian dia memasukinya dalam keadaan sakit. Maka (hamba itu) dibebaskan dari (harta) sepertiga (harta si majikan). Dan jika dia memasukinya dalam keadaan sihat, maka (hamba itu) dibebaskan daripada seluruh harta."
  },
  {
    "id": 40017,
    "hadith_number": 2480,
    "tajuk_hadith": "Menyumbang kepada Waris yang Memerlukan",
    "perawi_melayu": "Marwan bin Muhammad",
    "english_text": "",
    "arabic_text": "أخبرنا مَرْوَانُ بْنُ مُحَمَّدٍ ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ ، حَدَّثَنَا النُّعْمَانُ بْنُ الْمُنْذِرِ ، عَنْ مَكْحُولٍ ، قَالَ :\" إِذَا كَانَ الْوَرَثَةُ مَحَاوِيجَ، فَلَا أَرَى بَأْسًا أَنْ يُرَدَّ عَلَيْهِمْ مِنْ الثُّلُثِ \"، قَالَ يَحْيَى : فَذَكَرْتُ ذَلِكَ لِلْأَوْزَاعِيِّ  فَأَعْجَبَهُ",
    "malay_translation": "Marwan bin Muhammad meriwayatkan, Yahya bin Hamzah menceritakan kepada kami, Nu'man bin Al-Munzir menceritakan kepada kami, daripada Makhul, berkata: \"Jika waris dalam keperluan, maka aku tidak melihat ada salahnya untuk memberi kembali kepada mereka daripada sepertiga (harta).\" Yahya berkata: Aku menyebutkan perkara itu kepada Al-Awza'i, lalu dia kagum."
  },
  {
    "id": 40018,
    "hadith_number": 2481,
    "tajuk_hadith": "Kesaksian dalam Pembahagian Harta Pusaka",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أخبرنا أَبُو النُّعْمَانِ ، حَدَّثَنَا هُشَيْمٌ ، حَدَّثَنَا يُونُسُ ، عَنْ الْحَسَنِ .\nح وأَخْبَرَنَا مُغِيرَةُ ، عَنْ إِبْرَاهِيمَ ، قَالَا :\" إِذَا شَهِدَ شَاهِدَانِ مِنْ الْوَرَثَةِ، جَازَ عَلَى جَمِيعِهِمْ، وَإِذَا شَهِدَ وَاحِدٌ، فَفِي نَصِيبِهِ بِحِصَّتِهِ \"",
    "malay_translation": "Abu An-Nu'man telah mengkhabarkan kepada kami, Hushaum telah menceritakan kepada kami, Yunus telah menceritakan kepada kami, dari Al-Hasan. Dan Mughirah telah mengkhabarkan kepada kami, dari Ibrahim, berkata: \"Apabila dua orang saksi daripada waris memberikan kesaksian, maka ia (kesaksian) diterima ke atas mereka semua. Dan apabila seorang saksi memberikan kesaksian, maka (kesaksiannya diterima) pada bahagiannya, sesuai dengan bahagiannya.\""
  },
  {
    "id": 40019,
    "hadith_number": 2482,
    "tajuk_hadith": "Kesaksian Waris dalam Pembahagian Harta Pusaka",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ ، حَدَّثَنَا هُشَيْمٌ ، حَدَّثَنَا مُطَرِّفٌ : أَنَّهُ سَمِعَ الشَّعْبِيَّ ، يَقُولُ :\" إِذَا شَهِدَ رَجُلٌ مِنْ الْوَرَثَةِ، فَفِي نَصِيبِهِ بِحِصَّتِهِ، ثُمَّ قَالَ : بَعْدَ ذَلِكَ فِي جَمِيعِ حِصَّتِهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu An-Nu'man, telah menceritakan kepada kami Husyaim, telah menceritakan kepada kami Mutharrif: Bahawa dia mendengar Asy-Sya'bi berkata: \"Apabila seorang lelaki daripada waris memberi kesaksian, maka (saksi itu) pada bahagiannya mengikut bahagiannya. Kemudian dia berkata: 'Kemudian daripada itu pada keseluruhan bahagiannya'."
  },
  {
    "id": 40020,
    "hadith_number": 2483,
    "tajuk_hadith": "Hukum Wasiat: Sepertiga dan Seperempat Harta",
    "perawi_melayu": "Abu Al-Walid At-Tayalisi",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ ، حَدَّثَنَا أَبُو شِهَابٍ عَبْدُ رَبِّهِ بْنُ نَافِعٍ ، عَنْ الْأَعْمَشِ ، عَنْ إِبْرَاهِيمَ ، قَالَ :\" إِذَا أَوْصَى الرَّجُلُ بِالثُّلُثِ، وَالرُّبُعِ، فَفِي الْعَيْنِ وَالدَّيْنِ، وَإِذَا أَوْصَى بِخَمْسِينَ أَوْ سِتِّينَ إِلَى الْمِائَةِ، فَفِي الْعَيْنِ حَتَّى يَبْلُغَ الثُّلُثَ \"",
    "malay_translation": "Abu Al-Walid At-Tayalisi meriwayatkan: Abu Shihab 'Abd Rabbih bin Nafi' meriwayatkan daripada Al-A'mash, daripada Ibrahim, berkata: \"Jika seseorang berwasiat dengan sepertiga atau seperempat, maka (wasiat itu) adalah untuk harta dan hutang. Dan jika dia berwasiat dengan lima puluh atau enam puluh sehingga seratus, maka (wasiat itu) adalah untuk harta sehingga mencapai sepertiga (daripada harta).\""
  },
  {
    "id": 40021,
    "hadith_number": 2484,
    "tajuk_hadith": "Seseorang Berhak Mengurus Sepertiga Hartanya",
    "perawi_melayu": "Marwan bin Muhammad",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مَرْوَانُ بْنُ مُحَمَّدٍ  ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ  ، حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدٍ  ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" الْمَرْءُ أَحَقُّ بِثُلُثِ مَالِهِ، يَضَعُهُ فِي أَيِّ مَالِهِ شَاءَ \"",
    "malay_translation": "Marwan bin Muhammad meriwayatkan: Sulaiman bin Bilal menceritakan kepada kami, Ja'far bin Muhammad menceritakan kepada kami, daripada Yazid bin Abdullah bin Qusait, dia berkata: Rasulullah SAW bersabda: \"Seseorang berhak ke atas sepertiga daripada hartanya; dia boleh menggunakannya (belanjakannya) mengikut kehendaknya.\""
  },
  {
    "id": 40022,
    "hadith_number": 2485,
    "tajuk_hadith": "Perumpamaan Sedekah Selepas Kenyang",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ  ، حَدَّثَنَا شُعْبَةُ  ، حَدَّثَنَا أَبُو إِسْحَاق  ، عَنْ أَبِي حَبِيبَةَ  ، قَالَ : سَأَلْتُ أَبَا الدَّرْدَاءِ عَنْ رَجُلٍ جَعَلَ دَرَاهِمَ فِي سَبِيلِ اللَّهِ، فَقَالَ أَبُو الدَّرْدَاءِ   : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَثَلُ الَّذِي يَتَصَدَّقُ عِنْدَ مَوْتِهِ أَوْ يُعْتِقُ، كَالَّذِي يُهْدِي بَعْدَ مَا شَبِعَ \"",
    "malay_translation": "Telah menceritakan kepada kami 'Abdul Samad bin 'Abdul Warith, telah menceritakan kepada kami Syu'bah, telah menceritakan kepada kami Abu Ishaq, dari Abu Habibah, dia berkata: Aku bertanya kepada Abu Darda' mengenai seorang lelaki yang menginfakkan dirham di jalan Allah. Abu Darda' berkata: Rasulullah SAW bersabda: \"Perumpamaan orang yang bersedekah ketika kematiannya atau memerdekakan (hamba), adalah seperti orang yang memberi hadiah setelah dia kenyang.\""
  },
  {
    "id": 40023,
    "hadith_number": 2486,
    "tajuk_hadith": "Pentingnya Memulakan dengan Pembebasan Hamba dalam Wasiat",
    "perawi_melayu": "Al-Mu'alla bin Asad, Wahib, daripada Yunus, daripada Al-Hasan; Muhammad, berkata: Mengikut bahagian.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْمُعَلَّى بْنُ أَسَدٍ  ، حَدَّثَنَا وُهَيْبٌ  ، عَنْ يُونُسَ  ،  عَنْ الْحَسَنِ   : \" فِي الرَّجُلِ يُوصِي بِأَشْيَاءَ وَمِنْهَا الْعِتْقُ، فَيُجَاوِزُ الثُّلُثَ، قَالَ :يُبْدَأُ بِالْعِتْقِ \".\nحَدَّثَنَا الْمُعَلَّى بْنُ أَسَدٍ  ، حَدَّثَنَا وُهَيْبٌ  ، عَنْ أَيُّوبَ  ، عَنْ مُحَمَّدٍ  ، قَالَ : بِالْحِصَصِ",
    "malay_translation": "Telah menceritakan kepada kami Al-Mu'alla bin Asad, telah menceritakan kepada kami Wahib, daripada Yunus, daripada Al-Hasan: \"(Berkenaan) seorang lelaki yang berwasiat dengan beberapa perkara dan antaranya ialah pembebasan hamba, namun melebihi satu pertiga (harta), beliau (Al-Hasan) berkata: 'Dimulakan dengan pembebasan hamba'.\nTelah menceritakan kepada kami Al-Mu'alla bin Asad, telah menceritakan kepada kami Wahib, daripada Ayyub, daripada Muhammad, berkata: 'Mengikut bahagian'."
  },
  {
    "id": 40024,
    "hadith_number": 2487,
    "tajuk_hadith": "Kesan Cacat dalam Wasiat dan Pembebasan Hamba",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ بِشْرٍ ، حَدَّثَنَا الْمُعَافَى ، عَنْ عُثْمَانَ بْنِ الْأَسْوَدِ ، عَنْ عَطَاءٍ ، قَالَ :\" مَنْ أَوْصَى أَوْ أَعْتَقَ، فَكَانَ فِي وَصِيَّتِهِ عَوْلٌ، دَخَلَ الْعَوْلُ عَلَى أَهْلِ الْعَتَاقَةِ، وَأَهْلِ الْوَصِيَّةِ \".\nقَالَ عَطَاءٌ : إِنَّ أَهْلَ الْمَدِينَةِ غَلَبُونَا، يَبْدَءُونَ بِالْعَتَاقَةِ قَبْلُ",
    "malay_translation": "Telah menceritakan kepada kami Al-Hasan bin Bisyr, telah menceritakan kepada kami Al-Mu'affa, daripada Uthman bin Al-Aswad, daripada 'Ata', dia berkata: \"Sesiapa yang berwasiat atau membebaskan hamba, dan terdapat 'aul (kecacatan) dalam wasiatnya, maka 'aul tersebut akan ditanggung oleh orang-orang yang dibebaskan dan orang-orang yang mendapat wasiat\". 'Ata' berkata: \"Sesungguhnya penduduk Madinah telah mengalahkan kami, mereka memulakan dengan pembebasan hamba dahulu."
  },
  {
    "id": 40025,
    "hadith_number": 2488,
    "tajuk_hadith": "Pembahagian Warisan dalam Wasiat Melebihi Satu Pertiga",
    "perawi_melayu": "Abu An-Nu'man, daripada Hammad bin Zaid, berkata: 'Amr bin Dinar berkata' mengenai seseorang yang mewasiatkan pembebasan hamba (i'tiq) dan perkara lain, dan ia melebihi satu pertiga (harta), dia berkata: 'Dengan pembahagian mengikut bahagian masing-masing.'",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ ، قَالَ : قَالَ عَمْرُو بْنُ دِينَارٍ \" فِي الَّذِي يُوصِي بِعِتْقٍ، وَغَيْرِهِ فَيَزِيدُ عَلَى الثُّلُثِ، قَالَ : بِالْحِصَصِ \"",
    "malay_translation": "Abu An-Nu'man meriwayatkan, Hammad bin Zaid meriwayatkan, berkata: 'Amr bin Dinar berkata mengenai seseorang yang mewasiatkan pembebasan hamba dan perkara lain, dan ia melebihi satu pertiga daripada harta. Dia berkata: 'Dengan pembahagian mengikut bahagian masing-masing.'"
  },
  {
    "id": 40026,
    "hadith_number": 2489,
    "tajuk_hadith": "Keutamaan Memerdekakan Hamba dalam Wasiat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، عَنْ كَثِيرِ بْنِ شِنْظِيرٍ  ، عَنْ الْحَسَنِ   : \" فِي رَجُلٍ أَوْصَى بِأَكْثَرَ مِنْ الثُّلُثِ وَفِيهِ عِتْقٌ؟ قَالَ :يُبْدَأُ بِالْعِتْقِ \"",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Hammad bin Zaid, dari Kathir bin Shinzhir, dari Al-Hasan: \"(Berkaitan) seorang lelaki yang berwasiat melebihi sepertiga (harta), dan di dalamnya terdapat pembebasan hamba? Dia (Al-Hasan) berkata: 'Dimulakan dengan pembebasan hamba'."
  },
  {
    "id": 40027,
    "hadith_number": 2490,
    "tajuk_hadith": "Keutamaan Memerdekakan Hamba Sebelum Wasiat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ ، عَنْ إِسْرَائِيلَ ، عَنْ مَنْصُورٍ ، عَنْ إِبْرَاهِيمَ ، قَالَ :\" يُبْدَأُ بِالْعَتَاقَةِ قَبْلَ الْوَصِيَّةِ \"",
    "malay_translation": "Diriwayatkan daripada 'Ubaidullah, daripada Israil, daripada Mansur, daripada Ibrahim, beliau berkata: \"Dimulakan dengan memerdekakan hamba sebelum wasiat.\""
  },
  {
    "id": 40028,
    "hadith_number": 2491,
    "tajuk_hadith": "Wasiat yang Merangkumi Semua Ahli Keluarga",
    "perawi_melayu": "Al-Hasan (seperti diriwayatkan dari Wahib, dari Yunus, dari Al-Hasan)",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْمُعَلَّى بْنُ أَسَدٍ  ، قَالَ : حَدَّثَنَا وُهَيْبٌ  ، عَنْ يُونُسَ  ، عَنْ الْحَسَنِ   : \" فِي الرَّجُلِ يُوصِي لِبَنِي فُلَانٍ، قَالَ :غَنِيُّهُمْ وَفَقِيرُهُمْ وَذَكَرُهُمْ وَأُنْثَاهُمْ سَوَاءٌ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Al-Mu'alla bin Asad, dia berkata: Telah menceritakan kepada kami Wuhaib, dari Yunus, dari Al-Hasan: \"(Berkaitan) seorang lelaki yang berwasiat kepada anak-anak si fulan, dia berkata: 'Orang kaya mereka dan orang miskin mereka, lelaki mereka dan perempuan mereka adalah sama'."
  },
  {
    "id": 40029,
    "hadith_number": 2492,
    "tajuk_hadith": "Wasiat: Anak Lelaki dan Perempuan Adalah Sama",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا أَبُو شِهَابٍ  ، عَنْ عَمْرٍو  ، عَنْ الْحَسَنِ  ، قَالَ :\" إِذَا أَوْصَى لِبَنِي فُلَانٍ، فَالذَّكَرُ وَالْأُنْثَى فِيهِ سَوَاءٌ \"",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Abdullah, telah menceritakan kepada kami Abu Shihab, dari Amr, dari Al-Hasan, dia berkata: \"Apabila dia berwasiat kepada anak-anak si fulan, maka lelaki dan perempuan adalah sama (dalam pembahagian wasiat tersebut).\""
  },
  {
    "id": 40030,
    "hadith_number": 2493,
    "tajuk_hadith": "Harta Pusaka: Wasiat Berkaitan Sebahagian Daripada Harta",
    "perawi_melayu": "Abu Nu'aim, daripada Zaidah bin Musa al-Hamdani, daripada Sayyar bin Abi Karib",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ ، حَدَّثَنَا زَائِدَةُ بْنُ مُوسَى الْهَمْدَانِيُّ ، حَدَّثَنِي سَيَّارُ بْنُ أَبِي كَرِبٍ : \" أَنَّ آتِيًا أَتَى شُرَيْحًا ، فَسَأَلَهُ عَنْ رَجُلٍ أَوْصَى بِسَهْمٍ مِنْ مَالِهِ، قَالَ :تُحْسَبُ الْفَرِيضَةُ، فَمَا بَلَغَ سِهَامَهَا، أُعْطِيَ الْمُوصَى لَهُ سَهْمًا كَأَحَدِهَا \"",
    "malay_translation": "Abu Nu'aim meriwayatkan: Zaidah bin Musa al-Hamdani meriwayatkan: Sayyar bin Abi Karib meriwayatkan: \"Seorang datang kepada Syuraih dan bertanya tentang seorang lelaki yang mewasiatkan sebahagian daripada hartanya. Syuraih berkata: 'Faraid (pembahagian pusaka) dikira, dan sebahagian yang diwasiatkan diberikan kepada penerima wasiat seperti salah satu bahagian daripada faraid tersebut.'\""
  },
  {
    "id": 40031,
    "hadith_number": 2494,
    "tajuk_hadith": "Sedekah kepada Waris Melebihi Separuh",
    "perawi_melayu": "Marwan bin Muhammad",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مَرْوَانُ بْنُ مُحَمَّدٍ ، حَدَّثَنَا سَعِيدٌ ، عَنْ مَكْحُولٍ ، قَالَ :\" إِذَا تَصَدَّقَ الرَّجُلُ عَلَى بَعْضِ وَرَثَتِهِ وَهُوَ صَحِيحٌ بِأَكْثَرَ مِنْ النِّصْفِ، رُدَّ إِلَى الثُّلُثِ، وَإِذَا أَعْطَى النِّصْفَ، جَازَ لَهُ ذَلِكَ \".\nقَالَ سَعِيدٌ : وَكَانَ قُضَاةُ أَهْلِ دِمَشْقَ يَقْضُونَ بِذَلِكَ",
    "malay_translation": "Daripada Makhul berkata: \"Apabila seseorang lelaki bersedekah kepada sebahagian daripada warisnya ketika dia sihat, dengan melebihi daripada separuh (hartanya), maka ia dikembalikan kepada sepertiga. Dan apabila dia memberi (sedekah) separuh, maka ia dibolehkan untuknya.\" Said berkata: “Dan para hakim penduduk Damsyik memutuskan (hukum) dengan itu."
  },
  {
    "id": 40032,
    "hadith_number": 2495,
    "tajuk_hadith": "Kafan Diambil daripada Keseluruhan Harta Peninggalan",
    "perawi_melayu": "Diriwayatkan daripada Ibrahim",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَبِي شَيْبَةَ ، حَدَّثَنَا حَفْصٌ ، عَنْ إِسْمَاعِيل بْنِ أَبِي خَالِدٍ ، عَنِ الْحَكَمِ ، عَنْ إِبْرَاهِيمَ ، قَالَ :\" الْكَفَنُ مِنْ جَمِيعِ الْمَالِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Muhammad bin Abu Syaibah, telah menceritakan kepada kami Hafsh, dari Ismail bin Abu Khalid, dari Al-Hakam, dari Ibrahim, dia berkata: \"Kafan (kain kapan) diambil daripada keseluruhan harta (si mati).\""
  },
  {
    "id": 40033,
    "hadith_number": 2496,
    "tajuk_hadith": "Kewajipan Pengurusan Jenazah dan Hutang Si Mati",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى  ، عَنْ مُعَاذٍ  ، عَنْ أَشْعَثَ  ، عَنْ الْحَسَنِ   : \" فِي رَجُلٍ مَاتَ وَتَرَكَ قِيمَةَ أَلْفَيْ دِرْهَمٍ، وَعَلَيْهِ مِثْلُهَا أَوْ أَكْثَرُ، قَالَ :يُكَفَّنُ مِنْهَا، وَلَا يُعْطَى دَيْنُهُ \"",
    "malay_translation": "Telah menceritakan kepada kami Ibrahim bin Musa, daripada Mu'adz, daripada Asy'ath, daripada Hasan: \"Mengenai seorang lelaki yang meninggal dunia dan meninggalkan harta bernilai dua ribu dirham, dan dia mempunyai hutang yang sama nilai atau lebih. (Hasan berkata): \"Dia dikafankan daripada hartanya itu, dan hutangnya tidak dibayar\"."
  },
  {
    "id": 40034,
    "hadith_number": 2497,
    "tajuk_hadith": "Urutan dalam Pengurusan Jenazah dan Harta",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قَبِيصَةُ ، حَدَّثَنَا سُفْيَانُ ، عَمَّنْ سَمِعَ إِبْرَاهِيمَ ، قَالَ :\" يُبْدَأُ بِالْكَفَنِ، ثُمَّ الدَّيْنِ، ثُمَّ الْوَصِيَّةِ \"",
    "malay_translation": "Qabeesah meriwayatkan kepada kami, Sufyan meriwayatkan kepada kami daripada orang yang mendengar Ibrahim berkata: \"Dimulai dengan kafan (pakaian jenazah), kemudian hutang, kemudian wasiat.\""
  },
  {
    "id": 40035,
    "hadith_number": 2498,
    "tajuk_hadith": "Kewajipan Mengkafankan Wanita yang Meninggal Dunia",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قَبِيصَةُ ، أنبأنا سُفْيَانُ ، عَنْ فِرَاسٍ ، عَنْ الشَّعْبِيِّ  : \" فِي الْمَرْأَةِ تَمُوتُ، قَالَ :\" تُكَفَّنُ مِنْ مَالِهَا، لَيْسَ عَلَى الزَّوْجِ شَيْءٌ \"",
    "malay_translation": "Diriwayatkan daripada Qabeesah, dari Sufyan, dari Firas, dari Al-Sha'bi: “Mengenai seorang wanita yang meninggal dunia, dia (Al-Sha'bi) berkata: “Hendaklah dikafankan daripada hartanya, dan suami tidak bertanggungjawab terhadap apa-apa.”"
  },
  {
    "id": 40036,
    "hadith_number": 2499,
    "tajuk_hadith": "Kain Kafan dan Hanut daripada Harta Modal",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ الْمُغِيرَةِ ، عَنْ ابْنِ الْمُبَارَكِ ، عَنْ ابْنِ جُرَيْجٍ ،  عَنْ عَطَاءٍ ، قَالَ :\" الْحَنُوطُ، وَالْكَفَنُ مِنْ رَأْسِ الْمَالِ \"",
    "malay_translation": "Telah menceritakan kepada kami Sa'id bin Al-Mughirah, dari Ibnu Al-Mubarak, dari Ibnu Juraij, dari 'Atha', beliau berkata: \"Hanut (wangian untuk mayat) dan kain kafan diambil daripada harta modal (harta peninggalan si mati).\""
  },
  {
    "id": 40037,
    "hadith_number": 2500,
    "tajuk_hadith": "Kain Kafan dari Harta Pusaka",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ ، عَنْ عَلِيِّ بْنِ مُسْهِرٍ ، عَنْ إِسْمَاعِيل ، عَنْ الْحَسَنِ ، قَالَ :\" الْكَفَنُ مِنْ وَسَطِ الْمَالِ، يكفن على قدر ما كان يلبس في حياته، ثم يخرج الدين، ثم الثلث \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin 'Uyaynah, daripada Ali bin Mushir, daripada Ismail, daripada Hasan, beliau berkata: \"Kain kafan diambil daripada harta pusaka. Dikafankan (si mati) dengan kadar pakaian yang biasa dipakainya semasa hidupnya, kemudian dikeluarkan hutang, kemudian (barulah) sepertiga (dari harta diwasiatkan).\""
  },
  {
    "id": 40038,
    "hadith_number": 2501,
    "tajuk_hadith": "Kewajipan Menerima Wasiat",
    "perawi_melayu": "Abu Nu'man, daripada Husha, daripada Mansur, daripada Al-Hasan",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا هُشَيْمٌ  ، أَنْبَأَنَا مَنْصُورٌ  ، عَنِ الْحَسَنِ  ، أَنَّهُ كَانَ يَقُولُ :\" إِذَا أَوْصَى الرَّجُلُ إِلَى الرَّجُلِ وَهُوَ غَائِبٌ، فَلْيَقْبَلْ وَصِيَّتَهُ، وَإِنْ كَانَ حَاضِرًا، فَهُوَ بِالْخِيَارِ : إِنْ شَاءَ، قَبِلَ، وَإِنْ شَاء، َتَرَكَ \"",
    "malay_translation": "Al-Hasan berkata: 'Jika seseorang memberi wasiat kepada seseorang yang ghaib, maka hendaklah ia menerima wasiat tersebut. Jika ia hadir, maka ia mempunyai pilihan: jika ia mahu, ia menerima, dan jika ia mahu, ia meninggalkan."
  },
  {
    "id": 40039,
    "hadith_number": 2502,
    "tajuk_hadith": "Penerimaan Wasiat oleh Pemegang Amanah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا صَالِحُ بْنُ عَبْدِ اللَّهِ ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ ،  عَنْ أَيُّوبَ ، قَالَ : سَأَلْتُ الْحَسَنَ ، وَمُحَمَّدًا  عَنِ \" الرَّجُلِ يُوصِي إِلَى الرَّجُلِ، قَالَا :نَخْتَارُ أَنْ يَقْبَلَ \"",
    "malay_translation": "Saleh bin Abdullah telah menceritakan kepada kami, Hammad bin Zaid menceritakan kepada kami, daripada Ayyub, berkata: Aku bertanya kepada Hasan dan Muhammad tentang seorang lelaki yang memberi wasiat kepada seorang lelaki lain. Mereka berkata: Kami lebih memilih dia menerimanya."
  },
  {
    "id": 40040,
    "hadith_number": 2503,
    "tajuk_hadith": "Penerimaan Wasiat Ketika Ketiadaan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَسْعَدَ  ، حَدَّثَنَا أَبُو بَكْرٍ  ، عَنْ هِشَامٍ  ، عَنِ الْحَسَنِ  ، قَالَ :\" إِذَا أَوْصَى الرَّجُلُ إِلَى الرَّجُلِ وَهُوَ غَائِبٌ، فَإِذَا قَدِمَ فَإِنْ شَاءَ، قَبِلَ ، فَإِذَا قَبِلَ، لَمْ يَكُنْ لَهُ أَنْ يَرُدَّ \"",
    "malay_translation": "Muhammad bin As'ad telah meriwayatkan kepada kami, Abu Bakr telah meriwayatkan kepada kami, daripada Hisyam, daripada Al-Hasan, beliau berkata: \"Apabila seseorang mewasiatkan kepada orang lain sedangkan dia (orang yang diberi wasiat) tiada, apabila dia datang, jika dia mahu, dia boleh menerima. Apabila dia menerima, maka dia tidak boleh menolak.\" "
  },
  {
    "id": 40041,
    "hadith_number": 2504,
    "tajuk_hadith": "Kewajipan Memenuhi Wasiat yang Telah Diterima",
    "perawi_melayu": "Al-Waddah bin Yahya meriwayatkan",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْوَضَّاحُ بْنُ يَحْيَى  ، حَدَّثَنَا أَبُو بَكْرٍ  ، عَنْ هِشَامٍ  ، عَنْ الْحَسَنِ  ، قَالَ :\" إِذَا أَوْصَى الرَّجُلُ إِلَى الرَّجُلِ، فَعُرِضَتْ عَلَيْهِ الْوَصِيَّةُ، وَكَانَ غَائِبًا فَقَبِلَ، لَمْ يَكُنْ لَهُ أَنْ يَرْجِعَ \"",
    "malay_translation": "Diriwayatkan daripada Al-Hasan: “Apabila seseorang lelaki mewasiatkan kepada seorang lelaki yang lain, lalu wasiat itu disampaikan kepadanya dan dia berada dalam keadaan ghaib (tidak hadir), kemudian dia menerimanya, maka tidak boleh baginya untuk menarik balik (wasiat tersebut).”"
  },
  {
    "id": 40042,
    "hadith_number": 2505,
    "tajuk_hadith": "Harta Pusaka: Pembahagian kepada Penerima yang Meninggal Dunia",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ ، عَنْ شعبة ، عَنْ أَبِي مَعْشَرٍ ، عَنْ إِبْرَاهِيمَ ، قَالَ :\" إِذَا أَوْصَى الرَّجُلُ لِإِنْسَانٍ، وَهُوَ غَائِبٌ، وَكَانَ مَيِّتًا، وَهُوَ لَا يَدْرِي، فَهِيَ رَاجِعَةٌ \"",
    "malay_translation": "Jaafar bin Aun meriwayatkan daripada Syu'bah, daripada Abu Ma'shar, daripada Ibrahim, berkata: \"Apabila seseorang lelaki mewasiatkan sesuatu kepada seseorang yang tidak hadir, sedangkan orang itu telah meninggal dunia dan dia (si pemberi wasiat) tidak mengetahuinya, maka wasiat itu adalah terbatal.\""
  },
  {
    "id": 40043,
    "hadith_number": 2506,
    "tajuk_hadith": "Hamba yang Dimerdekakan Melalui Wasiat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى  ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ  ، حَدَّثَنَا يُونُسُ  ، عَنْ الْحَسَنِ  ، قَالَ :\" إِذَا أَوْصَى لِعَبْدِهِ ثُلُثَ مَالِهِ، رُبُعَ مَالِهِ، خُمُسَ مَالِهِ، فَهُوَ مِنْ مَالِهِ دَخَلَتْهُ عَتَاقَةٌ \"",
    "malay_translation": "Muhammad bin Isa meriwayatkan kepada kami, Yazid bin Zurai' meriwayatkan kepada kami, Yunus meriwayatkan kepada kami, daripada Al-Hasan, beliau berkata: \"Apabila seseorang berwasiat kepada hambanya dengan sepertiga hartanya, atau seperempat hartanya, atau seperlima hartanya, maka hamba itu telah dimerdekakan dari hartanya.\" (Maksudnya hamba tersebut akan dimerdekakan)."
  },
  {
    "id": 40044,
    "hadith_number": 2507,
    "tajuk_hadith": "Rezeki Terhalang dan Amalan Menjelang Kematian",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْلَى ، عَنْ إِسْمَاعِيل ،  عَنْ قَيْسٍ ، قَالَ : كَانَ يُقَالُ :\" إِنَّ الرَّجُلَ لَيُحْرَمُ بَرَكَةَ مَالِهِ فِي حَيَاتِهِ، فَإِذَا كَانَ عِنْدَ الْمَوْتِ، تَزَوَّدَ بِفَجْرَةٍ \"",
    "malay_translation": "Diriwayatkan daripada Ya'la, daripada Ismail, daripada Qais, berkata: Dikatakan: \"Sesungguhnya seseorang itu dihalang keberkatan hartanya semasa hidupnya, tetapi apabila hampir kematian, dia mengambil bekalan dengan amalan (sedekah/kebajikan).\""
  },
  {
    "id": 40045,
    "hadith_number": 2508,
    "tajuk_hadith": "Perihal Kerasnya Kehidupan dan Pembaziran di Akhir Hayat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا أَبُو زُبَيْدٍ  ، حَدَّثَنَا حُصَيْنٌ  ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ  ، عَنْ أَبِيهِ  ، قَالَ : قَالَ عَبْدُ اللَّهِ   :\" الْمُرَّانِ : الْإِمْسَاكُ فِي الْحَيَاةِ، وَالتَّبْذِيرُ عِنْدَ الْمَوْتِ \".\nقَالَ أَبُو مُحَمَّد : يُقَالُ : مُرٌّ فِي الْحَيَاةِ، وَمُرٌّ عِنْدَ الْمَوْتِ",
    "malay_translation": "Diriwayatkan daripada Abdullah (bin Mas'ud): \"Dua perkara yang pahit: menahan harta semasa hidup, dan membazir harta ketika meninggal dunia.\" Abu Muhammad berkata: Dikatakan: Pahit semasa hidup, dan pahit ketika meninggal dunia."
  },
  {
    "id": 40046,
    "hadith_number": 2509,
    "tajuk_hadith": "Wasiat dengan Kadar Bahagian Anak",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ ، عَنْ إِسْرَائِيلَ ، عَنْ مَنْصُورٍ ،  عَنْ إِبْرَاهِيمَ ، قَالَ :\" إِذَا أَوْصَى الرَّجُلُ لِآخَرَ بِمِثْلِ نَصِيبِ ابْنِهِ، فَلَا يَتِمُّ لَهُ مِثْلُ نَصِيبِهِ، حَتَّى يَنْقُصَ مِنْهُ \"",
    "malay_translation": "Telah menceritakan kepada kami Ubaidullah, dari Israil, dari Mansur, dari Ibrahim, dia berkata: \"Apabila seseorang mewasiatkan kepada orang lain dengan kadar bahagian anaknya, maka tidak sempurna baginya seperti bahagian anaknya, sehingga berkurang daripadanya.\""
  },
  {
    "id": 40047,
    "hadith_number": 2510,
    "tajuk_hadith": "Hukum Pembahagian Harta Warisan: Contoh Kes",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ ، عَنْ الشَّعْبِيِّ  : \" فِي رَجُلٍ كَانَ لَهُ ثَلَاثَةُ بَنِينَ، فَأَوْصَى لِرَجُلٍ مِثْلَ نَصِيبِ أَحَدِهِمْ لَوْ كَانُوا أَرْبَعَةً، قَالَ الشَّعْبِيُّ :يُعْطَى الْخُمُسَ \"",
    "malay_translation": "Diriwayatkan daripada Asy-Sya'bi tentang seorang lelaki yang mempunyai tiga orang anak lelaki, lalu mewasiatkan kepada seorang lelaki seperti bahagian salah seorang daripada mereka jika mereka seramai empat orang. Asy-Sya'bi berkata: 'Orang itu diberikan seperlima daripada harta tersebut.'"
  },
  {
    "id": 40048,
    "hadith_number": 2511,
    "tajuk_hadith": "Wasiat Bagi Mereka Yang Memiliki Dua Anak",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ ، حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ ، قَالَ : \" سَأَلْنَا عَامِرًا  عَنْ رَجُلٍ تَرَكَ ابْنَيْنِ، وَأَوْصَى بِمِثْلِ نَصِيبِ أَحَدِهِمْ لَوْ كَانُوا ثَلَاثَةً، قَالَ :أَوْصَى بِالرُّبُعِ \"",
    "malay_translation": "Muhammad bin Isa meriwayatkan: Yazid bin Zurai' meriwayatkan: Daud bin Abi Hind meriwayatkan: Kami bertanya kepada Amir tentang seorang lelaki yang meninggalkan dua orang anak, dan berwasiat dengan kadar yang sama seperti bahagian salah seorang daripada mereka jika mereka bertiga. Beliau menjawab: 'Dia berwasiat dengan seperempat (harta).' "
  },
  {
    "id": 40049,
    "hadith_number": 2512,
    "tajuk_hadith": "Wasiat dengan Kadar Bahagian Pewaris",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ ، حَدَّثَنَا أَبُو عَوَانَةَ ، عَنْ مُغِيرَةَ ، عَنْ إِبْرَاهِيمَ ، قَالَ : \" فِي رَجُلٍ أَوْصَى بِمِثْلِ نَصِيبِ بَعْضِ الْوَرَثَةِ، قَالَ :لَا يَجُوزُ، وَإِنْ كَانَ أَقَلَّ مِنْ الثُّلُثِ \"، قَالَ أَبُو مُحَمَّد : هُوَ حَسَنٌ",
    "malay_translation": "Abu Nu'man meriwayatkan: Abu 'Awanah meriwayatkan daripada Mughirah, daripada Ibrahim, beliau berkata: \"Mengenai seorang lelaki yang berwasiat dengan kadar bahagian sebahagian pewaris, beliau berkata: 'Tidak dibenarkan, walaupun kurang daripada sepertiga'.\" Abu Muhammad berkata: \"Ia adalah hasan (baik).\""
  },
  {
    "id": 40050,
    "hadith_number": 2513,
    "tajuk_hadith": "Hukum Pemberian Sedekah daripada Hasil Hamba",
    "perawi_melayu": "Qabeesah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قَبِيصَةُ ، أنبأنا سُفْيَانُ ، عَنْ ابْنِ أَبِي السَّفَرِ ، عَنْ الشَّعْبِيِّ  : \" فِي رَجُلٍ أَوْصَى فِي غَلَّةِ عَبْدِهِ بِدِرْهَمٍ، وَغَلَّتُهُ سِتَّةٌ، قَالَ :لَهُ سُدُسُهُ \"",
    "malay_translation": "Telah menceritakan kepada kami Qabeesah, yang memberitahu kami Sufyan, daripada Ibnu Abi As-Safar, daripada Asy-Sya'bi, mengenai seorang lelaki yang mewasiatkan daripada hasil hamba lelaki beliau sebanyak satu dirham, sedangkan hasilnya adalah enam. Beliau berkata: 'Baginya (mendapat) seperenam daripadanya.'"
  },
  {
    "id": 40051,
    "hadith_number": 2514,
    "tajuk_hadith": "Pengakuan Mengenai Harta Warisan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أخبرنا قَبِيصَةُ ، قَالَ : سَمِعْتُ سُفْيَانَ ، يَقُولُ :\" إِذَا أَقَرَّ لِوَارِثٍ وَلِغَيْرِ وَارِثٍ بِمِائَةِ دِرْهَمٍ، قَالَ : أَرَى أَنْ أُبْطِلَهُمَا جَمِيعًا \"",
    "malay_translation": "Qabeesah meriwayatkan: Saya mendengar Sufyan berkata: \"Jika seseorang mengakui kepada seorang waris dan bukan waris dengan seratus dirham, dia berkata: Saya berpendapat bahawa kedua-duanya (pengakuan) hendaklah dibatalkan.\" "
  },
  {
    "id": 40052,
    "hadith_number": 2515,
    "tajuk_hadith": "Pengakuan Pewaris Tidak Sah",
    "perawi_melayu": "Muslim, Hamam, Qatadah, dari Ibnu Sirin, dari Syuraih",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسْلِمٌ ، حَدَّثَنَا هَمَّامٌ ، حَدَّثَنَا قَتَادَةُ ، عَنْ ابْنِ سِيرِينَ ، عَنْ شُرَيْحٍ ، قَالَ :\" لَا يَجُوزُ إِقْرَارٌ لِوَارِثٍ، قَالَ : وقال الْحَسَنُ  : أَحَقُّ مَا جَازَ عَلَيْهِ عِنْدَ مَوْتِهِ : أَوَّلَ يَوْمٍ مِنْ أَيَّامِ الْآخِرَةِ، وَآخِرَ يَوْمٍ مِنْ أَيَّامِ الدُّنْيَا \"",
    "malay_translation": "Muslim meriwayatkan: Hamam meriwayatkan: Qatadah meriwayatkan, dari Ibnu Sirin, dari Syuraih, berkata: \"Pengakuan seorang pewaris adalah tidak sah.\" Hasan berkata: \"Yang paling tepat untuknya adalah pada hari pertama dari hari-hari akhirat dan hari terakhir dari hari-hari dunia.\""
  },
  {
    "id": 40053,
    "hadith_number": 2516,
    "tajuk_hadith": "Warisan dan Wasiat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ ، أنبأنا خَالِدٌ ، عَنْ خَالِدٍ ، عَنْ أَبِي قِلَابَةَ ، قَالَ :\" لَا يَجُوزُ لِوَارِثٍ وَصِيَّةٌ \"",
    "malay_translation": "Telah menceritakan kepada kami Amru bin Aun, telah mengkhabarkan kepada kami Khalid, dari Khalid, dari Abu Qilabah, dia berkata: \"Tidak boleh bagi seorang waris (menerima) wasiat.\""
  },
  {
    "id": 40054,
    "hadith_number": 2517,
    "tajuk_hadith": "Pengakuan Hutang Maharnya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ ، عَنْ حُمَيْدٍ  : \" أَنَّ رَجُلًا يُكْنَى أَبَا ثَابِتٍأَقَرَّ لِامْرَأَتِهِ عِنْدَ مَوْتِهِ أَنَّ لَهَا عَلَيْهِ أَرْبَعَ مِائَةِ دِرْهَمٍ مِنْ صَدَاقِهَا، فَأَجَازَهُ الْحَسَنُ  \"",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Hammad bin Zaid, dari Humaid: \"Sesungguhnya seorang lelaki yang bergelar Abu Thabit mengaku kepada isterinya ketika kematiannya bahawa isterinya berhak mendapat empat ratus dirham daripada maharnya. Lalu Hasan membenarkannya.\""
  },
  {
    "id": 40055,
    "hadith_number": 2518,
    "tajuk_hadith": "Larangan Wasiat kepada Waris",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا هِشَامٌ الدَّسْتَوَائِيُّ  ، حَدَّثَنَا قَتَادَةُ  ، عَنْ شَهْرِ بْنِ حَوْشَبٍ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ  ، عَنْ عَمْرِو بْنِ خَارِجَةَ  ، قَالَ : كُنْتُ تَحْتَ نَاقَةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ تَقْصَعُ بِجِرَّتِهَا، وَلُعَابُهَا يَنُوصُ بَيْنَ كَتِفَيَّ، سَمِعْتُهُ يَقُولُ :\" أَلَا إِنَّ اللَّهَ قَدْ أَعْطَى كُلَّ ذِي حَقٍّ حَقَّهُ، فَلَا يَجُوزُ وَصِيَّةٌ لِوَارِثٍ \"",
    "malay_translation": "Muslim bin Ibrahim meriwayatkan: Hisham Ad-Dastawa'i meriwayatkan kepada kami: Qatadah meriwayatkan kepada kami, daripada Syahr bin Hausyab, daripada Abdur Rahman bin Ghanm, daripada Amr bin Kharijah, berkata: \"Saya berada di bawah unta Nabi ﷺ, dan unta itu sedang mengunyah makanan, dan air liurnya mengalir di antara dua bahuku. Saya mendengar baginda bersabda: 'Ketahuilah bahawa Allah telah memberikan kepada setiap yang berhak akan haknya, maka tidak boleh ada wasiat kepada waris.'"
  },
  {
    "id": 40056,
    "hadith_number": 2519,
    "tajuk_hadith": "Perintah Wasiat untuk Ibu Bapa dan Kerabat (Dibatalkan)",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ ، أنبأنا هَمَّامٌ ، عَنْ قَتَادَةَ ، قَال : # إِذَا حَضَرَ أَحَدَكُمُ الْمَوْتُ إِنْ تَرَكَ خَيْرًا الْوَصِيَّةُ لِلْوَالِدَيْنِ وَالأَقْرَبِينَ بِالْمَعْرُوفِ حَقًّا عَلَى الْمُتَّقِينَ سورة البقرة آية 180 #،فَأَمَرَ أَنْ يُوصِيَ لِوَالِدَيْهِ وَأَقَارِبِهِ، ثُمَّ نُسِخَ بَعْدَ ذَلِكَ فِي سُورَةِ النِّسَاءِ ، فَجَعَلَ لِلْوَالِدَيْنِ نَصِيبًا مَعْلُومًا، وَأَلْحَقَ لِكُلِّ ذِي مِيرَاثٍ نَصِيبَهُ مِنْهُ، وَلَيْسَتْ لَهُمْ وَصِيَّةٌ، فَصَارَتْ الْوَصِيَّةُ لِمَنْ لَا يَرِثُ مِنْ قَرِيبٍ وَغَيْرِهِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah mengkhabarkan kepada kami Hammam, daripada Qatadah, dia berkata: “Apabila salah seorang daripada kamu didatangi kematian, jika dia meninggalkan harta, maka wasiat untuk kedua ibu bapa dan kerabat secara baik adalah kewajipan bagi orang-orang yang bertaqwa. (Surah Al-Baqarah ayat 180). Maka, diperintahkan agar mewasiatkan kepada kedua ibu bapa dan kerabatnya, kemudian dimansukhkan selepas itu dalam Surah An-Nisa’, lalu dijadikan bagi kedua ibu bapa bahagian yang tertentu, dan disertakan bagi setiap waris bahagiannya daripada harta pusaka, dan mereka tidak lagi mempunyai wasiat. Maka, jadilah wasiat itu untuk mereka yang tidak mewarisi daripada kerabat dan selainnya.”"
  },
  {
    "id": 40057,
    "hadith_number": 2520,
    "tajuk_hadith": "Hukum Faraid Pewarisan dalam Islam",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا وَرْقَاءُ  ، عَنْ ابْنِ أَبِي نَجِيحٍ  ، عَنْ عَطَاءٍ  ،  عَنْ ابْنِ عَبَّاسٍ  ، قَالَ :\" كَانَ الْمَالُ لِلْوَلَدِ، وَكَانَتْ الْوَصِيَّةُ لِلْوَالِدَيْنِ وَالْأَقْرَبِينَ، فَنَسَخَ اللَّهُ مِنْ ذَلِكَ مَا أَحَبَّ، فَجَعَلَ لِلذَّكَرِ مِثْلَ حَظِّ الْأُنْثَيَيْنِ، وَجَعَلَ لِلْأَبَوَيْنِ لِكُلِّ وَاحِدٍ مِنْهُمَا السُّدُسَ وَالثُّلُثَ، وَجَعَلَ لِلْمَرْأَةِ الثُّمُنَ وَالرُّبُعَ، وَلِلزَّوْجِ الشَّطْرَ وَالرُّبُعَ \"",
    "malay_translation": "Diriwayatkan daripada Ibn 'Abbas: “Harta dahulu adalah untuk anak-anak, dan wasiat adalah untuk ibu bapa dan kaum kerabat. Kemudian Allah memansuhkan daripada yang demikian itu apa yang Dia kehendaki. Lalu Allah menjadikan bahagian lelaki seperti bahagian dua orang perempuan. Allah menjadikan untuk ibu bapa, bagi setiap seorang daripada mereka (bapa dan ibu) seperenam (jika si mati mempunyai anak) dan sepertiga (jika si mati tidak mempunyai anak). Dan Allah menjadikan bahagian perempuan seperdelapan (jika si mati mempunyai anak) dan seperempat (jika si mati tidak mempunyai anak), dan untuk suami adalah setengah (jika si mati tidak mempunyai anak) dan seperempat (jika si mati mempunyai anak).”"
  },
  {
    "id": 40058,
    "hadith_number": 2521,
    "tajuk_hadith": "Wasiat untuk Ibu Bapa dan Kaum Kerabat (Ayat Al-Quran)",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ إِسْمَاعِيل ، حَدَّثَنَا أَبُو تُمَيْلَةَ ، عَنْ الْحُسَيْنِ بْنِ وَاقِدٍ ، عَنْ يَزِيدَ ، عَنْ عِكْرِمَةَ ، وَالْحَسَنِ  :# إِنْ تَرَكَ خَيْرًا الْوَصِيَّةُ لِلْوَالِدَيْنِ وَالأَقْرَبِينَ سورة البقرة آية 180 #، فكانت الوصية كذلك، حتى نسختها آية الميراث \"",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Ismail, telah menceritakan kepada kami Abu Tumailah, daripada Al-Husain bin Waqid, daripada Yazid, daripada Ikrimah, dan Al-Hasan : # 'Jika dia meninggalkan harta, (hendaklah) berwasiat untuk ibu bapa dan kaum kerabatnya' (Surah Al-Baqarah: Ayat 180) #, maka wasiat itu adalah seperti itu, sehingga dihapuskan oleh ayat-ayat tentang warisan."
  },
  {
    "id": 40059,
    "hadith_number": 2522,
    "tajuk_hadith": "Hak Memenuhi Wasiat Walaupun Saudara Kaya",
    "perawi_melayu": "Diriwayatkan oleh Sulaiman bin Harb, daripada Hammad bin Salamah, daripada Humaid, daripada Al-Hasan.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ حُمَيْدٍ  ، عَنْ الْحَسَنِ  ، \" سُئِلَ عَنْ رَجُلٍ أَوْصَى وَلَهُ أَخٌ مُوسِرٌ، أَيُوصِ لَهُ؟ قَالَ :نَعَمْ، وَإِنْ كَانَ رَبَّ عِشْرِينَ أَلْفًا، ثُمَّ قَالَ : وَإِنْ كَانَ رَبَّ مِائَةِ أَلْفٍ، فَإِنَّ غِنَاهُ لَا يَمْنَعُهُ الْحَقَّ \"",
    "malay_translation": "Al-Hasan ditanya tentang seorang lelaki yang membuat wasiat, dan dia mempunyai saudara yang kaya. Bolehkah dia diberi wasiat? Beliau menjawab: 'Ya, walaupun dia mempunyai dua puluh ribu (mata wang),' kemudian berkata: 'Walaupun dia mempunyai seratus ribu (mata wang), kekayaannya tidak menghalangnya daripada (menerima) hak.'"
  },
  {
    "id": 40060,
    "hadith_number": 2523,
    "tajuk_hadith": "Hukum Pedang yang Dihadiahkan dengan Syarat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَفَّانُ ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ ، حَدَّثَنَا قَتَادَةُ ، عَنْ الْحَسَنِ ، وَسَعِيدُ بْنُ الْمُسَيِّبِ  : \" في رجل قَالَ : سَيْفِي لِفُلَانٍ، فَإِنْ مَاتَ فُلَانٌ، فَلِفُلَانٍ، فَإِنْ مَاتَ فُلَانٌ، فَمَرْجِعُهُ إِلَيَّ، قَالَا :هُوَ لِلْأَوَّلِ \".\nقَالَ : وَقَالَ حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ  : يُمْضَى كَمَا قَالَ",
    "malay_translation": "Telah menceritakan kepada kami 'Affan, telah menceritakan kepada kami Hammad bin Salamah, telah menceritakan kepada kami Qatadah, dari Al Hasan dan Sa'id bin Al Musayyab: \"(tentang) seorang lelaki yang berkata: 'Pedangku untuk Fulan, jika Fulan meninggal, maka untuk Fulan, jika Fulan meninggal, maka kembalinya kepadaku.' Keduanya (Al Hasan dan Sa'id) berkata: 'Ia (pedang) untuk orang pertama'.\"\nBerkata: Dan berkata Humaid bin 'Abdur Rahman: 'Ia berlaku sebagaimana yang dikatakan'."
  },
  {
    "id": 40061,
    "hadith_number": 2524,
    "tajuk_hadith": "Harta yang Diberikan Bersyarat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَفَّانُ ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ : أَنَّ عُرْوَةَ ، قَالَ : \" فِي الرَّجُلِ يُعْطِي الرَّجُلَ الْعَطَاءَ، فَيَقُولُ : هُوَ لَكَ، فَإِذَا مُتَّ، فَلِفُلَانٍ، فَإِذَا مَاتَ فُلَانٌ، فَلِفُلَانٍ، وَإِذَا مَاتَ فُلَانٌ، فَمَرْجِعُهُ إِلَيَّ.\nقَالَ :يُمْضَى كَمَا قَالَ، وَإِنْ كَانُوا مِائَةً \"",
    "malay_translation": "Daripada 'Urwah, beliau berkata: \"Seorang lelaki memberikan sesuatu pemberian kepada seorang lelaki lain, lalu berkata: 'Ini adalah untukmu, tetapi apabila kamu meninggal dunia, maka untuk si fulan, dan apabila si fulan meninggal dunia, maka untuk si fulan yang lain, dan apabila si fulan yang lain meninggal dunia, maka ia akan kembali kepadaku.' Dia berkata: 'Ia akan dilaksanakan seperti yang dikatakannya, walaupun mereka seramai seratus orang.'"
  },
  {
    "id": 40062,
    "hadith_number": 2525,
    "tajuk_hadith": "Wasiat kepada Selain Keluarga",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ ، حَدَّثَنَا شَيْبَةُ بْنُ هِشَامٍ الرَّاسِبِيُّ ، وَكَثِيرُ بْنُ مَعْدَانَ ، قَالَا : سَأَلْنَا سَالِمَ بْنَ عَبْدِ اللَّهِ عَنْ \" الرَّجُلِ يُوصِي فِي غَيْرِ قَرَابَتِهِ، فَقَالَ سَالِمٌ  :هِيَ حَيْثُ جَعَلَهَا، قَالَ : فَقُلْنَا : إِنَّ الْحَسَنَ  يَقُولُ : يُرَدُّ عَلَى الْأَقْرَبِينَ، فَأَنْكَرَ ذَلِكَ، وَقَالَ قَوْلًا شَدِيدًا \"",
    "malay_translation": "Diriwayatkan oleh Muslim bin Ibrahim, Hammad bin Zaid, Shaiba bin Hisham Ar-Rasibi, dan Kathir bin Ma'dan. Mereka berkata: Kami bertanya kepada Salim bin Abdullah tentang \"Seseorang yang berwasiat kepada selain keluarganya\". Salim menjawab: \"Ia (wasiat) tetap sah seperti yang telah ditetapkannya.\" Kami berkata: Sesungguhnya Al-Hasan berkata: \"(Harta wasiat) dikembalikan kepada kerabat terdekat\". Salim mengingkarinya dan berkata dengan keras."
  },
  {
    "id": 40063,
    "hadith_number": 2526,
    "tajuk_hadith": "Kewajipan Memenuhi Wasiat untuk Kaum Kerabat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا أَبُو شِهَابٍ  ، عَنْ عَمْرٍو  ، عَنْ الْحَسَنِ  ، قَالَ :\" إِذَا أَوْصَى الرَّجُلُ فِي قَرَابَتِهِ، فَهُوَ لِأَقْرَبِهِمْ بِبَطْنٍ : الذَّكَرُ وَالْأُنْثَى فِيهِ سَوَاءٌ \"",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Abdullah, telah menceritakan kepada kami Abu Shihab, daripada 'Amr, daripada Al-Hasan, dia berkata: \"Apabila seseorang berwasiat kepada kaum kerabatnya, maka wasiat itu adalah untuk yang paling dekat nasabnya. Lelaki dan perempuan dalam hal ini adalah sama.\" "
  },
  {
    "id": 40064,
    "hadith_number": 2527,
    "tajuk_hadith": "Ketetapan Pembebasan Hamba Jika Tuan Meninggal Dunia",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ ، حَدَّثَنَا أَبُو بَكْرٍ ، عَنْ مُطَرِّفٍ ، عَنْ الشَّعْبِيِّ  : \" فِي رَجُلٍ قَالَ : أَحَدُ غُلَامَيَّ حُرٌّ ثُمَّ مَاتَ، وَلَمْ يُبَيِّنْ، قَالَ :الْوَرَثَةُ بِمَنْزِلَتِهِ يُعْتِقُونَ أَيَّهُمَا أَحَبُّوا \"",
    "malay_translation": "Diriwayatkan daripada Ahmad bin Abdullah, daripada Abu Bakr, daripada Mutarrif, daripada al-Sha'bi, (mengenai) seorang lelaki yang berkata: 'Salah seorang daripada dua hambaku bebas,' kemudian dia meninggal dunia, dan dia tidak menjelaskan (hamba mana yang dimaksudkan). Al-Sha'bi berkata: 'Warisan (si mati) adalah pada kedudukannya (iaitu, mereka bebas memilih), membebaskan mana-mana daripada mereka yang mereka suka.'"
  },
  {
    "id": 40065,
    "hadith_number": 2528,
    "tajuk_hadith": "Hamba yang Dibebaskan Tergantung pada Kematian",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ يُونُسَ  ،  عَنْ الْحَسَنِ   : \" أَنَّ رَجُلًا قَالَ فِي مَرَضِهِ : لِفُلَانٍ كَذَا وَلِفُلَانٍ كَذَا، وَعَبْدِي فُلَانٌ حُرٌّ، وَلَمْ يَقُلْ : إِنْ حَدَثَ بِي حَدَثٌ، فَبَرَأَ، قَالَ :هُوَ مَمْلُوكٌ \"",
    "malay_translation": "Daripada Al-Hasan, bahawa seorang lelaki berkata semasa sakitnya, \"Untuk si fulan begini dan untuk si fulan begitu, dan hambaku si fulan bebas.\" Dan dia tidak berkata, \"Jika sesuatu terjadi kepadaku.\" Kemudian dia sembuh. Beliau berkata: \"Dia (hamba tersebut) tetap menjadi hamba.\""
  },
  {
    "id": 40066,
    "hadith_number": 2529,
    "tajuk_hadith": "Hamba Dilepaskan Ketika Kematian dan Tanggungan Hutang",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ ، حَدَّثَنَا أَبُو بَكْرٍ ، عَنْ مُطَرِّفٍ ، عَنْ الشَّعْبِيِّ  : \" فِي رَجُلٍ أَعْتَقَ غُلَامَهُ عِنْدَ الْمَوْتِ، وَلَيْسَ لَهُ غَيْرُهُ، وَعَلَيْهِ دَيْنٌ، قَالَ :يَسْعَى لِلْغُرَمَاءِ فِي ثَمَنِهِ \"",
    "malay_translation": "Diriwayatkan dari Ash-Sha'bi: \"Mengenai seorang lelaki yang memerdekakan hambanya ketika kematiannya, dan dia tidak mempunyai harta lain kecuali hamba tersebut, sedangkan dia mempunyai hutang, (Ash-Sha'bi) berkata: 'Hendaklah hamba tersebut diusahakan (dijual) untuk membayar hutang kepada mereka yang berpiutang (kreditur)'"
  },
  {
    "id": 40067,
    "hadith_number": 2530,
    "tajuk_hadith": "Hamba Dilepaskan Sebelum Membayar Harga",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا هَمَّامٌ  ، حَدَّثَنَا قَتَادَةُ  ، عَنْ الْحَسَنِ  : \" أَنَّ رَجُلًا اشْتَرَى عَبْدًا بِتِسْعِ مِائَةِ دِرْهَمٍ، فَأَعْتَقَهُ وَلَمْ يَقْضِ ثَمَنَ الْعَبْدِ، وَلَمْ يَتْرُكْ شَيْئًا، فَقَالَ عَلِيٌّ   :يَسْعَى الْعَبْدُ فِي ثَمَنِهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Al-Walid, telah menceritakan kepada kami Hammam, telah menceritakan kepada kami Qatadah, daripada Al-Hasan: \"Sesungguhnya seorang lelaki membeli seorang hamba dengan harga sembilan ratus dirham, kemudian dia membebaskan hamba itu dan belum membayar harga hamba itu, dan dia tidak meninggalkan apa-apa. Maka Ali berkata: 'Hamba itu akan berusaha untuk membayar harganya'.\""
  },
  {
    "id": 40068,
    "hadith_number": 2531,
    "tajuk_hadith": "Mudabbar dari Sepertiga",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مَنْصُورُ بْنُ سَلَمَةَ  ، عَنْ شَرِيكٍ  ، عَنْ الْأَشْعَثِ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ  ، قَالَ :\" الْمُدَبَّرُ مِنْ الثُّلُثِ \"",
    "malay_translation": "Mansur bin Salamah meriwayatkan daripada Syarik, daripada Al-Asy'ath, daripada Nafi', daripada Ibnu Umar, beliau berkata: \"Mudabbar (hamba yang dijanjikan merdeka selepas kematian tuannya) daripada sepertiga (harta tuannya).\""
  },
  {
    "id": 40069,
    "hadith_number": 2532,
    "tajuk_hadith": "Pengurusan Harta 'Mudabbar' daripada Satu Pertiga",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مَنْصُورُ بْنُ سَلَمَةَ ، عَنْ شَرِيكٍ ، عَنْ مَنْصُورٍ ، عَنْ إِبْرَاهِيمَ ، قَالَ :\" الْمُدَبَّرُ مِنْ الثُّلُثِ \"",
    "malay_translation": "Mansur bin Salamah meriwayatkan daripada Syarik, daripada Mansur, daripada Ibrahim, berkata: \"(Harta) 'Mudabbar' (yang diuruskan) adalah daripada satu pertiga (harta).\""
  },
  {
    "id": 40070,
    "hadith_number": 2533,
    "tajuk_hadith": "Membebaskan Hamba dari Harta Warisan",
    "perawi_melayu": "Sulaiman bin Harb, daripada Hammad bin Zaid, daripada Kathir, daripada Al-Hasan",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، عَنْ كَثِيرٍ  ، عَنْ الْحَسَنِ  ، قَالَ :\" الْمُعْتَقُ عَنْ دُبُرٍ مِنَ الثُّلُثِ \"",
    "malay_translation": "Al-Hasan berkata: \"Seorang hamba yang dibebaskan (selepas kematian tuannya) boleh dibebaskan dari sepertiga harta (warisan).\""
  },
  {
    "id": 40071,
    "hadith_number": 2534,
    "tajuk_hadith": "Wanita Merdeka yang Dibebaskan dan Anak-anaknya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ حُمَيْدٍ  ، عَنْ الْحَسَنِ  ، قَالَ :\" الْمُعْتَقَةُ عَنْ دُبُرٍ وَوَلَدُهَا مِنْ الثُّلُثِ \"",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Hammad bin Salamah, dari Humaid, dari Al-Hasan, dia berkata: \"Wanita yang dimerdekakan dari dubur (setelah diceraikan) dan anak-anaknya adalah dari sepertiga (harta pewarisan).\""
  },
  {
    "id": 40072,
    "hadith_number": 2535,
    "tajuk_hadith": "Hamba yang Dibebaskan daripada Harta Pusaka",
    "perawi_melayu": "Abu al-Walid, daripada Shu'bah, daripada Mansur, daripada Ibrahim",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ ، حَدَّثَنَا شُعْبَةُ ، قَالَ : مَنْصُورٌ أَخْبَرَنِي، عَنْ إِبْرَاهِيمَ ، قَالَ :\" الْمُعْتَقُ عَنْ دُبُرٍ مِنَ الثُّلُثِ \"",
    "malay_translation": "Abu al-Walid meriwayatkan, Shu'bah meriwayatkan, Mansur memaklumkan kepadaku, daripada Ibrahim, beliau berkata: \"Hamba yang dimerdekakan daripada harta pusaka hanya (boleh diwasiatkan) daripada sepertiga (harta).\""
  },
  {
    "id": 40073,
    "hadith_number": 2536,
    "tajuk_hadith": "Perihal Mudabbar (Hamba yang Dijanjikan Kebebasan)",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ ، عَنْ أَبِي عَبْدِ اللَّهِ الشَّقَرِيِّ ، وَأَبِي هَاشِمٍ ، عَنْ إِبْرَاهِيمَ ، قَالَ :\" الْمُدَبَّرُ مِنْ جَمِيعِ الْمَالِ \"",
    "malay_translation": "Abu An-Nu'man meriwayatkan, Hammad bin Zaid meriwayatkan daripada Abu Abdullah As-Syaqri dan Abu Hasyim daripada Ibrahim, beliau berkata: \"Mudabbar (hamba yang dijanjikan kebebasan) itu (menjadi tanggungan) daripada seluruh harta.\" (Maknanya, harta mudabbar itu dianggap sebagai miliknya)."
  },
  {
    "id": 40074,
    "hadith_number": 2537,
    "tajuk_hadith": "Hamba yang Dibebaskan dari Harta Keseluruhan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ  ، أَنْبَأَنَا أَبُو عَوَانَةَ  ، عَنْ أَبِي بِشْرٍ  ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ  ، قَالَ :\" الْمُعْتَقُ عَنْ دُبُرٍ مِنْ جَمِيعِ الْمَالِ \".\nسُئِلَ أَبُو مُحَمَّد : بِأَيِّهِمَا تَقُولُ؟ قَالَ : مِنَ الثُّلُثِ",
    "malay_translation": "Diriwayatkan daripada Al-Hakam bin Al-Mubarak, telah memberitahu kepada kami Abu 'Awanah, daripada Abu Bisyr, daripada Sa'id bin Jubair, beliau berkata: \"Hamba yang dibebaskan pada waktu kematiannya (sebagai wasiat) adalah dari keseluruhan harta.\" Abu Muhammad ditanya: \"Dengan yang mana kamu katakan?\" Beliau menjawab: \"Daripada sepertiga (harta).\""
  },
  {
    "id": 40075,
    "hadith_number": 2538,
    "tajuk_hadith": "Saksi terhadap Wasiat",
    "perawi_melayu": "Saeed bin Al-Mughirah, Makhlad, daripada Hisham, daripada Al-Hasan",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ الْمُغِيرَةِ  ، حَدَّثَنَا مَخْلَدٌ  ، عَنْ هِشَامٍ  ، عَنْ الْحَسَنِ  ، قَالَ :\" لَا تَشْهَدْ عَلَى وَصِيَّةٍ حَتَّى تُقْرَأَ عَلَيْكَ، وَلَا تَشْهَدْ عَلَى مَنْ لَا تَعْرِفُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Sa'id bin Al-Mughirah, telah menceritakan kepada kami Makhlad, daripada Hisham, daripada Al-Hasan, beliau berkata: \"Janganlah kamu menjadi saksi terhadap wasiat sehingga ia dibacakan kepadamu, dan janganlah kamu menjadi saksi terhadap orang yang tidak kamu kenali.\""
  },
  {
    "id": 40076,
    "hadith_number": 2539,
    "tajuk_hadith": "Wasiat Umar bin Al-Khattab untuk Ibu kepada Anak-anaknya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ حُمَيْدٍ  ، عَنْ الْحَسَنِ  : أَنَّ عُمَرَ بْنَ الْخَطَّابِ  \" أَوْصَى لِأُمَّهَاتِ أَوْلَادِهِ بِأَرْبَعَةِ آلَافٍ، أَرْبَعَةِ آلَافٍ، لِكُلِّ امْرَأَةٍ مِنْهُنَّ \"",
    "malay_translation": "Diriwayatkan daripada Hasan bahawa Umar bin Al-Khattab (R.A.) mewasiatkan kepada ibu kepada anak-anaknya sebanyak empat ribu (4000), empat ribu (4000) untuk setiap wanita daripada mereka."
  },
  {
    "id": 40077,
    "hadith_number": 2540,
    "tajuk_hadith": "Kebolehan Wasiat Bagi Mereka Berusia Tiga Belas Tahun",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ ، أنبأنا ابْنُ أَبِي الزِّنَادِ ، عَنْ أَبِيهِ ، عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ  : أَنَّهُ\" أَجَازَ وَصِيَّةَ ابْنِ ثَلَاثَ عَشْرَةَ سَنَةً \"",
    "malay_translation": "Telah menceritakan kepada kami Yahya bin Hassan, telah mengkhabarkan kepada kami Ibnu Abi Zinad, dari bapanya, dari Umar bin Abdul Aziz: Sesungguhnya dia membenarkan wasiat bagi mereka yang berusia tiga belas tahun."
  },
  {
    "id": 40078,
    "hadith_number": 2541,
    "tajuk_hadith": "Keabsahan Wasiat Kanak-kanak (7 Tahun)",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ ، حَدَّثَنَا زُهَيْرٌ ، عَنْ أَبِي إِسْحَاق ، قَالَ : \" أَوْصَى غُلَامٌ مِنْ الْحَيِّ ابْنُ سَبْعِ سِنِينَ، فَقَالَ شُرَيْحٌ  :إِذَا أَصَابَ الْغُلَامُ فِي وَصِيَّتِهِ، جَازَتْ \".\nقَالَ أَبُو مُحَمَّد : يُعْجِبُنِي، وَالْقُضَاةُ لَا يُجِيزُونَ",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Zuhair, dari Abu Ishaq, dia berkata: \"Seorang budak lelaki dari kaum (Hayy) mewasiatkan sesuatu ketika berumur tujuh tahun.\" Syuraih berkata: \"Jika budak lelaki itu benar dalam wasiatnya, maka wasiat itu boleh dilaksanakan.\" Abu Muhammad berkata: \"Saya menyukainya, tetapi para hakim tidak membenarkannya."
  },
  {
    "id": 40079,
    "hadith_number": 2542,
    "tajuk_hadith": "Sah Perjanjian Abbas bin Ismail bin Marthad untuk Ibu Susuan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ ، أَخْبَرَنَا يُونُسُ ، حَدَّثَنَا أَبُو إِسْحَاق أَنَّهُ \" شَهِدَ شُرَيْحًا أَجَازَ وَصِيَّةَ عَبَّاسِ بْنِ إِسْمَاعِيل بْنِ مَرْثَدٍ لِظِئْرِهِ مِنْ أَهْلِ الْحِيرَةِ \"، وَعَبَّاسٌ صَبِيٌّ",
    "malay_translation": "Telah menceritakan kepada kami Ja'far bin 'Aun, telah mengkhabarkan kepada kami Yunus, telah menceritakan kepada kami Abu Ishaq bahawa dia menyaksikan Syuraih membenarkan wasiat 'Abbas bin Ismail bin Marthad kepada ibu susuannya dari kalangan penduduk Al-Hirah, sedangkan 'Abbas masih seorang kanak-kanak."
  },
  {
    "id": 40080,
    "hadith_number": 2543,
    "tajuk_hadith": "Wasiat Kanak-Kanak yang Menjauhi Perkara Buruk",
    "perawi_melayu": "Ja'far bin 'Awn, daripada Yunus, daripada Abu Ishaq, daripada Syuraih",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ ، أنبأنا يُونُسُ ، حَدَّثَنَا أَبُو إِسْحَاق ، قَالَ : قَالَ شُرَيْحٌ  :\" إِذَا اتَّقَى الصَّبِيُّ الرَّكِيَّةَ، جَازَتْ وَصِيَّتُهُ \"",
    "malay_translation": "Ja'far bin 'Awn meriwayatkan, daripada Yunus, daripada Abu Ishaq, berkata: Syuraih berkata: \"Apabila seorang kanak-kanak menjauhi perkara yang buruk, wasiatnya adalah sah.\""
  },
  {
    "id": 40081,
    "hadith_number": 2544,
    "tajuk_hadith": "Perihal Wasiat kepada Pengasuh Anak Kecil",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قَبِيصَةُ ، حَدَّثَنَا سُفْيَانُ ، عَنْ أَبِي إِسْحَاق  : \" أَنَّ غُلَامًا مِنْهُمْ حِينَ ثُغِرَ يُقَالُ لَهُ مَرْثَدٌ :أَوْصَى لِظِئْرٍ لَهُ مِنْ أَهْلِ الْحِيرَةِ بِأَرْبَعِينَ دِرْهَمًا، فأجازه شريح ، وَقَالَ : مَنْ أَصَابَ الْحَقَّ، أَجَزْنَاهُ \"",
    "malay_translation": "Diriwayatkan daripada Qabisa, diriwayatkan daripada Sufyan, daripada Abu Ishaq: \"Sesungguhnya seorang budak lelaki daripada mereka, apabila telah baligh, dipanggil Marthad: berwasiat kepada pengasuhnya dari kalangan penduduk Al-Hirah dengan empat puluh dirham. Maka Shuraih membenarkannya, dan berkata: 'Sesiapa yang memperolehi kebenaran, kami benarkan'\""
  },
  {
    "id": 40082,
    "hadith_number": 2545,
    "tajuk_hadith": "Wasiat Seorang Budak Lelaki dengan Telaga",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا يَحْيَى  : أَنَّ أَبَا بَكْرِ بْنَ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ  أَخْبَرَهُ : \" أَنَّ غُلَامًا بِالْمَدِينَةِ حَضَرَهُ الْمَوْتُ وَوَرَثَتُهُ بِالشَّامِ ، وَأَنَّهُمْ ذَكَرُوا لِعُمَرَ أَنَّهُ يَمُوتُ، فَسَأَلُوهُ أَنْ يُوصِيَ، فَأَمَرَهُ عُمَرُ   أَنْ يُوصِيَ،فَأَوْصَى بِبِئْرٍ يُقَالُ لَهَا : بِئْرُ جُشَمَ، وَإِنَّ أَهْلَهَا بَاعُوهَا بِثَلَاثِينَ أَلْفًا، ذَكَرَ أَبُو بَكْرٍ أَنَّ الْغُلَامَ كَانَ ابْنَ عَشْرِ سِنِينَ، أَوْ ثِنْتَيْ عَشْرَةَ \"",
    "malay_translation": "Diriwayatkan daripada Yazid bin Harun, telah mengkhabarkan kepada kami Yahya: Bahawa Abu Bakr bin Muhammad bin Amr bin Hazm telah mengkhabarkan kepadanya: \"Sesungguhnya seorang budak lelaki di Madinah telah hampir ajalnya sedangkan warisnya berada di Syam. Mereka menyebut kepada Umar bahawa budak lelaki tersebut akan meninggal dunia, lalu mereka meminta Umar untuk memerintahkannya berwasiat. Maka Umar memerintahkannya untuk berwasiat. Lalu, dia berwasiat dengan sebuah telaga yang dinamakan Telaga Jusham. Dan sesungguhnya penduduknya telah menjualnya dengan tiga puluh ribu (mata wang). Abu Bakr menyebutkan bahawa budak lelaki tersebut berusia sepuluh atau dua belas tahun.\""
  },
  {
    "id": 40083,
    "hadith_number": 2546,
    "tajuk_hadith": "Wasiat Kanak-kanak dalam Harta",
    "perawi_melayu": "Yazid, daripada Hisyam ad-Dastawa'i, daripada Hammad, daripada Ibrahim",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَزِيدُ ، عَنْ هِشَامٍ الدَّسْتَوَائِيِّ ، عَنْ حَمَّادٍ ، عَنْ إِبْرَاهِيمَ ، قَالَ :\" يَجُوزُ وَصِيَّةُ الصَّبِيِّ في ماله في الثلث، فما دونه، وإنما يمنعه وليه ذلك في الصحة رهبة الفاقة عليه، فأما عند الموت، فليس له أن يمنعه \"",
    "malay_translation": "Telah menceritakan kepada kami Yazid, daripada Hisyam ad-Dastawa'i, daripada Hammad, daripada Ibrahim, berkata: \"Boleh (diterima) wasiat kanak-kanak ke atas hartanya dalam sepertiga (daripadanya), atau kurang daripada itu. Sesungguhnya walinya menghalangnya daripada berbuat demikian ketika sihat kerana takut kemiskinan menimpanya. Adapun ketika mati, maka tidak boleh baginya menghalangnya (daripada berwasiat).\""
  },
  {
    "id": 40084,
    "hadith_number": 2547,
    "tajuk_hadith": "Menunaikan Wasiat Jariah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قَبِيصَةُ ، حَدَّثَنَا سُفْيَانُ ، عَنْ خالد الحذاء ، وَأَيُّوبَ ، عَنْ ابْنِ سِيرِينَ ، عَنْ عَبْدِ اللَّهِ بْنِ عُتْبَةَ  : \" أَنَّهُ أُتِيَ فِي جَارِيَةٍ أَوْصَتْ، فَجَعَلُوا يُصَغِّرُونَهَا، فَقَالَ :مَنْ أَصَابَ الْحَقَّ، أَجَزْنَاهُ \"",
    "malay_translation": "Telah menceritakan kepada kami Qabeesah, telah menceritakan kepada kami Sufyan, dari Khalid Al-Hazza', dan Ayyub, dari Ibnu Sirin, dari 'Abdullah bin Utbah: Bahawa beliau didatangi tentang seorang jariah yang berwasiat, lalu mereka meremehkannya, kemudian beliau berkata: 'Sesiapa yang benar (mendapatkan hak), kami akan melaksanakannya.'"
  },
  {
    "id": 40085,
    "hadith_number": 2548,
    "tajuk_hadith": "Wasiat Kanak-Kanak dengan Nilai yang Besar",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قَبِيصَةُ  ، أَنْبَأَنَا سُفْيَانُ  ، عَنْ يَحْيَى بْنِ سَعِيدٍ  ، عَنْ أَبِي بَكْرٍ   : \" أَنَّ سُلَيْمًا الْغَسَّانِيَّ مَاتَ وَهُوَ ابْنُ عَشْرٍ، أَوْ ثِنْتَيْ عَشْرَةَ سَنَةً،فَأَوْصَى بِبِئْرٍ لَهُ قِيمَتُهَا ثَلاثُونَ أَلْفًا \"، فَأَجَازَهَا عُمَرُ بْنُ الْخَطَّابِ  ، قَالَ أَبُو مُحَمَّدٍ : النَّاسُ يَقُولُونَ : عَمْرُو بْنُ سُلَيْمٍ ، حَدَّثَنَا قَبِيصَةُ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ ابْنَيْهِ : عَبْدِ اللَّهِ  ، وَمُحَمَّدٍ  ابْنَيْ أَبِي بَكْرٍ، عَنْ أَبِيهِمَا   مِثْلَ ذَلِكَ، غَيْرَ أَنَّ أَحَدَهُمَا قَالَ : ابْنُ ثَلَاثَ عَشْرَةَ، وَقَالَ الْآخَرُ : قَبْلَ أَنْ يَحْتَلِمَ.\nقَالَ أَبُو مُحَمَّد : عَنْ ابْنَيْهِ، يَعْنِي : ابْنَيْ أَبِي بَكْرٍ",
    "malay_translation": "Telah menceritakan kepada kami Qabisa, telah menceritakan kepada kami Sufyan, dari Yahya bin Sa'id, dari Abu Bakr: \"Sesungguhnya Sulaiman al-Ghassani telah meninggal dunia ketika berumur sepuluh atau dua belas tahun, lalu dia berwasiat dengan sebuah telaga yang nilainya tiga puluh ribu.\" Kemudian wasiat itu diluluskan oleh Umar bin al-Khattab. Abu Muhammad berkata: Orang ramai mengatakan: 'Amru bin Sulaim, telah menceritakan kepada kami Qabisa, telah menceritakan kepada kami Sufyan, dari kedua anaknya: Abdullah dan Muhammad, anak-anak Abu Bakr, dari bapa mereka, seperti itu, kecuali salah seorang daripada mereka berkata: berumur tiga belas tahun, dan yang lain berkata: sebelum dia baligh. Abu Muhammad berkata: Dari kedua anaknya, iaitu kedua anak Abu Bakr."
  },
  {
    "id": 40086,
    "hadith_number": 2549,
    "tajuk_hadith": "Wasiat untuk Kanak-kanak",
    "perawi_melayu": "Nasar bin Ali",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ ، حَدَّثَنَا عَبْدُ الْأَعْلَى ، عَنْ مَعْمَرٍ ، عَنْ الزُّهْرِيِّ ، أَنَّهُ كَانَ يَقُولُ :\" وَصِيَّتُهُ لَيْسَتْ بِجَائِزَةٍ إِلَّا مَا لَيْسَ بِذِي بَالٍ، يَعْنِي : الْغُلَامَ قَبْلَ أَنْ يَحْتَلِمَ \"",
    "malay_translation": "Telah menceritakan kepada kami Nasar bin Ali, telah menceritakan kepada kami Abdul A'la, daripada Ma'mar, daripada Az-Zuhri, bahawa dia berkata: \"Wasiatnya tidak sah melainkan apa yang tidak penting, iaitu kanak-kanak lelaki sebelum baligh.\""
  },
  {
    "id": 40087,
    "hadith_number": 2550,
    "tajuk_hadith": "Talak, Wasiat, dan Sedekah Bagi Kanak-Kanak",
    "perawi_melayu": "Amru bin Aun, daripada Hasyim, daripada Yunus, daripada Hasan",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ  ، أَنْبَأَنَا هُشَيْمٌ  ، عَنْ يُونُسَ  ، عَنِ الْحَسَنِ  ، قَالَ :\" لَا يَجُوزُ طَلَاقُ الْغُلَامِ وَلَا وَصِيَّتُهُ، وَلَا هِبَتُهُ، وَلَا صَدَقَتُهُ، وَلَا عَتَاقَتُهُ، حَتَّى يَحْتَلِمَ \"",
    "malay_translation": "Diriwayatkan daripada Hasan: \"Tidak sah talak seorang kanak-kanak lelaki, tidak sah wasiatnya, tidak sah hibahnya, tidak sah sedekahnya, dan tidak sah pembebasannya (dari perhambaan) sehingga dia mencapai baligh.\""
  },
  {
    "id": 40088,
    "hadith_number": 2551,
    "tajuk_hadith": "Talak, Pembebasan, Wasiat, Jual Beli, Kanak-Kanak Tidak Sah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ الْمُغِيرَةِ  ، عَنْ حَفْصِ بْنِ غِيَاثٍ  ، عَنْ حَجَّاجٍ  ، عَنْ عَطَاءٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ :\" لَا يَجُوزُ طَلَاقُ الصَّبِيِّ، وَلَا عِتْقُهُ، وَلَا وَصِيَّتُهُ، وَلَا شِرَاؤُهُ، وَلَا بَيْعُهُ، وَلَا شَيْءٌ \"",
    "malay_translation": "Telah menceritakan kepada kami Sa'id bin Al-Mughirah, dari Hafs bin Ghiyath, dari Hajjaj, dari 'Atha', dari Ibnu 'Abbas r.a., beliau berkata: \"Talak kanak-kanak, pembebasannya (hamba), wasiatnya, pembeliannya, penjualannya, dan apa pun (tindakan hukumnya) tidak sah.\""
  },
  {
    "id": 40089,
    "hadith_number": 2552,
    "tajuk_hadith": "Hukum Talak dan Wasiat Orang Gila dan Mabuk",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ ، حَدَّثَنَا هَمَّامٌ ، عَنْ قَتَادَةَ ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ الْحِمْيَرِيِّ ، قَالَ :\" لَا يَجُوزُ طَلَاقٌ، وَلَا وَصِيَّةٌ، إِلَّا فِي عَقْلٍ، إِلَّا النَّشْوَانَ، يَعْنِي : السَّكْرَانَ، فَإِنَّهُ يَجُوزُ طَلَاقُهُ، وَيُضْرَبُ ظَهْرُهُ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Al-Walid, telah menceritakan kepada kami Hammam, dari Qatadah, dari Humaid bin Abdurrahman Al-Himyari, berkata: \"Tidak sah talak (cerai) dan wasiat kecuali dalam keadaan berakal. Kecuali orang yang mabuk, yaitu orang yang mabuk. Sesungguhnya sah talaknya (cerainya), dan dia dipukul punggungnya.\""
  },
  {
    "id": 40090,
    "hadith_number": 2553,
    "tajuk_hadith": "Hamba yang Melarikan Diri dalam Wasiat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ ، عَنْ خَالِدِ بْنِ عَبْدِ اللَّهِ ، عَنْ يَحْيَى بْنِ أَبِي إِسْحَاق ، قَالَ : \" سَأَلْتُ الْقَاسِمَ بْنَ عَبْدِ الرَّحْمَنِ ، وَمُعَاوِيَةَ بْنَ قُرَّةَ  عَنْ رَجُلٍ قَالَ فِي وَصِيَّتِهِ : \" كُلُّ لِي حُرٌّ، وَلَهُ مَمْلُوكٌ آبِقٌ، فَقَالَا :هُوَ حُرٌّ \"، قَالَ الْحَسَنُ ، وَإِيَاسٌ ، وَبَكْرُ بْنُ عَبْدِ اللَّهِ  : ليس بحر",
    "malay_translation": "Telah menceritakan kepada kami ‘Amru bin ‘Aun, daripada Khalid bin ‘Abdillah, daripada Yahya bin Abu Ishaq, dia berkata: \"Aku bertanya kepada Al-Qasim bin ‘Abdurrahman dan Mu’awiyah bin Qurrah tentang seorang lelaki yang berkata dalam wasiatnya: \"Setiap hamba milikku adalah merdeka\", sedangkan dia mempunyai seorang hamba yang melarikan diri. Mereka berdua berkata: \"Dia merdeka\". Hasan, Iyas dan Bakr bin Abdullah berkata: \"Dia tidak merdeka\"."
  },
  {
    "id": 40091,
    "hadith_number": 2554,
    "tajuk_hadith": "Wasiat Umar kepada Hafsah Ummul Mukminin",
    "perawi_melayu": "Abdullah bin Maslamah, Abdullah al-Umari, daripada Nafi', daripada Ibnu Umar",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ  ، حَدَّثَنَا عَبْدُ اللَّهِ الْعُمَرِيُّ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ  : \" أَنَّ عُمَرَ  أَوْصَى إِلَى حَفْصَةَ أُمِّ الْمُؤْمِنِينَ \"",
    "malay_translation": "Abdullah bin Maslamah meriwayatkan, Abdullah al-Umari meriwayatkan, daripada Nafi', daripada Ibnu Umar: \"Sesungguhnya Umar telah berwasiat kepada Hafsah, Ummul Mukminin.\""
  },
  {
    "id": 40092,
    "hadith_number": 2555,
    "tajuk_hadith": "Wasiat Sofiyyah untuk Sanak Saudaranya Yahudi",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ لَيْثٍ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ   : \" أَنَّ صَفِيَّةَأَوْصَتْ لِنَسِيبٍ لَهَا يَهُودِيٍّ \"",
    "malay_translation": "Abu Nu'aim meriwayatkan, Sufyan meriwayatkan dari Laith, dari Nafi', dari Ibnu Umar: Bahawasanya Sofiyyah berwasiat kepada sanak saudaranya yang berbangsa Yahudi."
  },
  {
    "id": 40093,
    "hadith_number": 2556,
    "tajuk_hadith": "Wasiat Kanak-Kanak yang Sah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ ، حَدَّثَنَا زُهَيْرٌ ، عَنْ أَبِي إِسْحَاق ، قَالَ : \" أَوْصَى غُلَامٌ مِنَ الْحَيِّ، يُقَالُ لَهُ : عَبَّاسُ بْنُ مَرْثَدٍ ابْنُ سَبْعِ سِنِينَ لِظِئْرٍ لَهُ يَهُودِيَّةٍ مِنْ أَهْلِ الْحِيرَةِ بِأَرْبَعِينَ دِرْهَمًا، فَقَالَ شُرَيْحٌ  :إِذَا أَصَابَ الْغُلَامُ فِي وَصِيَّتِهِ، جَازَتْ وَإِنَّمَا أَوْصَى لِذِي حَقٍّ \"، قَالَ أَبُو مُحَمَّد : أَنَا أَقُولُ بِهِ",
    "malay_translation": "Diriwayatkan oleh Abu Nu'aym, diriwayatkan oleh Zuhair, dari Abu Ishaq, berkata: \"Seorang budak dari kalangan orang hidup, yang dikenali sebagai Abbas bin Marthad, berumur tujuh tahun, mewasiatkan kepada ibu susunya yang seorang Yahudi dari penduduk al-Hirah sebanyak empat puluh dirham. Maka Shuraih berkata: 'Jika kanak-kanak itu tepat dalam wasiatnya, maka ia sah. Sesungguhnya dia mewasiatkan kepada yang berhak.' Abu Muhammad berkata: 'Saya berpendapat demikian juga.'"
  },
  {
    "id": 40094,
    "hadith_number": 2557,
    "tajuk_hadith": "Wakaf Zubair untuk Anak-Anak Lelaki dan Perempuannya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ ، حَدَّثَنَا أَبُو أُسَامَةَ ، عَنْ هِشَامٍ ، عَنْ أَبِيهِ : \" أَنَّ الزُّبَيْرَ جَعَلَ دُورَهُ صَدَقَةً عَلَى بَنِيهِ، لَا تُبَاعُ وَلَا تُوَرَّثُ، وَأَنَّ لِلْمَرْدُودَةِ مِنْ بَنَاتِهِ أَنْ تَسْكُنَ غَيْرَ مُضِرَّةٍ وَلَا مُضَارٍّ بِهَا، فَإِنْ هِيَ اسْتَغْنَتْ بِزَوْجٍ، فَلَا حَقَّ لَهَا \"",
    "malay_translation": "Abdullah bin Sa'id meriwayatkan: Abu Usamah memberitahu kami, daripada Hisyam, daripada bapanya: 'Sesungguhnya Zubair telah mewakafkan rumah-rumahnya sebagai sedekah kepada anak-anak lelakinya, tidak boleh dijual dan tidak boleh diwarisi. Dan bagi anak-anak perempuannya yang telah diceraikan, mereka boleh tinggal di situ tanpa menyusahkan atau disusahkan. Sekiranya mereka sudah berkahwin, maka mereka tidak mempunyai hak lagi.'"
  },
  {
    "id": 40095,
    "hadith_number": 2558,
    "tajuk_hadith": "Harta yang Diwasiatkan dalam Perjalanan di Jalan Allah",
    "perawi_melayu": "Al-Hakam bin Al-Mubarak",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْحَكَمُ بْنُ الْمُبَارَكِ ، أنبأنا الْوَلِيدُ ، عَنْ حَفْصٍ ، عَنْ مَكْحُولٍ  : \" فِي الرَّجُلِ يُوصِي لِلرَّجُلِ بِدَنَانِيرَ فِي سَبِيلِ اللَّهِ، فَيَمُوتُ الْمُوصَى لَهُ قَبْلَ أَنْ يَخْرُجَ بِهَا مِنْ أَهْلِهِ، قَالَ :هِيَ إِلَى أَوْلِيَاءِ الْمُتَوَفَّى الْمُوصِي، يُنْفِذُونَهَا فِي سَبِيلِ اللَّهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Al-Hakam bin Al-Mubarak, telah mengkhabarkan kepada kami Al-Walid, daripada Hafs, daripada Makhul: \"(Berkenaan) seorang lelaki mewasiatkan beberapa dinar kepada seorang lelaki di jalan Allah, kemudian orang yang diwasiatkan itu meninggal dunia sebelum dia mengeluarkannya daripada keluarganya. (Makhul) berkata: \"(Harta itu) adalah kepada waris si mati yang mewasiatkan, mereka melaksanakannya di jalan Allah.\""
  },
  {
    "id": 40096,
    "hadith_number": 2559,
    "tajuk_hadith": "Wasiat yang Diberikan kepada Seseorang yang Meninggal Sebelum Pemberi Wasiat",
    "perawi_melayu": "Diriwayatkan oleh Muhammad bin 'Uyaynah, daripada Ali bin Mushir, daripada Ash'ath, daripada Hasan; dan diriwayatkan oleh Muhammad bin 'Uyaynah, daripada Ali bin Mushir, daripada Ash'ath, daripada Abu Ishaq as-Sabi'i.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ  ، عَنْ عَلِيِّ بْنِ مُسْهِرٍ  ، عَنْ أَشْعَثَ  ، عَنْ الْحَسَنِ   : \" فِي الرَّجُلِ يُوصِي لِلرَّجُلِ بِالْوَصِيَّةِ، فَيَمُوتُ الْمُوصَى لَهُ قَبْلَ الْمُوصِي، قَالَ :هِيَ جَائِزَةٌ لِوَرَثَةِ الْمُوصَى لَهُ.\nحَدَّثَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ  ، عَنْ عَلِيِّ بْنِ مُسْهِرٍ  ، عَنْ أَشْعَثَ  ، عَنْ أَبِي إِسْحَاق السَّبِيعِيِّ  ، قَالَ : حُدِّثْتُ  أَنَّ عَلِيًّا   كَانَ يُجِيزُهَا مِثْلَ قَوْلِ الْحَسَنِ",
    "malay_translation": "Apabila seseorang memberikan wasiat kepada seseorang, kemudian penerima wasiat itu meninggal sebelum pemberi wasiat, maka (wasiat) itu sah untuk waris penerima wasiat. Diriwayatkan bahawa Ali r.a. juga mengesahkan (hukum) wasiat tersebut seperti yang dikatakan oleh Hasan."
  },
  {
    "id": 40097,
    "hadith_number": 2560,
    "tajuk_hadith": "Haji dan Umrah di Jalan Allah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْحَكَمُ بْنُ الْمُبَارَكِ  ، أَنْبَأَنَا عَبْدُ الْعَزِيزِ هُوَ ابْنُ مُحَمَّدٍ  ، عَنْ مُوسَى هُوَ ابْنُ عُقْبَةَ  ،  عَنْ نَافِعٍ  : \" أَنَّ رَجُلًا جَاءَ إِلَى ابْنِ عُمَرَ فَقَالَ : إِنَّ رَجُلًا أَوْصَى إِلَيَّ وَجَعَلَ نَاقَةً فِي سَبِيلِ اللَّهِ، وَلَيْسَ هَذَا زَمَانًا يُخْرَجُ إِلَى الْغَزْوِ، فَأَحْمِلُ عَلَيْهَا فِي الْحَجِّ؟ فَقَالَ ابْنُ عُمَرَ   :الْحَجُّ وَالْعُمْرَةُ فِي سَبِيلِ اللَّهِ \"",
    "malay_translation": "Diriwayatkan daripada al-Hakam bin al-Mubarak, daripada Abd al-Aziz (iaitu Ibn Muhammad), daripada Musa (iaitu Ibn Uqba), daripada Nafi': \"Seorang lelaki datang kepada Ibn Umar dan berkata: 'Sesungguhnya seorang lelaki telah mewasiatkan kepada saya dan menjadikan seekor unta (untuk digunakan) di jalan Allah, dan ini bukanlah masa untuk keluar berperang (ghazwah). Bolehkah saya menunggang unta itu untuk (urusan) haji?' Ibnu Umar menjawab: 'Haji dan umrah adalah di jalan Allah.'"
  },
  {
    "id": 40098,
    "hadith_number": 2561,
    "tajuk_hadith": "Wakaf Harta untuk Mereka yang Berkhidmat kepada Allah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، عَنْ مُوسَى بْنِ عُبَيْدَةَ  ، عَنْ وَاقِدِ بْنِ مُحَمَّدِ بْنِ زَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ  : \" أَنَّ رَجُلًا أَوْصَى بِمَالِهِ فِي سَبِيلِ اللَّهِ، فَسَأَلَ الْوَصِيُّ عَنْ ذَلِكَ عُمَرَ  ، فَقَالَ :أَعْطِهِ عُمَّالَ اللَّهِ، قَالَ : وَمَنْ عُمَّالُ اللَّهِ؟ قَالَ : حَاجُّ بَيْتِ اللَّهِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ubaidullah bin Musa, daripada Musa bin Ubaidah, daripada Waqid bin Muhammad bin Zaid bin Abdullah bin Umar: \"Sesungguhnya seorang lelaki mewasiatkan hartanya di jalan Allah. Lalu wasi (pelaksana wasiat) bertanya tentang hal itu kepada Umar. Umar berkata: 'Berikan kepada pekerja-pekerja Allah.' Lelaki itu bertanya: 'Siapakah pekerja-pekerja Allah?' Umar menjawab: 'Jemaah haji ke Baitullah (Kaabah)'\""
  }
]
