[
  {
    "id": 39436,
    "hadith_number": 1899,
    "tajuk_hadith": "Adab Meminta Izin Masuk",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ  ، حَدَّثَنَا دَاوُدُ  ، عَنْ أَبِي نَضْرَةَ  ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ  : أَنَّ أَبَا مُوسَى الْأَشْعَرِيَّ   اسْتَأْذَنَ عَلَى عُمَرَ ثَلَاثَ مَرَّاتٍ، فَلَمْ يُؤْذَنْ لَهُ، فَرَجَعَ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" إِذَا اسْتَأْذَنَ الْمُسْتَأْذِنُ ثَلَاثَ مَرَّاتٍ : فَإِنْ أُذِنَ لَهُ وَإِلَّا، فَلْيَرْجِعْ \"، فَقَالَ : لَتَأْتِيَنَّ بِمَنْ يَشْهَدُ مَعَكَ، أَوْ لَأَفْعَلَنَّ، وَلَأَفْعَلَنَّ.\nقَالَ أَبُو سَعِيدٍ : فَأَتَانَا وَأَنَا فِي قَوْمٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ، وَهُوَ فَزِعٌ مِنْ وَعِيدِ عُمَرَ إِيَّاهُ، فَقَامَ عَلَيْنَا، فَقَالَ : أَنْشُدُ اللَّهَ مِنْكُمْ رَجُلًا سَمِعَ ذَلِكَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا شَهِدَ لِي بِهِ.\nقَالَ : فَرَفَعْتُ رَأْسِي، فَقُلْتُ : أَخْبِرْهُ أَنِّي مَعَكَ عَلَى هَذَا.\nوَقَالَ ذَاكَ آخَرُونَ، فَسُرِّيَ عَنْ أَبِي مُوسَى",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Nu'man, telah menceritakan kepada kami Yazid bin Zura'i, telah menceritakan kepada kami Daud, daripada Abu Nadrah, daripada Abu Sa'id al-Khudri: Bahawa Abu Musa al-Asy'ari meminta izin untuk masuk menemui Umar sebanyak tiga kali, namun tidak diizinkan baginya. Lalu beliau pun pulang. Abu Musa berkata: \"Aku mendengar Rasulullah SAW bersabda: \"Apabila seseorang meminta izin masuk sebanyak tiga kali, sekiranya diizinkan baginya (masuklah), jika tidak, maka hendaklah dia pulang.\" Umar berkata: \"Kamu hendaklah membawa seseorang untuk bersaksi bersamamu (atas hadis ini), atau pasti aku akan melakukan tindakan (terhadapmu), dan pasti aku akan melakukan tindakan.\" Abu Sa'id berkata: \"Kemudian Abu Musa datang kepada kami ketika aku sedang berada bersama sekumpulan sahabat Rasulullah SAW di masjid, dan beliau dalam keadaan cemas kerana ancaman Umar kepadanya. Beliau berdiri di hadapan kami dan berkata: \"Aku meminta dengan nama Allah, adakah di antara kamu seorang lelaki yang mendengar perkara ini daripada Rasulullah SAW, melainkan dia bersaksi untukku mengenainya?\" Abu Sa'id berkata: \"Maka aku mengangkat kepalaku dan berkata: \"Khabarkan kepadanya bahawa aku bersama kamu dalam hal ini.\" Dan yang lain juga berkata demikian, maka lega lah Abu Musa.\""
  },
  {
    "id": 39437,
    "hadith_number": 1900,
    "tajuk_hadith": "Adab Menjawab Panggilan di Pintu",
    "perawi_melayu": "Sa'id bin ar-Rabi', Shu'bah, Muhammad bin al-Munkadir, Jabir bin Abdullah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ الرَّبِيعِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ  ، قَالَ : سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ  ، قَالَ : أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَضَرَبْتُ بَابَهُ، فَقَالَ :\" مَنْ ذَا؟ \".\nفَقُلْتُ : أَنَا.\nقَالَ : \" أَنَا؟ أَنَا؟ ! \" فَكَرِهَ ذَاكَ",
    "malay_translation": "Sa'id bin ar-Rabi' memberitahu kami, Shu'bah menceritakan kepada kami, daripada Muhammad bin al-Munkadir, dia berkata: Saya mendengar Jabir bin Abdullah berkata: Saya mendatangi Rasulullah SAW lalu saya mengetuk pintunya, lalu beliau bertanya: \"Siapa itu?\". Lalu saya menjawab: \"Saya\". Beliau bersabda: \"Saya? Saya? !\" Beliau tidak menyukai hal itu."
  },
  {
    "id": 39438,
    "hadith_number": 1901,
    "tajuk_hadith": "Larangan Pulang ke Rumah Keluarga pada Waktu Malam dan Mencari Kesalahan Mereka",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، قَالَ : سَمِعْتُ مُحَارِبَ بْنَ دِثَارٍ  يَذْكُرُ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ  ، قَالَ : \" نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْيَطْرُقَ الرَّجُلُ أَهْلَهُ لَيْلًا، أَوْ يُخَوِّنَهُمْ، أَوْ يَلْتَمِسَ عَثَرَاتِهِمْ \".\nقَالَ سُفْيَانُ : قَوْلُهُ : أَوْ يُخَوِّنَهُمْ، أَوْ يَلْتَمِسَ عَثَرَاتِهِمْ، مَا أَدْرِي : شَيْءٌ.\nقَالَهُ مُحَارِبٌ : أَوْ شَيْءٌ هُوَ فِي الْحَدِيثِ",
    "malay_translation": "Muhammad bin Yusuf memberitahu kami, Sufyan memberitahu kami, dia berkata: Saya mendengar Muharib bin Dithar menyebut, daripada Jabir bin Abdullah, dia berkata: \"Rasulullah SAW melarang seseorang lelaki pulang ke rumah keluarganya pada waktu malam, atau menuduh mereka berkhianat, atau mencari kesalahan mereka.\" Sufyan berkata: Kata-katanya: atau menuduh mereka berkhianat, atau mencari kesalahan mereka, saya tidak tahu: sesuatu. Muharib berkata: atau sesuatu itu ada dalam hadith."
  },
  {
    "id": 39439,
    "hadith_number": 1902,
    "tajuk_hadith": "Empat Amalan Menuju Syurga",
    "perawi_melayu": "Sa'id bin Amir, Auf, Zurarah bin Aufa, Abdullah bin Salam",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ  ، عَنْ عَوْفٍ  ، عَنْ زُرَارَةَ بْنِ أَوْفَى  ، عَنْ عَبْدِ اللَّهِ بْنِ سَلَامٍ  ، قَالَ : لَمَّا قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ ، اسْتَشْرَفَهُ النَّاسُ، فَقَالُوا : قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.\nقَالَ : فَخَرَجْتُ فِيمَنْ خَرَجَ، فَلَمَّا رَأَيْتُ وَجْهَهُ، عَرَفْتُ أَنَّ وَجْهَهُ لَيْسَ بِوَجْهِ كَذَّابٍ.\nفَكَانَ أَوَّلَ مَا سَمِعْتُهُ، يَقُولُ : \" يَا أَيُّهَا النَّاسُ،أَفْشُوا السَّلَامَ، وَأَطْعِمُوا الطَّعَامَ، وَصِلُوا الْأَرْحَامَ، وَصَلُّوا وَالنَّاسُ نِيَامٌ، تَدْخُلُوا الْجَنَّةَ بِسَلَامٍ \"",
    "malay_translation": "Sa'id bin Amir telah memberitahu kami, daripada Auf, daripada Zurarah bin Aufa, daripada Abdullah bin Salam, dia berkata: Ketika Rasulullah ﷺ tiba di Madinah, orang ramai berkerumun untuk melihatnya, dan mereka berkata: 'Rasulullah ﷺ telah tiba.' Dia berkata: 'Maka aku keluar bersama orang ramai yang keluar, dan ketika aku melihat wajahnya, aku tahu bahawa wajahnya bukanlah wajah seorang pendusta.' Maka perkara pertama yang aku dengar baginda bersabda adalah: 'Wahai manusia, sebarkan salam, berilah makan (orang yang memerlukan), sambungkanlah tali persaudaraan, dan solatlah ketika orang sedang tidur, nescaya kamu akan masuk syurga dengan selamat.'"
  },
  {
    "id": 39440,
    "hadith_number": 1903,
    "tajuk_hadith": "Enam Hak Seorang Muslim Terhadap Muslim Lain",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ  ، عَنْ إِسْرَائِيلَ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ الْحَارِثِ  ،  عَنْ عَلِيٍّ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لِلْمُسْلِمِ عَلَى الْمُسْلِمِ سِتٌّ : يُسَلِّمُ عَلَيْهِ إِذَا لَقِيَهُ وَيُشَمِّتُهُ إِذَا عَطَسَ، وَيَعُودُهُ إِذَا مَرِضَ، وَيُجِيبُهُ إِذَا دَعَاهُ، وَيَشْهَدُهُ إِذَا تُوُفِّيَ، وَيُحِبُّ لَهُ مَا يُحِبُّ لِنَفْسِهِ، وَيَنْصَحُ لَهُ بِالْغَيْبِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ubaidillah, daripada Israil, daripada Abu Ishaq, daripada al-Harith, daripada Ali, dia berkata: Rasulullah SAW bersabda: \"Hak seorang Muslim ke atas Muslim yang lain ada enam: Memberi salam kepadanya apabila bertemu dengannya, mendoakannya apabila dia bersin, menziarahinya apabila dia sakit, memenuhi jemputannya apabila dia menjemputnya, menyaksikan jenazahnya apabila dia meninggal dunia, menyukai untuknya apa yang dia suka untuk dirinya sendiri, dan menasihatinya secara rahsia.\""
  },
  {
    "id": 39441,
    "hadith_number": 1904,
    "tajuk_hadith": "Keutamaan Memberi Salam",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ  ، حَدَّثَنَا حَيْوَةُ  ، أَخْبَرَنَا أَبُو هَانِئٍ الْخَوْلَانِيُّ  : أَنَّ أَبَا عَلِيٍّ الْجَنْبِيَّ  حَدَّثَهُ، عَنْ فَضَالَةَ بْنِ عُبَيْدٍ  ، عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" يُسَلِّمُ الرَّاكِبُ عَلَى الْمَاشِي، وَالْقَائِمُ عَلَى الْقَاعِدِ، وَالْقَلِيلُ عَلَى الْكَثِيرِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abdullah bin Yazid, telah menceritakan kepada kami Haywah, telah mengkhabarkan kepada kami Abu Hani' al-Khaulani: Bahawa Abu Ali al-Janbi telah menceritakan kepadanya, daripada Fadhalah bin Ubaid, daripada Rasulullah SAW, baginda bersabda: \"Orang yang berkenderaan memberi salam kepada orang yang berjalan kaki, orang yang berdiri kepada orang yang duduk, dan yang sedikit kepada yang ramai.\""
  },
  {
    "id": 39442,
    "hadith_number": 1905,
    "tajuk_hadith": "Salam Orang Yahudi dan Cara Membalasnya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ  ، عَنِ ابْنِ عُمَرَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِنَّ الْيَهُودَ إِذَا سَلَّمَ أَحَدُهُمْ، فَإِنَّمَا يَقُولُ : السَّامُ عَلَيْكَ.\nقُلْ : عَلَيْكَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Khalid bin Makhlad, telah menceritakan kepada kami Malik, daripada Abdullah bin Dinar, daripada Ibn Umar, beliau berkata: Rasulullah SAW bersabda: 'Sesungguhnya orang Yahudi apabila salah seorang daripada mereka memberi salam, maka mereka hanya berkata: 'As-Sam 'alaik (Kematian ke atas kamu)'. Katakanlah: 'Wa 'alaik (Dan ke atas kamu juga)'."
  },
  {
    "id": 39443,
    "hadith_number": 1906,
    "tajuk_hadith": "Nabi, Anas dan Thabit Memberi Salam kepada Kanak-kanak",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَهْلُ بْنُ حَمَّادٍ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ سَيَّارٍ  ، قَالَ : كُنْتُ أَمْشِي مَعَ ثَابِتٍ الْبُنَانِيِّ، فَمَرَّ بِصِبْيَانٍ، فَسَلَّمَ عَلَيْهِمْ، وَحَدَّثَ ثَابِتٌ  أَنَّهُ كَانَ مَعَ أَنَسٍ فَمَرَّ بِصِبْيَانٍ فَسَلَّمَ عَلَيْهِمْ، وَحَدَّثَ أَنَسٌ   : \" أَنَّهُ كَانَ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَفَمَرَّ بِصِبْيَانٍ، فَسَلَّمَ عَلَيْهِمْ \"",
    "malay_translation": "Telah menceritakan kepada kami Sahl bin Hammad, telah menceritakan kepada kami Syu'bah, dari Sayyar, dia berkata: \"Saya sedang berjalan bersama Thabit al-Bunani, lalu dia melewati anak-anak kecil, kemudian dia memberi salam kepada mereka. Dan Thabit menceritakan bahawa dia pernah bersama Anas lalu melewati anak-anak kecil, kemudian dia memberi salam kepada mereka. Dan Anas menceritakan: \"Bahawa dia pernah bersama Nabi ﷺ lalu melewati anak-anak kecil, kemudian beliau memberi salam kepada mereka.\""
  },
  {
    "id": 39444,
    "hadith_number": 1907,
    "tajuk_hadith": "Nabi صلى الله عليه وسلم Memberi Salam kepada Wanita",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ  ، عَنْ شُعَيْبِ بْنِ أَبِي حَمْزَةَ  ، عَنْ ابْنِ أَبِي حُسَيْنٍ  ، حَدَّثَنِي شَهْرٌ  ،  عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ بْنِ السَّكَنِ   إِحْدَى نِسَاءِ بَنِي عَبْدِ الْأَشْهَلِ \" أَنَّهَا بَيْنَا هِيَ فِينِسْوَةٍ مَرَّ عَلَيْهِنَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَلَّمَ عَلَيْهِنَّ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Hakam bin Nafi', daripada Syu'aib bin Abi Hamzah, daripada Ibn Abi Husain, telah menceritakan kepadaku Syahr, daripada Asma' binti Yazid bin as-Sakan, salah seorang wanita Bani Abd al-Ashhal, bahawa ketika dia bersama beberapa wanita, Nabi صلى الله عليه وسلم melalui mereka dan memberi salam kepada mereka."
  },
  {
    "id": 39445,
    "hadith_number": 1908,
    "tajuk_hadith": "Salam Jibril kepada Aisyah R.A.",
    "perawi_melayu": "Diriwayatkan oleh al-Hakam bin Nafi', daripada Syu'aib bin Abi Hamzah, daripada az-Zuhri, dia berkata: Menceritakan kepadaku Abu Salamah bin Abdurrahman: Bahawa Aisyah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ  ، عَنْ شُعَيْبِ بْنِ أَبِي حَمْزَةَ  ، عَنْ الزُّهْرِيِّ  ، قَالَ : حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ  : أَنَّ عَائِشَةَ   زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَتْ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" يَا عَائِشُهَذَا جِبْرِيلُ يَقْرَأُ عَلَيْكِ السَّلَامَ \".\nقَالَتْ : وَعَلَيْهِ السَّلَامُ وَرَحْمَةُ اللَّهِ وَبَرَكاتُهُ.\n قَالَتْ : وَهُوَ يَرَى مَا لَا أَرَى",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Hakam bin Nafi', daripada Syu'aib bin Abi Hamzah, daripada az-Zuhri, dia berkata: Telah menceritakan kepadaku Abu Salamah bin Abdurrahman: Bahawa Aisyah, isteri Nabi صلى الله عليه وسلم, berkata: Rasulullah صلى الله عليه وسلم bersabda: \"Wahai Aisyah, ini Jibril menyampaikan salam kepadamu.\" Dia (Aisyah) berkata: \"Dan ke atasnya salam, rahmat Allah dan keberkatan-Nya.\" Dia (Aisyah) berkata: \"Dan baginda (Nabi) melihat apa yang tidak aku lihat.\""
  },
  {
    "id": 39446,
    "hadith_number": 1909,
    "tajuk_hadith": "Abu Dzar Orang Pertama Memberi Salam Kepada Rasulullah SAW Selepas Solat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ  ، حَدَّثَنَا سُلَيْمَانُ هُوَ : ابْنُ الْمُغِيرَةِ  ، عَنْ حُمَيْدِ بْنِ هِلَالٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ  ، عَنْ أَبِي ذَرٍّ  ، قَالَ : صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَيْتُهُ حِينَ قَضَى صَلَاتَهُ، فَكُنْتُ أَوَّلَ مَنْ حَيَّا بِتَحِيَّةِ الْإِسْلَامِ.\nقَالَ :\" عَلَيْكَ السَّلَامُ وَرَحْمَةُ اللَّهِ، مِمَّنْ أَنْتَ؟ \".\nقَالَ : قُلْتُ : مِنْ غِفَارٍ.\nقَالَ : فَأَهْوَى بِيَدِهِ.\nقُلْتُ فِي نَفْسِي : كَرِهَ أَنِّي انْتَمَيْتُ إِلَى غِفَارٍ",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Maslamah, telah menceritakan kepada kami Sulaiman, yaitu Ibnu Al-Mughirah, dari Humaid bin Hilal, dari Abdullah bin Ash-Shamit, dari Abu Dzar, dia berkata: Rasulullah ﷺ telah solat, lalu aku mendatanginya ketika beliau selesai solatnya, maka aku adalah orang pertama yang memberi salam penghormatan Islam. Beliau bersabda: \"Wa 'alaikas salam wa rahmatullah, dari mana kamu?\". Dia (Abu Dzar) berkata: Aku katakan: \"Dari Ghifar\". Dia (Abu Dzar) berkata: Lalu beliau mengisyaratkan dengan tangannya. Aku berkata dalam hatiku: Beliau tidak suka aku menisbahkan diri kepada Ghifar."
  },
  {
    "id": 39447,
    "hadith_number": 1910,
    "tajuk_hadith": "Kelebihan Ucapan Salam yang Berbeza",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ  ، حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ  ، عَنْ عَوْفٍ  ، عَنْ أَبِي رَجَاءٍ  ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ  ، قَالَ : جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ : السَّلَامُ عَلَيْكُمْ، فَرَدَّ عَلَيْهِ وَقَالَ :\" عَشْرٌ \".\nثُمَّ جَاءَ رَجُلٌ فَسَلَّمَ، فَقَالَ : السَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ، فَرَدَّ عَلَيْهِ، فَقَالَ : \" عِشْرُونَ \".\nثُمَّ جَاءَ رَجُلٌ فَسَلَّمَ، فَقَالَ : السَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، فَرَدَّ عَلَيْهِ وَقَالَ : \" ثَلَاثُونَ \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Kathir, telah menceritakan kepada kami Ja'far bin Sulaiman, dari Auf, dari Abu Raja', dari Imran bin Husain, dia berkata: Seorang lelaki datang kepada Nabi ﷺ, lalu dia berkata: \"Assalamu'alaikum.\" Baginda membalas salamnya dan bersabda: \"Sepuluh (kebaikan).\" Kemudian datang seorang lelaki lain lalu memberi salam, dia berkata: \"Assalamu'alaikum wa rahmatullah.\" Baginda membalas salamnya dan bersabda: \"Dua puluh (kebaikan).\" Kemudian datang seorang lelaki lain lalu memberi salam, dia berkata: \"Assalamu'alaikum wa rahmatullahi wa barakatuh.\" Baginda membalas salamnya dan bersabda: \"Tiga puluh (kebaikan).\""
  },
  {
    "id": 39448,
    "hadith_number": 1911,
    "tajuk_hadith": "Nabi SAW Tidak Membalas Salam Ketika Buang Air Kecil Sehingga Berwuduk",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاق  ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ  ، حَدَّثَنِي أَبِي  ، عَنْ قَتَادَةَ  ، عَنْ الْحَسَنِ  ، عَنْ الْحُضَيْنِ  ، عَنِ الْمُهَاجِرِ بْنِ قُنْفُذٍ   : أَنَّهُ سَلَّمَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَبُولُ،\" فَلَمْ يَرُدَّ عَلَيْهِ السَّلَامَ حَتَّى تَوَضَّأَ، فَلَمَّا تَوَضَّأَ، رَدَّهُ عَلَيْهِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ishaq, telah menceritakan kepada kami Mu'adh bin Hisham, telah menceritakan kepadaku ayahku, daripada Qatadah, daripada al-Hasan, daripada al-Hudhayn, daripada al-Muhajir bin Qunfuz: bahawa dia memberi salam kepada Nabi SAW ketika Baginda sedang kencing, lalu Baginda tidak membalas salamnya sehingga Baginda berwuduk. Apabila Baginda telah berwuduk, Baginda membalas salamnya."
  },
  {
    "id": 39449,
    "hadith_number": 1912,
    "tajuk_hadith": "Larangan Masuk Menemui Wanita dan Bahaya Al-Hamwu",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ بِسْطَامَ  ، حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ  ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ  ، عَنْ أَبِي الْخَيْرِ  ، عَنْ عُقْبَةَ بْنِ عَامِرٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَا تَدْخُلُوا عَلَى النِّسَاءِ \".\nقِيلَ : يَا رَسُولَ اللَّهِ إِلَّا الْحَمْوُ.\nقَالَ : \" الْحَمْوُ : الْمَوْتُ \".\n قَالَ يَحْيَى : الْحَمْوُ : يَعْنِي قَرَابَةَ الزَّوْجِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Yahya bin Bistam, telah menceritakan kepada kami Laith bin Saad, daripada Yazid bin Abi Habib, daripada Abu al-Khair, daripada Uqbah bin Amir, dia berkata: Rasulullah SAW bersabda: \"Janganlah kamu masuk menemui wanita-wanita.\"\nDikatakan: Wahai Rasulullah, bagaimana dengan al-Hamwu (ipar duai)?\nBaginda bersabda: \"Al-Hamwu adalah maut (kebinasaan).\"\nYahya berkata: Al-Hamwu bermaksud kerabat suami."
  },
  {
    "id": 39450,
    "hadith_number": 1913,
    "tajuk_hadith": "Pandangan Tiba-Tiba dan Arahan untuk Memalingkan Pandangan",
    "perawi_melayu": "Muhammad bin Yusuf, dan Abu Nu'aim, daripada Sufyan, daripada Yunus, daripada 'Amr bin Sa'id, daripada Abi Zur'ah bin 'Amr bin Jarir, daripada bapanya, daripada datuknya",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، وَأَبُو نُعَيْمٍ  ، عَنْ سُفْيَانَ  ، عَنْ يُونُسَ  ، عَنْ عَمْرِو بْنِ سَعِيدٍ  ، عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ  ، عَنْ أَبيهِ، عَنْ جَدِّهِ  ، قَالَ : سَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نَظْرَةِ الْفَجْأَةِ، فَقَالَ :\" اصْرِفْ بَصَرَكَ \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Yusuf, dan Abu Nu'aim, daripada Sufyan, daripada Yunus, daripada 'Amr bin Sa'id, daripada Abi Zur'ah bin 'Amr bin Jarir, daripada bapanya, daripada datuknya, dia berkata: Saya bertanya kepada Nabi ﷺ tentang pandangan yang tiba-tiba (tidak sengaja), lalu baginda bersabda: \"Palingkanlah pandanganmu.\""
  },
  {
    "id": 39451,
    "hadith_number": 1914,
    "tajuk_hadith": "Panjang Kain Pakaian Wanita",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ خَالِدٍ  ، حَدَّثَنَا مُحَمَّدٌ هُوَ : ابْنُ إِسْحَاق  ، عَنْ نَافِعٍ  ، عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ  ،  عَنْ أُمِّ سَلَمَةَ   زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَتْ : سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَيْلِ الْمَرْأَةِ، فَقَالَ : \" شِبْرًا \"، فَقُلْتُ : يَا رَسُولَ اللَّهِ، إِذَنْ تَبْدُوَ أَقْدَامُهُنَّ؟، قَالَ :\" فَذِرَاعًا لَا يَزِدْنَ عَلَيْهِ \".\nقَالَ عَبْد اللَّهِ : النَّاسُ يَقُولُونَ : عَنْ نَافِعٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ",
    "malay_translation": "Telah mengkhabarkan kepada kami Ahmad bin Khalid, telah menceritakan kepada kami Muhammad iaitu Ibnu Ishaq, daripada Nafi', daripada Safiyyah binti Abi Ubaid, daripada Ummu Salamah isteri Nabi صلى الله عليه وسلم, beliau berkata: Nabi صلى الله عليه وسلم ditanya tentang labuh kain (pakaian) wanita. Baginda bersabda: \"Sejengkal.\" Aku berkata: Wahai Rasulullah, jika begitu akan kelihatan kedua kaki mereka? Baginda bersabda: \"Maka sehasta, jangan lebih daripada itu.\" Abdullah berkata: Orang ramai mengatakan: Daripada Nafi', daripada Sulaiman bin Yasar."
  },
  {
    "id": 39452,
    "hadith_number": 1915,
    "tajuk_hadith": "Anjuran Berhias dengan Perak dan Larangan Menampakkan Perhiasan Emas Bagi Wanita",
    "perawi_melayu": "Muhammad bin Yusuf, Sufyan, Mansur, Rib'i bin Hirash, isteri Rib'i bin Hirash, saudara perempuan Huzaifah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ مَنْصُورٍ  ، حَدَّثَنِي رِبْعِيُّ بْنُ حِرَاشٍ  ، عَنِ امْرَأَتِهِ  ، عَنْ أُخْتٍ لِحُذَيْفَةَ  ، قَالَتْ : خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ : \" يَا مَعْشَرَ النِّسَاءِ،أَمَا لَكُنَّ فِي الْفِضَّةِ مَا تَحَلَّيْنَ بِهِ؟ أَمَا إِنَّهُ لَيْسَتْ مِنْكُنَّ امْرَأَةٌ تَحَلَّى الذَّهَبَ فَتُظْهِرَهُ، إِلَّا عُذِّبَتْ بِهِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Yusuf, telah menceritakan kepada kami Sufyan, daripada Mansur, telah menceritakan kepadaku Rib'i bin Hirash, daripada isterinya, daripada saudara perempuan Huzaifah, yang berkata: Rasulullah SAW berkhutbah kepada kami, dan baginda bersabda: \"Wahai sekalian wanita, tidakkah kamu mempunyai perak untuk kamu berhias diri dengannya? Ketahuilah, sesungguhnya tidak ada seorang wanita pun di antara kamu yang berhias dengan emas dan menampakkannya, melainkan dia akan diazab dengannya.\""
  },
  {
    "id": 39453,
    "hadith_number": 1916,
    "tajuk_hadith": "Larangan Wanita Keluar Rumah Dengan Memakai Wangian",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ ثَابِتِ بْنِ عُمَارَةَ  ، عَنْ غُنَيْمِ بْنِ قَيْسٍ  ، عَنْ أَبِي مُوسَى   :\" أَيُّمَا امْرَأَةٍ اسْتَعْطَرَتْ، ثُمَّ خَرَجَتْ لِيُوجَدَ رِيحُهَا، فَهِيَ زَانِيَةٌ، وَكُلُّ عَيْنٍ زَانٍ \".\nوَقَالَ أَبُو عَاصِمٍ : يَرْفَعُهُ بَعْضُ أَصْحَابِنَا",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Asim, daripada Thabit bin Umarah, daripada Ghunaim bin Qais, daripada Abu Musa: \"Mana-mana wanita yang memakai wangian, kemudian keluar agar wangiannya tercium, maka dia adalah penzina, dan setiap mata adalah penzina.\" Abu Asim berkata: \"Sebahagian sahabat kami meriwayatkannya secara marfu' (sampai kepada Nabi Muhammad SAW).\""
  },
  {
    "id": 39454,
    "hadith_number": 1917,
    "tajuk_hadith": "Larangan Allah Terhadap Wanita yang Membuat Tatu, Mencabut Bulu Kening, dan Merenggangkan Gigi",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ مَنْصُورٍ  ، عَنْ إِبْرَاهِيمَ  ، عَنْ عَلْقَمَةَ  ،  عَنْ عَبْدِ اللَّهِ  ، قَالَ :\" لَعَنَ اللَّهُ الْوَاشِمَاتِ، ، وَالْمُتَنَمِّصَاتِ، وَالْمُتَفَلِّجَاتِ لِلْحُسْنِ الْمُغَيِّرَاتِ خَلْقَ اللَّهِ \"، فَبَلَغَ ذَلِكَ امْرَأَةً مِنْ بَنِي أَسَدٍ يُقَالُ لَهَا : أُمُّ يَعْقُوبَ ، فَجَاءَتْ فَقَالَتْ : بَلَغَنِي أَنَّكَ لَعَنْتَ كَيْتَ وَكَيْتَ؟، فَقَالَ : وَمَا لِي لَا أَلْعَنُ مَنْ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَهُوَ فِي كِتَابِ اللَّهِ؟، فَقَالَتْ : لَقَدْ قَرَأْتُ مَا بَيْنَ اللَّوْحَيْنِ، فَمَا وَجَدْتُ فِيهِ مَا تَقُولُ.\nقَالَ : لَئِنْ كُنْتِ قَرَأْتِيهِ، لَقَدْ وَجَدْتِيهِ، أَمَا قَرَأْتِ # وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانْتَهُوا وَاتَّقُوا اللَّهَ إِنَّ اللَّهَ شَدِيدُ الْعِقَابِ سورة الحشر آية 7 #؟، فَقَالَتْ : بَلَى.\nقَالَ : فَإِنَّهُ قَدْ نَهَى عَنْهُ، فَقَالَتْ : فَإِنِّي أَرَى أَهْلَكَ يَفْعَلُونَهُ؟.\nقَالَ : فَادْخُلِي فَانْظُرِي.\nفَدَخَلَتْ فَنَظَرَتْ، فَلَمْ تَرَ مِنْ حَاجَتِهَا شَيْئًا، فَقَالَ : لَوْ كَانَتْ كَذَلِكَ مَا جَامَعْتُهَا",
    "malay_translation": "Telah meriwayatkan kepada kami Muhammad bin Yusuf, daripada Sufyan, daripada Mansur, daripada Ibrahim, daripada Alqamah, daripada Abdullah, beliau berkata: \"Allah melaknat wanita yang membuat tatu, wanita yang mencabut bulu kening, dan wanita yang merenggangkan gigi untuk kecantikan, yang mengubah ciptaan Allah.\" Berita ini sampai kepada seorang wanita daripada Bani Asad yang dikenali sebagai Ummu Yaqub. Beliau datang dan berkata: \"Telah sampai kepada saya bahawa anda telah melaknat perkara itu dan ini?\" Abdullah menjawab: \"Mengapa saya tidak melaknat orang yang dilaknat oleh Rasulullah SAW, sedangkan ia ada di dalam Kitab Allah?\" Wanita itu berkata: \"Saya telah membaca seluruh al-Quran, tetapi saya tidak menjumpai apa yang anda katakan di dalamnya.\" Abdullah berkata: \"Jika benar kamu membacanya, pasti kamu akan menemuinya. Tidakkah kamu membaca ayat: 'Dan apa jua yang Rasulullah berikan kepada kamu maka terimalah, dan apa jua yang dilarangnya bagi kamu maka tinggalkanlah; dan bertakwalah kamu kepada Allah. Sesungguhnya Allah sangat berat azab seksa-Nya.' (Surah al-Hasyr, ayat 7)?\" Wanita itu menjawab: \"Ya, saya ada membaca.\" Abdullah berkata: \"Sesungguhnya Rasulullah SAW telah melarang perbuatan tersebut.\" Wanita itu berkata: \"Namun, saya melihat ahli keluarga anda melakukannya?\" Abdullah berkata: \"Masuklah dan lihatlah sendiri.\" Wanita itu masuk dan melihat, dan tidak mendapati apa yang diperkatakannya itu ada pada ahli keluarga Abdullah. Kemudian Abdullah berkata: \"Sekiranya isteri saya melakukan perkara itu, nescaya saya tidak akan bersamanya (bercampur dengan isteri saya).\""
  },
  {
    "id": 39455,
    "hadith_number": 1918,
    "tajuk_hadith": "Larangan Terhadap Sepuluh Perkara",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُثْمَانُ بْنُ مُحَمَّدٍ  ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ  ، حَدَّثَنِي يَحْيَى بْنُ أَيُّوبَ الْحَضْرَمِيُّ  ، أَخْبَرَنِي عَيَّاشُ بْنُ عَبَّاسٍ الْحِمْيَرِيُّ  ، عَنْ أَبِي الْحُصَيْنِ الْحَجْرِيِّ  ، عَنْ أَبِي عَامِرٍ  ، قَالَ : سَمِعْتُ أَبَا رَيْحَانَةَ   صَاحِبَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ : كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \" يَنْهَى عَنْعَشْرِ خِصَالٍ : مُكَامَعَةِ الرَّجُلِ الرَّجُلَ فِي شِعَارٍ وَاحِدٍ لَيْسَ بَيْنَهُمَا شَيْءٌ.\nوَمُكَامَعَةِ الْمَرْأَةِ الْمَرْأَةَ فِي شِعَارٍ وَاحِدٍ لَيْسَ بَيْنَهُمَا شَيْءٌ.\nوَالنَّتْفِ، وَالْوَشْمِ، وَالنُّهْبَةِ، وَرُكُوبِ النُّمُورِ، وَاتِّخَاذِ الدِّيبَاجِ هَاهُنَا عَلَى الْعَاتِقَيْنِ، وَفِي أَسْفَلِ الثِّيَابِ \".\n قَالَ عَبْد اللَّهِ : أَبُو عَامِرٍ.\nشَيْخٌ لَهُمْ، وَالْمُكَامَعَةُ : الْمُضَاجَعَةُ",
    "malay_translation": "Uthman bin Muhammad telah mengkhabarkan kepada kami, Zaid bin al-Hubab telah menceritakan kepada kami, Yahya bin Ayyub al-Hadrami telah menceritakan kepada saya, Ayyash bin Abbas al-Himyari telah mengkhabarkan kepada saya, daripada Abu al-Husain al-Hajari, daripada Abu Amir, dia berkata: Saya mendengar Abu Raihanah, sahabat Rasulullah صلى الله عليه وسلم, berkata: Rasulullah صلى الله عليه وسلم \"melarang sepuluh perkara: seorang lelaki tidur berbogel dengan lelaki lain di bawah satu kain tanpa apa-apa di antara mereka.\nDan seorang wanita tidur berbogel dengan wanita lain di bawah satu kain tanpa apa-apa di antara mereka.\nDan mencabut bulu, tatu, rampasan, menunggang harimau, dan memakai sutera di sini di atas bahu, dan di bahagian bawah pakaian.\"\nAbdullah berkata: Abu Amir.\nSeorang syeikh bagi mereka, dan al-mukama'ah ialah: berbaring bersebelahan."
  },
  {
    "id": 39456,
    "hadith_number": 1919,
    "tajuk_hadith": "Laknat Nabi Terhadap Lelaki yang Menyerupai Wanita dan Wanita yang Menyerupai Lelaki",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، وَوَهْبُ بْنُ جَرِيرٍ  ، قَالَا : حَدَّثَنَا هِشَامٌ هُوَ الدَّسْتَوَائِيُّ  ، عَنْ يَحْيَى  ، عَنْ عِكْرِمَةَ  ، عَنِ ابْنِ عَبَّاسٍ   : أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَنَالْمُخَنَّثِينَ مِنَ الرِّجَالِ، وَالْمُتَرَجِّلَاتِ مِنَ النِّسَاءِ، وَقَالَ : \" أَخْرِجُوهُمْ مِنْ بُيُوتِكُمْ \".\nقَالَ : فَأَخْرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فُلَانًا، وَأَخْرَجَ عُمَرُ فُلَانًا أَوْ فُلَانَةً.\n قَالَ عَبْد اللَّهِ : فَأَشُكُّ",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, dan Wahb bin Jarir, mereka berdua berkata: Telah menceritakan kepada kami Hisyam iaitu Ad-Dastawa'i, daripada Yahya, daripada Ikrimah, daripada Ibn Abbas: Bahawa Nabi صلى الله عليه وسلم melaknat lelaki yang menyerupai wanita (mukhannathin) dan wanita yang menyerupai lelaki (mutarajjilat), dan bersabda: \"Keluarkan mereka dari rumah-rumah kamu.\" Beliau (Ikrimah) berkata: Nabi صلى الله عليه وسلم mengeluarkan fulan, dan Umar mengeluarkan fulan atau fulanah. Abdullah berkata: Aku ragu."
  },
  {
    "id": 39457,
    "hadith_number": 1920,
    "tajuk_hadith": "Paha Adalah Aurat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ  ، أَخْبَرَنَا مَالِكٌ  ، عَنْ أَبِي النَّضْرِ  ، عَنْ زُرْعَةَ بْنِ عَبْدِ الرَّحْمَنِ  ، عَنْ أَبِيهِ   وَكَانَ مِنْ أَصْحَابِ الصُّفَّةِ، قَالَ : جَلَسَ عِنْدَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفَخِذِي مُنْكَشِفَةٌ، فَقَالَ :\" خَمِّرْ عَلَيْكَ، أَمَا عَلِمْتَ أَنَّ الْفَخِذَ عَوْرَةٌ؟ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Hakam bin al-Mubarak, telah mengkhabarkan kepada kami Malik, daripada Abu al-Nadr, daripada Zur'ah bin Abd al-Rahman, daripada bapanya - dan bapanya adalah daripada kalangan Ashab al-Suffah - dia berkata: Rasulullah SAW pernah duduk bersama kami ketika pahaku terdedah. Baginda bersabda: 'Tutuplah pahamu, tidakkah kamu tahu bahawa paha itu aurat?'"
  },
  {
    "id": 39458,
    "hadith_number": 1921,
    "tajuk_hadith": "Larangan Menanggalkan Pakaian Selain di Rumah Suami",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَعْلَى  ، حَدَّثَنَا الْأَعْمَشُ  ، عَنْ عَمْرِو بْنِ مُرَّةَ  ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ  ، قَالَ : دَخَلَ عَلَى عَائِشَةَ   نِسْوَةٌ مِنْ أَهْلِ حِمْصَ يَسْتَفْتِينَهَا، فَقَالَتْ : لَعَلَّكُنَّ مِنَ النِّسْوَةِ اللَّاتِي يَدْخُلْنَ الْحَمَّامَاتِ؟.\nقُلْنَ : نَعَمْ.\nقَالَتْ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" مَا مِنْ امْرَأَةٍ تَضَعُ ثِيَابَهَا فِي غَيْرِ بَيْتِ زَوْجِهَا، إِلَّا هَتَكَتْ مَا بَيْنَهَا وَبَيْنَ اللَّهِ G \".\nقَالَ أَبُو مُحَمَّد : أَخْبَرَنَا عُبَيْدُ اللَّهِ  ، عَنْ إِسْرَائِيلَ  ، عَنْ مَنْصُورٍ  ، عَنْ سَالِمٍ  ، عَنْ أَبِي الْمَلِيحِ  ، عَنْ عَائِشَةَ  ، هَذَا الْحَدِيثَ",
    "malay_translation": "Ya'la telah mengkhabarkan kepada kami, al-A'mash telah menceritakan kepada kami, daripada 'Amr bin Murrah, daripada Salim bin Abi al-Ja'd, dia berkata: Beberapa orang wanita dari Himsa masuk menemui Aisyah untuk meminta fatwa. Lalu Aisyah bertanya: 'Adakah kamu semua dari kalangan wanita yang pergi ke حمّامات (tempat mandi awam)?' Mereka menjawab: 'Ya.' Aisyah berkata: 'Aku mendengar Rasulullah SAW bersabda: 'Tidaklah seorang wanita menanggalkan pakaiannya di selain rumah suaminya, melainkan dia telah memutuskan hubungan antara dirinya dengan Allah.' Abu Muhammad berkata: Ubaidullah telah mengkhabarkan kepada kami, daripada Israil, daripada Mansur, daripada Salim, daripada Abi al-Malih, daripada Aisyah, hadis ini."
  },
  {
    "id": 39459,
    "hadith_number": 1922,
    "tajuk_hadith": "Adab dalam Majlis: Berlapang Dada",
    "perawi_melayu": "Musaddad, Bishr bin al-Mufadhdhal, Ubaidullah, Nafi', Ibn Umar",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُسَدَّدٌ  ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ  ، حَدَّثَنَا عُبَيْدُ اللَّهِ  ، عَنْ نَافِعٍ  ، عَنِ ابْنِ عُمَرَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَا يُقِيمُ الرَّجُلُ يَعْنِي : أَخَاهُ مِنْ مَجْلِسِهِ، ثُمَّ يَقْعُدُ فِيهِ، وَلَكِنْ تَفَسَّحُوا وَتَوَسَّعُوا \"",
    "malay_translation": "Musaddad memberitahu kami, Bishr bin al-Mufadhdhal menceritakan kepada kami, Ubaidullah menceritakan kepada kami, daripada Nafi', daripada Ibn Umar, berkata: Rasulullah SAW bersabda: \"Janganlah seseorang itu menyuruh orang lain bangun dari tempat duduknya, kemudian dia duduk di situ, tetapi berlapang-lapanglah dan meluaskanlah.\""
  },
  {
    "id": 39460,
    "hadith_number": 1923,
    "tajuk_hadith": "Hak Kembali ke Tempat Duduk di Majlis",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا زُهَيْرٌ  ، حَدَّثَنَا سُهَيْلٌ  ، عَنْ أَبِيهِ  ،  عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِذَا قَامَ أَحَدُكُمْ أَوِ الرَّجُلُ مِنْ مَجْلِسِهِ ثُمَّ رَجَعَ إِلَيْهِ، فَهُوَ أَحَقُّ بِهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Abdullah, telah menceritakan kepada kami Zuhair, telah menceritakan kepada kami Suhail, daripada ayahnya, daripada Abu Hurairah, beliau berkata: Rasulullah ﷺ bersabda: \"Apabila salah seorang daripada kamu atau seseorang lelaki bangun dari tempat duduknya kemudian kembali kepadanya, maka dia lebih berhak dengannya.\""
  },
  {
    "id": 39461,
    "hadith_number": 1924,
    "tajuk_hadith": "Adab Menunjukkan Jalan, Menyebarkan Salam dan Membantu Orang Dizalimi",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ  ، حَدَّثَنَا شُعْبَةُ  ، حَدَّثَنَا أَبُو إِسْحَاق  ، عَنِ الْبَرَاءِ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِنَاسٍ جُلُوسٍ مِنَ الْأَنْصَارِ، فَقَالَ :\" إِنْ كُنْتُمْ لَا بُدَّ فَاعِلِينَ، فَاهْدُوا السَّبِيلَ، وَأَفْشُوا السَّلَامَ، وَأَعِينُوا الْمَظْلُومَ \".\nقَالَ شُعْبَةُ : لَمْ يَسْمَعْ هَذَا الْحَدِيثَ أَبُو إِسْحَاق مِنَ الْبَرَاءِ",
    "malay_translation": "Abu al-Walid al-Tayalisi memberitahu kami, Syu'bah menceritakan kepada kami, Abu Ishaq menceritakan kepada kami, daripada al-Bara': Bahawa Rasulullah SAW melalui sekumpulan orang Ansar yang sedang duduk, lalu bersabda: \"Jika kamu mesti melakukannya, maka tunjukkanlah jalan, sebarkanlah salam, dan bantulah orang yang dizalimi.\"\nSyu'bah berkata: Abu Ishaq tidak mendengar hadis ini daripada al-Bara'."
  },
  {
    "id": 39462,
    "hadith_number": 1925,
    "tajuk_hadith": "Rasulullah SAW Berbaring Terlentang di Masjid",
    "perawi_melayu": "Muhammad bin Ahmad bin Abi Khalaf",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ  ، حَدَّثَنَا سُفْيَانُ  ، قَالَ : سَمِعْتُ الزُّهْرِيَّ  يُحَدِّثُ، عَنْ عَبَّادِ بْنِ تَمِيمٍ  ، عَنْ عَمِّهِ  ، قَالَ : رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" مُسْتَلْقِيًا فِي الْمَسْجِدِ، وَاضِعًا إِحْدَى رِجْلَيْهِ عَلَى الْأُخْرَى \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Ahmad bin Abi Khalaf, telah menceritakan kepada kami Sufyan, dia berkata: Saya mendengar al-Zuhri menceritakan, daripada 'Abbad bin Tamim, daripada bapa saudaranya, dia berkata: Saya melihat Rasulullah SAW berbaring terlentang di dalam masjid, meletakkan salah satu kakinya di atas kaki yang lain."
  },
  {
    "id": 39463,
    "hadith_number": 1926,
    "tajuk_hadith": "Larangan Berbisik Ketika Bertiga",
    "perawi_melayu": "Abdullah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، عَنْ الْأَعْمَشِ  ، عَنْ أَبِي وَائِلٍ  ، عَنْ عَبْدِ اللَّهِ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِذَا كُنْتُمْ ثَلَاثَةً، فَلَا يَتَنَاجَى اثْنَانِ دُونَ صَاحِبِهِمَا، فَإِنَّ ذَلِكَ يُحْزِنُهُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ubaidullah bin Musa, daripada al-A'mash, daripada Abi Wa'il, daripada Abdullah, dia berkata: Rasulullah ﷺ bersabda: \"Apabila kamu bertiga, maka janganlah dua orang berbisik-bisik tanpa (melibatkan) sahabat mereka, kerana sesungguhnya yang demikian itu akan menyedihkannya.\""
  },
  {
    "id": 39464,
    "hadith_number": 1927,
    "tajuk_hadith": "Doa Kafarah Majlis",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ،  حَدَّثَنَا حَجَّاجٌ يَعْنِي : ابْنَ دِينَارٍ  ، عَنْ أَبِي هَاشِمٍ  ، عَنْ رُفَيْعٍ : أَبِي الْعَالِيَةِ  ، عَنْ أَبِي بَرْزَةَ الْأَسْلَمِيِّ  ، قَالَ : لَمَّا كَانَ بِأَخَرَةٍ، كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا جَلَسَ فِي الْمَجْلِسِ فَأَرَادَ أَنْ يَقُومَ، قَالَ :\" سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ \".\nفَقَالُوا : يَا رَسُولَ اللَّهِ، إِنَّكَ لَتَقُولُ الْآنَ كَلَامًا، مَا كُنْتَ تَقُولُهُ فِيمَا خَلَا، فَقَالَ : \" هَذَا كَفَّارَةٌ لِمَا يَكُونُ فِي الْمَجَالِسِ \"",
    "malay_translation": "Telah menceritakan kepada kami Ya'la bin Ubaid, telah menceritakan kepada kami Hajjaj iaitu Ibnu Dinar, dari Abu Hashim, dari Rufai' iaitu Abu al-'Aliyah, dari Abu Barzah al-Aslami, dia berkata: Pada akhir-akhir zaman, adalah Rasulullah SAW apabila duduk dalam majlis dan hendak bangun, baginda bersabda: \"Subhanakallahumma wa bihamdika, asyhadu alla ilaha illa anta, astaghfiruka wa atubu ilaika.\" Mereka berkata: Wahai Rasulullah, sesungguhnya engkau berkata sekarang perkataan yang tidak pernah engkau katakan sebelum ini. Baginda bersabda: \"Ini adalah penebus dosa bagi apa yang berlaku dalam majlis.\""
  },
  {
    "id": 39465,
    "hadith_number": 1928,
    "tajuk_hadith": "Adab Bersin dan Balasan Doa",
    "perawi_melayu": "Diriwayatkan oleh: Sa'id bin Amir, daripada Syu'bah, daripada Muhammad bin Abd Rahman bin Abi Laila, daripada Isa (saudaranya), daripada Abd Rahman bin Abi Laila (ayahnya), daripada Abu Ayyub al-Ansari, daripada Nabi SAW.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ  ، عَنْ شُعْبَةَ  ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى  ، عَنْ أَخِيهِ عِيسَى  ، عَنْ أَبِيهِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى  ، عَنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" الْعَاطِسُ يَقُولُ : الْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ.\nوَيَقُولُ الَّذِي يُشَمِّتُهُ : يَرْحَمُكُمْ اللَّهُ، وَيَرُدُّ عَلَيْهِ : يَهْدِيكُمُ اللَّهُ وَيُصْلِحُ بَالَكُمْ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Sa'id bin Amir, daripada Syu'bah, daripada Muhammad bin Abd Rahman bin Abi Laila, daripada saudaranya Isa, daripada ayahnya Abd Rahman bin Abi Laila, daripada Abu Ayyub al-Ansari, daripada Nabi SAW, baginda bersabda: \"Orang yang bersin mengucapkan: 'Alhamdulillah 'ala kulli hal' (Segala puji bagi Allah dalam setiap keadaan). Dan orang yang mendoakannya mengucapkan: 'Yarhamukallah' (Semoga Allah merahmatimu), dan dia membalasnya: 'Yahdikumullah wa yuslih balakum' (Semoga Allah memberi petunjuk kepadamu dan memperbaiki keadaanmu).\""
  },
  {
    "id": 39466,
    "hadith_number": 1929,
    "tajuk_hadith": "Doa Nabi SAW bagi Orang yang Bersin dan Memuji Allah",
    "perawi_melayu": "Perawi Tidak Diketahui",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا زُهَيْرٌ  ، عَنْ سُلَيْمَانَ  ،  عَنْ أَنَسٍ  ، قَالَ : عَطَسَ رَجُلَانِ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَشَمَّتَ أَوْ سَمَّتَ أَحَدَهُمَا وَلَمْ يُشَمِّتْ الْآخَرَ، فَقِيلَ لَهُ : يَا رَسُولَ اللَّهِ، شَمَّتَّ هَذَا وَلَمْ تُشَمِّتْ الْآخَرَ؟، فَقَالَ :\" إِنَّ هَذَا حَمِدَ اللَّهَ، وَإِنَّ هَذَا لَمْ يَحْمَدْ اللَّهَ \".\nقَالَ عَبْد اللَّهِ : سُلَيْمَانُ هُوَ : التَّيْمِيُّ",
    "malay_translation": "Telah mengkhabarkan kepada kami Ahmad bin Abdullah, telah menceritakan kepada kami Zuhair, daripada Sulaiman, daripada Anas, dia berkata: Dua orang lelaki bersin di sisi Nabi SAW, lalu baginda mendoakan rahmat (yarhamukallah) atau mendoakan salah seorang daripada mereka, dan tidak mendoakan yang lain. Lalu dikatakan kepada baginda: Wahai Rasulullah, engkau mendoakan rahmat untuk ini dan tidak mendoakan untuk yang lain? Baginda bersabda: \"Sesungguhnya orang ini memuji Allah (mengucapkan Alhamdulillah), dan sesungguhnya orang ini tidak memuji Allah.\" Abdullah berkata: Sulaiman adalah: At-Taimi."
  },
  {
    "id": 39467,
    "hadith_number": 1930,
    "tajuk_hadith": "Adab Bersin di Hadapan Nabi",
    "perawi_melayu": "Abu al-Walid, Ikrimah bin Ammar, Iyas bin Salamah, Salamah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا عِكْرِمَةُ هُوَ : ابْنُ عَمَّارٍ  ، قَالَ : حَدَّثَنِي إِيَاسُ بْنُ سَلَمَةَ  ، قَالَ : حَدَّثَنِي أَبِي  ، قَالَ : عَطَسَ رَجُلٌ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ :\" يَرْحَمُكَ اللَّهُ \".\nثُمَّ عَطَسَ أُخْرَى، فَقَالَ : \" الرَّجُلُ مَزْكُومٌ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu al-Walid, telah menceritakan kepada kami Ikrimah iaitu Ibnu Ammar, dia berkata: Telah menceritakan kepadaku Iyas bin Salamah, dia berkata: Telah menceritakan kepadaku ayahku, dia berkata: Seorang lelaki bersin di sisi Nabi صلى الله عليه وسلم, lalu Baginda bersabda: \"Yarhamukallah\" (Semoga Allah merahmatimu).\nKemudian dia bersin lagi, lalu Baginda bersabda: \"Lelaki itu selesema.\""
  },
  {
    "id": 39468,
    "hadith_number": 1931,
    "tajuk_hadith": "Larangan Gambar Ketika Solat",
    "perawi_melayu": "Aisyah R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ  ، عَنْ شُعْبَةَ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ  ، عَنْ أَبِيهِ  ، قَالَ : قَالَتْ عَائِشَةُ   :\" كَانَ لَنَا ثَوْبٌ فِيهِ تَصَاوِيرُ، فَجَعَلْتُهُ بَيْنَ يَدَيْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصَلِّي، فَنَهَانِي أَوْ قَالَتْ : فَكَرِهَهُ ، قَالَتْ : فَجَعَلْتُهُ وَسَائِدَ \"",
    "malay_translation": "Sa'id bin 'Amir telah mengkhabarkan kepada kami, daripada Syu'bah, daripada 'Abdurrahman bin al-Qasim, daripada ayahnya, dia berkata: 'Aisyah berkata: 'Kami mempunyai sehelai kain yang terdapat gambar-gambar padanya, lalu aku meletakkannya di hadapan Nabi ﷺ ketika Baginda sedang solat, lalu Baginda melarangku atau dia berkata: Baginda tidak menyukainya, dia berkata: lalu aku menjadikannya bantal.'"
  },
  {
    "id": 39469,
    "hadith_number": 1932,
    "tajuk_hadith": "Malaikat Tidak Masuk Rumah yang Ada Anjing, Gambar, dan Orang Junub",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ  ، حَدَّثَنَا عُمَارَةُ بْنُ الْقَعْقَاعِ  ، حَدَّثَنَا الْحَارِثُ الْعُكْلِيُّ  ، عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ نُجَيٍّ  ، عَنْ عَلِيٍّ   : أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" إِنَّ الْمَلَكَ لَا يَدْخُلُ بَيْتًا فِيهِ كَلْبٌ، وَلَا صُورَةٌ، وَلَا جُنُبٌ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu An-Nu'man, telah menceritakan kepada kami Abdul Wahid bin Ziyad, telah menceritakan kepada kami 'Umarah bin al-Qa'qa', telah menceritakan kepada kami al-Harith al-'Ukli, dari Abu Zur'ah bin 'Amr bin Jarir, dari Abdullah bin Nujay, dari Ali RA, bahawa Nabi SAW bersabda: \"Sesungguhnya malaikat tidak akan masuk ke dalam rumah yang di dalamnya terdapat anjing, tidak juga gambar, dan tidak juga orang yang junub.\""
  },
  {
    "id": 39470,
    "hadith_number": 1933,
    "tajuk_hadith": "Ganjaran Sedekah bagi Nafkah yang Dibelanjakan untuk Keluarga",
    "perawi_melayu": "Abu Mas'ud Al-Badri",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا شُعْبَةُ  ، قَالَ : عَدِيُّ بْنُ ثَابِتٍ  أَخْبَرَنِي، قالَ : سَمِعْتُ عَبْدَ اللَّهِ بْنَ يَزِيدَ  يُحَدِّثُ، عَنْ أَبِي مَسْعُودٍ الْبَدْرِيِّ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ :\" الْمُسْلِمُ إِذَا أَنَفْقَ نَفَقَةً عَلَى أَهْلِهِ وَهُوَ يَحْتَسِبُهَا، فَهِيَ لَهُ صَدَقَةٌ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Al-Walid, telah menceritakan kepada kami Syu'bah, dia berkata: 'Adi bin Thabit memberitahuku, dia berkata: Aku mendengar Abdullah bin Yazid menceritakan, dari Abu Mas'ud Al-Badri, dari Nabi ﷺ, bahawa baginda bersabda: \"Seorang Muslim apabila membelanjakan nafkah kepada keluarganya dan dia mengharapkan pahala dari Allah, maka ia adalah sedekah baginya.\""
  },
  {
    "id": 39471,
    "hadith_number": 1934,
    "tajuk_hadith": "Rasulullah SAW Membawa Hasan dan Husain Semasa Kembali dari Perjalanan",
    "perawi_melayu": "Abdullah bin Jaafar",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا ثَابِتُ بْنُ يَزِيدَ  ، قَالَ : حَدَّثَنَا عَاصِمٌ الْأَحْوَلُ  ، عَنْ مُوَرِّقٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ  ، قَالَ : \" كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَاقَفَلَ، تُلُقِّيَ بِي وَبِالْحَسَنِ أَوْ بِالْحُسَيْنِ، قَالَ : وَأُرَاهُ قَالَ : الْحَسَنَ فَحَمَلَنِي بَيْنَ يَدَيْهِ، وَالْحَسَنَ وَرَاءَهُ، حَتَّى قَدِمْنَا الْمَدِينَةَ وَنَحْنُ عَلَى الدَّابَّةِ الَّتِي عَلَيْهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \"",
    "malay_translation": "Abu Nu'man memberitahu kami, Thabit bin Yazid menceritakan kepada kami, katanya: Asim al-Ahwal menceritakan kepada kami, daripada Muwarriq, daripada Abdullah bin Jaafar, katanya: \"Rasulullah SAW biasanya apabila kembali dari perjalanan, baginda akan disambut olehku dan Hasan atau Husain,\" katanya, \"dan saya rasa dia berkata: Hasan, lalu baginda membawa saya di hadapannya, dan Hasan di belakangnya, sehingga kami tiba di Madinah dan kami berada di atas haiwan tunggangan yang dinaiki oleh Nabi SAW.\""
  },
  {
    "id": 39472,
    "hadith_number": 1935,
    "tajuk_hadith": "Keutamaan Seseorang Menjadi Imam di Tempatnya Sendiri",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ سُلَيْمَانَ  ، عَنْ إِسْحَاق بْنِ يَحْيَى بْنِ طَلْحَةَ  ، عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ  ، وَمَعْبَدِ بْنِ خَالِدٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْخَطْمِيِّ  وَكَانَ أَمِيرًا عَلَى الْكُوفَةِ ، قَالَ : أَتَيْنَا قَيْسَ بْنَ سَعْدِ بْنِ عُبَادَةَ فِي بَيْتِهِ، فَأَذَّنَ الْمُؤَذِّنِ لِلصَّلَاةِ، وَقُلْنَا لِقَيْسٍ : قُمْ فَصَلِّ لَنَا، فَقَالَ : لَمْ أَكُنْ لِأُصَلِّيَ بِقَوْمٍ لَسْتُ عَلَيْهِمْ بِأَمِيرٍ، فَقَالَ رَجُلٌ لَيْسَ بِدُونِهِ.\nيُقَالُ لَهُ : عَبْدُ اللَّهِ بْنُ حَنْظَلَةَ بْنِ الْغَسِيلِ   : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" الرَّجُلُ أَحَقُّ بِصَدْرِ دَابَّتِهِ، وَصَدْرِ فِرَاشِهِ، وَأَنْ يَؤُمَّ فِي رَحْلِهِ \"، فَقَالَ قَيْسُ بْنُ سَعْدٍ عِنْدَ ذَلِكَ : يَا فُلَانُ لِمَوْلًى لَهُ : قُمْ فَصَلِّ لَهُمْ",
    "malay_translation": "Telah mengkhabarkan kepada kami Sa'id bin Sulaiman, daripada Ishaq bin Yahya bin Talhah, daripada al-Musayyib bin Rafi', dan Ma'bad bin Khalid, daripada Abdullah bin Yazid al-Khatmi - dan beliau adalah seorang amir di Kufah - beliau berkata: Kami telah mendatangi Qais bin Sa'd bin Ubadah di rumahnya, lalu muazin melaungkan azan untuk solat. Kami berkata kepada Qais: Bangun dan solatlah untuk kami. Beliau berkata: Aku tidak akan solat untuk suatu kaum yang aku bukan amir bagi mereka. Lalu seorang lelaki yang tidak kurang daripadanya berkata - dikatakan namanya Abdullah bin Hanzalah bin al-Ghasil -: Rasulullah SAW bersabda: \"Seseorang lebih berhak dengan bahagian depan kenderaannya, bahagian depan tempat tidurnya, dan untuk menjadi imam di tempat perjalanannya.\" Maka Qais bin Sa'd berkata ketika itu: Wahai Fulan - kepada hambanya -: Bangun dan solatlah untuk mereka."
  },
  {
    "id": 39473,
    "hadith_number": 1936,
    "tajuk_hadith": "Adab Menunggang Unta dan Menyebut Nama Allah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، عَنْ أُسَامَةَ بْنِ زَيْدٍ  ، عَنْ مُحَمَّدِ بْنِ حَمْزَةَ بْنِ عَمْرٍو الْأَسْلَمِيِّ  ، قَالَ : وَقَدْ صَحِبَ أَبُوهُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ : سَمِعْتُ أَبِي   يَقُولُ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" عَلَى ذِرْوَةِ كُلِّ بَعِيرٍ شَيْطَانٌ، فَإِذَا رَكِبْتُمُوهَا فَسَمُّوا اللَّهَ وَلَا تُقَصِّرُوا عَنْ حَاجَاتِكُمْ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ubaidullah bin Musa, daripada Usamah bin Zaid, daripada Muhammad bin Hamzah bin 'Amr al-Aslami, beliau berkata: Ayahnya telah menemani Rasulullah SAW, beliau berkata: Aku mendengar ayahku berkata: Rasulullah SAW bersabda: \"Pada setiap puncak unta itu ada syaitan. Apabila kamu menungganginya, maka sebutlah nama Allah dan janganlah kamu lalai dari keperluan kamu.\""
  },
  {
    "id": 39474,
    "hadith_number": 1937,
    "tajuk_hadith": "Adab Menunggang Binatang Tunggangan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُثْمَانُ بْنُ مُحَمَّدٍ  ، حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ  ، حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ  ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ  ، عَنْ سَهْلِ بْنِ مُعَاذِ بْنِ أَنَسٍ  ، عَنْ أَبِيهِ   وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" ارْكَبُوا هَذِهِ الدَّوَابَّ سَالِمَةً، وَلَا تَتَّخِذُوهَا كَرَاسِيَّ \".\nأَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، عَنْ اللَّيْثِ  ، .\n..\n..\n..\n. إِلَّا أَنَّهُ مُخَالِفٌ شَبَابَةَ فِي شَيْءٍ",
    "malay_translation": "Telah mengkhabarkan kepada kami Uthman bin Muhammad, telah menceritakan kepada kami Syababah bin Sawwar, telah menceritakan kepada kami Laith bin Saad, daripada Yazid bin Abi Habib, daripada Sahl bin Muadz bin Anas, daripada bapanya, dan dia adalah daripada sahabat Nabi صلى الله عليه وسلم: Bahawa Rasulullah صلى الله عليه وسلم bersabda: \"Tunggangilah binatang tunggangan ini dalam keadaan selamat, dan jangan menjadikannya sebagai kerusi.\"\nTelah mengkhabarkan kepada kami Abdullah bin Salih, daripada Laith, .\n..\n..\n..\n. Kecuali bahawa dia menyalahi Syababah dalam sesuatu."
  },
  {
    "id": 39475,
    "hadith_number": 1938,
    "tajuk_hadith": "Perjalanan Adalah Sepotong Azab",
    "perawi_melayu": "Khalid bin Makhlad, Malik, Sumayy, Abu Salih, Abu Hurairah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ سُمَيٍّ  ، عَنْ أَبِي صَالِحٍ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" السَّفَرُ قِطْعَةٌ مِنْ الْعَذَابِ يَمْنَعُ أَحَدَكُمْ نَوْمَهُ وَطَعَامَهُ وَشَرَابَهُ، فَإِذَا قَضَى أَحَدُكُمْ نَهْمَتَهُ مِنْ وَجْهِهِ فَلْيُعَجِّلْ الرَّجْعَةَ إِلَى أَهْلِهِ \"",
    "malay_translation": "Perjalanan adalah sepotong azab, yang menghalang salah seorang daripada kamu daripada tidur, makan dan minumnya. Apabila salah seorang daripada kamu telah menyelesaikan urusannya, maka hendaklah dia segera kembali kepada keluarganya."
  },
  {
    "id": 39476,
    "hadith_number": 1939,
    "tajuk_hadith": "Doa Nabi Muhammad SAW untuk Musafir",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي كَعْبٍ : أَبُو الْحَسَنِ الْعَبْدِيُّ  ، قَالَ : حَدَّثَنِي مُوسَى بْنُ مَيْسَرَةَ الْعَبْدِيُّ  ، عَنْ أَنَسِ بْنِ مَالِكٍ  ، قَالَ : جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ لَهُ : يَا نَبِيَّ اللَّهِ إِنِّي أُرِيدُ السَّفَرَ.\nفَقَالَ لَهُ : \" مَتَى؟ \".\nقَالَ : غَدًا إِنْ شَاءَ اللَّهُ.\nقَالَ : فَأَتَاهُ، فَأَخَذَ بِيَدِهِ، فَقَالَ لَهُ :\" فِي حِفْظِ اللَّهِ، وَفِي كَنَفِهِ، زَوَّدَكَ اللَّهُ التَّقْوَى، وَغَفَرَ لَكَ ذَنْبَكَ، وَوَجَّهَكَ لِلْخَيْرِ أَيْنَمَا تَوَخَّيْتَ أَوْ أَيْنَمَا تَوَجَّهْتَ \".\nشَكَّ سَعِيدٌ فِي إِحْدَى الْكَلِمَتَيْنِ",
    "malay_translation": "Telah menceritakan kepada kami Muslim bin Ibrahim, telah menceritakan kepada kami Sa'id bin Abi Ka'b: Abu al-Hasan al-'Abdi, dia berkata: Telah menceritakan kepadaku Musa bin Maisarah al-'Abdi, dari Anas bin Malik, dia berkata: Seorang lelaki datang kepada Nabi ﷺ dan berkata kepadanya: \"Wahai Nabi Allah, sesungguhnya aku ingin bermusafir.\"\n\nBaginda bertanya kepadanya: \"Bila?\"\n\nDia menjawab: \"Esok, InsyaAllah.\"\n\nDia (Anas) berkata: Lalu dia datang kepada Baginda, lalu Baginda memegang tangannya dan bersabda kepadanya: \"Semoga engkau dalam penjagaan Allah dan perlindungan-Nya. Semoga Allah membekalkanmu dengan ketakwaan, mengampuni dosamu, dan mengarahkanmu kepada kebaikan di mana sahaja engkau menuju atau ke mana sahaja engkau menghadap.\"\n\nSa'id ragu pada salah satu daripada dua perkataan tersebut."
  },
  {
    "id": 39477,
    "hadith_number": 1940,
    "tajuk_hadith": "Doa Nabi SAW Ketika Bermusafir",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا عَاصِمٌ هُوَ الْأَحْوَلُ  ، قَالَ : وَثَبَّتَنِي شُعْبَةُ  ، عَنْ عَبْدِ اللَّهِ بْنِ سَرْجِسٍ  ، قَالَ : كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَافَرَ، قَالَ :\" اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكَآبَةِ الْمُنْقَلَبِ، وَالْحَوْرِ بَعْدَ الْكَوْرِ، وَدَعْوَةِ الْمَظْلُومِ، وَسُوءِ الْمَنْظَرِ فِي الْأَهْلِ وَالْمَالِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah mengkhabarkan kepada kami Asim iaitu al-Ahwal, dia berkata: Dan telah menetapkan kepadaku Syu'bah, daripada Abdullah bin Sarjis, dia berkata: Adalah Nabi صلى الله عليه وسلم apabila bermusafir, baginda bersabda: \"Ya Allah, sesungguhnya aku berlindung kepada-Mu daripada kepayahan perjalanan, dan kesedihan ketika kembali, dan kekurangan setelah kebaikan, dan doa orang yang dizalimi, dan pemandangan yang buruk pada keluarga dan harta.\""
  },
  {
    "id": 39478,
    "hadith_number": 1941,
    "tajuk_hadith": "Doa Ketika Bermusafir",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ أَبِي الزُّبَيْرِ  ، عَنْ عَلِيِّ بْنِ عَبْدِ اللَّهِ الْبَارِقِيِّ  ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَافَرَ فَرَكِبَ رَاحِلَتَهُ ،كَبَّرَ ثَلَاثًا وَيَقُولُ : \" # سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ { 13 } وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ { 14 } سورة الزخرف آية 13-14 #.\nاللَّهُمَّ إِنِّي أَسْأَلُكَ فِي سَفَرِي هَذَا الْبِرَّ وَالتَّقْوَى، وَمِنْ الْعَمَلِ مَا تَرْضَى.\nاللَّهُمَّ هَوِّنْ عَلَيْنَا السَّفَرَ، وَاطْوِ لَنَا بُعْدَ الْأَرْضِ، اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَلِيفَةُ فِي الْأَهْلِ، اللَّهُمَّ اصْحَبْنَا فِي سَفَرِنَا، وَاخْلُفْنَا فِي أَهْلِنَا بِخَيْرٍ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yahya bin Hassan, telah menceritakan kepada kami Hammad bin Salamah, daripada Abu Zubair, daripada Ali bin Abdullah al-Bariqi, daripada Abdullah bin Umar: Bahawa Rasulullah SAW apabila bermusafir dan menaiki kenderaannya, baginda bertakbir tiga kali dan berkata: \"Maha Suci Tuhan yang telah memudahkan kenderaan ini untuk kami, padahal kami tidak berkuasa mengendalikannya. Dan sesungguhnya kepada Tuhan kamilah kami akan kembali.\" (Surah Az-Zukhruf, ayat 13-14). \"Ya Allah, sesungguhnya aku memohon kepada-Mu dalam permusafiranku ini kebaikan dan ketakwaan, serta amalan yang Engkau redhai. Ya Allah, permudahkanlah perjalanan ini bagi kami, dan pendekkanlah jarak bumi bagi kami. Ya Allah, Engkaulah teman dalam perjalanan, dan pengganti bagi keluarga. Ya Allah, temanilah kami dalam perjalanan kami, dan gantikanlah kami dalam keluarga kami dengan kebaikan.\""
  },
  {
    "id": 39479,
    "hadith_number": 1942,
    "tajuk_hadith": "Takbir Ketika Mendaki, Tasbih Ketika Menurun",
    "perawi_melayu": "Jabir",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا أَبُو زُبَيْدٍ  ، عَنْ حُصَيْنٍ  ، عَنْ سَالِمٍ  ، عَنْ جَابِرٍ  ، قَالَ :\" كُنَّا إِذَا صَعِدْنَا، كَبَّرْنَا، وَإِذَا هَبَطْنَا، سَبَّحْنَا \"",
    "malay_translation": "Ahmad bin Abdullah memberitahu kami, Abu Zubair menceritakan kepada kami, daripada Husain, daripada Salim, daripada Jabir, dia berkata: \"Kami apabila mendaki, kami bertakbir, dan apabila kami menurun, kami bertasbih.\""
  },
  {
    "id": 39480,
    "hadith_number": 1943,
    "tajuk_hadith": "Kafilah Berloceng Tidak Disertai Malaikat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ نَافِعٍ  ، عَنْ سَالِمٍ  ، عَنْ أَبِي الْجَرَّاحِ  مَوْلَى أَمِّ حَبِيبَةَ ، عَنْ أُمِّ حَبِيبَةَ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" الْعِيرُ الَّتِي فِيهَا الْجَرَسُ، لَا تَصْحَبُهَا الْمَلَائِكَة \"",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Hakam bin al-Mubarak, telah menceritakan kepada kami Malik, daripada Nafi', daripada Salim, daripada Abi al-Jarrah, bekas hamba perempuan Ummu Habibah, daripada Ummu Habibah, daripada Nabi Muhammad SAW, baginda bersabda: \"Kafilah yang membawa loceng tidak akan disertai oleh malaikat.\""
  },
  {
    "id": 39481,
    "hadith_number": 1944,
    "tajuk_hadith": "Malaikat Tidak Menemani Rombongan yang Ada Anjing atau Loceng",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا زُهَيْرٌ  ، حَدَّثَنَا سُهَيْلُ بْنُ أَبِي صَالِحٍ  ، عَنْ أَبِيهِ  ، عَنْ أَبِي هُرَيْرَةَ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" لَا تَصْحَبُ الْمَلَائِكَةُ رِفْقَةً فِيهَا كَلْبٌ، أَوْ جَرَسٌ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ahmad bin Abdullah, telah menceritakan kepada kami Zuhair, telah menceritakan kepada kami Suhail bin Abi Soleh, daripada ayahnya, daripada Abu Hurairah, daripada Nabi صلى الله عليه وسلم, baginda bersabda: \"Malaikat tidak menemani rombongan yang di dalamnya ada anjing atau loceng.\""
  },
  {
    "id": 39482,
    "hadith_number": 1945,
    "tajuk_hadith": "Larangan Melaknat Kenderaan",
    "perawi_melayu": "Diriwayatkan daripada Imran bin Husain",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، عَنْ أَيُّوبَ  ، عَنْ أَبِي قِلَابَةَ  ، عَنْ أَبِي الْمُهَلَّبِ  ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ   : أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ فِي سَفَرٍ، فَسَمِعَ لَعْنَةً، فَقَالَ : \" مَا هَذَا؟ \".\nقَالُوا : فُلَانَةُ لَعَنَتْ رَاحِلَتَهَا.\nفَقَالَ :\" ضَعُوا عَنْهَا فَإِنَّهَا مَلْعُونَةٌ \".\nقَالَ : فَوَضَعُوا عَنْهَا.\nقَالَ عِمْرَانُ : كَأَنِّي أَنْظُرُ إِلَيْهَا نَاقَةً وَرْقَاءَ",
    "malay_translation": "Telah mengkhabarkan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Hammad bin Zaid, daripada Ayyub, daripada Abi Qilabah, daripada Abi Al-Muhallab, daripada Imran bin Husain: Bahawa Nabi ﷺ berada dalam perjalanan, lalu baginda mendengar laknat, lalu baginda bersabda: \"Apa ini?\". Mereka berkata: \"Fulanah telah melaknat kenderaannya\". Baginda bersabda: \"Letakkan beban daripadanya kerana sesungguhnya ia dilaknat\". Imran berkata: \"Seolah-olah aku melihat kepadanya seekor unta betina yang kelabu\"."
  },
  {
    "id": 39483,
    "hadith_number": 1946,
    "tajuk_hadith": "Larangan Wanita Melakukan Perjalanan Tanpa Mahram",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْلَى  ، حَدَّثَنَا الْأَعْمَشُ  ، عَنْ أَبِي صَالِحٍ  ، عَنْ أَبِي سَعِيدٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَا تُسَافِرِ الْمَرْأَةُ سَفَرًا ثَلَاثَةَ أَيَّامٍ فَصَاعِدًا إِلَّا وَمَعَهَا أَبُوهَا، أَوْ أَخُوهَا، أَوْ زَوْجُهَا، أَوْ ذُو مَحْرَمٍ مِنْهُمَا \"",
    "malay_translation": "Telah menceritakan kepada kami Ya'la, telah menceritakan kepada kami al-A'mash, dari Abu Salih, dari Abu Sa'id, dia berkata: Rasulullah SAW bersabda: 'Tidak boleh seorang wanita melakukan perjalanan selama tiga hari atau lebih kecuali bersamanya ayahnya, atau saudaranya, atau suaminya, atau mahram daripada kalangan mereka.'"
  },
  {
    "id": 39484,
    "hadith_number": 1947,
    "tajuk_hadith": "Larangan Musafir Malam Bersendirian",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْهَيْثَمُ بْنُ جَمِيلٍ  ، حَدَّثَنَا عَاصِمٌ هُوَ : ابْنُ مُحَمَّدٍ الْعُمَرِيُّ  ، عَنْ أَبِيهِ  ، عَنِ ابْنِ عُمَرَ  ، قَالَ : قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَوْ يَعْلَمُ النَّاسُ مَا فِي الْوَحْدَةِ، لَمْ يَسْرِ رَاكِبٌ بِلَيْلٍ وَحْدَهُ أَبَدًا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Al-Haitham bin Jamil, telah menceritakan kepada kami Asim iaitu Ibnu Muhammad Al-'Umari, daripada ayahnya, daripada Ibnu Umar, dia berkata: Nabi صلى الله عليه وسلم bersabda: \"Sekiranya manusia mengetahui apa bahaya bersendirian, nescaya tidak akan berjalan seorang penunggang pada waktu malam bersendirian selama-lamanya.\""
  },
  {
    "id": 39485,
    "hadith_number": 1948,
    "tajuk_hadith": "Perlindungan di Tempat Persinggahan",
    "perawi_melayu": "Khawla binti Hakim",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ إِسْحَاق  ، وَعَفَّانُ  ، قَالَا : حَدَّثَنَا وُهَيْبٌ  ، حَدَّثَنَا مُحَمَّدُ بْنُ عَجْلانَ  ، عَنْ يَعْقُوبَ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ  ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ  ، عَنْ سَعْدِ بْنِ مَالِكٍ  ، عَنْ خَوْلَةَ بِنْتِ حَكِيمٍ  ، قَالَتْ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" لَوْ أَنَّ أَحَدَكُمْ إِذَا نَزَلَ مَنْزِلًا، قَالَ : أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ، لَمْ يَضُرَّهُ فِي ذَلِكَ الْمَنْزِلِ شَيْءٌ حَتَّى يَرْتَحِلَ مِنْهُ \"",
    "malay_translation": "Ahmad bin Ishaq dan Affan memberitahu kami, mereka berkata: Wuhaib memberitahu kami, Muhammad bin Ajlan memberitahu kami, daripada Ya'qub bin Abdullah bin Al-Ashaj, daripada Sa'id bin Al-Musayyib, daripada Sa'd bin Malik, daripada Khawla binti Hakim, dia berkata: Saya mendengar Rasulullah SAW bersabda: \"Sekiranya salah seorang daripada kamu singgah di suatu tempat dan berkata: 'Aku berlindung dengan kalimah-kalimah Allah yang sempurna daripada kejahatan makhluk yang Dia ciptakan,' maka tidak ada sesuatu pun yang akan memudaratkannya di tempat itu sehingga dia berpindah darinya.\""
  },
  {
    "id": 39486,
    "hadith_number": 1949,
    "tajuk_hadith": "Nabi Muhammad SAW Solat Dua Rakaat Ketika Berhenti atau Meninggalkan Tempat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ عُثْمَانَ بْنِ سَعْدٍ  ، عَنْ أَنَسِ بْنِ مَالِكٍ   : أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ\" إِذَا نَزَلَ مَنْزِلًا، لَمْ يَرْتَحِلْ مِنْهُ حَتَّى يُصَلِّيَ رَكْعَتَيْنِ، أَوْ يُوَدِّعَ الْمَنْزِلَ بِرَكْعَتَيْنِ \".\nقَالَ عَبْد اللَّهِ : عُثْمَانُ بْنُ سَعْدٍ  ضَعِيفٌ",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Asim, daripada Uthman bin Sa'd, daripada Anas bin Malik: Bahawa Nabi SAW adalah \"Apabila Baginda berhenti di suatu tempat, Baginda tidak beredar dari situ sehingga Baginda solat dua rakaat, atau mengucapkan selamat tinggal kepada tempat itu dengan dua rakaat.\" Abdullah berkata: Uthman bin Sa'd adalah dhaif (lemah)."
  },
  {
    "id": 39487,
    "hadith_number": 1950,
    "tajuk_hadith": "Doa Nabi SAW Ketika Pulang dari Musafir",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ أَبِي الزُّبَيْرِ  ، عَنْ عَلِيِّ بْنِ عَبْدِ اللَّهِ الْبَارِقِيِّ  ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ   : أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا رَجَعَ مِنْ سَفَرِهِ، قَالَ :\" آيِبُونَ إِنْ شَاءَ اللَّهُ تَائِبُونَ عَابِدُونَ، لِرَبِّنَا حَامِدُونَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yahya bin Hassan, telah menceritakan kepada kami Hammad bin Salamah, daripada Abu Zubair, daripada Ali bin Abdullah al-Bariqi, daripada Abdullah bin Umar RA: Sesungguhnya Nabi SAW apabila pulang dari musafir, baginda bersabda: \"Kami kembali (kepada Allah), insyaAllah. Kami bertaubat, kami beribadah, dan kepada Tuhan kami, kami memuji.\""
  },
  {
    "id": 39488,
    "hadith_number": 1951,
    "tajuk_hadith": "Doa Sebelum Tidur",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا شُعْبَةُ  ، قَالَ : حَدَّثَنَا أَبُو إِسْحَاق  ، قَالَ : سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ  ، يَقُولُ : إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ رَجُلًا إِذَا أَخَذَ مَضْجَعَهُ أَنْ يَقُولَ :\" اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لَا مَلْجَأَ وَلَا مَنْجَى مِنْكَ إِلَّا إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَنَبِيِّكَ الَّذِي أَرْسَلْتَ، فَإِنْ مَاتَ، مَاتَ عَلَى الْفِطْرَةِ \"",
    "malay_translation": "Abu al-Walid memberitahu kami, Syu'bah menceritakan kepada kami, katanya: Abu Ishaq menceritakan kepada kami, katanya: Saya mendengar al-Bara' bin 'Azib berkata: Sesungguhnya Rasulullah SAW memerintahkan seseorang apabila dia berbaring di tempat tidurnya untuk mengucapkan: \"Ya Allah, aku menyerahkan diriku kepada-Mu, dan aku menghadapkan wajahku kepada-Mu, dan aku menyerahkan urusanku kepada-Mu, dan aku menyandarkan punggungku kepada-Mu, dengan penuh harap dan takut kepada-Mu, tidak ada tempat berlindung dan menyelamatkan diri dari-Mu kecuali kepada-Mu. Aku beriman kepada kitab-Mu yang telah Engkau turunkan, dan nabi-Mu yang telah Engkau utus. Jika dia meninggal, dia meninggal di atas fitrah.\""
  },
  {
    "id": 39489,
    "hadith_number": 1952,
    "tajuk_hadith": "Anjuran Membersihkan Tempat Tidur dan Doa Sebelum Tidur",
    "perawi_melayu": "Abu An-Nu'man",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ  ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِذَا أَوَى أَحَدُكُمْ إِلَى فِرَاشِهِ، فَلْيَنْفُضْ فِرَاشَهُ بِدَاخِلَةِ إِزَارِهِ، فَإِنَّهُ لَا يَدْرِي مَا خَلَفَهُ فِيهِ، وَلْيَقُلْ : اللَّهُمَّ بِكَ وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، اللَّهُمَّ إِنْ أَمْسَكْتَ نَفْسِي، فَاغْفِرْ لَهَا، وَإِنْ أَرْسَلْتَهَا، فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu An-Nu'man, telah menceritakan kepada kami Hammad bin Zaid, daripada Ubaidullah bin Umar, daripada Sa'id bin Abi Sa'id Al-Maqburi, daripada Abu Hurairah, dia berkata: Rasulullah SAW bersabda: \"Apabila salah seorang kamu hendak tidur di tempat tidurnya, maka hendaklah dia membersihkan tempat tidurnya dengan bahagian dalam kainnya, kerana dia tidak tahu apa yang mungkin berlaku di atasnya selepas itu. Dan hendaklah dia berkata: 'Ya Allah, dengan nama-Mu aku meletakkan lambungku dan dengan nama-Mu aku mengangkatnya. Ya Allah, jika Engkau menahan jiwaku, maka ampunilah ia, dan jika Engkau melepaskannya, maka peliharalah ia sebagaimana Engkau memelihara hamba-hamba-Mu yang soleh.'\""
  },
  {
    "id": 39490,
    "hadith_number": 1953,
    "tajuk_hadith": "Zikir Sebelum Tidur yang Diajarkan Rasulullah SAW kepada Ali dan Fatimah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا الْعَوَّامُ بْنُ حَوْشَبٍ  ، قَالَ : حَدَّثَنِي عَمْرُو بْنُ مُرَّةَ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى  ، عَنْ عَلِيٍّ  ، قَالَ : أَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى وَضَعَ قَدَمَهُ بَيْنِي وَبَيْنَ فَاطِمَةَ ، فَعَلَّمَنَا مَا نَقُولُ إِذَا أَخَذْنَا مَضَاجِعَنَا :\" ثَلَاثًا وَثَلَاثِينَ تَسْبِيحَةً، وَثَلَاثًا وَثَلَاثِينَ تَحْمِيدَةً، وَأَرْبَعًا وَثَلَاثِينَ تَكْبِيرَةً \".\nقَالَ عَلِيٌّ : فَمَا تَرَكْتُهَا بَعْدُ.\nفَقَالَ لَهُ رَجُلٌ : وَلَا لَيْلَةَ صِفِّينَ؟.\nقَالَ : وَلَا لَيْلَةَ صِفِّينَ",
    "malay_translation": "Telah meriwayatkan kepada kami Yazid bin Harun, telah meriwayatkan kepada kami Al-Awwam bin Hawshab, beliau berkata: Telah menceritakan kepadaku Amru bin Murrah, daripada Abdurrahman bin Abi Laila, daripada Ali, beliau berkata: Rasulullah SAW datang kepada kami sehingga Baginda meletakkan kaki Baginda di antara aku dan Fatimah, lalu Baginda mengajarkan kami zikir yang perlu kami ucapkan apabila hendak tidur: \"Subhanallah (33 kali), Alhamdulillah (33 kali), dan Allahu Akbar (34 kali).\" Ali berkata: Aku tidak pernah meninggalkannya sejak itu. Kemudian seorang lelaki bertanya kepadanya: Tidak juga pada malam perang Siffin?. Beliau menjawab: Tidak juga pada malam perang Siffin."
  },
  {
    "id": 39491,
    "hadith_number": 1954,
    "tajuk_hadith": "Doa Apabila Bangun Tidur",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ  ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ  ، عَنْ حُذَيْفَةَ  ، قَالَ : كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَيْقَظَ.\nقَالَ :\" الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا، وَإِلَيْهِ النُّشُورُ \"",
    "malay_translation": "Muhammad bin Yusuf telah memberitahu kami, daripada Sufyan, daripada Abdul Malik bin Umair, daripada Rib'i bin Hirash, daripada Hudhayfah, dia berkata: Adalah Nabi ﷺ apabila baginda bangun tidur.\nBaginda bersabda: \"Alhamdulillah yang telah menghidupkan kami setelah mematikan kami, dan kepada-Nya tempat kembali.\""
  },
  {
    "id": 39492,
    "hadith_number": 1955,
    "tajuk_hadith": "Doa Ketika Terjaga Malam",
    "perawi_melayu": "Muhammad bin Yazid al-Hizami, al-Walid bin Muslim, al-Awza'i, Umair bin Hani' al-'Ansi, Junadah bin Abi Umayyah, Ubadah bin as-Samit",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَزِيدَ الْحِزَامِيُّ  ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ  ، حَدَّثَنَا الْأَوْزَاعِيُّ  ، قَالَ : حَدَّثَنِي عُمَيْرُ بْنُ هَانِئٍ الْعَنْسِيُّ  ، قَالَ : حَدَّثَنِي جُنَادَةُ بْنُ أَبِي أُمَيَّةَ  ، قَالَ : حَدَّثَنِي عُبَادَةُ بْنُ الصَّامِتِ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنْ تَعَارَّ مِنَ اللَّيْلِ، فَقَالَ : لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، سُبْحَانَ اللَّهِ، وَالْحَمْدُ لِلَّهِ، وَاللَّهُ أَكْبَرُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ \".\nثُمَّ قَالَ : \" رَبِّ اغْفِرْ لِي أَوْ قَالَ : ثُمَّ دَعَا اسْتُجِيبَ لَهُ فَإِنْ عَزَمَ فَتَوَضَّأَ ثُمَّ صَلَّى قُبِلَتْ صَلَاتُهُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Yazid al-Hizami, telah menceritakan kepada kami al-Walid bin Muslim, telah menceritakan kepada kami al-Awza'i, dia berkata: Telah menceritakan kepadaku Umair bin Hani' al-'Ansi, dia berkata: Telah menceritakan kepadaku Junadah bin Abi Umayyah, dia berkata: Telah menceritakan kepadaku Ubadah bin as-Samit, daripada Nabi ﷺ, Baginda bersabda: \"Sesiapa yang terjaga dari tidur pada waktu malam, lalu dia berkata: 'Tiada Tuhan yang berhak disembah melainkan Allah, Yang Maha Esa, tiada sekutu bagi-Nya, bagi-Nya kerajaan dan bagi-Nya segala pujian, dan Dia Maha Kuasa atas segala sesuatu. Maha Suci Allah, segala puji bagi Allah, Allah Maha Besar, dan tiada daya dan tiada kekuatan kecuali dengan Allah.' Kemudian Baginda bersabda: 'Ya Tuhanku, ampunilah aku,' atau Baginda bersabda: 'Kemudian dia berdoa, doanya akan dikabulkan. Sekiranya dia berazam lalu berwuduk kemudian solat, solatnya akan diterima.'\""
  },
  {
    "id": 39493,
    "hadith_number": 1956,
    "tajuk_hadith": "Doa Pagi Nabi: Fitrah Islam dan Kalimat Ikhlas",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى  ، عَنْ أَبِيهِ  ، قَالَ : كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَصْبَحَ.\nقَالَ :\" أَصْبَحْنَا عَلَى فِطْرَةِ الْإِسْلَامِ، وَكَلِمَةِ الْإِخْلَاصِ، وَدِينِ نَبِيِّنَا مُحَمَّدٍ، وَمِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا \"",
    "malay_translation": "Muhammad bin Yusuf memberitahu kami, daripada Sufyan, daripada Salamah bin Kuhail, daripada Abdullah bin Abdul Rahman bin Abza, daripada bapanya, dia berkata: Adalah Nabi ﷺ apabila Subuh.\nBaginda bersabda: \"Kami berpagi hari di atas fitrah Islam, dan kalimat ikhlas, dan agama Nabi kami Muhammad, dan agama bapa kami Ibrahim, seorang yang hanif, Muslim.\""
  },
  {
    "id": 39494,
    "hadith_number": 1957,
    "tajuk_hadith": "Doa Pagi dan Petang yang Diajarkan Rasulullah kepada Abu Bakar As-Siddiq",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ  ، عَنْ شُعْبَةَ  ، عَنْ يَعْلَى بْنِ عَطَاءٍ  ، عَنْ عَمْرِو بْنِ عَاصِمٍ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ أَبُو بَكْرٍ : يَا رَسُولَ اللَّهِ، مُرْنِي بِشَيْءٍ أَقُولُهُ إِذَا أَصْبَحْتُ وَإِذَا أَمْسَيْتُ.\nقَالَ :\" قُلْ : اللَّهُمَّ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ \".\n قَالَ : \" قُلْهُ إِذَا أَصْبَحْتَ وَإِذَا أَمْسَيْتَ، وَإِذَا أَخَذْتَ مَضْجَعَكَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Sa'id bin Amir, daripada Syu'bah, daripada Ya'la bin Ata', daripada Amru bin Asim, daripada Abu Hurairah, beliau berkata: Abu Bakar berkata: \"Wahai Rasulullah, perintahkanlah aku dengan sesuatu doa yang boleh aku ucapkan apabila aku masuk waktu pagi dan apabila aku masuk waktu petang.\" Baginda bersabda: \"Ucapkanlah: Ya Allah, Pencipta langit dan bumi, Yang Mengetahui perkara ghaib dan perkara nyata, Tuhan segala sesuatu dan Pemiliknya, aku bersaksi bahawa tiada Tuhan melainkan Engkau, aku berlindung kepada-Mu daripada kejahatan diriku, dan daripada kejahatan syaitan dan kesyirikannya.\" Baginda bersabda: \"Ucapkanlah doa ini apabila kamu masuk waktu pagi dan apabila kamu masuk waktu petang, dan apabila kamu hendak tidur.\""
  },
  {
    "id": 39495,
    "hadith_number": 1958,
    "tajuk_hadith": "Keutamaan Mengucapkan Alhamdulillah Ketika Memakai Pakaian",
    "perawi_melayu": "Abdullah bin Yazid al-Muqri', Sa'id (Ibnu Abi Ayyub), Abi Marhum, Sahl bin Mu'adh bin Anas, daripada ayahnya",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ  ، حَدَّثَنَا سَعِيدٌ هُوَ : ابْنُ أَبِي أَيُّوبَ  ، عَنْ أَبِي مَرْحُومٍ  ، عَنْ سَهْلِ بْنِ مُعَاذِ بْنِ أَنَسٍ  ، عَنْ أَبِيهِ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَنْ لَبِسَ ثَوْبًا، فَقَالَ : الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي هَذَا وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ، غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abdullah bin Yazid al-Muqri', telah menceritakan kepada kami Sa'id, iaitu Ibnu Abi Ayyub, daripada Abi Marhum, daripada Sahl bin Mu'adh bin Anas, daripada ayahnya, beliau berkata: Rasulullah SAW bersabda: 'Barangsiapa memakai pakaian lalu mengucapkan: 'Alhamdulillah yang telah memakaikan aku pakaian ini dan merezekikan kepadaku tanpa daya dan kekuatan dariku,' nescaya diampuni dosa-dosanya yang telah lalu.'"
  },
  {
    "id": 39496,
    "hadith_number": 1959,
    "tajuk_hadith": "Doa Ketika Masuk dan Keluar Masjid",
    "perawi_melayu": "Abdullah bin Maslamah, Sulaiman Ibnu Bilal, Rabi'ah, Abdul Malik bin Sa'id, Abu Humaid atau Abu Usaid",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ  ، حَدَّثَنَا سُلَيْمَانُ يَعْنِي : ابْنَ بِلَالٍ  ، عَنْ رَبِيعَةَ  ، عَنْ عَبْدِ الْمَلِكِ بْنِ سَعِيدٍ  ، عَنْ أَبِي حُمَيْدٍ  أَوْ أَبِي أُسَيْدٍ   قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِذَا دَخَلَ أَحَدُكُمْ الْمَسْجِدَ، فَلْيَقُلْ : اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ، وَإِذَا خَرَجَ، فَلْيَقُلْ : اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abdullah bin Maslamah, telah menceritakan kepada kami Sulaiman iaitu Ibnu Bilal, daripada Rabi'ah, daripada Abdul Malik bin Sa'id, daripada Abu Humaid atau Abu Usaid, beliau berkata: Rasulullah ﷺ bersabda: \"Apabila salah seorang daripada kamu masuk masjid, maka hendaklah dia berkata: 'Ya Allah, bukakanlah bagiku pintu-pintu rahmat-Mu.' Dan apabila dia keluar, maka hendaklah dia berkata: 'Ya Allah, sesungguhnya aku memohon kepada-Mu daripada kurniaan-Mu.'\""
  },
  {
    "id": 39497,
    "hadith_number": 1960,
    "tajuk_hadith": "Keutamaan Mengucapkan Zikir di Pasar",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا أَزْهَرُ بْنُ سِنَانٍ  ، عَنْ مُحَمَّدِ بْنِ وَاسِعٍ  ، قَالَ : قَدِمْتُ مَكَّةَ فَلَقِيتُ بِهَا أَخِي سَالِمَ بْنَ عَبْدِ اللَّهِ  فَحَدَّثَنِي، عَنْ أَبِيهِ  ، عَنْ جَدِّهِ   : أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنْ دَخَلَ السُّوقَ، فَقَالَ : لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، يُحْيِي وَيُمِيتُ، وَهُوَ حَيٌّ لَا يَمُوتُ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، كَتَبَ اللَّهُ لَهُ أَلْفَ أَلْفِ حَسَنَةٍ، وَمَحَا عَنْهُ أَلْفَ أَلْفِ سَيِّئَةٍ، وَرَفَعَ لَهُ أَلْفَ أَلْفِ دَرَجَةٍ \".\nقَالَ : فَقَدِمْتُ خُرَاسَانَ فَلَقِيتُ قُتَيْبَةَ بْنَ مُسْلِمٍ، فَقُلْتُ : إِنِّي أَتَيْتُكَ بِهَدِيَّةٍ، فَحَدَّثْتُهُ، فَكَانَ يَرْكَبُ فِي مَوْكِبِهِ فَيَأْتِي السُّوقَ، فَيَقُومُ، فَيَقُولُهَا ثُمَّ يَرْجِعُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah mengkhabarkan kepada kami Azhar bin Sinan, daripada Muhammad bin Wasi', beliau berkata: Saya tiba di Makkah dan bertemu dengan saudara saya Salim bin Abdullah di sana. Beliau kemudian menceritakan kepada saya, daripada ayahnya, daripada datuknya: Sesungguhnya Nabi Muhammad Sallallahu Alaihi Wasallam, bersabda: \"Sesiapa yang memasuki pasar, lalu mengucapkan: Tiada Tuhan melainkan Allah, Yang Maha Esa, tiada sekutu bagi-Nya, bagi-Nya kerajaan dan bagi-Nya pujian, Dia menghidupkan dan mematikan, dan Dia Maha Hidup tidak akan mati, di tangan-Nya segala kebaikan, dan Dia Maha Kuasa atas segala sesuatu, Allah akan menulis baginya seribu ribu kebaikan, menghapuskan darinya seribu ribu keburukan, dan mengangkat baginya seribu ribu darjat.\"\nBeliau berkata lagi: Kemudian saya tiba di Khurasan dan bertemu dengan Qutaibah bin Muslim. Saya berkata: Sesungguhnya saya datang membawa hadiah untukmu. Lalu saya menceritakan hadis ini kepadanya. Maka beliau (Qutaibah) ketika menunggang dalam perarakan baginda, akan datang ke pasar, berdiri, dan mengucapkan zikir ini, kemudian kembali."
  },
  {
    "id": 39498,
    "hadith_number": 1961,
    "tajuk_hadith": "Larangan Menggunakan Kunyah Nabi Muhammad SAW dan Kebenaran Memberi Nama dengan Nama Baginda",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ  ، عَنْ هِشَامٍ  ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" تَسَمُّوا بِاسْمِي وَلَا تَكَنَّوْا بِكُنْيَتِي \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Sa'id bin 'Amir, daripada Hisham, daripada Muhammad bin Sirin, daripada Abu Hurairah, dia berkata: Rasulullah SAW bersabda: \"Berilah nama dengan namaKu dan janganlah kamu menggunakan kunyahKu.\""
  },
  {
    "id": 39499,
    "hadith_number": 1962,
    "tajuk_hadith": "Keutamaan Memperbaiki Nama",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ  ، حَدَّثَنَا هُشَيْمٌ  ، أَخْبَرَنَا دَاوُدُ بْنُ عَمْرٍو  ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي زَكَرِيَّا الْخُزَاعِيِّ  ، عَنْ أَبِي الدَّرْدَاءِ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِنَّكُمْ تُدْعَوْنَ يَوْمَ الْقِيَامَةِ بِأَسْمَائِكُمْ وَأَسْمَاءِ آبَائِكُمْ، فَأَحْسِنُوا أَسْمَاءَكُمْ \"",
    "malay_translation": "Telah menceritakan kepada kami Affan bin Muslim, telah menceritakan kepada kami Husyaim, telah mengkhabarkan kepada kami Daud bin 'Amr, daripada Abdullah bin Abi Zakaria al-Khuza'i, daripada Abu Darda', dia berkata: Rasulullah SAW bersabda: \"Sesungguhnya kamu akan dipanggil pada hari kiamat dengan nama-nama kamu dan nama-nama bapa kamu, maka perbaikilah nama-nama kamu.\""
  },
  {
    "id": 39500,
    "hadith_number": 1963,
    "tajuk_hadith": "Nama-nama yang Paling Disukai Allah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ كَثِيرٍ  ، أَخْبَرَنَا عَبَيْدُ اللَّهِ بْنُ عُمَرَ  ، عَنْ نَافِعٍ  ، عَنِ ابْنِ عُمَرَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" أَحَبُّ الْأَسْمَاءِ إِلَى اللَّهِ : عَبْدُ اللَّهِ، وَعَبْدُ الرَّحْمَنِ \"",
    "malay_translation": "Muhammad bin Kathir memberitahu kami, Ubaidillah bin Umar memberitahu kami, daripada Nafi', daripada Ibn Umar, dia berkata: Rasulullah SAW bersabda: \"Nama-nama yang paling disukai oleh Allah ialah Abdullah dan Abdurrahman.\""
  },
  {
    "id": 39501,
    "hadith_number": 1964,
    "tajuk_hadith": "Larangan Menamai Hamba dengan Empat Nama: Aflah, Nafi', Rabah, dan Yasar",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا زَكَرِيَّا بْنُ عَدِيٍّ  ، حَدَّثَنَا مُعْتَمِرٌ  ، عَنْ الرُّكَيْنِ  ، عَنْ أَبِيهِ  ،  عَنْ سَمُرَةَ   : أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \" نَهَى أَنْنُسَمِّيَ أَرِقَّاءَنَا أَرْبَعَةَ أَسْمَاءٍ : أَفْلَحُ، وَنَافِعٌ، وَرَبَاحٌ، وَيَسَارٌ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Zakaria bin Adiy, telah menceritakan kepada kami Mu'tamir, daripada ar-Rukin, daripada bapanya, daripada Samurah RA: Bahawa Nabi SAW melarang kita daripada menamakan hamba-hamba kita dengan empat nama: Aflah, Nafi', Rabah, dan Yasar."
  },
  {
    "id": 39502,
    "hadith_number": 1965,
    "tajuk_hadith": "Nabi Muhammad SAW Menukar Nama 'Asiyah kepada Jamilah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ  ، حَدَّثَنَا حَمَّادٌ هُوَ : ابْنُ سَلَمَةَ  ، عَنْ عُبَيْدِ اللَّهِ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ   : أَنَّ أُمَّ عَاصِمٍ كَانَ يُقَالُ لَهَا عَاصِيَةُ ،\" فَسَمَّاهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمِيلَةَ \"",
    "malay_translation": "Telah menceritakan kepada kami Hajjaj bin Minhal, telah menceritakan kepada kami Hammad iaitu Ibnu Salamah, daripada Ubaidullah, daripada Nafi', daripada Ibnu Umar: Bahawa Ummu Asim dahulunya dipanggil 'Asiyah (wanita yang derhaka), lalu Nabi SAW menamakannya Jamilah (wanita yang cantik)."
  },
  {
    "id": 39503,
    "hadith_number": 1966,
    "tajuk_hadith": "Penukaran Nama Barrah kepada Zainab oleh Nabi ﷺ",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ  ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ  ، حَدَّثَنَا شُعْبَةُ  ، حَدَّثَنَا عَطَاءُ بْنُ أَبِي مَيْمُونَةَ  ، عَنْ أَبِي رَافِعٍ  ،  عَنْ أَبِي هُرَيْرَةَ  ، قالَ : كَانَ اسْمُ زَيْنَبَ ، بَرَّةَ ،\" فَسَمَّاهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَيْنَبَ \"",
    "malay_translation": "Telah menceritakan kepada kami Musaddad, telah menceritakan kepada kami Yahya bin Sa'id, telah menceritakan kepada kami Syu'bah, telah menceritakan kepada kami 'Ata' bin Abi Maimunah, dari Abu Rafi', dari Abu Hurairah, dia berkata: Nama Zainab adalah Barrah, lalu Nabi ﷺ menamakannya Zainab."
  },
  {
    "id": 39504,
    "hadith_number": 1967,
    "tajuk_hadith": "Larangan Menggabungkan Kehendak Allah dan Muhammad SAW dalam Ucapan",
    "perawi_melayu": "Yazid bin Harun, Syu'bah, Abdul Malik bin Umair, Rib'i bin Hirash, at-Tufail, saudara lelaki Aisyah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا شُعْبَةُ  ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ  ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ  ، عَنِ الطُّفَيْلِ   أَخِي عَائِشَةَ ، قَالَ : قَالَ رَجُلٌ مِنَ الْمُشْرِكِينَ لِرَجُلٍ مِنَ الْمُسْلِمِينَ : نِعْمَ الْقَوْمُ أَنْتُمْ لَوْلَا أَنَّكُمْ تَقُولُونَ : مَا شَاءَ اللَّهُ، وَشَاءَ مُحَمَّدٌ .\nفَسَمِعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ :\" لَا تَقُولُوا : مَا شَاءَ اللَّهُ وَشَاءَ مُحَمَّدٌ ، وَلَكِنْ، قُولُوا : مَا شَاءَ اللَّهُ، ثُمَّ شَاءَ مُحَمَّدٌ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah mengkhabarkan kepada kami Syu'bah, daripada Abdul Malik bin Umair, daripada Rib'i bin Hirash, daripada at-Tufail, saudara lelaki Aisyah, beliau berkata: Seorang lelaki musyrik berkata kepada seorang lelaki Muslim: \"Sebaik-baik kaum adalah kamu, kalaulah kamu tidak mengatakan: 'Apa yang Allah kehendaki, dan apa yang Muhammad kehendaki.'\" Maka Nabi SAW mendengar (perkataan itu) lalu bersabda: \"Janganlah kamu berkata: 'Apa yang Allah kehendaki dan apa yang Muhammad kehendaki,' tetapi katakanlah: 'Apa yang Allah kehendaki, kemudian apa yang Muhammad kehendaki.'\""
  },
  {
    "id": 39505,
    "hadith_number": 1968,
    "tajuk_hadith": "Larangan Memanggil Kebun Anggur dengan 'Al-Karm' dan Makna 'Al-Karm' Sebenar",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا مُحَمَّدٌ هُوَ : ابْنُ إِسْحَاق  ، عَنْ صَالِحِ بْنِ إِبْرَاهِيمَ  ، عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَا تَقُولُوا لِحَائِطِ الْعِنَبِ الْكَرْمُ، إِنَّمَا الْكَرْمُ الرَّجُلُ الْمُسْلِمُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah mengkhabarkan kepada kami Muhammad iaitu Ibnu Ishaq, daripada Soleh bin Ibrahim, daripada Abdul Rahman al-A'raj, daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: \"Janganlah kamu mengatakan bagi kebun anggur itu 'al-Karm', sesungguhnya 'al-Karm' itu adalah lelaki Muslim.\""
  },
  {
    "id": 39506,
    "hadith_number": 1969,
    "tajuk_hadith": "Perintah Nabi SAW kepada Anjashah untuk Memandu Tunggangan dengan Perlahan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو عَاصِمٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدٍ L5403 ، عَنِ أَنَسٍ  ، قَالَ : كَانَ غُلَامٌ يَسُوقُ بِأَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ :\" يَا أَنْجَشَةُ، رُوَيْدًا سَوْقَكَ بِالْقَوَارِيرِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Asim, daripada Abdullah bin Ubaid, daripada Anas RA, beliau berkata: Ada seorang budak lelaki yang memandu tunggangan isteri-isteri Nabi SAW. Maka Baginda bersabda: \"Wahai Anjashah, perlahanlah dalam memandu tunggangan yang membawa kaca-kaca ini (isteri-isteri Nabi SAW).\""
  },
  {
    "id": 39507,
    "hadith_number": 1970,
    "tajuk_hadith": "Larangan Berdusta Untuk Membuat Orang Ramai Ketawa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا بَهْزُ بْنُ حَكِيمٍ  ، عَنْ أَبِيهِ  ، عَنْ جَدِّهِ  ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" وَيْلٌ لِلَّذِي يُحَدِّثُ فَيَكْذِبُ لِيُضْحِكَ بِهِ الْقَوْمَ، وَيْلٌ لَهُ ! وَيْلٌ لَهُ ! \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah mengkhabarkan kepada kami Bahz bin Hakim, daripada ayahnya, daripada datuknya, dia berkata: Aku mendengar Rasulullah SAW bersabda: \"Celakalah bagi orang yang bercerita lalu berdusta untuk membuat orang ramai ketawa. Celakalah dia! Celakalah dia!\""
  },
  {
    "id": 39508,
    "hadith_number": 1971,
    "tajuk_hadith": "Pengesahan Nabi SAW terhadap Syair Umayyah bin Abi Salt",
    "perawi_melayu": "Ibnu Abbas",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى  ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ  ، عَنْ مُحَمَّدِ بْنِ إِسْحَاق  ، عَنْ يَعْقُوبَ بْنِ عُتْبَةَ  ، عَنْ عِكْرِمَةَ  ، عَنِ ابْنِ عَبَّاسٍ  ، قَالَ :صَدَّقَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُمَيَّةَ بْنَ أَبِي الصَّلْتِ فِي بَيْتَيْنِ مِنْ الشِّعْرِ، فَقَالَ : رَجُلٌ وَثَوْرٌ تَحْتَ رِجْلِ يَمِينِهِ وَالنَّسْرُ لِلْأُخْرَى وَلَيْثٌ مُرْصَدُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" صَدَقَ \".\nقَالَ : وَالشَّمْسُ تَطْلُعُ كُلَّ آخِرِ لَيْلَةٍ حَمْرَاءَ يُصْبِحُ لَوْنُهَا يَتَوَرَّدُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" صَدَقَ \".\nفَقَالَ قَائِلٌ : تَأْبَى فَمَا تَطْلُعُ لَنَا فِي رِسْلِهَا إِلَّا مُعَذَّبَةً وَإِلَّا تُجْلَدُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" صَدَقَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Isa, telah menceritakan kepada kami 'Abdah bin Sulaiman, daripada Muhammad bin Ishaq, daripada Ya'qub bin 'Utbah, daripada 'Ikrimah, daripada Ibnu Abbas, dia berkata: Nabi SAW membenarkan Umayyah bin Abi Salt dalam dua bait syair, lalu dia berkata: \"Seorang lelaki dan seekor lembu di bawah kaki kanannya, dan seekor helang untuk yang lain, dan seekor singa sedang mengintai.\" Maka Nabi SAW bersabda: \"Benar.\" Dia berkata: \"Dan matahari terbit setiap akhir malam merah, warnanya menjadi merah jambu.\" Maka Nabi SAW bersabda: \"Benar.\" Maka seorang berkata: \"Ia enggan, maka ia tidak terbit kepada kita dalam perjalanannya kecuali diseksa dan kecuali dicambuk.\" Maka Nabi SAW bersabda: \"Benar.\""
  },
  {
    "id": 39509,
    "hadith_number": 1972,
    "tajuk_hadith": "Hikmah dalam Syair",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ ابْنِ جُرَيْجٍ  ، عَنْ زِيَادٍ هُوَ : ابْنُ سَعْدٍ  ، قَالَ : أَخْبَرَنِي أَنَّ ابْنَ شِهَابٍ  ، أَخْبَرَهُ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ هِشَامٍ  ، عَنْ مَرْوَانَ بْنِ الْحَكَمِ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ بْنِ عَبْدِ يَغُوثَ  ، عَنْ أُبَيِّ بْنِ كَعْبٍ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" إِنَّ مِنَ الشِّعْرِ حِكْمَةً \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Asim, daripada Ibn Juraij, daripada Ziyad iaitu Ibn Sa'd, dia berkata: Telah mengkhabarkan kepadaku bahawa Ibn Shihab telah mengkhabarkannya daripada Abu Bakr bin Abdurrahman bin Hisham, daripada Marwan bin al-Hakam, daripada Abdurrahman bin al-Aswad bin Abdi Yaghuth, daripada Ubay bin Ka'b, daripada Nabi صلى الله عليه وسلم, baginda bersabda: \"Sesungguhnya sebahagian daripada syair itu adalah hikmah.\""
  },
  {
    "id": 39510,
    "hadith_number": 1973,
    "tajuk_hadith": "Lebih Baik Perut Dipenuhi Nanah Daripada Syair",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، حَدَّثَنَا حَنْظَلَةُ  ، عَنْ سَالِمٍ  عَنِ ابْنِ عُمَرَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :أَنْ يَمْتَلِئَ جَوْفُ أَحَدِكُمْ قَيْحًا أَوْ دَمًا خَيْرٌ مِنْ أَنْ يَمْتَلِئَ شِعْرًا \"",
    "malay_translation": "Ubaidullah bin Musa memberitahu kami, Hanzalah menceritakan kepada kami, daripada Salim, daripada Ibn Umar, dia berkata: Rasulullah SAW bersabda: 'Bahawa perut salah seorang kamu dipenuhi nanah atau darah adalah lebih baik daripada dipenuhi dengan syair.'"
  }
]
