[
  {
    "id": 39162,
    "hadith_number": 1625,
    "tajuk_hadith": "Pilihan bagi Mangsa Kecederaan atau Pembunuhan",
    "perawi_melayu": "Yazid bin Harun, Muhammad bin Ishaq, al-Harith bin Fudail, Sufyan bin Abi al-'Awja' as-Sulami, Abi Shuraih al-Khuza'i",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْحَاق  ، عَنْ الْحَارِثِ بْنِ فُضَيْلٍ  ، عَنْ سُفْيَانَ بْنِ أَبِي الْعَوْجَاءِ السُّلَمِيِّ  ، عَنْ أَبِي شُرَيْحٍ الْخُزَاعِيِّ  ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" مَنْ أُصِيبَ بِدَمٍ أَوْ خَبْلٍ وَالْخَبْلُ : الْجُرْحُ فَهُوَ بِالْخِيَارِ بَيْنَ إِحْدَى ثَلَاثٍ : فَإِنْ أَرَادَ الرَّابِعَةَ، فَخُذُوا عَلَى يَدَيْهِ : بَيْنَ أَنْ يَقْتَصَّ أَوْ يَعْفُوَ، أَوْ يَأْخُذَ الْعَقْلَ فَإِنْ أَخَذَ مِنْ ذَلِكَ شَيْئًا ثُمَّ عَدَا بَعْدَ ذَلِكَ، فَلَهُ النَّارُ خَالِدًا فِيهَا مُخَلَّدًا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah mengkhabarkan kepada kami Muhammad bin Ishaq, daripada al-Harith bin Fudail, daripada Sufyan bin Abi al-'Awja' as-Sulami, daripada Abi Shuraih al-Khuza'i, dia berkata: Aku mendengar Rasulullah SAW bersabda: \"Sesiapa yang ditimpa dengan darah atau *khabl* (kecacatan/kecederaan), dan *khabl* itu adalah luka, maka dia mempunyai pilihan antara salah satu daripada tiga perkara: Jika dia mahukan yang keempat, maka tahanlah tangannya: sama ada dia membalas (*qisas*), atau memaafkan, atau mengambil *aqal* (diyat - pampasan). Jika dia mengambil sesuatu daripada itu, kemudian dia melampaui batas selepas itu, maka baginya neraka, kekal di dalamnya selama-lamanya.\""
  },
  {
    "id": 39163,
    "hadith_number": 1626,
    "tajuk_hadith": "Hukuman Qisas bagi Pembunuhan Sengaja",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ مُوسَى  ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ  ، عَنْ سُلَيْمَانَ بْنِ دَاوُدَ  ، حَدَّثَنِي الزُّهْرِيُّ  ، عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ  ، عَنْ أَبِيهِ  ، عَنْ جَدِّهِ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى أَهْلِ الْيَمَنِ ، وَكَانَ فِي كِتَابِهِ :\" أَنَّ مَنْ اعْتَبَطَ مُؤْمِنًا قَتْلًا عَنْ بَيِّنَةٍ فَإِنَّهُ قَوَدُ يَديِهِ إِلَّا أَنْ يَرْضَى أَوْلِيَاءُ الْمَقْتُولِ \".\n قَالَ أَبُو مُحَمَّدٍ : اعْتَبَطَ : قَتَلَ مِنْ غَيْرِ عِلَّةٍ",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Hakam bin Musa, telah menceritakan kepada kami Yahya bin Hamzah, daripada Sulaiman bin Daud, telah menceritakan kepadaku az-Zuhri, daripada Abu Bakar bin Muhammad bin Amru bin Hazm, daripada ayahnya, daripada datuknya: Bahawa Rasulullah SAW telah menulis surat kepada penduduk Yaman, dan di dalam suratnya itu ada tertulis: \"Sesiapa yang membunuh seorang mukmin dengan sengaja dan dengan bukti yang jelas, maka dia dikenakan qisas, kecuali jika waris mangsa memaafkan.\" Abu Muhammad berkata: 'I'tabata' bermaksud: membunuh tanpa alasan."
  },
  {
    "id": 39164,
    "hadith_number": 1627,
    "tajuk_hadith": "Kisah Pembunuhan Abdullah bin Sahl di Khaibar dan Pembayaran Diyat oleh Rasulullah",
    "perawi_melayu": "Sahal bin Abi Hathmah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ  ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ  ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاق  ، حَدَّثَنَا بُشَيْرُ بْنُ يَسَارٍ  ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ  ، قَالَ : خَرَجَ عَبْدُ اللَّهِ بْنُ سَهْلِ بْنِ أَبي حَثْمَةَ أَحَدُ بَنِي حَارِثَةَ إِلَى خَيْبَرَ مَعَ نَفَرٍ مِنْ قَوْمِهِ يُرِيدُونَ الْمِيرَةَ بِخَيْبَرَ ، قَالَ : فَعُدِيَ عَلَى عَبْدِ اللَّهِ، فَقُتِلَ : فَتُلَّتْ عُنُقُهُ حَتَّى نُخَعَ ثُمَّ طُرِحَ فِي مَنْهَلٍ مِنْ مَنَاهِلِ خَيْبَرَ ، فَاسْتُصْرِخَ عَلَيْهِ أَصْحَابُهُ، فَاسْتَخْرَجُوهُ فَغَيَّبُوهُ، ثُمَّ قَدِمُوا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ ، فَتَقَدَّمَ أَخُوهُ عَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ وَكَانَ ذَا قِدَمٍ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَابْنَا عَمِّهِ مَعَهُ : حُوَيِّصَةُ بْنُ مَسْعُودٍ وَمُحَيِّصَةُ، فَتَكَلَّمَ عَبْدُ الرَّحْمَنِ وَكَانَ أَحْدَثَهُمْ سِنًّا، وَهُوَ صَاحِبُ الدَّمِ وَذَا قَدَمٍ فِي الْقَوْمِ فَلَمَّا تَكَلَّمَ، قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" الْكُبْرَ الْكُبْرَ \".\nقَالَ : فَاسْتَأْخَرَ فَتَكَلَّمَ حُوَيِّصَةُ وَمُحَيِّصَةُ، ثُمَّ هُوَ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" تُسَمُّونَ قَاتِلَكُمْ، ثُمَّ تَحْلِفُونَ عَلَيْهِ خَمْسِينَ يَمِينًا، ثُمَّ نُسَلِّمُهُ إِلَيْكُمْ \".\nقَالُوا : يَا رَسُولَ اللَّهِ، مَا كُنَّا لِنَحْلِفَ عَلَى مَا لَا نَعْلَمُ، مَا نَدْرِي مَنْ قَتَلَهُ، إِلَّا أَنَّ اليَهُودَ عَدُوُّنَا، وَبَيْنَ أَظْهُرِهِمْ قُتِلَ.\nقَالَ : \" فَيَحْلِفُونَ لَكُمْ بِاللَّهِ إِنَّهُمْ لَبُرَاءُ مِنْ دَمِ صَاحِبِكُمْ، ثُمَّ يَبْرَءُونَ مِنْهُ \".\nقَالُوا : مَا كُنَّا لِنَقْبَلَ أَيْمَانَ يَهُودَ، مَا فِيهِمْ أَكْثَرُ مِنْ أَنْ يَحْلِفُوا عَلَى إِثْمٍ.\nقَالَ : فَوَدَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عِنْدِهِ بِمِائَةِ نَاقَةٍ",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Abdullah ar-Raqasyi, telah menceritakan kepada kami Yazid bin Zurai', telah menceritakan kepada kami Muhammad bin Ishaq, telah menceritakan kepada kami Basyir bin Yasar, dari Sahal bin Abi Hathmah, dia berkata: Abdullah bin Sahl bin Abi Hathmah, salah seorang dari Bani Harithah, keluar menuju Khaibar bersama beberapa orang dari kaumnya untuk mencari makanan di Khaibar. Dia berkata: Abdullah diserang dan dibunuh: lehernya dipukul hingga sumsum tulang belakangnya putus, kemudian dilemparkan ke dalam sebuah telaga di antara telaga-telaga Khaibar. Sahabat-sahabatnya meminta pertolongan atasnya, lalu mereka mengeluarkannya dan menguburkannya. Kemudian mereka datang kepada Rasulullah صلى الله عليه وسلم di Madinah. Maka saudaranya, Abdurrahman bin Sahl, yang memiliki kedudukan di sisi Rasulullah صلى الله عليه وسلم, dan dua orang anak pamannya bersamanya: Huwaishah bin Mas'ud dan Muhayyishah, maju. Abdurrahman berbicara, dan dia adalah yang termuda usianya, dan dia adalah pemilik darah (keluarga korban) dan memiliki kedudukan di kaumnya. Ketika dia berbicara, Rasulullah صلى الله عليه وسلم bersabda: \"Yang lebih tua, yang lebih tua.\" Dia berkata: Lalu dia mundur, lalu Huwaishah dan Muhayyishah berbicara, kemudian dia. Rasulullah صلى الله عليه وسلم bersabda: \"Apakah kamu menyebutkan pembunuhmu, kemudian kamu bersumpah atasnya lima puluh sumpah, kemudian kami menyerahkannya kepada kamu?\" Mereka berkata: Wahai Rasulullah, kami tidak akan bersumpah atas apa yang tidak kami ketahui, kami tidak tahu siapa yang membunuhnya, kecuali bahwa Yahudi adalah musuh kami, dan di tengah-tengah mereka dia dibunuh. Beliau bersabda: \"Maka mereka bersumpah kepada kamu dengan nama Allah bahwa mereka berlepas diri dari darah sahabatmu, kemudian mereka bebas darinya.\" Mereka berkata: Kami tidak akan menerima sumpah Yahudi, tidak ada di antara mereka yang lebih banyak daripada bersumpah atas dosa. Dia berkata: Maka Rasulullah صلى الله عليه وسلم membayar diyat (tebusan darah) untuknya dari hartanya sendiri sebanyak seratus ekor unta."
  },
  {
    "id": 39165,
    "hadith_number": 1628,
    "tajuk_hadith": "Hukum Qisas: Lelaki Dibunuh Kerana Membunuh Wanita",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ مُوسَى  ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ  ، عَنْ سُلَيْمَانَ بْنِ دَاوُدَ  ، حَدَّثَنِي الزُّهْرِيُّ  ، عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ  ، عَنْ أَبِيهِ  ، عَنْ جَدِّهِ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى أَهْلِ الْيَمَنِ وَكَانَ فِي كِتَابِهِ :\" أَنَّ الرَّجُلَ يُقْتَلُ بِالْمَرْأَةِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Hakam bin Musa, telah menceritakan kepada kami Yahya bin Hamzah, daripada Sulaiman bin Daud, telah menceritakan kepadaku az-Zuhri, daripada Abu Bakar bin Muhammad bin Amru bin Hazm, daripada ayahnya, daripada datuknya: Bahawa Rasulullah صلى الله عليه وسلم telah menulis surat kepada penduduk Yaman dan di dalam suratnya: \"Sesungguhnya seorang lelaki dibunuh kerana (membunuh) seorang wanita.\""
  },
  {
    "id": 39166,
    "hadith_number": 1629,
    "tajuk_hadith": "Hukuman Bunuh dengan Batu bagi Pembunuh Hamba Perempuan Yahudi",
    "perawi_melayu": "Anas",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَفَّانُ  ، حَدَّثَنَا هَمَّامٌ  ، حَدَّثَنَا قَتَادَةُ  ، عَنْ أَنَسٍ   : أَنَّ جَارِيَةً رُضَّ رَأْسُهَا بَيْنَ حَجَرَيْنِ، فَقِيلَ لَهَا : مَنْ فَعَلَ بِكِ هَذَا أَفُلَانٌ، أَفُلَانٌ؟ حَتَّى سُمِّيَ الْيَهُودِيُّ، فَأَوْمَأَتْ بِرَأْسِهَا، فَبُعِثَ إِلَيْهِ فَجِيءَ بِهِ، فَاعْتَرَفَ،\" فَأَمَرَ بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرُضَّ رَأْسُهُ بَيْنَ حَجَرَيْنِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Affan, telah menceritakan kepada kami Hammam, telah menceritakan kepada kami Qatadah, daripada Anas: Bahawa seorang hamba perempuan dihancurkan kepalanya antara dua batu. Lalu dikatakan kepadanya: \"Siapa yang melakukan ini kepadamu? Adakah Fulan? Adakah Fulan?\" Sehingga disebutkan seorang Yahudi. Maka dia mengisyaratkan dengan kepalanya (mengiyakan). Lalu diutus (utusan) kepadanya (Yahudi tersebut) dan dia dibawa. Lalu dia mengaku. \"Maka Nabi صلى الله عليه وسلم memerintahkan supaya kepalanya dihancurkan antara dua batu.\""
  },
  {
    "id": 39167,
    "hadith_number": 1630,
    "tajuk_hadith": "Ilmu Wahyu dan Kandungan Sahifah Menurut Ali",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاق  ، أَخْبَرَنَا جَرِيرٌ  ، عَنْ مُطَرِّفٍ  ، عَنْ الشَّعْبِيِّ  ، عَنْ أَبِي جُحَيْفَةَ  ، قَالَ : قُلْتُ لِعَلِيٍّ   : يَا أَمِيرَ الْمُؤْمِنِينَ، هَلْ عَلِمْتَ شَيْئًا مِنَ الْوَحْيِ إِلَّا مَا فِي كِتَابِ اللَّهِ تَعَالَى؟.\nقَالَ : \" لَا وَالَّذِي فَلَقَ الْحَبَّةَ وَبَرَأَ النَّسَمَةَ،مَا أَعْلَمُهُ إِلَّا فَهْمًا يُعْطِيهِ اللَّهُ الرَّجُلَ فِي الْقُرْآنِ، وَمَا فِي الصَّحِيفَةِ \".\nقُلْتُ : وَمَا فِي الصَّحِيفَةِ؟.\nقَالَ : \" الْعَقْلُ، وَفِكَاكُ الْأَسِيرِ، وَلَا يُقْتَلُ مُسْلِمٌ بِمُشْرِكٍ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ishaq, telah mengkhabarkan kepada kami Jarir, daripada Mutarrif, daripada al-Sha'bi, daripada Abu Juhaifah, dia berkata: Aku bertanya kepada Ali: \"Wahai Amirul Mukminin, adakah kamu mengetahui sesuatu wahyu selain daripada apa yang ada dalam Kitab Allah Ta'ala?\"\nBeliau menjawab: \"Tidak, demi Zat yang membelah biji dan menciptakan jiwa, aku tidak mengetahui melainkan pemahaman yang Allah kurniakan kepada seseorang mengenai Al-Quran, dan apa yang terkandung dalam sahifah (lembaran)\".\nAku bertanya: \"Apakah yang terkandung dalam sahifah itu?\"\nBeliau menjawab: \"Akal, pembebasan tawanan, dan (ketetapan) tidak boleh dibunuh seorang Muslim kerana (membunuh) seorang musyrik.\""
  },
  {
    "id": 39168,
    "hadith_number": 1631,
    "tajuk_hadith": "Larangan Menegakkan Hukuman Hudud di Masjid dan Hukuman Mati untuk Bapa atas Anak",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا جَعْفَرُ بْنُ عَونٍ  ، عَنْ إِسْمَاعِيل بْنِ مُسْلِمٍ  ، عَنْ عَمْرِو بْنِ دِينَارٍ  ، عَنْ طَاوُسٍ  ، عَنِ ابْنِ عَبَّاسٍ  ، قَالَ : قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَا تُقَامُ الْحُدُودُ فِي الْمَسَاجِدِ، وَلَا يُقَادُ بِالْوَلَدِ الْوَالِدُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ja'far bin Aun, daripada Ismail bin Muslim, daripada Amru bin Dinar, daripada Tawus, daripada Ibn Abbas, dia berkata: Nabi SAW bersabda: \"Hukuman hudud tidak dilaksanakan di masjid, dan seorang bapa tidak dihukum mati karena (membunuh) anaknya.\""
  },
  {
    "id": 39169,
    "hadith_number": 1632,
    "tajuk_hadith": "Hukuman bagi Pembunuh Hamba dan Pemotong Anggota Badan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ  ، عَنْ شُعْبَةَ  ، عَنْ قَتَادَةَ  ، عَنْ الْحَسَنِ  ، عَنْ سَمُرَةَ بْنِ جُنْدُبٍ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ، وَمَنْ جَدَعَهُ، جَدَعْنَاهُ \".\nقَالَ : ثُمَّ نَسِيَ الْحَسَنُ هَذَا الْحَدِيثَ، وَكَانَ يَقُولُ : لَا يُقْتَلُ حُرٌّ بِعَبْدٍ",
    "malay_translation": "Telah mengkhabarkan kepada kami Sa'id bin Amir, daripada Syu'bah, daripada Qatadah, daripada al-Hasan, daripada Samurah bin Jundub: Bahawa Rasulullah SAW bersabda: \"Sesiapa yang membunuh hambanya, kami akan membunuhnya, dan sesiapa yang memotong anggota badannya, kami akan memotong anggota badannya juga.\" Dia (perawi) berkata: Kemudian al-Hasan terlupa hadis ini, dan beliau berkata: \"Orang merdeka tidak dibunuh kerana (membunuh) hamba.\""
  },
  {
    "id": 39170,
    "hadith_number": 1633,
    "tajuk_hadith": "Pilihan untuk Wali Korban Pembunuhan: Memaafkan, Menerima Diyat, atau Menuntut Hukuman Mati",
    "perawi_melayu": "Ahmad bin Abdullah Al-Hamdani, Abu Usamah, Auf, Hamzah Abu Umar, Alqamah bin Wail Al-Hadhrami, Wail bin Hujr",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ الْهَمْدَانِيُّ  ، حَدَّثَنَا أَبُو أُسَامَةَ  ، عَنْ عَوْفٍ  ، عَنْ حَمْزَةَ أَبِي عُمَرَ  ، عَنْ عَلْقَمَةَ بْنِ وَائِلٍ الْحَضْرَمِيِّ  ، عَنْ أَبِيهِ وَائِلِ بْنِ حُجْرٍ  ، قَالَ : شَهِدْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ أُتِيَ بِالرَّجُلِ الْقَاتِلِ يُقَادُ فِي نِسْعَةٍ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِوَلِيِّ الْمَقْتُولِ : \" أَتَعْفُو؟ \".\nقَالَ : لَا.\nقَالَ : \" فَتَأْخُذُ الدِّيَةَ؟ \".\nقَالَ : لَا.\nقَالَ : \" فَتَقْتُلُهُ؟ \".\nقَالَ : نَعَمْ.\nقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِنَّكَ إِنْ عَفَوْتَ عَنْهُ، فَإِنَّهُ يَبُوءُ بِإِثْمِكَ وَإِثْمِ صَاحِبِكَ \".\nقَالَ : فَتَرَكَهُ، قَالَ : فَأَنَا رَأَيْتُهُ يَجُرُّ نِسْعَتَهُ، قَدْ عَفَا عَنْهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Ahmad bin Abdullah Al-Hamdani, telah menceritakan kepada kami Abu Usamah, daripada Auf, daripada Hamzah Abu Umar, daripada Alqamah bin Wail Al-Hadhrami, daripada ayahnya Wail bin Hujr, beliau berkata: Saya menyaksikan Nabi ﷺ ketika seorang lelaki pembunuh dibawa dalam keadaan diikat dengan tali. Rasulullah ﷺ bersabda kepada wali (waris) orang yang dibunuh: \"Adakah kamu akan memaafkan?\"\nDia menjawab: \"Tidak.\"\nBaginda bersabda: \"Adakah kamu akan mengambil diyat (tebusan darah)?\"\nDia menjawab: \"Tidak.\"\nBaginda bersabda: \"Adakah kamu akan membunuhnya (sebagai balasan)?\"\nDia menjawab: \"Ya.\"\nRasulullah ﷺ bersabda: \"Sesungguhnya jika kamu memaafkannya, maka sesungguhnya dia akan kembali dengan dosa kamu dan dosa sahabatmu (orang yang dibunuhnya).\".\nBeliau berkata: Lalu dia meninggalkannya (membebaskannya). Beliau berkata: Maka saya melihatnya menarik talinya, sesungguhnya dia telah memaafkannya."
  },
  {
    "id": 39171,
    "hadith_number": 1634,
    "tajuk_hadith": "Dosa-Dosa Besar",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ  ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ فِرَاسٍ  ، عَنْ الشَّعْبِيِّ  ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" الْكَبَائِرُ : الْإِشْرَاكُ بِاللَّهِ، وَعُقُوقُ الْوَالِدَيْنِ، وَقَتْلُ النَّفْسِ شُعْبَةُ الشَّاكُّ أَوْ الْيَمِينُ الْغَمُوسُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Basysyar, telah menceritakan kepada kami Muhammad bin Ja'far, telah menceritakan kepada kami Syu'bah, daripada Firas, daripada Asy-Sya'bi, daripada Abdullah bin 'Amr, daripada Nabi صلى الله عليه وسلم, baginda bersabda: \"Dosa-dosa besar adalah: menyekutukan Allah, menderhakai kedua ibu bapa, dan membunuh jiwa - Syu'bah ragu-ragu - atau sumpah palsu.\""
  },
  {
    "id": 39172,
    "hadith_number": 1635,
    "tajuk_hadith": "Larangan Mengutuk Mukmin dan Hukuman Bunuh Diri",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ  ، حَدَّثَنَا هِشَامٌ  ، عَنْ يَحْيَى  ، عَنْ أَبِي قِلَابَةَ  ، عَنْ ثَابِتِ بْنِ الضَّحَّاكِ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" لَعْنُ الْمُؤْمِنِ كَقَتْلِهِ، وَمَنْ قَتَلَ نَفْسَهُ بِشَيْءٍ فِي الدُّنْيَا، عُذِّبَ بِهِ يَوْمَ الْقِيَامَةِ \"",
    "malay_translation": "Telah menceritakan kepada kami Wahb bin Jarir, telah menceritakan kepada kami Hisyam, daripada Yahya, daripada Abu Qilabah, daripada Thabit bin Dhahhak: Bahawa Rasulullah SAW bersabda: 'Mengutuk seorang mukmin adalah seperti membunuhnya, dan sesiapa yang membunuh dirinya dengan sesuatu di dunia, dia akan diazab dengannya pada hari kiamat.'"
  },
  {
    "id": 39173,
    "hadith_number": 1636,
    "tajuk_hadith": "Balasan bagi Orang yang Membunuh Diri",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ  ، حَدَّثَنَا الْأَعْمَشُ  ، عَنْ أَبِي صَالِحٍ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَنْ قَتَلَ نَفْسَهُ بِحَدِيدَةٍ فَحَدِيدَتُهُ فِي يَدِهِ يَتَوَجَّأُ بِهَا فِي بَطْنِهِ فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا، وَمَنْ قَتَلَ نَفْسَهُ بِسَمٍّ فَسُمُّهُ فِي يَدِهِ يَتَحَسَّاهُ فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا، وَمَنْ تَرَدَّى مِنْ جَبَلٍ فَقَتَلَ نَفْسَهُ، فَهُوَ يَتَرَدَّى فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا \"",
    "malay_translation": "Telah menceritakan kepada kami Ya'la bin Ubaid, telah menceritakan kepada kami al-A'mash, dari Abu Salih, dari Abu Hurairah, dia berkata: Rasulullah ﷺ bersabda: \"Barangsiapa membunuh dirinya dengan besi, maka besinya itu akan berada di tangannya, dia menusuk-nusuk perutnya dengannya di dalam Neraka Jahannam, kekal abadi di dalamnya selama-lamanya. Dan barangsiapa membunuh dirinya dengan racun, maka racunnya itu akan berada di tangannya, dia menghirupnya di dalam Neraka Jahannam, kekal abadi di dalamnya selama-lamanya. Dan barangsiapa menjatuhkan dirinya dari gunung lalu membunuh dirinya, maka dia akan terjatuh di dalam Neraka Jahannam, kekal abadi di dalamnya selama-lamanya.\""
  },
  {
    "id": 39174,
    "hadith_number": 1637,
    "tajuk_hadith": "Penetapan Diat Sebanyak Dua Belas Ribu pada Zaman Nabi",
    "perawi_melayu": "Mu'az bin Hani', Muhammad bin Muslim, 'Amru bin Dinar, 'Ikrimah, Ibn 'Abbas",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُعَاذُ بْنُ هَانِئٍ  ، حَدَّثَنَا مُحَمَّدُ بْنُ مُسْلِمٍ  ، حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ  ، عَنْ عِكْرِمَةَ  ، عَنِ ابْنِ عَبَّاسٍ  ، قالَ : قَتَلَ رَجُلٌ رَجُلًا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" فَجَعَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دِيَتَهُ اثْنَيْ عَشَرَ أَلْفًا فَذَلِكَ قَوْلُهُ : # يَحْلِفُونَ بِاللَّهِ مَا قَالُوا وَلَقَدْ قَالُوا كَلِمَةَ الْكُفْرِ وَكَفَرُوا بَعْدَ إِسْلامِهِمْ وَهَمُّوا بِمَا لَمْ يَنَالُوا وَمَا نَقَمُوا إِلا أَنْ أَغْنَاهُمُ اللَّهُ وَرَسُولُهُ مِنْ فَضْلِهِ سورة التوبة آية 74 # بِأَخْذِهِمُ الدِّيَةَ \"",
    "malay_translation": "Telah menceritakan kepada kami Mu'az bin Hani', telah menceritakan kepada kami Muhammad bin Muslim, telah menceritakan kepada kami 'Amru bin Dinar, dari 'Ikrimah, dari Ibn 'Abbas, dia berkata: 'Seorang lelaki membunuh seorang lelaki pada zaman Rasulullah صلى الله عليه وسلم,' maka Nabi صلى الله عليه وسلم menetapkan diatnya dua belas ribu. Maka itulah firman-Nya: '# Mereka bersumpah dengan nama Allah bahawa mereka tidak mengatakan (sesuatu yang buruk), padahal sesungguhnya mereka telah mengatakan perkataan kekufuran, dan telah menjadi kafir sesudah Islam, dan mereka merencanakan apa yang mereka tidak dapat capai, dan mereka tidak mencela (Allah dan Rasul-Nya) kecuali kerana Allah dan Rasul-Nya telah mengkayakan mereka dari karunia-Nya.' (Surah At-Taubah ayat 74) '# Kerana mengambil diat.'"
  },
  {
    "id": 39175,
    "hadith_number": 1638,
    "tajuk_hadith": "Kewajipan Dinar Emas bagi Penduduk Yaman",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى  ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ  ، عَنْ سُلَيْمَانَ بْنِ دَاوُدَ  ، قَالَ : حَدَّثَنِي الزُّهْرِيُّ  ، عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ  ، عَنْ أَبِيهِ  ، عَنْ جَدِّهِ   : أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى أَهْلِ الْيَمَنِ :\" وَعَلَى أَهْلِ الذَّهَبِ أَلْفُ دِينَارٍ \"",
    "malay_translation": "Telah menceritakan kepada kami al-Hakam bin Musa, telah menceritakan kepada kami Yahya bin Hamzah, daripada Sulaiman bin Daud, dia berkata: Telah menceritakan kepadaku az-Zuhri, daripada Abu Bakar bin Muhammad bin Amru bin Hazm, daripada bapanya, daripada datuknya: Bahawa Rasulullah SAW telah menulis kepada penduduk Yaman: \"Dan ke atas pemilik emas adalah seribu dinar.\""
  },
  {
    "id": 39176,
    "hadith_number": 1639,
    "tajuk_hadith": "Penetapan Diyat Bagi Pembunuhan Tidak Sengaja",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ مُوسَى  ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ  ، عَنْ سُلَيْمَانَ بْنِ دَاوُدَ  ، قَالَ : حَدَّثَنِي الزُّهْرِيُّ  ، عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ  ، عَنْ أَبِيهِ  ، عَنْ جَدِّهِ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى أَهْلِ الْيَمَنِ :\" بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ : مِنْ مُحَمَّدٍ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى شُرَحْبِيلَ بْنِ عَبْدِ كُلَالٍ، وَالْحَارِثِ بْنِ عَبْدِ كُلَالٍ، وَنُعَيْمِ بْنِ عَبْدِ كُلَالٍ قِيَلِ ذِي رُعَيْنٍ وَمُعَافِرَ، وَهَمَدَانَ فَكَانَ فِي كِتَابِهِ : وَإِنَّ فِي النَّفْسِ الدِّيَةَ : مِائَةٌ مِنَ الْإِبِلِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Hakam bin Musa, telah menceritakan kepada kami Yahya bin Hamzah, daripada Sulaiman bin Daud, beliau berkata: Telah menceritakan kepadaku az-Zuhri, daripada Abu Bakar bin Muhammad bin Amru bin Hazm, daripada ayahnya, daripada datuknya: Bahawa Rasulullah SAW telah menulis kepada penduduk Yaman: \"Bismillahirrahmanirrahim: Daripada Muhammad Nabi SAW kepada Syurahbil bin Abd Kulal, al-Harith bin Abd Kulal, dan Nu'aim bin Abd Kulal, Qiel Dzu Ru'ain dan Mu'afir, dan Hamdan. Maka dalam suratnya: Sesungguhnya bagi jiwa (dalam kes pembunuhan tidak sengaja) adalah diyat: seratus ekor unta.\""
  },
  {
    "id": 39177,
    "hadith_number": 1640,
    "tajuk_hadith": "Hukuman Diyat bagi Kecederaan pada Anggota Badan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى  ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ  ، عَنْ سُلَيْمَانَ بْنِ دَاوُدَ  ، حَدَّثَنِي الزُّهْرِيُّ  ، عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ  ، عَنْ أَبِيهِ  ، عَنْ جَدِّهِ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى أَهْلِ الْيَمَنِ ، وَكَانَ فِي كِتَابِهِ :\" وَفِي الْأَنْفِ إِذَا أُوعِبَ جَدْعُهُ الدِّيَةُ، وَفِي اللِّسَانِ الدِّيَةُ، وَفِي الشَّفَتَيْنِ الدِّيَةُ، وَفِي الْبَيْضَتَيْنِ الدِّيَةُ، وَفِي الذَّكَرِ الدِّيَةُ، وَفِي الصُّلْبِ الدِّيَةُ، وَفِي الْعَيْنَيْنِ الدِّيَةُ، وَفِي الرِّجْلِ الْوَاحِدَةِ نِصْفُ الدِّيَةِ، وَفِي الْمَأْمُومَةِ ثُلُثُ الدِّيَةِ، وَفِي الْجَائِفَةِ ثُلُثُ الدِّيَةِ، وَفِي الْمُنَقِّلَةِ خَمْسَ عَشَرَةَ مِنَ الْإِبِلِ \"",
    "malay_translation": "Telah menceritakan kepada kami Al-Hakam bin Musa, telah menceritakan kepada kami Yahya bin Hamzah, dari Sulaiman bin Daud, telah menceritakan kepadaku Az-Zuhri, dari Abu Bakr bin Muhammad bin Amru bin Hazm, dari ayahnya, dari kakeknya: Bahawa Rasulullah SAW telah menulis surat kepada penduduk Yaman, dan dalam suratnya: “Dan pada hidung jika dipotong habis diyatnya, pada lidah diyatnya, pada kedua bibir diyatnya, pada kedua buah zakar diyatnya, pada zakar diyatnya, pada tulang sulbi diyatnya, pada kedua mata diyatnya, pada satu kaki setengah diyatnya, pada *ma'mumah* (luka di kepala yang sampai ke otak) sepertiga diyatnya, pada *ja'ifah* (luka dalam yang sampai ke rongga badan) sepertiga diyatnya, dan pada *munaqqilah* (patah tulang yang berpindah dari tempatnya) lima belas ekor unta.”"
  },
  {
    "id": 39178,
    "hadith_number": 1641,
    "tajuk_hadith": "Diyat dalam Kesalahan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ  ، حَدَّثَنَا أَبُو مُعَاوِيَةَ  ، عَنْ حَجَّاجٍ  ، عَنْ زَيْدِ بْنِ جُبَيْرٍ  ، عَنْ خِشْفِ بْنِ مَالِكٍ  ، عَنْ عَبْدِ اللَّهِ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" جَعَلَ الدِّيَةَ فِي الْخَطَإِ أَخْمَاسًا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abdullah bin Sa'id, telah menceritakan kepada kami Abu Mu'awiyah, daripada Hajjaj, daripada Zaid bin Jubair, daripada Khishf bin Malik, daripada Abdullah: Bahawa Rasulullah SAW telah menetapkan diyat (denda) dalam kesilapan (pembunuhan tidak sengaja) kepada lima bahagian."
  },
  {
    "id": 39179,
    "hadith_number": 1642,
    "tajuk_hadith": "Hamba Miskin Memotong Tangan Budak Kaya, Tiada Hukuman Dikenakan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَزِيدَ الرِّفَاعِيُّ  ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ  ، عَنْ أَبِيهِ  ، عَنْ قَتَادَةَ  ، عَنْ أَبِي نَضْرَةَ  ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ   :\" أَنَّ عَبْدًا لِأُنَاسٍ فُقَرَاءَ، قَطَعَ يَدَ غُلَامٍ لِأُنَاسٍ أَغْنِيَاءَ.\nفَأَتَى أَهْلُهُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالُوا : يَا رَسُولَ اللَّهِ، إِنَّهُ لِأُنَاسٍ فُقَرَاءَ؟ فَلَمْ يَجْعَلْ عَلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا \"",
    "malay_translation": "Muhammad bin Yazid ar-Rifa'i telah memberitahu kami, Mu'adh bin Hisham telah menceritakan kepada kami, daripada ayahnya, daripada Qatadah, daripada Abu Nadrah, daripada Imran bin Husain RA: \"Bahawa seorang hamba kepunyaan orang miskin, telah memotong tangan seorang budak lelaki kepunyaan orang kaya. Maka keluarga hamba itu datang kepada Nabi SAW dan berkata: Wahai Rasulullah, sesungguhnya dia adalah kepunyaan orang miskin? Maka Nabi SAW tidak mengenakan apa-apa pun ke atasnya.\""
  },
  {
    "id": 39180,
    "hadith_number": 1643,
    "tajuk_hadith": "Kesamaan Jari-Jari",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ غَالِبٍ التَّمَّارِ  ، عَنْ مَسْرُوقِ بْنِ أَوْسٍ  ، عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" الْأَصَابِعُ سَوَاءٌ \"، قَالَ : فَقُلْتُ : عَشْرٌ عَشْرٌ؟، قَالَ : \" نَعَمْ \"",
    "malay_translation": "Abu al-Walid memberitahu kami, Syu'bah meriwayatkan kepada kami, daripada Ghalib al-Tammar, daripada Masruq bin Aus, daripada Abu Musa al-Asy'ari, daripada Nabi SAW, beliau bersabda: \"Jari-jari adalah sama.\" Perawi berkata: Lalu saya bertanya: \"Sepuluh, sepuluh?\" Beliau bersabda: \"Ya.\""
  },
  {
    "id": 39181,
    "hadith_number": 1644,
    "tajuk_hadith": "Penjelasan Kesamaan Jari",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ قَتَادَةَ  ، عَنْ عِكْرِمَةَ  ، عَنِ ابْنِ عَبَّاسٍ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" هَذَا وَهَذَا سَوَاء، وَقَالَ : بِخِنْصِرِهِ وَإِبْهَامِهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Shu'bah, dari Qatada, dari Ikrimah, dari Ibn Abbas, dari Nabi ﷺ, beliau bersabda: \"Ini dan ini sama,\" dan beliau bersabda sambil menunjukkan jari kelingking dan ibu jarinya."
  },
  {
    "id": 39182,
    "hadith_number": 1645,
    "tajuk_hadith": "Diyat (Pampasan) untuk Jari Tangan dan Kaki",
    "perawi_melayu": "Diriwayatkan oleh al-Hakam bin Musa, Yahya bin Hamzah, Sulaiman bin Daud, az-Zuhri, Abu Bakar bin Muhammad bin Amru bin Hazm, dari ayahnya, dari datuknya",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى  ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ  ، عَنْ سُلَيْمَانَ بْنِ دَاوُدَ  ، حَدَّثَنِي الزُّهْرِيُّ  ، حَدَّثَنِي أَبُو بَكْرِ بْنُ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ  ، عَنْ أَبِيهِ  ، عَنْ جَدِّهِ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى أَهْلِ الْيَمَنِ :\" وَفِي كُلِّ إِصْبَعٍ مِنْ أَصَابِعِ الْيَدِ وَالرِّجْلِ عَشْرَةٌ مِنَ الْإِبِلِ \"",
    "malay_translation": "Telah menceritakan kepada kami al-Hakam bin Musa, telah menceritakan kepada kami Yahya bin Hamzah, dari Sulaiman bin Daud, telah menceritakan kepadaku az-Zuhri, telah menceritakan kepadaku Abu Bakar bin Muhammad bin Amru bin Hazm, dari ayahnya, dari datuknya: Bahawa Rasulullah SAW telah menulis surat kepada penduduk Yaman: \"Dan bagi setiap jari dari jari-jari tangan dan kaki adalah sepuluh ekor unta.\""
  },
  {
    "id": 39183,
    "hadith_number": 1646,
    "tajuk_hadith": "Diyat bagi Kecederaan al-Mawadih",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُثْمَانُ بْنُ مُحَمَّدٍ  ، حَدَّثَنَا عَبْدَةُ  ، عَنْ سَعِيدٍ  ، عَنْ مَطَرٍ  ، عَنْ عَمْرِو بْنِ شُعَيْبٍ  ، عَنْ أَبِيهِ  ، عَنْ جَدِّهِ  ، قَالَ : \" قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَفِي الْمَوَاضِحِ خَمْسًا خَمْسًا مِنَ الْإِبِلِ \"",
    "malay_translation": "Uthman bin Muhammad telah memberitahu kami, Abdah telah menceritakan kepada kami, daripada Sa'id, daripada Matar, daripada 'Amr bin Syu'aib, daripada ayahnya, daripada datuknya, berkata: \"Rasulullah SAW memutuskan dalam (kes kecederaan) yang jelas (al-Mawadih) lima ekor unta sebagai diyat (ganti rugi).\""
  },
  {
    "id": 39184,
    "hadith_number": 1647,
    "tajuk_hadith": "Diyat bagi Jari dan Luka al-Mudihah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى  ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ  ، عَنْ سُلَيْمَانَ بْنِ دَاوُدَ  ، حَدَّثَنِي الزُّهْرِيُّ  ، عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ  ، عَنْ أَبِيهِ  ، عَنْ جَدِّهِ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى أَهْلِ الْيَمَنِ :\" وَفِي كُلِّ إِصْبَعٍ مِنْ أَصَابِعِ الْيَدِ وَالرِّجْلِ عَشْرٌ مِنَ الْإِبِلِ، وَفِي الْمُوضِحَةِ خَمْسٌ مِنَ الْإِبِلِ \"",
    "malay_translation": "Telah menceritakan kepada kami Al-Hakam bin Musa, telah menceritakan kepada kami Yahya bin Hamzah, dari Sulaiman bin Daud, telah menceritakan kepadaku Az-Zuhri, dari Abu Bakar bin Muhammad bin Amru bin Hazm, dari ayahnya, dari datuknya: Bahawa Rasulullah SAW telah menulis surat kepada penduduk Yaman: \"Dan bagi setiap jari dari jari-jari tangan dan kaki adalah sepuluh ekor unta, dan bagi *al-mudihah* adalah lima ekor unta.\""
  },
  {
    "id": 39185,
    "hadith_number": 1648,
    "tajuk_hadith": "Hukuman Rasulullah SAW tentang Gigi dalam Diyat",
    "perawi_melayu": "Uthman bin Muhammad, 'Abdah, Sa'id, Matar, 'Amr bin Syu'aib, bapanya, datuknya",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُثْمَانُ بْنُ مُحَمَّدٍ  ، أَخْبَرَنَا عَبْدَةُ  ، عَنْ سَعِيدٍ  ، عَنْ مَطَرٍ  ، عَنْ عَمْرِو بْنِ شُعَيْبٍ  ، عَنْ أَبِيهِ  ، عَنْ جَدِّهِ  ، قَالَ : \" قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيالْأَسْنَانِ خَمْسًا خَمْسًا مِنَ الْإِبِلِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Uthman bin Muhammad, telah mengkhabarkan kepada kami 'Abdah, daripada Sa'id, daripada Matar, daripada 'Amr bin Syu'aib, daripada bapanya, daripada datuknya, beliau berkata: \"Rasulullah SAW telah memutuskan dalam hal gigi (sebagai diyat) lima ekor unta, lima ekor unta.\""
  },
  {
    "id": 39186,
    "hadith_number": 1649,
    "tajuk_hadith": "Diyat Gigi: Lima Ekor Unta",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ مُوسَى  ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ  ، عَنْ سُلَيْمَانَ بْنِ دَاوُدَ  ، حَدَّثَنِي الزُّهْرِيُّ  ، عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ  ، عَنْ أَبِيهِ  ، عَنْ جَدِّهِ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى أَهْلِ الْيَمَنِ :\" وَفِي السِّنِّ خَمْسٌ مِنَ الْإِبِلِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Hakam bin Musa, telah menceritakan kepada kami Yahya bin Hamzah, daripada Sulaiman bin Daud, telah menceritakan kepadaku az-Zuhri, daripada Abu Bakar bin Muhammad bin Amru bin Hazm, daripada ayahnya, daripada datuknya: Bahawa Rasulullah SAW telah menulis kepada penduduk Yaman: \"Dan bagi gigi (sebagai diyat) adalah lima ekor unta.\""
  },
  {
    "id": 39187,
    "hadith_number": 1650,
    "tajuk_hadith": "Larangan Menggigit Saudara Seperti Unta Jantan dan Tiada Diyat untuknya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ  ، حَدَّثَنَا شُعْبَةُ  ، قَالَ : قَتَادَةُ  أَخْبَرَنِي، قَالَ : سَمِعْتُ زُرَارَةَ بْنَ أَوْفَى  ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ   : أَنَّ رَجُلًا عَضَّ يَدَ رَجُلٍ، قَالَ : فَنَزَعَ يَدَهُ فَوَقَعَتْ ثَنِيَّتَاهُ، فَاخْتَصَمُوا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ :\" يَعَضُّ أَحَدُكُمْ أَخَاهُ كَمَا يَعَضُّ الْفَحْلُ؟ لَا دِيَةَ لَكَ \"",
    "malay_translation": "Telah menceritakan kepada kami Hasyim bin al-Qasim, telah menceritakan kepada kami Syu'bah, dia berkata: Qatadah telah mengkhabarkan kepadaku, dia berkata: Aku mendengar Zurarah bin Aufa, dari Imran bin Husain: Bahawa seorang lelaki menggigit tangan seorang lelaki yang lain. Dia (lelaki yang digigit) berkata: Lalu dia menarik tangannya, maka terjatuhlah gigi serinya. Lalu mereka berdua mengadu kepada Rasulullah صلى الله عليه وسلم, maka baginda bersabda: \"Adakah salah seorang kamu menggigit saudaranya seperti seekor unta jantan menggigit? Tidak ada diyat (ganti rugi) untukmu.\""
  },
  {
    "id": 39188,
    "hadith_number": 1651,
    "tajuk_hadith": "Hukum Kecederaan Haiwan, Telaga, Lombong dan Zakat Rikaz",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو  ، عَنْ أَبِي سَلَمَةَ  ،  عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" الْعَجْمَاءُ جُرْحُهَا الْجُبَارُ، وَالْبِئْرُ جُبَارٌ، وَالْمَعْدِنُ جُبَارٌ، وَفِي الرِّكَازِ الْخُمُسُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah menceritakan kepada kami Muhammad bin 'Amr, daripada Abu Salamah, daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: \"Kecederaan yang disebabkan oleh haiwan adalah sia-sia (tidak dikenakan diyat), telaga adalah sia-sia (tidak dikenakan ganti rugi jika jatuh ke dalamnya), lombong adalah sia-sia (tidak dikenakan ganti rugi jika jatuh ke dalamnya), dan pada rikaz (harta karun terpendam) adalah seperlima (zakat).\""
  },
  {
    "id": 39189,
    "hadith_number": 1652,
    "tajuk_hadith": "Hukum Berkaitan Ganti Rugi dan Khumus",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ ابْنِ شِهَابٍ  ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ  ، وَأَبِي سَلَمَةَ  ، عَنْ أَبِي هُرَيْرَةَ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" جُرْحُ الْعَجْمَاءِ جُبَارٌ، وَالْبِئْرُ جُبَارٌ، وَالْمَعْدِنُ جُبَارٌ، وَفِي الرِّكَازِ الْخُمُسُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Khalid bin Makhlad, telah menceritakan kepada kami Malik, daripada Ibn Shihab, daripada Sa'id bin al-Musayyib, dan Abu Salamah, daripada Abu Hurairah, daripada Nabi صلى الله عليه وسلم, baginda bersabda: \"Luka yang disebabkan oleh haiwan ternakan adalah ganti rugi, telaga adalah ganti rugi, lombong adalah ganti rugi, dan pada rikaz (harta karun) adalah seperlima (khumus).\""
  },
  {
    "id": 39190,
    "hadith_number": 1653,
    "tajuk_hadith": "Hukum Berkaitan Galian, Haiwan Ternakan, Perigi, dan Harta Karun",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، عَنْ سُفْيَانَ  ، عَنْ أَبِي الزِّنَادِ  ، عَنْ الْأَعْرَجِ  ، عَنْ أَبِي هُرَيْرَةَ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" الْمَعْدِنُ جُبَارٌ، وَالسَّائِمَةُ جُبَارٌ، وَالْبِئْرُ جُبَارٌ، وَفِي الرِّكَازِ الْخُمُسُ \"",
    "malay_translation": "Diriwayatkan daripada Abu Hurairah RA, daripada Nabi SAW, baginda bersabda: \"Galian tidak dikenakan tanggungjawab ganti rugi, begitu juga haiwan ternakan, dan perigi, dan pada harta karun dikenakan khumus (seperlima).\""
  },
  {
    "id": 39191,
    "hadith_number": 1654,
    "tajuk_hadith": "Hukuman untuk Pembunuhan Janin Akibat Perselisihan Antara Isteri-isteri",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ مَنْصُورٍ  ، عَنْ إِبْرَاهِيمَ  ، عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ  ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" أَنَّ امْرَأَتَيْنِ كَانَتَا تَحْتَ رَجُلٍ، فَتَغَايَرَتَا، فَضَرَبَتْ إِحْدَاهُمَا الْأُخْرَى بِعَمُودٍ، فَقَتَلَتْهَا وَمَا فِي بَطْنِهَا، فَاخْتَصَمَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَفَقَضَى فِيهِ غُرَّةً، وَجَعَلَهَا عَلَى عَاقِلَةِ الْمَرْأَةِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu al-Walid, telah menceritakan kepada kami Syu'bah, daripada Mansur, daripada Ibrahim, daripada Ubaid bin Nudailah, daripada al-Mughirah bin Syu'bah, daripada Nabi ﷺ: \"Bahawa dua orang wanita berada di bawah jagaan seorang lelaki, lalu mereka berdua menjadi cemburu, maka salah seorang daripada mereka memukul yang lain dengan tiang, lalu membunuhnya dan apa yang ada di dalam perutnya (janin), lalu mereka berdua mengadu kepada Rasulullah ﷺ, maka baginda memutuskan dalam hal itu dengan ghurrah (diyat untuk janin), dan menjadikannya tanggungjawab 'aqilah (keluarga pihak ibu) wanita itu.\""
  },
  {
    "id": 39192,
    "hadith_number": 1655,
    "tajuk_hadith": "Keputusan Rasulullah SAW Mengenai Janin",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو عَاصِمٍ  ، حَدَّثَنَا ابْنُ جُرَيْجٍ  ، عَنْ عَمْرٍو هُوَ : ابْنُ دِينَار  ، عَنْ طَاوُسٍ  ، عَنِ ابْنِ عَبَّاسٍ   : أَنَّ عُمَرَ نَشَدَ النَّاسَ قَضَاءَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْجَنِينِ فَقَامَ حَمَلُ بْنُ مَالِكِ بْنِ النَّابِغَةِ، فَقَالَ : كُنْتُ بَيْنَ امْرَأَتَيْنِ، فَضَرَبَتْ إِحْدَاهُمَا الْأُخْرَى بِمِسْطَحٍ، \" فَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَنِينِهَابِغُرَّةٍ، وَأَنْ تُقْتَلَ بِهَا \"",
    "malay_translation": "Telah menceritakan kepada kami Abu 'Asim, telah menceritakan kepada kami Ibnu Juraij, dari 'Amr iaitu Ibnu Dinar, dari Tawus, dari Ibnu Abbas: Bahawa Umar meminta kesaksian kepada orang ramai tentang keputusan Rasulullah SAW mengenai janin. Maka berdirilah Hamal bin Malik bin Nabighah, lalu berkata: \"Saya berada di antara dua orang wanita, lalu salah seorang dari mereka memukul yang lain dengan mistah (kayu/besi). Maka Rasulullah SAW memutuskan dalam kes janinnya dengan (diyat) ghurrah, dan wanita yang memukul itu dibunuh (qisas) dengannya.\""
  },
  {
    "id": 39193,
    "hadith_number": 1656,
    "tajuk_hadith": "Hukuman Diyat untuk Janin dan Wanita yang Terbunuh dalam Pertengkaran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُثْمَانُ بْنُ عُمَرَ  ، حَدَّثَنَا يُونُسُ  ، عَنْ الزُّهْرِيِّ  ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ  ، وَأَبِي سَلَمَةَ  ، عَنْ أَبِي هُرَيْرَةَ   : أَنَّ امْرَأَتَيْنِ مِنْ هُذَيْلٍ اقْتَتَلَتَا، فَرَمَتْ إِحْدَاهُمَا الْأُخْرَى بِحَجَرٍ، فَقَتَلَتْهَا وَمَا فِي بَطْنِهَا، فَاخْتَصَمُوا فِي الدِّيَةِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَضَى : أَنَّ دِيَةَ جَنِينِهَا غُرَّةٌ : عَبْدٌ أَوْ وَلِيدَةٌ، وَقَضَى بِدِيَتِهَا عَلَى عَاقِلَتِهَا، وَوَرِثَتْهَا وَرَثَتُهَا وَلَدُهَا وَمَنْ مَعَهَا، فَقَالَ حَمَلُ بْنُ النَّابِغَةِ الْهُذَلِيُّ : كَيْفَ أَغْرَمُ مَنْ لَا شَرِبَ وَلَا أَكَلَ، وَلَا نَطَقَ وَلَا اسْتَهَلّ، فَمِثْلُ ذَلِكَ يُطَلُّ؟، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِنَّمَا هُوَ مِنْ إِخْوَانِ الْكُهَّانِ \".\nمِنْ أَجْلِ سَجْعِهِ الَّذِي سَجَعَ",
    "malay_translation": "Telah mengkhabarkan kepada kami Uthman bin Umar, telah menceritakan kepada kami Yunus, daripada az-Zuhri, daripada Said bin al-Musayyib, dan Abu Salamah, daripada Abu Hurairah: Bahawa dua orang wanita dari Hudhayl telah bertengkar, lalu salah seorang daripada mereka melempar yang lain dengan batu, lalu membunuhnya dan apa yang ada di dalam perutnya. Mereka kemudian bertikai mengenai diyat (denda) kepada Rasulullah ﷺ, lalu baginda memutuskan: Bahawa diyat janinnya adalah *ghurrah*: seorang hamba lelaki atau hamba perempuan. Dan baginda memutuskan diyat wanita itu ditanggung oleh *aqilahnya* (keluarga pihak lelaki), dan warisnya adalah anak-anaknya dan orang-orang yang bersama mereka. Maka berkata Hamal bin Nabighah al-Hudhali: Bagaimana aku harus membayar denda untuk orang yang tidak minum, tidak makan, tidak bercakap, dan tidak bersuara ketika lahir, adakah perkara seperti itu boleh diabaikan? Maka Rasulullah ﷺ bersabda: \"Sesungguhnya dia ini adalah daripada saudara-saudara tukang tilik.\" (Baginda berkata demikian) kerana sajaknya yang dia ucapkan."
  },
  {
    "id": 39194,
    "hadith_number": 1657,
    "tajuk_hadith": "Diyat untuk Pembunuhan Tidak Sengaja dan Serupa Sengaja",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ أَيُّوبَ  ، عَنْ الْقَاسِمِ بْنِ رَبِيعَةَ  ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" دِيَةُ قَتِيلِ الْخَطَإِ شِبْهِ الْعَمْدِ، وَمَا كَانَ بِالسَّوْطِ وَالْعَصَا مِائَةٌ مِنْهَا : أَرْبَعُونَ فِي بُطُونِهَا أَوْلَادُهَا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Syu'bah, daripada Ayyub, daripada al-Qasim bin Rabi'ah, daripada Abdullah bin 'Amr, dia berkata: Rasulullah ﷺ bersabda: \"Diyat (ganti rugi) bagi pembunuhan tidak sengaja yang menyerupai sengaja, dan apa yang berlaku dengan cambuk dan tongkat adalah seratus ekor unta, empat puluh daripadanya bunting.\""
  },
  {
    "id": 39195,
    "hadith_number": 1658,
    "tajuk_hadith": "Larangan Mengintai ke Dalam Rumah Tanpa Kebenaran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا الْأَوْزَاعِيُّ  ، عَنْ الزُّهْرِيِّ  ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ  ، أَخْبَرَهُ أَنَّ رَجُلًا اطَّلَعَ مِنْ جُحْرٍ فِي حُجْرَةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِدْرَى يُخَلِّلُ بِهَا رَأْسَهُ، فَرَآهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ :\" لَوْ أَعْلَمُ أَنَّكَ تَنْظُرُنِي، لَطَعَنْتُ بِهَا فِي عَيْنَيْكَ \".\nوَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" إِنَّمَا جُعِلَ الْإِذْنُ مِنْ أَجْلِ النَّظَرِ \"",
    "malay_translation": "Muhammad bin Yusuf meriwayatkan kepada kami, Al-Awza'i meriwayatkan kepada kami, daripada Az-Zuhri, daripada Sahl bin Sa'd As-Sa'idi, memberitahunya bahawa seorang lelaki menjenguk dari lubang di bilik Nabi صلى الله عليه وسلم, dan Rasulullah صلى الله عليه وسلم mempunyai tongkat dengannya yang digunakan untuk menggaru kepalanya. Rasulullah صلى الله عليه وسلم melihatnya dan bersabda: \"Sekiranya aku tahu kamu melihatku, aku pasti akan menusuk matamu dengan ini.\" Rasulullah صلى الله عليه وسلم juga bersabda: \"Sesungguhnya izin itu dijadikan adalah untuk tujuan pandangan.\""
  },
  {
    "id": 39196,
    "hadith_number": 1659,
    "tajuk_hadith": "Larangan Mengintai Rumah Orang Tanpa Izin",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، عَنْ ابْنِ أَبِي ذِئْبٍ  ، عَنْ الزُّهْرِيِّ  ، عَنْ سَهْلِ بْنِ سَعْدٍ  ، قالَ : بَيْنَمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حُجْرَةٍ وَمَعَهُ مِدْرى يَحُكُّ بِهِ رَأْسَهُ، اطَّلَعَ إِلَيْهِ رَجُلٌ، فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَوْ أَعْلَمُ أَنَّكَ تَنْظُرُ لَقُمْتُ حَتَّى أَطْعَنَ بِهِ عَيْنَيْكَ.\nإِنَّمَا جُعِلَ الْإِذْنُ مِنْ أَجْلِ النَّظَرِ \"",
    "malay_translation": "Ubaidullah bin Musa telah memberitahu kami, daripada Ibn Abi Dzi'b, daripada az-Zuhri, daripada Sahl bin Sa'ad, yang berkata: Ketika Rasulullah SAW berada di dalam bilik dan sedang menggaru kepalanya dengan tongkat, seorang lelaki menjenguk ke dalam. Rasulullah SAW bersabda kepadanya: \"Jika aku tahu kamu sedang melihat, aku akan berdiri dan mencucuk matamu dengan tongkat ini. Sesungguhnya keizinan itu disyariatkan adalah kerana penglihatan (agar tidak berlaku perkara yang tidak diingini).\""
  },
  {
    "id": 39197,
    "hadith_number": 1660,
    "tajuk_hadith": "Larangan Membunuh Tawanan Quraisy Selepas Pembukaan Mekah",
    "perawi_melayu": "Abdullah bin Muti'",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا جَعْفَرُ بْنُ عَوْنٍ  ، عَنْ زَكَرِيَّا  ، عَنْ الشَّعْبِيِّ  ، عَنْ عَبْدِ اللَّهِ بْنِ مُطِيعٍ  ، عَنْ مُطِيعٍ  ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَوْمَ فَتْحِ مَكَّةَ :\" لَا يُقْتَلُ قُرَشِيٌّ صَبْرًا بَعْدَ هَذَا الْيَوْمِ إِلَى يَوْمِ الْقِيَامَةِ \"، حَدَّثَنَا يَعْلَى  ، حَدَّثَنَا زَكَرِيَّا  ، عَنْ عَامِرٍ  ، قَالَ : قَالَ عَبْدُ اللَّهِ بْنُ مُطِيعٍ  ، سَمِعْتُ مُطِيعًا  ، يَقُولُ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.\n..\n..\n..\n. فَذَكَرَ نَحْوَهُ.\nقَالَ أَبُو مُحَمَّدٍ : فَسَّرُوا ذَلِكَ : أَنْ لَا يُقْتَلَ قُرَشِيٌّ عَلَى الْكُفْرِ يَعْنِي : لَا يَكُونُ هَذَا أَنْ يَكْفُرَ قُرَشِيٌّ بَعْدَ ذَلِكَ الْيَوْمِ فَأَمَّا فِي الْقَوَدِ، فَيُقْتَلُ",
    "malay_translation": "Diriwayatkan daripada Ja'far bin Aun, daripada Zakaria, daripada Asy-Sya'bi, daripada Abdullah bin Muti', daripada Muti', beliau berkata: Aku mendengar Rasulullah SAW bersabda pada hari pembukaan Makkah: \"Tidak boleh dibunuh seorang Quraisy dengan sabar (ditawan kemudian dibunuh) setelah hari ini hingga hari kiamat.\" Telah menceritakan kepada kami Ya'la, telah menceritakan kepada kami Zakaria, daripada Amir, beliau berkata: Abdullah bin Muti' berkata, aku mendengar Muti' berkata: Aku mendengar Rasulullah SAW.\n...\n...\n...\n. Lalu beliau menyebutkan sepertinya.\nAbu Muhammad berkata: Mereka menafsirkan hal itu: Bahawa tidak boleh dibunuh seorang Quraisy kerana kekufuran, yakni: Tidak boleh terjadi seorang Quraisy menjadi kafir setelah hari itu. Adapun dalam qisas, maka dia boleh dibunuh."
  },
  {
    "id": 39198,
    "hadith_number": 1661,
    "tajuk_hadith": "Pengesahan Anak dan Tanggungjawab Individu",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يُونُسُ بْنُ مُحَمَّدٍ  ، حَدَّثَنَا جَرِيرٌ يَعْنِي : ابْنَ حَازِمٍ  ، قَالَ : سَمِعْتُ عَبْدَ الْمَلِكِ بْنَ عُمَيْرٍ  ، حَدَّثَنِي إِيَادُ بْنُ لَقِيطٍ  ، عَنْ أَبِي رِمْثَةَ  ، قَالَ : قَدِمْتُ الْمَدِينَةَ وَمَعِيَ ابْنٌ لِي، وَلَمْ نَكُنْ رَأَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.\nفَأَتَيْتُهُ، فَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ ثَوْبَانِ أَخْضَرَانِ.\nفَلَمَّا رَأَيْتُهُ عَرَفْتُهُ بِالصِّفَةِ، فَأَتَيْتُهُ، فَقَالَ : \" مَنْ هَذَا الَّذِي مَعَكَ؟ \".\nقُلْتُ : ابْنِي وَرَبِّ الْكَعْبَةِ، فَقَالَ : \" ابْنُكَ؟ \"، فَقُلْتُ : أَشْهَدُ بِهِ.\nقَالَ :\" فَإِنَّ ابْنَكَ هَذَا لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yunus bin Muhammad, telah menceritakan kepada kami Jarir iaitu Ibnu Hazim, dia berkata: Aku mendengar Abdul Malik bin Umair, menceritakan kepadaku Iyad bin Laqit, daripada Abu Rimthah, dia berkata: Aku datang ke Madinah bersama seorang anakku, dan kami belum pernah melihat Rasulullah صلى الله عليه وسلم.\nLalu aku mendatanginya, maka Rasulullah صلى الله عليه وسلم keluar dan baginda memakai dua pakaian hijau.\nMaka ketika aku melihatnya, aku mengenalinya melalui sifatnya, lalu aku mendatanginya, dan baginda bersabda: \"Siapa ini yang bersamamu?\"\nAku berkata: Anakku, demi Tuhan Kaabah. Baginda bersabda: \"Anakmu?\" Aku berkata: Aku bersaksi dengannya.\nBaginda bersabda: \"Sesungguhnya anakmu ini tidak akan menanggung dosa kamu dan kamu tidak akan menanggung dosanya.\""
  },
  {
    "id": 39199,
    "hadith_number": 1662,
    "tajuk_hadith": "Pengakuan Anak dan Ayat Al-Quran tentang Tanggungjawab Dosa Individu",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ إِيَادٍ  ، حَدَّثَنَا إِيَادٌ  ، عَنْ أَبِي رِمْثَةَ  ، قَالَ : انْطَلَقْتُ مَعَ أَبِي نَحْوَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ لِأَبِي : \" ابْنُكَ هَذَا؟ \"، فَقَالَ : إِي وَرَبِّ الْكَعْبَةِ.\nقَالَ : \" حَقًّا؟ \".\nقَالَ : \" أَشْهَدُ بِهِ \".\nقَالَ : فَتَبَسَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَاحِكًا مِنْ ثَبَتِ شَبَهِي فِي أَبِي وَمِنْ حَلِفِ أَبِي عَلَي، فَقَالَ :\" إِنَّ ابْنَكَ هَذَا لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ \".\nقَالَ : وَقَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : # وَلا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى سورة الأنعام آية 164 #",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu al-Walid, telah menceritakan kepada kami Ubaidullah bin Iyad, telah menceritakan kepada kami Iyad, daripada Abu Rimthah, dia berkata: \"Aku pergi bersama ayahku menuju Rasulullah SAW, lalu baginda bersabda kepada ayahku: 'Adakah ini anakmu?', ayahku menjawab: 'Ya, demi Tuhan Kaabah.' Baginda bersabda: 'Benarkah?' Ayahku menjawab: 'Aku bersaksi atasnya.' Dia (Abu Rimthah) berkata: Lalu Rasulullah SAW tersenyum sambil ketawa kerana benarnya kemiripan aku dengan ayahku dan kerana sumpah ayahku atas hal itu. Baginda bersabda: 'Sesungguhnya anakmu ini tidak akan menanggung dosa kamu dan kamu tidak akan menanggung dosanya.' Dia (Abu Rimthah) berkata: Dan Rasulullah SAW membaca: # Dan seseorang yang berdosa tidak akan memikul dosa orang lain. Surah al-An'am ayat 164 #\""
  }
]
