[
  {
    "id": 39111,
    "hadith_number": 1574,
    "tajuk_hadith": "Pena Diangkat daripada Tiga Golongan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَفَّانُ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، حَدَّثَنَا حَمَّادٌ  ، عَنْ إِبْرَاهِيمَ  ، عَنْ الْأَسْوَدِ  ، عَنْ عَائِشَةَ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" رُفِعَ الْقَلَمُ عَنْ ثَلَاثَةٍ : عَنِ النَّائِمِ حَتَّى يَسْتَيْقِظَ، وَعَنِ الصَّغِيرِ حَتَّى يَحْتَلِمَ، وَعَنِ الْمَجْنُونِ حَتَّى يَعْقِلَ \".\nوَقَدْ قَالَ حَمَّادٌ أَيْضًا : \" وَعَنْ الْمَعْتُوهِ حَتَّى يَعْقِلَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Affan, telah menceritakan kepada kami Hammad bin Salamah, telah menceritakan kepada kami Hammad, daripada Ibrahim, daripada al-Aswad, daripada Aisyah, daripada Nabi SAW, baginda bersabda: “Pena diangkat (tidak dicatat dosa) daripada tiga golongan: daripada orang yang tidur sehingga dia bangun, daripada kanak-kanak sehingga dia baligh, dan daripada orang gila sehingga dia berakal.” Hammad juga berkata: “Dan daripada orang yang kurang akal sehingga dia berakal.”"
  },
  {
    "id": 39112,
    "hadith_number": 1575,
    "tajuk_hadith": "Tidak Halal Darah Seorang Muslim Kecuali dengan Tiga Sebab",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، عَنْ يَحْيَى بْنِ سَعِيدٍ  ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ  ،  عَنْ عُثْمَانَ  ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلَّا بِإِحْدَى ثَلَاثٍ : بِكُفْرٍ بَعْدَ إِيمَانٍ، أَوْ بِزِنًى بَعْدَ إِحْصَانٍ، أَوْ يَقْتُلُ نَفْسًا بِغَيْرِ نَفْسٍ فَيُقْتَلُ \"",
    "malay_translation": "Abu Nu'man telah memberitahu kami; Hammad bin Zaid telah meriwayatkan kepada kami, daripada Yahya bin Sa'eed, daripada Abu Umama bin Sahl bin Hunaif, daripada Uthman, beliau berkata: Saya mendengar Rasulullah ﷺ bersabda: 'Tidak halal darah seorang Muslim kecuali kerana salah satu daripada tiga sebab: kekufuran setelah beriman, atau zina setelah berkahwin (muhsan), atau membunuh jiwa tanpa hak, maka dia dibunuh (qisas).'"
  },
  {
    "id": 39113,
    "hadith_number": 1576,
    "tajuk_hadith": "Tidak Halal Menumpahkan Darah Seorang Muslim Kecuali dalam Tiga Keadaan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْلَى  ، حَدَّثَنَا الْأَعْمَشُ  ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ  ، عَنْ مَسْرُوقٍ  ، عَنْ عَبْدِ اللَّهِ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَا يَحِلُّ دَمُ رَجُلٍ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ، وَأَنِّي رَسُولُ اللَّهِ إِلَّا أَحَدُ ثَلَاثَةِ نَفَرٍ : النَّفْسُ بِالنَّفْسِ، وَالثَّيِّبُ الزَّانِي، وَالتَّارِكُ لِدِينِهِ، الْمُفَارِقُ لِلْجَمَاعَةِ \"",
    "malay_translation": "Telah menceritakan kepada kami Ya'la, telah menceritakan kepada kami Al-A'mash, daripada Abdullah bin Murrah, daripada Masruq, daripada Abdullah, beliau berkata: Rasulullah ﷺ bersabda: \"Tidak halal (dibenarkan) menumpahkan darah seorang lelaki yang bersaksi bahawa tidak ada tuhan yang berhak disembah melainkan Allah, dan bahawa aku adalah Rasulullah, kecuali salah satu dari tiga golongan: jiwa dengan jiwa (qisas), orang yang sudah berkahwin yang berzina, dan orang yang meninggalkan agamanya, memisahkan diri daripada jemaah (umat Islam).\""
  },
  {
    "id": 39114,
    "hadith_number": 1577,
    "tajuk_hadith": "Selendang Dicuri di Masjid",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعْدُ بْنُ حَفْصٍ  ، حَدَّثَنَا شَيْبَانُ  ، عَنْ أَشْعَثَ  ، عَنْ عِكْرِمَةَ  ، عَنِ ابْنِ عَبَّاسٍ  ، قَالَ : كَانَ صَفْوَانُ بْنُ أُمَيَّةَ نَائِمًا فِي الْمَسْجِدِ، فَأَتَاهُ رَجُلٌ وَهُوَ نَائِمٌ، فَاسْتَلَّ رِدَاءَهُ مِنْ تَحْتِ رَأْسِهِ، فتَنَبَّهَ بِهِ، فَلَحِقَهُ فَأَخَذَهُ فَانْطَلَقَ بِهِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ : يَا رَسُولَ اللَّهِ، كُنْتُ نَائِمًا فِي الْمَسْجِدِ، فَأَتَانِي هَذَا فَاسْتَلَّ رِدَائِي مِنْ تَحْتِ رَأْسِي، فَلَحِقْتُهُ فَأَخَذْتُهُ، فَأَمَرَ بِقَطْعِهِ، فَقَالَ لَهُ صَفْوَانُ : يَا رَسُولَ اللَّهِ، إِنَّ رِدَائِي لَمْ يَبْلُغْ أَنْ يُقْطَعَ فِيهِ هَذَا؟ قَالَ :\" فَهَلَّا، قَبْلَ أَنْ تَأْتِيَنِي بِهِ؟ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Sa'd bin Hafs, telah menceritakan kepada kami Syaiban, dari Asy'ath, dari Ikrimah, dari Ibn Abbas, beliau berkata: Safwan bin Umayyah sedang tidur di masjid. Kemudian, seorang lelaki datang ketika beliau sedang tidur dan menarik selendangnya dari bawah kepalanya. Safwan terjaga lalu mengejar lelaki itu dan menangkapnya. Kemudian, Safwan membawa lelaki itu kepada Rasulullah SAW dan berkata: \"Wahai Rasulullah, saya sedang tidur di masjid, kemudian lelaki ini datang dan menarik selendang saya dari bawah kepala saya. Saya mengejarnya dan menangkapnya.\" Rasulullah SAW memerintahkan agar tangannya dipotong (sebagai hukuman). Lalu Safwan berkata kepada Rasulullah: \"Wahai Rasulullah, selendang saya ini tidak sampai nilainya untuk dipotong tangan?\" Baginda bersabda: \"Mengapa tidak kamu (berkata demikian) sebelum kamu membawanya kepadaKu?\""
  },
  {
    "id": 39115,
    "hadith_number": 1578,
    "tajuk_hadith": "Hukuman Potong Tangan bagi Pencuri: Suku Dinar atau Lebih",
    "perawi_melayu": "Sulaiman bin Daud al-Hashimi, Ibrahim bin Sa'd, al-Zuhri, Amra binti Abd al-Rahman, Aisyah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْهَاشِمِيُّ  ، أَخْبَرَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ  ، عَنْ الزُّهْرِيِّ  ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ  ، عَنْ عَائِشَةَ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" تُقْطَعُ الْيَدُ فِي رُبْعِ دِينَارٍ فَصَاعِدًا \"",
    "malay_translation": "Telah meriwayatkan kepada kami Sulaiman bin Daud al-Hashimi, telah meriwayatkan kepada kami Ibrahim bin Sa'd, daripada al-Zuhri, daripada Amra binti Abd al-Rahman, daripada Aisyah: Bahawa Rasulullah SAW bersabda: 'Tangan akan dipotong bagi (kesalahan) mencuri (barang bernilai) suku dinar atau lebih.'"
  },
  {
    "id": 39116,
    "hadith_number": 1579,
    "tajuk_hadith": "Hukuman Potong Tangan bagi Mencuri Perisai Bernilai Tiga Dirham",
    "perawi_melayu": "Abu Nu'aim, Sufyan, Ayyub, Ismail bin Umayyah, Ubaidillah, Musa bin Uqba, Nafi', Ibn Umar",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ أَيُّوبَ  ، وَإِسْمَاعِيل بْنِ أُمَيَّةَ  ، وَعُبَيْدِ اللَّهِ  ، وَمُوسَى بْنِ عُقْبَة  ، عَنْ نَافِعٍ  ، عَنِ ابْنِ عُمَرَ  ، قَالَ :\" قَطَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مِجَنٍّ قِيمَتُهُ ثَلَاثَةُ دَرَاهِمَ \"",
    "malay_translation": "Abu Nu'aim memberitahu kami, Sufyan meriwayatkan kepada kami, daripada Ayyub, Ismail bin Umayyah, Ubaidillah, dan Musa bin Uqba, daripada Nafi', daripada Ibn Umar, berkata: \"Rasulullah ﷺ memerintahkan hukuman potong tangan kerana mencuri perisai yang bernilai tiga dirham.\""
  },
  {
    "id": 39117,
    "hadith_number": 1580,
    "tajuk_hadith": "Larangan Memberi Syafaat dalam Hukuman Hudud Allah dan Kesaksamaan Hukum",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا اللَّيْثُ  ، عَنْ ابْنِ شِهَابٍ  ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ  ، عَنْ عَائِشَةَ   : أَنَّ قُرَيْشًا أَهَمَّهُمْ شَأْنُ الْمَرْأَةِ الْمَخْزُومِيَّةِ الَّتِي سَرَقَتْ، فَقَالُوا : مَنْ يُكَلِّمُ فِيهَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟، قَالُوا : وَمَنْ يَجْتَرِئُ عَلَيْهِ إِلَّا أُسَامَةُ بْنُ زَيْدٍ حِبُّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ فَكَلَّمَهُ أُسَامَةُ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" أَتَشْفَعُ فِي حَدٍّ مِنْ حُدُودِ اللَّهِ؟ \" ثُمَّ قَامَ فَاخْتَطَبَ، فَقَالَ :\" إِنَّمَا هَلَكَ الَّذِينَ قَبْلَكُمْ أَنَّهُمْ كَانُوا إِذَا سَرَقَ فِيهُمُ الشَّرِيفُ، تَرَكُوهُ، وَإِذَا سَرَقَ فِيهِمُ الضَّعِيفُ، أَقَامُوا عَلَيْهِ الْحَدَّ، وَايْمُ اللَّهِ، لَوْ أَنَّ فَاطِمَةَ بِنْتَ مُحَمَّدٍ سَرَقَتْ، لَقَطَعْتُ يَدَهَا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ahmad bin Abdullah, telah menceritakan kepada kami al-Laith, daripada Ibn Shihab, daripada Urwah bin al-Zubair, daripada Aisyah RA: Sesungguhnya kaum Quraisy merasa bimbang tentang urusan seorang wanita Makhzumiyah yang mencuri. Mereka berkata: \"Siapa yang akan berbicara dengan Rasulullah SAW mengenai hal ini?\" Mereka berkata: \"Siapa yang berani kepadanya kecuali Usamah bin Zaid, kekasih Rasulullah SAW?\" Maka Usamah berbicara kepadanya, lalu Rasulullah SAW bersabda: \"Adakah kamu memberi syafaat dalam salah satu hukuman had Allah?\" Kemudian baginda berdiri dan berkhutbah, lalu bersabda: \"Sesungguhnya binasalah orang-orang sebelum kamu kerana mereka dahulu apabila orang yang mulia mencuri di kalangan mereka, mereka meninggalkannya (tidak dihukum), dan apabila orang yang lemah mencuri di kalangan mereka, mereka menegakkan hukuman had ke atasnya. Demi Allah, sekiranya Fatimah binti Muhammad mencuri, nescaya aku akan memotong tangannya.\""
  },
  {
    "id": 39118,
    "hadith_number": 1581,
    "tajuk_hadith": "Hukuman Potong Tangan bagi Pencuri dan Anjuran Bertaubat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا حَجَّاجُ بْنُ مِنْهَالٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ إِسْحَاق بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ  ، عَنْ أَبِي الْمُنْذِرِ  مَوْلَى أَبِي ذَرٍّ، عَنْ أَبِي أُمَيَّةَ الْمَخْزُومِيِّ  ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِسَارِقٍ اعْتَرَفَ اعْتِرَافًا، لَمْ يُوجَدْ مَعَهُ مَتَاعٌ، فَقَالَ :\" مَا إِخَالُكَ سَرَقْتَ؟ \" قَالَ : بَلَى، قَالَ : \" مَا إِخَالُكَ سَرَقْتَ؟ \" قَالَ : بَلَى، قَالَ : \" فَاذْهَبُوا فَاقْطَعُوا يَدَهُ ثُمَّ جِيئُوا بِهِ \" فَقَطَعُوا يَدَهُ، ثُمَّ جَاءُوا بِهِ، فَقَالَ : \" اسْتَغْفِرِ اللَّهَ وَتُبْ إِلَيْهِ \"، فَقَالَ : أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ، فَقَالَ : \" اللَّهُمَّ تُبْ عَلَيْهِ، اللَّهُمَّ تُبْ عَلَيْهِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Hajjaj bin Minhal, telah menceritakan kepada kami Hammad bin Salamah, daripada Ishaq bin Abdullah bin Abi Talhah, daripada Abu al-Munzir, hamba sahaya Abu Dzar, daripada Abu Umayyah al-Makhzumi, bahawa Rasulullah SAW dibawa kepada seorang pencuri yang telah mengaku curi, dan tidak ditemui barang curi bersamanya. Baginda bersabda: \"Aku tidak menyangka kamu mencuri?\" Dia berkata: \"Ya.\" Baginda bersabda: \"Aku tidak menyangka kamu mencuri?\" Dia berkata: \"Ya.\" Baginda bersabda: \"Pergilah dan potong tangannya kemudian bawa dia kepadaku.\" Maka mereka pun memotong tangannya, kemudian membawa dia kepada Baginda. Baginda bersabda: \"Beristighfarlah kepada Allah dan bertaubatlah kepada-Nya.\" Dia berkata: \"Aku beristighfar kepada Allah dan bertaubat kepada-Nya.\" Baginda bersabda: \"Ya Allah, terimalah taubatnya, Ya Allah, terimalah taubatnya.\""
  },
  {
    "id": 39119,
    "hadith_number": 1582,
    "tajuk_hadith": "Tiada Hukuman Potong Tangan Bagi Pencuri Buah-buahan dan Kathar",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا يَحْيَى هُوَ ابْنُ سَعِيدٍ  ، أَنَّ مُحَمَّدَ بْنَ يَحْيَى بْنِ حَبَّانَ  أَخْبَرَهُ، عَنْ رَافِعِ بْنِ خَدِيجٍ  ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah mengkhabarkan kepada kami Yahya iaitu Ibnu Sa'id, bahawa Muhammad bin Yahya bin Habban telah mengkhabarkannya, daripada Rafi' bin Khadij, dia berkata: Saya mendengar Rasulullah SAW bersabda: \"Tiada hukuman potong tangan dalam (mencuri) buah-buahan dan tidak juga *kathar* (umbi).\""
  },
  {
    "id": 39120,
    "hadith_number": 1583,
    "tajuk_hadith": "Tiada Potong Tangan untuk Mencuri Buah dan Kathar",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْحُسَيْنُ بْنُ مَنْصُورٍ  ، حَدَّثَنَا أَبُو أُسَامَةَ  ، عَنْ يَحْيَى بْنِ سَعِيدٍ  ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ  ، عَنْ رَجُلٍ  مِنْ قَوْمِهِ، عَنْ رَافِعِ بْنِ خَدِيجٍ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ \"",
    "malay_translation": "Telah menceritakan kepada kami al-Husain bin Mansur, telah menceritakan kepada kami Abu Usamah, daripada Yahya bin Said, daripada Muhammad bin Yahya bin Habban, daripada seorang lelaki dari kaumnya, daripada Rafi' bin Khadij, daripada Nabi SAW, baginda bersabda: \"Tidak ada hukuman potong tangan dalam (kes mencuri) buah-buahan dan tidak juga dalam *kathar* (pohon kurma yang kecil/muda).\""
  },
  {
    "id": 39121,
    "hadith_number": 1584,
    "tajuk_hadith": "Tiada Hukuman Potong Tangan bagi Mencuri Buah-buahan dan Kathar",
    "perawi_melayu": "Ishaq, Waki', Sufyan, Yahya bin Sa'id, Muhammad bin Yahya bin Habban, Wasi' bin Habban, Rafi' bin Khadij, Abu Nu'aim",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاق  ، حَدَّثَنَا وَكِيعٌ  ، عَنْ سُفْيَانَ  ، عَنْ يَحْيَى بْنِ سَعِيدٍ  ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ  ، عَنْ عَمِّهِ وَاسِعِ بْنِ حَبَّانَ  ، عَنْ رَافِعِ بْنِ خَدِيجٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ \".\nحَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ يَحْيَى بْنِ سَعِيدٍ  ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ  ، عَنْ رَافِعِ بْنِ خَدِيجٍ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Ishaq, telah menceritakan kepada kami Waki', daripada Sufyan, daripada Yahya bin Sa'id, daripada Muhammad bin Yahya bin Habban, daripada bapa saudaranya Wasi' bin Habban, daripada Rafi' bin Khadij, dia berkata: Rasulullah SAW bersabda: \"Tiada hukuman potong tangan dalam (kes mencuri) buah-buahan dan tidak juga *kathar*.\" Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Sufyan, daripada Yahya bin Sa'id, daripada Muhammad bin Yahya bin Habban, daripada Rafi' bin Khadij, daripada Nabi SAW seumpamanya."
  },
  {
    "id": 39122,
    "hadith_number": 1585,
    "tajuk_hadith": "Tiada Hukuman Potong Tangan bagi Mencuri Buah-buahan dan Kathar",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاق  ، حَدَّثَنَا جَرِيرٌ  ، وَالثَّقَفِيُّ  ، عَنْ يَحْيَى بْنِ سَعِيدٍ  ، أَخْبَرَنِي مُحَمَّدُ بْنُ يَحْيَى بْنِ حَبَّانَ  ، عَنْ رَافِعِ بْنِ خَدِيجٍ  ، قَالَ : سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ \".\nقَالَ : وَهُوَ شَحْمُ النَّخْلِ.\nوَالْكَثَرُ : الْجُمَّارُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Ishaq, telah menceritakan kepada kami Jarir, dan al-Thaqafi, daripada Yahya bin Sa'id, telah mengkhabarkan kepadaku Muhammad bin Yahya bin Habban, daripada Rafi' bin Khadij, dia berkata: Aku mendengar Nabi صلى الله عليه وسلم bersabda: \"Tiada hukuman potong tangan dalam (mencuri) buah-buahan dan tidak juga *kathar*.\" Dia (perawi) berkata: Ia adalah lemak kurma. Dan *kathar* adalah *jumar* (umbut kelapa)."
  },
  {
    "id": 39123,
    "hadith_number": 1586,
    "tajuk_hadith": "Tiada Hukuman Potong Tangan Bagi Kathar (Benda Ringan)",
    "perawi_melayu": "Perawi: Sa'id bin Mansur, Abdul Aziz bin Muhammad, Yahya bin Sa'id, Muhammad bin Yahya bin Habban, Abu Maimun, Rafi' bin Khadij",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ مَنْصُورٍ  ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ  ، عَنْ يَحْيَى بْنِ سَعِيدٍ  ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ  ، عَنْ أَبِي مَيْمُونٍ  ، عَنْ رَافِعِ بْنِ خَدِيجٍ  ، قَالَ : سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" لَا قَطْعَ فِي كَثَرٍ \".\nقَالَ أَبُو مُحَمَّد : الْقَوْلُ مَا قَالَ أَبُو أُسَامَةَ",
    "malay_translation": "Sa'id bin Mansur memberitahu kami, Abdul Aziz bin Muhammad menceritakan kepada kami, daripada Yahya bin Sa'id, daripada Muhammad bin Yahya bin Habban, daripada Abu Maimun, daripada Rafi' bin Khadij, beliau berkata: Saya mendengar Nabi SAW bersabda: 'Tiada hukuman potong tangan bagi kathar.' Abu Muhammad berkata: Pendapat yang benar adalah seperti yang dikatakan oleh Abu Usamah."
  },
  {
    "id": 39124,
    "hadith_number": 1587,
    "tajuk_hadith": "Tiada Hukuman Potong Tangan bagi Perampas, Pencuri Sembunyi, dan Pengkhianat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ ابْنِ جُرَيْجٍ  ، قَالَ : أَنْبَأَنَا أَبُو الزُّبَيْرِ  ، قَالَ جَابِرٌ   : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَيْسَ عَلَى الْمُنْتَهِبِ، وَلَا عَلَى الْمُخْتَلِسِ، وَلَا عَلَى الْخَائِنِ قَطْعٌ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Asim, daripada Ibnu Juraij, dia berkata: Telah memberitakan kepada kami Abu Zubair, dia berkata: Jabir berkata: Rasulullah SAW bersabda: \"Tidak ada hukuman potong tangan bagi perampas, pencuri secara sembunyi, dan pengkhianat.\""
  },
  {
    "id": 39125,
    "hadith_number": 1588,
    "tajuk_hadith": "Hukuman Minum Arak Menurut Sunnah Nabi dan Khulafa ar-Rasyidin",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ قَتَادَةَ  ، عَنْ أَنَسٍ  ، \" أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأُتِيَ بِرَجُلٍ قَدْ شَرِبَ خَمْرًا فَضَرَبَهُ بِجَرِيدَتَيْنِ \"، ثُمَّ فَعَلَ أَبُو بَكْرٍ مِثْلَ ذَلِكَ، فَلَمَّا كَانَ عُمَرُ : اسْتَشَارَ النَّاسَ، فَقَالَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ : أَخَفُّ الْحُدُودِ : ثَمَانِينَ، قَالَ : فَفَعَلَ",
    "malay_translation": "Telah menceritakan kepada kami Hasyim bin al-Qasim, telah menceritakan kepada kami Syu'bah, dari Qatadah, dari Anas, 'Bahawa Nabi ﷺ didatangkan kepada seorang lelaki yang telah minum arak, lalu Baginda memukulnya dengan dua batang pelepah kurma.' Kemudian Abu Bakr melakukan hal yang sama. Ketika zaman Umar, beliau bermesyuarat dengan orang ramai, lalu Abd al-Rahman bin Awf berkata, 'Hukuman had yang paling ringan adalah lapan puluh (kali sebatan).' Umar berkata, 'Maka beliau pun melakukannya.'"
  },
  {
    "id": 39126,
    "hadith_number": 1589,
    "tajuk_hadith": "Hukuman Sebat dalam Islam",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ  ، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ  ، حَدَّثَنَا عَبْدُ اللَّهِ الدَّانَاجُ  ، حَدَّثَنَا حُضَيْنُ بْنُ الْمُنْذِرِ الرَّقَاشِيُّ  ، قَالَ : شَهِدْتُ عُثْمَانَ بْنَ عَفَّانَ وَأُتِيَ بِالْوَلِيدِ بْنِ عُقْبَةَ، فَقَالَ عَلِيٌّ   :\" جَلَدَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعِينَ، وَجَلَدَ أَبُو بَكْرٍ أَرْبَعِينَ، وَعُمَرُ ثَمَانِينَ، وَكُلٌّ سُنَّةٌ \"",
    "malay_translation": "Telah menceritakan kepada kami Muslim bin Ibrahim, telah mengkhabarkan kepada kami Abdul Aziz bin al-Mukhtar, telah menceritakan kepada kami Abdullah ad-Danaj, telah menceritakan kepada kami Hudhain bin al-Munzir ar-Raqasyi, dia berkata: Saya menyaksikan Uthman bin Affan dan didatangkan al-Walid bin Uqbah kepadanya, lalu Ali berkata: \"Nabi صلى الله عليه وسلم menyebat (menghukum sebat) empat puluh kali, Abu Bakr menyebat empat puluh kali, dan Umar lapan puluh kali, dan setiapnya adalah sunnah.\""
  },
  {
    "id": 39127,
    "hadith_number": 1590,
    "tajuk_hadith": "Hukuman bagi Peminum Arak yang Berulang",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ  ، حَدَّثَنَا يَزِيدُ هُوَ ابْنُ زُرَيْعٍ  ، حَدَّثَنَا مُحَمَّدٌ هُوَ ابْنُ إِسْحَاق  ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُتْبَةَ بْنِ عُرْوَةَ بْنِ مَسْعُودٍ الثَّقَفِيُّ  ، عَنْ عَمْرِو بْنِ الشَّرِيدِ  ، عَنْ أَبِيهِ  ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" إِذَا شَرِبَ أَحَدُكُمْ فَاضْرِبُوهُ، ثُمَّ إِنْ عَادَ، فَاضْرِبُوهُ، ثُمَّ إِنْ عَادَ، فَاضْرِبُوهُ، ثُمَّ إِنْ عَادَ الرَّابِعَةَ فَاقْتُلُوهُ \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Abdullah ar-Raqasyi, telah menceritakan kepada kami Yazid iaitu Ibnu Zurai', telah menceritakan kepada kami Muhammad iaitu Ibnu Ishaq, telah menceritakan kepada kami Abdullah bin Utbah bin Urwah bin Mas'ud ats-Tsaqafi, daripada 'Amr bin asy-Syarid, daripada ayahnya, dia berkata: Saya mendengar Rasulullah SAW bersabda: \"Jika seseorang di antara kamu minum (arak), maka pukullah dia. Kemudian jika dia kembali (minum), maka pukullah dia. Kemudian jika dia kembali (minum), maka pukullah dia. Kemudian jika dia kembali (minum) untuk kali keempat, maka bunuhlah dia.\""
  },
  {
    "id": 39128,
    "hadith_number": 1591,
    "tajuk_hadith": "Larangan Memukul Lebih Sepuluh Kali Kecuali dalam Hukuman Hudud",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ  ، حَدَّثَنَا سَعِيدٌ هُوَ ابْنُ أَبِي أَيُّوبَ  ، حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ  ، عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ  ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ  ، عَنْ عَبْدِ الرَّحْمَنِ هُوَ ابْنُ جَابِرٍ  ، عَنْ أَبِي بُرْدَةَ بْنِ نِيَارٍ  ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" لَا يَحِلُّ لِأَحَدٍ أَنْ يَضْرِبَ أَحَدًا فَوْقَ عَشْرَةِ أَصْوَاتٍ إِلَّا فِي حَدٍّ مِنْ حُدُودِ اللَّهِ \"",
    "malay_translation": "Abdullah bin Yazid memberitahu kami, Said iaitu Ibnu Abi Ayyub menceritakan kepada kami, Yazid bin Abi Habib menceritakan kepada saya, daripada Bukair bin Abdullah bin Al-Asyaj, daripada Sulaiman bin Yasar, daripada Abdurrahman iaitu Ibnu Jabir, daripada Abu Burdah bin Niyar, dia berkata: Saya mendengar Rasulullah SAW bersabda: \"Tidak dibenarkan bagi sesiapa untuk memukul seseorang lebih daripada sepuluh sebatan kecuali dalam had salah satu had Allah.\""
  },
  {
    "id": 39129,
    "hadith_number": 1592,
    "tajuk_hadith": "Lelaki dari Aslam Mengaku Berzina dan Direjam",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، حَدَّثَنَا ابْنُ جُرَيْجٍ  ، أَخْبَرَنِي ابْنُ شِهَابٍ  ، عَنْ أَبِي سَلَمَةَ  ، عَنْ جَابِرٍ   : أَنَّ رَجُلًا مِنْ أَسْلَمَ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَدَّثَهُ أَنَّهُ زَنَى فَشَهِدَ عَلَى نَفْسِهِ أَنَّهُ زَنَى أَرْبَعًا،فَأَمَرَ بِرَجْمِهِ وَكَانَ قَدْ أُحْصِنَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu 'Asim, telah menceritakan kepada kami Ibn Juraij, telah mengkhabarkan kepadaku Ibn Shihab, daripada Abu Salamah, daripada Jabir: Bahawa seorang lelaki dari Aslam datang kepada Nabi صلى الله عليه وسلم dan memberitahunya bahawa dia telah berzina, lalu dia bersaksi terhadap dirinya sendiri bahawa dia telah berzina sebanyak empat kali, maka Nabi memerintahkan agar dia direjam dan dia telah berkahwin (muhsan)."
  },
  {
    "id": 39130,
    "hadith_number": 1593,
    "tajuk_hadith": "Kisah Ma'iz bin Malik dan Perintah Rejam",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، عَنْ إِسْرَائِيلَ  ، عَنْ سِمَاكٍ  ، أَنَّهُ سَمِعَ جَابِرَ بْنَ سَمُرَةَ   يَقُولُ : أُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَاعِزِ بْنِ مَالِكٍ رَجُلٍ قَصِيرٍ فِي إِزَارٍ مَا عَلَيْهِ رِدَاءٌ، وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُتَّكِئٌ عَلَى وِسَادَةٍ عَلَى يَسَارِهِ فَكَلَّمَهُ، فَمَا أَدْرِي مَا يُكَلِّمُهُ بِهِ، وَأَنَا بَعِيدٌ مِنْهُ، بَيْنِي وَبَيْنَهُ الْقَوْمُ، ثُمَّ قَالَ :\" اذْهَبُوا بِهِ فَارْجُمُوهُ \"، ثُمَّ قَالَ : \" رُدُّوهُ \"، فَكَلَّمَهُ أَيْضًا وَأَنَا أَسْمَعُ غَيْرَ أَنَّ بَيْنِي وَبَيْنَهُ الْقَوْمُ، فَقَالَ : \" اذْهَبُوا بِهِ فَارْجُمُوهُ \"، ثُمَّ قَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَطَبَ وَأَنَا أَسْمَعُهُ، ثُمَّ قَالَ : \" كُلَّمَا نَفَرْنَا فِي سَبِيلِ اللَّهِ، خَلَفَ أَحَدُهُمْ لَهُ نَبِيبٌ كَنَبِيبِ التَّيْسِ يَمْنَحُ إِحْدَاهُنَّ الْكُثْبَةَ مِنَ اللَّبَنِ؟ وَاللَّهِ لَا أَقْدِرُ عَلَى أَحَدٍ مِنْهُمْ، إِلَّا نَكَّلْتُ بِهِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ubaidullah bin Musa, daripada Israil, daripada Simak, bahawa dia mendengar Jabir bin Samurah berkata: Nabi ﷺ telah didatangkan kepada Ma'iz bin Malik, seorang lelaki pendek yang memakai kain izar tanpa rida'. Rasulullah ﷺ sedang bersandar pada bantal di sebelah kirinya dan bercakap dengannya. Aku tidak tahu apa yang Baginda cakapkan kepadanya kerana aku berada jauh, dipisahkan oleh orang ramai. Kemudian Baginda bersabda: \"Bawa dia dan rejam dia.\" Kemudian Baginda bersabda: \"Kembalikan dia.\" Baginda bercakap dengannya lagi dan aku mendengar, tetapi masih dipisahkan oleh orang ramai. Lalu Baginda bersabda: \"Bawa dia dan rejam dia.\" Kemudian Nabi ﷺ berdiri dan berkhutbah, dan aku mendengarnya. Baginda bersabda: \"Setiap kali kita keluar berjihad di jalan Allah, ada di antara mereka yang tinggal di belakang dengan bunyi seperti bunyi kambing jantan, memberikan susu kepada salah seorang wanita? Demi Allah, tidak seorang pun daripada mereka yang dapat aku biarkan terlepas, pasti aku akan menghukumnya.\""
  },
  {
    "id": 39131,
    "hadith_number": 1594,
    "tajuk_hadith": "Hukuman Zina: Rejam bagi yang Muhsan dan Jilid serta Pengasingan bagi yang Belum Muhsan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ  ، عَنْ الزُّهْرِيِّ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ  ، عَنْ أَبِي هُرَيْرَةَ  ، وَزَيْدِ بْنِ خَالِدٍ  ، وَشِبْلٍ   ، قَالُوا : جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ : أَنْشُدُكَ اللَّهَ إِلَّا قَضَيْتَ بَيْنَنَا بِكِتَابِ اللَّهِ، فَقَالَ خَصْمُهُ وَكَانَ أَفْقَهَ مِنْهُ : صَدَقَ، اقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ، وَأْذَنْ لِي يَا رَسُولَ اللَّهِ أَنْ أَتَكَلَّمَ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" قُلْ \"، فَقَالَ : إِنَّ ابْنِي كَانَ عَسِيفًا عَلَى أَهْلِ هَذَا، فَزَنَى بِامْرَأَتِهِ، فَافْتَدَيْتُ مِنْهُ بِمِائَةِ شَاةٍ وَخَادِمٍ، وَإِنِّي سَأَلْتُ رِجَالًا مِنْ أَهْلِ الْعِلْمِ، فَأَخْبَرُونِي أَنَّ عَلَى ابْنِي جَلْدَ مِائَةٍ وَتَغْرِيبَ عَامٍ، وَأَنَّ عَلَى امْرَأَةِ هَذَا الرَّجْمَ، فَقَالَ : \" وَالَّذِي نَفْسِي بِيَدِهِ،لَأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ : الْمِائَةُ شَاةٍ وَالْخَادِمُ رَدٌّ عَلَيْكَ، وَعَلَى ابْنِكَ جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ، وَيَا أُنَيْسُ اغْدُ عَلَى امْرَأَةِ هَذَا فَسَلْهَا، فَإِنْ اعْتَرَفَتْ، فَارْجُمْهَا \"، فَاعْتَرَفَتْ، فَرَجَمَهَا",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Yusuf, telah menceritakan kepada kami Sufyan bin Uyainah, daripada az-Zuhri, daripada Ubaidillah bin Abdullah bin Utbah, daripada Abu Hurairah, dan Zaid bin Khalid, dan Syibl, mereka berkata: Seorang lelaki datang kepada Rasulullah SAW dan berkata: \"Saya bersumpah dengan nama Allah agar engkau memutuskan perkara antara kami dengan Kitab Allah.\" Maka lawannya yang lebih faham daripadanya berkata: \"Benar, putuskanlah perkara antara kami dengan Kitab Allah, dan izinkanlah aku wahai Rasulullah untuk berbicara.\" Rasulullah SAW bersabda: \"Katakanlah.\" Lelaki itu berkata: \"Sesungguhnya anakku adalah seorang pekerja upahan kepada keluarga ini, lalu dia berzina dengan isteri mereka. Maka aku telah menebus dirinya dengan seratus ekor kambing dan seorang hamba. Dan sesungguhnya aku telah bertanya kepada beberapa orang ahli ilmu, lalu mereka memberitahuku bahawa anakku dikenakan hukuman jilid seratus kali dan pengasingan selama setahun, dan bahawa wanita ini dikenakan hukuman rejam.\" Maka Rasulullah SAW bersabda: \"Demi Zat yang jiwaku berada di tangan-Nya, sungguh aku akan memutuskan perkara antara kamu berdua dengan Kitab Allah: Seratus ekor kambing dan hamba itu dikembalikan kepadamu, dan anakmu dikenakan hukuman jilid seratus kali dan pengasingan selama setahun. Wahai Unais, pergilah kepada wanita ini dan tanyalah dia, jika dia mengaku, maka rejamlah dia.\" Maka wanita itu mengaku, lalu direjamlah dia."
  },
  {
    "id": 39132,
    "hadith_number": 1595,
    "tajuk_hadith": "Anjuran Menghentikan Rejam Jika Timbul Penyesalan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ  ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ  ، حَدَّثَنَا مُحَمَّدٌ هُوَ ابْنُ إِسْحَاق بْنِ يَسَارٍ  ، حَدَّثَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ التَّيْمِيُّ  ، عَنْ أَبِي الْهَيْثَمِ بْنِ نَصْرِ بْنِ دَهْرٍ الْأَسْلَمِيِّ  ، عَنْ أَبِيهِ  ، قَالَ : كُنْتُ فِيمَنْ رَجَمَهُ، قَالَ أَبُو مُحَمَّدٍ : يَعْنِي مَاعِزَ بْنَ مَالِكٍ، فلَمَّا وَجَدَ مَسَّ الْحِجَارَةِ، جَزِعَ جَزَعًا شَدِيدًا، قَالَ : فَذَكَرْنَا ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" فَهَلَّا تَرَكْتُمُوهُ؟ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Abdullah Ar-Raqasyi, telah menceritakan kepada kami Yazid bin Zurai', telah menceritakan kepada kami Muhammad iaitu Ibnu Ishaq bin Yasar, telah menceritakan kepada kami Muhammad bin Ibrahim At-Taimi, daripada Abu Al-Haitham bin Nasr bin Dahr Al-Aslami, daripada bapanya, dia berkata: \"Aku termasuk dalam kalangan orang yang merejamnya.\" Abu Muhammad berkata: \"Yakni Ma'iz bin Malik.\" Maka apabila dia merasakan sentuhan batu, dia sangat terkejut dan resah. Dia (bapa Abu Al-Haitham) berkata: \"Lalu kami menyebutkan hal itu kepada Rasulullah SAW, lalu baginda bersabda: \"Mengapa tidak kamu tinggalkan dia (hentikan rejam)?\" \""
  },
  {
    "id": 39133,
    "hadith_number": 1596,
    "tajuk_hadith": "Perintah Merejam Ma'iz bin Malik",
    "perawi_melayu": "Abu Sa'id al-Khudri",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى  ، حَدَّثَنَا يَحْيَى بْنُ أَبِي زَائِدَةَ  ، عَنْ دَاوُدَ  ، عَنْ أَبِي نَضْرَةَ  ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" انْطَلِقُوا بِمَاعِزِ بْنِ مَالِكٍ، فَارْجُمُوهُ \".\nفَانْطَلَقْنَا بِهِ إِلَى بَقِيعِ الْغَرْقَدِ ، فَوَاللَّهِ مَا أَوْثَقْنَاهُ وَلَا حَفَرْنَا لَهُ، وَلَكِنْ قَامَ فَرَمَيْنَاهُ بِالْعِظَامِ وَالْخَزَفِ وَالْجَنْدَلِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Isa, telah menceritakan kepada kami Yahya bin Abi Zaidah, daripada Daud, daripada Abu Nadrah, daripada Abu Sa'id al-Khudri, dia berkata: Rasulullah ﷺ bersabda: \"Pergilah kamu kepada Ma'iz bin Malik dan rejamlah dia.\" Lalu kami pergi bersamanya ke Baqi' al-Gharqad. Demi Allah, kami tidak mengikatnya dan tidak menggali lubang untuknya, tetapi dia berdiri lalu kami merejamnya dengan tulang, tembikar, dan batu kerikil."
  },
  {
    "id": 39134,
    "hadith_number": 1597,
    "tajuk_hadith": "Pengakuan Ma'iz bin Malik Berzina dan Hukuman Rejam",
    "perawi_melayu": "Abu Nu'aim, Bashir bin Al-Muhajir, Abdullah bin Buraidah, dari ayahnya",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا بَشِيرُ بْنُ الْمُهَاجِرِ  ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ  ، عَنْ أَبِيهِ  ، قَالَ : كُنْتُ جَالِسًا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَاءَهُ رَجُلٌ يُقَالُ لَهُ مَاعِزُ بْنُ مَالِكٍ، فَاعْتَرَفَ عِنْدَهُ بِالزِّنَا، فَرَدَّهُ ثَلَاثَ مَرَّاتٍ، ثُمَّ جَاءَ الرَّابِعَةَ فَاعْتَرَفَ،\" فَأَمَرَ بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحُفِرَ لَهُ حُفْرَةٌ فَجُعِلَ فِيهَا إِلَى صَدْرِهِ، وَأَمَرَ النَّاسَ أَنْ يَرْجُمُوهُ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Bashir bin Al-Muhajir, telah menceritakan kepadaku Abdullah bin Buraidah, dari ayahnya, dia berkata: \"Saya sedang duduk di sisi Nabi ﷺ, lalu datanglah seorang lelaki yang dipanggil Ma'iz bin Malik, lalu dia mengaku di hadapan baginda telah berzina, lalu baginda menolaknya tiga kali, kemudian dia datang kali keempat lalu mengaku, maka Nabi ﷺ memerintahkan agar digali lubang untuknya lalu dia dimasukkan ke dalamnya hingga dadanya, dan baginda memerintahkan orang ramai untuk merejamnya.\""
  },
  {
    "id": 39135,
    "hadith_number": 1598,
    "tajuk_hadith": "Hukuman Rejam dalam Taurat dan Pelaksanaannya oleh Rasulullah SAW",
    "perawi_melayu": "Ahmad bin Abdullah, Zuhair, Musa bin Uqbah, Nafi', Ibn Umar",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا زُهَيْرٌ  ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ  ، عَنْ نَافِعٍ  ، عَنِ ابْنِ عُمَرَ   : أَنَّ الْيَهُودَ جَاءُوا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِرَجُلٍ مِنْهُمْ وَامْرَأَةٍ قَدْ زَنَيَا، فَقَالَ :\" كَيْفَ تَفْعَلُونَ بِمَنْ زَنَى مِنْكُمْ؟ \".\nقَالُوا : لَا نَجِدُ فِيهَا شَيْئًا، فَقَالَ لَهُمْ عَبْدُ اللَّهِ بْنُ سَلَامٍ : كَذَبْتُمْ، فِي التَّوْرَاةِ الرَّجْمُ، فَأْتُوا بِالتَّوْرَاةِ فَاتْلُوهَا إِنْ كُنْتُمْ صَادِقِينَ فَجَاءُوا بِالتَّوْرَاةِ، فَوَضَعَ مِدْرَاسُهَا الَّذِي يَدْرُسُهَا مِنْهُمْ كَفَّهُ عَلَى آيَةِ الرَّجْمِ، فَقَالَ : مَا هَذِهِ؟ فَلَمَّا رَأَوْا ذَلِكَ قَالُوا : هِيَ آيَةُ الرَّجْمِ، \" فَأَمَرَ بِهِمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \" فَرُجِمَا قَرِيبًا مِنْ حَيْثُ تُوضَعُ الْجَنَائِزُ عِنْدَ الْمَسْجِدِ.\n قَالَ عَبْدُ اللَّهِ : فَرَأَيْتُ صَاحِبَهَا يُخْبِئُ عَلَيْهَا : يَقِيهَا الْحِجَارَةَ",
    "malay_translation": "Telah mengkhabarkan kepada kami Ahmad bin Abdullah, telah menceritakan kepada kami Zuhair, telah menceritakan kepada kami Musa bin Uqbah, daripada Nafi', daripada Ibn Umar RA: Sesungguhnya orang-orang Yahudi datang kepada Rasulullah SAW dengan membawa seorang lelaki dan seorang wanita dari kalangan mereka yang telah berzina. Baginda bersabda: \"Bagaimana kamu melakukan terhadap orang yang berzina di kalangan kamu?\"\nMereka berkata: \"Kami tidak mendapati apa-apa hukuman dalam hal itu.\" Abdullah bin Salam berkata kepada mereka: \"Kamu berdusta, dalam Taurat ada hukuman rejam. Bawalah Taurat dan bacalah jika kamu benar.\"\nMaka mereka membawa Taurat. Seorang alim (cendekiawan) mereka yang mempelajarinya meletakkan tangannya di atas ayat rejam. Baginda bersabda: \"Apa ini?\" Ketika mereka melihat hal itu, mereka berkata: \"Ini adalah ayat rejam.\"\n\"Rasulullah SAW memerintahkan agar keduanya direjam.\" Maka keduanya direjam dekat dengan tempat jenazah diletakkan di masjid.\nAbdullah berkata: \"Aku melihat lelaki itu melindungi wanita itu (dari batu): dia melindunginya dari batu.\""
  },
  {
    "id": 39136,
    "hadith_number": 1599,
    "tajuk_hadith": "Ayat Rejam dalam Kitab Allah dan Pelaksanaannya oleh Rasulullah SAW",
    "perawi_melayu": "Daripada Ibn Abbas R.A. dan Umar R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ الزُّهْرِيِّ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ  ، عَنِ ابْنِ عَبَّاسٍ  ، قَالَ : قَالَ عُمَرُ   :\" إِنَّ اللَّهَ تَعَالَى، بَعَثَ مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْحَقِّ، وَأَنْزَلَ عَلَيْهِ الْكِتَابَ، وَكَانَ فِيمَا أَنْزَلَ آيَةُ الرَّجْمِ، فَقَرَأْنَاهَا وَوَعَيْنَاهَا وَعَقَلْنَاهَا، وَرَجَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَجَمْنَا بَعْدَهُ، فَأَخْشَى إِنْ طَالَ بِالنَّاسِ زَمَانٌ أَنْ يَقُولَ الْقَائِلُ : لَا نَجِدُ حَدَّ آيَةِ الرَّجْمِ فِي كِتَابِ اللَّهِ، وَالرَّجْمُ فِي كِتَابِ اللَّهِ حَقٌّ عَلَى مَنْ زَنَى مِنَ الرِّجَالِ وَالنِّسَاءِ إِذَا أُحْصِنَّ، إِذَا قَامَتْ عَلَيْهِ الْبَيِّنَةُ، أَوْ كَانَ الْحَبَلُ أَوِ الِاعْتِرَافُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Khalid bin Makhlad, telah menceritakan kepada kami Malik, daripada al-Zuhri, daripada Ubaidillah bin Abdullah bin Utbah, daripada Ibn Abbas, beliau berkata: Umar berkata: “Sesungguhnya Allah Taala telah mengutus Muhammad صلى الله عليه وسلم dengan kebenaran, dan menurunkan kepadanya Kitab, dan termasuk dalam apa yang diturunkan adalah ayat rejam. Kami telah membacanya, memahaminya, dan menghafalnya. Rasulullah صلى الله عليه وسلم telah merejam dan kami pun merejam selepasnya. Aku khuatir jika zaman berpanjangan bagi manusia, akan ada yang berkata: ‘Kami tidak menemukan hukum ayat rejam dalam Kitab Allah.’ Padahal rejam dalam Kitab Allah adalah benar bagi siapa yang berzina dari lelaki dan perempuan yang telah berkahwin (muhsan), apabila ditegakkan bukti atasnya, atau adanya kehamilan atau pengakuan.”"
  },
  {
    "id": 39137,
    "hadith_number": 1600,
    "tajuk_hadith": "Hukuman Rejam bagi Penzina Tua",
    "perawi_melayu": "Zaid bin Thabit",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَزِيدَ الرِّفَاعِيُّ  ، حَدَّثَنَا الْعَقَدِيُّ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ قَتَادَةَ  ، عَنْ يُونُسَ بْنِ جُبَيْرٍ  يُحَدِّثُ : عَنْ كَثِيرِ بْنِ الصَّلْتِ  ، عَنْ زَيْدِ بْنِ ثَابِتٍ  ، قَالَ : أَشْهَدُ لَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" الشَّيْخُ وَالشَّيْخَةُ إِذَا زَنَيَا، فَارْجُمُوهُمَا الْبَتَّةَ \"",
    "malay_translation": "Muhammad bin Yazid al-Rifa'i memberitahu kami, al-'Aqadi memberitahu kami, Syu'bah memberitahu kami, daripada Qatadah, daripada Yunus bin Jubair yang menceritakan: daripada Kathir bin al-Salt, daripada Zaid bin Thabit, dia berkata: Saya bersaksi bahawa saya mendengar Rasulullah SAW bersabda: 'Orang tua lelaki dan orang tua perempuan apabila mereka berzina, maka rejamlah mereka berdua.'"
  },
  {
    "id": 39138,
    "hadith_number": 1601,
    "tajuk_hadith": "Taubat Wanita Ghamidiyyah yang Berzina",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا بَشِيرُ بْنُ الْمُهَاجِرِ  ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ  ، عَنْ أَبِيهِ  ، قَالَ : كُنْتُ جَالِسًا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَاءَتْهُ امْرَأَةٌ مِنْ بَنِي غَامِدٍ، فَقَالَتْ : يَا نَبِيَّ اللَّهِ إِنِّي قَدْ زَنَيْتُ، وَإِنِّي أُرِيدُ أَنْ تُطَهِّرَنِي، فَقَالَ لَهَا : \" ارْجِعِي \".\nفَلَمَّا كَانَ مِنْ الْغَدِ، أَتَتْهُ أَيْضًا، فَاعْتَرَفَتْ عِنْدَهُ بِالزِّنَاء، فَقَالَتْ : يَا نَبِيَّ اللَّهِ، طَهِّرْنِي، فَلَعَلَّكَ أَنْ تَرْدُدَنِي كَمَا رَدَدْتَ مَاعِزَ بْنَ مَالِكٍ، فَوَاللَّهِ إِنِّي لَحُبْلَى، فَقَالَ لَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" ارْجِعِي، حَتَّى تَلِدِي \".\nفَلَمَّا وَلَدَتْ، جَاءَتْ بِالصَّبِيِّ تَحْمِلُهُ فِي خِرْقَةٍ، فَقَالَتْ : يَا نَبِيَّ اللَّهِ هَذَا قَدْ وَلَدْتُ، قَالَ : \" فَاذْهَبِي فَأَرْضِعِيهِ، ثُمَّ افْطُمِيهِ \".\nفَلَمَّا فَطَمَتْهُ، جَاءَتْهُ بِالصَّبِيِّ فِي يَدِهِ كِسْرَةُ خُبْزٍ، فَقَالَتْ : يَا نَبِيَّ اللَّهِ، قَدْ فَطَمْتُهُ، فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالصَّبِيِّ فَدُفِعَ إِلَى رَجُلٍ مِنَ الْمُسْلِمِينَ، وَأَمَرَ بِهَا فَحُفِرَ لَهَا حُفْرَةٌ، فَجُعِلَتْ فِيهَا إِلَى صَدْرِهَا، ثُمَّ أَمَرَ النَّاسَ أَنْ يَرْجُمُوهَا، فَأَقْبَلَ خَالِدُ بْنُ الْوَلِيدِ بِحَجَرٍ فَرَمَى رَأْسَهَا، فَتَلَطَّخَ الدَّمُ عَلَى وَجْنَةِ خَالِدِ بْنِ الْوَلِيدِ، فَسَبَّهَا، فَسَمِعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَبَّهُ إِيَّاهَا، فَقَالَ : \" مَهْ يَا خَالِدُ،لَا تَسُبَّهَا، فَوَالَّذِي نَفْسِي بِيَدِهِ، لَقَدْ تَابَتْ تَوْبَةً، لَوْ تَابَهَا صَاحِبُ مَكْسٍ، لَغُفِرَ لَهُ \".\nفَأَمَرَ بِهَا فَصُلِّيَ عَلَيْهَا، وَدُفِنَتْ",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Nu'aim, telah menceritakan kepada kami Bashir bin al-Muhajir, telah menceritakan kepadaku Abdullah bin Buraidah, daripada ayahnya, dia berkata: \"Saya sedang duduk bersama Nabi ﷺ, lalu datang seorang wanita dari Bani Ghamid, dan berkata: \"Wahai Nabi Allah, sesungguhnya aku telah berzina, dan aku ingin engkau menyucikan aku.\" Maka Nabi ﷺ berkata kepadanya: \"Kembalilah.\" \n\nKetika hari berikutnya, wanita itu datang lagi kepadanya, dan mengaku berzina di hadapannya, lalu berkata: \"Wahai Nabi Allah, sucikanlah aku, semoga engkau tidak menolakku sebagaimana engkau menolak Ma'iz bin Malik. Demi Allah, sesungguhnya aku sedang hamil.\" Maka Nabi ﷺ berkata kepadanya: \"Kembalilah, hingga kamu melahirkan.\" \n\nKetika dia telah melahirkan, dia datang membawa bayi itu dengan membungkusnya dalam kain, lalu berkata: \"Wahai Nabi Allah, ini aku telah melahirkan.\" Baginda bersabda: \"Pergilah dan susukan dia, kemudian ceraikan dia dari susu.\" \n\nKetika dia telah menceraikannya dari susu, dia datang kepada Nabi ﷺ membawa bayi itu dengan sepotong roti di tangannya, lalu berkata: \"Wahai Nabi Allah, aku telah menceraikannya dari susu.\" Maka Nabi ﷺ memerintahkan agar bayi itu diserahkan kepada seorang lelaki dari kalangan Muslimin, dan memerintahkan agar dibuatkan lubang untuk wanita itu, lalu dia dimasukkan ke dalamnya hingga dadanya, kemudian Baginda memerintahkan orang ramai untuk merejamnya. Maka Khalid bin al-Walid datang dengan membawa batu lalu melempar kepalanya, sehingga darah memercik ke pipi Khalid bin al-Walid, lalu Khalid mencacinya. Maka Nabi ﷺ mendengar cacian Khalid kepadanya, lalu Baginda bersabda: \"Tenang wahai Khalid, jangan mencacinya. Demi Zat yang jiwaku berada di tangan-Nya, sungguh wanita ini telah bertaubat dengan taubat yang sekiranya dilakukan oleh seorang pemungut cukai, nescaya dia akan diampuni.\" \n\nKemudian Baginda memerintahkan agar jenazahnya disolatkan, dan dikebumikan."
  },
  {
    "id": 39139,
    "hadith_number": 1602,
    "tajuk_hadith": "Taubat Wanita dari Juhainah yang Berzina dan Solat Nabi ﷺ ke atasnya",
    "perawi_melayu": "Wahb bin Jarir, Hisyam, Yahya, Abu Qilabah, Abu Al-Muhallab, Imran bin Husain",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ  ، حَدَّثَنَا هِشَامٌ  ، عَنْ يَحْيَى  ، عَنْ أَبِي قِلَابَةَ  ، عَنْ أَبِي الْمُهَلَّبِ  ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ   : أَنَّ امْرَأَةً مِنْ جُهَيْنَةَ أَتَت ِالنَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ حُبْلَى مِنَ الزِّنَاءِ، فَقَالَتْ : يَا رَسُولَ اللَّهِ، إِنِّي أَصَبْتُ حَدًّا فَأَقِمْهُ عَلَيَّ، فَدَعَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلِيَّهَا، فَقَالَ : \" اذْهَبْ فَأَحْسِنْ إِلَيْهَا، فَإِذَا وَضَعَتْ حَمْلَهَا، فَأْتِنِي بِهَا \".\nفَفَعَلَ، فَأَمَرَ بِهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَشُكَّتْ عَلَيْهَا ثِيَابُهَا ثُمَّ أَمَرَ بِهَا فَرُجِمَتْ ثُمَّ صَلَّى عَلَيْهَا، فَقَالَ عُمَرُ : يَا رَسُولَ اللَّهِ أَتُصَلِّي عَلَيْهَا وَقَدْ زَنَتْ؟، فَقَالَ :\" لَقَدْ تَابَتْ تَوْبَةً لَوْ قُسِمَتْ بَيْنَ سَبْعِينَ مِنْ أَهْلِ الْمَدِينَةِ لَوَسِعَتْهُمْ، وَهَلْ وَجَدْتَ أَفْضَلَ مِنْ أَنْ جَادَتْ بِنَفْسِهَا لِلَّهِ G \"",
    "malay_translation": "Telah menceritakan kepada kami Wahb bin Jarir, telah menceritakan kepada kami Hisyam, dari Yahya, dari Abu Qilabah, dari Abu Al-Muhallab, dari Imran bin Husain RA: Bahawa seorang wanita dari Juhainah datang kepada Nabi ﷺ dalam keadaan hamil akibat zina. Wanita itu berkata: Wahai Rasulullah, sesungguhnya aku telah melakukan dosa yang mewajibkan hukuman, maka laksanakanlah hukuman itu ke atas diriku. Rasulullah ﷺ memanggil wali wanita itu dan bersabda: \"Pergilah dan berbuat baiklah kepadanya, apabila dia telah melahirkan kandungannya, maka bawalah dia kepadaku.\" \n\nWali itu pun melakukannya. Kemudian Rasulullah ﷺ memerintahkan agar pakaian wanita itu diikat erat padanya, kemudian memerintahkan agar dia direjam. Kemudian Baginda menyolatkannya. Umar RA berkata: Wahai Rasulullah, adakah engkau menyolatkannya padahal dia telah berzina? Baginda bersabda: \"Sesungguhnya dia telah bertaubat dengan taubat yang jika dibahagikan kepada tujuh puluh orang penduduk Madinah, nescaya taubat itu akan mencukupi mereka. Adakah engkau dapati yang lebih utama daripada dia menyerahkan dirinya untuk Allah?\""
  },
  {
    "id": 39140,
    "hadith_number": 1603,
    "tajuk_hadith": "Hukuman bagi Hamba Perempuan yang Berzina",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ ابْنِ شِهَابٍ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ  ، عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ   وَأَبِي هُرَيْرَةَ   : أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنِ الْأَمَةِ تَزْنِي وَلَمْ تُحْصَنْ، فَقَالَ :\" إِنْ زَنَتْ، فَاجْلِدُوهَا، ثُمَّ إِنْ زَنَتْ فَاجْلِدُوهَا \".\nقَالَ : فَمَا أَدْرِي فِي الثَّالِثَةِ أَوْ فِي الرَّابِعَةِ \" فَبِيعُوهَا وَلَوْ بِضَفِيرٍ \"",
    "malay_translation": "Telah menceritakan kepada kami Khalid bin Makhlad, telah menceritakan kepada kami Malik, dari Ibnu Syihab, dari Ubaidullah bin Abdullah bin Utbah, dari Zaid bin Khalid al-Juhani dan Abu Hurairah: Sesungguhnya Nabi SAW ditanya tentang hamba perempuan yang berzina dan belum berkahwin, maka Baginda bersabda: \"Jika dia berzina, maka sebatlah dia, kemudian jika dia berzina lagi, maka sebatlah dia.\" Perawi berkata: \"Aku tidak tahu pada kali ketiga atau keempat, 'maka juallah dia walaupun dengan harga yang rendah'.\""
  },
  {
    "id": 39141,
    "hadith_number": 1604,
    "tajuk_hadith": "Hukuman Zina: Perbezaan antara Perawan dan Janda",
    "perawi_melayu": "Ubadah bin As-Samit RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا بِشْرُ بْنُ عُمَرَ الزَّهْرَانِيُّ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ قَتَادَةَ  ، عَنْ الْحَسَنِ  ، عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ  ،  عَنْ عُبَادَةَ بْنِ الصَّامِتِ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" خُذُوا عَنِّي خُذُوا عَنِّي.\nقَدْ جَعَلَ اللَّهُ لَهُنَّ سَبِيلًا : الْبِكْرُ بِالْبِكْرِ، وَالثَّيِّبُ بِالثَّيِّبِ : الْبِكْرُ جَلْدُ مِائَةٍ وَنَفْيُ سَنَةٍ، وَالثَّيِّبُ جَلْدُ مِائَةٍ وَالرَّجْمُ \"، أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ  ، أَخْبَرَنَا هُشَيْمٌ  ، عَنْ مَنْصُورٍ  ، عَنْ الْحَسَنِ  ، عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ  ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ",
    "malay_translation": "Bishr bin Umar Az-Zahrani telah memberitahu kami, katanya: Hammad bin Salamah telah menceritakan kepada kami, daripada Qatadah, daripada Al-Hasan, daripada Hittan bin Abdullah, daripada Ubadah bin As-Samit RA: Sesungguhnya Rasulullah SAW bersabda: \"Ambillah dariku, ambillah dariku (pelajarilah dariku).\nSesungguhnya Allah telah menetapkan jalan (hukum) bagi mereka (pezina):  Bagi perawan (yang berzina) dengan perawan (yang berzina), dan janda (yang berzina) dengan janda (yang berzina): Hukuman bagi perawan adalah sebatan seratus kali dan pengasingan selama setahun, dan hukuman bagi janda adalah sebatan seratus kali dan rejam.\" Amr bin Aun telah memberitahu kami, katanya: Hushaim telah memberitahu kami, daripada Mansur, daripada Al-Hasan, daripada Hittan bin Abdullah, daripada Ubadah bin As-Samit RA, daripada Nabi SAW dengan yang serupa."
  },
  {
    "id": 39142,
    "hadith_number": 1605,
    "tajuk_hadith": "Hukuman bagi Pemuda yang Melakukan Persetubuhan dengan Hamba Perempuan Isteri Majikannya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ حَمَّادٍ  ، حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ  ، عَنْ قَتَادَةَ  ، قَالَ : كَتَبَ إِلَيَّ خَالِدُ بْنُ عُرْفُطَةَ  عَنْ حَبِيبِ بْنِ سَالِمٍ  : أَنَّ غُلَامًا كَانَ يُنْبَزُ قُرْقُورًا، فَوَقَعَ عَلَى جَارِيَةِ امْرَأَتِهِ، فَرُفِعَ إِلَى النُّعْمَانِ بْنِ بَشِيرٍ  ، فَقَالَ : لَأَقْضِيَنَّ فِيهِ بِقَضَاءٍ شَافٍ :\" إِنْ كَانَتْ أَحَلَّتْهَا لَهُ جَلَدْتُهُ مِائَةً، وَإِنْ كَانَتْ لَمْ تُحِلَّهَا لَهُ، رَجَمْتُهُ \"، فَقِيلَ لَهَا : زَوْجُكِ !، فَقَالَتْ : إِنِّي قَدْ أَحْلَلْتُهَا لَهُ.\nفَضَرَبَهُ مِائَةً.\n قَالَ يَحْيَى : هُوَ مَرْفُوعٌ.\nحَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ  ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ  ، عَنْ شُعْبَةَ  ، عَنْ أَبِي بِشْرٍ  ، عَنْ خَالِدِ بْنِ عُرْفُطَةَ  ، عَنْ حَبِيبِ بْنِ سَالِمٍ  ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Yahya bin Hammad, telah menceritakan kepada kami Aban bin Yazid, daripada Qatadah, dia berkata: Khalid bin 'Urfutah menulis kepadaku daripada Habib bin Salim: Bahawa seorang pemuda yang dipanggil Qurqur, telah melakukan persetubuhan dengan hamba perempuan isterinya. Perkara itu diangkat kepada Nu'man bin Bashir, lalu dia berkata: \"Aku akan menghukumnya dengan hukuman yang memuaskan: Jika isterinya menghalalkannya untuknya, aku akan mencambuknya seratus kali, dan jika isterinya tidak menghalalkannya, aku akan merejamnya.\" Lalu dikatakan kepada isterinya: Suamimu! Dia berkata: \"Sesungguhnya aku telah menghalalkannya untuknya.\" Maka dia mencambuknya seratus kali. Yahya berkata: Ia adalah marfu'. Telah menceritakan kepada kami Sadaqah bin al-Fadl, telah mengkhabarkan kepada kami Muhammad bin Ja'far, daripada Syu'bah, daripada Abi Bisyr, daripada Khalid bin 'Urfutah, daripada Habib bin Salim, daripada Nu'man bin Bashir, daripada Nabi صلى الله عليه وسلم sepertinya."
  },
  {
    "id": 39143,
    "hadith_number": 1606,
    "tajuk_hadith": "Keampunan Dosa dengan Pelaksanaan Hukuman Had",
    "perawi_melayu": "Diriwayatkan oleh Marwan bin Muhammad Ad-Dimasyqi, Ibn Wahb, Usamah bin Zaid, Muhammad bin Al-Munkadir, Ibn Khuzaimah bin Thabit, daripada ayahnya.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مَرْوَانُ بْنُ مُحَمَّدٍ الدِّمَشْقِيُّ  ، حَدَّثَنَا ابْنُ وَهْبٍ  ، عَنْ أُسَامَةَ بْنِ زَيْدٍ  ، عَنْ مُحَمَّدِ بْنِ الْمُنَكْدِرِ  ، عَنْ ابْنِ خُزَيْمَةَ بْنِ ثَابِتٍ  ، عَنْ أَبِيهِ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَنْ أُقِيمَ عَلَيْهِ حَدٌّ، غُفِرَ لَهُ ذَلِكَ الذَّنْبُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Marwan bin Muhammad Ad-Dimasyqi, telah menceritakan kepada kami Ibn Wahb, daripada Usamah bin Zaid, daripada Muhammad bin Al-Munkadir, daripada Ibn Khuzaimah bin Thabit, daripada ayahnya, dia berkata: Rasulullah SAW bersabda: \"Sesiapa yang ditegakkan ke atasnya hukuman had, maka diampuni baginya dosa itu.\""
  }
]
