[
  {
    "id": 38467,
    "hadith_number": 930,
    "tajuk_hadith": "Perutusan Mu'adz ke Yaman dan Kewajipan Utama kepada Ahli Kitab",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو عَاصِمٍ  ، عَنْ زَكَرِيَّا بْنِ إِسْحَاق  ، عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ صَيْفِيٍّ  ، عَنْ أَبِي مَعْبَدٍ  ، عَنْ ابْنِ عَبَّاسٍ   : أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا بَعَثَ مُعَاذًا إِلَى الْيَمَنِ ، فَقَالَ : \" إِنَّكَتَأْتِي قَوْمًا أَهْلَ كِتَابٍ ، فَادْعُهُمْ إِلَى أَنْ يَشْهَدُوا أَنْ لَا إِلَهَ إِلَّا اللَّهُ، وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، فَإِنْ أَطَاعُوا لَكَ فِي ذَلِكَ، فَأَخْبِرْهُمْ أَنَّ اللَّهَ فَرَضَ عَلَيْهِمْ خَمْسَ صَلَوَاتٍ فِي كُلِّ يَوْمٍ وَلَيْلَةٍ، فَإِنْ هُمْ أَطَاعُوا لَكَ فِي ذَلِكَ، فَأَخْبِرْهُمْ أَنَّ اللَّهَ فَرَضَ عَلَيْهِمْ صَدَقَةً فِي أَمْوَالِهِمْ، تُؤْخَذُ مِنْ أَغْنِيَائِهِمْ وَتُرَدُّ عَلَى فُقَرَائِهِمْ، فَإِنْ هُمْ أَطَاعُوا لَكَ فِي ذَلِكَ، فَإِيَّاكَ وَكَرَائِمَ أَمْوَالِهِمْ، وَإِيَّاكَ وَدَعْوَةَ الْمَظْلُومِ، فَإِنَّهُ لَيْسَ لَهَا مِنْ دُونِ اللَّهِ حِجَابٌ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu 'Asim, daripada Zakaria bin Ishaq, daripada Yahya bin Abdullah bin Saifi, daripada Abu Ma'bad, daripada Ibnu Abbas RA: Bahawa Nabi SAW ketika mengutus Mu'adz RA ke Yaman, Baginda bersabda: \"Sesungguhnya engkau akan mendatangi kaum Ahli Kitab. Ajaklah mereka untuk bersaksi bahawa tidak ada Tuhan yang berhak disembah melainkan Allah, dan bahawa Muhammad adalah utusan Allah. Jika mereka mentaatimu dalam hal itu, maka beritahulah mereka bahawa Allah telah mewajibkan ke atas mereka solat lima waktu setiap hari dan malam. Jika mereka mentaatimu dalam hal itu, maka beritahulah mereka bahawa Allah telah mewajibkan ke atas mereka sedekah (zakat) pada harta mereka, yang diambil daripada orang-orang kaya mereka dan diberikan kepada orang-orang miskin mereka. Jika mereka mentaatimu dalam hal itu, maka jauhilah olehmu harta-harta terbaik (pilihan) mereka, dan jauhilah doa orang yang dizalimi, kerana sesungguhnya tidak ada hijab (penghalang) antara doanya dengan Allah.\""
  },
  {
    "id": 38468,
    "hadith_number": 931,
    "tajuk_hadith": "Definisi Sebenar Orang Miskin",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah RA daripada Nabi SAW",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا هَاشِمُ بْنُ الْقَاسِمِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ  ، قَالَ : سَمِعْتُ أَبَا هُرَيْرَةَ   يُحَدِّثُ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، أَنَّهُ قَالَ :\" لَيْسَ الْمِسْكِينُ الَّذِي تَرُدُّهُ اللُّقْمَةُ وَاللُّقْمَتَانِ، وَالْكِسْرَةُ وَالْكِسْرَتَانِ، وَالتَّمْرَةُ وَالتَّمْرَتَانِ، وَلَكِنْ الْمِسْكِينُ الَّذِي لَيْسَ لَهُ غِنًى يُغْنِيهِ، يَسْتَحْيِي أَنْ يَسْأَلَ النَّاسَ إِلْحَافًا، أَوْ لَا يَسْأَلُ النَّاسَ إِلْحَافًا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Hasyim bin al-Qasim, telah menceritakan kepada kami Syu'bah, daripada Muhammad bin Ziyad, dia berkata: Aku mendengar Abu Hurairah RA meriwayatkan daripada Nabi SAW, bahawa Baginda bersabda: \"Bukanlah miskin itu orang yang ditolak dengan sesuap atau dua suap makanan, sepotong atau dua potong roti, sebiji atau dua biji kurma. Akan tetapi, miskin yang sebenarnya adalah orang yang tidak mempunyai kekayaan yang mencukupinya, dia malu untuk meminta-minta kepada orang ramai dengan mendesak, atau dia tidak meminta-minta kepada orang ramai dengan mendesak.\""
  },
  {
    "id": 38469,
    "hadith_number": 932,
    "tajuk_hadith": "Balasan bagi Mereka yang Tidak Menunaikan Hak Harta Ternakan",
    "perawi_melayu": "Diriwayatkan daripada Jabir RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَعْلَى بْنُ عُبَيْدٍ  ، حَدَّثَنَا عَبْدُ الْمَلِكِ  ، عَنْ أَبِي الزُّبَيْرِ  ، عَنْ جَابِرٍ  ، قَالَ : قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَا مِنْ صَاحِبِ إِبِلٍ وَلَا بَقَرٍ وَلَا غَنَمٍ لَا يُؤَدِّي حَقَّهَا، إِلَّا أُقْعِدَ لَهَا يَوْمَ الْقِيَامَةِ بِقَاعٍ قَرْقَرٍ تَطَؤُهُ ذَاتُ الظِّلْفِ بِظِلْفِهَا، وَتَنْطَحُهُ ذَاتُ الْقَرْنِ بِقَرْنِهَا، لَيْسَ فِيهَا يَوْمَئِذٍ جَمَّاءُ وَلَا مَكْسُورَةُ الْقَرْنِ \".\nقَالُوا : يَا رَسُولَ اللَّهِ، وَمَا حَقُّهَا؟ قَالَ : \" إِطْرَاقُ فَحْلِهَا، وَإِعَارَةُ دَلْوِهَا، وَمِنْحَتُهَا، وَحَلَبُهَا عَلَى الْمَاءِ، وَحَمْلٌ عَلَيْهَا فِي سَبِيلِ اللَّهِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ya'la bin Ubaid, telah menceritakan kepada kami Abdul Malik, daripada Abu al-Zubair, daripada Jabir, dia berkata: Nabi SAW bersabda: \"Tidak ada seorang pun pemilik unta, lembu, atau kambing yang tidak menunaikan haknya, melainkan dia akan didudukkan untuknya pada Hari Kiamat di tanah lapang yang luas, di mana binatang yang berkuku akan memijaknya dengan kukunya, dan binatang yang bertanduk akan menanduknya dengan tanduknya, tidak ada pada hari itu binatang yang tidak bertanduk atau patah tanduknya.\"\nMereka bertanya: \"Wahai Rasulullah, apakah haknya?\" Baginda bersabda: \"Membiarkan pejantannya mengawan, meminjamkan timbanya, memberikan susunya, memerah susunya di air, dan membawanya di jalan Allah.\""
  },
  {
    "id": 38470,
    "hadith_number": 933,
    "tajuk_hadith": "Ancaman bagi Mereka yang Tidak Menunaikan Hak pada Harta Mereka",
    "perawi_melayu": "Diriwayatkan oleh Jabir bin Abdullah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا بِشْرُ بْنُ الْحَكَمِ  ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ  ، أَخْبَرَنَا ابْنُ جُرَيْجٍ  ، قَالَ : أَخْبَرَنِي أَبُو الزُّبَيْرِ  ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ  ، يَقُولُ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ :\" مَا مِنْ صَاحِبِ إِبِلٍ لَا يَفْعَلُ فِيهَا حَقَّهَا، إِلَّا جَاءَ يَوْمَ الْقِيَامَةِ أَكْثَرُ مَا كَانَتْ قَطُّ، وَأُقْعِدَ لَهَا بِقَاعٍ قَرْقَرٍ تَسْتَنُّ عَلَيْهِ بِقَوَائِمِهَا وَأَخْفَافِهَا، وَلَا صَاحِبِ بَقَرٍ لَا يَفْعَلُ فِيهَا حَقَّهَا، إِلَّا جَاءَ يَوْمَ الْقِيَامَةِ أَكْثَرُ مَا كَانَتْ، وَأُقْعِدَ لَهَا بِقَاعٍ قَرْقَرٍ، تَنْطَحُهُ بِقُرُونِهَا وَتَطَؤُهُ بِقَوَائِمِهَا، وَلَا صَاحِبِ غَنَمٍ لَا يَفْعَلُ فِيهَا حَقَّهَا، إِلَّا جَاءَتْ يَوْمَ الْقِيَامَةِ أَكْثَرُ مَا كَانَتْ، وَأُقْعِدَ لَهَا بِقَاعٍ قَرْقَرٍ، تَنْطَحُهُ بِقُرُونِهَا وَتَطَؤُهُ بِأَظْلَافِهَا، لَيْسَ فِيهَا جَمَّاءُ وَلَا مَكْسُورٍ قَرْنُهَا، وَلَا صَاحِبِ كَنْزٍ لَا يَفْعَلُ فِيهِ حَقَّهُ، إِلَّا جَاءَ كَنْزُهُ يَوْمَ الْقِيَامَةِ شُجَاعًا أَقْرَعَ يَتْبَعُهُ فَاتِحًا فَاهُ، فَإِذَا أَتَاهُ، فَرَّ مِنْهُ، فَيُنَادِيهِ : خُذْ كَنْزَكَ الَّذِي خَبَّأْتَهُ.\nقَالَ : فَأَنَا عَنْهُ غَنِيٌّ، فَإِذَا رَأَى أَنَّهُ لَابُدَّ مِنْهُ، سَلَكَ يَدَهُ فِي فَمِهِ فَيَقْضِمُهَا قَضْمَ الْفَحْلِ \".\nقَالَ أَبُو الزُّبَيْرِ : سَمِعْتُ عُبَيْدَ بْنَ عُمَيْرٍ، يَقُولُ هَذَا الْقَوْلَ، ثُمَّ سَأَلْنَا جَابِرَ بْنَ عَبْدِ اللَّهِ، فَقَالَ مِثْلَ قَوْلِ عُبَيْدِ بْنِ عُمَيْرٍ",
    "malay_translation": "Telah menceritakan kepada kami Bisyr bin al-Hakam, telah menceritakan kepada kami Abdur Razzaq, telah mengkhabarkan kepada kami Ibnu Juraij, dia berkata: Telah mengkhabarkan kepadaku Abu az-Zubair, bahawa dia mendengar Jabir bin Abdullah berkata: Aku mendengar Rasulullah SAW bersabda: \"Tidaklah seorang pemilik unta yang tidak menunaikan haknya, melainkan unta itu akan datang pada Hari Kiamat dalam keadaan paling banyak yang pernah ada, lalu ia didudukkan di tanah yang luas dan datar, dan unta itu akan menginjak-injaknya dengan kaki dan telapaknya. Tidaklah seorang pemilik lembu yang tidak menunaikan haknya, melainkan lembu itu akan datang pada Hari Kiamat dalam keadaan paling banyak yang pernah ada, lalu ia didudukkan di tanah yang luas dan datar, dan lembu itu akan menanduknya dengan tanduknya dan menginjak-injaknya dengan kakinya. Tidaklah seorang pemilik kambing yang tidak menunaikan haknya, melainkan kambing itu akan datang pada Hari Kiamat dalam keadaan paling banyak yang pernah ada, lalu ia didudukkan di tanah yang luas dan datar, dan kambing itu akan menanduknya dengan tanduknya dan menginjak-injaknya dengan kukunya, tidak ada kambing yang tidak bertanduk atau patah tanduknya. Tidaklah seorang pemilik harta simpanan yang tidak menunaikan haknya, melainkan harta simpanannya itu akan datang pada Hari Kiamat berupa ular jantan yang botak kepalanya, mengejarnya sambil membuka mulutnya. Apabila ular itu mendatanginya, dia lari daripadanya, lalu ular itu memanggilnya: 'Ambillah harta simpananmu yang kamu sembunyikan.' Dia berkata: 'Aku tidak memerlukannya.' Apabila dia melihat bahawa dia pasti menghadapinya, dia memasukkan tangannya ke dalam mulut ular itu, lalu ular itu menggigitnya sebagaimana lembu jantan menggigit.\" Abu az-Zubair berkata: Aku mendengar Ubaid bin Umair mengatakan perkataan ini, kemudian kami bertanya kepada Jabir bin Abdullah, lalu dia mengatakan seperti perkataan Ubaid bin Umair."
  },
  {
    "id": 38471,
    "hadith_number": 934,
    "tajuk_hadith": "Hak Unta dalam Islam",
    "perawi_melayu": "Diriwayatkan oleh Abu Zubair: Saya mendengar Ubaid bin Umair berkata: Seorang lelaki bertanya: Wahai Rasulullah, apakah hak unta? Baginda bersabda: 'Memerah susunya di sumber air, meminjamkan timbanya, meminjamkan pejantannya, memberikannya sebagai hadiah, dan membawanya (sebagai tunggangan) di jalan Allah.'",
    "english_text": "",
    "arabic_text": "قَالَ : وَقَالَ أَبُو الزُّبَيْرِ  : سَمِعْتُ عُبَيْدَ بْنَ عُمَيْرٍ   يَقُولُ : قَالَ رَجُلٌ : يَا رَسُولَ اللَّهِ، مَا حَقُّ الْإِبِلِ؟ قَالَ :\" حَلَبُهَا عَلَى الْمَاءِ، وَإِعَارَةُ دَلْوِهَا، وَإِعَارَةُ فَحْلِهَا، وَمَنْحَتُهَا، وَحَمْلٌ عَلَيْهَا فِي سَبِيلِ اللَّهِ \"أَخْبَرَنَا الْحَسَنُ بْنُ الرَّبِيعِ  ، حَدَّثَنَا أَبُو الْأَحْوَصِ  ، عَنْ الْأَعْمَشِ  ، عَنْ الْمَعْرُورِ بْنِ سُوَيْدٍ  عَنْ أَبِي ذَرٍّ   ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ، بِبَعْضِ هَذَا الْحَدِيثِ",
    "malay_translation": "Abu Zubair berkata: Saya mendengar Ubaid bin Umair berkata: Seorang lelaki bertanya: Wahai Rasulullah, apakah hak unta? Baginda bersabda: 'Memerah susunya di sumber air, meminjamkan timbanya, meminjamkan pejantannya, memberikannya sebagai hadiah, dan membawanya (sebagai tunggangan) di jalan Allah.' Telah mengkhabarkan kepada kami Al-Hasan bin Ar-Rabi', telah menceritakan kepada kami Abu Al-Ahwas, daripada Al-A'masy, daripada Al-Ma'rur bin Suwaid, daripada Abu Dzar, daripada Nabi SAW, dengan sebahagian hadis ini."
  },
  {
    "id": 38472,
    "hadith_number": 935,
    "tajuk_hadith": "Kadar Zakat Ternakan Kambing",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ  ، حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ  ، وَإِبْرَاهِيمُ بْنُ صَدَقَةَ  ، عَنْ سُفْيَانَ بْنِ حُسَيْنٍ  ، عَنْ الزُّهْرِيِّ  ، عَنْ سَالِمٍ  ، عَنْ ابْنِ عُمَرَ  ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" كَتَبَ الصَّدَقَةَ، فَكَانَ فِي الْغَنَمِ فِي كُلِّ أَرْبَعِينَ سَائِمَةً شَاةٌ إِلَى عِشْرِينَ وَمِئَةٍ، فَإِذَا زَادَتْ، فَفِيهَا شَاتَانِ إِلَى مِائَتَيْنِ، فَإِذَا زَادَتْ، فَفِيهَا ثَلَاثُ شِيَاهٍ إِلَى ثَلَاثِ مِئَةٍ، فَإِذَا زَادَتْ شَاةً، لَمْ يَجِبْ فِيهَا إِلَّا ثَلَاثُ شِيَاهٍ حَتَّى تَبْلُغَ أَرْبَعَ مِئَةٍ، فَإِذَا بَلَغَتْ أَرْبَعَ مِئَةِ شَاةٍ، فَفِي كُلِّ مِئَةٍ شَاةٌ، وَلَا تُؤْخَذُ فِي الصَّدَقَةِ هَرِمَةٌ، وَلَا ذَاتُ عَوَارٍ، وَلَا ذَاتُ عَيْبٍ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Hakam bin al-Mubarak, telah menceritakan kepada kami 'Abbad bin al-'Awwam dan Ibrahim bin Sadaqah, daripada Sufyan bin Husain, daripada al-Zuhri, daripada Salim, daripada Ibn Umar, bahawa Nabi SAW menulis tentang sedekah (zakat). Maka, bagi kambing, pada setiap empat puluh ekor kambing yang meragut, dikenakan satu ekor kambing sehingga seratus dua puluh ekor. Apabila bertambah, maka dikenakan dua ekor kambing sehingga dua ratus ekor. Apabila bertambah, maka dikenakan tiga ekor kambing sehingga tiga ratus ekor. Apabila bertambah seekor kambing, maka tidak wajib dikenakan kecuali tiga ekor kambing sehingga mencapai empat ratus ekor. Apabila mencapai empat ratus ekor kambing, maka pada setiap seratus ekor dikenakan satu ekor kambing. Dan tidak boleh diambil dalam sedekah (zakat) kambing yang tua, yang cacat, atau yang aib."
  },
  {
    "id": 38473,
    "hadith_number": 936,
    "tajuk_hadith": "Kadar Zakat Kambing dalam Surat Nabi kepada Penduduk Yaman",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ مُوسَى  ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ  ، عَنْ سُلَيْمَانَ بْنِ دَاوُدَ الْخَوْلَانِيِّ  ، عَنْ الزُّهْرِيِّ  ، عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ  ، عَنْ أَبِيهِ  ، عَنْ جَدِّهِ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى أَهْلِ الْيَمَنِ مَعَ عَمْرِو بْنِ حَزْمٍ :\" بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ، مِنْ مُحَمَّدٍ النَّبِيِّ إِلَى شُرَحْبِيلَ بْنِ عَبْدِ كُلَالٍ، وَالْحَارِثِ بْنِ عَبْدِ كُلَالٍ، وَنُعَيْمِ بْنِ عَبْدِ كُلَالٍ، فِي أَرْبَعِينَ شَاةً شَاةٌ إِلَى أَنْ تَبْلُغَ عِشْرِينَ وَمِئَةٍ، فَإِذَا زَادَتْ عَلَى عِشْرِينَ وَمِئَةٍ وَاحِدَةً، فَفِيهَا شَاتَانِ إِلَى أَنْ تَبْلُغَ مِائَتَيْنِ، فَإِذَا زَادَتْ وَاحِدَةً فَفِيهَا ثَلَاثَةٌ إِلَى أَنْ تَبْلُغَ ثَلَاثَ مِئَةٍ، فَمَا زَادَ، فَفِي كُلِّ مِئَةِ شَاةٍ شَاةٌ \".\nحَدَّثَنَا بِشْرُ بْنُ الْحَكَمِ  ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ  ، أَخْبَرَنَا مَعْمَرٌ  ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ  ، عَنْ أَبِيهِ  ، عَنْ جَدِّهِ  ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ لَهُمْ كِتَابًا، فَذَكَرَ نَحْوَهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Al-Hakam bin Musa, telah menceritakan kepada kami Yahya bin Hamzah, daripada Sulaiman bin Daud Al-Khaulani, daripada Az-Zuhri, daripada Abu Bakar bin Muhammad bin Amru bin Hazm, daripada ayahnya, daripada datuknya, bahawa Rasulullah SAW telah menulis surat kepada penduduk Yaman bersama Amru bin Hazm: \"Dengan nama Allah Yang Maha Pemurah lagi Maha Penyayang, daripada Muhammad Nabi kepada Syurahbil bin Abd Kulal, Al-Harith bin Abd Kulal, dan Nu'aim bin Abd Kulal, bagi setiap empat puluh ekor kambing, satu ekor kambing (zakat) sehingga mencapai seratus dua puluh ekor. Jika bertambah lebih daripada seratus dua puluh satu ekor, maka padanya dua ekor kambing sehingga mencapai dua ratus ekor. Jika bertambah satu ekor, maka padanya tiga ekor sehingga mencapai tiga ratus ekor, dan apa-apa yang bertambah, maka bagi setiap seratus ekor kambing, satu ekor kambing (zakat).\". Telah menceritakan kepada kami Bisyr bin Al-Hakam, telah menceritakan kepada kami Abdul Razzaq, telah mengkhabarkan kepada kami Ma'mar, daripada Abdullah bin Abu Bakar bin Muhammad bin Amru bin Hazm, daripada ayahnya, daripada datuknya, bahawa Nabi SAW telah menulis untuk mereka surat, lalu menyebutkan seumpamanya."
  },
  {
    "id": 38474,
    "hadith_number": 937,
    "tajuk_hadith": "Zakat Lembu: Setiap Empat Puluh Ekor Lembu Diambil Musinnah, Setiap Tiga Puluh Ekor Diambil Tabii'",
    "perawi_melayu": "Ya'la bin Ubaid, daripada Al-A'mash, daripada Shaqiq, daripada Masruq. Al-A'mash, daripada Ibrahim, mereka berdua berkata: Mu'az berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ  ، حَدَّثَنَا الْأَعْمَشُ  ، عَنْ شَقِيقٍ  ، عَنْ مَسْرُوقٍ  ، وَالْأَعْمَشُ  ، عَنْ إِبْرَاهِيمَ  ، قَالَا : قَالَ مُعَاذٌ   : \" بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَمَنِفَأَمَرَنِي أَنْ آخُذَ مِنْ كُلِّ أَرْبَعِينَ بَقَرَةً، مُسِنَّةً، وَمِنْ كُلِّ ثَلَاثِينَ تَبِيعًا أَوْ تَبِيعَةً \"",
    "malay_translation": "Ya'la bin Ubaid meriwayatkan kepada kami, Al-A'mash meriwayatkan kepada kami, daripada Shaqiq, daripada Masruq, dan Al-A'mash, daripada Ibrahim, mereka berdua berkata: Mu'az berkata: \"Rasulullah SAW mengutusku ke Yaman, dan Baginda memerintahkanku untuk mengambil daripada setiap empat puluh ekor lembu, seekor *musinnah* (lembu betina yang berumur tiga tahun atau lebih), dan daripada setiap tiga puluh ekor, seekor *tabii'* (lembu jantan berumur setahun) atau *tabi'ah* (lembu betina berumur setahun).\""
  },
  {
    "id": 38475,
    "hadith_number": 938,
    "tajuk_hadith": "Arahan Rasulullah SAW kepada Muadz tentang Zakat Lembu di Yaman",
    "perawi_melayu": "Asim bin Yusuf, daripada Abu Bakr bin Ayyash, daripada Asim, daripada Abi Wa'il, daripada Masruq, daripada Muadz",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَاصِمُ بْنُ يُوسُف  ، حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ  ، عَنْ عَاصِمٍ  ، عَنْ أَبِي وَائِلٍ  ، عَنْ مَسْرُوقٍ  ، عَنْ مُعَاذٍ  ، قَالَ : \" بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَمَنِ ،فَأَمَرَنِي أَنْ آخُذَ مِنْ الْبَقَرِ مِنْ ثَلَاثِينَ تَبِيعًا حَوْلِيًّا، وَمِنْ أَرْبَعِينَ بَقَرَةً مُسِنَّةً \".\nحَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ  ، عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ  ، بِنَحْوِهِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Asim bin Yusuf, telah menceritakan kepada kami Abu Bakr bin Ayyash, daripada Asim, daripada Abi Wa'il, daripada Masruq, daripada Muadz, dia berkata: \"Rasulullah SAW telah mengutusku ke Yaman, dan memerintahkan aku untuk mengambil daripada lembu, daripada setiap tiga puluh ekor lembu jantan yang berumur setahun, dan daripada empat puluh ekor lembu betina yang dewasa.\"\nTelah menceritakan kepada kami Ahmad bin Yunus, daripada Abu Bakr bin Ayyash, dengan seumpamanya."
  },
  {
    "id": 38476,
    "hadith_number": 939,
    "tajuk_hadith": "Pencatatan Sedekah dan Pengamalannya Selepas Kewafatan Nabi SAW",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ  ، حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ  ، وَإِبْرَاهِيمُ بْنُ صَدَقَةَ  ، عَنْ سُفْيَانَ بْنِ حُسَيْنٍ  ، عَنْ الزُّهْرِيِّ  ، عَنْ سَالِمٍ  ، عَنْ ابْنِ عُمَرَ  ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ الصَّدَقَةَ، فَلَمْ تُخْرَجْ إِلَى عُمَّالِهِ حَتَّى قُبِضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَلَمَّا قُبِضَ أَخَذَهَا أَبُو بَكْرٍ، فَعَمِلَ بِهَا مِنْ بَعْدِهِ، فَلَمَّا قُبِضَ أَبُو بَكْرٍ، أَخَذَهَا عُمَرُ فَعَمِلَ بِهَا مِنْ بَعْدِهِمَا، وَلَقَدْ قُتِلَ عُمَرُ وَإِنَّهَا لَمَقْرُونَةٌ بِسَيْفِهِ أَوْ بِوَصِيَّتِهِ، وَكَانَ فِي\" صَدَقَةِ الْإِبِلِ : فِي كُلِّ خَمْسٍ شَاةٌ إِلَى خَمْسٍ وَعِشْرِينَ، فَإِذَا بَلَغَتْ خَمْسًا وَعِشْرِينَ، فَفِيهَا بِنْتُ مَخَاضٍ إِلَى خَمْسٍ وَثَلَاثِينَ، فَإِنْ لَمْ تَكُنْ بِنْتُ مَخَاضٍ، فَابْنُ لَبُونٍ ذَكَرٌ، فَإِذَا زَادَتْ، فَفِيهَا بِنْتُ لَبُونٍ إِلَى خَمْسٍ وَأَرْبَعِينَ، فَإِذَا زَادَتْ، فَفِيهَا حِقَّةٌ إِلَى سِتِّينَ، فَإِذَا زَادَتْ، فَفِيهَا جَذَعَةٌ إِلَى خَمْسٍ وَسَبْعِينَ، فَإِذَا زَادَتْ، فَفِيهَا بِنْتَا لَبُونٍ إِلَى تِسْعِينَ، فَإِذَا زَادَتْ، فِيهَا حِقَّتَانِ إِلَى عِشْرِينَ وَمِئَةٍ، فَإِذَا زَادَتْ، فَفِيهَا فِي كُلِّ خَمْسِينَ حِقَّةٌ، وَفِي كُلِّ أَرْبَعِينَ بِنْتُ لَبُونٍ \".\nحَدَّثَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ  ، عَنْ أَبِي إِسْحَاق الْفَزَارِيِّ  ، عَنْ سُفْيَانَ بْنِ حُسَيْنٍ  ، عَنْ الزُّهْرِيِّ  ، عَنْ سَالِمٍ  ، عَنْ ابْنِ عُمَرَ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، نَحْوَهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Al-Hakam bin Al-Mubarak, telah menceritakan kepada kami 'Abbad bin Al-'Awwam dan Ibrahim bin Sadaqah, daripada Sufyan bin Husain, daripada Az-Zuhri, daripada Salim, daripada Ibn Umar, bahawa Nabi SAW mencatat sedekah, tetapi tidak dikeluarkan kepada petugasnya sehingga Rasulullah SAW wafat. Setelah baginda wafat, Abu Bakar mengambilnya dan mengamalkannya setelah itu. Setelah Abu Bakar wafat, Umar mengambilnya dan mengamalkannya setelah mereka berdua. Sesungguhnya Umar telah dibunuh dan ia (catatan sedekah) terikat pada pedangnya atau wasiatnya. Dan terdapat dalam \"sedekah unta: Setiap lima ekor unta adalah seekor kambing hingga dua puluh lima ekor. Apabila mencapai dua puluh lima ekor, maka padanya bintu makhad (unta betina berumur satu tahun) hingga tiga puluh lima ekor. Jika tidak ada bintu makhad, maka ibnu labun zakar (unta jantan berumur dua tahun). Apabila bertambah, maka padanya bintu labun (unta betina berumur dua tahun) hingga empat puluh lima ekor. Apabila bertambah, maka padanya hiqqah (unta betina berumur tiga tahun) hingga enam puluh ekor. Apabila bertambah, maka padanya jaza'ah (unta betina berumur empat tahun) hingga tujuh puluh lima ekor. Apabila bertambah, maka padanya dua bintu labun hingga sembilan puluh ekor. Apabila bertambah, maka padanya dua hiqqah hingga seratus dua puluh ekor. Apabila bertambah, maka padanya setiap lima puluh ekor adalah satu hiqqah, dan setiap empat puluh ekor adalah satu bintu labun.\"\nTelah menceritakan kepada kami Muhammad bin 'Uyainah, daripada Abi Ishaq Al-Fazari, daripada Sufyan bin Husain, daripada Az-Zuhri, daripada Salim, daripada Ibn Umar, daripada Nabi SAW, yang serupa dengannya."
  },
  {
    "id": 38477,
    "hadith_number": 940,
    "tajuk_hadith": "Zakat Perak: Kadar dan Nisab",
    "perawi_melayu": "Al-Hakam bin Musa, Yahya bin Hamzah, Sulaiman bin Daud al-Khaulani, Az-Zuhri, Abu Bakar bin Muhammad bin Amru bin Hazm, daripada ayahnya, daripada datuknya",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ مُوسَى  ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ  ، عَنْ سُلَيْمَانَ بْنِ دَاوُدَ الْخَوْلَانِيِّ  ، حَدَّثَنِي الزُّهْرِيُّ  ، عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ  ، عَنْ أَبِيهِ  ، عَنْ جَدِّهِ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ مَعَ عَمْرِو بْنِ حَزْمٍ إِلَى شُرَحْبِيلَ بْنِ عَبْدِ كُلَالٍ، وَالْحَارِثِ بْنِ عَبْدِ كُلَالٍ، وَنُعَيْمِ بْنِ عَبْدِ كُلَالٍ : \" أَنَّفِي كُلِّ خَمْسِ أَوَاقٍ مِنْ الْوَرِقِ خَمْسَةَ دَرَاهِمَ، فَمَا زَادَ، فَفِي كُلِّ أَرْبَعِينَ دِرْهَمًا دِرْهَمٌ، وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ شَيْءٌ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Hakam bin Musa, telah menceritakan kepada kami Yahya bin Hamzah, daripada Sulaiman bin Daud al-Khaulani, telah menceritakan kepadaku az-Zuhri, daripada Abu Bakar bin Muhammad bin Amru bin Hazm, daripada ayahnya, daripada datuknya, bahawa Rasulullah SAW telah menulis bersama Amru bin Hazm kepada Syurahbil bin Abdi Kulal, al-Harith bin Abdi Kulal, dan Nu'aim bin Abdi Kulal: \"Bahawa pada setiap lima *awaq* perak terdapat lima dirham, dan jika lebih daripada itu, maka pada setiap empat puluh dirham terdapat satu dirham, dan tidak ada (zakat) pada yang kurang daripada lima *awaq*.\""
  },
  {
    "id": 38478,
    "hadith_number": 941,
    "tajuk_hadith": "Keringanan Zakat ke atas Kuda dan Hamba, dan Zakat Perak",
    "perawi_melayu": "Diriwayatkan daripada Ali RA, dinaikkan kepada Nabi SAW, Baginda bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْمُعَلَّى بْنُ أَسَدٍ  ، حَدَّثَنَا أَبُو عَوَانَةَ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ عَاصِمِ بْنِ ضَمْرَةَ  ، عَنْ عَلِيٍّ  ، رَفَعَهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" عَفَوْتُ عَنْ صَدَقَةِ الْخَيْلِ وَالرَّقِيقِ، هَاتُوا صَدَقَةَ الرِّقَةِ مِنْ كُلِّ أَرْبَعِينَ دِرْهَمًا دِرْهَمٌ، وَلَيْسَ فِي تِسْعِينَ وَمِئَةٍ شَيْءٌ حَتَّى تَبْلُغَ مِائَتَيْنِ \"",
    "malay_translation": "\"Aku telah memberikan keringanan (tidak mewajibkan) zakat ke atas kuda dan hamba. Tunaikanlah zakat perak (ar-riqqah); bagi setiap empat puluh dirham, (zakatnya adalah) satu dirham. Dan tidak ada (zakat) pada seratus sembilan puluh (dirham) sehingga mencapai dua ratus (dirham).\""
  },
  {
    "id": 38479,
    "hadith_number": 942,
    "tajuk_hadith": "Larangan Mengumpulkan yang Terpisah dan Memisahkan yang Terkumpul Kerana Zakat",
    "perawi_melayu": "Al-Aswad bin 'Amir, daripada Syarik, daripada Uthman ath-Thaqafi, daripada Abu Laila al-Kindi, daripada Suwaid bin Ghafalah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْأَسْوَدُ بْنُ عَامِرٍ  ، حَدَّثَنَا شَرِيكٌ  ، عَنْ عُثْمَانَ الثَّقَفِيِّ  ، عَنْ أَبِي لَيْلَى هُوَ الْكِنْدِيُّ  ،  عَنْ سُوَيْدِ بْنِ غَفَلَةَ  ، قَالَ : أَتَانَا مُصَدِّقُ   النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخَذْتُ بِيَدِهِ، فَقَرَأْتُ فِي عَهْدِهِ : \" أَنْلَا يُجْمَعَ بَيْنَ مُتَفَرِّقٍ، وَلَا يُفَرَّقَ بَيْنَ مُجْتَمِعٍ خَشْيَةَ الصَّدَقَةِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Aswad bin 'Amir, telah menceritakan kepada kami Syarik, daripada Uthman ath-Thaqafi, daripada Abu Laila iaitu al-Kindi, daripada Suwaid bin Ghafalah, beliau berkata: Telah datang kepada kami seorang pemungut zakat (mussaddiq) Nabi SAW, lalu aku memegang tangannya, dan aku membaca dalam perjanjiannya: \"Janganlah dikumpulkan antara yang terpisah, dan janganlah dipisahkan antara yang berkumpul kerana takut (mengurangkan) zakat.\""
  },
  {
    "id": 38480,
    "hadith_number": 943,
    "tajuk_hadith": "Larangan Mengambil Harta Terbaik Mereka (Zakat)",
    "perawi_melayu": "Diriwayatkan dari Ibnu Abbas RA, bahawa Nabi SAW bersabda ketika mengutus Mu'adz ke Yaman:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ زَكَرِيَّا  ، عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ صَيْفِيٍّ  ، عَنْ أَبِي مَعْبَدٍ  مَوْلَى ابْنِ عَبَّاسٍ، عَنْ ابْنِ عَبَّاسٍ  ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا بَعَثَ مُعَاذًا إِلَى الْيَمَنِ ، قَالَ :\" إِيَّاكَ وَكَرَائِمَ أَمْوَالِهِمْ \"",
    "malay_translation": "Abu Asim memberitahu kami, daripada Zakaria, daripada Yahya bin Abdullah bin Saifi, daripada Abu Ma'bad, hamba Ibnu Abbas, daripada Ibnu Abbas, bahawa Nabi SAW ketika mengutus Mu'adz ke Yaman, bersabda: \"Jauhilah (mengambil) harta mereka yang paling berharga (sebagai zakat).\""
  },
  {
    "id": 38481,
    "hadith_number": 944,
    "tajuk_hadith": "Tidak Diwajibkan Zakat ke atas Kuda Muslim dan Hamba Abdi",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah RA, daripada Nabi SAW",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ  ، حَدَّثَنَا شُعْبَةُ  قَالَ : عَبْدُ اللَّهِ بْنُ دِينَارٍ  أَخْبَرَنِي، قَالَ : سَمِعْتُ سُلَيْمَانَ بْنَ يَسَارٍ  يُحَدِّثُ، عَنْ عِرَاكِ بْنِ مَالِكٍ  ،  عَنْ أَبِي هُرَيْرَةَ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" لَيْسَ عَلَى فَرَسِ الْمُسْلِمِ وَلَا عَلَى غُلَامِهِ صَدَقَةٌ \"",
    "malay_translation": "Telah menceritakan kepada kami Hasyim bin al-Qasim, telah menceritakan kepada kami Syu'bah, dia berkata: Abdullah bin Dinar telah mengkhabarkan kepadaku, dia berkata: Aku mendengar Sulaiman bin Yasar meriwayatkan daripada 'Irak bin Malik, daripada Abu Hurairah RA, daripada Nabi SAW, baginda bersabda: \"Tidak diwajibkan zakat ke atas kuda seorang Muslim dan juga ke atas hambanya.\""
  },
  {
    "id": 38482,
    "hadith_number": 945,
    "tajuk_hadith": "Tiada Zakat ke Atas Kurang daripada Lima Ausuq, Awaq, atau Dzaud",
    "perawi_melayu": "Diriwayatkan oleh Ubaidullah bin Musa, daripada Sufyan, daripada 'Amru bin Yahya, yang mengkhabarkan kepadaku daripada bapaku, daripada Abi Sa'id al-Khudri, daripada Nabi SAW.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، عَنْ سُفْيَانَ  ، عَنْ عَمْرِو بْنِ يَحْيَى  ، أَخْبَرَنِي أَبِي  عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ، وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ صَدَقَةٌ، وَلَا فِيمَا دُونَ خَمْسِ ذَوْدٍ صَدَقَةٌ \".\n قَالَ أَبُو مُحَمَّد : الْوَسْقُ : سِتُّونَ صَاعًا، وَالصَّاعُ : مَنَوَانِ وَنِصْفٌ فِي قَوْلِ أَهْلِ الْحِجَازِ ، وَأَرْبَعَةُ أَمْنَاءٍ فِي قَوْلِ أَهْلِ الْعِرَاقِ",
    "malay_translation": "Telah menceritakan kepada kami Ubaidullah bin Musa, daripada Sufyan, daripada 'Amru bin Yahya, telah mengkhabarkan kepadaku bapaku, daripada Abi Sa'id al-Khudri, daripada Nabi SAW, baginda bersabda: \"Tidak ada zakat pada hasil tanaman yang kurang daripada lima ausuq, tidak ada zakat pada perak yang kurang daripada lima awaq, dan tidak ada zakat pada unta yang kurang daripada lima ekor.\"\nAbu Muhammad berkata: Al-Wasq adalah enam puluh sa' dan satu sa' adalah dua manwa dan setengah menurut pendapat penduduk Hijaz, dan empat amna' menurut pendapat penduduk Iraq."
  },
  {
    "id": 38483,
    "hadith_number": 946,
    "tajuk_hadith": "Tiada Zakat pada Hasil Tanaman dan Ternakan yang Kurang dari Nisab",
    "perawi_melayu": "Diriwayatkan oleh Abu Sa'id al-Khudri",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ إِسْمَاعِيل بْنِ أُمَيَّةَ  ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ  ، عَنْ يَحْيَى بْنِ عُمَارَةَ  ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ مِنْ حَبٍّ وَلَا تَمْرٍ، وَلَا فِيمَا دُونَ خَمْسِ أَوَاقٍ صَدَقَةٌ، وَلَا فِيمَا دُونَ خَمْسِ ذَوْدٍ صَدَقَةٌ \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Yusuf, daripada Sufyan, daripada Ismail bin Umayyah, daripada Muhammad bin Yahya bin Habban, daripada Yahya bin 'Umarah, daripada Abu Sa'id al-Khudri, beliau berkata: Rasulullah SAW bersabda: \"Tidak wajib zakat pada hasil tanaman bijirin atau kurma yang kurang daripada lima *ausuq*, tidak wajib zakat pada perak yang kurang daripada lima *awaq*, dan tidak wajib zakat pada unta yang kurang daripada lima ekor.\""
  },
  {
    "id": 38484,
    "hadith_number": 947,
    "tajuk_hadith": "Kadar Zakat Perak",
    "perawi_melayu": "Al-Hakam bin Musa, Yahya bin Hamzah, daripada Sulaiman bin Daud al-Khaulani, daripada az-Zuhri, daripada Abu Bakar bin Muhammad bin Amru bin Hazm, daripada ayahnya, daripada datuknya",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ مُوسَى  ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ  ، عَنْ سُلَيْمَانَ بْنِ دَاوُدَ الْخَوْلَانِيِّ  ، حَدَّثَنِي الزُّهْرِيُّ  ، عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ  ، عَنْ أَبِيهِ  ، عَنْ جَدِّهِ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ مَعَ عَمْرِو بْنِ حَزْمٍ إِلَى شُرَحْبِيلَ بْنِ عَبْدِ كُلَالٍ، وَالْحَارِثِ بْنِ عَبْدِ كُلَالٍ، وَنُعَيْمِ بْنِ عَبْدِ كُلَالٍ : \" إِنَّفِي كُلِّ خَمْسِ أَوَاقٍ مِنْ الْوَرِقِ خَمْسَةَ دَرَاهِمَ فَمَا زَادَ، فَفِي كُلِّ أَرْبَعِينَ دِرْهَمًا دِرْهَمٌ، وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ شَيْءٌ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Hakam bin Musa, telah menceritakan kepada kami Yahya bin Hamzah, daripada Sulaiman bin Daud al-Khaulani, telah menceritakan kepadaku az-Zuhri, daripada Abu Bakar bin Muhammad bin Amru bin Hazm, daripada ayahnya, daripada datuknya, bahawa Rasulullah SAW telah menulis bersama Amru bin Hazm kepada Syurahbil bin Abdi Kulal, al-Harith bin Abdi Kulal, dan Nu'aim bin Abdi Kulal: \"Sesungguhnya pada setiap lima *awaq* perak terdapat lima dirham, dan apa yang bertambah maka pada setiap empat puluh dirham ada satu dirham, dan tidak ada (zakat) pada yang kurang daripada lima *awaq*.\""
  },
  {
    "id": 38485,
    "hadith_number": 948,
    "tajuk_hadith": "Kebolehan Menyegerakan Zakat Sebelum Waktunya",
    "perawi_melayu": "Diriwayatkan daripada Ali RA: Bahawa al-Abbas bertanya kepada Rasulullah SAW tentang menyegerakan sedekahnya (zakat) sebelum tiba waktunya, lalu baginda memberikan keringanan (rukhsah) dalam hal tersebut.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ مَنْصُورٍ  ، حَدَّثَنَا إِسْمَاعِيل بْنُ زَكَرِيَّا  ، عَنْ الْحَجَّاجِ بْنِ دِينَارٍ  ، عَنْ الْحَكَمِ بْنِ عُتَيْبَةَ  ، عَنْ حُجَيَّةَ بْنِ عَدِيٍّ  ،  عَنْ عَلِيٍّ   : أَنَّ الْعَبَّاسَ\" سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي تَعْجِيلِ صَدَقَتِهِ قَبْلَ أَنْ تَحِلَّ، فَرَخَّصَ فِي ذَلِكَ \".\n قَالَ أَبُو مُحَمَّد : آخُذُ بِهِ، وَلَا أَرَى فِي تَعْجِيلِ الزَّكَاةِ بَأْسًا",
    "malay_translation": "Telah mengkhabarkan kepada kami Sa'id bin Mansur, telah menceritakan kepada kami Ismail bin Zakaria, daripada al-Hajjaj bin Dinar, daripada al-Hakam bin Utaibah, daripada Hujayyah bin Adiyy, daripada Ali RA: Bahawa al-Abbas bertanya kepada Rasulullah SAW tentang menyegerakan sedekahnya (zakat) sebelum tiba waktunya, lalu baginda memberikan keringanan (rukhsah) dalam hal tersebut. Abu Muhammad berkata: Aku berpegang dengan ini, dan aku tidak melihat ada masalah dalam menyegerakan zakat."
  },
  {
    "id": 38486,
    "hadith_number": 949,
    "tajuk_hadith": "Kewajipan Selain Zakat dalam Harta",
    "perawi_melayu": "Muhammad bin al-Tufail telah mengkhabarkan kepada kami, Syarik telah menceritakan kepada kami, daripada Abu Hamzah, daripada Amir, daripada Fatimah binti Qais, beliau berkata: Saya mendengar Rasulullah SAW bersabda: \"Sesungguhnya dalam harta kamu ada hak selain zakat.\"",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الطُّفَيْلِ  ، حَدَّثَنَا شَرِيكٌ  ، عَنْ أَبِي حَمْزَةَ  ، عَنْ عَامِرٍ  ، عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ  ، قَالَتْ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ : \" إِنَّفِي أَمْوَالِكُمْ حَقًّا سِوَى الزَّكَاةِ \"",
    "malay_translation": "Muhammad bin al-Tufail telah mengkhabarkan kepada kami, Syarik telah menceritakan kepada kami, daripada Abu Hamzah, daripada Amir, daripada Fatimah binti Qais, beliau berkata: Saya mendengar Rasulullah SAW bersabda: \"Sesungguhnya dalam harta kamu ada hak selain zakat.\""
  },
  {
    "id": 38487,
    "hadith_number": 950,
    "tajuk_hadith": "Bai'ah dan Perselisihan Mengenai Sedekah",
    "perawi_melayu": "Muhammad bin Yusuf, daripada Israil, daripada Abu al-Juwayriyah al-Jarmi, bahawa Ma'n bin Yazid menceritakan kepadanya:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا إِسْرَائِيلُ  ، حَدَّثَنَا أَبُو الْجُوَيْرِيَةِ الْجَرْمِيُّ  ، أَنَّ مَعْنَ بْنَ يَزِيدَ   حَدَّثَهُ، قَالَ : بَايَعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا وَأَبِي وَجَدِّي، وَخَطَبَ عَلَيَّ فَأَنْكَحَنِي، وَخَاصَمْتُ إِلَيْهِ، وَكَانَ أَبِي يَزِيدُ أَخْرَجَ دَنَانِيرَ يَتَصَدَّقُ بِهَا فَوَضَعَهَا عِنْدَ رَجُلٍ فِي الْمَسْجِدِ، فَجِئْتُ فَأَخَذْتُهَا، فَأَتَيْتُهُ بِهَا، فَقَالَ : وَاللَّهِ مَا إِيَّاكَ أَرَدْتُ بِهَا، فَخَاصَمْتُهُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ :\" لَكَ مَا نَوَيْتَ يَا يَزِيدُ، وَلَكَ يَا مَعْنُ مَا أَخَذْتَ \"",
    "malay_translation": "\"Aku (Ma'n bin Yazid) telah berbai'ah kepada Rasulullah SAW, aku, ayahku, dan datukku. Baginda meminang untukku lalu menikahkan aku, dan aku telah berselisih (pendapat) kepada baginda. Ayahku, Yazid, telah mengeluarkan dinar-dinar untuk disedekahkan, lalu dia meletakkannya di sisi seorang lelaki di masjid. Aku datang lalu mengambilnya, kemudian aku membawanya kepadanya (ayahku). Dia berkata: 'Demi Allah, bukan kamu yang aku maksudkan dengannya.' Lalu aku berselisih dengannya kepada Rasulullah SAW, maka baginda bersabda: 'Bagimu apa yang kamu niatkan wahai Yazid, dan bagimu wahai Ma'n apa yang telah kamu ambil.'\""
  },
  {
    "id": 38488,
    "hadith_number": 951,
    "tajuk_hadith": "Sedekah Tidak Halal Bagi Orang Kaya dan Orang Kuat yang Sempurna",
    "perawi_melayu": "Diriwayatkan daripada Abdullah bin 'Amr, রাসূলুল্লাহ ﷺ bersabda: \"Sedekah tidak halal bagi orang kaya dan tidak pula bagi orang yang mempunyai kekuatan dan kesihatan yang sempurna.\"",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، وَأَبُو نُعَيْمٍ  ، عَنْ سُفْيَانَ  ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ  ، عَنْ رَيْحَانَ بْنِ يَزِيدَ  ،  عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَا تَحِلُّ الصَّدَقَةُ لِغَنِيٍّ وَلَا لِذِي مِرَّةٍ سَوِيٍّ \".\n قَالَ أَبُو مُحَمَّد : يَعْنِي : قَوِيٍّ",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Yusuf, dan Abu Nu'aim, daripada Sufyan, daripada Sa'd bin Ibrahim, daripada Raihan bin Yazid, daripada Abdullah bin 'Amr, beliau berkata: Rasulullah ﷺ bersabda: \"Tidak halal sedekah bagi orang kaya dan tidak pula bagi orang yang mempunyai kekuatan dan kesihatan yang sempurna.\" Abu Muhammad berkata: Maksudnya: Kuat."
  },
  {
    "id": 38489,
    "hadith_number": 952,
    "tajuk_hadith": "Larangan Meminta-minta dalam Keadaan Kaya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا شَرِيكٌ  ، عَنْ حَكِيمِ بْنِ جُبَيْرٍ  ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ  ، عَنْ أَبِيهِ  ، عَنْ عَبْدِ اللَّهِ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَنْ سَأَلَ عَنْ ظَهْرِ غِنًى، جَاءَ يَوْمَ الْقِيَامَةِ وَفِي وَجْهِهِ خُمُوشٌ أَوْ كُدُوحٌ أَوْ خُدُوشٌ \".\nقِيلَ : يَا رَسُولَ اللَّهِ، وَمَا الْغِنَى؟ قَالَ : \" خَمْسُونَ دِرْهَمًا أَوْ قِيمَتُهَا مِنْ الذَّهَبِ \".\n أَخْبَرَنَا أَبُو عَاصِمٍ  ، وَمُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ حَكِيمِ بْنِ جُبَيْرٍ  ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ  ، عَنْ أَبِيهِ  ، عَنْ عَبْدِ اللَّهِ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، بِنَحْوِهِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah mengkhabarkan kepada kami Syarik, daripada Hakim bin Jubair, daripada Muhammad bin Abd al-Rahman bin Yazid, daripada ayahnya, daripada Abdullah, dia berkata: Rasulullah SAW bersabda: \"Sesiapa yang meminta-minta padahal dia kaya, dia akan datang pada hari kiamat dengan kesan calar, luka, atau garisan di wajahnya.\"\nDitanya: \"Wahai Rasulullah, apakah itu kaya?\" Baginda bersabda: \"Lima puluh dirham atau nilai yang sama dengannya daripada emas.\"\nTelah mengkhabarkan kepada kami Abu Asim, dan Muhammad bin Yusuf, daripada Sufyan, daripada Hakim bin Jubair, daripada Muhammad bin Abd al-Rahman, daripada ayahnya, daripada Abdullah, daripada Nabi SAW, dengan hadis yang serupa."
  },
  {
    "id": 38490,
    "hadith_number": 953,
    "tajuk_hadith": "Larangan Memakan Kurma Sedekah Bagi Keluarga Nabi SAW",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا هَاشِمُ بْنُ الْقَاسِمِ  ، حَدَّثَنَا شُعْبَةُ  ، أَخْبَرَنِي مُحَمَّدُ بْنُ زِيَادٍ  ، قَالَ : سَمِعْتُ أَبَا هُرَيْرَةَ   قَالَ : أَخَذَ الْحَسَنُ تَمْرَةً مِنْ تَمْرِ الصَّدَقَةِ، فَجَعَلَهَا فِي فِيهِ، فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" كِخْ كِخْ أَلْقِهَا، أَمَا شَعَرْتَ أَنَّالَا نَأْكُلُ الصَّدَقَةَ؟ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Hasyim bin al-Qasim, telah menceritakan kepada kami Syu'bah, telah mengkhabarkan kepadaku Muhammad bin Ziyad, dia berkata: Aku mendengar Abu Hurairah RA berkata: Al-Hasan telah mengambil sebiji kurma daripada kurma sedekah, lalu dia memasukkannya ke dalam mulutnya. Maka Nabi SAW bersabda: \"Kikh! Kikh! Buanglah ia. Tidakkah kamu tahu bahawa kita tidak memakan sedekah?\""
  },
  {
    "id": 38491,
    "hadith_number": 954,
    "tajuk_hadith": "Larangan Memakan Kurma Sedekah Bagi Nabi dan Keluarga",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْأَسْوَدُ بْنُ عَامِرٍ  ، حَدَّثَنَا زُهَيْرٌ  ، عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى  ، عَنْ عِيسَى  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى  ،  عَنْ أَبِي لَيْلَى  ، قَالَ : كُنْتُ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعِنْدَهُ الْحَسَنُ بْنُ عَلِيٍّ، فَأَخَذَ تَمْرَةً مِنْ تَمْرِ الصَّدَقَةِ فَانْتَزَعَهَا مِنْهُ، وَقَالَ : \" أَمَا عَلِمْتَ أَنَّهُلَا تَحِلُّ لَنَا الصَّدَقَةُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Al-Aswad bin Amir, telah menceritakan kepada kami Zuhair, daripada Abdullah bin Isa, daripada Isa, daripada Abdurrahman bin Abi Laila, daripada Abi Laila, beliau berkata: Aku berada di sisi Nabi SAW dan di sisi baginda ada Hasan bin Ali. Lalu Hasan mengambil sebiji kurma daripada kurma sedekah, maka Nabi SAW menariknya daripada Hasan dan bersabda: \"Tidakkah kamu tahu bahawa sedekah tidak halal bagi kita?\""
  },
  {
    "id": 38492,
    "hadith_number": 955,
    "tajuk_hadith": "Larangan Memaksa Rasulullah SAW dalam Permintaan",
    "perawi_melayu": "Sa'id bin Mansur, daripada Sufyan bin Uyainah, daripada 'Amr bin Dinar, daripada Wahb bin Munabbih, daripada saudaranya, daripada Mu'awiyah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ مَنْصُورٍ  ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ  ، عَنْ عَمْرِو بْنِ دِينَارٍ  ، عَنْ وَهْبِ بْنِ مُنَبِّهٍ  ، عَنْ أَخِيهِ  ، عَنْ مُعَاوِيَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَا تُلْحِفُوا بِي فِي الْمَسْأَلَةِ فَوَاللَّهِ لَا يَسْأَلُنِي أَحَدٌ شَيْئًا فَأُعْطِيَهُ وَأَنَا كَارِهٌ، فَيُبَارَكَ لَهُ فِيهِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Sa'id bin Mansur, telah menceritakan kepada kami Sufyan bin Uyainah, daripada 'Amr bin Dinar, daripada Wahb bin Munabbih, daripada saudaranya, daripada Mu'awiyah, beliau berkata: Rasulullah SAW bersabda: \"Janganlah kamu memaksa aku dalam permintaan. Demi Allah, tidaklah seseorang meminta sesuatu kepadaku lalu aku memberikannya sedangkan aku tidak menyukainya, kemudian ia diberkati padanya.\""
  },
  {
    "id": 38493,
    "hadith_number": 956,
    "tajuk_hadith": "Larangan Meminta-minta Sedangkan Mampu",
    "perawi_melayu": "Diriwayatkan daripada Thawban, bekas hamba Rasulullah SAW, bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ  ، حَدَّثَنَا يَزِيدُ هُوَ ابْنُ زُرَيْعٍ  ، أَخْبَرَنَا سَعِيدٌ  ، عَنْ قَتَادَةَ  ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ  ، عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ  ، عَنْ ثَوْبَانَ   مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :\" مَنْ سَأَلَ النَّاسَ مَسْأَلَةً وَهُوَ عَنْهَا غَنِيٌّ، كَانَتْ شَيْنًا فِي وَجْهِهِ \"",
    "malay_translation": "\"Sesiapa yang meminta-minta kepada orang ramai sedangkan dia tidak memerlukannya, maka perbuatan itu adalah aib di wajahnya (pada hari kiamat).\""
  },
  {
    "id": 38494,
    "hadith_number": 957,
    "tajuk_hadith": "Keutamaan Menjaga Diri dari Meminta-minta dan Kelebihan Kesabaran",
    "perawi_melayu": "Diriwayatkan daripada Abu Sa'id al-Khudri R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ ابْنِ شِهَابٍ  ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ  ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ  ، أَنَّ نَاسًا مِنْ الْأَنْصَارِ سَأَلُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَعْطَاهُمْ، ثُمَّ سَأَلُوهُ فَأَعْطَاهُمْ، حَتَّى إِذَا نَفِدَ مَا عِنْدَهُ، فَقَالَ :\" مَا يَكُونُ عِنْدِي مِنْ خَيْرٍ، فَلَنْ أَدَّخِرَهُ عَنْكُمْ، وَمَنْ يَسْتَعْفِفْ، يُعِفَّهُ اللَّهُ، وَمَنْ يَسْتَغْنِ، يُغْنِهِ اللَّهُ، وَمَنْ يَتَصَبَّرْ، يُصَبِّرْهُ اللَّهُ، وَمَا أُعْطِيَ أَحَدٌ عَطَاءً هُوَ خَيْرٌ وَأَوْسَعُ مِنْ الصَّبْرِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Hakam bin al-Mubarak, telah menceritakan kepada kami Malik, daripada Ibnu Syihab, daripada 'Ata' bin Yazid al-Laitsi, daripada Abu Sa'id al-Khudri R.A., bahawa beberapa orang Ansar meminta (harta) kepada Rasulullah SAW lalu Baginda memberi mereka, kemudian mereka meminta lagi lalu Baginda memberi mereka, sehingga apabila habis apa yang ada pada Baginda, maka Baginda bersabda: \"Apa sahaja kebaikan yang ada padaku, aku tidak akan menyimpannya daripada kamu. Sesiapa yang menjaga diri (daripada meminta-minta), Allah akan menjaganya; sesiapa yang merasa cukup, Allah akan mencukupkannya; sesiapa yang bersabar, Allah akan menjadikannya sabar. Dan tidak ada seorang pun yang diberi pemberian yang lebih baik dan lebih luas daripada kesabaran.\""
  },
  {
    "id": 38495,
    "hadith_number": 958,
    "tajuk_hadith": "Rasulullah SAW Memberi Pemberian dan Anjuran untuk Menerimanya Jika Tidak Berlebihan dan Tidak Meminta-minta",
    "perawi_melayu": "Abdullah bin Saleh",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، قَالَ : حَدَّثَنِي اللَّيْثُ  ، حَدَّثَنِي يُونُسُ  ، عَنْ ابْنِ شِهَابٍ  ، عَنْ سَالِمٍ  ، أَنَّهُ قَالَ : قَالَ عَبْدُ اللَّهِ  : سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ  ، يَقُولُ : كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعْطِينِي الْعَطَاءَ فَأَقُولُ : أَعْطِهِ مَنْ هُوَ أَفْقَرُ إِلَيْهِ مِنِّي.\nفَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" خُذْ،وَمَا آتَاكَ اللَّهُ مِنْ هَذَا الْمَالِ وَأَنْتَ غَيْرُ مُسْرِفٍ وَلَا سَائِلٍ، فَخُذْهُ، وَمَا لَا، فَلَا تُتْبِعْهُ نَفْسَكَ \".\nأَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ  ، عَنْ شُعَيْبِ بْنِ أَبِي حَمْزَةَ  ، عَنْ الزُّهْرِيِّ  ، حَدَّثَنِي السَّائِبُ بْنُ يَزِيدَ  ، أَنَّ حُوَيْطِبَ بْنَ عَبْدِ الْعُزَّى  أَخْبَرَهُ، أَنَّ عَبْدَ اللَّهِ بْنَ السَّعْدِيِّ  أَخْبَرَهُ، عَنْ عُمَرَ  ، بِنَحْوِهِ.\nأَخْبَرَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا اللَّيْثُ  ، عَنْ بُكَيْرٍ  ، عَنْ بُسْرِ بْنِ سَعِيدٍ  ، عَنْ ابْنِ السَّعْدِيِّ  ، قَالَ : اسْتَعْمَلَنِي عُمَرُ  ، فَذَكَرَ نَحْوًا مِنْهُ",
    "malay_translation": "Abdullah bin Saleh mengkhabarkan kepada kami, katanya: Al-Laith meriwayatkan kepada saya, Yunus meriwayatkan kepada saya, daripada Ibnu Syihab, daripada Salim, bahawa beliau berkata: Abdullah berkata: Saya mendengar Umar bin al-Khattab berkata: Rasulullah SAW pernah memberi saya pemberian, lalu saya berkata: Berikanlah kepada orang yang lebih memerlukannya daripada saya.\nRasulullah SAW bersabda: \"Ambillah, dan apa sahaja yang Allah berikan kepadamu daripada harta ini, dan kamu tidak berlebih-lebihan dan tidak meminta-minta, maka ambillah. Dan jika tidak, maka janganlah kamu turutkan dirimu.\"\nAl-Hakam bin Nafi' mengkhabarkan kepada kami, daripada Syuaib bin Abi Hamzah, daripada al-Zuhri, al-Sa'ib bin Yazid meriwayatkan kepada saya, bahawa Huwaitib bin Abdul Uzza mengkhabarkannya, bahawa Abdullah bin al-Sa'di mengkhabarkannya, daripada Umar, dengan seumpamanya.\nAbu al-Walid mengkhabarkan kepada kami, al-Laith meriwayatkan kepada kami, daripada Bukair, daripada Busr bin Sa'id, daripada Ibn al-Sa'di, beliau berkata: Umar mengambil saya bekerja, lalu beliau menyebutkan seumpamanya."
  },
  {
    "id": 38496,
    "hadith_number": 959,
    "tajuk_hadith": "Larangan Meminta-minta Harta dengan Tamak",
    "perawi_melayu": "Muhammad bin Yusuf, daripada al-Awza'i, daripada Ibn Shihab, daripada Sa'id bin al-Musayyib dan Urwah bin al-Zubair",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ الْأَوْزَاعِيِّ  ، عَنْ ابْنِ شِهَابٍ  ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ  ، وَعُرْوَةَ بْنِ الزُّبَيْرِ  ، أَنَّ حَكِيمَ بْنَ حِزَامٍ   قَالَ : سَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَعْطَانِي، ثُمَّ سَأَلْتُهُ فَأَعْطَانِي، ثُمَّ سَأَلْتُهُ فَأَعْطَانِي، ثُمَّ سَأَلْتُهُ، فَقَالَ : \" يَا حَكِيمُ، إِنَّهَذَا الْمَالَ خَضِرٌ حُلْوٌ، فَمَنْ أَخَذَهُ بِسَخَاوَةِ نَفْسٍ، بُورِكَ لَهُ فِيهِ، وَمَنْ أَخَذَهُ بِإِشْرَافِ نَفْسٍ لَمْ يُبَارَكْ لَهُ فِيهِ، وَكَانَ كَالَّذِي يَأْكُلُ وَلَا يَشْبَعُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Yusuf, daripada al-Awza'i, daripada Ibn Shihab, daripada Sa'id bin al-Musayyib dan Urwah bin al-Zubair, bahawa Hakim bin Hizam berkata: \"Aku meminta kepada Nabi SAW, lalu baginda memberiku. Kemudian aku meminta lagi kepada baginda, lalu baginda memberiku. Kemudian aku meminta lagi kepada baginda, lalu baginda memberiku. Kemudian aku meminta lagi, lalu baginda bersabda: \"Wahai Hakim, sesungguhnya harta ini hijau lagi manis. Sesiapa yang mengambilnya dengan jiwa yang dermawan, maka diberkati baginya harta itu. Dan sesiapa yang mengambilnya dengan jiwa yang tamak, maka tidak diberkati baginya harta itu, dan dia seperti orang yang makan tetapi tidak kenyang.\""
  },
  {
    "id": 38497,
    "hadith_number": 960,
    "tajuk_hadith": "Sedekah Terbaik dan Keutamaan Menafkahi Keluarga",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، حَدَّثَنِي اللَّيْثُ  ، حَدَّثَنِي هِشَامٌ  ، عَنْ عُرْوَةَ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ :\" خَيْرُ الصَّدَقَةِ مَا تُصُدِّقَ بِهِ عَنْ ظَهْرِ غِنًى، وَلْيَبْدَأْ أَحَدُكُمْ بِمَنْ يَعُولُ \"",
    "malay_translation": "Abdullah bin Soleh mengkhabarkan kepada kami, Al-Laith telah menceritakan kepadaku, Hisham telah menceritakan kepadaku, daripada Urwah, daripada Abu Hurairah, dia berkata: Aku mendengar Rasulullah SAW bersabda: \"Sebaik-baik sedekah adalah sedekah yang diberikan daripada kekayaan (yang mencukupi), dan hendaklah seseorang daripada kamu memulakan (sedekah) kepada orang yang menjadi tanggungannya.\""
  },
  {
    "id": 38498,
    "hadith_number": 961,
    "tajuk_hadith": "Keutamaan Tangan yang Memberi Berbanding Tangan yang Meminta",
    "perawi_melayu": "Sulaiman bin Harb telah mengkhabarkan kepada kami, Hammad bin Zaid telah menceritakan kepada kami, daripada Ayyub, daripada Nafi', daripada Ibn Umar, dia berkata: Saya mendengar Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، عَنْ أَيُّوبَ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ  ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ :\" الْيَدُ الْعُلْيَا خَيْرٌ مِنْ الْيَدِ السُّفْلَى، قَالَ : وَالْيَدُ الْعُلْيَا يَدُ الْمُعْطِي، وَالْيَدُ السُّفْلَى يَدُ السَّائِلِ \"",
    "malay_translation": "\"Tangan yang di atas (memberi) lebih baik daripada tangan yang di bawah (meminta).\" Beliau (Ibn Umar) berkata: \"Tangan yang di atas adalah tangan orang yang memberi, dan tangan yang di bawah adalah tangan orang yang meminta.\""
  },
  {
    "id": 38499,
    "hadith_number": 962,
    "tajuk_hadith": "Sedekah Terbaik adalah Daripada Kelebihan Kekayaan",
    "perawi_melayu": "Abu Nu'aim meriwayatkan daripada 'Amr bin 'Uthman, yang berkata: Saya mendengar Musa bin Talhah menyebut daripada Hakim bin Hizam, yang berkata: Rasulullah SAW bersabda: \"Sebaik-baik sedekah adalah daripada kelebihan kekayaan, dan tangan yang di atas lebih baik daripada tangan yang di bawah, dan mulailah dengan orang yang menjadi tanggunganmu.\"",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ  ، قَالَ : سَمِعْتُ مُوسَى بْنَ طَلْحَةَ  يَذْكُرُ، عَنْ حَكِيمِ بْنِ حِزَامٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" خَيْرُ الصَّدَقَةِ عَنْ ظَهْرِ غِنًى، وَالْيَدُ الْعُلْيَا خَيْرٌ مِنْ الْيَدِ السُّفْلَى، وَابْدَأْ بِمَنْ تَعُولُ \"",
    "malay_translation": "Abu Nu'aim telah meriwayatkan kepada kami, 'Amr bin 'Uthman telah meriwayatkan kepada kami, dia berkata: Saya mendengar Musa bin Talhah menyebut, daripada Hakim bin Hizam, dia berkata: Rasulullah SAW bersabda: \"Sebaik-baik sedekah adalah daripada lebihan kekayaan, dan tangan yang di atas lebih baik daripada tangan yang di bawah, dan mulakanlah dengan orang yang menjadi tanggunganmu.\""
  },
  {
    "id": 38500,
    "hadith_number": 963,
    "tajuk_hadith": "Galakan Bersedekah Walaupun daripada Perhiasan Diri",
    "perawi_melayu": "Abu Al-Walid At-Tayalisi, daripada Syu'bah, daripada Sulaiman, daripada Abi Wa'il, daripada 'Amru bin Al-Harith, daripada Zainab, isteri Abdullah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ  ، حَدَّثَنَا شُعْبَةُ  ، قَالَ : سُلَيْمَانُ  أَخْبَرَنِي، قَالَ : سَمِعْتُ أَبَا وَائِلٍ  يُحَدِّثُ، عَنْ عَمْرِو بْنِ الْحَارِثِ  ، عَنْ زَيْنَبَ   امْرَأَةِ عَبْدِ اللَّهِ، أَنَّهَا قَالَتْ : إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ : \" يَا مَعْشَرَ النِّسَاءِ،تَصَدَّقْنَ وَلَوْ مِنْ حُلِيِّكُنَّ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Al-Walid At-Tayalisi, telah menceritakan kepada kami Syu'bah, beliau berkata: Sulaiman telah mengkhabarkan kepadaku, beliau berkata: Aku mendengar Abu Wa'il menceritakan, daripada 'Amru bin Al-Harith, daripada Zainab, isteri Abdullah, bahawa beliau berkata: Sesungguhnya Rasulullah SAW bersabda: \"Wahai golongan wanita, bersedekahlah kamu, walaupun daripada perhiasanmu.\""
  },
  {
    "id": 38501,
    "hadith_number": 964,
    "tajuk_hadith": "Ganjaran Sedekah kepada Keluarga Dekat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "وَكَانَ عَبْدُ اللَّهِ خَفِيفَ ذَاتِ الْيَدِ، فَجِئْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْأَلُهُ، فَوَافَقَتْ زَيْنَبَ ، امْرَأَةٌ مِنْ الْأَنْصَارِ، تَسْأَلُ عَمَّا أَسْأَلُ عَنْهُ، فَقُلْتُ لِبِلَالٍ : سَلْ لِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيْنَ أَضَعُ صَدَقَتِي؟ : عَلَى عَبْدِ اللَّهِ، أَوْ فِي قَرَابَتِي؟ فَسَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ : أَيُّ الزَّيَانِبِ؟ فَقَالَ : امْرَأَةُ عَبْدِ اللَّهِ، فَقَالَ :\" لَهَا أَجْرَانِ، أَجْرُ الْقَرَابَةِ، وَأَجْرُ الصَّدَقَةِ \"",
    "malay_translation": "Abdullah adalah seorang yang miskin. Maka aku datang kepada Rasulullah SAW untuk bertanya kepada baginda. Tiba-tiba aku bertemu dengan Zainab, seorang wanita Ansar, yang bertanya tentang perkara yang sama aku ingin tanyakan. Maka aku berkata kepada Bilal: Tanyakanlah kepada Rasulullah SAW, di manakah aku patut meletakkan sedekahku? Adakah kepada Abdullah, atau kepada kaum kerabatku? Maka Bilal bertanya kepada Nabi SAW. Baginda bertanya: “Zainab yang mana?” Bilal menjawab: “Isteri Abdullah.” Maka baginda bersabda: “Baginya dua ganjaran, ganjaran kerana (memberi kepada) kaum kerabat, dan ganjaran kerana bersedekah.”"
  },
  {
    "id": 38502,
    "hadith_number": 965,
    "tajuk_hadith": "Abu Talhah Bersedekah Kebunnya, Bairuha', yang Paling Dicintainya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ إِسْحَاق بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ  ، عَنْ أَنَسٍ  ، قَالَ : كَانَ أَبُو طَلْحَةَ أَكْثَرَ أَنْصَارِيٍّ بِالْمَدِينَةِ مَالًا نَخْلًا، وَكَانَتْ أَحَبَّ أَمْوَالِهِ إِلَيْهِ بَيْرُحَاءُ ، وَكَانَتْ مُسْتَقْبِلَةَ الْمَسْجِدِ، وَكَانَ يَعْنِي النَّبِي صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَدْخُلُهَا وَيَشْرَبُ مِنْ مَاءٍ فِيهَا طَيِّبٌ.\nفَقَالَ أَنَسٌ : فَلَمَّا أُنْزِلَتْ هَذِهِ الْآيَةُ : # لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ وَمَا تُنْفِقُوا مِنْ شَيْءٍ فَإِنَّ اللَّهَ بِهِ عَلِيمٌ سورة آل عمران آية 92 #، قَالَ : إِنَّ أَحَبَّ أَمْوَالِي إِلَيَّ بَيْرُحَاءُ ، وَإِنَّهَا صَدَقَةٌ للَّهِ أَرْجُو بِرَّهَا وَذُخْرَهَا عِنْدَ اللَّهِ، فَضَعْهَا يَا رَسُولَ اللَّهِ حَيْثُ شِئْتَ.\nفَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" بَخٍ ذَلِكَ مَالٌ رَابِحٌ أَوْ رَائِحٌ، وَقَدْ سَمِعْتُ مَا قُلْتَ فِيهِ، وَإِنِّي أَرَى أَنْ تَجْعَلَهُ فِي الْأَقْرَبِينَ \".\nفَقَالَ أَبُو طَلْحَةَ : أَفْعَلُ يَا رَسُولَ اللَّهِ، فَقَسَّمَهُ أَبُو طَلْحَةَ فِي قَرَابَةِ بَنِي عَمِّهِ",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Hakam bin al-Mubarak, telah menceritakan kepada kami Malik, daripada Ishaq bin Abdullah bin Abi Talhah, daripada Anas, beliau berkata: Abu Talhah adalah seorang Ansar di Madinah yang paling banyak memiliki harta berupa kebun kurma. Dan harta yang paling dicintainya adalah Bairuha', yang menghadap ke masjid. Nabi SAW sering masuk ke dalamnya dan minum dari airnya yang baik.\n\nAnas berkata: Ketika ayat ini diturunkan: 'Kamu sekali-kali tidak sampai kepada kebajikan (yang sempurna), sebelum kamu menafkahkan sebahagian harta yang kamu cintai. Dan apa saja yang kamu nafkahkan, maka sesungguhnya Allah mengetahuinya.' (Surah Ali Imran, ayat 92). Abu Talhah berkata: Sesungguhnya harta yang paling aku cintai adalah Bairuha', dan ia adalah sedekah kerana Allah, aku mengharapkan kebaikan dan pahalanya di sisi Allah. Maka letakkanlah ia, wahai Rasulullah, di mana sahaja engkau suka.\n\nRasulullah SAW bersabda: 'Bakh! Itu adalah harta yang menguntungkan atau akan pergi. Aku telah mendengar apa yang engkau katakan tentangnya, dan aku berpendapat agar engkau menjadikannya untuk kerabat terdekat.'\n\nAbu Talhah berkata: 'Aku akan melakukannya, wahai Rasulullah.' Maka Abu Talhah membahagikannya kepada kaum kerabat bapa saudaranya."
  },
  {
    "id": 38503,
    "hadith_number": 966,
    "tajuk_hadith": "Anjuran Bersedekah dan Larangan Melakukan Mutilasi",
    "perawi_melayu": "Diriwayatkan daripada Imran bin Husain RA, beliau berkata: \"Rasulullah SAW tidak pernah berkhutbah kepada kami melainkan Baginda memerintahkan kami untuk bersedekah dan melarang kami daripada melakukan mutilasi.\"",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ  ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ  ، حَدَّثَنَا أَبِي  ، عَنْ قَتَادَةَ  ، عَنْ الْحَسَنِ  ، عَنْ هَيَّاجِ بْنِ عِمْرَانَ  ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ  ، قَالَ : \" مَا خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّاأَمَرَنَا فِيهَا بِالصَّدَقَةِ، وَنَهَانَا عَنْ الْمُثْلَةِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Basyar, telah menceritakan kepada kami Mu'adz bin Hisyam, telah menceritakan kepada kami ayahku, daripada Qatadah, daripada al-Hasan, daripada Hayyaj bin Imran, daripada Imran bin Husain, beliau berkata: \"Rasulullah SAW tidak pernah berkhutbah kepada kami melainkan Baginda memerintahkan kami untuk bersedekah dan melarang kami daripada melakukan mutilasi.\""
  },
  {
    "id": 38504,
    "hadith_number": 967,
    "tajuk_hadith": "Berlindung dari Api Neraka Walaupun dengan Sedekah Sebiji Kurma atau Kata-Kata yang Baik",
    "perawi_melayu": "Diriwayatkan oleh Adi bin Hatim daripada Nabi SAW",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ  ، حَدَّثَنَا شُعْبَةُ  ، أَخْبَرَنِي عَمْرُو بْنُ مُرَّةَ  ، قَالَ : سَمِعْتُ خَيْثَمَةَ  ، عَنْ عَدِيِّ بْنِ حَاتِمٍ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ، قَالَ :\" اتَّقُوا النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ، فَإِنْ لَمْ تَجِدُوا، فَبِكَلِمَةٍ طَيِّبَةٍ \"",
    "malay_translation": "Abu Al-Walid At-Tayalisi mengkhabarkan kepada kami, Syu'bah menceritakan kepada kami, Amru bin Murrah mengkhabarkan kepadaku, dia berkata: Aku mendengar Khaithamah, daripada Adi bin Hatim, daripada Nabi SAW, baginda bersabda: 'Berlindunglah kamu dari api neraka walaupun hanya dengan separuh biji kurma, dan jika kamu tidak menemukannya, maka (berlindunglah) dengan kata-kata yang baik.'"
  },
  {
    "id": 38505,
    "hadith_number": 968,
    "tajuk_hadith": "Taubat dengan Meninggalkan Harta dan Tempat Tinggal",
    "perawi_melayu": "Abdul Rahman bin Ibrahim Ad-Dimashqi Duhaim",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ دُحَيْمٌ  ، حَدَّثَنَا سَعِيدُ بْنُ مَسْلَمَةَ  ، عَنْ إِسْمَاعِيل بْنِ أُمَيَّةَ  ، عَنْ الزُّهْرِيِّ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لُبَابَةَ  ، أَنَّ أَبَا لُبَابَةَ   أَخْبَرَهُ، أَنَّهُ لَمَّا رَضِيَ عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ : يَا رَسُولَ اللَّهِ، إِنَّ مِنْ تَوْبَتِي أَنْ أَهْجُرَ دَارَ قَوْمِي، وَأُسَاكِنَكَ، وَأَنْخَلِعَ مِنْ مَالِي صَدَقَةً لِلَّهِ وَلِرَسُولِهِ.\nفَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" يُجْزِي عَنْكَ الثُّلُثُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abdul Rahman bin Ibrahim Ad-Dimashqi Duhaim, telah menceritakan kepada kami Sa'id bin Maslamah, daripada Ismail bin Umayyah, daripada Az-Zuhri, daripada Abdul Rahman bin Abi Lubabah, bahawa Abu Lubabah telah mengkhabarkannya, bahawa ketika রাসূলুল্লাহ ﷺ redha kepadanya, dia berkata: \"Wahai রাসূলুল্লাহ, sesungguhnya sebahagian daripada taubatku adalah dengan meninggalkan tempat tinggal kaumku, dan tinggal bersamamu, dan melepaskan diriku daripada hartaku sebagai sedekah kepada Allah dan Rasul-Nya.\"\nMaka রাসূলুল্লাহ ﷺ bersabda: \"Mencukupi bagimu sepertiga (daripada hartamu).\""
  },
  {
    "id": 38506,
    "hadith_number": 969,
    "tajuk_hadith": "Larangan Bersedekah Seluruh Harta Sehingga Meminta-Minta",
    "perawi_melayu": "Diriwayatkan daripada Jabir bin Abdullah RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَعْلَى  ، وَأَحْمَدُ بْنُ خَالِدٍ  ، عَنْ مُحَمَّدِ بْنِ إِسْحَاق  ، عَنْ عَاصِمِ بْنِ عُمَرَ بْنِ قَتَادَةَ  ، عَنْ مَحْمُودِ بْنِ لَبِيدٍ  ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ  ، قَالَ : بَيْنَا نَحْنُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، إِذْ جَاءَ رَجُلٌ بِمِثْلِ الْبَيْضَةِ مِنْ ذَهَبٍ أَصَابَهَا فِي بَعْضِ الْمَغَازِي، قَالَ أَحْمَدُ : فِي بَعْضِ الْمَعَادِنِ، وَهُوَ الصَّوَابُ ، فَقَالَ : يَا رَسُولَ اللَّهِ، خُذْهَا مِنِّي صَدَقَةً، فَوَاللَّهِ مَا لِي مَالٌ غَيْرَهَا، فَأَعْرَضَ عَنْهُ، ثُمَّ جَاءَهُ عَنْ رُكْنِهِ الْأَيْسَرِ، فَقَالَ مِثْلَ ذَلِكَ، ثُمَّ جَاءَهُ مِنْ بَيْنِ يَدَيْهِ، فَقَالَ مِثْلَ ذَلِكَ، ثُمَّ قَالَ : \" هَاتِهَا \"، مُغْضَبًا، فَحَذَفَهُ بِهَا حَذْفَةً لَوْ أَصَابَهُ لَأَوْجَعَهُ أَوْ عَقَرَهُ ثُمَّ، قَالَ :\" يَعْمِدُ أَحَدُكُمْ إِلَى مَالِهِ لَا يَمْلِكُ غَيْرَهُ فَيَتَصَدَّقُ بِهِ، ثُمَّ يَقْعُدُ يَتَكَفَّفُ النَّاسَ، إِنَّمَا الصَّدَقَةُ عَنْ ظَهْرِ غِنًى، خُذْ الَّذِي لَكَ لَا حَاجَةَ لَنَا بِهِ \".\nفَأَخَذَ الرَّجُلُ مَالَهُ وَذَهَبَ.\n قَالَ أَبُو مُحَمَّد : كَانَ مَالِكٌ يَقُولُ : إِذَا جَعَلَ الرَّجُلُ مَالَهُ فِي الْمَسَاكِينِ يَتَصَدَّقُ بِثُلُثِ مَالِهِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Ya'la, dan Ahmad bin Khalid, daripada Muhammad bin Ishaq, daripada 'Asim bin Umar bin Qatadah, daripada Mahmud bin Labid, daripada Jabir bin Abdullah, beliau berkata: Ketika kami berada di sisi Rasulullah SAW, tiba-tiba datang seorang lelaki dengan membawa emas sebesar telur yang diperolehinya dalam beberapa peperangan. Ahmad berkata: Dalam beberapa lombong, dan itulah yang betul. Dia berkata: Wahai Rasulullah, terimalah ini daripadaku sebagai sedekah. Demi Allah, aku tidak mempunyai harta selain daripadanya. Baginda berpaling daripadanya, kemudian dia datang dari sudut kirinya dan berkata seperti itu. Kemudian dia datang dari hadapannya dan berkata seperti itu. Kemudian Baginda bersabda: \"Bawalah ke sini,\" dengan marah, lalu Baginda melemparkannya dengan lemparan yang jika mengenainya, pasti akan menyakitinya atau mencederakannya. Kemudian Baginda bersabda: \"Adakah salah seorang daripada kamu sengaja memberikan seluruh hartanya yang tidak dimilikinya selain itu sebagai sedekah, kemudian dia duduk meminta-minta kepada orang ramai? Sesungguhnya sedekah itu adalah daripada kekayaan. Ambillah apa yang menjadi milikmu, kami tidak memerlukannya.\" Lelaki itu mengambil hartanya dan pergi. Abu Muhammad berkata: Malik berkata: Apabila seorang lelaki memberikan hartanya kepada orang miskin, dia bersedekah dengan satu pertiga daripada hartanya."
  },
  {
    "id": 38507,
    "hadith_number": 970,
    "tajuk_hadith": "Umar Bersedekah dan Keutamaan Abu Bakar",
    "perawi_melayu": "Abu Nu'aim, daripada Hisyam bin Sa'd, daripada Zaid bin Aslam, daripada ayahnya, berkata: Aku mendengar Umar berkata",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا هِشَامُ بْنُ سَعْدٍ  ، عَنْ زَيْدِ بْنِ أَسْلَمَ  ، عَنْ أَبِيهِ  ، قَالَ سَمِعْتُ عُمَرَ  ، قَالَ : أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْنَتَصَدَّقَ، فَوَافَقَ ذَلِكَ مَالًا عِنْدِي، فَقُلْتُ : الْيَوْمَ أَسْبِقُ أَبَا بَكْرٍ إِنْ سَبَقْتُهُ يَوْمًا.\nقَالَ : فَجِئْتُ بِنِصْفِ مَالِي، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" مَا أَبْقَيْتَ لِأَهْلِكَ؟ \" قُلْتُ : مِثْلَهُ، قَالَ : فَأَتَى أَبُو بَكْرٍ بِكُلِّ مَا عِنْدَهُ، فَقَالَ : \" يَا أَبَا بَكْرٍ، مَا أَبْقَيْتَ لِأَهْلِكَ؟ \".\nفَقَالَ : أَبْقَيْتُ لَهُمْ اللَّهَ وَرَسُولَهُ.\nفَقُلْتُ : لَا أُسَابِقُكَ إِلَى شَيْءٍ أَبَدًا",
    "malay_translation": "Abu Nu'aim memberitahu kami, Hisyam bin Sa'd menceritakan kepada kami, daripada Zaid bin Aslam, daripada ayahnya, dia berkata: Aku mendengar Umar berkata: “Rasulullah SAW memerintahkan kami untuk bersedekah, dan pada waktu itu aku memiliki harta. Aku berkata: 'Hari ini aku akan mengatasi Abu Bakar jika aku pernah mengatasinya pada suatu hari.'\nDia berkata: 'Aku datang dengan separuh hartaku, lalu Rasulullah SAW bersabda: 'Apa yang kamu tinggalkan untuk keluargamu?' Aku menjawab: 'Seperti itu juga.' Dia berkata: 'Kemudian Abu Bakar datang dengan seluruh hartanya, lalu Baginda bersabda: 'Wahai Abu Bakar, apa yang kamu tinggalkan untuk keluargamu?'\nDia menjawab: 'Aku tinggalkan untuk mereka Allah dan Rasul-Nya.'\nAku berkata: 'Aku tidak akan berlumba denganmu dalam apa pun selama-lamanya.'"
  },
  {
    "id": 38508,
    "hadith_number": 971,
    "tajuk_hadith": "Kewajipan Zakat Fitrah di Bulan Ramadan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ نَافِعٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ  ، قَالَ :\" فَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَكَاةَ الْفِطْرِ مِنْ رَمَضَانَ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا، مِنْ شَعِيرٍ عَلَى كُلِّ حُرٍّ وَعَبْدٍ، ذَكَرٍ أَوْ أُنْثَى، مِنْ الْمُسْلِمِينَ \".\nقِيلَ لِأَبِي مُحَمَّدٍ : تَقُولُ بِهِ؟ قَالَ : مَالِكٌ كَانَ يَقُولُ بِهِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Khalid bin Makhlad, telah menceritakan kepada kami Malik, daripada Nafi', daripada Abdullah bin Umar, beliau berkata: \"Rasulullah SAW telah mewajibkan zakat fitrah di bulan Ramadan sebanyak satu *sa' tamar* atau satu *sa'* barli ke atas setiap orang yang merdeka atau hamba, lelaki atau perempuan, daripada kalangan Muslimin.\" Dikatakan kepada Abu Muhammad: Adakah anda berpendapat dengan ini? Beliau berkata: Malik berpendapat dengannya."
  },
  {
    "id": 38509,
    "hadith_number": 972,
    "tajuk_hadith": "Perintah Rasulullah SAW tentang Zakat Fitrah",
    "perawi_melayu": "Diriwayatkan daripada Ibnu Umar RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ عُبَيْدِ اللَّهِ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ  ، قَالَ : \" أَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَبِزَكَاةِ الْفِطْرِ عَنْ كُلِّ صَغِيرٍ وَكَبِيرٍ، حُرٍّ وَعَبْدٍ، صَاعًا مِنْ شَعِيرٍ، أَوْ صَاعًا مِنْ تَمْرٍ \".\nقَالَ ابْنُ عُمَرَ : فَعَدَلَهُ النَّاسُ بِمُدَّيْنِ مِنْ بُرٍّ",
    "malay_translation": "Muhammad bin Yusuf telah mengkhabarkan kepada kami, daripada Sufyan, daripada Ubaidillah, daripada Nafi', daripada Ibnu Umar RA, beliau berkata: “Rasulullah SAW memerintahkan zakat fitrah ke atas setiap orang kecil dan besar, merdeka dan hamba, sebanyak satu *sa'* daripada syair (barli), atau satu *sa'* daripada tamar (kurma).” Ibnu Umar berkata: “Orang ramai menyamakannya dengan dua *mudd* daripada burr (gandum)."
  },
  {
    "id": 38510,
    "hadith_number": 973,
    "tajuk_hadith": "Kadar Zakat Fitrah: Satu Sa' daripada Makanan, Kurma, Barli, Aqiṭ atau Kismis",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ  ، حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ  ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ  ،  عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ  ، قَالَ : \" كُنَّانُخْرِجُ زَكَاةَ الْفِطْرِ إِذْ كَانَ فِينَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كُلِّ صَغِيرٍ وَكَبِيرٍ، حُرٍّ وَمَمْلُوكٍ، صَاعًا مِنْ طَعَامٍ، أَوْ صَاعًا مِنْ تَمْرٍ، أَوْ صَاعًا مِنْ شَعِيرٍ، أَوْ صَاعًا مِنْ أَقِطٍ، أَوْ صَاعًا مِنْ زَبِيبٍ، فَلَمْ يَزَلْ ذَلِكَ كَذَلِكَ حَتَّى قَدِمَ عَلَيْنَا مُعَاوِيَةُ الْمَدِينَةَ حَاجًّا، أَوْ مُعْتَمِرًا، فَقَالَ : إِنِّي أَرَى مُدَّيْنِ مِنْ سَمْرَاءِ الشَّامِ يَعْدِلُ صَاعًا مِنْ التَّمْرِ، فَأَخَذَ النَّاسُ بِذَلِكَ \".\nقَالَ أَبُو سَعِيدٍ : أَمَّا أَنَا، فَلَا أَزَالُ أُخْرِجُهُ كَمَا كُنْتُ أُخْرِجُهُ.\nقَالَ أَبُو مُحَمَّد : أَرَى صَاعًا مِنْ كُلِّ شَيْءٍ",
    "malay_translation": "Telah menceritakan kepada kami Uthman bin Umar, telah menceritakan kepada kami Daud bin Qais, daripada Iyad bin Abdullah, daripada Abu Sa'id Al-Khudri, beliau berkata: \"Kami mengeluarkan zakat fitrah ketika Rasulullah SAW berada di kalangan kami untuk setiap orang kecil dan besar, merdeka dan hamba, satu sa' daripada makanan, atau satu sa' daripada kurma, atau satu sa' daripada barli, atau satu sa' daripada aqiṭ, atau satu sa' daripada kismis.  Keadaan itu berterusan sehingga Muawiyah datang kepada kami di Madinah sebagai seorang yang mengerjakan haji atau umrah, lalu beliau berkata: 'Sesungguhnya aku melihat dua mud daripada samra' Syam menyamai satu sa' daripada kurma.' Maka orang ramai pun mengambil (pendapat) itu.\"\nAbu Sa'id berkata: \"Adapun aku, aku tetap mengeluarkannya sebagaimana aku mengeluarkannya dahulu.\"\nAbu Muhammad berkata: \"Aku berpendapat satu sa' daripada setiap sesuatu (yang disebutkan).\""
  },
  {
    "id": 38511,
    "hadith_number": 974,
    "tajuk_hadith": "Kadar Zakat Fitrah: Satu Sa' Gandum, Kurma, Barli, Kismis atau Aqiṭ",
    "perawi_melayu": "Diriwayatkan daripada Abu Sa'id al-Khudri",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ زَيْدِ بْنِ أَسْلَمَ  ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ سَعْدِ بْنِ أَبِي سَرْحٍ  ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ  ، قَالَ : \" كُنَّانُخْرِجُ زَكَاةَ الْفِطْرِ مِنْ رَمَضَانَ صَاعًا مِنْ طَعَامٍ، أَوْ صَاعًا مِنْ تَمْرٍ، أَوْ صَاعًا مِنْ شَعِيرٍ، أَوْ صَاعًا مِنْ زَبِيبٍ، أَوْ صَاعًا مِنْ أَقِطٍ \".\nأَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، عَنْ سُفْيَانَ  ، عَنْ زَيْدِ بْنِ أَسْلَمَ  ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ  ، عَنْ أَبِي سَعِيدٍ  ، قَالَ : كُنَّا نُعْطِي عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَذَكَرَ نَحْوَهُ",
    "malay_translation": "Telah menceritakan kepada kami Khalid bin Makhlad, telah menceritakan kepada kami Malik, daripada Zaid bin Aslam, daripada 'Iyad bin Abdullah bin Sa'd bin Abi Sarh, daripada Abu Sa'id al-Khudri, beliau berkata: \"Kami mengeluarkan Zakat Fitrah pada bulan Ramadhan sebanyak satu sa' makanan, atau satu sa' kurma, atau satu sa' barli, atau satu sa' kismis, atau satu sa' aqiṭ.\"\nTelah mengkhabarkan kepada kami Ubaidullah bin Musa, daripada Sufyan, daripada Zaid bin Aslam, daripada 'Iyad bin Abdullah, daripada Abu Sa'id, beliau berkata: Kami memberi (zakat fitrah) pada zaman Nabi SAW, lalu beliau menyebutkan seumpamanya."
  },
  {
    "id": 38512,
    "hadith_number": 975,
    "tajuk_hadith": "Larangan Memasuki Syurga Bagi Pengutip Cukai yang Zalim",
    "perawi_melayu": "Ahmad bin Khalid, Muhammad bin Ishaq, Yazid bin Abi Habib, daripada Abdur Rahman bin Shimasa, katanya: Saya mendengar Uqbah bin Amir berkata: Saya mendengar Rasulullah SAW bersabda: \"Tidak akan masuk syurga orang yang memungut cukai (dengan zalim).\"",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ خَالِدٍ  ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاق  ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ شِمَاسَةَ  ، قَالَ : سَمِعْتُ عُقْبَةَ بْنَ عَامِرٍ   يَقُولُ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ :\" لَا يَدْخُلُ الْجَنَّةَ صَاحِبُ مَكْسٍ \".\nقَالَ : قَالَ أَبُو مُحَمَّد : يَعْنِي : عَشَّارًا",
    "malay_translation": "Telah mengkhabarkan kepada kami Ahmad bin Khalid, telah menceritakan kepada kami Muhammad bin Ishaq, daripada Yazid bin Abi Habib, daripada Abdur Rahman bin Shimasa, beliau berkata: Saya mendengar Uqbah bin Amir berkata: Saya mendengar Rasulullah SAW bersabda: \"Tidak akan masuk syurga orang yang memungut cukai (dengan zalim).\" Abu Muhammad berkata: Iaitu pemungut cukai."
  },
  {
    "id": 38513,
    "hadith_number": 976,
    "tajuk_hadith": "Arahan Mengambil Zakat Hasil Tanaman di Yaman",
    "perawi_melayu": "Diriwayatkan daripada Mu'az r.a., beliau berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَاصِمُ بْنُ يُوسُفَ  ، حَدَّثَنَا أَبُو بَكْرٍ  ، عَنْ عَاصِمٍ  ، عَنْ أَبِي وَائِلٍ  ، عَنْ مَسْرُوقٍ  ، عَنْ مُعَاذٍ  ، قَالَ : \" بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَمَنِ ،فَأَمَرَنِي أَنْ آخُذَ مِنْ الثِّمَارِ مَا يُسْقَى بَعْلًا الْعُشْرَ، وَمَا سُقِيَ بِالسَّانِيَةِ، فَنِصْفَ الْعُشْرِ \"",
    "malay_translation": "\"Rasulullah SAW mengutusku ke Yaman dan memerintahkanku untuk mengambil daripada hasil tanaman yang diairi dengan air hujan (ba'lan) sebanyak sepersepuluh (1/10) sebagai zakat, dan tanaman yang diairi dengan alat pengairan (as-saniyah), maka zakatnya adalah setengah daripada sepersepuluh (1/20).\""
  },
  {
    "id": 38514,
    "hadith_number": 977,
    "tajuk_hadith": "Ganti Rugi Bagi Kecederaan Haiwan, Perigi, Lombong dan Harta Karun",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA, daripada Nabi SAW",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ ابْنِ شِهَابٍ  ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ  ، وَأَبِي سَلَمَةَ  ، عَنْ أَبِي هُرَيْرَةَ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" جُرْحُ الْعَجْمَاءِ جُبَارٌ، وَالْبِئْرُ جُبَارٌ، وَالْمَعْدِنُ جُبَارٌ، وَفِي الرِّكَازِ الْخُمُسُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Khalid bin Makhlad, telah menceritakan kepada kami Malik, daripada Ibn Syihab, daripada Sa'id bin al-Musayyib, dan Abu Salamah, daripada Abu Hurairah, daripada Nabi SAW, baginda bersabda: \"Kecederaan yang disebabkan oleh haiwan adalah percuma (tidak dikenakan ganti rugi), perigi adalah percuma (jika seseorang jatuh ke dalamnya, tiada ganti rugi), lombong adalah percuma (jika seseorang tercedera di dalamnya, tiada ganti rugi), dan pada harta karun dikenakan satu perlima (khumus).\""
  },
  {
    "id": 38515,
    "hadith_number": 978,
    "tajuk_hadith": "Larangan Menerima Hadiah Bagi Petugas Zakat",
    "perawi_melayu": "Abu al-Yaman al-Hakam bin Nafi'",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْيَمَانِ الْحَكَمُ بْنُ نَافِعٍ  ، أَخْبَرَنَا شُعَيْبٌ  ، عَنْ الزُّهْرِيِّ  ، حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ  ، عَنْ أَبِي حُمَيْدٍ الْأَنْصَارِيِّ ثُمَّ السَّاعِدِيّ   أَنَّهُ أَخْبَرَهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَعْمَلَ عَامِلًا عَلَى الصَّدَقَةِ، فَجَاءَهُ الْعَامِلُ حِينَ فَرَغَ مِنْ عَمَلِهِ، فَقَالَ : يَا رَسُولَ اللَّهِ، هَذَا الَّذِي لَكُمْ، وَهَذَا أُهْدِيَ لِي.\nفَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" فَهَلَّا قَعَدْتَ فِي بَيْتِ أَبِيكَ وَأُمِّكَ، فَنَظَرْتَ أَيُهْدَى لَكَ أَمْ لَا؟ ثُمَّ قَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَشِيَّةً بَعْدَ الصَّلَاةِ عَلَى الْمِنْبَرِ، فَتَشَهَّدَ وَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ، ثُمَّ قَالَ : \" أَمَّا بَعْدُمَا بَالُ الْعَامِلِ نَسْتَعْمِلُهُ فَيَأْتِينَا فَيَقُولُ : هَذَا مِنْ عَمَلِكُمْ وَهَذَا أُهْدِيَ لِي؟ ! فَهَلَّا قَعَدَ فِي بَيْتِ أَبِيهِ وَأُمِّهِ فَيَنْظُرَ هَلْ يُهْدَى لَهُ أَمْ لَا؟ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ، لَا يَغُلُّ أَحَدُكُمْ مِنْهَا شَيْئًا، إِلَّا جَاءَ يَوْمَ الْقِيَامَةِ يَحْمِلُهُ عَلَى عُنُقِهِ : إِنْ كَانَ بَعِيرًا، جَاءَ بِهِ لَهُ رُغَاءٌ، وَإِنْ كَانَتْ بَقَرَةً، جَاءَ بِهَا لَهَا خُوَارٌ، وَإِنْ كَانَتْ شَاةً، جَاءَ بِهَا تَيْعَرُ، فَقَدْ بَلَّغْتُ \".\nقَالَ أَبُو حُمَيْدٍ : ثُمَّ رَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَيْهِ حَتَّى إِنَّا لَنَنْظُرُ إِلَى عُفْرَةِ إِبْطَيْهِ.\nقَالَ أَبُو حُمَيْدٍ : وَقَدْ سَمِعَ ذَلِكَ مَعِي مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَيْدُ بْنُ ثَابِتٍ ، فَسَلُوهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu al-Yaman al-Hakam bin Nafi', telah mengkhabarkan kepada kami Syuaib, daripada al-Zuhri, telah menceritakan kepadaku Urwah bin al-Zubair, daripada Abu Humaid al-Ansari kemudian al-Sa'idi, bahawa dia telah mengkhabarkannya bahawa Nabi SAW telah melantik seorang petugas untuk menguruskan sedekah. Petugas itu datang kepada Nabi SAW setelah selesai tugasnya dan berkata: \"Wahai Rasulullah, ini adalah untuk kamu, dan ini dihadiahkan kepada saya.\"\n\nMaka Nabi SAW bersabda: \"Mengapa kamu tidak duduk sahaja di rumah ayah dan ibumu, dan lihat adakah kamu akan diberi hadiah atau tidak?\" Kemudian Nabi SAW berdiri pada petang hari selepas solat di atas mimbar, lalu baginda bertasyahhud dan memuji Allah dengan pujian yang selayaknya bagi-Nya, kemudian bersabda: \"Amma ba'du, mengapa ada petugas yang kami lantik datang kepada kami dan berkata: 'Ini adalah daripada hasil kerja kamu dan ini dihadiahkan kepada saya?' Tidakkah dia duduk sahaja di rumah ayah dan ibunya dan melihat adakah dia akan diberi hadiah atau tidak? Demi Zat yang jiwa Muhammad berada di tangan-Nya, tidaklah seorang pun daripada kamu mengambil sesuatu daripadanya secara tidak sah, melainkan dia akan datang pada hari kiamat dengan memikulnya di lehernya: Jika ia seekor unta, dia akan datang dengannya dengan suara ngauman, jika ia seekor lembu, dia akan datang dengannya dengan suara menguak, dan jika ia seekor kambing, dia akan datang dengannya dengan suara mengembek. Sesungguhnya aku telah menyampaikan.\"\n\nAbu Humaid berkata: Kemudian Rasulullah SAW mengangkat kedua-dua tangannya sehingga kami dapat melihat putih ketiaknya.\n\nAbu Humaid berkata: Zaid bin Thabit telah mendengar perkara itu bersamaku daripada Nabi SAW, maka bertanyalah kepadanya."
  },
  {
    "id": 38516,
    "hadith_number": 979,
    "tajuk_hadith": "Kewajipan Memastikan Petugas Zakat Berpuas Hati",
    "perawi_melayu": "Amru bin Aun, Hushaem, Daud, Mujalid, Asy-Sya'bi, Jarir, Muhammad bin Uyainah, Abu Ishaq al-Fazari, Daud bin Abi Hind, Amir, Jarir",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ  ، أَخْبَرَنَا هُشَيْمٌ  ، عَنْ دَاوُدَ  ، وَمُجَالِدٍ  ، عَنْ الشَّعْبِيِّ  ، عَنْ جَرِيرٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِذَا جَاءَكُمْ الْمُصَدِّقُ، فَلَا يَصْدُرَنَّ عَنْكُمْ إِلَّا وَهُوَ رَاضٍ \".\n حَدَّثَنِي مُحَمَّدُ بْنُ عُيَيْنَةَ  ، عَنْ أَبِي إِسْحَاق الْفَزَارِيِّ  ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ  ، عَنْ عَامِرٍ  ، عَنْ جَرِيرٍ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Amru bin Aun, telah mengkhabarkan kepada kami Hushaim, daripada Daud, dan Mujalid, daripada Asy-Sya'bi, daripada Jarir, dia berkata: Rasulullah SAW bersabda: \"Apabila datang kepada kamu petugas zakat, maka janganlah dia pergi daripada kamu kecuali dia dalam keadaan redha (berpuas hati).\"\n Telah menceritakan kepadaku Muhammad bin Uyainah, daripada Abu Ishaq al-Fazari, daripada Daud bin Abi Hind, daripada Amir, daripada Jarir, daripada Nabi SAW seumpamanya."
  },
  {
    "id": 38517,
    "hadith_number": 980,
    "tajuk_hadith": "Pesanan Nabi kepada Wanita Muslimah tentang Memberi Hadiah kepada Jiran",
    "perawi_melayu": "Al-Hakam bin Al-Mubarak, daripada Malik, daripada Zaid bin Aslam, daripada Amru bin Mu'az Al-Ashhali, daripada neneknya yang bernama Hawwa',",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ  ، أَخْبَرَنَا مَالِكٌ  ، عَنْ زَيْدِ بْنِ أَسْلَمَ  ، عَنْ عَمْرِو بْنِ مُعَاذٍ الْأَشْهَلِيِّ  ، عَنْ جَدَّتِهِ يُقَالُ لَهَا حَوَّاءُ  ، قَالَتْ : قَالَ رَسُولُ اللَّهِ يَا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" يَا نِسَاءَ الْمُسْلِمَاتِ،لَا تَحْقِرَنَّ إِحْدَاكُنَّ لِجَارَتِهَا، وَلَوْ كُرَاعُ شَاةٍ مُحَرَّقٌ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Al-Hakam bin Al-Mubarak, telah mengkhabarkan kepada kami Malik, daripada Zaid bin Aslam, daripada Amru bin Mu'az Al-Ashhali, daripada neneknya yang bernama Hawwa', dia berkata: Rasulullah ﷺ bersabda: \"Wahai wanita-wanita Muslimah, janganlah sekali-kali seorang daripada kamu meremehkan (untuk memberi hadiah) kepada jirannya, walaupun hanya sepotong tulang kaki kambing yang dibakar.\""
  },
  {
    "id": 38518,
    "hadith_number": 981,
    "tajuk_hadith": "Keutamaan Memelihara Harta dan Nyawa Setelah Memeluk Islam",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا أَبَانُ بْنُ عَبْدِ اللَّهِ الْبَجَلِيُّ  ، حَدَّثَنَا عُثْمَانُ بْنُ أَبِي حَازِمٍ  ،  عَنْ صَخْرِ بْنِ الْعَيْلَةِ  ، قَالَ : أُخِذَتْ عَمَّةُ الْمُغِيرَةِ بْنِ شُعْبَةَ، فَقَدِمَتْ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَسَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَمَّتَهُ، فَقَالَ : \" يَا صَخْرُ، إِنَّالْقَوْمَ إِذَا أَسْلَمُوا، أَحْرَزُوا أَمْوَالَهُمْ وَدِمَاءَهُمْ، فَادْفَعْهَا إِلَيْهِمْ \".\nوَكَانَ مَاءٌ لِبَنِي سُلَيْمٍ، فَأَسْلَمُوا، فَسَأَلُوهُ ذَلِكَ فَدَعَانِي، فَقَالَ : \" يَا صَخْرُ، إِنَّ الْقَوْمَ إِذَا أَسْلَمُوا، أَحْرَزُوا أَمْوَالَهُمْ وَدِمَاءَهُمْ، فَادْفَعْهَا إِلَيْهِمْ \" فَدَفَعْتُهَا.\n أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا أَبَانُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنِي عُثْمَانُ بْنُ أَبِي حَازِمٍ  ، عَنْ أَبِيهِ  ، عَنْ جَدِّهِ صَخْرٍ  ، أَطْوَلَ مِنْ حَدِيثِ أَبِي نُعَيْمٍ",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Nu'aim, telah menceritakan kepada kami Aban bin Abdullah al-Bajali, telah menceritakan kepada kami Uthman bin Abi Hazim, daripada Sakhr bin al-'Ailah, dia berkata: 'Mak saudara al-Mughirah bin Syu'bah telah ditawan, lalu dia datang kepada Rasulullah SAW. Nabi SAW bertanya kepada mak saudaranya, lalu baginda bersabda: 'Wahai Sakhr, sesungguhnya kaum apabila mereka memeluk Islam, mereka telah memelihara harta dan nyawa mereka, maka serahkanlah ia kepada mereka.'\n\nDahulu ada air milik Bani Sulaim, lalu mereka memeluk Islam, maka mereka meminta air itu. Lalu baginda memanggilku dan bersabda: 'Wahai Sakhr, sesungguhnya kaum apabila mereka memeluk Islam, mereka telah memelihara harta dan nyawa mereka, maka serahkanlah ia kepada mereka.' Lalu aku menyerahkannya.\n\nTelah mengkhabarkan kepada kami Muhammad bin Yusuf, telah menceritakan kepada kami Aban bin Abdullah, telah menceritakan kepadaku Uthman bin Abi Hazim, daripada ayahnya, daripada datuknya Sakhr, (dengan riwayat) yang lebih panjang daripada hadith Abu Nu'aim."
  },
  {
    "id": 38519,
    "hadith_number": 982,
    "tajuk_hadith": "Sedekah daripada Sumber yang Baik Diterima Allah dan Dikembangkan",
    "perawi_melayu": "Sa'id bin al-Mughirah, daripada Isa bin Yunus, daripada Yahya bin Sa'id, daripada Sa'id bin Yasar, daripada Abu Hurairah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ الْمُغِيرَةِ  ، عَنْ عِيسَى بْنِ يُونُسَ  ، عَنْ يَحْيَى بْنِ سَعِيدٍ  ، عَنْ سَعِيدِ بْنِ يَسَارٍ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَا تَصَدَّقَ امْرُؤٌ بِصَدَقَةٍ مِنْ كَسْبٍ طَيِّبٍ، وَلَا يَقْبَلُ اللَّهُ إِلَّا طَيِّبًا، إِلَّا وَضَعَهَا حِينَ يَضَعُهَا فِي كَفِّ الرَّحْمَنِ، وَإِنَّ اللَّهَ لَيُرَبِّي لِأَحَدِكُمْ التَّمْرَةَ كَمَا يُرَبِّي أَحَدُكُمْ فَلُوَّهُ أَوْ فَصِيلَهُ حَتَّى تَكُونَ مِثْلَ أُحُدٍ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Sa'id bin al-Mughirah, daripada Isa bin Yunus, daripada Yahya bin Sa'id, daripada Sa'id bin Yasar, daripada Abu Hurairah, beliau berkata: Rasulullah SAW bersabda: “Tidaklah seseorang bersedekah dengan sedekah daripada hasil yang baik (halal), dan Allah tidak menerima kecuali yang baik, melainkan Dia (Allah) meletakkannya (sedekah itu) di tapak tangan Ar-Rahman. Sesungguhnya Allah membesarkan (mengembangkan) untuk salah seorang kamu sebiji kurma, sebagaimana salah seorang kamu membesarkan anak kudanya atau anak untanya, sehingga menjadi sebesar Bukit Uhud.”"
  },
  {
    "id": 38520,
    "hadith_number": 983,
    "tajuk_hadith": "Keberkatan Sedekah, Keutamaan Memaafkan, dan Kemuliaan Merendah Diri",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ  ، حَدَّثَنَا إِسْمَاعِيل بْنُ جَعْفَرٍ  ، عَنْ الْعَلَاءِ  ، عَنْ أَبِيهِ  ،  عَنْ أَبِي هُرَيْرَةَ  ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :\" مَا نَقَصَتْ صَدَقَةٌ مِنْ مَالٍ، وَمَا زَادَ اللَّهُ عَبْدًا بِعَفْوٍ إِلَّا عِزًّا، وَمَا تَوَاضَعَ أَحَدٌ لِلَّهِ، إِلَّا رَفَعَهُ اللَّهُ \"",
    "malay_translation": "\"Sedekah tidak akan mengurangi harta. Allah akan menambahkan kemuliaan kepada seorang hamba yang memaafkan. Dan tidaklah seseorang merendahkan diri karena Allah, melainkan Allah akan mengangkat derajatnya.\""
  },
  {
    "id": 38521,
    "hadith_number": 984,
    "tajuk_hadith": "Zakat Unta yang Digembalakan: Setiap Empat Puluh Ekor, Seekor Bintu Labun",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ  ، حَدَّثَنَا بَهْزُ بْنُ حَكِيمٍ  ، عَنْ أَبِيهِ  ، عَنْ جَدَّهِ  ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ :\" فِي كُلِّ إِبِلٍ سَائِمَةٍ فِي كُلِّ أَرْبَعِينَ بِنْتُ لَبُونٍ، لَا تُفَرَّقُ إِبِلٌ عَنْ حِسَابِهَا، مَنْ أَعْطَاهَا مُؤْتَجِرًا بِهَا، فَلَهُ أَجْرُهَا، وَمَنْ مَنَعَهَا، فَإِنَّا آخِذُوهَا وَشَطْرَ مَالِهِ عَزْمَةٌ مِنْ عَزَمَاتِ اللَّهِ، لَا يَحِلُّ لِآلِ مُحَمَّدٍ مِنْهَا شَيْءٌ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami an-Nadr bin Syumail, telah menceritakan kepada kami Bahz bin Hakim, daripada ayahnya, daripada datuknya, dia berkata: Aku mendengar Rasulullah SAW bersabda: \"Pada setiap unta yang digembalakan, setiap empat puluh ekor, (dikenakan zakat) seekor bintu labun. Janganlah unta-unta itu dipisahkan daripada hitungannya. Barangsiapa yang memberikannya dengan mengharapkan pahala, maka baginya pahalanya. Dan barangsiapa yang menahannya, maka sesungguhnya kami akan mengambilnya dan separuh hartanya sebagai ketetapan daripada ketetapan-ketetapan Allah. Tidak halal bagi keluarga Muhammad sedikit pun daripadanya.\""
  },
  {
    "id": 38522,
    "hadith_number": 985,
    "tajuk_hadith": "Hukum Meminta-Minta dan Keadaan yang Dibenarkan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ  ، وَأَبُو نُعَيْمٍ  ، قَالَا : حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، عَنْ هَارُونَ بْنِ رِئَابٍ  ، حَدَّثَنِي كِنَانَةُ بْنُ نُعَيْمٍ  ، عَنْ قَبِيصَةَ بْنِ مُخَارِقٍ الْهِلَالِيِّ  ، قَالَ : تَحَمَّلْتُ بِحَمَالَةٍ فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْأَلُهُ فِيهَا، فَقَالَ : \" أَقِمْ يَا قَبِيصَةُ حَتَّى تَأْتِيَنَا الصَّدَقَةُ، فَنَأْمُرَ لَكَ بِهَا \"، ثُمَّ قَالَ : \" يَا قَبِيصَةُ إِنَّالْمَسْأَلَةَ لَا تَحِلُّ إِلَّا لِأَحَدِ ثَلَاثَةٍ : رَجُلٍ تَحَمَّلَ حَمَالَةً فَحَلَّتْ لَهُ الْمَسْأَلَةُ، فَسَأَلَ حَتَّى يُصِيبَهَا، ثُمَّ يُمْسِكَ.\n وَرَجُلٍ أَصَابَتْهُ جَائِحَةٌ فَاجْتَاحَتْ مَالَهُ، فَحَلَّتْ لَهُ الْمَسْأَلَةُ، فَسَأَلَ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ أَوْ قَالَ : سِدَادًا مِنْ عَيْشٍ .\nوَرَجُلٍ أَصَابَتْهُ فَاقَةٌ حَتَّى يَقُولَ ثَلَاثَةٌ مِنْ ذَوِي الْحِجَى مِنْ قَوْمِهِ : قَدْ أَصَابَ فُلَانًا الْفَاقَةُ، فَحَلَّتْ لَهُ الْمَسْأَلَةُ، فَسَأَلَ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ، أَوْ سِدَادًا مِنْ عَيْشٍ، ثُمَّ يُمْسِكَ، وَمَا سِوَاهُنَّ مِنْ الْمَسْأَلَةِ سُحْتٌ يَا قَبِيصَةُ يَأْكُلُهَا صَاحِبُهَا سُحْتًا \"",
    "malay_translation": "Musaddad dan Abu Nu'aim meriwayatkan kepada kami, mereka berkata: Hammad bin Zaid meriwayatkan kepada kami, daripada Harun bin Ri'ab, Kinanah bin Nu'aim meriwayatkan kepadaku, daripada Qabisah bin Mukharik al-Hilali, dia berkata: Saya menanggung beban hutang, lalu saya datang kepada Nabi SAW untuk meminta bantuan mengenainya. Baginda bersabda: \"Wahai Qabisah, tunggulah sehingga sedekah datang kepada kita, maka kita akan perintahkan untukmu daripadanya.\" Kemudian baginda bersabda: \"Wahai Qabisah, sesungguhnya meminta-minta itu tidak halal kecuali bagi salah seorang daripada tiga golongan: Seseorang yang menanggung beban hutang, maka halal baginya meminta-minta, lalu dia meminta sehingga dia mendapatkannya, kemudian dia berhenti.\nDan seseorang yang ditimpa musibah yang memusnahkan hartanya, maka halal baginya meminta-minta, lalu dia meminta sehingga dia mendapat sara hidup yang mencukupi atau dia berkata: yang menampung kehidupannya.\nDan seseorang yang ditimpa kemiskinan sehingga tiga orang yang berakal daripada kaumnya berkata: Sesungguhnya si fulan telah ditimpa kemiskinan, maka halal baginya meminta-minta, lalu dia meminta sehingga dia mendapat sara hidup yang mencukupi, atau yang menampung kehidupannya, kemudian dia berhenti. Selain daripada itu, meminta-minta adalah haram wahai Qabisah, pemiliknya memakannya dengan haram.\""
  },
  {
    "id": 38523,
    "hadith_number": 986,
    "tajuk_hadith": "Keutamaan Bersedekah kepada Kaum Kerabat yang Membenci",
    "perawi_melayu": "Diriwayatkan daripada Hakim bin Hizam RA: Seorang lelaki bertanya kepada Nabi SAW tentang sedekah mana yang paling utama? Baginda bersabda: \"Sedekah kepada kaum kerabat yang membenci.\"",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ  ، عَنْ عَبَّادِ بْنِ الْعَوَّامِ  ، عَنْ سُفْيَانَ بْنِ حُسَيْنٍ  ، عَنْ الزُّهْرِيِّ  ، عَنْ أَيُّوبَ بْنِ بَشِيرٍ  ، عَنْ حَكِيمِ بْنِ حِزَامٍ  ، أَنَّ رَجُلًا سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّدَقَاتِ أَيُّهَا أَفْضَلُ؟ قَالَ :\" عَلَى ذِي الرَّحِمِ الْكَاشِحِ \"",
    "malay_translation": "Telah menceritakan kepada kami Sa'id bin Sulaiman, daripada 'Abbad bin al-'Awwam, daripada Sufyan bin Husain, daripada al-Zuhri, daripada Ayyub bin Bashir, daripada Hakim bin Hizam, bahawa seorang lelaki bertanya kepada Nabi SAW tentang sedekah mana yang paling utama? Baginda bersabda: \"(Sedekah) kepada kaum kerabat yang membenci.\""
  },
  {
    "id": 38524,
    "hadith_number": 987,
    "tajuk_hadith": "Keutamaan Bersedekah kepada Kaum Kerabat",
    "perawi_melayu": "Diriwayatkan daripada Salman bin 'Amir Ad-Dhabbi RA bahawa Nabi SAW bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو حَاتِمٍ الْبَصْرِيُّ  ، حَدَّثَنَا ابْنُ عَوْنٍ  ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ  ، عَنْ أُمِّ الرَّائِحِ بِنْتِ صُلَيْعٍ  ، عَنْ سَلْمَانَ بْنِ عَامِرٍ الضَّبِّيِّ  ، ذَكَرَ أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ : \" إِنَّالصَّدَقَةَ عَلَى الْمِسْكِينِ صَدَقَةٌ، وَإِنَّهَا عَلَى ذِي الرَّحِمِ اثْنَتَانِ، صَدَقَةٌ وَصِلَةٌ \"",
    "malay_translation": "Abu Hatim Al-Basri mengkhabarkan kepada kami, Ibn Aun menceritakan kepada kami, daripada Hafsah binti Sirin, daripada Ummu Ar-Raih binti Sula'i, daripada Salman bin 'Amir Ad-Dhabbi, bahawa Nabi SAW bersabda: \"Sesungguhnya sedekah kepada orang miskin adalah satu sedekah, dan sesungguhnya sedekah kepada kaum kerabat adalah dua (pahala), sedekah dan silaturahim.\""
  },
  {
    "id": 38525,
    "hadith_number": 988,
    "tajuk_hadith": "Keutamaan Sedekah Kepada Keluarga Terdekat",
    "perawi_melayu": "Muhammad bin Yusuf, daripada Ibnu Uyainah, berkata: Aku telah mendengarnya daripada al-Tsauri, daripada 'Asim, daripada Hafsah binti Sirin, daripada al-Rabab, daripada Salman bin 'Amir al-Dabbi, yang meriwayatkannya secara marfu':",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ ابْنِ عُيَيْنَةَ  ، قَالَ : وَقَدْ سَمِعْتُهُ مِنَ الثَّوْرِيِّ  ، عَنْ عَاصِمٍ  ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ  ، عَنْ الرَّبَابِ  ، عَنْ سَلْمَانَ بْنِ عَامِرٍ الضَّبِّيِّ   يَرْفَعُهُ، قَالَ :\" الصَّدَقَةُ عَلَى الْمِسْكِينِ صَدَقَةٌ، وَهِيَ عَلَى ذِي الرَّحِمِ اثْنَتَانِ : صَدَقَةٌ وَصِلَةٌ \"",
    "malay_translation": "Sedekah kepada orang miskin adalah satu sedekah, dan sedekah kepada kerabat (kaum keluarga) adalah dua (ganjarannya): sedekah dan silaturahim."
  }
]
