[
  {
    "id": 40099,
    "hadith_number": 2562,
    "tajuk_hadith": "Orang yang Tidak Mempunyai Al-Quran dalam Dirinya seperti Rumah yang Runtuh",
    "perawi_melayu": "Ibnu Abbas رضي الله عنه",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ زُرَارَةَ  ، حَدَّثَنَا جَرِيرٌ  ، عَنْ قَابُوسَ  ، عَنْ أَبِيهِ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِنَّ الرَّجُلَ الَّذِي لَيْسَ فِي جَوْفِهِ مِنْ الْقُرْآنِ شَيْءٌ كَالْبَيْتِ الْخَرِبِ \"",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Sesungguhnya lelaki yang di dalam dirinya tidak ada sedikit pun (dari) Al-Quran, adalah seperti rumah yang runtuh.\""
  },
  {
    "id": 40100,
    "hadith_number": 2563,
    "tajuk_hadith": "Al-Quran: Jamuan Allah, Ambil Seberapa Mampu",
    "perawi_melayu": "Abdullah bin Khalid bin Hazim",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ خَالِدِ بْنِ حَازِمٍ  ، حَدَّثَنَا مُحَمَّدُ بْنُ مسْلَمَةَ  ، حَدَّثَنَا أَبُو سِنَانٍ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ أَبِي الْأَحْوَصِ  ،  عَنْ عَبْدِ اللَّهِ  ، قَالَ :\" إِنَّ هَذَا الْقُرْآنَ مَأْدُبَةُ اللَّهِ، فَخُذُوا مِنْهُ مَا اسْتَطَعْتُمْ، فَإِنِّي لَا أَعْلَمُ شَيْئًا أَصْفَرَ مِنْ خَيْرٍ، مِنْ بَيْتٍ لَيْسَ فِيهِ مِنْ كِتَابِ اللَّهِ شَيْءٌ، وَإِنَّ الْقَلْبَ الَّذِي لَيْسَ فِيهِ مِنْ كِتَابِ اللَّهِ شَيْءٌ، خَرِبٌ كَخَرَابِ الْبَيْتِ الَّذِي لَا سَاكِنَ لَهُ \"",
    "malay_translation": "Abdullah berkata: \"Sesungguhnya Al-Quran ini adalah jamuan Allah, maka ambillah daripadanya seberapa yang kamu mampu. Sesungguhnya aku tidak mengetahui sesuatu yang lebih baik daripada rumah yang di dalamnya terdapat sesuatu daripada Kitabullah. Sesungguhnya hati yang di dalamnya tidak terdapat sesuatu daripada Kitabullah, adalah rosak seperti rosaknya rumah yang tidak ada penghuninya.\""
  },
  {
    "id": 40101,
    "hadith_number": 2564,
    "tajuk_hadith": "Ganjaran Membaca Al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو عَامِرٍ قَبِيصَةُ  ، أَنْبَأَنَا سُفْيَانُ  ، عَنْ عَطَاءِ بْنِ السَّائِبِ  ، عَنْ أَبِي الْأَحْوَصِ  ، عَنْ عَبْدِ اللَّهِ  ، قَالَ :\" تَعَلَّمُوا هَذَا الْقُرْآنَ، فَإِنَّكُمْ تُؤْجَرُونَ بِتِلَاوَتِهِ بِكُلِّ حَرْفٍ عَشْرَ حَسَنَاتٍ، أَمَا إِنِّي لَا أَقُولُ بِ ( الم )، وَلَكِنْ بِأَلِفٍ، وَلَامٍ، وَمِيمٍ، بِكُلِّ حَرْفٍ عَشْرُ حَسَنَاتٍ \"",
    "malay_translation": "Abu 'Amir Qabisa meriwayatkan, Sufyan memberitahu, daripada 'Ata' bin As-Sa'ib, daripada Abu al-Ahwas, daripada Abdullah, berkata: \"Pelajarilah Al-Quran ini, sesungguhnya kamu akan diberi ganjaran atas bacaannya dengan setiap huruf sepuluh kebaikan. Ketahuilah, aku tidak mengatakan 'Alif, Lam, Mim' (الٓم) itu satu huruf, tetapi Alif (ا) satu huruf, Lam (ل) satu huruf, dan Mim (م) satu huruf; dengan setiap huruf sepuluh kebaikan.\""
  },
  {
    "id": 40102,
    "hadith_number": 2565,
    "tajuk_hadith": "Keutamaan Membaca Al-Quran di Rumah",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُعَاذُ بْنُ هَانِئٍ  ، حَدَّثَنَا حَرْبُ بْنُ شَدَّادٍ  ، حَدَّثَنَا يَحْيَى هُوَ ابْنُ أَبِي كَثِيرٍ  ، حَدَّثَنِي حَفْصُ بْنُ عِنَانٍ الْحَنَفِيُّ  : أَنَّ أَبَا هُرَيْرَةَ   كَانَ يَقُولُ :\" إِنَّ الْبَيْتَ لَيَتَّسِعُ عَلَى أَهْلِهِ وَتَحْضُرُهُ الْمَلَائِكَةُ وَتَهْجُرُهُ الشَّيَاطِينُ، وَيَكْثُرُ خَيْرُهُ أَنْ يُقْرَأَ فِيهِ الْقُرْآنُ، وَإِنَّ الْبَيْتَ لَيَضِيقُ عَلَى أَهْلِهِ وَتَهْجُرُهُ الْمَلَائِكَةُ، وَتَحْضُرُهُ الشَّيَاطِينُ، وَيَقِلُّ خَيْرُهُ، أَنْ لَا يُقْرَأَ فِيهِ الْقُرْآنُ \"",
    "malay_translation": "Diriwayatkan daripada Abu Hurairah رضي الله عنه: \"Sesungguhnya rumah itu akan menjadi luas bagi penghuninya, dihadiri oleh malaikat, dijauhi oleh syaitan, dan bertambah kebaikannya, kerana dibacakan di dalamnya Al-Quran. Dan sesungguhnya rumah itu akan menjadi sempit bagi penghuninya, dijauhi oleh malaikat, dihadiri oleh syaitan, dan berkurang kebaikannya, kerana tidak dibacakan di dalamnya Al-Quran.\""
  },
  {
    "id": 40103,
    "hadith_number": 2566,
    "tajuk_hadith": "Keutamaan Al-Quran",
    "perawi_melayu": "Uqbah bin Amir",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ  ، حَدَّثَنَا ابْنُ لَهِيعَةَ  ، عَنْ مِشْرَحِ بْنِ هَاعَانَ  ، قَالَ : سَمِعْتُ عُقْبَةَ بْنَ عَامِرٍ  ، يَقُولُ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" لَوْ جُعِلَ الْقُرْآنُ فِي إِهَابٍ، ثُمَّ أُلْقِيَ فِي النَّارِ، مَا احْتَرَقَ \"",
    "malay_translation": "Daripada Uqbah bin Amir, beliau berkata: Saya mendengar Rasulullah SAW bersabda: \"Sekiranya Al-Quran diletakkan di dalam kulit, kemudian dilemparkan ke dalam api, nescaya ia tidak akan terbakar.\""
  },
  {
    "id": 40104,
    "hadith_number": 2567,
    "tajuk_hadith": "Al-Quran Sebagai Pemberi Syafaat di Hari Kiamat",
    "perawi_melayu": "Abu Hurairah (Radhiyallahu 'Anhu)",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الرَّقِّيُّ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَمْرٍو  ، عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ  ، عَنْ عَاصِمٍ  ، عَنْ أَبِي صَالِحٍ  ، قَالَ : سَمِعْتُ أَبَا هُرَيْرَةَ  ، يَقُولُ :\" اقْرَءُوا الْقُرْآنَ، فَإِنَّهُ نِعْمَ الشَّفِيعُ يَوْمَ الْقِيَامَةِ \"، إِنَّهُ يَقُولُ يَوْمَ الْقِيَامَةِ : يَا رَبِّ، حَلِّهِ حِلْيَةَ الْكَرَامَةِ، فَيُحَلَّى حِلْيَةَ الْكَرَامَةِ، يَا رَبِّ، اكْسُهُ كِسْوَةَ الْكَرَامَةِ، فَيُكْسَى كِسْوَةَ الْكَرَامَةِ، يَا رَبِّ، أَلْبِسْهُ تَاجَ الْكَرَامَةِ، يَا رَبِّ، ارْضَ عَنْهُ، فَلَيْسَ بَعْدَ رِضَاكَ شَيْءٌ \"",
    "malay_translation": "Daripada Abu Hurairah (Radhiyallahu 'Anhu), beliau berkata: \"Bacalah Al-Quran, sesungguhnya ia akan menjadi pemberi syafaat yang terbaik pada hari Kiamat.\" Sesungguhnya ia (Al-Quran) akan berkata pada hari Kiamat: \"Ya Rabbi, pakaikanlah kepadanya perhiasan kemuliaan.\" Maka ia akan dipakaikan perhiasan kemuliaan. \"Ya Rabbi, pakaikanlah kepadanya pakaian kemuliaan.\" Maka ia akan dipakaikan pakaian kemuliaan. \"Ya Rabbi, pakaikanlah kepadanya mahkota kemuliaan.\" \"Ya Rabbi, redhailah dia.\" Maka tiada sesuatu pun selepas keredhaan-Mu (Allah)."
  },
  {
    "id": 40105,
    "hadith_number": 2568,
    "tajuk_hadith": "Al-Quran Memberi Syafaat untuk Pembacanya",
    "perawi_melayu": "Ibnu Umar (Semoga Allah meredhainya)",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ خَالِدٍ  ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُحَمَّدٍ الْفَزَارِيُّ  ، عَنْ سُفْيَانَ  ، عَنْ عَاصِمٍ  ، عَنْ مُجَاهِدٍ  ، عَنْ ابْنِ عُمَرَ  ، قَالَ :\" يَجِيءُ الْقُرْآنُ يَشْفَعُ لِصَاحِبِهِ، يَقُولُ : يَا رَبِّ لِكُلِّ عَامِلٍ عُمَالَةٌ مِنْ عَمَلِهِ، وَإِنِّي كُنْتُ أَمْنَعُهُ اللَّذَّةَ وَالنَّوْمَ، فَأَكْرِمْهُ، فَيُقَالُ : ابْسُطْ يَمِينَكَ، فَتُمْلَأُ مِنْ رِضْوَانِ اللَّهِ، ثُمَّ يُقَالُ : ابْسُطْ شِمَالَكَ، فَتُمْلَأُ مِنْ رِضْوَانِ اللَّهِ، وَيُكْسَى كِسْوَةَ الْكَرَامَةِ، وَيُحَلَّى بِحِلْيَةِ الْكَرَامَةِ، وَيُلْبَسُ تَاجَ الْكَرَامَةِ \"",
    "malay_translation": "Telah menceritakan kepada kami Musa bin Khalid, telah menceritakan kepada kami Ibrahim bin Muhammad al-Fazari, dari Sufyan, dari 'Asim, dari Mujahid, dari Ibnu Umar, dia berkata: \"Al-Quran akan datang memberi syafaat kepada sahabatnya (pembacanya), ia berkata: 'Ya Rabbi, bagi setiap orang yang beramal itu ada ganjaran daripada amalnya. Sesungguhnya aku (Al-Quran) telah menghalangnya daripada kenikmatan dan tidur (di dunia), maka muliakanlah dia.' Maka dikatakan: 'Bentangkanlah tangan kananmu,' lalu ia dipenuhi dengan keredhaan Allah. Kemudian dikatakan: 'Bentangkanlah tangan kirimu,' lalu ia dipenuhi dengan keredhaan Allah. Dia (pembaca Al-Quran) akan diberi pakaian kemuliaan, dihiasi dengan perhiasan kemuliaan, dan dipakaikan mahkota kemuliaan\"."
  },
  {
    "id": 40106,
    "hadith_number": 2569,
    "tajuk_hadith": "Al-Quran Memberi Syafaat dan Pakaian Kemuliaan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُوسَى بْنُ خَالِدٍ  ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُحَمَّدٍ الْفَزَارِيُّ  ، عَنْ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ  ، عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ  ، عَنْ أَبِي صَالِحٍ  ، قَالَ :\" الْقُرْآنُ يَشْفَعُ لِصَاحِبِهِ، فَيُكْسَى حُلَّةَ الْكَرَامَةِ، ثُمَّ يَقُولُ : رَبِّ زِدْهُ، فَيُكْسَى تَاجَ الْكَرَامَةِ، قَالَ : فَيَقُولُ : رَبِّ زِدْهُ، فَآتِهِ، وَآتِهِ.\n..\nقَالَ : يَقُولُ : رِضَائِي \".\n قَالَ أَبُو مُحَمَّد : قَالَ وُهَيْبُ بْنُ الْوَرْدِ : اجْعَلْ قِرَاءَتَكَ الْقُرْآنَ عِلْمًا، وَلَا تَجْعَلْهُ عَمَلًا",
    "malay_translation": "Telah mengkhabarkan kepada kami Musa bin Khalid, telah menceritakan kepada kami Ibrahim bin Muhammad al-Fazari, daripada Hasan bin Ubaidillah, daripada al-Musayyab bin Rafi', daripada Abu Soleh, beliau berkata: \"Al-Quran akan memberi syafaat kepada sahabatnya, lalu dia akan diberi pakaian kemuliaan. Kemudian dia berkata: 'Ya Rabb, tambahkanlah kepadanya.' Lalu dia diberi mahkota kemuliaan. Beliau berkata: Kemudian dia berkata: 'Ya Rabb, tambahkanlah kepadanya.' Kemudian diberikan kepadanya (kenikmatan) dan diberikan kepadanya.\n..\nBeliau berkata: Al-Quran berkata: 'KeredhaanKu'. Abu Muhammad berkata: Wahab bin al-Ward berkata: 'Jadikanlah bacaanmu al-Quran sebagai ilmu, dan janganlah menjadikannya sebagai amalan semata-mata.'"
  },
  {
    "id": 40107,
    "hadith_number": 2570,
    "tajuk_hadith": "Keutamaan Membaca Tiga Ayat Al-Quran",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ خَالِدٍ  ، حَدَّثَنَا إِبْرَاهِيمُ الْفَزَارِيُّ  ، عَنْ الْأَعْمَشِ  ، عَنْ أَبِي صَالِحٍ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" أَيُحِبُّ أَحَدُكُمْ إِذَا أَتَى أَهْلَهُ أَنْ يَجِدَ ثَلَاثَ خَلِفَاتٍ سِمَانٍ، قَالُوا : نَعَمْ يَا رَسُولَ اللَّهِ، قَالَ : \" فَثَلَاثُ آيَاتٍ يَقْرَؤُهُنَّ أَحَدُكُمْ، خَيْرٌ لَهُ مِنْهُنَّ \"",
    "malay_translation": "Daripada Abu Hurairah رضي الله عنه, beliau berkata: Rasulullah ﷺ bersabda: \"Adakah salah seorang daripada kamu suka apabila pulang kepada keluarganya mendapati tiga ekor unta betina yang gemuk? Mereka menjawab: \"Ya, wahai Rasulullah.\" Baginda bersabda: \"Maka, tiga ayat yang dibaca oleh salah seorang daripada kamu adalah lebih baik baginya daripada (mendapatkan) unta-unta tersebut.\""
  },
  {
    "id": 40108,
    "hadith_number": 2571,
    "tajuk_hadith": "Al-Quran: Jamuan Allah dan Penyembuh yang Bermanfaat",
    "perawi_melayu": "Abdullah (radhiyallahu 'anhu)",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ  ، حَدَّثَنَا إِبْرَاهِيمُ هُوَ الْهَجَرِيُّ  ، عَنْ أَبِي الْأَحْوَصِ  ، عَنْ عَبْدِ اللَّهِ  ، قَالَ :\" إِنَّ هَذَا الْقُرْآنَ مَأْدُبَةُ اللَّهِ، فَتَعَلَّمُوا مِنْ مَأْدُبَتِهِ مَا اسْتَطَعْتُمْ، إِنَّ هَذَا الْقُرْآنَ حَبْلُ اللَّهِ، وَالنُّورُ الْمُبِينُ، وَالشِّفَاءُ النَّافِعُ، عِصْمَةٌ لِمَنْ تَمَسَّكَ بِهِ، وَنَجَاةٌ لِمَنْ اتَّبَعَهُ، لَا يَزِيغُ فَيَسْتَعْتِبُ، وَلَا يَعْوَجُّ فَيُقَوَّمُ، وَلَا تَنْقَضِي عَجَائِبُهُ، وَلَا يَخْلَقُ عَنْ كَثْرَةِ الرَّدِّ، فَاتْلُوهُ، فَإِنَّ اللَّهَ يَأْجُرُكُمْ عَلَى تِلَاوَتِهِ بِكُلِّ حَرْفٍ عَشْرَ حَسَنَاتٍ، أَمَا إِنِّي لَا أَقُولُ ( الم ) وَلَكِنْ بِأَلِفٍ، وَلَامٍ، وَمِيمٍ \"",
    "malay_translation": "Diriwayatkan daripada Abdullah (radhiyallahu 'anhu) berkata: \"Sesungguhnya Al-Quran ini adalah jamuan Allah, maka pelajarilah daripada jamuan-Nya semampu kamu. Sesungguhnya Al-Quran ini adalah tali Allah, cahaya yang jelas, penyembuh yang bermanfaat, pelindung bagi sesiapa yang berpegang teguh dengannya, dan penyelamat bagi sesiapa yang mengikutinya. Ia tidak menyeleweng sehingga perlu diperbaiki, dan tidak bengkok sehingga perlu diluruskan. Keajaibannya tidak pernah berakhir, dan tidak usang kerana sering dibaca. Maka bacalah ia, kerana sesungguhnya Allah memberi pahala kepada kamu atas bacaannya dengan setiap huruf sepuluh kebaikan. Ketahuilah, aku tidak berkata (Alif, Lam, Mim) tetapi (Alif), (Lam), dan (Mim).\""
  },
  {
    "id": 40109,
    "hadith_number": 2572,
    "tajuk_hadith": "Nasihat Nabi SAW tentang Kitabullah dan Ahli Bait",
    "perawi_melayu": "Zaid bin Arqam",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ  ، حَدَّثَنَا أَبُو حَيَّانَ  ، عَنْ يَزِيدَ بْنِ حَيَّانَ  ، عَنْ زَيْدِ بْنِ أَرْقَمَ  ، قَالَ : قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا خَطِيبًا فَحَمِدَ، اللَّهَ وَأَثْنَى عَلَيْهِ، ثُمَّ قَالَ : \" يَا أَيُّهَا النَّاسُ،إِنَّمَا أَنَا بَشَرٌ يُوشِكُ أَنْ يَأْتِيَنِي رَسُولُ رَبِّي، فَأُجِيبَهُ، وَإِنِّي تَارِكٌ فِيكُمْ الثَّقَلَيْنِ : أَوَّلُهُمَا كِتَابُ اللَّهِ فِيهِ الْهُدَى وَالنُّورُ، فَتَمَسَّكُوا بِكِتَابِ اللَّهِ، وَخُذُوا بِهِ \" فَحَثَّ عَلَيْهِ وَرَغَّبَ فِيهِ، ثُمَّ قَالَ : \" وَأَهْلَ بَيْتِي، أُذَكِّرُكُمْ اللَّهَ فِي أَهْلِ بَيْتِي، ثَلَاثَ مَرَّاتٍ \"",
    "malay_translation": "Daripada Zaid bin Arqam, beliau berkata: Pada suatu hari Rasulullah SAW berdiri menyampaikan khutbah, lalu memuji Allah dan menyanjung-Nya, kemudian bersabda: \"Wahai manusia, sesungguhnya aku hanyalah seorang manusia biasa yang hampir sahaja didatangi utusan daripada Tuhanku, lalu aku menyahutinya. Sesungguhnya aku tinggalkan kepada kamu dua perkara yang berat: Pertama, Kitabullah, di dalamnya terdapat petunjuk dan cahaya, maka berpeganglah kamu dengan Kitabullah dan ambillah ia sebagai pedoman.\" Baginda SAW menggesa dan menggalakkannya. Kemudian baginda bersabda: \"Dan ahli baitku, aku ingatkan kamu kepada Allah tentang ahli baitku.\" (Baginda mengulanginya) tiga kali."
  },
  {
    "id": 40110,
    "hadith_number": 2573,
    "tajuk_hadith": "Jalan yang Lurus dan Gangguan Syaitan",
    "perawi_melayu": "Abdullah (RA) [seperti diriwayatkan dari Abu Wa'il]",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ  ، أَنْبَأَنَا الْأَعْمَشُ  ، عَنْ أَبِي وَائِلٍ  ، قَالَ : قَالَ عَبْدُ اللَّهِ   :\" إِنَّ هَذَا الصِّرَاطَ مُحْتَضَرٌ، تَحْضُرُهُ الشَّيَاطِينُ يُنَادُونَ : يَا عِبَادَ اللَّهِ، هَذَا الطَّرِيقُ، فَاعْتَصِمُوا بِحَبْلِ اللَّهِ، فَإِنَّ حَبْلَ اللَّهِ الْقُرْآنُ \"",
    "malay_translation": "Telah menceritakan kepada kami Ja'far bin 'Aun, telah mengkhabarkan kepada kami Al-A'mash, dari Abu Wa'il, dia berkata: Abdullah (RA) berkata: \"Sesungguhnya jalan yang lurus ini dikelilingi (diperhatikan) oleh syaitan. Mereka menyeru: 'Wahai hamba-hamba Allah, inilah jalan (yang benar)!' Maka berpegang teguhlah kamu dengan tali Allah (yakni) Al-Quran.\""
  },
  {
    "id": 40111,
    "hadith_number": 2574,
    "tajuk_hadith": "Malaikat Mendoakan Pembaca dan Pelajar Al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْمُغِيرَةِ  ، حَدَّثَتْنَا عَبْدَةُ  ، عَنْ خَالِدِ بْنِ مَعْدَانَ  ، قَالَ :\" إِنَّ قَارِئَ الْقُرْآنِ وَالْمُتَعَلِّمَ تُصَلِّي عَلَيْهِمْ الْمَلَائِكَةُ حَتَّى يَخْتِمُوا السُّورَةَ، فَإِذَا أَقْرَأَ أَحَدُكُمْ السُّورَةَ، فَلْيُؤَخِّرْ مِنْهَا آيَتَيْنِ حَتَّى يَخْتِمَهَا مِنْ آخِرِ النَّهَارِ كَيْ مَا تُصَلِّي الْمَلَائِكَةُ عَلَى الْقَارِئِ وَالْمُقْرِئِ مِنْ أَوَّلِ النَّهَارِ إِلَى آخِرِهِ \"",
    "malay_translation": "Abu al-Mughirah telah mengkhabarkan kepada kami, Abdah telah menceritakan kepada kami, daripada Khalid bin Ma'dan, beliau berkata: \"Sesungguhnya pembaca Al-Quran dan orang yang mempelajarinya akan didoakan oleh para malaikat sehingga mereka selesai membaca surah. Jika salah seorang daripada kamu membaca surah, maka hendaklah dia melambatkan dua ayat daripadanya sehingga dia menyelesaikannya pada akhir hari, agar para malaikat mendoakan pembaca dan orang yang mengajar dari awal hingga akhir hari.\""
  },
  {
    "id": 40112,
    "hadith_number": 2575,
    "tajuk_hadith": "Membaca Al-Quran dan Hati yang Memahami",
    "perawi_melayu": "Abu Umamah (RA)",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ  ، أَنْبَأَنَا حَرِيزٌ  ، عَنْ شُرَحْبِيلَ بْنِ مُسْلِمٍ الْخَوْلَانِيِّ  ، عَنْ أَبِي أُمَامَةَ   : أَنَّهُ كَانَ يَقُولُ :\" اقْرَءُوا الْقُرْآنَ، وَلَا يَغُرَّنَّكُمْ هَذِهِ الْمَصَاحِفُ الْمُعَلَّقَةُ، فَإِنَّ اللَّهَ لَنْ يُعَذِّبَ قَلْبًا وَعَى الْقُرْآنَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Al-Hakam bin Nafi', telah mengkhabarkan kepada kami Hariz, daripada Syurahbil bin Muslim Al-Khawlani, daripada Abu Umamah (RA), bahawa dia berkata: \"Bacalah Al-Quran, dan janganlah kamu terpedaya dengan mushaf-mushaf yang tergantung (tidak dibaca), kerana sesungguhnya Allah tidak akan mengazab hati yang memahami Al-Quran.\""
  },
  {
    "id": 40113,
    "hadith_number": 2576,
    "tajuk_hadith": "Keutamaan Membaca dan Menghayati Al-Quran",
    "perawi_melayu": "Abu Umamah Al-Bahili",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، حَدَّثَنِي مُعَاوِيَةُ بْنُ صَالِحٍ  ، عَنْ سُلَيْمِ بْنِ عَامِرٍ  ، عَنْ أَبِي أُمَامَةَ الْبَاهِلِيِّ  ، قَالَ :\" : اقْرَءُوا الْقُرْآنَ، وَلَا يَغُرَّنَّكُمْ هَذِهِ الْمَصَاحِفُ الْمُعَلَّقَةُ، فَإِنَّ اللَّهَ لَا يُعَذِّبُ قَلْبًا وَعَى الْقُرْآنَ \"",
    "malay_translation": "Daripada Abu Umamah Al-Bahili, beliau berkata: \"Bacalah Al-Quran, dan janganlah kamu terpedaya dengan mushaf-mushaf yang tergantung (tidak dibaca). Sesungguhnya Allah tidak akan mengazab hati yang menghayati Al-Quran.\""
  },
  {
    "id": 40114,
    "hadith_number": 2577,
    "tajuk_hadith": "Adab Allah ialah Al-Quran",
    "perawi_melayu": "Ibnu Mas'ud (Semoga Allah meredhainya)",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا مِسْعَرٌ  ، عَنْ مَعْنِ بْنِ عَبْدِ الرَّحْمَنِ  ، عَنْ ابْنِ مَسْعُودٍ  ، قَالَ :\" لَيْسَ مِنْ مُؤَدِّبٍ إِلَّا وَهُوَ يُحِبُّ أَنْ يُؤْتَى أَدَبُهُ، وَإِنَّ أَدَبَ اللَّهِ الْقُرْآنُ \"",
    "malay_translation": "Diriwayatkan daripada Ibnu Mas'ud (Semoga Allah meredhainya), beliau berkata: \"Tidak ada seorang yang mendidik melainkan dia suka jika adabnya dituruti. Sesungguhnya adab Allah itu adalah Al-Quran.\""
  },
  {
    "id": 40115,
    "hadith_number": 2578,
    "tajuk_hadith": "Al-Quran: Jamuan Allah, Sesiapa Yang Memasukinya Selamat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَهْلُ بْنُ حَمَّادٍ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ عَبْدِ الْمَلِكِ بْنِ مَيْسَرَةَ  ، عَنْ أَبِي الْأَحْوَصِ  ، قَالَ : كَانَ عَبْدُ اللَّهِ  ، يَقُولُ :\" إِنَّ هَذَا الْقُرْآنَ مَأْدُبَةُ اللَّهِ، فَمَنْ دَخَلَ فِيهِ، فَهُوَ آمِنٌ \"",
    "malay_translation": "Diriwayatkan daripada Abu al-Ahwas, beliau berkata: Adalah Abdullah (Ibnu Mas'ud) berkata: 'Sesungguhnya Al-Quran ini adalah jamuan Allah, maka sesiapa yang memasukinya, maka dia aman.'"
  },
  {
    "id": 40116,
    "hadith_number": 2579,
    "tajuk_hadith": "Kegembiraan Bagi Pencinta Al-Quran",
    "perawi_melayu": "Abdullah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ حَمَّادٍ  ، حَدَّثَنَا أَبُو عَوَانَةَ  ، عَنْ الْأَعْمَشِ  ، عَنْ إِبْرَاهِيمَ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ  ،  عَنْ عَبْدِ اللَّهِ  ، قَالَ :\" مَنْ أَحَبَّ الْقُرْآنَ، فَلْيُبْشِرْ \"",
    "malay_translation": "Diriwayatkan daripada Abdullah, beliau berkata: \"Sesiapa yang mencintai Al-Quran, bergembiralah.\""
  },
  {
    "id": 40117,
    "hadith_number": 2580,
    "tajuk_hadith": "Kegembiraan Bagi Pencinta Al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْلَى  ، حَدَّثَنَا الْأَعْمَشُ  ، عَنْ إِبْرَاهِيمَ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ  ، عَنْ عَبْدِ اللَّهِ  ، قَالَ :\" مَنْ أَحَبَّ الْقُرْآنَ، فَلْيُبْشِرْ \"",
    "malay_translation": "Diriwayatkan daripada Abdullah, “Sesiapa yang mencintai Al-Quran, bergembiralah.” (Hadis ini diriwayatkan oleh Ya'la, daripada al-A'mash, daripada Ibrahim, daripada Abd al-Rahman ibn Yazid, daripada Abdullah.)"
  },
  {
    "id": 40118,
    "hadith_number": 2581,
    "tajuk_hadith": "Al-Quran Memberi Syafaat pada Hari Kiamat",
    "perawi_melayu": "Diriwayatkan oleh Ibnu Mas'ud (semoga Allah meredhainya)",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ  ، أَنْبَأَنَا هَمَّامٌ  ، عَنْ عَاصِمِ بْنِ أَبِي النُّجُودِ  ، عَنِ الشَّعْبِيِّ  : أَنَّ ابْنَ مَسْعُودٍ   كَانَ يَقُولُ :\" يَجِيءُ الْقُرْآنُ يَوْمَ الْقِيَامَةِ فَيَشْفَعُ لِصَاحِبِهِ، فَيَكُونُ لَهُ قَائِدًا إِلَى الْجَنَّةِ، وَيَشْهَدُ عَلَيْهِ، وَيَكُونُ لَهُ سَائِقًا إِلَى النَّارِ \"",
    "malay_translation": "Daripada Ibnu Mas'ud (semoga Allah meredhainya) berkata: \"Al-Quran akan datang pada Hari Kiamat lalu memberi syafaat kepada pembacanya. Ia akan menjadi penunjuk jalan ke syurga dan menjadi saksi baginya. Ia juga akan menjadi penyebab kepada neraka (bagi mereka yang mengabaikannya).\""
  },
  {
    "id": 40119,
    "hadith_number": 2582,
    "tajuk_hadith": "Ahli Allah dari Kalangan Manusia: Ahli al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا الْحَسَنُ بْنُ أَبِي جَعْفَرٍ  ، حَدَّثَنَا بُدَيْلٌ  ، عَنْ أَنَسٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِنَّ لِلَّهِ أَهْلِينَ مِنَ النَّاسِ، قِيلَ : يَا رَسُولَ اللَّهِ، مَنْ هُمْ؟ قَالَ : أَهْلُ الْقُرْآنِ \"",
    "malay_translation": "Muslim bin Ibrahim meriwayatkan, Hasan bin Abi Ja'far meriwayatkan, Budail meriwayatkan, dari Anas, dia berkata: Rasulullah SAW bersabda: \"Sesungguhnya Allah mempunyai ahli-ahli daripada kalangan manusia.\" Lalu ditanya: \"Wahai Rasulullah, siapakah mereka?\" Baginda bersabda: \"Ahli al-Quran.\""
  },
  {
    "id": 40120,
    "hadith_number": 2583,
    "tajuk_hadith": "Al-Quran: Pemahaman Akal dan Nur Hikmah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ عَاصِمِ بْنِ بَهْدَلَةَ  ، عَنْ مُغِيثٍ  ، عَنْ كَعْبٍ  ، قَالَ :\" عَلَيْكُمْ بِالْقُرْآنِ، فَإِنَّهُ فَهْمُ الْعَقْلِ، وَنُورُ الْحِكْمَةِ، وَيَنَابِيعُ الْعِلْمِ، وَأَحْدَثُ الْكُتُبِ بِالرَّحْمَنِ عَهْدًا، وَقَالَ فِي التَّوْرَاةِ : يَا مُحَمَّدُ ، إِنِّي مُنَزِّلٌ عَلَيْكَ تَوْرَاةً حَدِيثَةً، تَفْتَحُ فِيهَا أَعْيُنًا عُمْيًا، وَآذَانًا صُمًّا، وَقُلُوبًا غُلْفًا \"",
    "malay_translation": "Daripada Ka'ab, beliau berkata: \"Hendaklah kamu berpegang teguh dengan Al-Quran, kerana sesungguhnya ia adalah pemahaman akal, nur hikmah, sumber-sumber ilmu, dan merupakan kitab yang paling baharu dari Allah yang Maha Pemurah perjanjiannya. Dan Allah berfirman dalam Taurat: 'Wahai Muhammad, sesungguhnya Aku akan menurunkan kepadamu Taurat yang baharu, yang akan membuka mata yang buta, telinga yang pekak, dan hati yang tertutup.'\""
  },
  {
    "id": 40121,
    "hadith_number": 2584,
    "tajuk_hadith": "Al-Quran: Pahala, Peringatan, Cahaya, dan Tanggungan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَهْلُ بْنُ حَمَّادٍ  ، حَدَّثَنَا شُعْبَةُ  ، حَدَّثَنَا زِيَادُ بْنُ مِخْرَاقٍ  ، عَنْ أَبِي إِيَاسٍ  ، عَنْ أَبِي كِنَانَةَ  ، عَنْ أَبِي مُوسَى  ، أَنَّهُ قَالَ :\" إِنَّ هَذَا الْقُرْآنَ كَائِنٌ لَكُمْ أَجْرًا، وَكَائِنٌ لَكُمْ ذِكْرًا، وَكَائِنٌ بِكُمْ نُورًا، وَكَائِنٌ عَلَيْكُمْ وِزْرًا، اتَّبِعُوا الْقُرْآنَ، وَلَا يَتَّبِعْكُمْ الْقُرْآنُ، فَإِنَّهُ مَنْ يَتَّبِعْ الْقُرْآنَ، يَهْبِطْ بِهِ فِي رِيَاضِ الْجَنَّةِ، وَمَنْ اتَّبَعَهُ الْقُرْآنُ يَزُخُّ فِي قَفَاهُ، فَيَقْذِفُهُ فِي جَهَنَّمَ \".\nقَالَ أَبُو مُحَمَّد : يَزُخُّ : يَدْفَعُ",
    "malay_translation": "Daripada Abu Musa (RA), sesungguhnya dia berkata: \"Sesungguhnya Al-Quran ini akan menjadi ganjaran bagi kamu, menjadi peringatan bagi kamu, menjadi cahaya bagi kamu, dan menjadi tanggungan bagi kamu. Ikutilah Al-Quran dan janganlah Al-Quran mengikutimu. Sesungguhnya sesiapa yang mengikuti Al-Quran, dia akan dibawa turun ke taman-taman syurga. Dan sesiapa yang diikuti oleh Al-Quran, dia akan ditolak ke belakang dan dicampakkan ke dalam neraka.\" Abu Muhammad berkata: 'Yazukku' bermaksud 'mendorong'."
  },
  {
    "id": 40122,
    "hadith_number": 2585,
    "tajuk_hadith": "Kategori Pembaca Al-Quran",
    "perawi_melayu": "Ali bin Abi Talib (Semoga Allah meridhainya)",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ  ، حَدَّثَنَا مُوسَى بْنُ أَيُّوبَ  ، قَالَ سَمِعْتُ عَمِّي إِيَاسَ بْنَ عَامِرٍ  ، يَقُولُ : أَخَذَ عَلِيُّ بْنُ أَبِي طَالِبٍ   بِيَدِي، ثُمَّ قَالَ :\" إِنَّكَ إِنْ بَقِيتَ، سَيَقْرَأُ الْقُرْآنَ ثَلَاثَةُ أَصْنَافٍ : فَصِنْفٌ لِلَّهِ، وَصِنْفٌ لِلْجِدَالِ، وَصِنْفٌ لِلدُّنْيَا، وَمَنْ طَلَبَ بِهِ أَدْرَكَ \"",
    "malay_translation": "Abdullah bin Yazid telah meriwayatkan kepada kami, Musa bin Ayyub telah meriwayatkan kepada kami, dia berkata: Aku mendengar bapa saudaraku, Iyas bin Amir, berkata: Ali bin Abi Talib memegang tanganku, kemudian berkata: \"Sesungguhnya jika kamu masih hidup, akan membaca Al-Quran tiga golongan: satu golongan untuk Allah, satu golongan untuk perdebatan, dan satu golongan untuk dunia. Dan sesiapa yang mencarinya, dia akan mendapatkannya.\""
  },
  {
    "id": 40123,
    "hadith_number": 2586,
    "tajuk_hadith": "Ucapan Salam dan Nasihat Abu Darda kepada Penduduk Kufah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، عَنْ حَمَّادِ بْنِ زَيْدٍ  ، عَنْ أَيُّوبَ  ، عَنْ أَبِي قِلَابَةَ  : أَنَّ رَجُلًا قَالَ لِأَبِي الدَّرْدَاءِ   : \" إِنَّ إِخْوَانَكَ مِنْ أَهْلِ الْكُوفَةِ ، مِنْ أَهْلِ الذِّكْرِ، يُقْرِئُونَكَ السَّلَامَ.\nفَقَالَ : وَعَلَيْهِمْ السَّلَامُ، وَمُرْهُمْفَلْيُعْطُوا الْقُرْآنَ بِخَزَائِمِهِمْ، فَإِنَّهُ يَحْمِلُهُمْ عَلَى الْقَصْدِ وَالسُّهُولَةِ، وَيُجَنِّبُهُمْ الْجَوْرَ وَالْحُزُونَةَ \"",
    "malay_translation": "Diriwayatkan daripada Sulaiman bin Harb, daripada Hammad bin Zaid, daripada Ayyub, daripada Abu Qilabah: Bahawa seorang lelaki berkata kepada Abu Darda': \"Sesungguhnya saudara-saudaramu dari penduduk Kufah, daripada golongan ahli zikir, menyampaikan salam kepadamu.\" Maka Abu Darda' menjawab: \"Wa'alaikumussalam (semoga keselamatan juga ke atas mereka), dan suruhlah mereka agar berpegang teguh dengan Al-Quran, kerana sesungguhnya Al-Quran akan membawa mereka kepada kesederhanaan dan kemudahan, dan menjauhkan mereka daripada kezaliman dan kesedihan."
  },
  {
    "id": 40124,
    "hadith_number": 2587,
    "tajuk_hadith": "Al-Quran: Sumber Utama dalam Menghadapi Fitnah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَزِيدَ الرِّفَاعِيُّ  ، حَدَّثَنَا الْحُسَيْنُ الْجُعْفِيُّ  ، عَنْ حَمْزَةَ الزَّيَّاتِ  ، عَنْ أَبِي الْمُخْتَارِ الطَّائِيِّ  ، عَنْ ابْنِ أَخِي الْحَارِثِ  ، عَنْ الْحَارِثِ  ، قَالَ : دَخَلْتُ الْمَسْجِدَ، فَإِذَا أُنَاسٌ يَخُوضُونَ فِي أَحَادِيثَ، فَدَخَلْتُ عَلَى عَلِيٍّ  ، فَقُلْتُ : أَلَا تَرَى أَنَّ أُنَاسًا يَخُوضُونَ فِي الْأَحَادِيثِ فِي الْمَسْجِدِ؟ فَقَالَ : قَدْ فَعَلُوهَا؟ قُلْتُ : نَعَمْ، قَالَ : أَمَا إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" سَتَكُونُ فِتَنٌ \"، قُلْتُ : وَمَا الْمَخْرَجُ مِنْهَا؟ قَالَ : كِتَابُ اللَّهِ، كِتَابُ اللَّهِ فِيهِ نَبَأُ مَا قَبْلَكُمْ، وَخَبَرُ مَا بَعْدَكُمْ، وَحُكْمُ مَا بَيْنَكُمْ، هُوَ الْفَصْلُ لَيْسَ بِالْهَزْلِ، هُوَ الَّذِي مَنْ تَرَكَهُ مِنْ جَبَّارٍ، قَصَمَهُ اللَّهُ، وَمَنْ ابْتَغَى الْهُدَى فِي غَيْرِهِ، أَضَلَّهُ اللَّهُ، فَهُوَ حَبْلُ اللَّهِ الْمَتِينُ، وَهُوَ الذِّكْرُ الْحَكِيمُ، وَهُوَ الصِّرَاطُ الْمُسْتَقِيمُ، وَهُوَ الَّذِي لَا تَزِيغُ بِهِ الْأَهْوَاءُ، وَلَا تَلْتَبِسُ بِهِ الْأَلْسِنَةُ، وَلَا يَشْبَعُ مِنْهُ الْعُلَمَاءُ، وَلَا يَخْلَقُ عَنْ كَثْرَةِ الرَّدِّ، وَلَا تَنْقَضِي عَجَائِبُهُ، وَهُوَ الَّذِي لَمْ يَنْتَهِ الْجِنُّ إِذْ سَمِعَتْهُ أَنْ قَالُوا : # إِنَّا سَمِعْنَا قُرْءَانًا عَجَبًا سورة الجن آية 1 #، هُوَ الَّذِي مَنْ قَالَ بِهِ صَدَقَ، وَمَنْ حَكَمَ بِهِ عَدَلَ، وَمَنْ عَمِلَ بِهِ أُجِرَ، وَمَنْ دَعَا إِلَيْهِ هُدِيَ إِلَى صِرَاطٍ مُسْتَقِيمٍ \"خُذْهَا إِلَيْكَ يَا أَعْوَرُ",
    "malay_translation": "Diriwayatkan daripada Al-Harith, dia berkata: \"Aku masuk ke masjid, tiba-tiba ada orang berbincang tentang perkara lain (selain daripada agama). Aku kemudiannya berjumpa dengan Ali dan berkata, 'Tidakkah kamu melihat ada orang berbincang tentang perkara lain di dalam masjid?' Ali berkata, 'Adakah mereka melakukannya?' Aku berkata, 'Ya'. Ali berkata, 'Ketahuilah, aku pernah mendengar Rasulullah SAW bersabda: 'Akan berlaku fitnah (ujian)'. Aku bertanya, 'Apakah jalan keluar daripadanya?' Baginda bersabda, 'Kitabullah (Al-Quran), Kitabullah. Di dalamnya terdapat berita tentang orang-orang sebelum kamu, berita tentang orang-orang selepas kamu, dan hukum antara kamu. Ia adalah pemisah (antara yang hak dan batil), bukan gurauan. Sesiapa yang meninggalkannya dari kalangan orang yang sombong, Allah akan membinasakannya. Sesiapa yang mencari petunjuk selain daripadanya, Allah akan menyesatkannya. Ia adalah tali Allah yang kukuh, ia adalah peringatan yang bijaksana, dan ia adalah jalan yang lurus. Ia adalah (Al-Quran) yang tidak menyelewengkan hawa nafsu, tidak mengelirukan lidah, tidak membuat para ulama merasa puas, tidak menjadi usang kerana terlalu banyak diulang, dan tidak pernah habis keajaibannya. Ia (Al-Quran) yang apabila jin mendengarnya, mereka berkata: 'Sesungguhnya kami telah mendengar Al-Quran yang menakjubkan'. Sesiapa yang berkata dengannya (Al-Quran), dia benar. Sesiapa yang menghukum dengannya, dia adil. Sesiapa yang beramal dengannya, dia diberi ganjaran. Sesiapa yang menyeru kepadanya, dia diberi petunjuk ke jalan yang lurus. (Kemudian Ali berkata), 'Ambillah ia wahai orang yang buta sebelah mata!'\""
  },
  {
    "id": 40125,
    "hadith_number": 2588,
    "tajuk_hadith": "Al-Quran: Penyelesaian Bagi Fitnah",
    "perawi_melayu": "Ali (r.a.)",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ  ، حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ  ، حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ  ، عَنْ ابْنِ سِنَانٍ  ، عَنْ عَمْرِو بْنِ مُرَّةَ  ، عَنْ أَبِي الْبَخْتَرِيِّ  ، عَنِ الْحَارِثِ  ، عَنْ عَلِيٍّ  ، قَالَ : قِيلَ : يَا رَسُولَ اللَّهِ، إِنَّ أُمَّتَكَ سَتُفْتَتَنُ مِنْ بَعْدِكَ، قَالَ : فَسَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ سُئِلَ : مَا الْمَخْرَجُ مِنْهَا؟ قَالَ :\" الْكِتَابُ الْعَزِيزُ الَّذِي # لا يَأْتِيهِ الْبَاطِلُ مِنْ بَيْنِ يَدَيْهِ وَلا مِنْ خَلْفِهِ تَنْزِيلٌ مِنْ حَكِيمٍ حَمِيدٍ سورة فصلت آية 42 # مَنِ ابْتَغَى الْهُدَى فِي غَيْرِهِ، فَقَدْ أَضَلَّهُ اللَّهُ، وَمَنْ وَلِيَ هَذَا الْأَمْرَ مِنْ جَبَّارٍ فَحَكَمَ بِغَيْرِهِ، قَصَمَهُ اللَّهُ، هُوَ الذِّكْرُ الْحَكِيمُ، وَالنُّورُ الْمُبِينُ، وَالصِّرَاطُ الْمُسْتَقِيمُ، فِيهِ خَبَرُ مَنْ قَبْلَكُمْ، وَنَبَأُ مَا بَعْدَكُمْ، وَحُكْمُ مَا بَيْنَكُمْ، وَهُوَ الْفَصْلُ لَيْسَ بِالْهَزْلِ، وَهُوَ الَّذِي سَمِعَتْهُ الْجِنُّ فَلَمْ تَتَنَاهَ أَنْ قَالُوا : # إِنَّا سَمِعْنَا قُرْءَانًا عَجَبًا سورة الجن آية 1 #، وَلَا يَخْلَقُ عَنْ كَثْرَةِ الرَّدِّ، وَلَا تَنْقَضِي عِبَرُهُ، وَلَا تَفْنَى عَجَائِبُهُ \"، ثُمَّ قَالَ عَلِيٌّ لِلْحَارِثِ : خُذْهَا إِلَيْكَ يَا أَعْوَرُ",
    "malay_translation": "Diriwayatkan dari Ali (r.a.), beliau berkata: Pernah ditanyakan: “Wahai Rasulullah, sesungguhnya umatmu akan ditimpa fitnah sesudahmu.” Beliau bersabda: Lalu Rasulullah SAW ditanya atau beliau ditanya: “Apakah jalan keluarnya dari hal itu?” Beliau bersabda: “Al-Quran yang mulia, yang tidak datang kepadanya kebatilan, baik dari depan maupun dari belakangnya, yang diturunkan dari (Allah) Yang Maha Bijaksana, Maha Terpuji. (Surah Fussilat:42) Barangsiapa yang mencari petunjuk selain daripadanya, maka sungguh dia telah sesat. Dan barangsiapa yang menguasai urusan ini (kekuasaan) dari seorang yang zalim lalu dia menghukumi selain dengan Al-Quran, maka Allah akan membinasakannya. Ia (Al-Quran) adalah peringatan yang bijaksana, cahaya yang terang, dan jalan yang lurus. Di dalamnya terdapat berita orang-orang sebelum kamu, dan berita orang-orang sesudahmu, serta hukum yang ada di antara kamu. Ia adalah pemisah yang tegas, bukan senda gurau. Ia adalah (Al-Quran) yang didengar oleh jin, sehingga mereka tidak mampu lagi berkata-kata selain dari, “Sesungguhnya kami telah mendengar Al-Quran yang menakjubkan.” (Surah Al-Jinn:1) Ia tidak akan usang kerana sering diulang-ulang, tidak akan pernah habis pengajaran-pengajarannya, dan tidak akan pernah lenyap keajaiban-keajaibannya.” Kemudian Ali berkata kepada Al-Harith: “Ambillah ini (kata-kata) darimu, wahai orang yang buta sebelah mata.”"
  },
  {
    "id": 40126,
    "hadith_number": 2589,
    "tajuk_hadith": "Kurniaan Hikmah dan Pemahaman Al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ ، حَدَّثَنَا سُفْيَانُ ، عَنْ أَبِي حمزة ، عَنْ إِبْرَاهِيمَ  : # وَمَنْ يُؤْتَ الْحِكْمَةَ فَقَدْ أُوتِيَ خَيْرًا كَثِيرًا سورة البقرة آية 269 #، قَالَ :\" الْفَهْمَ بِالْقُرْآنِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Yusuf, telah menceritakan kepada kami Sufyan, daripada Abu Hamzah, daripada Ibrahim: # Dan sesiapa yang diberi hikmah, maka sesungguhnya dia telah diberi kebaikan yang banyak (Surah Al-Baqarah: Ayat 269) #, beliau berkata: \"Pemahaman (iaitu) Al-Quran\""
  },
  {
    "id": 40127,
    "hadith_number": 2590,
    "tajuk_hadith": "Tafsir Ayat: Allah Memberi Hikmah kepada Sesiapa yang Dikehendaki-Nya",
    "perawi_melayu": "Muhammad bin Yusuf, daripada Warqa', daripada Ibn Abi Najih, daripada Mujahid",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ ، عَنْ وَرْقَاءَ ، عَنْ ابْنِ أَبِي نَجِيحٍ ، عَنْ مُجَاهِدٍ  : # يُؤْتِي الْحِكْمَةَ مَنْ يَشَاءُ سورة البقرة آية 269 #، قَالَ :\" الْكِتَابَ يُؤْتِي إِصَابَتَهُ مَنْ يَشَاءُ \"",
    "malay_translation": "Diriwayatkan daripada Mujahid mengenai firman Allah: \"Allah memberi hikmah kepada sesiapa yang dikehendaki-Nya\" (Surah al-Baqarah: 269), beliau berkata: \"(Allah) memberi (pemahaman tentang) al-Kitab kepada sesiapa yang dikehendaki-Nya.\""
  },
  {
    "id": 40128,
    "hadith_number": 2591,
    "tajuk_hadith": "Larangan Memasukkan Peminum Arak ke Dalam Rumah yang Dibacakan Al-Quran",
    "perawi_melayu": "Khaitamah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَزِيدَ ، حَدَّثَنَا أَبُو بَكْرٍ ، عَنْ الْأَعْمَشِ ، عَنْ خَيْثَمَةَ ، قَالَ : قَالَ لِامْرَأَتِهِ :\" إِيَّاكِ أَنْ تُدْخِلِي بَيْتِي مَنْ يَشْرَبُ الْخَمْرَ، بَعْدَ أَنْ كَانَ يُقْرَأُ فِيهِ الْقُرْآنُ كُلَّ ثَلَاثٍ \"",
    "malay_translation": "Muhammad bin Yazid telah mengkhabarkan kepada kami, Abu Bakr menceritakan kepada kami, daripada Al-A'mash, daripada Khaitamah, dia berkata: Suaminya berkata kepada isterinya: \"Jauhilah daripada memasukkan ke dalam rumahku sesiapa yang meminum arak, setelah rumah itu dibacakan Al-Quran setiap tiga hari\"."
  },
  {
    "id": 40129,
    "hadith_number": 2592,
    "tajuk_hadith": "Membaca Ayat Al-Quran Selepas Kembali dari Pasar atau Urusan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا فِطْرٌ  ، عَنْ الْحَكَمِ  ، عَنْ مِقْسَمٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ :\" مَا يَمْنَعُ أَحَدَكُمْ إِذَا رَجَعَ مِنْ سُوقِهِ، أَوْ مِنْ حَاجَتِهِ، فَاتَّكَأَ عَلَى فِرَاشِهِ، أَنْ يَقْرَأَ ثَلَاثَ آيَاتٍ مِنْ الْقُرْآنِ؟ ! \"",
    "malay_translation": "Abu Nu'aim telah meriwayatkan kepada kami, Fithr telah meriwayatkan kepada kami, daripada Al-Hakam, daripada Miqsam, daripada Ibnu Abbas, beliau berkata: \"Apakah yang menghalang seseorang daripada kamu, apabila dia pulang dari pasarnya, atau dari keperluannya, lalu berbaring di tempat tidurnya, untuk membaca tiga ayat daripada Al-Quran?\""
  },
  {
    "id": 40130,
    "hadith_number": 2593,
    "tajuk_hadith": "Kebaikan Orang yang Belajar dan Mengajar Al-Quran",
    "perawi_melayu": "Daripada 'Ali",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا عَبْدُ الْوَاحِدِ  ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَاق  ، حَدَّثَنَا النُّعْمَانُ بْنُ سَعْدٍ  ، عَنْ عَلِيٍّ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ \"",
    "malay_translation": "Muslim bin Ibrahim telah mengkhabarkan kepada kami, telah menceritakan kepada kami Abdul Wahid, telah menceritakan kepada kami Abdur-Rahman bin Ishaq, telah menceritakan kepada kami An-Nu'man bin Sa'd, daripada 'Ali, beliau berkata: Rasulullah SAW bersabda: \"Sebaik-baik kamu adalah orang yang belajar Al-Quran dan mengajarkannya.\""
  },
  {
    "id": 40131,
    "hadith_number": 2594,
    "tajuk_hadith": "Keutamaan Mereka yang Mengajar dan Mempelajari Al-Quran",
    "perawi_melayu": "Uthman (RA)",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْحَجَّاجُ بْنُ مِنْهَالٍ  ، حَدَّثَنَا شُعْبَةُ  ، أَخْبَرَنِي عَلْقَمَةُ بْنُ مَرْثَدٍ  ، قَالَ : سَمِعْتُ سَعْدَ بْنَ عُبَيْدَةَ  ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ  ،  عَنْ عُثْمَانَ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" إِنَّ خَيْرَكُمْ مَنْ عَلَّمَ الْقُرْآنَ، أَوْ تَعَلَّمَهُ \".\nقَالَ : أَقْرَأَ أَبُو عَبْدِ الرَّحْمَنِ فِي إِمْرَةِ عُثْمَانَ حَتَّى كَانَ الْحَجَّاجُ، قَالَ : ذَاكَ أَقْعَدَنِي مَقْعَدِي هَذَا",
    "malay_translation": "Daripada Uthman (RA), daripada Nabi SAW, baginda bersabda: \"Sesungguhnya sebaik-baik kamu ialah orang yang mempelajari Al-Quran dan mengajarkannya.\""
  },
  {
    "id": 40132,
    "hadith_number": 2595,
    "tajuk_hadith": "Kelebihan Orang yang Belajar dan Mengajar al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْمُعَلَّى بْنُ أَسَدٍ  ، حَدَّثَنَا الْحَارِثُ بْنُ نَبْهَانَ  ، حَدَّثَنَا عَاصِمُ بْنُ بَهْدَلَةَ  ، عَنْ مُصْعَبِ بْنِ سَعْدٍ  ، عَنْ أَبِيهِ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" خِيَارُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ، وَعَلَّمَ الْقُرْآنَ \"، قَالَ : فَأَخَذَ بِيَدِي، فَأَقْعَدَنِي هَذَا الْمَقْعَدَ أُقْرِئُ",
    "malay_translation": "Daripada Mu'alla bin Asad, daripada Al-Harith bin Nabhan, daripada 'Asim bin Bahdalah, daripada Mus'ab bin Sa'd, daripada bapanya, berkata: Rasulullah SAW bersabda: \"Sebaik-baik kamu adalah orang yang belajar al-Quran dan mengajarkannya.\" Beliau berkata: Maka Baginda memegang tanganku lalu mendudukkanku di tempat ini untuk mengajar."
  },
  {
    "id": 40133,
    "hadith_number": 2596,
    "tajuk_hadith": "Orang yang Belajar Al-Quran Kemudian Melupakannya",
    "perawi_melayu": "Seseorang daripada Saad bin Ubadah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ  ، عَنْ شُعْبَةَ  ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ  ، عَنْ عِيسَى  ، عَنْ رَجُلٍ  ، عَنْ سَعْدِ بْنِ عُبَادَةَ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَا مِنْ رَجُلٍ يَتَعَلَّمُ الْقُرْآنَ ثُمَّ يَنْسَاهُ، إِلَّا لَقِيَ اللَّهَ يَوْمَ الْقِيَامَةِ وَهُوَ أَجْذَمُ \"، قَالَ أَبُو مُحَمَّد : عِيسَى وهُوَ ابْنُ فَائِدٍ",
    "malay_translation": "Daripada Saad bin Ubadah, bahawa Rasulullah SAW bersabda: \"Tidaklah seseorang lelaki mempelajari Al-Quran kemudian melupakannya, melainkan dia akan menemui Allah pada Hari Kiamat dalam keadaan terputus (daripada rahmat).\" Kata Abu Muhammad: 'Isa ialah anak kepada Fa'id."
  },
  {
    "id": 40134,
    "hadith_number": 2597,
    "tajuk_hadith": "Galakkan Membaca Al-Quran Sebelum Diangkat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ  ، حَدَّثَنَا مُوسَى بْنُ عُبَيْدَةَ  ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ  ، عَنْ نَاجِيَةَ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ L7835 ، عَنْ أَبِيهِ  ، عَنْ عَبْدِ اللَّهِ  ، قَالَ :\" أَكْثِرُوا تِلَاوَةَ الْقُرْآنِ قَبْلَ أَنْ يُرْفَعَ، قَالُوا : هَذِهِ الْمَصَاحِفُ تُرْفَعُ، فَكَيْفَ بِمَا فِي صُدُورِ الرِّجَالِ؟ قَالَ : يُسْرَى عَلَيْهِ لَيْلًا فَيُصْبِحُونَ مِنْهُ فُقَرَاءَ، وَيَنْسَوْنَ قَوْلَ : لَا إِلَهَ إِلَّا اللَّهُ، وَيَقَعُونَ فِي قَوْلِ الْجَاهِلِيَّةِ وَأَشْعَارِهِمْ، وَذَلِكَ حِينَ يَقَعُ عَلَيْهِمْ الْقَوْلُ \"",
    "malay_translation": "Diriwayatkan daripada Abdullah: \"Perbanyakkanlah membaca Al-Quran sebelum ia diangkat.\" Mereka bertanya: \"Al-Quran dalam bentuk mushaf akan diangkat, tetapi bagaimana pula dengan yang ada dalam dada orang?\" Beliau menjawab: \"Ia akan dihilangkan pada waktu malam, dan mereka akan bangun dalam keadaan yang miskin daripadanya. Mereka akan lupa ucapan 'La ilaha illallah' (Tiada Tuhan selain Allah), dan mereka akan kembali kepada ucapan-ucapan jahiliyyah dan syair-syair mereka. Dan itulah saat (azab) diturunkan kepada mereka.\""
  },
  {
    "id": 40135,
    "hadith_number": 2598,
    "tajuk_hadith": "Amalkan Al-Quran dalam Hati dan Rumah Tangga",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْمُعَلَّى بْنُ أَسَدٍ ، حَدَّثَنَا سَلَّامٌ يَعْنِي ابْنَ أَبِي مُطِيعٍ ، قَالَ : كَانَ قَتَادَةُ ، يَقُولُ :\" اعْمُرُوا بِهِ قُلُوبَكُمْ، وَاعْمُرُوا بِهِ بُيُوتَكُمْ \"، قَالَ : أُرَاهُ يَعْنِي : الْقُرْآنَ",
    "malay_translation": "Diriwayatkan oleh Al-Mu'alla bin Asad, diriwayatkan oleh Sallam, iaitu Ibnu Abi Mutii', berkata: Qatadah berkata: \"Makmurkanlah hati kamu dengannya (Al-Quran), dan makmurkanlah rumah tangga kamu dengannya.\" Beliau berkata: Saya melihat beliau (Qatadah) bermaksud: Al-Quran."
  },
  {
    "id": 40136,
    "hadith_number": 2599,
    "tajuk_hadith": "Al-Quran Akan Diangkat",
    "perawi_melayu": "Ibnu Mas'ud",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ عَاصِمٍ  ، عَنْ زِرٍّ  ، عَنْ ابْنِ مَسْعُودٍ  ، قَالَ :\" لَيُسْرَيَنَّ عَلَى الْقُرْآنِ ذَاتَ لَيْلَةٍ، فَلَا يُتْرَكُ آيَةٌ فِي مُصْحَفٍ، وَلَا فِي قَلْبِ أَحَدٍ، إِلَّا رُفِعَتْ \"",
    "malay_translation": "Daripada Ibnu Mas'ud berkata: \"Al-Quran akan diangkat pada suatu malam, maka tidak akan ada satu ayat pun yang ditinggalkan dalam mushaf (Al-Quran), mahupun dalam hati seseorang, melainkan akan diangkat (dari dunia).\""
  },
  {
    "id": 40137,
    "hadith_number": 2600,
    "tajuk_hadith": "Manfaat Membaca Al-Quran",
    "perawi_melayu": "Muhammad bin Kathir, daripada Abdullah bin Waqid, daripada Qatadah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ ، عَنْ عَبْدِ اللَّهِ بْنِ وَاقِدٍ ، عَنْ قَتَادَةَ ، قَالَ :\" مَا جَالَسَ الْقُرْآنَ أَحَدٌ فَقَامَ عَنْهُ، إِلَّا بِزِيَادَةٍ أَوْ نُقْصَانٍ، ثُمَّ قَرَأَ : # وَنُنَزِّلُ مِنَ الْقُرْءَانِ مَا هُوَ شِفَاءٌ وَرَحْمَةٌ لِلْمُؤْمِنِينَ وَلا يَزِيدُ الظَّالِمِينَ إِلا خَسَارًا سورة الإسراء آية 82 #",
    "malay_translation": "Muhammad bin Kathir meriwayatkan daripada Abdullah bin Waqid, daripada Qatadah, berkata: \"Tiada seorang pun yang duduk (membaca) Al-Quran, kemudian dia bangun daripadanya, melainkan dengan (mendapat) tambahan (kebaikan) atau (terhindar) kekurangan (daripada keburukan). Kemudian dia membaca: \"Dan Kami turunkan dari Al-Quran suatu yang menjadi penawar dan rahmat bagi orang-orang yang beriman dan (sebaliknya) tidak menambah kepada orang-orang yang zalim selain kerugian.\" (Surah Al-Isra': 82)"
  },
  {
    "id": 40138,
    "hadith_number": 2601,
    "tajuk_hadith": "Kelebihan Pengajaran Al-Quran Kepada Kanak-kanak",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ ، حَدَّثَنَا رِفْدَةُ الْغَسَّانِيُّ ، حَدَّثَنَا ثَابِتُ بْنُ عَجْلَانَ الْأَنْصَارِيُّ ، قَالَ : كَانَ يُقَالُ :\" إِنَّ اللَّهَ لَيُرِيدُ الْعَذَابَ بِأَهْلِ الْأَرْضِ، فَإِذَا سَمِعَ تَعْلِيمَ الصِّبْيَانِ الْحِكْمَةَ، صَرَفَ ذَلِكَ عَنْهُمْ \".\nقَالَ مَرْوَانُ : يَعْنِي بِالْحِكْمَةِ : الْقُرْآنَ",
    "malay_translation": "Daripada (riwayat) Marwan bin Muhammad, daripada Rifdah Al-Ghassani, daripada Thabit bin Ajlan Al-Ansari, beliau berkata: “Dikatakan: Sesungguhnya Allah SWT ingin menurunkan azab kepada penduduk bumi, kemudian apabila Dia mendengar pengajaran hikmah (Al-Quran) kepada kanak-kanak, Dia memalingkan azab itu daripada mereka.” Marwan berkata: “Yang dimaksudkan dengan hikmah ialah Al-Quran.”"
  },
  {
    "id": 40139,
    "hadith_number": 2602,
    "tajuk_hadith": "Keadaan Al-Quran dalam Kalbu yang Rosak",
    "perawi_melayu": "Mu'az bin Jabal",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ  ، حَدَّثَنَا صَدَقَةُ بْنُ خَالِدٍ  ، عَنْ ابْنِ جَابِرٍ  ، حَدَّثَنَا شَيْخٌ يُكَنَّى أَبَا عَمْرٍو  ، عَنْ مُعَاذِ بْنِ جَبَلٍ  ، قَالَ :\" سَيَبْلَى الْقُرْآنُ فِي صُدُورِ أَقْوَامٍ كَمَا يَبْلَى الثَّوْبُ، فَيَتَهَافَتُ، يَقْرَءُونَهُ لَا يَجِدُونَ لَهُ شَهْوَةً وَلَا لَذَّةً، يَلْبَسُونَ جُلُودَ الضَّأْنِ عَلَى قُلُوبِ الذِّئَابِ، أَعْمَالُهُمْ طَمَعٌ لَا يُخَالِطُهُ خَوْفٌ، إِنْ قَصَّرُوا، قَالُوا : سَنَبْلُغُ، وَإِنْ أَسَاءُوا، قَالُوا : سَيُغْفَرُ لَنَا، إِنَّا لَا نُشْرِكُ بِاللَّهِ شَيْئًا \"",
    "malay_translation": "Daripada Mu'az bin Jabal, berkata: \"Al-Quran akan menjadi usang dalam dada beberapa kaum sebagaimana usangnya pakaian, lalu ia berpecah-pecah. Mereka membacanya tetapi tidak mendapatkan rasa kecintaan dan kenikmatan padanya. Mereka mengenakan kulit domba pada hati serigala. Amalan mereka adalah tamak yang tidak bercampur dengan rasa takut. Jika mereka lalai, mereka berkata: 'Kami akan sampai (ke tahap sempurna)', dan jika mereka melakukan keburukan, mereka berkata: 'Kami akan diampuni', sesungguhnya kami tidak menyekutukan Allah dengan sesuatu apa pun.\""
  },
  {
    "id": 40140,
    "hadith_number": 2603,
    "tajuk_hadith": "Kesan Melupakan Ayat Al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ  ، عَنْ شُعْبَةَ  ، عَنْ مَنْصُورٍ  قَالَ : سَمِعْتُ أَبَا وَائِلٍ  ،  عَنْ عَبْدِ اللَّهِ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" قَالَ بِئْسَمَا لِأَحَدِكُمْ أَنْ يَقُولَ : نَسِيتُ آيَةَ كَيْتَ وَكَيْتَ، بَلْ هُوَ نُسِّيَ، وَاسْتَذْكِرُوا الْقُرْآنَ، فَإِنَّهُ أَسْرَعُ تَفَصِّيًا مِنْ صُدُورِ الرِّجَالِ مِنْ النَّعَمِ مِنْ عُقُلِهَا \"",
    "malay_translation": "Daripada Abdullah radiallahuanhu, Nabi SAW bersabda: \"Alangkah buruknya jika seseorang di antara kamu berkata: 'Aku lupa ayat ini dan itu.' Sebenarnya dia telah dilupakan. Ingatlah Al-Quran selalu, kerana ia lebih cepat terlepas daripada dada lelaki daripada unta yang terlepas daripada ikatannya.\""
  },
  {
    "id": 40141,
    "hadith_number": 2604,
    "tajuk_hadith": "Anjuran Mempelajari dan Memelihara al-Quran",
    "perawi_melayu": "Uqbah bin Amir",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ  ، حَدَّثَنَا مُوسَى يَعْنِي ابْنَ عُلَيٍّ  ، قَالَ : سَمِعْتُ أَبِي  ، قَالَ : سَمِعْتُ عُقْبَةَ بْنَ عَامِرٍ  ، يَقُول : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" تَعَلَّمُوا كِتَابَ اللَّهِ وَتَعَاهَدُوهُ، وَتَغَنَّوْا بِهِ وَاقْتَنُوهُ، فَوَالَّذِي نَفْسِي بِيَدِهِ أَوْ : فَوَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَهُوَ أَشَدُّ تَفَلُّتًا مِن الْمَخَاضِ فِي الْعُقُلِ \"",
    "malay_translation": "Telah menceritakan kepada kami Wahb bin Jarir, telah menceritakan kepada kami Musa iaitu bin Ali, dia berkata: Saya mendengar ayah saya, dia berkata: Saya mendengar Uqbah bin Amir berkata: Rasulullah SAW bersabda: \"Pelajarilah Kitab Allah dan peliharalahnya, nyanyikanlah ia dan miliki ia. Demi Dia yang jiwaku berada di tangan-Nya, atau demi Dia yang jiwa Muhammad berada di tangan-Nya, sesungguhnya ia lebih mudah terlepas daripada unta dalam ikatan.\" (Maksudnya: Ilmu al-Quran mudah hilang jika tidak dipelajari dan dijaga)"
  },
  {
    "id": 40142,
    "hadith_number": 2605,
    "tajuk_hadith": "Keutamaan Mempelajari dan Menjaga Al-Quran",
    "perawi_melayu": "Daripada 'Uqbah bin 'Amir",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، قَالَ حَدَّثَنِي مُوسَى  عَنْ أَبِيهِ  ، عَنْ عُقْبَةَ بْنِ عَامِرٍ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" تَعَلَّمُوا كِتَابَ اللَّهِ تَعَالَى وَتَعَاهَدُوهُ، وَاقْتَنُوهُ وَتَغَنَّوْا بِهِ، فَوَالَّذِي نَفْسِي بِيَدِهِ، لَهُوَ أَشَدُّ تَفَلُّتًا مِنْ الْمَخَاضِ فِي الْعُقُلِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Saleh, dia berkata, telah menceritakan kepadaku Musa daripada bapanya, daripada 'Uqbah bin 'Amir bahawa Rasulullah ﷺ bersabda: \"Pelajarilah Kitab Allah Ta'ala (Al-Quran) dan jagalah ia, miliki dan nyanyikanlah ia (baca dengan tartil). Demi (Allah) yang jiwaku berada di tangan-Nya, sesungguhnya ia (Al-Quran) lebih mudah terlepas daripada unta yang terikat dalam ikatan yang kuat.\""
  },
  {
    "id": 40143,
    "hadith_number": 2606,
    "tajuk_hadith": "Kecintaan 'Ikrimah bin Abu Jahal terhadap Al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، عَنْ أَيُّوبَ  ، عَنْ ابْنِ أَبِي مُلَيْكَةَ  : \" أَنَّ عِكْرِمَةَ بْنَ أَبِي جَهْلٍ   كَانَيَضَعُ الْمُصْحَفَ عَلَى وَجْهِهِ، وَيَقُولُ : كِتَابُ رَبِّي، كِتَابُ رَبِّي \"",
    "malay_translation": "Diriwayatkan daripada Sulaiman bin Harb, daripada Hammad bin Zaid, daripada Ayyub, daripada Ibnu Abi Mulaikah: \"Sesungguhnya 'Ikrimah bin Abu Jahal meletakkan mushaf (Al-Quran) di atas wajahnya, dan berkata: 'Kitab Tuhanku, Kitab Tuhanku'\""
  },
  {
    "id": 40144,
    "hadith_number": 2607,
    "tajuk_hadith": "Amalan Selepas Solat Subuh: Membaca Al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا هَمَّامٌ  ، حَدَّثَنَا ثَابِتٌ  ، قَالَ : \" كَانَ عَبْدُ الرَّحْمَنِ بْنُ أَبِي لَيْلَى  إِذَا صَلَّى الصُّبْحَ، قَرَأَ الْمُصْحَفَ حَتَّى تَطْلُعَ الشَّمْسُ \"، قَالَ : وَكَانَ ثَابِتٌ يَفْعَلُهُ",
    "malay_translation": "Diriwayatkan daripada Muslim bin Ibrahim, diriwayatkan daripada Hammam, diriwayatkan daripada Thabit, beliau berkata: \"Adalah Abdur Rahman bin Abi Laila, apabila selesai solat Subuh, beliau membaca Al-Quran sehingga terbit matahari.\" Thabit berkata: Dan Thabit juga melakukan perkara yang sama."
  },
  {
    "id": 40145,
    "hadith_number": 2608,
    "tajuk_hadith": "Allah Tidak Malu Membuat Perumpamaan",
    "perawi_melayu": "Muhammad bin Abdullah Ar-Raqashi",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ ، عَنْ يَزِيدَ بْنِ زُرَيْعٍ ، عَنْ سَعِيدٍ ،  عَنْ قَتَادَةَ ، قَالَ : # إِنَّ اللَّهَ لا يَسْتَحْيِي أَنْ يَضْرِبَ مَثَلا مَا بَعُوضَةً فَمَا فَوْقَهَا فَأَمَّا الَّذِينَ آمَنُوا فَيَعْلَمُونَ أَنَّهُ الْحَقُّ مِنْ رَبِّهِمْ وَأَمَّا الَّذِينَ كَفَرُوا فَيَقُولُونَ مَاذَا أَرَادَ اللَّهُ بِهَذَا مَثَلا يُضِلُّ بِهِ كَثِيرًا وَيَهْدِي بِهِ كَثِيرًا وَمَا يُضِلُّ بِهِ إِلا الْفَاسِقِينَ سورة البقرة آية 26 #، قَالَ :\" أَيْ يَعْلَمُونَ أَنَّهُ كَلَامُ الرَّحْمَنِ \"",
    "malay_translation": "Muhammad bin Abdullah Ar-Raqashi meriwayatkan daripada Yazid bin Zurai', daripada Sa'id, daripada Qatadah, berkata: \"Sesungguhnya Allah tidak malu untuk membuat perumpamaan, (walaupun) nyamuk atau yang lebih (kecil) daripada itu. Adapun orang-orang yang beriman, maka mereka tahu bahwa (perumpamaan) itu adalah kebenaran dari Tuhan mereka. Adapun orang-orang kafir, maka mereka berkata: 'Apakah maksud Allah dengan (perumpamaan) ini?' Allah menyesatkan dengannya banyak orang, dan memberi petunjuk dengannya banyak (pula). Dan tidak ada yang Dia sesatkan kecuali orang-orang yang fasik.\" (Surah Al-Baqarah: 26), iaitu mereka mengetahui bahawa ia adalah firman (kalam) Ar-Rahman (Allah)."
  },
  {
    "id": 40146,
    "hadith_number": 2609,
    "tajuk_hadith": "Keagungan Firman Allah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ  ، عَنْ أَبِي بَكْرِ بْنِ أَبِي مَرْيَمَ  ، عَنْ عَطِيَّةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَا مِنْ كَلَامٍ أَعْظَمُ عِنْدَ اللَّهِ مِنْ كَلَامِهِ، وَمَا رَدَّ الْعِبَادُ إِلَى اللَّهِ كَلَامًا أَحَبَّ إِلَيْهِ مِنْ كَلَامِهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Salih, daripada Muawiyah bin Salih, daripada Abu Bakr bin Abi Maryam, daripada 'Atiyyah, dia berkata: Rasulullah SAW bersabda: \"Tiada suatu perkataan pun yang lebih agung di sisi Allah daripada firman-Nya, dan tiada suatu perkataan yang dikembalikan oleh hamba kepada Allah yang lebih dicintai oleh-Nya daripada firman-Nya.\""
  },
  {
    "id": 40147,
    "hadith_number": 2610,
    "tajuk_hadith": "Usaha Rasulullah SAW Memperkenalkan Diri di Musim Haji",
    "perawi_melayu": "Jabir bin Abdullah (RA)",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ إِسْرَائِيلَ  ، حَدَّثَنَا عُثْمَانُ بْنُ الْمُغِيرَةِ الثَّقَفِيُّ  ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ  ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ  ، قَالَ : كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْرِضُ نَفْسَهُ فِي الْمَوْسِمِ عَلَى النَّاسِ فِي الْمَوْقِفِ، فَيَقُولُ :\" هَلْ مِنْ رَجُلٍ يَحْمِلُنِي إِلَى قَوْمِهِ؟ فَإِنَّ قُرَيْشًا مَنَعُونِي أَنْ أُبَلِّغَ كَلَامَ رَبِّي؟ \"",
    "malay_translation": "Daripada Jabir bin Abdullah (RA), berkata: Adalah Rasulullah SAW menawarkan diri-Nya kepada orang ramai di musim haji di tempat wukuf, lalu baginda bersabda: \"Adakah sesiapa di kalangan kamu yang akan membawa aku kepada kaumnya? Sesungguhnya kaum Quraisy telah menghalangku daripada menyampaikan kalam (firman) Tuhanku.\""
  },
  {
    "id": 40148,
    "hadith_number": 2611,
    "tajuk_hadith": "Al-Quran adalah Kalamullah, Jangan Ikut Hawa Nafsu",
    "perawi_melayu": "Umar bin al-Khattab",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاق  ، حَدَّثَنَا جَرِيرٌ  ، عَنْ لَيْثٍ  ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ  ، عَنْ أَبِي الزَّعْرَاءِ  ، قَالَ : قَالَ عُمَرُ بْنُ الْخَطَّابِ   :\" إِنَّ هَذَا الْقُرْآنَ كَلَامُ اللَّهِ، فَلَا أَعْرِفَنَّكُمْ فِيمَا عَطَفْتُمُوهُ عَلَى أَهْوَائِكُمْ \"",
    "malay_translation": "Daripada Umar bin al-Khattab (r.a.) berkata: \"Sesungguhnya Al-Quran ini adalah Kalamullah (firman Allah), maka janganlah aku mendapati kamu semua mencondongkannya mengikut hawa nafsu kamu.\""
  },
  {
    "id": 40149,
    "hadith_number": 2612,
    "tajuk_hadith": "Keutamaan Membaca Al-Quran",
    "perawi_melayu": "Abu Sa'id al-Khudri رضي الله عنه",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْمَاعِيل بْنُ إِبْرَاهِيمَ التَّرْجُمَانِيُّ  ، حَدَّثَنَا مُحَمَّدُ بْنُ الْحَسَنِ الْهَمْدَانِيُّ  ، عَنْ عَمْرِو بْنِ قَيْسٍ  ، عَنْ عَطِيَّةَ  ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَنْ شَغَلَهُ قِرَاءَةُ الْقُرْآنِ عَنْ مَسْأَلَتِي وَذِكْرِي، أَعْطَيْتُهُ أَفْضَلَ ثَوَابِ السَّائِلِينَ، وَفَضْلُ كَلَامِ اللَّهِ عَلَى سَائِرِ الْكَلَامِ، كَفَضْلِ اللَّهِ عَلَى خَلْقِهِ \"",
    "malay_translation": "Daripada Abu Sa'id al-Khudri رضي الله عنه, Rasulullah ﷺ bersabda: \"Sesiapa yang disibukkan oleh membaca Al-Quran daripada memohon kepada-Ku dan mengingati-Ku, Aku akan memberinya ganjaran yang paling utama daripada mereka yang memohon, dan kelebihan kalam Allah terhadap semua kalam yang lain, seperti kelebihan Allah terhadap makhluk-Nya.\""
  },
  {
    "id": 40150,
    "hadith_number": 2613,
    "tajuk_hadith": "Keutamaan Kalam Allah SWT Berbanding Kalam Makhluk-Nya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ أَشْعَثَ الْحُدَّانِيِّ  ، عَنْ شَهْرِ بْنِ حَوْشَبٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" فَضْلُ كَلَامِ اللَّهِ عَلَى كَلَامِ خَلْقِهِ، كَفَضْلِ اللَّهِ عَلَى خَلْقِهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Hammad bin Salamah, dari Asy'ats Al-Huddani, dari Syahr bin Hausyab, dia berkata: Rasulullah SAW bersabda: \"Keutamaan kalam Allah SWT berbanding kalam makhluk-Nya, seperti keutamaan Allah SWT ke atas makhluk-Nya.\""
  },
  {
    "id": 40151,
    "hadith_number": 2614,
    "tajuk_hadith": "Al-Quran Lebih Dicintai Allah daripada Langit dan Bumi",
    "perawi_melayu": "Daripada Abdullah bin Amr r.a.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ  ، عَنْ رَجُلٍ  مِنْ شُيُوخِ مِصْرَ ، أَنَّهُ حَدَّثَهُ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو  ، عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، أَنَّهُ قَالَ :\" الْقُرْآنُ أَحَبُّ إِلَى اللَّهِ مِنْ السَّمَوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ \"",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Al-Quran lebih dicintai oleh Allah daripada langit, bumi, dan segala yang ada di dalamnya.\" (Diriwayatkan oleh Abdullah bin Amr r.a.)"
  },
  {
    "id": 40152,
    "hadith_number": 2615,
    "tajuk_hadith": "Perintah Membaca Al-Quran dan Berhenti Apabila Berbeza Pendapat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا هَارُونُ الْأَعْوَرُ  ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ  ، عَنْ جُنْدُبٍ   : أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" اقْرَءُوا الْقُرْآنَ مَا ائْتَلَفْتُمْ عَلَيْهِ، فَإِذَا اخْتَلَفْتُمْ فِيهِ، فَقُومُوا \"",
    "malay_translation": "Telah menceritakan kepada kami Abu An-Nu'man, telah menceritakan kepada kami Harun al-A'war, dari Abu 'Imran al-Jauni, dari Jundub: Bahawa Nabi SAW bersabda: \"Bacalah Al-Quran selagi kamu bersatu padu mengenainya. Apabila kamu berselisih pendapat mengenainya, maka berhentilah.\""
  },
  {
    "id": 40153,
    "hadith_number": 2616,
    "tajuk_hadith": "Bacalah Al-Quran Selagi Hati Bersatu",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، حَدَّثَنَا هَمَّامٌ  ، حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ  ، عَنْ جُنْدُبِ بْنِ عَبْدِ اللَّهِ  ، قَالَ :\" اقْرَءُوا الْقُرْآنَ مَا ائْتَلَفَتْ عَلَيْهِ قُلُوبُكُمْ، فَإِذَا اخْتَلَفْتُمْ فِيهِ، فَقُومُوا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah menceritakan kepada kami Hammam, telah menceritakan kepada kami Abu Imran Al-Jauni, daripada Jundub bin Abdullah, dia berkata: \"Bacalah Al-Quran selagi hati kamu bersatu. Apabila kamu berselisih pendapat mengenainya, maka berhentilah.\""
  },
  {
    "id": 40154,
    "hadith_number": 2617,
    "tajuk_hadith": "Anjuran Membaca Al-Quran Ketika Hati Sejiwa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو غَسَّانَ مَالِكُ بْنُ إِسْمَاعِيل  ، حَدَّثَنَا أَبُو قُدَامَةَ  ، حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ  ، عَنْ جُنْدُبٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" اقْرَءُوا الْقُرْآنَ مَا ائْتَلَفَتْ عَلَيْهِ قُلُوبُكُمْ، فَإِذَا اخْتَلَفْتُمْ، فِيهِ فَقُومُوا \"",
    "malay_translation": "Daripada Jundub, Rasulullah SAW bersabda: \"Bacalah Al-Quran selagi hati kamu bersatu padu. Sekiranya kamu berselisih pendapat mengenainya, maka berhentilah.\""
  },
  {
    "id": 40155,
    "hadith_number": 2618,
    "tajuk_hadith": "Perbandingan Antara Iman dan Al-Quran",
    "perawi_melayu": "Ali رضي الله عنه",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا فِطْرٌ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ الْحَارِثِ  ، عَنْ عَلِيٍّ   رَضِيَ اللَّهُ عَنْهُ، قَالَ :\" مِنَ النَّاسِ مَنْ يُؤْتَى الْإِيمَانَ وَلَا يُؤْتَى الْقُرْآنَ، وَمِنْهُمْ مَنْ يُؤْتَى الْقُرْآنَ وَلَا يُؤْتَى الْإِيمَانَ، وَمِنْهُمْ مَنْ يُؤْتَى الْقُرْآنَ وَالْإِيمَانَ، وَمِنْهُمْ مَنْ لَا يُؤْتَى الْقُرْآنَ وَلَا الْإِيمَانَ، ثُمَّ ضَرَبَ لَهُمْ مَثَلًا، قَالَ : فَأَمَّا مَنْ أُوتِيَ الْإِيمَانَ وَلَمْ يُؤْتَ الْقُرْآنَ، فَمَثَلُهُ مَثَلُ التَّمْرَةِ حُلْوَةُ الطَّعْمِ، لَا رِيحَ لَهَا، وَأَمَّا مَثَلُ الَّذِي أُوتِيَ الْقُرْآنَ، وَلَمْ يُؤْتَ الْإِيمَانَ، فَمَثَلُ الْآسَةِ طَيِّبَةُ الرِّيحِ، مُرَّةُ الطَّعْمِ، وَأَمَّا الَّذِي أُوتِيَ الْقُرْآنَ وَالْإِيمَانَ، فَمَثَلُ الْأُتْرُجَّةِ، طَيِّبَةُ الرِّيحِ، حُلْوَةُ الطَّعْمِ، وَأَمَّا الَّذِي لَمْ يُؤْتَ الْقُرْآنَ وَلَا الْإِيمَانَ، فَمَثَلُهُ مَثَلُ الْحَنْظَلَةِ، مُرَّةُ الطَّعْمِ، لَا رِيحَ لَهَا \"",
    "malay_translation": "Abu Nu'aym meriwayatkan, Fithr meriwayatkan dari Abu Ishaq, dari Al-Harith, dari Ali رضي الله عنه, berkata: \"Sesungguhnya ada di antara manusia yang dikurniakan iman tetapi tidak dikurniakan Al-Quran, dan di antara mereka ada yang dikurniakan Al-Quran tetapi tidak dikurniakan iman, dan di antara mereka ada yang dikurniakan Al-Quran dan iman, dan di antara mereka ada yang tidak dikurniakan Al-Quran dan iman.\" Kemudian beliau memberi perumpamaan kepada mereka, berkata: \"Adapun orang yang dikurniakan iman tetapi tidak dikurniakan Al-Quran, maka perumpamaannya seperti buah tamar yang manis rasanya tetapi tidak berbau wangi. Adapun perumpamaan orang yang dikurniakan Al-Quran tetapi tidak dikurniakan iman, maka perumpamaannya seperti pokok 'aasah yang wangi baunya tetapi pahit rasanya. Adapun orang yang dikurniakan Al-Quran dan iman, maka perumpamaannya seperti buah 'utrujjah yang wangi baunya dan manis rasanya. Adapun orang yang tidak dikurniakan Al-Quran dan iman, maka perumpamaannya seperti buah hanzhalah yang pahit rasanya dan tidak berbau wangi.\""
  },
  {
    "id": 40156,
    "hadith_number": 2619,
    "tajuk_hadith": "Perumpamaan Orang Mukmin yang Membaca dan Tidak Membaca Al-Quran",
    "perawi_melayu": "Daripada Abu Musa Al-Asy'ari رضي الله عنه",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا أَبُو عَوَانَةَ  ، عَنْ قَتَادَةَ  ، عَنْ أَنَسِ بْنِ مَالِكٍ  ، عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَثَلُ الْمُؤْمِنِ الَّذِي يَقْرَأُ الْقُرْآنَ، مَثَلُ الْأُتْرُجَّةِ، طَعْمُهَا طَيِّبٌ، وَرِيحُهَا طَيِّبٌ، وَمَثَلُ الْمُؤْمِنِ الَّذِي لَا يَقْرَأُ الْقُرْآنَ، مَثَلُ التَّمْرَةِ، طَعْمُهَا حُلْوٌ، وَلَيْسَ لَهَا رِيحٌ، وَمَثَلُ الْمُنَافِقِ الَّذِي يَقْرَأُ الْقُرْآنَ، مَثَلُ الرَّيْحَانَةِ، رِيحُهَا طَيِّبٌ، وَطَعْمُهَا مُرٌّ، وَمَثَلُ الْمُنَافِقِ الَّذِي لَا يَقْرَأُ الْقُرْآنَ، مَثَلُ الْحَنْظَلَةِ، لَيْسَ لَهَا رِيحٌ، وَطَعْمُهَا مُرٌّ \"",
    "malay_translation": "Daripada Abu Musa Al-Asy'ari رضي الله عنه, Nabi صلى الله عليه وسلم bersabda: \"Perumpamaan orang mukmin yang membaca Al-Quran adalah seperti buah utrujjah (sejenis buah sitrus), rasanya sedap dan baunya harum. Dan perumpamaan orang mukmin yang tidak membaca Al-Quran adalah seperti buah kurma, rasanya manis tetapi tidak berbau. Dan perumpamaan orang munafik yang membaca Al-Quran adalah seperti tumbuhan raihanah (sejenis tumbuhan yang harum), baunya harum tetapi rasanya pahit. Dan perumpamaan orang munafik yang tidak membaca Al-Quran adalah seperti buah hanzalah (sejenis buah yang pahit), tidak berbau dan rasanya pahit.\""
  },
  {
    "id": 40157,
    "hadith_number": 2620,
    "tajuk_hadith": "Perumpamaan Orang Beriman dan Al-Quran",
    "perawi_melayu": "Ali (r.a.)",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ  ، عَنْ إِسْرَائِيلَ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ الْحَارِثِ  ، عَنْ عَلِيٍّ  ، قَالَ :\" مَثَلُ الَّذِي أُوتِيَ الْإِيمَانَ وَلَمْ يُؤْتَ الْقُرْآنَ مَثَلُ التَّمْرَةِ، طَعْمُهَا طَيِّبٌ، وَلَا رِيحَ لَهَا، وَمَثَلُ الَّذِي أُوتِيَ الْقُرْآنَ وَلَمْ يُؤْتَ الْإِيمَانَ مَثَلُ الرَّيْحَانَةِ الْآسَةِ، رِيحُهَا طَيِّبٌ، وَطَعْمُهَا مُرٌّ، وَمَثَلُ الَّذِي أُوتِيَ الْقُرْآنَ وَالْإِيمَانَ مَثَلُ الْأُتْرُجَّةِ، رِيحُهَا طَيِّبٌ، وَطَعْمُهَا طَيِّبٌ، وَمَثَلُ الَّذِي لَمْ يُؤْتَ الْإِيمَانَ وَلَا الْقُرْآنَ مَثَلُ الْحَنْظَلَةِ، رِيحُهَا خَبِيثٌ، وَطَعْمُهَا خَبِيثٌ \"",
    "malay_translation": "Daripada Ali (r.a.), beliau berkata: \"Perumpamaan orang yang dikurniakan iman tetapi tidak dikurniakan Al-Quran adalah seperti buah kurma; rasanya enak tetapi tidak berbau. Perumpamaan orang yang dikurniakan Al-Quran tetapi tidak dikurniakan iman adalah seperti bunga raya; baunya harum tetapi rasanya pahit. Perumpamaan orang yang dikurniakan Al-Quran dan iman adalah seperti buah sitrus; baunya harum dan rasanya enak. Perumpamaan orang yang tidak dikurniakan iman dan Al-Quran adalah seperti buah hanzal (labu pahit); baunya busuk dan rasanya pahit.\""
  },
  {
    "id": 40158,
    "hadith_number": 2621,
    "tajuk_hadith": "Keutamaan Orang yang Mempelajari dan Mengamalkan Al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ  ، عَنْ شُعَيْبِ بْنِ أَبِي حَمْزَةَ  ، عَنْ الزُّهْرِيِّ  ، حَدَّثَنِي عَامِرُ بْنُ وَاثِلَةَ  : أَنَّ نَافِعَ بْنَ عَبْدِ الْحَارِثِ لَقِيَ عُمَرَ بْنَ الْخَطَّابِ بِعُسْفَانَ ، وَكَانَ عُمَرُ اسْتَعْمَلَهُ عَلَى أَهْلِ مَكَّةَ ، فَسَلَّمَ عَلَى عُمَرَ، فَقَالَ لَهُ عُمَرُ : مَنْ اسْتَخْلَفْتَ عَلَى أَهْلِ الْوَادِي؟ فَقَالَ نَافِعٌ : اسْتَخْلَفْتُ عَلَيْهِمْ ابْنَ أَبْزَى، فَقَالَ عُمَرُ : وَمَنْ ابْنُ أَبْزَى؟ فَقَالَ : مَوْلًى مِنْ مَوَالِينَا، فَقَالَ عُمَرُ : فَاسْتَخْلَفْتَ عَلَيْهِمْ مَوْلًى؟ فَقَالَ : يَا أَمِيرَ الْمُؤْمِنِينَ، إِنَّهُ قَارِئٌ لِكِتَابِ اللَّهِ، عَالِمٌ بِالْفَرَائِضِ، فَقَالَ عُمَرُ   : أَمَا إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" إِنَّ اللَّهَ يَرْفَعُ بِهَذَا الْكِتَابِ أَقْوَامًا، وَيَضَعُ بِهِ آخَرِينَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Al-Hakam bin Nafi', daripada Syu'aib bin Abi Hamzah, daripada Az-Zuhri, telah menceritakan kepada saya 'Amir bin Wathilah: Bahawa Nafi' bin 'Abdul Harith bertemu 'Umar bin Al-Khattab di 'Usfan, dan 'Umar telah melantiknya sebagai gabenor ke atas penduduk Mekah. Lalu dia memberi salam kepada 'Umar. 'Umar bertanya kepadanya: \"Siapakah yang kamu lantik sebagai pengganti ke atas penduduk lembah?\" Nafi' menjawab: \"Saya melantik Ibnu Abza sebagai pengganti mereka.\" 'Umar bertanya: \"Siapakah Ibnu Abza itu?\" Dia menjawab: \"Seorang bekas hamba dari hamba-hamba kami.\" 'Umar berkata: \"Adakah kamu melantik seorang bekas hamba sebagai pengganti mereka?\" Dia menjawab: \"Wahai Amirul Mukminin, sesungguhnya dia adalah seorang yang membaca Kitab Allah, seorang yang berilmu dalam ilmu faraid (hukum warisan).\" 'Umar berkata: \"Ketahuilah sesungguhnya Rasulullah SAW bersabda: \"Sesungguhnya Allah mengangkat darjat suatu kaum dengan Kitab ini, dan merendahkan darjat kaum yang lain dengannya.\""
  },
  {
    "id": 40159,
    "hadith_number": 2622,
    "tajuk_hadith": "Ganjaran Membaca dan Mendengar Al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْمُغِيرَةِ  ، حَدَّثَنَا عَبْدَةُ  ،  عَنْ خَالِدِ بْنِ مَعْدَانَ  ، قَالَ :\" إِنَّ الَّذِي يَقْرَأُ الْقُرْآنَ لَهُ أَجْرٌ، وَإِنَّ الَّذِي يَسْتَمِعُ لَهُ أَجْرَانِ \"",
    "malay_translation": "Abu Al-Mughirah meriwayatkan: 'Abdah meriwayatkan daripada Khalid bin Ma'dan, dia berkata: \"Sesungguhnya orang yang membaca Al-Quran, baginya satu ganjaran, dan sesungguhnya orang yang mendengar Al-Quran, baginya dua ganjaran.\""
  },
  {
    "id": 40160,
    "hadith_number": 2623,
    "tajuk_hadith": "Keutamaan Mendengar Ayat Al-Quran",
    "perawi_melayu": "Ibnu Abbas رضي الله عنه",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا رَزِينُ بْنُ عَبْدِ اللَّهِ بْنِ حُمَيْدٍ  ، عَنْ عَبْدِ الرَّزَّاقِ  ، عَنْ ابْنِ جُرَيْجٍ  ، عَنْ عَطَاءٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ :\" مَنْ اسْتَمَعَ إِلَى آيَةٍ مِنْ كِتَابِ اللَّهِ، كَانَتْ لَهُ نُورًا \"",
    "malay_translation": "Diriwayatkan daripada Ibnu Abbas رضي الله عنه, beliau berkata: \"Sesiapa yang mendengar satu ayat daripada Kitabullah (Al-Quran), maka (ayat itu) akan menjadi cahaya baginya.\""
  },
  {
    "id": 40161,
    "hadith_number": 2624,
    "tajuk_hadith": "Ganjaran bagi Pembaca al-Quran",
    "perawi_melayu": "Diriwayatkan oleh 'Aishah رضي الله عنها",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا هِشَامٌ  ، وَهَمَّامٌ  ، قَالَا : حَدَّثَنَا قَتَادَةُ  ، عَنْ زُرَارَةَ بْنِ أَوْفَى  ، عَنْ سَعْدِ بْنِ هِشَامٍ  ، عَنْ عَائِشَةَ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" الَّذِي يَقْرَأُ الْقُرْآنَ وَهُوَ مَاهِرٌ بِهِ، فَهُوَ مَعَ السَّفَرَةِ الْكِرَامِ الْبَرَرَةِ، وَالَّذِي يَقْرَؤُهُ وَهُوَ يَشْتَدُّ عَلَيْهِ، فَلَهُ أَجْرَانِ \"",
    "malay_translation": "Muslim bin Ibrahim telah meriwayatkan kepada kami, Hisham dan Hammam berkata, Qatadah meriwayatkan kepada kami, dari Zurarah bin Aufa, dari Saad bin Hisyam, dari 'Aishah, dari Nabi ﷺ, beliau bersabda: \"Orang yang membaca al-Quran dengan mahir, maka dia bersama para malaikat yang mulia lagi taat. Adapun orang yang membaca al-Quran dengan terbata-bata, maka baginya dua ganjaran.\""
  },
  {
    "id": 40162,
    "hadith_number": 2625,
    "tajuk_hadith": "Ganjaran Bagi Mereka yang Membaca dan Mengamalkan Al-Quran",
    "perawi_melayu": "Wahb al-Dhimari",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ ، حَدَّثَنَا سَعِيدٌ هُوَ ابْنُ عَبْدِ الْعَزِيزِ ، عَنْ إِسْمَاعِيل بْنِ عُبَيْدِ اللَّهِ ، عَنْ وَهْبٍ الذِّمَارِيِّ ، قَالَ :\" مَنْ آتَاهُ اللَّهُ الْقُرْآنَ، فَقَامَ بِهِ آنَاءَ اللَّيْلِ، وَآنَاءَ النَّهَارِ، وَعَمِلَ بِمَا فِيهِ، وَمَاتَ عَلَى الطَّاعَةِ، بَعَثَهُ اللَّهُ يَوْمَ الْقِيَامَةِ مَعَ السَّفَرَةِ وَالْأَحْكَامِ.\nقَالَ سَعِيدٌ : السَّفَرَةُ : الْمَلَائِكَةُ، وَالْأَحْكَامُ : الْأَنْبِيَاءُ ، قَالَ : وَمَنْ كَانَ حَرِيصًا وَهُوَ يَتَفَلَّتُ مِنْهُ، وَهُوَ لَا يَدَعُهُ، أُوتِيَ أَجْرَهُ مَرَّتَيْنِ، وَمَنْ كَانَ عَلَيْهِ حَرِيصًا وَهُوَ يَتَفَلَّتُ مِنْهُ وَمَاتَ عَلَى الطَّاعَةِ، فَهُوَ مِنْ أَشْرَافِهِمْ، وَفُضِّلُوا عَلَى النَّاسِ، كَمَا فُضِّلَتْ النُّسُورُ عَلَى سَائِرِ الطَّيْرِ، وَكَمَا فُضِّلَتْ مَرْجَةٌ خَضْرَاءُ عَلَى مَا حَوْلَهَا مِنْ الْبِقَاعِ، فَإِذَا كَانَ يَوْمُ الْقِيَامَةِ، قِيلَ : أَيْنَ الَّذِينَ كَانُوا يَتْلُونَ كِتَابِي لَمْ يُلْهِهِمْ اتِّبَاعُ الْأَنْعَامِ؟ فَيُعْطَى الْخُلْدَ وَالنَّعِيمَ، فَإِنْ كَانَ أَبَوَاهُ مَاتَا عَلَى الطَّاعَةِ، جُعِلَ عَلَى رُءُوسِهِمَا تَاجُ الْمُلْكِ، فَيَقُولَانِ : رَبَّنَا مَا بَلَغَتْ هَذَا أَعْمَالُنَا؟ فَيَقُولان : بَلَى، إِنَّ ابْنَكُمَا كَانَ يَتْلُو كِتَابِي \"",
    "malay_translation": "Marwan bin Muhammad telah meriwayatkan kepada kami, daripada Sa'id, iaitu Ibnu Abdul Aziz, daripada Ismail bin Ubaidillah, daripada Wahb al-Dhimari, berkata: \"Sesiapa yang Allah kurniakan Al-Quran kepadanya, lalu dia membacanya pada waktu malam dan siang, dan mengamalkan apa yang terkandung di dalamnya, dan mati dalam ketaatan, maka Allah akan membangkitkannya pada hari Kiamat bersama-sama dengan al-Safarah (malaikat yang mencatat amalan) dan al-Ahkam (para nabi).\nSa'id berkata: Al-Safarah ialah malaikat, dan al-Ahkam ialah para nabi. Beliau berkata: \"Dan sesiapa yang bersungguh-sungguh membaca Al-Quran tetapi kadang-kadang terlepas daripada mengingatinya, namun dia tidak meninggalkannya, dia akan diberi ganjaran dua kali ganda. Dan sesiapa yang bersungguh-sungguh membacanya tetapi terlepas daripada mengingatinya dan mati dalam keadaan taat, maka dia termasuk dalam kalangan orang yang mulia, dan mereka diutamakan daripada manusia, sebagaimana helang diutamakan daripada burung-burung lain, dan sebagaimana tanah hijau diutamakan daripada tanah-tanah lain di sekelilingnya. Apabila tiba hari Kiamat, dikatakan: 'Di manakah orang-orang yang membaca Kitab-Ku yang tidak lalai daripada mengikuti haiwan ternakan?' Maka mereka akan diberi keabadian dan kenikmatan. Sekiranya kedua ibu bapanya meninggal dunia dalam keadaan taat, maka akan diletakkan di atas kepala mereka mahkota kerajaan, lalu mereka berkata: 'Wahai Tuhan kami, adakah amalan kami sampai ke tahap ini?' Maka dikatakan kepada mereka: 'Ya, kerana anak kamu sentiasa membaca Kitab-Ku.'"
  },
  {
    "id": 40163,
    "hadith_number": 2626,
    "tajuk_hadith": "Al-Fatihah: Penawar Segala Penyakit",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا قَبِيصَةُ  ، أَخْبَرَنَا سُفْيَانُ  ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" فِي فَاتِحَةِ الْكِتَابِ، شِفَاءٌ مِنْ كُلِّ دَاءٍ \"",
    "malay_translation": "Rasulullah SAW bersabda: \"Dalam Surah Al-Fatihah terdapat penyembuh bagi setiap penyakit.\""
  },
  {
    "id": 40164,
    "hadith_number": 2627,
    "tajuk_hadith": "Keutamaan Surah Al-Fatihah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا بِشْرُ بْنُ عُمَرَ الزَّهْرَانِيُّ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ  ، عَنْ حَفْصِ بْنِ عَاصِمٍ  ،  عَنْ أَبِي سَعِيدِ بْنِ الْمُعَلَّى الْأَنْصَارِيِّ  ، قَالَ : \" مَرَّ بِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ :\" أَلَمْ يَقُلْ اللَّهُ G : # يَأَيُّهَا الَّذِينَ آمَنُوا اسْتَجِيبُوا لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُمْ لِمَا يُحْيِيكُمْ وَاعْلَمُوا أَنَّ اللَّهَ يَحُولُ بَيْنَ الْمَرْءِ وَقَلْبِهِ وَأَنَّهُ إِلَيْهِ تُحْشَرُونَ سورة الأنفال آية 24 #، قَالَ : أَلَا أُعَلِّمُكَ أَعْظَمَ سُورَةٍ فِي الْقُرْآنِ قَبْلَ أَنْ أَخْرُجَ مِنْ الْمَسْجِدِ؟، فَلَمَّا أَرَادَ أَنْ يَخْرُجَ، قَالَ : # الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ سورة الفاتحة آية 2 # وَهِيَ السَّبْعُ الْمَثَانِي، وَالْقُرْآنُ الْعَظِيمُ الَّذِي أُوتِيتُمْ \"",
    "malay_translation": "Diriwayatkan daripada Abu Sa'id bin Al-Mu'alla Al-Ansari, beliau berkata: \"Rasulullah ﷺ lalu kepadaku dan berkata: 'Bukankah Allah berfirman: 'Wahai orang-orang yang beriman! Penuhilah seruan Allah dan seruan Rasul apabila dia menyeru kamu kepada sesuatu yang memberi kehidupan kepada kamu, dan ketahuilah bahawa sesungguhnya Allah berkuasa menghalang antara manusia dan hatinya; dan sesungguhnya kepada-Nya kamu akan dikumpulkan.' (Surah Al-Anfal:24). Beliau bersabda: 'Mahukah aku ajarkan kepadamu surah yang paling agung dalam Al-Quran sebelum aku keluar dari masjid?' Ketika baginda hendak keluar, baginda bersabda: 'Alhamdulillahirabbil 'alamin (Segala puji bagi Allah, Tuhan semesta alam)' (Surah Al-Fatihah:2). Ia adalah tujuh ayat yang berulang-ulang, dan Al-Quran yang agung yang telah diberikan kepadamu.\""
  },
  {
    "id": 40165,
    "hadith_number": 2628,
    "tajuk_hadith": "Surah Al-Fatihah: Tujuh Ayat yang Berulang",
    "perawi_melayu": "Abu Hurairah (RA) daripada Ubayy bin Ka'ab (RA)",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سَعِيدٍ  ، حَدَّثَنَا أَبُو أُسَامَةَ  ، عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ  ، عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ  ، عَنْ أَبِيهِ  ، عَنْ أَبِي هُرَيْرَةَ  ، عَنْ أُبَيِّ بْنِ كَعْبٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" فَاتِحَةُ الْكِتَابِ هِيَ السَّبْعُ الْمَثَانِي \"",
    "malay_translation": "Daripada Ubayy bin Ka'ab (RA), beliau berkata: Rasulullah SAW bersabda: \"Surah Al-Fatihah adalah tujuh ayat yang berulang-ulang (As-Sab'ul Mathani).\""
  },
  {
    "id": 40166,
    "hadith_number": 2629,
    "tajuk_hadith": "Keistimewaan Surah Al-Fatihah",
    "perawi_melayu": "Abu Hurairah رضي الله عنه",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا نُعَيْمُ بْنُ حَمَّادٍ  ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ  ، عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ  ، عَنْ أَبِيهِ  ، عَنْ أَبِي هُرَيْرَةَ  ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَا أُنْزِلَتْ فِي التَّوْرَاةِ وَلَا فِي الْإِنْجِيلِ وَالزَّبُورِ وَالْقُرْآنِ مِثْلُهَا يَعْنِي : أُمَّ الْقُرْآنِ وَإِنَّهَا لَسَبْعٌ مِنْ الْمَثَانِي، وَالْقُرْآنُ الْعَظِيمُ الَّذِي أُعْطِيتُ \"",
    "malay_translation": "Telah menceritakan kepada kami Nu'aim bin Hammad, telah menceritakan kepada kami Abdul Aziz bin Muhammad, dari Al-'Ala' bin Abdur Rahman, dari bapanya, dari Abu Hurairah رضي الله عنه, bahawa Rasulullah ﷺ bersabda: \"Tidaklah diturunkan dalam Taurat, Injil, Zabur dan Al-Quran suatu yang seperti (surah) Ummul Quran.\" Yakni (surah) Al-Fatihah, dan sesungguhnya ia adalah tujuh (ayat) yang berulang-ulang, dan Al-Quran yang agung yang telah diberikan kepadaku."
  },
  {
    "id": 40167,
    "hadith_number": 2630,
    "tajuk_hadith": "Al-Hamdu lillahi (Surah Al-Fatihah) adalah Ummul Qur'an",
    "perawi_melayu": "Abu Hurairah (RA)",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَلِيٍّ الْحَنَفِيُّ  ، حَدَّثَنِي ابْنُ أَبِي ذِئْبٍ  ، عَنْ الْمَقْبُرِيِّ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" الْحَمْدُ لِلَّهِ أُمُّ الْقُرْآنِ ، وَأُمُّ الْكِتَابِ ، وَالسَّبْعُ الْمَثَانِي \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Ali al-Hanafi, telah menceritakan kepadaku Ibnu Abi Dzi'b, daripada al-Maqburi, daripada Abu Hurairah (RA), beliau berkata: Rasulullah SAW bersabda: \"Al-Hamdu lillahi (Surah Al-Fatihah) adalah Ummul Qur'an, Ummul Kitab, dan As-Sab'ul Mathani (tujuh ayat yang diulang-ulang)\"."
  },
  {
    "id": 40168,
    "hadith_number": 2631,
    "tajuk_hadith": "Kelebihan Membaca Surah Al-Baqarah",
    "perawi_melayu": "Abdullah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا فِطْرٌ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ أَبِي الْأَحْوَصِ  ، عَنْ عَبْدِ اللَّهِ  ، قَالَ :\" مَا مِنْ بَيْتٍ يُقْرَأُ فِيهِ سُورَةُ الْبَقَرَةِ ، إِلَّا خَرَجَ مِنْهُ الشَّيْطَانُ وَلَهُ ضَرِيطٌ \"",
    "malay_translation": "Abu Nu’aym telah meriwayatkan kepada kami, daripada Fitr, daripada Abu Ishaq, daripada Abu al-Ahwas, daripada Abdullah, berkata: “Tidaklah sebuah rumah dibacakan padanya surah al-Baqarah, melainkan keluarlah daripadanya syaitan dalam keadaan terkutuk.”"
  },
  {
    "id": 40169,
    "hadith_number": 2632,
    "tajuk_hadith": "Keutamaan Surah Al-Baqarah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْمُغِيرَةِ  ، حَدَّثَتْنَا عَبْدَةُ  ، عَنْ خَالِدِ بْنِ مَعْدَانَ  ، قَالَ :\" سُورَةُ الْبَقَرَةِ تَعْلِيمُهَا بَرَكَةٌ، وَتَرْكُهَا حَسْرَةٌ، وَلَا يَسْتَطِيعُهَا الْبَطَلَةُ، وَهِيَ فُسْطَاطُ الْقُرْآنِ \"",
    "malay_translation": "Abu al-Mughirah meriwayatkan, 'Abd al-Ma'idan meriwayatkan, daripada Khalid bin Ma'dan, beliau berkata: \"Mempelajari Surah Al-Baqarah adalah keberkatan, meninggalkannya adalah kerugian, dan orang-orang yang tidak beramal tidak akan mampu melakukannya, dan ia adalah 'Fustat' (khemah) Al-Quran.\""
  },
  {
    "id": 40170,
    "hadith_number": 2633,
    "tajuk_hadith": "Surah Al-Baqarah sebagai Puncak Al-Quran",
    "perawi_melayu": "Abdullah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ عَاصِمٍ  ، عَنْ أَبِي الْأَحْوَصِ  ، عَنْ عَبْدِ اللَّهِ  ، أَنَّهُ قَالَ :\" إِنَّ لِكُلِّ شَيْءٍ سَنَامًا، وَإِنَّ سَنَامَ الْقُرْآنِ سُورَةُ الْبَقَرَةِ ، وَإِنَّ لِكُلِّ شَيْءٍ لُبَابًا، وَإِنَّ لُبَابَ الْقُرْآنِ الْمُفَصَّلُ \"\" قَالَ أَبُو مُحَمَّد : اللُّبَابُ : الْخَالِصُ",
    "malay_translation": "Daripada Abdullah, bahawa sesungguhnya dia berkata: \"Sesungguhnya bagi setiap sesuatu itu ada puncaknya (puncak tertinggi), dan sesungguhnya puncak Al-Quran itu adalah Surah Al-Baqarah. Dan sesungguhnya bagi setiap sesuatu itu ada intinya, dan sesungguhnya inti Al-Quran yang terperinci (Mufassal).\" Abu Muhammad berkata: Al-Lubab (inti) itu ialah yang tulen."
  },
  {
    "id": 40171,
    "hadith_number": 2634,
    "tajuk_hadith": "Keutamaan Membaca Surah Al-Baqarah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيل بْنُ أَبَانَ ، عَنْ مُحَمَّدِ بْنِ طَلْحَةَ ، عَنْ زُبَيْدٍ ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ ، قَالَ :\" مَنْ قَرَأَ سُورَةَ الْبَقَرَةِ، تُوِّجَ بِهَا تَاجًا فِي الْجَنَّةِ \"",
    "malay_translation": "Daripada 'Abdur-Rahman bin Al-Aswad, berkata: \"Sesiapa yang membaca Surah Al-Baqarah, dia akan dimahkotakan dengan mahkota di dalam syurga.\""
  },
  {
    "id": 40172,
    "hadith_number": 2635,
    "tajuk_hadith": "Syaitan Meninggalkan Rumah Apabila Surah Al-Baqarah Dibacakan",
    "perawi_melayu": "Abdullah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ  ، عَنْ أَبِي الْأَحْوَصِ  ، قَالَ : قَالَ عَبْدُ اللَّهِ   :\" إِنَّ الشَّيْطَانَ إِذَا سَمِعَ سُورَةَ الْبَقَرَةِ تُقْرَأُ فِي بَيْتٍ، خَرَجَ مِنْهُ \"",
    "malay_translation": "Abu Nu'aim meriwayatkan, daripada Syu'bah, daripada Salamah bin Kuhail, daripada Abu Al-Ahwas, berkata: Abdullah berkata: \"Sesungguhnya syaitan apabila mendengar Surah Al-Baqarah dibacakan di dalam rumah, ia akan keluar daripadanya.\""
  },
  {
    "id": 40173,
    "hadith_number": 2636,
    "tajuk_hadith": "Surah Al-Ikhlas, Ayat Kursi, dan Penutup Surah Al-Baqarah: Keutamaan dan Keistimewaan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْمُغِيرَةِ  ، حَدَّثَنَا صَفْوَانُ  ، حَدَّثَنِي أَيْفَعُ بْنُ عَبْدٍ الْكَلَاعِيُّ  ، قَالَ : قَالَ رَجُلٌ : يَا رَسُولَ اللَّهِ، أَيُّ سُورَةِ الْقُرْآنِ أَعْظَمُ؟ قَالَ :\" قُلْ هُوَ اللَّهُ أَحَدٌ \"، قَالَ : فَأَيُّ آيَةٍ فِي الْقُرْآنِ أَعْظَمُ؟ قَالَ : \" آيَةُ الْكُرْسِيِّ : # اللَّهُ لا إِلَهَ إِلا هُوَ الْحَيُّ الْقَيُّومُ سورة البقرة آية 255 #، قَالَ : فَأَيُّ آيَةٍ يَا نَبِيَّ اللَّهِ تُحِبُّ أَنْ تُصِيبَكَ وَأُمَّتَكَ؟ قَالَ : خَاتِمَةُ سُورَةِ الْبَقَرَةِ ، فَإِنَّهَا مِنْ خَزَائِنِ رَحْمَةِ اللَّهِ، مِنْ تَحْتِ عَرْشِهِ، أَعْطَاهَا هَذِهِ الْأُمَّةَ، لَمْ تَتْرُكْ خَيْرًا مِنْ خَيْرِ الدُّنْيَا وَالْآخِرَةِ إِلَّا اشْتَمَلَتْ عَلَيْهِ \"",
    "malay_translation": "Daripada Ayfa' bin Abd Al-Kala'i, beliau berkata: Seorang lelaki bertanya, 'Wahai Rasulullah, surah manakah dalam Al-Quran yang paling agung?' Baginda menjawab: 'Qul Huwa Allahu Ahad (Surah Al-Ikhlas).' Lelaki itu bertanya lagi, 'Ayat manakah pula dalam Al-Quran yang paling agung?' Baginda menjawab: 'Ayat Kursi: Allah, tidak ada Tuhan (yang berhak disembah) melainkan Dia, Yang Hidup, Yang Kekal lagi terus-menerus mengurus (makhluk-Nya). (Surah Al-Baqarah: 255). Lelaki itu bertanya lagi, 'Ayat manakah, wahai Nabi Allah, yang engkau sukai untuk menimpa engkau dan umatmu?' Baginda menjawab: 'Penutup Surah Al-Baqarah, kerana ia adalah dari khazanah rahmat Allah, dari bawah Arasy-Nya, Allah memberikannya kepada umat ini, ia tidak meninggalkan kebaikan dari kebaikan dunia dan akhirat melainkan ia meliputi semuanya.'"
  },
  {
    "id": 40174,
    "hadith_number": 2637,
    "tajuk_hadith": "Sahabat Nabi (ﷺ) Berjumpa dengan Jin dan Perlawanan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا أَبُو عَاصِمٍ الثَّقَفِيُّ  ، حَدَّثَنَا الشَّعْبِيُّ  ، قَالَ : قَالَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ   :\" لَقِيَ رَجُلٌ مِنْ أَصْحَابِ مُحَمَّدٍ رَجُلًا مِنْ الْجِنِّ، فَصَارَعَهُ فَصَرَعَهُ الْإِنْسِيُّ، فَقَالَ لَهُ الْإِنْسِيُّ : إِنِّي لَأَرَاكَ ضَئِيلًا شَخِيتًا، كَأَنَّ ذُرَيِّعَتَيْكَ ذُرَيِّعَتَا كَلْبٍ، فَكَذَلِكَ أَنْتُمْ مَعْشَرَ الْجِنِّ، أَمْ أَنْتَ مِنْ بَيْنِهِمْ كَذَلِكَ؟ قَالَ : لَا وَاللَّهِ، إِنِّي مِنْهُمْ لَضَلِيعٌ؟ وَلَكِنْ عَاوِدْنِي الثَّانِيَةَ، فَإِنْ صَرَعْتَنِي، عَلَّمْتُكَ شَيْئًا يَنْفَعُكَ، فَعَاوَدَهُ، فَصَرَعَهُ، قَالَ : هاتِ عَلِّمْنِي، قَالَ : نَعَمْ، قَالَ : تَقْرَأُ # اللَّهُ لا إِلَهَ إِلا هُوَ الْحَيُّ الْقَيُّومُ سورة البقرة آية 255 #؟ قَالَ : نَعَمْ، قَالَ : فَإِنَّكَ لَا تَقْرَؤُهَا فِي بَيْتٍ، إِلَّا خَرَجَ مِنْهُ الشَّيْطَانُ، لَهُ خَبَجٌ كَخَبَجِ الْحِمَارِ، ثُمَّ لَا يَدْخُلُهُ حَتَّى يُصْبِحَ \".\nقَالَ أَبُو مُحَمَّد : الضَّئِيلُ : الدَّقِيقُ، وَالشَّخِيتُ : الْمَهْزُولُ، وَالضَّلِيعُ : جَيِّدُ الْأَضْلَاع، وَالْخَبَجُ : الرِّيحُ",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Abu 'Asim Ats-Tsaqafi, telah menceritakan kepada kami Asy-Sya'bi, dia berkata: Abdullah bin Mas'ud berkata: \"Seorang lelaki dari kalangan sahabat Muhammad (ﷺ) bertemu dengan seorang lelaki dari kalangan jin, lalu dia bergulat dengannya, dan lelaki itu dapat mengalahkan jin tersebut. Lelaki itu berkata kepada jin tersebut: 'Sesungguhnya aku melihatmu kurus dan lemah, seolah-olah kedua tanganmu seperti tangan anjing. Apakah demikian juga kalian wahai golongan jin, ataukah engkau dari kalangan mereka?' Jin itu menjawab: 'Tidak demi Allah, sesungguhnya aku adalah dari kalangan mereka yang kuat. Akan tetapi lawanlah aku sekali lagi, jika engkau dapat mengalahkanku, niscaya akan kuajarkan kepadamu sesuatu yang bermanfaat.' Kemudian dia melawannya lagi, dan akhirnya dapat mengalahkannya. Jin itu berkata: 'Ajarilah aku.' Lelaki itu berkata: 'Baiklah, bacalah # اللَّهُ لا إِلَهَ إِلا هُوَ الْحَيُّ الْقَيُّومُ (Allah, tidak ada Tuhan (yang berhak disembah) melainkan Dia, Yang Hidup kekal lagi terus menerus mengurus (makhluk-Nya)) Surah Al-Baqarah ayat 255 #?' Jin itu berkata: 'Baiklah.' Lelaki itu berkata: 'Maka sesungguhnya jika engkau membacanya di sebuah rumah, niscaya syaitan akan keluar darinya, mengeluarkan kentut seperti kentut keledai, kemudian syaitan itu tidak akan memasukinya hingga subuh.'\" Abu Muhammad berkata: Adh-Dho'il bermakna kurus, Asy-Syakhiit bermakna kurus, Adh-Dholii' bermakna baik tulang rusuknya, dan Al-Khabaj bermakna angin (kentut)."
  },
  {
    "id": 40175,
    "hadith_number": 2638,
    "tajuk_hadith": "Keutamaan Membaca Sepuluh Ayat Awal dan Akhir Surah Al-Baqarah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ  ، أَنْبَأَنَا أَبُو الْعُمَيْسِ  ، عَنْ الشَّعْبِيِّ  ، قَالَ : قَالَ عَبْدُ اللَّهِ   :\" مَنْ قَرَأَ عَشْرَ آيَاتٍ مِنْ سُورَةِ الْبَقَرَةِ فِي لَيْلَةٍ، لَمْ يَدْخُلْ ذَلِكَ الْبَيْتَ شَيْطَانٌ تِلْكَ اللَّيْلَةَ حَتَّى يُصْبِحَ : أَرْبَعًا مِنْ أَوَّلِهَا، وَآيَةُ الْكُرْسِيِّ، وَآيَتَانِ بَعْدَهَا، وَثَلَاثٌ خَوَاتِيمُهَا، أَوَّلُهَا : # لِلَّهِ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ وَإِنْ تُبْدُوا مَا فِي أَنْفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُمْ بِهِ اللَّهُ فَيَغْفِرُ لِمَنْ يَشَاءُ وَيُعَذِّبُ مَنْ يَشَاءُ وَاللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ سورة البقرة آية 284 # \"",
    "malay_translation": "Jaafar bin 'Aun meriwayatkan, daripada Abu Al-'Umais, daripada Asy-Sya'bi, berkata: Abdullah berkata: \"Sesiapa yang membaca sepuluh ayat daripada Surah Al-Baqarah pada malam hari, syaitan tidak akan memasuki rumah itu pada malam tersebut sehingga waktu subuh: empat ayat daripada awal surah, Ayat Kursi, dua ayat selepasnya, dan tiga ayat terakhir surah, yang bermula dengan: \"Kepunyaan Allah jualah segala yang di langit dan di bumi; dan jika kamu melahirkan apa yang ada di dalam hati kamu atau kamu menyembunyikannya, nescaya Allah akan menghitungnya (dan menghisabnya) kamu. Kemudian Dia mengampuni sesiapa yang Dia kehendaki dan menyeksa sesiapa yang Dia kehendaki. Dan (ingatlah) Allah Maha Kuasa atas tiap-tiap sesuatu.\" (Surah Al-Baqarah: Ayat 284)"
  },
  {
    "id": 40176,
    "hadith_number": 2639,
    "tajuk_hadith": "Kelebihan Membaca Ayat-Ayat Tertentu Surah Al-Baqarah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَاصِمٍ  ، حَدَّثَنَا حَمَّادٌ  ، عَنْ عَاصِمٍ  ، عَنْ الشَّعْبِيِّ  ، عَنْ ابْنِ مَسْعُودٍ  ، قَالَ :\" مَنْ قَرَأَ أَرْبَعَ آيَاتٍ مِنْ أَوَّلِ سُورَةِ الْبَقَرَةِ ، وَآيَةَ الْكُرْسِيِّ، وَآيَتَانِ بَعْدَ آيَةِ الْكُرْسِيِّ، وَثَلَاثًا مِنْ آخِرِ سُورَةِ الْبَقَرَةِ ، لَمْ يَقْرَبْهُ وَلَا أَهْلَهُ يَوْمَئِذٍ شَيْطَانٌ، وَلَا شَيْءٌ يَكْرَهُهُ، وَلَا يُقْرَأْنَ عَلَى مَجْنُونٍ إِلَّا أَفَاقَ \"",
    "malay_translation": "Amru bin Asim telah mengkhabarkan kepada kami, Hammad telah menceritakan kepada kami, daripada Asim, daripada As-Sya'bi, daripada Ibnu Mas'ud, dia berkata: \"Sesiapa yang membaca empat ayat daripada awal Surah Al-Baqarah, dan Ayat Kursi, dan dua ayat selepas Ayat Kursi, dan tiga ayat daripada akhir Surah Al-Baqarah, maka syaitan tidak akan mendekatinya dan keluarganya pada hari itu, dan tidak ada sesuatu yang tidak disukai berlaku padanya, dan ayat-ayat ini tidak dibacakan kepada orang gila melainkan dia akan sembuh\"."
  },
  {
    "id": 40177,
    "hadith_number": 2640,
    "tajuk_hadith": "Keutamaan Membaca Ayat-Ayat Akhir Surah Al-Baqarah",
    "perawi_melayu": "Ali bin Abi Talib (Radiyallahu Anhu) (Diriwayatkan)",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ  ، عَنْ شُعْبَةَ  ، عَنْ أَبِي إِسْحَاق  ، عَمَّنْ  سَمِعَ عَلِيًّا  ، يَقُولُ :\" مَا كُنْتُ أَرَى أَنَّ أَحَدًا يَعْقِلُ يَنَامُ، حَتَّى يَقْرَأَ هَؤُلَاءِ الْآيَاتِ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ ، وَإِنَّهُنَّ لَمِنْ كَنْزٍ تَحْتَ الْعَرْشِ \"",
    "malay_translation": "Telah meriwayatkan kepada kami Sa'id bin Amir, daripada Syu'bah, daripada Abu Ishaq, daripada orang yang mendengar Ali (Radiyallahu Anhu) berkata: \"Saya tidak pernah menyangka ada seorang yang berakal akan tidur, sehingga dia membaca ayat-ayat akhir Surah Al-Baqarah. Sesungguhnya ia (ayat-ayat tersebut) adalah daripada khazanah di bawah Arasy (Allah)."
  },
  {
    "id": 40178,
    "hadith_number": 2641,
    "tajuk_hadith": "Keutamaan Membaca Sepuluh Ayat dari Surah Al-Baqarah Sebelum Tidur",
    "perawi_melayu": "Al-Mughirah bin Subei' (sahabat Abdullah)",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاق بْنُ عِيسَى  ، عَنْ أَبِي الْأَحْوَصِ  ، عَنْ أَبِي سِنَانٍ  ، عَنْ الْمُغِيرَةِ بْنِ سُبَيْعٍ  ، وَكَانَ مِنْ أَصْحَابِ عَبْدِ اللَّهِ ، قَالَ :\" مَنْ قَرَأَ عَشْرَ آيَاتٍ مِنْ الْبَقَرَةِ عِنْدَ مَنَامِهِ، لَمْ يَنْسَ الْقُرْآنَ : أَرْبَعُ آيَاتٍ مِنْ أَوَّلِهَا، وَآيَةُ الْكُرْسِيِّ، وَآيَتَانِ بَعْدَهَا، وَثَلَاثٌ مِنْ آخِرِهَا \".\n قَالَ إِسْحَاقُ : لَمْ يَنْسَ مَا قَدْ حَفِظَ، قَالَ أَبُو مُحَمَّد : مِنْهُمْ مَنْ يَقُولُ : الْمُغِيرَةُ بْنُ سُمَيْعٍ",
    "malay_translation": "Daripada Al-Mughirah bin Subei', yang merupakan salah seorang sahabat Abdullah, beliau berkata: \"Sesiapa yang membaca sepuluh ayat daripada Surah Al-Baqarah sebelum tidurnya, dia tidak akan melupakan Al-Quran: Empat ayat daripada awal surah, Ayat Al-Kursi, dua ayat selepasnya, dan tiga ayat daripada akhirnya.\" Ishaaq berkata: \"Dia tidak akan lupa apa yang telah dihafal.\" Abu Muhammad berkata: \"Sesetengah daripada mereka mengatakan: Al-Mughirah bin Sumai'."
  },
  {
    "id": 40179,
    "hadith_number": 2642,
    "tajuk_hadith": "Kelebihan Membaca Ayat al-Kursi dan Awal Surah Ghafir",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاق بْنُ عِيسَى  ، عَنْ أَبِي مُعَاوِيَةَ هُوَ مُحَمَّدُ بْنُ خَازِمٍ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الْمُلَيْكِيِّ  ، عَنْ أَبِي سَلَمَةَ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَنْ قَرَأَ آيَةَ الْكُرْسِيِّ، وَفَاتِحَةَ حم الْمُؤْمِنِ إِلَى قَوْلِه # غَافِرِ الذَّنْبِ وَقَابِلِ التَّوْبِ شَدِيدِ الْعِقَابِ ذِي الطَّوْلِ لا إِلَهَ إِلا هُوَ إِلَيْهِ الْمَصِيرُ سورة غافر آية 3 #، لَمْ يَرَ شَيْئًا يَكْرَهُهُ حَتَّى يُمْسِيَ، وَمَنْ قَرَأَهَا حِينَ يُمْسِي، لَمْ يَرَ شَيْئًا يَكْرَهُهُ حَتَّى يُصْبِحَ \"",
    "malay_translation": "Daripada Abu Hurairah رضي الله عنه berkata: Rasulullah ﷺ bersabda: \"Sesiapa yang membaca Ayat al-Kursi dan (awal) Surah Ghafir (dari permulaan hingga) firman-Nya: 'Yang mengampuni dosa, dan menerima taubat, yang berat azab-Nya, yang mempunyai kurnia, tiada Tuhan (yang berhak disembah) melainkan Dia. Kepada-Nya tempat kembali.' (Surah Ghafir: 3), dia tidak akan melihat sesuatu yang tidak disukainya hingga petang, dan sesiapa yang membacanya ketika petang, dia tidak akan melihat sesuatu yang tidak disukainya hingga pagi.\""
  },
  {
    "id": 40180,
    "hadith_number": 2643,
    "tajuk_hadith": "Allah Menulis Kitab Sebelum Penciptaan Langit dan Bumi",
    "perawi_melayu": "Nu'man bin Basyir",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَفَّانُ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، أَنْبَأَنَا أَشْعَثُ بْنُ عَبْدِ الرَّحْمَنِ الْجَرْمِيُّ  ، عَنْ أَبِي قِلَابَةَ  ، عَنْ أَبِي الْأَشْعَثِ الصَّنْعَانِيِّ  ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" إِنَّ اللَّهَ كَتَبَ كِتَابًا قَبْلَ أَنْ يَخْلُقَ السَّمَوَاتِ وَالْأَرْضَ بِأَلْفَيْ عَامٍ، فَأَنْزَلَ مِنْهُ آيَتَيْنِ خَتَمَ بِهِمَا سُورَةَ الْبَقَرَةِ ، وَلَا تُقْرَآنِ فِي دَارٍ ثَلَاثَ لَيَالٍ فَيَقْرَبُهَا شَيْطَانٌ \"",
    "malay_translation": "Daripada Nu'man bin Basyir رضي الله عنه, bahawa Rasulullah صلى الله عليه وسلم bersabda: \"Sesungguhnya Allah telah menulis sebuah kitab sebelum menciptakan langit dan bumi dalam masa dua ribu tahun, kemudian menurunkan dua ayat daripadanya yang mengakhiri Surah Al-Baqarah. Tidaklah dibacakan dua ayat itu di dalam sebuah rumah selama tiga malam, melainkan syaitan tidak akan mendekatinya.\""
  },
  {
    "id": 40181,
    "hadith_number": 2644,
    "tajuk_hadith": "Keutamaan Membaca Dua Ayat Terakhir Surah Al-Baqarah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ  ، عَنْ شُعْبَةَ  ، عَنْ مَنْصُورٍ  ، عَنْ إِبْرَاهِيمَ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ  ، عَنْ أَبِي مَسْعُودٍ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنْ قَرَأَ الْآيَتَيْنِ الْآخِرَتَيْنِ مِنْ سُورَةِ الْبَقَرَةِ فِي لَيْلَةٍ، كَفَتَاهُ \"",
    "malay_translation": "Daripada Abu Mas'ud r.a., daripada Nabi s.a.w bersabda: \"Sesiapa yang membaca dua ayat terakhir daripada Surah Al-Baqarah pada waktu malam, maka ia akan mencukupinya.\" (Maksudnya: Ia akan dijaga daripada kejahatan dan musibah)"
  },
  {
    "id": 40182,
    "hadith_number": 2645,
    "tajuk_hadith": "Nama Allah Yang Maha Agung dalam Dua Ayat",
    "perawi_melayu": "Asma' binti Yazid",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو عَاصِمٍ  ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ أَبِي زِيَادٍ  ، عَنْ شَهْرِ بْنِ حَوْشَبٍ  ، عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ  ، قَالَتْ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" اسْمُ اللَّهِ الْأَعْظَمُ فِي هَاتَيْنِ الْآيَتَيْنِ : # اللَّهُ لا إِلَهَ إِلا هُوَ الْحَيُّ الْقَيُّومُ سورة البقرة آية 255 #، # وَإِلَهُكُمْ إِلَهٌ وَاحِدٌ سورة البقرة آية 163 # \"",
    "malay_translation": "Telah menceritakan kepada kami Abu 'Asim, telah menceritakan kepada kami 'Ubaidullah bin Abi Ziyad, dari Syahr bin Hausyab, dari Asma' binti Yazid, dia berkata: Rasulullah ﷺ bersabda: \"Nama Allah yang Maha Agung terdapat pada dua ayat ini: # Allah, tidak ada Tuhan (yang berhak disembah) melainkan Dia. Yang Hidup kekal lagi terus-menerus mengurus (makhluk-Nya). (Surah Al-Baqarah: 255) # dan # Dan Tuhanmu adalah Tuhan Yang Maha Esa; tidak ada Tuhan (yang berhak disembah) melainkan Dia Yang Maha Pemurah lagi Maha Penyayang. (Surah Al-Baqarah: 163) #\""
  },
  {
    "id": 40183,
    "hadith_number": 2646,
    "tajuk_hadith": "Keistimewaan Dua Ayat Terakhir Surah Al-Baqarah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُجَاهِدٌ هُوَ ابْنُ مُوسَى  ، حَدَّثَنَا مَعْنٌ  ، حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ  ، عَنْ أَبِي الزَّاهِرِيَّةِ  ، عَنْ جُبَيْرِ بْنِ نُفَيْرٍ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" إِنَّ اللَّهَ خَتَمَ سُورَةَ الْبَقَرَةِ بِآيَتَيْنِ أُعْطِيتُهُمَا مِنْ كَنْزِهِ الَّذِي تَحْتَ الْعَرْشِ، فَتَعَلَّمُوهُنَّ وَعَلِّمُوهُنَّ نِسَاءَكُمْ، فَإِنَّهُمَا صَلَاةٌ، وَقُرْآنٌ، وَدُعَاءٌ \"",
    "malay_translation": "Telah menceritakan kepada kami Mujahid, dia adalah anak kepada Musa, telah menceritakan kepada kami Ma'an, telah menceritakan kepada kami Mu'awiyah bin Salih, dari Abu az-Zahiriyah, dari Jubair bin Nufair: Bahawa Rasulullah SAW bersabda: \"Sesungguhnya Allah SWT menutup surah Al-Baqarah dengan dua ayat yang diberikan kepadaku dari perbendaharaan-Nya yang berada di bawah Arasy, maka pelajarilah kedua ayat itu dan ajarkanlah kepada isteri-isteri kalian, kerana sesungguhnya kedua ayat itu adalah solat, al-Quran, dan doa.\""
  },
  {
    "id": 40184,
    "hadith_number": 2647,
    "tajuk_hadith": "Keutamaan Mempelajari Surah Al-Baqarah dan Al Imran",
    "perawi_melayu": "Abdullah bin Buraidah dari ayahnya",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا بَشِيرٌ هُوَ ابْنُ الْمُهَاجِرِ  ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ  ، عَنْ أَبِيهِ  ، قَالَ : كُنْتُ جَالِسًا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَمِعْتُهُ يَقُولُ :\" تَعَلَّمُوا سُورَةَ الْبَقَرَةِ ، فَإِنَّ أَخْذَهَا بَرَكَةٌ، وَتَرْكَهَا حَسْرَةٌ، وَلَا يَسْتَطِيعُهَا الْبَطَلَةُ، ثُمَّ سَكَتَ سَاعَةً، ثُمَّ قَالَ : تَعَلَّمُوا سُورَةَ الْبَقَرَةِ ، وَآلِ عِمْرَانَ ، فَإِنَّهُمَا الزَّهْرَاوَانِ، وَإِنَّهُمَا تُظِلَّانِ صَاحِبَهُمَا يَوْمَ الْقِيَامَةِ كَأَنَّهُمَا غَمَامَتَانِ أَوْ : غَيَايَتَانِ، أَوْ : فِرْقَانِ مِنْ طَيْرٍ صَوَافَّ ، وَإِنَّ الْقُرْآنَ يَلْقَى صَاحِبَهُ يَوْمَ الْقِيَامَةِ حِينَ يَنْشَقُّ عَنْهُ الْقَبْرُ كَالرَّجُلِ الشَّاحِبِ، فَيَقُولُ لَهُ : هَلْ تَعْرِفُنِي؟ فَيَقُولُ : مَا أَعْرِفُكَ، فَيَقُولُ : أَنَا صَاحِبُكَ الْقُرْآنُ الَّذِي أَظْمَأْتُكَ فِي الْهَوَاجِرِ، وَأَسْهَرْتُ لَيْلَكَ، وَإِنَّ كُلَّ تَاجِرٍ مِنْ وَرَاءِ تِجَارَتِهِ، وَإِنَّكَ الْيَوْمَ مِنْ وَرَاءِ كُلِّ تِجَارَةٍ، فَيُعْطَى الْمُلْكَ بِيَمِينِهِ، وَالْخُلْدَ بِشِمَالِهِ، وَيُوضَعُ عَلَى رَأْسِهِ تَاجُ الْوَقَارِ، وَيُكْسَى وَالِدَاهُ حُلَّتَيْنِ لَا يُقَوَّمُ لَهُمَا الدُّنْيَا، فَيَقُولَانِ : بِمَ كُسِينَا هَذَا؟ وَيُقَالُ لَهُمَا : بِأَخْذِ وَلَدِكُمَا الْقُرْآنَ، ثُمَّ يُقَالُ لَهُ : اقْرَأْ وَاصْعَدْ فِي دَرَجِ الْجَنَّةِ وَغُرَفِهَا، فَهُوَ فِي صُعُودٍ مَا دَامَ يَقْرَأُ هَذًّا كَانَ، أَوْ تَرْتِيلًا \"",
    "malay_translation": "Abu Nu'aim telah menceritakan kepada kami, Bashir, dia adalah Ibnu al-Muhajir, telah menceritakan kepadaku Abdullah bin Buraidah, daripada ayahnya, dia berkata: “Aku sedang duduk bersama Nabi ﷺ, lalu aku mendengar baginda bersabda: “Pelajarilah surah Al-Baqarah, kerana sesungguhnya mempelajarinya adalah keberkatan, meninggalkannya adalah penyesalan, dan orang-orang yang melakukan kebatilan tidak mampu melakukannya.” Kemudian baginda diam sejenak, kemudian bersabda: “Pelajarilah surah Al-Baqarah dan Ali Imran, kerana sesungguhnya kedua-duanya adalah (surah yang) menerangi, dan keduanya akan menaungi sahabatnya pada hari kiamat seolah-olah keduanya adalah dua awan, atau dua naungan, atau dua kelompok burung yang sedang terbang beriringan. Sesungguhnya Al-Quran akan menemui sahabatnya pada hari kiamat ketika kubur terbuka daripadanya (sahabat Al-Quran) seperti seorang lelaki yang pucat, lalu Al-Quran bertanya kepadanya: “Adakah engkau mengenaliku?” Maka dia menjawab: “Aku tidak mengenalimu.” Al-Quran berkata: “Aku adalah sahabatmu, Al-Quran yang telah membuat engkau kehausan di tengah hari yang panas terik, dan aku telah membuat engkau berjaga malam. Sesungguhnya setiap peniaga akan berada di belakang perdagangannya, dan sesungguhnya engkau pada hari ini berada di belakang semua perniagaan.” Kemudian dia diberi kerajaan di tangan kanannya, dan kekekalan di tangan kirinya, dan diletakkan di atas kepalanya mahkota kewibawaan, dan kedua ibu bapanya dipakaikan dua perhiasan yang tidak ternilai harganya oleh dunia, lalu keduanya berkata: “Dengan sebab apa kami diberi pakaian ini?” Lalu dikatakan kepada mereka: “Kerana anak kamu mengambil (mempelajari) Al-Quran.” Kemudian dikatakan kepadanya: “Bacalah dan naiklah ke darjat syurga dan biliknya, maka dia akan terus naik selama dia membaca sama ada dengan perlahan atau dengan tartil (bacaan yang baik).”"
  },
  {
    "id": 40185,
    "hadith_number": 2648,
    "tajuk_hadith": "Keutamaan Membaca Surah Al-Baqarah dan Ali 'Imran",
    "perawi_melayu": "Abu Umamah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، حَدَّثَنِي مُعَاوِيَةُ  ، عَنْ أَبِي يَحْيَى سُلَيْمِ بْنِ عَامِرٍ  : أَنَّهُ سَمِعَ أَبَا أُمَامَةَ  ، يَقُولُ :\" إِنَّ أَخًا لَكُمْ أُرِيَ فِي الْمَنَامِ أَنَّ النَّاسَ يَسْلُكُونَ فِي صَدْعِ جَبَلٍ وَعْرٍ طَوِيلٍ، وَعَلَى رَأْسِ الْجَبَلِ شَجَرَتَانِ خَضْرَاوَانِ تَهْتِفَانِ : هَلْ فِيكُمْ مَنْ يَقْرَأُ سُورَةَ الْبَقَرَةِ ؟ هَلْ فِيكُمْ مَنْ يَقْرَأُ سُورَةَ آلِ عِمْرَانَ ؟ فَإِذَا قَالَ الرَّجُلُ : نَعَمْ، دَنَتَا بِأَعْذَاقِهِمَا حَتَّى يَتَعَلَّقَ بِهِمَا، فَتَخْطِرَانِ بِهِ الْجَبَلَ \".\n قَالَ أَبُو مُحَمَّد : الْأَعْذَاقُ : الْأَغْصَانُ",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Salih, telah menceritakan kepadaku Mu'awiyah, daripada Abu Yahya Sulaim bin Amir, bahawa dia mendengar Abu Umamah berkata: \"Sesungguhnya seorang saudara kamu telah bermimpi bahawa manusia sedang meniti di celah gunung yang terjal dan panjang. Di atas puncak gunung itu ada dua pokok hijau yang menyeru: 'Adakah di antara kamu yang membaca Surah Al-Baqarah? Adakah di antara kamu yang membaca Surah Ali 'Imran?' Apabila seseorang itu berkata: 'Ya,' maka kedua pokok itu menghulurkan ranting-rantingnya sehingga dia berpaut padanya, lalu mereka merentasi gunung itu.\" Abu Muhammad berkata: 'Al-A'dzaq' ialah dahan-dahan."
  },
  {
    "id": 40186,
    "hadith_number": 2649,
    "tajuk_hadith": "Keutamaan Dua Surah: Al-Baqarah dan Ali 'Imran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الرَّقِّيُّ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَمْرٍو  ، عَنْ زَيْدٍ  ، عَنْ جَابِرٍ  ، عَنْ أَبِي الضُّحَى  ، عَنْ مَسْرُوقٍ  ، عَنْ عَبْدِ اللَّهِ  ، قَالَ : \" قَرَأَ رَجُلٌ عِنْدَ عَبْدِ اللَّهِ الْبَقَرَةَ ، وَآلَ عِمْرَانَ ، فَقَالَ :قَرَأْتَ سُورَتَيْنِ فِيهِمَا اسْمُ اللَّهِ الْأَعْظَمُ الَّذِي إِذَا دُعِيَ بِهِ، أَجَابَ، وَإِذَا سُئِلَ بِهِ أَعْطَى \"",
    "malay_translation": "Daripada Abdullah (bin Mas'ud), seorang lelaki membaca surah Al-Baqarah dan Ali 'Imran di hadapan Abdullah, maka Abdullah berkata: \"Kamu telah membaca dua surah yang mengandungi Ism Allah al-A'zam (Nama Allah Yang Agung), yang jika seseorang berdoa dengannya, pasti akan diperkenankan, dan jika diminta sesuatu dengannya, pasti akan diberi.\" (Diriwayatkan oleh 'Abdullah bin Ja'far al-Raqqi melalui sanad yang lain.)"
  },
  {
    "id": 40187,
    "hadith_number": 2650,
    "tajuk_hadith": "Keutamaan Membaca Surah Al-Baqarah dan Ali 'Imran",
    "perawi_melayu": "Kā'b",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سَعِيدٍ  ، حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ حَرْبٍ  ، عَنْ الْجُرَيْرِيِّ  ، عَنْ أَبِي عَطَّافٍ L275 ،  عَنْ كَعْبٍ  ، قَالَ :\" مَنْ قَرَأَ الْبَقَرَةَ ، وَآلَ عِمْرَانَ ، جَاءَتَا يَوْمَ الْقِيَامَةِ تَقُولَانِ : رَبَّنَا لَا سَبِيلَ عَلَيْهِ \"",
    "malay_translation": "Diriwayatkan daripada Kā'b, beliau berkata: \"Sesiapa yang membaca surah al-Baqarah dan Ali 'Imran, kedua-duanya akan datang pada hari kiamat seraya berkata: 'Wahai Tuhan kami, tiada jalan (untuk menghukumnya)'."
  },
  {
    "id": 40188,
    "hadith_number": 2651,
    "tajuk_hadith": "Keutamaan Membaca Surah Ali Imran",
    "perawi_melayu": "Abdullah bin Mas'ud",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا إِسْرَائِيلُ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ سُلَيْمِ بْنِ حَنْظَلَةَ الْبَكْرِيِّ  ، قَالَ : قَالَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ   :\" مَنْ قَرَأَ آلَ عِمْرَانَ ، فَهُوَ غَنِيٌّ، وَالنِّسَاءُ مُحَبِّرَةٌ\".\nقَالَ أَبُو مُحَمَّد : مُحَبِّرَةٌ : مُزَيِّنَةٌ",
    "malay_translation": "Abu Nu'aym meriwayatkan, daripada Israil, daripada Abu Ishaq, daripada Sulaym bin Hanzalah al-Bakri, berkata: Abdullah bin Mas'ud berkata: \"Sesiapa yang membaca Surah Ali Imran, maka dia kaya, dan wanita adalah muhabbirah (berhias).\" Abu Muhammad berkata: Muhabbirah bermaksud: berhias."
  },
  {
    "id": 40189,
    "hadith_number": 2652,
    "tajuk_hadith": "Ganjaran Membaca Akhir Surah Ali 'Imran pada Malam Hari",
    "perawi_melayu": "Uthman bin Affan (r.a.)",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاق بْنُ عِيسَى  ، عَنْ ابْنِ لَهِيعَةَ  ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ  ، عَنْ أَبِي الْخَيْرِ  ، عَنْ عُثْمَانَ بْنِ عَفَّانَ  ، قَالَ :\" مَنْ قَرَأَ آخِرَ آلِ عِمْرَانَ فِي لَيْلَةٍ، كُتِبَ لَهُ قِيَامُ لَيْلَةٍ \"",
    "malay_translation": "Daripada Uthman bin Affan (r.a.) berkata: \"Sesiapa yang membaca akhir Surah Ali 'Imran pada malam hari, maka akan ditulis baginya pahala seolah-olah dia telah melakukan qiamullail (solat malam).\""
  },
  {
    "id": 40190,
    "hadith_number": 2653,
    "tajuk_hadith": "Keistimewaan Membaca Surah Ali 'Imran pada Hari Jumaat",
    "perawi_melayu": "Mak'hul",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ  ، حَدَّثَنَا صَدَقَةُ بْنُ خَالِدٍ  ، عَنْ يَحْيَى بْنِ الْحَارِثِ  ، عَنْ مَكْحُولٍ  ، قَالَ :\" مَنْ قَرَأَ سُورَةَ آلِ عِمْرَانَ يَوْمَ الْجُمُعَةِ، صَلَّتْ عَلَيْهِ الْمَلَائِكَةُ إِلَى اللَّيْلِ \"",
    "malay_translation": "Daripada Mak'hul berkata: \"Sesiapa yang membaca Surah Ali 'Imran pada hari Jumaat, maka para malaikat akan berselawat ke atasnya sehingga malam hari.\""
  },
  {
    "id": 40191,
    "hadith_number": 2654,
    "tajuk_hadith": "Keistimewaan Surah Ali 'Imran (Menurut Abdullah)",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْقَاسِمُ بْنُ سَلَّامٍ أَبُو عُبَيْدٍ  ، قَالَ : حَدَّثَنِي عُبَيْدُ اللَّهِ الْأَشْجَعِيُّ  ، حَدَّثَنِي مِسْعَرٌ  ، قَالَ : حَدَّثَنِي جَابِرٌ  ، قَبْلَ أَنْ يَقَعَ فِيمَا وَقَعَ فِيهِ ، عَنْ الشَّعْبِيِّ  ، قَالَ : قَالَ عَبْدُ اللَّهِ   :\" نِعْمَ كَنْزُ الصُّعْلُوكِ سُورَةُ آلِ عِمْرَانَ ، يَقُومُ بِهَا فِي آخِرِ اللَّيْلِ \"",
    "malay_translation": "Telah menceritakan kepada kami Al-Qasim bin Sallam Abu Ubaid, berkata: Telah menceritakan kepada ku 'Ubaidullah Al-Asyja'i, telah menceritakan kepada ku Mis'ar, berkata: Telah menceritakan kepada ku Jabir, sebelum dia terlibat dalam perkara yang dia terlibat di dalamnya, daripada Asy-Sya'bi, berkata: Abdullah berkata: \"Sebaik-baik simpanan (harta) bagi orang miskin ialah Surah Ali 'Imran, dia membacanya (qiamulail) pada akhir malam.\""
  },
  {
    "id": 40192,
    "hadith_number": 2655,
    "tajuk_hadith": "Keselamatan Lelaki yang Membaca Surah Ali Imran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سَعِيدٍ ، حَدَّثَنَا عَبْدُ السَّلَامِ ، عَنِ الْجُرَيْرِيِّ ،  عَنْ أَبِي السَّلِيلِ ، قَالَ : أَصَابَ رَجُلٌ دَمًا، قَالَ : فَأَوَى إِلَى وَادِي مَجَنَّةٍ : وَادٍ لَا يُمْسِي فِيهِ أَحَدٌ إِلَّا أَصَابَتْهُ حَيَّةٌ : وَعَلَى شَفِيرِ الْوَادِي رَاهِبَانِ، قَالَ أَحَدُهُمَا لِصَاحِبِهِ : هَلَكَ وَاللَّهِ الرَّجُلُ، قَالَ :فَافْتَتَحَ سُورَةَ آلِ عِمْرَانَ ، قَالَا : فَقَرَأَ سُورَةً طَيِّبَةً لَعَلَّهُ سَيَنْجُو، قَالَ : فَأَصْبَحَ سَلِيمًا \".\nقَالَ أَبُو مُحَمَّد : أَبُو السَّلِيلِ : ضُرَيْبُ بْنُ نُقَيْرٍ، ويقال : ابن نفير",
    "malay_translation": "Diriwayatkan daripada Abu As-Saleel berkata: Seorang lelaki mendapat luka. Lalu dia pergi ke Wadi Majannah, sebuah lembah yang sesiapa sahaja yang bermalam di situ akan dipatuk ular. Di tepi lembah itu terdapat dua orang rahib. Seorang daripada mereka berkata kepada temannya: “Demi Allah, lelaki itu pasti binasa.” Lalu lelaki itu membuka Surah Ali Imran. Mereka berkata: Dia membaca surah yang baik, semoga dia akan selamat. Dia berkata: Keesokannya dia selamat."
  },
  {
    "id": 40193,
    "hadith_number": 2656,
    "tajuk_hadith": "Keutamaan Surah-Surah Panjang Al-Quran",
    "perawi_melayu": "Mu'adh bin Hani, Ibrahim bin Tahman, 'Asim, daripada Al-Musayyab bin Rafi', berkata: 'Abdullah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُعَاذُ بْنُ هَانِئٍ  ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ  ، حَدَّثَنَا عَاصِمٌ  ، عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ  ، قَالَ : قَالَ عَبْدُ اللَّهِ   :\" السَّبْعُ الطُّوَلُ مِثْلُ التَّوْرَاةِ، وَالْمِئِينَ مِثْلُ الْإِنْجِيلِ، وَالْمَثَانِي مِثْلُ الزَّبُورِ، وَسَائِرُ الْقُرْآنِ بَعْدُ فَضْلٌ \"",
    "malay_translation": "Telah menceritakan kepada kami Mu'adh bin Hani', telah menceritakan kepada kami Ibrahim bin Tahman, telah menceritakan kepada kami 'Asim, daripada Al-Musayyab bin Rafi', berkata: 'Abdullah berkata: \"Tujuh surah yang panjang (Sab'uth Thiwal) adalah seperti Taurat, surah-surah Al-Mi'in adalah seperti Injil, surah-surah Al-Mathani adalah seperti Zabur, dan selebihnya Al-Quran adalah kelebihan (fadhl).\""
  },
  {
    "id": 40194,
    "hadith_number": 2657,
    "tajuk_hadith": "Keutamaan Haiwan Ternakan dalam Al-Quran",
    "perawi_melayu": "Umar (Semoga Allah meridhainya)",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا زُهَيْرٌ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ عَبْدِ اللَّهِ بْنِ خَلِيفَةَ  ، عَنْ عُمَرَ  ، قَالَ :\" الْأَنْعَامُ مِنْ نَوَاجِبِ الْقُرْآنِ \"",
    "malay_translation": "Abu Nu'aim meriwayatkan, Zuhair meriwayatkan, daripada Abu Ishaq, daripada Abdullah bin Khalifah, daripada Umar (Semoga Allah meridhainya), beliau berkata: \"Haiwan ternakan adalah antara kewajipan dalam Al-Quran.\""
  },
  {
    "id": 40195,
    "hadith_number": 2658,
    "tajuk_hadith": "Surah al-An'am Pembuka Taurat, Surah Hud Penutupnya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا هَمَّامٌ  .\nعَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ  ، عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ  ، قَالَ : سَمِعْتُ كَعْبًا  ، قَالَ :\" فَاتِحَةُ التَّوْرَاةِ الْأَنْعَامُ ، وَخَاتِمَتُهَا هُودٌ \"",
    "malay_translation": "Muslim bin Ibrahim telah meriwayatkan, Hammam telah meriwayatkan.\nDaripada Abu Imran al-Jauni, daripada Abdullah bin Rabah, dia berkata: Aku mendengar Ka'ab berkata: \"Pembuka Taurat adalah Surah al-An'am, dan penutupnya adalah Surah Hud.\""
  },
  {
    "id": 40196,
    "hadith_number": 2659,
    "tajuk_hadith": "Anjuran Membaca Surah Hud pada Hari Jumaat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَنْبَأَنَا هَمَّامٌ  ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ  ، عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ  ، عَنْ كَعْبٍ   : أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" اقْرَءُوا سُورَةَ هُودٍ يَوْمَ الْجُمُعَةِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah memberitahu kepada kami Hammam, daripada Abu Imran al-Jouni, daripada Abdullah bin Rabah, daripada Ka'ab: Bahawa Nabi SAW bersabda: \"Bacalah Surah Hud pada hari Jumaat.\""
  },
  {
    "id": 40197,
    "hadith_number": 2660,
    "tajuk_hadith": "Galakkan Membaca Surah Hud pada Hari Jumaat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا هَمَّامٌ  ، حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ  ، عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ  ، عَنْ كَعْبٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" اقْرَءُوا سُورَةَ هُودٍ يَوْمَ الْجُمُعَةِ \"",
    "malay_translation": "Muslim bin Ibrahim meriwayatkan, Hamman meriwayatkan, Abu Imran al-Jauni meriwayatkan, daripada Abdullah bin Rabah, daripada Ka'ab, berkata: Rasulullah SAW bersabda: \"Bacalah Surah Hud pada hari Jumaat.\""
  },
  {
    "id": 40198,
    "hadith_number": 2661,
    "tajuk_hadith": "Keutamaan Membaca Sepuluh Ayat Surah Al-Kahfi",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْمُغِيرَةِ  ، حَدَّثَتْنَا عَبْدَةُ  ، عَنْ خَالِدِ بْنِ مَعْدَانَ  ، قَالَ :\" مَنْ قَرَأَ عَشْرَ آيَاتٍ مِنْ الْكَهْفِ ، لَمْ يَخَفْ الدَّجَّالَ \"",
    "malay_translation": "Abu al-Mughirah meriwayatkan, Abdah menceritakan, daripada Khalid bin Ma'dan, dia berkata: \"Sesiapa yang membaca sepuluh ayat daripada Surah Al-Kahfi, dia tidak akan takut kepada Dajjal.\""
  },
  {
    "id": 40199,
    "hadith_number": 2662,
    "tajuk_hadith": "Keistimewaan Membaca Akhir Surah Al-Kahfi",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ  ، عَنْ الْأَوْزَاعِيِّ  ، عَنْ عَبْدَةَ  ، عَنْ زِرِّ بْنِ حُبَيْشٍ  ، قَالَ :\" مَنْ قَرَأَ آخِرَ سُورَةِ الْكَهْفِ لِسَاعَةٍ، يُرِيدُ يَقُومُ مِنْ اللَّيْلِ، قَامَهَا \"، قَالَ عَبْدَةُ : فَجَرَّبْنَاهُ، فَوَجَدْنَاهُ كَذَلِكَ",
    "malay_translation": "Muhammad bin Kathir telah meriwayatkan kepada kami, daripada Al-Awza'i, daripada 'Abdah, daripada Zirr bin Hubaysh, dia berkata: \"Sesiapa yang membaca akhir Surah Al-Kahfi pada satu masa, dengan niat untuk bangun malam, nescaya dia akan bangun.\" 'Abdah berkata: \"Kami telah mencubanya, dan kami mendapatinya seperti itu.\""
  },
  {
    "id": 40200,
    "hadith_number": 2663,
    "tajuk_hadith": "Keutamaan Membaca Surah Al-Kahf pada Malam Jumaat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا هُشَيْمٌ  ، حَدَّثَنَا أَبُو هَاشِمٍ  ، عَنْ أَبِي مِجْلَزٍ  ، عَنْ قَيْسِ بْنِ عُبَادٍ  ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ  ، قَالَ :\" مَنْ قَرَأَ سُورَةَ الْكَهْفِ لَيْلَةَ الْجُمُعَةِ، أَضَاءَ لَهُ مِنْ النُّورِ فِيمَا بَيْنَهُ وَبَيْنَ الْبَيْتِ الْعَتِيقِ \"",
    "malay_translation": "Abu Sa'id al-Khudri رضي الله عنه meriwayatkan: \"Barangsiapa yang membaca Surah Al-Kahf pada malam Jumaat, akan diterangi cahaya antara dirinya dan Baitul Atiq (Kaabah).\""
  },
  {
    "id": 40201,
    "hadith_number": 2664,
    "tajuk_hadith": "Keutamaan Membaca Surah As-Sajdah (Alif Lam Mim Tanzil)",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْمُغِيرَةِ  ، حَدَّثَتْنَا عَبْدَةُ  ، عَنْ خَالِدِ بْنِ مَعْدَانَ  ، قَالَ :\" اقْرَءُوا الْمُنَجِّيَةَ، وَهِيَ : ( الم تَنْزِيلُ )، فَإِنَّهُ بَلَغَنِي أَنَّ رَجُلًا كَانَ يَقْرَؤُهَا مَا يَقْرَأُ شَيْئًا غَيْرَهَا، وَكَانَ كَثِيرَ الْخَطَايَا، فَنَشَرَتْ جَنَاحَهَا عَلَيْهِ، وَقَالَتْ : رَبِّ اغْفِرْ لَهُ، فَإِنَّهُ كَانَ يُكْثِرُ قِرَاءَتِي، فَشَفَّعَهَا الرَّبُّ فِيهِ، وَقَالَ : اكْتُبُوا لَهُ بِكُلِّ خَطِيئَةٍ حَسَنَةً، وَارْفَعُوا لَهُ دَرَجَةً \"",
    "malay_translation": "Abu Al-Mughirah telah meriwayatkan, 'Abdalah telah menceritakan, daripada Khalid bin Ma'daan, beliau berkata: \"Bacalah al-Munajjiyah, iaitu surah (Alif Lam Mim Tanzil – Surah As-Sajdah). Sesungguhnya telah sampai kepada pengetahuan saya bahawa seorang lelaki sentiasa membacanya dan tidak membaca selainnya, sedangkan dia seorang yang banyak melakukan kesalahan. Lalu surah itu mengembangkan sayapnya ke atasnya dan berkata: 'Ya Rabb, ampunilah dia, kerana dia sentiasa membaca aku.' Maka Allah memberikan syafaat kepadanya dan berfirman: 'Catatkan baginya setiap kesalahan dengan satu kebaikan, dan naikkanlah darjatnya.'\""
  },
  {
    "id": 40202,
    "hadith_number": 2665,
    "tajuk_hadith": "Ganjaran Membaca Surah As-Sajdah dan Al-Mulk",
    "perawi_melayu": "Ka'ab",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَفَّانُ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، أنبأنَا أَبُو الزُّبَيْرِ  ، عَنْ عَبْدِ اللَّهِ بْنِ ضَمْرَةَ  ، عَنْ كَعْبٍ   قَالَ :\" مَنْ قَرَأَ ( ألم تَنْزِيلُ ) السَّجْدَةَ ، وَتَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ، كُتِبَ لَهُ سَبْعُونَ حَسَنَةً، وَحُطَّ عَنْهُ بِهَا سَبْعُونَ سَيِّئَةً، وَرُفِعَ لَهُ بِهَا سَبْعُونَ دَرَجَةً \"",
    "malay_translation": "Daripada Ka'ab, beliau berkata: \"Sesiapa yang membaca Surah As-Sajdah (Alif Lam Mim Tanzil) dan Surah Al-Mulk (Tabarakallazi Biyadihil Mulk), akan ditulis baginya tujuh puluh kebaikan, dihapuskan daripadanya tujuh puluh keburukan, dan diangkat baginya tujuh puluh darjat.\""
  },
  {
    "id": 40203,
    "hadith_number": 2666,
    "tajuk_hadith": "Al-Quran Membela Pembacanya di Dalam Kubur",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، حَدَّثَنِي مُعَاوِيَةُ بْنُ صَالِحٍ  : أَنَّهُ سَمِعَ أَبَا خَالِدٍ عَامِرَ بْنَ جَشِيبٍ  ، وَبَحِيرَ بْنَ سَعْدٍ  ، يُحَدِّثَانِ : أَنَّ خَالِدَ بْنَ مَعْدَانَ  ، قَالَ :\" إِنَّ # الم { 1 } تَنْزِيلُ الْكِتَابِ لا رَيْبَ فِيهِ مِنْ رَبِّ الْعَالَمِينَ { 2 } سورة السجدة آية 1-2 # تُجَادِلُ عَنْ صَاحِبِهَا فِي الْقَبْرِ، تَقُولُ : اللَّهُمَّ إِنْ كُنْتُ مِنْ كِتَابِكَ، فَشَفِّعْنِي فِيهِ، وَإِنْ لَمْ أَكُنْ مِنْ كِتَابِكَ، فَامْحُنِي عَنْهُ، وَإِنَّهَا تَكُونُ كَالطَّيْرِ تَجْعَلُ جَنَاحَهَا عَلَيْهِ، فَيُشْفَعُ لَهُ، فَتَمْنَعُهُ مِنْ عَذَابِ الْقَبْرِ، وَفِي ( تَبَارَكَ ) مِثْلَهُ\"، فَكَانَ خَالِدٌ لَا يَبِيتُ حَتَّى يَقْرَأَ بِهِمَا",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Salih, telah menceritakan kepadaku Mu'awiyah bin Salih: Bahawa dia mendengar Abu Khalid Amir bin Jashib, dan Bahir bin Sa'd, menceritakan: Bahawa Khalid bin Ma'dan berkata: \"Sesungguhnya # الم {1} (Alif, Laam, Mim) Turunnya Kitab (Al-Quran) ini, tidak ada keraguan padanya, (ia datang) dari Tuhan seluruh alam. {2} (Surah As-Sajdah: 1-2) # Akan membela pembacanya di dalam kubur, ia berkata: 'Ya Allah, sekiranya aku dari kitab-Mu, maka berilah syafaat kepadanya (pembaca), dan jika aku bukan dari kitab-Mu, maka hapuskanlah aku daripadanya'. Dan sesungguhnya ia (Al-Quran) seperti burung yang meletakkan sayapnya ke atasnya (pembaca), lalu ia diberi syafaat baginya, maka ia menghalangnya dari azab kubur, dan dalam (Surah) Tabaraka (Al-Mulk) juga seperti itu\". Maka adalah Khalid tidak bermalam sehingga ia membaca kedua-duanya (Surah As-Sajdah dan Al-Mulk)."
  },
  {
    "id": 40204,
    "hadith_number": 2667,
    "tajuk_hadith": "Amalan Nabi SAW Sebelum Tidur",
    "perawi_melayu": "Jabir",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ لَيْثٍ  ، عَنْ أَبِي الزُّبَيْرِ  ، عَنْ جَابِرٍ  ، قَالَ : كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" لَا يَنَامُ حَتَّى يَقْرَأَ : ( تَنْزِيلُ ) السَّجْدَةَ ، ( وَتَبَارَكَ ) \"",
    "malay_translation": "Daripada Jabir, beliau berkata: \"Nabi SAW tidak tidur sehinggalah baginda membaca (Surah) As-Sajdah dan (Surah) Al-Mulk."
  },
  {
    "id": 40205,
    "hadith_number": 2668,
    "tajuk_hadith": "Keutamaan Surah dalam Al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ خَالِدٍ ، حَدَّثَنَا مُعْتَمِرٌ ، عَنْ لَيْثٍ ، عَنْ طَاوُسٍ ، قَالَ :\" فُضِّلَتَا عَلَى كُلِّ سُورَةٍ فِي الْقُرْآنِ بِسِتِّينَ حَسَنَةً \"",
    "malay_translation": "Telah menceritakan kepada kami Musa bin Khalid, telah menceritakan kepada kami Mu'tamir, dari Laith, dari Tawus, berkata: \"(Dua surah) itu diutamakan atas setiap surah dalam Al-Quran dengan enam puluh kebaikan.\""
  },
  {
    "id": 40206,
    "hadith_number": 2669,
    "tajuk_hadith": "Surah Al-Mulk Membela Penghuni Kubur",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا حَجَّاجُ بْنُ مِنْهَالٍ ، حَدَّثَنَا شُعْبَةُ ، حَدَّثَنِي عَمْرُو بْنُ مُرَّةَ ، قَالَ : سَمِعْتُ مُرَّةَ ، يَقُولُ :\" أُتِيَ رَجُلٌ فِي قَبْرِهِ، فَأُتِيَ جَانِبُ قَبْرِهِ، فَجَعَلَتْ سُورَةٌ مِنْ الْقُرْآنِ ثَلَاثُونَ آيَةً تُجَادِلُ عَنْهُ، حَتَّى قَالَ : فَنَظَرْنَا أَنَا وَمَسْرُوقٌ، فَلَمْ نَجِدْ فِي الْقُرْآنِ سُورَةً ثَلَاثِينَ آيَةً إِلَّا تَبَارَكَ \"",
    "malay_translation": "Diriwayatkan oleh Hajjaj bin Minhal, dari Syu'bah, dari Amr bin Murrah, berkata: Saya mendengar Murrah berkata: \"Seorang lelaki didatangi di dalam kuburnya. Lalu, dari sisi kuburnya, ada surah dari Al-Quran yang terdiri daripada tiga puluh ayat membela dirinya, sehinggalah dia berkata: Maka kami (Murrah) dan Masruq melihat, dan kami tidak menjumpai dalam Al-Quran surah yang mempunyai tiga puluh ayat kecuali Surah Al-Mulk (Tabarak).\""
  },
  {
    "id": 40207,
    "hadith_number": 2670,
    "tajuk_hadith": "Allah Membaca Surah Taha dan Yasin Sebelum Penciptaan Langit dan Bumi",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ  ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُهَاجِرِ بْنِ الْمِسْمَارِ  ، عَنْ عُمَرَ بْنِ حَفْصِ بْنِ ذَكْوَانَ  ، عَنْ مَوْلَى الْحُرَقَةِ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَرَأَ طه ، وَيس قَبْلَ أَنْ يَخْلُقَ السَّمَوَاتِ وَالْأَرْضَ بِأَلْفِ عَامٍ، فَلَمَّا سَمِعَتْ الْمَلَائِكَةُ الْقُرْآنَ، قَالَتْ : طُوبَى لِأُمَّةٍ يَنْزِلُ هَذَا عَلَيْهَا، وَطُوبَى لِأَجْوَافٍ تَحْمِلُ هَذَا، وَطُوبَى لِأَلْسِنَةٍ تَتَكَلَّمُ بِهَذَا \"",
    "malay_translation": "Daripada Abu Hurairah رضي الله عنه, beliau berkata: Rasulullah ﷺ bersabda: \"Sesungguhnya Allah Tabaraka wa Ta'ala telah membaca Surah Taha dan Yasin sebelum Dia menciptakan langit dan bumi seribu tahun. Apabila malaikat mendengar Al-Quran, mereka berkata: 'Beruntunglah umat yang diturunkan kepada mereka (Al-Quran) ini, beruntunglah perut yang membawa (menghafaz) ini, dan beruntunglah lidah yang berbicara dengan (membaca) ini.'"
  },
  {
    "id": 40208,
    "hadith_number": 2671,
    "tajuk_hadith": "Keutamaan Membaca Surah Yasin di Malam Hari",
    "perawi_melayu": "Abu al-Walid Musa bin Khalid, daripada Mu'tamir, daripada bapanya, daripada Hassan",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ مُوسَى بْنُ خَالِدٍ  ، حَدَّثَنَا مُعْتَمِرٌ  ، عَنْ أَبِيهِ  ، قَالَ : بَلَغَنِي عَنْ الْحَسَنِ  ، قَالَ :\" مَنْ قَرَأَ ( يس ) فِي لَيْلَةٍ، ابْتِغَاءَ وَجْهِ اللَّهِ أَوْ مَرْضَاةِ اللَّهِ، غُفِرَ لَهُ، وَقَالَ : بَلَغَنِي أَنَّهَا تَعْدِلُ الْقُرْآنَ كُلَّهُ \"",
    "malay_translation": "Abu al-Walid Musa bin Khalid meriwayatkan: Telah menceritakan kepada kami Mu'tamir, daripada bapanya, berkata: Telah sampai kepada saya daripada Hassan, beliau berkata: \"Sesiapa yang membaca Surah Yasin pada malam hari, kerana mengharapkan keredhaan Allah, nescaya diampunkan baginya. Dan beliau berkata: Telah sampai kepada saya bahawa ia menyamai seluruh al-Quran."
  },
  {
    "id": 40209,
    "hadith_number": 2672,
    "tajuk_hadith": "Surah Yasin Adalah Jantung Al-Quran",
    "perawi_melayu": "Anas (RA)",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سَعِيدٍ  ، حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ  ، عَنْ الْحَسَنِ بْنِ صَالِحٍ  ، عَنْ هَارُونَ أَبِي مُحَمَّدٍ  ، عَنْ مُقَاتِلِ بْنِ حَيَّانَ  ، عَنْ قَتَادَةَ  ، عَنْ أَنَسٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِنَّ لِكُلِّ شَيْءٍ قَلْبًا، وَإِنَّ قَلْبَ الْقُرْآنِ يس، مَنْ قَرَأَهَا فَكَأَنَّمَا قَرَأَ الْقُرْآنَ عَشْرَ مِرارٍ \"",
    "malay_translation": "Daripada Anas (RA), Rasulullah SAW bersabda: \"Sesungguhnya bagi setiap sesuatu itu ada jantungnya, dan jantung Al-Quran itu adalah surah Yasin. Sesiapa yang membacanya, seolah-olah dia membaca Al-Quran sepuluh kali.\""
  },
  {
    "id": 40210,
    "hadith_number": 2673,
    "tajuk_hadith": "Keutamaan Membaca Surah Ya-Sin di Malam Hari",
    "perawi_melayu": "Abu Hurairah رضي الله عنه",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْوَلِيدُ بْنُ شُجَاعٍ  ، حَدَّثَنِي أَبِي  ، حَدَّثَنِي زِيَادُ بْنُ خَيْثَمَةَ  ، عَنْ مُحَمَّدِ بْنِ جُحَادَةَ  ، عَنْ الْحَسَنِ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَنْ قَرَأَ يس فِي لَيْلَةٍ ابْتِغَاءَ وَجْهِ اللَّهِ، غُفِرَ لَهُ فِي تِلْكَ اللَّيْلَةِ \"",
    "malay_translation": "Daripada Abu Hurairah رضي الله عنه, beliau berkata: Rasulullah ﷺ bersabda: \"Sesiapa yang membaca Ya-Sin pada malam hari dengan mengharapkan keredhaan Allah, maka akan diampunkan dosanya pada malam itu.\""
  },
  {
    "id": 40211,
    "hadith_number": 2674,
    "tajuk_hadith": "Keutamaan Membaca Surah Yasin di Waktu Pagi",
    "perawi_melayu": "Al-Walid bin Syuja', dari bapanya, dari Ziyad bin Khaythamah, dari Muhammad bin Juhadah, dari 'Ata' bin Abi Rabah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْوَلِيدُ بْنُ شُجَاعٍ  ، حَدَّثَنِي أَبِي  ، حَدَّثَنِي زِيَادُ بْنُ خَيْثَمَةَ  ، عَنْ مُحَمَّدِ بْنِ جُحَادَةَ  ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ  ، قَالَ : بَلَغَنِي أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنْ قَرَأَ يس فِي صَدْرِ النَّهَارِ، قُضِيَتْ حَوَائِجُهُ \"",
    "malay_translation": "Diriwayatkan dari Al-Walid bin Syuja', dari bapanya, dari Ziyad bin Khaythamah, dari Muhammad bin Juhadah, dari 'Ata' bin Abi Rabah, dia berkata: Telah sampai kepadaku bahawa Rasulullah SAW bersabda: \"Sesiapa yang membaca Surah Yasin pada awal pagi, maka akan ditunaikan hajat-hajatnya.\""
  },
  {
    "id": 40212,
    "hadith_number": 2675,
    "tajuk_hadith": "Keutamaan Membaca Surah Yasin",
    "perawi_melayu": "Ibnu Abbas",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ زُرَارَةَ  ، حَدَّثَنَا عَبْدُ الْوَهَّابِ  ، حَدَّثَنَا رَاشِدٌ أَبُو مُحَمَّدٍ الْحِمَّانِيُّ  ، عَنْ شَهْرِ بْنِ حَوْشَبٍ  ، قَالَ : قَالَ ابْنُ عَبَّاسٍ   :\" مَنْ قَرَأَ ( يس ) حِينَ يُصْبِحُ، أُعْطِيَ يُسْرَ يَوْمِهِ حَتَّى يُمْسِيَ، وَمَنْ قَرَأَهَا فِي صَدْرِ لَيْلِهِ، أُعْطِيَ يُسْرَ لَيْلَتِهِ حَتَّى يُصْبِحَ \"",
    "malay_translation": "Daripada Ibnu Abbas, beliau berkata: \"Sesiapa yang membaca Surah Yasin pada waktu pagi, akan diberikan kemudahan sepanjang harinya sehingga petang. Dan sesiapa yang membacanya pada awal malam, akan diberikan kemudahan sepanjang malamnya sehingga pagi.\""
  },
  {
    "id": 40213,
    "hadith_number": 2676,
    "tajuk_hadith": "Keutamaan Membaca Surah Ad-Dukhan pada Malam Jumaat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْلَى ، حَدَّثَنَا إِسْمَاعِيل ،  عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى ، قَالَ : أُخْبِرْتُ أَنَّهُ\" مَنْ قَرَأَ ( حم ) الدُّخَانَ لَيْلَةَ الْجُمُعَةِ إِيمَانًا وَتَصْدِيقًا بِهَا، أَصْبَحَ مَغْفُورًا لَهُ \"",
    "malay_translation": "Diriwayatkan dari Ya'la, dari Ismail, dari Abdullah bin Isa, katanya: Aku telah dikhabarkan bahawa sesiapa yang membaca Surah Ad-Dukhan pada malam Jumaat dengan penuh iman dan percaya kepadanya, maka dia akan diampuni dosanya."
  },
  {
    "id": 40214,
    "hadith_number": 2677,
    "tajuk_hadith": "Ganjaran Membaca Surah Ad-Dukhan pada Malam Jumaat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ  ، حَدَّثَنَا صَدَقَةُ بْنُ خَالِدٍ  ، عَنْ يَحْيَى بْنِ الْحَارِثِ  ، عَنْ أَبِي رَافِعٍ  ، قَالَ :\" مَنْ قَرَأَ ( حم ) الدُّخَانَ فِي لَيْلَةِ الْجُمُعَةِ، أَصْبَحَ مَغْفُورًا لَهُ، وَزُوِّجَ مِنْ الْحُورِ الْعِينِ \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Al-Mubarak, telah menceritakan kepada kami Sadaqah bin Khalid, daripada Yahya bin Al-Harith, daripada Abu Rafi', beliau berkata: \"Sesiapa yang membaca surah Ad-Dukhan pada malam Jumaat, maka dia akan diampunkan (dosanya) pada waktu pagi, dan dikahwinkan dengan bidadari Al-Hur Al-'In (bidadari yang cantik jelita).\""
  },
  {
    "id": 40215,
    "hadith_number": 2678,
    "tajuk_hadith": "Surah Al-Hawaamim Disebut Sebagai 'Pengantin'",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ ، عَنْ مِسْعَرٍ ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ ، قَالَ :\" كُنَّ ! الْحَوَامِيمُ يُسَمَّيْنَ الْعَرَائِسَ \"",
    "malay_translation": "Telah meriwayatkan kepada kami Ja'far bin 'Aun, daripada Mis'ar, daripada Sa'ad bin Ibrahim, berkata: \"Surah-surah Al-Hawaamim (surah-surah yang bermula dengan ح م) dinamakan sebagai 'Al-'Ara'is' (Pengantin).\""
  },
  {
    "id": 40216,
    "hadith_number": 2679,
    "tajuk_hadith": "Ganjaran Membaca Tiga Ayat Terakhir Surah Al-Hashr",
    "perawi_melayu": "Diriwayatkan daripada Hasan",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ  ، عَنْ هِشَامٍ  ، عَنْ الْحَسَنِ  ، قَالَ :\" مَنْ قَرَأَ ثَلَاثَ آيَاتٍ مِنْ آخِرِ سُورَةِ الْحَشْرِ إِذَا أَصْبَحَ، فَمَاتَ مِنْ يَوْمِهِ ذَلِكَ، طُبِعَ بِطَابَعِ الشُّهَدَاءِ، وَإِنْ قَرَأَ إِذَا أَمْسَى، فَمَاتَ مِنْ لَيْلَتِهِ، طُبِعَ بِطَابَعِ الشُّهَدَاءِ \"",
    "malay_translation": "Daripada Hasan, beliau berkata: \"Sesiapa yang membaca tiga ayat terakhir daripada Surah Al-Hashr pada waktu pagi, kemudian meninggal dunia pada hari itu, maka dia akan dicatatkan sebagai syuhada. Dan jika dia membacanya pada waktu petang, kemudian meninggal dunia pada malamnya, maka dia juga akan dicatatkan sebagai syuhada.\""
  },
  {
    "id": 40217,
    "hadith_number": 2680,
    "tajuk_hadith": "Membaca Surah Al-Musabbihat Sebelum Tidur",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاق بْنُ عِيسَى  ، عَنْ مَعْنٍ  ، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ  ، عَنْ بَحِيرِ بْنِ سَعْدٍ  ، عَنْ خَالِدِ بْنِ مَعْدَانَ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : أَنَّهُ كَانَ \" يَقْرَأُ الْمُسَبِّحَاتِ عِنْدَ النَّوْمِ، وَيَقُولُ :\" إِنَّ فِيهِنَّ آيَةً تَعْدِلُ أَلْفَ آيَةٍ \"",
    "malay_translation": "Daripada Nabi Muhammad SAW, baginda membaca surah Al-Musabbihat (surah yang bermula dengan tasbih kepada Allah) sebelum tidur dan bersabda: \"Sesungguhnya padanya (surah-surah tersebut) terdapat satu ayat yang menyamai seribu ayat.\""
  },
  {
    "id": 40218,
    "hadith_number": 2681,
    "tajuk_hadith": "Keutamaan Membaca Ayat-ayat Terakhir Surah Al-Hasyr",
    "perawi_melayu": "Ma'qil bin Yasar (RA)",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْفَرَجِ الْبَغْدَادِيُّ  ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ  ، حَدَّثَنَا خَالِدُ بْنُ طَهْمَانَ أَبُو الْعَلَاءِ الْخَفَّافُ  ، حَدَّثَنِي نَافِعُ بْنُ أَبِي نَافِعٍ  ، عَنْ مَعْقِلِ بْنِ يَسَارٍ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنْ قَالَ حِينَ يُصْبِحُ : أَعُوذُ بِاللَّهِ السَّمِيعِ الْعَلِيمِ مِنْ الشَّيْطَانِ الرَّجِيمِ، وَثَلَاثَ آيَاتٍ مِنْ آخِرِ سُورَةِ الْحَشْرِ، وَكَّلَ اللَّهُ بِهِ سَبْعِينَ أَلْفَ مَلَكٍ يُصَلُّونَ عَلَيْهِ حَتَّى يُمْسِيَ، وَإِنْ قَالَهَا مَسَاءً، فَمِثْلُ ذَلِكَ حَتَّى يُصْبِحَ \"",
    "malay_translation": "Daripada Ma'qil bin Yasar (RA) daripada Nabi SAW, baginda bersabda: \"Sesiapa yang membaca ketika waktu pagi, 'Aku berlindung dengan Allah Yang Maha Mendengar lagi Maha Mengetahui daripada syaitan yang direjam', dan tiga ayat terakhir daripada Surah Al-Hasyr, Allah akan mewakilkan kepadanya tujuh puluh ribu malaikat yang berselawat ke atasnya sehingga petang. Jika dia membacanya pada waktu petang, maka (ganjarannya) seperti itu sehingga pagi.\""
  },
  {
    "id": 40219,
    "hadith_number": 2682,
    "tajuk_hadith": "Keutamaan Membaca Surah Al-Kafirun dan Al-Ikhlas",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو زَيْدٍ سَعِيدُ بْنُ الرَّبِيعِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ أَبِي الْحَسَنِ  مُهَاجِرٍ، قَالَ : \" جَاءَ رَجُل   زَمَنَ زِيَادٍ إِلَى الْكُوفَةِ ، فَسَمِعْتُهُ يُحَدِّثُ أَنَّهُ كَانَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَسِيرٍ لَهُ، قَالَ : وَرُكْبَتِي تُصِيبُ أَوْ تَمَسُّ رُكْبَتَهُ، فَسَمِعَ رَجُلًا يَقْرَأُ : قُلْ يَا أَيُّهَا الْكَافِرُونَ ، قَالَ :\" بَرِئَ مِنَ الشِّرْكِ \"، وَسَمِعَ رَجُلًا يَقْرَأُ : قُلْ هُوَ اللَّهُ أَحَدٌ ، قَالَ : غُفِرَ لَهُ \"",
    "malay_translation": "Daripada Abu Zaid Sa'id bin Ar-Rabi', daripada Syu'bah, daripada Abu Al-Hasan Muhajir, berkata: \"Seorang lelaki datang ke Kufah pada zaman Ziyad, dan aku mendengar dia bercerita bahawa dia pernah bersama Rasulullah SAW dalam satu perjalanan. Berkata dia: 'Lututku menyentuh atau terkena lutut baginda.' Lalu baginda mendengar seseorang membaca: 'Qul yaa ayyuhal kafirun.' Baginda bersabda: 'Terlepas daripada syirik.' Dan baginda mendengar seseorang membaca: 'Qul huwallahu ahad.' Baginda bersabda: 'Diampuni dosanya.'"
  },
  {
    "id": 40220,
    "hadith_number": 2683,
    "tajuk_hadith": "Amalan Sebelum Tidur: Membaca Surah Al-Kafirun",
    "perawi_melayu": "Faruwah bin Naufal daripada ayahnya",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا زُهَيْرٌ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ فَرْوَةَ بْنِ نَوْفَلٍ  ، عَنْ أَبِيهِ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ : \" مَجِيءٌ مَا جَاءَ بِكَ \"، قَالَ : جِئْتُ لِتُعَلِّمَنِي شَيْئًا أَقُولُهُ عِنْدَ مَنَامِي، قَالَ :\" فَإِذَا أَخَذْتَ مَضْجَعَكَ، فَاقْرَأْ : قُلْ يَا أَيُّهَا الْكَافِرُونَ ، ثُمَّ نَمْ عَلَى خَاتِمَتِهَا، فَإِنَّهَا بَرَاءَةٌ مِنْ الشِّرْكِ \"",
    "malay_translation": "Abu Nu'aim telah menceritakan kepada kami, telah menceritakan kepada kami Zuhair, daripada Abu Ishaq, daripada Farwah bin Naufal, daripada ayahnya: Bahawa Rasulullah SAW bersabda: \"Apakah yang membawamu kemari?\" Dia menjawab: \"Saya datang untuk diajar sesuatu yang saya ucapkan ketika hendak tidur.\" Baginda bersabda: \"Apabila kamu hendak tidur, bacalah Surah Al-Kafirun, kemudian tidurlah setelah selesai membacanya. Sesungguhnya surah itu (membaca dan mengamalkannya) adalah terlepas daripada syirik.\""
  },
  {
    "id": 40221,
    "hadith_number": 2684,
    "tajuk_hadith": "Surah Al-Ikhlas adalah Sepertiga Al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْمُغِيرَةِ ، حَدَّثَنَا صَفْوَانُ ، حَدَّثَنَا إِيَاسٌ الْبِكَالِيُّ ، عَنْ نَوْفٍ الْبِكَالِيِّ ، قَالَ :\" إِنَّ اللَّهَ جَزَّأَ الْقُرْآنَ عَلَى ثَلَاثَةِ أَجْزَاءٍ، فَجَعَلَ ( قُلْ هُوَ اللَّهُ أَحَدٌ ) ثُلُثَ الْقُرْآنِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Al-Mughirah, telah menceritakan kepada kami Safwan, telah menceritakan kepada kami Iyas Al-Bikali dari Nauf Al-Bikali, dia berkata: \"Sesungguhnya Allah membahagikan Al-Quran kepada tiga bahagian, lalu Dia menjadikan (Qul Huwa Allahu Ahad) adalah sepertiga Al-Quran.\""
  },
  {
    "id": 40222,
    "hadith_number": 2685,
    "tajuk_hadith": "Ganjaran Membaca Surah Al-Ikhlas",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ  ، حَدَّثَنَا حَيْوَةُ  ، قَالَ : أَخْبَرَنِي أَبُو عَقِيلٍ  ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيِّبِ  ، يَقُولُ : إِنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَال :\" مَنْ قَرَأَ قُلْ هُوَ اللَّهُ أَحَدٌ عَشْرَ مَرَّاتٍ، بُنِيَ لَهُ بِهَا قَصْرٌ فِي الْجَنَّةِ، وَمَنْ قَرَأَ عِشْرِينَ مَرَّةً، بُنِيَ لَهُ بِهَا قَصْرَانِ فِي الْجَنَّةِ، وَمَنْ قَرَأَهَا ثَلَاثِينَ مَرَّةً، بُنِيَ لَهُ بِهَا ثَلَاثَةُ قُصُورٍ فِي الْجَنَّةِ \"، فَقَالَ عُمَرُ بْنُ الْخَطَّابِ : وَاللَّهِ يَا رَسُولَ اللَّهِ، إِذَنْ لَتَكَّثُرَنَّ قُصُورُنَا، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" اللَّهُ أَوْسَعُ مِنْ ذَلِكَ \".\nقَالَ أَبُو مُحَمَّد : أَبُو عَقِيلٍ زُهْرَةُ بْنُ مَعْبَدٍ، وَزَعَمُوا أَنَّهُ كَانَ مِنْ الْأَبْدَالِ",
    "malay_translation": "Daripada (tiada perawi dinyatakan), bahawa Nabi Muhammad SAW bersabda: \"Sesiapa yang membaca Surah Al-Ikhlas (Qul Huwa Allahu Ahad) sepuluh kali, maka akan dibina untuknya sebuah istana di syurga. Sesiapa yang membacanya dua puluh kali, akan dibina untuknya dua buah istana di syurga. Dan sesiapa yang membacanya tiga puluh kali, akan dibina untuknya tiga buah istana di syurga.\" Umar bin Al-Khattab berkata: \"Demi Allah, wahai Rasulullah, jika demikian, pasti akan banyaklah istana kita.\" Rasulullah SAW bersabda: \"Allah Maha Luas (rahmat-Nya).\" Abu Muhammad berkata: Abu Aqil ialah Zuhrah bin Ma'bad, dan mereka mendakwa bahawa beliau adalah daripada golongan Al-Abdal."
  },
  {
    "id": 40223,
    "hadith_number": 2686,
    "tajuk_hadith": "Membaca Surah Selepas Menyelesaikannya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْمُغِيرَةِ ، عَنْ عُتْبَةَ بْنِ ضَمْرَةَ بْنِ حَبِيبٍ ، عَنْ أَبِيهِ  : أَنَّهُ كَانَ\" إِذَا قَرَأَ سُورَةً فَخَتَمَهَا، أَتْبَعَهَا بِ : قُلْ هُوَ اللَّهُ أَحَدٌ \"",
    "malay_translation": "Diriwayatkan daripada Abu Al-Mughirah, daripada 'Utbah bin Damrah bin Habib, daripada bapanya: Bahawa dia (apabila) membaca sesuatu surah dan menyelesaikannya, dia mengikutinya dengan: Qul Huwa Allahu Ahad (Surah Al-Ikhlas)."
  },
  {
    "id": 40224,
    "hadith_number": 2687,
    "tajuk_hadith": "Keutamaan Membaca Surah Al-Ikhlas",
    "perawi_melayu": "Abu Darda' (رضي الله عنه)",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ  ، عَنْ أَبَانَ بْنِ يَزِيدَ الْعَطَّارِ  ، حَدَّثَنَا قَتَادَةُ  ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ  ، عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ  ،  عَنْ أَبِي الدَّرْدَاءِ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" أَيَعْجِزُ أَحَدُكُمْ أَنْ يَقْرَأَ فِي لَيْلَةٍ ثُلُثَ الْقُرْآنِ؟ قَالُوا : نَحْنُ أَعْجَزُ وَأَضْعَفُ مِنْ ذَلِكَ، فَقَالَ : إِنَّ اللَّهَ جَزَّأَ الْقُرْآنَ ثَلَاثَةَ أَجْزَاءٍ، فَجَعَلَ قُلْ هُوَ اللَّهُ أَحَدٌ ثُلُثَ الْقُرْآنِ \"",
    "malay_translation": "Muslim bin Ibrahim meriwayatkan daripada Aban bin Yazid al-'Attar, daripada Qatadah, daripada Salim bin Abi al-Ja'd, daripada Ma'dan bin Abi Talhah, daripada Abu Darda' (رضي الله عنه), berkata: Rasulullah ﷺ bersabda: \"Adakah salah seorang daripada kamu tidak mampu untuk membaca sepertiga al-Quran dalam satu malam?\" Mereka menjawab: \"Kami tidak mampu dan terlalu lemah untuk melakukan itu.\" Baginda bersabda: \"Sesungguhnya Allah telah membahagikan al-Quran kepada tiga bahagian, dan menjadikan Qul Huwa Allahu Ahad (Surah Al-Ikhlas) itu sepertiga daripada al-Quran.\""
  },
  {
    "id": 40225,
    "hadith_number": 2688,
    "tajuk_hadith": "Surah Al-Ikhlas Setara dengan Sepertiga Al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، عَنْ إِبْرَاهِيمَ بْنِ إِسْمَاعِيل بْنِ مُجَمِّعٍ  ، قَالَ : أَخْبَرَنِي ابْنُ شِهَابٍ  : أَنَّ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ  حَدَّثَهُ، أَنَّ أَبَا هُرَيْرَةَ   كَانَ يَقُولُ :( قُلْ هُوَ اللَّهُ أَحَدٌ ) تَعْدِلُ ثُلُثَ الْقُرْآنِ \"",
    "malay_translation": "Abu Nu'aim meriwayatkan daripada Ibrahim bin Ismail bin Mujammi', beliau berkata: Ibnu Syihab telah mengkhabarkan kepadaku, bahawa Humaid bin Abdur Rahman telah meriwayatkan kepadanya, bahawa Abu Hurairah pernah berkata: \"(Qul Huwa Allahu Ahad) menyamai sepertiga Al-Quran\""
  },
  {
    "id": 40226,
    "hadith_number": 2689,
    "tajuk_hadith": "Surah Al-Ikhlas Menyamai Sepertiga Al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْمُعَلَّى بْنُ أَسَدٍ  ، عَنْ سَلَّامِ بْنِ أَبِي مُطِيعٍ  ، عَنْ عَاصِمٍ  ، عَنْ زِرٍّ  ، عَنْ عَبْدِ اللَّهِ  ، قَالَ :\" ( قُلْ هُوَ اللَّهُ أَحَدٌ ) تَعْدِلُ ثُلُثَ الْقُرْآنِ :، حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ  ، عَنْ حَمَّادِ بْنِ سَلَمَةَ  ، عَنْ عَاصِمٍ  ، عَنْ زِرٍّ  ، عَنْ عَبْدِ اللَّهِ  ، مِثْلَهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Al-Mu'alla bin Asad, daripada Sallam bin Abi Muti', daripada 'Asim, daripada Zirr, daripada 'Abdullah, beliau berkata: \"(Qul Huwa Allahu Ahad) menyamai sepertiga Al-Quran.\" Diriwayatkan kepada kami oleh 'Amru bin 'Asim, daripada Hammad bin Salamah, daripada 'Asim, daripada Zirr, daripada 'Abdullah, seperti itu."
  },
  {
    "id": 40227,
    "hadith_number": 2690,
    "tajuk_hadith": "Kecintaan Terhadap Surah Al-Ikhlas Membawa ke Syurga",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ  ، أَنْبَأَنَا مُبَارَكُ بْنُ فَضَالَةَ  ، حَدَّثَنَا ثَابِتٌ  ، عَنْ أَنَسٍ   : أَنَّ رَجُلًا، قَالَ : وَاللَّهِ إِنِّي لَأُحِبُّ هَذِهِ السُّورَةَ : ( قُلْ هُوَ اللَّهُ أَحَدٌ ) ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" حُبُّكَ إِيَّاهَا أَدْخَلَكَ الْجَنَّةَ \"",
    "malay_translation": "Diriwayatkan daripada Anas r.a., seorang lelaki berkata: \"Demi Allah, sesungguhnya aku mencintai surah ini (Qul Huwallahu Ahad)\". Maka Rasulullah s.a.w. bersabda: \"Kecintaanmu terhadapnya akan memasukkanmu ke dalam syurga.\""
  },
  {
    "id": 40228,
    "hadith_number": 2691,
    "tajuk_hadith": "Surah Al-Ikhlas, Sepertiga Al-Quran",
    "perawi_melayu": "Diriwayatkan oleh Umm (tidak dinyatakan nama)",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ  ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ مُسْلِمٍ  ، عَنْ مُحَمَّدِ بْنِ شِهَابٍ  ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ  ، عَنْ أُمِّهِ   : أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ قُلْ هُوَ اللَّهُ أَحَدٌ ، فَقَالَ :\" ثُلُثُ الْقُرْآنِ، أَوْ تَعْدِلُهُ \"",
    "malay_translation": "Daripada Umm (tidak dinyatakan nama), bahawa Rasulullah SAW ditanya tentang Surah Al-Ikhlas (Qul Huwa Allahu Ahad), lalu Baginda bersabda: \"(Surah ini) adalah sepertiga Al-Quran, atau menyamai (pahala)nya.\""
  },
  {
    "id": 40229,
    "hadith_number": 2692,
    "tajuk_hadith": "Keutamaan Membaca Surah Al-Ikhlas",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، عَنْ إِسْرَائِيلَ  ، عَنْ مَنْصُورٍ  ، عَنْ هِلَالٍ  ، عَنْ الرَّبِيعِ بْنِ خُثَيْمٍ  ، عَنْ عَمْرِو بْنِ مَيْمُونٍ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى  ، عَنْ امْرَأَةٍ  مِنْ الْأَنْصَارِ، عَنْ أَبِي أَيُّوبَ  ، قَالَ : أَتَاهَا فَقَالَ : أَلَا تَرَيْنَ إِلَى مَا جَاءَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَتْ : رُبَّ خَيْرٍ قَدْ أَتَانَا بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَمَا هُوَ؟ قَالَ : قَالَ لَنَا :\" أَيَعْجِزُ أَحَدُكُمْ أَنْ يَقْرَأَ ثُلُثَ الْقُرْآنِ فِي لَيْلَةٍ \"؟ قَالَ : فَأَشْفَقْنَا أَنْ يُرِيدَنَا عَلَى أَمْرٍ نَعْجِزُ عَنْهُ، فَلَمْ نَرْجِعْ إِلَيْهِ شَيْئًا حَتَّى قَالَهَا ثَلَاثَ مَرَّاتٍ، ثُمَّ قَالَ : \" أَمَا يَسْتَطِيعُ أَحَدُكُمْ أَنْ يَقْرَأَ ( قُلْ هُوَ اللَّهُ أَحَد، اللَّهُ الصَّمَدُ )؟ \"",
    "malay_translation": "Diriwayatkan daripada Abu Ayyub bahawa Rasulullah SAW bersabda, \"Adakah salah seorang daripada kamu tidak mampu membaca sepertiga daripada Al-Quran dalam satu malam?\" Sahabat merasa keberatan kerana bimbang jika Baginda meminta sesuatu yang mereka tidak mampu. Kemudian Baginda bersabda sebanyak tiga kali, \"Tidakkah salah seorang daripada kamu mampu membaca (Qul Huwa Allahu Ahad, Allahu Somad)?\""
  },
  {
    "id": 40230,
    "hadith_number": 2693,
    "tajuk_hadith": "Ganjaran Membaca Surah Al-Ikhlas Lima Puluh Kali",
    "perawi_melayu": "Ummu Kathir al-Ansariyyah, daripada Anas bin Malik",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ  ، عَنْ نُوحِ بْنِ قَيْسٍ  ، عَنْ مُحَمَّدٍ أَبِي رَجَاءٍ  ، عَنْ أُمِّ كَثِيرٍ الْأَنْصَارِيَّةِ  ، عَنْ أَنَسِ بْنِ مَالِكٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَنْ قَرَأَ قُلْ هُوَ اللَّهُ أَحَدٌ خَمْسِينَ مَرَّةً، غَفَرَ اللَّهُ لَهُ ذُنُوبَ خَمْسِينَ سَنَةً \"",
    "malay_translation": "Daripada Anas bin Malik, berkata: Rasulullah SAW bersabda: \"Sesiapa yang membaca 'Qul Huwa Allahu Ahad' sebanyak lima puluh kali, Allah akan mengampuni dosa-dosanya selama lima puluh tahun.\""
  },
  {
    "id": 40231,
    "hadith_number": 2694,
    "tajuk_hadith": "Keutamaan Surah al-Falaq",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ  ، حَدَّثَنَا حَيْوَةُ  ، وَابْنُ لَهِيعَةَ  ، قَالا : سَمِعْنَا يَزِيدَ بْنَ أَبِي حَبِيبٍ  ، يَقُولُ : حَدَّثَنِي أَبُو عِمْرَانَ  ، أَنَّهُ سَمِعَ عُقْبَةَ بْنَ عَامِرٍ  ، يَقُولُ : تَعَلَّقْتُ بِقَدَمِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقُلْتُ لَهُ : يَا رَسُولَ اللَّهِ، أَقْرِئْنِي سُورَةَ هُود ، وَسُورَةَ يُوسُفَ ، فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" يَا عُقْبَةُ،إِنَّكَ لَنْ تَقْرَأَ مِنْ الْقُرْآنِ سُورَةً أَحَبَّ إِلَى اللَّهِ وَلَا أَبْلَغَ عِنْدَهُ مِن قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ \"، قَالَ يَزِيدُ : فَلَمْ يَكُنْ أَبُو عِمْرَانَ يَدَعُهَا، كَانَ لَا يَزَالُ يَقْرَؤُهَا فِي صَلَاةِ الْمَغْرِبِ",
    "malay_translation": "Daripada 'Uqbah bin 'Amir, dia berkata: Aku bergantungan pada kaki Rasulullah ﷺ lalu aku berkata kepada baginda: \"Wahai Rasulullah, ajarkanlah aku Surah Hud dan Surah Yusuf\". Maka Rasulullah ﷺ bersabda kepadaku: \"Wahai 'Uqbah, sesungguhnya engkau tidak akan membaca daripada al-Quran satu surah yang lebih dicintai Allah dan lebih memberi kesan kepada-Nya daripada 'Qul a'uzu birabbil-falaq' (Surah al-Falaq)\". Yazid berkata: Maka Abu 'Imran tidak meninggalkannya, sentiasa membacanya dalam solat Maghrib."
  },
  {
    "id": 40232,
    "hadith_number": 2695,
    "tajuk_hadith": "Keutamaan Membaca Surah Al-Falaq",
    "perawi_melayu": "Uqbah bin Amir",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا لَيْثٌ  ، عَنْ ابْنِ عَجْلَانَ  ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ  ، أَنَّ عُقْبَةَ بْنَ عَامِرٍ  ، قَالَ : \" مَشَيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ لِي : \" قُلْ يَا عُقْبَةُ \"، فَقُلْتُ : أَيَّ شَيْءٍ أَقُولُ؟ قَالَ : فَسَكَتَ عَنِّي، ثُمَّ قَالَ : \" يَا عُقْبَةُ : قُلْ، فَقُلْتُ : أَيَّ شَيْءٍ أَقُولُ؟ قَالَ :\" قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ، فَقَرَأْتُهَا حَتَّى جِئْتُ عَلَى آخِرِهَا، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ ذَلِكَ : \" مَا سَأَلَ سَائِلٌ، وَلَا اسْتَعَاذَ مُسْتَعِيذٌ بِمِثْلِهَا \"",
    "malay_translation": "Diriwayatkan daripada Uqbah bin Amir, beliau berkata: \"Aku berjalan bersama Nabi SAW, lalu Baginda bersabda kepadaku: 'Wahai Uqbah, katakanlah!' Aku bertanya: 'Apakah yang harus aku katakan?' Baginda terdiam, kemudian bersabda: 'Wahai Uqbah, katakanlah!' Aku bertanya lagi: 'Apakah yang harus aku katakan?' Baginda bersabda: 'Katakanlah, 'Aku berlindung kepada Tuhan yang menguasai subuh'. Lalu aku membacanya sehingga selesai. Rasulullah SAW bersabda ketika itu: 'Tiada seorang yang memohon, dan tiada seorang yang memohon perlindungan dengan sesuatu yang seperti itu'."
  },
  {
    "id": 40233,
    "hadith_number": 2696,
    "tajuk_hadith": "Keutamaan Surah Al-Mu'awwidzatain",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْلَى  ، حَدَّثَنَا إِسْمَاعِيل هُوَ ابْنُ أَبِي خَالِدٍ  ، عَنْ قَيْسٍ  ، عَنْ عُقْبَةَ بْنِ عَامِرٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَقَدْ أُنْزِلَ عَلَيَّ آيَاتٌ لَمْ أَرَ أَوْ لَمْ يُرَ مِثْلَهُنَّ، يَعْنِي : الْمُعَوِّذَتَيْنِ \"",
    "malay_translation": "Daripada 'Uqbah bin 'Amir, beliau berkata: Rasulullah SAW bersabda: \"Sesungguhnya telah diturunkan kepadaku ayat-ayat yang aku tidak pernah melihat atau tidak pernah dilihat sepertinya, iaitu Al-Mu'awwidzatain (Surah Al-Falaq dan An-Nas).\""
  },
  {
    "id": 40234,
    "hadith_number": 2697,
    "tajuk_hadith": "Keutamaan Membaca Sepuluh Ayat Al-Quran di Malam Hari",
    "perawi_melayu": "Tamim ad-Dari",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بِسْطَامَ  ، عَنْ يَحْيَى بْنِ حَمْزَةَ  ، حَدَّثَنِي يَحْيَى بْنُ الْحَارِثِ  ، عَنْ الْقَاسِمِ أَبِي عَبْدِ الرَّحْمَنِ  ، عَنْ تَمِيمٍ الدَّارِيِّ  .\nح وَحَدَّثَنِي عُثْمَانُ بْنُ مُسْلِمٍ  ، عَنْ الْعَبَّاسِ بْنِ مَيْمُونٍ  ، عَنْ تَمِيمٍ الدَّارِيِّ  ، قَالَ :\" مَنْ قَرَأَ عَشْرَ آيَاتٍ فِي لَيْلَةٍ، لَمْ يُكْتَبْ مِنْ الْغَافِلِينَ \"",
    "malay_translation": "Daripada Tamim ad-Dari, beliau berkata: \"Sesiapa yang membaca sepuluh ayat (dari al-Quran) pada waktu malam, tidak akan dicatat sebagai orang yang lalai.\""
  },
  {
    "id": 40235,
    "hadith_number": 2698,
    "tajuk_hadith": "Ganjaran Membaca Sepuluh Ayat Al-Quran di Malam Hari",
    "perawi_melayu": "Tamim ad-Dari dan Fadalah bin Ubaid",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بِسْطَامَ  ، عَنْ يَحْيَى بْنِ حَمْزَةَ  ، حَدَّثَنِي يَحْيَى بْنُ الْحَارِثِ  ، عَنْ الْقَاسِمِ أَبِي عَبْدِ الرَّحْمَنِ  ، عَنْ تَمِيمٍ الدَّارِيِّ  ، وَفَضَالَةَ بْنِ عُبَيْدٍ   ، قَالَا :\" مَنْ قَرَأَ بِعَشْرِ آيَاتٍ فِي لَيْلَةٍ، كُتِبَ مِنْ الْمُصَلِّينَ \"",
    "malay_translation": "Daripada Tamim ad-Dari dan Fadalah bin Ubaid, mereka berkata: \"Sesiapa yang membaca sepuluh ayat (Al-Quran) pada malam hari, dia akan dicatat sebagai orang yang mendirikan solat.\""
  },
  {
    "id": 40236,
    "hadith_number": 2699,
    "tajuk_hadith": "Keistimewaan Membaca Sepuluh Ayat Al-Quran di Malam Hari",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيل بْنُ أَبَانَ  ، حَدَّثَنَا أَبُو أُوَيْسٍ  ، عَنْ مُوسَى بْنِ عُقْبَةَ  ، عَنْ مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ  ، عَنْ ابْنِ عُمَرَ  ، قَالَ :\" مَنْ قَرَأَ فِي لَيْلَةٍ بِعَشْرِ آيَاتٍ، لَمْ يُكْتَبْ مِنْ الْغَافِلِينَ \"",
    "malay_translation": "Daripada Ibnu Umar, beliau berkata: \"Sesiapa yang membaca sepuluh ayat (al-Quran) pada waktu malam, nescaya tidak akan ditulis sebagai golongan yang lalai.\""
  },
  {
    "id": 40237,
    "hadith_number": 2700,
    "tajuk_hadith": "Keutamaan Membaca Sepuluh Ayat Al-Quran di Malam Hari",
    "perawi_melayu": "Ibn Umar (R.A.)",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ  ، حَدَّثَنَا إِسْرَائِيلُ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ الْمُغِيرَةِ بْنِ عَبْدِ اللَّهِ الْجَدَلِيِّ  ، عَنْ ابْنِ عُمَرَ  ، قَالَ :\" مَنْ قَرَأَ فِي لَيْلَةٍ بِعَشْرِ آيَاتٍ، لَمْ يُكْتَبْ مِنْ الْغَافِلِينَ \"",
    "malay_translation": "Daripada Ibn Umar (R.A.), beliau berkata: \"Sesiapa yang membaca sepuluh ayat (daripada Al-Quran) pada waktu malam, maka dia tidak akan dicatatkan daripada golongan yang lalai.\""
  },
  {
    "id": 40238,
    "hadith_number": 2701,
    "tajuk_hadith": "Ganjaran Membaca Lima Puluh Ayat Al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا فِطْرٌ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ أَبِي الْأَحْوَصِ  ،  عَنْ عَبْدِ اللَّهِ  ، قَالَ :\" مَنْ قَرَأَ فِي لَيْلَةٍ بِخَمْسِينَ آيَةً، لَمْ يُكْتَبْ مِنْ الْغَافِلِينَ \"",
    "malay_translation": "Daripada Abdullah, (diriwayatkan) bahawa sesiapa yang membaca lima puluh ayat (al-Quran) pada waktu malam, maka dia tidak akan dicatat sebagai golongan yang lalai."
  },
  {
    "id": 40239,
    "hadith_number": 2702,
    "tajuk_hadith": "Ganjaran Membaca 50 Ayat Al-Quran pada Malam Hari",
    "perawi_melayu": "Tamim Ad-Dari dan Fadalah bin Ubaid",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بِسْطَامَ  ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ  ، عَنْ يَحْيَى بْنِ الْحَارِثِ  ، عَنْ الْقَاسِمِ أَبِي عَبْدِ الرَّحْمَنِ  ، عَنْ تَمِيمٍ الدَّارِيِّ  ، وَفَضَالَةَ بْنِ عُبَيْدٍ   ، قَالَا :\" مَنْ قَرَأَ بِخَمْسِينَ آيَةً فِي لَيْلَةٍ، كُتِبَ مِنْ الْحَافِظِينَ \"",
    "malay_translation": "Daripada Tamim Ad-Dari dan Fadalah bin Ubaid, mereka berkata: \"Sesiapa yang membaca lima puluh ayat (Al-Quran) pada suatu malam, dia akan dicatat sebagai orang yang menjaga (Al-Quran).\""
  },
  {
    "id": 40240,
    "hadith_number": 2703,
    "tajuk_hadith": "Ganjaran Membaca Seratus Ayat di Malam Hari",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْقَاسِمِ  ، حَدَّثَنَا مُوسَى بْنُ عُبَيْدَةَ  ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ  ، عَنْ يُحَنَّسَ  مَوْلَى الزُّبَيْرِ، عَنْ سَالِمٍ  أَخِي أُمِّ الدَّرْدَاءِ فِي اللَّهِ، عَنْ أُمِّ الدَّرْدَاءِ  ، عَنْ أَبِي الدَّرْدَاءِ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنْ قَرَأَ بِمِائَةِ آيَةٍ فِي لَيْلَةٍ، لَمْ يُكْتَبْ مِنْ الْغَافِلِينَ \".\nقَالَ أَبُو مُحَمَّد : مِنْهُمْ مَنْ يَقُولُ مَكَانَ سَالِمٍ : رَاشِدُ بْنُ سَعْدٍ",
    "malay_translation": "Daripada Abu Darda' RA, daripada Nabi Muhammad SAW, baginda bersabda: \"Sesiapa yang membaca seratus ayat pada waktu malam, maka dia tidak akan dicatat daripada golongan yang lalai.\" Abu Muhammad berkata: Sesetengah mereka meriwayatkan daripada Rashid bin Saad, bukan daripada Salim."
  },
  {
    "id": 40241,
    "hadith_number": 2704,
    "tajuk_hadith": "Ganjaran Membaca Seratus Ayat dalam Satu Malam",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيل بْنُ أَبَانَ  ، حَدَّثَنَا أَبُو أُوَيْسٍ  ، عَنْ مُوسَى بْنِ عُقْبَةَ  ، عَنْ مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ  ، عَنْ ابْنِ عُمَرَ  ، قَالَ :\" مَنْ قَرَأَ فِي لَيْلَةٍ بِمِائَةِ آيَةٍ، كُتِبَ مِنْ الْقَانِتِينَ \"",
    "malay_translation": "Daripada Ibnu Umar, beliau berkata: \"Sesiapa yang membaca seratus ayat dalam satu malam, maka dia akan dicatat sebagai orang yang beribadat (kepada Allah).\""
  },
  {
    "id": 40242,
    "hadith_number": 2705,
    "tajuk_hadith": "Ganjaran Membaca Seratus Ayat pada Malam Hari",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بِسْطَامَ  ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ  ، حَدَّثَنِي زَيْدُ بْنُ وَاقِدٍ  ، عَنْ سُلَيْمَانَ بْنِ مُوسَى  ، عَنْ كَثِيرِ بْنِ مُرَّةَ  ، عَنْ تَمِيمٍ الدَّارِيِّ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنْ قَرَأَ بِمِائَةِ آيَةٍ فِي لَيْلَةٍ، كُتِبَ لَهُ قُنُوتُ لَيْلَةٍ \"",
    "malay_translation": "Daripada Tamim Ad-Dari, bahawa Rasulullah SAW bersabda: \"Sesiapa yang membaca seratus ayat pada malam hari, akan dicatatkan baginya (pahala) qunut pada malam itu.\""
  },
  {
    "id": 40243,
    "hadith_number": 2706,
    "tajuk_hadith": "Ganjaran Membaca Seratus Ayat",
    "perawi_melayu": "Kaa'b",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ ، عَنْ الْأَعْمَشِ ، عَنْ أَبِي صَالِحٍ ، قَالَ : قَالَ كَعْبٌ  :\" مَنْ قَرَأَ مِائَةَ آيَةٍ، كُتِبَ مِنْ الْقَانِتِينَ \"",
    "malay_translation": "Daripada Kaa'b, beliau berkata: \"Sesiapa yang membaca seratus ayat (dari Al-Quran), dia akan dicatat sebagai daripada orang-orang yang taat (kepada Allah).\""
  },
  {
    "id": 40244,
    "hadith_number": 2707,
    "tajuk_hadith": "Ganjaran Membaca Seratus Ayat Al-Quran di Malam Hari",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بِسْطَامَ  ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ  ، حَدَّثَنِي يَحْيَى بْنُ الْحَارِثِ  ، عَنْ الْقَاسِمِ أَبِي عَبْدِ الرَّحْمَنِ  ، عَنْ تَمِيمٍ الدَّارِيِّ  ، وَفَضَالَةَ بْنِ عُبَيْدٍ   ، قَالَا :\" مَنْ قَرَأَ بِمِائَةِ آيَةٍ فِي لَيْلَةٍ، كُتِبَ مِنْ الْقَانِتِينَ \"",
    "malay_translation": "Daripada Tamim ad-Dari dan Fadalah bin Ubaid, mereka berkata: \"Sesiapa yang membaca seratus ayat pada waktu malam, dia akan ditulis sebagai golongan orang yang sentiasa beribadah (qanitin).\""
  },
  {
    "id": 40245,
    "hadith_number": 2708,
    "tajuk_hadith": "Ganjaran Membaca Seratus Ayat dalam Satu Malam",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا فِطْرٌ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ أَبِي الْأَحْوَصِ  ، عَنْ عَبْدِ اللَّهِ  ، قَالَ :\" مَنْ قَرَأَ فِي لَيْلَةٍ بِمِائَةِ آيَةٍ، كُتِبَ مِنْ الْقَانِتِينَ \"",
    "malay_translation": "Abu Nu'aym meriwayatkan kepada kami, Fitr meriwayatkan kepada kami, daripada Abu Ishaq, daripada Abu al-Ahwas, daripada Abdullah, beliau berkata: \"Sesiapa yang membaca seratus ayat pada suatu malam, maka dia dicatat sebagai orang yang taat (kepada Allah).\""
  },
  {
    "id": 40246,
    "hadith_number": 2709,
    "tajuk_hadith": "Ganjaran Membaca Seratus Ayat Al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ  ، أَنْبَأَنَا حَرِيزُ بْنُ عُثْمَانَ  ، عَنْ حَبِيبِ بْنِ عُبَيْدٍ  ، قَالَ : سَمِعْتُ أَبَا أُمَامَةَ  ، يَقُولُ :\" مَنْ قَرَأَ بِمِائَةِ آيَةٍ، لَمْ يُكْتَبْ مِنْ الْغَافِلِينَ \"",
    "malay_translation": "Diriwayatkan daripada al-Hakam bin Nafi', telah menceritakan kepada kami Hariz bin Uthman, daripada Habib bin Ubaid, dia berkata: Aku mendengar Abu Umamah berkata: \"Sesiapa yang membaca seratus ayat (Al-Quran), tidak akan ditulis daripada kalangan orang yang lalai.\""
  },
  {
    "id": 40247,
    "hadith_number": 2710,
    "tajuk_hadith": "Ganjaran Membaca Dua Ratus Ayat",
    "perawi_melayu": "Abu Umamah (Semoga Allah merahmatinya)",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ  ، أَخْبَرَنَا حَرِيزٌ  ، عَنْ حَبِيبِ بْنِ عُبَيْدٍ  ، قَالَ : سَمِعْتُ أَبَا أُمَامَةَ  ، يَقُولُ :\" مَنْ قَرَأَ مِائَتَيْ آيَةٍ، كُتِبَ مِنْ الْقَانِتِينَ \"",
    "malay_translation": "Diriwayatkan daripada Abu Umamah (semoga Allah merahmatinya), beliau berkata: \"Sesiapa yang membaca dua ratus ayat (al-Quran), akan dituliskan (namanya) dalam kalangan orang-orang yang taat (kepada Allah).\""
  },
  {
    "id": 40248,
    "hadith_number": 2711,
    "tajuk_hadith": "Ganjaran Membaca 200 Ayat dalam Satu Malam",
    "perawi_melayu": "Umm ad-Dardaa",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْقَاسِمِ  ، حَدَّثَنَا مُوسَى بْنُ عُبَيْدَةَ  ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ  ، عَنْ يُحَنَّسَ  مَوْلَى الزُّبَيْرِ، عَنْ سَالِمٍ  أَخِي أُمِّ الدَّرْدَاءِ فِي اللَّهِ، عَنْ أُمِّ الدَّرْدَاءِ  ، عَنْ أَبِي الدَّرْدَاءِ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنْ قَرَأَ مِائَتَيْ آيَةٍ فِي لَيْلَةٍ، كُتِبَ مِنْ الْقَانِتِينَ \"",
    "malay_translation": "Daripada Abu ad-Darda', daripada Nabi SAW bersabda: \"Barangsiapa membaca dua ratus ayat dalam satu malam, maka dia akan ditulis termasuk dalam kalangan orang-orang yang taat (kepada Allah).\""
  },
  {
    "id": 40249,
    "hadith_number": 2712,
    "tajuk_hadith": "Keutamaan Membaca Ayat-Ayat Al-Quran",
    "perawi_melayu": "Ibnu Umar رضي الله عنه",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو غَسَّانَ  ، حَدَّثَنَا إِسْرَائِيلُ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ الْمُغِيرَةِ بْنِ عَبْدِ اللَّهِ الْجَدَلِيِّ  ، عَنْ ابْنِ عُمَرَ  ، قَالَ :\" مَنْ قَرَأَ فِي لَيْلَةٍ عَشْرَ آيَاتٍ، لَمْ يُكْتَبْ مِنْ الْغَافِلِينَ، وَمَنْ قَرَأَ فِي لَيْلَةٍ بِمِائَةِ آيَةٍ، كُتِبَ مِنْ الْقَانِتِينَ، وَمَنْ قَرَأَ بِمِائَتَيْ آيَةٍ، كُتِبَ مِنْ الْفَائِزِينَ \"",
    "malay_translation": "Abu Ghassan telah menceritakan kepada kami, Israel telah menceritakan kepada kami, daripada Abu Ishaq, daripada Al-Mughirah bin Abdullah Al-Jadali, daripada Ibnu Umar رضي الله عنه, beliau berkata: \"Sesiapa yang membaca sepuluh ayat pada suatu malam, tidak akan ditulis daripada golongan yang lalai. Sesiapa yang membaca seratus ayat pada suatu malam, akan ditulis daripada golongan yang beribadat (qanitin). Dan sesiapa yang membaca dua ratus ayat, akan ditulis daripada golongan yang berjaya (al-faizin).\""
  },
  {
    "id": 40250,
    "hadith_number": 2713,
    "tajuk_hadith": "Ganjaran Membaca Al-Quran",
    "perawi_melayu": "Abu Sa'id al-Khudri رضي الله عنه",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، عَنْ سَعِيدٍ الْجُرَيْرِيِّ  ، عَنْ أَبِي نَضْرَةَ  ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ  ، قَالَ :\" مَنْ قَرَأَ فِي لَيْلَةٍ عَشْرَ آيَاتٍ، كُتِبَ مِنْ الذَّاكِرِينَ، وَمَنْ قَرَأَ بِمِائَةِ آيَةٍ، كُتِبَ مِنْ الْقَانِتِينَ، وَمَنْ قَرَأَ بِخَمْسِ مِائَةِ آيَةٍ إِلَى الْأَلْفِ، أَصْبَحَ وَلَهُ قِنْطَارٌ مِنْ الْأَجْرِ، قِيلَ : وَمَا الْقِنْطَارُ؟ قَالَ : مِلْءُ مَسْكِ الثَّوْرِ ذَهَبًا \"",
    "malay_translation": "Abu Sa'id al-Khudri رضي الله عنه meriwayatkan: \"Sesiapa yang membaca sepuluh ayat (Al-Quran) pada waktu malam, dia akan dicatatkan sebagai orang yang mengingati (Allah). Sesiapa yang membaca seratus ayat, dia akan dicatatkan sebagai orang yang taat. Sesiapa yang membaca lima ratus ayat hingga seribu ayat, dia akan bangun pagi dengan ganjaran satu qintar. Dikatakan: 'Apakah qintar itu?' Baginda bersabda: 'Penuh kulit lembu dengan emas.'"
  },
  {
    "id": 40251,
    "hadith_number": 2714,
    "tajuk_hadith": "Ganjaran Membaca Al-Quran dalam Solat Malam",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا وُهَيْبٌ  ، عَنْ يُونُسَ  ، عَنْ الْحَسَنِ   : أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنْ قَرَأَ فِي لَيْلَةٍ مِائَةَ آيَةٍ، لَمْ يُحَاجَّهُ الْقُرْآنُ تِلْكَ اللَّيْلَةَ، وَمَنْ قَرَأَ فِي لَيْلَةٍ مِائَتَيْ آيَةٍ، كُتِبَ لَهُ قُنُوتُ لَيْلَةٍ، وَمَنْ قَرَأَ فِي لَيْلَةٍ خَمْسَ مِائَةِ آيَةٍ إِلَى الْأَلْفِ، أَصْبَحَ وَلَهُ قِنْطَارٌ فِي الْآخِرَةِ \"، قَالُوا : وَمَا الْقِنْطَارُ؟ قَالَ : اثْنَا عَشَرَ أَلْفًا \"",
    "malay_translation": "Daripada Al-Hasan, sesungguhnya Nabi Allah ﷺ bersabda: \"Sesiapa yang membaca seratus ayat dalam satu malam, Al-Quran tidak akan mempertahankannya pada malam itu. Sesiapa yang membaca dua ratus ayat dalam satu malam, ditulis baginya qunut satu malam. Sesiapa yang membaca lima ratus ayat hingga seribu ayat dalam satu malam, maka pada waktu pagi dia akan mendapat satu qintar di akhirat.\" Mereka bertanya: \"Apakah qintar itu?\" Baginda bersabda: \"Dua belas ribu.\""
  },
  {
    "id": 40252,
    "hadith_number": 2715,
    "tajuk_hadith": "Ganjaran Membaca Ayat dalam Solat Malam",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا فِطْرٌ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ أَبِي الْأَحْوَصِ  ،  عَنْ عَبْدِ اللَّهِ  ، قَالَ :\" مَنْ قَرَأَ فِي لَيْلَةٍ ثَلَاثَ مِائَةِ آيَةٍ، كُتِبَ لَهُ قِنْطَارٌ، وَمَنْ قَرَأَ سَبْعَ مِائَةِ آيَةٍ \"، لَا أَدْرِي أَيَّ شَيْءٍ قَالَ فِيهَا أَبُو نُعَيْمٍ بِقَوْلِهِ",
    "malay_translation": "Abu Nu'aim meriwayatkan: Fitr meriwayatkan daripada Abu Ishaq, daripada Abul Ahwas, daripada Abdullah, berkata: \"Sesiapa yang membaca tiga ratus ayat dalam satu malam, maka dicatatkan baginya satu qintar (ganjaran), dan sesiapa yang membaca tujuh ratus ayat...\" Aku tidak tahu apa yang Abu Nu'aim katakan selepas itu."
  },
  {
    "id": 40253,
    "hadith_number": 2716,
    "tajuk_hadith": "Ganjaran Membaca Seribu Ayat",
    "perawi_melayu": "Abu Umamah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ  ، أَنْبَأَنَا حَرِيزٌ  ، عَنْ حَبِيبِ بْنِ عُبَيْدٍ  ، قَالَ : سَمِعْتُ أَبَا أُمَامَةَ  ، يَقُولُ :\" مَنْ قَرَأَ أَلْفَ آيَةٍ، كُتِبَ لَهُ قِنْطَارٌ مِنْ الْأَجْرِ.\nوَالْقِيرَاطُ مِنْ ذَلِكَ الْقِنْطَارِ لَا تَفِي بِهِ دُنْيَاكُمْ، يَقُولُ : لَا يَعْدِلُهُ دُنْيَاكُمْ \"",
    "malay_translation": "Diriwayatkan daripada Abu Umamah: \"Sesiapa yang membaca seribu ayat, akan ditulis baginya ganjaran satu qintar. Satu qirat daripada qintar itu tidak akan menyamai dunia kamu.\" Beliau berkata: \"Tidak akan menyamai dunia kamu.\""
  },
  {
    "id": 40254,
    "hadith_number": 2717,
    "tajuk_hadith": "Ganjaran Membaca Seribu Ayat dalam Satu Malam",
    "perawi_melayu": "Tamim ad-Dari dan Fadalah bin Ubaid",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بِسْطَامَ  ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ  ، عَنْ يَحْيَى بْنِ الْحَارِثِ  ، عَنْ الْقَاسِمِ أَبِي عَبْدِ الرَّحْمَنِ  ، عَنْ تَمِيمٍ الدَّارِيِّ  ، وَفَضَالَةَ بْنِ عُبَيْدٍ   ، قَالَا :\" مَنْ قَرَأَ أَلْفَ آيَةٍ فِي لَيْلَةٍ، كُتِبَ لَهُ قِنْطَارٌ، وَالْقِيرَاطُ مِنْ الْقِنْطَارِ خَيْرٌ مِنْ الدُّنْيَا وَمَا فِيهَا، وَاكْتَنَزَ مِنْ الْأَجْرِ مَا شَاءَ اللَّهُ \"",
    "malay_translation": "Daripada Tamim ad-Dari dan Fadalah bin Ubaid, mereka berkata: \"Sesiapa yang membaca seribu ayat dalam satu malam, maka ditulis baginya pahala satu qintar (nilai pahala yang besar). Dan satu qirat (sebahagian kecil daripada qintar) lebih baik daripada dunia dan segala isinya. Dan dia mengumpul pahala sebanyak yang Allah kehendaki.\""
  },
  {
    "id": 40255,
    "hadith_number": 2718,
    "tajuk_hadith": "Ganjaran Membaca Seribu Ayat Al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْقَاسِمِ  ، حَدَّثَنَا مُوسَى بْنُ عُبَيْدَةَ  ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ  ، عَنْ يُحَنَّسَ  مَوْلَى الزُّبَيْرِ، عَنْ سَالِمٍ  أَخِي أُمِّ الدَّرْدَاءِ ، عَنْ أُمِّ الدَّرْدَاءِ  ، عَنْ أَبِي الدَّرْدَاءِ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنْ قَرَأَ أَلْفَ آيَةٍ، إِلَى خَمْسِ مِائَةٍ كُتِبَ لَهُ قِنْطَارٌ مِنْ الْأَجْرِ، الْقِيرَاطُ مِنْهُ مِثْلُ التَّلِّ الْعَظِيمِ \"",
    "malay_translation": "Sabda Nabi SAW: \"Sesiapa yang membaca seribu ayat (Al-Quran) atau (membaca) sehingga lima ratus ayat, akan ditulis baginya satu qintar (ganjaran). Satu qirat daripadanya adalah seperti bukit yang besar.\""
  },
  {
    "id": 40256,
    "hadith_number": 2719,
    "tajuk_hadith": "Definisi Qintar",
    "perawi_melayu": "Abu Hurairah رضي الله عنه",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ  ، حَدَّثَنَا، أَبَانُ الْعَطَّارُ  ، وَحَمَّادُ بْنُ سَلَمَةَ  ، عَنْ عَاصِمٍ  ، عَنْ أَبِي صَالِحٍ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ :\" الْقِنْطَارُ : اثْنَا عَشَرَ أَلْفًا \"",
    "malay_translation": "Abu Hurairah رضي الله عنه meriwayatkan: \"Qintar (ukuran) adalah dua belas ribu.\" (Tidak terdapat teks asal dalam Bahasa Inggeris, terjemahan diambil daripada teks Arab)"
  },
  {
    "id": 40257,
    "hadith_number": 2720,
    "tajuk_hadith": "Definisi Qintar (Kuantiti Emas)",
    "perawi_melayu": "Abu Nadrah al-`Abdi",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاق بْنُ عِيسَى ، عَنْ أَبِي الْأَشْهَبِ ، عَنْ أَبِي نَضْرَةَ الْعَبْدِيِّ ، قَالَ :\" الْقِنْطَارُ : مِلْءُ مَسْكِ ثَوْرٍ ذَهَبًا \"",
    "malay_translation": "Telah menceritakan kepada kami Ishaq bin Isa, daripada Abu al-Ashhab, daripada Abu Nadrah al-`Abdi, beliau berkata: \"Qintar itu adalah: sepenuh kulit lembu emas.\""
  },
  {
    "id": 40258,
    "hadith_number": 2721,
    "tajuk_hadith": "Definisi Qintar (Kuantiti)",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاق ، عَنْ هُشَيْمٍ ، عَنْ عَلِيِّ بْنِ زَيْدٍ ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ ، قَالَ :\" الْقِنْطَارُ : أَرْبَعُونَ أَلْفًا \"",
    "malay_translation": "Telah menceritakan kepada kami Ishaq, daripada Hushaim, daripada Ali bin Zaid, daripada Sa'id bin al-Musayyib, beliau berkata: \"Al-Qintar adalah empat puluh ribu (mata wang).\""
  },
  {
    "id": 40259,
    "hadith_number": 2722,
    "tajuk_hadith": "Nilai Qinthar Sebagai Diyat",
    "perawi_melayu": "Diriwayatkan oleh Hasan",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاق  ، عَنْ مُبَارَكٍ  ، عَنْ الْحَسَنِ  ، قَالَ :\" الْقِنْطَارُ دِيَةُ أَحَدِكُمْ اثْنَا عَشَرَ أَلْفًا \"",
    "malay_translation": "Telah menceritakan kepada kami Ishaq, dari Mubarak, dari Al-Hasan, dia berkata: \"Qinthar ialah diyat salah seorang dari kamu, iaitu dua belas ribu.\""
  },
  {
    "id": 40260,
    "hadith_number": 2723,
    "tajuk_hadith": "Definisi Qintar",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاق ، عَنْ مُسْلِمٍ هُوَ الزَّنْجِيُّ  ، عَنْ ابْنِ أَبِي نَجِيحٍ  ، عَنْ مُجَاهِدٍ  ، قَالَ :\" الْقِنْطَارُ : سَبْعُونَ أَلْفَ دِينَارٍ \"",
    "malay_translation": "Telah menceritakan kepada kami Ishaq, dari Muslim, dia adalah Az-Zanji, dari Ibnu Abi Najih, dari Mujahid, dia berkata: \"Qintar ialah tujuh puluh ribu dinar.\""
  },
  {
    "id": 40261,
    "hadith_number": 2724,
    "tajuk_hadith": "Definisi Qintar",
    "perawi_melayu": "Mu'adh bin Jabal رضي الله عنه",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاق  ، عَنْ أَبِي بَكْرٍ  ، عَنْ أَبِي حَصِينٍ  ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ  ، عَنْ مُعَاذِ بْنِ جَبَلٍ  ، قَالَ :\" الْقِنْطَارُ : أَلْفُ أُوقِيَّةٍ وَمِائَتَا أُوقِيَّةٍ \"",
    "malay_translation": "Daripada Mu'adh bin Jabal رضي الله عنه, berkata: \"Qintar adalah seribu uqiyyah dan dua ratus uqiyyah.\"  (Nota: Uqiyyah adalah unit ukuran berat dalam Islam)"
  },
  {
    "id": 40262,
    "hadith_number": 2725,
    "tajuk_hadith": "Makna Qintar",
    "perawi_melayu": "Mujahid (رحمه الله)",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ ، حَدَّثَنَا شَرِيكٌ ، عَنْ لَيْثٍ ، عَنْ مُجَاهِدٍ ، قَالَ :\" الْقِنْطَارُ : سَبْعُونَ أَلْفَ مِثْقَالٍ \"",
    "malay_translation": "Abu Nu'aim meriwayatkan kepada kami, Sharik meriwayatkan kepada kami, daripada Laith, daripada Mujahid, beliau berkata: \"Al-Qintar (kintal) ialah tujuh puluh ribu mithqal.\""
  },
  {
    "id": 40263,
    "hadith_number": 2726,
    "tajuk_hadith": "Ganjaran Menyaksikan Pembukaan dan Penutupan Al-Quran",
    "perawi_melayu": "Diriwayatkan daripada Abu Qilabah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا صَالِحٌ الْمُرِّيُّ  ، عَنْ أَيُّوبَ  ، عَنْ أَبِي قِلَابَةَ  ، رَفَعَهُ قَالَ :\" مَنْ شَهِدَ الْقُرْآنَ حِينَ يُفْتَحُ، فَكَأَنَّمَا شَهِدَ فَتْحًا فِي سَبِيلِ اللَّهِ، وَمَنْ شَهِدَ خَتْمَهُ حِينَ يُخْتَمُ، فَكَأَنَّمَا شَهِدَ الْغَنَائِمَ حِينَ تُقْسَمُ \"",
    "malay_translation": "Sesiapa yang menyaksikan Al-Quran ketika ia dibuka (dibacakan), seolah-olah dia menyaksikan pembukaan (kemenangan) di jalan Allah. Dan sesiapa yang menyaksikan penutupannya (khatam), seolah-olah dia menyaksikan harta rampasan perang ketika ia dibahagikan."
  },
  {
    "id": 40264,
    "hadith_number": 2727,
    "tajuk_hadith": "Kisah Seorang Lelaki yang Membaca di Masjid Madinah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا صَالِحٌ الْمُرِّيُّ  ، عَنْ قَتَادَةَ  ، قَالَ :\" كَانَ رَجُلٌ يَقْرَأُ فِي مَسْجِدِ الْمَدِينَةِ ، وَكَانَ ابْنُ عَبَّاسٍ   قَدْ وَضَعَ عَلَيْهِ الرَّصَدَ، فَإِذَا كَانَ يَوْمُ خَتْمِهِ، قَامَ فَتَحَوَّلَ إِلَيْهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Soleh Al-Murri, daripada Qatadah, dia berkata: \"Adalah seorang lelaki membaca di Masjid Madinah, dan Ibnu Abbas telah meletakkan pengawasan ke atasnya. Apabila tiba hari dia mengkhatamkan bacaannya, dia bangun lalu berpindah kepadanya (lelaki tersebut).\""
  },
  {
    "id": 40265,
    "hadith_number": 2728,
    "tajuk_hadith": "Anas bin Malik Menyelesaikan Bacaan Al-Quran Bersama Keluarga",
    "perawi_melayu": "Suleiman bin Harb",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا صَالِحٌ  ، عَنْ ثَابِتٍ الْبُنَانِيِّ  ، قَالَ : كَانَ أَنَسُ بْنُ مَالِكٍ  إِذَا أَشْفَى عَلَى خَتْمِ الْقُرْآنِ، بِاللَّيْلِ بَقَّى مِنْهُ شَيْئًا حَتَّى يُصْبِحَ فَيَجْمَعَ أَهْلَهُ، فَيَخْتِمَهُ مَعَهُمْ \"",
    "malay_translation": "Suleiman bin Harb meriwayatkan: Telah menceritakan kepada kami Salih, daripada Thabit Al-Bunani, dia berkata: Adalah Anas bin Malik, apabila hampir selesai membaca Al-Quran pada waktu malam, dia akan meninggalkan sedikit daripadanya sehingga ke pagi. Kemudian dia mengumpulkan ahli keluarganya, lalu menyelesaikannya bersama mereka."
  },
  {
    "id": 40266,
    "hadith_number": 2729,
    "tajuk_hadith": "Doa Anas Apabila Menyempurnakan Al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَفَّانُ  ، حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ  ، حَدَّثَنَا ثَابِتٌ  ، قَالَ :\" كَانَ أَنَسٌ   إِذَا خَتَمَ الْقُرْآنَ، جَمَعَ وَلَدَهُ وَأَهْلَ بَيْتِهِ، فَدَعَا لَهُمْ \"",
    "malay_translation": "Daripada 'Affan, daripada Ja'far bin Sulaiman, daripada Thabit, berkata: \"Adalah Anas, apabila dia menyempurnakan bacaan Al-Quran, dia mengumpulkan anak-anaknya dan ahli keluarganya, lalu berdoa untuk mereka.\""
  },
  {
    "id": 40267,
    "hadith_number": 2730,
    "tajuk_hadith": "Malaikat Berselawat ke Atas Pembaca Al-Quran yang Menyelesaikannya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْمُغِيرَةِ ، حَدَّثَنَا الْأَوْزَاعِيُّ ، عَنْ عَبْدَةَ ، قَالَ :\" إِذَا خَتَمَ الرَّجُلُ الْقُرْآنَ بِنَهَارٍ، صَلَّتْ عَلَيْهِ الْمَلَائِكَةُ حَتَّى يُمْسِيَ، وَإِنْ فَرَغَ مِنْهُ لَيْلًا، صَلَّتْ عَلَيْهِ الْمَلَائِكَةُ حَتَّى يُصْبِحَ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu al-Mughirah, telah menceritakan kepada kami al-Awza'i, daripada 'Abdah, dia berkata: \"Apabila seseorang lelaki mengkhatamkan Al-Quran pada siang hari, maka para malaikat berselawat ke atasnya sehingga petang. Dan jika dia menyelesaikannya pada malam hari, maka para malaikat berselawat ke atasnya sehingga pagi.\""
  },
  {
    "id": 40268,
    "hadith_number": 2731,
    "tajuk_hadith": "Amalan Terbaik: Membaca dan Merenung Al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاق بْنُ عِيسَى  ، عَنْ صَالِحٍ الْمُرِّيِّ  ، عَنْ قَتَادَةَ  ،  عَنْ زُرَارَةَ بْنِ أَوْفَى   : أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ : أَيُّ الْعَمَلِ أَفْضَلُ؟ قَالَ :الْحَالُّ الْمُرْتَحِلُ \"، قِيلَ : وَمَا الْحَالُّ الْمُرْتَحِلُ؟ قَالَ : صَاحِبُ الْقُرْآنِ يَضْرِبُ مِنْ أَوَّلِ الْقُرْآنِ إِلَى آخِرِهِ، وَمِنْ آخِرِهِ إِلَى أَوَّلِهِ، كُلَّمَا حَلَّ، ارْتَحَلَ \"",
    "malay_translation": "Daripada Ishaq bin Isa, daripada Soleh Al-Murri, daripada Qatadah, daripada Zurarah bin Aufa: Bahawa Nabi ﷺ ditanya: \"Amalan apakah yang paling utama?\" Baginda menjawab: \"Al-Haalul Murtahil.\" Ditanya: \"Apakah Al-Haalul Murtahil itu?\" Baginda bersabda: \"Pemilik Al-Quran yang membaca (berulang-ulang) dari awal Al-Quran hingga akhirnya, dan dari akhirnya hingga awalnya. Setiap kali selesai (membaca), dia berpindah (membaca lagi).\""
  },
  {
    "id": 40269,
    "hadith_number": 2732,
    "tajuk_hadith": "Malaikat Berselawat ke Atas Pembaca Al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى ، عَنْ جَرِيرٍ ، عَنْ الْأَعْمَشِ ، عَنْ إِبْرَاهِيمَ ، قَالَ :\" إِذَا قَرَأَ الرَّجُلُ الْقُرْآنَ نَهَارًا، صَلَّتْ عَلَيْهِ الْمَلَائِكَةُ حَتَّى يُمْسِيَ، وَإِنْ قَرَأَهُ لَيْلًا، صَلَّتْ عَلَيْهِ الْمَلَائِكَةُ حَتَّى يُصْبِحَ \".\nقَالَ سُلَيْمَانُ : فَرَأَيْتُ أَصْحَابَنَا يُعْجِبُهُمْ أَنْ يَخْتِمُوهُ أَوَّلَ النَّهَارِ، وَأَوَّلَ اللَّيْلِ.\n حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ الْفِرْيَابِيُّ ، عَنْ سُفْيَانَ ، عَنْ الْأَعْمَشِ ، عَنْ إِبْرَاهِيمَ ، مِثْلَهُ، إِلَّا أَنَّهُ لَيْسَ فِيهِ قَوْلُ سُلَيْمَانَ",
    "malay_translation": "Diriwayatkan daripada Ibrahim bin Musa, daripada Jarir, daripada Al-A'mash, daripada Ibrahim, beliau berkata: \"Apabila seseorang membaca Al-Quran pada siang hari, maka malaikat akan berselawat ke atasnya sehingga waktu petang. Dan jika dia membacanya pada malam hari, maka malaikat akan berselawat ke atasnya sehingga waktu pagi.\" Sulaiman berkata: \"Saya melihat sahabat-sahabat kami suka mengkhatamkan Al-Quran pada awal siang dan awal malam.\""
  },
  {
    "id": 40270,
    "hadith_number": 2733,
    "tajuk_hadith": "Keistimewaan Bagi Penghafal Al-Quran",
    "perawi_melayu": "Faruwah bin Abi al-Maghra', daripada al-Qasim bin Malik al-Muzani, daripada Abdur Rahman bin Ishaq, daripada Muharib bin Dithar",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ ، عَنْ الْقَاسِمِ بْنِ مَالِكٍ الْمُزَنِيِّ ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَاق ، عَنْ مُحَارِبِ بْنِ دِثَارٍ ، قَالَ :\" مَنْ قَرَأَ الْقُرْآنَ عَنْ ظَهْرِ قَلْبِهِ، كَانَتْ لَهُ دَعْوَةٌ فِي الدُّنْيَا، أَوْ فِي الْآخِرَةِ \"",
    "malay_translation": "Sesiapa yang menghafal Al-Quran daripada ingatan, maka baginya doa yang mustajab di dunia atau di akhirat."
  },
  {
    "id": 40271,
    "hadith_number": 2734,
    "tajuk_hadith": "Malaikat Berselawat Kepada Pembaca Al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سَعِيدٍ  ، حَدَّثَنَا عَبْدُ السَّلَامِ  ، عَنْ يَزِيدَ بْنِ عَبْدِ الرَّحْمَنِ  ، عَنْ طَلْحَةَ  ، وَعَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ   ، قَالَا :\" مَنْ قَرَأَ الْقُرْآنَ لَيْلًا أَوْ نَهَارًا، صَلَّتْ عَلَيْهِ الْمَلَائِكَةُ إِلَى اللَّيْلِ \"، وَقَالَ الْآخَرُ : \" غُفِرَ لَهُ \"",
    "malay_translation": "Daripada Muhammad bin Sa'id, daripada 'Abdul Salam, daripada Yazid bin 'Abdur-Rahman, daripada Talhah, dan 'Abdur-Rahman bin al-Aswad, mereka berkata: \"Sesiapa yang membaca Al-Quran pada waktu malam atau siang, maka malaikat akan berselawat ke atasnya sehingga malam,\" dan seorang lagi berkata: \"Dia diampunkan.\""
  },
  {
    "id": 40272,
    "hadith_number": 2735,
    "tajuk_hadith": "Keutamaan Membaca Al-Quran dan Doa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ حَمَّادٍ ، حَدَّثَنَا قَزَعَةُ بْنُ سُوَيْدٍ ، عَنْ حُمَيْدٍ الْأَعْرَجِ ، قَالَ :\" مَنْ قَرَأَ الْقُرْآنَ ثُمَّ دَعَا، أَمَّنَ عَلَى دُعَائِهِ أَرْبَعَةُ آلَافِ مَلَكٍ \"",
    "malay_translation": "Amru bin Hammad meriwayatkan, Qaza'ah bin Suwaid meriwayatkan daripada Humaid al-A'raj, beliau berkata: \"Sesiapa yang membaca Al-Quran kemudian berdoa, maka empat ribu malaikat akan mengaminkan doanya.\""
  },
  {
    "id": 40273,
    "hadith_number": 2736,
    "tajuk_hadith": "Doa Ketika Khatam Al-Quran",
    "perawi_melayu": "Mujahid",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ الرَّبِيعِ ، حَدَّثَنَا شُعْبَةُ ، عَنْ الْحَكَمِ ، عَنْ مُجَاهِدٍ ، قَالَ : بَعَثَ إِلَيَّ مجاهدٌ، قَالَ :إِنَّمَا دَعَوْنَاكَ أَنَّا أَرَدْنَا أَنْ نَخْتِمَ الْقُرْآنَ، وَإِنَّهُ بَلَغَنَا أَنَّ الدُّعَاءَ يُسْتَجَابُ عِنْدَ خَتْمِ الْقُرْآنِ، قَالَ : فَدَعَوْا بِدَعَوَاتٍ \"",
    "malay_translation": "Sa'id bin Ar-Rabi' meriwayatkan, daripada Syu'bah, daripada Al-Hakam, daripada Mujahid, berkata: Mujahid telah mengutus seseorang kepadaku seraya berkata: \"Sesungguhnya kami memanggilmu kerana kami ingin mengkhatamkan Al-Quran. Sesungguhnya telah sampai kepada kami bahawa doa itu dimakbulkan ketika khatam Al-Quran.\" Mujahid berkata: \"Lalu mereka berdoa dengan beberapa doa\""
  },
  {
    "id": 40274,
    "hadith_number": 2737,
    "tajuk_hadith": "Keutamaan Menyelesaikan Bacaan Al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ  ، حَدَّثَنَا هَارُونُ  ، عَنْ عَنْبسة  ، عَنْ لَيْثٍ  ، عَنْ طَلْحَةَ بْنِ مُصَرِّفٍ  ، عَنْ مُصْعَبِ بْنِ سَعْدٍ  ، عَنْ سَعْدٍ  ، قَالَ :\" إِذَا وَافَقَ خَتْمُ الْقُرْآنِ أَوَّلَ اللَّيْلِ، صَلَّتْ عَلَيْهِ الْمَلَائِكَةُ حَتَّى يُصْبِحَ، وَإِنْ وَافَقَ خَتْمُهُ آخِرَ اللَّيْلِ، صَلَّتْ عَلَيْهِ الْمَلَائِكَةُ حَتَّى يُمْسِيَ، فَرُبَّمَا بَقِيَ عَلَى أَحَدِنَا الشَّيْءُ، فَيُؤَخِّرَهُ حَتَّى يُمْسِيَ أَوْ يُصْبِحَ \".\n قَالَ أَبُو مُحَمَّد : هَذَا حَسَنٌ عَنْ سَعْدٍ",
    "malay_translation": "Sa'ad berkata: \"Jika selesai membaca Al-Quran pada awal malam, maka para malaikat akan berselawat ke atasnya sehingga waktu subuh. Dan jika selesai membacanya pada akhir malam, maka para malaikat akan berselawat ke atasnya sehingga waktu petang. Kadang-kadang ada di antara kami yang masih ada sedikit (bacaan) yang tertinggal, lalu kami menangguhkannya sehingga petang atau subuh.\""
  },
  {
    "id": 40275,
    "hadith_number": 2738,
    "tajuk_hadith": "Pembawa Al-Quran Adalah Kenalan Ahli Syurga",
    "perawi_melayu": "Mujahid bin Musa, Ma'n, Ibrahim bin Muhajir bin Mismar, anak saudara Bukair bin Mismar, Safwan bin Sulaim, daripada 'Ata' bin Yasar",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُجَاهِدُ بْنُ مُوسَى  ، حَدَّثَنَا مَعْنٌ  ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُهَاجِرِ بْنِ مِسْمَارٍ  ابْنِ أَخِي بُكَيْرِ بْنِ مِسْمَارٍ، حَدَّثَنِي صَفْوَانُ بْنُ سُلَيْمٍ  ، عَنْ عَطَاءِ بْنِ يَسَارٍ  ، قَالَ :\" حَمَلَةُ الْقُرْآنِ عُرَفَاءُ أَهْلِ الْجَنَّةِ \"",
    "malay_translation": "Daripada 'Ata' bin Yasar, dia berkata: \"Pembawa Al-Quran adalah kenalan ahli syurga.\""
  },
  {
    "id": 40276,
    "hadith_number": 2739,
    "tajuk_hadith": "Membaca Al-Quran Setiap Dua Malam",
    "perawi_melayu": "Yazid bin Harun, daripada Abdul Malik, daripada Sa'id bin Jubair",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ ، أنبأنا عَبْدُ الْمَلِكِ ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ  : أَنَّهُ كَانَ\" يَخْتِمُ الْقُرْآنَ كُلَّ لَيْلَتَيْنِ \"",
    "malay_translation": "Telah menceritakan kepada kami Yazid bin Harun, telah menceritakan kepada kami Abdul Malik, daripada Sa'id bin Jubair: Bahawa dia (Sa'id bin Jubair) sentiasa 'khatam' (menyelesaikan bacaan) Al-Quran setiap dua malam."
  },
  {
    "id": 40277,
    "hadith_number": 2740,
    "tajuk_hadith": "Tempoh Khatam Al-Quran",
    "perawi_melayu": "Abdullah bin Amr",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ مُحَمَّدٍ  ، حَدَّثَنَا جَرِيرٌ  ، عَنْ مُطَرِّفٍ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ أَبِي بُرْدَةَ  ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو  ، قَالَ : قُلْتُ : يَا رَسُولَ اللَّهِ، فِي كَمْ أَخْتِمُ الْقُرْآنَ؟ قَالَ :\" اخْتِمْهُ فِي شَهْرٍ \"، قُلْتُ : يَا رَسُولَ اللَّهِ، أنا أُطِيقُ، قَالَ : \" اخْتِمْهُ فِي خَمْسة وَعِشْرِينَ \"، قُلْتُ : إِنِّي أُطِيقُ، قَالَ : \" اخْتِمْهُ فِي عِشْرِينَ \"، قُلْتُ : إِنِّي أُطِيقُ، قَالَ : \" اخْتِمْهُ فِي خَمْسَ عَشْرَةَ \"، قُلْتُ : إِنِّي أُطِيقُ، قَالَ : \" اخْتِمْهُ فِي عَشْرٍ \"، قُلْتُ : إِنِّي أُطِيقُ، قَالَ : \" اخْتِمْهُ فِي خَمْسٍ \"، قُلْتُ : إِنِّي أُطِيقُ، قَالَ : \" لَا \"",
    "malay_translation": "Diriwayatkan daripada Abdullah bin Amr, beliau berkata: \"Saya bertanya, 'Wahai Rasulullah, dalam berapa lama saya boleh mengkhatamkan al-Quran?' Baginda menjawab: 'Khatamkanlah dalam sebulan.' Saya berkata: 'Wahai Rasulullah, saya mampu melakukannya.' Baginda bersabda: 'Khatamkanlah dalam dua puluh lima hari.' Saya berkata: 'Saya mampu.' Baginda bersabda: 'Khatamkanlah dalam dua puluh hari.' Saya berkata: 'Saya mampu.' Baginda bersabda: 'Khatamkanlah dalam lima belas hari.' Saya berkata: 'Saya mampu.' Baginda bersabda: 'Khatamkanlah dalam sepuluh hari.' Saya berkata: 'Saya mampu.' Baginda bersabda: 'Khatamkanlah dalam lima hari.' Saya berkata: 'Saya mampu.' Baginda bersabda: 'Jangan'."
  },
  {
    "id": 40278,
    "hadith_number": 2741,
    "tajuk_hadith": "Larangan Membaca Al-Quran Kurang Daripada Tiga Hari",
    "perawi_melayu": "Abdullah bin Amr",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ  ، حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ زِيَادٍ  ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ رَافِعٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو  ، قَالَ : \" أَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْلَا أَقْرَأَ الْقُرْآنَ فِي أَقَلَّ مِنْ ثَلَاثٍ \"",
    "malay_translation": "Abdullah bin Amr meriwayatkan: Rasulullah SAW memerintahkan aku supaya tidak membaca Al-Quran kurang daripada tiga hari."
  },
  {
    "id": 40279,
    "hadith_number": 2742,
    "tajuk_hadith": "Kewajipan Melagukan Al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ  ، حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ  ، حَدَّثَنَا ابْنُ أَبِي مُلَيْكَةَ  ، عَنْ ابْنِ أَبِي نَهِيكٍ  ، عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ   : أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" لَيْسَ مِنَّا مَنْ لَمْ يَتَغَنَّ بِالْقُرْآنِ \".\nقَالَ ابْنُ عُيَيْنَةَ : يَسْتَغْنِي، قَالَ أَبُو مُحَمَّد : النَّاسُ يَقُولُونَ : عُبَيْدُ اللَّهِ بْنُ أَبِي نَهِيكٍ",
    "malay_translation": "Telah menceritakan kepada kami Abu Al-Walid At-Tayalisi, telah menceritakan kepada kami Laits bin Sa'd, telah menceritakan kepada kami Ibnu Abi Mulaikah, dari Ibnu Abi Nahik, dari Sa'ad bin Abi Waqqas: Bahawa Rasulullah SAW bersabda: \"Bukan dari kalangan kami, orang yang tidak melagukan Al-Quran.\" Ibnu Uyainah berkata: Ia bermaksud, \"menghayati.\" Abu Muhammad berkata: Orang ramai berkata: 'Ubaidullah bin Abi Nahik."
  },
  {
    "id": 40280,
    "hadith_number": 2743,
    "tajuk_hadith": "Orang yang Terbaik dalam Bacaan Al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ  ، أَنْبَأَنَا مِسْعَرٌ  ، عَنْ عَبْدِ الْكَرِيمِ  ، عَنْ طَاوُسٍ  ، قَالَ : سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : أَيُّ النَّاسِ أَحْسَنُ صَوْتًا لِلْقُرْآنِ، وَأَحْسَنُ قِرَاءَةً؟ قَالَ :\" مَنْ إِذَا سَمِعْتَهُ يَقْرَأُ، أُرِيتَ أَنَّهُ يَخْشَى اللَّهَ \"، قَالَ طَاوُسٌ : وَكَانَ طَلْقٌ كَذَلِكَ",
    "malay_translation": "Daripada Tawus berkata: Nabi SAW ditanya, \"Siapakah orang yang paling baik suaranya ketika membaca Al-Quran dan paling baik bacaannya?\" Baginda SAW bersabda, \"Sesiapa yang apabila kamu mendengarnya membaca, seolah-olah kamu melihat dia takut kepada Allah.\" Tawus berkata: Talq juga demikian."
  },
  {
    "id": 40281,
    "hadith_number": 2744,
    "tajuk_hadith": "Kebenaran Allah kepada Nabi yang Mendendangkan al-Quran",
    "perawi_melayu": "Abu Hurairah رضي الله عنه",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، حَدَّثَنِي اللَّيْثُ  ، حَدَّثَنِي عُقَيْلٌ  ، عَنْ ابْنِ شِهَابٍ  ، حَدَّثَنِي أَبُو سَلَمَةَ  ،  عَنْ أَبِي هُرَيْرَةَ  ، أَنَّهُ كَانَ يَقُولُ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَمْ يَأْذَنْ اللَّهُ لِشَيْءٍ، مَا أَذِنَ لِنَبِيٍّ يَتَغَنَّى بِالْقُرْآنِ \"، قَالَ صَاحِبٌ لَهُ : أَرَادَ : يَجْهَرُ بِهِ",
    "malay_translation": "Daripada Abu Hurairah رضي الله عنه, bahawa beliau berkata: Rasulullah ﷺ bersabda: \"Allah tidak mengizinkan (sesuatu) seperti mana Dia mengizinkan seorang Nabi mendendangkan al-Quran.\" Sahabatnya berkata: \"Maksudnya: Menyaringkannya (membaca dengan suara yang jelas).\""
  },
  {
    "id": 40282,
    "hadith_number": 2745,
    "tajuk_hadith": "Kurniaan Allah kepada Nabi yang Membaca Al-Quran dengan Merdu",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، حَدَّثَنَا اللَّيْثُ  ، حَدَّثَنِي يُونُسُ  ، عَنْ ابْنِ شِهَابٍ  ، قَالَ : أَخْبَرَنِي أَبُو سَلَمَةَ  ، أَنَّ أَبَا هُرَيْرَةَ  ، قَالَ :\" مَا أَذِنَ اللَّهُ لِشَيْءٍ، كَمَا أَذِنَ لِنَبِيٍّ يَتَغَنَّى بِالْقُرْآنِ \"",
    "malay_translation": "Daripada Abu Hurairah r.a., beliau berkata: \"Allah tidak mengizinkan sesuatu seperti mana Dia mengizinkan seorang nabi yang melagukan Al-Quran.\""
  },
  {
    "id": 40283,
    "hadith_number": 2746,
    "tajuk_hadith": "Suara Abu Musa Al-Asy'ari yang Merdu dalam Membaca Al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، حَدَّثَنِي اللَّيْثُ  ، حَدَّثَنِي يُونُسُ  ، عَنْ ابْنِ شِهَابٍ  ، قَالَ : أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ   : أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ لِأَبِي مُوسَى وَكَانَ حَسَنَ الصَّوْتِ بِالْقُرْآنِ :\" لَقَدْ أُوتِيَ هَذَا مِنْ مَزَامِيرِ آلِ دَاوُدَ \"",
    "malay_translation": "Daripada Abu Salamah bin Abdur Rahman bahawa Rasulullah SAW berkata kepada Abu Musa (Al-Asy'ari) yang mempunyai suara yang merdu ketika membaca Al-Quran: \"Sesungguhnya dia (Abu Musa) telah diberi (kelebihan) daripada seruling (nyanyian indah) keluarga Daud (Nabi Daud).\""
  },
  {
    "id": 40284,
    "hadith_number": 2747,
    "tajuk_hadith": "Umar Ibn Al-Khattab meminta Abu Musa untuk mengingatkan tentang Allah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، حَدَّثَنِي اللَّيْثُ  ، حَدَّثَنِي يُونُسُ  ، عَنْ ابْنِ شِهَابٍ  ، قَالَ : حَدَّثَنِي أَبُو سَلَمَةَ  أَيْضًا : أَنَّ عُمَرَ بْنَ الْخَطَّابِ   كَانَ إِذَا رَأَى أَبَا مُوسَى، قَالَ :\" ذَكِّرْنَا رَبَّنَا يَا أَبَا مُوسَى، فَيَقْرَأُ عِنْدَهُ \"",
    "malay_translation": "Abdullah bin Salih telah meriwayatkan kepada kami, telah meriwayatkan kepadaku Al-Layth, telah meriwayatkan kepadaku Yunus, daripada Ibnu Syihab, dia berkata: Abu Salamah juga telah meriwayatkan kepadaku: bahawa Umar bin Al-Khattab apabila melihat Abu Musa, beliau berkata: \"Ingatkanlah kami tentang Tuhan kami wahai Abu Musa\", lalu dia membacakan (ayat al-Quran) di hadapannya."
  },
  {
    "id": 40285,
    "hadith_number": 2748,
    "tajuk_hadith": "Keutamaan Membaca Surah Al-Baqarah",
    "perawi_melayu": "Abdullah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ  ، حَدَّثَنَا إِبْرَاهِيمُ الْهَجَرِيُّ  ، عَنْ أَبِي الْأَحْوَصِ  ، عَنْ عَبْدِ اللَّهِ  ، قَالَ :\" لَا أُلْفِيَنَّ أَحَدَكُمْ يَضَعُ إِحْدَى رِجْلَيْهِ عَلَى الْأُخْرَى يَتَغَنَّى وَيَدَعُ أَنْ يَقْرَأَ سُورَةَ الْبَقَرَةِ ، فَإِنَّ الشَّيْطَانَ يَفِرُّ مِنْ الْبَيْتِ يُقْرَأُ فِيهِ سُورَةُ الْبَقَرَةِ ، وَإِنَّ أَصْفَرَ الْبُيُوتِ الْجَوْفُ، يَصْفَرُ مِنْ كِتَابِ اللَّهِ \"",
    "malay_translation": "Daripada Abdullah (r.a), beliau berkata: \"Janganlah aku dapati seseorang daripada kamu meletakkan satu kakinya di atas kaki yang lain, menyanyi, dan meninggalkan membaca Surah Al-Baqarah. Sesungguhnya syaitan akan lari dari rumah yang dibacakan padanya Surah Al-Baqarah. Sesungguhnya rumah yang kosong itu adalah yang kosong dari Kitabullah.\""
  },
  {
    "id": 40286,
    "hadith_number": 2749,
    "tajuk_hadith": "Salmah al-Baydhaq dan Bacaan Solatnya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ ، عَنْ أَيُّوبَ ، قَالَ : حَدَّثَنِي بَعْضُ  آلِ سَالِمِ بْنِ عَبْدِ اللَّهِ، قَالَ :\" قَدِمَ سَلَمَةُ الْبَيْذَقُ الْمَدِينَةَ ، فَقَامَ يُصَلِّي بِهِمْ، فَقِيلَ لِسَالِمٍ  : لَوْ جِئْتَ فَسَمِعْتَ قِرَاءَتَهُ، فَلَمَّا كَانَ بِبَابِ الْمَسْجِدِ، سَمِعَ قِرَاءَتَهُ، رَجَعَ فَقَالَ : غِنَاءٌ غِنَاءٌ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Hammad bin Zaid, dari Ayyub, berkata: Telah menceritakan kepadaku sebahagian daripada keluarga Salim bin Abdullah, berkata: \"Salmah al-Baydhaq telah datang ke Madinah, lalu dia berdiri untuk solat bersama mereka. Dikatakan kepada Salim: 'Jika kamu datang dan mendengar bacaannya.' Apabila dia berada di pintu masjid, dia mendengar bacaannya, lalu dia kembali dan berkata: 'Nyanyian, nyanyian!'"
  },
  {
    "id": 40287,
    "hadith_number": 2750,
    "tajuk_hadith": "Abu Musa Meminta Umar Mengingatkan Mereka Tentang Allah",
    "perawi_melayu": "Abu Musa (RA)",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو عَاصِمٍ  ، عَنْ ابْنِ جُرَيْجٍ  ، عَنْ ابْنِ شِهَابٍ  ، عَنْ أَبِي سَلَمَةَ  : \" أَنَّ أَبَا مُوسَى كَانَ يَأْتِي عُمَرَ  ، فَيَقُولُ لَهُ عُمَرُ :ذَكِّرْنَا رَبَّنَا، فَيَقْرَأُ عِنْدَهُ \"",
    "malay_translation": "Diriwayatkan dari Abu Musa (RA): Beliau sering menemui Umar (RA), dan Umar berkata kepadanya: 'Ingatkanlah kami kepada Tuhan kami.' Kemudian Abu Musa membacakan ayat-ayat di sisinya."
  },
  {
    "id": 40288,
    "hadith_number": 2751,
    "tajuk_hadith": "Keutamaan Nabi Membaca Al-Quran dengan Merdu",
    "perawi_melayu": "Abu Hurairah رضي الله عنه",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ  ، حَدَّثَنَا مُحَمَّدٌ هُوَ ابْنُ عَمْرٍو  ، عَنْ أَبِي سَلَمَةَ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَا أَذِنَ اللَّهُ لِشَيْءٍ، كَأَذَنِهِ لِنَبِيٍّ يَتَغَنَّى بِالْقُرْآنِ يَجْهَرُ بِهِ \"",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Allah tidak mengizinkan sesuatu sebagaimana Dia mengizinkan kepada seorang Nabi yang melagukan Al-Quran dan menyaringkannya (dalam bacaan).\""
  },
  {
    "id": 40289,
    "hadith_number": 2752,
    "tajuk_hadith": "Abu Musa Diberi Suara Merdu Seperti Keluarga Daud",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ  ، عَنْ مَالِكِ بْنِ مِغْوَلٍ  ، عَنْ ابْنِ بُرَيْدَةَ  ، عَنْ أَبِيهِ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" لَقَدْ أُوتِيَ أَبُو مُوسَى مِزْمَارًا مِنْ مَزَامِيرِ آلِ دَاوُدَ \"",
    "malay_translation": "Diriwayatkan daripada 'Uthman bin 'Umar, daripada Malik bin Mighwal, daripada Ibn Buraydah, daripada bapanya, daripada Nabi SAW, baginda bersabda: \"Sesungguhnya Abu Musa telah dikurniakan suara yang merdu seperti suara (keluarga) Daud (Nabi Daud)."
  },
  {
    "id": 40290,
    "hadith_number": 2753,
    "tajuk_hadith": "Suara Merdu Abdullah bin Qais",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو  ، عَنْ أَبِي سَلَمَةَ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : \" دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَسَمِعَ قِرَاءَةَ رَجُلٍ، فَقَالَ : \" مَنْ هَذَا \"؟ قِيلَ : عَبْدُ اللَّهِ بْنُ قَيْسٍ، قَالَ :\" لَقَدْ أُوتِيَ هَذَا مِزْمَارًا مِنْ مَزَامِيرِ آلِ دَاوُدَ \"",
    "malay_translation": "Diriwayatkan daripada Abu Hurairah, beliau berkata: “Rasulullah ﷺ masuk lalu mendengar bacaan seorang lelaki. Baginda bertanya: ‘Siapakah ini?’ Dikatakan: ‘Abdullah bin Qais.’ Baginda bersabda: ‘Sesungguhnya dia telah diberi suara merdu seperti suara merdu keluarga Daud (Nabi Daud).’”"
  },
  {
    "id": 40291,
    "hadith_number": 2754,
    "tajuk_hadith": "Mengindahkan Al-Quran dengan Suara yang Merdu",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ  ، عَنْ سُفْيَانَ  ، عَنْ مَنْصُورٍ  ، عَنْ طَلْحَةَ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْسَجَةَ  ، عَنْ الْبَرَاءِ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" زَيِّنُوا الْقُرْآنَ بِأَصْوَاتِكُمْ \"",
    "malay_translation": "Rasulullah SAW bersabda: \"Hiasilah Al-Quran dengan suara-suara kalian.\" (Diriwayatkan daripada Al-Bara', semoga Allah merahmatinya)."
  },
  {
    "id": 40292,
    "hadith_number": 2755,
    "tajuk_hadith": "Mengindahkan Al-Quran dengan Suara",
    "perawi_melayu": "Al-Barā' ibn 'Āzib",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ  ، حَدَّثَنَا صَدَقَةُ بْنُ أَبِي عِمْرَانَ  ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ  ، عَنْ زَاذَانَ أَبِي عُمَرَ  ، عَنْ الْبَرَاءِ بْنِ عَازِبٍ  ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" حَسِّنُوا الْقُرْآنَ بِأَصْوَاتِكُمْ، فَإِنَّ الصَّوْتَ الْحَسَنَ يَزِيدُ الْقُرْآنَ حُسْنًا \"",
    "malay_translation": "Muhammad bin Bakr meriwayatkan kepada kami, Sadaqah bin Abi 'Imran meriwayatkan kepada kami, daripada 'Alqamah bin Marthad, daripada Zazan Abu 'Umar, daripada Al-Barā' bin 'Āzib, berkata: Aku mendengar Rasulullah ﷺ bersabda: \"Perindahlah Al-Quran dengan suara-suara kamu, kerana sesungguhnya suara yang baik itu menambahkan keindahan Al-Quran.\""
  },
  {
    "id": 40293,
    "hadith_number": 2756,
    "tajuk_hadith": "Anas Tidak Suka Bacaan dengan Lenggok (Lahn)",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ إِدْرِيسَ  ، عَنْ الْأَعْمَشِ  ، قَالَ :\" قَرَأَ رَجُلٌ عِنْدَ أَنَسٍ بِلَحْنٍ مِنْ هَذِهِ الْأَلْحَانِ، فَكَرِهَ ذَلِكَ أَنَسٌ   \".\nقَالَ أَبُو مُحَمَّد ، وَقَالَ غَيْرُهُ : قَرَأَ غُورَكُ بْنُ أَبِي الْخِضْرِمِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Abdullah bin Sa'id, daripada Abdullah bin Idris, daripada al-A'mash, dia berkata: \"Seorang lelaki membaca di sisi Anas dengan lenggok (lahn) daripada lenggok-lenggok ini, maka Anas membenci perkara itu\". Abu Muhammad berkata, dan selainnya berkata: 'Telah membaca Ghurak bin Abu al-Khidr."
  },
  {
    "id": 40294,
    "hadith_number": 2757,
    "tajuk_hadith": "Pandangan Sahabat Mengenai Alunan dalam Bacaan Al-Quran",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْعَبَّاسُ بْنُ سُفْيَانَ ، عَنْ ابْنِ عُلَيَّةَ ، عَنْ ابْنِ عَوْنٍ ،  عَنْ مُحَمَّدٍ ، قَالَ :\" كَانُوا يَرَوْنَ هَذِهِ الْأَلْحَانَ فِي الْقُرْآنِ مُحْدَثَةً \"",
    "malay_translation": "Telah menceritakan kepada kami Al-'Abbas bin Sufyan, dari Ibnu 'Ulayyah, dari Ibnu 'Aun, dari Muhammad, dia berkata: \"Mereka memandang alunan-alunan (lagu) dalam Al-Quran itu adalah perkara baharu (bid'ah).\""
  }
]
