[
  {
    "id": 39248,
    "hadith_number": 1711,
    "tajuk_hadith": "Keberkatan Waktu Pagi bagi Umatku",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ  ، عَنْ شُعْبَةَ  ، عَنْ يَعْلَى بْنِ عَطَاءٍ  ، عَنْ عُمَارَةَ بْنِ حَدِيدٍ  ، عَنْ صَخْرٍ الْغَامِدِيِّ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" اللَّهُمَّ بَارِكْ لِأُمَّتِي فِي بُكُورِهَا \".\nوَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا بَعَثَ سَرِيَّةً، بَعَثَهَا مِنْ أَوَّلِ النَّهَارِ.\nقَالَ : فَكَانَ هَذَا الرَّجُلُ رَجُلًا تَاجِرًا فَكَانَ يَبْعَثُ غِلْمَانَهُ مِنْ أَوَّلِ النَّهَارِ، فَكَثُرَ مَالُهُ",
    "malay_translation": "Telah menceritakan kepada kami Sa'id bin 'Amir, dari Syu'bah, dari Ya'la bin 'Ata', dari 'Umarah bin Hadid, dari Sakhr al-Ghamidi: Bahawa Rasulullah ﷺ bersabda: \"Ya Allah, berkatilah umatku pada waktu pagi mereka.\" Dan adalah Rasulullah ﷺ apabila mengirim pasukan tentera, beliau mengirimkannya pada awal siang. Dia berkata: Maka lelaki ini adalah seorang pedagang, dan dia mengirimkan budak-budaknya pada awal siang, maka hartanya menjadi banyak."
  },
  {
    "id": 39249,
    "hadith_number": 1712,
    "tajuk_hadith": "Memulakan Perjalanan pada Hari Khamis",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ  ، أَخْبَرَنَا يُونُسُ  ، عَنْ الزُّهْرِيِّ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبٍ  ، عَنْ أَبِيهِ  ، قَالَ : \" لَقَلَّمَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَيَخْرُجُ إِذَا أَرَادَ سَفَرًا إِلَّا يَوْمَ الْخَمِيسِ \"",
    "malay_translation": "Telah menceritakan kepada kami Uthman bin Umar, telah mengkhabarkan kepada kami Yunus, daripada az-Zuhri, daripada Abdurrahman bin Ka'ab, daripada ayahnya, dia berkata: \"Jarang sekali Rasulullah SAW keluar apabila hendak bermusafir kecuali pada hari Khamis.\""
  },
  {
    "id": 39250,
    "hadith_number": 1713,
    "tajuk_hadith": "Sebaik-baik Sahabat dan Jiran di Sisi Allah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ  ، حَدَّثَنَا حَيْوَةُ  ، وَابْنُ لَهِيعَةَ  ، قَالَا : حَدَّثَنَا شُرَحْبِيلُ بْنُ شَرِيكٍ  أَنَّهُ سَمِعَ أَبَا عَبْدِ الرَّحْمَنِ الْحُبُلِيَّ  يُحَدِّثُ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ  ، عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" خَيْرُ الأَصْحَابِ عِنْدَ اللَّهِ خَيْرُهُمْ لِصَاحِبِهِ، وَخَيْرُ الْجِيرَانِ عِنْدَ اللَّهِ خَيْرُهُمْ لِجَارِهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Yazid, telah menceritakan kepada kami Haywah dan Ibn Lahi'ah, mereka berdua berkata: Telah menceritakan kepada kami Syurahbil bin Syarik bahawasanya dia mendengar Abu Abdul Rahman al-Hubuli menceritakan, daripada Abdullah bin 'Amr bin al-'As, daripada Rasulullah صلى الله عليه وسلم, baginda bersabda: \"Sebaik-baik sahabat di sisi Allah adalah yang paling baik kepada sahabatnya, dan sebaik-baik jiran di sisi Allah adalah yang paling baik kepada jirannya.\""
  },
  {
    "id": 39251,
    "hadith_number": 1714,
    "tajuk_hadith": "Bilangan Terbaik Sahabat, Tentera dan Pasukan Peninjau",
    "perawi_melayu": "Ibnu Abbas",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّلْتِ  ، حَدَّثَنَا حِبَّانُ بْنُ عَلِيٍّ  ، عَنْ يُونُسَ  ، وَعُقَيْلٍ  عَنْ ابْنِ شِهَابٍ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ  ، عَنِ ابْنِ عَبَّاسٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" خَيْرُ الأَصْحَابِ أَرْبَعَةٌ، وَخَيْرُ الْجُيُوشِ أَرْبَعَةُ آلَافٍ، وَخَيْرُ السَّرَايَا أَرْبَعُ مِائَةٍ، وَمَا بَلَغَ اثْنَا عَشَرَ أَلْفًا فَصَبَرُوا، وَصَدَقُوا فَغُلِبُوا مِنْ قِلَّةٍ \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin As-Salt, telah menceritakan kepada kami Hibban bin Ali, dari Yunus, dan Uqail dari Ibn Shihab, dari Ubaidullah bin Abdullah, dari Ibnu Abbas, dia berkata: Rasulullah Sallallahu Alaihi Wasallam bersabda: \"Sebaik-baik sahabat adalah empat, dan sebaik-baik tentera adalah empat ribu, dan sebaik-baik pasukan peninjau adalah empat ratus, dan apa sahaja yang mencapai dua belas ribu kemudian mereka bersabar, dan benar, maka mereka akan menang walaupun sedikit.\""
  },
  {
    "id": 39252,
    "hadith_number": 1715,
    "tajuk_hadith": "Pesanan Rasulullah SAW kepada Ketua Pasukan Tentera",
    "perawi_melayu": "Perawi Tidak Diketahui",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ  ، عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ  ، عَنْ أَبِيهِ  ، قَالَ : كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَمَّرَ رَجُلًا عَلَى سَرِيَّةٍ أَوْصَاهُ فِي خَاصَّةِ نَفْسِهِ بِتَقْوَى اللَّهِ، وَبِمَنْ مَعَهُ مِنَ الْمُسْلِمِينَ خَيْرًا، وَقَالَ :\" اغْزُوا بِسْمِ اللَّهِ، وَفِي سَبِيلِ اللَّهِ، قَاتِلُوا مَنْ كَفَرَ بِاللَّهِ، اغْزُوا وَلَا تَغْدِرُوا، وَلَا تَغُلُّوا، وَلَا تُمَثِّلُوا، وَلَا تَقْتُلُوا وَلِيدًا \"",
    "malay_translation": "Muhammad bin Yusuf telah mengkhabarkan kepada kami, daripada Sufyan, daripada ‘Alqamah bin Marthad, daripada Sulaiman bin Buraidah, daripada ayahnya, dia berkata: Adalah Rasulullah SAW apabila melantik seorang lelaki sebagai ketua pasukan tentera, baginda berpesan kepadanya secara khusus untuk dirinya agar bertakwa kepada Allah, dan (berbuat) baik kepada orang-orang Muslim yang bersamanya, dan baginda bersabda: \"Berperanglah dengan nama Allah, dan di jalan Allah, perangilah orang yang kufur kepada Allah. Berperanglah dan janganlah kamu berkhianat, janganlah kamu mengambil harta rampasan perang secara curi, janganlah kamu mencincang mayat, dan janganlah kamu membunuh anak kecil.\""
  },
  {
    "id": 39253,
    "hadith_number": 1716,
    "tajuk_hadith": "Adab Ketika Bertemu Musuh: Jangan Mengharapkan Pertemuan dan Berdoa Keselamatan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ  ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ زِيَادٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ  ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" لَا تَتَمَنَّوْا لِقَاءَ الْعَدُوِّ، وَسَلُوا اللَّهَ الْعَافِيَةَ، فَإِنْ لَقِيتُمُوهُمْ، فَاثْبُتُوا، وَأَكْثِرُوا ذِكْرَ اللَّهِ، فَإِنْ أَجْلَبُوا وَضَجُّوا، فَعَلَيْكُمْ بِالصَّمْتِ \"",
    "malay_translation": "Abdullah bin Yazid telah memberitahu kami, Abdul Rahman bin Ziyad telah meriwayatkan kepada kami, daripada Abdullah bin Yazid, daripada Abdullah bin Amru, bahawa Rasulullah SAW bersabda: \"Janganlah kamu mengharapkan untuk bertemu musuh, dan mintalah keselamatan (keafiatan) kepada Allah. Jika kamu bertemu mereka, maka hendaklah kamu teguh, dan perbanyakkanlah mengingati Allah. Jika mereka membuat bising dan riuh, maka hendaklah kamu berdiam diri.\""
  },
  {
    "id": 39254,
    "hadith_number": 1717,
    "tajuk_hadith": "Doa Rasulullah SAW Semasa Perang Hunain",
    "perawi_melayu": "Diriwayatkan oleh Hajjaj bin Minhal, Hammad, daripada Thabit, daripada Abdul Rahman bin Abi Layla, daripada Suhaib",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا حَجَّاجُ بْنُ مِنْهَالٍ  ، حَدَّثَنَا حَمَّادٌ  ، عَنْ ثَابِتٍ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى  ، عَنْ صُهَيْبٍ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو أَيَّامَ حُنَيْنٍ :\" اللَّهُمَّ بِكَ أُحَاوِلُ، وَبِكَ أُصَاوِلُ، وَبِكَ أُقَاتِلُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Hajjaj bin Minhal, telah menceritakan kepada kami Hammad, daripada Thabit, daripada Abdul Rahman bin Abi Layla, daripada Suhaib: Sesungguhnya Rasulullah SAW berdoa pada hari Hunain: \"Ya Allah, dengan-Mu aku berusaha, dengan-Mu aku menyerang, dan dengan-Mu aku berperang.\""
  },
  {
    "id": 39255,
    "hadith_number": 1718,
    "tajuk_hadith": "Panduan Rasulullah SAW dalam Menghadapi Musuh Musyrikin",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ  ، عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ  ، عَنْ أَبِيهِ  ، قَالَ : كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَمَّرَ رَجُلًا عَلَى سَرِيَّةٍ أَوْصَاهُ :\" إِذَا لَقِيتَ عَدُوَّكَ مِنَ الْمُشْرِكِينَ، فَادْعُهُمْ إِلَى إِحْدَى ثَلَاثِ خِلَالٍ أَوْ ثَلاثِ خِصَالٍ فَأَيَّتُهُمْ مَا أَجَابُوكَ إِلَيْهَا، فَاقْبَلْ مِنْهُمْ وَكُفَّ عَنْهُمْ ثُمَّ ادْعُهُمْ إِلَى الْإِسْلَامِ، فَإِنْ هُمْ أَجَابُوكَ فَاقْبَلْ مِنْهُمْ وَكُفَّ عَنْهُمْ، ثُمَّ ادْعُهُمْ إِلَى التَّحَوُّلِ مِنْ دَارِهِمْ إِلَى دَارِ الْمُهَاجِرِينَ، وَأَخْبِرْهُمْ إِنْ هُمْ فَعَلُوا أَنَّ لَهُمْ مَا لِلْمُهَاجِرِينَ، وَأَنَّ عَلَيْهِمْ مَا عَلَى الْمُهَاجِرِينَ، فَإِنْ هُمْ أَبَوْا، فَأَخْبِرْهُمْ أَنَّهُمْ يَكُونُونَ كَأَعْرَابِ الْمُسْلِمِينَ، يَجْرِي عَلَيْهِمْ حُكْمُ اللَّهِ الَّذِي يَجْرِي عَلَى الْمُؤْمِنِينَ وَلَيْسَ لَهُمْ فِي الْفَيْءِ وَالْغَنِيمَةِ نَصِيبٌ إِلَّا أَنْ يُجَاهِدُوا مَعَ الْمُسْلِمِينَ.\nفَإِنْ هُمْ أَبَوْا أَنْ يَدْخُلُوا فِي الْإِسْلامِ، فَسَلْهُمْ إِعْطَاءَ الْجِزْيَةِ، فَإِنْ فَعَلُوا، فَاقْبَلْ مِنْهُمْ وَكُفَّ عَنْهُمْ، فَإِنْ هُمْ أَبَوْا، فَاسْتَعِنْ بِاللَّهِ وَقَاتِلْهُمْ.\n وَإِنْ حَاصَرْتَ أَهْلَ حِصْنٍ، فَإِنْ أَرَادُوكَ أَنْ تَجْعَلَ لَهُمْ ذِمَّةَ اللَّهِ وَذِمَّةَ نَبِيِّهِ، فَلَا تَجْعَلْ لَهُمْ ذِمَّةَ اللَّهِ، وَلَا ذِمَّةَ نَبِيِّهِ، وَلَكِنْ اجْعَلْ لَهُمْ ذِمَّتَكَ وَذِمَّةَ أَبِيكَ، وَذِمَّةَ أَصْحَابِكَ، فَإِنَّكُمْ إِنْ تُخْفِرُوا بِذِمَّتِكُمْ وَذِمَّةِ آبَائِكُمْ، أَهْوَنُ عَلَيْكُمْ مِنْ أَنْ تُخْفِرُوا ذِمَّةَ اللَّهِ وَذِمَّةَ رَسُولِهِ.\nوَإِنْ حَاصَرْتَ حِصْنًا فَأَرَادُوكَ أَنْ يَنْزِلُوا عَلَى حُكْمِ اللَّهِ، فَلَا تُنْزِلْهُمْ عَلَى حُكْمِ اللَّهِ، وَلَكِنْ أَنْزِلْهُمْ عَلَى حُكْمِكَ، فَإِنَّكَ لَا تَدْرِي أَتُصِيبُ حُكْمَ اللَّهِ فِيهِمْ أَمْ لا، ثُمَّ اقْضِ فِيهِمْ بِمَا شِئْتَ \".\nقَالَ عَلْقَمَةُ  : فَحَدَّثْتُ بِهِ مُقَاتِلَ بْنَ حَيَّانَ  ، فَقَالَ : حَدَّثَنِي مُسْلِمُ بْنُ هَيْصَمٍ  ، عَنِ النُّعْمَانِ بْنِ مُقَرِّنٍ   ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ",
    "malay_translation": "Muhammad bin Yusuf memberitahu kami, daripada Sufyan, daripada 'Alqamah bin Marthad, daripada Sulaiman bin Buraidah, daripada ayahnya, dia berkata: Rasulullah SAW apabila melantik seseorang sebagai ketua pasukan tentera, baginda berpesan kepadanya: 'Apabila kamu bertemu musuhmu dari kalangan musyrikin, serulah mereka kepada salah satu daripada tiga perkara atau tiga sifat. Mana-mana sahaja yang mereka terima daripadamu, terimalah daripada mereka dan tahanlah diri daripada mereka. Kemudian serulah mereka kepada Islam. Jika mereka menerima, terimalah daripada mereka dan tahanlah diri daripada mereka. Kemudian serulah mereka untuk berpindah dari negeri mereka ke negeri Muhajirin, dan beritahu mereka jika mereka melakukannya, mereka akan mendapat apa yang didapati oleh Muhajirin dan mereka akan menanggung apa yang ditanggung oleh Muhajirin. Jika mereka enggan, beritahu mereka bahawa mereka akan menjadi seperti orang Arab Badwi Muslim, hukum Allah yang berlaku kepada orang-orang mukmin akan berlaku kepada mereka, dan mereka tidak mempunyai bahagian dalam *fay'* dan *ghanimah* kecuali jika mereka berjihad bersama kaum Muslimin.\n\nJika mereka enggan untuk masuk Islam, maka mintalah daripada mereka untuk membayar *jizyah*. Jika mereka melakukannya, terimalah daripada mereka dan tahanlah diri daripada mereka. Jika mereka enggan, maka mohonlah pertolongan Allah dan perangilah mereka.\n\nDan jika kamu mengepung penduduk kubu, kemudian mereka ingin kamu memberikan jaminan Allah dan jaminan Nabi-Nya kepada mereka, maka janganlah kamu memberikan jaminan Allah, dan jangan pula jaminan Nabi-Nya. Akan tetapi berikanlah kepada mereka jaminanmu dan jaminan ayahmu, dan jaminan sahabat-sahabatmu. Kerana sesungguhnya jika kamu melanggar jaminanmu dan jaminan ayah-ayahmu, ia lebih ringan ke atas kamu daripada kamu melanggar jaminan Allah dan jaminan Rasul-Nya.\n\nDan jika kamu mengepung kubu, kemudian mereka ingin kamu menurunkan mereka kepada hukum Allah, maka janganlah kamu menurunkan mereka kepada hukum Allah, akan tetapi turunkanlah mereka kepada hukummu. Kerana sesungguhnya kamu tidak tahu adakah kamu menepati hukum Allah dalam urusan mereka atau tidak, kemudian putuskanlah terhadap mereka dengan apa yang kamu kehendaki.'\n\n'Alqamah berkata: Lalu aku menceritakan hadis ini kepada Muqatil bin Hayyan, lalu dia berkata: Muslim bin Haysam telah menceritakan kepadaku, daripada Nu'man bin Muqarrin, daripada Nabi SAW yang serupa dengannya.'"
  },
  {
    "id": 39256,
    "hadith_number": 1719,
    "tajuk_hadith": "Seruan Kepada Islam Sebelum Peperangan",
    "perawi_melayu": "Para Perawi Hadis",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، عَنْ سُفْيَانَ  ، عَنْ ابْنِ أَبِي نَجِيحٍ  ، عَنْ أَبِيهِ  ، عَنِ ابْنِ عَبَّاسٍ  ، قَالَ :\" مَا قَاتَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَوْمًا حَتَّى دَعَاهُمْ \"، قَالَ عَبْد اللَّهِ : سُفْيَانُ لَمْ يَسْمَعْ مِنْ ابْنِ أَبِي نَجِيحٍ يَعْنِي : هَذَا الْحَدِيثَ",
    "malay_translation": "Telah mengkhabarkan kepada kami Ubaidullah bin Musa, daripada Sufyan, daripada Ibn Abi Najih, daripada bapanya, daripada Ibn Abbas, dia berkata: \"Rasulullah SAW tidak memerangi suatu kaum sehingga baginda menyeru mereka (kepada Islam).\" Abdullah berkata: Sufyan tidak mendengar daripada Ibn Abi Najih, iaitu: hadis ini."
  },
  {
    "id": 39257,
    "hadith_number": 1720,
    "tajuk_hadith": "Nabi SAW Menyerang Musuh Selepas Subuh dan Mendengar Azan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ ثَابِتٍ  ، عَنْ أَنَسٍ   : أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ\" يُغِيرُ عِنْدَ صَلَاةِ الْفَجْرِ، وَكَانَ يَسْتَمِعُ، فَإِنْ سَمِعَ أَذَانًا، أَمْسَكَ، وَإِنْ لَمْ يَسْمَعْ أَذَانًا، أَغَارَ \"",
    "malay_translation": "Hajjaj bin Minhal meriwayatkan kepada kami, Hammad bin Salamah meriwayatkan kepada kami, daripada Thabit, daripada Anas: Bahawa Nabi SAW biasanya menyerang (musuh) pada waktu solat Subuh, dan Baginda akan mendengar. Jika Baginda mendengar azan, Baginda akan menahan diri, dan jika Baginda tidak mendengar azan, Baginda akan menyerang."
  },
  {
    "id": 39258,
    "hadith_number": 1721,
    "tajuk_hadith": "Keutamaan Kalimah Syahadah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا هَاشِمُ بْنُ الْقَاسِمِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ النُّعْمَانِ بْنِ سَالِمٍ  ، قَالَ : سَمِعْتُ أَوْسَ بْنَ أَبِي أَوْسٍ الثَّقَفِيَّ  ، قَالَ : أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي وَفْدِ ثَقِيفٍ، قَالَ : وَكُنْتُ فِي أَسْفَلِ الْقُبَّةِ لَيْسَ فِيهَا أَحَدٌ إِلا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَائِمٌ إِذْ أَتَاهُ رَجُلٌ فَسَارَّهُ، فَقَالَ : \" اذْهَبْ فَاقْتُلْهُ \"، ثُمَّ قَالَ : \" أَلَيْسَ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ؟ \".\nقَالَ شُعْبَةُ : وَأَشُكُّ مُحَمَّدًا رَسُولُ اللَّهِ؟.\nقَالَ : بَلَى.\nقَالَ :\" إِنِّي أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا : لَا إِلَهَ إِلَّا اللَّهُ، فَإِذَا قَالُوهَا، حَرُمَتْ عَلَيَّ دِمَاؤُهُمْ وَأَمْوَالُهُمْ إِلا بِحَقِّهَا \".\n قَالَ : وَهُوَ الَّذِي قَتَلَ أَبَا مَسْعُودٍ.\nقَالَ : وَمَا مَاتَ حَتَّى قَتَلَ خَيْرَ إِنْسَانٍ بِالطَّائِفِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Hasyim bin al-Qasim, telah menceritakan kepada kami Syu'bah, daripada Nu'man bin Salim, dia berkata: Saya mendengar Aus bin Abi Aus ath-Thaqafi berkata: Saya datang kepada Rasulullah SAW bersama rombongan dari Thaqif. Dia berkata: Saya berada di bahagian bawah kubah, dan tidak ada sesiapa pun di dalamnya kecuali Nabi SAW yang sedang tidur. Tiba-tiba seorang lelaki datang dan berbisik kepada Baginda. Baginda bersabda: \"Pergi dan bunuh dia.\" Kemudian Baginda bertanya: \"Bukankah dia bersaksi bahawa tiada tuhan melainkan Allah?\" Syu'bah berkata: Dan saya ragu (adakah sabda Nabi) 'Muhammad utusan Allah'? Dia berkata: Ya, (dia bersaksi). Baginda bersabda: \"Sesungguhnya aku diperintahkan untuk memerangi manusia sehingga mereka mengucapkan: Tiada tuhan melainkan Allah. Apabila mereka telah mengucapkannya, maka terpeliharalah darah dan harta mereka dariku, kecuali dengan haknya.\" Dia berkata: Dan dialah orang yang membunuh Abu Mas'ud. Dia berkata: Dan dia tidak mati sehingga dia membunuh sebaik-baik manusia di Ta'if."
  },
  {
    "id": 39259,
    "hadith_number": 1722,
    "tajuk_hadith": "Haram Menumpahkan Darah Seorang Muslim Kecuali dalam Tiga Keadaan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَعْلَى  ، حَدَّثَنَا الْأَعْمَشُ  ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ  ، عَنْ مَسْرُوقٍ  ، عَنْ عَبْدِ اللَّهِ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَا يَحِلُّ دَمُ رَجُلٍ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ إِلَّا إِحْدَى ثَلَاثَةِ نَفَرٍ : النَّفْسُ بِالنَّفْسِ، وَالثَّيِّبُ الزَّانِي، وَالتَّارِكُ لِدِينِهِ الْمُفَارِقُ لِلْجَمَاعَةِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ya'la, telah menceritakan kepada kami al-A'mash, daripada Abdullah bin Murrah, daripada Masruq, daripada Abdullah, dia berkata: Rasulullah SAW bersabda: \"Tidak halal (haram) menumpahkan darah seorang lelaki yang bersaksi bahawa tiada tuhan melainkan Allah kecuali salah satu daripada tiga golongan: jiwa dengan jiwa (qisas), orang yang sudah berkahwin yang berzina, dan orang yang meninggalkan agamanya serta memisahkan diri dari jemaah (komuniti Muslim).\""
  },
  {
    "id": 39260,
    "hadith_number": 1723,
    "tajuk_hadith": "Perutusan Tentera dan Seruan Solat Berjamaah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا الْأَسْوَدُ بْنُ شَيْبَانَ  ، عَنْ خَالِدِ بْنِ سُمَيْرٍ  ، قَالَ : قَدِمَ عَلَيْنَا عَبْدُ اللَّهِ بْنُ رَبَاحٍ الْأَنْصَارِيُّ  ، وَكَانَتْ الْأَنْصَارُ تُفَقِّهُهُ.\nقَالَ : حَدَّثَنَا أَبُو قَتَادَةَ   : أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \" بَعَثَ جَيْشَ الْأُمَرَاءِ، قَالَ : فَانْطَلَقُوا فَلَبِثُوا مَا شَاءَ اللَّهُ، ثُمَّ صَعِدَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمِنْبَرَ،فَأَمَرَ فَنُودِيَ : الصَّلَاةُ جَامِعَةٌ \"",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Al-Aswad bin Syaiban, dari Khalid bin Sumair, dia berkata: Abdullah bin Rabah Al-Ansari datang kepada kami, dan kaum Ansar memahaminya (dalam agama).\nDia berkata: Telah menceritakan kepada kami Abu Qatadah: Bahawa Rasulullah SAW telah mengutus pasukan tentera. Dia berkata: Lalu mereka pergi dan tinggal selama yang Allah kehendaki, kemudian Rasulullah SAW naik ke mimbar, lalu baginda memerintahkan dan diseru: \"As-Solatu Jami'ah (Solat Berjamaah)\"."
  },
  {
    "id": 39261,
    "hadith_number": 1724,
    "tajuk_hadith": "Pemberi Nasihat Adalah Amanah",
    "perawi_melayu": "Al-Aswad bin Amir",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْأَسْوَدُ بْنُ عَامِرٍ  ، حَدَّثَنَا شَرِيكٌ  ، عَنْ الْأَعْمَشِ  ، عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ  ، عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيّ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" الْمُسْتَشَارُ مُؤْتَمَنٌ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Aswad bin Amir, telah menceritakan kepada kami Syarik, daripada al-A'mash, daripada Abu 'Amru al-Shaibani, daripada Abu Mas'ud al-Ansari, daripada Nabi Muhammad صلى الله عليه وسلم, baginda bersabda: \"Orang yang diminta nasihat adalah seorang yang amanah.\""
  },
  {
    "id": 39262,
    "hadith_number": 1725,
    "tajuk_hadith": "Rasulullah SAW Mengisyaratkan Tujuan yang Berbeza Ketika Hendak Berperang",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَزِيدَ الْحِزَامِيُّ  ، حَدَّثَنَا ابْنُ الْمُبَارَكِ  ، عَنْ مَعْمَرٍ  ، عَنْ الزُّهْرِيِّ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ  ، عَنْ كَعْبِ بْنِ مَالِكٍ  ، قَالَ : كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" إِذَا أَرَادَ غَزْوَةً وَرَّى بِغَيْرِهَا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Yazid al-Hizami, telah menceritakan kepada kami Ibn al-Mubarak, daripada Ma'mar, daripada al-Zuhri, daripada Abd al-Rahman bin Ka'b bin Malik, daripada Ka'b bin Malik, dia berkata: \"Rasulullah SAW apabila ingin berperang, Baginda mengisyaratkan ke arah lain (tidak secara terus terang tujuan sebenar).\""
  },
  {
    "id": 39263,
    "hadith_number": 1726,
    "tajuk_hadith": "Ganjaran Rampasan Perang dan Slogan dalam Peperangan",
    "perawi_melayu": "Salamah bin Al-Akwa'",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاق بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا وَكِيعٌ  ، عَنْ أَبِي عُمَيْسٍ  ، عَنْ إِيَاسِ بْنِ سَلَمَةَ بْنِ الْأَكْوَعِ  ، عَنْ أَبِيهِ  ، قَالَ : \" بَارَزْتُ رَجُلًا فَقَتَلْتُهُ،فَنَفَّلَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَلَبَهُ ، فَكَانَ شِعَارُنَا مَعَ خَالِدِ بْنِ الْوَلِيدِ : أَمِتْ، يَعْنِي : اقْتُلْ \"",
    "malay_translation": "Telah menceritakan kepada kami Ishaq bin Ibrahim, telah menceritakan kepada kami Waki', dari Abu Umais, dari Iyas bin Salamah bin Al-Akwa', dari ayahnya, dia berkata: \"Saya berduel dengan seorang lelaki lalu saya membunuhnya, kemudian Rasulullah SAW memberikan harta rampasannya kepada saya, dan slogan kami bersama Khalid bin Al-Walid adalah: 'Amit', yaitu: 'Bunuhlah'."
  },
  {
    "id": 39264,
    "hadith_number": 1727,
    "tajuk_hadith": "Kisah Perang Hunain dan Mukjizat Rasulullah SAW dengan Tanah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ  ، وَعَفَّانُ  ، قَالَا : حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ يَعْلَى بْنِ عَطَاءٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ يَسَارٍ أَبِي هَمَّامٍ  ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْفِهْرِيِّ  ، قَالَ : كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ حُنَيْنٍ، فَكُنَّا فِي يَوْمٍ قَائِظٍ شَدِيدِ الْحَرِّ، فَنَزَلْنَا تَحْتَ ظِلَالِ الشَّجَرِ، .\n..\n..\n. فَذَكَرَ الْقِصَّةَ، ثُمَّ أَخَذَ كَفًّا مِنْ تُرَابٍ، قَالَ : فَحَدَّثَنِي الَّذِي هُوَ أَقْرَبُ إِلَيْهِ مِنِّي أَنَّهُ ضَرَبَ بِهِ وُجُوهَهُمْ، وَقَالَ :\" شَاهَتِ الْوُجُوهُ \" فَهَزَمَ اللَّهُ الْمُشْرِكِينَ.\nقَالَ يَعْلَى : فَحَدَّثَنِي أَبْنَاؤُهُمْ أَنَّ أَبَاءَهُمْ.\nقَالُوا : فَمَا بَقِيَ مِنَّا أَحَدٌ إِلا امْتَلَأَتْ عَيْنَاهُ وَفَمُهُ تُرَابًا",
    "malay_translation": "Telah menceritakan kepada kami Hajjaj bin Minhal, dan Affan, mereka berdua berkata: Telah menceritakan kepada kami Hammad bin Salamah, dari Ya'la bin Ata', dari Abdullah bin Yasar Abu Hammam, dari Abu Abdurrahman al-Fihri, dia berkata: Kami pernah bersama Rasulullah SAW dalam Perang Hunain, dan kami berada pada hari yang sangat panas terik, lalu kami turun di bawah naungan pepohonan. ... lalu dia menyebutkan kisah tersebut, kemudian beliau mengambil segenggam tanah, dia berkata: Lalu telah menceritakan kepadaku orang yang lebih dekat kepadanya daripadaku bahawa beliau memukulkan tanah itu ke wajah mereka, dan bersabda: \"Jeleklah wajah-wajah itu!\" maka Allah mengalahkan orang-orang musyrik. Ya'la berkata: Telah menceritakan kepadaku anak-anak mereka bahawa bapa-bapa mereka berkata: Maka tidak ada seorang pun dari kami kecuali kedua mata dan mulutnya penuh dengan tanah."
  },
  {
    "id": 39265,
    "hadith_number": 1728,
    "tajuk_hadith": "Bai'at untuk Tidak Menyekutukan Allah dan Meninggalkan Dosa-dosa Besar",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ  ، حَدَّثَنَا يُونُسُ  ، عَنْ الزُّهْرِيِّ  ، عَنْ أَبِي إِدْرِيسَ  ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ  ، قَالَ : قَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ مَعَهُ فِي مَجْلِسٍ :\" بَايِعُونِي عَلَى أَنْ لا تُشْرِكُوا بِاللَّهِ شَيْئًا، وَلَا تَسْرِقُوا، وَلَا تَزْنُوا، وَلَا تَقْتُلُوا أَوْلَادَكُمْ، وَلَا تَأْتُوا بِبُهْتَانٍ تَفْتَرُونَهُ بَيْنَ أَيْدِيكُمْ وَأَرْجُلِكُمْ، فَمَنْ وَفَى مِنْكُمْ، فَأَجْرُهُ عَلَى اللَّهِ، وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا، فَسَتَرَهُ اللَّهُ، فَأَمْرُهُ إِلَى اللَّهِ، إِنْ شَاءَ، عَاقَبَهُ، وَإِنْ شَاءَ عَفَا عَنْهُ، وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا فَعُوقِبَ بِهِ فِي الدُّنْيَا، فَهُوَ كَفَّارَةٌ لَهُ \".\nقَالَ : فَبَايَعْنَاهُ عَلَى ذَلِكَ",
    "malay_translation": "Uthman bin Umar meriwayatkan kepada kami, Yunus meriwayatkan kepada kami, daripada az-Zuhri, daripada Abu Idris, daripada Ubadah bin as-Samit, dia berkata: Rasulullah ﷺ bersabda kepada kami ketika kami bersama baginda dalam suatu majlis: \"Berbai'atlah kamu kepadaku untuk tidak menyekutukan Allah dengan sesuatu pun, tidak mencuri, tidak berzina, tidak membunuh anak-anak kamu, dan tidak membuat kebohongan yang kamu ada-adakan antara tangan dan kaki kamu. Barangsiapa di antara kamu yang menunaikannya, maka pahalanya atas Allah. Barangsiapa yang melakukan sesuatu daripada hal itu lalu Allah menutupinya, maka urusannya kepada Allah. Jika Dia kehendaki, Dia akan mengazabnya, dan jika Dia kehendaki, Dia akan mengampuninya. Dan barangsiapa yang melakukan sesuatu daripada hal itu lalu dihukum kerananya di dunia, maka itu adalah kafarah baginya.\" Dia (Ubadah) berkata: Maka kami berbai'at kepada baginda atas hal itu."
  },
  {
    "id": 39266,
    "hadith_number": 1729,
    "tajuk_hadith": "Bai'ah Hudaibiyah dan Janji Tidak Melarikan Diri",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ  ، عَنْ أَبِي الزُّبَيْرِ  ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ  ، أَنَّهُ قَالَ :\" كُنَّا يَوْمَ الْحُدَيْبِيَةِ أَلْفًا وَأَرْبَعَ مِائَةٍ، فَبَايَعْنَاهُ وَعُمَرُ آخِذٌ بِيَدِهِ تَحْتَ الشَّجَرَةِ وَهِيَ : سَمُرَةٌ ، وَقَالَ : بَايَعْنَاهُ عَلَى أَنْ لَا نَفِرّ، وَلَمْ نُبَايِعْهُ عَلَى الْمَوْتِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ahmad bin Abdullah, telah menceritakan kepada kami Laith bin Saad, daripada Abu Zubair, daripada Jabir bin Abdullah, bahawa beliau berkata: \"Kami bersama Rasulullah SAW pada hari Hudaibiyah seramai seribu empat ratus orang, maka kami berbai'ah (berjanji setia) kepadanya dan Umar RA memegang tangannya di bawah pokok, iaitu pokok Samurah, dan baginda SAW bersabda: Kami berbai'ah kepadanya untuk tidak melarikan diri, dan kami tidak berbai'ah kepadanya untuk mati.\""
  },
  {
    "id": 39267,
    "hadith_number": 1730,
    "tajuk_hadith": "Rasulullah SAW Membawa Tanah pada Hari Ahzab",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا شُعْبَةُ  ، حَدَّثَنَا أَبُو إِسْحَاق  ، قَالَ : سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ  ، يَقُولُ : كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْقُلُ مَعَنَا التُّرَابَ يَوْمَ الْأَحْزَابِ، وَقَدْ \" وَارَى التُّرَابُبَيَاضَ إِبِطَيْهِ \"، وَهُوَ يَقُولُ : اللَّهُمَّ لَوْلَا أَنْتَ مَا اهْتَدَيْنَا وَلَا تَصَدَّقْنَا وَلَا صَلَّيْنَا فَأَنْزِلَنَّ سَكِينَةً عَلَيْنَا وَثَبِّتْ الْأَقْدَامَ إِنْ لَاقَيْنَا إِنَّ الْأُلَى قَدْ بَغَوْا عَلَيْنَا وَإِنْ أَرَادُوا فِتْنَةً أَبَيْنَا وَيَرْفَعُ بِهَا صَوْتَهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu al-Walid, telah menceritakan kepada kami Syu'bah, telah menceritakan kepada kami Abu Ishaq, dia berkata: Saya mendengar al-Bara' bin Azib berkata: Rasulullah SAW membawa tanah bersama kami pada hari al-Ahzab, dan sungguh \"tanah menutupi putih ketiaknya,\" dan baginda bersabda: Ya Allah, jika bukan kerana Engkau, kami tidak akan mendapat petunjuk, tidak bersedekah, dan tidak solat. Maka turunkanlah ketenangan kepada kami, dan teguhkanlah kaki kami jika kami bertemu (musuh). Sesungguhnya mereka telah melampaui batas kepada kami, dan jika mereka menginginkan fitnah, kami menolak. Dan baginda mengangkat suaranya dengan itu."
  },
  {
    "id": 39268,
    "hadith_number": 1731,
    "tajuk_hadith": "Perintah Membunuh Ibn Khatal di Kaabah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ خَالِدِ بْنِ حَازِمٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ الزُّهْرِيِّ  ، عَنْ أَنَسٍ   : أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ مَكَّةَ عَامَ الْفَتْحِ وَعَلَى رَأْسِهِ مِغْفَرٌ، فَلَمَّا نَزَعَهُ، جَاءَهُ رَجُلٌ، فَقَالَ : يَا رَسُولَ اللَّهِ،\" هَذَا ابْنُ خَطَلٍ مُتَعَلِّقٌ بِأَسْتَارِ الْكَعْبَةِ ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : اقْتُلُوهُ \"",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Khalid bin Hazim, telah menceritakan kepada kami Malik, dari Az-Zuhri, dari Anas: Bahawa Nabi SAW memasuki Mekah pada tahun pembukaan (Mekah) dan di kepalanya terdapat topi besi. Ketika baginda membukanya, datanglah seorang lelaki dan berkata: Wahai Rasulullah, ini adalah Ibnu Khatal yang sedang berpegangan pada kain Kaabah. Maka Rasulullah SAW bersabda: Bunuhlah dia."
  },
  {
    "id": 39269,
    "hadith_number": 1732,
    "tajuk_hadith": "Hulu Pedang Nabi SAW Diperbuat daripada Perak",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ  ، عَنْ قَتَادَةَ  ،  عَنْ أَنَسٍ  ، قَالَ : \" كَانَقَبِيعَةُ سَيْفِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ فِضَّةٍ \".\n قَالَ عَبْد اللَّهِ : هِشَامٌ الدَّسْتَوَائِيُّ  خَالَفَهُ.\nقَالَ : قَتَادَةُ  ، عَنْ سَعِيدِ بْنِ أَبِي الْحَسَنِ   ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَزَعَمَ النَّاسُ أَنَّهُ هُوَ الْمَحْفُوظُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Nu'man, telah menceritakan kepada kami Jarir bin Hazim, daripada Qatadah, daripada Anas, dia berkata: \"Hulu pedang Nabi SAW adalah daripada perak.\" Abdullah berkata: Hisyam ad-Dastawa'i menyalahinya. Qatadah berkata: Daripada Sa'id bin Abi al-Hasan, daripada Nabi SAW, dan orang ramai mendakwa bahawa ia adalah yang terpelihara."
  },
  {
    "id": 39270,
    "hadith_number": 1733,
    "tajuk_hadith": "Nabi SAW Suka Tinggal Tiga Hari di Perkampungan Kaum yang Ditakluki",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْمُعَلَّى بْنُ أَسَدٍ  ، حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ  ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ  ، عَنْ قَتَادَةَ  ، عَنْ أَنَسٍ  ، عَنْ أَبِي طَلْحَةَ   : أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ \" إِذَا ظَهَرَ عَلَى قَوْمٍأَحَبَّ أَنْ يُقِيمَ بِعَرْصَتِهِمْ ثَلَاثًا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Mu'alla bin Asad, telah menceritakan kepada kami Mu'az bin Mu'az, telah menceritakan kepada kami Sa'id bin Abi Arubah, daripada Qatadah, daripada Anas, daripada Abu Talhah: Sesungguhnya Nabi SAW adalah \"apabila baginda berjaya menakluki sesuatu kaum, baginda suka untuk tinggal di perkampungan mereka selama tiga hari.\""
  },
  {
    "id": 39271,
    "hadith_number": 1734,
    "tajuk_hadith": "Rasulullah SAW Membakar Kebun Kurma Bani Nadhir",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ  ، حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ  ، حَدَّثَنَا عُبَيْدُ اللَّهِ  ، عَنْ نَافِعٍ  ، عَنِ ابْنِ عُمَرَ  ، قَالَ :\" حَرَّقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَخْلَ بَنِي النَّضِيرِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Sa'id, telah menceritakan kepada kami Uqbah bin Khalid, telah menceritakan kepada kami Ubaidullah, dari Nafi', dari Ibn Umar, dia berkata: \"Rasulullah SAW membakar kebun kurma Bani Nadhir.\""
  },
  {
    "id": 39272,
    "hadith_number": 1735,
    "tajuk_hadith": "Larangan Menyeksa dengan Api Kecuali Allah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ بْنِ أَبَانَ  ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ  ، عَنْ مُحَمَّدِ بْنِ إِسْحَاق  ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ  ، عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ  ، عَنْ أَبِي إِسْحَاق الدَّوْسِيِّ  ، عَنْ أَبِي هُرَيْرَةَ الدَّوْسِيِّ  ، قَالَ : بَعَثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَرِيَّةٍ، فَقَالَ : \" إِنْ ظَفِرْتُمْ بِفُلَانٍ وَفُلَانٍ فَحَرِّقُوهُمَا بِالنَّارِ \" حَتَّى إِذَا كَانَ الْغَدُ، بَعَثَ إِلَيْنَا، فَقَالَ :\" إِنِّي قَدْ كُنْتُ أَمَرْتُكُمْ بِتَحْرِيقِ هَذَيْنِ الرَّجُلَيْنِ، ثُمَّ رَأَيْتُ أَنَّهُ لَا يَنْبَغِي لِأَحَدٍ أَنْ يُعَذِّبَ بِالنَّارِ إِلَّا اللَّهُ، فَإِنْ ظَفِرْتُمْ بِهِمَا، فَاقْتُلُوهُمَا \"",
    "malay_translation": "Abdullah bin Umar bin Aban memberitahu kami, Abdul Rahim bin Sulaiman menceritakan kepada kami, daripada Muhammad bin Ishaq, daripada Yazid bin Abi Habib, daripada Bukair bin Abdullah bin Al-Asyaj, daripada Abu Ishaq Ad-Dausi, daripada Abu Hurairah Ad-Dausi, dia berkata: Rasulullah SAW mengutus kami dalam satu pasukan tentera, dan bersabda: \"Jika kamu menangkap si fulan dan si fulan, maka bakarlah mereka berdua dengan api.\" Sehingga ketika keesokan harinya, baginda mengutus kepada kami, dan bersabda: \"Sesungguhnya aku telah memerintahkan kamu untuk membakar dua orang lelaki ini, kemudian aku melihat bahawa tidak sepatutnya bagi sesiapa pun untuk menyeksa dengan api kecuali Allah. Jika kamu menangkap mereka berdua, maka bunuhlah mereka berdua.\""
  },
  {
    "id": 39273,
    "hadith_number": 1736,
    "tajuk_hadith": "Larangan Membunuh Wanita dan Kanak-Kanak dalam Peperangan",
    "perawi_melayu": "Rantaian perawi disebut dalam teks Arab",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ  ، عَنْ عَلِيِّ بْنِ مُسْهِرٍ  ، عَنْ عُبَيْدِ اللَّهِ هُوَ : ابْنُ عُمَرَ بْنِ حَفْصِ بْنِ عَاصِمٍ  ، عَنْ نَافِعٍ  ، عَنِ ابْنِ عُمَرَ  ، قَالَ : وُجِدَ فِي بَعْضِ مَغَازِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ امْرَأَةٌ مَقْتُولَةٌ \" فَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْقَتْلِ النِّسَاءِ وَالصِّبْيَانِ \"",
    "malay_translation": "Muhammad bin Uyainah memberitahu kami, daripada Ali bin Mushir, daripada Ubaidillah iaitu: Ibn Umar bin Hafs bin Asim, daripada Nafi', daripada Ibn Umar, dia berkata: Didapati dalam beberapa peperangan Rasulullah SAW seorang wanita terbunuh, maka Rasulullah SAW melarang membunuh wanita dan kanak-kanak."
  },
  {
    "id": 39274,
    "hadith_number": 1737,
    "tajuk_hadith": "Larangan Membunuh Zuriat dalam Peperangan",
    "perawi_melayu": "Asim bin Yusuf, Abu Ishaq al-Fazari, Yunus bin Ubaid, al-Hasan, al-Aswad bin Sari'",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَاصِمُ بْنُ يُوسُفَ  ، حَدَّثَنَا أَبُو إِسْحَاق الْفَزَارِيُّ  ، عَنْ يُونُسَ بْنِ عُبَيْدٍ  ، عَنْ الْحَسَنِ  ، عَنِ الْأَسْوَدِ بْنِ سَرِيعٍ  ، قَالَ : خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزَاةٍ فَظَفِرَ بِالْمُشْرِكِينَ فَأَسْرَعَ النَّاسُ فِي الْقَتْلِ حَتَّى قَتَلُوا الذُّرِّيَّةَ، فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ :\" مَا بَالُ أَقْوَامٍ ذَهَبَ بِهِمْ الْقَتْلُ حَتَّى قَتَلُوا الذُّرِّيَّةَ؟ أَلا لا تُقْتَلَنَّ ذُرِّيَّةً ثَلَاثًا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Asim bin Yusuf, telah menceritakan kepada kami Abu Ishaq al-Fazari, daripada Yunus bin Ubaid, daripada al-Hasan, daripada al-Aswad bin Sari', dia berkata: Kami keluar bersama Rasulullah SAW dalam peperangan, lalu kami berjaya menewaskan orang-orang musyrik. Orang ramai segera membunuh sehingga mereka membunuh zuriat (anak-anak). Berita itu sampai kepada Nabi SAW, lalu Baginda bersabda: \"Kenapa ada kaum yang terlalu ghairah membunuh sehingga mereka membunuh zuriat? Ketahuilah, janganlah kamu membunuh zuriat,\" Baginda mengulanginya tiga kali."
  },
  {
    "id": 39275,
    "hadith_number": 1738,
    "tajuk_hadith": "Ujian Kematangan pada Hari Quraizah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ  ، عَنْ عَطِيَّةَ الْقُرَظِيِّ  ، قالَ :\" عُرِضْنَا عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَئِذٍ، فَمَنْ أَنْبَتَ الشَّعْرَ، قُتِلَ، وَمَنْ لَمْ يُنْبِتْ، تُرِكَ \"، فَكُنْتُ أَنَا مِمَّنْ لَمْ يُنْبِتْ الشَّعْرَ، فَلَمْ يَقْتُلُونِي.\nيَعْنِي : يَوْمَ قُرَيْظَةَ",
    "malay_translation": "Muhammad bin Yusuf telah memberitahu kami, daripada Sufyan, daripada Abdul Malik bin Umair, daripada Atiyyah al-Qurazi, dia berkata: \"Kami telah dibawa di hadapan Nabi صلى الله عليه وسلم pada hari itu, sesiapa yang telah tumbuh rambut kemaluan, dibunuh, dan sesiapa yang belum tumbuh, dibiarkan.\" Aku adalah antara mereka yang belum tumbuh rambut kemaluan, jadi mereka tidak membunuhku. Maksudnya: hari (perang) Quraizah."
  },
  {
    "id": 39276,
    "hadith_number": 1739,
    "tajuk_hadith": "Membebaskan Tawanan dan Memberi Makan Orang Lapar",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ مَنْصُورٍ  ، عَنْ أَبِي وَائِلٍ  ، عَنْ أَبِي مُوسَى  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :\" فُكُّوا الْعَانِيَ وَأَطْعِمُوا الْجَائِعَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Yusuf, daripada Sufyan, daripada Mansur, daripada Abu Wail, daripada Abu Musa, daripada Nabi ﷺ, baginda bersabda: \"Lepaskanlah tawanan dan berilah makan kepada orang yang lapar.\""
  },
  {
    "id": 39277,
    "hadith_number": 1740,
    "tajuk_hadith": "Rasulullah SAW Menebus Seorang Lelaki dengan Dua Orang Lelaki",
    "perawi_melayu": "Perawi Tidak Diketahui",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، عَنْ أَيُّوبَ  ، عَنْ أَبِي قِلَابَةَ  ، عَنْ أَبِي الْمُهَلَّبِ  ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" فَادَى رَجُلًا بِرَجُلَيْنِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Nu'aim, telah menceritakan kepada kami Hammad bin Zaid, daripada Ayyub, daripada Abu Qilabah, daripada Abu Muhallab, daripada Imran bin Husain RA: Bahawa Rasulullah SAW telah menebus seorang lelaki dengan dua orang lelaki."
  },
  {
    "id": 39278,
    "hadith_number": 1741,
    "tajuk_hadith": "Keistimewaan Nabi Muhammad SAW",
    "perawi_melayu": "Yahya bin Hammad, Abu 'Awanah, Sulaiman, Mujahid, Ubaid bin Umair, Abu Dzar",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ حَمَّادٍ  ، حَدَّثَنَا أَبُو عَوَانَةَ  ، عَنْ سُلَيْمَانَ  ، عَنْ مُجَاهِدٍ  ، عَنْ عُبَيْدِ بْنِ عُمَيْرٍ  ، عَنْ أَبِي ذَرٍّ   : أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" أُعْطِيتُ خَمْسًا لَمْ يُعْطَهُنَّ نَبِيٌّ قَبْلِي : بُعِثْتُ إِلَى الْأَحْمَرِ وَالْأَسْوَدِ، وَجُعِلَتْ لِيَ الْأَرْضُ مَسْجِدًا وَطَهُورًا وَأُحِلَّتْ لِيَ الْغَنَائِمُ، وَلَمْ تَحِلَّ لِأَحَدٍ قَبْلِي، وَنُصِرْتُ بِالرُّعْبِ شَهْرًا، يُرْعَبُ مِنِّي الْعَدُوُّ مَسِيرَةَ شَهْرٍ.\nوَقِيلَ لِي : سَلْ تُعْطَهْ.\nفَاخْتَبَأْتُ دَعْوَتِي شَفَاعَةً لِأُمَّتِي، وَهِيَ نَائِلَةٌ مِنْكُمْ إِنْ شَاءَ اللَّهُ تَعَالَى مَنْ لَمْ يُشْرِكُ بِاللَّهِ شَيْئًا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yahya bin Hammad, telah menceritakan kepada kami Abu 'Awanah, daripada Sulaiman, daripada Mujahid, daripada Ubaid bin Umair, daripada Abu Dzar RA, bahawa Nabi SAW bersabda: \"Aku telah diberikan lima perkara yang tidak diberikan kepada seorang nabi pun sebelumku: Aku diutuskan kepada orang yang merah dan hitam (seluruh manusia), bumi dijadikan untukku sebagai masjid dan alat bersuci, dan dihalalkan bagiku harta rampasan perang, yang tidak dihalalkan bagi seorang pun sebelumku, dan aku ditolong dengan rasa gerun (ketakutan musuh) selama sebulan perjalanan. Dan dikatakan kepadaku: Mintalah, nescaya kamu akan diberi. Maka aku menyimpan doaku sebagai syafaat untuk umatku, dan ia akan meliputi kamu, insya Allah Ta'ala, sesiapa yang tidak menyekutukan Allah dengan sesuatu pun.\""
  },
  {
    "id": 39279,
    "hadith_number": 1742,
    "tajuk_hadith": "Pembahagian Harta Rampasan Perang Hunain di Ji'ranah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، عَنْ عَاصِمٍ  ،  عَنْ أَبِي وَائِلٍ  ، قَالَ :\" قَسَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَنَائِمَ حُنَيْنٍ بِالْجِعِرَّانَةِ \".\nقَالَ عَبْد اللَّهِ : عَبْدُ اللَّهِ بْنُ مَسْعُودٍ   فِي الْإِسْنَادِ",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Hammad bin Zaid, daripada 'Asim, daripada Abu Wa'il, beliau berkata: \"Rasulullah ﷺ membahagikan harta rampasan perang Hunain di Ji'ranah.\" Abdullah berkata: Abdullah bin Mas'ud dalam sanad ini."
  },
  {
    "id": 39280,
    "hadith_number": 1743,
    "tajuk_hadith": "Pembukaan Khaibar dan Pembahagian Harta Rampasan Perang",
    "perawi_melayu": "Abdullah bin Ja'far ar-Raqqi",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الرَّقِّيُّ  ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو  ، عَنْ زَيْدٍ  ، عَنْ الْحَكَمِ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى  ، عَنْ أَبِيهِ  ، قَالَ :\" شَهِدْتُ فَتْحَ خَيْبَرَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَانْهَزَمَ الْمُشْرِكُونَ، فَوَقَعْنَا فِي رِحَالِهِمْ، فَابْتَدَرَ النَّاسُ مَا وَجَدُوا مِنْ جَزُورٍ.\nقَالَ : فَلَمْ يَكُنْ ذَلِكَ بِأَسْرَعَ مِنْ أَنْ فَارَتِ الْقُدُورُ فَأَمَرَ بِهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأُكْفِئَتْ.\nقَالَ : ثُمَّ قَسَمَ بَيْنَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَعَلَ لِكُلِّ عَشْرَةٍ شَاةً.\nقَالَ : وَكَانَ بَنُو فُلَانٍ مَعَهُ تِسْعَةً، وَكُنْتُ وَحْدِي فَالْتَفَتُّ إِلَيْهِمْ فَكُنَّا عَشْرَةً بَيْنَنَا شَاةٌ \"، قَالَ عَبْد اللَّهِ : بَلَغَنِي أَنَّ صَاحِبَكُمْ يَقُولُ : عَنْ قَيْسِ بْنِ مُسْلِمٍ : كَأَنَّهُ يَقُولُ : إِنَّهُ لَمْ يَحْفَظْهُ .\nأَخْبَرَنَا زَكَرِيَّا بْنُ عَدِيٍّ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَمْرٍو  ، عَنْ زَيْدٍ وهُوَ ابْنُ أَبِي أُنَيْسَةَ  ، عَنْ قَيْسِ بْنِ مُسْلِمٍ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى  ، عَنْ أَبِيهِ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ، قَالَ : فَأُلِّفْتُ إِلَيْهِمْ.\nقَالَ أَبُو مُحَمَّدٍ : الصَّوَابُ عِنْدِي مَا قَالَ زَكَرِيَّا فِي الْإِسْنَادِ",
    "malay_translation": "Abdullah bin Ja'far ar-Raqqi telah memberitahu kami, beliau berkata: Ubaidullah bin Amru telah menceritakan kepada kami, daripada Zaid, daripada al-Hakam, daripada Abdurrahman bin Abi Laila, daripada ayahnya, beliau berkata: \"Saya menyaksikan pembukaan Khaibar bersama Rasulullah SAW.  Setelah kaum musyrikin dikalahkan, kami memasuki perkhemahan mereka. Orang ramai segera mengambil sebanyak mungkin daging unta gemuk yang mereka temui.  Beliau berkata: Tidak lama kemudian, periuk-periuk sudah mula mendidih. Rasulullah SAW kemudian memerintahkan agar periuk-periuk itu ditumpahkan. Beliau berkata: Kemudian Rasulullah SAW membahagikan harta rampasan perang di antara kami, dengan menetapkan seekor kambing untuk setiap sepuluh orang. Beliau berkata: Bani Fulan bersama baginda seramai sembilan orang, dan saya seorang diri. Lalu saya berpaling kepada mereka, dan kami menjadi sepuluh orang, dan kami berkongsi seekor kambing.\" Abdullah berkata: Telah sampai khabar kepada saya bahawa sahabat kamu berkata: daripada Qais bin Muslim: seolah-olah beliau berkata: sesungguhnya dia tidak menghafalnya. Zakaria bin Adiy telah memberitahu kami, daripada Ubaidullah bin Amru, daripada Zaid, iaitu Ibnu Abi Unaisah, daripada Qais bin Muslim, daripada Abdurrahman bin Abi Laila, daripada ayahnya, daripada Nabi SAW, yang serupa dengannya. Beliau berkata: Lalu saya digabungkan dengan mereka. Abu Muhammad berkata: Pendapat yang paling tepat bagi saya adalah apa yang dikatakan oleh Zakaria dalam sanad ini."
  },
  {
    "id": 39281,
    "hadith_number": 1744,
    "tajuk_hadith": "Bahagian untuk Kaum Kerabat Rasulullah ﷺ",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ  ، حَدَّثَنِي قَيْسُ بْنُ سَعْدٍ  ، عَنْ يَزِيدَ بْنِ هُرْمُزَ  ، قَالَ : كَتَبَ نَجْدَةُ بَنُ عَامِرٍ L7874 إِلَى ابْنِ عَبَّاسٍ   يَسْأَلُهُ عَنْ أَشْيَاءَ، فَكَتَبَ إِلَيْهِ : \" إِنَّكَ سَأَلْتَ عَنْ سَهْمِ ذِي الْقُرْبَى الَّذِي ذَكَرَ اللَّهُ، وَإِنَّا كُنَّانَرَى أَنَّ قَرَابَةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُمْ، فَأَبَى ذَلِكَ عَلَيْنَا قَوْمُنَا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Nu'man, telah menceritakan kepada kami Jarir bin Hazim, telah menceritakan kepadaku Qais bin Sa'd, daripada Yazid bin Hurmuz, beliau berkata: Najdah bin Amir telah menulis surat kepada Ibn Abbas, bertanya kepadanya tentang beberapa perkara. Lalu Ibn Abbas menulis kepadanya: 'Sesungguhnya kamu bertanya tentang bahagian (fai') untuk kaum kerabat yang disebut oleh Allah. Sesungguhnya kami berpendapat bahawa kaum kerabat Rasulullah ﷺ adalah mereka (yang berhak menerima bahagian tersebut), tetapi kaum kami menolak pendapat itu.'"
  },
  {
    "id": 39282,
    "hadith_number": 1745,
    "tajuk_hadith": "Pembahagian Ghanimah Khaibar",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاق بْنُ عِيسَى  ، حَدَّثَنَا مُحَمَّدُ بْنُ خَازِمٍ أَبُو مُعَاوِيَةَ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ  ، عَنْ نَافِعٍ  ، عَنِ ابْنِ عُمَرَ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" أَسْهَمَ يَوْمَ خَيْبَرَ لِلْفَارِسِ ثَلَاثَةَ أَسْهُمٍ، وَلِلرَّاجِلِ سَهْمًا \"، حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ عُبَيْدِ اللَّهِ  ، عَنْ نَافِعٍ  ، عَنِ ابْنِ عُمَرَ  ، نَحْوَهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Ishaq bin Isa, telah menceritakan kepada kami Muhammad bin Khazim Abu Mu'awiyah, daripada Ubaidillah bin Umar, daripada Nafi', daripada Ibn Umar: Bahawa Rasulullah SAW telah menetapkan bahagian pada hari Khaibar untuk penunggang kuda tiga bahagian, dan untuk pejalan kaki satu bahagian. Telah menceritakan kepada kami Muhammad bin Yusuf, daripada Sufyan, daripada Ubaidillah, daripada Nafi', daripada Ibn Umar, sepertinya."
  },
  {
    "id": 39283,
    "hadith_number": 1746,
    "tajuk_hadith": "Pembahagian Harta Rampasan Perang Khaibar Khusus untuk Ahli Hudaibiyah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا حَجَّاجُ بْنُ مِنْهَالٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ عَلِيِّ بْنِ زَيْدٍ  ، عَنْ عَمَّارِ بْنِ أَبِي عَمَّارٍ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ :\" مَا شَهِدْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَغْنَمًا إِلَّا قَسَمَ لِي، إِلا يَوْمَ خَيْبَرَ، فَإِنَّهَا كَانَتْ لِأَهْلِ الْحُدَيْبِيَةِ خَاصَّةً، وَكَانَ أَبُو مُوسَى وَأَبُو هُرَيْرَةً جَاءَا بَيْنَ الْحُدَيْبِيَةِ وَخَيْبَرَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Hajjaj bin Minhal, telah menceritakan kepada kami Hammad bin Salamah, daripada Ali bin Zaid, daripada Ammar bin Abi Ammar, daripada Abu Hurairah, dia berkata: \"Aku tidak menyaksikan bersama Rasulullah SAW harta rampasan perang kecuali beliau membahagikannya kepadaku, kecuali pada hari Khaibar, kerana sesungguhnya ia adalah khusus untuk Ahli Hudaibiyah, dan Abu Musa dan Abu Hurairah datang antara Hudaibiyah dan Khaibar.\""
  },
  {
    "id": 39284,
    "hadith_number": 1747,
    "tajuk_hadith": "Pemberian Rasulullah SAW kepada Umair di Khaibar",
    "perawi_melayu": "Umair maula Abi al-Laham",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْمَاعِيل بْنُ خَلِيلٍ  ، أَخْبَرَنَا حَفْصٌ  ، حَدَّثَنَا مُحَمَّدُ بْنُ زَيْدٍ  ، عَنْ عُمَيْرٍ   مَوْلَى آبِي اللَّحْمِ، قَالَ : شَهِدْتُ خَيْبَرَ وَأَنَا عَبْدٌ مَمْلُوكٌ فَأَعْطَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ خُرْثِيِّ الْمَتَاعِ، وَأَعْطَانِي سَيْفًا، فَقَالَ :\" تَقَلَّدْ بِهَذَا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ismail bin Khalil, telah mengkhabarkan kepada kami Hafs, telah menceritakan kepada kami Muhammad bin Zaid, daripada Umair, maula (hamba yang dibebaskan) Abi al-Laham, dia berkata: Aku menyaksikan Khaibar dan aku adalah seorang hamba sahaya, lalu Rasulullah SAW memberiku dari harta rampasan perang yang kurang baik, dan baginda memberiku sebilah pedang, lalu baginda bersabda: \"Ikatlah pedang ini (pakailah pedang ini).\""
  },
  {
    "id": 39285,
    "hadith_number": 1748,
    "tajuk_hadith": "Larangan Menjual Anak Panah Sebelum Dibahagikan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ حُمْيَدٍ  ، حَدَّثَنَا أَبُو أُسَامَةَ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ جَابِرٍ  ، عَنْ الْقَاسِمِ  ، وَمَكْحُولٍ  ، عَنْ أَبِي أُمَامَةَ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" أَنَّهُ نَهَى أَنْتُبَاعَ السِّهَامُ حَتَّى تُقْسَم \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ahmad bin Humaid, telah menceritakan kepada kami Abu Usamah, daripada Abdul Rahman bin Yazid bin Jabir, daripada al-Qasim dan Mak-hul, daripada Abu Umamah, daripada Nabi SAW: \"Bahawa sesungguhnya baginda melarang anak panah dijual sehingga dibahagikan.\""
  },
  {
    "id": 39286,
    "hadith_number": 1749,
    "tajuk_hadith": "Larangan Mendekati Tawanan Perang Sehingga Dipastikan Keadaan Mereka",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ خَالِدٍ  ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاق  ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ  ، عَنْ أَبِي مَرْزُوقٍ  مَوْلًى لِتُجِيبٍ، قَالَ : حَدَّثَنِي حَنَشٌ الصَّنْعَانِيُّ  ، قَالَ : غَزَوْنَا الْمَغْرِبَ وَعَلَيْنَا رُوَيْفِعُ بْنُ ثَابِتٍ الْأَنْصَارِيُّ فَافْتَتَحْنَا قَرْيَةً يُقَالُ لَهَا : جَرْبَةَ ، فَقَامَ فِينَا رُوَيْفِعُ بْنُ ثَابِتٍ الْأَنْصَارِيُّ   خَطِيبًا، فَقَالَ : إِنِّي لَا أَقُومُ فِيكُمْ إِلَّا بما سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَامَ فِينَا يَوْمَ خَيْبَرَ حِينَ افْتَتَحْنَاهَا، فَقَالَ :\" مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ، فَلَا يَأْتِيَنَّ شَيْئًا مِنَ السَّبْيِ حَتَّى يَسْتَبْرِئَهَا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ahmad bin Khalid, telah menceritakan kepada kami Muhammad bin Ishaq, dari Yazid bin Abi Habib, dari Abi Marzuq, hamba sahaya bagi Tujib, dia berkata: Telah menceritakan kepadaku Hanash As-San'ani, dia berkata: Kami berperang di Maghrib dan Ruwaifi' bin Thabit Al-Ansari menjadi pemimpin kami. Kami menakluki sebuah kampung yang disebut Jarbah. Ruwaifi' bin Thabit Al-Ansari berdiri di tengah-tengah kami sebagai khatib, lalu dia berkata: Sesungguhnya aku tidak berdiri di hadapan kamu kecuali dengan apa yang aku dengar dari Rasulullah SAW. Baginda berdiri di tengah-tengah kami pada hari Khaibar ketika kami menakluki Khaibar, lalu bersabda: 'Sesiapa yang beriman kepada Allah dan hari akhirat, maka janganlah sekali-kali mendatangi sesuatu pun dari tawanan perang sehingga dia memastikan keadaan mereka (sama ada hamil atau tidak).'"
  },
  {
    "id": 39287,
    "hadith_number": 1750,
    "tajuk_hadith": "Ancaman Laknat bagi Lelaki yang Menghamilkan Wanita yang Tidak Halal Baginya",
    "perawi_melayu": "Asad bin Musa, Syu'bah, Yazid bin Khumair Abu Umar Asy-Syami Al-Hamdani, Abdurrahman bin Jubair bin Nufair, Jubair bin Nufair, Abu Darda'",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَسَدُ بْنُ مُوسَى  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ يَزِيدَ بْنِ خُمَيْرٍ أَبِي عُمَرَ الشَّامِيِّ الْهَمْدَانِيِّ  ، قَالَ : سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ جُبَيْرِ بْنِ نُفَيْرٍ  ، عَنْ أَبِيهِ  ، عَنْ أَبِي الدَّرْدَاءِ   : أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى امْرَأَةً مُجِحَّةً يَعْنِي : حُبْلَى عَلَى بَابِ فُسْطَاطٍ ، فَقَالَ : \" لَعَلَّهُ قَدْ أَلَمَّ بِهَا؟ \".\nقَالُوا : نَعَمْ.\nقَالَ :\" لَقَدْ هَمَمْتُ أَنْ أَلْعَنَهُ لَعْنَةً تَدْخُلُ مَعَهُ قَبْرَهُ، كَيْفَ يُوَرِّثُهُ وَهُوَ لَا يَحِلُّ لَهُ، وَكَيْفَ يَسْتَخْدِمُهُ وَهُوَ لَا يَحِلُّ لَهُ \"",
    "malay_translation": "Asad bin Musa memberitahu kami, Syu'bah menceritakan kepada kami, daripada Yazid bin Khumair Abu Umar Asy-Syami Al-Hamdani, dia berkata: Saya mendengar Abdurrahman bin Jubair bin Nufair, daripada ayahnya, daripada Abu Darda': Bahawa Nabi صلى الله عليه وسلم melihat seorang wanita yang *mujihhah* (iaitu: hamil) di depan pintu khemah, lalu baginda bersabda: \"Mungkin dia telah menggaulinya?\" Mereka berkata: \"Ya.\" Baginda bersabda: \"Sungguh aku hampir melaknatnya dengan laknat yang masuk bersamanya ke kuburnya, bagaimana dia mewarisinya padahal tidak halal baginya, dan bagaimana dia mempergunakannya padahal tidak halal baginya.\""
  },
  {
    "id": 39288,
    "hadith_number": 1751,
    "tajuk_hadith": "Larangan Memisahkan Ibu daripada Anaknya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْقَاسِمُ بْنُ كَثِيرٍ  ، عَنْ اللَّيْثِ بْنِ سَعْدٍ  ، قِرَاءَةً، عَنْ عَبْدِ اللَّهِ بْنِ جُنَادَةَ  ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ  : أَنَّ أَبَا أَيُّوبَ   كَانَ فِي جَيْشٍ فَفُرِّقَ بَيْنَ الصِّبْيَانِ وَبَيْنَ أُمَّهَاتِهِمْ، فَرَآهُمْ يَبْكُونَ، فَجَعَلَ يَرُدُّ الصَّبِيَّ إِلَى أُمِّهِ.\nوَيَقُولُ : إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنْ فَرَّقَ بَيْنَ الْوَالِدَةِ وَوَلَدِهَا، فَرَّقَ اللَّهُ بَيْنَهُ وَبَيْنَ الْأَحِبَّاءِ يَوْمَ الْقِيَامَةِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Qasim bin Kathir, daripada al-Layth bin Sa'd, secara bacaan, daripada Abdullah bin Junadah, daripada Abu Abdurrahman al-Hubuli: Bahawa Abu Ayyub berada dalam satu pasukan tentera lalu dipisahkan antara anak-anak kecil dan ibu-ibu mereka. Beliau melihat mereka menangis, lalu beliau mula mengembalikan anak kecil kepada ibunya.\nDan beliau berkata: Sesungguhnya Rasulullah SAW bersabda: 'Sesiapa yang memisahkan antara ibu dan anaknya, Allah akan memisahkannya dengan orang-orang yang dicintainya pada hari kiamat.'"
  },
  {
    "id": 39289,
    "hadith_number": 1752,
    "tajuk_hadith": "Hak Orang yang Baru Memeluk Islam ke atas Harta dan Darah Mereka",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا أَبَانُ بْنُ عَبْدِ اللَّهِ الْبَجَلِيُّ  ، عَنْ عُثْمَانَ بْنِ أَبِي حَازِمٍ  ، عَنْ صَخْرِ بْنِ الْعَيْلَةِ  ، قَالَ أَبُو مُحَمَّد : وَمِنْهُمْ مَنْ يَقُولُ : الْغِيلَةِ .\nقَالَ : أَخَذْتُ عَمَّةَ الْمُغِيرَةِ بْنِ شُعْبَةَ، فَقَدِمْتُ بِهَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَسَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَمَّتَهُ، فَقَالَ : \" يَا صَخْرُ، إِنَّ الْقَوْمَ إِذَا أَسْلَمُوا، أَحْرَزُوا أَمْوَالَهُمْ وَدِمَاءَهُمْ، فَادْفَعْهَا إِلَيْهِ \".\nوَكَانَ مَاءٌ لِبَنِي سُلَيْمٍ، فَأَسْلَمُوا فَأَتَوْهُ فَسَأَلُوهُ ذَلِكَ، فَدَعَانِي، فَقَالَ : \" يَا صَخْرُ، إِنَّالْقَوْمَ إِذَا أَسْلَمُوا، أَحْرَزُوا أَمْوَالَهُمْ وَدِمَاءَهُمْ، فَادْفَعْهُ إِلَيْهِمْ \"فَدَفَعْتُهُ",
    "malay_translation": "Abu Nu'aim memberitahu kami, Aban bin Abdullah al-Bajali menceritakan kepada kami, daripada Uthman bin Abi Hazim, daripada Sakhr bin al-'Ailah, Abu Muhammad berkata: Dan di antara mereka ada yang mengatakan: al-Ghilah.\nDia berkata: Aku mengambil bibi al-Mughirah bin Syu'bah, lalu aku datang dengannya kepada Rasulullah صلى الله عليه وسلم, maka Nabi صلى الله عليه وسلم bertanya kepada bibinya, lalu bersabda: \"Wahai Sakhr, sesungguhnya kaum itu apabila mereka masuk Islam, mereka memelihara harta dan darah mereka, maka serahkanlah dia kepadanya.\"\nDan ada air kepunyaan Bani Sulaim, lalu mereka masuk Islam, maka mereka datang kepadanya dan meminta hal itu, lalu baginda memanggilku dan bersabda: \"Wahai Sakhr, sesungguhnya kaum itu apabila mereka masuk Islam, mereka memelihara harta dan darah mereka, maka serahkanlah ia kepada mereka.\" Maka aku menyerahkannya."
  },
  {
    "id": 39290,
    "hadith_number": 1753,
    "tajuk_hadith": "Bahagian Harta Rampasan Perang Unta",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ نَافِعٍ  ، عَنِ ابِنِ عُمَرَ  ، قَالَ :\" بَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَرِيَّةً فِيهَا ابْنُ عُمَر، فَغَنِمُوا إِبِلًا كَثِيرَةً، فَكَانَتْ سِهَامُهُمْ اثْنَيْ عَشَرَ بَعِيرًا أَوْ أَحَدَ عَشَرَ بَعِيرًا وَنُفِّلُوا بَعِيرًا بَعِيرًا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Khalid bin Makhlad, telah menceritakan kepada kami Malik, daripada Nafi', daripada Ibn Umar RA, beliau berkata: \"Rasulullah SAW telah mengutuskan satu pasukan tentera yang di dalamnya terdapat Ibn Umar, lalu mereka memperolehi harta rampasan perang berupa unta yang banyak. Setiap seorang daripada mereka mendapat bahagian dua belas atau sebelas ekor unta, dan mereka juga diberikan tambahan seekor unta setiap seorang.\""
  },
  {
    "id": 39291,
    "hadith_number": 1754,
    "tajuk_hadith": "Pemberian Ganjaran Tambahan (Ghanimah) dalam Peperangan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ  ، حَدَّثَنَا أَبُو إِسْحَاق الْفَزَارِيُّ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَيَّاشٍ  ، عَنْ سُلَيْمَانَ بْنِ مُوسَى  ، عَنْ أَبِي سَلَّامٍ  ، عَنْ أَبِي أُمَامَةَ الْبَاهِلِيِّ  ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ  ، قَالَ : كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \" إِذَاأَغَارَ فِي أَرْضِ الْعَدُوِّ، نَفَّلَ الرُّبُعَ، وَإِذَا أَقْبَلَ رَاجِعًا، وَكُلُّ النَّاسِ، نَفَّلَ الثُّلُثَ \"",
    "malay_translation": "Muhammad bin Uyainah memberitahu kami, Abu Ishaq al-Fazari menceritakan kepada kami, dari Abd al-Rahman bin Ayash, dari Sulaiman bin Musa, dari Abu Salam, dari Abu Umamah al-Bahili, dari Ubadah bin al-Samit, dia berkata: Rasulullah SAW bersabda: \"Apabila baginda menyerang di tanah musuh, baginda memberikan seperempat (ghanimah tambahan), dan apabila baginda kembali, dan semua orang (kembali), baginda memberikan sepertiga (ghanimah tambahan).\""
  },
  {
    "id": 39292,
    "hadith_number": 1755,
    "tajuk_hadith": "Pemberian Nafkah Sepertiga Setelah Seperlima",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ سُفْيَانَ  ، عَنْ يَزِيدَ بْنِ يَزِيدَ بْنِ جَابِرٍ  ، عَنْ مَكْحُولٍ  ، عَنْ زِيَادِ بْنِ جَارِيَةَ  ،  عَنْ حَبِيبِ بْنِ مَسْلَمَةَ   : أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" نَفَّلَ الثُّلُثَ بَعْدَ الْخُمُسِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu 'Asim, daripada Sufyan, daripada Yazid bin Yazid bin Jabir, daripada Makhul, daripada Ziyad bin Jariyah, daripada Habib bin Maslamah: Sesungguhnya Nabi صلى الله عليه وسلم memberikan nafkah sepertiga setelah seperlima."
  },
  {
    "id": 39293,
    "hadith_number": 1756,
    "tajuk_hadith": "Ganjaran bagi Pembunuh Kafir: Harta Rampasan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا حَجَّاجُ بْنُ مِنْهَالٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، حَدَّثَنَا إِسْحَاق بْنُ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ  ، عَنْ أَنَسِ بْنِ مَالِكٍ   : أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :\" مَنْ قَتَلَ كَافِرًا، فَلَهُ سَلَبُهُ \".\nفَقَتَلَ أَبُو طَلْحَةَ يَوْمَئِذٍ عِشْرِينَ، وَأَخَذَ أَسْلَابَهُمْ",
    "malay_translation": "Telah mengkhabarkan kepada kami Hajjaj bin Minhal, telah menceritakan kepada kami Hammad bin Salamah, telah menceritakan kepada kami Ishaq bin Abdullah bin Abi Talhah, daripada Anas bin Malik: Sesungguhnya Nabi ﷺ bersabda: 'Sesiapa yang membunuh seorang kafir, maka baginya harta rampasannya.' Abu Talhah telah membunuh dua puluh orang pada hari itu dan mengambil harta rampasan mereka."
  },
  {
    "id": 39294,
    "hadith_number": 1757,
    "tajuk_hadith": "Rampasan Perang untuk Pembunuh dalam Duel",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ  ، عَنْ يَحْيَى بْنِ سَعِيدٍ  ، عَنْ ابْنِ كَثِيرِ بْنِ أَفْلَحَ هُوَ : عُمَرُ بْنُ كَثِيرٍ  ، عَنْ أَبِي مُحَمَّدٍ  مَوْلَى أَبِي قَتَادَةَ، عَنْ أَبِي قَتَادَةَ  ، قَالَ : \" بَارَزْتُ رَجُلًا فَقَتَلْتُهُ،فَنَفَّلَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَلَبَهُ \"",
    "malay_translation": "Muhammad bin Yusuf memberitahu kami, daripada Sufyan bin Uyainah, daripada Yahya bin Sa'id, daripada Ibn Kathir bin Aflah – iaitu Umar bin Kathir, daripada Abu Muhammad, hamba sahaya Abu Qatadah, daripada Abu Qatadah, dia berkata: \"Saya berduel dengan seorang lelaki dan membunuhnya, lalu Rasulullah SAW memberikan rampasan perangnya kepada saya.\""
  },
  {
    "id": 39295,
    "hadith_number": 1758,
    "tajuk_hadith": "Nabi SAW Membenci Anfal dan Mengarahkan Orang Kuat Membantu Orang Lemah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ  ، حَدَّثَنَا أَبُو إِسْحَاق الْفَزَارِيُّ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَيَّاشٍ  ، عَنْ سُلَيْمَانَ بْنِ مُوسَى  ، عَنْ أَبِي سَلَّامٍ  ، عَنْ أَبِي أُمَامَةَ الْبَاهِلِيِّ  ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ   : أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَكْرَهُ الْأَنْفَالَ وَيَقُولُ :\" لِيَرُدَّ قَوِيُّ الْمُسْلِمِينَ عَلَى ضَعِيفِهِمْ \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Uyainah, telah menceritakan kepada kami Abu Ishaq al-Fazari, daripada Abdul Rahman bin Ayyash, daripada Sulaiman bin Musa, daripada Abu Salam, daripada Abu Umamah al-Bahili, daripada Ubadah bin as-Samit: Bahawa Nabi SAW membenci anfal (harta rampasan perang yang belum dibahagi) dan bersabda: “Hendaklah orang Muslim yang kuat membantu orang Muslim yang lemah di antara mereka.”"
  },
  {
    "id": 39296,
    "hadith_number": 1759,
    "tajuk_hadith": "Menunaikan Amanah dan Menjauhi Khianat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ  ، حَدَّثَنَا أَبُو إِسْحَاقَ الْفَزَارِيُّ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَيَّاشٍ  ، عَنْ سُلَيْمَانَ بْنِ مُوسَى  ، عَنْ أَبِي سَلامٍ  ، عَنْ أَبِي أُمَامَةَ الْبَاهِلِيِّ  ، عَنْ عُبَادَةَ   بِهَذَا الْإِسْنَادِ : أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ :\" أَدُّوا الْخِيَاطَ وَالْمَخِيطَ، وَإِيَّاكُمْ وَالْغُلُولَ فَإِنَّهُ عَارٌ عَلَى أَهْلِهِ يَوْمَ الْقِيَامَةِ \"",
    "malay_translation": "Telah meriwayatkan kepada kami Muhammad bin Uyainah, telah meriwayatkan kepada kami Abu Ishaq al-Fazari, daripada Abd al-Rahman bin Ayyash, daripada Sulaiman bin Musa, daripada Abu Salam, daripada Abu Umamah al-Bahili, daripada Ubadah dengan sanad ini: bahawa Nabi ﷺ bersabda: 'Tunaikanlah benang dan jarum (maksudnya, tunaikan amanah dan perkara-perkara kecil), dan jauhilah perbuatan khianat (ghulul), kerana sesungguhnya ia adalah kehinaan bagi pelakunya pada Hari Kiamat.'"
  },
  {
    "id": 39297,
    "hadith_number": 1760,
    "tajuk_hadith": "Larangan Menggunakan Harta Fai' Secara Berlebihan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ خَالِدٍ  ، حَدَّثَنَا مُحَمَّدٌ هُوَ : ابْنُ إِسْحَاق  ، عَنْ يَزِيدَ هُوَ : ابْنُ أَبِي حَبِيبٍ  عَنْ أَبِي مَرْزُوقٍ مَوْلًى لِتُجِيبَ  ، قَالَ : حَدَّثَنِي حَنَشٌ الصَّنْعَانِيُّ  ، قَالَ : غَزَوْنَا الْمَغْرِبَ وَعَلَيْنَا رُوَيْفِعُ بْنُ ثَابِتٍ الْأَنْصَارِيُّ، فَافْتَتَحْنَا قَرْيَةً يُقَالُ لَهَا : جَرْبَةَ فَقَامَ فِينَا رُوَيْفِعُ بْنُ ثَابِتٍ الْأَنْصَارِيُّ   خَطِيبًا، فَقَالَ : إِنِّي لَا أَقُومُ فِيكُمْ إِلَّا مَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ فِينَا يَوْمَ خَيْبَرَ حِينَ افْتَتَحْنَاهَا :\" مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلا يَرْكَبَنَّ دَابَّةً مِنْ فَيْءِ الْمُسْلِمِينَ، حَتَّى إِذَا أَجْحَفَهَا أَوْ قَالَ : أَعْجَفَهَا، قَالَ أَبُو مُحَمَّدٍ : أَنَا أَشُكُّ فِيهِ رَدَّهَا \".\nوَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ، فَلَا يَلْبَسْ ثَوْبًا مِنْ فَيْءِ الْمُسْلِمِينَ حَتَّى إِذَا أَخْلَقَهُ، رَدَّهُ فِيهِ \"",
    "malay_translation": "Ahmad bin Khalid memberitahu kami, Muhammad iaitu Ibnu Ishaq menceritakan kepada kami, daripada Yazid iaitu Ibnu Abi Habib, daripada Abu Marzuq, maula Tujib, dia berkata: Hanash as-San'ani menceritakan kepadaku, dia berkata: Kami berperang di Maghrib dan Ruwaifi' bin Thabit al-Ansari menjadi pemimpin kami, lalu kami menakluki sebuah kampung yang disebut Jarbah. Ruwaifi' bin Thabit al-Ansari berdiri di antara kami sebagai seorang khatib, lalu dia berkata: Sesungguhnya aku tidak berdiri di antara kamu kecuali apa yang aku dengar dari Rasulullah SAW berdiri di antara kami pada hari Khaibar ketika kami menaklukkannya: 'Barangsiapa yang beriman kepada Allah dan hari akhir, maka janganlah dia menunggang binatang tunggangan dari harta fai' kaum muslimin, sehingga apabila dia telah membebaninya atau dia berkata: melemahkannya, dia mengembalikannya.' Abu Muhammad berkata: Aku ragu tentang perkataan 'mengembalikannya'. Dan barangsiapa yang beriman kepada Allah dan hari akhir, maka janganlah dia memakai pakaian dari harta fai' kaum muslimin sehingga apabila dia telah melusuhkannya, dia mengembalikannya padanya."
  },
  {
    "id": 39298,
    "hadith_number": 1761,
    "tajuk_hadith": "Balasan bagi Mereka yang Menggelapkan Harta Rampasan Perang",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ  ، حَدَّثَنِي أَبُو زُمَيْلٍ  ، حَدَّثَنِي ابْنُ عَبَّاسٍ  ، قَالَ : حَدَّثَنِي عُمَرُ بْنُ الْخَطَّابِ  ، قَالَ : قُتِلَ نَفَرٌ يَوْمَ خَيْبَرَ، فَقَالُوا : فُلَانٌ شَهِيدٌ، فُلانٌ.\n..\n..\n..\nحَتَّى ذَكَرُوا رَجُلًا، فَقَالُوا : فُلَانٌ شَهِيدٌ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" كَلا إِنِّي رَأَيْتُهُ فِي النَّارِ فِي عَبَاءَةٍ أَوْ فِي بُرْدَةٍ غَلَّهَا \".\nثُمَّ قَالَ لِي : \" يَا ابْنَ الْخَطَّابِ قُمْ فَنَادِ فِي النَّاسِ أَنَّهُ لَا يَدْخُلُ الْجَنَّةَ إِلا الْمُؤْمِنُونَ \"فَقُمْتُ فَنَادَيْتُ فِي النَّاسِ",
    "malay_translation": "Telah menceritakan kepada kami Abu Al-Walid, telah menceritakan kepada kami Ikrimah bin Ammar, telah menceritakan kepadaku Abu Zumail, telah menceritakan kepadaku Ibn Abbas, dia berkata: telah menceritakan kepadaku Umar bin Al-Khattab, dia berkata: Beberapa orang terbunuh pada hari Khaibar, lalu mereka berkata: 'Fulan syahid, Fulan syahid.' ... hingga mereka menyebutkan seorang lelaki, lalu mereka berkata: 'Fulan syahid,' maka Rasulullah ﷺ bersabda: 'Tidak, sesungguhnya aku melihatnya di neraka disebabkan 'aba'ah (sejenis jubah) atau burdah (sejenis selimut bergaris) yang telah dikhianatinya (ghal).' Kemudian baginda bersabda kepadaku: 'Wahai Ibn Al-Khattab, bangun dan serulah kepada orang ramai bahawa tidak akan masuk syurga kecuali orang-orang yang beriman.' Maka aku pun bangun dan menyeru kepada orang ramai."
  },
  {
    "id": 39299,
    "hadith_number": 1762,
    "tajuk_hadith": "Hukuman bagi Penipu dalam Harta Rampasan Perang",
    "perawi_melayu": "Sa'id bin Mansur, Abdul Aziz bin Muhammad, Soleh bin Muhammad bin Zaidah, Salim bin Abdullah, daripada ayahnya, daripada datuknya",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ  ، عَنْ عَبْدِ الْعَزِيزِ بْنِ مُحَمَّدٍ  ، عَنْ صَالِحِ بْنِ مُحَمَّدِ بْنِ زَائِدَةَ  ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ  ، عَنْ أَبِيهِ  ، عَنْ جَدِّهِ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَنْ وَجَدْتُمُوهُ غَلَّ، فَاضْرِبُوهُ وَأَحْرِقُوا مَتَاعَهُ \"",
    "malay_translation": "Telah menceritakan kepada kami Sa'id bin Mansur, daripada Abdul Aziz bin Muhammad, daripada Soleh bin Muhammad bin Zaidah, daripada Salim bin Abdullah, daripada ayahnya, daripada datuknya, dia berkata: Rasulullah SAW bersabda: \"Sesiapa yang kamu dapati melakukan penipuan dalam harta rampasan perang, maka pukullah dia dan bakarlah barang-barangnya.\""
  },
  {
    "id": 39300,
    "hadith_number": 1763,
    "tajuk_hadith": "Larangan Merampas, Khianat, dan Mencuri Secara Sembunyi",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ الْمُكْتِبُ  ، حَدَّثَنَا الْقَاسِمُ بْنُ مَالِكٍ  ، حَدَّثَنِي كَثِيرُ بْنُ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عَوْفٍ الْمُزَنِيُّ  ، عَنْ أَبِيهِ  ، عَنْ جَدِّهِ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَا نَهْبَ، وَلا إِغْلالَ، وَلا إِسْلَالَ، وَمَنْ يَغْلُلْ يَأْتِ بِمَا غَلَّ يَوْمَ الْقِيَامَةِ \".\nقَالَ أَبُو مُحَمَّدٍ : الْإِسْلالُ : السَّرِقَةُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Hatim al-Muktib, telah menceritakan kepada kami al-Qasim bin Malik, telah menceritakan kepadaku Kathir bin Abdullah bin 'Amr bin Auf al-Muzani, daripada ayahnya, daripada datuknya, dia berkata: Rasulullah SAW bersabda: \"Tidak boleh merampas, tidak boleh khianat (dalam harta rampasan perang), dan tidak boleh mencuri secara sembunyi. Barangsiapa yang berkhianat, dia akan datang pada hari kiamat dengan apa yang dikhianatinya.\" Abu Muhammad berkata: \"Al-Islal (الإِسْلَالَ) adalah mencuri.\""
  },
  {
    "id": 39301,
    "hadith_number": 1764,
    "tajuk_hadith": "Larangan Memotong Tangan dalam Peperangan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا بِشْرُ بْنُ عُمَرَ الزَّهْرَانِيُّ  ، حَدَّثَنَا عَبْدُ اللَّهِ هُوَ : ابْنُ لَهِيعَةَ  ، حَدَّثَنَا عَيَّاشُ بْنُ عَبَّاسٍ  ، عَنْ شِيَيْمِ بْنِ بَيْتَانَ  ، عَنْ جُنَادَةَ بْنِ أَبِي أُمَيَّةَ  ، قَالَ : لَوْلَا أَنِّي سَمِعْتُ ابْنَ أَرْطَاةَ  ، يَقُولُ : قَدْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" لا تُقْطَعُ الْأَيْدِي فِي الْغَزْوِ لَقَطَعْتُهَا \"",
    "malay_translation": "Bishr bin Umar Az-Zahrani meriwayatkan kepada kami, Abdullah iaitu Ibnu Lahi'ah meriwayatkan kepada kami, Ayyash bin Abbas meriwayatkan kepada kami, daripada Shyaym bin Baytan, daripada Junadah bin Abi Umayyah, dia berkata: Sekiranya tidak kerana aku mendengar Ibn Artat berkata: Aku telah mendengar Rasulullah SAW bersabda: \"Tangan tidak dipotong dalam peperangan, nescaya aku akan memotongnya.\""
  },
  {
    "id": 39302,
    "hadith_number": 1765,
    "tajuk_hadith": "Larangan Menerima Hadiah Bagi Petugas Zakat Kerana Jawatan",
    "perawi_melayu": "Al-Hakam bin Nafi', Syu'aib, Az-Zuhri, Urwah bin Az-Zubair, Abu Humaid As-Sa'idi",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ  ، حَدَّثَنَا شُعَيْبٌ  ، عَنْ الزُّهْرِيِّ  أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ  ، عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ   : أَنَّهُ أَخْبَرَهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَعْمَلَ عَامِلًا عَلَى الصَّدَقَةِ فَجَاءَهُ الْعَامِلُ حِينَ فَرَغَ مِنْ عَمَلِهِ، فَقَالَ : يَا رَسُولَ اللَّهِ، هَذَا الَّذِي لَكُمْ، وَهَذَا أُهْدِيَ لِي، فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" فَهَلا قَعَدْتَ فِي بَيْتِ أَبِيكَ وَأَمِّكَ، فَنَظَرْتَ أَيُهْدَى لَكَ أَمْ لا \"، ثُمَّ قَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَشِيَّةً بَعْدَ الصَّلاةِ عَلَى الْمِنْبَرِ فَتَشَهَّدَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ بِمَا هُوَ أَهْلُهُ، ثُمَّ قَالَ : \" أَمَّا بَعْدُ،فَمَا بَالُ الْعَامِلِ نَسْتَعْمِلُهُ فَيَأْتِينَا، فَيَقُولُ : هَذَا مِنْ عَمَلِكُمْ، وَهَذَا أُهْدِيَ لِي؟ فَهَلا قَعَدَ فِي بَيْتِ أَبِيهِ وَأُمِّهِ فَيَنْظُرَ أَيُهْدَى لَهُ أَمْ لا؟ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ، لَا يَغُلُّ أَحَدٌ مِنْكُمْ مِنْهَا شَيْئًا إِلا جَاءَ بِهِ يَوْمَ الْقِيَامَةِ يَحْمِلُهُ عَلَى عُنُقِهِ، إِنْ كَانَ بَعِيرًا، جَاءَ بِهِ لَهُ رُغَاءٌ، وَإِنْ كَانَتْ بَقَرَةً، جَاءَ بِهَا لَهَا خُوَارٌ، وَإِنْ كَانَتْ شَاةً، جَاءَ بِهَا تَيْعِرُ، فَقَدْ بَلَّغْتُ؟ \".\nقَالَ أَبُو حُمَيْدٍ : ثُمَّ رَفَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَيْهِ حَتَّى إِنَّا لَنَنْظُرُ إِلَى عُفْرَةِ إِبِطَيْهِ.\nقَالَ أَبُو حُمَيْدٍ : وَقَدْ سَمِعَ ذَلِكَ مَعِي مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَيْدُ بْنُ ثَابِتٍ، فَسَلُوهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Hakam bin Nafi', telah menceritakan kepada kami Syu'aib, dari az-Zuhri, telah mengkhabarkan kepadaku Urwah bin az-Zubair, dari Abu Humaid as-Sa'idi: Bahawa dia telah mengkhabarkannya bahawa Nabi صلى الله عليه وسلم telah melantik seorang petugas untuk menguruskan sedekah (zakat). Petugas itu datang kepada baginda setelah selesai tugasnya, lalu berkata: \"Wahai Rasulullah, ini adalah (hasil zakat) untuk kamu, dan ini adalah hadiah yang diberikan kepada saya.\" Maka Nabi صلى الله عليه وسلم bersabda: \"Mengapa kamu tidak duduk sahaja di rumah ayah dan ibumu, lalu kamu lihat adakah hadiah akan diberikan kepadamu atau tidak?\" Kemudian Nabi صلى الله عليه وسلم berdiri pada waktu petang setelah solat di atas mimbar, lalu bertasyahhud, memuji Allah dan menyanjung-Nya dengan pujian yang layak bagi-Nya, kemudian bersabda: \"Amma ba'du, mengapa petugas yang kami lantik datang kepada kami, lalu berkata: 'Ini adalah dari hasil kerja kamu, dan ini adalah hadiah yang diberikan kepada saya?' Mengapa dia tidak duduk sahaja di rumah ayah dan ibunya, lalu dia lihat adakah hadiah akan diberikan kepadanya atau tidak? Demi Zat yang jiwa Muhammad berada di tangan-Nya, tidaklah seorang pun di antara kamu mengambil sesuatu daripadanya (zakat) dengan cara yang tidak benar, melainkan dia akan datang pada hari kiamat membawanya di atas tengkuknya. Jika ia adalah unta, dia akan datang dengannya dengan suara ngaungannya, jika ia adalah lembu, dia akan datang dengannya dengan suara muannya, dan jika ia adalah kambing, dia akan datang dengannya dengan suara mengembeknya. Sungguh, aku telah menyampaikan (peringatan)?\"\nAbu Humaid berkata: Kemudian Nabi صلى الله عليه وسلم mengangkat kedua tangannya sehingga kami dapat melihat putih ketiak baginda.\nAbu Humaid berkata: Dan Zaid bin Thabit telah mendengar perkara itu bersamaku daripada Rasulullah صلى الله عليه وسلم, maka bertanyalah kepadanya."
  },
  {
    "id": 39303,
    "hadith_number": 1766,
    "tajuk_hadith": "Hadiah Raja Dzu Yazan kepada Nabi ﷺ dan Penerimaan Baginda",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ  ، أَخْبَرَنَا عُمَارَةُ بْنُ زَاذَانَ  ، عَنْ ثَابِتٍ  ، عَنْ أَنَسِ بْنِ مَالِكٍ   \" أَنَّ مَلِكَ ذِي يَزَنٍأَهْدَى إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حُلَّةً أَخَذَهَا بِثَلَاثَةٍ وَثَلَاثِينَ بَعِيرًا، أَوْ ثَلَاثٍ وَثَلَاثِينَ نَاقَةَ، فَقَبِلَهَا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami 'Amr bin 'Aun, telah mengkhabarkan kepada kami 'Umarah bin Zazan, daripada Thabit, daripada Anas bin Malik, bahawa Raja Dzu Yazan telah menghadiahkan kepada Nabi ﷺ sehelai *hullah* (pakaian) yang baginda ambil dengan tiga puluh tiga ekor unta jantan, atau tiga puluh tiga ekor unta betina, lalu baginda menerimanya."
  },
  {
    "id": 39304,
    "hadith_number": 1767,
    "tajuk_hadith": "Hadiah Penguasa Ailah Kepada Rasulullah SAW",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ  ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ  ، عَنْ عَمْرِو بْنِ يَحْيَى  ، عَنْ عَبَّاسِ بْنِ سَهْلٍ السَّاعِدِيِّ  ، عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ  ، قَالَ :\" بَعَثَ صَاحِبُ أَيْلَةَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكِتَابٍ، وَأَهْدَى لَهُ بَغْلَةً بَيْضَاءَ، فَكَتَبَ إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَهْدَى لَهُ بُرْدًا \"",
    "malay_translation": "Abdullah bin Maslamah telah meriwayatkan kepada kami, Sulaiman bin Bilal telah menceritakan kepada kami, daripada 'Amru bin Yahya, daripada 'Abbas bin Sahl as-Sa'idi, daripada Abu Humaid as-Sa'idi, beliau berkata: \"Penguasa Ailah telah mengutus surat kepada Rasulullah صلى الله عليه وسلم, dan menghadiahkan baginda seekor baghal putih. Lalu Rasulullah صلى الله عليه وسلم membalas kepadanya dan menghadiahkan sehelai burdah.\""
  },
  {
    "id": 39305,
    "hadith_number": 1768,
    "tajuk_hadith": "Larangan Meminta Bantuan Daripada Orang Musyrik",
    "perawi_melayu": "Ishaq bin Ibrahim, Waki', Malik bin Anas, Abdullah bin Niyar, Urwah, Aisyah RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاق بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا وَكِيعٌ  ، عَنْ مَالِكِ بْنِ أَنَسٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ نِيَار  ، عَنْ عُرْوَةَ  ، عَنْ عَائِشَةَ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" إِنَّا لَا نَسْتَعِينُ بِمُشْرِكٍ \".\nأَخْبَرَنَا إِسْحَاق  ، عَنْ رَوْحٍ  ، عَنْ مَالِكٍ  ، عَنْ فُضَيْلٍ هُوَ : ابْنُ أَبِي عَبْدِ اللَّهِ، هُوَ : الْخَطْمِي  ، عَنْ عَبْدِ اللَّهِ بْنِ نِيَارٍ  ، عَنْ عُرْوَةَ  ، عَنْ عَائِشَةَ   : أَطْوَلُ مِنْهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Ishaq bin Ibrahim, telah menceritakan kepada kami Waki', daripada Malik bin Anas, daripada Abdullah bin Niyar, daripada Urwah, daripada Aisyah RA: Bahawa Rasulullah SAW bersabda: \"Sesungguhnya kami tidak meminta bantuan daripada orang musyrik.\" Dan telah mengkhabarkan kepada kami Ishaq, daripada Ruh, daripada Malik, daripada Fudail iaitu Ibnu Abi Abdullah iaitu al-Khatmi, daripada Abdullah bin Niyar, daripada Urwah, daripada Aisyah RA: (Riwayat) yang lebih panjang daripadanya."
  },
  {
    "id": 39306,
    "hadith_number": 1769,
    "tajuk_hadith": "Perintah Mengusir Yahudi dari Hijaz dan Penduduk Najran dari Jazirah Arab",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَفَّانُ  ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ  ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ مَيْمُونٍ  : رَجُلٌ مِنْ أَهْلِ الْكُوفَةِ ، حَدَّثَنِي سَعْدُ بْنُ سَمُرَةَ بْنِ جُنْدُبٍ  ، عَنْ أَبِيهِ سَمُرَةَ  ، عَنْ أَبِي عُبَيْدَةَ بْنِ الْجَرَّاحِ  ، قَالَ : كَانَ فِي آخِرِ مَا تَكَلَّمَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" أَخْرِجُوا يَهُودَ مِنَ الْحِجَازِ ، وَأَهْلَ نَجْرَانَ مِنْ جَزِيرَةِ الْعَرَبِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Affan, telah menceritakan kepada kami Yahya bin Sa'id al-Qattan, telah menceritakan kepada kami Ibrahim bin Maimun: seorang lelaki dari penduduk Kufah, telah menceritakan kepadaku Sa'd bin Samurah bin Jundub, daripada ayahnya Samurah, daripada Abu Ubaidah bin al-Jarrah, dia berkata: \"Adalah di akhir perkataan yang Rasulullah SAW ucapkan, baginda bersabda: \"Keluarkan orang Yahudi dari Hijaz, dan penduduk Najran dari Jazirah Arab.\""
  },
  {
    "id": 39307,
    "hadith_number": 1770,
    "tajuk_hadith": "Hukum Makan dari Bekas Ahli Kitab",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ حَيْوَةَ بْنِ شُرَيْحٍ  ، حَدَّثَنِي رَبِيعَةُ بْنُ يَزِيدَ  ، حَدَّثَنِي أَبُو إِدْرِيسَ  ، حَدَّثَنِي أَبُو ثَعْلَبَةَ  ، قَالَ : أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقُلْتُ : يَا رَسُولَ اللَّهِ، إِنَّا بِأَرْضِ أَهْلِ الْكِتَابِ ، فَنَأْكُلُ فِي آنِيَتِهِمْ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِنْ كُنْتَ بِأَرْضٍ كَمَا ذَكَرْتَ، فَلَا تَأْكُلُوا فِي آنِيَتِهِمْ إِلا أَنْ لَا تَجِدُوا مِنْهَا بُدًّا، فَإِنْ لَمْ تَجِدُوا مِنْهَا بُدًّا، فَاغْسِلُوهَا، ثُمَّ كُلُوا فِيهَا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Asim, daripada Haiwah bin Syuraih, telah menceritakan kepadaku Rabi'ah bin Yazid, telah menceritakan kepadaku Abu Idris, telah menceritakan kepadaku Abu Tha'labah, dia berkata: Aku mendatangi Rasulullah SAW, lalu aku berkata: Wahai Rasulullah, sesungguhnya kami berada di negeri Ahli Kitab, lalu kami makan di dalam bejana mereka. Maka Rasulullah SAW bersabda: \"Jika kamu berada di negeri seperti yang kamu sebutkan, maka janganlah kamu makan di dalam bejana mereka kecuali jika kamu tidak menemukan jalan keluar darinya. Jika kamu tidak menemukan jalan keluar darinya, maka cucilah ia, kemudian makanlah di dalamnya.\""
  },
  {
    "id": 39308,
    "hadith_number": 1771,
    "tajuk_hadith": "Kisah Kantung Lemak di Khaibar dan Senyuman Rasulullah ﷺ",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ  ، حَدَّثَنَا سُلَيْمَانُ هُوَ : ابْنُ الْمُغِيرَةِ  ، عَنْ حُمَيْدٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ  ، قَالَ : \"دُلِّيَ جِرَابٌ مِنْ شَحْمٍ يَوْمَ خَيْبَرَ.\nقَالَ : فَأَتَيْتُهُ فَالْتَزَمْتُهُ.\nقَالَ : ثُمَّ قُلْتُ : لا أُعْطِي مِنْ هَذَا أَحَدًا الْيَوْمَ شَيْئًا، فَالْتَفَتُّ فَإِذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَبْتَسِمُ إِلَيَّ \".\n قَالَ عَبْد اللَّهِ : أَرْجُو أَنْ يَكُونَ حُمَيْدٌ سَمِعَ مِنْ عَبْدِ اللَّهِ",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Maslamah, telah menceritakan kepada kami Sulaiman iaitu Ibnu al-Mughirah, daripada Humaid, daripada Abdullah bin Mughaffal, dia berkata: \"Sebuah kantung berisi lemak diturunkan pada hari Khaibar.\" Dia berkata: \"Lalu aku mendatanginya dan memeluknya.\" Dia berkata: \"Kemudian aku berkata: 'Aku tidak akan memberikan sedikit pun dari ini kepada siapa pun hari ini,' lalu aku menoleh dan tiba-tiba Rasulullah ﷺ tersenyum kepadaku.\" Abdullah berkata: \"Aku berharap Humaid telah mendengar dari Abdullah.\""
  },
  {
    "id": 39309,
    "hadith_number": 1772,
    "tajuk_hadith": "Hukum Jizyah ke atas Majusi",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا ابْنُ عُيَيْنَةَ  ، عَنْ عَمْرٍو  ، عَنْ بَجَالَةَ  ، قَالَ : سَمِعْتُهُ يَقُولُ : \" لَمْ يَكُنْ عُمَرُ أَخَذَ الْجِزْيَةَ مِنَ الْمَجُوسِ حَتَّى شَهِدَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ   أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَخَذَهَا مِنْ مَجُوسِ هَجَرَ \"",
    "malay_translation": "Muhammad bin Yusuf memberitahu kami, Ibn Uyainah menceritakan kepada kami, daripada Amru, daripada Bajalah, dia berkata: Saya mendengarnya berkata: 'Umar tidak mengambil jizyah daripada orang Majusi sehingga Abdul Rahman bin Auf bersaksi bahawa Rasulullah صلى الله عليه وسلم mengambilnya daripada orang Majusi Hajar."
  },
  {
    "id": 39310,
    "hadith_number": 1773,
    "tajuk_hadith": "Perlindungan yang Diberikan oleh Ummu Hani' Diiktiraf oleh Rasulullah SAW",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ أَبِي النَّضْرِ  : أَنَّ أَبَا مُرَّةَ  مَوْلَى عَقِيلِ بْنِ أَبِي طَالِبٍ أَخْبَرَهُ أَنَّهُ سَمِعَ أُمَّ هَانِئٍ بِنْتَ أَبِي طَالِبٍ   تُحَدِّثُ أَنَّهَا ذَهَبَتْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْفَتْحِ، فَقَالَتْ : يَا رَسُولَ اللَّهِ، زَعَمَ ابْنُ أُمِّي أَنَّهُ قَاتِلٌ رَجُلًا أَجَرْتُهُ فَلانَ بْنُ هُبَيْرَةَ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" قَدْ أَجَرْنَا مَنْ أَجَرْتِ يَا أُمَّ هَانِئٍ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ubaidullah bin Abdul Majid, telah menceritakan kepada kami Malik, daripada Abu An-Nadr: Bahawa Abu Murrah, hamba sahaya Aqil bin Abi Talib, telah mengkhabarkannya bahawa dia mendengar Ummu Hani' binti Abu Talib menceritakan bahawa dia pergi kepada Rasulullah SAW pada tahun pembukaan (Makkah), lalu berkata: \"Wahai Rasulullah, anak ibuku mendakwa bahawa dia akan membunuh seorang lelaki yang telah aku berikan perlindungan, Fulan bin Hubairah.\" Maka Rasulullah SAW bersabda: \"Sesungguhnya kami telah memberikan perlindungan kepada sesiapa yang telah engkau berikan perlindungan, wahai Ummu Hani'."
  },
  {
    "id": 39311,
    "hadith_number": 1774,
    "tajuk_hadith": "Kisah Abdullah bin Mas'ud dan Pengikut Musailamah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ  ، حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ  ، عَنْ عَاصِمٍ  ، عَنْ أَبِي وَائِلٍ  ، عَنِ ابْنِ مُعَيْزٍ السَّعْدِيِّ  ، قَالَ : خَرَجْتُ أُسْفِرُ فَرَسًا لِي مِنَ السَّحَرِ فَمَرَرْتُ عَلَى مَسْجِدٍ مِنْ مَسَاجِدِ بَنِي حَنِيفَةَ، فَسَمِعْتُهُمْ يَشْهَدُونَ أَنَّ مُسَيْلَمَةَ رَسُولُ اللَّهِ، فَرَجَعْتُ إِلَى عَبْدِ اللَّهِ بْنِ مَسْعُودٍ   فَأَخْبَرْتُهُ، فَبَعَثَ إِلَيْهِمْ الشُّرَطَ، فَأَخَذُوهُمْ، فَجِيءَ بِهِمْ، إِلَيْهِ فَتَابَ الْقَوْمُ وَرَجَعُوا عَنْ قَوْلِهِمْ، فَخَلَّى سَبِيلَهُمْ، وَقَدَّمَ رَجُلًا مِنْهُمْ يُقَالُ لَهُ : عَبْدُ اللَّهِ بْنُ النَّوَاحَةِ، فَضَرَبَ عُنُقَهُ، فَقَالُوا لَهُ : تَرَكْتَ الْقَوْمَ وَقَتَلْتَ هَذَا؟، فَقَالَ : إِنِّي كُنْتُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَالِسًا إِذْ دَخَلَ هَذَا وَرَجُلٌ وَافِدَيْنِ مِنْ عِنْدِ مُسَيْلَمَةَ، فَقَالَ لَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" أَتَشْهَدَانِ أَنِّي رَسُولُ اللَّهِ؟ \"، فَقَالَا لَهُ : تَشْهَدُ أَنْتَ أَنَّ مُسَيْلَمَةَ رَسُولُ اللَّهِ، فَقَالَ :\" آمَنْتُ بِاللَّهِ وَرُسُلِهِ، لَوْ كُنْتُ قَاتِلًا وَفْدًا، لَقَتَلْتُكُمَا \".\nفَلِذَلِكَ قَتَلْتُهُ.\nوَأَمَرَ بِمَسْجِدِهِمْ فَهُدِمَ",
    "malay_translation": "Telah mengkhabarkan kepada kami Abdullah bin Sa'id, telah menceritakan kepada kami Abu Bakr bin Ayyash, daripada Asim, daripada Abi Wa'il, daripada Ibn Mu'iz as-Sa'di, dia berkata: \"Aku keluar pada waktu sahur untuk menggembala kudaku, lalu aku melewati sebuah masjid dari masjid-masjid Bani Hanifah. Aku mendengar mereka bersaksi bahawa Musailamah adalah Rasulullah. Aku kembali kepada Abdullah bin Mas'ud dan memberitahunya. Lalu dia mengirimkan polis kepada mereka, dan mereka menangkap mereka dan membawa mereka kepadanya. Kaum itu bertaubat dan menarik balik ucapan mereka, lalu dia membebaskan mereka. Kemudian dia membawa seorang lelaki dari mereka yang dipanggil Abdullah bin an-Nawaha, lalu dia memenggal lehernya. Mereka berkata kepadanya: \"Kamu membiarkan kaum itu dan membunuh orang ini?\". Dia berkata: \"Sesungguhnya aku pernah duduk di sisi Rasulullah صلى الله عليه وسلم ketika orang ini dan seorang lelaki masuk sebagai utusan dari Musailamah. Rasulullah صلى الله عليه وسلم berkata kepada mereka berdua: \"Adakah kamu berdua bersaksi bahawa aku adalah Rasulullah?\". Mereka berdua berkata kepadanya: \"Adakah kamu bersaksi bahawa Musailamah adalah Rasulullah?\". Baginda bersabda: \"Aku beriman kepada Allah dan rasul-rasulNya. Sekiranya aku boleh membunuh utusan, nescaya aku akan membunuh kamu berdua\". Oleh kerana itu aku membunuhnya. Dan dia memerintahkan agar masjid mereka dirobohkan.\""
  },
  {
    "id": 39312,
    "hadith_number": 1775,
    "tajuk_hadith": "Larangan Membunuh Mu'ahid Tanpa Alasan yang Benar",
    "perawi_melayu": "Abdullah bin Yazid, Uyainah bin Abdur Rahman bin Jaushan al-Ghatfani, Abu Bakrah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ  ، حَدَّثَنَا عُيَيْنَةُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ جَوْشَنٍ الْغَطَفَانِيُّ  ، عَنْ أَبِيهِ  ، عَنْ أَبِي بَكْرَةَ   : أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :\" مَنْ قَتَلَ مُعَاهَدًا فِي غَيْرِ كُنْهِهِ، حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ \"",
    "malay_translation": "Abdullah bin Yazid telah memberitahu kami, dia berkata: Uyainah bin Abdur Rahman bin Jaushan al-Ghatfani telah menceritakan kepada kami, daripada ayahnya, daripada Abu Bakrah: Sesungguhnya Rasulullah SAW bersabda: \"Barangsiapa membunuh seorang *mu'ahid* (orang bukan Islam yang terikat perjanjian damai dengan kaum Muslimin) tanpa alasan yang benar, maka Allah mengharamkan baginya syurga.\""
  },
  {
    "id": 39313,
    "hadith_number": 1776,
    "tajuk_hadith": "Nazar Tidak Sah dalam Maksiat: Kisah Unta Adhba'",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، عَنْ أَيُّوبَ  ، عَنْ أَبِي قِلَابَةَ  ، عَنْ أَبِي الْمُهَلَّبِ  ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ  ، قَالَ : كَانَتِ الْعَضْبَاءُ لِرَجُلٍ مِنْ بَنِي عَقَيْلٍ فَأُسِرَ، وَأُخِذَتِ الْعَضْبَاءُ ، فَمَرَّ عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي وَثَاقِهِ، فَقَالَ : يَا مُحَمَّدُ، عَلَى مَا تَأْخُذُونِي وَتَأْخُذُونَ سَابِقَةَ الْحَاجِّ، وَقَدْ أَسْلَمْتُ؟، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" لَوْ قُلْتَهَا وَأَنْتَ تَمْلِكُ أَمْرَكَ، أَفْلَحْتَ كُلَّ الْفَلَاحِ \"، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" نَأْخُذُكَ بِجَرِيرَةِ حُلَفَائِكَ \".\nوَكَانَتْ ثَقِيفٌ قَدْ أَسَرُوا رَجُلَيْنِ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.\nوَجَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى حِمَارٍ عَلَيْهِ قَطِيفَةٌ، فَقَالَ : يَا مُحَمَّدُ إِنِّي جَائِعٌ فَأَطْعِمْنِي، وَإِنِّي وَظَمْآنُ فَاسْقِنِي، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" هَذِهِ حَاجَتُكَ \".\nثُمَّ إِنَّ الرَّجُلَ فُدِيَ بِرَجُلَيْنِ، فَحَبَسَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَضْبَاءَ لِرَحْلِهِ وَكَانَتْ مِنْ سَوَابِقِ الْحَاجِّ.\nثُمَّ إِنَّ الْمُشْرِكِينَ أَغَارُوا عَلَى سَرْحِ الْمَدِينَةِ فَذَهَبُوا بِهِ فِيهَا الْعَضْبَاءُ وَأَسَرُوا امْرَأَةً مِنَ الْمُسْلِمِينَ، وَكَانُوا إِذَا نَزَلُوا قَالَ أَبُو مُحَمَّدٍ : ثُمَّ ذَكَرَ كَلِمَةً إِبِلُهُمْ فِي أَفْنِيَتِهِمْ.\nفَلَمَّا كَانَ ذَاتَ لَيْلَةٍ قَامَتْ الْمَرْأَةُ وَقَدْ نُوِّمُوا، فَجَعَلَتْ لَا تَضَعُ يَدَيْهَا عَلَى بَعِيرٍ إِلا رَغَا، حَتَّى أَتَتْ الْعَضْبَاءَ ، فَأَتَتْ عَلَى نَاقَةٍ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَلُولٍ مُجَرَّسَةٍ، فَرَكِبَتْهَا ثُمَّ تَوَجَّهَتْ قِبَلَ الْمَدِينَةِ، وَنَذَرَتْ لَئِنِ اللَّهُ نَجَّاهَا، لَتَنْحَرَنَّهَا.\nقَالَ : فَلَمَّا قَدِمَتِ عُرِفَتِ النَّاقَةُ، فَقِيلَ : نَاقَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَأَتَوْا بِهَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَأَخْبَرَتِ الْمَرْأَةُ بِنَذْرِهَا، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" بِئْسَمَا جَزَيْتِهَا أَوْ بِئْسَمَا جَزَتْهَا إِنَّ اللَّهُ نَجَّاهَا لَتَنْحَرَنَّهَا؟ أَلا لا وَفَاءَ لِنَذْرٍ فِي مَعْصِيَةِ اللَّهِ، وَلا فِيمَا لَا يَمْلِكُ ابْنُ آدَمَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Nu'aim, telah menceritakan kepada kami Hammad bin Zaid, daripada Ayyub, daripada Abi Qilabah, daripada Abi Muhallab, daripada Imran bin Husain, beliau berkata: Adhba' adalah milik seorang lelaki dari Bani Uqail, lalu dia ditawan, dan Adhba' diambil. Kemudian Rasulullah SAW melintasinya ketika dia dalam keadaan terikat. Lalu dia berkata: \"Wahai Muhammad, mengapa kamu menangkapku dan mengambil unta perlumbaan haji, padahal aku telah memeluk Islam?\" Maka Rasulullah SAW bersabda: \"Sekiranya kamu mengatakannya ketika kamu berkuasa, nescaya kamu akan berjaya sepenuhnya.\" Kemudian Rasulullah SAW bersabda: \"Kami menangkapmu disebabkan kesalahan sekutu-sekutumu.\"\n\nDan Bani Thaqif telah menawan dua orang lelaki dari sahabat Rasulullah SAW.\n\nDan Rasulullah SAW datang dengan menunggang seekor keldai yang beralas baldu. Lalu dia berkata: \"Wahai Muhammad, sesungguhnya aku lapar, maka berilah aku makan, dan sesungguhnya aku dahaga, maka berilah aku minum.\" Maka Rasulullah SAW bersabda: \"Ini keperluanmu.\"\n\nKemudian sesungguhnya lelaki itu ditebus dengan pertukaran dua orang lelaki. Lalu Rasulullah SAW menahan Adhba' untuk tunggangan baginda, dan ia adalah antara unta-unta perlumbaan haji yang terdahulu.\n\nKemudian sesungguhnya orang-orang musyrik menyerang ternakan di Madinah, lalu mereka membawa lari ternakan itu, termasuk Adhba', dan mereka menawan seorang wanita Muslim. Dan kebiasaan mereka, apabila berhenti bermalam, Abu Muhammad berkata (dan beliau menyebutkan): unta-unta mereka berada di halaman rumah mereka.\n\nMaka ketika tiba suatu malam, wanita itu bangun ketika mereka sedang tidur. Lalu dia mula meletakkan tangannya pada setiap unta, kecuali ia akan berdengkur, sehingga dia sampai kepada Adhba'. Lalu dia datang kepada unta betina Rasulullah SAW yang jinak lagi terlatih. Lalu dia menungganginya kemudian menuju ke Madinah, dan dia bernazar, sekiranya Allah menyelamatkannya, dia pasti akan menyembelihnya (unta Adhba').\n\nBeliau (Imran) berkata: Maka ketika dia tiba, unta itu dikenali. Lalu dikatakan: \"Ini unta Rasulullah SAW.\" Maka mereka membawa unta itu kepada Nabi SAW. Dan wanita itu memberitahu tentang nazarnya. Maka Rasulullah SAW bersabda: \"Alangkah buruknya balasanmu terhadapnya atau alangkah buruknya balasannya, sesungguhnya Allah telah menyelamatkannya, adakah patut dia menyembelihnya? Ketahuilah, tidak ada kewajipan menunaikan nazar dalam maksiat kepada Allah, dan tidak juga dalam perkara yang tidak dimiliki oleh anak Adam (manusia).\""
  },
  {
    "id": 39314,
    "hadith_number": 1777,
    "tajuk_hadith": "Pengumuman Penting Ali bin Abi Talib diutus oleh Rasulullah SAW",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا بِشْرُ بْنُ ثَابِتٍ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ الْمُغِيرَةِ  ، عَنْ الشَّعْبِيِّ  ، عَنْ مُحَرَّرِ بْنِ أَبِي هُرَيْرَةَ  ، عَنْ أَبِيهِ  ، قالَ : \" كُنْتُ مَعَ عَلِيِّ بْنِ أَبِي طَالِبٍ لَمَّا بَعَثَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَادَى بِأَرْبَعٍ حَتَّى صَهَلَ صَوْتُهُ :أَلا لا يَدْخُلُ الْجَنَّةَ إِلا نَفْسٌ مُسْلِمَةٌ، وَلَا يَحُجَّنَّ بَعْدَ الْعَامِ مُشْرِكٌ، وَلَا يَطُوفُ بِالْبَيْتِ عُرْيَانُ.\nوَمَنْ كَانَ بَيْنَهُ وَبَيْنَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَهْدٌ، فَإِنَّ أَجَلَهُ إِلَى أَرْبَعَةِ أَشْهُرٍ، فَإِذَا مَضَتِ الْأَرْبَعَةُ، فَإِنَّ اللَّهَ بَرِيءٌ مِنَ الْمُشْرِكِينَ وَرَسُولُهُ \"",
    "malay_translation": "Bishr bin Thabit telah memberitahu kami, katanya: Syu'bah telah menceritakan kepada kami, daripada al-Mughirah, daripada al-Sha'bi, daripada Muharrir bin Abu Hurairah, daripada bapanya, katanya: \"Saya bersama Ali bin Abi Talib ketika Rasulullah SAW mengutusnya, lalu beliau menyeru dengan empat perkara sehingga serak suaranya: 'Ketahuilah, tidak akan masuk syurga kecuali jiwa yang Muslim, dan janganlah orang musyrik menunaikan haji setelah tahun ini, dan janganlah ada yang tawaf di Baitullah dalam keadaan telanjang. Sesiapa yang mempunyai perjanjian antara dia dan Rasulullah SAW, maka tempoh perjanjiannya adalah sehingga empat bulan. Apabila telah berlalu empat bulan, maka sesungguhnya Allah dan Rasul-Nya berlepas diri daripada orang-orang musyrik.'\""
  },
  {
    "id": 39315,
    "hadith_number": 1778,
    "tajuk_hadith": "Perjanjian Hudaibiyah dan Keengganan Ali RA Memadamkan Gelaran Rasulullah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ إِسْرَائِيلَ  ، حَدَّثَنَا أَبُو إِسْحَاق  ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ  ، قَالَ : اعْتَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ذِي الْقَعْدَةِ فَأَبَى أَهْلُ مَكَّةَ أَنْ يَدَعُوهُ أَنْ يَدْخُلَ مَكَّةَ حَتَّى قَاضَاهُمْ عَلَى أَنْ يُقِيمَ ثَلَاثَةَ أَيَّامٍ، فَلَمَّا كَتَبُوا : هَذَا مَا قَاضَى عَلَيْهِ مُحَمَّدٌ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالُوا : لأَنُقِرُّ بِهَذَا، لَوْ نَعْلَمُ أَنَّكَ رَسُولُ اللَّهِ، مَا مَنَعْنَاكَ شَيْئًا، وَلَكِنْ أَنْتَ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ ، فَقَالَ :\" أَنَا رَسُولُ اللَّهِ، وَأَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ \"، فَقَالَ لِعَلِيٍّ : \" امْحُ : مُحَمَّدٌ رَسُولُ اللَّهِ \"، فَقَالَ : لا وَاللَّهِ لا أَمْحُوهُ أَبَدًا.\nفَأَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْكِتَابَ وَلَيْسَ يُحْسِنُ يَكْتُبُ، فَكَتَبَ مَكَانَ رَسُولِ اللَّهِ هَذَا مَا قَاضَى عَلَيْهِ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ : أَنْ لَا يَدْخُلَ مَكَّةَ بِسِلَاحٍ إِلا السَّيْفَ فِي الْقِرَابِ، وَأَنْ لَا يُخْرِجَ مِنْ أَهْلِهَا أَحَدًا أَرَادَ أَنْ يَتْبَعَهُ، وَلا يَمْنَعَ أَحَدًا مِنْ أَصْحَابِهِ أَرَادَ أَنْ يُقِيمَ بِهَا.\nفَلَمَّا دَخَلَهَا وَمَضَى الأَجَلُ، أَتَوْا عَلِيًّا، فَقَالُوا : قُلْ لِصَاحِبِكَ فَلْيَخْرُجْ عَنَّا فَقَدْ مَضَى الْأَجَلُ",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Yusuf, daripada Israil, telah menceritakan kepada kami Abu Ishaq, daripada al-Bara' bin Azib RA, beliau berkata: Rasulullah SAW melakukan umrah pada bulan Zulkaedah. Penduduk Mekah enggan membenarkan baginda memasuki Mekah sehingga mereka berdamai dengan baginda dengan syarat baginda akan tinggal selama tiga hari. Apabila mereka menulis: \"Ini adalah perjanjian yang dibuat oleh Muhammad, Rasulullah SAW,\" mereka berkata: \"Kami tidak akan bersetuju dengan ini. Jika kami tahu engkau adalah Rasulullah, kami tidak akan menghalangmu sedikit pun. Tetapi engkau adalah Muhammad bin Abdullah.\" Baginda bersabda: \"Aku adalah Rasulullah, dan aku adalah Muhammad bin Abdullah.\" Kemudian baginda bersabda kepada Ali RA: \"Padamkanlah: Muhammad, Rasulullah.\" Ali RA berkata: \"Tidak, demi Allah, aku tidak akan memadamkannya selama-lamanya.\"\n\nKemudian Rasulullah SAW mengambil perjanjian itu, dan baginda tidak pandai menulis. Baginda menulis di tempat \"Rasulullah\": \"Ini adalah perjanjian yang dibuat oleh Muhammad bin Abdullah: bahawa dia tidak akan memasuki Mekah dengan senjata kecuali pedang di sarungnya, dan tidak mengeluarkan seorang pun dari penduduk Mekah yang ingin mengikutinya, dan tidak menghalang seorang pun daripada sahabatnya yang ingin tinggal di sana.\"\n\nApabila baginda memasuki Mekah dan tempoh perjanjian telah tamat, mereka datang kepada Ali RA dan berkata: \"Katakan kepada sahabatmu untuk keluar daripada kami, sesungguhnya tempoh perjanjian telah tamat.\""
  },
  {
    "id": 39316,
    "hadith_number": 1779,
    "tajuk_hadith": "Dua Hamba dari Ta'if Dibebaskan oleh Nabi SAW",
    "perawi_melayu": "Abdullah bin Sa'id, Abu Khalid, al-Hajjaj, al-Hakam, Miqsam, Ibn Abbas",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ  ، حَدَّثَنَا أَبُو خَالِدٍ  ، عَنْ الْحَجَّاجِ  ، عَنْ الْحَكَمِ  ، عَنْ مِقْسَمٍ  ، عَنِ ابْنِ عَبَّاسٍ  ، قَالَ :\" خَرَجَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَبْدَانِ مِنَ الطَّائِفِ، فَأَعْتَقَهُمَا.\nأَحَدُهُمَا أَبُو بَكْرَةَ \"",
    "malay_translation": "Abdullah bin Sa'id memberitahu kami, Abu Khalid menceritakan kepada kami, daripada al-Hajjaj, daripada al-Hakam, daripada Miqsam, daripada Ibn Abbas, dia berkata: 'Dua orang hamba dari Ta'if datang kepada Nabi SAW, dan baginda memerdekakan mereka berdua. Salah seorang daripada mereka adalah Abu Bakrah.'"
  },
  {
    "id": 39317,
    "hadith_number": 1780,
    "tajuk_hadith": "Hukum Saad bin Mu'adh Terhadap Bani Quraizah dan Kematiannya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ  ، عَنْ أَبِي الزُّبَيْرِ  ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ  ، أَنَّهُ قَالَ : رُمِيَ يَوْمَ الْأَحْزَابِ سَعْدُ بْنُ مُعَاذٍ، فَقَطَعُوا أَبْجَلَهُ فَحَسَمَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالنَّارِ، فَانْتَفَخَتْ، يَدُهُ فَنَزَفَهُ فَحَسَمَهُ أُخْرَى، فَانْتَفَخَتْ يَدُهُ فَلَمَّا رَأَى ذَلِكَ قَالَ : اللَّهُمَّ لَا تُخْرِجْ نَفْسِي حَتَّى تُقِرَّ عَيْنِي مِنْ بَنِي قُرَيْظَةَ، فَاسْتَمْسَكَ عِرْقُهُ فَمَا قَطَرَ قَطْرَةً حَتَّى نَزَلُوا عَلَى حَكْمِ سَعْدٍ.\nفَأَرْسَلَ إِلَيْهِ، فَحَكَمَ أَنْ تُقْتَلَ رِجَالُهُمْ، وَتُسْتَحْيَا نِسَاؤُهُمْ وَذَرَارِيُّهُمْ لِيَسْتَعِينُ بِهِمُ الْمُسْلِمُونَ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" أَصَبْتَ حُكْمَ اللَّهِ فِيهِمْ \".\nوَكَانُوا أَرْبَعَ مِائَةٍ، فَلَمَّا فُرِغَ مِنْ قَتْلِهِمُ، انْفَتَقَ عِرْقُهُ فَمَاتَ",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Abdullah, telah menceritakan kepada kami Laith bin Sa'd, dari Abu Zubair, dari Jabir bin Abdullah, bahawa dia berkata: Saad bin Mu'adh telah terkena panah pada hari Ahzab, lalu mereka memotong uratnya dan Rasulullah SAW membakarnya dengan api, lalu tangannya membengkak, lalu dia mengeluarkan darahnya dan membakarnya lagi, lalu tangannya membengkak. Ketika dia melihat itu, dia berkata: \"Ya Allah, janganlah Engkau cabut nyawaku sehingga Engkau menggembirakan mataku (dengan kehancuran) Bani Quraizah.\" Lalu uratnya tertutup dan tidak menetes setetes pun hingga mereka menyerah kepada hukum Saad.\n\nLalu dia (Rasulullah SAW) mengirim utusan kepadanya (Saad), lalu dia (Saad) memutuskan agar lelaki mereka dibunuh, dan wanita serta anak-anak mereka dibiarkan hidup agar kaum Muslimin dapat memanfaatkan mereka. Maka Rasulullah SAW bersabda: \"Kamu telah memutuskan hukum Allah terhadap mereka.\"\n\nDan jumlah mereka adalah empat ratus. Ketika selesai dari membunuh mereka, uratnya terbuka dan dia meninggal dunia."
  },
  {
    "id": 39318,
    "hadith_number": 1781,
    "tajuk_hadith": "Keutamaan Makkah di Sisi Allah",
    "perawi_melayu": "Abdullah bin Salih, Al-Laith, Uqail, Ibn Shihab, Abu Salamah bin Abdul Rahman, Abdullah bin Adiy bin Al-Hamra' Az-Zuhri",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، حَدَّثَنِي اللَّيْثُ  ، حَدَّثَنِي عُقَيْلٌ  ، عَنْ ابْنِ شِهَابٍ  ، أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ  : أَنَّ عَبْدَ اللَّهِ بْنَ عَدِيِّ بْنِ الْحَمْرَاءِ الزُّهْرِيَّ  ، قَالَ : رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى رَاحِلَتِهِ وَاقِفًا بِالْحَزْوَرَةِ ، يَقُولُ :\" وَاللَّهِ إِنَّكِ لَخَيْرُ أَرْضِ اللَّهِ، وَأَحَبُّ أَرْضِ اللَّهِ إِلَى اللَّهِ، وَلَوْلا أَنِّي أُخْرِجْتُ مِنْكِ مَا خَرَجْتُ \"",
    "malay_translation": "Abdullah bin Salih memberitahu kami, katanya, Al-Laith memberitahu saya, katanya, Uqail memberitahu saya, daripada Ibn Shihab, Abu Salamah bin Abdul Rahman memberitahu saya: Bahawa Abdullah bin Adiy bin Al-Hamra' Az-Zuhri berkata: Saya melihat Rasulullah SAW sedang menunggang kenderaannya berdiri di Hazwarah, bersabda: \"Demi Allah, sesungguhnya engkau adalah sebaik-baik bumi Allah, dan bumi Allah yang paling dicintai oleh Allah, dan kalaulah bukan kerana aku dikeluarkan daripadamu, aku tidak akan keluar.\""
  },
  {
    "id": 39319,
    "hadith_number": 1782,
    "tajuk_hadith": "Larangan Mencela Orang yang Telah Meninggal Dunia",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ الرَّبِيعِ  ، أَخْبَرَنَا شُعْبَةُ  ، عَنْ سُلَيْمَانَ  ، عَنْ مُجَاهِدٍ  ، قَالَ : قَالَتْ عَائِشَةُ   : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَا تَسُبُّوا الْأَمْوَاتَ، فَإِنَّهُمْ قَدْ أَفْضَوْا إِلَى مَا قَدَّمُوا \"",
    "malay_translation": "Telah menceritakan kepada kami Sa'id bin ar-Rabi', telah mengkhabarkan kepada kami Syu'bah, dari Sulaiman, dari Mujahid, dia berkata: Aisyah berkata: Rasulullah ﷺ bersabda: \"Janganlah kamu mencela orang-orang yang telah meninggal dunia, kerana sesungguhnya mereka telah sampai kepada apa yang telah mereka lakukan.\""
  },
  {
    "id": 39320,
    "hadith_number": 1783,
    "tajuk_hadith": "Tiada Hijrah Selepas Pembukaan Mekah, Tetapi Jihad dan Niat",
    "perawi_melayu": "Ubaidullah bin Musa, Israil, Mansur, Mujahid, Tawus, Ibn Abbas",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، عَنْ إِسْرَائِيلَ  ، عَنْ مَنْصُورٍ  ، عَنْ مُجَاهِدٍ  ، عَنْ طَاوُسٍ  ،  عَنِ ابْنِ عَبَّاسٍ  ، قَالَ : لَمَّا كَانَ يَوْمُ فَتْحِ مَكَّةَ، قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لا هِجْرَةَ بَعْدَ الْفَتْحِ، وَلَكِنْ جِهَادٌ وَنِيَّةٌ، وَإِذَا استُنْفِرْتُمْ، فَانْفِرُوا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ubaidullah bin Musa, daripada Israil, daripada Mansur, daripada Mujahid, daripada Tawus, daripada Ibn Abbas, beliau berkata: Ketika hari pembukaan Mekah, Rasulullah SAW bersabda: \"Tidak ada hijrah selepas pembukaan (Mekah), tetapi jihad dan niat, dan jika kamu diseru untuk berperang, maka berperanglah.\""
  },
  {
    "id": 39321,
    "hadith_number": 1784,
    "tajuk_hadith": "Hijrah Berterusan Selagi Pintu Taubat Terbuka",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ  ، عَنْ حَرِيزِ بْنِ عُثْمَانَ  ، عَنْ ابْنِ أَبِي عَوْفٍ، وَهُو : عَبْدُ الرَّحْمَنِ  ، عَنْ أَبِي هِنْدٍ الْبَجَلِيِّ  وَكَانَ مِنَ السَّلَفِ .\nقَالَ : تَذَاكَرُوا الْهِجْرَةَ عِنْدَ مُعَاوِيَةَ   وَهُوَ عَلَى سَرِيرِهِ، فَقَالَ : سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" لا تَنْقَطِعُ الْهِجْرَةُ حَتَّى تَنْقَطِعَ التَّوْبَةُ ثَلَاثًا وَلا تَنْقَطِعُ التَّوْبَةُ حَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا \"",
    "malay_translation": "Telah menceritakan kepada kami al-Hakam bin Nafi', daripada Hariz bin Uthman, daripada Ibn Abi Auf, iaitu Abd al-Rahman, daripada Abi Hind al-Bajali dan beliau adalah daripada salafus soleh.\nBeliau berkata: Mereka berbincang mengenai hijrah di sisi Muawiyah, ketika itu beliau berada di atas katilnya, lalu beliau berkata: Aku mendengar Nabi صلى الله عليه وسلم bersabda: \"Hijrah tidak akan terputus sehingga taubat terputus (tiga kali), dan taubat tidak akan terputus sehingga matahari terbit dari baratnya.\""
  },
  {
    "id": 39322,
    "hadith_number": 1785,
    "tajuk_hadith": "Keutamaan Menjadi Ansar Sekiranya Bukan Kerana Hijrah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا مُحَمَّدُ بْنُ عَمْرٍو  ، عَنْ أَبِي سَلَمَةَ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَوْلا الْهِجْرَةُ، لَكُنْتُ امْرَءًا مِنَ الْأَنْصَارِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah mengkhabarkan kepada kami Muhammad bin 'Amru, daripada Abu Salamah, daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: \"Sekiranya bukan kerana Hijrah, nescaya aku akan menjadi seorang lelaki daripada Ansar.\""
  },
  {
    "id": 39323,
    "hadith_number": 1786,
    "tajuk_hadith": "Tanggungjawab Ketua di Hari Kiamat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا حَجَّاجُ بْنُ مِنْهَالٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ يَحْيَى بْنِ سَعِيدٍ  ، عَنْ سَعِيدِ بْنِ يَسَارٍ  ، عَنْ أَبِي هُرَيْرَةَ   : أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَا مِنْ أَمِيرِ عَشَرَةٍ إِلَّا يُؤْتَى بِهِ يَوْمَ الْقِيَامَةِ، مَغْلُولَةً يَدَاهُ إِلَى عُنُقِهِ، أَطْلَقَهُ الْحَقُّ أَوْ أَوْبَقَهُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Hajjaj bin Minhal, telah menceritakan kepada kami Hammad bin Salamah, daripada Yahya bin Said, daripada Said bin Yasar, daripada Abu Hurairah RA: Bahawa Nabi Allah SAW bersabda: \"Tidak ada seorang ketua (amir) bagi sepuluh orang kecuali dia akan dibawa pada Hari Kiamat dengan tangan terbelenggu ke lehernya; sama ada kebenaran melepaskannya atau membinasakannya.\""
  },
  {
    "id": 39324,
    "hadith_number": 1787,
    "tajuk_hadith": "Larangan Melakukan Kezaliman",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا شُعْبَةُ  ، أَخْبَرَنِي عَمْرٌو  ، قَالَ : سَمِعْتُ عَبْدَ اللَّهِ بْنَ الْحَارِثِ  يُحَدِّثُ عَنْ أَبِي كَثِيرٍ  ، قَالَ : سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرٍو   يُحَدِّثُ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" إِيَّاكُمْ وَالظُّلْمَ، فَإِنَّ الظُّلْمَ ظُلُمَاتٌ يَوْمَ الْقِيَامَةِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu al-Walid, telah menceritakan kepada kami Syu'bah, telah mengkhabarkan kepadaku 'Amr, dia berkata: Aku mendengar Abdullah bin al-Harith menceritakan daripada Abu Kathir, dia berkata: Aku mendengar Abdullah bin 'Amr menceritakan, daripada Nabi صلى الله عليه وسلم, beliau bersabda: \"Jauhilah oleh kamu kezaliman, kerana sesungguhnya kezaliman itu adalah kegelapan pada hari kiamat.\""
  },
  {
    "id": 39325,
    "hadith_number": 1788,
    "tajuk_hadith": "Allah Menguatkan Agama dengan Lelaki yang Fajir",
    "perawi_melayu": "Abu Hurairah R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ  ، أَخْبَرَنَا شُعَيْبٌ  ، عَنْ الزُّهْرِيِّ  ، أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيِّبِ  : أَنَّ أَبَا هُرَيْرَةَ  ، قَالَ : إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" إِنَّ اللَّهَ يُؤَيِّدُ هَذَا الدِّينَ بِالرَّجُلِ الْفَاجِرِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Hakam bin Nafi', telah mengkhabarkan kepada kami Syu'aib, daripada al-Zuhri, telah mengkhabarkan kepadaku Sa'id bin al-Musayyib: bahawa Abu Hurairah R.A. berkata: Sesungguhnya Nabi SAW bersabda: \"Sesungguhnya Allah menguatkan agama ini dengan lelaki yang fajir (jahat).\""
  },
  {
    "id": 39326,
    "hadith_number": 1789,
    "tajuk_hadith": "Perpecahan Umat Islam kepada Tujuh Puluh Tiga Golongan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْمُغِيرَةِ  ، حَدَّثَنَا صَفْوَانُ  ، حَدَّثَنِي أَزْهَرُ بْنُ عَبْدِ اللَّهِ الْحَرَازِيُّ  ، عَنْ أَبِي عَامِرٍ هُوَ عَبْدُ اللَّهِ بْنُ لُحَيٍّ الْهَوْزَنِيِّ  ، عَنْ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ فِينَا، فَقَالَ :\" أَلا إِنَّ مَنْ كَانَ قَبْلَكُمْ مِنْ أَهْلِ الْكِتَابِ افْتَرَقُوا عَلَى ثِنْتَيْنِ وَسَبْعِينَ مِلَّةً، وَإِنَّ هَذِهِ الْأُمَّةَ سَتَفْتَرِقُ عَلَى ثَلَاثٍ وَسَبْعِينَ : اثْنَتَانِ وَسَبْعُونَ فِي النَّارِ، وَوَاحِدَةٌ فِي الْجَنَّةِ \".\nقَالَ عَبْد اللَّهِ : الْحَرَازُ قَبِيلَةٌ مِنْ أَهْلِ الْيَمَنِ",
    "malay_translation": "Abu al-Mughirah telah memberitahu kami, Safwan telah menceritakan kepada kami, Azhar bin Abdullah al-Harazi telah menceritakan kepada saya, daripada Abu Amir, iaitu Abdullah bin Luhay al-Hawzani, daripada Muawiyah bin Abi Sufyan: Bahawa Rasulullah SAW berdiri di kalangan kami, lalu bersabda: \"Ketahuilah, sesungguhnya umat-umat sebelum kamu dari kalangan Ahli Kitab telah berpecah kepada tujuh puluh dua golongan. Dan sesungguhnya umat ini akan berpecah kepada tujuh puluh tiga golongan: tujuh puluh dua golongan di dalam Neraka dan satu golongan di dalam Syurga.\" Abdullah berkata: Al-Haraz adalah sebuah kabilah dari penduduk Yaman."
  },
  {
    "id": 39327,
    "hadith_number": 1790,
    "tajuk_hadith": "Kesabaran Terhadap Perkara yang Dibenci dari Pemimpin",
    "perawi_melayu": "Ibnu Abbas",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، عَنْ الْجَعْدِ : أَبِي عُثْمَانَ  ، حَدَّثَنَا أَبُو رَجَاءٍ الْعُطَارِدِيُّ  ، قَالَ : سَمِعْتُ ابْنَ عَبَّاسٍ   يَرْوِيهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنْ رَأَى مِنْ أَمِيرِهِ شَيْئًا يَكْرَهُهُ، فَلْيَصْبِرْ، فَإِنَّهُ لَيْسَ مِنْ أَحَدٍ يُفَارِقُ الْجَمَاعَةَ شِبْرًا، فَيَمُوتُ، إِلا مَاتَ مِيتَةً جَاهِلِيَّةً \"",
    "malay_translation": "Telah menceritakan kepada kami Hajjaj bin Minhal, telah menceritakan kepada kami Hammad bin Zaid, dari al-Ja'd, iaitu Abu Uthman, telah menceritakan kepada kami Abu Raja' al-Utaridi, dia berkata: Aku mendengar Ibnu Abbas meriwayatkannya dari Nabi ﷺ, beliau bersabda: \"Barangsiapa melihat dari pemimpinnya sesuatu yang dia benci, maka hendaklah dia bersabar. Kerana sesungguhnya tidak ada seorang pun yang memisahkan diri dari jemaah walaupun sejengkal, lalu dia mati, kecuali dia mati dalam keadaan jahiliyah.\""
  },
  {
    "id": 39328,
    "hadith_number": 1791,
    "tajuk_hadith": "Larangan Menghunus Senjata Terhadap Sesama Muslim",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ  ، حَدَّثَنَا إِيَاسُ بْنُ سَلَمَةَ  ، عَنْ أَبِيهِ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنْ سَلَّ عَلَيْنَا السِّلَاحَ، فَلَيْسَ مِنَّا \"",
    "malay_translation": "Abu al-Walid memberitahu kami, Ikrimah bin Ammar memberitahu kami, Iyas bin Salamah memberitahu kami, daripada bapanya, daripada Nabi ﷺ, baginda bersabda: 'Sesiapa yang menghunuskan senjata ke atas kami, maka dia bukan daripada golongan kami.'"
  },
  {
    "id": 39329,
    "hadith_number": 1792,
    "tajuk_hadith": "Kepimpinan dalam Quraisy dan Akibat Memusuhi Mereka",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ  ، عَنْ شُعَيْبِ بْنِ أَبِي حَمْزَةَ  ، عَنْ الزُّهْرِيِّ  ، قَالَ : كَانَ مُحَمَّدُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍ  يُحَدِّثُ عَنْ مُعَاوِيَةَ   أَنَّهُ قَالَ وَهُوَ عِنْدَهُ فِي وَفْدٍ مِنْ قُرَيْشٍ : إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" إِنَّ هَذَا الْأَمْرَ فِي قُرَيْشٍ، لَا يُعَادِيهِمْ أَحَدٌ إِلَّا كَبَّهُ اللَّهُ عَلَى وَجْهِهِ، مَا أَقَامُوا الدِّينَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Hakam bin Nafi', daripada Syuaib bin Abi Hamzah, daripada al-Zuhri, dia berkata: Muhammad bin Jubair bin Mut'im menceritakan daripada Mu'awiyah, bahawa dia berkata ketika dia berada bersamanya dalam delegasi dari Quraisy: 'Sesungguhnya aku mendengar Rasulullah SAW bersabda: 'Sesungguhnya urusan ini (kepimpinan) berada pada Quraisy. Tidak seorang pun yang memusuhi mereka kecuali Allah akan menelungkupkannya di atas wajahnya, selama mereka menegakkan agama.'"
  },
  {
    "id": 39330,
    "hadith_number": 1793,
    "tajuk_hadith": "Kabilah-kabilah yang Tidak Mempunyai Pelindung Selain Allah dan Rasul-Nya",
    "perawi_melayu": "Muhammad bin Yusuf, Sufyan, Saad bin Ibrahim, Abdul Rahman bin Hurmuz al-A'raj, Abu Hurairah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ الْأَعْرَجِ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" قُرَيْشٌ، وَالْأَنْصَارُ، وَمُزَيْنَةُ وَجُهَيْنَةُ، وَأَسْلَمُ، وَغِفَارٌ، وَأَشْجَعُ، لَيْسَ لَهُمْ مَوْلًى دُونَ اللَّهِ وَرَسُولِهِ \"",
    "malay_translation": "Muhammad bin Yusuf memberitahu kami, daripada Sufyan, daripada Saad bin Ibrahim, daripada Abdul Rahman bin Hurmuz al-A'raj, daripada Abu Hurairah, dia berkata: Rasulullah SAW bersabda: \"Quraisy, Ansar, Muzainah, Juhainah, Aslam, Ghifar, dan Asyja', tidak ada pelindung bagi mereka selain Allah dan Rasul-Nya.\""
  },
  {
    "id": 39331,
    "hadith_number": 1794,
    "tajuk_hadith": "Keutamaan Kabilah Aslam, Ghifar, Muzainah, dan Juhainah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ عَلِيِّ بْنِ زَيْدٍ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ  ، عَنْ أَبِيهِ   : أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" أَرَأَيْتُمْ إِنْ كَانَ أَسْلَمُ، وَغِفَارٌ خَيْرًا مِنَ الْحَلِيفَيْنِ أَسَدٍ وَغَطَفَانَ، أَتُرَوْنَهُمْ خَسِرُوا؟ \".\nقَالُوا : نَعَمْ.\nقَالَ : \" فَإِنَّهُمْ خَيْرٌ مِنْهُمْ \".\nقَالَ : \" أَفَرَأَيْتُمْ إِنْ كَانَتْ مُزَيْنَةُ، وَجُهَيْنَةُ خَيْرًا مِنْ تَمِيمٍ وَعَامِرِ بْنِ صَعْصَعَةَ وَمَدَّ بِهَا صَوْتَهُ أَتُرَوْنَهُمْ خَسِرُوا؟ \".\nقَالُوا : نَعَمْ.\nقَالَ : \" فَإِنَّهُمْ خَيْرٌ مِنْهُمْ \"",
    "malay_translation": "Telah menceritakan kepada kami Hajjaj bin Minhal, telah menceritakan kepada kami Hammad bin Salamah, dari Ali bin Zaid, dari Abdurrahman bin Abi Bakrah, dari ayahnya, bahawa Nabi SAW bersabda: \"Bagaimana pendapat kamu jika Aslam dan Ghifar lebih baik daripada dua sekutu Asad dan Ghatafan, adakah kamu melihat mereka rugi?\". Mereka berkata: \"Ya\". Baginda bersabda: \"Sesungguhnya mereka lebih baik daripada mereka\". Baginda bersabda: \"Bagaimana pendapat kamu jika Muzainah dan Juhainah lebih baik daripada Tamim dan Amir bin Sha'sha'ah,\" dan baginda memanjangkan suaranya, \"adakah kamu melihat mereka rugi?\". Mereka berkata: \"Ya\". Baginda bersabda: \"Sesungguhnya mereka lebih baik daripada mereka\"."
  },
  {
    "id": 39332,
    "hadith_number": 1795,
    "tajuk_hadith": "Doa Rasulullah ﷺ untuk Suku Ghifar dan Aslam",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ  ، حَدَّثَنَا سُلَيْمَانُ هُوَ : ابْنُ الْمُغِيرَةِ  عَنْ حُمَيْدِ بْنِ هِلَالٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ  ، عَنْ أَبِي ذَرٍّ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" غِفَارٌ غَفَرَ اللَّهُ لَهَا، وَأَسْلَمُ سَالَمَهَا اللَّهُ \"",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Maslamah, telah menceritakan kepada kami Sulaiman iaitu Ibnu al-Mughirah, daripada Humaid bin Hilal, daripada Abdullah bin as-Samit, daripada Abu Dzar, dia berkata: Rasulullah ﷺ bersabda: \"Ghafar, semoga Allah mengampuninya, dan Aslam, semoga Allah menyelamatkannya.\""
  },
  {
    "id": 39333,
    "hadith_number": 1796,
    "tajuk_hadith": "Keberkatan bagi Ghafar dan Aslam, Kecelakaan bagi Usayyah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ  ، حَدَّثَنَا عَبْدُ الْعَزِيزِ  ، عَنْ مُوسَى بْنِ عُقْبَةَ  ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ  ، عَنِ ابْنِ عُمَرَ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" غِفَارٌ غَفَرَ اللَّهُ لَهَا، وَأَسْلَمُ سَالَمَهَا اللَّهُ، وَعُصَيَّةُ عَصَتِ اللَّهَ وَرَسُولَهُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Hakam bin al-Mubarak, telah menceritakan kepada kami Abdul Aziz, daripada Musa bin Uqbah, daripada Abdullah bin Dinar, daripada Ibn Umar: Sesungguhnya Rasulullah ﷺ bersabda: 'Ghafar, Allah mengampuninya, dan Aslam, Allah menyelamatkannya, dan Usayyah, ia menderhakai Allah dan Rasul-Nya.'"
  },
  {
    "id": 39334,
    "hadith_number": 1797,
    "tajuk_hadith": "Tiada Ikrar dalam Islam, Ikrar Jahiliyyah Diperkukuh oleh Islam",
    "perawi_melayu": "Ibnu Abbas",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا شَرِيكٌ  ، عَنْ سِمَاكٍ  ، عَنْ عِكْرِمَةَ  ، عَنِ ابْنِ عَبَّاسٍ   قِيلَ لِشَرِيكٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟.\nقَالَ : نَعَمْ\" لا حِلْفَ فِي الْإِسْلَامِ، وَالْحِلْفُ فِي الْجَاهِلِيَّةِ لَمْ يَزِدْهُ الْإِسْلَامُ إِلَّا شِدَّةً وَحِدَّةً \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Nu'aim, telah menceritakan kepada kami Syarik, daripada Simak, daripada Ikrimah, daripada Ibnu Abbas, dikatakan kepada Syarik daripada Nabi صلى الله عليه وسلم?. Dia berkata: Ya, 'Tiada ikrar dalam Islam, dan ikrar di zaman Jahiliyyah tidaklah Islam menambahnya kecuali dengan lebih kuat dan lebih tajam.'"
  },
  {
    "id": 39335,
    "hadith_number": 1798,
    "tajuk_hadith": "Pertanyaan tentang Status Nu'man bin Muqarrin di Kalangan Kaumnya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا شُعْبَةُ  ، قَالَ : قُلْتُ لِمُعَاوِيَةَ بْنِ قُرَّةَ  : أَكَانَ أَنَسٌ   يَذْكُرُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِلنُّعْمَانِ بْنِ مُقَرِّنٍ :\" ابْنُ أُخْتِ الْقَوْمِ مِنْهُمْ؟ \".\nقَالَ : نَعَمْ",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Nu'aim, telah menceritakan kepada kami Syu'bah, dia berkata: Aku berkata kepada Mu'awiyah bin Qurrah: Adakah Anas ذكر (meriwayatkan) bahawa Nabi صلى الله عليه وسلم bersabda kepada Nu'man bin Muqarrin: \"Anak saudara perempuan kaum itu daripada mereka?\" Dia berkata: \"Ya.\""
  },
  {
    "id": 39336,
    "hadith_number": 1799,
    "tajuk_hadith": "Golongan yang Dikira Sebahagian daripada Kaum",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ الْمُغِيرَةِ  ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ  ، عَنْ كَثِيرِ بْنِ عَبْدِ اللَّهِ  ، عَنْ أَبِيهِ  ، عَنْ جَدِّهِ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَوْلَى الْقَوْمِ مِنْهُمْ، وَحَلِيفُ الْقَوْمِ مِنْهُمْ، وَابْنُ أُخْتِ الْقَوْمِ مِنْهُمْ \"",
    "malay_translation": "Telah menceritakan kepada kami Sa'id bin al-Mughirah, telah menceritakan kepada kami Isa bin Yunus, daripada Kathir bin Abdullah, daripada bapanya, daripada datuknya, dia berkata: Rasulullah SAW bersabda: \"Hamba sahaya suatu kaum adalah daripada golongan mereka, sekutu suatu kaum adalah daripada golongan mereka, dan anak saudara perempuan suatu kaum adalah daripada golongan mereka.\""
  },
  {
    "id": 39337,
    "hadith_number": 1800,
    "tajuk_hadith": "Ancaman Laknat bagi Mereka yang Mengaku Nasab Palsu",
    "perawi_melayu": "Muslim bin Ibrahim, Hisyam ad-Dastawai, Qatadah, Syahr bin Hausyab, Abdurrahman bin Ghanm, 'Amr bin Kharijah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا هِشَامٌ الدَّسْتَوَائِيُّ  ، حَدَّثَنَا قَتَادَةُ  ، عَنْ شَهْرِ بْنِ حَوْشَبٍ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ  ، عَنْ عَمْرِو بْنِ خَارِجَةَ  ، قَالَ : كُنْتُ تَحْتَ نَاقَةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَمِعْتُهُ، يَقُولُ :\" مَنِ ادَّعَى إِلَى غَيْرِ أَبِيهِ، أَوِ انْتَمَى إِلَى غَيْرِ مَوَالِيهِ، رَغْبَةً عَنْهُمْ، فَعَلَيْهِ لَعْنَةُ اللَّهِ، وَالْمَلَائِكَةِ، وَالنَّاسِ أَجْمَعِينَ، لَا يُقْبَلُ مِنْهُ صَرْفٌ وَلَا عَدْلٌ \"",
    "malay_translation": "Telah menceritakan kepada kami Muslim bin Ibrahim, telah menceritakan kepada kami Hisyam ad-Dastawai, telah menceritakan kepada kami Qatadah, dari Syahr bin Hausyab, dari Abdurrahman bin Ghanm, dari 'Amr bin Kharijah, dia berkata: Aku berada di bawah unta Nabi ﷺ, lalu aku mendengar baginda bersabda: \"Sesiapa yang mengaku (nasab) kepada selain ayahnya, atau menisbahkan diri kepada bukan walinya, kerana tidak menyukai mereka, maka baginya laknat Allah, malaikat, dan seluruh manusia. Tidak diterima daripadanya *sharaf* (tebusan) dan tidak juga *adl* (penebus dosa).\""
  },
  {
    "id": 39338,
    "hadith_number": 1801,
    "tajuk_hadith": "Haramnya Syurga bagi Orang yang Mengaku Nasab kepada Selain Bapanya",
    "perawi_melayu": "Sa'id bin 'Amir, Syu'bah, 'Asim, Abi 'Uthman, Sa'd dan Abi Bakrah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ  ، عَنْ شُعْبَةَ  ، عَنْ عَاصِمٍ  ، عَنْ أَبِي عُثْمَانَ  ،  عَنْ سَعْدٍ   وَأَبِي بَكْرَةَ   أَنَّهُمَا حَدَّثَا : أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنِ ادَّعَى إِلَى غَيْرِ أَبِيهِ وَهُوَ يَعْلَمُ أَنَّهُ غَيْرُ أَبِيهِ، فَالْجَنَّةُ عَلَيْهِ حَرَامٌ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Sa'id bin 'Amir, daripada Syu'bah, daripada 'Asim, daripada Abi 'Uthman, daripada Sa'd dan Abi Bakrah, bahawa mereka berdua menceritakan: Sesungguhnya Rasulullah SAW bersabda: \"Sesiapa yang mengaku (bernasab) kepada selain bapanya sedangkan dia mengetahui bahawa orang itu bukan bapanya, maka syurga haram baginya.\""
  }
]
