[
  {
    "id": 38526,
    "hadith_number": 989,
    "tajuk_hadith": "Larangan Berpuasa pada Hari yang Meragukan",
    "perawi_melayu": "Abdullah bin Sa'id, Abu Khalid al-Ahmar, daripada 'Amru bin Qais, daripada Abi Ishaq, daripada Silah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ  ، حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ  ، عَنْ عَمْرِو بْنِ قَيْسٍ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ صِلَةَ  ، قَالَ : كُنَّا عِنْدَ عَمَّارِ بْنِ يَاسِرٍ، فَأُتِيَ بِشَاةٍ مَصْلِيَّةٍ، فَقَالَ : كُلُوا، فَتَنَحَّى بَعْضُ الْقَوْمِ، فَقَالَ : إِنِّي صَائِمٌ.\n فَقَالَ عَمَّارُ بْنُ يَاسِرٍ   :\" مَنْ صَامَ الْيَوْمَ الَّذِي يُشَكُّ فِيهِ، فَقَدْ عَصَى أَبَا الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \"",
    "malay_translation": "Abdullah bin Sa'id memberitahu kami, Abu Khalid al-Ahmar menceritakan kepada kami, daripada 'Amru bin Qais, daripada Abi Ishaq, daripada Silah, dia berkata: Kami berada di sisi 'Ammar bin Yasir, lalu dihidangkan kepadanya seekor kambing panggang. Dia berkata: \"Makanlah.\" Lalu sebahagian kaum menjauhkan diri, dan berkata: \"Sesungguhnya aku berpuasa.\"\n\n'Ammar bin Yasir berkata: \"Sesiapa yang berpuasa pada hari yang diragukan, maka dia telah menderhakai Aba al-Qasim (Nabi Muhammad) ﷺ.\""
  },
  {
    "id": 38527,
    "hadith_number": 990,
    "tajuk_hadith": "Menentukan Awal dan Akhir Ramadan Berdasarkan Rukyah dan Menyempurnakan Bilangan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ  ، حَدَّثَنَا إِسْمَاعِيل بْنُ عُلَيَّةَ  ، حَدَّثَنَا حَاتِمُ بْنُ أَبِي صَغِيرَةَ  ، عَنْ سِمَاكِ بْنِ حَرْبٍ  ، قَالَ : أَصْبَحْتُ فِي يَوْمٍ قَدْ أُشْكِلَ عَلَيَّ مِنْ شَعْبَانَ، أَوْ مِنْ شَهْرِ رَمَضَانَ، فَأَصْبَحْتُ صَائِمًا، فَأَتَيْتُ عِكْرِمَةَ  ، فَإِذَا هُوَ يَأْكُلُ خُبْزًا وَبَقْلًا، فَقَالَ : هَلُمَّ إِلَى الْغَدَاءِ.\nفَقُلْتُ : إِنِّي صَائِمٌ.\nفَقَالَ : أُقْسِمُ بِاللَّهِ لَتُفْطِرَنَّ.\nفَلَمَّا رَأَيْتُهُ حَلَفَ وَلَا يَسْتَثْنِي، تَقَدَّمْتُ فَعَذَّرْتُ وَإِنَّمَا تَسَحَّرْتُ قُبَيْلَ ذَلِكَ، ثُمَّ قُلْتُ : هَاتِ الْآنَ مَا عِنْدَكَ.\nفَقَالَ : حَدَّثَنَا ابْنُ عَبَّاسٍ   رَضِيَ اللهِ عَنْهُمَا، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" صُومُوا لِرُؤْيَتِهِ وَأَفْطِرُوا لِرُؤْيَتِهِ، فَإِنْ حَالَ بَيْنَكُمْ وَبَيْنَهُ سَحَابٌ، فَكَمِّلُوا الْعِدَّةَ ثَلَاثِينَ، وَلَا تَسْتَقْبِلُوا الشَّهْرَ اسْتِقْبَالًا \"",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Sa'id, telah menceritakan kepada kami Ismail bin 'Ulayyah, telah menceritakan kepada kami Hatim bin Abi Shaghira, dari Simak bin Harb, dia berkata: \"Pada suatu pagi, aku merasa ragu apakah hari itu masih dalam bulan Sya'ban atau sudah masuk bulan Ramadan. Aku tetap berpuasa. Kemudian aku mendatangi Ikrimah, dan ternyata dia sedang makan roti dan sayuran. Dia berkata: 'Marilah sarapan.'\nAku menjawab: 'Aku sedang berpuasa.'\nDia berkata: 'Aku bersumpah demi Allah, kamu harus berbuka.'\nKetika aku melihat dia bersumpah tanpa pengecualian, aku maju dan meminta maaf, padahal aku baru saja bersahur sebelum itu. Kemudian aku berkata: 'Sekarang, beritahukan apa yang kamu punya.'\nDia berkata: 'Telah menceritakan kepada kami Ibnu Abbas RA, dia berkata: Rasulullah SAW bersabda: 'Berpuasalah kamu karena melihat hilal (rukyah), dan berbukalah kamu karena melihatnya. Jika awan menghalangi antara kamu dan hilal, maka sempurnakanlah bilangan (Sya'ban) menjadi tiga puluh hari, dan janganlah kamu menyambut bulan (Ramadan) dengan mendahuluinya.'"
  },
  {
    "id": 38528,
    "hadith_number": 991,
    "tajuk_hadith": "Menentukan Permulaan dan Pengakhiran Ramadan dengan Melihat Anak Bulan",
    "perawi_melayu": "Diriwayatkan daripada Nafi', daripada Ibnu Umar R.A.,",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ نَافِعٍ  ،  عَنْ ابْنِ عُمَرَ   رَضِيَ اللهِ عَنْهُمَا، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرَ رَمَضَانَ، فَقَالَ :\" لَا تَصُومُوا حَتَّى تَرَوْا الْهِلَالَ، وَلَا تُفْطِرُوا حَتَّى تَرَوْهُ، فَإِنْ غُمَّ عَلَيْكُمْ، فَاقْدُرُوا لَهُ \"",
    "malay_translation": "Telah menceritakan kepada kami Ubaidullah bin Abdul Majid, telah menceritakan kepada kami Malik, daripada Nafi', daripada Ibnu Umar R.A., bahawa Rasulullah SAW menyebut tentang Ramadan, lalu bersabda: \"Janganlah kamu berpuasa sehingga kamu melihat anak bulan, dan janganlah kamu berbuka sehingga kamu melihatnya. Jika ia terlindung daripada kamu, maka takdirkanlah (tentukanlah) baginya.\""
  },
  {
    "id": 38529,
    "hadith_number": 992,
    "tajuk_hadith": "Puasa dan Berbuka Puasa Berdasarkan Ru'yah (Melihat Anak Bulan)",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah RA",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ  ، حَدَّثَنَا شُعْبَةُ  ، حَدَّثَنِي مُحَمَّدُ بْنُ زِيَادٍ  ، قَالَ : سَمِعْتُ أَبَا هُرَيْرَةَ   رَضِيَ اللهِ عَنْهُ، يَقُولُ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، أَوْ قَالَ أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" صُومُوا لِرُؤْيَتِهِ، وَأَفْطِرُوا لِرُؤْيَتِهِ، فَإِنْ غُمَّ عَلَيْكُمْ الشَّهْرُ، فَعُدُّوا ثَلَاثِينَ \"",
    "malay_translation": "Telah menceritakan kepada kami Hasyim bin al-Qasim, telah menceritakan kepada kami Syu'bah, telah menceritakan kepadaku Muhammad bin Ziyad, dia berkata: Aku mendengar Abu Hurairah RA berkata: Rasulullah SAW bersabda, atau Abu al-Qasim SAW bersabda: \"Berpuasalah kamu kerana melihatnya (anak bulan), dan berbukalah kamu kerana melihatnya (anak bulan). Jika bulan itu tertutup awan bagimu, maka hitunglah menjadi tiga puluh hari.\""
  },
  {
    "id": 38530,
    "hadith_number": 993,
    "tajuk_hadith": "Larangan Mendahului Bulan Ramadan dan Arahan Berpuasa dan Berbuka Berdasarkan Ru'yah (Melihat Anak Bulan)",
    "perawi_melayu": "Ubaidillah bin Said, daripada Sufyan, daripada 'Amr (iaitu Ibnu Dinar), daripada Muhammad bin Jubair, daripada Ibnu Abbas RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ عَمْرٍو يَعْنِي ابْنَ دِينَارٍ  ، عَنْ مُحَمَّدِ بْنِ جُبَيْرٍ  ، عَنْ ابْنِ عَبَّاسٍ   رَضِيَ اللهِ عَنْهُمَا، أَنَّهُ عَجِبَ مِمَّنْ يَتَقَدَّمُ الشَّهْرَ ، وَيَقُولُ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِذَا رَأَيْتُمُوهُ، فَصُومُوا، وَإِذَا رَأَيْتُمُوهُ فَأَفْطِرُوا، فَإِنْ غُمَّ عَلَيْكُمْ، فَأَكْمِلُوا الْعِدَّةَ ثَلَاثِينَ يَوْمًا \"",
    "malay_translation": "Ubaidillah bin Said mengkhabarkan kepada kami, Sufyan meriwayatkan kepada kami, daripada 'Amr iaitu Ibnu Dinar, daripada Muhammad bin Jubair, daripada Ibnu Abbas RA, bahawa beliau merasa hairan dengan orang yang mendahului (ketibaan) bulan (Ramadan), dan beliau berkata: Rasulullah SAW bersabda: \"Apabila kamu melihatnya (anak bulan), maka berpuasalah, dan apabila kamu melihatnya (anak bulan), maka berbukalah. Jika ia terlindung daripada kamu, maka sempurnakanlah bilangan (bulan Sya'ban) menjadi tiga puluh hari.\""
  },
  {
    "id": 38531,
    "hadith_number": 994,
    "tajuk_hadith": "Doa Apabila Melihat Anak Bulan",
    "perawi_melayu": "Diriwayatkan daripada Ibn Umar RA: Rasulullah SAW apabila melihat anak bulan, Baginda bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ سُلَيْمَانَ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ بْنِ إِبْرَاهِيمَ  ، حَدَّثَنِي أَبِي  ، عَنْ أَبِيهِ  ، وَعَمِّهِ  ، عَنْ ابْنِ عُمَرَ   رَضِيَ اللهِ عَنْهُ، قَالَ : كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَأَى الْهِلَالَ، قَالَ :\" اللَّهُ أَكْبَرُ، اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالْأَمْنِ وَالْإِيمَانِ، وَالسَّلَامَةِ وَالْإِسْلَامِ، وَالتَّوْفِيقِ لِمَا يُحِبُّ رَبُّنَا وَيَرْضَى، رَبُّنَا وَرَبُّكَ اللَّهُ \"",
    "malay_translation": "Sa'id bin Sulaiman telah mengkhabarkan kepada kami, daripada Abdul Rahman bin Uthman bin Ibrahim, ayahku telah menceritakan kepadaku, daripada ayahnya dan bapa saudaranya, daripada Ibn Umar RA, beliau berkata: Rasulullah SAW apabila melihat anak bulan, Baginda bersabda: \"Allahu Akbar, Ya Allah, terbitkanlah anak bulan ini ke atas kami dengan keamanan dan keimanan, keselamatan dan keislaman, dan taufik untuk apa yang dicintai dan diredhai oleh Tuhan kami. Tuhan kami dan Tuhanmu adalah Allah.\""
  },
  {
    "id": 38532,
    "hadith_number": 995,
    "tajuk_hadith": "Doa Apabila Melihat Anak Bulan",
    "perawi_melayu": "Muhammad bin Yazid ar-Rifa'i dan Ishaq bin Ibrahim, daripada al-`Aqadi, daripada Sulaiman bin Sufyan al-Madini, daripada Bilal bin Yahya bin Talhah, daripada ayahnya, daripada Talhah RA.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَزِيدَ الرِّفَاعِيُّ  ، وَإِسْحَاق بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا الْعَقَدِيُّ  ، حَدَّثَنَا سُلَيْمَانُ بْنُ سُفْيَانَ الْمَدَينِيُّ  ، عَنْ بِلَالِ بْنِ يَحْيَى بْنِ طَلْحَةَ  ، عَنْ أَبِيهِ  ، عَنْ طَلْحَةَ   رَضِيَ اللهِ عَنْهُمَا، قَالَ : كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَأَى الْهِلَالَ، قَالَ :\" اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالْأَمْنِ وَالْإِيمَانِ، وَالسَّلَامَةِ وَالْإِسْلَامِ، رَبِّي وَرَبُّكَ اللَّهُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Yazid ar-Rifa'i dan Ishaq bin Ibrahim, telah menceritakan kepada kami al-`Aqadi, telah menceritakan kepada kami Sulaiman bin Sufyan al-Madini, daripada Bilal bin Yahya bin Talhah, daripada ayahnya, daripada Talhah RA, beliau berkata: Adalah Nabi SAW apabila melihat anak bulan, Baginda bersabda: \"Ya Allah, terbitkanlah ia (anak bulan) ke atas kami dengan keamanan dan keimanan, keselamatan dan Islam. Tuhanku dan Tuhanmu adalah Allah.\""
  },
  {
    "id": 38533,
    "hadith_number": 996,
    "tajuk_hadith": "Larangan Mendahului Ramadan dengan Berpuasa Sehari atau Dua Hari Sebelumnya",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA, Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا وَهْبُ بْنُ جَرِيرٍ  ، حَدَّثَنَا هِشَامٌ  ، عَنْ يَحْيَى  ، عَنْ أَبِي سَلَمَةَ  ، عَنْ أَبِي هُرَيْرَةَ   رَضِيَ اللهِ عَنْهُ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَا تَقَدَّمُوا قَبْلَ رَمَضَانَ يَوْمًا، وَلَا يَوْمَيْنِ، إِلَّا أَنْ يَكُونَ رَجُلًا كَانَ يَصُومُ صَوْمًا، فَلْيَصُمْهُ \"",
    "malay_translation": "\"Janganlah kamu mendahului Ramadan dengan berpuasa sehari atau dua hari sebelumnya, kecuali jika seseorang itu mempunyai kebiasaan berpuasa, maka hendaklah dia berpuasa.\""
  },
  {
    "id": 38534,
    "hadith_number": 997,
    "tajuk_hadith": "Penetapan Bulan Ramadan: 29 Hari atau Melihat Anak Bulan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، عَنْ أَيُّوبَ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ   رَضِيَ اللهِ عَنْهُمَا، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" إِنَّمَاالشَّهْرُ تِسْعٌ وَعِشْرُونَ، فَلَا تَصُومُوا حَتَّى تَرَوْهُ، وَلَا تُفْطِرُوا حَتَّى تَرَوْهُ، فَإِنْ غُمَّ عَلَيْكُمْ، فَاقْدُرُوا لَهُ \"",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Hammad bin Zaid, daripada Ayyub, daripada Nafi', daripada Ibn Umar RA, beliau berkata: Rasulullah SAW bersabda: \"Sesungguhnya bulan itu (kadang-kadang) dua puluh sembilan hari. Maka janganlah kamu berpuasa sehingga kamu melihatnya (anak bulan), dan janganlah kamu berbuka sehingga kamu melihatnya. Jika ia diliputi awan, maka tentukanlah (genapkanlah) baginya.\""
  },
  {
    "id": 38535,
    "hadith_number": 998,
    "tajuk_hadith": "Penglihatan Anak Bulan dan Arahan Berpuasa",
    "perawi_melayu": "Diriwayatkan daripada Marwan bin Muhammad, daripada Abdullah bin Wahb, daripada Yahya bin Salim, daripada Abu Bakar bin Nafi', daripada bapanya, daripada Ibn Umar RA.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ وَهْبٍ  ، عَنْ يَحْيَى بْنِ سَالِمٍ  ، عَنْ أَبِي بَكْرِ بْنِ نَافِعٍ  ، عَنْ أَبِيهِ  ، عَنْ ابْنِ عُمَرَ   رَضِيَ اللهِ عَنْهُ، قَالَ : تَرَاءَى النَّاسُ الْهِلَالَ، فَأَخْبَرْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنِّي رَأَيْتُهُ، \" فَصَامَوَأَمَرَ النَّاسَ بِالصِّيَامِ \"",
    "malay_translation": "Telah menceritakan kepada kami Marwan bin Muhammad, daripada Abdullah bin Wahb, daripada Yahya bin Salim, daripada Abu Bakar bin Nafi', daripada bapanya, daripada Ibn Umar RA, beliau berkata: Orang ramai cuba melihat anak bulan. Lalu aku memberitahu Rasulullah SAW bahawa aku telah melihatnya, maka Baginda berpuasa dan memerintahkan orang ramai untuk berpuasa."
  },
  {
    "id": 38536,
    "hadith_number": 999,
    "tajuk_hadith": "Penerimaan Kesaksian Orang Arab Badwi Tentang Rukyah Hilal dan Perintah Berpuasa",
    "perawi_melayu": "Diriwayatkan oleh 'Ismah bin al-Fadl, daripada Husain al-Ju'fi, daripada Zaidah, daripada Simak, daripada Ikrimah, daripada Ibnu 'Abbas R.A.",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي عِصْمَةُ بْنُ الْفَضْلِ  ، حَدَّثَنَا حُسَيْنٌ الْجُعْفِيُّ  ، عَنْ زَائِدَةَ  ، عَنْ سِمَاكٍ  ، عَنْ عِكْرِمَةَ  ، عَنْ ابْنِ عَبَّاسٍ   رَضِيَ اللهِ عَنْهُمَا، قَالَ : جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَقَالَ : إِنِّي رَأَيْتُ الْهِلَالَ.\nفَقَالَ : \" أَتَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ، وَأَنِّي رَسُولُ اللَّهِ؟ \" قَالَ : نَعَمْ.\nقَالَ : \" يَا بِلَالُ،نَادِ فِي النَّاسِ، فَلْيَصُومُوا غَدًا \"",
    "malay_translation": "Telah menceritakan kepadaku 'Ismah bin al-Fadl, telah menceritakan kepada kami Husain al-Ju'fi, daripada Zaidah, daripada Simak, daripada Ikrimah, daripada Ibnu 'Abbas R.A., beliau berkata: Seorang Arab Badwi datang kepada Nabi SAW dan berkata: 'Sesungguhnya aku telah melihat hilal (anak bulan)'.\n\nBaginda SAW bertanya: 'Adakah kamu bersaksi bahawa tiada Tuhan melainkan Allah, dan bahawa aku adalah utusan Allah?' Dia menjawab: 'Ya'.\n\nBaginda SAW bersabda: 'Wahai Bilal, umumkan kepada orang ramai, maka hendaklah mereka berpuasa esok hari.'"
  },
  {
    "id": 38537,
    "hadith_number": 1000,
    "tajuk_hadith": "Kemudahan Berbuka Puasa Setelah Tidur dan Turunnya Ayat Al-Baqarah: 187",
    "perawi_melayu": "Ubaidullah bin Musa, daripada Israil, daripada Abu Ishaq, daripada al-Bara'",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، عَنْ إِسْرَائِيلَ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ الْبَرَاءِ  ، قَالَ : كَانَ أَصْحَابُ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ الرَّجُلُ صَائِمًا فَحَضَرَ الْإِفْطَارُ، فَنَامَ قَبْلَ أَنْ يُفْطِرَ لَمْ يَأْكُلْ لَيْلَتَهُ وَلَا يَوْمَهُ حَتَّى يُمْسِيَ، وَإِنَّ قَيْسَ بْنَ صِرْمَةَ الْأَنْصَارِيَّ كَانَ صَائِمًا، فَلَمَّا حَضَرَ الْإِفْطَارُ، أَتَى امْرَأَتَهُ، فَقَالَ : عِنْدَكِ طَعَامٌ؟ فَقَالَتْ : لَا، وَلَكِنْ أَنْطَلِقُ فَأَطْلُبُ لَكَ، وَكَانَ يَوْمَهُ يَعْمَلُ، فَغَلَبَتْهُ عَيْنُهُ، وَجَاءَتْ امْرَأَتُهُ، فَلَمَّا رَأَتْهُ، قَالَتْ : خَيْبَةً لَكَ.\nفَلَمَّا انْتَصَفَ النَّهَارُ، غُشِيَ عَلَيْهِ فَذُكِرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،\" فَنَزَلَتْ هَذِهِ الْآيَةُ : # أُحِلَّ لَكُمْ لَيْلَةَ الصِّيَامِ الرَّفَثُ إِلَى نِسَائِكُمْ هُنَّ لِبَاسٌ لَكُمْ وَأَنْتُمْ لِبَاسٌ لَهُنَّ عَلِمَ اللَّهُ أَنَّكُمْ كُنْتُمْ تَخْتَانُونَ أَنْفُسَكُمْ فَتَابَ عَلَيْكُمْ وَعَفَا عَنْكُمْ فَالآنَ بَاشِرُوهُنَّ وَابْتَغُوا مَا كَتَبَ اللَّهُ لَكُمْ وَكُلُوا وَاشْرَبُوا حَتَّى يَتَبَيَّنَ لَكُمُ الْخَيْطُ الأَبْيَضُ مِنَ الْخَيْطِ الأَسْوَدِ مِنَ الْفَجْرِ ثُمَّ أَتِمُّوا الصِّيَامَ إِلَى اللَّيْلِ وَلا تُبَاشِرُوهُنَّ وَأَنْتُمْ عَاكِفُونَ فِي الْمَسَاجِدِ تِلْكَ حُدُودُ اللَّهِ فَلا تَقْرَبُوهَا كَذَلِكَ يُبَيِّنُ اللَّهُ آيَاتِهِ لِلنَّاسِ لَعَلَّهُمْ يَتَّقُونَ سورة البقرة آية 187 #، فَفَرِحُوا بِهَا فَرَحًا شَدِيدًا، وَأَكُلُوا وَاشَرِبُوا حَتَّى تَبَيَّنَ لَهُمْ الْخَيْطُ الْأَبْيَضُ مِنْ الْخَيْطِ الْأَسْوَدِ \"",
    "malay_translation": "Ubaidullah bin Musa memberitahu kami, daripada Israil, daripada Abu Ishaq, daripada al-Bara', beliau berkata: \"Para sahabat Muhammad SAW, apabila seseorang itu berpuasa, dan waktu berbuka telah tiba, lalu dia tidur sebelum berbuka, maka dia tidak makan pada malam itu dan tidak juga pada siang harinya sehingga petang. Dan sesungguhnya Qais bin Sirmah al-Ansari sedang berpuasa. Apabila waktu berbuka tiba, dia pergi kepada isterinya dan bertanya: 'Adakah kamu mempunyai makanan?' Isterinya menjawab: 'Tidak, tetapi aku akan pergi mencari untukmu.' Dan pada hari itu dia bekerja, lalu dia tertidur. Isterinya datang, dan apabila melihatnya, dia berkata: 'Alangkah ruginya kamu.' Apabila pertengahan siang, dia pengsan. Perkara itu disebutkan kepada Nabi SAW, lalu turunlah ayat ini: '#Dihalalkan bagi kamu pada malam hari puasa bercampur dengan isteri-isteri kamu; mereka adalah pakaian bagimu, dan kamu pun adalah pakaian bagi mereka. Allah mengetahui bahwasanya kamu tidak dapat menahan nafsumu sendiri, maka Allah mengampuni kamu dan memberi maaf kepadamu. Maka sekarang campurilah mereka dan carilah apa yang telah ditetapkan Allah bagimu, dan makan minumlah hingga terang bagimu benang putih dari benang hitam, yaitu fajar. Kemudian sempurnakanlah puasa itu sampai (datang) malam, (tetapi) janganlah kamu campuri mereka itu, sedang kamu beri'tikaf dalam mesjid. Itulah larangan Allah, maka janganlah kamu mendekatinya. Demikianlah Allah menerangkan ayat-ayat-Nya kepada manusia, supaya mereka bertakwa.' [Surah al-Baqarah, ayat 187] #, lalu mereka sangat gembira dengannya, dan mereka makan dan minum sehingga jelas bagi mereka benang putih dari benang hitam.\""
  },
  {
    "id": 38538,
    "hadith_number": 1001,
    "tajuk_hadith": "Penjelasan Ayat Al-Quran tentang Benang Putih dan Benang Hitam dalam Puasa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا شَرِيكٌ  ، عَنْ حُصَيْنٍ  ، عَنْ الشَّعْبِيِّ  ،  عَنْ عَدِيِّ بْنِ حَاتِمٍ  ، قَالَ : قُلْتُ : يَا رَسُولَ اللَّهِ، لَقَدْ جَعَلْتُ تَحْتَ وِسَادَتِي خَيْطًا أَبْيَضَ وَخَيْطًا أَسْوَدَ، فَمَا تَبَيَّنَ لِي شَيْءٌ.\nقَالَ : \" إِنَّكَ لَعَرِيضُ الْوِسَادِ، وَإِنَّمَاذَلِكَ اللَّيْلُ مِنْ النَّهَارِ فِي قَوْلِهِ تَعَالَى : # وَكُلُوا وَاشْرَبُوا حَتَّى يَتَبَيَّنَ لَكُمُ الْخَيْطُ الأَبْيَضُ مِنَ الْخَيْطِ الأَسْوَدِ مِنَ الْفَجْرِ ثُمَّ أَتِمُّوا الصِّيَامَ إِلَى اللَّيْلِ وَلا تُبَاشِرُوهُنَّ وَأَنْتُمْ عَاكِفُونَ فِي الْمَسَاجِدِ تِلْكَ حُدُودُ اللَّهِ فَلا تَقْرَبُوهَا كَذَلِكَ يُبَيِّنُ اللَّهُ آيَاتِهِ لِلنَّاسِ لَعَلَّهُمْ يَتَّقُونَ سورة البقرة آية 187 # \"",
    "malay_translation": "Abu al-Walid mengkhabarkan kepada kami, Syarik menceritakan kepada kami, daripada Husain, daripada al-Sya'bi, daripada 'Adi bin Hatim, dia berkata: Saya berkata: Wahai Rasulullah, sesungguhnya saya telah meletakkan di bawah bantal saya benang putih dan benang hitam, tetapi tidak ada apa-apa yang jelas bagi saya.\nBaginda bersabda: \"Sesungguhnya bantalmu sangat lebar, yang dimaksudkan adalah malam daripada siang, seperti dalam firman Allah Taala: # Dan makan dan minumlah kamu sehingga jelas kepada kamu benang putih dari benang hitam, iaitu fajar. Kemudian sempurnakanlah puasa itu sehingga malam. Dan janganlah kamu campuri mereka (isteri-isteri kamu) ketika kamu sedang beriktikaf di masjid. Itulah batasan-batasan Allah, maka janganlah kamu menghampirinya. Demikianlah Allah menerangkan ayat-ayat-Nya kepada manusia, supaya mereka bertakwa. Surah al-Baqarah, ayat 187 # \""
  },
  {
    "id": 38539,
    "hadith_number": 1002,
    "tajuk_hadith": "Jarak Masa Antara Sahur dan Solat Subuh",
    "perawi_melayu": "Diriwayatkan daripada Zaid bin Thabit RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا هِشَامٌ  ، عَنْ قَتَادَةَ  ، عَنْ أَنَسٍ  ،  عَنْ زَيْدِ بْنِ ثَابِتٍ  ، قَالَ :\" تَسَحَّرْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ : ثُمَّ قَامَ إِلَى الصَّلَاةِ.\nقَالَ : قُلْتُ : كَمْ كَانَ بَيْنَ الْأَذَانِ وَالسُّحُورِ؟ قَالَ : قَدْرُ قِرَاءَةِ خَمْسِينَ آيَةً \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muslim bin Ibrahim, telah menceritakan kepada kami Hisyam, daripada Qatadah, daripada Anas, daripada Zaid bin Thabit RA, beliau berkata: \"Kami bersahur bersama Rasulullah SAW, kemudian Baginda berdiri untuk solat.\"\nBeliau (Qatadah) berkata: \"Saya bertanya: Berapa jarak masa antara azan dan sahur?\" Beliau (Zaid bin Thabit) menjawab: \"Kadar membaca lima puluh ayat (Al-Quran).\""
  },
  {
    "id": 38540,
    "hadith_number": 1003,
    "tajuk_hadith": "Keberkatan dalam Bersahur",
    "perawi_melayu": "Diriwayatkan daripada Anas RA, Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ  ، عَنْ شُعْبَةَ  ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ  ، عَنْ أَنَسٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" تَسَحَّرُوا فَإِنَّ فِي السُّحُورِ بَرَكَةً \"",
    "malay_translation": "\"Bersahurlah kamu, kerana sesungguhnya dalam bersahur itu ada keberkatan.\""
  },
  {
    "id": 38541,
    "hadith_number": 1004,
    "tajuk_hadith": "Kelebihan Bersahur dan Perbezaan Puasa Kita dengan Ahli Kitab",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ  ، حَدَّثَنَا مُوسَى بْنُ عُلَيٍّ  ، قَالَ : سَمِعْتُ أَبِي  يُحَدِّثُ، عَنْ أَبِي قَيْسٍ  مَوْلَى عَمْرِو بْنِ الْعَاصِ، قَالَ : كَانَ عَمْرُو بْنُ الْعَاصِ   يَأْمُرُنَا أَنْ نَصْنَعَ لَهُ الطَّعَامَ يَتَسَحَّرُ بِهِ فَلَا يُصِيبُ مِنْهُ كَثِيرًا، فَقُلْنَا : تَأْمُرُنَا بِهِ وَلَا تُصِيبُ مِنْهُ كَثِيرًا؟ قَالَ : إِنِّي لَا آمُرُكُمْ بِهِ أَنِّي أَشْتَهِيهِ، وَلَكِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ :\" فَصْلُ مَا بَيْنَ صِيَامِنَا وَصِيَامِ أَهْلِ الْكِتَابِ أَكْلَةُ السَّحَرِ \"",
    "malay_translation": "Telah menceritakan kepada kami Wahb bin Jarir, telah menceritakan kepada kami Musa bin 'Ali, dia berkata: Aku mendengar ayahku menceritakan, dari Abu Qais, hamba 'Amru bin al-'As, dia berkata: 'Amru bin al-'As memerintahkan kami untuk membuat makanan untuknya sebagai santapan sahur, tetapi dia tidak makan banyak daripadanya. Maka kami bertanya: 'Engkau memerintahkan kami untuk membuatnya tetapi engkau tidak makan banyak daripadanya?' Dia berkata: 'Sesungguhnya aku tidak memerintahkan kamu untuk membuatnya kerana aku menginginkannya, tetapi aku mendengar Rasulullah SAW bersabda: 'Perbezaan antara puasa kita dengan puasa Ahli Kitab adalah makan sahur.'"
  },
  {
    "id": 38542,
    "hadith_number": 1005,
    "tajuk_hadith": "Niat Puasa Wajib Sebelum Fajar",
    "perawi_melayu": "Diriwayatkan oleh Sa'id bin Syurahbil, daripada Laith bin Sa'd, daripada Yahya bin Ayyub, daripada Abdullah bin Abi Bakr, daripada Salim bin Abdullah bin Umar, daripada Ibn Umar, daripada Hafsah, daripada Rasulullah SAW",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ شُرَحْبِيلَ  ، حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ  ، عَنْ يَحْيَى بْنِ أَيُّوبَ  ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ  ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ  ، عَنْ ابْنِ عُمَرَ  ،  عَنْ حَفْصَةَ  ، عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنْ لَمْ يُبَيِّتْ الصِّيَامَ قَبْلَ الْفَجْرِ، فَلَا صِيَامَ لَهُ \".\nقَالَ عَبْد اللَّهِ : فِي فَرْضِ الْوَاجِبِ أَقُولُ بِهِ",
    "malay_translation": "Telah menceritakan kepada kami Sa'id bin Syurahbil, telah menceritakan kepada kami Laith bin Sa'd, daripada Yahya bin Ayyub, daripada Abdullah bin Abi Bakr, daripada Salim bin Abdullah bin Umar, daripada Ibn Umar, daripada Hafsah, daripada Rasulullah SAW, baginda bersabda: \"Sesiapa yang tidak berniat puasa sebelum fajar, maka tidak sah puasanya.\"\nAbdullah berkata: \"Aku berkata demikian berkenaan puasa fardhu yang wajib.\""
  },
  {
    "id": 38543,
    "hadith_number": 1006,
    "tajuk_hadith": "Keutamaan Menyegerakan Berbuka Puasa",
    "perawi_melayu": "Diriwayatkan daripada Sahl bin Sa'd RA, Rasulullah SAW bersabda: \"Manusia akan sentiasa berada dalam kebaikan selagi mereka menyegerakan berbuka puasa.\"",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ الثَّوْرِيِّ  ، عَنْ أَبِي حَازِمٍ  ، عَنْ سَهْلِ بْنِ سَعْدٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَا يَزَالُ النَّاسُ بِخَيْرٍ مَا عَجَّلُوا الْفِطْرَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Yusuf, daripada Sufyan al-Thawri, daripada Abu Hazim, daripada Sahl bin Sa'd RA, beliau berkata: Rasulullah SAW bersabda: \"Manusia akan sentiasa berada dalam kebaikan selagi mereka menyegerakan berbuka puasa.\""
  },
  {
    "id": 38544,
    "hadith_number": 1007,
    "tajuk_hadith": "Waktu Berbuka Puasa",
    "perawi_melayu": "Diriwayatkan daripada 'Uthman bin Muhammad, daripada 'Abdah, daripada Hisham bin 'Urwah, daripada ayahnya, daripada 'Asim bin 'Umar, daripada 'Umar, bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ مُحَمَّدٍ  ، حَدَّثَنَا عَبْدَةُ  ، عَنْ هِشَامِ بْنِ عُرْوَةَ  ، عَنْ أَبِيهِ  ، عَنْ عَاصِمِ بْنِ عُمَرَ  ، عَنْ عُمَرَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِذَا أَقْبَلَ اللَّيْلُ وَأَدْبَرَ النَّهَارُ وَغَابَتْ الشَّمْسُ، فَقَدْ أَفْطَرْتَ \"",
    "malay_translation": "\"Apabila malam menjelang, siang berundur, dan matahari terbenam, maka kamu telah berbuka.\""
  },
  {
    "id": 38545,
    "hadith_number": 1008,
    "tajuk_hadith": "Anjuran Berbuka Puasa dengan Kurma atau Air",
    "perawi_melayu": "Abu An-Nu'man, Thabit bin Yazid, 'Asim, daripada Hafsah, daripada Ar-Rabab Ad-Dhabiyyah, daripada bapa saudaranya Salman bin 'Amir",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا ثَابِتُ بْنُ يَزِيدَ  ، حَدَّثَنَا عَاصِمٌ  ، عَنْ حَفْصَةَ  ، عَنْ الرَّبَاب الضَّبِّيَّةِ  ،  عَنْ عَمِّهَا سَلْمَانَ بْنِ عَامِرٍ  ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :\" إِذَا أَفْطَرَ أَحَدُكُمْ، فَلْيُفْطِرْ عَلَى تَمْرٍ، فَإِنْ لَمْ يَجِدْ، فَلْيُفْطِرْ عَلَى مَاءٍ، فَإِنَّ الْمَاءَ طَهُورٌ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu An-Nu'man, telah menceritakan kepada kami Thabit bin Yazid, telah menceritakan kepada kami 'Asim, daripada Hafsah, daripada Ar-Rabab Ad-Dhabiyyah, daripada bapa saudaranya Salman bin 'Amir, bahawa Nabi SAW bersabda: \"Apabila seseorang daripada kamu berbuka puasa, maka hendaklah dia berbuka dengan kurma. Sekiranya dia tidak mendapatinya, maka hendaklah dia berbuka dengan air, kerana air itu suci.\""
  },
  {
    "id": 38546,
    "hadith_number": 1009,
    "tajuk_hadith": "Keutamaan Memberi Makan Orang yang Berpuasa",
    "perawi_melayu": "Diriwayatkan daripada Zaid bin Khalid al-Juhani RA, daripada Nabi SAW",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَعْلَى  ، حَدَّثَنَا عَبْدُ الْمَلِكِ  ، عَنْ عَطَاءٍ  ، عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنْ فَطَّرَ صَائِمًا، كُتِبَ لَهُ مِثْلُ أَجْرِهِ، إِلَّا أَنَّهُ لَا يَنْقُصُ مِنْ أَجْرِ الصَّائِمِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ya'la, telah menceritakan kepada kami Abdul Malik, daripada 'Ata', daripada Zaid bin Khalid al-Juhani RA, daripada Nabi SAW, baginda bersabda: \"Sesiapa yang memberi makan orang yang berpuasa, akan ditulis baginya pahala seperti pahala orang yang berpuasa itu, tanpa dikurangkan sedikit pun daripada pahala orang yang berpuasa tersebut.\""
  },
  {
    "id": 38547,
    "hadith_number": 1010,
    "tajuk_hadith": "Larangan Berpuasa *Wisal* dan Penjelasan Kekhususan Nabi Muhammad SAW",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ أَبِي الزِّنَادِ  ، عَنْ الْأَعْرَجِ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" إِيَّاكُمْ وَالْوِصَالَ \" مَرَّتَيْنِ.\nقَالُوا : فَإِنَّكَ تُوَاصِلُ؟ قَالَ : \" إِنِّيلَسْتُ مِثْلَكُمْ، إِنِّي أَبِيتُ يُطْعِمُنِي رَبِّي وَيَسْقِينِي \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Khalid bin Makhlad, telah menceritakan kepada kami Malik, daripada Abu az-Zinad, daripada al-A'raj, daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: “Jauhilah oleh kamu *wisal* (puasa bersambung tanpa berbuka)” – dua kali. Mereka bertanya: “Sesungguhnya engkau ber-*wisal*?” Baginda bersabda: “Sesungguhnya aku tidaklah seperti kamu. Sesungguhnya aku bermalam dalam keadaan Tuhanku memberi makan dan minum kepadaku.”"
  },
  {
    "id": 38548,
    "hadith_number": 1011,
    "tajuk_hadith": "Larangan Berpuasa Secara Berterusan (Wisal) dan Keistimewaan Nabi Muhammad SAW",
    "perawi_melayu": "Diriwayatkan oleh Anas R.A.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ الرَّبِيعِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ قَتَادَةَ  ، عَنْ أَنَسٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" لَا تُوَاصِلُوا.\nقِيلَ : إِنَّكَ تَفْعَلُ ذَلِكَ.\nقَالَ : \" إِنِّيلَسْتُ كَأَحَدِكُمْ، إِنِّي أُطْعَمُ وَأُسْقَى \"",
    "malay_translation": "Telah menceritakan kepada kami Sa'id bin Ar-Rabi', telah menceritakan kepada kami Syu'bah, dari Qatadah, dari Anas, dia berkata: Rasulullah SAW bersabda: \"Janganlah kamu berpuasa secara berterusan (wisal).\"\nDikatakan kepada baginda: \"Sesungguhnya engkau melakukannya?\"\nBaginda bersabda: \"Sesungguhnya aku tidak seperti salah seorang daripada kamu. Sesungguhnya aku diberi makan dan minum (oleh Allah).\""
  },
  {
    "id": 38549,
    "hadith_number": 1012,
    "tajuk_hadith": "Larangan Berpuasa *Wisal* dan Kebenaran Melakukannya Sehingga Sahur",
    "perawi_melayu": "Diriwayatkan dari Abu Sa'id al-Khudri RA, bahawa beliau mendengar Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، حَدَّثَنِي اللَّيْثُ  ، حَدَّثَنِي يَزِيدُ بْنُ عَبْدِ اللَّهِ  ، عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ  ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ  ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ : \" لَا تُوَاصِلُوا، فَأَيُّكُمْ يُرِيدُ أَنْ يُوَاصِلَ، فَلْيُوَاصِلْ إِلَى السَّحَرِ \".\nقَالُوا : إِنَّكَ تُوَاصِلُ يَا رَسُولَ اللَّهِ.\nقَالَ : \" إِنِّيأَبِيتُ لِي مُطْعِمٌ يُطْعِمُنِي، وَيَسْقِينِي \"",
    "malay_translation": "\"Janganlah kamu berpuasa *wisal*. Sesiapa di antara kamu yang ingin berpuasa *wisal*, maka hendaklah dia berpuasa *wisal* sehingga sahur.\"\nMereka berkata: \"Sesungguhnya engkau berpuasa *wisal* wahai Rasulullah!\"\nBaginda bersabda: \"Sesungguhnya aku bermalam dalam keadaan diberi makan dan minum oleh Tuhanku.\""
  },
  {
    "id": 38550,
    "hadith_number": 1013,
    "tajuk_hadith": "Larangan Berpuasa Wishal dan Penjelasan Rasulullah SAW",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah RA",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، حَدَّثَنِي اللَّيْثُ  ، حَدَّثَنِي عُقَيْلٌ  ، عَنْ ابْنِ شِهَابٍ  ، أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ  ، أَنَّ أَبَا هُرَيْرَةَ   قَالَ : نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْوِصَالِ.\nفَقَالَ لَهُ رِجَالٌ مِنْ الْمُسْلِمِينَ : فَإِنَّكَ تُوَاصِلُ.\nقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" إِنِّيلَسْتُ مِثْلَكُمْ، إِنِّي أَبِيتُ يُطْعِمُنِي رَبِّي وَيَسْقِينِي \".\nفَلَمَّا أَبَوْا أَنْ يَنْتَهُوا عَنْ الْوِصَالِ، وَاصَلَ بِهِمْ يَوْمًا ثُمَّ يَوْمًا، ثُمَّ رَأَوْا الْهِلَالَ، فَقَالَ : \" لَوْ تَأَخَّرَ لَزِدْتُكُمْ \"، كَالْمُنَكِّلِ لَهُمْ حِينَ أَبَوْا أَنْ يَنْتَهُوا",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Salih, telah menceritakan kepadaku Al-Laith, telah menceritakan kepadaku Uqail, dari Ibnu Syihab, telah mengkhabarkan kepadaku Abu Salamah bin Abdurrahman, bahawa Abu Hurairah RA berkata: Rasulullah SAW melarang daripada berpuasa *wishal* (berpuasa tanpa berbuka dan bersahur).\n\nLalu beberapa orang lelaki Muslim bertanya kepada baginda: “Sesungguhnya engkau juga berpuasa *wishal*?”\n\nRasulullah SAW bersabda: “Sesungguhnya aku tidak seperti kamu. Sesungguhnya aku bermalam dalam keadaan Tuhanku memberi makan dan minum kepadaku.”\n\nMaka ketika mereka enggan berhenti daripada berpuasa *wishal*, baginda berpuasa *wishal* bersama mereka sehari kemudian sehari lagi, kemudian mereka melihat anak bulan. Baginda bersabda: “Seandainya ia lambat, nescaya aku akan menambahkannya kepada kamu,” seolah-olah menghukum mereka kerana mereka enggan berhenti."
  },
  {
    "id": 38551,
    "hadith_number": 1014,
    "tajuk_hadith": "Pilihan Berpuasa atau Tidak Semasa Musafir",
    "perawi_melayu": "Diriwayatkan daripada Aisyah R.A. bahawa Hamzah bin 'Amr al-Aslami bertanya kepada Rasulullah SAW:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ هِشَامِ بْنِ عُرْوَةَ  ، عَنْ عُرْوَةَ  ، عَنْ عَائِشَةَ  ، أَنَّ حَمْزَةَ بْنَ عَمْرٍو الْأَسْلَمِيَّ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ : رَسُولَ اللَّهِ إِنِّي أُرِيدُ السَّفَرَ، فَمَا تَأْمُرُنِي؟ قَالَ :\" إِنْ شِئْتَ، فَصُمْ، وَإِنْ شِئْتَ، فَأَفْطِرْ \"",
    "malay_translation": "\"Wahai Rasulullah, sesungguhnya aku ingin bermusafir, maka apakah yang engkau perintahkan kepadaku?\" Baginda bersabda: \"Jika engkau mahu, berpuasalah, dan jika engkau mahu, berbukalah.\""
  },
  {
    "id": 38552,
    "hadith_number": 1015,
    "tajuk_hadith": "Rasulullah SAW Berbuka Puasa Semasa Pembukaan Kota Mekah",
    "perawi_melayu": "Diriwayatkan dari Ibnu Abbas RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ الزُّهْرِيِّ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ : \" خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْفَتْحِفَصَامَ وَصَامَ النَّاسُ حَتَّى بَلَغَ الْكَدِيد، ثُمَّ أَفْطَرَ، فَأَفْطَرَ النَّاسُ، فَكَانُوا يَأْخُذُونَ بِالْأَحْدَثِ فَالْأَحْدَثِ مِنْ فِعْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Khalid bin Makhlad, telah menceritakan kepada kami Malik, dari Az-Zuhri, dari Ubaidillah bin Abdullah bin Utbah, dari Ibnu Abbas RA, beliau berkata: \"Rasulullah SAW keluar pada tahun Pembukaan (Kota Mekah) lalu Baginda berpuasa dan orang ramai turut berpuasa sehingga tiba di Al-Kadid. Kemudian Baginda berbuka, maka orang ramai pun turut berbuka. Mereka (para sahabat) sentiasa mengikuti amalan Rasulullah SAW yang terkini.\""
  },
  {
    "id": 38553,
    "hadith_number": 1016,
    "tajuk_hadith": "Larangan Berpuasa dalam Perjalanan Jika Memudaratkan",
    "perawi_melayu": "Hasyim bin al-Qasim dan Abu al-Walid",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا هَاشِمُ بْنُ الْقَاسِمِ  ، وَأَبُو الْوَلِيدِ  ، قَالَا : حَدَّثَنَا شُعْبَةُ  ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ الْأَنْصَارِيِّ  ، قَالَ : سَمِعْتُ مُحَمَّدَ بْنَ عَمْرِو بْنِ الْحَسَنِ  يُحَدِّثُ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ  ، أَنَّهُ ذَكَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ فِي سَفَرٍ فَرَأَى زِحَامًا وَرَجُلٌ قَدْ ظُلِّلَ عَلَيْهِ، فَقَالَ : \" مَا هَذَا؟ قَالُوا : هَذَا صَائِمٌ.\nفَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَيْسَ مِنْ الْبِرِّ الصَّوْمُ فِي السَّفَرِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Hasyim bin al-Qasim dan Abu al-Walid, mereka berdua berkata: Telah menceritakan kepada kami Syu'bah, daripada Muhammad bin Abd al-Rahman al-Ansari, dia berkata: Aku mendengar Muhammad bin Amru bin al-Hasan menceritakan, daripada Jabir bin Abdullah, bahawa dia menyebutkan bahawa Nabi ﷺ berada dalam perjalanan lalu melihat kesesakan dan seorang lelaki yang diberi naungan. Baginda bertanya: \"Apa ini?\" Mereka menjawab: \"Ini orang yang berpuasa.\"\n\nMaka Nabi ﷺ bersabda: \"Bukanlah termasuk kebaikan berpuasa dalam perjalanan.\""
  },
  {
    "id": 38554,
    "hadith_number": 1017,
    "tajuk_hadith": "Larangan Berpuasa dalam Perjalanan (Musafir)",
    "perawi_melayu": "Diriwayatkan daripada Ka'ab bin Asim al-Ash'ari",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُثْمَانُ بْنُ مُحَمَّدُ  ، حَدَّثَنَا يُونُسُ  ، عَنْ الزُّهْرِيِّ  ، عَنْ صَفْوَانَ بْنِ عَبْدِ اللَّهِ  ، عَنْ أُمِّ الدَّرْدَاءِ  ، عَنْ كَعْبِ بْنِ عَاصِمٍ الْأَشْعَرِيِّ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" لَيْسَ مِنْ الْبِرِّ الصِّيَامُ فِي السَّفَرِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Uthman bin Muhammad, telah menceritakan kepada kami Yunus, daripada az-Zuhri, daripada Safwan bin Abdullah, daripada Ummu Darda', daripada Ka'ab bin Asim al-Ash'ari, bahawa Rasulullah SAW bersabda: \"Bukanlah termasuk kebajikan (al-birr) berpuasa dalam perjalanan (musafir).\""
  },
  {
    "id": 38555,
    "hadith_number": 1018,
    "tajuk_hadith": "Bukanlah Kebaikan Berpuasa dalam Perjalanan",
    "perawi_melayu": "Diriwayatkan daripada Ka'ab bin Asim al-Asy'ari, daripada Nabi SAW, baginda bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ  ، حَدَّثَنَا سُفْيَانُ  ، حَدَّثَنَا الزُّهْرِيُّ  ، عَنْ صَفْوَانَ بْنِ عَبْدِ اللَّهِ بْنِ صَفْوَانَ  ، عَنْ أُمِّ الدَّرْدَاءِ  ، عَنْ كَعْبِ بْنِ عَاصِمٍ الْأَشْعَرِيِّ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" لَيْسَ مِنْ الْبِرِّ الصِّيَامُ فِي السَّفَرِ \"",
    "malay_translation": "Muhammad bin Ahmad meriwayatkan kepada kami, Sufyan meriwayatkan kepada kami, al-Zuhri meriwayatkan kepada kami, daripada Safwan bin Abdullah bin Safwan, daripada Ummu al-Darda', daripada Ka'ab bin Asim al-Asy'ari, daripada Nabi SAW, baginda bersabda: \"Bukanlah termasuk kebaikan untuk berpuasa dalam perjalanan.\""
  },
  {
    "id": 38556,
    "hadith_number": 1019,
    "tajuk_hadith": "Keringanan bagi Musafir: Puasa dan Solat",
    "perawi_melayu": "Abu al-Mughirah meriwayatkan daripada al-Awza'i, daripada Yahya, daripada Abi Qilabah, daripada Abi al-Muhajir, daripada Abi Umayyah al-Dhamri",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْمُغِيرَةِ  ، حَدَّثَنَا الْأَوْزَاعِيُّ  ، عَنْ يَحْيَى  ، عَنْ أَبِي قِلَابَةَ  ، عَنْ أَبِي الْمُهَاجِرِ  ، عَنْ أَبِي أُمَيَّةَ الضَّمْرِيِّ  ، قَالَ : قَدِمْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ سَفَرٍ فَسَلَّمْتُ عَلَيْهِ، فَلَمَّا ذَهَبْتُ لِأَخْرُجَ، قَالَ : \" انْتَظِرْ الْغَدَاءَ يَا أَبَا أُمَيَّةَ \".\nقَالَ : فَقُلْتُ : إِنِّي صَائِمٌ يَا نَبِيَّ اللَّهِ.\nفَقَالَ :\" تَعَالَ أُخْبِرْكَ عَنْ الْمُسَافِرِ، إِنَّ اللَّهَ وَضَعَ عَنْهُ الصِّيَامَ، وَنِصْفَ الصَّلَاةِ \".\n قَالَ أَبُو مُحَمَّد : إِنْ شَاءَ، صَامَ، وَإِنْ شَاءَ، أَفْطَرَ",
    "malay_translation": "Abu al-Mughirah meriwayatkan kepada kami, al-Awza'i meriwayatkan kepada kami, daripada Yahya, daripada Abi Qilabah, daripada Abi al-Muhajir, daripada Abi Umayyah al-Dhamri, beliau berkata: Aku datang kepada Rasulullah SAW dari suatu perjalanan lalu aku memberi salam kepadanya. Ketika aku hendak keluar, baginda bersabda: \"Tunggu sarapan pagi, wahai Abu Umayyah.\"\nBeliau berkata: Aku berkata: Sesungguhnya aku berpuasa, wahai Nabi Allah.\nBaginda bersabda: \"Marilah aku khabarkan kepadamu tentang musafir, sesungguhnya Allah telah menggugurkan daripadanya puasa dan separuh solat.\"\nAbu Muhammad berkata: Jika dia mahu, dia berpuasa, dan jika dia mahu, dia berbuka."
  },
  {
    "id": 38557,
    "hadith_number": 1020,
    "tajuk_hadith": "Anjuran Berbuka Puasa Ketika Musafir",
    "perawi_melayu": "Abdullah bin Yazid al-Muqri' meriwayatkan daripada Sa'id bin Abi Ayyub, daripada Yazid bin Abi Habib, bahawa Kulaib bin Zuhl al-Hadhrami memberitahunya, daripada Ubaid bin Jubair, katanya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ  ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ  ، حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ  ، أَنَّ كُلَيْبَ بْنَ ذُهْلٍ الْحَضْرَمِيَّ  أَخْبَرَهُ، عَنْ عُبَيْدِ بْنِ جُبَيْرٍ  ، قَالَ : رَكِبْتُ مَعَ أَبِي بَصْرَةَ الْغِفَارِيِّ سَفِينَةً مِنْ الْفُسْطَاطِ فِي رَمَضَانَ، فَدَفَعَ،فَقَرَّبَ غَدَاءَهُ.\nثُمَّ قَالَ : اقْتَرِبْ.\nفَقُلْتُ : أَلَسْتَ تَرَى الْبُيُوتَ؟ فَقَالَ أَبُو بَصْرَةَ   : \" أَرَغِبْتَ عَنْ سُنَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ \"",
    "malay_translation": "Saya menaiki kapal bersama Abu Basrah al-Ghifari dari Fustat pada bulan Ramadan. Lalu beliau bergerak dan menghidangkan makan tengah harinya. Kemudian beliau berkata, 'Marilah mendekat.' Saya berkata, 'Tidakkah kamu melihat rumah-rumah?' Abu Basrah berkata, 'Adakah kamu membenci Sunnah Rasulullah SAW?'"
  },
  {
    "id": 38558,
    "hadith_number": 1021,
    "tajuk_hadith": "Kefardhuan Mengganti Puasa Ramadan",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA, Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ  ، عَنْ ابْنِ الْمُطَوِّسِ  ، عَنْ أَبِيهِ  ،  عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَنْ أَفْطَرَ يَوْمًا مِنْ شَهْرِ رَمَضَانَ مِنْ غَيْرِ رُخْصَةٍ وَلَا مَرَضٍ، فَلَا يَقْضِيَهِ صِيَامُ الدَّهْرِ كُلِّهِ وَلَوْ صَامَ الدَّهْرَ \"",
    "malay_translation": "\"Sesiapa yang berbuka (tidak berpuasa) satu hari pada bulan Ramadan tanpa keringanan (rukhsah) yang dibenarkan syarak dan tanpa sakit, maka tidak dapat diganti (kefardhuan) dengan berpuasa sepanjang tahun sekalipun dia berpuasa sepanjang tahun.\""
  },
  {
    "id": 38559,
    "hadith_number": 1022,
    "tajuk_hadith": "Ancaman bagi Mereka yang Tidak Berpuasa pada Bulan Ramadhan Tanpa Sebab yang Dibenarkan",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA, daripada Nabi SAW",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا شُعْبَةُ  ، أَخْبَرَنِي حَبِيبُ بْنُ أَبِي ثَابِتٍ  ، قَالَ : سَمِعْتُ عُمَارَةَ بْنَ عُمَيْرٍ  يُحَدِّثُ، عَنْ أَبِي الْمُطَوِّسِ  ، عَنْ أَبِيهِ  ، عَنْ أَبِي هُرَيْرَةَ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنْ أَفْطَرَ يَوْمًا مِنْ رَمَضَانَ مِنْ غَيْرِ رُخْصَةٍ رَخَّصَهُ اللَّهُ لَهُ، لَمْ يَقْضِ عَنْهُ صِيَامُ الدَّهْرِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Al-Walid, telah menceritakan kepada kami Syu'bah, telah mengkhabarkan kepadaku Habib bin Abi Thabit, dia berkata: Aku mendengar 'Umarah bin 'Umair menceritakan, daripada Abu al-Mutawis, daripada ayahnya, daripada Abu Hurairah, daripada Nabi SAW, baginda bersabda: \"Sesiapa yang berbuka (tidak berpuasa) satu hari pada bulan Ramadhan tanpa keringanan (rukhsah) yang Allah berikan kepadanya, maka puasa sepanjang tahun tidak dapat menggantikannya.\""
  },
  {
    "id": 38560,
    "hadith_number": 1023,
    "tajuk_hadith": "Kaffarah bagi Mereka yang Melakukan Hubungan Seksual pada Siang Hari di Bulan Ramadhan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْهَاشِمِيُّ  ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ  ، عَنْ الزُّهْرِيِّ  ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ، فَقَالَ : هَلَكْتُ؟ فَقَالَ : \" وَمَا أَهْلَكَكَ؟ قَالَ : وَاقَعْتُ امْرَأَتِي فِي شَهْرِ رَمَضَانَ، قَالَ :\" فَأَعْتِقْ رَقَبَةً \".\nقَالَ : لَيْسَ عِنْدِي.\nقَالَ : \" فَصُمْ شَهْرَيْنِ مُتَتَابِعَيْنِ \".\nقَالَ : لَا أَسْتَطِيعُ.\nقَالَ : \" فَأَطْعِمْ سِتِّينَ مِسْكِينًا \".\nقَالَ : لَا أَجِدُ.\nقَالَ : فَأُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرَقٍ فِيهِ تَمْرٌ، فَقَالَ : \" أَيْنَ السَّائِلُ؟ تَصَدَّقْ بِهَذَا \".\n فَقَالَ : أَعَلَى أَفْقَرَ مِنْ أَهْلِي يَا رَسُولَ اللَّهِ؟ فَوَاللَّهِ مَا بَيْنَ لَابَتَيْهَا أَهْلُ بَيْتٍ أَفْقَرَ مِنَّا، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" فَأَنْتُمْ إِذًا \" وَضَحِكَ حَتَّى بَدَتْ أَنْيَابُهُ.\nحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ ابْنِ شِهَابٍ  ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ  ، عَنْ أَبِي هُرَيْرَةَ  ، أَنَّ رَجُلًا أَفْطَرَ فِي رَمَضَانَ فَذَكَرَ الْحَدِيثَ",
    "malay_translation": "Sulaiman bin Daud al-Hasyimi meriwayatkan kepada kami, Ibrahim bin Sa'd meriwayatkan kepada kami, daripada az-Zuhri, daripada Humaid bin Abd ar-Rahman, daripada Abu Hurairah, dia berkata: Seorang lelaki datang kepada Rasulullah SAW dan berkata: 'Aku telah binasa!' Baginda bertanya: 'Apa yang membinasakanmu?' Dia berkata: 'Aku telah melakukan hubungan seks dengan isteriku di bulan Ramadhan.' Baginda bersabda: 'Bebaskanlah seorang hamba.' Dia berkata: 'Aku tidak punya.' Baginda bersabda: 'Puasalah selama dua bulan berturut-turut.' Dia berkata: 'Aku tidak mampu.' Baginda bersabda: 'Berilah makan enam puluh orang miskin.' Dia berkata: 'Aku tidak menemukan.' Kemudian Rasulullah SAW didatangi dengan satu bekas besar berisi kurma, lalu Baginda bersabda: 'Di mana orang yang bertanya tadi? Bersedekahlah dengan ini.' Dia berkata: 'Apakah kepada orang yang lebih miskin daripada keluargaku, wahai Rasulullah? Demi Allah, tidak ada di antara dua tanah hitam ini keluarga yang lebih miskin daripada kami.' Maka Rasulullah SAW bersabda: 'Jika begitu, berikanlah kepada keluargamu,' dan Baginda tertawa hingga terlihat gigi gerahamnya.\n\nUbaidullah bin Abd al-Majid meriwayatkan kepada kami, Malik meriwayatkan kepada kami, daripada Ibn Shihab, daripada Humaid bin Abd ar-Rahman, daripada Abu Hurairah, bahawa seorang lelaki berbuka puasa di bulan Ramadhan, lalu dia menyebutkan hadis tersebut."
  },
  {
    "id": 38561,
    "hadith_number": 1024,
    "tajuk_hadith": "Hukuman bagi Seseorang yang Melakukan Hubungan Suami Isteri di Bulan Ramadan",
    "perawi_melayu": "Yazid bin Harun, daripada Yahya bin Said al-Ansari, daripada Abdul Rahman bin al-Qasim, daripada Muhammad bin Ja'far bin al-Zubair, daripada Abbad bin Abdullah bin al-Zubair, daripada Aisyah R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، حَدَّثَنَا يَحْيَى يَعْنِي بْنَ سَعِيدٍ الْأَنْصَارِيَّ  ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ  أَخْبَرَهُ، أَنَّ مُحَمَّدَ بْنَ جَعْفَرِ بْنِ الزُّبَيْرِ  أَخْبَرَهُ، أَنَّهُ سَمِعَ عَبَّادَ بْنَ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ  ، أَنَّهُ سَمِعَ عَائِشَةَ  ، تَقُولُ : إِنَّ رَجُلًا سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ : إِنَّهُ احْتَرَقَ، فَسَأَلَهُ : مَا لَهُ؟ فَقَالَ :أَصَابَ أَهْلَهُ فِي رَمَضَانَ.\nفَأُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِكْتَلٍ يُدْعَى الْعَرَقَ فِيهِ تَمْرٌ، فَقَالَ : \" أَيْنَ الْمُحْتَرِقُ؟ \" فَقَامَ الرَّجُلُ، فَقَالَ : \" تَصَدَّقْ بِهَذَا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah menceritakan kepada kami Yahya, iaitu Ibnu Sa'id al-Ansari, bahawa Abdul Rahman bin al-Qasim telah mengkhabarkannya, bahawa Muhammad bin Ja'far bin al-Zubair telah mengkhabarkannya, bahawa dia mendengar Abbad bin Abdullah bin al-Zubair, bahawa dia mendengar Aisyah R.A. berkata: Sesungguhnya seorang lelaki bertanya kepada Nabi SAW, lalu berkata: Sesungguhnya dia telah 'terbakar'. Maka Baginda bertanya kepadanya: Apa yang berlaku kepadanya? Dia berkata: Dia telah menyetubuhi isterinya di bulan Ramadan.\nKemudian Nabi SAW dibawakan dengan satu bekas yang dipanggil al-'Araq yang berisi tamar. Baginda bersabda: \"Di mana orang yang 'terbakar'?\" Maka lelaki itu berdiri. Baginda bersabda: \"Bersedekahlah dengan ini.\""
  },
  {
    "id": 38562,
    "hadith_number": 1025,
    "tajuk_hadith": "Larangan Berpuasa Sunat Bagi Isteri Tanpa Izin Suami",
    "perawi_melayu": "Diriwayatkan daripada Abu Sa'id al-Khudri RA, daripada Nabi SAW",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا شَرِيكٌ  ، عَنْ الْأَعْمَشِ  ، عَنْ أَبِي صَالِحٍ  ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ، أَنَّهُ قَالَ لِامْرَأَةٍ :\" لَا تَصُومِي إِلَّا بِإِذْنِهِ \"",
    "malay_translation": "Yazid bin Harun telah mengkhabarkan kepada kami, Syarik telah mengkhabarkan kepada kami, daripada Al-A'mash, daripada Abu Soleh, daripada Abu Sa'id al-Khudri, daripada Nabi SAW, bahawa baginda bersabda kepada seorang wanita: \"Janganlah kamu berpuasa kecuali dengan izinnya (suami).\""
  },
  {
    "id": 38563,
    "hadith_number": 1026,
    "tajuk_hadith": "Larangan Berpuasa Sunat Bagi Isteri Tanpa Izin Suami",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA, daripada Nabi SAW",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ أَبِي الزِّنَادِ  ، عَنْ الْأَعْرَجِ  ، عَنْ أَبِي هُرَيْرَةَ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" لَا تَصُومُ الْمَرْأَةُ يَوْمًا تَطَوُّعًا فِي غَيْرِ رَمَضَانَ، وَزَوْجُهَا شَاهِدٌ إِلَّا بِإِذْنِهِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Ahmad, telah menceritakan kepada kami Sufyan, daripada Abu Zinad, daripada Al-A'raj, daripada Abu Hurairah RA, daripada Nabi SAW, Baginda bersabda: “Tidak boleh seorang wanita berpuasa sunat pada hari selain Ramadan sedangkan suaminya ada bersamanya, kecuali dengan izinnya.”"
  },
  {
    "id": 38564,
    "hadith_number": 1027,
    "tajuk_hadith": "Larangan Berpuasa Sunat Bagi Isteri Tanpa Izin Suami",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA, daripada Nabi SAW",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ أَبِي الزِّنَادِ  ، عَنْ مُوسَى بْنِ أَبِي عُثْمَانَ  ، عَنْ أَبِيهِ  ، عَنْ أَبِي هُرَيْرَةَ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" لَا تَصُومُ الْمَرْأَةُ يَوْمًا وَزَوْجُهَا شَاهِدٌ، إِلَّا بِإِذْنِهِ \".\nقَالَ : فِي النُّذُورِ تَفِي بِهَا",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Yusuf, daripada Sufyan, daripada Abu az-Zinad, daripada Musa bin Abi Uthman, daripada bapanya, daripada Abu Hurairah RA, daripada Nabi SAW, baginda bersabda: “Tidak boleh seorang wanita berpuasa pada suatu hari sedangkan suaminya ada (bersama), kecuali dengan izinnya.” Baginda bersabda: “Dalam hal nazar, wajib ditunaikan.”"
  },
  {
    "id": 38565,
    "hadith_number": 1028,
    "tajuk_hadith": "Rasulullah S.A.W. Mencium Isterinya Ketika Berpuasa",
    "perawi_melayu": "Diriwayatkan oleh Hajjaj bin Minhal, daripada Hammad bin Salamah, daripada Hisham bin Urwah, daripada ayahnya, daripada Aisyah R.A.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ هِشَامِ بْنِ عُرْوَةَ  ، عَنْ أَبِيهِ  ، عَنْ عَائِشَةَ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \" كَانَيُقَبِّلُ وَهُوَ صَائِمٌ \".\n فَقَالَ عُرْوَةُ : أَمَا إِنَّهَا لَا تَدْعُو إِلَى خَيْرٍ",
    "malay_translation": "Aisyah R.A. meriwayatkan bahawa Rasulullah S.A.W. pernah mencium (isterinya) ketika baginda sedang berpuasa.\n\nUrwah berkata: Ketahuilah, perbuatan ini tidak membawa kepada kebaikan (bagi orang yang tidak dapat mengawal nafsunya)."
  },
  {
    "id": 38566,
    "hadith_number": 1029,
    "tajuk_hadith": "Nabi Muhammad S.A.W Mencium Isterinya Ketika Berpuasa",
    "perawi_melayu": "Diriwayatkan daripada Aisyah R.A. bahawa Nabi SAW mencium isterinya ketika sedang berpuasa.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعْدُ بْنُ حَفْصٍ الطَّلْحِيُّ  ، حَدَّثَنَا شَيْبَانُ  ، عَنْ يَحْيَى بْنِ كَثِيرٍ  ، عَنْ أَبِي سَلَمَةَ  ، عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ  ، عَنْ عُرْوَةَ  ، عَنْ عَائِشَةَ  ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ\" يُقَبِّلُهَا وَهُوَ صَائِمٌ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Sa'd bin Hafs at-Talhi, telah menceritakan kepada kami Syaiban, daripada Yahya bin Kathir, daripada Abi Salamah, daripada Umar bin Abdul Aziz, daripada Urwah, daripada Aisyah R.A., bahawa Nabi SAW pernah mencium isterinya ketika sedang berpuasa."
  },
  {
    "id": 38567,
    "hadith_number": 1030,
    "tajuk_hadith": "Hukum Mencium Ketika Berpuasa",
    "perawi_melayu": "Diriwayatkan oleh Abu Al-Walid At-Tayalisi, daripada Laith bin Sa'ad, daripada Bukair bin Abdullah bin Al-Asyaj, daripada Abdul Malik bin Sa'id Al-Ansari, daripada Jabir bin Abdullah, daripada Umar bin Al-Khattab.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ  ، حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ  ، عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ  ، عَنْ عَبْدِ الْمَلِكِ بْنِ سَعِيدٍ الْأَنْصَارِيِّ  ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ  ، عَنْ عُمَرَ بْنِ الْخَطَّابِ  ، قَالَ : هَشِشْتُ فَقَبَّلْتُ وَأَنَا صَائِمٌ، فَجِئْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقُلْتُ : إِنِّي صَنَعْتُ الْيَوْمَ أَمْرًا عَظِيمًا :قَبَّلْتُ وَأَنَا صَائِمٌ.\nقَالَ : \" أَرَأَيْتَ لَوْ مَضْمَضْتَ مِنْ الْمَاءِ؟ \" قُلْتُ : إِذًا لَا يَضُرُّ.\nقَالَ : \" فَفِيمَ؟ \"",
    "malay_translation": "Umar bin Al-Khattab berkata: \"Aku berasa ghairah lalu aku mencium ketika aku sedang berpuasa. Kemudian aku datang kepada Rasulullah SAW dan berkata: 'Sesungguhnya aku telah melakukan perkara yang besar hari ini: aku telah mencium ketika aku sedang berpuasa.' Baginda bersabda: 'Bagaimana pendapatmu jika kamu berkumur-kumur dengan air?' Aku menjawab: 'Jika begitu, ia tidak memudaratkan.' Baginda bersabda: 'Lalu mengapa (mencium itu memudaratkan)?'\""
  },
  {
    "id": 38568,
    "hadith_number": 1031,
    "tajuk_hadith": "Nabi Muhammad SAW Berpuasa dalam Keadaan Junub",
    "perawi_melayu": "Diriwayatkan dari Abu Asim, daripada Abdul Malik iaitu Ibnu Juraij, mengkhabarkan kepadaku Ibnu Syihab, bahawa Abu Bakar mengkhabarkannya, daripada ayahnya, bahawa Ummu Salamah dan Aisyah mengkhabarkannya, bahawa Nabi SAW pernah berada dalam keadaan junub kerana bersetubuh dengan isterinya, kemudian baginda berpuasa.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، حَدَّثَنَا عَبْدُ الْمَلِكِ يَعْنِي ابْنَ جُرَيْجٍ  ، أَخْبَرَنِي ابْنُ شِهَابٍ  ، أَنَّ أَبَا بَكْرٍ  أَخْبَرَهُ، عَنْ أَبِيهِ  ، أَنَّ أُمَّ سَلَمَةَ  ، وَعَائِشَةَ   أَخْبَرتَاهُ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \" كَانَيُصْبِحُ جُنُبًا مِنْ أَهْلِهِ، ثُمَّ يَصُومُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Asim, telah menceritakan kepada kami Abdul Malik iaitu Ibnu Juraij, telah mengkhabarkan kepadaku Ibnu Syihab, bahawa Abu Bakar telah mengkhabarkannya, daripada ayahnya, bahawa Ummu Salamah dan Aisyah telah mengkhabarkannya, bahawa Nabi SAW pernah berada dalam keadaan junub kerana bersetubuh dengan isterinya, kemudian baginda berpuasa."
  },
  {
    "id": 38569,
    "hadith_number": 1032,
    "tajuk_hadith": "Lupa Makan atau Minum Ketika Berpuasa",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA, daripada Nabi SAW",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُثْمَانُ بْنُ مُحَمَّدٍ  ، حَدَّثَنَا جَرِيرٌ  ، عَنْ هِشَامِ  ، عَنْ ابْنِ سِيرِينَ  ، عَنْ أَبِي هُرَيْرَةَ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنْ نَسِيَ وَهُوَ صَائِمٌ فَأَكَلَ أَوْ شَرِبَ، فَلْيُتِمَّ صَوْمَهُ، فَإِنَّمَا أَطْعَمَهُ اللَّهُ وَسَقَاهُ \"",
    "malay_translation": "Uthman bin Muhammad mengkhabarkan kepada kami, Jarir menceritakan kepada kami, daripada Hisham, daripada Ibnu Sirin, daripada Abu Hurairah, daripada Nabi SAW, baginda bersabda: “Sesiapa yang terlupa ketika berpuasa lalu dia makan atau minum, maka hendaklah dia menyempurnakan puasanya, kerana sesungguhnya Allah yang memberinya makan dan minum.”"
  },
  {
    "id": 38570,
    "hadith_number": 1033,
    "tajuk_hadith": "Makan atau Minum dalam Keadaan Lupa Ketika Berpuasa",
    "perawi_melayu": "Abu Ja'far Muhammad bin Mehran al-Jamal, daripada Hatim bin Ismail, daripada al-Harith bin Abd al-Rahman bin Abi Dhubab, daripada bapa saudaranya, daripada Abu Hurairah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو جَعْفَرٍ مُحَمَّدُ بْنُ مِهْرَانَ الْجَمَّالُ  ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيل  ، عَنْ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي ذُبَابٍ  ، عَنْ عَمِّهِ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِذَا أَكَلَ أَحَدُكُمْ أَوْ شَرِبَ نَاسِيًا وَهُوَ صَائِمٌ، ثُمَّ ذَكَرَ، فَلْيُتِمَّ صِيَامَهُ، فَإِنَّمَا أَطْعَمَهُ اللَّهُ وَسَقَاهُ \".\nقَالَ أَبُو مُحَمَّد : أَهْلُ الْحِجَازِ يَقُولُونَ : يَقْضِي، وَأَنَا أَقُولُ : لَا يَقْضِي",
    "malay_translation": "Abu Ja'far Muhammad bin Mehran al-Jamal memberitahu kami, Hatim bin Ismail menceritakan kepada kami, daripada al-Harith bin Abd al-Rahman bin Abi Dhubab, daripada bapa saudaranya, daripada Abu Hurairah, berkata: Rasulullah SAW bersabda: \"Apabila seseorang daripada kamu makan atau minum dalam keadaan lupa ketika sedang berpuasa, kemudian dia ingat, maka hendaklah dia menyempurnakan puasanya, kerana sesungguhnya Allah-lah yang memberinya makan dan minum.\" Abu Muhammad berkata: Ahli Hijaz mengatakan: Dia perlu mengganti (qada), dan aku berkata: Dia tidak perlu mengganti."
  },
  {
    "id": 38571,
    "hadith_number": 1034,
    "tajuk_hadith": "Nabi ﷺ Muntah dan Membatalkan Puasa",
    "perawi_melayu": "Diriwayatkan daripada Abi Darda' bahawa Nabi ﷺ muntah lalu berbuka puasa.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ  ، حَدَّثَنِي أَبِي  ، حَدَّثَنِي حُسَيْنٌ الْمُعَلِّمُ  ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ  ، عَنْ الْأَوْزَاعِيِّ  ، عَنْ يَعِيشَ بْنِ الْوَلِيدِ  ، عَنْ أَبِيهِ  ، عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ  ، عَنْ أَبِي الدَّرْدَاءِ  ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" قَاءَ فَأَفْطَرَ \".\nقَالَ : فَلَقِيتُ ثَوْبَانَ بِمَسْجِدِ دِمَشْقَ ، فَذَكَرْتُ ذَلِكَ لَهُ، فَقَالَ : صَدَقَ، أَنَا صَبَبْتُ لَهُ الْوَضُوءَ.\n قَالَ عَبْد اللَّهِ : إِذَا اسْتَقَاءَ",
    "malay_translation": "Telah mengkhabarkan kepada kami Abdul Samad bin Abdul Warith, telah menceritakan kepadaku ayahku, telah menceritakan kepadaku Husain al-Mu'allim, daripada Yahya bin Abi Kathir, daripada al-Auza'i, daripada Ya'isy bin al-Walid, daripada ayahnya, daripada Ma'dan bin Abi Talhah, daripada Abi Darda', bahawa Nabi ﷺ muntah lalu berbuka puasa.\n\nDia berkata: Aku bertemu dengan Thauban di Masjid Damsyik, lalu aku menyebutkan hal itu kepadanya, maka dia berkata: Benar, aku yang menuangkan air wuduk untuknya.\n\nAbdullah berkata: Apabila dia muntah."
  },
  {
    "id": 38572,
    "hadith_number": 1035,
    "tajuk_hadith": "Muntah Tidak Sengaja dan Sengaja Bagi Orang yang Berpuasa",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA, Rasulullah SAW bersabda: \"Jika seorang yang berpuasa termuntah tanpa sengaja, maka tidak perlu baginya untuk mengganti puasanya. Dan jika dia sengaja muntah, maka wajib baginya untuk mengganti puasanya.\"",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاق بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ  ، عَنْ هِشَامِ بْنِ حَسَّانَ  ، عَنْ ابْنِ سِيرِينَ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِذَا ذَرَعَ الصَّائِمَ الْقَيْءُ وَهُوَ لَا يُرِيدُهُ، فَلَا قَضَاءَ عَلَيْهِ، وَإِذَا اسْتَقَاءَ، فَعَلَيْهِ الْقَضَاءُ \".\nقَالَ عِيسَى : زَعَمَ أَهْلُ الْبَصْرَةِ أَنَّ هِشَامًا أَوْهَمَ فِيهِ، فَمَوْضِعُ الْخِلَافِ هَهُنَا",
    "malay_translation": "Telah mengkhabarkan kepada kami Ishaq bin Ibrahim, telah menceritakan kepada kami Isa bin Yunus, daripada Hisyam bin Hassan, daripada Ibnu Sirin, daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: \"Jika seorang yang berpuasa termuntah tanpa sengaja, maka tidak perlu baginya untuk mengganti puasanya. Dan jika dia sengaja muntah, maka wajib baginya untuk mengganti puasanya.\"  Isa berkata: Penduduk Basrah mendakwa bahawa Hisyam tersilap dalam hal ini, dan di sinilah letaknya perselisihan."
  },
  {
    "id": 38573,
    "hadith_number": 1036,
    "tajuk_hadith": "Hukum Berbekam di Bulan Ramadan: Membatalkan Puasa?",
    "perawi_melayu": "Diriwayatkan daripada Syaddad bin Aus RA:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا عَاصِمٌ  ، عَنْ عَبْدِ اللَّهِ بْنِ زِيدَ  ، عَنْ أَبِي الْأَشْعَثِ الصَّنْعَانِيِّ  ، عَنْ أَبِي أَسْمَاءَ الرَّحَبِيِّ  ، عَنْ شَدَّادِ بْنِ أَوْسٍ  ، قَالَ : مَرَرْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ثَمَانِ عَشْرَةَ خَلَتْ مِنْ رَمَضَانَ، فَأَبْصَرَ رَجُلًا يَحْتَجِمُ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ \"",
    "malay_translation": "Yazid bin Harun telah mengkhabarkan kepada kami, 'Asim telah mengkhabarkan kepada kami, daripada Abdullah bin Zaid, daripada Abi al-Asy'ath as-San'ani, daripada Abi Asma' ar-Rahabi, daripada Syaddad bin Aus RA, beliau berkata: 'Aku telah melalui bersama Rasulullah SAW pada tanggal 18 Ramadan, lalu Baginda SAW melihat seorang lelaki sedang berbekam. Maka Rasulullah SAW bersabda: 'Telah berbuka orang yang membekam dan orang yang dibekam.'"
  },
  {
    "id": 38574,
    "hadith_number": 1037,
    "tajuk_hadith": "Hukum Berbekam Bagi Orang yang Berpuasa",
    "perawi_melayu": "Wahb bin Jarir, Hisham, Yahya, Abu Qilabah, Abu Asma' ar-Rahabi, Thauban",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا وَهْبُ بْنُ جَرِيرٍ  ، حَدَّثَنَا هِشَامٌ  ، عَنْ يَحْيَى  ، عَنْ أَبِي قِلَابَةَ  ، أَنَّ أَبَا أَسْمَاءَ الرَّحَبِيَّ  حَدَّثَهُ، أَنَّ ثَوْبَانَ   حَدَّثَهُ، قَالَ : بَيْنَمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْشِي بِالْبَقِيعِ إِذَا رَجُلٌ يَحْتَجِمُ، فَقَالَ :\" أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ \".\nقَالَ أَبُو مُحَمَّد : أَنَا أَتَّقِي الْحِجَامَةَ فِي الصَّوْمِ فِي رَمَضَانَ",
    "malay_translation": "Telah mengkhabarkan kepada kami Wahb bin Jarir, telah menceritakan kepada kami Hisham, daripada Yahya, daripada Abu Qilabah, bahawa Abu Asma' ar-Rahabi menceritakan kepadanya, bahawa Thauban menceritakan kepadanya, dia berkata: Ketika Rasulullah SAW berjalan di Baqi', tiba-tiba ada seorang lelaki sedang berbekam, lalu Baginda bersabda: \"Telah berbuka orang yang membekam dan orang yang dibekam.\" Abu Muhammad berkata: Aku menjauhi berbekam ketika berpuasa di bulan Ramadan."
  },
  {
    "id": 38575,
    "hadith_number": 1038,
    "tajuk_hadith": "Puasa adalah Perisai",
    "perawi_melayu": "Diriwayatkan oleh Abu Ubaidah bin al-Jarrah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ  ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ  ، عَنْ وَاصِلٍ  مَوْلَى أَبِي عُيَيْنَةَ، عَنْ بَشَّارِ بْنِ أَبِي سَيْفٍ  ، عَنْ الْوَلِيدِ بْنِ عَبْدِ الرَّحْمَنِ  ، عَنْ عِيَاضِ بْنِ غُطَيْفٍ  ، عَنْ أَبِي عُبَيْدَةَ بْنِ الْجَرَّاحِ  ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" الصَّوْمُ جُنَّةٌ مَا لَمْ يَخْرِقْهَا \".\nقَالَ أَبُو مُحَمَّد : يَعْنِي : بِالْغِيبَةِ",
    "malay_translation": "Telah mengkhabarkan kepada kami 'Amru bin 'Aun, telah menceritakan kepada kami Khalid bin 'Abdillah, daripada Wasil maula Abi 'Uyainah, daripada Basyar bin Abi Saif, daripada al-Walid bin 'Abdurrahman, daripada 'Iyad bin Ghutaif, daripada Abu 'Ubaidah bin al-Jarrah, beliau berkata: Aku mendengar Rasulullah SAW bersabda: \"Puasa adalah perisai selagi dia tidak mengoyakkannya.\" Abu Muhammad berkata: Maksudnya: dengan ghibah (mengumpat)."
  },
  {
    "id": 38576,
    "hadith_number": 1039,
    "tajuk_hadith": "Larangan Bercelak Ketika Berpuasa di Siang Hari",
    "perawi_melayu": "Diriwayatkan daripada Abu Nu'aim, daripada Abdul Rahman bin an-Nu'man Abu an-Nu'man al-Ansari, daripada bapanya, daripada datuknya. Datuknya dibawa kepada Nabi SAW lalu Baginda mengusap kepalanya dan bersabda: \"Jangan bercelak di siang hari ketika kamu berpuasa. Bercelaklah pada waktu malam dengan itsmid, kerana ia membersihkan penglihatan dan menumbuhkan rambut.\"",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ النُّعْمَانِ أَبُو النُّعْمَانِ الْأَنْصَارِيُّ  ، حَدَّثَنِي أَبِي  ، عَنْ جَدِّي  ، وَكَانَ جَدِّي قَدْ أُتِيَ بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَسَحَ عَلَى رَأْسِهِ، وَقَالَ :\" لَا تَكْتَحِلْ بِالنَّهَارِ وَأَنْتَ صَائِمٌ، اكْتَحِلْ لَيْلًا، بِالْإِثْمِدِ، فَإِنَّهُ يَجْلُو الْبَصَرَ وَيُنْبِتُ الشَّعَرَ \".\nقَالَ أَبُو مُحَمَّد : لَا أَرَى بِالْكُحْلِ بَأْسًا",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Nu'aim, telah menceritakan kepada kami Abdul Rahman bin an-Nu'man Abu an-Nu'man al-Ansari, telah menceritakan kepadaku bapaku, daripada datukku. Datukku pernah dibawa kepada Nabi SAW lalu Baginda mengusap kepalanya dan bersabda: \"Janganlah kamu bercelak di siang hari ketika kamu sedang berpuasa. Bercelaklah pada waktu malam dengan itsmid, kerana sesungguhnya ia membersihkan penglihatan dan menumbuhkan rambut.\"\nAbu Muhammad berkata: Aku tidak melihat ada masalah dengan bercelak."
  },
  {
    "id": 38577,
    "hadith_number": 1040,
    "tajuk_hadith": "Hukum Fidyah Sebelum Turunnya Ayat yang Menasakhkannya",
    "perawi_melayu": "Diriwayatkan daripada Salamah RA, katanya:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، حَدَّثَنِي بَكْرٌ هُوَ ابْنُ مُضَرَ  ، عَنْ عَمْرِو بْنِ الْحَارِثِ  ، عَنْ يَزِيدَ  مَوْلَى سَلَمَةَ بْنِ الْأَكْوَعِ،  عَنْ سَلَمَةَ  ، أَنَّهُ قَالَ : لَمَّا نَزَلَتْ هَذِهِ الْآيَةُ : # وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ سورة البقرة آية 184 #، قَالَ :\" كَانَ مَنْ أَرَادَ أَنْ يُفْطِرَ وَيَفْتَدِيَ، فَعَلَ، حَتَّى نَزَلَتْ الْآيَةُ الَّتِي بَعْدَهَا، فَنَسَخَتْهَا \"",
    "malay_translation": "Abdullah bin Salih mengkhabarkan kepada kami, Bakr - iaitu Ibnu Mudar - menceritakan kepadaku, daripada 'Amru bin al-Harith, daripada Yazid, maula (bekas hamba) Salamah bin al-Akwa', daripada Salamah RA, bahawa beliau berkata: \"Ketika turunnya ayat ini: 'Dan wajib atas orang-orang yang tidak terdaya berpuasa (kerana tua dan sebagainya) membayar fidyah iaitu memberi makan orang miskin' (Surah al-Baqarah, ayat 184), beliau berkata: \"Sesiapa yang ingin tidak berpuasa dan membayar fidyah, maka dia melakukannya, sehinggalah turun ayat yang berikutnya, lalu ia memansuhkannya (nasakh).\""
  },
  {
    "id": 38578,
    "hadith_number": 1041,
    "tajuk_hadith": "Nabi SAW Membatalkan Puasa Sunat Ummu Hani'",
    "perawi_melayu": "Abu an-Nu'man, Hammad bin Salamah, Simak bin Harb, Harun bin cucu Ummu Hani', Ummu Hani'",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ سِمَاكِ بْنِ حَرْبٍ  ، عَنْ هَارُونَ ابْنِ ابْنَةِ أُمِّ هَانِئٍ أَوْ ابْنِ ابْنِ أُمِّ هَانِئٍ  ، عَنْ أُمِّ هَانِئٍ  ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا وَهِيَ صَائِمَةٌ، فَأُتِيَ بِإِنَاءٍ فَشَرِبَ ثُمَّ نَاوَلَهَا فَشَرِبَتْ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِنْ كَانَ قَضَاءَ رَمَضَانَ، فَصُومِي يَوْمًا آخَرَ، وَإِنْ كَانَ تَطَوُّعًا، فَإِنْ شِئْتِ، فَاقْضِيهِ، وَإِنْ شِئْتِ، فَلَا تَقْضِيهِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu an-Nu'man, telah menceritakan kepada kami Hammad bin Salamah, daripada Simak bin Harb, daripada Harun bin cucu perempuan Ummu Hani' atau cucu lelaki Ummu Hani', daripada Ummu Hani', bahawa Nabi SAW masuk menemuinya ketika dia sedang berpuasa. Lalu dibawakan satu bekas air, lalu Baginda minum kemudian menghulurkannya kepada Ummu Hani' dan dia pun minum. Rasulullah SAW bersabda: \"Jika itu adalah puasa ganti Ramadhan, maka berpuasalah pada hari yang lain. Dan jika itu adalah puasa sunat, maka jika kamu mahu, gantilah ia, dan jika kamu tidak mahu, maka tidak perlu kamu menggantinya.\""
  },
  {
    "id": 38579,
    "hadith_number": 1042,
    "tajuk_hadith": "Minum Ketika Puasa Sunat dan Tidak Memudaratkannya",
    "perawi_melayu": "Uthman bin Muhammad",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ مُحَمَّدٍ  ، حَدَّثَنَا جَرِيرٌ  ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ  ، عَنْ أُمِّ هَانِئٍ  ، قَالَتْ : لَمَّا كَانَ يَوْمُ فَتْحِ مَكَّةَ، جَاءَتْ فَاطِمَةُ فَجَلَسَتْ عَنْ يَسَارِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأُمُّ هَانِئٍ عَنْ يَمِينِهِ.\nقَالَتْ : فَجَاءَتْ الْوَلِيدَةُ بِإِنَاءٍ فِيهِ شَرَابٌ فَنَاوَلَتْهُ، فَشَرِبَ مِنْهُ ثُمَّ نَاوَلَهُ أُمَّ هَانِئٍ ، فَشَرِبَتْ مِنْهُ ثُمَّ قَالَتْ : يَا رَسُولَ اللَّهِ، لَقَدْ أَفْطَرْتُ، وَكُنْتُ صَائِمَةً.\nفَقَالَ لَهَا :\" أَكُنْتِ تَقْضِينَ شَيْئًا؟ قَالَتْ : لَا.\nقَالَ : \" فَلَا يَضُرُّكِ إِنْ كَانَ تَطَوُّعًا \".\n قَالَ أَبُو مُحَمَّد : أَقُولُ بِهِ",
    "malay_translation": "Telah menceritakan kepada kami Uthman bin Muhammad, telah menceritakan kepada kami Jarir, daripada Yazid bin Abu Ziyad, daripada Abdullah bin al-Harith, daripada Ummu Hani', beliau berkata: Ketika hari pembukaan Kota Makkah, Fatimah datang lalu duduk di sebelah kiri Rasulullah SAW, dan Ummu Hani' di sebelah kanannya.\nBeliau berkata: Kemudian datang seorang budak perempuan dengan membawa bejana berisi minuman, lalu memberikannya kepada Rasulullah SAW, kemudian Baginda meminumnya, lalu memberikannya kepada Ummu Hani', lalu dia meminumnya, kemudian dia berkata: Wahai Rasulullah, sesungguhnya saya telah berbuka, padahal saya sedang berpuasa.\nMaka Baginda bersabda kepadanya: \"Adakah kamu sedang mengqadha' sesuatu?\" Dia menjawab: Tidak.\nBaginda bersabda: \"Maka tidak mengapa bagimu jika puasa itu adalah puasa sunat.\"\nAbu Muhammad berkata: Aku berpendapat dengannya."
  },
  {
    "id": 38580,
    "hadith_number": 1043,
    "tajuk_hadith": "Adab Menghadiri Jemputan Makan Ketika Berpuasa",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA, Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا حَجَّاجُ بْنُ مِنْهَالٍ  ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ  ، عَنْ أَبِي الزِّنَادِ  ، عَنْ الْأَعْرَجِ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِذَا دُعِيَ أَحَدُكُمْ إِلَى طَعَامٍ وَهُوَ صَائِمٌ، فَلْيَقُلْ : إِنِّي صَائِمٌ \"",
    "malay_translation": "Apabila seseorang daripada kamu dijemput untuk makan dan dia sedang berpuasa, maka hendaklah dia berkata: 'Sesungguhnya aku sedang berpuasa.'"
  },
  {
    "id": 38581,
    "hadith_number": 1044,
    "tajuk_hadith": "Keberkatan Makanan di Hadapan Orang Berpuasa",
    "perawi_melayu": "Hasyim bin al-Qasim meriwayatkan daripada Syu'bah, daripada Habib al-Ansari, berkata: Saya mendengar seorang hamba perempuan kami bernama Laila bercerita daripada neneknya, Ummu 'Umarah binti Ka'ab, bahawa Nabi SAW masuk menemuinya, lalu dia menghidangkan makanan untuk baginda. Baginda bersabda kepadanya: \"Makanlah.\"",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا هَاشِمُ بْنُ الْقَاسِمِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ حَبِيبٍ الْأَنْصَارِيِّ  ، قَالَ : سَمِعْتُ مَوْلَاةً لَنَا يُقَالُ لَهَا لَيْلَى  تُحَدِّثُ، عَنْ جَدَّتِهَا أُمِّ عُمَارَةَ بِنْتِ كَعْبٍ  ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا، فَدَعَتْ لَهُ بِطَعَامٍ، فَقَالَ لَهَا : \" كُلِي \".\nفَقَالَتْ : إِنِّي صَائِمَةٌ.\n فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" إِنَّالصَّائِمَ إِذَا أُكِلَ عِنْدَهُ، صَلَّتْ عَلَيْهِ الْمَلَائِكَةُ حَتَّى يَفْرُغُوا، وَرُبَّمَا قَالَ : حَتَّى يَقْضُوا أَكْلَهُمْ \"",
    "malay_translation": "Dia berkata: \"Sesungguhnya saya berpuasa.\" Maka Nabi SAW bersabda: \"Sesungguhnya orang yang berpuasa, apabila makanan dimakan di hadapannya, para malaikat akan berselawat ke atasnya sehingga mereka selesai (makan), atau mungkin baginda bersabda: sehingga mereka menghabiskan makanan mereka.\""
  },
  {
    "id": 38582,
    "hadith_number": 1045,
    "tajuk_hadith": "Puasa Nabi SAW di Bulan Sya'ban dan Penyambungannya dengan Ramadan",
    "perawi_melayu": "Diriwayatkan oleh Ubaidullah daripada Israil, daripada Mansur, daripada Salim, daripada Abu Salamah, daripada Ummu Salamah RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ  ، عَنْ إِسْرَائِيلَ  ، عَنْ مَنْصُورٍ  ، عَنْ سَالِمٍ  ، عَنْ أَبِي سَلَمَةَ  ، عَنْ أُمِّ سَلَمَةَ  ، قَالَتْ :\" مَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَامَ شَهْرًا تَامًّا إِلَّا شَعْبَانَ، فَإِنَّهُ كَانَ يَصِلُهُ بِرَمَضَانَ لِيَكُونَا شَهْرَيْنِ مُتَتَابِعَيْنِ، وَكَانَ يَصُومُ مِنْ الشَّهْرِ حَتَّى نَقُولَ : لَا يُفْطِرُ، وَيُفْطِرُ حَتَّى نَقُولَ : لَا يَصُومُ \"",
    "malay_translation": "Ummu Salamah RA berkata: “Aku tidak pernah melihat Rasulullah SAW berpuasa sebulan penuh kecuali di bulan Sya'ban, kerana Baginda menyambungnya dengan bulan Ramadan supaya menjadi dua bulan berturut-turut. Baginda juga berpuasa (pada bulan-bulan lain) sehingga kami berkata: 'Baginda tidak akan berbuka,' dan Baginda berbuka sehingga kami berkata: 'Baginda tidak akan berpuasa.'"
  },
  {
    "id": 38583,
    "hadith_number": 1046,
    "tajuk_hadith": "Larangan Berpuasa Selepas Pertengahan Bulan Sya'ban",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA, Rasulullah SAW bersabda: \"Apabila sudah melewati pertengahan bulan Sya'ban, maka berhentilah daripada berpuasa.\"",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ  ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ الْحَنَفِيُّ  يُقَالُ : عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، عَنْ الْعَلَاءِ  ، عَنْ أَبِيهِ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِذَا كَانَ النِّصْفُ مِنْ شَعْبَانَ، فَأَمْسِكُوا عَنْ الصَّوْمِ \".\n  أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ  ، عَنْ عَبْدِ الْعَزِيزِ بْنِ مُحَمَّدٍ  ، عَنْ الْعَلَاءِ  ، عَنْ أَبِيهِ  ، عَنْ أَبِي هُرَيْرَةَ  ، نَحْوَ هَذَا",
    "malay_translation": "Telah mengkhabarkan kepada kami Abdus Samad bin Abdul Warith, telah menceritakan kepada kami Abdurrahman al-Hanafi, dikatakan: Abdurrahman bin Ibrahim, daripada al-Ala', daripada ayahnya, daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: \"Apabila sudah melewati pertengahan bulan Sya'ban, maka berhentilah daripada berpuasa.\"\nTelah mengkhabarkan kepada kami al-Hakam bin al-Mubarak, daripada Abdul Aziz bin Muhammad, daripada al-Ala', daripada ayahnya, daripada Abu Hurairah RA, seumpama ini."
  },
  {
    "id": 38584,
    "hadith_number": 1047,
    "tajuk_hadith": "Mengganti Puasa 'Sarar' (Akhir) Bulan dengan Dua Hari",
    "perawi_melayu": "Diriwayatkan daripada Imran bin Husain RA bahawa Rasulullah SAW bertanya kepada seorang lelaki: Adakah kamu berpuasa dari 'Sarar' (akhir) bulan ini? Dia menjawab: Tidak. Baginda bersabda: Apabila kamu berbuka (selesai berpuasa) dari Ramadan, maka berpuasalah dua hari.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا الْجُرَيْرِيُّ  ، عَنْ أَبِي الْعَلَاءِ بْنِ الشِّخِّيرِ  ، عَنْ مُطَرِّفٍ  ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِرَجُلٍ : \" هَلْ صُمْتَ مِنْ سَرَرِ هَذَا الشَّهْرِ؟ \" فَقَالَ : لَا.\nقَالَ :\" إِذَا أَفْطَرْتَ مِنْ رَمَضَانَ، فَصُمْ يَوْمَيْنِ \".\nقَالَ أَبُو مُحَمَّد : سَرَرُهُ : آخِرُهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah mengkhabarkan kepada kami Al-Jurairi, daripada Abu al-'Ala' bin al-Syikhkhir, daripada Mutarrif, daripada Imran bin Husain, bahawa Rasulullah SAW bersabda kepada seorang lelaki: \"Adakah kamu berpuasa dari sarar (akhir) bulan ini?\" Dia berkata: Tidak. Baginda bersabda: \"Apabila kamu telah berbuka (selesai berpuasa) dari Ramadan, maka berpuasalah dua hari.\" Abu Muhammad berkata: Sarar itu adalah akhirnya (bulan)."
  },
  {
    "id": 38585,
    "hadith_number": 1048,
    "tajuk_hadith": "Rasulullah SAW Tidak Berpuasa Sebulan Penuh Selain Ramadan",
    "perawi_melayu": "Diriwayatkan dari Ibnu Abbas RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى  ، حَدَّثَنَا أَبُو عَوَانَةَ  ، عَنْ أَبِي بِشْرٍ  ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ :\" مَا صَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَهْرًا كَامِلًا غَيْرَ رَمَضَانَ، وَإِنْ كَانَ لَيَصُومُ إِذَا صَامَ حَتَّى يَقُولَ الْقَائِلُ : لَا وَاللَّهِ لَا يُفْطِرُ، وَيُفْطِرُ إِذَا أَفْطَرَ حَتَّى يَقُولَ الْقَائِلُ : لَا وَاللَّهِ لَا يَصُومُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Isa, telah menceritakan kepada kami Abu Awanah, dari Abu Bisyr, dari Sa'id bin Jubair, dari Ibnu Abbas RA, beliau berkata: \"Rasulullah SAW tidak pernah berpuasa sebulan penuh selain Ramadan. Dan sesungguhnya, apabila baginda berpuasa, sehingga seseorang akan berkata: 'Demi Allah, baginda tidak akan berbuka.' Dan apabila baginda berbuka, sehingga seseorang akan berkata: 'Demi Allah, baginda tidak akan berpuasa.'"
  },
  {
    "id": 38586,
    "hadith_number": 1049,
    "tajuk_hadith": "Larangan Berpuasa Sepanjang Tahun",
    "perawi_melayu": "Diriwayatkan daripada Mutarrif bin Abdullah bin Asy-Syikhkhir, daripada ayahnya, beliau berkata: Seorang lelaki yang berpuasa sepanjang tahun disebut di hadapan Rasulullah SAW, lalu Baginda bersabda: \"Dia tidak berpuasa dan tidak berbuka.\"",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ الْأَوْزَاعِيِّ  ، عَنْ قَتَادَةَ  ، عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ  ، عَنْ أَبِيهِ  ، قَالَ : ذُكِرَ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ يَصُومُ الدَّهْرَ، فَقَالَ :\" لَا صَامَ وَلَا أَفْطَرَ \"",
    "malay_translation": "Muhammad bin Yusuf mengkhabarkan kepada kami, daripada al-Auza'i, daripada Qatadah, daripada Mutarrif bin Abdullah bin Asy-Syikhkhir, daripada ayahnya, beliau berkata: Seorang lelaki yang berpuasa sepanjang tahun disebut di hadapan Rasulullah SAW, lalu Baginda bersabda: \"Dia tidak berpuasa dan tidak berbuka.\""
  },
  {
    "id": 38587,
    "hadith_number": 1050,
    "tajuk_hadith": "Pesanan Nabi SAW: Solat Witir, Puasa Tiga Hari Setiap Bulan, dan Solat Dhuha",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، حَدَّثَنَا الْعَوَّامُ  ، حَدَّثَنِي سُلَيْمَانُ بْنُ أَبِي سُلَيْمَانَ  ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ  ، يَقُولُ : أَوْصَانِي خَلِيلِي بِثَلَاثٍ لَسْتُ بِتَارِكِهِنَّ : \" أَنْلَا أَنَامَ إِلَّا عَلَى وِتْرٍ، وَأَنْ أَصُومَ ثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ، وَأَنْ لَا أَدَعَ رَكْعَتَيْ الضُّحَى \".\n أَخْبَرَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ عَبَّاسٍ الْجُرَيْرِيِّ  ، عَنْ أَبِي عُثْمَانَ  ، عَنْ أَبِي هُرَيْرَةَ  ، نَحْوَهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah menceritakan kepada kami Al-Awwam, telah menceritakan kepadaku Sulaiman bin Abi Sulaiman, bahawa dia mendengar Abu Hurairah RA berkata: Kekasihku (Nabi Muhammad SAW) telah berpesan kepadaku dengan tiga perkara yang aku tidak akan meninggalkannya: \"Aku tidak akan tidur melainkan setelah mengerjakan solat Witir, aku akan berpuasa tiga hari setiap bulan, dan aku tidak akan meninggalkan dua rakaat solat Dhuha.\" Telah mengkhabarkan kepada kami Abu al-Walid, telah menceritakan kepada kami Syu'bah, daripada Abbas al-Jurairi, daripada Abu Uthman, daripada Abu Hurairah RA, seumpama itu."
  },
  {
    "id": 38588,
    "hadith_number": 1051,
    "tajuk_hadith": "Puasa Hari-Hari Putih (Ayyamul Bidh) Seperti Puasa Sepanjang Tahun",
    "perawi_melayu": "Abu al-Walid meriwayatkan daripada Syu'bah, daripada Mu'awiyah bin Qurrah, daripada bapanya, daripada Nabi SAW",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ  ، عَنْ أَبِيهِ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" صِيَامُ الْبِيضِ صِيَامُ الدَّهْرِ وَإِفْطَارُهُ \"",
    "malay_translation": "Abu al-Walid meriwayatkan kepada kami, Syu'bah meriwayatkan kepada kami, daripada Mu'awiyah bin Qurrah, daripada bapanya, daripada Nabi SAW, baginda bersabda: \"Puasa Ayyamul Bidh (hari-hari putih) adalah seperti puasa sepanjang tahun dan berbuka (pada hari-hari lain).\""
  },
  {
    "id": 38589,
    "hadith_number": 1052,
    "tajuk_hadith": "Larangan Berpuasa pada Hari Jumaat (kecuali dengan sebab)",
    "perawi_melayu": "Diriwayatkan daripada Jabir RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ ابْنِ جُرَيْجٍ  ، عَنْ عَبْدِ الْحَمِيدِ بْنِ جُبَيْرِ بْنِ شَيْبَةَ  ، عَنْ مُحَمَّدِ بْنِ عَبَّادِ بْنِ جَعْفَرٍ  ، قَالَ : قُلْتُ لِجَابِرٍ   :\" أَنَهَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَوْمِ يَوْمِ الْجُمُعَةِ؟ قَالَ : نَعَمْ وَرَبِّ هَذَا الْبَيْتِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Asim, daripada Ibn Juraij, daripada Abdul Hamid bin Jubair bin Syaibah, daripada Muhammad bin Abbad bin Jaafar, dia berkata: Aku bertanya kepada Jabir RA: \"Adakah Nabi SAW melarang daripada berpuasa pada hari Jumaat?\" Dia menjawab: \"Ya, demi Tuhan pemilik rumah ini (Kaabah).\""
  },
  {
    "id": 38590,
    "hadith_number": 1053,
    "tajuk_hadith": "Larangan Berpuasa pada Hari Sabtu Kecuali yang Difardhukan",
    "perawi_melayu": "Diriwayatkan oleh Abdullah bin Busr daripada saudara perempuannya, yang dikenali sebagai As-Samma'.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ ثَوْرٍ  ، عَنْ خَالِدِ بْنِ مَعْدَانَ  ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُسْرٍ  ، عَنْ أُخْتِهِ يُقَالُ لَهَا الصَّمَّاءُ  ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" لَا تَصُومُوا يَوْمَ السَّبْتِ إِلَّا فِيمَا افْتُرِضَ عَلَيْكُمْ، وَإِنْ لَمْ يَجِدْ أَحَدُكُمْ إِلَّا كَذَا أَوْ لِحَاءَ شَجَرَةٍ فَلْيَمْضَغْهُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Asim, daripada Thawr, daripada Khalid bin Ma'dan, telah menceritakan kepadaku Abdullah bin Busr, daripada saudara perempuannya yang dikenali sebagai As-Samma', bahawa Rasulullah SAW bersabda: \"Janganlah kamu berpuasa pada hari Sabtu kecuali pada perkara yang difardhukan ke atas kamu. Dan jika seseorang daripada kamu tidak menemui kecuali dahan atau kulit pokok, maka hendaklah dia mengunyahnya.\""
  },
  {
    "id": 38591,
    "hadith_number": 1054,
    "tajuk_hadith": "Keutamaan Puasa Isnin dan Khamis",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ  ، حَدَّثَنَا هِشَامٌ  ، عَنْ يَحْيَى  ، عَنْ عُمَرَ بْنِ الْحَكَمِ بْنِ ثَوْبَانَ  ، أَنَّ مَوْلَى  قُدَامَةَ بْنِ مَظْعُونٍ حَدَّثَهُ، أَنَّ مَوْلَى  أُسَامَةَ حَدَّثَهُ، قَالَ : كَانَ أُسَامَةُ   يَرْكَبُ إِلَى مَالٍ لَهُ بِوَادِي الْقُرَى، فَيَصُومُ الِاثْنَيْنِ وَالْخَمِيسَ فِي الطَّرِيقِ، فَقُلْتُ لَهُ : لِمَ تَصُومُ الِاثْنَيْنِ وَالْخَمِيسَ فِي السَّفَرِ وَقَدْ كَبِرْتَ وَضَعُفْتَ أَوْ رَقِقْتَ؟ فَقَالَ : إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَصُومُ الِاثْنَيْنِ وَالْخَمِيسَ، وَقَالَ : \" إِنَّأَعْمَالَ النَّاسِ تُعْرَضُ يَوْمَ الِاثْنَيْنِ وَالْخَمِيسِ \"",
    "malay_translation": "Telah menceritakan kepada kami Wahb bin Jarir, telah menceritakan kepada kami Hisyam, daripada Yahya, daripada Umar bin al-Hakam bin Thauban, bahawa seorang hamba sahaya Qudamah bin Maz'un menceritakan kepadanya, bahawa seorang hamba sahaya Usamah menceritakan kepadanya, dia berkata: Usamah pernah menunggang kenderaan ke tanah miliknya di Wadi al-Qura, lalu dia berpuasa pada hari Isnin dan Khamis di sepanjang jalan. Maka aku bertanya kepadanya: \"Mengapa kamu berpuasa pada hari Isnin dan Khamis dalam perjalanan, padahal kamu sudah tua dan lemah?\" Dia menjawab: \"Sesungguhnya Rasulullah SAW pernah berpuasa pada hari Isnin dan Khamis, dan Baginda bersabda: 'Sesungguhnya amalan manusia dipersembahkan pada hari Isnin dan Khamis.'"
  },
  {
    "id": 38592,
    "hadith_number": 1055,
    "tajuk_hadith": "Amalan Puasa Nabi Muhammad SAW pada Hari Isnin dan Khamis",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ مُحَمَّدِ بْنِ رِفَاعَةَ  ، عَنْ سُهَيْلٍ  ، عَنْ أَبِيهِ  ، عَنْ أَبِي هُرَيْرَةَ  ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَصُومُ يَوْمَ الِاثْنَيْنِ وَالْخَمِيسِ، فَسَأَلْتُهُ، فَقَالَ : \" إِنَّالْأَعْمَالَ تُعْرَضُ يَوْمَ الِاثْنَيْنِ وَالْخَمِيسِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Asim, daripada Muhammad bin Rifa'ah, daripada Suhail, daripada ayahnya, daripada Abu Hurairah RA, bahawa Nabi SAW berpuasa pada hari Isnin dan Khamis. Lalu aku bertanya kepada baginda, dan baginda bersabda: \"Sesungguhnya amalan-amalan dipersembahkan pada hari Isnin dan Khamis.\""
  },
  {
    "id": 38593,
    "hadith_number": 1056,
    "tajuk_hadith": "Puasa dan Solat yang Paling Disukai Allah: Puasa dan Solat Nabi Daud AS",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُثْمَانُ بْنُ مُحَمَّدٍ  ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ  ، عَنْ عَمْرٍو يَعْنِي ابْنَ دِينَارٍ  ، عَنْ عَمْرِو بْنِ أَوْسٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو  ، يَرْفَعُهُ قَالَ :\" أَحَبُّ الصِّيَامِ إِلَى اللَّهِ G صِيَامُ دَاوُدَ ، كَانَ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا، وَأَحَبُّ الصَّلَاةِ إِلَى اللَّهِ G صَلَاةُ دَاوُدَ ، كَانَ يُصَلِّي نِصْفًا، وَيَنَامُ ثُلُثًا، وَيُسَبِّحُ سُدُسًا \".\nقَالَ أَبُو مُحَمَّد : هَذَا اللَّفْظُ الْأَخِيرُ غَلَطٌ أَوْ خَطَأٌ، إِنَّمَا هُوَ أَنَّهُ كَانَ يَنَامُ نِصْفَ اللَّيْلِ وَيُصَلِّي ثُلُثَهُ، وَيُسَبِّحُ تَسْبِيحَةً",
    "malay_translation": "Uthman bin Muhammad telah mengkhabarkan kepada kami, Sufyan bin Uyainah telah menceritakan kepada kami, daripada 'Amr, iaitu Ibnu Dinar, daripada 'Amru bin Aus, daripada Abdullah bin 'Amru, yang meriwayatkan secara *marfu'* (kepada Nabi SAW), beliau bersabda: \"Puasa yang paling disukai oleh Allah ialah puasa Nabi Daud AS, iaitu beliau berpuasa sehari dan berbuka sehari. Dan solat yang paling disukai oleh Allah ialah solat Nabi Daud AS, iaitu beliau solat separuh malam, tidur sepertiga malam, dan bertasbih seperenam malam.\"\nAbu Muhammad berkata: Lafaz yang terakhir ini adalah salah atau kekeliruan. Sebenarnya, beliau (Nabi Daud AS) tidur separuh malam, solat sepertiga malam, dan bertasbih."
  },
  {
    "id": 38594,
    "hadith_number": 1057,
    "tajuk_hadith": "Larangan Berpuasa pada Hari Raya Fitri dan Aidiladha",
    "perawi_melayu": "Sa'id bin Amir, daripada Syu'bah, daripada Abdul Malik bin Umair, daripada Qaza'ah, maula Ziyad, daripada Abu Sa'id al-Khudri, daripada Nabi SAW",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ  ، عَنْ شُعْبَةَ  ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ  ، عَنْ قَزَعَةَ  مَوْلَى زِيَادٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" لَا صَوْمَ يَوْمَيْنِ : يَوْمَ الْفِطْرِ وَيَوْمَ النَّحْرِ \"",
    "malay_translation": "Telah menceritakan kepada kami Sa'id bin Amir, daripada Syu'bah, daripada Abdul Malik bin Umair, daripada Qaza'ah, maula Ziyad, daripada Abu Sa'id al-Khudri, daripada Nabi SAW, baginda bersabda: \"Tidak boleh berpuasa pada dua hari: hari Fitri (Raya Aidilfitri) dan hari Nahr (Raya Aidiladha).\""
  },
  {
    "id": 38595,
    "hadith_number": 1058,
    "tajuk_hadith": "Keutamaan Puasa Enam Hari di Bulan Syawal Setelah Ramadan",
    "perawi_melayu": "Diriwayatkan oleh Nu'aim bin Hammad, daripada Abdul Aziz bin Muhammad, daripada Safwan dan Sa'd bin Sa'id, daripada Umar bin Thabit, daripada Abi Ayyub, daripada Nabi SAW.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا نُعَيْمُ بْنُ حَمَّادٍ  ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ  ، حَدَّثَنَا صَفْوَانُ  ، وسَعْدُ بْنُ سَعِيدٍ  ، عَنْ عُمَرَ بْنِ ثَابِتٍ  ،  عَنْ أَبِي أَيُّوبَ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنْ صَامَ رَمَضَانَ ثُمَّ أَتْبَعَهُ سِتَّةً مِنْ شَوَّالٍ، فَذَلِكَ صِيَامُ الدَّهْرِ \"",
    "malay_translation": "Telah menceritakan kepada kami Nu'aim bin Hammad, telah menceritakan kepada kami Abdul Aziz bin Muhammad, telah menceritakan kepada kami Safwan dan Sa'd bin Sa'id, daripada Umar bin Thabit, daripada Abi Ayyub, daripada Nabi SAW, baginda bersabda: \"Sesiapa yang berpuasa Ramadan kemudian diikuti dengan enam hari di bulan Syawal, maka (pahalanya) seperti berpuasa sepanjang tahun.\""
  },
  {
    "id": 38596,
    "hadith_number": 1059,
    "tajuk_hadith": "Keutamaan Puasa Ramadan dan Enam Hari di Bulan Syawal",
    "perawi_melayu": "Yahya bin Hassan, Yahya bin Hamzah, Yahya bin al-Harith al-Dhimari, daripada Abu Asma' al-Rahabi, daripada Thauban",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ  ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ  ، حَدَّثَنَا يَحْيَى بْنُ الْحَارِثِ الذِّمَارِيُّ  ، عَنْ أَبِي أَسْمَاءَ الرَّحَبِيِّ  ، عَنْ ثَوْبَانَ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" صِيَامُ شَهْرٍ بِعَشَرَةِ أَشْهُرٍ، وَسِتَّةِ أَيَّامٍ بَعْدَهُنَّ بِشَهْرَيْنِ، فَذَلِكَ تَمَامُ سَنَةٍ \"، يَعْنِي شَهْرَ رَمَضَانَ، وَسِتَّةَ أَيَّامٍ بَعْدَهُ",
    "malay_translation": "Telah menceritakan kepada kami Yahya bin Hassan, telah menceritakan kepada kami Yahya bin Hamzah, telah menceritakan kepada kami Yahya bin al-Harith al-Dhimari, daripada Abu Asma' al-Rahabi, daripada Thauban, bahawa Rasulullah SAW bersabda: \"Puasa sebulan (Ramadan) (ganjarannya) seperti puasa sepuluh bulan, dan (puasa) enam hari selepasnya (Syawal) (ganjarannya) seperti puasa dua bulan, maka itu adalah sempurnanya setahun.\", iaitu bulan Ramadan dan enam hari selepasnya."
  },
  {
    "id": 38597,
    "hadith_number": 1060,
    "tajuk_hadith": "Keutamaan Puasa di Bulan Muharram",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سَعِيدٍ  ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَاق  ، عَنْ النُّعْمَانِ بْنِ سَعْدٍ  ، قَالَ : جَاءَ رَجُلٌ إِلَى عَلِيٍّ فَسَأَلَهُ عَنْ شَهْرٍ بَعْدَ شَهْرِ رَمَضَانَ يَصُومُهُ، فَقَالَ لَهُ عَلِيٌّ   : مَا سَأَلَنِي أَحَدٌ عَنْ هَذَا بَعْدَ إِذْ سَمِعْتُ رَجُلًا سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : أَيُّ شَهْرٍ يَصُومُهُ مِنْ السَّنَةِ بَعْدَ شَهْرِ رَمَضَانَ.فَأَمَرَهُ بِصِيَامِ الْمُحَرَّمِ، وَقَالَ : \" إِنَّ فِيهِ يَوْمًا تَابَ اللَّهُ عَلَى قَوْمٍ وَيَتُوبُ فِيهِ عَلَى قَوْمٍ \"",
    "malay_translation": "Muhammad bin Sa'id menceritakan kepada kami, Muhammad bin Fudail menceritakan kepada kami, daripada Abdurrahman bin Ishaq, daripada Nu'man bin Sa'd, dia berkata: Seorang lelaki datang kepada Ali dan bertanya kepadanya tentang bulan selepas bulan Ramadan yang boleh dia berpuasa. Ali berkata kepadanya: Tidak seorang pun bertanya kepadaku tentang ini setelah aku mendengar seorang lelaki bertanya kepada Nabi SAW: Bulan manakah yang dia berpuasa dari setahun selepas bulan Ramadan. Maka baginda memerintahkannya untuk berpuasa di bulan Muharram, dan bersabda: \"Sesungguhnya di dalamnya terdapat hari yang Allah menerima taubat suatu kaum dan Dia menerima taubat kaum yang lain pada hari itu.\""
  },
  {
    "id": 38598,
    "hadith_number": 1061,
    "tajuk_hadith": "Keutamaan Puasa Sunat di Bulan Muharram",
    "perawi_melayu": "Zaid bin Auf, daripada Abu Awanah, daripada Abdul Malik bin Umair, daripada Muhammad bin al-Muntashir, daripada Humaid bin Abdurrahman, daripada Abu Hurairah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا زَيْدُ بْنُ عَوْفٍ  ، حَدَّثَنَا أَبُو عَوَانَةَ  ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ  ، عَنْ مُحَمَّدِ بْنِ الْمُنْتَشِرِ  ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ  ، عَنْ أَبِي هُرَيْرَةَ  ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :\" أَفْضَلُ الصِّيَامِ بَعْدَ شَهْرِ رَمَضَانَ شَهْرُ اللَّهِ الَّذِي تَدْعُونَهُ الْمُحَرَّمَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Zaid bin Auf, telah menceritakan kepada kami Abu Awanah, daripada Abdul Malik bin Umair, daripada Muhammad bin al-Muntashir, daripada Humaid bin Abdurrahman, daripada Abu Hurairah, bahawa Nabi SAW bersabda: “Puasa yang paling utama setelah bulan Ramadhan adalah bulan Allah yang kamu sebut sebagai Muharram.”"
  },
  {
    "id": 38599,
    "hadith_number": 1062,
    "tajuk_hadith": "Keutamaan Puasa Sunnah di Bulan Muharram Setelah Ramadan",
    "perawi_melayu": "Diriwayatkan oleh Abu Nu'aim dan Yahya bin Hassan, daripada Abu 'Awanah, daripada Abi Bisyr, daripada Humaid bin Abdurrahman al-Himyari, daripada Abu Hurairah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، وَأَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ  ، أَخْبَرَنَا أَبُو عَوَانَةَ  ، عَنْ أَبِي بِشْرٍ  ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ الْحِمْيَرِيِّ  ، عَنْ أَبِي هُرَيْرَةَ  ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :\" أَفْضَلُ الصِّيَامِ بَعْدَ شَهْرِ رَمَضَانَ الْمُحَرَّمُ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, dan telah mengkhabarkan kepada kami Yahya bin Hassan, telah mengkhabarkan kepada kami Abu 'Awanah, daripada Abi Bisyr, daripada Humaid bin Abdurrahman al-Himyari, daripada Abu Hurairah, bahawa Nabi SAW bersabda: 'Sebaik-baik puasa setelah bulan Ramadan adalah (puasa) di bulan Muharram.'"
  },
  {
    "id": 38600,
    "hadith_number": 1063,
    "tajuk_hadith": "Puasa Asyura: Mengingati Kejayaan Nabi Musa A.S.",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَهْلُ بْنُ حَمَّادٍ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ أَبِي بِشْرٍ  ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، أَنَّهُ قَالَ : قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ ، وَالْيَهُودُ يَصُومُونَ يَوْمَ عَاشُورَاءَ، فَسَأَلَهُمْ، فَقَالُوا : هَذَا الْيَوْمُ الَّذِي ظَهَرَ فِيهِ مُوسَى عَلَى فِرْعَوْنَ.\nفَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" أَنْتُمْ أَوْلَى بِمُوسَى فَصُومُوهُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Sahl bin Hammad, telah menceritakan kepada kami Syu'bah, daripada Abi Bisyr, daripada Sa'id bin Jubair, daripada Ibnu Abbas, bahawa dia berkata: Rasulullah SAW tiba di Madinah dan orang-orang Yahudi berpuasa pada hari Asyura. Baginda bertanya kepada mereka, lalu mereka berkata: 'Ini adalah hari di mana Musa telah berjaya menewaskan Firaun.' Maka Rasulullah SAW bersabda: 'Kamu lebih berhak terhadap Musa, maka berpuasalah kamu pada hari itu.'"
  },
  {
    "id": 38601,
    "hadith_number": 1064,
    "tajuk_hadith": "Puasa Hari Asyura",
    "perawi_melayu": "Diriwayatkan daripada Aisyah R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ  ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ  ، عَنْ الزُّهْرِيِّ  ، عَنْ عُرْوَةَ  ، عَنْ عَائِشَةَ  ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَصُومُ يَوْمَ عَاشُورَاءَ،\" وَيَأْمُرُنَا بِصِيَامِهِ \"",
    "malay_translation": "Ubaidullah bin Abdul Majeed telah mengkhabarkan kepada kami, Ibnu Abi Dzi'b telah menceritakan kepada kami, daripada Az-Zuhri, daripada Urwah, daripada Aisyah R.A., bahawa Nabi SAW berpuasa pada hari Asyura dan Baginda menyuruh kami berpuasa padanya."
  },
  {
    "id": 38602,
    "hadith_number": 1065,
    "tajuk_hadith": "Perintah Berpuasa pada Hari Asyura",
    "perawi_melayu": "Abu Asim meriwayatkan daripada Yazid bin Abi Ubaid, daripada Salamah bin Al-Akwa', bahawa Nabi SAW mengutus seorang lelaki dari Aslam pada hari Asyura",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ  ، عَنْ سَلَمَةَ بْنِ الْأَكْوَعِ  ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ يَوْمَ عَاشُورَاءَ رَجُلًا مِنْ أَسْلَمَ : \" إِنَّالْيَوْمَ يَوْمُ عَاشُورَاءَ، فَمَنْ كَانَ أَكَلَ أَوْ شَرِبَ، فَلْيُتِمَّ بَقِيَّةَ يَوْمِهِ، وَمَنْ لَمْ يَكُنْ أَكَلَ أَوْ شَرِبَ، فَلْيَصُمْهُ \"",
    "malay_translation": "Abu Asim memberitahu kami, daripada Yazid bin Abi Ubaid, daripada Salamah bin Al-Akwa', bahawa Nabi SAW telah mengutuskan seorang lelaki daripada Aslam pada hari Asyura (dengan pesanan): \"Sesungguhnya hari ini adalah hari Asyura. Sesiapa yang telah makan atau minum, maka hendaklah dia menyempurnakan sisa harinya (dengan menahan diri daripada makan dan minum). Dan sesiapa yang belum makan atau minum, maka hendaklah dia berpuasa.\""
  },
  {
    "id": 38603,
    "hadith_number": 1066,
    "tajuk_hadith": "Galakan Berpuasa pada Hari Asyura",
    "perawi_melayu": "Ya'la, daripada Muhammad bin Ishaq, daripada Nafi', daripada Ibnu Umar",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَعْلَى  ، عَنْ مُحَمَّدِ بْنِ إِسْحَاق  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" هَذَا يَوْمُ عَاشُورَاءَ، وَكَانَتْ قُرَيْشٌ تَصُومُهُ فِي الْجَاهِلِيَّةِ، فَمَنْ أَحَبَّ مِنْكُمْ أَنْ يَصُومَهُ، فَلْيَصُمْهُ، فَمَنْ أَحَبَّ مِنْكُمْ أَنْ يَتْرُكَهُ فَلْيَتْرُكْهُ \".\nوَكَانَ ابْنُ عُمَرَ لَا يَصُومُهُ إِلَّا أَنْ يُوَافِقَ صِيَامَهُ",
    "malay_translation": "Ya'la telah memberitahu kami, daripada Muhammad bin Ishaq, daripada Nafi', daripada Ibnu Umar, beliau berkata: Rasulullah SAW bersabda: \"Ini adalah hari Asyura, dan kaum Quraisy berpuasa pada hari ini di zaman Jahiliyyah. Maka sesiapa di antara kamu yang suka berpuasa, maka berpuasalah. Dan sesiapa di antara kamu yang suka meninggalkannya, maka tinggalkanlah.\" Ibnu Umar tidak berpuasa pada hari itu kecuali jika bertepatan dengan hari dia berpuasa (sunat)."
  },
  {
    "id": 38604,
    "hadith_number": 1067,
    "tajuk_hadith": "Puasa Asyura Sebelum dan Selepas Kedatangan Rasulullah SAW ke Madinah",
    "perawi_melayu": "Diriwayatkan daripada Aisyah R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ الْوَهَّابِ بْنُ سَعِيدٍ  ، حَدَّثَنَا شُعَيْبُ بْنُ إِسْحَاق  ، عَنْ هِشَامِ بْنِ عُرْوَةَ  ، عَنْ أَبِيهِ  ، عَنْ عَائِشَةَ  ، قَالَتْ : \" كَانَ يَوْمُ عَاشُورَاءَ يَوْمًا تَصُومُهُ قُرَيْشٌ فِي الْجَاهِلِيَّةِ، فَلَمَّا قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ ، صَامَهُوَأَمَرَ بِصِيَامِهِ، حَتَّى إِذَا فُرِضَ رَمَضَانُ، كَانَ رَمَضَانُ هُوَ الْفَرِيضَةُ، وَتُرِكَ يَوْمُ عَاشُورَاءَ فَمَنْ شَاءَ صَامَهُ، وَمَنْ شَاءَ تَرَكَهُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abdul Wahhab bin Sa'id, telah menceritakan kepada kami Syu'aib bin Ishaq, daripada Hisyam bin Urwah, daripada ayahnya, daripada Aisyah R.A., beliau berkata: \"Hari Asyura adalah hari yang dipuasakan oleh kaum Quraisy pada zaman Jahiliyyah. Ketika Rasulullah SAW tiba di Madinah, baginda berpuasa pada hari itu dan memerintahkan untuk berpuasa padanya. Kemudian, apabila difardhukan Ramadan, maka Ramadanlah yang menjadi fardhu, dan ditinggalkan (puasa) hari Asyura. Barangsiapa yang mahu, dia boleh berpuasa, dan barangsiapa yang mahu, dia boleh meninggalkannya.\""
  },
  {
    "id": 38605,
    "hadith_number": 1068,
    "tajuk_hadith": "Hari Arafah dan Hari-Hari Tasyrik adalah Hari Raya Kita",
    "perawi_melayu": "Wahb bin Jarir, menceritakan kepada kami Musa bin 'Ali, daripada ayahnya, daripada Uqbah bin 'Amir",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا وَهْبُ بْنُ جَرِيرٍ  ، حَدَّثَنَا مُوسَى بْنُ عُلَيٍّ  ، عَنْ أَبِيهِ  ، عَنْ عُقْبَةَ بْنِ عَامِرٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" يَوْمُ عَرَفَةَ ، وَأَيَّامُ التَّشْرِيقِ عِيدُنَا أَهْلَ الْإِسْلَامِ، وَهِيَ أَيَّامُ أَكْلٍ وَشُرْبٍ \"",
    "malay_translation": "Wahb bin Jarir memberitahu kami, Musa bin 'Ali menceritakan kepada kami, daripada ayahnya, daripada Uqbah bin 'Amir, dia berkata: Rasulullah SAW bersabda: \"Hari Arafah dan hari-hari Tasyrik adalah hari raya kita, wahai Ahli Islam, dan ia adalah hari-hari makan dan minum.\""
  },
  {
    "id": 38606,
    "hadith_number": 1069,
    "tajuk_hadith": "Tidak Berpuasa pada Hari Arafah Ketika Menunaikan Haji",
    "perawi_melayu": "Diriwayatkan daripada Ibn Umar RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْمُعَلَّى بْنُ أَسَدٍ  ، حَدَّثَنَا إِسْمَاعِيل ابْنُ عُلَيَّةَ  ، حَدَّثَنَا ابْنُ أَبِي نَجِيحٍ  ، عَنْ أَبِيهِ  ، قَالَ : سُئِلَ ابْنُ عُمَرَ   عَنْ صَوْمِ يَوْمِ عَرَفَةَ ، فَقَالَ :\" حَجَجْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَصُمْهُ، وَحَجَجْتُ مَعَ أَبِي بَكْرٍ فَلَمْ يَصُمْهُ، وَحَجَجْتُ مَعَ عُمَرَ، فَلَمْ يَصُمْهُ، وَحَجَجْتُ مَعَ عُثْمَانَ، فَلَمْ يَصُمْهُ، وَأَنَا لَا أَصُومُهُ، وَلَا آمُرُ بِهِ، وَلَا أَنْهَى عَنْهُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Mu'alla bin Asad, telah menceritakan kepada kami Ismail bin 'Ulayyah, telah menceritakan kepada kami Ibn Abi Najih, daripada ayahnya, beliau berkata: Ibn Umar RA ditanya tentang puasa pada hari Arafah, lalu beliau berkata: \"Aku telah menunaikan haji bersama Nabi SAW dan Baginda tidak berpuasa padanya. Aku telah menunaikan haji bersama Abu Bakar dan beliau tidak berpuasa padanya. Aku telah menunaikan haji bersama Umar dan beliau tidak berpuasa padanya. Aku telah menunaikan haji bersama Uthman dan beliau tidak berpuasa padanya. Dan aku tidak berpuasa padanya, aku tidak menyuruhnya, dan aku tidak melarangnya.\""
  },
  {
    "id": 38607,
    "hadith_number": 1070,
    "tajuk_hadith": "Larangan Masuk Syurga Kecuali Bagi Orang Beriman dan Keutamaan Hari-Hari Tasyrik",
    "perawi_melayu": "Diriwayatkan daripada Abu Nu'man, daripada Hammad bin Zaid, daripada Amru bin Dinar, daripada Nafi' bin Jubair, daripada Bisyar bin Suhaim",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، عَنْ عَمْرِو بْنِ دِينَارٍ  ، عَنْ نَافِعِ بْنِ جُبَيْرٍ  ، عَنْ بِشْرِ بْنِ سُحَيْمٍ  ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُ أَوْ أَمَرَ رَجُلًا يُنَادِي أَيَّامَ التَّشْرِيقِ : \" أَنَّهُلَا يَدْخُلُ الْجَنَّةَ إِلَّا مُؤْمِنٌ، وَهِيَ أَيَّامُ أَكْلٍ وَشُرْبٍ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'man, telah menceritakan kepada kami Hammad bin Zaid, daripada Amru bin Dinar, daripada Nafi' bin Jubair, daripada Bisyar bin Suhaim, bahawa Rasulullah SAW memerintahkannya atau memerintahkan seorang lelaki untuk menyeru pada hari-hari Tasyrik: \"Bahawa tidak akan masuk syurga kecuali orang yang beriman, dan hari-hari tersebut adalah hari-hari makan dan minum.\""
  },
  {
    "id": 38608,
    "hadith_number": 1071,
    "tajuk_hadith": "Larangan Berpuasa pada Hari Tasyrik",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، حَدَّثَنِي اللَّيْثُ  ، حَدَّثَنِي يَزِيدُ بْنُ عَبْدِ اللَّهِ  ، عَنْ أَبِي مُرَّةَ  مَوْلَى عَقِيلٍ، أَنَّهُ : دَخَلَ هُوَ وَعَبْدُ اللَّهِ بْنُ عَمْرٍو عَلَى عَمْرِو بْنِ الْعَاصِ، وَذَلِكَ الْغَدَ أَوْ بَعْدَ الْغَدِ مِنْ يَوْمِ الْأَضْحَى، فَقَرَّبَ إِلَيْهِمْ عَمْرٌو طَعَامًا، فَقَالَ عَبْدُ اللَّهِ : إِنِّي صَائِمٌ.\n فَقَالَ عَمْرٌو   : \" أَفْطِرْ، فَإِنَّهَذِهِ الْأَيَّامَ الَّتِي كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُنَا بِفِطْرِهَا وَيَنْهَانَا عَنْ صِيَامِهَا.\nفَأَفْطَرَ عَبْدُ اللَّهِ، فَأَكَلَ وَأَكَلْتُ مَعَهُ \"",
    "malay_translation": "Abdullah bin Salih mengkhabarkan kepada kami, dia berkata: Al-Laith meriwayatkan kepada saya, dia berkata: Yazid bin Abdullah meriwayatkan kepada saya, daripada Abu Murrah, maula Aqil, bahawa: Dia dan Abdullah bin Amru masuk menemui Amru bin al-As, dan itu adalah pada hari esok atau lusa dari Hari Raya Aidiladha. Lalu Amru menghidangkan makanan kepada mereka, maka Abdullah berkata: Sesungguhnya aku berpuasa.\n\nMaka Amru berkata: \"Berbukalah, kerana hari-hari ini adalah hari-hari yang Rasulullah SAW memerintahkan kami untuk berbuka dan melarang kami daripada berpuasa padanya.\"\n\nMaka Abdullah berbuka, lalu dia makan dan aku pun makan bersamanya."
  },
  {
    "id": 38609,
    "hadith_number": 1072,
    "tajuk_hadith": "Menunaikan Nazar Puasa yang Belum Ditunaikan oleh Si Mati",
    "perawi_melayu": "Sahal bin Hammad, daripada Syu'bah, daripada Abi Bisyr, daripada Sa'id bin Jubair, daripada Ibn 'Abbas",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَهْلُ بْنُ حَمَّادٍ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ أَبِي بِشْرٍ  ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، أَنَّ امْرَأَةً نَذَرَتْ أَنْ تَصُومَ، فَمَاتَتْ، فَجَاءَ أَخُوهَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ عَنْ ذَلِكَ، فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" لَوْ كَانَ عَلَيْهَا دَيْنٌ أَكُنْتَ قَاضِيَهُ؟ \" قَالَ : نَعَمْ.\n قَالَ :\" فَاقْضُوا اللَّهَ، فَاللَّهُ أَحَقُّ بِالْوَفَاءِ \".\nقَالَ : فَصَامَ عَنْهَا",
    "malay_translation": "Telah menceritakan kepada kami Sahal bin Hammad, telah menceritakan kepada kami Syu'bah, daripada Abi Bisyr, daripada Sa'id bin Jubair, daripada Ibn 'Abbas, bahawa seorang wanita telah bernazar untuk berpuasa, lalu dia meninggal dunia. Kemudian saudaranya datang kepada Rasulullah SAW dan bertanya kepada Baginda tentang hal itu. Rasulullah SAW bersabda kepadanya: \"Jika dia mempunyai hutang, adakah kamu akan membayarnya?\" Dia menjawab: \"Ya.\" Baginda bersabda: \"Maka tunaikanlah (hak) Allah, kerana Allah lebih berhak untuk dipenuhi (janji-Nya).\" Dia (Ibn 'Abbas) berkata: Maka dia (saudaranya) berpuasa untuknya."
  },
  {
    "id": 38610,
    "hadith_number": 1073,
    "tajuk_hadith": "Keutamaan Bau Mulut Orang Berpuasa dan Kegembiraannya",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA, bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا مُحَمَّدُ بْنُ عَمْرٍو  ، عَنْ أَبِي سَلَمَةَ  ،  عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَخُلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ، وَلِلصَّائِمِ فَرْحَتَانِ : فَرْحَةٌ عِنْدَ فِطْرِهِ، وَفَرْحَةٌ يَوْمَ الْقِيَامَةِ \"",
    "malay_translation": "\"Sesungguhnya bau mulut orang yang berpuasa lebih harum di sisi Allah daripada bau kasturi. Dan bagi orang yang berpuasa ada dua kegembiraan: kegembiraan ketika berbuka puasa, dan kegembiraan pada hari kiamat.\""
  },
  {
    "id": 38611,
    "hadith_number": 1074,
    "tajuk_hadith": "Keutamaan Puasa: Ganjaran yang Tidak Terhingga",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ  ، أَخْبَرَنَا مُحَمَّدُ بْنُ عَمْرٍو  ، عَنْ أَبِي سَلَمَةَ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" يَقُولُ اللَّهُ تَعَالَى :كُلُّ عَمَلِ ابْنِ آدَمَ لَهُ : فَالْحَسَنَةُ بِعَشْرِ أَمْثَالِهَا إِلَى سَبْعِ مِئَةِ ضِعْفٍ، إِلَّا الصِّيَامَ هُوَ لِي وَأَنَا أَجْزِي بِهِ، إِنَّهُ يَتْرُكُ الطَّعَامَ وَشَهْوَتَهُ مِنْ أَجْلِي، وَيَتْرُكُ الشَّرَابَ وَشَهْوَتَهُ مِنْ أَجْلِي، فَهُوَ لِي وَأَنَا أَجْزِي بِهِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid, telah mengkhabarkan kepada kami Muhammad bin 'Amru, daripada Abu Salamah, daripada Abu Hurairah R.A., beliau berkata: Rasulullah SAW bersabda: \"Allah Ta'ala berfirman: Setiap amalan anak Adam adalah untuknya, maka satu kebaikan dibalas dengan sepuluh kali ganda sehingga tujuh ratus kali ganda, kecuali puasa. Puasa itu adalah untuk-Ku dan Aku sendiri yang akan membalasnya. Sesungguhnya dia meninggalkan makanan dan syahwatnya kerana Aku, dan dia meninggalkan minuman dan syahwatnya kerana Aku, maka ia adalah untuk-Ku dan Aku sendiri yang akan membalasnya.\""
  },
  {
    "id": 38612,
    "hadith_number": 1075,
    "tajuk_hadith": "Puasa adalah Perisai",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA, Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا الْأَعْمَشُ  ، عَنْ أَبِي صَالِحٍ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" الصَّوْمُ جُنَّةٌ \"",
    "malay_translation": "Abu Nu'aim telah mengkhabarkan kepada kami, Al-A'mash telah menceritakan kepada kami, daripada Abu Soleh, daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: \"Puasa adalah perisai.\""
  },
  {
    "id": 38613,
    "hadith_number": 1076,
    "tajuk_hadith": "Doa Nabi SAW Ketika Berbuka Puasa di Rumah Seseorang",
    "perawi_melayu": "Yazid bin Harun, Hisham Ad-Dastawa'i, Yahya bin Abi Kathir, Anas bin Malik",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا هِشَامٌ الدَّسْتَوَائِيُّ  ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ  ، عَنْ أَنَسِ بْنِ مَالِكٍ  ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَفْطَرَ عِنْدَ أُنَاسٍ، قَالَ :\" أَفْطَرَ عِنْدَكُمْ الصَّائِمُونَ، وَأَكَلَ طَعَامَكُمْ الْأَبْرَارُ، وَتَنَزَّلَتْ عَلَيْكُمْ الْمَلَائِكَةُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah mengkhabarkan kepada kami Hisham Ad-Dastawa'i, daripada Yahya bin Abi Kathir, daripada Anas bin Malik, bahawa Nabi SAW apabila berbuka puasa di rumah orang, baginda bersabda: \"Orang-orang yang berpuasa telah berbuka di rumah kamu, dan orang-orang yang baik telah memakan makanan kamu, dan para malaikat telah turun ke atas kamu.\""
  },
  {
    "id": 38614,
    "hadith_number": 1077,
    "tajuk_hadith": "Keutamaan Amalan di Sepuluh Hari Pertama Zulhijjah",
    "perawi_melayu": "Diriwayatkan daripada Ibn Abbas RA, daripada Nabi SAW",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ الرَّبِيعِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ سُلَيْمَانَ  ، قَالَ : سَمِعْتُ مُسْلِمًا الْبَطِينَ  ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ  ، عَنْ ابْنِ عَبَّاسٍ   رَضِيَ اللهِ عَنْهُمَا، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَا الْعَمَلُ، فِي أَيَّامٍ أَفْضَلَ مِنْ الْعَمَلِ فِي عَشْرِ ذِي الْحِجَّةِ \".\nقِيلَ : وَلَا الْجِهَادُ فِي سَبِيلِ اللَّهِ؟ قَالَ : \" وَلَا الْجِهَادُ فِي سَبِيلِ اللَّهِ، إِلَّا رَجُلٌ خَرَجَ بِنَفْسِهِ وَمَالِهِ ثُمَّ لَمْ يَرْجِعْ بِشَيْءٍ \"",
    "malay_translation": "Diriwayatkan daripada Ibn Abbas RA, daripada Nabi SAW, baginda bersabda: \"Tidak ada amalan yang lebih utama daripada amalan di sepuluh hari pertama Zulhijjah.\" Baginda ditanya: \"Walaupun jihad di jalan Allah?\" Baginda menjawab: \"Walaupun jihad di jalan Allah, kecuali seorang lelaki yang keluar dengan jiwa dan hartanya kemudian tidak kembali dengan apa-apa pun.\""
  },
  {
    "id": 38615,
    "hadith_number": 1078,
    "tajuk_hadith": "Keutamaan Amalan di Sepuluh Hari Pertama Zulhijjah",
    "perawi_melayu": "Ibnu Abbas RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا أَصْبَغُ  ، عَنْ الْقَاسِمِ بْنِ أَبِي أَيُّوبَ  ، عَنْ سَعِيدٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَا مِنْ عَمَلٍ أَزْكَى عِنْدَ اللَّهِ G وَلَا أَعْظَمَ أَجْرًا، مِنْ خَيْرٍ يَعْمَلُهُ فِي عَشْرِ الْأَضْحَى \".\nقِيلَ : وَلَا الْجِهَادُ فِي سَبِيلِ اللَّهِ؟ قَالَ : \" وَلَا الْجِهَادُ فِي سَبِيلِ اللَّهِ G إِلَّا رَجُلٌ خَرَجَ بِنَفْسِهِ وَمَالِهِ فَلَمْ يَرْجِعْ مِنْ ذَلِكَ بِشَيْءٍ \".\n قَالَ : وَكَانَ سَعِيدُ بْنُ جُبَيْرٍ إِذَا دَخَلَ أَيَّامُ الْعَشْرِ، اجْتَهَدَ اجْتِهَادًا شَدِيدًا حَتَّى مَا يَكَادُ يَقْدِرُ عَلَيْهِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah mengkhabarkan kepada kami Asbagh, daripada al-Qasim bin Abi Ayyub, daripada Sa'id, daripada Ibnu Abbas RA, daripada Nabi SAW, baginda bersabda: \"Tidak ada amalan yang lebih suci di sisi Allah dan tidak ada yang lebih besar pahalanya, daripada kebaikan yang dikerjakan pada sepuluh hari al-Adha (Zulhijjah).\" Ditanyakan: \"Walaupun jihad di jalan Allah?\" Baginda bersabda: \"Walaupun jihad di jalan Allah, kecuali seorang lelaki yang keluar dengan jiwa dan hartanya dan tidak kembali daripada itu dengan apa-apa pun.\" Sa'id bin Jubair berkata: \"Dan adalah Sa'id bin Jubair apabila masuk hari-hari sepuluh (Zulhijjah), beliau bersungguh-sungguh dengan kesungguhan yang amat sangat sehingga hampir-hampir beliau tidak mampu melakukannya.\""
  },
  {
    "id": 38616,
    "hadith_number": 1079,
    "tajuk_hadith": "Keutamaan Bulan Ramadan: Pintu Syurga Dibuka, Pintu Neraka Ditutup, dan Syaitan Dibelenggu",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah R.A.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ  ، حَدَّثَنَا إِسْمَاعِيل بْنُ جَعْفَرٍ  ، حَدَّثَنَا أَبُو سُهَيْلٍ  ، عَنْ أَبِيهِ  ، عَنْ أَبِي هُرَيْرَةَ  ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :\" إِذَا جَاءَ رَمَضَانُ، فُتِحَتْ أَبْوَابُ السَّمَاءِ، وَغُلِّقَتْ أَبْوَابُ النَّارِ، وَصُفِّدَتْ الشَّيَاطِينُ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Ar-Rabi' Az-Zahrani, telah menceritakan kepada kami Ismail bin Ja'far, telah menceritakan kepada kami Abu Suhail, dari ayahnya, dari Abu Hurairah RA, bahawa Rasulullah SAW bersabda: \"Apabila tiba bulan Ramadan, pintu-pintu syurga dibuka, pintu-pintu neraka ditutup, dan syaitan-syaitan dibelenggu.\""
  },
  {
    "id": 38617,
    "hadith_number": 1080,
    "tajuk_hadith": "Keutamaan Qiyam Ramadan dan Lailatulqadar",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA bahawa Nabi SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ  ، حَدَّثَنَا هِشَامٌ  ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ  ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ  ، عَنْ أَبِي هُرَيْرَةَ  ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :\" مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا ، غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ، وَمَنْ قَامَ لَيْلَةَ الْقَدْرِ، غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \"",
    "malay_translation": "\"Sesiapa yang mendirikan (solat) malam Ramadan dengan penuh keimanan dan mengharapkan ganjaran (daripada Allah), akan diampunkan baginya dosa-dosanya yang telah lalu. Dan sesiapa yang mendirikan (solat) pada malam Lailatulqadar, akan diampunkan baginya dosa-dosanya yang telah lalu.\""
  },
  {
    "id": 38618,
    "hadith_number": 1081,
    "tajuk_hadith": "Rasulullah SAW Melaksanakan Solat Tarawih pada Bulan Ramadan dan Keutamaannya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ  ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ  ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ  ، عَنْ الْوَلِيدِ بْنِ عَبْدِ الرَّحْمَنِ  ، عَنْ جُبَيْرِ بْنِ نُفَيْرٍ  ، عَنْ أَبِي ذَرٍّ  ، قَالَ : صُمْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَهْرَ رَمَضَانَ، قَالَ : فَلَمْ يَقُمْ بِنَا مِنْ الشَّهْرِ شَيْئًا حَتَّى بَقِيَ سَبْعٌ.\nقَالَ : فَقَامَ بِنَا حَتَّى ذَهَبَ ثُلُثُ اللَّيْلِ.\nقَالَ : فَلَمَّا كَانَتْ السَّادِسَةُ، لَمْ يَقُمْ بِنَا، فَلَمَّا كَانَتْ الْخَامِسَةُ، قَامَ بِنَا حَتَّى ذَهَبَ شَطْرُ اللَّيْلِ الْآخِرُ، قُلْنَا : يَا رَسُولَ اللَّهِ، لَوْ نَفَّلْتَنَا بَقِيَّةَ هَذِهِ اللَّيْلَةِ، فَقَالَ : \" إِنَّالرَّجُلَ إِذَا قَامَ مَعَ الْإِمَامِ حَتَّى يَنْصَرِفَ مِنْ صَلَاتِهِ، حُسِبَ لَهُ قِيَامُ لَيْلَتِهِ \"، فَلَمَّا كَانَتْ الرَّابِعَةُ لَمْ يَقُمْ بِنَا، فَلَمَّا كَانَتْ الثَّالِثَةُ، جَمَعَ أَهْلَهُ وَنِسَاءَهُ، وَالنَّاسَ فَقَامَ بِنَا حَتَّى خَشِينَا أَنْ يَفُوتَنَا الْفَلَاحُ.\nقُلْنَا : وَمَا الْفَلَاحُ؟ قَالَ : السُّحُورُ، قَالَ : ثُمَّ لَمْ يَقُمْ بِنَا بَقِيَّةَ الشَّهْرِ.\nحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، عَنْ سُفْيَانَ  ، عَنْ دَاوُدَ  ، عَنْ الْوَلِيدِ بْنِ عَبْدِ الرَّحْمَنِ الْجُرَشِيِّ  ، عَنْ جُبَيْرِ بْنِ نُفَيْرٍ الْحَضْرَمِيِّ  ، عَنْ أَبِي ذَرٍّ  ، نَحْوَهُ",
    "malay_translation": "Telah menceritakan kepada kami Zakaria bin Adiy, telah menceritakan kepada kami Yazid bin Zurai', daripada Daud bin Abi Hind, daripada al-Walid bin Abdurrahman, daripada Jubair bin Nufair, daripada Abu Dzar RA, beliau berkata: Kami berpuasa bersama Rasulullah SAW pada bulan Ramadan. Beliau (Abu Dzar) berkata: Baginda tidak solat tarawih bersama kami pada bulan itu sehingga berbaki tujuh hari.\nBeliau berkata: Baginda solat tarawih bersama kami sehingga berlalu satu pertiga malam.\nBeliau berkata: Apabila tiba malam yang keenam, Baginda tidak solat tarawih bersama kami. Apabila tiba malam yang kelima, Baginda solat tarawih bersama kami sehingga berlalu separuh malam yang terakhir. Kami berkata: Wahai Rasulullah, alangkah baiknya jika Tuan menambah lagi (solat) pada malam ini. Baginda bersabda: \"Sesungguhnya seseorang itu apabila solat bersama imam sehingga selesai solatnya, maka akan dicatat baginya pahala solat sepanjang malam.\" Apabila tiba malam yang keempat, Baginda tidak solat tarawih bersama kami. Apabila tiba malam yang ketiga, Baginda mengumpulkan ahli keluarga, isteri-isteri Baginda dan orang ramai, lalu Baginda solat tarawih bersama kami sehingga kami khuatir terlepas al-Falah.\nKami bertanya: Apakah al-Falah itu? Baginda menjawab: Sahur. Beliau berkata: Kemudian Baginda tidak solat tarawih bersama kami sepanjang baki bulan itu.\nTelah menceritakan kepada kami Ubaidullah bin Musa, daripada Sufyan, daripada Daud, daripada al-Walid bin Abdurrahman al-Jurasyi, daripada Jubair bin Nufair al-Hadhrami, daripada Abu Dzar, sepertinya."
  },
  {
    "id": 38619,
    "hadith_number": 1082,
    "tajuk_hadith": "Rasulullah S.A.W. Beriktikaf Lebih Lama Sebelum Wafat",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah R.A.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَاصِمُ بْنُ يُوسُفَ  ، حَدَّثَنَا أَبُو بَكْرِ بْنِ عَيَّاشٍ  ، عَنْ أَبِي حَصِينٍ  ، عَنْ أَبِي صَالِحٍ  ،  عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : \" كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَيَعْتَكِفُ الْعَشْرَ الْأَوَاخِرَ، فَلَمَّا كَانَ الْعَامُ الَّذِي قُبِضَ فِيهِ، اعْتَكَفَ عِشْرِينَ يَوْمًا \"",
    "malay_translation": "Telah menceritakan kepada kami 'Asim bin Yusuf, telah menceritakan kepada kami Abu Bakar bin 'Ayyash, daripada Abu Hashin, daripada Abu Salih, daripada Abu Hurairah R.A., beliau berkata: \"Rasulullah S.A.W. biasa beriktikaf pada sepuluh hari terakhir (Ramadhan). Maka ketika tahun di mana baginda wafat, baginda beriktikaf selama dua puluh hari.\""
  },
  {
    "id": 38620,
    "hadith_number": 1083,
    "tajuk_hadith": "Ziarah Isteri kepada Nabi SAW semasa Iktikaf di Masjid",
    "perawi_melayu": "Abu al-Yaman, daripada Syuaib bin Abi Hamzah, daripada al-Zuhri, daripada Ali bin Husain, daripada Safiyyah binti Huyai",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ  ، أَخْبَرَنَا شُعَيْبُ بْنُ أَبِي حَمْزَةَ  ، عَنْ الزُّهْرِيِّ  ، أَخْبَرَنِي عَلِيُّ بْنُ حُسَيْنٍ  ، أَنَّ صَفِّيَةَ بِنْتَ حُيَيٍّ   أَخْبَرَتْهُ، أَنَّهَا جَاءَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَزُورُهُ فِي\" اعْتِكَافِهِ فِي الْمَسْجِدِ، فِي الْعَشْرِ الْأَوَاخِرِ مِنْ رَمَضَانَ، فَتَحَدَّثَتْ عِنْدَهُ سَاعَةً ثُمَّ قَامَتْ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu al-Yaman, telah mengkhabarkan kepada kami Syuaib bin Abi Hamzah, daripada al-Zuhri, telah mengkhabarkan kepadaku Ali bin Husain, bahawa Safiyyah binti Huyai telah mengkhabarkannya, bahawa dia datang kepada Nabi SAW menziarahi baginda ketika baginda beriktikaf di masjid, pada sepuluh malam terakhir bulan Ramadan, lalu dia berbual-bual dengan baginda seketika kemudian dia bangun."
  },
  {
    "id": 38621,
    "hadith_number": 1084,
    "tajuk_hadith": "Pencarian Lailatul Qadar pada Sepuluh Malam Terakhir Ramadan",
    "perawi_melayu": "Diriwayatkan daripada Ubadah bin as-Samit",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، حَدَّثَنَا حُمَيْدٌ  ، عَنْ أَنَسٍ  ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ  ، قَالَ : خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُرِيدُ أَنْ يُخْبِرَنَا بِلَيْلَةِ الْقَدْرِ، فَتَلَاحَى رَجُلَانِ مِنْ الْمُسْلِمِينَ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" إِنِّي خَرَجْتُ إِلَيْكُمْ، وَأَنَا أُرِيدُ أَنْ أُخْبِرَكُمْ بِلَيْلَةِ الْقَدْرِ، وَكَانَ بَيْنَ فُلَانٍ وَفُلَانٍ لِحَاءٌ فَرُفِعَتْ، وَعَسَى أَنْ يَكُونَ خَيْرًا،فَالْتَمِسُوهَا فِي الْعَشْرِ الْأَوَاخِرِ : فِي الْخَامِسَةِ، وَالسَّابِعَةِ، وَالتَّاسِعَةِ \"",
    "malay_translation": "Yazid bin Harun telah mengkhabarkan kepada kami, Hamid telah meriwayatkan kepada kami, daripada Anas, daripada Ubadah bin as-Samit, dia berkata: Rasulullah SAW keluar kepada kami dan baginda ingin memberitahu kami tentang Lailatul Qadar. Kemudian, dua orang lelaki Muslim bertengkar, lalu Rasulullah SAW bersabda: \"Sesungguhnya aku keluar kepada kamu dan aku ingin memberitahu kamu tentang Lailatul Qadar, tetapi ada pertengkaran antara si fulan dan si fulan, maka (pengetahuan tentangnya) diangkat. Semoga itu menjadi kebaikan. Maka carilah ia pada sepuluh malam terakhir: pada malam yang kelima, ketujuh, dan kesembilan.\""
  },
  {
    "id": 38622,
    "hadith_number": 1085,
    "tajuk_hadith": "Mencari Lailatul Qadar pada Sepuluh Malam Terakhir Ramadan",
    "perawi_melayu": "Abdullah bin Soleh, daripada Al-Laith, daripada Yunus, daripada Ibnu Syihab, dan Abu Salamah, daripada Abu Hurairah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، حَدَّثَنِي اللَّيْثُ  ، حَدَّثَنِي يُونُسُ  ، عَنْ ابْنِ شِهَابٍ  ، قَالَ : وَقَالَ أَبُو سَلَمَةَ  ،  عَنْ أَبِي هُرَيْرَةَ  ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ : \" أُرِيتُ لَيْلَةَ الْقَدْرِ ثُمَّ أَيْقَظَنِي بَعْضُ أَهْلِي فَنَسِيتُهَا،فَالْتَمِسُوهَا فِي الْعَشْرِ الْغَوَابِرِ \"",
    "malay_translation": "Abdullah bin Soleh memberitahu kami, Al-Laith menceritakan kepada saya, Yunus menceritakan kepada saya, daripada Ibnu Syihab, dia berkata: Abu Salamah berkata, daripada Abu Hurairah, bahawa Rasulullah SAW bersabda: \"Saya diperlihatkan Lailatul Qadar, kemudian sebahagian ahli keluarga saya mengejutkan saya, lalu saya melupakannya. Maka, carilah ia pada sepuluh malam terakhir (Ramadan).\""
  },
  {
    "id": 38623,
    "hadith_number": 1086,
    "tajuk_hadith": "Mencari Lailatulqadar pada Tujuh Malam Terakhir Ramadan",
    "perawi_melayu": "Diriwayatkan oleh Abdullah bin Soleh, daripada Al-Laith, daripada Uqail, daripada Ibnu Shihab, katanya: Telah mengkhabarkan kepadaku Salim bin Abdullah, bahawa Abdullah bin Umar berkata: Sesungguhnya Rasulullah SAW bersabda: 'Carilah Lailatulqadar pada tujuh malam yang terakhir (Ramadan).'",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، حَدَّثَنِي اللَّيْثُ  ، حَدَّثَنِي عُقَيْلٌ  ، عَنْ ابْنِ شِهَابٍ  ، قَالَ : أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ  ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ  ، قَالَ : إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :\" الْتَمِسُوا لَيْلَةَ الْقَدْرِ فِي السَّبْعِ الْأَوَاخِرِ \"",
    "malay_translation": "Abdullah bin Soleh mengkhabarkan kepada kami, katanya: Al-Laith meriwayatkan kepadaku, katanya: Uqail meriwayatkan kepadaku, daripada Ibnu Shihab, katanya: Salim bin Abdullah mengkhabarkan kepadaku, bahawa Abdullah bin Umar berkata: Sesungguhnya Rasulullah SAW bersabda: 'Carilah Lailatulqadar pada tujuh malam yang terakhir (Ramadan).'"
  }
]
