[
  {
    "id": 38777,
    "hadith_number": 1240,
    "tajuk_hadith": "Rasulullah SAW Menyembelih Dua Ekor Kibas Putih Bertanduk",
    "perawi_melayu": "Diriwayatkan daripada Anas RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ  ، عَنْ شُعْبَةَ  ، عَنْ قَتَادَةَ  ، عَنْ أَنَسٍ  ، قَالَ :\" ضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ، وَيُسَمِّي وَيُكَبِّرُ، لَقَدْ رَأَيْتُهُ يَذْبَحُهُمَا بِيَدِهِ وَاضِعًا عَلَى صِفَاحِهِمَا قَدَمَهُ \"، قُلْتُ : أَنْتَ سَمِعْتَهُ؟ قَالَ : نَعَمْ",
    "malay_translation": "Sa'id bin 'Amir telah mengkhabarkan kepada kami, daripada Syu'bah, daripada Qatadah, daripada Anas, dia berkata: \"Rasulullah SAW telah menyembelih dua ekor kibas putih yang bertanduk, dan Baginda menyebut nama Allah dan bertakbir. Sesungguhnya aku telah melihat Baginda menyembelih kedua-duanya dengan tangannya sambil meletakkan kakinya di sisi kedua-duanya.\" Aku bertanya: \"Adakah engkau mendengarnya sendiri?\" Dia menjawab: \"Ya.\""
  },
  {
    "id": 38778,
    "hadith_number": 1241,
    "tajuk_hadith": "Rasulullah SAW Berkorban dengan Dua Ekor Kibas pada Hari Raya",
    "perawi_melayu": "Ahmad bin Khalid, Muhammad bin Ishaq, Yazid bin Abi Habib, Abu Ayyash, Jabir bin Abdullah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ خَالِدٍ  ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاق  ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ  ، عَنْ أَبِي عَيَّاشٍ  ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ  ، قَالَ : ضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَبْشَيْنِ فِي يَوْمِ الْعِيدِ، فَقَالَ حِينَ وَجَّهَهُمَا : \" إِنِّيوَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَوَاتِ وَالْأَرْضَ حَنِيفًا وَمَا أَنَا مِنْ الْمُشْرِكِينَ.\nإِنَّ صَلَاتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ، لَا شَرِيكَ لَهُ، وَبِذَلِكَ أُمِرْتُ وَأَنَا أَوَّلُ الْمُسْلِمِينَ.\n اللَّهُمَّ إِنَّ هَذَا مِنْكَ وَلَكَ، عَنْ مُحَمَّدٍ وَأُمَّتِهِ \"، ثُمَّ سَمَّى اللَّهَ وَكَبَّرَ وَذَبَحَ",
    "malay_translation": "Telah mengkhabarkan kepada kami Ahmad bin Khalid, telah menceritakan kepada kami Muhammad bin Ishaq, daripada Yazid bin Abi Habib, daripada Abu Ayyash, daripada Jabir bin Abdullah, beliau berkata: Rasulullah SAW telah berkorban dengan dua ekor kibas pada hari raya. Ketika baginda menghadapkan kedua-duanya (kibas tersebut), baginda bersabda: \"Sesungguhnya aku menghadapkan diriku kepada Tuhan yang menciptakan langit dan bumi dengan cenderung kepada agama yang benar, dan aku bukanlah dari golongan orang-orang musyrik.\nSesungguhnya solatku, ibadahku, hidupku dan matiku adalah untuk Allah, Tuhan semesta alam, tiada sekutu bagi-Nya; dan dengan itu aku diperintahkan dan aku adalah orang yang pertama dari kalangan Muslimin.\nYa Allah, sesungguhnya ini adalah daripada Engkau dan untuk Engkau, daripada Muhammad dan umatnya.\" Kemudian baginda menyebut nama Allah, bertakbir dan menyembelih."
  },
  {
    "id": 38779,
    "hadith_number": 1242,
    "tajuk_hadith": "Larangan Memotong Kuku dan Rambut Bagi yang Ingin Berkorban di Awal Zulhijjah",
    "perawi_melayu": "Abdullah bin Soleh, daripada Al-Laith, daripada Khalid (iaitu Ibnu Yazid), daripada Said (iaitu Ibnu Abi Hilal), daripada Amru bin Muslim, daripada Ibnu al-Musayyab, bahawa Ummu Salamah memberitahunya, daripada Rasulullah SAW",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، حَدَّثَنِي اللَّيْثُ  ، حَدَّثَنِي خَالِدٌ يَعْنِي : ابْنَ يَزِيدَ  ، حَدَّثَنِي سَعِيدٌ يَعْنِي : ابْنَ أَبِي هِلَالٍ  ، عَنْ عَمْرِو بْنِ مُسْلِمٍ  ، أَخْبَرَنِي ابْنُ الْمُسَيَّبِ  ، أَنَّ أُمَّ سَلَمَةَ   أَخْبَرَتْهُ، عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ، قَالَ :\" مَنْ أَرَادَ أَنْ يُضَحِّيَ، فَلَا يُقَلِّمْ أَظْفَارَهُ، وَلَا يَحْلِقْ شَيْئًا مِنْ شَعْرِهِ فِي الْعَشْرِ الْأُوَلِ مِنْ ذِي الْحِجَّةِ \"",
    "malay_translation": "Abdullah bin Soleh telah mengkhabarkan kepada kami, telah menceritakan kepadaku Al-Laith, telah menceritakan kepadaku Khalid (iaitu Ibnu Yazid), telah menceritakan kepadaku Said (iaitu Ibnu Abi Hilal), daripada Amru bin Muslim, telah mengkhabarkan kepadaku Ibnu al-Musayyab, bahawa Ummu Salamah RA memberitahunya, daripada Rasulullah SAW bahawa baginda bersabda: “Sesiapa yang ingin berkorban, maka janganlah dia memotong kukunya, dan janganlah dia mencukur sesuatu pun daripada rambutnya pada sepuluh hari pertama bulan Zulhijjah.”"
  },
  {
    "id": 38780,
    "hadith_number": 1243,
    "tajuk_hadith": "Larangan Memotong Rambut dan Kuku Bagi yang Ingin Berkorban di Bulan Zulhijjah",
    "perawi_melayu": "Muhammad bin Ahmad, Sufyan, Abdul Rahman bin Humaid, daripada Said bin al-Musayyib, daripada Ummu Salamah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ  ، حَدَّثَنَا سُفْيَانُ  ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ حُمَيْدٍ  ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ  ،  عَنْ أُمِّ سَلَمَةَ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" إِذَا دَخَلَتْ الْعَشْرُ، وَأَرَادَ أَحَدُكُمْ أَنْ يُضَحِّيَ، فَلَا يَمَسَّ مِنْ شَعْرِهِ وَلَا أَظْفَارِهِ شَيْئًا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Ahmad, telah menceritakan kepada kami Sufyan, telah menceritakan kepadaku Abdul Rahman bin Humaid, daripada Said bin al-Musayyib, daripada Ummu Salamah, daripada Nabi SAW, baginda bersabda: \"Apabila telah masuk sepuluh (hari pertama Zulhijjah), dan salah seorang daripada kamu ingin berkorban, maka janganlah dia menyentuh (memotong) rambutnya dan kuku-kukunya sedikit pun.\""
  },
  {
    "id": 38781,
    "hadith_number": 1244,
    "tajuk_hadith": "Cacat Cela yang Perlu Dihindari dalam Haiwan Korban",
    "perawi_melayu": "Diriwayatkan oleh Al-Bara' bin Azib",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ عَمْرِو بْنِ الْحَارِثِ  ، عَنْ عُبَيْدِ بْنِ فَيْرُوزَ  ، عَنْ الْبَرَاءِ بْنِ عَازِبٍ  ، قَالَ : سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا يُتَّقَى مِنْ الضَّحَايَا؟ قَالَ :\" الْعَوْرَاءُ الْبَيِّنُ عَوَرُهَا، وَالْعَرْجَاءُ الْبَيِّنُ ظَلْعُهَا، وَالْمَرِيضَةُ الْبَيِّنُ مَرَضُهَا، وَالْعَجْفَاءُ الَّتِي لَا تُنْقِي \"",
    "malay_translation": "Khalid bin Makhlad telah mengkhabarkan kepada kami, Malik telah meriwayatkan kepada kami, daripada 'Amru bin al-Harith, daripada 'Ubaid bin Fairuz, daripada al-Bara' bin 'Azib, beliau berkata: Rasulullah SAW ditanya: Apakah (cacat cela) yang perlu dihindari pada haiwan korban? Baginda bersabda: \"Haiwan yang buta sebelah mata dan jelas kebutaannya, haiwan yang tempang dan jelas ketempangannya, haiwan yang sakit dan jelas sakitnya, dan haiwan yang kurus kering yang tidak mempunyai sumsum tulang.\""
  },
  {
    "id": 38782,
    "hadith_number": 1245,
    "tajuk_hadith": "Larangan dalam Korban: Kecacatan yang Menjadikan Haiwan Tidak Sah",
    "perawi_melayu": "Diriwayatkan daripada Ubaid bin Fairuz, beliau berkata: Saya bertanya kepada Al-Bara' tentang larangan Rasulullah SAW mengenai haiwan korban, lalu beliau berkata: \"Empat perkara yang tidak memadai: Yang buta sebelah mata yang jelas kebutaannya, yang tempang yang jelas ketempangannya, yang sakit yang jelas sakitnya, dan yang kurus kering yang tidak bersumsum.\"",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ  ، عَنْ شُعْبَةَ  ، عَنْ سُلَيْمَانَ بْنِ عَبْدِ الرَّحْمَنِ  ، عَنْ عُبَيْدِ بْنِ فَيْرُوزَ  ، قَالَ : سَأَلْتُ الْبَرَاءَ   عَمَّا نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْأَضَاحِيِّ، فَقَالَ :\" أَرْبَعٌ لَا يُجْزِئْنَ : الْعَوْرَاءُ الْبَيِّنُ عَوَرُهَا، وَالْعَرْجَاءُ الْبَيِّنُ ظَلْعُهَا، وَالْمَرِيضَةُ الْبَيِّنُ مَرَضُهَا، وَالْكَسِيرُ الَّتِي لَا تُنْقِي \".\nقَالَ : قُلْتُ لِلْبَرَاءِ : فَإِنِّي أَكْرَهُ أَنْ يَكُونَ فِي السِّنِّ نَقْصٌ، وَفِي الْأُذُنِ نَقْصٌ، وَفِي الْقَرْنِ نَقْصٌ، قَالَ : فَمَا كَرِهْتَ فَدَعْهُ، وَلَا تُحَرِّمْهُ عَلَى أَحَدٍ",
    "malay_translation": "Telah menceritakan kepada kami Sa'id bin Amir, daripada Syu'bah, daripada Sulaiman bin Abdurrahman, daripada Ubaid bin Fairuz, beliau berkata: Saya bertanya kepada Al-Bara' tentang larangan Rasulullah SAW mengenai haiwan korban, lalu beliau berkata: \"Empat perkara yang tidak memadai (untuk dijadikan korban): Yang buta sebelah mata yang jelas kebutaannya, yang tempang yang jelas ketempangannya, yang sakit yang jelas sakitnya, dan yang kurus kering yang tidak bersumsum.\" Dia (Ubaid bin Fairuz) berkata: Saya berkata kepada Al-Bara': \"Sesungguhnya saya tidak suka jika ada kekurangan pada gigi, kekurangan pada telinga, dan kekurangan pada tanduk.\" Beliau (Al-Bara') berkata: \"Apa yang kamu tidak sukai, maka tinggalkanlah, dan jangan kamu mengharamkannya kepada seorang pun.\""
  },
  {
    "id": 38783,
    "hadith_number": 1246,
    "tajuk_hadith": "Hukum Berkaitan Kecacatan pada Haiwan Korban",
    "perawi_melayu": "Abu al-Walid meriwayatkan daripada Syu'bah, daripada Salamah bin Kuhail, yang berkata: Saya mendengar Hujayyah bin 'Adi berkata: Saya mendengar Ali R.A ketika seorang lelaki bertanya kepadanya: Wahai Amirul Mukminin, lembu? Beliau berkata: Untuk tujuh orang. Saya bertanya: Tanduk? Beliau berkata: Tidak memudaratkan kamu. Saya berkata: Kepincangan? Beliau berkata: Apabila sampai ke tempat penyembelihan. Kemudian beliau berkata: Rasulullah SAW memerintahkan kami untuk memeriksa mata dan telinga (haiwan korban).",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ  ، قَالَ : سَمِعْتُ حُجَيَّةَ بْنَ عَدِيٍّ  ، قَالَ : سَمِعْتُ عَلِيًّا   وَسَأَلَهُ رَجُلٌ، فَقَالَ : يَا أَمِيرَ الْمُؤْمِنِينَ، الْبَقَرَةُ؟ قَالَ : عَنْ سَبْعَةٍ، قُلْتُ : الْقَرْنُ؟ قَالَ : لَا يَضُرُّكَ.\nقَالَ : قُلْتُ : الْعَرَجُ؟ قَالَ : إِذَا بَلَغَتْ الْمَنْسَكَ.\nثُمَّ قَالَ : \" أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْنَسْتَشْرِفَ الْعَيْنَ وَالْأُذُنَ \"",
    "malay_translation": "Abu al-Walid telah meriwayatkan kepada kami, Syu'bah telah menceritakan kepada kami, daripada Salamah bin Kuhail, beliau berkata: Saya mendengar Hujayyah bin 'Adi, beliau berkata: Saya mendengar Ali R.A dan seorang lelaki bertanya kepadanya, beliau berkata: Wahai Amirul Mukminin, lembu? Beliau berkata: Untuk tujuh orang. Saya bertanya: Tanduk? Beliau berkata: Tidak memudaratkan kamu. Beliau berkata: Saya bertanya: Kepincangan? Beliau berkata: Apabila sampai ke tempat penyembelihan. Kemudian beliau berkata: \"Rasulullah SAW memerintahkan kami untuk memeriksa mata dan telinga (haiwan korban).\""
  },
  {
    "id": 38784,
    "hadith_number": 1247,
    "tajuk_hadith": "Arahan untuk Memeriksa Mata dan Telinga Haiwan Korban serta Larangan Mengorbankan Haiwan yang Cacat",
    "perawi_melayu": "Ubaidillah bin Musa, daripada Israil, daripada Abi Ishaq, daripada Syuraih bin an-Nu'man as-Sa'idi, daripada Ali RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، عَنْ إِسْرَائِيلَ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ شُرَيْحِ بْنِ النُّعْمَانِ الصَّائِدِيِّ  ، عَنْ عَلِيٍّ   رَضِيَ اللَّهُ عَنْهُ قَالَ : \" أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْنَسْتَشْرِفَ الْعَيْنَ وَالْأُذُنَ، وَأَنْ لَا نُضَحِّيَ بِمُقَابَلَةٍ وَلَا مُدَابَرَةٍ وَلَا خَرْقَاءَ، وَلَا شَرْقَاءَ، فَالْمُقَابَلَةُ : مَا قُطِعَ طَرَفُ أُذُنِهَا، وَالْمُدَابَرَةُ : مَا قُطِعَ مِنْ جَانِبِ الْأُذُنِ، وَالْخَرْقَاءُ : الْمَثْقُوبَةُ، وَالشَّرْقَاءُ : الْمَشْقُوقَةُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ubaidillah bin Musa, daripada Israil, daripada Abi Ishaq, daripada Syuraih bin an-Nu'man as-Sa'idi, daripada Ali RA, beliau berkata: \"Rasulullah SAW memerintahkan kami untuk memeriksa mata dan telinga (haiwan korban), dan supaya tidak mengorbankan haiwan yang *muqabalah*, *mudabarah*, *kharqa'*, dan *sharqa'*. *Muqabalah* adalah haiwan yang terpotong hujung telinganya, *mudabarah* adalah haiwan yang terpotong bahagian sisi telinganya, *kharqa'* adalah haiwan yang telinganya berlubang, dan *sharqa'* adalah haiwan yang telinganya terbelah.\""
  },
  {
    "id": 38785,
    "hadith_number": 1248,
    "tajuk_hadith": "Pengorbanan dengan Jaza'ah (Anak Kambing Berusia Muda)",
    "perawi_melayu": "Yazid bin Harun, Hisham, Yahya, Baj'ah al-Juhani, 'Uqbah bin 'Amir al-Juhani",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، حَدَّثَنَا هِشَامٌ  ، عَنْ يَحْيَى  ، عَنْ بَعْجَةَ الْجُهَنِيِّ  ، عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ  ، قَالَ : قَسَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَحَايَا بَيْنَ أَصْحَابِهِ فَأَصَابَنِي جَذَعٌ، فَقُلْتُ : يَا رَسُولَ اللَّهِ، إِنَّهَاصَارَتْ لِي جَذَعَةً، فَقَالَ : \" ضَحِّ بِهِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah menceritakan kepada kami Hisham, daripada Yahya, daripada Baj'ah al-Juhani, daripada 'Uqbah bin 'Amir al-Juhani, beliau berkata: Rasulullah SAW membahagikan binatang korban di antara para sahabatnya, lalu aku mendapat seekor *Jaza'*. Aku berkata: Wahai Rasulullah, sesungguhnya ia telah menjadi *Jaza'ah* bagiku. Baginda bersabda: \"Berkorbanlah dengannya.\""
  },
  {
    "id": 38786,
    "hadith_number": 1249,
    "tajuk_hadith": "Arahan Rasulullah SAW untuk Menyembelih 'Atud (Anak Kambing)",
    "perawi_melayu": "Diriwayatkan daripada Uqbah bin Amir RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا اللَّيْثُ  ، حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ  ، عَنْ أَبِي الْخَيْرِ  ، عَنْ عُقْبَةَ بْنِ عَامِرٍ  ، قَالَ : أَعْطَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَنَمًا أَقْسِمُهَا عَلَى أَصْحَابِهِ،فَقَسَمْتُهَا وَبَقِيَ مِنْهَا عَتُودٌ، فَذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ : \" ضَحِّ بِهِ \".\nقَالَ أَبُو مُحَمَّد : الْعَتُودُ : الْجَذَعُ مِنْ الْمَعْزِ",
    "malay_translation": "Abu al-Walid mengkhabarkan kepada kami, Al-Laith meriwayatkan kepada kami, Yazid bin Abi Habib meriwayatkan kepadaku, daripada Abi al-Khair, daripada Uqbah bin Amir, dia berkata: Rasulullah SAW memberiku kambing untuk aku bahagikan kepada sahabat-sahabatnya, lalu aku membahagikannya dan tinggal seekor 'atūd (anak kambing). Aku menyebut perkara itu kepada Rasulullah SAW, lalu Baginda bersabda: \"Sembelihlah ia sebagai korban.\"\nAbu Muhammad berkata: 'Atūd ialah jaz' (anak kambing) daripada kambing."
  },
  {
    "id": 38787,
    "hadith_number": 1250,
    "tajuk_hadith": "Berkongsi dalam Ibadah Qurban",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَعْلَى  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ أَبِي الزُّبَيْرِ  ، عَنْ جَابِرٍ  ، قَالَ : نَحَرْنَا يَوْمَ الْحُدَيْبِيَةِ سَبْعِينَ بَدَنَةً، الْبَدَنَةُ عَنْ سَبْعَةٍ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" اشْتَرِكُوا فِي الْهَدْيِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ya'la, telah menceritakan kepada kami Sufyan, daripada Abu al-Zubair, daripada Jabir, beliau berkata: Kami menyembelih tujuh puluh ekor unta pada hari Hudaibiyah, seekor unta untuk tujuh orang. Kemudian Rasulullah SAW bersabda: \"Berkongsilah dalam ibadah qurban.\""
  },
  {
    "id": 38788,
    "hadith_number": 1251,
    "tajuk_hadith": "Menyembelih Lembu untuk Tujuh Orang",
    "perawi_melayu": "Diriwayatkan daripada Jabir bin Abdullah RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ أَبِي الزُّبَيْرِ  ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ  ، قَالَ :\" نَحَرْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَقَرَةَ عَنْ سَبْعَةٍ \".\nقِيلَ لِأَبِي مُحَمَّدٍ : تَقُولُ بِهِ؟ قَالَ : نَعَمْ",
    "malay_translation": "Telah mengkhabarkan kepada kami Khalid bin Makhlad, telah menceritakan kepada kami Malik, daripada Abu al-Zubair, daripada Jabir bin Abdullah RA, beliau berkata: \"Kami menyembelih lembu bersama Rasulullah SAW untuk tujuh orang.\"\nDitanyakan kepada Abu Muhammad: Adakah anda berpendapat demikian? Beliau menjawab: Ya."
  },
  {
    "id": 38789,
    "hadith_number": 1252,
    "tajuk_hadith": "Larangan Memakan Daging Korban Selepas Tiga Hari",
    "perawi_melayu": "Diriwayatkan daripada Ibnu Umar RA bahawa Rasulullah SAW melarang memakan daging korban selepas tiga hari.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ ابْنِ جُرَيْجٍ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ لُحُومِ الْأَضَاحِيِّ، أَوْ قَالَ :\" لَا تَأْكُلُوا لُحُومَ الْأَضَاحِيِّ بَعْدَ ثَلَاثٍ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu 'Asim, daripada Ibnu Juraij, daripada Nafi', daripada Ibnu Umar, bahawa Rasulullah SAW melarang (memakan) daging-daging korban, atau baginda bersabda: \"Janganlah kamu memakan daging-daging korban selepas tiga hari.\""
  },
  {
    "id": 38790,
    "hadith_number": 1253,
    "tajuk_hadith": "Kebolehan Memakan dan Menyimpan Daging Korban Selepas Tiga Hari",
    "perawi_melayu": "Diriwayatkan daripada Nubaisyah, daripada Nabi SAW",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ  ، عَنْ خَالِدٍ هُوَ ابْنُ عَبْدِ اللَّهِ الطَّحَّانُ  ، عَنْ خَالِدٍ الْحَذَّاءِ  ، عَنْ أَبِي قِلَابَةَ  ، عَنْ أَبِي الْمَلِيحِ  ، عَنْ نُبَيْشَةَ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ، قَالَ : \" إِنَّاكُنَّا نَهَيْنَاكُمْ عَنْ لُحُومِ الْأَضَاحِيِّ أَنْ تَأْكُلُوهَا فَوْقَ ثَلَاثَةِ أَيَّامٍ كَيْ تَسَعَكُمْ، فَقَدْ جَاءَ اللَّهُ بِالسَّعَةِ، فَكُلُوا، وَادَّخِرُوا، وَائْتَجِرُوا \".\n قَالَ أَبُو مُحَمَّدٍ : ائْتَجِرُوا : اطْلُبُوا فِيهِ الْأَجْرَ",
    "malay_translation": "Telah mengkhabarkan kepada kami Amru bin Aun, daripada Khalid iaitu Ibnu Abdullah at-Tahhan, daripada Khalid al-Hazza', daripada Abu Qilabah, daripada Abu al-Malih, daripada Nubaisyah, daripada Nabi SAW, baginda bersabda: \"Sesungguhnya dahulu kami melarang kamu daripada (menyimpan) daging korban untuk dimakan lebih daripada tiga hari supaya mencukupi untuk kamu. Maka sesungguhnya Allah telah memberikan kelapangan, maka makanlah, simpanlah, dan berniagalah.\" Abu Muhammad berkata: \"I'tajiru: tuntutlah pahala padanya.\""
  },
  {
    "id": 38791,
    "hadith_number": 1254,
    "tajuk_hadith": "Kebolehan Menyimpan Daging Korban Selepas Tiga Hari",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ  ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ  ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاق  ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ  ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ  ، عَنْ عَائِشَةَ   رَضِيَ اللَّهُ عَنْهَا، قَالَتْ : كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ نَهَى عَنْ لُحُومِ الْأَضَاحِيِّ بَعْدَ ثَلَاثٍ، فَلَمَّا كَانَ الْعَامُ الْقَابِلُ وَضَحَّى النَّاسُ، قُلْتُ : يَا رَسُولَ اللَّهِ، إِنْ كَانَتْ هَذِهِ الْأَضَاحِيُّ لَتَرْفُقُ بِالنَّاسِ، كَانُوا يَدَّخِرُونَ مِنْ لُحُومِهَا وَوَدَكِهَا.\nقَالَ : \" فَمَا يَمْنَعُهُمْ مِنْ ذَلِكَ الْيَوْمَ؟ \" قُلْتُ : يَا نَبِيَّ اللَّهِ، أَوَ لَمْ تَنْهَهُمْ عَامَ أَوَّلَ عَنْ أَنْ يَأْكُلُوا لُحُومَهَا فَوْقَ ثَلَاثٍ؟ فَقَالَ : \" إِنَّمَانَهَيْتُ عَنْ ذَلِكَ لِلْحَاضِرَةِ الَّتِي حَضَرَتْهُمْ مِنْ أَهْلِ الْبَادِيَةِ لِيَبُثُّوا لُحُومَهَا فِيهِمْ، فَأَمَّا الْآنَ، فَلْيَأْكُلُوا وَلْيَدَّخِرُوا \"",
    "malay_translation": "Muhammad bin Abdullah ar-Raqashi telah mengkhabarkan kepada kami, Yazid bin Zura'i telah menceritakan kepada kami, Muhammad bin Ishaq telah menceritakan kepada kami, Abdullah bin Abi Bakr telah menceritakan kepadaku, daripada Amrah binti Abdurrahman, daripada Aisyah RA, beliau berkata: Rasulullah SAW telah melarang memakan daging korban selepas tiga hari. Apabila tiba tahun berikutnya dan orang ramai berkorban, aku berkata: Wahai Rasulullah, sesungguhnya ibadah korban ini sangat membantu orang ramai; mereka menyimpan daging dan lemaknya.\nBaginda bersabda: \"Apa yang menghalang mereka daripada berbuat demikian pada hari ini?\" Aku berkata: Wahai Nabi Allah, bukankah engkau telah melarang mereka pada tahun lepas daripada memakan dagingnya lebih daripada tiga hari? Baginda bersabda: \"Sesungguhnya aku melarang demikian kerana orang-orang yang hadir daripada kalangan penduduk Badwi supaya mereka dapat menyebarkan daging tersebut di kalangan mereka. Adapun sekarang, maka makanlah dan simpanlah.\" "
  },
  {
    "id": 38792,
    "hadith_number": 1255,
    "tajuk_hadith": "Rasulullah S.A.W. Makan Daging Bekalan Sehingga Tiba di Madinah",
    "perawi_melayu": "Diriwayatkan oleh Marwan bin Muhammad, daripada Yahya bin Hamzah, daripada Muhammad bin al-Walid az-Zubaidi, daripada Abdurrahman bin Jubair bin Nufair, daripada ayahnya, bahawa dia mendengar Thawban, maula Rasulullah S.A.W., berkata: Rasulullah S.A.W. bersabda kepadaku ketika kami berada di Mina: \"Perbaiki daging ini untuk kami.\" Maka aku memperbaikinya untuk baginda, dan baginda terus memakannya sehingga kami tiba di Madinah.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مَرْوَانُ بْنُ مُحَمَّدٍ  ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ  ، حَدَّثَنِي مُحَمَّدُ بْنُ الْوَلِيدِ الزَّبِيدِيُّ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ  ، حَدَّثَنِي أَبِي  ، أَنَّهُ سَمِعَ ثَوْبَانَ   مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ : قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ بِمِنًى :\" أَصْلِحْ لَنَا مِنْ هَذَا اللَّحْمِ \" فَأَصْلَحْتُ لَهُ مِنْهُ، فَلَمْ يَزَلْ يَأْكُلُ مِنْهُ حَتَّى بَلَغْنَا الْمَدِينَةَ",
    "malay_translation": "Telah mengkhabarkan kepada kami Marwan bin Muhammad, telah menceritakan kepada kami Yahya bin Hamzah, telah menceritakan kepadaku Muhammad bin al-Walid az-Zubaidi, daripada Abdurrahman bin Jubair bin Nufair, telah menceritakan kepadaku ayahku, bahawa dia mendengar Thawban, maula Rasulullah S.A.W., berkata: Rasulullah S.A.W. bersabda kepadaku ketika kami berada di Mina: \"Perbaiki daging ini untuk kami.\" Maka aku memperbaikinya untuk baginda, dan baginda terus memakannya sehingga kami tiba di Madinah."
  },
  {
    "id": 38793,
    "hadith_number": 1256,
    "tajuk_hadith": "Bekalan Daging Korban dari Mekah ke Madinah pada Zaman Rasulullah SAW",
    "perawi_melayu": "Diriwayatkan daripada Jabir RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ الرَّبِيعِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ عَمْرِو بْنِ دِينَارٍ  ، قَالَ : سَمِعْتُ عَطَاءً  ، قَالَ : سَمِعْتُ جَابِرًا  ، يَقُولُ : \" إِنْكُنَّا لَنَتَزَوَّدُ مِنْ مَكَّةَ إِلَى الْمَدِينَةِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \".\n قَالَ أَبُو مُحَمَّد : يَعْنِي : لُحُومَ الْأَضَاحِيِّ",
    "malay_translation": "Telah mengkhabarkan kepada kami Sa'id bin ar-Rabi', telah menceritakan kepada kami Syu'bah, daripada 'Amru bin Dinar, dia berkata: Aku mendengar 'Ata' berkata: Aku mendengar Jabir RA berkata: \"Sesungguhnya kami pernah membawa bekal dari Mekah ke Madinah pada zaman Rasulullah SAW.\" Abu Muhammad berkata: Maksudnya: daging-daging korban."
  },
  {
    "id": 38794,
    "hadith_number": 1257,
    "tajuk_hadith": "Menyembelih Korban Sebelum Solat Hari Raya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ مَنْصُورٍ  ، وَزُبَيْدٍ  ، عَنْ الشَّعْبِيِّ  ، عَنْ الْبَرَاءِ بْنِ عَازِبٍ  ، أَنَّ أَبَا بُرْدَةَ بْنَ نِيَارٍ ضَحَّى قَبْلَ أَنْ يُصَلِّيَ، فَلَمَّا صَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، دَعَاهُ فَذَكَرَ لَهُ مَا فَعَلَ، فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" إِنَّمَاشَاتُكَ شَاةُ لَحْمٍ \".\nفَقَالَ : يَا رَسُولَ اللَّهِ، عِنْدِي عَنَاقٌ جَذَعَةٌ مِنْ الْمَعْزِ هِيَ أَحَبُّ إِلَيَّ مِنْ شَاتَيْنِ.\nقَالَ : \" فَضَحِّ بِهَا، وَلَا تُجْزِئُ عَنْ أَحَدٍ بَعْدَكَ \".\nقَالَ أَبُو مُحَمَّد : قُرِئَ عَلَى مُحَمَّدٍ، عَنْ سُفْيَانَ : وَمَنْ ذَبَحَ بَعْدَ الصَّلَاةِ وَالْإِمَامُ يَخْطُبُ أَجْزَأَهُ",
    "malay_translation": "Muhammad bin Yusuf mengkhabarkan kepada kami, Sufyan menceritakan kepada kami, daripada Mansur dan Zubaid, daripada As-Sya'bi, daripada Al-Bara' bin 'Azib, bahawa Abu Burdah bin Niyar telah menyembelih korban sebelum dia solat. Apabila Nabi ﷺ selesai solat, baginda memanggilnya dan dia menceritakan apa yang telah dilakukannya. Rasulullah ﷺ bersabda kepadanya: \"Sesungguhnya kambingmu itu hanyalah kambing daging (bukan korban).\"\n\nDia berkata: \"Wahai Rasulullah, saya mempunyai seekor anak kambing betina *jaz'ah* daripada kambing, yang lebih saya sukai daripada dua ekor kambing.\"\n\nBaginda bersabda: \"Sembelihlah ia, dan ia tidak mencukupi untuk (korban) sesiapa pun selepasmu.\"\n\nAbu Muhammad berkata: Dibacakan kepada Muhammad, daripada Sufyan: Sesiapa yang menyembelih selepas solat dan imam sedang berkhutbah, ia mencukupi (sebagai korban)."
  },
  {
    "id": 38795,
    "hadith_number": 1258,
    "tajuk_hadith": "Perintah Mengulangi Sembelihan Korban Sebelum Solat Aidiladha",
    "perawi_melayu": "Diriwayatkan oleh Abu Ali al-Hanafi, daripada Malik, daripada Yahya bin Sa'id, daripada Bushair bin Yasar, daripada Abu Burdah bin Niyar",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو عَلِيٍّ الْحَنَفِيُّ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ يَحْيَى بْنِ سَعِيدٍ  ، عَنْ بُشَيْرِ بْنِ يَسَارٍ  ، عَنْ أَبِي بُرْدَةَ بْنِ نِيَارٍ  ، أَنَّ رَجُلًا ذَبَحَ قَبْلَ أَنْ يَنْصَرِفَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" فَأَمَرَهُ أَنْ يُعِيدَ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Ali al-Hanafi, telah menceritakan kepada kami Malik, daripada Yahya bin Sa'id, daripada Bushair bin Yasar, daripada Abu Burdah bin Niyar, bahawa seorang lelaki telah menyembelih (korbannya) sebelum Nabi ﷺ selesai (daripada solat 'Aid). Maka baginda memerintahkannya untuk mengulangi (sembelihan tersebut)."
  },
  {
    "id": 38796,
    "hadith_number": 1259,
    "tajuk_hadith": "Larangan Melakukan Fara' dan 'Atirah",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA, Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى  ، حَدَّثَنَا ابْنُ عُيَيْنَةَ  ، عَنْ الزُّهْرِيِّ  ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَا فَرَعَ وَلَا عَتِيرَةَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Isa, telah menceritakan kepada kami Ibnu Uyainah, daripada Az-Zuhri, daripada Sa'id bin Al-Musayyib, daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: \"Tidak boleh melakukan fara' dan tidak boleh melakukan 'atirah.\""
  },
  {
    "id": 38797,
    "hadith_number": 1260,
    "tajuk_hadith": "Hukum Menyembelih Binatang pada Bulan Rejab",
    "perawi_melayu": "Muhammad bin Isa meriwayatkan daripada Abu Awanah, daripada Ya'la bin Ata', daripada Waki' bin Hudus, daripada Abu Razin al-'Uqaili iaitu Laqit bin Amir",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى  ، حَدَّثَنَا أَبُو عَوَانَةَ  ، عَنْ يَعْلَى بْنِ عَطَاءٍ  ، عَنْ وَكِيعِ بْنِ حُدُسٍ  ، عَنْ أَبِي رَزِينٍ الْعُقَيْلِيِّ : لَقِيطِ بْنِ عَامِرٍ  ، قَالَ : قُلْتُ : يَا رَسُولَ اللَّهِ، إِنَّا كُنَّانَذْبَحُ فِي رَجَبٍ فَمَا تَرَى؟ قَالَ : \" لَا بَأْسَ بِذَلِكَ \".\nقَالَ وَكِيعٌ : لَا أَدَعُهُ أَبَدًا",
    "malay_translation": "Muhammad bin Isa meriwayatkan kepada kami, Abu Awanah meriwayatkan kepada kami, daripada Ya'la bin Ata', daripada Waki' bin Hudus, daripada Abu Razin al-'Uqaili iaitu Laqit bin Amir, beliau berkata: \"Saya bertanya: Wahai Rasulullah, sesungguhnya kami dahulu sering menyembelih (binatang) pada bulan Rejab, maka apa pendapatmu?\" Baginda bersabda: \"Tidak mengapa dengan hal itu.\"\nWaki' berkata: \"Saya tidak akan meninggalkannya selama-lamanya.\""
  },
  {
    "id": 38798,
    "hadith_number": 1261,
    "tajuk_hadith": "Akikah: Dua Ekor Kambing untuk Anak Lelaki, Seekor untuk Anak Perempuan",
    "perawi_melayu": "Diriwayatkan dari Ummu Kurz, dari Nabi SAW, mengenai akikah:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ ابْنِ جُرَيْجٍ  ، قَالَ : أَخْبَرَنِي عَطَاءٌ  ، عَنْ حَبِيبَةَ بِنْتِ مَيْسَرَةَ بْنِ أَبِي خُثَيْمٍ  ، عَنْ أُمِّ كُرْزٍ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ، قَالَ فِي الْعَقِيقَةِ :\" عَنْ الْغُلَامِ شَاتَانِ مُكَافِئَتَانِ، وَعَنْ الْجَارِيَةِ شَاةٌ \"",
    "malay_translation": "\"Untuk anak lelaki, dua ekor kambing yang setara, dan untuk anak perempuan, seekor kambing.\""
  },
  {
    "id": 38799,
    "hadith_number": 1262,
    "tajuk_hadith": "Aqiqah untuk Anak Lelaki dan Menghilangkan Kotoran",
    "perawi_melayu": "Diriwayatkan daripada Salman bin Amir Ad-Dhabbi, bahawa Rasulullah SAW bersabda",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ  ، عَنْ هِشَامٍ  ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ  ، عَنْ سَلْمَانَ بْنِ عَامِرٍ الضَّبِّيِّ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :\" مَعَ الْغُلَامِ عَقِيقَةٌ، فَأَهْرِيقُوا عَنْهُ الدَّمَ، وَأَمِيطُوا عَنْهُ الْأَذَى \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Sa'id bin Amir, daripada Hisyam, daripada Hafsah binti Sirin, daripada Salman bin Amir Ad-Dhabbi, bahawa Rasulullah SAW bersabda: “Bersama anak lelaki ada aqiqah, maka tumpahkanlah darah (sembelihan) untuknya, dan hilangkanlah daripadanya kekotoran (cukur rambutnya).”"
  },
  {
    "id": 38800,
    "hadith_number": 1263,
    "tajuk_hadith": "Aqiqah untuk Anak Lelaki dan Perempuan",
    "perawi_melayu": "Diriwayatkan daripada Ummu Kurz RA, bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ  ، عَنْ سِبَاعِ بْنِ ثَابِتٍ  ، عَنْ أُمِّ كُرْزٍ  ، قَالَتْ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" عَنْ الْغُلَامِ شَاتَانِ مِثْلَانِ، وَعَنْ الْجَارِيَةِ شَاةٌ \"",
    "malay_translation": "\"Untuk anak lelaki (aqiqahnya) adalah dua ekor kambing yang serupa, dan untuk anak perempuan seekor kambing.\""
  },
  {
    "id": 38801,
    "hadith_number": 1264,
    "tajuk_hadith": "Setiap Anak Tergadai dengan Aqiqahnya",
    "perawi_melayu": "Diriwayatkan oleh 'Affan bin Muslim daripada Hammam, daripada Qatadah, daripada al-Hasan, daripada Samurah bahawa Nabi SAW bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَفَّانُ بْنُ مُسْلِمٍ  ، حَدَّثَنَا هَمَّامٌ  ، عَنْ قَتَادَةَ  ، عَنْ الْحَسَنِ  ، عَنْ سَمُرَةَ  ، أَنّ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" كُلُّ غُلَامٍ رَهِينَةٌ بِعَقِيقَتِهِ يُذْبَحُ عَنْهُ يَوْمَ سَابِعِهِ، وَيُحْلَقُ وَيُدَمَّى \".\nوَكَانَ قَتَادَةُ يَصِفُ الدَّمَ، فَيَقُولُ : إِذَا ذُبِحَتْ الْعَقِيقَةُ، تُؤْخَذُ صُوفَةٌ فَيُسْتَقْبَلُ بِهَا أَوْدَاجُ الذَّبِيحَةِ، ثُمَّ يُوضَعُ عَلَى يَافُوخِ الصَّبِيِّ حَتَّى إِذَا سَالَ شَبَهُ الْخَيْطِ، غُسِلَ رَأْسُهُ، ثُمَّ حُلِقَ بَعْدُ.\n حَدَّثَنَا عَفَّانُ  ، حَدَّثَنَا أَبَانُ  ، بِهَذَا الْحَدِيثِ، قَالَ : وَيُسَمَّى.\nقَالَ عَبْد اللَّهِ : وَلَا أُرَاهُ وَاجِبًا",
    "malay_translation": "\"Setiap anak itu tergadai dengan 'Aqiqahnya; disembelih (binatang aqiqah) untuknya pada hari ketujuhnya, dicukur (rambutnya), dan dilumuri dengan darah.\" Qatadah menerangkan tentang darah, katanya: \"Apabila disembelih aqiqah, diambil kapas bulu, lalu diletakkan di urat leher haiwan yang disembelih, kemudian diletakkan di ubun-ubun bayi sehingga mengalir seperti benang, kemudian dibasuh kepalanya, kemudian dicukur selepas itu.\"\n'Affan menceritakan kepada kami, 'Affan menceritakan kepada kami, Aban, dengan hadis ini, katanya: \"Dan diberi nama.\"\nAbdullah berkata: \"Dan saya tidak melihatnya sebagai wajib.\""
  },
  {
    "id": 38802,
    "hadith_number": 1265,
    "tajuk_hadith": "Allah Menetapkan Ihsan dalam Segala Perkara",
    "perawi_melayu": "Diriwayatkan dari Syaddad bin Aus RA, katanya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ خَالِدٍ الْحَذَّاءِ  ، عَنْ أَبِي قِلَابَةَ  ، عَنْ أَبِي الْأَشْعَثِ الصَّنْعَانِيِّ  ، عَنْ شَدَّادِ بْنِ أَوْسٍ  ، قَالَ : حَفِظْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اثْنَتَيْنِ : قَالَ : \" إِنَّاللَّهَ كَتَبَ عَلَيْكُمُ الْإِحْسَانَ عَلَى كُلِّ شَيْءِ، فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا الْقِتْلَةَ، وَإِذَا ذَبَحْتُمْ، فَأَحْسِنُوا الذَّبْحَ، وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ، ثُمَّ لِيُرِحْ ذَبِيحَتَهُ \"",
    "malay_translation": "\"Saya menghafal daripada Rasulullah SAW dua perkara. Baginda bersabda: 'Sesungguhnya Allah telah menetapkan ihsan (berbuat baik) dalam segala sesuatu. Jika kamu membunuh, maka berbuat baiklah dalam pembunuhan; dan jika kamu menyembelih, maka berbuat baiklah dalam penyembelihan. Hendaklah salah seorang di antara kamu menajamkan pisaunya, kemudian hendaklah dia menyenangkan haiwan sembelihannya.'\""
  },
  {
    "id": 38803,
    "hadith_number": 1266,
    "tajuk_hadith": "Menyembelih Haiwan dengan Batu Kerana Kecemasan",
    "perawi_melayu": "Diriwayatkan daripada Nafi', daripada Ibn Umar R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ   : أَنَّ امْرَأَةً كَانَتْ تَرْعَى لِآلِ كَعْبِ بْنِ مَالِكٍ غَنَمًا بِسَلْعٍ، فَخَافَتْ عَلَى شَاةٍ مِنْهَا أَنْ تَمُوتَ، فَأَخَذَتْ حَجَرًا فَذَبَحَتْهَا بِهِ، وَإِنَّ ذَلِكَ ذُكِرَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" فَأَمَرَهُمْ بِأَكْلِهَا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah mengkhabarkan kepada kami Yahya bin Sa'id, daripada Nafi', daripada Ibn Umar R.A.: Bahawa seorang wanita yang menggembala kambing milik keluarga Ka'ab bin Malik di Sal'in, bimbang seekor kambingnya akan mati. Maka dia mengambil batu dan menyembelih kambing itu dengannya. Perkara itu kemudiannya disebut kepada Rasulullah SAW, lalu baginda memerintahkan mereka untuk memakannya."
  },
  {
    "id": 38804,
    "hadith_number": 1267,
    "tajuk_hadith": "Kaedah Penyembelihan Haiwan: Harus Menyembelih di Mana-mana Bahagian Badan",
    "perawi_melayu": "Abu Al-Walid, Uthman bin Umar, dan Affan meriwayatkan daripada Hammad bin Salamah, daripada Abi Al-'Usyara', daripada bapanya",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ  ، وَعُثْمَانُ بْنُ عُمَرَ  ، وَعَفَّانُ  ، عَنْ حَمَّادِ بْنِ سَلَمَةَ  ، عَنْ أَبِي الْعُشَرَاءِ  ، عَنْ أَبِيهِ  ، قَالَ : قُلْتُ : يَا رَسُولَ اللَّهِ، أَمَا تَكُونُ الذَّكَاةُ إِلَّا فِي الْحَلْقِ وَاللَّبَّةِ؟ فَقَالَ :\" لَوْ طَعَنْتَ فِي فَخِذِهَا، لَأَجْزَأَ عَنْكَ \".\nقَالَ حَمَّادٌ : حَمَلْنَاهُ عَلَى الْمُتَرَدِّي",
    "malay_translation": "Abu Al-Walid, Uthman bin Umar, dan Affan telah memberitahu kami daripada Hammad bin Salamah, daripada Abi Al-'Usyara', daripada bapanya, dia berkata: Aku bertanya: \"Wahai Rasulullah, adakah penyembelihan hanya boleh dilakukan pada halkum (kerongkong) dan pangkal leher?\" Baginda bersabda: \"Sekiranya kamu menikam di pahanya, ia sudah memadai untukmu.\"\n\nHammad berkata: Kami menganggap ini berkaitan dengan haiwan yang jatuh (ke dalam lubang)."
  },
  {
    "id": 38805,
    "hadith_number": 1268,
    "tajuk_hadith": "Larangan Mencacatkan atau Menyakiti Haiwan",
    "perawi_melayu": "Diriwayatkan daripada Sa'id bin Jubair, beliau berkata: Aku keluar bersama Ibnu Umar di salah satu jalan di Madinah. Tiba-tiba kami melihat beberapa anak kecil sedang memanah seekor ayam. Ibnu Umar bertanya: 'Siapa yang melakukan ini?' Lalu mereka berpecah. Ibnu Umar berkata: 'Sesungguhnya Rasulullah SAW melaknat orang yang mencacatkan haiwan.'",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا شُعْبَةُ  ، حَدَّثَنِي الْمِنْهَالُ بْنُ عَمْرٍو  ، قَالَ : سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ  ، يَقُولُ : خَرَجْتُ مَعَ ابْنِ عُمَرَ فِي طَرِيقٍ مِنْ طُرُقِ الْمَدِينَةِ ، فَإِذَا غِلْمَةٌ يَرْمُونَ دَجَاجَةً، فَقَالَ ابْنُ عُمَرَ   : مَنْ فَعَلَ هَذَا؟ فَتَفَرَّقُوا.\nفَقَالَ : إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" لَعَنَ مَنْ مَثَّلَ بِالْحَيَوَانِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu al-Walid, telah menceritakan kepada kami Syu'bah, telah menceritakan kepadaku al-Minhal bin 'Amru, beliau berkata: Aku mendengar Sa'id bin Jubair berkata: Aku keluar bersama Ibnu Umar di salah satu jalan di Madinah. Tiba-tiba kami melihat beberapa anak kecil sedang memanah seekor ayam. Ibnu Umar bertanya: 'Siapa yang melakukan ini?' Lalu mereka berpecah. Ibnu Umar berkata: 'Sesungguhnya Rasulullah SAW melaknat orang yang mencacatkan haiwan.'"
  },
  {
    "id": 38806,
    "hadith_number": 1269,
    "tajuk_hadith": "Larangan Menyeksa Haiwan",
    "perawi_melayu": "Diriwayatkan daripada Abu Ayyub Al-Ansari RA bahawa Rasulullah SAW melarang daripada menyeksa haiwan.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ  ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ  ، عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ  ، عَنْ أَبِيهِ  ، عَنْ عُبَيْدِ بْنِ تِعْلَى  ،  عَنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّ   : أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" نَهَى عَنْ صَبْرِ الدَّابَّةِ \".\nقَالَ أَبُو أَيُّوبَ : لَوْ كَانَتْ دَجَاجَةً مَا صَبَرْتُهَا",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Asim, daripada Abdul Hamid bin Ja'far, daripada Yazid bin Abi Habib, daripada Bukair bin Abdullah bin Al-Asyaj, daripada ayahnya, daripada Ubaid bin Ti'la, daripada Abu Ayyub Al-Ansari RA: Bahawa Rasulullah SAW melarang daripada menyeksa haiwan. Abu Ayyub berkata: 'Jika ia seekor ayam sekalipun, aku tidak akan menyeksanya.'"
  },
  {
    "id": 38807,
    "hadith_number": 1270,
    "tajuk_hadith": "Larangan Melakukan Mujaththamah (Menyeksa Binatang)",
    "perawi_melayu": "Diriwayatkan daripada Ibnu Abbas RA bahawa Rasulullah SAW melarang melakukan Mujaththamah.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَفَّانُ  ، حَدَّثَنَا حَمَّادٌ  ، أَخْبَرَنَا قَتَادَةُ  ، عَنْ عِكْرِمَةَ  ، عَنْ ابْنِ عَبَّاسٍ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ\" نَهَى عَنْ الْمُجَثَّمَةِ \".\nفَقَالَ أَبُو مُحَمَّد : الْمُجَثَّمَةُ : الْمَصْبُورَةُ",
    "malay_translation": "Telah menceritakan kepada kami Affan, telah menceritakan kepada kami Hammad, telah mengkhabarkan kepada kami Qatadah, daripada Ikrimah, daripada Ibnu Abbas RA, bahawa Rasulullah SAW melarang perbuatan 'Mujaththamah'. Abu Muhammad berkata: 'Mujaththamah' adalah haiwan yang diikat (dan diseksa sehingga mati)."
  },
  {
    "id": 38808,
    "hadith_number": 1271,
    "tajuk_hadith": "Makan Daging yang Tidak Diketahui Sama Ada Disebut Nama Allah Atau Tidak",
    "perawi_melayu": "Muhammad bin Sa'id, daripada Abdul Rahim iaitu Ibnu Sulaiman, daripada Hisham bin Urwah, daripada ayahnya, daripada Aisyah Ummul Mukminin",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَعِيدٍ  ، حَدَّثَنَا عَبْدُ الرَّحِيمِ هُوَ ابْنُ سُلَيْمَانَ  ، عَنْ هِشَامِ بْنِ عُرْوَةَ  ، عَنْ أَبِيهِ  ، عَنْ عَائِشَةَ   أُمِّ الْمُؤْمِنِينَ، أَنَّ قَوْمًا قَالُوا : يَا رَسُولَ اللَّهِ، إِنَّ قَوْمًا يَأْتُونَا بِاللَّحْمِ لَا نَدْرِي أَذُكِرَ اسْمُ اللَّهِ عَلَيْهِ أَمْ لَا؟ فَقَالَ :\" سَمُّوا أَنْتُمْ وَكُلُوا \"وَكَانُوا حَدِيثَ عَهْدٍ بِجَاهِلِيَّةٍ",
    "malay_translation": "Muhammad bin Sa'id telah mengkhabarkan kepada kami, Abdul Rahim iaitu Ibnu Sulaiman telah menceritakan kepada kami, daripada Hisham bin Urwah, daripada ayahnya, daripada Aisyah Ummul Mukminin, bahawa suatu kaum berkata: Wahai Rasulullah, sesungguhnya suatu kaum datang kepada kami dengan daging yang kami tidak tahu adakah nama Allah disebut atasnya atau tidak? Baginda bersabda: “Sebutlah nama Allah kamu dan makanlah.” Dan mereka itu baru sahaja meninggalkan zaman jahiliah."
  },
  {
    "id": 38809,
    "hadith_number": 1272,
    "tajuk_hadith": "Menangani Haiwan Ternakan yang Lari",
    "perawi_melayu": "Diriwayatkan daripada Rafi' bin Khadij RA bahawa Rasulullah SAW bersabda mengenai unta yang lari dan ditangkap dengan panah.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ أَبِيهِ  ، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ ابْنِ رَافِعٍ  ، عَنْ جَدِّهِ رَافِعِ بْنِ خَدِيجٍ   : أَنَّ بَعِيرًا نَدَّ وَلَيْسَ فِي الْقَوْمِ إِلَّا خَيْلٌ يَسِيرَةٌ، فَرَمَاهُ رَجُلٌ بِسَهْمٍ، فَحَبَسَهُ، فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" إِنَّلِهَذِهِ الْبَهَائِمِ أَوَابِدَ كَأَوَابِدِ الْوَحْشِ، فَمَا غَلَبَكُمْ مِنْهَا، فَاصْنَعُوا بِهِ هَكَذَا \"",
    "malay_translation": "Muhammad bin Yusuf telah mengkhabarkan kepada kami, daripada Sufyan, daripada bapanya, daripada Abayah bin Rifa'ah bin Rafi', daripada datuknya Rafi' bin Khadij RA: Bahawa seekor unta telah lari dan tidak ada kuda yang banyak di kalangan mereka. Lalu seorang lelaki memanahnya dengan anak panah, lalu menahannya. Rasulullah SAW bersabda kepadanya: “Sesungguhnya haiwan ternakan ini mempunyai tabiat liar seperti haiwan liar. Maka apa sahaja yang dapat kamu kuasai daripada mereka, lakukanlah seperti ini (yakni dengan cara yang boleh menghentikannya).”"
  },
  {
    "id": 38810,
    "hadith_number": 1273,
    "tajuk_hadith": "Larangan Membunuh Burung Tanpa Sebab yang Benar",
    "perawi_melayu": "Ismail Abu Ma'mar bin Ibrahim meriwayatkan daripada Sufyan, daripada 'Amru iaitu Ibnu Dinar, daripada Suhaib, maula Ibnu 'Amir, katanya: Aku mendengar Abdullah bin 'Amru berkata: Rasulullah SAW bersabda: \"Sesiapa yang membunuh seekor burung tanpa haknya, Allah akan menyoalnya pada hari kiamat.\"",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيل أَبُو مَعْمَرٍ بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ عَمْرٍو هُوَ ابْنُ دِينَارٍ  ، عَنْ صُهَيْبٍ  مَوْلَى ابْنِ عَامِرٍ، قَالَ : سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرٍو  ، يَقُولُ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَنْ قَتَلَ عُصْفُورًا بِغَيْرِ حَقِّهِ، سَأَلَهُ اللَّهُ عَنْهُ يَوْمَ الْقِيَامَةِ \".\nقِيلَ : وَمَا حَقُّهُ؟ قَالَ : \" أَنْ تَذْبَحَهُ فَتَأْكُلَهُ \"",
    "malay_translation": "Ismail Abu Ma'mar bin Ibrahim meriwayatkan kepada kami, Sufyan meriwayatkan kepada kami, daripada 'Amru iaitu Ibnu Dinar, daripada Suhaib, maula Ibnu 'Amir, berkata: Aku mendengar Abdullah bin 'Amru berkata: Rasulullah SAW bersabda: \"Sesiapa yang membunuh seekor burung tanpa haknya, Allah akan menyoalnya pada hari kiamat.\" Ditanya: \"Apakah haknya?\" Baginda bersabda: \"Engkau menyembelihnya dan memakannya.\""
  },
  {
    "id": 38811,
    "hadith_number": 1274,
    "tajuk_hadith": "Penyembelihan Janin Mengikut Penyembelihan Ibunya",
    "perawi_melayu": "Diriwayatkan daripada Jabir, daripada Nabi SAW",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاق بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا عَتَّابُ بْنُ بَشِيرٍ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي زِيَادٍ  ، عَنْ أَبِي الزُّبَيْرِ  ، عَنْ جَابِرٍ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" ذَكَاةُ الْجَنِينِ ذَكَاةُ أُمِّهِ \".\nقِيلَ لِأَبِي مُحَمَّدٍ : يُؤْكَلُ؟ قَالَ : نَعَمْ",
    "malay_translation": "Telah mengkhabarkan kepada kami Ishaq bin Ibrahim, telah menceritakan kepada kami Attab bin Bashir, daripada Ubaidillah bin Abi Ziyad, daripada Abi Zubair, daripada Jabir, daripada Nabi SAW, baginda bersabda: \"Sembelihan janin adalah (mengikut) sembelihan ibunya.\" Ditanyakan kepada Abu Muhammad: \"Bolehkah dimakan?\" Beliau menjawab: \"Ya, boleh.\""
  },
  {
    "id": 38812,
    "hadith_number": 1275,
    "tajuk_hadith": "Larangan Memakan Binatang Buas Bertaring",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ ابْنِ شِهَابٍ  ، عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ  ،  عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ  ، قَالَ : \" نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْأَكْلِ كُلِّ ذِي نَابٍ مِنْ السِّبَاعِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Khalid bin Makhlad, telah menceritakan kepada kami Malik, daripada Ibn Shihab, daripada Abu Idris al-Khaulani, daripada Abu Tha'labah al-Khushani, beliau berkata: \"Rasulullah SAW melarang daripada memakan setiap binatang buas yang bertaring.\""
  },
  {
    "id": 38813,
    "hadith_number": 1276,
    "tajuk_hadith": "Larangan Merampas, Membunuh Binatang dengan Kejam, Merompak, dan Memakan Binatang Buas Bertaring",
    "perawi_melayu": "Abdullah bin Maslamah, daripada Abu Uwais, anak saudara Malik bin Anas, daripada az-Zuhri, daripada Abu Idris al-Khaulani, daripada Abu Tha'labah al-Khushani",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ  ، حَدَّثَنَا أَبُو أُوَيْسٍ  ابْنُ عَمِّ مَالِكِ بْنِ أَنَسٍ، عَنْ الزُّهْرِيِّ  ، عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ  ، عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ  ، قَالَ : \" نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْالْخَطْفَةِ، وَالْمُجَثَّمَةِ، وَالنُّهْبَةِ، وَعَنْ أَكْلِ كُلِّ ذِي نَابٍ مِنْ السِّبَاعِ \"",
    "malay_translation": "Abdullah bin Maslamah mengkhabarkan kepada kami, Abu Uwais, anak saudara Malik bin Anas, menceritakan kepada kami, daripada az-Zuhri, daripada Abu Idris al-Khaulani, daripada Abu Tha'labah al-Khushani, beliau berkata: \"Rasulullah SAW melarang daripada merampas (al-Khatfah), membunuh binatang dengan kejam (al-Mujaththamah), merompak (an-Nuhbah), dan daripada memakan setiap binatang buas yang bertaring.\""
  },
  {
    "id": 38814,
    "hadith_number": 1277,
    "tajuk_hadith": "Larangan Memakan Binatang Buas Bertaring dan Burung Bercakar",
    "perawi_melayu": "Diriwayatkan dari Ibnu Abbas RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ حَمَّادٍ  ، حَدَّثَنَا أَبُو عَوَانَةَ  ، عَنْ أَبِي بِشْرٍ  ، عَنْ مَيْمُونِ بْنِ مِهْرَانَ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ : \" نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْأَكْلِ كُلِّ ذِي نَابٍ مِنْ السِّبَاعِ، وَكُلِّ ذِي مِخْلَبٍ مِنْ الطَّيْرِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yahya bin Hammad, telah menceritakan kepada kami Abu 'Awanah, daripada Abu Bisyr, daripada Maimun bin Mihran, daripada Ibnu Abbas RA, beliau berkata: \"Rasulullah SAW melarang daripada memakan setiap binatang buas yang bertaring dan setiap burung yang mempunyai cakar.\" "
  },
  {
    "id": 38815,
    "hadith_number": 1278,
    "tajuk_hadith": "Larangan Menggunakan Kulit Binatang Buas Sebagai Alas",
    "perawi_melayu": "Ya'mar bin Bishr, daripada Ibn al-Mubarak, daripada Sa'id, daripada Qatadah, daripada Abi al-Malih, daripada ayahnya",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَعْمَرُ بْنُ بِشْرٍ  ، عَنْ ابْنِ الْمُبَارَكِ  ، عَنْ سَعِيدٍ  ، عَنْ قَتَادَةَ  ، عَنْ أَبِي الْمَلِيحِ  ، عَنْ أَبِيهِ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" نَهَى عَنْ جُلُودِ السِّبَاعِ أَنْ تُفْتَرَشَ \".\n أَخْبَرَنَا مُسَدَّدٌ  ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ  ، عَنْ سَعِيدٍ  عن قَتَادَةَ  ، عَنْ أَبِي الْمَلِيحِ  ، عَنْ أَبِيهِ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، نَحْوَهُ",
    "malay_translation": "Ya'mar bin Bishr memberitahu kami, daripada Ibn al-Mubarak, daripada Sa'id, daripada Qatadah, daripada Abi al-Malih, daripada ayahnya, bahawa Rasulullah SAW melarang penggunaan kulit binatang buas sebagai alas.\n\nMusaddad memberitahu kami, Yahya bin Sa'id memberitahu kami, daripada Sa'id, daripada Qatadah, daripada Abi al-Malih, daripada ayahnya, daripada Nabi SAW, dengan lafaz yang serupa."
  },
  {
    "id": 38816,
    "hadith_number": 1279,
    "tajuk_hadith": "Menyamak Kulit Binatang Menjadikannya Suci",
    "perawi_melayu": "Muhammad bin Yusuf, daripada Sufyan, daripada Zaid bin Aslam, daripada Abdur Rahman bin Wa'lah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ زَيْدِ بْنِ أَسْلَمَ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ وَعْلَةَ  ، قَالَ : سَأَلْتُ ابْنَ عَبَّاسٍ   عَنْ الْأَسْقِيَةِ، فَقَالَ : مَا أَدْرِي مَا أَقُولُ لَكَ، غَيْرَ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ :\" أَيُّمَا إِهَابٍ دُبِغَ فَقَدْ طَهُرَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Yusuf, daripada Sufyan, daripada Zaid bin Aslam, daripada Abdur Rahman bin Wa'lah, beliau berkata: Aku bertanya kepada Ibnu Abbas tentang bekas air (yang diperbuat daripada kulit binatang). Beliau berkata: Aku tidak tahu apa yang hendak aku katakan kepadamu, melainkan aku mendengar Rasulullah SAW bersabda: \"Kulit binatang apa pun yang disamak, maka ia telah menjadi suci.\""
  },
  {
    "id": 38817,
    "hadith_number": 1280,
    "tajuk_hadith": "Penyamakan Kulit Bangkai Menjadikannya Suci",
    "perawi_melayu": "Diriwayatkan daripada Ya'la, daripada Muhammad bin Ishaq, daripada al-Qa'qa' bin Hakim, daripada Abd al-Rahman bin Wa'lah.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْلَى  ، عَنْ مُحَمَّدِ بْنِ إِسْحَاق  ، عَنْ الْقَعْقَاعِ بْنِ حَكِيمٍ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ وَعْلَةَ  ، قَالَ : سَأَلْتُ ابْنَ عَبَّاسٍ   عَنْ جُلُودِ الْمَيْتَةِ، فَقَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" دِبَاغُهَا طَهُورُهَا \".\nقِيلَ لِأَبِي مُحَمَّدٍ عَبْدِ اللَّهِ : تَقُولُ بِهَذَا؟ قَالَ : نَعَمْ، إِذَا كَانَ يُؤْكَلُ لَحْمُهُ",
    "malay_translation": "Telah menceritakan kepada kami Ya'la, daripada Muhammad bin Ishaq, daripada al-Qa'qa' bin Hakim, daripada Abd al-Rahman bin Wa'lah, beliau berkata: Aku bertanya kepada Ibnu Abbas tentang kulit bangkai, lalu beliau berkata: Rasulullah SAW bersabda: \"Penyamakannya adalah penyucinya.\"\nDitanyakan kepada Abu Muhammad Abdullah: Adakah anda berpendapat dengan ini? Beliau menjawab: Ya, jika dagingnya boleh dimakan."
  },
  {
    "id": 38818,
    "hadith_number": 1281,
    "tajuk_hadith": "Memanfaatkan Kulit Bangkai Setelah Disamak",
    "perawi_melayu": "Diriwayatkan daripada Aisyah R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ يَزِيدَ بْنِ قُسَيْطٍ  ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ  ، عَنْ أُمِّهِ  ، عَنْ عَائِشَةَ  ، قَالَتْ : \" أَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْيُسْتَمْتَعَ بِجُلُودِ الْمَيْتَةِ إِذَا دُبِغَتْ \"",
    "malay_translation": "Aisyah R.A. berkata: \"Rasulullah SAW memerintahkan untuk memanfaatkan kulit bangkai apabila ia telah disamak.\""
  },
  {
    "id": 38819,
    "hadith_number": 1282,
    "tajuk_hadith": "Pemanfaatan Kulit Bangkai Setelah Disamak",
    "perawi_melayu": "Yahya bin Hassan, Sufyan bin Uyainah, Az-Zuhri, Ubaidillah bin Abdullah, Ibnu Abbas, Muhammad bin Al-Musaffa, Baqiyyah, Az-Zubaidi",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ  ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ  ، عَنْ الزُّهْرِيِّ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ  ،  عَنْ ابْنِ عَبَّاسٍ  ، قَالَ : مَاتَتْ شَاةٌ لِمَيْمُونَةَ ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَوْ اسْتَمْتَعْتُمْ بِإِهَابِهَا؟ \" قَالُوا : يَا رَسُولَ اللَّهِ، إِنَّهَا مَيْتَةٌ، قَالَ : \" إِنَّمَا حُرِّمَ أَكْلُهَا \".\nأَخْبَرَنَا مُحَمَّدُ بْنُ الْمُصَفَّى  ، حَدَّثَنَا بَقِيَّةُ  ، عَنْ الزُّبَيْدِيِّ  ، عَنْ الزُّهْرِيِّ  ، عَنْ عُبَيْدِ اللَّهِ  ، عَنْ ابْنِ عَبَّاسٍ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، نَحْوَ هَذَا الْحَدِيثِ.\nقِيلَ لِأَبِي مُحَمَّدٍ : مَا تَقُولُ فِي الثَّعَالِبِ إِذَا دُبِغَتْ؟ قَالَ : أَكْرَهُهَا",
    "malay_translation": "Telah menceritakan kepada kami Yahya bin Hassan, telah menceritakan kepada kami Sufyan bin Uyainah, dari Az-Zuhri, dari Ubaidillah bin Abdullah, dari Ibnu Abbas, beliau berkata: Seekor kambing milik Maimunah mati, lalu Rasulullah SAW bersabda: \"Mengapa kamu tidak memanfaatkan kulitnya?\" Mereka berkata: Wahai Rasulullah, sesungguhnya ia adalah bangkai. Baginda bersabda: \"Sesungguhnya yang diharamkan hanyalah memakannya.\"\nTelah mengkhabarkan kepada kami Muhammad bin Al-Musaffa, telah menceritakan kepada kami Baqiyyah, dari Az-Zubaidi, dari Az-Zuhri, dari Ubaidillah, dari Ibnu Abbas, dari Nabi SAW, seperti hadis ini.\nDitanyakan kepada Abu Muhammad: Apa pendapatmu tentang rubah jika disamak? Dia berkata: Aku membencinya."
  },
  {
    "id": 38820,
    "hadith_number": 1283,
    "tajuk_hadith": "Larangan Mut'ah dan Daging Keldai Peliharaan pada Hari Khaibar",
    "perawi_melayu": "Ahmad bin Abdullah, daripada Malik, daripada az-Zuhri, daripada al-Hasan dan Abdullah, anak-anak Muhammad, daripada ayah mereka, daripada Ali",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ الزُّهْرِيِّ  ، عَنْ الْحَسَنِ  ، وَعَبْدِ اللَّهِ  ابْنَيْ مُحَمَّدٍ، عَنْ أَبِيهِمَا  ، عَنْ عَلِيٍّ، أَنَّ عَلِيًّا   قَالَ لِابْنِ عَبَّاسٍ : \" نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْمُتْعَةِ النِّسَاءِ يَوْمَ خَيْبَرَ، وَعَنْ لُحُومِ الْحُمُرِ الْإِنْسِيَّةِ \"",
    "malay_translation": "Ahmad bin Abdullah mengkhabarkan kepada kami, Malik menceritakan kepada kami, daripada az-Zuhri, daripada al-Hasan dan Abdullah, anak-anak Muhammad, daripada ayah mereka, daripada Ali, bahawa Ali berkata kepada Ibnu Abbas: \"Rasulullah SAW melarang mut'ah (perkahwinan sementara) pada hari Khaibar, dan (melarang) daging keldai peliharaan.\""
  },
  {
    "id": 38821,
    "hadith_number": 1284,
    "tajuk_hadith": "Larangan Memakan Daging Keldai Peliharaan",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ هِشَامٍ  ، عَنْ ابْنِ سِيرِينَ  ، عَنْ أَنَسِ بْنِ مَالِكٍ  ، قَالَ : قَامَ رَجُلٌ يَوْمَ خَيْبَرَ، فَقَالَ : يَا رَسُولَ اللَّهِ، أُكِلَتْ الْحُمُرُ أَوْ أُفْنِيَتِ الْحُمُرُ، ثُمَّ قَالَ : يَا رَسُولَ اللَّهِ، أُفْنِيَتِ الْحُمُرُ أَوْ أُكِلَتْ الْحُمُرُ، \" فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا فَنَادَى إِنَّاللَّهَ وَرَسُولَهُ يَنْهَيَانِكُمْ عَنْ لُحُومِ الْحُمُرِ، فَإِنَّهَا رِجْسٌ \"",
    "malay_translation": "Muhammad bin Yusuf telah meriwayatkan kepada kami, daripada Sufyan, daripada Hisham, daripada Ibnu Sirin, daripada Anas bin Malik, beliau berkata: Seorang lelaki berdiri pada hari Khaibar, lalu berkata: Wahai Rasulullah, keldai telah dimakan atau keldai telah habis. Kemudian dia berkata: Wahai Rasulullah, keldai telah habis atau keldai telah dimakan. Maka Rasulullah SAW memerintahkan seorang lelaki untuk berseru: Sesungguhnya Allah dan Rasul-Nya melarang kamu daripada (memakan) daging keldai, kerana sesungguhnya ia adalah najis."
  },
  {
    "id": 38822,
    "hadith_number": 1285,
    "tajuk_hadith": "Memakan Daging Kuda Pada Zaman Rasulullah SAW di Madinah",
    "perawi_melayu": "Diriwayatkan daripada Asma' binti Abu Bakar RA",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ  ، عَنْ هِشَامِ بْنِ عُرْوَةَ  ، عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ  ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ  ، قَالَتْ :\" أَكَلْنَا لَحْمَ فَرَسٍ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْمَدِينَةِ \"",
    "malay_translation": "Ja'far bin Awn meriwayatkan kepada kami, daripada Hisham bin Urwah, daripada Fatimah binti al-Munzir, daripada Asma' binti Abu Bakar RA, beliau berkata: \"Kami telah memakan daging kuda pada zaman Rasulullah SAW di Madinah.\""
  },
  {
    "id": 38823,
    "hadith_number": 1286,
    "tajuk_hadith": "Larangan Memakan Daging Keldai Peliharaan dan Kebenaran Memakan Daging Kuda",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، عَنْ عَمْرِو بْنِ دِينَارٍ  ، عَنْ مُحَمَّدِ بْنِ عَلِيٍّ  ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ  ، قَالَ : \" نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ خَيْبَرَ عَنْلُحُومِ الْحُمُرِ الْأَهْلِيَّةِ، وَأَذِنَ فِي لُحُومِ الْخَيْلِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu An-Nu'man, telah menceritakan kepada kami Hammad bin Zaid, daripada 'Amr bin Dinar, daripada Muhammad bin 'Ali, daripada Jabir bin 'Abdillah, beliau berkata: \"Rasulullah SAW telah melarang pada hari Khaibar tentang memakan daging keldai peliharaan, dan memberi izin untuk memakan daging kuda.\""
  },
  {
    "id": 38824,
    "hadith_number": 1287,
    "tajuk_hadith": "Larangan Merampas dengan Terang-Terangan",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA bahawa Rasulullah SAW bersabda: \"Tidaklah seorang perampas melakukan perampasan secara terang-terangan di mana orang-orang mukmin memandang kepadanya, ketika dia melakukan perampasan itu, dia adalah seorang mukmin.\"",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْمُغِيرَةِ  ، حَدَّثَنَا الْأَوْزَاعِيُّ  ، حَدَّثَنِي الزُّهْرِيُّ  ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ  ، وَأَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ  ،  عَنْ أَبِي هُرَيْرَةَ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :\" لَا يَنْتَهِبُ نُهْبَةً ذَاتَ شَرَفٍ يَرْفَعُ الْمُؤْمِنُونَ فِيهَا أَبْصَارَهُمْ وَهُوَ حِينَ يَنْتَهِبُهَا مُؤْمِنٌ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu al-Mughirah, telah menceritakan kepada kami al-Auza'i, telah menceritakan kepadaku az-Zuhri, daripada Sa'id bin al-Musayyib dan Abu Salamah bin Abd ar-Rahman, daripada Abu Hurairah RA, bahawa Rasulullah SAW bersabda: \"Tidaklah seorang perampas melakukan perampasan secara terang-terangan di mana orang-orang mukmin memandang kepadanya, ketika dia melakukan perampasan itu, dia adalah seorang mukmin.\""
  },
  {
    "id": 38825,
    "hadith_number": 1288,
    "tajuk_hadith": "Larangan Merampas (al-Nuhbah)",
    "perawi_melayu": "Diriwayatkan oleh Abdurrahman bin Samurah R.A.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاق بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرِ بْنِ حَازِمٍ  ، عَنْ أَبِيهِ  ، عَنْ يَعْلَى بْنِ حَكِيمٍ  ، عَنْ أَبِي لَبِيدٍ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ  ، قَالَ : \"نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ النُّهْبَةِ \".\n قَالَ أَبُو مُحَمَّد : هَذَا فِي الْغَزْوِ إِذَا غَنِمُوا قَبْلَ أَنْ يُقْسَمَ",
    "malay_translation": "Telah menceritakan kepada kami Ishaq bin Ibrahim, telah menceritakan kepada kami Wahb bin Jarir bin Hazim, dari ayahnya, dari Ya'la bin Hakim, dari Abu Labid, dari Abdurrahman bin Samurah, dia berkata: \"Rasulullah SAW melarang dari perbuatan merampas (al-Nuhbah).\" Abu Muhammad berkata: \"Ini (larangan) dalam peperangan apabila mereka mendapatkan ghanimah sebelum dibagikan.\""
  },
  {
    "id": 38826,
    "hadith_number": 1289,
    "tajuk_hadith": "Kebolehan Memakan Bangkai Ketika Darurat Kelaparan",
    "perawi_melayu": "Abu 'Asim daripada al-Awza'i daripada Hassan bin 'Atiyyah daripada Abu Waqid",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو عَاصِمٍ  ، عَنْ الْأَوْزَاعِيِّ  ، عَنْ حَسَّانَ بْنِ عَطِيَّةَ  ، عَنْ أَبِي وَاقِدٍ  ، قَالَ : قُلْنَا : يَا رَسُولَ اللَّهِ، إِنَّا بِأَرْضٍ تَكُونُ بِهَا الْمَخْمَصَةُ، فَمَا يَحِلُّ لَنَا مِنْ الْمَيْتَةِ؟ قَالَ :\" إِذَا لَمْ تَصْطَبِحُوا، وَلَمْ تَغْتَبِقُوا، وَلَمْ تَخْتَفِئُوا بَقْلًا فَشَأْنُكُمْ بِهَا \".\nقَالَ : النَّاسُ يَقُولُونَ بِالْحَاءِ، وَهَذَا قَالَ بِالْخَاءِ",
    "malay_translation": "Telah menceritakan kepada kami Abu 'Asim, daripada al-Awza'i, daripada Hassan bin 'Atiyyah, daripada Abu Waqid, dia berkata: Kami berkata: Wahai Rasulullah, sesungguhnya kami berada di suatu bumi yang berlaku kelaparan di sana. Maka apa yang halal bagi kami daripada bangkai? Baginda bersabda: \"Apabila kamu tidak bersarapan, tidak makan malam, dan tidak menyembunyikan sayur-sayuran, maka terpulanglah kepada kamu untuk memakannya (bangkai).\" Dia berkata: Orang ramai menyebutnya dengan huruf ha', dan ini menyebutnya dengan huruf kha'."
  },
  {
    "id": 38827,
    "hadith_number": 1290,
    "tajuk_hadith": "Anjuran untuk Tidak Menghabiskan Susu Ketika Memerah",
    "perawi_melayu": "Diriwayatkan daripada Diraar bin al-Azwar",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَعْلَى  ، حَدَّثَنَا الْأَعْمَشُ  ، عَنْ يَعْقُوبَ بْنِ بَحِيرٍ  ، عَنْ ضِرَارِ بْنِ الْأَزْوَرِ  ، قَالَ : أَهْدَيْتُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِقْحَةً، فَأَمَرَنِي أَنْ أَحْلُبَهَا، فَحَلَبْتُهَا، فَجَهَدْتُ فِي حَلْبِهَا، فَقَالَ\" دَعْ دَاعِيَ اللَّبَنِ \"",
    "malay_translation": "Ya'la telah mengkhabarkan kepada kami, Al-A'mash telah meriwayatkan kepada kami, daripada Ya'qub bin Buhair, daripada Diraar bin al-Azwar, katanya: “Aku menghadiahkan seekor unta yang sedang bunting kepada Rasulullah SAW, lalu baginda menyuruhku untuk memerah susunya. Aku pun memerahnya, dan aku berusaha bersungguh-sungguh dalam memerahnya. Lalu baginda bersabda: “Tinggalkan sedikit susu untuk anak unta.”"
  },
  {
    "id": 38828,
    "hadith_number": 1291,
    "tajuk_hadith": "Larangan Membunuh Katak",
    "perawi_melayu": "Ubaidillah bin Abdul Majid meriwayatkan daripada Ibnu Abi Dzi'b, daripada Sa'id bin Khalid al-Qarizi, daripada Sa'id bin al-Musayyib, daripada Abdul Rahman bin Uthman",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ  ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ  ، عَنْ سَعِيدِ بْنِ خَالِدٍ الْقَارِظِيِّ  ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" نَهَى عَنْ قَتْلِ الضِّفْدَعِ \"",
    "malay_translation": "Ubaidillah bin Abdul Majid telah mengkhabarkan kepada kami, beliau berkata: Ibnu Abi Dzi'b telah menceritakan kepada kami, daripada Sa'id bin Khalid al-Qarizi, daripada Sa'id bin al-Musayyib, daripada Abdul Rahman bin Uthman, bahawa Rasulullah SAW melarang daripada membunuh katak."
  },
  {
    "id": 38829,
    "hadith_number": 1292,
    "tajuk_hadith": "Larangan Membunuh Empat Jenis Haiwan",
    "perawi_melayu": "Muhammad bin Yahya, daripada Abdur Razzaq, daripada Ma'mar, daripada az-Zuhri, daripada Ubaidillah bin Abdullah bin Utbah, daripada Ibnu Abbas R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى  ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ  ، أَخْبَرَنَا مَعْمَرٌ  ، عَنْ الزُّهْرِيِّ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ : \" نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْقَتْلِ أَرْبَعَةٍ مِنْ الدَّوَابِّ : النَّمْلَةِ، وَالنَّحْلَةِ، وَالْهُدْهُدِ، وَالصُّرَدِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Yahya, telah menceritakan kepada kami Abdur Razzaq, telah mengkhabarkan kepada kami Ma'mar, daripada az-Zuhri, daripada Ubaidillah bin Abdullah bin Utbah, daripada Ibnu Abbas R.A., beliau berkata: \"Rasulullah SAW melarang daripada membunuh empat jenis haiwan: semut, lebah, burung hudhud, dan burung surad.\""
  },
  {
    "id": 38830,
    "hadith_number": 1293,
    "tajuk_hadith": "Arahan Membunuh Cicak Rumah (al-Awzag)",
    "perawi_melayu": "Diriwayatkan daripada Sa'id bin al-Musayyib daripada Ummu Syarik",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ ابْنِ جُرَيْجٍ  ، عَنْ عَبْدِ الْحَمِيدِ بْنِ جُبَيْرِ بْنِ شَيْبَةَ  ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ  عَنْ أُمِّ شَرِيكٍ  ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" أَمَرَ بِقَتْلِ الْأَوْزَاغِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Asim, daripada Ibnu Juraij, daripada Abdul Hamid bin Jubair bin Syaibah, daripada Sa'id bin al-Musayyib, daripada Ummu Syarik, bahawa Nabi SAW memerintahkan untuk membunuh cicak rumah (al-Awzag)."
  },
  {
    "id": 38831,
    "hadith_number": 1294,
    "tajuk_hadith": "Larangan Terhadap Mujaththimah, Susu Al-Jallalah, dan Minum dari Mulut Bekas Air",
    "perawi_melayu": "Diriwayatkan oleh Abu Zaid: Sa'id bin Ar-Rabi', daripada Hisyam Ad-Dastawa'i, daripada Qatadah, daripada Ikrimah, daripada Ibnu Abbas, bahawa Rasulullah SAW melarang daripada Mujaththimah, susu Al-Jallalah, dan minum dari mulut bekas air.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو زَيْدٍ : سَعِيدُ بْنُ الرَّبِيعِ  ، حَدَّثَنَا هِشَامٌ الدَّسْتَوَائِيُّ  ، عَنْ قَتَادَةَ  ، عَنْ عِكْرِمَةَ  ، عَنْ ابْنِ عَبَّاسٍ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" نَهَى عَنْ الْمُجَثَّمَةِ، وَعَنْ لَبَنِ الْجَلَّالَةِ، وَأَنْ يُشْرَبَ مِنْ فِي السِّقَاءِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Zaid: Sa'id bin Ar-Rabi', telah menceritakan kepada kami Hisyam Ad-Dastawa'i, daripada Qatadah, daripada Ikrimah, daripada Ibnu Abbas, bahawa Rasulullah SAW melarang daripada Mujaththimah (yakni, menyembelih haiwan dengan mengurungnya dan menjadikannya sasaran), daripada susu Al-Jallalah (haiwan yang makan najis), dan daripada minum terus dari mulut bekas air."
  }
]
