[
  {
    "id": 38848,
    "hadith_number": 1311,
    "tajuk_hadith": "Adab Makan: Membaca Bismillah dan Makan dari Hadapan Sendiri",
    "perawi_melayu": "Diriwayatkan oleh Malik daripada Wahb bin Kaisan daripada Umar bin Abi Salamah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ وَهْبِ بْنِ كَيْسَانَ  ، عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ  ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ لَهُ :\" سَمِّ اللَّهَ وَكُلْ مِمَّا يَلِيكَ \"",
    "malay_translation": "Khalid bin Makhlad telah mengkhabarkan kepada kami, Malik telah menceritakan kepada kami, daripada Wahb bin Kaisan, daripada Umar bin Abi Salamah, bahawa Nabi SAW bersabda kepadanya: “Sebutlah nama Allah (Bismillah) dan makanlah dari apa yang dekat denganmu.”"
  },
  {
    "id": 38849,
    "hadith_number": 1312,
    "tajuk_hadith": "Adab Makan dan Menyebut Nama Allah",
    "perawi_melayu": "يزيد بن هارون, هشام, بديل, عبد الله بن عبيد بن عمير, عائشة",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا هِشَامٌ  ، عَنْ بُدَيْلٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عُمَيْرٍ  ، عَنْ عَائِشَةَ  ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْكُلُ طَعَامًا فِي سِتَّةِ نَفَرٍ مِنْ أَصْحَابِهِ، فَجَاءَ أَعْرَابِيٌّ فَأَكَلَهُ بِلُقْمَتَيْنِ، فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" أَمَا إِنَّهُ لَوْ ذَكَرَ اسْمَ اللَّهِ، لَكَفَاكُمْ، فَإِذَا أَكَلَ أَحَدُكُمْ، فَلْيَذْكُرْ اسْمَ اللَّهِ، فَإِنْ نَسِيَ أَنْ يَذْكُرَ اسْمَ اللَّهِ، فَلْيَقُلْ : بِسْمِ اللَّهِ أَوَّلَهُ وَآخِرَهُ \".\nأَخْبَرَنَا بُنْدَارٌ  ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ  ، عَنْ أَبِيهِ  ، عَنْ بُدَيْلٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عُمَيْرٍ  ، عَنْ أُمِّ كُلْثُومٍ  ، عَنْ عَائِشَةَ  ، بِهَذَا الْحَدِيثِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah mengkhabarkan kepada kami Hisyam, daripada Budail, daripada Abdullah bin Ubaid bin Umair, daripada Aisyah RA, bahawa Nabi SAW sedang makan makanan bersama enam orang sahabatnya. Kemudian datang seorang Badwi dan menghabiskannya dengan dua suapan. Nabi SAW bersabda: \"Sesungguhnya jika dia menyebut nama Allah, nescaya ia mencukupi kamu semua. Maka apabila seseorang daripada kamu makan, hendaklah dia menyebut nama Allah. Jika dia lupa untuk menyebut nama Allah, maka hendaklah dia berkata: 'Bismillah awwalahu wa akhirahu' (Dengan nama Allah pada awalnya dan akhirnya).\"\nTelah mengkhabarkan kepada kami Bundar, telah menceritakan kepada kami Muadz bin Hisyam, daripada ayahnya, daripada Budail, daripada Abdullah bin Ubaid bin Umair, daripada Ummu Kultsum, daripada Aisyah RA, dengan hadis ini."
  },
  {
    "id": 38850,
    "hadith_number": 1313,
    "tajuk_hadith": "Rasulullah SAW Menjamu Selera dengan Tharid dan Mendoakan Keberkatan",
    "perawi_melayu": "Musa bin Khalid, daripada Isa bin Yunus, daripada Safwan bin Amru, daripada Abdullah bin Busr RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُوسَى بْنُ خَالِدٍ  ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ  ، عَنْ صَفْوَانَ بْنِ عَمْرٍو  ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُسْرٍ   وَكَانَتْ لَهُ صُحْبَةٌ يَسِيرَةٌ ، قَالَ : قَالَ أَبِي لِأُمِّي : لَوْ صَنَعْتِ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَعَامًا؟ فَصَنَعَتْ ثَرِيدَةً، وَقَالَ بِيَدِهِ يُقْلِلُ، فَانْطَلَقَ أَبِي فَدَعَاهُ، فَوَضَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ عَلَى ذِرْوَتِهَا، ثُمَّ قَالَ : \" خُذُوا بِاسْمِ اللَّهِ \".\nفَأَخَذُوا مِنْ نَوَاحِيهَا، فَلَمَّا طَعِمُوا دَعَا لَهُمْ، فَقَالَ :\" اللَّهُمَّ اغْفِرْ لَهُمْ وَارْحَمْهُمْ وَبَارِكْ لَهُمْ فِي رِزْقِهِمْ \"",
    "malay_translation": "Musa bin Khalid mengkhabarkan kepada kami, daripada Isa bin Yunus, daripada Safwan bin Amru, daripada Abdullah bin Busr RA, yang memiliki sedikit persahabatan dengan Nabi SAW, berkata: Bapaku berkata kepada ibuku: 'Sekiranya engkau menyediakan makanan untuk Rasulullah SAW?' Maka ibuku menyediakan tharid (sejenis roti yang direndam dalam kuah daging). Dia (Abdullah bin Busr) memberi isyarat dengan tangannya menunjukkan sedikit. Kemudian bapaku pergi dan menjemput baginda. Rasulullah SAW meletakkan tangannya di atas puncaknya (tharid), kemudian bersabda: 'Ambillah dengan nama Allah'. Mereka pun mengambil dari sekelilingnya. Apabila mereka selesai makan, baginda mendoakan mereka, dengan bersabda: 'Ya Allah, ampunilah mereka, rahmatilah mereka, dan berkatilah rezeki mereka.'"
  },
  {
    "id": 38851,
    "hadith_number": 1314,
    "tajuk_hadith": "Doa Nabi Muhammad SAW Selepas Makan atau Minum",
    "perawi_melayu": "Diriwayatkan daripada Abu Umamah RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْقَاسِمِ الْأَسَدِيُّ  ، حَدَّثَنَا ثَوْرٌ  ، عَنْ خَالِدِ بْنِ مَعْدَانَ  ، عَنْ أَبِي أُمَامَةَ  ، قَالَ : كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَكَلَ أَوْ شَرِبَ، قَالَ :\" الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ، غَيْرَ مَكْفُورٍ، وَلَا مُوَدَّعٍ، وَلَا مُسْتَغْنًى عَنْ رَبِّنَا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin al-Qasim al-Asadi, telah menceritakan kepada kami Thaur, daripada Khalid bin Ma'dan, daripada Abu Umamah, beliau berkata: Rasulullah SAW apabila makan atau minum, baginda bersabda: \"Alhamdulillah hamdan kathiran thayyiban mubarakan fihi, ghaira makfurin, wa la muwadda'in, wa la mustaghnan 'an rabbina\" (Segala puji bagi Allah, pujian yang banyak, baik, dan diberkati padanya, tidak diingkari, tidak ditinggalkan, dan tidak dighairahkan daripada Tuhan kami)."
  },
  {
    "id": 38852,
    "hadith_number": 1315,
    "tajuk_hadith": "Keutamaan Orang yang Bersyukur Setelah Makan dan Orang yang Bersabar Ketika Berpuasa",
    "perawi_melayu": "Diriwayatkan daripada Nu'aim bin Hammad, daripada Abdul Aziz bin Muhammad, daripada Muhammad bin Abdullah bin Abi Hurrah, daripada bapa saudaranya, daripada Sinan bin Sannah, beliau berkata: Rasulullah SAW bersabda: \"Orang yang makan dan bersyukur adalah seperti orang yang berpuasa dan bersabar.\"",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا نُعَيْمُ بْنُ حَمَّادٍ  ، عَنْ عَبْدِ الْعَزِيزِ بْنِ مُحَمَّدٍ  ، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي حُرَّةَ  ، عَنْ عَمِّهِ  ، عَنْ سِنَانِ بْنِ سَنَّةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" الطَّاعِمُ الشَّاكِرُ كَالصَّائِمِ الصَّابِرِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Nu'aim bin Hammad, daripada Abdul Aziz bin Muhammad, daripada Muhammad bin Abdullah bin Abi Hurrah, daripada bapa saudaranya, daripada Sinan bin Sannah, beliau berkata: Rasulullah SAW bersabda: \"Orang yang makan dan bersyukur (kepada Allah) adalah seperti orang yang berpuasa dan bersabar (dalam menahan lapar dan dahaga).\""
  },
  {
    "id": 38853,
    "hadith_number": 1316,
    "tajuk_hadith": "Adab Makan: Menjilat Jari Selepas Makan",
    "perawi_melayu": "Diriwayatkan oleh Ishaq bin Isa, daripada Hammad bin Salamah, daripada Thabit, daripada Anas, daripada Nabi Muhammad SAW.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاق بْنُ عِيسَى  ، أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ ثَابِتٍ  ، عَنْ أَنَسٍ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" إِذَا أَكَلَ أَحَدُكُمْ، فَلْيَلْعَقْ أَصَابِعَهُ الثَّلَاثَ \"",
    "malay_translation": "Telah menceritakan kepada kami Ishaq bin Isa, telah mengkhabarkan kepada kami Hammad bin Salamah, daripada Thabit, daripada Anas, daripada Nabi SAW, baginda bersabda: \"Apabila salah seorang daripada kamu makan, maka hendaklah dia menjilat tiga jarinya.\""
  },
  {
    "id": 38854,
    "hadith_number": 1317,
    "tajuk_hadith": "Adab Makan: Menjilat Jari Setelah Makan",
    "perawi_melayu": "Diriwayatkan daripada Ibnu Abbas R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ  ، حَدَّثَنَا ابْنُ عُيَيْنَةَ  ، عَنْ عَمْرِو بْنِ دِينَارٍ  ، عَنْ عَطَاءٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :\" إِذَا أَكَلَ أَحَدُكُمْ، فَلَا يَمْسَحْ يَدَهُ حَتَّى يَلْعَقَ أَصَابِعَهُ أَوْ يُلْعِقَهَا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Amru bin Aun, telah menceritakan kepada kami Ibnu Uyainah, daripada Amru bin Dinar, daripada Ata', daripada Ibnu Abbas, bahawa Nabi SAW bersabda: \"Apabila seseorang daripada kamu makan, maka janganlah dia mengesat tangannya sehingga dia menjilat jari-jarinya atau menyuruh orang lain menjilatnya.\""
  },
  {
    "id": 38855,
    "hadith_number": 1318,
    "tajuk_hadith": "Keutamaan Menjilat Sisa Makanan di dalam Bekas",
    "perawi_melayu": "Yazid bin Harun, Abu al-Yaman al-Barra' (Mu'alla bin Rashid)",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا أَبُو الْيَمَانِ الْبَرَّاءُ وَهُوَ : مُعَلَّى بْنُ رَاشِدٍ  ، قَالَ : حَدَّثَتْنِي جَدَّتِي أُمُّ عَاصِمٍ  ، قَالَتْ : دَخَلَ عَلَيْنَا نُبَيْشَةُ   مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ نَأْكُلُ طَعَامًا، فَدَعَوْنَاهُ، فَأَكَلَ مَعَنَا، ثُمَّ قَالَ : حَدَّثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ :\" مَنْ أَكَلَ فِي قَصْعَةٍ ثُمَّ لَحِسَهَا، اسْتَغْفَرَتْ لَهُ الْقَصْعَةُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah mengkhabarkan kepada kami Abu al-Yaman al-Barra' iaitu Mu'alla bin Rashid, beliau berkata: Telah menceritakan kepadaku nenekku, Ummu 'Asim, beliau berkata: Nubaishah, maula (bekas hamba) Rasulullah SAW, masuk menemui kami ketika kami sedang makan, lalu kami menjemputnya, dan beliau makan bersama kami. Kemudian beliau berkata: Rasulullah SAW telah menceritakan kepada kami bahawa: \"Sesiapa yang makan di dalam bekas kemudian menjilatnya, maka bekas itu akan memohon ampun untuknya.\""
  },
  {
    "id": 38856,
    "hadith_number": 1319,
    "tajuk_hadith": "Adab Mengutip Makanan yang Jatuh",
    "perawi_melayu": "Diriwayatkan daripada Anas RA, Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاق بْنُ عِيسَى  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ ثَابِتٍ  ، عَنْ أَنَسٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِذَا سَقَطَتْ لُقْمَةُ أَحَدِكُمْ، فَلْيَمْسَحْ عَنْهَا التُّرَابَ، وَلْيُسَمِّ اللَّهَ، وَلْيَأْكُلْهَا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ishaq bin Isa, telah menceritakan kepada kami Hammad bin Salamah, daripada Thabit, daripada Anas RA, beliau berkata: Rasulullah SAW bersabda: \"Apabila jatuh suapan makanan salah seorang daripada kamu, maka hendaklah dia membersihkan debu daripadanya, menyebut nama Allah (Bismillah), dan memakannya.\""
  },
  {
    "id": 38857,
    "hadith_number": 1320,
    "tajuk_hadith": "Maqil bin Yasar Memakan Suapan yang Jatuh Setelah Membersihkannya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا زَكَرِيَّا بْنُ عَدِيٍّ  ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ  ، عَنْ يُونُسَ  ، عَنْ الْحَسَنِ  ، قَالَ : كَانَ مَعْقِلُ بْنُ يَسَارٍ   يَتَغَدَّى، فَسَقَطَتْ لُقْمَتُهُ، فَأَخَذَهَا فَأَمَاطَ مَا بِهَا مِنْ أَذًى، ثُمَّ أَكَلَهَا، قَالَ : فَجَعَلَ أُولَئِكَ الدَّهَاقِينُ يَتَغَامَزُونَ بِهِ، فَقَالُوا لَهُ : مَا تَرَى مَا يَقُولُ هَؤُلَاءِ الْأَعَاجِمُ، يَقُولُونَ : انْظُرُوا إِلَى مَا بَيْنَ يَدَيْهِ مِنْ الطَّعَامِ، وَإِلَى مَا يَصْنَعُ بِهَذِهِ اللُّقْمَةِ؟ فَقَالَ : إِنِّي لَمْ أَكُنْ أَدَعُ مَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِقَوْلِ هَؤُلَاءِ الْأَعَاجِمِ، \" إِنَّا كُنَّانُؤْمَرُ إِذَا سَقَطَتْ لُقْمَةُ أَحَدِنَا أَنْ يُمِيطَ مَا بِهَا مِنْ الْأَذَى، وَأَنْ يَأْكُلَهَا \"",
    "malay_translation": "Zakaria bin Adiy telah mengkhabarkan kepada kami, Yazid bin Zuraik telah meriwayatkan kepada kami, daripada Yunus, daripada Al-Hasan, beliau berkata: Maqil bin Yasar sedang makan tengah hari, lalu suapannya jatuh. Dia mengambilnya, membersihkan kotoran yang ada padanya, kemudian memakannya. Dia berkata: Maka orang-orang kaya itu mula berbisik-bisik tentangnya. Mereka berkata kepadanya: Tidakkah kamu lihat apa yang dikatakan oleh orang-orang bukan Arab ini? Mereka berkata: Lihatlah makanan yang ada di hadapannya, dan apa yang dia lakukan dengan suapan ini? Dia berkata: Sesungguhnya aku tidak akan meninggalkan apa yang aku dengar daripada Rasulullah SAW kerana kata-kata orang bukan Arab ini, \"Sesungguhnya kami diperintahkan apabila suapan salah seorang daripada kami jatuh agar menghilangkan kotoran yang ada padanya, dan memakannya.\""
  },
  {
    "id": 38858,
    "hadith_number": 1321,
    "tajuk_hadith": "Makan dan Minum dengan Tangan Kanan",
    "perawi_melayu": "Diriwayatkan oleh Abu 'Ali al-Hanafi, daripada Malik, daripada Ibn Shihab, daripada Abu Bakr bin Ubaidillah bin Abdullah bin Umar, daripada Abdullah bin Umar.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَلَّي الْحَنَفِيُّ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ ابْنِ شِهَابٍ  ، عَنْ أَبِي بَكْرِ بْنِ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ  ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" إِذَا أَكَلَ أَحَدُكُمْ، فَلْيَأْكُلْ بِيَمِينِهِ، وَلْيَشْرَبْ بِيَمِينِهِ، فَإِنَّ الشَّيْطَانَ يَأْكُلُ بِشِمَالِهِ وَيَشْرَبُ بِشِمَالِهِ \".\n أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ  ، عَنْ ابْنِ عُيَيْنَةَ  ، عَنْ الزُّهْرِيِّ  ، عَنْ أَبِي بَكْرٍ  ، عَنْ ابْنِ عُمَرَ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، بِنَحْوِهِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu 'Ali al-Hanafi, telah menceritakan kepada kami Malik, daripada Ibn Shihab, daripada Abu Bakr bin Ubaidillah bin Abdullah bin Umar, daripada Abdullah bin Umar, bahawa Rasulullah SAW bersabda: \"Apabila salah seorang daripada kamu makan, maka hendaklah dia makan dengan tangan kanannya, dan hendaklah dia minum dengan tangan kanannya, kerana sesungguhnya syaitan makan dengan tangan kirinya dan minum dengan tangan kirinya.\" Telah mengkhabarkan kepada kami 'Amru bin 'Aun, daripada Ibn 'Uyainah, daripada al-Zuhri, daripada Abu Bakr, daripada Ibn Umar, daripada Nabi SAW, dengan seumpamanya."
  },
  {
    "id": 38859,
    "hadith_number": 1322,
    "tajuk_hadith": "Makan dengan Tangan Kanan",
    "perawi_melayu": "Diriwayatkan oleh Abu Al-Walid At-Tayalisi, daripada Ikrimah bin Ammar, daripada Iyas bin Salamah, daripada ayahnya.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ  ، حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ  ، قَالَ : حَدَّثَنِي إِيَاسُ بْنُ سَلَمَةَ  ، قَالَ : حَدَّثَنِي أَبِي  ، قَالَ : أَبْصَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بُسْرَ بْنَ رَاعِي الْعِيرِ يَأْكُلُ بِشِمَالِهِ، فَقَالَ :\" كُلْ بِيَمِينِكَ \".\nقَالَ : لَا أَسْتَطِيعُ، قَالَ : \" لَا اسْتَطَعْتَ \".\nقَالَ : فَمَا وَصَلَتْ يَمِينُهُ إِلَى فِيهِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Al-Walid At-Tayalisi, telah menceritakan kepada kami Ikrimah bin Ammar, dia berkata: Telah menceritakan kepadaku Iyas bin Salamah, dia berkata: Telah menceritakan kepadaku ayahku, dia berkata: Rasulullah SAW melihat Busr bin Ra'i al-'Ir makan dengan tangan kirinya, lalu Baginda bersabda: \"Makanlah dengan tangan kananmu.\"\nDia berkata: \"Aku tidak mampu.\" Baginda bersabda: \"Semoga kamu tidak mampu.\"\nDia berkata: Maka tangannya tidak sampai ke mulutnya."
  },
  {
    "id": 38860,
    "hadith_number": 1323,
    "tajuk_hadith": "Nabi Muhammad SAW Makan Menggunakan Tiga Jari dan Menjilatnya",
    "perawi_melayu": "Muhammad bin Isa, daripada Abu Muawiyah, daripada Hisham bin Urwah, daripada Abdurrahman bin Saad al-Madani, daripada Ibnu Ka'ab bin Malik, daripada ayahnya",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى  ، حَدَّثَنَا أَبُو مُعَاوِيَةَ  ، عَنْ هِشَامِ بْنِ عُرْوَةَ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَعْدٍ الْمَدَنِيِّ  ، عَنْ ابْنِ كَعْبِ بْنِ مَالِكٍ  ، عَنْ أَبِيهِ  ، قَالَ : كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" يَأْكُلُ بِثَلَاثِ أَصَابِعَ، وَلَا يَمْسَحُ يَدَهُ حَتَّى يَلْعَقَهَا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Isa, telah menceritakan kepada kami Abu Muawiyah, daripada Hisham bin Urwah, daripada Abdurrahman bin Saad al-Madani, daripada Ibnu Ka'ab bin Malik, daripada ayahnya, dia berkata: Nabi SAW makan menggunakan tiga jari, dan tidak mengesat tangannya sehingga menjilatnya."
  },
  {
    "id": 38861,
    "hadith_number": 1324,
    "tajuk_hadith": "Nabi Muhammad S.A.W. Makan dengan Tiga Jari dan Menjilatnya Setelah Selesai",
    "perawi_melayu": "Musa bin Khalid, daripada Isa bin Yunus, daripada Hisham bin Urwah, daripada Abdurrahman bin Saad al-Madani, bahawa Abdullah bin Kaab atau Abdurrahman bin Kaab (Hisham ragu-ragu) menceritakan kepadanya, daripada ayahnya, bahawa Nabi SAW makan dengan tiga jarinya dan menjilat jarinya setelah selesai.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ خَالِدٍ  ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ  ، عَنْ هِشَامِ بْنِ عُرْوَةَ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَعْدٍ الْمَدَنِيِّ  ، أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبٍ  أَوْ عَبْدَ الرَّحْمَنِ بْنَ كَعْبٍ  شَكَّ هِشَامٌ أَخْبَرَهُ، عَنْ أَبِيهِ  ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ\" يَأْكُلُ بِأَصَابِعِهِ الثَّلَاثِ، فَإِذَا فَرَغَ، لَعِقَهَا \"، وَأَشَارَ هِشَامٌ بِأَصَابِعِهِ الثَّلَاثِ",
    "malay_translation": "Telah menceritakan kepada kami Musa bin Khalid, telah menceritakan kepada kami Isa bin Yunus, daripada Hisham bin Urwah, daripada Abdurrahman bin Saad al-Madani, bahawa Abdullah bin Kaab atau Abdurrahman bin Kaab (Hisham ragu-ragu) menceritakan kepadanya, daripada ayahnya, bahawa Nabi S.A.W. dahulu \"makan dengan tiga jarinya, dan apabila selesai, baginda menjilatnya.\" Hisham memberikan isyarat dengan tiga jarinya."
  },
  {
    "id": 38862,
    "hadith_number": 1325,
    "tajuk_hadith": "Memuliakan Jiran, Bercakap Baik atau Diam, dan Memuliakan Tetamu",
    "perawi_melayu": "Yazid bin Harun, Muhammad bin Ishaq, Said bin Abi Said, daripada Abi Syuraih al-Khuza'i",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاق  ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ  ، عَنْ أَبِي شُرَيْحٍ الْخُزَاعِيِّ  ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ :\" مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ، فَلْيُكْرِمْ جَارَهُ ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ، فَلْيَقُلْ خَيْرًا، أَوْ لِيَصْمُتْ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ، فَلْيُكْرِمْ ضَيْفَهُ، جَائِزَتَهُ يَوْمًا وَلَيْلَةً، وَالضِّيَافَةُ ثَلَاثَةُ أَيَّامٍ وَمَا بَعْدَ ذَلِكَ صَدَقَةٌ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah menceritakan kepada kami Muhammad bin Ishaq, daripada Said bin Abi Said, daripada Abi Syuraih al-Khuza'i, beliau berkata: Aku mendengar Rasulullah SAW bersabda: \"Barangsiapa yang beriman kepada Allah dan hari akhirat, maka hendaklah dia memuliakan jirannya. Barangsiapa yang beriman kepada Allah dan hari akhirat, maka hendaklah dia berkata yang baik atau diam. Barangsiapa yang beriman kepada Allah dan hari akhirat, maka hendaklah dia memuliakan tetamunya, dengan jamuan istimewa sehari semalam, dan layanan sebagai tetamu selama tiga hari. Dan selebihnya adalah sedekah.\""
  },
  {
    "id": 38863,
    "hadith_number": 1326,
    "tajuk_hadith": "Kewajipan Memuliakan Tetamu, Berbuat Baik kepada Jiran, dan Bercakap Baik atau Diam",
    "perawi_melayu": "Uthman bin Muhammad",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُثْمَانُ بْنُ مُحَمَّدٍ  ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ  ، عَنْ عَمْرِو بْنِ دِينَارٍ  ، قَالَ : سَمِعْتُ نَافِعَ بْنَ جُبَيْرٍ  ، عَنْ أَبِي شُرَيْحٍ الْخُزَاعِيِّ  ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :\" مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ، فَلْيُكْرِمْ ضَيْفَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ، فَلْيُحْسِنْ إِلَى جَارِهِ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ، فَلْيَقُلْ خَيْرًا أَوْ لِيَسْكُتْ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Uthman bin Muhammad, telah menceritakan kepada kami Sufyan bin Uyainah, daripada Amru bin Dinar, beliau berkata: Aku mendengar Nafi' bin Jubair, daripada Abu Syuraih al-Khuza'i, bahawa Rasulullah SAW bersabda: \"Sesiapa yang beriman kepada Allah dan hari akhirat, maka hendaklah dia memuliakan tetamunya; dan sesiapa yang beriman kepada Allah dan hari akhirat, maka hendaklah dia berbuat baik kepada jirannya; dan sesiapa yang beriman kepada Allah dan hari akhirat, maka hendaklah dia berkata yang baik atau diam.\""
  },
  {
    "id": 38864,
    "hadith_number": 1327,
    "tajuk_hadith": "Kewajiban Membantu Tetamu yang Dinafikan Haknya",
    "perawi_melayu": "Diriwayatkan daripada al-Miqdam bin Ma'di Karib, Abu Karimah, bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ أَبِي الْجُودِيِّ  ، عَنْ سَعِيدِ بْنِ الْمُهَاجِرِ  ، عَنْ الْمِقْدَامِ بْنِ مَعْدِي كَرِبَ : أَبِي كَرِيمَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" أَيُّمَا مُسْلِمٍ ضَافَ قَوْمًا، فَأَصْبَحَ الضَّيْفُ مَحْرُومًا، فَإِنَّ عَلَى كُلِّ مُسْلِمٍ نَصْرَهُ حَتَّى يَأْخُذَ لَهُ بِقِرَى لَيْلَتِهِ مِنْ زَرْعِهِ وَمَالِهِ \"",
    "malay_translation": "\"Sesiapa sahaja Muslim yang menerima tetamu, kemudian tetamu itu mendapati dirinya dinafikan haknya (tidak dijamu dengan sepatutnya), maka wajib ke atas setiap Muslim untuk membantunya sehingga dia mendapatkan haknya untuk dijamu pada malam itu daripada hasil tanaman dan hartanya (orang yang sepatutnya menjamu).\""
  },
  {
    "id": 38865,
    "hadith_number": 1328,
    "tajuk_hadith": "Lalat Jatuh Dalam Minuman: Penawar dan Penyakit",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ  ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ  ، عَنْ عُتْبَةَ بْنِ مُسْلِمٍ  ، أَنَّ عُبَيْدَ بْنَ حُنَيْنٍ  أَخْبَرَهُ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ  ، يَقُولُ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِذَا سَقَطَ الذُّبَابُ فِي شَرَابِ أَحَدِكُمْ، فَلْيَغْمِسْهُ كُلَّهُ ثُمَّ لِيَنْزِعْهُ، فَإِنَّ فِي أَحَدِ جَنَاحَيْهِ دَاءً، وَفِي الْآخَرِ شِفَاءً \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abdullah bin Maslamah, telah menceritakan kepada kami Sulaiman bin Bilal, daripada Utbah bin Muslim, bahawa Ubaid bin Hunain telah mengkhabarkannya, bahawa dia mendengar Abu Hurairah R.A. berkata: Rasulullah SAW bersabda: \"Apabila lalat jatuh ke dalam minuman salah seorang daripada kamu, maka hendaklah dia mencelupkannya seluruhnya kemudian mengeluarkannya, kerana sesungguhnya pada salah satu sayapnya terdapat penyakit, dan pada sayap yang lain terdapat penawar.\" "
  },
  {
    "id": 38866,
    "hadith_number": 1329,
    "tajuk_hadith": "Lalat Jatuh dalam Bekas: Penawar pada Salah Satu Sayapnya",
    "perawi_melayu": "Sulaiman bin Harb meriwayatkan daripada Hammad bin Salamah, daripada Thumamah bin Abdullah bin Anas, daripada Abu Hurairah, daripada Nabi SAW.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ ثُمَامَةَ بْنِ عَبْدِ اللَّهِ بْنِ أَنَسٍ  ، عَنْ أَبِي هُرَيْرَةَ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" إِذَا وَقَعَ الذُّبَابُ فِي إِنَاءِ أَحَدِكُمْ، فَلْيَغْمِسْهُ، فَإِنَّ فِي أَحَدِ جَنَاحَيْهِ دَاءً، وَفِي الْآخَرِ شِفَاءً \".\n قَالَ أَبُو مُحَمَّد : قَالَ غَيْرُ  حَمَّادٍ  : ثُمَامَةُ  ، عَنْ أَنَسٍ  ، مَكَانَ أَبِي هُرَيْرَةَ . وَقَوْمٌ  يَقُولُونَ : عَنْ الْقَعْقَاع  ، عَنْ أَبِي هُرَيْرَةَ  ، وَحَدِيثُ عُبَيْدِ بْنِ حُنَيْنٍ أَصَحُّ",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Hammad bin Salamah, daripada Thumamah bin Abdullah bin Anas, daripada Abu Hurairah, daripada Nabi SAW, baginda bersabda: \"Apabila lalat jatuh ke dalam bekas salah seorang daripada kamu, maka celupkanlah ia (lalat itu), kerana sesungguhnya pada salah satu sayapnya terdapat penyakit, dan pada sayap yang lain terdapat penawar.\"\nAbu Muhammad berkata: Selain daripada Hammad berkata: Thumamah, daripada Anas, menggantikan Abu Hurairah. Dan kaum mengatakan: Daripada al-Qa'qa', daripada Abu Hurairah, dan Hadis Ubaid bin Hunain adalah lebih sahih."
  },
  {
    "id": 38867,
    "hadith_number": 1330,
    "tajuk_hadith": "Perbezaan Makan Orang Mukmin dan Orang Kafir",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ ابْنِ جُرَيْجٍ  ، عَنْ أَبِي الزُّبَيْرِ  ، عَنْ جَابِرٍ   رَضِيَ اللهِ عَنْهُ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" الْمُؤْمِنُ يَأْكُلُ فِي مِعًى وَاحِدٍ، وَالْكَافِرُ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ \".\n أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ  ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ  ، عَنْ عُبَيْدِ اللَّهِ  ، حَدَّثَنِي نَافِعٌ  ، عَنْ ابْنِ عُمَرَ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.\nوَحَدَّثَنِي يَحْيَى  ، عَنْ مُجَالِدٍ  ، عَنْ أَبِي الْوَدَّاكِ  ، عَنْ أَبِي سَعِيدٍ   ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu 'Asim, daripada Ibn Juraij, daripada Abu Zubair, daripada Jabir RA, daripada Nabi SAW, baginda bersabda: \"Orang mukmin makan dengan satu usus, dan orang kafir makan dengan tujuh usus.\" Telah mengkhabarkan kepada kami Ubaidillah bin Umar al-Qawariri, telah menceritakan kepada kami Yahya bin Said, daripada Ubaidillah, telah menceritakan kepadaku Nafi', daripada Ibn Umar, daripada Nabi SAW. Dan telah menceritakan kepadaku Yahya, daripada Mujalid, daripada Abu al-Waddak, daripada Abu Said, daripada Nabi SAW."
  },
  {
    "id": 38868,
    "hadith_number": 1331,
    "tajuk_hadith": "Perbezaan Makan Orang Mukmin dan Orang Kafir",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA, daripada Nabi SAW",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي يَحْيَى  ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو  ، عَنْ أَبِي سَلَمَةَ  ، عَنْ أَبِي هُرَيْرَةَ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" الْمُؤْمِنُ يَأْكُلُ فِي مِعًى وَاحِدٍ، وَالْكَافِرُ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ \"",
    "malay_translation": "Telah menceritakan kepadaku Yahya, daripada Muhammad bin Amru, daripada Abu Salamah, daripada Abu Hurairah RA, daripada Nabi SAW, baginda bersabda: \"Orang mukmin makan dengan satu perut, manakala orang kafir makan dengan tujuh perut.\""
  },
  {
    "id": 38869,
    "hadith_number": 1332,
    "tajuk_hadith": "Makanan yang Mencukupi: Seorang untuk Dua, Dua untuk Empat, Empat untuk Lapan",
    "perawi_melayu": "Diriwayatkan dari Jabir, dari Nabi SAW",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ ابْنِ جُرَيْجٍ  ، عَنْ أَبِي الزُّبَيْرِ  ، عَنْ جَابِرٍ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" طَعَامُ الْوَاحِدِ يَكْفِي الِاثْنَيْنِ، وَطَعَامُ الِاثْنَيْنِ يَكْفِي الْأَرْبَعَةَ، وَطَعَامُ الْأَرْبَعَةِ يَكْفِي ثَمَانِيَةً \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Asim, daripada Ibn Juraij, daripada Abu Zubair, daripada Jabir, daripada Nabi SAW, baginda bersabda: \"Makanan seorang cukup untuk dua orang, makanan dua orang cukup untuk empat orang, dan makanan empat orang cukup untuk lapan orang.\""
  },
  {
    "id": 38870,
    "hadith_number": 1333,
    "tajuk_hadith": "Adab Makan Menurut Sunnah Nabi",
    "perawi_melayu": "Diriwayatkan dari Umar bin Abi Salamah bahawa Nabi SAW bersabda kepadanya:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ وَهْبِ بْنِ كَيْسَانَ  ، عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ  ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ لَهُ :\" سَمِّ اللَّهَ وَكُلْ مِمَّا يَلِيكَ \"",
    "malay_translation": "''Sebutlah nama Allah (Bismillah) dan makanlah apa yang dekat denganmu.'"
  },
  {
    "id": 38871,
    "hadith_number": 1334,
    "tajuk_hadith": "Makan dari Tepi Bekas Makanan dan Keberkatan Turun di Tengahnya",
    "perawi_melayu": "Sa'id bin 'Amir, daripada Syu'bah, daripada 'Ata' bin as-Sa'ib, daripada Sa'id bin Jubair, daripada Ibn 'Abbas",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ  ، عَنْ شُعْبَةَ  ، عَنْ عَطَاءِ بْنِ السَّائِبِ  ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِجَفْنَةٍ، أَوْ قَالَ : قَصْعَةٍ مِنْ ثَرِيدٍ فَقَالَ :\" كُلُوا مِنْ حَافَاتِهَا أَوْ قَالَ : جَوَانِبِهَا وَلَا تَأْكُلُوا مِنْ وَسَطِهَا، فَإِنَّ الْبَرَكَةَ تَنْزِلُ فِي وَسَطِهَا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Sa'id bin 'Amir, daripada Syu'bah, daripada 'Ata' bin as-Sa'ib, daripada Sa'id bin Jubair, daripada Ibn 'Abbas, bahawa Rasulullah SAW dibawakan dengan satu bekas besar, atau dia berkata: pinggan besar yang berisi tharid (roti yang direndam dalam kuah daging). Baginda bersabda: \"Makanlah dari tepi-tepinya atau dia berkata: sisi-sisinya dan janganlah kamu makan dari tengahnya, kerana sesungguhnya keberkatan itu turun di tengahnya.\""
  },
  {
    "id": 38872,
    "hadith_number": 1335,
    "tajuk_hadith": "Menutup Makanan Panas untuk Keberkatan",
    "perawi_melayu": "Diriwayatkan oleh Abdurrahman bin Ibrahim Ad-Dimasyqi, daripada Ibnu Wahb, daripada Qurrah bin Abdurrahman, daripada Az-Zuhri, daripada Urwah, daripada Asma' binti Abu Bakar",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ  ، حَدَّثَنَا ابْنُ وَهْبٍ  ، عَنْ قُرَّةَ بْنِ عَبْدِ الرَّحْمَنِ  ، عَنْ الزُّهْرِيِّ  ، عَنْ عُرْوَةَ  ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ  ، أَنَّهَا كَانَتْ إِذَا أُتِيَتْ بِثَرِيدٍ، أَمَرَتْ بِهِ فَغُطِّيَ حَتَّى يَذْهَبَ فَوْرَةُ دُخَانِهِ، وَتَقُولُ : إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" هُوَ أَعْظَمُ لِلْبَرَكَةِ \"",
    "malay_translation": "Asma' binti Abu Bakar RA, apabila dihidangkan dengan *tharid* (sejenis roti yang direndam dalam kuah), beliau akan memerintahkan agar ia ditutup sehingga hilang wap panasnya. Beliau berkata: “Sesungguhnya aku mendengar Rasulullah SAW bersabda: “Ia lebih besar keberkatannya.”"
  },
  {
    "id": 38873,
    "hadith_number": 1336,
    "tajuk_hadith": "Nabi Muhammad SAW Memakan Roti dengan Cuka",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا الْمُثَنَّى بْنُ سَعِيدٍ  ، حَدَّثَنَا طَلْحَةُ بْنُ نَافِعٍ  : أَبُو سُفْيَانَ، حَدَّثَنَا جَابِرُ بْنُ عَبْدِ اللَّهِ  ، قَالَ : أَخَذَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِي ذَاتَ يَوْمٍ إِلَى مَنْزِلِهِ، فَقَالَ : \" هَلْ مِنْ غَدَاءٍ أَوْ مِنْ عَشَاءٍ؟ \" شَكَّ طَلْحَةُ.\n قَالَ : فَأَخْرَجَ إِلَيْهِ فِلَقٌ مِنْ خُبْزٍ، فَقَالَ : \" مَا مِنْ أُدْمٍ؟ \" قَالُوا : لَا، إِلَّا شَيْءٌ مِنْ خَلٍّ، فَقَالَ : \" هَاتُوهُ،فَنِعْمَ الْإِدَامُ الْخَلُّ \".\nقَالَ جَابِرٌ : فَمَا زِلْتُ أُحِبُّ الْخَلَّ مُنْذُ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.\nفَقَالَ أَبُو سُفْيَانَ : فَمَا زِلْتُ أُحِبُّهُ مُنْذُ سَمِعْتُهُ مِنْ جَابِرٍ",
    "malay_translation": "Yazid bin Harun memberitahu kami, Al-Muthanna bin Said memberitahu kami, Talhah bin Nafi' menceritakan kepada kami: Abu Sufyan, Jabir bin Abdullah menceritakan kepada kami, dia berkata: Nabi SAW memegang tanganku pada suatu hari ke rumahnya, lalu bersabda: \"Adakah makanan tengah hari atau makanan malam?\" Talhah ragu-ragu.\nDia berkata: Lalu dia mengeluarkan sepotong roti kepadanya, lalu bersabda: \"Adakah lauk?\" Mereka berkata: Tidak, kecuali sedikit cuka, lalu bersabda: \"Bawakanlah, sebaik-baik lauk adalah cuka.\"\nJabir berkata: Maka aku sentiasa menyukai cuka sejak aku mendengarnya daripada Rasulullah SAW.\nAbu Sufyan berkata: Maka aku sentiasa menyukainya sejak aku mendengarnya daripada Jabir."
  },
  {
    "id": 38874,
    "hadith_number": 1337,
    "tajuk_hadith": "Cuka adalah Sebaik-baik Lauk",
    "perawi_melayu": "Yahya bin Hassan",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى بْنُ حَسَّانَ  ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ  ، عَنْ هِشَامِ بْنِ عُرْوَةَ  ، عَنْ أَبِيهِ  ، عَنْ عَائِشَةَ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ، قَالَ :\" نِعْمَ الْإِدَامُ أَوْ الْأُدْمُ الْخَلُّ \"",
    "malay_translation": "Telah menceritakan kepadaku Yahya bin Hassan, telah menceritakan kepada kami Sulaiman bin Bilal, dari Hisham bin Urwah, dari ayahnya, dari Aisyah, dari Nabi SAW, baginda bersabda: \"Sebaik-baik lauk (atau kuah) adalah cuka.\""
  },
  {
    "id": 38875,
    "hadith_number": 1338,
    "tajuk_hadith": "Nabi Muhammad SAW Memakan Labu dalam Sup",
    "perawi_melayu": "Diriwayatkan daripada Anas RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ إِسْحَاق بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ  ،  عَنْ أَنَسٍ  ، قَالَ : \" رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِمَرَقَةٍ فِيهَا دُبَّاءٌ وَقَدِيدٌ، فَرَأَيْتُهُيَتَتَبَّعُ الدُّبَّاءَ يَأْكُلُهُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Nu'aim, telah menceritakan kepada kami Malik, daripada Ishaq bin Abdullah bin Abi Talhah, daripada Anas RA, beliau berkata: \"Aku melihat Nabi SAW dihidangkan dengan sup yang mengandungi labu dan daging yang dikeringkan. Aku melihat baginda mencari-cari labu tersebut dan memakannya.\""
  },
  {
    "id": 38876,
    "hadith_number": 1339,
    "tajuk_hadith": "Nabi Muhammad SAW Menggemari Labu",
    "perawi_melayu": "Diriwayatkan daripada Anas RA: \"Nabi SAW menyukai labu.\"",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْأَسْوَدُ بْنُ عَامِرٍ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ قَتَادَةَ  ، عَنْ أَنَسٍ  ، قَالَ : \" كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَيُعْجِبُهُ الْقَرْعُ \".\nقَالَ : فَقُدِّمَ إِلَيْهِ، فَجَعَلْتُ أَتَنَاوَلُهُ وَأَجْعَلُهُ بَيْنَ يَدَيْهِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Al-Aswad bin Amir, telah menceritakan kepada kami Syu'bah, daripada Qatadah, daripada Anas RA, beliau berkata: \"Nabi SAW sangat menggemari labu.\" Anas berkata: \"Lalu dihidangkan labu kepada baginda, maka aku pun mengambilnya dan meletakkannya di hadapan baginda.\""
  },
  {
    "id": 38877,
    "hadith_number": 1340,
    "tajuk_hadith": "Anjuran Memakan, Menjadikan Lauk, dan Menggunakan Minyak Zaitun",
    "perawi_melayu": "Diriwayatkan oleh Abu Nu'aim, daripada Sufyan, daripada Abdullah bin Isa, daripada Ata', daripada Abi Usaid al-Ansari",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى  ، عَنْ عَطَاءٍ  وَلَيْسَ بِابْنِ أَبِي رَبَاحٍ ، عَنْ أَبِي أَسِيدٍ الْأَنْصَارِيِّ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" كُلُوا الزَّيْتَ فَإِنَّهُ مُبَارَكٌ، وَائْتَدِمُوا بِهِ، وَادَّهِنُوا بِهِ، فَإِنَّهُ يَخْرُجُ مِنْ شَجَرَةٍ مُبَارَكَةٍ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Nu'aim, telah menceritakan kepada kami Sufyan, daripada Abdullah bin Isa, daripada Ata' (bukan Ibn Abi Rabah), daripada Abi Usaid al-Ansari, beliau berkata: Rasulullah SAW bersabda: \"Makanlah minyak zaitun, kerana sesungguhnya ia adalah berkat, jadikanlah ia sebagai lauk, dan berlumurlah dengannya, kerana sesungguhnya ia keluar daripada pohon yang berkat.\""
  },
  {
    "id": 38878,
    "hadith_number": 1341,
    "tajuk_hadith": "Larangan Mendatangi Masjid Setelah Makan Bawang Putih",
    "perawi_melayu": "Diriwayatkan daripada Musaddad, daripada Yahya bin Sa'id, daripada Ubaidillah, yang mengkhabarkan kepadaku daripada Nafi', daripada Ibnu Umar, bahawa Nabi SAW bersabda ketika Perang Khaibar: \"Sesiapa yang makan daripada pohon ini (iaitu bawang putih), maka janganlah dia mendatangi masjid.\"",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ  ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ  ، عَنْ عُبَيْدِ اللَّهِ  ، أَخْبَرَنِي نَافِعٌ  ، عَنْ ابْنِ عُمَرَ  ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ فِي غَزْوَةِ خَيْبَرَ :\" مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ يَعْنِي : الثُّومَ، فَلَا يَأْتِيَنَّ الْمَسَاجِدَ \"",
    "malay_translation": "Diriwayatkan oleh Musaddad, telah menceritakan kepada kami Yahya bin Sa'id, daripada Ubaidillah, telah mengkhabarkan kepadaku Nafi', daripada Ibnu Umar, bahawa Nabi SAW bersabda dalam peperangan Khaibar: \"Sesiapa yang makan dari pohon ini - iaitu bawang putih - maka janganlah dia mendekati masjid.\""
  },
  {
    "id": 38879,
    "hadith_number": 1342,
    "tajuk_hadith": "Rasulullah SAW Tidak Memakan Makanan yang Mengandungi Sayuran Tertentu kerana Bimbang Mengganggu Malaikat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ  ، حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ أَبِي يَزِيدَ  ، عَنْ أَبِيهِ  ، أَنَّ أُمَّ أَيُّوبَ   أَخْبَرَتْهُ، قَالَتْ : نَزَلَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَكَلَّفْنَا لَهُ طَعَامًا فِيهِ شَيْءٌ مِنْ بَعْضِ هَذِهِ الْبُقُولِ، فَلَمَّا أَتَيْنَاهُ بِهِ كَرِهَهُ، وَقَالَ لِأَصْحَابِهِ :\" كُلُوهُ، فَإِنِّي لَسْتُ كَأَحَدٍ مِنْكُمْ، إِنِّي أَخَافُ أَنْ أُوذِيَ صَاحِبِي \".\nقَالَ أَبُو مُحَمَّد : إِذَا لَمْ يُؤْذِ أَحَدًا، فَلَا بَأْسَ بِأَكْلِهِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Ali bin Abdullah, telah menceritakan kepada kami Sufyan bin Uyainah, telah menceritakan kepadaku Ubaidullah bin Abi Yazid, daripada ayahnya, bahawa Ummu Ayyub telah mengkhabarkannya, dia berkata: Rasulullah SAW telah turun (berkunjung) kepada kami, lalu kami menyediakan untuk baginda makanan yang mengandungi sedikit daripada sayuran ini. Ketika kami membawanya kepada baginda, baginda tidak menyukainya dan berkata kepada para sahabatnya: \"Makanlah, kerana aku tidak seperti salah seorang daripada kamu. Sesungguhnya aku bimbang akan menyakiti sahabatku (malaikat).\". Abu Muhammad berkata: Jika tidak menyakiti seseorang, maka tidak mengapa memakannya."
  },
  {
    "id": 38880,
    "hadith_number": 1343,
    "tajuk_hadith": "Anjuran Makan Daging Ayam Berdasarkan Amalan Rasulullah SAW",
    "perawi_melayu": "Abdullah bin Sa'id, daripada Ibnu 'Ulayyah, daripada Ayyub, daripada al-Qasim at-Tamimi, daripada Zahdam al-Jarmi",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ  ، حَدَّثَنَا ابْنُ عُلَيَّةَ  ، عَنْ أَيُّوبَ  ، عَنْ الْقَاسِمِ التَّمِيمِيِّ  ، عَنْ زَهْدَمٍ الْجَرْمِيِّ  ، قَالَ : كُنَّا عِنْدَ أَبِي مُوسَى فَقُدِّمَ طَعَامُهُ، فَقُدِّمَ فِي طَعَامِهِ لَحْمُ دَجَاجٍ، وَفِي الْقَوْمِ رَجُلٌ مِنْ بَنِي تَيْمِ اللَّهِ أَحْمَرُ، فَلَمْ يَدْنُ، فَقَالَ لَهُ أَبُو مُوسَى   : \" ادْنُ، فَإِنِّي قَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَيَأْكُلُ مِنْهُ \"",
    "malay_translation": "Abdullah bin Sa'id mengkhabarkan kepada kami, Ibnu 'Ulayyah meriwayatkan kepada kami, daripada Ayyub, daripada al-Qasim at-Tamimi, daripada Zahdam al-Jarmi, beliau berkata: Kami berada di sisi Abu Musa, lalu dihidangkan makanan kepadanya. Dalam hidangannya terdapat daging ayam. Di antara kaum itu ada seorang lelaki dari Bani Taimillah yang berkulit merah, namun dia tidak mendekat. Maka Abu Musa berkata kepadanya: “Mendekatlah, kerana aku telah melihat Rasulullah SAW memakannya.”"
  },
  {
    "id": 38881,
    "hadith_number": 1344,
    "tajuk_hadith": "Rasulullah S.A.W. Memakan Ayam",
    "perawi_melayu": "Muhammad bin Yusuf, daripada Sufyan, daripada Ayyub, daripada Abi Qilabah, daripada Zahdam al-Jarmi, daripada Abi Musa",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ أَيُّوبَ  ، عَنْ أَبِي قِلَابَةَ  ، عَنْ زَهْدَمٍ الْجَرْمِيِّ  ، عَنْ أَبِي مُوسَى  ، أَنَّهُذَكَرَ الدَّجَاجَ، فَقَالَ : \" رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُهُ \"",
    "malay_translation": "Muhammad bin Yusuf mengkhabarkan kepada kami, daripada Sufyan, daripada Ayyub, daripada Abi Qilabah, daripada Zahdam al-Jarmi, daripada Abi Musa, bahawa dia menyebut tentang ayam, lalu berkata: \"Aku melihat Rasulullah SAW memakannya.\""
  },
  {
    "id": 38882,
    "hadith_number": 1345,
    "tajuk_hadith": "Larangan Bersahabat Kecuali dengan Mukmin dan Memberi Makan Kecuali kepada Orang Bertakwa",
    "perawi_melayu": "Diriwayatkan daripada Abu Sa'id al-Khudri RA, bahawa beliau mendengar Nabi SAW bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ  ، حَدَّثَنَا حَيْوَةُ  ، حَدَّثَنَا سَالِمُ بْنُ غَيْلَانَ  : أَنَّ الْوَلِيدَ بْنَ قَيْسٍ  أَخْبَرَهُ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ  ، أَوْ عَنْ أَبِي الْهَيْثَمِ  ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ  ، أَنَّهُ سَمِعَ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ :\" لَا تَصْحَبْ إِلَّا مُؤْمِنًا، وَلَا يَأْكُلْ طَعَامَكَ إِلَّا تَقِيٌّ \"",
    "malay_translation": "\"Janganlah kamu bersahabat melainkan dengan seorang mukmin, dan janganlah memakan makananmu melainkan orang yang bertakwa.\""
  },
  {
    "id": 38883,
    "hadith_number": 1346,
    "tajuk_hadith": "Rasulullah S.A.W. Makan Timun dengan Kurma Muda",
    "perawi_melayu": "Diriwayatkan daripada Abdullah bin Ja'far R.A., beliau berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى  ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ  ، عَنْ أَبِيهِ  ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ  ، قَالَ : \" رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَيَأْكُلُ الْقِثَّاءَ بِالرُّطَبِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Isa, telah menceritakan kepada kami Ibrahim bin Sa'ad, daripada bapanya, daripada Abdullah bin Ja'far, beliau berkata: \"Aku melihat Rasulullah S.A.W. memakan timun dengan kurma muda.\""
  },
  {
    "id": 38884,
    "hadith_number": 1347,
    "tajuk_hadith": "Larangan Memakan Kurma Secara Berlebihan Tanpa Izin",
    "perawi_melayu": "Abu al-Walid al-Tayalisi",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ  ، حَدَّثَنَا شُعْبَةُ  ، حَدَّثَنَا جَبَلَةُ بْنُ سُحَيْمٍ  ، قَالَ : كُنَّا بِالْمَدِينَةِ ، فَأَصَابَتْنَا سَنَةٌ، فَكَانَ ابْنُ الزُّبَيْرِ يَرْزُقُ التَّمْرَ، وَكَانَ ابْنُ عُمَرَ   يَمُرُّ بِنَا وَيَقُولُ : لَا تُقَارِنُوا، فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" نَهَى عَنْ الْقِرَانِ، إِلَّا أَنْ يَسْتَأْذِنَ الرَّجُلُ أَخَاهُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu al-Walid al-Tayalisi, telah menceritakan kepada kami Syu'bah, telah menceritakan kepada kami Jabalah bin Suhaim, beliau berkata: Kami berada di Madinah, lalu kami ditimpa kemarau. Ibnu Zubair memberikan rezeki berupa kurma. Ibnu Umar lalu di hadapan kami dan berkata: Janganlah kamu makan kurma secara berlebihan (dua biji sekali makan), kerana Rasulullah SAW melarang daripada makan kurma secara berlebihan, kecuali jika seseorang itu meminta izin daripada saudaranya."
  },
  {
    "id": 38885,
    "hadith_number": 1348,
    "tajuk_hadith": "Keutamaan Kurma di Rumah",
    "perawi_melayu": "Diriwayatkan daripada Aisyah RA, isteri Nabi SAW",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ  ، حَدَّثَنَا يَعْقُوبُ بْنُ مُحَمَّدِ بْنِ طَحْلَاءَ  ، عَنْ أَبِي الرِّجَالِ  ، عَنْ أُمِّهِ عَمْرَةَ  ، عَنْ عَائِشَةَ   زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ : \" يَا عَائِشَةُ ،بَيْتٌ لَا تَمْرَ فِيهِ جِيَاعٌ أَهْلُهُ أَوْ جَاعَ أَهْلُهُ \" مَرَّتَيْنِ أَوْ ثَلَاثًا",
    "malay_translation": "Telah mengkhabarkan kepada kami Abdullah bin Maslamah, telah menceritakan kepada kami Yaqub bin Muhammad bin Tahlah, daripada Abi ar-Rijal, daripada ibunya Amrah, daripada Aisyah RA, isteri Nabi SAW, bahawa Rasulullah SAW bersabda: \"Wahai Aisyah, rumah yang tidak ada kurma di dalamnya, penghuninya akan lapar atau merasa lapar\" (dua atau tiga kali)."
  },
  {
    "id": 38886,
    "hadith_number": 1349,
    "tajuk_hadith": "Keutamaan Kurma di Dalam Rumah Tangga",
    "perawi_melayu": "Yahya bin Hassan meriwayatkan daripada Sulaiman bin Bilal, daripada Hisham bin Urwah, daripada ayahnya, daripada Aisyah R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ  ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ  ، عَنْ هِشَامِ بْنِ عُرْوَةَ  ، عَنْ أَبِيهِ  ، عَنْ عَائِشَةَ  ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :\" لَا يَجُوعُ أَهْلُ بَيْتٍ عِنْدَهُمْ التَّمْرُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yahya bin Hassan, telah menceritakan kepada kami Sulaiman bin Bilal, daripada Hisham bin Urwah, daripada ayahnya, daripada Aisyah R.A., bahawa Nabi ﷺ bersabda: \"Tidak akan lapar ahli rumah yang di dalamnya ada kurma.\""
  },
  {
    "id": 38887,
    "hadith_number": 1350,
    "tajuk_hadith": "Hadiah Kurma kepada Nabi Muhammad SAW",
    "perawi_melayu": "Abu Nu'aim",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا مُصْعَبُ بْنُ سُلَيْمٍ  ، قَالَ : سَمِعْتُ أَنَسَ بْنَ مَالِكٍ   يَقُولُ :\" أُهْدِيَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَمْرٌ فَأَخَذَ يُهَدِّيهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Mus'ab bin Sulaim, dia berkata: Saya mendengar Anas bin Malik berkata: \"Kurma telah dihadiahkan kepada Nabi SAW, lalu Baginda mula membahagikannya.\""
  },
  {
    "id": 38888,
    "hadith_number": 1351,
    "tajuk_hadith": "Rasulullah S.A.W. Makan Kurma dalam Keadaan Terdesak Kerana Kelaparan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "وَقَالَ : \" رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَيَأْكُلُ تَمْرًا مُقْعِيًا مِنْ الْجُوعِ \".\nقَالَ أَبُو مُحَمَّد : يُهَدِّيهِ : يَعْنِي : يُرْسِلُهُ هَهُنَا وَهَهُنَا",
    "malay_translation": "Dan dia berkata: \"Saya melihat Rasulullah S.A.W. makan kurma dalam keadaan *muq'iyan* (duduk dengan bertumpu pada punggung dan lutut diangkat) kerana kelaparan.\" Abu Muhammad berkata: \"*Yuhaddihi* (menghadiahkannya): iaitu mengirimkannya ke sana dan ke sini.\""
  },
  {
    "id": 38889,
    "hadith_number": 1352,
    "tajuk_hadith": "Anjuran Membersihkan Tangan Selepas Makan",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ  ، عَنْ خَالِدٍ  ، عَنْ سُهَيْلٍ  ، عَنْ أَبِيهِ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَنْ نَامَ وَفِي يَدِهِ رِيحُ غَمَرٍ فَعَرَضَ لَهُ عَارِضٌ، فَلَا يَلُومَنَّ إِلَّا نَفْسَهُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami 'Amru bin 'Aun, daripada Khalid, daripada Suhail, daripada ayahnya, daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: \"Sesiapa yang tidur dalam keadaan tangannya berbau makanan (yang belum dibersihkan), kemudian dia ditimpa sesuatu (musibah), maka janganlah dia menyalahkan kecuali dirinya sendiri.\""
  },
  {
    "id": 38890,
    "hadith_number": 1353,
    "tajuk_hadith": "Anjuran Mengadakan Walimah Walaupun dengan Seekor Kambing",
    "perawi_melayu": "Diriwayatkan daripada Anas RA bahawa Nabi SAW bersabda kepada Abdul Rahman bin Auf RA ketika melihat kesan kekuningan padanya: \"Apakah ini?\" Beliau menjawab: \"Saya telah berkahwin.\" Baginda bersabda: \"Adakanlah walimah walaupun dengan seekor kambing.\"",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا حُمَيْدٌ  ، عَنْ أَنَسٍ  ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ لِعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، وَرَأَى عَلَيْهِ وَضَرًا مِنْ صُفْرَةٍ : \" مَهْيَمْ؟ \" قَالَ : تَزَوَّجْتُ، قَالَ :\" أَوْلِمْ وَلَوْ بِشَاةٍ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah mengkhabarkan kepada kami Humaid, daripada Anas RA, bahawa Nabi SAW bersabda kepada Abdul Rahman bin Auf RA, dan Baginda melihat kesan kekuningan padanya: \"Apakah ini?\" Beliau menjawab: \"Saya telah berkahwin.\" Baginda bersabda: \"Adakanlah walimah walaupun dengan seekor kambing.\""
  },
  {
    "id": 38891,
    "hadith_number": 1354,
    "tajuk_hadith": "Hukum Walimah: Hari Pertama Hak, Hari Kedua Ma'ruf, Hari Ketiga Sum'ah dan Riya'",
    "perawi_melayu": "Afan, Hammam, Qatadah, daripada Al-Hasan, daripada Abdullah bin Uthman al-Thaqafi, daripada seorang lelaki dari Thaqif yang buta sebelah mata, yang dikenali sebagai Ma'ruf (atau mungkin Zuhair bin Uthman).",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَفَّانُ  ، حَدَّثَنَا هَمَّامٌ  ، حَدَّثَنَا قَتَادَةُ  ، عَنْ الْحَسَنِ  ، عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ الثَّقَفِيِّ  ، عَنْ رَجُلٍ  مِنْ ثَقِيفَ أَعْوَرَ، قَالَ : كَانَ يُقَالُ لَهُ مَعْرُوفٌ : أَيْ يُثْنَى عَلَيْهِ خَيْرٌ إِنْ لَمْ يَكُنْ اسْمُهُ زُهَيْرَ بْنَ عُثْمَانَ  ، فَلَا أَدْرِي مَا اسْمُهُ ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :\" الْوَلِيمَةُ أَوَّلَ يَوْمٍ حَقٌّ، وَالثَّانِيَ مَعْرُوفٌ، وَالثَّالِثَ سُمْعَةٌ وَرِيَاءٌ \".\nقَالَ قَتَادَةُ  : وَحَدَّثَنِي رَجُلٌ  ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ  ، أَنَّهُ دُعِيَ أَوَّلَ يَوْمٍ فَأَجَابَ، وَدُعِيَ الْيَوْمَ الثَّانِيَ فَأَجَابَ، وَدُعِيَ الْيَوْمَ الثَّالِثَ فَحَصَبَ الرَّسُولَ وَلَمْ يُجِبْهُ، وَقَالَ : \" أَهْلُ سُمْعَةٍ وَرِيَاءٍ \"",
    "malay_translation": "Afan telah mengkhabarkan kepada kami, Hammam telah menceritakan kepada kami, Qatadah telah menceritakan kepada kami, daripada Al-Hasan, daripada Abdullah bin Uthman al-Thaqafi, daripada seorang lelaki dari Thaqif yang buta sebelah mata, yang dikatakan bernama Ma'ruf (iaitu, dia dipuji dengan kebaikan jika namanya bukan Zuhair bin Uthman - saya tidak tahu namanya), bahawa Nabi SAW bersabda: \"Walimah pada hari pertama adalah hak, pada hari kedua adalah ma'ruf (kebaikan), dan pada hari ketiga adalah sum'ah (kemasyhuran) dan riya' (menunjuk-nunjuk).\"\n\nQatadah berkata: Dan seorang lelaki menceritakan kepadaku, daripada Said bin al-Musayyib, bahawa dia dijemput pada hari pertama dan dia menjawab (jemputan itu), dan dia dijemput pada hari kedua dan dia menjawab, dan dia dijemput pada hari ketiga lalu dia melemparkan batu kepada utusan dan tidak menjawabnya, dan dia berkata: \"Mereka adalah orang-orang yang sum'ah dan riya'.\""
  },
  {
    "id": 38892,
    "hadith_number": 1355,
    "tajuk_hadith": "Makanan Walimah yang Buruk dan Kewajipan Menghadiri Jemputan",
    "perawi_melayu": "Abu Al-Mughirah, daripada Al-Awza'i, daripada Az-Zuhri, daripada Al-A'raj, daripada Abu Hurairah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْمُغِيرَةِ  ، حَدَّثَنَا الْأَوْزَاعِيُّ  ، عَنْ الزُّهْرِيِّ  ، عَنْ الْأَعْرَجِ  ، عَنْ أَبِي هُرَيْرَةَ  ، أَنَّهُ قَالَ :\" شَرُّ الطَّعَامِ طَعَامُ الْوَلِيمَةِ، يُدْعَى إِلَيْهِ الْأَغْنِيَاءُ، وَيُتْرَكُ الْمَسَاكِينُ، وَمَنْ تَرَكَ الدَّعْوَةَ، فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Al-Mughirah, telah menceritakan kepada kami Al-Awza'i, daripada Az-Zuhri, daripada Al-A'raj, daripada Abu Hurairah, bahawa beliau berkata: “Seburuk-buruk makanan adalah makanan walimah, di mana orang-orang kaya dijemput, dan orang-orang miskin ditinggalkan. Dan sesiapa yang meninggalkan jemputan, maka sesungguhnya dia telah menderhakai Allah dan Rasul-Nya.”"
  },
  {
    "id": 38893,
    "hadith_number": 1356,
    "tajuk_hadith": "Rasulullah S.A.W Menerima Jemputan Setelah Memastikan Isteri Juga Dijemput",
    "perawi_melayu": "Diriwayatkan daripada Anas R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ سُلَيْمَانَ  ، عَنْ سُلَيْمَانَ بْنِ الْمُغِيرَةِ  ، عَنْ ثَابِتٍ  ، عَنْ أَنَسٍ  ، قَالَ : جَاءَ رَجُلٌ قَدْ صَنَعَ طَعَامًا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ : يَا رَسُولَ اللَّهِ، هَكَذَا وَأَوْمَأَ إِلَيْهِ بِيَدِهِ، قَالَ : يَقُولُ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : هَكَذَا، وَأَشَارَ إِلَى عَائِشَةَ ، قَالَ : لَا، فَأَعْرَضَ عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَأَوْمَأَ إِلَيْهِ الثَّانِيَةَ : وَأَوْمَأَ إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَأَعْرَضَ عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَأَوْمَأَ إِلَيْهِ الثَّالِثَةَ، فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" وَهَذِهِ؟ \" قَالَ : نَعَمْ، فَانْطَلَقَ مَعَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَعَائِشَةُفَأَكَلَا مِنْ طَعَامِهِ \"",
    "malay_translation": "Sa'id bin Sulaiman memberitahu kami, daripada Sulaiman bin al-Mughirah, daripada Thabit, daripada Anas, katanya: Seorang lelaki datang kepada Rasulullah SAW yang telah menyediakan makanan, lalu berkata: \"Wahai Rasulullah, begini,\" sambil memberi isyarat dengan tangannya. Anas berkata: Rasulullah SAW bersabda kepadanya: \"Begini,\" sambil menunjuk kepada Aisyah. Lelaki itu berkata: \"Tidak.\" Maka Rasulullah SAW berpaling daripadanya. Lelaki itu memberi isyarat kali kedua, dan Rasulullah SAW berpaling daripadanya. Lelaki itu memberi isyarat kali ketiga, lalu Rasulullah SAW bersabda kepadanya: \"Dan ini (Aisyah)?\" Lelaki itu berkata: \"Ya.\" Maka Rasulullah SAW dan Aisyah pergi bersamanya dan makan daripada makanannya."
  },
  {
    "id": 38894,
    "hadith_number": 1357,
    "tajuk_hadith": "Adab Menjemput Rasulullah SAW dan Etika Tetamu Tambahan",
    "perawi_melayu": "Muhammad bin Yusuf, daripada Sufyan, daripada Al-A'mash, daripada Abi Wa'il, daripada Abi Mas'ud",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ الْأَعْمَشِ  ، عَنْ أَبِي وَائِلٍ  ، عَنْ أَبِي مَسْعُودٍ  ، قَالَ : كَانَ رَجُلٌ يُقَالُ لَهُ أَبُو شُعَيْبٍ، وَكَانَ لَهُ غُلَامٌ لَحَّامٌ، فَقَالَ : اصْنَعْ لِي طَعَامًا أَدْعُو رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَامِسَ خَمْسَةٍ.\nقَالَ : فَدَعَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَامِسَ خَمْسَةٍ، فَتَبِعَهُمْ رَجُلٌ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" إِنَّكَدَعَوْتَنَا خَامِسَ خَمْسَةٍ، وَهَذَا رَجُلٌ قَدْ تَبِعَنِي، فَإِنْ شِئْتَ أَذِنْتَ لَهُ، وَإِنْ شِئْتَ تَرَكْتَهُ \".\nقَالَ : فَأَذِنَ لَهُ",
    "malay_translation": "Muhammad bin Yusuf mengkhabarkan kepada kami, daripada Sufyan, daripada Al-A'mash, daripada Abi Wa'il, daripada Abi Mas'ud, beliau berkata: Ada seorang lelaki bernama Abu Syu'aib, dan dia mempunyai seorang hamba yang bekerja sebagai penjual daging. Dia berkata: Sediakanlah makanan untukku, aku ingin menjemput Rasulullah SAW sebagai orang kelima daripada lima orang.\n\nBeliau berkata: Lalu dia menjemput Rasulullah SAW sebagai orang kelima daripada lima orang, kemudian seorang lelaki mengikuti mereka. Rasulullah SAW bersabda: 'Sesungguhnya engkau menjemput kami sebagai orang kelima daripada lima orang, dan lelaki ini telah mengikuti aku. Jika engkau mahu, engkau boleh mengizinkannya (untuk turut serta), dan jika engkau mahu, engkau boleh meninggalkannya (tidak mengizinkannya).'\n\nBeliau berkata: Lalu dia mengizinkannya."
  },
  {
    "id": 38895,
    "hadith_number": 1358,
    "tajuk_hadith": "Keutamaan Aisyah berbanding wanita lain",
    "perawi_melayu": "Diriwayatkan daripada Anas RA, Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ  ، حَدَّثَنَا خَالِدٌ  ، عَنْ أَبِي طُوَالَةَ : عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ مَعْمَرٍ  ، عَنْ أَنَسٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" فَضْلُ عَائِشَةَ عَلَى النِّسَاءِ، كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ \"",
    "malay_translation": "\"Keutamaan Aisyah berbanding wanita-wanita lain adalah seperti keutamaan bubur (ath-Tharid) berbanding makanan-makanan lain.\""
  },
  {
    "id": 38896,
    "hadith_number": 1359,
    "tajuk_hadith": "Anjuran Memakan Daging dengan Mengoyaknya",
    "perawi_melayu": "Diriwayatkan oleh Ali bin al-Madini, daripada Sufyan, daripada Abdul Karim: Abu Umayyah, berkata: Abdullah bin al-Harith bin Naufal berkata:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ الْمَدِينِيِّ  ، حَدَّثَنَا سُفْيَانُ  ، حَدَّثَنَا عَبْدُ الْكَرِيمِ : أَبُو أُمَيَّةَ  ، قَالَ : قَالَ عَبْدُ اللَّهِ بْنُ الْحَارِثِ بْنِ نَوْفَلٍ  : زَوَّجَنِي أَبِي فِي إِمَارَةِ عُثْمَانَ، فَدَعَا رَهْطًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَكَانَ فِيمَنْ دَعَا صَفْوَانُ بْنُ أُمَيَّةَ   وَهُوَ شَيْخٌ كَبِيرٌ، فَقَالَ : إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" انْهَسُوا اللَّحْمَ نَهْسًا، فَإِنَّهُ أَشْهَى وَأَمْرَأُ \"",
    "malay_translation": "Bapaku menikahkan aku pada zaman pemerintahan Uthman, lalu beliau menjemput sekumpulan sahabat Rasulullah SAW. Antara yang dijemput ialah Safwan bin Umayyah, seorang yang tua. Beliau berkata: Sesungguhnya Rasulullah SAW bersabda: \"Makanlah daging dengan mengoyaknya, kerana sesungguhnya ia lebih lazat dan mudah dihadam.\""
  },
  {
    "id": 38897,
    "hadith_number": 1360,
    "tajuk_hadith": "Larangan Makan Sambil Bersandar",
    "perawi_melayu": "Diriwayatkan oleh Abu Nu'aim, daripada Sufyan, daripada Ali bin al-Aqmar, daripada Abu Juhaifah, bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ عَلِيِّ بْنِ الْأَقْمَرِ  ، حَدَّثَنِي أَبُو جُحَيْفَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَا آكُلُ مُتَّكِئًا \"",
    "malay_translation": "\"Aku tidak makan sambil bersandar.\""
  },
  {
    "id": 38898,
    "hadith_number": 1361,
    "tajuk_hadith": "Doa Keberkatan untuk Buah-buahan dan Madinah",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا نُعَيْمُ بْنُ حَمَّادٍ  ، عَنْ عَبْدِ الْعَزِيزِ بْنِ مُحَمَّدٍ  ، عَنْ سُهَيْلٍ  ، عَنْ أَبِيهِ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أُتِيَ بِالْبَاكُورَةِ بِأَوَّلِ الثَّمَرَةِ، قَالَ :\" اللَّهُمَّ بَارِكْ لَنَا فِي مَدِينَتِنَا ، وَفِي ثَمَرَتِنَا، وَفِي مُدِّنَا، وَفِي صَاعِنَا بَرَكَةً مَعَ بَرَكَةٍ \"، ثُمَّ يُعْطِيهِ أَصْغَرَ مَنْ يَحْضُرُهُ مِنْ الْوِلْدَانِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Nu'aim bin Hammad, daripada Abdul Aziz bin Muhammad, daripada Suhail, daripada ayahnya, daripada Abu Hurairah R.A., beliau berkata: Adalah Rasulullah SAW apabila dibawakan kepada baginda buah pertama (dari hasil tanaman), baginda berdoa: \"Ya Allah, berkatilah kami di Madinah kami, dan pada buah-buahan kami, dan pada *Mudd* kami, dan pada *Sa'* kami dengan keberkatan di atas keberkatan.\" Kemudian baginda memberikannya kepada anak kecil yang hadir."
  },
  {
    "id": 38899,
    "hadith_number": 1362,
    "tajuk_hadith": "Adab Terhadap Pembantu Rumah yang Membawa Makanan",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA, Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْلَى  ، حَدَّثَنَا إِسْمَاعِيل بْنُ أَبِي خَالِدٍ  ، عَنْ أَبِيهِ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِذَا جَاءَ خَادِمُ أَحَدِكُمْ بِالطَّعَامِ، فَلْيُجْلِسْهُ، فَإِنْ أَبَى، فَلْيُنَاوِلْهُ \"",
    "malay_translation": "Telah menceritakan kepada kami Ya'la, telah menceritakan kepada kami Ismail bin Abi Khalid, daripada ayahnya, daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: \"Apabila pembantu rumah salah seorang daripada kamu datang membawa makanan, maka hendaklah dia (majikan) mendudukkan pembantu itu (untuk makan bersama). Jika dia (pembantu) enggan, maka hendaklah dia (majikan) menghulurkan (sebahagian makanan) kepadanya.\""
  },
  {
    "id": 38900,
    "hadith_number": 1363,
    "tajuk_hadith": "Adab Terhadap Pembantu Rumah: Berkongsi Makanan atau Memberi Secebis Makanan",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA, daripada Nabi SAW",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ  ، قَالَ : سَمِعْتُ أَبَا هُرَيْرَةَ   يُحَدِّثُ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" إِذَا أَتَى أَحَدَكُمْ خَادِمُهُ بِطَعَامٍ، فَلْيُجْلِسْهُ مَعَهُ، أَوْ لَيُنَاوِلْهُ لُقْمَةً أَوْ لُقْمَتَيْنِ، أَوْ أُكْلَةً أَوْ أُكْلَتَيْنِ، فَإِنَّهُ وَلِيَ حَرَّهُ وَدُخَانَهُ \"",
    "malay_translation": "Telah menceritakan kepada kami Abul Walid, telah menceritakan kepada kami Syu'bah, daripada Muhammad bin Ziyad, dia berkata: Saya mendengar Abu Hurairah RA meriwayatkan daripada Nabi SAW, baginda bersabda: \"Apabila seseorang daripada kamu didatangi oleh pembantunya dengan membawa makanan, maka hendaklah dia mendudukkannya bersama-samanya, atau memberinya sesuap atau dua suap, atau secebis atau dua cebis (makanan), kerana dialah yang menanggung kepanasannya (api) dan asapnya.\""
  },
  {
    "id": 38901,
    "hadith_number": 1364,
    "tajuk_hadith": "Kegemaran Rasulullah SAW Terhadap Manisan dan Madu",
    "perawi_melayu": "Diriwayatkan daripada Aisyah R.A.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ  ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ  ، عَنْ هِشَامِ بْنِ عُرْوَةَ  ، عَنْ أَبِيهِ  ،  عَنْ عَائِشَةَ   رَضِيَ اللَّهُ عَنْهَا، قَالَتْ : \" كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَيُحِبُّ الْحَلْوَاءَ وَالْعَسَلَ \"",
    "malay_translation": "Telah menceritakan kepada kami Farwah bin Abi Al-Maghra', telah menceritakan kepada kami Ali bin Mushir, daripada Hisyam bin Urwah, daripada ayahnya, daripada Aisyah R.A., beliau berkata: \"Rasulullah SAW menyukai manisan dan madu.\""
  },
  {
    "id": 38902,
    "hadith_number": 1365,
    "tajuk_hadith": "Nabi ﷺ Tidak Berwuduk Setelah Keluar dari Tempat Buang Air untuk Makan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قَبِيصَةُ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ عَمْرِو بْنِ دِينَارٍ  ، عَنْ سَعِيدِ بْنِ أَبِي الْحُوَيْرِثِ  ،  عَنْ ابْنِ عَبَّاسٍ  ، قَالَ : خَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْبِرَازِ فَقُدِّمَ إِلَيْهِ طَعَامٌ، فَقِيلَ لَهُ : أَلَا تَوَضَّأُ؟ قَالَ : فَقَالَ :\" أُصَلِّي فَأَتَوَضَّأُ؟ \".\nقَالَ أَبُو مُحَمَّد : إِنَّمَا هُوَ سَعِيدُ بْنُ الْحُوَيْرِثِ .\nحَدَّثَنَا أَبُو نُعَيْمٍ  ، عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ  ، عَنْ عَمْرِو بْنِ دِينَارٍ  ، عَنْ سَعِيدِ بْنِ الْحُوَيْرِثِ  ، عَنْ ابْنِ عَبَّاسٍ  .\nقَالَ : وَسَمِعْتُ أَبَا عَاصِمٍ  يُحَدِّثُ، عَنْ ابْنِ جُرَيْجٍ  ، عَنْ عَمْرِو بْنِ دِينَارٍ  ، عَنْ سَعِيدِ بْنِ الْحُوَيْرِثِ  ، عَنْ ابْنِ عَبَّاسٍ  ، بِإِسْنَادِهِ",
    "malay_translation": "Telah menceritakan kepada kami Qabishah, telah menceritakan kepada kami Sufyan, daripada 'Amru bin Dinar, daripada Sa'id bin Abi al-Huwayrith, daripada Ibnu Abbas RA, beliau berkata: Nabi ﷺ keluar dari tempat buang air, lalu dihidangkan makanan kepada baginda. Maka dikatakan kepada baginda: Tidakkah engkau berwuduk? Baginda bersabda: \"Adakah aku akan solat sehingga aku perlu berwuduk?\". Abu Muhammad berkata: Sesungguhnya dia adalah Sa'id bin al-Huwayrith.\nTelah menceritakan kepada kami Abu Nu'aim, daripada Sufyan bin 'Uyainah, daripada 'Amru bin Dinar, daripada Sa'id bin al-Huwayrith, daripada Ibnu Abbas RA.\nBeliau berkata: Dan aku mendengar Abu 'Asim meriwayatkan, daripada Ibnu Juraij, daripada 'Amru bin Dinar, daripada Sa'id bin al-Huwayrith, daripada Ibnu Abbas RA, dengan isnadnya."
  },
  {
    "id": 38903,
    "hadith_number": 1366,
    "tajuk_hadith": "Rasulullah SAW Berwuduk Sebelum Makan atau Tidur Setelah Berjunub",
    "perawi_melayu": "Diriwayatkan daripada Aisyah RA",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَهْلُ بْنُ حَمَّادٍ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ الْحَكَمِ  ، قَالَ : سَمِعْتُ إِبْرَاهِيمَ  يُحَدِّثُ، عَنْ الْأَسْوَدِ  ، عَنْ عَائِشَةَ  ، قَالَتْ : \" كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَإِذَا أَجْنَبَ فَأَرَادَ أَنْ يَأْكُلَ أَوْ يَنَامَ، تَوَضَّأَ \"",
    "malay_translation": "Telah menceritakan kepada kami Sahl bin Hammad, telah menceritakan kepada kami Syu'bah, daripada Al-Hakam, dia berkata: Saya mendengar Ibrahim menceritakan, daripada Al-Aswad, daripada Aisyah RA, dia berkata: \"Rasulullah SAW apabila berjunub, lalu baginda ingin makan atau tidur, baginda berwuduk.\" "
  },
  {
    "id": 38904,
    "hadith_number": 1367,
    "tajuk_hadith": "Pesanan Nabi: Memasak Sup dan Berbagi dengan Jiran",
    "perawi_melayu": "Diriwayatkan daripada Abu Dzar RA, beliau berkata: Kekasihku SAW berpesan kepadaku, dengan bersabda: \"Apabila engkau memasak sup, maka perbanyakkanlah airnya, kemudian lihatlah ahli rumah daripada jiranmu, maka cedokkanlah untuk mereka daripadanya.\"",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ  ، عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ  ، عَنْ أَبِي ذَرٍّ  ، قَالَ : أَوْصَانِي خَلِيلِي صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ :\" إِذَا طَبَخْتَ مَرَقَةً ، فَأَكْثِرْ مَاءَهَا، ثُمَّ انْظُرْ أَهْلَ بَيْتٍ مِنْ جِيرَانِكَ، فَاغْرِفْ لَهُمْ مِنْهَا \"",
    "malay_translation": "Abu Nu'aim telah mengkhabarkan kepada kami, Syu'bah telah meriwayatkan kepada kami, daripada Abu Imran al-Jauni, daripada Abdullah bin as-Samit, daripada Abu Dzar RA, beliau berkata: Kekasihku SAW berpesan kepadaku, dengan bersabda: \"Apabila engkau memasak sup, maka perbanyakkanlah airnya, kemudian lihatlah ahli rumah daripada jiranmu, maka cedokkanlah untuk mereka daripadanya.\""
  },
  {
    "id": 38905,
    "hadith_number": 1368,
    "tajuk_hadith": "Melegakan Kaki Ketika Makan",
    "perawi_melayu": "Muhammad bin Sa'id, daripada 'Uqbah bin Khalid, daripada Musa bin Muhammad bin Ibrahim, daripada bapanya, daripada Anas bin Malik",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَعِيدٍ  ، حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ  ، عَنْ مُوسَى بْنِ مُحَمَّدِ بْنِ إِبْرَاهِيمَ  ، حَدَّثَنِي أَبِي  ، عَنْ أَنَسِ بْنِ مَالِكٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِذَا وُضِعَ الطَّعَامُ، فَاخْلَعُوا نِعَالَكُمْ، فَإِنَّهُ أَرْوَحُ لِأَقْدَامِكُمْ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Sa'id, telah menceritakan kepada kami 'Uqbah bin Khalid, daripada Musa bin Muhammad bin Ibrahim, telah menceritakan kepadaku oleh bapaku, daripada Anas bin Malik, beliau berkata: Rasulullah SAW bersabda: \"Apabila makanan telah dihidangkan, maka tanggalkanlah kasut kamu, kerana sesungguhnya ia lebih melegakan kaki kamu.\""
  },
  {
    "id": 38906,
    "hadith_number": 1369,
    "tajuk_hadith": "Mengabdikan Diri kepada Ar-Rahman, Menyebarkan Salam, dan Memberi Makan",
    "perawi_melayu": "Diriwayatkan daripada Abdullah bin 'Amr, Rasulullah SAW bersabda: \"Sembahlah Ar-Rahman, sebarkan salam, dan berilah makan, nescaya kamu akan masuk syurga.\"",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ مُوسَى  ، حَدَّثَنَا جَرِيرٌ  ، عَنْ عَطَاءِ بْنِ السَّائِبِ  ، عَنْ أَبِيهِ  ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" اعْبُدُوا الرَّحْمَنَ، وَأَفْشُوا السَّلَامَ، وَأَطْعِمُوا الطَّعَامَ، تَدْخُلُوا الْجِنَانَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ibrahim bin Musa, telah menceritakan kepada kami Jarir, daripada 'Ata' bin as-Sa'ib, daripada ayahnya, daripada Abdullah bin 'Amr, beliau berkata: Rasulullah SAW bersabda: \"Sembahlah Ar-Rahman, sebarkan salam, dan berilah makan, nescaya kamu akan masuk syurga.\""
  },
  {
    "id": 38907,
    "hadith_number": 1370,
    "tajuk_hadith": "Menyambut Jemputan",
    "perawi_melayu": "Al-Hakam bin Al-Mubarak meriwayatkan daripada Abdul Aziz bin Muhammad, daripada Musa bin Uqbah, daripada Nafi', daripada Ibnu Umar",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ  ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ  ، عَنْ مُوسَى بْنِ عُقْبَةَ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :\" أَجِيبُوا الدَّاعِيَ إِذَا دُعِيتُمْ \".\nقَالَ : وَكَانَ عَبْدُ اللَّهِ يَأْتِي الدَّعْوَةَ فِي الْعُرْسِ، وَفِي غَيْرِ الْعُرْسِ، وَيَأْتِيهَا وَهُوَ صَائِمٌ",
    "malay_translation": "Al-Hakam bin Al-Mubarak telah mengkhabarkan kepada kami, katanya: Abdul Aziz bin Muhammad telah menceritakan kepada kami, daripada Musa bin Uqbah, daripada Nafi', daripada Ibnu Umar, bahawa Rasulullah SAW bersabda: \"Penuhilah jemputan apabila kamu dijemput.\" Beliau berkata: Dan Abdullah (Ibnu Umar) menghadiri jemputan perkahwinan dan selain perkahwinan, dan beliau menghadirinya dalam keadaan berpuasa."
  },
  {
    "id": 38908,
    "hadith_number": 1371,
    "tajuk_hadith": "Hukum Tikus Jatuh ke Dalam Minyak Samin",
    "perawi_melayu": "Diriwayatkan daripada Maimunah R.A., bahawa Rasulullah SAW ditanya tentang seekor tikus yang jatuh ke dalam minyak samin. Baginda bersabda: \"Buanglah tikus itu dan (minyak samin) di sekelilingnya, dan makanlah (minyak samin yang selebihnya).\".",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا سُفْيَانُ  ، حَدَّثَنَا الزُّهْرِيُّ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ  ، عَنْ ابْنِ عَبَّاسٍ  ، عَنْ مَيْمُونَةَ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ فَأْرَةٍ وَقَعَتْ فِي السَمْنٍ فَقَالَ :\" أَلْقُوهَا وَمَا حَوْلَهَا، وَكُلُوا \".\nأَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ ابْنِ عُيَيْنَةَ  ، بِإِسْنَادِهِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Ali bin Abdullah, telah menceritakan kepada kami Sufyan, telah menceritakan kepada kami az-Zuhri, daripada Ubaidullah bin Abdullah, daripada Ibnu Abbas, daripada Maimunah, bahawa Rasulullah SAW ditanya tentang seekor tikus yang jatuh ke dalam minyak samin. Baginda bersabda: \"Buanglah tikus itu dan (minyak samin) di sekelilingnya, dan makanlah (minyak samin yang selebihnya).\". Telah mengkhabarkan kepada kami Muhammad bin Yusuf, daripada Ibnu Uyainah, dengan sanadnya."
  },
  {
    "id": 38909,
    "hadith_number": 1372,
    "tajuk_hadith": "Hukum Tikus Jatuh dan Mati dalam Mentega",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ ابْنِ شِهَابٍ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ : سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ فَأْرَةٍ وَقَعَتْ فِي سَمْنٍ فَمَاتَتْ، فَقَالَ :\" خُذُوهَا وَمَا حَوْلَهَا فَاطْرَحُوهُ \".\nحَدَّثَنَا زَيْدُ بْنُ يَحْيَى  ، حَدَّثَنَا مَالِكٌ  ، عَنْ ابْنِ شِهَابٍ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ  ، عَنْ ابْنِ عَبَّاسٍ  ، عَنْ مَيْمُونَةَ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، نَحْوَهُ.\nقَالَ أَبُو مُحَمَّد : إِذَا كَانَ ذَائِبًا أُهَرِيقَ",
    "malay_translation": "Telah menceritakan kepada kami Khalid bin Makhlad, telah menceritakan kepada kami Malik, dari Ibnu Syihab, dari Ubaidillah bin Abdullah, dari Ibnu Abbas, dia berkata: Nabi SAW ditanya tentang seekor tikus yang jatuh ke dalam mentega lalu mati. Baginda bersabda: \"Ambillah tikus itu dan apa yang ada di sekelilingnya, lalu buanglah ia.\"\n\nTelah menceritakan kepada kami Zaid bin Yahya, telah menceritakan kepada kami Malik, dari Ibnu Syihab, dari Ubaidillah bin Abdullah, dari Ibnu Abbas, dari Maimunah, dari Nabi SAW, dengan hadis yang serupa.\n\nAbu Muhammad berkata: Jika mentega itu cair, maka tumpahkanlah (buanglah) ia."
  },
  {
    "id": 38910,
    "hadith_number": 1373,
    "tajuk_hadith": "Adab Makan: Berkumur dan Menelan Sisa Makanan",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، حَدَّثَنَا ثَوْرُ بْنُ يَزِيدَ  ، حَدَّثَنَا حُصَيْنٌ الْحِمْيَرِيُّ  ، أَخْبَرَنِي أَبُو سَعْدٍ الْخَيْرُ  ، عَنْ أَبِي هُرَيْرَةَ   رَضِيَ اللَّهُ تَعَالَى عَنْهُ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَنْ أَكَلَ، فَلْيَتَخَلَّلْ، فَمَا تَخَلَّلَ، فَلْيَلْفِظْهُ، وَمَا لَاكَ بِلِسَانِهِ، فَلْيَبْتَلِعْ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Asim, telah menceritakan kepada kami Thaur bin Yazid, telah menceritakan kepada kami Husain al-Himyari, telah mengkhabarkan kepadaku Abu Sa'd al-Khair, daripada Abu Hurairah R.A., beliau berkata: Rasulullah SAW bersabda: \"Sesiapa yang makan, maka hendaklah dia berkumur, apa yang keluar dari celah-celah gigi, maka hendaklah dia meludahkannya, dan apa yang dia kunyah dengan lidahnya, maka hendaklah dia menelannya.\""
  }
]
