[
  {
    "id": 38911,
    "hadith_number": 1374,
    "tajuk_hadith": "Pilihan Nabi SAW: Susu Lambang Fitrah",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ  ، حَدَّثَنَا شُعَيْبٌ  ، عَنْ الزُّهْرِيِّ  ، قَالَ : أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيِّبِ  ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ  ، يَقُولُ :\" أُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةَ أُسْرِيَ بِهِ بِإِيلْيَاءَ بِقَدَحَيْنِ مِنْ خَمْرٍ وَلَبَنٍ، فَنَظَرَ إِلَيْهِمَا ثُمَّ أَخَذَ اللَّبَنَ، فَقَالَ جِبْرِيلُ : الْحَمْدُ لِلَّهِ الَّذِي هَدَاكَ لِلْفِطْرَةِ، لَوْ أَخَذْتَ الْخَمْرَ، غَوَتْ أُمَّتُكَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Al-Hakam bin Nafi', telah menceritakan kepada kami Syu'aib, daripada Az-Zuhri, dia berkata: Telah mengkhabarkan kepadaku Sa'id bin Al-Musayyib, bahawa dia mendengar Abu Hurairah RA berkata: \"Nabi SAW telah didatangi pada malam Isra' di Ilya' (Baitulmaqdis) dengan dua buah bekas, satu berisi arak dan satu lagi berisi susu. Baginda melihat kepada kedua-duanya kemudian mengambil susu. Maka Jibril berkata: 'Segala puji bagi Allah yang telah memberikan hidayah kepadamu kepada fitrah. Jika kamu mengambil arak, nescaya sesatlah umatmu.'"
  },
  {
    "id": 38912,
    "hadith_number": 1375,
    "tajuk_hadith": "Pengharaman Arak dan Tindakan Sahabat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، حَدَّثَنَا ثَابِتٌ  ، عَنْ أَنَسٍ  ، قَالَ : كُنْتُ سَاقِيَ الْقَوْمِ فِي مَنْزِلِ أَبِي طَلْحَةَ، قَالَ : فَنَزَلَ تَحْرِيمُ الْخَمْرِ، قَالَ : فَأَمَرَ مُنَادِيًا فَنَادَى، فَقَالَ أَبُو طَلْحَةَ : اخْرُجْ فَانْظُرْ مَا هَذَا.\nقَالَ : فَخَرَجْتُ فَقُلْتُ : هَذَا مُنَادٍ يُنَادِي : \" أَلَا إِنَّالْخَمْرَ قَدْ حُرِّمَتْ \".\nفَقَالَ لِيَ : اذْهَبْ فَأَهْرِقْهَا، قَالَ : فَجَرَتْ فِي سِكَكِ الْمَدِينَةِ .\nقَالَ : وَكَانَتْ خَمْرُهُمْ يَوْمَئِذٍ الْفَضِيخَ.\nفَقَالَ بَعْضُ الْقَوْمِ : قُتِلَ قَوْمٌ وَهِيَ فِي بُطُونِهِمْ، فَأَنْزَلَ اللَّهُ G : # لَيْسَ عَلَى الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جُنَاحٌ فِيمَا طَعِمُوا إِذَا مَا اتَّقَوْا وَآمَنُوا سورة المائدة آية 93 #",
    "malay_translation": "Abu Nu'man telah mengkhabarkan kepada kami, Hammad bin Zaid telah menceritakan kepada kami, Thabit telah menceritakan kepada kami, daripada Anas, beliau berkata: “Aku adalah pemberi minum kepada kaum di rumah Abu Talhah.” Beliau berkata: “Maka turunlah pengharaman arak.” Beliau berkata: “Maka beliau (Abu Talhah) memerintahkan seorang penyeru untuk menyeru.” Abu Talhah berkata: “Keluarlah dan lihatlah apa ini.” Beliau (Anas) berkata: “Maka aku keluar dan berkata: “Ini adalah seorang penyeru yang menyeru: ‘Ketahuilah, sesungguhnya arak telah diharamkan!’” Maka beliau (Abu Talhah) berkata kepadaku: “Pergilah dan tumpahkanlah ia.” Beliau berkata: “Maka arak itu mengalir di lorong-lorong Madinah.” Beliau berkata: “Dan arak mereka pada hari itu adalah Al-Fadhiikh (sejenis arak yang dibuat daripada kurma).” Sebahagian kaum berkata: “Telah terbunuh beberapa kaum dan arak masih berada di dalam perut mereka.” Maka Allah menurunkan: “Tidak ada dosa bagi orang-orang yang beriman dan mengerjakan amal soleh tentang apa yang mereka makan, apabila mereka bertakwa dan beriman…” (Surah Al-Ma'idah, ayat 93)."
  },
  {
    "id": 38913,
    "hadith_number": 1376,
    "tajuk_hadith": "Larangan Meminum Arak di Dunia dan Akibatnya di Akhirat",
    "perawi_melayu": "Diriwayatkan dari Nafi', dari Ibnu Umar, bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَنْ شَرِبَ الْخَمْرَ فِي الدُّنْيَا ثُمَّ لَمْ يَتُبْ مِنْهَا، حُرِمَهَا فِي الْآخِرَةِ فَلَمْ يُسْقَهَا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Khalid bin Makhlad, telah menceritakan kepada kami Malik, dari Nafi', dari Ibnu Umar, dia berkata: Rasulullah SAW bersabda: \"Sesiapa yang meminum arak di dunia kemudian tidak bertaubat daripadanya, dia diharamkan daripada arak itu di akhirat, maka dia tidak akan diberi minum daripadanya.\""
  },
  {
    "id": 38914,
    "hadith_number": 1377,
    "tajuk_hadith": "Hukuman bagi Peminum Arak dan Penerimaan Taubat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ الْأَوْزَاعِيِّ  ، قَالَ : حَدَّثَنِي رَبِيعَةُ بْنُ يَزِيدَ  عَنْ عَبْدِ اللَّهِ بْنِ الدَّيْلَمِيِّ  ، قَالَ : دَخَلْتُ عَلَى عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ فِي حَائِطٍ لَهُ بِالطَّائِفِ ، يُقَالُ لَهُ : الْوَهْطُ ، فَإِذَا هُوَ مُخَاصِرٌ فَتًى مِنْ قُرَيْشٍ يُزَنُّ ذَلِكَ الْفَتَى بِشُرْبِ الْخَمْرِ، فَقُلْتُ : خِصَالٌ بَلَغَتْنِي عَنْكَ أَنَّكَ تُحَدِّثُ بِهَا، عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، أَنَّهُ : مَنْ شَرِبَ الْخَمْرَ شَرْبَةً، لَمْ تُقْبَلْ لَهُ صَلَاةٌ أَرْبَعِينَ صَبَاحًا، فَلَمَّا أَنْ سَمِعَهُ الْفَتَى بِذِكُرُ الْخَمْرَ، اخْتَلَجَ يَدَهُ مِنْ يَدِ عَبْدِ اللَّهِ، ثُمَّ وَلَّى.\nفَقَالَ عَبْدُ اللَّهِ   : اللَّهُمَّ إِنِّي لَا أُحِلُّ لِأَحَدٍ أَنْ يَقُولَ عَلَيَّ مَا لَمْ أَقُلْ، وَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" مَنْ شَرِبَ الْخَمْرَ شَرْبَةً، لَمْ تُقْبَلْ لَهُ صَلَاةٌ أَرْبَعِينَ صَبَاحًا، فَإِنْ تَابَ، تَابَ اللَّهُ عَلَيْهِ، فَلَا أَدْرِي فِي الثَّالِثَةِ أَمْ فِي الرَّابِعَةِ : كَانَ حَقًّا عَلَى اللَّهِ أَنْ يَسْقِيَهُ مِنْ رَدْغَةِ الْخَبَالِ يَوْمَ الْقِيَامَةِ \"",
    "malay_translation": "Muhammad bin Yusuf meriwayatkan daripada al-Auza'i, katanya: Rabiah bin Yazid meriwayatkan kepadaku daripada Abdullah bin al-Dailami, katanya: Aku masuk menemui Abdullah bin 'Amru bin al-'As di kebunnya di Ta'if, yang dikenali sebagai al-Waht. Tiba-tiba, dia sedang merangkul seorang pemuda dari Quraisy yang dicurigai minum arak. Aku berkata: \"Beberapa perkara telah sampai kepadaku bahawa kamu meriwayatkannya daripada Rasulullah SAW, bahawa: 'Sesiapa yang meminum arak seteguk, solatnya tidak diterima selama empat puluh pagi.'\" Apabila pemuda itu mendengar tentang arak, dia menarik tangannya daripada tangan Abdullah, kemudian berpaling.\nAbdullah berkata: \"Ya Allah, aku tidak menghalalkan sesiapa pun mengatakan tentangku apa yang tidak aku katakan. Sesungguhnya aku mendengar Rasulullah SAW bersabda: 'Sesiapa yang meminum arak seteguk, solatnya tidak diterima selama empat puluh pagi. Jika dia bertaubat, Allah menerima taubatnya.' Aku tidak tahu sama ada pada kali ketiga atau keempat: 'Adalah hak Allah untuk memberinya minum dari Radghatul Khabal pada Hari Kiamat.'"
  },
  {
    "id": 38915,
    "hadith_number": 1378,
    "tajuk_hadith": "Larangan Duduk di Meja yang Dihidangkan Arak",
    "perawi_melayu": "Diriwayatkan daripada Jabir RA, Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا الْحَسَنُ بْنُ أَبِي جَعْفَرٍ  ، حَدَّثَنَا أَبُو الزُّبَيْرِ  ، عَنْ جَابِرٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ، فَلَا يَقْعُدْ عَلَى مَائِدَةٍ يُشْرَبُ عَلَيْهَا الْخَمْرُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muslim bin Ibrahim, telah menceritakan kepada kami Al-Hasan bin Abi Ja'far, telah menceritakan kepada kami Abu Al-Zubair, daripada Jabir RA, beliau berkata: Rasulullah SAW bersabda: \"Sesiapa yang beriman kepada Allah dan hari akhirat, maka janganlah dia duduk di atas meja yang dihidangkan arak padanya.\""
  },
  {
    "id": 38916,
    "hadith_number": 1379,
    "tajuk_hadith": "Larangan Masuk Syurga bagi Anak Zina, Pemberi Umpatan, Penderhaka, dan Peminum Arak",
    "perawi_melayu": "Diriwayatkan oleh Muhammad bin Kathir al-Basri, daripada Sufyan, daripada Mansur, daripada Salim bin Abi al-Ja'd, daripada Jabān, daripada Abdullah bin 'Amr, daripada Nabi SAW.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ كَثِيرٍ الْبَصْرِيُّ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ مَنْصُورٍ  ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ  ، عَنْ جَابَانَ  ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ، قَالَ :\" لَا يَدْخُلُ الْجَنَّةَ وَلَدُ زِنْيَةٍ، وَلَا مَنَّانٌ، وَلَا عَاقٌّ، وَلَا مُدْمِنُ خَمْرٍ \"",
    "malay_translation": "Tidak akan masuk syurga anak hasil zina, orang yang mengungkit-ungkit pemberian, orang yang derhaka (kepada ibu bapanya), dan orang yang ketagih arak."
  },
  {
    "id": 38917,
    "hadith_number": 1380,
    "tajuk_hadith": "Larangan Masuk Syurga Bagi Penderhaka, Pengungkit, dan Peminum Arak",
    "perawi_melayu": "Ahmad bin al-Hajjaj, daripada Abdurrahman bin Mahdi, daripada Syu'bah, daripada Mansur, daripada Salim bin Abil Ja'di, daripada Nubait bin Syarit, daripada Jabatan, daripada Abdullah bin Amru, daripada Nabi SAW",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ الْحَجَّاجِ  ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ مَنْصُورٍ  ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ  ، عَنْ نُبَيْطِ بْنِ شَرِيطٍ  ، عَنْ جَابَانَ  ،  عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" لَا يَدْخُلُ الْجَنَّةَ عَاقٌّ، وَلَا مَنَّانٌ، وَلَا مُدْمِنُ خَمْرٍ \"",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin al-Hajjaj, telah menceritakan kepada kami Abdurrahman bin Mahdi, telah menceritakan kepada kami Syu'bah, daripada Mansur, daripada Salim bin Abil Ja'di, daripada Nubait bin Syarit, daripada Jabatan, daripada Abdullah bin Amru, daripada Nabi SAW, baginda bersabda: \"Tidak akan masuk syurga orang yang derhaka, orang yang mengungkit-ungkit pemberian, dan orang yang ketagih arak.\""
  },
  {
    "id": 38918,
    "hadith_number": 1381,
    "tajuk_hadith": "Arak Bukanlah Ubat, Tetapi Penyakit",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سُهَلُ بْنُ حَمَّادٍ  ، حَدَّثَنَا شُعْبَةُ  ، حَدَّثَنَا سِمَاكٌ  ، قَالَ : سَمِعْتُ عَلْقَمَةَ بْنَ وَائِلٍ  يُحَدِّثُ، عَنْ أَبِيهِ وَائِلٍ  ، أَنَّ سُوَيْدَ بْنَ طَارِقٍ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْخَمْرِ، فَنَهَاهُ عَنْهَا أَنْ يَصْنَعَهَا، فَقَالَ : إِنَّهَا دَوَاءٌ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" إِنَّهَالَيْسَتْ دَوَاءً وَلَكِنَّهَا دَاءٌ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Suhal bin Hammad, telah menceritakan kepada kami Syu'bah, telah menceritakan kepada kami Simak, dia berkata: Saya mendengar 'Alqamah bin Wa'il menceritakan, daripada ayahnya Wa'il, bahawa Suwaid bin Tariq bertanya kepada Rasulullah SAW tentang arak. Baginda melarangnya daripada membuatnya. Dia berkata: Sesungguhnya ia adalah ubat. Rasulullah SAW bersabda: \"Sesungguhnya ia bukanlah ubat, tetapi ia adalah penyakit.\""
  },
  {
    "id": 38919,
    "hadith_number": 1382,
    "tajuk_hadith": "Khamar (Arak) Berasal dari Pokok Kurma dan Anggur",
    "perawi_melayu": "Abu al-Mughirah, daripada al-Awza'i, katanya: Saya mendengar Abu Kathir berkata: Saya mendengar Abu Hurairah berkata: Saya mendengar Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْمُغِيرَةِ  ، عَنْ الْأَوْزَاعِيِّ  ، قَالَ : سَمِعْتُ أَبَا كَثِيرٍ  يَقُولُ : سَمِعْتُ أَبَا هُرَيْرَةَ   يَقُولُ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ :\" الْخَمْرُ مِنْ هَاتَيْنِ الشَّجَرَتَيْنِ : النَّخْلَةِ وَالْعِنَبِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu al-Mughirah, daripada al-Awza'i, katanya: Saya mendengar Abu Kathir berkata: Saya mendengar Abu Hurairah RA berkata: Saya mendengar Rasulullah SAW bersabda: \"Khamar (arak) berasal daripada dua jenis pokok ini: Pokok kurma dan anggur.\""
  },
  {
    "id": 38920,
    "hadith_number": 1383,
    "tajuk_hadith": "Hukum Minuman yang Memabukkan",
    "perawi_melayu": "Diriwayatkan daripada Aisyah R.A. bahawa Rasulullah SAW ditanya tentang *al-Bit'*. Baginda bersabda: \"Setiap minuman yang memabukkan adalah haram.\"",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ ابْنِ شِهَابٍ  ، عَنْ أَبِي سَلَمَةَ  ، عَنْ عَائِشَةَ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ الْبِتْعِ، قَالَ :\" كُلُّ شَرَابٍ أَسْكَرَ حَرَامٌ \"",
    "malay_translation": "Ubaidullah bin Abdul Majeed meriwayatkan kepada kami, Malik meriwayatkan kepada kami, daripada Ibnu Shihab, daripada Abu Salamah, daripada Aisyah R.A., bahawa Rasulullah SAW ditanya tentang *al-Bit'*. Baginda bersabda: \"Setiap minuman yang memabukkan adalah haram.\""
  },
  {
    "id": 38921,
    "hadith_number": 1384,
    "tajuk_hadith": "Larangan Meminum Minuman yang Memabukkan",
    "perawi_melayu": "Diriwayatkan daripada Abu Musa Al-Asy'ari RA:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ إِسْرَائِيلَ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى  ، عَنْ أَبِيهِ  ، قَالَ : بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا وَمُعَاذَ بْنَ جَبَلٍ إِلَى الْيَمَنِ ، فَقَالَ :\" اشْرَبُوا، وَلَا تَشْرَبُوا مُسْكِرًا، فَإِنَّ كُلَّ مُسْكِرٍ حَرَامٌ \"",
    "malay_translation": "Muhammad bin Yusuf mengkhabarkan kepada kami, daripada Israil, daripada Abu Ishaq, daripada Abu Burdah bin Abu Musa, daripada ayahnya, dia berkata: Rasulullah SAW mengutus aku dan Muadz bin Jabal ke Yaman, lalu Baginda bersabda: \"Minumlah, tetapi janganlah kamu minum minuman yang memabukkan, kerana setiap yang memabukkan adalah haram.\""
  },
  {
    "id": 38922,
    "hadith_number": 1385,
    "tajuk_hadith": "Larangan Meminum Sedikit yang Memabukkan Jika Banyaknya Memabukkan",
    "perawi_melayu": "Diriwayatkan oleh Abdullah bin Sa'id, daripada Abu Usamah, daripada al-Walid bin Kathir bin Sinan, daripada al-Dahhak bin Uthman, daripada Bukair bin Abdullah bin al-Asyajj, daripada Amir bin Saad, daripada Saad, daripada Rasulullah SAW.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ  ، أَخْبَرَنَا أَبُو أُسَامَةَ  ، حَدَّثَنَا الْوَلِيدُ بْنُ كَثِيرِ بْنِ سِنَانٍ  ، حَدَّثَنِي الضَّحَّاكُ بْنُ عُثْمَانَ  ، عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ  ، عَنْ عَامِرِ بْنِ سَعْدٍ  ، عَنْ سَعْدٍ  ، عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" أَنْهَاكُمْ عَنْ قَلِيلِ مَا أَسْكَرَ كَثِيرُهُ \"",
    "malay_translation": "Rasulullah SAW bersabda: \"Aku melarang kamu daripada (meminum) sedikit (minuman) yang memabukkan jika banyaknya memabukkan.\""
  },
  {
    "id": 38923,
    "hadith_number": 1386,
    "tajuk_hadith": "Penghalalan Arak dengan Mengubah Nama",
    "perawi_melayu": "Zaid bin Yahya",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا زَيْدُ بْنُ يَحْيَى  ، حَدَّثَنَا مُحَمَّدُ بْنُ رَاشِدٍ  ، عَنْ أَبِي وَهْبٍ الْكَلَاعِيِّ  ، عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ  ، عَنْ عَائِشَةَ  ، قَالَتْ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ : \" إِنَّأَوَّلَ مَا يُكْفَأُ قَالَ زَيْدٌ : يَعْنِي : فِي الْإِسْلَامَ كَمَا يُكْفَأُ الْإِنَاءُ يَعْنِي : الْخَمْرِ \"، فَقِيلَ : كَيْفَ يَا رَسُولَ اللَّهِ وَقَدْ بَيَّنَ اللَّهُ فِيهَا مَا بَيَّنَ؟ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" يُسَمُّونَهَا بِغَيْرِ اسْمِهَا فَيَسْتَحِلُّونَهَا \"",
    "malay_translation": "Zaid bin Yahya menceritakan kepada kami, Muhammad bin Rashid menceritakan kepada kami, daripada Abu Wahb al-Kila'i, daripada al-Qasim bin Muhammad, daripada Aisyah, dia berkata: Aku mendengar Rasulullah SAW bersabda: \"Sesungguhnya perkara pertama yang akan diterbalikkan - Zaid berkata: Maksudnya: dalam Islam, seperti diterbalikkannya bejana - maksudnya: arak.\" Lalu ditanyakan: \"Bagaimana wahai Rasulullah, sedangkan Allah telah menjelaskan tentangnya apa yang telah dijelaskan?\" Rasulullah SAW bersabda: \"Mereka menamakannya dengan nama lain lalu mereka menghalalkannya.\""
  },
  {
    "id": 38924,
    "hadith_number": 1387,
    "tajuk_hadith": "Peringkat-Peringkat Agama: Kenabian, Kerajaan dengan Rahmat, Kerajaan yang Suram, dan Kerajaan dengan Kekerasan",
    "perawi_melayu": "Marwan bin Muhammad, Yahya bin Hamzah, Abu Wahb, Makhul, Abu Tha'labah al-Khushani, Abu Ubaidah bin al-Jarrah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مَرْوَانُ بْنُ مُحَمَّدٍ  ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ  ، حَدَّثَنِي أَبُو وَهْبٍ  ، عَنْ مَكْحُولٍ  ، عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ  ، عَنْ أَبِي عُبَيْدَةَ بْنِ الْجَرَّاحِ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" أَوَّلُ دِينِكُمْ نُبُوَّةٌ وَرَحْمَةٌ، ثُمَّ مُلْكٌ وَرَحْمَةٌ، ثُمَّ مُلْكٌ أَعْفَرُ، ثُمَّ مُلْكٌ وَجَبَرُوتٌ يُسْتَحَلُّ فِيهَا الْخَمْرُ وَالْحَرِيرُ \".\nقَالَ أَبُو مُحَمَّد : سُئِلَ عَنْ أَعْفَرَ، فَقَالَ : يُشَبِّهِهُ بِالتُّرَابِ وَلَيْسَ فِيهِ خَيْرٌ",
    "malay_translation": "Telah mengkhabarkan kepada kami Marwan bin Muhammad, telah menceritakan kepada kami Yahya bin Hamzah, telah menceritakan kepadaku Abu Wahb, daripada Makhul, daripada Abu Tha'labah al-Khushani, daripada Abu Ubaidah bin al-Jarrah, beliau berkata: Rasulullah SAW bersabda: \"Permulaan agama kamu adalah kenabian dan rahmat, kemudian kerajaan dan rahmat, kemudian kerajaan yang suram, kemudian kerajaan dan kekerasan di mana arak dan sutera dihalalkan di dalamnya.\"\nAbu Muhammad berkata: Beliau ditanya tentang 'a'far', lalu beliau berkata: \"Ia menyerupai tanah dan tidak ada kebaikan padanya.\""
  },
  {
    "id": 38925,
    "hadith_number": 1388,
    "tajuk_hadith": "Larangan Menjual Arak dan Kaitannya dengan Babi",
    "perawi_melayu": "Diriwayatkan daripada Urwah bin al-Mughirah bin Syu'bah, daripada ayahnya, daripada Rasulullah SAW",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَهْلُ بْنُ حَمَّادٍ  ، حَدَّثَنَا طُعْمَةُ  ، حَدَّثَنَا عَمْرُو بْنُ بَيَانٍ التَّغْلِبِيُّ  ، عَنْ عُرْوَةَ بْنِ الْمُغِيرَةِ بْنِ شُعْبَةَ  ، عَنْ أَبِيهِ  ، عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، أَنَّهُ قَالَ :\" مَنْ بَاعَ الْخَمْرَ، فَلْيُشَقِّصْ الْخَنَازِيرَ \".\nقَالَ أَبُو مُحَمَّد : إِنَّمَا هُوَ عُمَرُ بْنُ بَيَانٍ",
    "malay_translation": "Telah mengkhabarkan kepada kami Sahl bin Hammad, telah menceritakan kepada kami Tu'mah, telah menceritakan kepada kami 'Amru bin Bayan at-Taghlibi, daripada 'Urwah bin al-Mughirah bin Syu'bah, daripada ayahnya, daripada Rasulullah SAW, bahawa Baginda bersabda: \"Sesiapa yang menjual arak, maka hendaklah dia memotong-motong babi.\" Abu Muhammad berkata: Sesungguhnya dia adalah 'Umar bin Bayan."
  },
  {
    "id": 38926,
    "hadith_number": 1389,
    "tajuk_hadith": "Hukum Menjual Arak Setelah Diharamkan",
    "perawi_melayu": "Ya'la, daripada Muhammad bin Ishaq, daripada al-Qa'qa' bin Hakim, daripada Abd al-Rahman bin Wa'lah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْلَى  ، عَنْ مُحَمَّدِ بْنِ إِسْحَاق  ، عَنْ الْقَعْقَاعِ بْنِ حَكِيمٍ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ وَعْلَةَ  ، قَالَ : سَأَلْتُ ابْنَ عَبَّاسٍ   عَنْ بَيْعِ الْخَمْرِ، فَقَالَ : كَانَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَدِيقٌ مِنْ ثَقِيفٍ أَوْ مِنْ دَوْسٍ ، فَلَقِيَهُ بِمَكَّةَ عَامَ الْفَتْحِ بِرَاوِيَةٍ مِنْ خَمْرٍ يُهْدِيهَا لَهُ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" يَا فُلَانُ، أَمَا عَلِمْتَ أَنَّ اللَّهَ تَعَالَى قَدْ حَرَّمَهَا؟ \" قَالَ : فَأَقْبَلَ الرَّجُلُ عَلَى غُلَامِهِ، فَقَالَ : اذْهَبْ فَبِعْهَا، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" بِمَاذَا أَمَرْتَهُ يَا فُلَانُ؟ \" قَالَ : أَمَرْتُهُ بِبَيْعِهَا.\nفَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" إِنَّالَّذِي حَرَّمَ شُرْبَهَا، حَرَّمَ بَيْعَهَا \".\nفَأَمَرَ بِهَا فَأُكْفِئَتْ فِي الْبَطْحَاءِ",
    "malay_translation": "Ya'la telah meriwayatkan kepada kami, daripada Muhammad bin Ishaq, daripada al-Qa'qa' bin Hakim, daripada Abd al-Rahman bin Wa'lah, beliau berkata: Aku bertanya kepada Ibn Abbas tentang penjualan arak. Beliau berkata: Rasulullah SAW mempunyai seorang sahabat daripada Thaqif atau daripada Daws, lalu beliau bertemu dengan Rasulullah SAW di Makkah pada tahun pembukaan Kota Makkah dengan membawa satu bekas arak untuk dihadiahkan kepada baginda. Rasulullah SAW bersabda: \"Wahai Fulan, tidakkah kamu tahu bahawa Allah Taala telah mengharamkannya?\" Beliau berkata: Lalu lelaki itu menghadap kepada hambanya dan berkata: Pergilah jual arak ini. Maka Rasulullah SAW bersabda: \"Apa yang kamu perintahkan kepadanya, wahai Fulan?\" Beliau berkata: Aku memerintahkannya untuk menjualnya.\nRasulullah SAW bersabda: \"Sesungguhnya Zat yang mengharamkan meminumnya, mengharamkan juga penjualannya.\"\nLalu baginda memerintahkan agar arak itu ditumpahkan di al-Bathha'."
  },
  {
    "id": 38927,
    "hadith_number": 1390,
    "tajuk_hadith": "Larangan Menjual Arak dan Perumpamaan Kaum Yahudi yang Menjual Lemak yang Dicairkan",
    "perawi_melayu": "Diriwayatkan dari Ibnu Abbas RA",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ عَمْرٍو يَعْنِي : ابْنَ دِينَارٍ  ، عَنْ طَاوُسٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ : بَلَغَ عُمَرَ   أَنَّ سَمُرَةَ بَاعَ خَمْرًا، فَقَالَ : قَاتَلَ اللَّهُ سَمُرَةَ، أَمَا عَلِمَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :\" لَعَنَ اللَّهُ الْيَهُودَ، حُرِّمَتْ عَلَيْهِمْ الشُّحُومُ فَجَمَلُوهَا، فَبَاعُوهَا \".\nقَالَ سُفْيَانُ : جَمَلُوهَا : أَذَابُوهَا",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Ahmad, telah menceritakan kepada kami Sufyan, dari 'Amr yaitu Ibnu Dinar, dari Tawus, dari Ibnu Abbas RA, beliau berkata: Telah sampai kepada Umar RA bahwa Samurah menjual arak. Maka Umar berkata: \"Semoga Allah memerangi Samurah, tidakkah dia tahu bahwa Nabi SAW bersabda: 'Allah melaknat kaum Yahudi, diharamkan atas mereka lemak, lalu mereka mencairkannya, kemudian mereka menjualnya.'\" Sufyan berkata: \"*Jamaluha*: mereka mencairkannya.\""
  },
  {
    "id": 38928,
    "hadith_number": 1391,
    "tajuk_hadith": "Hukuman bagi Peminum Arak yang Berulang",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah RA",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَاصِمُ بْنُ عَلِيٍّ  ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ  ، عَنْ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ  ، عَنْ أَبِي سَلَمَةَ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِذَا سَكِرَ، فَاجْلِدُوهُ، ثُمَّ إِذَا سَكِرَ، فَاجْلِدُوهُ، ثُمَّ إِذَا سَكِرَ، فَاجْلِدُوهُ، ثُمَّ إِذَا سَكِرَ، فَاضْرِبُوا عُنُقَهُ \".\nيَعْنِي فِي الرَّابِعَةِ",
    "malay_translation": "Telah menceritakan kepada kami 'Asim bin 'Ali, telah menceritakan kepada kami Ibnu Abi Dzi'b, dari Al-Harith bin 'Abdurrahman, dari Abu Salamah, dari Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: \"Apabila dia mabuk, maka sebatlah dia. Kemudian apabila dia mabuk lagi, maka sebatlah dia. Kemudian apabila dia mabuk lagi, maka sebatlah dia. Kemudian apabila dia mabuk lagi (keempat kalinya), maka pancunglah lehernya.\""
  },
  {
    "id": 38929,
    "hadith_number": 1392,
    "tajuk_hadith": "Larangan Melakukan Zina, Mencuri dan Meminum Arak Ketika Beriman",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA, Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ الْأَوْزَاعِيِّ  ، عَنْ الزُّهْرِيِّ  ، عَنْ أَبِي سَلَمَةَ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَا يَزْنِي الزَّانِي حِينَ يَزْنِي وَهُوَ مُؤْمِنٌ، وَلَا يَسْرِقُ السَّارِقُ حِينَ يَسْرِقُ وَهُوَ مُؤْمِنٌ، وَلَا يَشْرَبُ الْخَمْرَ حِينَ يَشْرَبُهَا وَهُوَ مُؤْمِنٌ \"",
    "malay_translation": "Muhammad bin Yusuf memberitahu kami, daripada al-Awza'i, daripada al-Zuhri, daripada Abu Salamah, daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: \"Tidaklah seorang penzina itu berzina ketika dia berzina dalam keadaan dia beriman, dan tidaklah seorang pencuri itu mencuri ketika dia mencuri dalam keadaan dia beriman, dan tidaklah seorang peminum arak itu meminum arak ketika dia meminumnya dalam keadaan dia beriman.\""
  },
  {
    "id": 38930,
    "hadith_number": 1393,
    "tajuk_hadith": "Cara Nabi SAW Menyediakan Nabidh (Perahan Kurma)",
    "perawi_melayu": "Diriwayatkan daripada Jabir RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ  ، عَنْ أَبِي الزُّبَيْرِ  ،  عَنْ جَابِرٍ  ، قَالَ : \" كَانَيُنْتَبَذُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي السِّقَاءِ، فَإِنْ لَمْ يَكُنْ سِقَاءٌ، نُبِذَ لَهُ فِي تَوْرٍ مِنْ بِرَامٍ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, daripada Abdul Malik bin Abi Sulaiman, daripada Abu al-Zubair, daripada Jabir RA, beliau berkata: “Nabidh (perahan kurma) disediakan untuk Nabi SAW di dalam bekas air kulit. Sekiranya tidak ada bekas air kulit, Nabidh disediakan untuk baginda di dalam bekas tembikar."
  },
  {
    "id": 38931,
    "hadith_number": 1394,
    "tajuk_hadith": "Allah dan Rasul-Nya Sebagai Pelindung dan Hukum Berkaitan Anggur Setelah Pengharamannya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ كَثِيرٍ  ، عَنْ الْأَوْزَاعِيِّ  ، عَنْ يَحْيَى بْنِ أَبِي عَمْرٍو السَّيْبَانِيِّ  ، عَنْ عَبْدِ اللَّهِ بْنِ الدَّيْلَمِيِّ  ، عَنْ أَبِيهِ  ، أَنَّ أَبَاهُ أَوْ أَنَّ رَجُلًا مِنْهُمْ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ : يَا رَسُولَ اللَّهِ، إِنَّا قَدْ خَرَجْنَا مِنْ حَيْثُ عَلِمْتَ، وَنَزَلْنَا بَيْنَ ظَهْرَانَيْ مَنْ قَدْ عَلِمْتَ، فَمَنْ وَلِيُّنَا؟ قَالَ : \" اللَّهُ وَرَسُولُهُ \".\nقَالُوا : يَا رَسُولَ اللَّهِ، إِنَّا كُنَّا أَصْحَابَ كَرْمٍ وَخَمْرٍ، وَإِنَّ اللَّهَ قَدْ حَرَّمَ الْخَمْرَ، فَمَا نَصْنَعُ بِالْكَرْمِ؟ قَالَ : \" اصْنَعُوهُ زَبِيبًا \".\nقَالُوا : فَمَا نَصْنَعُ بِالزَّبِيبِ؟ قَالَ :\" انْقَعُوهُ فِي الشِّنَانِ، انْقَعُوهُ عَلَى غَدَائِكُمْ، وَاشْرَبُوهُ عَلَى عَشَائِكُمْ، وَانْقَعُوهُ عَلَى عَشَائِكُمْ، وَاشْرَبُوهُ عَلَى غَدَائِكُمْ، فَإِنَّهُ إِذَا أَتَى عَلَيْهِ الْعَصْرَانِ، كَانَ حِلًّا قَبْلَ أَنْ يَكُونَ خَمْرًا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Kathir, daripada al-Awza'i, daripada Yahya bin Abi 'Amru as-Syaibani, daripada Abdullah bin ad-Dailami, daripada ayahnya, bahawa ayahnya atau seorang lelaki daripada mereka bertanya kepada Nabi SAW, lalu berkata: Ya Rasulullah, sesungguhnya kami telah keluar dari tempat yang engkau ketahui, dan kami telah tinggal di antara orang yang engkau ketahui, maka siapakah pelindung kami? Baginda bersabda: \"Allah dan Rasul-Nya.\"\nMereka berkata: Ya Rasulullah, sesungguhnya kami adalah pemilik kebun anggur dan arak, dan sesungguhnya Allah telah mengharamkan arak, maka apa yang harus kami lakukan dengan kebun anggur itu? Baginda bersabda: \"Jadikanlah ia kismis.\"\nMereka bertanya: Apa yang harus kami lakukan dengan kismis? Baginda bersabda: \"Rendamkan ia di dalam bekas kulit, rendamkan ia pada waktu makan tengah hari kamu, dan minumlah ia pada waktu makan malam kamu, dan rendamkan ia pada waktu makan malam kamu, dan minumlah ia pada waktu makan tengah hari kamu, kerana apabila telah berlalu dua 'Asr (sehari semalam), ia adalah halal sebelum menjadi arak.\""
  },
  {
    "id": 38932,
    "hadith_number": 1395,
    "tajuk_hadith": "Larangan Nabi SAW terhadap Nabidh al-Jarr",
    "perawi_melayu": "Diriwayatkan daripada Sa'id bin Jubair, beliau berkata: Aku bertanya kepada Ibnu Umar tentang Nabidh al-Jarr, lalu beliau berkata: \"Rasulullah SAW telah mengharamkannya.\" Kemudian aku bertemu dengan Ibnu Abbas dan memberitahunya tentang perkataan Ibnu Umar, lalu beliau berkata: \"Benar apa yang dikatakan oleh Abu Abd al-Rahman.\"",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ  ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ  ، عَنْ قَتَادَةَ  ، عَنْ عَزْرَةَ  ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ  ، قَالَ : سَأَلْتُ ابْنَ عُمَرَ  عَنْ نَبِيذِ الْجَرِّ، فَقَالَ : \" حَرَّمَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \".\nفَلَقِيتُ ابْنَ عَبَّاسٍ   فَأَخْبَرْتُهُ بِقَوْلِ ابْنِ عُمَرَ، فَقَالَ : صَدَقَ أَبُو عَبْدِ الرَّحْمَنِ",
    "malay_translation": "Sa'id bin 'Amir telah mengkhabarkan kepada kami, daripada Sa'id bin Abi 'Arubah, daripada Qatadah, daripada 'Azrah, daripada Sa'id bin Jubair, beliau berkata: Aku bertanya kepada Ibnu Umar tentang Nabidh al-Jarr, lalu beliau berkata: \"Rasulullah SAW telah mengharamkannya.\" Kemudian aku bertemu dengan Ibnu Abbas dan memberitahunya tentang perkataan Ibnu Umar, lalu beliau berkata: \"Benar apa yang dikatakan oleh Abu Abd al-Rahman.\""
  },
  {
    "id": 38933,
    "hadith_number": 1396,
    "tajuk_hadith": "Larangan Membuat Perahan dalam Bekas Labu dan Bekas yang Disalut dengan Ter",
    "perawi_melayu": "Al-Hakam bin Nafi' meriwayatkan daripada Syuaib bin Abi Hamzah, daripada az-Zuhri, yang berkata: Anas bin Malik menceritakan kepadaku bahawa Nabi SAW bersabda: \"Janganlah kamu membuat perahan dalam bekas labu dan bekas yang disalut dengan ter.\"",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ  ، عَنْ شُعَيْبِ بْنِ أَبِي حَمْزَةَ  ، عَنْ الزُّهْرِيِّ  ، قَالَ : حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ  ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ :\" لَا تَنْتَبِذُوا فِي الدُّبَّاءِ وَالْمُزَفَّتِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Hakam bin Nafi', daripada Syuaib bin Abi Hamzah, daripada az-Zuhri, yang berkata: Anas bin Malik menceritakan kepadaku bahawa Nabi SAW bersabda: \"Janganlah kamu membuat perahan dalam bekas labu dan bekas yang disalut dengan ter.\""
  },
  {
    "id": 38934,
    "hadith_number": 1397,
    "tajuk_hadith": "Larangan Nabi SAW terhadap Nabidh al-Jarr dan Ad-Dubba'",
    "perawi_melayu": "Diriwayatkan oleh Abu Zaid, daripada Syu'bah, daripada Salamah bin Kuhail, katanya: Aku mendengar Abu al-Hakam berkata: Aku bertanya Ibn Abbas atau aku mendengar beliau ditanya tentang Nabidh al-Jarr, lalu beliau berkata: \"Rasulullah SAW melarang Nabidh al-Jarr dan Ad-Dubba'.\" Dan aku bertanya Ibn az-Zubair, lalu beliau berkata seperti perkataan Ibn Abbas.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو زَيْدٍ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ  ، قَالَ : سَمِعْتُ أَبَا الْحَكَمِ  ، قَالَ : سَأَلْتُ ابْنَ عَبَّاسٍ   أَوْ سَمِعْتُهُ سُئِلَ عَنْ نَبِيذِ الْجَرِّ، فَقَالَ : \" نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْنَبِيذِ الْجَرِّ وَالدُّبَّاءِ \".\nوَسَأَلْتُ ابْنَ الزُّبَيْرِ   ، فَقَالَ مِثْلَ قَوْلِ ابْنِ عَبَّاسٍ",
    "malay_translation": "Abu Zaid telah mengkhabarkan kepada kami, telah menceritakan kepada kami Syu'bah, daripada Salamah bin Kuhail, dia berkata: Aku mendengar Abu al-Hakam berkata: Aku bertanya kepada Ibn Abbas atau aku mendengar dia ditanya mengenai Nabidh al-Jarr, lalu dia berkata: \"Rasulullah SAW melarang Nabidh al-Jarr dan Ad-Dubba'.\" Dan aku bertanya kepada Ibn az-Zubair, lalu dia berkata seperti perkataan Ibn Abbas."
  },
  {
    "id": 38935,
    "hadith_number": 1398,
    "tajuk_hadith": "Larangan Menghalalkan Sesuatu yang Diharamkan oleh Allah dan Rasul-Nya",
    "perawi_melayu": "Ibnu Abbas RA",
    "english_text": "",
    "arabic_text": "قَالَ : وَقَالَ ابْنُ عَبَّاسٍ   : \" مَنْ سَرَّهُ أَنْ يُحَرِّمَ مَا حَرَّمَ اللَّهُ وَرَسُولُهُ، أَوْ مَنْ كَانَ مُحَرِّمًا مَا حَرَّمَ اللَّهُ وَرَسُولُهُ،فَلْيُحَرِّمْ النَّبِيذَ \"",
    "malay_translation": "Ibnu Abbas RA berkata: “Sesiapa yang gembira untuk mengharamkan apa yang telah diharamkan oleh Allah dan Rasul-Nya, atau sesiapa yang mengharamkan apa yang telah diharamkan oleh Allah dan Rasul-Nya, maka hendaklah dia mengharamkan Nabidh (sejenis minuman).”"
  },
  {
    "id": 38936,
    "hadith_number": 1399,
    "tajuk_hadith": "Larangan Membuat Nabidh dalam Bekas Tertentu dan Mencampur Kurma Muda dengan Kurma Kering",
    "perawi_melayu": "Diriwayatkan dari Abu Sa'id al-Khudri RA",
    "english_text": "",
    "arabic_text": "قَالَ : وَحَدَّثَنِي أَخِي  ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ   ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" نَهَى عَنْ الْجَرِّ وَالدُّبَّاءِ وَالْمُزَفَّتِ، وَعَنْ الْبُسْرِ وَالتَّمْرِ \"",
    "malay_translation": "Telah berkata (perawi): Dan telah menceritakan kepadaku saudaraku, daripada Abu Sa'id al-Khudri RA, bahawa Rasulullah SAW melarang daripada (membuat nabidh) di dalam bekas *al-jarr*, *ad-dubba'*, dan *al-muzaffat*, serta (mencampur) *al-busr* (kurma muda) dengan *at-tamr* (kurma kering)."
  },
  {
    "id": 38937,
    "hadith_number": 1400,
    "tajuk_hadith": "Larangan Minuman yang Memabukkan",
    "perawi_melayu": "Diriwayatkan oleh Abu Nu'man daripada Thabit bin Yazid daripada Asim daripada Fudail bin Zaid ar-Raqashi",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا ثَابِتُ بْنُ يَزِيدَ  ، حَدَّثَنَا عَاصِمٌ  ، عَنْ فُضَيْلِ بْنِ زَيْدٍ الرَّقَاشِيِّ  ، أَنَّهُ أَتَى عَبْدَ اللَّهِ بْنَ مُغَفَّلٍ  ، فَقَالَ : أَخْبِرْنِي بِمَا يَحْرُمُ عَلَيْنَا مِنْ الشَّرَابِ، فَقَالَ : الْخَمْرُ.\nقُلْتُ : هُوَ فِي الْقُرْآنِ؟ قَالَ : مَا أُحَدِّثُكَ إِلَّا مَا سَمِعْتُ مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَدَأَ بِالِاسْمِ أَوْ بِالرِّسَالَةِ ، قَالَ : فَقَالَ :\" نَهَى عَنْ الدُّبَّاءِ وَالْحَنْتَمِ وَالنَّقِيرِ \"",
    "malay_translation": "Abu Nu'man meriwayatkan kepada kami, Thabit bin Yazid meriwayatkan kepada kami, Asim meriwayatkan kepada kami, daripada Fudail bin Zaid ar-Raqashi, bahawa dia telah datang kepada Abdullah bin Mughaffal, lalu berkata: 'Beritahukan kepadaku tentang minuman apa yang diharamkan ke atas kami?' Beliau menjawab: 'Arak.' Aku bertanya: 'Adakah ia (disebutkan) di dalam Al-Quran?' Beliau menjawab: 'Aku tidak meriwayatkan kepadamu melainkan apa yang aku dengar daripada Muhammad SAW, beliau memulakan dengan nama atau risalah, beliau bersabda: 'Baginda melarang (membuat arak) daripada ad-dubba' (labu), al-hantam (tempayan hijau), dan an-naqir (batang pokok yang ditebuk).'"
  },
  {
    "id": 38938,
    "hadith_number": 1401,
    "tajuk_hadith": "Larangan Mencampur Perahan Buah Kering dan Kurma",
    "perawi_melayu": "Diriwayatkan daripada Abdullah bin Abi Qatadah, daripada ayahnya, daripada Nabi SAW",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، وَسَعِيدُ بْنُ عَامِرٍ  ، وَاللَّفْظُ لِيَزِيدَ، قَالَا : أَخْبَرَنَا هِشَامٌ  ، عَنْ يَحْيَى  ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ  ، عَنْ أَبِيهِ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" لَا تَنْتَبِذُوا الزَّهْوَ وَالرُّطَبَ جَمِيعًا، وَلَا تَنْتَبِذُوا الزَّبِيبَ وَالتَّمْرَ جَمِيعًا، وَانْتَبِذُوا كُلَّ وَاحِدٍ مِنْهُمَا عَلَى حِدَةٍ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun dan Sa'id bin Amir, dan lafaznya adalah bagi Yazid, mereka berdua berkata: Telah mengkhabarkan kepada kami Hisyam, daripada Yahya, daripada Abdullah bin Abi Qatadah, daripada ayahnya, daripada Nabi SAW, baginda bersabda: \"Janganlah kamu membuat perahan *az-zahwu* dan *ar-rutab* sekaligus, dan janganlah kamu membuat perahan kismis dan kurma sekaligus. Buatlah perahan setiap satu daripada keduanya secara berasingan.\""
  },
  {
    "id": 38939,
    "hadith_number": 1402,
    "tajuk_hadith": "Larangan Menggunakan Perkataan 'Karm' dan Anjuran Menggunakan 'Anggur' atau 'Habalah'",
    "perawi_melayu": "Diriwayatkan daripada Uthman bin Umar, daripada Syu'bah, daripada Simak, daripada Alqamah bin Wa'il, daripada ayahnya, bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ  ، أَخْبَرَنَا شُعْبَةُ  ، عَنْ سِمَاكٍ  ، عَنْ عَلْقَمَةَ بْنِ وَائِلٍ  ، عَنْ أَبِيهِ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" لَا تَقُولُوا : الْكَرْمَ، وَقُولُوا : الْعِنَبَ أَوْ الْحَبَلَةَ \"",
    "malay_translation": "\"Jangan kamu sebut 'Karm', tetapi sebutlah 'anggur' atau 'habalah'.\""
  },
  {
    "id": 38940,
    "hadith_number": 1403,
    "tajuk_hadith": "Hukum Membuang Arak Setelah Pengharaman",
    "perawi_melayu": "Diriwayatkan daripada Anas bin Malik RA",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، عَنْ إِسْرَائِيلَ  ، عَنْ السُّدِّيِّ  ، عَنْ يَحْيَى بْنِ عَبَّادٍ  ، عَنْ أَنَسِ بْنِ مَالِكٍ  ، قَالَ : \" كَانَ فِي حِجْرِ أَبِي طَلْحَةَ يَتَامَى، فَاشْتَرَى لَهُمْ خَمْرًا، فَلَمَّا نَزَلَ تَحْرِيمُ الْخَمْرِ، أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ، فَقَالَ :أَجْعَلُهُ خَلًّا؟ قَالَ : \" لَا \"، فَأَهْرَاقَهُ",
    "malay_translation": "Telah menceritakan kepada kami Ubaidillah bin Musa, daripada Isra'il, daripada as-Suddi, daripada Yahya bin 'Abbad, daripada Anas bin Malik RA, beliau berkata: \"Di bawah jagaan Abu Talhah terdapat anak-anak yatim. Beliau telah membeli arak untuk mereka. Apabila turun pengharaman arak, beliau datang kepada Nabi SAW dan menyebutkan hal itu kepada baginda. Beliau bertanya: 'Bolehkah aku menjadikannya cuka?' Baginda bersabda: 'Tidak,' lalu beliau menumpahkannya."
  },
  {
    "id": 38941,
    "hadith_number": 1404,
    "tajuk_hadith": "Rasulullah SAW Minum Susu dan Memberikannya kepada Orang Arab Badwi",
    "perawi_melayu": "Abu al-Mughirah meriwayatkan daripada al-Auza'i, meriwayatkan daripada al-Zuhri, daripada Anas bin Malik RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْمُغِيرَةِ  ، حَدَّثَنَا الْأَوْزَاعِيُّ  ، حَدَّثَنَا الزُّهْرِيُّ  ، عَنْ أَنَسِ بْنِ مَالِكٍ  ، أَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَرِبَ لَبَنًا، وَعَنْ يَسَارِهِ أَبُو بَكْرٍ، وَعَنْ يَمِينِهِ رَجُلٌ أَعْرَابِيٌّ، فَأَعْطَى الْأَعْرَابِيَّ فَضْلَهُ، ثُمَّ قَالَ :\" الْأَيْمَنَ فَالْأَيْمَنَ \"",
    "malay_translation": "Abu al-Mughirah memberitahu kami, al-Auza'i menceritakan kepada kami, al-Zuhri menceritakan kepada kami, daripada Anas bin Malik RA, bahawa dia melihat Rasulullah SAW minum susu, dan di sebelah kirinya Abu Bakar RA, dan di sebelah kanannya seorang lelaki Arab Badwi. Baginda SAW kemudian memberikan lebihan susu itu kepada orang Arab Badwi itu, kemudian bersabda: \"Yang kanan, kemudian yang kanan.\""
  },
  {
    "id": 38942,
    "hadith_number": 1405,
    "tajuk_hadith": "Larangan Minum Terus dari Mulut Bekas Air",
    "perawi_melayu": "Diriwayatkan daripada Ibnu Abbas R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَفَّانُ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، أَخْبَرَنَا قَتَادَةُ  ، عَنْ عِكْرِمَةَ  ، عَنْ ابْنِ عَبَّاسٍ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" نَهَى أَنْ يُشْرَبَ مِنْ فِي السِّقَاءِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Affan, telah menceritakan kepada kami Hammad bin Salamah, telah mengkhabarkan kepada kami Qatadah, daripada Ikrimah, daripada Ibnu Abbas, bahawa Rasulullah SAW melarang daripada minum terus dari mulut bekas air."
  },
  {
    "id": 38943,
    "hadith_number": 1406,
    "tajuk_hadith": "Larangan Minum Terus dari Mulut Bekas Air",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا وُهَيْبٌ  ، عَنْ خَالِدٍ الْحَذَّاءِ  ، عَنْ عِكْرِمَةَ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : \" نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْيُشْرَبَ مِنْ فِي السِّقَاءِ \"",
    "malay_translation": "Muslim bin Ibrahim telah mengkhabarkan kepada kami, Wahib telah meriwayatkan kepada kami, daripada Khalid al-Hazza’, daripada Ikrimah, daripada Abu Hurairah R.A., beliau berkata: \"Rasulullah SAW melarang minum terus dari mulut bekas air.\""
  },
  {
    "id": 38944,
    "hadith_number": 1407,
    "tajuk_hadith": "Larangan Meminum dari Mulut Bekas Air",
    "perawi_melayu": "Diriwayatkan daripada Abu Sa'id al-Khudri RA bahawa Nabi SAW melarang daripada meminum terus dari mulut bekas air.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، عَنْ ابْنِ أَبِي ذِئْبٍ  ، عَنْ الزُّهْرِيِّ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ  ،  عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ  ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" نَهَى عَنْ اخْتِنَاثِ الْأَسْقِيَةِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, daripada Ibn Abi Dzi'b, daripada az-Zuhri, daripada 'Ubaidillah bin Abdullah, daripada Abu Sa'id al-Khudri RA, bahawa Nabi SAW melarang daripada meminum terus dari mulut bekas air."
  },
  {
    "id": 38945,
    "hadith_number": 1408,
    "tajuk_hadith": "Bernafas di Dalam Bekas Air Ketika Minum",
    "perawi_melayu": "Diriwayatkan daripada Tsumamah, beliau berkata: Anas pernah bernafas di dalam bekas air dua atau tiga kali, dan beliau mendakwa bahawa Rasulullah SAW juga pernah bernafas di dalam bekas air dua atau tiga kali.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا عَزْرَةُ بْنُ ثَابِتٍ  ، عَنْ ثُمَامَةَ  ، قَالَ : كَانَ أَنَسٌ   يَتَنَفَّسُ فِي الْإِنَاءِ مَرَّتَيْنِ أَوْ ثَلَاثًا، وَزَعَمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ\" يَتَنَفَّسُ فِي الْإِنَاءِ مَرَّتَيْنِ أَوْ ثَلَاثًا \"",
    "malay_translation": "Abu Nu'aim telah mengkhabarkan kepada kami, Azrah bin Thabit telah meriwayatkan kepada kami, daripada Tsumamah, beliau berkata: Anas pernah bernafas di dalam bekas air dua atau tiga kali, dan beliau mendakwa bahawa Rasulullah SAW juga pernah \"bernafas di dalam bekas air dua atau tiga kali\"."
  },
  {
    "id": 38946,
    "hadith_number": 1409,
    "tajuk_hadith": "Adab Minum: Bernafas di Luar Bekas dan Menjaga Kebersihan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاق بْنُ عِيسَى  ، عَنْ مَالِكٍ  ، عَنْ أَيُّوبَ بْنِ حَبِيبٍ الزُّهْرِيِّ  ، عَنْ أَبِي الْمُثَنَّى  ، قَالَ : كُنْتُ عِنْدَ مَرْوَانَ فَجَاءَ أَبُو سَعِيدٍ   فَقَالَ : قَالَ رَجُلٌ : يَا رَسُولَ اللَّهِ، إِنِّي لَا أَرْوَى مِنْ نَفَسٍ وَاحِدٍ؟ قَالَ :\" فَأَبِنْ الْإِنَاءَ عَنْ فِيكَ، ثُمَّ تَنَفَّسْ \".\nقَالَ : إِنِّي أَرَى الْقَذَاةَ؟ قَالَ : \" أَهْرِقْهُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ishaq bin Isa, daripada Malik, daripada Ayyub bin Habib Az-Zuhri, daripada Abu Al-Muthanna, beliau berkata: Aku berada di sisi Marwan, lalu datang Abu Sa'id, kemudian dia berkata: Seorang lelaki berkata: Wahai Rasulullah, sesungguhnya aku tidak merasa puas dengan satu nafas? Baginda bersabda: \"Maka jauhkan bekas daripada mulutmu, kemudian bernafaslah.\" Dia berkata: Sesungguhnya aku melihat kotoran (di dalam air)? Baginda bersabda: \"Tumpahkanlah ia.\""
  },
  {
    "id": 38947,
    "hadith_number": 1410,
    "tajuk_hadith": "Larangan Menyentuh Kemaluan dengan Tangan Kanan Ketika Buang Air dan Adab Berkaitan",
    "perawi_melayu": "Abu Al-Mughirah, daripada Al-Auza'i, daripada Yahya, daripada Abdullah bin Abi Qatadah, daripada ayahnya",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْمُغِيرَةِ  ، حَدَّثَنَا الْأَوْزَاعِيُّ  ، عَنْ يَحْيَى  ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ  ، قَالَ : حَدَّثَنِي أَبِي  ، أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" إِذَا بَالَ أَحَدُكُمْ، فَلَا يَمَسَّ ذَكَرَهُ بِيَمِينِهِ، وَلَا يَسْتَنْجِي بِيَمِينِهِ، وَلَا يَتَنَفَّسْ فِي الْإِنَاءِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Al-Mughirah, telah menceritakan kepada kami Al-Auza'i, daripada Yahya, daripada Abdullah bin Abi Qatadah, dia berkata: Telah menceritakan kepadaku ayahku, bahawa dia mendengar Nabi SAW bersabda: \"Apabila salah seorang daripada kamu kencing, maka janganlah dia menyentuh kemaluannya dengan tangan kanannya, dan janganlah dia beristinjak (membersihkan diri setelah buang air) dengan tangan kanannya, dan janganlah dia bernafas di dalam bekas (air).\""
  },
  {
    "id": 38948,
    "hadith_number": 1411,
    "tajuk_hadith": "Menziarahi Orang Sakit dan Minum dari Bekas Air",
    "perawi_melayu": "Ishaq bin Isa meriwayatkan daripada Fulaih bin Sulaiman, daripada Sa'id bin al-Harith al-Ansari, daripada Jabir bin Abdullah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاق بْنُ عِيسَى  ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ  ، عَنْ سَعِيدِ بْنِ الْحَارِثِ الْأَنْصَارِيِّ  ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ  ، قَالَ : أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا مِنْ الْأَنْصَارِ يَعُودُهُ، وَجَدْوَلٌ يَجْرِي، فَقَالَ :\" إِنْ كَانَ عِنْدَكُمْ مَاءٌ بَاتَ فِي الشَّنِّ، وَإِلَّا كَرَعْنَا \"",
    "malay_translation": "Ishaq bin Isa telah mengkhabarkan kepada kami, Fulaih bin Sulaiman telah menceritakan kepada kami, daripada Sa'id bin al-Harith al-Ansari, daripada Jabir bin Abdullah, beliau berkata: Nabi ﷺ telah datang kepada seorang lelaki Ansar untuk menziarahinya, dan terdapat anak sungai yang mengalir. Baginda bersabda: \"Jika kamu ada air yang bermalam di dalam kirbat, (berikan kepada kami) jika tidak, kami akan minum terus (dari sungai).\""
  },
  {
    "id": 38949,
    "hadith_number": 1412,
    "tajuk_hadith": "Nabi Muhammad SAW Minum Berdiri dari Mulut Kirbah",
    "perawi_melayu": "Mansur bin Salamah al-Khuza'i meriwayatkan daripada Syarik, daripada Abdul Karim, daripada al-Bara' bin anak perempuan Anas, daripada Anas, daripada Ummu Sulaim RA.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مَنْصُورُ بْنُ سَلَمَةَ الْخُزَاعِيُّ  ، حَدَّثَنَا شَرِيكٌ  ، عَنْ عَبْدِ الْكَرِيمِ  ، عَنْ الْبَرَاءِ  ابْنِ ابْنَةِ أَنَسٍ، عَنْ أَنَسٍ  ، عَنْ أُمِّ سُلَيْمٍ  ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" شَرِبَ مِنْ فَمِ قِرْبَةٍ قَائِمًا \"",
    "malay_translation": "Mansur bin Salamah al-Khuza'i meriwayatkan kepada kami, Syarik meriwayatkan kepada kami, daripada Abdul Karim, daripada al-Bara' bin anak perempuan Anas, daripada Anas, daripada Ummu Sulaim RA, bahawa Nabi SAW minum dari mulut kirbah (bekas air kulit) sambil berdiri."
  },
  {
    "id": 38950,
    "hadith_number": 1413,
    "tajuk_hadith": "Minum dan Makan Sambil Berdiri pada Zaman Rasulullah SAW",
    "perawi_melayu": "Uthman bin Umar, daripada Imran bin Hudair, daripada Abu al-Bazari Yazid bin Utarid, daripada Ibnu Umar",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ  ، أَخْبَرَنَا عِمْرَانُ بْنُ حُدَيْرٍ  ، عَنْ أَبِي الْبَزَرِيِّ : يَزِيدَ بْنِ عُطَارِدَ  ، عَنْ ابْنِ عُمَرَ  ، قَالَ : \" كُنَّانَشْرَبُ وَنَحْنُ قِيَامٌ، وَنَأْكُلُ وَنَحْنُ نَسْعَى عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \".\nأَخْبَرَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ  ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ  ، عَنْ عُبَيْدِ اللَّهِ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ  ، نَحْوَهُ",
    "malay_translation": "Telah menceritakan kepada kami Uthman bin Umar, telah mengkhabarkan kepada kami Imran bin Hudair, daripada Abu al-Bazari iaitu Yazid bin Utarid, daripada Ibnu Umar, beliau berkata: \"Kami pernah minum sambil berdiri dan makan sambil berjalan pada zaman Rasulullah SAW.\" Abu Bakar bin Abi Syaibah telah mengkhabarkan kepada kami, Hafs bin Ghiyath telah menceritakan kepada kami, daripada Ubaidillah, daripada Nafi', daripada Ibnu Umar, dengan hadis yang serupa."
  },
  {
    "id": 38951,
    "hadith_number": 1414,
    "tajuk_hadith": "Larangan Minum sambil Berdiri",
    "perawi_melayu": "Diriwayatkan daripada Anas RA bahawa Nabi SAW melarang minum sambil berdiri.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا هَمَّامٌ  ، حَدَّثَنَا قَتَادَةُ  ، عَنْ أَنَسٍ  ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" نَهَى عَنْ الشُّرْبِ قَائِمًا \".\nقَالَ : وَسَأَلْتُهُ عَنْ الْأَكْلِ، فَقَالَ : \" ذَاكَ أَخْبَثُ \"",
    "malay_translation": "Muslim bin Ibrahim telah mengkhabarkan kepada kami, Hammam telah menceritakan kepada kami, Qatadah telah menceritakan kepada kami, daripada Anas RA, bahawa Nabi SAW melarang daripada minum sambil berdiri. Dia (Qatadah) berkata: Aku bertanya kepadanya (Anas) tentang makan (sambil berdiri), maka Baginda bersabda: \"Itu lebih buruk.\""
  },
  {
    "id": 38952,
    "hadith_number": 1415,
    "tajuk_hadith": "Larangan Minum Sambil Berdiri dan Kehadiran Syaitan",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ الرَّبِيعِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ أَبِي زِيَادٍ الطَّحَّانِ  ، قَالَ : سَمِعْتُ أَبَا هُرَيْرَةَ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ لِرَجُلٍ رَآهُ يَشْرَبُ قَائِمًا : \" قِئْ \".\nقَالَ : لِمَ؟ قَالَ : \" أَتُحِبُّ أَنْ تَشْرَبَ مَعَ الْهِرِّ؟ \" قَالَ : لَا، قَالَ : \" فَقَدْشَرِبَ مَعَكَ شَرٌّ مِنْهُ، الشَّيْطَانُ \"",
    "malay_translation": "Sa'id bin ar-Rabi' telah mengkhabarkan kepada kami, Syu'bah telah menceritakan kepada kami, daripada Abu Ziyad at-Tahhan, dia berkata: Aku mendengar Abu Hurairah R.A. daripada Nabi SAW, bersabda kepada seorang lelaki yang dilihatnya minum sambil berdiri: \"Muntahkanlah.\"\n\nLelaki itu bertanya: \"Kenapa?\" Baginda bersabda: \"Adakah kamu suka minum bersama kucing?\" Lelaki itu menjawab: \"Tidak.\" Baginda bersabda: \"Sesungguhnya telah minum bersamamu sesuatu yang lebih buruk daripadanya, iaitu syaitan.\""
  },
  {
    "id": 38953,
    "hadith_number": 1416,
    "tajuk_hadith": "Larangan Minum dari Bekas Perak",
    "perawi_melayu": "Ahmad bin Yunus meriwayatkan daripada Laith bin Sa'd, daripada Nafi', daripada Zaid bin Abdullah bin Umar, daripada Abdullah bin Abd al-Rahman bin Abi Bakr, daripada Ummu Salamah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ يُونُسَ  ، حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ  ، عَنْ نَافِعٍ  ، عَنْ زَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ  ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ  ، عَنْ أُمِّ سَلَمَةَ  ، أَنَّهَا أَخْبَرَتْهُ أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" الَّذِي يَشْرَبُ فِي آنِيَةٍ مِنْ فِضَّةٍ، فَإِنَّمَا يُجَرْجِرُ فِي بَطْنِهِ نَارَ جَهَنَّمَ \"",
    "malay_translation": "Ahmad bin Yunus telah mengkhabarkan kepada kami, katanya: Laith bin Sa'd telah menceritakan kepada kami, daripada Nafi', daripada Zaid bin Abdullah bin Umar, daripada Abdullah bin Abd al-Rahman bin Abi Bakr, daripada Ummu Salamah, bahawa beliau telah mengkhabarkan kepadanya bahawa Rasulullah SAW bersabda: \"Sesiapa yang minum dari bekas perak, maka sesungguhnya dia menggelegakkan api neraka Jahannam di dalam perutnya.\""
  },
  {
    "id": 38954,
    "hadith_number": 1417,
    "tajuk_hadith": "Larangan Minum dan Makan dalam Bekas Emas dan Perak",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ  ، حَدَّثَنَا ابْنُ عَوْنٍ  ، عَنْ مُجَاهِدٍ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى  ، قَالَ : خَرَجْنَا مَعَ حُذَيْفَةَ   إِلَى الْمَدَائِنِ فَاسْتَسْقَى، فَأَتَاهُ دِهْقَانٌ بِإِنَاءٍ مِنْ فِضَّةٍ، فَرَمَى بِهِ وَجْهَهُ، فَقُلْنَا : اسْكُتُوا، فَإِنَّا إِنْ سَأَلْنَاهُ لَمْ يُحَدِّثْنَا، فَلَمَّا كَانَ بَعْدُ، قَالَ : أَتَدْرُونَ لِمَ رَمَيْتُهُ؟ قُلْنَا : لَا، قَالَ إِنِّي كُنْتُ نَهَيْتُهُ، وَذَكَرَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُنَهَى عَنْ الشُّرْبِ فِي آنِيَةِ الذَّهَبِ وَالْفِضَّةِ، وَعَنْ لُبْسِ الْحَرِيرِ وَالدِّيبَاجِ، وَقَالَ : \" هُمَا لَهُمْ فِي الدُّنْيَا، وَلَكُمْ فِي الْآخِرَةِ \"",
    "malay_translation": "Telah menceritakan kepada kami Uthman bin Umar, telah menceritakan kepada kami Ibnu Aun, daripada Mujahid, daripada Abdurrahman bin Abi Laila, dia berkata: Kami keluar bersama Huzaifah menuju Mada'in lalu dia meminta minum. Kemudian seorang petani datang kepadanya dengan membawa bejana perak, lalu Huzaifah melempar bejana itu ke wajahnya. Kami berkata, \"Diamlah, jika kita bertanya kepadanya, dia tidak akan menceritakan kepada kita.\" Setelah itu, dia berkata, \"Tahukah kamu mengapa aku melemparnya?\" Kami menjawab, \"Tidak.\" Dia berkata, \"Sesungguhnya aku telah melarangnya (menggunakan bejana perak), dan dia menyebutkan bahawa Nabi SAW melarang minum dan makan menggunakan bejana emas dan perak, dan melarang memakai sutera. Baginda bersabda, 'Itu untuk mereka di dunia, dan untuk kamu di akhirat.'"
  },
  {
    "id": 38955,
    "hadith_number": 1418,
    "tajuk_hadith": "Anjuran Menutup Bekas Makanan dan Minuman Walaupun dengan Sekeping Kayu",
    "perawi_melayu": "Diriwayatkan oleh Jabir, daripada Abu Humaid as-Sa'idi",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ ابْنِ جُرَيْجٍ  ، عَنْ أَبِي الزُّبَيْرِ  ، حَدَّثَنِي جَابِرٌ  ، قَالَ : حَدَّثَنِي أَبُو حُمَيْدٍ السَّاعِدِيُّ  ، قَالَ : أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِلَبَنٍ، فَقَالَ :\" أَلَا خَمَّرْتَهُ وَلَوْ تَعْرِضُ عَلَيْهِ عُودًا؟ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu 'Asim, daripada Ibnu Juraij, daripada Abu az-Zubair, telah menceritakan kepadaku Jabir, beliau berkata: Telah menceritakan kepadaku Abu Humaid as-Sa'idi, beliau berkata: Aku mendatangi Rasulullah SAW dengan (membawa) susu, lalu Baginda bersabda: \"Tidakkah kamu menutupnya walaupun hanya dengan meletakkan sebatang kayu di atasnya?\""
  },
  {
    "id": 38956,
    "hadith_number": 1419,
    "tajuk_hadith": "Perintah Menutup Bekas Air Wuduk, Mengikat Tempat Air dan Menelungkupkan Bekas",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah R.A.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ  ، عَنْ خَالِدٍ  ، عَنْ سُهَيْلٍ  ، عَنْ أَبِيهِ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : \" أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَبِتَغْطِيَةِ الْوَضُوءِ، وَإِيكَاءِ السِّقَاءِ، وَإِكْفَاءِ الْإِنَاءِ \"",
    "malay_translation": "Telah menceritakan kepada kami 'Amru bin 'Aun, daripada Khalid, daripada Suhail, daripada ayahnya, daripada Abu Hurairah R.A., beliau berkata: \"Rasulullah SAW memerintahkan kami untuk menutup bekas air wuduk, mengikat tempat air (kirbah), dan menelungkupkan bekas.\" "
  },
  {
    "id": 38957,
    "hadith_number": 1420,
    "tajuk_hadith": "Larangan Meniup ke Dalam Minuman",
    "perawi_melayu": "Diriwayatkan daripada Abu Sa'id al-Khudri RA bahawa Marwan bertanya kepadanya: Adakah kamu mendengar Rasulullah SAW melarang meniup ke dalam minuman? Beliau menjawab: Ya.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ أَيُّوبَ بْنِ حَبِيبٍ  ، عَنْ أَبِي الْمُثَنَّى الْجُهَنِيِّ  ، قَالَ : قَالَ مَرْوَانُ لِأَبِي سَعِيدٍ الْخُدْرِيّ   : هَلْ سَمِعْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَيَنْهَى عَنْ النَّفْخِ فِي الشَّرَابِ؟ قَالَ : \" نَعَمْ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Khalid bin Makhlad, telah menceritakan kepada kami Malik, daripada Ayyub bin Habib, daripada Abu al-Muthanna al-Juhani, beliau berkata: Marwan berkata kepada Abu Sa'id al-Khudri: Adakah kamu mendengar Rasulullah SAW melarang daripada meniup ke dalam minuman? Beliau menjawab: \"Ya.\""
  },
  {
    "id": 38958,
    "hadith_number": 1421,
    "tajuk_hadith": "Larangan Meniup ke Dalam Minuman",
    "perawi_melayu": "Diriwayatkan daripada Ibnu Abbas RA bahawa Nabi SAW melarang daripada meniup ke dalam minuman.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ  ، عَنْ ابْنِ عُيَيْنَةَ  ، عَنْ عَبْدِ الْكَرِيمِ الْجَزَرِيِّ  ، عَنْ عِكْرِمَةَ  ، عَنْ ابْنِ عَبَّاسٍ  ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" نَهَى عَنْ النَّفْخِ فِي الشَّرَابِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami 'Amru bin 'Aun, daripada Ibnu 'Uyainah, daripada 'Abdul Karim al-Jazari, daripada 'Ikrimah, daripada Ibnu 'Abbas RA, bahawa Nabi SAW melarang daripada meniup ke dalam minuman."
  },
  {
    "id": 38959,
    "hadith_number": 1422,
    "tajuk_hadith": "Orang yang Menuangkan Minuman untuk Suatu Kaum, Dialah yang Terakhir Minum",
    "perawi_melayu": "Diriwayatkan daripada Abu Qatadah RA, bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، وَسُلَيْمَانُ بْنُ الْمُغِيرَةِ  ، عَنْ ثَابِتٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ  ، عَنْ أَبِي قَتَادَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" سَاقِي الْقَوْمِ آخِرُهُمْ شُرْبًا \"",
    "malay_translation": "Telah menceritakan kepada kami Affan bin Muslim, telah menceritakan kepada kami Hammad bin Salamah dan Sulaiman bin al-Mughirah, daripada Thabit, daripada Abdullah bin Rabah, daripada Abu Qatadah, dia berkata: Rasulullah SAW bersabda, \"Orang yang menuangkan minuman untuk suatu kaum, dialah yang terakhir minum.\""
  }
]
