[
  {
    "id": 39339,
    "hadith_number": 1802,
    "tajuk_hadith": "Halal dan Haram Jelas, Hati Penentu Segala",
    "perawi_melayu": "Nu'man bin Bashir",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا زَكَرِيَّا  ، عَنْ الشَّعْبِيِّ  ، قَالَ : سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ  ، يَقُولُ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" الْحَلَالُ بَيِّنٌ وَالْحَرَامُ بَيِّنٌ، وَبَيْنَهُمَا مُتَشَابِهَاتٌ، لَا يَعْلَمُهَا كَثِيرٌ مِنَ النَّاسِ فَمَنْ اتَّقَى الشُّبُهَاتِ، اسْتَبْرَأَ لِعِرْضِهِ وَدِينِهِ، وَمَنْ وَقَعَ فِي الشُّبُهَاتِ، وَقَعَ فِي الْحَرَامِ، كَالرَّاعِي يَرْعَى حَوْلَ الْحِمَى فَيُوشِكُ أَنْ يُوَاقِعَهُ، وَإِنَّ لِكُلِّ مَلِكٍ حِمًى، أَلَا وَإِنَّ حِمَى اللَّهِ مَحَارِمُهُ، أَلَا وَإِنَّ فِي الْجَسَدِ مُضْغَةً، إِذَا صَلَحَتْ ، صَلَحَ الْجَسَدُ كُلُّهُ، وَإِذَا فَسَدَتْ، فَسَدَ الْجَسَدُ كُلُّهُ، أَلَا وَهِيَ الْقَلْبُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Nu'aim, telah menceritakan kepada kami Zakaria, daripada Asy-Sya'bi, beliau berkata: Saya mendengar An-Nu'man bin Bashir, berkata: Saya mendengar Rasulullah SAW, bersabda: \"Sesungguhnya yang halal itu jelas dan yang haram itu jelas, dan di antara keduanya terdapat perkara-perkara syubhat (samar-samar), yang tidak diketahui oleh kebanyakan manusia. Maka, barangsiapa yang menjaga dirinya daripada perkara-perkara syubhat, sesungguhnya dia telah membersihkan kehormatan dan agamanya. Dan barangsiapa yang terjerumus ke dalam perkara-perkara syubhat, dia akan terjerumus ke dalam yang haram, seperti penggembala yang menggembala di sekitar kawasan larangan, hampir-hampir dia akan memasukinya. Sesungguhnya bagi setiap raja ada kawasan larangan, ketahuilah bahawa sesungguhnya kawasan larangan Allah adalah perkara-perkara yang diharamkan-Nya. Ketahuilah, sesungguhnya di dalam jasad itu ada seketul daging; jika ia baik, maka baiklah seluruh jasad, dan jika ia rosak, maka rosaklah seluruh jasad. Ketahuilah, ia adalah hati.\""
  },
  {
    "id": 39340,
    "hadith_number": 1803,
    "tajuk_hadith": "Tinggalkan Perkara yang Meragukan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ بُرَيْدِ بْنِ أَبِي مَرْيَمَ  ، عَنْ أَبِي الْحَوْرَاءِ السَّعْدِيِّ  ، قَالَ : قُلْتُ لِلْحَسَنِ بْنِ عَلِيٍّ   : مَا تَحْفَظُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟.\nقَالَ : سَأَلَهُ رَجُلٌ عَنْ مَسْأَلَةٍ لَا أَدْرِي مَا هِيَ، فَقَالَ :\" دَعْ مَا يَرِيبُكَ إِلَى مَا لَا يَرِيبُكَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Sa'id bin 'Amir, telah menceritakan kepada kami Syu'bah, daripada Buraid bin Abi Maryam, daripada Abu al-Haura' as-Sa'di, dia berkata: Aku berkata kepada al-Hasan bin 'Ali: Apa yang engkau hafal daripada Rasulullah SAW?.\nDia berkata: Seorang lelaki bertanya kepada baginda tentang suatu masalah yang aku tidak tahu apa ia, lalu baginda bersabda: \"Tinggalkan apa yang meragukanmu kepada apa yang tidak meragukanmu.\""
  },
  {
    "id": 39341,
    "hadith_number": 1804,
    "tajuk_hadith": "Tanya Hati Nurani Anda Tentang Kebaikan dan Dosa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ الزُّبَيْرِ أَبِي عَبْدِ السَّلَامِ  ، عَنْ أَيُّوبَ بْنِ عَبْدِ اللَّهِ بْنِ مِكْرَزٍ الْفِهْرِيِّ  ، عَنْ وَابِصَةَ بْنِ مَعْبَدٍ الْأَسَدِيِّ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ لِوَابِصَةَ : \" جِئْتَ تَسْأَلُ عَنِ الْبِرِّ وَالْإِثْمِ؟ \".\nقَالَ : قُلْتُ : نَعَمْ.\nقَالَ : فَجَمَعَ أَصَابِعَهُ فَضَرَبَ بِهَا صَدْرَهُ، وَقَالَ :\" اسْتَفْتِ نَفْسَكَ.\nاسْتَفْتِ قَلْبَكَ يَا وَابِصَةُ ثَلَاثًا الْبِرُّ مَا اطْمَأَنَّتْ إِلَيْهِ النَّفْسُ وَاطْمَأَنَّ إِلَيْهِ الْقَلْبُ، وَالْإِثْمُ مَا حَاكَ فِي النَّفْسِ وَتَرَدَّدَ فِي الصَّدْرِ، وَإِنْ أَفْتَاكَ النَّاسُ وَأَفْتَوْكَ \"",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Hammad bin Salamah, daripada Zubair Abu 'Abd Salam, daripada Ayyub bin 'Abdullah bin Mikraz al-Fihri, daripada Wabishah bin Ma'bad al-Asadi: Sesungguhnya Rasulullah ﷺ bersabda kepada Wabishah: \"Adakah kamu datang untuk bertanya tentang kebaikan dan dosa?\". Dia (Wabishah) berkata: \"Ya\". Baginda bersabda: Lalu Baginda menghimpunkan jari-jemarinya dan memukulkannya ke dada Baginda, dan bersabda: \"Mintalah fatwa kepada dirimu sendiri. Mintalah fatwa kepada hatimu wahai Wabishah\" - tiga kali - \"Kebaikan adalah apa yang jiwa tenang kepadanya dan hati tenang kepadanya, dan dosa adalah apa yang bergetar dalam jiwa dan teragak-agak di dada, walaupun manusia memberi fatwa kepadamu dan mereka memberi fatwa kepadamu.\""
  },
  {
    "id": 39342,
    "hadith_number": 1805,
    "tajuk_hadith": "Pengharaman Riba Jahiliyyah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، أَخْبَرَنَا عَلِيُّ بْنُ زَيْدٍ  ، عَنْ أَبِي حُرَّةَ الرَّقَاشِيِّ  ، عَنْ عَمِّهِ  ، قَالَ : كُنْتُ آخِذًا بِزِمَامِ نَاقَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَوْسَطِ أَيَّامِ التَّشْرِيقِ أَذُودُ النَّاسَ عَنْهُ، فَقَالَ :\" أَلَا إِنَّ كُلَّ رِبًا فِي الْجَاهِلِيَّةِ مَوْضُوعٌ، أَلَا وَإِنَّ اللَّهَ قَدْ قَضَى أَنَّ أَوَّلَ رِبًا يُوضَعُ رِبَا عَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ، لَكُمْ رُءُوسُ أَمْوَالِكُمْ لَا تَظْلِمُونَ وَلَا تُظْلَمُونَ \"",
    "malay_translation": "Diriwayatkan daripada Hajjaj bin Minhal, diriwayatkan daripada Hammad bin Salamah, dikhabarkan daripada Ali bin Zaid, daripada Abu Hurrah al-Raqashi, daripada bapa saudaranya, beliau berkata: 'Saya sedang memegang tali unta Rasulullah SAW pada pertengahan Hari Tasyrik, menghalau orang ramai daripada baginda. Baginda bersabda: 'Ketahuilah, sesungguhnya setiap riba pada zaman Jahiliyyah adalah dihapuskan. Ketahuilah, sesungguhnya Allah telah menetapkan bahawa riba pertama yang dihapuskan adalah riba Abbas bin Abdul Muttalib. Kamu berhak atas modal kamu, kamu tidak menzalimi dan tidak dizalimi.'"
  },
  {
    "id": 39343,
    "hadith_number": 1806,
    "tajuk_hadith": "Larangan Riba",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ أَبِي قَيْسٍ  ، عَنْ هُزَيْلٍ  ، عَنْ عَبْدِ اللَّهِ  ، قَالَ : \" لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَآكِلَ الرِّبَا وَمُؤْكِلَهُ \"",
    "malay_translation": "Abu Nu'aim memberitahu kami, Sufyan menceritakan kepada kami, daripada Abu Qais, daripada Huzail, daripada Abdullah, dia berkata: \"Rasulullah SAW melaknat pemakan riba dan pemberi makan riba.\""
  },
  {
    "id": 39344,
    "hadith_number": 1807,
    "tajuk_hadith": "Zaman Ketidakpedulian Terhadap Sumber Pendapatan",
    "perawi_melayu": "Abu Hurairah RA",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ  ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ  ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ  ، عَنْ أَبِي هُرَيْرَةَ   : أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" لَيَأْتِيَنَّ زَمَانٌ لَا يُبَالِي الْمَرْءُ بِمَا أَخَذَ الْمَالَ، بِحَلَالٍ أَمْ بِحَرَامٍ \"",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Abdullah bin Yunus, telah menceritakan kepada kami Ibnu Abi Dzi'b, dari Sa'id al-Maqburi, dari Abu Hurairah RA: Bahawa Rasulullah SAW bersabda: \"Akan datang suatu zaman di mana seseorang tidak lagi peduli dari mana dia mendapatkan harta, apakah dari jalan yang halal atau haram.\""
  },
  {
    "id": 39345,
    "hadith_number": 1808,
    "tajuk_hadith": "Makanan Terbaik Adalah dari Usaha Sendiri dan Anak dari Usaha Terbaik",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا قَبِيصَةُ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ مَنْصُورٍ  ، عَنْ إِبْرَاهِيمَ  ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ  ، عَنْ عَمَّتِهِ  ، عَنْ عَائِشَةَ  ، قَالَتْ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِنَّ أَحَقَّ مَا يَأْكُلُ الرَّجُلُ مِنْ أَطْيَبِ كَسْبِهِ، وَإِنَّ وَلَدَهُ مِنْ أَطْيَبِ كَسْبِهِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Qabisah, telah menceritakan kepada kami Sufyan, daripada Mansur, daripada Ibrahim, daripada 'Umarah bin 'Umair, daripada ibu saudaranya, daripada Aisyah, dia berkata: Rasulullah SAW bersabda: \"Sesungguhnya sebaik-baik apa yang dimakan oleh seorang lelaki adalah dari usaha yang paling baik, dan sesungguhnya anaknya adalah dari usaha yang paling baik.\""
  },
  {
    "id": 39346,
    "hadith_number": 1809,
    "tajuk_hadith": "Ancaman bagi Pedagang yang Tidak Bertakwa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ عَبْدِ اللَّهِ هُوَ : ابْنُ عُثْمَانَ بْنِ خُثَيْمٍ  عَنْ إِسْمَاعِيل بْنِ رِفَاعَةَ  ، عَنْ أَبِيهِ  ، عَنْ جَدِّهِ  ، قَالَ : خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْبَقِيعِ ، فَقَالَ : \" يَا مَعْشَرَ التُّجَّارِ ! \" حَتَّى إِذَا اشْرَأَبُّوا.\nقَالَ :\" التُّجَّارُ يُحْشَرُونَ يَوْمَ الْقِيَامَةِ فُجَّارًا، إِلَّا مَنِ اتَّقَى اللَّهَ، وَبَرَّ، وَصَدَقَ \".\n قَالَ أَبُو مُحَمَّدٍ : كَانَ أَبُو نُعَيْمٍ، يَقُولُ : عُبَيْدُ اللَّهِ بْنُ رِفَاعَةَ، وَإِنَّمَا هُوَ : إِسْمَاعِيل بْنُ عُبَيْدِ بْنِ رِفَاعَةَ",
    "malay_translation": "Abu Nu'aim telah memberitahu kami, Sufyan telah menceritakan kepada kami, daripada Abdullah—iaitu Ibn Uthman bin Khuthaym—daripada Ismail bin Rifaa'ah, daripada bapanya, daripada datuknya, katanya: Rasulullah SAW keluar ke Baqi', lalu bersabda: \"Wahai golongan pedagang!\" sehingga apabila mereka menoleh kepada baginda.\nBaginda bersabda: \"Para pedagang akan dibangkitkan pada hari kiamat sebagai orang-orang yang jahat, kecuali orang yang bertakwa kepada Allah, berbuat baik, dan jujur.\"\nAbu Muhammad berkata: Abu Nu'aim pernah berkata: 'Ubaidullah bin Rifaa'ah, tetapi yang benar adalah: Ismail bin Ubaid bin Rifaa'ah."
  },
  {
    "id": 39347,
    "hadith_number": 1810,
    "tajuk_hadith": "Keutamaan Pedagang yang Jujur dan Amanah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا قَبِيصَةُ  ، أَخْبَرَنَا سُفْيَانُ  ، عَنْ أَبِي حَمْزَةَ  ، عَنْ الْحَسَنِ  ، عَنْ أَبِي سَعِيدٍ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" التَّاجِرُ الصَّدُوقُ الْأَمِينُ مَعَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَدَاءِ \".\n قَالَ عَبْدُ اللَّهِ : لَا عِلْمَ لِي بِهِ إِنَّ الْحَسَنَ سَمِعَ مِنْ أَبِي سَعِيدٍ، وَقَالَ : أَبُو حَمْزَةَ هَذَا، هُوَ صَاحِبُ إِبْرَاهِيمَ، وَهُوَ : مَيْمُونٌ الْأَعْوَرُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Qabisah, telah mengkhabarkan kepada kami Sufyan, daripada Abu Hamzah, daripada al-Hasan, daripada Abu Sa'id, daripada Nabi صلى الله عليه وسلم, baginda bersabda: \"Pedagang yang jujur lagi amanah (akan ditempatkan) bersama para nabi, orang-orang yang benar, dan para syuhada'.\"\nAbdullah berkata: Saya tidak tahu mengenainya sama ada al-Hasan mendengar daripada Abu Sa'id. Dan dia berkata: Abu Hamzah ini, dia adalah sahabat Ibrahim, dan dia adalah Maimun al-A'war."
  },
  {
    "id": 39348,
    "hadith_number": 1811,
    "tajuk_hadith": "Ikrar Bai'ah kepada Rasulullah SAW: Mendirikan Solat, Menunaikan Zakat, dan Memberi Nasihat kepada Setiap Muslim",
    "perawi_melayu": "Ya'la bin Ubaid, Ismail, Qais, Jarir bin Abdullah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ  ، حَدَّثَنَا إِسْمَاعِيل  ، عَنْ قَيْسٍ  ، عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ  ، قَالَ : \" بَايَعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَىإِقَامِ الصَّلَاةِ، وَإِيتَاءِ الزَّكَاةِ، وَالنُّصْحِ لِكُلِّ مُسْلِمٍ \"",
    "malay_translation": "Telah meriwayatkan kepada kami Ya'la bin Ubaid, telah meriwayatkan kepada kami Ismail, daripada Qais, daripada Jarir bin Abdullah, beliau berkata: \"Aku telah berbai'ah (berjanji setia) kepada Rasulullah SAW untuk mendirikan solat, menunaikan zakat, dan memberi nasihat kepada setiap Muslim.\""
  },
  {
    "id": 39349,
    "hadith_number": 1812,
    "tajuk_hadith": "Larangan Menipu dalam Jual Beli",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّلْتِ  ، حَدَّثَنَا أَبُو عَقِيلٍ : يَحْيَى بْنُ الْمُتَوَكِّلِ  ، قَالَ : أَخْبَرَنِي الْقَاسِمُ بْنُ عُبَيْدِ اللَّهِ  ، عَنْ سَالِمٍ  ، عَنِ ابْنِ عُمَرَ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِطَعَامٍ بِسُوقِ الْمَدِينَةِ فَأَعْجَبَهُ حُسْنُهُ، فَأَدْخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ فِي جَوْفِهِ، فَأَخْرَجَ شَيْئًا لَيْسَ كَالظَّاهِرِ فَأَفَّفَ بِصَاحِبِ الطَّعَامِ، ثُمَّ قَالَ :\" لَا غِشَّ بَيْنَ الْمُسْلِمِينَ، مَنْ غَشَّنَا فَلَيْسَ مِنَّا \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin As-Salt, telah menceritakan kepada kami Abu Aqil: Yahya bin Al-Mutawakkil, dia berkata: Telah mengkhabarkan kepadaku Al-Qasim bin Ubaidillah, dari Salim, dari Ibnu Umar: Bahawa Rasulullah SAW melewati makanan di pasar Madinah, lalu baginda kagum dengan keindahannya. Kemudian Rasulullah SAW memasukkan tangannya ke dalam (makanan) itu, lalu mengeluarkan sesuatu yang tidak seperti yang terlihat (di permukaan). Baginda merasa jijik dengan pemilik makanan itu, kemudian bersabda: \"Tidak boleh ada penipuan di antara kaum Muslimin, barangsiapa menipu kami, maka dia bukan dari golongan kami.\""
  },
  {
    "id": 39350,
    "hadith_number": 1813,
    "tajuk_hadith": "Balasan untuk Pengkhianatan di Hari Kiamat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ الرَّبِيعِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ سُلَيْمَانَ  ، قَالَ : سَمِعْتُ أَبَا وَائِلٍ  ، عَنْ عَبْدِ اللَّهِ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" لِكُلِّ غَادِرٍ لِوَاءٌ يَوْمَ الْقِيَامَةِ يُقَالُ : هَذِهِ غَدْرَةُ فُلَانٍ \"",
    "malay_translation": "Sa'id bin ar-Rabi' telah menceritakan kepada kami, Syu'bah telah menceritakan kepada kami, dari Sulaiman, dia berkata: Saya mendengar Abu Wa'il, dari Abdullah, dari Nabi Muhammad ﷺ, beliau bersabda: \"Setiap pengkhianat akan memiliki bendera pada hari kiamat, dikatakan: 'Ini adalah pengkhianatan si fulan.'\""
  },
  {
    "id": 39351,
    "hadith_number": 1814,
    "tajuk_hadith": "Larangan Menimbun Barang Kecuali Bagi Orang yang Berdosa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ خَالِدٍ  ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاق  ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ  ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ  ،  عَنْ مَعْمَرِ بْنِ عَبْدِ اللَّهِ بْنِ نَافِعِ بْنِ نَضْلَةَ الْعَدَوِيِّ  ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" لَا يَحْتَكِرُ إِلَّا خَاطِئٌ مَرَّتَيْنِ \"",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Khalid, telah menceritakan kepada kami Muhammad bin Ishaq, dari Muhammad bin Ibrahim, dari Sa'id bin al-Musayyib, dari Ma'mar bin Abdullah bin Nafi' bin Nadhlah al-Adawi, dia berkata: Aku mendengar Rasulullah SAW bersabda: 'Tidaklah melakukan penimbunan kecuali orang yang berdosa.'"
  },
  {
    "id": 39352,
    "hadith_number": 1815,
    "tajuk_hadith": "Keberkatan Bagi Pembawa Barang dan Laknat Bagi Penyorok Barang",
    "perawi_melayu": "Muhammad bin Yusuf, Israil, Ali bin Salim, Ali bin Zaid bin Jud'an, Sa'id bin al-Musayyib, daripada Umar",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ إِسْرَائِيلَ  ، عَنْ عَلِيِّ بْنِ سَالِمٍ  ، عَنْ عَلِيِّ بْنِ زَيْدِ بْنِ جُدْعَانَ  ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ  ، عَنْ عُمَرَ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" الْجَالِبُ مَرْزُوقٌ، وَالْمُحْتَكِرُ مَلْعُونٌ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Yusuf, daripada Israil, daripada Ali bin Salim, daripada Ali bin Zaid bin Jud'an, daripada Sa'id bin al-Musayyib, daripada Umar, daripada Nabi ﷺ, baginda bersabda: \"Pembawa barang (ke pasar) diberi rezeki, dan penyorok barang dilaknat.\""
  },
  {
    "id": 39353,
    "hadith_number": 1816,
    "tajuk_hadith": "Harga Mahal dan Penjelasan Bahawa Allah Penentu Harga",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ  ، أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ حُمَيْدٍ  ، وَثَابِتٍ  ، وَقَتَادَةَ  ، عَنْ أَنَسٍ  ، قَالَ : غَلَا السِّعْرُ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ النَّاسُ : يَا رَسُولَ اللَّهِ غَلَا السِّعْرُ فَسَعِّرْ لَنَا، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِنَّ اللَّهَ هُوَ الْخَالِقُ الْقَابِضُ الْبَاسِطُ الرَّازِقُ، الْمُسَعِّرُ، وَإِنِّي أَرْجُو أَنْ أَلْقَى رَبِّي وَلَيْسَ أَحَدٌ مِنْكُمْ يَطْلُبُنِي بِمَظْلَمَةٍ ظَلَمْتُهَا إِيَّاهُ بِدَمٍ وَلَا مَالٍ \"",
    "malay_translation": " عمرو bin Aun memberitahu kami, Hammad bin Salamah memberitahu kami, daripada Humaid, Thabit, dan Qatadah, daripada Anas, dia berkata: Harga menjadi tinggi pada zaman Nabi ﷺ, maka orang ramai berkata: Wahai Rasulullah, harga telah menjadi tinggi, maka tetapkanlah harga untuk kami. Rasulullah ﷺ bersabda: \"Sesungguhnya Allah adalah Pencipta, Penahan, Pembentang, Pemberi Rezeki, Penentu Harga. Dan sesungguhnya aku berharap untuk bertemu Tuhanku dan tidak ada seorang pun di antara kamu yang menuntutku atas kezaliman yang aku lakukan kepadanya, baik dalam darah mahupun harta.\""
  },
  {
    "id": 39354,
    "hadith_number": 1817,
    "tajuk_hadith": "Kelebihan Memaafkan Hutang",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ  ، حَدَّثَنَا زُهَيْرٌ  ، حَدَّثَنَا مَنْصُورُ بْنُ الْمُعْتَمِرِ  ،  عَنْ رِبْعِيِّ بْنِ حِرَاشٍ  : أَنَّ حُذَيْفَةَ   حَدَّثَهُمْ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" تَلَقَّتِ الْمَلَائِكَةُ رُوحَ رَجُلٍ مِمَّنْ قَبْلَكُمْ، فَقَالُوا : أَعَمِلْتَ مِنَ الْخَيْرِ شَيْئًا؟، فَقَالَ : لَا، قَالُوا : تَذَكَّرْ.\nقَالَ : كُنْتُ أُدَايِنُ النَّاسَ فَآمُرُ فِتْيَانِي أَنْ يُنْظِرُوا الْمُعْسِرَ، وَيَتَجَاوَزُوا عَنِ الْمُوسِرِ \".\nقَالَ : \" قَالَ اللَّهُ : تَجَاوَزُوا عَنْهُ \"",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Yunus, telah menceritakan kepada kami Zuhair, telah menceritakan kepada kami Mansur bin al-Mu'tamir, daripada Rib'i bin Hirash: Bahawa Huzaifah menceritakan kepada mereka, katanya: Rasulullah SAW bersabda: \"Malaikat telah menemui roh seorang lelaki daripada umat sebelum kamu. Mereka bertanya: 'Adakah kamu pernah melakukan kebaikan?', dia menjawab: 'Tidak.' Mereka berkata lagi: 'Cuba ingat kembali.' Lelaki itu berkata: 'Dahulu, aku memberikan pinjaman kepada orang ramai dan aku memerintahkan pembantu-pembantuku untuk memberi penangguhan kepada orang yang kesulitan dan memaafkan (memberikan diskaun) kepada orang yang berada.'\" Baginda bersabda: \"Allah berfirman: 'Maafkanlah dia (orang ini).'"
  },
  {
    "id": 39355,
    "hadith_number": 1818,
    "tajuk_hadith": "Hadis mengenai pilihan dalam jual beli dan keberkatan kejujuran",
    "perawi_melayu": "Said bin Amir",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ  ، عَنْ سَعِيدٍ  ، عَنْ قَتَادَةَ  ، عَنْ صَالِحٍ أَبِي الْخَلِيلِ  ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ  ، عَنْ حَكِيمِ بْنِ حِزَامٍ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا فَإِنْ صَدَقَا وَبَيَّنَا، بُورِكَ لَهُمَا فِي بَيْعِهِمَا، وَإِنْ كَذَبَا وَكَتَمَا، مُحِقَ بَرَكَةُ بَيْعِهِمَا \".\nأَخْبَرَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ قَتَادَةَ  ، بِإِسْنَادِهِ مِثْلَهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Sa'id bin Amir, daripada Sa'id, daripada Qatadah, daripada Salih Abu al-Khalil, daripada Abdullah bin al-Harith, daripada Hakim bin Hizam: Bahawa Rasulullah ﷺ bersabda: \"Penjual dan pembeli memiliki pilihan (untuk membatalkan atau meneruskan jual beli) selama mereka belum berpisah. Jika mereka berdua jujur dan menjelaskan (keadaan barang), maka jual beli mereka akan diberkahi. Namun, jika mereka berdusta dan menyembunyikan (cacat barang), maka keberkahan jual beli mereka akan dihapuskan.\"\nTelah mengkhabarkan kepada kami Abu al-Walid, telah menceritakan kepada kami Syu'bah, daripada Qatadah, dengan sanad yang serupa."
  },
  {
    "id": 39356,
    "hadith_number": 1819,
    "tajuk_hadith": "Hukum Jika Penjual dan Pembeli Berselisih Tanpa Bukti",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُثْمَانُ بْنُ مُحَمَّدٍ  ، حَدَّثَنَا هُشَيْمٌ  ، حَدَّثَنَا ابْنُ أَبِي لَيْلَى  ، عَنْ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ  ، عَنْ أَبِيهِ  ، عَنْ عَبْدِ اللَّهِ  ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" الْبَيِّعَانِ إِذَا اخْتَلَفَا وَالْمَبيعُ قَائِمٌ بِعَيْنِهِ، وَلَيْسَ بَيْنَهُمَا بَيِّنَةٌ، فَالْقَوْلُ مَا قَالَ الْبَائِعُ، أَوْ يَتَرَادَّانِ الْبَيْعَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Uthman bin Muhammad, telah menceritakan kepada kami Hushaim, telah menceritakan kepada kami Ibn Abi Laila, daripada al-Qasim bin Abd al-Rahman, daripada ayahnya, daripada Abdullah, dia berkata: Aku mendengar Rasulullah SAW bersabda: “Dua orang penjual dan pembeli apabila berselisih dan barang jualan masih ada, dan tidak ada bukti di antara keduanya, maka perkataan adalah perkataan penjual, atau mereka berdua membatalkan jual beli.”"
  },
  {
    "id": 39357,
    "hadith_number": 1820,
    "tajuk_hadith": "Larangan Menjual Atas Jualan Saudara Muslim",
    "perawi_melayu": "Diriwayatkan oleh Uqbah bin Amir",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ  ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ  ، حَدَّثَنَا مُحَمَّدٌ هُوَ : ابْنُ إِسْحَاق  ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ شِمَاسَةَ  ، عَنْ عُقْبَةَ بْنِ عَامِرٍ  ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" لَا يَحِلُّ لِامْرِئٍ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ يَبِيعَ عَلَى بَيْعِ أَخِيهِ حَتَّى يَتْرُكَهُ \"",
    "malay_translation": "Muhammad bin Abdullah ar-Raqasyi telah mengkhabarkan kepada kami, Yazid bin Zura'i telah menceritakan kepada kami, Muhammad iaitu Ibnu Ishaq telah menceritakan kepada kami, daripada Yazid bin Abi Habib, daripada Abdurrahman bin Shimasa, daripada Uqbah bin Amir, beliau berkata: Saya mendengar Rasulullah ﷺ bersabda: \"Tidak halal bagi seseorang yang beriman kepada Allah dan hari akhir untuk berjual beli di atas jualan saudaranya sehingga saudaranya itu meninggalkannya.\""
  },
  {
    "id": 39358,
    "hadith_number": 1821,
    "tajuk_hadith": "Tempoh Tanggungan Hamba: Tiga Hari",
    "perawi_melayu": "Muslim bin Ibrahim, Aban bin Yazid, Qatadah, Al-Hasan, Uqbah bin Amir",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ  ، حَدَّثَنَا قَتَادَةُ  ، عَنْ الْحَسَنِ  ،  عَنْ عُقْبَةَ بْنِ عَامِرٍ   : أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" عُهْدَةُ الرَّقِيقِ ثَلَاثَةُ أَيَّامٍ \"",
    "malay_translation": "Telah menceritakan kepada kami Muslim bin Ibrahim, telah menceritakan kepada kami Aban bin Yazid, telah menceritakan kepada kami Qatadah, dari Al-Hasan, dari Uqbah bin Amir, bahawa Nabi صلى الله عليه وسلم bersabda: \"Tempoh tanggungan hamba sahaya adalah tiga hari.\""
  },
  {
    "id": 39359,
    "hadith_number": 1822,
    "tajuk_hadith": "Tempoh Jaminan Hamba Sahaya Adalah Tiga Hari",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، عَنْ هَمَّامٍ  ، عَنْ قَتَادَةَ  ، عَنْ الْحَسَنِ  ، عَنْ عُقْبَةَ بْنِ الْعَامِرِ  ، قَالَ : قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" عُهْدَةُ الرَّقِيقِ ثَلَاثَةُ أَيَّامٍ \".\nفَفَسَّرَهُ قَتَادَةُ : إِنْ وَجَدَ فِي الثَّلَاثِ عَيْبًا رَدَّهُ بِغَيْرِ بَيِّنَةٍ، وَإِنْ وَجَدَهُ بَعْدَ ثَلاثَةٍ، لَمْ يَرُدَّهُ إِلَّا بِبَيِّنَةٍ",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, daripada Hammam, daripada Qatadah, daripada al-Hasan, daripada Uqbah bin Amir, dia berkata: Nabi ﷺ bersabda: \"Tempoh jaminan untuk hamba sahaya adalah tiga hari.\"\nQatadah menafsirkannya: Jika dia mendapati kecacatan dalam tempoh tiga hari, dia boleh mengembalikannya tanpa bukti. Jika dia mendapatinya selepas tiga hari, dia tidak boleh mengembalikannya kecuali dengan bukti."
  },
  {
    "id": 39360,
    "hadith_number": 1823,
    "tajuk_hadith": "Pilihan Pembeli bagi Haiwan yang Ditahan Susunya",
    "perawi_melayu": "Muhammad bin Al-Minhal, Yazid bin Zurai', Hisyam bin Hassan, Muhammad bin Sirin, Abu Hurairah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمِنْهَالِ  ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ  ، حَدَّثَنَا هِشَامٌ هُوَ : ابْنُ حَسَّانَ  عَنْ مُحَمَّدِ بْنِ سِيرِينَ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَنِ اشْتَرَى شَاةً مُصَرَّاةً أَوْ لَقْحَةً مُصَرَّاةً، فَهُوَ بِالْخِيَارِ ثَلَاثَةَ أَيَّامٍ، فَإِنْ رَدَّهَا، رَدَّ مَعَهَا صَاعًا مِنْ طَعَامٍ لَا سَمْرَاءَ \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Al-Minhal, telah menceritakan kepada kami Yazid bin Zurai', telah menceritakan kepada kami Hisyam iaitu Ibnu Hassan daripada Muhammad bin Sirin, daripada Abu Hurairah, dia berkata: Rasulullah ﷺ bersabda: \"Sesiapa yang membeli kambing yang ditahan susunya atau unta betina yang ditahan susunya, maka dia mempunyai pilihan selama tiga hari. Jika dia mengembalikannya, dia hendaklah mengembalikan bersamanya satu *ṣāʿ* makanan, bukan gandum *samrā*.\""
  },
  {
    "id": 39361,
    "hadith_number": 1824,
    "tajuk_hadith": "Larangan Jual Beli Gharar (Ketidakpastian)",
    "perawi_melayu": "Abu Hurairah (رضي الله عنه)",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى  ، حَدَّثَنَا يَحْيَى الْقَطَّانُ  ، عَنْ عُبَيْدِ اللَّهِ  ، عَنْ أَبِي الزِّنَادِ  ، عَنْ الْأَعْرَجِ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : \" نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْبَيْعِ الْغَرَرِ \"",
    "malay_translation": "Muhammad bin Isa telah memberitahu kami, Yahya al-Qattan telah menceritakan kepada kami, daripada Ubaidullah, daripada Abu Zinad, daripada al-A'raj, daripada Abu Hurairah RA, yang berkata: \"Rasulullah SAW melarang jual beli *gharar* (ketidakpastian).\""
  },
  {
    "id": 39362,
    "hadith_number": 1825,
    "tajuk_hadith": "Larangan Menjual Buah-buahan Sebelum Kematangan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ نَافِعٍ  ، عَنِ ابْنِ عُمَرَ  ، قَالَ : \" نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْبَيْعِ الثِّمَارِ حَتَّى يَبْدُوَ صَلَاحُهَا، نَهَى الْبَائِعَ وَالْمُشْتَرِيَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Khalid bin Makhlad, telah menceritakan kepada kami Malik, daripada Nafi', daripada Ibn Umar, dia berkata: \"Rasulullah ﷺ melarang daripada menjual buah-buahan sehingga jelas baiknya (kematangannya), Baginda melarang penjual dan pembeli.\""
  },
  {
    "id": 39363,
    "hadith_number": 1826,
    "tajuk_hadith": "Larangan Menuntut Bayaran Jika Buah Rosak Selepas Jualan",
    "perawi_melayu": "Jabir",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُثْمَانُ بْنُ عُمَرَ  ، حَدَّثَنَا ابْنُ جُرَيْجٍ  ، عَنْ أَبِي الزُّبَيْرِ  ، عَنْ جَابِرٍ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنِ ابْتَاعَ ثَمَرَةً فَأَصَابَتْهُ جَائِحَةٌ، فَلَا يَأْخُذَنَّ مِنْهُ شَيْئًا.\nبِمَ تَأْخُذُ مَالَ أَخِيكَ بِغَيْرِ حَقٍّ؟ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Uthman bin Umar, telah menceritakan kepada kami Ibn Juraij, daripada Abi al-Zubair, daripada Jabir: Sesungguhnya Rasulullah SAW bersabda: \"Sesiapa yang membeli buah-buahan lalu ditimpa bencana, maka janganlah dia mengambil sedikit pun daripadanya. Mengapa kamu mengambil harta saudaramu tanpa hak?\""
  },
  {
    "id": 39364,
    "hadith_number": 1827,
    "tajuk_hadith": "Larangan Muhaqalah dan Muzabanah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ  ، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ  ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو  ح وحَدَّثَنَا مُسَدَّدٌ  ، حَدَّثَنَا يَحْيَى  ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو  ، عَنْ أَبِي سَلَمَةَ  ، عَنْ أَبِي سَعِيدٍ  ، قَالَ : \" نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِالْمُحَاقَلَةِ وَالْمُزَابَنَةِ \".\nقَالَ عَبْد اللَّهِ : الْمُحَاقَلَةُ : بَيْعُ الزَّرْعِ بِالْبُرِّ.\nوَقَالُوا : كَذَلِكَ يَقُولُ ابْنُ الْمُسَيَّبِ",
    "malay_translation": "Telah mengkhabarkan kepada kami 'Amru bin 'Aun, telah mengkhabarkan kepada kami Khalid bin 'Abdillah, daripada Muhammad bin 'Amr, dan telah menceritakan kepada kami Musaddad, telah menceritakan kepada kami Yahya, daripada Muhammad bin 'Amr, daripada Abu Salamah, daripada Abu Sa'id, beliau berkata: \"Rasulullah SAW melarang daripada *muhaqalah* dan *muzabanah*.\"\nAbdullah berkata: *Muhaqalah* ialah jual beli tanaman dengan gandum.\nDan mereka berkata: Demikian juga dikatakan oleh Ibn al-Musayyib."
  },
  {
    "id": 39365,
    "hadith_number": 1828,
    "tajuk_hadith": "Keringanan Jual Beli 'Araya dengan Tamar dan Rutab",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ الْأَوْزَاعِيِّ  ، عَنْ ابْنِ شِهَابٍ  ، عَنْ سَالِمٍ  ، عَنْ ابْنِ عُمَرَ  ،  عَنْ زَيْدِ بْنِ ثَابِتٍ  ، قَالَ :\" رَخَّصَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْعِ الْعَرَايَا بِالتَّمْرِ وَالرُّطَبِ، وَلَمْ يُرَخِّصْ فِي غَيْرِ ذَلِكَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Yusuf, daripada al-Awza'i, daripada Ibn Shihab, daripada Salim, daripada Ibn Umar, daripada Zaid bin Thabit RA, beliau berkata: \"Rasulullah SAW telah memberi keringanan dalam jual beli 'araya dengan tamar dan rutab, dan tidak memberi keringanan dalam selain itu.\""
  },
  {
    "id": 39366,
    "hadith_number": 1829,
    "tajuk_hadith": "Larangan Menjual Makanan Sebelum Menerimanya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ نَافِعٍ  ، عَنِ ابْنِ عُمَرَ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنِ ابْتَاعَ طَعَامًا، فَلَا يَبِعْهُ حَتَّى يَقْبِضَهُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Khalid bin Makhlad, telah menceritakan kepada kami Malik, daripada Nafi', daripada Ibn Umar, daripada Nabi SAW, baginda bersabda: \"Sesiapa yang membeli makanan, maka janganlah dia menjualnya sehingga dia menerimanya (menguasainya).\""
  },
  {
    "id": 39367,
    "hadith_number": 1830,
    "tajuk_hadith": "Larangan Rasulullah SAW Berkaitan Jual Beli",
    "perawi_melayu": "Diriwayatkan oleh: Yazid bin Harun",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، عَنْ حُسَيْنٍ الْمُعَلِّمِ  ، عَنْ عَمْرِو بْنِ شُعَيْبٍ  ، عَنْ أَبِيهِ  ، عَنْ جَدِّهِ  ، قَالَ : \" نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْسَلَفٍ وَبَيْعٍ، وَعَنْ شَرْطَيْنِ فِي بَيْعٍ، وَعَنْ رِبْحِ مَا لَمْ يُضْمَنْ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, daripada Husain al-Mu'allim, daripada 'Amru bin Syu'aib, daripada ayahnya, daripada datuknya, beliau berkata: \"Rasulullah SAW melarang daripada jual beli *salaf*, dan daripada dua syarat dalam satu jual beli, dan daripada keuntungan sesuatu yang tidak dijamin.\""
  },
  {
    "id": 39368,
    "hadith_number": 1831,
    "tajuk_hadith": "Hukum Membeli Hamba Tanpa Syarat Harta",
    "perawi_melayu": "Abdullah bin Maslamah, daripada Ibn Abi Dzi'b, daripada Ibn Shihab, daripada Salim, daripada bapanya.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ  ، عَنْ ابْنِ أَبِي ذِئْبٍ  ، عَنْ ابْنِ شِهَابٍ  ، عَنْ سَالِمٍ  ، عَنْ أَبِيهِ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَنِ اشْتَرَى عَبْدًا وَلَمْ يَشْتَرِطْ مَالَهُ، فَلَا شَيْءَ لَهُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abdullah bin Maslamah, daripada Ibn Abi Dzi'b, daripada Ibn Shihab, daripada Salim, daripada bapanya, dia berkata: Rasulullah SAW bersabda: \"Sesiapa yang membeli seorang hamba dan tidak menetapkan syarat mengenai hartanya, maka dia tidak berhak mendapat apa-apa daripadanya.\""
  },
  {
    "id": 39369,
    "hadith_number": 1832,
    "tajuk_hadith": "Larangan Jual Beli Munabazah dan Mulamasah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ الزُّهْرِيِّ  ، عَنْ عَطَاءِ بْنِ يَزِيدَ  ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ  ، قَالَ : \" نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْبَيْعَتَيْنِ، وَعَنْ لِبْسَتَيْنِ : عَنْ بَيْعِ الْمُنَابَذَةِ وَالْمُلَامَسَةِ \".\nقَالَ عَبْد اللَّهِ : الْمُنَابَذَةُ : يَرْمِي هَذَا إِلَى ذَاكَ.\nوَيَرْمِي ذَاكَ إِلَى هذَا.\nقَالَ : كَانَ هَذَا فِي الْجَاهِلِيَّةِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Amru bin Aun, telah menceritakan kepada kami Sufyan, daripada az-Zuhri, daripada Ata' bin Yazid, daripada Abi Sa'id al-Khudri, dia berkata: \"Rasulullah SAW melarang dua jenis jual beli dan dua jenis pakaian: jual beli munabazah dan mulamasah.\" Abdullah berkata: Munabazah: yang ini melemparkan kepada yang itu, dan yang itu melemparkan kepada yang ini. Dia berkata: Ini adalah (amalan) pada zaman Jahiliyyah."
  },
  {
    "id": 39370,
    "hadith_number": 1833,
    "tajuk_hadith": "Larangan Jual Beli Gharar dan Hasah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ  ، حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ  ، حَدَّثَنَا عُبَيْدُ اللَّهِ  ، عَنْ أَبِي الزِّنَادِ  ، عَنْ الْأَعْرَجِ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : \" نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْبَيْعِ الْغَرَرِ، وَعَنْ بَيْعِ الْحَصَاةِ \".\nقَالَ عَبْد اللَّهِ : إِذَا رَمَى بِحَصًا، وَجَبَ الْبَيْعُ",
    "malay_translation": "Abdullah bin Sa'id telah mengkhabarkan kepada kami, 'Uqbah bin Khalid telah menceritakan kepada kami, 'Ubaidullah telah menceritakan kepada kami, daripada Abu Zinad, daripada al-A'raj, daripada Abu Hurairah RA, beliau berkata: \"Rasulullah SAW melarang jual beli gharar (penipuan), dan jual beli hasah (dengan lemparan batu).\" Abdullah berkata: \"Apabila seseorang melempar batu, maka jual beli itu menjadi wajib (sah).\""
  },
  {
    "id": 39371,
    "hadith_number": 1834,
    "tajuk_hadith": "Larangan Menjual Haiwan dengan Haiwan Secara Tangguh",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ  ، وَجَعْفَرُ بْنُ عَوْنٍ  ، عَنْ سَعِيدٍ  ، عَنْ قَتَادَةَ  ، عَنْ الْحَسَنِ  ، عَنْ سَمُرَةَ بْنِ جُنْدُبٍ  ، قَالَ : \" نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْبَيْعِ الْحَيَوَانِ بِالْحَيَوَانِ نَسِيئَةً \".\nثُمَّ إِنَّ الْحَسَنَ نَسِيَ هَذَا الْحَدِيثَ، وَلَمْ يَقُلْ جَعْفَرٌ : ثُمَّ إِنَّ الْحَسَنَ نَسِيَ هَذَا الْحَدِيثَ",
    "malay_translation": "Telah mengkhabarkan kepada kami Sa'id bin 'Amir, dan Ja'far bin 'Aun, daripada Sa'id, daripada Qatadah, daripada al-Hasan, daripada Samurah bin Jundub, dia berkata: \"Rasulullah SAW melarang menjual haiwan dengan haiwan secara tangguh.\" Kemudian al-Hasan lupa hadis ini, dan Ja'far tidak berkata: \"Kemudian al-Hasan lupa hadis ini.\""
  },
  {
    "id": 39372,
    "hadith_number": 1835,
    "tajuk_hadith": "Sebaik-baik Manusia Adalah yang Terbaik dalam Membayar Hutang",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ  ، عَنْ مَالِكٍ  ، قِرَاءَةً عَلَيْهِ، عَنْ زَيْدِ بْنِ أَسْلَمَ  ، عَنْ عَطَاءِ بْنِ يَسَارٍ  ،  عَنْ أَبِي رَافِعٍ   : مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ : اسْتَسْلَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَكْرًا، فَجَاءَتْ إِبِلٌ مِنْ إِبِلِ الصَّدَقَةِ.\nقَالَ أَبُو رَافِعٍ : فَأَمَرَنِي أَنْ أَقْضِيَ الرَّجُلَ بَكْرَهُ، فَقُلْتُ : لَمْ أَجِدْ فِي الْإِبِلِ إِلَّا جَمَلًا خِيَارًا رَبَاعِيًا، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" أَعْطِهِ إِيَّاهُ، فَإِنَّ خَيْرَ النَّاسِ أَحْسَنُهُمْ قَضَاءً \".\nقَالَ عَبْد اللَّهِ : هَذَا يُقَوِّي قَوْلَ مَنْ يَقُولُ : الْحَيَوَانُ بِالْحَيَوَانِ",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Hakam bin al-Mubarak, daripada Malik, dengan bacaan kepadanya, daripada Zaid bin Aslam, daripada 'Ata' bin Yasar, daripada Abu Rafi', maula Rasulullah SAW, beliau berkata: Rasulullah SAW telah meminjam seekor bakr (unta muda), kemudian datanglah unta daripada unta sedekah. Abu Rafi' berkata: Baginda memerintahkan aku untuk membayar kembali bakrnya kepada lelaki itu. Aku berkata: Aku tidak menjumpai dalam unta kecuali seekor unta jantan pilihan yang raba'i (berusia enam tahun atau lebih). Rasulullah SAW bersabda: \"Berikanlah ia kepadanya, kerana sebaik-baik manusia adalah yang terbaik dalam membayar hutang.\" Abdullah berkata: Ini menguatkan pendapat orang yang mengatakan: haiwan dengan haiwan (dibolehkan dalam jual beli hutang)."
  },
  {
    "id": 39373,
    "hadith_number": 1836,
    "tajuk_hadith": "Larangan Menyambut Barangan Dagangan dan Hak Pilihan bagi Pembeli",
    "perawi_melayu": "Abu Hurairah RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمِنْهَالِ  ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ  ، حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ  ، عَنْ مُحَمَّدٍ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَا تَلَقَّوُا الْجَلَبَ، مَنَ تَلَقَّاهُ فَاشْتَرَى مِنْهُ شَيْئًا، فَهُوَ بِالْخِيَارِ إِذَا دَخَلَ السُّوقَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin al-Minhal, telah menceritakan kepada kami Yazid bin Zurai', telah menceritakan kepada kami Hisyam bin Hassan, daripada Muhammad, daripada Abu Hurairah RA, berkata: Rasulullah SAW bersabda: \"Janganlah kamu pergi menyambut barangan dagangan (sebelum ia sampai ke pasar). Sesiapa yang menyambutnya dan membeli sesuatu daripadanya, maka dia mempunyai pilihan (untuk meneruskan atau membatalkan jual beli) apabila dia memasuki pasar.\""
  },
  {
    "id": 39374,
    "hadith_number": 1837,
    "tajuk_hadith": "Larangan Menjual Atas Jualan Orang Lain, Menyambut Barang Dagangan, dan Najash",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ نَافِعٍ  ، عَنِ ابْنِ عُمَرَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَا يَبِيعُ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ، وَلَا تَلَقَّوُا السِّلَعَ حَتَّى يُهْبَطَ بِهَا الْأَسْوَاقَ، وَلَا تَنَاجَشُوا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Khalid bin Makhlad, telah menceritakan kepada kami Malik, daripada Nafi', daripada Ibn Umar, dia berkata: Rasulullah SAW bersabda: \"Janganlah sebahagian kamu menjual atas jualan sebahagian yang lain, dan janganlah kamu menyambut barang dagangan sehingga ia dibawa turun ke pasar, dan janganlah kamu melakukan najash (tawaran palsu untuk menaikkan harga).\""
  },
  {
    "id": 39375,
    "hadith_number": 1838,
    "tajuk_hadith": "Larangan Terhadap Harga Anjing, Upah Pelacur, dan Upah Tukang Ramal",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا ابْنُ عُيَيْنَةَ  ، حَدَّثَنِي الزُّهْرِيُّ  ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ  ، عَنِ أَبِي مَسْعُودٍ  ، قَالَ : \" نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْثَمَنِ الْكَلْبِ، وَمَهْرِ الْبَغِيِّ، وَحُلْوَانِ الْكَاهِنِ \"، قَالَ عَبْد اللَّهِ : حُلْوَانُ الْكَاهِنِ، مَا يُعْطَى عَلَى كَهَانَتِهِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Yusuf, telah menceritakan kepada kami Ibnu Uyainah, telah menceritakan kepadaku Az-Zuhri, daripada Abu Bakar bin Abdurrahman, daripada Abu Mas'ud, dia berkata: \"Rasulullah SAW melarang dari harga anjing, upah pelacur, dan upah tukang ramal.\" Abdullah berkata: \"Upah tukang ramal adalah apa yang diberikan atas pekerjaan ramalannya.\""
  },
  {
    "id": 39376,
    "hadith_number": 1839,
    "tajuk_hadith": "Pengharaman Perdagangan Arak Selepas Penurunan Ayat Riba",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَعْلَى  ، حَدَّثَنَا الْأَعْمَشُ  ، عَنْ مُسْلِمٍ  ، عَنْ مَسْرُوقٍ  ، عَنْ عَائِشَةَ  ، قَالَتْ : لَمَّا نَزَلَتِ الْآيَةُ فِي آخِرِ سُورَةِ الْبَقَرَةِ فِي الرِّبَا، \" خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَلَاهُنَّ عَلَى النَّاسِ، ثُمَّحَرَّمَ التِّجَارَةَ فِي الْخَمْرِ \"",
    "malay_translation": "Ya'la telah memberitahu kami, katanya Al-A'mash telah menceritakan kepada kami, daripada Muslim, daripada Masruq, daripada Aisyah, dia berkata: \"Ketika ayat di akhir Surah Al-Baqarah tentang riba diturunkan, Rasulullah SAW keluar lalu membacanya kepada orang ramai, kemudian mengharamkan perdagangan arak.\""
  },
  {
    "id": 39377,
    "hadith_number": 1840,
    "tajuk_hadith": "Larangan Berniaga Arak Selepas Turun Ayat-Ayat Akhir Surah Al-Baqarah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاق بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا جَرِيرٌ  ، عَنْ مَنْصُورٍ  ، عَنْ أَبِي الضُّحَى  ، عَنْ مَسْرُوقٍ  ، عَنْ عَائِشَةَ  ، قَالَتْ : لَمَّا نَزَلَتِ الْآيَاتُ مِنْ أَوَاخِرِ سُورَةِ الْبَقَرَةِ ، \" خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاقْتَرَأَهُنَّ عَلَى النَّاسِ، ثُمَّ نَهَى عَنِالتِّجَارَةِ فِي الْخَمْرِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ishaq bin Ibrahim, telah menceritakan kepada kami Jarir, daripada Mansur, daripada Abu al-Dhuha, daripada Masruq, daripada Aisyah RA, beliau berkata: Ketika turun ayat-ayat dari akhir surah al-Baqarah, \"Rasulullah SAW keluar lalu membacakannya kepada orang ramai, kemudian baginda melarang perniagaan arak.\""
  },
  {
    "id": 39378,
    "hadith_number": 1841,
    "tajuk_hadith": "Menyamak Kulit Bangkai Menjadikannya Suci",
    "perawi_melayu": "Abdul Rahman bin Wa'lah (daripada Ibn Abbas)",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ خَالِدٍ  ، حَدَّثَنَا مُحَمَّدٌ هُوَ : ابْنُ إِسْحَاق  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي يَزِيدَ  ، عَنْ الْقَعْقَاعِ بْنِ حَكِيمٍ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ وَعْلَةَ  ، قَالَ : سَأَلْتُ ابْنَ عَبَّاسٍ   عَنْ جُلُودِ الْمَيْتَةِ، فَقَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" دِبَاغُهَا طَهُورُهَا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ahmad bin Khalid, telah menceritakan kepada kami Muhammad iaitu Ibnu Ishaq, daripada Abdul Rahman bin Abi Yazid, daripada al-Qa'qa' bin Hakim, daripada Abdul Rahman bin Wa'lah, beliau berkata: 'Aku bertanya kepada Ibn Abbas tentang kulit bangkai, lalu beliau berkata: 'Rasulullah Sallallahu Alaihi Wasallam bersabda: \"Menyamaknya adalah penyucinya.\"'"
  },
  {
    "id": 39379,
    "hadith_number": 1842,
    "tajuk_hadith": "Hukum Menjual Arak kepada Ahli Zimmah",
    "perawi_melayu": "Ibnu Abbas",
    "english_text": "",
    "arabic_text": "وَسَأَلْتُهُ عَنْ بَيْعِ الْخَمْرِ مِنْ أَهْلِ الذِّمَّةِ ، فَقُلْتُ لَهُ : إِنَّ لَنَا أَعْنَابًا، وَإِنَّا نَتَّخِذُ مِنْهَا هَذِهِ الْخُمُورَ فَنَبِيعُهَا مِنْ أَهْلِ الذِّمَّةِ ؟.\nقَالَ ابْنُ عَبَّاسٍ   : أَهْدَى رَجُلٌ مِنْ ثَقِيفٍ أَوْ دَوْسٍ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَاوِيَةً مِنْ خَمْرٍ فِي حَجَّةِ الْوَدَاعِ، فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" أَمَا عَلِمْتَ يَا أَبَا فُلَانٍ أَنَّ اللَّهَ قَدْ حَرَّمَهَا؟ \".\nقَالَ : لَا وَاللَّهِ.\nقَالَ :\" فَإِنَّ اللَّهَ قَدْ حَرَّمَهَا \".\nفَالْتَفَتَ إِلَى غُلَامِهِ، فَقَالَ : اخْرُجْ بِهَا إِلَى الْحَزْوَرَةِ فَبِعْهَا، فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" أَوَ مَا عَلِمْتَ يَا أَبَا فُلَانٍ، أَنَّ الَّذِي حَرَّمَ شُرْبَهَا، حَرَّمَ بَيْعَهَا؟ \".\n قَالَ : فَأَمَرَ بِهَا فَأُفْرِغَتْ فِي الْبَطْحَاءِ",
    "malay_translation": "Dan aku bertanya kepada beliau (Ibnu Abbas) tentang penjualan arak kepada Ahli Zimmah. Aku berkata kepada beliau: \"Kami mempunyai anggur, dan kami membuat arak daripadanya, kemudian kami menjualnya kepada Ahli Zimmah?\" Ibnu Abbas berkata: \"Seorang lelaki dari Thaqif atau Daws telah menghadiahkan kepada Rasulullah SAW satu bekas arak pada Haji Wada'. Maka Nabi SAW bersabda kepadanya: \"Tidakkah engkau tahu, wahai Abu Fulan, bahawa Allah telah mengharamkannya?\" Dia berkata: \"Tidak, demi Allah.\" Baginda bersabda: \"Sesungguhnya Allah telah mengharamkannya.\" Kemudian baginda berpaling kepada hambanya dan berkata: \"Bawalah ia keluar ke Al-Hazwarah dan jualkan ia.\" Maka Rasulullah SAW bersabda kepadanya: \"Tidakkah engkau tahu, wahai Abu Fulan, bahawa Zat yang mengharamkan meminumnya, mengharamkan juga menjualnya?\" Dia berkata: \"Lalu baginda memerintahkan agar arak itu ditumpahkan di Al-Bathha'."
  },
  {
    "id": 39380,
    "hadith_number": 1843,
    "tajuk_hadith": "Larangan Menjual dan Menghadiahkan Wala'",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ  ، عَنِ ابْنِ عُمَرَ  ، قَالَ : \" نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْبَيْعِ الْوَلَاءِ، وَعَنْ هِبَتِهِ \".\nقَالَ عَبْد اللَّهِ : الْأَمْرُ عَلَى هَذَا، لَا يُبَاعُ وَلَا يُوهَبُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Khalid bin Makhlad, telah menceritakan kepada kami Malik, daripada Abdullah bin Dinar, daripada Ibn Umar, dia berkata: \"Rasulullah SAW melarang daripada menjual wala' dan menghibahkannya.\" Abdullah berkata: Perkara itu adalah seperti ini, tidak boleh dijual dan tidak boleh dihibahkan."
  },
  {
    "id": 39381,
    "hadith_number": 1844,
    "tajuk_hadith": "Hamba yang Dimardekakan Secara Dubur Dijual oleh Rasulullah SAW",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا هَاشِمُ بْنُ الْقَاسِمِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ عَمْرِو بْنِ دِينَارٍ  ، قَالَ : سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ الْأَنْصَارِيَّ  ، قَالَ : أَعْتَقَ رَجُلٌ مِنَّا عَبْدًا لَهُ عَنْ دُبُرٍ.\nقَالَ :\" فَدَعَا بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَاعَهُ \".\nقَالَ جَابِرٌ : وَإِنَّمَا مَاتَ عَامَ أَوَّلَ.\nقِيلَ لعَبْدِ اللَّهِ : تَقُولُ بِهِ؟.\nقَالَ : قَوْمُ يَقُولُونَ",
    "malay_translation": "Telah mengkhabarkan kepada kami Hasyim bin al-Qasim, telah menceritakan kepada kami Syu'bah, daripada 'Amru bin Dinar, beliau berkata: Saya mendengar Jabir bin Abdullah al-Ansari berkata: Seorang lelaki dari kalangan kami memerdekakan hamba miliknya secara *dubur* (selepas kematian tuannya).\nBeliau (Jabir) berkata: \"Maka Rasulullah SAW memanggilnya dan menjualnya.\"\nJabir berkata: Dan sesungguhnya dia (lelaki itu) meninggal pada tahun pertama.\nDitanya kepada Abdullah: Adakah kamu mengatakan dengan ini?\nBeliau berkata: Kaum mengatakan."
  },
  {
    "id": 39382,
    "hadith_number": 1845,
    "tajuk_hadith": "Hamba Perempuan Menjadi Merdeka Selepas Melahirkan Anak Tuannya",
    "perawi_melayu": "Abu Nu'aim, Syarik, Husain bin Abdullah bin Ubaidillah bin Abbas, Ikrimah, Ibn Abbas",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا شَرِيكٌ  ، عَنْ حُسَيْنِ بْنِ عَبْدِ اللَّهِ بْنِ عُبَيْدِ اللَّهِ بْنِ عَبَّاسٍ  ، عَنْ عِكْرِمَةَ  ، عَنِ ابْنِ عَبَّاسٍ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" إِذَا وَلَدَتْ أَمَةُ الرَّجُلِ مِنْهُ، فَهِيَ مُعْتَقَةٌ عَنْ دُبُرٍ مِنْهُ أَوْ بَعْدَهُ \"",
    "malay_translation": "Abu Nu'aim telah memberitahu kami, Syarik telah menceritakan kepada kami, daripada Husain bin Abdullah bin Ubaidillah bin Abbas, daripada Ikrimah, daripada Ibn Abbas, daripada Nabi SAW, baginda bersabda: \"Apabila seorang hamba perempuan seorang lelaki melahirkan anak daripadanya, maka dia dimerdekakan selepas kematiannya atau selepas itu.\""
  },
  {
    "id": 39383,
    "hadith_number": 1846,
    "tajuk_hadith": "Keberkatan dalam Sukatan Madinah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو مُحَمَّدٍ الْحَنَفِيُّ الْمَدَنِيُّ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ إِسْحَاق بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ  ، عَنْ أَنَسِ بْنِ مَالِكٍ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" اللَّهُمَّ بَارِكْ لَهُمْ فِي مِكْيَالِهِمْ، وَبَارِكْ لَهُمْ فِي صَاعِهِمْ وَمُدِّهِمْ \"يَعْنِي : الْمَدِينَةَ",
    "malay_translation": "Abu Muhammad al-Hanafi al-Madani memberitahu kami, telah meriwayatkan kepada kami Malik, daripada Ishaq bin Abdullah bin Abi Talha, daripada Anas bin Malik: bahawa Rasulullah SAW bersabda: 'Ya Allah, berkatilah mereka dalam sukatan mereka, dan berkatilah mereka dalam sa' dan mudd' mereka' - iaitu: Madinah."
  },
  {
    "id": 39384,
    "hadith_number": 1847,
    "tajuk_hadith": "Larangan Menukar Kurma Berkualitas Rendah dengan Kurma Berkualitas Tinggi dengan Harga Lebih Tinggi",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُثْمَانُ بْنُ عُمَرَ  ، أَخْبَرَنَا إِسْرَائِيلُ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ مَسْرُوقٍ  ، عَنْ بِلَالٍ  ، قَالَ : كَانَ عِنْدِي مُدُّ تَمْرٍ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَجَدْتُ أَطْيَبَ مِنْهُ صَاعًا بِصَاعَيْنِ، فَاشْتَرَيْتُ مِنْهُ، فَأَتَيْتُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ :\" مِنْ أَيْنَ لَكَ هَذَا يَا بِلَالُ؟ \".\nقُلْتُ : اشْتَرَيْتُ صَاعًا بِصَاعَيْنِ.\nقَالَ : \" رُدَّهُ وَرُدَّ عَلَيْنَا تَمْرَنَا \"",
    "malay_translation": "Uthman bin Umar memberitahu kami, Isra'il memberitahu kami, daripada Abu Ishaq, daripada Masruq, daripada Bilal, dia berkata: \"Saya mempunyai satu mud kurma milik Nabi ﷺ, dan saya mendapati kurma yang lebih baik daripadanya, satu sa' dengan dua sa'. Lalu saya membelinya dan membawanya kepada Nabi ﷺ. Baginda bersabda: \"Dari mana kamu dapat ini, wahai Bilal?\" Saya berkata: \"Saya membeli satu sa' dengan dua sa'.\" Baginda bersabda: \"Kembalikan ia dan kembalikan kurma kami kepada kami.\""
  },
  {
    "id": 39385,
    "hadith_number": 1848,
    "tajuk_hadith": "Larangan Menukar Kurma Berkualiti Rendah dengan Kurma Berkualiti Tinggi Secara Tidak Sama Rata",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ  ، حَدَّثَنَا سُلَيْمَانُ هُوَ : ابْنُ بِلَالٍ  ، عَنْ عَبْدِ الْمَجِيدِ بْنِ سُهَيْلِ بْنِ عَبْدِ الرَّحْمَنِ  ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيِّبِ  يُحَدِّثُ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ   وَأَبَا هُرَيْرَةَ   حَدَّثَاهُ : أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ أَخَا بَنِي عَدِيٍّ الْأَنْصَارِيَّ فَاسْتَعْمَلَهُ عَلَى خَيْبَرَ ، فَقَدِمَ بِتَمْرٍ جَنِيبٍ.\n قَالَ ابْنُ مَسْلَمَةَ : يَعْنِي : جَيِّدًا ، فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" أَكُلُّ تَمْرِ خَيْبَرَ هَكَذَا؟ \".\nقَالَ : لَا وَاللَّهِ يَا رَسُولَ اللَّهِ، إِنَّا لَنَشْتَرِي الصَّاعَ بِالصَّاعَيْنِ مِنَ الْجَمْعِ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَا تَفْعَلُوا، وَلَكِنْ مِثْلًا بِمِثْلٍ، أَوْ بِيعُوا هَذَا، وَاشْتَرُوا بِثَمَنِهِ مِنْ هَذَا، وَكَذَلِكَ الْمِيزَانُ \"",
    "malay_translation": "Abdullah bin Maslamah memberitahu kami, Sulaiman—iaitu Ibnu Bilal—menceritakan kepada kami, daripada Abdul Majeed bin Suhail bin Abdul Rahman, bahawa dia mendengar Sa'id bin al-Musayyib menceritakan bahawa Abu Sa'id al-Khudri dan Abu Hurairah menceritakan kepadanya: Bahawa Rasulullah SAW mengutus seorang lelaki daripada Bani 'Adi al-Ansari dan melantiknya sebagai pegawai di Khaibar. Lelaki itu datang membawa kurma *Janib* (kurma yang berkualiti tinggi). Ibnu Maslamah berkata: Maksudnya: kurma yang baik. Rasulullah SAW bersabda kepadanya: \"Adakah semua kurma Khaibar seperti ini?\" Lelaki itu berkata: \"Tidak, demi Allah wahai Rasulullah, sesungguhnya kami membeli satu *sa'* (sukatan) kurma yang baik dengan dua *sa'* kurma *Jam'* (kurma yang kurang baik).\" Rasulullah SAW bersabda: \"Jangan lakukan demikian, tetapi (jual belilah) sama timbangan, atau juallah kurma ini (yang kurang baik) dan belilah dengan harganya kurma ini (yang baik). Begitulah juga timbangan.\""
  },
  {
    "id": 39386,
    "hadith_number": 1849,
    "tajuk_hadith": "Pertukaran Emas dan Barangan Sejenis: Serta-Merta",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاق  ، عَنْ الزُّهْرِيِّ  ، عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ النَّصْرِيِّ  ، عَنْ عُمَرَ بْنِ الْخَطَّابِ   رَضِي اللَّهُ عَنْهُ، قالَ : سمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" الذَّهَبُ بِالذَّهَبِ هَاءَ وَهَاءَ، وَالْفِضَّةُ بِالْفِضَّةِ هَاءَ وَهَاءَ، وَالتَّمْرُ بِالتَّمْرِ هَاءَ وَهَاءَ، وَالْبُرُّ بِالْبُرِّ هَاءَ وَهَاءَ، وَالشَّعِيرُ بِالشَّعِيرِ هَاءَ وَهَاءَ، وَلَا فَضْلَ بَيْنَهُمَا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah menceritakan kepada kami Muhammad bin Ishaq, daripada al-Zuhri, daripada Malik bin Aus bin al-Hadathan al-Nasri, daripada Umar bin al-Khattab RA, beliau berkata: Saya mendengar Rasulullah SAW bersabda: \"Emas dengan emas (hendaklah) serta merta, perak dengan perak (hendaklah) serta merta, kurma dengan kurma (hendaklah) serta merta, gandum dengan gandum (hendaklah) serta merta, barli dengan barli (hendaklah) serta merta, dan tidak boleh ada lebihan di antara keduanya.\""
  },
  {
    "id": 39387,
    "hadith_number": 1850,
    "tajuk_hadith": "Larangan Menjual Emas dengan Emas dan Perak dengan Perak Kecuali Sama Timbangan dan Riba pada Pertambahan",
    "perawi_melayu": "Ubadah bin as-Samit",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ  ، أَخْبَرَنَا خَالِدٌ  ، عَنْ خَالِدٍ الْحَذَّاءِ  ، عَنْ أَبِي قِلَابَةَ  ، عَنْ أَبِي الْأَشْعَثِ الصَّنْعَانِيِّ  ، قَالَ : قَامَ أنَاسٌ فِي إِمَارَةِ مُعَاوِيَةَ يَبِيعُونَ آنِيَةَ الذَّهَبِ وَالْفِضَّةِ إِلَى الْعَطَاءِ.\nفَقَامَ عُبَادَةُ بْنُ الصَّامِتِ  ، فَقَالَ : إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \" نَهَى عَنْبَيْعِ الذَّهَبِ بِالذَّهَبِ، وَالْفِضَّةِ بِالْفِضَّةِ، وَالْبُرِّ بِالْبُرِّ، وَالتَّمْرِ بِالتَّمْرِ، وَالشَّعِيرِ بِالشَّعِيرِ، وَالْمِلْحِ بِالْمِلْحِ إِلَّا مِثْلًا بِمِثْلٍ سَوَاءً بِسَوَاءٍ، فَمَنْ زَادَ أَوْ ازْدَادَ، فَقَدْ أَرْبَى \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Amru bin Aun, telah mengkhabarkan kepada kami Khalid, daripada Khalid al-Hazza', daripada Abu Qilabah, daripada Abu al-Ash'ath as-San'ani, dia berkata: Ada orang yang berdiri pada zaman pemerintahan Mu'awiyah menjual perkakas emas dan perak untuk pemberian.\nKemudian Ubadah bin as-Samit berdiri dan berkata: Sesungguhnya Rasulullah SAW melarang penjualan emas dengan emas, perak dengan perak, gandum dengan gandum, kurma dengan kurma, barli dengan barli, dan garam dengan garam kecuali sama timbangan, sama berat. Barangsiapa menambah atau meminta tambahan, maka sungguh dia telah melakukan riba."
  },
  {
    "id": 39388,
    "hadith_number": 1851,
    "tajuk_hadith": "Riba Hanya Berlaku dalam Hutang",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ ابْنِ جُرَيْر  ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ  ، عَنِ ابْنِ عَبَّاسٍ  ، قَالَ : أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" إِنَّمَا الرِّبَا فِي الدَّيْنِ \".\nقَالَ عَبْد اللَّهِ : مَعْنَاهُ : دِرْهَمٌ بِدِرْهَمَيْنِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Asim, daripada Ibn Jurair, daripada Ubaidillah bin Abi Yazid, daripada Ibn Abbas, beliau berkata: Usamah bin Zaid telah mengkhabarkan kepadaku: Bahawa Rasulullah SAW bersabda: 'Sesungguhnya riba itu hanya dalam hutang.' Abdullah berkata: Maknanya: satu dirham dengan dua dirham."
  },
  {
    "id": 39389,
    "hadith_number": 1852,
    "tajuk_hadith": "Jual Beli Mata Wang Berbeza Harga Semasa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ سِمَاكِ بْنِ حَرْبٍ  ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ  ، عَنِ ابْنِ عُمَرَ  ، قَالَ : كُنْتُ أَبِيعُ الْإِبِلَ بِالْبَقِيعِ فَأَبِيعُ بِالدَّنَانِيرِ، وَآخُذُ الدَّرَاهِمَ، وَأَبِيعُ بِالدَّرَاهِمِ وَآخُذُ الدَّنَانِيرَ وَرُبَّمَا قَالَ : أَقْبِضُ فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقُلْتُ : يَا رَسُولَ اللَّهِ، رُوَيْدَكَ أَسْأَلُكَ : إِنِّي أَبِيعُ الْإِبِلَ بِالْبَقِيعِ فَأَبِيعُ بِالدَّنَانِيرِ، وَآخُذُ الدَّرَاهِمَ، وَأَبِيعُ بِالدَّرَاهِمِ وَآخُذُ الدَّنَانِيرَ.\nقَالَ :\" لَا بَأْسَ أَنْ تَأْخُذَ بِسِعْرِ يَوْمِكَ، مَا لَمْ تَفْتَرِقَا، وَبَيْنَكُمَا شَيْءٌ \"",
    "malay_translation": "Abu al-Walid memberitahu kami, Hammad bin Salamah meriwayatkan kepada kami, daripada Simak bin Harb, daripada Sa'id bin Jubair, daripada Ibn Umar, dia berkata: \"Saya biasa menjual unta di Baqi' dan saya menjual dengan dinar dan mengambil dirham, dan saya menjual dengan dirham dan mengambil dinar.\" Dan kadang-kadang dia berkata: \"Saya menerima (wang itu).\" Lalu saya mendatangi Rasulullah SAW dan berkata: \"Wahai Rasulullah, tunggu sebentar, saya ingin bertanya kepada anda: Sesungguhnya saya menjual unta di Baqi' dan saya menjual dengan dinar dan mengambil dirham, dan saya menjual dengan dirham dan mengambil dinar.\" Baginda bersabda: \"Tidak mengapa untuk kamu mengambil dengan harga hari kamu, selagi kamu belum berpisah dan masih ada sesuatu (urusan) antara kamu berdua.\""
  },
  {
    "id": 39390,
    "hadith_number": 1853,
    "tajuk_hadith": "Baju Besi Rasulullah SAW Digadai Kepada Seorang Yahudi",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، حَدَّثَنَا هِشَامٌ  ، عَنْ عِكْرِمَةَ  ،  عَنِ ابْنِ عَبَّاسٍ  ، قَالَ :\" تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِنَّ دِرْعَهُ لَمَرْهُونَةٌ عِنْدَ رَجُلٍ مِنَ الْيَهُودِ بِثَلَاثِينَ صَاعًا مِنْ شَعِيرٍ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah menceritakan kepada kami Hisyam, daripada Ikrimah, daripada Ibn Abbas, beliau berkata: “Rasulullah SAW wafat dan baju besinya tergadai kepada seorang lelaki Yahudi dengan tiga puluh sha’ gandum.”"
  },
  {
    "id": 39391,
    "hadith_number": 1854,
    "tajuk_hadith": "Salam dalam Buah-buahan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ ابْنِ أَبِي نَجِيحٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ كَثِيرٍ  ، عَنْ أَبِي الْمِنْهَالِ  ، عَنِ ابْنِ عَبَّاسٍ  ، قَالَ : قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ وَهُمْ يُسْلِفُونَ فِي الثِّمَارِ فِي سَنَتَيْنِ وَثَلَاثٍ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" أسْلِّفُوا فِي الثِّمَارِ : فِي كَيْلٍ مَعْلُومٍ وَوَزْنٍ مَعْلُومٍ \".\nوَقَدْ كَانَ سُفْيَانُ يَذْكُرُهُ زَمَانًا إِلَى أَجَلٍ مَعْلُومٍ، ثُمَّ شَكَّكَهُ عَبَّادُ بْنُ كَثِيرٍ",
    "malay_translation": "Muhammad bin Yusuf memberitahu kami, Sufyan memberitahu kami, daripada Ibn Abi Najih, daripada Abdullah bin Kathir, daripada Abu al-Minhal, daripada Ibn Abbas, dia berkata: Rasulullah SAW tiba di Madinah dan mereka melakukan *salam* (jual beli pesanan) buah-buahan untuk dua atau tiga tahun. Kemudian Rasulullah SAW bersabda: \"Lakukanlah *salam* (jual beli pesanan) buah-buahan: dengan sukatan yang diketahui dan timbangan yang diketahui.\" Sufyan pernah menyebutkannya untuk suatu tempoh yang diketahui, kemudian 'Abbad bin Kathir menimbulkan keraguan padanya."
  },
  {
    "id": 39392,
    "hadith_number": 1855,
    "tajuk_hadith": "Rasulullah SAW Menimbang Dirham dan Memberi Lebih",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ الرَّبِيعِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ مُحَارِبٍ  ، قَالَ : سَمِعْتُ جَابِرًا   : أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" وَزَنَ لَهُمْ دَرَاهِمَ فَأَرْجَحَهَا \"",
    "malay_translation": "Telah menceritakan kepada kami Sa'id bin ar-Rabi', telah menceritakan kepada kami Syu'bah, dari Muharib, dia berkata: Aku mendengar Jabir berkata: Bahawa Rasulullah SAW telah menimbang dirham untuk mereka dan melebihkannya."
  },
  {
    "id": 39393,
    "hadith_number": 1856,
    "tajuk_hadith": "Arahan Rasulullah SAW untuk Melebihkan Timbangan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ سِمَاكِ بْنِ حَرْبٍ  ، عَنْ سُوَيْدِ بْنِ قَيْسٍ  ، قَالَ : جَلَبْتُ أَنَا وَمَخْرَمَةُ الْعَبْدِيُّ بَزًّا مِنَ الْبَحْرَيْنِ إِلَى مَكَّةَ ، فَأَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْشِي، فَسَاوَمَنَا بِسَرَاوِيلَ أَوِ اشْتَرَى مِنَّا سَرَاوِيلَ وَثَمَّ وَزَّانٌ يَزِنُ بِالْأَجْرِ، فَقَالَ لِلْوَزَّانِ :\" زِنْ وَأَرْجِحْ \".\nفَلَمَّا ذَهَبَ يَمْشِي، قَالُوا : هَذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Yusuf, daripada Sufyan, daripada Simak bin Harb, daripada Suwaid bin Qais, dia berkata: \"Aku dan Makhramah al-Abdi membawa pakaian dari Bahrain ke Makkah. Kemudian Rasulullah SAW datang kepada kami berjalan kaki, lalu menawar kami seluar atau membeli seluar daripada kami. Di sana ada seorang penimbang yang menimbang dengan upah. Baginda bersabda kepada penimbang itu: 'Timbang dan lebihkan.'\" Ketika Baginda pergi berjalan, mereka berkata: \"Ini adalah Rasulullah SAW.\""
  },
  {
    "id": 39394,
    "hadith_number": 1857,
    "tajuk_hadith": "Larangan Menangguhkan Pembayaran Hutang Bagi Orang Kaya dan Kewajipan Menerima Pemindahan Hutang Kepada Orang Berada",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ أَبِي الزِّنَادِ  ، عَنْ الْأَعْرَجِ  ، عَنْ أَبِي هُرَيْرَةَ   قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :مَطْلُ الْغَنِيِّ ظُلْمٌ، وَإِذَا أُتْبِعَ أَحَدُكُمْ عَلَى مَلِيءٍ فَلْيَتْبَعْ \"",
    "malay_translation": "Telah menceritakan kepada kami Khalid bin Makhlad, telah menceritakan kepada kami Malik, dari Abu Zinad, dari Al-A'raj, dari Abu Hurairah RA berkata: Rasulullah SAW bersabda: 'Menangguhkan (pembayaran hutang) oleh orang kaya adalah suatu kezaliman, dan apabila salah seorang di antara kamu dipindahkan (hutangnya) kepada orang yang berada, maka hendaklah ia berpindah (menerimanya).'"
  },
  {
    "id": 39395,
    "hadith_number": 1858,
    "tajuk_hadith": "Nasihat Nabi SAW dalam Menyelesaikan Pertikaian Hutang",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ  ، أَخْبَرَنَا يُونُسُ  ، عَنْ الزُّهْرِيِّ  ، عَنْ عَبْدِ اللَّهِ بْنِ كَعْبٍ  ، عَنْ أَبِيهِ   أَنَّهُ تَقَاضَى مِنَ ابْنِ أَبِي حَدْرَدٍ دَيْنًا كَانَ لَهُ عَلَيْهِ فِي الْمَسْجِدِ، فَارْتَفَعَتْ أَصْوَاتُهُمَا حَتَّى سَمِعَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي بَيْتِهِ، فَخَرَجَ إِلَيْهِمَا، فَنَادَى : \" يَا كَعْبُ \".\nقَالَ : لَبَّيْكَ يَا رَسُولَ اللَّهِ.\nفَقَالَ :\" ضَعْ مِنْ دَيْنِكَ فَأَوْمَأَ إِلَيْهِ أَيْ الشَّطْرَ \".\nقَالَ : قَدْ فَعَلْتُ.\nقَالَ : \" قُمْ فَاقْضِهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Uthman bin Umar, telah mengkhabarkan kepada kami Yunus, daripada az-Zuhri, daripada Abdullah bin Ka'b, daripada ayahnya, bahawa dia menuntut hutang daripada Ibn Abi Hadrad yang menjadi tanggungannya di dalam masjid. Maka suara mereka berdua meninggi sehingga didengari oleh Nabi SAW ketika Baginda berada di rumahnya. Baginda keluar menemui mereka berdua lalu berseru: \"Wahai Ka'b.\" Dia menjawab: \"Labbaik ya Rasulullah (Aku patuh dan hadir wahai Rasulullah).\" Baginda bersabda: \"Kurangkanlah sebahagian daripada hutangmu,\" sambil Baginda memberi isyarat kepadanya, iaitu separuh. Dia berkata: \"Saya telah melakukannya.\" Baginda bersabda: \"Bangunlah dan lunaskanlah hutangnya.\""
  },
  {
    "id": 39396,
    "hadith_number": 1859,
    "tajuk_hadith": "Keutamaan Memberi Tempoh atau Meringankan Hutang Orang yang Kesulitan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا زَائِدَةُ  ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ  ، عَنْ رِبْعِيٍّ  ، عَنْ أَبِي الْيَسَرِ  ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" مَنْ أَنْظَرَ مُعْسِرًا، أَوْ وَضَعَ عَنْهُ، أَظَلَّهُ اللَّهُ فِي ظِلِّهِ يَوْمَ لَا ظِلَّ إِلَّا ظِلُّهُ \".\nقَالَ : فَبَزَقَ فِي صَحِيفَتِهِ، فَقَالَ : اذْهَبْ فَهِيَ لَكَ لِغَرِيمِهِ وَذَكَرَ أَنَّهُ كَانَ مُعْسِرًا",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Abdullah, telah menceritakan kepada kami Zaidah, daripada Abdul Malik bin Umair, daripada Rib'i, daripada Abu al-Yasar, beliau berkata: Saya mendengar Rasulullah SAW bersabda: 'Sesiapa yang memberi tempoh kepada orang yang berada dalam kesulitan, atau meringankan hutangnya, Allah akan menaunginya di bawah naungan-Nya pada hari tiada naungan melainkan naungan-Nya.' Beliau berkata: Kemudian dia meludah pada catatannya, lalu berkata: Pergilah, ini untuk kamu bagi orang yang berhutang kepadanya, dan dia menyebutkan bahawa dia adalah orang yang berada dalam kesulitan."
  },
  {
    "id": 39397,
    "hadith_number": 1860,
    "tajuk_hadith": "Keutamaan Meringankan Beban Hutang",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، حَدَّثَنَا أَبُو جَعْفَرٍ الْخَطْمِيُّ  ، عَنْ مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ  ، عَنْ أَبِي قَتَادَةَ  ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" مَنْ نَفَّسَ عَنْ غَرِيمِهِ أَوْ مَحَا عَنْهُ، كَانَ فِي ظِلِّ الْعَرْشِ يَوْمَ الْقِيَامَةِ \"",
    "malay_translation": "Telah menceritakan kepada kami Affan bin Muslim, telah menceritakan kepada kami Hammad bin Salamah, telah menceritakan kepada kami Abu Ja'far Al-Khatmi, dari Muhammad bin Ka'ab Al-Qurazi, dari Abu Qatadah, dia berkata: Saya mendengar Rasulullah ﷺ bersabda: \"Sesiapa yang meringankan beban hutang seseorang atau menghapuskannya, dia akan berada di bawah naungan 'Arasy pada Hari Kiamat.\""
  },
  {
    "id": 39398,
    "hadith_number": 1861,
    "tajuk_hadith": "Hak Mendapatkan Kembali Harta daripada Orang Muflis",
    "perawi_melayu": "Daripada Yazid bin Harun, Yahya, Abu Bakar bin Muhammad, Umar bin Abdul Aziz, Abu Bakar bin Abdul Rahman bin al-Harith bin Hisham, daripada Abu Hurairah.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، حَدَّثَنَا يَحْيَى  : أَنَّ أَبَا بَكْرِ بْنَ مُحَمَّدٍ  ، أَخْبَرَهُ أَنَّهُ سَمِعَ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ  يُحَدِّثُ، أَنَّهُ سَمِعَ أَبَا بَكْرِ بْنَ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ  ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ  ، يَقُولُ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَنْ أَدْرَكَ مَالَهُ بِعَيْنِهِ عِنْدَ إِنْسَانٍ قَدْ أَفْلَسَ أَوْ عِنْدَ رَجُلٍ قَدْ أَفْلَسَ فَهُوَ أَحَقُّ بِهِ مِنْ غَيْرِهِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah menceritakan kepada kami Yahya: bahawa Abu Bakar bin Muhammad telah mengkhabarkannya bahawa dia mendengar Umar bin Abdul Aziz menceritakan, bahawa dia mendengar Abu Bakar bin Abdul Rahman bin al-Harith bin Hisham, bahawa dia mendengar Abu Hurairah berkata: Rasulullah SAW bersabda: \"Sesiapa yang mendapati hartanya sendiri di sisi seseorang yang telah muflis atau di sisi seorang lelaki yang telah muflis, maka dia lebih berhak terhadapnya daripada orang lain.\""
  },
  {
    "id": 39399,
    "hadith_number": 1862,
    "tajuk_hadith": "Jiwa Mukmin Tergantung Kerana Hutang",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ  ، عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ  ، عَنْ أَبِيهِ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" نَفْسُ الْمُؤْمِنِ مُعَلَّقَةٌ مَا كَانَ عَلَيْهِ دَيْنٌ \"",
    "malay_translation": "Muhammad bin Yusuf memberitahu kami, daripada Sufyan, daripada Saad bin Ibrahim, daripada Umar bin Abi Salamah, daripada bapanya, daripada Abu Hurairah, dia berkata: Rasulullah SAW bersabda: \"Jiwa seorang mukmin tergantung selagi dia masih berhutang.\""
  },
  {
    "id": 39400,
    "hadith_number": 1863,
    "tajuk_hadith": "Kelebihan Bebas daripada Kesombongan, Pengkhianatan (Ghulul), dan Hutang",
    "perawi_melayu": "Muhammad bin Abdullah ar-Raqasyi, Yazid bin Zuraik, Said, Qatadah, Salim bin Abi al-Ja'di, Ma'dan bin Abi Talhah, Thawban",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ  ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ  ، حَدَّثَنَا سَعِيدٌ  ، عَنْ قَتَادَةَ  ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ  ، عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ  ، عَنْ ثَوْبَانَ   مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنْ فَارَقَ الرُّوحُ الْجَسَدَ وَهُوَ بَرِيءٌ مِنْ ثَلَاثٍ، دَخَلَ الْجَنَّةَ : مِنَ الْكِبْرِ، وَالْغُلُولِ، وَالدَّيْنِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Abdullah ar-Raqasyi, telah menceritakan kepada kami Yazid bin Zuraik, telah menceritakan kepada kami Said, daripada Qatadah, daripada Salim bin Abi al-Ja'di, daripada Ma'dan bin Abi Talhah, daripada Thawban, maula Rasulullah SAW: Bahawasanya Rasulullah SAW bersabda: \"Sesiapa yang rohnya berpisah dari jasad dan dia terlepas daripada tiga perkara, dia akan memasuki syurga: (iaitu) kesombongan, pengkhianatan (ghulul), dan hutang.\""
  },
  {
    "id": 39401,
    "hadith_number": 1864,
    "tajuk_hadith": "Menangguhkan Solat Jenazah Kerana Hutang",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ  ، وَأَبُو الْوَلِيدِ  ، عَنْ شُعْبَةَ  ، عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ  ، عَنْ أَبِيهِ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِرَجُلٍ لِيُصَلِّيَ عَلَيْهِ، فَقَالَ :\" صَلُّوا عَلَى صَاحِبِكُمْ فَإِنَّ عَلَيْهِ دَيْنًا \".\nقَالَ أَبُو قَتَادَةَ : هُوَ عَلَيَّ يَا رَسُولَ اللَّهِ.\nقَالَ : \" بِالْوَفَاءِ؟ \".\nقَالَ : \" بِالْوَفَاءِ \".\nقَالَ : فَصَلَّى عَلَيْهِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Sa'id bin 'Amir, dan Abu al-Walid, daripada Syu'bah, daripada 'Uthman bin 'Abdillah bin Mawhab, daripada 'Abdullah bin Abi Qatadah, daripada bapanya: Bahawa Rasulullah SAW dibawa kepadanya seorang lelaki untuk disolatkannya, lalu Baginda bersabda: \"Solatkanlah sahabat kamu ini kerana sesungguhnya dia mempunyai hutang.\" Abu Qatadah berkata: Hutang itu menjadi tanggunganku wahai Rasulullah. Baginda bertanya: \"Dengan jaminan?\" Dia berkata: \"Dengan jaminan.\" Baginda bersabda: Lalu Baginda menyolatkannya."
  },
  {
    "id": 39402,
    "hadith_number": 1865,
    "tajuk_hadith": "Tanggungjawab Rasulullah SAW Terhadap Hutang dan Keluarga Mukmin yang Terlantar",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، عَنْ سُفْيَانَ  ، عَنْ أَبِي الزِّنَادِ  ، عَنْ الْأَعْرَجِ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" وَالَّذِي نَفْسِي بِيَدِهِمَا عَلَى الْأَرْضِ مُؤْمِنٌ إِلا وأَنَا أَوْلَى النَّاسِ بِهِ، فَمَنْ تَرَكَ دَيْنًا أَوْ ضَيَاعًا، فَلْأُدْعَ لَهُ، فَأَنَا مَوْلَاهُ، وَمَنْ تَرَكَ مَالًا، فَلِعَصَبَتِهِ مَنْ كَانَ \".\nقَالَ عَبْد اللَّهِ : ضَيَاعًا : يَعْنِي : عِيَالًا.\nوَقَالَ : فَلْأُدْعَ لَهُ، يَعْنِي : ادْعُونِي لَهُ أَقْضِ عَنْهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Ubaidullah bin Musa, daripada Sufyan, daripada Abu Zinad, daripada Al-A'raj, daripada Abu Hurairah, dia berkata: Rasulullah SAW bersabda: \"Demi Zat yang jiwaku berada di tangan-Nya, tidak ada seorang mukmin pun di bumi kecuali aku lebih utama baginya daripada dirinya sendiri. Maka barangsiapa meninggalkan hutang atau keluarga yang terlantar, maka hendaklah dia menyerahkan urusannya kepadaku, kerana akulah walinya. Dan barangsiapa meninggalkan harta, maka harta itu untuk ahli warisnya siapa pun mereka.\" Abdullah berkata: \"ضَيَاعًا\" (dhiya'an) maknanya: keluarga. Dan dia berkata: \"فَلْأُدْعَ لَهُ\" (fal-yud'a lahu) maknanya: serahkanlah urusannya kepadaku, aku akan melunasinya untuknya."
  },
  {
    "id": 39403,
    "hadith_number": 1866,
    "tajuk_hadith": "Allah Bersama Orang yang Berhutang Sehingga Hutangnya Dilunaskan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ  ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيل بْنِ أَبِي فُدَيْكٍ  ، حَدَّثَنَا سَعِيدُ بْنُ سُفْيَانَ  مَوْلَى الْأَسْلَمِيِّينَ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ  ، عَنْ أَبِيهِ  ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِنَّ اللَّهَ مَعَ الدَّائِنِ حَتَّى يُقْضَى دَيْنُهُ مَا لَمْ يَكُنْ فِيمَا يَكْرَهُ اللَّهُ \".\nقَالَ : وَكَانَ عَبْدُ اللَّهِ بْنُ جَعْفَرٍ يَقُولُ لِخَازِنِهِ : اذْهَبْ فَخُذْ لِي بِدَيْنٍ، فَإِنِّي أَكْرَهُ أَنْ أَبِيتَ لَيْلَةً إِلا وَاللَّهُ مَعِي بَعْدَمَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
    "malay_translation": "Ibrahim bin al-Mundhir al-Hizami memberitahu kami, Muhammad bin Ismail bin Abi Fudayk menceritakan kepada kami, Said bin Sufyan, maula (bekas hamba) Bani Aslam, menceritakan kepada kami, daripada Jaafar bin Muhammad, daripada ayahnya, daripada Abdullah bin Jaafar, dia berkata: Rasulullah SAW bersabda: \"Sesungguhnya Allah bersama orang yang berhutang sehingga hutangnya dilunaskan, selagi mana tidak dalam perkara yang dibenci Allah.\" Dia (Abdullah bin Jaafar) berkata: Abdullah bin Jaafar pernah berkata kepada bendaharawannya: \"Pergilah dan ambilkan aku hutang, kerana aku tidak suka bermalam satu malam pun kecuali Allah bersamaku, setelah aku mendengar daripada Rasulullah SAW.\""
  },
  {
    "id": 39404,
    "hadith_number": 1867,
    "tajuk_hadith": "Tanggungjawab Mengembalikan Barang yang Diambil",
    "perawi_melayu": "Diriwayatkan daripada Samurah bin Jundub. Rantaian perawi: Muhammad bin al-Minhal, Yazid bin Zurai', Sa'id bin Abi 'Arubah, Qatadah, al-Hasan.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمِنْهَالِ  ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ  ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ  ، عَنْ قَتَادَةَ  ، عَنْ الْحَسَنِ  ، عَنْ سَمُرَةَ بْنِ جُنْدُبٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" عَلَى الْيَدِ مَا أَخَذَتْ حَتَّى تُؤَدِّيَهُ \"",
    "malay_translation": "Muhammad bin al-Minhal telah memberitahu kami, Yazid bin Zurai' telah menceritakan kepada kami, Sa'id bin Abi 'Arubah telah menceritakan kepada kami, daripada Qatadah, daripada al-Hasan, daripada Samurah bin Jundub, dia berkata: Rasulullah SAW bersabda: \"Tanggungjawab ke atas tangan adalah apa yang diambilnya sehingga dia menunaikannya (mengembalikannya).\""
  },
  {
    "id": 39405,
    "hadith_number": 1868,
    "tajuk_hadith": "Menunaikan Amanah dan Larangan Mengkhianati",
    "perawi_melayu": "Diriwayatkan oleh: Muhammad bin al-'Ala', Talq bin Ghannam, Syarik, Qais, Abu Husain, Abu Salih, Abu Hurairah R.A., daripada Nabi Muhammad صلى الله عليه وسلم",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ  ، حَدَّثَنَا طَلْقُ بْنُ غَنَّامٍ  ، عَنْ شَرِيكٍ  ، وَقَيْسٍ  ، عَنْ أَبِي حَصِينٍ  ، عَنْ أَبِي صَالِحٍ  ، عَنْ أَبِي هُرَيْرَةَ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" أَدِّ إِلَى مَنِ ائْتَمَنَكَ، وَلَا تَخُنْ مَنْ خَانَكَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin al-'Ala', telah menceritakan kepada kami Talq bin Ghannam, daripada Syarik, dan Qais, daripada Abu Husain, daripada Abu Salih, daripada Abu Hurairah, daripada Nabi صلى الله عليه وسلم, Baginda bersabda: \"Tunaikan amanah kepada orang yang mempercayaimu, dan janganlah kamu mengkhianati orang yang mengkhianatimu.\""
  },
  {
    "id": 39406,
    "hadith_number": 1869,
    "tajuk_hadith": "Reaksi Nabi SAW Terhadap Mangkuk Pecah Kerana Cemburu",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، حَدَّثَنَا حُمَيْدٌ  ، عَنْ أَنَسٍ  ، قَالَ : أَهْدَى بَعْضُ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيْهِ قَصْعَةً فِيهَا ثَرِيدٌ، وَهُوَ فِي بَيْتِ بَعْضِ أَزْوَاجِهِ، فَضَرَبَتْ الْقَصْعَةَ فَانْكَسَرَتْ، فَجَعَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْخُذُ الثَّرِيدَ فَيَرُدُّهُ فِي الصَّحْفَةِ وَهُوَ يَقُولُ :\" كُلُوا غَارَتْ أُمُّكُمْ \".\nثُمَّ انْتَظَرَ حَتَّى جَاءَتْ قَصْعَةٌ صَحِيحَةٌ.\nفَأَخَذَهَا فَأَعْطَاهَا صَاحِبَةَ الْقَصْعَةِ الْمَكْسُورَةِ.\nقَالَ عَبْد اللَّهِ : نَقُولُ بِهَذَا",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah menceritakan kepada kami Humaid, daripada Anas RA, beliau berkata: Beberapa isteri Nabi SAW menghadiahkan kepada baginda sebuah mangkuk yang berisi *tharid*, ketika itu baginda berada di rumah salah seorang isteri baginda. Kemudian isteri tersebut memukul mangkuk itu sehingga pecah. Nabi SAW pun mengambil *tharid* tersebut dan meletakkannya kembali ke dalam pinggan sambil bersabda: \"Makanlah, ibu kamu cemburu.\" Kemudian baginda menunggu sehingga datang sebuah mangkuk yang baru yang tidak pecah. Lalu baginda mengambil mangkuk yang baru itu dan memberikannya kepada pemilik mangkuk yang pecah tadi. Abdullah berkata: Kami juga berpendapat sedemikian."
  },
  {
    "id": 39407,
    "hadith_number": 1870,
    "tajuk_hadith": "Arahan Umar untuk Mengumumkan Barang Temuan Selama Setahun",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ  ، حَدَّثَنَا.\nأَبُو أُسَامَةَ  ، عَنْ الْوَلِيدِ بْنِ كَثِيرٍ  ، قَالَ : حَدَّثَنِي عَمْرُو بْنُ شُعَيْبٍ  ، عَنْ عَمْرٍو   وَعَاصِمٍ ابْنَيْ سُفْيَانَ بْنِ عَبْدِ اللَّهِ بْنِ رَبِيعَةَ الثَّقَفِيِّ  : أَنَّ سُفْيَانَ بْنَ عَبْدِ اللَّهِ وَجَدَ عَيْبَةً فَأَتَى بِهَا عُمَرَ بْنَ الْخَطَّابِ   رِضْوَانُ اللَّهِ عَلَيْهِ، فَقَالَ :\" عَرِّفْهَا سَنَةً، فَإِنْ عُرِفَتْ، فَذَاكَ، وَإِلَّا فَهِيَ لَكَ، فَلَمْ تُعْرَفْ، فَلَقِيَهُ بِهَا فِي الْعَامِ الْمُقْبِلِ فِي الْمَوْسِمِ فَذَكَرَهَا لَهُ، فَقَالَ عُمَرُ : هِيَ لَكَ، فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَنَا بِذَلِكَ \".\nقَالَ : لَا حَاجَةَ لِي بِهَا.\nفَقَبَضَهَا عُمَرُ، فَجَعَلَهَا فِي بَيْتِ الْمَالِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin al-'Ala', telah menceritakan kepada kami Abu Usamah, daripada al-Walid bin Kathir, dia berkata: Telah menceritakan kepadaku 'Amr bin Syu'aib, daripada 'Amr dan 'Asim, kedua-dua anak Sufyan bin Abdullah bin Rabi'ah ath-Thaqafi: Bahawa Sufyan bin Abdullah menemukan sebuah bekas lalu dia membawanya kepada Umar bin al-Khattab radhiyallahu 'anhu, lalu Umar berkata: \"Umumkanlah (cari pemiliknya) selama setahun. Jika dikenali (pemiliknya), maka itu (dikembalikan kepadanya), jika tidak, maka ia adalah milikmu.\" Namun, tidak dikenali (pemiliknya). Kemudian dia (Sufyan) menemuinya (Umar) pada tahun berikutnya di musim haji dan mengingatkannya tentang bekas itu. Umar berkata: \"Ia adalah milikmu, kerana sesungguhnya Rasulullah shallallahu 'alaihi wasallam memerintahkan kami demikian.\" Sufyan berkata: \"Aku tidak memerlukannya.\" Lalu Umar mengambilnya dan menjadikannya di Baitul Mal."
  },
  {
    "id": 39408,
    "hadith_number": 1871,
    "tajuk_hadith": "Kehormatan Makkah pada Hari Pembukaan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُعَاذُ بْنُ هَانِئٍ  مِنْ أَهْلِ الْبَصْرَةِ ، حَدَّثَنَا حَرْبُ بْنُ شَدَّادٍ  ، حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ  ، حَدَّثَنَا أَبُو سَلَمَةَ  ، حَدَّثَنَا أَبُو هُرَيْرَةَ   أَنَّهُ عَامَ فُتِحَتْ مَكَّةُ ، قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ :\" إِنَّ اللَّهَ حَبَسَ عَنْ مَكَّةَ الْفِيلَ، وَسَلَّطَ عَلَيْهِمْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْمُؤْمِنِينَ، أَلَا وَإِنَّهَا لَمْ تَحِلَّ لِأَحَدٍ قَبْلِي وَلَا تَحِلُّ لِأَحَدٍ بَعْدِي، أَلَا وَإِنَّهَا سَاعَتِي هَذِهِ حَرَامٌ لَا يُخْتَلَى خَلَاهَا، وَلَا يُعْضَدُ شَجَرُهَا وَلَا تُلْتَقَطُ سَاقِطَتُهَا إِلَّا لِمُنْشِدٍ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Mu'az bin Hani' dari penduduk Basrah, telah menceritakan kepada kami Harb bin Shaddad, telah menceritakan kepada kami Yahya bin Abi Kathir, telah menceritakan kepada kami Abu Salamah, telah menceritakan kepada kami Abu Hurairah RA bahawasanya pada tahun pembukaan Makkah, Rasulullah SAW berdiri lalu bersabda: \"Sesungguhnya Allah telah menahan gajah dari Makkah, dan memberikan kekuasaan kepada Rasulullah SAW dan orang-orang mukmin atas mereka. Ketahuilah, sesungguhnya ia (Makkah) tidak halal bagi seorang pun sebelumku dan tidak halal bagi seorang pun setelahku. Ketahuilah, sesungguhnya ia pada saat ini haram, tidak boleh ditebang tumbuhannya, tidak boleh dipotong pepohonannya, dan tidak boleh dipungut barang yang jatuh daripadanya kecuali bagi orang yang ingin mengumumkannya (mencari pemiliknya).\""
  },
  {
    "id": 39409,
    "hadith_number": 1872,
    "tajuk_hadith": "Akibat Kesalahan Muslim di Neraka",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ  ، عَنْ شُعْبَةَ  ، عَنْ خَالِدٍ الْحَذَّاءِ  ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ  ، عَنْ أَبِي مُسْلِمٍ  ، عَنِ الْجَارُودِ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" ضَالَّةُ الْمُسْلِمِ حَرَقُ النَّارِ \"",
    "malay_translation": "Telah menceritakan kepada kami Sa'id bin Amir, daripada Syu'bah, daripada Khalid al-Hadhdha', daripada Yazid bin Abdullah bin al-Shikhkhir, daripada Abu Muslim, daripada al-Jarud, dia berkata: Rasulullah SAW bersabda: 'Kesalahan seorang Muslim adalah bahan bakar api neraka.'"
  },
  {
    "id": 39410,
    "hadith_number": 1873,
    "tajuk_hadith": "Larangan Mendekati Barang Hilang Milik Seorang Muslim dan Tatacara Menangani Barang Temuan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا الْجُرَيْرِيُّ  ، عَنْ أَبِي الْعَلَاءِ  ، عَنْ أَبِي مُسْلِمٍ الْجَرْمِيِّ  ، عَنِ الْجَارُودِ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" ضَالَّةُ الْمُسْلِمِ حَرَقُ النَّارِ، ضَالَّةُ الْمُسْلِمِ حَرَقُ النَّارِ، ضَالَّةُ الْمُسْلِمِ حَرَقُ النَّارِ، لَا تَقْرَبَنَّهَا \".\nقَالَ : فَقَالَ رَجُلٌ : يَا رَسُولَ اللَّهِ، اللُّقَطَةُ نَجِدُهَا؟.\nقَالَ :\" أَنْشِدْهَا، وَلَا تَكْتُمْ، وَلَا تُغَيِّبْ، فَإِنْ جَاءَ رَبُّهَا، فَادْفَعْهَا إِلَيْهِ، وَإِلَّا، فَمَالُ اللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah mengkhabarkan kepada kami Al-Jurairi, daripada Abu Al-'Ala', daripada Abu Muslim Al-Jarmi, daripada Al-Jarud, dia berkata: Rasulullah SAW bersabda: \"Barang hilang milik seorang Muslim adalah bara api neraka, barang hilang milik seorang Muslim adalah bara api neraka, barang hilang milik seorang Muslim adalah bara api neraka, janganlah kamu mendekatinya.\" Dia berkata: Kemudian seorang lelaki berkata: Wahai Rasulullah, barang temuan yang kami temui? Baginda bersabda: \"Umumkanlah ia, dan jangan kamu sembunyikan, dan jangan kamu hilangkan, jika datang pemiliknya, maka serahkanlah kepadanya, jika tidak, maka harta Allah, Dia berikan kepada siapa yang Dia kehendaki.\""
  },
  {
    "id": 39411,
    "hadith_number": 1874,
    "tajuk_hadith": "Larangan Merampas Hak Seorang Muslim Walaupun Sedikit",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ يَعْقُوبَ الْكُوفِيُّ  ، عَنْ إِسْمَاعِيل بْنِ جَعْفَرٍ  ، عَنْ الْعَلَاءِ  ، عَنْ مَعْبَدِ بْنِ كَعْبٍ السَّلَمِيِّ  ، عَنْ أَخِيهِ عَبْدِ اللَّهِ بْنِ كَعْبٍ  ، عَنْ أَبِي أُمَامَةَ   : أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنِ اقْتَطَعَ حَقَّ امْرِئٍ مُسْلِمٍ بِيَمِينِهِ، فَقَدْ أَوْجَبَ اللَّهُ لَهُ النَّارَ، وَحَرَّمَ عَلَيْهِ الْجَنَّةَ \"، فَقَالَ لَهُ رَجُلٌ : وَإِنْ كَانَ شَيْئًا يَسِيرًا يَا رَسُولَ اللَّهِ؟.\nقَالَ : \" وَإِنْ قَضِيبًا مِنْ أَرَاكٍ \".\nأَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ  ، حَدَّثَنَا أَبُو أُسَامَةَ  ، عَنْ الْوَلِيدِ بْنِ كَثِيرٍ  ، عَنْ مُحَمَّدِ بْنِ كَعْبِ بْنِ مَالِكٍ  ، أَنَّهُ سَمِعَ أَخَاهُ عَبْدَ اللَّهِ بْنَ كَعْبِ بْنِ مَالِكٍ  يُحَدِّثُ : أَنَّ أَبَا أُمَامَةَ الْحَارِثِيَّ   حَدَّثَهُ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.\n..\n..\n..\n..\nفَذَكَرَ نَحْوَهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Ahmad bin Ya'qub al-Kufi, daripada Ismail bin Ja'far, daripada al-'Ala', daripada Ma'bad bin Ka'b al-Salami, daripada saudaranya Abdullah bin Ka'b, daripada Abu Umamah: Sesungguhnya Rasulullah SAW bersabda: 'Sesiapa yang mengambil hak seorang Muslim dengan sumpahnya, maka Allah mewajibkan neraka baginya dan mengharamkan syurga ke atasnya.' Lalu seorang lelaki berkata kepadanya: 'Walaupun sesuatu yang sedikit, wahai Rasulullah?' Baginda bersabda: 'Walaupun sebatang ranting kayu arak.' Telah mengkhabarkan kepada kami Abdullah bin Sa'id, telah menceritakan kepada kami Abu Usamah, daripada al-Walid bin Kathir, daripada Muhammad bin Ka'b bin Malik, bahawa dia mendengar saudaranya Abdullah bin Ka'b bin Malik menceritakan: Bahawa Abu Umamah al-Harithi menceritakan kepadanya bahawa dia mendengar Rasulullah SAW.\n..\n..\n..\n..\nlalu menyebutkan sepertinya."
  },
  {
    "id": 39412,
    "hadith_number": 1875,
    "tajuk_hadith": "Tiga Golongan yang Tidak Dikasihi Allah pada Hari Kiamat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ  ، وَحَجَّاجٌ  ، قَالَا : حَدَّثَنَا شُعْبَةُ  ، قَالَ : حَدَّثَنِي عَلِيُّ بْنُ مُدْرِكٍ  ، قَالَ : سَمِعْتُ أَبَا زُرْعَةَ  يُحَدِّثُ، عَنْ خَرَشَةَ بْنِ الْحُرِّ  ، عَنْ أَبِي ذَرٍّ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" ثَلَاثَةٌ لَا يُكَلِّمُهُمْ اللَّهُ، وَلَا يَنْظُرُ إِلَيْهِمْ يَوْمَ الْقِيَامَةِ، وَلَا يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ \"، فَقُلْتُ : يَا رَسُولَ اللَّهِ مَنْ هُمْ خَابُوا وَخَسِرُوا؟ فَأَعَادَهَا، فَقُلْتُ : مَنْ هُمْ يَا رَسُولَ اللَّهِ؟، فَقَالَ : \" الْمُسْبِلُ، وَالْمَنَّانُ، وَالْمُنَفِّقُ سِلْعَتَهُ بِالْحَلِفِ كَاذِبًا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu al-Walid dan Hajjaj, mereka berdua berkata: Syu'bah telah menceritakan kepada kami, beliau berkata: Ali bin Mudrik telah menceritakan kepada saya, beliau berkata: Saya mendengar Abu Zur'ah meriwayatkan, daripada Kharasha bin al-Hurr, daripada Abu Dharr, beliau berkata: Rasulullah SAW bersabda: \"Tiga golongan manusia yang Allah tidak akan berbicara dengan mereka, tidak akan melihat kepada mereka pada hari kiamat, tidak akan menyucikan mereka, dan bagi mereka azab yang pedih.\" Lalu saya bertanya: \"Wahai Rasulullah, siapakah mereka itu, sungguh rugi dan binasalah mereka?\" Baginda mengulanginya. Lalu saya bertanya lagi: \"Siapakah mereka wahai Rasulullah?\" Baginda bersabda: \"Orang yang melabuhkan pakaiannya (isbal), orang yang suka mengungkit-ungkit pemberian (mannan), dan orang yang melariskan dagangannya dengan sumpah dusta (munaffiq).\""
  },
  {
    "id": 39413,
    "hadith_number": 1876,
    "tajuk_hadith": "Ancaman bagi Orang yang Menzalimi Tanah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ  ، عَنْ شُعَيْبٍ  ، عَنْ الزُّهْرِيِّ  ، حَدَّثَنِي طَلْحَةُ بْنُ عَبْدِ اللَّهِ بْنِ عَوْفٍ  : أَنَّ عَبْدَ الرَّحْمَنِ بْنَ سَهْلٍ  أَخْبَرَهُ أَنَّ سَعِيدَ بْنَ زَيْدٍ  ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" مَنْ ظَلَمَ مِنَ الْأَرْضِ شِبْرًا، فَإِنَّهُ يُطَوَّقُهُ مِنْ سَبْعِ أَرَضِينَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Hakam bin Nafi', daripada Syu'aib, daripada al-Zuhri, telah menceritakan kepadaku Talhah bin Abdullah bin Auf: Bahawa Abdul Rahman bin Sahl telah mengkhabarkannya bahawa Sa'id bin Zaid RA berkata: Aku mendengar Rasulullah SAW bersabda: \"Sesiapa yang menzalimi sejengkal tanah, maka dia akan dikalungkan dengannya dari tujuh lapis bumi.\""
  },
  {
    "id": 39414,
    "hadith_number": 1877,
    "tajuk_hadith": "Ganjaran Menghidupkan Tanah Mati",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ  ، حَدَّثَنَا أَبُو أُسَامَةَ  ، عَنْ هِشَامِ بْنِ عُرْوَةَ  ، قَالَ : أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ رَافِعٍ  : أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ   أَخْبَرَهُ : أَنَّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنْ أَحْيَا أَرْضًا مَيْتَةً فَلَهُ فِيهَا أَجْرٌ وَمَا أَكَلَتِ الْعَافِيَةُ مِنْهَا، فَلَهُ فِيهَا صَدَقَةٌ \".\nقَالَ أَبُو مُحَمَّدٍ : الْعَافِيَةُ : الطَّيْرُ وَغَيْرُ ذَلِكَ",
    "malay_translation": "Abdullah bin Sa'id telah memberitahu kami, Abu Usamah telah menceritakan kepada kami, daripada Hisham bin Urwah, beliau berkata: Ubaidullah bin Abd al-Rahman bin Rafi' telah memberitahu saya: bahawa Jabir bin Abdullah telah memberitahunya: bahawa Rasulullah SAW bersabda: \"Sesiapa yang menghidupkan tanah yang mati, maka dia mendapat pahala padanya, dan apa sahaja yang dimakan oleh makhluk hidup daripadanya, maka baginya sedekah padanya.\" Abu Muhammad berkata: 'Afiyah adalah burung dan selainnya."
  },
  {
    "id": 39415,
    "hadith_number": 1878,
    "tajuk_hadith": "Pemberian Lombong Garam dan Penarikbalikan Pemberiannya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ الْحُمَيْدِيُّ  ، حَدَّثَنَا الْفَرَجُ بْنُ سَعِيدِ بْنِ عَلْقَمَةَ بْنِ سَعِيدِ بْنِ أَبْيَضَ بْنِ حَمَّالٍ السَّبَائِيُّ الْمَأْرِبِيُّ  ، حَدَّثَنِي عَمِّي ثَابِتُ بْنُ سَعِيدِ بْنِ أَبْيَضَ  : أَنَّ أَبَاهُ سَعِيدَ بْنَ أَبْيَضَ  حَدَّثَهُ، عَنْ أَبْيَضَ بْنِ حَمَّالٍ   حَدَّثَهُ : أَنَّهُ اسْتَقْطَعَ الْمِلْحَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّذِي يُقَالُ لَهُ مِلْحُ شَذَّا بِمَأْرِبَ فَأَقْطَعَهُ، ثُمَّ إِنَّ الْأَقْرَعَ بْنَ حَابِسٍ التَّمِيمِيَّ.\nقَالَ : يَا نَبِيَّ اللَّهِ إِنِّي قَدْ وَرَدْتُ الْمِلْحَ فِي الْجَاهِلِيَّةِ، وَهُوَ بِأَرْضٍ لَيْسَ بِهَا مَاءٌ، وَمَنْ وَرَدَهُ، أَخَذَهُ، وَهُوَ مِثْلُ مَاءِ الْعِدِّ.\nفَاسْتَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْأَبْيَضَ فِي قَطِيعَتِهِ فِي الْمِلْحِ، فَقُلْتُ : قَدْ أَقَلْتُهُ عَلَى أَنْ تَجْعَلَهُ مِنِّي صَدَقَةً، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" هُوَ مِنْكَ صَدَقَةٌ، وَهُوَ مِثْلُ مَاءِ الْعِدِّ، مَنْ وَرَدَهُ، أَخَذَهُ \".\nقَالَ : وَقَطَعَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْضًا وَنَخْلًا وَكَذَا بِالْجَوْفِ : جَوْفِ مُرَادٍ مَكَانَهُ حِينَ أَقَالَهُ مِنْهُ.\nقَالَ الْفَرَجُ : فَهُوَ عَلَى ذَلِكَ : مَنْ وَرَدَهُ، أَخَذَهُ",
    "malay_translation": "Abdullah bin Zubair al-Humaidi memberitahu kami, katanya: Al-Faraj bin Sa'id bin 'Alqamah bin Sa'id bin Abyad bin Hammal as-Saba'i al-Ma'ribi memberitahu kami, katanya: Bapa saudaraku Thabit bin Sa'id bin Abyad menceritakan kepadaku: Bahawa bapanya Sa'id bin Abyad menceritakan kepadanya, daripada Abyad bin Hammal menceritakan kepadanya: Bahawa dia meminta kepada Rasulullah SAW sebahagian lombong garam yang dikenali sebagai Milh Shadza di Ma'rib, lalu baginda memberikannya. Kemudian al-Aqra' bin Habis at-Tamimi berkata: Wahai Nabi Allah, sesungguhnya aku telah sampai ke lombong garam ini pada zaman Jahiliyyah, dan ia berada di tanah yang tidak ada airnya, dan sesiapa yang mendatanginya, dia mengambilnya, dan ia seperti air telaga yang tidak pernah kering. Lalu Nabi SAW meminta kembali pemberian lombong garam itu daripada Abyad. Aku berkata: Aku telah menarik balik pemberian itu dengan syarat engkau menjadikannya sedekah daripadaku. Maka Rasulullah SAW bersabda: \"Ia adalah sedekah daripadamu, dan ia seperti air telaga yang tidak pernah kering, sesiapa yang mendatanginya, dia mengambilnya.\" Dia berkata: Dan Rasulullah SAW memberikannya tanah dan pohon kurma serta seumpamanya di al-Jauf: Jauf Murad sebagai ganti tempatnya ketika baginda menarik balik pemberian daripadanya. Al-Faraj berkata: Maka ia tetap seperti itu: sesiapa yang mendatanginya, dia mengambilnya."
  },
  {
    "id": 39416,
    "hadith_number": 1879,
    "tajuk_hadith": "Pemberian Tanah oleh Rasulullah SAW",
    "perawi_melayu": "Muhammad bin Bashar",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ  ، حَدَّثَنَا غُنْدَرٌ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ سِمَاكِ بْنِ حَرْبٍ  ، عَنْ عَلْقَمَةَ بْنِ وَائِلٍ  ، عَنْ أَبِيهِ   \" أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَقْطَعَهُ أَرْضًا \".\nقَالَ : فَأَرْسَلَ مَعِي مُعَاوِيَةَ.\nقَالَ : أَعْطِهَا إِيَّاهُ.\n قَالَ يَحْيَى : حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ  ، حَدَّثَنَا غُنْدَرٌ  ، بِهَذَا الْحَدِيثِ",
    "malay_translation": "Muhammad bin Bashar telah memberitahu kami, Ghundar telah menceritakan kepada kami, Syu'bah telah menceritakan kepada kami, daripada Simak bin Harb, daripada 'Alqamah bin Wa'il, daripada ayahnya, bahawa Rasulullah SAW memberikan kepadanya sebidang tanah. Dia (Wa'il) berkata: Baginda menghantar Muawiyah bersama saya. Dia (Rasulullah SAW) berkata: Berikan tanah ini kepadanya. Yahya berkata: Muhammad bin Bashar telah menceritakan kepada kami, Ghundar telah menceritakan kepada kami, hadis ini."
  },
  {
    "id": 39417,
    "hadith_number": 1880,
    "tajuk_hadith": "Ganjaran Sedekah Bagi Muslim yang Menanam Tanaman",
    "perawi_melayu": "Ummu Mubashir",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْمُعَلَّى بْنُ أَسَدٍ  ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ  ، حَدَّثَنَا سُلَيْمَانُ الْأَعْمَشُ  ، حَدَّثَنَا أَبُو سُفْيَانَ  ، قَالَ : سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ  ، يَقُولُ : حَدَّثَتْنِي أُمُّ مُبَشِّرٍ   امْرَأَةُ زَيْدِ بْنِ حَارِثَةَ، قَالَتْ : دَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَائِطٍ لِي، فَقَالَ : \" يَا أُمَّ مُبَشِّرٍ، أَمُسْلِمٌ غَرَسَ هَذَا، أَمْ كَافِرٌ؟ \".\nقُلْتُ : مُسْلِمٌ، فَقَالَ :\" مَا مِنْ مُسْلِمٍ يَغْرِسُ غَرْسًا فَيَأْكُلُ مِنْهُ إِنْسَانٌ، أَوْ دَابَّةٌ، أَوْ طَيْرٌ، إِلَّا كَانَتْ لَهُ صَدَقَةٌ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Mu'alla bin Asad, telah menceritakan kepada kami 'Abd al-Wahid bin Ziyad, telah menceritakan kepada kami Sulaiman al-A'mash, telah menceritakan kepada kami Abu Sufyan, dia berkata: Saya mendengar Jabir bin Abdullah berkata: Ummu Mubashir, isteri Zaid bin Harithah, menceritakan kepadaku, dia berkata: Rasulullah SAW masuk ke kebun saya, lalu bersabda: \"Wahai Ummu Mubashir, adakah seorang Muslim yang menanam ini, atau orang kafir?\". Saya berkata: Muslim. Baginda bersabda: \"Tidaklah seorang Muslim menanam tanaman, lalu dimakan oleh manusia, atau binatang, atau burung, melainkan ia menjadi sedekah baginya.\""
  },
  {
    "id": 39418,
    "hadith_number": 1881,
    "tajuk_hadith": "Tiada Hima (Kawasan Perlindungan) untuk Pokok Arak",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ  ، حَدَّثَنَا الْفَرَجُ بْنُ سَعِيدٍ  ، قَالَ : أَخْبَرَنِي عَمِّي ثَابِتُ بْنُ سَعِيدٍ  ، عَنْ أَبِيهِ سَعِيدٍ  ، عَنْ جَدِّهِ أَبْيَضَ بْنِ حَمَّالٍ   : أَنَّهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ حِمَى الْأَرَاكِ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَا حِمَى فِي الْأَرَاكِ \"، فَقَالَ : أَرَاكَةٌ فِي حِظَارِي؟، فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" لَا حِمَى فِي الْأَرَاكِ \".\nقَالَ فَرَجٌ : يَعْنِي ابْنُ أَبْيَضُ : بِحِظَارِي : الْأَرْضَ الَّتِي فِيهَا الزَّرْعُ الْمُحَاطُ عَلَيْهَا",
    "malay_translation": "Abdullah bin Zubair memberitahu kami, Faraj bin Sa'id menceritakan kepada kami, dia berkata: Bapa saudara saya Thabit bin Sa'id memberitahu saya, daripada bapanya Sa'id, daripada datuknya Abyadh bin Hammal: Bahawa dia bertanya kepada Rasulullah SAW tentang *hima* (kawasan perlindungan) pokok *arak*. Rasulullah SAW bersabda: \"Tidak ada *hima* untuk pokok *arak*.\" Dia bertanya: \"Adakah pokok *arak* di kawasan bertanda saya (hizari)?\" Nabi SAW bersabda: \"Tidak ada *hima* untuk pokok *arak*.\" Faraj berkata: Maksudnya, anak Abyadh: dengan *hizari*: tanah yang di dalamnya ada tanaman yang dikelilingi oleh pagar."
  },
  {
    "id": 39419,
    "hadith_number": 1882,
    "tajuk_hadith": "Larangan Menjual Air",
    "perawi_melayu": "Muhammad bin Yusuf, Ibnu Uyainah, 'Amr bin Dinar, Abu al-Minhal, Iyas bin Abd al-Muzani",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا ابْنُ عُيَيْنَةَ  ، عَنْ عَمْرِو بْنِ دِينَارٍ  ، عَنْ أَبِي الْمِنْهَالِ  ، قَالَ : سَمِعْتُ إِيَاسَ بْنَ عَبْدٍ الْمُزَنِيَّ   وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ : لَا تَبِيعُوا الْمَاءَ : فَإِنِّي سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \" يَنْهَى عَنْبَيْعِ الْمَاءِ \".\nوَقَالَ عَمْرُو بْنُ دِينَارٍ : لَا نَدْرِي أَيَّ مَاءٍ.\nقَالَ : يَقُولُ : لَا أَدْرِي مَاءً جَارِيًا أَوِ الْمَاءَ الْمُسْتَقَى؟",
    "malay_translation": "Daripada Muhammad bin Yusuf, telah menceritakan kepada kami Ibnu Uyainah, daripada 'Amr bin Dinar, daripada Abu al-Minhal, dia berkata: Saya mendengar Ilyas bin 'Abd al-Muzani dan beliau adalah seorang sahabat Nabi ﷺ, berkata: \"Janganlah kamu menjual air, kerana sesungguhnya saya mendengar Nabi ﷺ melarang daripada menjual air.\" 'Amr bin Dinar berkata: Kami tidak tahu air yang mana (dilarang dijual). Dia berkata: Dia berkata: Saya tidak tahu sama ada air yang mengalir atau air yang ditadah?"
  },
  {
    "id": 39420,
    "hadith_number": 1883,
    "tajuk_hadith": "Perkara yang Tidak Halal Dihalang: Garam dan Air, dan Galakan Berbuat Kebaikan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ  ، حَدَّثَنَا كَهْمَسٌ  ، عَنْ سَيَّارٍ  رَجُلٍ مِنْ فَزَارَةَ عَنْ أَبِيهِ  ، عَنْ بُهَيْسَةَ  ، عَنْ أَبِيهَا  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : أَنَّهُ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاسْتَأْذَنَهُ فَدَخَلَ بَيْنَهُ وَبَيْنَ قَمِيصِهِ وَقَدْ قَالَ عُثْمَانُ : فَالْتَزَمَهُ ، فَقَالَ : مَا الشَّيْءُ الَّذِي لَا يَحِلُّ مَنْعُهُ؟، فَقَالَ : \" الْمِلْحُ وَالْمَاءُ \"، فَقَالَ : مَا الشَّيْءُ الَّذِي لَا يَحِلُّ مَنْعُهُ؟.\nقَالَ :\" أَنْ تَفْعَلَ الْخَيْرَ خَيْرٌ لَكَ \".\nقَالَ : مَا الشَّيْءُ الَّذِي لَا يَحِلُّ مَنْعُهُ؟.\nقَالَ : \" إِنْ تَفْعَلْ الْخَيْرَ خَيْرٌ لَكَ \"وَانْتَهَى إِلَى الْمِلْحِ وَالْمَاءِ.\nقِيلَ لِعَبْدِ اللَّهِ : تَقُولُ بِهِ؟ فَأَوْمَأَ بِرَأْسِهِ",
    "malay_translation": "Telah menceritakan kepada kami Uthman bin Umar, telah menceritakan kepada kami Kahmas, daripada Sayyar, seorang lelaki dari Fazarah, daripada ayahnya, daripada Buhaysah, daripada ayahnya, daripada Nabi SAW: Bahawasanya dia datang kepada Nabi SAW, lalu meminta izin kepada baginda, lalu dia masuk di antara baginda dan baju baginda. Dan Uthman telah berkata: Lalu dia memeluknya, lalu berkata: \"Apakah perkara yang tidak halal untuk dihalang?\", baginda bersabda: \"Garam dan air\". Lalu dia berkata: \"Apakah perkara yang tidak halal untuk dihalang?\". Baginda bersabda: \"Bahawa kamu melakukan kebaikan adalah lebih baik untukmu\". Dia berkata: \"Apakah perkara yang tidak halal untuk dihalang?\". Baginda bersabda: \"Jika kamu melakukan kebaikan adalah lebih baik untukmu\" dan berakhir kepada garam dan air. Dikatakan kepada Abdullah: \"Adakah kamu mengatakan dengannya?\", lalu dia mengangguk dengan kepalanya."
  },
  {
    "id": 39421,
    "hadith_number": 1884,
    "tajuk_hadith": "Pengelolaan Khaibar dengan Separuh Hasil",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ  ، حَدَّثَنَا يَحْيَى  ، عَنْ عُبَيْدِ اللَّهِ  ، حَدَّثَنِي نَافِعٌ  ، عَنْ عَبْدِ اللَّهِ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" عَامَلَ خَيْبَرَ بِشَطْرِ مَا يَخْرُجُ مِنْهَا مِنْ ثَمَرَةٍ أَوْ زَرْعٍ \"",
    "malay_translation": "Telah menceritakan kepada kami Musaddad, telah menceritakan kepada kami Yahya, dari Ubaidillah, telah menceritakan kepadaku Nafi', dari Abdullah, bahawa Rasulullah ﷺ memperlakukan penduduk Khaibar dengan (bagian) separuh dari apa yang keluar darinya berupa buah atau tanaman."
  },
  {
    "id": 39422,
    "hadith_number": 1885,
    "tajuk_hadith": "Galakan Mengusahakan Tanah atau Memberikannya kepada Saudara",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْحَسَنِ  ، عَنْ زَكَرِيَّا بْنِ إِسْحَاق  ، حَدَّثَنَا أَبُو الزُّبَيْرِ  : أَنَّهُ سَمِعَ جَابِرًا   يَقُولُ : كُنَّا نُخَابِرُ قَبْلَ أَنْ يَنْهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْخِبْرِ بَسَنَتَيْنِ أَوْ ثَلَاثٍ، عَلَى الثُّلُثِ، وَالشَّطْرِ، وَشَيْءٍ مِنْ تِبْنٍ، فَقَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَحْرُثْهَا، فَإِنْ كَرِهَ أَنْ يَحْرُثَهَا، فَلْيَمْنَحْهَا أَخَاهُ، فَإِنْ كَرِهَ أَنْ يَمْنَحَهَا أَخَاهُ، فَلْيَدَعْهَا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu al-Hasan, daripada Zakaria bin Ishaq, telah menceritakan kepada kami Abu al-Zubair: Bahawa dia mendengar Jabir berkata: Kami pernah melakukan mukhabarah (berkongsi hasil tanaman) sebelum Rasulullah ﷺ melarang kami daripada mukhabarah dua atau tiga tahun, iaitu dengan bahagian satu pertiga, dan separuh, dan sedikit dari jerami, lalu Rasulullah ﷺ bersabda kepada kami: \"Sesiapa yang memiliki tanah, maka hendaklah dia mengusahakannya. Jika dia tidak suka untuk mengusahakannya, maka hendaklah dia memberikannya kepada saudaranya. Jika dia tidak suka untuk memberikannya kepada saudaranya, maka hendaklah dia meninggalkannya (tanpa diusahakan).\""
  },
  {
    "id": 39423,
    "hadith_number": 1886,
    "tajuk_hadith": "Larangan Muzara'ah",
    "perawi_melayu": "Diriwayatkan daripada Muhammad bin Uyainah, daripada Ali bin Mushir, daripada Abi Ishaq al-Shaibani, daripada Abdullah bin al-Sa'ib, bahawa beliau berkata: \"Saya bertanya kepada Abdullah bin Ma'qil tentang muzara'ah.\", lalu beliau menjawab: \"Thabit bin Dhahhak al-Ansari telah memberitahu saya bahawa Rasulullah ﷺ melarang muzara'ah.\". Abdullah bertanya lagi: \"Adakah kamu berpegang pada pendapat ini?\", beliau menjawab: \"Saya tidak berpegang pada pendapat yang pertama.\"",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ  ، عَنْ عَلِيِّ بْنِ مُسْهِرٍ  ، عَنْ أَبِي إِسْحَاق الشَّيْبَانِيِّ  ، عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِ  ، قَالَ : سَأَلْتُ عَبْدَ اللَّهِ بْنَ مَعْقِلٍ  عَنِ الْمُزَارَعَةِ، فَقَالَ : أَخْبَرَنِي ثَابِتُ بْنُ الضَّحَّاكِ الْأَنْصَارِيُّ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \"نَهَى عَنِ الْمُزَارَعَةِ \".\n قَالَ لِعَبْدِ اللَّهِ : تَقُولُ بِهِ؟.\nقَالَ : لَا أَقُولُ بِالْأَوَّلِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Uyainah, daripada Ali bin Mushir, daripada Abi Ishaq al-Shaibani, daripada Abdullah bin al-Sa'ib, bahawa beliau berkata: \"Saya bertanya kepada Abdullah bin Ma'qil tentang muzara'ah.\", lalu beliau menjawab: \"Thabit bin Dhahhak al-Ansari telah memberitahu saya bahawa Rasulullah ﷺ melarang muzara'ah.\". Abdullah bertanya lagi: \"Adakah kamu berpegang pada pendapat ini?\", beliau menjawab: \"Saya tidak berpegang pada pendapat yang pertama.\""
  },
  {
    "id": 39424,
    "hadith_number": 1887,
    "tajuk_hadith": "Larangan Menjual Tanah Kosong untuk Dua atau Tiga Tahun",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا زُهَيْرٌ  ، عَنْ أَبِي الزُّبَيْرِ  ، عَنْ جَابِرٍ  ، قَالَ : \" نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْبَيْعِ الْأَرْضِ الْبَيْضَاءِ سَنَتَيْنِ أَوُ ثَلَاثًا \"",
    "malay_translation": "Abu Nu'aim telah memberitahu kami, Zuhair telah menceritakan kepada kami, daripada Abu al-Zubair, daripada Jabir, beliau berkata: \"Rasulullah SAW melarang penjualan tanah kosong untuk tempoh dua atau tiga tahun.\""
  },
  {
    "id": 39425,
    "hadith_number": 1888,
    "tajuk_hadith": "Larangan Menyewakan Tanah dengan Hasil Tanaman Tertentu dan Kebenaran Menyewakannya dengan Emas dan Perak",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاق بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ  ، عَنْ مُحَمَّدِ بْنِ عِكْرِمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ  ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَبِيبَةَ  ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ  ، عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ  ، قَالَ :كُنَّا نُكْرِي الْأَرْضَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَا عَلَى السَّوَاقِي مِنَ الزَّرْعِ، وَبِمَا سَعِدَ مِنَ الْمَاءِ مِنْهَا، \" فَنَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ، وَأَذِنَ لَنَا أَوْ قَالَ رَخَّصَ لَنَا فِي أَنْ نُكْرِيَهَا بِالذَّهَبِ وَالْوَرِقِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ishaq bin Ibrahim, telah menceritakan kepada kami Yazid bin Harun, telah mengkhabarkan kepada kami Ibrahim bin Sa'd, daripada Muhammad bin Ikrimah bin Abd al-Rahman bin al-Harith bin Hisham, daripada Muhammad bin Abd al-Rahman bin Abi Labibah, daripada Sa'id bin al-Musayyib, daripada Sa'd bin Abi Waqqas, dia berkata: Kami pernah menyewakan tanah pada zaman Rasulullah SAW dengan tanaman yang berada di aliran air dan dengan apa yang diairi daripadanya. Kemudian Rasulullah SAW melarang kami daripada perkara itu, dan mengizinkan kami atau bersabda, memberikan keringanan kepada kami untuk menyewakannya dengan emas dan perak."
  },
  {
    "id": 39426,
    "hadith_number": 1889,
    "tajuk_hadith": "Arahan Mengambil Anggaran Hasil Tanaman",
    "perawi_melayu": "Sahl bin Abi Hathmah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَسْعُودِ بْنِ نِيَارٍ الْأَنْصَارِيِّ  ، قَالَ : جَاءَ سَهْلُ بْنُ أَبِي حَثْمَةَ   إِلَى مَجْلِسِنَا فَحَدَّثَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" إِذَا خَرَصْتُمْ، فَخُذُوا وَدَعُوا، دَعُوا الثُّلُثَ، فَإِنْ لَمْ تَدَعُوا الثُّلُثَ، فَدَعُوا الرُّبُعَ \"",
    "malay_translation": "Telah menceritakan kepada kami Hasyim bin al-Qasim, telah menceritakan kepada kami Syu'bah, daripada Khubaib bin Abd al-Rahman, daripada Abd al-Rahman bin Mas'ud bin Niyar al-Ansari, dia berkata: Telah datang Sahl bin Abi Hathmah ke majlis kami lalu menceritakan bahawa Nabi صلى الله عليه وسلم bersabda: \"Apabila kamu membuat anggaran (hasil tanaman), maka ambillah (sebahagian) dan tinggalkanlah (sebahagian), tinggalkanlah sepertiga. Jika kamu tidak meninggalkan sepertiga, maka tinggalkanlah seperempat.\""
  },
  {
    "id": 39427,
    "hadith_number": 1890,
    "tajuk_hadith": "Larangan Keuntungan Hamba Perempuan",
    "perawi_melayu": "Sahl bin Hammad, Syu'bah, Muhammad bin Juhadah, Abu Hazim, Abu Hurairah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَهْلُ بْنُ حَمَّادٍ  ، حَدَّثَنَا شُعْبَةُ  ، حَدَّثَنَا مُحَمَّدُ بْنُ جُحَادَةَ  ، عَنْ أَبِي حَازِمٍ  ،  عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : \" نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْكَسْبِ الْإِمَاءِ \"",
    "malay_translation": "Telah meriwayatkan kepada kami Sahl bin Hammad, telah meriwayatkan kepada kami Syu'bah, telah meriwayatkan kepada kami Muhammad bin Juhadah, daripada Abu Hazim, daripada Abu Hurairah, beliau berkata: \"Rasulullah ﷺ melarang daripada keuntungan hamba perempuan.\""
  },
  {
    "id": 39428,
    "hadith_number": 1891,
    "tajuk_hadith": "Larangan Pendapatan Buruk",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا وَهْبُ بْنُ جَرِيرٍ  ، حَدَّثَنَا هِشَامٌ  ، عَنْ يَحْيَى  ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ قَارِظٍ  : أَنَّ السَّائِبَ بْنَ يَزِيدَ  حَدَّثَهُ : أَنَّ رَافِعَ بْنَ خَدِيجٍ   حَدَّثَهُ : أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" كَسْبُ الْحَجَّامِ خَبِيثٌ، وَمَهْرُ الْبَغِيِّ خَبِيثٌ، وَثَمَنُ الْكَلْبِ خَبِيثٌ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Wahb bin Jarir, telah menceritakan kepada kami Hisyam, daripada Yahya, daripada Ibrahim bin Abdullah bin Qariz: Bahawa as-Sa'ib bin Yazid menceritakan kepadanya: Bahawa Rafi' bin Khadij menceritakan kepadanya: Bahawa Rasulullah SAW bersabda: \"Pendapatan tukang bekam adalah buruk, dan upah pelacur adalah buruk, dan harga anjing adalah buruk.\""
  },
  {
    "id": 39429,
    "hadith_number": 1892,
    "tajuk_hadith": "Rasulullah SAW Berbekam dan Memerintahkan Dua Sa' Makanan",
    "perawi_melayu": "Yazid bin Harun, Humaid at-Tawil, Anas bin Malik",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا حُمَيْدٌ الطَّوِيلُ  ،  عَنْ أَنَسِ بْنِ مَالِكٍ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\" حَجَمَهُ أَبُو طَيْبَةَ وَأَمَرَ لَهُ بِصَاعَيْنِ مِنْ طَعَامٍ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah mengkhabarkan kepada kami Humaid at-Tawil, daripada Anas bin Malik: Sesungguhnya Rasulullah SAW telah berbekam, Abu Taibah membekam baginda, dan baginda memerintahkan untuknya dua *sa'* makanan."
  },
  {
    "id": 39430,
    "hadith_number": 1893,
    "tajuk_hadith": "Larangan Menjual Air Mani Pejantan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى  ، حَدَّثَنَا ابْنُ فُضَيْلٍ  ، عَنْ الْأَعْمَشِ  ، عَنْ أَبِي حَازِمٍ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : \" نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْثَمَنِ عَسْبِ الْفَحْلِ \"",
    "malay_translation": "Muhammad bin Isa telah mengkhabarkan kepada kami, Ibnu Fudail telah menceritakan kepada kami, daripada Al-A'mash, daripada Abu Hazim, daripada Abu Hurairah, beliau berkata: \"Rasulullah SAW melarang daripada harga air mani pejantan.\""
  },
  {
    "id": 39431,
    "hadith_number": 1894,
    "tajuk_hadith": "Larangan Upah Air Mani Pejantan dan Upah Pelacur",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا الْقَاسِمُ بْنُ الْفَضْلِ  ، حَدَّثَنَا أَبِي  ، عَنْ الْمَهْرِيِّ  ، قَالَ : قَالَ أَبُو هُرَيْرَةَ   \" نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْعَسْبِ الْفَحْلِ، وَأَجْرِ الْمُومِسَةِ \"",
    "malay_translation": "Muslim bin Ibrahim memberitahu kami, Al-Qasim bin Al-Fadhl memberitahu kami, ayah saya memberitahu kami, daripada Al-Mahri, dia berkata: Abu Hurairah berkata: \"Rasulullah SAW melarang upah air mani pejantan dan upah pelacur.\""
  },
  {
    "id": 39432,
    "hadith_number": 1895,
    "tajuk_hadith": "Jual Beli Rumah atau Tanah dan Keberkatan",
    "perawi_melayu": "Abu Nu'aim, Ismail bin Ibrahim bin Muhajir, Abdul Malik bin Umair, Amru bin Huraith, Sa'id bin Huraith",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا إِسْمَاعِيل هُوَ : ابْنُ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ  ، قَالَ : سَمِعْتُ عَبْدَ الْمَلِكِ بْنَ عُمَيْرٍ  ، يُحَدِّثُ، قَالَ : سَمِعْتُ عَمْرَو بْنَ حُرَيْثٍ  ، عَنْ أَخِيهِ سَعِيدِ بْنِ حُرَيْثٍ   وَكَانَتْ لَهُ صُحْبَةٌ ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" مَنْ بَاعَ مِنْكُمْ دَارًا أَوْ عَقَارًا، فَإِنَّهُ قَمِنٌ أَنْ لَا يُبَارَكَ لَهُ إِلَّا أَنْ يَجْعَلَهُ فِي مِثْلِهِ \"",
    "malay_translation": "Abu Nu'aim memberitahu kami, Ismail—iaitu anak Ibrahim bin Muhajir—menceritakan kepada kami, katanya: Saya mendengar Abdul Malik bin Umair menceritakan, katanya: Saya mendengar Amru bin Huraith, daripada saudaranya, Sa'id bin Huraith—dan beliau adalah seorang Sahabat—, katanya: Saya mendengar Rasulullah SAW bersabda: \"Sesiapa di antara kamu yang menjual rumah atau tanah, maka dia hampir tidak diberkati kecuali jika dia menjadikannya serupa dengannya.\""
  },
  {
    "id": 39433,
    "hadith_number": 1896,
    "tajuk_hadith": "Larangan Menggali Perigi Berdekatan Perigi Lain",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاق بْنُ إِبْرَاهِيمَ  ، أَخْبَرَنَا عَرْعَرَةُ بْنُ الْبِرِنْدِ السَّامِيُّ  ، حَدَّثَنَا إِسْمَاعِيل بْنُ مُسْلِمٍ  ، عَنْ الْحَسَنِ  ، عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ  ، عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنِ احْتَفَرَ بِئْرًا، فَلَيْسَ لِأَحَدٍ أَنْ يَحْفِرَ حَوْلَهُ أَرْبَعِينَ ذِرَاعًا عَطَنًا لِمَاشِيَتِهِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ishaq bin Ibrahim, telah mengkhabarkan kepada kami 'Ar'arah bin al-Birind al-Sami, telah menceritakan kepada kami Ismail bin Muslim, daripada al-Hasan, daripada Abdullah bin Mughaffal, daripada Rasulullah SAW, yang bersabda: \"Sesiapa yang menggali perigi, tidak dibenarkan bagi orang lain untuk menggali di sekitarnya dalam jarak empat puluh hasta sebagai tempat minum bagi haiwan ternakannya.\""
  },
  {
    "id": 39434,
    "hadith_number": 1897,
    "tajuk_hadith": "Hak Keutamaan Membeli Apabila Jalan Sama",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَعْلَى  ، حَدَّثَنَا عَبْدُ الْمَلِكِ  ، عَنْ عَطَاءٍ  ، عَنْ جَابِرٍ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الشُّفْعَةِ إِذَا كَانَ طَرِيقُهُمَا وَاحِدًا؟.\nقَالَ :\" يُنْظَرُ بِهَا، وَإِنْ كَانَ صَاحِبُهَا غَائِبًا \"",
    "malay_translation": "Ya'la telah meriwayatkan kepada kami, Abdul Malik telah menceritakan kepada kami, daripada 'Ata', daripada Jabir, daripada Nabi ﷺ mengenai *syuf'ah* (hak keutamaan membeli) apabila jalan mereka berdua adalah sama. Baginda bersabda: \"Perkara ini perlu dipertimbangkan, walaupun pemiliknya tidak hadir.\""
  },
  {
    "id": 39435,
    "hadith_number": 1898,
    "tajuk_hadith": "Hukum Syuf'ah dalam Perkongsian yang Belum Dibahagikan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ  ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ  ، عَنْ ابْنِ جُرَيْجٍ  ، عَنْ أَبِي الزُّبَيْرِ  ، عَنْ جَابِرٍ  ، قَالَ :\" قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالشُّفْعَةِ فِي كُلِّ شِرْكٍ لَمْ يُقْسَمْ : رَبْعَةٍ أَوْ حَائِطٍ لَا يَحِلُّ لَهُ أَنْ يَبِيعَ حَتَّى يُؤْذِنَ شَرِيكَهُ، فَإِنْ شَاءَ، أَخَذَ، وَإِنْ شَاءَ، تَرَكَ، فَإِنْ بَاعَ وَلَمْ يُؤْذِنْهُ، فَهُوَ أَحَقُّ بِهِ \".\n قِيلَ لِأَبِي مُحَمَّدٍ : تَقُولُ بِهَذَا؟.\nقَالَ : نَعَمْ",
    "malay_translation": "Muhammad bin al-'Ala' memberitahu kami, katanya: Abdullah bin Idris menceritakan kepada kami, daripada Ibn Juraij, daripada Abu Zubair, daripada Jabir, dia berkata: \"Rasulullah SAW telah memutuskan tentang hak *syuf'ah* (pra-emption) dalam setiap perkongsian yang belum dibahagikan: sama ada tanah atau dinding. Tidak halal baginya untuk menjual sehingga dia memberitahu rakan kongsinya. Jika dia mahu, dia boleh mengambilnya (membeli), dan jika dia mahu, dia boleh meninggalkannya (tidak membeli). Jika dia menjual tanpa memberitahunya, maka dia (rakan kongsi) lebih berhak terhadapnya.\" Dikatakan kepada Abu Muhammad: Adakah anda mengatakan (berpendapat) dengan ini? Dia berkata: Ya."
  }
]
