[
  {
    "id": 39648,
    "hadith_number": 2111,
    "tajuk_hadith": "Galakan Mempelajari Ilmu Faraidh, Lahnu, dan Sunnah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَنْبَأَنَا عَاصِمٌ  ، عَنْ مُوَرِّقٍ الْعِجْلِيِّ  ، قَالَ : قَالَ عُمَرُ بْنُ الْخَطَّابِ   :\" تَعَلَّمُوا الْفَرَائِضَ وَاللَّحْنَ وَالسُّنَنَ كَمَا تَعَلَّمُونَ الْقُرْآنَ \"",
    "malay_translation": "Yazid bin Harun telah mengkhabarkan kepada kami, 'Asim telah memberitakan kepada kami, daripada Muwarriq al-'Ijli, dia berkata: Umar bin al-Khattab berkata: \"Pelajarilah faraidh (ilmu pembahagian harta pusaka), lahnu (kesalahan dalam berbahasa Arab), dan sunnah-sunnah sebagaimana kamu mempelajari Al-Quran.\""
  },
  {
    "id": 39649,
    "hadith_number": 2112,
    "tajuk_hadith": "Belajar Ilmu Faraid Adalah Sebahagian daripada Agama",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ الْأَعْمَشِ  ، عَنْ إِبْرَاهِيمَ  ، قَالَ : قَالَ عُمَرُ   :\" تَعَلَّمُوا الْفَرَائِضَ فَإِنَّهَا مِنْ دِينِكُمْ \"",
    "malay_translation": "Muhammad bin Yusuf meriwayatkan kepada kami, Sufyan meriwayatkan kepada kami, daripada al-A'mash, daripada Ibrahim, dia berkata: Umar berkata: \"Pelajarilah ilmu faraid (hukum waris) kerana sesungguhnya ia adalah sebahagian daripada agama kamu.\""
  },
  {
    "id": 39650,
    "hadith_number": 2113,
    "tajuk_hadith": "Kepentingan Uthman dan Zaid dalam Ilmu Faraidh",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى ، حَدَّثَنَا يُوسُفُ الْمَاجِشُونُ ، قَالَ : قَالَ ابْنُ شِهَابٍ  :\" لَوْ هَلَكَ عُثْمَانُ، وَزَيْدٌ فِي بَعْضِ الزَّمَانِ، لَهَلَكَ عِلْمُ الْفَرَائِضِ، لَقَدْ أَتَى عَلَى النَّاسِ زَمَانٌ، وَمَا يَعْلَمُهَا غَيْرُهُمَا \"",
    "malay_translation": "Muhammad bin Isa telah meriwayatkan kepada kami, Yusuf al-Majishun telah meriwayatkan kepada kami, dia berkata: Ibnu Shihab berkata: \"Sekiranya Uthman dan Zaid meninggal dunia pada suatu masa, nescaya ilmu faraidh akan hilang. Sesungguhnya telah datang kepada manusia suatu zaman di mana tidak ada yang mengetahuinya kecuali mereka berdua.\""
  },
  {
    "id": 39651,
    "hadith_number": 2114,
    "tajuk_hadith": "Galakan Mempelajari Al-Quran dan Ilmu Faraidh",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا الْمَسْعُودِيُّ  ، عَنْ الْقَاسِمِ  ، قَالَ : قَالَ عَبْدُ اللَّهِ   :\" تَعَلَّمُوا الْقُرْآنَ وَالْفَرَائِضَ، فَإِنَّهُ يُوشِكُ أَنْ يَفْتَقِرَ الرَّجُلُ إِلَى عِلْمٍ كَانَ يَعْلَمُهُ، أَوْ يَبْقَى فِي قَوْمٍ لَا يَعْلَمُونَ",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Al-Mas'udi, dari Al-Qasim, dia berkata: Abdullah berkata: \"Pelajarilah Al-Quran dan ilmu faraidh (hukum waris), kerana sesungguhnya hampir tiba masanya seseorang itu memerlukan ilmu yang pernah dia ketahui, atau dia tinggal di kalangan kaum yang tidak mengetahui.\""
  },
  {
    "id": 39652,
    "hadith_number": 2115,
    "tajuk_hadith": "Kepentingan Ilmu Faraid Selepas Mempelajari Al-Quran",
    "perawi_melayu": "Abu Musa",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا زِيَادُ بْنُ أَبِي مُسْلِمٍ  ، عَنْ أَبِي الْخَلِيلِ  ، قَالَ : قَالَ أَبُو مُوسَى   :\" مَنْ عَلِمَ الْقُرْآنَ وَلَمْ يَعْلَمْ الْفَرَائِضَ، فَإِنَّ مَثَلَهُ مَثَلُ الْبُرْنُسِ لَا وَجْهَ لَهُ، أَوْ : لَيْسَ لَهُ وَجْهٌ \"",
    "malay_translation": "Abu Nu'aim meriwayatkan kepada kami, katanya: Ziyad bin Abi Muslim meriwayatkan kepada kami, daripada Abi al-Khalil, yang berkata: Abu Musa berkata: \"Sesiapa yang mempelajari Al-Quran tetapi tidak mempelajari ilmu faraid (hukum waris), maka perumpamaannya adalah seperti burnus (jubah berhud) yang tidak bermuka, atau: ia tidak bermuka.\""
  },
  {
    "id": 39653,
    "hadith_number": 2116,
    "tajuk_hadith": "Kebaikan Terhadap Jiran Tetangga",
    "perawi_melayu": "Ahmad bin Abdullah, Abu Shihab, Al-A'mash, Ibrahim, 'Alqamah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ ، حَدَّثَنَا أَبُو شِهَابٍ ، عَنْ الْأَعْمَشِ ، عَنْ إِبْرَاهِيمَ ، قَال : قُلْتُ لِعَلْقَمَةَ  : مَا أَدْرِي مَا أَسْأَلُكَ عَنْهُ؟ قَالَ :\" أَمِتْ جِيرَانَكَ \"",
    "malay_translation": "Telah meriwayatkan kepada kami Ahmad bin Abdullah, telah meriwayatkan kepada kami Abu Shihab, daripada Al-A'mash, daripada Ibrahim, beliau berkata: Saya berkata kepada 'Alqamah: Saya tidak tahu apa yang perlu saya tanyakan kepada anda tentangnya? Beliau menjawab: \"Berbuat baiklah kepada jiran tetangga anda.\""
  },
  {
    "id": 39654,
    "hadith_number": 2117,
    "tajuk_hadith": "Anjuran Mempelajari Ilmu Faraidh, Talak, dan Haji",
    "perawi_melayu": "Abu Nu'aim, Muhammad bin Talhah, al-Qasim bin al-Walid al-Hamdani, dan Abdullah bin Mas'ud",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا مُحَمَّدُ بْنُ طَلْحَةَ  ، عَنْ الْقَاسِمِ بْنِ الْوَلِيدِ الْهَمْدَانِيِّ  ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ  ، قَالَ :\" تَعَلَّمُوا الْفَرَائِضَ، وَالطَّلاقَ، وَالْحَجَّ، فَإِنَّهُ مِنْ دِينِكُمْ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Muhammad bin Talhah, daripada al-Qasim bin al-Walid al-Hamdani, daripada Abdullah bin Mas'ud, beliau berkata: \"Pelajarilah ilmu faraidh (hukum waris), talak (perceraian), dan haji, kerana sesungguhnya ia adalah daripada agama kamu.\""
  },
  {
    "id": 39655,
    "hadith_number": 2118,
    "tajuk_hadith": "Galakan dalam Mengajarkan Al-Quran, Ilmu Faraidh, dan Manasik",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، عَنْ كَثِيرٍ  ، عَنْ الْحَسَنِ  ، قَالَ :\" كَانُوا يُرَغِّبُونَ فِي تَعْلِيمِ الْقُرْآنِ وَالْفَرَائِضِ وَالْمَنَاسِكِ \"",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Hammad bin Zaid, dari Kathir, dari al-Hasan, dia berkata: \"Mereka (para sahabat) sangat menggalakkan pengajaran Al-Quran, ilmu faraidh (hukum waris), dan manasik (ibadah haji dan umrah).\""
  },
  {
    "id": 39656,
    "hadith_number": 2119,
    "tajuk_hadith": "Keutamaan Mempelajari Ilmu Faraidh bagi Pembaca Al-Quran",
    "perawi_melayu": "Muhammad bin Yusuf, Sufyan, Abu Ishaq, Abu Ubaidah, Abdullah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ أَبِي عُبَيْدَةَ  ، عَنْ عَبْدِ اللَّهِ  ، قَالَ :\" مَنْ قَرَأَ الْقُرْآنَ، فَلْيَتَعَلَّمْ الْفَرَائِضَ، فَإِنْ لَقِيَهُ أَعْرَابِيٌّ، قَالَ : يَا مُهَاجِرُ، أَتَقْرَأُ الْقُرْآنَ؟ فَإِنْ قَالَ : نَعَمْ، قَالَ : تَفْرِضُ؟ فَإِنْ قَالَ : نَعَمْ، فَهُوَ زِيَادَةٌ وَخَيْر، وَإِنْ قَالَ : لَا، قَالَ : فَمَا فَضْلُكَ عَلَيَّ يَا مُهَاجِرُ؟ !",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Yusuf, dari Sufyan, dari Abu Ishaq, dari Abu Ubaidah, dari Abdullah, dia berkata: \"Barangsiapa membaca Al-Quran, maka hendaklah dia mempelajari ilmu faraidh (ilmu waris). Jika dia bertemu dengan seorang Arab Badui, lalu orang Badui itu berkata: \"Wahai Muhajir, apakah kamu membaca Al-Quran?\" Jika dia menjawab: \"Ya.\" Orang Badui itu bertanya: \"Apakah kamu mengetahui ilmu faraidh?\" Jika dia menjawab: \"Ya.\" Maka itu adalah tambahan dan kebaikan. Jika dia menjawab: \"Tidak.\" Orang Badui itu berkata: \"Maka apa kelebihanmu dariku wahai Muhajir?!\""
  },
  {
    "id": 39657,
    "hadith_number": 2120,
    "tajuk_hadith": "Kecekapan Aisyah dalam Ilmu Faraidh",
    "perawi_melayu": "Abdullah bin Sa'id, Uqbah bin Khalid, al-A'mash, Muslim, Masruq",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ  ، حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ  ، عَنْ الْأَعْمَشِ  ، عَنْ مُسْلِمٍ  ، قَالَ : سَأَلْنَا مَسْرُوقًا  : كَانَتْ عَائِشَةُ   تُحْسِنُ الْفَرَائِضَ؟ قَالَ :\" وَالَّذِي لَا إِلَهَ غَيْرُهُ، لَقَدْ رَأَيْتُ الْأَكَابِرَ مِنْ أَصْحَابِ مُحَمَّدٍ يَسْأَلُونَهَا عَنْ الْفَرَائِضِ \"",
    "malay_translation": "Abdullah bin Sa'id meriwayatkan kepada kami, Uqbah bin Khalid meriwayatkan kepada kami, daripada al-A'mash, daripada Muslim, dia berkata: Kami bertanya kepada Masruq: Adakah Aisyah mahir dalam ilmu faraidh? Dia berkata: \"Demi Dia yang tiada tuhan selain-Nya, sesungguhnya aku telah melihat para sahabat Muhammad yang terkemuka bertanya kepadanya tentang faraidh.\""
  },
  {
    "id": 39658,
    "hadith_number": 2121,
    "tajuk_hadith": "Larangan Mengaku Bapa Selain Bapa Sendiri",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ  ، عَنْ شُعْبَةَ  ، عَنْ عَاصِمٍ  ، عَنْ أَبِي عُثْمَانَ  ،  عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ  ، وَعَنْ أَبِي بَكْرَةَ   قَالَ شُعْبَةُ : هَذَا أَوَّلُ مَنْ رَمَى بِسَهْمٍ فِي سَبِيلِ اللَّهِ، وَهَذَا تَدَلَّى مِنْ حِصْنِ الطَّائِفِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم إِنَّهُمَا حَدَّثَا : أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" مَنْ ادَّعَى إِلَى غَيْرِ أَبِيهِ وَهُوَ يَعْلَمُ أَنَّهُ غَيْرُ أَبِيهِ، فَالْجَنَّةُ عَلَيْهِ حَرَامٌ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Sa'id bin Amir, daripada Syu'bah, daripada Asim, daripada Abi Uthman, daripada Sa'ad bin Abi Waqqas, dan daripada Abi Bakrah, Syu'bah berkata: Ini adalah orang pertama yang memanah dengan anak panah di jalan Allah, dan ini turun dari benteng Ta'if kepada Rasulullah SAW. Sesungguhnya mereka berdua telah menceritakan: Sesungguhnya Rasulullah SAW bersabda: \"Sesiapa yang mengaku (bernasab) kepada selain bapanya dan dia tahu bahawa dia bukan bapanya, maka syurga haram baginya.\""
  },
  {
    "id": 39659,
    "hadith_number": 2122,
    "tajuk_hadith": "Larangan Mengaku Keturunan yang Tidak Dikenali dan Mengingkari Keturunan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ الْأَعْمَشِ  ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ  ، عَنْ أَبِي مَعْمَرٍ  ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ  ، قَالَ :\" كُفْرٌ بِاللَّهِ ادِّعَاءٌ إِلَى نَسَبٍ لَا يُعْرَفُ، وَكُفْرٌ بِاللَّهِ تَبَرُّؤٌ مِنْ نَسَبٍ وَإِنْ دَقَّ.\n حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ زَكَرِيَّا أَبِي يَحْيَى  ، قَالَ : سَمِعْتُ أَبَا وَائِلٍ  يُحَدِّثُ، عَنْ ابْنِ مَسْعُودٍ  ، نَحْوًا مِنْهُ",
    "malay_translation": "Muhammad bin Yusuf meriwayatkan kepada kami, Sufyan meriwayatkan kepada kami, daripada al-A'mash, daripada Abdullah bin Murrah, daripada Abu Ma'mar, daripada Abu Bakar as-Siddiq, beliau berkata: 'Kufur kepada Allah adalah mendakwa keturunan yang tidak dikenali, dan kufur kepada Allah adalah berlepas diri dari keturunan walaupun kecil.' Muhammad bin Yusuf meriwayatkan kepada kami, Sufyan meriwayatkan kepada kami, daripada Zakaria Abu Yahya, beliau berkata: Aku mendengar Abu Wa'il meriwayatkan, daripada Ibn Mas'ud, yang serupa dengannya."
  },
  {
    "id": 39660,
    "hadith_number": 2123,
    "tajuk_hadith": "Kufur Mengingkari Nasab dan Mendakwa Nasab yang Tidak Diketahui",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ  ، حَدَّثَنَا إِسْحَاق بْنُ مَنْصُورٍ السَّلُولِيُّ  ، عَنْ جَعْفَرٍ الْأَحْمَرِ  ، عَنْ السَّرِيِّ بْنِ إِسْمَاعِيل  ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ  ، قَالَ : أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأُبَايِعَهُ، فَجِئْتُ وَقَدْ قُبِض، وَأَبُو بَكْرٍ   قَائِمٌ فِي مَقَامِهِ، فَأَطَالَ الثَّنَاءَ وَأَكْثَرَ الْبُكَاءَ، فَقَالَ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" كُفْرٌ بِاللَّهِ انْتِفَاءٌ مِنْ نَسَبٍ وَإِنْ دَقَّ، وَادِّعَاءُ نَسَبٍ لَا يُعْرَفُ \"",
    "malay_translation": "Muhammad bin al-'Ala' meriwayatkan kepada kami, Ishaq bin Mansur as-Saluli meriwayatkan kepada kami, daripada Ja'far al-Ahmar, daripada as-Surri bin Ismail, daripada Qais bin Abi Hazim, dia berkata: 'Aku datang kepada Nabi ﷺ untuk membai'at baginda, lalu aku datang dan baginda telah wafat, dan Abu Bakr berdiri di tempat baginda. Maka beliau memanjangkan pujian dan banyak menangis, lalu berkata: 'Aku mendengar Rasulullah ﷺ bersabda: 'Kufur kepada Allah adalah menafikan nasab walaupun ia kecil, dan mendakwa nasab yang tidak diketahui.'"
  },
  {
    "id": 39661,
    "hadith_number": 2124,
    "tajuk_hadith": "Larangan Mengaku Nasab Kepada Selain Ayah dan Berloyal Kepada Selain Tuan yang Memerdekakan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ بَهْرَامَ  ، عَنْ شَهْرِ بْنِ حَوْشَبٍ  ،  عَنْ ابْنِ عَبَّاسٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" أَيُّمَا رَجُلٍ ادَّعَى إِلَى غَيْرِ وَالِدِه، أَوْ تَوَلَّى غَيْرَ مَوَالِيهِ الَّذِينَ أَعْتَقُوهُ، فَإِنَّ عَلَيْهِ لَعْنَةَ اللَّه، وَالْمَلائِكَةِ، وَالنَّاسِ أَجْمَعِينَ إِلَى يَوْمِ الْقِيَامَة، لا يُقْبَلُ مِنْهُ صَرْفٌ وَلَا عَدْلٌ",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Yusuf, telah menceritakan kepada kami Abdul Hamid bin Bahram, daripada Syahr bin Hausyab, daripada Ibnu Abbas RA, beliau berkata: Rasulullah SAW bersabda: \"Sesiapa lelaki yang mengaku (nasab) kepada selain ayahnya, atau berloyal kepada selain tuan-tuannya yang telah memerdekakannya, maka sesungguhnya ke atasnya laknat Allah, para malaikat, dan seluruh manusia hingga hari kiamat. Tidak diterima daripadanya amalan sunnah mahupun amalan wajib.\""
  },
  {
    "id": 39662,
    "hadith_number": 2125,
    "tajuk_hadith": "Kemudahan Jalan yang Dibawa Umar dan Hukum Warisan untuk Suami dan Ibu Bapa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَنْبَأَنَا شَرِيكٌ  ، عَنْ الْأَعْمَشِ  ، عَنْ إِبْرَاهِيمَ  ، قَالَ : قَالَ عَبْدُ اللَّهِ  : كَانَ عُمَرُ   إِذَا سَلَكَ بِنَا طَرِيقًا وَجَدْنَاهُ سَهْلًا، وَإِنَّهُ قَالَ فِي زَوْجٍ وَأَبَوَيْنِ :\" لِلزَّوْجِ النِّصْفُ، وَلِلْأُمِّ ثُلُثُ مَا بَقِيَ",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah memberitakan kepada kami Syarik, daripada al-A'masy, daripada Ibrahim, dia berkata: Abdullah berkata: Adalah Umar, apabila dia membawa kami melalui jalan, kami mendapatinya mudah, dan sesungguhnya dia berkata tentang suami dan ibu bapa: \"Bagi suami separuh, dan bagi ibu satu pertiga daripada baki.\""
  },
  {
    "id": 39663,
    "hadith_number": 2126,
    "tajuk_hadith": "Pembahagian Pusaka bagi Isteri dan Ibu Bapa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، حَدَّثَنَا هَمَّامٌ  ، حَدَّثَنَا يَزِيدُ الرِّشْكُ  ، قَالَ : سَأَلْتُ سَعِيدَ بْنَ الْمُسَيِّبِ   عَنْ رَجُلٍ تَرَكَ امْرَأَتَهُ، وَأَبَوَيْهِ، فَقَالَ :\" قَسَّمَهَا زَيْدُ بْنُ ثَابِتٍ   مِنْ أَرْبَعَةٍ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah menceritakan kepada kami Hammam, telah menceritakan kepada kami Yazid ar-Risyk, dia berkata: \"Aku bertanya kepada Sa'id bin al-Musayyib tentang seorang lelaki yang meninggalkan isterinya dan kedua ibu bapanya.\" Lalu beliau berkata: \"Zaid bin Thabit telah membahagikannya daripada empat bahagian.\""
  },
  {
    "id": 39664,
    "hadith_number": 2127,
    "tajuk_hadith": "Pembahagian Warisan untuk Wanita dan Ibu Bapa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ  ، عَنْ شُعْبَةَ  ، عَنْ أَيُّوبَ  ، عَنْ أَبِي قِلَابَةَ  ، عَنْ أَبِي الْمُهَلَّبِ  : أَنَّ عُثْمَانَ بْنَ عَفَّانَ   قَالَ فِي امْرَأَةٍ وَأَبَوَيْنِ :\" لِلْمَرْأَةِ الرُّبُعُ، وَلِلْأُمِّ ثُلُثُ مَا بَقِيَ \"",
    "malay_translation": "Telah meriwayatkan kepada kami Sa'id bin Amir, daripada Syu'bah, daripada Ayyub, daripada Abu Qilabah, daripada Abu Muhallab: bahawa Uthman bin Affan berkata mengenai seorang wanita dan dua ibu bapa: \"Untuk wanita itu seperempat (1/4), dan untuk ibu itu sepertiga (1/3) daripada baki harta.\""
  },
  {
    "id": 39665,
    "hadith_number": 2128,
    "tajuk_hadith": "Pembahagian Harta Pusaka: Bahagian untuk Wanita, Ibu dan Bapa Menurut Uthman RA",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ أَيُّوبَ  ، عَنْ أَبِي قِلَابَةَ  ، عَنْ أَبِي الْمُهَلَّبِ  ، عَنْ عُثْمَانَ بْنِ عَفَّانَ   أَنَّهُ قَالَ :\" لِلْمَرْأَةِ الرُّبُعُ سَهْمٌ مِنْ أَرْبَعَةٍ، وَلِلْأُمِّ ثُلُثُ مَا بَقِيَ سَهْم، وَلِلأَبِّ سَهْمَانِ \".\nأَخْبَرَنَا حَجَّاجٌ  ، حَدَّثَنَا حَمَّادٌ  ، عَنْ حَجَّاجٍ  ، عَنْ عُمَيْرِ بْنِ سَعِيدٍ  : أَنَّهُ سَأَلَ الْحَارِثَ الْأَعْوَرَ   عَنْ امْرَأَةٍ، وَأَبَوَيْنِ، فَقَالَ مِثْلَ قَوْلِ عُثْمَانَ",
    "malay_translation": "Telah menceritakan kepada kami Hajjaj bin Minhal, telah menceritakan kepada kami Hammad bin Salamah, dari Ayyub, dari Abi Qilabah, dari Abi Muhallab, dari Uthman bin Affan RA, bahawa beliau berkata: \"Untuk wanita adalah satu perempat bahagian daripada empat, dan untuk ibu adalah satu pertiga daripada baki bahagian, dan untuk bapa adalah dua bahagian.\" Telah mengkhabarkan kepada kami Hajjaj, telah menceritakan kepada kami Hammad, dari Hajjaj, dari Umair bin Sa'id: bahawa beliau bertanya kepada al-Harith al-A'war tentang seorang wanita, dan kedua ibu bapa, lalu beliau berkata seperti perkataan Uthman."
  },
  {
    "id": 39666,
    "hadith_number": 2129,
    "tajuk_hadith": "Hukum Pusaka Wanita: Suami dan Ibu Bapa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا هِشَامٌ  ، عَنْ قَتَادَةَ  ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ  ، عَنْ زَيْدِ بْنِ ثَابِتٍ  ، أَنَّهُ قَالَ فِي امْرَأَةٍ تَرَكَتْ زَوْجَهَا وَأَبَوَيْهَا :\" لِلزَّوْجِ النِّصْفُ، وَلِلْأُمِّ ثُلُثُ مَا بَقِيَ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Hisyam, daripada Qatadah, daripada Sa'id bin al-Musayyib, daripada Zaid bin Thabit, bahawasanya beliau berkata mengenai seorang wanita yang meninggalkan suami dan kedua ibu bapanya: \"Bagi suami separuh (bahagian), dan bagi ibu satu pertiga daripada baki (harta).\""
  },
  {
    "id": 39667,
    "hadith_number": 2130,
    "tajuk_hadith": "Pembahagian Harta Pusaka untuk Wanita dan Ibu Bapa",
    "perawi_melayu": "Ubaidullah bin Musa, daripada Ibn Abi Laila, daripada Amir al-Sha'bi, daripada Ali RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، عَنْ ابْنِ أَبِي لَيْلَى  ، عَنْ عَامِرٍ الشَّعْبِيِّ  ، عَنْ عَلِيٍّ   : فِي امْرَأَةٍ وَأَبَوَيْنِ، قَالَ :\" مِنْ أَرْبَعَةٍ : لِلْمَرْأَةِ الرُّبُعُ، وَلِلْأُمِّ ثُلُثُ مَا بَقِي، وَمَا بَقِيَ فَلِلْأَبِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ubaidullah bin Musa, daripada Ibn Abi Laila, daripada Amir al-Sha'bi, daripada Ali RA: mengenai seorang wanita (isteri) dan kedua ibu bapa (si mati). Beliau (Ali RA) berkata: \"Pembahagiannya adalah dari empat bahagian: satu perempat untuk wanita (isteri), satu pertiga dari baki harta pusaka untuk ibu, dan selebihnya untuk bapa.\""
  },
  {
    "id": 39668,
    "hadith_number": 2131,
    "tajuk_hadith": "Cara Umar r.a. Membuat Keputusan dalam Pembahagian Harta Pusaka",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ الْأَعْمَشِ  ، وَمَنْصُورٍ  ، عَنْ إِبْرَاهِيمَ  ، عَنْ عَبْدِ اللَّهِ  ، قَالَ : كَانَ عُمَرُ   إِذَا سَلَكَ بِنَا طَرِيقًا اتَّبَعْنَاهُ فِيهِ، وَجَدْنَاهُ سَهْلًا، وَإِنَّهُ\" قَضَى فِي امْرَأَةٍ وَأَبَوَيْنِ مِنْ أَرْبَعَةٍ : فَأَعْطَى الْمَرْأَةَ الرُّبُع، وَالأُمَّ ثُلُثَ مَا بَقِيَ، وَالْأَبَ سَهْمَيْنِ.\n حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  عَنْ عِيسَى  ، عَنْ الشَّعْبِيِّ  ، عَنْ زَيْدِ بْنِ ثَابِتٍ   مِثْلَ ذَلِكَ",
    "malay_translation": "Muhammad bin Yusuf meriwayatkan kepada kami, daripada Sufyan, daripada al-A'mash dan Mansur, daripada Ibrahim, daripada Abdullah, yang berkata: 'Umar r.a. biasanya apabila membawa kami melalui suatu jalan, kami akan mengikutinya, dan kami mendapati jalan itu mudah. Dan sesungguhnya beliau telah memutuskan dalam kes seorang wanita dan dua ibu bapa daripada empat bahagian harta pusaka: lalu beliau memberikan wanita itu satu perempat, ibu satu pertiga daripada baki harta, dan bapa dua bahagian.' Muhammad bin Yusuf meriwayatkan kepada kami, Sufyan meriwayatkan kepada kami, daripada Isa, daripada al-Sha'bi, daripada Zaid bin Thabit r.a. perkara yang sama."
  },
  {
    "id": 39669,
    "hadith_number": 2132,
    "tajuk_hadith": "Tidak Mengutamakan Ibu Berbanding Bapa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدٌ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ أَبِيهِ  ، عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ  ، عَنْ عَبْدِ اللَّهِ  ، قَالَ : كَانَ يَقُولُ :\" مَا كَانَ اللَّهُ لِيَرَانِي أَنْ أُفَضِّلَ أُمًّا عَلَى أَبٍ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad, telah menceritakan kepada kami Sufyan, daripada bapanya, daripada al-Musayyab bin Rafi', daripada Abdullah, dia berkata: Beliau (Abdullah) pernah berkata: \"Allah tidak akan melihatku mengutamakan seorang ibu daripada seorang bapa.\""
  },
  {
    "id": 39670,
    "hadith_number": 2133,
    "tajuk_hadith": "Perbezaan Pendapat dalam Hukum Fiqh",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ  ، أَنْبَأَنَا شُعْبَةُ  ، عَنْ الْحَكَمِ  ، عَنْ عِكْرِمَةَ  ، قَالَ :\" أَرْسَلَ ابْنُ عَبَّاسٍ إِلَى زَيْدِ بْنِ ثَابِتٍ   : أَتَجِدُ فِي كِتَابِ اللَّهِ لِلْأُمِّ ثُلُثُ مَا بَقِي؟ فَقَالَ زَيْدٌ : إِنَّمَا أَنْتَ رَجُلٌ تَقُولُ بِرَأْيِكَ، وَأَنَا رَجُلٌ أَقُولُ بِرَأْيِي \"",
    "malay_translation": "Sa'id bin 'Amir telah memberitahu kami, Shu'bah telah memberitahu kami, daripada al-Hakam, daripada 'Ikrimah, dia berkata: \"Ibn 'Abbas telah menghantar (utusan) kepada Zaid bin Thabit: Adakah kamu mendapati dalam Kitab Allah untuk ibu satu pertiga daripada apa yang tinggal? Zaid berkata: Sesungguhnya kamu adalah seorang lelaki yang berkata dengan pendapat kamu, dan saya adalah seorang lelaki yang berkata dengan pendapat saya.\""
  },
  {
    "id": 39671,
    "hadith_number": 2134,
    "tajuk_hadith": "Pembahagian Harta Pusaka untuk Suami dan Ibu Bapa",
    "perawi_melayu": "Hajjaj bin Minhal, Hammad bin Salamah, Hajjaj, al-Sha'bi, Hajjaj, 'Ata', Ibn 'Abbas",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ حَجَّاجٍ  ، عَنْ الشَّعْبِيِّ  ، وَحَجَّاجٍ  ، عَنْ عَطَاءٍ  ، عَنْ ابْنِ عَبَّاسٍ   : أَنَّهُمَا قَالَا فِي زَوْجٍ وَأَبَوَيْنِ :\" لِلزَّوْجِ النِّصْفُ، وَلِلْأُمِّ ثُلُثُ جَمِيعِ الْمَالِ، وَمَا بَقِيَ فَلِلْأَبِ \"",
    "malay_translation": "Telah menceritakan kepada kami Hajjaj bin Minhal, telah menceritakan kepada kami Hammad bin Salamah, dari Hajjaj, dari al-Sha'bi, dan Hajjaj, dari 'Ata', dari Ibn 'Abbas, bahawa keduanya berkata mengenai (pembahagian harta pusaka bagi) suami dan ibu bapa: \"Untuk suami separuh (1/2), untuk ibu satu pertiga (1/3) dari seluruh harta, dan selebihnya untuk bapa.\""
  },
  {
    "id": 39672,
    "hadith_number": 2135,
    "tajuk_hadith": "Bahagian Ibu dalam Pusaka",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ  ، أَنْبَأَنَا أَبُو عَوَانَةَ  ، عَنْ الْأَعْمَشِ  ، عَنْ إِبْرَاهِيمَ  ، عَنْ عَلِيٍّ  ، قَالَ :\" لِلْأُمِّ ثُلُثُ جَمِيعِ الْمَالِ فِي امْرَأَةٍ وَأَبَوَيْنِ، وَفِي زَوْجٍ وَأَبَوَيْنِ \"",
    "malay_translation": "Haddathana Hajjaj bin Minhal, memberitakan kepada kami Abu Awanah, dari Al-A'mash, dari Ibrahim, dari Ali, dia berkata: 'Bagi ibu adalah satu pertiga dari seluruh harta dalam kes wanita dan ibu bapa, dan dalam kes suami dan ibu bapa.'"
  },
  {
    "id": 39673,
    "hadith_number": 2136,
    "tajuk_hadith": "Pendapat Ibn Abbas Mengenai Warisan Ibu dalam Kes Isteri dan Ibu Bapa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى  ، حَدَّثَنَا ابْنُ إِدْرِيسَ  ، عَنْ أَبِيهِ  ، عَنْ الْفُضَيْلِ بْنِ عَمْرٍو  ، عَنْ إِبْرَاهِيمَ  ، قَالَ : خَالَفَ ابْنُ عَبَّاسٍ   أَهْلَ الْقِبْلَةِ فِي امْرَأَةٍ وَأَبَوَيْنِ :\" جَعَلَ لِلْأُمِّ الثُّلُثَ مِنْ جَمِيعِ الْمَالِ \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Isa, telah menceritakan kepada kami Ibn Idris, daripada bapanya, daripada al-Fudail bin 'Amr, daripada Ibrahim, dia berkata: Ibn Abbas telah menyanggah ahli kiblat dalam (hukum waris) seorang isteri dan ibu bapa: \"Beliau menetapkan bagi ibu satu pertiga daripada keseluruhan harta.\""
  },
  {
    "id": 39674,
    "hadith_number": 2137,
    "tajuk_hadith": "Keputusan Mu'adh bin Jabal tentang Pembahagian Pusaka untuk Anak Perempuan dan Saudara Perempuan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ الثَّوْرِيِّ  ، عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ  ، عَنْ الْأَسْوَدِ بْنِ يَزِيدَ  ، قَالَ : \" قَضَى مُعَاذُ بْنُ جَبَلٍ   بِالْيَمَنِ فِي بِنْتٍ وَأُخْتٍ،فَأَعْطَى الْبِنْتَ النِّصْفَ، وَالْأُخْتَ النِّصْفَ \"",
    "malay_translation": "Dikhabarkan kepada kami oleh Muhammad bin Yusuf, daripada Sufyan ath-Thawri, daripada Asy'ath bin Abi ash-Sya'tsa', daripada al-Aswad bin Yazid, katanya: \"Mu'adh bin Jabal telah memutuskan di Yaman mengenai seorang anak perempuan dan saudara perempuan, lalu beliau memberikan anak perempuan itu separuh (harta pusaka), dan saudara perempuan itu separuh.\""
  },
  {
    "id": 39675,
    "hadith_number": 2138,
    "tajuk_hadith": "Hukum Warisan Saudara Perempuan Seibu Sebapa Bersama Anak Perempuan dan Ketetapan Mu'adh bin Jabal",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ الْأَعْمَشِ  ، عَنْ إِبْرَاهِيمَ  ، عَنْ الْأَسْوَدِ بْنِ يَزِيدَ  : أَنَّ ابْنَ الزُّبَيْرِ كَانَ لَا يُوَرِّثُ الْأُخْتَ مِنْ الْأَبِ، وَالْأُمِّ مَعَ الْبِنْتِ حَتَّى حَدَّثَهُ الْأَسْوَدُ أَنَّ مُعَاذَ بْنَ جَبَلٍ  جَعَلَ لِلْبِنْتِ النِّصْفَ، وَلِلْأُخْتِ النِّصْفَ \"، فَقَالَ : أَنْتَ رَسُولِي إِلَى عَبْدِ اللَّهِ بْنِ عُتْبَة، فَأَخْبِرْهُ بِذَاكَ، وَكَانَ قَاضِيَهُ بِالْكُوفَةِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Yusuf, telah menceritakan kepada kami Sufyan, daripada al-A'mash, daripada Ibrahim, daripada al-Aswad bin Yazid: Bahawa Ibn al-Zubair tidak mewariskan saudara perempuan seibu sebapa bersama anak perempuan sehingga al-Aswad menceritakan kepadanya bahawa Mu'adh bin Jabal menjadikan untuk anak perempuan separuh dan untuk saudara perempuan separuh. Lalu dia (Ibn al-Zubair) berkata: \"Engkau adalah utusanku kepada Abdullah bin Utbah, maka khabarkanlah kepadanya tentang itu,\" dan dia (Abdullah bin Utbah) adalah hakimnya di Kufah."
  },
  {
    "id": 39676,
    "hadith_number": 2139,
    "tajuk_hadith": "Pembahagian Harta Pusaka: Anak Perempuan dan Saudara Perempuan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا بِشْرُ بْنُ عُمَرَ  ، قَالَ : سَأَلْتُ ابْنَ أَبِي الزِّنَادِ  ، عَنْ رَجُلٍ تَرَكَ بِنْتًا وَأُخْتًا؟ فَقَالَ : \" لِابْنَتِهِ النِّصْف، وَلأُخْتِهِ مَا بَقِيَ \" قَالَ : وَقَالَ : أَخْبَرَنِي أَبِي  ، عَنْ خَارِجَةَ بْنِ زَيْدٍ  : أَنَّ زَيْدَ بْنَ ثَابِتٍ   كَانَ\" يَجْعَلُ الْأَخَوَاتِ مَعَ الْبَنَاتِ عَصَبَةً، لَا يَجْعَلُ لَهُنَّ إِلَّا مَا بَقِيَ \"",
    "malay_translation": "Bishr bin Umar menceritakan kepada kami, dia berkata: Saya bertanya kepada Ibn Abi Zinad tentang seorang lelaki yang meninggalkan seorang anak perempuan dan seorang saudara perempuan? Dia berkata: 'Untuk anak perempuannya adalah separuh, dan untuk saudara perempuannya apa yang tersisa.' Dia berkata: Dan dia berkata: Ayah saya memberitahu saya, dari Kharijah bin Zaid: bahawa Zaid bin Thabit biasanya 'menjadikan saudara perempuan bersama anak perempuan sebagai 'asabah (kerabat agnatik), dia tidak memberikan kepada mereka kecuali apa yang tersisa.'"
  },
  {
    "id": 39677,
    "hadith_number": 2140,
    "tajuk_hadith": "Pembahagian Harta Pusaka: Suami, Ibu dan Saudara",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ مَنْصُورٍ  ، وَالْأَعْمَشِ  ، عَنْ إِبْرَاهِيمَ   : فِي زَوْجٍ، وَأُمٍّ، وَإِخْوَةٍ لِأَبٍ وَأُم، وَإِخْوَةٍ لِأُمٍّ، قَالَ :كَانَ عُمَر  ، وَعَبْدُ اللَّه  ، ِوَزَيْدٌ   يُشَرِّكُونَ، وَقَالَ عُمَرُ : \" لَمْ يَزِدْهُمْ الْأَبُ إِلَّا قُرْبًا \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Yusuf, telah menceritakan kepada kami Sufyan, daripada Mansur, dan al-A'mash, daripada Ibrahim: mengenai seorang suami, seorang ibu, saudara lelaki dan perempuan seibu sebapa, dan saudara lelaki dan perempuan seibu. Dia berkata: 'Umar, Abdullah, dan Zaid biasanya menyertakan (saudara seibu dengan saudara kandung dalam harta pusaka). Dan Umar berkata: 'Bapa tidak menambahkan mereka kecuali kedekatan (dengan harta pusaka).'"
  },
  {
    "id": 39678,
    "hadith_number": 2141,
    "tajuk_hadith": "Ali RA Tidak Melakukan Syirik",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدٌ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ الْحَارِثِ  ،  عَنْ عَلِيٍّ   : أَنَّهُ كَانَ\" لَا يُشَرِّكُ \"",
    "malay_translation": "Muhammad telah meriwayatkan kepada kami, Sufyan telah meriwayatkan kepada kami, daripada Abu Ishaq, daripada al-Harith, daripada Ali RA: Sesungguhnya beliau adalah \"tidak melakukan syirik\"."
  },
  {
    "id": 39679,
    "hadith_number": 2142,
    "tajuk_hadith": "Perbezaan Pendapat Uthman dan Ali Tentang Penggabungan Bacaan dalam Solat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدٌ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ سُلَيْمَانَ التَّيْمِيِّ  ، عَنْ أَبِي مِجْلَزٍ   :أَنَّ عُثْمَانَ  كَانَ يُشَرِّك، وَعَلِيٌّ   كَانَ لا يُشَرِّكُ \"",
    "malay_translation": "Muhammad telah memberitahu kami, telah menceritakan kepada kami Sufyan, daripada Sulaiman al-Taimi, daripada Abu Mijlaz: Bahawa Uthman menggabungkan (bacaan dalam solat), manakala Ali tidak menggabungkan."
  },
  {
    "id": 39680,
    "hadith_number": 2143,
    "tajuk_hadith": "Riwayat Mengenai Perbuatan Zaid Berkongsi",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدٌ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ ابْنِ ذَكْوَانَ  : \" أَنَّ زَيْدًا   كَانَيُشَرِّكُ \"",
    "malay_translation": "Muhammad telah meriwayatkan kepada kami, Sufyan telah meriwayatkan kepada kami, daripada Ibn Zakwan: \"Bahawa Zaid pernah berkongsi.\""
  },
  {
    "id": 39681,
    "hadith_number": 2144,
    "tajuk_hadith": "Berkaitan Syirik",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدٌ ، حَدَّثَنَا سُفْيَانُ ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ ، عَنْ شُرَيْح  : \" أَنَّهُ كَانَيُشَرِّكُ",
    "malay_translation": "Telah menceritakan kepada kami Muhammad, telah menceritakan kepada kami Sufyan, daripada Abdul Malik bin Umair, daripada Syuraih: \"Sesungguhnya beliau pernah menyekutukan (Allah)."
  },
  {
    "id": 39682,
    "hadith_number": 2145,
    "tajuk_hadith": "Pendapat Umar tentang Musyarrakah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّلْتِ  ، حَدَّثَنَا أَبُو شِهَابٍ  ، عَنْ الْحَجَّاجِ  ، عَنْ عَبْدِ الْمَلِكِ بْنِ الْمُغِيرَةِ  ، عَنْ سَعِيدِ بْنِ فَيْرُوزَ  ، عَنْ أَبِيه  : أَنَّ عُمَرَ   قَالَ فِي الْمُشَرَّكَة :\" لَمْ يَزِدْهُمْ الْأَبُ إِلَّا قُرْبًا",
    "malay_translation": "Muhammad bin al-Salt telah meriwayatkan kepada kami, Abu Shihab telah meriwayatkan kepada kami, daripada al-Hajjaj, daripada Abd al-Malik bin al-Mughira, daripada Sa'id bin Fayruz, daripada bapanya: Bahawa Umar berkata mengenai *musyarrakah*: \"Bapa tidak menambahkan mereka kecuali lebih dekat.\""
  },
  {
    "id": 39683,
    "hadith_number": 2146,
    "tajuk_hadith": "Pandangan Abdullah dan Ali tentang Pusaka Saudara Seibu dan Sebapa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا زُهَيْرٌ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ الْحَارِثِ الْأَعْوَرِ  ، قَالَ : أُتِيَ عَبْدُ اللَّهِ  فِي فَرِيضَةِ بَنِي عَمٍّ، أَحَدُهُمْ أَخٌ لِأُمٍّ، فَقَالَ : الْمَالُ أَجْمَعُ لِأَخِيهِ لِأُمِّه، فَأَنْزَلَهُ بِحِسَابِ، أَوْ بِمَنْزِلَةِ الْأَخِ مِنْ الْأَبِ وَالْأُمِّ، فَلَمَّا قَدِمَ عَلِيٌّ  ، سَأَلْتُهُ عَنْهَا، وَأَخْبَرْتُهُ بِقَوْلِ عَبْدِ اللَّهِ، فَقَالَ : \" يَرْحَمُهُ اللَّهُ، إِنْ كَانَ لَفَقِيهًا، أَمَّا أَنَافَلَمْ أَكُنْ لِأَزِيدَهُ عَلَى مَا فَرَضَ اللَّهُ لَهُ : سَهْمٌ السُّدُسُ، ثُمَّ يُقَاسِمُهُمْ كَرَجُلٍ مِنْهُمْ \"",
    "malay_translation": "Abu Nu'aim telah memberitahu kami, Zuhair telah menceritakan kepada kami, daripada Abu Ishaq, daripada al-Harith al-A'war, dia berkata: Abdullah telah didatangi mengenai faraidh (harta pusaka) anak-anak saudara sebelah bapa, salah seorang daripada mereka adalah saudara lelaki seibu, lalu beliau berkata: Harta itu semuanya adalah untuk saudara lelakinya seibu, dan beliau menempatkannya mengikut perkiraan, atau kedudukan saudara lelaki dari bapa dan ibu. Ketika Ali datang, saya bertanya kepadanya tentang hal itu, dan saya memberitahunya tentang perkataan Abdullah, lalu beliau berkata: \"Semoga Allah merahmatinya, sesungguhnya dia adalah seorang yang faqih. Adapun aku, aku tidak akan menambah baginya lebih daripada apa yang telah difardukan oleh Allah untuknya: bahagian satu perenam, kemudian dia membahagikannya bersama mereka seperti seorang lelaki daripada kalangan mereka.\""
  },
  {
    "id": 39684,
    "hadith_number": 2147,
    "tajuk_hadith": "Pandangan Ali tentang Pembahagian Harta Pusaka",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ الْحَارِثِ  ، عَنْ عَلِي : أَنَّهُ أُتِيَ فِي ابْنَيْ عَمٍّ أَحَدُهُمَا أَخٌ لِأُمٍّ، فَقِيلَ لِعَلِيٍّ : إِنَّ ابْنَ مَسْعُودٍ كَانَ يُعْطِيهِ الْمَالَ كُلَّهُ، فَقَالَ عَلِيٌّ   رَضِيَ اللَّهُ عَنْهُ : إِنْ كَانَ لَفَقِيهًا، وَلَوْ كُنْتُ أَنَا\" أَعْطَيْتُهُ السُّدُسَ، وَمَا بَقِيَ كَانَ بَيْنَهُمْ \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Yusuf, telah menceritakan kepada kami Sufyan, dari Abu Ishaq, dari al-Harith, dari Ali: Bahawa beliau didatangi mengenai dua orang anak saudara sebelah bapa, salah seorang daripada mereka adalah saudara lelaki seibu. Lalu dikatakan kepada Ali: Sesungguhnya Ibn Mas'ud telah memberikannya keseluruhan harta. Maka Ali radhiyallahu 'anhu berkata: Sesungguhnya dia adalah seorang yang faqih (berilmu), dan jika aku, nescaya aku akan memberikannya satu perenam, dan selebihnya adalah antara mereka."
  },
  {
    "id": 39685,
    "hadith_number": 2148,
    "tajuk_hadith": "Pembagian Warisan untuk Anak Perempuan, Cucu Perempuan, dan Saudara Perempuan Menurut Sunnah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ  ، عَنْ أَبِي قَيْسٍ الْأَوْدِيِّ  ، عَنْ هُزَيْلِ بْنِ شُرَحْبِيلَ  ، قَالَ : جَاءَ رَجُلٌ إِلَى أَبِي مُوسَى الْأَشْعَرِيِّ، وَإِلَى سَلْمَانَ بْنِ رَبِيعَةَ فَسَأَلَهُمَا عَنْ بِنْتٍ، وَبِنْتِ ابْنٍ، وَأُخْتٍ لِأُمٍّ وَأَبٍ، فَقَالَا : لِلِابْنَةِ النِّصْفُ، وَمَا بَقِيَ فَلِلْأُخْتِ، وَأْتِ ابْنَ مَسْعُودٍ فَإِنَّهُ سَيُتَابِعُنَا، فَجَاءَ الرَّجُلُ إِلَى عَبْدِ اللَّهِ  ، فَسَأَلَهُ عَنْ ذَلِكَ، فَقَالَ : لَقَدْ ضَلَلْتُ إِذًا، وَمَا أَنَا مِنْ الْمُهْتَدِينَ، وَإِنِّي أَقْضِي بِمَا \" قَضَى بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :لِلِابْنَةِ النِّصْفُ، وَلِابْنَةِ الِابْنِ السُّدُسُ، وَمَا بَقِيَ فَلِلْأُخْتِ \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Yusuf, telah menceritakan kepada kami Sufyan al-Thawri, dari Abu Qais al-Awdi, dari Huzail bin Shurahbil, dia berkata: Seorang lelaki datang kepada Abu Musa al-Asy'ari, dan kepada Salman bin Rabi'ah, lalu bertanya kepada mereka berdua tentang (pembagian warisan untuk) anak perempuan, anak perempuan dari anak lelaki (cucu perempuan), dan saudara perempuan seibu dan sebapa. Maka mereka berdua berkata: \"Untuk anak perempuan adalah setengah (bagian), dan sisanya untuk saudara perempuan. Dan datangilah Ibn Mas'ud, kerana sesungguhnya dia akan mengikuti kami.\" Lalu lelaki itu datang kepada Abdullah, dan bertanya kepadanya tentang hal itu. Maka dia berkata: \"Jika demikian, sungguh aku telah sesat, dan aku bukanlah termasuk orang-orang yang mendapat petunjuk. Sesungguhnya aku memutuskan dengan apa yang telah diputuskan oleh Rasulullah ﷺ: \"Untuk anak perempuan adalah setengah, untuk anak perempuan dari anak lelaki (cucu perempuan) adalah seperenam, dan sisanya untuk saudara perempuan.\""
  },
  {
    "id": 39686,
    "hadith_number": 2149,
    "tajuk_hadith": "Pendapat Abdullah dan Zaid bin Thabit tentang Pembahagian Harta Pusaka Saudara Seibu Sebapa dan Sebapa",
    "perawi_melayu": "Ahmad bin Abdullah, Abu Syihab, al-A'masy, Muslim, Masruq, Abdullah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا أَبُو شِهَابٍ  ، عَنْ الْأَعْمَشِ  ، عَنْ مُسْلِمٍ  ، عَنْ مَسْرُوقٍ  ،  عَنْ عَبْدِ اللَّهِ   : أَنَّهُ كَانَ يَقُولُ فِي أَخَوَاتٍ لِأَبٍ وَأُمٍّ، وَإِخْوَةٍ وَأَخَوَاتٍ لِأَبٍ : قَالَ :\" لِلْأَخَوَاتِ لِلْأَبِ وَالْأُمِّ الثُّلُثَانِ، وَمَا بَقِيَ فَلِلذُّكُورِ دُونَ الْإِنَاثِ \"، فَقَدِمَ مَسْرُوقٌ الْمَدِينَةَ ، فَسَمِعَ قَوْلَ زَيْدٍ   فِيهَا فَأَعْجَبَهُ، فَقَالَ لَهُ بَعْضُ أَصْحَابِهِ : أَتَتْرُكُ قَوْلَ عَبْدِ اللَّهِ؟ قَالَ : إِنِّي أَتَيْتُ الْمَدِينَةَ فَوَجَدْتُ زَيْدَ بْنَ ثَابِتٍ مِنْ الرَّاسِخِينَ فِي الْعِلْمِ.\nقَالَ أَحْمَدُ : فَقُلْتُ لِأَبِي شِهَاب : وَكَيْفَ قَالَ زَيْدٌ فِيهَا؟ قَالَ : شَرَّكَ بَيْنَهُمْ",
    "malay_translation": "Telah mengkhabarkan kepada kami Ahmad bin Abdullah, telah menceritakan kepada kami Abu Syihab, daripada al-A'masy, daripada Muslim, daripada Masruq, daripada Abdullah: bahawa beliau berkata tentang saudara perempuan seibu sebapa, dan saudara lelaki dan perempuan sebapa: Beliau berkata: \"Untuk saudara perempuan seibu sebapa adalah dua pertiga, dan selebihnya adalah untuk lelaki, bukan perempuan.\" Kemudian Masruq datang ke Madinah, lalu mendengar pendapat Zaid tentang perkara itu, lalu beliau kagum. Maka berkata kepadanya sebahagian sahabatnya: Adakah kamu meninggalkan pendapat Abdullah? Beliau berkata: Sesungguhnya aku datang ke Madinah dan mendapati Zaid bin Thabit termasuk dalam kalangan orang yang mendalam ilmunya. Ahmad berkata: Aku berkata kepada Abu Syihab: Bagaimana pendapat Zaid tentang perkara itu? Beliau berkata: Dia menyertakan (membahagikan bersama) antara mereka."
  },
  {
    "id": 39687,
    "hadith_number": 2150,
    "tajuk_hadith": "Pembahagian Pusaka Zaman Jahiliyyah Menurut Zaid bin Thabit",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ الْمُغِيرَةِ  ، عَنْ عِيسَى بْنِ يُونُسَ  ، عَنْ إِسْمَاعِيل  ، قَالَ : ذَكَرْنَا عِنْدَ حَكِيمِ بْنِ جَابِر : أَنَّ ابْنَ مَسْعُودٍ  قَالَ فِي أَخَوَاتٍ لِأَبٍ وَأُمٍّ وَإِخْوَةٍ وَأَخَوَاتٍ لِأَبٍ : أَنَّهُ كَانَ يُعْطِي لِلْأَخَوَاتِ مِنْ الْأَبِ وَالْأُمِّ الثُّلُثَيْنِ، وَمَا بَقِيَ فَلِلذُّكُورِ دُونَ الْإِنَاثِ، فَقَالَ حَكِيمٌ  : قَالَ زَيْدُ بْنُ ثَابِتٍ   :\" هَذَا مِنْ عَمَلِ الْجَاهِلِيَّةِ أَنْ يَرِثَ الرِّجَالُ دُونَ النِّسَاءِ إِنَّ إِخْوَتَهُنَّ قَدْ رُدُّوا عَلَيْهِنَّ \"",
    "malay_translation": "Telah menceritakan kepada kami Sa'id bin Al-Mughirah, daripada 'Isa bin Yunus, daripada Ismail, dia berkata: Kami menyebut di sisi Hakim bin Jabir: bahawa Ibnu Mas'ud berkata mengenai saudara perempuan seibu sebapa dan saudara lelaki dan saudara perempuan sebapa: bahawa dia (Ibnu Mas'ud) memberikan kepada saudara perempuan seibu sebapa dua pertiga, dan apa yang selebihnya adalah untuk lelaki tanpa perempuan. Maka Hakim berkata: Zaid bin Thabit berkata: \"Ini adalah daripada amalan Jahiliyyah bahawa lelaki mewarisi tanpa perempuan, sesungguhnya saudara lelaki mereka telah dikembalikan kepada mereka.\""
  },
  {
    "id": 39688,
    "hadith_number": 2151,
    "tajuk_hadith": "Pembahagian Harta Pusaka oleh Aisyah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ مَعْبَدِ بْنِ خَالِدٍ  ، عَنْ مَسْرُوقٍ  ، عَنْ عَائِشَةَ   : \" أَنَّهَا كَانَتْتُشَرِّكُ بَيْنَ ابْنَتَيْنِ وَابْنَةِ ابْن، وَابْنِ ابْن : تُعْطِي الِابْنَتَيْنِ الثُّلُثَيْنِ، وَمَا بَقِيَ فَشَرِيكُهُمْ",
    "malay_translation": "Muhammad bin Yusuf meriwayatkan kepada kami, Sufyan meriwayatkan kepada kami, daripada Ma'bad bin Khalid, daripada Masruq, daripada Aisyah: \"Bahawa dia (Aisyah) menggabungkan antara dua anak perempuan dan anak perempuan dari anak lelaki, dan anak lelaki dari anak lelaki: dia memberikan dua pertiga kepada dua anak perempuan, dan apa yang tersisa adalah bahagian mereka.\""
  },
  {
    "id": 39689,
    "hadith_number": 2152,
    "tajuk_hadith": "Kedudukan Saudara Perempuan Seperti Anak Perempuan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "وَكَانَ عَبْدُ اللَّهِ   لَا يُشَرِّكُ، يُعْطِي الذُّكُورَ دُونَ الْإِنَاثِ، وَقَالَ :\" الْأَخَوَاتُ بِمَنْزِلَةِ الْبَنَاتِ \"",
    "malay_translation": "Abdullah tidak melakukan syirik, dia memberikan (harta) kepada anak lelaki dan tidak kepada anak perempuan, dan dia berkata: \"Saudara perempuan adalah seperti anak perempuan.\""
  },
  {
    "id": 39690,
    "hadith_number": 2153,
    "tajuk_hadith": "Pembahagian Pusaka untuk Anak Perempuan dan Cucu Perempuan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ أَبِي سَهْلٍ  ، عَنْ الشَّعْبِيِّ  : أَنَّ ابْنَ مَسْعُودٍ   كَانَ يَقُولُ فِي بِنْتٍ وَبَنَاتِ ابْنٍ، وَابْنِ ابْنٍ :\" إِنْ كَانَتِ الْمُقَاسَمَةُ بَيْنَهُمْ أَقَلَّ مِنْ السُّدُسِ، أَعْطَاهُمْ السُّدُسَ، وَإِنْ كَانَ أَكْثَرَ مِنَ السُّدُس، ِأَعْطَاهُمُ السُّدُسَ \"",
    "malay_translation": "Muhammad bin Yusuf telah memberitahu kami, Sufyan telah meriwayatkan kepada kami, daripada Abi Sahl, daripada al-Sha'bi: bahawa Ibn Mas'ud pernah berkata mengenai anak perempuan, anak perempuan kepada anak lelaki, dan anak lelaki kepada anak lelaki: \"Jika pembahagian di antara mereka kurang daripada satu perenam, dia memberikan mereka satu perenam, dan jika ia lebih daripada satu perenam, dia memberikan mereka satu perenam.\""
  },
  {
    "id": 39691,
    "hadith_number": 2154,
    "tajuk_hadith": "Pendapat Sahabat dan Penduduk Madinah tentang Warisan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدٌ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ الْأَعْمَشِ  ، عَنْ إِبْرَاهِيمَ  ، عَنْ مَسْرُوقٍ  : أَنَّهُ كَانَ يُشَرِّكُ فَقَالَ لَهُ عَلْقَمَةُ : هَلْ أَحَدٌ مِنْهُمْ أَثْبَتُ مِنْ عَبْدِ اللَّهِ؟ فَقَالَ : لَا، وَلَكِنِّي رَأَيْتُ زَيْدَ بْنَ ثَابِتٍ  ، وَأَهْلَ الْمَدِينَةِ\" يُشَرِّكُونَ فِي ابْنَتَيْنِ وَبِنْتِ ابْن، ٍوَابْنِ ابْن، وَأُخْتَيْنِ \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad, telah menceritakan kepada kami Sufyan, daripada al-A'mash, daripada Ibrahim, daripada Masruq: bahawa dia pernah berkongsi (dalam pendapat), lalu Alqamah berkata kepadanya: Adakah sesiapa di antara mereka yang lebih teguh (pendiriannya) daripada Abdullah? Dia berkata: Tidak, tetapi aku melihat Zaid bin Thabit, dan penduduk Madinah berkongsi (pendapat) dalam (hukum waris) dua anak perempuan dan anak perempuan anak lelaki, dan anak lelaki anak lelaki, dan dua saudara perempuan."
  },
  {
    "id": 39692,
    "hadith_number": 2155,
    "tajuk_hadith": "Pembahagian Pusaka: Kes Wanita dan Waris",
    "perawi_melayu": "Muhammad bin Yusuf, Sufyan, Hisham, Muhammad bin Sirin, daripada Syuraih",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ ، حَدَّثَنَا سُفْيَانُ ، عَنْ هِشَامٍ ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ ، عَنْ شُرَيْحٍ  : \" فِي امْرَأَةٍ تَرَكَتْ زَوْجَهَا، وَأُمَّهَا، وَأُخْتَهَا لِأَبِيهَا وَأُمِّهَا، وَأُخْتَهَا لِأَبِيهَا، وَإِخْوَتَهَا لِأُمِّهَا،جَعَلَهَا مِنْ سِتَّةٍ، ثُمَّ رَفَعَهَا فَبَلَغَتْ عَشْرَةً، لِلزَّوْجِ النِّصْفُ ثَلَاثَةُ أَسْهُمٍ، وَلِلْأُخْتِ مِنْ الْأَبِ وَالْأُمِّ النِّصْفُ ثَلَاثَةُ أَسْهُمٍ، وَلِلْأُمِّ السُّدُسُ سَهْمٌ، وَلِلْإِخْوَةِ مِنْ الْأُمِّ الثُّلُثُ سَهْمَانِ، وَلِلْأُخْتِ مِنْ الْأَبِ سَهْمٌ تَكْمِلَةُ الثُّلُثَيْنِ \"",
    "malay_translation": "Muhammad bin Yusuf telah meriwayatkan kepada kami, Sufyan telah meriwayatkan kepada kami, daripada Hisham, daripada Muhammad bin Sirin, daripada Syuraih: \" Mengenai seorang wanita yang meninggal dunia dan meninggalkan suami, ibu, saudara perempuan seibu sebapa, saudara perempuan sebapa, dan saudara-saudara lelaki seibu. Beliau (Syuraih) menjadikan harta pusaka itu daripada enam bahagian, kemudian meningkatkannya menjadi sepuluh bahagian. Untuk suami adalah separuh, iaitu tiga bahagian, untuk saudara perempuan seibu sebapa adalah separuh, iaitu tiga bahagian, untuk ibu adalah satu perenam, iaitu satu bahagian, untuk saudara-saudara lelaki seibu adalah satu pertiga, iaitu dua bahagian, dan untuk saudara perempuan sebapa adalah satu bahagian sebagai pelengkap dua pertiga. \""
  },
  {
    "id": 39693,
    "hadith_number": 2156,
    "tajuk_hadith": "Ali dan Zaid Tidak Menghalang Warisan daripada Kafir dan Hamba",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ  ، عَنْ عَلِيِّ بْنِ مُسْهِرٍ  ، عَنْ أَشْعَثَ  ، عَنْ الشَّعْبِيِّ  : أَنَّ عَلِيًّا  ، وَزَيْدًا   كَانَا\" لَا يَحْجُبَانِ بِالْكُفَّار، وَلا بِالْمَمْلُوكِينَ، وَلَا يُوَرِّثَانِهِمْ شَيْئًا \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Uyainah, daripada Ali bin Mushir, daripada Asy'ath, daripada Asy-Sya'bi: Bahawa Ali dan Zaid tidak menghijab (menghalang warisan) daripada orang-orang kafir dan juga hamba-hamba, dan mereka tidak mewariskan sesuatu pun kepada mereka."
  },
  {
    "id": 39694,
    "hadith_number": 2157,
    "tajuk_hadith": "Larangan Waris untuk Kafir dan Hamba",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "وَكَانَ عَبْدُ اللَّهِ  \" يَحْجُبُ بِالْكُفَّارِ وَبِالْمَمْلُوكِينَ، وَلَا يُوَرِّثُهُمْ \"",
    "malay_translation": "Abdullah menghalang orang kafir dan hamba abdi daripada mewarisi harta pusaka, dan beliau tidak mewariskan kepada mereka."
  },
  {
    "id": 39695,
    "hadith_number": 2158,
    "tajuk_hadith": "Status Hamba dan Ahli Kitab dalam Pewarisan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ الْحَكَمِ  ، عَنْ إِبْرَاهِيمَ  : أَنَّ عَلِيًّا  ، وَزَيْدًا  ، قَالَا :\" الْمَمْلُوكُونَ، وَأَهْلُ الْكِتَابِ لا يَحْجُبُونَ وَلا يَرِثُونَ",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Syu'bah, daripada al-Hakam, daripada Ibrahim: bahawa Ali dan Zaid berkata: \"Hamba-hamba dan Ahli Kitab tidak dihalang dan tidak mewarisi.\""
  },
  {
    "id": 39696,
    "hadith_number": 2159,
    "tajuk_hadith": "Halangan Warisan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "وَقَالَ عَبْدُ اللَّهِ   :\" يَحْجُبُونَ وَلَا يَرِثُونَ \"",
    "malay_translation": "Dan Abdullah berkata: \"Mereka menghalang dan tidak mewarisi.\""
  },
  {
    "id": 39697,
    "hadith_number": 2160,
    "tajuk_hadith": "Warisan Datuk: Tindakan Umar Selepas Ditikam",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا يَحْيَى  ، عَنْ سَعِيدٍ  : أَنَّ عُمَرَ   \" كَانَكَتَبَ مِيرَاثَ الْجَدِّ، حَتَّى إِذَا طُعِنَ دَعَا بِهِ فَمَحَاهُ، ثُمّ قَالَ : سَتَرَوْنَ رَأْيَكُمْ فِيهِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah mengkhabarkan kepada kami Yahya, daripada Sa'id: Bahawa Umar telah menulis tentang warisan datuk, sehingga apabila beliau ditikam, beliau meminta ia dibawa lalu memadamkannya. Kemudian beliau berkata: Kamu akan melihat pendapat kamu mengenainya."
  },
  {
    "id": 39698,
    "hadith_number": 2161,
    "tajuk_hadith": "Pengetahuan Ubaidah tentang Pelbagai Kes Berkaitan Datuk",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ ، أنبأنا أَشْعَثُ ، عَنْ ابْنِ سِيرِينَ ، قَالَ : قُلْتُ لِعَبِيدَةَ  : حَدِّثْنِي عَنِ الْجَدِّ، فَقَالَ :\" إِنِّي لَأَحْفَظُ فِي الْجَدِّ ثَمَانِينَ قَضِيَّةً مُخْتَلِفَةً \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid, telah memberitakan kepada kami Asy'ath, daripada Ibn Sirin, dia berkata: Aku berkata kepada Ubaidah: \"Ceritakan kepadaku tentang datuk,\" maka dia berkata: \"Sesungguhnya aku benar-benar hafal tentang datuk lapan puluh kes yang berbeza.\""
  },
  {
    "id": 39699,
    "hadith_number": 2162,
    "tajuk_hadith": "Hukum Waris Tanpa Datuk",
    "perawi_melayu": "Abu Ghassan",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو غَسَّانَ  ، حَدَّثَنَا إِسْرَائِيلُ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ عُبَيْدِ بْنِ عَمْرٍو  ، عَنْ عَلِيٍّ  ، قَالَ : أَتَاهُ رَجُلٌ فَسَأَلَهُ عَنْ فَرِيضَة، فَقَالَ :\" إِنْ لَمْ يَكُنْ فِيهَا جَدٌّ، فَهَاتِهَا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Ghassan, telah menceritakan kepada kami Israil, daripada Abu Ishaq, daripada Ubaid bin Amru, daripada Ali, beliau berkata: Seorang lelaki telah datang kepadanya dan bertanya tentang faraidh (hukum waris), lalu beliau berkata: \"Jika tidak ada datuk (datuk sebelah bapa) di dalamnya, maka bawalah ia (permasalahan tersebut).\""
  },
  {
    "id": 39700,
    "hadith_number": 2163,
    "tajuk_hadith": "Arahan Ali tentang Faraidh Tanpa Datuk",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ عُبَيْدِ بْنِ عَمْرٍو  قَالَ : جَاءَ رَجُلٌ إِلَى عَلِيٍّ   فَسَأَلَهُ عَنْ فَرِيضَةٍ، فَقَالَ :\" إِنْ لَمْ يَكُنْ فِيهَا جَدٌّ، فَهَاتِهَا \"",
    "malay_translation": "Muhammad bin Yusuf telah menceritakan kepada kami, Sufyan telah menceritakan kepada kami, daripada Abi Ishaq, daripada Ubaid bin Amru berkata: Seorang lelaki datang kepada Ali dan bertanya kepadanya mengenai faraidh (hukum waris). Ali berkata: \"Jika tidak ada datuk (kakek) dalam permasalahan itu, maka kemukakanlah ia.\""
  },
  {
    "id": 39701,
    "hadith_number": 2164,
    "tajuk_hadith": "Akibat Buruk Penghakiman Warisan yang Tidak Adil",
    "perawi_melayu": "Diriwayatkan oleh Muhammad bin Yusuf, Sufyan, daripada Ayyub as-Sakhtiyani, daripada Sa'id bin Jubair, daripada seorang lelaki dari Murad, yang mendengar Ali berkata.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ  ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ  ، عَنْ رَجُلٍ  مِنْ مُرَادٍ ، ٍسَمِعَ عَلِيًّا  ، يَقُولُ :\" مَنْ سَرَّهُ أَنْ يَتَقَحَّمَ جَرَاثِيمَ جَهَنَّمَ، فَلْيَقْضِ بَيْنَ الْجَدِّ وَالْإِخْوَةِ",
    "malay_translation": "Muhammad bin Yusuf telah menceritakan kepada kami, Sufyan telah menceritakan kepada kami, daripada Ayyub as-Sakhtiyani, daripada Sa'id bin Jubair, daripada seorang lelaki dari Murad, yang mendengar Ali berkata: \"Sesiapa yang suka untuk mencampakkan dirinya ke dalam api neraka, maka hendaklah dia membuat keputusan hukum di antara datuk dan saudara-saudara lelaki (dalam hal warisan).\""
  },
  {
    "id": 39702,
    "hadith_number": 2165,
    "tajuk_hadith": "Abu Bakr As-Siddiq Menjadikan Datuk Sebagai Bapa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا وُهَيْبٌ  ، حَدَّثَنَا خَالِدٌ  ، عَنْ أَبِي نَضْرَةَ  ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ  .\nح وَعَنْ عِكْرِمَةَ  : أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ  \" جَعَلَ الْجَدَّ أَبًا \".\nحَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ سُلَيْمَانَ الشَّيْبَانِيِّ  ، عَنْ كُرْدُوسٍ  ، عَن أبِى بُرْدَةَ  ، عَنْ أَبِي مُوسَى  : أنَّ أَبَا بَكْرٍ الصِّدِّيقِ   جَعَلَ الْجَدَّ أَبًا",
    "malay_translation": "Telah mengkhabarkan kepada kami Muslim bin Ibrahim, telah menceritakan kepada kami Wuhaib, telah menceritakan kepada kami Khalid, daripada Abu Nadrah, daripada Abu Sa'id al-Khudri. Dan daripada Ikrimah: bahawa Abu Bakr as-Siddiq \"menjadikan datuk sebagai bapa.\" Telah menceritakan kepada kami Muhammad bin Yusuf, telah menceritakan kepada kami Sufyan, daripada Sulaiman as-Shaybani, daripada Kurdus, daripada Abi Burdah, daripada Abu Musa: bahawa Abu Bakr as-Siddiq \"menjadikan datuk sebagai bapa.\""
  },
  {
    "id": 39703,
    "hadith_number": 2166,
    "tajuk_hadith": "Abu Bakar Menganggap Datuk Sebagai Bapa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا أَبُو شِهَابٍ  ، عَنْ الشَّيْبَانِيِّ  ، عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى  ، عَنْ كُرْدُوسٍ  ، عَنْ أَبِي مُوسَى  ، أَنَّ أَبَا بَكْرٍ  \" جَعَلَ الْجَدَّ أَبًا \"",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Abdullah, telah menceritakan kepada kami Abu Syihab, dari Asy-Syaibani, dari Abu Burdah bin Abi Musa, dari Kurdus, dari Abu Musa, bahawa Abu Bakar menjadikan datuk sebagai bapa."
  },
  {
    "id": 39704,
    "hadith_number": 2167,
    "tajuk_hadith": "Abu Bakr Menganggap Datuk Sebagai Bapa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْأَسْوَدُ بْنُ عَامِرٍ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ عَمْرِو بْنِ مُرَّةَ  ، عَنْ أَبِي بُرْدَةَ  ، عَنْ مَرْوَانَ  ، عَنْ عُثْمَانَ  : أَنَّ أَبَا بَكْرٍ   كَانَ\" يَجْعَلُ الْجَدَّ أَبًا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Aswad bin Amir, telah menceritakan kepada kami Syu'bah, daripada 'Amr bin Murrah, daripada Abi Burdah, daripada Marwan, daripada Uthman: Bahawa Abu Bakr adalah 'menjadikan datuk sebagai bapa'."
  },
  {
    "id": 39705,
    "hadith_number": 2168,
    "tajuk_hadith": "Abu Bakr Menganggap Datuk Sebagai Bapa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ  ، وَمُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ إِسْرَائِيلَ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ عُثْمَانَ  : أَنَّ أَبَا بَكْرٍ   كَانَ\" يَجْعَلُ الْجِدَّ أَبًا \"",
    "malay_translation": "Telah menceritakan kepada kami Ubaidullah, dan Muhammad bin Yusuf, daripada Israil, daripada Abu Ishaq, daripada Uthman: Bahawa Abu Bakr adalah \"menjadikan datuk sebagai bapa\"."
  },
  {
    "id": 39706,
    "hadith_number": 2169,
    "tajuk_hadith": "Pengiktirafan Datuk Sebagai Bapa Apabila Tiada Bapa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْأَسْوَدُ بْنُ عَامِرٍ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ عَمْرِو بْنِ مُرَّةَ  ، عَنْ أَبِي بُرْدَةَ  ، قَالَ : لَقِيتُ مَرْوَانَ بْنَ الْحَكَمِ بِالْمَدِينَةِ ، فَقَالَ : يَا ابْنَ أَبِي مُوسَى، أَلَمْ أُخْبَرْ أَنَّ الْجَدَّ لَا يُنَزَّلُ فِيكُمْ مَنْزِلَةَ الْأَبِ، وَأَنْتَ لَا تُنْكِرُ؟ قَالَ : قُلْتُ : وَلَوْ كُنْتَ أَنْتَ لَمْ تُنْكِرْ، قَالَ مَرْوَانُ  : فَأَنَا أَشْهَدُ عَلَى عُثْمَانَ بْنِ عَفَّانَ  أَنَّهُ شَهِدَ عَلَى أَبِي بَكْرٍ   أَنَّهُ\" جَعَلَ الْجَدَّ أَبًا، إِذَا لَمْ يَكُنْ دُونَهُ أَبٌ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami al-Aswad bin ‘Amir, telah menceritakan kepada kami Syu’bah, daripada ‘Amru bin Murrah, daripada Abi Burdah, dia berkata: Aku bertemu Marwan bin al-Hakam di Madinah, lalu dia berkata: Wahai anak Abu Musa, bukankah aku diberitahu bahawa datuk tidak diletakkan di kalangan kamu pada kedudukan ayah, dan kamu tidak mengingkarinya? Dia (Abu Burdah) berkata: Aku berkata: Walaupun kamu (Marwan) tidak mengingkarinya. Marwan berkata: Maka aku bersaksi atas Uthman bin Affan bahawa dia bersaksi atas Abu Bakr bahawa dia telah menjadikan datuk sebagai ayah, jika tidak ada ayah di bawahnya (datuk)."
  },
  {
    "id": 39707,
    "hadith_number": 2170,
    "tajuk_hadith": "Abu Bakar Menganggap Datuk Sebagai Bapa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْأَسْوَدُ بْنُ عَامِرٍ  ، أَنْبَأَنَا شُعْبَةُ  ، عَنْ خَالِدٍ الْحَذَّاءِ  ، عَنْ أَبِي نَضْرَةَ  ، وَعَنْ عِكْرِمَةَ  ، عَنْ ابْنِ عَبَّاسٍ  : أَنَّ أَبَا بَكْرٍ   كَانَ\" يَجْعَلُ الْجَدَّ أَبًا \"",
    "malay_translation": "Telah menceritakan kepada kami al-Aswad bin Amir, telah memberitakan kepada kami Syu'bah, daripada Khalid al-Hazza', daripada Abu Nadrah, dan daripada Ikrimah, daripada Ibn Abbas, bahawa Abu Bakar menjadikan datuk sebagai bapa."
  },
  {
    "id": 39708,
    "hadith_number": 2171,
    "tajuk_hadith": "Keutamaan Persaudaraan Islam dan Kedudukan Abu Bakar As-Siddiq",
    "perawi_melayu": "Ibnu Abbas R.A.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا وُهَيْبٌ  ، حَدَّثَنَا أَيُّوبُ  ، عَنْ عِكْرِمَةَ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ : جَعَلَهُ الَّذِي قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَوْ كُنْتُ مُتَّخِذًا أَحَدًا خَلِيلًا، لَاتَّخَذْتُهُ خَلِيلًا، وَلَكِنْ أُخُوَّةُ الْإِسْلَامِ أَفْضَلُ، يَعْنِي أَبَا بَكْرٍ   جَعَلَهُ أَبًا، يَعْنِي : الْجَدَّ \"",
    "malay_translation": "Telah menceritakan kepada kami Muslim bin Ibrahim, telah menceritakan kepada kami Wuhaib, telah menceritakan kepada kami Ayyub, dari Ikrimah, dari Ibnu Abbas R.A., dia berkata: Dia (Rasulullah SAW) menjadikannya sebagai orang yang telah bersabda: \"Sekiranya aku mengambil seseorang sebagai *khalil* (kekasih yang paling rapat), aku akan mengambilnya sebagai *khalil*, tetapi persaudaraan Islam adalah lebih utama,\" iaitu Abu Bakar R.A., (Rasulullah SAW) menjadikannya sebagai seorang bapa, iaitu datuk."
  },
  {
    "id": 39709,
    "hadith_number": 2172,
    "tajuk_hadith": "Abu Bakr Menganggap Datuk Sebagai Bapa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسْلِمٌ  ، حَدَّثَنَا وُهَيْبٌ  ، حَدَّثَنَا أَيُّوبُ  ، عَنْ ابْنِ أَبِي مُلَيْكَةَ  ، عَنْ ابْنِ الزُّبَيْر  : أَنَّ أَبَا بَكْرٍ  \" جَعَلَ الْجَدَّ أَبًا \"",
    "malay_translation": "Telah menceritakan kepada kami Muslim, telah menceritakan kepada kami Wuhaib, telah menceritakan kepada kami Ayyub, daripada Ibn Abi Mulaikah, daripada Ibn al-Zubair: Sesungguhnya Abu Bakr telah 'menjadikan datuk sebagai bapa'."
  },
  {
    "id": 39710,
    "hadith_number": 2173,
    "tajuk_hadith": "Status Datuk dan Kekeliruan Orang Ramai Mengenainya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ  ، أَنْبَأَنَا الْأَشْعَثُ  ، عَنْ الْحَسَنِ  ، قَالَ : إِنَّ الْجَدَّ قَدْ مَضَتْ سُنَّتُهُ، وَإِنَّ أَبَا بَكْرٍ  \" جَعَلَ الْجَدَّ أَبًا \"، وَلَكِنَّ النَّاسَ تَحَيَّرُوا",
    "malay_translation": "Telah menceritakan kepada kami Yazid bin Harun, telah memberitakan kepada kami Al-Asy'ath, dari Al-Hasan, dia berkata: Sesungguhnya datuk telah berlalu sunnahnya, dan sesungguhnya Abu Bakr 'menjadikan datuk sebagai bapa,' akan tetapi orang ramai menjadi keliru."
  },
  {
    "id": 39711,
    "hadith_number": 2174,
    "tajuk_hadith": "Umar Datuk Pertama yang Mewarisi dalam Islam",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ ، عَنْ عَلِيِّ بْنِ مُسْهِرٍ ، عَنْ عَاصِمٍ ،  عَنْ الشَّعْبِيِّ ، قَالَ :\" إِنَّ أَوَّلَ جَدٍّ وَرِثَ فِي الْإِسْلَامِ عُمَرُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Uyainah, daripada Ali bin Mushir, daripada Asim, daripada Asy-Sya'bi, beliau berkata: \"Sesungguhnya datuk pertama yang mewarisi dalam Islam adalah Umar.\""
  },
  {
    "id": 39712,
    "hadith_number": 2175,
    "tajuk_hadith": "Datuk Pertama yang Mewarisi dalam Islam dan Nasihat Ali dan Zaid",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا حَسَنٌ  ، عَنْ عَاصِمٍ  ، عَنْ الشَّعْبِيِّ  ، قَالَ :\" أَوَّلُ جَدٍّ وَرِثَ فِي الْإِسْلَامِ عُمَر، فَأَخَذَ مَالَهُ، فَأَتَاهُ عَلِيٌّ  ، وَزَيْدٌ  ، فَقَالَا : لَيْسَ لَكَ ذَاكَ، إِنَّمَا أَنْتَ كَأَحَدِ الْأَخَوَيْنِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Hasan, daripada 'Asim, daripada al-Sha'bi, dia berkata: \"Datuk pertama yang mewarisi dalam Islam adalah Umar, lalu dia mengambil hartanya, kemudian datang kepadanya Ali dan Zaid, lalu mereka berdua berkata: 'Itu bukan untukmu, sesungguhnya kamu hanyalah seperti salah seorang daripada dua saudara lelaki.'"
  },
  {
    "id": 39713,
    "hadith_number": 2176,
    "tajuk_hadith": "Pembahagian Harta Pusaka oleh Umar dengan Datuk dan Saudara",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، عَنْ عِيسَى الْخياط  ، عَنْ الشَّعْبِيِّ  ، قَالَ : كَانَ عُمَرُ  \" يُقَاسِمُ بِالْجَدِّ مَعَ الْأَخِ وَالْأَخَوَيْنِ، فَإِذَا زَادُوا أَعْطَاهُ الثُّلُثَ، وَكَانَ يُعْطِيهِ مَعَ الْوَلَدِ السُّدُسَ",
    "malay_translation": "Telah menceritakan kepada kami Ubaidullah bin Musa, daripada Isa al-Khayyat, daripada al-Sha'bi, dia berkata: 'Umar membahagikan harta pusaka dengan datuk bersama saudara lelaki dan dua saudara lelaki. Jika mereka bertambah, dia memberinya satu pertiga. Dan dia memberinya satu perenam bersama anak.'"
  },
  {
    "id": 39714,
    "hadith_number": 2177,
    "tajuk_hadith": "Musyawarah Umar RA tentang Datuk (Nenek) dan Pendapat Uthman RA",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا وُهَيْبٌ  ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ  ، عَنْ أَبِيهِ  ، عَنْ مَرْوَانَ بْنِ الْحَكَمِ  : أَنَّ عُمَرَ بْنَ الْخَطَّابِ   لَمَّا طُعِنَ، اسْتَشَارَهُمْ فِي الْجَدِّ، فَقَالَ :\" إِنِّي كُنْتُ رَأَيْتُ فِي الْجَدِّ رَأْيًا، فَإِنْ رَأَيْتُمْ أَنْ تَتَّبِعُوهُ، فَاتَّبِعُوهُ، فَقَالَ لَهُ عُثْمَانُ   : إِنْ نَتَّبِعْ رَأْيَكَ فَإِنَّهُ رَشَدٌ، وَإِنْ نَتَّبِعْ رَأْيَ الشَّيْخِ، فَنِعْمَ ذُو الرَّأْيِ كَانَ",
    "malay_translation": "Telah menceritakan kepada kami Muslim bin Ibrahim, telah menceritakan kepada kami Wuhaib, telah menceritakan kepada kami Hisyam bin Urwah, daripada ayahnya, daripada Marwan bin al-Hakam: Bahawa Umar bin al-Khattab ketika ditikam, meminta nasihat mereka tentang datuk (nenek). Beliau berkata: \"Sesungguhnya aku pernah berpendapat tentang datuk (nenek), jika kamu berpendapat untuk mengikutinya, maka ikutilah.\" Uthman berkata kepadanya: \"Jika kami mengikuti pendapatmu, maka sesungguhnya ia adalah petunjuk yang benar, dan jika kami mengikuti pendapat Syeikh (orang tua yang bijaksana), maka sebaik-baik orang yang berpendapat adalah dia.\""
  },
  {
    "id": 39715,
    "hadith_number": 2178,
    "tajuk_hadith": "Pemberian Satu Perenam kepada Datuk",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ  ، عَنْ عَلِيِّ بْنِ مُسْهِرٍ  ، عَنْ الشَّيْبَانِيِّ  ، عَنْ الشَّعْبِيِّ  ، قَالَ : كَتَبَ ابْنُ عَبَّاسٍ إِلَى عَلِيّ وَابْنُ عَبَّاسٍ بِالْبَصْرَةِ : إِنِّي أُتِيتُ بِجَدٍّ وَسِتَّةِ إِخْوَةٍ، فَكَتَبَ إِلَيْهِ عَلِيٌّ   :\" أَنْ أَعْطِ الْجَدَّ سُدسا، وَلَا تُعْطِهِ أَحَدًا بَعْدَهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Uyainah, daripada Ali bin Mushir, daripada Asy-Syaibani, daripada Asy-Sya'bi, beliau berkata: Ibnu Abbas menulis surat kepada Ali dan Ibnu Abbas di Basrah: \"Sesungguhnya telah datang kepadaku seorang datuk dan enam orang saudara lelaki,\" lalu Ali menulis kepadanya: \"Berikanlah kepada datuk itu satu perenam, dan jangan berikan kepada seorang pun setelahnya.\""
  },
  {
    "id": 39716,
    "hadith_number": 2179,
    "tajuk_hadith": "Hukum Pembahagian Pusaka untuk Datuk dalam Kes Enam Saudara Lelaki",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ ، حَدَّثَنَا حَسَنٌ ، عَنْ إِسْمَاعِيل ، عَنْ الشَّعْبِيِّ  فِي سِتَّةِ إِخْوَةٍ وَجَدٍّ، قَالَ :\" أَعْطِ الْجَدَّ السُّدُسَ.\n قَالَ أَبُو مُحَمَّد : كَأَنَّهُ يَعْنِي : عَلِيًّا رِضْوَانُ اللَّهِ عَلَيْهِ الشَّعْبِيُّ يَرْوِيهِ عَنْ عَلِيٍّ رِضْوَانُ اللَّهِ عَلَيْهِ",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Hasan, daripada Ismail, daripada Asy-Sya'bi mengenai enam orang saudara lelaki dan seorang datuk, beliau berkata: \"Berikan kepada datuk itu satu perenam.\"\nAbu Muhammad berkata: Seolah-olah beliau bermaksud: Ali, semoga Allah meredhainya. Asy-Sya'bi meriwayatkannya daripada Ali, semoga Allah meredhainya."
  },
  {
    "id": 39717,
    "hadith_number": 2180,
    "tajuk_hadith": "Datuk Sebagai Saudara dalam Pewarisan (Menurut Ali)",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ عَمْرِو بْنِ مُرَّةَ  ، عَنْ عَبْدِ اللَّهِ بْنِ سَلَمَةَ  : أَنَّ عَلِيًّا   كَانَ\" يَجْعَلُ الْجَدَّ أَخًا مَتَى يَكُونَ سَادِسًا",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Syu'bah, daripada 'Amr bin Murrah, daripada 'Abdullah bin Salamah: Bahawa sesungguhnya 'Ali menjadikan datuk sebagai saudara apabila dia menjadi yang keenam (dalam senarai waris)."
  },
  {
    "id": 39718,
    "hadith_number": 2181,
    "tajuk_hadith": "Pembahagian Warisan: Datuk dan Saudara (Menurut Ali r.a.)",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا وُهَيْبٌ  ، حَدَّثَنَا يُونُسُ  ، عَنْ الْحَسَنِ  : أَنَّ عَلِيًّا   كَانَ\" يُشَرِّكُ الْجَدَّ مَعَ الْإِخْوَةِ إِلَى السُّدُسِ",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Nu'man, telah menceritakan kepada kami Wuhaib, telah menceritakan kepada kami Yunus, daripada al-Hasan: Bahawa sesungguhnya Ali r.a. pernah 'menggabungkan datuk bersama saudara-saudara sehingga satu perenam dalam pembahagian faraid'."
  },
  {
    "id": 39719,
    "hadith_number": 2182,
    "tajuk_hadith": "Penggabungan Datuk dan Saudara-saudara",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ عَمْرِو بْنِ مُرَّةَ  ، عَنْ عَبْدِ اللَّهِ بْنِ سَلَمَةَ  ، قَالَ : كَانَ عَلِيٌّ  \" يُشَرِّكُ بَيْنَ الْجَدِّ وَالْإِخْوَةِ حَتَّى يَكُونَ سَادِسًا",
    "malay_translation": "Telah meriwayatkan kepada kami Hasyim bin al-Qasim, telah meriwayatkan kepada kami Syu'bah, daripada 'Amru bin Murrah, daripada 'Abdullah bin Salamah, beliau berkata: 'Ali (r.a.) menggabungkan datuk dan saudara-saudara sehingga menjadi yang keenam."
  },
  {
    "id": 39720,
    "hadith_number": 2183,
    "tajuk_hadith": "Hukum Warisan Datuk (Kakek) Bersama Saudara Lelaki dan Perempuan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ الْأَعْمَشِ  ، عَنْ إِبْرَاهِيمَ  ، قَالَ : كَانَ عَلِيٌّ  \" يُشَرِّكُ الْجَدَّ إِلَى سِتَّةٍ مَعَ الْإِخْوَةِ، يُعْطِي كُلَّ صَاحِبِ فَرِيضَةٍ فَرِيضَتَهُ، وَلَا يُوَرِّثُ أَخًا لِأُمٍّ مَعَ جَدٍّ، وَلَا أُخْتًا لِأُمٍّ، وَلَا يَزِيدُ الْجَدَّ مَعَ الْوَلَدِ عَلَى السُّدُسِ، إِلَّا أَنْ يَكُونَ غَيْرُهُ، وَلَا يُقَاسِمُ بِأَخٍ لِأَبٍ مَعَ أَخٍ لِأَبٍ وَأُمٍّ، وَإِذَا كَانَتْ أُخْتٌ لِأَبٍ وَأُمٍّ، وَأَخٌ لِأَبٍ، أَعْطَى الْأُخْتَ النِّصْفَ، وَالنِّصْفَ الْآخَرَ بَيْنَ الْجَدِّ وَالْأَخِ نِصْفَيْنِ، وَإِذَا كَانُوا إِخْوَةً وَأَخَوَاتٍ، شَرَّكَهُمْ مَعَ الْجَدِّ إِلَى السُّدُسِ",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Yusuf, telah menceritakan kepada kami Sufyan, dari al-A'mash, dari Ibrahim, dia berkata: Adalah 'Ali (رضي الله عنه) \"mengikutsertakan datuk (kakek) hingga satu perenam bersama saudara-saudara lelaki dan perempuan, memberikan kepada setiap pemilik *faraidh* (bagian warisan yang telah ditentukan) bagiannya, dan tidak mewariskan saudara lelaki seibu bersama datuk, dan tidak pula saudara perempuan seibu, dan tidak menambahkan bagian datuk bersama anak melebihi satu perenam, kecuali jika ada yang lain (kondisi lain), dan tidak membagi dengan saudara lelaki sebapa bersama saudara lelaki sebapa dan seibu. Dan jika ada saudara perempuan sebapa dan seibu, dan saudara lelaki sebapa, dia memberikan saudara perempuan itu separuh, dan separuh lainnya antara datuk dan saudara lelaki itu dibagi dua, dan jika mereka adalah saudara lelaki dan saudara perempuan (sebapa atau seibu atau sebapa dan seibu), dia mengikutsertakan mereka bersama datuk hingga satu perenam."
  },
  {
    "id": 39721,
    "hadith_number": 2184,
    "tajuk_hadith": "Datuk dan Rujukan kepada Nabi Adam AS",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ الْعَبْسِيِّ هُوَ عَبْدُ اللَّهِ بْنُ خَالِدٍ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَعْقِلٍ  ، قَالَ : سُئِلَ ابْنُ عَبَّاسٍ   عَنْ الْجَد؟ فَقَالَ :\" أَيُّ أَبٍ لَكَ أَكْبَر؟ فَقُلْتُ أَنَا : آدَمُ ، قَالَ : أَلَمْ تَسْمَعْ إِلَى قَوْلِ اللَّهِ تَعَالَى : # يَا بَنِي آدَمَ سورة الأعراف آية 26 #",
    "malay_translation": "Telah meriwayatkan kepada kami Muhammad bin Yusuf, daripada Sufyan, daripada al-'Absi—beliau adalah Abdullah bin Khalid—daripada Abdul Rahman bin Ma'qil, beliau berkata: Ibn Abbas telah ditanya tentang datuk. Maka beliau berkata: \"Bapa manakah yang lebih besar bagimu?\" Aku berkata: Adam. Beliau berkata: \"Tidakkah kamu mendengar firman Allah Ta'ala: 'Wahai anak-anak Adam...' (Surah al-A'raf, ayat 26)?\""
  },
  {
    "id": 39722,
    "hadith_number": 2185,
    "tajuk_hadith": "Keinginan Ibn Abbas untuk Berlaknat dengan Mereka yang Berselisih Pendapat Mengenai Datuk dalam Warisan",
    "perawi_melayu": "Ibn Abbas RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ إِسْمَاعِيل بْنِ سُمَيْعٍ  ، عَنْ رَجُلٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ :\" لَوَدِدْتُ أَنِّي وَالَّذِينَ يُخَالِفُونِي فِي الْجَدِّ تَلَاعَنَّا، أَيُّنَا أَسْوَأُ قَوْلًا",
    "malay_translation": "Muhammad bin Yusuf telah memberitahu kami, Sufyan meriwayatkan kepada kami, daripada Ismail bin Sumai', daripada seorang lelaki, daripada Ibn Abbas RA, beliau berkata: 'Saya berharap bahawa saya dan mereka yang tidak bersetuju dengan saya tentang datuk (dalam warisan) akan saling melaknat, [untuk melihat] siapa di antara kita yang mempunyai perkataan yang paling buruk.'"
  },
  {
    "id": 39723,
    "hadith_number": 2186,
    "tajuk_hadith": "Datuk Sebagai Bapa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا وُهَيْبٌ  ، حَدَّثَنَا ابْنُ طَاوُسٍ  ، عَنْ أَبِيهِ  ، عَنْ ابْنِ عَبَّاسٍ   : أَنَّهُ\" جَعَلَ الْجَدَّ أَبًا \"",
    "malay_translation": "Telah menceritakan kepada kami Muslim bin Ibrahim, telah menceritakan kepada kami Wuhaib, telah menceritakan kepada kami Ibn Tawus, dari ayahnya, dari Ibn Abbas, bahawa sesungguhnya baginda menjadikan datuk sebagai bapa."
  },
  {
    "id": 39724,
    "hadith_number": 2187,
    "tajuk_hadith": "Pembahagian Harta Pusaka Wanita yang Meninggalkan Suami, Ibu, Saudara Seayah, dan Datuk",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا زُهَيْرٌ  ، عَنْ أَبِي إِسْحَاق  قَالَ : دَخَلْتُ عَلَى شُرَيْحٍ وَعِنْدَهُ عَامِرٌ، وَإِبْرَاهِيمُ، وَعَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ فِي فَرِيضَةِ امْرَأَةٍ مِنَّا : الْعَالِيَةِ ، تَرَكَتْ زَوْجَهَا، وَأُمَّهَا، وَأَخَاهَا لِأَبِيهَا، وَجَدَّهَا، فَقَالَ لِي : هَلْ مِنْ أُخْتٍ؟ قُلْتُ : لَا، قَالَ : لِلْبَعْلِ الشَّطْرُ وَلِلْأُمِّ الثُّلُثُ، قَالَ : فَجَهِدْتُ عَلَى أَنْ يُجِيبَنِي، فَلَمْ يُجِبْنِي إِلَّا بِذَلِكَ، فَقَالَ إِبْرَاهِيمُ، وَعَامِرٌ، وَعَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ : مَا جَاءَ أَحَدٌ بِفَرِيضَةٍ أَعْضَلَ مِنْ فَرِيضَةٍ جِئْتَ بِهَا، قَالَ : فَأَتَيْتُ عَبِيدَةَ السَّلْمَانِيَّ وَكَانَ يُقَال : لَيْسَ بِالْكُوفَةِ أَحَدٌ أَعْلَمَ بِفَرِيضَةٍ مِنْ عَبِيدَةَ، وَالْحَارِثِ الْأَعْوَرَ، وَكَانَ عَبِيدَةُ يَجْلِسُ فِي الْمَسْجِدِ، فَإِذَا وَرَدَتْ عَلَى شُرَيْحٍ فَرِيضَةٌ فِيهَا جَدٌّ، رَفَعَهُمْ إِلَى عَبِيدَةَ، فَفَرَضَ فَسَأَلْتُهُ، فَقَالَ : إِنْ شِئْتُمْ نَبَّأْتُكُمْ بِفَرِيضَةِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ   فِي هَذَا :\" جَعَلَ لِلزَّوْجِ ثَلَاثَةَ أَسْهُمٍ النِّصْفَ، وَلِلْأُمِّ ثُلُثُ مَا بَقِيَ، وَهُوَ السُّدُسُ مِنْ رَأْسِ الْمَالِ، وَلِلْأَخِ سَهْمٌ، وَلِلْجَدِّ سَهْمٌ، قَالَ أَبُو إِسْحَاقَ : الْجَدُّ أَبُو الْأَبِ",
    "malay_translation": "Abu Nu'aim memberitahu kami, Zuhair menceritakan kepada kami, daripada Abu Ishaq berkata: \"Saya masuk menemui Syuraih, dan di sana ada Amir, Ibrahim, dan Abdul Rahman bin Abdullah. Mereka sedang membincangkan faraidh (pembahagian harta pusaka) seorang wanita dari kalangan kami, Al-'Aliyah, yang telah meninggal dunia dan meninggalkan suami, ibu, saudara lelaki seayah, dan datuk. Syuraih bertanya kepada saya: 'Adakah si mati mempunyai saudara perempuan?' Saya jawab: 'Tidak.' Syuraih berkata: 'Untuk suami adalah separuh (daripada harta pusaka) dan untuk ibu adalah satu pertiga.' Abu Ishaq berkata: 'Saya berusaha keras untuk mendapatkan jawapan yang lebih lanjut daripadanya, tetapi beliau hanya memberikan jawapan itu.' Kemudian Ibrahim, Amir, dan Abdul Rahman bin Abdullah berkata: 'Tidak pernah ada seorang pun yang datang dengan masalah faraidh yang lebih rumit daripada yang kamu bawa ini.' Abu Ishaq berkata: 'Kemudian saya pergi menemui Ubaidah as-Salmani, yang dikatakan sebagai orang yang paling berpengetahuan tentang faraidh di Kufah, bersama dengan al-Harith al-A'war. Ubaidah biasanya duduk di masjid. Jika Syuraih menghadapi masalah faraidh yang melibatkan datuk, beliau akan merujuknya kepada Ubaidah untuk diputuskan. Lalu saya bertanya kepada Ubaidah, dan beliau berkata: 'Jika kamu mahu, saya akan memberitahumu tentang pembahagian faraidh menurut Abdullah bin Mas'ud dalam kes ini: Beliau menetapkan untuk suami tiga bahagian (iaitu separuh), dan untuk ibu satu pertiga daripada baki harta, yang merupakan satu perenam daripada keseluruhan harta. Untuk saudara lelaki seayah satu bahagian, dan untuk datuk satu bahagian.' Abu Ishaq berkata: 'Datuk adalah bapa kepada bapa (ayahanda kepada bapa).'"
  },
  {
    "id": 39725,
    "hadith_number": 2188,
    "tajuk_hadith": "Pembahagian Pusaka: Datuk Bersama Saudara Lelaki",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا وُهَيْبٌ  ، حَدَّثَنَا يُونُسُ  ، عَنْ الْحَسَنِ  : أَنَّ زَيْدًا   كَانَ\" يُشَرِّكُ الْجَدَّ مَعَ الْإِخْوَةِ إِلَى الثُّلُثِ \"",
    "malay_translation": "Abu Nu'man memberitahu kami, Wahib memberitahu kami, Yunus memberitahu kami, daripada al-Hasan: bahawa Zaid RA pernah 'menggabungkan datuk bersama saudara-saudara lelaki sehingga satu pertiga'."
  },
  {
    "id": 39726,
    "hadith_number": 2189,
    "tajuk_hadith": "Pembahagian Pusaka dengan Datuk Bersama Saudara-saudara",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ  ، حَدَّثَنَا أَبِي  ، حَدَّثَنَا الْأَعْمَشُ  ، عَنْ إِبْرَاهِيمَ  ، عَنْ زَيْدِ بْنِ ثَابِتٍ   : أَنَّهُ كَانَ\" يُقَاسِمُ بِالْجَدِّ مَعَ الْإِخْوَةِ إِلَى الثُّلُثِ، ثُمَّ لَا يُنْقِصُهُ \"",
    "malay_translation": "Telah menceritakan kepada kami Umar bin Hafs bin Ghiyath, telah menceritakan kepada kami ayahku, telah menceritakan kepada kami al-A'mash, dari Ibrahim, dari Zaid bin Thabit RA, bahawa beliau pernah membahagikan harta pusaka dengan datuk bersama saudara-saudara hingga satu pertiga, kemudian beliau tidak mengurangkannya."
  },
  {
    "id": 39727,
    "hadith_number": 2190,
    "tajuk_hadith": "Mengambil Kira Perkara Leluhur Yang Dipersetujui Orang Ramai",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ الْمُغِيرَةِ  ، عَنْ عِيسَى بْنِ يُونُسَ  ، عَنْ إِسْمَاعِيل  ، قَالَ : قَالَ عَامِرٌ   :\" خُذْ مِنْ أَمْرِ الْجَدِّ مَا اجْتَمَعَ النَّاسُ عَلَيْهِ، قَالَ أَبُو مُحَمَّدٍ : يَعْنِي قَوْلَ زَيْدٍ",
    "malay_translation": "Telah menceritakan kepada kami Sa'id bin al-Mughirah, daripada 'Isa bin Yunus, daripada Ismail, dia berkata: Amir berkata: \"Ambillah dari urusan datuk (leluhur) apa yang manusia telah sepakati.\" Abu Muhammad berkata: Ini bermaksud perkataan Zaid."
  },
  {
    "id": 39728,
    "hadith_number": 2191,
    "tajuk_hadith": "Pembahagian Pusaka untuk Saudara Perempuan, Ibu, Suami, dan Datuk menurut Zaid bin Thabit",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ  ، عَنْ هَمَّامٍ  ، عَنْ قَتَادَةَ  : أَنَّ زَيْدَ بْنَ ثَابِتٍ   قَالَ فِي أُخْتٍ، وَأُمٍّ، ٍّوَزَوْجٍ، وَجَدٍّ، قَالَ :\" جَعَلَهَا مِنْ سَبْعٍ وَعِشْرِينَ : لِلْأُمِّ سِتَّةٌ، وَلِلزَّوْجِ تِسْعَةٌ، وَلِلْجَدِّ ثَمَانِيَةٌ، وَلِلْأُخْتِ أَرْبَعَةٌ",
    "malay_translation": "Telah mengkhabarkan kepada kami Sa'id bin Amir, daripada Hammam, daripada Qatadah: Bahawa Zaid bin Thabit berkata mengenai (pembahagian harta pusaka) bagi seorang saudara perempuan, ibu, suami, dan datuk, beliau berkata: \"Beliau menjadikannya daripada dua puluh tujuh bahagian: untuk ibu enam bahagian, untuk suami sembilan bahagian, untuk datuk lapan bahagian, dan untuk saudara perempuan empat bahagian.\""
  },
  {
    "id": 39729,
    "hadith_number": 2192,
    "tajuk_hadith": "Nenek Pertama yang Mendapat Bahagian Pusaka dalam Islam",
    "perawi_melayu": "Ibn Mas'ud",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، حَدَّثَنَا الْأَشْعَثُ  ، عَنْ ابْنِ سِيرِينَ  ، عَنْ ابْنِ مَسْعُودٍ  ، قَالَ :\" إِنَّ أَوَّلَ جَدَّةٍ أُطْعِمَتْ فِي الْإِسْلَامِ سَهْمًا أَمُّ أَبٍ، وَابْنُهَا حَيٌّ",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah menceritakan kepada kami Al-Asy'ath, daripada Ibn Sirin, daripada Ibn Mas'ud, beliau berkata: \"Sesungguhnya nenek pertama yang diberikan bahagian (harta pusaka) dalam Islam adalah ibu kepada bapa, dan anaknya masih hidup.\""
  },
  {
    "id": 39730,
    "hadith_number": 2193,
    "tajuk_hadith": "Bahagian Satu Perenam untuk Nenek",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا شَرِيكٌ  ، عَنْ لَيْثٍ  ، عَنْ طَاوُسٍ  ، عَنْ ابْنِ عَبَّاسٍ   : \" أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَطْعَمَ جَدَّةً سُدُسًا \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Syarik, daripada Laith, daripada Tawus, daripada Ibnu Abbas RA: \"Bahawasanya Nabi SAW memberi makan kepada nenek (pihak ibu) satu perenam (dari harta pusaka).\""
  },
  {
    "id": 39731,
    "hadith_number": 2194,
    "tajuk_hadith": "Nenek Mewarisi Bersama Anak",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ ابْنِ جُرَيْجٍ  ، عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ  ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ  : أَنَّ عُمَرَ  \" وَرَّثَ جَدَّةً مَعَ ابْنِهَا \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Sufyan, daripada Ibn Juraij, daripada Ibrahim bin Maisarah, daripada Sa'id bin al-Musayyib, bahawa Umar telah memberikan harta pusaka kepada seorang nenek bersama anaknya."
  },
  {
    "id": 39732,
    "hadith_number": 2195,
    "tajuk_hadith": "Pembagian Warisan untuk Tiga Nenek",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ  ، حَدَّثَنَا شُعْبَةُ  ، أَخْبَرَنِي مَنْصُورُ بْنُ الْمُعْتَمِرِ  ، قَالَ : سَمِعْتُ إِبْرَاهِيمَ  ، قَالَ :\" أَطْعَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَ جَدَّاتٍ سُدُسًا.\nقَالَ : قُلْتُ لِإِبْرَاهِيمَ : مَنْ هُنَّهْ؟ قَالَ : جَدَّتَاكَ مِنْ قِبَلِ أَبِيكَ، وَجَدَّتُكَ مِنْ قِبَلِ أُمِّكَ \"",
    "malay_translation": "Telah menceritakan kepada kami Hajjaj bin Minhal, telah menceritakan kepada kami Syu'bah, telah mengkhabarkan kepadaku Mansur bin Al-Mu'tamir, dia berkata: Aku mendengar Ibrahim berkata: \"Rasulullah SAW memberikan makan kepada tiga orang nenek sebanyak satu perenam (dari harta warisan).\"\nDia berkata: Aku bertanya kepada Ibrahim: \"Siapakah mereka?\" Dia berkata: \"Dua nenekmu dari pihak ayahmu, dan nenekmu dari pihak ibumu.\""
  },
  {
    "id": 39733,
    "hadith_number": 2196,
    "tajuk_hadith": "Nenek Mewarisi Harta dengan Anak Masih Hidup",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ  ، حَدَّثَنَا يَزِيدُ بْنُ إِبْرَاهِيمَ  ، قَالَ : أَنْبَأَنِي الْحَسَنُ  ، قَالَ :\" تَرِثُ الْجِدَّةُ وَابْنُهَا حَيٌّ \"",
    "malay_translation": "Telah menceritakan kepada kami Hajjaj bin Minhal, telah menceritakan kepada kami Yazid bin Ibrahim, dia berkata: Telah memberitahu kepadaku Al-Hasan, dia berkata: \"Nenek mewarisi (harta) dan anaknya masih hidup.\""
  },
  {
    "id": 39734,
    "hadith_number": 2197,
    "tajuk_hadith": "Hukum Waris Ibu Datuk Sebelah Ibu",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ ، عَنْ دَاوُدَ ، عَنِ الشَّعْبِيِّ ، قَالَ :\" لَا تَرِثُ أُمُّ أَبِ الْأُمِّ، ابْنُهَا الَّذِي تُدْلِي بِهِ لَا يَرِثُ، فَكَيْفَ تَرِثُ هِيَ؟ \"",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Hammad bin Salamah, daripada Daud, daripada Asy-Sya'bi, beliau berkata: 'Ibu kepada datuk sebelah ibu tidak mewarisi, anaknya yang dia sandarkan (nasabkan) tidak mewarisi, jadi bagaimana mungkin dia (ibu datuk sebelah ibu) mewarisi?'"
  },
  {
    "id": 39735,
    "hadith_number": 2198,
    "tajuk_hadith": "Warisan Nenek Ketika Anak Lelakinya Masih Hidup",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو مَعْمَرٍ  ، عَنْ إِسْمَاعِيل بْنِ عُلَيَّةَ  ، عَنْ سَلَمَةَ بْنِ عَلْقَمَةَ  ، عَنْ حُمَيْدِ بْنِ هِلَالٍ  ، عَنْ أَبِي الدَّهْمَاءِ  ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ  ، قَالَ :\" تَرِثُ الْجِدَّةُ وَابْنُهَا حَيٌّ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Ma'mar, daripada Ismail bin 'Ulayyah, daripada Salamah bin 'Alqamah, daripada Humaid bin Hilal, daripada Abi Dahma', daripada 'Imran bin Husain, dia berkata: \"Nenek mewarisi harta sedangkan anak lelakinya masih hidup.\""
  },
  {
    "id": 39736,
    "hadith_number": 2199,
    "tajuk_hadith": "Bahagian Warisan Nenek (Ibu Bapa atau Ibu Ibu)",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَنْبَأَنَا الْأَشْعَثُ  ، عَنْ الزُّهْرِيِّ  ، قَالَ : جَاءَتْ إِلَى أَبِي بَكْرٍ جَدَّةٌ أُمُّ أَبٍ، أَوْ أُمُّ أُمٍّ، فَقَالَتْ : إِنَّ ابْنَ ابْنِي أَوْ ابْنَ ابْنَتِي تُوُفِّيَ، وَبَلَغَنِي أَنَّ لِي نَصِيبًا، فَمَا لِي؟ فَقَالَ أَبُو بَكْرٍ : مَا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِيهَا شَيْئًا، وَسَأَسْأَلُ النَّاسَ، فَلَمَّا صَلَّى الظُّهْر، قَالَ : أَيُّكُمْ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْجَدَّةِ شَيْئًا؟ فَقَالَ الْمُغِيرَةُ بْنُ شُعْبَةَ   : أَنَا، قَالَ : مَاذَا؟ قَالَ :أَعْطَاهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُدُسًا، قَالَ : أَيَعْلَمُ ذَاكَ أَحَدٌ غَيْرُكَ؟ فَقَالَ مُحَمَّدُ بْنُ مَسْلَمَةَ   : صَدَقَ، فَأَعْطَاهَا أَبُو بَكْرٍ السُّدُسَ، فَجَاءَتْ إِلَى عُمَرَ مِثْلُهَا، فَقَال : مَا أَدْرِي، مَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهَا شَيْئًا، وَسَأَسْأَلُ النَّاسَ، فَحَدَّثُوهُ بِحَدِيثِ الْمُغِيرَةِ بْنِ شُعْبَةَ، وَمُحَمَّدِ بْنِ مَسْلَمَةَ، فَقَالَ عُمَرُ : أَيُّكُمَا خَلَتْ بِهِ فَلَهَا السُّدُسُ، فَإِنْ اجْتَمَعْتُمَا، فَهُوَ بَيْنَكُمَا",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah memberitakan kepada kami Al-Asy'ath, daripada Az-Zuhri, dia berkata: Datang kepada Abu Bakar seorang nenek, ibu bapa, atau ibu ibu, lalu dia berkata: \"Sesungguhnya cucu lelaki saya atau cucu perempuan saya telah meninggal dunia, dan telah sampai kepada saya bahawa saya ada bahagian, maka apa bahagian saya?\" Maka Abu Bakar berkata: \"Saya tidak mendengar Rasulullah صلى الله عليه وسلم bersabda tentangnya sesuatu pun, dan saya akan bertanya kepada orang ramai.\" Ketika selesai solat Zuhur, dia berkata: \"Siapa di antara kamu yang mendengar Rasulullah صلى الله عليه وسلم bersabda tentang nenek sesuatu?\" Maka Al-Mughirah bin Syu'bah berkata: \"Saya.\" Dia bertanya: \"Apa?\" Dia berkata: \"Rasulullah صلى الله عليه وسلم telah memberikannya satu perenam.\" Dia bertanya: \"Adakah ada orang lain yang tahu tentang itu selain kamu?\" Maka Muhammad bin Maslamah berkata: \"Benar.\" Maka Abu Bakar memberikannya satu perenam. Kemudian datang kepada Umar orang yang serupa, lalu dia berkata: \"Saya tidak tahu, saya tidak mendengar daripada Rasulullah صلى الله عليه وسلم tentangnya sesuatu pun, dan saya akan bertanya kepada orang ramai.\" Maka mereka menceritakan kepadanya hadis Al-Mughirah bin Syu'bah, dan Muhammad bin Maslamah. Maka Umar berkata: \"Mana-mana antara kamu berdua bersendirian dengannya, maka baginya satu perenam, dan jika kamu berdua bersetuju, maka ia adalah antara kamu berdua.\""
  },
  {
    "id": 39737,
    "hadith_number": 2200,
    "tajuk_hadith": "Hukum Warisan Nenek yang Sama Taraf",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، حَدَّثَنَا الْأَشْعَثُ  ، عَنْ الشَّعْبِيِّ  ، عَنْ عَلِيٍّ  ، وَزَيْدٍ   قَالَا :\" إِذَا كَانَتْ الْجَدَّاتُ سَوَاءً، وَرِثَ ثَلَاثُ جَدَّاتٍ جَدَّتَا أَبِيهِ أُمُّ أُمِّهِ، وَأُمُّ أَبِيهِ، وَجَدَّةُ أُمِّهِ، فَإِنْ كَانَتْ إِحَدَاهُنَّ أَقْرَب، فَالسَّهْمُ لِذَوِي الْقُرْبَى",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah menceritakan kepada kami Al-Asy'ath, daripada Asy-Sya'bi, daripada Ali dan Zaid, mereka berdua berkata: \"Apabila nenek-nenek sama tarafnya, maka tiga nenek mewarisi: nenek dari pihak ayah iaitu ibu kepada ibunya, dan ibu kepada ayahnya, dan nenek dari pihak ibu. Sekiranya salah seorang dari mereka lebih dekat (pertaliannya), maka bahagian (pusaka) adalah untuk yang paling dekat.\""
  },
  {
    "id": 39738,
    "hadith_number": 2201,
    "tajuk_hadith": "Nenek Sebelah Bapa Tidak Mewarisi Bersama Bapa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا حَسَنٌ  ، عَنْ أَشْعَثَ  ، عَنْ الشَّعْبِيِّ  ، عَنْ عَلِيٍّ  ، وَزَيْدٍ   : \" أَنَّهُمَا كَانَالا يُوَرِّثَانِ الْجِدَّةَ أُمَّ الأَبِ مَعَ الأَبِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Nu'aim, telah menceritakan kepada kami Hasan, daripada Asy'ath, daripada Asy-Sya'bi, daripada Ali dan Zaid: \"Bahawa keduanya tidak mewariskan nenek sebelah bapa bersama bapa.\""
  },
  {
    "id": 39739,
    "hadith_number": 2202,
    "tajuk_hadith": "Nenek Tidak Mewarisi Harta Jika Anak Lelakinya Masih Hidup (Menurut Uthman)",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ الْمُغِيرَةِ  ، عَنْ ابْنِ الْمُبَارَكِ  ، عَنْ مَعْمَرٍ  ، عَنْ الزُّهْرِيِّ  : أَنَّ عُثْمَانَ   كَانَ\" لَا يُوَرِّثُ الْجَدَّةَ وَابْنُهَا حَيٌّ \"",
    "malay_translation": "Telah meriwayatkan kepada kami Sa'id bin al-Mughirah, daripada Ibn al-Mubarak, daripada Ma'mar, daripada al-Zuhri: Bahawa Uthman r.a. adalah tidak mewariskan harta kepada nenek sekiranya anak lelakinya (cucu kepada nenek) masih hidup."
  },
  {
    "id": 39740,
    "hadith_number": 2203,
    "tajuk_hadith": "Nenek Tidak Mewarisi Harta Pusaka",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَنْبَأَنَا الْأَشْعَثُ  ، عَنْ ابْنِ سِيرِينَ  ، عَنْ ابْنِ مَسْعُودٍ  ، قَالَ :\" إِنَّ الْجَدَّاتِ لَيْسَ لَهُنَّ مِيرَاثٌ، إِنَّمَا هِيَ طُعْمَةٌ أُطْعِمْنَهَا، وَالْجَدَّاتُ أَقْرَبُهُنَّ وَأَبْعَدُهُنَّ سَوَاءٌ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah memberitakan kepada kami Al-Asy'ath, daripada Ibn Sirin, daripada Ibn Mas'ud, beliau berkata: \"Sesungguhnya nenek-nenek tidak mempunyai harta pusaka, sesungguhnya ia hanyalah pemberian yang diberikan kepada mereka, dan nenek-nenek yang paling dekat dan yang paling jauh adalah sama sahaja.\""
  },
  {
    "id": 39741,
    "hadith_number": 2204,
    "tajuk_hadith": "Nenek Mewarisi Harta Pusaka Ketika Anak Lelakinya Masih Hidup",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا حَجَّاجُ بْنُ مِنْهَالٍ  ، أَنْبَأَنَا أَبُو عَوَانَةَ  ، عَنْ الْمُغِيرَةِ  ، عَنْ إِبْرَاهِيمَ  ، قَالَ : قَالَ عَبْدُ اللَّهِ   :\" تَرِثُ الْجَدَّةُ وَابْنُهَا حَيٌّ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Hajjaj bin Minhal, telah memberitakan kepada kami Abu Awanah, daripada Al-Mughirah, daripada Ibrahim, beliau berkata: Abdullah berkata: \"Nenek mewarisi (harta pusaka) ketika anak lelakinya masih hidup.\""
  },
  {
    "id": 39742,
    "hadith_number": 2205,
    "tajuk_hadith": "Hukum Warisan Nenek",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَنْبَأَنَا الْأَشْعَثُ  ، عَنْ الشَّعْبِيِّ  ، قَالَ : \" جِئْنَ أَرْبَعُ جَدَّاتٍ يَتَسَاوَقْنَ إِلَى مَسْرُوقٍ  ،فَأَلْغَى أَمَّ أَبِ الْأَبِ، وَوَرَّثَ ثَلَاثًا : جَدَّتَيْ أَبِيهِ : أُمَّ أُمِّهِ، وَأُمَّ أَبِيهِ، وَجَدَّةَ أُمِّهِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah memberitakan kepada kami al-Asy'ath, daripada asy-Sya'bi, dia berkata: \"Empat orang nenek datang bergegas kepada Masruq, lalu dia menggugurkan (hak waris) nenek dari pihak bapa kepada bapa, dan mewariskan kepada tiga orang: dua nenek dari pihak bapanya: ibu kepada ibunya, dan ibu kepada bapanya, dan nenek dari pihak ibunya.\""
  },
  {
    "id": 39743,
    "hadith_number": 2206,
    "tajuk_hadith": "Pembahagian Harta Pusaka untuk Anak Perempuan dan Cucu Perempuan",
    "perawi_melayu": "Perawi Tidak Diketahui",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَنْبَأَنَا شَرِيكٌ  ، عَنْ الْأَعْمَشِ  ، عَنْ إِبْرَاهِيمَ  ، عَنْ عَبْدِ اللَّهِ   فِي ابْنَةٍ، وَابْنَةِ ابْنٍ، قَالَ :\" النِّصْفُ وَالسُّدُسُ، وَمَا بَقِيَ، فَرَدٌّ عَلَى الْبِنْتِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah memberitakan kepada kami Syarik, daripada al-A'mash, daripada Ibrahim, daripada Abdullah mengenai anak perempuan dan anak perempuan kepada anak lelaki, beliau bersabda: \"Separuh dan satu perenam, dan apa yang tinggal, maka dikembalikan kepada anak perempuan.\""
  },
  {
    "id": 39744,
    "hadith_number": 2207,
    "tajuk_hadith": "Pembahagian Harta Pusaka: Ibu Sebagai 'Asabah Bagi Mereka yang Tiada 'Asabah'",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى  ، حَدَّثَنَا جَرِيرٌ  ، عَنْ مَنْصُورٍ  ، عَنْ إِبْرَاهِيمَ  ، عَنْ عَلْقَمَةَ  ، عَنْ عَبْدِ اللَّه   : \" أَنَّهُ أُتِيَ فِي إِخْوَةٍ لِأُمٍّ، وَأُمٍّ،فَأَعْطَى الْإِخْوَةَ مِنَ الْأُمِّ الثُّلُثَ، وَالْأُمَّ سَائِرَ الْمَالِ، وَقَالَ : الْأُمُّ عَصَبَةُ مَنْ لَا عَصَبَةَ لَهُ \"",
    "malay_translation": "Muhammad bin Isa telah meriwayatkan kepada kami, Jarir telah meriwayatkan kepada kami, daripada Mansur, daripada Ibrahim, daripada Alqamah, daripada Abdullah: \"Bahawa seorang lelaki datang kepada beliau (Abdullah) bertanya tentang pembahagian harta pusaka bagi saudara-saudara seibu dan seorang ibu. Lalu Abdullah memberikan saudara-saudara seibu itu satu pertiga (1/3) dan ibu itu diberikan baki harta. Dan beliau (Abdullah) berkata: 'Ibu adalah 'asabah bagi mereka yang tidak mempunyai 'asabah.'\""
  },
  {
    "id": 39745,
    "hadith_number": 2208,
    "tajuk_hadith": "Harta Pusaka Sepenuhnya untuk Anak Perempuan Tunggal",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ ، حَدَّثَنَا حَسَنٌ ، عَنْ أَبِيهِ ، قَالَ : سَأَلْتُ الشَّعْبِيَّ  عَنْ رَجُلٍ مَاتَ وَتَرَكَ ابْنَتَهُ، لَا يُعْلَمُ لَهُ وَارِثٌ غَيْرُهَا، قَالَ :\" لَهَا الْمَالُ كُلُّهُ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Hasan, dari ayahnya, dia berkata: Saya bertanya kepada Asy-Sya'bi tentang seorang lelaki yang meninggal dunia dan meninggalkan seorang anak perempuan, dan tidak diketahui ada ahli waris baginya selain dia. Dia (Asy-Sya'bi) berkata: \"Untuknya harta itu seluruhnya.\""
  },
  {
    "id": 39746,
    "hadith_number": 2209,
    "tajuk_hadith": "Warisan: Pandangan Ibnu Mas'ud",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ مُحَمَّدِ بْنِ سَالِمٍ  ، عَنْ الشَّعْبِيِّ  ، أَنَّ ابْنَ مَسْعُودٍ   كَانَلَا يَرُدُّ عَلَى أَخٍ لِأُمٍّ مَعَ أُمٍّ، وَلا عَلَى جَدَّةٍ، إِذَا كَانَ مَعَهَا غَيْرُهَا مَنْ لَهُ فَرِيضَةٌ، وَلَا عَلَى ابْنَةِ ابْنٍ، مَعَ ابْنَةِ الصُّلْبِ، وَلَا عَلَى امْرَأَةٍ وَزَوْج",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Yusuf, telah menceritakan kepada kami Sufyan, dari Muhammad bin Salim, dari Asy-Sya'bi, bahawa Ibnu Mas'ud tidak menolak saudara lelaki seibu bersama ibu, dan tidak juga nenek, jika bersamanya ada waris lain yang berhak mendapat bahagian, dan tidak juga anak perempuan dari anak lelaki bersama anak perempuan kandung, dan tidak juga isteri dan suami."
  },
  {
    "id": 39747,
    "hadith_number": 2210,
    "tajuk_hadith": "Pembahagian Harta Rampasan Perang Menurut Ali",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "وَكَانَ عَلِيٌّ  \" يَرُدُّ عَلَى كُلِّ ذِي سَهْمٍ، إِلَّا الْمَرْأَةَ وَالزَّوْجَ \"",
    "malay_translation": "Dan adalah Ali mengembalikan (bahagian) kepada setiap pemilik saham (dalam harta rampasan perang), kecuali isteri dan suami."
  },
  {
    "id": 39748,
    "hadith_number": 2211,
    "tajuk_hadith": "Pembahagian Harta Pusaka untuk Anak Perempuan atau Saudara Perempuan dan Baki di Baitulmal",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدٌ  ، حَدَّثَنَا سُفْيَانُ  ، قَالَ : أَخْبَرَنِي مُحَمَّدُ بْنُ سَالِمٍ  ، عَنْ خَارِجَةَ بْنِ زَيْدٍ  ، عَنْ زَيْدِ بْنِ ثَابِت   : \" أَنَّهُأُتِيَ فِي ابْنَةٍ، أَوْ أُخْت، فَأَعْطَاهَا النِّصْفَ، وَجَعَلَ مَا بَقِيَ فِي بَيْتِ الْمَالِوقَالَ يَزِيدُ بْنُ هَارُونَ  : عَنْ مُحَمَّدِ بْنِ سَالِمٍ  ، عَنْ الشَّعْبِيِّ  ، عَنْ خَارِجَةَ",
    "malay_translation": "Muhammad telah memberitahu kami, Sufyan telah menceritakan kepada kami, beliau berkata: Muhammad bin Salim telah memberitahu saya, daripada Kharijah bin Zaid, daripada Zaid bin Thabit: \"Sesungguhnya beliau didatangi berkenaan seorang anak perempuan, atau saudara perempuan, lalu beliau memberikan kepadanya separuh (daripada harta pusaka), dan menjadikan bakinya di Baitulmal. Yazid bin Harun berkata: Daripada Muhammad bin Salim, daripada al-Sha'bi, daripada Kharijah.\""
  },
  {
    "id": 39749,
    "hadith_number": 2212,
    "tajuk_hadith": "Warisan Anak Li'an",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ  ، عَنْ عَلِيِّ بْنِ مُسْهِرٍ  ، عَنْ سَعِيدٍ  ، عَنْ أَبِي مَعْشَرٍ  ، عَنْ إِبْرَاهِيمَ  ، عَنْ عَبْدِ اللَّهِ  ، قَالَ فِي ابْنِ الْمُلَاعَنَةِ، قَالَ :\" مِيرَاثُهُ لِأُمِّهِ \"",
    "malay_translation": "Muhammad bin Uyainah telah memberitahu kami, daripada Ali bin Mushir, daripada Sa'id, daripada Abu Ma'shar, daripada Ibrahim, daripada Abdullah, dia berkata mengenai anak yang dilaknat (anak li'an), dia berkata: \"Warisan anak itu adalah untuk ibunya.\""
  },
  {
    "id": 39750,
    "hadith_number": 2213,
    "tajuk_hadith": "Warisan Anak Hasil Li'an",
    "perawi_melayu": "Mu'az bin Hani', Ibrahim bin Tahman, 'Ata' bin Abi Rabah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُعَاذُ بْنُ هَانِئٍ  ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ  ، قَالَ : سَمِعْتُ رَجُلًا  سَأَلَ عَطَاءَ بْنَ أَبِي رَبَاحٍ   عَنْ وَلَدِ الْمُتَلَاعِنَيْنِ لِمَنْ مِيرَاثُهُ؟ قَالَ :\" لِأُمِّهِ وَأَهْلِهَا",
    "malay_translation": "Telah mengkhabarkan kepada kami Mu'az bin Hani', telah menceritakan kepada kami Ibrahim bin Tahman, dia berkata: Aku mendengar seorang lelaki bertanya kepada 'Ata' bin Abi Rabah tentang anak hasil li'an, kepada siapa warisannya? Beliau menjawab: \"Kepada ibunya dan keluarganya.\""
  },
  {
    "id": 39751,
    "hadith_number": 2214,
    "tajuk_hadith": "Hukum Pusaka Anak Li'an (Mula'anah)",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا حَسَنٌ  ، عَنْ أَبِي سَهْلٍ  ، عَنْ الشَّعْبِيِّ  قَالَ : قَالَ عَلِيٌّ   فِي ابْنِ الْمُلَاعَنَةِ :\" تَرَكَ أَخَاهُ لِأُمِّهِ، وَأُمَّهُ لِأَخِيهِ السُّدُسُ، وَلِأُمِّهِ الثُّلُثُ، ثُمَّ يُرَدُّ عَلَيْهِمْ، فَيَصِيرُ لِلْأَخِ الثُّلُثُ، وَلِلْأُمِّ الثُّلُثَانِ \".\nوَقَالَ ابْنُ مَسْعُودٍ   : لِأَخِيهِ السُّدُسُ، وَمَا بَقِيَ فَلِلْأُمِّ",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Nu'aim, telah menceritakan kepada kami Hasan, daripada Abu Sahl, daripada al-Sya'bi berkata: Ali berkata mengenai anak li'an (mula'anah): \"Dia meninggalkan saudara lelaki seibu, dan ibunya untuk saudara lelakinya satu perenam, dan untuk ibunya satu pertiga, kemudian dikembalikan kepada mereka, maka menjadi untuk saudara lelaki satu pertiga, dan untuk ibu dua pertiga.\" Dan Ibn Mas'ud berkata: \"Untuk saudara lelakinya satu perenam, dan apa yang tinggal adalah untuk ibu.\""
  },
  {
    "id": 39752,
    "hadith_number": 2215,
    "tajuk_hadith": "Harta Pusaka untuk Anak Saudara Lelaki dalam Kes Mula'anah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ ، حَدَّثَنَا حَسَنٌ ، عَنْ أَبِي سَهْلٍ ، عَنْ الشَّعْبِيِّ  فِي ابْنِ الْمُلَاعَنَةِ : تَرَكَ ابْنَ أَخٍ وَجَدًّا، قَالَ :\" الْمَالُ لِابْنِ الْأَخِ \"",
    "malay_translation": "Abu Nu'aim memberitahu kami, Hasan menceritakan kepada kami, daripada Abu Sahl, daripada al-Sha'bi mengenai anak *mula'anah*: Dia meninggalkan seorang anak saudara lelaki dan seorang datuk. Beliau (al-Sha'bi) berkata: \"Harta itu adalah untuk anak saudara lelaki.\""
  },
  {
    "id": 39753,
    "hadith_number": 2216,
    "tajuk_hadith": "Hukum Warisan Anak Li'an",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى  ، حَدَّثَنَا سَالِمُ بْنُ نُوحٍ  ، عَنْ عُمَرَ بْنِ عَامِرٍ  ، عَنْ قَتَادَةَ  ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ  ، عَنْ زَيْدِ بْنِ ثَابِتٍ   فِي مِيرَاثِ ابْنِ الْمُلَاعَنَة :\" لِأُمِّهِ الثُّلُثُ، وَالثُّلُثَانِ لِبَيْتِ الْمَالِ \"",
    "malay_translation": "Muhammad bin Isa meriwayatkan kepada kami, Salim bin Nuh meriwayatkan kepada kami, daripada Umar bin Amir, daripada Qatadah, daripada Sa'id bin al-Musayyib, daripada Zaid bin Thabit mengenai warisan anak yang dila'nat (anak li'an): \"Untuk ibunya satu pertiga, dan dua pertiga untuk Baitulmal.\""
  },
  {
    "id": 39754,
    "hadith_number": 2217,
    "tajuk_hadith": "Warisan untuk Ibu dan 'Asabah Ibu",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى  ، حَدَّثَنَا سَالِمُ بْنُ نُوحٍ  ، عَنْ عُمَرَ بْنِ عَامِرٍ  ، عَنْ حَمَّادٍ  ، عَنْ إِبْرَاهِيمَ  ، عَنْ عَبْدِ اللَّهِ  ، قَالَ :\" مِيرَاثُهُ لِأُمِّهِ تَعْقِلُ عَنْهُ عَصَبَةُ أُمِّهِ \"، وَقَالَ قَتَادَةُ  ، عَنْ الْحَسَنِ   : لِأُمِّهِ الثُّلُثُ، وَبَقِيَّةُ الْمَالِ لِعَصَبَةِ أُمِّهِ",
    "malay_translation": "Telah meriwayatkan kepada kami Muhammad bin Isa, telah meriwayatkan kepada kami Salim bin Nuh, daripada Umar bin Amir, daripada Hammad, daripada Ibrahim, daripada Abdullah, beliau berkata: \"Pusaka bagi ibunya, 'asabah ibunya menanggung ('aqilah) untuknya.\" Qatadah berkata, daripada al-Hasan: \"Untuk ibunya satu pertiga, dan baki harta adalah untuk 'asabah ibunya.\""
  },
  {
    "id": 39755,
    "hadith_number": 2218,
    "tajuk_hadith": "Pembahagian Pusaka Anak Mula'anah Menurut Ali, Ibnu Mas'ud, dan Zaid bin Thabit",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا حَجَّاجُ بْنُ مِنْهَالٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، أَخْبَرَنَا قَتَادَةُ  : أَنَّ عَلِيًّا  ، وَابْنَ مَسْعُودٍ   قَالَا فِي وَلَدِ المُلَاعَنَةٍ تَرْكُ جَدَّتِهِ وَإِخْوَتِهِ لأُمِّهِ، قَالَ :\" لِلْجَدَّةِ الثُّلُثُ، وَلِلْإِخْوَةِ الثُّلُثَانِ \"، وَقَالَ زَيْدُ بْنُ ثَابِتٍ   : لِلْجَدَّةِ السُّدُسُ، وَلِلْإِخْوَةِ لِلْأُمِّ الثُّلُثُ، وَمَا بَقِيَ فَلِبَيْتِ الْمَالِ",
    "malay_translation": "Hajjaj bin Minhal memberitahu kami, Hammad bin Salamah menceritakan kepada kami, Qatadah memberitahu kami: Sesungguhnya Ali dan Ibnu Mas'ud berkata mengenai anak *mula'anah* (anak yang dinafikan nasabnya oleh suami kerana *li'an*) harta pusakanya adalah untuk neneknya dan saudara-saudara lelakinya dari pihak ibu. Mereka berkata: \"Bagi nenek satu pertiga, dan bagi saudara-saudara lelaki dua pertiga.\" Dan Zaid bin Thabit berkata: \"Bagi nenek satu perenam, dan bagi saudara-saudara lelaki dari pihak ibu satu pertiga, dan apa yang selebihnya adalah untuk Baitul Mal (perbendaharaan negara).\""
  },
  {
    "id": 39756,
    "hadith_number": 2219,
    "tajuk_hadith": "Warisan Anak yang Dila'nat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَجَّاجٌ  ، حَدَّثَنَا حَمَّادٌ  ، أَنْبَأَنَا يُونُسُ  ، وَحُمَيدٌ  ، عَنْ الْحَسَنِ  ، قَالَ :\" تَرِثُهُ أُمُّهُ يَعْنِي : ابْنَ الْمُلَاعَنَةِ \"",
    "malay_translation": "Hajjaj meriwayatkan kepada kami, Hammad meriwayatkan kepada kami, Yunus dan Humaid memberitahu kami, daripada Al-Hasan, dia berkata: \"Ibunya mewarisinya, iaitu: anak yang dila'nat.\""
  },
  {
    "id": 39757,
    "hadith_number": 2220,
    "tajuk_hadith": "Hukum Warisan Ibu",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا حَجَّاجٌ ، حَدَّثَنَا حَمَّادٌ ، حَدَّثَنَا حَجَّاجٌ : أَنَّ النَّخَعِيَّ ، وَالشَّعْبِيّ ، قَالَا :\" تَرِثُهُ أُمُّهُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Hajjaj, telah menceritakan kepada kami Hammad, telah menceritakan kepada kami Hajjaj: Sesungguhnya An-Nakha'i dan Asy-Sya'bi, kedua-duanya berkata: \"Ibunya mewarisinya.\""
  },
  {
    "id": 39758,
    "hadith_number": 2221,
    "tajuk_hadith": "Keputusan Nabi SAW tentang Anak yang Dila'nat: Hak Ibu",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عُمَيْرٍ  ، قَالَ : كَتَبْتُ إِلَى أَخٍ لِي   مِنْ بَنِي زُرَيْقٍ أَسْأَلُهُ : لِمَنْ قَضَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ابْنِ الْمُلَاعَنَةِ؟ فَكَتَبَ إِلَيَّ : \" أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم :قَضَى بِهِ لِأُمِّهِ هِيَ بِمَنْزِلَةِ أُمِّهِ وَأَبِيهِ.\nوقَالَ سُفْيَانُ : الْمَالُ كُلُّهُ لِلْأُمِّ هِيَ بِمَنْزِلَةِ أَبِيهِ وَأُمِّهِ",
    "malay_translation": "Muhammad bin Yusuf memberitahu kami, Sufyan menceritakan kepada kami, daripada Daud bin Abi Hind, daripada Abdullah bin Ubaid bin Umair, dia berkata: Saya menulis kepada seorang saudara saya dari Bani Zuraiq, bertanya kepadanya: Untuk siapa Nabi صلى الله عليه وسلم memutuskan tentang anak yang dila'nat? Lalu dia menulis kepada saya: \"Bahawa Nabi صلى الله عليه وسلم memutuskan anak itu untuk ibunya. Dia adalah seperti ibu dan bapanya baginya.\" Sufyan berkata: \"Keseluruhan harta adalah untuk ibu, dia adalah seperti ibu dan bapanya baginya.\""
  },
  {
    "id": 39759,
    "hadith_number": 2222,
    "tajuk_hadith": "Pembahagian Harta Pusaka Anak Mula'anah",
    "perawi_melayu": "Perawi tidak tersedia",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدٌ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ هِشَامٍ  ، عَنْ الْحَسَنِ   فِي ابْنِ الْمُلَاعَنَةِ تَرَكَ أُمَّهُ وَعَصَبَةَ أُمِّهِ، قَالَ :\" الثُّلُثُ لِأُمِّهِ، وَمَا بَقِيَ فَلِعَصَبَةِ أُمِّهِ \"",
    "malay_translation": "Muhammad telah memberitahu kami, Sufyan meriwayatkan kepada kami, daripada Hisham, daripada Al-Hasan mengenai anak *mula'anah* (anak yang dilahirkan akibat sumpah laknat) yang meninggalkan ibunya dan *‘asabah* (kerabat lelaki sebelah bapa) ibunya. Beliau (Al-Hasan) berkata: \"Satu pertiga adalah untuk ibunya, dan selebihnya adalah untuk *‘asabah* ibunya.\""
  },
  {
    "id": 39760,
    "hadith_number": 2223,
    "tajuk_hadith": "Asabah Anak Zina Adalah Asabah Ibu",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، عَنْ ابْنِ أَبِي لَيْلَى  ، عَنْ عَامِرٍ  ، عَنْ عَلِيٍّ  ، وَعَبْدِ اللَّهِ   فِي ابْنِ الْمُلاعَنَةِ، قَالا :\" عَصَبَتُهُ عَصَبَةُ أُمِّهِ \"",
    "malay_translation": "Ubaidullah bin Musa telah memberitahu kami, daripada Ibn Abi Laila, daripada Amir, daripada Ali, dan Abdullah mengenai anak yang dilaknat (anak zina), mereka berdua berkata: \"Asabahnya (kelompok kekerabatannya) adalah asabah ibunya.\""
  },
  {
    "id": 39761,
    "hadith_number": 2224,
    "tajuk_hadith": "Warisan Anak Hasil Zina Adalah untuk Ibunya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ الْحَلَبِيُّ مُوسَى بْنُ خَالِدٍ ، حَدَّثَنَا المُعْتَمِر ، عَنْ يُونُسَ ، عَنِ الْحَسَنِ ، أَنَّهُ كَانَ يَقُول :\" مِيرَاثُ وَلَدِ الْمُلَاعَنَةِ لِأُمِّه، قُلْتُ : فَإِنْ كَانَ لَهُ أَخٌ مِنْ أُمِّه؟ قَالَ : لَهُ السُّدُسُ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu al-Walid al-Halabi Musa bin Khalid, telah menceritakan kepada kami al-Mu'tamir, dari Yunus, dari al-Hasan, bahawa beliau berkata: \"Harta pusaka anak yang dila'nat (kerana zina) adalah untuk ibunya.\" Saya bertanya: \"Bagaimana jika dia mempunyai saudara lelaki dari ibunya?\" Beliau menjawab: \"Dia mendapat satu perenam.\""
  },
  {
    "id": 39762,
    "hadith_number": 2225,
    "tajuk_hadith": "Warisan Anak Li'an",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْمُغِيرَةِ ، حَدَّثَنَا الْأَوْزَاعِيُّ ، حَدَّثَنَا الزُّهْرِيُّ ، قَالَ :\" وَلَدُ الْمُلَاعَنَةِ لِأُمِّه، تَرِثُ فَرِيضَتَهَا مِنْهُ، وَسَائِرُ ذَلِكَ فِي بَيْتِ الْمَالِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Al-Mughirah, telah menceritakan kepada kami Al-Awza'i, telah menceritakan kepada kami Az-Zuhri, dia berkata: \"Anak hasil li'an adalah bagi ibunya; dia mewarisi bahagian faraidhnya daripada ibunya, dan selebihnya adalah untuk Baitul Mal (Perbendaharaan Negara).\""
  },
  {
    "id": 39763,
    "hadith_number": 2226,
    "tajuk_hadith": "Hukum Li'an: Perpisahan Pasangan dan Nasab Anak Kepada Ibu",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، عَنْ مُوسَى بْنِ عُبَيْدَةَ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ  ، قَالَ :\" إِذَا تَلَاعَنَا، فُرِّقَ بَيْنَهُمَا وَلَمْ يَجْتَمِعَا، وَدُعِيَ الْوَلَدُ لِأُمِّهِ، يُقَالُ : ابْنُ فُلَانَةَ، هِيَ عَصَبَتُهُ يَرِثُهَا وَتَرِثُهُ، وَمَنْ دَعَاهُ لِزِنْيَةٍ، جُلِدَ \"",
    "malay_translation": "Ubaidullah bin Musa telah meriwayatkan kepada kami, daripada Musa bin Ubaidah, daripada Nafi', daripada Ibn Umar RA, beliau berkata: \"Apabila kedua-duanya melakukan li'an, mereka akan dipisahkan dan tidak boleh berkumpul semula, dan anak itu dinasabkan kepada ibunya, dikatakan: anak perempuan si fulanah, dia adalah 'asabah (waris)nya, dia mewarisinya dan dia mewarisinya, dan sesiapa yang menuduhnya berzina, dia akan disebat.\""
  },
  {
    "id": 39764,
    "hadith_number": 2227,
    "tajuk_hadith": "Warisan dan Tanggungjawab untuk Anak Hasil Li'an",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُعَاذُ بْنُ هَانِئٍ ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ ، حَدَّثَنَا الشَّيْبَانِيُّ ، عَنْ الشَّعْبِيِّ  فِي وَلَدِ الْمُتَلَاعِنَيْنِ : \" أَنَّهُتَرِثُهُ عَصَبَةُ أُمِّهِ، وَهُمْ يَعْقِلُونَ عَنْهُ \"",
    "malay_translation": "Telah menceritakan kepada kami Mu'az bin Hani', telah menceritakan kepada kami Ibrahim bin Tahman, telah menceritakan kepada kami Asy-Syaibani, dari Asy-Sya'bi mengenai anak dari pasangan yang saling melaknat (li'an): bahawa dia (anak itu) diwarisi oleh 'asabah (kerabat laki-laki) ibunya, dan mereka bertanggungjawab atas diat (denda) darinya."
  },
  {
    "id": 39765,
    "hadith_number": 2228,
    "tajuk_hadith": "Hadis tentang Anak Mula'anah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَهْلُ بْنُ حَمَّادٍ  ، أَنْبَأَنَا هَمَّامٌ  ، عَنْ قَتَادَةَ  ، عَنْ عَزْرَةَ  ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ  ، عَنْ ابْنِ عَبَّاسٍ   فِي وَلَدِ الْمُلَاعَنَةِ هُوَ الَّذِي لَا أَبَ لَهُ\" تَرِثُهُ أُمُّهُ وَإِخْوَتُهُ مِنْ أُمِّهِ، ِوَعَصَبَةُُ أُمِّهِ، فَإِنْ قَذَفَهُ قَاذِف، جُلِدَ قَاذِفُهُ \"",
    "malay_translation": "Telah menceritakan kepada kami Sahl bin Hammad, memberitakan kepada kami Hammam, dari Qatadah, dari 'Azrah, dari Sa'id bin Jubair, dari Ibnu Abbas, mengenai anak hasil *mula'anah*: \"Dia adalah anak yang tidak memiliki ayah.\" Ibunya dan saudara-saudaranya dari pihak ibu, serta *'ashabah* ibunya mewarisinya. Jika seseorang menuduhnya berzina, maka orang yang menuduh itu dicambuk."
  },
  {
    "id": 39766,
    "hadith_number": 2229,
    "tajuk_hadith": "Warisan Anak Hasil Mula'anah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ  ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ  ، عَنْ النُّعْمَانِ  ، عَنْ مَكْحُولٍ   : أَنَّهُ سُئِلَ عَنْ مِيرَاثِ وَلَدِ الْمُلَاعَنَةِ لِمَنْ هُوَ؟ قَالَ : جَعَلَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لِأُمِّهِ فِي سَبَبِهِ لِمَا لَقِيَتْ مِنْ الْبَلَاءِ، وَلِإِخْوَتِهِ مِنْ أُمِّهِ، وقَالَ مَكْحُول : فَإِنْ مَاتَتْ الْأُمُّ، وَتَرَكَتْ ابْنَهَا، ثُمَّ تُوُفِّيَ ابْنُهَا الَّذِي جُعِلَ لَهَا، كَانَ مِيرَاثُهُ لِإِخْوَتِهِ مِنْ أُمِّهِ كُلُّهُ، لِأَنَّهُ كَانَ لِأُمِّهِمْ وَجَدِّهِمْ، وَكَانَ لِأَبِيهَا السُّدُسُ مِنْ ابْنِ ابْنَتِهِ، وَلَيْسَ يَرِثُ الْجَدُّ إِلَّا فِي هَذِهِ الْمَنْزِلَةِ، لِأَنَّهُ إِنَّمَا هُوَ أَبُ الْأُمِّ، وَإِنَّمَا وَرِثَ الْإِخْوَةُ مِنْ الْأُمِّ أُمَّهُمْ، وَوَرِثَ الْجَدُّ ابْنَتَهُ لِأَنَّهُ جُعِلَ لَهَا، فَالْمَالُ الَّذِي لِلْوَلَدِ لِوَرَثَةِ الْأُمِّ وَهُوَ بِحَوْزَةِ الْجَدُّ وَحْدَهُ إِذَا لَمْ يَكُنْ غَيْرُهُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin al-Mubarak, telah menceritakan kepada kami Yahya bin Hamzah, daripada Nu'man, daripada Makhul: Bahawa beliau ditanya tentang warisan anak yang dilaknat (anak hasil mula'anah), untuk siapa warisannya? Beliau berkata: Rasulullah SAW telah menetapkannya (warisan) untuk ibunya disebabkan olehnya (anak itu) kerana kesusahan yang telah dialaminya (ibu), dan untuk saudara-saudaranya dari pihak ibu. Makhul berkata: Sekiranya ibu meninggal dunia, dan meninggalkan anaknya, kemudian anaknya yang telah ditetapkan (warisan) untuknya meninggal dunia, maka warisannya adalah untuk semua saudara-saudaranya dari pihak ibu, kerana ia (warisan) adalah untuk ibu dan datuk mereka, dan untuk bapa ibunya (datuk dari pihak ibu) adalah satu perenam dari anak perempuan anaknya (cucu perempuan). Datuk tidak mewarisi kecuali dalam kedudukan ini, kerana dia hanyalah bapa kepada ibu, dan sesungguhnya saudara-saudara dari pihak ibu mewarisi ibu mereka, dan datuk mewarisi anak perempuannya kerana ia (warisan) telah ditetapkan untuknya. Maka harta yang dimiliki oleh anak itu adalah untuk waris ibu dan ia berada di bawah penguasaan datuk sahaja jika tidak ada orang lain selainnya."
  },
  {
    "id": 39767,
    "hadith_number": 2230,
    "tajuk_hadith": "Warisan Anak Li'an Diberikan Kepada Ibu",
    "perawi_melayu": "Muhammad bin al-'Ala', Yahya bin Abi Bukair, Ibrahim bin Tahman, Simak bin Harb, Ikrimah, Ibn Abbas",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ  ، حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ  ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ  ، عَنْ سِمَاكِ بْنِ حَرْبٍ  ، عَنْ عِكْرِمَةَ  ، عَنْ ابْنِ عَبَّاسٍ  : أَنَّ قَوْمًا اخْتَصَمُوا إِلَى عَلِيٍّ   رَضِيَ اللَّهُ تَعَالَى عَنْه فِي وَلَدِ الْمُتَلَاعِنَيْنِ، فَجَاءَ عَصَبَةُ أَبِيهِ يَطْلُبُونَ مِيرَاثَه، فَقَالَ :\" إِنَّ أَبَاهُ كَانَ تَبَرَّأَ مِنْهُ، فَلَيْسَ لَكُمْ مِنْ مِيرَاثِهِ شَيْءٌ، فَقَضَى بِمِيرَاثِهِ لِأُمِّهِ، وَجَعَلَهَا عَصَبَتَهُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin al-'Ala', telah menceritakan kepada kami Yahya bin Abi Bukair, telah menceritakan kepada kami Ibrahim bin Tahman, daripada Simak bin Harb, daripada Ikrimah, daripada Ibn Abbas: Bahawa suatu kaum bertelingkah kepada Ali radhiAllahu Ta'ala 'anhu tentang anak dari pasangan yang saling melaknat (li'an). Lalu datanglah kerabat ayah anak itu menuntut warisannya. Maka Ali berkata: \"Sesungguhnya ayahnya telah berlepas diri daripadanya, maka tidak ada sedikit pun bagi kamu dari warisannya.\" Lalu Ali memutuskan warisannya untuk ibunya, dan menjadikannya sebagai 'asabah (kerabat)nya."
  },
  {
    "id": 39768,
    "hadith_number": 2231,
    "tajuk_hadith": "Penentuan Warisan Khunsa: Berdasarkan Air Kencing",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى  ، عَنْ إِسْرَائِيلَ  ، عَنْ عَبْدِ الْأَعْلَى  : أَنَّهُ سَمِعَ مُحَمَّدَ بْنَ عَلِيٍّ  يُحَدِّثُ، عَنْ عَلِيٍّ   : فِي الرَّجُلِ يَكُونُ لَهُ مَا لِلرَّجُلِ وَمَا لِلْمَرْأَةِ مِنْ أَيِّهِمَا يُوَرَّثُ، فَقَالَ :\" مِنْ أَيِّهِمَا بَالَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ubaidullah bin Musa, daripada Israil, daripada Abdul A'la: Sesungguhnya dia mendengar Muhammad bin Ali meriwayatkan, daripada Ali: tentang seorang lelaki yang memiliki sifat lelaki dan sifat perempuan, dari mana keduanya dia mewarisi? Maka beliau bersabda: \"Dari mana keduanya dia kencing.\""
  },
  {
    "id": 39769,
    "hadith_number": 2232,
    "tajuk_hadith": "Pewarisan bagi Khuntsa (Hermafrodit)",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ  ، حَدَّثَنَا هُشَيْمٌ  ، عَنْ مُغِيرَةَ  ، عَنْ شِبَاكٍ  ، عَنْ الشَّعْبِيِّ  ، عَنْ عَلِيٍّ   فِي الْخُنْثَى، قَالَ :\" يُوَرَّثُ مِنْ قِبَلِ مَبَالِهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Bakr bin Abi Syaibah, telah menceritakan kepada kami Husyaim, dari Mughirah, dari Syibak, dari Asy-Sya'bi, dari Ali mengenai khuntsa (hermafrodit), beliau berkata: \"Ia mewarisi dari arah air kencingnya keluar.\""
  },
  {
    "id": 39770,
    "hadith_number": 2233,
    "tajuk_hadith": "Hukum Warisan Anak yang Tidak Jelas Jantina",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا أَبُو هَانِئٍ  ، قَالَ : سُئِلَ عَامِرٌ   عَنْ مَوْلُودٍ وُلِدَ، وَلَيْسَ بِذَكَرٍ، وَلَا أُنْثَى، لَيْسَ لَهُ مَا لِلذَّكَرِ، وَلَيْسَ لَهُ مَا لِلْأُنْثَى، يُخْرِجُ مِنْ سُرَّتِهِ كَهَيْئَةِ الْبَوْلِ وَالْغَائِطِ، سُئِلَ عَنْ مِيرَاثِهِ، فَقَالَ :\" نِصْفُ حَظِّ الذَّكَرِ، وَنِصْفُ حَظِّ الْأُنْثَى \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Abu Hani', dia berkata: 'Amir ditanya tentang seorang anak yang dilahirkan, yang bukan lelaki, bukan juga perempuan, tidak memiliki sifat lelaki, tidak juga sifat perempuan, keluar dari pusatnya seperti air kencing dan najis. Beliau ditanya tentang warisannya, maka beliau menjawab: \"Separuh bahagian lelaki dan separuh bahagian perempuan.\""
  },
  {
    "id": 39771,
    "hadith_number": 2234,
    "tajuk_hadith": "Pendapat Abu Bakar tentang Kalalah dan Penghormatan Umar terhadapnya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، حَدَّثَنَا عَاصِمٌ  ، عَنْ الشَّعْبِيِّ  ، قَالَ : سُئِلَ أَبُو بَكْرٍ   عَنْ الْكَلَالَةِ، فَقَالَ : \" إِنِّي سَأَقُولُ فِيهَا بِرَأْيِي، فَإِنْ كَانَ صَوَابًا فَمِنْ اللَّهِ، وَإِنْ كَانَ خَطَأً فَمِنِّي، وَمِنَ الشَّيْطَانِ : أُرَاهُمَا خَلَا الْوَالِدَ وَالْوَلَدِ \"، َفَلَمَّا اسْتُخْلِفَ عُمَرُ  ، قَالَ : إِنِّي لَأَسْتَحْيِي اللَّهَ أَنْ أَرُدَّ شَيْئًا قَالَهُ أَبُو بَكْرٍ",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah menceritakan kepada kami Asim, daripada Asy-Sya'bi, beliau berkata: Abu Bakar telah ditanya tentang *kalalah*, lalu beliau berkata: \"Sesungguhnya aku akan mengatakan tentangnya dengan pendapatku, jika ia benar maka dari Allah, dan jika ia salah maka dari diriku dan dari syaitan: Aku melihat mereka itu selain daripada ibu bapa dan anak.\" Maka ketika Umar dilantik menjadi khalifah, beliau berkata: \"Sesungguhnya aku malu kepada Allah untuk menolak sesuatu yang telah dikatakan oleh Abu Bakar.\""
  },
  {
    "id": 39772,
    "hadith_number": 2235,
    "tajuk_hadith": "Masalah Kalalah yang Membingungkan Para Sahabat",
    "perawi_melayu": "Abdullah bin Yazid, Sa'id Ibnu Abi Ayyub, Yazid bin Abi Habib, Marthad bin Abdullah al-Yazani, Uqbah bin Amir al-Juhani.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ  ، حَدَّثَنَا سَعِيدٌ هُوَ ابْنُ أَبِي أَيُّوبَ  ، قَالَ : حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ  ، عَنْ مَرْثَدِ بْنِ عَبْدِ اللَّهِ الْيَزَنِيِّ  ، عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ  ، أَنَّهُ قَالَ :\" مَا أَعْضَلَ بِأَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْءٌ مَا أَعْضَلَتْ بِهِمْ الْكَلَالَةُ \"",
    "malay_translation": "Telah meriwayatkan kepada kami Abdullah bin Yazid, telah meriwayatkan kepada kami Sa'id, iaitu Ibnu Abi Ayyub, beliau berkata: telah meriwayatkan kepada saya Yazid bin Abi Habib, daripada Marthad bin Abdullah al-Yazani, daripada Uqbah bin Amir al-Juhani, bahawa beliau berkata: \"Tidak ada sesuatu pun yang lebih mengelirukan para sahabat Rasulullah SAW selain daripada masalah kalalah.\""
  },
  {
    "id": 39773,
    "hadith_number": 2236,
    "tajuk_hadith": "Definisi Kalalah",
    "perawi_melayu": "Muhammad bin Yusuf, Sufyan, 'Amr bin Dinar, al-Hasan bin Muhammad, Ibn 'Abbas",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ عَمْرِو بْنِ دِينَارٍ  ، عَنْ الْحَسَنِ بْنِ مُحَمَّدٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ :\" الْكَلَالَةُ مَا خَلَا الْوَالِدَ وَالْوَلَدَ \"",
    "malay_translation": "Muhammad bin Yusuf meriwayatkan kepada kami, Sufyan meriwayatkan kepada kami, daripada 'Amr bin Dinar, daripada al-Hasan bin Muhammad, daripada Ibn 'Abbas, beliau berkata: \"Kalalah adalah selain daripada ibu bapa dan anak.\""
  },
  {
    "id": 39774,
    "hadith_number": 2237,
    "tajuk_hadith": "Ayat Tentang Warisan Kalalah dan Saudara Seibu",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدٌ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ يَعْلَى بْنِ عَطَاءٍ  ، عَنْ الْقَاسِمِ بْنِ عَبْدِ اللَّهِ L1584 ، عَنْ سَعْدٍ   : \" أَنَّهُ كَانَ يَقْرَأُ هَذِهِ الْآيَةَ : # وَإِنْ كَانَ رَجُلٌ يُورَثُ كَلالَةً أَو امْرَأَةٌ وَلَهُ أَخٌ أَوْ أُخْتٌ سورة النساء آية 12 #لِأُمٍّ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad, telah menceritakan kepada kami Sufyan, daripada Ya'la bin Ata', daripada al-Qasim bin Abdullah, daripada Sa'd: \"Bahawa dia pernah membaca ayat ini: '#Dan jika seorang lelaki atau perempuan meninggal dunia dalam keadaan kalalah (tidak meninggalkan anak atau bapa) dan dia mempunyai saudara lelaki atau saudara perempuan seibu...# Surah An-Nisa' ayat 12.\""
  },
  {
    "id": 39775,
    "hadith_number": 2238,
    "tajuk_hadith": "Pencarian Waris Ibn al-Dahdahah dan Penyerahan Harta kepada Saudara Ibu",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ  ، حَدَّثَنَا حَيْوَةُ  ، حَدَّثَنَا أَبُو الْأَسْوَدِ مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ  : أَنَّ عَاصِمَ بْنَ عُمَرَ بْنِ قَتَادَةَ الْأَنْصَارِيَّ  أَخْبَرَهُ : أَنَّ عُمَرَ بْنَ الْخَطَّابِ   \" الْتَمَسَ مَنْ يَرِثُ ابْنَ الدَّحْدَاحَةِ، فَلَمْ يَجِدْ وَارِثًا،فَدَفَعَ مَالَ ابْنِ الدَّحْدَاحَةِ إِلَى أَخْوَالِ ابْنِ الدَّحْدَاحَةِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abdullah bin Yazid, telah menceritakan kepada kami Haywah, telah menceritakan kepada kami Abu al-Aswad Muhammad bin Abd al-Rahman bin Nawfal: bahawa 'Asim bin Umar bin Qatadah al-Ansari mengkhabarkannya: bahawa Umar bin al-Khattab mencari seseorang yang mewarisi harta Ibn al-Dahdahah, tetapi tidak menemui waris, lalu beliau menyerahkan harta Ibn al-Dahdahah kepada saudara-saudara ibu Ibn al-Dahdahah."
  },
  {
    "id": 39776,
    "hadith_number": 2239,
    "tajuk_hadith": "Allah dan Rasul-Nya Penolong bagi yang Tiada Penolong, Bapa Saudara (Ibu) Waris bagi yang Tiada Waris",
    "perawi_melayu": "Abu 'Asim, Ibn Juraij, 'Amr bin Muslim, Tawus, Aisyah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ  ، عَنْ ابْنِ جُرَيْجٍ  ، عَنْ عَمْرِو بْنِ مُسْلِمٍ  ، عَنْ طَاوُسٍ  ، عَنْ عَائِشَةَ  ، قَالَتْ :\" اللَّهُ وَرَسُولُهُ مَوْلَى مَنْ لَا مَوْلَى لَهُ، وَالْخَالُ وَارِثُ مَنْ لَا وَارِثَ لَهُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu 'Asim, daripada Ibn Juraij, daripada 'Amr bin Muslim, daripada Tawus, daripada Aisyah, dia berkata: \"Allah dan Rasul-Nya adalah penolong bagi orang yang tidak mempunyai penolong, dan bapa saudara (dari ibu) adalah waris bagi orang yang tidak mempunyai waris.\""
  },
  {
    "id": 39777,
    "hadith_number": 2240,
    "tajuk_hadith": "Pembahagian Pusaka oleh Umar: Bapa Saudara Sebelah Ibu dan Ibu Saudara Sebelah Ibu",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ فِرَاسٍ  ، عَنْ الشَّعْبِيِّ  ، عَنْ زِيَادٍ  ، قَالَ : \" أُتِيَ عُمَرُ   فِي عَمٍّ لِأُمٍّ، وَخَالَة،فَأَعْطَى الْعَمَّ لِلْأُمِّ الثُّلُثَيْنِ، وَأَعْطَى الْخَالَةَ الثُّلُثَ \"",
    "malay_translation": "Muhammad bin Yusuf memberitahu kami, Sufyan memberitahu kami, daripada Firas, daripada al-Sha'bi, daripada Ziyad, dia berkata: \"Umar didatangi mengenai bapa saudara sebelah ibu dan ibu saudara sebelah ibu, lalu Umar memberikan bapa saudara sebelah ibu dua pertiga dan memberikan ibu saudara sebelah ibu satu pertiga.\""
  },
  {
    "id": 39778,
    "hadith_number": 2241,
    "tajuk_hadith": "Pembahagian Pusaka: Ibu Saudara Sebelah Ibu dan Bapa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ يُونُسَ  ،  عَنِ الْحَسَنِ  : أَنَّ عُمَرَ بْنَ الْخَطَّابِ  \" أَعْطَى الْخَالَةَ الثُّلُثَ، وَالْعَمَّةَ الثُّلُثَيْنِ \"",
    "malay_translation": "Muhammad bin Yusuf telah memberitahu kami, Sufyan telah meriwayatkan kepada kami, daripada Yunus, daripada al-Hasan: bahawa Umar bin al-Khattab telah memberikan satu pertiga (pusaka) kepada ibu saudara sebelah ibu (khalah), dan dua pertiga kepada ibu saudara sebelah bapa ('ammah)."
  },
  {
    "id": 39779,
    "hadith_number": 2242,
    "tajuk_hadith": "Pembahagian Pusaka: Keputusan Umar Al-Khattab tentang Ibu Saudara Sebelah Ibu dan Bapa",
    "perawi_melayu": "Perawi Tidak Diketahui",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ الْحَسَنِ بْنِ عَمْرٍو  ، عَنْ غَالِبِ بْنِ عَبَّادٍ  ، عَنْ قَيْسِ بْنِ حَبْتَرٍ النَّهْشَلِيِّ  ، قَالَ : أُتِيَ عَبْدُ الْمَلِكِ بْنُ مَرْوَانَ فِي خَالَةٍ وَعَمَّةٍ، فَقَامَ شَيْخٌ  ، فَقَالَ : شَهِدْتُ عُمَرَ بْنَ الْخَطَّابِ  \" أَعْطَى الْخَالَةَ الثُّلُثَ، وَالْعَمَّةَ الثُّلُثَيْنِ \"، قَالَ : فَهَمَّ أَنْ يَكْتُبَ بِهِ، ثُمَّ قَالَ : أَيْنَ زَيْدٌ عَنْ هَذَا",
    "malay_translation": "Muhammad bin Yusuf telah memberitahu kami, Sufyan telah menceritakan kepada kami, daripada Al-Hasan bin 'Amr, daripada Ghalib bin 'Abbad, daripada Qais bin Habtar An-Nahsyali, beliau berkata: Abdul Malik bin Marwan telah dibawa kepada kes berkaitan ibu saudara sebelah ibu dan ibu saudara sebelah bapa. Maka seorang syeikh berdiri dan berkata: Saya bersaksi bahawa Umar bin Al-Khattab telah memberikan satu pertiga (harta pusaka) kepada ibu saudara sebelah ibu dan dua pertiga kepada ibu saudara sebelah bapa. Dia berkata: Lalu beliau bercadang untuk menulis keputusan itu, kemudian beliau berkata: Mana Zaid dalam hal ini?"
  },
  {
    "id": 39780,
    "hadith_number": 2243,
    "tajuk_hadith": "Kedudukan Keluarga dalam Islam",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ مُحَمَّدِ بْنِ سَالِمٍ  ، عَنْ الشَّعْبِيِّ  ، عَنْ مَسْرُوقٍ  ، عَنْ عَبْدِ اللَّهِ   قَالَ :\" الْخَالَةُ بِمَنْزِلَةِ الْأُمِّ، وَالْعَمَّةُ بِمَنْزِلَةِ الْأَبِ، وَبِنْتُ الْأَخِ بِمَنْزِلَةِ الْأَخِ، وَكُلُّ ذِي رَحِمٍ بِمَنْزِلَةِ رَحِمِهِ الَّتِي يُدْلِي بِهَا إِذَا لَمْ يَكُنْ وَارِثٌ ذُو قَرَابَةٍ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Yusuf, telah menceritakan kepada kami Sufyan, daripada Muhammad bin Salim, daripada Asy-Sya'bi, daripada Masruq, daripada Abdullah berkata: 'Ibu saudara sebelah ibu adalah seperti ibu, dan ibu saudara sebelah bapa adalah seperti bapa, dan anak perempuan saudara lelaki adalah seperti saudara lelaki, dan setiap pemilik rahim adalah seperti rahimnya yang dia berhubung dengannya jika tidak ada waris kerabat.'"
  },
  {
    "id": 39781,
    "hadith_number": 2244,
    "tajuk_hadith": "Keputusan Umar tentang Warisan bagi Mangsa Wabak Amwas",
    "perawi_melayu": "Diriwayatkan oleh: Yazid bin Harun, Hisyam, Muhammad, Abdullah bin Utbah, Ad-Dahhak bin Qais",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَنْبَأَنَا هِشَامٌ  ، عَنْ مُحَمَّدٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ عُتْبَةَ  ، قَالَ : حَدَّثَنِي الضَّحَّاكُ بْنُ قَيْسٍ  : أَنَّ عُمَرَ   قَضَى فِي أَهْلِ طَاعُونِ عَمَوَاسَ أَنَّهُمْ كَانُواإِذَا كَانُوا مِنْ قِبَلِ الْأَبِ سَوَاءً، فَبَنُو الْأُمِّ أَحَقُّ، وَإِذَا كَانَ بَعْضُهُمْ أَقْرَبَ مِنْ بَعْضٍ بِأَبٍ، فَهُمْ أَحَقُّ بِالْمَالِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah memberitakan kepada kami Hisyam, dari Muhammad, dari Abdullah bin Utbah, dia berkata: Telah menceritakan kepadaku Ad-Dahhak bin Qais: Bahawa Umar telah memutuskan tentang orang-orang yang terkena wabak Amwas bahawa mereka jika berasal dari pihak ayah sama, maka anak-anak ibu lebih berhak, dan jika sebahagian mereka lebih dekat daripada sebahagian yang lain melalui ayah, maka mereka lebih berhak terhadap harta."
  },
  {
    "id": 39782,
    "hadith_number": 2245,
    "tajuk_hadith": "Warisan Salim Maula Abu Hudhaifah dan Arahan Umar Mengenainya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا أَبُو شِهَابٍ  ، حَدَّثَنِي أَبُو إِسْحَاق الشَّيْبَانِيُّ  ، عَنْ عُبَيْدِ بْنِ أَبِي الْجَعْدِ  ، عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادِ بْنِ الْهَادِ  ، قَالَ : أُصِيبَ سَالِمٌ مَوْلَى أَبِي حُذَيْفَةَ يَوْمَ الْيَمَامَة، فَبَلَغَ مِيرَاثُهُ مِائَتَيْ دِرْهَمٍ، فَقَالَ عُمَرُ   :\" احْبِسُوهَا عَلَى أُمِّهِ حَتَّى تَأْتِيَ عَلَى آخِرِهَا \"",
    "malay_translation": "Telah meriwayatkan kepada kami Ahmad bin Abdullah, telah meriwayatkan kepada kami Abu Syihab, telah meriwayatkan kepada saya Abu Ishaq al-Syaibani, daripada Ubaid bin Abi al-Ja'd, daripada Abdullah bin Shaddad bin al-Had, beliau berkata: Salim, hamba sahaya Abu Hudhaifah, telah cedera pada Perang Yamamah, dan harta peninggalannya berjumlah dua ratus dirham. Umar berkata: \"Simpanlah harta ini untuk ibunya sehingga habis.\""
  },
  {
    "id": 39783,
    "hadith_number": 2246,
    "tajuk_hadith": "Hukum Warisan antara Saudara Seibu Sebapa dan Seayah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا زُهَيْرٌ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ الْحَارِثِ  ، عَنْ عَلِيٍّ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" الْإِخْوَةُ مِنْ الْأُمِّ يَتَوَارَثُونَ دُونَ بَنِي الْعَلَّاتِ، يَرِثُ الرَّجُلُ أَخَاهُ لِأَبِيهِ وَأُمِّهِ، دُونَ أَخِيهِ لِأَبِيهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Zuhair, daripada Abu Ishaq, daripada al-Harith, daripada Ali, daripada Nabi ﷺ, baginda bersabda: \"Saudara-saudara dari ibu saling mewarisi antara satu sama lain dan tidak saudara seayah. Seseorang lelaki mewarisi saudaranya yang seibu sebapa, dan tidak mewarisi saudaranya yang sebapa sahaja.\""
  },
  {
    "id": 39784,
    "hadith_number": 2247,
    "tajuk_hadith": "Hukum Waris bagi Cucu dari Anak Perempuan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَهْلُ بْنُ حَمَّادٍ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ النُّعْمَانِ بْنِ سَالِمٍ  ، قَالَ : قُلْتُ لِابْنِ عُمَرَ   : \" أَرَأَيْتَرَجُلًا تَرَكَ ابْنَ ابْنَتِهِ، أَيَرِثُهُ؟ قَالَ : لا \"",
    "malay_translation": "Telah menceritakan kepada kami Sahl bin Hammad, telah menceritakan kepada kami Syu'bah, dari Nu'man bin Salim, dia berkata: Aku berkata kepada Ibn Umar: 'Bagaimana pendapatmu tentang seorang lelaki yang meninggalkan anak dari anak perempuannya, apakah dia mewarisinya?' Beliau berkata: 'Tidak.'"
  },
  {
    "id": 39785,
    "hadith_number": 2248,
    "tajuk_hadith": "Ibu dan Saudara Perempuan Sebagai 'Asabah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْلَى  ، حَدَّثَنَا الْأَعْمَشُ  ، عَنْ إِبْرَاهِيمَ  ، قَالَ : قَالَ عَبْدُ اللَّهِ   :\" الْأُمُّ عَصَبَةُ مَنْ لَا عَصَبَةَ لَهُ، وَالْأُخْتُ عَصَبَةُ مَنْ لَا عَصَبَةَ لَهُ \"",
    "malay_translation": "Ya'la telah meriwayatkan kepada kami, al-A'mash telah meriwayatkan kepada kami, daripada Ibrahim, dia berkata: Abdullah berkata: 'Ibu adalah 'asabah bagi sesiapa yang tidak mempunyai 'asabah, dan saudara perempuan adalah 'asabah bagi sesiapa yang tidak mempunyai 'asabah.'"
  },
  {
    "id": 39786,
    "hadith_number": 2249,
    "tajuk_hadith": "Faraidh: Pembahagian Harta Pusaka dan Keutamaan Lelaki Terdekat",
    "perawi_melayu": "Muslim bin Ibrahim, Wuhaib, Ibn Tawus, daripada Ayahnya, daripada Ibn Abbas",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا وُهَيْبٌ  ، حَدَّثَنَا ابْنُ طَاوُسٍ  ، عَنْ أَبِيهِ  ، عَنْ ابْنِ عَبَّاسٍ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا، فَمَا بَقِي، فَهُوَ لِأَوْلَى رَجُلٍ ذَكَرٍ \"",
    "malay_translation": "Telah menceritakan kepada kami Muslim bin Ibrahim, telah menceritakan kepada kami Wuhaib, telah menceritakan kepada kami Ibn Tawus, daripada ayahnya, daripada Ibn Abbas, daripada Nabi SAW, baginda bersabda: \"Berikanlah bahagian faraidh (harta pusaka) kepada mereka yang berhak menerimanya. Maka apa yang masih tersisa, ia adalah hak bagi lelaki yang paling utama (kerabat terdekat).\""
  },
  {
    "id": 39787,
    "hadith_number": 2250,
    "tajuk_hadith": "Warisan untuk Wanita Yahudi",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، حَدَّثَنَا يَحْيَى  : أَنَّ سُلَيْمَانَ بْنَ يَسَارٍ  أَخْبَرَهُ، عَنْ مُحَمَّدِ بْنِ الْأَشْعَثِ  : أَنَّ عَمَّةً لَهُ تُوُفِّيَتْ يَهُودِيَّةً بِالْيَمَنِ ، فَذَكَرَ ذَلِكَ لِعُمَرَ بْنِ الْخَطَّابِ   فَقَالَ :\" يَرِثُهَا أَقْرَبُ النَّاسِ إِلَيْهَا مِنْ أَهْلِ دِينِهَا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah menceritakan kepada kami Yahya: Bahawa Sulaiman bin Yasar telah mengkhabarkannya, daripada Muhammad bin al-Asy'ath: Bahawa seorang bibi baginya meninggal dunia dalam keadaan Yahudi di Yaman, lalu perkara itu disebutkan kepada Umar bin al-Khattab, lalu beliau berkata: “Dia diwarisi oleh orang yang paling dekat dengannya dari kalangan ahli agamanya.”"
  },
  {
    "id": 39788,
    "hadith_number": 2251,
    "tajuk_hadith": "Hukum Warisan bagi Wanita Yahudi",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ قَيْسِ بْنِ مُسْلِمٍ  ، عَنْ طَارِقِ بْنِ شِهَابٍ  ، قَالَ : مَاتَتْ عَمَّةُ الْأَشْعَثِ بْنِ قَيْسٍ وَهِيَ يَهُودِيَّة، فَأَتَى عُمَرَ بْنَ الْخَطَّاب  ، فَقَالَ :\" أَهْلُ دِينِهَا يَرِثُونَهَا \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Yusuf, telah menceritakan kepada kami Sufyan, daripada Qais bin Muslim, daripada Tariq bin Shihab, dia berkata: Bibi al-Asy'ath bin Qais meninggal dunia dan dia seorang Yahudi. Lalu dia datang kepada Umar bin al-Khattab dan berkata: \"Adakah ahli agamanya mewarisinya?\""
  },
  {
    "id": 39789,
    "hadith_number": 2252,
    "tajuk_hadith": "Ahli Syirik Tidak Mewarisi dan Tidak Diwarisi",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ حَمَّادٍ  ، عَنْ إِبْرَاهِيمَ  ، قَالَ : قَالَ عُمَرُ بْنُ الْخَطَّابِ   :\" أَهْلُ الشِّرْكِ لَا نَرِثُهُمْ، وَلَا يَرِثُونَا \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Yusuf, telah menceritakan kepada kami Sufyan, dari Hammad, dari Ibrahim, dia berkata: Umar bin al-Khattab berkata: \"Ahli syirik tidak mewarisi kami, dan kami tidak mewarisi mereka.\""
  },
  {
    "id": 39790,
    "hadith_number": 2253,
    "tajuk_hadith": "Tiada Pewarisan Harta antara Penganut Agama Berbeza",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا حَسَنٌ  ، عَنْ عِيسَى الْخياط  ، عَنْ الشَّعْبِيِّ   : \" أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَأَبَا بَكْرٍ، وَعُمَرَ، قَالُوا :لَا يَتَوَارَثُ أَهْلُ دِينَيْنِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Hasan, dari 'Isa al-Khayyat, dari al-Sha'bi: \"Bahawa Rasulullah SAW, Abu Bakar, dan Umar berkata: \"Tidak saling mewarisi antara penganut dua agama yang berbeza.\""
  },
  {
    "id": 39791,
    "hadith_number": 2254,
    "tajuk_hadith": "Tiada Pewarisan Harta antara Penganut Agama Berbeza",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا زُهَيْرٌ  ، عَنْ مُطَرِّفٍ  ، عَنْ عَامِرٍ  ، عَنْ عُمَرَ  ، قَالَ :\" لَا يَتَوَارَثُ أَهْلُ مِلَّتَيْنِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Zuhair, daripada Mutarrif, daripada Amir, daripada Umar, beliau berkata: \"Tidak saling mewarisi antara penganut dua agama yang berbeza.\""
  },
  {
    "id": 39792,
    "hadith_number": 2255,
    "tajuk_hadith": "Tidak Mewarisi Ahli Kitab Kecuali Hamba",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا شَرِيكٌ  ، عَنْ الْأَشْعَثِ  ، عَنْ الْحَسَنِ  ، عَنْ جَابِرٍ  ، قَالَ :\" لَا نَرِثُ أَهْلَ الْكِتَابِ وَلَا يَرِثُونَا، إِلَّا أَنْ يَمُوتَ لِلرَّجُلِ عَبْدُهُ أَوْ أَمَتُهُ \"",
    "malay_translation": "Abu Nu'aim telah memberitahu kami, Syarik telah menceritakan kepada kami, daripada al-Asy'ath, daripada al-Hasan, daripada Jabir, beliau berkata: \"Kami tidak mewarisi Ahli Kitab dan mereka tidak mewarisi kami, kecuali jika seorang lelaki meninggal dunia dan meninggalkan hamba lelaki atau hamba perempuannya.\""
  },
  {
    "id": 39793,
    "hadith_number": 2256,
    "tajuk_hadith": "Tidak Mewarisi Ahli Kitab Kecuali Hamba Sahaya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى  ، حَدَّثَنَا شَرِيكٌ  ، عَنْ الْأَشْعَثِ  ، عَنْ الْحَسَنِ  ، عَنْ جَابِرٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَا نَرِثُ أَهْلَ الْكِتَابِ وَلَا يَرِثُونَا، إِلَّا الرَّجُلُ يَرِثُ عَبْدَهُ، أَوْ أَمَتَهُ \"",
    "malay_translation": "Muhammad bin Isa meriwayatkan kepada kami, Syarik meriwayatkan kepada kami, daripada al-Asy'ath, daripada al-Hasan, daripada Jabir, dia berkata: Rasulullah ﷺ bersabda: \"Kita tidak mewarisi Ahli Kitab dan mereka tidak mewarisi kita, kecuali seorang lelaki mewarisi hambanya, atau amahnya.\""
  },
  {
    "id": 39794,
    "hadith_number": 2257,
    "tajuk_hadith": "Warisan antara Muslim dan Kafir",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ دَاوُدَ  ، عَنْ الشَّعْبِيِّ  ، عَنْ مَسْرُوقٍ  ، قَالَ : \" كَانَ مُعَاوِيَةُ  يُوَرِّثُ الْمُسْلِمَ مِنْ الْكَافِرِ، وَلَا يُوَرِّثُ الْكَافِرَ مِنْ الْمُسْلِمِ، قَالَ : قَالَ مَسْرُوقٌ : وَمَا حَدَثَ فِي الْإِسْلَامِ قَضَاءٌ أَحَبُّ إِلَيَّ مِنْهُ، قِيلَ لِأَبِي مُحَمَّدٍ : تَقُولُ بِهَذَا؟ قَالَ : لا",
    "malay_translation": "Telah meriwayatkan kepada kami Sulaiman bin Harb, telah meriwayatkan kepada kami Hammad bin Salamah, daripada Dawud, daripada al-Sha'bi, daripada Masruq, beliau berkata: \"Mu'awiyah pernah mewariskan harta seorang Muslim daripada orang kafir, tetapi tidak mewariskan harta orang kafir kepada seorang Muslim.\" Masruq berkata: \"Tidak ada keputusan dalam Islam yang lebih saya sukai daripada keputusan ini.\" Ditanyakan kepada Abu Muhammad: \"Adakah kamu berpendapat demikian?\" Beliau menjawab: \"Tidak.\""
  },
  {
    "id": 39795,
    "hadith_number": 2258,
    "tajuk_hadith": "Tiada Warisan antara Dua Agama Berbeza",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ  ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ  ، عَنْ عَامِرٍ  : أَنَّ الْمُعْزِلَةَ بِنْتَ الْحَارِثِ تُوُفِّيَتْ بِالْيَمَنِ وَهِيَ يَهُودِيَّةٌ، فَرَكِبَ الْأَشْعَثُ بْنُ قَيْسٍ، وَكَانَتْ عَمَّتَهُ، إِلَى عُمَرَ فِي مِيرَاثِهَا، فَقَالَ عُمَرُ   : \" لَيْسَ ذَاكَ لَكَ،يَرِثُهَا أَقْرَبُ النَّاسِ مِنْهَا مِنْ أَهْلِ دِينِهَا، لَا يَتَوَارَثُ مِلَّتَانِ \"",
    "malay_translation": "Telah menceritakan kepada kami Yazid bin Harun, daripada Daud bin Abi Hind, daripada Amir: Bahawa Al-Mu'zilah binti al-Harith meninggal dunia di Yaman dan dia seorang Yahudi. Maka Al-Asy'ath bin Qais, yang merupakan bapa saudara perempuannya, pergi menemui Umar berkenaan warisannya. Umar berkata: \"Itu bukan untuk kamu. Yang mewarisinya adalah orang yang paling dekat dengannya dari kalangan ahli agamanya. Dua agama tidak saling mewarisi.\""
  },
  {
    "id": 39796,
    "hadith_number": 2259,
    "tajuk_hadith": "Tiada Pewarisan Harta Pusaka Antara Dua Agama Berbeza",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، حَدَّثَنَا أَنَسُ بْنُ سِيرِينَ  ، قَالَ : قَالَ عُمَرُ بْنُ الْخَطَّابِ   :\" لَا يَتَوَارَثُ مِلَّتَانِ شَتَّى، وَلَا يَحْجُبُ مَنْ لَا يَرِثُ \"",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Hammad bin Zaid, telah menceritakan kepada kami Anas bin Sirin, dia berkata: Umar bin al-Khattab r.a. berkata: \"Dua agama yang berbeza tidak saling mewarisi, dan tidak menghalang orang yang tidak berhak mewarisi.\""
  },
  {
    "id": 39797,
    "hadith_number": 2260,
    "tajuk_hadith": "Hukum Waris antara Muslim dan Kafir: Seorang Muslim Tidak Mewarisi Orang Kafir, dan Orang Kafir Tidak Mewarisi Orang Muslim",
    "perawi_melayu": "Nasr bin Ali, Abdul A'la, Ma'mar, Az-Zuhri, Ali bin Husain, Amru bin Uthman, Usamah bin Zaid",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ  ، حَدَّثَنَا عَبْدُ الْأَعْلَى  ، عَنْ مَعْمَرٍ  ، عَنْ الزُّهْرِيِّ  ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ  ، عَنْ عَمْرِو بْنِ عُثْمَانَ  ، عَنْ أُسَامَةَ بْنِ زَيْدٍ   أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" لَا يَرِثُ الْمُسْلِمُ الْكَافِرَ، وَلَا الْكَافِرُ الْمُسْلِمَ \"",
    "malay_translation": "Telah menceritakan kepada kami Nasr bin Ali, telah menceritakan kepada kami Abdul A'la, dari Ma'mar, dari Az-Zuhri, dari Ali bin Husain, dari Amru bin Uthman, dari Usamah bin Zaid, bahawa Rasulullah SAW bersabda: \"Seorang Muslim tidak mewarisi orang kafir, dan orang kafir tidak mewarisi orang Muslim.\""
  },
  {
    "id": 39798,
    "hadith_number": 2261,
    "tajuk_hadith": "Hak Waris dan Pembahagian Harta Pusaka Selepas Kematian",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ ، عَنْ سَعِيدٍ ، عَنْ أَبِي مَعْشَرٍ ،  عَنْ إِبْرَاهِيمَ ، قَالَ :\" إِذَا مَاتَ الْمَيِّتُ وَجَبَتْ الْحُقُوقُ لِأَهْلِهَا، وَلَمْ يَجْعَلْ لِمَنْ أَسْلَمَ أَوْ أُعْتِقَ قَبْلَ أَنْ يُقْسَمَ الْمِيرَاثُ شَيْئًا \"",
    "malay_translation": "Telah menceritakan kepada kami Ja'far bin Aun, daripada Sa'id, daripada Abi Ma'shar, daripada Ibrahim, dia berkata: \"Apabila seseorang meninggal dunia, hak-hak (hutang) menjadi wajib bagi ahli warisnya, dan tidak diperuntukkan bagi sesiapa yang memeluk Islam atau dimerdekakan sebelum harta pusaka dibahagikan, sedikit pun.\""
  },
  {
    "id": 39799,
    "hadith_number": 2262,
    "tajuk_hadith": "Tidak Mewarisi antara Muslim dan Kafir",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى  ، عَنْ الزُّهْرِيِّ  ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ  ، عَنْ أُسَامَةَ بْنِ زَيْدٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَا يَرِثُ الْمُسْلِمُ الْكَافِرَ، وَلَا الْكَافِرُ الْمُسْلِمَ \"",
    "malay_translation": "Muhammad bin Yusuf telah memberitahu kami, Sufyan telah menceritakan kepada kami, daripada Abdullah bin Isa, daripada al-Zuhri, daripada Ali bin Husain, daripada Usamah bin Zaid, beliau berkata: Rasulullah SAW bersabda: \"Seorang Muslim tidak mewarisi orang kafir, dan orang kafir tidak mewarisi orang Muslim.\""
  },
  {
    "id": 39800,
    "hadith_number": 2263,
    "tajuk_hadith": "Larangan Warisan antara Muslim dan Kafir",
    "perawi_melayu": "Amru bin Aun, Sufyan, Az-Zuhri, Ali bin Husain, Amru bin Uthman, Usamah bin Zaid",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ الزُّهْرِيِّ  ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ  ، عَنْ عَمْرِو بْنِ عُثْمَانَ  ، عَنْ أُسَامَةَ بْنِ زَيْدٍ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" لَا يَرِثُ الْمُسْلِمُ الْكَافِرَ، وَلَا الْكَافِرُ الْمُسْلِمَ \"",
    "malay_translation": "Telah menceritakan kepada kami Amru bin Aun, telah menceritakan kepada kami Sufyan, dari Az-Zuhri, dari Ali bin Husain, dari Amru bin Uthman, dari Usamah bin Zaid, dari Nabi ﷺ, baginda bersabda: \"Seorang Muslim tidak mewarisi orang kafir, dan orang kafir tidak mewarisi orang Muslim.\""
  },
  {
    "id": 39801,
    "hadith_number": 2264,
    "tajuk_hadith": "Mukatab dan Warisan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ ، حَدَّثَنَا أَبُو عَوَانَةَ ، عَنْ مُغِيرَةَ ،  عَنْ إِبْرَاهِيمَ ، قَالَ :\" لَيْسَ لِلْمُكَاتَبِ مِيرَاثٌ، مَا بَقِيَ عَلَيْهِ شَيْءٌ مِنْ مُكَاتَبَتِهِ \"",
    "malay_translation": "Abu Nu'man meriwayatkan kepada kami, Abu 'Awanah meriwayatkan kepada kami, daripada Mughirah, daripada Ibrahim, beliau berkata: 'Tidak ada warisan bagi seorang *mukatab* (hamba yang membuat perjanjian pembebasan) selagi masih ada baki daripada perjanjian pembebasannya.'"
  },
  {
    "id": 39802,
    "hadith_number": 2265,
    "tajuk_hadith": "Hukum Waris Anak yang Dibebaskan Sebahagian",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْلَى  ، حَدَّثَنَا عَبْدُ الْمَلِكِ  ، عَنْ عَطَاءٍ   : \" فِي رَجُلٍ لَهُ بَنُونَ قَدْ أَعْتَقَ مِنْ بَعْضِهِمْ النِّصْفَ، وَمِنْ بَعْضٍ الثُّلُثَ، وَمِنْ بَعْضٍ الرُّبُعَ، قَالَ :لَا يَرِثُونَ حَتَّى يُعْتَقُوا \"",
    "malay_translation": "Telah menceritakan kepada kami Ya'la, telah menceritakan kepada kami Abdul Malik, daripada 'Ata': \"Mengenai seorang lelaki yang mempunyai anak-anak lelaki, dan dia telah memerdekakan sebahagian daripada mereka separuh, dan sebahagian yang lain satu pertiga, dan sebahagian yang lain satu perempat. Dia berkata: Mereka tidak mewarisi sehingga mereka dimerdekakan sepenuhnya.\""
  },
  {
    "id": 39803,
    "hadith_number": 2266,
    "tajuk_hadith": "Hukum Membeli Anak Semasa Sakit dan Kaitannya dengan Warisan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عبد الله بن جعفر الرقي ، وَسَعِيدُ بْنُ الْمُغِيرَةِ ، عَنْ ابْنِ الْمُبَارَكِ ، عَنْ مَعْمَرٍ ، عَنْ حَمَّادٍ ، عَنْ إِبْرَاهِيمَ  : \" فِي رَجُلٍ اشْتَرَى ابْنَهُ فِي مَرَضِهِ، قَالَ :إِنْ خَرَجَ مِنْ الثُّلُثِ وَرِثَهُ، وَإِنْ وَقَعَتْ عَلَيْهِ السِّعَايَةُ لَمْ يَرِثْ \"",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Ja'far ar-Raqi, dan Sa'id bin al-Mughirah, daripada Ibn al-Mubarak, daripada Ma'mar, daripada Hammad, daripada Ibrahim: \"Mengenai seorang lelaki yang membeli anaknya semasa sakit, dia berkata: Jika ia keluar dari satu pertiga (harta), dia mewarisinya, dan jika ia dikenakan sa'ayah (usaha mencari nafkah), dia tidak mewarisinya.\""
  },
  {
    "id": 39804,
    "hadith_number": 2267,
    "tajuk_hadith": "Hukuman Bagi Mukatab Adalah Seperti Hamba Sehingga Dibebaskan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ ، حَدَّثَنَا حَسَنٌ ، عَنْ أَبِيهِ ، عَنْ الشَّعْبِيِّ ، قَالَ :\" حَدُّ الْمُكَاتَبِ حَدُّ الْمَمْلُوكِ، حَتَّى يُعْتَقَ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Hasan, daripada ayahnya, daripada Asy-Sya'bi, dia berkata: \"Hukuman bagi seorang mukatab adalah hukuman bagi seorang hamba, sehingga dia dibebaskan.\""
  },
  {
    "id": 39805,
    "hadith_number": 2268,
    "tajuk_hadith": "Mawla: Saudara dalam Agama dan Pewarisan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى  ، حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ  ، حَدَّثَنَا يُونُسُ  ، عَنْ الزُّهْرِيِّ  ، قَالَ : قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" الْمَوْلَى أَخٌ فِي الدِّينِ وَنِعْمَةٌ، أَحَقُّ النَّاسِ بِمِيرَاثِهِ أَقْرَبُهُمْ مِنْ الْمُعْتِقِ \"",
    "malay_translation": "Muhammad bin Isa meriwayatkan kepada kami, Said bin Abdul Rahman meriwayatkan kepada kami, Yunus meriwayatkan kepada kami, daripada al-Zuhri, dia berkata: Nabi صلى الله عليه وسلم bersabda: 'Mawla adalah saudara dalam agama dan nikmat, orang yang paling berhak mewarisinya adalah yang paling dekat dengan orang yang memerdekakannya.'"
  },
  {
    "id": 39806,
    "hadith_number": 2269,
    "tajuk_hadith": "Harta Pusaka untuk Anak Selepas Pembebasan Hamba",
    "perawi_melayu": "Muhammad bin Isa, Hushaim, Mansur, Al-Hasan, Muhammad bin Salim, Asy-Sya'bi",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى ، حَدَّثَنَا هُشَيْمٌ ، حدثنا مَنْصُورٌ ، عَنْ الْحَسَنِ ، وَمُحَمَّدُ بْنُ سَالِمٍ ، عَنْ الشَّعْبِيِّ  فِي رَجُلٍ أَعْتَقَ مَمْلُوكًا، ثُمَّ مَاتَ الْمَوْلَى وَالْمَمْلُوكُ، وَتَرَكَ الْمُعْتِقُ أَبَاهُ وَابْنَهُ، قَالَا :\" الْمَالُ لِلِابْنِ \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Isa, telah menceritakan kepada kami Hushaim, telah menceritakan kepada kami Mansur, daripada Al-Hasan, dan Muhammad bin Salim, daripada Asy-Sya'bi mengenai seorang lelaki yang memerdekakan seorang hamba, kemudian tuan dan hamba itu meninggal dunia, dan orang yang memerdekakan itu meninggalkan ayah dan anaknya. Mereka berdua berkata: \"Harta itu adalah untuk anak.\""
  },
  {
    "id": 39807,
    "hadith_number": 2270,
    "tajuk_hadith": "Hak Perwalian Bagi Anak Cucu Lelaki",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى  ، حَدَّثَنَا عَبَّادٌ  ، عَنْ عُمَرَ بْنِ عَامِرٍ  ، عَنْ قَتَادَةَ  ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ  ، عَنْ زَيْدِ بْنِ ثَابِتٍ   فِي رَجُلٍ تَرَكَ أَبَاهُ وَابْنَ ابْنِهِ، فَقَالَ :\" الْوَلَاءُ لِابْنِ الِابْنِ \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Isa, telah menceritakan kepada kami Abbad, dari 'Umar bin 'Amir, dari Qatadah, dari Sa'id bin al-Musayyib, dari Zaid bin Thabit mengenai seorang lelaki yang meninggalkan bapanya dan anak cucunya, maka beliau bersabda: \"Wala' (hak perwalian) adalah untuk anak cucu lelaki.\""
  },
  {
    "id": 39808,
    "hadith_number": 2271,
    "tajuk_hadith": "Warisan Hamba yang Dimedekakan adalah untuk Anak Lelaki Wanita yang Memerdekakannya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى  ، حَدَّثَنَا مُعَمَّرٌ  ، حَدَّثَنَا خُصَيْفٌ  ، عَنْ زِيَادِ بْنِ أَبِي مَرْيَمَ   : أَنَّ امْرَأَةً أَعْتَقَتْ عَبْدًا لَهَا، ثُمَّ تُوُفِّيَتْ وَتَرَكَتْ ابْنَهَا وَأَخَاهَا، ثُمَّ تُوُفِّيَ مَوْلَاهَا، فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ابْنُ الْمَرْأَةِ وَأَخُوهَا فِي مِيرَاثِهِ، فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مِيرَاثُهُ لِابْنِ الْمَرْأَةِ، فَقَالَ أَخُوهَا : يَا رَسُولَ اللَّه، ِلَوْ أَنَّهُ جَرَّ جَرِيرَةً، عَلَى مَنْ كَانَتْ؟ قَالَ : عَلَيْكَ \"",
    "malay_translation": "Telah meriwayatkan kepada kami Muhammad bin Isa, telah meriwayatkan kepada kami Mu'ammar, telah meriwayatkan kepada kami Khusaif, daripada Ziyad bin Abi Maryam: Bahawasanya seorang wanita memerdekakan seorang hamba sahayanya, kemudian dia meninggal dunia dan meninggalkan seorang anak lelaki dan saudara lelakinya. Kemudian hamba yang dimerdekakan itu juga meninggal dunia. Maka datanglah anak lelaki wanita itu dan saudara lelakinya kepada Nabi صلى الله عليه وسلم untuk membincangkan tentang harta pusaka hamba yang dimerdekakan itu. Nabi صلى الله عليه وسلم bersabda: \"Harta pusaka hamba itu adalah untuk anak lelaki wanita tersebut.\"  Saudara lelaki wanita itu berkata: \"Wahai Rasulullah, sekiranya dia melakukan suatu jenayah, siapakah yang bertanggungjawab?\" Baginda bersabda: \"Kamu.\""
  },
  {
    "id": 39809,
    "hadith_number": 2272,
    "tajuk_hadith": "Pembahagian Harta Pusaka Hamba yang Dimerdekakan yang Meninggalkan Waris",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّلْتِ ، حَدَّثَنَا هُشَيْمٌ ، أَخْبَرَنَا مُغِيرَةُ ، قَالَ : سَأَلْتُ إِبْرَاهِيمَ  \" عَنْ رَجُلٍ أَعْتَقَ مَمْلُوكًا لَهُ، فَمَاتَ وَمَاتَ الْمَوْلَى، فَتَرَكَ الْمُعْتِقُ أَبَاهُ وَابْنَهُ، فَقَالَ لِأَبِيهِ :كَذَا، وَمَا بَقِيَ فَلِابْنِهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin As-Salt, telah menceritakan kepada kami Husyaim, telah mengkhabarkan kepada kami Mughirah, dia berkata: Saya bertanya kepada Ibrahim tentang seorang lelaki yang memerdekakan seorang hamba miliknya, kemudian hamba itu meninggal dunia dan tuan yang memerdekakannya juga meninggal dunia. Hamba yang dimerdekakan itu meninggalkan bapa dan anaknya. Maka Ibrahim berkata (berkenaan harta pusaka): 'Untuk bapanya sekian,' dan bakinya adalah untuk anaknya."
  },
  {
    "id": 39810,
    "hadith_number": 2273,
    "tajuk_hadith": "Kenyataan Tentang Anak Lelaki",
    "perawi_melayu": "Perawi Tidak Diketahui",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّلْتِ  ، حَدَّثَنَا هُشَيْمٌ  ، عَنْ شُعْبَةَ  قَالَ : سَمِعْتُ الْحَكَمَ  ، وَحَمَّادًا   ، يَقُولَانِ :\" هُوَ لِلِابْنِ \"",
    "malay_translation": "Muhammad bin al-Salt telah meriwayatkan kepada kami, Hushaim telah meriwayatkan kepada kami, daripada Syu'bah, beliau berkata: Saya mendengar al-Hakam dan Hammad, kedua-duanya berkata: 'Ia adalah untuk anak lelaki.'"
  },
  {
    "id": 39811,
    "hadith_number": 2274,
    "tajuk_hadith": "Hukum Memerdekakan Hamba dan Hubungan Persahabatan Dengannya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَنْبَأَنَا الْأَشْعَثُ  ، عَنْ الْحَسَن   \" : أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \" خَرَجَ إِلَى الْبَقِيعِ ، فَرَأَى رَجُلًا يُبَاعُ، فَأَتَاهُ فَسَاوَمَ بِهِ، ثُمَّ تَرَكَهُ فَرَآهُ رَجُلٌ فَاشْتَرَاهُ فَأَعْتَقَهُ، ثُمَّ جَاءَ بِهِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ : إِنِّي اشْتَرَيْتُ هَذَا فَأَعْتَقْتُهُ، فَمَا تَرَى فِيهِ؟ فَقَالَ :هُوَ أَخُوكَ وَمَوْلَاكَ، قَالَ : مَا تَرَى فِي صُحْبَتِهِ؟ قَالَ : إِنْ شَكَرَكَ فَهُوَ خَيْرٌ لَهُ وَشَرٌّ لَكَ، وَإِنْ كَفَرَكَ فَهُوَ خَيْرٌ لَكَ وَشَرٌّ لَهُ، قَالَ : مَا تَرَى فِي مَالِهِ؟ قَالَ : إِنْ مَاتَ وَلَمْ يَتْرُكْ عَصَبَةً فَأَنْتَ وَارِثُهُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah memberitakan kepada kami Al-Asy'ath, daripada Al-Hasan: \"Bahawa Nabi صلى الله عليه وسلم keluar ke Baqi', lalu melihat seorang lelaki dijual. Baginda mendatanginya dan menawar harga dengannya, kemudian meninggalkannya. Lalu seorang lelaki melihatnya dan membelinya serta memerdekakannya. Kemudian dia datang dengannya kepada Nabi صلى الله عليه وسلم dan berkata: 'Sesungguhnya aku telah membeli orang ini dan memerdekakannya, apa pendapatmu tentang hal ini?' Baginda bersabda: 'Dia adalah saudaramu dan hamba yang dimerdekakanmu.' Dia berkata: 'Apa pendapatmu tentang persahabatannya?' Baginda bersabda: 'Jika dia bersyukur kepadamu, maka itu adalah kebaikan baginya dan keburukan bagimu, dan jika dia tidak bersyukur kepadamu, maka itu adalah kebaikan bagimu dan keburukan baginya.' Dia berkata: 'Apa pendapatmu tentang hartanya?' Baginda bersabda: 'Jika dia mati dan tidak meninggalkan ahli waris 'asabah, maka engkau adalah pewarisnya.'\""
  },
  {
    "id": 39812,
    "hadith_number": 2275,
    "tajuk_hadith": "Pembahagian Harta Pusaka Hamba yang Dimedekakan Antara Anak Perempuan dan Tuan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَنْبَأَنَا أَشْعَثُ  ، عَنْ الْحَكَمِ  ، وَسَلَمَةَ بْنِ كُهَيْلٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ   : أَنَّ ابْنَةَ حَمْزَةَ أَعْتَقَتْ عَبْدًا لَهَا، فَمَاتَ وَتَرَكَ ابْنَتَهُ وَمَوْلَاتَهُ بِنْتَ حَمْزَةَ ، \"فَقَسَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِيرَاثَهُ بَيْنَ ابْنَتِهِ وَمَوْلَاتِهِ بِنْتِ حَمْزَةَ نِصْفَيْنِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah memberitakan kepada kami Asy'ath, daripada al-Hakam, dan Salamah bin Kuhail, daripada Abdullah bin Syaddad: Bahawa anak perempuan Hamzah memerdekakan seorang hamba miliknya, lalu hamba itu meninggal dunia dan meninggalkan seorang anak perempuan dan tuannya, iaitu anak perempuan Hamzah. \"Maka Rasulullah SAW membahagikan harta pusakanya antara anak perempuannya dan tuannya, iaitu anak perempuan Hamzah, kepada dua bahagian.\""
  },
  {
    "id": 39813,
    "hadith_number": 2276,
    "tajuk_hadith": "Pembahagian Pusaka: Anak Perempuan dan Hamba yang Dibebaskan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ  ، عَنْ عَلِيِّ بْنِ مُسْهِرٍ  ، عَنْ الشَّيْبَانِيِّ  ، عَنْ الْحَكَمِ  ، عَنْ شَمُوسَ الْكِنْدِيَّةِ L1465 ، قَالَتْ : \" قَاضَيْتُ إِلَى عَلِيٍّ   فِي أَبٍ مَاتَ فَلَمْ يَدَعْ أَحَدًا غَيْرِي، وَمَوْلَاهُ،فَأَعْطَانِي النِّصْفَ، َوَأَعْطَى مَوْلَاهُ النِّصْفَ \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Uyainah, daripada Ali bin Mushir, daripada Asy-Syaibani, daripada Al-Hakam, daripada Syamus Al-Kindiyyah, beliau berkata: \"Saya telah mengadu kepada Ali tentang seorang bapa yang meninggal dunia dan tidak meninggalkan seorang pun kecuali saya dan bekas hambanya. Lalu beliau (Ali) memberikan saya separuh (pusaka) dan memberikan bekas hambanya separuh (pusaka) yang lain.\""
  },
  {
    "id": 39814,
    "hadith_number": 2277,
    "tajuk_hadith": "Pembahagian Pusaka Sama Rata untuk Anak Perempuan dan Hamba",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ  ، عَنْ عَلِيِّ بْنِ مُسْهِرٍ  ، عَنْ ابْنِ أَبِي لَيْلَى  ، عَنْ الْحَكَمِ  ، عَنْ أَبِي الْكَنُودِ  ، عَنْ عَلِيٍّ   : \" أَنَّهُ أُتِيَ بِابْنَةٍ وَمَوْلًى،فَأَعْطَى الِابْنَةَ النِّصْفَ، وَالْمَوْلَى النِّصْفَ، قَالَ الْحَكَمُ : فَمَنْزِلِي هَذَا نَصِيبُ الْمَوْلَى الَّذِي وَرِثَهُ عَنْ مَوْلَاهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Uyaynah, daripada Ali bin Mushir, daripada Ibn Abi Layla, daripada al-Hakam, daripada Abi al-Kanud, daripada Ali RA: \"Bahawasanya beliau telah didatangi dengan seorang anak perempuan dan seorang hamba. Lalu beliau memberikan anak perempuan itu separuh (harta pusaka), dan hamba itu separuh (harta pusaka). Al-Hakam berkata: \"Rumahku ini adalah bahagian hamba yang mewarisinya daripada tuannya.\""
  },
  {
    "id": 39815,
    "hadith_number": 2278,
    "tajuk_hadith": "Pembahagian Harta Pusaka kepada Anak Perempuan dan Mawali",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ مُوسَى  ، عَنْ ابْنِ إِدْرِيسَ  ، عَنْ أَشْعَثَ  ، عَنْ الْحَكَمِ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ مُدْلِجٍ : أَنَّهُ مَاتَ وَتَرَكَ ابْنَتَهُ وَمَوَالِيَهُ،فَأَعْطَى عَلِيٌّ   ابْنَتَهُ النِّصْفَ وَمَوَالِيَهُ النِّصْفَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ibrahim bin Musa, daripada Ibn Idris, daripada Asy'ath, daripada al-Hakam, daripada Abdul Rahman bin Mudlij: bahawa dia telah meninggal dunia dan meninggalkan seorang anak perempuan dan mawali (hamba yang dimerdekakan). Lalu Ali memberikan kepada anak perempuannya separuh (harta) dan kepada mawali-mawalinya separuh (harta)."
  },
  {
    "id": 39816,
    "hadith_number": 2279,
    "tajuk_hadith": "Pembahagian Harta Pusaka oleh Ali: Separuh untuk Anak Perempuan dan Separuh untuk Mawla",
    "perawi_melayu": "Ibrahim, Ibn Idris, Asy-Syaibani, Al-Hakam, Asy-Syamus",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ  ، عَنْ ابْنِ إِدْرِيسَ  ، عَنْ الشَّيْبَانِيِّ  ، عَنْ الْحَكَمِ  ، عَنْ الشَّمُّوسِ L1465  : \" أَنَّ أَبَاهَا مَاتَ،فَجَعَلَ عَلِيٌّ   لَهَا النِّصْفَ وَلِمَوَالِيهِ النِّصْفَ \"",
    "malay_translation": "Telah menceritakan kepada kami Ibrahim, daripada Ibn Idris, daripada Asy-Syaibani, daripada Al-Hakam, daripada Asy-Syamus L1465: \"Bahawa ayahnya telah meninggal dunia, lalu Ali menjadikan untuknya separuh dan untuk maula-maulanya separuh.\""
  },
  {
    "id": 39817,
    "hadith_number": 2280,
    "tajuk_hadith": "Hukum Warisan Apabila Seorang Anak Perempuan Membeli dan Memerdekakan Ayahnya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ ، حَدَّثَنَا أَشْعَثُ ، عَنْ جَهْمِ بْنِ دِينَارٍ ، عَنْ إِبْرَاهِيمَ  : أَنَّهُ \" سُئِلَ عَنْ أُخْتَيْنِ اشْتَرَتْ إِحْدَاهُمَا أَبَاهَا فَأَعْتَقَتْهُ، ثُمَّ مَاتَ، قَالَ لَهُمَا :الثُّلُثَانِ فَرِيضَتُهُمَا فِي كِتَابِ اللَّهِ، وَمَا بَقِيَ فَلِلْمُعْتِقَةِ دُونَ الْأُخْرَى \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Isa, telah menceritakan kepada kami Hafs bin Ghiyath, telah menceritakan kepada kami Asy'ath, dari Jahm bin Dinar, dari Ibrahim: bahawa dia; \"Ditanya tentang dua orang saudara perempuan, salah seorang dari mereka membeli ayah mereka lalu memerdekakannya, kemudian ayahnya meninggal dunia. Dia (Ibrahim) berkata kepada mereka berdua: 'Dua pertiga adalah bahagian faraidh mereka dalam Kitab Allah, dan apa yang tersisa adalah untuk perempuan yang memerdekakan ayah mereka, bukan yang lain.'\""
  },
  {
    "id": 39818,
    "hadith_number": 2281,
    "tajuk_hadith": "Wanita Memerdekakan Ayah dan Warisan Anak Perempuan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ ، حَدَّثَنَا إِسْرَائِيلُ ، حَدَّثَنَا الْأَشْعَثُ ، عَنْ الشَّعْبِيِّ  : \" فِي امْرَأَةٍ أَعْتَقَتْ أَبَاهَا، فَمَاتَ الْأَبُ وَتَرَكَ أَرْبَعَ بَنَاتٍ هِيَ إِحْدَاهُنَّ، قَالَ :لَيْسَ عَلَيْهِ مِنَّةٌ، لَهُنَّ الثُّلُثَانِ، وَهِيَ مَعَهُنَّ \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Yusuf, telah menceritakan kepada kami Israil, telah menceritakan kepada kami Al-Asy'ath, dari Asy-Sya'bi: \"Mengenai seorang wanita yang memerdekakan ayahnya, kemudian ayahnya meninggal dunia dan meninggalkan empat anak perempuan, dan dia adalah salah seorang dari mereka. Beliau (Asy-Sya'bi) berkata: \"Tidak ada budi padanya (ayah), bagi mereka (anak perempuan) dua pertiga (dari harta warisan), dan dia (wanita yang memerdekakan ayah) bersama mereka.\""
  },
  {
    "id": 39819,
    "hadith_number": 2282,
    "tajuk_hadith": "Pembahagian Harta Pusaka: Keputusan Ali tentang Warisan Anak Perempuan dan Isteri",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا زُهَيْرٌ  ، عَنْ حَيَّانَ بْنِ سَلْمَانَ L2590 ، قَالَ : كُنْتُ عِنْدَ سُوَيْدِ بْنِ غَفَلَةَ  ، فَجَاءَهُ رَجُلٌ، فَسَأَلَهُ عَنْ \" فَرِيضَةِ رَجُلٍ تَرَكَ ابْنَتَهُ وَامْرَأَتَه، فَقَالَ : أَنَا أُنْبِئُكَ قَضَاءَ عَلِيٍّ  ، قَالَ : حَسْبِي قَضَاءُ عَلِيٍّ، قَالَ : قَضَى عَلِيٌّلِامْرَأَتِهِ الثُّمُنَ، وَلِابْنَتِهِ النِّصْفَ، ثُمَّ رَدَّ الْبَقِيَّةَ عَلَى ابْنَتِهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Zuhair, dari Hayyan bin Salman, dia berkata: \"Saya berada di sisi Suwaid bin Ghafalah, lalu datang seorang lelaki kepadanya dan bertanya tentang 'faraidh (harta pusaka) seorang lelaki yang meninggalkan anak perempuan dan isterinya.' Suwaid berkata: 'Saya akan memberitahumu keputusan Ali.' Lelaki itu berkata: 'Cukuplah bagiku keputusan Ali.' Suwaid berkata: 'Ali memutuskan untuk isterinya seperdelapan, dan untuk anak perempuannya separuh, kemudian mengembalikan sisa harta kepada anak perempuannya.'\""
  },
  {
    "id": 39820,
    "hadith_number": 2283,
    "tajuk_hadith": "Hamba Perempuan Meninggal Dunia dan Harta Pusakanya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ ، عَنْ إِسْرَائِيلَ ، عَنْ أَبِي الْهَيْثَمِ ،  عَنْ إِبْرَاهِيمَ  : أَنَّ مَوْلَاةً لِإِبْرَاهِيمَ تُوُفِّيَتْ وَتَرَكَتْ مَالًا، فَقُلْتُ لِإِبْرَاهِيمَ، فَقَالَ :\" إِنَّ لَهَا ذَا قَرَابَةٍ \"",
    "malay_translation": "Telah menceritakan kepada kami Ubaidullah, daripada Israil, daripada Abu al-Haitham, daripada Ibrahim: Bahawa seorang hamba perempuan milik Ibrahim meninggal dunia dan meninggalkan harta. Maka aku berkata kepada Ibrahim, lalu dia berkata: \"Sesungguhnya dia mempunyai kerabat.\""
  },
  {
    "id": 39821,
    "hadith_number": 2284,
    "tajuk_hadith": "Hak Perwalian adalah Bagi Yang Lebih Tua",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، حَدَّثَنَا أَشْعَثُ  ، عَنْ الشَّعْبِيِّ  ، عَنْ عُمَرَ  ، وَعَلِيٍّ  ، وَزَيْدٍ  ، قَالَ : وَأَحْسَبُهُ قَدْ ذَكَرَ عَبْدَ اللَّهِ   أَيْضًا : أَنَّهُمْ قَالُوا :\" الْوَلَاءُ لِلْكُبْرِ.\nيَعْنُونَ بِالْكُبْرِ : مَا كَانَ أَقْرَبَ بِأَبٍ أَوْ أُمٍّ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah menceritakan kepada kami Asy'ath, daripada Asy-Sya'bi, daripada Umar, Ali, dan Zaid, beliau berkata: Dan saya rasa beliau juga menyebut Abdullah: bahawa mereka berkata: \"Hak perwalian adalah bagi yang lebih tua.\" Maksud mereka dengan 'yang lebih tua' adalah: yang paling dekat pertaliannya melalui bapa atau ibu."
  },
  {
    "id": 39822,
    "hadith_number": 2285,
    "tajuk_hadith": "Hukum Wala' Adalah Untuk Yang Paling Tua",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَزِيدُ  ، حَدَّثَنَا أَشْعَثُ  ، عَنْ ابْنِ سِيرِينَ  ، عَنْ عَبْدِ اللَّهِ بْنِ عُتْبَةَ  ، قَالَ : \" كَتَبَ إِلَيَّ عُمَرُ فِي شَأْنِ فُكَيْهَةَ بِنْتِ سَمْعَانَ أَنَّهَا مَاتَتْ وَتَرَكَتْ ابْنَ أَخِيهَا لِأَبِيهَا وَأُمِّهَا، وَابْنَ أَخِيهَا لِأَبِيهَا، فَكَتَبَ عُمَرُ   :إِنَّ الْوَلَاءَ لِلْكُبْرِ \"",
    "malay_translation": "Telah menceritakan kepada kami Yazid, telah menceritakan kepada kami Asy'ath, daripada Ibn Sirin, daripada Abdullah bin Utbah, dia berkata: \"Umar telah menulis kepada saya mengenai urusan Fukeha binti Sam'an bahawa dia telah meninggal dunia dan meninggalkan anak saudara lelaki daripada ayah dan ibunya, dan anak saudara lelaki daripada ayahnya. Lalu Umar menulis: Sesungguhnya wala' adalah untuk yang paling tua.\""
  },
  {
    "id": 39823,
    "hadith_number": 2286,
    "tajuk_hadith": "Hukum Wala'",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا أَبُو شِهَابٍ  ، عَنْ الشَّيْبَانِيِّ  ، عَنْ الشَّعْبِيِّ  : أَنَّ عَلِيًّا  ، وَزَيْدًا   قَالَا :\" الْوَلَاءُ لِلْكُبْر \".\nوَقَالَ عَبْدُ اللَّهِ  ، وَشُرَيْحٌ   : لِلْوَرَثَةِ",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Abdullah, telah menceritakan kepada kami Abu Syihab, dari Asy-Syaibani, dari Asy-Sya'bi: Bahawa Ali dan Zaid berkata: \"Wala' (hak perwalian) adalah untuk yang lebih tua.\" Dan Abdullah dan Syuraih berkata: \"Untuk ahli waris.\""
  },
  {
    "id": 39824,
    "hadith_number": 2287,
    "tajuk_hadith": "Keputusan Umar, Abdullah, Ali, dan Zaid mengenai Wala'",
    "perawi_melayu": "Asy-Sya'bi",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ  ، عَنْ عَلِيِّ بْنِ مُسْهِرٍ  ، عَنْ أَشْعَثَ  ، عَنِ الشَّعْبِيِّ  ، قَالَ : \" قَضَى عُمَر  ، وَعَبْدُ اللَّهِ  ، وَعَلِيٌّ  ، وَزَيْدٌ  لِلْكُبْرِ بِالْوَلَاءِ \"",
    "malay_translation": "Muhammad bin Uyainah meriwayatkan kepada kami, daripada Ali bin Mushir, daripada Asy'ath, daripada Asy-Sya'bi, dia berkata: \"Umar, Abdullah, Ali, dan Zaid memutuskan bahawa wala' adalah milik orang yang membebaskan hamba.\""
  },
  {
    "id": 39825,
    "hadith_number": 2288,
    "tajuk_hadith": "Hukum Warisan bagi Anak Saudara Sebelah Bapa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا شَرِيكٌ  ، عَنْ أَشْعَثَ  ، عَنْ ابْنِ سِيرِينَ  ، قَالَ : \" تُوُفِّيَتْ فُكَيْهَةُ بِنْتُ سَمْعَانَ وَتَرَكَتْ ابْنَ أَخِيهَا لِأَبِيهَا، وَبَنِي بَنِي أَخِيهَا لِأَبِيهَا وَأُمِّهَا،فَوَرَّثَ عُمَرُ   بَنِي أَخِيهَا لِأَبِيهَا \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Syarik, daripada Asy'ath, daripada Ibn Sirin, dia berkata: \"Fukayhah binti Sam'an telah meninggal dunia dan meninggalkan seorang anak saudara lelaki dari pihak bapanya, dan anak-anak dari anak saudara lelakinya dari pihak bapa dan ibunya, lalu Umar memberikan warisan kepada anak-anak saudara lelakinya dari pihak bapanya.\""
  },
  {
    "id": 39826,
    "hadith_number": 2289,
    "tajuk_hadith": "Hukum Wala' adalah untuk yang Lebih Tua",
    "perawi_melayu": "Muhammad bin Isa, Abdul Salam bin Harb, al-A'mash, Ibrahim, Umar, Ali, dan Zaid.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى  ، حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ حَرْبٍ  ، عَنْ الْأَعْمَشِ  ، عَنْ إِبْرَاهِيمَ  ،  عَنْ عُمَرَ  ، وَعَلِيٍّ  ، وَزَيْدٍ   : أَنَّهُمْ قَالُوا :\" الْوَلَاءُ لِلْكُبْرِ \"",
    "malay_translation": "Muhammad bin Isa meriwayatkan kepada kami, Abdul Salam bin Harb meriwayatkan kepada kami, daripada al-A'mash, daripada Ibrahim, daripada Umar, Ali, dan Zaid, bahawa mereka berkata: 'Wala' adalah untuk yang lebih tua.'"
  },
  {
    "id": 39827,
    "hadith_number": 2290,
    "tajuk_hadith": "Wala' untuk Saudara Lelaki yang Lebih Tua",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى  ، حَدَّثَنَا أَبُو عَوَانَةَ  ، عَنْ مُغِيرَةَ  ، عَنْ إِبْرَاهِيمَ  : \" فِي أَخَوَيْنِ وَرِثَا مَوْلًى كَانَ أَعْتَقَهُ أَبُوهُمَا، فَمَاتَ أَحَدُهُمَا وَتَرَكَ وَلَدًا، قَالَ : كَانَ عَلِيٌّ  ، وَزَيْدٌ  ، وَعَبْدُ اللَّهِ   ، يَقُولُونَ :\" الْوَلاءُ لِلْكَبِر \"",
    "malay_translation": "Muhammad bin Isa meriwayatkan kepada kami, Abu 'Awanah meriwayatkan kepada kami, daripada Mughirah, daripada Ibrahim: \"Tentang dua orang saudara lelaki yang mewarisi seorang maula yang dibebaskan oleh ayah mereka. Lalu salah seorang daripada mereka meninggal dunia dan meninggalkan seorang anak. Dia berkata: 'Ali, Zaid, dan Abdullah berkata: 'Wala' adalah untuk yang lebih tua.'"
  },
  {
    "id": 39828,
    "hadith_number": 2291,
    "tajuk_hadith": "Al-Wala' adalah untuk yang Lebih Tua",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى  ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ  ، قَالَ : سَمِعْتُ مَطَرًا الْوَرَّاقَ  ، يَقُولُ : قَالَ عُمَرُ  ، وَعَلِيٌّ   :\" الْوَلاءُ لِلْكِبَرِ \"",
    "malay_translation": "Muhammad bin Isa meriwayatkan kepada kami, Hammad bin Zaid meriwayatkan kepada kami, dia berkata: Saya mendengar Matar al-Warraq berkata: Umar dan Ali berkata: 'Al-Wala' adalah untuk yang lebih tua.'"
  },
  {
    "id": 39829,
    "hadith_number": 2292,
    "tajuk_hadith": "Al-Wala' untuk Keluarga Lelaki Tertua",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى ، عَنْ رَوْحٍ ، عَنْ ابْنِ جُرَيْجٍ ، عَنْ عَطَاءٍ ، وَابْنِ جُرَيْجٍ ، عَنْ ابْنِ طَاوُسٍ ، عَنْ أَبِيهِ ، قَالَ :\" الْوَلَاءُ لِلْكُبْرِ \"",
    "malay_translation": "Muhammad bin Isa telah memberitahu kami, daripada Rauh, daripada Ibn Juraij, daripada 'Ata', dan Ibn Juraij, daripada Ibn Tawus, daripada bapanya, beliau berkata: \"Al-Wala' adalah untuk yang lebih tua.\""
  },
  {
    "id": 39830,
    "hadith_number": 2293,
    "tajuk_hadith": "Al-Wala' adalah Hak bagi yang Lebih Dewasa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى ، عَنْ إِسْرَائِيلَ ، عَنْ مَنْصُورٍ ، عَنْ إِبْرَاهِيمَ ، قَالَ :\" الْوَلَاءُ لِلْكُبْرِ \"",
    "malay_translation": "Ubaidillah bin Musa telah meriwayatkan kepada kami, daripada Israil, daripada Mansur, daripada Ibrahim, beliau berkata: \"Al-Wala' adalah hak bagi yang lebih dewasa.\""
  },
  {
    "id": 39831,
    "hadith_number": 2294,
    "tajuk_hadith": "Perwalaan Sesama Muslim",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ مُطَرِّفٍ  ، عَنْ الشَّعْبِيِّ  ، وَسُفْيَانُ  ، عَنْ يُونُسَ  ، عَنْ الْحَسَنِ   فِي الرَّجُلِ يُوَالِي الرَّجُلَ، قَالَا :\" هُوَ بَيْنَ الْمُسْلِمِينَ \".\nقَالَ سُفْيَانُ : وَكَذَلِكَ نَقُولُ",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Sufyan, daripada Mutarrif, daripada al-Sya'bi, dan Sufyan, daripada Yunus, daripada al-Hasan, tentang seorang lelaki yang berwalikan lelaki lain, keduanya berkata: \"Dia adalah antara kaum Muslimin\". Sufyan berkata: \"Dan begitu juga kami katakan.\""
  },
  {
    "id": 39832,
    "hadith_number": 2295,
    "tajuk_hadith": "Keutamaan Orang Muslim Terhadap Muallaf (Orang Baru Masuk Islam)",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ  ، عَنْ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ  ، قَالَ : سَمِعْتُ تَمِيمًا الدَّارِيَّ  ، يَقُولُ : سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقُلْتُ : يَا رَسُولَ اللَّهِ، مَا السُّنَّةُ فِي الرَّجُلِ مِنْ أَهْلِ الْكُفْرِ يُسْلِمُ عَلَى يَدَيْ رَجُلٍ مِنْ الْمُسْلِمِينَ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" هُوَ أَوْلَى النَّاسِ بِمَحْيَاهُ وَمَمَاتِهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Abdul Aziz bin Umar bin Abdul Aziz, daripada Abdullah bin Mawhab, dia berkata: Saya mendengar Tamim ad-Dari berkata: Saya bertanya kepada Rasulullah SAW, lalu saya berkata: Wahai Rasulullah, apakah sunnah (ketetapan) mengenai seorang lelaki dari kalangan kafir yang memeluk Islam melalui seorang lelaki Muslim? Maka Rasulullah SAW bersabda: \"Dia (orang Muslim yang menyebabkan orang kafir itu masuk Islam) adalah orang yang paling utama terhadap kehidupan dan kematiannya (orang yang baru masuk Islam itu).\""
  },
  {
    "id": 39833,
    "hadith_number": 2296,
    "tajuk_hadith": "Hukum Orang Asli Memeluk Islam dan Pewarisan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ ، عَنْ إِسْرَائِيلَ ، عَنْ مَنْصُورٍ ، عَنْ إِبْرَاهِيمَ ، قَالَ : سُئِلَ عَنْ رَجُلٍ مِنْ أَهْلِ السَّوَادِ، أَسْلَمَ عَلَى يَدَيْ رَجُلٍ، قَالَ :\" يَعْقِلُ عَنْهُ، وَيَرِثُهُ \"",
    "malay_translation": "Telah menceritakan kepada kami Ubaidullah, daripada Israil, daripada Mansur, daripada Ibrahim, dia berkata: Ditanyakan tentang seorang lelaki dari ahli as-Sawad, yang memeluk Islam di tangan seorang lelaki, dia berkata: \"Dia memahami daripadanya, dan dia mewarisinya.\""
  },
  {
    "id": 39834,
    "hadith_number": 2297,
    "tajuk_hadith": "Wanita Mewarisi Diyat Suami dalam Kes Pembunuhan Sengaja dan Tidak Sengaja",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ ، حَدَّثَنَا شُعْبَةُ ، عَنْ مُغِيرَةَ ،  عَنْ إِبْرَاهِيمَ ، قَالَ :\" تَرِثُ الْمَرْأَةُ مِنْ دِيَةِ زَوْجِهَا فِي الْعَمْدِ وَالْخَطَإِ \"",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Syu'bah, daripada Mughirah, daripada Ibrahim, beliau berkata: \"Seorang wanita mewarisi daripada diyat suaminya dalam kes pembunuhan yang disengajakan dan tidak disengajakan.\""
  },
  {
    "id": 39835,
    "hadith_number": 2298,
    "tajuk_hadith": "Diyat Berdasarkan Ketetapan Allah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ ، حَدَّثَنَا أَبُو عَوَانَةَ ، عَنْ مُغِيرَةَ ، عَنْ إِبْرَاهِيمَ ، قَالَ :\" الدِّيَةُ عَلَى فَرَائِضِ اللَّهِ \"",
    "malay_translation": "Telah meriwayatkan kepada kami Abu Nu'man, telah meriwayatkan kepada kami Abu 'Awanah, daripada Mughirah, daripada Ibrahim, dia berkata: \"Diyat (denda diyat) adalah berdasarkan kepada ketetapan-ketetapan Allah.\""
  },
  {
    "id": 39836,
    "hadith_number": 2299,
    "tajuk_hadith": "Diyat: Hukumnya Seperti Warisan",
    "perawi_melayu": "Perawi: Muslim bin Ibrahim, Wuhaib, Ayyub, Abi Qilabah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا وُهَيْبٌ  ، حَدَّثَنَا أَيُّوبُ  ، عَنْ أَبِي قِلَابَةَ  ، قَالَ :\" الدِّيَةُ سَبِيلُهَا سَبِيلُ الْمِيرَاثِ \"",
    "malay_translation": "Muslim bin Ibrahim telah meriwayatkan kepada kami, Wuhaib telah meriwayatkan kepada kami, Ayyub telah meriwayatkan kepada kami, daripada Abi Qilabah, beliau berkata: 'Diyat (wang darah) jalannya adalah jalan warisan.'"
  },
  {
    "id": 39837,
    "hadith_number": 2300,
    "tajuk_hadith": "Pewarisan Saudara Seibu dari Diyat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ ، عَنْ حُمَيْدٍ ، وَدَاوُدَ بْنِ أَبِي هِنْدٍ : أن عمر بن عبد العزيز  كتب أن :\" يورث الإخوة من الأم من الدية \"",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Hammad bin Salamah, dari Humaid dan Daud bin Abi Hind: Bahawa Umar bin Abdul Aziz telah menulis: 'Saudara-saudara seibu diwarisi dari diat.'"
  },
  {
    "id": 39838,
    "hadith_number": 2301,
    "tajuk_hadith": "Diyat Sebagai Warisan Mengikut Kitab Allah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، حَدَّثَنِي اللَّيْثُ  ، حَدَّثَنِي يُونُسُ  ، عَنْ ابْنِ شِهَابٍ  ، قَالَ :\" الْعَقْلُ مِيرَاثٌ بَيْنَ وَرَثَةِ الْقَتِيلِ عَلَى كِتَابِ اللَّهِ وَفَرَائِضِهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Salih, telah menceritakan kepadaku al-Laith, telah menceritakan kepadaku Yunus, dari Ibn Shihab, dia berkata: \"Diyat (ganti rugi) adalah warisan di antara ahli waris orang yang terbunuh berdasarkan Kitab Allah dan faraidh-Nya.\""
  },
  {
    "id": 39839,
    "hadith_number": 2302,
    "tajuk_hadith": "Kezaliman Tidak Mewariskan Diat kepada Saudara Seibu",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قَبِيصَةُ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ عَمْرِو بْنِ دِينَارٍ  ، عَنْ بَعْضِ  وَلَدِ ابْنِ الْحَنَفِيَّةِ، عَنْ عَلِيٍّ  ، قَالَ :\" لَقَدْ ظَلَمَ مَنْ لَمْ يُوَرِّثْ الْإِخْوَةَ مِنْ الْأُمِّ مِنْ الدِّيَةِ \"",
    "malay_translation": "Telah menceritakan kepada kami Qabisah, telah menceritakan kepada kami Sufyan, dari 'Amr bin Dinar, dari sebahagian anak Ibn al-Hanafiyyah, dari Ali, dia berkata: \"Sesungguhnya telah zalim orang yang tidak mewariskan kepada saudara-saudara seibu dari diat (wang tebusan).\""
  },
  {
    "id": 39840,
    "hadith_number": 2303,
    "tajuk_hadith": "Diyat Diwarisi Seperti Harta",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ  ، حَدَّثَنَا أَبُو خَالِدٍ  ، أَنْبَأَنَا ابْنُ سَالِمٍ  ، عَنْ الشَّعْبِيِّ  ، عَنْ عُمَرَ  ، وَعَلِيٍّ  ، وَزَيْدٍ   ، قَالُوا :\" الدِّيَةُ تُورَثُ كَمَا يُورَثُ الْمَالُ خَطَؤُهُ وَعَمْدُهُ \"",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Sa'id, telah menceritakan kepada kami Abu Khalid, telah memberitakan kepada kami Ibn Salim, dari Asy-Sya'bi, dari Umar, dan Ali, dan Zaid, mereka berkata: \"Diyat (denda darah) diwarisi sebagaimana harta diwarisi, baik kesalahan mahupun sengaja.\""
  },
  {
    "id": 39841,
    "hadith_number": 2304,
    "tajuk_hadith": "Ali Tidak Mewariskan Saudara Seibu, Suami, atau Isteri dari Diat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ  ، حَدَّثَنَا إِسْمَاعِيل  ، عَنْ عَامِرٍ  ، قَالَ : \" كَانَ عَلِيٌّ  لَا يُوَرِّثُ الْإِخْوَةَ مِنْ الْأُمِّ، وَلَا الزَّوْجَ، وَلَا الْمَرْأَةَ، مِنْ الدِّيَةِ شَيْئًا \".\nقَالَ عَبْد اللَّهِ : بَعْضُهُمْ يُدْخِلُ بَيْنَ إِسْمَاعِيل، وَعَامِرٍ رَجُلًا",
    "malay_translation": "Telah menceritakan kepada kami Ja'far bin Aun, telah menceritakan kepada kami Ismail, daripada Amir, dia berkata: \"Adalah Ali tidak mewariskan saudara-saudara dari ibu, tidak juga suami, dan tidak juga isteri, sedikit pun daripada diat (wang tebusan)\". Abdullah berkata: Sebahagian mereka memasukkan seorang lelaki antara Ismail dan Amir."
  },
  {
    "id": 39842,
    "hadith_number": 2305,
    "tajuk_hadith": "Saudara Seibu Tidak Mewarisi Diyah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ ، عَنْ حَمَّادِ بْنِ سَلَمَةَ ، عَنْ زِيَادٍ الْأَعْلَمِ ،  عَنْ الْحَسَنِ ، قَالَ :\" لَا تُوَرَّثُ الْإِخْوَةُ مِنْ الْأُمِّ مِنْ الدِّيَةِ \"",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, dari Hammad bin Salamah, dari Ziyad al-A'lam, dari al-Hasan, dia berkata: 'Saudara-saudara seibu tidak mewarisi diyah (denda darah).'"
  },
  {
    "id": 39843,
    "hadith_number": 2306,
    "tajuk_hadith": "Hukum Warisan Bagi Kematian Tidak Jelas Dalam Bencana",
    "perawi_melayu": "Perawi tidak tersedia",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ  ، حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ  ، عَنْ أَبِيهِ  ، عَنْ خَارِجَةَ بْنِ زَيْدٍ  ، عَنْ زَيْدِ بْنِ ثَابِتٍ  ، قَالَ :\" كُلُّ قَوْمٍ مُتَوَارِثِينَ عَمِيَ مَوْتُهُمْ فِي هَدْمٍ، أَوْ غَرَقٍ، فَإِنَّهُمْ لَا يَتَوَارَثُونَ، يَرِثُهُمْ الْأَحْيَاءُ \"",
    "malay_translation": "Telah menceritakan kepada kami Yahya bin Hassan, telah menceritakan kepada kami Ibn Abi Az-Zinad, daripada bapanya, daripada Kharijah bin Zaid, daripada Zaid bin Thabit, dia berkata: \"Setiap kaum yang saling mewarisi yang kematian mereka tidak jelas dalam runtuhan, atau tenggelam, maka sesungguhnya mereka tidak saling mewarisi, yang mewarisi mereka adalah orang-orang yang hidup.\""
  },
  {
    "id": 39844,
    "hadith_number": 2307,
    "tajuk_hadith": "Hukum Warisan Apabila Tidak Diketahui Siapa Mati Dahulu",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ ، عَنْ يَحْيَى بْنِ عَتِيقٍ ، قَالَ : قَرَأْتُ فِي بَعْضِ كُتُبِ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ  فِي الْقَوْمِ يَقَعُ عَلَيْهِمْ الْبَيْتُ، لَا يُدْرَى أَيُّهُمَا مَاتَ قَبْلُ؟ قَالَ :\" لَا يُوَرَّثُ الْأَمْوَاتُ بَعْضُهُمْ مِنْ بَعْضٍ، وَيُوَرَّثُ الْأَحْيَاءُ مِنْ الْأَمْوَاتِ \"",
    "malay_translation": "Yahya bin Hassan meriwayatkan kepada kami, Hammad bin Zaid meriwayatkan kepada kami, daripada Yahya bin Atiq, dia berkata: Saya membaca dalam beberapa kitab Umar bin Abdul Aziz tentang kaum yang rumah runtuh menimpa mereka, tidak diketahui siapa yang mati dahulu? Beliau berkata: \"Orang mati tidak mewarisi antara satu sama lain, dan orang hidup mewarisi dari orang mati.\""
  },
  {
    "id": 39845,
    "hadith_number": 2308,
    "tajuk_hadith": "Hukum Waris Kematian Serentak",
    "perawi_melayu": "Nu'aim bin Hammad",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا نُعَيْمُ بْنُ حَمَّادٍ  ، عَنْ عَبْدِ الْعَزِيزِ بْنِ مُحَمَّدٍ  ، حَدَّثَنَا جَعْفَرٌ  ، عَنْ أَبِيهِ   : أَنَّ أُمَّ كُلْثُومٍ ، وَابْنَهَا زَيْدًا مَاتَا فِي يَوْمٍ وَاحِدٍ، فَالْتَقَتْ الصَّائِحَتَانِ فِي الطَّرِيقِ،فَلَمْ يَرِثْ كُلُّ وَاحِدٍ مِنْهُمَا مِنْ صَاحِبِهِ، وَأَنَّ أَهْلَ الْحَرَّةِ لَمْ يَتَوَارَثُوا، وَأَنَّ أَهْلَ صِفِّينَ لَمْ يَتَوَارَثُوا \"",
    "malay_translation": "Telah meriwayatkan kepada kami Nu'aim bin Hammad, daripada Abdul Aziz bin Muhammad, telah meriwayatkan kepada kami Ja'far, daripada ayahnya: Sesungguhnya Ummu Kulthum dan anaknya, Zaid, meninggal dunia pada hari yang sama. Dua orang yang meratap bertemu di jalan, namun mereka tidak mewarisi harta pusaka antara satu sama lain. Dan sesungguhnya penduduk Harrah tidak saling mewarisi, dan penduduk Siffin juga tidak saling mewarisi."
  },
  {
    "id": 39846,
    "hadith_number": 2309,
    "tajuk_hadith": "Hukum Waris Runtuhan Rumah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا جَعْفَرُ بْنُ عَوْنٍ  ، أَنْبَأَنَا ابْنُ أَبِي لَيْلَى  ، عَنْ الشَّعْبِيِّ   : \" أَنَّ بَيْتًا بِالشَّامِ وَقَعَ عَلَى قَوْمٍ،فَوَرَّثَ عُمَرُ   بَعْضَهُمْ مِنْ بَعْضٍ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Ja'far bin 'Aun, telah memberitakan kepada kami Ibn Abi Laila, dari Asy-Sya'bi: \"Bahawa sebuah rumah di Syam runtuh menimpa suatu kaum, lalu Umar mewariskan sebahagian mereka dari sebahagian yang lain.\""
  },
  {
    "id": 39847,
    "hadith_number": 2310,
    "tajuk_hadith": "Warisan Dua Saudara yang Terbunuh di Siffin",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ حُرَيْسٍ  ، عَنْ أَبِيهِ  ، عَنْ عَلِيٍّ   : \" أَنَّهُوَرَّثَ أَخَوَيْنِ قُتِلَا بِصِفِّينَ، أَحَدَهُمَا مِنْ الْآخَرِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Sufyan, dari Huraith, dari ayahnya, dari Ali RA: \"Bahawa beliau mewarisi dua orang saudara lelaki yang terbunuh di Siffin, salah seorang daripada mereka daripada yang lain.\""
  },
  {
    "id": 39848,
    "hadith_number": 2311,
    "tajuk_hadith": "Pembahagian Warisan untuk Saudara Perempuan Bapa dan Ibu: Keputusan Umar",
    "perawi_melayu": "Bakr bin Abdullah al-Muzani",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَنْبَأَنَا حُمَيْدٌ  ، عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ الْمُزَنِيِّ   : \" أَنَّ رَجُلًا هَلَكَ، وَتَرَكَ عَمَّتَهُ، وَخَالَتَهُ،فَأَعْطَى عُمَرُ الْعَمَّةَ نَصِيبَ الْأَخِ، وَأَعْطَى الْخَالَةَ نَصِيبَ الْأُخْتِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah memberitakan kepada kami Humaid, daripada Bakr bin Abdullah al-Muzani: Sesungguhnya seorang lelaki meninggal dunia, dan meninggalkan saudara perempuan bapa dan saudara perempuan ibu. Maka Umar memberikan kepada saudara perempuan bapa bahagian seorang saudara lelaki, dan memberikan kepada saudara perempuan ibu bahagian seorang saudara perempuan."
  },
  {
    "id": 39849,
    "hadith_number": 2312,
    "tajuk_hadith": "Keutamaan Menyambung Tali Persaudaraan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ ، حَدَّثَنَا أَبُو شِهَابٍ ، عَنْ الْأَعْمَشِ ، عَنْ إِبْرَاهِيمَ ، قَالَ :\" مَنْ أَدْلَى بِرَحِمٍ، أُعْطِيَ بِرَحِمِهِ الَّتِي يُدْلِي بِهَا \"",
    "malay_translation": "Diberitahu kepada kami oleh Ahmad bin Abdullah, telah menceritakan kepada kami Abu Syihab, daripada al-A'masy, daripada Ibrahim, dia berkata: \"Sesiapa yang menghubungkan tali persaudaraan, dia akan diberikan (ganjaran) disebabkan tali persaudaraan yang dihubungkannya.\""
  },
  {
    "id": 39850,
    "hadith_number": 2313,
    "tajuk_hadith": "Harta Pusaka untuk Anak Perempuan Saudara Lelaki Sekiranya Ada Saudara Perempuan Ayah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ ، حَدَّثَنَا أَبُو شِهَابٍ ، قَالَ : حَدَّثَنِي أَبُو إِسْحَاق الشَّيْبَانِيُّ ، عَنْ الشَّعْبِيِّ  : \" فِي رَجُلٍ تَرَكَ عَمَّتَهُ، وَابْنَةَ أَخِيهِ، قَالَ :الْمَالُ لِابْنَةِ أَخِيهِ \"",
    "malay_translation": "Ahmad bin Abdullah telah meriwayatkan kepada kami, Abu Shihab telah meriwayatkan kepada kami, beliau berkata: Abu Ishaq al-Shaibani telah meriwayatkan kepada saya, daripada al-Sha'bi: \"Berkenaan seorang lelaki yang meninggal dunia dan meninggalkan saudara perempuan ayah dan anak perempuan saudara lelaki, beliau (perawi) berkata: Harta itu adalah untuk anak perempuan saudara lelaki itu.\""
  },
  {
    "id": 39851,
    "hadith_number": 2314,
    "tajuk_hadith": "Bapa Saudara Sebelah Ibu Adalah Waris",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا شَرِيكٌ  ، عَنْ لَيْثٍ  ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ  ، عَنْ أَبِي هُرَيْرَةَ  ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" الْخَالُ وَارِثٌ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Syarik, dari Laith, dari Muhammad bin al-Munkadir, dari Abu Hurairah, dari Nabi ﷺ, baginda bersabda: \"Bapa saudara sebelah ibu adalah waris.\""
  },
  {
    "id": 39852,
    "hadith_number": 2315,
    "tajuk_hadith": "Pendapat Umar dan Abdullah Tentang Warisan Bagi Bapa Saudara Sebelah Ibu",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا حَسَنٌ  ، عَنْ عُبَيْدَةَ  ، عَنْ إِبْرَاهِيمَ  : أَنَّ عُمَرَ  ، وَعَبْدَ اللَّهِ   رَأَيَا أَنْيُوَرِّثَا خَالًا \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Hasan, daripada Ubaidah, daripada Ibrahim: bahawa Umar dan Abdullah berpendapat untuk memberikan warisan kepada bapa saudara sebelah ibu."
  },
  {
    "id": 39853,
    "hadith_number": 2316,
    "tajuk_hadith": "Harta Pusaka untuk Anak Perempuan Saudara Lelaki",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ ، حَدَّثَنَا حَسَنٌ ، عَنْ سُلَيْمَانَ أَبِي إِسْحَاق ، عَنْ الشَّعْبِيِّ  : فِي عَمَّةٍ، وَبِنْتِ أَخٍ، قَالَ :\" الْمَالُ لِابْنَةِ الْأَخِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Hasan, dari Sulaiman Abu Ishaq, dari Asy-Sya'bi: mengenai saudara perempuan bapa (ibu saudara sebelah bapa) dan anak perempuan saudara lelaki, beliau (Asy-Sya'bi) berkata: \"Harta adalah untuk anak perempuan saudara lelaki.\""
  },
  {
    "id": 39854,
    "hadith_number": 2317,
    "tajuk_hadith": "Berkaitan dengan Ibu Saudara Perempuan dari Sebelah Bapa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ ، أنبأنا حَسَنٌ ، عَنْ سُلَيْمَانَ ، عَنْ بَعْضِهِمْ ، عَنْ إِبْرَاهِيمَ ، قَالَ :\" لِلْعَمَّةِ \"",
    "malay_translation": "Abu Nu'aim meriwayatkan kepada kami, memberitakan kepada kami Hasan, daripada Sulaiman, daripada sebahagian mereka, daripada Ibrahim, dia berkata: \"Untuk ibu saudara perempuan daripada sebelah bapa\"."
  },
  {
    "id": 39855,
    "hadith_number": 2318,
    "tajuk_hadith": "Harta untuk Anak Perempuan Saudara Lelaki",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ ، حَدَّثَنَا سُفْيَانُ ، عَنْ الشَّيْبَانِيِّ ، عَنْ الشَّعْبِيِّ  : فِي بِنْتِ أَخٍ، وَعَمَّةٍ، قَالَ :\" أَعْطِي الْمَالَ لِابْنَةِ الْأَخِ \"",
    "malay_translation": "Abu Nu'aim meriwayatkan kepada kami, Sufyan meriwayatkan kepada kami, daripada al-Shaybani, daripada al-Sha'bi: Mengenai anak perempuan saudara lelaki dan ibu saudara perempuan, beliau bersabda: \"Berikan harta kepada anak perempuan saudara lelaki.\""
  },
  {
    "id": 39856,
    "hadith_number": 2319,
    "tajuk_hadith": "Pembahagian Pusaka: Bapa Saudara Sebelah Ibu dan Anak Perempuan Saudara Lelaki",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْلَى  ، حَدَّثَنَا زَكَرِيَّا  ، عَنْ عَامِرٍ  ، عَنْ مَسْرُوقٍ   : فِي رَجُلٍ تُوُفِّيَ وَلَيْسَ لَهُ وَارِثٌ إِلَّا ابْنَةُ أَخِيهِ وَخَالُهُ، قَالَ :\" لِلْخَالِ نَصِيبُ أُخْتِهِ، وَلِابْنَةِ الْأَخِ نَصِيبُ أَبِيهَا \"",
    "malay_translation": "Ya'la telah meriwayatkan kepada kami, Zakaria telah meriwayatkan kepada kami, daripada Amir, daripada Masruq: Mengenai seorang lelaki yang meninggal dunia dan tidak mempunyai waris kecuali anak perempuan saudara lelakinya dan bapa saudara sebelah ibunya. Beliau (Nabi) bersabda: 'Bagi bapa saudara sebelah ibu, bahagiannya adalah bahagian saudara perempuannya, dan bagi anak perempuan saudara lelaki, bahagiannya adalah bahagian bapanya.'"
  },
  {
    "id": 39857,
    "hadith_number": 2320,
    "tajuk_hadith": "Kedudukan Mak Cik Sebagai Ganti Ibu Bapa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا يُونُسُ  ، عَنْ عَامِرٍ  ، قَالَ : \" كَانَ مَسْرُوقٌ  يُنَزِّلُ الْعَمَّةَ بِمَنْزِلَةِ الْأَبِ، إِذَا لَمْ يَكُنْ أَبٌ، وَالْخَالَةَ بِمَنْزِلَةِ الْأُمِّ، إِذَا لَمْ تَكُنْ أُمٌّ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Yunus, daripada Amir, dia berkata: \"Masruq meletakkan (menganggap) mak cik sebelah bapa pada kedudukan bapa, jika tiada bapa, dan mak cik sebelah ibu pada kedudukan ibu, jika tiada ibu.\""
  },
  {
    "id": 39858,
    "hadith_number": 2321,
    "tajuk_hadith": "Warisan untuk Anak Saudara Perempuan bagi Orang yang Tidak Diketahui Nasabnya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْلَى  ، عَنْ مُحَمَّدِ بْنِ إِسْحَاق  ، عَنْ مُحَمَّدِ بْنِ حَبَّانَ  نَسَبَهُ إِلَى جَدِّهِ ، عَنْ عَمِّهْ وَاسِعِ بْنِ حَبَّانَ  ، قَالَ : تُوُفِّيَ ابْنُ الدَّحْدَاحَةِ، وَكَانَ أَتِيًّا، وَهُوَ الَّذِي لَا يُعْرَفُ لَهُ أَصْلٌ، فَكَانَ فِي بَنِي الْعَجْلَانِ، وَلَمْ يَتْرُكْ عَقِبًا، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِعَاصِمِ بْنِ عَدِيٍّ :\" هَلْ تَعْلَمُونَ لَهُ فِيكُمْ نَسَبًا؟ قَالَ : مَا نَعْرِفُهُ يَا رَسُولَ اللَّهِ، فَدَعَا ابْنَ أُخْتِهِ، فَأَعْطَاهُ مِيرَاثَهُ",
    "malay_translation": "Ya'la telah meriwayatkan kepada kami daripada Muhammad bin Ishaq, daripada Muhammad bin Habban, yang menisbahkannya kepada datuknya, daripada bapa saudaranya Wasi' bin Habban, berkata: Anak Dahdahah telah meninggal dunia, dan dia adalah seorang *atiyy* (orang yang tidak diketahui asal usulnya), iaitu orang yang tidak diketahui asal usulnya, dan dia adalah daripada Bani 'Ajlan, dan tidak meninggalkan zuriat. Maka Rasulullah صلى الله عليه وسلم bersabda kepada 'Asim bin 'Adiy: \"Adakah kamu mengetahui baginya nasab keturunan dalam kalangan kamu?\" Beliau berkata: \"Kami tidak mengetahuinya, wahai Rasulullah.\" Maka baginda memanggil anak saudara perempuannya, lalu memberikan harta pusakanya kepadanya."
  },
  {
    "id": 39859,
    "hadith_number": 2322,
    "tajuk_hadith": "Memberikan Harta kepada Paman dari Sebelah Ibu",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ  ، حَدَّثَنَا أَبِي  ، عَنِ الْأَعْمَشِ  ، عَنْ إِبْرَاهِيمَ  ، عَنْ عُمَرَ   : \" أَنَّهُأَعْطَى خَالًا الْمَالَ \"",
    "malay_translation": "Telah menceritakan kepada kami Umar bin Hafs bin Ghiyath, telah menceritakan kepada kami ayahku, dari Al-A'mash, dari Ibrahim, dari Umar: \"Bahawasanya beliau memberikan harta kepada seorang paman dari sebelah ibu.\""
  },
  {
    "id": 39860,
    "hadith_number": 2323,
    "tajuk_hadith": "Kedudukan Ibu Saudara Sebelah Ibu dan Bapa dalam Warisan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا أَبُو هَانِئٍ  ، قَالَ : سُئِلَ عَامِرٌ  عَنْ امْرَأَةٍ أَوْ رَجُلٍ، تُوُفِّيَ وَتَرَكَ خَالَةً وَعَمَّةً، قَالَ : \" لَيْسَ لَهُ وَارِثٌ وَلَا رَحِمٌ غَيْرُهُمَا \"، فَقَالَ : كَانَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ  يُنَزِّلُ الْخَالَةَ بِمَنْزِلَةِ أُمِّهِ، وَيُنَزِّلُ الْعَمَّةَ بِمَنْزِلَةِ أَخِيهَا",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Abu Hani', dia berkata: 'Amir telah ditanya tentang seorang wanita atau lelaki yang meninggal dunia dan meninggalkan ibu saudara sebelah ibu (khalah) dan ibu saudara sebelah bapa ('ammah). Beliau menjawab: \"Tidak ada waris baginya dan tidak ada kerabat selain kedua-duanya.\" Kemudian beliau berkata: 'Abdullah bin Mas'ud menempatkan ibu saudara sebelah ibu pada kedudukan ibunya, dan menempatkan ibu saudara sebelah bapa pada kedudukan saudara lelakinya.'"
  },
  {
    "id": 39861,
    "hadith_number": 2324,
    "tajuk_hadith": "Pengakuan Hutang Ketika Mati dan Pembahagian Harta",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا أَبُو شِهَابٍ  ، عَنْ عَمْرٍو  ، عَنِ الْحَسَنِ   : فِي رَجُلٍ اعْتَرَفَ عِنْدَ مَوْتِهِ بِأَلْفِ دِرْهَمٍ لِرَجُلٍ، وَأَقَامَ آخَرُ بَيِّنَةً بِأَلْفِ دِرْهَمٍ، وَتَرَكَ الْمَيِّتُ أَلْفَ دِرْهَمٍ، فَقَالَ :\" الْمَالُ بَيْنَهُمَا نِصْفَيْنِ، إِلَّا أَنْ يَكُونَ مُفْلِسًا، فَلَا يَجُوزُ إِقْرَارُهُ \"",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Abdullah, telah menceritakan kepada kami Abu Syihab, daripada 'Amr, daripada al-Hasan: Mengenai seorang lelaki yang mengaku ketika kematiannya berhutang seribu dirham kepada seorang lelaki, dan seorang lelaki lain mengemukakan bukti sebanyak seribu dirham, dan si mati meninggalkan seribu dirham, maka beliau (al-Hasan) berkata: \"Harta itu dibahagikan antara keduanya separuh-separuh, kecuali jika dia seorang yang muflis, maka pengakuannya tidak dibenarkan.\""
  },
  {
    "id": 39862,
    "hadith_number": 2325,
    "tajuk_hadith": "Hukum Saudara Mengaku Saudara dalam Pembahagian Harta",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، قَالَ : قُلْتُ لِشَرِيكٍ   : كَيْفَ ذَكَرْتَ فِي الْأَخَوَيْنِ يَدَّعِي أَحَدُهُمَا أَخًا؟ قَالَ :\" يَدْخُلُ عَلَيْهِ فِي نَصِيبِهِ \"، قُلْتُ : مَنْ ذَكَرَهُ؟ قَالَ : جَابِرٌ  ، عَنْ عَامِرٍ  ، عَنْ عَلِيٍّ",
    "malay_translation": "Abu Nu'aim memberitahu kami, dia berkata: Saya bertanya kepada Syarik: Bagaimana kamu menyebutkan tentang dua orang saudara yang salah seorang dari mereka mengaku sebagai saudara? Dia berkata: \"Dia boleh memasuki bahagiannya.\" Saya bertanya: Siapa yang menyebutkannya? Dia berkata: Jabir, dari Amir, dari Ali."
  },
  {
    "id": 39863,
    "hadith_number": 2326,
    "tajuk_hadith": "Status Saudara yang Dipertikaikan dalam Pembahagian Harta Pusaka",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدٍ الْمُحَارِبِيُّ ، عَنْ الْأَعْمَشِ ، عَنْ إِبْرَاهِيمَ  : فِي الْإِخْوَةِ يَدَّعِي بَعْضُهُمْ الْأَخَ، وَيُنْكِرُ الْآخَرُونَ، قَالَ :\" يَدْخُلُ مَعَهُمْ بِمَنْزِلَةِ عَبْدٍ يَكُونُ بَيْنَ الْإِخْوَةِ، فَيَعْتِقَ أَحَدُهُمْ نَصِيبَهُ، قَالَ : وَكَانَ عَامِرٌ ، وَالْحَكَمُ ، وَأَصْحَابُهُمَا يَقُولُونَ : لَا يَدْخُلُ إِلَّا فِي نَصِيبِ الَّذِي اعْتَرَفَ بِهِ",
    "malay_translation": "Telah menceritakan kepada kami Abu Bakr bin Abi Syaibah, telah menceritakan kepada kami Abdurrahman bin Muhammad Al-Muharibi, dari Al-A'masy, dari Ibrahim, mengenai saudara-saudara yang mana sebahagian mereka mengakui saudara itu dan sebahagian yang lain mengingkarinya, dia berkata: \"Dia (saudara yang dipertikaikan) masuk bersama mereka seperti kedudukan seorang hamba yang berada di antara saudara-saudara, kemudian salah seorang dari mereka memerdekakan bahagiannya.\" Dia berkata: Dan adalah 'Amir, Al-Hakam, dan sahabat-sahabat mereka berkata: \"Tidak termasuk (dalam pembahagian pusaka) kecuali pada bahagian orang yang mengakuinya sahaja.\""
  },
  {
    "id": 39864,
    "hadith_number": 2327,
    "tajuk_hadith": "Hukum Pembahagian Pusaka Apabila Salah Seorang Saudara Mengaku Saudara Lain dan Saudara yang Lain Mengingkarinya",
    "perawi_melayu": "Abu Bakr Ibn Abi Shaybah, Waki', Ibn Abi Layla",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ ابْنُ أَبِي شَيْبَةَ  ، عَنْ وَكِيعٍ  ، قَالَ : إِذَا كَانَا أَخَوَيْنِ، فَادَّعَى أَحَدُهُمَا أَخًا وَأَنْكَرَهُ الْآخَرُ؟ قَالَ : كَانَ ابْنُ أَبِي لَيْلَى  ، يَقُولُ :\" هِيَ مِنْ سِتَّةٍ : لِلَّذِي لَمْ يَدَّعِ ثَلَاثَةٌ، وَلِلْمُدَّعِي سَهْمَانِ، وَلِلْمُدَّعَى سَهْمٌ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Bakr Ibn Abi Shaybah, daripada Waki', beliau berkata: 'Apabila ada dua orang saudara, dan salah seorang daripada mereka mendakwa saudara lain, tetapi yang lain mengingkarinya?' Beliau berkata: Ibn Abi Layla pernah berkata: 'Ia adalah daripada enam bahagian: bagi orang yang tidak membuat tuntutan tiga bahagian, bagi penuntut dua bahagian, dan bagi yang dituntut satu bahagian.'"
  },
  {
    "id": 39865,
    "hadith_number": 2328,
    "tajuk_hadith": "Pembahagian Harta Pusaka dan Persetujuan Waris",
    "perawi_melayu": "Yunus bin Muhammad, Abu 'Awanah, Mughirah, Hammad, Amir",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ  ، حَدَّثَنَا أَبُو عَوَانَةَ  ، عَنْ مُغِيرَةَ  ، عَنْ حَمَّادٍ   : \" فِي الرَّجُلِ يَكُونُ لَهُ ثَلَاثَةُ بَنِينَ، فَقَالَ :ثُلُثِي لِأَصْغَرِ بَنِيَّ، فَقَالَ الْأَوْسَطُ : أَنَا أُجِيزُ، وَقَالَ الْأَكْبَرُ : أَنَا لَا أُجِيزُ، قَالَ : هِيَ مِنْ تِسْعَةٍ يُخْرِجُ ثَلاثَةً فَلَهُ سَهْمُهُ، وَسَهْمُ الَّذِي أَجَاز \".\nوَقَالَ حَمَّادٌ : يَرُدُّ السَّهْمَ عَلَيْهِمْ جَمِيعًا، وَقَالَ عَامِرٌ   : الَّذِي رَدَّ إِنَّمَا رَدَّ عَلَى نَفْسِهِ",
    "malay_translation": "Telah menceritakan kepada kami Yunus bin Muhammad, telah menceritakan kepada kami Abu 'Awanah, daripada Mughirah, daripada Hammad: \"Mengenai seorang lelaki yang mempunyai tiga orang anak lelaki, lalu dia berkata: 'Dua pertiga untuk anak lelaki bongsu saya.' Anak lelaki yang tengah berkata: 'Saya setuju,' dan anak lelaki yang sulung berkata: 'Saya tidak setuju.' Dia (perawi) berkata: 'Ia adalah daripada sembilan bahagian, tiga dikeluarkan, maka dia mendapat bahagiannya, dan bahagian orang yang bersetuju.'\"\nHammad berkata: \"Bahagian itu dikembalikan kepada mereka semua.\" 'Amir berkata: \"Orang yang menolak itu sebenarnya hanya menolak untuk dirinya sendiri.\""
  },
  {
    "id": 39866,
    "hadith_number": 2329,
    "tajuk_hadith": "Bukti Pengakuan Saudara",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ ، عَنْ شَرِيكٍ ، عَنْ خَالِدٍ ، عَنْ ابْنِ سِيرِينَ ، عَنْ شُرَيْحٍ  : فِي رَجُلٍ أَقَرَّ بِأَخٍ، قَالَ :\" بَيِّنَتُهُ أَنَّهُ أَخُوهُ \"",
    "malay_translation": "Telah meriwayatkan kepada kami Abu Bakr bin Abi Syaibah, telah meriwayatkan kepada kami Yahya bin Adam, daripada Syarik, daripada Khalid, daripada Ibnu Sirin, daripada Syuraih, mengenai seorang lelaki yang mengaku sebagai saudara. Beliau (Syuraih) berkata: 'Buktinya adalah bahawa dia adalah saudaranya.'"
  },
  {
    "id": 39867,
    "hadith_number": 2330,
    "tajuk_hadith": "Keutamaan Hutang Berbanding Mudarabah dalam Pembahagian Harta Pusaka",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا أَبُو عَوَانَةَ  ، عَنْ مُغِيرَةَ  ، عَنْ الْحَارِثِ الْعُكْلِيِّ   : فِي رَجُلٍ أَقَرَّ عِنْدَ مَوْتِهِ بِأَلْفِ دِرْهَمٍ مُضَارَبَةً، وَأَلْفٍ دَيْنًا، وَلَمْ يَدَعْ إِلَّا أَلْفَ دِرْهَمٍ، قَالَ :\" يُبْدَأُ بِالدَّيْنِ، فَإِنْ فَضَلَ فَضْلٌ كَانَ لِصَاحِبِ الْمُضَارَبَةِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Nu'man, telah menceritakan kepada kami Abu 'Awanah, daripada Mughirah, daripada al-Harith al-'Ukli: mengenai seorang lelaki yang mengaku semasa kematiannya tentang seribu dirham sebagai modal mudarabah, dan seribu sebagai hutang, dan dia tidak meninggalkan harta kecuali seribu dirham. Dia (perawi) berkata: 'Hutang hendaklah didahulukan, dan jika ada lebihan, maka lebihan itu adalah untuk pemilik modal mudarabah.'"
  },
  {
    "id": 39868,
    "hadith_number": 2331,
    "tajuk_hadith": "Hutang Didahulukan Daripada Warisan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ ، حَدَّثَنَا حَسَنٌ ، عَنْ مُطَرِّفٍ ، عَنْ الشَّعْبِيِّ  : \" فِي رَجُلٍ مَاتَ وَتَرَكَ ثَلَاثَ مِئَةِ دِرْهَمٍ، وَثَلَاثَةَ بَنِينَ، فَجَاءَ رَجُلٌ يَدَّعِي مِائَةَ دِرْهَمٍ عَلَى الْمَيِّتِ، فَأَقَرَّ لَهُ أَحَدُهُمْ، قَالَ :يَدْخُلُ عَلَيْهِ بِالْحِصَّةِ \"، ثُمَّ قَالَ الشَّعْبِيُّ : مَا أُرَى أَنْ يَكُونَ مِيرَاثًا، حَتَّى يُقْضَى الدَّيْنُ",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Hasan, dari Mutarrif, dari Asy-Sya'bi: \"Tentang seorang lelaki yang meninggal dunia dan meninggalkan tiga ratus dirham, dan tiga orang anak lelaki, kemudian datang seorang lelaki menuntut seratus dirham dari si mati, lalu salah seorang dari anak-anaknya mengakuinya, dia berkata: Dia (penuntut hutang) berhak mendapat bahagian.\" Kemudian Asy-Sya'bi berkata: \"Saya tidak melihatnya sebagai warisan, sehingga hutang dilunaskan.\""
  },
  {
    "id": 39869,
    "hadith_number": 2332,
    "tajuk_hadith": "Pembahagian Harta Pusaka dan Hutang Apabila Salah Seorang Waris Hilang",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو خَيْثَمَةَ مُصْعَبُ بْنُ سَعِيدٍ الْحَرَّانِيُّ  ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ  ، عَنْ الْأَشْعَثِ  ، عَنْ الْحَسَنِ   : فِي رَجُلٍ هَلَكَ وَتَرَكَ ابْنَيْنِ، وَتَرَكَ أَلْفَيْ دِرْهَمٍ، فَاقْتَسَمَا الْأَلْفَيْ دِرْهَمٍ، وَغَابَ أَحَدُ الِابْنَيْنِ، فَجَاءَ رَجُلٌ، فَاسْتَحَقَّ عَلَى الْمَيِّتِ أَلْفَ دِرْهَمٍ، قَالَ :\" يَأْخُذُ جَمِيعَ مَا فِي يَدِ هَذَا الشَّاهِدِ، وَيُقَالُ لَهُ : اتَّبِعْ أَخَاكَ الْغَائِبَ، وَخُذْ نِصْفَ مَا فِي يَدِهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Khaithamah Mus'ab bin Sa'id al-Harrani, telah menceritakan kepada kami Muhammad bin Abdullah, dari al-Asy'ath, dari al-Hasan: tentang seorang lelaki yang meninggal dunia dan meninggalkan dua orang anak lelaki, dan meninggalkan dua ribu dirham, lalu kedua-duanya membahagikan dua ribu dirham itu. Kemudian salah seorang anak lelaki itu ghaib (hilang), lalu datang seorang lelaki yang menuntut hak ke atas si mati sebanyak seribu dirham. Beliau (al-Hasan) berkata: \"Dia (lelaki yang menuntut hak) mengambil semua yang ada di tangan anak lelaki yang hadir ini, dan dikatakan kepadanya: 'Kejarlah saudaramu yang ghaib itu, dan ambillah separuh dari apa yang ada di tangannya.'\""
  },
  {
    "id": 39870,
    "hadith_number": 2333,
    "tajuk_hadith": "Pengakuan Hutang oleh Sebahagian Waris",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، عَنْ حَمَّادِ بْنِ سَلَمَةَ  ، عَنْ زِيَادٍ الْأَعْلَمِ  ، عَنْ الْحَسَنِ  ، قَالَ :\" إِذَا أَقَرَّ بَعْضُ الْوَرَثَةِ بِدَيْنٍ، فَهُوَ عَلَيْهِ بِحِصَّتِهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, dari Hammad bin Salamah, dari Ziyad al-A'lam, dari al-Hasan, dia berkata: \"Apabila sebahagian waris mengakui hutang, maka ia bertanggungjawab atas bahagiannya.\""
  },
  {
    "id": 39871,
    "hadith_number": 2334,
    "tajuk_hadith": "Kesaksian Dua Waris Mengenai Hutang",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ ، عَنْ حَمَّادِ بْنِ سَلَمَةَ ، عَنْ أَبِي هَاشِمٍ ،  عَنْ إِبْرَاهِيمَ ، قَالَ :\" إِذَا شَهِدَ اثْنَانِ مِنْ الْوَرَثَةِ بِدَيْنٍ، فَهُوَ مِنْ جَمِيعِ الْمَالِ إِذَا كَانُوا عُدُولًا \"، وَقَالَ الشَّعْبِيُّ  : عَلَيْهِمَا فِي بَاب فِي مِيرَاثِ الْمُرْتَدِّ",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, daripada Hammad bin Salamah, daripada Abu Hashim, daripada Ibrahim, dia berkata: \"Apabila dua orang waris memberi kesaksian tentang hutang, maka ia adalah dari keseluruhan harta jika mereka adil.\" Dan Asy-Sya'bi berkata: Atas keduanya dalam bab tentang warisan orang murtad."
  },
  {
    "id": 39872,
    "hadith_number": 2335,
    "tajuk_hadith": "Harta Pusaka Bagi Seorang Murtad",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى  ، حَدَّثَنَا ثَابِتُ بْنُ الْوَلِيدِ بْنِ جُمَيْعٍ  ، قَالَ : أَخْبَرَنِي أَبِي  ، عَنْ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ  ، قَالَ : كَانَ ابْنُ مَسْعُودٍ  \" يُوَرِّثُ أَهْلَ الْمُرْتَدِّ إِذَا قُتِلَ \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Isa, telah menceritakan kepada kami Thabit bin al-Walid bin Jami', dia berkata: Telah mengkhabarkan kepadaku ayahku, daripada al-Qasim bin Abd al-Rahman, dia berkata: Adalah Ibn Mas'ud mewariskan harta keluarga seorang murtad apabila dia dibunuh."
  },
  {
    "id": 39873,
    "hadith_number": 2336,
    "tajuk_hadith": "Harta Pusaka Orang Murtad Adalah untuk Waris Muslimnya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْحَجَّاجُ بْنُ مِنْهَالٍ  ، حَدَّثَنَا أَبُو عَوَانَةَ  ، عَنْ الْأَعْمَشِ  ، عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ  : أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ  \" جَعَلَ مِيرَاثَ الْمُرْتَدِّ لِوَرَثَتِهِ مِنَ الْمُسْلِمِينَ \"",
    "malay_translation": "Telah menceritakan kepada kami al-Hajjaj bin Minhal, telah menceritakan kepada kami Abu 'Awanah, daripada al-A'mash, daripada Abi 'Amr ash-Shaibani: Bahawa Ali bin Abi Talib telah menjadikan harta pusaka bagi orang yang murtad adalah untuk waris-warisnya dari kalangan Muslimin."
  },
  {
    "id": 39874,
    "hadith_number": 2337,
    "tajuk_hadith": "Hukum Pusaka bagi Orang Murtad Menurut Keputusan Ali",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، حَدَّثَنَا الْحَجَّاجُ  ، عَنِ الْحَكَمِ  : أَنَّ عَلِيًّا  \" قَضَى فِي مِيرَاثِ الْمُرْتَدِّ لِأَهْلِهِ مِنْ الْمُسْلِمِينَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah menceritakan kepada kami al-Hajjaj, daripada al-Hakam: Bahawa Ali telah memutuskan tentang harta pusaka orang murtad (diberikan) kepada ahli keluarganya dari kalangan Muslimin."
  },
  {
    "id": 39875,
    "hadith_number": 2338,
    "tajuk_hadith": "Warisan dan Diyat dalam Pembunuhan Saudara",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ  ، حَدَّثَنَا عُبَيْدُ اللَّهِ هُوَ ابْنُ عَمْرٍو  ، عَنْ عَبْدِ الْكَرِيمِ  ، عَنْ الْحَكَمِ  ، قَالَ :\" إِذَا قَتَلَ الرَّجُلُ أَخَاهُ عَمْدًا، لَمْ يُوَرَّثْ مِنْ مِيرَاثِهِ، وَلَا مِنْ دِيَتِهِ، فَإِذَا قَتَلَهُ خَطَأً، وُرِّثَ مِنْ مِيرَاثِهِ، وَلَمْ يُوَرَّثْ مِنْ دِيَتِهِ.\n قَالَ : وَكَانَ عَطَاءٌ   يَقُولُ ذَلِكَ",
    "malay_translation": "Telah meriwayatkan kepada kami Zakaria bin Adiy, telah meriwayatkan kepada kami Ubaidullah iaitu Ibnu Amru, daripada Abdul Karim, daripada al-Hakam, beliau berkata: \"Jika seseorang lelaki membunuh saudaranya dengan sengaja, dia tidak akan mewarisi harta pusaka saudaranya, dan juga tidak mendapat diyat (pampasan darah). Namun, jika dia membunuhnya secara tidak sengaja, dia akan mewarisi harta pusaka saudaranya, tetapi tidak mendapat diyat (pampasan darah).\" Beliau berkata: Dan 'Ata' juga berkata demikian."
  },
  {
    "id": 39876,
    "hadith_number": 2339,
    "tajuk_hadith": "Tiada Warisan Bagi Pembunuh Ibu dan Kewajipan Diyat",
    "perawi_melayu": "Muhammad bin Uyainah, Ali bin Mus-hir, Sa'id, Qatadah, Khilas, Ali",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ  ، عَنْ عَلِيِّ بْنِ مُسْهِرٍ  ، عَنْ سَعِيدٍ  ، عَنْ قَتَادَةَ  ، عَنْ خِلَاسٍ  ، عَنْ عَلِيٍّ  ، قَالَ : رَمَى رَجُلٌ أُمَّهُ بِحَجَرٍ فَقَتَلَهَا، فَطَلَبَ مِيرَاثَهُ مِنْ إِخْوَتِهِ، فَقَالَ لَهُ إِخْوَتُهُ : لَا مِيرَاثَ لَكَ، فَارْتَفَعُوا إِلَى عَلِيٍّ،\" فَجَعَلَ عَلَيْهِ الدِّيَةَ، وَأَخْرَجَهُ مِنْ الْمِيرَاثِ \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Uyainah, daripada Ali bin Mus-hir, daripada Sa'id, daripada Qatadah, daripada Khilas, daripada Ali, beliau berkata: Seorang lelaki melempar ibunya dengan batu lalu membunuhnya. Kemudian dia menuntut warisannya dari saudara-saudaranya. Saudara-saudaranya berkata kepadanya: \"Tidak ada warisan bagimu.\" Lalu mereka mengadu kepada Ali, maka Ali menetapkan diyat (denda) atasnya, dan mengeluarkannya dari warisan."
  },
  {
    "id": 39877,
    "hadith_number": 2340,
    "tajuk_hadith": "Larangan Mewarisi Harta Pusaka Jika Membunuh Isteri Secara Tidak Sengaja",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا زُهَيْرٌ  ، عَنْ الْحَسَنِ بْنِ الْحُرِّ  ، عَنْ الْحَكَمِ   : أَنَّ الرَّجُلَ إِذَا قَتَلَ امْرَأَتَهُ خَطَأً، \" أَنَّهُيُمْنَعُ مِيرَاثَهُ مِنْ الْعَقْلِ وَغَيْرِهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Zuhair, daripada al-Hasan bin al-Hurr, daripada al-Hakam: Bahawa seorang lelaki apabila membunuh isterinya secara tidak sengaja, \"bahawa dia dihalang daripada mewarisi daripada 'aql (diyat) dan lain-lainnya.\""
  },
  {
    "id": 39878,
    "hadith_number": 2341,
    "tajuk_hadith": "Pembunuh Tidak Mewarisi Harta Pusaka Mangsa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ لَيْثٍ  ، عَنْ مُجَاهِدٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ :\" لَا يَرِثُ الْقَاتِلُ مِنْ الْمَقْتُولِ شَيْئًا \"",
    "malay_translation": "Abu Nu'aim memberitahu kami, Sufyan menceritakan kepada kami, daripada Laith, daripada Mujahid, daripada Ibn Abbas, dia berkata: \"Pembunuh tidak mewarisi apa-apa daripada orang yang dibunuh.\""
  },
  {
    "id": 39879,
    "hadith_number": 2342,
    "tajuk_hadith": "Warisan Suami Jika Isteri Direjam",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ الْمُغِيرَةِ ، عَنْ ابْنِ الْمُبَارَكِ ، عَنْ مَعْمَرٍ ، عَنْ قَتَادَةَ  : \" فِي رَجُلٍ قَذَفَ امْرَأَتَهُ، وَجَاءَ بِشُهُودٍ فَرُجِمَتْ؟ قَالَ :يَرِثُهَا \"",
    "malay_translation": "Telah menceritakan kepada kami Sa'id bin al-Mughirah, daripada Ibn al-Mubarak, daripada Ma'mar, daripada Qatadah: \"Tentang seorang lelaki yang menuduh isterinya berzina, dan dia membawa saksi lalu wanita itu direjam?\" Beliau (Qatadah) berkata: \"Dia (suami) mewarisinya.\""
  },
  {
    "id": 39880,
    "hadith_number": 2343,
    "tajuk_hadith": "Hukum Waris-Mewarisi dalam Kes Hukuman Hudud",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا أَبُو عَوَانَةَ  ، عَنْ حَمَّادٍ   : \" فِي رَجُلٍ جُلِدَ الْحَدَّ أَرَاهُ مَاتَ، شَكَّ أَبُو النُّعْمَانِ ؟ قَالَ :يَتَوَارَثَانِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'man, telah menceritakan kepada kami Abu 'Awanah, daripada Hammad: \"Mengenai seorang lelaki yang dikenakan hukuman hudud dan saya rasa dia telah meninggal dunia (Abu Nu'man ragu dalam menyebutkan 'meninggal dunia'). Dia (Hammad) berkata: Mereka berdua saling mewarisi (harta).\""
  },
  {
    "id": 39881,
    "hadith_number": 2344,
    "tajuk_hadith": "Pembunuh Tidak Mewarisi Harta Pusaka",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ  ، حَدَّثَنَا أَبُو عَوَانَةَ  ، عَنْ مُحَمَّدِ بْنِ سَالِمٍ  ، عَنْ عَامِرٍ  ، عَنْ عَلِيٍّ  ، قَالَ :\" الْقَاتِلُ لَا يَرِثُ، وَلَا يَحْجُبُ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu an-Nu'man, telah menceritakan kepada kami Abu 'Awanah, daripada Muhammad bin Salim, daripada 'Amir, daripada 'Ali, beliau berkata: \"Pembunuh tidak mewarisi, dan tidak menghalangi (warisan).\""
  },
  {
    "id": 39882,
    "hadith_number": 2345,
    "tajuk_hadith": "Pembunuh Tidak Mewarisi Harta Pusaka",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا حَسَنٌ  ، عَنْ لَيْثٍ  ، عَنْ أَبِي عَمْرٍو الْعَبْدِيِّ  ، عَنْ عَلِيٍّ  ، قَالَ :\" لَا يُوَرَّثُ الْقَاتِلُ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Hasan, dari Laith, dari Abu 'Amr al-'Abdi, dari Ali, dia berkata: \"Pembunuh tidak mewarisi.\""
  },
  {
    "id": 39883,
    "hadith_number": 2346,
    "tajuk_hadith": "Pembunuh Tidak Mewarisi Harta Pusaka",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ  ، حَدَّثَنَا أَبُو بَكْرٍ  ، عَنْ مُطَرِّفٍ  ، عَنْ الشَّعْبِيِّ  ، قَالَ : قَالَ عُمَرُ   :\" لَا يَرِثُ قَاتِلٌ خَطَأً، وَلَا عَمْدًا \"",
    "malay_translation": "Telah menceritakan kepada kami Zakaria bin Adiy, telah menceritakan kepada kami Abu Bakar, dari Mutarrif, dari Asy-Sya'bi, dia berkata: Umar berkata: \"Tidak mewarisi seorang pembunuh, sama ada tersalah atau sengaja.\""
  },
  {
    "id": 39884,
    "hadith_number": 2347,
    "tajuk_hadith": "Pembunuh Tidak Mewarisi",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ لَيْثٍ  ، عَنْ طَاوُسٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ :\" لَا يَرِثُ الْقَاتِلُ \"",
    "malay_translation": "Muhammad bin Yusuf memberitahu kami, daripada Sufyan, daripada Laith, daripada Tawus, daripada Ibn Abbas, dia berkata: \"Pembunuh tidak mewarisi.\""
  },
  {
    "id": 39885,
    "hadith_number": 2348,
    "tajuk_hadith": "Peraturan Warisan Jika Dua Keturunan Berkumpul",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى ، حَدَّثَنَا عَبْدُ الْأَعْلَى ، عَنْ مَعْمَرٍ ، عَنْ الزُّهْرِيِّ ، قَالَ :\" إِذَا اجْتَمَعَ نَسَبَانِ، وُرِّثَ بِأَكْبَرِهِمَا، يَعْنِي الْمَجُوسَ \"",
    "malay_translation": "Muhammad bin Isa telah mengkhabarkan kepada kami, Abdul A'la telah menceritakan kepada kami, daripada Ma'mar, daripada al-Zuhri, yang berkata: \"Apabila dua keturunan berkumpul, pusaka diwarisi melalui keturunan yang lebih besar, iaitu Majusi.\""
  },
  {
    "id": 39886,
    "hadith_number": 2349,
    "tajuk_hadith": "Warisan dari Sisi yang Sah dan Tidak Sah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، عَنْ حَمَّادِ بْنِ أَبِي سُلَيْمَانَ  ، قَالَ :\" يَرِثُ مِنْ الْجَانِبِ الَّذِي يَصْلُحُ، وَلَا يَرِثُ مِنْ الْجَانِبِ الَّذِي لَا يَصْلُحُ \"",
    "malay_translation": "Telah menceritakan kepada kami Hajjaj bin Minhal, telah menceritakan kepada kami Hammad bin Salamah, daripada Hammad bin Abi Sulaiman, beliau berkata: 'Dia mewarisi dari sisi yang sah, dan tidak mewarisi dari sisi yang tidak sah.'"
  },
  {
    "id": 39887,
    "hadith_number": 2350,
    "tajuk_hadith": "Hukum Waris bagi Majusi yang Memeluk Islam",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَجَّاجٌ  ، حَدَّثَنَا حَمَّادٌ  ، عَنْ سُفْيَانَ الثَّوْرِيِّ  ، عَنْ رَجُلٍ  ، عَنْ الشَّعْبِيِّ  : أَنَّ عَلِيًّا  ، وَابْنَ مَسْعُودٍ  ، قَالَا فِي الْمَجُوسِ :\" إِذَا أَسْلَمُوا، يَرِثُونَ مِنْ الْقَرَابَتَيْنِ جَمِيعًا \"",
    "malay_translation": "Hajjaj telah meriwayatkan kepada kami, Hammad telah meriwayatkan kepada kami, daripada Sufyan al-Tsauri, daripada seorang lelaki, daripada al-Sya'bi: bahawa Ali dan Ibn Mas'ud berkata mengenai Majusi: \"Apabila mereka memeluk Islam, mereka mewarisi daripada kedua-dua pertalian kekerabatan sepenuhnya.\""
  },
  {
    "id": 39888,
    "hadith_number": 2351,
    "tajuk_hadith": "Wanita Tawanan Saling Mewarisi",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ ، حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ ، عَنْ أَبِيهِ ، عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ  فِي امْرَأَةِ الْأَسِيرِ : \" أَنَّهَاتَرِثُهُ وَيَرِثُهَا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yahya bin Hassan, telah menceritakan kepada kami Ibn Abi Az-Zinad, daripada bapanya, daripada Umar bin Abdul Aziz mengenai wanita tawanan: \"Bahawa dia mewarisinya dan dia mewarisinya.\""
  },
  {
    "id": 39889,
    "hadith_number": 2352,
    "tajuk_hadith": "Kebenaran Wasiat Tawanan Selagi Berpegang pada Agama",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْفَضْلِ ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ ، حَدَّثَنِي مَعْمَرٌ ، عَنْ إِسْحَاق بْنِ رَاشِدٍ ، عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ  فِي الْأَسِيرِ يُوصِي، قَالَ :\" أُجيزُ لَهُ وَصِيَّتَهُ مَا دَامَ عَلَى دِينِهِ لَمْ يَتَغَيَّرْ عَنْ دِينِهِ \"",
    "malay_translation": "Muhammad bin al-Fadl meriwayatkan kepada kami, Abdullah bin al-Mubarak meriwayatkan kepada kami, Ma'mar meriwayatkan kepada saya, daripada Ishaq bin Rashid, daripada Umar bin Abdul Aziz mengenai tawanan yang membuat wasiat, beliau berkata: 'Saya membenarkan wasiatnya selagi dia berada dalam agamanya, tidak berubah daripada agamanya.'"
  },
  {
    "id": 39890,
    "hadith_number": 2353,
    "tajuk_hadith": "Hukum Warisan bagi Tawanan Perang",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ ، حَدَّثَنَا سُفْيَانُ ، عَنْ دَاوُدَ ، عَنْ الشَّعْبِيِّ ، عَنْ شُرَيْحٍ ، قَالَ :\" يُوَرَّثُ الْأَسِيرُ إِذَا كَانَ فِي أَيْدِي الْعَدُوِّ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Yusuf, telah menceritakan kepada kami Sufyan, daripada Daud, daripada al-Sha'bi, daripada Shuraih, dia berkata: \"Tawanan perang diwarisi jika dia berada di tangan musuh.\""
  },
  {
    "id": 39891,
    "hadith_number": 2354,
    "tajuk_hadith": "Hukum Pusaka bagi Tawanan Perang",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدٌ ، قَالَ : حَدَّثَنَا سُفْيَانُ ، حَدَّثَنِي مَنْ سَمِعَ إِبْرَاهِيمَ ، يَقُولُ :\" يُوَرَّثُ الْأَسِيرُ \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad, dia berkata: Telah menceritakan kepada kami Sufyan, telah menceritakan kepadaku orang yang mendengar Ibrahim berkata: \"Tawanan perang diwarisi.\""
  },
  {
    "id": 39892,
    "hadith_number": 2355,
    "tajuk_hadith": "Hukum Waris bagi Tawanan Perang",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْمُعَلَّى بْنُ أَسَدٍ ، حَدَّثَنَا وُهَيْبٌ ، عَنْ دَاوُدَ ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ  : أَنَّهُ كَانَ\" لَا يُوَرِّثُ الْأَسِيرَ \"",
    "malay_translation": "Telah meriwayatkan kepada kami Al-Mu'alla bin Asad, telah meriwayatkan kepada kami Wuhaib, daripada Daud, daripada Sa'id bin Al-Musayyib: bahawasanya beliau tidak mewariskan harta kepada tawanan perang."
  },
  {
    "id": 39893,
    "hadith_number": 2356,
    "tajuk_hadith": "Hukum Waris untuk Kandungan Memerlukan Bukti",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، حَدَّثَنَا الْأَشْعَثُ  ، عَنْ الشَّعْبِيِّ  ، قَالَ : كَتَبَ عُمَرُ بْنُ الْخَطَّابِ   إِلَى شُرَيْحٍ : أَنْ\" لَا يُوَرِّثَ الْحَمِيلَ إِلَّا بِبَيِّنَةٍ، وَإِنْ جَاءَتْ بِهِ فِي خِرَقِهَا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah menceritakan kepada kami Al-Asy'ath, daripada Asy-Sya'bi, dia berkata: Umar bin Al-Khattab telah menulis surat kepada Syuraih: 'Bahawa jangan mewariskan kandungan kecuali dengan bukti yang jelas, walaupun dia melahirkannya dalam kainnya.'"
  },
  {
    "id": 39894,
    "hadith_number": 2357,
    "tajuk_hadith": "Pewarisan al-Hamila",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ ، عَنْ إِسْرَائِيلَ ، عَنْ مَنْصُورٍ ، عَنْ إِبْرَاهِيمَ ، قَالَ :\" وَرِّثْ الْحَمِيلَ \"",
    "malay_translation": "Ubaidullah telah memberitahu kami, daripada Israil, daripada Mansur, daripada Ibrahim, beliau berkata: \"Warisi al-Hamila.\""
  },
  {
    "id": 39895,
    "hadith_number": 2358,
    "tajuk_hadith": "Orang Gila Tidak Mewarisi Harta Pusaka",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو سَعِيدٍ مِنْ بَنِي أُمَيَّةَ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي مَرْيَمَ ، عَنْ ضَمْرَةَ ، وَالْفُضَيْلِ بْنِ فَضَالَةَ ، وَابْنِ أَبِي عَوْفٍ ، وراشد ، وعطية ، قَالُوا :\" لَا يُوَرَّثُ الْحُمَلَاءُ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Sa'id dari Bani Umayyah, daripada Abu Bakr bin Abdullah bin Abi Maryam, daripada Dhamrah, al-Fudail bin Fadalah, Ibn Abi Auf, Rashid, dan Atiyyah, mereka berkata: \"Orang gila tidak mewarisi harta pusaka.\""
  },
  {
    "id": 39896,
    "hadith_number": 2359,
    "tajuk_hadith": "Pengiktirafan Nasab di Kalangan Muhajirin dan Ansar",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ الْمُغِيرَةِ ، قَالَ : قَالَ ابْنُ الْمُبَارَكِ : حَدَّثَنَا ابْنُ عَوْنٍ ، عَنْ مُحَمَّدٍ ، قَالَ : ذُكِرَ عِنْدَهُ قَوْلُ مَنْ يَقُولُ فِي الْحَمِيلِ، فَأَنْكَرَ ذَلِكَ، وَقَالَ :\" قَدْ تَوَارَثَ الْمُهَاجِرُونَ، وَالْأَنْصَارُ بِنَسَبِهِمْ الَّذِي كَانَ فِي الْجَاهِلِيَّةِ \"",
    "malay_translation": "Telah meriwayatkan kepada kami Sa'id bin al-Mughirah, dia berkata: Ibn al-Mubarak berkata: Telah meriwayatkan kepada kami Ibn 'Aun, daripada Muhammad, dia berkata: Disebutkan di hadapannya pendapat tentang 'al-Hamil', lalu beliau mengingkarinya dan berkata: \"Sesungguhnya golongan Muhajirin dan Ansar telah mewarisi (hubungan kekeluargaan) berdasarkan nasab mereka yang wujud sejak zaman Jahiliyah.\""
  },
  {
    "id": 39897,
    "hadith_number": 2360,
    "tajuk_hadith": "Kandungan Tidak Mewarisi Harta Pusaka Tanpa Bukti",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، عَنْ ابْنِ إِدْرِيسَ ، عَنْ هِشَامٍ ، عَنْ الْحَسَنِ ، وَابْنِ سِيرِينَ ، قَالَا :\" لَا يُوَرَّثُ الْحَمِيلُ إِلَّا بِبَيِّنَةٍ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Bakr bin Abi Syaibah, daripada Ibn Idris, daripada Hisyam, daripada al-Hasan, dan Ibn Sirin, mereka berdua berkata: 'Kandungan tidak mewarisi harta pusaka kecuali dengan bukti.'"
  },
  {
    "id": 39898,
    "hadith_number": 2361,
    "tajuk_hadith": "Wanita Hamil Tidak Mewarisi Harta (Menurut Sahabat)",
    "perawi_melayu": "Ibrahim",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرٍ ، حَدَّثَنَا جَرِيرٌ ، عَنْ لَيْثٍ ، عَنْ حَمَّادٍ ، عَنْ إِبْرَاهِيمَ ، قَالَ :\" لَمْ يَكُنْ أَبُو بَكْرٍ، وَعُمَرُ، وَعُثْمَانُ يُوَرِّثُونَ الْحَمِيلَ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Bakr, telah menceritakan kepada kami Jarir, daripada Layth, daripada Hammad, daripada Ibrahim, yang berkata: 'Abu Bakr, Umar, dan Uthman tidak mewariskan harta kepada wanita hamil.'"
  },
  {
    "id": 39899,
    "hadith_number": 2362,
    "tajuk_hadith": "Pewarisan Berdasarkan Pengakuan Keturunan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرٍ ، حَدَّثَنَا عَبْدُ الرَّحِيمِ الْمُحَارِبِيُّ ، عَنْ زَائِدَةَ ، عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ ، قَالَ :\" أَقَرَّتْ امْرَأَةٌ مِنْ مُحَارِبٍ جَلِيبَةٌ بِنَسَبٍ لَهَا جَلِيبٍ، فَوَرَّثَهُ عَبْدُ اللَّهِ بْنُ عُتْبَةَ  مِنْ أُخْتِهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Bakr, telah menceritakan kepada kami Abdul Rahim al-Muharibi, daripada Zaidah, daripada Asy'ath bin Abi asy-Sya'tha', dia berkata: 'Seorang wanita dari Muharib mengakui keturunan Jalib, lalu Abdullah bin Utbah mewariskannya dari saudara perempuannya.'"
  },
  {
    "id": 39900,
    "hadith_number": 2363,
    "tajuk_hadith": "Penetapan Warisan Berdasarkan Pengakuan Hamba Sahaya Ketika Menjelang Kematian",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ ، حَدَّثَنِي اللَّيْثُ ، حَدَّثَنِي يُونُسُ ، عَنْ ابْنِ شِهَابٍ ، عَنْ رَجُلٍ قَالَ عِنْدَ فِرَاقِ الدُّنْيَا : أَنَا مَوْلَى فُلَانٍ، قَالَ :\" يُرَدُّ مِيرَاثَهُ لِمَنْ سَمَّى أَنَّهُ مَوْلَاهُ عِنْدَ فِرَاقِ الدُّنْيَا، إِلَّا أَنْ يَأْتُوا عَلَيْهِ بِبَيِّنَةٍ بِغَيْرِ ذَلِكَ يَرُدُّونَ بِهِ قَوْلَهُ، فَيُرَدُّ مِيرَاثُهُ إِلَى مَا قَامَتْ بِهِ الْبَيِّنَةُ \"",
    "malay_translation": "Abdullah bin Salih telah menceritakan kepada kami, katanya al-Layth telah menceritakan kepadaku, katanya Yunus telah menceritakan kepadaku, dari Ibn Shihab, dari seorang lelaki yang berkata ketika saat kematiannya: \"Saya adalah hamba sahaya kepada si fulan.\" Beliau (Nabi atau perawi) bersabda: \"Harta pusakanya hendaklah dikembalikan kepada orang yang dinamakan sebagai tuannya ketika saat kematiannya, kecuali jika mereka (waris) membawa keterangan yang bertentangan dengannya, maka harta pusakanya dikembalikan mengikut keterangan yang dikemukakan.\""
  },
  {
    "id": 39901,
    "hadith_number": 2364,
    "tajuk_hadith": "Status Anak Zina",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا شَرِيكٌ  ، عَنْ مُحَمَّدِ بْنِ سَالِمٍ  ، عَنْ الشَّعْبِيِّ  ، عَنْ عَلِيٍّ  ، وَعَبْدِ اللَّهِ   ، قَالَا :\" وَلَدُ الزِّنَا بِمَنْزِلَةِ ابْنِ الْمُلَاعَنَةِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu Nu'aim, telah menceritakan kepada kami Syarik, daripada Muhammad bin Salim, daripada al-Sya'bi, daripada Ali dan Abdullah, mereka berdua berkata: \"Anak zina adalah seperti anak yang dila'nat.\""
  },
  {
    "id": 39902,
    "hadith_number": 2365,
    "tajuk_hadith": "Anak Zina Tidak Mewarisi dan Tidak Diwarisi",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ ، حَدَّثَنَا زُهَيْرٌ ، عَنْ الْحَسَنِ بْنِ الْحُرِّ ، حَدَّثَنِي الْحَكَمُ  : أَنَّ\" وَلَدَ الزِّنَا لَا يَرِثُهُ الَّذِي يَدَّعِيهِ، وَلَا يَرِثُهُ الْمَوْلُودُ \"",
    "malay_translation": "Abu Nu'aim memberitahu kami, Zuhair menceritakan kepada kami, daripada Al-Hasan bin Al-Hurr, Al-Hakam menceritakan kepada saya: \"Sesungguhnya anak zina tidak mewarisi daripada orang yang mengakuinya, dan tidak juga diwarisi oleh anak yang dilahirkan itu.\""
  },
  {
    "id": 39903,
    "hadith_number": 2366,
    "tajuk_hadith": "Hukum Tidak Mewarisi Anak Zina",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا رَوْحٌ ، عَنْ مُحَمَّدِ بْنِ أَبِي حَفْصَةَ ، عَنْ الزُّهْرِيِّ ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ  أَنَّهُ كَانَ\" لَا يُوَرِّثُ وَلَدَ الزِّنَا، وَإِنْ ادَّعَاهُ الرَّجُلُ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Bakr bin Abi Syaibah, telah menceritakan kepada kami Rauh, dari Muhammad bin Abi Hafsah, dari al-Zuhri, dari Ali bin Husain, bahawa sesungguhnya beliau tidak mewariskan anak zina, walaupun lelaki itu mengakuinya."
  },
  {
    "id": 39904,
    "hadith_number": 2367,
    "tajuk_hadith": "Pengakuan Anak Zina dan Hak Waris",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، حَدَّثَنِي بَكْرُ بْنُ مُضَرَ  ، عَنْ عَمْرٍو يَعْنِي ابْنَ الْحَارِثِ  ، عَنْ بُكَيْرٍ  ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ  ، قَالَ : \" أَيُّمَا رَجُلٍ أَتَى إِلَى غُلَامٍ يَزْعُمُ أَنَّهُ ابْنٌ لَهُ، وَأَنَّهُ زَنَى بِأُمِّهِ، وَلَمْ يَدَّعِ ذَلِكَ الْغُلَامَ أَحَدٌ، فَهُوَ يَرِثُهُ \".\nقَالَ بُكَيْرٌ : وَسَأَلْتُ عُرْوَةَ عَنْ ذَلِكَ، فَقَالَ مِثْلَ قَوْلِ سُلَيْمَانَ بْنِ يَسَارٍ وَقَالَ عُرْوَةُ   : بَلَغَنَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" الْوَلَدُ لِلْفِرَاشِ، وَلِلْعَاهِرِ الْحَجَرُ \"",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Salih, telah menceritakan kepadaku Bakr bin Mudar, daripada 'Amru iaitu Ibnu al-Harith, daripada Bukair, daripada Sulaiman bin Yasar, beliau berkata: \"Sesiapa sahaja lelaki yang datang kepada seorang budak lelaki dan mendakwa bahawa budak itu adalah anaknya, dan dia telah berzina dengan ibu budak itu, dan tidak ada sesiapa pun yang mengakui budak lelaki itu sebagai anak, maka lelaki itu mewarisinya.\" Bukair berkata: Dan saya telah bertanya kepada Urwah tentang perkara ini, dan beliau berkata seperti perkataan Sulaiman bin Yasar. Dan Urwah berkata: Telah sampai kepada kami bahawa Rasulullah صلى الله عليه وسلم bersabda: \"Anak itu adalah milik pemilik tempat tidur, dan penzina tidak berhak (ke atas anak).\""
  },
  {
    "id": 39905,
    "hadith_number": 2368,
    "tajuk_hadith": "Hukum Warisan Anak Perempuan yang Dilaknat dan Anak Zina",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى  ، عَنْ حَفْصِ بْنِ غِيَاثٍ  ، عَنْ عَمْرٍو  ، عَنْ الْحَسَنِ  ، قَالَ :\" ابْنُ الْمُلَاعَنَةِ مِثْلُ وَلَدِ الزِّنَا، تَرِثُهُ أُمُّهُ، وَوَرَثَتُهُ، وَرَثَةُ أُمِّهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Ibrahim bin Musa, daripada Hafs bin Ghiyath, daripada 'Amr, daripada al-Hasan, dia berkata: \"Anak perempuan yang dila'nat seperti anak zina, ibunya mewarisinya, dan warisnya adalah waris ibunya.\""
  },
  {
    "id": 39906,
    "hadith_number": 2369,
    "tajuk_hadith": "Hukum Anak Zina dalam Pewarisan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ ، حَدَّثَنَا أَبُو عَوَانَةَ ، عَنْ مُغِيرَةَ ، عَنْ إِبْرَاهِيمَ ، قَالَ :\" لَا يُوَرَّثُ وَلَدُ الزِّنَا \"",
    "malay_translation": "Telah menceritakan kepada kami Abu An Nu'man, telah menceritakan kepada kami Abu 'Awanah, dari Mughirah, dari Ibrahim, dia berkata: \"Anak zina tidak mewarisi.\""
  },
  {
    "id": 39907,
    "hadith_number": 2370,
    "tajuk_hadith": "Hukum Warisan bagi Anak Luar Nikah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ الْمُغِيرَةِ ، عَنْ ابْنِ الْمُبَارَكِ ، عَنْ مَعْمَرٍ ، أَوْ يُونُسَ ، عَنْ الزُّهْرِيِّ  : فِي أَوْلَادِ الزِّنَا، قَالَ :\" يَتَوَارَثُونَ مِنْ قِبَلِ الْأُمَّهَاتِ، وَإِنْ وَلَدَتْ تَوْءَمًا فَمَاتَ، وَرِثَ السُّدُسَ \"",
    "malay_translation": "Telah menceritakan kepada kami Sa'id bin Al-Mughirah, dari Ibn Al-Mubarak, dari Ma'mar, atau Yunus, dari Az-Zuhri: mengenai anak-anak zina, beliau berkata: \"Mereka saling mewarisi dari pihak ibu, dan jika dia melahirkan anak kembar lalu meninggal dunia, maka dia mewarisi seperenam.\""
  },
  {
    "id": 39908,
    "hadith_number": 2371,
    "tajuk_hadith": "Anak Zina Tidak Mewarisi",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، قَالَ : حَدَّثَنَا هُشَيْمٌ ، عَنْ مُغِيرَةَ ، عَنْ شِبَاكٍ ، عَنْ إِبْرَاهِيمَ ، قَالَ :\" لَا يَرِثُ وَلَدُ الزِّنَا، إنما يرث من لم يقم على أبيه الحد، أو تملك أمه بنكاح 3، أو شراء \"",
    "malay_translation": "Abu Bakr bin Abi Shaybah meriwayatkan kepada kami, beliau berkata: Hushaym meriwayatkan kepada kami, daripada Mughirah, daripada Shibak, daripada Ibrahim, beliau berkata: 'Anak zina tidak mewarisi; warisan hanya untuk orang yang tidak dikenakan hukuman had ke atas ayahnya, atau ibunya dimiliki melalui perkahwinan atau pembelian.'"
  },
  {
    "id": 39909,
    "hadith_number": 2372,
    "tajuk_hadith": "Hukum Lelaki Berzina Kemudian Mengahwini Wanita Tersebut",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيل بْنُ أَبَانَ  ، عَنْ مُوسَى بْنِ مُحَمَّدٍ الْأَنْصَارِيِّ  ، عَنْ إِسْمَاعِيل  ، عَنْ الْحَسَنِ   فِي الرَّجُلِ يَفْجُرُ بِالْمَرْأَةِ، ثُمَّ يَتَزَوَّجُهَا، قَالَ :\" لَا بَأْسَ، إِلَّا أَنْ تَكُونَ حُبْلَى، فَإِنَّ الْوَلَدَ لَا يَلْحَقُهُ \"",
    "malay_translation": "Telah menceritakan kepada kami Ismail bin Aban, daripada Musa bin Muhammad al-Ansari, daripada Ismail, daripada al-Hasan, mengenai seorang lelaki yang berzina dengan seorang wanita, kemudian menikahinya. Beliau berkata: \"Tidak mengapa, kecuali jika wanita itu hamil, maka anak itu tidak dinasabkan kepadanya.\""
  },
  {
    "id": 39910,
    "hadith_number": 2373,
    "tajuk_hadith": "Hukum Nasab Anak Selepas Kematian Bapa dan Hak Waris",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا زَيْدُ بْنُ يَحْيَى  ، عَنْ مُحَمَّدِ بْنِ رَاشِدٍ  ، عَنْ سُلَيْمَانَ بْنِ مُوسَى  ، عَنْ عَمْرِو بْنِ شُعَيْبٍ  ، عَنْ أَبِيهِ  ، عَنْ جَدِّهِ   : أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : قَضَى أَنَّ\" كُلَّ مُسْتَلْحَقٍ اسْتُلْحِقَ بَعْدَ أَبِيهِ الَّذِي ادَّعَاهُ وَرَثَتُهُ بَعْدَهُ، فَقَضَى إِنْ كَانَ مِنْ أَمَةٍ يَمْلِكُهَا يَوْمَ يَطَؤُهَا، فَقَدْ لَحِقَ بِمَنْ اسْتَلْحَقَهُ، وَلَيْسَ لَهُ فِيمَا قُسِمَ قَبْلَهُ مِنْ الْمِيرَاثِ شَيْءٌ، وَمَا أَدْرَكَ مِنْ مِيرَاثٍ لَمْ يُقْسَمْ، فَلَهُ نَصِيبُهُ، وَلَا يَلْحَقُ إِذَا كَانَ الَّذِي يُدْعَى لَهُ أَنْكَرَهُ، وَإِنْ كَانَ مِنْ أَمَةٍ لَا يَمْلِكُهَا، أَوْ حُرَّةٍ عَاهَرَهَا، فَإِنَّهُ لَا يَلْحَقُ وَلَا يَرِثُ، وَإِنْ كَانَ الَّذِي يُدْعَى لَهُ هُوَ ادَّعَاهُ، فَهُوَ وَلَدُ زِنَا لِأَهْلِ أُمِّهِ مَنْ كَانُوا : حُرَّةً، أَوْ أَمَةً \"",
    "malay_translation": "Telah menceritakan kepada kami Zaid bin Yahya, daripada Muhammad bin Rashid, daripada Sulaiman bin Musa, daripada 'Amr bin Syu'aib, daripada ayahnya, daripada datuknya: Bahawa Rasulullah SAW telah memutuskan bahawa \"Setiap anak yang dinasabkan (kepada seseorang) setelah bapanya (yang mengakuinya) meninggal dunia, dan diakui oleh warisnya setelah itu, maka diputuskan jika anak itu dari hamba perempuan yang dimilikinya pada hari dia menyetubuhinya, maka anak itu menjadi nasab kepada orang yang mengakuinya. Dan dia tidak berhak mendapat apa-apa dari harta warisan yang telah dibahagikan sebelumnya. Tetapi apa yang didapatinya dari harta warisan yang belum dibahagikan, maka dia mendapat bahagiannya. Dan anak itu tidak dinasabkan jika orang yang didakwa sebagai bapanya mengingkarinya. Dan jika anak itu dari hamba perempuan yang tidak dimilikinya, atau wanita merdeka yang dizinainya, maka anak itu tidak dinasabkan dan tidak mewarisi. Dan jika orang yang didakwa sebagai bapanya itu sendiri yang mengakuinya, maka anak itu adalah anak zina bagi keluarga ibunya, siapa pun mereka, sama ada wanita merdeka atau hamba perempuan.\""
  },
  {
    "id": 39911,
    "hadith_number": 2374,
    "tajuk_hadith": "Larangan Menjual Hamba Anak Zina dan Memakan Hasil Jualannya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ ، عَنْ الْحَسَنِ ، عَنْ عُمَيْرِ بْنِ يَزِيدَ ، قَالَ : سَأَلْتُ الشَّعْبِيَّ  عَنْ مَمْلُوكٍ لِي وَلَدُ زِنًا، قَالَ :\" لَا تَبِعْهُ، وَلَا تَأْكُلْ ثَمَنَهُ، وَاسْتَخْدِمْهُ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, daripada al-Hasan, daripada Umair bin Yazid, dia berkata: Saya bertanya kepada al-Sya'bi tentang seorang hamba milikku yang merupakan anak zina, dia berkata: \"Jangan jual dia, dan jangan makan harganya, dan gunakan dia (untuk berkhidmat).\""
  },
  {
    "id": 39912,
    "hadith_number": 2375,
    "tajuk_hadith": "Hukum Warisan Anak Zina yang Meninggal Dunia",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ ، عَنْ سَعِيدٍ ، عَنْ الزُّهْرِيِّ  : سُئِلَ عَنْ وَلَدِ زِنَا يَمُوتُ، قَالَ :\" إِنْ كَانَ ابْنَ عَرَبِيَّةٍ، وَرِثَتْ أُمُّهُ الثُّلُثَ، وَجُعِلَ بَقِيَّةُ مَالِهِ فِي بَيْتِ الْمَالِ، وَإِنْ كَانَ ابْنَ مَوْلَاةٍ، وَرِثَتْ أُمُّهُ الثُّلُثَ، وَوَرِثَ مَوَالِيهَا الَّذِينَ أَعْتَقُوهَا مَا بَقِيَ.\nقَالَ مَرْوَانُ : سَمِعْتُ مَالِكًا  يَقُولُ ذَلِكَ",
    "malay_translation": "Telah menceritakan kepada kami Marwan bin Muhammad, dari Sa'id, dari Az-Zuhri: Beliau ditanya tentang anak zina yang meninggal dunia. Beliau berkata: \"Jika dia adalah anak wanita Arab merdeka, maka ibunya mewarisi sepertiga (hartanya), dan sisa hartanya ditempatkan di Baitul Mal. Dan jika dia adalah anak hamba sahaya, maka ibunya mewarisi sepertiga (hartanya), dan tuan-tuan yang memerdekakannya mewarisi sisanya.\" Marwan berkata: Saya mendengar Malik mengatakan demikian."
  },
  {
    "id": 39913,
    "hadith_number": 2376,
    "tajuk_hadith": "Warisan Anak Li'an adalah untuk Ibu",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ  ، حَدَّثَنَا الْهَيْثَمُ بْنُ حُمَيْدٍ  ، عَنْ الْعَلَاءِ بْنِ الْحَارِثِ  ، حَدَّثَنِي عَمْرُو بْنُ شُعَيْبٍ   : أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" قَضَى بِمِيرَاثِ ابْنِ الْمُلَاعَنَةِ لِأُمِّهِ كُلِّهِ، لِمَا لَقِيَتْ فِيهِ مِنْ الْعَنَاءِ \"",
    "malay_translation": "Menceritakan kepada kami Marwan bin Muhammad, menceritakan kepada kami al-Haitham bin Humaid, daripada al-'Ala' bin al-Harith, menceritakan kepadaku 'Amr bin Syu'aib: Bahawa Nabi SAW memutuskan warisan anak yang dila'nat (anak li'an) adalah untuk ibunya sepenuhnya, kerana kesusahan yang telah dialaminya."
  },
  {
    "id": 39914,
    "hadith_number": 2377,
    "tajuk_hadith": "Hukum Anak Zina dalam Pewarisan",
    "perawi_melayu": "Ismail bin Aban, Musa bin Muhammad al-Ansari, al-Harith bin Hasirah, Zaid bin Wahb, Ali RA",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيل بْنُ أَبَانَ  ، عَنْ مُوسَى بْنِ مُحَمَّدٍ الْأَنْصَارِيِّ  ، قَالَ : حَدَّثَنِي الْحَارِثُ بْنُ حَصِيرَةَ  ، عَنْ زَيْدِ بْنِ وَهْبٍ  ، عَنْ عَلِيٍّ   : أَنَّهُ قَالَ فِي وَلَدِ الزِّنَا لِأَوْلِيَاءِ أُمِّهِ :\" خُذُوا ابْنَكُمْ تَرِثُونَهُ وَتَعْقِلُونَهُ، وَلَا يَرِثُكُمْ \"",
    "malay_translation": "Telah menceritakan kepada kami Ismail bin Aban, daripada Musa bin Muhammad al-Ansari, dia berkata: Telah menceritakan kepadaku al-Harith bin Hasirah, daripada Zaid bin Wahb, daripada Ali RA, bahawa beliau berkata mengenai anak zina kepada wali ibu anak tersebut: \"Ambillah anak kamu, kamu mewarisinya dan menanggung diyatnya, dan dia tidak mewarisi kamu.\""
  },
  {
    "id": 39915,
    "hadith_number": 2378,
    "tajuk_hadith": "Sifat Saibah (Unta Bebas) Menurut Abdullah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، وَعَبْدُ اللَّهِ بْنُ يَزِيدَ  ، قَالَا : حَدَّثَنَا شُعْبَةُ  ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ  ، عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ  ، قَالَ : َقَالَ عَبْدُ اللَّهِ   :\" السَّائِبَةُ يَضَعُ مَالَهُ حَيْثُ شَاءَ \".\nقَالَ عَبْدُ اللَّهِ بْنُ يَزِيدَ : قَالَ شُعْبَةُ : لَمْ يَسْمَعْ هَذَا مِنْ سَلَمَةَ أَحَدٌ غَيْرِي",
    "malay_translation": "Abu Nu'aim dan Abdullah bin Yazid meriwayatkan: Syu'bah meriwayatkan daripada Salamah bin Kuhail, daripada Abu 'Amr as-Syaibani, berkata: Abdullah berkata: \"Saibah (unta bebas) menggunakan hartanya di mana sahaja dia mahu.\" Abdullah bin Yazid berkata: Syu'bah berkata: \"Tidak seorang pun mendengar ini daripada Salamah selain daripada saya.\""
  },
  {
    "id": 39916,
    "hadith_number": 2379,
    "tajuk_hadith": "Warisan Saibah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ  ، حَدَّثَنَا حَاتِمُ بْنُ وَرْدَانَ  ، عَنْ يُونُسَ  ، عَنْ الْحَسَنِ   : سُئِلَ عَنْ مِيرَاثِ السَّائِبَةِ، فَقَالَ :\" كُلُّ عَتِيقٍ سَائِبَةٌ \"",
    "malay_translation": "Diriwayatkan daripada Al-Hakam bin Al-Mubarak, telah menceritakan kepada kami Hatim bin Wardan, daripada Yunus, daripada Al-Hasan: Beliau ditanya tentang warisan saibah, maka beliau berkata: \"Setiap hamba yang dimerdekakan adalah saibah.\""
  },
  {
    "id": 39917,
    "hadith_number": 2380,
    "tajuk_hadith": "Sedekah dan Sā'ibah untuk Waktunya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَنْبَأَنَا سُلَيْمَانُ  ، عَنْ أَبِي عُثْمَانَ  ، قَالَ : قَالَ عُمَرُ   :\" الصَّدَقَةُ وَالسَّائِبَةُ لِيَوْمِهِمَا، أَوْ لِوَقْتِهِمَا \"",
    "malay_translation": "Diriwayatkan daripada Abu Uthman, beliau berkata: Umar berkata: \"Sedekah dan Sā'ibah adalah untuk waktunya, atau pada masanya.\""
  },
  {
    "id": 39918,
    "hadith_number": 2381,
    "tajuk_hadith": "Pembebasan Hamba Sahaya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ ، حَدَّثَنَا زَكَرِيَّا ، قَالَ : سُئِلَ عَامِرٍ  عَنْ الْمَمْلُوكِ يُعْتَقُ سَائِبَةً لِمَنْ وَلَاؤُهُ؟ قَالَ :\" لِلَّذِي أَعْتَقَهُ \"",
    "malay_translation": "Abu Nu'aim meriwayatkan, Zakariyya meriwayatkan, dia berkata: 'Amir ditanya tentang hamba yang dibebaskan sebagai *saibah* (bebas sepenuhnya tanpa batasan) - hak perwaliannya kepada siapa? Dia berkata: \"Kepada orang yang membebaskannya.\""
  },
  {
    "id": 39919,
    "hadith_number": 2382,
    "tajuk_hadith": "Harta Hamba yang Meninggal Dunia tanpa Waris",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو حَاتِمٍ الْبَصْرِيُّ هُوَ رَوْحُ بْنُ أَسْلَمَ  ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ  ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَاق  ، عَنْ أَبِيهِ  ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَمْرٍو  ، قَالَ : \" مَاتَ مَوْلًى عَلَى عَهْدِ عُثْمَانَ   وَلَيْسَ لَهُ وَالٍ،فَأَمَرَ بِمَالِهِ، فَأُدْخِلَ بَيْتَ الْمَالِ \"",
    "malay_translation": "Diriwayatkan daripada Abdul Rahman bin Amr, dia berkata: \"Seorang hamba meninggal dunia pada zaman pemerintahan Uthman رضي الله عنه, dan dia tidak mempunyai waris. Maka harta bendanya diperintahkan supaya dimasukkan ke dalam Baitulmal.\""
  },
  {
    "id": 39920,
    "hadith_number": 2383,
    "tajuk_hadith": "Harta Orang Meninggal Tanpa Waris atau Wasiat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْلَى ، حَدَّثَنَا إِسْمَاعِيل ، عَنْ عَامِرٍ ، عَنْ مَسْرُوقٍ  : فِي رَجُلٍ مَاتَ وَلَمْ يَكُنْ لَهُ مَوْلَى عَتَاقَةٍ، قَالَ :\" مَالُهُ حَيْثُ أَوْصَى بِهِ، فَإِنْ لَمْ يَكُنْ أَوْصَى، فَهُوَ فِي بَيْتِ الْمَالِ \"",
    "malay_translation": "Telah menceritakan kepada kami Ya'la, telah menceritakan kepada kami Ismail, dari Amir, dari Masruq: Mengenai seorang lelaki yang meninggal dunia dan tidak mempunyai 'mola' (hamba yang dibebaskan) atau waris, beliau (Masruq) berkata: \"Hartanya adalah sebagaimana yang diwasiatkannya. Sekiranya dia tidak berwasiat, maka hartanya adalah di Baitul Mal.\""
  },
  {
    "id": 39921,
    "hadith_number": 2384,
    "tajuk_hadith": "Kemerdekaan Hamba Saibah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو سَعِيدِ بْنُ عَمْرٍو ، عَنْ أَبِي بَكْرِ بْنِ أَبِي مَرْيَمَ ، عَنْ ضَمْرَةَ ، وَرَاشِدِ بْنِ سَعْدٍ ، وَغَيْرِهِمَا، قَالُوا فِيمَنْ أُعْتِقَ سَائِبَةً :\" إِنَّ وَلَاءَهُ لِمَنْ أَعْتَقَهُ، إِنَّمَا سَيَّبَهُ مِنْ الرِّقِّ، وَلَمْ يُسَيِّبْهُ مِنْ الْوَلَاءِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Sa'id bin 'Amru, dari Abu Bakr bin Abi Maryam, dari Damrah, dan Rasyid bin Sa'd, dan selain mereka, mereka berkata tentang seseorang yang dimerdekakan sebagai Saibah: \"Sesungguhnya wala'nya (kesetiaannya) adalah bagi orang yang memerdekakannya. Sesungguhnya dia hanya memerdekakannya daripada perhambaan, dan tidak memerdekakannya daripada wala' (kesetiaan).\""
  },
  {
    "id": 39922,
    "hadith_number": 2385,
    "tajuk_hadith": "Keharusan Menjual dan Menghibahkan Wala' Sa'ibah",
    "perawi_melayu": "Abu Bakr bin Abi Syaibah, Abu Daud, Syu'bah, Mansur, Ibrahim, dan al-Sya'bi",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا أَبُو دَاوُدَ ، عَنْ شُعْبَةَ ، قَالَ : أَخْبَرَنِي مَنْصُورٌ ، عَنْ إِبْرَاهِيمَ ، وَالشَّعْبِيِّ ، قَالَا :\" لَا بَأْسَ بِبَيْعِ وَلَاءِ السَّائِبَةِ وَهِبَتِهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Bakr bin Abi Syaibah, telah menceritakan kepada kami Abu Daud, daripada Syu'bah, dia berkata: Telah mengkhabarkan kepadaku Mansur, daripada Ibrahim dan al-Sya'bi, mereka berdua berkata: \"Tidak mengapa menjual dan menghibahkan wala' (hak perwalian) sa'ibah.\""
  },
  {
    "id": 39923,
    "hadith_number": 2386,
    "tajuk_hadith": "Hamba Sahaya Saibah dan Harta Peninggalannya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا الْمَسْعُودِيُّ  ، عَنْ الْقَاسِمِ  ، قَالَ : \" أَعْتَقَ رَجُلٌ غُلَامًا سَائِبَةً، فَأَتَى عَبْدَ اللَّهِ  ، وَقَالَ : إِنِّي أَعْتَقْتُ غُلَامًا لِي سَائِبَةً، وَهَذِهِ تَرِكَتُهُ، قَالَ : هِيَ لَكَ، قَالَ :لَا حَاجَةَ لِي فِيهَا، قَالَ : فَضَعْهَا، فَإِنَّ هَهُنَا وَارِثًا كَثِيرًا \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Al-Mas'udi, daripada Al-Qasim, dia berkata: \"Seorang lelaki memerdekakan seorang hamba sahaya *saibah*. Kemudian dia datang kepada Abdullah dan berkata: 'Sesungguhnya aku telah memerdekakan seorang hamba sahaya *saibah* milikku, dan ini adalah harta peninggalannya.' Abdullah berkata: 'Ia adalah untukmu.' Lelaki itu berkata: 'Aku tidak memerlukannya.' Abdullah berkata: 'Letakkanlah ia, kerana di sini ada ahli waris yang ramai.'\""
  },
  {
    "id": 39924,
    "hadith_number": 2387,
    "tajuk_hadith": "Hukum Bayi yang Menangis Ketika Lahir: Pewarisan dan Solat Jenazah",
    "perawi_melayu": "Perawi Tidak Diketahui",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَنْبَأَنَا الْأَشْعَثُ  ، عَنْ أَبِي الزُّبَيْرِ  ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ  ، قَالَ :\" إِذَا اسْتَهَلَّ الصَّبِيُّ، وُرِّثَ وَصُلِّيَ عَلَيْهِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah memberitakan kepada kami Al-Asy'ath, dari Abu Az-Zubair, dari Jabir bin Abdullah, dia berkata: \"Apabila bayi menangis (ketika lahir), maka dia diwarisi dan disolatkan jenazah baginya.\""
  },
  {
    "id": 39925,
    "hadith_number": 2388,
    "tajuk_hadith": "Hukum Bayi yang Menangis Ketika Lahir",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا شَرِيكٌ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ عَطَاءٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ :\" إِذَا اسْتَهَلَّ الصَّبِيُّ، وَرِثَ وَوُرِثَ وَصُلِّيَ عَلَيْهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Syarik, daripada Abu Ishaq, daripada 'Ata', daripada Ibn Abbas, beliau berkata: \"Apabila bayi itu menangis (ketika lahir), dia mewarisi dan diwarisi, dan disembahyangkan jenazah ke atasnya.\""
  },
  {
    "id": 39926,
    "hadith_number": 2389,
    "tajuk_hadith": "Setiap Bayi Dilahirkan Menangis Kerana Sentuhan Syaitan Kecuali Isa AS",
    "perawi_melayu": "Malik bin Ismail, Israil, Simak, Ikrimah, Ibn Abbas",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيل  ، حَدَّثَنَا إِسْرَائِيلُ  ، عَنْ سِمَاكٍ  ، عَنْ عِكْرِمَةَ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ :\" لَيْسَ مِنْ مَوْلُودٍ إِلَّا يَسْتَهِلُّ، وَاسْتِهْلَالُهُ بِعَصْرِ الشَّيْطَانُ بَطْنَهُ، فَيَصِيحُ، إِلَّا عِيسَى ابْنَ مَرْيَمَ \"",
    "malay_translation": "Telah menceritakan kepada kami Malik bin Ismail, telah menceritakan kepada kami Israil, daripada Simak, daripada Ikrimah, daripada Ibn Abbas, beliau berkata: \"Tidak ada seorang bayi pun yang dilahirkan melainkan dia akan menangis dengan suara yang kuat, dan tangisannya itu adalah disebabkan sentuhan syaitan pada perutnya, lalu dia menjerit, kecuali Isa anak Maryam.\""
  },
  {
    "id": 39927,
    "hadith_number": 2390,
    "tajuk_hadith": "Warisan untuk Bayi yang Baru Lahir: Syarat Menjerit Ketika Lahir",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ  ، حَدَّثَنَا يَحْيَى هُوَ ابْنُ حَمْزَةَ  ، عَنْ زَيْدِ بْنِ وَاقِدٍ  ، عَنْ مَكْحُولٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَا يَرِثُ الْمَوْلُودُ حَتَّى يَسْتَهِلَّ صَارِخًا، وَإِنْ وَقَعَ حَيًّا \"",
    "malay_translation": "Yahya bin Hassan meriwayatkan kepada kami, Yahya iaitu Ibnu Hamzah meriwayatkan kepada kami, daripada Zaid bin Waqid, daripada Makhul, dia berkata: Rasulullah SAW bersabda: \"Bayi tidak mewarisi sehingga dia menjerit dengan kuat (ketika lahir), walaupun ia jatuh dalam keadaan hidup.\""
  },
  {
    "id": 39928,
    "hadith_number": 2391,
    "tajuk_hadith": "Bayi Baru Lahir Disolatkan dan Diwarisi",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْلَى  ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاق  ، عَنْ عَطَاءٍ  ، عَنْ جَابِرٍ  ، قَالَ :\" إِذَا اسْتَهَلَّ الْمَوْلُودُ، صُلِّيَ عَلَيْهِ وَوُرِثَ \"",
    "malay_translation": "Ya'la telah menceritakan kepada kami, Muhammad bin Ishaq telah menceritakan kepada kami, daripada 'Ata', daripada Jabir, beliau berkata: \"Apabila bayi yang baru lahir bersuara (menangis dengan kuat), maka disolatkan jenazah ke atasnya dan dia diwarisi (hartanya diwarisi).\""
  },
  {
    "id": 39929,
    "hadith_number": 2392,
    "tajuk_hadith": "Pandangan Az-Zuhri Tentang Bersin",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ ، حَدَّثَنَا مَعْنٌ ، عَنْ ابْنِ أَبِي ذِئْبٍ ، عَنْ الزُّهْرِيِّ ، قَالَ : أَرَى\" الْعُطَاسَ اسْتِهْلَالًا \"",
    "malay_translation": "Abdullah bin Muhammad telah meriwayatkan kepada kami, katanya Ma'n telah meriwayatkan kepada kami, daripada Ibn Abi Dzi'b, daripada az-Zuhri, dia berkata: \"Saya berpendapat bahawa bersin itu adalah permulaan.\""
  },
  {
    "id": 39930,
    "hadith_number": 2393,
    "tajuk_hadith": "Hukum Warisan dan Solat Jenazah untuk Bayi yang Baru Lahir",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ ، حَدَّثَنَا أَبُو عَوَانَةَ ، عَنْ مُغِيرَةَ ، عَنْ إِبْرَاهِيمَ ، قَالَ :\" لَا يُوَرَّثُ الْمَوْلُودُ حَتَّى يَسْتَهِلَّ، وَلَا يُصَلَّى عَلَيْهِ حَتَّى يَسْتَهِلَّ، فَإِذَا اسْتَهَلَّ، صُلِّيَ عَلَيْهِ وَوُرِّثَ، وَكُمِّلَتْ الدِّيَةُ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu An Nu'man, telah menceritakan kepada kami Abu 'Awanah, dari Mughirah, dari Ibrahim, dia berkata: \"Bayi yang baru lahir tidak diwarisi hingga ia menangis (ketika lahir), dan tidak dishalatkan jenazah atasnya hingga ia menangis (ketika lahir). Jika ia menangis (ketika lahir), maka dishalatkan jenazah atasnya, diwarisi, dan disempurnakan diatnya (denda pembunuhan tidak sengaja).\""
  },
  {
    "id": 39931,
    "hadith_number": 2394,
    "tajuk_hadith": "Tidak Disolatkan Jenazah untuk Anak Gugur atau Bayi Baru Lahir Sehingga Menjerit",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ ، حَدَّثَنِي اللَّيْثُ ، حَدَّثَنِي يُونُسُ ، عَنْ ابْنِ شِهَابٍ  : وَسَأَلْنَاهُ عَنْ السِّقْطِ، فَقَالَ :\" لَا يُصَلَّى عَلَيْهِ، وَلَا يُصَلَّى عَلَى مَوْلُودٍ حَتَّى يَسْتَهِلَّ صَارِخًا \"",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Saleh, telah menceritakan kepadaku al-Laith, telah menceritakan kepadaku Yunus, dari Ibn Shihab: dan kami bertanya kepadanya tentang anak yang gugur, lalu beliau berkata: 'Tidak disolatkan jenazah atasnya, dan tidak disolatkan jenazah atas bayi yang lahir sehingga dia menjerit (menangis) dengan kuat.'"
  },
  {
    "id": 39932,
    "hadith_number": 2395,
    "tajuk_hadith": "Hukum Jual Beli antara Mukatab",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَارُونُ بْنُ مُعَاوِيَةَ ، عَنْ أَبِي سُفْيَانَ ، عَنْ مَعْمَرٍ ،  عَنْ قَتَادَةَ ، قَالَ :\" إِذَا ابْتَاعَ الْمُكَاتَبَانِ أَحَدُهُمَا الْآخَرَ : هَذَا هَذَا مِنْ سَيِّدِهِ، وَهَذَا هَذَا مِنْ سَيِّدِهِ، فَالْبَيْعُ لِلْأَوَّلِ.\nوَيَقُولُ أَهْلُ الْمَدِينَةِ : الْوَلَاءُ لِسَيِّدِ الْبَائِعِ، وَيَقُولُونَ : إِنَّمَا ابْتَاعَ هَذَا مَا عَلَى الْمُكَاتَبِ، فَالْوَلَاءُ لِلسَّيِّدِ",
    "malay_translation": "Telah menceritakan kepada kami Harun bin Mu'awiyah, dari Abu Sufyan, dari Ma'mar, dari Qatadah, dia berkata: \"Apabila dua orang mukatab membeli salah seorang daripada yang lain: (iaitu) yang ini (membeli) yang ini daripada tuannya, dan yang ini (membeli) yang ini daripada tuannya, maka jual beli itu bagi yang pertama.\nDan ahli Madinah berkata: 'Walak (kesetiaan) adalah untuk tuan kepada penjual,' dan mereka berkata: 'Sesungguhnya dia membeli apa yang ada pada mukatab, maka walak adalah untuk tuan.'"
  },
  {
    "id": 39933,
    "hadith_number": 2396,
    "tajuk_hadith": "Perkahwinan Hamba dan Orang Merdeka",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ  ، حَدَّثَنَا يَحْيَى  ، عَنْ سَعِيدٍ  ، أَنَّ عُمَرَ  ، قَالَ :\" أَيُّمَا حُرٍّ تَزَوَّجَ أَمَةً، فَقَدْ أَرَقَّ نِصْفَهُ، وَأَيُّمَا عَبْدٍ تَزَوَّجَ حُرَّةً، فَقَدْ أَعْتَقَ نِصْفَهُ، قَالَ أَبُو مُحَمَّد : يَعْنِي الْوَلَدَ",
    "malay_translation": "Telah menceritakan kepada kami Yazid bin Harun, telah menceritakan kepada kami Yahya, daripada Sa'id, bahawa Umar berkata: \"Sesiapa sahaja orang merdeka yang berkahwin dengan hamba perempuan, maka dia telah memerdekakan separuh dirinya (melalui zuriatnya), dan sesiapa sahaja hamba yang berkahwin dengan wanita merdeka, maka dia telah memerdekakan separuh dirinya (melalui zuriatnya).\" Abu Muhammad berkata: Iaitu anak."
  },
  {
    "id": 39934,
    "hadith_number": 2397,
    "tajuk_hadith": "Hukum Nafkah Anak Hasil Perkahwinan Hamba",
    "perawi_melayu": "Abu Syihab, daripada Asy-Sya'bi",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ ، حَدَّثَنَا أَبُو شِهَابٍ ، عَنْ الشَّيْبَانِيِّ ،  عَنْ الشَّعْبِيِّ  : فِي الْعَبْدِ يَتَزَوَّجُ الْمَرْأَةَ، ثُمَّ يُطَلِّقُهَا وَلَهُ مِنْهَا وَلَدٌ؟ قَالَ :\" إِنْ كَانَتْ حُرَّةً، فَالنَّفَقَةُ عَلَى أُمِّهِ، وَإِنْ كَانَ عَبْدًا، يَعْنِي : الصَّبِيَّ، فَعَلَى مُوَالِيهِ \"",
    "malay_translation": "Diriwayatkan daripada Asy-Sya'bi, mengenai seorang hamba yang mengahwini seorang wanita, kemudian menceraikannya sedangkan dia mempunyai anak daripadanya. Beliau (Asy-Sya'bi) berkata: \"Jika wanita itu seorang yang merdeka, maka nafkahnya (nafkah anak) adalah tanggungjawab ibunya (wanita tersebut). Dan jika anak itu seorang hamba, maka nafkahnya adalah tanggungjawab kepada wali-walinya (tuan hamba tersebut).\""
  },
  {
    "id": 39935,
    "hadith_number": 2398,
    "tajuk_hadith": "Hak Milik Waris Pembebasan Hamba",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى ، حَدَّثَنَا هُشَيْمٌ ، حَدَّثَنَا زَكَرِيَّا ، عَنْ عَامِرٍ .\nح وحَدَّثَنَا جَرِيرٌ ، عَنْ مُغِيرَةَ ، عَنْ إِبْرَاهِيمَ  : أَنَّهُمَا قَالَا :\" وَلَاؤُهُ لِمَنْ بَدَأَ بِالْعِتْقِ أَوَّلَ مَرَّةٍ \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Isa, telah menceritakan kepada kami Hushaim, telah menceritakan kepada kami Zakaria, dari Amir. Dan telah menceritakan kepada kami Jarir, dari Mughirah, dari Ibrahim: Bahawa keduanya berkata: “Hak wala’ (hak pewarisan) adalah bagi orang yang membebaskan hamba pada kali pertama.”"
  },
  {
    "id": 39936,
    "hadith_number": 2399,
    "tajuk_hadith": "Warisan dan Pembebasan Hamba",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى ، حَدَّثَنَا هُشَيْمٌ ، أنبأنا يُونُسُ ، عَنْ الْحَسَنِ .\n ح وحَدَّثَنَا جَرِيرٌ ، عَنْ أَبَانَ بْنِ تَغْلِبَ ، عَنْ الْحَكَمِ ، عَنْ إِبْرَاهِيمَ ، أَنَّهُمَا قَالَا :\" إِنْ ضَمِنَ، كَانَ الْوَلَاءُ لَهُ، وَإِنْ اسْتَسْعَى الْعَبْدُ، كَانَ الْوَلَاءُ بَيْنَهُمْ \"",
    "malay_translation": "Diriwayatkan daripada Muhammad bin Isa, daripada Husyaim, daripada Yunus, daripada Hasan. Diriwayatkan juga daripada Jarir, daripada Aban bin Taghlib, daripada Al-Hakam, daripada Ibrahim, bahawasanya mereka berdua berkata: \"Jika ada jaminan, maka warisan adalah baginya, dan jika seorang hamba berusaha memerdekakan dirinya, maka warisan adalah di antara mereka\"."
  },
  {
    "id": 39937,
    "hadith_number": 2400,
    "tajuk_hadith": "Pembebasan Hamba Milik Bersama",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْلَى ، وَأَبُو نُعَيْمٍ ، قَالَا : حَدَّثَنَا زَكَرِيَّا ، عَنْ عَامِرٍ  : فِي عَبْدٍ بَيْنَ رَجُلَيْنِ أَعْتَقَ أَحَدُهُمَا نَصِيبَهُ، فَقَالَ :\" يُتَمَّمُ عِتْقُهُ، فَإِنْ لَمْ يَكُنْ لَهُ مَالٌ، اسْتُسْعِيَ الْعَبْدُ فِي النِّصْفِ بِقِيمَةِ عَدْلٍ، وَالْوَلَاءُ لِمَنْ أَعْتَقَ \"",
    "malay_translation": "Telah menceritakan kepada kami Ya'la dan Abu Nu'aim, mereka berdua berkata: Telah menceritakan kepada kami Zakaria, dari Amir: mengenai seorang hamba antara dua orang lelaki, salah seorang dari mereka memerdekakan bagiannya, maka beliau bersabda: \"Hendaklah disempurnakan pemerdekaannya, jika dia tidak memiliki harta, maka hamba tersebut diusahakan (bekerja) untuk setengah (bagian yang belum merdeka) dengan nilai yang adil, dan wala' (hak perwalian) adalah bagi siapa yang memerdekakan.\""
  },
  {
    "id": 39938,
    "hadith_number": 2401,
    "tajuk_hadith": "Harta Pusaka Hamba yang Dibebaskan Sebahagian",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَارُونُ بْنُ مُعَاوِيَةَ ، عَنْ أَبِي سُفْيَانَ الْمَعْمَرِيِّ ، عَنْ مَعْمَرٍ ، عَنْ ابْنِ طَاوُسٍ ، عَنْ أَبِيهِ  : فِي عَبْدٍ بَيْنَ رَجُلَيْنِ، أَعْتَقَ أَحَدَهُمَا نَصِيبَهُ وَأَمْسَكَهُ الْآخَرُ، قَالَ :\" مِيرَاثُهُ بَيْنَهُمَا \"",
    "malay_translation": "Diriwayatkan daripada Harun bin Mu'awiyah, daripada Abu Sufyan al-Ma'mari, daripada Ma'mar, daripada Ibn Tawus, daripada bapanya, mengenai seorang hamba milik dua orang lelaki, salah seorang membebaskan sebahagian dirinya dan yang seorang lagi menahannya, (Rasulullah SAW) bersabda: \"Harta pusakanya dibahagi antara mereka berdua.\""
  },
  {
    "id": 39939,
    "hadith_number": 2402,
    "tajuk_hadith": "Harta Pusaka Adalah Milik Orang yang Menahannya dan Pendapat Mengenai Pembebasan Hamba",
    "perawi_melayu": "Harun, Abu Sufyan, Ma'mar, al-Zuhri, Qatadah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هَارُونُ ، عَنْ أَبِي سُفْيَانَ ، عَنْ مَعْمَرٍ ، عَنْ الزُّهْرِيِّ ، قَالَ :\" مِيرَاثُهُ لِلَّذِي أَمْسَكَهُ.\nوقال قَتَادَةُ  : هُوَ لِلْمُعْتِقِ كُلُّهُ، وَثَمَنُهُ عَلَيْهِ، وَيَقُولُهُ أَهْلُ الْكُوفَةِ",
    "malay_translation": "Telah meriwayatkan kepada kami Harun, daripada Abu Sufyan, daripada Ma'mar, daripada al-Zuhri, beliau berkata: \"Pusaka itu adalah bagi orang yang menahannya.\"\n\nDan Qatadah berkata: \"Ia adalah sepenuhnya untuk pembebas, dan harganya adalah tanggungannya,\" dan penduduk Kufah mengatakan ini."
  },
  {
    "id": 39940,
    "hadith_number": 2403,
    "tajuk_hadith": "Hukum Warisan untuk Wanita dari Mukatab dan Wala'",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ ، حَدَّثَنَا عَبْدُ الْمَلِكِ ، عَنْ عَطَاءٍ  : فِي الرَّجُلِ يَمُوتُ وَيَتْرُكُ مُكَاتَبًا، وَلَهُ بَنُونَ وَبَنَاتٌ، أَيَكُونُ لِلنِّسَاءِ مِنْ الْوَلَاءِ شَيْءٌ؟ قَالَ :\" تَرِثُ النِّسَاءُ مِمَّا عَلَى ظَهْرِهِ مِنْ مُكَاتَبَتِهِ، وَيَكُونُ الْوَلَاءُ لِلرِّجَالِ دُونَ النِّسَاءِ، إِلَّا مَا كَاتَبْنَ، أَوْ أَعْتَقْنَ \"",
    "malay_translation": "Telah menceritakan kepada kami Ya'la bin Ubaid, telah menceritakan kepada kami Abdul Malik, dari 'Ata': Mengenai seorang lelaki yang meninggal dunia dan meninggalkan seorang *mukatab* (hamba yang membuat perjanjian kebebasan), dan dia mempunyai anak lelaki dan perempuan, adakah bagi wanita sesuatu dari *wala'*? Dia berkata: \"Wanita mewarisi dari apa yang ada pada *mukatab*nya, dan *wala'* adalah untuk lelaki bukan wanita, kecuali apa yang mereka *katab*kan (perjanjian kebebasan) atau bebaskan.\""
  },
  {
    "id": 39941,
    "hadith_number": 2404,
    "tajuk_hadith": "Wanita Tidak Mewarisi dari Wala' Kecuali Apa yang Mereka Merdekakan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ ، حَدَّثَنَا شَرِيكٌ ، عَنْ لَيْثٍ ، عَنْ طَاوُسٍ ، قَالَ :\" لَا تَرِثُ النِّسَاءُ مِنْ الْوَلَاءِ إِلَّا مَا أَعْتَقْنَ، أَوْ أَعْتَقَ مَنْ أَعْتَقْنَ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Syarik, dari Laith, dari Tawus, dia berkata: \"Wanita tidak mewarisi dari wala' kecuali apa yang mereka merdekakan, atau orang yang mereka merdekakan memerdekakan.\""
  },
  {
    "id": 39942,
    "hadith_number": 2405,
    "tajuk_hadith": "Hukum Warisan Harta Mukatab",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى ، حَدَّثَنَا أَبُو سُفْيَانَ ، عَنْ مَعْمَرٍ ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ ، قَالَ :\" تُوُفِّيَ رَجُلٌ وَتَرَكَ مُكَاتَبًا، ثُمَّ مَاتَ الْمُكَاتَبُ وَتَرَكَ مَالًا، فَجَعَلَ ابْنُ الْمُسَيَّبِ ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ  مَا بَقِيَ مِنْ مُكَاتَبَتِهِ بَيْنَ بَنِي مَوْلَاهُ الرِّجَالُ وَالنِّسَاءُ عَلَى مِيرَاثِهِمْ، وَمَا فَضَلَ مِنْ الْمَالِ بَعْدَ كِتَابَتِهِ، فَلِلرِّجَالِ مِنْهُمْ مِنْ بَنِي مَوْلَاهُ، دُونَ النِّسَاءِ \"",
    "malay_translation": "Muhammad bin Isa meriwayatkan kepada kami, Abu Sufyan meriwayatkan kepada kami, daripada Ma'mar, daripada Yahya bin Abi Kathir, dia berkata: “Seorang lelaki meninggal dunia dan meninggalkan seorang *mukatab* (hamba yang membuat perjanjian penebusan diri), kemudian *mukatab* itu meninggal dunia dan meninggalkan harta. Lalu Ibn al-Musayyib dan Abu Salamah bin Abd al-Rahman memutuskan bahawa sisa daripada *mukatabah* (perjanjian penebusan diri) dibahagikan antara anak lelaki dan perempuan bekas tuannya mengikut hukum warisan mereka, dan lebihan harta setelah *kitabah* (perjanjian) diselesaikan adalah untuk anak lelaki bekas tuannya, dan bukan untuk perempuan.”"
  },
  {
    "id": 39943,
    "hadith_number": 2406,
    "tajuk_hadith": "Hak Waris dalam Hubungan Wala' (Kesetiaan)",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى  ، حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ حَرْبٍ  ، عَنْ الْأَعْمَشِ  ، عَنْ إِبْرَاهِيمَ  ، عَنْ عُمَرَ  ، وَعَلِيٍّ  ، وَزَيْدٍ   ، أَنَّهُمْ قَالُوا :\" الْوَلَاءُ لِلْكُبْرِ، وَلَا يَرِثُونَ النِّسَاءَ مِنْ الْوَلَاءِ إِلَّا مَا أَعْتَقْنَ، أَوْ كَاتَبْنَ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Isa, telah menceritakan kepada kami Abdul Salam bin Harb, daripada Al-A'mash, daripada Ibrahim, daripada Umar, Ali dan Zaid, bahawasanya mereka berkata: \"Wala' (Kesetiaan) adalah bagi yang lebih besar (keluarga yang lebih besar), dan perempuan tidak mewarisi daripada wala' melainkan apa yang mereka merdekakan atau berkontrak (dengan hamba).\""
  },
  {
    "id": 39944,
    "hadith_number": 2407,
    "tajuk_hadith": "Hukum Warisan Wala' bagi Wanita",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى ، حَدَّثَنَا إِسْمَاعِيل بْنُ إِبْرَاهِيمَ ، عَنْ خَالِدٍ ، عَنْ أَبِي قِلَابَةَ .\nح وحَدَّثَنَا ابْنُ وَهْبٍ ، عَنْ يُونُسَ ، عَنْ الزُّهْرِيِّ ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ .\n ح وحَدَّثَنَا ابْنُ أَبِي الزِّنَادِ ، عَنْ أَبِيهِ ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ  : أَنَّهُمْ قَالُوا :\" لَا يَرِثُ النِّسَاءُ مِنْ الْوَلَاءِ إِلَّا مَا أَعْتَقْنَ، أَوْ كَاتَبْنَ \"",
    "malay_translation": "Telah meriwayatkan kepada kami Muhammad bin Isa, telah meriwayatkan kepada kami Ismail bin Ibrahim, daripada Khalid, daripada Abu Qilabah. Dan diriwayatkan juga daripada Ibnu Wahb, daripada Yunus, daripada Zuhri, daripada Said bin Musayyib. Dan diriwayatkan juga daripada Ibnu Abi Zinad, daripada bapanya, daripada Sulaiman bin Yasar: Bahawasanya mereka berkata: 'Wanita tidak mewarisi dari *wala'* kecuali apa yang mereka merdekakan, atau yang mereka buat perjanjian *kitabah* (pembebasan bertulis).'"
  },
  {
    "id": 39945,
    "hadith_number": 2408,
    "tajuk_hadith": "Wanita Tidak Mewarisi dari Wala' Kecuali dalam Keadaan Tertentu",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى ، عن مُعَاذٌ ، عَنْ أَشْعَثَ ، عَنْ الْحَسَنِ ، قَالَ :\" لَا تَرِثُ النِّسَاءُ مِنْ الْوَلَاءِ إِلَّا مَا أَعْتَقْنَ، أَوْ أَعْتَقَ مَنْ أَعْتَقْنَ، إِلَّا الْمُلَاعَنَةُ، فَإِنَّهَا تَرِثُ مَنْ أَعْتَقَ ابْنُهَا، وَالَّذِي انْتَفَى مِنْهُ أَبُوهُ \"",
    "malay_translation": "Muhammad bin Isa meriwayatkan kepada kami daripada Mu'az, daripada Asy'ath, daripada al-Hasan, dia berkata: \"Wanita tidak mewarisi dari wala' kecuali apa yang mereka merdekakan, atau apa yang dimerdekakan oleh orang yang mereka merdekakan, kecuali wanita yang dila'nat, maka sesungguhnya dia mewarisi dari orang yang dimerdekakan oleh anaknya, dan orang yang dinafikan oleh ayahnya.\""
  },
  {
    "id": 39946,
    "hadith_number": 2409,
    "tajuk_hadith": "Mewarisi Bekas Hamba Umar, Bukan Anak Perempuannya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى  ، حَدَّثَنَا ابْنُ وَهْبٍ  ، عَنْ يُونُسَ  ، عَنْ الزُّهْرِيِّ  ، عَنْ سَالِمٍ  ، عَنْ أَبِيهِ   : أَنَّهُ كَانَ\" يَرِثُ مَوَالِيَ عُمَرَ دُونَ بَنَاتِ عُمَرَ \"",
    "malay_translation": "Muhammad bin Isa telah menceritakan kepada kami, Ibn Wahb telah menceritakan kepada kami, daripada Yunus, daripada al-Zuhri, daripada Salim, daripada ayahnya: Bahawa sesungguhnya beliau (ayah Salim) mewarisi bekas hamba-hamba Umar dan bukan anak-anak perempuan Umar."
  },
  {
    "id": 39947,
    "hadith_number": 2410,
    "tajuk_hadith": "Perwalian Harta Pusaka Wanita yang Meninggal Dunia",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ ، عَنْ خَالِدِ بْنِ عَبْدِ اللَّهِ ، عَنْ خَالِدٍ الْحَذَّاءِ ، عَنْ أَبِي قِلَابَةَ  فِي امْرَأَةٍ مَاتَتْ، وَتَرَكَتْ بَنِيهَا، فَوَرِثُوهَا مَالًا وَمَوَالِيَ، قَالَ :\" يَرْجِعُ الْوَلَاءُ إِلَى عَصَبَةِ الْمَرْأَةِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Amru bin Aun, daripada Khalid bin Abdullah, daripada Khalid al-Hazza', daripada Abu Qilabah mengenai seorang wanita yang meninggal dunia dan meninggalkan anak-anaknya, lalu mereka mewarisi harta dan mawali wanita itu. Beliau berkata: \"Hak perwalian kembali kepada 'asabah wanita tersebut.\""
  },
  {
    "id": 39948,
    "hadith_number": 2411,
    "tajuk_hadith": "Pembahagian Harta Pusaka dalam Mukatabah (Pembebasan Hamba)",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ ، عَنْ إِسْرَائِيلَ ، عَنْ مَنْصُورٍ ، قَالَ : سَأَلْتُ إِبْرَاهِيمَ  عَنْ رَجُلٍ كَاتَبَ عَبْدًا لَهُ، ثُمَّ مَاتَ وَتَرَكَ وَلَدًا رِجَالًا وَنِسَاءً، قَالَ :\" لِلذُّكُورِ دُونَ الْإِنَاثِ \"",
    "malay_translation": "Telah menceritakan kepada kami Ubaidullah, daripada Israil, daripada Mansur, yang berkata: \"Aku bertanya kepada Ibrahim tentang seorang lelaki yang membuat perjanjian mukatabah (pembebasan bertulis) dengan hambanya, kemudian dia meninggal dunia dan meninggalkan anak lelaki dan perempuan.\" Ibrahim menjawab: \"Bahagian adalah untuk anak lelaki, bukan untuk anak perempuan.\""
  },
  {
    "id": 39949,
    "hadith_number": 2412,
    "tajuk_hadith": "Hukum Wala' bagi Wanita yang Meninggal Dunia dan Meninggalkan Maula",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ ، حَدَّثَنَا وُهَيْبٌ ، حَدَّثَنَا يُونُسُ ، عَنْ الْحَسَنِ ، أَنَّهُ كَانَ يَقُولُ فِي امْرَأَةٍ مَاتَتْ وَتَرَكَتْ مَوْلًى، قَالَ :\" الْوَلَاءُ لِبَنِيهَا، فَإِذَا مَاتُوا، رَجَعَ إِلَى عَصَبَتِهَا \"",
    "malay_translation": "Telah menceritakan kepada kami Abu An-Nu'man, telah menceritakan kepada kami Wuhaib, telah menceritakan kepada kami Yunus, dari Al-Hasan, bahawasanya beliau pernah berkata mengenai seorang wanita yang meninggal dunia dan meninggalkan seorang *maula* (hamba yang dimerdekakan), beliau berkata: \"Wala' (hak perwalian) adalah untuk anak-anaknya, dan apabila mereka meninggal dunia, ia kembali kepada *'asabah* (kerabat lelaki dari pihak ayah) wanita tersebut.\""
  },
  {
    "id": 39950,
    "hadith_number": 2413,
    "tajuk_hadith": "Hak Perwalian Wanita Terhad kepada Hamba yang Dimedekakan Sendiri",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ ، أَخْبَرَنَا شُعْبَةُ ، عَنْ مُغِيرَةَ ، عَنْ إِبْرَاهِيمَ  قَالَ :\" لَيْسَ لِلنِّسَاءِ مِنْ الْوَلَاءِ شَيْءٌ، إِلَّا مَا أَعْتَقَتْ هِيَ فيَ نَفْسِهَا \"",
    "malay_translation": "Sa'id bin Amir telah menceritakan kepada kami, Syu'bah telah mengkhabarkan kepada kami, daripada Mughirah, daripada Ibrahim, beliau berkata: \"Wanita tidak memiliki hak perwalian, kecuali terhadap hamba yang mereka merdekakan sendiri.\""
  },
  {
    "id": 39951,
    "hadith_number": 2414,
    "tajuk_hadith": "Tiada Warisan untuk Anak Perempuan Umar dari Harta Maula",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ  ، عَنْ ابْنِ عَوْنٍ  ، عَنْ مُحَمَّدٍ  ، قَالَ : مَاتَ مَوْلًى لِعُمَرَ، فَسَأَلَ ابْنُ عُمَرَ زَيْدَ بْنَ ثَابِتٍ  ، فَقَالَ : هَلْ لِبَنَاتِ عُمَرَ مِنْ مِيرَاثِهِ شَيْءٌ؟ قَالَ :\" مَا أَرَى لَهُنَّ شَيْئًا، وَإِنْ شِئْتَ أَنْ تُعْطِيَهُنَّ، أَعْطَيْتَهُنَّ \"",
    "malay_translation": "Telah menceritakan kepada kami Sa'id bin Amir, dari Ibn Aun, dari Muhammad, dia berkata: Seorang maula (bekas budak) Umar meninggal dunia, lalu Ibn Umar bertanya kepada Zaid bin Thabit, dia berkata: 'Apakah anak perempuan Umar mendapat sesuatu dari warisannya?' Dia menjawab: 'Saya tidak melihat mereka mendapat apa-apa, tetapi jika kamu ingin memberikan kepada mereka, berikanlah kepada mereka.'"
  },
  {
    "id": 39952,
    "hadith_number": 2415,
    "tajuk_hadith": "Hak Perwalian Berdasarkan Warisan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ ، حَدَّثَنَا أَبُو أُسَامَةَ ، عَنْ هِشَامٍ ، عَنْ أَبِيهِ ، قَالَ :\" يُحْرِزُ الْوَلَاءَ مَنْ يُحْرِزُ الْمِيرَاثَ \"",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Sa'id, telah menceritakan kepada kami Abu Usamah, daripada Hisyam, daripada bapanya, dia berkata: \"Hak perwalian adalah bagi sesiapa yang mewarisi harta pusaka.\""
  },
  {
    "id": 39953,
    "hadith_number": 2416,
    "tajuk_hadith": "Wanita Muharib Menghibahkan Wala' Hambanya dan Keputusan Uthman",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ  ، حَدَّثَنَا أَبُو خَالِدٍ  ، حَدَّثَنَا يَحْيَى  ، عَنْ أَبِي بَكْرِ بْنِ عَمْرِو بْنِ حَزْمٍ   :\" أَنَّ امْرَأَةً مِنْ مُحَارِبٍ وَهَبَتْ وَلَاءَ عَبْدِهَا لِنَفْسِهِ، فَأَعْتَقَتْهُ، فَوَهَبَ وَلاءَ نَفْسِهِ لِعَبْدِ الرَّحْمَنِ بْنِ عَمْرِو بْنِ حَزْمٍ، وَمَاتَتْ، فَخَاصَمَتِ الْمَوَالِيَ إِلَى عُثْمَانَ، فَدَعَا عُثْمَانُ الْبَيِّنَةَ عَلَى مَا قَالَ، قَالَ : فَأَتَى الْبَيِّنَةُ، فَقَالَ لَهُ عُثْمَانُ   : اذْهَبْ، فَوَالِ مَنْ شِئْتَ \".\nقَالَ أَبُو بَكْرٍ : فَوَالَى عَبْدَ الرَّحْمَنِ بْنَ عَمْرِو بْنِ حَزْمٍ",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Sa'id, telah menceritakan kepada kami Abu Khalid, telah menceritakan kepada kami Yahya, dari Abu Bakr bin 'Amr bin Hazm: \"Bahawa seorang wanita dari suku Muharib telah menghibahkan *wala'* hamba perempuannya untuk dirinya sendiri, lalu dia memerdekakannya. Kemudian hamba perempuan itu menghibahkan *wala'* dirinya kepada Abdurrahman bin 'Amr bin Hazm, dan wanita tersebut meninggal dunia. Maka para *mawali* (klien yang dibebaskan) bertikai dan mengadu kepada Uthman. Uthman meminta bukti atas apa yang telah dikatakannya. Dia berkata: Lalu bukti itu dibawa, maka Uthman berkata kepadanya: Pergilah, dan ber-*wala'* lah kepada sesiapa sahaja yang kamu kehendaki.\" Abu Bakr berkata: Maka dia ber-*wala'* kepada Abdurrahman bin 'Amr bin Hazm."
  },
  {
    "id": 39954,
    "hadith_number": 2417,
    "tajuk_hadith": "Larangan Menjual Wala' dan Menghibahkan Wala'",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ  ، عَنْ ابْنِ عُمَرَ  ، قَالَ : \" نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْبَيْعِ الْوَلَاءِ، وَعَنْ هِبَتِهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Sufyan, daripada Abdullah bin Dinar, daripada Ibn Umar RA, beliau berkata: \"Rasulullah SAW melarang daripada menjual wala' dan juga daripada menghibahkannya.\""
  },
  {
    "id": 39955,
    "hadith_number": 2418,
    "tajuk_hadith": "Larangan Menjual dan Menghadiahkan Wala'",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسْلِمٌ  ، حَدَّثَنَا شُعْبَةُ  ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ  ، عَنْ ابْنِ عُمَرَ   : \" أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَنَهَى عَنْ بَيْعِ الْوَلَاءِ، وَعَنْ هِبَتِهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Muslim, telah menceritakan kepada kami Syu'bah, telah menceritakan kepada kami Abdullah bin Dinar, dari Ibn Umar: \"Bahawa Nabi ﷺ melarang daripada menjual al-Wala' dan daripada menghadiahkannya.\""
  },
  {
    "id": 39956,
    "hadith_number": 2419,
    "tajuk_hadith": "Larangan Menjual dan Menghibahkan Al-Wala'",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْلَى  ، حَدَّثَنَا عَبْدُ الْمَلِكِ  ، عَنْ عَطَاءٍ  ، قَالَ : سَمِعْتُ ابْنَ عَبَّاسٍ  ، يَقُولُ :\" لَا يُبَاعُ الْوَلَاءُ وَلَا يُوهَبُ، وَالْوَلَاءُ لِمَنْ أَعْتَقَ \"",
    "malay_translation": "Telah menceritakan kepada kami Ya'la, telah menceritakan kepada kami Abdul Malik, daripada 'Ata', dia berkata: Aku mendengar Ibn Abbas berkata: \"Tidak boleh dijual al-wala' dan tidak boleh dihibahkan, dan al-wala' adalah bagi orang yang memerdekakan.\""
  },
  {
    "id": 39957,
    "hadith_number": 2420,
    "tajuk_hadith": "Al-Wala' Seperti Ikatan Nasab: Tidak Boleh Dijual atau Dihibahkan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ  ، عَنْ سَعِيدٍ  ، عَنْ أَبِي مَعْشَرٍ  ، عَنْ إِبْرَاهِيمَ  ، قَالَ : قَالَ عَبْدُ اللَّهِ   :\" الْوَلَاءُ لُحْمَةٌ كَلُحْمَةِ النَّسَبِ، لَا يُبَاعُ وَلَا يُوهَبُ \"",
    "malay_translation": "Ja'far bin Aun meriwayatkan kepada kami, daripada Sa'id, daripada Abu Ma'shar, daripada Ibrahim, yang berkata: Abdullah berkata: \"Al-Wala' itu adalah ikatan yang sama seperti ikatan nasab, tidak boleh dijual dan tidak boleh dihibahkan.\""
  },
  {
    "id": 39958,
    "hadith_number": 2421,
    "tajuk_hadith": "Larangan Menjual Wala'",
    "perawi_melayu": "Diriwayatkan oleh: Muslim, Hammam, Qatadah, daripada al-Hasan dan Sa'id bin al-Musayyib",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسْلِم ، حَدَّثَنَا هَمَّامٌ ، حَدَّثَنَا قَتَادَةُ ، عَنْ الْحَسَنِ ، وَسَعِيدِ بْنِ الْمُسَيِّبِ  : \" أنهماكرها بيع الولاء \"",
    "malay_translation": "Telah meriwayatkan kepada kami Muslim, telah meriwayatkan kepada kami Hammam, telah meriwayatkan kepada kami Qatadah, daripada al-Hasan dan Sa'id bin al-Musayyib: \"Bahawa mereka berdua membenci penjualan wala'\"."
  },
  {
    "id": 39959,
    "hadith_number": 2422,
    "tajuk_hadith": "Larangan Menjual Al-Wala'",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ  ، حَدَّثَنَا ابْنُ إِدْرِيسَ  ، عَنْ ابْنِ جُرَيْجٍ  ، عَنْ عَطَاءٍ  ، قَالَ : قَالَ ابْنُ عَبَّاسٍ   :\" لَا يُبَاعُ الْوَلَاءُ، أَيُؤْكَلُ بِرَقَبَةِ رَجُلٍ مَرَّتَيْنِ؟ \"",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Sa'id, telah menceritakan kepada kami Ibn Idris, daripada Ibn Juraij, daripada 'Ata', dia berkata: Ibn Abbas berkata: \"Tidak boleh dijual al-Wala', adakah ia memakan harta seorang lelaki dua kali?\""
  },
  {
    "id": 39960,
    "hadith_number": 2423,
    "tajuk_hadith": "Pembahagian Pusaka Bermula Dari Enam Bahagian",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ ابْنِ جُرَيْجٍ  ، عَنْ عَطَاءٍ  ، عَنْ ابْنِ عَبَّاسٍ  ، قَالَ :\" الْفَرَائِضُ مِنْ سِتَّةٍ، لَا نُعِيلُهَا \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Yusuf, telah menceritakan kepada kami Sufyan, daripada Ibn Juraij, daripada 'Ata', daripada Ibn 'Abbas, beliau berkata: \"Pembahagian faraidh (pusaka) bermula dari enam bahagian, kami tidak menambahnya.\""
  },
  {
    "id": 39961,
    "hadith_number": 2424,
    "tajuk_hadith": "Hukum Pembahagian Harta Pusaka untuk Dua Anak Perempuan, Ibu Bapa, dan Suami",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِمْرَانَ ، عَنْ مُعَاوِيَةَ بْنِ مَيْسَرَةَ بْنِ شُرَيْحٍ ، عَنْ شريح بْنِ الْحَارِثِ ، قَالَ : \" اخْتُصِمَ إِلَى شُرَيْحٍ فِي بِنْتَيْنِ، وَأَبَوَيْنِ، وَزَوْجٍ، فَقَضَى فِيهَا، فَأَقْبَلَ الزَّوْجُ يَشْكُوهُ فِي الْمَسْجِدِ، فَأَرْسَلَ إِلَيْهِ عَبْدَ اللَّهِ بْنَ رَبَاحٍ فَأَخَذَهُ، وَبَعَثَ إِلَى شُرَيْحٍ، فَقَالَ : مَا يَقُولُ هَذَا؟ قَالَ : هَذَا يَخَالُنِي امْرَأً جَائِرًا، وَأَنَا إِخَالُهُ امْرَأً فَاجِرًا، يُظْهِرُ الشَّكْوَى وَيَكْتُمُ قَضَاءً سَائِرًا، فَقَالَ لَهُ الرَّجُلُ : مَا تَقُولُ فِي بِنْتَيْنِ، وَأَبَوَيْنِ، وَزَوْجٍ؟ فَقَالَ :لِلزَّوْجِ الرُّبُعُ مِنْ جَمِيعِ الْمَالِ، وَلِلْأَبَوَيْنِ السُّدُسَانِ، وَمَا بَقِيَ فَلِلِابْنَتَيْنِ، قَالَ : فَلِأَيِّ شَيْءٍ نَقَصْتَنِي؟ قَالَ : لَيْسَ أَنَا نَقَصْتُكَ، اللَّهُ نَقَصَكَ، لِلِابْنَتَيْنِ الثُّلُثَانِ، وَلِلْأَبَوَيْنِ السُّدُسَانِ، وَلِلزَّوْجِ الرُّبُعُ، فَهِيَ مِنْ سَبْعَةٍ وَنِصْفٍ فَرِيضَةً، فَرِيضَتُكَ عَائِلَةٌ \"",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Imran, dari Mu'awiyah bin Maisarah bin Syuraih, dari Syuraih bin al-Harith, dia berkata: \"Sengketa telah diajukan kepada Syuraih mengenai dua anak perempuan, dua orang tua, dan seorang suami. Dia memutuskan dalam hal itu. Kemudian suami itu datang mengadu kepadanya di masjid. Lalu dia mengirim Abdullah bin Rabah kepadanya dan mengambilnya, dan mengirim kepada Syuraih, lalu berkata: 'Apa yang dikatakan orang ini?' Dia berkata: 'Orang ini menyangka aku seorang yang zalim, dan aku menyangkanya seorang yang fajir, dia menampakkan keluhan dan menyembunyikan keputusan yang berlaku.' Lalu orang itu berkata kepadanya: 'Apa pendapatmu tentang dua anak perempuan, dua orang tua, dan seorang suami?' Dia berkata: 'Bagi suami seperempat dari seluruh harta, dan bagi kedua orang tua dua pertiga, dan sisanya untuk kedua anak perempuan.' Dia berkata: 'Mengapa engkau mengurangiku?' Dia berkata: 'Bukan aku yang mengurangimu, Allah yang mengurangimu, bagi kedua anak perempuan dua pertiga, dan bagi kedua orang tua dua pertiga, dan bagi suami seperempat, maka itu dari tujuh setengah bahagian wajib, bahagian wajibmu kurang.'\""
  },
  {
    "id": 39962,
    "hadith_number": 2425,
    "tajuk_hadith": "Wala' Anak Lelaki kepada Bapa",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ  ، عَنْ عَلِيِّ بْنِ مُسْهِرٍ  ، عَنْ أَشْعَثَ  ، عَنْ الشَّعْبِيِّ  ، عَنْ عَلِيٍّ  ، وَعُمَرَ  ، وَزَيْدٍ   ، قَالُوا :\" الْوَالِدُ يَجُرُّ وَلَاءَ وَلَدِهِ \"",
    "malay_translation": "Telah meriwayatkan kepada kami Muhammad bin Uyainah, daripada Ali bin Mushir, daripada Asy'ath, daripada Asy-Sya'bi, daripada Ali, Umar, dan Zaid, mereka berkata: 'Bapa mewarisi wala' anak lelakinya.'"
  },
  {
    "id": 39963,
    "hadith_number": 2426,
    "tajuk_hadith": "Datuk Menarik Hak Wala'",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ ، عَنْ عَلِيِّ بْنِ مُسْهِرٍ ، عَنْ أَشْعَثَ ، عَنْ الشَّعْبِيِّ ، قَالَ :\" الْجَدُّ يَجُرُّ الْوَلَاءَ \"",
    "malay_translation": "Muhammad bin Uyainah telah meriwayatkan kepada kami, daripada Ali bin Mushir, daripada Asy'ath, daripada asy-Sya'bi, beliau berkata: 'Datuk menarik hak wala'."
  },
  {
    "id": 39964,
    "hadith_number": 2427,
    "tajuk_hadith": "Bapa dan Hak Wala' Anak",
    "perawi_melayu": "Shuraih (Perawi)",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ ، عَنْ عَلِيِّ بْنِ مُسْهِرٍ ، عَنْ أَشْعَثَ ، عَنْ ابْنِ سِيرِينَ ، عَنْ شُرَيْحٍ ، قَالَ :\" الْوَالِدُ يَجُرُّ وَلَاءَ وَلَدِهِ \"",
    "malay_translation": "Diriwayatkan daripada Shuraih, beliau berkata: \"Bapa menarik wala' anaknya.\""
  },
  {
    "id": 39965,
    "hadith_number": 2428,
    "tajuk_hadith": "Wala' Anak Hamba yang Meninggal Dunia dan Mempunyai Bapa Merdeka",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ ، حَدَّثَنَا زَكَرِيَّا ، عَنْ عَامِرٍ  : \" فِي مَمْلُوكٍ تُوُفِّيَ وَلَهُ أَبٌ حُرٌّ، وَلَهُ بَنُونَ مِنْ امْرَأَةٍ حُرَّةٍ، لِمَنْ وَلَاءُ وَلَدِهِ؟ قَالَ :لِمَوَالِي الْجَدِّ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Zakaria, daripada Amir: \"Berkenaan seorang hamba yang meninggal dunia dan dia mempunyai seorang bapa yang merdeka, dan dia mempunyai anak-anak lelaki daripada seorang wanita merdeka, kepada siapakah wala' anak-anaknya? Beliau (Amir) berkata: Kepada mawali datuk (datuk pihak bapa).\""
  },
  {
    "id": 39966,
    "hadith_number": 2429,
    "tajuk_hadith": "Hukum Mukatab yang Meninggal Dunia Setelah Membayar Separuh Penebusan dan Mempunyai Anak",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ ، حَدَّثَنَا إِسْرَائِيلُ ، عَنْ مُغِيرَةَ ، عَنْ إِبْرَاهِيمَ  : \" فِي مُكَاتَبٍ مَاتَ وَقَدْ أَدَّى نِصْفَ مُكَاتَبَتِهِ، وَلَهُ وَلَدٌ مِنْ امْرَأَةٍ حُرَةٍ، قَالَ :مَا أُرَاهُ إِلَّا قَدْ جَرَّ وَلَاءَ وَلَدِهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Israil, daripada Mughirah, daripada Ibrahim: \"Mengenai seorang *mukatab* (hamba yang membuat perjanjian penebusan) yang meninggal dunia dan telah melaksanakan separuh daripada perjanjian penebusannya, dan dia mempunyai anak daripada seorang wanita merdeka, dia berkata: \"Saya tidak melihatnya kecuali dia telah menarik *wala'* (perwalian) anaknya.\""
  },
  {
    "id": 39967,
    "hadith_number": 2430,
    "tajuk_hadith": "Syuraih Menerima Pendapat Umar Tentang Wala' Anak Hamba yang Mengahwini Wanita Merdeka",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ الْحَكَمِ  ،  عَنْ إِبْرَاهِيمَ  ، قَالَ : \" كَانَ شُرَيْحٌ لَا يَرْجِعُ عَنْ قَضَاءٍ يَقْضِي بِهِ، فَحَدَّثَهُ الْأَسْوَدُ  : أَنَّ عُمَرَ  ، قَالَ :إِذَا تَزَوَّجَ الْمَمْلُوكُ الْحُرَّةَ، فَوَلَدَتْ أَوْلَادًا أَحْرَارًا، ثُمَّ عُتِقَ بَعْدَ ذَلِكَ، رَجَعَ الْوَلَاءُ لِمَوَالِي أَبِيهِمْ \"، فَأَخَذَ بِهِ شُرَيْحٌ",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Syu'bah, daripada al-Hakam, daripada Ibrahim, dia berkata: \"Syuraih tidak pernah menarik balik keputusan yang telah dia putuskan. Kemudian al-Aswad menceritakan kepadanya: bahawa Umar berkata: 'Apabila seorang hamba berkahwin dengan wanita merdeka, lalu melahirkan anak-anak yang merdeka, kemudian hamba itu dimerdekakan setelah itu, maka wala' (hak perwalian) kembali kepada bekas tuan-tuan bapa mereka.'\" Lalu Syuraih mengambil (pendapat) ini."
  },
  {
    "id": 39968,
    "hadith_number": 2431,
    "tajuk_hadith": "Hamba Sahaya Berkahwin dengan Wanita Merdeka dan Wala'",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَعْلَى  ، عَنْ الْأَعْمَشِ  ، عَنْ إِبْرَاهِيمَ  ، قَالَ : قَالَ عُمَر   : \" الْمَمْلُوكِ يَكُونُ تَحْتَهُ الْحُرَّةُ،يُعْتَقُ الْوَلَدُ بِعِتْقِ أُمِّهِ، فَإِذَا عُتِقَ الْأَبُ، جَرَّ الْوَلَاءَ \"",
    "malay_translation": "Telah menceritakan kepada kami Ya'la, daripada al-A'mash, daripada Ibrahim, dia berkata: Umar berkata: \"Hamba sahaya boleh berkahwin dengan wanita merdeka, anak dimerdekakan dengan pemerdekaan ibunya, maka apabila bapa dimerdekakan, dia menarik wala' (kesetiaan).\""
  },
  {
    "id": 39969,
    "hadith_number": 2432,
    "tajuk_hadith": "Wala' Anak Wanita Merdeka yang Berkahwin dengan Hamba",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسْلِمٌ ، حَدَّثَنَا عَبْدُ الْوَارِثِ ، عَنْ كَثِيرِ بْنِ شِنْظِيرٍ ، عَنْ عَطَاءٍ  : \" فِي الْحُرَّةِ تَحْتَ الْعَبْدِ، قَالَ :أَمَّا مَا وَلَدَتْ مِنْهُ وَهُوَ عَبْدٌ، فَوَلَاؤُهُمْ لِأَهْلِ نِعْمَتِهَا، وَمَا وَلَدَتْ مِنْهُ وَهُوَ حُرٌّ، فَوَلَاؤُهُمْ لِأَهْلِ نِعْمَتِهِ \"",
    "malay_translation": "Telah menceritakan kepada kami Muslim, telah menceritakan kepada kami Abdul Warith, daripada Kathir bin Shinzhir, daripada 'Ata': \"Mengenai wanita merdeka yang berkahwin dengan hamba, beliau berkata: 'Adapun apa yang dilahirkannya daripadanya sedangkan dia adalah hamba, maka wala' mereka adalah untuk tuan yang memberinya nikmat (memerdekakannya), dan apa yang dilahirkannya daripadanya sedangkan dia adalah orang merdeka, maka wala' mereka adalah untuk tuan yang memberinya nikmat (memerdekakannya).'\""
  },
  {
    "id": 39970,
    "hadith_number": 2433,
    "tajuk_hadith": "Hukum Anak yang Lahir dari Perkahwinan Wanita Merdeka dengan Hamba",
    "perawi_melayu": "Ja'far bin Aun, Al-A'mash, Ibrahim, Umar",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ  ، عَنْ الْأَعْمَشِ  ، عَنْ إِبْرَاهِيمَ  ، قَالَ : قَالَ عُمَرُ   :\" إِذَا كَانَتْ الْحُرَّةُ تَحْتَ الْمَمْلُوكِ، فَوَلَدَتْ لَهُ غُلَامًا، فَإِنَّهُ يُعْتَقُ بِعِتْقِ أُمِّهِ، وَوَلَاؤُهُ لِمَوَالِي أُمِّهِ، فَإِذَا أُعْتِقَ الْأَبُ، جَرَّ الْوَلَاءَ إِلَى مَوَالِي أَبِيهِ \"",
    "malay_translation": "Telah meriwayatkan kepada kami Ja'far bin Aun, daripada Al-A'mash, daripada Ibrahim, dia berkata: Umar berkata: \"Apabila seorang wanita merdeka berkahwin dengan seorang hamba, dan dia melahirkan seorang anak lelaki daripadanya, maka anak itu dimerdekakan dengan pemerdekaan ibunya, dan wala'nya adalah untuk tuan-tuan ibunya. Kemudian, apabila bapa itu dimerdekakan, wala' itu berpindah kepada tuan-tuan bapanya.\""
  },
  {
    "id": 39971,
    "hadith_number": 2434,
    "tajuk_hadith": "Kisah Hamba Sahaya dan Perjanjian Mukatabah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْحَكَمُ بْنُ الْمُبَارَكِ  ، حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ  ، عَنْ ابْنِ إِسْحَاق  ، عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ  ، عَنْ أَبِيهِ  ، قَالَ :\" كَانَتْ أُمِّي مَوْلَاةً لِلْحُرَقَةِ، وَكَانَ أَبِي يَعْقُوبُ مُكَاتَبًا لِمَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ النَّصْرِيِّ، ثُمَّ إِنَّ أَبِي أَدَّى كِتَابَتَهُ، فَدَخَلَ الْحُرَقِيُّ عَلَى عُثْمَانَ، يَسْأَلُ الْحَقَّ يَعْنِي : الْعَطَاءَ ، وَعِنْدَهُ مَالِكُ بْنُ أَوْسٍ، فَقَالَ : ذَاكَ مَوْلَايَ، فَاخْتَصَمَا إِلَى عُثْمَانَ  ، فَقَضَى بِهِ لِلْحُرَقِيِّ \"",
    "malay_translation": "Telah menceritakan kepada kami al-Hakam bin al-Mubarak, telah menceritakan kepada kami Muhammad bin Salamah, dari Ibn Ishaq, dari al-'Ala' bin 'Abd al-Rahman, dari ayahnya, dia berkata: \"Ibuku adalah seorang hamba sahaya bagi al-Huraqah, dan ayahku Ya'qub adalah seorang *mukatab* (hamba yang membuat perjanjian untuk menebus dirinya) bagi Malik bin Aus bin al-Hadathan al-Nasri. Kemudian ayahku menunaikan *kitabah*-nya (perjanjian penebusan), lalu al-Huraqi masuk menemui Uthman, meminta haknya, yaitu pemberian (*'ata'*), dan di sisinya ada Malik bin Aus, lalu dia berkata: 'Itu adalah *mawla*ku (bekas hambaku)'. Kemudian mereka berdua bertelingkah kepada Uthman, lalu Uthman memutuskan perkara itu untuk al-Huraqi.\""
  },
  {
    "id": 39972,
    "hadith_number": 2435,
    "tajuk_hadith": "Pembahagian Harta Pusaka Bagi Seseorang yang Tidak Mempunyai Waris",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ ، حَدَّثَنَا حَيْوَةُ ، أَخْبَرَنِي سَهْمُ بْنُ يَزِيدَ الْحَمْرَاوِيُّ : \" أَنَّ رَجُلًا تُوُفِّيَ وَلَيْسَ لَهُ وَارِثٌ، فَكُتِبَ فِيهِ إِلَى عُمَرَ بْنِ عَبْدِ الْعَزِيزِ  وَهُوَ خَلِيفَةٌ، فَكَتَبَ : أَنْاقْتَسِمُوا مِيرَاثَهُ عَلَى مَنْ كَانَ يَأْخُذُ مَعَهُمْ الْعَطَاءَ، فَقُسِمَ مِيرَاثُهُ عَلَى مَنْ كَانَ يَأْخُذُ مَعَهُمْ الْعَطَاءَ فِي عِرَافَتِهِ \"",
    "malay_translation": "Abdullah bin Yazid telah menceritakan kepada kami, katanya Haywah telah menceritakan kepada kami, katanya Sahm bin Yazid al-Hamrawi telah mengkhabarkan kepadaku: \"Bahawa seorang lelaki telah meninggal dunia dan tidak mempunyai waris. Perkara ini telah ditulis kepada Umar bin Abdul Aziz, yang ketika itu seorang Khalifah. Beliau membalas dengan menulis: 'Bahagikanlah harta pusaka lelaki itu kepada mereka yang menerima pemberian (al-'Ata') bersama mereka.' Maka harta pusaka itu pun dibahagikan kepada mereka yang menerima pemberian (al-'Ata') dalam kumpulan mereka (irafahnya).\""
  }
]
