[
  {
    "id": 38832,
    "hadith_number": 1295,
    "tajuk_hadith": "Hukum Buruan Anjing Pemburu dan Mi'rad (Anak Panah)",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَعْلَى بْنُ عُبَيْدٍ  ، حَدَّثَنَا زَكَرِيَّا  ، عَنْ عَامِرٍ  ، عَنْ عَدِيِّ بْنِ حَاتِمٍ  ، قَالَ : سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَيْدِ الْكَلْبِ، فَقَالَ :\" مَا أَمْسَكَ عَلَيْكَ كَلْبِكَ فَكُلْ، فَإِنَّ أَخْذَهُ ذَكَاتُهُ، وَإِنْ وَجَدْتَ مَعَهُ كَلْبًا فَخَشِيتَ أَنْ يَكُونَ قَدْ أَخَذَهُ مَعَهُ، وَقَدْ قَتَلَهُ، فَلَا تَأْكُلْهُ، فَإِنَّكَ إِنَّمَا ذَكَرْتَ اسْمَ اللَّهِ عَلَى كَلْبِكَ، وَلَمْ تَذْكُرْهُ عَلَى غَيْرِهِ \".\nأَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا زَكَرِيَّا  ، عَنْ عَامِرٍ  ، عَنْ عَدِيِّ بْنِ حَاتِمٍ  ، قَالَ : سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَيْدِ الْمِعْرَاضِ، فَذَكَرَ مِثْلَهُ",
    "malay_translation": "Telah mengkhabarkan kepada kami Ya'la bin Ubaid, telah menceritakan kepada kami Zakaria, daripada Amir, daripada 'Adi bin Hatim, beliau berkata: Aku bertanya kepada Rasulullah SAW tentang buruan anjing pemburu, lalu Baginda bersabda: \"Apa yang ditangkap oleh anjingmu untukmu, maka makanlah, kerana tangkapannya itu adalah penyembelihannya. Dan jika kamu dapati bersamanya anjing lain, dan kamu khuatir anjing itu telah menangkapnya bersamanya, dan telah membunuhnya, maka janganlah kamu memakannya, kerana sesungguhnya kamu hanya menyebut nama Allah atas anjingmu, dan tidak menyebutnya atas anjing yang lain itu.\" Telah mengkhabarkan kepada kami Abu Nu'aim, telah menceritakan kepada kami Zakaria, daripada Amir, daripada 'Adi bin Hatim, beliau berkata: Aku bertanya kepada Rasulullah SAW tentang buruan mi'rad (anak panah), lalu Baginda menyebutkan seumpamanya."
  },
  {
    "id": 38833,
    "hadith_number": 1296,
    "tajuk_hadith": "Larangan Memelihara Anjing Kecuali Untuk Berburu atau Menjaga Ternakan",
    "perawi_melayu": "Diriwayatkan daripada Abdullah bin Umar R.A.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ  ، عَنْ ابْنِ عُمَرَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَنْ اقْتَنَى كَلْبًا إِلَّا كَلْبَ صَيْدٍ أَوْ مَاشِيَةٍ، نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطَانِ \"",
    "malay_translation": "Abu Nu'aim telah mengkhabarkan kepada kami, Sufyan telah menceritakan kepada kami, daripada Abdullah bin Dinar, daripada Ibn Umar, beliau berkata: Rasulullah SAW bersabda: \"Sesiapa yang memelihara anjing kecuali anjing pemburu atau anjing ternakan, maka amalannya akan berkurang setiap hari sebanyak dua qirat.\""
  },
  {
    "id": 38834,
    "hadith_number": 1297,
    "tajuk_hadith": "Larangan Memelihara Anjing Tanpa Keperluan yang Jelas",
    "perawi_melayu": "Al-Hakam bin Al-Mubarak",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْحَكَمُ بْنُ الْمُبَارَكِ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ يَزِيدَ بْنِ خُصَيْفَةَ  ، عَنْ السَّائِبِ بْنِ يَزِيدَ  ، أَنَّهُ سَمِعَ سُفْيَانَ بْنَ أَبِي زُهَيْرٍ   يُحَدِّثُ نَاسًا مَعَهُ عِنْدَ بَاب الْمَسْجِدِ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ :\" مَنْ اقْتَنَى كَلْبًا لَا يُغْنِي عَنْهُ زَرْعًا وَلَا ضَرْعًا، نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطٌ \".\nقَالُوا : أَنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ : إِي وَرَبِّ هَذَا الْمَسْجِدِ",
    "malay_translation": "Telah menceritakan kepada kami Al-Hakam bin Al-Mubarak, telah menceritakan kepada kami Malik, dari Yazid bin Khusaifah, dari As-Saib bin Yazid, bahawasanya dia mendengar Sufyan bin Abu Zuhair menceritakan kepada orang ramai bersamanya di pintu masjid, dia berkata: Saya mendengar Rasulullah SAW bersabda: \"Barangsiapa memelihara anjing yang tidak berguna untuk tanaman atau ternakan, maka akan berkurang dari amalannya setiap hari sebanyak satu qirath.\" Mereka bertanya: \"Adakah kamu mendengar ini dari Rasulullah SAW?\" Dia menjawab: \"Ya, demi Tuhan masjid ini.\""
  },
  {
    "id": 38835,
    "hadith_number": 1298,
    "tajuk_hadith": "Arahan Membunuh Anjing dan Pengecualiannya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا وَهْبُ بْنُ جَرِيرٍ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ أَبِي التَّيَّاحِ  ، عَنْ مُطَرِّفٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ  ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَمَرَ بِقَتْلِ الْكِلَابِ، ثُمَّ قَالَ : \" مَا بَالِي وَلِلْكِلَابِ؟ \"، ثُمَّ رَخَّصَ فِي كَلْبِ الرَّعْيِ وَكَلْبِ الصَّيْدِ",
    "malay_translation": "Wahb bin Jarir memberitahu kami, Syu'bah meriwayatkan kepada kami, daripada Abu al-Tayyah, daripada Mutarrif, daripada Abdullah bin Mughaffal, bahawa Nabi SAW memerintahkan untuk membunuh anjing. Kemudian Baginda bersabda: 'Apa urusanku dengan anjing?' Kemudian Baginda memberikan keringanan (rukhsah) untuk anjing gembala dan anjing pemburu."
  },
  {
    "id": 38836,
    "hadith_number": 1299,
    "tajuk_hadith": "Perintah Membunuh Anjing",
    "perawi_melayu": "Diriwayatkan dari Ibnu Umar RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ  ، حَدَّثَنَا مَالِكٌ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ  ، قَالَ : \" أَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَبِقَتْلِ الْكِلَابِ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Khalid bin Makhlad, telah menceritakan kepada kami Malik, dari Nafi', dari Ibnu Umar, dia berkata: \"Rasulullah SAW memerintahkan untuk membunuh anjing.\""
  },
  {
    "id": 38837,
    "hadith_number": 1300,
    "tajuk_hadith": "Larangan Membunuh Anjing Kecuali yang Hitam Legam",
    "perawi_melayu": "Diriwayatkan daripada Abdullah bin Mughaffal RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ  ، حَدَّثَنَا عَوْفٌ  ، عَنْ الْحَسَنِ  ،  عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" لَوْلَا أَنَّ الْكِلَابَ أُمَّةٌ مِنْ الْأُمَمِ، لَأَمَرْتُ بِقَتْلِهَا كُلِّهَا، وَلَكِنْ اقْتُلُوا مِنْهَا كُلَّ أَسْوَدَ بَهِيمٍ \".\nقَالَ سَعِيدُ بْنُ عَامِرٍ : الْبَهِيمُ : الْأَسْوَدُ كُلُّهُ",
    "malay_translation": "Sa'id bin Amir mengkhabarkan kepada kami, 'Auf menceritakan kepada kami, daripada Al-Hasan, daripada Abdullah bin Mughaffal, dia berkata: Rasulullah SAW bersabda: 'Sekiranya anjing bukan sebahagian daripada umat-umat (makhluk) yang ada, pasti aku perintahkan untuk membunuh kesemuanya. Akan tetapi, bunuhlah anjing yang hitam legam di antara mereka.' Said bin Amir berkata: 'Al-Bahim adalah: keseluruhan yang hitam.'"
  },
  {
    "id": 38838,
    "hadith_number": 1301,
    "tajuk_hadith": "Hukum Memakan Hasil Buruan yang Ditangkap dengan Mi'rad (Anak Panah Lebar)",
    "perawi_melayu": "Sulaiman bin Harb, daripada Syu'bah, daripada Abdullah bin Abi al-Safar, daripada al-Sya'bi, katanya: Saya mendengar Adi bin Hatim berkata: Saya bertanya kepada Nabi SAW tentang mi'rad (anak panah lebar). Baginda bersabda: \"Jika ia mengenainya dengan mata tajamnya, maka makanlah. Dan jika ia mengenainya dengan bahagian lebarnya lalu membunuh, maka itu adalah *waqidz* (binatang yang dipukul hingga mati), maka janganlah kamu makan.\"",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي السَّفَرِ  ، عَنْ الشَّعْبِيِّ  ، قَالَ : سَمِعْتُ عَدِيَّ بْنَ حَاتِمٍ  ، قَالَ : سَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمِعْرَاضِ، فَقَالَ :\" إِذَا أَصَابَ بِحَدِّهِ، فَكُلْ، وَإِذَا أَصَابَ بِعَرْضِهِ فَقَتَلَ، فَإِنَّهُ وَقِيذٌ، فَلَا تَأْكُلْ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Syu'bah, daripada Abdullah bin Abi al-Safar, daripada al-Sya'bi, katanya: Saya mendengar Adi bin Hatim berkata: Saya bertanya kepada Nabi SAW tentang mi'rad (anak panah lebar). Baginda bersabda: \"Jika ia mengenainya dengan mata tajamnya, maka makanlah. Dan jika ia mengenainya dengan bahagian lebarnya lalu membunuh, maka itu adalah *waqidz* (binatang yang dipukul hingga mati), maka janganlah kamu makan.\""
  },
  {
    "id": 38839,
    "hadith_number": 1302,
    "tajuk_hadith": "Memakan Belalang dalam Peperangan Bersama Rasulullah SAW",
    "perawi_melayu": "Diriwayatkan daripada Abdullah bin Abi Aufa RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ أَبِي يَعْفُورٍ  ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى  ، قَالَ : \" غَزَوْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَبْعَ غَزَوَاتٍنَأْكُلُ الْجَرَادَ \"",
    "malay_translation": "Muhammad bin Yusuf telah mengkhabarkan kepada kami, daripada Sufyan, daripada Abu Ya'fur, daripada Abdullah bin Abi Aufa, beliau berkata: \"Kami telah berperang bersama Rasulullah SAW sebanyak tujuh kali peperangan, dan kami memakan belalang.\""
  },
  {
    "id": 38840,
    "hadith_number": 1303,
    "tajuk_hadith": "Air Laut adalah Suci dan Halal Bangkainya",
    "perawi_melayu": "Muhammad bin Al-Mubarak, daripada Malik, daripada Safwan bin Salim, daripada Sa'id bin Salamah daripada keluarga Al-Azraq, bahawa Al-Mughirah bin Abi Burdah, seorang lelaki dari Bani Abd Ad-Dar, memberitahunya bahawa dia mendengar Abu Hurairah berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ  ، قِرَاءَةً، عَنْ مَالِكٍ  ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ  ، عَنْ سَعِيدِ بْنِ سَلَمَةَ  مِنْ آلِ الْأَزْرَقِ، أَنَّ الْمُغِيرَةَ بْنَ أَبِي بُرْدَةَ  وَهُوَ رَجُلٌ مِنْ بَنِي عَبْدِ الدَّارِ أَخْبَرَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ  ، يَقُولُ : سَأَلَ رَجُلٌ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ : إِنَّا نَرْكَبُ الْبَحْرَ وَنَحْمِلُ مَعَنَا الْقَلِيلَ مِنْ الْمَاءِ، فَإِنْ تَوَضَّأْنَا بِهِ، عَطِشْنَا، أَفَنَتَوَضَّأُ مِنْ مَاءِ الْبَحْرِ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" هُوَ الطَّهُورُ مَاؤُهُ، الْحِلُّ مَيْتَتُهُ \"",
    "malay_translation": "Seorang lelaki bertanya kepada Nabi SAW, 'Kami belayar di laut dan membawa sedikit air bersama kami. Jika kami berwuduk dengannya, kami akan dahaga. Bolehkah kami berwuduk dengan air laut?' Rasulullah SAW bersabda, 'Laut itu suci airnya dan halal bangkainya.'"
  },
  {
    "id": 38841,
    "hadith_number": 1304,
    "tajuk_hadith": "Ekspedisi Mencari Makanan: Kisah Tentera yang Kelaparan dan Ikan Terdampar",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا زَكَرِيَّا بْنُ عَدِيٍّ  ، حَدَّثَنَا ابْنُ عُيَيْنَةَ  ، عَنْ عَمْرٍو يَعْنِي : ابْنَ دِينَارٍ  ،  عَنْ جَابِرٍ  ، قَالَ : \" بَعَثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ثَلَاثِ مِئَةٍ،فَأَصَابَنَا جُوعٌ حَتَّى أَتَيْنَا الْبَحْرَ وَقَدْ قَذَفَ دَابَّةً، فَأَكَلْنَا مِنْهَا حَتَّى ثَابَتْ أَجْسَامُنَا، فَأَخَذَ أَبُو عُبَيْدَةَ ضِلْعًا مِنْ أَضْلَاعِهَا فَوَضَعَهُ، ثُمَّ حَمَلَ أَطْوَلَ رَجُلٍ فِي الْجَيْشِ عَلَى أَعْظَمِ بَعِيرٍ فِي الْجَيْشِ فَمَرَّ تَحْتَهُ، هَذَا مَعْنَاهُ \"",
    "malay_translation": "Zakaria bin Adiy telah memberitahu kami, Ibn Uyainah telah memberitahu kami, daripada Amru, iaitu Ibn Dinar, daripada Jabir, dia berkata: \"Rasulullah SAW telah menghantar kami dalam satu pasukan yang terdiri daripada tiga ratus orang. Kami mengalami kelaparan sehingga kami tiba di laut, dan laut telah memuntahkan seekor haiwan (ikan). Kami makan daripadanya sehingga badan kami kembali pulih. Abu Ubaidah mengambil sebatang tulang rusuk daripadanya dan meletakkannya. Kemudian dia menaiki lelaki yang paling tinggi dalam tentera di atas unta yang paling besar dalam tentera, lalu dia lalu di bawahnya. Inilah maksudnya.\""
  },
  {
    "id": 38842,
    "hadith_number": 1305,
    "tajuk_hadith": "Berburu Arnab di Marr az-Zahran dan Memberikannya kepada Rasulullah SAW",
    "perawi_melayu": "Diriwayatkan dari Anas bin Malik RA",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا شُعْبَةُ  ، قَالَ : هِشَامُ بْنُ زَيْدِ بْنِ أَنَسٍ  أَخْبَرَنِي، قَالَ : سَمِعْتُ أَنَسَ بْنَ مَالِكٍ  ، يَقُولُ :أَنْفَجْنَا أَرْنَبًا وَنَحْنُ بِمَرِّ الظَّهْرَانِ ، فَسَعَى الْقَوْمُ فَلَغِبُوا، فَأَخَذْتُهَا وَجِئْتُ بِهَا إِلَى أَبِي طَلْحَةَ، فَذَبَحَهَا وَبَعَثَ بِوَرِكَيْهَا أَوْ فَخِذَيْهَا، شَكَّ شُعْبَةُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \" فَقَبِلَهَا \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Abu al-Walid, telah menceritakan kepada kami Syu'bah, dia berkata: Hisyam bin Zaid bin Anas telah mengkhabarkan kepadaku, dia berkata: Aku mendengar Anas bin Malik RA berkata: Kami telah membangkitkan seekor arnab ketika kami berada di Marr az-Zahran, lalu orang ramai mengejarnya sehingga mereka keletihan. Aku menangkapnya dan membawanya kepada Abu Talhah, lalu dia menyembelihnya dan mengirimkan kedua-dua punggungnya atau kedua-dua pahanya - Syu'bah ragu-ragu - kepada Rasulullah SAW, lalu baginda menerimanya."
  },
  {
    "id": 38843,
    "hadith_number": 1306,
    "tajuk_hadith": "Menyembelih dengan Marwah (Batu) dan Hukum Memakannya",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ  ، أَخْبَرَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ  ، عَنْ عَامِرٍ  ، عَنْ مُحَمَّدِ بْنِ صَفْوَانَ  ، أَنَّهُ مَرَّ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَرْنَبَيْنِ مُعَلِّقُهُمَا، فَقَالَ : \" يَا رَسُولَ اللَّهِ، إِنِّيدَخَلْتُ غَنَمَ أَهْلِي فَاصْطَدْتُ هَذَيْنِ الْأَرْنَبَيْنِ، فَلَمْ أَجِدْ حَدِيدَةً أُذَكِّيهِمَا بِهَا، فَذَكَّيْتُهُمَا بِمَرْوَةٍ، أَفَآكُلُ؟ قَالَ : \" نَعَمْ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Yazid bin Harun, telah mengkhabarkan kepada kami Daud bin Abi Hind, daripada Amir, daripada Muhammad bin Safwan, bahawa dia melewati Nabi SAW dengan dua ekor arnab yang digantungnya, lalu dia berkata: \"Wahai Rasulullah, sesungguhnya aku memasuki kambing (ternakan) keluargaku lalu aku memburu dua ekor arnab ini, dan aku tidak menjumpai besi untuk menyembelih keduanya, maka aku menyembelih keduanya dengan marwah (batu). Bolehkah aku memakannya?\" Baginda bersabda: \"Ya.\""
  },
  {
    "id": 38844,
    "hadith_number": 1307,
    "tajuk_hadith": "Hukum Memakan Dhab (Sejenis Biawak Padang Pasir)",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ  ، عَنْ سُفْيَانَ  ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ  ، عَنْ ابْنِ عُمَرَ  ، قَالَ : سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الضَّبِّ، فَقَالَ :\" لَسْتُ بِآكِلِهِ وَلَا مُحَرِّمِهِ \"",
    "malay_translation": "Muhammad bin Yusuf telah mengkhabarkan kepada kami, daripada Sufyan, daripada Abdullah bin Dinar, daripada Ibn Umar, beliau berkata: Nabi SAW ditanya mengenai dhab (sejenis biawak padang pasir), lalu Baginda bersabda: \"Aku tidak memakannya dan aku tidak mengharamkannya.\""
  },
  {
    "id": 38845,
    "hadith_number": 1308,
    "tajuk_hadith": "Hukum Memakan Dhab (Sejenis Biawak Padang Pasir)",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَهْلُ بْنُ حَمَّادٍ  ، حَدَّثَنَا شُعْبَةُ  ، حَدَّثَنَا الْحَكَمُ  ، قَالَ : سَمِعْتُ زَيْدَ بْنَ وَهْبٍ  يُحَدِّثُ، عَنْ الْبَرَاءِ بْنِ عَازِبٍ  ، عَنْ ثَابِتِ بْنِ وَدِيعَةَ  ، قَالَ : أُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِضَبٍّ، فَقَالَ :\" أُمَّةٌ مُسِخَتْ وَاللَّهُ أَعْلَمُ \"",
    "malay_translation": "Telah mengkhabarkan kepada kami Sahl bin Hammad, telah menceritakan kepada kami Syu'bah, telah menceritakan kepada kami Al-Hakam, dia berkata: Aku mendengar Zaid bin Wahb menceritakan, daripada Al-Bara' bin 'Azib, daripada Thabit bin Wadi'ah, dia berkata: Nabi SAW telah dibawakan dhab (sejenis biawak padang pasir), lalu Baginda bersabda: \"(Ini adalah) umat yang telah diubah rupa (menjadi binatang). Dan Allah lebih mengetahui.\""
  },
  {
    "id": 38846,
    "hadith_number": 1309,
    "tajuk_hadith": "Hukum Memakan Dhab (Sejenis Biawak Padang Pasir)",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، حَدَّثَنِي اللَّيْثُ  ، حَدَّثَنِي يُونُسُ  ، عَنْ ابْنِ شِهَابٍ  ، أَنَّهُ قَالَ : أَخْبَرَنِي أَبُو أُمَامَةَ بْنُ سَهْلِ بْنِ حُنَيْفٍ الْأَنْصَارِيُّ  ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ  أَخْبَرَهُ، أَنَّ خَالِدَ بْنَ الْوَلِيدِ   الَّذِي يُقَالُ لَهُ سَيْفُ اللَّهِ أَخْبَرَهُ، أَنَّهُ دَخَلَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى مَيْمُونَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ خَالَتُهُ وَخَالَةُ ابْنِ عَبَّاسٍ، فَوَجَدَ عِنْدَهَا ضَبًّا مَحْنُوذًا قَدِمَتْ بِهِ أُخْتُهَا حُفَيْدَةُ بِنْتُ الْحَارِثِ مِنْ نَجْدٍ ، فَقَدَّمَتْ الضَّبَّ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَكَانَ قَلَّمَا يُقَدِّمُ يَدَهُ لِطَعَامٍ حَتَّى يُحَدَّثَ بِهِ وَيُسَمَّى لَهُ، فَأَهْوَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ إِلَى الضَّبِّ، فَقَالَتْ امْرَأَةٌ مِنْ نِسْوَةِ الْحُضُورِ : أَخْبِرْنَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا قَدَّمْتُنَّ لَهُ.\nقُلْنَ : هَذَا الضَّبُّ، فَرَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ، فَقَالَ خَالِدُ بْنُ الْوَلِيدِ :أَتُحَرِّمُ الضَّبَّ يَا رَسُولَ اللَّهِ؟ قَالَ : \" لَا، وَلَكِنَّهُ لَمْ يَكُنْ بِأَرْضِ قَوْمِي، فَأَجِدُنِي أَعَافُهُ \".\nقَالَ خَالِدٌ : فَاجْتَرَرْتُهُ فَأَكَلْتُهُ، وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْظُرُ، فَلَمْ يَنْهَنِي",
    "malay_translation": "Abdullah bin Soleh memberitahu kami, Al-Laith memberitahu saya, Yunus memberitahu saya, daripada Ibn Shihab, bahawa dia berkata: Abu Umamah bin Sahl bin Hunaif Al-Ansari memberitahu saya, bahawa Abdullah bin Abbas memberitahunya, bahawa Khalid bin Al-Walid, yang digelar Saifullah (Pedang Allah), memberitahunya, bahawa dia masuk bersama Rasulullah SAW menemui Maimunah, isteri Nabi SAW, yang merupakan ibu saudaranya dan ibu saudara Ibn Abbas. Mereka mendapati di sisinya seekor *dhab* (sejenis biawak padang pasir) yang dipanggang yang dibawa oleh saudaranya, Hufaidah binti Al-Harith dari Najd. Dia menghidangkan *dhab* tersebut kepada Rasulullah SAW, dan baginda jarang menghulurkan tangannya kepada makanan sehingga diberitahu tentangnya dan namanya disebutkan. Rasulullah SAW menghulurkan tangannya ke arah *dhab* itu, lalu seorang wanita daripada kalangan wanita yang hadir berkata: Beritahulah Rasulullah SAW apa yang kamu hidangkan kepadanya.\nMereka berkata: Ini *dhab*. Lalu Rasulullah SAW mengangkat tangannya. Khalid bin Al-Walid berkata: Adakah kamu mengharamkan *dhab*, wahai Rasulullah? Baginda bersabda: \"Tidak, tetapi ia tidak pernah ada di negeri kaumku, maka aku merasa jijik padanya.\"\nKhalid berkata: Lalu aku menariknya dan memakannya, dan Rasulullah SAW melihat, dan baginda tidak melarangku."
  },
  {
    "id": 38847,
    "hadith_number": 1310,
    "tajuk_hadith": "Larangan Memotong Anggota Badan Haiwan Semasa Hidup",
    "perawi_melayu": "Diriwayatkan daripada Abu Waqid al-Laithi",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ  ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ دِينَارٍ  ، حَدَّثَنَا زَيْدُ بْنُ أَسْلَمَ  ، قَالَ عَبْدُ الرَّحْمَنِ : أَحْسَبُهُ عَنْ عَطَاءِ بْنِ يَسَارٍ  ، عَنْ أَبِي وَاقِدٍ اللَّيْثِيِّ  ، قَالَ : قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ ، وَالنَّاسُ يَجُبُّونَ أَسْنِمَةَ الْإِبِلِ وَأَلْيَاتِ الْغَنَمِ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَا قُطِعَ مِنْ بَهِيمَةٍ وَهِيَ حَيَّةٌ، فَهُوَ مَيْتَةٌ \"",
    "malay_translation": "Ubaidullah bin Abdul Majid memberitahu kami, Abdul Rahman bin Abdullah bin Dinar memberitahu kami, Zaid bin Aslam memberitahu kami, Abdul Rahman berkata: Saya rasa ia daripada 'Ata' bin Yasar, daripada Abu Waqid al-Laithi, beliau berkata: Rasulullah SAW tiba di Madinah, dan orang ramai memotong bonggol unta dan punggung kambing. Maka Rasulullah SAW bersabda: \"Apa sahaja yang dipotong daripada haiwan ketika ia masih hidup, maka ia adalah bangkai.\""
  }
]
