[
  {
    "id": 18432,
    "hadith_number": 3696,
    "tajuk_hadith": "Kemurahan Rasulullah SAW terhadap Puak Hawazin",
    "perawi_melayu": "Ia diriwayatkan daripada 'Amr bin Shu'aib, daripada bapanya, bahawa datuknya berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ، قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ كُنَّا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ أَتَتْهُ وَفْدُ هَوَازِنَ فَقَالُوا يَا مُحَمَّدُ إِنَّا أَصْلٌ وَعَشِيرَةٌ وَقَدْ نَزَلَ بِنَا مِنَ الْبَلاَءِ مَا لاَ يَخْفَى عَلَيْكَ فَامْنُنْ عَلَيْنَا مَنَّ اللَّهُ عَلَيْكَ ‏.‏ فَقَالَ ‏\"‏ اخْتَارُوا مِنْ أَمْوَالِكُمْ أَوْ مِنْ نِسَائِكُمْ وَأَبْنَائِكُمْ ‏\"‏ ‏.‏ فَقَالُوا قَدْ خَيَّرْتَنَا بَيْنَ أَحْسَابِنَا وَأَمْوَالِنَا بَلْ نَخْتَارُ نِسَاءَنَا وَأَبْنَاءَنَا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمَّا مَا كَانَ لِي وَلِبَنِي عَبْدِ الْمُطَّلِبِ فَهُوَ لَكُمْ فَإِذَا صَلَّيْتُ الظُّهْرَ فَقُومُوا فَقُولُوا إِنَّا نَسْتَعِينُ بِرَسُولِ اللَّهِ عَلَى الْمُؤْمِنِينَ أَوِ الْمُسْلِمِينَ فِي نِسَائِنَا وَأَبْنَائِنَا ‏\"‏ ‏.‏ فَلَمَّا صَلَّوُا الظُّهْرَ قَامُوا فَقَالُوا ذَلِكَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَمَا كَانَ لِي وَلِبَنِي عَبْدِ الْمُطَّلِبِ فَهُوَ لَكُمْ ‏\"‏ ‏.‏ فَقَالَ الْمُهَاجِرُونَ وَمَا كَانَ لَنَا فَهُوَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ وَقَالَتِ الأَنْصَارُ مَا كَانَ لَنَا فَهُوَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَقَالَ الأَقْرَعُ بْنُ حَابِسٍ أَمَّا أَنَا وَبَنُو تَمِيمٍ فَلاَ ‏.‏ وَقَالَ عُيَيْنَةُ بْنُ حِصْنٍ أَمَّا أَنَا وَبَنُو فَزَارَةَ فَلاَ ‏.‏ وَقَالَ الْعَبَّاسُ بْنُ مِرْدَاسٍ أَمَّا أَنَا وَبَنُو سُلَيْمٍ فَلاَ ‏.‏ فَقَامَتْ بَنُو سُلَيْمٍ فَقَالُوا كَذَبْتَ مَا كَانَ لَنَا فَهُوَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا أَيُّهَا النَّاسُ رُدُّوا عَلَيْهِمْ نِسَاءَهُمْ وَأَبْنَاءَهُمْ فَمَنْ تَمَسَّكَ مِنْ هَذَا الْفَىْءِ بِشَىْءٍ فَلَهُ سِتُّ فَرَائِضَ مِنْ أَوَّلِ شَىْءٍ يُفِيئُهُ اللَّهُ عَزَّ وَجَلَّ عَلَيْنَا ‏\"‏ ‏.‏ وَرَكِبَ رَاحِلَتَهُ وَرَكِبَ النَّاسُ اقْسِمْ عَلَيْنَا فَيْأَنَا فَأَلْجَئُوهُ إِلَى شَجَرَةٍ فَخَطِفَتْ رِدَاءَهُ فَقَالَ ‏\"‏ يَا أَيُّهَا النَّاسُ رُدُّوا عَلَىَّ رِدَائِي فَوَاللَّهِ لَوْ أَنَّ لَكُمْ شَجَرَ تِهَامَةَ نَعَمًا قَسَمْتُهُ عَلَيْكُمْ ثُمَّ لَمْ تَلْقَوْنِي بَخِيلاً وَلاَ جَبَانًا وَلاَ كَذُوبًا ‏\"‏ ‏.‏ ثُمَّ أَتَى بَعِيرًا فَأَخَذَ مِنْ سَنَامِهِ وَبَرَةً بَيْنَ أُصْبُعَيْهِ ثُمَّ يَقُولُ ‏\"‏ هَا إِنَّهُ لَيْسَ لِي مِنَ الْفَىْءِ شَىْءٌ وَلاَ هَذِهِ إِلاَّ خُمُسٌ وَالْخُمُسُ مَرْدُودٌ فِيكُمْ ‏\"‏ ‏.‏ فَقَامَ إِلَيْهِ رَجُلٌ بِكُبَّةٍ مِنْ شَعْرٍ فَقَالَ يَا رَسُولَ اللَّهِ أَخَذْتُ هَذِهِ لأُصْلِحَ بِهَا بَرْدَعَةَ بَعِيرٍ لِي ‏.‏ فَقَالَ ‏\"‏ أَمَّا مَا كَانَ لِي وَلِبَنِي عَبْدِ الْمُطَّلِبِ فَهُوَ لَكَ ‏\"‏ ‏.‏ فَقَالَ أَوَبَلَغَتْ هَذِهِ فَلاَ أَرَبَ لِي فِيهَا ‏.‏ فَنَبَذَهَا ‏.‏ وَقَالَ ‏\"‏ يَا أَيُّهَا النَّاسُ أَدُّوا الْخِيَاطَ وَالْمِخْيَطَ فَإِنَّ الْغُلُولَ يَكُونُ عَلَى أَهْلِهِ عَارًا وَشَنَارًا يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Kami berada di sisi Rasulullah SAW ketika rombongan Hawazin datang menghadap baginda dan berkata: \"Wahai Muhammad! Kami adalah salah satu puak Arab dan telah ditimpa musibah yang engkau maklumi. Berilah kami pertolongan, semoga Allah memberkatimu.\" Baginda SAW bersabda: \"Pilihlah antara harta kamu atau isteri dan anak-anak kamu.\" Mereka berkata: \"Engkau telah memberi pilihan antara keluarga dan harta kami; kami memilih isteri dan anak-anak kami.\" Rasulullah SAW bersabda: \"Adapun harta yang menjadi hakku dan Bani Abdul Muttalib, ia adalah untuk kamu. Setelah aku menunaikan solat Zuhur, maka berdirilah kamu dan katakanlah: 'Sesungguhnya kami memohon pertolongan daripada Rasulullah SAW terhadap kaum mukminin atau kaum Muslimin dalam hal isteri dan anak-anak kami.'\" Maka setelah mereka menunaikan solat Zuhur, mereka berdiri dan berkata demikian. Rasulullah SAW bersabda: \"Adapun harta yang menjadi hakku dan Bani Abdul Muttalib, ia adalah untuk kamu.\" Muhajirin berkata: \"Harta yang menjadi hak kami adalah untuk Rasulullah SAW.\" Ansar berkata: \"Harta yang menjadi hak kami adalah untuk Rasulullah SAW.\" Al-Aqra' bin Habis berkata: \"Adapun aku dan Bani Tamim, maka tidak (kami tidak akan menyerahkannya).\" Uyaynah bin Hisn berkata: \"Adapun aku dan Bani Fazarah, maka tidak (kami tidak akan menyerahkannya).\" Al-Abbas bin Mirdās berkata: \"Adapun aku dan Bani Sulaim, maka tidak (kami tidak akan menyerahkannya).\" Bani Sulaim berdiri dan berkata: \"Engkau berdusta; harta yang menjadi hak kami adalah untuk Rasulullah SAW.\" Rasulullah SAW bersabda: \"Wahai manusia, kembalikanlah isteri dan anak-anak mereka. Barangsiapa yang mengembalikan sesuatu daripada ghanimah ini, maka baginya enam ekor unta daripada ghanimah yang Allah berikan kepada kita kelak.\" Kemudian baginda menaiki kenderaan baginda dan manusia mengelilinginya sambil berkata: \"Bahagikanlah ghanimah kami.\" Mereka memaksa baginda kembali ke arah sebatang pokok lalu tertanggallah rida' (kain penutup kepala) baginda. Baginda bersabda: \"Wahai manusia! Kembalikanlah rida'ku. Demi Allah! Sekiranya kamu mempunyai ternakan sebanyak pokok-pokok di Tihamah, nescaya aku akan membahagikannya kepada kamu, maka kamu tidak akan mendapatiku bakhil, pengecut atau pendusta.\" Kemudian baginda pergi kepada seekor unta lalu mengambil secebis bulu dari bonggolnya di antara dua jari baginda dan bersabda: \"Lihatlah! Aku tidak mempunyai apa-apa daripada ghanimah. Yang ada padaku hanyalah khums, dan khums itu akan dikembalikan kepada kamu.\" Seorang lelaki berdiri sambil memegang sebiji bebola benang daripada bulu kambing dan berkata: \"Wahai Rasulullah SAW, aku mengambilnya untuk membaiki pelana untaku.\" Baginda bersabda: \"Adapun harta yang menjadi hakku dan Bani Abdul Muttalib, ia adalah untukmu.\" Lelaki itu berkata: \"Adakah ini penting? Aku tidak memerlukannya!\" Lalu lelaki itu membuangnya. Baginda bersabda: \"Wahai manusia! Kembalikanlah bahkan jarum yang besar dan kecil, kerana ghanimah yang dirampas akan menjadi aib dan kehinaan bagi mereka yang mengambilnya pada hari kiamat.\""
  },
  {
    "id": 18433,
    "hadith_number": 3697,
    "tajuk_hadith": "Mengenai Mengembalikan Hadiah",
    "perawi_melayu": "Ia diriwayatkan daripada Amr bin Syu'aib, daripada bapanya, bahawa datuknya berkata:",
    "english_text": "\"The Messenger of Allah said: 'No one should take back his gift except a father (taking back a gift) from his son. The one who takes back his gift is like one who goes back to his vomit.'\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصٍ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي إِبْرَاهِيمُ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ عَامِرٍ الأَحْوَلِ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لا يَرْجِعُ أَحَدٌ فِي هِبَتِهِ إِلاَّ وَالِدٌ مِنْ وَلَدِهِ وَالْعَائِدُ فِي هِبَتِهِ كَالْعَائِدِ فِي قَيْئِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Tiada sesiapa pun yang harus mengambil balik pemberiannya kecuali seorang bapa (yang mengambil balik pemberiannya) daripada anaknya.  Orang yang mengambil balik pemberiannya adalah seperti orang yang kembali kepada muntahnya.\""
  },
  {
    "id": 18434,
    "hadith_number": 3698,
    "tajuk_hadith": "Larangan Membatalkan Kurniaan",
    "perawi_melayu": "Daripada Ibnu Umar dan Ibnu Abbas, yang meriwayatkan hadis ini daripada Nabi SAW:",
    "english_text": "\"It is not permissible for a man to give a gift and then take it back except a father taking back what he gave to his son. The likeness of the one who gives a gift then takes it back is that of the dog which eats until it is full, then it vomits, and goes back to its vomit.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ حُسَيْنٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، قَالَ حَدَّثَنِي طَاوُسٌ، عَنِ ابْنِ عُمَرَ، وَابْنِ، عَبَّاسٍ يَرْفَعَانِ الْحَدِيثَ إِلَى النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَحِلُّ لِرَجُلٍ يُعْطِي عَطِيَّةً ثُمَّ يَرْجِعُ فِيهَا إِلاَّ الْوَالِدَ فِيمَا يُعْطِي وَلَدَهُ وَمَثَلُ الَّذِي يُعْطِي عَطِيَّةً ثُمَّ يَرْجِعُ فِيهَا كَمَثَلِ الْكَلْبِ أَكَلَ حَتَّى إِذَا شَبِعَ قَاءَ ثُمَّ عَادَ فِي قَيْئِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Tidak halal bagi seseorang lelaki memberi hadiah kemudian mengambilnya kembali, kecuali seorang bapa yang mengambil kembali apa yang telah diberikannya kepada anaknya.  Perumpamaan orang yang memberi hadiah kemudian mengambilnya kembali adalah seperti seekor anjing yang makan sehingga kenyang, kemudian ia muntah, dan kembali memakan muntahannya."
  },
  {
    "id": 18435,
    "hadith_number": 3699,
    "tajuk_hadith": "Menarik Balik Hadiah",
    "perawi_melayu": "Daripada Ibnu Abbas r.a.",
    "english_text": "\"The Messenger of Allah said: 'The one who takes back his gift is like the dog which vomits then goes back to its vomit.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْخَلَنْجِيُّ الْمَقْدِسِيُّ، قَالَ حَدَّثَنَا أَبُو سَعِيدٍ، - وَهُوَ مَوْلَى بَنِي هَاشِمٍ - عَنْ وُهَيْبٍ، قَالَ حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْعَائِدُ فِي هِبَتِهِ كَالْكَلْبِ يَقِيءُ ثُمَّ يَعُودُ فِي قَيْئِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Orang yang menarik balik pemberiannya adalah seperti anjing yang muntah kemudian memakan semula muntahnya.\""
  },
  {
    "id": 18436,
    "hadith_number": 3700,
    "tajuk_hadith": "Larangan Membatalkan Pemberian Kurniaan",
    "perawi_melayu": "Daripada Tawus, katanya:",
    "english_text": "\"The Messenger of Allah said: 'It is not permissible for anyone to give a gift then take it back, except from one's son.'\" Tawus said: \"When I was young I used to hear (the phrase), 'The one who goes back to his vomit,' but we did not realize that this was a similitude.\" He said: \"The likeness of the one who does that is that of a dog which eats then vomits, then goes back to its vomit.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ، قَالَ حَدَّثَنَا حِبَّانُ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ إِبْرَاهِيمَ بْنِ نَافِعٍ، عَنِ الْحَسَنِ بْنِ مُسْلِمٍ، عَنْ طَاوُسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ يَحِلُّ لأَحَدٍ أَنْ يَهَبَ هِبَةً ثُمَّ يَرْجِعَ فِيهَا إِلاَّ مِنْ وَلَدِهِ ‏\"‏ ‏.‏ قَالَ طَاوُسٌ كُنْتُ أَسْمَعُ وَأَنَا صَغِيرٌ عَائِدٌ فِي قَيْئِهِ فَلَمْ نَدْرِ أَنَّهُ ضَرَبَ لَهُ مَثَلاً قَالَ ‏\"‏ فَمَنْ فَعَلَ ذَلِكَ فَمَثَلُهُ كَمَثَلِ الْكَلْبِ يَأْكُلُ ثُمَّ يَقِيءُ ثُمَّ يَعُودُ فِي قَيْئِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Tidak halal bagi sesiapa pun untuk memberi kurniaan, kemudian mengambilnya kembali, kecuali daripada anaknya.\" Tawus berkata: \"Ketika aku masih kecil, aku selalu mendengar (ungkapan), ‘Orang yang kembali kepada muntahnya,’ tetapi kami tidak menyedari bahawa ia adalah sebuah perumpamaan.\" Beliau berkata: \"Perumpamaan orang yang berbuat demikian adalah seperti seekor anjing yang makan, kemudian muntah, kemudian kembali kepada muntahnya.\""
  },
  {
    "id": 18437,
    "hadith_number": 3701,
    "tajuk_hadith": "Perumpamaan Orang yang Membatalkan Sedekahnya",
    "perawi_melayu": "Abdullah bin Abbas berkata:",
    "english_text": "\"The Messenger of Allah said: 'The likeness of the one who takes back his gift, is that of a dog which goes back to its vomit and eats it.'\"",
    "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا عُمَرُ، عَنِ الأَوْزَاعِيِّ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ عَلِيِّ بْنِ حُسَيْنٍ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَثَلُ الَّذِي يَرْجِعُ فِي صَدَقَتِهِ كَمَثَلِ الْكَلْبِ يَرْجِعُ فِي قَيْئِهِ فَيَأْكُلُهُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Perumpamaan orang yang menarik balik pemberiannya adalah seperti anjing yang kembali kepada muntahnya lalu memakannya.\""
  },
  {
    "id": 18438,
    "hadith_number": 3702,
    "tajuk_hadith": "Perumpamaan Orang Yang Menarik Balik Sedekah",
    "perawi_melayu": "Daripada Ibnu Abbas bahawa Nabi SAW bersabda:",
    "english_text": "\"The likeness of the one who gives a gift then takes it back, is that of a dog which vomits, then goes back to its vomit and eats it.\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَبْدُ الصَّمَدِ، قَالَ حَدَّثَنَا حَرْبٌ، - وَهُوَ ابْنُ شَدَّادٍ - قَالَ حَدَّثَنِي يَحْيَى، - هُوَ ابْنُ أَبِي كَثِيرٍ - قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ عَمْرٍو، - وَهُوَ الأَوْزَاعِيُّ - أَنَّ مُحَمَّدَ بْنَ عَلِيِّ بْنِ حُسَيْنِ بْنِ فَاطِمَةَ بِنْتِ رَسُولِ اللَّهِ، صلى الله عليه وسلم حَدَّثَهُ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَثَلُ الَّذِي يَتَصَدَّقُ بِالصَّدَقَةِ ثُمَّ يَرْجِعُ فِيهَا كَمَثَلِ الْكَلْبِ قَاءَ ثُمَّ عَادَ فِي قَيْئِهِ فَأَكَلَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Perumpamaan orang yang memberi sedekah kemudian menariknya kembali adalah seperti anjing yang muntah, kemudian kembali kepada muntahannya lalu memakannya."
  },
  {
    "id": 18439,
    "hadith_number": 3703,
    "tajuk_hadith": "Perumpamaan Orang Yang Membatalkan Sedekah",
    "perawi_melayu": "Daripada Abdullah bin Abbas bahawa Rasulullah SAW bersabda:",
    "english_text": "\"The likeness of the one who takes back his gift is that of a dog which vomits, then goes back to its vomit.\" (One of the narrators) Al-Awza'i said: \"I heard him narrating this Hadith to 'Ata bin Abi Rabah.\"",
    "arabic_text": "أَخْبَرَنَا الْهَيْثَمُ بْنُ مَرْوَانَ بْنِ الْهَيْثَمِ بْنِ عِمْرَانَ، قَالَ حَدَّثَنَا مُحَمَّدٌ، - وَهُوَ ابْنُ بَكَّارِ بْنِ بِلاَلٍ - قَالَ حَدَّثَنَا يَحْيَى، عَنِ الأَوْزَاعِيِّ، أَنَّ مُحَمَّدَ بْنَ عَلِيِّ بْنِ الْحُسَيْنِ، حَدَّثَهُ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَثَلُ الَّذِي يَرْجِعُ فِي صَدَقَتِهِ كَمَثَلِ الْكَلْبِ يَقِيءُ ثُمَّ يَعُودُ فِي قَيْئِهِ ‏\"‏ ‏.‏ قَالَ الأَوْزَاعِيُّ سَمِعْتُهُ يُحَدِّثُ عَطَاءَ بْنَ أَبِي رَبَاحٍ بِهَذَا الْحَدِيثِ ‏.‏",
    "malay_translation": "Perumpamaan orang yang menarik balik sedekahnya adalah seperti anjing yang muntah, kemudian kembali memakan muntahannya.  Al-Awza’i berkata:  \"Saya mendengar beliau meriwayatkan hadis ini kepada Ata’ bin Abi Rabaah.\""
  },
  {
    "id": 18440,
    "hadith_number": 3704,
    "tajuk_hadith": "Menarik Balik Hadiah Seperti Memulangkan Muntah",
    "perawi_melayu": "Daripada Ibnu Abbas, bahawa Nabi SAW bersabda:",
    "english_text": "\"The one who takes back his gift is like the one who goes back to his vomit.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْعَائِدُ فِي هِبَتِهِ كَالْعَائِدِ فِي قَيْئِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Orang yang menarik balik pemberiannya adalah seperti orang yang memakan kembali muntahnya."
  },
  {
    "id": 18441,
    "hadith_number": 3705,
    "tajuk_hadith": "Menarik Balik Hadiah",
    "perawi_melayu": "Daripada Ibnu Abbas r.a.",
    "english_text": "\"The one who takes back his gift is like the one who goes back to his vomit.\"",
    "arabic_text": "أَخْبَرَنَا أَبُو الأَشْعَثِ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْعَائِدُ فِي هِبَتِهِ كَالْعَائِدِ فِي قَيْئِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Orang yang menarik balik pemberiannya adalah seperti orang yang memakan semula muntahnya.\""
  },
  {
    "id": 18442,
    "hadith_number": 3706,
    "tajuk_hadith": "Menarik Balik Hiba Seperti Memulangkan Muntah",
    "perawi_melayu": "Daripada Ibnu Abbas r.a.",
    "english_text": "\"The Messenger of Allah said: 'It does not befit us to leave bad examples. The one who takes back his gift is like the one who goes back to his vomit.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا أَبُو خَالِدٍ، - وَهُوَ سُلَيْمَانُ بْنُ حَيَّانَ - عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَيْسَ لَنَا مَثَلُ السَّوْءِ الْعَائِدُ فِي هِبَتِهِ كَالْعَائِدِ فِي قَيْئِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Tidak sepatutnya kita mengambil contoh yang buruk.  Orang yang menarik balik pemberiannya adalah seperti orang yang memakan semula muntahnya.\""
  },
  {
    "id": 18443,
    "hadith_number": 3707,
    "tajuk_hadith": "Menarik Balik Hediyah Seperti Anjing Menjilat Muntahnya",
    "perawi_melayu": "Daripada Ibnu Abbas r.a.",
    "english_text": "\"The Messenger of Allah said: 'It does not befit us to leave bad examples. The one who takes back his gift is like the dog which goes back to its vomit.'\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَيْسَ لَنَا مَثَلُ السَّوْءِ الْعَائِدُ فِي هِبَتِهِ كَالْكَلْبِ يَعُودُ فِي قَيْئِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Tidak sepatutnya kita mencontohi perbuatan buruk.  Orang yang menarik balik pemberiannya adalah seperti anjing yang kembali kepada muntahnya.\""
  },
  {
    "id": 18444,
    "hadith_number": 3708,
    "tajuk_hadith": "Menarik Balik Hiba",
    "perawi_melayu": "Daripada Ibnu Abbas r.a.",
    "english_text": "\"The Messenger of Allah said: 'It does not befit us to leave bad examples. The one who takes back his gift is like a dog with its vomit.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ نُعَيْمٍ، قَالَ حَدَّثَنَا حِبَّانُ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ خَالِدٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَيْسَ لَنَا مَثَلُ السَّوْءِ الرَّاجِعُ فِي هِبَتِهِ كَالْكَلْبِ فِي قَيْئِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Tidak elok bagi kita meninggalkan contoh yang buruk.  Orang yang menarik balik pemberiannya adalah seperti anjing yang memakan kembali muntahnya.\""
  },
  {
    "id": 18445,
    "hadith_number": 3709,
    "tajuk_hadith": "Menarik Balik Kurniaan",
    "perawi_melayu": "Daripada Abdullah bin Tawus, daripada bapanya, daripada Ibnu Abbas, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"The one who takes back his gift, is like the dog which vomits then goes back to its vomit.\"",
    "arabic_text": "أَخْبَرَنِي زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا إِسْحَاقُ، قَالَ حَدَّثَنَا الْمَخْزُومِيُّ، قَالَ حَدَّثَنَا وُهَيْبٌ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْعَائِدُ فِي هِبَتِهِ كَالْكَلْبِ يَقِيءُ ثُمَّ يَعُودُ فِي قَيْئِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Orang yang menarik balik pemberiannya adalah seperti anjing yang muntah kemudian kembali memakan muntahnya."
  },
  {
    "id": 18446,
    "hadith_number": 3710,
    "tajuk_hadith": "Menarik Balik Hediah Seperti Menelan Muntah Balik",
    "perawi_melayu": "Daripada Abu Az-Zubair, daripada Tawus, bahawa Ibn 'Abbas berkata:",
    "english_text": "\"The Messenger of Allah said: 'The one who takes back his gift, is like the one who goes back to his vomit.'\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ حَجَّاجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْعَائِدُ فِي هِبَتِهِ كَالْعَائِدِ فِي قَيْئِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Orang yang menarik balik pemberiannya adalah seperti orang yang memakan semula muntahnya.\""
  },
  {
    "id": 18447,
    "hadith_number": 3711,
    "tajuk_hadith": "Larangan Mengembalikan Hadiah",
    "perawi_melayu": "Daripada 'Amr bin Shu'aib, daripada Tawus, daripada Ibn 'Umar dan Ibn 'Abbas, mereka berkata:",
    "english_text": "\"The Messenger of Allah said: 'It is not permissible for anyone to give a gift then take it back, except a father with regard to what he gives to his son. The likeness of the one who gives a gift then takes it back, is that of the dog which eats then when it is full it vomits, then it goes back to its vomit.'\"",
    "arabic_text": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلاَّمٍ، قَالَ حَدَّثَنَا إِسْحَاقُ الأَزْرَقُ، قَالَ حَدَّثَنَا بِهِ، حُسَيْنٌ الْمُعَلِّمُ عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عُمَرَ، وَابْنِ، عَبَّاسٍ قَالاَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَحِلُّ لأَحَدٍ أَنْ يُعْطِيَ الْعَطِيَّةَ فَيَرْجِعَ فِيهَا إِلاَّ الْوَالِدَ فِيمَا يُعْطِي وَلَدَهُ وَمَثَلُ الَّذِي يُعْطِي الْعَطِيَّةَ فَيَرْجِعُ فِيهَا كَالْكَلْبِ يَأْكُلُ حَتَّى إِذَا شَبِعَ قَاءَ ثُمَّ عَادَ فَرَجَعَ فِي قَيْئِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Tidak halal bagi sesiapa pun untuk memberi hadiah kemudian mengambilnya kembali, kecuali seorang bapa terhadap apa yang diberikannya kepada anaknya.  Perumpamaan orang yang memberi hadiah kemudian mengambilnya kembali adalah seperti anjing yang makan sehingga kenyang, kemudian ia muntah, lalu ia kembali memakan muntahnya.\""
  },
  {
    "id": 18448,
    "hadith_number": 3712,
    "tajuk_hadith": "Larangan Membatalkan Pemberian",
    "perawi_melayu": "Daripada Ibnu Juraij, daripada Al-Hasan bin Muslim, daripada Tawus bahawa Rasulullah SAW telah bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ الْحَمِيدِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا مَخْلَدٌ، قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنِ الْحَسَنِ بْنِ مُسْلِمٍ، عَنْ طَاوُسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَحِلُّ لأَحَدٍ يَهَبُ هِبَةً ثُمَّ يَعُودُ فِيهَا إِلاَّ الْوَالِدَ ‏\"‏ ‏.‏ قَالَ طَاوُسٌ كُنْتُ أَسْمَعُ الصِّبْيَانَ يَقُولُونَ يَا عَائِدًا فِي قَيْئِهِ وَلَمْ أَشْعُرْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ضَرَبَ ذَلِكَ مَثَلاً حَتَّى بَلَغَنَا أَنَّهُ كَانَ يَقُولُ ‏\"‏ مَثَلُ الَّذِي يَهَبُ الْهِبَةَ ثُمَّ يَعُودُ فِيهَا ‏\"‏ ‏.‏ وَذَكَرَ كَلِمَةً مَعْنَاهَا ‏\"‏ كَمَثَلِ الْكَلْبِ يَأْكُلُ قَيْئَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abd al-Hamid bin Muhammad, katanya: Telah menceritakan kepada kami Makhalad, katanya: Telah menceritakan kepada kami Ibnu Juraij, daripada al-Hasan bin Muslim, daripada Tawus, bahawa Rasulullah SAW bersabda:  \"Tidak halal bagi sesiapa pun memberi hadiah kemudian menariknya balik kecuali bapa.\" Tawus berkata: \"Aku selalu mendengar kanak-kanak berkata: 'Wahai orang yang kembali kepada muntahnya!' Dan aku tidak menyedari bahawa Rasulullah SAW menggunakan perumpamaan itu sehingga sampai kepada kami bahawa baginda selalu berkata: 'Perumpamaan orang yang memberi hadiah kemudian menariknya balik adalah seperti anjing yang memakan muntahnya.'\""
  },
  {
    "id": 18449,
    "hadith_number": 3713,
    "tajuk_hadith": "Perumpamaan Orang Yang Membatalkan Pemberiannya",
    "perawi_melayu": "Daripada Hanzalah, bahawa dia mendengar Tawus berkata:",
    "english_text": "\"Some of those who met the Prophet told us that he said: 'The likeness of the one who gives (something), then takes back his gift, is that of a dog which eats, then vomits, then eats its vomit.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ نُعَيْمٍ، قَالَ حَدَّثَنَا حِبَّانُ، أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ حَنْظَلَةَ، أَنَّهُ سَمِعَ طَاوُسًا، يَقُولُ أَخْبَرَنَا بَعْضُ، مَنْ أَدْرَكَ النَّبِيَّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ مَثَلُ الَّذِي يَهَبُ فَيَرْجِعُ فِي هِبَتِهِ كَمَثَلِ الْكَلْبِ يَأْكُلُ فَيَقِيءُ ثُمَّ يَأْكُلُ قَيْئَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Sebahagian daripada mereka yang bertemu Nabi ﷺ telah memberitahu kami bahawa baginda bersabda:  \"Perumpamaan orang yang memberi kemudian menarik balik pemberiannya adalah seperti anjing yang makan, kemudian muntah, kemudian makan semula muntahnya.\""
  }
]
