[
  {
    "id": 18355,
    "hadith_number": 3619,
    "tajuk_hadith": "Sedekah Ketika Sihat dan Bakhil",
    "perawi_melayu": "Daripada Abu Hurairah r.a.",
    "english_text": "\"A man came to the Prophet and said: 'O Messenger of Allah, what kind of charity brings the greatest reward?' He said: 'To give in charity when you are healthy and feeling miserly, and fearing poverty and hoping for a long life. Do not wait until the (death rattle) reaches the throat and then say: \"This is for so and so,\" and it nearly became the property of so and so (the heirs).'\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ عُمَارَةَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَىُّ الصَّدَقَةِ أَعْظَمُ أَجْرًا قَالَ ‏\n\"‏ أَنْ تَصَدَّقَ وَأَنْتَ صَحِيحٌ شَحِيحٌ تَخْشَى الْفَقْرَ وَتَأْمُلُ الْبَقَاءَ وَلاَ تُمْهِلْ حَتَّى إِذَا بَلَغَتِ الْحُلْقُومَ قُلْتَ لِفُلاَنٍ كَذَا وَقَدْ كَانَ لِفُلاَنٍ ‏\"‏‏.‏",
    "malay_translation": "Seorang lelaki datang kepada Nabi SAW dan bertanya, \"Wahai Rasulullah, sedekah yang manakah yang paling besar pahalanya?\" Baginda menjawab, \"Memberi sedekah ketika engkau sihat, bakhil, takut miskin dan mengharapkan kehidupan yang panjang. Janganlah engkau menangguh sehingga ajal sampai ke kerongkong, barulah engkau berkata, 'Ini untuk si fulan,' sedangkan harta itu hampir menjadi milik si fulan (waris).\""
  },
  {
    "id": 18356,
    "hadith_number": 3620,
    "tajuk_hadith": "Kekayaan Pewaris Lebih Dicintai daripada Kekayaan Sendiri",
    "perawi_melayu": "Daripada Abdullah ra.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، عَنْ أَبِي مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنِ الْحَارِثِ بْنِ سُوَيْدٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَيُّكُمْ مَالُ وَارِثِهِ أَحَبُّ إِلَيْهِ مِنْ مَالِهِ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ مَا مِنَّا مِنْ أَحَدٍ إِلاَّ مَالُهُ أَحَبُّ إِلَيْهِ مِنْ مَالِ وَارِثِهِ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اعْلَمُوا أَنَّهُ لَيْسَ مِنْكُمْ مِنْ أَحَدٍ إِلاَّ مَالُ وَارِثِهِ أَحَبُّ إِلَيْهِ مِنْ مَالِهِ مَالُكَ مَا قَدَّمْتَ وَمَالُ وَارِثِكَ مَا أَخَّرْتَ ‏\"‏‏.‏",
    "malay_translation": "Daripada Hannad bin Sari', daripada Abu Muawiyah, daripada al-A'mash, daripada Ibrahim al-Taymi, daripada al-Harits bin Suwaid, daripada Abdullah r.a., bahawa Rasulullah SAW bersabda: \"Siapakah di antara kamu yang menganggap harta pusaka warisnya lebih disayangi daripada hartanya sendiri?\" Mereka menjawab: \"Wahai Rasulullah, tiada seorang pun di antara kami melainkan hartanya sendiri lebih disayangi daripada harta pusaka warisnya.\" Rasulullah SAW bersabda: \"Ketahuilah, sesungguhnya tiada seorang pun di antara kamu melainkan harta pusaka warisnya lebih disayangi daripada hartanya sendiri. Harta kamu ialah apa yang telah kamu sedekahkan, dan harta pusaka waris kamu ialah apa yang telah kamu tinggalkan.\""
  },
  {
    "id": 18357,
    "hadith_number": 3621,
    "tajuk_hadith": "Persaingan Duniawi dan Kekayaan Sebenar",
    "perawi_melayu": "Dari Mutarrif, daripada bapanya, bahawa Nabi SAW bersabda:",
    "english_text": "\"The mutual rivalry (for piling up of worldly things) diverts you, 'Until you visit the graves (i.e. till you die).' The son of Adam says: 'My wealth, my wealth,' but your wealth is what you eat and consume, or what you wear and it wears out, or what you give in charity and send on ahead (for the Hereafter).'\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ مُطَرِّفٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ ‏{‏أَلْهَاكُمُ التَّكَاثُرُ * حَتَّى زُرْتُمُ الْمَقَابِرَ‏}‏ قَالَ يَقُولُ ابْنُ آدَمَ مَالِي مَالِي وَإِنَّمَا مَالُكَ مَا أَكَلْتَ فَأَفْنَيْتَ أَوْ لَبِسْتَ فَأَبْلَيْتَ أَوْ تَصَدَّقْتَ فَأَمْضَيْتَ ‏\"‏‏.‏",
    "malay_translation": "Persaingan dalam mengumpul harta dunia telah melalaikan kamu sehingga kamu mengunjungi kubur (iaitu sehingga kamu mati).  Anak Adam berkata: 'Hartaku, hartaku,' tetapi harta kamu hanyalah apa yang kamu makan dan habiskan, atau apa yang kamu pakai sehingga ia usang, atau apa yang kamu sedekahkan dan kirim ke hadapan (untuk akhirat)."
  },
  {
    "id": 18358,
    "hadith_number": 3622,
    "tajuk_hadith": "Sedekah Ketika Mati",
    "perawi_melayu": "Abu Habibah At-Ta'i berkata:",
    "english_text": "\"A man made a will leaving some Dinars (to be spent) in the cause of Allah. Abu Ad-Darda' was asked about that, and he narrated that the Prophet said: 'The likeness of the one who frees a slave or gives some charity when he is dying, is that of a man who gives a gift after he has eaten his fill.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ أَبَا إِسْحَاقَ، سَمِعَ أَبَا حَبِيبَةَ الطَّائِيَّ، قَالَ أَوْصَى رَجُلٌ بِدَنَانِيرَ فِي سَبِيلِ اللَّهِ فَسُئِلَ أَبُو الدَّرْدَاءِ فَحَدَّثَ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَثَلُ الَّذِي يَعْتِقُ أَوْ يَتَصَدَّقُ عِنْدَ مَوْتِهِ مَثَلُ الَّذِي يُهْدِي بَعْدَ مَا يَشْبَعُ ‏\"‏‏.‏",
    "malay_translation": "Seorang lelaki membuat wasiat meninggalkan beberapa dinar untuk dibelanjakan di jalan Allah. Abu Darda' ditanya mengenai hal itu, dan beliau meriwayatkan bahawa Nabi SAW bersabda:  \"Perumpamaan orang yang memerdekakan hamba atau bersedekah ketika hendak mati adalah seperti orang yang memberi hadiah setelah kenyang.\""
  },
  {
    "id": 18359,
    "hadith_number": 3623,
    "tajuk_hadith": "Kewajipan Membuat Wasiat",
    "perawi_melayu": "Daripada Ibnu Umar, katanya:",
    "english_text": "\"The Messenger of Allah said: 'It is not befitting for a Muslim who has anything concerning which a will should be made, to abide for two nights without having a written will with him.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا الْفُضَيْلُ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا حَقُّ امْرِئٍ مُسْلِمٍ لَهُ شَىْءٌ يُوصَى فِيهِ أَنْ يَبِيتَ لَيْلَتَيْنِ إِلاَّ وَوَصِيَّتُهُ مَكْتُوبَةٌ عِنْدَهُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Tidak sepatutnya bagi seorang Muslim yang mempunyai sesuatu yang boleh diwasiatkan untuk bermalam dua malam tanpa wasiatnya ditulis di sisi (dibuat secara bertulis).\""
  },
  {
    "id": 18360,
    "hadith_number": 3624,
    "tajuk_hadith": "Wasiat Tertulis Bagi Muslim",
    "perawi_melayu": "Daripada Ibnu Umar bahawa Rasulullah SAW bersabda:",
    "english_text": "\"It is not befitting for a Muslim who has anything concerning which a will should be made, to abide for two nights without having a written will with him.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنَا ابْنُ الْقَاسِمِ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا حَقُّ امْرِئٍ مُسْلِمٍ لَهُ شَىْءٌ يُوصَى فِيهِ يَبِيتُ لَيْلَتَيْنِ إِلاَّ وَوَصِيَّتُهُ مَكْتُوبَةٌ عِنْدَهُ ‏\"‏‏.‏",
    "malay_translation": "Tidak sepatutnya bagi seorang Muslim yang mempunyai harta benda yang memerlukan wasiat untuk bermalam selama dua malam tanpa wasiatnya tertulis bersamanya."
  },
  {
    "id": 18361,
    "hadith_number": 3625,
    "tajuk_hadith": "Sanad Hadis daripada Ibnu Umar",
    "perawi_melayu": "Muhammad bin Hatim bin Nu'aim meriwayatkan daripada Hibban, yang meriwayatkan daripada Abdullah, daripada Ibnu Awn, daripada Nafi', daripada Ibnu Umar.",
    "english_text": "(The same) was narrated from Ibn 'Awn, from Nafi', from Ibn 'Umar.",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ نُعَيْمٍ، قَالَ حَدَّثَنَا حِبَّانُ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنِ ابْنِ عَوْنٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَوْلَهُ‏.‏",
    "malay_translation": "Muhammad bin Hatim bin Nu'aim meriwayatkan daripada Hibban, yang meriwayatkan daripada Abdullah, daripada Ibnu Awn, daripada Nafi', daripada Ibnu Umar."
  },
  {
    "id": 18362,
    "hadith_number": 3626,
    "tajuk_hadith": "Kewajipan Membuat Wasiat",
    "perawi_melayu": "Daripada Abdullah bin Umar bahawa Nabi SAW telah bersabda:",
    "english_text": "\"It is not befitting for a Muslim to abide for three nights without having his will with him.\" 'Abdullah bin 'Umar said: \"Since I heard this from the Messenger of Allah, I have always had my will with me.\"",
    "arabic_text": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ فَإِنَّ سَالِمًا أَخْبَرَنِي عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا حَقُّ امْرِئٍ مُسْلِمٍ تَمُرُّ عَلَيْهِ ثَلاَثُ لَيَالٍ إِلاَّ وَعِنْدَهُ وَصِيَّتُهُ ‏\"‏‏.‏ قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ مَا مَرَّتْ عَلَىَّ مُنْذُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ذَلِكَ إِلاَّ وَعِنْدِي وَصِيَّتِي‏.‏",
    "malay_translation": "Tidak sepatutnya bagi seorang Muslim berlalu tiga malam melainkan dengan wasiatnya. Abdullah bin Umar berkata: Sejak aku mendengarnya daripada Rasulullah SAW, aku sentiasa mempunyai wasiatku."
  },
  {
    "id": 18363,
    "hadith_number": 3627,
    "tajuk_hadith": "Wasiat Tertulis Bagi Muslim",
    "perawi_melayu": "Dari Salim bin Abdullah, daripada bapanya, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"It is not right for a Muslim who has anything concerning which a will should be made, to abide for more than three nights without having a written will with him.\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ يَحْيَى بْنِ الْوَزِيرِ بْنِ سُلَيْمَانَ، قَالَ سَمِعْتُ ابْنَ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، وَعَمْرُو بْنُ الْحَارِثِ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا حَقُّ امْرِئٍ مُسْلِمٍ لَهُ شَىْءٌ يُوصَى فِيهِ فَيَبِيتُ ثَلاَثَ لَيَالٍ إِلاَّ وَوَصِيَّتُهُ عِنْدَهُ مَكْتُوبَةٌ ‏\"‏‏.‏",
    "malay_translation": "Tidaklah wajar bagi seorang Muslim yang mempunyai sesuatu yang perlu diwasiatkan, untuk bermalam lebih daripada tiga malam tanpa wasiatnya tertulis di sisinya."
  },
  {
    "id": 18364,
    "hadith_number": 3628,
    "tajuk_hadith": "Wasiat Rasulullah SAW: Mengikuti Kitabullah",
    "perawi_melayu": "Talhah berkata:",
    "english_text": "\"I asked Ibn Abi Awfa: 'Did the Messenger of Allah leave a will?' He said: 'No.' I said: 'How come it is prescribed for the Muslims to make wills?' He said: 'He left instructions urging the Muslims to adhere to the Book of Allah.'\"",
    "arabic_text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ، قَالَ حَدَّثَنَا طَلْحَةُ، قَالَ سَأَلْتُ ابْنَ أَبِي أَوْفَى أَوْصَى رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ لاَ‏.‏ قُلْتُ كَيْفَ كَتَبَ عَلَى الْمُسْلِمِينَ الْوَصِيَّةَ قَالَ أَوْصَى بِكِتَابِ اللَّهِ‏.‏",
    "malay_translation": "Aku bertanya kepada Ibnu Abi Auf, “Adakah Rasulullah SAW meninggalkan wasiat?” Jawabnya, “Tidak.” Aku berkata, “Bagaimana pula ia diwajibkan ke atas umat Islam untuk membuat wasiat?” Jawabnya, “Baginda meninggalkan pesanan agar umat Islam berpegang teguh kepada Kitabullah (Al-Quran).”"
  },
  {
    "id": 18365,
    "hadith_number": 3629,
    "tajuk_hadith": "Kekayaan Rasulullah SAW",
    "perawi_melayu": "Daripada Aisyah r.a.",
    "english_text": "\"The Messenger of Allah did not leave behind a Dinar or a Dirham, or a sheep or a camel, and he did not leave any will.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، قَالَ حَدَّثَنَا مُفَضَّلٌ، عَنِ الأَعْمَشِ، وَأَنْبَأَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، وَأَحْمَدُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ مَا تَرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم دِينَارًا وَلاَ دِرْهَمًا وَلاَ شَاةً وَلاَ بَعِيرًا وَلاَ أَوْصَى بِشَىْءٍ‏.‏",
    "malay_translation": "Aisyah r.a. berkata:  Rasulullah SAW tidak meninggalkan sebarang dinar mahupun dirham, atau kambing biri-biri mahupun unta, dan baginda tidak meninggalkan wasiat."
  },
  {
    "id": 18366,
    "hadith_number": 3630,
    "tajuk_hadith": "Pewarisan Rasulullah SAW",
    "perawi_melayu": "Daripada Aisyah r.a.",
    "english_text": "\"The Messenger of Allah did not leave behind a Dirham or a Dinar, or a sheep or a camel, and he did not leave any will.\"",
    "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا مُصْعَبٌ، حَدَّثَنَا دَاوُدُ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ مَا تَرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم دِرْهَمًا وَلاَ دِينَارًا وَلاَ شَاةً وَلاَ بَعِيرًا وَمَا أَوْصَى‏.‏",
    "malay_translation": "Aisyah r.a. berkata: Rasulullah SAW tidak meninggalkan sebarang dirham mahupun dinar, kambing mahupun unta, dan baginda tidak meninggalkan wasiat."
  },
  {
    "id": 18367,
    "hadith_number": 3631,
    "tajuk_hadith": "Pewarisan Rasulullah SAW",
    "perawi_melayu": "Daripada Aisyah r.a.",
    "english_text": "\"The Messenger of Allah did not leave behind a Dirham or a Dinar, or a sheep or a camel, and he did not leave any will.\" Ja'far did not mention \"Dinar or Dirham.\"",
    "arabic_text": "أَخْبَرَنَا جَعْفَرُ بْنُ مُحَمَّدِ بْنِ الْهُذَيْلِ، وَأَحْمَدُ بْنُ يُوسُفَ، قَالاَ حَدَّثَنَا عَاصِمُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا حَسَنُ بْنُ عَيَّاشٍ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ مَا تَرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم دِرْهَمًا وَلاَ دِينَارًا وَلاَ شَاةً وَلاَ بَعِيرًا وَلاَ أَوْصَى‏.‏ لَمْ يَذْكُرْ جَعْفَرٌ دِينَارًا وَلاَ دِرْهَمًا‏.‏",
    "malay_translation": "Aisyah r.a. berkata: Rasulullah SAW tidak meninggalkan sebarang dirham, dinar, kambing biri-biri, unta mahupun wasiat.  Ja’far tidak menyebut tentang dinar dan dirham."
  },
  {
    "id": 18368,
    "hadith_number": 3632,
    "tajuk_hadith": "Wasiat Rasulullah SAW dan Kemangkatan Baginda",
    "perawi_melayu": "Daripada Aisyah r.a.",
    "english_text": "\"They say that the Messenger of Allah made a will concerning 'Ali, may Allah be pleased with him. But he called for a vessel in which to urinate, then he went limp without me realizing it. So to whom did he leave a will?\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا أَزْهَرُ، قَالَ أَنْبَأَنَا ابْنُ عَوْنٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ يَقُولُونَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَوْصَى إِلَى عَلِيٍّ رضى الله عنه لَقَدْ دَعَا بِالطَّسْتِ لِيَبُولَ فِيهَا فَانْخَنَثَتْ نَفْسُهُ صلى الله عليه وسلم وَمَا أَشْعُرُ فَإِلَى مَنْ أَوْصَى",
    "malay_translation": "Mereka berkata bahawa Rasulullah SAW telah berwasiat kepada Ali r.a.  Baginda telah memanggil bekas untuk membuang air kecil, kemudian baginda jatuh sakit secara tiba-tiba tanpa aku sedar. Jadi, kepada siapakah baginda berwasiat?"
  },
  {
    "id": 18369,
    "hadith_number": 3633,
    "tajuk_hadith": "Kemangkatan Rasulullah SAW",
    "perawi_melayu": "Daripada Aisyah r.a.",
    "english_text": "\"The Messenger of Allah died when no one was with him except me.\" She said: \"And he called for a vessel.\"",
    "arabic_text": "أَخْبَرَنِي أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا عَارِمٌ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنِ ابْنِ عَوْنٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَلَيْسَ عِنْدَهُ أَحَدٌ غَيْرِي - قَالَتْ - وَدَعَا بِالطَّسْتِ‏.‏",
    "malay_translation": "Aisyah r.a. berkata: \"Rasulullah SAW wafat dan tidak ada seorang pun bersamanya kecuali saya.\" Beliau berkata lagi: \"Baginda memanggil sebuah bekas.\""
  },
  {
    "id": 18370,
    "hadith_number": 3634,
    "tajuk_hadith": "Mewariskan Harta: Satu Pertiga Sebagai Sedekah",
    "perawi_melayu": "Daripada Amir bin Sa'd bahawa bapanya berkata:",
    "english_text": "\"I became ill with a sickness from which I later recovered. The Messenger of Allah came to visit me, and I said: 'O Messenger of Allah, I have a great deal of wealth and I have no heir except my daughter. Shall I give two-thirds of my wealth in charity?' He said: 'No.' I said: 'Half?' He said: 'No.' I said: 'One-third?' He said: '(Give) one-third, and one-third is a lot. It is better to leave your heirs independent of means, than to leave them poor and holding out their hands to people.'\"",
    "arabic_text": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، قَالَ مَرِضْتُ مَرَضًا أَشْفَيْتُ مِنْهُ فَأَتَانِي رَسُولُ اللَّهِ صلى الله عليه وسلم يَعُودُنِي فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ لِي مَالاً كَثِيرًا وَلَيْسَ يَرِثُنِي إِلاَّ ابْنَتِي أَفَأَتَصَدَّقُ بِثُلُثَىْ مَالِي قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ فَالشَّطْرَ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ فَالثُّلُثَ قَالَ ‏\"‏ الثُّلُثَ وَالثُّلُثُ كَثِيرٌ إِنَّكَ أَنْ تَتْرُكَ وَرَثَتَكَ أَغْنِيَاءَ خَيْرٌ لَهُمْ مِنْ أَنْ تَتْرُكَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ ‏\"‏‏.‏",
    "malay_translation": "Aku telah jatuh sakit dan kemudiannya sembuh.  Rasulullah ﷺ datang melawatku, maka aku berkata: ‘Wahai Rasulullah, saya mempunyai harta yang banyak dan tiada waris kecuali anak perempuanku.  Bolehkan saya bersedekah dengan dua pertiga daripada harta saya?’ Baginda menjawab: ‘Tidak.’ Aku bertanya lagi: ‘Bagaimana separuh?’ Baginda menjawab: ‘Tidak.’ Aku bertanya lagi: ‘Bagaimana sepertiga?’ Baginda menjawab: ‘Sepertiga, dan sepertiga itu sudah banyak. Sesungguhnya, adalah lebih baik kamu meninggalkan warismu dalam keadaan berkemampuan daripada meninggalkan mereka dalam keadaan miskin dan meminta-minta kepada orang lain.’"
  },
  {
    "id": 18371,
    "hadith_number": 3635,
    "tajuk_hadith": "Pewarisan Harta: Satu Pertiga Adalah Cukup",
    "perawi_melayu": "Daripada Saad r.a.",
    "english_text": "\"The Prophet came to visit me when I was in Makkah. I said: 'O Messenger of Allah, shall I bequeath all my money?' He said: 'No.' I said: 'One-half?' He said: 'No.' I said: 'One-third?' He said: '(Bequeath) one-third, and one-third is a lot. If you leave your heirs independent of means, that is better than if you leave them poor and holding out their hands to people.'\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، وَأَحْمَدُ بْنُ سُلَيْمَانَ، - وَاللَّفْظُ لأَحْمَدَ - قَالاَ حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ سَعْدٍ، قَالَ جَاءَنِي النَّبِيُّ صلى الله عليه وسلم يَعُودُنِي وَأَنَا بِمَكَّةَ قُلْتُ يَا رَسُولَ اللَّهِ أُوصِي بِمَالِي كُلِّهِ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ فَالشَّطْرَ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ فَالثُّلُثَ قَالَ ‏\"‏ الثُّلُثَ وَالثُّلُثُ كَثِيرٌ إِنَّكَ أَنْ تَدَعَ وَرَثَتَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَدَعَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ يَتَكَفَّفُونَ فِي أَيْدِيهِمْ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW telah melawatku ketika aku berada di Mekah. Aku bertanya, \"Wahai Rasulullah, bolehkah saya mewakafkan semua harta saya?\" Baginda menjawab, \"Tidak.\" Aku bertanya lagi, \"Bagaimana separuh?\" Baginda menjawab, \"Tidak.\" Aku bertanya lagi, \"Bagaimana sepertiga?\" Baginda menjawab, \"Sepertiga, dan sepertiga itu sudah banyak. Sesungguhnya, lebih baik kamu meninggalkan waris-warismu dalam keadaan mampu daripada kamu meninggalkan mereka dalam keadaan miskin dan meminta-minta kepada orang lain.\""
  },
  {
    "id": 18372,
    "hadith_number": 3636,
    "tajuk_hadith": "Wasiat dan Kekayaan",
    "perawi_melayu": "Daripada Amir bin Saad daripada bapanya yang berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَعُودُهُ وَهُوَ بِمَكَّةَ وَهُوَ يَكْرَهُ أَنْ يَمُوتَ بِالأَرْضِ الَّتِي هَاجَرَ مِنْهَا قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ رَحِمَ اللَّهُ سَعْدَ ابْنَ عَفْرَاءَ أَوْ يَرْحَمُ اللَّهُ سَعْدَ ابْنَ عَفْرَاءَ ‏\"‏‏.‏ وَلَمْ يَكُنْ لَهُ إِلاَّ ابْنَةٌ وَاحِدَةٌ قَالَ يَا رَسُولَ اللَّهِ أُوصِي بِمَالِي كُلِّهِ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ النِّصْفَ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ فَالثُّلُثَ قَالَ ‏\"‏ الثُّلُثَ وَالثُّلُثُ كَثِيرٌ إِنَّكَ أَنْ تَدَعَ وَرَثَتَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَدَعَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ مَا فِي أَيْدِيهِمْ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Amru bin Ali, katanya: Telah menceritakan kepada kami Abdur Rahman, katanya: Telah menceritakan kepada kami Sufyan, daripada Saad bin Ibrahim, daripada Amir bin Saad, daripada bapanya, yang berkata: Nabi SAW biasa melawatnya ketika berada di Mekah. Beliau tidak mahu meninggal dunia di tanah yang telah beliau hijrah darinya. Nabi SAW bersabda: “Semoga Allah merahmati Saad bin ‘Afroh.”  Beliau hanya mempunyai seorang anak perempuan.  Beliau bertanya: “Wahai Rasulullah, bolehkah saya mewakafkan semua harta saya?” Baginda menjawab: “Tidak.” Saya bertanya: “Setengahnya?” Baginda menjawab: “Tidak.”  Saya bertanya: “Sepertiganya?” Baginda menjawab: “Sepertiganya. Sepertiga itu sudah banyak.  Sesungguhnya lebih baik kamu meninggalkan ahli warismu dalam keadaan kaya daripada meninggalkan mereka dalam keadaan miskin lalu mereka meminta-minta kepada manusia.”"
  },
  {
    "id": 18373,
    "hadith_number": 3637,
    "tajuk_hadith": "Wasiat Harta Sahabat",
    "perawi_melayu": "Seorang daripada keluarga Sa'd meriwayatkan:",
    "english_text": "\"Sa'd fell sick and the Messenger of Allah entered upon him and he said: 'O Messenger of Allah, shall I bequeath all my money?' He said: 'No.'\" And he quoted the same Hadith.",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا مِسْعَرٌ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنِي بَعْضُ، آلِ سَعْدٍ قَالَ مَرِضَ سَعْدٌ فَدَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أُوصِي بِمَالِي كُلِّهِ قَالَ ‏\n\"‏ لاَ ‏\"‏‏.‏ وَسَاقَ الْحَدِيثَ‏.‏",
    "malay_translation": "Kami diberitakan oleh Ahmad bin Sulaiman, katanya: Telah menceritakan kepada kami Abu Nu'aim, katanya: Telah menceritakan kepada kami Mis'ar, daripada Sa'd bin Ibrahim, katanya: Telah menceritakan kepadaku sebahagian daripada keluarga Sa'd, katanya: Sa'd jatuh sakit, lalu Rasulullah SAW masuk menziarahinya.  Sa'd berkata, \"Wahai Rasulullah, patutkah saya mewakafkan semua harta saya?\" Rasulullah SAW menjawab, \"Tidak.\" Dan dia meriwayatkan hadis yang sama."
  },
  {
    "id": 18374,
    "hadith_number": 3638,
    "tajuk_hadith": "Wasiat Harta dan Kematian di Tanah Hijrah",
    "perawi_melayu": "Amir bin Saad (bercerita) daripada bapanya bahawa beliau jatuh sakit di Mekah dan Rasulullah datang menziarahinya.  Apabila Saad melihat baginda, beliau menangis dan berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، قَالَ حَدَّثَنَا عَبْدُ الْكَبِيرِ بْنُ عَبْدِ الْمَجِيدِ، قَالَ حَدَّثَنَا بُكَيْرُ بْنُ مِسْمَارٍ، قَالَ سَمِعْتُ عَامِرَ بْنَ سَعْدٍ، عَنْ أَبِيهِ، أَنَّهُ اشْتَكَى بِمَكَّةَ فَجَاءَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمَّا رَآهُ سَعْدٌ بَكَى وَقَالَ يَا رَسُولَ اللَّهِ أَمُوتُ بِالأَرْضِ الَّتِي هَاجَرْتَ مِنْهَا قَالَ ‏\"‏ لاَ إِنْ شَاءَ اللَّهُ ‏\"‏‏.‏ وَقَالَ يَا رَسُولَ اللَّهِ أُوصِي بِمَالِي كُلِّهِ فِي سَبِيلِ اللَّهِ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قَالَ يَعْنِي بِثُلُثَيْهِ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قَالَ فَنِصْفَهُ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قَالَ فَثُلُثَهُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الثُّلُثَ وَالثُّلُثُ كَثِيرٌ إِنَّكَ أَنْ تَتْرُكَ بَنِيكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَتْرُكَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ ‏\"‏‏.‏",
    "malay_translation": "Saad bertanya, \"Wahai Rasulullah, adakah saya akan meninggal dunia di tanah yang saya berhijrah darinya?\" Baginda menjawab, \"Tidak, jika Allah SWT berkehendak.\" Saad bertanya lagi, \"Wahai Rasulullah, bolehkah saya mewakafkan semua harta saya di jalan Allah?\" Baginda menjawab, \"Tidak.\" Saad bertanya, \"Bagaimana dengan dua pertiga hartanya?\" Baginda menjawab, \"Tidak.\"  Saad bertanya lagi, \"Separuh hartanya?\" Baginda menjawab, \"Tidak.\"  Saad bertanya sekali lagi, \"Sepertiga hartanya?\" Rasulullah SAW menjawab, \"Sepertiga, dan sepertiga itu sudah banyak. Sesungguhnya, adalah lebih baik kamu meninggalkan anak-anakmu dalam keadaan kaya daripada meninggalkan mereka dalam keadaan miskin, meminta-minta kepada orang lain.\""
  },
  {
    "id": 18375,
    "hadith_number": 3639,
    "tajuk_hadith": "Wasiat Sahabat Saad bin Abi Waqqas",
    "perawi_melayu": "Daripada Saad bin Abi Waqqas r.a.",
    "english_text": "\"The Messenger of Allah visited me when I was sick, and said: 'Have you made a will?' I said: 'Yes.' He said: 'How much?' I said: 'For all my wealth to be given in the cause of Allah.' He said: 'What have you left for your children?' I said: 'They are rich (independent of means).' He said: 'Bequeath one-tenth.' And we kept discussing it until he said: 'Bequeath one-third, and one-third is much or large.'\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا جَرِيرٌ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، قَالَ عَادَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم فِي مَرَضِي فَقَالَ ‏\"‏ أَوْصَيْتَ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ بِكَمْ ‏\"‏‏.‏ قُلْتُ بِمَالِي كُلِّهِ فِي سَبِيلِ اللَّهِ‏.‏ قَالَ ‏\"‏ فَمَا تَرَكْتَ لِوَلدِكَ ‏\"‏‏.‏ قُلْتُ هُمْ أَغْنِيَاءُ‏.‏ قَالَ ‏\"‏ أَوْصِ بِالْعُشْرِ ‏\"‏‏.‏ فَمَا زَالَ يَقُولُ وَأَقُولُ حَتَّى قَالَ ‏\"‏ أَوْصِ بِالثُّلُثِ وَالثُّلُثُ كَثِيرٌ أَوْ كَبِيرٌ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW telah melawatku ketika aku sakit, lalu baginda bertanya, \"Adakah engkau telah membuat wasiat?\" Aku menjawab, \"Ya.\" Baginda bertanya lagi, \"Berapakah bahagiannya?\" Aku menjawab, \"Seluruh harta kekayaanku untuk disedekahkan di jalan Allah.\" Baginda bertanya, \"Apakah yang engkau tinggalkan untuk anak-anakmu?\" Aku menjawab, \"Mereka semua kaya.\" Baginda berkata, \"Wasiatkanlah seperserpuluh.\"  Kami terus berbincang sehingga baginda berkata, \"Wasiatkanlah sepertiga, dan sepertiga itu adalah banyak.\" "
  },
  {
    "id": 18376,
    "hadith_number": 3640,
    "tajuk_hadith": "Wasiat Ke Atas Harta",
    "perawi_melayu": "Daripada Saad r.a., bahawa Nabi SAW melawatnya ketika sakit, lalu Saad bertanya:",
    "english_text": "\"O Messenger of Allah, shall I bequeath all of my wealth?\" He said: \"No.\" He said: \"Half?\" He said: \"No.\" He said: \"One-third?\" He said: \"One-third, and one-third is much or large.\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا وَكِيعٌ، قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ سَعْدٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم عَادَهُ فِي مَرَضِهِ فَقَالَ يَا رَسُولَ اللَّهِ أُوصِي بِمَالِي كُلِّهِ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قَالَ فَالشَّطْرَ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قَالَ فَالثُّلُثَ قَالَ ‏\"‏ الثُّلُثَ وَالثُّلُثُ كَثِيرٌ أَوْ كَبِيرٌ ‏\"‏‏.‏",
    "malay_translation": "“Wahai Rasulullah, bolehkah saya mewakafkan seluruh harta saya?” Baginda menjawab: “Tidak.”  Lalu Saad bertanya lagi: “Bagaimana separuh?” Baginda menjawab: “Tidak.”  Lalu Saad bertanya lagi: “Bagaimana sepertiga?” Baginda menjawab: “Sepertiga, dan sepertiga itu sudah banyak.”"
  },
  {
    "id": 18377,
    "hadith_number": 3641,
    "tajuk_hadith": "Mewasiatkan Harta: Satu Pertiga Adalah Cukup",
    "perawi_melayu": "Daripada Aisyah r.a. bahawa Rasulullah s.a.w. telah melawat Saad ketika sakit.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْوَلِيدِ الْفَحَّامُ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ رَبِيعَةَ، قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَتَى سَعْدًا يَعُودُهُ فَقَالَ لَهُ سَعْدٌ يَا رَسُولَ اللَّهِ أُوصِي بِثُلُثَىْ مَالِي قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قَالَ فَأُوصِي بِالنِّصْفِ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قَالَ فَأُوصِي بِالثُّلُثِ قَالَ ‏\"‏ نَعَمِ الثُّلُثَ وَالثُّلُثُ كَثِيرٌ أَوْ كَبِيرٌ إِنَّكَ أَنْ تَدَعَ وَرَثَتَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَدَعَهُمْ فُقَرَاءَ يَتَكَفَّفُونَ ‏\"‏‏.‏",
    "malay_translation": "Daripada Muhammad bin Walid al-Fahham, katanya: telah menceritakan kepada kami Muhammad bin Rabiah, katanya: telah menceritakan kepada kami Hisyam bin Urwah, daripada bapanya, daripada Aisyah r.a., bahawa Rasulullah s.a.w. telah melawat Saad ketika sakit. Saad berkata kepada baginda: “Wahai Rasulullah, bolehkah saya mewasiatkan dua pertiga daripada harta saya?” Baginda menjawab: “Tidak.” Saad berkata: “Bolehkah saya mewasiatkan separuh?” Baginda menjawab: “Tidak.” Saad berkata: “Bolehkah saya mewasiatkan sepertiga?” Baginda menjawab: “Ya, sepertiga. Dan sepertiga itu sudah banyak. Sesungguhnya, kamu meninggalkan waris-waris kamu dalam keadaan kaya itu lebih baik daripada kamu meninggalkan mereka dalam keadaan miskin yang meminta-minta.”"
  },
  {
    "id": 18378,
    "hadith_number": 3642,
    "tajuk_hadith": "Hadis Tentang Pewarisan Harta",
    "perawi_melayu": "Daripada Ibnu Abbas r.a.",
    "english_text": "\"If the people were to reduce (their bequests) to one-quarter (of their wealth, that would be better), because the Messenger of Allah said: 'One-third, and one-third is much or large.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَوْ غَضَّ النَّاسُ إِلَى الرُّبُعِ لأَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الثُّلُثَ وَالثُّلُثُ كَثِيرٌ أَوْ كَبِيرٌ ‏\"‏‏.‏",
    "malay_translation": "Daripada Ibnu Abbas r.a. bahawa sekiranya manusia mengurangkan wasiat kepada satu perempat (daripada harta mereka), ia adalah lebih baik. Kerana Rasulullah SAW bersabda: \"Satu pertiga, dan satu pertiga itu banyak atau besar.\""
  },
  {
    "id": 18379,
    "hadith_number": 3643,
    "tajuk_hadith": "Mewasiatkan Harta: Satu Pertiga Adalah Cukup",
    "perawi_melayu": "Daripada Muhammad bin Sa'd, daripada bapanya Sa'd bin Malik, bahawa Nabi SAW datang kepadanya ketika sakit dan dia berkata:",
    "english_text": "\"I do not have any children apart from one daughter. Shall I bequeath all my wealth?\" The Prophet said: \"No.\" He said: \"Shall I bequeath half of it?\" The Prophet said: \"No.\" He said: \"Shall I bequeath one-third of it?\" He said: \"One-third, and one-third is much or large.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا حَجَّاجُ بْنُ الْمِنْهَالِ، قَالَ حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ يُونُسَ بْنِ جُبَيْرٍ، عَنْ مُحَمَّدِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، سَعْدِ بْنِ مَالِكٍ أَنَّ النَّبِيَّ صلى الله عليه وسلم جَاءَهُ وَهُوَ مَرِيضٌ فَقَالَ إِنَّهُ لَيْسَ لِي وَلَدٌ إِلاَّ ابْنَةٌ وَاحِدَةٌ فَأُوصِي بِمَالِي كُلِّهِ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ ‏\"‏‏.‏ قَالَ فَأُوصِي بِنِصْفِهِ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ ‏\"‏‏.‏ قَالَ فَأُوصِي بِثُلُثِهِ قَالَ ‏\"‏ الثُّلُثَ وَالثُّلُثُ كَثِيرٌ ‏\"‏‏.‏",
    "malay_translation": "Aku tidak mempunyai anak selain seorang anak perempuan. Bolehkah aku mewakafkan seluruh harta kekayaanku?  Nabi SAW bersabda: \"Tidak.\" Dia berkata: \"Bolehkah aku mewakafkan separuhnya?\" Nabi SAW bersabda: \"Tidak.\" Dia berkata: \"Bolehkah aku mewakafkan sepertiga daripadanya?\" Baginda bersabda: \"Sepertiga, dan sepertiga itu sudah banyak.\""
  },
  {
    "id": 18380,
    "hadith_number": 3644,
    "tajuk_hadith": "Pembayaran Hutang Bapa Jabir Dengan Keberkatan Rasulullah",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan bahawa bapanya syahid pada Perang Uhud dan meninggalkan enam orang anak perempuan serta hutang yang banyak.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ شَيْبَانَ، عَنْ فِرَاسٍ، عَنِ الشَّعْبِيِّ، قَالَ حَدَّثَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ، أَنَّ أَبَاهُ، اسْتُشْهِدَ يَوْمَ أُحُدٍ وَتَرَكَ سِتَّ بَنَاتٍ وَتَرَكَ عَلَيْهِ دَيْنًا فَلَمَّا حَضَرَ جُدَادُ النَّخْلِ أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ قَدْ عَلِمْتَ أَنَّ وَالِدِي اسْتُشْهِدَ يَوْمَ أُحُدٍ وَتَرَكَ دَيْنًا كَثِيرًا وَإِنِيِّ أُحِبُّ أَنْ يَرَاكَ الْغُرَمَاءُ‏.‏ قَالَ ‏\"‏ اذْهَبْ فَبَيْدِرْ كُلَّ تَمْرٍ عَلَى نَاحِيَةٍ ‏\"‏‏.‏ فَفَعَلْتُ ثُمَّ دَعَوْتُهُ فَلَمَّا نَظَرُوا إِلَيْهِ كَأَنَّمَا أُغْرُوا بِي تِلْكَ السَّاعَةَ فَلَمَّا رَأَى مَا يَصْنَعُونَ أَطَافَ حَوْلَ أَعْظَمِهَا بَيْدَرًا ثَلاَثَ مَرَّاتٍ ثُمَّ جَلَسَ عَلَيْهِ ثُمَّ قَالَ ‏\"‏ ادْعُ أَصْحَابَكَ ‏\"‏‏.‏ فَمَا زَالَ يَكِيلُ لَهُمْ حَتَّى أَدَّى اللَّهُ أَمَانَةَ وَالِدِي وَأَنَا رَاضٍ أَنْ يُؤَدِّيَ اللَّهُ أَمَانَةَ وَالِدِي لَمْ تَنْقُصْ تَمْرَةً وَاحِدَةً‏.‏",
    "malay_translation": "Jabir bin Abdullah meriwayatkan bahawa bapanya syahid pada Perang Uhud dan meninggalkan enam orang anak perempuan serta hutang yang banyak.  Apabila tiba musim menuai kurma, aku pergi mengadap Rasulullah SAW dan berkata, \"Wahai Rasulullah, tuan telah sedia maklum bahawa ayahku syahid pada Perang Uhud dan meninggalkan banyak hutang. Aku ingin agar para pemiutang dapat bertemu dengan tuan.\" Baginda bersabda, \"Pergilah, asingkan setiap timbunan kurma.\" Aku pun melakukannya, kemudian aku memanggil baginda.  Apabila para pemiutang melihat baginda, seolah-olah mereka mula menekan aku ketika itu. Melihat keadaan itu, Rasulullah SAW mengelilingi timbunan kurma yang terbesar sebanyak tiga kali, kemudian baginda duduk di atasnya lalu bersabda, \"Panggil sahabat-sahabatmu (para pemiutang).\" Baginda terus mengagihkan kurma kepada mereka sehingga Allah SWT melunaskan semua hutang ayahku. Aku bersyukur kerana Allah SWT telah melunaskan semua hutang ayahku tanpa kekurangan sebiji kurma pun."
  },
  {
    "id": 18381,
    "hadith_number": 3645,
    "tajuk_hadith": "Rasulullah Membantu Melunaskan Hutang",
    "perawi_melayu": "Dari Jabir, bahawa bapanya meninggal dunia dengan meninggalkan hutang.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلاَّمٍ، قَالَ حَدَّثَنَا إِسْحَاقُ، - وَهُوَ الأَزْرَقُ - قَالَ حَدَّثَنَا زَكَرِيَّا، عَنِ الشَّعْبِيِّ، عَنْ جَابِرٍ، أَنَّ أَبَاهُ، تُوُفِّيَ وَعَلَيْهِ دَيْنٌ فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ أَبِي تُوُفِّيَ وَعَلَيْهِ دَيْنٌ وَلَمْ يَتْرُكْ إِلاَّ مَا يُخْرِجُ نَخْلُهُ وَلاَ يَبْلُغُ مَا يُخْرِجُ نَخْلُهُ مَا عَلَيْهِ مِنَ الدَّيْنِ دُونَ سِنِينَ فَانْطَلِقْ مَعِي يَا رَسُولَ اللَّهِ لِكَىْ لاَ يَفْحُشَ عَلَىَّ الْغُرَّامُ فَأَتَى رَسُولُ اللَّهِ صلى الله عليه وسلم يَدُورُ بَيْدَرًا بَيْدَرًا فَسَلَّمَ حَوْلَهُ وَدَعَا لَهُ ثُمَّ جَلَسَ عَلَيْهِ وَدَعَا الْغُرَّامَ فَأَوْفَاهُمْ وَبَقِيَ مِثْلُ مَا أَخَذُوا‏.‏",
    "malay_translation": "Dikhabarkan kepada kami oleh Abdur Rahman bin Muhammad bin Sallam, katanya: telah menceritakan kepada kami Ishaq (iaitu al-Azraq), katanya: telah menceritakan kepada kami Zakaria, daripada al-Sya'bi, daripada Jabir, bahawa bapanya meninggal dunia dengan meninggalkan hutang. Maka aku datang kepada Nabi SAW lalu berkata: \"Wahai Rasulullah, bapaku telah meninggal dunia dan dia mempunyai hutang, dan dia tidak meninggalkan apa-apa melainkan hasil daripada pokok kurmanya. Hasil daripada pokok kurmanya itu tidak mencukupi untuk membayar hutangnya selama beberapa tahun lagi.  Oleh itu, pergilah bersamaku wahai Rasulullah, supaya pemiutang tidak bersikap kasar terhadapku.\" Maka Rasulullah SAW datang, lalu beliau memeriksa setiap timbunan kurma satu demi satu. Beliau bersalaman dan berdoa untuknya, kemudian duduk di atasnya.  Lalu beliau memanggil pemiutang dan melunaskan hutang mereka, dan baki hasil kurma itu sama banyak dengan jumlah yang telah diambil oleh mereka."
  },
  {
    "id": 18382,
    "hadith_number": 3646,
    "tajuk_hadith": "Keistimewaan Doa Nabi SAW dan Keberkatan Kurma",
    "perawi_melayu": "Dari Jabir ra.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مُغِيرَةَ، عَنِ الشَّعْبِيِّ، عَنْ جَابِرٍ، قَالَ تُوُفِّيَ عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ حَرَامٍ - قَالَ - وَتَرَكَ دَيْنًا فَاسْتَشْفَعْتُ بِرَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى غُرَمَائِهِ أَنْ يَضَعُوا مِنْ دَيْنِهِ شَيْئًا فَطَلَبَ إِلَيْهِمْ فَأَبَوْا فَقَالَ لِي النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اذْهَبْ فَصَنِّفْ تَمْرَكَ أَصْنَافًا الْعَجْوَةَ عَلَى حِدَةٍ وَعَذْقَ ابْنِ زَيْدٍ عَلَى حِدَةٍ وَأَصْنَافَهُ ثُمَّ ابْعَثْ إِلَىَّ ‏\"‏‏.‏ قَالَ فَفَعَلْتُ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَجَلَسَ فِي أَعْلاَهُ أَوْ فِي أَوْسَطِهِ ثُمَّ قَالَ ‏\"‏ كِلْ لِلْقَوْمِ ‏\"‏‏.‏ قَالَ فَكِلْتُ لَهُمْ حَتَّى أَوْفَيْتُهُمْ ثُمَّ بَقِيَ تَمْرِي كَأَنْ لَمْ يَنْقُصْ مِنْهُ شَىْءٌ‏.‏",
    "malay_translation": "Ali bin Hujr telah meriwayatkan daripada Jarir, daripada Mu'ghirah, daripada As-Sya'bi, daripada Jabir r.a. bahawa Abdullah bin Amr bin Haram telah meninggal dunia dan meninggalkan hutang. Maka aku bersyafaat kepada Rasulullah SAW bagi pihak pemiutang-pemiutangnya supaya mereka mengurangkan sedikit daripada hutangnya. Baginda telah meminta mereka, tetapi mereka enggan.  Lalu Nabi SAW bersabda kepadaku: \"Pergilah, kemudian bahagikan tamar kamu mengikut jenis-jenisnya; tamar Ajwa diasingkan, tamar  Ibn Zaid diasingkan dan begitu juga jenis-jenis tamar yang lain. Kemudian beritahu aku.\"  Maka aku pun melakukannya. Kemudian Rasulullah SAW datang dan duduk di atas atau di tengah-tengah timbunan tamar itu. Kemudian baginda bersabda: \"Agihkanlah kepada orang ramai.\"  Maka aku mengagihkannya kepada mereka sehingga aku melunaskan semua hutang mereka, dan tamar ku masih banyak seolah-olah tidak berkurang sedikit pun."
  },
  {
    "id": 18383,
    "hadith_number": 3647,
    "tajuk_hadith": "Menunaikan Hutang Bapa Kepada Orang Yahudi",
    "perawi_melayu": "Daripada Jabir bin Abdullah, Baginda berkata:",
    "english_text": "\"My father owed some dates to a Jew. He was killed on the Day of Uhud and he left behind two gardens. The dates owed to the Jew would take up everything in the two gardens. The Prophet said: 'Can you take half this year and half next year?' But the Jew refused. The Prophet said: 'When the time to pick the dates comes, call me.' So I called him and he came, accompanied by Abu Bakr. The dates were picked and weighed from the lowest part of the palm trees, and the Messenger of Allah was praying for blessing, until we paid off everything that we owed him from the smaller of the two gardens, as calculated by 'Ammar. Then I brought them some fresh dates and water and they ate and drank, then he said: 'This is part of the blessing concerning which you will be questioned.'\"",
    "arabic_text": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يُونُسَ بْنِ مُحَمَّدٍ، - حَرَمِيٌّ - قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا حَمَّادٌ، عَنْ عَمَّارِ بْنِ أَبِي عَمَّارٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كَانَ لِيَهُودِيٍّ عَلَى أَبِي تَمْرٌ فَقُتِلَ يَوْمَ أُحُدٍ وَتَرَكَ حَدِيقَتَيْنِ وَتَمْرُ الْيَهُودِيِّ يَسْتَوْعِبُ مَا فِي الْحَدِيقَتَيْنِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هَلْ لَكَ أَنْ تَأْخُذَ الْعَامَ نِصْفَهُ وَتُؤَخِّرَ نِصْفَهُ ‏\"‏‏.‏ فَأَبَى الْيَهُودِيُّ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هَلْ لَكَ أَنْ تَأْخُذَ الْجُدَادَ ‏\"‏‏.‏ فَآذِنِّي فَآذَنْتُهُ فَجَاءَ هُوَ وَأَبُو بَكْرٍ فَجَعَلَ يُجَدُّ وَيُكَالُ مِنْ أَسْفَلِ النَّخْلِ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَدْعُو بِالْبَرَكَةِ حَتَّى وَفَيْنَاهُ جَمِيعَ حَقِّهِ مِنْ أَصْغَرِ الْحَدِيقَتَيْنِ - فِيمَا يَحْسِبُ عَمَّارٌ - ثُمَّ أَتَيْتُهُمْ بِرُطَبٍ وَمَاءٍ فَأَكَلُوا وَشَرِبُوا ثُمَّ قَالَ ‏\"‏ هَذَا مِنَ النَّعِيمِ الَّذِي تُسْأَلُونَ عَنْهُ ‏\"‏‏.‏",
    "malay_translation": "Bapa saya berhutang beberapa tamar kepada seorang Yahudi.  Beliau terkorban pada Perang Uhud dan meninggalkan dua buah kebun. Tamar yang dihutang kepada Yahudi itu boleh memenuhi keseluruhan dua buah kebun tersebut.  Rasulullah SAW bersabda:  'Bolehkah kamu mengambil separuh tahun ini dan separuh tahun hadapan?'  Tetapi orang Yahudi itu enggan.  Rasulullah SAW bersabda: 'Apabila tiba musim menuai tamar, panggillah aku.'  Maka saya memanggilnya dan dia datang bersama Abu Bakar. Tamar dituai dan ditimbang dari bahagian bawah pokok kurma, dan Rasulullah SAW mendoakan keberkatan, sehingga kami melunaskan semua hutang kami kepadanya daripada kebun yang lebih kecil daripada dua kebun itu, seperti yang dikira oleh Ammar. Kemudian saya membawakan mereka tamar segar dan air, lalu mereka makan dan minum. Kemudian Baginda bersabda: 'Inilah sebahagian daripada nikmat yang kamu akan ditanya tentangnya.'"
  },
  {
    "id": 18384,
    "hadith_number": 3648,
    "tajuk_hadith": "Doa Rasulullah SAW untuk Hutang Piutang",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، عَنْ حَدِيثِ عَبْدِ الْوَهَّابِ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ وَهْبِ بْنِ كَيْسَانَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ تُوُفِّيَ أَبِي وَعَلَيْهِ دَيْنٌ فَعَرَضْتُ عَلَى غُرَمَائِهِ أَنْ يَأْخُذُوا الثَّمَرَةَ بِمَا عَلَيْهِ فَأَبَوْا وَلَمْ يَرَوْا فِيهِ وَفَاءً فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَذَكَرْتُ ذَلِكَ لَهُ قَالَ ‏\"‏ إِذَا جَدَدْتَهُ فَوَضَعْتَهُ فِي الْمِرْبَدِ فَآذِنِّي ‏\"‏‏.‏ فَلَمَّا جَدَدْتُهُ وَوَضَعْتُهُ فِي الْمِرْبَدِ أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَجَاءَ وَمَعَهُ أَبُو بَكْرٍ وَعُمَرُ فَجَلَسَ عَلَيْهِ وَدَعَا بِالْبَرَكَةِ ثُمَّ قَالَ ‏\"‏ ادْعُ غُرَمَاءَكَ فَأَوْفِهِمْ ‏\"‏‏.‏ قَالَ فَمَا تَرَكْتُ أَحَدًا لَهُ عَلَى أَبِي دَيْنٌ إِلاَّ قَضَيْتُهُ وَفَضَلَ لِي ثَلاَثَةَ عَشَرَ وَسْقًا فَذَكَرْتُ ذَلِكَ لَهُ فَضَحِكَ وَقَالَ ‏\"‏ ائْتِ أَبَا بَكْرٍ وَعُمَرَ فَأَخْبِرْهُمَا ذَلِكَ ‏\"‏‏.‏ فَأَتَيْتُ أَبَا بَكْرٍ وَعُمَرَ فَأَخْبَرْتُهُمَا فَقَالاَ قَدْ عَلِمْنَا إِذْ صَنَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَا صَنَعَ أَنَّهُ سَيَكُونُ ذَلِكَ‏.‏",
    "malay_translation": "Jabir bin Abdullah berkata: “Bapaku meninggal dunia dan meninggalkan hutang.  Aku menawarkan kepada pemiutang bapaku agar mereka mengambil hasil tanaman kurma sebagai bayaran hutang, tetapi mereka menolak kerana mereka fikir hasil itu tidak mencukupi untuk membayar hutang. Aku pergi kepada Rasulullah SAW dan menceritakan hal itu. Baginda bersabda: ‘Apabila engkau telah menuai dan meletakkan kurma itu di tempat pengeringan (mirbad), beritahu aku.’  Setelah aku menuai dan meletakkan kurma itu di tempat pengeringan, aku pergi kepada Rasulullah SAW. Baginda datang bersama Abu Bakar dan Umar. Baginda duduk di atas timbunan kurma itu dan berdoa memohon keberkatan. Kemudian baginda bersabda: ‘Panggil pemiutangmu dan bayarlah mereka.’ Aku pun membayar semua hutang bapaku.  Selepas itu, masih ada lebihan sebanyak tiga belas wasq. Aku memberitahu Baginda tentang lebihan itu, lalu Baginda tersenyum dan bersabda: ‘Pergilah kepada Abu Bakar dan Umar, beritahukan hal ini kepada mereka.’ Aku pun pergi kepada Abu Bakar dan Umar dan menceritakan hal itu, lalu mereka berkata: ‘Kami telah tahu, apabila Rasulullah SAW telah melakukan apa yang Baginda lakukan, pasti akan terjadi demikian.’"
  },
  {
    "id": 18385,
    "hadith_number": 3649,
    "tajuk_hadith": "Hak Setiap Individu dan Tiada Wasiah untuk Pewaris",
    "perawi_melayu": "Daripada Amr bin Kharijah, diriwayatkan bahawa:",
    "english_text": "\"The Messenger of Allah delivered a Khutbah and said: 'Allah has given every person who has rights his due, and there is no bequest to an heir.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ، عَنْ عَمْرِو بْنِ خَارِجَةَ، قَالَ خَطَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ إِنَّ اللَّهَ قَدْ أَعْطَى كُلَّ ذِي حَقٍّ حَقَّهُ وَلاَ وَصِيَّةَ لِوَارِثٍ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW telah menyampaikan khutbah dan bersabda:  \"Sesungguhnya Allah SWT telah memberikan hak kepada setiap orang yang berhak menerimanya, dan tiada wasiat bagi pewaris.\""
  },
  {
    "id": 18386,
    "hadith_number": 3650,
    "tajuk_hadith": "Pembahagian Pusaka dan Larangan Wasat kepada Waris",
    "perawi_melayu": "Daripada Syahr bin Hawshab bahawa Ibn Ghanm menyebut bahawa Ibn Kharijah memberitahunya bahawa dia telah melihat Rasulullah SAW berkhutbah kepada manusia di atas kenderaannya, yang sedang memamah (makanan) dan air liurnya menitis. Rasulullah SAW telah bersabda dalam khutbahnya:",
    "english_text": "\"Allah has given each person a share of the inheritance, and it is not permissible to give bequests to an heir.\"",
    "arabic_text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا سَعِيدٌ، قَالَ حَدَّثَنَا قَتَادَةُ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، أَنَّ ابْنَ غَنْمٍ، ذَكَرَ أَنَّ ابْنَ خَارِجَةَ، ذَكَرَ لَهُ أَنَّهُ شَهِدَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَخْطُبُ النَّاسَ عَلَى رَاحِلَتِهِ وَإِنَّهَا لَتَقْصَعُ بِجِرَّتِهَا وَإِنَّ لُعَابَهَا لَيَسِيلُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي خُطْبَتِهِ ‏\n\"‏ إِنَّ اللَّهَ قَدْ قَسَّمَ لِكُلِّ إِنْسَانٍ قِسْمَهُ مِنَ الْمِيرَاثِ فَلاَ تَجُوزُ لِوَارِثٍ وَصِيَّةٌ ‏\"‏‏.‏",
    "malay_translation": "Sesungguhnya Allah SWT telah menetapkan bahagian warisan bagi setiap orang, maka wasiat kepada waris adalah tidak dibenarkan."
  },
  {
    "id": 18387,
    "hadith_number": 3651,
    "tajuk_hadith": "Hak Setiap Orang dan Tiada Wasiah untuk Pewaris",
    "perawi_melayu": "Daripada Amr bin Kharijah, katanya:",
    "english_text": "\"The Messenger of Allah said: 'Allah, Mighty is His Name, has given every person who has rights his due, and there is no bequest to an heir.'\"",
    "arabic_text": "أَخْبَرَنَا عُتْبَةُ بْنُ عَبْدِ اللَّهِ الْمَرْوَزِيُّ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، قَالَ أَنْبَأَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، عَنْ قَتَادَةَ، عَنْ عَمْرِو بْنِ خَارِجَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ اللَّهَ عَزَّ اسْمُهُ قَدْ أَعْطَى كُلَّ ذِي حَقٍّ حَقَّهُ وَلاَ وَصِيَّةَ لِوَارِثٍ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Sesungguhnya Allah SWT telah memberikan hak kepada setiap orang yang berhak menerimanya, dan tiada wasiat bagi pewaris.\""
  },
  {
    "id": 18388,
    "hadith_number": 3652,
    "tajuk_hadith": "Seruan Rasulullah SAW kepada kaum kerabatnya untuk memelihara diri dari api neraka",
    "perawi_melayu": "Dari Abu Hurairah ra.",
    "english_text": "\"When the following was revealed: 'And warn your tribe (O Muhammad) of near kindred,' the Messenger of Allah called the Quraish and they gathered, and he spoke in general and specific terms, then he said: 'O Banu Ka'b bin Lu'ayy! O Banu Murrah bin Ka'b! O Banu 'Abd Shams! O Banu 'Abd Manaf! O Banu Hisham! O Banu 'Abdul-Muttalib! Save yourselves from the Fire! O Fatimah! Save yourself from the Fire. I cannot avail you anything before Allah, but I will uphold the ties of kinship with you.\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ مُوسَى بْنِ طَلْحَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ لَمَّا نَزَلَتْ ‏{‏وَأَنْذِرْ عَشِيرَتَكَ الأَقْرَبِينَ‏}‏ دَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم قُرَيْشًا فَاجْتَمَعُوا فَعَمَّ وَخَصَّ فَقَالَ ‏\"‏ يَا بَنِي كَعْبِ بْنِ لُؤَىٍّ يَا بَنِي مُرَّةَ بْنِ كَعْبٍ يَا بَنِي عَبْدِ شَمْسٍ وَيَا بَنِي عَبْدِ مَنَافٍ وَيَا بَنِي هَاشِمٍ وَيَا بَنِي عَبْدِ الْمُطَّلِبِ أَنْقِذُوا أَنْفُسَكُمْ مِنَ النَّارِ وَيَا فَاطِمَةُ أَنْقِذِي نَفْسَكِ مِنَ النَّارِ إِنِّي لاَ أَمْلِكُ لَكُمْ مِنَ اللَّهِ شَيْئًا غَيْرَ أَنَّ لَكُمْ رَحِمًا سَأَبُلُّهَا بِبِلاَلِهَا ‏\"‏‏.‏",
    "malay_translation": "Setelah turun ayat: \"Dan berilah amaran kepada kaum kerabatmu yang terdekat,\" Rasulullah SAW memanggil kaum Quraisy dan mereka berkumpul. Baginda menyampaikan amanat secara umum dan khusus, kemudian bersabda: \"Wahai Bani Ka'b bin Lu'ay! Wahai Bani Murrah bin Ka'b! Wahai Bani 'Abd Shams! Wahai Bani 'Abd Manaf! Wahai Bani Hashim! Wahai Bani Abdul Muttalib! Selamatkanlah diri kamu dari api neraka! Wahai Fatimah! Selamatkanlah dirimu dari api neraka! Sesungguhnya aku tidak mampu berbuat apa-apa untuk kamu di sisi Allah, melainkan aku akan menjaga hubungan silaturahim dengan kamu.\""
  },
  {
    "id": 18389,
    "hadith_number": 3653,
    "tajuk_hadith": "Menebus Diri Sendiri daripada Allah SWT",
    "perawi_melayu": "Daripada riwayat Musa bin Talhah, katanya:",
    "english_text": "\"The Messenger of Allah said: 'O Banu 'Abd Manaf! Buy your souls from your Lord. I cannot avail you anything before Allah. Abu Banu 'Abdul-Muttalib! Buy your souls from your Lord. I cannot avail you anything before Allah. But between me and you there are ties of kinship which I will uphold.'\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، قَالَ أَنْبَأَنَا إِسْرَائِيلُ، عَنْ مُعَاوِيَةَ، - وَهُوَ ابْنُ إِسْحَاقَ - عَنْ مُوسَى بْنِ طَلْحَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَا بَنِي عَبْدِ مَنَافٍ اشْتَرُوا أَنْفُسَكُمْ مِنْ رَبِّكُمْ إِنِّي لاَ أَمْلِكُ لَكُمْ مِنَ اللَّهِ شَيْئًا يَا بَنِي عَبْدِ الْمُطَّلِبِ اشْتَرُوا أَنْفُسَكُمْ مِنْ رَبِّكُمْ إِنِّي لاَ أَمْلِكُ لَكُمْ مِنَ اللَّهِ شَيْئًا وَلَكِنْ بَيْنِي وَبَيْنَكُمْ رَحِمٌ أَنَا بَالُّهَا بِبِلاَلِهَا ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Wahai Bani Abd Manaf! Tebuslah diri kamu daripada Tuhan kamu. Sesungguhnya aku tidak mampu berbuat apa-apa untuk kamu di sisi Allah. Wahai Bani Abdul Muttalib! Tebuslah diri kamu daripada Tuhan kamu. Sesungguhnya aku tidak mampu berbuat apa-apa untuk kamu di sisi Allah. Akan tetapi, antara aku dan kamu ada hubungan kekeluargaan yang akan aku jaga.\""
  },
  {
    "id": 18390,
    "hadith_number": 3654,
    "tajuk_hadith": "Rasulullah SAW Menasihati Quraisy dan Keluarga",
    "perawi_melayu": "Dari Abu Hurairah r.a.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ، عَنِ ابْنِ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ أُنْزِلَ عَلَيْهِ ‏{‏وَأَنْذِرْ عَشِيرَتَكَ الأَقْرَبِينَ‏}‏ قَالَ ‏\"‏ يَا مَعْشَرَ قُرَيْشٍ اشْتَرُوا أَنْفُسَكُمْ مِنَ اللَّهِ لاَ أُغْنِي عَنْكُمْ مِنَ اللَّهِ شَيْئًا يَا بَنِي عَبْدِ الْمُطَّلِبِ لاَ أُغْنِي عَنْكُمْ مِنَ اللَّهِ شَيْئًا يَا عَبَّاسُ بْنَ عَبْدِ الْمُطَّلِبِ لاَ أُغْنِي عَنْكَ مِنَ اللَّهِ شَيْئًا يَا صَفِيَّةُ عَمَّةَ رَسُولِ اللَّهِ صلى الله عليه وسلم لاَ أُغْنِي عَنْكِ مِنَ اللَّهِ شَيْئًا يَا فَاطِمَةُ بِنْتَ مُحَمَّدٍ سَلِينِي مَا شِئْتِ لاَ أُغْنِي عَنْكِ مِنَ اللَّهِ شَيْئًا ‏\"‏‏.‏",
    "malay_translation": "Daripada Sulaiman bin Daud, daripada Ibnu Wahb, katanya: Yunus memberitakan kepadaku, daripada Ibnu Syihab, katanya: Sa'id bin al-Musayyab dan Abu Salamah bin Abdurrahman memberitakan kepadaku, daripada Abu Hurairah r.a. bahawa Rasulullah SAW bersabda ketika ayat  “Dan berilah amaran kepada kaum kerabatmu yang terdekat.” diturunkan: “Wahai kaum Quraisy! Belilah diri kamu daripada Allah. Aku tidak dapat memberi manfaat kepada kamu daripada Allah sedikit pun. Wahai Bani Abdul Muttalib! Aku tidak dapat memberi manfaat kepada kamu daripada Allah sedikit pun. Wahai Abbas bin Abdul Muttalib! Aku tidak dapat memberi manfaat kepadamu daripada Allah sedikit pun. Wahai Safiyyah, mak saudara Rasulullah SAW! Aku tidak dapat memberi manfaat kepadamu daripada Allah sedikit pun. Wahai Fatimah binti Muhammad! Mintalah apa sahaja yang kamu inginkan, aku tidak dapat memberi manfaat kepadamu daripada Allah sedikit pun.”"
  },
  {
    "id": 18391,
    "hadith_number": 3655,
    "tajuk_hadith": "Seruan Rasulullah SAW Kepada kaum kerabatnya",
    "perawi_melayu": "Abu Hurairah berkata:",
    "english_text": "\"The Messenger of Allah stood up when the following was revealed to him: 'And warn your tribe (O Muhammad) of near kindred,' and said: 'O Quraish! Buy your souls from your Lord, I cannot avail you anything before Allah. O Banu 'Abd Manaf! I cannot avail you anything before Allah. O 'Abbas bin 'Abdul-Muttalib! I cannot avail you anything before Allah. O Safiyyah, paternal aunt of the Messenger of Allah! I cannot avail you anything before Allah. O Fatimah! Ask me for whatever you want, I cannot avail you anything before Allah.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا بِشْرُ بْنُ شُعَيْبٍ، عَنْ أَبِيهِ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ، قَالَ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ أُنْزِلَ عَلَيْهِ ‏{‏وَأَنْذِرْ عَشِيرَتَكَ الأَقْرَبِينَ‏}‏ فَقَالَ ‏\"‏ يَا مَعْشَرَ قُرَيْشٍ اشْتَرُوا أَنْفُسَكُمْ مِنَ اللَّهِ لاَ أُغْنِي عَنْكُمْ مِنَ اللَّهِ شَيْئًا يَا بَنِي عَبْدِ مَنَافٍ لاَ أُغْنِي عَنْكُمْ مِنَ اللَّهِ شَيْئًا يَا عَبَّاسُ بْنَ عَبْدِ الْمُطَّلِبِ لاَ أُغْنِي عَنْكَ مِنَ اللَّهِ شَيْئًا يَا صَفِيَّةُ عَمَّةَ رَسُولِ اللَّهِ صلى الله عليه وسلم لاَ أُغْنِي عَنْكِ مِنَ اللَّهِ شَيْئًا يَا فَاطِمَةُ سَلِينِي مَا شِئْتِ لاَ أُغْنِي عَنْكِ مِنَ اللَّهِ شَيْئًا ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW berdiri ketika wahyu berikut diturunkan kepadanya:  'Dan berilah amaran kepada kaum kerabatmu yang terdekat,' lalu Baginda bersabda: 'Wahai kaum Quraisy! Belilah jiwa kamu daripada Allah, aku tidak mampu memberi manfaat kepada kamu daripada Allah. Wahai Bani Abd Manaf! Aku tidak mampu memberi manfaat kepada kamu daripada Allah. Wahai Abbas bin Abdul Muttalib! Aku tidak mampu memberi manfaat kepadamu daripada Allah. Wahai Safiyyah, makcik sebelah bapa Rasulullah SAW! Aku tidak mampu memberi manfaat kepadamu daripada Allah. Wahai Fatimah! Mintalah apa sahaja yang engkau mahukan, aku tidak mampu memberi manfaat kepadamu daripada Allah.'"
  },
  {
    "id": 18392,
    "hadith_number": 3656,
    "tajuk_hadith": "Rasulullah SAW dan Nasihat Kepada Keluarga",
    "perawi_melayu": "Daripada Aisyah r.a.",
    "english_text": "\"When this verse- 'And warn your tribe (O Muhammad) of near kindred'- was revealed, the Messenger of Allah said: 'O Fatimah, daughter of Muhammad! O Safiyyah bint 'Abdul-Muttalib! O Banu 'Abdul-Muttalib! I cannot avail you anything before Allah; ask me for whatever you want of my wealth.'\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا أَبُو مُعَاوِيَةَ، قَالَ حَدَّثَنَا هِشَامٌ، - وَهُوَ ابْنُ عُرْوَةَ - عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا نَزَلَتْ هَذِهِ الآيَةُ ‏{‏وَأَنْذِرْ عَشِيرَتَكَ الأَقْرَبِينَ‏}‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا فَاطِمَةُ ابْنَةَ مُحَمَّدٍ يَا صَفِيَّةُ بِنْتَ عَبْدِ الْمُطَّلِبِ يَا بَنِي عَبْدِ الْمُطَّلِبِ لاَ أُغْنِي عَنْكُمْ مِنَ اللَّهِ شَيْئًا سَلُونِي مِنْ مَالِي مَا شِئْتُمْ ‏\"‏‏.‏",
    "malay_translation": "Daripada Aisyah r.a.:  Apabila ayat ini diturunkan,  \"Dan berilah amaran kepada kaum kerabatmu yang terdekat,\" Rasulullah SAW bersabda: \"Wahai Fatimah, puteri Muhammad! Wahai Safiyyah binti Abdul Muttalib! Wahai Bani Abdul Muttalib! Aku tidak mampu memberi manfaat kepada kamu daripada Allah SWT; mintalah apa sahaja yang kamu inginkan daripada harta kekayaanku.\""
  },
  {
    "id": 18393,
    "hadith_number": 3657,
    "tajuk_hadith": "Sedekah Bagi Pihak Ibu yang Meninggal",
    "perawi_melayu": "Daripada Aisyah r.a. bahawa seorang lelaki berkata kepada Rasulullah s.a.w.:",
    "english_text": "\"My mother died unexpectedly; if she had been able to speak she would have given charity. Should I give charity on her behalf?\" The Messenger of Allah said: \"Yes.\" So he gave charity on her behalf.",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنَا ابْنُ الْقَاسِمِ، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ رَجُلاً، قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِنَّ أُمِّي افْتُلِتَتْ نَفْسُهَا وَإِنَّهَا لَوْ تَكَلَّمَتْ تَصَدَّقَتْ أَفَأَتَصَدَّقُ عَنْهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ نَعَمْ ‏\"‏‏.‏ فَتَصَدَّقَ عَنْهَا‏.‏",
    "malay_translation": "Daripada Aisyah r.a., bahawa seorang lelaki bertanya kepada Rasulullah s.a.w., \"Ibu saya meninggal dunia secara tiba-tiba; sekiranya beliau sempat bercakap, nescaya beliau akan bersedekah. Bolehkah saya bersedekah bagi pihak beliau?\"  Rasulullah s.a.w. menjawab, \"Ya.\"  Lalu lelaki itu bersedekah bagi pihak ibunya."
  },
  {
    "id": 18394,
    "hadith_number": 3658,
    "tajuk_hadith": "Sedekah Bagi Ibu Yang Telah Meninggal",
    "perawi_melayu": "Daripada Sa'eed bin 'Amr bin Shurahbil bin Sa'eed bin Sa'd bin 'Ubadah, daripada bapanya, bahawa datuknya berkata:",
    "english_text": "",
    "arabic_text": "أَنْبَأَنَا الْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ الْقَاسِمِ، عَنْ مَالِكٍ، عَنْ سَعِيدِ بْنِ عَمْرِو بْنِ شُرَحْبِيلَ بْنِ سَعِيدِ بْنِ سَعْدِ بْنِ عُبَادَةَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ خَرَجَ سَعْدُ بْنُ عُبَادَةَ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي بَعْضِ مَغَازِيهِ وَحَضَرَتْ أُمَّهُ الْوَفَاةُ بِالْمَدِينَةِ فَقِيلَ لَهَا أَوْصِي‏.‏ فَقَالَتْ فِيمَ أُوصِي الْمَالُ مَالُ سَعْدٍ‏.‏ فَتُوُفِّيَتْ قَبْلَ أَنْ يَقْدَمَ سَعْدٌ فَلَمَّا قَدِمَ سَعْدٌ ذُكِرَ ذَلِكَ لَهُ فَقَالَ يَا رَسُولَ اللَّهِ هَلْ يَنْفَعُهَا أَنْ أَتَصَدَّقَ عَنْهَا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ نَعَمْ ‏\"‏‏.‏ فَقَالَ سَعْدٌ حَائِطُ كَذَا وَكَذَا صَدَقَةٌ عَنْهَا لِحَائِطٍ سَمَّاهُ‏.‏",
    "malay_translation": "Kami diberitakan oleh Al-Harits bin Miskin, melalui pembacaan kepadanya dan saya mendengar, daripada Ibnu Al-Qasim, daripada Malik, daripada Sa'id bin 'Amr bin Shurahbil bin Sa'id bin Sa'd bin 'Ubadah, daripada bapanya, daripada datuknya, bahawa Saad bin 'Ubadah keluar bersama Nabi SAW dalam salah satu ekspedisi perang, dan ibunya telah hampir meninggal dunia di Madinah. Maka dikatakan kepadanya (ketika hampir meninggal): “Buat wasiat.” Maka dia berkata: “Kepada siapa aku hendak berwasiat? Harta itu adalah harta Saad.” Kemudian dia meninggal dunia sebelum Saad sampai. Apabila Saad sampai, hal itu disebut kepadanya, maka dia berkata: “Wahai Rasulullah, adakah ia memberi manfaat kepadanya jika aku bersedekah bagi pihaknnya?” Maka Nabi SAW bersabda: “Ya.” Maka Saad berkata: “Sebuah kebun begini dan begitu menjadi sedekah bagi pihaknya” – iaitu sebuah kebun yang telah disebut namanya."
  },
  {
    "id": 18395,
    "hadith_number": 3659,
    "tajuk_hadith": "Amalan Yang Berterusan Selepas Kematian",
    "perawi_melayu": "Dari Abu Hurairah, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"When a man dies all his good deeds come to an end except three: Ongoing charity (Sadaqah Jariyah), beneficial knowledge and a righteous son who prays for him.\"",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنَا الْعَلاَءُ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا مَاتَ الإِنْسَانُ انْقَطَعَ عَمَلُهُ إِلاَّ مِنْ ثَلاَثَةٍ مِنْ صَدَقَةٍ جَارِيَةٍ وَعِلْمٍ يُنْتَفَعُ بِهِ وَوَلَدٍ صَالِحٍ يَدْعُو لَهُ ‏\"‏‏.‏",
    "malay_translation": "Apabila seseorang itu meninggal dunia, terputuslah amalannya kecuali tiga perkara: sedekah jariah, ilmu yang dimanfaatkan, dan anak yang soleh yang mendoakannya."
  },
  {
    "id": 18396,
    "hadith_number": 3660,
    "tajuk_hadith": "Sedekah Bagi Pihak Arwah",
    "perawi_melayu": "Dari Abu Hurairah, bahawa seorang lelaki berkata kepada Nabi:",
    "english_text": "\"My father died and left behind wealth, but he did not leave a will. Will it expiate for him if I give charity on his behalf?\"",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَنْبَأَنَا إِسْمَاعِيلُ، عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً، قَالَ لِلنَّبِيِّ صلى الله عليه وسلم إِنَّ أَبِي مَاتَ وَتَرَكَ مَالاً وَلَمْ يُوصِ فَهَلْ يُكَفِّرُ عَنْهُ أَنْ أَتَصَدَّقَ عَنْهُ قَالَ ‏\n\"‏ نَعَمْ ‏\"‏‏.‏",
    "malay_translation": "Dari Abu Hurairah, bahawa seorang lelaki berkata kepada Nabi SAW: \"Bapa saya telah meninggal dunia dan meninggalkan harta, tetapi beliau tidak meninggalkan wasiat. Adakah sedekah bagi pihak saya akan menghapuskan dosa-dosanya?\"  Baginda SAW menjawab: \"Ya.\""
  },
  {
    "id": 18397,
    "hadith_number": 3661,
    "tajuk_hadith": "Pengecualian Hamba Wanita Nubia",
    "perawi_melayu": "Daripada riwayat Asy-Syarid bin Suwaid Ath-Thaqafi yang berkata:",
    "english_text": "\"I came to the Messenger of Allah and said: 'My mother left a will saying that a slave should be freed on her behalf. I have a Nubian slave girl; will it suffice if I free her on her behalf?' He said: 'Bring her here.' The Prophet said to her: 'Who is your Lord?' She said: 'Allah.' He said: 'Who am I?' She said: 'The Messenger of Allah.' He said: 'Set her free , for she is a believer.'\"",
    "arabic_text": "أَخْبَرَنَا مُوسَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنِ الشَّرِيدِ بْنِ سُوَيْدٍ الثَّقَفِيِّ، قَالَ أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ إِنَّ أُمِّي أَوْصَتْ أَنْ تُعْتَقَ عَنْهَا رَقَبَةٌ وَإِنَّ عِنْدِي جَارِيَةً نُوبِيَّةً أَفَيُجْزِئُ عَنِّي أَنْ أَعْتِقَهَا عَنْهَا قَالَ ‏\"‏ ائْتِنِي بِهَا ‏\"‏‏.‏ فَأَتَيْتُهُ بِهَا فَقَالَ لَهَا النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَنْ رَبُّكِ ‏\"‏‏.‏ قَالَتِ اللَّهُ‏.‏ قَالَ ‏\"‏ مَنْ أَنَا ‏\"‏‏.‏ قَالَتْ أَنْتَ رَسُولُ اللَّهِ‏.‏ قَالَ ‏\"‏ فَأَعْتِقْهَا فَإِنَّهَا مُؤْمِنَةٌ ‏\"‏‏.‏",
    "malay_translation": "Aku menghadap Rasulullah SAW dan berkata, ‘Ibuku telah mewasiatkan supaya seorang hamba dibebaskan bagi pihaknya. Aku mempunyai seorang hamba perempuan Nubia, adakah cukup sekiranya aku membebaskannya bagi pihak ibuku?’ Baginda bersabda, ‘Bawalah dia kepadaku.’ Kemudian, Nabi SAW bertanya kepada hamba perempuan itu, ‘Siapakah Tuhanmu?’ Jawabnya, ‘Allah.’ Baginda bertanya lagi, ‘Siapakah aku?’ Jawabnya, ‘Engkau adalah Rasulullah.’ Baginda bersabda, ‘Bebaskanlah dia, kerana sesungguhnya dia seorang mukmin.’"
  },
  {
    "id": 18398,
    "hadith_number": 3662,
    "tajuk_hadith": "Sedekah Bagi Ibu yang Meninggal Dunia",
    "perawi_melayu": "Daripada Ibnu Abbas bahawa Saad bertanya kepada Nabi:",
    "english_text": "\"My mother died and did not leave a will; shall I give charity on her behalf?\" He said: \"Yes.\"",
    "arabic_text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ عِيسَى، قَالَ أَنْبَأَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ سَعْدًا، سَأَلَ النَّبِيَّ صلى الله عليه وسلم إِنَّ أُمِّي مَاتَتْ وَلَمْ تُوصِ أَفَأَتَصَدَّقُ عَنْهَا قَالَ ‏\n\"‏ نَعَمْ ‏\"‏‏.‏",
    "malay_translation": "Daripada Ibnu Abbas bahawa Saad bertanya kepada Nabi SAW, \"Ibu saya telah meninggal dunia dan tidak meninggalkan wasiat. Bolehkah saya bersedekah bagi pihak beliau?\" Baginda SAW menjawab, \"Ya.\""
  },
  {
    "id": 18399,
    "hadith_number": 3663,
    "tajuk_hadith": "Sedekah Bagi Arwah Ibu",
    "perawi_melayu": "Daripada Ibnu Abbas, bahawa seorang lelaki berkata:",
    "english_text": "\"O Messenger of Allah, my mother died; will it benefit her if I give in charity on her behalf?\" He said: \"Yes.\" He said: \"I have a garden and I ask you to bear witness that I am giving it in charity on her behalf.\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ الأَزْهَرِ، قَالَ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، قَالَ حَدَّثَنَا زَكَرِيَّا بْنُ إِسْحَاقَ، قَالَ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَجُلاً، قَالَ يَا رَسُولَ اللَّهِ إِنَّ أُمَّهُ تُوُفِّيَتْ أَفَيَنْفَعُهَا إِنْ تَصَدَّقْتُ عَنْهَا قَالَ ‏\n\"‏ نَعَمْ ‏\"‏‏.‏ قَالَ فَإِنَّ لِي مَخْرَفًا فَأُشْهِدُكَ أَنِّي قَدْ تَصَدَّقْتُ بِهِ عَنْهَا‏.‏",
    "malay_translation": "Daripada Ibnu Abbas, bahawa seorang lelaki berkata, \"Wahai Rasulullah, ibu saya telah meninggal dunia. Adakah sedekah bagi pihak beliau akan memberi manfaat kepadanya?\" Baginda menjawab, \"Ya.\" Lelaki itu berkata, \"Saya mempunyai sebuah kebun dan saya meminta saksi daripada tuan bahawa saya telah menyedekahkannya bagi pihak ibu saya.\""
  },
  {
    "id": 18400,
    "hadith_number": 3664,
    "tajuk_hadith": "Membebaskan Hamba Sebagai Pembayaran Nazar Ibu",
    "perawi_melayu": "Daripada Saad bin Ubadah yang datang kepada Nabi SAW dan berkata:",
    "english_text": "\"My mother has died and she had a vow to fulfill. Will it suffice if I free a slave on her behalf?\" He said: \"Free a slave on behalf of your mother.\"",
    "arabic_text": "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا عَفَّانُ، قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ كَثِيرٍ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ سَعْدِ بْنِ عُبَادَةَ، أَنَّهُ أَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ إِنَّ أُمِّي مَاتَتْ وَعَلَيْهَا نَذْرٌ أَفَيُجْزِئُ عَنْهَا أَنْ أَعْتِقَ عَنْهَا قَالَ ‏\n\"‏ أَعْتِقْ عَنْ أُمِّكَ ‏\"‏‏.‏",
    "malay_translation": "Daripada Saad bin Ubadah, bahawa dia datang kepada Nabi SAW lalu berkata, \"Ibu saya telah meninggal dunia dan beliau mempunyai satu nazar yang perlu ditunaikan. Adakah cukup sekiranya saya membebaskan seorang hamba bagi pihak beliau?\" Baginda SAW bersabda, \"Bebaskanlah seorang hamba bagi pihak ibumu.\""
  },
  {
    "id": 18401,
    "hadith_number": 3665,
    "tajuk_hadith": "Menunaikan Nazar Ibu yang Telah Meninggal Dunia",
    "perawi_melayu": "Dari Saad bin Ubadah, bahawa beliau telah bertanya kepada Nabi SAW tentang satu nazar yang diwajibkan ke atas ibunya, tetapi ibunya telah meninggal dunia sebelum sempat menunaikannya.",
    "english_text": "\"Fulfill it on her behalf.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ أَبُو يُوسُفَ الصَّيْدَلاَنِيُّ، عَنْ عِيسَى، - وَهُوَ ابْنُ يُونُسَ - عَنِ الأَوْزَاعِيِّ، عَنِ الزُّهْرِيِّ، أَخْبَرَهُ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ سَعْدِ بْنِ عُبَادَةَ، أَنَّهُ اسْتَفْتَى النَّبِيَّ صلى الله عليه وسلم فِي نَذْرٍ كَانَ عَلَى أُمِّهِ فَتُوُفِّيَتْ قَبْلَ أَنْ تَقْضِيَهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اقْضِهِ عَنْهَا ‏\"‏‏.‏",
    "malay_translation": "Daripada Muhammad bin Ahmad Abu Yusuf As-Saydalani, daripada Isa (ibn Yunus), daripada Al-Auza’i, daripada Az- Zuhri, yang telah memberitahukan kepadanya daripada Ubaidillah bin Abdullah, daripada Ibnu Abbas, daripada Saad bin Ubadah, bahawa beliau telah bertanya kepada Nabi SAW tentang satu nazar yang diwajibkan ke atas ibunya, tetapi ibunya telah meninggal dunia sebelum sempat menunaikannya.  Maka Rasulullah SAW bersabda:  \"Tunaikanlah (nazar itu) bagi pihak (ibu)mu.\""
  },
  {
    "id": 18402,
    "hadith_number": 3666,
    "tajuk_hadith": "Menunaikan Nazar Ibu yang Meninggal Dunia",
    "perawi_melayu": "Daripada Saad bin Ubadah yang telah bertanya kepada Nabi SAW tentang nazar ibunya yang telah meninggal dunia sebelum ditunaikan.",
    "english_text": "\"Fulfill it on her behalf.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ صَدَقَةَ الْحِمْصِيُّ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ، عَنِ الأَوْزَاعِيِّ، عَنِ الزُّهْرِيِّ، أَخْبَرَهُ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ سَعْدِ بْنِ عُبَادَةَ، أَنَّهُ اسْتَفْتَى النَّبِيَّ صلى الله عليه وسلم فِي نَذْرٍ كَانَ عَلَى أُمِّهِ فَمَاتَتْ قَبْلَ أَنْ تَقْضِيَهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اقْضِهِ عَنْهَا ‏\"‏‏.‏",
    "malay_translation": "Daripada Muhammad bin Sadakah al-Himsi, katanya: Telah menceritakan kepada kami Muhammad bin Syu'aib daripada al-Auza'i, daripada az- Zuhri, baginda memberitakan kepadanya daripada Ubaidullah bin Abdullah, daripada Ibnu Abbas, daripada Saad bin Ubadah bahawa baginda telah bertanya kepada Nabi SAW tentang nazar yang di atas ibunya, lalu ibunya meninggal dunia sebelum menunaikannya.  Maka Rasulullah SAW bersabda: \"Tunaikanlah nazar itu bagi pihak ibunya.\""
  },
  {
    "id": 18403,
    "hadith_number": 3667,
    "tajuk_hadith": "Menunaikan Nazar Ibu yang Meninggal Dunia",
    "perawi_melayu": "Daripada Ibnu Abbas r.a.",
    "english_text": "\"Sa'd consulted the Messenger of Allah about a vow which his mother had to fulfill, but she died before doing so. The Messenger of Allah said: 'Fulfill it on her behalf.'\"",
    "arabic_text": "أَخْبَرَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ بْنِ مَزْيَدَ، قَالَ أَخْبَرَنِي أَبِي قَالَ، حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ أَخْبَرَنِي الزُّهْرِيُّ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ، أَخْبَرَهُ عَنِ ابْنِ عَبَّاسٍ، قَالَ اسْتَفْتَى سَعْدٌ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي نَذْرٍ كَانَ عَلَى أُمِّهِ فَتُوُفِّيَتْ قَبْلَ أَنْ تَقْضِيَهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اقْضِهِ عَنْهَا ‏\"‏‏.‏",
    "malay_translation": "Sa'd bertanya kepada Rasulullah SAW tentang satu nazar yang diikrarkan oleh ibunya, tetapi ibunya meninggal dunia sebelum sempat menunaikannya.  Rasulullah SAW bersabda: \"Tunaikanlah nazar itu bagi pihak ibunya.\""
  },
  {
    "id": 18404,
    "hadith_number": 3668,
    "tajuk_hadith": "Mengenai Pemenuhan Nazar Ibu Yang Telah Meninggal",
    "perawi_melayu": "Daripada Al-Harith bin Miskin, yang dibacakan kepadanya ketika aku mendengar, daripada Sufyan, daripada Az-Zuhri, daripada Ubaidullah bin Abdullah, daripada Ibnu Abbas,",
    "english_text": "\"From Sufyan, from Az-Zuhri, from 'Ubaidullah bin 'Abdullah, from Ibn 'Abbas, that Sa'd bin 'Ubadah consulted the Prophet about a vow which his mother had to fulfill, but she died before doing so. The Messenger of Allah said: 'Fulfill it on her behalf.'\"",
    "arabic_text": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنْ سُفْيَانَ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ سَعْدَ بْنَ عُبَادَةَ، اسْتَفْتَى النَّبِيَّ صلى الله عليه وسلم فِي نَذْرٍ كَانَ عَلَى أُمِّهِ فَتُوُفِّيَتْ قَبْلَ أَنْ تَقْضِيَهُ فَقَالَ ‏\n\"‏ اقْضِهِ عَنْهَا ‏\"‏‏.‏",
    "malay_translation": "Daripada Al-Harith bin Miskin (yang dibacakan kepadanya ketika aku mendengar), daripada Sufyan, daripada Az-Zuhri, daripada Ubaidullah bin Abdullah, daripada Ibnu Abbas, bahawa Saad bin Ubadah bertanya kepada Nabi SAW tentang satu nazar yang dipertanggungjawabkan kepada ibunya, tetapi ibunya meninggal dunia sebelum dapat menunaikannya.  Maka Rasulullah SAW bersabda:  \"Tunaikanlah (nazar itu) bagi pihak ibunya.\""
  },
  {
    "id": 18405,
    "hadith_number": 3669,
    "tajuk_hadith": "Menunaikan Nazar Ibu Yang Telah Meninggal Dunia",
    "perawi_melayu": "Muhammad bin Abdullah bin Yazid berkata:",
    "english_text": "\"Sufyan narrated to us from Az-Zuhri, from 'Ubaidullah bin 'Abdullah, from Ibn 'Abbas, that Sa'd said: 'My mother died and there was an (outstanding) vow that she had to fulfill. I asked the Prophet and he told me to fulfill it on her behalf.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ سَعْدٍ، أَنَّهُ قَالَ مَاتَتْ أُمِّي وَعَلَيْهَا نَذْرٌ فَسَأَلْتُ النَّبِيَّ صلى الله عليه وسلم فَأَمَرَنِي أَنْ أَقْضِيَهُ عَنْهَا‏.‏",
    "malay_translation": "Muhammad bin Abdullah bin Yazid meriwayatkan daripada Sufyan, daripada Az-Zuhri, daripada Ubaidullah bin Abdullah, daripada Ibnu Abbas, daripada Saad yang berkata: ‘Ibuku telah meninggal dunia dan ketika itu terdapat satu nazar yang belum ditunaikan olehnya.  Maka aku bertanya kepada Nabi SAW, lalu baginda memerintahkan aku untuk menunaikannya bagi pihak ibuku.’"
  },
  {
    "id": 18406,
    "hadith_number": 3670,
    "tajuk_hadith": "Menunaikan Nazar Ibu Yang Telah Meninggal Dunia",
    "perawi_melayu": "Daripada Ibnu Abbas r.a.",
    "english_text": "\"Sa'd bin 'Ubadah Al-Ansari consulted the Messenger of Allah about an (outstanding) vow that his mother had to fulfill, but she died before doing so. The Messenger of Allah said: 'Fulfill it on her behalf.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ اسْتَفْتَى سَعْدُ بْنُ عُبَادَةَ الأَنْصَارِيُّ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي نَذْرٍ كَانَ عَلَى أُمِّهِ فَتُوُفِّيَتْ قَبْلَ أَنْ تَقْضِيَهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اقْضِهِ عَنْهَا ‏\"‏‏.‏",
    "malay_translation": "Sa'd bin Ubadah Al-Ansari bertanya kepada Rasulullah SAW tentang satu nazar yang diwajibkan ke atas ibunya, tetapi ibunya meninggal dunia sebelum dapat menunaikannya.  Rasulullah SAW bersabda: \"Tunaikanlah nazar itu bagi pihak ibunya.\""
  },
  {
    "id": 18407,
    "hadith_number": 3671,
    "tajuk_hadith": "Menunaikan Nazar Ibu yang Meninggal Dunia",
    "perawi_melayu": "Daripada Ibnu Abbas r.a.",
    "english_text": "Sa'd bin 'Ubadah came to the Prophet and said: \"My mother has died and she had a vow to fulfill but she did not do so.\" He said: \"Fulfill it on her behalf.\"",
    "arabic_text": "أَخْبَرَنَا هَارُونُ بْنُ إِسْحَاقَ الْهَمْدَانِيُّ، عَنْ عَبْدَةَ، عَنْ هِشَامٍ، - هُوَ ابْنُ عُرْوَةَ - عَنْ بَكْرِ بْنِ وَائِلٍ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ جَاءَ سَعْدُ بْنُ عُبَادَةَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ إِنَّ أُمِّي مَاتَتْ وَعَلَيْهَا نَذْرٌ وَلَمْ تَقْضِهِ قَالَ ‏\n\"‏ اقْضِهِ عَنْهَا ‏\"‏‏.‏",
    "malay_translation": "Daripada Ibnu Abbas r.a.: Saad bin Ubadah datang kepada Nabi SAW lalu berkata, \"Ibu saya telah meninggal dunia dan dia mempunyai satu nazar tetapi tidak sempat ditunaikan.\" Baginda SAW bersabda, \"Tunaikanlah nazar itu bagi pihak ibunya.\""
  },
  {
    "id": 18408,
    "hadith_number": 3672,
    "tajuk_hadith": "Sedekah untuk Ibu yang telah Meninggal Dunia",
    "perawi_melayu": "Daripada Saad bin Ubadah ra.",
    "english_text": "\"I said: 'O Messenger of Allah, my mother has died; shall I give in charity on her behalf?' He said: 'Yes.' I said: 'What kind of charity is best?' He said: 'Providing drinking water.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامٍ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ سَعْدِ بْنِ عُبَادَةَ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ أُمِّي مَاتَتْ أَفَأَتَصَدَّقُ عَنْهَا قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ قُلْتُ فَأَىُّ الصَّدَقَةِ أَفْضَلُ قَالَ ‏\"‏ سَقْىُ الْمَاءِ ‏\"‏‏.‏",
    "malay_translation": "Aku berkata, \"Wahai Rasulullah, ibuku telah meninggal dunia. Bolehkah aku bersedekah bagi pihak beliau?\" Baginda menjawab, \"Boleh.\" Aku bertanya lagi, \"Apakah sedekah yang paling afdal?\" Baginda menjawab, \"Memberi air minuman.\""
  },
  {
    "id": 18409,
    "hadith_number": 3673,
    "tajuk_hadith": "Sedekah Terbaik: Memberi Minuman",
    "perawi_melayu": "Daripada Saad bin Ubadah, dia berkata:",
    "english_text": "\"I said: 'O Messenger of Allah, what kind of charity is best?' He said: 'Providing drinking water.'\"",
    "arabic_text": "أَخْبَرَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ، عَنْ وَكِيعٍ، عَنْ هِشَامٍ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ سَعْدِ بْنِ عُبَادَةَ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَىُّ الصَّدَقَةِ أَفْضَلُ قَالَ ‏\n\"‏ سَقْىُ الْمَاءِ ‏\"‏‏.‏",
    "malay_translation": "Aku berkata, \"Wahai Rasulullah, sedekah apakah yang paling afdal?\" Baginda menjawab, \"Memberi minuman.\""
  },
  {
    "id": 18410,
    "hadith_number": 3674,
    "tajuk_hadith": "Sedekah Bagi Ibu yang Telah Meninggal Dunia",
    "perawi_melayu": "Daripada Saad bin Ubadah bahawa ibunya telah meninggal dunia.  Baginda berkata:",
    "english_text": "\"O Messenger of Allah, my mother has died; can I give charity on her behalf?\" He said: \"Yes.\" He said: \"What kind of charity is best?\" He said: \"Providing drinking water.\" And that is the drinking-fountain of Sa'd in Al-Madinah.",
    "arabic_text": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ، عَنْ حَجَّاجٍ، قَالَ سَمِعْتُ شُعْبَةَ، يُحَدِّثُ عَنْ قَتَادَةَ، قَالَ سَمِعْتُ الْحَسَنَ، يُحَدِّثُ عَنْ سَعْدِ بْنِ عُبَادَةَ، أَنَّ أُمَّهُ، مَاتَتْ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أُمِّي مَاتَتْ أَفَأَتَصَدَّقُ عَنْهَا قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ قَالَ فَأَىُّ الصَّدَقَةِ أَفْضَلُ قَالَ ‏\"‏ سَقْىُ الْمَاءِ ‏\"‏‏.‏ فَتِلْكَ سِقَايَةُ سَعْدٍ بِالْمَدِينَةِ‏.‏",
    "malay_translation": "Saad bin Ubadah berkata, \"Wahai Rasulullah, ibu saya telah meninggal dunia.  Bolehkah saya bersedekah bagi pihak beliau?\" Baginda SAW menjawab, \"Ya.\"  Saad bertanya lagi, \"Apakah sedekah yang paling afdal?\" Baginda SAW menjawab, \"Memberi air minuman.\" Dan itulah telaga air Saad di Madinah."
  },
  {
    "id": 18411,
    "hadith_number": 3675,
    "tajuk_hadith": "Nasihat Rasulullah SAW kepada Abu Dzar al-Ghifari",
    "perawi_melayu": "Daripada Abu Dzar r.a.",
    "english_text": "\"The Messenger of Allah said to me: 'O Abu Dharr, I think that you are weak, and I like for you what I like for myself. Do not accept a position of Amir over two people, and do not agree to be the guardian of an orphan's property.'\"",
    "arabic_text": "أَخْبَرَنَا الْعَبَّاسُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ، عَنْ سَعِيدِ بْنِ أَبِي أَيُّوبَ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ، عَنْ سَالِمِ بْنِ أَبِي سَالِمٍ الْجَيْشَانِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَا أَبَا ذَرٍّ إِنِّي أَرَاكَ ضَعِيفًا وَإِنِّي أُحِبُّ لَكَ مَا أُحِبُّ لِنَفْسِي لاَ تَأَمَّرَنَّ عَلَى اثْنَيْنِ وَلاَ تَوَلَّيَنَّ عَلَى مَالِ يَتِيمٍ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda kepadaku: \"Wahai Abu Dzar, sesungguhnya aku melihat engkau lemah, dan aku menyayangi engkau sebagaimana aku menyayangi diriku sendiri. Janganlah engkau menjadi pemimpin (amir) ke atas dua orang, dan janganlah engkau menjadi penjaga harta anak yatim.\""
  },
  {
    "id": 18412,
    "hadith_number": 3676,
    "tajuk_hadith": "Penggunaan Harta Anak Yatim",
    "perawi_melayu": "Daripada Amr bin Shu'aib, daripada bapanya, daripada datuknya, bahawa seorang lelaki datang kepada Nabi SAW dan berkata:",
    "english_text": "\"I am poor and I do not have anything, and I have an orphan (under my care).\" He said: \"Eat from the property of your orphan without being extravagant, wasteful or keeping it as capital for yourself.\"",
    "arabic_text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ حُسَيْنٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ إِنِّي فَقِيرٌ لَيْسَ لِي شَىْءٌ وَلِي يَتِيمٌ‏.‏ قَالَ ‏\n\"‏ كُلْ مِنْ مَالِ يَتِيمِكَ غَيْرَ مُسْرِفٍ وَلاَ مُبَاذِرٍ وَلاَ مُتَأَثِّلٍ ‏\"‏‏.‏",
    "malay_translation": "Daripada Amr bin Shu'aib, daripada bapanya, daripada datuknya, bahawa seorang lelaki datang kepada Nabi SAW dan berkata, \"Saya seorang yang miskin, saya tidak mempunyai apa-apa, dan saya mempunyai seorang anak yatim.\"  Baginda SAW bersabda, \"Makanlah daripada harta anak yatimmu tanpa berlebih-lebihan, pembaziran atau menyimpannya sebagai modal untuk dirimu sendiri.\""
  },
  {
    "id": 18413,
    "hadith_number": 3677,
    "tajuk_hadith": "Pengurusan Harta Anak Yatim",
    "perawi_melayu": "Daripada Ibnu Abbas r.a.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ الصَّلْتِ، قَالَ حَدَّثَنَا أَبُو كُدَيْنَةَ، عَنْ عَطَاءٍ، - وَهُوَ ابْنُ السَّائِبِ - عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمَّا نَزَلَتْ هَذِهِ الآيَةُ ‏{‏وَلاَ تَقْرَبُوا مَالَ الْيَتِيمِ إِلاَّ بِالَّتِي هِيَ أَحْسَنُ‏}‏ وَ‏{‏إِنَّ الَّذِينَ يَأْكُلُونَ أَمْوَالَ الْيَتَامَى ظُلْمًا‏}‏ قَالَ اجْتَنَبَ النَّاسُ مَالَ الْيَتِيمِ وَطَعَامَهُ فَشَقَّ ذَلِكَ عَلَى الْمُسْلِمِينَ فَشَكَوْا ذَلِكَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَنْزَلَ اللَّهُ ‏{‏وَيَسْأَلُونَكَ عَنِ الْيَتَامَى قُلْ إِصْلاَحٌ لَهُمْ خَيْرٌ‏}‏ إِلَى قَوْلِهِ ‏{‏لأَعْنَتَكُمْ‏}‏‏.‏",
    "malay_translation": "Daripada Ibnu Abbas r.a., bahawa setelah ayat-ayat ini diturunkan:  \"Dan janganlah kamu mendekati harta anak yatim melainkan dengan cara yang lebih baik.\" dan  \"Sesungguhnya orang-orang yang memakan harta anak yatim dengan zalim.\"  maka manusia menjauhi harta dan makanan anak yatim.  Hal ini menyebabkan kesukaran kepada orang Islam, lalu mereka mengadu kepada Nabi SAW.  Maka Allah menurunkan ayat:  \"Dan mereka bertanya kepadamu tentang anak yatim, katakanlah:  Memperbaiki (urusan) mereka adalah lebih baik.\" sehingga akhir ayat tersebut."
  },
  {
    "id": 18414,
    "hadith_number": 3678,
    "tajuk_hadith": "Pengurusan Harta Anak Yatim",
    "perawi_melayu": "Daripada Ibnu Abbas -berkenaan ayat:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عِمْرَانُ بْنُ عُيَيْنَةَ، قَالَ حَدَّثَنَا عَطَاءُ بْنُ السَّائِبِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، فِي قَوْلِهِ ‏{‏إِنَّ الَّذِينَ يَأْكُلُونَ أَمْوَالَ الْيَتَامَى ظُلْمًا‏}‏ قَالَ كَانَ يَكُونُ فِي حِجْرِ الرَّجُلِ الْيَتِيمَ فَيَعْزِلُ لَهُ طَعَامَهُ وَشَرَابَهُ وَآنِيَتَهُ فَشَقَّ ذَلِكَ عَلَى الْمُسْلِمِينَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏وَإِنْ تُخَالِطُوهُمْ فَإِخْوَانُكُمْ‏}‏ ‏{‏فِي الدِّينِ‏}‏ فَأَحَلَّ لَهُمْ خُلْطَتَهُمْ‏.‏",
    "malay_translation": "Kami diberitakan oleh Amru bin Ali, katanya: Telah menceritakan kepada kami Imran bin Uyainah, katanya: Telah menceritakan kepada kami Ath-Thaa bin As-Saib, daripada Sa’id bin Jubair, daripada Ibnu Abbas, berkenaan firman Allah SWT: {Sesungguhnya orang-orang yang memakan harta anak-anak yatim dengan zalim.}  Ibnu Abbas berkata:  Dulu, anak yatim di bawah jagaan seseorang, maka orang itu akan memisahkan makanan, minuman dan perkakasnya.  Hal ini menyusahkan orang Islam, maka Allah SWT menurunkan ayat: {…dan jika kamu bergaul dengan mereka (anak yatim), maka mereka adalah saudara-saudaramu…} {…dalam agama…}  Maka Allah menghalalkan pergaulan dengan mereka."
  },
  {
    "id": 18415,
    "hadith_number": 3679,
    "tajuk_hadith": "Tujuh Dosa Yang Membinasakan",
    "perawi_melayu": "Daripada Abu Hurairah, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Avoid the seven sins that doom one to Hell.\" It was said: \"O Messenger of Allah, what are they?\" He said: \"Associating others with Allah (Shirk), magic, killing a soul whom Allah has forbidden killing, except in cases dictated by Islamic law, consuming Riba, consuming the property of orphans, fleeing on the day of the march (to battlefield), and slandering chaste women who never even think of anything touching their chastity and are good believers.\"",
    "arabic_text": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ سُلَيْمَانَ بْنِ بِلاَلٍ، عَنْ ثَوْرِ بْنِ زَيْدٍ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ اجْتَنِبُوا السَّبْعَ الْمُوبِقَاتِ ‏\"‏‏.‏ قِيلَ يَا رَسُولَ اللَّهِ مَا هِيَ قَالَ ‏\"‏ الشِّرْكُ بِاللَّهِ وَالشُّحُّ وَقَتْلُ النَّفْسِ الَّتِي حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ وَأَكْلُ الرِّبَا وَأَكْلُ مَالِ الْيَتِيمِ وَالتَّوَلِّي يَوْمَ الزَّحْفِ وَقَذْفُ الْمُحْصَنَاتِ الْغَافِلاَتِ الْمُؤْمِنَاتِ ‏\"‏‏.‏",
    "malay_translation": "Jauhilah tujuh dosa yang membinasakan.  Ditanya, \"Wahai Rasulullah, apakah dosa-dosa itu?\" Baginda menjawab, \"Syirik kepada Allah, sihir, membunuh jiwa yang diharamkan Allah kecuali mengikut hukum Islam, memakan riba, memakan harta anak yatim, melarikan diri pada hari pertempuran, dan menuduh wanita yang baik-baik dan menjaga kehormatan diri mereka yang beriman dengan zina.\""
  }
]
