[
  {
    "id": 19452,
    "hadith_number": 4716,
    "tajuk_hadith": "Qasamah Pertama pada Zaman Jahiliyyah dan Penyelesaiannya",
    "perawi_melayu": "Diriwayatkan daripada Ibn 'Abbas RA berkata:",
    "english_text": "\"The first instance of Qasamah during the Jahiliyyah involved a man from Banu Hashim who was employed by a man from Quraish, from another branch of the tribe. He went out with him, driving his camels and another man from Banu Hashim passed by them. The leather rope of that man's bag broke, so he said (to the hired worker): 'Help me by giving me a rope with which to tie the handle of my bag, lest the camels run away from me. 'So he gave him a rope and he tied his gab with it. When they halted, all the camels' legs were hobbled except one camel. The one who had hired him said: 'Why is his camel, out of all of them, not hobbled? He said: 'There is no rope for it. He said: 'Where is its rope? He said: A man from Banu Hashim passed by and the leather rope of his bag had broken, and he asked me to help him; he said: \"Help me by giving me a rope with which to tie the handle of my bag lest the camels run away from me, so I gave him a rope . \" He struck him with a stick, which led to his death.Then a man from Yemen passed by him (the man from Banu Hashim, (the man from Banu Hashim, just before he died) and he (the Hashimi man) said: 'Are you going to attend the Pilgrimage? He said: 'I do not think I will attend it, but perhaps I will attend it.' He said: 'Will you convey a message from me once in your lifetime? He said: 'Yes. 'He said: 'If you attend the pilgrimage, then call out, O family of Quraish! If they respond, then call out, O family of Hashim! If they respond, then ask for Abu Talib, and tell him that so and so killed me for a rope.' Then the hired worker died. When the one who had hired him cam, Abu Talib went to him and said: 'What happened to our companion? He said: 'He fell sick and I took good care of him, but he died, so I stopped and buried him.' He said: 'He deserved that from you. 'Some time passed, then the Yemeni man who had been asked to convey the message arrived at the time of the pilgrimage. He said: 'O family of Quraish! And they said: 'Here is Quraish.' He said: 'O family of Banu Hashim! They said: 'Here is Banu Hashim.' He said\" 'Where is Abu Talib? He said: 'Here is Abu Talib.' He said: 'so and so asked me to convey a message to you, that so and so killed him for a camel's rope.' Abu Talib went to him and said\" 'Choose one of three alternatives that we are offering you. If you wish, you may give us one hundred camels, because you killed our companion by mistake: or if you wish, fifty of your men may swear an oath that you did not kill him; or if you wish, we will kill you in retaliation. 'He went to his people and told them about that, and they said: 'We will swear the oath.' Then a woman from Banu Hashim, who was married to one of their men and had born him a child, came to Abu Talib and said:' O Abu Talib, I wish that my son, who is one of these fifty men, should be excused from having to take the oath., So the excused him. Then one of the men came to him and said: 'O Abu Talib, you want fifty men to take the oath in lieu of one hundred camels, which means that each man may give two camels instead, so here are two camels; take them from me, and do not make me take the oath.' So he accepted them, and did not make him take the oath. Then forty-eight men came and took the oath.\" Ibn 'Abbas said: \"By the One in Whose hand is my soul, by the time a year has passed, none of those forty-eight men remained alive.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى، قَالَ حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا قَطَنٌ أَبُو الْهَيْثَمِ، قَالَ حَدَّثَنَا أَبُو يَزِيدَ الْمَدَنِيُّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أَوَّلُ قَسَامَةٍ كَانَتْ فِي الْجَاهِلِيَّةِ كَانَ رَجُلٌ مِنْ بَنِي هَاشِمٍ اسْتَأْجَرَ رَجُلاً مِنْ قُرَيْشٍ مِنْ فَخِذِ أَحَدِهِمْ - قَالَ - فَانْطَلَقَ مَعَهُ فِي إِبِلِهِ فَمَرَّ بِهِ رَجُلٌ مِنْ بَنِي هَاشِمٍ قَدِ انْقَطَعَتْ عُرْوَةُ جُوَالِقِهِ فَقَالَ أَغِثْنِي بِعِقَالٍ أَشُدُّ بِهِ عُرْوَةَ جُوَالِقِي لاَ تَنْفِرُ الإِبِلُ فَأَعْطَاهُ عِقَالاً يَشُدُّ بِهِ عُرْوَةَ جُوَالِقِهِ فَلَمَّا نَزَلُوا وَعُقِلَتِ الإِبِلُ إِلاَّ بَعِيرًا وَاحِدًا فَقَالَ الَّذِي اسْتَأْجَرَهُ مَا شَأْنُ هَذَا الْبَعِيرِ لَمْ يُعْقَلْ مِنْ بَيْنِ الإِبِلِ قَالَ لَيْسَ لَهُ عِقَالٌ ‏.‏ قَالَ فَأَيْنَ عِقَالُهُ قَالَ مَرَّ بِي رَجُلٌ مِنْ بَنِي هَاشِمٍ قَدِ انْقَطَعَتْ عُرْوَةَ جُوَالِقِهِ فَاسْتَغَاثَنِي فَقَالَ أَغِثْنِي بِعِقَالٍ أَشُدُّ بِهِ عُرْوَةَ جُوَالِقِي لاَ تَنْفِرُ الإِبِلُ ‏.‏ فَأَعْطَيْتُهُ عِقَالاً فَحَذَفَهُ بِعَصًا كَانَ فِيهَا أَجَلُهُ فَمَرَّ بِهِ رَجُلٌ مِنْ أَهْلِ الْيَمَنِ فَقَالَ أَتَشْهَدُ الْمَوْسِمَ قَالَ مَا أَشْهَدُ وَرُبَّمَا شَهِدْتُ ‏.‏ قَالَ هَلْ أَنْتَ مُبَلِّغٌ عَنِّي رِسَالَةً مَرَّةً مِنَ الدَّهْرِ قَالَ نَعَمْ ‏.‏ قَالَ إِذَا شَهِدْتَ الْمَوْسِمَ فَنَادِ يَا آلَ قُرَيْشٍ فَإِذَا أَجَابُوكَ فَنَادِ يَا آلَ هَاشِمٍ فَإِذَا أَجَابُوكَ فَسَلْ عَنْ أَبِي طَالِبٍ فَأَخْبِرْهُ أَنَّ فُلاَنًا قَتَلَنِي فِي عِقَالٍ وَمَاتَ الْمُسْتَأْجَرُ فَلَمَّا قَدِمَ الَّذِي اسْتَأْجَرَهُ أَتَاهُ أَبُو طَالِبٍ فَقَالَ مَا فَعَلَ صَاحِبُنَا قَالَ مَرِضَ فَأَحْسَنْتُ الْقِيَامَ عَلَيْهِ ثُمَّ مَاتَ فَنَزَلْتُ فَدَفَنْتُهُ ‏.‏ فَقَالَ كَانَ ذَا أَهْلَ ذَاكَ مِنْكَ ‏.‏ فَمَكُثَ حِينًا ثُمَّ إِنَّ الرَّجُلَ الْيَمَانِيَّ الَّذِي كَانَ أَوْصَى إِلَيْهِ أَنْ يُبَلِّغَ عَنْهُ وَافَى الْمَوْسِمَ قَالَ يَا آلَ قُرَيْشٍ ‏.‏ قَالُوا هَذِهِ قُرَيْشٌ ‏.‏ قَالَ يَا آلَ بَنِي هَاشِمٍ ‏.‏ قَالُوا هَذِهِ بَنُو هَاشِمٍ ‏.‏ قَالَ أَيْنَ أَبُو طَالِبٍ قَالَ هَذَا أَبُو طَالِبٍ ‏.‏ قَالَ أَمَرَنِي فُلاَنٌ أَنْ أُبَلِّغَكَ رِسَالَةً أَنَّ فُلاَنًا قَتَلَهُ فِي عِقَالٍ ‏.‏ فَأَتَاهُ أَبُو طَالِبٍ فَقَالَ اخْتَرْ مِنَّا إِحْدَى ثَلاَثٍ إِنْ شِئْتَ أَنْ تُؤَدِّيَ مِائَةً مِنَ الإِبِلِ فَإِنَّكَ قَتَلْتَ صَاحِبَنَا خَطَأً وَإِنْ شِئْتَ يَحْلِفُ خَمْسُونَ مِنْ قَوْمِكَ أَنَّكَ لَمْ تَقْتُلْهُ فَإِنْ أَبَيْتَ قَتَلْنَاكَ بِهِ ‏.‏ فَأَتَى قَوْمَهُ فَذَكَرَ ذَلِكَ لَهُمْ فَقَالُوا نَحْلِفُ ‏.‏ فَأَتَتْهُ امْرَأَةٌ مِنْ بَنِي هَاشِمٍ كَانَتْ تَحْتَ رَجُلٍ مِنْهُمْ قَدْ وَلَدَتْ لَهُ فَقَالَتْ يَا أَبَا طَالِبٍ أُحِبُّ أَنْ تُجِيزَ ابْنِي هَذَا بِرَجُلٍ مِنَ الْخَمْسِينَ وَلاَ تُصْبِرْ يَمِينَهُ ‏.‏ فَفَعَلَ فَأَتَاهُ رَجُلٌ مِنْهُمْ فَقَالَ يَا أَبَا طَالِبٍ أَرَدْتَ خَمْسِينَ رَجُلاً أَنْ يَحْلِفُوا مَكَانَ مِائَةٍ مِنَ الإِبِلِ يُصِيبُ كُلُّ رَجُلٍ بَعِيرَانِ فَهَذَانِ بَعِيرَانِ فَاقْبَلْهُمَا عَنِّي وَلاَ تُصْبِرْ يَمِينِي حَيْثُ تُصْبَرُ الأَيْمَانُ ‏.‏ فَقَبِلَهُمَا وَجَاءَ ثَمَانِيَةٌ وَأَرْبَعُونَ رَجُلاً حَلَفُوا ‏.‏ قَالَ ابْنُ عَبَّاسٍ فَوَالَّذِي نَفْسِي بِيَدِهِ مَا حَالَ الْحَوْلُ وَمِنَ الثَّمَانِيَةِ وَالأَرْبَعِينَ عَيْنٌ تَطْرِفُ ‏.‏",
    "malay_translation": "Qasamah pertama pada zaman Jahiliyyah melibatkan seorang lelaki daripada Bani Hashim yang diupah oleh seorang lelaki daripada Quraisy, dari cabang suku yang lain. Dia keluar bersamanya, menggiring untanya dan seorang lelaki lain daripada Bani Hashim lalu di situ. Tali kulit beg lelaki itu putus, jadi dia berkata (kepada pekerja upahan itu): 'Tolong saya dengan memberikan saya tali untuk mengikat pemegang beg saya, supaya unta tidak lari daripada saya.' Jadi dia memberinya tali dan dia mengikat begnya dengannya. Apabila mereka berhenti, semua kaki unta diikat kecuali seekor unta. Orang yang mengupahnya berkata: 'Kenapa unta ini, daripada semua unta, tidak diikat? Dia berkata: 'Tidak ada tali untuknya.' Dia berkata: 'Di mana talinya? Dia berkata: Seorang lelaki dari Bani Hashim lalu dan tali kulit begnya telah putus, dan dia meminta saya membantunya; dia berkata: \"Tolong saya dengan memberikan saya tali untuk mengikat pemegang beg saya supaya unta tidak lari daripada saya, jadi saya memberinya tali.\" Dia memukulnya dengan kayu, yang menyebabkan kematiannya. Kemudian seorang lelaki dari Yaman lalu di situ (lelaki dari Bani Hashim, (lelaki dari Bani Hashim, sejurus sebelum dia meninggal dunia) dan dia (lelaki Hashimi) berkata: 'Adakah anda akan menghadiri Haji? Dia berkata: 'Saya rasa saya tidak akan menghadirinya, tetapi mungkin saya akan menghadirinya.' Dia berkata: 'Adakah anda akan menyampaikan pesan daripada saya sekali dalam hidup anda? Dia berkata: 'Ya.' Dia berkata: 'Jika anda menghadiri haji, maka serulah, Wahai keluarga Quraisy! Jika mereka menjawab, maka serulah, Wahai keluarga Hashim! Jika mereka menjawab, maka tanyakan tentang Abu Talib, dan beritahu dia bahawa si fulan telah membunuh saya kerana tali.' Kemudian pekerja upahan itu meninggal dunia. Apabila orang yang mengupahnya datang, Abu Talib pergi kepadanya dan berkata: 'Apa yang terjadi kepada sahabat kita? Dia berkata: 'Dia jatuh sakit dan saya menjaganya dengan baik, tetapi dia meninggal dunia, jadi saya berhenti dan mengebumikannya.' Dia berkata: 'Dia berhak mendapat itu daripada anda.' Beberapa waktu berlalu, kemudian lelaki Yaman yang telah diminta untuk menyampaikan pesan itu tiba pada waktu haji. Dia berkata: 'Wahai keluarga Quraisy!' Dan mereka berkata: 'Di sini ada Quraisy.' Dia berkata: 'Wahai keluarga Bani Hashim!' Mereka berkata: 'Di sini ada Bani Hashim.' Dia berkata: 'Di mana Abu Talib? Dia berkata: 'Di sini ada Abu Talib.' Dia berkata: 'Si fulan meminta saya menyampaikan pesan kepada anda, bahawa si fulan membunuhnya kerana tali unta.' Abu Talib pergi kepadanya dan berkata: 'Pilih salah satu daripada tiga alternatif yang kami tawarkan kepada anda. Jika anda mahu, anda boleh memberi kami seratus ekor unta, kerana anda membunuh sahabat kami secara tidak sengaja; atau jika anda mahu, lima puluh orang lelaki anda boleh bersumpah bahawa anda tidak membunuhnya; atau jika anda mahu, kami akan membunuh anda sebagai balasan.' Dia pergi kepada kaumnya dan memberitahu mereka tentang hal itu, dan mereka berkata: 'Kami akan bersumpah.' Kemudian seorang wanita dari Bani Hashim, yang berkahwin dengan salah seorang lelaki mereka dan telah melahirkan seorang anak untuknya, datang kepada Abu Talib dan berkata: 'Wahai Abu Talib, saya ingin anak saya, yang merupakan salah seorang daripada lima puluh lelaki ini, dikecualikan daripada terpaksa bersumpah., Jadi dia mengecualikannya. Kemudian salah seorang lelaki datang kepadanya dan berkata: 'Wahai Abu Talib, anda mahu lima puluh lelaki bersumpah sebagai ganti seratus ekor unta, yang bermaksud bahawa setiap lelaki boleh memberi dua ekor unta sebagai ganti, jadi ini ada dua ekor unta; terimalah daripada saya, dan jangan membuat saya bersumpah.' Jadi dia menerimanya, dan tidak membuatnya bersumpah. Kemudian empat puluh lapan lelaki datang dan bersumpah.\" Ibn 'Abbas berkata: \"Demi Zat yang jiwaku berada di tangan-Nya, pada saat setahun telah berlalu, tidak ada seorang pun daripada empat puluh lapan lelaki itu yang masih hidup.\""
  },
  {
    "id": 19453,
    "hadith_number": 4717,
    "tajuk_hadith": "Pengiktirafan Qasamah Seperti Zaman Jahiliyyah",
    "perawi_melayu": "Abu Salamah dan Sulaiman bin Yasar meriwayatkan daripada seorang Sahabat Rasulullah SAW, seorang daripada Ansar, bahawa:",
    "english_text": "the Messenger or Allah approved of Qasamah as it had been during the Jahiliyyah.",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، وَيُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، - قَالَ أَحْمَدُ بْنُ عَمْرٍو - قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، وَسُلَيْمَانُ بْنُ يَسَارٍ، عَنْ رَجُلٍ، مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنَ الأَنْصَارِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَقَرَّ الْقَسَامَةَ عَلَى مَا كَانَتْ عَلَيْهِ فِي الْجَاهِلِيَّةِ ‏.‏",
    "malay_translation": "Rasulullah SAW mengiktiraf Qasamah sebagaimana yang telah berlaku pada zaman Jahiliyyah."
  },
  {
    "id": 19454,
    "hadith_number": 4718,
    "tajuk_hadith": "Qasamah (Sumpah) di Zaman Jahiliyyah dan Pengiktirafan Rasulullah SAW",
    "perawi_melayu": "Diriwayatkan daripada Abu Salamah dan Sulaiman bin Yasar, daripada beberapa orang Sahabat Rasulullah SAW:",
    "english_text": "Qasamah existed during the Jahiliyyah and the Messenger of Allah approved of it as it had been during the Jahiliyyah, and he ruled accordingly among some of the Ansar concerning a victim whom they claimed the Jews of Khaibar had Killed. (Sahih)\nMa'mar contradicted the two of them.",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ هَاشِمٍ، قَالَ حَدَّثَنَا الْوَلِيدُ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، وَسُلَيْمَانَ بْنِ يَسَارٍ، عَنْ أُنَاسٍ، مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّ الْقَسَامَةَ كَانَتْ فِي الْجَاهِلِيَّةِ فَأَقَرَّهَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى مَا كَانَتْ عَلَيْهِ فِي الْجَاهِلِيَّةِ وَقَضَى بِهَا بَيْنَ أُنَاسٍ مِنَ الأَنْصَارِ فِي قَتِيلٍ ادَّعَوْهُ عَلَى يَهُودِ خَيْبَرَ ‏.‏ خَالَفَهُمَا مَعْمَرٌ ‏.‏",
    "malay_translation": "Qasamah (sumpah) telah wujud pada zaman Jahiliyyah dan Rasulullah SAW mengiktirafnya sebagaimana ia berlaku pada zaman Jahiliyyah, dan baginda memutuskan hukum dengannya di antara beberapa orang Ansar berkenaan seorang mangsa yang mereka dakwa orang Yahudi Khaibar telah membunuhnya. (Sahih)\nMa'mar bercanggah dengan kedua-duanya."
  },
  {
    "id": 19455,
    "hadith_number": 4719,
    "tajuk_hadith": "Qasamah (Sumpah) Diterima Pakai Selepas Jahiliyyah: Kes Pembunuhan Seorang Ansar oleh Yahudi",
    "perawi_melayu": "Diriwayatkan daripada Ibn Al-Musayyab:",
    "english_text": "\"Qasamah existed during the Jahiliyyah, then the Messenger of Allah confirmed it in the case of an Ansari who was found slain in the dry well of the jews, and Ansar said: \"The Jews kill our companion.\"'",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَنْبَأَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيَّبِ، قَالَ كَانَتِ الْقَسَامَةُ فِي الْجَاهِلِيَّةِ ثُمَّ أَقَرَّهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الأَنْصَارِيِّ الَّذِي وُجِدَ مَقْتُولاً فِي جُبِّ الْيَهُودِ فَقَالَتِ الأَنْصَارُ الْيَهُودُ قَتَلُوا صَاحِبَنَا ‏.‏",
    "malay_translation": "\"Qasamah (sumpah) telah wujud pada zaman Jahiliyyah, kemudian Rasulullah SAW mengesahkannya dalam kes seorang Ansar yang ditemui terbunuh di dalam perigi kering milik orang Yahudi, dan Ansar berkata: \"Orang Yahudi membunuh sahabat kami.\"'\""
  },
  {
    "id": 19456,
    "hadith_number": 4720,
    "tajuk_hadith": "Pembayaran Diyat untuk Pembunuhan di Khaibar dan Sumpah Yahudi",
    "perawi_melayu": "Diriwayatkan daripada Sahl bin Abi Hathmah bahawa:",
    "english_text": "'Abdullah bin Sahl and Muhayysah set out for Khaibar because of some problem that had arisen. Someone came to Muhayysah and he told him that 'Abdullah bin Sahl had been Killed and thrown into a pit, or a well. He came to the Jews and said: \"By Allah, you killed him. \" They said: \"By Allah, we did not kill him.\"Then he went back to the Messenger of Allah and told him about that. Then he and Huwayysah  - his brother who was older than him - and 'Abdur-Rahman bin Sahl, came (to the Prophet). Muhayysah, who was the one who had been at Khaibar, began to speak, but the messenger of Allah said: \"Let the elder speak first,\" So Huwayysah elder speaks first.\" So Huwayysah spoke, then Muhayysah spoke. The Messenger of Allah said: \"Either (the Jews) will pay the Diyah for your comanion, or war will be declared on them.\" The Messenger of Allah sent a letter to that effect (to the Jews) and they wrote back saying: \"By Allah, we did not kill him.\" The Messenger of Allah said to Huwayysah. Muhayysah and 'Abdur-Rahman: \"Will you swear an oath establishing your claim to the blood money of your companion?\" They said: \"No.\" He said: \"Should the jews swear an oath for you? They said: \"They are not Muslims.\" So the Messenger of Allah paid (the Diyah) himself, and he sent one hundred she-camels to their abodes. Sahl said: \"A red she-camel from among them kicked me.\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ، عَنْ أَبِي لَيْلَى بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الأَنْصَارِيِّ، أَنَّ سَهْلَ بْنَ أَبِي حَثْمَةَ، أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ وَمُحَيِّصَةَ خَرَجَا إِلَى خَيْبَرَ مِنْ جَهْدٍ أَصَابَهُمَا فَأُتِيَ مُحَيِّصَةُ فَأُخْبِرَ أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ قَدْ قُتِلَ وَطُرِحَ فِي فَقِيرٍ أَوْ عَيْنٍ فَأَتَى يَهُودَ فَقَالَ أَنْتُمْ وَاللَّهِ قَتَلْتُمُوهُ ‏.‏ فَقَالُوا وَاللَّهِ مَا قَتَلْنَاهُ ‏.‏ ثُمَّ أَقْبَلَ حَتَّى قَدِمَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ ذَلِكَ لَهُ ثُمَّ أَقْبَلَ هُوَ وَحُوَيِّصَةُ وَهُوَ أَخُوهُ أَكْبَرُ مِنْهُ وَعَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ فَذَهَبَ مُحَيِّصَةُ لِيَتَكَلَّمَ وَهُوَ الَّذِي كَانَ بِخَيْبَرَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَبِّرْ كَبِّرْ ‏\"‏ ‏.‏ وَتَكَلَّمَ حُوَيِّصَةُ ثُمَّ تَكَلَّمَ مُحَيِّصَةُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِمَّا أَنْ يَدُوا صَاحِبَكُمْ وَإِمَّا أَنْ يُؤْذَنُوا بِحَرْبٍ ‏\"‏ ‏.‏ فَكَتَبَ النَّبِيُّ صلى الله عليه وسلم فِي ذَلِكَ فَكَتَبُوا إِنَّا وَاللَّهِ مَا قَتَلْنَاهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِحُوَيِّصَةَ وَمُحَيِّصَةَ وَعَبْدِ الرَّحْمَنِ ‏\"‏ تَحْلِفُونَ وَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ ‏\"‏ ‏.‏ قَالُوا لاَ ‏.‏ قَالَ ‏\"‏ فَتَحْلِفُ لَكُمْ يَهُودُ ‏\"‏ ‏.‏ قَالُوا لَيْسُوا مُسْلِمِينَ ‏.‏ فَوَدَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ عِنْدِهِ فَبَعَثَ إِلَيْهِمْ بِمِائَةِ نَاقَةٍ حَتَّى أُدْخِلَتْ عَلَيْهِمُ الدَّارَ ‏.‏ قَالَ سَهْلٌ لَقَدْ رَكَضَتْنِي مِنْهَا نَاقَةٌ حَمْرَاءُ ‏.‏",
    "malay_translation": "Abdullah bin Sahl dan Muhayysah pergi ke Khaibar kerana suatu masalah yang timbul. Seseorang datang kepada Muhayysah dan memberitahunya bahawa Abdullah bin Sahl telah dibunuh dan dicampak ke dalam lubang atau perigi. Dia datang kepada orang Yahudi dan berkata: \"Demi Allah, kamu telah membunuhnya.\" Mereka berkata: \"Demi Allah, kami tidak membunuhnya.\" Kemudian dia kembali kepada Rasulullah SAW dan memberitahunya tentang perkara itu. Kemudian dia, Huwayysah - abangnya yang lebih tua daripadanya - dan 'Abdur-Rahman bin Sahl, datang (kepada Nabi SAW). Muhayysah, yang merupakan orang yang berada di Khaibar, mula bercakap, tetapi Rasulullah SAW berkata: \"Biarkan yang lebih tua bercakap dahulu,\" Jadi Huwayysah bercakap dahulu.\" Kemudian Muhayysah bercakap. Rasulullah SAW bersabda: \"Sama ada (orang Yahudi) membayar Diyat untuk sahabat kamu, atau perang akan diisytiharkan ke atas mereka.\" Rasulullah SAW menghantar surat mengenai perkara itu (kepada orang Yahudi) dan mereka membalas dengan berkata: \"Demi Allah, kami tidak membunuhnya.\" Rasulullah SAW berkata kepada Huwayysah, Muhayysah dan 'Abdur-Rahman: \"Adakah kamu akan bersumpah untuk mengesahkan tuntutan kamu ke atas wang darah sahabat kamu?\" Mereka berkata: \"Tidak.\" Baginda bersabda: \"Haruskah orang Yahudi bersumpah untuk kamu?\" Mereka berkata: \"Mereka bukan orang Islam.\" Maka Rasulullah SAW membayar (Diyat) sendiri, dan baginda menghantar seratus ekor unta betina ke tempat kediaman mereka. Sahl berkata: \"Seekor unta betina berwarna merah dari kalangan mereka menendang saya.\""
  },
  {
    "id": 19457,
    "hadith_number": 4721,
    "tajuk_hadith": "Pembayaran Diyat untuk Pembunuhan Abdullah bin Sahl di Khaibar",
    "perawi_melayu": "Diriwayatkan daripada Abu Laila bin 'Abdullah bin 'Abdur-Rahman bin Sahl, daripada Sahl bin Abi Hathmah, bahawa:",
    "english_text": "he informed him, ans some men among the elders of his people, that \"Abdullah bin Sahl and Muhayysah set out for Khaibar because of some problem that had arisen. Someone came to Muhayysah, and he told him that 'Abdullah bin Sahl had been killed and thrown into a pit or well. He came to the Jews and said: \"By Allah, you killed him.\" They said: \"By Allah, we did not kill him.\" Then he went baack to his people and told them about that. Then he and his brother Huwayysah, who was older than him, and 'Abdur-Rahman bin Sahl, came (to the prophet). Muhayysah, who was the one who had been at Khaibar, bnegan to speak, but the Messenger of Allah said: \"Let the elder speak first.\" So Huwayysah spoke, then Muhayysah spoke. The Messenger of Allah said: \"Either (the Jews) will pay the Diyah for your companion, or war will be declared on them.\" The Messenger of Allah sent a letter to that effect (to the Jews) and they wrote back saying: \"By Allah, we did not kill him.\" The Messenger of Allah and 'Abdur-Rahman: \"Will you swear an oath establishing your claim to the blood money of your companion?\" They said: \"No.\" He said: \"Should the Jews swear an oath for you?\" They said: \"They are not Muslims.\" So the Messenger of Allah paid it himself, and he sent one hundred she-camels to their abodes. Sahl said: \"A red she-camel from among them kicked me.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ أَنْبَأَنَا ابْنُ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي لَيْلَى بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَهْلٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، أَنَّهُ أَخْبَرَهُ وَرِجَالٌ، مِنْ كُبَرَاءِ قَوْمِهِ أَنَّ عَبْدَ، اللَّهِ بْنَ سَهْلٍ وَمُحَيِّصَةَ خَرَجَا إِلَى خَيْبَرَ مِنْ جَهْدٍ أَصَابَهُمْ فَأُتِيَ مُحَيِّصَةُ فَأُخْبِرَ أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ قَدْ قُتِلَ وَطُرِحَ فِي فَقِيرٍ أَوْ عَيْنٍ فَأَتَى يَهُودَ وَقَالَ أَنْتُمْ وَاللَّهِ قَتَلْتُمُوهُ قَالُوا وَاللَّهِ مَا قَتَلْنَاهُ ‏.‏ فَأَقْبَلَ حَتَّى قَدِمَ عَلَى قَوْمِهِ فَذَكَرَ لَهُمْ ثُمَّ أَقْبَلَ هُوَ وَأَخُوهُ حُوَيِّصَةُ وَهُوَ أَكْبَرُ مِنْهُ وَعَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ فَذَهَبَ مُحَيِّصَةُ لِيَتَكَلَّمَ وَهُوَ الَّذِي كَانَ بِخَيْبَرَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِمُحَيِّصَةَ ‏\"‏ كَبِّرْ كَبِّرْ ‏\"‏ ‏.‏ يُرِيدُ السِّنَّ فَتَكَلَّمَ حُوَيِّصَةُ ثُمَّ تَكَلَّمَ مُحَيِّصَةُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِمَّا أَنْ يَدُوا صَاحِبَكُمْ وَإِمَّا أَنْ يُؤْذَنُوا بِحَرْبٍ ‏\"‏ ‏.‏ فَكَتَبَ إِلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ذَلِكَ فَكَتَبُوا إِنَّا وَاللَّهِ مَا قَتَلْنَاهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِحُوَيِّصَةَ وَمُحَيِّصَةَ وَعَبْدِ الرَّحْمَنِ ‏\"‏ أَتَحْلِفُونَ وَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ ‏\"‏ ‏.‏ قَالُوا لاَ ‏.‏ قَالَ ‏\"‏ فَتَحْلِفُ لَكُمْ يَهُودُ ‏\"‏ ‏.‏ قَالُوا لَيْسُوا بِمُسْلِمِينَ ‏.‏ فَوَدَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ عِنْدِهِ فَبَعَثَ إِلَيْهِمْ بِمِائَةِ نَاقَةٍ حَتَّى أُدْخِلَتْ عَلَيْهِمُ الدَّارَ ‏.‏ قَالَ سَهْلٌ لَقَدْ رَكَضَتْنِي مِنْهَا نَاقَةٌ حَمْرَاءُ ‏.‏",
    "malay_translation": "Dia memberitahunya, dan beberapa orang lelaki di kalangan orang-orang tua kaumnya, bahawa 'Abdullah bin Sahl dan Muhayysah pergi ke Khaibar kerana beberapa masalah yang timbul. Seseorang datang kepada Muhayysah, dan dia memberitahunya bahawa 'Abdullah bin Sahl telah dibunuh dan dibuang ke dalam lubang atau telaga. Dia datang kepada orang-orang Yahudi dan berkata: \"Demi Allah, kamu membunuhnya.\" Mereka berkata: \"Demi Allah, kami tidak membunuhnya.\" Kemudian dia kembali kepada kaumnya dan memberitahu mereka tentang perkara itu. Kemudian dia dan saudaranya Huwayysah, yang lebih tua daripadanya, dan 'Abdur-Rahman bin Sahl, datang (kepada Nabi SAW). Muhayysah, yang merupakan orang yang berada di Khaibar, mula bercakap, tetapi Rasulullah SAW bersabda: \"Biarkan yang lebih tua bercakap dahulu.\" Jadi Huwayysah bercakap, kemudian Muhayysah bercakap. Rasulullah SAW bersabda: \"Sama ada (orang-orang Yahudi) akan membayar Diyat untuk sahabat kamu, atau perang akan diisytiharkan ke atas mereka.\" Rasulullah SAW menghantar surat mengenai perkara itu (kepada orang-orang Yahudi) dan mereka membalas dengan berkata: \"Demi Allah, kami tidak membunuhnya.\" Rasulullah SAW dan 'Abdur-Rahman: \"Adakah kamu akan bersumpah untuk mengesahkan tuntutan kamu ke atas wang darah sahabat kamu?\" Mereka berkata: \"Tidak.\" Baginda bersabda: \"Haruskah orang-orang Yahudi bersumpah untuk kamu?\" Mereka berkata: \"Mereka bukan Muslim.\" Jadi Rasulullah SAW membayarnya sendiri, dan baginda menghantar seratus ekor unta betina ke kediaman mereka. Sahl berkata: \"Seekor unta betina merah daripada kalangan mereka menendang saya.\""
  },
  {
    "id": 19458,
    "hadith_number": 4722,
    "tajuk_hadith": "Pembayaran Diyat untuk Pembunuhan Abdullah bin Sahl",
    "perawi_melayu": "Diriwayatkan daripada Yahya, daripada Bushair bin Yasa, daripada Sahl bin Abi Hathmah yang berkata - dan saya rasa dia berkata:",
    "english_text": "and from Rafi bin Khadij, the two of them said - :\"Abdullah bin Sahl bin Zaid and Muhayysah bin Mas'ud went out until when they reached Khaibar, they went their separate ways. Then Muhayysah found 'Abdullah bin Sahl slain, so he buried him. Then he came to the Mesenger of Allah, along with Huwayysah bin Mas'ud and 'Abdur-Rahman bin Sahl, who was the youngest of them, 'Abdur-Rahman started to speak before his two companions, but the Messenger of Allah said to him: \"Let the clear speak first.\" So he fell silent and his two companions spoke, then he spoke with them. They told the Messenger of Allah about the killing of 'Abdullah bin Sahl, and he said to them: \"Will you swear fifty oaths, then you will receive compensation, or be entitled to retaliate?\" They said: \"How can we swear an oath when we did not witness what happened?\" he said: \"Then can the Jews swear fifty oaths declaring their innocence?\" They said: \"How can we accept the oath of a disbelieving people?\" When the Messenger of Allah saw that, he paid the blood money (himself).",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَحْيَى، عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، قَالَ وَحَسِبْتُ قَالَ وَعَنْ رَافِعِ بْنِ خَدِيجٍ، أَنَّهُمَا قَالاَ خَرَجَ عَبْدُ اللَّهِ بْنُ سَهْلِ بْنِ زَيْدٍ وَمُحَيِّصَةُ بْنُ مَسْعُودٍ حَتَّى إِذَا كَانَا بِخَيْبَرَ تَفَرَّقَا فِي بَعْضِ مَا هُنَالِكَ ثُمَّ إِذَا بِمُحَيِّصَةَ يَجِدُ عَبْدَ اللَّهِ بْنَ سَهْلٍ قَتِيلاً فَدَفَنَهُ ثُمَّ أَقْبَلَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم هُوَ وَحُوَيِّصَةُ بْنُ مَسْعُودٍ وَعَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ - وَكَانَ أَصْغَرَ الْقَوْمِ - فَذَهَبَ عَبْدُ الرَّحْمَنِ يَتَكَلَّمُ قَبْلَ صَاحِبَيْهِ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَبِّرِ الْكُبْرَ فِي السِّنِّ ‏\"‏ ‏.‏ فَصَمَتَ وَتَكَلَّمَ صَاحِبَاهُ ثُمَّ تَكَلَّمَ مَعَهُمَا فَذَكَرُوا لِرَسُولِ اللَّهِ صلى الله عليه وسلم مَقْتَلَ عَبْدِ اللَّهِ بْنِ سَهْلٍ فَقَالَ لَهُمْ ‏\"‏ أَتَحْلِفُونَ خَمْسِينَ يَمِينًا وَتَسْتَحِقُّونَ صَاحِبَكُمْ أَوْ قَاتِلَكُمْ ‏\"‏ ‏.‏ قَالُوا كَيْفَ نَحْلِفُ وَلَمْ نَشْهَدْ قَالَ ‏\"‏ فَتُبَرِّئُكُمْ يَهُودُ بِخَمْسِينَ يَمِينًا ‏\"‏ ‏.‏ قَالُوا وَكَيْفَ نَقْبَلُ أَيْمَانَ قَوْمٍ كُفَّارٍ فَلَمَّا رَأَى ذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَعْطَاهُ عَقْلَهُ ‏.‏",
    "malay_translation": "Dan daripada Rafi bin Khadij, kedua-duanya berkata: \"Abdullah bin Sahl bin Zaid dan Muhayysah bin Mas'ud keluar sehingga apabila mereka sampai di Khaibar, mereka berpecah jalan. Kemudian Muhayysah mendapati 'Abdullah bin Sahl terbunuh, lalu dia mengebumikannya. Kemudian dia datang kepada Rasulullah SAW, bersama Huwayysah bin Mas'ud dan 'Abdur-Rahman bin Sahl, yang merupakan yang termuda di antara mereka. 'Abdur-Rahman mula bercakap sebelum dua sahabatnya, tetapi Rasulullah SAW berkata kepadanya: \"Biarlah yang lebih tua bercakap dahulu.\" Maka dia diam dan dua sahabatnya bercakap, kemudian dia bercakap bersama mereka. Mereka memberitahu Rasulullah SAW tentang pembunuhan 'Abdullah bin Sahl, dan baginda bersabda kepada mereka: \"Adakah kamu akan bersumpah lima puluh sumpah, kemudian kamu akan menerima pampasan, atau berhak untuk membalas?\" Mereka berkata: \"Bagaimana kami boleh bersumpah sedangkan kami tidak menyaksikan apa yang berlaku?\" Baginda bersabda: \"Kalau begitu, bolehkah orang Yahudi bersumpah lima puluh sumpah yang menyatakan ketidakbersalahan mereka?\" Mereka berkata: \"Bagaimana kami boleh menerima sumpah daripada kaum yang kafir?\" Apabila Rasulullah SAW melihat itu, baginda membayar diyat (sendiri)."
  },
  {
    "id": 19459,
    "hadith_number": 4723,
    "tajuk_hadith": "Pembayaran Diyat (Pampasan) untuk Pembunuhan di Khaibar",
    "perawi_melayu": "Diriwayatkan daripada Sahl bin Ab Hathmah dan Rafi bin Khadij bahawa:",
    "english_text": "Muhayysah bin Mas'ud and 'Abdullah bin Sahl went to Khaibar for some need they had there, and they parted among the palm trees. 'Abdullah bin Sahl was killed, and 'Abdullah bin Sahl was killed, and his brother 'Abdur-Rahman bin Shl, and Huwayysah, and Musayysah, his paternal cousins, came to the Messenger of Allah. 'Abdur-Rahan spoke about his brother's case, but he was the youngest of them, so the Messenger of Allah said: \"Let the elders speak first.\" So they spoke about their companions, and the Messenger of Allah said: Let fifty of your swear an oath.\" The said: \"O Messenger of Allah, it is something that we did not witness: how can we swear an oath?\" He said: \"Then let the Jews swear fifty oaths to their innocence.\" They said: \"O Messenger of Allah, they area) a disbelieving people,\" So the Messenger of Allah paid the blood money himself Sahl said: \"I entered a Mirbad of theirs, and one of those camels kicked me.\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدَةَ، قَالَ أَنْبَأَنَا حَمَّادٌ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، وَرَافِعِ بْنِ خَدِيجٍ، أَنَّهُمَا حَدَّثَاهُ أَنَّ مُحَيِّصَةَ بْنَ مَسْعُودٍ وَعَبْدَ اللَّهِ بْنَ سَهْلٍ أَتَيَا خَيْبَرَ فِي حَاجَةٍ لَهُمَا فَتَفَرَّقَا فِي النَّخْلِ فَقُتِلَ عَبْدُ اللَّهِ بْنُ سَهْلٍ فَجَاءَ أَخُوهُ عَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ وَحُوَيِّصَةُ وَمُحَيِّصَةُ ابْنَا عَمِّهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَتَكَلَّمَ عَبْدُ الرَّحْمَنِ فِي أَمْرِ أَخِيهِ - وَهُوَ أَصْغَرُ مِنْهُمْ - فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْكُبْرَ لِيَبْدَأَ الأَكْبَرُ ‏\"‏ ‏.‏ فَتَكَلَّمَا فِي أَمْرِ صَاحِبِهِمَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَذَكَرَ كَلِمَةً مَعْنَاهَا ‏\"‏ يُقْسِمُ خَمْسُونَ مِنْكُمْ ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ أَمْرٌ لَمْ نَشْهَدْهُ كَيْفَ نَحْلِفُ قَالَ ‏\"‏ فَتُبَرِّئُكُمْ يَهُودُ بِأَيْمَانِ خَمْسِينَ مِنْهُمْ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ قَوْمٌ كُفَّارٌ ‏.‏ فَوَدَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ قِبَلِهِ ‏.‏ قَالَ سَهْلٌ فَدَخَلْتُ مِرْبَدًا لَهُمْ فَرَكَضَتْنِي نَاقَةٌ مِنْ تِلْكَ الإِبِلِ ‏.‏",
    "malay_translation": "Muhayysah bin Mas'ud dan 'Abdullah bin Sahl pergi ke Khaibar untuk suatu keperluan. Mereka berpisah di antara pokok-pokok kurma. 'Abdullah bin Sahl telah dibunuh. Kemudian, saudara lelakinya, Abdur-Rahman bin Sahl, dan Huwayysah, serta Musayysah, iaitu sepupu mereka dari sebelah bapa, datang kepada Rasulullah SAW. Abdur-Rahman bercakap tentang kes saudaranya, tetapi dia adalah yang termuda di antara mereka. Oleh itu, Rasulullah SAW bersabda: \"Biarlah yang lebih tua bercakap dahulu.\" Lalu mereka bercakap tentang rakan mereka. Rasulullah SAW bersabda: \"Hendaklah lima puluh orang daripada kamu bersumpah.\" Mereka berkata: \"Wahai Rasulullah, ini adalah sesuatu yang tidak kami saksikan; bagaimana kami boleh bersumpah?\" Baginda bersabda: \"Kalau begitu, biarlah orang Yahudi bersumpah lima puluh sumpah untuk membuktikan mereka tidak bersalah.\" Mereka berkata: \"Wahai Rasulullah, mereka adalah kaum yang kafir.\" Maka Rasulullah SAW membayar sendiri diyat (pampasan) tersebut. Sahl berkata: \"Saya masuk ke dalam Mirbad (kandang unta) mereka, dan salah seekor unta tersebut menendang saya.\""
  },
  {
    "id": 19460,
    "hadith_number": 4724,
    "tajuk_hadith": "Sumpah dan Pembayaran Diyat dalam Kes Pembunuhan di Khaibar",
    "perawi_melayu": "Diriwayatkan daripada Sahl bin Abi Hathmah bahawa:",
    "english_text": "'Abdullah bin SAahi and Nubayysah bin Mas'ud bin Zaid went o Khaibar, and at that time there was peace treaty. They went their separate ways to about their business, then Muhayysah came upon 'Abdullah in Sahl lying dead in a pool of blood. He buried him, then he came to AL-Madinah. 'Abdur-Rahman bin Sahi. Huwayysah, and Muhayysah came to the Messenger of Allah, and 'Abdur-Rehman started to speak, but he was the youngest of them, so the Messenger of Allah said: \"Let the elders speak first.\" So he fell silent and they (the other two) spoke. The Messenger of Allah said: \"Will you swear fifty oaths, then you will receive compensation or be entitled to retaliate?\" They said: \"O Messenger of Allah, how can we swear an oath when we did not witness, and did not see (what happened)?\" He said: \"The n can the Jews swear fifty oaths declaring their innocence?\" They said: \"O Messenger of Allah, how can we accept the oath of a disbelieving people?\" So the Messenger of Allah paid the blood money himself.",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا بِشْرٌ، - وَهُوَ ابْنُ الْمُفَضَّلِ - قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ، وَمُحَيِّصَةَ بْنَ مَسْعُودِ بْنِ زَيْدٍ، أَنَّهُمَا أَتَيَا خَيْبَرَ وَهُوَ يَوْمَئِذٍ صُلْحٌ فَتَفَرَّقَا لِحَوَائِجِهِمَا فَأَتَى مُحَيِّصَةُ عَلَى عَبْدِ اللَّهِ بْنِ سَهْلٍ وَهُوَ يَتَشَحَّطُ فِي دَمِهِ قَتِيلاً فَدَفَنَهُ ثُمَّ قَدِمَ الْمَدِينَةَ فَانْطَلَقَ عَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ وَحُوَيِّصَةُ وَمُحَيِّصَةُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَهَبَ عَبْدُ الرَّحْمَنِ يَتَكَلَّمُ - وَهُوَ أَحْدَثُ الْقَوْمِ سِنًّا - فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَبِّرِ الْكُبْرَ ‏\"‏ ‏.‏ فَسَكَتَ فَتَكَلَّمَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَحْلِفُونَ بِخَمْسِينَ يَمِينًا مِنْكُمْ فَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ أَوْ قَاتِلِكُمْ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نَحْلِفُ وَلَمْ نَشْهَدْ وَلَمْ نَرَ قَالَ ‏\"‏ تُبَرِّئُكُمْ يَهُودُ بِخَمْسِينَ يَمِينًا ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نَأْخُذُ أَيْمَانَ قَوْمٍ كُفَّارٍ فَعَقَلَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ عِنْدِهِ ‏.‏",
    "malay_translation": "Abdullah bin Sahl dan Muhayysah bin Mas'ud bin Zaid pergi ke Khaibar, dan pada waktu itu terdapat perjanjian damai. Mereka pergi berasingan untuk urusan masing-masing, kemudian Muhayysah menemui Abdullah bin Sahl terbaring mati berlumuran darah. Dia mengebumikannya, kemudian dia datang ke Madinah. Abdur-Rahman bin Sahl, Huwayysah, dan Muhayysah datang kepada Rasulullah SAW, dan Abdur-Rahman mula bercakap, tetapi dia adalah yang termuda di antara mereka, jadi Rasulullah SAW bersabda: \"Biarkan yang lebih tua bercakap dahulu.\" Maka dia terdiam dan mereka (dua yang lain) bercakap. Rasulullah SAW bersabda: \"Adakah kamu akan bersumpah lima puluh sumpah, maka kamu akan menerima pampasan atau berhak untuk membalas?\" Mereka berkata: \"Wahai Rasulullah, bagaimana kami boleh bersumpah sedangkan kami tidak menyaksikan, dan tidak melihat (apa yang berlaku)?\" Baginda bersabda: \"Kalau begitu, bolehkah orang Yahudi bersumpah lima puluh sumpah yang menyatakan ketidakbersalahan mereka?\" Mereka berkata: \"Wahai Rasulullah, bagaimana kami boleh menerima sumpah orang kafir?\" Maka Rasulullah SAW membayar diyat (wang darah) itu sendiri."
  },
  {
    "id": 19461,
    "hadith_number": 4725,
    "tajuk_hadith": "Pembayaran Diyat oleh Rasulullah SAW dalam Kes Pembunuhan di Khaibar",
    "perawi_melayu": "Diriwayatkan daripada Sahl bin Abi Hatmah RA berkata:",
    "english_text": "\"Abdullah bin Sahl and Muhayysah bin Mas'ud bin Zaid went to Khaibar, and at that time there was a peace treaty. They went their separatea ways to go about their business, then Muhayysah came upon 'Abdullah bin Sahl lying dead in a pool of blood. He buried him, then he camae to Al-Madinah. 'Abdur-Rahman bin Sahl and Huwhayysah, and Muhayysah, the tow sons of Nas'ud, came to the Messenger of Allah, and \"Abdur-Rahman started to speak, but the Messenger of Allah said: \"Let the elders speak first,\" for he was the youngest of them. So he fell silent and they (the other two) spoke. The Messenger of Allah said: \"Will you sear fifty oaths, then you will receive compensation or be entitled to retaliate?\" They said: \"O Messenger of Allah, how can we a wear and oath when we did not witness and did not see (what happened)\" He said: \"Then can the Jews swear fifty oaths declaring their innocence?\" They said: \"O Messenger of Allah, how can we accept the oath of a disbelieving people?\" So the Messenger of Allah paid the blood money himself.",
    "arabic_text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، قَالَ انْطَلَقَ عَبْدُ اللَّهِ بْنُ سَهْلٍ وَمُحَيِّصَةُ بْنُ مَسْعُودِ بْنِ زَيْدٍ إِلَى خَيْبَرَ وَهِيَ يَوْمَئِذٍ صُلْحٌ فَتَفَرَّقَا فِي حَوَائِجِهِمَا فَأَتَى مُحَيِّصَةُ عَلَى عَبْدِ اللَّهِ بْنِ سَهْلٍ وَهُوَ يَتَشَحَّطُ فِي دَمِهِ قَتِيلاً فَدَفَنَهُ ثُمَّ قَدِمَ الْمَدِينَةَ فَانْطَلَقَ عَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ وَحُوَيِّصَةُ وَمُحَيِّصَةُ ابْنَا مَسْعُودٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَهَبَ عَبْدُ الرَّحْمَنِ يَتَكَلَّمُ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَبِّرِ الْكُبْرَ ‏\"‏ ‏.‏ وَهُوَ أَحْدَثُ الْقَوْمِ فَسَكَتَ فَتَكَلَّمَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَحْلِفُونَ بِخَمْسِينَ يَمِينًا مِنْكُمْ وَتَسْتَحِقُّونَ قَاتِلَكُمْ أَوْ صَاحِبَكُمْ ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نَحْلِفُ وَلَمْ نَشْهَدْ وَلَمْ نَرَ فَقَالَ ‏\"‏ أَتُبَرِّئُكُمْ يَهُودُ بِخَمْسِينَ ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نَأْخُذُ أَيْمَانَ قَوْمٍ كُفَّارٍ فَعَقَلَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ عِنْدِهِ ‏.‏",
    "malay_translation": "Abdullah bin Sahl dan Muhayysah bin Mas'ud bin Zaid pergi ke Khaibar, yang pada waktu itu dalam keadaan perjanjian damai. Mereka berpecah untuk urusan masing-masing, kemudian Muhayysah menemui Abdullah bin Sahl terbaring mati berlumuran darah. Dia mengebumikannya, kemudian dia datang ke Madinah. Abdur-Rahman bin Sahl dan Huwayysah, dan Muhayysah, dua anak lelaki Mas'ud, datang kepada Rasulullah SAW, dan Abdur-Rahman mula bercakap, tetapi Rasulullah SAW bersabda: \"Biarkan yang lebih tua bercakap dahulu,\" kerana dia adalah yang termuda di antara mereka. Maka dia terdiam dan mereka (dua yang lain) bercakap. Rasulullah SAW bersabda: \"Adakah kamu akan bersumpah lima puluh sumpah, kemudian kamu akan menerima pampasan atau berhak untuk membalas?\" Mereka berkata: \"Wahai Rasulullah, bagaimana kami boleh bersumpah sedangkan kami tidak menyaksikan dan tidak melihat (apa yang berlaku)?\" Baginda bersabda: \"Kemudian bolehkah orang Yahudi bersumpah lima puluh sumpah menyatakan mereka tidak bersalah?\" Mereka berkata: \"Wahai Rasulullah, bagaimana kami boleh menerima sumpah orang kafir?\" Maka Rasulullah SAW membayar diyat (wang tebusan) itu sendiri."
  },
  {
    "id": 19462,
    "hadith_number": 4726,
    "tajuk_hadith": "Pembayaran Diyat untuk Pembunuhan Abdullah bin Sahl",
    "perawi_melayu": "Diriwayatkan daripada Sahl bin Abi Hathmah bahawa:",
    "english_text": "'Abdullah bin Sahi Al-Anasri and Muhayysah bin Mas'ud went out to Khaibar and went their separate ways to go about their business. 'Abdullah bin Sahl Al-Anasari was killed and Muhayysah. 'Abdur-Rahman, who was the brother of the victim, and Huwayysah, came to the Messenger of Allah. 'Abdur-Rahman started to speak, but the prophert said to him: \"Let the elders speak first.\" So Muhayysah and Huwayysah spoke and told him about the case of 'Abdullah bin Sahl. The Messenger of Allah said: \"Will you swear fifty oaths, then you will receive compensation or be entitled to retaliate?\" They said: \"How can we swear an oath when we did not witness (what happened) and we were not there?\" The Messenger of Allah said: \"Then can the Jews swear fifty oaths declaring their innocence?\" They said: \"O Messenger of Allah, how can we accept the oath of a disbelieving people?\" So the Messenger of Allah paid the blood money himself. (One of the narrators) Bushair said: 'One of those camels kicked me in a Mirbad of ours.\"'",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، يَقُولُ أَخْبَرَنِي بُشَيْرُ بْنُ يَسَارٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ الأَنْصَارِيَّ، وَمُحَيِّصَةَ بْنَ مَسْعُودٍ، خَرَجَا إِلَى خَيْبَرَ فَتَفَرَّقَا فِي حَاجَتِهِمَا فَقُتِلَ عَبْدُ اللَّهِ بْنُ سَهْلٍ الأَنْصَارِيُّ فَجَاءَ مُحَيِّصَةُ وَعَبْدُ الرَّحْمَنِ أَخُو الْمَقْتُولِ وَحُوَيِّصَةُ بْنُ مَسْعُودٍ حَتَّى أَتَوْا رَسُولَ اللَّهِ صلى الله عليه وسلم فَذَهَبَ عَبْدُ الرَّحْمَنِ يَتَكَلَّمُ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ الْكُبْرَ الْكُبْرَ ‏\"‏ ‏.‏ فَتَكَلَّمَ مُحَيِّصَةُ وَحُوَيِّصَةُ فَذَكَرُوا شَأْنَ عَبْدِ اللَّهِ بْنِ سَهْلٍ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تَحْلِفُونَ خَمْسِينَ يَمِينًا فَتَسْتَحِقُّونَ قَاتِلَكُمْ ‏\"‏ ‏.‏ قَالُوا كَيْفَ نَحْلِفُ وَلَمْ نَشْهَدْ وَلَمْ نَحْضُرْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَتُبَرِّئُكُمْ يَهُودُ بِخَمْسِينَ يَمِينًا ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نَقْبَلُ أَيْمَانَ قَوْمٍ كُفَّارٍ قَالَ فَوَدَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ بُشَيْرٌ قَالَ لِي سَهْلُ بْنُ أَبِي حَثْمَةَ لَقَدْ رَكَضَتْنِي فَرِيضَةٌ مِنْ تِلْكَ الْفَرَائِضِ فِي مِرْبَدٍ لَنَا ‏.‏",
    "malay_translation": "Abdullah bin Sahl Al-Anasri dan Muhayysah bin Mas'ud pergi ke Khaibar dan berpisah untuk menjalankan urusan mereka. Abdullah bin Sahl Al-Anasari telah dibunuh dan Muhayysah. Abdur-Rahman, yang merupakan saudara lelaki mangsa, dan Huwayysah, datang kepada Rasulullah SAW. Abdur-Rahman mula bercakap, tetapi Nabi SAW bersabda kepadanya: \"Biarkan yang lebih tua bercakap dahulu.\" Maka Muhayysah dan Huwayysah bercakap dan memberitahu baginda tentang kes Abdullah bin Sahl. Rasulullah SAW bersabda: \"Adakah kamu akan bersumpah lima puluh sumpah, maka kamu akan menerima pampasan atau berhak untuk membalas?\" Mereka berkata: \"Bagaimana kami boleh bersumpah sedangkan kami tidak menyaksikan (apa yang berlaku) dan kami tidak berada di sana?\" Rasulullah SAW bersabda: \"Kalau begitu, bolehkah orang Yahudi bersumpah lima puluh sumpah yang menyatakan ketidakbersalahan mereka?\" Mereka berkata: \"Wahai Rasulullah, bagaimana kami boleh menerima sumpah orang kafir?\" Maka Rasulullah SAW membayar diyat (wang tebusan) itu sendiri. (Salah seorang perawi) Bushair berkata: 'Salah seekor unta itu menendang saya di Mirbad kami.'"
  },
  {
    "id": 19463,
    "hadith_number": 4727,
    "tajuk_hadith": "Pembayaran Diyat untuk Abdullah bin Sahl yang Dibunuh di Khaibar",
    "perawi_melayu": "Diriwayatkan daripada Sahl bin Abi Hathmah berkata:",
    "english_text": "\"Abdullah bin Sahl was found slain, and his brother, and two paternal uncles, Huwayysah and Huwayisaah, who were the paternal uncles of 'Abdullah bin Sahl, came to the Messenger of Allah. 'Abdur-Rahman started to speak, but the Messenger of Allah said: \"Let the elders speak first.\" They said: \"O Messenger of Allah, we found 'Abdullah bin Sahl slain in one of the dry wells of Khaibar.\" The prophet said: \"Whom do you suspect? They said: \"We suspect the Jews.\" He said: \"Will you swear fifty oaths saying that the Jews killed him?\" They said: \"How can we swear an oath about something that we did not see?\" He said: \"Then can the Jews swear fifty oaths declaring that they did not kill him?\" They said:\"How can we accept their oaths, when they are Mushrikun?\" So the Messenger of Allah paid the blood money himself. (Sahih)\nMalik narrated this in Mursal from.",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، قَالَ وُجِدَ عَبْدُ اللَّهِ بْنُ سَهْلٍ قَتِيلاً فَجَاءَ أَخُوهُ وَعَمَّاهُ حُوَيِّصَةُ وَمُحَيِّصَةُ وَهُمَا عَمَّا عَبْدِ اللَّهِ بْنِ سَهْلٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَهَبَ عَبْدُ الرَّحْمَنِ يَتَكَلَّمُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْكُبْرَ الْكُبْرَ ‏\"‏ ‏.‏ قَالاَ يَا رَسُولَ اللَّهِ إِنَّا وَجَدْنَا عَبْدَ اللَّهِ بْنَ سَهْلٍ قَتِيلاً فِي قَلِيبٍ مِنْ بَعْضِ قُلُبِ خَيْبَرَ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَنْ تَتَّهِمُونَ ‏\"‏ ‏.‏ قَالُوا نَتَّهِمُ الْيَهُودَ ‏.‏ قَالَ ‏\"‏ أَفَتُقْسِمُونَ خَمْسِينَ يَمِينًا أَنَّ الْيَهُودَ قَتَلَتْهُ ‏\"‏ ‏.‏ قَالُوا وَكَيْفَ نُقْسِمُ عَلَى مَا لَمْ نَرَ قَالَ ‏\"‏ فَتُبَرِّئُكُمُ الْيَهُودُ بِخَمْسِينَ أَنَّهُمْ لَمْ يَقْتُلُوهُ ‏\"‏ ‏.‏ قَالُوا وَكَيْفَ نَرْضَى بِأَيْمَانِهِمْ وَهُمْ مُشْرِكُونَ فَوَدَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ عِنْدِهِ ‏.‏ أَرْسَلَهُ مَالِكُ بْنُ أَنَسٍ ‏.‏",
    "malay_translation": "Abdullah bin Sahl ditemui terbunuh, dan saudaranya, serta dua orang bapa saudaranya, Huwayysah dan Muhayyisah, iaitu bapa-bapa saudara Abdullah bin Sahl, datang kepada Rasulullah SAW. Abdur-Rahman mula bercakap, tetapi Rasulullah SAW bersabda: \"Biarkan yang lebih tua bercakap dahulu.\" Mereka berkata: \"Wahai Rasulullah, kami mendapati Abdullah bin Sahl terbunuh di salah satu telaga kering di Khaibar.\" Nabi SAW bersabda: \"Siapa yang kamu syaki?\" Mereka berkata: \"Kami mengesyaki orang Yahudi.\" Baginda bersabda: \"Adakah kamu akan bersumpah lima puluh sumpah mengatakan bahawa orang Yahudi membunuhnya?\" Mereka berkata: \"Bagaimana kami boleh bersumpah tentang sesuatu yang tidak kami lihat?\" Baginda bersabda: \"Kemudian bolehkah orang Yahudi bersumpah lima puluh sumpah menyatakan bahawa mereka tidak membunuhnya?\" Mereka berkata: \"Bagaimana kami boleh menerima sumpah mereka, sedangkan mereka adalah Musyrikun?\" Maka Rasulullah SAW membayar diyat (wang tebusan) itu sendiri. (Sahih)\nMalik meriwayatkan ini dalam bentuk Mursal daripada."
  },
  {
    "id": 19464,
    "hadith_number": 4728,
    "tajuk_hadith": "Pembayaran Diyat untuk Abdullah bin Sahl di Khaibar",
    "perawi_melayu": "Diriwayatkan daripada Bushair bin Yasar bahawa:",
    "english_text": "'Abdullah bin Sahl Al-Ansari and Muhayysah bin Mas'ud went out to Khaibar, where they went their separate ways to go about their business. 'Abdullah bin Sahl was killed, and Muhayysah came (to Madinah) and went with his brother Huwayysah and 'Abdur-Rahman bin Sahl to the Messenger of Allah. 'Abdur-Rahaman started to speak, because of his position as brother (of the slain man) but the Messenger of Allah said: \"Let the elders speak first.\" So Huyysah and Muhayysah spoken, and told him about what happened to 'Abdullah bin Sahl. The Messenger of Allah said to them: \"Will you sewer fifty oaths, then you will receive compensation or be entitled to retaliate?\" (In his narration) Malik said: \"Yahya said: 'Bushair said that the Messenger of Allah paid the blood money himself, but Sa'eed bin 'Ubaid At-Ta'l disagreed with them (in reporting that).''",
    "arabic_text": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ الْقَاسِمِ، حَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، أَنَّهُ أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ الأَنْصَارِيَّ وَمُحَيِّصَةَ بْنَ مَسْعُودٍ خَرَجَا إِلَى خَيْبَرَ فَتَفَرَّقَا فِي حَوَائِجِهِمَا فَقُتِلَ عَبْدُ اللَّهِ بْنُ سَهْلٍ فَقَدِمَ مُحَيِّصَةُ فَأَتَى هُوَ وَأَخُوهُ حُوَيِّصَةُ وَعَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَهَبَ عَبْدُ الرَّحْمَنِ لِيَتَكَلَّمَ لِمَكَانِهِ مِنْ أَخِيهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَبِّرْ كَبِّرْ ‏\"‏ ‏.‏ فَتَكَلَّمَ حُوَيِّصَةُ وَمُحَيِّصَةُ فَذَكَرُوا شَأْنَ عَبْدِ اللَّهِ بْنِ سَهْلٍ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَحْلِفُونَ خَمْسِينَ يَمِينًا وَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ أَوْ قَاتِلِكُمْ ‏\"‏ ‏.‏ قَالَ مَالِكٌ قَالَ يَحْيَى فَزَعَمَ بُشَيْرٌ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَدَاهُ مِنْ عِنْدِهِ ‏.‏ خَالَفَهُمْ سَعِيدُ بْنُ عُبَيْدٍ الطَّائِيُّ ‏.‏",
    "malay_translation": "Abdullah bin Sahl Al-Ansari dan Muhayysah bin Mas'ud pergi ke Khaibar, di mana mereka berpisah untuk menguruskan urusan masing-masing. Abdullah bin Sahl telah dibunuh, dan Muhayysah datang (ke Madinah) dan pergi bersama saudaranya Huwayysah dan 'Abdur-Rahman bin Sahl kepada Rasulullah SAW. 'Abdur-Rahman mula bercakap, kerana kedudukannya sebagai saudara (kepada lelaki yang terbunuh) tetapi Rasulullah SAW bersabda: \"Biarkan orang yang lebih tua bercakap dahulu.\" Maka Huyysah dan Muhayysah bercakap, dan memberitahu baginda tentang apa yang berlaku kepada Abdullah bin Sahl. Rasulullah SAW bersabda kepada mereka: \"Adakah kamu akan bersumpah lima puluh sumpah, kemudian kamu akan menerima pampasan atau berhak untuk membalas dendam?\" (Dalam riwayatnya) Malik berkata: \"Yahya berkata: 'Bushair berkata bahawa Rasulullah SAW membayar sendiri wang darah, tetapi Sa'eed bin 'Ubaid At-Ta'l tidak bersetuju dengan mereka (dalam melaporkan perkara itu).''"
  },
  {
    "id": 19465,
    "hadith_number": 4729,
    "tajuk_hadith": "Diyat (Pampasan) untuk Pembunuhan Apabila Pelaku Tidak Diketahui",
    "perawi_melayu": "Diriwayatkan daripada Sa'eed bin 'Ubaid At-Ta'l daripada Bushair bin Yasar yang berkata:",
    "english_text": "\"A man from among the Ansar who was called Sahl bin Abi Hathmah told him that some of his people went to Khaibar, where they went their separate ways. Then they found one of their numbers slain. They said to those in whose land they found him: 'You killed our companion!' They said: 'We did not kill him and we do not know who killed him.' They went to the prophet of Allah and said: 'O Prophet of Allah, we went to Khaibar and we found one of our number slain.' The Messenger of Allah said:  'Let the elders speak first.' And he said to them: 'Bring proof of the one whom you suspect killed him.' They said: 'We do not have any proof.' He said: \"Then let them swear an oath to you.' They said\" 'We will not accept the oath of the Jews.' The Messenger of Allah did not want his blood to have been shed with no Justice done, so he paid a Diyah of one hundred camels from the Sadaqah.\" 'Amr bin Shu'aib differed with them.",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ عُبَيْدٍ الطَّائِيُّ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، زَعَمَ أَنَّ رَجُلاً، مِنَ الأَنْصَارِ يُقَالُ لَهُ سَهْلُ بْنُ أَبِي حَثْمَةَ أَخْبَرَهُ أَنَّ نَفَرًا مِنْ قَوْمِهِ انْطَلَقُوا إِلَى خَيْبَرَ فَتَفَرَّقُوا فِيهَا فَوَجَدُوا أَحَدَهُمْ قَتِيلاً فَقَالُوا لِلَّذِينَ وَجَدُوهُ عِنْدَهُمْ قَتَلْتُمْ صَاحِبَنَا قَالُوا مَا قَتَلْنَاهُ وَلاَ عَلِمْنَا قَاتِلاً ‏.‏ فَانْطَلَقُوا إِلَى نَبِيِّ اللَّهِ صلى الله عليه وسلم فَقَالُوا يَا نَبِيَّ اللَّهِ انْطَلَقْنَا إِلَى خَيْبَرَ فَوَجَدْنَا أَحَدَنَا قَتِيلاً ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْكُبْرَ الْكُبْرَ ‏\"‏ ‏.‏ فَقَالَ لَهُمْ ‏\"‏ تَأْتُونَ بِالْبَيِّنَةِ عَلَى مَنْ قَتَلَ ‏\"‏ ‏.‏ قَالُوا مَا لَنَا بَيِّنَةٌ ‏.‏ قَالَ ‏\"‏ فَيَحْلِفُونَ لَكُمْ ‏\"‏ ‏.‏ قَالُوا لاَ نَرْضَى بِأَيْمَانِ الْيَهُودِ ‏.‏ وَكَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَبْطُلَ دَمُهُ فَوَدَاهُ مِائَةً مِنْ إِبِلِ الصَّدَقَةِ ‏.‏ خَالَفَهُمْ عَمْرُو بْنُ شُعَيْبٍ ‏.‏",
    "malay_translation": "Seorang lelaki daripada kalangan Ansar yang bernama Sahl bin Abi Hathmah menceritakan kepadanya bahawa beberapa orang dari kaumnya pergi ke Khaibar, di mana mereka berpecah-pecah. Kemudian mereka mendapati salah seorang daripada mereka terbunuh. Mereka berkata kepada orang-orang di tanah mereka menemui mayat itu: 'Kamu telah membunuh sahabat kami!' Mereka berkata: 'Kami tidak membunuhnya dan kami tidak tahu siapa yang membunuhnya.' Mereka pergi kepada Nabi Allah dan berkata: 'Wahai Nabi Allah, kami pergi ke Khaibar dan kami mendapati salah seorang daripada kami terbunuh.' Rasulullah bersabda: 'Biarlah orang yang lebih tua bercakap dahulu.' Dan baginda bersabda kepada mereka: 'Bawalah bukti orang yang kamu syaki membunuhnya.' Mereka berkata: 'Kami tidak mempunyai bukti.' Baginda bersabda: 'Kalau begitu, biarlah mereka bersumpah kepada kamu.' Mereka berkata: 'Kami tidak akan menerima sumpah orang Yahudi.' Rasulullah tidak mahu darahnya tumpah tanpa keadilan ditegakkan, maka baginda membayar Diyat seratus ekor unta daripada sedekah.' Amr bin Shu'aib berselisih dengan mereka."
  },
  {
    "id": 19466,
    "hadith_number": 4730,
    "tajuk_hadith": "Pembayaran Diyat untuk Pembunuhan di Khaibar",
    "perawi_melayu": "Diriwayatkan daripada 'Amr bin Shu'aib, daripada ayahnya, daripada datuknya, bahawa:",
    "english_text": "the younger son of Muhayysah was found slain one morning at the gate of one morning at the gates of Khaibar. The Messenger of Allah said: \"Bring two witnesses to (say) who killed him, and he will hand him over to you.\" He said: \"O Messenger of Allah, where shall I get two witnesses? He was found slain in the morning at their gates.\" He said: \"Will you swear fifty oaths?\" He said: \"O Messenger of Allah, how can I swear concerning something I do not know?\" The Messenger of Allah said: \"Then will you accept fifty oaths from them?\"  He said: \"O Messenger of Allah, how can we accept their oaths when they are Jews?\" So the Messenger of Allah told them (the Jews) to pay the Diyah and he would help them with half.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، قَالَ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ الأَخْنَسِ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ ابْنَ مُحَيِّصَةَ الأَصْغَرَ، أَصْبَحَ قَتِيلاً عَلَى أَبْوَابِ خَيْبَرَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَقِمْ شَاهِدَيْنِ عَلَى مَنْ قَتَلَهُ أَدْفَعْهُ إِلَيْكُمْ بِرُمَّتِهِ ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ وَمِنْ أَيْنَ أُصِيبُ شَاهِدَيْنِ وَإِنَّمَا أَصْبَحَ قَتِيلاً عَلَى أَبْوَابِهِمْ قَالَ ‏\"‏ فَتَحْلِفُ خَمْسِينَ قَسَامَةً ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ وَكَيْفَ أَحْلِفُ عَلَى مَا لاَ أَعْلَمُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَنَسْتَحْلِفُ مِنْهُمْ خَمْسِينَ قَسَامَةً ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ نَسْتَحْلِفُهُمْ وَهُمُ الْيَهُودُ فَقَسَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم دِيَتَهُ عَلَيْهِمْ وَأَعَانَهُمْ بِنِصْفِهَا ‏.‏",
    "malay_translation": "Anak lelaki Muhayysah yang lebih muda ditemui terbunuh pada suatu pagi di pintu pagar Khaibar. Rasulullah SAW bersabda: \"Bawalah dua orang saksi untuk (menyatakan) siapa yang membunuhnya, dan dia akan menyerahkannya kepada kamu.\" Dia berkata: \"Wahai Rasulullah, di mana saya akan mendapatkan dua orang saksi? Dia ditemui terbunuh pada waktu pagi di pintu pagar mereka.\" Baginda bersabda: \"Adakah kamu akan bersumpah lima puluh sumpah?\" Dia berkata: \"Wahai Rasulullah, bagaimana saya boleh bersumpah mengenai sesuatu yang saya tidak tahu?\" Rasulullah SAW bersabda: \"Kemudian adakah kamu akan menerima lima puluh sumpah daripada mereka?\" Dia berkata: \"Wahai Rasulullah, bagaimana kami boleh menerima sumpah mereka sedangkan mereka adalah Yahudi?\" Maka Rasulullah SAW menyuruh mereka (orang Yahudi) membayar Diyat dan baginda akan membantu mereka dengan separuh."
  },
  {
    "id": 19467,
    "hadith_number": 4731,
    "tajuk_hadith": "Hukuman Menumpahkan Darah Seorang Muslim",
    "perawi_melayu": "Diriwayatkan daripada 'Abdullah bahawa Rasulullah SAW bersabda:",
    "english_text": "\"It is not permissible to shed the blood of a Muslim except in one of three cases: A soul for a soul, a adulterer who has been married, and one who separates leaving his religion.\"",
    "arabic_text": "أَخْبَرَنَا بِشْرُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلاَّ بِإِحْدَى ثَلاَثٍ النَّفْسُ بِالنَّفْسِ وَالثَّيِّبُ الزَّانِي وَالتَّارِكُ دِينَهُ الْمُفَارِقُ ‏\"‏ ‏.‏",
    "malay_translation": "Tidak halal menumpahkan darah seorang Muslim kecuali dalam salah satu dari tiga perkara: Nyawa dibalas dengan nyawa, penzina *muhsan* (yang telah berkahwin), dan orang yang meninggalkan agamanya (Islam) serta memisahkan diri dari jemaah."
  },
  {
    "id": 19468,
    "hadith_number": 4732,
    "tajuk_hadith": "Pembunuh Dibebaskan Kerana Sumpah Tidak Berniat Membunuh",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah, beliau berkata:",
    "english_text": "\"A man was killed during the time of the Messenger of Allah, and the Killer was brought to the Prophet. He handed him over to the heir of the victim, but the killer said: 'O Messenger of Allah, by Allah I did not means to kill him.' The Messenger of Allah said to the next of kin: 'If he is telling the truth and you kill him, you will go to the Fire.' So he let him go. He had been tied with a string and he went out dragging his string, so he became known as Dhul-Nis'ah (the one with the string).",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، وَأَحْمَدُ بْنُ حَرْبٍ، - وَاللَّفْظُ لأَحْمَدَ - قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قُتِلَ رَجُلٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَرُفِعَ الْقَاتِلُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَدَفَعَهُ إِلَى وَلِيِّ الْمَقْتُولِ فَقَالَ الْقَاتِلُ يَا رَسُولَ اللَّهِ لاَ وَاللَّهِ مَا أَرَدْتُ قَتْلَهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِوَلِيِّ الْمَقْتُولِ ‏\n\"‏ أَمَا إِنَّهُ إِنْ كَانَ صَادِقًا ثُمَّ قَتَلْتَهُ دَخَلْتَ النَّارَ ‏\"‏ ‏.‏ فَخَلَّى سَبِيلَهُ ‏.‏ قَالَ وَكَانَ مَكْتُوفًا بِنِسْعَةٍ فَخَرَجَ يَجُرُّ نِسْعَتَهُ فَسُمِّيَ ذَا النِّسْعَةِ ‏.‏",
    "malay_translation": "Seorang lelaki telah terbunuh pada zaman Rasulullah SAW, dan pembunuhnya dibawa kepada Nabi. Baginda menyerahkan pembunuh itu kepada waris mangsa, tetapi pembunuh itu berkata: 'Wahai Rasulullah, demi Allah, saya tidak berniat untuk membunuhnya.' Rasulullah SAW bersabda kepada waris mangsa: 'Ketahuilah, jika dia berkata benar dan kamu membunuhnya, kamu akan masuk neraka.' Maka dia melepaskannya. Dikatakan bahawa dia diikat dengan tali, lalu dia keluar menyeret talinya, sehingga dia dikenali sebagai Dhul-Nis'ah (orang yang bertali)."
  },
  {
    "id": 19469,
    "hadith_number": 4733,
    "tajuk_hadith": "Pilihan Antara Memaafkan, Membalas, atau Menerima Diyat dalam Kes Pembunuhan",
    "perawi_melayu": "Diriwayatkan daripada 'Alqamah bin Wa'il Al-Hadhrami bahawa bapanya berkata:",
    "english_text": "A man who had killed someone was brought to the Messenger of Allah, and he was brought by the heir of the victim. The Messenger of Allah said to him. 'Will you forgive him? He said: No.' He said: 'Will you kill him? He said: 'Yes.' He said: 'Go away.' Then when he went away, he called him back and said: will you forgive him?' He said: 'No.' He said: 'Will you accept the Diyah? He said: 'No.' He said: 'will you kill him? He said: 'Yes.' He said: 'Go away.' Then when he had gone he said: If you forgive him, he will carry your sin and the sin of your companion (the victim).\" So he forgave him and let him go.\" He said: \"And I saw him dragging his string.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا إِسْحَاقُ، عَنْ عَوْفٍ الأَعْرَابِيِّ، عَنْ عَلْقَمَةَ بْنِ وَائِلٍ الْحَضْرَمِيِّ، عَنْ أَبِيهِ، قَالَ جِيءَ بِالْقَاتِلِ الَّذِي قَتَلَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم جَاءَ بِهِ وَلِيُّ الْمَقْتُولِ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَعْفُو ‏\"‏ ‏.‏ قَالَ لاَ قَالَ ‏\"‏ أَتَقْتُلُ ‏\"‏ ‏.‏ قَالَ نَعَمْ قَالَ ‏\"‏ اذْهَبْ ‏\"‏ ‏.‏ فَلَمَّا ذَهَبَ دَعَاهُ قَالَ ‏\"‏ أَتَعْفُو ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ أَتَأْخُذُ الدِّيَةَ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ أَتَقْتُلُ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ اذْهَبْ ‏\"‏ ‏.‏ فَلَمَّا ذَهَبَ قَالَ ‏\"‏ أَمَا إِنَّكَ إِنْ عَفَوْتَ عَنْهُ فَإِنَّهُ يَبُوءُ بِإِثْمِكَ وَإِثْمِ صَاحِبِكَ ‏\"‏ ‏.‏ فَعَفَا عَنْهُ فَأَرْسَلَهُ - قَالَ - فَرَأَيْتُهُ يَجُرُّ نِسْعَتَهُ ‏.‏",
    "malay_translation": "Seorang lelaki yang telah membunuh seseorang dibawa kepada Rasulullah SAW, dan dia dibawa oleh waris mangsa. Rasulullah SAW berkata kepadanya, 'Adakah kamu akan memaafkannya?' Dia berkata: 'Tidak.' Baginda bersabda: 'Adakah kamu akan membunuhnya?' Dia berkata: 'Ya.' Baginda bersabda: 'Pergi.' Kemudian, apabila dia pergi, Baginda memanggilnya kembali dan bersabda: 'Adakah kamu akan memaafkannya?' Dia berkata: 'Tidak.' Baginda bersabda: 'Adakah kamu akan menerima Diyat?' Dia berkata: 'Tidak.' Baginda bersabda: 'Adakah kamu akan membunuhnya?' Dia berkata: 'Ya.' Baginda bersabda: 'Pergi.' Kemudian, apabila dia telah pergi, Baginda bersabda: 'Ketahuilah, jika kamu memaafkannya, maka dia akan menanggung dosamu dan dosa sahabatmu (mangsa).'"
  },
  {
    "id": 19470,
    "hadith_number": 4734,
    "tajuk_hadith": "Galakan Memaafkan dalam Kes Pembunuhan",
    "perawi_melayu": "Diriwayatkan daripada Wa'il, dia berkata:",
    "english_text": "\"I saw the Messenger of Allah when the heir of a victim brought the killer, leading him by a string. The Messenger of Allah said to the heir of the victim: Will you forgive him?' He said: 'No., He said: 'Will you accept Diyah?' He said: 'No.' He said: 'Will you kill him?' He said: 'Yes.' He said\" 'Take him away (to kill him).' When he took him and turned away, he turned to those who were with him, and called him back, and said to him: 'Will you forgive him?' He said: No.' He said: 'Will you accept Diyah?' He said: No.' He said: 'Will you kill him?' He said: 'Yes.' He said: 'Take him away.' Then the Messenger of Allah said: 'If you forgive him, he will carry your sin and the sin of your companion (the victim).' So he forgave him and left him, and I was him dragging his string.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عَوْفِ بْنِ أَبِي جَمِيلَةَ، قَالَ حَدَّثَنِي حَمْزَةُ أَبُو عَمْرٍو الْعَائِذِيُّ، قَالَ حَدَّثَنَا عَلْقَمَةُ بْنُ وَائِلٍ، عَنْ وَائِلٍ، قَالَ شَهِدْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم حِينَ جِيءَ بِالْقَاتِلِ يَقُودُهُ وَلِيُّ الْمَقْتُولِ فِي نِسْعَةٍ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِوَلِيِّ الْمَقْتُولِ ‏\"‏ أَتَعْفُو ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ أَتَأْخُذُ الدِّيَةَ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَتَقْتُلُهُ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ اذْهَبْ بِهِ ‏\"‏ ‏.‏ فَلَمَّا ذَهَبَ بِهِ فَوَلَّى مِنْ عِنْدِهِ دَعَاهُ فَقَالَ لَهُ ‏\"‏ أَتَعْفُو ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ أَتَأْخُذُ الدِّيَةَ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَتَقْتُلُهُ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ اذْهَبْ بِهِ ‏\"‏ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم عِنْدَ ذَلِكَ ‏\"‏ أَمَا إِنَّكَ إِنْ عَفَوْتَ عَنْهُ يَبُوءُ بِإِثْمِهِ وَإِثْمِ صَاحِبِكَ ‏\"‏ ‏.‏ فَعَفَا عَنْهُ وَتَرَكَهُ فَأَنَا رَأَيْتُهُ يَجُرُّ نِسْعَتَهُ ‏.‏",
    "malay_translation": "Aku melihat Rasulullah SAW ketika waris mangsa membawa pembunuh, menuntunnya dengan tali. Rasulullah SAW bersabda kepada waris mangsa: 'Adakah kamu akan memaafkannya?' Dia berkata: 'Tidak.' Baginda bersabda: 'Adakah kamu akan menerima Diyah?' Dia berkata: 'Tidak.' Baginda bersabda: 'Adakah kamu akan membunuhnya?' Dia berkata: 'Ya.' Baginda bersabda: 'Bawa dia pergi (untuk membunuhnya).' Ketika dia membawanya pergi dan berpaling, Baginda berpaling kepada mereka yang bersamanya, dan memanggilnya kembali, dan bersabda kepadanya: 'Adakah kamu akan memaafkannya?' Dia berkata: 'Tidak.' Baginda bersabda: 'Adakah kamu akan menerima Diyah?' Dia berkata: 'Tidak.' Baginda bersabda: 'Adakah kamu akan membunuhnya?' Dia berkata: 'Ya.' Baginda bersabda: 'Bawa dia pergi.' Kemudian Rasulullah SAW bersabda: 'Jika kamu memaafkannya, dia akan menanggung dosamu dan dosa temanmu (mangsa).' Maka dia memaafkannya dan meninggalkannya, dan aku melihatnya menyeret talinya."
  },
  {
    "id": 19471,
    "hadith_number": 4735,
    "tajuk_hadith": "Keutamaan Seorang Individu Berbanding yang Lain",
    "perawi_melayu": "Diriwayatkan daripada 'Alqamah bin Wa'il daripada ayahnya, daripada Nabi. Yahya (salah seorang perawi) berkata:",
    "english_text": "\"He is better than him.\" ",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا جَامِعُ بْنُ مَطَرٍ الْحَبَطِيُّ، عَنْ عَلْقَمَةَ بْنِ وَائِلٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏ قَالَ يَحْيَى وَهُوَ أَحْسَنُ مِنْهُ ‏.‏",
    "malay_translation": "\"Dia lebih baik daripadanya.\""
  },
  {
    "id": 19472,
    "hadith_number": 4736,
    "tajuk_hadith": "Anjuran Memaafkan dalam Kes Pembunuhan Tidak Sengaja",
    "perawi_melayu": "Diriwayatkan daripada 'Alqamah bin Wa'il bahawa bapanya berkata:",
    "english_text": "\"I was sitting with the Messenger of Allah when a man came with a string around his neck and said: 'O Messenger of Allah, this man and my brother were digging a hole, and he raised his pickax and struck his companion in the head, Killing him. 'The Prophet said: 'Forgive him,' but he refused and said: 'O Prophet of Allah, this man and my brother were digging a whole, and he raised his pickax and struck his companion in the head, killing him.' The Prophet said: 'Forgive him,' but he refused, then he stood up and said: 'O Messenger of Allah, this man and my brother were digging a hole, and he raised his pickax and struck his companion in the head, killing him.' The Prophet said: 'Forgive him,' but he refused. He (the prophet) said: 'Go, but if you kill him, you will be like him. So he took him out, and they called out to him: Didn't you hear what the Messenger of Allah said?' So he came back and he said: 'If I kill him will I be like him?' He said: 'Yes. Forgive him.' Then he went out, dragging his string, until he disappeared from our view.\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، - وَهُوَ الْحَوْضِيُّ - قَالَ حَدَّثَنَا جَامِعُ بْنُ مَطَرٍ، عَنْ عَلْقَمَةَ بْنِ وَائِلٍ، عَنْ أَبِيهِ، قَالَ كُنْتُ قَاعِدًا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم جَاءَ رَجُلٌ فِي عُنُقِهِ نِسْعَةٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ هَذَا وَأَخِي كَانَا فِي جُبٍّ يَحْفِرَانِهَا فَرَفَعَ الْمِنْقَارَ فَضَرَبَ بِهِ رَأْسَ صَاحِبِهِ فَقَتَلَهُ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اعْفُ عَنْهُ ‏\"‏ ‏.‏ فَأَبَى وَقَالَ يَا نَبِيَّ اللَّهِ إِنَّ هَذَا وَأَخِي كَانَا فِي جُبٍّ يَحْفِرَانِهَا فَرَفَعَ الْمِنْقَارَ فَضَرَبَ بِهِ رَأْسَ صَاحِبِهِ فَقَتَلَهُ ‏.‏ فَقَالَ ‏\"‏ اعْفُ عَنْهُ ‏\"‏ ‏.‏ فَأَبَى ثُمَّ قَامَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ هَذَا وَأَخِي كَانَا فِي جُبٍّ يَحْفِرَانِهَا فَرَفَعَ الْمِنْقَارَ - أُرَاهُ قَالَ - فَضَرَبَ رَأْسَ صَاحِبِهِ فَقَتَلَهُ ‏.‏ فَقَالَ ‏\"‏ اعْفُ عَنْهُ ‏\"‏ ‏.‏ فَأَبَى قَالَ ‏\"‏ اذْهَبْ إِنْ قَتَلْتَهُ كُنْتَ مِثْلَهُ ‏\"‏ ‏.‏ فَخَرَجَ بِهِ حَتَّى جَاوَزَ فَنَادَيْنَاهُ أَمَا تَسْمَعُ مَا يَقُولُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَرَجَعَ فَقَالَ إِنْ قَتَلْتُهُ كُنْتُ مِثْلَهُ قَالَ ‏\"‏ نَعَمِ اعْفُ ‏\"‏ ‏.‏ فَخَرَجَ يَجُرُّ نِسْعَتَهُ حَتَّى خَفِيَ عَلَيْنَا ‏.‏",
    "malay_translation": "\"Saya sedang duduk bersama Rasulullah SAW ketika seorang lelaki datang dengan tali di lehernya dan berkata: 'Wahai Rasulullah, lelaki ini dan saudara saya sedang menggali lubang, dan dia mengangkat beliungnya lalu memukul kepala rakannya, membunuhnya.' Nabi SAW bersabda: 'Maafkan dia,' tetapi dia enggan dan berkata: 'Wahai Nabi Allah, lelaki ini dan saudara saya sedang menggali lubang, dan dia mengangkat beliungnya lalu memukul kepala rakannya, membunuhnya.' Nabi SAW bersabda: 'Maafkan dia,' tetapi dia enggan, kemudian dia berdiri dan berkata: 'Wahai Rasulullah, lelaki ini dan saudara saya sedang menggali lubang, dan dia mengangkat beliungnya lalu memukul kepala rakannya, membunuhnya.' Nabi SAW bersabda: 'Maafkan dia,' tetapi dia enggan. Baginda (Nabi) bersabda: 'Pergi, tetapi jika kamu membunuhnya, kamu akan menjadi sepertinya.' Maka dia membawanya keluar, dan mereka memanggilnya: 'Tidakkah kamu mendengar apa yang Rasulullah SAW katakan?' Maka dia kembali dan dia berkata: 'Jika saya membunuhnya, adakah saya akan menjadi sepertinya?' Baginda bersabda: 'Ya. Maafkan dia.' Kemudian dia keluar, menyeret talinya, sehingga dia hilang dari pandangan kami.\""
  },
  {
    "id": 19473,
    "hadith_number": 4737,
    "tajuk_hadith": "Hukuman bagi Pembunuhan dan Tawaran Penebusan",
    "perawi_melayu": "'Alqamah bin Wa'il meriwayatkan daripada ayahnya bahawa dia sedang duduk bersama Rasulullah SAW ketika seorang lelaki datang menuntun lelaki lain dengan tali.",
    "english_text": "\"O Messenger of Allah, this man killed my brother.\" The Messenger of Allah said to him: \"Did you kill him?\" He said: \"O Messenger of Allah even if he did not confess I would have brought proof against him.\" He said: \"Yes, I killed him.\" He said: \"How did you kill him?\" He said: \"He and I were chopping firewood from a tree and he insulted me, so I got angry and struck him with the ax on the forehead.\" The Messenger of Allah said: \"Do you have any wealth with which you can pay the Diyah to save yourself?\" He said: \"O Messenger of Allah, I do not have anything but my ax and my clothes.\" The Messenger of Allah said to him: \"Do you think your people will pay to save you?\" He said: \"I am too insignificant to them for that.\" He threw the string to the man and said: \"Here, thank him.\" When he turned to go, the Messenger of Allah said: \"If he kills him, he will be like him. \"They caught up with the man, and said: \"Woe to you! The Messenger of Allah said: 'If he kills him, he will be like him. \"So he went back to the Messenger of Allah and said: \"O Messenger of Allah, I have been told that you said: 'if he kills him, he will be like him. 'But I only took him because you told me to. He said: 'Don't you want him to carry your sin and the sin of your companion (the victim)?' He said: 'Yes, if that is the case.' He said: 'And that is how it is.\"'",
    "arabic_text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا حَاتِمٌ، عَنْ سِمَاكٍ، ذَكَرَ أَنَّ عَلْقَمَةَ بْنَ وَائِلٍ، أَخْبَرَهُ عَنْ أَبِيهِ، أَنَّهُ كَانَ قَاعِدًا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ جَاءَ رَجُلٌ يَقُودُ آخَرَ بِنِسْعَةٍ فَقَالَ يَا رَسُولَ اللَّهِ قَتَلَ هَذَا أَخِي ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَقَتَلْتَهُ ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ لَوْ لَمْ يَعْتَرِفْ أَقَمْتُ عَلَيْهِ الْبَيِّنَةَ ‏.‏ قَالَ نَعَمْ قَتَلْتُهُ ‏.‏ قَالَ ‏\"‏ كَيْفَ قَتَلْتَهُ ‏\"‏ ‏.‏ قَالَ كُنْتُ أَنَا وَهُوَ نَحْتَطِبُ مِنْ شَجَرَةٍ فَسَبَّنِي فَأَغْضَبَنِي فَضَرَبْتُ بِالْفَأْسِ عَلَى قَرْنِهِ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلْ لَكَ مِنْ مَالٍ تُؤَدِّيهِ عَنْ نَفْسِكَ ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ مَالِي إِلاَّ فَأْسِي وَكِسَائِي ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتُرَى قَوْمَكَ يَشْتَرُونَكَ ‏\"‏ ‏.‏ قَالَ أَنَا أَهْوَنُ عَلَى قَوْمِي مِنْ ذَاكَ ‏.‏ فَرَمَى بِالنِّسْعَةِ إِلَى الرَّجُلِ فَقَالَ ‏\"‏ دُونَكَ صَاحِبَكَ ‏\"‏ ‏.‏ فَلَمَّا وَلَّى قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنْ قَتَلَهُ فَهُوَ مِثْلُهُ ‏\"‏ ‏.‏ فَأَدْرَكُوا الرَّجُلَ فَقَالُوا وَيْلَكَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنْ قَتَلَهُ فَهُوَ مِثْلُهُ ‏\"‏ ‏.‏ فَرَجَعَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ حُدِّثْتُ أَنَّكَ قُلْتَ ‏\"‏ إِنْ قَتَلَهُ فَهُوَ مِثْلُهُ ‏\"‏ ‏.‏ وَهَلْ أَخَذْتُهُ إِلاَّ بِأَمْرِكَ فَقَالَ ‏\"‏ مَا تُرِيدُ أَنْ يَبُوءَ بِإِثْمِكَ وَإِثْمِ صَاحِبِكَ ‏\"‏ ‏.‏ قَالَ بَلَى ‏.‏ قَالَ ‏\"‏ فَإِنْ ذَاكَ ‏\"‏ ‏.‏ قَالَ ذَلِكَ كَذَلِكَ ‏.‏",
    "malay_translation": "\"Wahai Rasulullah, lelaki ini telah membunuh saudara saya.\" Rasulullah SAW bertanya kepadanya: \"Adakah kamu membunuhnya?\" Dia menjawab: \"Wahai Rasulullah, walaupun dia tidak mengaku, saya akan membawa bukti terhadapnya.\" Lelaki yang dituduh itu berkata: \"Ya, saya telah membunuhnya.\" Baginda bertanya: \"Bagaimana kamu membunuhnya?\" Dia berkata: \"Saya dan dia sedang memotong kayu api dari sebatang pokok, lalu dia menghina saya, maka saya menjadi marah dan memukul dahinya dengan kapak.\" Rasulullah SAW bersabda: \"Adakah kamu mempunyai harta yang boleh kamu bayar Diyat untuk menyelamatkan diri kamu?\" Dia menjawab: \"Wahai Rasulullah, saya tidak mempunyai apa-apa kecuali kapak dan pakaian saya.\" Rasulullah SAW bersabda kepadanya: \"Adakah kamu fikir kaum kamu akan membayar untuk menyelamatkan kamu?\" Dia berkata: \"Saya terlalu tidak bernilai bagi kaum saya untuk itu.\" Kemudian Baginda menyerahkan tali itu kepada lelaki tersebut dan berkata: \"Ambillah dia.\" Apabila dia berpaling untuk pergi, Rasulullah SAW bersabda: \"Jika dia membunuhnya, dia akan menjadi sepertinya.\" Mereka mengejar lelaki itu dan berkata: \"Celakalah kamu! Rasulullah SAW bersabda: 'Jika dia membunuhnya, dia akan menjadi sepertinya.'\" Maka dia kembali kepada Rasulullah SAW dan berkata: \"Wahai Rasulullah, saya telah diberitahu bahawa anda bersabda: 'Jika dia membunuhnya, dia akan menjadi sepertinya.' Tetapi saya hanya mengambilnya kerana anda menyuruh saya.\" Baginda bersabda: \"Tidakkah kamu mahu dia menanggung dosa kamu dan dosa sahabat kamu (mangsa)?\" Dia menjawab: \"Ya, jika itu yang berlaku.\" Baginda bersabda: \"Maka itulah keadaannya.\""
  },
  {
    "id": 19474,
    "hadith_number": 4738,
    "tajuk_hadith": "Seorang Lelaki Membawa Lelaki Lain kepada Rasulullah SAW",
    "perawi_melayu": "Diriwayatkan daripada Simak bin Harb bahawa 'Alqamah bin Wa'il memberitahunya bahawa ayahnya berkata:",
    "english_text": "\"I was sitting with the Messenger of Allah when a man came leading another\" (and he narrated) a similar report.",
    "arabic_text": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا أَبُو يُونُسَ، عَنْ سِمَاكِ بْنِ حَرْبٍ، أَنَّ عَلْقَمَةَ بْنَ وَائِلٍ، حَدَّثَهُ أَنَّ أَبَاهُ حَدَّثَهُ قَالَ إِنِّي لَقَاعِدٌ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ جَاءَ رَجُلٌ يَقُودُ آخَرَ نَحْوَهُ ‏.‏",
    "malay_translation": "\"Saya sedang duduk bersama Rasulullah SAW ketika seorang lelaki datang membawa seorang lelaki lain\" (dan dia meriwayatkan) laporan yang serupa."
  },
  {
    "id": 19475,
    "hadith_number": 4739,
    "tajuk_hadith": "Pembunuh dan yang Dibunuh di dalam Neraka serta Anjuran Memaafkan",
    "perawi_melayu": "Diriwayatkan daripada 'Alqamah bin Wa'il bahawa:",
    "english_text": "his father told them that a man who had killed another man was brought to the Prophet and he handed him over to their of the victim to kill him. Then the Prophet said to those who were sitting with him: \"The killer and the slain will both be in Fire. \"A man went after him and told him that, and when he told him that, he left him (let him go). He (the narrator) said: \"I saw him dragging his string when he let him go. I mentioned that the Habib and he said: 'Sa'eed bin Ashwa' told me that the Prophet commanded the man to forgive him.\"'",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ، عَنْ أَبِي عَوَانَةَ، عَنْ إِسْمَاعِيلَ بْنِ سَالِمٍ، عَنْ عَلْقَمَةَ بْنِ وَائِلٍ، أَنَّ أَبَاهُ، حَدَّثَهُمْ أَنَّ النَّبِيَّ صلى الله عليه وسلم أُتِيَ بِرَجُلٍ قَدْ قَتَلَ رَجُلاً فَدَفَعَهُ إِلَى وَلِيِّ الْمَقْتُولِ يَقْتُلُهُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم لِجُلَسَائِهِ ‏\n\"‏ الْقَاتِلُ وَالْمَقْتُولُ فِي النَّارِ ‏\"‏ ‏.‏ قَالَ فَاتَّبَعَهُ رَجُلٌ فَأَخْبَرَهُ فَلَمَّا أَخْبَرَهُ تَرَكَهُ ‏.‏ قَالَ فَلَقَدْ رَأَيْتُهُ يَجُرُّ نِسْعَتَهُ حِينَ تَرَكَهُ يَذْهَبُ ‏.‏ فَذَكَرْتُ ذَلِكَ لِحَبِيبٍ فَقَالَ حَدَّثَنِي سَعِيدُ بْنُ أَشْوَعَ قَالَ وَذَكَرَ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَ الرَّجُلَ بِالْعَفْوِ ‏.‏",
    "malay_translation": "Bapanya memberitahu mereka bahawa seorang lelaki yang telah membunuh seorang lelaki lain dibawa kepada Nabi SAW dan baginda menyerahkan lelaki itu kepada wali (waris) mangsa untuk membunuhnya. Kemudian Nabi SAW bersabda kepada mereka yang duduk bersama baginda: \"Pembunuh dan yang dibunuh kedua-duanya akan berada di dalam Neraka.\" Seorang lelaki mengejarnya dan memberitahunya tentang hal itu, dan apabila dia memberitahunya, dia meninggalkannya (melepaskannya). Perawi berkata: \"Saya melihatnya menyeret tali sandalnya ketika dia melepaskannya pergi. Saya menyebutkan hal itu kepada Habib dan dia berkata: 'Sa'eed bin Ashwa' memberitahu saya bahawa Nabi SAW memerintahkan lelaki itu untuk memaafkannya.'"
  },
  {
    "id": 19476,
    "hadith_number": 4740,
    "tajuk_hadith": "Anjuran Memaafkan dalam Hukuman Qisas dan Kebijaksanaan Rasulullah SAW",
    "perawi_melayu": "Diriwayatkan daripada Anas bin Malik RA bahawa seorang lelaki membawa pembunuh kerabatnya kepada Rasulullah SAW, lalu Nabi SAW bersabda:",
    "english_text": "\"Forgive him.\" But he refused. He said: \"Take the Diyah,\" but he refused. He said: \"Go and kill him then, for you are just like him.\" So he went away, but some people caught up with the man and told him that the Messenger of Allah had said: \"Messenger of Allah had said: \"Kill him for you are just like him.\" So he let him go, and the man passed by me dragging his string.",
    "arabic_text": "أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، قَالَ حَدَّثَنَا ضَمْرَةُ، عَنْ عَبْدِ اللَّهِ بْنِ شَوْذَبٍ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَجُلاً، أَتَى بِقَاتِلِ وَلِيِّهِ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اعْفُ عَنْهُ ‏\"‏ ‏.‏ فَأَبَى فَقَالَ ‏\"‏ خُذِ الدِّيَةَ ‏\"‏ ‏.‏ فَأَبَى قَالَ ‏\"‏ اذْهَبْ فَاقْتُلْهُ فَإِنَّكَ مِثْلَهُ ‏\"‏ ‏.‏ فَذَهَبَ فَلُحِقَ الرَّجُلُ فَقِيلَ لَهُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ اقْتُلْهُ فَإِنَّكَ مِثْلَهُ ‏\"‏ ‏.‏ فَخَلَّى سَبِيلَهُ فَمَرَّ بِيَ الرَّجُلُ وَهُوَ يَجُرُّ نِسْعَتَهُ ‏.‏",
    "malay_translation": "\"Maafkanlah dia.\" Tetapi dia enggan. Baginda bersabda: \"Ambillah Diyah (pampasan),\" tetapi dia enggan. Baginda bersabda: \"Pergilah dan bunuh dia, kerana kamu sama seperti dia.\" Maka dia pergi, tetapi beberapa orang mengejar lelaki itu dan memberitahunya bahawa Rasulullah SAW telah bersabda: \"Bunuh dia kerana kamu sama seperti dia.\" Lalu dia melepaskannya, dan lelaki itu berlalu di hadapanku sambil mengheret talinya."
  },
  {
    "id": 19477,
    "hadith_number": 4741,
    "tajuk_hadith": "Memaafkan Lebih Baik Daripada Balas Dendam",
    "perawi_melayu": "Diriwayatkan daripada 'Abdullah bin Buraidah, daripada ayahnya, bahawa seorang lelaki datang kepada Nabi dan berkata:",
    "english_text": "\"This man killed my brother.\" He said: \"Go and kill him as he killed your brother.\" The man said to him: \"Fear Allah and let me go, for that will bring you a greater reward and will be better for you and your brother on the Day of Resurrection.\" So he let him go. The Prophet was told about that, so he asked him about it, and he told him what he had said. He said: \"Pardoning him would be better for you than what he would have done for you on the Day of Resurrection when he said: 'O Lord, ask him why he killed me.\"'",
    "arabic_text": "أَخْبَرَنَا الْحَسَنُ بْنُ إِسْحَاقَ الْمَرْوَزِيُّ، قَالَ حَدَّثَنِي خَالِدُ بْنُ خِدَاشٍ، قَالَ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ بَشِيرِ بْنِ الْمُهَاجِرِ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، أَنَّ رَجُلاً، جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ إِنَّ هَذَا الرَّجُلَ قَتَلَ أَخِي ‏.‏ قَالَ ‏\"‏ اذْهَبْ فَاقْتُلْهُ كَمَا قَتَلَ أَخَاكَ ‏\"‏ ‏.‏ فَقَالَ لَهُ الرَّجُلُ اتَّقِ اللَّهَ وَاعْفُ عَنِّي فَإِنَّهُ أَعْظَمُ لأَجْرِكَ وَخَيْرٌ لَكَ وَلأَخِيكَ يَوْمَ الْقِيَامَةِ ‏.‏ قَالَ فَخَلَّى عَنْهُ قَالَ فَأُخْبِرَ النَّبِيُّ صلى الله عليه وسلم فَسَأَلَهُ فَأَخْبَرَهُ بِمَا قَالَ لَهُ قَالَ فَأَعْنَفَهُ ‏\"‏ أَمَا إِنَّهُ كَانَ خَيْرًا مِمَّا هُوَ صَانِعٌ بِكَ يَوْمَ الْقِيَامَةِ يَقُولُ يَا رَبِّ سَلْ هَذَا فِيمَ قَتَلَنِي ‏\"‏ ‏.‏",
    "malay_translation": "\"Orang ini telah membunuh saudara saya.\" Baginda bersabda: \"Pergi dan bunuh dia seperti dia membunuh saudara kamu.\" Lelaki itu berkata kepadanya: \"Bertakwalah kepada Allah dan lepaskan saya, kerana itu akan membawa ganjaran yang lebih besar kepada kamu dan akan menjadi lebih baik untuk kamu dan saudara kamu pada Hari Kebangkitan.\" Maka dia melepaskannya. Nabi diberitahu tentang perkara itu, lalu baginda bertanya kepadanya tentangnya, dan dia memberitahu baginda apa yang telah dikatakannya. Baginda bersabda: \"Memaafkannya adalah lebih baik untuk kamu daripada apa yang akan dia lakukan untuk kamu pada Hari Kebangkitan apabila dia berkata: 'Ya Tuhan, tanyalah dia mengapa dia membunuhku.'\""
  },
  {
    "id": 19478,
    "hadith_number": 4742,
    "tajuk_hadith": "Keadilan dalam Hukuman antara Bani Quraizah dan Bani Nadir",
    "perawi_melayu": "Diriwayatkan daripada Simak, daripada 'Ikrimah, bahawa Ibn 'Abbas berkata:",
    "english_text": "\"There were (the two tribes of) Quraizah and An-Nadir, and An-Nadir was nobler than Quraiaah. If a man of Quraizah Killed a man of An-Nadir, he would be killed in return, but if a man of An-Nadir killed a man of Quraizah, he would pay a Diyah of one hundred Wasqs of dates.  When An-Nadir killed a man of Quraizah, and they said: 'Hand him over to us and we will kill him.' They said: 'Between us and you (as judge) is the Prophet.' So they came to him, then the following was revealed: \"And if you judge, judge with justice between them.\"",
    "arabic_text": "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، قَالَ أَنْبَأَنَا عَلِيٌّ، - وَهُوَ ابْنُ صَالِحٍ - عَنْ سِمَاكٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ قُرَيْظَةُ وَالنَّضِيرُ وَكَانَ النَّضِيرُ أَشْرَفَ مِنْ قُرَيْظَةَ وَكَانَ إِذَا قَتَلَ رَجُلٌ مِنْ قُرَيْظَةَ رَجُلاً مِنَ النَّضِيرِ قُتِلَ بِهِ وَإِذَا قَتَلَ رَجُلٌ مِنَ النَّضِيرِ رَجُلاً مِنْ قُرَيْظَةَ أَدَّى مِائَةَ وَسْقٍ مِنْ تَمْرٍ فَلَمَّا بُعِثَ النَّبِيُّ صلى الله عليه وسلم قَتَلَ رَجُلٌ مِنَ النَّضِيرِ رَجُلاً مِنْ قُرَيْظَةَ فَقَالُوا ادْفَعُوهُ إِلَيْنَا نَقْتُلْهُ ‏.‏ فَقَالُوا بَيْنَنَا وَبَيْنَكُمُ النَّبِيُّ صلى الله عليه وسلم ‏.‏ فَأَتَوْهُ فَنَزَلَتْ ‏{‏ وَإِنْ حَكَمْتَ فَاحْكُمْ بَيْنَهُمْ بِالْقِسْطِ ‏}‏ وَالْقِسْطُ النَّفْسُ بِالنَّفْسِ ثُمَّ نَزَلَتْ ‏{‏ أَفَحُكْمَ الْجَاهِلِيَّةِ يَبْغُونَ ‏}‏ ‏.‏",
    "malay_translation": "Dahulu ada (dua suku kaum) Quraizah dan An-Nadir, dan An-Nadir lebih mulia daripada Quraizah. Jika seorang lelaki dari Quraizah membunuh seorang lelaki dari An-Nadir, dia akan dibunuh sebagai balasan, tetapi jika seorang lelaki dari An-Nadir membunuh seorang lelaki dari Quraizah, dia akan membayar Diyah sebanyak seratus Wasq kurma. Ketika An-Nadir membunuh seorang lelaki dari Quraizah, dan mereka berkata: 'Serahkan dia kepada kami dan kami akan membunuhnya.' Mereka berkata: 'Antara kami dan kamu (sebagai hakim) adalah Nabi.' Maka mereka datang kepada baginda, lalu turunlah ayat: \"Dan jika engkau menghukum, hukumlah dengan adil di antara mereka.\""
  },
  {
    "id": 19479,
    "hadith_number": 4743,
    "tajuk_hadith": "Ayat Tentang Diyat (Pampasan) Antara Bani Nadir dan Quraizah",
    "perawi_melayu": "Diriwayatkan daripada Dawud bin Al-Husain, daripada 'Ikrimah, daripada Ibn 'Abbas, bahawa ayat-ayat dalam Surah Al-Ma'idah, di mana Allah, Yang Maha Perkasa dan Maha Agung, berfirman:",
    "english_text": "\"Either judge between them, or turn away from them. If you turn away from then up to: those who act justly.\" - were revealed concerning the matter of blood money between An-Nadir and Quraizah. That was because the slain of An-Nadir were of noble status, so the blood money would be paid in full for them, but for Banu Quraizah only half of the blood money would be paid. They referred the matter to the Messenger of Allah for judgment, then Allah, the Mighty and Sublime, revealed that concerning them, so the Messenger of Allah told them to do the right thing and he made the blood money equal.",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدٍ، قَالَ حَدَّثَنَا عَمِّي، قَالَ حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، أَخْبَرَنِي دَاوُدُ بْنُ الْحُصَيْنِ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ الآيَاتِ الَّتِي، فِي الْمَائِدَةِ الَّتِي قَالَهَا اللَّهُ عَزَّ وَجَلَّ ‏{‏ فَاحْكُمْ بَيْنَهُمْ أَوْ أَعْرِضْ عَنْهُمْ ‏}‏ إِلَى ‏{‏ الْمُقْسِطِينَ ‏}‏ إِنَّمَا نَزَلَتْ فِي الدِّيَةِ بَيْنَ النَّضِيرِ وَبَيْنَ قُرَيْظَةَ وَذَلِكَ أَنَّ قَتْلَى النَّضِيرِ كَانَ لَهُمْ شَرَفٌ يُودَوْنَ الدِّيَةَ كَامِلَةً وَأَنَّ بَنِي قُرَيْظَةَ كَانُوا يُودَوْنَ نِصْفَ الدِّيَةِ فَتَحَاكَمُوا فِي ذَلِكَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ذَلِكَ فِيهِمْ فَحَمَلَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الْحَقِّ فِي ذَلِكَ فَجَعَلَ الدِّيَةَ سَوَاءً ‏.‏",
    "malay_translation": "\"Sama ada kamu menghakimi antara mereka, atau berpaling daripada mereka. Jika kamu berpaling daripada mereka hingga: mereka yang bertindak adil.\" - diturunkan berkenaan dengan perkara diyat (pampasan) antara An-Nadir dan Quraizah. Ini kerana mereka yang terbunuh dari An-Nadir mempunyai kedudukan yang mulia, jadi diyat akan dibayar sepenuhnya untuk mereka, tetapi bagi Bani Quraizah hanya separuh daripada diyat akan dibayar. Mereka merujuk perkara itu kepada Rasulullah SAW untuk penghakiman, kemudian Allah, Yang Maha Perkasa dan Maha Agung, menurunkan wahyu berkenaan mereka, maka Rasulullah SAW memberitahu mereka untuk melakukan perkara yang betul dan baginda menyamakan diyat tersebut."
  },
  {
    "id": 19480,
    "hadith_number": 4744,
    "tajuk_hadith": "Kesaksamaan Nyawa Orang Mukmin dan Larangan Membunuh dengan Tidak Adil",
    "perawi_melayu": "Diriwayatkan daripada Qais bin 'Ubad berkata:",
    "english_text": "\"Al-Ashtar and I went to 'Ali, may Allah be pleased with him, and said: Did the Prophet of Allah tell you anything that he did not tell to all the people?' He said: 'No, except what is in this letter of mine.' He brought out a letter from the sheath of his sword and it said therein: \"The lives of the believers are equal in value, and they are one against others, and they hasten to support the asylum granted by the least of them. But no believer may be killed in return for a disbeliever, nor one with a covenant while his convenant is in effect. Whoever commits an offense then the blame is on himself, and whoever gives sanctuary to an offender, then upon him will be the curse of Allah, the angels and all the people.\"",
    "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ قَيْسِ بْنِ عُبَادٍ، قَالَ انْطَلَقْتُ أَنَا وَالأَشْتَرُ، إِلَى عَلِيٍّ رضى الله عنه فَقُلْنَا هَلْ عَهِدَ إِلَيْكَ نَبِيُّ اللَّهِ صلى الله عليه وسلم شَيْئًا لَمْ يَعْهَدْهُ إِلَى النَّاسِ عَامَّةً قَالَ لاَ إِلاَّ مَا كَانَ فِي كِتَابِي هَذَا ‏.‏ فَأَخْرَجَ كِتَابًا مِنْ قِرَابِ سَيْفِهِ فَإِذَا فِيهِ ‏\n\"‏ الْمُؤْمِنُونَ تَكَافَأُ دِمَاؤُهُمْ وَهُمْ يَدٌ عَلَى مَنْ سِوَاهُمْ وَيَسْعَى بِذِمَّتِهِمْ أَدْنَاهُمْ أَلاَ لاَ يُقْتَلُ مُؤْمِنٌ بِكَافِرٍ وَلاَ ذُو عَهْدٍ بِعَهْدِهِ مَنْ أَحْدَثَ حَدَثًا فَعَلَى نَفْسِهِ أَوْ آوَى مُحْدِثًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ ‏\"‏ ‏.‏",
    "malay_translation": "\"Al-Ashtar dan saya pergi menemui 'Ali, semoga Allah meredhainya, dan berkata: 'Adakah Rasulullah SAW memberitahu anda sesuatu yang tidak diberitahu kepada semua orang?' Beliau berkata: 'Tidak, kecuali apa yang ada dalam surat saya ini.' Beliau mengeluarkan surat dari sarung pedangnya dan di dalamnya tertulis: 'Nyawa orang-orang mukmin adalah sama nilainya, dan mereka bersatu menentang orang lain, dan mereka bersegera menyokong perlindungan yang diberikan oleh orang yang paling rendah di antara mereka. Tetapi tidak boleh seorang mukmin dibunuh sebagai balasan untuk seorang kafir, atau seorang yang mempunyai perjanjian selagi perjanjiannya berkuat kuasa. Sesiapa yang melakukan kesalahan maka kesalahan itu atas dirinya sendiri, dan sesiapa yang memberi perlindungan kepada seorang pesalah, maka ke atasnya laknat Allah, para malaikat dan seluruh manusia.'"
  },
  {
    "id": 19481,
    "hadith_number": 4745,
    "tajuk_hadith": "Kesamaan Nilai Nyawa Orang Beriman dan Larangan Membunuh Orang Beriman dengan Orang Kafir",
    "perawi_melayu": "Diriwayatkan daripada 'Ali, semoga Allah meredhainya, bahawa Nabi bersabda:",
    "english_text": "\"The lives of the believers are equal in value, and they are one against others, and they hasten to support the asylum granted by the least of them. But no believer may be killed in return for a disbeliever, nor one with a covenant while his covenant is in effect.\"",
    "arabic_text": "أَخْبَرَنِي أَبُو بَكْرِ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا الْقَوَارِيرِيُّ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْوَاحِدِ، قَالَ حَدَّثَنَا عُمَرُ بْنُ عَامِرٍ، عَنْ قَتَادَةَ، عَنْ أَبِي حَسَّانَ، عَنْ عَلِيٍّ، رضى الله عنه أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْمُؤْمِنُونَ تَكَافَأُ دِمَاؤُهُمْ وَهُمْ يَدٌ عَلَى مَنْ سِوَاهُمْ يَسْعَى بِذِمَّتِهِمْ أَدْنَاهُمْ لاَ يُقْتَلُ مُؤْمِنٌ بِكَافِرٍ وَلاَ ذُو عَهْدٍ فِي عَهْدِهِ ‏\"‏ ‏.‏",
    "malay_translation": "\"Nyawa orang-orang beriman adalah sama nilainya, dan mereka bersatu menentang orang lain, dan mereka bersegera menyokong perlindungan yang diberikan oleh orang yang paling rendah di antara mereka. Tidak boleh seorang mukmin dibunuh sebagai balasan untuk seorang kafir, dan tidak juga seseorang yang mempunyai perjanjian selagi perjanjiannya masih berkuatkuasa.\""
  },
  {
    "id": 19482,
    "hadith_number": 4746,
    "tajuk_hadith": "Hukuman bagi Pembunuhan, Pencacatan, dan Pengebirian Hamba",
    "perawi_melayu": "Diriwayatkan daripada Samurah bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Whoever kills his slave, we will kill him: whoever mutilates (his slave). We will mutilate him, and whoever castrates (his slave), we will castrate him.\"",
    "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، - هُوَ الْمَرْوَزِيُّ - قَالَ حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ وَمَنْ جَدَعَهُ جَدَعْنَاهُ وَمَنْ أَخْصَاهُ أَخْصَيْنَاهُ ‏\"‏ ‏.‏",
    "malay_translation": "Sesiapa yang membunuh hambanya, kami akan membunuhnya; sesiapa yang mencacatkannya, kami akan mencacatkannya; dan sesiapa yang mengebirinya, kami akan mengebirinya."
  },
  {
    "id": 19483,
    "hadith_number": 4747,
    "tajuk_hadith": "Hukuman bagi Pembunuh Hamba dan Pelaku Mutilasi",
    "perawi_melayu": "Diriwayatkan daripada Samurah bahawa Nabi bersabda:",
    "english_text": "\"Whoever kills his slave, we will kill him, and whoever mutilates his slave, we will mutilate him.\"",
    "arabic_text": "أَخْبَرَنَا نَصْرُ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ وَمَنْ جَدَعَ عَبْدَهُ جَدَعْنَاهُ ‏\"‏ ‏.‏",
    "malay_translation": "\"Sesiapa yang membunuh hambanya, kami akan membunuhnya, dan sesiapa yang memutilasi hambanya, kami akan memutilasinya.\""
  },
  {
    "id": 19484,
    "hadith_number": 4748,
    "tajuk_hadith": "Hukuman bagi Pembunuh atau Pencacat Hamba",
    "perawi_melayu": "Diriwayatkan daripada Samurah, beliau berkata:",
    "english_text": "\"The Prophet said: 'Whoever kills his slave, we will kill him, and whoever mutilates his slave, we will mutilate him.\"'",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ وَمَنْ جَدَعَ عَبْدَهُ جَدَعْنَاهُ ‏\"‏ ‏.‏",
    "malay_translation": "\"Rasulullah SAW bersabda: 'Sesiapa yang membunuh hambanya, kami akan membunuhnya, dan sesiapa yang mencacatkan hambanya, kami akan mencacatkannya.'\""
  },
  {
    "id": 19485,
    "hadith_number": 4749,
    "tajuk_hadith": "Hukuman bagi Pembunuhan Janin dan Wanita",
    "perawi_melayu": "'Amr bin Dinar meriwayatkan bahawa:",
    "english_text": "he heard Tawus narrate from Ibn 'Abbas, from 'Umar, may Allah be pleased with him, that he asked about the ruling of the Messenger of Allah concerning that. Hamal bin Malik stood up and said: \"I was married to two women, and one of them struck the other with a tent pole and killed her and her fetus. The Prophet ruled that a slave be given (as Diyah) for her fetus and that she be killed (for killing the other woman).\"",
    "arabic_text": "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، أَنَّهُ سَمِعَ طَاوُسًا، يُحَدِّثُ عَنِ ابْنِ عَبَّاسٍ، عَنْ عُمَرَ، رضى الله عنه أَنَّهُ نَشَدَ قَضَاءَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي ذَلِكَ فَقَامَ حَمَلُ بْنُ مَالِكٍ فَقَالَ كُنْتُ بَيْنَ حُجْرَتَىِ امْرَأَتَيْنِ فَضَرَبَتْ إِحْدَاهُمَا الأُخْرَى بِمِسْطَحٍ فَقَتَلَتْهَا وَجَنِينَهَا فَقَضَى النَّبِيُّ صلى الله عليه وسلم فِي جَنِينِهَا بِغُرَّةٍ وَأَنْ تُقْتَلَ بِهَا ‏.‏",
    "malay_translation": "Dia mendengar Tawus meriwayatkan daripada Ibn 'Abbas, daripada 'Umar, semoga Allah meredhainya, bahawa dia bertanya tentang hukum Rasulullah SAW berkenaan dengan perkara itu. Hamal bin Malik berdiri dan berkata: \"Saya berkahwin dengan dua orang wanita, dan salah seorang daripada mereka memukul yang lain dengan tiang khemah lalu membunuhnya dan janinnya. Nabi SAW memutuskan bahawa seorang hamba diberikan (sebagai Diyah) untuk janinnya dan dia dibunuh (kerana membunuh wanita yang lain).\""
  },
  {
    "id": 19486,
    "hadith_number": 4750,
    "tajuk_hadith": "Hukuman Qisas ke atas Seorang Yahudi yang Membunuh Seorang Gadis",
    "perawi_melayu": "Diriwayatkan daripada Anas RA bahawa:",
    "english_text": "a Jew killed a young girl for her jewelry, so the Messenger of Allah killed him in retaliation for her.",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَبْدَةُ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، رضى الله عنه أَنَّ يَهُودِيًّا، قَتَلَ جَارِيَةً عَلَى أَوْضَاحٍ لَهَا فَأَقَادَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بِهَا ‏.‏",
    "malay_translation": "Seorang Yahudi telah membunuh seorang gadis muda kerana perhiasannya, maka Rasulullah SAW telah menjatuhkan hukuman qisas (balasan setimpal) dengan membunuhnya sebagai balasan terhadap perbuatan membunuh gadis tersebut."
  },
  {
    "id": 19487,
    "hadith_number": 4751,
    "tajuk_hadith": "Hukuman Bagi Seorang Yahudi yang Membunuh Seorang Gadis",
    "perawi_melayu": "Diriwayatkan dari Anas bin Malik bahawa:",
    "english_text": "a Jew took some jewelry from a girl, then he crushed her head between two rocks. They found her as she was breathing her last, and they took her around among the people (saying); \"Was it this one? Was it this one?\" (When) she said yes, the Messenger of Allah ordered that his head be crushed between two rocks.",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا أَبُو هِشَامٍ، قَالَ حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ يَهُودِيًّا، أَخَذَ أَوْضَاحًا مِنْ جَارِيَةٍ ثُمَّ رَضَخَ رَأْسَهَا بَيْنَ حَجَرَيْنِ فَأَدْرَكُوهَا وَبِهَا رَمَقٌ فَجَعَلُوا يَتَّبِعُونَ بِهَا النَّاسَ هُوَ هَذَا هُوَ هَذَا قَالَتْ نَعَمْ ‏.‏ فَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَرُضِخَ رَأْسُهُ بَيْنَ حَجَرَيْنِ ‏.‏",
    "malay_translation": "Seorang Yahudi mengambil beberapa perhiasan daripada seorang gadis, kemudian dia menghancurkan kepalanya di antara dua batu. Mereka menemuinya ketika dia sedang menghembuskan nafas terakhir, dan mereka membawanya berkeliling di kalangan orang ramai (sambil berkata); \"Adakah ini orangnya? Adakah ini orangnya?\" (Apabila) dia berkata ya, Rasulullah SAW memerintahkan agar kepalanya dihancurkan di antara dua batu."
  },
  {
    "id": 19488,
    "hadith_number": 4752,
    "tajuk_hadith": "Hukuman bagi Pembunuh Seorang Gadis Yahudi",
    "perawi_melayu": "Diriwayatkan daripada Anas bin Malik berkata:",
    "english_text": "\"A girl went out wearing some jewelry and a Jew caught her, crushed her head between two rocks and took the jewelry that she was wearing. She was found as she was breathing her last, and she was brought to the Messenger of Allah who said: 'Who killed you? Was it so and so?' She gestured no with her head, and he continued asking until he named the Jew, and she gestured yes with her head. He was caught and he confessed (to his crime), then the Messenger of Allah ordered that his head be crushed between two rocks.\"",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَنْبَأَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ هَمَّامٍ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ خَرَجَتْ جَارِيَةٌ عَلَيْهَا أَوْضَاحٌ فَأَخَذَهَا يَهُودِيٌّ فَرَضَخَ رَأْسَهَا وَأَخَذَ مَا عَلَيْهَا مِنَ الْحُلِيِّ فَأُدْرِكَتْ وَبِهَا رَمَقٌ فَأُتِيَ بِهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَنْ قَتَلَكِ فُلاَنٌ ‏\"‏ ‏.‏ قَالَتْ بِرَأْسِهَا لاَ ‏.‏ قَالَ ‏\"‏ فُلاَنٌ ‏\"‏ ‏.‏ قَالَ حَتَّى سَمَّى الْيَهُودِيَّ قَالَتْ بِرَأْسِهَا نَعَمْ فَأُخِذَ فَاعْتَرَفَ فَأَمَرَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَرُضِخَ رَأْسُهُ بَيْنَ حَجَرَيْنِ ‏.‏",
    "malay_translation": "Seorang gadis keluar memakai perhiasan, lalu seorang Yahudi menangkapnya, menghancurkan kepalanya di antara dua batu dan mengambil perhiasan yang dipakainya. Dia ditemukan dalam keadaan hampir meninggal dunia, dan dia dibawa kepada Rasulullah SAW yang bersabda: 'Siapa yang membunuhmu? Apakah si fulan?' Dia menggelengkan kepalanya sebagai tanda tidak, dan Baginda terus bertanya sehingga Baginda menyebut nama Yahudi itu, dan dia menganggukkan kepalanya sebagai tanda ya. Dia ditangkap dan dia mengaku (atas jenayahnya), kemudian Rasulullah SAW memerintahkan agar kepalanya dihancurkan di antara dua batu."
  },
  {
    "id": 19489,
    "hadith_number": 4753,
    "tajuk_hadith": "Hukuman Bunuh Bagi Seorang Muslim: Zina Muhsan, Membunuh dengan Sengaja, dan Murtad Memerangi Allah dan Rasul-Nya",
    "perawi_melayu": "Diriwayatkan daripada 'Aishah, Ummul Mukminin, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"It is not permissible to kill a Muslim except in one of three cases: A adulterer who has been married, who is to be stoned; a man who kills a Muslim deliberately; and a man who leaves Islam and wages war against Allah, the Mighty and Sublime, and His Messenger, who is to be killed, crucified or banished from the land.\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي إِبْرَاهِيمُ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، عَنْ عُبَيْدِ بْنِ عُمَيْرٍ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ لاَ يَحِلُّ قَتْلُ مُسْلِمٍ إِلاَّ فِي إِحْدَى ثَلاَثِ خِصَالٍ زَانٍ مُحْصَنٍ فَيُرْجَمُ وَرَجُلٌ يَقْتُلُ مُسْلِمًا مُتَعَمِّدًا وَرَجُلٌ يَخْرُجُ مِنَ الإِسْلاَمِ فَيُحَارِبُ اللَّهَ عَزَّ وَجَلَّ وَرَسُولَهُ فَيُقْتَلُ أَوْ يُصَلَّبُ أَوْ يُنْفَى مِنَ الأَرْضِ ‏\"‏ ‏.‏",
    "malay_translation": "Tidak halal membunuh seorang Muslim kecuali dalam salah satu daripada tiga perkara: Penzina *muhsan* (yang telah berkahwin), maka direjam; seorang lelaki yang membunuh seorang Muslim dengan sengaja; dan seorang lelaki yang keluar daripada Islam lalu memerangi Allah *'Azza wa Jalla* dan Rasul-Nya, maka dia dibunuh, disalib, atau diusir dari negeri itu."
  },
  {
    "id": 19490,
    "hadith_number": 4754,
    "tajuk_hadith": "Larangan Membunuh Seorang Muslim Kerana Membunuh Orang Kafir dan Penebusan Tawanan",
    "perawi_melayu": "Diriwayatkan daripada Ash-Sha'bi yang berkata:",
    "english_text": "\"I heard Abu Juhaifah say: 'We asked 'Ali: \"Do you have anything from the Messenger of Allah apart from the Qur'an?\" He said:  \"No, by the One who splits the seeds and creates the soul, unless Allah gives a slave understanding of His Book, or except this sheet.\" I said: \"What is in the sheet?\" He said: \"In it are (the regulations concerning) blood money and the freeing of captives and (the rule) that no Muslim should be killed for killing a disbeliever.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ مُطَرِّفِ بْنِ طَرِيفٍ، عَنِ الشَّعْبِيِّ، قَالَ سَمِعْتُ أَبَا جُحَيْفَةَ، يَقُولُ سَأَلْنَا عَلِيًّا فَقُلْنَا هَلْ عِنْدَكُمْ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم شَىْءٌ سِوَى الْقُرْآنِ فَقَالَ لاَ وَالَّذِي فَلَقَ الْحَبَّةَ وَبَرَأَ النَّسَمَةَ إِلاَّ أَنْ يُعْطِيَ اللَّهُ عَزَّ وَجَلَّ عَبْدًا فَهْمًا فِي كِتَابِهِ أَوْ مَا فِي هَذِهِ الصَّحِيفَةِ ‏.‏ قُلْتُ وَمَا فِي الصَّحِيفَةِ قَالَ فِيهَا ‏\n\"‏ الْعَقْلُ وَفِكَاكُ الأَسِيرِ وَأَنْ لاَ يُقْتَلَ مُسْلِمٌ بِكَافِرٍ ‏\"‏ ‏.‏",
    "malay_translation": "\"Saya mendengar Abu Juhaifah berkata: 'Kami bertanya kepada 'Ali: \"Adakah kamu mempunyai apa-apa daripada Rasulullah selain daripada Al-Qur'an?\" Beliau berkata: \"Tidak, demi Zat yang membelah biji-bijian dan menciptakan jiwa, kecuali jika Allah memberikan seorang hamba pemahaman tentang Kitab-Nya, atau kecuali lembaran ini.\" Saya berkata: \"Apa yang ada di dalam lembaran itu?\" Beliau berkata: \"Di dalamnya terdapat (peraturan mengenai) diyat (tebusan darah) dan pembebasan tawanan dan (ketetapan) bahawa seorang Muslim tidak boleh dibunuh kerana membunuh seorang kafir.\""
  },
  {
    "id": 19491,
    "hadith_number": 4755,
    "tajuk_hadith": "Kesaksamaan Nyawa Orang Mukmin dan Perlindungan Suaka",
    "perawi_melayu": "Diriwayatkan daripada Abi Hassan berkata:",
    "english_text": "\"Ali said: 'The Messenger of Allah did not tell me anything that he did not tell the people, except what is in a sheet in the sheath of my word.' They did not leave him alone until he brought out the sheet, and in it (were the words): 'The lives of the believers are equal in value, and they hasten to support the asylum granted by the least of them, and they are one against others. But no believer may be killed in return for a disbeliever, nor one with a covenant while his covenant is in effect.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا الْحَجَّاجُ بْنُ مِنْهَالٍ، قَالَ حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَبِي حَسَّانَ، قَالَ قَالَ عَلِيٌّ مَا عَهِدَ إِلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِشَىْءٍ دُونَ النَّاسِ إِلاَّ فِي صَحِيفَةٍ فِي قِرَابِ سَيْفِي ‏.‏ فَلَمْ يَزَالُوا بِهِ حَتَّى أَخْرَجَ الصَّحِيفَةَ فَإِذَا فِيهَا ‏\n\"‏ الْمُؤْمِنُونَ تَكَافَأُ دِمَاؤُهُمْ يَسْعَى بِذِمَّتِهِمْ أَدْنَاهُمْ وَهُمْ يَدٌ عَلَى مَنْ سِوَاهُمْ لاَ يُقْتَلُ مُؤْمِنٌ بِكَافِرٍ وَلاَ ذُو عَهْدٍ فِي عَهْدِهِ ‏\"‏ ‏.‏",
    "malay_translation": "\"Ali berkata: 'Rasulullah SAW tidak memberitahu saya apa-apa yang tidak diberitahu kepada orang ramai, kecuali apa yang terdapat dalam sehelai kertas dalam sarung pedang saya.' Mereka tidak membiarkannya sehingga dia mengeluarkan helaian itu, dan di dalamnya (terdapat kata-kata): 'Nyawa orang-orang mukmin adalah sama nilainya, dan mereka bersegera untuk menyokong suaka yang diberikan oleh yang paling rendah di antara mereka, dan mereka bersatu menentang orang lain. Tetapi tidak boleh seorang mukmin dibunuh sebagai balasan untuk orang kafir, atau seorang yang mempunyai perjanjian selagi perjanjiannya masih berkuat kuasa.'\""
  },
  {
    "id": 19492,
    "hadith_number": 4756,
    "tajuk_hadith": "Kesaksamaan Nyawa Orang Mukmin dan Larangan Membunuh Mukmin Sebagai Balasan Orang Kafir",
    "perawi_melayu": "Diriwayatkan daripada Al-Ashtar bahawa dia berkata kepada 'Ali:",
    "english_text": "\"What the people have been hearing from you has become widespread. If the Messenger of Allah told you anything, then tell us,\" He said: \"The Messenger of Allah did not tell me anything that he did not tell the people, except that in the sheath of my sword there is a sheet, in which it says: 'The lives of the believers are equal in value, and they hasten to support the asylum granted by the least of them. But no believer may be killed in return for a disbeliever, nor one with a covenant while his covenant is in effect.\"' It is an abridgement of it.",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصٍ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ، عَنِ الْحَجَّاجِ بْنِ الْحَجَّاجِ، عَنْ قَتَادَةَ، عَنْ أَبِي حَسَّانَ الأَعْرَجِ، عَنِ الأَشْتَرِ، أَنَّهُ قَالَ لِعَلِيٍّ إِنَّ النَّاسَ قَدْ تَفَشَّغَ بِهِمْ مَا يَسْمَعُونَ فَإِنْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَهِدَ إِلَيْكَ عَهْدًا فَحَدِّثْنَا بِهِ ‏.‏ قَالَ مَا عَهِدَ إِلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم عَهْدًا لَمْ يَعْهَدْهُ إِلَى النَّاسِ غَيْرَ أَنَّ فِي قِرَابِ سَيْفِي صَحِيفَةً فَإِذَا فِيهَا ‏\n\"‏ الْمُؤْمِنُونَ تَتَكَافَأُ دِمَاؤُهُمْ يَسْعَى بِذِمَّتِهِمْ أَدْنَاهُمْ لاَ يُقْتَلُ مُؤْمِنٌ بِكَافِرٍ وَلاَ ذُو عَهْدٍ فِي عَهْدِهِ ‏\"‏ ‏.‏ مُخْتَصَرٌ ‏.‏",
    "malay_translation": "\"Apa yang didengari oleh orang ramai daripada kamu telah tersebar luas. Jika Rasulullah SAW memberitahu kamu sesuatu, maka beritahulah kepada kami,\" Kata 'Ali: \"Rasulullah SAW tidak memberitahu saya apa-apa yang tidak diberitahu kepada orang ramai, kecuali bahawa di sarung pedang saya terdapat sehelai kertas, yang tertulis: 'Nyawa orang-orang mukmin adalah sama nilainya, dan mereka bersegera menyokong suaka yang diberikan oleh orang yang paling rendah di antara mereka. Tetapi tidak boleh seorang mukmin dibunuh sebagai balasan untuk seorang kafir, dan tidak juga seorang yang mempunyai perjanjian selagi perjanjiannya masih berkuat kuasa.'\" Ia adalah ringkasan daripadanya."
  },
  {
    "id": 19493,
    "hadith_number": 4757,
    "tajuk_hadith": "Larangan Membunuh Mu'ahad Tanpa Sebab yang Dibenarkan",
    "perawi_melayu": "Abu Bakrah berkata:",
    "english_text": "\"The Messenger of Allah said: 'Whoever kills a Mu'ahad with no justification, Allah will forbid Paradise to him.\"",
    "arabic_text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ عُيَيْنَةَ، قَالَ أَخْبَرَنِي أَبِي قَالَ، قَالَ أَبُو بَكْرَةَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ قَتَلَ مُعَاهِدًا فِي غَيْرِ كُنْهِهِ حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: 'Sesiapa yang membunuh seorang Mu'ahad tanpa sebab yang dibenarkan, Allah akan mengharamkan syurga baginya.'"
  },
  {
    "id": 19494,
    "hadith_number": 4758,
    "tajuk_hadith": "Larangan Membunuh Mu'ahad Tanpa Sebab yang Dibenarkan",
    "perawi_melayu": "Diriwayatkan daripada Abu Bakrah, beliau berkata:",
    "english_text": "The Messenger of Allah said: \"Whoever kills a Mu'ahad with no justification, Allah will forbid Paradise to him and he will not even smell its fragrance.\"",
    "arabic_text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ يُونُسَ، عَنِ الْحَكَمِ بْنِ الأَعْرَجِ، عَنِ الأَشْعَثِ بْنِ ثُرْمُلَةَ، عَنْ أَبِي بَكْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ قَتَلَ نَفْسًا مُعَاهِدَةً بِغَيْرِ حِلِّهَا حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ أَنْ يَشُمَّ رِيحَهَا ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Sesiapa yang membunuh seorang Mu'ahad tanpa sebab yang dibenarkan, Allah akan mengharamkan baginya syurga, bahkan dia tidak akan dapat menghidu baunya sekalipun.\""
  },
  {
    "id": 19495,
    "hadith_number": 4759,
    "tajuk_hadith": "Ancaman Bagi Pembunuh Ahli Zimmah",
    "perawi_melayu": "Diriwayatkan daripada Al-Qasim bin Al-Mukhaimirah, daripada seorang lelaki dalam kalangan Sahabat Nabi SAW, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Whoever kills a man from among Ahl Adh-Dhimmah. he will not smell the fragrance of Paradise, and its fragrance may be detected from a distance of seventy years.\"",
    "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا النَّضْرُ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ هِلاَلِ بْنِ يِسَافٍ، عَنِ الْقَاسِمِ بْنِ مُخَيْمِرَةَ، عَنْ رَجُلٍ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ قَتَلَ رَجُلاً مِنْ أَهْلِ الذِّمَّةِ لَمْ يَجِدْ رِيحَ الْجَنَّةِ وَإِنَّ رِيحَهَا لَيُوجَدُ مِنْ مَسِيرَةِ سَبْعِينَ عَامًا ‏\"‏ ‏.‏",
    "malay_translation": "Sesiapa yang membunuh seorang lelaki daripada kalangan Ahli Zimmah, dia tidak akan mencium bau syurga, dan sesungguhnya baunya itu dapat dikesan dari jarak perjalanan tujuh puluh tahun."
  },
  {
    "id": 19496,
    "hadith_number": 4760,
    "tajuk_hadith": "Ancaman bagi Pembunuh Ahli Zhimmah",
    "perawi_melayu": "Diriwayatkan daripada 'Abdullah bin 'Amr berkata:",
    "english_text": "\"The Messenger of Allah said: 'Whoever kills a person from among Ahl Adh-Dhimmah, he will not smell the fragrance of Paradise, and its fragrance may be detected from a distance of forty years.'\"",
    "arabic_text": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، دُحَيْمٌ قَالَ حَدَّثَنَا مَرْوَانُ، قَالَ حَدَّثَنَا الْحَسَنُ، - وَهُوَ ابْنُ عَمْرٍو - عَنْ مُجَاهِدٍ، عَنْ جُنَادَةَ بْنِ أَبِي أُمَيَّةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ قَتَلَ قَتِيلاً مِنْ أَهْلِ الذِّمَّةِ لَمْ يَجِدْ رِيحَ الْجَنَّةِ وَإِنَّ رِيحَهَا لَيُوجَدُ مِنْ مَسِيرَةِ أَرْبَعِينَ عَامًا ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: 'Sesiapa yang membunuh seorang daripada kalangan Ahli Zhimmah, dia tidak akan mencium bau syurga, dan sesungguhnya baunya itu dapat dikesan dari jarak perjalanan empat puluh tahun.'"
  },
  {
    "id": 19497,
    "hadith_number": 4761,
    "tajuk_hadith": "Hamba Memotong Telinga Hamba Lain: Tiada Gantian Diberikan",
    "perawi_melayu": "Diriwayatkan daripada 'Imran bin Hussain bahawa:",
    "english_text": "a slave belonging to some poor people cut off the ear of a slave belonging to some rich people. They came to the Prophet but he did not give them anything.",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ أَبِي نَضْرَةَ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّ غُلاَمًا، لأُنَاسٍ فُقَرَاءَ قَطَعَ أُذُنَ غُلاَمٍ لأُنَاسٍ أَغْنِيَاءَ فَأَتَوُا النَّبِيَّ صلى الله عليه وسلم فَلَمْ يَجْعَلْ لَهُمْ شَيْئًا ‏.‏",
    "malay_translation": "Seorang hamba milik orang miskin telah memotong telinga seorang hamba milik orang kaya. Mereka datang kepada Nabi Muhammad SAW, tetapi baginda tidak memberikan apa-apa gantian kepada mereka."
  },
  {
    "id": 19498,
    "hadith_number": 4762,
    "tajuk_hadith": "Hukum Qisas dalam Kes Kecederaan Gigi",
    "perawi_melayu": "Diriwayatkan daripada Anas bahawa:",
    "english_text": "the Messenger of Allah ruled that Qisas should be given for a tooth. The Messenger of Allah said: \"The Messenger of Allah said: \"What Allah has decreed is retaliation.\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا أَبُو خَالِدٍ، سُلَيْمَانُ بْنُ حَيَّانَ قَالَ حَدَّثَنَا حُمَيْدٌ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى بِالْقِصَاصِ فِي السِّنِّ وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ كِتَابُ اللَّهِ الْقِصَاصُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW telah memutuskan bahawa Qisas (balasan yang setimpal) dikenakan bagi kes kecederaan gigi. Rasulullah SAW bersabda: \"Kitab Allah (yakni, hukum Allah) adalah Qisas.\""
  },
  {
    "id": 19499,
    "hadith_number": 4763,
    "tajuk_hadith": "Hukuman bagi Pembunuh atau Pencacat Hamba",
    "perawi_melayu": "Diriwayatkan daripada Samurah bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Whoever kills his slave, we will kill him, and whoever mutilates his slave, we will mutilate him.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ وَمَنْ جَدَعَ عَبْدَهُ جَدَعْنَاهُ ‏\"‏ ‏.‏",
    "malay_translation": "\"Sesiapa yang membunuh hambanya, kami akan membunuhnya, dan sesiapa yang mencacatkan hambanya, kami akan mencacatnya.\""
  },
  {
    "id": 19500,
    "hadith_number": 4764,
    "tajuk_hadith": "Larangan Mengasi atau Mencacatkan Hamba",
    "perawi_melayu": "Diriwayatkan daripada Samurah bahawa Nabi Allah bersabda:",
    "english_text": "\"Whoever castrates his slave, we will castrate him, and whoever mutilates his slave, we will mutilate him.\" This is the wording of Ibn Bashshar (one of the narrators).",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ خَصَى عَبْدَهُ خَصَيْنَاهُ وَمَنْ جَدَعَ عَبْدَهُ جَدَعْنَاهُ ‏\"‏ ‏.‏ وَاللَّفْظُ لاِبْنِ بَشَّارٍ ‏.‏",
    "malay_translation": "\"Sesiapa yang mengasi hambanya, kami akan mengasinya, dan sesiapa yang mencacatkan hambanya, kami akan mencacatkannya.\" Ini adalah lafaz Ibn Bashshar (salah seorang perawi)."
  },
  {
    "id": 19501,
    "hadith_number": 4765,
    "tajuk_hadith": "Sumpah yang Dikabulkan Allah dan Pembayaran Diyat dalam Kasus Cedera",
    "perawi_melayu": "Diriwayatkan dari Anas bahwa:",
    "english_text": "the sister of Ar-Rubai' Umm Harithah injured  a person and they referred the dispute to the Messenger of Allah. The Messenger of Allah said: \"Retaliation, retaliation (Qisas).\" Umm Ar-Rabi said: 'O Messenger of Allah, how could retaliation be carried out against so and so? No, by Allah, retaliation willnever be carried out against her!' The Messenger of Allah said: \"Subhan Allah, O Umm Ar-Rabi'! decreed by Allah.\" She said: \"No, by Allah, retaliation will never be carried out against her!\" And she carried on until they accepted Diyah (blood money). He (the prophet) said: \"There are among the slaves of Allah who, if they swear by Allah, Allah fulfills their oath.",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا عَفَّانُ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، أَنَّ أُخْتَ الرُّبَيِّعِ أُمَّ حَارِثَةَ، جَرَحَتْ إِنْسَانًا فَاخْتَصَمُوا إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْقِصَاصَ الْقِصَاصَ ‏\"‏ ‏.‏ فَقَالَتْ أُمُّ الرُّبَيِّعِ يَا رَسُولَ اللَّهِ أَيُقْتَصُّ مِنْ فُلاَنَةَ لاَ وَاللَّهِ لاَ يُقْتَصُّ مِنْهَا أَبَدًا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ سُبْحَانَ اللَّهِ يَا أُمَّ الرُّبَيِّعِ الْقِصَاصُ كِتَابُ اللَّهِ ‏\"‏ ‏.‏ قَالَتْ لاَ وَاللَّهِ لاَ يُقْتَصُّ مِنْهَا أَبَدًا ‏.‏ فَمَا زَالَتْ حَتَّى قَبِلُوا الدِّيَةَ ‏.‏ قَالَ ‏\"‏ إِنَّ مِنْ عِبَادِ اللَّهِ مَنْ لَوْ أَقْسَمَ عَلَى اللَّهِ لأَبَرَّهُ ‏\"‏ ‏.‏",
    "malay_translation": "Saudari Ar-Rubai', Ummu Harithah, telah mencederakan seseorang, lalu mereka mengadukan perselisihan itu kepada Rasulullah ﷺ. Rasulullah ﷺ bersabda, \"Qisas, qisas.\" Ummu Ar-Rubai' berkata, 'Wahai Rasulullah, bagaimana mungkin qisas dilaksanakan terhadap si fulanah? Tidak, demi Allah, qisas tidak akan pernah dilaksanakan terhadapnya!' Rasulullah ﷺ bersabda, \"Subhanallah, wahai Ummu Ar-Rubai'! Qisas adalah ketetapan Allah.\" Dia berkata, \"Tidak, demi Allah, qisas tidak akan pernah dilaksanakan terhadapnya!\" Dia terus berusaha hingga mereka menerima Diyat (tebusan darah). Baginda (Nabi) bersabda, \"Sesungguhnya di antara hamba-hamba Allah ada orang yang, jika dia bersumpah demi Allah, nescaya Allah akan mengabulkan sumpahnya.\" "
  },
  {
    "id": 19502,
    "hadith_number": 4766,
    "tajuk_hadith": "Sumpah yang Dikabulkan Allah SWT kerana Ketaatan Hamba-Nya",
    "perawi_melayu": "Anas meriwayatkan bahawa:",
    "english_text": "his paternal aunt broke the front tooth of a girl and the Prophet of Allah decreed retaliation. Her brother, Anas bin An-Nadr, said: \"Will you break the front tooth of so and so? No, by the One Who sent you with the truth, the front tooth of so and so will not be broken!\" Before that, they had asked her family for forgiveness and blood money. When her brother - who was the paternal uncle of Anas and was martyred at Uhud - swore that oath, the people agreed to forgive. The Prophet said: \"There are among the slaves of Allah who, if they swear by Allah, Allah fulfills their oath.\"",
    "arabic_text": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، وَإِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالاَ حَدَّثَنَا بِشْرٌ، عَنْ حُمَيْدٍ، قَالَ ذَكَرَ أَنَسٌ أَنَّ عَمَّتَهُ، كَسَرَتْ ثَنِيَّةَ جَارِيَةٍ فَقَضَى نَبِيُّ اللَّهِ صلى الله عليه وسلم بِالْقِصَاصِ فَقَالَ أَخُوهَا أَنَسُ بْنُ النَّضْرِ أَتُكْسَرُ ثَنِيَّةُ فُلاَنَةَ لاَ وَالَّذِي بَعَثَكَ بِالْحَقِّ لاَ تُكْسَرُ ثَنِيَّةُ فُلاَنَةَ ‏.‏ قَالَ وَكَانُوا قَبْلَ ذَلِكَ سَأَلُوا أَهْلَهَا الْعَفْوَ وَالأَرْشَ فَلَمَّا حَلَفَ أَخُوهَا - وَهُوَ عَمُّ أَنَسٍ وَهُوَ الشَّهِيدُ يَوْمَ أُحُدٍ - رَضِيَ الْقَوْمُ بِالْعَفْوِ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِنَّ مِنْ عِبَادِ اللَّهِ مَنْ لَوْ أَقْسَمَ عَلَى اللَّهِ لأَبَرَّهُ ‏\"‏ ‏.‏",
    "malay_translation": "Bapa saudara perempuannya mematahkan gigi depan seorang gadis, dan Nabi Allah SAW memutuskan hukuman qisas. Saudaranya, Anas bin An-Nadr, berkata: \"Adakah kamu akan mematahkan gigi depan si fulanah? Tidak, demi Zat yang mengutusmu dengan kebenaran, gigi depan si fulanah tidak akan dipatahkan!\" Sebelum itu, mereka telah meminta maaf dan ganti rugi (diyat) kepada keluarganya. Ketika saudaranya - iaitu bapa saudara Anas yang syahid di Uhud - bersumpah demikian, orang ramai bersetuju untuk memaafkan. Nabi SAW bersabda: \"Sesungguhnya di antara hamba-hamba Allah ada orang yang, jika dia bersumpah demi Allah, nescaya Allah akan menunaikan sumpahnya.\""
  },
  {
    "id": 19503,
    "hadith_number": 4767,
    "tajuk_hadith": "Ganti Rugi dan Kemaafan dalam Kes Kecederaan",
    "perawi_melayu": "Diriwayatkan daripada Anas, beliau berkata:",
    "english_text": "\"Ar-Rubai broke the front tooth of a girls, and they asked them (her people) to forgive her, but they refused. They offered them blood money, but they refused. Then they went to the Prophet and he decreed relation. Anas Bin An-Nadr said: \"O Messenger of Allah, will you break the front tooth of Ar-Rubai'? No, by the One Who sent you with the truth, it will not be broken!\" He said: \"O Anas, what Allah has decreed is retaliation.\" But the people agreed to forgive her. He (the Prophet) said: \"There are among the slaves of Allah who, if they swear by Allah, Allah fulfills their oath.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا حُمَيْدٌ، عَنْ أَنَسٍ، قَالَ كَسَرَتِ الرُّبَيِّعُ ثَنِيَّةَ جَارِيَةٍ فَطَلَبُوا إِلَيْهِمُ الْعَفْوَ فَأَبَوْا فَعُرِضَ عَلَيْهِمُ الأَرْشُ فَأَبَوْا فَأَتَوُا النَّبِيَّ صلى الله عليه وسلم فَأَمَرَ بِالْقِصَاصِ ‏.‏ قَالَ أَنَسُ بْنُ النَّضْرِ يَا رَسُولَ اللَّهِ تُكْسَرُ ثَنِيَّةُ الرُّبَيِّعِ لاَ وَالَّذِي بَعَثَكَ بِالْحَقِّ لاَ تُكْسَرُ ‏.‏ قَالَ ‏\"‏ يَا أَنَسُ كِتَابُ اللَّهِ الْقِصَاصُ ‏\"‏ ‏.‏ فَرَضِيَ الْقَوْمُ وَعَفَوْا فَقَالَ ‏\"‏ إِنَّ مِنْ عِبَادِ اللَّهِ مَنْ لَوْ أَقْسَمَ عَلَى اللَّهِ لأَبَرَّهُ ‏\"‏ ‏.‏",
    "malay_translation": "Ar-Rubai' mematahkan gigi depan seorang gadis, lalu mereka (kaum gadis itu) meminta maaf daripadanya, tetapi mereka enggan. Mereka menawarkan diyat (wang tebusan), tetapi mereka juga enggan. Kemudian mereka pergi kepada Nabi Muhammad SAW, dan baginda memerintahkan qisas (balasan setimpal). Anas bin An-Nadr berkata: \"Wahai Rasulullah, adakah akan dipatahkan gigi depan Ar-Rubai'? Tidak, demi Zat yang mengutusmu dengan kebenaran, ia tidak akan dipatahkan!\" Baginda bersabda: \"Wahai Anas, Kitab Allah (ketetapan Allah) adalah qisas.\" Tetapi kaum itu bersetuju untuk memaafkannya. Baginda (Nabi Muhammad SAW) bersabda: \"Sesungguhnya di antara hamba-hamba Allah, ada yang jika dia bersumpah dengan nama Allah, pasti Allah akan menunaikan sumpahnya.\""
  },
  {
    "id": 19504,
    "hadith_number": 4768,
    "tajuk_hadith": "Perihal Seseorang yang Digigit Tangannya dan Gigi Orang yang Menggigit Terjatuh",
    "perawi_melayu": "Diriwayatkan daripada 'Imran bin Hussain bahawa:",
    "english_text": "a man bit the hand of another man, who pulled his hand away, and the man's front tooth (or from teeth) fell out. He complained about that to the Messenger of Allah, and the Messenger of Allah said: \"What do you want? Do you want me to tell him to put his hand in your mouth, so that you can bite it like a stallion bites? Or, do you want to give him your hand so that he may bite it, then you can pull it away if you want?\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عُثْمَانَ أَبُو الْجَوْزَاءِ، قَالَ أَنْبَأَنَا قُرَيْشُ بْنُ أَنَسٍ، عَنِ ابْنِ عَوْنٍ، عَنِ ابْنِ سِيرِينَ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّ رَجُلاً، عَضَّ يَدَ رَجُلٍ فَانْتَزَعَ يَدَهُ فَسَقَطَتْ ثَنِيَّتُهُ أَوْ قَالَ ثَنَايَاهُ فَاسْتَعْدَى عَلَيْهِ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا تَأْمُرُنِي تَأْمُرُنِي أَنْ آمُرَهُ أَنْ يَدَعَ يَدَهُ فِي فِيكَ تَقْضَمُهَا كَمَا يَقْضَمُ الْفَحْلُ إِنْ شِئْتَ فَادْفَعْ إِلَيْهِ يَدَكَ حَتَّى يَقْضَمَهَا ثُمَّ انْتَزِعْهَا إِنْ شِئْتَ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki menggigit tangan seorang lelaki lain, yang menarik tangannya, dan gigi hadapan lelaki itu (atau gigi-giginya) tercabut. Dia mengadu tentang perkara itu kepada Rasulullah SAW, dan Rasulullah SAW bersabda: \"Apa yang kamu mahu? Adakah kamu mahu aku menyuruhnya meletakkan tangannya di dalam mulutmu, supaya kamu boleh menggigitnya seperti kuda jantan menggigit? Atau, adakah kamu mahu memberinya tanganmu supaya dia boleh menggigitnya, kemudian kamu boleh menariknya jika kamu mahu?\""
  },
  {
    "id": 19505,
    "hadith_number": 4769,
    "tajuk_hadith": "Larangan Menggigit seperti Kuda Jantan dan Pembatalan Diyat",
    "perawi_melayu": "Diriwayatkan daripada 'Imran bin Husain bahawa seorang lelaki menggigit lengan seorang lelaki lain:",
    "english_text": "he pulled it away and a front tooth fell out. The matter was referred to the Messenger of Allah and he canceled (the Diyah) and said: \"Did you want to bite your brother's flesh as a stallion bites?\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَزِيدُ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّ رَجُلاً، عَضَّ آخَرَ عَلَى ذِرَاعِهِ فَاجْتَذَبَهَا فَانْتَزَعَتْ ثَنِيَّتَهُ فَرُفِعَ ذَلِكَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَبْطَلَهَا وَقَالَ ‏\n\"‏ أَرَدْتَ أَنْ تَقْضَمَ لَحْمَ أَخِيكَ كَمَا يَقْضَمُ الْفَحْلُ ‏\"‏ ‏.‏",
    "malay_translation": "Dia menariknya dan gigi depannya tercabut. Perkara itu dirujuk kepada Rasulullah ﷺ dan baginda membatalkan (Diyat) dan bersabda: \"Adakah kamu mahu menggigit daging saudaramu seperti kuda jantan menggigit?\""
  },
  {
    "id": 19506,
    "hadith_number": 4770,
    "tajuk_hadith": "Tiada Diyat (Pampasan) untuk Gigitan dalam Pertengkaran",
    "perawi_melayu": "Diriwayatkan daripada 'Imran bin Husain:",
    "english_text": "\"Ya'la fought with a man, and one of them bit the other, who pulled his hand away from his mouth, and a front tooth fell out. They referred their dispute to the Messenger of Allah and he said: 'Would one of you bite his brother as a stallion bites? There is no Diyah for that.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ قَاتَلَ يَعْلَى رَجُلاً فَعَضَّ أَحَدُهُمَا صَاحِبَهُ فَانْتَزَعَ يَدَهُ مِنْ فِيهِ فَنَدَرَتْ ثَنِيَّتُهُ فَاخْتَصَمَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ يَعَضُّ أَحَدُكُمْ أَخَاهُ كَمَا يَعَضُّ الْفَحْلُ لاَ دِيَةَ لَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Ya'la bergaduh dengan seorang lelaki, dan salah seorang daripada mereka menggigit yang lain. Lelaki yang digigit itu menarik tangannya dari mulut orang yang menggigit, dan gigi depannya tercabut. Mereka membawa perselisihan mereka kepada Rasulullah ﷺ dan Baginda bersabda: 'Adakah salah seorang daripada kamu menggigit saudaranya seperti kuda jantan menggigit? Tiada Diyat (pampasan) untuk itu.'"
  },
  {
    "id": 19507,
    "hadith_number": 4771,
    "tajuk_hadith": "Tiada Diyat bagi Gigitan yang Menyebabkan Gigi Depan Tercabut",
    "perawi_melayu": "Diriwayatkan daripada 'Imran bin Husain bahawa:",
    "english_text": "Ya'la said, concerning the one who bit (another), and his front tooth fell out, that the Prophet said: \"There is no Diyah for you.\" (Sahih )",
    "arabic_text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّ يَعْلَى، قَالَ فِي الَّذِي عَضَّ فَنَدَرَتْ ثَنِيَّتُهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ دِيَةَ لَكَ ‏\"‏ ‏.‏",
    "malay_translation": "Ya'la berkata, mengenai seseorang yang menggigit (orang lain), dan gigi depannya tercabut, bahawa Nabi bersabda: \"Tiada Diyat untukmu.\" (Sahih)"
  },
  {
    "id": 19508,
    "hadith_number": 4772,
    "tajuk_hadith": "Larangan Menggigit Lengan Saudara Seperti Kuda Jantan dan Pembatalan Ganti Rugi",
    "perawi_melayu": "Diriwayatkan daripada 'Imran bin Husain bahwa:",
    "english_text": "a man bit another man in the forearm, and his front tooth fell out, so he went to the Prophet and told him about that. He said: \"Do you want to bite your brother's forearm as a stallion bites?\" And he judged it to be invalid.",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا أَبُو هِشَامٍ، قَالَ حَدَّثَنَا أَبَانُ، قَالَ حَدَّثَنَا قَتَادَةُ، قَالَ حَدَّثَنَا زُرَارَةُ بْنُ أَوْفَى، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّ رَجُلاً، عَضَّ ذِرَاعَ رَجُلٍ فَانْتَزَعَ ثَنِيَّتَهُ فَانْطَلَقَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَذَكَرَ ذَلِكَ لَهُ فَقَالَ ‏\n\"‏ أَرَدْتَ أَنْ تَقْضَمَ ذِرَاعَ أَخِيكَ كَمَا يَقْضَمُ الْفَحْلُ ‏\"‏ ‏.‏ فَأَبْطَلَهَا ‏.‏",
    "malay_translation": "Seorang lelaki menggigit lengan lelaki lain, dan gigi depannya tercabut. Lalu dia pergi kepada Nabi Muhammad SAW dan menceritakan hal itu kepada baginda. Baginda bersabda: \"Adakah kamu mahu menggigit lengan saudaramu seperti kuda jantan menggigit?\" Dan baginda memutuskan bahawa ia tidak sah (ganti rugi)."
  },
  {
    "id": 19509,
    "hadith_number": 4773,
    "tajuk_hadith": "Larangan Menggigit Ketika Bergaduh dan Keputusan Nabi SAW Mengenainya",
    "perawi_melayu": "Diriwayatkan daripada Ya'la bin Munyah bahawa:",
    "english_text": "he fought a man and one of them bit the other, who pulled his forearm away from his mouth, and a front tooth fell out. The matter was referred to the Prophet and he said: \"Would one of you bite his brother as a young camel bites?\" And judged it to be invalid.",
    "arabic_text": "أَخْبَرَنَا مَالِكُ بْنُ الْخَلِيلِ، قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنِ الْحَكَمِ، عَنْ مُجَاهِدٍ، عَنْ يَعْلَى ابْنِ مُنْيَةَ، أَنَّهُ قَاتَلَ رَجُلاً فَعَضَّ أَحَدُهُمَا صَاحِبَهُ فَانْتَزَعَ يَدَهُ مِنْ فِيهِ فَقَلَعَ ثَنِيَّتَهُ فَرُفِعَ ذَلِكَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ يَعَضُّ أَحَدُكُمْ أَخَاهُ كَمَا يَعَضُّ الْبَكْرُ ‏\"‏ ‏.‏ فَأَبْطَلَهَا ‏.‏",
    "malay_translation": "Dia bergaduh dengan seorang lelaki, dan salah seorang daripada mereka menggigit yang lain. Lalu orang yang digigit menarik lengannya dari mulutnya, menyebabkan gigi depannya tercabut. Perkara itu dirujuk kepada Nabi SAW, dan baginda bersabda: \"Adakah salah seorang daripada kamu menggigit saudaranya seperti seekor anak unta menggigit?\" Lalu baginda memutuskan bahawa ia tidak sah (tidak boleh diterima sebagai alasan)."
  },
  {
    "id": 19510,
    "hadith_number": 4774,
    "tajuk_hadith": "Larangan Menggigit dalam Pertengkaran dan Pembatalan Ganti Rugi Gigi",
    "perawi_melayu": "Diriwayatkan daripada Ya'la bin Munyah bahawa:",
    "english_text": "a man from Banu Tamim fought with another man, and he bit his hand, so he pulled it away and a front tooth fell out. They referred the dispute to the Messenger of Allah, who said: \"Would one of you bite his brother as a young camel bites?\" and he thwarted it, meaning he judged it to be invalid.",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عَقِيلٍ، قَالَ حَدَّثَنَا جَدِّي، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ مُجَاهِدٍ، عَنْ يَعْلَى ابْنِ مُنْيَةَ، أَنَّ رَجُلاً، مِنْ بَنِي تَمِيمٍ قَاتَلَ رَجُلاً فَعَضَّ يَدَهُ فَانْتَزَعَهَا فَأَلْقَى ثَنِيَّتَهُ فَاخْتَصَمَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ يَعَضُّ أَحَدُكُمْ أَخَاهُ كَمَا يَعَضُّ الْبَكْرُ ‏\"‏ ‏.‏ فَأَطَلَّهَا أَىْ أَبْطَلَهَا ‏.‏",
    "malay_translation": "Seorang lelaki daripada Bani Tamim bertengkar dengan seorang lelaki lain, lalu dia menggigit tangannya. Kemudian lelaki itu menarik tangannya sehingga gigi depannya tercabut. Mereka membawa perselisihan itu kepada Rasulullah SAW, yang bersabda: \"Adakah seseorang daripada kamu menggigit saudaranya seperti anak unta menggigit?\" Baginda membatalkannya, bermaksud Baginda menghukumkan ia tidak sah (tidak boleh menuntut ganti rugi)."
  },
  {
    "id": 19511,
    "hadith_number": 4775,
    "tajuk_hadith": "Tiada Pampasan untuk Gigitan yang Menyebabkan Gigi Jatuh dalam Pertengkaran",
    "perawi_melayu": "Diriwayatkan daripada Safwan bin Abdullah bahawa dua orang bapa saudaranya, Salamah dan Ya'la, anak-anak Umayyah, berkata:",
    "english_text": "\"We went out with the Messenger of Allah on the campaign of Tabuk, and there was a friend of ours with us, who fought with a man from among the Muslims. The man bit him on the forearm, so he pulled it away from his mouth and a tooth fell out. The man came to the Prophet, seeking blood money, but his brother and bite him like a stallion bites, then come and demand blood money? There is no blood money for that.\" And the Messenger of Allah juddgedit to be invalid.",
    "arabic_text": "أَخْبَرَنَا عِمْرَانُ بْنُ بَكَّارٍ، قَالَ أَنْبَأَنَا أَحْمَدُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ صَفْوَانَ بْنِ عَبْدِ اللَّهِ، عَنْ عَمَّيْهِ، سَلَمَةَ وَيَعْلَى ابْنَىْ أُمَيَّةَ قَالاَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ تَبُوكَ وَمَعَنَا صَاحِبٌ لَنَا فَقَاتَلَ رَجُلاً مِنَ الْمُسْلِمِينَ فَعَضَّ الرَّجُلُ ذِرَاعَهُ فَجَذَبَهَا مِنْ فِيهِ فَطَرَحَ ثَنِيَّتَهُ فَأَتَى الرَّجُلُ النَّبِيَّ صلى الله عليه وسلم يَلْتَمِسُ الْعَقْلَ فَقَالَ ‏\n\"‏ يَنْطَلِقُ أَحَدُكُمْ إِلَى أَخِيهِ فَيَعَضُّهُ كَعَضِيضِ الْفَحْلِ ثُمَّ يَأْتِي يَطْلُبُ الْعَقْلَ لاَ عَقْلَ لَهَا ‏\"‏ ‏.‏ فَأَبْطَلَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Kami keluar bersama Rasulullah SAW dalam peperangan Tabuk, dan ada seorang sahabat kami bersama kami, yang bertengkar dengan seorang lelaki daripada kalangan Muslimin. Lelaki itu menggigit lengannya, lalu dia menariknya dari mulutnya dan menyebabkan gigi lelaki tersebut tercabut. Lelaki itu datang kepada Nabi SAW, menuntut diat (pampasan), tetapi saudaranya (lelaki yang digigit) berkata, 'Adakah seseorang menggigit saudaranya seperti gigitan kuda jantan, kemudian datang dan menuntut diat? Tidak ada diat untuk itu.' Dan Rasulullah SAW menghukumkan ia tidak sah."
  },
  {
    "id": 19512,
    "hadith_number": 4776,
    "tajuk_hadith": "Gigi Depan Tertanggal Kerana Gigitan: Tiada Pampasan",
    "perawi_melayu": "Diriwayatkan daripada Safwan bin Ya'la, daripada ayahnya, bahawa:",
    "english_text": "a man bit the hand of another man and his front tooth fell out. He came to the Prophet but he considered it in vain.",
    "arabic_text": "أَخْبَرَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَلاَءِ بْنِ عَبْدِ الْجَبَّارِ، عَنْ سُفْيَانَ، عَنْ عَمْرٍو، عَنْ عَطَاءٍ، عَنْ صَفْوَانَ بْنِ يَعْلَى، عَنْ أَبِيهِ، أَنَّ رَجُلاً، عَضَّ يَدَ رَجُلٍ فَانْتُزِعَتْ ثَنِيَّتُهُ فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَأَهْدَرَهَا ‏.‏",
    "malay_translation": "Seorang lelaki menggigit tangan lelaki lain sehingga gigi depannya tercabut. Dia datang kepada Nabi Muhammad SAW, tetapi Baginda menganggapnya sia-sia (tiada pampasan)."
  },
  {
    "id": 19513,
    "hadith_number": 4777,
    "tajuk_hadith": "Larangan Menggigit Seperti Kuda Jantan",
    "perawi_melayu": "Diriwayatkan daripada Ya'la bahwa:",
    "english_text": "he hired a worker who fought with a man and bit his hand, and his from tooth fell out. So he referred the dispute to the Prophet who said: \"Do you want to bite his hand as a stallion bites?\"",
    "arabic_text": "أَخْبَرَنَا عَبْدُ الْجَبَّارِ، مَرَّةً أُخْرَى عَنْ سُفْيَانَ، عَنْ عَمْرٍو، عَنْ عَطَاءٍ، عَنْ صَفْوَانَ بْنِ يَعْلَى، عَنْ يَعْلَى، وَابْنِ، جُرَيْجٍ عَنْ عَطَاءٍ، عَنْ صَفْوَانَ بْنِ يَعْلَى، عَنْ يَعْلَى، أَنَّهُ اسْتَأْجَرَ أَجِيرًا فَقَاتَلَ رَجُلاً فَعَضَّ يَدَهُ فَانْتُزِعَتْ ثَنِيَّتُهُ فَخَاصَمَهُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ أَيَدَعُهَا يَقْضِمُهَا كَقَضْمِ الْفَحْلِ ‏\"‏ ‏.‏",
    "malay_translation": "Dia (Ya'la) mengupah seorang pekerja yang bergaduh dengan seorang lelaki dan menggigit tangannya, menyebabkan gigi depannya tercabut. Lalu dia merujuk pertikaian itu kepada Nabi SAW, yang bersabda: \"Adakah kamu mahu menggigit tangannya seperti kuda jantan menggigit?\""
  },
  {
    "id": 19514,
    "hadith_number": 4778,
    "tajuk_hadith": "Gigi Depan Gugur Semasa Pertelingkahan dalam Perang Tabuk",
    "perawi_melayu": "Diriwayatkan daripada Safwan bin Ya'la bahawa bapanya berkata:",
    "english_text": "\"I went on the campaign to Tabuk with the Messenger of Allah, and I hired a worker. My hired man fought with another man. The other one bit him, and his front tooth fell out. He went to the Prophet and told him about that, but the Prophet considered it to bin vain.",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا سُفْيَانُ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنْ صَفْوَانَ بْنِ يَعْلَى، عَنْ أَبِيهِ، قَالَ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ تَبُوكَ فَاسْتَأْجَرْتُ أَجِيرًا فَقَاتَلَ أَجِيرِي رَجُلاً فَعَضَّ الآخَرُ فَسَقَطَتْ ثَنِيَّتُهُ فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَذَكَرَ لَهُ فَأَهْدَرَهُ النَّبِيُّ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "\"Saya pergi berperang ke Tabuk bersama Rasulullah SAW, dan saya mengupah seorang pekerja. Pekerja upahan saya bergaduh dengan seorang lelaki lain. Lelaki yang lain itu menggigitnya, dan gigi depannya gugur. Dia pergi kepada Nabi SAW dan menceritakan hal itu kepada Baginda, tetapi Nabi SAW menganggapnya sia-sia.\" "
  },
  {
    "id": 19515,
    "hadith_number": 4779,
    "tajuk_hadith": "Gigi yang Gugur Kerana Gigitan dalam Pertengkaran",
    "perawi_melayu": "Diriwayatkan daripada Ya'la bin Umayyah, berkata:",
    "english_text": "\"I went on a campaign with the Messenger of Allah in the Army of Hardship, and this was the deed of which I was most sure. I had a hired man who fought with another person. One of them bit the finger of the other, who pulled his finger away and a front tooth fell out. He went to the Prophet who considered the tooth to be in vain, and said: \"Would he put his hand in your mouth for you to bite it?\"",
    "arabic_text": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ، قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، عَنْ صَفْوَانَ بْنِ يَعْلَى، عَنْ يَعْلَى بْنِ أُمَيَّةَ، قَالَ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم جَيْشَ الْعُسْرَةِ - وَكَانَ أَوْثَقَ عَمَلٍ لِي فِي نَفْسِي - وَكَانَ لِي أَجِيرٌ فَقَاتَلَ إِنْسَانًا فَعَضَّ أَحَدُهُمَا أُصْبَعَ صَاحِبِهِ فَانْتَزَعَ إِصْبَعَهُ فَأَنْدَرَ ثَنِيَّتَهُ فَسَقَطَتْ فَانْطَلَقَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَهْدَرَ ثَنِيَّتَهُ وَقَالَ ‏\n\"‏ أَفَيَدَعُ يَدَهُ فِي فِيكَ تَقْضَمُهَا ‏\"‏ ‏.‏",
    "malay_translation": "\"Saya pergi berperang bersama Rasulullah SAW dalam Tentera Kesukaran, dan ini adalah amalan yang paling saya yakini. Saya mempunyai seorang pekerja upahan yang bergaduh dengan orang lain. Salah seorang daripada mereka menggigit jari yang lain, yang menarik jarinya sehingga gigi depannya tercabut. Dia pergi kepada Nabi SAW yang menganggap gigi itu sia-sia, dan bersabda: \"Adakah dia akan membiarkan tangannya di dalam mulutmu untuk kamu gigit?\"\""
  },
  {
    "id": 19516,
    "hadith_number": 4780,
    "tajuk_hadith": "Tiada Diyat (Pampasan) dalam Kes Kecederaan Tertentu",
    "perawi_melayu": "Diriwayatkan daripada Ibn Ya'la daripada ayahnya, dalam riwayat yang serupa dengan kisah seorang lelaki yang menggigit (lelaki lain) sehingga gigi serinya tercabut, bahawa Nabi SAW bersabda:",
    "english_text": "\"There is no Diyah for you.\"",
    "arabic_text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، فِي حَدِيثِ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ عَطَاءٍ، عَنِ ابْنِ يَعْلَى، عَنْ أَبِيهِ، بِمِثْلِ الَّذِي عَضَّ فَنَدَرَتْ ثَنِيَّتُهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ دِيَةَ لَكَ ‏\"‏ ‏.‏",
    "malay_translation": "\"Tiada Diyat (pampasan) untukmu.\""
  },
  {
    "id": 19517,
    "hadith_number": 4781,
    "tajuk_hadith": "Larangan Menggigit Lengan Orang Lain Seperti Kuda Jantan",
    "perawi_melayu": "Diriwayatkan daripada Safwan bin Ya'la bin Munyah bahawa:",
    "english_text": "a hired man of Ya'la bin Munyah was bitten by another on his forearm and he pulled it away from his mouth. The matter was referred to the Prophet, as his front tooth had fallen out, but the Messenger of Allah considered it an invalid claim, and said: \"No,; should he put (his forearm) in your mouth for you to bite it as a stallion bites?\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ بُدَيْلِ بْنِ مَيْسَرَةَ، عَنْ عَطَاءٍ، عَنْ صَفْوَانَ بْنِ يَعْلَى ابْنِ مُنْيَةَ، أَنَّ أَجِيرًا، لِيَعْلَى ابْنِ مُنْيَةَ عَضَّ آخَرُ ذِرَاعَهُ فَانْتَزَعَهَا مِنْ فِيهِ فَرَفَعَ ذَلِكَ إِلَى النَّبِيِّ صلى الله عليه وسلم وَقَدْ سَقَطَتْ ثَنِيَّتُهُ فَأَبْطَلَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏\n\"‏ أَيَدَعُهَا فِي فِيكَ تَقْضَمُهَا كَقَضْمِ الْفَحْلِ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang pekerja upahan Ya'la bin Munyah telah digigit pada lengannya oleh orang lain, lalu dia menariknya keluar dari mulut orang tersebut. Perkara itu dirujuk kepada Nabi Muhammad SAW, kerana gigi depannya telah tercabut. Rasulullah SAW menganggap tuntutan itu tidak sah dan bersabda: \"Tidak, adakah patut dia memasukkan (lengannya) ke dalam mulutmu untuk kamu gigit seperti gigitan kuda jantan?\""
  },
  {
    "id": 19518,
    "hadith_number": 4782,
    "tajuk_hadith": "Larangan Menggigit Seperti Kuda Jantan dan Pembatalan Ganti Rugi Gigi",
    "perawi_melayu": "Diriwayatkan daripada Safwan bin Ya'la bahawa:",
    "english_text": "his father wen on the campaign of Tabuk with the Messenger of Allah, and he hired a man who fought with another man. The man bit his forearm, and when it hurt him, he pulled it away, and the man's front tooth fell out. The matter was referred to the Messenger of Allah who said: \"Would one of you deliberately bit his brother as a stallion bites?\" And he judged it to be invalid.",
    "arabic_text": "أَخْبَرَنِي أَبُو بَكْرِ بْنُ إِسْحَاقَ، قَالَ حَدَّثَنَا أَبُو الْجَوَّابِ، قَالَ حَدَّثَنَا عَمَّارٌ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنِ الْحَكَمِ، عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ، عَنْ صَفْوَانَ بْنِ يَعْلَى، أَنَّ أَبَاهُ، غَزَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ تَبُوكَ فَاسْتَأْجَرَ أَجِيرًا فَقَاتَلَ رَجُلاً فَعَضَّ الرَّجُلُ ذِرَاعَهُ فَلَمَّا أَوْجَعَهُ نَتَرَهَا فَأَنْدَرَ ثَنِيَّتَهُ فَرُفِعَ ذَلِكَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ يَعْمِدُ أَحَدُكُمْ فَيَعَضُّ أَخَاهُ كَمَا يَعَضُّ الْفَحْلُ ‏\"‏ ‏.‏ فَأَبْطَلَ ثَنِيَّتَهُ ‏.‏",
    "malay_translation": "Bapanya menyertai peperangan Tabuk bersama Rasulullah SAW, dan dia mengupah seorang lelaki yang bergaduh dengan lelaki lain. Lelaki itu menggigit lengan bawahnya, dan apabila ia menyakitkannya, dia menariknya, dan gigi hadapan lelaki itu tercabut. Perkara itu dirujuk kepada Rasulullah SAW yang bersabda: \"Adakah seseorang di antara kamu dengan sengaja menggigit saudaranya seperti kuda jantan menggigit?\" Dan baginda memutuskan bahawa ia tidak sah (tidak perlu diganti rugi)."
  },
  {
    "id": 19519,
    "hadith_number": 4783,
    "tajuk_hadith": "Rasulullah SAW Membenarkan Balasan Tetapi Dimaafkan",
    "perawi_melayu": "Diriwayatkan daripada Abu Sa'id Al-Khudri, dia berkata:",
    "english_text": "\"While the Messenger of Allah was distributing something, a man came and leaned over him, and the Messenger of Allah hit him with a stick that he had with him. The man went tout, and the Messenger of Allah said: 'Come and ask for retaliation. 'He said: 'No. I ask for retaliation.' He said: 'No, I pardon you, O Messenger of Allah.\"'",
    "arabic_text": "أَخْبَرَنَا وَهْبُ بْنُ بَيَانٍ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبِيدَةَ بْنِ مُسَافِعٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ بَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْسِمُ شَيْئًا أَقْبَلَ رَجُلٌ فَأَكَبَّ عَلَيْهِ فَطَعَنَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بِعُرْجُونٍ كَانَ مَعَهُ فَخَرَجَ الرَّجُلُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ تَعَالَ فَاسْتَقِدْ ‏\"‏ ‏.‏ قَالَ بَلْ قَدْ عَفَوْتُ يَا رَسُولَ اللَّهِ ‏.‏",
    "malay_translation": "\"Ketika Rasulullah SAW sedang mengagihkan sesuatu, seorang lelaki datang dan mencondongkan badan ke arah baginda, lalu Rasulullah SAW memukulnya dengan sebatang kayu yang ada pada baginda. Lelaki itu keluar, dan Rasulullah SAW bersabda: 'Mari dan tuntutlah balas.' Dia berkata: 'Tidak. Saya meminta balasan.' Dia berkata: 'Tidak, saya memaafkanmu, wahai Rasulullah.\"' "
  },
  {
    "id": 19520,
    "hadith_number": 4784,
    "tajuk_hadith": "Pemaafan Seorang Lelaki Setelah Dipukul Rasulullah SAW",
    "perawi_melayu": "Diriwayatkan daripada Abu Sa'eed Al-Khudri berkata:",
    "english_text": "\"While the Messenger of Allah was distributing something, a man came and leaned over him, and the Messenger of Allah hit him with a stick that head with him. The man shouted, and the Messenger of Allah said: 'Come and ask for retaliation. He said: 'No, I pardon you, O Messenger of Allah.\"'",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سَعِيدٍ الرِّبَاطِيُّ، قَالَ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، أَنْبَأَنَا أَبِي قَالَ، سَمِعْتُ يَحْيَى، يُحَدِّثُ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبِيدَةَ بْنِ مُسَافِعٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ بَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْسِمُ شَيْئًا إِذْ أَكَبَّ عَلَيْهِ رَجُلٌ فَطَعَنَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بِعُرْجُونٍ كَانَ مَعَهُ فَصَاحَ الرَّجُلُ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ تَعَالَ فَاسْتَقِدْ ‏\"‏ ‏.‏ قَالَ بَلْ عَفَوْتُ يَا رَسُولَ اللَّهِ ‏.‏",
    "malay_translation": "Ketika Rasulullah SAW sedang mengagihkan sesuatu, seorang lelaki datang dan membongkok ke arah baginda, lalu Rasulullah SAW memukulnya dengan sebatang kayu yang berada di tangan baginda. Lelaki itu menjerit, dan Rasulullah SAW bersabda: 'Kemarilah dan tuntutlah balas.' Dia berkata: 'Tidak, aku memaafkanmu, wahai Rasulullah.'"
  },
  {
    "id": 19521,
    "hadith_number": 4785,
    "tajuk_hadith": "Larangan Mencela Keturunan dan Menyakiti Orang yang Masih Hidup",
    "perawi_melayu": "Ibn 'Abbad meriwayatkan bahawa:",
    "english_text": "a man slandered one of his forefathers from the time of the Jahiliyyah, and Al-'Abbas slapped him. His people came and said: \"Let him slap him as he slapped him,\" and they prepared for quarrel. News of that reached the Prophet, and he ascended the Minbar and said: \"O People, which of the people of the Earth do you know to be the most noble before Allah?\" They said: \"You.\" He said: \"Al-Abbas belongs to me and I to him. Do not defame our dead or offend our living.\" Those people came and said: \"O Messenger of Allah, we seek refuge with Allah from your anger; pray to give us.\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ أَنْبَأَنَا عُبَيْدُ اللَّهِ، عَنْ إِسْرَائِيلَ، عَنْ عَبْدِ الأَعْلَى، أَنَّهُ سَمِعَ سَعِيدَ بْنَ جُبَيْرٍ، يَقُولُ أَخْبَرَنِي ابْنُ عَبَّاسٍ، أَنَّ رَجُلاً، وَقَعَ فِي أَبٍ كَانَ لَهُ فِي الْجَاهِلِيَّةِ فَلَطَمَهُ الْعَبَّاسُ فَجَاءَ قَوْمُهُ فَقَالُوا لَيَلْطِمَنَّهُ كَمَا لَطَمَهُ ‏.‏ فَلَبِسُوا السِّلاَحَ فَبَلَغَ ذَلِكَ النَّبِيَّ صلى الله عليه وسلم فَصَعِدَ الْمِنْبَرَ فَقَالَ ‏\"‏ أَيُّهَا النَّاسُ أَىُّ أَهْلِ الأَرْضِ تَعْلَمُونَ أَكْرَمُ عَلَى اللَّهِ عَزَّ وَجَلَّ ‏\"‏ ‏.‏ فَقَالُوا أَنْتَ ‏.‏ فَقَالَ ‏\"‏ إِنَّ الْعَبَّاسَ مِنِّي وَأَنَا مِنْهُ لاَ تَسُبُّوا مَوْتَانَا فَتُؤْذُوا أَحْيَاءَنَا ‏\"‏ ‏.‏ فَجَاءَ الْقَوْمُ فَقَالُوا يَا رَسُولَ اللَّهِ نَعُوذُ بِاللَّهِ مِنْ غَضَبِكَ اسْتَغْفِرْ لَنَا ‏.‏",
    "malay_translation": "Seorang lelaki mencela salah seorang nenek moyangnya dari zaman Jahiliyah, lalu Al-'Abbas menamparnya. Kaumnya datang dan berkata: \"Biarkan dia menamparnya sebagaimana dia menamparnya,\" dan mereka bersiap sedia untuk bertengkar. Berita itu sampai kepada Nabi ﷺ, lalu baginda menaiki mimbar dan bersabda: \"Wahai manusia, siapakah di antara penduduk bumi yang kamu ketahui paling mulia di sisi Allah?\" Mereka berkata: \"Engkau.\" Baginda bersabda: \"Al-Abbas adalah dariku dan aku darinya. Janganlah kamu mencela orang mati kami sehingga menyakiti orang hidup kami.\" Kaum itu datang dan berkata: \"Wahai Rasulullah, kami berlindung kepada Allah daripada kemurkaanmu; berdoalah untuk kami.\""
  },
  {
    "id": 19522,
    "hadith_number": 4786,
    "tajuk_hadith": "Seorang Badwi Kasar Terhadap Rasulullah SAW dan Kesabaran Baginda",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA berkata:",
    "english_text": "\"We would sit with the Messenger of Allah in the Masjid and when he stood up, we would stand up too, Only day he stood up and we stood up with him, and when he reached the middle of the Masjid, a man caught up with him and pulled roughly on his Rida' (upper-warp) from behind. His Rida 'was of rough material, and that left a red mark on his neck. He said: 'O Muhammad! Load up these two camels of mine, for you are not giving me anything from your wealth or the wealth of your father!' The Messenger of Allah said: 'The Messenger of Allah said: 'No, and I pray for Allah's forgiveness. I will not load anything (onto your camels) untily you let me retaliate for your pulling roughly (on my cloak and leaving a mark on) my neck.' The Bedouin said: 'No, by Allah, I will not let you retaliate., The Messenger of Allah said that three times, and each time the man said: 'No, by Allah, I will not let you retaliate., When we heard what the Bedouin said, we turned toward him quickly. The Messenger of Allah turned to us and said; 'I urge anyone who hears me not to leave his place until give him permission. Then the Messenger of Allah said: 'O so and so, load one of his camels with barley and the other with dates.' Then the Messenger of Allah said: 'Leave,\"'",
    "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ عَلِيِّ بْنِ مَيْمُونٍ، قَالَ حَدَّثَنِي الْقَعْنَبِيُّ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ هِلاَلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كُنَّا نَقْعُدُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الْمَسْجِدِ فَإِذَا قَامَ قُمْنَا فَقَامَ يَوْمًا وَقُمْنَا مَعَهُ حَتَّى لَمَّا بَلَغَ وَسَطَ الْمَسْجِدِ أَدْرَكَهُ رَجُلٌ فَجَبَذَ بِرِدَائِهِ مِنْ وَرَائِهِ - وَكَانَ رِدَاؤُهُ خَشِنًا - فَحَمَّرَ رَقَبَتَهُ فَقَالَ يَا مُحَمَّدُ احْمِلْ لِي عَلَى بَعِيرَىَّ هَذَيْنِ فَإِنَّكَ لاَ تَحْمِلُ مِنْ مَالِكَ وَلاَ مِنْ مَالِ أَبِيكَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ وَأَسْتَغْفِرُ اللَّهَ لاَ أَحْمِلُ لَكَ حَتَّى تُقِيدَنِي مِمَّا جَبَذْتَ بِرَقَبَتِي ‏\"‏ ‏.‏ فَقَالَ الأَعْرَابِيُّ لاَ وَاللَّهِ لاَ أُقِيدُكَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَلِكَ ثَلاَثَ مَرَّاتٍ كُلُّ ذَلِكَ يَقُولُ لاَ وَاللَّهِ لاَ أُقِيدُكَ ‏.‏ فَلَمَّا سَمِعْنَا قَوْلَ الأَعْرَابِيِّ أَقْبَلْنَا إِلَيْهِ سِرَاعًا فَالْتَفَتَ إِلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ عَزَمْتُ عَلَى مَنْ سَمِعَ كَلاَمِي أَنْ لاَ يَبْرَحَ مَقَامَهُ حَتَّى آذَنَ لَهُ ‏\"‏ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِرَجُلٍ مِنَ الْقَوْمِ ‏\"‏ يَا فُلاَنُ احْمِلْ لَهُ عَلَى بَعِيرٍ شَعِيرًا وَعَلَى بَعِيرٍ تَمْرًا ‏\"‏ ‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ انْصَرِفُوا ‏\"‏ ‏.‏",
    "malay_translation": "Kami biasa duduk bersama Rasulullah SAW di dalam Masjid dan apabila Baginda berdiri, kami juga akan berdiri. Pada suatu hari, Baginda berdiri dan kami turut berdiri bersama Baginda, dan ketika Baginda sampai di tengah Masjid, seorang lelaki mengejar Baginda dan menarik dengan kasar Rida' (kain atas) Baginda dari belakang. Rida' Baginda diperbuat daripada bahan yang kasar, dan itu meninggalkan kesan merah di leher Baginda. Dia berkata: 'Wahai Muhammad! Muatkanlah kedua-dua unta saya ini, kerana engkau tidak memberi saya apa-apa daripada harta engkau atau harta ayah engkau!' Rasulullah SAW bersabda: 'Tidak, dan aku memohon ampun kepada Allah. Aku tidak akan memuatkan apa-apa (ke atas unta kamu) sehingga kamu membenarkan aku membalas kerana kamu menarik dengan kasar (jubahku dan meninggalkan kesan) di leherku.' Orang Badwi itu berkata: 'Tidak, demi Allah, aku tidak akan membenarkan engkau membalas.' Rasulullah SAW bersabda demikian sebanyak tiga kali, dan setiap kali lelaki itu berkata: 'Tidak, demi Allah, aku tidak akan membenarkan engkau membalas.' Apabila kami mendengar apa yang dikatakan oleh orang Badwi itu, kami segera menghadap ke arahnya. Rasulullah SAW berpaling kepada kami dan bersabda: 'Aku menyeru sesiapa yang mendengar aku supaya tidak meninggalkan tempatnya sehingga aku memberi izin kepadanya.' Kemudian Rasulullah SAW bersabda: 'Wahai fulan, muatkan salah satu untanya dengan barli dan yang satu lagi dengan kurma.' Kemudian Rasulullah SAW bersabda: 'Berangkatlah.'"
  },
  {
    "id": 19523,
    "hadith_number": 4787,
    "tajuk_hadith": "Rasulullah SAW Membenarkan Qisas ke Atas Diri Baginda",
    "perawi_melayu": "Diriwayatkan daripada Abu Firas bahawa Umar berkata:",
    "english_text": "\"I saw the Messenger of Allah allowing others to seek retaliation against him.\"",
    "arabic_text": "أَخْبَرَنَا مُؤَمَّلُ بْنُ هِشَامٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا أَبُو مَسْعُودٍ، سَعِيدُ بْنُ إِيَاسٍ الْجُرَيْرِيُّ عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي فِرَاسٍ، أَنَّ عُمَرَ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُقِصُّ مِنْ نَفْسِهِ ‏.‏",
    "malay_translation": "\"Saya melihat Rasulullah SAW membenarkan orang lain untuk menuntut qisas (balasan yang setimpal) terhadap baginda.\""
  },
  {
    "id": 19524,
    "hadith_number": 4788,
    "tajuk_hadith": "Penyelesaian Pertikaian Zakat dan Kemaafan dalam Islam",
    "perawi_melayu": "Diriwayatkan daripada 'Aishah bahawa:",
    "english_text": "the Messenger of Allah sent Abu Jahm bin Hudhaifah to collect Zakah and a man argued with him about his Sadaqah, so Abu Jahm struck him. They came to the prophet and he said: \"Diyah, O Messenger of Allah.\" He said: \"You will have such and such,\" but they did not accept it. The Messenger of Allah said: \"You will have such and such,\" and they accepted it. The Messenger of Allah said: \"I am going to address the people and tell them that you accepted it.\" They said: \"Yes.\" So the Prophet addressed (the people) and said: \"Those people came to me seeking compensation, and I offered them such as such, and they accepted.\" They said: \"No.\" The Muhajirun wanted to attack them, but the Messenger of Allah ordered them to refrain, so they refrained. Then he called them and said: \"Do you accept?\" They said:\" Yes.\" He said: \"I and going to address the people and tell them that you accepted it.\" They said: \"Yes.\" So the Prophet addressed (the people), then he said: \"Do you accept?\" They said: \"Yes.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَ أَبَا جَهْمِ بْنَ حُذَيْفَةَ مُصَدِّقًا فَلاَحَّهُ رَجُلٌ فِي صَدَقَتِهِ فَضَرَبَهُ أَبُو جَهْمٍ فَأَتَوُا النَّبِيَّ صلى الله عليه وسلم فَقَالَ الْقَوَدُ يَا رَسُولَ اللَّهِ فَقَالَ ‏\"‏ لَكُمْ كَذَا وَكَذَا ‏\"‏ ‏.‏ فَلَمْ يَرْضَوْا بِهِ فَقَالَ ‏\"‏ لَكُمْ كَذَا وَكَذَا ‏\"‏ ‏.‏ فَرَضُوا بِهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنِّي خَاطِبٌ عَلَى النَّاسِ وَمُخْبِرُهُمْ بِرِضَاكُمْ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ فَخَطَبَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ إِنَّ هَؤُلاَءِ أَتَوْنِي يُرِيدُونَ الْقَوَدَ فَعَرَضْتُ عَلَيْهِمْ كَذَا وَكَذَا فَرَضُوا ‏\"‏ ‏.‏ قَالُوا لاَ ‏.‏ فَهَمَّ الْمُهَاجِرُونَ بِهِمْ فَأَمَرَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَكُفُّوا فَكَفُّوا ثُمَّ دَعَاهُمْ قَالَ ‏\"‏ أَرَضِيتُمْ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ قَالَ ‏\"‏ فَإِنِّي خَاطِبٌ عَلَى النَّاسِ وَمُخْبِرُهُمْ بِرِضَاكُمْ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ فَخَطَبَ النَّاسَ ثُمَّ قَالَ ‏\"‏ أَرَضِيتُمْ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏",
    "malay_translation": "Rasulullah SAW telah mengutus Abu Jahm bin Hudhaifah untuk mengumpulkan Zakat. Seorang lelaki bertikam lidah dengannya mengenai sedekahnya, lalu Abu Jahm memukulnya. Mereka datang kepada Nabi SAW dan berkata: \"Diyat, wahai Rasulullah.\" Baginda bersabda: \"Kamu akan mendapat sekian-sekian,\" tetapi mereka tidak menerimanya. Rasulullah SAW bersabda: \"Kamu akan mendapat sekian-sekian,\" dan mereka menerimanya. Rasulullah SAW bersabda: \"Aku akan berucap kepada orang ramai dan memberitahu mereka bahawa kamu telah menerimanya.\" Mereka berkata: \"Ya.\" Maka Nabi SAW berucap (kepada orang ramai) dan bersabda: \"Orang-orang ini datang kepadaku meminta pampasan, dan aku menawarkan mereka sekian-sekian, dan mereka telah menerimanya.\" Mereka berkata: \"Tidak.\" Kaum Muhajirin ingin menyerang mereka, tetapi Rasulullah SAW memerintahkan mereka untuk menahan diri, lalu mereka menahan diri. Kemudian baginda memanggil mereka dan bertanya: \"Adakah kamu menerima?\" Mereka berkata: \"Ya.\" Baginda bersabda: \"Aku akan berucap kepada orang ramai dan memberitahu mereka bahawa kamu telah menerimanya.\" Mereka berkata: \"Ya.\" Maka Nabi SAW berucap (kepada orang ramai), kemudian baginda bersabda: \"Adakah kamu menerima?\" Mereka berkata: \"Ya.\""
  },
  {
    "id": 19525,
    "hadith_number": 4789,
    "tajuk_hadith": "Hukuman Bunuh Balas Terhadap Pembunuh Seorang Gadis Yahudi",
    "perawi_melayu": "Diriwayatkan daripada Anas, bahawa:",
    "english_text": "a Jew saw some jewelry on a girl, so he killed her with a rock. She was brought to the Prophet as she was breathing her last, and he said: \"Did so and so kill you?\" - Shu'bah (one of the narrators) gestured with his head, to show that she had gestured no. - He said: \"Did so and so kill you?\" - Shu'bah (one of the narrators) gestured with his head to show that she had gestured no. - He said: \"Did so and so kill you?\" - Shu'bah (one of the narrators) gestured with his head to show that she had gestured yes. - So the Messenger of Allah called for him, and killed him with two rocks.",
    "arabic_text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ شُعْبَةَ، عَنْ هِشَامِ بْنِ زَيْدٍ، عَنْ أَنَسٍ، أَنَّ يَهُودِيًّا، رَأَى عَلَى جَارِيَةٍ أَوْضَاحًا فَقَتَلَهَا بِحَجَرٍ فَأُتِيَ بِهَا النَّبِيُّ صلى الله عليه وسلم وَبِهَا رَمَقٌ فَقَالَ ‏\"‏ أَقَتَلَكِ فُلاَنٌ ‏\"‏ ‏.‏ فَأَشَارَ شُعْبَةُ بِرَأْسِهِ يَحْكِيهَا أَنْ لاَ ‏.‏ فَقَالَ ‏\"‏ أَقَتَلَكِ فُلاَنٌ ‏\"‏ ‏.‏ فَأَشَارَ شُعْبَةُ بِرَأْسِهِ يَحْكِيهَا أَنْ لاَ ‏.‏ قَالَ ‏\"‏ أَقَتَلَكِ فُلاَنٌ ‏\"‏ ‏.‏ فَأَشَارَ شُعْبَةُ بِرَأْسِهِ يَحْكِيهَا أَنْ نَعَمْ ‏.‏ فَدَعَا بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَتَلَهُ بَيْنَ حَجَرَيْنِ ‏.‏",
    "malay_translation": "Seorang Yahudi melihat perhiasan pada seorang gadis, lalu dia membunuhnya dengan batu. Gadis itu dibawa kepada Nabi SAW dalam keadaan nazak, dan baginda bertanya: \"Adakah si fulan membunuhmu?\" - Syu'bah (salah seorang perawi) memberi isyarat dengan kepalanya, menunjukkan bahawa gadis itu memberi isyarat tidak. - Baginda bertanya: \"Adakah si fulan membunuhmu?\" - Syu'bah (salah seorang perawi) memberi isyarat dengan kepalanya, menunjukkan bahawa gadis itu memberi isyarat tidak. - Baginda bertanya: \"Adakah si fulan membunuhmu?\" - Syu'bah (salah seorang perawi) memberi isyarat dengan kepalanya, menunjukkan bahawa gadis itu memberi isyarat ya. - Maka Rasulullah SAW memanggilnya, dan membunuhnya dengan dua biji batu sebagai balasan."
  },
  {
    "id": 19526,
    "hadith_number": 4790,
    "tajuk_hadith": "Larangan Tinggal Bersama Musyrik dan Kewajipan Membayar Diyat",
    "perawi_melayu": "Diriwayatkan daripada Anas bahawa:",
    "english_text": "the Messenger of Allah sent a detachment jof troops to some people of Khath'am, who sought to protect themselves by prostrating (to demonstrate that they were Muslims), but they were killed. The Messenger of Allah ruled that half of the Diyah should be paid, and said: \"I am innocent of any Muslim who (lives with) a Mushrik.' Then the Messenger of Allah said: \"Their fires should not be visible to one another.\"'",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا أَبُو خَالِدٍ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ سَرِيَّةً إِلَى قَوْمٍ مِنْ خَثْعَمٍ فَاسْتَعْصَمُوا بِالسُّجُودِ فَقُتِلُوا فَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم بِنِصْفِ الْعَقْلِ وَقَالَ ‏\"‏ إِنِّي بَرِيءٌ مِنْ كُلِّ مُسْلِمٍ مَعَ مُشْرِكٍ ‏\"‏ ‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَلاَ لاَ تَرَاءَى نَارَاهُمَا ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW telah menghantar satu detasmen tentera kepada beberapa orang dari Khath'am, yang cuba melindungi diri mereka dengan sujud (untuk menunjukkan bahawa mereka adalah Muslim), tetapi mereka telah dibunuh. Rasulullah SAW memutuskan bahawa separuh Diyat harus dibayar, dan bersabda: \"Aku berlepas diri daripada setiap Muslim yang (tinggal bersama) seorang Musyrik.' Kemudian Rasulullah SAW bersabda: \"Api mereka tidak seharusnya kelihatan antara satu sama lain.\"' "
  },
  {
    "id": 19527,
    "hadith_number": 4791,
    "tajuk_hadith": "Hukum Qisas dan Diyat dalam Islam: Kemudahan Berbanding Umat Terdahulu",
    "perawi_melayu": "Diriwayatkan daripada Ibn 'Abbas RA berkata:",
    "english_text": "\"There was Qisas among the Children of Israel, but Diyah was unknown among them. Then Allah, the Mighty and Sublime, revealed: \"Al-Qisas (the law of equality in punishment) is prescribed for your in case of murder: the free for the free, the slave for the slave, and the female for the female.\" Up to His saying: \"But if the killer is forgiven by the brother 9or the relatives) of the killed against blood money, then adhering to it with fairness and payment of the blood money to the heir should be made in fairness.\" means: This is easier thanthat which was prescribed for those who came before you, which was Qisas and not Diyah.\"",
    "arabic_text": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنْ سُفْيَانَ، عَنْ عَمْرٍو، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ فِي بَنِي إِسْرَائِيلَ الْقِصَاصُ وَلَمْ تَكُنْ فِيهِمُ الدِّيَةُ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ كُتِبَ عَلَيْكُمُ الْقِصَاصُ فِي الْقَتْلَى الْحُرُّ بِالْحُرِّ وَالْعَبْدُ بِالْعَبْدِ وَالأُنْثَى بِالأُنْثَى ‏}‏ إِلَى قَوْلِهِ ‏{‏ فَمَنْ عُفِيَ لَهُ مِنْ أَخِيهِ شَىْءٌ فَاتِّبَاعٌ بِالْمَعْرُوفِ وَأَدَاءٌ إِلَيْهِ بِإِحْسَانٍ ‏}‏ فَالْعَفْوُ أَنْ يَقْبَلَ الدِّيَةَ فِي الْعَمْدِ وَاتِّبَاعٌ بِمَعْرُوفٍ يَقُولُ يَتَّبِعُ هَذَا بِالْمَعْرُوفِ وَأَدَاءٌ بِإِحْسَانٍ وَيُؤَدِّي هَذَا بِإِحْسَانٍ ‏{‏ ذَلِكَ تَخْفِيفٌ مِنْ رَبِّكُمْ وَرَحْمَةٌ ‏}‏ مِمَّا كُتِبَ عَلَى مَنْ كَانَ قَبْلَكُمْ إِنَّمَا هُوَ الْقِصَاصُ لَيْسَ الدِّيَةَ ‏.‏",
    "malay_translation": "\"Pada zaman Bani Israel, hanya terdapat Qisas dan tidak ada Diyat (tebusan darah). Kemudian Allah, Yang Maha Perkasa dan Maha Agung, menurunkan firman-Nya: \"Telah diwajibkan ke atas kamu Qisas (undang-undang persamaan dalam hukuman) berkenaan dengan orang-orang yang mati dibunuh: orang merdeka dengan orang merdeka, hamba dengan hamba, dan perempuan dengan perempuan.\" Sehingga firman-Nya: \"Maka sesiapa (pembunuh) yang mendapat sesuatu pengampunan daripada saudaranya (wali si mati), hendaklah (orang yang mengampunkan itu) mengikut cara yang baik (dalam menuntut ganti nyawa), dan (si pembunuh) hendaklah membayar ganti nyawa itu (kepada waris si mati) dengan cara yang baik.\" Ini bermakna: Ini adalah lebih mudah daripada apa yang telah ditetapkan bagi orang-orang sebelum kamu, iaitu hanya Qisas dan bukan Diyat.\""
  },
  {
    "id": 19528,
    "hadith_number": 4792,
    "tajuk_hadith": "Pensyariatan Qisas dan Diyat sebagai Keringanan bagi Umat Ini",
    "perawi_melayu": "Diriwayatkan daripada Mujahid, beliau berkata:",
    "english_text": "\"Al-Qisas (the Law of Equality in punishment) is prescribed for you in case of murder: the free  for the free The rule for the Children of Israel was Qisas, and not Diyah. Then Allah, the Mighty and Sublime, revealed the Diyah to them, and He revealed this ruling to this Ummah as an alleviation of the ruling that applied to the Children of Israel.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ حَفْصٍ، قَالَ حَدَّثَنَا وَرْقَاءُ، عَنْ عَمْرٍو، عَنْ مُجَاهِدٍ، قَالَ ‏{‏ كُتِبَ عَلَيْكُمُ الْقِصَاصُ فِي الْقَتْلَى الْحُرُّ بِالْحُرِّ ‏}‏ قَالَ كَانَ بَنُو إِسْرَائِيلَ عَلَيْهِمُ الْقِصَاصُ وَلَيْسَ عَلَيْهِمُ الدِّيَةَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ عَلَيْهِمُ الدِّيَةَ فَجَعَلَهَا عَلَى هَذِهِ الأُمَّةِ تَخْفِيفًا عَلَى مَا كَانَ عَلَى بَنِي إِسْرَائِيلَ ‏.‏",
    "malay_translation": "\"Qisas (Hukum Persamaan dalam hukuman) telah ditetapkan untuk kamu dalam kes pembunuhan: orang merdeka dengan orang merdeka... Hukum bagi Bani Israel adalah Qisas, dan bukan Diyat. Kemudian Allah, Yang Maha Perkasa dan Maha Tinggi, menurunkan Diyat kepada mereka, dan Dia menurunkan hukum ini kepada umat ini sebagai keringanan daripada hukum yang dikenakan kepada Bani Israel.\""
  },
  {
    "id": 19529,
    "hadith_number": 4793,
    "tajuk_hadith": "Anjuran Memaafkan dalam Kes Qisas",
    "perawi_melayu": "Diriwayatkan daripada Anas RA:",
    "english_text": "\"A case requiring Qisas was brought to the Messenger of Allah and he enjoined them to pardon.\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، - وَهُوَ ابْنُ بَكْرِ بْنِ عَبْدِ اللَّهِ الْمُزَنِيُّ - عَنْ عَطَاءِ بْنِ أَبِي مَيْمُونَةَ، عَنْ أَنَسٍ، قَالَ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي قِصَاصٍ فَأَمَرَ فِيهِ بِالْعَفْوِ ‏.‏",
    "malay_translation": "Suatu kes yang memerlukan Qisas telah dibawa kepada Rasulullah SAW dan baginda memerintahkan mereka untuk memberi maaf."
  },
  {
    "id": 19530,
    "hadith_number": 4794,
    "tajuk_hadith": "Nabi Muhammad SAW Sentiasa Menggalakkan Pemberian Maaf dalam Kes Qisas",
    "perawi_melayu": "Diriwayatkan daripada Anas bin Malik RA berkata:",
    "english_text": "\"No case requiring Qisas was ever brought to the Messenger of Allah but he would enjoin pardoning.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، وَبَهْزُ بْنُ أَسَدٍ، وَعَفَّانُ بْنُ مُسْلِمٍ، قَالُوا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَكْرٍ الْمُزَنِيُّ، قَالَ حَدَّثَنَا عَطَاءُ بْنُ أَبِي مَيْمُونَةَ، وَلاَ أَعْلَمُهُ إِلاَّ عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ مَا أُتِيَ النَّبِيُّ صلى الله عليه وسلم فِي شَىْءٍ فِيهِ قِصَاصٌ إِلاَّ أَمَرَ فِيهِ بِالْعَفْوِ ‏.‏",
    "malay_translation": "Tidak pernah dibawa kepada Rasulullah SAW sesuatu kes yang memerlukan Qisas melainkan baginda akan menggalakkan pemberian maaf."
  },
  {
    "id": 19531,
    "hadith_number": 4795,
    "tajuk_hadith": "Pilihan Antara Qisas atau Diyat bagi Waris Mangsa Pembunuhan",
    "perawi_melayu": "Abu Hurairah berkata:",
    "english_text": "\"The Messenger of Allah said: 'If a person's relative is killed, he has the choice of two things: Either he may retaliate, or he may take the ransom.\"'",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أَشْعَثَ، قَالَ حَدَّثَنَا أَبُو مُسْهِرٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ عَبْدِ اللَّهِ بْنِ سَمَاعَةَ - قَالَ أَنْبَأَنَا الأَوْزَاعِيُّ، قَالَ أَخْبَرَنِي يَحْيَى، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ، قَالَ حَدَّثَنِي أَبُو هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ قُتِلَ لَهُ قَتِيلٌ فَهُوَ بِخَيْرِ النَّظَرَيْنِ إِمَّا أَنْ يُقَادَ وَإِمَّا أَنْ يُفْدَى ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: 'Sesiapa yang saudaranya dibunuh, dia mempunyai dua pilihan: Sama ada dia boleh membalas (qisas), atau dia boleh mengambil tebusan (diyat).'"
  },
  {
    "id": 19532,
    "hadith_number": 4796,
    "tajuk_hadith": "Pilihan Antara Qisas atau Diyat bagi Keluarga Mangsa Pembunuhan",
    "perawi_melayu": "Abu Hurairah berkata:",
    "english_text": "\"The Messenger of Allah said: 'If a person's relative is killed, he has the choice of two things: Either he may retaliate, or he may take the ransom.\"'",
    "arabic_text": "أَخْبَرَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ بْنِ مَزْيَدَ، قَالَ أَخْبَرَنِي أَبِي قَالَ، حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ، قَالَ حَدَّثَنَا أَبُو هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ قُتِلَ لَهُ قَتِيلٌ فَهُوَ بِخَيْرِ النَّظَرَيْنِ إِمَّا أَنْ يُقَادَ وَإِمَّا أَنْ يُفْدَى ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: 'Sesiapa yang kerabatnya dibunuh, dia mempunyai pilihan antara dua perkara: Sama ada dia boleh membalas (qisas), atau dia boleh mengambil tebusan (diyat).'"
  },
  {
    "id": 19533,
    "hadith_number": 4797,
    "tajuk_hadith": "Hukuman Bagi Pembunuhan Kerabat",
    "perawi_melayu": "Abu Salamah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "\"If a person's relative is killed.\" In Mursal form. (Shah)",
    "arabic_text": "أَخْبَرَنَا ‏{‏ أَحْمَدُ بْنُ، ‏}‏ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ قَالَ أَنْبَأَنَا ابْنُ عَائِذٍ، قَالَ حَدَّثَنَا يَحْيَى، - هُوَ ابْنُ حَمْزَةَ - قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ قُتِلَ لَهُ قَتِيلٌ ‏\"‏ ‏.‏ مُرْسَلٌ ‏.‏",
    "malay_translation": "\"Sesiapa yang kerabatnya dibunuh.\" Dalam bentuk Mursal. (Shah)"
  },
  {
    "id": 19534,
    "hadith_number": 4798,
    "tajuk_hadith": "Kewajipan Menghalang Pertumpahan Darah dalam Pembunuhan",
    "perawi_melayu": "Diriwayatkan daripada Aisyah bahawa Rasulullah SAW bersabda:",
    "english_text": "\"And it is upon those (relatives) of the killed one to block (any punishment) the first (in line) then the first, even if that one is a woman.\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا الْوَلِيدُ، عَنِ الأَوْزَاعِيِّ، قَالَ حَدَّثَنِي حِصْنٌ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ، ح وَأَنْبَأَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ، قَالَ حَدَّثَنَا الْوَلِيدُ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي حِصْنٌ، أَنَّهُ سَمِعَ أَبَا سَلَمَةَ، يُحَدِّثُ عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ وَعَلَى الْمُقْتَتِلِينَ أَنْ يَنْحَجِزُوا الأَوَّلَ فَالأَوَّلَ وَإِنْ كَانَتِ امْرَأَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "\"Dan adalah menjadi tanggungjawab ke atas (kaum keluarga) si terbunuh untuk menghalang (sebarang hukuman), bermula dengan yang pertama (dalam barisan), kemudian yang pertama, walaupun orang itu seorang wanita.\""
  },
  {
    "id": 19535,
    "hadith_number": 4799,
    "tajuk_hadith": "Hukuman bagi Pembunuhan Tidak Sengaja dan Sengaja",
    "perawi_melayu": "Diriwayatkan daripada Ibn 'Abbas, beliau berkata:",
    "english_text": "\"The Messenger of Allah said: 'Whoever is killed in the blind or by something thrown, while between them is a rock, a wipe, or a stick, then the blood money of be paid for him is the blood money for accidental killing. Whoever kills deliberately, then retaliation is upon him, and whoever tries to prevent that, upon him is the curse of Allah, the Angels, and all the people, and neither Sarf nor Adl will be accepted from him.\"",
    "arabic_text": "أَخْبَرَنَا هِلاَلُ بْنُ الْعَلاَءِ بْنِ هِلاَلٍ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، قَالَ أَنْبَأَنَا سُلَيْمَانُ بْنُ كَثِيرٍ، قَالَ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ قُتِلَ فِي عِمِّيَا أَوْ رِمِّيَا تَكُونُ بَيْنَهُمْ بِحَجَرٍ أَوْ سَوْطٍ أَوْ بِعَصًا فَعَقْلُهُ عَقْلُ خَطَإٍ وَمَنْ قَتَلَ عَمْدًا فَقَوَدُ يَدِهِ فَمَنْ حَالَ بَيْنَهُ وَبَيْنَهُ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ لاَ يُقْبَلُ مِنْهُ صَرْفٌ وَلاَ عَدْلٌ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: 'Sesiapa yang terbunuh dalam keadaan tidak jelas atau disebabkan oleh sesuatu yang dibaling, sementara antara mereka terdapat batu, cemeti, atau kayu, maka diat (wang tebusan) yang perlu dibayar untuknya adalah diat bagi pembunuhan tidak sengaja. Sesiapa yang membunuh dengan sengaja, maka qisas (balasan setimpal) dikenakan ke atasnya, dan sesiapa yang cuba menghalang perkara itu, maka ke atasnya laknat Allah, para Malaikat, dan seluruh manusia, dan tidak akan diterima daripadanya Sarf mahupun Adl.'"
  },
  {
    "id": 19536,
    "hadith_number": 4800,
    "tajuk_hadith": "Hukuman bagi Pembunuhan Tidak Sengaja dan Sengaja",
    "perawi_melayu": "Diriwayatkan daripada Ibn 'Abbas, yang menghubungkannya kepada Nabi SAW, bersabda:",
    "english_text": "\"Whoever is killed in the blind or by something thrown, with a rock, a whip, or a stick, then the blood money to be paid for him is the blood money for accidental killing. Whoever kills deliberately, then retaliation is upon him, and whoever tries to prevent that, upon him is the curse of Allah, the Angels and all the people, and Allah will not accept any Sarf nor 'Adl from him.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ كَثِيرٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، يَرْفَعُهُ قَالَ ‏\n\"‏ مَنْ قُتِلَ فِي عِمِّيَّةٍ أَوْ رِمِّيَّةٍ بِحَجَرٍ أَوْ سَوْطٍ أَوْ عَصًا فَعَقْلُهُ عَقْلُ الْخَطَإِ وَمَنْ قُتِلَ عَمْدًا فَهُوَ قَوَدٌ وَمَنْ حَالَ بَيْنَهُ وَبَيْنَهُ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ لاَ يَقْبَلُ اللَّهُ مِنْهُ صَرْفًا وَلاَ عَدْلاً ‏\"‏ ‏.‏",
    "malay_translation": "\"Sesiapa yang terbunuh dalam keadaan tidak jelas atau dengan sesuatu yang dilemparkan, dengan batu, cemeti, atau kayu, maka diat yang perlu dibayar untuknya adalah diat bagi pembunuhan tidak sengaja. Sesiapa yang membunuh dengan sengaja, maka qisas dikenakan ke atasnya, dan sesiapa yang cuba menghalang qisas tersebut, maka ke atasnya laknat Allah, para Malaikat dan seluruh manusia, dan Allah tidak akan menerima sebarang *Sarf* mahupun *'Adl* daripadanya.\""
  },
  {
    "id": 19537,
    "hadith_number": 4801,
    "tajuk_hadith": "Diyat untuk Pembunuhan Tidak Sengaja yang Mirip Sengaja",
    "perawi_melayu": "Diriwayatkan daripada Al-Qasim bin Rabi'ah, daripada 'Abdullah bin 'Amr, Nabi bersabda:",
    "english_text": "\"The accidental killing, which seems intentional, with a whip or stick, (the Diyah) is one hundred camels, of which forty should be (she-camels) which their young in their wombs.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ، عَنِ الْقَاسِمِ بْنِ رَبِيعَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ قَتِيلُ الْخَطَإِ شِبْهِ الْعَمْدِ بِالسَّوْطِ أَوِ الْعَصَا مِائَةٌ مِنَ الإِبِلِ أَرْبَعُونَ مِنْهَا فِي بُطُونِهَا أَوْلاَدُهَا ‏\"‏ ‏.‏",
    "malay_translation": "\"Pembunuhan tidak sengaja yang mirip dengan sengaja, dengan menggunakan cemeti atau tongkat, (diyatnya) adalah seratus ekor unta, yang mana empat puluh daripadanya adalah (unta betina) yang sedang mengandung anak di dalam perut mereka.\""
  },
  {
    "id": 19538,
    "hadith_number": 4802,
    "tajuk_hadith": "Khutbah Rasulullah SAW pada Hari Pembukaan Kota Mekah",
    "perawi_melayu": "Diriwayatkan daripada Al-Qasim bin Rabi'ah:",
    "english_text": "the Messenger of Allah delivered a speech on the Day of the Conquest. (And he mentioned it) in Mursal from.",
    "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يُونُسُ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنِ الْقَاسِمِ بْنِ رَبِيعَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَطَبَ يَوْمَ الْفَتْحِ ‏.‏ مُرْسَلٌ ‏.‏",
    "malay_translation": "Telah mengkhabarkan kepadaku Muhammad bin Ismail bin Ibrahim, beliau berkata, telah menceritakan kepada kami Yunus, beliau berkata, telah menceritakan kepada kami Hammad, daripada Ayyub, daripada Al-Qasim bin Rabi'ah, bahawa Rasulullah SAW berkhutbah pada hari pembukaan (Kota Mekah). Mursal."
  },
  {
    "id": 19539,
    "hadith_number": 4803,
    "tajuk_hadith": "Diyat bagi Pembunuhan Tidak Sengaja yang Menyerupai Sengaja",
    "perawi_melayu": "Diriwayatkan daripada Abdullah bin 'Amr bahawa Nabi bersabda:",
    "english_text": "\"Indeed the accidental killing, which seems intentional, with a whip or a stick, (the Diyah) is one hundred camels, of which forty should be (she-camels) with their young in their wombs.\"",
    "arabic_text": "أَخْبَرَنِي يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ، قَالَ أَنْبَأَنَا حَمَّادٌ، عَنْ خَالِدٍ، - يَعْنِي الْحَذَّاءَ - عَنِ الْقَاسِمِ بْنِ رَبِيعَةَ، عَنْ عُقْبَةَ بْنِ أَوْسٍ، عَنْ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَلاَ وَإِنَّ قَتِيلَ الْخَطَإِ شِبْهِ الْعَمْدِ مَا كَانَ بِالسَّوْطِ وَالْعَصَا مِائَةٌ مِنَ الإِبِلِ أَرْبَعُونَ فِي بُطُونِهَا أَوْلاَدُهَا ‏\"‏ ‏.‏",
    "malay_translation": "Ketahuilah, sesungguhnya pembunuhan tidak sengaja yang menyerupai sengaja, iaitu yang dilakukan dengan cemeti atau tongkat, (diyatnya) adalah seratus ekor unta, di mana empat puluh ekor daripadanya adalah (unta betina) yang sedang mengandung."
  },
  {
    "id": 19540,
    "hadith_number": 4804,
    "tajuk_hadith": "Diyat bagi Pembunuhan Tidak Sengaja yang Menyerupai Sengaja",
    "perawi_melayu": "Diriwayatkan daripada 'Uqbah bin Aws, bahawa:",
    "english_text": "a man from among the Companions of the Prophet delivered a speech on the Day of the Conquest of Makkah and said: 'Indeed the accidental killing, which seems international, with a whip, a stick, or a rock, (the Diyah) is one hundred camels, of which forty should be pregnant she-camels between the ages of six and nine years old, all in the middle of their pregnancies.'",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَامِلٍ، قَالَ حَدَّثَنَا هُشَيْمٌ، عَنْ خَالِدٍ، عَنِ الْقَاسِمِ بْنِ رَبِيعَةَ، عَنْ عُقْبَةَ بْنِ أَوْسٍ، عَنْ رَجُلٍ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم قَالَ خَطَبَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ فَتْحِ مَكَّةَ فَقَالَ ‏\n\"‏ أَلاَ وَإِنَّ قَتِيلَ الْخَطَإِ شِبْهِ الْعَمْدِ بِالسَّوْطِ وَالْعَصَا وَالْحَجَرِ مِائَةٌ مِنَ الإِبِلِ فِيهَا أَرْبَعُونَ ثَنِيَّةً إِلَى بَازِلِ عَامِهَا كُلُّهُنَّ خَلِفَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki daripada kalangan Sahabat Nabi SAW menyampaikan ucapan pada hari Pembukaan Makkah dan berkata: 'Sesungguhnya pembunuhan tidak sengaja, yang menyerupai sengaja, dengan cemeti, tongkat, atau batu, (Diyat) adalah seratus ekor unta, yang mana empat puluh daripadanya adalah unta betina bunting antara umur enam hingga sembilan tahun, semuanya di pertengahan kehamilan mereka.'"
  },
  {
    "id": 19541,
    "hadith_number": 4805,
    "tajuk_hadith": "Diyat untuk Pembunuhan Tidak Sengaja: Seratus Ekor Unta dengan Empat Puluh Ekor Mengandung",
    "perawi_melayu": "Diriwayatkan daripada 'Uqbah bin 'Aws, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Indeed the accidental killing, the killing with a whip or stick, for it (the Diyah) is one hundred camels - a severe penalty - of which forty should be (she-camels) with their young in their wombs.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، عَنِ ابْنِ أَبِي عَدِيٍّ، عَنْ خَالِدٍ، عَنِ الْقَاسِمِ، عَنْ عُقْبَةَ بْنِ أَوْسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَلاَ إِنَّ قَتِيلَ الْخَطَإِ قَتِيلَ السَّوْطِ وَالْعَصَا فِيهِ مِائَةٌ مِنَ الإِبِلِ مُغَلَّظَةٌ أَرْبَعُونَ مِنْهَا فِي بُطُونِهَا أَوْلاَدُهَا ‏\"‏ ‏.‏",
    "malay_translation": "\"Sesungguhnya pembunuhan tidak sengaja, pembunuhan dengan cemeti atau tongkat, maka (diyatnya) adalah seratus ekor unta - denda yang berat - di mana empat puluh daripadanya adalah (unta betina) yang mengandung anak di dalam perut mereka.\""
  },
  {
    "id": 19542,
    "hadith_number": 4806,
    "tajuk_hadith": "Diyat bagi Pembunuhan Tidak Sengaja atau Separa Sengaja",
    "perawi_melayu": "Diriwayatkan daripada Ya'qub bin Aws, daripada seorang lelaki dalam kalangan Sahabat Nabi ﷺ:",
    "english_text": "when the Messenger of Allah entered Makkah on the Day of the Conquest, he said: \"Indeed, every accidental killing on purpose, or resembling on purpose - killing with a whip or stick, for it are forty (she-camels) which their young in their wombs.\"",
    "arabic_text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنِ الْقَاسِمِ بْنِ رَبِيعَةَ، عَنْ يَعْقُوبَ بْنِ أَوْسٍ، عَنْ رَجُلٍ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمَّا دَخَلَ مَكَّةَ يَوْمَ الْفَتْحِ قَالَ ‏\n\"‏ أَلاَ وَإِنَّ كُلَّ قَتِيلِ خَطَإِ الْعَمْدِ أَوْ شِبْهِ الْعَمْدِ قَتِيلِ السَّوْطِ وَالْعَصَا مِنْهَا أَرْبَعُونَ فِي بُطُونِهَا أَوْلاَدُهَا ‏\"‏ ‏.‏",
    "malay_translation": "Ketika Rasulullah ﷺ memasuki Makkah pada hari Pembukaan (Fathu Makkah), baginda bersabda: \"Sesungguhnya, setiap pembunuhan tidak sengaja yang disengajakan, atau menyerupai sengaja - pembunuhan dengan cemeti atau tongkat, maka diyatnya adalah empat puluh ekor unta betina yang di dalam perutnya terdapat anak (yang belum dilahirkan).\""
  },
  {
    "id": 19543,
    "hadith_number": 4807,
    "tajuk_hadith": "Diyat bagi Pembunuhan Tidak Sengaja yang Disengajakan: Pembayaran dengan Unta Hamil",
    "perawi_melayu": "Diriwayatkan daripada Ya'qub bin Aws:",
    "english_text": "a man from among the Companions of the Prophet told him, that when the Messenger of Allah came to Makkah, in the Year of the Conquest, he said: \"Indeed, accidental killing on purpose, is killing with a whip or stick, for which forty (she-camels) with their young in their wombs.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ، قَالَ حَدَّثَنَا يَزِيدُ، قَالَ حَدَّثَنَا خَالِدٌ، عَنِ الْقَاسِمِ بْنِ رَبِيعَةَ، عَنْ يَعْقُوبَ بْنِ أَوْسٍ، أَنَّ رَجُلاً، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمَّا قَدِمَ مَكَّةَ عَامَ الْفَتْحِ قَالَ ‏\n\"‏ أَلاَ وَإِنَّ قَتِيلَ الْخَطَإِ الْعَمْدِ قَتِيلَ السَّوْطِ وَالْعَصَا مِنْهَا أَرْبَعُونَ فِي بُطُونِهَا أَوْلاَدُهَا ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki daripada kalangan Sahabat Nabi memberitahunya bahawa ketika Rasulullah SAW tiba di Makkah pada Tahun Pembukaan (Kota Makkah), baginda bersabda: \"Sesungguhnya, pembunuhan tidak sengaja yang disengajakan, adalah pembunuhan dengan cemeti atau tongkat, yang mana (diyatnya) adalah empat puluh (ekor unta betina) yang di dalam perut mereka ada anak unta.\""
  },
  {
    "id": 19544,
    "hadith_number": 4808,
    "tajuk_hadith": "Diyat untuk Pembunuhan Tidak Sengaja yang Disengajakan",
    "perawi_melayu": "Diriwayatkan daripada Ya'qub bin Aws:",
    "english_text": "a man from among the Companions of the Prophet narrated to him that the Prophet entered Makkah during the Year of the Conquest, and said: 'Indeed, accidental killing on purpose, is killing with a whip or stick, for which forty (she-camels) with their young in their wombs.",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ، قَالَ أَنْبَأَنَا يَزِيدُ، عَنْ خَالِدٍ، عَنِ الْقَاسِمِ بْنِ رَبِيعَةَ، عَنْ يَعْقُوبَ بْنِ أَوْسٍ، أَنَّ رَجُلاً، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم حَدَّثَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ مَكَّةَ عَامَ الْفَتْحِ قَالَ ‏\n\"‏ أَلاَ وَإِنَّ قَتِيلَ الْخَطَإِ الْعَمْدِ قَتِيلَ السَّوْطِ وَالْعَصَا مِنْهَا أَرْبَعُونَ فِي بُطُونِهَا أَوْلاَدُهَا ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki daripada kalangan Sahabat Nabi ﷺ meriwayatkan kepadanya bahawa Nabi ﷺ memasuki Makkah pada Tahun Pembukaan Kota Makkah, dan bersabda: 'Ketahuilah, sesungguhnya pembunuhan tidak sengaja yang disengajakan adalah pembunuhan dengan cemeti atau tongkat, yang mana diyatnya adalah empat puluh ekor unta betina yang di dalam perutnya ada anak.'"
  },
  {
    "id": 19545,
    "hadith_number": 4809,
    "tajuk_hadith": "Khutbah Rasulullah SAW pada Hari Pembukaan Kota Mekah dan Hukuman bagi Pembunuhan Tidak Sengaja",
    "perawi_melayu": "Diriwayatkan daripada Ibn 'Umar RA berkata:",
    "english_text": "\"The Messenger of Allah stood up on the Day of the Conquest of Makkah, on the steps of Ka'bah. He praised and glorified Allah, then he said: 'Praise be to Allah who has fulfilled His slave and defeated the confederates alone. The one who is killed purposefully by mistake, with a whip or a stick, resembling on purpose, for that (the Diyah) is one hundred camels-a severe penalty-of which forty should be pregnant she-camels with their young in their wombs.\"'",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا ابْنُ جُدْعَانَ، سَمِعَهُ مِنَ الْقَاسِمِ بْنِ رَبِيعَةَ، عَنِ ابْنِ عُمَرَ، قَالَ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ فَتْحِ مَكَّةَ عَلَى دَرَجَةِ الْكَعْبَةِ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ وَقَالَ ‏\n\"‏ الْحَمْدُ لِلَّهِ الَّذِي صَدَقَ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الأَحْزَابَ وَحْدَهُ أَلاَ إِنَّ قَتِيلَ الْعَمْدِ الْخَطَإِ بِالسَّوْطِ وَالْعَصَا شِبْهِ الْعَمْدِ فِيهِ مِائَةٌ مِنَ الإِبِلِ مُغَلَّظَةٌ مِنْهَا أَرْبَعُونَ خَلِفَةٌ فِي بُطُونِهَا أَوْلاَدُهَا ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW berdiri pada hari Pembukaan Kota Mekah, di tangga Kaabah. Baginda memuji dan mengagungkan Allah, kemudian bersabda: 'Segala puji bagi Allah yang telah menunaikan janji-Nya dan menolong hamba-Nya serta mengalahkan golongan yang bersekutu seorang diri. Ketahuilah, sesungguhnya orang yang terbunuh secara sengaja dengan tersilap, dengan cemeti atau tongkat, menyerupai sengaja, maka baginya (Diyat) adalah seratus ekor unta - denda yang berat - yang mana empat puluh ekor daripadanya adalah unta betina yang bunting dengan anak di dalam perutnya.'"
  },
  {
    "id": 19546,
    "hadith_number": 4810,
    "tajuk_hadith": "Diyat bagi Pembunuhan Tidak Sengaja yang Disengajakan (Shibhu al-'Amd)",
    "perawi_melayu": "Diriwayatkan daripada Al-Qasim bin Rabi'ah bahawa Rasulullah SAW bersabda:",
    "english_text": "\"The accident that resembles on purpose, meaning (killing) with a stick or a whip, (for which the Diyah is) one hundred camels, of which forty should be (pregnant she-camels), with their young in their wombs.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا سَهْلُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا حُمَيْدٌ، عَنِ الْقَاسِمِ بْنِ رَبِيعَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْخَطَأُ شِبْهُ الْعَمْدِ - يَعْنِي بِالْعَصَا وَالسَّوْطِ - مِائَةٌ مِنَ الإِبِلِ مِنْهَا أَرْبَعُونَ فِي بُطُونِهَا أَوْلاَدُهَا ‏\"‏ ‏.‏",
    "malay_translation": "\"Kesalahan yang menyerupai perbuatan sengaja, iaitu (membunuh) dengan kayu atau cemeti, (yang mana Diyatnya adalah) seratus ekor unta, yang mana empat puluh daripadanya adalah (unta betina bunting), dengan anak-anak di dalam perut mereka.\""
  },
  {
    "id": 19547,
    "hadith_number": 4811,
    "tajuk_hadith": "Diyat (Pampasan) bagi Pembunuhan Tidak Sengaja dan Hukum Berkaitan",
    "perawi_melayu": "Diriwayatkan daripada 'Amr bin Shu'aib, daripada bapanya, daripada datuknya, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Whoever is killed by mistake, his ransom is one hundred camels: Thirty Bint Makkah, thirty Bint Labun, thirty Hiqqah and ten Bin Labun. \" The Messenger of Allah used to fix the value (of the Diayah for accidental killing) among town-dwellers at four hundred Dinars or the equivalent value in silver. When he calculated the price in terms of people with camels (for Bedouin), it would vary from one time to another. When prices rose, the value in Dinars would rise, and when prices fell the value in Dinars would fall. At the time of the Messenger of Allah the value was between four hundred and eight hundred Dinars, or the equivalent value in silver, eight thousand Dirhams. And the Messenger of Allah ruled that if a person's blood money was paid in cattle, among those who kept cattle, the amount was two hundred cows; and if a person's blood money was paid in sheep, among this who kept sheep, the value was two thousand sheep. The Messenger of Allah ruled that the blood money is part of the estate, to be divided among the heirs of the victim according to their allotted shares, and whatever is left over is for the 'Asabah. And the Messenger of Allah ruled that if a woman commits urder then he 'Asahah, whoever they may be, must pay the blood money, but they do not inherit anything except that which is left over from her heirs; if a woman is killed then her blood money is to be shared among her heirs, and they may kill her killer. (Hasah)",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ رَاشِدٍ، عَنْ سُلَيْمَانَ بْنِ مُوسَى، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ قُتِلَ خَطَأً فَدِيَتُهُ مِائَةٌ مِنَ الإِبِلِ ثَلاَثُونَ بِنْتَ مَخَاضٍ وَثَلاَثُونَ بِنْتَ لَبُونٍ وَثَلاَثُونَ حِقَّةً وَعَشْرَةٌ بَنِي لَبُونٍ ذُكُورٍ ‏\"‏ ‏.‏ قَالَ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُقَوِّمُهَا عَلَى أَهْلِ الْقُرَى أَرْبَعَمِائَةَ دِينَارٍ أَوْ عِدْلَهَا مِنَ الْوَرِقِ وَيُقَوِّمُهَا عَلَى أَهْلِ الإِبِلِ إِذَا غَلَتْ رَفَعَ فِي قِيمَتِهَا وَإِذَا هَانَتْ نَقَصَ مِنْ قِيمَتِهَا عَلَى نَحْوِ الزَّمَانِ مَا كَانَ فَبَلَغَ قِيمَتُهَا عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم مَا بَيْنَ الأَرْبَعِمِائَةِ دِينَارٍ إِلَى ثَمَانَمِائَةِ دِينَارٍ أَوْ عِدْلَهَا مِنَ الْوَرِقِ ‏.‏ قَالَ وَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنَّ مَنْ كَانَ عَقْلُهُ فِي الْبَقَرِ عَلَى أَهْلِ الْبَقَرِ مِائَتَىْ بَقَرَةٍ وَمَنْ كَانَ عَقْلُهُ فِي الشَّاةِ أَلْفَىْ شَاةٍ وَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنَّ الْعَقْلَ مِيرَاثٌ بَيْنَ وَرَثَةِ الْقَتِيلِ عَلَى فَرَائِضِهِمْ فَمَا فَضَلَ فَلِلْعَصَبَةِ وَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَعْقِلَ عَلَى الْمَرْأَةِ عَصَبَتُهَا مَنْ كَانُوا وَلاَ يَرِثُونَ مِنْهُ شَيْئًا إِلاَّ مَا فَضَلَ عَنْ وَرَثَتِهَا وَإِنْ قُتِلَتْ فَعَقْلُهَا بَيْنَ وَرَثَتِهَا وَهُمْ يَقْتُلُونَ قَاتِلَهَا ‏.‏",
    "malay_translation": "\"Sesiapa yang terbunuh secara tidak sengaja, maka diat (pampasannya) adalah seratus ekor unta: Tiga puluh Bint Makhad, tiga puluh Bint Labun, tiga puluh Hiqqah dan sepuluh Bani Labun.\" Rasulullah SAW menetapkan nilai diat (bagi pembunuhan tidak sengaja) di kalangan penduduk kota sebanyak empat ratus Dinar atau nilai yang setara dengannya dalam perak. Apabila baginda mengira harga dari segi orang yang memiliki unta (bagi Badwi), ia akan berbeza dari satu masa ke masa yang lain. Apabila harga meningkat, nilai dalam Dinar akan meningkat, dan apabila harga menurun, nilai dalam Dinar akan menurun. Pada zaman Rasulullah SAW, nilai itu adalah antara empat ratus hingga lapan ratus Dinar, atau nilai yang setara dengannya dalam perak, lapan ribu Dirham. Dan Rasulullah SAW memutuskan bahawa jika wang darah seseorang dibayar dalam ternakan lembu, di kalangan mereka yang memelihara lembu, jumlahnya adalah dua ratus ekor lembu; dan jika wang darah seseorang dibayar dalam ternakan biri-biri, di kalangan mereka yang memelihara biri-biri, nilainya adalah dua ribu ekor biri-biri. Rasulullah SAW memutuskan bahawa wang darah adalah sebahagian daripada harta pusaka, untuk dibahagikan di kalangan waris mangsa mengikut bahagian yang telah ditetapkan, dan apa sahaja yang lebih adalah untuk 'Asabah. Dan Rasulullah SAW memutuskan bahawa jika seorang wanita melakukan pembunuhan maka 'Asabah, sesiapa sahaja mereka, mesti membayar wang darah, tetapi mereka tidak mewarisi apa-apa kecuali apa yang lebih daripada warisnya; jika seorang wanita dibunuh maka wang darahnya hendaklah dibahagikan di kalangan warisnya, dan mereka boleh membunuh pembunuhnya. (Hasah)"
  },
  {
    "id": 19548,
    "hadith_number": 4812,
    "tajuk_hadith": "Diyat untuk Pembunuhan Tidak Sengaja",
    "perawi_melayu": "In Mas'ud berkata:",
    "english_text": "\"The Messenger of Allah ruled that the Diyah for accidental killing is twenty Bint Makhad, twenty Bin Makhad, twenty Bint Labur, twenty Jadh'ah, and twenty Hiqqah.\"",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ سَعِيدِ بْنِ مَسْرُوقٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ، عَنْ حَجَّاجٍ، عَنْ زَيْدِ بْنِ جُبَيْرٍ، عَنْ خِشْفِ بْنِ مَالِكٍ، قَالَ سَمِعْتُ ابْنَ مَسْعُودٍ، يَقُولُ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم دِيَةَ الْخَطَإِ عِشْرِينَ بِنْتَ مَخَاضٍ وَعِشْرِينَ ابْنَ مَخَاضٍ ذُكُورًا وَعِشْرِينَ بِنْتَ لَبُونٍ وَعِشْرِينَ جَذَعَةً وَعِشْرِينَ حِقَّةً ‏.‏",
    "malay_translation": "\"Rasulullah SAW memutuskan bahawa Diyat bagi pembunuhan tidak sengaja adalah dua puluh Bint Makhad, dua puluh Bin Makhad, dua puluh Bint Labun, dua puluh Jadz'ah, dan dua puluh Hiqqah.\""
  },
  {
    "id": 19549,
    "hadith_number": 4813,
    "tajuk_hadith": "Diyat (Pampasan) pada Zaman Rasulullah SAW",
    "perawi_melayu": "Diriwayatkan daripada Ibn 'Abbas RA berkata:",
    "english_text": "\"A man killed another man during the time of the Messenger of Allah, and the Prophet set the Diyah at twelve thousand. And he mentioned His saying: And they could not find any cause to do so except that Allah and His Messenger had enriched them of His Bounty. concerning them taking the Dyah.\" (Hasan)\nThis is the wording of Abu Dawud.",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، عَنْ مُعَاذِ بْنِ هَانِئٍ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ مُسْلِمٍ، قَالَ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، ح وَأَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا مُعَاذُ بْنُ هَانِئٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ مُسْلِمٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَتَلَ رَجُلٌ رَجُلاً عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَجَعَلَ النَّبِيُّ صلى الله عليه وسلم دِيَتَهُ اثْنَىْ عَشَرَ أَلْفًا وَذَكَرَ قَوْلَهُ إِلاَّ أَنْ أَغْنَاهُمُ اللَّهُ وَرَسُولُهُ مِنْ فَضْلِهِ فِي أَخْذِهِمُ الدِّيَةَ ‏.‏ وَاللَّفْظُ لأَبِي دَاوُدَ ‏.‏",
    "malay_translation": "Seorang lelaki membunuh seorang lelaki lain pada zaman Rasulullah SAW, dan Nabi SAW menetapkan Diyat (pampasan) sebanyak dua belas ribu. Baginda SAW menyebut firman-Nya: Dan mereka tidak menemui sebarang sebab untuk berbuat demikian kecuali Allah dan Rasul-Nya telah memperkayakan mereka dengan limpah kurnia-Nya, berkenaan dengan pengambilan Diyat tersebut.\" (Hasan)\nIni adalah lafaz Abu Daud."
  },
  {
    "id": 19550,
    "hadith_number": 4814,
    "tajuk_hadith": "Hukuman Nabi SAW tentang Diyat Dua Belas Ribu",
    "perawi_melayu": "Diriwayatkan daripada Ibn 'Abbas bahawa:",
    "english_text": "the Prophet ruled that twelve thousand (should be given) as Diyah. (Hahan)",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَيْمُونٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ عِكْرِمَةَ، سَمِعْنَاهُ مَرَّةً، يَقُولُ عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَضَى بِاثْنَىْ عَشَرَ أَلْفًا يَعْنِي فِي الدِّيَةِ ‏.‏",
    "malay_translation": "Telah mengkhabarkan kepada kami Muhammad bin Maimun, beliau berkata, telah menceritakan kepada kami Sufyan, daripada 'Amr, daripada 'Ikrimah, kami mendengarnya sekali, beliau berkata daripada Ibn 'Abbas, bahawa Nabi SAW memutuskan dengan dua belas ribu, iaitu dalam Diyat."
  },
  {
    "id": 19551,
    "hadith_number": 4815,
    "tajuk_hadith": "Diyat Wanita: Sama Seperti Lelaki Sehingga Satu Pertiga",
    "perawi_melayu": "Diriwayatkan daripada 'Amr bin Shu'aib, daripada bapanya, daripada datuknya, berkata:",
    "english_text": "\"The Messenger of Allah said: 'The blood money of a woman (in the event of injury) is like the blood money of a man, up to one-third of the Diyah (for her life).\"",
    "arabic_text": "أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، قَالَ حَدَّثَنَا ضَمْرَةُ، عَنْ إِسْمَاعِيلَ بْنِ عَيَّاشٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ عَقْلُ الْمَرْأَةِ مِثْلُ عَقْلِ الرَّجُلِ حَتَّى يَبْلُغَ الثُّلُثَ مِنْ دِيَتِهَا ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: 'Diyat seorang wanita (dalam kes kecederaan) adalah seperti diyat seorang lelaki, sehingga satu pertiga daripada Diyat (untuk nyawanya).'"
  },
  {
    "id": 19552,
    "hadith_number": 4816,
    "tajuk_hadith": "Diyat (Pampasan) bagi Ahl Adh-Dhimmah",
    "perawi_melayu": "Diriwayatkan dari 'Amr Bin Shu'aib, dari ayahnya, bahwa kakeknya berkata:",
    "english_text": "\"The Messenger of Allah said: 'The blood money for Ahl Adh-Dhimmah is half that of the blood money for the Muslims, and they are the Jews and Christians.\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ مُحَمَّدِ بْنِ رَاشِدٍ، عَنْ سُلَيْمَانَ بْنِ مُوسَى، وَذَكَرَ، كَلِمَةً مَعْنَاهَا عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ عَقْلُ أَهْلِ الذِّمَّةِ نِصْفُ عَقْلِ الْمُسْلِمِينَ ‏\"‏ ‏.‏ وَهُمُ الْيَهُودُ وَالنَّصَارَى ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: 'Diyat (pampasan) bagi Ahl Adh-Dhimmah adalah separuh dari diyat bagi orang Muslim, dan mereka adalah orang Yahudi dan Nasrani.'"
  },
  {
    "id": 19553,
    "hadith_number": 4817,
    "tajuk_hadith": "Diyat (Pampasan) untuk Orang Kafir adalah Separuh daripada Diyat Orang Mukmin",
    "perawi_melayu": "Diriwayatkan daripada 'Amr bin Shu'aib, daripada bapanya, daripada 'Abdullah bin 'Amr, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"The blood money for a disbeliever is half the blood money for the believer.\" (Hassan)",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ عَقْلُ الْكَافِرِ نِصْفُ عَقْلِ الْمُؤْمِنِ ‏\"‏ ‏.‏",
    "malay_translation": "\"Diyat (pampasan) bagi seorang kafir adalah separuh daripada diyat seorang mukmin.\" (Hassan)"
  },
  {
    "id": 19554,
    "hadith_number": 4818,
    "tajuk_hadith": "Diyat bagi Mukatab yang Dibunuh",
    "perawi_melayu": "Diriwayatkan daripada Ibn 'Abbas:",
    "english_text": "\"The Messenger of Allah ruled that the Diyah for a Mukatab who is killed should be (equivalent) to the Diyah for a free mand, proportionate to the amount be had paid off (toward buying his freedom).\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا وَكِيعٌ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْمُكَاتَبِ يُقْتَلُ بِدِيَةِ الْحُرِّ عَلَى قَدْرِ مَا أَدَّى ‏.‏",
    "malay_translation": "Rasulullah SAW memutuskan bahawa Diyat bagi seorang Mukatab yang dibunuh adalah (bersamaan) dengan Diyat seorang lelaki merdeka, sepadan dengan jumlah yang telah dibayarnya (untuk membeli kebebasannya)."
  },
  {
    "id": 19555,
    "hadith_number": 4819,
    "tajuk_hadith": "Diyat untuk Mukatab (Hamba yang Membuat Perjanjian Pembebasan)",
    "perawi_melayu": "Diriwayatkan daripada Ibn 'Abbas bahawa:",
    "english_text": "the Prophet of Allah ruled that the Diyah for a Mukatab should be (equivalent) to the Diyah for a free man, proportionate to the amount he had paid off (toward buying his freedom).",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ بْنِ يَزِيدَ، قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عَبْدِ الرَّحْمَنِ الطَّرَائِفِيُّ، قَالَ حَدَّثَنَا مُعَاوِيَةُ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَضَى فِي الْمُكَاتَبِ أَنْ يُودَى بِقَدْرِ مَا عَتَقَ مِنْهُ دِيَةَ الْحُرِّ ‏.‏",
    "malay_translation": "Nabi Allah SAW memutuskan bahawa Diyat bagi seorang Mukatab (hamba yang membuat perjanjian pembebasan) adalah (bersamaan) dengan Diyat bagi seorang lelaki merdeka, berkadar dengan jumlah yang telah dibayarnya (ke arah membeli kebebasannya)."
  },
  {
    "id": 19556,
    "hadith_number": 4820,
    "tajuk_hadith": "Hukuman Diyat untuk Mukatab (Hamba yang Membuat Perjanjian Pembebasan)",
    "perawi_melayu": "Diriwayatkan daripada Ibn 'Abbas RA berkata:",
    "english_text": "\"The Messenger of Allah ruled that in the case of a Mukatab, the Diyah should be (equivalent) to the Diyah for a free man, proportionate to the amount he had paid off (towards buying his freedom).\" (Dar'if)",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَعْلَى، عَنِ الْحَجَّاجِ الصَّوَّافِ، عَنْ يَحْيَى، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْمُكَاتَبِ يُودَى بِقَدْرِ مَا أَدَّى مِنْ مُكَاتَبَتِهِ دِيَةَ الْحُرِّ وَمَا بَقِيَ دِيَةَ الْعَبْدِ ‏.‏",
    "malay_translation": "Rasulullah SAW memutuskan bahawa dalam kes seorang Mukatab, Diyat hendaklah (bersamaan) dengan Diyat untuk orang merdeka, berkadar dengan jumlah yang telah dibayarnya (ke arah membeli kebebasannya)."
  },
  {
    "id": 19557,
    "hadith_number": 4821,
    "tajuk_hadith": "Hukum Mukatab (Hamba yang Membuat Perjanjian Pembebasan)",
    "perawi_melayu": "Diriwayatkan daripada Ibn 'Abbas bahawa Nabi bersabda:",
    "english_text": "\"The Mukatab is free to the extent that the has paid off (toward buying his freedom); he Hadd punishment should be carried out on him proportionate to the amount he has paid off (toward buying his freedom); and he inherits proportionate to the amount he has paid off (toward buying his freedom).\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى بْنِ النَّقَّاشِ، قَالَ حَدَّثَنَا يَزِيدُ، - يَعْنِي ابْنَ هَارُونَ - قَالَ أَنْبَأَنَا حَمَّادٌ، عَنْ قَتَادَةَ، عَنْ خِلاَسٍ، عَنْ عَلِيٍّ، وَعَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْمُكَاتَبُ يَعْتِقُ بِقَدْرِ مَا أَدَّى وَيُقَامُ عَلَيْهِ الْحَدُّ بِقَدْرِ مَا عَتَقَ مِنْهُ وَيَرِثُ بِقَدْرِ مَا عَتَقَ مِنْهُ ‏\"‏ ‏.‏",
    "malay_translation": "\"Seorang Mukatab (hamba yang membuat perjanjian pembebasan) adalah bebas setakat mana yang telah dibayarnya (ke arah membeli kebebasannya); hukuman Hadd hendaklah dilaksanakan ke atasnya seimbang dengan jumlah yang telah dibayarnya (ke arah membeli kebebasannya); dan dia mewarisi seimbang dengan jumlah yang telah dibayarnya (ke arah membeli kebebasannya).\""
  },
  {
    "id": 19558,
    "hadith_number": 4822,
    "tajuk_hadith": "Diyat untuk Mukatab yang Dibunuh",
    "perawi_melayu": "Diriwayatkan daripada Ibn 'Abbas bahawa:",
    "english_text": "a Mukatab was killed at the time of the Messenger of Allah and he commanded that the Diyah be paid (equivalent) to the Diyah for a free man, (proportionate to the amount he had paid off towards buying his freedom).",
    "arabic_text": "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الأَشْعَثِيُّ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، وَعَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ مُكَاتَبًا، قُتِلَ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَمَرَ أَنْ يُودَى مَا أَدَّى دِيَةَ الْحُرِّ وَمَا لاَ دِيَةَ الْمَمْلُوكِ ‏.‏",
    "malay_translation": "Seorang Mukatab telah dibunuh pada zaman Rasulullah SAW, dan baginda memerintahkan agar Diyat dibayar (bersamaan) dengan Diyat untuk seorang lelaki merdeka (berkadar dengan jumlah yang telah dibayarnya untuk membeli kebebasannya)."
  },
  {
    "id": 19559,
    "hadith_number": 4823,
    "tajuk_hadith": "Larangan Melempar Batu Kerikil dan Diyat untuk Keguguran",
    "perawi_melayu": "Diriwayatkan daripada 'Abdullah bin Buraidah, daripada ayahnya, bahwa:",
    "english_text": "a woman threw some pebbles and stuck another woman, and she miscarried. The Messenger of Allah stipulated (a Diyah of ) fifty sheep for her child. And on that day, he forbade throwing pebbles.",
    "arabic_text": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، وَإِبْرَاهِيمُ بْنُ يُونُسَ بْنِ مُحَمَّدٍ، قَالاَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، قَالَ حَدَّثَنَا يُوسُفُ بْنُ صُهَيْبٍ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، أَنَّ امْرَأَةً، خَذَفَتِ امْرَأَةً فَأَسْقَطَتْ فَجَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي وَلَدِهَا خَمْسِينَ شَاةً وَنَهَى يَوْمَئِذٍ عَنِ الْخَذْفِ ‏.‏ أَرْسَلَهُ أَبُو نُعَيْمٍ ‏.‏",
    "malay_translation": "Seorang wanita melempar beberapa batu kerikil dan mengenai wanita lain, menyebabkan wanita itu keguguran. Rasulullah SAW menetapkan (diyat) lima puluh ekor kambing untuk anaknya. Dan pada hari itu, baginda melarang melempar batu kerikil."
  },
  {
    "id": 19560,
    "hadith_number": 4824,
    "tajuk_hadith": "Larangan Melempar Batu dan Diyat untuk Keguguran",
    "perawi_melayu": "\"Abdullah bin Buraidah meriwayatkan bahawa:",
    "english_text": "a woman threw pebbles at another woman and the woman who was struck miscarried. The matter was referred to the prophet and he set the blood money for her child at five hundred sheep. And on that day, he forbade throwing pebbles. (Sahih) \nAbu 'Abdur-Rahman (An-Nasa'i) said: This is an error, and it must be that the intent was one hundred camels. And the prohibition of throwing pebbles has been related from 'Abdullah bin Buraidah, from 'Abdullah bin Mughaffal.",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ يَحْيَى، قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا يُوسُفُ بْنُ صُهَيْبٍ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، أَنَّ امْرَأَةً، خَذَفَتِ امْرَأَةً فَأَسْقَطَتِ الْمَخْذُوفَةُ فَرُفِعَ ذَلِكَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَجَعَلَ عَقْلَ وَلَدِهَا خَمْسَمِائَةٍ مِنَ الْغُرِّ وَنَهَى يَوْمَئِذٍ عَنِ الْخَذْفِ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا وَهْمٌ وَيَنْبَغِي أَنْ يَكُونَ أَرَادَ مِائَةً مِنَ الْغُرِّ ‏.‏ وَقَدْ رُوِيَ النَّهْىُ عَنِ الْخَذْفِ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ ‏.‏",
    "malay_translation": "Seorang wanita melempar batu kecil kepada wanita lain, dan wanita yang terkena lemparan itu mengalami keguguran. Perkara itu dirujukkan kepada Nabi Muhammad SAW, dan baginda menetapkan diyat (denda) untuk anak yang keguguran itu sebanyak lima ratus ekor kambing. Dan pada hari itu, baginda melarang perbuatan melempar batu kecil. (Sahih)\nAbu 'Abdur-Rahman (An-Nasa'i) berkata: Ini adalah satu kesilapan, dan yang dimaksudkan seharusnya seratus ekor unta. Dan larangan melempar batu kecil diriwayatkan daripada 'Abdullah bin Buraidah, daripada 'Abdullah bin Mughaffal."
  },
  {
    "id": 19561,
    "hadith_number": 4825,
    "tajuk_hadith": "Larangan Melempar Batu Kerikil",
    "perawi_melayu": "Diriwayatkan daripada 'Abdullah bin Mughaffal bahawa beliau melihat seorang lelaki melempar batu kerikil lalu beliau berkata:",
    "english_text": "\"Do not throw pebbles, for the Prophet of Allah forbade throwing pebbles,\" or \"he disliked the throwing of pebbles.\" Kahmas (one of the narrators) was not sure.",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا يَزِيدُ، قَالَ أَنْبَأَنَا كَهْمَسٌ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ، أَنَّهُ رَأَى رَجُلاً يَخْذِفُ فَقَالَ لاَ تَخْذِفْ فَإِنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم كَانَ يَنْهَى عَنِ الْخَذْفِ أَوْ يَكْرَهُ الْخَذْفَ ‏.‏ شَكَّ كَهْمَسُ ‏.‏",
    "malay_translation": "\"Jangan melempar batu kerikil, kerana Nabi Allah melarang melempar batu kerikil,\" atau \"baginda tidak menyukai perbuatan melempar batu kerikil.\" Kahmas (salah seorang perawi) tidak pasti."
  },
  {
    "id": 19562,
    "hadith_number": 4826,
    "tajuk_hadith": "Hukuman Diyat untuk Janin",
    "perawi_melayu": "Hamal bin Malik berkata:",
    "english_text": "\"The Messenger of Allah ruled that a slave (should be given as Diyah) for a fetus.\" Tawus said: \"A horse would do in place of a slave.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ عَمْرٍو، عَنْ طَاوُسٍ، أَنَّ عُمَرَ، اسْتَشَارَ النَّاسَ فِي الْجَنِينِ فَقَالَ حَمَلُ بْنُ مَالِكٍ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْجَنِينِ غُرَّةً ‏.‏ قَالَ طَاوُسٌ إِنَّ الْفَرَسَ غُرَّةٌ ‏.‏",
    "malay_translation": "\"Rasulullah SAW memutuskan bahawa seorang hamba (harus diberikan sebagai Diyat) untuk janin.\" Tawus berkata: \"Seekor kuda boleh menggantikan seorang hamba.\""
  },
  {
    "id": 19563,
    "hadith_number": 4827,
    "tajuk_hadith": "Hukuman Bagi Janin Yang Gugur dan Pembahagian Pusaka",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA berkata:",
    "english_text": "\"The Messenger of Allah ruled that a male or female slave should be given (as Diyah) to a woman of Banu Lihyah whosw child was miscarried and died. Then the woman to whom he had decreed that the slave should be given died, and the Messenger of Allah ruled that her estate belonged to the children and husband, and that the blood money was to be paid by her 'Asabah.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي جَنِينِ امْرَأَةٍ مِنْ بَنِي لِحْيَانَ سَقَطَ مَيِّتًا بِغُرَّةٍ عَبْدٍ أَوْ أَمَةٍ ثُمَّ إِنَّ الْمَرْأَةَ الَّتِي قَضَى عَلَيْهَا بِالْغُرَّةِ تُوُفِّيَتْ فَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم بِأَنَّ مِيرَاثَهَا لِبَنِيهَا وَزَوْجِهَا وَأَنَّ الْعَقْلَ عَلَى عَصَبَتِهَا ‏.‏",
    "malay_translation": "Rasulullah SAW memutuskan bahawa seorang hamba lelaki atau perempuan hendaklah diberikan (sebagai Diyah) kepada seorang wanita dari Bani Lihyah yang anaknya keguguran dan meninggal dunia. Kemudian wanita yang telah ditetapkan untuk diberikan hamba itu meninggal dunia, dan Rasulullah SAW memutuskan bahawa harta pusakanya adalah milik anak-anak dan suaminya, dan bahawa wang tebusan (diyat) itu hendaklah dibayar oleh 'Asabah (kaum kerabat lelaki sebelah bapa)nya."
  },
  {
    "id": 19564,
    "hadith_number": 4828,
    "tajuk_hadith": "Hukuman Diyat bagi Janin dan Wanita yang Dibunuh dalam Pertengkaran",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA berkata:",
    "english_text": "\"Two women of Hudhail had a fight, and one of them threw a rock at the other and killed her and the child in her womb. They referred the dispute to the Messenger of Allah, and the Messenger of Allah ruled that the Diyah for her fetus was a male or female slave, and that the Diyah of the woman be paid by her 'Aqilah (male relatives on the father's side). And he made her children and those who were with them her heirs. Hamal bin Malik bin An-Nabighah Al-Hudhali said: \"O Messenger of Allah, how can I pay blood money for one who neither ate nor drank, or shouted such a one should be over looked.\" The Messenger of Allah said: \"This is one of the brothers of the soothsayers\" because of the rhyming way in which he spoke.",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، وَسَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ اقْتَتَلَتِ امْرَأَتَانِ مِنْ هُذَيْلٍ فَرَمَتْ إِحْدَاهُمَا الأُخْرَى بِحَجَرٍ وَذَكَرَ كَلِمَةً مَعْنَاهَا فَقَتَلَتْهَا وَمَا فِي بَطْنِهَا فَاخْتَصَمُوا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنَّ دِيَةَ جَنِينِهَا غُرَّةٌ عَبْدٌ أَوْ وَلِيدَةٌ وَقَضَى بِدِيَةِ الْمَرْأَةِ عَلَى عَاقِلَتِهَا وَوَرَّثَهَا وَلَدَهَا وَمَنْ مَعَهُمْ ‏.‏ فَقَالَ حَمَلُ بْنُ مَالِكِ بْنِ النَّابِغَةِ الْهُذَلِيُّ يَا رَسُولَ اللَّهِ كَيْفَ أُغَرَّمُ مَنْ لاَ شَرِبَ وَلاَ أَكَلْ وَلاَ نَطَقَ وَلاَ اسْتَهَلّ فَمِثْلُ ذَلِكَ يُطَلّ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّمَا هَذَا مِنْ إِخْوَانِ الْكُهَّانِ ‏\"‏ ‏.‏ مِنْ أَجْلِ سَجْعِهِ الَّذِي سَجَعَ ‏.‏",
    "malay_translation": "Dua orang wanita dari Hudhail bergaduh, dan salah seorang daripada mereka melemparkan batu kepada yang lain lalu membunuhnya dan anak dalam kandungannya. Mereka merujuk pertikaian itu kepada Rasulullah SAW, dan Rasulullah SAW memutuskan bahawa Diyat untuk janinnya adalah seorang hamba lelaki atau perempuan, dan bahawa Diyat wanita itu dibayar oleh 'Aqilahnya (saudara lelaki dari pihak ayah). Dan Baginda menjadikan anak-anaknya dan mereka yang bersama mereka sebagai warisnya. Hamal bin Malik bin An-Nabighah Al-Hudhali berkata: \"Wahai Rasulullah, bagaimana saya boleh membayar diat untuk seseorang yang tidak makan, tidak minum, atau bersuara, yang seperti itu patut diabaikan?\" Rasulullah SAW bersabda: \"Sesungguhnya ini adalah salah seorang daripada saudara tukang tilik\" kerana cara berirama yang dia gunakan dalam percakapannya."
  },
  {
    "id": 19565,
    "hadith_number": 4829,
    "tajuk_hadith": "Hukuman bagi Wanita yang Menyebabkan Keguguran Kandungan",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah bahawa:",
    "english_text": "there were two women of Hudhail during the time of the Messenger of Allah, one of whom threw something at the other and caused her to miscarry. The Messenger of Allah ruled that (Diyah of ) a male or female slave be paid for that.",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ امْرَأَتَيْنِ، مِنْ هُذَيْلٍ فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم رَمَتْ إِحْدَاهُمَا الأُخْرَى فَطَرَحَتْ جَنِينَهَا فَقَضَى فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم بِغُرَّةٍ عَبْدٍ أَوْ وَلِيدَةٍ ‏.‏",
    "malay_translation": "Pada zaman Rasulullah SAW, terdapat dua orang wanita daripada suku Hudhail. Salah seorang daripada mereka telah membaling sesuatu kepada yang lain, menyebabkan wanita itu mengalami keguguran. Rasulullah SAW memutuskan bahawa (diyat) hendaklah dibayar dengan seorang hamba lelaki atau perempuan."
  },
  {
    "id": 19566,
    "hadith_number": 4830,
    "tajuk_hadith": "Hukuman Diyat untuk Janin yang Gugur dalam Kandungan",
    "perawi_melayu": "Diriwayatkan daripada Sa'eed bin Al-Musayyab bahwa:",
    "english_text": "the Messenger of Allah ruled that for a fetus which is killed in the mother's womb, a male or female slave be given (as Diyah). The one against whom he passed this ruling said: \"How can I pay blood money for one who neither ate nor drank, or shouted or cried (at the moment of birth)? Such a one should be overlooked.\" The Messenger of Allah said: \"This is one of the soothsayers.\"'",
    "arabic_text": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى فِي الْجَنِينِ يُقْتَلُ فِي بَطْنِ أُمِّهِ بِغُرَّةٍ عَبْدٍ أَوْ وَلِيدَةٍ فَقَالَ الَّذِي قَضَى عَلَيْهِ كَيْفَ أُغَرَّمُ مَنْ لاَ شَرِبَ وَلاَ أَكَلَ وَلاَ اسْتَهَلّ وَلاَ نَطَقَ فَمِثْلُ ذَلِكَ يُطَلّ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّمَا هَذَا مِنَ الْكُهَّانِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW telah memutuskan bahwa untuk janin yang dibunuh di dalam rahim ibunya, hendaklah diberikan seorang hamba laki-laki atau perempuan (sebagai Diyat). Orang yang dijatuhkan hukuman ini berkata: \"Bagaimana saya harus membayar diyat untuk seseorang yang tidak makan dan tidak minum, atau berteriak dan menangis (pada saat kelahiran)? Orang seperti itu harus diabaikan.\" Rasulullah SAW bersabda: \"Ini adalah salah seorang tukang ramal.\""
  },
  {
    "id": 19567,
    "hadith_number": 4831,
    "tajuk_hadith": "Hukuman Diyat dan Ganti Rugi untuk Janin Akibat Pembunuhan",
    "perawi_melayu": "Diriwayatkan daripada Al-Mughirah bin Shu'bah bahawa:",
    "english_text": "a woman struck her co-wife with a tent pole and killed her, and she (the slain woman) was pregnant. She was brought to the Prophet, and the Messenger of Allah ruled that the 'Asabah of the killer should pay the Diyah , and a slavae (should be paid) for the fetus. Her 'Asabah said: \"Should Diyah be paid for one who neither ate nor drank, or shouted or cried (at the moment of birth)? Such a one should be overlooked.\" The prophet said: \"Rhyming verse like the verse of the Bedouins.\"",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَلِيٍّ، قَالَ حَدَّثَنَا خَلَفٌ، - وَهُوَ ابْنُ تَمِيمٍ - قَالَ حَدَّثَنَا زَائِدَةُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، أَنَّ امْرَأَةً، ضَرَبَتْ ضَرَّتَهَا بِعَمُودِ فُسْطَاطٍ فَقَتَلَتْهَا وَهِيَ حُبْلَى فَأُتِيَ فِيهَا النَّبِيُّ صلى الله عليه وسلم فَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى عَصَبَةِ الْقَاتِلَةِ بِالدِّيَةِ وَفِي الْجَنِينِ غُرَّةً ‏.‏ فَقَالَ عَصَبَتُهَا أَدِي مَنْ لاَ طَعِمَ وَلاَ شَرِبَ وَلاَ صَاحَ فَاسْتَهَلّ فَمِثْلُ هَذَا يُطَلّ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ أَسَجْعٌ كَسَجْعِ الأَعْرَابِ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang wanita memukul madunya dengan tiang khemah sehingga membunuhnya, dan wanita (yang terbunuh) itu sedang hamil. Perkara ini dibawa kepada Nabi Muhammad SAW, dan Rasulullah SAW memutuskan bahawa 'Asabah (kaum lelaki sebelah bapa) pembunuh itu hendaklah membayar Diyat (tebusan), dan seorang hamba (hendaklah dibayar) untuk janin itu. 'Asabah wanita itu berkata: \"Adakah Diyat perlu dibayar untuk seseorang yang tidak makan, tidak minum, tidak menjerit atau menangis (ketika dilahirkan)? Orang seperti ini patut diabaikan.\" Nabi SAW bersabda: \"Sajak seperti sajak orang Badwi.\""
  },
  {
    "id": 19568,
    "hadith_number": 4832,
    "tajuk_hadith": "Hukuman Diyat bagi Pembunuhan Wanita Hamil dan Kandungannya",
    "perawi_melayu": "Diriwayatkan daripada Al-Mughirah bin Shu'bah, beliau berkata:",
    "english_text": "\"A woman struck her co-wife, who was pregnant, with a tent pole and Killed her, The Messenger of Allah ruled that the 'Asahab of the Killer was to pay the Diyah and to give a slave (as Diyah for ) the child in her womb. One of the'Asabah of the killer said: 'Am I to pay blood money for one whom neither ate nor drank, or shouted or cried (at the moment of birth)? Such a one should be overlooked. The Messenger of Allah said: 'Rhyming verse like the verse of the Bedouin?' and he made them pay the Diyah",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ الْخُزَاعِيِّ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ ضَرَبَتِ امْرَأَةٌ ضَرَّتَهَا بِعَمُودِ الْفُسْطَاطِ وَهِيَ حُبْلَى فَقَتَلَتْهَا فَجَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم دِيَةَ الْمَقْتُولَةِ عَلَى عَصَبَةِ الْقَاتِلَةِ وَغُرَّةً لِمَا فِي بَطْنِهَا ‏.‏ فَقَالَ رَجُلٌ مِنْ عَصَبَةِ الْقَاتِلَةِ أَنَغْرَمُ دِيَةَ مَنْ لاَ أَكَلْ وَلاَ شَرِبَ وَلاَ اسْتَهَلّ فَمِثْلُ ذَلِكَ يُطَلّ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَسَجْعٌ كَسَجْعِ الأَعْرَابِ ‏\"‏ ‏.‏ فَجَعَلَ عَلَيْهِمُ الدِّيَةَ ‏.‏",
    "malay_translation": "Seorang wanita memukul madunya yang sedang hamil dengan tiang khemah sehingga membunuhnya. Rasulullah SAW memutuskan bahawa 'Asabah (kaum lelaki dari pihak keluarga ayah) pembunuh hendaklah membayar Diyat dan memberikan seorang hamba sebagai Diyat untuk anak dalam kandungannya. Seorang lelaki daripada 'Asabah pembunuh berkata: 'Adakah aku perlu membayar wang tebusan untuk seseorang yang tidak makan, tidak minum, tidak menjerit atau menangis (ketika kelahiran)? Orang seperti itu patut diabaikan.' Rasulullah SAW bersabda: 'Sajak seperti sajak orang Badwi?' dan Baginda memerintahkan mereka membayar Diyat."
  },
  {
    "id": 19569,
    "hadith_number": 4833,
    "tajuk_hadith": "Hukuman Diyat untuk Pembunuhan Tidak Sengaja dan Janin dalam Kandungan",
    "perawi_melayu": "Diriwayatkan daripada Al-Mughirah bin shu'bah bahawa:",
    "english_text": "there were two co-wives, one of whom struck the other with a tent people and killed her. The Messenger of Allah ruled that the Diyah was to be paid by the 'Asabah of the killer, and that a slave should be given (as diyah) for the child in her womb. The Bedouin Said: \"Are you penalizing me for one who neither ate nor drank, or shouted or cried (at the moment of birth)? Such a one should be overlooked/\" He said: \"Rhyming verse like the verse of the Jahiliyyah,\" and he ruled that a slave should e given (as Diyah) for the child in her womb.",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، أَنَّ ضَرَّتَيْنِ، ضَرَبَتْ إِحْدَاهُمَا الأُخْرَى بِعَمُودِ فُسْطَاطٍ فَقَتَلَتْهَا فَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم بِالدِّيَةِ عَلَى عَصَبَةِ الْقَاتِلَةِ وَقَضَى لِمَا فِي بَطْنِهَا بِغُرَّةٍ ‏.‏ فَقَالَ الأَعْرَابِيُّ تُغَرِّمُنِي مَنْ لاَ أَكَلْ وَلاَ شَرِبَ وَلاَ صَاحَ فَاسْتَهَلّ فَمِثْلُ ذَلِكَ يُطَلّ فَقَالَ ‏\n\"‏ سَجْعٌ كَسَجْعِ الْجَاهِلِيَّةِ ‏\"‏ ‏.‏ وَقَضَى لِمَا فِي بَطْنِهَا بِغُرَّةٍ ‏.‏",
    "malay_translation": "Terdapat dua orang isteri bersama, salah seorang daripada mereka memukul yang lain dengan tiang khemah dan membunuhnya. Rasulullah SAW memutuskan bahawa Diyat hendaklah dibayar oleh 'Asabah pembunuh, dan seorang hamba hendaklah diberikan (sebagai diyah) untuk anak dalam kandungannya. Orang Badwi itu berkata: \"Adakah kamu menghukum saya untuk seseorang yang tidak makan dan tidak minum, atau menjerit atau menangis (pada saat kelahiran)? Orang seperti itu harus diabaikan.\" Baginda bersabda: \"Sajak seperti sajak Jahiliyyah,\" dan baginda memutuskan bahawa seorang hamba harus diberikan (sebagai Diyat) untuk anak dalam kandungannya."
  },
  {
    "id": 19570,
    "hadith_number": 4834,
    "tajuk_hadith": "Hukuman bagi Pembunuhan Seorang Wanita Hamil oleh Isteri Lain",
    "perawi_melayu": "Diriwayatkan daripada Al-Mughirah bin Shu'bah berkata:",
    "english_text": "\"A woman of Banu Lihyan struck her co-wife with a tent pole and killed her, and the slain woman was pregnant. The Messenger of Allah ruled that the Diyah was to be paid by the'Asbah of the killer, and that a slave should be given (as Diyah) for the child in her womb\".",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ سَعِيدِ بْنِ مَسْرُوقٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي زَائِدَةَ، عَنْ إِسْرَائِيلَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ ضَرَبَتِ امْرَأَةٌ مِنْ بَنِي لِحْيَانَ ضَرَّتَهَا بِعَمُودِ الْفُسْطَاطِ فَقَتَلَتْهَا وَكَانَ بِالْمَقْتُولَةِ حَمْلٌ فَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى عَصَبَةِ الْقَاتِلَةِ بِالدِّيَةِ وَلِمَا فِي بَطْنِهَا بِغُرَّةٍ ‏.‏",
    "malay_translation": "Seorang wanita dari Bani Lihyan memukul madunya dengan tiang khemah sehingga membunuhnya, dan wanita yang terbunuh itu sedang hamil. Rasulullah SAW memutuskan bahawa Diyat hendaklah dibayar oleh 'Asbah (kaum lelaki sebelah bapa) pembunuh, dan seorang hamba hendaklah diberikan (sebagai Diyat) untuk anak di dalam kandungannya."
  },
  {
    "id": 19571,
    "hadith_number": 4835,
    "tajuk_hadith": "Hukuman Diyat untuk Janin Gugur Akibat Kekerasan",
    "perawi_melayu": "Diriwayatkan daripada Al-Mughirah bin Syu'bah:",
    "english_text": "two woman were married to a man of Hudhail, and one of them threw tent pole at the other and caused her to miscarry. They referred the dispute to the Prophet and they said: \"how can we pay the Diyah for one who neither shouted nor cried (at the moment of birth), or ate or drank? Such a one should be overlooked.\" He said: \"Rhyming verse like the verse of the Bedouins?\" And the ruled that the 'Aqilah of the women should give a slave 9asdiyah).",
    "arabic_text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ شُعْبَةَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، أَنَّ امْرَأَتَيْنِ، كَانَتَا تَحْتَ رَجُلٍ مِنْ هُذَيْلٍ فَرَمَتْ إِحْدَاهُمَا الأُخْرَى بِعَمُودِ فُسْطَاطٍ فَأَسْقَطَتْ فَاخْتَصَمَا إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالُوا كَيْفَ نَدِي مَنْ لاَ صَاحَ وَلاَ اسْتَهَلّ وَلاَ شَرِبَ وَلاَ أَكَلْ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ أَسَجْعٌ كَسَجْعِ الأَعْرَابِ ‏\"‏ ‏.‏ فَقَضَى بِالْغُرَّةِ عَلَى عَاقِلَةِ الْمَرْأَةِ ‏.‏",
    "malay_translation": "Dua orang wanita berkahwin dengan seorang lelaki dari Hudhail, dan salah seorang daripada mereka melemparkan tiang khemah kepada yang lain sehingga menyebabkan keguguran. Mereka merujuk pertikaian itu kepada Nabi Muhammad ﷺ dan mereka berkata: \"Bagaimana kami boleh membayar Diyat untuk seseorang yang tidak menjerit atau menangis (ketika dilahirkan), atau makan atau minum? Orang seperti itu harus diabaikan.\" Baginda bersabda: \"Adakah ini sajak seperti sajak orang Badwi?\" Lalu baginda memutuskan bahawa 'Aqilah wanita itu harus memberikan seorang hamba (sebagai diyat)."
  },
  {
    "id": 19572,
    "hadith_number": 4836,
    "tajuk_hadith": "Hukuman Bagi Menyebabkan Keguguran: Hamba Sebagai Ganti Rugi",
    "perawi_melayu": "Diriwayatkan daripada Al-Mughirah bin Shu'bah bahawa:",
    "english_text": "a man of Hudhail had two wives, and one of them threw a  tent pole at the o0ther and caused her to miscarry. It was said: \"What do you think of one who neither ate nor drank, or shouted nor cried (at the moment of birth)?\" he said: (Rhyming verse like the verse of the Bedouins. \"And the Messenger of Allah ruled that a make or female slave shouted be given (as dihahj) for him (the unborn child), to be paid but the'Aqila h of the woman.",
    "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، قَالَ سَمِعْتُ إِبْرَاهِيمَ، عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، أَنَّ رَجُلاً، مِنْ هُذَيْلٍ كَانَ لَهُ امْرَأَتَانِ فَرَمَتْ إِحْدَاهُمَا الأُخْرَى بِعَمُودِ الْفُسْطَاطِ فَأَسْقَطَتْ فَقِيلَ أَرَأَيْتَ مَنْ لاَ أَكَلْ وَلاَ شَرِبَ وَلاَ صَاحَ فَاسْتَهَلّ ‏.‏ فَقَالَ ‏\n\"‏ أَسَجْعٌ كَسَجْعِ الأَعْرَابِ ‏\"‏ ‏.‏ فَقَضَى فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم بِغُرَّةٍ عَبْدٍ أَوْ أَمَةٍ وَجُعِلَتْ عَلَى عَاقِلَةِ الْمَرْأَةِ ‏.‏ أَرْسَلَهُ الأَعْمَشُ ‏.‏",
    "malay_translation": "Seorang lelaki dari Hudhail mempunyai dua orang isteri, dan salah seorang daripada mereka melemparkan tiang khemah kepada yang lain dan menyebabkan keguguran. Dikatakan: \"Apa pendapatmu tentang seseorang yang tidak makan, tidak minum, tidak berteriak atau menangis (pada saat kelahiran)?\" Dia berkata: (Bait berima seperti bait orang Badwi). \"Dan Rasulullah SAW memutuskan bahawa seorang hamba lelaki atau perempuan hendaklah diberikan (sebagai *diyah*) untuknya (anak yang belum lahir), untuk dibayar oleh 'Aqilah wanita itu."
  },
  {
    "id": 19573,
    "hadith_number": 4837,
    "tajuk_hadith": "Hukuman bagi Pembunuhan Wanita Hamil dan Kandungannya",
    "perawi_melayu": "Diriwayatkan daripada al-A'mash daripada Ibrahim yang berkata:",
    "english_text": "\"I woman struck her co-wife, who was pregnant, with a rock and killed her Messenger of Allah ruled that a slave should be given (as Diyah) for the child in her woman, and that her Diyah should be paid by her 'Asabah. They said:' should we be penalized for one who neither after nor drank, or shouted or cried (at the moment of birth)? Such a one should be overlooked.' He said: 'Rhyming vase like the vase of the Bedouisn? It is what I say to (sahih)",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا مُصْعَبٌ، قَالَ حَدَّثَنَا دَاوُدُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، قَالَ ضَرَبَتِ امْرَأَةٌ ضَرَّتَهَا بِحَجَرٍ وَهِيَ حُبْلَى فَقَتَلَتْهَا فَجَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَا فِي بَطْنِهَا غُرَّةً وَجَعَلَ عَقْلَهَا عَلَى عَصَبَتِهَا فَقَالُوا نُغَرَّمُ مَنْ لاَ شَرِبَ وَلاَ أَكَلْ وَلاَ اسْتَهَلّ فَمِثْلُ ذَلِكَ يُطَلّ فَقَالَ ‏\n\"‏ أَسَجْعٌ كَسَجْعِ الأَعْرَابِ هُوَ مَا أَقُولُ لَكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang wanita memukul madunya yang sedang hamil dengan batu dan membunuhnya. Rasulullah SAW memutuskan bahawa seorang hamba hendaklah diberikan (sebagai Diyat) untuk anak dalam kandungan wanita itu, dan Diyat wanita itu hendaklah dibayar oleh 'Asabahnya. Mereka berkata: 'Adakah kami patut dihukum kerana seseorang yang tidak minum dan tidak makan, atau menjerit atau menangis (pada saat kelahiran)? Orang seperti itu patut diabaikan.' Baginda bersabda: 'Adakah ini sajak seperti sajak orang Arab Badwi? Inilah yang Aku katakan kepada kamu (sahih).'"
  },
  {
    "id": 19574,
    "hadith_number": 4838,
    "tajuk_hadith": "Hukuman Diyat untuk Janin yang Gugur Akibat Perselisihan",
    "perawi_melayu": "Diriwayatkan daripada Ibn 'Abbas, bahawa ada dua orang wanita jiran yang berselisih. Salah seorang daripada mereka melemparkan batu kepada yang lain sehingga menyebabkan keguguran janin lelaki yang sudah tumbuh rambutnya dalam keadaan mati. Wanita itu juga meninggal dunia. Nabi memutuskan bahawa 'Aqilah (kaum lelaki sebelah bapa) perlu membayar Diyat. Bapa saudara wanita yang membunuh berkata:",
    "english_text": "'O Messenger of Allah, she miscarried a boy whose hair had grown.' The father of the killer said: \"He is lying. By Allah he never cried or shouted (at the moment of birth), nor drank nor ate. Such a one should be overlooked.' The Prophet said: 'rhyming verse like the verse of the Jahiliyyah and of its soothsayers? A slave must be given (as Diyah) for the boy, ''' Ibn 'Abbes said; \"One of then was Mulaikah and the other was Umm Ghatif.\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ، قَالَ حَدَّثَنَا عَمْرٌو، عَنْ أَسْبَاطٍ، عَنْ سِمَاكٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَتِ امْرَأَتَانِ جَارَتَانِ كَانَ بَيْنَهُمَا صَخَبٌ فَرَمَتْ إِحْدَاهُمَا الأُخْرَى بِحَجَرٍ فَأَسْقَطَتْ غُلاَمًا قَدْ نَبَتَ شَعْرُهُ مَيْتًا وَمَاتَتِ الْمَرْأَةُ فَقَضَى عَلَى الْعَاقِلَةِ الدِّيَةَ ‏.‏ فَقَالَ عَمُّهَا إِنَّهَا قَدْ أَسْقَطَتْ يَا رَسُولَ اللَّهِ غُلاَمًا قَدْ نَبَتَ شَعْرُهُ ‏.‏ فَقَالَ أَبُو الْقَاتِلَةِ إِنَّهُ كَاذِبٌ إِنَّهُ وَاللَّهِ مَا اسْتَهَلّ وَلاَ شَرِبَ وَلاَ أَكَلْ فَمِثْلُهُ يُطَلّ ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ أَسَجْعٌ كَسَجْعِ الْجَاهِلِيَّةِ وَكِهَانَتِهَا إِنَّ فِي الصَّبِيِّ غُرَّةً ‏\"‏ ‏.‏ قَالَ ابْنُ عَبَّاسٍ كَانَتْ إِحْدَاهُمَا مُلَيْكَةَ وَالأُخْرَى أُمَّ غَطِيفٍ ‏.‏",
    "malay_translation": "\"'Wahai Rasulullah, dia telah keguguran seorang bayi lelaki yang rambutnya telah tumbuh.' Bapa si pembunuh berkata: 'Dia berbohong. Demi Allah, dia tidak pernah menangis atau menjerit (ketika dilahirkan), tidak minum atau makan. Orang seperti itu patut diabaikan.' Nabi bersabda: 'Adakah sajak seperti sajak Jahiliyyah dan para peramalnya? Seorang hamba mesti diberikan (sebagai Diyat) untuk bayi itu.' Ibn 'Abbas berkata; 'Salah seorang daripada mereka adalah Mulaikah dan yang lain adalah Umm Ghatif.'"
  },
  {
    "id": 19575,
    "hadith_number": 4839,
    "tajuk_hadith": "Hukum Pembayaran Diyat dan Larangan Memilih Mawla Tanpa Izin",
    "perawi_melayu": "Jabir berkata:",
    "english_text": "\"The Messenger of Allah ruled that every clan should take part in paying the blood money, and it is not permissible for a freed slave to take a Muslim (other than the one who freed him) as his Mawla (Patron) without the permission (of his former master who set him free)\"",
    "arabic_text": "أَخْبَرَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ، قَالَ حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرًا، يَقُولُ كَتَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى كُلِّ بَطْنٍ عُقُولَةً وَلاَ يَحِلُّ لِمَوْلًى أَنْ يَتَوَلَّى مُسْلِمًا بِغَيْرِ إِذْنِهِ ‏.‏",
    "malay_translation": "Rasulullah SAW menetapkan bahawa setiap suku kaum harus mengambil bahagian dalam membayar diat (wang tebusan), dan tidak dibenarkan bagi seorang hamba yang dibebaskan untuk mengambil seorang Muslim (selain daripada orang yang membebaskannya) sebagai Mawlanya (Pelindung) tanpa izin (daripada bekas tuannya yang membebaskannya)."
  },
  {
    "id": 19576,
    "hadith_number": 4840,
    "tajuk_hadith": "Tanggungjawab bagi Mereka yang Mengamalkan Perubatan Tanpa Kelayakan",
    "perawi_melayu": "Diriwayatkan daripada 'Amr bin Shu'aib, daripada bapanya, bahawa datuknya berkata:",
    "english_text": "\"the Messenger of Allah said: 'Whoever practices medicine when he is not known for that, he is liable.(Daif)",
    "arabic_text": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ، وَمُحَمَّدُ بْنُ مُصَفًّى، قَالاَ حَدَّثَنَا الْوَلِيدُ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ تَطَبَّبَ وَلَمْ يُعْلَمْ مِنْهُ طِبٌّ قَبْلَ ذَلِكَ فَهُوَ ضَامِنٌ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: 'Sesiapa yang mengamalkan perubatan sedangkan dia tidak dikenali dengan ilmu tersebut, maka dia bertanggungjawab (Daif).'"
  },
  {
    "id": 19577,
    "hadith_number": 4841,
    "tajuk_hadith": "Laporan Serupa daripada 'Amr bin Shu'aib",
    "perawi_melayu": "Perawi yang disebut dalam hadis:",
    "english_text": "A similar report was narrated from 'Amr bin shu'aib, from his father, from his grandfather. (Daif)",
    "arabic_text": "أَخْبَرَنِي مَحْمُودُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا الْوَلِيدُ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، مِثْلَهُ سَوَاءً ‏.‏",
    "malay_translation": "Laporan yang serupa diriwayatkan daripada 'Amr bin Shu'aib, daripada bapanya, daripada datuknya. (Daif)"
  },
  {
    "id": 19578,
    "hadith_number": 4842,
    "tajuk_hadith": "Tanggungjawab Dosa Individu",
    "perawi_melayu": "Diriwayatkan daripada Abu Rimthah, beliau berkata; \"Aku datang kepada Nabi bersama ayahku dan baginda bersabda:",
    "english_text": "'Who is this with you?' He said:' my son, I bear witness (that he is my son). He said: 'You cannot be affected by his sin or he by yours.",
    "arabic_text": "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ أَبْجَرَ، عَنْ إِيَادِ بْنِ لَقِيطٍ، عَنْ أَبِي رِمْثَةَ، قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم مَعَ أَبِي فَقَالَ ‏\"‏ مَنْ هَذَا مَعَكَ ‏\"‏ ‏.‏ قَالَ ابْنِي أَشْهَدُ بِهِ ‏.‏ قَالَ ‏\"‏ أَمَا إِنَّكَ لاَ تَجْنِي عَلَيْهِ وَلاَ يَجْنِي عَلَيْكَ ‏\"‏ ‏.‏",
    "malay_translation": "\"'Siapa ini bersamamu?' Dia (ayahku) berkata: 'Anakku, aku bersaksi (bahawa dia anakku)'. Baginda bersabda: 'Sesungguhnya kamu tidak akan menanggung dosanya dan dia juga tidak akan menanggung dosamu.'"
  },
  {
    "id": 19579,
    "hadith_number": 4843,
    "tajuk_hadith": "Tidak Ada Jiwa yang Terkesan dengan Dosa Orang Lain",
    "perawi_melayu": "Diriwayatkan daripada Tha'labah bin Zahdam berkata:",
    "english_text": "\"some people from Banu Tha'labah came to the Prophet when he was delivering a speech and a man said; \"O Messenger of Allah, these are Banu Tha'labah bin Yarbu' who killed so and so' - one of the Companions of the Prophet The Prophet said: \"No soul is affected by the sin of another.",
    "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَشْعَثَ، عَنِ الأَسْوَدِ بْنِ هِلاَلٍ، عَنْ ثَعْلَبَةَ بْنِ زَهْدَمٍ الْيَرْبُوعِيِّ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَخْطُبُ فِي أُنَاسٍ مِنَ الأَنْصَارِ فَقَالُوا يَا رَسُولَ اللَّهِ هَؤُلاَءِ بَنُو ثَعْلَبَةَ بْنِ يَرْبُوعٍ قَتَلُوا فُلاَنًا فِي الْجَاهِلِيَّةِ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم وَهَتَفَ بِصَوْتِهِ ‏\n\"‏ أَلاَ لاَ تَجْنِي نَفْسٌ عَلَى الأُخْرَى ‏\"‏ ‏.‏",
    "malay_translation": "\"Beberapa orang daripada Banu Tha'labah datang kepada Nabi ketika baginda sedang menyampaikan ucapan, dan seorang lelaki berkata; \"Wahai Rasulullah, ini adalah Banu Tha'labah bin Yarbu' yang membunuh si fulan' - salah seorang Sahabat Nabi. Nabi bersabda: \"Tidak ada jiwa yang terkesan dengan dosa orang lain.\""
  },
  {
    "id": 19580,
    "hadith_number": 4844,
    "tajuk_hadith": "Seseorang Tidak Menanggung Dosa Orang Lain",
    "perawi_melayu": "Diriwayatkan daripada Tha'labah bin Zahdam berkata:",
    "english_text": "\"Some people from Banu Tha'labah came to the Prophet (ﷺ) when he was delivering a speech and a man said: 'O Messenger of Allah, these are\nBanu Tha'labah bin Yarbu' who killed so and so' - one of the Companions of the Prophet (ﷺ). The Prophet (ﷺ) said: 'No soul is affected by the sin of another.'\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، عَنْ سُفْيَانَ، عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ، عَنِ الأَسْوَدِ بْنِ هِلاَلٍ، عَنْ ثَعْلَبَةَ بْنِ زَهْدَمٍ، قَالَ انْتَهَى قَوْمٌ مِنْ بَنِي ثَعْلَبَةَ إِلَى النَّبِيِّ صلى الله عليه وسلم وَهُوَ يَخْطُبُ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ هَؤُلاَءِ بَنُو ثَعْلَبَةَ بْنِ يَرْبُوعٍ قَتَلُوا فُلاَنًا رَجُلاً مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ تَجْنِي نَفْسٌ عَلَى أُخْرَى ‏\"‏ ‏.‏",
    "malay_translation": "Beberapa orang daripada Bani Tha'labah datang kepada Nabi (ﷺ) ketika baginda sedang menyampaikan ucapan. Seorang lelaki berkata: 'Wahai Rasulullah, mereka ini adalah Bani Tha'labah bin Yarbu' yang telah membunuh si fulan' - salah seorang Sahabat Nabi (ﷺ). Nabi (ﷺ) bersabda: 'Tidak ada jiwa yang terkesan oleh dosa orang lain.'"
  },
  {
    "id": 19581,
    "hadith_number": 4845,
    "tajuk_hadith": "Seseorang Tidak Menanggung Dosa Orang Lain",
    "perawi_melayu": "Diriwayatkan daripada Ash'ath bin Abi Ash-Sha'tha, dia berkata:",
    "english_text": "\"I heard Al-Aswad bin Hilal narrate from a man of Banu Tha'labah bin Yarbu' that some people from Banu Tah'labah came to the Prophet and a man said: \"O Messenger of Allah, these are Banu Tha'labah bin Yarbu'who killed so and so' - a man from among the companions of the Prophet. The Prophet said: 'No soul is affected by the sin of another",
    "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ أَنْبَأَنَا شُعْبَةُ، عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ، قَالَ سَمِعْتُ الأَسْوَدَ بْنَ هِلاَلٍ، يُحَدِّثُ عَنْ رَجُلٍ، مِنْ بَنِي ثَعْلَبَةَ بْنِ يَرْبُوعٍ أَنَّ نَاسًا، مِنْ بَنِي ثَعْلَبَةَ أَتَوُا النَّبِيَّ صلى الله عليه وسلم فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ هَؤُلاَءِ بَنُو ثَعْلَبَةَ بْنِ يَرْبُوعٍ قَتَلُوا فُلاَنًا رَجُلاً مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ تَجْنِي نَفْسٌ عَلَى أُخْرَى ‏\"‏ ‏.‏",
    "malay_translation": "Saya mendengar Al-Aswad bin Hilal meriwayatkan daripada seorang lelaki dari Banu Tha'labah bin Yarbu' bahawa beberapa orang dari Banu Tha'labah datang kepada Nabi ﷺ dan seorang lelaki berkata: \"Wahai Rasulullah, mereka ini adalah Banu Tha'labah bin Yarbu' yang telah membunuh si fulan\" - seorang lelaki dari kalangan sahabat Nabi ﷺ. Nabi ﷺ bersabda: 'Tidak ada jiwa yang terkesan oleh dosa orang lain.'"
  },
  {
    "id": 19582,
    "hadith_number": 4846,
    "tajuk_hadith": "Seseorang Tidak Bertanggungjawab Atas Dosa Orang Lain",
    "perawi_melayu": "Diriwayatkan daripada Al-Aswad bin Hilal - yang bertemu Nabi SAW - daripada seorang lelaki daripada Banu Tha'labah bin Yarbu':",
    "english_text": "some people from Banu Tha'labah killed a man from among the companions of the Messenger of Allah. A man from among the companions of the Messenger of the Allah said: \"O Messenger of Allah, these are Banu Tha'labah who killed so and so.\" The Messenger said: \"No soul is affected by the sin of another.\" Shu'bah (one of the narrators) said: \"That means: No soul is responsible for the sin of anothe4r, and Allah knows best.\"",
    "arabic_text": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا أَبُو عَتَّابٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الأَشْعَثِ بْنِ سُلَيْمٍ، عَنِ الأَسْوَدِ بْنِ هِلاَلٍ، - وَكَانَ قَدْ أَدْرَكَ النَّبِيَّ صلى الله عليه وسلم - عَنْ رَجُلٍ مِنْ بَنِي ثَعْلَبَةَ بْنِ يَرْبُوعٍ أَنَّ نَاسًا مِنْ بَنِي ثَعْلَبَةَ أَصَابُوا رَجُلاً مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فَقَالَ رَجُلٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم يَا رَسُولَ اللَّهِ هَؤُلاَءِ بَنُو ثَعْلَبَةَ قَتَلَتْ فُلاَنًا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَجْنِي نَفْسٌ عَلَى أُخْرَى ‏\"‏ ‏.‏ قَالَ شُعْبَةُ أَىْ لاَ يُؤْخَذُ أَحَدٌ بِأَحَدٍ وَاللَّهُ تَعَالَى أَعْلَمُ ‏.‏",
    "malay_translation": "Beberapa orang daripada Banu Tha'labah telah membunuh seorang lelaki daripada kalangan sahabat Rasulullah SAW. Seorang lelaki daripada kalangan sahabat Rasulullah SAW berkata: \"Wahai Rasulullah, mereka ini adalah Banu Tha'labah yang telah membunuh si fulan.\" Rasulullah SAW bersabda: \"Tidak ada jiwa yang terkesan dengan dosa jiwa yang lain.\" Shu'bah (salah seorang perawi) berkata: \"Maksudnya: Tidak ada jiwa yang bertanggungjawab atas dosa orang lain, dan Allah Maha Mengetahui.\""
  },
  {
    "id": 19583,
    "hadith_number": 4847,
    "tajuk_hadith": "Tiada Tanggungan Dosa Orang Lain",
    "perawi_melayu": "Diriwayatkan daripada Al-Ash'ath bin Sulaim, daripada ayahnya, bahawa seorang lelaki daripada kalangan Banu Tha'labah bin Yarbu' berkata:",
    "english_text": "\"I came to the Prophet when he was speaking, and a man said: 'O Messenger of Allah, these are Banu Tha'labah bin Yarbu' who killed so and so.' The Messenger of Allah said: 'No,' meaning no soul is affected by the sin of another. \"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الأَشْعَثِ بْنِ سُلَيْمٍ، عَنْ أَبِيهِ، عَنْ رَجُلٍ، مِنْ بَنِي ثَعْلَبَةَ بْنِ يَرْبُوعٍ قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم وَهُوَ يَتَكَلَّمُ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ هَؤُلاَءِ بَنُو ثَعْلَبَةَ بْنِ يَرْبُوعٍ الَّذِينَ أَصَابُوا فُلاَنًا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ - يَعْنِي - لاَ تَجْنِي نَفْسٌ عَلَى نَفْسٍ ‏\"‏ ‏.‏",
    "malay_translation": "\"Aku datang kepada Nabi SAW ketika baginda sedang berbicara, dan seorang lelaki berkata: 'Wahai Rasulullah, ini adalah Banu Tha'labah bin Yarbu' yang telah membunuh si fulan.' Rasulullah SAW bersabda: 'Tidak,' iaitu tidak ada jiwa yang menanggung dosa jiwa yang lain.\""
  },
  {
    "id": 19584,
    "hadith_number": 4848,
    "tajuk_hadith": "Setiap Individu Bertanggungjawab atas Dosanya Sendiri",
    "perawi_melayu": "Diriwayatkan daripada Ash'ath, daripada ayahnya bahawa seorang lelaki daripada kalangan Banu Tha'labah bin Yarbu' berkata:",
    "english_text": "\"We came to the Messenger of Allah when he was speaking to the people, and some people stood up and said: 'O Messenger of Allah, these are Banu Tha'labah who killed so and so.' The Messenger of Allah said: 'No soul is affected by the sin of another.'\"",
    "arabic_text": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، فِي حَدِيثِهِ عَنْ أَبِي الأَحْوَصِ، عَنْ أَشْعَثَ، عَنْ أَبِيهِ، عَنْ رَجُلٍ، مِنْ بَنِي يَرْبُوعٍ قَالَ أَتَيْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم وَهُوَ يُكَلِّمُ النَّاسَ فَقَامَ إِلَيْهِ نَاسٌ فَقَالُوا يَا رَسُولَ اللَّهِ هَؤُلاَءِ بَنُو فُلاَنٍ الَّذِينَ قَتَلُوا فُلاَنًا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَجْنِي نَفْسٌ عَلَى أُخْرَى ‏\"‏ ‏.‏",
    "malay_translation": "Kami datang kepada Rasulullah SAW ketika baginda sedang berbicara kepada orang ramai. Beberapa orang berdiri dan berkata: 'Wahai Rasulullah, mereka ini adalah Banu Tha'labah yang telah membunuh si fulan.' Rasulullah SAW bersabda: 'Tidak ada jiwa yang terkesan oleh dosa orang lain.'"
  },
  {
    "id": 19585,
    "hadith_number": 4849,
    "tajuk_hadith": "Tidak Menanggung Dosa Orang Lain: Pembunuhan di Zaman Jahiliyah",
    "perawi_melayu": "Diriwayatkan daripada Tariq dan Muharibi bahawa seorang lelaki berkata:",
    "english_text": "\"O Messenger of Allah, these are Banu Tha'labah who killed so and so during the Jahiliyyah: avenger us! He raised his arms until the whiteness of his armpits could be seen and said: \"No mother's sin can affect her child,\" twice. (Shaih)",
    "arabic_text": "أَخْبَرَنَا يُوسُفُ بْنُ عِيسَى، قَالَ أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى، قَالَ أَنْبَأَنَا يَزِيدُ، - وَهُوَ ابْنُ زِيَادِ بْنِ أَبِي الْجَعْدِ - عَنْ جَامِعِ بْنِ شَدَّادٍ، عَنْ طَارِقٍ الْمُحَارِبِيِّ، أَنَّ رَجُلاً، قَالَ يَا رَسُولَ اللَّهِ هَؤُلاَءِ بَنُو ثَعْلَبَةَ الَّذِينَ قَتَلُوا فُلاَنًا فِي الْجَاهِلِيَّةِ ‏.‏ فَخُذْ لَنَا بِثَأْرِنَا ‏.‏ فَرَفَعَ يَدَيْهِ حَتَّى رَأَيْتُ بَيَاضَ إِبْطَيْهِ وَهُوَ يَقُولُ ‏\n\"‏ لاَ تَجْنِي أُمٌّ عَلَى وَلَدٍ ‏\"‏ ‏.‏ مَرَّتَيْنِ ‏.‏",
    "malay_translation": "\"Wahai Rasulullah, mereka ini adalah Banu Tha'labah yang telah membunuh si fulan pada zaman Jahiliyah: tuntutlah bela untuk kami!\" Baginda mengangkat kedua tangannya sehingga kelihatan putih ketiaknya dan bersabda: \"Dosa seorang ibu tidak akan memudaratkan anaknya,\" sebanyak dua kali. (Sahih)"
  },
  {
    "id": 19586,
    "hadith_number": 4850,
    "tajuk_hadith": "Hukuman Diyat untuk Mata Buta, Tangan Lumpuh, dan Gigi Hitam yang Hilang",
    "perawi_melayu": "Diriwayatkan daripada 'Amr bin Shu'aib, daripada ayahnya, daripada datuknya, bahawa:",
    "english_text": "the Messenger of Allah ruled that one-third of the Diyah should be paid for a sightless eye that looks fine, if it is destroyed; one-third of the Diyah should be paid for a paralyzed hand if it is cut off; and one-third of the Diyah should be paid for a black tooth if it is knocked out.",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ، قَالَ أَنْبَأَنَا ابْنُ عَائِذٍ، قَالَ حَدَّثَنَا الْهَيْثَمُ بْنُ حُمَيْدٍ، قَالَ أَخْبَرَنِي الْعَلاَءُ، - وَهُوَ ابْنُ الْحَارِثِ - عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى فِي الْعَيْنِ الْعَوْرَاءِ السَّادَّةِ لِمَكَانِهَا إِذَا طُمِسَتْ بِثُلُثِ دِيَتِهَا وَفِي الْيَدِ الشَّلاَّءِ إِذَا قُطِعَتْ بِثُلُثِ دِيَتِهَا وَفِي السِّنِّ السَّوْدَاءِ إِذَا نُزِعَتْ بِثُلُثِ دِيَتِهَا ‏.‏",
    "malay_translation": "Rasulullah SAW memutuskan bahawa satu pertiga daripada Diyat perlu dibayar untuk mata yang buta tetapi kelihatan baik, jika ia dirosakkan; satu pertiga daripada Diyat perlu dibayar untuk tangan yang lumpuh jika ia dipotong; dan satu pertiga daripada Diyat perlu dibayar untuk gigi hitam jika ia dicabut."
  },
  {
    "id": 19587,
    "hadith_number": 4851,
    "tajuk_hadith": "Diyat Bagi Gigi Ialah Lima Ekor Unta",
    "perawi_melayu": "Diriwayatkan daripada 'Amr bin Shu'aib, daripada ayahnya, daripada datuknya, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"For teeth (the Diyah is) five camels.",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مُعَاوِيَةَ، قَالَ حَدَّثَنَا عَبَّادٌ، عَنْ حُسَيْنٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ فِي الأَسْنَانِ خَمْسٌ مِنَ الإِبِلِ ‏\"‏ ‏.‏",
    "malay_translation": "\"Untuk gigi (diyatnya) adalah lima ekor unta.\""
  },
  {
    "id": 19588,
    "hadith_number": 4852,
    "tajuk_hadith": "Diyat (Ganti Rugi) Bagi Gigi",
    "perawi_melayu": "Diriwayatkan daripada 'Amr bin Shu'aib, daripada ayahnya, bahawa datuknya berkata:",
    "english_text": "The Messenger of Allah said: \"For teeth (the Diyah is ) the same, five camels for each.'",
    "arabic_text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا حَفْصُ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ مَطَرٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الأَسْنَانُ سَوَاءٌ خَمْسًا خَمْسًا ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Bagi gigi (Diyatnya) adalah sama, lima ekor unta bagi setiap satu.\""
  },
  {
    "id": 19589,
    "hadith_number": 4853,
    "tajuk_hadith": "Diyat (Ganti Rugi) untuk Jari-Jari",
    "perawi_melayu": "Diriwayatkan daripada Abu Musa bahawa Nabi bersabda:",
    "english_text": "\"For fingers (the Diyah is ) ten (camels) each.",
    "arabic_text": "أَخْبَرَنَا أَبُو الأَشْعَثِ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ مَسْرُوقِ بْنِ أَوْسٍ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ فِي الأَصَابِعِ عَشْرٌ عَشْرٌ ‏\"‏ ‏.‏",
    "malay_translation": "\"Bagi jari-jari, Diyat (ganti rugi) adalah sepuluh (ekor unta) setiap satu.\""
  },
  {
    "id": 19590,
    "hadith_number": 4854,
    "tajuk_hadith": "Hukum Diyat bagi Jari-Jari yang Sama",
    "perawi_melayu": "Diriwayatkan daripada Abu Musa Al-Asy'ari bahawa Nabi Allah bersabda:",
    "english_text": "\"Fingers are the same, (the Diyah is) ten (camel).",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ غَالِبٍ التَّمَّارِ، عَنْ مَسْرُوقِ بْنِ أَوْسٍ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الأَصَابِعُ سَوَاءٌ عَشْرًا ‏\"‏ ‏.‏",
    "malay_translation": "\"Jari-jari adalah sama (diyatnya adalah) sepuluh (ekor unta).\""
  },
  {
    "id": 19591,
    "hadith_number": 4855,
    "tajuk_hadith": "Hukuman Diyat Bagi Jari yang Sama: Sepuluh Ekor Unta Setiap Satu",
    "perawi_melayu": "Diriwayatkan daripada Abu Musa, beliau berkata:",
    "english_text": "\"The Messenger of Allah ruled that the fingers are the same and (the Diyah is ) ten camels for each.",
    "arabic_text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا حَفْصٌ، - وَهُوَ ابْنُ عَبْدِ الرَّحْمَنِ الْبَلْخِيُّ - عَنْ سَعِيدٍ، عَنْ غَالِبٍ التَّمَّارِ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ مَسْرُوقِ بْنِ أَوْسٍ، عَنْ أَبِي مُوسَى، قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنَّ الأَصَابِعَ سَوَاءٌ عَشْرًا عَشْرًا مِنَ الإِبِلِ ‏.‏",
    "malay_translation": "Rasulullah SAW memutuskan bahawa jari-jari adalah sama (dari segi diyat), iaitu sepuluh ekor unta untuk setiap jari."
  },
  {
    "id": 19592,
    "hadith_number": 4856,
    "tajuk_hadith": "Diyat (Pampasan) untuk Jari",
    "perawi_melayu": "Diriwayatkan daripada Sa'eed bin al-Musayyab bahawa:",
    "english_text": "when the letter was found that was with the family of 'Amr bin Hazm, which they said the Messenger of Allah had written to them, they found in it, with regard to fingers, that the Diyahwas ten (Camels) for each.",
    "arabic_text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ لَمَّا وُجِدَ الْكِتَابُ الَّذِي عِنْدَ آلِ عَمْرِو بْنِ حَزْمٍ الَّذِي ذَكَرُوا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَتَبَ لَهُمْ وَجَدُوا فِيهِ ‏\n\"‏ وَفِيمَا هُنَالِكَ مِنَ الأَصَابِعِ عَشْرًا عَشْرًا ‏\"‏ ‏.‏",
    "malay_translation": "Ketika surat itu ditemui bersama keluarga 'Amr bin Hazm, yang mereka katakan Rasulullah SAW telah menulisnya kepada mereka, mereka mendapati di dalamnya, berkenaan dengan jari-jari, bahawa Diyat (pampasan) adalah sepuluh (ekor unta) untuk setiap jari."
  },
  {
    "id": 19593,
    "hadith_number": 4857,
    "tajuk_hadith": "Jari Kelingking dan Ibu Jari Adalah Sama",
    "perawi_melayu": "Diriwayatkan daripada Ibn 'Abbas bahawa Nabi bersabda:",
    "english_text": "\"this and this are the same,\": meaning the little finger and the thumb.",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنِي قَتَادَةُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، رضى الله عنهما عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ هَذِهِ وَهَذِهِ سَوَاءٌ ‏\"‏ ‏.‏ يَعْنِي الْخِنْصَرَ وَالإِبْهَامَ ‏.‏",
    "malay_translation": "\"Ini dan ini adalah sama,\" iaitu jari kelingking dan ibu jari."
  },
  {
    "id": 19594,
    "hadith_number": 4858,
    "tajuk_hadith": "Kesamaan Antara Jari Kelingking dan Ibu Jari",
    "perawi_melayu": "Diriwayatkan daripada Ibn 'Abbas:",
    "english_text": "\"This and this are the same: The little finger and the thumb (sahih)",
    "arabic_text": "أَخْبَرَنَا نَصْرُ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، فَهَذِهِ وَهَذِهِ سَوَاءٌ الإِبْهَامُ وَالْخِنْصَرُ ‏.‏",
    "malay_translation": "\"Ini dan ini adalah sama: Jari kelingking dan ibu jari (Sahih).\""
  },
  {
    "id": 19595,
    "hadith_number": 4859,
    "tajuk_hadith": "Diyat (Pampasan) untuk Jari-Jari",
    "perawi_melayu": "Diriwayatkan daripada Ibn 'Abbas, beliau berkata:",
    "english_text": "\"The (Diyah for) fingers are ten each.\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ الأَصَابِعُ عَشْرٌ عَشْرٌ ‏.‏",
    "malay_translation": "\"Diyat (pampasan) bagi setiap jari adalah sepuluh.\""
  },
  {
    "id": 19596,
    "hadith_number": 4860,
    "tajuk_hadith": "Diyat (Pampasan) untuk Jari-Jari",
    "perawi_melayu": "Diriwayatkan daripada 'Abdullah bin 'Amr berkata:",
    "english_text": "\"When the Messenger of Allah conquered Makkah, he said in his Khutbah: \"(The Diyah) for fingers is ten each.\"",
    "arabic_text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، أَنَّ أَبَاهُ، حَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ لَمَّا افْتَتَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَكَّةَ قَالَ فِي خُطْبَتِهِ ‏\n\"‏ وَفِي الأَصَابِعِ عَشْرٌ عَشْرٌ ‏\"‏ ‏.‏",
    "malay_translation": "Ketika Rasulullah SAW menakluki Makkah, baginda bersabda dalam Khutbahnya: \"(Diyat) untuk jari-jari adalah sepuluh setiap satu.\""
  },
  {
    "id": 19597,
    "hadith_number": 4861,
    "tajuk_hadith": "Jari-jari adalah Sama",
    "perawi_melayu": "Diriwayatkan daripada 'Amr bin Shu'aib, daripada bapanya, daripada datuknya, bahawa Rasulullah SAW bersabda dalam khutbahnya, sambil menyandarkan belakangnya ke Ka'bah:",
    "english_text": "\"The fingers are the same.\"",
    "arabic_text": "أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ الْهَيْثَمِ، قَالَ حَدَّثَنَا حَجَّاجٌ، قَالَ حَدَّثَنَا هَمَّامٌ، قَالَ حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ، وَابْنُ، جُرَيْجٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ فِي خُطْبَتِهِ وَهُوَ مُسْنِدٌ ظَهْرَهُ إِلَى الْكَعْبَةِ ‏\n\"‏ الأَصَابِعُ سَوَاءٌ ‏\"‏ ‏.‏",
    "malay_translation": "\"Jari-jari adalah sama.\""
  },
  {
    "id": 19598,
    "hadith_number": 4862,
    "tajuk_hadith": "Diyat bagi Luka yang Mendedahkan Tulang",
    "perawi_melayu": "Diriwayatkan daripada 'Amr bin Shu'aib bahawa bapanya memberitahunya bahawa 'Abdullah bin 'Amr berkata:",
    "english_text": "\"When the Messenger of Allah (ﷺ) conquered Makkah , he said in his Khutbah: 'For any wound that exposes the bone, the diyah is five (camels) each.'\"",
    "arabic_text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، أَنَّ أَبَاهُ، حَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ لَمَّا افْتَتَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَكَّةَ قَالَ فِي خُطْبَتِهِ ‏\n\"‏ وَفِي الْمَوَاضِحِ خَمْسٌ خَمْسٌ ‏\"‏ ‏.‏",
    "malay_translation": "\"Ketika Rasulullah (ﷺ) menakluki Makkah, baginda bersabda dalam Khutbahnya: 'Bagi setiap luka yang mendedahkan tulang, diyahnya adalah lima (ekor unta) setiap satu.'\""
  },
  {
    "id": 19599,
    "hadith_number": 4863,
    "tajuk_hadith": "Surat Rasulullah SAW kepada Penduduk Yaman: Hukum Warisan, Sunnah dan Diyat",
    "perawi_melayu": "Diriwayatkan daripada Abu Bakr bin Muhammad bin 'Amr bin Hazm, daripada bapanya daripada datuknya, bahawa:",
    "english_text": "the Messenger of Allah wrote a letter to the people of Yemen, included in which were the rules of inheritance, the sunan and the (rules concerning) blood money. He sent it with 'Arm bin Hazm and it was read to the people of Yemen, Its contents were as follows: \"From Muhammad the Prophet to Shurahbil bin 'Abd Kulal, Nu'aim bin 'Abd Kulal, Al-Harith bin' Abd Kulal, Qail dhil-Ru'ain, Mu'afir and Hamdan. To precede\" - And in this letter it said that whoevewrkills a believer for no just reason is to be killed in return, unless the heirs of the victim agree to pardon him. For killing a person, the Diyah is one hundred camels. For the nose, if it is cut off completely, diyah must be paid, for the tongue, diyah must be paid; for the lips, Diyah must be paid; for the testicles, Diyah must be paid; for the ends, Diyah must be paid; for the backbone, Dynamist be paid; for the eyes, Diyah must be paid; for one leg, half the Diyah must be paid; for a blow to the head that reaches the brain, one-third of thediyah must be paid; for a stab wound that penetrates deeply into the body, one-third of the diyah must be paid; for a blow that breaks the bone, fifteen camels must be given; for every digit of the hands or feet, ten camels must be given; for a tooth five camels must be given; for an injury that exposes the bone, five camels must be given. A man may be killed in return for (killing) a woman and those who deal in gold must pay one thousand dinars. (Daif)",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى، قَالَ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، عَنْ سُلَيْمَانَ بْنِ دَاوُدَ، قَالَ حَدَّثَنِي الزُّهْرِيُّ، عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَتَبَ إِلَى أَهْلِ الْيَمَنِ كِتَابًا فِيهِ الْفَرَائِضُ وَالسُّنَنُ وَالدِّيَاتُ وَبَعَثَ بِهِ مَعَ عَمْرِو بْنِ حَزْمٍ فَقُرِئَتْ عَلَى أَهْلِ الْيَمَنِ هَذِهِ نُسْخَتُهَا ‏\"‏ مِنْ مُحَمَّدٍ النَّبِيِّ صلى الله عليه وسلم إِلَى شُرَحْبِيلَ بْنِ عَبْدِ كُلاَلٍ وَنُعَيْمِ بْنِ عَبْدِ كُلاَلٍ وَالْحَارِثِ بْنِ عَبْدِ كُلاَلٍ قَيْلِ ذِي رُعَيْنٍ وَمُعَافِرَ وَهَمْدَانَ أَمَّا بَعْدُ ‏\"‏ ‏.‏ وَكَانَ فِي كِتَابِهِ ‏\"‏ أَنَّ مَنِ اعْتَبَطَ مُؤْمِنًا قَتْلاً عَنْ بَيِّنَةٍ فَإِنَّهُ قَوَدٌ إِلاَّ أَنْ يَرْضَى أَوْلِيَاءُ الْمَقْتُولِ وَأَنَّ فِي النَّفْسِ الدِّيَةُ مِائَةً مِنَ الإِبِلِ وَفِي الأَنْفِ إِذَا أُوعِبَ جَدْعُهُ الدِّيَةُ وَفِي اللِّسَانِ الدِّيَةُ وَفِي الشَّفَتَيْنِ الدِّيَةُ وَفِي الْبَيْضَتَيْنِ الدِّيَةُ وَفِي الذَّكَرِ الدِّيَةُ وَفِي الصُّلْبِ الدِّيَةُ وَفِي الْعَيْنَيْنِ الدِّيَةُ وَفِي الرِّجْلِ الْوَاحِدَةِ نِصْفُ الدِّيَةِ وَفِي الْمَأْمُومَةِ ثُلُثُ الدِّيَةِ وَفِي الْجَائِفَةِ ثُلُثُ الدِّيَةِ وَفِي الْمُنَقِّلَةِ خَمْسَ عَشَرَةَ مِنَ الإِبِلِ وَفِي كُلِّ أُصْبُعٍ مِنْ أَصَابِعِ الْيَدِ وَالرِّجْلِ عَشْرٌ مِنَ الإِبِلِ وَفِي السِّنِّ خَمْسٌ مِنَ الإِبِلِ وَفِي الْمُوضِحَةِ خَمْسٌ مِنَ الإِبِلِ وَأَنَّ الرَّجُلَ يُقْتَلُ بِالْمَرْأَةِ وَعَلَى أَهْلِ الذَّهَبِ أَلْفُ دِينَارٍ ‏\"‏ ‏.‏ خَالَفَهُ مُحَمَّدُ بْنُ بَكَّارِ بْنِ بِلاَلٍ ‏.‏",
    "malay_translation": "Rasulullah SAW menulis surat kepada penduduk Yaman, yang termasuk di dalamnya adalah hukum-hukum warisan, sunnah dan (hukum-hukum mengenai) diyat (wang tebusan). Baginda menghantarnya bersama 'Amr bin Hazm dan ia dibacakan kepada penduduk Yaman. Kandungannya adalah seperti berikut: \"Daripada Muhammad Nabi kepada Shurahbil bin 'Abd Kulal, Nu'aim bin 'Abd Kulal, Al-Harith bin 'Abd Kulal, Qail dhil-Ru'ain, Mu'afir dan Hamdan. Untuk didahulukan\" - Dan dalam surat ini dinyatakan bahawa sesiapa yang membunuh seorang mukmin tanpa alasan yang benar, maka dia hendaklah dibunuh sebagai balasan, kecuali jika waris mangsa bersetuju untuk memaafkannya. Untuk membunuh seseorang, Diyat adalah seratus ekor unta. Untuk hidung, jika dipotong sepenuhnya, diyat mesti dibayar; untuk lidah, diyat mesti dibayar; untuk bibir, diyat mesti dibayar; untuk buah zakar, diyat mesti dibayar; untuk zakar, diyat mesti dibayar; untuk tulang belakang, diyat mesti dibayar; untuk mata, diyat mesti dibayar; untuk satu kaki, separuh daripada Diyat mesti dibayar; untuk pukulan di kepala yang sampai ke otak, satu pertiga daripada diyat mesti dibayar; untuk luka tikaman yang menembusi jauh ke dalam badan, satu pertiga daripada diyat mesti dibayar; untuk pukulan yang mematahkan tulang, lima belas ekor unta mesti diberikan; untuk setiap jari tangan atau kaki, sepuluh ekor unta mesti diberikan; untuk gigi, lima ekor unta mesti diberikan; untuk kecederaan yang mendedahkan tulang, lima ekor unta mesti diberikan. Seorang lelaki boleh dibunuh sebagai balasan (membunuh) seorang wanita dan mereka yang berurusan dengan emas mesti membayar seribu dinar. (Daif)"
  },
  {
    "id": 19600,
    "hadith_number": 4864,
    "tajuk_hadith": "Surat Rasulullah SAW kepada Penduduk Yaman tentang Warisan, Sunnah, dan Diyat",
    "perawi_melayu": "Diriwayatkan daripada Abi Bakr bin Muhammad bin 'Amr bin Hazm, daripada ayahnya, daripada datuknya, bahawa:",
    "english_text": "the Messenger of Allah wrote a letter to the people of Yemen included in which were the rules of inheritance, the sunan and the (rules concerning) blood money. He sent it with 'Amr bin Hazm and it was read to the people of Yemen. This is a copy of it. And he mentioned something similar, except that he said: \"And for one eye, half the Diyah must be paid; for one hand, half thediyah must be paid; for one foot, half the diyah must be paid. \" (Daif)",
    "arabic_text": "أَخْبَرَنَا الْهَيْثَمُ بْنُ مَرْوَانَ بْنِ الْهَيْثَمِ بْنِ عِمْرَانَ الْعَنْسِيُّ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارِ بْنِ بِلاَلٍ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ أَرْقَمَ، قَالَ حَدَّثَنِي الزُّهْرِيُّ، عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَتَبَ إِلَى أَهْلِ الْيَمَنِ بِكِتَابٍ فِيهِ الْفَرَائِضُ وَالسُّنَنُ وَالدِّيَاتُ وَبَعَثَ بِهِ مَعَ عَمْرِو بْنِ حَزْمٍ فَقُرِئَ عَلَى أَهْلِ الْيَمَنِ هَذِهِ نُسْخَتُهُ فَذَكَرَ مِثْلَهُ إِلاَّ أَنَّهُ قَالَ ‏\n\"‏ وَفِي الْعَيْنِ الْوَاحِدَةِ نِصْفُ الدِّيَةِ وَفِي الْيَدِ الْوَاحِدَةِ نِصْفُ الدِّيَةِ وَفِي الرِّجْلِ الْوَاحِدَةِ نِصْفُ الدِّيَةِ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ وَهَذَا أَشْبَهُ بِالصَّوَابِ وَاللَّهُ أَعْلَمُ وَسُلَيْمَانُ بْنُ أَرْقَمَ مَتْرُوكُ الْحَدِيثِ وَقَدْ رَوَى هَذَا الْحَدِيثَ يُونُسُ عَنِ الزُّهْرِيِّ مُرْسَلاً ‏.‏",
    "malay_translation": "Rasulullah SAW menulis surat kepada penduduk Yaman yang di dalamnya terkandung hukum-hukum warisan, sunnah dan (hukum-hukum mengenai) diyat (tebusan darah). Baginda mengirimkannya bersama 'Amr bin Hazm dan ia dibacakan kepada penduduk Yaman. Ini adalah salinannya. Dan baginda menyebutkan sesuatu yang serupa, kecuali baginda bersabda: \"Dan untuk satu mata, separuh Diyat harus dibayar; untuk satu tangan, separuh diyat harus dibayar; untuk satu kaki, separuh diyat harus dibayar.\" (Daif)"
  },
  {
    "id": 19601,
    "hadith_number": 4865,
    "tajuk_hadith": "Surat Rasulullah SAW kepada 'Amr bin Hazm tentang Perlaksanaan Hukum di Najran",
    "perawi_melayu": "Diriwayatkan daripada Ibn Shihab, beliau berkata:",
    "english_text": "\"I read the letter of the Messenger of allah which he wrote for 'Amr bin Hazm when he sent him to govern Najran. The letter was with Abu Bakr bin Hazm. The Messenger of Allah wrote this; 'A statement from Allah and His Messenger; O you who believe! Fulfill (your) obligations, and he wrote the Verses until he reached. Verily, Allah is Swift in reckoning. Then he wrote: 'this is the book if retaliation: For a soul, one hundred camels, '''' and so on",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، قَالَ قَرَأْتُ كِتَابَ رَسُولِ اللَّهِ صلى الله عليه وسلم الَّذِي كَتَبَ لِعَمْرِو بْنِ حَزْمٍ حِينَ بَعَثَهُ عَلَى نَجْرَانَ - وَكَانَ الْكِتَابُ عِنْدَ أَبِي بَكْرِ بْنِ حَزْمٍ - فَكَتَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَذَا بَيَانٌ مِنَ اللَّهِ وَرَسُولِهِ ‏{‏ يَا أَيُّهَا الَّذِينَ آمَنُوا أَوْفُوا بِالْعُقُودِ ‏}‏ ‏\"‏ ‏.‏ وَكَتَبَ الآيَاتِ مِنْهَا حَتَّى بَلَغَ ‏{‏ إِنَّ اللَّهَ سَرِيعُ الْحِسَابِ ‏}‏ ثُمَّ كَتَبَ ‏\"‏ هَذَا كِتَابُ الْجِرَاحِ فِي النَّفْسِ مِائَةٌ مِنَ الإِبِلِ ‏\"‏ ‏.‏ نَحْوَهُ ‏.‏",
    "malay_translation": "Saya membaca surat Rasulullah SAW yang ditulis untuk 'Amr bin Hazm ketika baginda menghantarnya untuk memerintah Najran. Surat itu berada pada Abu Bakr bin Hazm. Rasulullah SAW menulis ini: 'Ini adalah pernyataan daripada Allah dan Rasul-Nya; Wahai orang-orang yang beriman! Penuhilah (kewajiban-kewajibanmu),' dan baginda menulis ayat-ayat sehingga sampai. Sesungguhnya Allah sangat cepat perhitungan-Nya.' Kemudian baginda menulis: 'Ini adalah kitab qisas: Untuk satu jiwa, seratus ekor unta,' dan seterusnya."
  },
  {
    "id": 19602,
    "hadith_number": 4866,
    "tajuk_hadith": "Hukuman Diyat dalam Islam",
    "perawi_melayu": "Diriwayatkan bahawa Az-Zuhri berkata:",
    "english_text": "\"Abu Bakr bin Hazm brought me a letter on a piece of leather (which was ) from the Messenger of Allah: 'This is a statement from Allah and His Messenger: 'O you who believe! Fulfill (your obligations. And he quoted some Verses from it. Then he said: 'For a soul, one hundred camels; for an eye, fifty camels; for a hand, fifty; for a foot, fifty; for a blow to the head that reaches the brain, one-third of the Diyah: for a hand, fifty; for a stab wound that penetrates deeply, one-third of the Diyah; for a blow that breaks a bone, fifteen camels; for fingers, ten each; for teeth, five each; for a wound that exposes the bone, five. (Daif)",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ الْوَاحِدِ، قَالَ حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا سَعِيدٌ، - وَهُوَ ابْنُ عَبْدِ الْعَزِيزِ - عَنِ الزُّهْرِيِّ، قَالَ جَاءَنِي أَبُو بَكْرِ بْنِ حَزْمٍ بِكِتَابٍ فِي رُقْعَةٍ مِنْ أَدَمٍ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَذَا بَيَانٌ مِنَ اللَّهِ وَرَسُولِهِ ‏{‏ يَا أَيُّهَا الَّذِينَ آمَنُوا أَوْفُوا بِالْعُقُودِ ‏}‏ ‏\"‏ ‏.‏ فَتَلاَ مِنْهَا آيَاتٍ ثُمَّ قَالَ ‏\"‏ فِي النَّفْسِ مِائَةٌ مِنَ الإِبِلِ وَفِي الْعَيْنِ خَمْسُونَ وَفِي الْيَدِ خَمْسُونَ وَفِي الرِّجْلِ خَمْسُونَ وَفِي الْمَأْمُومَةِ ثُلُثُ الدِّيَةِ وَفِي الْجَائِفَةِ ثُلُثُ الدِّيَةِ وَفِي الْمُنَقِّلَةِ خَمْسَ عَشْرَةَ فَرِيضَةً وَفِي الأَصَابِعِ عَشْرٌ عَشْرٌ وَفِي الأَسْنَانِ خَمْسٌ خَمْسٌ وَفِي الْمُوضِحَةِ خَمْسٌ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Bakr bin Hazm membawakan saya sepucuk surat di atas sehelai kulit daripada Rasulullah SAW: 'Ini adalah pernyataan daripada Allah dan Rasul-Nya: 'Wahai orang-orang yang beriman! Tunaikanlah perjanjian-perjanjian.' Kemudian beliau membaca beberapa ayat daripadanya. Kemudian beliau berkata: 'Bagi jiwa, seratus ekor unta; bagi mata, lima puluh ekor unta; bagi tangan, lima puluh; bagi kaki, lima puluh; bagi pukulan ke kepala yang sampai ke otak, satu pertiga daripada Diyat; bagi luka tikaman yang menembusi jauh, satu pertiga daripada Diyat; bagi pukulan yang memecahkan tulang, lima belas ekor unta; bagi jari-jari, sepuluh setiap satu; bagi gigi, lima setiap satu; bagi luka yang mendedahkan tulang, lima.' (Daif)"
  },
  {
    "id": 19603,
    "hadith_number": 4867,
    "tajuk_hadith": "Hukuman Diyat dalam Islam",
    "perawi_melayu": "Diriwayatkan daripada 'Abdullah bin Abi Bakr bin Muhammad bin 'Amr bin Hazm bahawa bapanya berkata:",
    "english_text": "\"The letter which the Messenger of Allah wrote to 'Amr bin Hazm concerning blood money: 'For a soul, one hundred camels; for the nose if it is cut off completely, one hundred camels, for a blow to thread that reaches the brain, one third of the Diyah for a soul; for a stab wound that penetrates deeply, likewise; for a hand fifty; for an eye, fifty, for a foot, fifty; for every fingers, Ten  camels for a tooth, five; and for a wound that exposes the bone, five.",
    "arabic_text": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ أَبِيهِ، قَالَ الْكِتَابُ الَّذِي كَتَبَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم لِعَمْرِو بْنِ حَزْمٍ فِي الْعُقُولِ ‏\n\"‏ إِنَّ فِي النَّفْسِ مِائَةً مِنَ الإِبِلِ وَفِي الأَنْفِ إِذَا أُوعِيَ جَدْعًا مِائَةً مِنَ الإِبِلِ وَفِي الْمَأْمُومَةِ ثُلُثُ النَّفْسِ وَفِي الْجَائِفَةِ مِثْلُهَا وَفِي الْيَدِ خَمْسُونَ وَفِي الْعَيْنِ خَمْسُونَ وَفِي الرِّجْلِ خَمْسُونَ وَفِي كُلِّ إِصْبَعٍ مِمَّا هُنَالِكَ عَشْرٌ مِنَ الإِبِلِ وَفِي السِّنِّ خَمْسٌ وَفِي الْمُوضِحَةِ خَمْسٌ ‏\"‏ ‏.‏",
    "malay_translation": "Surat yang ditulis oleh Rasulullah SAW kepada 'Amr bin Hazm berkenaan dengan diyat (pampasan): 'Untuk satu jiwa, seratus ekor unta; untuk hidung jika dipotong sepenuhnya, seratus ekor unta; untuk pukulan yang sampai ke otak, satu pertiga daripada Diyat untuk satu jiwa; untuk luka tikaman yang menembusi dalam, begitu juga; untuk tangan lima puluh; untuk mata, lima puluh; untuk kaki, lima puluh; untuk setiap jari, sepuluh ekor unta; untuk gigi, lima; dan untuk luka yang menampakkan tulang, lima.'"
  },
  {
    "id": 19604,
    "hadith_number": 4868,
    "tajuk_hadith": "Larangan Mengintai ke Dalam Rumah Orang Lain Tanpa Izin",
    "perawi_melayu": "Diriwayatkan daripada Anas bin Malik bahwa:",
    "english_text": "a Bedouin came to the door of the prophet and put his eye to the crack. The Prophet saw him and intended to put his eye out with a sword or a stick. When he saw him , he stopped, and the Prophet said to hi: \"If you had persisted, I would have put your eye out.\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا أَبَانُ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ أَعْرَابِيًّا، أَتَى بَابَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَلْقَمَ عَيْنَهُ خُصَاصَةَ الْبَابِ فَبَصُرَ بِهِ النَّبِيُّ صلى الله عليه وسلم فَتَوَخَّاهُ بِحَدِيدَةٍ أَوْ عُودٍ لِيَفْقَأَ عَيْنَهُ فَلَمَّا أَنْ بَصُرَ انْقَمَعَ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ أَمَا إِنَّكَ لَوْ ثَبَتَّ لَفَقَأْتُ عَيْنَكَ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang Badwi datang ke pintu Nabi ﷺ dan meletakkan matanya pada celah pintu. Nabi ﷺ melihatnya dan berniat untuk mencungkil matanya dengan pedang atau tongkat. Ketika dia melihat Nabi ﷺ, dia berhenti, dan Nabi ﷺ bersabda kepadanya: \"Jika kamu berkeras, pasti aku cungkil matamu.\""
  },
  {
    "id": 19605,
    "hadith_number": 4869,
    "tajuk_hadith": "Larangan Mengintai ke Dalam Rumah Orang Lain Tanpa Izin",
    "perawi_melayu": "Diriwayatkan daripada Sahl bin Sa'd As-Saidi bahawa:",
    "english_text": "a man looked through a hole in the door of the Prophet, who had with him a kind of comb with which he was scratching his head, When the Messenger of Allah saw him he said: \"If I had known that you were watching me, I would have stabbed you in the eye with this. This rule of asking permission has been ordained so that one may not look unlawfully (into people's houses).",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، أَنَّ سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ، أَخْبَرَهُ أَنَّ رَجُلاً اطَّلَعَ مِنْ جُحْرٍ فِي بَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَمَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم مِدْرَى يَحُكُّ بِهَا رَأْسَهُ فَلَمَّا رَآهُ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَوْ عَلِمْتُ أَنَّكَ تَنْظُرُنِي لَطَعَنْتُ بِهِ فِي عَيْنِكَ إِنَّمَا جُعِلَ الإِذْنُ مِنْ أَجْلِ الْبَصَرِ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki mengintai melalui lubang di pintu Nabi SAW, yang ketika itu sedang menggaru kepalanya dengan sejenis sikat. Apabila Rasulullah SAW melihatnya, baginda bersabda: \"Jika aku tahu engkau sedang memerhatikanku, pasti aku tikam matamu dengan ini. Sesungguhnya, perintah meminta izin itu disyariatkan adalah supaya seseorang tidak melihat secara tidak sah (ke dalam rumah orang lain).\""
  },
  {
    "id": 19606,
    "hadith_number": 4870,
    "tajuk_hadith": "Hukuman Bagi yang Mengintai ke Dalam Rumah Orang Lain Tanpa Izin",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah bahawa Nabi bersabda:",
    "english_text": "\"Whoever looks into a house without the permission of the occupants and they put out his eye, he has no right to blood money or retaliation.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنِ اطَّلَعَ فِي بَيْتِ قَوْمٍ بِغَيْرِ إِذْنِهِمْ فَفَقَئُوا عَيْنَهُ فَلاَ دِيَةَ لَهُ وَلاَ قِصَاصَ ‏\"‏ ‏.‏",
    "malay_translation": "Sesiapa yang mengintai ke dalam rumah orang lain tanpa izin mereka, lalu mereka mencungkil matanya, maka tidak ada ganti rugi (diyat) atau balasan (qisas) baginya."
  },
  {
    "id": 19607,
    "hadith_number": 4871,
    "tajuk_hadith": "Hukuman Bagi Orang yang Mengintai Tanpa Izin",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah bahawa Nabi bersabda:",
    "english_text": "\"If a person were to look at you without permission and you were to throw a stone at him and put out his eye, there would be no blame on you.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لَوْ أَنَّ امْرَأً اطَّلَعَ عَلَيْكَ بِغَيْرِ إِذْنٍ فَخَذَفْتَهُ فَفَقَأْتَ عَيْنَهُ مَا كَانَ عَلَيْكَ حَرَجٌ ‏\"‏ ‏.‏ وَقَالَ مَرَّةً أُخْرَى ‏\"‏ جُنَاحٌ ‏\"‏ ‏.‏",
    "malay_translation": "\"Jika seseorang melihat ke arahmu tanpa izin, dan kamu melempar batu kepadanya sehingga membutakan matanya, maka tidak ada celaan ke atasmu.\""
  },
  {
    "id": 19608,
    "hadith_number": 4872,
    "tajuk_hadith": "Larangan Melintas di Hadapan Orang yang Sedang Solat dan Cara Menghalangnya",
    "perawi_melayu": "Diriwayatkan daripada Abu Sa'eed Al-Khudri bahawa:",
    "english_text": "he was praying and a son a Marwan wanted to pass in front of him. He tried to stop him but he did not go back, so he hit him. The boy went the boy went out crying and went to Marwan and told him (what had happened). Marwan said to Abu Sa'eed: \"Why did you hit your brother's son?\" He said: \"I did not hit him, rater I hit the Saitan. I heard the Messenger of Allah say: 'If one of you is praying and someone wants to pass in front of him, let him troy to stop him as much as he can, and if he persists then let him fight him, for he is a devil.",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مُصْعَبٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّهُ كَانَ يُصَلِّي فَإِذَا بِابْنٍ لِمَرْوَانَ يَمُرُّ بَيْنَ يَدَيْهِ فَدَرَأَهُ فَلَمْ يَرْجِعْ فَضَرَبَهُ فَخَرَجَ الْغُلاَمُ يَبْكِي حَتَّى أَتَى مَرْوَانَ فَأَخْبَرَهُ فَقَالَ مَرْوَانُ لأَبِي سَعِيدٍ لِمَ ضَرَبْتَ ابْنَ أَخِيكَ قَالَ مَا ضَرَبْتُهُ إِنَّمَا ضَرَبْتُ الشَّيْطَانَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِذَا كَانَ أَحَدُكُمْ فِي صَلاَةٍ فَأَرَادَ إِنْسَانٌ يَمُرُّ بَيْنَ يَدَيْهِ فَيَدْرَؤُهُ مَا اسْتَطَاعَ فَإِنْ أَبَى فَلْيُقَاتِلْهُ فَإِنَّهُ شَيْطَانٌ ‏\"‏ ‏.‏",
    "malay_translation": "Beliau sedang solat, dan seorang anak Marwan ingin melintas di hadapannya. Beliau cuba menghalangnya tetapi dia tidak berundur, jadi beliau memukulnya. Budak itu keluar menangis dan pergi kepada Marwan dan memberitahunya (apa yang telah berlaku). Marwan berkata kepada Abu Sa'eed: \"Mengapa kamu memukul anak saudara kamu?\" Beliau berkata: \"Saya tidak memukulnya, tetapi saya memukul syaitan. Saya mendengar Rasulullah SAW bersabda: 'Jika salah seorang daripada kamu sedang solat dan seseorang ingin melintas di hadapannya, maka hendaklah dia cuba menghalangnya sekuat mungkin, dan jika dia berdegil maka hendaklah dia melawannya, kerana dia adalah syaitan.'"
  },
  {
    "id": 19609,
    "hadith_number": 4873,
    "tajuk_hadith": "Hukuman Membunuh Seorang Mukmin dengan Sengaja dan Ayat tentang Syirik",
    "perawi_melayu": "Diriwayatkan daripada Sa'eed bin Jubair, katanya:",
    "english_text": "\"Abdur-Rahman bin Abi Laila told me to ask Ibn 'Abbas about two Verses: 'And whoever kills a believe4r intentionally, his recompense is Hell' I asked him and he said: 'Nothing of this has been abrogated.'(And I asked him about the Verse): 'And those who invoke not any other ilah (god) along with Allah, nor kill such person as Allah has forbidden, except by right. He said: 'This was revealed concerning the people of shirk.",
    "arabic_text": "حَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ، لَفْظًا قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ أَمَرَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبْزَى أَنْ أَسْأَلَ ابْنَ عَبَّاسٍ، عَنْ هَاتَيْنِ الآيَتَيْنِ، ‏{‏ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ ‏}‏ فَسَأَلْتُهُ فَقَالَ لَمْ يَنْسَخْهَا شَىْءٌ ‏.‏ وَعَنْ هَذِهِ الآيَةِ ‏{‏ وَالَّذِينَ لاَ يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ وَلاَ يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ ‏}‏ قَالَ نَزَلَتْ فِي أَهْلِ الشِّرْكِ ‏.‏",
    "malay_translation": "\"Abdur-Rahman bin Abi Laila menyuruhku untuk bertanya kepada Ibn 'Abbas tentang dua ayat: 'Dan sesiapa yang membunuh seorang mukmin dengan sengaja, maka balasannya adalah Neraka.' Aku bertanya kepadanya dan dia berkata: 'Tidak ada apa-apa pun yang telah membatalkan ayat ini.' (Dan aku bertanya kepadanya tentang ayat): 'Dan mereka yang tidak menyeru ilah (tuhan) lain bersama Allah, dan tidak membunuh jiwa yang diharamkan Allah kecuali dengan hak.' Dia berkata: 'Ini diturunkan berkenaan dengan orang-orang syirik.'"
  },
  {
    "id": 19610,
    "hadith_number": 4874,
    "tajuk_hadith": "Ayat Tentang Pembunuhan Seorang Mukmin dengan Sengaja Tidak Dimansukhkan",
    "perawi_melayu": "Diriwayatkan daripada Sa'eed bin Jubair, beliau berkata:",
    "english_text": "\"The people of Al-Kufah differed concerning this verse: 'And whoever kills a believer intentionally. So I went to Ibn 'Abbas and asked him, and he said: 'It was revealed among the last of what was revealed, and nothing of it was abrogated after that.",
    "arabic_text": "أَخْبَرَنَا أَزْهَرُ بْنُ جَمِيلٍ، قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الْمُغِيرَةِ بْنِ النُّعْمَانِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ اخْتَلَفَ أَهْلُ الْكُوفَةِ فِي هَذِهِ الآيَةِ ‏{‏ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا ‏}‏ فَرَحَلْتُ إِلَى ابْنِ عَبَّاسٍ فَسَأَلْتُهُ فَقَالَ نَزَلَتْ فِي آخِرِ مَا أُنْزِلَتْ وَمَا نَسَخَهَا شَىْءٌ ‏.‏",
    "malay_translation": "Penduduk Al-Kufah berselisih pendapat mengenai ayat ini: 'Dan sesiapa yang membunuh seorang mukmin dengan sengaja...' Maka saya pergi kepada Ibn 'Abbas dan bertanya kepadanya, lalu beliau berkata: 'Ayat ini diturunkan di antara yang terakhir diturunkan, dan tidak ada sesuatu pun yang memansuhkannya selepas itu.'"
  },
  {
    "id": 19611,
    "hadith_number": 4875,
    "tajuk_hadith": "Hukum Membunuh Seorang Mukmin dengan Sengaja dan Penebusannya",
    "perawi_melayu": "Diriwayatkan daripada Sa'eed bin Jubair, beliau berkata:",
    "english_text": "\"I said to Ibn Abbas . 'Can a person who killed a believer intentionally repent?' He said: 'No.' Irecited the Verse from Al-Furqan to him: And those who invoke not any other ilah (god) along with Allah, nor kill such person a Allah has forbidden, except but right. He said: 'This Verse was revealed in Makkah and was abrogated by a verse that was revealed in Al-Madinah: And whoever kills a believer intentionally, his recompense is Hell",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي الْقَاسِمُ بْنُ أَبِي بَزَّةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ قُلْتُ لاِبْنِ عَبَّاسٍ هَلْ لِمَنْ قَتَلَ مُؤْمِنًا مُتَعَمِّدًا مِنْ تَوْبَةٍ قَالَ لاَ ‏.‏ وَقَرَأْتُ عَلَيْهِ الآيَةَ الَّتِي فِي الْفُرْقَانِ ‏{‏ وَالَّذِينَ لاَ يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ وَلاَ يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ ‏}‏ قَالَ هَذِهِ آيَةٌ مَكِّيَّةٌ نَسَخَتْهَا آيَةٌ مَدَنِيَّةٌ ‏{‏ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ ‏}‏ ‏.‏",
    "malay_translation": "\"Aku berkata kepada Ibn Abbas. 'Adakah seseorang yang membunuh seorang mukmin dengan sengaja boleh bertaubat?' Beliau berkata: 'Tidak.' Aku membacakan kepadanya ayat dari Al-Furqan: Dan mereka yang tidak menyeru ilah (tuhan) lain bersama Allah, dan tidak membunuh jiwa yang telah diharamkan Allah kecuali dengan hak. Beliau berkata: 'Ayat ini diturunkan di Makkah dan telah dimansuhkan oleh ayat yang diturunkan di Al-Madinah: Dan sesiapa yang membunuh seorang mukmin dengan sengaja, maka balasannya adalah Neraka.'"
  },
  {
    "id": 19612,
    "hadith_number": 4876,
    "tajuk_hadith": "Tiada Taubat Bagi Pembunuh Seorang Mukmin Dengan Sengaja",
    "perawi_melayu": "Diriwayatkan daripada Salim bin Abi Ja'd bahawa:",
    "english_text": "Ibn 'Abbas was asked about someone who killed a believer deliberately then he repented, believed and did righteous deeds, and followed true guidance. Ibn 'Abbas said: \"There is no way he could repent! I heard your Prophet say; He (the victim) will come hanging onto his killer with his jugular veins flowing with blood and saying: \"Ask him why he killed me.\" Then he said: \"by Allah, Allah revealed it and never abrogated anything of it.",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمَّارٍ الدُّهْنِيِّ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، أَنَّ ابْنَ عَبَّاسٍ، سُئِلَ عَمَّنْ قَتَلَ مُؤْمِنًا مُتَعَمِّدًا ثُمَّ تَابَ وَآمَنَ وَعَمِلَ صَالِحًا ثُمَّ اهْتَدَى فَقَالَ ابْنُ عَبَّاسٍ وَأَنَّى لَهُ التَّوْبَةُ سَمِعْتُ نَبِيَّكُمْ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ يَجِيءُ مُتَعَلِّقًا بِالْقَاتِلِ تَشْخَبُ أَوْدَاجُهُ دَمًا يَقُولُ سَلْ هَذَا فِيمَ قَتَلَنِي ‏\"‏ ‏.‏ ثُمَّ قَالَ وَاللَّهِ لَقَدْ أَنْزَلَهَا وَمَا نَسَخَهَا ‏.‏",
    "malay_translation": "Ibn 'Abbas ditanya tentang seseorang yang membunuh seorang mukmin dengan sengaja, kemudian dia bertaubat, beriman, melakukan amal soleh, dan mengikuti petunjuk yang benar. Ibn 'Abbas berkata: \"Tidak ada jalan baginya untuk bertaubat! Saya mendengar Nabi kamu bersabda; Dia (mangsa) akan datang bergantung pada pembunuhnya dengan urat lehernya mengalirkan darah dan berkata: \"Tanya dia mengapa dia membunuhku.\" Kemudian dia berkata: \"Demi Allah, Allah telah menurunkannya dan tidak pernah membatalkan apa pun daripadanya."
  },
  {
    "id": 19613,
    "hadith_number": 4877,
    "tajuk_hadith": "Dosa-Dosa Besar: Syirik, Menderhaka Ibu Bapa, Membunuh, dan Berdusta",
    "perawi_melayu": "Diriwayatkan daripada 'Ubaidullah bin Abi Bakr berkata:",
    "english_text": "\"I heard Ana's say: 'The Messenger of Allah said: 'the major sins are; associating others with Allah (shirk), disobeying one's parents, killing a soul (murder) and speaking falsely.",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا النَّضْرُ بْنُ شُمَيْلٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ح وَأَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْكَبَائِرُ الشِّرْكُ بِاللَّهِ وَعُقُوقُ الْوَالِدَيْنِ وَقَتْلُ النَّفْسِ وَقَوْلُ الزُّورِ ‏\"‏ ‏.‏",
    "malay_translation": "Saya mendengar Anas berkata: 'Rasulullah SAW bersabda: 'Dosa-dosa besar adalah; menyekutukan Allah (syirik), menderhaka kepada kedua ibu bapa, membunuh jiwa (membunuh) dan berkata dusta."
  },
  {
    "id": 19614,
    "hadith_number": 4878,
    "tajuk_hadith": "Dosa-Dosa Besar: Syirik, Derhaka kepada Ibu Bapa, Membunuh, dan Sumpah Palsu",
    "perawi_melayu": "Diriwayatkan daripada 'Abdullah bin 'Amr bahawa Nabi bersabda:",
    "english_text": "\"The major sins are: associating others with Allah, disobeying parents, killing a souls (murder) and swearing a false oath knowingly.",
    "arabic_text": "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ الرَّحِيمِ، قَالَ أَنْبَأَنَا ابْنُ شُمَيْلٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَنْبَأَنَا فِرَاسٌ، قَالَ سَمِعْتُ الشَّعْبِيَّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْكَبَائِرُ الإِشْرَاكُ بِاللَّهِ وَعُقُوقُ الْوَالِدَيْنِ وَقَتْلُ النَّفْسِ وَالْيَمِينُ الْغَمُوسُ ‏\"‏ ‏.‏",
    "malay_translation": "\"Dosa-dosa besar adalah: menyekutukan Allah (syirik), menderhaka kepada ibu bapa, membunuh jiwa, dan bersumpah palsu dengan sengaja.\""
  },
  {
    "id": 19615,
    "hadith_number": 4879,
    "tajuk_hadith": "Larangan Melakukan Zina, Minum Arak, Mencuri dan Membunuh dalam Keadaan Beriman",
    "perawi_melayu": "Diriwayatkan daripada Ibn 'Abbas, beliau berkata:",
    "english_text": "\"The Messenger of Allah said: 'No one who commits Zina is a believer at the moment when he is committing Zina, and no one who drinks wine is a believer at the moment when he is drinking it, and no thief is a believer at the moment when he is stealing, and no killer is a believer at the moment he is killing",
    "arabic_text": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلاَّمٍ، قَالَ حَدَّثَنَا إِسْحَاقُ الأَزْرَقُ، عَنِ الْفُضَيْلِ بْنِ غَزْوَانَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَزْنِي الْعَبْدُ حِينَ يَزْنِي وَهُوَ مُؤْمِنٌ وَلاَ يَشْرَبُ الْخَمْرَ حِينَ يَشْرَبُهَا وَهُوَ مُؤْمِنٌ وَلاَ يَسْرِقُ وَهُوَ مُؤْمِنٌ وَلاَ يَقْتُلُ وَهُوَ مُؤْمِنٌ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: 'Tidaklah seorang hamba melakukan zina ketika dia berzina dalam keadaan beriman, tidaklah dia meminum arak ketika dia meminumnya dalam keadaan beriman, tidaklah dia mencuri ketika dia mencuri dalam keadaan beriman, dan tidaklah dia membunuh ketika dia membunuh dalam keadaan beriman.'"
  }
]