[
  {
    "id": 15426,
    "hadith_number": 690,
    "tajuk_hadith": "Keutamaan Membina Masjid dan Ingatan Kepada Allah",
    "perawi_melayu": "Diceritakan oleh 'Amr bin 'Abasah bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Barangsiapa yang membina sebuah Masjid di mana Allah diingat, Allah (Yang Maha Perkasa dan Maha Agung) akan membina untuknya sebuah rumah di Syurga.\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ، قَالَ حَدَّثَنَا بَقِيَّةُ، عَنْ بَحِيرٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ كَثِيرِ بْنِ مُرَّةَ، عَنْ عَمْرِو بْنِ عَبَسَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ بَنَى مَسْجِدًا يُذْكَرُ اللَّهُ فِيهِ بَنَى اللَّهُ عَزَّ وَجَلَّ لَهُ بَيْتًا فِي الْجَنَّةِ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa yang membina sebuah masjid di mana Allah diingat, maka Allah (Yang Maha Perkasa dan Maha Agung) akan membina baginya sebuah rumah di Syurga."
  },
  {
    "id": 15427,
    "hadith_number": 691,
    "tajuk_hadith": "Tanda-tanda Kiamat: Perbuatan Memegahkan Diri di Masjid",
    "perawi_melayu": "Dikisahkan daripada Anas bahawa Nabi SAW bersabda:",
    "english_text": "\"One of the portents of the Hour will be that people will show off in building Masjids.\"",
    "arabic_text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ يَتَبَاهَى النَّاسُ فِي الْمَسَاجِدِ ‏\"‏ ‏.‏",
    "malay_translation": "Di antara tanda-tanda kedatangan hari kiamat ialah manusia akan bermegah-megah dalam pembinaan masjid."
  },
  {
    "id": 15428,
    "hadith_number": 692,
    "tajuk_hadith": "Keutamaan Solat dan Masjid di Mana-Mana Tempat",
    "perawi_melayu": "Dikisahkan oleh Ibrahim:",
    "english_text": "\"I used to recite Qur'an to my father on the road, and if I recited a verse in which prostration was required, he would prostrate. I said: 'O my father, do you prostrate on the street?' He said: 'I heard Abu Dharr say: \"I asked the Messenger of Allah (ﷺ): 'Which Masjid was built first?' He said: 'Al-Masjid Al-Haram.'  I said: 'How long was there between them?' He said: 'Forty years. And the earth is a Masjid (or a place of prostration) for you, so wherever you are when the time for prayer comes, pray.'\"\n\n In Makkah.\n \"Furthest Masjid\", meaning the Masjid in Jerulsalem.",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، قَالَ كُنْتُ أَقْرَأُ عَلَى أَبِي الْقُرْآنَ فِي السِّكَّةِ فَإِذَا قَرَأْتُ السَّجْدَةَ سَجَدَ فَقُلْتُ يَا أَبَتِ أَتَسْجُدُ فِي الطَّرِيقِ فَقَالَ إِنِّي سَمِعْتُ أَبَا ذَرٍّ يَقُولُ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَىُّ مَسْجِدٍ وُضِعَ أَوَّلاً قَالَ ‏\"‏ الْمَسْجِدُ الْحَرَامُ ‏\"‏ ‏.‏ قُلْتُ ثُمَّ أَىُّ قَالَ ‏\"‏ الْمَسْجِدُ الأَقْصَى ‏\"‏ ‏.‏ قُلْتُ وَكَمْ بَيْنَهُمَا قَالَ ‏\"‏ أَرْبَعُونَ عَامًا وَالأَرْضُ لَكَ مَسْجِدٌ فَحَيْثُمَا أَدْرَكْتَ الصَّلاَةَ فَصَلِّ ‏\"‏ ‏.‏",
    "malay_translation": "Dikatakan oleh Ibrahim, \"Saya pernah membaca Al-Quran kepada ayah saya di jalan raya.  Apabila saya membaca ayat yang memerlukan sujud, ayah saya akan sujud. Saya bertanya, 'Wahai ayah, mengapa engkau sujud di jalan?' Ayah saya menjawab, 'Aku mendengar Abu Dzar berkata, 'Aku bertanya kepada Rasulullah SAW, 'Masjid manakah yang pertama dibina?' Baginda menjawab, 'Masjidil Haram.' Aku bertanya lagi, 'Kemudian masjid yang manakah?' Baginda menjawab, 'Masjidil Aqsa.' Aku bertanya lagi, 'Berapa lama selang masa di antara keduanya?' Baginda menjawab, 'Empat puluh tahun. Bumi itu adalah masjid bagi kamu.  Apabila tiba waktu solat, di manapun engkau berada, maka solatlah.'\" \n\nDi Mekah.\n \"Masjid terjauh\" merujuk kepada Masjid di Baitulmaqdis."
  },
  {
    "id": 15429,
    "hadith_number": 693,
    "tajuk_hadith": "Keutamaan Solat di Masjid Rasulullah SAW",
    "perawi_melayu": "Diceritakan oleh Ibn 'Abbas bahawa Maimunah, isteri Nabi SAW, telah berkata:",
    "english_text": "\"Whoever prays in the Masjid of the Messenger of Allah (ﷺ) (that is good), for I heard the Messenger of Allah (ﷺ) say: ' One prayer offered there is better than a thousand prayers offered elsewhere, except the Masjid of the Ka'bah.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ مَعْبَدِ بْنِ عَبَّاسٍ، أَنَّ مَيْمُونَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ مَنْ صَلَّى فِي مَسْجِدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الصَّلاَةُ فِيهِ أَفْضَلُ مِنْ أَلْفِ صَلاَةٍ فِيمَا سِوَاهُ إِلاَّ مَسْجِدَ الْكَعْبَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Sesiapa yang menunaikan solat di Masjid Rasulullah SAW (itu adalah baik), kerana aku telah mendengar Rasulullah SAW bersabda: 'Satu solat di sini lebih utama daripada seribu solat di tempat lain, kecuali Masjidil Haram.' "
  },
  {
    "id": 15430,
    "hadith_number": 694,
    "tajuk_hadith": "Rasulullah SAW Memainkan Solat di Baitullah",
    "perawi_melayu": "Dikisahkan oleh Salim daripada bapanya,",
    "english_text": "\"The Messenger of Allah (ﷺ) entered the House (the Ka'bah), with Usamah bin Zaid, Bilal and 'Uthman bin Talhah, and they locked the door behind them. When the Messenger of Allah (ﷺ) opened it, I was the first one to enter. I met Bilal and asked him: 'Did the Messenger of Allah (ﷺ) pray inside?' He said: 'Yes, he prayed between the two Yemeni columns.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْبَيْتَ هُوَ وَأُسَامَةُ بْنُ زَيْدٍ وَبِلاَلٌ وَعُثْمَانُ بْنُ طَلْحَةَ فَأَغْلَقُوا عَلَيْهِمْ فَلَمَّا فَتَحَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم كُنْتُ أَوَّلَ مَنْ وَلَجَ فَلَقِيتُ بِلاَلاً فَسَأَلْتُهُ هَلْ صَلَّى فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ صَلَّى بَيْنَ الْعَمُودَيْنِ الْيَمَانِيَيْنِ ‏.‏",
    "malay_translation": "Baginda Rasulullah SAW memasuki Baitullah bersama Usamah bin Zaid, Bilal dan Uthman bin Talhah, dan mereka mengunci pintu di belakang mereka.  Apabila Rasulullah SAW membukanya, saya merupakan orang pertama yang masuk. Saya menemui Bilal dan bertanya, \"Adakah Rasulullah SAW menunaikan solat di dalamnya?\"  Jawab Bilal, \"Ya, Baginda solat di antara dua tiang Yaman.\""
  },
  {
    "id": 15431,
    "hadith_number": 695,
    "tajuk_hadith": "Doa Sulaiman bin Daud a.s. Selepas Membina Baitulmaqdis",
    "perawi_melayu": "Dikisahkan daripada Abdullah bin 'Amr bahawa Rasulullah SAW bersabda:",
    "english_text": "\"When Sulaiman bin Dawud finished building Bait Al-Maqdis, he asked Allah for three things: Judgement that was in harmony with His judgement, and he was given that. And he asked Allah for a dominion that no one after him would have, and he was given that. And when he finished building the Masjid he asked Allah, the Mighty and Sublime, that no one should come to it, intending only to pray there, but he would emerge free of sin as the day his mother bore him.\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا أَبُو مُسْهِرٍ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ، عَنْ رَبِيعَةَ بْنِ يَزِيدَ، عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ، عَنِ ابْنِ الدَّيْلَمِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَنَّ سُلَيْمَانَ بْنَ دَاوُدَ صلى الله عليه وسلم لَمَّا بَنَى بَيْتَ الْمَقْدِسِ سَأَلَ اللَّهَ عَزَّ وَجَلَّ خِلاَلاً ثَلاَثَةً سَأَلَ اللَّهَ عَزَّ وَجَلَّ حُكْمًا يُصَادِفُ حُكْمَهُ فَأُوتِيَهُ وَسَأَلَ اللَّهَ عَزَّ وَجَلَّ مُلْكًا لاَ يَنْبَغِي لأَحَدٍ مِنْ بَعْدِهِ فَأُوتِيَهُ وَسَأَلَ اللَّهَ عَزَّ وَجَلَّ حِينَ فَرَغَ مِنْ بِنَاءِ الْمَسْجِدِ أَنْ لاَ يَأْتِيَهُ أَحَدٌ لاَ يَنْهَزُهُ إِلاَّ الصَّلاَةُ فِيهِ أَنْ يُخْرِجَهُ مِنْ خَطِيئَتِهِ كَيَوْمِ وَلَدَتْهُ أُمُّهُ ‏\"‏ ‏.‏",
    "malay_translation": "Ketika Sulaiman bin Daud selesai membina Baitulmaqdis, baginda memohon tiga perkara daripada Allah: Pertama, keadilan yang selari dengan keadilan-Nya, dan ia telah dikurniakan kepadanya. Kedua, kekuasaan yang tidak akan dimiliki oleh sesiapapun selepasnya, dan ia telah dikurniakan kepadanya. Ketiga, ketika baginda selesai membina masjid, baginda memohon kepada Allah Yang Maha Perkasa lagi Maha Tinggi agar tiada sesiapa yang memasukinya kecuali untuk bersembahyang di dalamnya, dan supaya mereka keluar daripadanya tanpa dosa seperti hari ibunya melahirkannya."
  },
  {
    "id": 15432,
    "hadith_number": 696,
    "tajuk_hadith": "Keutamaan Solat di Masjid Rasulullah SAW",
    "perawi_melayu": "Diceritakan oleh Abu Salamah bin 'Abdur-Rahman dan Abu 'Abdullah Al-Agharr, bekas hamba sahaya daripada kalangan kaum Juhani, yang merupakan antara sahabat Abu Hurairah, bahawa mereka mendengar Abu Hurairah berkata:",
    "english_text": "\"One prayer in the Masjid of the  Messenger of Allah (ﷺ) is better than one thousand prayers offered in other mosques, except Al-Masjid Al-Haram, for the Messenger of Allah (ﷺ) was the last of the prophets and his Masjid was the last of the Masjids.\" Abu Salamah and Abu 'Abdullah said: \"We do not doubt that Abu Hurairah was speaking on the basis of the Hadith of the Messenger of Allah (ﷺ), but we could not verify that Hadith with Abu Hurairah before he died. Then we remembered that and we blamed one another for not having spoken to Abu Hurairah about that, so that he could attribute it to the Messenger of Allah (ﷺ) if he had indeed heard it from him. While we were arguing, we went and sat down with 'Abdullah bin Ibrahim bin Qariz, and we told him about the Hadith and how we had been negligent in not checking it with Abu Hurairah. 'Abdullah bin Ibrahim said to us: 'I bear witness that I heard Abu Hurairah say: The Messenger of Allah (ﷺ) said: I am the last of the prophets and it is the last of the Masjids.'\"",
    "arabic_text": "أَخْبَرَنَا كَثِيرُ بْنُ عُبَيْدٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، عَنِ الزُّبَيْدِيِّ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، وَأَبِي عَبْدِ اللَّهِ الأَغَرِّ، مَوْلَى الْجُهَنِيِّينَ وَكَانَا مِنْ أَصْحَابِ أَبِي هُرَيْرَةَ أَنَّهُمَا سَمِعَا أَبَا هُرَيْرَةَ يَقُولُ صَلاَةٌ فِي مَسْجِدِ رَسُولِ اللَّهِ صلى الله عليه وسلم أَفْضَلُ مِنْ أَلْفِ صَلاَةٍ فِيمَا سِوَاهُ مِنَ الْمَسَاجِدِ إِلاَّ الْمَسْجِدَ الْحَرَامَ فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم آخِرُ الأَنْبِيَاءِ وَمَسْجِدُهُ آخِرُ الْمَسَاجِدِ ‏.‏ قَالَ أَبُو سَلَمَةَ وَأَبُو عَبْدِ اللَّهِ لَمْ نَشُكَّ أَنَّ أَبَا هُرَيْرَةَ كَانَ يَقُولُ عَنْ حَدِيثِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَمُنِعْنَا أَنْ نَسْتَثْبِتَ أَبَا هُرَيْرَةَ فِي ذَلِكَ الْحَدِيثِ حَتَّى إِذَا تُوُفِّيَ أَبُو هُرَيْرَةَ ذَكَرْنَا ذَلِكَ وَتَلاَوَمْنَا أَنْ لاَ نَكُونَ كَلَّمْنَا أَبَا هُرَيْرَةَ فِي ذَلِكَ حَتَّى يُسْنِدَهُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم إِنْ كَانَ سَمِعَهُ مِنْهُ فَبَيْنَا نَحْنُ عَلَى ذَلِكَ جَالَسْنَا عَبْدَ اللَّهِ بْنَ إِبْرَاهِيمَ بْنِ قَارِظٍ فَذَكَرْنَا ذَلِكَ الْحَدِيثَ وَالَّذِي فَرَّطْنَا فِيهِ مِنْ نَصِّ أَبِي هُرَيْرَةَ فَقَالَ لَنَا عَبْدُ اللَّهِ بْنُ إِبْرَاهِيمَ أَشْهَدُ أَنِّي سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ فَإِنِّي آخِرُ الأَنْبِيَاءِ وَإِنَّهُ آخِرُ الْمَسَاجِدِ ‏\"‏ ‏.‏",
    "malay_translation": "Solat di Masjid Nabi SAW lebih utama daripada seribu solat di masjid lain, kecuali Masjidil Haram. Kerana, Rasulullah SAW adalah Nabi terakhir dan Masjidnya adalah Masjid terakhir."
  },
  {
    "id": 15433,
    "hadith_number": 697,
    "tajuk_hadith": "Taman Syurga di Antara Rumah dan Mimbar Rasulullah SAW",
    "perawi_melayu": "Diceritakan oleh Abdullah bin Zaid berkata:",
    "english_text": "\"The Messenger of Allah (ﷺ) said: 'The area between my house and my Minbar is one of the gardens of Paradise.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا بَيْنَ بَيْتِي وَمِنْبَرِي رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, 'Kawasan di antara rumahku dan mimbarku adalah salah satu taman syurga.' "
  },
  {
    "id": 15434,
    "hadith_number": 698,
    "tajuk_hadith": "Tiang-tiang Mimbarku di Syurga",
    "perawi_melayu": "Daripada Umm Salamah, bahawa Nabi SAW bersabda:",
    "english_text": "\"The columns of this Minbar of mine will be in Paradise.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمَّارٍ الدُّهْنِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ قَوَائِمَ مِنْبَرِي هَذَا رَوَاتِبُ فِي الْجَنَّةِ ‏\"‏ ‏.‏",
    "malay_translation": "“Sesungguhnya tiang-tiang mimbarku ini akan menjadi tempat pahala di Syurga.”"
  },
  {
    "id": 15435,
    "hadith_number": 699,
    "tajuk_hadith": "Masjid Rasulullah SAW dan Masjid Quba'",
    "perawi_melayu": "Diceritakan oleh Ibnu Abi Sa'eed Al-Khudri daripada bapanya yang berkata:",
    "english_text": "\"Dua orang lelaki berbantah tentang Masjid yang didirikan atas dasar ketakwaan dari hari pertama. Seorang lelaki berkata bahawa ia adalah Masjid Quba', dan yang lain berkata bahawa ia adalah Masjid Rasulullah SAW. Rasulullah SAW bersabda: 'Ini adalah Masjid-Ku.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عِمْرَانَ بْنِ أَبِي أَنَسٍ، عَنِ ابْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنْ أَبِيهِ، قَالَ تَمَارَى رَجُلاَنِ فِي الْمَسْجِدِ الَّذِي أُسِّسَ عَلَى التَّقْوَى مِنْ أَوَّلِ يَوْمٍ فَقَالَ رَجُلٌ هُوَ مَسْجِدُ قُبَاءٍ وَقَالَ الآخَرُ هُوَ مَسْجِدُ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ هُوَ مَسْجِدِي هَذَا ‏\"‏ ‏.‏",
    "malay_translation": "Dua orang lelaki berbantah tentang masjid yang dibina atas dasar ketakwaan dari hari pertama. Seorang berkata ia Masjid Quba', dan yang lain berkata ia Masjid Rasulullah SAW. Rasulullah SAW bersabda: 'Ini masjid-Ku.' (At-Tawbah 9:108)"
  },
  {
    "id": 15436,
    "hadith_number": 700,
    "tajuk_hadith": "Ketibaan Rasulullah SAW ke Quba' dengan Menunggang dan berjalan kaki",
    "perawi_melayu": "Telah diriwayatkan oleh Ibn 'Umar bahawa:",
    "english_text": "\"Rasulullah SAW sering mengunjungi Quba' sambil menunggang dan berjalan kaki.\"\n\n Quba' terletak kira-kira tiga batu di selatan Masjid Nabawi. Kawasan ini dinamakan sempena.",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَأْتِي قُبَاءً رَاكِبًا وَمَاشِيًا ‏.‏",
    "malay_translation": "Rasulullah SAW sering mengunjungi Quba' sambil menunggang dan berjalan kaki. Quba' terletak kira-kira tiga batu di selatan Masjid Nabawi. Kawasan ini dinamakan sempena."
  },
  {
    "id": 15437,
    "hadith_number": 701,
    "tajuk_hadith": "Keutamaan Solat di Masjid Quba', Setaraf dengan Umrah",
    "perawi_melayu": "Abu Umamah bin Sahl bin Hunaif berkata:",
    "english_text": "\"My father said: 'The Messenger of Allah (ﷺ) said: 'Whoever goes out to his Masjid - the Masjid of Quba' and prays therein, that will be equivalent to 'Umrah.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا مُجَمِّعُ بْنُ يَعْقُوبَ، عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ الْكِرْمَانِيِّ، قَالَ سَمِعْتُ أَبَا أُمَامَةَ بْنَ سَهْلِ بْنِ حُنَيْفٍ، قَالَ قَالَ أَبِي قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ خَرَجَ حَتَّى يَأْتِيَ هَذَا الْمَسْجِدَ مَسْجِدَ قُبَاءٍ فَصَلَّى فِيهِ كَانَ لَهُ عِدْلَ عُمْرَةٍ ‏\"‏ ‏.‏",
    "malay_translation": "Bapakku berkata: 'Rasulullah SAW bersabda, 'Barangsiapa keluar rumah untuk pergi ke Masjid Quba' dan menunaikan solat di dalamnya, maka pahalanya setara dengan umrah.'"
  },
  {
    "id": 15438,
    "hadith_number": 702,
    "tajuk_hadith": "Larangan Mengikat Kenderaan kecuali ke Tiga Masjid",
    "perawi_melayu": "Daripada Abu Hurairah, Rasulullah SAW bersabda:",
    "english_text": "\"Mounts are not saddled for except to (travel to) three Masjids: Al-Masjid Al-Haram, this Masjid of mine, and Al-Masjid Al-Aqsa.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تُشَدُّ الرِّحَالُ إِلاَّ إِلَى ثَلاَثَةِ مَسَاجِدَ مَسْجِدِ الْحَرَامِ وَمَسْجِدِي هَذَا وَمَسْجِدِ الأَقْصَى ‏\"‏ ‏.‏",
    "malay_translation": "Tidak dibenarkan mengikat kenderaan kecuali untuk pergi ke tiga masjid: Masjidil Haram, masjid ini (masjid Nabi), dan Masjidil Aqsa."
  },
  {
    "id": 15439,
    "hadith_number": 703,
    "tajuk_hadith": "Penukaran Gereja kepada Masjid dan Kisah Paderi Tayyi',",
    "perawi_melayu": "Dikisahkan oleh Talq bin 'Ali bahawa:",
    "english_text": "\"We went out as a delegation to the Prophet (ﷺ); we gave him our oath of allegiance and prayed with him. We told him that in our land there was a church that belonged to us. We asked him to give us the leftovers of his purification (Wudu' water). So he called for water, performed Wudu' and rinsed out his mouth, then he poured it into a vessel and said to us: 'Leave, and when you return to your land, demolish your church, and sprinkle this water on that place, and take it as a Masjid.' We said: 'Our land is far away and it is very hot; the water is far away and it is very hot; the water will dry up.' He said: 'Add more water to it, for that will only make it better.' So we left and when we came to our land we demolished our church, then we sprinkled the water on that place and took it as a Masjid, and we called the Adhan in it. The monk was a man from Tayy', and when he heard the Adhan, he said: 'It is a true call.' Then he headed toward one of the hills and we never saw him again.\"",
    "arabic_text": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، عَنْ مُلاَزِمٍ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بَدْرٍ، عَنْ قَيْسِ بْنِ طَلْقٍ، عَنْ أَبِيهِ، طَلْقِ بْنِ عَلِيٍّ قَالَ خَرَجْنَا وَفْدًا إِلَى النَّبِيِّ صلى الله عليه وسلم فَبَايَعْنَاهُ وَصَلَّيْنَا مَعَهُ وَأَخْبَرْنَاهُ أَنَّ بِأَرْضِنَا بِيعَةً لَنَا فَاسْتَوْهَبْنَاهُ مِنْ فَضْلِ طَهُورِهِ فَدَعَا بِمَاءٍ فَتَوَضَّأَ وَتَمَضْمَضَ ثُمَّ صَبَّهُ فِي إِدَاوَةٍ وَأَمَرَنَا فَقَالَ ‏\"‏ اخْرُجُوا فَإِذَا أَتَيْتُمْ أَرْضَكُمْ فَاكْسِرُوا بِيعَتَكُمْ وَانْضَحُوا مَكَانَهَا بِهَذَا الْمَاءِ وَاتَّخِذُوهَا مَسْجِدًا ‏\"‏ ‏.‏ قُلْنَا إِنَّ الْبَلَدَ بَعِيدٌ وَالْحَرَّ شَدِيدٌ وَالْمَاءَ يَنْشَفُ ‏.‏ فَقَالَ ‏\"‏ مُدُّوهُ مِنَ الْمَاءِ فَإِنَّهُ لاَ يَزِيدُهُ إِلاَّ طِيبًا ‏\"‏ ‏.‏ فَخَرَجْنَا حَتَّى قَدِمْنَا بَلَدَنَا فَكَسَرْنَا بِيعَتَنَا ثُمَّ نَضَحْنَا مَكَانَهَا وَاتَّخَذْنَاهَا مَسْجِدًا فَنَادَيْنَا فِيهِ بِالأَذَانِ ‏.‏ قَالَ وَالرَّاهِبُ رَجُلٌ مِنْ طَيِّئٍ فَلَمَّا سَمِعَ الأَذَانَ قَالَ دَعْوَةُ حَقٍّ ‏.‏ ثُمَّ اسْتَقْبَلَ تَلْعَةً مِنْ تِلاَعِنَا فَلَمْ نَرَهُ بَعْدُ ‏.‏",
    "malay_translation": "Peristiwa pemindahan gereja kepada masjid dan kisah seorang sami dari Bani Tayyi' \n\nDikisahkan oleh Talq bin 'Ali bahawa kami pergi sebagai rombongan kepada Nabi SAW. Kami memberi bai'ah dan solat bersama baginda. Kami memberitahu baginda bahawa di tanah kami terdapat sebuah gereja milik kami. Kami meminta sisa air wuduk baginda. Baginda meminta air, lalu berwuduk dan membilas mulut. Kemudian, baginda menuangkan air ke dalam bekas dan bersabda, 'Pergilah. Apabila sampai di tanah kamu, runtuhkan gereja kamu, siramkan air ini ke tempat itu, dan jadikan ia sebagai masjid.' Kami berkata, 'Tanah kami jauh dan panas. Air juga jauh dan akan kering.' Baginda menjawab, 'Tambahkan air, ia hanya akan menjadi lebih baik.' Maka kami pun pergi, dan setelah sampai di tanah kami, kami runtuhkan gereja itu, siramkan air di situ, dan jadikan ia sebagai masjid. Kami menunaikan azan di dalamnya. Sami tersebut seorang lelaki dari Bani Tayyi'. Apabila dia mendengar azan, dia berkata, 'Ia adalah seruan yang benar.' Kemudian, dia menuju ke salah satu bukit dan kami tidak pernah melihatnya lagi."
  },
  {
    "id": 15440,
    "hadith_number": 704,
    "tajuk_hadith": "Ketibaan Rasulullah SAW di Madinah dan Pembinaan Masjid",
    "perawi_melayu": "Dikisahkan oleh Anas bin Malik berkata:",
    "english_text": "\"When the Messenger of Allah (ﷺ) came to Al-Madinah, he alighted in the upper part of Al-Madinah among the tribe called Banu 'Amr bin 'Awf and he stayed with them for fourteen nights. Then he sent for the chiefs of Banu An-Najjar, and they came with their swords by their sides. It is as if I can see the Messenger of Allah (ﷺ) on his she-camel with Abu Bakr riding behind him (on the same camel) and the chiefs of Banu An-Najjar around him, until he dismounted in the courtyard of Abu Ayyub. The Prophet (ﷺ) used to offer the prayer wherever he was when the time for prayer came, and he would pray even in sheepfolds. Then he ordered that the Masjid be built. He sent for the chiefs of Banu An-Najjar, and when they came, he said: 'O Banu An-Najjar, name me a price for this grove of yours.' They said: 'By Allah, we will not ask for its price except from Allah.'\" Anas said: \"In (that grove) there were graves of idolators, ruins and date-palm trees. The Messenger of Allah (ﷺ) ordered that the graves of the idolators be dug up, the ruins be leveled and the date-palm trees be cut down. The trunks of the trees were arranged so as to form the walls facing the Qiblah. The stone pillars were built at the sides of its gate. They started to move the stones, reciting some lines of verse, and the Messenger of Allah (ﷺ) was with them when they were saying: 'O Allah! There is no good except the good of the Hereafter. So bestow victory on the Ansar and the Muhajirin.'\"",
    "arabic_text": "أَخْبَرَنَا عِمْرَانُ بْنُ مُوسَى، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ أَبِي التَّيَّاحِ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ لَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم نَزَلَ فِي عُرْضِ الْمَدِينَةِ فِي حَىٍّ يُقَالُ لَهُمْ بَنُو عَمْرِو بْنِ عَوْفٍ فَأَقَامَ فِيهِمْ أَرْبَعَ عَشْرَةَ لَيْلَةً ثُمَّ أَرْسَلَ إِلَى مَلإٍ مِنْ بَنِي النَّجَّارِ فَجَاءُوا مُتَقَلِّدِي سُيُوفِهِمْ كَأَنِّي أَنْظُرُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى رَاحِلَتِهِ وَأَبُو بَكْرٍ - رضى الله عنه - رَدِيفُهُ وَمَلأٌ مِنْ بَنِي النَّجَّارِ حَوْلَهُ حَتَّى أَلْقَى بِفِنَاءِ أَبِي أَيُّوبَ وَكَانَ يُصَلِّي حَيْثُ أَدْرَكَتْهُ الصَّلاَةُ فَيُصَلِّي فِي مَرَابِضِ الْغَنَمِ ثُمَّ أُمِرَ بِالْمَسْجِدِ فَأَرْسَلَ إِلَى مَلإٍ مِنْ بَنِي النَّجَّارِ فَجَاءُوا فَقَالَ ‏\n\"‏ يَا بَنِي النَّجَّارِ ثَامِنُونِي بِحَائِطِكُمْ هَذَا ‏\"‏ ‏.‏ قَالُوا وَاللَّهُ لاَ نَطْلُبُ ثَمَنَهُ إِلاَّ إِلَى اللَّهِ عَزَّ وَجَلَّ ‏.‏ قَالَ أَنَسٌ وَكَانَتْ فِيهِ قُبُورُ الْمُشْرِكِينَ وَكَانَتْ فِيهِ خَرِبٌ وَكَانَ فِيهِ نَخْلٌ فَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِقُبُورِ الْمُشْرِكِينَ فَنُبِشَتْ وَبِالنَّخْلِ فَقُطِعَتْ وَبِالْخَرِبِ فَسُوِّيَتْ فَصَفُّوا النَّخْلَ قِبْلَةَ الْمَسْجِدِ وَجَعَلُوا عِضَادَتَيْهِ الْحِجَارَةَ وَجَعَلُوا يَنْقُلُونَ الصَّخْرَ وَهُمْ يَرْتَجِزُونَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم مَعَهُمْ وَهُمْ يَقُولُونَ اللَّهُمَّ لاَ خَيْرَ إِلاَّ خَيْرُ الآخِرَةِ فَانْصُرِ الأَنْصَارَ وَالْمُهَاجِرَةَ",
    "malay_translation": "Dikisahkan bahawa Rasulullah SAW menetap di kawasan Banu 'Amr bin 'Awf di Madinah selama empat belas malam. Kemudian baginda memanggil ketua-ketua Banu An-Najjar, dan mereka datang dengan pedang mereka. Rasanya seperti saya dapat melihat Rasulullah SAW di atas untanya, dengan Abu Bakar di belakangnya, dan ketua-ketua Banu An-Najjar mengelilinginya, sehingga baginda turun di halaman rumah Abu Ayyub. Nabi SAW sentiasa menunaikan solat di mana sahaja waktu solat tiba, malah di tempat-tempat ternakan kambing. Kemudian baginda memerintahkan pembinaan masjid. Baginda memanggil ketua-ketua Banu An-Najjar dan bertanya, \"Berapa harga kebun ini?\" Mereka menjawab, \"Demi Allah, kami tidak akan meminta harganya melainkan daripada Allah.\" Anas meriwayatkan bahawa terdapat kubur orang-orang musyrik, runtuhan, dan pokok-pokok kurma di kebun tersebut. Rasulullah SAW memerintahkan agar kubur orang-orang musyrik digali, runtuhan dirapatkan dan pokok kurma ditebang. Batang pokok-pokok itu disusun untuk membentuk dinding menghadap kiblat. Tiang batu diletakkan di sisi pintu masuk. Mereka mula menggerakkan batu-batu sambil membaca beberapa bait syair, dan Rasulullah SAW berada bersama mereka ketika mereka berdoa, \"Ya Allah, tiada kebaikan melainkan kebaikan akhirat. Jadi berikan kemenangan kepada Ansar dan Muhajirin.\""
  },
  {
    "id": 15441,
    "hadith_number": 705,
    "tajuk_hadith": "Kutuk Allah SWT terhadap Yahudi dan Kristian yang menjadikan kubur Nabi-nabi mereka sebagai tempat ibadat",
    "perawi_melayu": "'Ubaidullah bin 'Abdullah meriwayatkan daripada 'Aishah dan Ibn 'Abbas berkata:",
    "english_text": "\"When the Messenger of Allah (ﷺ) was on his deathbed, he had a Khamisah over his face. When his temperature rose, he would uncover his face. When his temperature rose, he would uncover his face. While he was like that he said: 'May Allah curse the Jews and Christians, for they took the graves of their Prophets as places of worship.'\"",
    "arabic_text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ مَعْمَرٍ، وَيُونُسَ، قَالاَ قَالَ الزُّهْرِيُّ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، أَنَّ عَائِشَةَ، وَابْنَ، عَبَّاسٍ قَالاَ لَمَّا نُزِلَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم فَطَفِقَ يَطْرَحُ خَمِيصَةً لَهُ عَلَى وَجْهِهِ فَإِذَا اغْتَمَّ كَشَفَهَا عَنْ وَجْهِهِ قَالَ وَهُوَ كَذَلِكَ ‏\n\"‏ لَعْنَةُ اللَّهِ عَلَى الْيَهُودِ وَالنَّصَارَى اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ ‏\"‏ ‏.‏",
    "malay_translation": "Ketika Rasulullah SAW berada di atas ranjang kematian, beliau menutup wajah dengan sehelai kain Khamisah.  Apabila suhu tubuhnya meningkat, beliau akan membuka wajahnya.  Ketika keadaan ini berlangsung, baginda bersabda: \"Semoga Allah melaknat orang Yahudi dan Kristian, kerana mereka menjadikan kubur nabi-nabi mereka sebagai tempat ibadah.\""
  },
  {
    "id": 15442,
    "hadith_number": 706,
    "tajuk_hadith": "Peringatan Mengenai Penghormatan Kubur dengan Gambar dan Patung",
    "perawi_melayu": "Daripada 'Aishah, bahawa Umm Habibah dan Umm Salamah menceritakan tentang sebuah gereja yang mereka lihat di Habsyah, yang di dalamnya terdapat ukiran gambar. Rasulullah SAW bersabda:",
    "english_text": "\"Those people, if there was a righteous man among them, when he died they built a place of worship over his grave and made those images. They will be the most evil of creation before Allah on the Day of Resurrection.\"",
    "arabic_text": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، قَالَ حَدَّثَنِي أَبِي، عَنْ عَائِشَةَ، أَنَّ أُمَّ حَبِيبَةَ، وَأُمَّ سَلَمَةَ ذَكَرَتَا كَنِيسَةً رَأَتَاهَا بِالْحَبَشَةِ فِيهَا تَصَاوِيرُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ أُولَئِكَ إِذَا كَانَ فِيهِمُ الرَّجُلُ الصَّالِحُ فَمَاتَ بَنَوْا عَلَى قَبْرِهِ مَسْجِدًا وَصَوَّرُوا تِيكَ الصُّوَرَ أُولَئِكَ شِرَارُ الْخَلْقِ عِنْدَ اللَّهِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Orang-orang tersebut, jika di antara mereka ada seorang lelaki yang soleh, apabila dia meninggal dunia, mereka membina sebuah tempat ibadat di atas kuburnya dan melukis gambar-gambar tersebut. Mereka akan menjadi makhluk yang paling jahat di sisi Allah pada Hari Kiamat."
  },
  {
    "id": 15443,
    "hadith_number": 707,
    "tajuk_hadith": "Kebaikan Perjalanan ke Masjid",
    "perawi_melayu": "Daripada Abu Hurairah, dari Nabi SAW:",
    "english_text": "\"When a man goes out of his house to his Masjid, one foot records a good deed and the other erases a bad deed.\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، قَالَ حَدَّثَنَا الأَسْوَدُ بْنُ الْعَلاَءِ بْنِ جَارِيَةَ الثَّقَفِيُّ، عَنْ أَبِي سَلَمَةَ، - هُوَ ابْنُ عَبْدِ الرَّحْمَنِ - عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ حِينَ يَخْرُجُ الرَّجُلُ مِنْ بَيْتِهِ إِلَى مَسْجِدِهِ فَرِجْلٌ تُكْتَبُ حَسَنَةً وَرِجْلٌ تَمْحُو سَيِّئَةً ‏\"‏ ‏.‏",
    "malay_translation": "Apabila seorang lelaki keluar dari rumahnya menuju masjidnya, maka satu kakinya akan mencatatkan satu amalan kebaikan, dan kaki yang lain akan menghapuskan satu amalan buruk."
  },
  {
    "id": 15444,
    "hadith_number": 708,
    "tajuk_hadith": "Kebebasan Wanita Menghadiri Masjid",
    "perawi_melayu": "Diceritakan oleh Salim daripada bapanya, yang berkata:",
    "english_text": "\"The Messenger of Allah (ﷺ) said: 'When the wife of any one of you asks for permission to go to the Masjid, do not stop her.'\"",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا اسْتَأْذَنَتِ امْرَأَةُ أَحَدِكُمْ إِلَى الْمَسْجِدِ فَلاَ يَمْنَعْهَا ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Jika isteri salah seorang daripada kamu meminta izin untuk pergi ke Masjid, janganlah kamu menghalanginya.\""
  },
  {
    "id": 15445,
    "hadith_number": 709,
    "tajuk_hadith": "Larangan Mendekati Masjid bagi yang Makan Bawang Putih, Bawang Merah dan Bawang Daun",
    "perawi_melayu": "Dikisahkan bahawa Jabir telah berkata:",
    "english_text": "\"The Messenger of Allah (ﷺ) said: 'Whoever eats of this plant' - the first time he said 'garlic' then he said, 'garlic, onions and leeks'  - 'let him not approach us in our Masjids, for the angels are offended by that which offends mankinds.'\"\n\n In Fath, Al-Bari, Ibn Hajar is of the opinion that it was Ibn Juraij who was talking, explaining that 'Ata' - who reported it from Jabir - narrated it both ways.",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنِ ابْنِ جُرَيْجٍ، قَالَ حَدَّثَنَا عَطَاءٌ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ ‏\"‏ ‏.‏ قَالَ أَوَّلَ يَوْمٍ ‏\"‏ الثُّومِ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ الثُّومِ وَالْبَصَلِ وَالْكُرَّاثِ فَلاَ يَقْرَبْنَا فِي مَسَاجِدِنَا فَإِنَّ الْمَلاَئِكَةَ تَتَأَذَّى مِمَّا يَتَأَذَّى مِنْهُ الإِنْسُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Barangsiapa yang memakan tumbuh-tumbuhan ini – pada mulanya baginda menyebut 'bawang putih', kemudian baginda menyebut 'bawang putih, bawang merah dan bawang daun' – maka janganlah dia mendekati masjid kita. Kerana malaikat merasa keberatan dengan sesuatu yang menyusahkan manusia.\"\n\nDalam kitab Fath al-Bari, Ibn Hajar berpendapat bahawa yang berbicara adalah Ibn Juraij, menjelaskan bahawa 'Ata', yang meriwayatkan hadis ini dari Jabir, telah meriwayatkannya dengan dua cara."
  },
  {
    "id": 15446,
    "hadith_number": 710,
    "tajuk_hadith": "Larangan Makan Bawang Putih dan Bawang Merah dan Hukumnya",
    "perawi_melayu": "Daripada Ma'dan bin Abi Talhah yang meriwayatkan daripada 'Umar bin Al-Khattab bahawa:",
    "english_text": "\"O people, you eat of two plants which I do not think are anything but bad, this onion and garlic. I have seen the Prophet of Allah (ﷺ), if he noticed their smell coming from a man, ordering that he be taken out to Al-Baqi'. Whoever eats them, let him cook them to death.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا هِشَامٌ، قَالَ حَدَّثَنَا قَتَادَةُ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ إِنَّكُمْ أَيُّهَا النَّاسُ تَأْكُلُونَ مِنْ شَجَرَتَيْنِ مَا أُرَاهُمَا إِلاَّ خَبِيثَتَيْنِ هَذَا الْبَصَلُ وَالثُّومُ وَلَقَدْ رَأَيْتُ نَبِيَّ اللَّهِ صلى الله عليه وسلم إِذَا وَجَدَ رِيحَهُمَا مِنَ الرَّجُلِ أَمَرَ بِهِ فَأُخْرِجَ إِلَى الْبَقِيعِ فَمَنْ أَكَلَهُمَا فَلْيُمِتْهُمَا طَبْخًا ‏.‏",
    "malay_translation": "Wahai sekalian manusia, kamu makan dua jenis tumbuhan yang aku anggap tidak baik, iaitu bawang putih dan bawang merah. Aku pernah melihat Rasulullah SAW sekiranya mencium bau keduanya dari seseorang, baginda memerintahkan agar dia dikeluarkan ke Al-Baqi'. Barangsiapa yang memakannya, hendaklah ia memasaknya sehingga masak."
  },
  {
    "id": 15447,
    "hadith_number": 711,
    "tajuk_hadith": "Keutamaan I'tikaf dan Penolakan I'tikaf di Bulan Ramadan",
    "perawi_melayu": "'Aishah رضي الله عنها meriwayatkan:",
    "english_text": "\"When the Messenger of Allah (ﷺ) wanted to observe I'tikaf,  he would pray Fajr then enter the place where he wnated to observe I'tikaf. He wanted to observe I'tikaf during the last ten days of Ramadan, so he commanded that a Khiba' (tent) be pitched for him. Then Hafsah ordered that a Khiba' be pitched for her, and when Zainab saw her tent she ordered that a Khiba' be pitched for her too. When the Messenger of Allah (ﷺ) saw that he said: 'Is it righteousness that you seek?' And he did not observe I'tikaf in Ramadan, and observed I'tikaf for ten days in Shawwal (instead).\"\n\n Al-Khiba': \"One of the house of the Bedouins made of Wabir (camel or goat fur) or wool, not of hair (from other pelts). And it would have two or three posts.\" (An-Nihayah)\n\n Seclusion in the Masjid for the sake of devotion to Allah.",
    "arabic_text": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا يَعْلَى، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَرَادَ أَنْ يَعْتَكِفَ صَلَّى الصُّبْحَ ثُمَّ دَخَلَ فِي الْمَكَانِ الَّذِي يُرِيدُ أَنْ يَعْتَكِفَ فِيهِ فَأَرَادَ أَنْ يَعْتَكِفَ الْعَشْرَ الأَوَاخِرَ مِنْ رَمَضَانَ فَأَمَرَ فَضُرِبَ لَهُ خِبَاءٌ وَأَمَرَتْ حَفْصَةُ فَضُرِبَ لَهَا خِبَاءٌ فَلَمَّا رَأَتْ زَيْنَبُ خِبَاءَهَا أَمَرَتْ فَضُرِبَ لَهَا خِبَاءٌ فَلَمَّا رَأَى ذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ آلْبِرَّ تُرِدْنَ ‏\"‏ ‏.‏ فَلَمْ يَعْتَكِفْ فِي رَمَضَانَ وَاعْتَكَفَ عَشْرًا مِنْ شَوَّالٍ ‏.‏",
    "malay_translation": "Daripada 'Aishah رضي الله عنها, beliau meriwayatkan: \"Apabila Rasulullah SAW ingin ber-i'tikaf, Baginda akan menunaikan solat Subuh kemudian memasuki tempat yang ingin di-i'tikafkan. Baginda ingin ber-i'tikaf pada sepuluh hari terakhir Ramadan, lalu Baginda memerintahkan agar khemah (Khiba') didirikan untuk Baginda. Kemudian Hafsah memerintahkan agar khemah didirikan untuknya, dan apabila Zainab melihat khemahnya, dia memerintahkan agar khemah didirikan untuknya juga.  Apabila Rasulullah SAW melihat hal itu, Baginda bersabda: 'Apakah kebaikan yang kamu cari?'. Baginda tidak ber-i'tikaf di bulan Ramadan dan ber-i'tikaf selama sepuluh hari di bulan Syawal sebaliknya.\" \n\nAl-Khiba': \"Salah satu jenis rumah penduduk pedalaman yang terbuat dari bulu unta atau kambing, atau bulu biri-biri, bukan dari bulu binatang lain. Dan ia akan mempunyai dua atau tiga tiang.\" (An-Nihayah)\n\nI'tikaf adalah pengasingan diri di Masjid untuk mendekatkan diri kepada Allah."
  },
  {
    "id": 15448,
    "hadith_number": 712,
    "tajuk_hadith": "Perawatan Rasulullah SAW Kepada Said bin Zaid di Pertempuran Khandaq",
    "perawi_melayu": "Dikisahkan oleh 'Aishah:",
    "english_text": "\"Sa'd was wounded on the day of Al-Khandaq  when a man of Quraish shot him in the medial arm vein. The Messenger of Allah (ﷺ) pitched a tent (Khaimah) for him in the Masjid so that he could visit him close at hand.\"\n\n Al-Khandaq means the trench. This indicates the battle of the trench which took place during the fifth year after Hijrah.",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ أُصِيبَ سَعْدٌ يَوْمَ الْخَنْدَقِ رَمَاهُ رَجُلٌ مِنْ قُرَيْشٍ رَمْيَةً فِي الأَكْحَلِ فَضَرَبَ عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم خَيْمَةً فِي الْمَسْجِدِ لِيَعُودَهُ مِنْ قَرِيبٍ ‏.‏",
    "malay_translation": "Diriwayatkan oleh 'Aishah, \"Pada hari Pertempuran Khandaq, Said bin Zaid terluka ketika seorang lelaki dari Quraisy melukainya di urat lengan tengah. Rasulullah SAW pun mendirikan khemah (khaimah) untuknya di Masjid agar dapat menjenguknya dengan mudah.\"\n\nKhandaq bermaksud parit.  Ini merujuk kepada pertempuran parit yang berlaku pada tahun kelima Hijrah."
  },
  {
    "id": 15449,
    "hadith_number": 713,
    "tajuk_hadith": "Rasulullah SAW Mengangkat Anak Kecil Semasa Solat",
    "perawi_melayu": "'Amr bin Sulaim Az-Zuraqi meriwayatkan daripada Abu Qatadah bahawa:",
    "english_text": "\"While we were sitting in the Masjid. The Messenger of Allah (ﷺ) came out to us carrying Umamah bint Abi Al-'As bin Ar-Rabi', whose mother was Zainab, the daughter of the Messenger of Allah (ﷺ). She was a little girl and he was carrying her. The Messenger of Allah (ﷺ) prayed with her on his shoulder, putting her down when he bowed and picking her up again when he stood up, until he completed his prayer.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ، أَنَّهُ سَمِعَ أَبَا قَتَادَةَ، يَقُولُ بَيْنَا نَحْنُ جُلُوسٌ فِي الْمَسْجِدِ إِذْ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَحْمِلُ أُمَامَةَ بِنْتَ أَبِي الْعَاصِ بْنِ الرَّبِيعِ وَأُمُّهَا زَيْنَبُ بِنْتُ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهِيَ صَبِيَّةٌ يَحْمِلُهَا فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم وَهِيَ عَلَى عَاتِقِهِ يَضَعُهَا إِذَا رَكَعَ وَيُعِيدُهَا إِذَا قَامَ حَتَّى قَضَى صَلاَتَهُ يَفْعَلُ ذَلِكَ بِهَا ‏.‏",
    "malay_translation": "Telah diceritakan kepada kami oleh Qatadah, beliau berkata, telah menceritakan kepada kami oleh Laith, daripada Said bin Abi Said, daripada 'Amr bin Sulaim Az-Zuraqi, bahawa dia mendengar Abu Qatadah berkata, \"Ketika kami sedang duduk di masjid, tiba-tiba Rasulullah SAW keluar menemui kami sambil membawa Umamah binti Abi Al-'As bin Ar-Rabi', yang ibunya ialah Zainab binti Rasulullah SAW.  Dia seorang kanak-kanak perempuan, dan Rasulullah SAW membawanya. Baginda SAW menunaikan solat sambil membawa kanak-kanak perempuan itu di bahu baginda. Baginda meletakkan dia ketika rukuk dan mengangkatnya semula ketika bangun, sehinggalah selesai solat.\""
  },
  {
    "id": 15450,
    "hadith_number": 714,
    "tajuk_hadith": "Pengikat Thumamah bin Uthal di Tiang Masjid",
    "perawi_melayu": "Dikisahkan oleh Sa'eed bin Abi Sa'eed, beliau mendengar Abu Hurairah berkata:",
    "english_text": "\"The Messenger of Allah (ﷺ) sent some horsemen toward Najd, and they brought back a man from Banu Hanifah who was called Thumamah bin Uthal, the chief of the people of Al-Yamamah. Then he was tied to one of the pillars of the Masjid.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم خَيْلاً قِبَلَ نَجْدٍ فَجَاءَتْ بِرَجُلٍ مِنْ بَنِي حَنِيفَةَ يُقَالُ لَهُ ثُمَامَةُ بْنُ أُثَالٍ سَيِّدُ أَهْلِ الْيَمَامَةِ فَرُبِطَ بِسَارِيَةٍ مِنْ سَوَارِي الْمَسْجِدِ ‏.‏ مُخْتَصَرٌ ‏.‏",
    "malay_translation": "Rasulullah SAW menghantar pasukan berkuda ke arah Najd, dan mereka membawa kembali seorang lelaki daripada Bani Hanifah yang dikenali sebagai Thumamah bin Uthal, ketua kaum Al-Yamamah. Kemudian, dia diikat pada salah satu tiang masjid."
  },
  {
    "id": 15451,
    "hadith_number": 715,
    "tajuk_hadith": "Rasulullah SAW Melakukan Tawaf di Atas Unta dan Menyentuh Rukun dengan Tongkat",
    "perawi_melayu": "Diriwayatkan dari Abdullah bin Abbas RA",
    "english_text": "It was narrated from 'Abdullah bin 'Abbas that the Messenger of Allah (ﷺ) performed Tawaf during the Farewell Pilgrimage atop a camel, touching the Rukn  with a stick that was bent at the top.\n\n The corner of the Ka'bah in which the Black Stone is situated.",
    "arabic_text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ، عَنِ ابْنِ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم طَافَ فِي حَجَّةِ الْوَدَاعِ عَلَى بَعِيرٍ يَسْتَلِمُ الرُّكْنَ بِمِحْجَنٍ ‏.‏",
    "malay_translation": "Diriwayatkan daripada Abdullah bin Abbas RA bahawa Rasulullah SAW melakukan Tawaf semasa Haji Wida' di atas seekor unta, menyentuh Rukun (sudut Kaabah yang terletaknya Hajar Aswad) dengan sebatang tongkat yang bengkok di bahagian atasnya."
  },
  {
    "id": 15452,
    "hadith_number": 716,
    "tajuk_hadith": "Larangan Duduk dalam Bulatan pada Hari Jumaat dan Jual Beli di Masjid",
    "perawi_melayu": "'Amr bin Shu'aib, daripada ayahnya, daripada datuknya",
    "english_text": "It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that the Prophet (ﷺ) forbade sitting in circles on Friday before Jumu'ah prayer, and buying and selling in the Masjid.",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَخْبَرَنِي يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ عَجْلاَنَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ التَّحَلُّقِ يَوْمَ الْجُمُعَةِ قَبْلَ الصَّلاَةِ وَعَنِ الشِّرَاءِ وَالْبَيْعِ فِي الْمَسْجِدِ ‏.‏",
    "malay_translation": "Diriwayatkan daripada 'Amr bin Shu'aib, daripada ayahnya, daripada datuknya, bahawa Nabi ﷺ melarang daripada duduk dalam bulatan pada hari Jumaat sebelum solat Jumaat, dan daripada berjual beli di dalam masjid."
  },
  {
    "id": 15453,
    "hadith_number": 717,
    "tajuk_hadith": "Larangan Menyanyikan Puisi di Masjid",
    "perawi_melayu": "Dari 'Amr bin Shu'aib, daripada bapanya, daripada datuknya",
    "english_text": "It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that the Prophet (ﷺ) forbade reciting poetry in the Masjid.",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنِ ابْنِ عَجْلاَنَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ تَنَاشُدِ الأَشْعَارِ فِي الْمَسْجِدِ ‏.‏",
    "malay_translation": "Telah diriwayatkan daripada 'Amr bin Shu'aib, daripada bapanya, daripada datuknya, bahawa Nabi SAW melarang pembacaan puisi di dalam Masjid."
  },
  {
    "id": 15454,
    "hadith_number": 718,
    "tajuk_hadith": "Umar bin Al-Khattab dan Puisi Hassan bin Thabit di Masjid",
    "perawi_melayu": "Dikisahkan oleh Sa'eed bin Al-Musayyab",
    "english_text": "\"Umar passed by Hassan bin Thabit while he was reciting poetry in the Masjid, and glared at him. He said: 'I recited poetry when there was someone better than you in the Masjid.' Then he turned to Abu Hurairah and said: 'Did you not hear the Messenger of Allah (ﷺ) when he said: \"Answer back on my behalf. O Allah, help him with the Holy Spirit!'\" He said: 'Yes, by Allah.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، قَالَ مَرَّ عُمَرُ بِحَسَّانَ بْنِ ثَابِتٍ وَهُوَ يُنْشِدُ فِي الْمَسْجِدِ فَلَحَظَ إِلَيْهِ فَقَالَ قَدْ أَنْشَدْتُ وَفِيهِ مَنْ هُوَ خَيْرٌ مِنْكَ ثُمَّ الْتَفَتَ إِلَى أَبِي هُرَيْرَةَ فَقَالَ أَسَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ أَجِبْ عَنِّي اللَّهُمَّ أَيِّدْهُ بِرُوحِ الْقُدُسِ ‏\"‏ ‏.‏ قَالَ اللَّهُمَّ نَعَمْ ‏.‏",
    "malay_translation": "Umar bin Al-Khattab melalui Hassan bin Thabit ketika beliau sedang melafazkan puisi di masjid, dan beliau memandangnya tajam. Beliau berkata: 'Saya telah melafazkan puisi ketika ada orang yang lebih baik daripada engkau di dalam masjid.' Kemudian beliau menoleh kepada Abu Hurairah dan bertanya: 'Tidakkah engkau mendengar Rasulullah (ﷺ) bersabda: \"Jawablah bagi aku, Ya Allah, kuatkanlah dia dengan Roh Kudus!\"' Abu Hurairah menjawab, 'Ya, demi Allah.'"
  },
  {
    "id": 15455,
    "hadith_number": 719,
    "tajuk_hadith": "Larangan Mencari Barang Hilang di Dalam Masjid",
    "perawi_melayu": "Diriwayatkan daripada Jabir, beliau berkata:",
    "english_text": "\"A man came making announcement of a lost camel in the Masjid, and the Messenger of Allah (ﷺ) said: 'May you never find it!'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ وَهْبٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، عَنْ أَبِي عَبْدِ الرَّحِيمِ، قَالَ حَدَّثَنِي زَيْدُ بْنُ أَبِي أُنَيْسَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ جَاءَ رَجُلٌ يَنْشُدُ ضَالَّةً فِي الْمَسْجِدِ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ وَجَدْتَ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki datang mengumumkan kehilangan untanya di dalam Masjid, lalu Rasulullah (ﷺ) bersabda kepadanya: 'Semoga kamu tidak menemuinya!'"
  },
  {
    "id": 15456,
    "hadith_number": 720,
    "tajuk_hadith": "Larangan Membawa Anak Panah di Masjid dan Perintah Nabi SAW untuk Memegang Ujungnya",
    "perawi_melayu": "Sufyan berkata:",
    "english_text": "\"I said to 'Amr: 'Did you hear Jabir say: \"A man passed through the Masjid carrying arrows, and the Messenger of Allah (ﷺ) said to him: 'Hold then by the blades.'? He said: 'Yes.'\"",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْمِسْوَرِ الزُّهْرِيُّ، - بَصْرِيٌّ - وَمُحَمَّدُ بْنُ مَنْصُورٍ قَالاَ حَدَّثَنَا سُفْيَانُ، قَالَ قُلْتُ لِعَمْرٍو أَسَمِعْتَ جَابِرًا يَقُولُ مَرَّ رَجُلٌ بِسِهَامٍ فِي الْمَسْجِدِ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ خُذْ بِنِصَالِهَا ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏",
    "malay_translation": "Aku bertanya kepada 'Amr, \"Adakah engkau mendengar Jabir berkata: 'Seorang lelaki lalu di dalam Masjid membawa anak panah, lalu Rasulullah SAW bersabda kepadanya: 'Peganglah hujungnya.'? 'Amr menjawab, 'Ya.'\""
  },
  {
    "id": 15457,
    "hadith_number": 721,
    "tajuk_hadith": "Cara Solat Rasulullah SAW Tanpa Adzan dan Iqamah",
    "perawi_melayu": "Dikisahkan oleh Al-Aswad berkata:",
    "english_text": "\"Alqamah dan saya masuk menemui 'Abdullah bin Mas'ud dan beliau bertanya kepada kami, 'Adakah mereka telah solat?' Kami menjawab, 'Tidak.' Beliau berkata, 'Bangun dan solatlah.' Maka kami berdiri di belakang beliau, dan beliau meletakkan salah seorang daripada kami di sebelah kanannya dan yang lain di sebelah kirinya, dan beliau solat tanpa adzan dan iqamah. Apabila beliau rukuk, beliau menyilangkan jari-jarinya dan meletakkan tangannya di antara lututnya, dan beliau berkata, 'Aku melihat Rasulullah SAW melakukan seperti ini.'\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عِيسَى بْنُ يُونُسَ، قَالَ حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، قَالَ دَخَلْتُ أَنَا وَعَلْقَمَةُ، عَلَى عَبْدِ اللَّهِ بْنِ مَسْعُودٍ فَقَالَ لَنَا أَصَلَّى هَؤُلاَءِ قُلْنَا لاَ ‏.‏ قَالَ قُومُوا فَصَلُّوا ‏.‏ فَذَهَبْنَا لِنَقُومَ خَلْفَهُ فَجَعَلَ أَحَدَنَا عَنْ يَمِينِهِ وَالآخَرَ عَنْ شِمَالِهِ فَصَلَّى بِغَيْرِ أَذَانٍ وَلاَ إِقَامَةٍ فَجَعَلَ إِذَا رَكَعَ شَبَّكَ بَيْنَ أَصَابِعِهِ وَجَعَلَهَا بَيْنَ رُكْبَتَيْهِ وَقَالَ هَكَذَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَعَلَ ‏.‏",
    "malay_translation": "Perawi Al-Aswad meriwayatkan bahawa dia dan Alqamah pernah menemui 'Abdullah bin Mas'ud. 'Abdullah bertanya kepada mereka, 'Adakah orang-orang ini telah menunaikan solat?' Mereka menjawab, 'Tidak.' 'Abdullah berkata, 'Bangun dan solatlah.' Lalu mereka berdiri di belakangnya, dan beliau meletakkan salah seorang daripada mereka di sebelah kanannya dan yang lain di sebelah kirinya. Beliau solat tanpa adzan dan iqamah. Ketika beliau rukuk, beliau menyilangkan jari-jarinya dan meletakkan tangannya di antara lututnya, dan beliau berkata, 'Aku melihat Rasulullah SAW melakukan seperti ini.'"
  },
  {
    "id": 15458,
    "hadith_number": 722,
    "tajuk_hadith": "Perkataan Nabi Ibrahim dan Riwayat tentang Abdullah",
    "perawi_melayu": "Dikatakan bahawa Sulaiman telah berkata:",
    "english_text": "\"I heard Ibrahim (narrate) from 'Alqamah and Al-Aswad from 'Abdullah,\" and he narrated something similar.",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا النَّضْرُ، قَالَ أَنْبَأَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، قَالَ سَمِعْتُ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، وَالأَسْوَدِ، عَنْ عَبْدِ اللَّهِ، فَذَكَرَ نَحْوَهُ ‏.‏",
    "malay_translation": "Dikatakan bahawa Sulaiman mendengar Ibrahim meriwayatkan dari 'Alqamah dan Al-Aswad daripada 'Abdullah, dan beliau menceritakan sesuatu yang serupa."
  },
  {
    "id": 15459,
    "hadith_number": 723,
    "tajuk_hadith": "Rasulullah SAW Berbaring di Masjid dengan Satu Kaki di Atas Kaki Lain",
    "perawi_melayu": " 'Abbad bin Tamim dari bapa saudaranya",
    "english_text": "It was narrated from 'Abbad bin Tamim, from his paternal uncle, that he saw the messenger of Allah (ﷺ) lying on his back in the Masjid, placing one leg on top of the other.",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَمِّهِ، أَنَّهُ رَأَى رَسُولَ اللَّهِ صلى الله عليه وسلم مُسْتَلْقِيًا فِي الْمَسْجِدِ وَاضِعًا إِحْدَى رِجْلَيْهِ عَلَى الأُخْرَى ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutbah, daripada Malik, daripada Ibnu Syihab, daripada 'Abbad bin Tamim, daripada pak saudaranya, bahawa beliau telah melihat Rasulullah SAW berbaring di Masjid dengan meletakkan satu kaki di atas kaki yang lain."
  },
  {
    "id": 15460,
    "hadith_number": 724,
    "tajuk_hadith": "Tidur di Masjid Nabi SAW Ketika Muda dan Bujang",
    "perawi_melayu": "Ibn 'Umar",
    "english_text": "It was narrated from Ibn 'Umar, that when he was young and single, with no family, at the time of the Messenger of Allah (ﷺ), he used to sleep in the Masjid of the Prophet (ﷺ).",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، أَنَّهُ كَانَ يَنَامُ وَهُوَ شَابٌّ عَزْبٌ لاَ أَهْلَ لَهُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي مَسْجِدِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Telah diriwayatkan daripada Ibn 'Umar bahawa ketika beliau masih muda dan bujang, tanpa keluarga, pada zaman Rasulullah SAW, beliau biasa tidur di Masjid Nabi SAW."
  },
  {
    "id": 15461,
    "hadith_number": 725,
    "tajuk_hadith": "Larangan Meludah di Masjid dan Cara Mengubatinya",
    "perawi_melayu": "Dikatakan oleh Anas:",
    "english_text": "\"The Messenger of Allah (ﷺ) said: 'Spitting in the Masjid is a sin, and its expiation is to bury it.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْبُصَاقُ فِي الْمَسْجِدِ خَطِيئَةٌ وَكَفَّارَتُهَا دَفْنُهَا ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, 'Meludah di dalam Masjid adalah dosa, dan penebusan dosanya ialah menguburkan ludah itu.'"
  },
  {
    "id": 15462,
    "hadith_number": 726,
    "tajuk_hadith": "Larangan Meludah di Hadapan Semasa Solat",
    "perawi_melayu": "Daripada Ibn 'Umar bahawa Rasulullah SAW melihat air ludah di dinding kiblat. Baginda kemudian membersihkannya, lalu beralih kepada orang ramai dan bersabda:",
    "english_text": "\"When any one of you is praying, let him not spit in front of him, for Allah is in front of him when he prays.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَأَى بُصَاقًا فِي جِدَارِ الْقِبْلَةِ فَحَكَّهُ ثُمَّ أَقْبَلَ عَلَى النَّاسِ فَقَالَ ‏\n\"‏ إِذَا كَانَ أَحَدُكُمْ يُصَلِّي فَلاَ يَبْصُقَنَّ قِبَلَ وَجْهِهِ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ قِبَلَ وَجْهِهِ إِذَا صَلَّى ‏\"‏ ‏.‏",
    "malay_translation": "Apabila salah seorang daripada kamu sedang menunaikan solat, janganlah dia meludah di hadapannya. Kerana Allah SWT ada di hadapannya ketika dia solat."
  },
  {
    "id": 15463,
    "hadith_number": 727,
    "tajuk_hadith": "Larangan Meludah ke Hadapan atau Kanan, dan Arahan Meludah ke Kiri atau Bawah Kaki Kiri",
    "perawi_melayu": "Daripada Abu Sa'id Al-Khudri, bahawa Nabi SAW melihat sesuatu kotoran di kiblat masjid. Baginda mengikisnya dengan batu kecil dan melarang seseorang meludah di hadapan atau di sebelah kanannya. Baginda bersabda:",
    "english_text": "\"Let him spit to his left or beneath his left foot.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى نُخَامَةً فِي قِبْلَةِ الْمَسْجِدِ فَحَكَّهَا بِحَصَاةٍ وَنَهَى أَنْ يَبْصُقَ الرَّجُلُ بَيْنَ يَدَيْهِ أَوْ عَنْ يَمِينِهِ وَقَالَ ‏\n\"‏ يَبْصُقُ عَنْ يَسَارِهِ أَوْ تَحْتَ قَدَمِهِ الْيُسْرَى ‏\"‏ ‏.‏",
    "malay_translation": "Diriwayatkan daripada Abu Sa'id Al-Khudri bahawa Nabi SAW melihat sesuatu kotoran di arah kiblat masjid. Baginda mengikisnya dengan batu kecil dan melarang seseorang meludah di hadapan atau di sebelah kanan. Baginda bersabda, \"Hendaklah dia meludah ke kiri atau di bawah kaki kirinya.\""
  },
  {
    "id": 15464,
    "hadith_number": 728,
    "tajuk_hadith": "Panduan Membazuk Semasa Solat",
    "perawi_melayu": "Dikisahkan bahawa Tariq bin Abdullah Al-Muharibi berkata:",
    "english_text": "'When you are praying, do not spit to the front or to your right. Spit behind you or to your left if there is no one there, otherwise do this.' And he spat beneath his foot and rubbed it.'",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي مَنْصُورٌ، عَنْ رِبْعِيٍّ، عَنْ طَارِقِ بْنِ عَبْدِ اللَّهِ الْمُحَارِبِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا كُنْتَ تُصَلِّي فَلاَ تَبْزُقَنَّ بَيْنَ يَدَيْكَ وَلاَ عَنْ يَمِينِكَ وَابْصُقْ خَلْفَكَ أَوْ تِلْقَاءَ شِمَالِكَ إِنْ كَانَ فَارِغًا وَإِلاَّ فَهَكَذَا ‏\"‏ ‏.‏ وَبَزَقَ تَحْتَ رِجْلِهِ وَدَلَكَهُ ‏.‏",
    "malay_translation": "Apabila sedang solat, janganlah meludah ke hadapan atau ke kanan. Ludahkanlah di belakang atau ke kiri jika tidak ada orang di situ, jika ada orang, lakukanlah seperti ini.  Dan baginda (Rasulullah SAW) meludah di bawah kakinya dan menggosoknya."
  },
  {
    "id": 15465,
    "hadith_number": 729,
    "tajuk_hadith": "Tindakan Rasulullah SAW Semasa Meludah",
    "perawi_melayu": "Dikisahkan oleh Abu Al-'Ala' bin Ash-Shikhir, dari bapanya, bahawa:",
    "english_text": "\"I saw the Messenger of Allah (ﷺ) spit and then rub it with his left foot.\"",
    "arabic_text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ سَعِيدٍ الْجُرَيْرِيِّ، عَنْ أَبِي الْعَلاَءِ بْنِ الشِّخِّيرِ، عَنْ أَبِيهِ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم تَنَخَّعَ فَدَلَكَهُ بِرِجْلِهِ الْيُسْرَى ‏.‏",
    "malay_translation": "Aku melihat Rasulullah SAW meludah, kemudian menggosoknya dengan kaki kirinya."
  },
  {
    "id": 15466,
    "hadith_number": 730,
    "tajuk_hadith": "Kebersihan Masjid dan Menjaga Kehormatannya",
    "perawi_melayu": "Dikisahkan oleh Anas bin Malik:",
    "english_text": "\"The Messenger of Allah (ﷺ) saw some sputum in the Qiblah of the Masjid, and he became so angry that his face turned red. Then a woman from the Ansar went and scratched off, and put some perfume in its place. The Messenger of Allah (ﷺ) said: 'How good this is.'\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا عَائِذُ بْنُ حَبِيبٍ، قَالَ حَدَّثَنَا حُمَيْدٌ الطَّوِيلُ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ رَأَى رَسُولُ اللَّهِ صلى الله عليه وسلم نُخَامَةً فِي قِبْلَةِ الْمَسْجِدِ فَغَضِبَ حَتَّى احْمَرَّ وَجْهُهُ فَقَامَتِ امْرَأَةٌ مِنَ الأَنْصَارِ فَحَكَّتْهَا وَجَعَلَتْ مَكَانَهَا خَلُوقًا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا أَحْسَنَ هَذَا ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW melihat lendir di kiblat masjid, lalu murkanya memuncak sehingga wajahnya memerah. Kemudian, seorang wanita Ansar bangun dan membersihkannya serta meletakkan wangian di tempat itu. Rasulullah SAW bersabda, 'Betapa baiknya perbuatan ini.'"
  },
  {
    "id": 15467,
    "hadith_number": 731,
    "tajuk_hadith": "Doa Masuk dan Keluar Masjid",
    "perawi_melayu": "Diceritakan oleh 'Abdul-Malik bin Sa'eed bahawa:",
    "english_text": "\"I heard Abu Humaid and Abu Usaid say: 'The Messenger of Allah (ﷺ) said: \"When any one of you enters the Masjid, let him say: 'Allahumma aftahli abwaba rahmatik (O Allah, open to me the gates of your mercy). And when he leaves let him say: Allahumma inni as'aluka min fadlik (O Allah, I ask You of Your bounty).'\"",
    "arabic_text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ عُبَيْدِ اللَّهِ الْغَيْلاَنِيُّ، - بَصْرِيٌّ - قَالَ حَدَّثَنَا أَبُو عَامِرٍ، قَالَ حَدَّثَنَا سُلَيْمَانُ، عَنْ رَبِيعَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ سَعِيدٍ، قَالَ سَمِعْتُ أَبَا حُمَيْدٍ، وَأَبَا، أُسَيْدٍ يَقُولاَنِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا دَخَلَ أَحَدُكُمُ الْمَسْجِدَ فَلْيَقُلِ اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ وَإِذَا خَرَجَ فَلْيَقُلِ اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ ‏\"‏ ‏.‏",
    "malay_translation": "Telah diceritakan kepada kami oleh Sulaiman bin 'Ubaidillah al-Ghaylani, seorang ahli hadis dari Basrah, beliau berkata: Telah menceritakan kepada kami Abu 'Amir, beliau berkata: Telah menceritakan kepada kami Sulaiman, dari Rabi'ah, dari 'Abdul Malik bin Sa'id, yang berkata: Aku mendengar Abu Humaid dan Abu Usaid berkata, 'Rasulullah SAW bersabda: \"Apabila seseorang dari kamu memasuki masjid, hendaklah dia membaca: 'Allahumma aftahli abwaba rahmatik (Ya Allah, bukakanlah pintu rahmatMu untukku).\" Dan apabila dia keluar, hendaklah dia membaca: 'Allahumma inni as'aluka min fadlik (Ya Allah, aku memohon kepadaMu dari limpahan kurniaMu).\"'"
  },
  {
    "id": 15468,
    "hadith_number": 732,
    "tajuk_hadith": "Sunnah Berwuduk sebelum Duduk di Masjid",
    "perawi_melayu": "Dari Abu Qatadah, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Ketika sesiapa di antara kamu memasuki Masjid, hendaklah dia solat dua rakaat sebelum duduk.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا مَالِكٌ، عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ عَمْرِو بْنِ سُلَيْمِ، عَنْ أَبِي قَتَادَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا دَخَلَ أَحَدُكُمُ الْمَسْجِدَ فَلْيَرْكَعْ رَكْعَتَيْنِ قَبْلَ أَنْ يَجْلِسَ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila salah seorang daripada kamu memasuki masjid, hendaklah dia mengerjakan solat dua rakaat sebelum duduk.  Ini merupakan sunnah yang disunatkan untuk dilakukan sebelum duduk di dalam masjid."
  },
  {
    "id": 15469,
    "hadith_number": 733,
    "tajuk_hadith": "Kisah Ka'b bin Malik dan Penolakan dalam Perang Tabuk",
    "perawi_melayu": "'Abdullah bin Ka'b berkata:",
    "english_text": "\"I heard Ka'b bin Malik telling the story of when he stayed behind from going out on the campaign of Tabuk with the Messenger of Allah (ﷺ). He said: 'The Messenger of Allah (ﷺ) came back in the morning, and when he came back from a journey he would go to the Masjid first and pray two Rak'ahs there, then he would sit to (meet with) the people. When he did that, those who had stayed behind came to him and started giving their excuses, swearing by Allah. There were eighty-odd men, and the Messenger of Allah (ﷺ) accepted what they declared and accepted their oaths of allegiance; he prayed for forgiveness for them and left whatever was in their hearts to Allah. Then when I came and greeted him, he smiled as one who is angry, then he said: 'Come here.' So I came and sat in front of him,  and he said: 'What kept you behind? Did you not buy a mount?' I said: 'O Messenger of Allah, if I were to sit before anyone other than you of those who hold high positions in this world, I would find a way to avoid his anger. I am an eloquent man but, by Allah, I know that if I were to tell you a lie today to make you pleased with me, Allah would soon make you angry with me, but if I tell you the truth, it will make you angry with me, but I will still have the hope that Allah may forgive me. I have never been in a better position, physically or financially, than the time when I stayed behind and did not join you.' The Messenger of Allah (ﷺ) said: 'This man has spoken the truth. Go away until Allah decides concerning you.' So I got up and went away.\" This is an abridged version of narration.\n\n It is this which the author cited the narration for. While the absence of the mention of a thing - in this case prayer - is not a proof that it does not exist.",
    "arabic_text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، قَالَ ابْنُ شِهَابٍ وَأَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ كَعْبِ بْنِ مَالِكٍ، أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبٍ، قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ، يُحَدِّثُ حَدِيثَهُ حِينَ تَخَلَّفَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ تَبُوكَ قَالَ وَصَبَّحَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَادِمًا وَكَانَ إِذَا قَدِمَ مِنْ سَفَرٍ بَدَأَ بِالْمَسْجِدِ فَرَكَعَ فِيهِ رَكْعَتَيْنِ ثُمَّ جَلَسَ لِلنَّاسِ فَلَمَّا فَعَلَ ذَلِكَ جَاءَهُ الْمُخَلَّفُونَ فَطَفِقُوا يَعْتَذِرُونَ إِلَيْهِ وَيَحْلِفُونَ لَهُ وَكَانُوا بِضْعًا وَثَمَانِينَ رَجُلاً فَقَبِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلاَنِيَتَهُمْ وَبَايَعَهُمْ وَاسْتَغْفَرَ لَهُمْ وَوَكَلَ سَرَائِرَهُمْ إِلَى اللَّهِ عَزَّ وَجَلَّ حَتَّى جِئْتُ فَلَمَّا سَلَّمْتُ تَبَسَّمَ تَبَسُّمَ الْمُغْضَبِ ثُمَّ قَالَ ‏\"‏ تَعَالَ ‏\"‏ ‏.‏ فَجِئْتُ حَتَّى جَلَسْتُ بَيْنَ يَدَيْهِ فَقَالَ لِي ‏\"‏ مَا خَلَّفَكَ أَلَمْ تَكُنِ ابْتَعْتَ ظَهْرَكَ ‏\"‏ ‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي وَاللَّهِ لَوْ جَلَسْتُ عِنْدَ غَيْرِكَ مِنْ أَهْلِ الدُّنْيَا لَرَأَيْتُ أَنِّي سَأَخْرُجُ مِنْ سَخَطِهِ وَلَقَدْ أُعْطِيتُ جَدَلاً وَلَكِنْ وَاللَّهِ لَقَدْ عَلِمْتُ لَئِنْ حَدَّثْتُكَ الْيَوْمَ حَدِيثَ كَذِبٍ لِتَرْضَى بِهِ عَنِّي لَيُوشَكُ أَنَّ اللَّهَ عَزَّ وَجَلَّ يُسْخِطُكَ عَلَىَّ وَلَئِنْ حَدَّثْتُكَ حَدِيثَ صِدْقٍ تَجِدُ عَلَىَّ فِيهِ إِنِّي لأَرْجُو فِيهِ عَفْوَ اللَّهِ وَاللَّهِ مَا كُنْتُ قَطُّ أَقْوَى وَلاَ أَيْسَرَ مِنِّي حِينَ تَخَلَّفْتُ عَنْكَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمَّا هَذَا فَقَدْ صَدَقَ فَقُمْ حَتَّى يَقْضِيَ اللَّهُ فِيكَ ‏\"‏ ‏.‏ فَقُمْتُ فَمَضَيْتُ ‏.‏ مُخْتَصَرٌ ‏.‏",
    "malay_translation": "Telah diberitahu kepada kami oleh Sulaiman bin Daud, katanya telah menceritakan kepada kami Ibnu Wahb, dari Yunus, katanya Ibnu Syihab, dan diberitahu kepadaku oleh Abdul Rahman bin Ka'b bin Malik bahawa Abdul lah bin Ka'b berkata, \"Aku mendengar Ka'b bin Malik menceritakan kisahnya ketika beliau tertinggal dalam ekspedisi Tabuk bersama Rasulullah SAW. Beliau berkata, 'Rasulullah SAW kembali pada waktu pagi, dan setiap kali pulang dari perjalanan, Baginda akan melawat masjid terlebih dahulu, mengerjakan dua rakaat solat, kemudian duduk berjumpa dengan orang ramai.  Apabila Baginda melakukan demikian, orang-orang yang tertinggal datang kepada Baginda dan mula memberi alasan, bersumpah demi Allah. Terdapat lapan puluhan orang. Rasulullah SAW menerima penjelasan dan sumpah setia mereka, mendoakan ampunan bagi mereka dan menyerahkan segala perkara dalam hati mereka kepada Allah. Sehingga aku datang dan memberi salam kepada Baginda, Baginda tersenyum dengan senyuman seseorang yang marah, kemudian bersabda, 'Marilah.' Maka aku datang dan duduk di hadapan Baginda, dan Baginda bertanya kepadaku, 'Apakah yang menyebabkan engkau tertinggal? Tidakkah engkau telah membeli tunggangan?' Aku menjawab, 'Wahai Rasulullah, seandainya aku duduk di hadapan orang lain selain daripada engkau yang mempunyai kedudukan tinggi di dunia ini, aku akan mencari cara untuk mengelakkan kemarahannya. Aku seorang yang pandai bercakap tetapi demi Allah, aku tahu jika aku berdusta pada hari ini untuk memuaskan engkau, Allah akan segera menjadikan engkau marah kepadaku, dan jika aku berkata benar, itu akan membuat engkau marah kepadaku, tetapi aku tetap berharap Allah mengampuniku. Aku tidak pernah berada dalam keadaan yang lebih baik, secara fizikal atau kewangan, daripada ketika aku tertinggal dan tidak menyertai engkau.' Rasulullah SAW bersabda, 'Orang ini telah berkata benar. Pergilah sehingga Allah memutuskan tentangmu.' Maka aku bangun dan pergi.' Ini merupakan ringkasan daripada riwayat.  Dan inilah yang dirujuk oleh penulis dalam riwayat tersebut. Walaupun ketiadaan sesuatu perkara – dalam kes ini solat – bukanlah bukti bahawa ia tidak wujud."
  },
  {
    "id": 15470,
    "hadith_number": 734,
    "tajuk_hadith": "Solat di Masjid Sewaktu Rasulullah SAW",
    "perawi_melayu": "Dikisahkan oleh Abu Sa'id bin Al-Mu'alla bahawa:",
    "english_text": "\"We used to go to the marketplace in the morning at the time of the Messenger of Allah (ﷺ), and we would pass through the Masjid and pray there.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ بْنِ أَعْيَنَ، قَالَ حَدَّثَنَا شُعَيْبٌ، قَالَ حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنَا خَالِدٌ، عَنِ ابْنِ أَبِي هِلاَلٍ، قَالَ أَخْبَرَنِي مَرْوَانُ بْنُ عُثْمَانَ، أَنَّ عُبَيْدَ بْنَ حُنَيْنٍ، أَخْبَرَهُ عَنْ أَبِي سَعِيدِ بْنِ الْمُعَلَّى، قَالَ كُنَّا نَغْدُو إِلَى السُّوقِ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَنَمُرُّ عَلَى الْمَسْجِدِ فَنُصَلِّي فِيهِ ‏.‏",
    "malay_translation": "Kami biasa pergi ke pasar pada waktu pagi di zaman Rasulullah SAW, dan kami akan lalu di Masjid dan solat di situ."
  },
  {
    "id": 15471,
    "hadith_number": 735,
    "tajuk_hadith": "Malaikat Memberi Doa bagi Orang yang Sedang Solat",
    "perawi_melayu": "Daripada Abu Hurairah, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"The angels send Salah upon any one of you so long as he is in the place where he prays, and so long as he does not invalidate his ablution, (saying): 'O Allah, forgive him, O Allah, have mercy on him.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الْمَلاَئِكَةَ تُصَلِّي عَلَى أَحَدِكُمْ مَا دَامَ فِي مُصَلاَّهُ الَّذِي صَلَّى فِيهِ مَا لَمْ يُحْدِثِ اللَّهُمَّ اغْفِرْ لَهُ اللَّهُمَّ ارْحَمْهُ ‏\"‏ ‏.‏",
    "malay_translation": "Malaikat-malaikat sentiasa mendoakan kebaikan kepada seseorang daripada kamu selama dia berada di tempat solatnya dan selagi dia tidak membatalkan wudhunya, sambil berdoa: \"Ya Allah, ampunilah dia, Ya Allah, rahmatilah dia.\""
  },
  {
    "id": 15472,
    "hadith_number": 736,
    "tajuk_hadith": "Keberadaan di Masjid Menanti Solat Sama dengan Solat",
    "perawi_melayu": "Sahl Al-Sa'idi, semoga Allah meridainya, berkata:",
    "english_text": "\"I heard the Messenger of Allah (ﷺ) say: 'Whoever is in the Masjid waiting for the prayer, he is in a state of prayer.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا بَكْرُ بْنُ مُضَرَ، عَنْ عَيَّاشِ بْنِ عُقْبَةَ، أَنَّ يَحْيَى بْنَ مَيْمُونٍ، حَدَّثَهُ قَالَ سَمِعْتُ سَهْلاً السَّاعِدِيَّ، - رضى الله عنه - يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ كَانَ فِي الْمَسْجِدِ يَنْتَظِرُ الصَّلاَةَ فَهُوَ فى الصَّلاَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda, \"Sesiapa yang berada di dalam Masjid menunggu solat, maka dia berada dalam keadaan solat.\""
  },
  {
    "id": 15473,
    "hadith_number": 737,
    "tajuk_hadith": "Larangan Solat di Tempat Unta Bertumpuk",
    "perawi_melayu": "Dikisahkan daripada 'Abdullah bin Mughaffal bahawa Rasulullah SAW melarang solat di dalam kandang unta.",
    "english_text": "Kneeling places, or, where they kneel to drink water.",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ أَشْعَثَ، عَنِ الْحَسَنِ، عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الصَّلاَةِ فِي أَعْطَانِ الإِبِلِ ‏.‏",
    "malay_translation": "Dikisahkan daripada 'Abdullah bin Mughaffal bahawa Rasulullah SAW melarang solat di dalam kandang-kandang unta.  (Terjemahan literal dari ayat Arab mungkin tidak begitu sesuai dengan konteks yang dimaksudkan.  Konteks ini merujuk kepada larangan solat di kawasan yang digunakan oleh unta untuk berteduh dan minum air, bukanlah tempat mereka diikat)."
  },
  {
    "id": 15474,
    "hadith_number": 738,
    "tajuk_hadith": "Keutamaan Tanah sebagai Tempat Sembahyang dan Penyucian",
    "perawi_melayu": "Dikatakan oleh Jabir bin Abdullah:",
    "english_text": "\"The Messenger of Allah (ﷺ) said: 'The earth has been made for me a place of prostration and a means of purification, so wherever a man of my Ummah is when the time for prayer comes, let him pray.'\"",
    "arabic_text": "أَخْبَرَنَا الْحَسَنُ بْنُ إِسْمَاعِيلَ بْنِ سُلَيْمَانَ، قَالَ حَدَّثَنَا هُشَيْمٌ، قَالَ حَدَّثَنَا سَيَّارٌ، عَنْ يَزِيدَ الْفَقِيرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ جُعِلَتْ لِيَ الأَرْضُ مَسْجِدًا وَطَهُورًا أَيْنَمَا أَدْرَكَ رَجُلٌ مِنْ أُمَّتِي الصَّلاَةَ صَلَّى ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Bumi telah dijadikan untukku sebagai tempat sujud dan tempat suci. Di mana saja seorang dari umatku di waktu solat tiba, hendaklah ia mendirikan solat.\""
  },
  {
    "id": 15475,
    "hadith_number": 739,
    "tajuk_hadith": "Rasulullah SAW Mengadap di Rumah Umm Sulaim dan Menjadikannya Tempat Solat",
    "perawi_melayu": "",
    "english_text": "It was narrated from Anas bin Malik that Umm Sulaim asked the Messenger of Allah (ﷺ) to come to her and pray in her house so that she could take (the place where he prayed) as a Musalla (prayer place). So he came to her and she went and got a reed mat and sprinkled it with water, and he prayed on it, and they prayed with him.",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ يَحْيَى بْنِ سَعِيدٍ الأُمَوِيُّ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ أُمَّ سُلَيْمٍ، سَأَلَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنْ يَأْتِيَهَا فَيُصَلِّيَ فِي بَيْتِهَا فَتَتَّخِذَهُ مُصَلًّى فَأَتَاهَا فَعَمَدَتْ إِلَى حَصِيرٍ فَنَضَحَتْهُ بِمَاءٍ فَصَلَّى عَلَيْهِ وَصَلَّوْا مَعَهُ ‏.‏",
    "malay_translation": "Dikisahkan daripada Anas bin Malik bahawa Umm Sulaim memohon kepada Rasulullah SAW agar datang ke rumahnya untuk menunaikan solat di rumahnya supaya ia dapat menjadikan tempat itu sebagai tempat solat (musalla). Baginda pun datang kepadanya, lalu Umm Sulaim mengambil tikar buluh dan menyiramnya dengan air, kemudian Baginda menunaikan solat di atasnya, dan mereka (para sahabat) turut menunaikan solat bersama Baginda."
  },
  {
    "id": 15476,
    "hadith_number": 740,
    "tajuk_hadith": "Nabi SAW Selalu Solat di atas Permadani",
    "perawi_melayu": "",
    "english_text": "It was narrated from Maimunah that the Messenger of Allah (ﷺ) used to pray on a mat.",
    "arabic_text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، - يَعْنِي الشَّيْبَانِيَّ - عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ، عَنْ مَيْمُونَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي عَلَى الْخُمْرَةِ ‏.‏",
    "malay_translation": "Telah diriwayatkan daripada Maimunah bahawa Rasulullah SAW biasa menunaikan solat di atas tikar."
  },
  {
    "id": 15477,
    "hadith_number": 741,
    "tajuk_hadith": "Penjelasan dan Kegunaan Mimbar Nabi SAW",
    "perawi_melayu": "Abu Hazim bin Dinar meriwayatkan bahawa beberapa orang datang kepada Sahl bin Sa'd As-Sa'idi. Mereka ingin tahu daripada apa kayu mimbar dibuat, maka mereka bertanya kepadanya tentang hal itu. Beliau menjawab:",
    "english_text": "\"By Allah, I know what it is made of. I saw it the first day it was set up and the first day the Messenger of Allah (ﷺ) sat on it. The Messenger of Allah (ﷺ) sent word to so-and-so\" - a woman whose name Sahl mentioned - \"telling her: 'Tell your carpenter slave to make me something of wood that I can sit on when I speak to the people.' So she told him, and he made it from tamarisk wood from Al-Ghabah (a place near Al-Madinah). Then he brought it and it was sent to the Messenger of Allah (ﷺ), who commanded that it be set up here. Then I saw the Messenger of Allah (ﷺ) ascend it and praying on it, and saying the Takbir while he was on top of it, then he bowed when he was on top of it, then he came down backward and prostrated at the base of the Minbar, then he went back. When he had finished he turned to face the people and said: 'O people, I only did this so that you can follow me in prayer and learn how I pray.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنِي أَبُو حَازِمِ بْنِ دِينَارٍ، أَنَّ رِجَالاً، أَتَوْا سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ وَقَدِ امْتَرَوْا فِي الْمِنْبَرِ مِمَّ عُودُهُ فَسَأَلُوهُ عَنْ ذَلِكَ فَقَالَ وَاللَّهِ إِنِّي لأَعْرِفُ مِمَّ هُوَ وَلَقَدْ رَأَيْتُهُ أَوَّلَ يَوْمٍ وُضِعَ وَأَوَّلَ يَوْمٍ جَلَسَ عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم أَرْسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى فُلاَنَةَ امْرَأَةٍ قَدْ سَمَّاهَا سَهْلٌ ‏\"‏ أَنْ مُرِي غُلاَمَكِ النَّجَّارَ أَنْ يَعْمَلَ لِي أَعْوَادًا أَجْلِسُ عَلَيْهِنَّ إِذَا كَلَّمْتُ النَّاسَ ‏\"‏ ‏.‏ فَأَمَرَتْهُ فَعَمِلَهَا مِنْ طَرْفَاءِ الْغَابَةِ ثُمَّ جَاءَ بِهَا فَأَرْسَلَتْ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَمَرَ بِهَا فَوُضِعَتْ هَا هُنَا ثُمَّ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم رَقِيَ فَصَلَّى عَلَيْهَا وَكَبَّرَ وَهُوَ عَلَيْهَا ثُمَّ رَكَعَ وَهُوَ عَلَيْهَا ثُمَّ نَزَلَ الْقَهْقَرَى فَسَجَدَ فِي أَصْلِ الْمِنْبَرِ ثُمَّ عَادَ فَلَمَّا فَرَغَ أَقْبَلَ عَلَى النَّاسِ فَقَالَ ‏\"‏ يَا أَيُّهَا النَّاسُ إِنَّمَا صَنَعْتُ هَذَا لِتَأْتَمُّوا بِي وَلِتَعَلَّمُوا صَلاَتِي ‏\"‏ ‏.‏",
    "malay_translation": "Diceritakan oleh Abu Hazim bin Dinar bahawa beberapa orang datang kepada Sahl bin Sa'd As-Sa'idi dan bertanya tentang bahan kayu mimbar. Sahl berkata, \"Demi Allah, aku tahu daripada apa kayu itu dibuat. Aku melihatnya pada hari pertama ia didirikan dan hari pertama Rasulullah SAW duduk di atasnya. Rasulullah SAW mengutus kepada seorang wanita, yang namanya disebut Sahl, \"suruhlah hamba kayu (tukang kayu) engkau membuat sesuatu daripada kayu untukku agar aku dapat duduk di atasnya ketika aku berbicara kepada manusia.\" Maka dia menyuruhnya, dan dia membuatnya daripada kayu tamarisk dari Al-Ghabah (tempat berhampiran Madinah). Kemudian ia dihantar kepada Rasulullah SAW, yang memerintahkannya didirikan di sini. Kemudian aku melihat Rasulullah SAW naik dan bersolat di atasnya, dan bertakbir di atasnya, lalu sujud di atasnya, kemudian turun dengan cara tertentu dan sujud di pangkal mimbar, kemudian kembali. Setelah selesai, beliau menoleh kepada orang ramai dan berkata, \"Wahai umat manusia, aku melakukan ini agar kamu dapat mengikut solatku dan belajar cara solatku.\" "
  },
  {
    "id": 15478,
    "hadith_number": 742,
    "tajuk_hadith": "Rasulullah SAW Bersembahyang di atas Keldai menuju Khaibar",
    "perawi_melayu": "Dikatakan oleh Ibnu Umar bahawa:",
    "english_text": "\"I saw the Messenger of Allah (ﷺ) praying on a donkey, when he was heading toward Khaibar.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ عَمْرِو بْنِ يَحْيَى، عَنْ سَعِيدِ بْنِ يَسَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُصَلِّي عَلَى حِمَارٍ وَهُوَ مُتَوَجِّهٌ إِلَى خَيْبَرَ ‏.‏",
    "malay_translation": "Aku melihat Rasulullah SAW bersembahyang di atas seekor keldai ketika baginda menuju ke Khaibar."
  },
  {
    "id": 15479,
    "hadith_number": 743,
    "tajuk_hadith": "Penjelasan Mengenai Solat di Atas Keledai",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "We do not know of anyone who reported anything to support what 'Amr bin Yahya said about praying on a donkey. As for the Hadith of Yahya bin Sa'eed from Anas, what is correct is that it is Mawquf.  And Allah knows best.\n\n That is a saying or action of a Companion of the Prophet (ﷺ)",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ عُمَرَ، قَالَ حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ، عَنْ مُحَمَّدِ بْنِ عَجْلاَنَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ رَأَى رَسُولَ اللَّهِ صلى الله عليه وسلم يُصَلِّي عَلَى حِمَارٍ وَهُوَ رَاكِبٌ إِلَى خَيْبَرَ وَالْقِبْلَةُ خَلْفَهُ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ لاَ نَعْلَمُ أَحَدًا تَابَعَ عَمْرَو بْنَ يَحْيَى عَلَى قَوْلِهِ يُصَلِّي عَلَى حِمَارٍ وَحَدِيثُ يَحْيَى بْنِ سَعِيدٍ عَنْ أَنَسٍ الصَّوَابُ مَوْقُوفٌ وَاللَّهُ سُبْحَانَهُ وَتَعَالَى أَعْلَمُ ‏.‏",
    "malay_translation": "Kami tidak mengetahui sesiapa yang meriwayatkan apa-apa yang menyokong perkataan 'Amr bin Yahya tentang solat di atas unta. Adapun Hadith Yahya bin Sa'eed daripada Anas, yang benar ialah ia Mawquf. Dan Allah lebih mengetahui.\n\nItu merupakan perkataan atau perbuatan seorang sahabat Rasulullah SAW."
  }
]