[
  {
    "id": 17176,
    "hadith_number": 2440,
    "tajuk_hadith": "Nasihat Rasulullah SAW kepada Mu'adh ke Yaman",
    "perawi_melayu": "Daripada Ibn 'Abbas berkata:",
    "english_text": "\"The Messenger of Allah said to Mu'adh when he sent him to Yemen: 'You are going to some of the People of the book. When you come to them, call them to testify that there is none worthy of worship except Allah and that Muhammad is the Messenger of Allah. If they obey you in that, then tell them that Allah, the Mighty and Sublime, has enjoined on them a charity (Zakah) to be taken from their rich and given to their poor. If they obey you in that, then beware of the supplication of the oppressed person.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَمَّارٍ الْمَوْصِلِيُّ، عَنِ الْمُعَافَى، عَنْ زَكَرِيَّا بْنِ إِسْحَاقَ الْمَكِّيِّ، قَالَ حَدَّثَنَا يَحْيَى بْنُ عَبْدِ اللَّهِ بْنِ صَيْفِيٍّ، عَنْ أَبِي مَعْبَدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِمُعَاذٍ حِينَ بَعَثَهُ إِلَى الْيَمَنِ ‏\n\"‏ إِنَّكَ تَأْتِي قَوْمًا أَهْلَ كِتَابٍ فَإِذَا جِئْتَهُمْ فَادْعُهُمْ إِلَى أَنْ يَشْهَدُوا أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ فَإِنْ هُمْ أَطَاعُوكَ بِذَلِكَ فَأَخْبِرْهُمْ أَنَّ اللَّهَ عَزَّ وَجَلَّ فَرَضَ عَلَيْهِمْ خَمْسَ صَلَوَاتٍ فِي يَوْمٍ وَلَيْلَةٍ فَإِنْ هُمْ - يَعْنِي أَطَاعُوكَ بِذَلِكَ - فَأَخْبِرْهُمْ أَنَّ اللَّهَ عَزَّ وَجَلَّ فَرَضَ عَلَيْهِمْ صَدَقَةً تُؤْخَذُ مِنْ أَغْنِيَائِهِمْ فَتُرَدُّ عَلَى فُقَرَائِهِمْ فَإِنْ هُمْ أَطَاعُوكَ بِذَلِكَ فَاتَّقِ دَعْوَةَ الْمَظْلُومِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda kepada Mu'adh ketika baginda menghantarnya ke Yaman: \"Sesungguhnya kamu akan mendatangi kaum Ahli Kitab. Apabila kamu sampai kepada mereka, serulah mereka untuk bersaksi bahawa tiada Tuhan yang berhak disembah melainkan Allah dan bahawa Muhammad itu adalah Rasulullah. Jika mereka mentaatimu dalam hal itu, maka beritahu mereka bahawa Allah SWT telah mewajibkan ke atas mereka solat lima waktu dalam sehari semalam. Jika mereka mentaatimu dalam hal itu, maka beritahu mereka bahawa Allah SWT telah mewajibkan ke atas mereka sedekah (Zakat) yang diambil daripada orang kaya mereka dan diberikan kepada orang miskin mereka. Jika mereka mentaatimu dalam hal itu, maka berhati-hatilah daripada doa orang yang teraniaya.\""
  },
  {
    "id": 17177,
    "hadith_number": 2441,
    "tajuk_hadith": "Tanda-Tanda Islam: Penyerahan Diri dan Amalan",
    "perawi_melayu": "Bahz bin Hakim meriwayatkan daripada bapanya, daripada datuknya:",
    "english_text": "\"I said: 'O Prophet of Allah, I did not come to you until I had sworn more than this many times\" the number of fingers on his hands \"that I would never come to you or follow your religion. I am a man who does not know anything except that which Allah, the Mighty and Sublime, and His Messenger teach me. I ask you by the Revelation of Allah, with what has your Lord sent your to us? He said: \"With Islam.' I said: 'What are the signs of Islam?' He said: 'To say, I submit my face to Allah and give up Shirk, and to establish the Salah and to pay the Zakah.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ بَهْزَ بْنَ حَكِيمٍ، يُحَدِّثُ عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قُلْتُ يَا نَبِيَّ اللَّهِ مَا أَتَيْتُكَ حَتَّى حَلَفْتُ أَكْثَرَ مِنْ عَدَدِهِنَّ - لأَصَابِعِ يَدَيْهِ - أَنْ لاَ آتِيَكَ وَلاَ آتِيَ دِينَكَ وَإِنِّي كُنْتُ امْرَأً لاَ أَعْقِلُ شَيْئًا إِلاَّ مَا عَلَّمَنِي اللَّهُ عَزَّ وَجَلَّ وَرَسُولُهُ وَإِنِّي أَسْأَلُكَ بِوَحْىِ اللَّهِ بِمَا بَعَثَكَ رَبُّكَ إِلَيْنَا قَالَ ‏\"‏ بِالإِسْلاَمِ ‏\"‏ ‏.‏ قُلْتُ وَمَا آيَاتُ الإِسْلاَمِ قَالَ ‏\"‏ أَنْ تَقُولَ أَسْلَمْتُ وَجْهِيَ إِلَى اللَّهِ وَتَخَلَّيْتُ وَتُقِيمَ الصَّلاَةَ وَتُؤْتِيَ الزَّكَاةَ ‏\"‏ ‏.‏",
    "malay_translation": "Aku berkata: 'Wahai Nabi Allah, aku tidak datang kepadaMu sehingga aku bersumpah lebih daripada ini banyak kali' -bilangan jari-jarinya- 'bahawa aku tidak akan datang kepadaMu atau mengikut agamaMu. Sesungguhnya aku adalah seorang lelaki yang tidak tahu apa-apa melainkan apa yang Allah, Yang Maha Perkasa dan Maha Agung, dan Rasul-Nya ajarkan kepada ku. Aku bertanya kepadaMu demi wahyu Allah, dengan apakah Tuhanmu mengutusMu kepada kami?' Baginda bersabda: 'Dengan Islam.' Aku berkata: 'Apakah tanda-tanda Islam?' Baginda bersabda: 'Untuk berkata, aku menyerahkan wajahku kepada Allah dan meninggalkan syirik, dan mendirikan solat dan membayar zakat.'"
  },
  {
    "id": 17178,
    "hadith_number": 2442,
    "tajuk_hadith": "Kepentingan Menyempurnakan Wuduk, Memuji Allah, dan Amalan-amalan Lain",
    "perawi_melayu": "Diriwayatkan dari 'Abdur-Rahman bin Ghanm bahawa Abu Malik Al-Ash'ari menceritakan kepadanya bahawa Rasulullah ﷺ bersabda:",
    "english_text": "\"Isbagh Al-Wudu is half of faith; Alhamdu lillah (praise be to Allah) fills the balance; the Tasbih and the Takbir fill the heavens and Earth; the Salah is light; the Zakah is a sign (of sincerity); patience is an illuminating torch; and the Qur'an is proof, either for you or against you.\"",
    "arabic_text": "أَخْبَرَنَا عِيسَى بْنُ مُسَاوِرٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبِ بْنِ شَابُورَ، عَنْ مُعَاوِيَةَ بْنِ سَلاَّمٍ، عَنْ أَخِيهِ، زَيْدِ بْنِ سَلاَّمٍ أَنَّهُ أَخْبَرَهُ عَنْ جَدِّهِ أَبِي سَلاَّمٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ، أَنَّ أَبَا مَالِكٍ الأَشْعَرِيَّ، حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِسْبَاغُ الْوُضُوءِ شَطْرُ الإِيمَانِ وَالْحَمْدُ لِلَّهِ تَمْلأُ الْمِيزَانَ وَالتَّسْبِيحُ وَالتَّكْبِيرُ يَمْلأُ السَّمَوَاتِ وَالأَرْضَ وَالصَّلاَةُ نُورٌ وَالزَّكَاةُ بُرْهَانٌ وَالصَّبْرُ ضِيَاءٌ وَالْقُرْآنُ حُجَّةٌ لَكَ أَوْ عَلَيْكَ ‏\"‏ ‏.‏",
    "malay_translation": "Menyempurnakan wuduk adalah separuh daripada iman; 'Alhamdu lillah' (segala puji bagi Allah) memenuhi neraca; Tasbih dan Takbir memenuhi langit dan bumi; Solat adalah cahaya; Zakat adalah bukti (keikhlasan); kesabaran adalah obor yang menerangi; dan Al-Quran adalah hujah, sama ada untuk kamu atau terhadap kamu."
  },
  {
    "id": 17179,
    "hadith_number": 2443,
    "tajuk_hadith": "Amalan Membuka Pintu Syurga",
    "perawi_melayu": "Suhaib meriwayatkan bahawa beliau mendengar Abu Hurairah dan Abu Sa'eed berkata:",
    "english_text": "\"Not Available\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ، عَنْ شُعَيْبٍ، عَنِ اللَّيْثِ، قَالَ أَنْبَأَنَا خَالِدٌ، عَنِ ابْنِ أَبِي هِلاَلٍ، عَنْ نُعَيْمٍ الْمُجْمِرِ أَبِي عَبْدِ اللَّهِ، قَالَ أَخْبَرَنِي صُهَيْبٌ، أَنَّهُ سَمِعَ مِنْ أَبِي هُرَيْرَةَ، وَمِنْ أَبِي سَعِيدٍ يَقُولاَنِ خَطَبَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمًا فَقَالَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ ‏\"‏ ‏.‏ ثَلاَثَ مَرَّاتٍ ثُمَّ أَكَبَّ فَأَكَبَّ كُلُّ رَجُلٍ مِنَّا يَبْكِي لاَ نَدْرِي عَلَى مَاذَا حَلَفَ ثُمَّ رَفَعَ رَأْسَهُ فِي وَجْهِهِ الْبُشْرَى فَكَانَتْ أَحَبَّ إِلَيْنَا مِنْ حُمْرِ النَّعَمِ ثُمَّ قَالَ ‏\"‏ مَا مِنْ عَبْدٍ يُصَلِّي الصَّلَوَاتِ الْخَمْسَ وَيَصُومُ رَمَضَانَ وَيُخْرِجُ الزَّكَاةَ وَيَجْتَنِبُ الْكَبَائِرَ السَّبْعَ إِلاَّ فُتِّحَتْ لَهُ أَبْوَابُ الْجَنَّةِ فَقِيلَ لَهُ ادْخُلْ بِسَلاَمٍ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ berkhutbah kepada kami pada suatu hari dan bersabda: 'Demi (Allah) yang jiwaku berada di tangan-Nya,' (baginda mengucapkan) tiga kali, kemudian baginda menundukkan kepala. Setiap kami turut menundukkan kepala, menangis, dan kami tidak tahu tentang sumpah apa yang telah diucapkannya. Kemudian baginda mengangkat kepala dengan kegembiraan di wajahnya, dan itu lebih kami sukai daripada unta merah. Kemudian baginda bersabda: 'Tidaklah seseorang yang mendirikan solat lima waktu, berpuasa di bulan Ramadan, mengeluarkan zakat, dan menjauhi tujuh dosa besar, melainkan akan dibukakan baginya pintu-pintu syurga, dan dikatakan kepadanya: Masuklah dengan sejahtera.'"
  },
  {
    "id": 17180,
    "hadith_number": 2444,
    "tajuk_hadith": "Peluang Memasuki Syurga Melalui Pelbagai Pintu",
    "perawi_melayu": "Abu Hurairah berkata:",
    "english_text": "\"I heard the Messenger of Allah say\" 'Whoever spends on a pair of things in the cause of Allah, he will be called from the gates of Paradise: O slave of Allah, this is good for you. Paradise had (several) gates. Whoever is one of the people of Salah, he will be called from the gate of prayer. Whoever is one of the people of Jihad, will be called from the gate of Jihad. Whoever is one of the people of charity will be called from the gate of charity. And whoever is one of the people of fasting will be called from the gate of Ar-Rayyan.\" Abu Bakr said: \"Is there any need for anyone to be called from all of these gates? Will anyone be called from all of them, O Messenger of Allah?\" He said: \"Yes, and I hope that you will be among them.\"",
    "arabic_text": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرٍ، قَالَ حَدَّثَنَا أَبِي، عَنْ شُعَيْبٍ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَنْ أَنْفَقَ زَوْجَيْنِ مِنْ شَىْءٍ مِنَ الأَشْيَاءِ فِي سَبِيلِ اللَّهِ دُعِيَ مِنْ أَبْوَابِ الْجَنَّةِ يَا عَبْدَ اللَّهِ هَذَا خَيْرٌ لَكَ وَلِلْجَنَّةِ أَبْوَابٌ فَمَنْ كَانَ مِنْ أَهْلِ الصَّلاَةِ دُعِيَ مِنْ بَابِ الصَّلاَةِ وَمَنْ كَانَ مِنْ أَهْلِ الْجِهَادِ دُعِيَ مِنْ بَابِ الْجِهَادِ وَمَنْ كَانَ مِنْ أَهْلِ الصَّدَقَةِ دُعِيَ مِنْ بَابِ الصَّدَقَةِ وَمَنْ كَانَ مِنْ أَهْلِ الصِّيَامِ دُعِيَ مِنْ بَابِ الرَّيَّانِ ‏\"‏ ‏.‏ قَالَ أَبُو بَكْرٍ هَلْ عَلَى مَنْ يُدْعَى مِنْ تِلْكَ الأَبْوَابِ مِنْ ضَرُورَةٍ فَهَلْ يُدْعَى مِنْهَا كُلِّهَا أَحَدٌ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ نَعَمْ وَإِنِّي أَرْجُو أَنْ تَكُونَ مِنْهُمْ ‏\"‏ ‏.‏ يَعْنِي أَبَا بَكْرٍ ‏.‏",
    "malay_translation": "Saya mendengar Rasulullah ﷺ bersabda: \"Sesiapa yang membelanjakan (harta) sepasang di jalan Allah, dia akan dipanggil dari pintu-pintu syurga: 'Wahai hamba Allah, ini adalah baik untukmu.' Syurga mempunyai beberapa pintu. Sesiapa yang termasuk golongan ahli solat, dia akan dipanggil dari pintu solat. Sesiapa yang termasuk golongan ahli jihad, dia akan dipanggil dari pintu jihad. Sesiapa yang termasuk golongan ahli sedekah, dia akan dipanggil dari pintu sedekah. Dan sesiapa yang termasuk golongan ahli puasa, dia akan dipanggil dari pintu Ar-Rayyan.\" Abu Bakr bertanya: \"Adakah sesiapa memerlukan untuk dipanggil dari semua pintu ini? Adakah sesiapa akan dipanggil dari kesemua pintu itu, wahai Rasulullah?\" Baginda menjawab: \"Ya, dan aku berharap agar engkau termasuk di kalangan mereka.\""
  },
  {
    "id": 17181,
    "hadith_number": 2445,
    "tajuk_hadith": "Azab Bagi Mereka Yang Tidak Mengeluarkan Zakat Harta",
    "perawi_melayu": "Diriwayatkan daripada Abu Dharr",
    "english_text": "\"I come to the Prophet while he was sitting in the shade of the Ka'bah. When he saw me coming he said: 'They are the losers, by the Lord of the Ka'bah!' I said: 'what's happening? Perhaps something has been revealed concerning me.' I said: 'Who are they, may my father said mother be ransomed for you?' He said: \"those who have a lot of wealth, except one who does like this, and like this, and like this,' (motioning) in front of him, and to his right, and to his left. Then he said: 'By the One in Whose hand is my soul, no man dies leaving camels, or cattle, or sheep on which he did not pay the Zakah, but they will come on the Day of Resurrection as big and fat as they ever were, trampling him with their hooves and goring him with their horns. Every time the last of them runs over him, the first of them will come back, until judgment is passed among the people.\"'",
    "arabic_text": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، فِي حَدِيثِهِ عَنْ أَبِي مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنِ الْمَعْرُورِ بْنِ سُوَيْدٍ، عَنْ أَبِي ذَرٍّ، قَالَ جِئْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم وَهُوَ جَالِسٌ فِي ظِلِّ الْكَعْبَةِ فَلَمَّا رَآنِي مُقْبِلاً قَالَ ‏\"‏ هُمُ الأَخْسَرُونَ وَرَبِّ الْكَعْبَةِ ‏\"‏ ‏.‏ فَقُلْتُ مَا لِي لَعَلِّي أُنْزِلَ فِيَّ شَىْءٌ قُلْتُ مَنْ هُمْ فَدَاكَ أَبِي وَأُمِّي قَالَ ‏\"‏ الأَكْثَرُونَ أَمْوَالاً إِلاَّ مَنْ قَالَ هَكَذَا وَهَكَذَا وَهَكَذَا حَتَّى بَيْنَ يَدَيْهِ وَعَنْ يَمِينِهِ وَعَنْ شِمَالِهِ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لاَ يَمُوتُ رَجُلٌ فَيَدَعُ إِبِلاً أَوْ بَقَرًا لَمْ يُؤَدِّ زَكَاتَهَا إِلاَّ جَاءَتْ يَوْمَ الْقِيَامَةِ أَعْظَمَ مَا كَانَتْ وَأَسْمَنَهُ تَطَؤُهُ بِأَخْفَافِهَا وَتَنْطَحُهُ بِقُرُونِهَا كُلَّمَا نَفِدَتْ أُخْرَاهَا أُعِيدَتْ أُولاَهَا حَتَّى يُقْضَى بَيْنَ النَّاسِ ‏\"‏ ‏.‏",
    "malay_translation": "Saya datang kepada Nabi ﷺ ketika baginda sedang duduk di bawah naungan Kaabah. Apabila baginda melihat saya datang, baginda bersabda: “Mereka adalah orang-orang yang rugi, demi Tuhan Kaabah!” Saya berkata: “Apa yang berlaku? Mungkin ada sesuatu yang telah diturunkan tentang saya.” Saya bertanya: “Siapakah mereka, semoga ayah dan ibu saya menjadi tebusan untukmu?” Baginda bersabda: “Orang yang memiliki banyak harta, kecuali orang yang melakukan seperti ini, dan seperti ini, dan seperti ini,” (sambil memberi isyarat) di hadapannya, dan ke kanan, dan ke kirinya. Kemudian baginda bersabda: “Demi (Allah) yang jiwaku berada di tangan-Nya, tidaklah seorang lelaki meninggal dunia dengan meninggalkan unta, atau lembu, atau kambing yang tidak membayar zakatnya, melainkan ia akan datang pada hari Kiamat dengan keadaan sebesar dan segemuk yang pernah ada, memijaknya dengan kukunya dan menanduknya dengan tanduknya. Setiap kali yang terakhir dari mereka melintasinya, yang pertama dari mereka akan kembali, sehingga selesai penghakiman di antara manusia.”"
  },
  {
    "id": 17182,
    "hadith_number": 2446,
    "tajuk_hadith": "Balasan Bagi Mereka yang Tidak Membayar Zakat",
    "perawi_melayu": "Diriwayatkan daripada Abdullah",
    "english_text": "\"The Messenger of Allah said: 'There is no man who has wealth and does not pay the dues of his wealth, but a baldheaded Shuja'a will be made to encircle his neck, and he will run away from the Book of Allah: 'And let not those who covetously withhold of that which Allah has bestowed on them of His Bounty (wealth)' think that it is good for them (and so they do not pay the obligatory Zakah). Nay, it will be worse for them; the things which they covetously withheld, shall be tied toothier necks like a collar on the Day of Resurrection.\"'",
    "arabic_text": "أَخْبَرَنَا مُجَاهِدُ بْنُ مُوسَى، قَالَ حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ جَامِعِ بْنِ أَبِي رَاشِدٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا مِنْ رَجُلٍ لَهُ مَالٌ لاَ يُؤَدِّي حَقَّ مَالِهِ إِلاَّ جُعِلَ لَهُ طَوْقًا فِي عُنُقِهِ شُجَاعٌ أَقْرَعُ وَهُوَ يَفِرُّ مِنْهُ وَهُوَ يَتْبَعُهُ ‏\"‏ ‏.‏ ثُمَّ قَرَأَ مِصْدَاقَهُ مِنْ كِتَابِ اللَّهِ عَزَّ وَجَلَّ ‏{‏ وَلاَ تَحْسَبَنَّ الَّذِينَ يَبْخَلُونَ بِمَا آتَاهُمُ اللَّهُ مِنْ فَضْلِهِ هُوَ خَيْرًا لَهُمْ بَلْ هُوَ شَرٌّ لَهُمْ سَيُطَوَّقُونَ مَا بَخِلُوا بِهِ يَوْمَ الْقِيَامَةِ ‏}‏ الآيَةَ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: 'Tidaklah seorang lelaki yang mempunyai harta tetapi tidak menunaikan hak hartanya, melainkan akan dijadikan seekor ular botak (Shuja'a) mengelilingi lehernya, dan dia akan lari dari (mendapati balasan daripada) Kitab Allah: 'Dan janganlah sekali-kali orang-orang yang bakhil (kedekut) dengan apa yang telah dikurniakan Allah kepada mereka dari limpah kurniaNya (harta), menyangka bahawa (perbuatan bakhil itu) baik bagi mereka. Bahkan (sebenarnya) ia buruk bagi mereka. Harta yang mereka bakhilkan itu akan dikalungkan di leher mereka pada hari kiamat.' "
  },
  {
    "id": 17183,
    "hadith_number": 2447,
    "tajuk_hadith": "Hukuman bagi Mereka yang Tidak Membayar Zakat Haiwan Ternakan",
    "perawi_melayu": "Abu Hurairah berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، قَالَ حَدَّثَنَا قَتَادَةُ، عَنْ أَبِي عَمْرٍو الْغُدَانِيِّ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ أَيُّمَا رَجُلٍ كَانَتْ لَهُ إِبِلٌ لاَ يُعْطِي حَقَّهَا فِي نَجْدَتِهَا وَرِسْلِهَا ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ مَا نَجْدَتُهَا وَرِسْلُهَا قَالَ ‏\"‏ فِي عُسْرِهَا وَيُسْرِهَا فَإِنَّهَا تَأْتِي يَوْمَ الْقِيَامَةِ كَأَغَذِّ مَا كَانَتْ وَأَسْمَنِهِ وَآشَرِهِ يُبْطَحُ لَهَا بِقَاعٍ قَرْقَرٍ فَتَطَؤُهُ بِأَخْفَافِهَا إِذَا جَاءَتْ أُخْرَاهَا أُعِيدَتْ عَلَيْهِ أُولاَهَا فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ حَتَّى يُقْضَى بَيْنَ النَّاسِ فَيَرَى سَبِيلَهُ وَأَيُّمَا رَجُلٍ كَانَتْ لَهُ بَقَرٌ لاَ يُعْطِي حَقَّهَا فِي نَجْدَتِهَا وَرِسْلِهَا فَإِنَّهَا تَأْتِي يَوْمَ الْقِيَامَةِ أَغَذَّ مَا كَانَتْ وَأَسْمَنَهُ وَآشَرَهُ يُبْطَحُ لَهَا بِقَاعٍ قَرْقَرٍ فَتَنْطَحُهُ كُلُّ ذَاتِ قَرْنٍ بِقَرْنِهَا وَتَطَؤُهُ كُلُّ ذَاتِ ظِلْفٍ بِظِلْفِهَا إِذَا جَاوَزَتْهُ أُخْرَاهَا أُعِيدَتْ عَلَيْهِ أُولاَهَا فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ حَتَّى يُقْضَى بَيْنَ النَّاسِ فَيَرَى سَبِيلَهُ وَأَيُّمَا رَجُلٍ كَانَتْ لَهُ غَنَمٌ لاَ يُعْطِي حَقَّهَا فِي نَجْدَتِهَا وَرِسْلِهَا فَإِنَّهَا تَأْتِي يَوْمَ الْقِيَامَةِ كَأَغَذِّ مَا كَانَتْ وَأَكْثَرِهِ وَأَسْمَنِهِ وَآشَرِهِ ثُمَّ يُبْطَحُ لَهَا بِقَاعٍ قَرْقَرٍ فَتَطَؤُهُ كُلُّ ذَاتِ ظِلْفٍ بِظِلْفِهَا وَتَنْطَحُهُ كُلُّ ذَاتِ قَرْنٍ بِقَرْنِهَا لَيْسَ فِيهَا عَقْصَاءُ وَلاَ عَضْبَاءُ إِذَا جَاوَزَتْهُ أُخْرَاهَا أُعِيدَتْ عَلَيْهِ أُولاَهَا فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ حَتَّى يُقْضَى بَيْنَ النَّاسِ فَيَرَى سَبِيلَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Saya mendengar Rasulullah ﷺ bersabda: “Mana-mana lelaki yang memiliki unta tetapi tidak membayar haknya (zakat) dalam masa senang atau susah, ia akan datang pada Hari Kiamat dalam keadaan yang paling gemuk dan paling sihat seperti yang pernah ada. Dia akan dibaringkan dalam kawasan yang rata, lalu unta-unta itu akan memijaknya dengan kaki-kaki mereka. Apabila yang terakhir daripada mereka telah berlalu, yang pertama akan kembali semula kepadanya, pada hari yang panjangnya lima puluh ribu tahun, sehingga keputusan dibuat di kalangan manusia, dan dia menyedari kesudahannya. Mana-mana lelaki yang memiliki lembu tetapi tidak membayar haknya (zakat) dalam masa susah atau senang, mereka akan datang pada Hari Kiamat dalam keadaan yang paling gemuk dan paling sihat seperti yang pernah ada. Dia akan dibaringkan dalam kawasan yang rata, lalu lembu-lembu itu akan memijaknya dengan kaki berbelah mereka. Apabila yang terakhir daripada mereka telah berlalu, yang pertama akan kembali semula kepadanya, pada hari yang panjangnya lima puluh ribu tahun, sehingga keputusan dibuat di kalangan manusia, dan dia menyedari kesudahannya. Mana-mana lelaki yang memiliki kambing tetapi tidak membayar haknya (zakat) dalam masa susah atau senang, mereka akan datang pada Hari Kiamat dalam keadaan yang paling gemuk dan paling sihat seperti yang pernah ada. Dia akan dibaringkan dalam kawasan yang rata, lalu kambing-kambing itu akan memijaknya dengan kaki berbelah mereka, dan setiap yang bertanduk akan menanduknya dengan tanduknya, dan tidak ada yang bertanduk bengkok atau patah. Apabila yang terakhir daripada mereka telah berlalu, yang pertama akan kembali semula kepadanya, pada hari yang panjangnya lima puluh ribu tahun, sehingga keputusan dibuat di kalangan manusia, dan dia menyedari kesudahannya.”"
  },
  {
    "id": 17184,
    "hadith_number": 2448,
    "tajuk_hadith": "Abu Bakr Memerangi Mereka yang Enggan Membayar Zakat",
    "perawi_melayu": "Daripada Abu Hurairah r.a.",
    "english_text": "\"When the Messenger of Allah died, and Abu Bakr became the Khalifah after him, and some of the 'Arabs reverted to disbelief. 'umar said to Abu Bakr: 'How can you fight the people when the Messenger of allah said: \"I have been commanded to fight the people until they say La ilaha illallah (there is none worthy of worship but Allah). Whoever says La ilaha illah, his wealth and his life safe from me, unless he deserves a legal punishment justly, and his reckoning will be with Allah?\"'  Abu Bakr, may Allah be pleased with him, said: 'I will fight anyone who separates prayer and Zakah; Zakah is the compulsory right to be taken from wealth. By Allah, if they withhold from me a rope that they used to give to the Messenger of Allah, I will fight them for wiholding it.' 'Umar, may Allah be pleased with him, said: 'By Allah, it was as if I saw that Allah has opened the heart of Abu Bakr for fighting, and I knew that I was the truth.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ لَمَّا تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَاسْتُخْلِفَ أَبُو بَكْرٍ بَعْدَهُ وَكَفَرَ مَنْ كَفَرَ مِنَ الْعَرَبِ قَالَ عُمَرُ لأَبِي بَكْرٍ كَيْفَ تُقَاتِلُ النَّاسَ وَقَدْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللَّهُ فَمَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ عَصَمَ مِنِّي مَالَهُ وَنَفْسَهُ إِلاَّ بِحَقِّهِ وَحِسَابُهُ عَلَى اللَّهِ ‏\"‏ ‏.‏ فَقَالَ أَبُو بَكْرٍ رضى الله عنه لأُقَاتِلَنَّ مَنْ فَرَّقَ بَيْنَ الصَّلاَةِ وَالزَّكَاةِ فَإِنَّ الزَّكَاةَ حَقُّ الْمَالِ وَاللَّهِ لَوْ مَنَعُونِي عِقَالاً كَانُوا يُؤَدُّونَهُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم لَقَاتَلْتُهُمْ عَلَى مَنْعِهِ ‏.‏ قَالَ عُمَرُ رضى الله عنه فَوَاللَّهِ مَا هُوَ إِلاَّ أَنْ رَأَيْتُ اللَّهَ شَرَحَ صَدْرَ أَبِي بَكْرٍ لِلْقِتَالِ فَعَرَفْتُ أَنَّهُ الْحَقُّ ‏.‏",
    "malay_translation": "Ketika Rasulullah SAW wafat, dan Abu Bakar menjadi Khalifah selepasnya, dan sebahagian daripada orang Arab kembali kepada kekufuran. Umar berkata kepada Abu Bakar: 'Bagaimana kamu hendak memerangi manusia sedangkan Rasulullah SAW bersabda: \"Aku diperintahkan untuk memerangi manusia sehingga mereka mengucapkan La ilaha illallah (tiada tuhan yang layak disembah melainkan Allah). Sesiapa yang mengucapkan La ilaha illallah, maka hartanya dan nyawanya terpelihara dariku, kecuali jika dia melakukan hukuman syariah, dan perhitungan amalnya kepada Allah?\"' Abu Bakar r.a. berkata: 'Aku akan memerangi sesiapa sahaja yang memisahkan solat dan zakat; zakat adalah hak yang wajib diambil daripada harta. Demi Allah, sekiranya mereka menahan dariku seutas tali yang mereka berikan kepada Rasulullah SAW, nescaya akan aku perangi mereka kerana menahannya.' Umar r.a. berkata: 'Demi Allah, seolah-olah aku melihat Allah telah melapangkan dada Abu Bakar untuk berperang, dan aku tahu bahawa dialah yang benar.'"
  },
  {
    "id": 17185,
    "hadith_number": 2449,
    "tajuk_hadith": "Kewajipan Zakat Unta dan Larangan Bagi Keluarga Nabi Muhammad ﷺ",
    "perawi_melayu": "Bahz bin Hakim berkata:",
    "english_text": "\"My father told, me that my grandfather said: 'I heard the Prophet say: With regard to grazing camels, for every forty a Bint Labbun (a two-year old female camel). No differentiation is to be made between camels when calculating them. Whoever gives it seeking reward, he will be rewarded for it. Whoever refuses, we will take it, and half of his camels, as one of the rights of our Lord. And it is not permissible for the family of Muhammad to have any of them.\"'",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا بَهْزُ بْنُ حَكِيمٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ جَدِّي، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ فِي كُلِّ إِبِلٍ سَائِمَةٍ فِي كُلِّ أَرْبَعِينَ ابْنَةُ لَبُونٍ لاَ يُفَرَّقُ إِبِلٌ عَنْ حِسَابِهَا مَنْ أَعْطَاهَا مُؤْتَجِرًا فَلَهُ أَجْرُهَا وَمَنْ أَبَى فَإِنَّا آخِذُوهَا وَشَطْرَ إِبِلِهِ عَزْمَةٌ مِنْ عَزَمَاتِ رَبِّنَا لاَ يَحِلُّ لآلِ مُحَمَّدٍ صلى الله عليه وسلم مِنْهَا شَىْءٌ ‏\"‏ ‏.‏",
    "malay_translation": "Bapaku menceritakan kepadaku bahawa datukku berkata: 'Aku mendengar Nabi ﷺ bersabda: 'Berkenaan dengan unta yang meragut, bagi setiap empat puluh ekor adalah Bint Labbun (untara betina berusia dua tahun). Tiada perbezaan dibuat antara unta-unta itu ketika mengiranya. Sesiapa yang memberinya kerana mengharapkan ganjaran, maka baginya ganjaran itu. Sesiapa yang enggan, kami akan mengambilnya dan separuh daripada untanya, sebagai salah satu hak Tuhan kami. Dan tidak halal bagi keluarga Muhammad ﷺ untuk memiliki apa-apa daripadanya.'"
  },
  {
    "id": 17186,
    "hadith_number": 2450,
    "tajuk_hadith": "Kewajipan Zakat dalam Harta",
    "perawi_melayu": "Daripada Abu Sa'eed Al-Khudri bahawa Rasulullah ﷺ bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي عَمْرُو بْنُ يَحْيَى، ح وَأَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، عَنْ عَبْدِ الرَّحْمَنِ، عَنْ سُفْيَانَ، وَشُعْبَةَ، وَمَالِكٍ، عَنْ عَمْرِو بْنِ يَحْيَى، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ وَلاَ فِيمَا دُونَ خَمْسِ ذَوْدٍ صَدَقَةٌ وَلاَ فِيمَا دُونَ خَمْسَةِ أَوَاقٍ صَدَقَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Tiada sadaqah (zakat) wajib pada kurang daripada lima Awsuq (ukuran sukatan). Tiada sadaqah pada kurang daripada lima ekor unta, dan tiada sadaqah pada kurang daripada lima Awq (ukuran matawang)."
  },
  {
    "id": 17187,
    "hadith_number": 2451,
    "tajuk_hadith": "Kewajipan Zakat: Nisab Unta, Dirham, dan Sa' (Gandum)",
    "perawi_melayu": "Daripada Abu Saeed Al-Khudri bahawa Rasulullah ﷺ bersabda:",
    "english_text": "\"No Sadaqah is due on less than five Dhawd (head of camel), and no Sadaqah is due on less than five Awaq, and no Sadaqah is due on less than five Awsuq.\"",
    "arabic_text": "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ، قَالَ أَنْبَأَنَا اللَّيْثُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرِو بْنِ يَحْيَى بْنِ عُمَارَةَ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَيْسَ فِيمَا دُونَ خَمْسَةِ ذَوْدٍ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسَةِ أَوَاقٍ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Tiada sedekah (zakat) wajib ke atas kurang daripada lima ekor unta (Dhawd), tiada sedekah wajib ke atas kurang daripada lima Awaq (dirham), dan tiada sedekah wajib ke atas kurang daripada lima Awsuq (sa' gandum)."
  },
  {
    "id": 17188,
    "hadith_number": 2452,
    "tajuk_hadith": "Kadar Zakat Haiwan Ternakan dan Harta",
    "perawi_melayu": "Diriwayatkan daripada Anas bin Malik bahawa Abu Bakar menulis kepada mereka:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا الْمُظَفَّرُ بْنُ مُدْرِكٍ أَبُو كَامِلٍ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، قَالَ أَخَذْتُ هَذَا الْكِتَابَ مِنْ ثُمَامَةَ بْنِ عَبْدِ اللَّهِ بْنِ أَنَسِ بْنِ مَالِكٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ أَبَا بَكْرٍ كَتَبَ لَهُمْ إِنَّ هَذِهِ فَرَائِضُ الصَّدَقَةِ الَّتِي فَرَضَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الْمُسْلِمِينَ الَّتِي أَمَرَ اللَّهُ عَزَّ وَجَلَّ بِهَا رَسُولَهُ صلى الله عليه وسلم فَمَنْ سُئِلَهَا مِنَ الْمُسْلِمِينَ عَلَى وَجْهِهَا فَلْيُعْطِ وَمَنْ سُئِلَ فَوْقَ ذَلِكَ فَلاَ يُعْطِ فِيمَا دُونَ خَمْسٍ وَعِشْرِينَ مِنَ الإِبِلِ فِي كُلِّ خَمْسِ ذَوْدٍ شَاةٌ فَإِذَا بَلَغَتْ خَمْسًا وَعِشْرِينَ فَفِيهَا بِنْتُ مَخَاضٍ إِلَى خَمْسٍ وَثَلاَثِينَ فَإِنْ لَمْ تَكُنْ بِنْتُ مَخَاضٍ فَابْنُ لَبُونٍ ذَكَرٌ فَإِذَا بَلَغَتْ سِتًّا وَثَلاَثِينَ فَفِيهَا بِنْتُ لَبُونٍ إِلَى خَمْسٍ وَأَرْبَعِينَ فَإِذَا بَلَغَتْ سِتَّةً وَأَرْبَعِينَ فَفِيهَا حِقَّةٌ طَرُوقَةُ الْفَحْلِ إِلَى سِتِّينَ فَإِذَا بَلَغَتْ إِحْدَى وَسِتِّينَ فَفِيهَا جَذَعَةٌ إِلَى خَمْسٍ وَسَبْعِينَ فَإِذَا بَلَغَتْ سِتًّا وَسَبْعِينَ فَفِيهَا بِنْتَا لَبُونٍ إِلَى تِسْعِينَ فَإِذَا بَلَغَتْ إِحْدَى وَتِسْعِينَ فَفِيهَا حِقَّتَانِ طَرُوقَتَا الْفَحْلِ إِلَى عِشْرِينَ وَمِائَةٍ فَإِذَا زَادَتْ عَلَى عِشْرِينَ وَمِائَةٍ فَفِي كُلِّ أَرْبَعِينَ بِنْتُ لَبُونٍ وَفِي كُلِّ خَمْسِينَ حِقَّةٌ فَإِذَا تَبَايَنَ أَسْنَانُ الإِبِلِ فِي فَرَائِضِ الصَّدَقَاتِ فَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ الْجَذَعَةِ وَلَيْسَتْ عِنْدَهُ جَذَعَةٌ وَعِنْدَهُ حِقَّةٌ فَإِنَّهَا تُقْبَلُ مِنْهُ الْحِقَّةُ وَيَجْعَلُ مَعَهَا شَاتَيْنِ إِنِ اسْتَيْسَرَتَا لَهُ أَوْ عِشْرِينَ دِرْهَمًا وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ الْحِقَّةِ وَلَيْسَتْ عِنْدَهُ حِقَّةٌ وَعِنْدَهُ جَذَعَةٌ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيُعْطِيهِ الْمُصَدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ إِنِ اسْتَيْسَرَتَا لَهُ وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ الْحِقَّةِ وَلَيْسَتْ عِنْدَهُ وَعِنْدَهُ بِنْتُ لَبُونٍ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيَجْعَلُ مَعَهَا شَاتَيْنِ إِنِ اسْتَيْسَرَتَا لَهُ أَوْ عِشْرِينَ دِرْهَمًا وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ ابْنَةِ لَبُونٍ وَلَيْسَتْ عِنْدَهُ إِلاَّ حِقَّةٌ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيُعْطِيهِ الْمُصَدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ ابْنَةِ لَبُونٍ وَلَيْسَتْ عِنْدَهُ بِنْتُ لَبُونٍ وَعِنْدَهُ بِنْتُ مَخَاضٍ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيَجْعَلُ مَعَهَا شَاتَيْنِ إِنِ اسْتَيْسَرَتَا لَهُ أَوْ عِشْرِينَ دِرْهَمًا وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ ابْنَةِ مَخَاضٍ وَلَيْسَ عِنْدَهُ إِلاَّ ابْنُ لَبُونٍ ذَكَرٌ فَإِنَّهُ يُقْبَلُ مِنْهُ وَلَيْسَ مَعَهُ شَىْءٌ وَمَنْ لَمْ يَكُنْ عِنْدَهُ إِلاَّ أَرْبَعٌ مِنَ الإِبِلِ فَلَيْسَ فِيهَا شَىْءٌ إِلاَّ أَنْ يَشَاءَ رَبُّهَا وَفِي صَدَقَةِ الْغَنَمِ فِي سَائِمَتِهَا إِذَا كَانَتْ أَرْبَعِينَ فَفِيهَا شَاةٌ إِلَى عِشْرِينَ وَمِائَةٍ فَإِذَا زَادَتْ وَاحِدَةٌ فَفِيهَا شَاتَانِ إِلَى مِائَتَيْنِ فَإِذَا زَادَتْ وَاحِدَةٌ فَفِيهَا ثَلاَثُ شِيَاهٍ إِلَى ثَلاَثِمِائَةٍ فَإِذَا زَادَتْ فَفِي كُلِّ مِائَةٍ شَاةٌ وَلاَ يُؤْخَذُ فِي الصَّدَقَةِ هَرِمَةٌ وَلاَ ذَاتُ عَوَارٍ وَلاَ تَيْسُ الْغَنَمِ إِلاَّ أَنْ يَشَاءَ الْمُصَّدِّقُ وَلاَ يُجْمَعُ بَيْنَ مُتَفَرِّقٍ وَلاَ يُفَرَّقُ بَيْنَ مُجْتَمِعٍ خَشْيَةَ الصَّدَقَةِ وَمَا كَانَ مِنْ خَلِيطَيْنِ فَإِنَّهُمَا يَتَرَاجَعَانِ بَيْنَهُمَا بِالسَّوِيَّةِ فَإِذَا كَانَتْ سَائِمَةُ الرَّجُلِ نَاقِصَةً مِنْ أَرْبَعِينَ شَاةٌ وَاحِدَةٌ فَلَيْسَ فِيهَا شَىْءٌ إِلاَّ أَنْ يَشَاءَ رَبُّهَا وَفِي الرِّقَةِ رُبُعُ الْعُشْرِ فَإِنْ لَمْ تَكُنْ إِلاَّ تِسْعِينَ وَمِائَةَ دِرْهَمٍ فَلَيْسَ فِيهَا شَىْءٌ إِلاَّ أَنْ يَشَاءَ رَبُّهَا ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Anas bin Malik رضي الله عنهم, bahawa Abu Bakar رضي الله عنهم telah menulis kepada mereka: \"Ini adalah kewajipan sedekah yang telah difardhukan oleh Rasulullah ﷺ kepada umat Islam, sebagaimana yang diperintahkan oleh Allah ﷻ kepada Rasul-Nya ﷺ. Sesiapa yang diminta untuk sedekah tersebut (sebagaimana dijelaskan), hendaklah dia memberinya, dan sesiapa yang diminta lebih daripada itu, janganlah dia memberinya. Bagi (harta) yang kurang daripada dua puluh lima ekor unta, bagi setiap lima ekor unta, (wajib) satu ekor kambing. Jika bilangannya mencapai dua puluh lima ekor, maka (wajib) Bint Makhad (unta betina berumur satu tahun), sehingga tiga puluh lima ekor. Jika Bint Makhad tidak ada, maka (wajib) Bin Labun (unta jantan berumur dua tahun). Jika bilangannya mencapai tiga puluh enam ekor, maka (wajib) Bint Labun (unta betina berumur dua tahun), sehingga empat puluh lima ekor. Jika bilangannya mencapai empat puluh enam ekor, maka (wajib) Hiqqah (unta betina berumur tiga tahun) yang telah hamil, sehingga enam puluh ekor. Jika bilangannya mencapai enam puluh satu ekor, maka (wajib) Jadz'ah (unta betina berumur empat tahun), sehingga tujuh puluh enam ekor. Kemudian, (wajib) dua Bint Labun (unta betina berumur dua tahun), sehingga sembilan puluh ekor. Jika bilangannya mencapai sembilan puluh satu ekor, maka (wajib) dua Hiqqah (unta betina berumur tiga tahun) yang telah hamil, sehingga seratus dua puluh ekor. Jika terdapat lebih daripada seratus dua puluh ekor, maka bagi setiap empat puluh ekor (wajib) Bint Labun, dan bagi setiap lima puluh ekor (wajib) Hiqqah. Sekiranya seseorang itu tidak mempunyai unta yang berumur seperti yang ditetapkan mengikut peraturan Hiqqah, maka jika seseorang itu berhutang Jadz'ah sebagai sedekah tetapi dia tidak mempunyai Jadz'ah, maka Hiqqah hendaklah diterima daripadanya, dan dia hendaklah memberikan dua ekor kambing bersamanya jika ada, atau dua puluh Dirham. Jika dia berhutang Hiqqah sebagai sedekah dan dia tidak mempunyai Hiqqah tetapi dia mempunyai Jadz'ah, maka ia hendaklah diterima daripadanya, dan pengumpul zakat hendaklah memberinya dua puluh Dirham, atau dua ekor kambing jika ada. Jika seseorang itu berhutang Hiqqah sebagai sedekah dan dia tidak mempunyainya, tetapi dia mempunyai Bint Labun, ia hendaklah diterima daripadanya, dan dia hendaklah memberikan dua ekor kambing bersamanya jika ada, atau dua puluh Dirham. Jika seseorang itu berhutang Bint Labun sebagai sedekah tetapi dia hanya mempunyai Hiqqah, maka ia hendaklah diterima daripadanya dan pengumpul zakat hendaklah memberinya dua puluh Dirham, atau dua ekor kambing. Jika seseorang itu berhutang Bint Labun sebagai sedekah tetapi dia hanya mempunyai Bint Makhad, maka ia hendaklah diterima daripadanya, dan dia hendaklah memberikan dua ekor kambing bersamanya jika ada, atau dua puluh Dirham. Jika seseorang itu berhutang Bint Makhad sebagai sedekah tetapi dia hanya mempunyai Bin Labun, jantan; ia hendaklah diterima daripadanya, dan dia tidak perlu memberikan apa-apa lagi bersamanya. Jika seseorang itu hanya mempunyai empat ekor unta, dia tidak perlu memberikan apa-apa melainkan pemiliknya mahu. Berkenaan dengan sedekah ke atas kambing yang meragut, jika terdapat empat puluh ekor, maka satu ekor kambing wajib ke atas mereka, sehingga seratus dua puluh ekor. Jika ada satu lagi, maka dua ekor kambing wajib, sehingga dua ratus ekor. Jika ada satu lagi, maka tiga ekor kambing wajib, sehingga tiga ratus ekor. Jika ada lebih daripada itu, maka bagi setiap seratus ekor, satu ekor kambing wajib. Tidak boleh diambil sebagai sedekah kambing yang lemah, cacat atau jantan melainkan pengumpul zakat mahu. Jangan gabungkan kawanan yang berasingan atau gabungkan kawanan yang berasingan kerana takut sedekah. Setiap rakan kongsi (yang mempunyai bahagian dalam kawanan gabungan) hendaklah membayar sedekah mengikut kadar bahagiannya. Jika kawanan seseorang itu kurang daripada empat puluh ekor kambing, maka tiada apa-apa yang wajib daripada mereka, melainkan pemiliknya mahu. Berkenaan dengan perak, satu perempat daripada satu persepuluh, dan jika hanya terdapat seratus sembilan puluh Dirham, tiada zakat yang wajib melainkan pemiliknya mahu.\" "
  },
  {
    "id": 17189,
    "hadith_number": 2453,
    "tajuk_hadith": "Balasan Terhadap Harta Zakat yang Tidak Dikeluarkan",
    "perawi_melayu": "Abu Hurairah berkata:",
    "english_text": "\"Not Available\"",
    "arabic_text": "أَخْبَرَنَا عِمْرَانُ بْنُ بَكَّارٍ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ، قَالَ حَدَّثَنَا شُعَيْبٌ، قَالَ حَدَّثَنِي أَبُو الزِّنَادِ، مِمَّا حَدَّثَهُ عَبْدُ الرَّحْمَنِ الأَعْرَجُ، مِمَّا ذَكَرَ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يُحَدِّثُ بِهِ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ تَأْتِي الإِبِلُ عَلَى رَبِّهَا عَلَى خَيْرِ مَا كَانَتْ إِذَا هِيَ لَمْ يُعْطِ فِيهَا حَقَّهَا تَطَؤُهُ بِأَخْفَافِهَا وَتَأْتِي الْغَنَمُ عَلَى رَبِّهَا عَلَى خَيْرِ مَا كَانَتْ إِذَا لَمْ يُعْطِ فِيهَا حَقَّهَا تَطَؤُهُ بِأَظْلاَفِهَا وَتَنْطَحُهُ بِقُرُونِهَا - قَالَ - وَمِنْ حَقِّهَا أَنْ تُحْلَبَ عَلَى الْمَاءِ أَلاَ لاَ يَأْتِيَنَّ أَحَدُكُمْ يَوْمَ الْقِيَامَةِ بِبَعِيرٍ يَحْمِلُهُ عَلَى رَقَبَتِهِ لَهُ رُغَاءٌ فَيَقُولُ يَا مُحَمَّدُ ‏.‏ فَأَقُولُ لاَ أَمْلِكُ لَكَ شَيْئًا قَدْ بَلَّغْتُ ‏.‏ أَلاَ لاَ يَأْتِيَنَّ أَحَدُكُمْ يَوْمَ الْقِيَامَةِ بِشَاةٍ يَحْمِلُهَا عَلَى رَقَبَتِهِ لَهَا يُعَارٌ فَيَقُولُ يَا مُحَمَّدُ ‏.‏ فَأَقُولُ لاَ أَمْلِكُ لَكَ شَيْئًا قَدْ بَلَّغْتُ - قَالَ - وَيَكُونُ كَنْزُ أَحَدِهِمْ يَوْمَ الْقِيَامَةِ شُجَاعًا أَقْرَعَ يَفِرُّ مِنْهُ صَاحِبُهُ وَيَطْلُبُهُ أَنَا كَنْزُكَ فَلاَ يَزَالُ حَتَّى يُلْقِمَهُ أُصْبُعَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: '(Pada Hari Kiamat) unta akan datang kepada pemiliknya dalam keadaan kesihatan yang terbaik sebagaimana yang pernah ada (di dunia ini) dan jika dia tidak membayar haknya, mereka akan memijaknya dengan kaki mereka. Kambing akan datang kepada pemiliknya dalam keadaan kesihatan yang terbaik sebagaimana yang pernah ada (di dunia ini) dan jika dia tidak membayar haknya, mereka akan memijaknya dengan kuku dan menanduknya dengan tanduk mereka. Dan di antara hak mereka ialah mereka harus diperah dengan air di hadapan mereka. Aku tidak mahu seorang pun daripada kamu datang pada Hari Kiamat dengan seekor unta yang merintih di lehernya, sambil berkata, 'Wahai Muhammad,' dan aku akan berkata: 'Aku tidak dapat berbuat apa-apa untukmu, aku telah menyampaikan. Aku tidak mahu seorang pun daripada kamu datang pada Hari Kiamat dengan seekor kambing yang mengembek di lehernya, sambil berkata, 'Wahai Muhammad,' dan aku akan berkata: 'Aku tidak dapat berbuat apa-apa untukmu, aku telah menyampaikan.' Dan pada Hari Kiamat, harta yang disimpan oleh salah seorang daripada kamu akan menjadi syuja' (ular) botak yang mana pemiliknya akan melarikan diri daripadanya, tetapi ia akan mengejarnya (sambil berkata), 'Aku adalah harta simpananmu,' dan ia akan terus (mengejarnya) sehingga dia memasukkan jarinya ke dalam mulutnya.'"
  },
  {
    "id": 17190,
    "hadith_number": 2454,
    "tajuk_hadith": "Kewajipan Zakat Haiwan Ternakan dan Larangan Bagi Keluarga Nabi Muhammad SAW",
    "perawi_melayu": "Bahz bin Hakim meriwayatkan daripada bapanya bahawa datuknya berkata:",
    "english_text": "\"I heard the Messenger of Allah say: 'With regard to grazing camels, for every forty a Bint Labun. No differentiation is to be made between camels when calculating them. Whoever gives it seeking reward will be rewarded for it. Whoever refuses, we will take it and half of his camels, as one of the rights of our Lord. And it is not permissible for the family of Muhammad to have any of them.\"'",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ بَهْزَ بْنَ حَكِيمٍ، يُحَدِّثُ عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ فِي كُلِّ إِبِلٍ سَائِمَةٍ مِنْ كُلِّ أَرْبَعِينَ ابْنَةُ لَبُونٍ لاَ تُفَرَّقُ إِبِلٌ عَنْ حِسَابِهَا مَنْ أَعْطَاهَا مُؤْتَجِرًا لَهُ أَجْرُهَا وَمَنْ مَنَعَهَا فَإِنَّا آخِذُوهَا وَشَطْرَ إِبِلِهِ عَزْمَةً مِنْ عَزَمَاتِ رَبِّنَا لاَ يَحِلُّ لآلِ مُحَمَّدٍ صلى الله عليه وسلم مِنْهَا شَىْءٌ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda: 'Bagi setiap empat puluh ekor unta yang digembalakan, (wajib) Bint Labun. Tidak boleh dibezakan unta-unta itu ketika mengira jumlahnya. Sesiapa yang memberikannya kerana mencari ganjaran, maka baginya pahala. Dan sesiapa yang enggan, maka kami akan mengambilnya dan separuh daripada untanya, sebagai salah satu hak Tuhan kami. Dan tidak halal bagi keluarga Muhammad SAW mengambil sedikit pun daripadanya.'"
  },
  {
    "id": 17191,
    "hadith_number": 2455,
    "tajuk_hadith": "Zakat Dinar dan Ternakan di Yaman",
    "perawi_melayu": "Daripada Muadh:",
    "english_text": "That the Messenger of Allah sent him to Yemen, and he commanded him to take a Dinar, or its equivalent in Maafr, from each person who had reached the age of puberty. And with regard to cattle, from every thirty a male or female Tabi '(two-year-old). And from every forty a Musinnah (three-year-old). (Daif)",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، قَالَ حَدَّثَنَا مُفَضَّلٌ، - وَهُوَ ابْنُ مُهَلْهَلٍ - عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ مَسْرُوقٍ، عَنْ مُعَاذٍ، ‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَهُ إِلَى الْيَمَنِ وَأَمَرَهُ أَنْ يَأْخُذَ مِنْ كُلِّ حَالِمٍ دِينَارًا أَوْ عِدْلَهُ مَعَافِرَ وَمِنَ الْبَقَرِ مِنْ ثَلاَثِينَ تَبِيعًا أَوْ تَبِيعَةً وَمِنْ كُلِّ أَرْبَعِينَ مُسِنَّةً ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ telah mengutusnya ke Yaman, dan baginda memerintahkannya untuk mengambil satu Dinar, atau nilai yang setara dalam Maafr, daripada setiap orang yang telah mencapai usia baligh. Dan berkenaan dengan ternakan, daripada setiap tiga puluh ekor, seekor Tabi' jantan atau betina (berusia dua tahun). Dan daripada setiap empat puluh ekor, seekor Musinnah (berusia tiga tahun)."
  },
  {
    "id": 17192,
    "hadith_number": 2456,
    "tajuk_hadith": "Zakat Lembu dan Bayaran untuk Penduduk Yemen",
    "perawi_melayu": "Muadh berkata:",
    "english_text": "\"The Messenger of Allah sent me to Yemen, and he commanded me to take from every forty cows, a cow in its third year, and from every thirty, a Tabi '(two-year-old), and from every person who had reached the age of puberty a Dinar or is equivalent in Maafir.\" (Daif)",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا يَعْلَى، - وَهُوَ ابْنُ عُبَيْدٍ - قَالَ حَدَّثَنَا الأَعْمَشُ، عَنْ شَقِيقٍ، عَنْ مَسْرُوقٍ، وَالأَعْمَشُ، عَنْ إِبْرَاهِيمَ، قَالاَ قَالَ مُعَاذٌ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى الْيَمَنِ فَأَمَرَنِي أَنْ آخُذَ مِنْ كُلِّ أَرْبَعِينَ بَقَرَةً ثَنِيَّةً وَمِنْ كُلِّ ثَلاَثِينَ تَبِيعًا وَمِنْ كُلِّ حَالِمٍ دِينَارًا أَوْ عِدْلَهُ مَعَافِرَ ‏.‏",
    "malay_translation": "Rasulullah SAW mengutusku ke Yemen, dan Baginda memerintahkanku untuk mengambil daripada setiap empat puluh ekor lembu, seekor lembu yang berumur tiga tahun, dan daripada setiap tiga puluh ekor, seekor Tabi' (berumur dua tahun), dan daripada setiap orang yang telah mencapai usia baligh, satu Dinar atau nilai yang setara dengannya dalam Maafir."
  },
  {
    "id": 17193,
    "hadith_number": 2457,
    "tajuk_hadith": "Zakat Ternakan dan Pembayaran Dinar di Yaman",
    "perawi_melayu": "Mu'adh",
    "english_text": "That when the Messenger of Allah sent him to Yemen, he commanded him to take from every thirty, cattle a male or female Tabi'(two-year-old), and from every forty, a Musinnah (three-year-old), and from every person who had reached the age of puberty a Dinar or is equivalent in Ma'afir. (Da 'if)",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ مَسْرُوقٍ، عَنْ مُعَاذٍ، قَالَ لَمَّا بَعَثَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى الْيَمَنِ أَمَرَهُ أَنْ يَأْخُذَ مِنْ كُلِّ ثَلاَثِينَ مِنَ الْبَقَرِ تَبِيعًا أَوْ تَبِيعَةً وَمِنْ كُلِّ أَرْبَعِينَ مُسِنَّةً وَمِنْ كُلِّ حَالِمٍ دِينَارًا أَوْ عِدْلَهُ مَعَافِرَ ‏.‏",
    "malay_translation": "Ketika Rasulullah ﷺ mengutusnya ke Yaman, baginda memerintahkannya supaya mengambil dari setiap tiga puluh ekor lembu seekor Tabi' (jantan atau betina berusia dua tahun), dan dari setiap empat puluh ekor lembu seekor Musinnah (berusia tiga tahun), dan dari setiap orang yang telah mencapai usia baligh, satu Dinar atau nilai yang setara dalam Ma'afir. (Da'if)"
  },
  {
    "id": 17194,
    "hadith_number": 2458,
    "tajuk_hadith": "Perintah Rasulullah SAW Mengenai Zakat Lembu",
    "perawi_melayu": "Muadh kepada Yaman",
    "english_text": "The Messenger of Allah commanded me not to take any cattle until the number had reached thirty. If the number reached thirty, then a Jadh'ah calf in its second year, either male or female, was due on them, until the number reached forty. If the number reached forty. If the number reached forty, then a Musinnah was due on them.\" (Daif)",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ الطُّوسِيُّ، قَالَ حَدَّثَنَا يَعْقُوبُ، قَالَ حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، قَالَ حَدَّثَنِي سُلَيْمَانُ الأَعْمَشُ، عَنْ أَبِي وَائِلِ بْنِ سَلَمَةَ، عَنْ مُعَاذِ بْنِ جَبَلٍ، قَالَ أَمَرَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ بَعَثَنِي إِلَى الْيَمَنِ أَنْ لاَ آخُذَ مِنَ الْبَقَرِ شَيْئًا حَتَّى تَبْلُغَ ثَلاَثِينَ فَإِذَا بَلَغَتْ ثَلاَثِينَ فَفِيهَا عِجْلٌ تَابِعٌ جَذَعٌ أَوْ جَذَعَةٌ حَتَّى تَبْلُغَ أَرْبَعِينَ فَإِذَا بَلَغَتْ أَرْبَعِينَ فَفِيهَا بَقَرَةٌ مُسِنَّةٌ ‏.‏",
    "malay_translation": "Rasulullah SAW memerintahkan saya supaya tidak mengambil sebarang ternakan lembu sehingga jumlahnya mencapai tiga puluh ekor. Apabila jumlahnya mencapai tiga puluh ekor, maka wajib atas mereka anak lembu Jadh'ah (berumur dua tahun), sama ada jantan atau betina, sehinggalah jumlahnya mencapai empat puluh ekor. Apabila jumlahnya mencapai empat puluh ekor, maka wajib atas mereka seekor lembu Musinnah (lembu yang telah mencapai umur tertentu)."
  },
  {
    "id": 17195,
    "hadith_number": 2459,
    "tajuk_hadith": "Balasan bagi Pemilik Ternakan dan Harta yang Tidak Menunaikan Hak",
    "perawi_melayu": "Daripada Jabir bin Abdullah berkata:",
    "english_text": "\"The Messenger of Allah said: 'There is no owner of camels or cattle or sheep who does not give what is due on them, but he will be made to stand for them on the Day of Resurrection in a flat arena, and those with hooves will trample him with their hooves, and those with horns will gore him with their horns. And on that day there will be none that are hornless or have broken horns.' We said: 'O Messenger of Allah, what is due on them?' He said: Lending males for breeding, lending their buckets, and giving them to people to ride in the cause of Allah. And there is no owner of wealth who does not give what is due on it but a bald-headed Shujaawill appear to him on the Day of Resurrection; its owner will flee from it and it will chase him and say to him: This is your treasure which you used to hoard. When he realizes that he cannot escape it he will put his hand in its mouth and it will start to bite it as a stallion bites.\"'",
    "arabic_text": "أَخْبَرَنَا وَاصِلُ بْنُ عَبْدِ الأَعْلَى، عَنِ ابْنِ فُضَيْلٍ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا مِنْ صَاحِبِ إِبِلٍ وَلاَ بَقَرٍ وَلاَ غَنَمٍ لاَ يُؤَدِّي حَقَّهَا إِلاَّ وُقِفَ لَهَا يَوْمَ الْقِيَامَةِ بِقَاعٍ قَرْقَرٍ تَطَؤُهُ ذَاتُ الأَظْلاَفِ بِأَظْلاَفِهَا وَتَنْطَحُهُ ذَاتُ الْقُرُونِ بِقُرُونِهَا لَيْسَ فِيهَا يَوْمَئِذٍ جَمَّاءُ وَلاَ مَكْسُورَةُ الْقَرْنِ ‏\"‏ ‏.‏ قُلْنَا يَا رَسُولَ اللَّهِ وَمَاذَا حَقُّهَا قَالَ ‏\"‏ إِطْرَاقُ فَحْلِهَا وَإِعَارَةُ دَلْوِهَا وَحَمْلٌ عَلَيْهَا فِي سَبِيلِ اللَّهِ وَلاَ صَاحِبِ مَالٍ لاَ يُؤَدِّي حَقَّهُ إِلاَّ يُخَيَّلُ لَهُ يَوْمَ الْقِيَامَةِ شُجَاعٌ أَقْرَعُ يَفِرُّ مِنْهُ صَاحِبُهُ وَهُوَ يَتْبَعُهُ يَقُولُ لَهُ هَذَا كَنْزُكَ الَّذِي كُنْتَ تَبْخَلُ بِهِ فَإِذَا رَأَى أَنَّهُ لاَ بُدَّ لَهُ مِنْهُ أَدْخَلَ يَدَهُ فِي فِيهِ فَجَعَلَ يَقْضَمُهَا كَمَا يَقْضَمُ الْفَحْلُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Tidaklah seorang pemilik unta, lembu atau kambing yang tidak menunaikan haknya (zakatnya) melainkan dia akan diberdirikan di Padang Mahsyar pada Hari Kiamat, dan haiwan-haiwan tersebut akan memijaknya dengan kaki mereka, dan haiwan-haiwan yang bertanduk akan menanduknya dengan tanduk mereka. Dan pada hari itu tidak akan ada haiwan yang tidak bertanduk atau bertanduk patah.\" Kami bertanya: \"Wahai Rasulullah, apakah hak mereka itu?\" Baginda bersabda: \"Meminjamkan jantan untuk pembiakan, meminjamkan timba mereka, dan memberi mereka kepada orang ramai untuk ditunggangi di jalan Allah. Dan tidaklah seorang pemilik harta yang tidak menunaikan haknya (zakatnya) melainkan akan muncul kepadanya pada Hari Kiamat seekor ular botak (Shuja') yang pemiliknya akan lari daripadanya dan ia akan mengejarnya serta berkata kepadanya: 'Inilah hartamu yang dahulu kamu kedekut.' Apabila dia menyedari bahawa dia tidak dapat melarikan diri daripadanya, dia akan memasukkan tangannya ke dalam mulut ular itu dan ular itu akan menggigitnya seperti seekor jantan menggigit.\""
  },
  {
    "id": 17196,
    "hadith_number": 2460,
    "tajuk_hadith": "Kewajipan Zakat Unta dan Kambing: Ketentuan Abu Bakar",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ فَضَالَةَ بْنِ إِبْرَاهِيمَ النَّسَائِيُّ، قَالَ أَنْبَأَنَا شُرَيْحُ بْنُ النُّعْمَانِ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثُمَامَةَ بْنِ عَبْدِ اللَّهِ بْنِ أَنَسِ بْنِ مَالِكٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ أَبَا بَكْرٍ، رضى الله عنه كَتَبَ لَهُ أَنَّ هَذِهِ فَرَائِضُ الصَّدَقَةِ الَّتِي فَرَضَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الْمُسْلِمِينَ الَّتِي أَمَرَ اللَّهُ بِهَا رَسُولَهُ صلى الله عليه وسلم فَمَنْ سُئِلَهَا مِنَ الْمُسْلِمِينَ عَلَى وَجْهِهَا فَلْيُعْطِهَا وَمَنْ سُئِلَ فَوْقَهَا فَلاَ يُعْطِهِ فِيمَا دُونَ خَمْسٍ وَعِشْرِينَ مِنَ الإِبِلِ فِي خَمْسِ ذَوْدٍ شَاةٌ فَإِذَا بَلَغَتْ خَمْسًا وَعِشْرِينَ فَفِيهَا بِنْتُ مَخَاضٍ إِلَى خَمْسٍ وَثَلاَثِينَ فَإِنْ لَمْ تَكُنِ ابْنَةُ مَخَاضٍ فَابْنُ لَبُونٍ ذَكَرٌ فَإِذَا بَلَغَتْ سِتَّةً وَثَلاَثِينَ فَفِيهَا بِنْتُ لَبُونِ إِلَى خَمْسٍ وَأَرْبَعِينَ فَإِذَا بَلَغَتْ سِتَّةً وَأَرْبَعِينَ فَفِيهَا حِقَّةٌ طَرُوقَةُ الْفَحْلِ إِلَى سِتِّينَ فَإِذَا بَلَغَتْ إِحْدَى وَسِتِّينَ فَفِيهَا جَذَعَةٌ إِلَى خَمْسَةٍ وَسَبْعِينَ فَإِذَا بَلَغَتْ سِتَّةً وَسَبْعِينَ فَفِيهَا ابْنَتَا لَبُونٍ إِلَى تِسْعِينَ فَإِذَا بَلَغَتْ إِحْدَى وَتِسْعِينَ فَفِيهَا حِقَّتَانِ طَرُوقَتَا الْفَحْلِ إِلَى عِشْرِينَ وَمِائَةٍ فَإِذَا زَادَتْ عَلَى عِشْرِينَ وَمِائَةٍ فَفِي كُلِّ أَرْبَعِينَ ابْنَةُ لَبُونٍ وَفِي كُلِّ خَمْسِينَ حِقَّةٌ فَإِذَا تَبَايَنَ أَسْنَانُ الإِبِلِ فِي فَرَائِضِ الصَّدَقَاتِ فَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ الْجَذَعَةِ وَلَيْسَتْ عِنْدَهُ جَذَعَةٌ وَعِنْدَهُ حِقَّةٌ فَإِنَّهَا تُقْبَلُ مِنْهُ الْحِقَّةُ وَيَجْعَلُ مَعَهَا شَاتَيْنِ إِنِ اسْتَيْسَرَتَا لَهُ أَوْ عِشْرِينَ دِرْهَمًا وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ الْحِقَّةِ وَلَيْسَتْ عِنْدَهُ إِلاَّ جَذَعَةٌ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيُعْطِيهِ الْمُصَّدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ الْحِقَّةِ وَلَيْسَتْ عِنْدَهُ وَعِنْدَهُ ابْنَةُ لَبُونٍ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيَجْعَلُ مَعَهَا شَاتَيْنِ إِنِ اسْتَيْسَرَتَا لَهُ أَوْ عِشْرِينَ دِرْهَمًا وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ بِنْتِ لَبُونٍ وَلَيْسَتْ عِنْدَهُ إِلاَّ حِقَّةٌ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيُعْطِيهِ الْمُصَّدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ بِنْتِ لَبُونٍ وَعِنْدَهُ بِنْتُ مَخَاضٍ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيَجْعَلُ مَعَهَا شَاتَيْنِ إِنِ اسْتَيْسَرَتَا لَهُ أَوْ عِشْرِينَ دِرْهَمًا وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ ابْنَةِ مَخَاضٍ وَلَيْسَتْ عِنْدَهُ إِلاَّ ابْنُ لَبُونٍ ذَكَرٌ فَإِنَّهُ يُقْبَلُ مِنْهُ وَلَيْسَ مَعَهُ شَىْءٌ وَمَنْ لَمْ يَكُنْ عِنْدَهُ إِلاَّ أَرْبَعَةٌ مِنَ الإِبِلِ فَلَيْسَ فِيهَا شَىْءٌ إِلاَّ أَنْ يَشَاءَ رَبُّهَا وَفِي صَدَقَةِ الْغَنَمِ فِي سَائِمَتِهَا إِذَا كَانَتْ أَرْبَعِينَ فَفِيهَا شَاةٌ إِلَى عِشْرِينَ وَمِائَةٍ فَإِذَا زَادَتْ وَاحِدَةٌ فَفِيهَا شَاتَانِ إِلَى مِائَتَيْنِ فَإِذَا زَادَتْ وَاحِدَةٌ فَفِيهَا ثَلاَثُ شِيَاهٍ إِلَى ثَلاَثِمِائَةٍ فَإِذَا زَادَتْ وَاحِدَةٌ فَفِي كُلِّ مِائَةٍ شَاةٌ وَلاَ تُؤْخَذُ فِي الصَّدَقَةِ هَرِمَةٌ وَلاَ ذَاتُ عَوَارٍ وَلاَ تَيْسُ الْغَنَمِ إِلاَّ أَنْ يَشَاءَ الْمُصَّدِّقُ وَلاَ يُجْمَعُ بَيْنَ مُتَفَرِّقٍ وَلاَ يُفَرَّقُ بَيْنَ مُجْتَمِعٍ خَشْيَةَ الصَّدَقَةِ وَمَا كَانَ مِنْ خَلِيطَيْنِ فَإِنَّهُمَا يَتَرَاجَعَانِ بَيْنَهُمَا بِالسَّوِيَّةِ وَإِذَا كَانَتْ سَائِمَةُ الرَّجُلِ نَاقِصَةً مِنْ أَرْبَعِينَ شَاةٌ وَاحِدَةٌ فَلَيْسَ فِيهَا شَىْءٌ إِلاَّ أَنْ يَشَاءَ رَبُّهَا وَفِي الرِّقَةِ رُبُعُ الْعُشْرِ فَإِنْ لَمْ يَكُنِ الْمَالُ إِلاَّ تِسْعِينَ وَمِائَةً فَلَيْسَ فِيهِ شَىْءٌ إِلاَّ أَنْ يَشَاءَ رَبُّهَا ‏.‏",
    "malay_translation": "Daripada Anas bin Malik رضي الله عنه, bahawa Abu Bakar رضي الله عنه menulis kepadanya (berkenaan kewajipan zakat). Ini adalah kewajipan sedekah yang telah ditetapkan oleh Rasulullah ﷺ ke atas umat Islam, sebagaimana yang diperintahkan oleh Allah kepada Rasul-Nya ﷺ. Sesiapa yang diminta untuk zakat mengikut cara yang telah diterangkan (dalam surat Abu Bakar), hendaklah dia memberikannya, dan sesiapa yang diminta lebih daripada itu, janganlah dia memberikannya. \n\nApabila jumlah unta kurang daripada dua puluh lima, untuk setiap lima ekor unta, wajib diberikan seekor kambing. Jika jumlahnya mencapai dua puluh lima, maka wajib diberikan *Bint Makhad* (unta betina berumur satu tahun), sehingga tiga puluh lima ekor. Jika tidak ada *Bint Makhad*, maka wajib *Ibnu Labun* (unta jantan berumur satu tahun). Jika jumlahnya mencapai tiga puluh enam, maka wajib diberikan *Bint Labun* (unta betina berumur dua tahun), sehingga empat puluh lima ekor. Jika jumlahnya mencapai empat puluh enam, maka wajib diberikan *Hiqqah* (unta betina berumur tiga tahun yang telah bunting), sehingga enam puluh ekor. Jika jumlahnya mencapai enam puluh satu, maka wajib diberikan *Jadz'ah* (unta betina berumur empat tahun), sehingga tujuh puluh lima ekor. Jika jumlahnya mencapai tujuh puluh enam, maka wajib diberikan dua ekor *Bint Labun*, sehingga sembilan puluh ekor. Jika jumlahnya mencapai sembilan puluh satu, maka wajib diberikan dua ekor *Hiqqah* yang telah bunting, sehingga seratus dua puluh ekor. Jika terdapat lebih daripada seratus dua puluh ekor, maka untuk setiap empat puluh ekor unta, wajib diberikan seekor *Bint Labun*, dan untuk setiap lima puluh ekor unta, wajib diberikan seekor *Hiqqah*. \n\nJika seseorang tidak mempunyai unta yang sesuai dengan umur yang dinyatakan menurut peraturan zakat, maka jika seseorang wajib memberikan *Jadz'ah* tetapi dia mempunyai *Hiqqah*, maka *Hiqqah* tersebut hendaklah diterima daripadanya dan dia hendaklah memberikan dua ekor kambing bersamanya jika ada, atau dua puluh Dirham. Jika seseorang wajib memberikan *Hiqqah* sebagai zakat tetapi dia hanya mempunyai *Jadz'ah*, maka *Jadz'ah* tersebut hendaklah diterima daripadanya, dan pengumpul zakat hendaklah memberinya dua puluh Dirham atau dua ekor kambing. Jika seseorang wajib memberikan *Hiqqah* dan tidak memilikinya tetapi dia mempunyai *Bint Labun*, maka *Bint Labun* tersebut hendaklah diterima daripadanya, dan dia hendaklah memberikan dua ekor kambing bersamanya jika ada, atau dua puluh Dirham. Jika seseorang wajib memberikan *Bint Labun* sebagai zakat tetapi dia hanya mempunyai *Hiqqah*, maka *Hiqqah* tersebut hendaklah diterima daripadanya, dan pengumpul zakat hendaklah memberinya dua puluh Dirham atau dua ekor kambing. Jika seseorang wajib memberikan *Bint Labun* sebagai zakat dan dia tidak mempunyai *Bint Labun*, tetapi dia mempunyai *Bint Makhad*. Maka, *Bint Makhad* tersebut hendaklah diterima daripadanya, dan dia hendaklah memberikan dua ekor kambing bersamanya jika ada, atau dua puluh Dirham. Jika seseorang wajib memberikan *Bint Makhad* sebagai zakat tetapi dia hanya mempunyai *Bint Labun* jantan, maka ia hendaklah diterima daripadanya dan tidak ada yang lain (perlu diberikan). Jika seseorang hanya mempunyai empat ekor unta, maka tidak ada zakat yang wajib atas mereka, melainkan jika pemiliknya ingin (memberi sesuatu). \n\nBerkenaan zakat kambing yang meragut, jika ada empat puluh ekor, maka seekor kambing wajib diberikan, sehingga seratus dua puluh ekor. Jika ada satu ekor lebih daripada itu, maka dua ekor kambing wajib diberikan, sehingga dua ratus ekor. Jika ada satu ekor lebih daripada itu, maka tiga ekor kambing wajib diberikan, sehingga tiga ratus ekor. Jika ada satu ekor lebih daripada itu, maka untuk setiap seratus ekor, seekor kambing wajib diberikan, dan tidak boleh mengambil kambing yang tua, cacat atau kambing jantan sebagai zakat, melainkan jika pengumpul zakat ingin berbuat demikian. Jangan menggabungkan kawanan ternak yang berasingan atau menggabungkan kawanan ternak yang berasingan kerana takut akan zakat, Setiap rakan kongsi (yang mempunyai bahagian dalam kawanan ternak gabungan) hendaklah membayar zakat mengikut bahagiannya. Jika kawanan ternak seseorang kurang daripada empat puluh ekor kambing, maka tidak ada zakat yang wajib atas mereka melainkan jika pemiliknya ingin berbuat demikian. Berkenaan perak, satu perempat daripada satu persepuluh, dan jika hanya ada seratus sembilan puluh, tidak ada zakat yang wajib melainkan jika pemiliknya ingin berbuat demikian."
  },
  {
    "id": 17197,
    "hadith_number": 2461,
    "tajuk_hadith": "Kesan Tidak Membayar Zakat Haiwan Ternakan",
    "perawi_melayu": "Diriwayatkan daripada Abu Dharr",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا وَكِيعٌ، قَالَ حَدَّثَنَا الأَعْمَشُ، عَنِ الْمَعْرُورِ بْنِ سُوَيْدٍ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا مِنْ صَاحِبِ إِبِلٍ وَلاَ بَقَرٍ وَلاَ غَنَمٍ لاَ يُؤَدِّي زَكَاتَهَا إِلاَّ جَاءَتْ يَوْمَ الْقِيَامَةِ أَعْظَمَ مَا كَانَتْ وَأَسْمَنَهُ تَنْطَحُهُ بِقُرُونِهَا وَتَطَؤُهُ بِأَخْفَافِهَا كُلَّمَا نَفَذَتْ أُخْرَاهَا أَعَادَتْ عَلَيْهِ أُولاَهَا حَتَّى يُقْضَى بَيْنَ النَّاسِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Tidak ada pemilik unta, lembu atau kambing yang tidak mengeluarkan zakatnya melainkan pada hari Kiamat nanti haiwan-haiwan itu akan datang dengan keadaan yang paling besar dan gemuk yang pernah ada, lalu menanduknya dengan tanduk mereka dan memijaknya dengan kuku mereka. Setiap kali yang terakhir dari mereka telah melaluinya, yang pertama dari mereka akan kembali kepadanya, sehingga keputusan dibuat di antara manusia.\""
  },
  {
    "id": 17198,
    "hadith_number": 2462,
    "tajuk_hadith": "Larangan Mengambil Unta Susuan dan Ketidakadilan dalam Zakat",
    "perawi_melayu": "Suwaid bin Ghafalah berkata:",
    "english_text": "\"Not Available\"",
    "arabic_text": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، عَنْ هُشَيْمٍ، عَنْ هِلاَلِ بْنِ خَبَّابٍ، عَنْ مَيْسَرَةَ أَبِي صَالِحٍ، عَنْ سُوَيْدِ بْنِ غَفَلَةَ، قَالَ أَتَانَا مُصَدِّقُ النَّبِيِّ صلى الله عليه وسلم فَأَتَيْتُهُ فَجَلَسْتُ إِلَيْهِ فَسَمِعْتُهُ يَقُولُ ‏\"‏ إِنَّ فِي عَهْدِي أَنْ لاَ نَأْخُذَ رَاضِعَ لَبَنٍ وَلاَ نَجْمَعَ بَيْنَ مُتَفَرِّقٍ وَلاَ نُفَرِّقَ بَيْنَ مُجْتَمِعٍ ‏\"‏ ‏.‏ فَأَتَاهُ رَجُلٌ بِنَاقَةٍ كَوْمَاءَ فَقَالَ ‏\"‏ خُذْهَا ‏\"‏ ‏.‏ فَأَبَى",
    "malay_translation": "Telah datang kepada kami pengumpul Zakat dari Nabi ﷺ. Aku pun pergi kepadanya, duduk bersamanya, dan mendengar dia berkata: 'Dalam perjanjianku, ia mengatakan bahawa kami tidak boleh mengambil anak yang menyusu, tidak menggabungkan apa yang berpisah, dan tidak memisahkan apa yang telah digabungkan.' Seorang lelaki membawa unta dengan bonggol yang besar kepadanya dan berkata: 'Ambillah', tetapi dia enggan."
  },
  {
    "id": 17199,
    "hadith_number": 2463,
    "tajuk_hadith": "Doa Nabi terhadap Pemberi Zakat",
    "perawi_melayu": "Daripada Wa'il bin Hujr",
    "english_text": "the Prophet sent a collector and he came to a man who brought him a slim, recently-weaned camel. The Prophet said: \"We sent to Zakah collector of Allah and His Messenger, and so-and-so gave him a slim, recently-weaned camel. O Allah, do not bless him nor his camels!\" News of that reached the man, so he came with a beautiful she-camel and said: \"I repent to Allah and to His Prophet. \" The Prophet said: \"O Allah, bless him and his camels!\" (Daif)",
    "arabic_text": "أَخْبَرَنَا هَارُونُ بْنُ زَيْدِ بْنِ يَزِيدَ، - يَعْنِي ابْنَ أَبِي الزَّرْقَاءِ - قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَاصِمِ بْنِ كُلَيْبٍ، عَنْ أَبِيهِ، عَنْ وَائِلِ بْنِ حُجْرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَ سَاعِيًا فَأَتَى رَجُلاً فَأَتَاهُ فَصِيلاً مَخْلُولاً فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ بَعَثْنَا مُصَدِّقَ اللَّهِ وَرَسُولِهِ وَإِنَّ فُلاَنًا أَعْطَاهُ فَصِيلاً مَخْلُولاً اللَّهُمَّ لاَ تُبَارِكْ فِيهِ وَلاَ فِي إِبِلِهِ ‏\"‏ ‏.‏ فَبَلَغَ ذَلِكَ الرَّجُلَ فَجَاءَ بِنَاقَةٍ حَسْنَاءَ فَقَالَ أَتُوبُ إِلَى اللَّهِ عَزَّ وَجَلَّ وَإِلَى نَبِيِّهِ صلى الله عليه وسلم ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ بَارِكْ فِيهِ وَفِي إِبِلِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Nabi s.a.w. mengutus seorang pengumpul zakat. Apabila pengumpul itu datang kepada seorang lelaki, lelaki itu memberikan kepadanya seekor unta betina yang kurus dan baru sahaja bercerai susu. Nabi s.a.w. bersabda: \"Kami mengutus pengumpul zakat Allah dan Rasul-Nya, dan si fulan memberikan kepadanya seekor unta betina yang kurus dan baru sahaja bercerai susu. Ya Allah, janganlah Engkau memberkatinya dan untanya!\" Berita itu sampai kepada lelaki tersebut, lalu dia datang membawa seekor unta betina yang cantik dan berkata: \"Saya bertaubat kepada Allah 'Azza wa Jalla dan kepada Nabi-Nya.\" Nabi s.a.w. bersabda: \"Ya Allah, berkatilah dia dan untanya!\" (Daif)"
  },
  {
    "id": 17200,
    "hadith_number": 2464,
    "tajuk_hadith": "Doa Nabi SAW ke atas Penerima Zakat dan Sedekah",
    "perawi_melayu": "Abdullah bin Abi Awfa berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ، قَالَ حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ عَمْرُو بْنُ مُرَّةَ أَخْبَرَنِي قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَتَاهُ قَوْمٌ بِصَدَقَتِهِمْ قَالَ ‏\"‏ اللَّهُمَّ صَلِّ عَلَى آلِ فُلاَنٍ ‏\"‏ ‏.‏ فَأَتَاهُ أَبِي بِصَدَقَتِهِ فَقَالَ ‏\"‏ اللَّهُمَّ صَلِّ عَلَى آلِ أَبِي أَوْفَى ‏\"‏ ‏.‏",
    "malay_translation": "Apabila orang ramai membawa zakat mereka kepada Rasulullah SAW, baginda akan berdoa: 'Ya Allah, sampaikanlah selawat ke atas keluarga si fulan.' Bapaku membawa sedekahnya kepada baginda, lalu baginda bersabda: 'Ya Allah, sampaikanlah selawat ke atas keluarga Abu Awfa.'"
  },
  {
    "id": 17201,
    "hadith_number": 2465,
    "tajuk_hadith": "Keredhaan Pemungut Zakat",
    "perawi_melayu": "Diriwayatkan daripada 'Abdur-Rahman bin Hilal",
    "english_text": "\"Jarir said: 'Some Bedouin people came to the Prephet and said:  O Messenger of Allah, some of your Zakah collectors come to us and they are unfair. He said: Keep your Zakah collectors happy. They said: Even if they are unfair? He said: Keep your Zakah collectors happy. Then they said: Even if they are unfair. He said: Keep your Zakah collectors happy. Jarir said: No Zakah collector left me, since I heard this from the Messenger of Allah but he was pleased with me.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، - وَاللَّفْظُ لَهُ - قَالاَ حَدَّثَنَا يَحْيَى، عَنْ مُحَمَّدِ بْنِ أَبِي إِسْمَاعِيلَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هِلاَلٍ، قَالَ قَالَ جَرِيرٌ أَتَى النَّبِيَّ صلى الله عليه وسلم نَاسٌ مِنَ الأَعْرَابِ فَقَالُوا يَا رَسُولَ اللَّهِ يَأْتِينَا نَاسٌ مِنْ مُصَدِّقِيكَ يَظْلِمُونَ ‏.‏ قَالَ ‏\"‏ أَرْضُوا مُصَدِّقِيكُمْ ‏\"‏ ‏.‏ قَالُوا وَإِنْ ظَلَمَ قَالَ ‏\"‏ أَرْضُوا مُصَدِّقِيكُمْ ‏\"‏ ‏.‏ ثُمَّ قَالُوا وَإِنْ ظَلَمَ قَالَ ‏\"‏ أَرْضُوا مُصَدِّقِيكُمْ ‏\"‏ ‏.‏ قَالَ جَرِيرٌ فَمَا صَدَرَ عَنِّي مُصَدِّقٌ مُنْذُ سَمِعْتُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلاَّ وَهُوَ رَاضٍ ‏.‏",
    "malay_translation": "Jarir berkata: 'Beberapa orang Badwi datang kepada Nabi ﷺ dan berkata: 'Wahai Rasulullah, sesungguhnya sebahagian daripada pemungut zakatmu datang kepada kami dan mereka tidak adil.' Baginda bersabda: 'Redhakanlah pemungut zakat kamu.' Mereka berkata: 'Walaupun mereka tidak adil?' Baginda bersabda: 'Redhakanlah pemungut zakat kamu.' Kemudian mereka berkata lagi: 'Walaupun mereka tidak adil?' Baginda bersabda: 'Redhakanlah pemungut zakat kamu.' Jarir berkata: 'Tiada seorang pun pemungut zakat yang meninggalkanku sejak aku mendengar hadis ini daripada Rasulullah ﷺ melainkan dia berpuas hati denganku.'"
  },
  {
    "id": 17202,
    "hadith_number": 2466,
    "tajuk_hadith": "Keredhaan Pengumpul Zakat",
    "perawi_melayu": "Ash-Shabbi meriwayatkan:",
    "english_text": "\"Jarir said: 'The Messenger of Allah said: When the Zakah collector comes to you, let him leave happy with you.\"'",
    "arabic_text": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، - هُوَ ابْنُ عُلَيَّةَ - قَالَ أَنْبَأَنَا دَاوُدُ، عَنِ الشَّعْبِيِّ، قَالَ قَالَ جَرِيرٌ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا أَتَاكُمُ الْمُصَدِّقُ فَلْيَصْدُرْ وَهُوَ عَنْكُمْ رَاضٍ ‏\"‏ ‏.‏",
    "malay_translation": "Jarir berkata: 'Rasulullah ﷺ bersabda: Apabila pengumpul zakat datang kepada kamu, biarkanlah dia pergi dalam keadaan redha dengan kamu.'"
  },
  {
    "id": 17203,
    "hadith_number": 2467,
    "tajuk_hadith": "Kisah Pengumpulan Zakat dari Seorang Tua",
    "perawi_melayu": "Muslim bin Thafihan",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا وَكِيعٌ، قَالَ حَدَّثَنَا زَكَرِيَّا بْنُ إِسْحَاقَ، عَنْ عَمْرِو بْنِ أَبِي سُفْيَانَ، عَنْ مُسْلِمِ بْنِ ثَفِنَةَ، قَالَ اسْتَعْمَلَ ابْنُ عَلْقَمَةَ أَبِي عَلَى عِرَافَةِ قَوْمِهِ وَأَمَرَهُ أَنْ يُصَدِّقَهُمْ، فَبَعَثَنِي أَبِي إِلَى طَائِفَةٍ مِنْهُمْ لآتِيَهُ بِصَدَقَتِهِمْ فَخَرَجْتُ حَتَّى أَتَيْتُ عَلَى شَيْخٍ كَبِيرٍ يُقَالُ لَهُ سَعْرٌ فَقُلْتُ إِنَّ أَبِي بَعَثَنِي إِلَيْكَ لِتُؤَدِّيَ صَدَقَةَ غَنَمِكَ ‏.‏ قَالَ ابْنَ أَخِي وَأَىُّ نَحْوٍ تَأْخُذُونَ قُلْتُ نَخْتَارُ حَتَّى إِنَّا لَنَشْبُرُ ضُرُوعَ الْغَنَمِ ‏.‏ قَالَ ابْنَ أَخِي فَإِنِّي أُحَدِّثُكَ أَنِّي كُنْتُ فِي شِعْبٍ مِنْ هَذِهِ الشِّعَابِ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَنَمٍ لِي فَجَاءَنِي رَجُلاَنِ عَلَى بَعِيرٍ فَقَالاَ إِنَّا رَسُولاَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَيْكَ لِتُؤَدِّيَ صَدَقَةَ غَنَمِكَ ‏.‏ قَالَ قُلْتُ وَمَا عَلَىَّ فِيهَا قَالاَ شَاةٌ ‏.‏ فَأَعْمِدُ إِلَى شَاةٍ قَدْ عَرَفْتُ مَكَانَهَا مُمْتَلِئَةً مَحْضًا وَشَحْمًا فَأَخْرَجْتُهَا إِلَيْهِمَا فَقَالَ هَذِهِ الشَّافِعُ ‏.‏ وَالشَّافِعُ الْحَائِلُ وَقَدْ نَهَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ نَأْخُذَ شَافِعًا قَالَ فَأَعْمِدُ إِلَى عَنَاقٍ مُعْتَاطٍ - وَالْمُعْتَاطُ الَّتِي لَمْ تَلِدْ وَلَدًا وَقَدْ حَانَ وِلاَدُهَا - فَأَخْرَجْتُهَا إِلَيْهِمَا فَقَالاَ نَاوِلْنَاهَا فَرَفَعْتُهَا إِلَيْهِمَا فَجَعَلاَهَا مَعَهُمَا عَلَى بَعِيرِهِمَا ثُمَّ انْطَلَقَا ‏.‏",
    "malay_translation": "Diriwayatkan bahawa Muslim bin Thafihan berkata: Ibn 'Alqamah melantik ayahku untuk menguruskan kaumnya, dan dia memerintahkannya untuk mengumpul zakat mereka. Ayahku mengutusku kepada sekumpulan daripada mereka untuk membawakan zakat mereka kepadanya. Aku berangkat dan sampai kepada seorang lelaki tua yang dipanggil Sa'r. Aku berkata: Ayahku mengutusku kepadamu untuk mengutip zakat kambingmu. Dia berkata: Wahai anak saudaraku, cara apa yang kamu ambil untuk mengutip zakat? Aku berkata: Kami memilih, malah kami mengukur ambing kambing. Dia berkata: Wahai anak saudaraku, sesungguhnya aku menceritakan kepadamu bahawa aku berada di salah satu laluan gunung ini pada zaman Rasulullah SAW dengan beberapa ekor kambingku. Dua orang lelaki datang menaiki unta dan berkata: Kami adalah utusan Rasulullah SAW, kami datang untuk mengambil zakat kambingmu. Aku berkata: Apa yang perlu aku berikan? Mereka berkata: Seekor kambing. Lalu aku pergi kepada seekor kambing yang aku tahu penuh dengan susu dan gemuk, dan membawanya kepada mereka. Dia berkata: Ini adalah *Shafi'* – seekor kambing yang mempunyai anak atau sedang hamil – dan Rasulullah SAW melarang kami mengambil *Shafi'*. Kemudian aku pergi kepada seekor kambing betina *Mu'tat* – *Mutat* ialah kambing yang belum pernah melahirkan anak, tetapi telah mencapai usia di mana ia boleh melahirkan anak – dan membawanya kepada mereka. Mereka berkata: Kami akan mengambilnya. Lalu aku mengangkatnya kepada mereka, dan mereka mengambilnya bersama mereka di atas unta mereka dan pergi."
  },
  {
    "id": 17204,
    "hadith_number": 2468,
    "tajuk_hadith": "Ibn 'Alqamah Melantik Ayahnya untuk Mengumpul Zakat",
    "perawi_melayu": "Muslim bin Thafinah meriwayatkan bahawa:",
    "english_text": "Ibn 'Alqamah appointed his father to collect the Zakah of his people - and he quoted the same Hadith.",
    "arabic_text": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا رَوْحٌ، قَالَ حَدَّثَنَا زَكَرِيَّا بْنُ إِسْحَاقَ، قَالَ حَدَّثَنِي عَمْرُو بْنُ أَبِي سُفْيَانَ، قَالَ حَدَّثَنِي مُسْلِمُ بْنُ ثَفِنَةَ، أَنَّ ابْنَ عَلْقَمَةَ، اسْتَعْمَلَ أَبَاهُ عَلَى صَدَقَةِ قَوْمِهِ وَسَاقَ الْحَدِيثَ ‏.‏",
    "malay_translation": "Ibn 'Alqamah melantik ayahnya untuk mengumpul zakat kaumnya - dan beliau memetik Hadith yang sama."
  },
  {
    "id": 17205,
    "hadith_number": 2469,
    "tajuk_hadith": "Perintah Rasulullah SAW tentang Sedekah dan Teguran kepada Mereka yang Menahan",
    "perawi_melayu": "Abu Hurairah berkata:",
    "english_text": "\"Umar said: 'The Messenger of Allah enjoined Sadaqah and it was said that Ibn Jamil, Khalid bin Al-Walid and 'Abbas bin 'Abdul-Muttalib had withheld some. The Messenger of Allah said: What is the matter with Ibn Jamil? Was he not poor then Allah made him rich? As for Khalid bin Al-Walid, you are being unfair to Khalid, for he is saving his shields and weapons for the sake of Allah. As for Al-Abbas bin 'Abdul-Muttalib, the paternal uncle of the Messenger of Allah, it is and obligatory charity for him and he has to pay as much again.\"'",
    "arabic_text": "أَخْبَرَنِي عِمْرَانُ بْنُ بَكَّارٍ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ، قَالَ حَدَّثَنَا شُعَيْبٌ، قَالَ حَدَّثَنِي أَبُو الزِّنَادِ، مِمَّا حَدَّثَهُ عَبْدُ الرَّحْمَنِ الأَعْرَجُ، مِمَّا ذَكَرَ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يُحَدِّثُ قَالَ وَقَالَ عُمَرُ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِصَدَقَةٍ فَقِيلَ مَنَعَ ابْنُ جَمِيلٍ وَخَالِدُ بْنُ الْوَلِيدِ وَعَبَّاسُ بْنُ عَبْدِ الْمُطَّلِبِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا يَنْقِمُ ابْنُ جَمِيلٍ إِلاَّ أَنَّهُ كَانَ فَقِيرًا فَأَغْنَاهُ اللَّهُ وَأَمَّا خَالِدُ بْنُ الْوَلِيدِ فَإِنَّكُمْ تَظْلِمُونَ خَالِدًا قَدِ احْتَبَسَ أَدْرَاعَهُ وَأَعْتُدَهُ فِي سَبِيلِ اللَّهِ وَأَمَّا الْعَبَّاسُ بْنُ عَبْدِ الْمُطَّلِبِ عَمُّ رَسُولِ اللَّهِ صلى الله عليه وسلم فَهِيَ عَلَيْهِ صَدَقَةٌ وَمِثْلُهَا مَعَهَا ‏\"‏ ‏.‏",
    "malay_translation": "Umar berkata: 'Rasulullah SAW memerintahkan sedekah, dan dikatakan bahawa Ibn Jamil, Khalid bin Al-Walid, dan Abbas bin 'Abdul-Muttalib telah menahan sebahagian. Rasulullah SAW bersabda: 'Apakah yang terjadi dengan Ibn Jamil? Bukankah dia dahulunya miskin lalu Allah menjadikannya kaya? Adapun Khalid bin Al-Walid, kamu menganiaya Khalid, kerana dia menyimpan perisai dan senjatanya untuk (dijalan) Allah. Adapun Al-Abbas bin 'Abdul-Muttalib, bapa saudara Rasulullah SAW, maka ia adalah sedekah wajib baginya dan dia harus membayar jumlah yang sama lagi.'"
  },
  {
    "id": 17206,
    "hadith_number": 2470,
    "tajuk_hadith": "Perintah Rasulullah SAW untuk Bersedekah",
    "perawi_melayu": "Abu Hurairah (RA)",
    "english_text": "\"The Messenger of Allah enjoined giving Sadaqah;\"and he narrated something similar.",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصٍ، قَالَ حَدَّثَنِي أَبِي قَالَ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ، عَنْ مُوسَى، قَالَ حَدَّثَنِي أَبُو الزِّنَادِ، عَنْ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِصَدَقَةٍ مِثْلَهُ سَوَاءً ‏.‏",
    "malay_translation": "Rasulullah SAW memerintahkan untuk memberi sedekah; dan beliau meriwayatkan sesuatu yang serupa."
  },
  {
    "id": 17207,
    "hadith_number": 2471,
    "tajuk_hadith": "Takut Dibunuh Kerana Kambing atau Biri-Biri Sedekah",
    "perawi_melayu": "Abdullah bin Hilal Ath-Thaqafi",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، وَمَحْمُودُ بْنُ غَيْلاَنَ، قَالاَ حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ، عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ الأَسْوَدِ، عَنْ عَبْدِ اللَّهِ بْنِ هِلاَلٍ الثَّقَفِيِّ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ كِدْتُ أُقْتَلُ بَعْدَكَ فِي عَنَاقٍ أَوْ شَاةٍ مِنَ الصَّدَقَةِ ‏.‏ فَقَالَ ‏\n\"‏ لَوْلاَ أَنَّهَا تُعْطَى فُقَرَاءَ الْمُهَاجِرِينَ مَا أَخَذْتُهَا ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki datang kepada Nabi ﷺ dan berkata: 'Aku khuatir akan terbunuh selepasmu kerana seekor kambing atau biri-biri daripada sedekah.' Baginda bersabda: 'Kalaulah tidak kerana ia akan diberikan kepada golongan Muhajirin yang miskin, nescaya aku tidak akan mengambilnya.'"
  },
  {
    "id": 17208,
    "hadith_number": 2472,
    "tajuk_hadith": "Zakat Tidak Wajib Ke Atas Hamba dan Kuda",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، وَسُفْيَانَ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ عِرَاكِ بْنِ مَالِكٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَيْسَ عَلَى الْمُسْلِمِ فِي عَبْدِهِ وَلاَ فَرَسِهِ صَدَقَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: 'Seorang Muslim tidak perlu membayar zakat ke atas hambanya atau kudanya.'"
  },
  {
    "id": 17209,
    "hadith_number": 2473,
    "tajuk_hadith": "Zakat Tidak Dikenakan Ke Atas Hamba dan Kuda",
    "perawi_melayu": "Abu Hurairah berkata:",
    "english_text": "\"The Messenger of Allah said: 'A Muslim man does not have to pay Zakah on his slave or his horse.\"'",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ حَرْبٍ الْمَرْوَزِيُّ، قَالَ حَدَّثَنَا مُحْرِزُ بْنُ الْوَضَّاحِ، عَنْ إِسْمَاعِيلَ، - وَهُوَ ابْنُ أُمَيَّةَ - عَنْ مَكْحُولٍ، عَنْ عِرَاكِ بْنِ مَالِكٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ زَكَاةَ عَلَى الرَّجُلِ الْمُسْلِمِ فِي عَبْدِهِ وَلاَ فَرَسِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: 'Seorang lelaki Muslim tidak perlu membayar zakat ke atas hambanya atau kudanya.'"
  },
  {
    "id": 17210,
    "hadith_number": 2474,
    "tajuk_hadith": "Seorang Muslim Tidak Perlu Membayar Zakat untuk Hamba atau Kudanya",
    "perawi_melayu": "Daripada Abu Hurairah, meriwayatkan daripada Nabi ﷺ:",
    "english_text": "\"The Muslim does not have to pay Sadaqah on his slave or his horse.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا أَيُّوبُ بْنُ مُوسَى، عَنْ مَكْحُولٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ عِرَاكِ بْنِ مَالِكٍ، عَنْ أَبِي هُرَيْرَةَ، يَرْفَعُهُ إِلَى النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَيْسَ عَلَى الْمُسْلِمِ فِي عَبْدِهِ وَلاَ فِي فَرَسِهِ صَدَقَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang Muslim tidak perlu membayar sedekah (zakat) ke atas hambanya atau kudanya."
  },
  {
    "id": 17211,
    "hadith_number": 2475,
    "tajuk_hadith": "Tiada Zakat ke Atas Kuda dan Hamba",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah bahawa Nabi ﷺ bersabda:",
    "english_text": "\"A person does not have to pay Sadaqah on his horse or his slave.\"",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ خُثَيْمٍ، قَالَ حَدَّثَنَا أَبِي، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَيْسَ عَلَى الْمَرْءِ فِي فَرَسِهِ وَلاَ فِي مَمْلُوكِهِ صَدَقَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Seseorang tidak perlu membayar sedekah ke atas kudanya atau hambanya."
  },
  {
    "id": 17212,
    "hadith_number": 2476,
    "tajuk_hadith": "Zakat Tidak Diwajibkan ke Atas Hamba dan Kuda",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah bahawa Nabi ﷺ bersabda:",
    "english_text": "\"The Muslim does not have to pay Sadaqah on his slave or his horse.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، - وَاللَّفْظُ لَهُ - عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ عِرَاكِ بْنِ مَالِكٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَيْسَ عَلَى الْمُسْلِمِ فِي عَبْدِهِ وَلاَ فِي فَرَسِهِ صَدَقَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang Muslim tidak wajib membayar *Sadaqah* ke atas hambanya atau kudanya."
  },
  {
    "id": 17213,
    "hadith_number": 2477,
    "tajuk_hadith": "Zakat Tidak Wajib ke Atas Hamba dan Kuda",
    "perawi_melayu": "Daripada Abu Hurairah bahawa Nabi ﷺ bersabda:",
    "english_text": "\"The Muslim does not have to pay Sadaqah on his slave or his horse.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ خُثَيْمِ بْنِ عِرَاكِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَيْسَ عَلَى الْمُسْلِمِ صَدَقَةٌ فِي غُلاَمِهِ وَلاَ فِي فَرَسِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang Muslim tidak perlu membayar sedekah ke atas hambanya atau kudanya."
  },
  {
    "id": 17214,
    "hadith_number": 2478,
    "tajuk_hadith": "Kewajipan Zakat: Nisab Awaq, Dhawd, dan Ausuq",
    "perawi_melayu": "Diriwayatkan dari Abu Sa'eed Al-Khudri r.a.",
    "english_text": "\"The Messenger of Allah said: 'No Sadaqah is due on anything less than five Awaq, no Sadaqah is due on less than five Dhawh (head of camel), and no Sadaqah is due on less than five Awsuq.'\n 2476. It was narrated from Abu Sa 'eed Al-Khudri that the Messenger of Allah said: \"No Sadaqah is due on lessthan five Awsuq of dates, no Sadaqah is due on less than five Awaq of silver, and no Sadaqah is due on less than five Dhawd (head) of camels.",
    "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ، عَنْ حَمَّادٍ، قَالَ حَدَّثَنَا يَحْيَى، - وَهُوَ ابْنُ سَعِيدٍ - عَنْ عَمْرِو بْنِ يَحْيَى، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوَاقٍ صَدَقَةٌ وَلاَ فِيمَا دُونَ خَمْسِ ذَوْدٍ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوْسُقٍ صَدَقَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: 'Tiada sedekah (zakat) wajib ke atas sesuatu yang kurang daripada lima Awaq (nilai matawang), tiada sedekah (zakat) wajib ke atas sesuatu yang kurang daripada lima Dhawd (kepala unta), dan tiada sedekah (zakat) wajib ke atas sesuatu yang kurang daripada lima Awsuq.' Diriwayatkan dari Abu Sa'eed Al-Khudri r.a., bahawa Rasulullah ﷺ bersabda: 'Tiada sedekah (zakat) wajib ke atas sesuatu yang kurang daripada lima Awsuq kurma, tiada sedekah (zakat) wajib ke atas sesuatu yang kurang daripada lima Awaq perak, dan tiada sedekah (zakat) wajib ke atas sesuatu yang kurang daripada lima Dhawd (kepala) unta."
  },
  {
    "id": 17215,
    "hadith_number": 2479,
    "tajuk_hadith": "Zakat pada Kurma, Perak, dan Unta",
    "perawi_melayu": "Daripada Abu Sa'eed Al-Khudri bahawa Rasulullah ﷺ bersabda:",
    "english_text": "\"No Sadaqah is due on lessthan five Awsuq of dates, no Sadaqah is due on less than five Awaq of silver, and no Sadaqah is due on less than five Dhawd (head) of camels.",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ أَنْبَأَنَا ابْنُ الْقَاسِمِ، عَنْ مَالِكٍ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ الْمَازِنِيُّ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَيْسَ فِيمَا دُونَ خَمْسِ أَوْسُقٍ مِنَ التَّمْرِ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ مِنَ الْوَرِقِ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسِ ذَوْدٍ مِنَ الإِبِلِ صَدَقَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Tiada sedekah (zakat) dikenakan ke atas kurma yang kurang daripada lima *awsuq*, tiada sedekah (zakat) dikenakan ke atas perak yang kurang daripada lima *awaq*, dan tiada sedekah (zakat) dikenakan ke atas unta yang kurang daripada lima *dhawd* (kepala)."
  },
  {
    "id": 17216,
    "hadith_number": 2480,
    "tajuk_hadith": "Kewajipan Zakat atas Nisab Tertentu",
    "perawi_melayu": "Daripada Abu Sa'eed Al-Khudri bahawa dia mendengar Rasulullah ﷺ bersabda:",
    "english_text": "\"No Sadaqah is due on less than five Awsaq of dates, no Sadaqah is due on less than five Awaq of silver, and no Sadagah is due on less than five Dhawd (head) of camels.\"",
    "arabic_text": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الْوَلِيدِ بْنِ كَثِيرٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ، عَنْ يَحْيَى بْنِ عُمَارَةَ، وَعَبَّادِ بْنِ تَمِيمٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ صَدَقَةَ فِيمَا دُونَ خَمْسِ أَوْسَاقٍ مِنَ التَّمْرِ وَلاَ فِيمَا دُونَ خَمْسِ أَوَاقٍ مِنَ الْوَرِقِ صَدَقَةٌ وَلاَ فِيمَا دُونَ خَمْسِ ذَوْدٍ مِنَ الإِبِلِ صَدَقَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Tiada sedekah (zakat) wajib ke atas kurma kurang daripada lima *Awsaq*, tiada sedekah (zakat) wajib ke atas perak kurang daripada lima *Awaq*, dan tiada sedekah (zakat) wajib ke atas unta kurang daripada lima *Dhawd*."
  },
  {
    "id": 17217,
    "hadith_number": 2481,
    "tajuk_hadith": "Zakat: Nisab Emas, Unta, dan Kurma",
    "perawi_melayu": "Daripada Abu Sa'eed Al-Khudri",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ الطُّوسِيُّ، قَالَ حَدَّثَنَا يَعْقُوبُ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا ابْنُ إِسْحَاقَ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ يَحْيَى بْنِ حَبَّانَ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ، - وَكَانَا ثِقَةً - عَنْ يَحْيَى بْنِ عُمَارَةَ بْنِ أَبِي حَسَنٍ، وَعَبَّادِ بْنِ تَمِيمٍ، - وَكَانَا ثِقَةً - عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ مِنَ الْوَرِقِ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسٍ مِنَ الإِبِلِ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Saya mendengar Rasulullah ﷺ bersabda: \"Tidak ada sedekah (zakat) ke atas kurang daripada lima *Awsaq* perak, tidak ada sedekah ke atas kurang daripada lima *Dhawd* (kepala) unta, dan tidak ada sedekah ke atas kurang daripada lima *Awsuq* kurma.\""
  },
  {
    "id": 17218,
    "hadith_number": 2482,
    "tajuk_hadith": "Kewajipan Zakat Harta",
    "perawi_melayu": "Ali رضي الله عنه",
    "english_text": "\"The Messenger of Allah said: 'I have exempted you from (having to pay Zakah on) horses and slaves. Pay the Zakah on your wealth, for every two hundred (Dirhams), five.\"'",
    "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَاصِمِ بْنِ ضَمْرَةَ، عَنْ عَلِيٍّ، رضى الله عنه قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ قَدْ عَفَوْتُ عَنِ الْخَيْلِ وَالرَّقِيقِ فَأَدُّوا زَكَاةَ أَمْوَالِكُمْ مِنْ كُلِّ مِائَتَيْنِ خَمْسَةً ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: 'Sesungguhnya aku telah membebaskan kamu daripada (membayar zakat) kuda dan hamba. Maka tunaikanlah zakat harta kamu, bagi setiap dua ratus (Dirham), lima.'"
  },
  {
    "id": 17219,
    "hadith_number": 2483,
    "tajuk_hadith": "Kewajipan Zakat dan Pengecualian",
    "perawi_melayu": "Diriwayatkan bahawa 'Ali رضي الله عنه berkata:",
    "english_text": "\"The Messenger of Allah said: 'I have exempted you from (having to pay Zakah on) houses and slaves, and there is no Zakah on less than two hundred (Dirhams).\"",
    "arabic_text": "أَخْبَرَنَا حُسَيْنُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا ابْنُ نُمَيْرٍ، قَالَ حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَاصِمِ بْنِ ضَمْرَةَ، عَنْ عَلِيٍّ، رضى الله عنه قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ قَدْ عَفَوْتُ عَنِ الْخَيْلِ وَالرَّقِيقِ وَلَيْسَ فِيمَا دُونَ مِائَتَيْنِ زَكَاةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: 'Sesungguhnya aku telah membebaskan kamu daripada (membayar zakat) rumah dan hamba, dan tidak ada zakat pada kurang daripada dua ratus (Dirham).'"
  },
  {
    "id": 17220,
    "hadith_number": 2484,
    "tajuk_hadith": "Wanita dari Yaman Memberi Sedekah Gelang Emas",
    "perawi_melayu": "Diriwayatkan dari 'Amr bin Shu 'aib, dari ayahnya, dari datuknya:",
    "english_text": "a woman from among the people of Yemen came to the Messenger of Allah with a daughter of hers, and on the daughter's hand were two thick bangles of gold. He said: \"Do you pay Zakah on these? She said: \"No.\" He said: \"Would it please you if Allah were to put two bangles of fire on you on the Day of Resurrection? \" So she took them of and gave them to the Messenger of Allah and said: \"They are for Allah and His Messenger.\"",
    "arabic_text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ حُسَيْنٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ امْرَأَةً، مِنْ أَهْلِ الْيَمَنِ أَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم وَبِنْتٌ لَهَا فِي يَدِ ابْنَتِهَا مَسَكَتَانِ غَلِيِظَتَانِ مِنْ ذَهَبٍ فَقَالَ ‏\"‏ أَتُؤَدِّينَ زَكَاةَ هَذَا ‏\"‏ ‏.‏ قَالَتْ لاَ ‏.‏ قَالَ ‏\"‏ أَيَسُرُّكِ أَنْ يُسَوِّرَكِ اللَّهُ عَزَّ وَجَلَّ بِهِمَا يَوْمَ الْقِيَامَةِ سِوَارَيْنِ مِنْ نَارٍ ‏\"‏ ‏.‏ قَالَ فَخَلَعَتْهُمَا فَأَلْقَتْهُمَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ هُمَا لِلَّهِ وَلِرَسُولِهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Seorang wanita dari kalangan penduduk Yaman datang kepada Rasulullah ﷺ bersama anak perempuannya. Di tangan anak perempuannya terdapat dua gelang tebal dari emas. Baginda ﷺ bersabda: \"Adakah kamu membayar zakat ke atasnya?\" Dia menjawab: \"Tidak.\" Baginda ﷺ bersabda: \"Adakah kamu suka jika Allah ﷻ memakaikan kamu dua gelang api pada hari Kiamat?\" Lalu dia menanggalkannya dan memberikannya kepada Rasulullah ﷺ sambil berkata: \"Ini untuk Allah dan Rasul-Nya.\""
  },
  {
    "id": 17221,
    "hadith_number": 2485,
    "tajuk_hadith": "Wanita Datang kepada Rasulullah dengan Anak Perempuannya dan Gelang",
    "perawi_melayu": "'Amr bin Shu 'aib berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ سَمِعْتُ حُسَيْنًا، قَالَ حَدَّثَنِي عَمْرُو بْنُ شُعَيْبٍ، قَالَ جَاءَتِ امْرَأَةٌ وَمَعَهَا بِنْتٌ لَهَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَفِي يَدِ ابْنَتِهَا مَسَكَتَانِ نَحْوَهُ مُرْسَلٌ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ خَالِدٌ أَثْبَتُ مِنَ الْمُعْتَمِرِ ‏.‏",
    "malay_translation": "Seorang wanita datang bersama anak perempuannya kepada Rasulullah ﷺ, dan pada lengan anak perempuannya terdapat dua gelang - sebuah riwayat yang serupa, dalam bentuk Mursal."
  },
  {
    "id": 17222,
    "hadith_number": 2486,
    "tajuk_hadith": "Hukuman Bagi Mereka yang Tidak Membayar Zakat",
    "perawi_melayu": "Daripada Ibnu 'Umar",
    "english_text": "\"The Messenger of Allah said: The one who does not pay Zakah on his wealth, his wealth will appear to him on the Day of Resurrection like a bald-headed Shuja 'a  with two dots above its eyes. It will hold onto him or encircle him and will say: I am your hoarded treasure, I am your hoarded treasure.\"",
    "arabic_text": "أَخْبَرَنَا الْفَضْلُ بْنُ سَهْلٍ، قَالَ حَدَّثَنَا أَبُو النَّضْرِ، هَاشِمُ بْنُ الْقَاسِمِ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ الَّذِي لاَ يُؤَدِّي زَكَاةَ مَالِهِ يُخَيَّلُ إِلَيْهِ مَالُهُ يَوْمَ الْقِيَامَةِ شُجَاعًا أَقْرَعَ لَهُ زَبِيبَتَانِ - قَالَ - فَيَلْتَزِمُهُ أَوْ يُطَوِّقُهُ - قَالَ - يَقُولُ أَنَا كَنْزُكَ أَنَا كَنْزُكَ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Sesiapa yang tidak membayar Zakat hartanya, hartanya akan menjelma kepadanya pada Hari Kiamat seperti ular Shuja' yang botak kepalanya dengan dua bintik di atas matanya. Ia akan memeluk atau melilitinya dan berkata: 'Aku adalah harta simpananmu, aku adalah harta simpananmu.'\""
  },
  {
    "id": 17223,
    "hadith_number": 2487,
    "tajuk_hadith": "Hukuman Bagi Mereka yang Tidak Membayar Zakat",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah bahawa Nabi ﷺ bersabda:",
    "english_text": "\"If Allah gives a person wealth and he does not pay Zakah on it, his wealth will appear to him on the Day of Resurrection as a bald-headed Shuja'a with two dots above its eyes. It will take hold of the corners of his mouth on the Day of Resurrection and will say: 'I am your wealth, I am your hoarded treasure.' The he recited this verse: 'And let not those who covetously withhold of that which Allah has bestowed on them of His Bounty (wealth) and think that it is good for them (and so they do not pay the obligatory Zakah).\"'",
    "arabic_text": "أَخْبَرَنَا الْفَضْلُ بْنُ سَهْلٍ، قَالَ حَدَّثَنَا حَسَنُ بْنُ مُوسَى الأَشْيَبُ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ دِينَارٍ الْمَدَنِيُّ، عَنْ أَبِيهِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ آتَاهُ اللَّهُ عَزَّ وَجَلَّ مَالاً فَلَمْ يُؤَدِّ زَكَاتَهُ مُثِّلَ لَهُ مَالُهُ يَوْمَ الْقِيَامَةِ شُجَاعًا أَقْرَعَ لَهُ زَبِيبَتَانِ يَأْخُذُ بِلِهْزِمَتَيْهِ يَوْمَ الْقِيَامَةِ فَيَقُولُ أَنَا مَالُكَ أَنَا كَنْزُكَ ‏\"‏ ‏.‏ ثُمَّ تَلاَ هَذِهِ الآيَةَ ‏{‏ وَلاَ يَحْسَبَنَّ الَّذِينَ يَبْخَلُونَ بِمَا آتَاهُمُ اللَّهُ مِنْ فَضْلِهِ ‏}‏ الآيَةَ ‏.‏",
    "malay_translation": "Jika Allah mengurniakan kekayaan kepada seseorang dan dia tidak membayar Zakat ke atasnya, maka pada hari Kiamat, hartanya akan menjelma sebagai seekor 'Shuja'a' (ular jantan yang besar) yang botak kepalanya dengan dua titik di atas matanya. Ia akan memegang kedua-dua belah pipinya pada hari Kiamat dan berkata: 'Aku adalah hartamu, aku adalah khazanahmu yang engkau simpan.' Kemudian baginda membaca ayat ini: 'Dan jangan sekali-kali orang-orang yang bakhil dengan apa yang telah dikurniakan Allah kepada mereka dari limpah kurniaNya (kekayaan) menyangka bahawa kebakhilan itu baik bagi mereka (kerana mereka tidak membayar Zakat yang wajib).'"
  },
  {
    "id": 17224,
    "hadith_number": 2488,
    "tajuk_hadith": "Tiada Zakat bagi Hasil Kurang dari Lima Awsaq",
    "perawi_melayu": "Abu Sa'eed Al-Khudri",
    "english_text": "\"The Messenger of Allah said: There is no Sadaqah on less than five Awsaq of grains or dates.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنْ يَحْيَى بْنِ عُمَارَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسَاقٍ مِنْ حَبٍّ أَوْ تَمْرٍ صَدَقَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Tiada sedekah (zakat) pada hasil tanaman atau kurma yang kurang daripada lima awsaq.\""
  },
  {
    "id": 17225,
    "hadith_number": 2489,
    "tajuk_hadith": "Kewajipan Zakat: Gandum, Kurma, Perak dan Unta",
    "perawi_melayu": "Daripada Abu Sa'eed Al-Khudri bahawa Rasulullah ﷺ bersabda:",
    "english_text": "\"No Zakah is due on wheat or dates unless the amount reaches five Awsuq. No Zakah is due on silver unless the amount reaches five Awaq. No Zakah is due on camels until the number reaches five Dhawd.\"",
    "arabic_text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، قَالَ حَدَّثَنَا رَوْحُ بْنُ الْقَاسِمِ، قَالَ حَدَّثَنِي عَمْرُو بْنُ يَحْيَى بْنِ عُمَارَةَ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَحِلُّ فِي الْبُرِّ وَالتَّمْرِ زَكَاةٌ حَتَّى تَبْلُغَ خَمْسَةَ أَوْسُقٍ وَلاَ يَحِلُّ فِي الْوَرِقِ زَكَاةٌ حَتَّى تَبْلُغَ خَمْسَةَ أَوَاقٍ وَلاَ يَحِلُّ فِي إِبِلٍ زَكَاةٌ حَتَّى تَبْلُغَ خَمْسَ ذَوْدٍ ‏\"‏ ‏.‏",
    "malay_translation": "Tiada zakat wajib dikeluarkan ke atas gandum atau kurma sehingga jumlahnya mencapai lima *Awsuq*. Tiada zakat wajib dikeluarkan ke atas perak sehingga jumlahnya mencapai lima *Awaq*. Tiada zakat wajib dikeluarkan ke atas unta sehingga bilangannya mencapai lima *Dhawd*."
  },
  {
    "id": 17226,
    "hadith_number": 2490,
    "tajuk_hadith": "Kewajipan Zakat pada Bijirin dan Kurma",
    "perawi_melayu": "Daripada Abu Sa'eed Al-Khudri bahawa Nabi ﷺ bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنْ يَحْيَى بْنِ عُمَارَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَيْسَ فِي حَبٍّ وَلاَ تَمْرٍ صَدَقَةٌ حَتَّى يَبْلُغَ خَمْسَةَ أَوْسُقٍ وَلاَ فِيمَا دُونَ خَمْسِ ذَوْدٍ وَلاَ فِيمَا دُونَ خَمْسِ أَوَاقٍ صَدَقَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Tidak ada sadaqah (zakat) pada bijirin atau kurma sehingga jumlahnya mencapai lima Awauq, dan tidak juga pada kurang daripada lima Dhawd, dan tidak juga pada kurang daripada lima Awaq."
  },
  {
    "id": 17227,
    "hadith_number": 2491,
    "tajuk_hadith": "Tiada Sedekah di Bawah Lima Awaq",
    "perawi_melayu": "Abu Sa'eed meriwayatkan:",
    "english_text": "The Messenger of Allah said: \"No Sadaqah is due on less than five Awaq.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا وَكِيعٌ، قَالَ حَدَّثَنَا إِدْرِيسُ الأَوْدِيُّ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ أَبِي الْبَخْتَرِيِّ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ صَدَقَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Tiada sedekah dikenakan pada (harta) kurang daripada lima Awaq.\""
  },
  {
    "id": 17228,
    "hadith_number": 2492,
    "tajuk_hadith": "Kewajipan Zakat pada Harta Tertentu",
    "perawi_melayu": "Diriwayatkan daripada Abu Sa'eed Al-Khudri bahawa Nabi SAW bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدَةَ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، وَعُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ عَمْرِو بْنِ يَحْيَى، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ صَدَقَةٌ وَلاَ فِيمَا دُونَ خَمْسِ ذَوْدٍ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Tidak ada sedekah (zakat) pada harta yang kurang daripada lima Awaq, tidak ada sedekah pada harta yang kurang daripada lima Dhawd, dan tidak ada sedekah pada harta yang kurang daripada lima Awsuq."
  },
  {
    "id": 17229,
    "hadith_number": 2493,
    "tajuk_hadith": "Kadar Zakat Tanaman yang Disiram",
    "perawi_melayu": "Daripada Salim, daripada bapanya, bahawa Rasulullah ﷺ bersabda:",
    "english_text": "\"For whatever is irrigated by the sky, rivers and springs, or draws up water from deep roots, one-tenth. For whatever is irrigated by animals and artificial means, one half of one-tenth.\"",
    "arabic_text": "أَخْبَرَنَا هَارُونُ بْنُ سَعِيدِ بْنِ الْهَيْثَمِ أَبُو جَعْفَرٍ الأَيْلِيُّ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ فِيمَا سَقَتِ السَّمَاءُ وَالأَنْهَارُ وَالْعُيُونُ أَوْ كَانَ بَعْلاً الْعُشْرُ وَمَا سُقِيَ بِالسَّوَانِي وَالنَّضْحِ نِصْفُ الْعُشْرِ ‏\"‏ ‏.‏",
    "malay_translation": "Sabda Rasulullah ﷺ: \"Bagi tanaman yang disiram oleh langit, sungai-sungai dan mata air, atau yang mengambil air dari akar yang dalam, (zakatnya) satu per sepuluh. Dan bagi tanaman yang disiram oleh haiwan dan cara buatan, (zakatnya) separuh dari satu per sepuluh.\""
  },
  {
    "id": 17230,
    "hadith_number": 2494,
    "tajuk_hadith": "Kadar Zakat bagi Hasil Pertanian",
    "perawi_melayu": "Jabir bin 'Abdullah berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنِي عَمْرُو بْنُ سَوَّادِ بْنِ الأَسْوَدِ بْنِ عَمْرٍو، وَأَحْمَدُ بْنُ عَمْرٍو، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ وَهْبٍ، قَالَ حَدَّثَنَا عَمْرُو بْنُ الْحَارِثِ، أَنَّ أَبَا الزُّبَيْرِ، حَدَّثَهُ أَنَّهُ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ فِيمَا سَقَتِ السَّمَاءُ وَالأَنْهَارُ وَالْعُيُونُ الْعُشْرُ وَفِيمَا سُقِيَ بِالسَّانِيَةِ نِصْفُ الْعُشْرِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: 'Bagi hasil pertanian yang disiram oleh air hujan, sungai dan mata air, (kadar zakatnya ialah) satu persepuluh. Dan bagi hasil pertanian yang diairi oleh haiwan, (kadar zakatnya ialah) separuh dari satu persepuluh.'"
  },
  {
    "id": 17231,
    "hadith_number": 2495,
    "tajuk_hadith": "Perintah Rasulullah SAW Berkaitan Zakat di Yaman",
    "perawi_melayu": "Mu'adh (RA) meriwayatkan:",
    "english_text": "\"The Messenger of Allah sent me to Yemen and he commanded me to take one-tenth of whatever is irrigated by the sky, and half of one-tenth of whatever is irrigated by means of buckets.\"",
    "arabic_text": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، عَنْ أَبِي بَكْرٍ، - وَهُوَ ابْنُ عَيَّاشٍ - عَنْ عَاصِمٍ، عَنْ أَبِي وَائِلٍ، عَنْ مُعَاذٍ، قَالَ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى الْيَمَنِ فَأَمَرَنِي أَنْ آخُذَ مِمَّا سَقَتِ السَّمَاءُ الْعُشْرَ وَفِيمَا سُقِيَ بِالدَّوَالِي نِصْفَ الْعُشْرِ ‏.‏",
    "malay_translation": "Rasulullah SAW mengutusku ke Yaman dan memerintahkanku untuk mengambil satu persepuluh daripada apa yang disirami oleh hujan, dan separuh daripada satu persepuluh daripada apa yang disirami dengan menggunakan timba."
  },
  {
    "id": 17232,
    "hadith_number": 2496,
    "tajuk_hadith": "Kadar Zakat yang Diambil Ketika Menganggar Hasil",
    "perawi_melayu": "Diriwayatkan daripada 'Abdur-Rahman bin Mas'ud bin Niyar:",
    "english_text": "\"Sahl bin Abi Hathmah came to us when we were in the market and said: \"The Messenger of Allah said: When you have estimated, take two-thirds (of the portion you have estimated as Zakah) and leave one-third, and if you do not take (two-thirds) or leave one-third. (One of the reporters) Shu 'bah doubted - leave one quarter.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ جَعْفَرٍ، قَالاَ حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ خُبَيْبَ بْنَ عَبْدِ الرَّحْمَنِ، يُحَدِّثُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَسْعُودِ بْنِ نِيَارٍ، عَنْ سَهْلِ بْنِ أَبِي حَثَمَةَ، قَالَ أَتَانَا وَنَحْنُ فِي السُّوقِ فَقَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا خَرَصْتُمْ فَخُذُوا وَدَعُوا الثُّلُثَ فَإِنْ لَمْ تَأْخُذُوا أَوْ تَدَعُوا الثُّلُثَ - شَكَّ شُعْبَةُ - فَدَعُوا الرُّبُعَ ‏\"‏ ‏.‏",
    "malay_translation": "Sahl bin Abi Hathmah datang kepada kami ketika kami berada di pasar dan berkata: \"Rasulullah ﷺ bersabda: Apabila kamu telah menganggarkan (hasil tanaman), maka ambillah dua pertiga (daripada bahagian yang kamu anggarkan sebagai zakat) dan tinggalkan satu pertiga, dan jika kamu tidak mengambil (dua pertiga) atau meninggalkan satu pertiga. (Salah seorang perawi) Shu'bah ragu - tinggalkan satu perempat.\""
  },
  {
    "id": 17233,
    "hadith_number": 2497,
    "tajuk_hadith": "Larangan Memberi Sedekah dengan Kurma Berkualiti Rendah",
    "perawi_melayu": "Abu Umamah bin Sahl bin Hunaif berkata:",
    "english_text": "concerning the Verse in which Allah, the Mighty and Subline, says: And do not aim at that which is bad to spend from it.\"  This refers to had quality dates. The Messenger of Allah forbade taking bad quality dates as Sadaqah.",
    "arabic_text": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ وَهْبٍ، قَالَ حَدَّثَنِي عَبْدُ الْجَلِيلِ بْنُ حُمَيْدٍ الْيَحْصَبِيُّ، أَنَّ ابْنَ شِهَابٍ، حَدَّثَهُ قَالَ حَدَّثَنِي أَبُو أُمَامَةَ بْنُ سَهْلِ بْنِ حُنَيْفٍ، فِي الآيَةِ الَّتِي قَالَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ وَلاَ تَيَمَّمُوا الْخَبِيثَ مِنْهُ تُنْفِقُونَ ‏}‏ قَالَ هُوَ الْجُعْرُورُ وَلَوْنُ حُبَيْقٍ فَنَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ تُؤْخَذَ فِي الصَّدَقَةِ الرُّذَالَةُ ‏.‏",
    "malay_translation": "Berkaitan dengan ayat di mana Allah, Yang Maha Gagah dan Maha Tinggi, berfirman: \"Dan janganlah kamu memilih yang buruk daripadanya untuk kamu nafkahkan.\" Ini merujuk kepada kurma yang berkualiti rendah. Rasulullah SAW melarang mengambil kurma berkualiti buruk sebagai Sedekah."
  },
  {
    "id": 17234,
    "hadith_number": 2498,
    "tajuk_hadith": "Kesan Sedekah yang Buruk",
    "perawi_melayu": "Diriwayatkan daripada 'Awf bin Malik",
    "english_text": "\"The Messenger of Allah came out with a stick in his hand, and a man had hung up a bunch of dry and bad dates. He started hitting that bunch of dates and said: 'I wish that the one who gave this Sadaqah had given something better than this, for the one who gave these dry, bad dates will eat dry, bad dates on the Day of Resurrection.\"'",
    "arabic_text": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا يَحْيَى، عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ، قَالَ حَدَّثَنِي صَالِحُ بْنُ أَبِي عَرِيبٍ، عَنْ كَثِيرِ بْنِ مُرَّةَ الْحَضْرَمِيِّ، عَنْ عَوْفِ بْنِ مَالِكٍ، قَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَبِيَدِهِ عَصًا وَقَدْ عَلَّقَ رَجُلٌ قِنْوَ حَشَفٍ فَجَعَلَ يَطْعَنُ فِي ذَلِكَ الْقِنْوِ فَقَالَ ‏\n\"‏ لَوْ شَاءَ رَبُّ هَذِهِ الصَّدَقَةِ تَصَدَّقَ بِأَطْيَبَ مِنْ هَذَا إِنَّ رَبَّ هَذِهِ الصَّدَقَةِ يَأْكُلُ حَشَفًا يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ keluar dengan sebatang tongkat di tangannya, dan seorang lelaki telah menggantungkan setandan kurma yang kering dan buruk. Baginda ﷺ mula memukul setandan kurma itu dan bersabda: 'Alangkah baiknya jika orang yang bersedekah ini memberikan sesuatu yang lebih baik daripada ini, kerana sesungguhnya orang yang memberikan kurma yang kering dan buruk ini akan memakan kurma yang kering dan buruk pada Hari Kiamat.'"
  },
  {
    "id": 17235,
    "hadith_number": 2499,
    "tajuk_hadith": "Hukum Al-Luqath (Barang Temuan)",
    "perawi_melayu": "Diriwayatkan daripada 'Amr bin Shu'aib, daripada bapanya, bahawa datuknya berkata:",
    "english_text": "\"The Messenger of Allah was asked about Al-Luqath.",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عُبَيْدِ اللَّهِ بْنِ الأَخْنَسِ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ اللُّقَطَةِ فَقَالَ ‏\n\"‏ مَا كَانَ فِي طَرِيقٍ مَأْتِيٍّ أَوْ فِي قَرْيَةٍ عَامِرَةٍ فَعَرِّفْهَا سَنَةً فَإِنْ جَاءَ صَاحِبُهَا وَإِلاَّ فَلَكَ وَمَا لَمْ يَكُنْ فِي طَرِيقٍ مَأْتِيٍّ وَلاَ فِي قَرْيَةٍ عَامِرَةٍ فَفِيهِ وَفِي الرِّكَازِ الْخُمْسُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ ditanya tentang Al-Luqath (barang temuan). Baginda bersabda: \"Barang yang dijumpai di jalan yang dilalui orang ramai atau di kampung yang ramai penduduknya, hendaklah diumumkan selama setahun. Jika pemiliknya datang (menuntut), maka berikanlah kepadanya. Jika tidak, maka ia menjadi hak milikmu. Dan barang yang tidak dijumpai di jalan yang dilalui orang ramai atau di kampung yang ramai penduduknya, maka padanya (terdapat hukum) dan pada Rikaz (harta terpendam) ada khumus (satu perlima).\""
  },
  {
    "id": 17236,
    "hadith_number": 2500,
    "tajuk_hadith": "Kewajipan Khumus pada Rikaz (Harta Terpendam)",
    "perawi_melayu": "Daripada Abu Hurairah bahawa Nabi ﷺ bersabda:",
    "english_text": "\"Not Available\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ح وَأَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، وَأَبِي، سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْعَجْمَاءُ جَرْحُهَا جُبَارٌ وَالْبِئْرُ جُبَارٌ وَالْمَعْدِنُ جُبَارٌ وَفِي الرِّكَازِ الْخُمْسُ ‏\"‏ ‏.‏",
    "malay_translation": "Kecederaan yang disebabkan oleh binatang tidak ada liabiliti, dan telaga tidak ada liabiliti, dan lombong tidak ada liabiliti, dan Khumus wajib ke atas Rikaz (harta terpendam)."
  },
  {
    "id": 17237,
    "hadith_number": 2501,
    "tajuk_hadith": "Laporan Serupa daripada Abu Hurairah",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah:",
    "english_text": "A similar report was narrated from Abu Hurairah from the Messenger of Allah.",
    "arabic_text": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدٍ، وَعُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
    "malay_translation": "Satu laporan yang serupa telah diriwayatkan daripada Abu Hurairah daripada Rasulullah ﷺ."
  },
  {
    "id": 17238,
    "hadith_number": 2502,
    "tajuk_hadith": "Kecederaan, Perigi, Lombong, dan Rikaz",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah bahawa Rasulullah ﷺ bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدٍ، وَأَبِي، سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ جَرْحُ الْعَجْمَاءِ جُبَارٌ وَالْبِئْرُ جُبَارٌ وَالْمَعْدِنُ جُبَارٌ وَفِي الرِّكَازِ الْخُمْسُ ‏\"‏ ‏.‏",
    "malay_translation": "Kecederaan yang disebabkan oleh haiwan ternakan adalah tidak bertanggungjawab, begitu juga perigi, lombong, dan pada Rikaz (harta karun yang ditemui dalam tanah) wajib dikeluarkan Khumus (satu perlima)."
  },
  {
    "id": 17239,
    "hadith_number": 2503,
    "tajuk_hadith": "Kerosakan Disebabkan Perigi, Haiwan, dan Galian",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "The Messenger of Allah said: \"The injuries caused by the well are without liability,  and beasts are without liability, and mines are without liability, and the Khumus is due on Rikaz.\"",
    "arabic_text": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هُشَيْمٌ، أَنْبَأَنَا مَنْصُورٌ، وَهِشَامٌ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، رضى الله عنه قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْبِئْرُ جُبَارٌ وَالْعَجْمَاءُ جُبَارٌ وَالْمَعْدِنُ جُبَارٌ وَفِي الرِّكَازِ الْخُمْسُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Kecederaan yang disebabkan oleh perigi tidak ada liabiliti (tanggungjawab), dan haiwan ternakan tidak ada liabiliti, dan galian (perlombongan) tidak ada liabiliti, dan Khumus (1/5) wajib dikeluarkan dari Rikaz (harta karun yang ditemui).\""
  },
  {
    "id": 17240,
    "hadith_number": 2504,
    "tajuk_hadith": "Perlindungan Lembah Salabah dan Hubungannya dengan Hasil Lebah",
    "perawi_melayu": "Daripada 'Amr bin Shu'aib, daripada bapanya, daripada datuknya",
    "english_text": "\"Hilal came to the Messenger of Allah with one-tenth of the honey and asked him to protect a valley for him that was called Salabah. 'The Messenger of Allah protected that valley for him. When 'Umar bin Al-Khattab became the Khalifah, sufyan bin Wahb wrote the 'Umar and asked him (about that), and Umar wrote: 'If the gives me what he used to give to the Messenger of Allah, one-tenth of his honey, I will protect Salahab for him, otherwise they are just bees and anyone who wants to may eat of it.'\"",
    "arabic_text": "أَخْبَرَنِي الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ، عَنْ مُوسَى بْنِ أَعْيَنَ، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ جَاءَ هِلاَلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِعُشُورِ نَحْلٍ لَهُ وَسَأَلَهُ أَنْ يَحْمِيَ لَهُ وَادِيًا يُقَالُ لَهُ سَلَبَةُ فَحَمَى لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَلِكَ الْوَادِيَ فَلَمَّا وَلِيَ عُمَرُ بْنُ الْخَطَّابِ كَتَبَ سُفْيَانُ بْنُ وَهْبٍ إِلَى عُمَرَ بْنِ الْخَطَّابِ يَسْأَلُهُ فَكَتَبَ عُمَرُ إِنْ أَدَّى إِلَيْكَ مَا كَانَ يُؤَدِّي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ عُشْرِ نَحْلِهِ فَاحْمِ لَهُ سَلَبَةَ ذَلِكَ وَإِلاَّ فَإِنَّمَا هُوَ ذُبَابُ غَيْثٍ يَأْكُلُهُ مَنْ شَاءَ ‏.‏",
    "malay_translation": "Hilal datang kepada Rasulullah ﷺ dengan sepersepuluh daripada madunya dan meminta baginda untuk melindungi sebuah lembah bernama Salabah. Rasulullah ﷺ melindungi lembah itu untuknya. Apabila 'Umar bin Al-Khattab menjadi Khalifah, Sufyan bin Wahb menulis surat kepada 'Umar dan bertanya tentang hal itu, dan 'Umar menulis: 'Jika dia memberi saya apa yang pernah dia berikan kepada Rasulullah ﷺ, sepersepuluh daripada madunya, saya akan melindungi Salabah untuknya, jika tidak, ia hanyalah lebah dan sesiapa yang mahu boleh memakannya.'"
  },
  {
    "id": 17241,
    "hadith_number": 2505,
    "tajuk_hadith": "Kewajipan Zakat Fitrah",
    "perawi_melayu": "Ibn 'Umar berkata:",
    "english_text": "\"The Messenger of Allah enjoined Zakah of Ramadan upon the free and the slave, male and female, a Sa of dates or a Sa of barley, so the people considered that equivalent to half a Sa of wheat.\"",
    "arabic_text": "أَخْبَرَنَا عِمْرَانُ بْنُ مُوسَى، عَنْ عَبْدِ الْوَارِثِ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ فَرَضَ رَسُولُ اللَّهِ صلى الله عليه وسلم زَكَاةَ رَمَضَانَ عَلَى الْحُرِّ وَالْعَبْدِ وَالذَّكَرِ وَالأُنْثَى صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ فَعَدَلَ النَّاسُ بِهِ نِصْفَ صَاعٍ مِنْ بُرٍّ ‏.‏",
    "malay_translation": "Rasulullah SAW mewajibkan Zakat Ramadan ke atas orang merdeka dan hamba, lelaki dan perempuan, satu *Sa'* kurma atau satu *Sa'* gandum. Maka orang ramai menganggapnya setara dengan setengah *Sa'* gandum."
  },
  {
    "id": 17242,
    "hadith_number": 2506,
    "tajuk_hadith": "Kewajipan Zakat Fitrah",
    "perawi_melayu": "Daripada Ibnu 'Umar",
    "english_text": "\"The Messenger of Allah enjoined Sadaqatul Fitr upon male and female, free and slave; a Sa of dates or a Sa of barley.\" He said: \"The people considered that equivalent to half a Sa of wheat.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ فَرَضَ رَسُولُ اللَّهِ صلى الله عليه وسلم صَدَقَةَ الْفِطْرِ عَلَى الذَّكَرِ وَالأُنْثَى وَالْحُرِّ وَالْمَمْلُوكِ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ ‏.‏ قَالَ فَعَدَلَ النَّاسُ إِلَى نِصْفِ صَاعٍ مِنْ بُرٍّ ‏.‏",
    "malay_translation": "Rasulullah ﷺ mewajibkan Sadaqatul Fitr ke atas lelaki dan perempuan, merdeka dan hamba; satu *Sa'* daripada kurma atau satu *Sa'* daripada barli.\" Kata perawi: \"Orang ramai menganggap ia bersamaan dengan setengah *Sa'* daripada gandum."
  },
  {
    "id": 17243,
    "hadith_number": 2507,
    "tajuk_hadith": "Kewajipan Zakat Ramadan",
    "perawi_melayu": "Daripada Ibnu 'Umar r.a.",
    "english_text": "\"The Messenger of Allah enjoined the Zakah of Ramadan on everyone, young and old, free and slave, male and female, a Sa of dates or a Sa of barley.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ فَرَضَ رَسُولُ اللَّهِ صلى الله عليه وسلم زَكَاةَ رَمَضَانَ عَلَى كُلِّ صَغِيرٍ وَكَبِيرٍ حُرٍّ وَعَبْدٍ وَذَكَرٍ وَأُنْثَى صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ ‏.‏",
    "malay_translation": "Rasulullah ﷺ mewajibkan Zakat Ramadan ke atas setiap orang, sama ada yang kecil atau yang besar, yang merdeka atau hamba, lelaki atau perempuan, satu *Sa'* daripada kurma atau satu *Sa'* daripada barli."
  },
  {
    "id": 17244,
    "hadith_number": 2508,
    "tajuk_hadith": "Kewajipan Zakatul-Fitr",
    "perawi_melayu": "Daripada Ibn 'Umar r.a.",
    "english_text": "the Messenger of Allah enjoined Zakatul-Fitr at the end of Ramadan upon the people; a Sa' of dates or a Sa' of barley, upon everyone, free or slave, male or female, of the Muslims.",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، - وَاللَّفْظُ لَهُ - عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم فَرَضَ زَكَاةَ الْفِطْرِ مِنْ رَمَضَانَ عَلَى النَّاسِ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ عَلَى كُلِّ حُرٍّ أَوْ عَبْدٍ ذَكَرٍ أَوْ أُنْثَى مِنَ الْمُسْلِمِينَ ‏.‏",
    "malay_translation": "Rasulullah SAW mewajibkan Zakatul-Fitr pada akhir bulan Ramadan ke atas manusia; satu *Sa'* kurma atau satu *Sa'* barli, ke atas setiap orang, merdeka atau hamba, lelaki atau perempuan, daripada kalangan orang Islam."
  },
  {
    "id": 17245,
    "hadith_number": 2509,
    "tajuk_hadith": "Kewajipan Zakatul-Fitr dan Waktunya",
    "perawi_melayu": "Daripada Ibnu 'Umar",
    "english_text": "\"The Messenger of Allah enjoined Zakatul-Fitr, a Sa' of dates or a Sa of barley, upon the free person and the slave, male and female, young and old, among the Muslims. He commanded that it be given before the people went out to the ('fd) prayer.\"",
    "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ مُحَمَّدِ بْنِ السَّكَنِ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَهْضَمٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عُمَرَ بْنِ نَافِعٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، قَالَ فَرَضَ رَسُولُ اللَّهِ صلى الله عليه وسلم زَكَاةَ الْفِطْرِ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ عَلَى الْحُرِّ وَالْعَبْدِ وَالذَّكَرِ وَالأُنْثَى وَالصَّغِيرِ وَالْكَبِيرِ مِنَ الْمُسْلِمِينَ وَأَمَرَ بِهَا أَنْ تُؤَدَّى قَبْلَ خُرُوجِ النَّاسِ إِلَى الصَّلاَةِ ‏.‏",
    "malay_translation": "Rasulullah ﷺ mewajibkan Zakatul-Fitr, satu Sa' kurma atau satu Sa' barli, ke atas orang merdeka dan hamba, lelaki dan perempuan, kanak-kanak dan orang dewasa, daripada kalangan orang Islam. Baginda memerintahkan agar ia dikeluarkan sebelum orang ramai keluar menunaikan solat ('Id)."
  },
  {
    "id": 17246,
    "hadith_number": 2510,
    "tajuk_hadith": "Kewajipan Zakat Fitrah",
    "perawi_melayu": "Daripada Ibnu 'Umar",
    "english_text": "\"The Messenger of Allah enjoined Sadaqatul Fitr upon young and old, male and female, free and slave; a Sa' of dates or a Sa' of barley,\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عِيسَى، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ فَرَضَ رَسُولُ اللَّهِ صلى الله عليه وسلم صَدَقَةَ الْفِطْرِ عَلَى الصَّغِيرِ وَالْكَبِيرِ وَالذَّكَرِ وَالأُنْثَى وَالْحُرِّ وَالْعَبْدِ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ ‏.‏",
    "malay_translation": "Rasulullah ﷺ mewajibkan Sadaqatul Fitr ke atas orang yang kecil dan besar, lelaki dan perempuan, merdeka dan hamba; satu Sa' daripada kurma atau satu Sa' daripada gandum."
  },
  {
    "id": 17247,
    "hadith_number": 2511,
    "tajuk_hadith": "Puasa 'Asyura dan Zakatul Fitr Sebelum Kewajipan Ramadan dan Zakat",
    "perawi_melayu": "Qais bin Sa'd bin 'Ubadah",
    "english_text": "\"We used to fast on 'Ashura and give Zakatul-Fitr, and when the command to fast in Ramadan was revealed, and the command to give Zakah was revealed, we were neither commanded to give it, nor told not to do so, and we used to do it.\"",
    "arabic_text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، قَالَ أَنْبَأَنَا شُعْبَةُ، عَنِ الْحَكَمِ بْنِ عُتَيْبَةَ، عَنِ الْقَاسِمِ بْنِ مُخَيْمِرَةَ، عَنْ عَمْرِو بْنِ شُرَحْبِيلَ، عَنْ قَيْسِ بْنِ سَعْدِ بْنِ عُبَادَةَ، قَالَ كُنَّا نَصُومُ عَاشُورَاءَ وَنُؤَدِّي زَكَاةَ الْفِطْرِ فَلَمَّا نَزَلَ رَمَضَانُ وَنَزَلَتِ الزَّكَاةُ لَمْ نُؤْمَرْ بِهِ وَلَمْ نُنْهَ عَنْهُ وَكُنَّا نَفْعَلُهُ ‏.‏",
    "malay_translation": "Kami dahulu berpuasa pada hari 'Asyura dan mengeluarkan Zakatul-Fitr. Apabila perintah berpuasa di bulan Ramadan diturunkan, dan perintah mengeluarkan zakat diturunkan, kami tidak diperintahkan untuk melakukannya, dan kami juga tidak dilarang dari melakukannya. Kami terus melakukannya."
  },
  {
    "id": 17248,
    "hadith_number": 2512,
    "tajuk_hadith": "Perintah Zakat dan Sedekah Fitrah",
    "perawi_melayu": "Qais bin Sa'd",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنِ الْقَاسِمِ بْنِ مُخَيْمِرَةَ، عَنْ أَبِي عَمَّارٍ الْهَمْدَانِيِّ، عَنْ قَيْسِ بْنِ سَعْدٍ، قَالَ أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِصَدَقَةِ الْفِطْرِ قَبْلَ أَنْ تَنْزِلَ الزَّكَاةُ فَلَمَّا نَزَلَتِ الزَّكَاةُ لَمْ يَأْمُرْنَا وَلَمْ يَنْهَنَا وَنَحْنُ نَفْعَلُهُ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ أَبُو عَمَّارٍ اسْمُهُ عَرِيبُ بْنُ حُمَيْدٍ وَعَمْرُو بْنُ شُرَحْبِيلَ يُكَنَّى أَبَا مَيْسَرَةَ وَسَلَمَةُ بْنُ كُهَيْلٍ خَالَفَ الْحَكَمَ فِي إِسْنَادِهِ وَالْحَكَمُ أَثْبَتُ مِنْ سَلَمَةَ بْنِ كُهَيْلٍ ‏.‏",
    "malay_translation": "Rasulullah ﷺ memerintahkan kami untuk mengeluarkan *Sadaqatul Fitr* sebelum perintah mengeluarkan *Zakat* diturunkan. Apabila perintah mengeluarkan *Zakat* telah diturunkan, baginda tidak menyuruh kami untuk melakukannya dan tidak pula melarang kami, dan kami terus melakukannya.\" (Sahih)\nAbu 'Abdur-Rahman (An-Nasai) berkata: Nama Abu 'Ammar adalah 'Arib bin Humaid, dan Kunyah 'Amr bin Shurabbil adalah Abu Maisarah, dan Salamah bin Kuhail menyalahi Al-Hakam dalam sanadnya, dan Al-Hakam lebih boleh dipercayai daripada Salamah bin Kuhail."
  },
  {
    "id": 17249,
    "hadith_number": 2513,
    "tajuk_hadith": "Keluarkan Zakat Puasa",
    "perawi_melayu": "Ketika beliau menjadi gabenor Al-Basrah, pada akhir bulan, Ibn 'Abbas berkata:",
    "english_text": "\"Give Zakah of your fast.\" The people looked at one another, so he said: \"Whoever is here from the people of Al-Madinah, get up and teach your brothers, for they do lnot know that this Zakah was enjoined by the Messenger of Allah upon every male and female, free and slave, a Sa' of barley or dates, or half a Sa' of wheat. \"So they got up. (Da'if) Hisham contradicted him, he said:  \"From Muhammad bin Sirin.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا خَالِدٌ، - وَهُوَ ابْنُ الْحَارِثِ - قَالَ حَدَّثَنَا حُمَيْدٌ، عَنِ الْحَسَنِ، قَالَ قَالَ ابْنُ عَبَّاسٍ وَهُوَ أَمِيرُ الْبَصْرَةِ فِي آخِرِ الشَّهْرِ أَخْرِجُوا زَكَاةَ صَوْمِكُمْ ‏.‏ فَنَظَرَ النَّاسُ بَعْضُهُمْ إِلَى بَعْضٍ فَقَالَ مَنْ هَا هُنَا مِنْ أَهْلِ الْمَدِينَةِ قُومُوا فَعَلِّمُوا إِخْوَانَكُمْ فَإِنَّهُمْ لاَ يَعْلَمُونَ إِنَّ هَذِهِ الزَّكَاةَ فَرَضَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى كُلِّ ذَكَرٍ وَأُنْثَى حُرٍّ وَمَمْلُوكٍ صَاعًا مِنْ شَعِيرٍ أَوْ تَمْرٍ أَوْ نِصْفَ صَاعٍ مِنْ قَمْحٍ ‏.‏ فَقَامُوا ‏.‏ خَالَفَهُ هِشَامٌ فَقَالَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ ‏.‏",
    "malay_translation": "“Keluarkan zakat puasa kamu.” Orang ramai saling berpandangan. Kemudian beliau berkata: “Sesiapa sahaja di sini yang berasal dari penduduk Al-Madinah, bangunlah dan ajarkan saudara-saudara kamu, kerana mereka tidak tahu bahawa zakat ini diwajibkan oleh Rasulullah ﷺ ke atas setiap lelaki dan perempuan, merdeka dan hamba, satu *Sa'* daripada gandum atau kurma, atau separuh *Sa'* daripada gandum.” Lalu mereka pun bangun. (Da'if). Hisham menyanggahnya, dia berkata: “Daripada Muhammad bin Sirin.”"
  },
  {
    "id": 17250,
    "hadith_number": 2514,
    "tajuk_hadith": "Kadar Zakat Fitrah Menurut Ibn 'Abbas",
    "perawi_melayu": "Ibn 'Abbas",
    "english_text": "Ibn 'Abbas said concerning Sadaqatul-Fitr. \"A Sa' of wheat, or a Sa' of dates, or Sa of barley, or a Sa' of rye.\" (Sahih Mawquf)",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ مَيْمُونٍ، عَنْ مَخْلَدٍ، عَنْ هِشَامٍ، عَنِ ابْنِ سِيرِينَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ ذَكَرَ فِي صَدَقَةِ الْفِطْرِ قَالَ صَاعًا مِنْ بُرٍّ أَوْ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ سُلْتٍ ‏.‏",
    "malay_translation": "Ibn 'Abbas berkata mengenai Sadaqatul-Fitr: \"Satu Sa' gandum, atau satu Sa' kurma, atau satu Sa' barli, atau satu Sa' rai.\" (Sahih Mawquf)"
  },
  {
    "id": 17251,
    "hadith_number": 2515,
    "tajuk_hadith": "Zakat Fitrah: Satu Sa' Makanan",
    "perawi_melayu": "Abu Raja' berkata:",
    "english_text": "I heard Ibn 'Abbas deliver a Khutbah from your Minbar - meaning the Minbar in Al-Basrah - saying: 'Sadaqatul Fitr is a Sa' of food.\" (Sahih)\nAbu 'Abdur-Rahman (An-Nasa'i) said: This is the most reliable of the three.",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ أَبِي رَجَاءٍ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، يَخْطُبُ عَلَى مِنْبَرِكُمْ - يَعْنِي مِنْبَرَ الْبَصْرَةِ - يَقُولُ صَدَقَةُ الْفِطْرِ صَاعٌ مِنْ طَعَامٍ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا أَثْبَتُ الثَّلاَثَةِ ‏.‏",
    "malay_translation": "Saya mendengar Ibn 'Abbas menyampaikan khutbah dari Minbar kamu - bermaksud Minbar di Al-Basrah - seraya berkata: 'Sadaqatul Fitr adalah satu Sa' makanan.' (Sahih)\nAbu 'Abdur-Rahman (An-Nasa'i) berkata: Ini adalah yang paling sahih daripada tiga (riwayat)."
  },
  {
    "id": 17252,
    "hadith_number": 2516,
    "tajuk_hadith": "Kewajipan Zakat Fitrah: Satu Sa' Gandum, Kurma atau Keju",
    "perawi_melayu": "Abu Sa'eed Al-Khudri berkata:",
    "english_text": "\"The Messenger of Allah enjoined Sadaqatul Fitr, a Sa' of barley or a Sa of dates or a Sa' of cottage cheese.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ حَرْبٍ، قَالَ حَدَّثَنَا مُحْرِزُ بْنُ الْوَضَّاحِ، عَنْ إِسْمَاعِيلَ، - وَهُوَ ابْنُ أُمَيَّةَ - عَنِ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي ذُبَابٍ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي سَرْحٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ فَرَضَ رَسُولُ اللَّهِ صلى الله عليه وسلم صَدَقَةَ الْفِطْرِ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ أَقِطٍ ‏.‏",
    "malay_translation": "Rasulullah ﷺ mewajibkan Sadaqatul Fitr, satu Sa' gandum atau satu Sa' kurma atau satu Sa' keju."
  },
  {
    "id": 17253,
    "hadith_number": 2517,
    "tajuk_hadith": "Kadar Zakat Fitrah pada Zaman Nabi SAW",
    "perawi_melayu": "Daripada Ibn 'Abbas berkata:",
    "english_text": "\"We used to pay Zakaul Fitr when the Messenger of Allah was among us; a Sa' of food, or a Sa' of barley, or a Sa' of dates, or a Sa' of raisins, or a Sa of cottage cheese.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي سَرْحٍ، عَنْ أَبِي سَعِيدٍ، قَالَ كُنَّا نُخْرِجُ زَكَاةَ الْفِطْرِ إِذْ كَانَ فِينَا رَسُولُ اللَّهِ صلى الله عليه وسلم صَاعًا مِنْ طَعَامٍ أَوْ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ زَبِيبٍ أَوْ صَاعًا مِنْ أَقِطٍ ‏.‏",
    "malay_translation": "Kami membayar Zakatul Fitr ketika Rasulullah SAW berada di kalangan kami; satu *Sa'* makanan, atau satu *Sa'* barli, atau satu *Sa'* kurma, atau satu *Sa'* kismis, atau satu *Sa'* keju kotej."
  },
  {
    "id": 17254,
    "hadith_number": 2518,
    "tajuk_hadith": "Kadar Zakat Fitrah Pada Zaman Nabi (SAW)",
    "perawi_melayu": "Abu Sa'eed",
    "english_text": "\"We used to pay Salaqatul Fitr when the \nMessenger of Allah was among us; a Sa' of food, or a Sa' of dates, or a Sa' of barley, or a Sa' of cottage cheese. We continued to do so until Mu'awiyah came from Ash-Sham and one of the things that he taught the people was when he said: I think that two Mudds of wheat from Ash-Sham are equivalent to a Sa' of this, So the people took to that.\"",
    "arabic_text": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، عَنْ وَكِيعٍ، عَنْ دَاوُدَ بْنِ قَيْسٍ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي سَعِيدٍ، قَالَ كُنَّا نُخْرِجُ صَدَقَةَ الْفِطْرِ إِذْ كَانَ فِينَا رَسُولُ اللَّهِ صلى الله عليه وسلم صَاعًا مِنْ طَعَامٍ أَوْ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ أَقِطٍ فَلَمْ نَزَلْ كَذَلِكَ حَتَّى قَدِمَ مُعَاوِيَةُ مِنَ الشَّامِ وَكَانَ فِيمَا عَلَّمَ النَّاسَ أَنَّهُ قَالَ مَا أَرَى مُدَّيْنِ مِنْ سَمْرَاءِ الشَّامِ إِلاَّ تَعْدِلُ صَاعًا مِنْ هَذَا ‏.‏ قَالَ فَأَخَذَ النَّاسُ بِذَلِكَ ‏.‏",
    "malay_translation": "Kami membayar *Zakatul Fitr* ketika Rasulullah SAW bersama kami; satu *Sa'* makanan, atau satu *Sa'* kurma, atau satu *Sa'* barli, atau satu *Sa'* keju. Kami terus berbuat demikian sehingga Mu'awiyah datang dari Syam dan antara perkara yang diajarkannya kepada orang ramai ialah dia berkata: 'Saya berpendapat bahawa dua *Mudd* gandum dari Syam bersamaan dengan satu *Sa'* daripada ini.' Maka orang ramai pun mengikutinya."
  },
  {
    "id": 17255,
    "hadith_number": 2519,
    "tajuk_hadith": "Jumlah Zakat Fitrah Pada Zaman Rasulullah SAW",
    "perawi_melayu": "Daripada Abu Sa'eed Al-Khudri",
    "english_text": "\" Not Available",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ عَجْلاَنَ، قَالَ سَمِعْتُ عِيَاضَ بْنَ عَبْدِ اللَّهِ، يُخْبِرُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ لَمْ نُخْرِجْ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلاَّ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ زَبِيبٍ أَوْ صَاعًا مِنْ دَقِيقٍ أَوْ صَاعًا مِنْ أَقِطٍ أَوْ صَاعًا مِنْ سُلْتٍ - ثُمَّ شَكَّ سُفْيَانُ - فَقَالَ دَقِيقٍ أَوْ سُلْتٍ ‏.‏",
    "malay_translation": "Daripada Abu Sa'eed Al-Khudri berkata: \"Pada zaman Rasulullah SAW, kami tidak mengeluarkan zakat fitrah melainkan satu *Sa'* tamar, atau satu *Sa'* gandum, atau satu *Sa'* kismis, atau satu *Sa'* tepung, atau satu *Sa'* keju dadih, atau satu *Sa'* *sult*. Kemudian Sufyan ragu-ragu, dan berkata: 'Tepung atau *sult*.'"
  },
  {
    "id": 17256,
    "hadith_number": 2520,
    "tajuk_hadith": "Keluarkan Zakat Fitrah daripada Puasa",
    "perawi_melayu": "Diriwayatkan daripada Al-Hasan bahawa Ibn 'Abbas menyampaikan khutbah di Al-Basrah dan berkata:",
    "english_text": "\"Not Available\"",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، قَالَ حَدَّثَنَا حُمَيْدٌ، عَنِ الْحَسَنِ، أَنَّ ابْنَ عَبَّاسٍ، خَطَبَ بِالْبَصْرَةِ فَقَالَ أَدُّوا زَكَاةَ صَوْمِكُمْ ‏.‏ فَجَعَلَ النَّاسُ يَنْظُرُ بَعْضُهُمْ إِلَى بَعْضٍ فَقَالَ مَنْ هَا هُنَا مِنْ أَهْلِ الْمَدِينَةِ قُومُوا إِلَى إِخْوَانِكُمْ فَعَلِّمُوهُمْ فَإِنَّهُمْ لاَ يَعْلَمُونَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم فَرَضَ صَدَقَةَ الْفِطْرِ عَلَى الصَّغِيرِ وَالْكَبِيرِ وَالْحُرِّ وَالْعَبْدِ وَالذَّكَرِ وَالأُنْثَى نِصْفَ صَاعِ بُرٍّ أَوْ صَاعًا مِنْ تَمْرٍ أَوْ شَعِيرٍ ‏.‏ قَالَ الْحَسَنُ فَقَالَ عَلِيٌّ أَمَّا إِذَا أَوْسَعَ اللَّهُ فَأَوْسِعُوا أَعْطُوا صَاعًا مِنْ بُرٍّ أَوْ غَيْرِهِ ‏.‏",
    "malay_translation": "“Bayarlah zakat puasa kamu.” Orang ramai mula saling memandang. Lalu dia berkata: “Sesiapa sahaja yang berada di sini daripada penduduk Al-Madinah, bangun dan ajarlah saudara-saudara kamu, kerana mereka tidak tahu bahawa Rasulullah SAW telah mewajibkan Sadaqatul Fitr kepada yang muda dan tua, merdeka dan hamba, lelaki dan perempuan; setengah sa' gandum atau satu sa' kurma atau barli.” Al-Hasan berkata: 'Jika Allah telah memberi kamu lebih, maka berilah lebih murah hati daripada gandum atau sesuatu yang lain.''"
  },
  {
    "id": 17257,
    "hadith_number": 2521,
    "tajuk_hadith": "Kadar Zakat Fitrah di Zaman Rasulullah",
    "perawi_melayu": "Daripada Ibnu 'Umar r.a.",
    "english_text": "\"At the time of the Messenger of Allah, the people used to give as Sadaqatul Fitr a Sa' of barely or dates or rye or raising.\"",
    "arabic_text": "أَخْبَرَنَا مُوسَى بْنُ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا حُسَيْنٌ، عَنْ زَائِدَةَ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي رَوَّادٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ النَّاسُ يُخْرِجُونَ عَنْ صَدَقَةِ الْفِطْرِ، فِي عَهْدِ النَّبِيِّ صلى الله عليه وسلم صَاعًا مِنْ شَعِيرٍ أَوْ تَمْرٍ أَوْ سُلْتٍ أَوْ زَبِيبٍ ‏.‏",
    "malay_translation": "Pada zaman Rasulullah SAW, orang ramai memberi sebagai Sadaqatul Fitr satu Sa' daripada gandum, kurma, gandum hitam atau kismis."
  },
  {
    "id": 17258,
    "hadith_number": 2522,
    "tajuk_hadith": "Pengeluaran Zakat Fitrah di Zaman Nabi (SAW)",
    "perawi_melayu": "Abu Sa' eed Al-Khudri",
    "english_text": "\"At the time of the Messenger of Allah, we used to give a Sa' of barley, or dates, or raisins, or cottage cheese, and we continued to do so until the time of Mu'awiyah, when he said: 'I think that two Mudds of wheat from Ash-Sham are equivalent to a Sa' of barley.\"'",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ، قَالَ حَدَّثَنَا عِيَاضٌ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ كُنَّا نُخْرِجُ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم صَاعًا مِنْ شَعِيرٍ أَوْ تَمْرٍ أَوْ زَبِيبٍ أَوْ أَقِطٍ فَلَمْ نَزَلْ كَذَلِكَ حَتَّى كَانَ فِي عَهْدِ مُعَاوِيَةَ قَالَ مَا أَرَى مُدَّيْنِ مِنْ سَمْرَاءِ الشَّامِ إِلاَّ تَعْدِلُ صَاعًا مِنْ شَعِيرٍ ‏.‏",
    "malay_translation": "Daripada Abu Sa'eed Al-Khudri (RA) berkata: \"Pada zaman Rasulullah (SAW), kami mengeluarkan satu *Sa'* daripada gandum, tamar, anggur kering, atau keju kotej. Kami terus berbuat demikian sehingga zaman Mu'awiyah, ketika dia berkata: 'Saya berpendapat bahawa dua *Mudd* gandum dari Syam adalah bersamaan dengan satu *Sa'* gandum.'\""
  },
  {
    "id": 17259,
    "hadith_number": 2523,
    "tajuk_hadith": "Sedekah Semasa Zaman Rasulullah (S.A.W)",
    "perawi_melayu": "Abu Sa'eed Al-Khudri (R.A.)",
    "english_text": "\"At the time of the Messenger of Allah we used to give a Sa' of dates, or a Sa' of barley, or a Sa' of cottage cheese, and we did not give anything else.\"",
    "arabic_text": "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ، قَالَ أَنْبَأَنَا اللَّيْثُ، عَنْ يَزِيدَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُثْمَانَ، أَنَّ عِيَاضَ بْنَ عَبْدِ اللَّهِ بْنِ سَعْدٍ، حَدَّثَهُ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ قَالَ كُنَّا نُخْرِجُ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ أَقِطٍ لاَ نُخْرِجُ غَيْرَهُ ‏.‏",
    "malay_translation": "Daripada Abu Sa'eed Al-Khudri (R.A.), beliau berkata: \"Pada zaman Rasulullah (S.A.W), kami memberi satu *sa'* kurma, atau satu *sa'* gandum, atau satu *sa'* keju dadih, dan kami tidak memberi yang lain selainnya.\""
  },
  {
    "id": 17260,
    "hadith_number": 2524,
    "tajuk_hadith": "Ukuran Sa' pada Zaman Rasulullah SAW",
    "perawi_melayu": "Al-Ju'aid",
    "english_text": "\"I heard As-Sa'ib bin Yazid say: 'During the time of Allah's messenger, the Sa' was equal to a Mudd and third of the Mudd you use today, and the Sa' of today has become large.\"' (Sahih)\nAbu 'Abdur-Rahman (An-Nasa'i) said: And Ziyad bin Ayyub narrated it to me.",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ، قَالَ أَنْبَأَنَا الْقَاسِمُ، - وَهُوَ ابْنُ مَالِكٍ - عَنِ الْجُعَيْدِ، سَمِعْتُ السَّائِبَ بْنَ يَزِيدَ، قَالَ كَانَ الصَّاعُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم مُدًّا وَثُلُثًا بِمُدِّكُمُ الْيَوْمَ وَقَدْ زِيدَ فِيهِ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ وَحَدَّثَنِيهِ زِيَادُ بْنُ أَيُّوبَ ‏.‏",
    "malay_translation": "Saya mendengar As-Sa'ib bin Yazid berkata: 'Pada zaman Rasulullah SAW, Sa' adalah bersamaan dengan satu Mudd dan satu pertiga Mudd yang kamu gunakan hari ini, dan Sa' hari ini telah menjadi besar.' (Sahih)\nAbu 'Abdur-Rahman (An-Nasa'i) berkata: Dan Ziyad bin Ayyub menceritakannya kepadaku."
  },
  {
    "id": 17261,
    "hadith_number": 2525,
    "tajuk_hadith": "Ukuran dan Timbangan: Madinah dan Mekah",
    "perawi_melayu": "Diriwayatkan daripada Ibnu 'Umar bahawa Nabi (ﷺ) bersabda:",
    "english_text": "\"The measure (to be used) is the measure of the people of Al-Madinah, and the weight (to be used) is the weight of the people of Makkah.\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ حَنْظَلَةَ، عَنْ طَاوُسٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْمِكْيَالُ مِكْيَالُ أَهْلِ الْمَدِينَةِ وَالْوَزْنُ وَزْنُ أَهْلِ مَكَّةَ ‏\"‏ ‏.‏",
    "malay_translation": "Ukuran yang digunakan adalah ukuran penduduk Al-Madinah, dan timbangan yang digunakan adalah timbangan penduduk Makkah."
  },
  {
    "id": 17262,
    "hadith_number": 2526,
    "tajuk_hadith": "Perintah Rasulullah SAW Tentang Zakat Fitrah",
    "perawi_melayu": "Daripada Ibnu 'Umar r.a.",
    "english_text": "the Messenger of Allah enjoined that Sadaqatul Fitr should be given before the people go out to pray. \n(One of the narratorsP: Ibn Bazi'said: \"Zakatul-Fitr.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْدَانَ بْنِ عِيسَى، قَالَ حَدَّثَنَا الْحَسَنُ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا مُوسَى، ح قَالَ وَأَنْبَأَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ، قَالَ حَدَّثَنَا الْفُضَيْلُ، قَالَ حَدَّثَنَا مُوسَى، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ بِصَدَقَةِ الْفِطْرِ أَنْ تُؤَدَّى قَبْلَ خُرُوجِ النَّاسِ إِلَى الصَّلاَةِ ‏.‏ قَالَ ابْنُ بَزِيعٍ بِزَكَاةِ الْفِطْرِ ‏.‏",
    "malay_translation": "Rasulullah SAW memerintahkan supaya Sadaqatul Fitr (Zakat Fitrah) diberikan sebelum orang ramai keluar untuk menunaikan solat. (Salah seorang perawi: Ibnu Bazi' berkata: \"Zakatul-Fitr.\")"
  },
  {
    "id": 17263,
    "hadith_number": 2527,
    "tajuk_hadith": "Arahan Nabi SAW kepada Mu'adh bin Jabal ke Yaman",
    "perawi_melayu": "Daripada Ibn 'Abbas bahawa Nabi SAW menghantar Mu'adh bin Jabal ke Yaman dan bersabda:",
    "english_text": "\"You are going to some people from among the people of the Book. Call them to bear witness that there is none worthy of worship except Allah and that I am the Messenger of Allah. If they obey you in that, then teach them that Allah has enjoined upon them five prayers every day and night. If they obey you in that, then teach them that Allah has enjoined upon them Sadaqah (Zakah) from their wealth, to be taken from their rich and given to their poor. If they obey you in that, then do not touch the most precious of their wealth, and fear the supplication of the one who has been wronged, for there is no barrier between it and Allah, the Mighty and Sublime.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا وَكِيعٌ، قَالَ حَدَّثَنَا زَكَرِيَّا بْنُ إِسْحَاقَ، - وَكَانَ ثِقَةً - عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ صَيْفِيٍّ، عَنْ أَبِي مَعْبَدٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَ مُعَاذَ بْنَ جَبَلٍ إِلَى الْيَمَنِ فَقَالَ ‏\n\"‏ إِنَّكَ تَأْتِي قَوْمًا أَهْلَ كِتَابٍ فَادْعُهُمْ إِلَى شَهَادَةِ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنِّي رَسُولُ اللَّهِ فَإِنْ هُمْ أَطَاعُوكَ فَأَعْلِمْهُمْ أَنَّ اللَّهَ عَزَّ وَجَلَّ افْتَرَضَ عَلَيْهِمْ خَمْسَ صَلَوَاتٍ فِي كُلِّ يَوْمٍ وَلَيْلَةٍ فَإِنْ هُمْ أَطَاعُوكَ فَأَعْلِمْهُمْ أَنَّ اللَّهَ عَزَّ وَجَلَّ قَدِ افْتَرَضَ عَلَيْهِمْ صَدَقَةً فِي أَمْوَالِهِمْ تُؤْخَذُ مِنْ أَغْنِيَائِهِمْ فَتُوضَعُ فِي فُقَرَائِهِمْ فَإِنْ هُمْ أَطَاعُوكَ لِذَلِكَ فَإِيَّاكَ وَكَرَائِمَ أَمْوَالِهِمْ وَاتَّقِ دَعْوَةَ الْمَظْلُومِ فَإِنَّهَا لَيْسَ بَيْنَهَا وَبَيْنَ اللَّهِ عَزَّ وَجَلَّ حِجَابٌ ‏\"‏ ‏.‏",
    "malay_translation": "“Sesungguhnya kamu akan pergi kepada kaum daripada Ahli Kitab. Serulah mereka untuk bersaksi bahawa tiada tuhan yang berhak disembah melainkan Allah dan sesungguhnya aku adalah utusan Allah. Jika mereka mentaati kamu dalam hal itu, maka ajarlah mereka bahawa Allah mewajibkan ke atas mereka solat lima waktu sehari semalam. Jika mereka mentaati kamu dalam hal itu, maka ajarlah mereka bahawa Allah mewajibkan ke atas mereka sedekah (Zakat) daripada harta mereka, diambil daripada orang kaya mereka dan diberikan kepada orang miskin mereka. Jika mereka mentaati kamu dalam hal itu, maka janganlah kamu mengambil harta mereka yang paling berharga, dan takutlah akan doa orang yang dizalimi, kerana sesungguhnya tiada hijab antara doa itu dengan Allah, Yang Maha Perkasa lagi Maha Agung.”"
  },
  {
    "id": 17264,
    "hadith_number": 2528,
    "tajuk_hadith": "Sedekah yang Diterima: Kisah Seorang Lelaki",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah ﷺ bersabda:",
    "english_text": "\"A man said\" 'I am going to give some charity.' So he went out with his charity and put it in the hand of a thief. The next morning they started talking about how charity had been given to a thief. Then he said: 'O Allah, to You be praise for the thief. I am going to give some charity.' So he went out with his charity and put it in the hand of a prostitute. The next morning they started talking about how charity had been given to a prostitute. He said: 'O Allah, to You be praise for the prostitute. I am going to give some charity. So he went out with his charity and put it in the hand of a rich man. The next morning they started talking about how charity had been given to a rich man. He said: 'O Allah, th You be praise for the prostitute, the thief and the rich man. 'Then the message came to him: As for your charity, it is accepted. As for the prostitute, perhaps it will keep her from committing Zina. As for the thief, perhaps it will stop him from stealing. And as for the rich man, perhaps he will learn a lesson, and will spend from that which Allah, the Mighty and Sublime, has given him.\"'",
    "arabic_text": "أَخْبَرَنَا عِمْرَانُ بْنُ بَكَّارٍ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ، قَالَ حَدَّثَنَا شُعَيْبٌ، قَالَ حَدَّثَنِي أَبُو الزِّنَادِ، مِمَّا حَدَّثَهُ عَبْدُ الرَّحْمَنِ الأَعْرَجُ، مِمَّا ذَكَرَ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يُحَدِّثُ بِهِ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏\n\"‏ قَالَ رَجُلٌ لأَتَصَدَّقَنَّ بِصَدَقَةٍ فَخَرَجَ بِصَدَقَتِهِ فَوَضَعَهَا فِي يَدِ سَارِقٍ فَأَصْبَحُوا يَتَحَدَّثُونَ تُصُدِّقَ عَلَى سَارِقٍ فَقَالَ اللَّهُمَّ لَكَ الْحَمْدُ عَلَى سَارِقٍ لأَتَصَدَّقَنَّ بِصَدَقَةٍ فَخَرَجَ بِصَدَقَتِهِ فَوَضَعَهَا فِي يَدِ زَانِيَةٍ فَأَصْبَحُوا يَتَحَدَّثُونَ تُصُدِّقَ اللَّيْلَةَ عَلَى زَانِيَةٍ فَقَالَ اللَّهُمَّ لَكَ الْحَمْدُ عَلَى زَانِيَةٍ لأَتَصَدَّقَنَّ بِصَدَقَةٍ فَخَرَجَ بِصَدَقَتِهِ فَوَضَعَهَا فِي يَدِ غَنِيٍّ فَأَصْبَحُوا يَتَحَدَّثُونَ تُصُدِّقَ عَلَى غَنِيٍّ قَالَ اللَّهُمَّ لَكَ الْحَمْدُ عَلَى زَانِيَةٍ وَعَلَى سَارِقٍ وَعَلَى غَنِيٍّ فَأُتِيَ فَقِيلَ لَهُ أَمَّا صَدَقَتُكَ فَقَدْ تُقُبِّلَتْ أَمَّا الزَّانِيَةُ فَلَعَلَّهَا أَنْ تَسْتَعِفَّ بِهِ مِنْ زِنَاهَا وَلَعَلَّ السَّارِقَ أَنْ يَسْتَعِفَّ بِهِ عَنْ سَرِقَتِهِ وَلَعَلَّ الْغَنِيَّ أَنْ يَعْتَبِرَ فَيُنْفِقَ مِمَّا أَعْطَاهُ اللَّهُ عَزَّ وَجَلَّ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki berkata, 'Aku akan bersedekah.' Lalu dia keluar dengan sedekahnya dan meletakkannya di tangan seorang pencuri. Keesokan paginya, orang-orang mula bercakap tentang bagaimana sedekah telah diberikan kepada seorang pencuri. Kemudian dia berkata, 'Ya Allah, bagi-Mu segala puji atas pencuri itu. Aku akan bersedekah lagi.' Lalu dia keluar dengan sedekahnya dan meletakkannya di tangan seorang pelacur. Keesokan paginya, orang-orang mula bercakap tentang bagaimana sedekah telah diberikan kepada seorang pelacur. Dia berkata, 'Ya Allah, bagi-Mu segala puji atas pelacur itu. Aku akan bersedekah lagi.' Lalu dia keluar dengan sedekahnya dan meletakkannya di tangan seorang kaya. Keesokan paginya, orang-orang mula bercakap tentang bagaimana sedekah telah diberikan kepada seorang kaya. Dia berkata, 'Ya Allah, bagi-Mu segala puji atas pelacur, pencuri, dan orang kaya itu.' Kemudian datanglah pesanan kepadanya: Adapun sedekahmu, ia diterima. Adapun pelacur itu, mungkin ia akan menjauhi zina. Adapun pencuri itu, mungkin ia akan berhenti daripada mencuri. Dan adapun orang kaya itu, mungkin ia akan mengambil pengajaran, dan akan membelanjakan daripada apa yang telah Allah, Yang Maha Perkasa dan Maha Agung, berikan kepadanya."
  },
  {
    "id": 17265,
    "hadith_number": 2529,
    "tajuk_hadith": "Allah Tidak Menerima Solat Tanpa Bersuci dan Sedekah yang Tidak Sah",
    "perawi_melayu": "Daripada Abu Al-Malih, daripada bapanya",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ مُحَمَّدٍ الذَّارِعُ، قَالَ حَدَّثَنَا يَزِيدُ، - وَهُوَ ابْنُ زُرَيْعٍ - قَالَ حَدَّثَنَا شُعْبَةُ، ‏.‏ قَالَ وَأَنْبَأَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا بِشْرٌ، - وَهُوَ ابْنُ الْمُفَضَّلِ - قَالَ حَدَّثَنَا شُعْبَةُ، - وَاللَّفْظُ لِبِشْرٍ - عَنْ قَتَادَةَ، عَنْ أَبِي الْمَلِيحِ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ لاَ يَقْبَلُ صَلاَةً بِغَيْرِ طُهُورٍ وَلاَ صَدَقَةً مِنْ غُلُولٍ ‏\"‏ ‏.‏",
    "malay_translation": "Saya mendengar Rasulullah SAW bersabda: 'Sesungguhnya Allah SWT tidak menerima solat tanpa bersuci dan tidak menerima sedekah daripada ghulul (pengkhianatan/kecurangan).'"
  },
  {
    "id": 17266,
    "hadith_number": 2530,
    "tajuk_hadith": "Ganjaran Sedekah yang Baik",
    "perawi_melayu": "Abu Hurairah berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ سَعِيدِ بْنِ يَسَارٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا تَصَدَّقَ أَحَدٌ بِصَدَقَةٍ مِنْ طَيِّبٍ وَلاَ يَقْبَلُ اللَّهُ عَزَّ وَجَلَّ إِلاَّ الطَّيِّبَ إِلاَّ أَخَذَهَا الرَّحْمَنُ عَزَّ وَجَلَّ بِيَمِينِهِ وَإِنْ كَانَتْ تَمْرَةً فَتَرْبُو فِي كَفِّ الرَّحْمَنِ حَتَّى تَكُونَ أَعْظَمَ مِنَ الْجَبَلِ كَمَا يُرَبِّي أَحَدُكُمْ فَلُوَّهُ أَوْ فَصِيلَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Tiada seorang pun yang bersedekah daripada sumber yang baik – dan Allah tidak menerima melainkan yang baik – melainkan Allah Yang Maha Pemurah akan mengambilnya dengan tangan kanan-Nya, walaupun ia hanya sebiji kurma, lalu ia akan berkembang di tangan Allah Yang Maha Pemurah sehingga menjadi lebih besar daripada gunung, sebagaimana salah seorang daripada kamu memelihara anak kuda atau anak untanya.\""
  },
  {
    "id": 17267,
    "hadith_number": 2531,
    "tajuk_hadith": "Amalan Terbaik dalam Islam",
    "perawi_melayu": "Daripada Abdullah bin Hubshi Al-Khath'ami bahawa Nabi ﷺ ditanya:",
    "english_text": "\"Which deed is best?\" He said: \"Faith in which there is no doubt, Jihad in which there is no stealing of the spoils of war, and Hjijatun Mabrurah.\" It was said: \"Which prayer is best? He said:\"That in which there is ling Qunut (standing).\" It was said: \"Which charity is best?\" He said: \"The poor's night.\" It was said: \"Which Hijrah (emigration) is best?\" He said: \"One who shuns (Hahara) that which Allah has forbidden.\" It was said: \"One who strives against the idolaters with his life and his wealth. \"It was said: \"Which death is best?\" He said: \"One who sheds his blood while his horse's feet are cut with swords.\"",
    "arabic_text": "أَخْبَرَنَا عَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْحَكَمِ، عَنْ حَجَّاجٍ، قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عُثْمَانُ بْنُ أَبِي سُلَيْمَانَ، عَنْ عَلِيٍّ الأَزْدِيِّ، عَنْ عُبَيْدِ بْنِ عُمَيْرٍ، عَنْ عَبْدِ اللَّهِ بْنِ حُبْشِيٍّ الْخَثْعَمِيِّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم سُئِلَ أَىُّ الأَعْمَالِ أَفْضَلُ قَالَ ‏\"‏ إِيمَانٌ لاَ شَكَّ فِيهِ وَجِهَادٌ لاَ غُلُولَ فِيهِ وَحَجَّةٌ مَبْرُورَةٌ ‏\"‏ ‏.‏ قِيلَ فَأَىُّ الصَّلاَةِ أَفْضَلُ قَالَ ‏\"‏ طُولُ الْقُنُوتِ ‏\"‏ ‏.‏ قِيلَ فَأَىُّ الصَّدَقَةِ أَفْضَلُ قَالَ ‏\"‏ جَهْدُ الْمُقِلِّ ‏\"‏ ‏.‏ قِيلَ فَأَىُّ الْهِجْرَةِ أَفْضَلُ قَالَ ‏\"‏ مَنْ هَجَرَ مَا حَرَّمَ اللَّهُ عَزَّ وَجَلَّ ‏\"‏ ‏.‏ قِيلَ فَأَىُّ الْجِهَادِ أَفْضَلُ قَالَ ‏\"‏ مَنْ جَاهَدَ الْمُشْرِكِينَ بِمَالِهِ وَنَفْسِهِ ‏\"‏ ‏.‏ قِيلَ فَأَىُّ الْقَتْلِ أَشْرَفُ قَالَ ‏\"‏ مَنْ أُهْرِيقَ دَمُهُ وَعُقِرَ جَوَادُهُ ‏\"‏ ‏.‏",
    "malay_translation": "“Amalan apakah yang paling utama?” Baginda bersabda: “Keimanan yang tiada syak padanya, Jihad yang tidak ada kecurian harta rampasan perang, dan Haji yang mabrur.” Dikatakan: “Solat apakah yang paling utama?” Baginda bersabda: “Yang panjang Qunut (berdiri).” Dikatakan: “Sedekah apakah yang paling utama?” Baginda bersabda: “Usaha orang miskin.” Dikatakan: “Hijrah (penghijrahan) apakah yang paling utama?” Baginda bersabda: “Orang yang meninggalkan (menjauhi) apa yang telah diharamkan oleh Allah.” Dikatakan: “Jihad apakah yang paling utama?” Baginda bersabda: “Orang yang berjihad melawan orang-orang musyrik dengan harta dan jiwanya.” Dikatakan: “Kematian apakah yang paling utama?” Baginda bersabda: “Orang yang tertumpah darahnya (syahid) semasa kaki kudanya terpotong dengan pedang.”"
  },
  {
    "id": 17268,
    "hadith_number": 2532,
    "tajuk_hadith": "Dirham yang Mengatasi Seratus Ribu Dirham",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah bahawa Rasulullah ﷺ bersabda:",
    "english_text": "\"A Dirham surpassed a hundred thousand Dirhams.\" They said: \"How?\" He said: \"A man had two Dirhams and gave one in charity, and another man went part of his wealth and took out a hundred thousand Dirhams and gave them in charity.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ عَجْلاَنَ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، وَالْقَعْقَاعِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ سَبَقَ دِرْهَمٌ مِائَةَ أَلْفِ دِرْهَمٍ ‏\"‏ ‏.‏ قَالُوا وَكَيْفَ قَالَ ‏\"‏ كَانَ لِرَجُلٍ دِرْهَمَانِ تَصَدَّقَ بِأَحَدِهِمَا وَانْطَلَقَ رَجُلٌ إِلَى عُرْضِ مَالِهِ فَأَخَذَ مِنْهُ مِائَةَ أَلْفِ دِرْهَمٍ فَتَصَدَّقَ بِهَا ‏\"‏ ‏.‏",
    "malay_translation": "Sabda Nabi ﷺ: \"Satu dirham mengatasi seratus ribu dirham.\" Para sahabat bertanya: \"Bagaimana (boleh terjadi demikian)?\" Baginda menjawab: \"Seorang lelaki mempunyai dua dirham dan dia bersedekah dengan satu daripadanya. Seorang lagi keluar dengan sebahagian daripada hartanya, lalu mengeluarkan seratus ribu dirham dan bersedekah dengannya.\""
  },
  {
    "id": 17269,
    "hadith_number": 2533,
    "tajuk_hadith": "Satu Dirham Lebih Baik Daripada Seratus Ribu Dirham",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "\"The Messenger of Allah said: 'A Dirham was better than a hundred thousand Dirhams.' They said: 'O Messenger of Allah, how?' He said: 'A man had two Dirhams and gave one in charity, and another man went to part of his wealth and took out a hundred thousand Dirhams and gave them in charity.\"'",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى، قَالَ حَدَّثَنَا ابْنُ عَجْلاَنَ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ سَبَقَ دِرْهَمٌ مِائَةَ أَلْفٍ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَكَيْفَ قَالَ ‏\"‏ رَجُلٌ لَهُ دِرْهَمَانِ فَأَخَذَ أَحَدَهُمَا فَتَصَدَّقَ بِهِ وَرَجُلٌ لَهُ مَالٌ كَثِيرٌ فَأَخَذَ مِنْ عُرْضِ مَالِهِ مِائَةَ أَلْفٍ فَتَصَدَّقَ بِهَا ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: 'Satu Dirham lebih baik daripada seratus ribu Dirham.' Mereka bertanya: 'Wahai Rasulullah, bagaimana?' Baginda bersabda: 'Seorang lelaki mempunyai dua Dirham lalu dia bersedekah dengan satu daripadanya, dan seorang lelaki yang lain mempunyai harta yang banyak lalu dia mengambil seratus ribu Dirham dari hartanya dan bersedekah dengannya.'"
  },
  {
    "id": 17270,
    "hadith_number": 2534,
    "tajuk_hadith": "Kisah Sedekah dari Usaha Sendiri",
    "perawi_melayu": "Daripada Abu Mas'ud, berkata:",
    "english_text": "\"The Messenger of Allah used to tell us to give in charity, and one of us could not find anything to give until he went to the market place and hired himself out to carry loads for people. Then he would bring a Mudd and give it to the Messenger of Allah. I know a man who has a hundred thousand now, but on that day he had (only) one Dirham.\"",
    "arabic_text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ، قَالَ أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى، عَنِ الْحُسَيْنِ، عَنْ مَنْصُورٍ، عَنْ شَقِيقٍ، عَنْ أَبِي مَسْعُودٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَأْمُرُنَا بِالصَّدَقَةِ فَمَا يَجِدُ أَحَدُنَا شَيْئًا يَتَصَدَّقُ بِهِ حَتَّى يَنْطَلِقَ إِلَى السُّوقِ فَيَحْمِلَ عَلَى ظَهْرِهِ فَيَجِيءَ بِالْمُدِّ فَيُعْطِيَهُ رَسُولَ اللَّهِ صلى الله عليه وسلم إِنِّي لأَعْرِفُ الْيَوْمَ رَجُلاً لَهُ مِائَةُ أَلْفٍ مَا كَانَ لَهُ يَوْمَئِذٍ دِرْهَمٌ ‏.‏",
    "malay_translation": "Rasulullah SAW selalu menyuruh kami bersedekah, dan ada di antara kami yang tidak menemui apa-apa untuk disedekahkan sehingga dia pergi ke pasar dan mengupah dirinya untuk membawa barang-barang untuk orang ramai. Kemudian dia akan membawa satu Mud (sukatan) dan memberikannya kepada Rasulullah SAW. Saya mengenali seorang lelaki yang kini mempunyai seratus ribu (mata wang), tetapi pada hari itu dia hanya mempunyai satu Dirham."
  },
  {
    "id": 17271,
    "hadith_number": 2535,
    "tajuk_hadith": "Balasan bagi Mereka yang Mencela Sedekah",
    "perawi_melayu": "Abu Mas'ud meriwayatkan:",
    "english_text": "\"When the Messenger of Allah commanded us to give in charity, Abu 'Aqil give half a Sa', and another man brought much more than that. The hypocrites said: 'Allah has no need of the charity of the former, and the latter only did it to show off. Then the following was revealed: 'Those who defame such of the believers who give charity voluntarily, and such who could not find to give charity except what is available to them.\"'",
    "arabic_text": "أَخْبَرَنَا بِشْرُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مَسْعُودٍ، قَالَ لَمَّا أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِالصَّدَقَةِ فَتَصَدَّقَ أَبُو عَقِيلٍ بِنِصْفِ صَاعٍ وَجَاءَ إِنْسَانٌ بِشَىْءٍ أَكْثَرَ مِنْهُ فَقَالَ الْمُنَافِقُونَ إِنَّ اللَّهَ عَزَّ وَجَلَّ لَغَنِيٌّ عَنْ صَدَقَةِ هَذَا وَمَا فَعَلَ هَذَا الآخَرُ إِلاَّ رِيَاءً فَنَزَلَتِ ‏{‏ الَّذِينَ يَلْمِزُونَ الْمُطَّوِّعِينَ مِنَ الْمُؤْمِنِينَ فِي الصَّدَقَاتِ وَالَّذِينَ لاَ يَجِدُونَ إِلاَّ جُهْدَهُمْ ‏}‏ ‏.‏",
    "malay_translation": "Ketika Rasulullah ﷺ memerintahkan kami untuk bersedekah, Abu 'Aqil memberikan sedekah sebanyak setengah Sa'. Seorang lelaki lain pula membawa lebih banyak daripada itu. Orang-orang munafik berkata: 'Allah tidak memerlukan sedekah orang yang pertama, dan yang kedua hanya melakukannya untuk menunjuk-nunjuk.' Kemudian turunlah firman Allah: 'Orang-orang yang mencela orang-orang mukmin yang memberikan sedekah secara sukarela dan orang-orang yang tidak mendapatkan (untuk disedekahkan) selain daripada kesanggupannya.' (Surah At-Taubah:79)"
  },
  {
    "id": 17272,
    "hadith_number": 2536,
    "tajuk_hadith": "Rezeki yang Halal dan Bersedekah",
    "perawi_melayu": "Sa'eed dan 'Urwah meriwayatkan bahawa mereka mendengar Hakim bin Hizam berkata:",
    "english_text": "\"I asked the Messenger of Allah and he gave me, then I asked him and he gave me, then I asked him and he gave me. Then he said: \"This wealth is attractive and sweet. Whoever takes it without insisting, it will be blessed for him, and whoever takes it with avarice, it will not be blessed for him. He is like one who eats and is not satisfied. And the upper hand is better than the lower hand.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَعِيدٌ، وَعُرْوَةُ، سَمِعَا حَكِيمَ بْنَ حِزَامٍ، يَقُولُ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَعْطَانِي ثُمَّ سَأَلْتُهُ فَأَعْطَانِي ثُمَّ سَأَلْتُهُ فَأَعْطَانِي ثُمَّ قَالَ ‏\n\"‏ إِنَّ هَذَا الْمَالَ خَضِرَةٌ حُلْوَةٌ فَمَنْ أَخَذَهُ بِطِيبِ نَفْسٍ بُورِكَ لَهُ فِيهِ وَمَنْ أَخَذَهُ بِإِشْرَافِ نَفْسٍ لَمْ يُبَارَكْ لَهُ فِيهِ وَكَانَ كَالَّذِي يَأْكُلُ وَلاَ يَشْبَعُ وَالْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى ‏\"‏ ‏.‏",
    "malay_translation": "Aku bertanya kepada Rasulullah ﷺ dan baginda memberi kepadaku, kemudian aku bertanya lagi dan baginda memberi kepadaku, kemudian aku bertanya lagi dan baginda memberi kepadaku. Kemudian baginda bersabda: \"Sesungguhnya harta ini adalah menarik dan manis. Sesiapa yang mengambilnya dengan hati yang baik, maka diberkati baginya, dan sesiapa yang mengambilnya dengan tamak, maka tidak diberkati baginya. Dia seperti orang yang makan tetapi tidak kenyang. Dan tangan yang memberi adalah lebih baik daripada tangan yang meminta.\""
  },
  {
    "id": 17273,
    "hadith_number": 2537,
    "tajuk_hadith": "Kelebihan Tangan Pemberi dan Tanggungjawab Terhadap Keluarga",
    "perawi_melayu": "Tariq Al-Muharibi",
    "english_text": "\"Not Available\"",
    "arabic_text": "أَخْبَرَنَا يُوسُفُ بْنُ عِيسَى، قَالَ أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى، قَالَ حَدَّثَنَا يَزِيدُ، - وَهُوَ ابْنُ زِيَادِ بْنِ أَبِي الْجَعْدِ - عَنْ جَامِعِ بْنِ شَدَّادٍ، عَنْ طَارِقٍ الْمُحَارِبِيِّ، قَالَ قَدِمْنَا الْمَدِينَةَ فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَائِمٌ عَلَى الْمِنْبَرِ يَخْطُبُ النَّاسَ وَهُوَ يَقُولُ ‏\n\"‏ يَدُ الْمُعْطِي الْعُلْيَا وَابْدَأْ بِمَنْ تَعُولُ أُمَّكَ وَأَبَاكَ وَأُخْتَكَ وَأَخَاكَ ثُمَّ أَدْنَاكَ أَدْنَاكَ ‏\"‏ ‏.‏ مُخْتَصَرٌ ‏.‏",
    "malay_translation": "Kami tiba di Madinah dan Rasulullah ﷺ berdiri di atas mimbar berkhutbah kepada orang ramai, baginda bersabda: 'Tangan yang memberi adalah tangan yang di atas. Mulakan dengan mereka yang menjadi tanggungjawab kamu; ibumu, ayahmu, saudaramu perempuan, saudaramu lelaki, kemudian orang yang terdekat, dan orang yang terdekat.'"
  },
  {
    "id": 17274,
    "hadith_number": 2538,
    "tajuk_hadith": "Keutamaan Memberi Sedekah dan Menghindari Meminta-minta",
    "perawi_melayu": "Daripada Abdullah bin 'Umar:",
    "english_text": "the Messenger of Allah said, when mentioning charity and those who refrain from asking. \"The upper hand is better than the lower hand; the upper hand is that which gives and the lower hand is that which asks.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ وَهُوَ يَذْكُرُ الصَّدَقَةَ وَالتَّعَفُّفَ عَنِ الْمَسْأَلَةِ ‏\n\"‏ الْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى وَالْيَدُ الْعُلْيَا الْمُنْفِقَةُ وَالْيَدُ السُّفْلَى السَّائِلَةُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda ketika menyebut tentang sedekah dan mereka yang menjauhi meminta-minta: \"Tangan yang di atas (memberi) lebih baik daripada tangan yang di bawah (meminta); tangan yang di atas ialah yang memberi dan tangan yang di bawah ialah yang meminta.\""
  },
  {
    "id": 17275,
    "hadith_number": 2539,
    "tajuk_hadith": "Sedekah Terbaik dan Kelebihan Tangan yang Memberi",
    "perawi_melayu": "Daripada Abu Hurairah bahawa Rasulullah ﷺ bersabda:",
    "english_text": "\"The best of charity is that which is given when you are self-sufficient, and the upper hand is better than the lower hand, and start with those for whom you are responsible.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا بَكْرٌ، عَنِ ابْنِ عَجْلاَنَ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ خَيْرُ الصَّدَقَةِ مَا كَانَ عَنْ ظَهْرِ غِنًى وَالْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى وَابْدَأْ بِمَنْ تَعُولُ ‏\"‏ ‏.‏",
    "malay_translation": "Sebaik-baik sedekah ialah sedekah yang diberikan ketika kamu berkemampuan, dan tangan yang di atas (memberi) adalah lebih baik daripada tangan yang di bawah (menerima), dan mulailah dengan orang yang menjadi tanggungjawab kamu."
  },
  {
    "id": 17276,
    "hadith_number": 2540,
    "tajuk_hadith": "Utamakan Sedekah untuk Diri, Keluarga dan Pembantu",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "\"The Messenger of Allah said: 'Give charity.' A man said: 'O Messenger of Allah, I have a Dinar.' He said: 'Spend it on yourself.' He said: 'I have another.' He said: 'Spend it on your wife.' He said: 'I have another.' He said: 'Spend it on your son.' He said: 'I have another.' He said: 'Spend it on your servant.' He said: 'I have another.' He said: 'You know best (what to do with it).\"'",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا يَحْيَى، عَنِ ابْنِ عَجْلاَنَ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تَصَدَّقُوا ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ عِنْدِي دِينَارٌ ‏.‏ قَالَ ‏\"‏ تَصَدَّقْ بِهِ عَلَى نَفْسِكَ ‏\"‏ ‏.‏ قَالَ عِنْدِي آخَرُ ‏.‏ قَالَ ‏\"‏ تَصَدَّقْ بِهِ عَلَى زَوْجَتِكَ ‏\"‏ ‏.‏ قَالَ عِنْدِي آخَرُ ‏.‏ قَالَ ‏\"‏ تَصَدَّقْ بِهِ عَلَى وَلَدِكَ ‏\"‏ ‏.‏ قَالَ عِنْدِي آخَرُ ‏.‏ قَالَ ‏\"‏ تَصَدَّقْ بِهِ عَلَى خَادِمِكَ ‏\"‏ ‏.‏ قَالَ عِنْدِي آخَرُ ‏.‏ قَالَ ‏\"‏ أَنْتَ أَبْصَرُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: 'Bersedekahlah.' Seorang lelaki berkata: 'Wahai Rasulullah, saya ada satu Dinar.' Baginda bersabda: 'Belanjakanlah untuk diri kamu.' Lelaki itu berkata: 'Saya ada lagi.' Baginda bersabda: 'Belanjakanlah untuk isterimu.' Lelaki itu berkata: 'Saya ada lagi.' Baginda bersabda: 'Belanjakanlah untuk anakmu.' Lelaki itu berkata: 'Saya ada lagi.' Baginda bersabda: 'Belanjakanlah untuk pembantumu.' Lelaki itu berkata: 'Saya ada lagi.' Baginda bersabda: 'Kamu lebih mengetahui (apa yang perlu kamu lakukan dengannya).' "
  },
  {
    "id": 17277,
    "hadith_number": 2541,
    "tajuk_hadith": "Anjuran Bersedekah dan Pelajaran daripada Tindakan Seorang Lelaki",
    "perawi_melayu": "Diriwayatkan daripada Abu Sa'eed bahawa:",
    "english_text": "a man entered the Msjid on a Friday when the Messenger of Allah was delivering the Khutbah, and he said: \"Pray two Rak'ahs.\" Then he came on the following Friday, when the Prophet was delivering the Khutbah and he said: \"Pray two Rak'ahs.\" Then he came on the third Friday, when the Prophet was delivering Khutbah and he said: \"Pray two Rak'ahs.\" Then he said: \"Give in charity.\"  So they gave in charity, and he gave him (that man) two garments. Then he said: \"Give in charity\" and (that man) threw one of his two garments. The Messenger of Allah said: \"Have you not seen this man? He entered the Masjid in scruffy clothes and I hoped that you would notice him, and give charity to him, but you did not do that, So I said, 'Give in charity.' You gave in charity, and I gave him two garments, then I said; 'Give in charity' and he threw one of his two garments. Take your garment.\" And he rebuked him.",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا ابْنُ عَجْلاَنَ، عَنْ عِيَاضٍ، عَنْ أَبِي سَعِيدٍ، أَنَّ رَجُلاً، دَخَلَ الْمَسْجِدَ يَوْمَ الْجُمُعَةِ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَخْطُبُ فَقَالَ ‏\"‏ صَلِّ رَكْعَتَيْنِ ‏\"‏ ‏.‏ ثُمَّ جَاءَ الْجُمُعَةَ الثَّانِيَةَ وَالنَّبِيُّ صلى الله عليه وسلم يَخْطُبُ فَقَالَ ‏\"‏ صَلِّ رَكْعَتَيْنِ ‏\"‏ ‏.‏ ثُمَّ جَاءَ الْجُمُعَةَ الثَّالِثَةَ فَقَالَ ‏\"‏ صَلِّ رَكْعَتَيْنِ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ تَصَدَّقُوا ‏\"‏ ‏.‏ فَتَصَدَّقُوا فَأَعْطَاهُ ثَوْبَيْنِ ثُمَّ قَالَ ‏\"‏ تَصَدَّقُوا ‏\"‏ ‏.‏ فَطَرَحَ أَحَدَ ثَوْبَيْهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَلَمْ تَرَوْا إِلَى هَذَا إِنَّهُ دَخَلَ الْمَسْجِدَ بِهَيْئَةٍ بَذَّةٍ فَرَجَوْتُ أَنْ تَفْطُنُوا لَهُ فَتَصَدَّقُوا عَلَيْهِ فَلَمْ تَفْعَلُوا فَقُلْتُ تَصَدَّقُوا ‏.‏ فَتَصَدَّقْتُمْ فَأَعْطَيْتُهُ ثَوْبَيْنِ ثُمَّ قُلْتُ تَصَدَّقُوا ‏.‏ فَطَرَحَ أَحَدَ ثَوْبَيْهِ خُذْ ثَوْبَكَ ‏\"‏ ‏.‏ وَانْتَهَرَهُ ‏.‏",
    "malay_translation": "Seorang lelaki masuk ke dalam Masjid pada hari Jumaat ketika Rasulullah s.a.w sedang menyampaikan khutbah. Baginda berkata: \"Solatlah dua rakaat.\" Kemudian dia datang pada Jumaat berikutnya, ketika Nabi s.a.w menyampaikan khutbah, dan Baginda berkata: \"Solatlah dua rakaat.\" Kemudian dia datang pada Jumaat ketiga, ketika Nabi s.a.w menyampaikan khutbah, dan Baginda berkata: \"Solatlah dua rakaat.\" Kemudian Baginda bersabda: \"Bersedekahlah.\" Lalu mereka bersedekah, dan Baginda memberi lelaki itu dua helai pakaian. Kemudian Baginda bersabda: \"Bersedekahlah\" dan lelaki itu membuang salah satu daripada dua helai pakaiannya. Rasulullah s.a.w bersabda: \"Tidakkah kamu melihat lelaki ini? Dia masuk ke dalam Masjid dengan pakaian yang lusuh, dan aku berharap kamu akan menyedarinya, dan bersedekah kepadanya, tetapi kamu tidak melakukannya, jadi aku berkata, 'Bersedekahlah.' Kamu bersedekah, dan aku memberinya dua helai pakaian, kemudian aku berkata; 'Bersedekahlah' dan dia membuang salah satu daripada dua helai pakaiannya. Ambillah pakaianmu.\" Dan Baginda menegurnya."
  },
  {
    "id": 17278,
    "hadith_number": 2542,
    "tajuk_hadith": "Ganjaran Bersama dalam Memberi Sedekah",
    "perawi_melayu": "Diriwayatkan oleh 'Umair, hamba sahaya yang dibebaskan",
    "english_text": "'Umair, the freed slave of commanded me to cut up some meat, then a poor man came so I gave him some. When my master fund out about that, he beat me, so I went to the Messenger of Allah and he came to him and said: 'Do not beat him.' He said: 'He gave away my food without me telling him to.' He said:  'The reward will be shared between you both.'",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا حَاتِمٌ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، قَالَ سَمِعْتُ عُمَيْرًا، مَوْلَى آبِي اللَّحْمِ قَالَ أَمَرَنِي مَوْلاَىَ أَنْ أُقَدِّدَ، لَحْمًا فَجَاءَ مِسْكِينٌ فَأَطْعَمْتُهُ مِنْهُ فَعَلِمَ بِذَلِكَ مَوْلاَىَ فَضَرَبَنِي فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَدَعَاهُ فَقَالَ ‏\"‏ لِمَ ضَرَبْتَهُ ‏\"‏ ‏.‏ فَقَالَ يُطْعِمُ طَعَامِي بِغَيْرِ أَنْ آمُرَهُ وَقَالَ مَرَّةً أُخْرَى بِغَيْرِ أَمْرِي قَالَ ‏\"‏ الأَجْرُ بَيْنَكُمَا ‏\"‏ ‏.‏",
    "malay_translation": "'Umair, hamba sahaya yang telah dibebaskan mengarahkan saya memotong sedikit daging, kemudian datang seorang miskin, jadi saya memberinya sedikit. Apabila tuan saya mengetahui hal itu, dia memukul saya, jadi saya pergi kepada Rasulullah ﷺ, lalu dia datang kepadanya dan berkata: 'Jangan pukul dia.' Tuan itu berkata: 'Dia telah memberikan makanan saya tanpa saya menyuruhnya.' Baginda bersabda: 'Ganjaran akan dikongsi antara kamu berdua.'"
  },
  {
    "id": 17279,
    "hadith_number": 2543,
    "tajuk_hadith": "Setiap Muslim Wajib Bersedekah",
    "perawi_melayu": "Diriwayatkan dari Abu Musa bahawa Nabi ﷺ bersabda:",
    "english_text": "\"Every Muslim must give charity.\" It was said: \"What if he cannot find (anything to give)? \"He said: \"Let him work with his hands and benefit himself and give in charity.\" It was said: \"What if he cannot do that?\" He said: \"Let him help someone who is in desperate need.\" It was said: \"What if he cannot do that?\" He said: \"Let him enjoin good.\" It was said: \"What if he cannot do that? He said: \"Let him refrain from doing evil, for that is an act of charity.\"",
    "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي ابْنُ أَبِي بُرْدَةَ، قَالَ سَمِعْتُ أَبِي يُحَدِّثُ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ عَلَى كُلِّ مُسْلِمٍ صَدَقَةٌ ‏\"‏ ‏.‏ قِيلَ أَرَأَيْتَ إِنْ لَمْ يَجِدْهَا قَالَ ‏\"‏ يَعْتَمِلُ بِيَدِهِ فَيَنْفَعُ نَفْسَهُ وَيَتَصَدَّقُ ‏\"‏ ‏.‏ قِيلَ أَرَأَيْتَ إِنْ لَمْ يَفْعَلْ قَالَ ‏\"‏ يُعِينُ ذَا الْحَاجَةِ الْمَلْهُوفَ ‏\"‏ ‏.‏ قِيلَ فَإِنْ لَمْ يَفْعَلْ قَالَ ‏\"‏ يَأْمُرُ بِالْخَيْرِ ‏\"‏ ‏.‏ قِيلَ أَرَأَيْتَ إِنْ لَمْ يَفْعَلْ قَالَ ‏\"‏ يُمْسِكُ عَنِ الشَّرِّ فَإِنَّهَا صَدَقَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "“Setiap Muslim wajib bersedekah.” Dikatakan: “Bagaimana jika dia tidak menemui (sesuatu untuk diberikan)?” Baginda bersabda: “Hendaklah dia bekerja dengan tangannya dan memberi manfaat kepada dirinya sendiri dan bersedekah.” Dikatakan: “Bagaimana jika dia tidak dapat berbuat demikian?” Baginda bersabda: “Hendaklah dia menolong seseorang yang sangat memerlukan.” Dikatakan: “Bagaimana jika dia tidak dapat berbuat demikian?” Baginda bersabda: “Hendaklah dia menyuruh kepada kebaikan.” Dikatakan: “Bagaimana jika dia tidak dapat berbuat demikian? Baginda bersabda: “Hendaklah dia menahan diri daripada melakukan kejahatan, kerana itu adalah satu sedekah."
  },
  {
    "id": 17280,
    "hadith_number": 2544,
    "tajuk_hadith": "Ganjaran Sedekah Isteri dan Suami",
    "perawi_melayu": "Daripada 'Aishah bahawa Nabi SAW bersabda:",
    "english_text": "\"When a woman give charity from her husband's house, she will have a reward, and her husband will have a similar reward, and the storekeeper will have a similar reward, without the reward of any of them detracting from the reward of the others in the slightest. The husband will be rewarded for what he earned and she will be rewarded for what she spent.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، قَالَ سَمِعْتُ أَبَا وَائِلٍ، يُحَدِّثُ عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا تَصَدَّقَتِ الْمَرْأَةُ مِنْ بَيْتِ زَوْجِهَا كَانَ لَهَا أَجْرٌ وَلِلزَّوْجِ مِثْلُ ذَلِكَ وَلِلْخَازِنِ مِثْلُ ذَلِكَ وَلاَ يَنْقُصُ كُلُّ وَاحِدٍ مِنْهُمَا مِنْ أَجْرِ صَاحِبِهِ شَيْئًا لِلزَّوْجِ بِمَا كَسَبَ وَلَهَا بِمَا أَنْفَقَتْ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila seorang wanita bersedekah dari rumah suaminya, maka baginya pahala, dan bagi suaminya juga pahala yang serupa, dan bagi penjaga harta itu juga pahala yang serupa, tanpa mengurangkan pahala masing-masing sedikit pun. Suami diberi pahala atas apa yang telah diusahakannya, dan isteri diberi pahala atas apa yang telah disedekahkannya."
  },
  {
    "id": 17281,
    "hadith_number": 2545,
    "tajuk_hadith": "Wanita Tidak Boleh Memberi Kecuali Dengan Kebenaran Suami",
    "perawi_melayu": "Abdullah bin 'Amr",
    "english_text": "\"Ketika Rasulullah SAW menakluki Makkah, baginda berdiri berkhutbah kepada orang ramai dan bersabda dalam khutbahnya: 'Tidak halal bagi seorang wanita memberi sesuatu tanpa keizinan suaminya.'\" (Diriwayatkan secara ringkas).",
    "arabic_text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، أَنَّ أَبَاهُ، حَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ لَمَّا فَتَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَكَّةَ قَامَ خَطِيبًا فَقَالَ فِي خُطْبَتِهِ ‏\n\"‏ لاَ يَجُوزُ لاِمْرَأَةٍ عَطِيَّةٌ إِلاَّ بِإِذْنِ زَوْجِهَا ‏\"‏ ‏.‏ مُخْتَصَرٌ ‏.‏",
    "malay_translation": "Ketika Rasulullah SAW menakluki Makkah, baginda berdiri berkhutbah kepada orang ramai dan bersabda dalam khutbahnya: 'Tidak halal bagi seorang wanita memberi sesuatu tanpa keizinan suaminya.' (Diriwayatkan secara ringkas)."
  },
  {
    "id": 17282,
    "hadith_number": 2546,
    "tajuk_hadith": "Siapakah yang Akan Mendahului Rasulullah SAW (dalam Kematian)?",
    "perawi_melayu": "Daripada 'Aishah, رضي الله عنها, bahawa isteri-isteri Nabi ﷺ berkumpul di sekelilingnya dan berkata:",
    "english_text": "\"Not Available\"",
    "arabic_text": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ، قَالَ أَنْبَأَنَا أَبُو عَوَانَةَ، عَنْ فِرَاسٍ، عَنْ عَامِرٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، رضى الله عنها أَنَّ أَزْوَاجَ، النَّبِيِّ صلى الله عليه وسلم اجْتَمَعْنَ عِنْدَهُ فَقُلْنَ أَيَّتُنَا بِكَ أَسْرَعُ لُحُوقًا فَقَالَ ‏\n\"‏ أَطْوَلُكُنَّ يَدًا ‏\"‏ ‏.‏ فَأَخَذْنَ قَصَبَةً فَجَعَلْنَ يَذْرَعْنَهَا فَكَانَتْ سَوْدَةُ أَسْرَعَهُنَّ بِهِ لُحُوقًا فَكَانَتْ أَطْوَلَهُنَّ يَدًا فَكَانَ ذَلِكَ مِنْ كَثْرَةِ الصَّدَقَةِ ‏.‏",
    "malay_translation": "Diriwayatkan daripada 'Aishah رضي الله عنها, bahawa isteri-isteri Nabi ﷺ berkumpul di sekelilingnya dan berkata: \"Siapakah di antara kami yang akan mendahului engkau (dalam kematian)?\" Baginda bersabda: \"Orang yang paling panjang tangannya di antara kamu.\" Mereka mengambil sebatang kayu dan mula mengukur tangan mereka. Tetapi Sawdah adalah orang yang pertama mendahului baginda. Dia adalah orang yang paling panjang tangannya, kerana dia banyak bersedekah."
  },
  {
    "id": 17283,
    "hadith_number": 2547,
    "tajuk_hadith": "Sedekah Terbaik Ketika Sihat & Bimbang Kemiskinan",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "\"A man said: 'O Messenger of Allah, which kind of charity is best? He said: 'Giving charity when you are in good health, and feeling stingy, hoping for a long life and fearing poverty.'\"",
    "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا وَكِيعٌ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَىُّ الصَّدَقَةِ أَفْضَلُ قَالَ ‏\n\"‏ أَنْ تَصَدَّقَ وَأَنْتَ صَحِيحٌ شَحِيحٌ تَأْمُلُ الْعَيْشَ وَتَخْشَى الْفَقْرَ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki bertanya: 'Wahai Rasulullah, sedekah apakah yang paling utama?' Baginda bersabda: 'Sedekah ketika kamu sihat lagi bakhil, mengharapkan kehidupan yang panjang dan takut miskin.'"
  },
  {
    "id": 17284,
    "hadith_number": 2548,
    "tajuk_hadith": "Sedekah Terbaik dan Kelebihan Tangan di Atas",
    "perawi_melayu": "Hakim bin Hizam berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ، قَالَ سَمِعْتُ مُوسَى بْنَ طَلْحَةَ، أَنَّ حَكِيمَ بْنَ حِزَامٍ، حَدَّثَهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَفْضَلُ الصَّدَقَةِ مَا كَانَ عَنْ ظَهْرِ غِنًى وَالْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى وَابْدَأْ بِمَنْ تَعُولُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Sedekah yang paling utama adalah yang diberikan ketika kamu kaya, dan tangan yang di atas lebih baik daripada tangan yang di bawah, dan mulailah (memberi) kepada orang yang menjadi tanggungjawabmu.\""
  },
  {
    "id": 17285,
    "hadith_number": 2549,
    "tajuk_hadith": "Sedekah Terbaik: Daripada Keperluan Diri dan Keluarga",
    "perawi_melayu": "Abu Hurairah berkata:",
    "english_text": "The Messenger of Allah said: \"The best of charity is that which is given when you are self-sufficient, and start with those for whom you are responsible.\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ سَوَّادِ بْنِ الأَسْوَدِ بْنِ عَمْرٍو، عَنِ ابْنِ وَهْبٍ، قَالَ أَنْبَأَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ خَيْرُ الصَّدَقَةِ مَا كَانَ عَنْ ظَهْرِ غِنًى وَابْدَأْ بِمَنْ تَعُولُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Sebaik-baik sedekah adalah yang diberikan ketika kamu berkemampuan, dan mulailah dengan orang-orang yang menjadi tanggungjawabmu.\""
  },
  {
    "id": 17286,
    "hadith_number": 2550,
    "tajuk_hadith": "Menafkahkan Keluarga adalah Sedekah",
    "perawi_melayu": "Diriwayatkan daripada Abu Mas'ud bahawa Nabi SAW bersabda:",
    "english_text": "\"When a man spends on his family, seeking reward for that, that is an act of charity on his part.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ يَزِيدَ الأَنْصَارِيَّ، يُحَدِّثُ عَنْ أَبِي مَسْعُودٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا أَنْفَقَ الرَّجُلُ عَلَى أَهْلِهِ وَهُوَ يَحْتَسِبُهَا كَانَتْ لَهُ صَدَقَةً ‏\"‏ ‏.‏",
    "malay_translation": "Apabila seorang lelaki membelanjakan hartanya untuk keluarganya, dengan mengharapkan pahala daripada Allah, maka itu adalah sedekah baginya."
  },
  {
    "id": 17287,
    "hadith_number": 2551,
    "tajuk_hadith": "Keutamaan Sedekah dan Pengurusan Harta",
    "perawi_melayu": "Diriwayatkan bahawa Jabir berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ أَعْتَقَ رَجُلٌ مِنْ بَنِي عُذْرَةَ عَبْدًا لَهُ عَنْ دُبُرٍ، فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَلَكَ مَالٌ غَيْرُهُ ‏\"‏ ‏.‏ قَالَ لاَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ يَشْتَرِيهِ مِنِّي ‏\"‏ ‏.‏ فَاشْتَرَاهُ نُعَيْمُ بْنُ عَبْدِ اللَّهِ الْعَدَوِيُّ بِثَمَانِمِائَةِ دِرْهَمٍ فَجَاءَ بِهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَدَفَعَهَا إِلَيْهِ ثُمَّ قَالَ ‏\"‏ ابْدَأْ بِنَفْسِكَ فَتَصَدَّقْ عَلَيْهَا فَإِنْ فَضَلَ شَىْءٌ فَلأَهْلِكَ فَإِنْ فَضَلَ شَىْءٌ عَنْ أَهْلِكَ فَلِذِي قَرَابَتِكَ فَإِنْ فَضَلَ عَنْ ذِي قَرَابَتِكَ شَىْءٌ فَهَكَذَا وَهَكَذَا يَقُولُ بَيْنَ يَدَيْكَ وَعَنْ يَمِينِكَ وَعَنْ شِمَالِكَ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki dari Bani 'Udhrah mengisytiharkan bahawa seorang hambanya akan menjadi merdeka selepas dia meninggal dunia. Berita itu sampai kepada Rasulullah ﷺ lalu baginda bersabda: \"Adakah kamu mempunyai harta selain daripadanya?\" Lelaki itu berkata: \"Tidak.\" Rasulullah ﷺ bersabda: \"Siapa yang akan membelinya daripada aku?\" Nu'aim bin 'Abdullah Al-Adawi membelinya dengan lapan ratus Dirham. Rasulullah ﷺ membawa wang itu dan memberikannya kepada lelaki tersebut, kemudian baginda bersabda: \"Mulakan dengan dirimu sendiri dan jika ada lebihan, berikan kepada keluargamu. Jika ada lebihan selepas keluargamu (telah diurus), berikan kepada kaum kerabatmu. Jika ada lebihan selepas kaum kerabatmu (telah diurus), maka (berikan) kepada orang sebegini dan sebegini, sambil berkata: 'Di hadapanmu, di sebelah kananmu dan di sebelah kirimu.'\""
  },
  {
    "id": 17288,
    "hadith_number": 2552,
    "tajuk_hadith": "Perumpamaan Orang yang Membelanjakan Harta dan Orang yang Bakhil",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah",
    "english_text": "The Messenger of Allah said: \"The parable of the one who spends and give in charity, and the one who is miserly, is that of two men wearing coats of mail, with their hands pressed closely to their breasts and their collarbones. When the one who spends wants to give charity, the (coat of mail) expends so much that it covers his fingertips and obliterates his traces. But when the miser wants to give, the (coat of mail) contracts and every ring grips the place where it is, and his hands are tied up to his collarbone.\"'\nAbu Hurairah says: 'I swear that he saw the Messenger trying to expand it but it did not.\" Tawus said: \"I heard Abu Hurairah said: \"I heard Abu Hurairah illustrating with his hand trying to expand it but it did not.\" (Sahaih)",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ جُرَيْجٍ، عَنِ الْحَسَنِ بْنِ مُسْلِمٍ، عَنْ طَاوُسٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، ثُمَّ قَالَ حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ مَثَلَ الْمُنْفِقِ الْمُتَصَدِّقِ وَالْبَخِيلِ كَمَثَلِ رَجُلَيْنِ عَلَيْهِمَا جُبَّتَانِ أَوْ جُنَّتَانِ مِنْ حَدِيدٍ مِنْ لَدُنْ ثُدِيِّهِمَا إِلَى تَرَاقِيهِمَا فَإِذَا أَرَادَ الْمُنْفِقُ أَنْ يُنْفِقَ اتَّسَعَتْ عَلَيْهِ الدِّرْعُ أَوْ مَرَّتْ حَتَّى تُجِنَّ بَنَانَهُ وَتَعْفُوَ أَثَرَهُ وَإِذَا أَرَادَ الْبَخِيلُ أَنْ يُنْفِقَ قَلَصَتْ وَلَزِمَتْ كُلُّ حَلْقَةٍ مَوْضِعَهَا حَتَّى أَخَذَتْهُ بِتَرْقُوَتِهِ أَوْ بِرَقَبَتِهِ ‏\"‏ ‏.‏ يَقُولُ أَبُو هُرَيْرَةَ أَشْهَدُ أَنَّهُ رَأَى رَسُولَ اللَّهِ صلى الله عليه وسلم يُوَسِّعُهَا فَلاَ تَتَّسِعُ ‏.‏ قَالَ طَاوُسٌ سَمِعْتُ أَبَا هُرَيْرَةَ يُشِيرُ بِيَدِهِ وَهُوَ يُوَسِّعُهَا وَلاَ تَتَوَسَّعُ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Perumpamaan orang yang membelanjakan hartanya dan bersedekah, dan orang yang bakhil (kedekut), adalah seperti dua orang lelaki yang memakai baju besi, dengan tangan mereka rapat ke dada dan tulang selangka mereka. Apabila orang yang membelanjakan harta ingin bersedekah, (baju besi) itu mengembang sehingga menutupi hujung jari dan menghilangkan jejaknya. Tetapi apabila orang yang bakhil ingin memberi, (baju besi) itu mengecut dan setiap gelang memegang tempatnya, dan tangannya terikat sehingga tulang selangkanya.\" Abu Hurairah berkata: 'Aku bersumpah bahawa dia melihat Rasulullah ﷺ berusaha mengembangkannya tetapi ia tidak mengembang.' Tawus berkata: \"Aku mendengar Abu Hurairah berkata: \"Aku mendengar Abu Hurairah menggambarkan dengan tangannya berusaha mengembangkannya tetapi ia tidak mengembang.\" (Sahih)"
  },
  {
    "id": 17289,
    "hadith_number": 2553,
    "tajuk_hadith": "Perumpamaan Orang Kedekut dan Orang yang Bersedekah",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah bahawa Nabi ﷺ bersabda:",
    "english_text": "\"The parable of the miser and the one who gives in charity is that of two men wearing coats of mail with their hands tied to their collarbones. Every time the one who gives thinks of giving in charity, the (coat of mail) expands until it obliterates his traces, and every time the miser thinks of giving charity, every circle (of the coat of mail) contracts and sticks to him, and his hand is tied up to his collarbones.\" I heard the Messenger of Allah say: \"He tries to expand it, but he cannot.\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا عَفَّانُ، قَالَ حَدَّثَنَا وُهَيْبٌ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَثَلُ الْبَخِيلِ وَالْمُتَصَدِّقِ مَثَلُ رَجُلَيْنِ عَلَيْهِمَا جُنَّتَانِ مِنْ حَدِيدٍ قَدِ اضْطَرَّتْ أَيْدِيَهُمَا إِلَى تَرَاقِيهِمَا فَكُلَّمَا هَمَّ الْمُتَصَدِّقُ بِصَدَقَةٍ اتَّسَعَتْ عَلَيْهِ حَتَّى تُعَفِّيَ أَثَرَهُ وَكُلَّمَا هَمَّ الْبَخِيلُ بِصَدَقَةٍ تَقَبَّضَتْ كُلُّ حَلْقَةٍ إِلَى صَاحِبَتِهَا وَتَقَلَّصَتْ عَلَيْهِ وَانْضَمَّتْ يَدَاهُ إِلَى تَرَاقِيهِ ‏\"‏ ‏.‏ وَسَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ فَيَجْتَهِدُ أَنْ يُوَسِّعَهَا فَلاَ تَتَّسِعُ ‏\"‏ ‏.‏",
    "malay_translation": "Sabda Nabi ﷺ: \"Perumpamaan orang yang kedekut dan orang yang bersedekah adalah seperti dua orang lelaki yang memakai baju besi dengan tangan mereka terikat pada tulang selangka mereka. Setiap kali orang yang bersedekah itu berniat untuk bersedekah, (baju besi) itu akan mengembang sehingga ia menutup jejaknya, dan setiap kali orang yang kedekut itu berniat untuk bersedekah, setiap lingkaran (baju besi) itu akan mengecil dan melekat padanya, dan tangannya terikat pada tulang selangkanya.\" Aku mendengar Rasulullah ﷺ bersabda: \"Dia berusaha untuk mengembangkannya, tetapi dia tidak dapat.\""
  },
  {
    "id": 17290,
    "hadith_number": 2554,
    "tajuk_hadith": "Jangan Terlalu Berkira dalam Bersedekah",
    "perawi_melayu": "Diriwayatkan daripada Abu Umamah bin Sahl bin Hunaif:",
    "english_text": "\"One day we were sitting in the Masjid with a group of the Muhajirin and Ansar, We sent a man to 'Aishah to ask permission to come to her. She said: 'A beggar came in to me one day when the Messenger of Allah was present, and I ordered that he be given something, then I called for it and looked at it. The Messenger of Allah said: Do you want that nothing should enter or leave your house without your knowledge? I said: 'Yes.' He said: \"Don't be hasty, O 'Aishah. Do not count what you give, otherwise Allah will count what He gives to you.\"'",
    "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ، عَنْ شُعَيْبٍ، حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنَا خَالِدٌ، عَنِ ابْنِ أَبِي هِلاَلٍ، عَنْ أُمَيَّةَ بْنِ هِنْدٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، قَالَ كُنَّا يَوْمًا فِي الْمَسْجِدِ جُلُوسًا وَنَفَرٌ مِنَ الْمُهَاجِرِينَ وَالأَنْصَارِ فَأَرْسَلْنَا رَجُلاً إِلَى عَائِشَةَ لِيَسْتَأْذِنَ فَدَخَلْنَا عَلَيْهَا قَالَتْ دَخَلَ عَلَىَّ سَائِلٌ مَرَّةً وَعِنْدِي رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَمَرْتُ لَهُ بِشَىْءٍ ثُمَّ دَعَوْتُ بِهِ فَنَظَرْتُ إِلَيْهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمَا تُرِيدِينَ أَنْ لاَ يَدْخُلَ بَيْتَكِ شَىْءٌ وَلاَ يَخْرُجَ إِلاَّ بِعِلْمِكِ ‏\"‏ ‏.‏ قُلْتُ نَعَمْ ‏.‏ قَالَ ‏\"‏ مَهْلاً يَا عَائِشَةُ لاَ تُحْصِي فَيُحْصِيَ اللَّهُ عَزَّ وَجَلَّ عَلَيْكِ ‏\"‏ ‏.‏",
    "malay_translation": "Pada suatu hari, kami sedang duduk di Masjid bersama sekumpulan Muhajirin dan Ansar. Kami menghantar seorang lelaki kepada 'Aishah untuk meminta izin. Lalu, kami masuk menemuinya. 'Aishah berkata: \"Seorang pengemis datang kepada ku pada suatu hari ketika Rasulullah ﷺ ada bersama ku. Aku memerintahkan agar dia diberi sesuatu, kemudian aku memanggilnya dan melihatnya. Rasulullah ﷺ bersabda: 'Adakah engkau mahu tiada sesuatu pun masuk atau keluar dari rumahmu melainkan dengan pengetahuanmu?' Aku menjawab: 'Ya.' Baginda bersabda: 'Jangan terburu-buru, wahai 'Aishah. Jangan mengira apa yang engkau berikan, jika tidak Allah akan mengira apa yang Dia berikan kepada mu.'"
  },
  {
    "id": 17291,
    "hadith_number": 2555,
    "tajuk_hadith": "Jangan Mengira Apa yang Kamu Berikan",
    "perawi_melayu": "Daripada Asma' bint Abi Bakr bahawa Nabi SAW bersabda kepadanya:",
    "english_text": "\"Do not count what you give, otherwise Allah, the Mighty and Sublime, will count what He gives to you.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ آدَمَ، عَنْ عَبْدَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ فَاطِمَةَ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لَهَا ‏\n\"‏ لاَ تُحْصِي فَيُحْصِيَ اللَّهُ عَزَّ وَجَلَّ عَلَيْكِ ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah kamu mengira-ngira (membilang) apa yang kamu berikan, kerana Allah SWT akan mengira (membalas) apa yang Dia berikan kepadamu."
  },
  {
    "id": 17292,
    "hadith_number": 2556,
    "tajuk_hadith": "Memberi Sedekah daripada Rezeki Suami",
    "perawi_melayu": "Diriwayatkan daripada Asma' binti Abi Bakr r.a. bahawa dia datang kepada Nabi ﷺ dan berkata:",
    "english_text": "\"O Prophet of Allah, I do not have anything but that which Az-Zubair brings to me. Is there any sin on me if I give a small amount of that which he brings to me?\" He said: Give whatever you can, and do not withhold what you have, lest Allah withhold provision from you.\"",
    "arabic_text": "أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدٍ، عَنْ حَجَّاجٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ، عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، أَنَّهَا جَاءَتِ النَّبِيَّ صلى الله عليه وسلم فَقَالَتْ يَا نَبِيَّ اللَّهِ لَيْسَ لِي شَىْءٌ إِلاَّ مَا أَدْخَلَ عَلَىَّ الزُّبَيْرُ فَهَلْ عَلَىَّ جُنَاحٌ فِي أَنْ أَرْضَخَ مِمَّا يُدْخِلُ عَلَىَّ فَقَالَ ‏\n\"‏ ارْضَخِي مَا اسْتَطَعْتِ وَلاَ تُوكِي فَيُوكِيَ اللَّهُ عَزَّ وَجَلَّ عَلَيْكِ ‏\"‏ ‏.‏",
    "malay_translation": "Wahai Nabi Allah, saya tidak mempunyai apa-apa melainkan apa yang dibawa oleh Az-Zubair kepada saya. Adakah berdosa jika saya memberikan sedikit daripada apa yang dibawanya kepada saya? Baginda bersabda: Berikanlah apa yang kamu mampu, dan janganlah menahan apa yang kamu ada, kerana Allah akan menahan rezeki daripada kamu."
  },
  {
    "id": 17293,
    "hadith_number": 2557,
    "tajuk_hadith": "Lindungi Diri Daripada Api Neraka",
    "perawi_melayu": "Diriwayatkan daripada 'Adiyy bin Hatim bahawa Nabi ﷺ bersabda:",
    "english_text": "\"Protect yourselves from the Fire, even with half a date.\"",
    "arabic_text": "أَخْبَرَنَا نَصْرُ بْنُ عَلِيٍّ، عَنْ خَالِدٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الْمُحِلِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ اتَّقُوا النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ ‏\"‏ ‏.‏",
    "malay_translation": "Lindungilah diri kamu daripada api neraka, walaupun dengan (bersedekah) separuh kurma."
  },
  {
    "id": 17294,
    "hadith_number": 2558,
    "tajuk_hadith": "Melindungi Diri dari Neraka dengan Sedekah dan Kata-kata Baik",
    "perawi_melayu": "Diriwayatkan daripada 'Adiyy bin Hatim رضي الله عنه",
    "english_text": "\"The Messenger of Allah mentioned the Fire, and he turned his face away (as if seeing it), and sought refuge with Allah from it.\" (One of the narrators) Shu'bah said: \"He did that three times, then he said: 'Protect yourselves from the Fire even with half a date, and if you cannot find that, then with a good word.\"'",
    "arabic_text": "أَنْبَأَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، أَنَّ عَمْرَو بْنَ مُرَّةَ، حَدَّثَهُمْ عَنْ خَيْثَمَةَ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ ذَكَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم النَّارَ فَأَشَاحَ بِوَجْهِهِ وَتَعَوَّذَ مِنْهَا ذَكَرَ شُعْبَةُ أَنَّهُ فَعَلَهُ ثَلاَثَ مَرَّاتٍ - ثُمَّ قَالَ ‏\n\"‏ اتَّقُوا النَّارَ وَلَوْ بِشِقِّ التَّمْرَةِ فَإِنْ لَمْ تَجِدُوا فَبِكَلِمَةٍ طَيِّبَةٍ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ menyebut tentang Neraka, lalu baginda memalingkan wajah (seolah-olah melihatnya), dan memohon perlindungan kepada Allah daripadanya. (Salah seorang perawi) Shu'bah berkata: \"Baginda melakukan hal itu sebanyak tiga kali, kemudian baginda bersabda: 'Lindungilah diri kalian dari Neraka walaupun dengan (bersedekah) separuh kurma, dan jika kalian tidak dapat menemukan (untuk bersedekah), maka (lindungilah diri dengan) kata-kata yang baik.'\""
  },
  {
    "id": 17295,
    "hadith_number": 2559,
    "tajuk_hadith": "Keutamaan Bersedekah dan Memberi Contoh Baik dalam Islam",
    "perawi_melayu": "Al-Mundhir bin Jarir meriwayatkan daripada bapanya:",
    "english_text": "\"While we were with the Messenger of Allah in the early hours of the morning, some people came who were naked and barefoot, with their swords hung (around their necks). Most of them, may all of them, belonged to the tribe of Mudar. The face of the Messenger of Allah changed when he saw them in poverty. He went in (to his house) then he came out and ordered Bilah to call the Adhan and then the Iqamah. He (the Prophet) prayed, tjem je addressed te,, (reciting the Verses): 'O mankind! Be dutiful to your Lord, Who created you from a single person (Adam), and from him(Adam) He created his wife  Then they gave in charity, some giving a Dinar, others a Dirham, or a garment, or a Sa' of wheat or, a Sa' of dates, until he said: 'Even half a date.' A man from among the Ansar came with a bag of money which his hands could hardly lift. The people followed one another (in giving charity) until I saw two heaps of food and clothing, and I saw the face of the Messenger of Allah shining like gold (with joy). The Messenger of Allah said: 'Whoever sets a good precedent in Islam, he will have the reward for that, and the reward of those who acted in accordance with it, without that detracting from their reward in the slightest. And whoever sets an evil precedent in Islam, he will have a burden of sin for that, and the burden of those who acted in accordance with it, without that detracting from their burden in the slightest.\"'",
    "arabic_text": "أَخْبَرَنَا أَزْهَرُ بْنُ جَمِيلٍ، قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ وَذَكَرَ عَوْنُ بْنُ أَبِي جُحَيْفَةَ قَالَ سَمِعْتُ الْمُنْذِرَ بْنَ جَرِيرٍ، يُحَدِّثُ عَنْ أَبِيهِ، قَالَ كُنَّا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي صَدْرِ النَّهَارِ فَجَاءَ قَوْمٌ عُرَاةً حُفَاةً مُتَقَلِّدِي السُّيُوفِ عَامَّتُهُمْ مِنْ مُضَرَ بَلْ كُلُّهُمْ مِنْ مُضَرَ فَتَغَيَّرَ وَجْهُ رَسُولِ اللَّهِ صلى الله عليه وسلم لِمَا رَأَى بِهِمْ مِنَ الْفَاقَةِ فَدَخَلَ ثُمَّ خَرَجَ فَأَمَرَ بِلاَلاً فَأَذَّنَ فَأَقَامَ الصَّلاَةَ فَصَلَّى ثُمَّ خَطَبَ فَقَالَ ‏\"‏ ‏{‏ يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ مِنْ نَفْسٍ وَاحِدَةٍ وَخَلَقَ مِنْهَا زَوْجَهَا وَبَثَّ مِنْهُمَا رِجَالاً كَثِيرًا وَنِسَاءً وَاتَّقُوا اللَّهَ الَّذِي تَسَاءَلُونَ بِهِ وَالأَرْحَامَ إِنَّ اللَّهَ كَانَ عَلَيْكُمْ رَقِيبًا ‏}‏ وَ ‏{‏ اتَّقُوا اللَّهَ وَلْتَنْظُرْ نَفْسٌ مَا قَدَّمَتْ لِغَدٍ ‏}‏ تَصَدَّقَ رَجُلٌ مِنْ دِينَارِهِ مِنْ دِرْهَمِهِ مِنْ ثَوْبِهِ مِنْ صَاعِ بُرِّهِ مِنْ صَاعِ تَمْرِهِ - حَتَّى قَالَ - وَلَوْ بِشِقِّ تَمْرَةٍ ‏\"‏ ‏.‏ فَجَاءَ رَجُلٌ مِنَ الأَنْصَارِ بِصُرَّةٍ كَادَتْ كَفُّهُ تُعْجِزُ عَنْهَا بَلْ قَدْ عَجَزَتْ ثُمَّ تَتَابَعَ النَّاسُ حَتَّى رَأَيْتُ كَوْمَيْنِ مِنْ طَعَامٍ وَثِيَابٍ حَتَّى رَأَيْتُ وَجْهَ رَسُولِ اللَّهِ صلى الله عليه وسلم يَتَهَلَّلُ كَأَنَّهُ مُذْهَبَةٌ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ سَنَّ فِي الإِسْلاَمِ سُنَّةً حَسَنَةً فَلَهُ أَجْرُهَا وَأَجْرُ مَنْ عَمِلَ بِهَا مِنْ غَيْرِ أَنْ يَنْقُصَ مِنْ أُجُورِهِمْ شَيْئًا وَمَنْ سَنَّ فِي الإِسْلاَمِ سُنَّةً سَيِّئَةً فَعَلَيْهِ وِزْرُهَا وَوِزْرُ مَنْ عَمِلَ بِهَا مِنْ غَيْرِ أَنْ يَنْقُصَ مِنْ أَوْزَارِهِمْ شَيْئًا ‏\"‏ ‏.‏",
    "malay_translation": "Ketika kami bersama Rasulullah ﷺ pada awal pagi, datanglah beberapa orang yang telanjang dan berkaki ayam, dengan pedang tergantung (di leher mereka). Kebanyakan mereka, bahkan semuanya, berasal dari suku Mudar. Wajah Rasulullah ﷺ berubah ketika baginda melihat mereka dalam kemiskinan. Baginda masuk (ke rumahnya) kemudian keluar dan menyuruh Bilal melaungkan azan dan kemudian iqamah. Baginda (Nabi) solat, kemudian berkhutbah, (membacakan ayat): 'Wahai umat manusia! Bertaqwalah kepada Tuhanmu, yang menciptakan kamu daripada diri yang satu (Adam), dan daripada-Nya (Adam) Dia menciptakan isterinya… Kemudian mereka bersedekah, ada yang memberi Dinar, ada yang memberi Dirham, pakaian, atau Sa' gandum atau Sa' kurma, sehingga baginda berkata: 'Walaupun dengan separuh kurma.' Seorang lelaki dari kalangan Ansar datang dengan beg berisi wang yang tangannya hampir tidak dapat mengangkatnya. Orang ramai mengikut antara satu sama lain (dalam memberi sedekah) sehingga aku melihat dua timbunan makanan dan pakaian, dan aku melihat wajah Rasulullah ﷺ bersinar seperti emas (dengan gembira). Rasulullah ﷺ bersabda: 'Sesiapa yang menetapkan sunnah yang baik dalam Islam, dia akan mendapat pahala atasnya, dan pahala orang yang mengamalkannya, tanpa sedikit pun mengurangkan pahala mereka. Dan sesiapa yang menetapkan sunnah yang buruk dalam Islam, dia akan menanggung dosa atasnya, dan dosa orang yang mengamalkannya, tanpa sedikit pun mengurangkan beban dosa mereka.'",
    "Not Available": ""
  },
  {
    "id": 17296,
    "hadith_number": 2560,
    "tajuk_hadith": "Kepentingan Bersedekah di Waktu yang Tepat",
    "perawi_melayu": "Diriwayatkan daripada Harithah",
    "english_text": "\"I heard the Messenger of Allah (ﷺ) say: 'Give charity, for there will come a time when a man will walk about with his charity, and the one to whom he wants to give it will say: If you had brought it\nyesterday I would have accepted it, but today (I have no need of it).\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مَعْبَدِ بْنِ خَالِدٍ، عَنْ حَارِثَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ تَصَدَّقُوا فَإِنَّهُ سَيَأْتِي عَلَيْكُمْ زَمَانٌ يَمْشِي الرَّجُلُ بِصَدَقَتِهِ فَيَقُولُ الَّذِي يُعْطَاهَا لَوْ جِئْتَ بِهَا بِالأَمْسِ قَبِلْتُهَا فَأَمَّا الْيَوْمَ فَلاَ ‏\"‏ ‏.‏",
    "malay_translation": "Saya mendengar Rasulullah (ﷺ) bersabda: 'Bersedekahlah, kerana akan datang suatu masa di mana seseorang berjalan dengan sedekahnya, dan orang yang hendak dia berikan akan berkata: Sekiranya kamu membawanya semalam, sudah tentu aku menerimanya, tetapi hari ini (aku tidak memerlukannya).'"
  },
  {
    "id": 17297,
    "hadith_number": 2561,
    "tajuk_hadith": "Keutamaan Syafaat dan Ketetapan Allah",
    "perawi_melayu": "Diriwayatkan daripada Abu Musa bahawa Nabi ﷺ bersabda:",
    "english_text": "\"Intercede and your intercession may be accepted, and Allah, the Mighty and Sublime, decrees on the lips of His Prophet whatsoever He will.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ أَخْبَرَنِي أَبُو بُرْدَةَ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ، عَنْ جَدِّهِ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ اشْفَعُوا تُشَفَّعُوا وَيَقْضِي اللَّهُ عَزَّ وَجَلَّ عَلَى لِسَانِ نَبِيِّهِ مَا شَاءَ ‏\"‏ ‏.‏",
    "malay_translation": "Syafaatlah, nescaya syafaatmu akan diterima, dan Allah, Yang Maha Perkasa dan Maha Agung, menetapkan melalui lidah Nabi-Nya apa sahaja yang Dia kehendaki."
  },
  {
    "id": 17298,
    "hadith_number": 2562,
    "tajuk_hadith": "Ganjaran Syafaat",
    "perawi_melayu": "Diriwayatkan daripada Mu'awiyah bin Sufyan bahawa Rasulullah ﷺ bersabda:",
    "english_text": "\"A man may come and ask for something, and I refuse until you intercede, so that you will be rewarded.\" And the Messenger of Allah said: \"Intercede and you will be rewarded.\"",
    "arabic_text": "أَخْبَرَنَا هَارُونُ بْنُ سَعِيدٍ، قَالَ أَنْبَأَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنِ ابْنِ مُنَبِّهٍ، عَنْ أَخِيهِ، عَنْ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ الرَّجُلَ لَيَسْأَلُنِي الشَّىْءَ فَأَمْنَعُهُ حَتَّى تَشْفَعُوا فِيهِ فَتُؤْجَرُوا ‏\"‏ ‏.‏ وَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ اشْفَعُوا تُؤْجَرُوا ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki mungkin datang meminta sesuatu daripada-Ku, lalu Aku enggan memberikannya sehingga kamu memberi syafaat, supaya kamu diberi ganjaran. Dan Rasulullah ﷺ bersabda: \"Berilah syafaat, maka kamu akan diberi ganjaran.\""
  },
  {
    "id": 17299,
    "hadith_number": 2563,
    "tajuk_hadith": "Kecemburuan dan Keangkuhan yang Disukai dan Dibenci Allah",
    "perawi_melayu": "Diriwayatkan daripada Ibn Jabir, daripada bapanya, bahawa Rasulullah ﷺ bersabda:",
    "english_text": "\"There is a kind of protective Jealousy that Allah, the Mighty and Sublime, loves anda kind that Allah, the Mighty and Sublime, hates, and a kind of pride that Allah, the Mighty and Sublime, loves and a kind that Allah, the Mighty and Sublime, hates, As for the protective jealousy that Allah, the Mighty and Sublime, loves, it is protective jealousy when there are grounds for suspicion. As for the protective jealousy that Allah, the Mighty and Sublime, hates, it is protective jealousy when there are no grounds for suspicion. As for the pride that Allah, the Mighty and Sublime, loves, it is when a man feels proud of himself when fighting and when giving charity. And as for the kind of pride that Allah, the Mighty and Sublime, hates, it is pride in doing wrong.\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيُّ، عَنِ ابْنِ جَابِرٍ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ مِنَ الْغَيْرَةِ مَا يُحِبُّ اللَّهُ عَزَّ وَجَلَّ وَمِنْهَا مَا يُبْغِضُ اللَّهُ عَزَّ وَجَلَّ وَمِنَ الْخُيَلاَءِ مَا يُحِبُّ اللَّهُ عَزَّ وَجَلَّ وَمِنْهَا مَا يُبْغِضُ اللَّهُ عَزَّ وَجَلَّ فَأَمَّا الْغَيْرَةُ الَّتِي يُحِبُّ اللَّهُ عَزَّ وَجَلَّ فَالْغَيْرَةُ فِي الرِّيبَةِ وَأَمَّا الْغَيْرَةُ الَّتِي يُبْغِضُ اللَّهُ عَزَّ وَجَلَّ فَالْغَيْرَةُ فِي غَيْرِ رِيبَةٍ وَالاِخْتِيَالُ الَّذِي يُحِبُّ اللَّهُ عَزَّ وَجَلَّ اخْتِيَالُ الرَّجُلِ بِنَفْسِهِ عِنْدَ الْقِتَالِ وَعِنْدَ الصَّدَقَةِ وَالاِخْتِيَالِ الَّذِي يُبْغِضُ اللَّهُ عَزَّ وَجَلَّ الْخُيَلاَءُ فِي الْبَاطِلِ ‏\"‏ ‏.‏",
    "malay_translation": "Sesungguhnya ada sejenis kecemburuan yang Allah ﷻ cintai dan sejenis yang Allah ﷻ benci, dan ada sejenis keangkuhan yang Allah ﷻ cintai dan sejenis yang Allah ﷻ benci. Adapun kecemburuan yang Allah ﷻ cintai ialah kecemburuan apabila ada keraguan. Adapun kecemburuan yang Allah ﷻ benci ialah kecemburuan tanpa ada keraguan. Adapun keangkuhan yang Allah ﷻ cintai ialah keangkuhan seseorang terhadap dirinya ketika berperang dan ketika bersedekah. Adapun keangkuhan yang Allah ﷻ benci ialah keangkuhan dalam kebatilan."
  },
  {
    "id": 17300,
    "hadith_number": 2564,
    "tajuk_hadith": "Berbelanja, Bersedekah dan Berpakaian Secara Sederhana",
    "perawi_melayu": "Daripada 'Amr bin Shu'aib, daripada bapanya, bahawa datuknya berkata:",
    "english_text": "\"Eat, give charity and clothe yourselves, without being extravagant, and without showing off.\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا يَزِيدُ، قَالَ حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ كُلُوا وَتَصَدَّقُوا وَالْبَسُوا فِي غَيْرِ إِسْرَافٍ وَلاَ مَخِيلَةٍ ‏\"‏ ‏.‏",
    "malay_translation": "Makanlah, bersedekahlah dan berpakaianlah, tanpa berlebih-lebihan dan tanpa bermegah-megah."
  },
  {
    "id": 17301,
    "hadith_number": 2565,
    "tajuk_hadith": "Umat Islam Ibarat Bangunan yang Saling Menyokong",
    "perawi_melayu": "Diriwayatkan daripada Abu Musa",
    "english_text": "\"The Messenger of Allah said: 'The believers are like a building they support one another.' And he said: \"The trustworthy storekeeper who gives that which he has been commanded to give, and is happy with what he is doing, is one of the two giving charity.\"'",
    "arabic_text": "أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ الْهَيْثَمِ بْنِ عُثْمَانَ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ بُرَيْدِ بْنِ أَبِي بُرْدَةَ، عَنْ جَدِّهِ، عَنْ أَبِي مُوسَى، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْمُؤْمِنُ لِلْمُؤْمِنِ كَالْبُنْيَانِ يَشُدُّ بَعْضُهُ بَعْضًا ‏\"‏ ‏.‏ وَقَالَ ‏\"‏ الْخَازِنُ الأَمِينُ الَّذِي يُعْطِي مَا أُمِرَ بِهِ طَيِّبًا بِهَا نَفْسُهُ أَحَدُ الْمُتَصَدِّقَيْنِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Orang-orang beriman itu umpama sebuah bangunan, mereka saling menguatkan antara satu sama lain.\" Dan baginda bersabda: \"Penyimpan amanah yang memberi apa yang diperintahkannya untuk diberikan, dengan hati yang gembira, adalah salah seorang daripada dua orang yang bersedekah.\""
  },
  {
    "id": 17302,
    "hadith_number": 2566,
    "tajuk_hadith": "Kelebihan Membaca Al-Quran Secara Terbuka dan Rahsia",
    "perawi_melayu": "Daripada 'Uqbah bin 'Amir bahawa Rasulullah ﷺ bersabda:",
    "english_text": "\"The one who recites the Qur'an loudly is like one who gives charity openly, and the one who recites the Qur'an quietly is like one who gives charity in secret.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، عَنْ بَحِيرِ بْنِ سَعْدٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ كَثِيرِ بْنِ مُرَّةَ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْجَاهِرُ بِالْقُرْآنِ كَالْجَاهِرِ بِالصَّدَقَةِ وَالْمُسِرُّ بِالْقُرْآنِ كَالْمُسِرِّ بِالصَّدَقَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Sesiapa yang membaca Al-Quran dengan suara yang lantang adalah seperti orang yang bersedekah secara terang-terangan, dan sesiapa yang membaca Al-Quran dengan perlahan adalah seperti orang yang bersedekah secara rahsia."
  },
  {
    "id": 17303,
    "hadith_number": 2567,
    "tajuk_hadith": "Tiga Golongan yang Allah Tidak Akan Memandang dan Tiga Golongan yang Tidak Akan Masuk Syurga",
    "perawi_melayu": "Daripada Salim bin 'Abdullah bahawa bapanya berkata:",
    "english_text": "\"The Messenger of Allah said: \"There are three at whom Allah will not look on the Day of Resurrection: The one who disobeys his parents, the woman who imitates men in her outward appearance, and the cuckold. And there are three who will not enter Paradise: The one who disobeys his parents, the drunkard, and the one who reminds people of what he has given them.\"'",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، قَالَ حَدَّثَنَا عُمَرُ بْنُ مُحَمَّدٍ، عَنْ عَبْدِ اللَّهِ بْنِ يَسَارٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ ثَلاَثَةٌ لاَ يَنْظُرُ اللَّهُ عَزَّ وَجَلَّ إِلَيْهِمْ يَوْمَ الْقِيَامَةِ الْعَاقُّ لِوَالِدَيْهِ وَالْمَرْأَةُ الْمُتَرَجِّلَةُ وَالدَّيُّوثُ وَثَلاَثَةٌ لاَ يَدْخُلُونَ الْجَنَّةَ الْعَاقُّ لِوَالِدَيْهِ وَالْمُدْمِنُ عَلَى الْخَمْرِ وَالْمَنَّانُ بِمَا أَعْطَى ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: “Terdapat tiga golongan yang Allah ﷻ tidak akan memandang mereka pada Hari Kiamat: orang yang menderhakai kedua ibu bapanya, wanita yang meniru lelaki dari segi penampilan, dan dayus. Dan terdapat tiga golongan yang tidak akan masuk syurga: orang yang menderhakai kedua ibu bapanya, pemabuk, dan orang yang mengungkit-ungkit pemberiannya kepada orang lain.”"
  },
  {
    "id": 17304,
    "hadith_number": 2568,
    "tajuk_hadith": "Tiga Golongan yang Allah Tidak Akan Berbicara Dengan Mereka",
    "perawi_melayu": "Diriwayatkan daripada Abu Dharr bahawa Nabi ﷺ bersabda:",
    "english_text": "\"There are three to whom Allah will not speak on the Day of Resurrection, or look at them, or sanctify them, and theirs will be a painful torment.\" The Messenger of Allah repeated and Abu Dharr said: \"May they be lost and doomed.\" He said: \"The one who lets his garment hang beneath his ankles, a vendor who tries to sell his product by means of false oaths, and the one who reminds people of what he has given them.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، عَنْ مُحَمَّدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَلِيِّ بْنِ الْمُدْرِكِ، عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ، عَنْ خَرَشَةَ بْنِ الْحُرِّ، عَنْ أَبِي ذَرٍّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ ثَلاَثَةٌ لاَ يُكَلِّمُهُمُ اللَّهُ عَزَّ وَجَلَّ يَوْمَ الْقِيَامَةِ وَلاَ يَنْظُرُ إِلَيْهِمْ وَلاَ يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ ‏\"‏ ‏.‏ فَقَرَأَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ أَبُو ذَرٍّ خَابُوا وَخَسِرُوا خَابُوا وَخَسِرُوا ‏.‏ قَالَ ‏\"‏ الْمُسْبِلُ إِزَارَهُ وَالْمُنَفِّقُ سِلْعَتَهُ بِالْحَلِفِ الْكَاذِبِ وَالْمَنَّانُ عَطَاءَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Ada tiga golongan yang Allah ﷻ tidak akan berbicara dengan mereka pada hari Kiamat, tidak memandang mereka, dan tidak mensucikan mereka. Bagi mereka azab yang pedih.\"  Rasulullah ﷺ mengulanginya, lalu Abu Dharr berkata: \"Celaka dan rugilah mereka.\" Baginda bersabda: \"(Iaitu) orang yang memanjangkan kainnya hingga di bawah buku lali, penjual yang cuba menjual barang dagangannya dengan sumpah palsu, dan orang yang mengungkit-ungkit pemberiannya.\""
  },
  {
    "id": 17305,
    "hadith_number": 2569,
    "tajuk_hadith": "Tiga Golongan yang Tidak Akan Ditegur Allah Pada Hari Kiamat",
    "perawi_melayu": "Abu Dharr berkata:",
    "english_text": "\"The Messenger of Allah said: \"There are three to whom of Allah will not speak on the Day of Resurrection or look at them or purify them, and theirs will be a painful torment: the one who reminds people of what he has given them, the one who lets his garment hang beneath his ankles, and a vendor who tries to sell his product by means of false oaths.\"",
    "arabic_text": "أَخْبَرَنَا بِشْرُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، قَالَ سَمِعْتُ سُلَيْمَانَ، - وَهُوَ الأَعْمَشُ - عَنْ سُلَيْمَانَ بْنِ مُسْهِرٍ، عَنْ خَرَشَةَ بْنِ الْحُرِّ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ ثَلاَثَةٌ لاَ يُكَلِّمُهُمُ اللَّهُ عَزَّ وَجَلَّ يَوْمَ الْقِيَامَةِ وَلاَ يَنْظُرُ إِلَيْهِمْ وَلاَ يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ الْمَنَّانُ بِمَا أَعْطَى وَالْمُسْبِلُ إِزَارَهُ وَالْمُنَفِّقُ سِلْعَتَهُ بِالْحَلِفِ الْكَاذِبِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Terdapat tiga golongan yang Allah ﷻ tidak akan berbicara dengan mereka pada Hari Kiamat, tidak akan memandang mereka, dan tidak akan membersihkan mereka, dan bagi mereka azab yang pedih: (1) Orang yang mengungkit-ungkit pemberiannya, (2) Orang yang memanjangkan kainnya di bawah buku lali, dan (3) Penjual yang cuba menjual barang dagangannya dengan sumpah palsu.\""
  },
  {
    "id": 17306,
    "hadith_number": 2570,
    "tajuk_hadith": "Menjawab Permintaan Walau dengan Kaki Kambing",
    "perawi_melayu": "Diriwayatkan daripada Abu Bujaid Al-Ansari daripada neneknya bahawa Rasulullah ﷺ bersabda:",
    "english_text": "\"Respond to the one who asks even with a sheep's foot.\" According to the narration of Harun: \"With a sheep's burned foot.\"",
    "arabic_text": "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا مَعْنٌ، قَالَ حَدَّثَنَا مَالِكٌ، ح وَأَنْبَأَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنِ ابْنِ بُجَيْدٍ الأَنْصَارِيِّ، عَنْ جَدَّتِهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ رُدُّوا السَّائِلَ وَلَوْ بِظِلْفٍ ‏\"‏ ‏.‏ فِي حَدِيثِ هَارُونَ مُحْرَقٍ ‏.‏",
    "malay_translation": "Balaslah permintaan orang yang meminta-minta walaupun hanya dengan kaki kambing.\" Menurut riwayat Harun: \"Dengan kaki kambing yang hangus.\""
  },
  {
    "id": 17307,
    "hadith_number": 2571,
    "tajuk_hadith": "Balasan Menahan Pemberian Kelebihan Harta",
    "perawi_melayu": "Bahz bin Hakim meriwayatkan dari ayahnya bahawa datuknya berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا الْمُعْتَمِرُ، قَالَ سَمِعْتُ بَهْزَ بْنَ حَكِيمٍ، يُحَدِّثُ عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ يَأْتِي رَجُلٌ مَوْلاَهُ يَسْأَلُهُ مِنْ فَضْلٍ عِنْدَهُ فَيَمْنَعُهُ إِيَّاهُ إِلاَّ دُعِيَ لَهُ يَوْمَ الْقِيَامَةِ شُجَاعٌ أَقْرَعُ يَتَلَمَّظُ فَضْلَهُ الَّذِي مَنَعَ ‏\"‏ ‏.‏",
    "malay_translation": "“Tidaklah seorang lelaki datang kepada Mawla-nya (majikan, orang yang di bawah tanggungannya) dan meminta sesuatu daripada lebihan hartanya, lalu dia menahannya daripada memberi, melainkan pada Hari Kiamat nanti, seekor Shuja' (ular) yang botak kepalanya akan dipanggil kepadanya dan akan menjilat lebihan yang dia tahan itu.”"
  },
  {
    "id": 17308,
    "hadith_number": 2572,
    "tajuk_hadith": "Meminta Perlindungan dan Membalas Kebaikan",
    "perawi_melayu": "Diriwayatkan daripada Ibnu 'Umar رضي الله عنه",
    "english_text": "\"The Messenger of Allah said: 'Whoever seeks refuge with (the name of) Allah, grant him refuge; whoever asks of you in (the name of) Allah, give him; whoever seeks protection with (the name of Allah, give him protection. Whoever does you a favor, then reciprocate, and if you cannot, then supplicate for him until you think that you have repaid him.\"'",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الأَعْمَشِ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنِ اسْتَعَاذَ بِاللَّهِ فَأَعِيذُوهُ وَمَنْ سَأَلَكُمْ بِاللَّهِ فَأَعْطُوهُ وَمَنِ اسْتَجَارَ بِاللَّهِ فَأَجِيرُوهُ وَمَنْ آتَى إِلَيْكُمْ مَعْرُوفًا فَكَافِئُوهُ فَإِنْ لَمْ تَجِدُوا فَادْعُوا لَهُ حَتَّى تَعْلَمُوا أَنْ قَدْ كَافَأْتُمُوهُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: 'Sesiapa yang memohon perlindungan dengan nama Allah, maka lindungilah dia; sesiapa yang meminta daripada kamu dengan nama Allah, maka berilah kepadanya; sesiapa yang memohon perlindungan dengan nama Allah, maka berilah perlindungan kepadanya. Sesiapa yang berbuat baik kepadamu, maka balaslah kebaikannya, dan jika kamu tidak mampu, maka doakanlah dia sehingga kamu merasakan bahawa kamu telah membalasnya.'"
  },
  {
    "id": 17309,
    "hadith_number": 2573,
    "tajuk_hadith": "Tanda-tanda Islam dan Peranan Umat Islam",
    "perawi_melayu": "Bahz bin Hakim meriwayatkan daripada bapanya bahawa datuknya berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا الْمُعْتَمِرُ، قَالَ سَمِعْتُ بَهْزَ بْنَ حَكِيمٍ، يُحَدِّثُ عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قُلْتُ يَا نَبِيَّ اللَّهِ مَا أَتَيْتُكَ حَتَّى حَلَفْتُ أَكْثَرَ مِنْ عَدَدِهِنَّ - لأَصَابِعِ يَدَيْهِ - أَلاَّ آتِيَكَ وَلاَ آتِيَ دِينَكَ وَإِنِّي كُنْتُ امْرَأً لاَ أَعْقِلُ شَيْئًا إِلاَّ مَا عَلَّمَنِي اللَّهُ وَرَسُولُهُ وَإِنِّي أَسْأَلُكَ بِوَجْهِ اللَّهِ عَزَّ وَجَلَّ بِمَا بَعَثَكَ رَبُّكَ إِلَيْنَا قَالَ ‏\"‏ بِالإِسْلاَمِ ‏\"‏ ‏.‏ قَالَ قُلْتُ وَمَا آيَاتُ الإِسْلاَمِ قَالَ ‏\"‏ أَنْ تَقُولَ أَسْلَمْتُ وَجْهِيَ إِلَى اللَّهِ عَزَّ وَجَلَّ وَتَخَلَّيْتُ وَتُقِيمَ الصَّلاَةَ وَتُؤْتِيَ الزَّكَاةَ كُلُّ مُسْلِمٍ عَلَى مُسْلِمٍ مُحَرَّمٌ أَخَوَانِ نَصِيرَانِ لاَ يَقْبَلُ اللَّهُ عَزَّ وَجَلَّ مِنْ مُشْرِكٍ بَعْدَ مَا أَسْلَمَ عَمَلاً أَوْ يُفَارِقَ الْمُشْرِكِينَ إِلَى الْمُسْلِمِينَ ‏\"‏ ‏.‏",
    "malay_translation": "Aku berkata: 'Wahai Nabi Allah! Aku tidak datang kepada-Mu sehingga aku telah bersumpah lebih daripada jumlah ini' - bilangan jari di tangannya - 'bahawa aku tidak akan datang kepada-Mu atau mengikut agama-Mu. Aku adalah seorang lelaki yang tidak tahu apa-apa kecuali apa yang diajar oleh Allah dan Rasul-Nya kepada aku. Aku bertanya kepada-Mu demi wajah Allah, Yang Maha Perkasa dan Maha Tinggi, dengan apa Tuhan-Mu mengutus-Mu kepada kami?' Baginda bersabda: 'Dengan Islam.' Aku berkata: 'Apakah tanda-tanda Islam?' Baginda bersabda: 'Untuk berkata: Aku menyerah diri kepada Allah dan meninggalkan syirik, dan mendirikan solat serta menunaikan zakat. Setiap Muslim adalah suci dan tidak boleh diganggu oleh sesama Muslim; mereka saling menyokong. Allah tidak menerima amalan daripada seorang musyrik selepas dia memeluk Islam, sehingga dia meninggalkan orang-orang musyrik dan menyertai orang-orang Muslim.'"
  },
  {
    "id": 17310,
    "hadith_number": 2574,
    "tajuk_hadith": "Orang Terbaik dan Terburuk di Sisi Allah",
    "perawi_melayu": "Daripada Ibn 'Abbas bahawa Rasulullah ﷺ bersabda:",
    "english_text": "\"Shall I not tell you of the best of the people in status?\" We said: \"Yes. O Messenger of Allah!\" He said: \"A man who rides his horse in the cause of Allah, the Mighty and Sublime, until he dies or is killed. Shall I not tell you of the one who comes after him (in status)?\" We said: \"Yes, O Messenger of Allah!\" He said; \"A man who withdraws to a mountain pass and establishes Salah, and pays Zakah, and keeps away from the evil of people. Shall I not tell you of the worst of people?\" We said: \"Yes, O Messenger of Allah!\" He said: \"The one who asks for the sake of Allah, the Mighty and Sublime, but does not give (when he is asked) for His sake,\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، قَالَ أَنْبَأَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدِ بْنِ خَالِدٍ الْقَارِظِيِّ، عَنْ إِسْمَاعِيلَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ أَلاَ أُخْبِرُكُمْ بِخَيْرِ النَّاسِ مَنْزِلاً ‏\"‏ ‏.‏ قُلْنَا بَلَى يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ رَجُلٌ آخِذٌ بِرَأْسِ فَرَسِهِ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ حَتَّى يَمُوتَ أَوْ يُقْتَلَ وَأُخْبِرُكُمْ بِالَّذِي يَلِيهِ ‏\"‏ ‏.‏ قُلْنَا نَعَمْ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ رَجُلٌ مُعْتَزِلٌ فِي شِعْبٍ يُقِيمُ الصَّلاَةَ وَيُؤْتِي الزَّكَاةَ وَيَعْتَزِلُ شُرُورَ النَّاسِ وَأُخْبِرُكُمْ بِشَرِّ النَّاسِ ‏\"‏ ‏.‏ قُلْنَا نَعَمْ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ الَّذِي يُسْأَلُ بِاللَّهِ عَزَّ وَجَلَّ وَلاَ يُعْطِي بِهِ ‏\"‏ ‏.‏",
    "malay_translation": "“Tidakkah patut aku khabarkan kepada kamu tentang orang yang terbaik kedudukannya?” Kami menjawab, “Benar, wahai Rasulullah!” Baginda bersabda, “Seorang lelaki yang menunggang kudanya di jalan Allah ﷻ yang Maha Perkasa dan Maha Agung, sehingga dia meninggal atau terbunuh. Tidakkah patut aku khabarkan kepada kamu tentang orang yang datang selepasnya (dalam kedudukan)?“ Kami menjawab, “Ya, wahai Rasulullah!” Baginda bersabda, “Seorang lelaki yang mengasingkan diri di ceruk gunung dan mendirikan solat, menunaikan zakat, dan menjauhi kejahatan manusia. Tidakkah patut aku khabarkan kepada kamu tentang orang yang terburuk?” Kami menjawab, “Ya, wahai Rasulullah!” Baginda bersabda, “Orang yang meminta demi Allah ﷻ yang Maha Perkasa dan Maha Agung, tetapi tidak memberi (apabila diminta) kerana-Nya,”"
  },
  {
    "id": 17311,
    "hadith_number": 2575,
    "tajuk_hadith": "Tiga Orang yang Dikasihi dan Dibenci Allah (s.w.t)",
    "perawi_melayu": "Diriwayatkan daripada Zaid bin Zibyan, dan dinisbahkan kepada Abu Dharr, bahawa Nabi (s.a.w) bersabda:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، قَالَ سَمِعْتُ رِبْعِيًّا، يُحَدِّثُ عَنْ زَيْدِ بْنِ ظَبْيَانَ، رَفَعَهُ إِلَى أَبِي ذَرٍّ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ ثَلاَثَةٌ يُحِبُّهُمُ اللَّهُ عَزَّ وَجَلَّ وَثَلاَثَةٌ يُبْغِضُهُمُ اللَّهُ عَزَّ وَجَلَّ أَمَّا الَّذِينَ يُحِبُّهُمُ اللَّهُ عَزَّ وَجَلَّ فَرَجُلٌ أَتَى قَوْمًا فَسَأَلَهُمْ بِاللَّهِ عَزَّ وَجَلَّ وَلَمْ يَسْأَلْهُمْ بِقَرَابَةٍ بَيْنَهُ وَبَيْنَهُمْ فَمَنَعُوهُ فَتَخَلَّفَهُ رَجُلٌ بِأَعْقَابِهِمْ فَأَعْطَاهُ سِرًّا لاَ يَعْلَمُ بِعَطِيَّتِهِ إِلاَّ اللَّهُ عَزَّ وَجَلَّ وَالَّذِي أَعْطَاهُ وَقَوْمٌ سَارُوا لَيْلَتَهُمْ حَتَّى إِذَا كَانَ النَّوْمُ أَحَبَّ إِلَيْهِمْ مِمَّا يُعْدَلُ بِهِ نَزَلُوا فَوَضَعُوا رُءُوسَهُمْ فَقَامَ يَتَمَلَّقُنِي وَيَتْلُو آيَاتِي وَرَجُلٌ كَانَ فِي سَرِيَّةٍ فَلَقُوا الْعَدُوَّ فَهُزِمُوا فَأَقْبَلَ بِصَدْرِهِ حَتَّى يُقْتَلَ أَوْ يَفْتَحَ اللَّهُ لَهُ وَالثَّلاَثَةُ الَّذِينَ يُبْغِضُهُمُ اللَّهُ عَزَّ وَجَلَّ الشَّيْخُ الزَّانِي وَالْفَقِيرُ الْمُخْتَالُ وَالْغَنِيُّ الظَّلُومُ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Abu Dharr r.a., bahawa Nabi SAW bersabda: \"Tiga golongan yang dikasihi oleh Allah SWT dan tiga golongan yang dibenci oleh Allah SWT. Adapun golongan yang dikasihi Allah SWT: Seorang lelaki yang datang kepada suatu kaum, lalu meminta (sesuatu) kerana Allah SWT, bukan kerana hubungan kekeluargaan antara mereka, tetapi mereka enggan memberinya. Kemudian, ada seorang lelaki yang tinggal di belakang, lalu memberikan sedekah kepadanya secara rahsia, dan tiada siapa yang mengetahui pemberiannya kecuali Allah SWT dan orang yang menerima sedekah itu. Dan (golongan kedua) kaum yang bermusafir pada malam hari, sehingga tidur menjadi lebih mereka sukai daripada segala sesuatu yang setara dengannya. Mereka pun berhenti dan meletakkan kepala mereka (untuk tidur). Kemudian seorang lelaki di antara mereka bangun dan mula berdoa kepada-Ku serta memohon kepada-Ku, sambil membaca ayat-ayat-Ku. Dan (golongan ketiga) seorang lelaki yang berada dalam peperangan dan bertemu dengan musuh, lalu mereka melarikan diri, tetapi dia mara ke hadapan (mengejar mereka) sehingga dia terbunuh atau Allah SWT memberikan kemenangan kepadanya. Dan tiga golongan yang dibenci oleh Allah SWT ialah lelaki tua yang melakukan zina, orang miskin yang sombong, dan orang kaya yang zalim.\""
  },
  {
    "id": 17312,
    "hadith_number": 2576,
    "tajuk_hadith": "Si Miskin Sejati",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah bahawa Rasulullah ﷺ bersabda:",
    "english_text": "\"The poor man (Miskin) is not the one who leaves if you give him a date or two, or a morsel or two. Rather the poor man is the one who refrains from asking. Recite if you wish: \"They do not beg of people at all.\"'",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَنْبَأَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنَا شَرِيكٌ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لَيْسَ الْمِسْكِينُ الَّذِي تَرُدُّهُ التَّمْرَةُ وَالتَّمْرَتَانِ وَاللُّقْمَةُ وَاللُّقْمَتَانِ إِنَّ الْمِسْكِينَ الْمُتَعَفِّفُ اقْرَءُوا إِنْ شِئْتُمْ ‏{‏ لاَ يَسْأَلُونَ النَّاسَ إِلْحَافًا ‏}‏ ‏\"‏ ‏.‏",
    "malay_translation": "Orang miskin (Miskin) bukanlah orang yang pergi jika kamu memberinya sebiji atau dua biji kurma, atau sepotong atau dua potong makanan. Bahkan, orang miskin ialah orang yang menahan diri daripada meminta. Bacalah jika kamu mahu: \"Mereka tidak meminta-minta daripada manusia sedikit pun.\""
  },
  {
    "id": 17313,
    "hadith_number": 2577,
    "tajuk_hadith": "Si Miskin Sejati",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah bahawa Rasulullah ﷺ bersabda:",
    "english_text": "\"The poor man (Miskin) is not the one who goes around asking people and they send him away with a morsel or two, of a date or two. \"They said: \"Then what does poor (Mishkin) mean?\" He said: \"The one who does not possess independence of means and no one notices him to give charity to him, and he does not stand and ask of people.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لَيْسَ الْمِسْكِينُ بِهَذَا الطَّوَّافِ الَّذِي يَطُوفُ عَلَى النَّاسِ تَرُدُّهُ اللُّقْمَةُ وَاللُّقْمَتَانِ وَالتَّمْرَةُ وَالتَّمْرَتَانِ ‏\"‏ ‏.‏ قَالُوا فَمَا الْمِسْكِينُ قَالَ ‏\"‏ الَّذِي لاَ يَجِدُ غِنًى يُغْنِيهِ وَلاَ يُفْطَنُ لَهُ فَيُتَصَدَّقَ عَلَيْهِ وَلاَ يَقُومُ فَيَسْأَلَ النَّاسَ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Orang miskin (Miskin) bukanlah orang yang mengemis kepada manusia lalu mereka memberinya satu atau dua suapan makanan, atau sebiji atau dua biji kurma.\" Mereka bertanya: \"Lalu apakah maksud miskin (Mishkin) itu?\" Baginda bersabda: \"Iaitu orang yang tidak mempunyai kecukupan untuk menampung kehidupannya, dan tidak ada sesiapa pun yang menyedarinya untuk memberi sedekah kepadanya, dan dia tidak meminta-minta kepada manusia.\""
  },
  {
    "id": 17314,
    "hadith_number": 2578,
    "tajuk_hadith": "Definisi Orang Miskin Sejati",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah bahawa Rasulullah ﷺ bersabda:",
    "english_text": "\"The poor man (Miskin) is not the one who leaves if you give him a morsel or two, or a date or two.\" They said: \"Then who is the Miskin, O Messenger of Allah?\" He said: \"The one who does not possess independence of means, and the people do not know of his need, so that they could give him charity.\"",
    "arabic_text": "أَخْبَرَنَا نَصْرُ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الأَعْلَى، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لَيْسَ الْمِسْكِينُ الَّذِي تَرُدُّهُ الأُكْلَةُ وَالأُكْلَتَانِ وَالتَّمْرَةُ وَالتَّمْرَتَانِ ‏\"‏ ‏.‏ قَالُوا فَمَا الْمِسْكِينُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الَّذِي لاَ يَجِدُ غِنًى وَلاَ يَعْلَمُ النَّاسُ حَاجَتَهُ فَيُتَصَدَّقَ عَلَيْهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Orang miskin (Miskin) bukanlah orang yang akan pergi jika kamu memberinya sepotong makanan atau dua potong, atau sebiji kurma atau dua biji.\" Mereka bertanya: \"Jadi siapakah orang Miskin itu, wahai Rasulullah?\" Baginda menjawab: \"Orang yang tidak mempunyai kebebasan kewangan, dan orang ramai tidak mengetahui keperluannya, supaya mereka dapat memberikan sedekah kepadanya.\""
  },
  {
    "id": 17315,
    "hadith_number": 2579,
    "tajuk_hadith": "Memberi Sedekah Walaupun Sekadar Kaki Kambing yang Terbakar",
    "perawi_melayu": "Diriwayatkan daripada 'Abdur-Rahman bin Bujaid bahawa neneknya, Umm Bujaid - yang merupakan salah seorang yang memberi bai'ah kepada Rasulullah - berkata kepada Rasulullah:",
    "english_text": "\"Not Available\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ بُجَيْدٍ، عَنْ جَدَّتِهِ أُمِّ بُجَيْدٍ، وَكَانَتْ، مِمَّنْ بَايَعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنَّهَا قَالَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِنَّ الْمِسْكِينَ لَيَقُومُ عَلَى بَابِي فَمَا أَجِدُ لَهُ شَيْئًا أُعْطِيهِ إِيَّاهُ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنْ لَمْ تَجِدِي شَيْئًا تُعْطِينَهُ إِيَّاهُ إِلاَّ ظِلْفًا مُحْرَقًا فَادْفَعِيهِ إِلَيْهِ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang wanita miskin berdiri di hadapanku, dan aku tidak menemui apa-apa untuk diberikan kepadanya. Rasulullah ﷺ bersabda kepadanya: \"Jika engkau tidak menemui apa-apa untuk diberikan kepadanya kecuali kaki kambing yang terbakar, maka berikanlah ia kepadanya.\""
  },
  {
    "id": 17316,
    "hadith_number": 2580,
    "tajuk_hadith": "Tiga Golongan yang Allah Tidak Akan Berbicara pada Hari Kiamat",
    "perawi_melayu": "Daripada Abu Hurairah",
    "english_text": "\"The Messenger of Allah said: \"There are three to whom Allah, it Mighty and Sublime, with not speak on the Day of Resurrection: An old man who commits adultery, a poor man who is arrogant, and an Imam who tells lies.\"'",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا يَحْيَى، عَنِ ابْنِ عَجْلاَنَ، قَالَ سَمِعْتُ أَبِي يُحَدِّثُ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ ثَلاَثَةٌ لاَ يُكَلِّمُهُمُ اللَّهُ عَزَّ وَجَلَّ يَوْمَ الْقِيَامَةِ الشَّيْخُ الزَّانِي وَالْعَائِلُ الْمَزْهُوُّ وَالإِمَامُ الْكَذَّابُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Tiga golongan yang Allah ﷻ tidak akan berbicara dengan mereka pada Hari Kiamat: Seorang lelaki tua yang berzina, seorang miskin yang sombong, dan seorang imam yang berdusta.\""
  },
  {
    "id": 17317,
    "hadith_number": 2581,
    "tajuk_hadith": "Empat Golongan yang Dibenci Allah",
    "perawi_melayu": "Daripada Abu Hurairah bahawa Rasulullah ﷺ bersabda:",
    "english_text": "\"There are four whom Allah, the Mighty and Sublime, hates: The vendor who sells his wares by means of false oaths, the poor man who shows off, the old man who commits Zina and the Imam who is unjust.\"",
    "arabic_text": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا عَارِمٌ، قَالَ حَدَّثَنَا حَمَّادٌ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَرْبَعَةٌ يُبْغِضُهُمُ اللَّهُ عَزَّ وَجَلَّ الْبَيَّاعُ الْحَلاَّفُ وَالْفَقِيرُ الْمُخْتَالُ وَالشَّيْخُ الزَّانِي وَالإِمَامُ الْجَائِرُ ‏\"‏ ‏.‏",
    "malay_translation": "Ada empat golongan yang dibenci oleh Allah ﷻ: Penjual yang bersumpah palsu, orang miskin yang sombong, orang tua yang berzina, dan imam yang zalim."
  },
  {
    "id": 17318,
    "hadith_number": 2582,
    "tajuk_hadith": "Ganjaran Penjaga Balu dan Miskin",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، قَالَ حَدَّثَنَا مَالِكٌ، عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ السَّاعِي عَلَى الأَرْمَلَةِ وَالْمِسْكِينِ كَالْمُجَاهِدِ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Orang yang berusaha untuk menjaga seorang balu atau orang miskin adalah seperti orang yang berjihad di jalan Allah, Yang Maha Perkasa lagi Maha Agung.\""
  },
  {
    "id": 17319,
    "hadith_number": 2583,
    "tajuk_hadith": "Nabi SAW Mengagihkan Harta dan Amaran Terhadap Golongan Khawarij",
    "perawi_melayu": "Abu Sa'eed Al-Khudri berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، عَنْ أَبِي الأَحْوَصِ، عَنْ سَعِيدِ بْنِ مَسْرُوقٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي نُعْمٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ بَعَثَ عَلِيٌّ وَهُوَ بِالْيَمَنِ بِذُهَيْبَةٍ بِتُرْبَتِهَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَسَمَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ أَرْبَعَةِ نَفَرٍ الأَقْرَعِ بْنِ حَابِسٍ الْحَنْظَلِيِّ وَعُيَيْنَةَ بْنِ بَدْرٍ الْفَزَارِيِّ وَعَلْقَمَةَ بْنِ عُلاَثَةَ الْعَامِرِيِّ ثُمَّ أَحَدِ بَنِي كِلاَبٍ وَزَيْدٍ الطَّائِيِّ ثُمَّ أَحَدِ بَنِي نَبْهَانَ فَغَضِبَتْ قُرَيْشٌ وَقَالَ مَرَّةً أُخْرَى صَنَادِيدُ قُرَيْشٍ فَقَالُوا تُعْطِي صَنَادِيدَ نَجْدٍ وَتَدَعُنَا ‏.‏ قَالَ ‏\"‏ إِنَّمَا فَعَلْتُ ذَلِكَ لأَتَأَلَّفَهُمْ ‏\"‏ ‏.‏ فَجَاءَ رَجُلٌ كَثُّ اللِّحْيَةِ مُشْرِفُ الْوَجْنَتَيْنِ غَائِرُ الْعَيْنَيْنِ نَاتِئُ الْجَبِينِ مَحْلُوقُ الرَّأْسِ فَقَالَ اتَّقِ اللَّهَ يَا مُحَمَّدُ ‏.‏ قَالَ ‏\"‏ فَمَنْ يُطِعِ اللَّهَ عَزَّ وَجَلَّ إِنْ عَصَيْتُهُ أَيَأْمَنُنِي عَلَى أَهْلِ الأَرْضِ وَلاَ تَأْمَنُونِي ‏\"‏ ‏.‏ ثُمَّ أَدْبَرَ الرَّجُلُ فَاسْتَأْذَنَ رَجُلٌ مِنَ الْقَوْمِ فِي قَتْلِهِ يَرَوْنَ أَنَّهُ خَالِدُ بْنُ الْوَلِيدِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنْ ضِئْضِئِ هَذَا قَوْمًا يَقْرَءُونَ الْقُرْآنَ لاَ يُجَاوِزُ حَنَاجِرَهُمْ يَقْتُلُونَ أَهْلَ الإِسْلاَمِ وَيَدَعُونَ أَهْلَ الأَوْثَانِ يَمْرُقُونَ مِنَ الإِسْلاَمِ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ لَئِنْ أَدْرَكْتُهُمْ لأَقْتُلَنَّهُمْ قَتْلَ عَادٍ ‏\"‏ ‏.‏",
    "malay_translation": "Diriwayatkan daripada Abu Sa'eed Al-Khudri, beliau berkata: Ali pernah mengirimkan sekeping emas yang masih bercampur dengan tanah dari Yaman kepada Rasulullah SAW, lalu Rasulullah SAW membahagikannya kepada empat orang: Al-Aqra' bin Habis Al-Hanzali, 'Uyaynah bin Badr Al-Fazari, 'Alqamah bin 'Ulathah Al- 'Amiri, yang berasal dari Bani Kilab dan Zaid Al-Ta'I yang berasal dari Bani Nabhan. Kaum Quraisy - dan pada satu riwayat lain menyebut: para pembesar Quraisy - menjadi marah dan berkata: 'Engkau memberikan kepada pembesar-pembesar Najd, dengan tujuan untuk melembutkan hati mereka terhadap Islam.' Kemudian datanglah seorang lelaki yang berjanggut tebal, pipinya menonjol, dan kepalanya dicukur, lalu berkata: 'Bertakwalah kepada Allah, wahai Muhammad!' Baginda SAW bersabda: 'Siapakah yang akan mentaati Allah jika aku mengingkari-Nya? (Adakah adil) Dia telah mempercayakan aku terhadap seluruh penduduk bumi, tetapi kamu tidak mempercayaiku?' Kemudian lelaki itu pergi. Seorang lelaki dari kalangan sahabat, yang mereka (para perawi) berpendapat ialah Khalid bin Al-Walid, meminta izin untuk membunuhnya. Rasulullah SAW bersabda: 'Sesungguhnya akan keluar dari keturunan lelaki ini suatu kaum yang membaca Al-Quran, tetapi tidak sampai ke kerongkong mereka. Mereka akan membunuh umat Islam, tetapi membiarkan penyembah berhala, dan mereka keluar dari Islam seperti anak panah yang menembusi badan sasaran. Jika aku sempat bertemu dengan mereka, pasti akan aku bunuh mereka seperti kaum 'Ad dibunuh.'"
  },
  {
    "id": 17320,
    "hadith_number": 2584,
    "tajuk_hadith": "Hukum Meminta Bantuan Kewangan dalam Tiga Situasi",
    "perawi_melayu": "Qubaisah bin Mukhariq",
    "english_text": "\"I undertook a financial \nresponsibility.  Then I came to the Prophet and asked him (for help) concerning that. He said: 'Asking (for money) is not permissible except for three: A man who undertakes a financial responsibility between people; he may ask for help with that until the matter is settled, then he should refrain (from asking).\"'",
    "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ، عَنْ حَمَّادٍ، عَنْ هَارُونَ بْنِ رِئَابٍ، قَالَ حَدَّثَنِي كِنَانَةُ بْنُ نُعَيْمٍ، ح وَأَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، - وَاللَّفْظُ لَهُ - قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ هَارُونَ، عَنْ كِنَانَةَ بْنِ نُعَيْمٍ، عَنْ قَبِيصَةَ بْنِ مُخَارِقٍ، قَالَ تَحَمَّلْتُ حَمَالَةً فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَسَأَلْتُهُ فِيهَا فَقَالَ ‏\n\"‏ إِنَّ الْمَسْأَلَةَ لاَ تَحِلُّ إِلاَّ لِثَلاَثَةٍ رَجُلٍ تَحَمَّلَ بِحَمَالَةٍ بَيْنَ قَوْمٍ فَسَأَلَ فِيهَا حَتَّى يُؤَدِّيَهَا ثُمَّ يُمْسِكَ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Qubaisah bin Mukhariq, beliau berkata: \"Saya memikul tanggungjawab kewangan (hamalah). Kemudian saya datang kepada Nabi SAW dan meminta bantuan berkaitan dengannya. Baginda bersabda: 'Meminta-minta (wang) tidak halal kecuali bagi tiga golongan: Seorang lelaki yang memikul tanggungjawab kewangan antara orang ramai; dia boleh meminta bantuan sehingga urusan itu selesai, kemudian dia hendaklah berhenti (daripada meminta).'"
  },
  {
    "id": 17321,
    "hadith_number": 2585,
    "tajuk_hadith": "Hukum Meminta Bantuan Kewangan dalam Islam",
    "perawi_melayu": "Qubaisah bin Mukhariq",
    "english_text": "\"I undertook a financial responsibility, then I came to the Prophet and asked him (for help) concerning that. He said: 'Hold on, o Qubaisah! When we get some charity we will give you some.' Then the Messenger of Allah said: 'O Qubaisah, charity is not permissible except for one of three: A man who undertakes a financial responsibility, so it is permissible for him to be given charity until he finds means to make him independent and to suffice him; a man who was stricken by calamity and his wealth was destroyed, so it is permissible for him to ask for help until he has enough to keep him going, them he should refrain from asking; and a man who is stricken with poverty and three wise men from among his own people testily that so-and-so is in desperate need, then it is permissible for him to ask for help until he finds means to make him independent and to suffice him. Asking for help in cases other than these, O Qubaisah, is unlawful, and the one who takes it is consuming it unlawfully.\"'",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ النَّضْرِ بْنِ مُسَاوِرٍ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ هَارُونَ بْنِ رِئَابٍ، قَالَ حَدَّثَنِي كِنَانَةُ بْنُ نُعَيْمٍ، عَنْ قَبِيصَةَ بْنِ مُخَارِقٍ، قَالَ تَحَمَّلْتُ حَمَالَةً فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَسْأَلُهُ فِيهَا فَقَالَ ‏\"‏ أَقِمْ يَا قَبِيصَةُ حَتَّى تَأْتِيَنَا الصَّدَقَةُ فَنَأْمُرَ لَكَ ‏\"‏ ‏.‏ قَالَ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا قَبِيصَةُ إِنَّ الصَّدَقَةَ لاَ تَحِلُّ إِلاَّ لأَحَدِ ثَلاَثَةٍ رَجُلٍ تَحَمَّلَ حَمَالَةً فَحَلَّتْ لَهُ الْمَسْأَلَةُ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ أَوْ سِدَادًا مِنْ عَيْشٍ وَرَجُلٍ أَصَابَتْهُ جَائِحَةٌ فَاجْتَاحَتْ مَالَهُ فَحَلَّتْ لَهُ الْمَسْأَلَةُ حَتَّى يُصِيبَهَا ثُمَّ يُمْسِكَ وَرَجُلٍ أَصَابَتْهُ فَاقَةٌ حَتَّى يَشْهَدَ ثَلاَثَةٌ مِنْ ذَوِي الْحِجَا مِنْ قَوْمِهِ قَدْ أَصَابَتْ فُلاَنًا فَاقَةٌ فَحَلَّتْ لَهُ الْمَسْأَلَةُ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ أَوْ سِدَادًا مِنْ عَيْشٍ فَمَا سِوَى هَذَا مِنَ الْمَسْأَلَةِ يَا قَبِيصَةُ سُحْتٌ يَأْكُلُهَا صَاحِبُهَا سُحْتًا ‏\"‏ ‏.‏",
    "malay_translation": "“Aku mengambil tanggungjawab kewangan, kemudian aku datang kepada Nabi ﷺ dan meminta bantuan mengenai hal itu. Baginda bersabda: ‘Bersabarlah, wahai Qubaisah! Apabila kami menerima sedekah, kami akan memberikan kepadamu.’ Kemudian Rasulullah ﷺ bersabda: ‘Wahai Qubaisah, sedekah tidak halal melainkan bagi salah satu daripada tiga golongan: Seorang lelaki yang mengambil tanggungjawab kewangan, maka halal baginya meminta bantuan sehingga dia mempunyai kecukupan; Seorang lelaki yang ditimpa musibah yang memusnahkan hartanya, maka halal baginya meminta bantuan sehingga dia mempunyai cukup untuk meneruskan kehidupannya, kemudian dia hendaklah berhenti meminta; dan Seorang lelaki yang ditimpa kemiskinan dan tiga orang yang bijak daripada kaumnya bersaksi bahawa si fulan sangat memerlukan bantuan, maka halal baginya meminta bantuan sehingga dia mempunyai kecukupan. Meminta bantuan selain daripada kes-kes ini, wahai Qubaisah, adalah haram, dan orang yang mengambilnya memakannya secara haram.”"
  },
  {
    "id": 17322,
    "hadith_number": 2586,
    "tajuk_hadith": "Kesan Fitnah Dunia dan Penggunaan Harta",
    "perawi_melayu": "Abu Sa'eed Al-Khudri",
    "english_text": "",
    "arabic_text": "أَخْبَرَنِي زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، قَالَ أَخْبَرَنِي هِشَامٌ، قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي هِلاَلٌ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ جَلَسَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الْمِنْبَرِ وَجَلَسْنَا حَوْلَهُ فَقَالَ ‏\"‏ إِنَّمَا أَخَافُ عَلَيْكُمْ مِنْ بَعْدِي مَا يُفْتَحُ لَكُمْ مِنْ زَهْرَةٍ ‏\"‏ ‏.‏ وَذَكَرَ الدُّنْيَا وَزِينَتَهَا فَقَالَ رَجُلٌ أَوَيَأْتِي الْخَيْرُ بِالشَّرِّ فَسَكَتَ عَنْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقِيلَ لَهُ مَا شَأْنُكَ تُكَلِّمُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَلاَ يُكَلِّمُكَ ‏.‏ قَالَ وَرَأَيْنَا أَنَّهُ يُنْزَلُ عَلَيْهِ فَأَفَاقَ يَمْسَحُ الرُّحَضَاءَ وَقَالَ ‏\"‏ أُشَاهِدُ السَّائِلَ إِنَّهُ لاَ يَأْتِي الْخَيْرُ بِالشَّرِّ وَإِنَّ مِمَّا يُنْبِتُ الرَّبِيعُ يَقْتُلُ أَوْ يُلِمُّ إِلاَّ آكِلَةُ الْخَضِرِ فَإِنَّهَا أَكَلَتْ حَتَّى إِذَا امْتَدَّتْ خَاصِرَتَاهَا اسْتَقْبَلَتْ عَيْنَ الشَّمْسِ فَثَلَطَتْ ثُمَّ بَالَتْ ثُمَّ رَتَعَتْ وَإِنَّ هَذَا الْمَالَ خَضِرَةٌ حُلْوَةٌ وَنِعْمَ صَاحِبُ الْمُسْلِمِ هُوَ إِنْ أَعْطَى مِنْهُ الْيَتِيمَ وَالْمِسْكِينَ وَابْنَ السَّبِيلِ وَإِنَّ الَّذِي يَأْخُذُهُ بِغَيْرِ حَقِّهِ كَالَّذِي يَأْكُلُ وَلاَ يَشْبَعُ وَيَكُونُ عَلَيْهِ شَهِيدًا يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ziyad bin Ayyub berkata, telah menceritakan kepada kami Ismail bin 'Ulayyah berkata, telah menceritakan kepada kami Hisyam berkata, telah menceritakan kepada kami Yahya bin Abu Kathir berkata, telah menceritakan kepada kami Hilal dari 'Ata' bin Yasar dari Abu Sa'id Al-Khudri, dia berkata: \"Rasulullah ﷺ duduk di atas mimbar dan kami duduk di sekelilingnya. Kemudian Baginda bersabda: \"Sesungguhnya yang paling aku takuti atas kalian sepeninggalku adalah terbukanya perhiasan dunia terhadap kalian.\" Kemudian Baginda menyebutkan tentang dunia dan perhiasannya. Lalu seorang lelaki berkata: \"Adakah kebaikan itu akan mendatangkan keburukan?\" Maka Rasulullah ﷺ pun diam. Lalu dikatakan kepadanya: \"Ada apa denganmu? Engkau berbicara kepada Rasulullah ﷺ sedangkan beliau tidak berbicara kepadamu?\" Kami melihat seolah-olah wahyu sedang diturunkan kepadanya. Kemudian beliau tersedar, lalu mengusap peluhnya seraya bersabda: \"Aku tahu apa yang ditanyakan orang tadi, bahawa kebaikan tidak akan mendatangkan keburukan. Sesungguhnya di antara apa yang tumbuh di musim bunga ada yang boleh membunuh atau menyakitkan, kecuali tumbuhan Al-Khadir. Apabila ia memakannya sehingga perutnya mengembung, lalu ia menghadap matahari, kemudian mengeluarkan najis dan kencing, lalu ia mula meragut rumput kembali. Sesungguhnya harta ini adalah hijau dan manis. Alangkah baiknya harta seorang Muslim jika dia memberikan kepada anak yatim, orang miskin, dan orang yang dalam perjalanan. Dan orang yang mengambilnya dengan cara yang tidak benar adalah seperti orang yang makan tetapi tidak pernah kenyang, dan akan menjadi saksi baginya pada Hari Kiamat.\""
  },
  {
    "id": 17323,
    "hadith_number": 2587,
    "tajuk_hadith": "Sedekah kepada Orang Miskin dan Saudara Mara",
    "perawi_melayu": "Diriwayatkan dari Salman bin 'Amir bahawa Nabi ﷺ bersabda:",
    "english_text": "\"Giving charity to a poor person is charity, and (giving) to a relative is two things, charity and upholding the ties of kinship.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ حَفْصَةَ، عَنْ أُمِّ الرَّائِحِ، عَنْ سَلْمَانَ بْنِ عَامِرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الصَّدَقَةَ عَلَى الْمِسْكِينِ صَدَقَةٌ وَعَلَى ذِي الرَّحِمِ اثْنَتَانِ صَدَقَةٌ وَصِلَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "“Sesungguhnya sedekah kepada orang miskin adalah sedekah, dan (sedekah) kepada saudara mara adalah dua (ganjaran), sedekah dan menghubungkan silaturahim.”"
  },
  {
    "id": 17324,
    "hadith_number": 2588,
    "tajuk_hadith": "Sedekah Wanita dan Ganjaran Mengukuhkan Silaturahim",
    "perawi_melayu": "Zainab, isteri 'Abdullah",
    "english_text": "The Messenger of Allah said to women: 'Give charity, even from your jewelry. 'Abdullah was not a wealthy man and she said to him: 'Can I spend my charity on you and on my brother's children who are orphans? 'Abdullah said: 'Ask the Messenger of Allah about that.' She said: So I went to the Messenger of Allah, and at his door I found a woman from among the Ansar who was also called Zainab, and she was asking about the same matter as I was. Bilal came out to us and we said to him: Go to the Messenger of Allah and ask him about that, but do not tell him who we are. He went to the Messenger of Allah and he said:' Who are they?' He said: Zainab.' He said: 'Which Zainab?\" He said: 'Zainab Al-Ansariyyah.' Abdullah and Zainab Al-Ansariyyah.' He said: 'Yes, they will have two rewards, the reward for upholding the ties of kinship and the reward dfor giving charity.'",
    "arabic_text": "أَخْبَرَنَا بِشْرُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ أَبِي وَائِلٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ زَيْنَبَ، امْرَأَةِ عَبْدِ اللَّهِ قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِلنِّسَاءِ ‏\"‏ تَصَدَّقْنَ وَلَوْ مِنَ حُلِيِّكُنَّ ‏\"‏ ‏.‏ قَالَتْ وَكَانَ عَبْدُ اللَّهِ خَفِيفَ ذَاتِ الْيَدِ فَقَالَتْ لَهُ أَيَسَعُنِي أَنْ أَضَعَ صَدَقَتِي فِيكَ وَفِي بَنِي أَخٍ لِي يَتَامَى فَقَالَ عَبْدُ اللَّهِ سَلِي عَنْ ذَلِكَ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَتْ فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَإِذَا عَلَى بَابِهِ امْرَأَةٌ مِنَ الأَنْصَارِ يُقَالُ لَهَا زَيْنَبُ تَسْأَلُ عَمَّا أَسْأَلُ عَنْهُ فَخَرَجَ إِلَيْنَا بِلاَلٌ فَقُلْنَا لَهُ انْطَلِقْ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَلْهُ عَنْ ذَلِكَ وَلاَ تُخْبِرْهُ مَنْ نَحْنُ ‏.‏ فَانْطَلَقَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَنْ هُمَا ‏\"‏ ‏.‏ قَالَ زَيْنَبُ ‏.‏ قَالَ ‏\"‏ أَىُّ الزَّيَانِبِ ‏\"‏ ‏.‏ قَالَ زَيْنَبُ امْرَأَةُ عَبْدِ اللَّهِ وَزَيْنَبُ الأَنْصَارِيَّةُ قَالَ ‏\"‏ نَعَمْ لَهُمَا أَجْرَانِ أَجْرُ الْقَرَابَةِ وَأَجْرُ الصَّدَقَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda kepada kaum wanita: “Bersedekahlah kamu walaupun daripada perhiasan kamu.” Zainab, isteri Abdullah berkata: Abdullah bukanlah seorang yang kaya, lalu dia berkata: “Bolehkah saya menyedekahkan kepada kamu dan anak-anak saudara lelaki saya yang yatim?” Abdullah berkata: “Tanyakanlah perkara itu kepada Rasulullah ﷺ.” Zainab berkata: Kemudian saya pergi kepada Rasulullah ﷺ, dan di pintu baginda saya mendapati seorang wanita dari kalangan Ansar yang juga bernama Zainab, dan dia bertanya tentang perkara yang sama seperti yang saya tanyakan. Bilal keluar kepada kami dan kami berkata kepadanya: “Pergilah kepada Rasulullah ﷺ dan tanyakanlah tentang perkara itu, tetapi jangan beritahu baginda siapa kami.” Dia pergi kepada Rasulullah ﷺ dan baginda bersabda: “Siapakah mereka berdua?” Bilal menjawab: “Zainab.” Baginda bertanya: “Zainab yang mana?” Bilal menjawab: “Zainab Al-Ansariyyah.” Abdullah dan Zainab Al-Ansariyyah. Baginda bersabda: “Ya, mereka akan mendapat dua ganjaran, ganjaran kerana mengeratkan silaturahim dan ganjaran kerana bersedekah.”"
  },
  {
    "id": 17325,
    "hadith_number": 2589,
    "tajuk_hadith": "Keutamaan Bekerja Keras daripada Meminta-minta",
    "perawi_melayu": "Abu Hurairah berkata:",
    "english_text": "\"The Messenger of Allah said: 'if one of you were to carry a bundle of firewood on his back and sell it, that would be better than asking a man who may or may not give him something.\"'",
    "arabic_text": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ أَبَا عُبَيْدٍ، مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ أَزْهَرَ أَخْبَرَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لأَنْ يَحْتَزِمَ أَحَدُكُمْ حُزْمَةَ حَطَبٍ عَلَى ظَهْرِهِ فَيَبِيعَهَا خَيْرٌ مِنْ أَنْ يَسْأَلَ رَجُلاً فَيُعْطِيَهُ أَوْ يَمْنَعَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: 'Sekiranya seseorang daripada kamu membawa seberkas kayu api di atas belakangnya lalu menjualnya, itu adalah lebih baik daripada meminta daripada seseorang yang mungkin memberi atau enggan memberinya sesuatu.'"
  },
  {
    "id": 17326,
    "hadith_number": 2590,
    "tajuk_hadith": "Akibat Seseorang yang Terus-menerus Meminta-minta",
    "perawi_melayu": "'Abdullah bin 'Amr berkata:",
    "english_text": "\"The Messenger of Allah said: ' A man will keep on asking until on the Day of Resurrection he will come without even a shared of skin on his face. \"'",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ، عَنْ شُعَيْبٍ، عَنِ اللَّيْثِ بْنِ سَعْدٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ، قَالَ سَمِعْتُ حَمْزَةَ بْنَ عَبْدِ اللَّهِ، يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا يَزَالُ الرَّجُلُ يَسْأَلُ حَتَّى يَأْتِيَ يَوْمَ الْقِيَامَةِ لَيْسَ فِي وَجْهِهِ مُزْعَةٌ مِنْ لَحْمٍ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: 'Seseorang itu akan terus-menerus meminta-minta sehingga pada Hari Kiamat dia datang tanpa secebis kulit pun di wajahnya.'"
  },
  {
    "id": 17327,
    "hadith_number": 2591,
    "tajuk_hadith": "Kejahatan Meminta-Minta",
    "perawi_melayu": "Daripada A'idh bin 'Amr",
    "english_text": "a man came to the prophet and asked him and he gave him, and when he placed his foot on the threshold the Messenger of Allah said: \"If you knew how bad begging is, no one would go to anyone else and ask him for anything.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُثْمَانَ بْنِ أَبِي صَفْوَانَ الثَّقَفِيُّ، قَالَ حَدَّثَنَا أُمَيَّةُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ بِسْطَامِ بْنِ مُسْلِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ خَلِيفَةَ، عَنْ عَائِذِ بْنِ عَمْرٍو، أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم فَسَأَلَهُ فَأَعْطَاهُ فَلَمَّا وَضَعَ رِجْلَهُ عَلَى أُسْكُفَّةِ الْبَابِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَوْ تَعْلَمُونَ مَا فِي الْمَسْأَلَةِ مَا مَشَى أَحَدٌ إِلَى أَحَدٍ يَسْأَلُهُ شَيْئًا ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki datang kepada Nabi ﷺ dan meminta daripada baginda, lalu baginda memberinya. Apabila lelaki itu meletakkan kakinya di ambang pintu, Rasulullah ﷺ bersabda: \"Sekiranya kamu mengetahui betapa buruknya meminta-minta, nescaya tiada seorang pun akan pergi kepada sesiapa dan meminta sesuatu daripadanya.\""
  },
  {
    "id": 17328,
    "hadith_number": 2592,
    "tajuk_hadith": "Meminta Bantuan: Hanya kepada Orang Soleh",
    "perawi_melayu": "Diriwayatkan daripada Ibn Al-Firasi bahawa Al-Firasi berkata kepada Rasulullah ﷺ:",
    "english_text": "\"Shall I ask people (for help), O Messenger of Allah?\" He said: \"No, but if you have no alternative but to ask, then ask the righteous.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنْ بَكْرِ بْنِ سَوَادَةَ، عَنْ مُسْلِمِ بْنِ مَخْشِيٍّ، عَنِ ابْنِ الْفِرَاسِيِّ، أَنَّ الْفِرَاسِيَّ، قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَسْأَلُ يَا رَسُولَ اللَّهِ قَالَ ‏\n\"‏ لاَ وَإِنْ كُنْتَ سَائِلاً لاَ بُدَّ فَاسْأَلِ الصَّالِحِينَ ‏\"‏ ‏.‏",
    "malay_translation": "“Bolehkah saya meminta bantuan daripada orang lain, wahai Rasulullah?” Baginda bersabda: “Jangan, tetapi jika kamu tiada pilihan melainkan meminta, maka mintalah daripada orang-orang yang soleh.”"
  },
  {
    "id": 17329,
    "hadith_number": 2593,
    "tajuk_hadith": "Keutamaan Sabar dan Menahan Diri Daripada Meminta-minta",
    "perawi_melayu": "Daripada Abu Sa'eed Al-Khudri",
    "english_text": "some of the Ansar asked the Messenger of Allah (for help) and he gave them (something). Then they asked him and he gave them, then when he had ran out he said: \"Whatever I have of good, I will never keep it from you, but whoever wants to refrain from asking, Allah, the Mighty and Sublime, will help him to do so, and whoever wants to be patient, Allah will help him to be patient. None is ever given anything better and more far-reaching than patience.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَطَاءِ بْنِ يَزِيدَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ نَاسًا، مِنَ الأَنْصَارِ سَأَلُوا رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَعْطَاهُمْ ثُمَّ سَأَلُوهُ فَأَعْطَاهُمْ حَتَّى إِذَا نَفِدَ مَا عِنْدَهُ قَالَ ‏\n\"‏ مَا يَكُونُ عِنْدِي مِنْ خَيْرٍ فَلَنْ أَدَّخِرَهُ عَنْكُمْ وَمَنْ يَسْتَعْفِفْ يُعِفَّهُ اللَّهُ عَزَّ وَجَلَّ وَمَنْ يَصْبِرْ يُصَبِّرْهُ اللَّهُ وَمَا أُعْطِيَ أَحَدٌ عَطَاءً هُوَ خَيْرٌ وَأَوْسَعُ مِنَ الصَّبْرِ ‏\"‏ ‏.‏",
    "malay_translation": "Beberapa orang Ansar meminta bantuan daripada Rasulullah ﷺ, lalu baginda memberi mereka (sesuatu). Kemudian mereka meminta lagi kepada baginda, lalu baginda memberi mereka. Setelah habis apa yang ada pada baginda, baginda bersabda: \"Apa sahaja kebaikan yang ada padaku, aku tidak sekali-kali akan menyembunyikannya daripada kamu, tetapi sesiapa yang mahu menahan diri daripada meminta-minta, Allah ﷻ akan membantunya untuk berbuat demikian, dan sesiapa yang mahu bersabar, Allah akan membantunya untuk bersabar. Tidaklah seseorang itu diberi sesuatu pemberian yang lebih baik dan lebih luas daripada kesabaran.\""
  },
  {
    "id": 17330,
    "hadith_number": 2594,
    "tajuk_hadith": "Keutamaan Bekerja Keras dan Menghindari Meminta-minta",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah bahawa Rasulullah ﷺ bersabda:",
    "english_text": "\"By the One in Whose hand is my soul, if one of you were to take a rope and gather firewood on his back that would be better for him than coming to a man to whom Allah, the Mighty and Sublime, has given of His bounty and asking him (for help). Which he may or may not give.",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ شُعَيْبٍ، قَالَ أَنْبَأَنَا مَعْنٌ، قَالَ أَنْبَأَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لأَنْ يَأْخُذَ أَحَدُكُمْ حَبْلَهُ فَيَحْتَطِبَ عَلَى ظَهْرِهِ خَيْرٌ لَهُ مِنْ أَنْ يَأْتِيَ رَجُلاً أَعْطَاهُ اللَّهُ عَزَّ وَجَلَّ مِنْ فَضْلِهِ فَيَسْأَلَهُ أَعْطَاهُ أَوْ مَنَعَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Demi (Allah) yang jiwaku berada di tangan-Nya, sekiranya salah seorang daripada kamu mengambil tali dan mengumpul kayu api di atas belakangnya, itu adalah lebih baik baginya daripada datang kepada seseorang yang Allah 'Azza wa Jalla telah berikan kepadanya daripada kurnia-Nya, lalu meminta (bantuan) daripadanya. Sama ada dia memberi atau enggan."
  },
  {
    "id": 17331,
    "hadith_number": 2595,
    "tajuk_hadith": "Jaminan Untuk Syurga: Tidak Meminta-Minta",
    "perawi_melayu": "Diriwayatkan dari Thawban",
    "english_text": "\"The Messenger of Allah said: 'Whoever can promise me one thing. Paradise will be his.\" (One of the narrators) Yahya said:  \"Here a statement which means: That he will not ask the people for anything.\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، حَدَّثَنِي مُحَمَّدُ بْنُ قَيْسٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ مُعَاوِيَةَ، عَنْ ثَوْبَانَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ يَضْمَنْ لِي وَاحِدَةً وَلَهُ الْجَنَّةُ ‏\"‏ ‏.‏ قَالَ يَحْيَى هَا هُنَا كَلِمَةٌ مَعْنَاهَا أَنْ لاَ يَسْأَلَ النَّاسَ شَيْئًا ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: 'Sesiapa yang dapat menjamin kepadaku satu perkara, maka syurga adalah baginya.' (Salah seorang perawi) Yahya berkata: 'Di sini ada satu pernyataan yang bermaksud: Bahawa dia tidak akan meminta-minta daripada manusia apa-apa.'"
  },
  {
    "id": 17332,
    "hadith_number": 2596,
    "tajuk_hadith": "Hanya Tiga Keadaan yang Membolehkan Meminta Bantuan",
    "perawi_melayu": "Qabisah bin Mukhariq",
    "english_text": "\"I heard the Messenger of Allah says: 'It is not right to ask (for help) except in three cases: A man whose wealth has been destroyed by some calamity, so he asks until he gets enough to keep him going, then he refrains from asking: a man who undertakes a financial responsibility, and asks for help until he pays off whatever needs to be paid; and a man concerning whom three wise men from his own people swear by Allah that it is permissible for so-an-so to ask for help, so he asks until he has enough to be independent of means, then he refrains from asking. Apart from that. (asking) is unlawful.\"'",
    "arabic_text": "أَخْبَرَنَا هِشَامُ بْنُ عَمَّارٍ، قَالَ حَدَّثَنَا يَحْيَى، - وَهُوَ ابْنُ حَمْزَةَ - قَالَ حَدَّثَنِي الأَوْزَاعِيُّ، عَنْ هَارُونَ بْنِ رِئَابٍ، أَنَّهُ حَدَّثَهُ عَنْ أَبِي بَكْرٍ، عَنْ قَبِيصَةَ بْنِ مُخَارِقٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ تَصْلُحُ الْمَسْأَلَةُ إِلاَّ لِثَلاَثَةٍ رَجُلٍ أَصَابَتْ مَالَهُ جَائِحَةٌ فَيَسْأَلُ حَتَّى يُصِيبَ سِدَادًا مِنْ عَيْشٍ ثُمَّ يُمْسِكَ وَرَجُلٍ تَحَمَّلَ حَمَالَةً فَيَسْأَلُ حَتَّى يُؤَدِّيَ إِلَيْهِمْ حَمَالَتَهُمْ ثُمَّ يُمْسِكَ عَنِ الْمَسْأَلَةِ وَرَجُلٍ يَحْلِفُ ثَلاَثَةُ نَفَرٍ مِنْ قَوْمِهِ مِنْ ذَوِي الْحِجَا بِاللَّهِ لَقَدْ حَلَّتِ الْمَسْأَلَةُ لِفُلاَنٍ فَيَسْأَلُ حَتَّى يُصِيبَ قِوَامًا مِنْ مَعِيشَةٍ ثُمَّ يُمْسِكَ عَنِ الْمَسْأَلَةِ فَمَا سِوَى ذَلِكَ سُحْتٌ ‏\"‏ ‏.‏",
    "malay_translation": "Saya mendengar Rasulullah ﷺ bersabda: \"Tidak halal meminta-minta kecuali dalam tiga keadaan: Seseorang yang hartanya ditimpa musibah, lalu dia meminta sehingga mendapat kecukupan untuk menyara kehidupannya, kemudian dia berhenti meminta; Seseorang yang memikul tanggungjawab kewangan, lalu dia meminta sehingga dia dapat melunaskan tanggungjawabnya, kemudian dia berhenti meminta; Dan seseorang yang disaksikan oleh tiga orang yang bijak dari kaumnya dengan bersumpah dengan nama Allah bahawa meminta itu halal bagi si fulan, maka dia meminta sehingga dia mempunyai kecukupan untuk hidup berdikari, kemudian dia berhenti meminta. Selain dari itu, (meminta-minta) adalah haram.\""
  },
  {
    "id": 17333,
    "hadith_number": 2597,
    "tajuk_hadith": "Hukuman Bagi Mereka yang Meminta-minta Sedangkan Mereka Berkecukupan",
    "perawi_melayu": "Diriwayatkan daripada Abdullah bin Mas'ud r.a.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، قَالَ حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ، عَنْ حَكِيمِ بْنِ جُبَيْرٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ سَأَلَ وَلَهُ مَا يُغْنِيهِ جَاءَتْ خُمُوشًا أَوْ كُدُوحًا فِي وَجْهِهِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ قِيلَ يَا رَسُولَ اللَّهِ وَمَاذَا يُغْنِيهِ أَوْ مَاذَا أَغْنَاهُ قَالَ ‏\"‏ خَمْسُونَ دِرْهَمًا أَوْ حِسَابُهَا مِنَ الذَّهَبِ ‏\"‏ ‏.‏ قَالَ يَحْيَى قَالَ سُفْيَانُ وَسَمِعْتُ زُبَيْدًا يُحَدِّثُ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Sesiapa yang meminta-minta sedangkan dia mempunyai kecukupan, maka pada Hari Kiamat akan datang dengan luka-luka atau kesan-kesan luka di wajahnya.\" Ditanyakan: \"Wahai Rasulullah, apakah yang dimaksudkan dengan kecukupan?\" Baginda bersabda: \"Lima puluh Dirham atau nilainya daripada emas.\""
  },
  {
    "id": 17334,
    "hadith_number": 2598,
    "tajuk_hadith": "Larangan Meminta dengan Mendesak dan Pemberian yang Tidak Ikhlas",
    "perawi_melayu": "Diriwayatkan daripada Mu'awiyah bahawa Rasulullah ﷺ bersabda:",
    "english_text": "\"Do not be demanding when asking. If one of you asks me for anything and I give it reluctantly, there will be no blessing in it.\"",
    "arabic_text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ، قَالَ أَنْبَأَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ وَهْبِ بْنِ مُنَبِّهٍ، عَنْ أَخِيهِ، عَنْ مُعَاوِيَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تُلْحِفُوا فِي الْمَسْأَلَةِ وَلاَ يَسْأَلْنِي أَحَدٌ مِنْكُمْ شَيْئًا وَأَنَا لَهُ كَارِهٌ فَيُبَارَكُ لَهُ فِيمَا أَعْطَيْتُهُ ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah kamu meminta dengan mendesak. Jika salah seorang daripada kamu meminta sesuatu daripada-Ku, dan Aku memberikannya dengan berat hati, maka tidak akan ada keberkatan padanya."
  },
  {
    "id": 17335,
    "hadith_number": 2599,
    "tajuk_hadith": "Kisah Meminta-Minta Ketika Memiliki Harta",
    "perawi_melayu": "Telah diriwayatkan daripada 'Amr bin Shu'aib, daripada bapanya, daripada datuknya:",
    "english_text": "\"The Messenger of Allah said:  'Whoever asks when he has forty Dirhams I being too demanding when asking.\"'",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ أَنْبَأَنَا يَحْيَى بْنُ آدَمَ، عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ، عَنْ دَاوُدَ بْنِ شَابُورَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ سَأَلَ وَلَهُ أَرْبَعُونَ دِرْهَمًا فَهُوَ الْمُلْحِفُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: 'Sesiapa yang meminta-minta sedangkan dia memiliki empat puluh Dirham, maka dia dianggap terlalu mendesak dalam meminta.'"
  },
  {
    "id": 17336,
    "hadith_number": 2600,
    "tajuk_hadith": "Keutamaan Kehidupan Sederhana dan Menahan Diri daripada Meminta-minta",
    "perawi_melayu": "Diriwayatkan daripada 'Abdur-Rahman bin Abu Sa'eed Al-Khudri bahawa bapanya berkata:",
    "english_text": "\"Not Available\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا ابْنُ أَبِي الرِّجَالِ، عَنْ عُمَارَةَ بْنِ غَزِيَّةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنْ أَبِيهِ، قَالَ سَرَّحَتْنِي أُمِّي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَتَيْتُهُ وَقَعَدْتُ فَاسْتَقْبَلَنِي وَقَالَ ‏\n\"‏ مَنِ اسْتَغْنَى أَغْنَاهُ اللَّهُ عَزَّ وَجَلَّ وَمَنِ اسْتَعَفَّ أَعَفَّهُ اللَّهُ عَزَّ وَجَلَّ وَمَنِ اسْتَكْفَى كَفَاهُ اللَّهُ عَزَّ وَجَلَّ وَمَنْ سَأَلَ وَلَهُ قِيمَةُ أُوقِيَّةٍ فَقَدْ أَلْحَفَ ‏\"‏ ‏.‏ فَقُلْتُ نَاقَتِي الْيَاقُوتَةُ خَيْرٌ مِنْ أُوقِيَّةٍ فَرَجَعْتُ وَلَمْ أَسْأَلْهُ ‏.‏",
    "malay_translation": "Ibuku menghantarku kepada Rasulullah ﷺ, lalu aku datang dan duduk. Baginda berpaling kepadaku dan bersabda: 'Sesiapa yang ingin merasa cukup, Allah ﷻ akan mencukupkannya. Sesiapa yang ingin menahan diri daripada meminta-minta, Allah ﷻ akan membantunya untuk menahan diri. Sesiapa yang berasa cukup dengan apa yang ada padanya, Allah ﷻ akan mencukupkannya. Sesiapa yang meminta sedangkan dia memiliki sesuatu yang bernilai satu Uqiyah, maka sesungguhnya dia telah keterlaluan.' Aku berkata: 'Untaku, Al-Yaqutah, nilainya lebih daripada satu Uqiyah,' lalu aku kembali dan tidak meminta apa-apa kepada Baginda."
  },
  {
    "id": 17337,
    "hadith_number": 2601,
    "tajuk_hadith": "Kisah Seorang Sahabat yang Meminta Makanan dari Rasulullah ﷺ",
    "perawi_melayu": "Diriwayatkan dari 'Ata' bin Yasar bahawa seorang lelaki dari Bani Asad berkata:",
    "english_text": "\"My wife and I stopped at Baqi Al-Gharqad, and my wife said to me: 'Go to the Messenger of Allah and ask him to give us something to eat. ' So I went to the Messenger of Allah and found a man with him asking him (for something), and the Messenger of Allah was saying: 'I do not have anything to give to you.' The man turned away angrily, saying: 'You only give to those you want. 'The Messenger of Allah said: 'He is angry with me because I did not have anything to give him.  Whoever asks of you and he has an Uqiyah or its equivalent, then he has been too demanding in asking.\"' Al-Asadi said: I said: 'Our milch-camel is worth more than an Uqiyah, 'and an Uqiyah is forty Dirhams. \"So I went back and did not ask him for anything. Then the Messenger of Allah got some barley and raisins after that, and he gave us a share of them, until Allah, the Mighty and Sublime, made us independent of means.\"",
    "arabic_text": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ الْقَاسِمِ، قَالَ أَنْبَأَنَا مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ رَجُلٍ، مِنْ بَنِي أَسَدٍ قَالَ نَزَلْتُ أَنَا وَأَهْلِي، بِبَقِيعِ الْغَرْقَدِ فَقَالَتْ لِي أَهْلِي اذْهَبْ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَلْهُ لَنَا شَيْئًا نَأْكُلْهُ ‏.‏ فَذَهَبْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَوَجَدْتُ عِنْدَهُ رَجُلاً يَسْأَلُهُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ أَجِدُ مَا أُعْطِيكَ ‏\"‏ ‏.‏ فَوَلَّى الرَّجُلُ عَنْهُ وَهُوَ مُغْضَبٌ وَهُوَ يَقُولُ لَعَمْرِي إِنَّكَ لَتُعْطِي مَنْ شِئْتَ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّهُ لَيَغْضَبُ عَلَىَّ أَنْ لاَ أَجِدَ مَا أُعْطِيهِ مَنْ سَأَلَ مِنْكُمْ وَلَهُ أُوقِيَّةٌ أَوْ عِدْلُهَا فَقَدْ سَأَلَ إِلْحَافًا ‏\"‏ ‏.‏ قَالَ الأَسَدِيُّ فَقُلْتُ لَلَقْحَةٌ لَنَا خَيْرٌ مِنْ أُوقِيَّةٍ - وَالأُوقِيَّةُ أَرْبَعُونَ دِرْهَمًا - فَرَجَعْتُ وَلَمْ أَسْأَلْهُ فَقَدِمَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بَعْدَ ذَلِكَ شَعِيرٌ وَزَبِيبٌ فَقَسَّمَ لَنَا مِنْهُ حَتَّى أَغْنَانَا اللَّهُ عَزَّ وَجَلَّ ‏.‏",
    "malay_translation": "Daripada 'Ata' bin Yasar, bahawa seorang lelaki dari Bani Asad berkata: \"Saya dan keluarga saya singgah di Baqi Al-Gharqad. Isteri saya berkata kepada saya: 'Pergilah kepada Rasulullah ﷺ dan mintalah kepada baginda sesuatu untuk kami makan.' Lalu saya pergi kepada Rasulullah ﷺ dan mendapati ada seorang lelaki bersamanya sedang meminta (sesuatu) daripada baginda, dan Rasulullah ﷺ bersabda: 'Saya tidak mempunyai apa-apa untuk diberikan kepadamu.' Lelaki itu berpaling dengan marah sambil berkata: 'Engkau hanya memberi kepada mereka yang engkau mahu.' Rasulullah ﷺ bersabda: 'Dia marah kepada saya kerana saya tidak mempunyai apa-apa untuk diberikan kepadanya. Sesiapa yang meminta daripada kamu sedangkan dia mempunyai satu Uqiyah atau yang setara dengannya, maka sesungguhnya dia terlalu berlebihan dalam meminta.' Al-Asadi berkata: Saya berkata: 'Unta perahan kami lebih berharga daripada satu Uqiyah,' dan satu Uqiyah adalah empat puluh Dirham. Maka saya kembali dan tidak meminta apa-apa daripada baginda. Kemudian Rasulullah ﷺ mendapat sedikit barli dan kismis selepas itu, lalu baginda memberikan kami sebahagian daripadanya, sehingga Allah, Yang Maha Kuasa dan Maha Agung, menjadikan kami tidak memerlukan lagi."
  },
  {
    "id": 17338,
    "hadith_number": 2602,
    "tajuk_hadith": "Haram Memberi Sedekah Kepada Orang Kaya dan Sihat",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah",
    "english_text": "“The Messenger of Allah said: 'It is not permissible to give charity to a rich man (or one who is independent of means) or to one who is strong and healthy.'\"",
    "arabic_text": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، عَنْ أَبِي بَكْرٍ، عَنْ أَبِي حَصِينٍ، عَنْ سَالِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَحِلُّ الصَّدَقَةُ لِغَنِيٍّ وَلاَ لِذِي مِرَّةٍ سَوِيٍّ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: 'Tidak halal sedekah diberikan kepada orang kaya (atau yang berkemampuan) atau kepada orang yang kuat dan sihat.'"
  },
  {
    "id": 17339,
    "hadith_number": 2603,
    "tajuk_hadith": "Kisah Dua Lelaki Memohon Sedekah dan Penjelasan Rasulullah ﷺ",
    "perawi_melayu": "'Ubaidullah bin 'Adiyy bin Al-Khiyar meriwayatkan:",
    "english_text": "two men told him, that they came to the Messenger of Allah asking him for charity. He looked from one to the other and he saw that they were strong. The Messenger of Allah said: \"If you want, I will give you, but no rich man or one who is strong and able to earn has a share of it.\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا يَحْيَى، عَنْ هِشَامِ بْنِ عُرْوَةَ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عَدِيِّ بْنِ الْخِيَارِ، ‏.‏ أَنَّ رَجُلَيْنِ، حَدَّثَاهُ أَنَّهُمَا، أَتَيَا رَسُولَ اللَّهِ صلى الله عليه وسلم يَسْأَلاَنِهِ مِنَ الصَّدَقَةِ فَقَلَّبَ فِيهِمَا الْبَصَرَ - وَقَالَ مُحَمَّدٌ بَصَرَهُ - فَرَآهُمَا جَلْدَيْنِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنْ شِئْتُمَا وَلاَ حَظَّ فِيهَا لِغَنِيٍّ وَلاَ لِقَوِيٍّ مُكْتَسِبٍ ‏\"‏ ‏.‏",
    "malay_translation": "Dua orang lelaki menceritakan bahawa mereka datang kepada Rasulullah ﷺ memohon sedekah. Baginda memandang mereka dengan teliti dan mendapati mereka kuat. Rasulullah ﷺ bersabda: \"Jika kamu mahu, aku akan berikan, tetapi tiada bahagian dalam sedekah bagi orang kaya atau orang yang kuat dan mampu mencari rezeki.\""
  },
  {
    "id": 17340,
    "hadith_number": 2604,
    "tajuk_hadith": "Larangan Meminta-Minta Kecuali dalam Keadaan Darurat",
    "perawi_melayu": "Daripada Samurah bin Jundab",
    "english_text": "\"Not Available\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، قَالَ أَنْبَأَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ، عَنْ زَيْدِ بْنِ عُقْبَةَ، عَنْ سَمُرَةَ بْنِ جُنْدُبٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ الْمَسَائِلَ كُدُوحٌ يَكْدَحُ بِهَا الرَّجُلُ وَجْهَهُ فَمَنْ شَاءَ كَدَحَ وَجْهَهُ وَمَنْ شَاءَ تَرَكَ إِلاَّ أَنْ يَسْأَلَ الرَّجُلُ ذَا سُلْطَانٍ أَوْ شَيْئًا لاَ يَجِدُ مِنْهُ بُدًّا ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Sesungguhnya meminta-minta itu adalah parut yang menggores wajah seseorang. Barangsiapa yang mahu menggores wajahnya, maka biarlah dia meminta-minta. Dan barangsiapa yang tidak mahu, maka janganlah dia meminta-minta, kecuali jika seseorang itu meminta kepada Sultan, atau meminta sesuatu yang dia tidak dapat mengelakkannya.\""
  },
  {
    "id": 17341,
    "hadith_number": 2605,
    "tajuk_hadith": "Merayu Membawa Luka pada Hari Kiamat",
    "perawi_melayu": "Samurah bin Jundab",
    "english_text": "\"The Messenger of Allah said: 'Begging will be but lacerations on a man's face (on the Day of Resurrection). Unless he asks a man in authority or when he has no alternative.\"'",
    "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا وَكِيعٌ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الْمَلِكِ، عَنْ زَيْدِ بْنِ عُقْبَةَ، عَنْ سَمُرَةَ بْنِ جُنْدُبٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْمَسْأَلَةُ كَدٌّ يَكُدُّ بِهَا الرَّجُلُ وَجْهَهُ إِلاَّ أَنْ يَسْأَلَ الرَّجُلُ سُلْطَانًا أَوْ فِي أَمْرٍ لاَ بُدَّ مِنْهُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: 'Meminta-minta itu akan menjadi luka di wajah seseorang (pada Hari Kiamat). Kecuali jika dia meminta kepada orang yang berkuasa atau ketika dia tidak mempunyai pilihan lain.'"
  },
  {
    "id": 17342,
    "hadith_number": 2606,
    "tajuk_hadith": "Kebaikan Kekayaan yang Diperoleh dengan Rela Hati",
    "perawi_melayu": "Diriwayatkan bahawa Hakim bin Hizam berkata:",
    "english_text": "\"I asked the Messenger of  Allah and he gave me, then I asked him and he gave me, then I asked him and he gave me. Then he said: This wealth is attractive and sweet. Whoever takes it without insisting, it will be blessed for him, and whoever takes it with avarice, it will not be blessed for him. He is like one who eats and is not satisfied. And the upper hand is better than the lower hand.\"",
    "arabic_text": "أَخْبَرَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَلاَءِ بْنِ عَبْدِ الْجَبَّارِ، عَنْ سُفْيَانَ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ، عَنْ حَكِيمِ بْنِ حِزَامٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَعْطَانِي ثُمَّ سَأَلْتُهُ فَأَعْطَانِي ثُمَّ سَأَلْتُهُ فَأَعْطَانِي فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَا حَكِيمُ إِنَّ هَذَا الْمَالَ خَضِرَةٌ حُلْوَةٌ فَمَنْ أَخَذَهُ بِطِيبِ نَفْسٍ بُورِكَ لَهُ فِيهِ وَمَنْ أَخَذَهُ بِإِشْرَافِ نَفْسٍ لَمْ يُبَارَكْ لَهُ فِيهِ وَكَانَ كَالَّذِي يَأْكُلُ وَلاَ يَشْبَعُ وَالْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى ‏\"‏ ‏.‏",
    "malay_translation": "Saya meminta daripada Rasulullah ﷺ, lalu baginda memberi kepada saya, kemudian saya meminta lagi, dan baginda memberi lagi, kemudian saya meminta lagi, dan baginda memberi lagi. Kemudian baginda bersabda: \"Wahai Hakim, sesungguhnya harta ini adalah indah dan manis. Sesiapa yang mengambilnya dengan senang hati, maka ia akan diberkati baginya. Dan sesiapa yang mengambilnya dengan tamak, maka ia tidak akan diberkati baginya, dan dia seperti orang yang makan tetapi tidak pernah kenyang. Dan tangan yang memberi itu lebih baik daripada tangan yang meminta.\""
  },
  {
    "id": 17343,
    "hadith_number": 2607,
    "tajuk_hadith": "Keutamaan Memberi dan Bahaya Ketamakan Harta",
    "perawi_melayu": "Hakim bin Hizam",
    "english_text": "\"I asked the Messenger of Allah and he gave me, then I asked him and he gave me, then I asked him and he gave me. Then he said: 'O Kahim! This wealth is attractive and sweet. Whoever takes it without being greedy, it will be blessed for him, and whoever takes it with avarice, it will not be blessed for him. He is like one who eats and is not satisfied. And the upper hand is better than the lower hand.\"'",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا مِسْكِينُ بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ حَكِيمِ بْنِ حِزَامٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَعْطَانِي ثُمَّ سَأَلْتُهُ فَأَعْطَانِي ثُمَّ سَأَلْتُهُ فَأَعْطَانِي ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَا حَكِيمُ إِنَّ هَذَا الْمَالَ خَضِرَةٌ حُلْوَةٌ مَنْ أَخَذَهُ بِسَخَاوَةِ نَفْسٍ بُورِكَ لَهُ فِيهِ وَمَنْ أَخَذَهُ بِإِشْرَافِ النَّفْسِ لَمْ يُبَارَكْ لَهُ فِيهِ وَكَانَ كَالَّذِي يَأْكُلُ وَلاَ يَشْبَعُ وَالْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى ‏\"‏ ‏.‏",
    "malay_translation": "Aku meminta kepada Rasulullah ﷺ lalu baginda memberi kepadaku, kemudian aku meminta lagi dan baginda memberi lagi, kemudian aku meminta lagi dan baginda memberi lagi. Kemudian baginda bersabda: 'Wahai Hakim! Sesungguhnya harta ini adalah sesuatu yang menarik dan manis. Sesiapa yang mengambilnya dengan hati yang dermawan, maka akan diberkati baginya, dan sesiapa yang mengambilnya dengan ketamakan, maka tidak diberkati baginya. Dia seperti orang yang makan tetapi tidak pernah kenyang. Dan tangan yang di atas (memberi) adalah lebih baik daripada tangan yang di bawah (menerima).' "
  },
  {
    "id": 17344,
    "hadith_number": 2608,
    "tajuk_hadith": "Kurniaan Harta dan Sikap Terhadapnya",
    "perawi_melayu": "Hakim bin Hizam berkata:",
    "english_text": "\"I asked the Messenger of Allah and he gave me, then I asked him and he gave me. The he said: 'O Hakim, this wealth is attractive and sweet. Whoever takes it without being greedy, it will be blessed for him, and whoever takes it with avarice, it will be blessed for him. He is like one who eats and is not satisfied. And the upper hand is better than the lower hand.' I said: 'O Messenger of Allah! By the One Who sent you with the truth, I will never ask anyone for anything after you, until I depart this world. \"'",
    "arabic_text": "أَخْبَرَنِي الرَّبِيعُ بْنُ سُلَيْمَانَ بْنِ دَاوُدَ، قَالَ حَدَّثَنَا إِسْحَاقُ بْنُ بَكْرٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، وَسَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ حَكِيمَ بْنَ حِزَامٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَعْطَانِي ثُمَّ سَأَلْتُهُ فَأَعْطَانِي ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَا حَكِيمُ إِنَّ هَذَا الْمَالَ حُلْوَةٌ فَمَنْ أَخَذَهُ بِسَخَاوَةِ نَفْسٍ بُورِكَ لَهُ فِيهِ وَمَنْ أَخَذَهُ بِإِشْرَافِ نَفْسٍ لَمْ يُبَارَكْ لَهُ فِيهِ وَكَانَ كَالَّذِي يَأْكُلُ وَلاَ يَشْبَعُ وَالْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى ‏\"‏ ‏.‏ قَالَ حَكِيمٌ فَقُلْتُ يَا رَسُولَ اللَّهِ وَالَّذِي بَعَثَكَ بِالْحَقِّ لاَ أَرْزَأُ أَحَدًا بَعْدَكَ حَتَّى أُفَارِقَ الدُّنْيَا بِشَىْءٍ ‏.‏",
    "malay_translation": "Hakim bin Hizam berkata: \"Saya meminta daripada Rasulullah ﷺ, lalu Baginda memberi kepada saya. Kemudian saya meminta lagi, dan Baginda memberi lagi. Kemudian Rasulullah ﷺ bersabda: 'Wahai Hakim, sesungguhnya harta ini manis lagi menarik. Sesiapa yang mengambilnya dengan hati yang rela, maka akan diberkati baginya. Sesiapa yang mengambilnya dengan tamak, maka tidak diberkati baginya, dan dia seperti orang yang makan tetapi tidak kenyang. Tangan yang di atas (memberi) lebih baik daripada tangan yang di bawah (menerima).’ Saya berkata: ‘Wahai Rasulullah! Demi (Allah) yang mengutusmu dengan kebenaran, saya tidak akan meminta daripada sesiapa pun selepasmu, sehingga saya meninggalkan dunia ini dengan apa-apa pun.’"
  },
  {
    "id": 17345,
    "hadith_number": 2609,
    "tajuk_hadith": "Menerima Pemberian Tanpa Meminta",
    "perawi_melayu": "Ibn As-Sa'idi Al-Maliki",
    "english_text": "\"Umar bin Al-Khattab, may Allah be pleased with him, appointed me in charge of the Sadaqah. When I finished collecting it and handed it over to him, he ordered that I be given some payment. I said to him: 'I only did for the sake of Allah, the Mighty and Sublime, and my reward will be with Allah, the Mighty and Sublime.' He said: 'Take what I have given you: I did the same take during the time of the Messenger of Allah, and I said what you have said, but the Messenger of Allah said to me: \"If you are given something without asking for it, then keep (some) and give (some) in charity.\"'",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ بُكَيْرٍ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنِ ابْنِ السَّاعِدِيِّ الْمَالِكِيِّ، قَالَ اسْتَعْمَلَنِي عُمَرُ بْنُ الْخَطَّابِ رضى الله عنه عَلَى الصَّدَقَةِ فَلَمَّا فَرَغْتُ مِنْهَا فَأَدَّيْتُهَا إِلَيْهِ أَمَرَ لِي بِعُمَالَةٍ فَقُلْتُ لَهُ إِنَّمَا عَمِلْتُ لِلَّهِ عَزَّ وَجَلَّ وَأَجْرِي عَلَى اللَّهِ عَزَّ وَجَلَّ ‏.‏ فَقَالَ خُذْ مَا أَعْطَيْتُكَ فَإِنِّي قَدْ عَمِلْتُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقُلْتُ لَهُ مِثْلَ قَوْلِكَ فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا أُعْطِيتَ شَيْئًا مِنْ غَيْرِ أَنْ تَسْأَلَ فَكُلْ وَتَصَدَّقْ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Ibn As-Sa'idi Al-Maliki berkata: Umar bin Al-Khattab رضي الله عنه melantik saya untuk menguruskan sadaqah (sedekah). Apabila saya selesai mengumpulkannya dan menyerahkannya kepada beliau, beliau memerintahkan supaya saya diberikan sedikit bayaran. Saya berkata kepada beliau: 'Sesungguhnya saya melakukan (pekerjaan) ini semata-mata kerana Allah, yang Maha Perkasa dan Maha Agung, dan pahala saya adalah daripada Allah, yang Maha Perkasa dan Maha Agung.' Beliau berkata: 'Ambillah apa yang telah aku berikan kepadamu: Sesungguhnya aku juga pernah melakukan perkara yang sama pada zaman Rasulullah ﷺ, dan aku juga berkata seperti yang kamu katakan, tetapi Rasulullah ﷺ bersabda kepadaku: \"Apabila kamu diberi sesuatu tanpa memintanya, maka ambillah (sebahagian) dan bersedekahlah (sebahagian).\"'"
  },
  {
    "id": 17346,
    "hadith_number": 2610,
    "tajuk_hadith": "Kisah 'Umar dan Abdullah bin As-Sa'di tentang Menerima Bayaran dan Sedekah",
    "perawi_melayu": "'Abdullah bin As-Sa'di meriwayatkan bahawa dia datang kepada 'Umar bin Al-Khattab, semoga Allah meredhainya, dari Ash-Sham, dan dia berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ أَبُو عُبَيْدِ اللَّهِ الْمَخْزُومِيُّ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنِ السَّائِبِ بْنِ يَزِيدَ، عَنْ حُوَيْطِبِ بْنِ عَبْدِ الْعُزَّى، قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ السَّعْدِيِّ، أَنَّهُ قَدِمَ عَلَى عُمَرَ بْنِ الْخَطَّابِ رضى الله عنه مِنَ الشَّامِ فَقَالَ أَلَمْ أُخْبَرْ أَنَّكَ تَعْمَلُ عَلَى عَمَلٍ مِنْ أَعْمَالِ الْمُسْلِمِينَ فَتُعْطَى عَلَيْهِ عُمَالَةً فَلاَ تَقْبَلُهَا قَالَ أَجَلْ إِنَّ لِي أَفْرَاسًا وَأَعْبُدًا وَأَنَا بِخَيْرٍ وَأُرِيدُ أَنْ يَكُونَ عَمَلِي صَدَقَةً عَلَى الْمُسْلِمِينَ فَقَالَ عُمَرُ رضى الله عنه إِنِّي أَرَدْتُ الَّذِي أَرَدْتَ وَكَانَ النَّبِيُّ صلى الله عليه وسلم يُعْطِينِي الْمَالَ فَأَقُولُ أَعْطِهِ مَنْ هُوَ أَفْقَرُ إِلَيْهِ مِنِّي وَإِنَّهُ أَعْطَانِي مَرَّةً مَالاً فَقُلْتُ لَهُ أَعْطِهِ مَنْ هُوَ أَحْوَجُ إِلَيْهِ مِنِّي ‏.‏ فَقَالَ ‏\n\"‏ مَا آتَاكَ اللَّهُ عَزَّ وَجَلَّ مِنْ هَذَا الْمَالِ مِنْ غَيْرِ مَسْأَلَةٍ وَلاَ إِشْرَافٍ فَخُذْهُ فَتَمَوَّلْهُ أَوْ تَصَدَّقْ بِهِ وَمَا لاَ فَلاَ تُتْبِعْهُ نَفْسَكَ ‏\"‏ ‏.‏",
    "malay_translation": "Saya mendengar bahawa anda telah melakukan beberapa kerja untuk umat Islam, dan anda diberi bayaran untuk itu, tetapi anda tidak menerimanya.\" Saya berkata: \"Ya (memang begitu); saya mempunyai kuda dan hamba dan berada dalam keadaan baik, dan saya mahu kerja saya menjadi sedekah kepada umat Islam.\" 'Umar, semoga Allah meredhainya, berkata: \"Saya inginkan perkara yang sama seperti anda. Nabi s.a.w. biasa memberi saya wang, dan saya akan berkata: 'Berikan kepada seseorang yang lebih memerlukannya daripada saya. Suatu ketika dia memberi saya wang dan saya berkata: 'Berikan kepada seseorang yang lebih memerlukannya daripada saya, dan dia berkata: 'Apa sahaja yang Allah, Yang Maha Kuasa dan Maha Agung, berikan kepada anda daripada kekayaan ini tanpa anda memintanya atau mengharapkannya, ambillah dan simpanlah, atau sedekahkannya, dan apa sahaja yang Dia tidak berikan kepada anda, maka janganlah anda mengharapkannya atau menginginkannya.\""
  },
  {
    "id": 17347,
    "hadith_number": 2611,
    "tajuk_hadith": "Menerima Bayaran untuk Kerja: Nasihat daripada Umar bin Al-Khattab",
    "perawi_melayu": "Abdullah bin As-Sa'di meriwayatkan bahawa beliau datang kepada 'Umar bin Al-Khattab semasa zaman khalifahannya, dan 'Umar berkata kepadanya:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا كَثِيرُ بْنُ عُبَيْدٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، عَنِ الزُّبَيْدِيِّ، عَنِ الزُّهْرِيِّ، عَنِ السَّائِبِ بْنِ يَزِيدَ، أَنَّ حُوَيْطِبَ بْنَ عَبْدِ الْعُزَّى، أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ السَّعْدِيِّ أَخْبَرَهُ أَنَّهُ، قَدِمَ عَلَى عُمَرَ بْنِ الْخَطَّابِ فِي خِلاَفَتِهِ فَقَالَ لَهُ عُمَرُ أَلَمْ أُحَدَّثْ أَنَّكَ تَلِي مِنْ أَعْمَالِ النَّاسِ أَعْمَالاً فَإِذَا أُعْطِيتَ الْعُمَالَةَ رَدَدْتَهَا فَقُلْتُ بَلَى ‏.‏ فَقَالَ عُمَرُ رضى الله عنه فَمَا تُرِيدُ إِلَى ذَلِكَ فَقُلْتُ لِي أَفْرَاسٌ وَأَعْبُدٌ وَأَنَا بِخَيْرٍ وَأُرِيدُ أَنْ يَكُونَ عَمَلِي صَدَقَةً عَلَى الْمُسْلِمِينَ ‏.‏ فَقَالَ لَهُ عُمَرُ فَلاَ تَفْعَلْ فَإِنِّي كُنْتُ أَرَدْتُ مِثْلَ الَّذِي أَرَدْتَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُعْطِينِي الْعَطَاءَ فَأَقُولُ أَعْطِهِ أَفْقَرَ إِلَيْهِ مِنِّي ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ خُذْهُ فَتَمَوَّلْهُ أَوْ تَصَدَّقْ بِهِ مَا جَاءَكَ مِنْ هَذَا الْمَالِ وَأَنْتَ غَيْرُ مُشْرِفٍ وَلاَ سَائِلٍ فَخُذْهُ وَمَا لاَ فَلاَ تُتْبِعْهُ نَفْسَكَ ‏\"‏ ‏.‏",
    "malay_translation": "Saya mendengar bahawa kamu melakukan beberapa pekerjaan untuk orang ramai, tetapi apabila bayaran diberikan kepada kamu, kamu menolaknya.\" Saya berkata: \"(Betul begitu).\" 'Umar, semoga Allah meredhainya, berkata: \"Mengapa kamu berbuat demikian?\" Saya berkata: \"Saya mempunyai kuda dan hamba dan berada dalam keadaan yang baik, dan saya mahu kerja saya menjadi sedekah kepada orang Islam.\" 'Umar berkata kepadanya: \"Jangan lakukan itu. Saya pernah mahukan perkara yang sama seperti kamu. Rasulullah s.a.w. pernah memberi saya bayaran dan saya akan berkata, 'Berikan kepada seseorang yang lebih memerlukan daripada saya.' Tetapi Rasulullah s.a.w. berkata: \"Ambilnya dan simpanlah atau sedekahkan. Apa sahaja yang datang kepada kamu daripada harta ini ketika kamu tidak mengharapkannya dan tidak memintanya, ambillah, dan apa yang tidak, maka janganlah mengharapkannya.\""
  },
  {
    "id": 17348,
    "hadith_number": 2612,
    "tajuk_hadith": "Menerima Bayaran Kerja dan Sedekah Harta",
    "perawi_melayu": "Abdullah bin As-Sa'di meriwayatkan bahawa dia datang kepada 'Umar bin Al-Khattab semasa Khilafahnya dan 'Umar berkata kepadanya:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، وَإِسْحَاقُ بْنُ مَنْصُورٍ، عَنِ الْحَكَمِ بْنِ نَافِعٍ، قَالَ أَنْبَأَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي السَّائِبُ بْنُ يَزِيدَ، أَنَّ حُوَيْطِبَ بْنَ عَبْدِ الْعُزَّى، أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ السَّعْدِيِّ أَخْبَرَهُ أَنَّهُ، قَدِمَ عَلَى عُمَرَ بْنِ الْخَطَّابِ فِي خِلاَفَتِهِ فَقَالَ عُمَرُ أَلَمْ أُخْبَرْ أَنَّكَ، تَلِي مِنْ أَعْمَالِ النَّاسِ أَعْمَالاً فَإِذَا أُعْطِيتَ الْعُمَالَةَ كَرِهْتَهَا قَالَ فَقُلْتُ بَلَى ‏.‏ قَالَ فَمَا تُرِيدُ إِلَى ذَلِكَ فَقُلْتُ إِنَّ لِي أَفْرَاسًا وَأَعْبُدًا وَأَنَا بِخَيْرٍ وَأُرِيدُ أَنْ يَكُونَ عَمَلِي صَدَقَةً عَلَى الْمُسْلِمِينَ فَقَالَ عُمَرُ فَلاَ تَفْعَلْ فَإِنِّي كُنْتُ أَرَدْتُ الَّذِي أَرَدْتَ فَكَانَ النَّبِيُّ صلى الله عليه وسلم يُعْطِينِي الْعَطَاءَ فَأَقُولُ أَعْطِهِ أَفْقَرَ إِلَيْهِ مِنِّي حَتَّى أَعْطَانِي مَرَّةً مَالاً فَقُلْتُ أَعْطِهِ أَفْقَرَ إِلَيْهِ مِنِّي ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ خُذْهُ فَتَمَوَّلْهُ وَتَصَدَّقْ بِهِ فَمَا جَاءَكَ مِنْ هَذَا الْمَالِ وَأَنْتَ غَيْرُ مُشْرِفٍ وَلاَ سَائِلٍ فَخُذْهُ وَمَا لاَ فَلاَ تُتْبِعْهُ نَفْسَكَ ‏\"‏ ‏.‏",
    "malay_translation": "Saya mendengar bahawa anda melakukan beberapa pekerjaan untuk orang ramai tetapi apabila pembayaran diberikan kepada anda, anda tidak menyukainya.\" Saya berkata: \"Ya (begitu).\" Dia berkata: \"Mengapa anda melakukan itu?\" Saya berkata: \"Saya mempunyai kuda dan hamba dan berkemampuan, dan saya mahu kerja saya menjadi sedekah kepada umat Islam.\" 'Umar berkata kepadanya: \"Jangan lakukan itu. Saya pernah mahu perkara yang sama seperti anda. Rasulullah s.a.w. biasa memberi saya pembayaran dan saya akan berkata, 'Berikan kepada seseorang yang lebih memerlukannya daripada saya' sehingga, pada satu ketika, Nabi memberi saya pembayaran dan saya berkata: 'Berikan kepada seseorang yang lebih memerlukannya daripada saya.' Baginda bersabda: 'Ambil dan simpanlah atau sedekahkan. Harta apabila anda tidak mengharapkannya dan tidak memintanya, ambillahnya, dan apa yang tidak, maka jangan inginkannya.'"
  },
  {
    "id": 17349,
    "hadith_number": 2613,
    "tajuk_hadith": "Nasihat Nabi SAW tentang Rezeki dan Sedekah",
    "perawi_melayu": "Abdullah bin Umar berkata:",
    "english_text": "\"I heard 'Umar, may Allah be pleased with him, say: The Prophet used to give me payment and I would say: Give it to someone who is more, in need of it than I am, until one day he gave me some money and I said to him: Give it to someone who is more in need of it than I am. He said: Take it and keep it or give it in charity. Whatever comes to you of this wealth when you are not hoping for it and not asking for it, take it, and whatever does not, then do not wish for it. \"'",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ، قَالَ أَنْبَأَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ سَمِعْتُ عُمَرَ، رضى الله عنه يَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم يُعْطِينِي الْعَطَاءَ فَأَقُولُ أَعْطِهِ أَفْقَرَ إِلَيْهِ مِنِّي حَتَّى أَعْطَانِي مَرَّةً مَالاً فَقُلْتُ لَهُ أَعْطِهِ أَفْقَرَ إِلَيْهِ مِنِّي ‏.‏ فَقَالَ ‏\n\"‏ خُذْهُ فَتَمَوَّلْهُ وَتَصَدَّقْ بِهِ وَمَا جَاءَكَ مِنْ هَذَا الْمَالِ وَأَنْتَ غَيْرُ مُشْرِفٍ وَلاَ سَائِلٍ فَخُذْهُ وَمَا لاَ فَلاَ تُتْبِعْهُ نَفْسَكَ ‏\"‏ ‏.‏",
    "malay_translation": "Saya mendengar Umar رضي الله عنه berkata: Nabi ﷺ pernah memberi saya pemberian, lalu saya berkata: Berikanlah kepada orang yang lebih memerlukan daripadaku, sehingga pada suatu hari Baginda memberi saya sejumlah wang, lalu saya berkata kepada Baginda: Berikanlah kepada orang yang lebih memerlukan daripadaku. Baginda bersabda: Ambil dan simpanlah ia atau sedekahkanlah. Apa sahaja yang datang kepadamu daripada harta ini sedangkan kamu tidak mengharapkannya dan tidak memintanya, maka ambillah ia, dan apa yang tidak datang, maka janganlah kamu mengharapkannya."
  },
  {
    "id": 17350,
    "hadith_number": 2614,
    "tajuk_hadith": "Zakat: Harta Najis yang Tidak Halal untuk Keluarga Nabi",
    "perawi_melayu": "Abu Rabiah bin Al-Harith berkata kepada 'Abdul-Muttalib bin Rabi'ah bin Al-Harith dan Al-Fadl bin 'Abbas bin 'Abdul-Muttalib:",
    "english_text": "\"Not Available\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ سَوَّادِ بْنِ الأَسْوَدِ بْنِ عَمْرٍو، عَنِ ابْنِ وَهْبٍ، قَالَ حَدَّثَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ الْهَاشِمِيِّ، أَنَّ عَبْدَ الْمُطَّلِبِ بْنَ رَبِيعَةَ بْنِ الْحَارِثِ بْنِ عَبْدِ الْمُطَّلِبِ، أَخْبَرَهُ أَنَّ أَبَاهُ رَبِيعَةَ بْنَ الْحَارِثِ قَالَ لِعَبْدِ الْمُطَّلِبِ بْنِ رَبِيعَةَ بْنِ الْحَارِثِ وَالْفَضْلِ بْنِ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ ائْتِيَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُولاَ لَهُ اسْتَعْمِلْنَا يَا رَسُولَ اللَّهِ عَلَى الصَّدَقَاتِ ‏.‏ فَأَتَى عَلِيُّ بْنُ أَبِي طَالِبٍ وَنَحْنُ عَلَى تِلْكَ الْحَالِ فَقَالَ لَهُمَا إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لاَ يَسْتَعْمِلُ مِنْكُمْ أَحَدًا عَلَى الصَّدَقَةِ قَالَ عَبْدُ الْمُطَّلِبِ فَانْطَلَقْتُ أَنَا وَالْفَضْلُ حَتَّى أَتَيْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ لَنَا ‏\n\"‏ إِنَّ هَذِهِ الصَّدَقَةَ إِنَّمَا هِيَ أَوْسَاخُ النَّاسِ وَإِنَّهَا لاَ تَحِلُّ لِمُحَمَّدٍ وَلاَ لآلِ مُحَمَّدٍ صلى الله عليه وسلم ‏\"‏ ‏.‏",
    "malay_translation": "“Pergilah kepada Rasulullah ﷺ dan katakan kepada baginda: 'Wahai Rasulullah, lantiklah kami untuk mengumpul sadaqah!' Ali bin Abi Talib datang ketika kami dalam keadaan demikian, lalu berkata kepada mereka: 'Rasulullah ﷺ tidak akan melantik sesiapa pun daripada kalangan kamu untuk mengumpul sadaqah.' 'Abdul-Muttalib berkata: 'Maka aku pergi bersama Al-Fadl sehingga kami menemui Rasulullah ﷺ, lalu baginda bersabda kepada kami: 'Sesungguhnya zakat ini adalah kotoran manusia, dan ia tidak halal bagi Muhammad ﷺ atau keluarga Muhammad ﷺ.'"
  },
  {
    "id": 17351,
    "hadith_number": 2615,
    "tajuk_hadith": "Anak Perempuan Suatu Kaum Adalah Sebahagian Daripada Mereka",
    "perawi_melayu": "Shu'bah berkata:",
    "english_text": "\"I said to Abu Iyas Mu'awiyah bin Qurrah: 'Did you hear Ans bin Malik say: The Messenger of Allah said: The son of the daughter of a people is one of them? He said: 'Yes.'\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا وَكِيعٌ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ قُلْتُ لأَبِي إِيَاسٍ مُعَاوِيَةَ بْنِ قُرَّةَ أَسَمِعْتَ أَنَسَ بْنَ مَالِكٍ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ ابْنُ أُخْتِ الْقَوْمِ مِنْ أَنْفُسِهِمْ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏",
    "malay_translation": "Saya berkata kepada Abu Iyas Mu'awiyah bin Qurrah: 'Adakah kamu mendengar Anas bin Malik berkata: Rasulullah ﷺ bersabda: Anak perempuan suatu kaum adalah sebahagian daripada mereka?' Dia berkata: 'Ya.'"
  },
  {
    "id": 17352,
    "hadith_number": 2616,
    "tajuk_hadith": "Cucu Perempuan Tergolong Dalam Kalangan Kaumnya",
    "perawi_melayu": "Daripada Anas bin Malik, bahawa Rasulullah ﷺ bersabda:",
    "english_text": "\"The son of the daughter of a people is one of them.\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا وَكِيعٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ ابْنُ أُخْتِ الْقَوْمِ مِنْهُمْ ‏\"‏ ‏.‏",
    "malay_translation": "“Anak lelaki daripada anak perempuan sesuatu kaum itu adalah daripada kalangan mereka.”"
  },
  {
    "id": 17353,
    "hadith_number": 2617,
    "tajuk_hadith": "Sedekah Tidak Dihalalkan untuk Keturunan Nabi",
    "perawi_melayu": "Daripada Ibn Abi Rafi, daripada bapanya",
    "english_text": "the Messenger of Allah appointed a man from Banu Makhzum to collect Sadaqah. Abu Rafi wanted to go with him, but the Messenger of Allah said: \"The Sadaqah is not permissible for us, and the freed slave of a people is one of them.\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا الْحَكَمُ، عَنِ ابْنِ أَبِي رَافِعٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَعْمَلَ رَجُلاً مِنْ بَنِي مَخْزُومٍ عَلَى الصَّدَقَةِ فَأَرَادَ أَبُو رَافِعٍ أَنْ يَتْبَعَهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ الصَّدَقَةَ لاَ تَحِلُّ لَنَا وَإِنَّ مَوْلَى الْقَوْمِ مِنْهُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW melantik seorang lelaki daripada Bani Makhzum untuk mengumpul Sadaqah. Abu Rafi ingin mengikutnya, tetapi Rasulullah SAW bersabda: \"Sadaqah tidak halal bagi kami, dan hamba yang telah dibebaskan daripada suatu kaum adalah sebahagian daripada mereka.\""
  },
  {
    "id": 17354,
    "hadith_number": 2618,
    "tajuk_hadith": "Nabi SAW Membezakan Antara Hadiah dan Sedekah",
    "perawi_melayu": "Bahz bin Hakim meriwayatkan daripada bapanya bahawa datuknya berkata:",
    "english_text": "\"If something was brought to him, the prophet would ask whether it was a gift or charity. If it was said that if was charity, he would not eat, and if it was said that it was a gift, he would stretch forth his hand.\"",
    "arabic_text": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ وَاصِلٍ، قَالَ حَدَّثَنَا بَهْزُ بْنُ حَكِيمٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا أُتِيَ بِشَىْءٍ سَأَلَ عَنْهُ ‏\n\"‏ أَهَدِيَّةٌ أَمْ صَدَقَةٌ ‏\"‏ ‏.‏ فَإِنْ قِيلَ صَدَقَةٌ لَمْ يَأْكُلْ وَإِنْ قِيلَ هَدِيَّةٌ بَسَطَ يَدَهُ ‏.‏",
    "malay_translation": "Apabila sesuatu dibawa kepada Nabi SAW, baginda akan bertanya sama ada ia hadiah atau sedekah. Sekiranya dikatakan ia sedekah, baginda tidak akan memakannya, dan jika dikatakan ia hadiah, baginda akan menghulurkan tangan."
  },
  {
    "id": 17355,
    "hadith_number": 2619,
    "tajuk_hadith": "Kisah Barirah dan Pembebasannya",
    "perawi_melayu": "Daripada 'Aishah r.a.",
    "english_text": "she wanted to buy Barirah and set her free, but they stipulated that her loyally as a freed slave (wala') should be to them. She mentioned that to the Messenger of Allah and he said: \"Buy her and set her fee, and loyally is due to the one who frees the slave.\" She was given the choice when she was freed. Some meat was brought to the Messenger of Allah and it was said: \"This is something that is given in charity to Barirah.\" He said: \"It is charity for her and gift for us.\" And her husband was a free man.",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ، قَالَ حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا الْحَكَمُ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، أَنَّهَا أَرَادَتْ أَنْ تَشْتَرِيَ، بَرِيرَةَ فَتَعْتِقَهَا وَأَنَّهُمُ اشْتَرَطُوا وَلاَءَهَا فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ اشْتَرِيهَا وَاعْتِقِيهَا فَإِنَّ الْوَلاَءَ لِمَنْ أَعْتَقَ ‏\"‏ ‏.‏ وَخُيِّرَتْ حِينَ أُعْتِقَتْ وَأُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِلَحْمٍ فَقِيلَ هَذَا مِمَّا تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ ‏.‏ فَقَالَ ‏\"‏ هُوَ لَهَا صَدَقَةٌ وَلَنَا هَدِيَّةٌ ‏\"‏ ‏.‏ وَكَانَ زَوْجُهَا حُرًّا ‏.‏",
    "malay_translation": "Daripada 'Aishah r.a., beliau ingin membeli Barirah dan membebaskannya. Namun, mereka menetapkan bahawa kesetiaan (wala') Barirah sebagai hamba yang telah dibebaskan hendaklah kepada mereka. 'Aishah menyebutkan hal itu kepada Rasulullah ﷺ, lalu baginda bersabda: \"Belilah dia dan bebaskanlah dia, kerana kesetiaan adalah hak orang yang membebaskan hamba.\" Barirah diberi pilihan apabila dia telah dibebaskan. Kemudian, daging dibawa kepada Rasulullah ﷺ, dan dikatakan: \"Ini adalah sedekah yang diberikan kepada Barirah.\" Baginda bersabda: \"Ia adalah sedekah untuknya dan hadiah untuk kita.\" Dan suaminya adalah seorang lelaki yang merdeka."
  },
  {
    "id": 17356,
    "hadith_number": 2620,
    "tajuk_hadith": "Larangan Membeli Semula Sedekah",
    "perawi_melayu": "Daripada Zaid bin Aslam, bapanya berkata:",
    "english_text": "\"Not Available\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنَا مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ عُمَرَ، يَقُولُ حَمَلْتُ عَلَى فَرَسٍ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ فَأَضَاعَهُ الَّذِي كَانَ عِنْدَهُ وَأَرَدْتُ أَنْ أَبْتَاعَهُ مِنْهُ وَظَنَنْتُ أَنَّهُ بَائِعُهُ بِرُخْصٍ فَسَأَلْتُ عَنْ ذَلِكَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ لاَ تَشْتَرِهِ وَإِنْ أَعْطَاكَهُ بِدِرْهَمٍ فَإِنَّ الْعَائِدَ فِي صَدَقَتِهِ كَالْكَلْبِ يَعُودُ فِي قَيْئِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Saya mendengar 'Umar berkata: 'Saya telah menghulurkan seekor kuda untuk ditunggangi seseorang di jalan Allah, Yang Maha Perkasa dan Maha Agung, dan orang yang memilikinya mengabaikannya. Saya ingin membelinya semula daripadanya, dan saya berfikir bahawa dia akan menjualnya dengan harga yang murah. Saya bertanya kepada Rasulullah ﷺ tentang perkara itu dan baginda bersabda: Janganlah kamu membelinya, walaupun dia memberikannya kepadamu dengan harga satu Dirham. Sesungguhnya orang yang mengambil kembali sedekahnya adalah seperti anjing yang kembali kepada muntahnya.'"
  },
  {
    "id": 17357,
    "hadith_number": 2621,
    "tajuk_hadith": "Larangan Membeli Kembali Sedekah",
    "perawi_melayu": "Diriwayatkan daripada 'Umar bahawa:",
    "english_text": "he gave someone a horse to ride in the cause of Allah, then he saw it offered for sale and wanted to buy it. The Prophet said to him: \"Do not think of buying back what you have given in charity.\"",
    "arabic_text": "أَخْبَرَنَا هَارُونُ بْنُ إِسْحَاقَ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، عَنْ عُمَرَ، أَنَّهُ حَمَلَ عَلَى فَرَسٍ فِي سَبِيلِ اللَّهِ فَرَآهَا تُبَاعُ فَأَرَادَ شِرَاءَهَا فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ تَعْرِضْ فِي صَدَقَتِكَ ‏\"‏ ‏.‏",
    "malay_translation": "Beliau (Umar) memberikan seseorang seekor kuda untuk ditunggangi di jalan Allah, kemudian beliau melihat kuda itu dijual dan ingin membelinya. Nabi ﷺ bersabda kepadanya: \"Janganlah kamu cuba membeli kembali apa yang telah kamu sedekahkan.\""
  },
  {
    "id": 17358,
    "hadith_number": 2622,
    "tajuk_hadith": "Jangan Mengambil Semula Sedekah",
    "perawi_melayu": "Salim bin 'Abdullah meriwayatkan daripada 'Abdullah bin 'Umar:",
    "english_text": "'Umar give a house in charity for the sake of Allah, the Mighty and Sublime, and he found it being offered for sale after that. He wanted to buy it, then he went to the Messenger of Allah and asked him about that. The Messenger of Allah said: \"Do not take back what you have given in charity.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ أَنْبَأَنَا حُجَيْنٌ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يُحَدِّثُ أَنَّ عُمَرَ، تَصَدَّقَ بِفَرَسٍ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ فَوَجَدَهَا تُبَاعُ بَعْدَ ذَلِكَ فَأَرَادَ أَنْ يَشْتَرِيَهُ ثُمَّ أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَاسْتَأْمَرَهُ فِي ذَلِكَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَعُدْ فِي صَدَقَتِكَ ‏\"‏ ‏.‏",
    "malay_translation": "Umar telah bersedekah dengan seekor kuda di jalan Allah, Yang Maha Perkasa dan Maha Agung, kemudian dia mendapati kuda itu dijual selepas itu. Dia ingin membelinya, kemudian dia pergi kepada Rasulullah ﷺ dan bertanya tentang hal itu. Rasulullah ﷺ bersabda: \"Janganlah kamu mengambil semula sedekahmu.\""
  },
  {
    "id": 17359,
    "hadith_number": 2623,
    "tajuk_hadith": "Perintah Rasulullah SAW Tentang Zakat Anggur",
    "perawi_melayu": "Daripada Sa'eed bin Al-Musayyab:",
    "english_text": "That the Messenger of Allah told 'Attab bin Usaid to estimate the (harvest of) grapes, and to pay Zakah in raisins, just as the Zakah on date palms is given in died dates.",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا بِشْرٌ، وَيَزِيدُ، قَالاَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَاقَ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ عَتَّابَ بْنَ أَسِيدٍ أَنْ يَخْرِصَ الْعِنَبَ فَتُؤَدَّى زَكَاتُهُ زَبِيبًا كَمَا تُؤَدَّى زَكَاةُ النَّخْلِ تَمْرًا ‏.‏",
    "malay_translation": "Rasulullah SAW telah memerintahkan 'Attab bin Usaid untuk menganggarkan (hasil) anggur, dan membayar zakatnya dalam bentuk kismis, sebagaimana zakat kurma dibayar dalam bentuk tamar (kurma kering)."
  }
]
