[
  {
    "id": 15085,
    "hadith_number": 349,
    "tajuk_hadith": "Hukum Wanita Haid semasa Haji",
    "perawi_melayu": "Diriwayatkan oleh 'Aishah رضي الله عنها",
    "english_text": "\"Kami keluar bersama Rasulullah SAW dengan niat mengerjakan haji sahaja. Ketika kami berada di Sarif, saya mengalami haid. Rasulullah SAW masuk ke rumah saya dan mendapati saya sedang menangis. Baginda bertanya: 'Apa yang terjadi? Adakah anda mengalami nifas?' Saya menjawab: 'Ya.' Baginda bersabda: 'Ini adalah ketentuan Allah SWT bagi wanita. Lakukanlah sepertimana yang dilakukan oleh para jemaah haji, tetapi janganlah melakukan Tawaf di Baitullah.'\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ بْنِ مُحَمَّدِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ، - رضى الله عنه - عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم لاَ نُرَى إِلاَّ الْحَجَّ فَلَمَّا كُنَّا بِسَرِفَ حِضْتُ فَدَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنَا أَبْكِي فَقَالَ ‏\"‏ مَا لَكِ أَنَفِسْتِ ‏\"‏ ‏.‏ قُلْتُ نَعَمْ ‏.‏ قَالَ ‏\"‏ هَذَا أَمْرٌ كَتَبَهُ اللَّهُ عَزَّ وَجَلَّ عَلَى بَنَاتِ آدَمَ فَاقْضِي مَا يَقْضِي الْحَاجُّ غَيْرَ أَنْ لاَ تَطُوفِي بِالْبَيْتِ ‏\"‏ ‏.‏",
    "malay_translation": "Kami keluar bersama Rasulullah SAW dengan niat mengerjakan haji sahaja. Apabila kami sampai di Sarif, saya mengalami haid. Rasulullah SAW masuk ke rumah saya dan mendapati saya sedang menangis. Baginda bertanya, \"Apa yang terjadi? Adakah anda mengalami nifas?\" Saya menjawab, \"Ya.\" Baginda bersabda, \"Ini adalah ketentuan Allah SWT untuk wanita. Lakukanlah apa yang dilakukan oleh para jemaah haji, tetapi janganlah mengerjakan tawaf di Baitullah.\""
  },
  {
    "id": 15086,
    "hadith_number": 350,
    "tajuk_hadith": "Panduan Solat Bagi Wanita yang Mengalami Istihadah",
    "perawi_melayu": "Dikisahkan oleh Fatimah binti Qais daripada Bani Asad Quraisy, bahawa beliau menemui Rasulullah SAW dan menceritakan masalah istihadah yang dialaminya. Beliau berkata bahawa Rasulullah SAW bersabda:",
    "english_text": "\"That is a vein, so when the time of menstruation comes, stop praying, and when it goes, take your bath and wash the blood from yourself then pray.\"",
    "arabic_text": "أَخْبَرَنَا عِمْرَانُ بْنُ يَزِيدَ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، - وَهُوَ ابْنُ سَمَاعَةَ - قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ أَخْبَرَنِي هِشَامُ بْنُ عُرْوَةَ، عَنْ عُرْوَةَ، أَنَّ فَاطِمَةَ بِنْتَ قَيْسٍ، مِنْ بَنِي أَسَدِ قُرَيْشٍ أَنَّهَا أَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَذَكَرَتْ أَنَّهَا تُسْتَحَاضُ فَزَعَمَتْ أَنَّهُ قَالَ لَهَا ‏\n\"‏ إِنَّمَا ذَلِكِ عِرْقٌ فَإِذَا أَقْبَلَتِ الْحَيْضَةُ فَدَعِي الصَّلاَةَ وَإِذَا أَدْبَرَتْ فَاغْتَسِلِي وَاغْسِلِي عَنْكِ الدَّمَ ثُمَّ صَلِّي ‏\"‏ ‏.‏",
    "malay_translation": "Itu adalah urat. Maka, apabila datang haid, berhentilah dari solat, dan apabila ia reda, mandilah dan bersihkan darah dari diri anda, kemudian solatlah."
  },
  {
    "id": 15087,
    "hadith_number": 351,
    "tajuk_hadith": "Larangan Solat Semasa Haid dan Wajib Mandi Junub Selepas Haid",
    "perawi_melayu": "'Aishah r.a. meriwayatkan bahawa Nabi saw bersabda:",
    "english_text": "\"When the time of menstruation comes, stop praying, and when it goes, perform Ghusl.\"",
    "arabic_text": "أَخْبَرَنَا هِشَامُ بْنُ عَمَّارٍ، قَالَ حَدَّثَنَا سَهْلُ بْنُ هَاشِمٍ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا أَقْبَلَتِ الْحِيضَةُ فَدَعِي الصَّلاَةَ وَإِذَا أَدْبَرَتْ فَاغْتَسِلِي ‏\"‏ ‏.‏",
    "malay_translation": "Apabila datang haid, tinggalkan solat, dan apabila haid habis, mandilah junub."
  },
  {
    "id": 15088,
    "hadith_number": 352,
    "tajuk_hadith": "Penjelasan tentang Istihadah dan Wajib Mandi (Ghusl) bagi Wanita",
    "perawi_melayu": "'Aishah meriwayatkan:",
    "english_text": "\"Umm Habibah bint Jahsh bertanya kepada Rasulullah SAW: 'Wahai Rasulullah, saya mengalami Istihadah.' Baginda menjawab: 'Itu adalah urat darah, maka mandilah, kemudian solat.' Dan dia (Umm Habibah) biasa mandi untuk setiap solat.",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتِ اسْتَفْتَتْ أُمُّ حَبِيبَةَ بِنْتُ جَحْشٍ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي أُسْتَحَاضُ فَقَالَ ‏\n\"‏ إِنَّ ذَلِكِ عِرْقٌ فَاغْتَسِلِي ثُمَّ صَلِّي ‏\"‏ ‏.‏ فَكَانَتْ تَغْتَسِلُ عِنْدَ كُلِّ صَلاَةٍ ‏.‏",
    "malay_translation": "Umm Habibah binti Jahsh bertanya kepada Rasulullah SAW, 'Wahai Rasulullah, saya mengalami istihadah.' Baginda menjawab, 'Itu adalah urat darah, maka mandilah (ghusl), kemudian solat.' Dan beliau (Umm Habibah) biasa mandi (ghusl) untuk setiap solat."
  },
  {
    "id": 15089,
    "hadith_number": 353,
    "tajuk_hadith": "Panduan Mengenai Pembersihan Wanita Selepas Haid",
    "perawi_melayu": "'Aishah RA meriwayatkan",
    "english_text": "\"I saw her wash tub filled with blood.\" The Messenger of Allah (ﷺ) said to her: \"Stop (praying) for as long as your period used to last, then perform Ghusl.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنْ عِرَاكِ بْنِ مَالِكٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ إِنَّ أُمَّ حَبِيبَةَ سَأَلَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الدَّمِ - فَقَالَتْ عَائِشَةُ رَأَيْتُ مِرْكَنَهَا مَلآنَ دَمًا - فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ امْكُثِي قَدْرَ مَا كَانَتْ تَحْبِسُكِ حِيضَتُكِ ثُمَّ اغْتَسِلِي ‏\"‏ ‏.‏\nوَأَخْبَرَنَا بِهِ قُتَيْبَةُ مَرَّةً أُخْرَى وَلَمْ يَذْكُرْ فِيهِ جَعْفَرَ بْنَ رَبِيعَةَ.",
    "malay_translation": "\"Saya melihat mangkuk basuhnya penuh dengan darah.\" Rasulullah SAW bersabda kepadanya: \"Hentikan (solat) selama tempoh haid anda sebelum ini, kemudian mandi wajib (ghusl).\""
  },
  {
    "id": 15090,
    "hadith_number": 354,
    "tajuk_hadith": "Panduan Solat bagi Wanita yang Mengalami Istihadah",
    "perawi_melayu": "Dikisahkan oleh Umm Salamah:",
    "english_text": "\"A woman asked the Prophet (ﷺ): 'I suffer from Istihadah and I never become pure; should I stop praying?' He said: 'No. Stop praying for the number of days and nights that you used to menstruate, then perform Ghusl, wrap a cloth around yourself, and pray.'\"",
    "arabic_text": "أَنْبَأَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، قَالَ أَخْبَرَنِي عَنْ نَافِعٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ سَأَلَتِ امْرَأَةٌ النَّبِيَّ صلى الله عليه وسلم قَالَتْ إِنِّي أُسْتَحَاضُ فَلاَ أَطْهُرُ أَفَأَدَعُ الصَّلاَةَ قَالَ ‏\n\"‏ لاَ وَلَكِنْ دَعِي قَدْرَ تِلْكَ الأَيَّامِ وَاللَّيَالِي الَّتِي كُنْتِ تَحِيضِينَ فِيهَا ثُمَّ اغْتَسِلِي وَاسْتَثْفِرِي وَصَلِّي ‏\"‏ ‏.‏",
    "malay_translation": "Seorang wanita bertanya kepada Nabi SAW, 'Saya mengalami Istihadah dan tidak pernah suci. Adakah saya perlu berhenti solat?' Baginda menjawab, 'Tidak. Berhentilah solat selama tempoh hari dan malam yang sama dengan tempoh haid anda sebelum itu. Kemudian, mandilah (Ghusl), baluti diri dengan kain, dan solatlah.'"
  },
  {
    "id": 15091,
    "hadith_number": 355,
    "tajuk_hadith": "Panduan Wanita Menghadapi Pendarahan Tidak Teratur Semasa Haid",
    "perawi_melayu": "Daripada Umm Salamah",
    "english_text": "\"Let her count the number of nights and days that she used to menstruate each month before this happened to her, and let her stop praying for that period of time each month. Then when that is over let her perform Ghusl, then wrap a cloth around herself, and pray.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ أُمِّ سَلَمَةَ، أَنَّ امْرَأَةً، كَانَتْ تُهَرَاقُ الدَّمَ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم اسْتَفْتَتْ لَهَا أُمُّ سَلَمَةَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ لِتَنْظُرْ عَدَدَ اللَّيَالِي وَالأَيَّامِ الَّتِي كَانَتْ تَحِيضُ مِنَ الشَّهْرِ قَبْلَ أَنْ يُصِيبَهَا الَّذِي أَصَابَهَا فَلْتَتْرُكِ الصَّلاَةَ قَدْرَ ذَلِكَ مِنَ الشَّهْرِ فَإِذَا خَلَّفَتْ ذَلِكَ فَلْتَغْتَسِلْ ثُمَّ لْتَسْتَثْفِرْ بِالثَّوْبِ ثُمَّ لْتُصَلِّي ‏\"‏ ‏.‏",
    "malay_translation": "Diriwayatkan daripada Umm Salamah bahawa terdapat seorang wanita yang mengalami pendarahan yang tidak terkawal ketika zaman Rasulullah SAW.  Umm Salamah bertanya kepada Rasulullah SAW mengenai keadaan wanita tersebut. Baginda bersabda,\n\"Hendaklah wanita itu menghitung bilangan malam dan hari haidnya pada bulan sebelumnya sebelum kejadian ini berlaku.  Hendaklah dia menangguhkan solat selama tempoh itu dalam setiap bulannya.  Apabila tempoh itu berakhir, hendaklah dia mandi wajib (ghusl), kemudian menutup auratnya dengan kain, dan kemudian menunaikan solat.\""
  },
  {
    "id": 15092,
    "hadith_number": 356,
    "tajuk_hadith": "Penjelasan Mengenai Keadaan Istihadhah dan Cara Menguruskannya",
    "perawi_melayu": "Daripada 'Aisyah, daripada Umm Habibah binti Jahsh, yang telah berkahwin dengan 'Abdul Rahman bin 'Auf, yang mengalami Istihadhah dan tidak suci.  Perkara ini dilaporkan kepada Rasulullah SAW.",
    "english_text": "\"That is not menstruation, rather it is a kick in the womb, so let her work out the length of the menses that she used to have, and stop praying (for that period of time), then after that let her perform Ghusl for every for every prayer.\"",
    "arabic_text": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ بْنِ دَاوُدَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا إِسْحَاقُ، - وَهُوَ ابْنُ بَكْرِ بْنِ مُضَرَ - قَالَ حَدَّثَنِي أَبِي، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ، - وَهُوَ ابْنُ أُسَامَةَ بْنِ الْهَادِ - عَنْ أَبِي بَكْرٍ، - وَهُوَ ابْنُ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ - عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ إِنَّ أُمَّ حَبِيبَةَ بِنْتَ جَحْشٍ الَّتِي كَانَتْ تَحْتَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَأَنَّهَا اسْتُحِيضَتْ لاَ تَطْهُرُ فَذُكِرَ شَأْنُهَا لِرَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَيْسَتْ بِالْحِيضَةِ وَلَكِنَّهَا رَكْضَةٌ مِنَ الرَّحِمِ لِتَنْظُرْ قَدْرَ قُرْئِهَا الَّتِي كَانَتْ تَحِيضُ لَهَا فَلْتَتْرُكِ الصَّلاَةَ ثُمَّ تَنْظُرْ مَا بَعْدَ ذَلِكَ فَلْتَغْتَسِلْ عِنْدَ كُلِّ صَلاَةٍ ‏\"‏ ‏.‏",
    "malay_translation": "\"Bukan haid, tetapi ia adalah seperti kecederaan di rahim.  Maka, hendaklah dia menentukan tempoh haid yang biasa dialami dan berhenti mengerjakan solat untuk tempoh itu.  Selepas itu, hendaklah dia mandi wajib (ghusl) untuk setiap solat.\""
  },
  {
    "id": 15093,
    "hadith_number": 357,
    "tajuk_hadith": "Penjelasan Perihal Istihadhah dan Cara Penyucian",
    "perawi_melayu": "Daripada 'Aisyah رضي الله عنها",
    "english_text": "\"That is not menstruation, rather it is a vein. Tell her not to pray for the period of time that her period used to last, then let her perform Ghusl and pray.\" She used to perform Ghusl for every prayer.",
    "arabic_text": "أَخْبَرَنَا أَبُو مُوسَى، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، أَنَّ ابْنَةَ جَحْشٍ، كَانَتْ تُسْتَحَاضُ سَبْعَ سِنِينَ فَسَأَلَتِ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ لَيْسَتْ بِالْحَيْضَةِ إِنَّمَا هُوَ عِرْقٌ ‏\"‏ ‏.‏ فَأَمَرَهَا أَنْ تَتْرُكَ الصَّلاَةَ قَدْرَ أَقْرَائِهَا وَحِيضَتِهَا وَتَغْتَسِلَ وَتُصَلِّيَ فَكَانَتْ تَغْتَسِلُ عِنْدَ كُلِّ صَلاَةٍ ‏.‏",
    "malay_translation": "Telah diberitakan kepada kami oleh Abu Musa, katanya: Telah menceritakan kepada kami Sufian, daripada al-Zuhri, daripada 'Amrah, daripada 'Aisyah رضي الله عنها, bahawa anak perempuan Jahsh pernah mengalami istihadhah selama tujuh tahun. Dia bertanya kepada Rasulullah SAW, dan baginda menjawab:\"Bukan haid, tetapi ia adalah urat.\" Baginda memerintahkannya agar meninggalkan solat selama tempoh seperti tempoh haidnya, kemudian mandi wajib (ghusl) dan menunaikan solat.  Dia kemudian mandi wajib sebelum setiap solat."
  },
  {
    "id": 15094,
    "hadith_number": 358,
    "tajuk_hadith": "Larangan Solat Ketika Haid dan Petunjuk Tentang Pembersihan",
    "perawi_melayu": "Diceritakan oleh 'Urwah bahawa Fatimah binti Abi Hubaish menceritakan bahawa dia datang kepada Rasulullah SAW dan mengadu tentang pendarahan. Rasulullah SAW bersabda:",
    "english_text": "\"That is a vein, so when your period comes, do not pray, and when your period is over, purify yourself and pray in between one period and the next.\"\nAbu 'Abdur-Rahman said: Hisham bin 'Urwah reported this Hadith from 'Urwah, and he did not mention what Al-Mundhir mentioned in it.",
    "arabic_text": "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ، قَالَ أَنْبَأَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ، عَنِ الْمُنْذِرِ بْنِ الْمُغِيرَةِ، عَنْ عُرْوَةَ، أَنَّ فَاطِمَةَ بِنْتَ أَبِي حُبَيْشٍ، حَدَّثَتْهُ أَنَّهَا، أَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَشَكَتْ إِلَيْهِ الدَّمَ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّمَا ذَلِكِ عِرْقٌ فَانْظُرِي إِذَا أَتَاكِ قَرْؤُكِ فَلاَ تُصَلِّي وَإِذَا مَرَّ قَرْؤُكِ فَلْتَطَهَّرِي ثُمَّ صَلِّي مَا بَيْنَ الْقُرْءِ إِلَى الْقُرْءِ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ قَدْ رَوَى هَذَا الْحَدِيثَ هِشَامُ بْنُ عُرْوَةَ عَنْ عُرْوَةَ وَلَمْ يَذْكُرْ فِيهِ مَا ذَكَرَ الْمُنْذِرُ ‏.‏",
    "malay_translation": "Ini adalah urat, maka apabila datang haid, janganlah solat, dan apabila haid berakhir, bersihkan diri dan solatlah di antara satu haid dengan haid yang berikutnya.”\nAbu Abdurrahman berkata: Hisyam bin 'Urwah meriwayatkan hadis ini daripada 'Urwah, dan dia tidak menyebut apa yang disebut Al-Mundhir di dalamnya."
  },
  {
    "id": 15095,
    "hadith_number": 359,
    "tajuk_hadith": "Panduan Wanita yang Mengalami Istihadah dalam Solat",
    "perawi_melayu": "Dikatakan oleh 'Aisyah:",
    "english_text": "Fatimah bint Abi Hubaish datang kepada Rasulullah SAW dan berkata: \"Saya seorang wanita yang mengalami istihadah dan tidak pernah suci. Adakah saya perlu berhenti solat?\" Baginda bersabda: \"Tidak, itu bukan haid. Apabila haid datang, berhentilah solat, dan apabila selesai, basuh darah itu dan solatlah.\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا عَبْدَةُ، وَوَكِيعٌ، وَأَبُو مُعَاوِيَةَ قَالُوا حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ جَاءَتْ فَاطِمَةُ بِنْتُ أَبِي حُبَيْشٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ إِنِّي امْرَأَةٌ أُسْتَحَاضُ فَلاَ أَطْهُرُ أَفَأَدَعُ الصَّلاَةَ قَالَ ‏\n\"‏ لاَ إِنَّمَا ذَلِكِ عِرْقٌ وَلَيْسَتْ بِالْحِيضَةِ فَإِذَا أَقْبَلَتِ الْحِيضَةُ فَدَعِي الصَّلاَةَ وَإِذَا أَدْبَرَتْ فَاغْسِلِي عَنْكِ الدَّمَ وَصَلِّي ‏\"‏ ‏.‏",
    "malay_translation": "Fatimah binti Abi Hubaish datang kepada Rasulullah SAW dan berkata, \"Saya seorang wanita yang mengalami istihadah dan tidak pernah suci. Adakah saya perlu berhenti solat?\" Baginda menjawab, \"Tidak, itu bukanlah haid. Apabila haid datang, berhentilah solat, dan apabila ia reda, basuhlah darah dan teruskan solat.\""
  },
  {
    "id": 15096,
    "hadith_number": 360,
    "tajuk_hadith": "Panduan Wanita yang Mengalami Istihadah pada Zaman Rasulullah SAW",
    "perawi_melayu": "",
    "english_text": "It was narrated from 'Aishah that a woman who suffered from Istihadah at the time of the Messenger of Allah (ﷺ) was told that it was a stubborn vein (i.e., one that would not stop bleeding). She was told to delay Zuhr and bring 'Asr forward, and to perform one Ghusl for both, and to delay Maghrib and bring 'Isha' forward, and to perform one Ghusl for both, and she would perform one Ghusl for Subh.",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ امْرَأَةً، مُسْتَحَاضَةً عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم قِيلَ لَهَا إِنَّهُ عِرْقٌ عَانِدٌ وَأُمِرَتْ أَنْ تُؤَخِّرَ الظُّهْرَ وَتُعَجِّلَ الْعَصْرَ وَتَغْتَسِلَ لَهُمَا غُسْلاً وَاحِدًا وَتُؤَخِّرَ الْمَغْرِبَ وَتُعَجِّلَ الْعِشَاءَ وَتَغْتَسِلَ لَهُمَا غُسْلاً وَاحِدًا وَتَغْتَسِلَ لِصَلاَةِ الصُّبْحِ غُسْلاً وَاحِدًا ‏.‏",
    "malay_translation": "Diriwayatkan daripada 'Aishah bahawa pada zaman Rasulullah SAW, seorang wanita yang mengalami istihadah diberitahu bahawa ia adalah urat yang kuat dan tidak berhenti mengeluarkan darah. Beliau diarahkan untuk menangguhkan solat Zuhur dan mempercepatkan solat 'Asr, dan melakukan satu wuduk bagi kedua-dua solat tersebut. Kemudian menangguhkan solat Maghrib dan mempercepatkan solat 'Isyak, dan melakukan satu wuduk bagi kedua-dua solat tersebut. Dan beliau perlu melakukan satu wuduk untuk solat Subuh."
  },
  {
    "id": 15097,
    "hadith_number": 361,
    "tajuk_hadith": "Panduan Solat Wanita Dalam Keadaan Istihadah",
    "perawi_melayu": "Dikisahkan oleh Zainab binti Jahsh bahawa:",
    "english_text": "\"I said to the Prophet (ﷺ) that I was suffering from Istihadah. He said: 'Do not pray during the days of your period, then perform Ghusl and delay Zuhr and bring Maghrib and bring 'Isha' forward and pray them together, and perform Ghusl for Fajr.\"",
    "arabic_text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، عَنْ سُفْيَانَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنِ الْقَاسِمِ، عَنْ زَيْنَبَ بِنْتِ جَحْشٍ، قَالَتْ قُلْتُ لِلنَّبِيِّ صلى الله عليه وسلم إِنَّهَا مُسْتَحَاضَةٌ ‏.‏ فَقَالَ ‏\n\"‏ تَجْلِسُ أَيَّامَ أَقْرَائِهَا ثُمَّ تَغْتَسِلُ وَتُؤَخِّرُ الظُّهْرَ وَتُعَجِّلُ الْعَصْرَ وَتَغْتَسِلُ وَتُصَلِّي وَتُؤَخِّرُ الْمَغْرِبَ وَتُعَجِّلُ الْعِشَاءَ وَتَغْتَسِلُ وَتُصَلِّيهِمَا جَمِيعًا وَتَغْتَسِلُ لِلْفَجْرِ ‏\"‏ ‏.‏",
    "malay_translation": "Saya berkata kepada Nabi SAW, \"Saya mengalami istihadah.\" Baginda bersabda, \"Jangan solat semasa hari-hari haid. Kemudian, mandilah (Ghusl), kemudian tangguhkan solat Zuhur, dan percepatkan solat Maghrib serta Isyak. Solatkan kedua-dua solat tersebut secara bersamaan, dan mandi (Ghusl) untuk solat Subuh.\""
  },
  {
    "id": 15098,
    "hadith_number": 362,
    "tajuk_hadith": "Hukum Mengendalikan Darah Istihadah",
    "perawi_melayu": "Dikisahkan oleh Fatimah binti Abi Hubaish bahawa beliau mengalami Istihadah. Baginda Rasulullah SAW bersabda kepadanya:",
    "english_text": "\"If it is menstrual blood then it is blood that is black and recognizable, so stop prying, and if it is other than that then perform Wudu', for it is just a vein.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، - وَهُوَ ابْنُ عَلْقَمَةَ بْنِ وَقَّاصٍ - عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ فَاطِمَةَ بِنْتِ أَبِي حُبَيْشٍ، أَنَّهَا كَانَتْ تُسْتَحَاضُ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا كَانَ دَمُ الْحَيْضِ - فَإِنَّهُ دَمٌ أَسْوَدُ يُعْرَفُ - فَأَمْسِكِي عَنِ الصَّلاَةِ وَإِذَا كَانَ الآخَرُ فَتَوَضَّئِي فَإِنَّمَا هُوَ عِرْقٌ ‏\"‏ ‏.‏ قَالَ مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ هَذَا مِنْ كِتَابِهِ ‏.‏",
    "malay_translation": "Jika ia darah haid, maka ia darah yang hitam dan jelas kelihatan, maka berhentilah daripada melakukan amalan yang melampaui batas. Dan jika ia bukan darah haid, maka lakukanlah wuduk, kerana ia hanyalah urat darah."
  },
  {
    "id": 15099,
    "hadith_number": 363,
    "tajuk_hadith": "Hukum Solat Semasa Haid dan Istihadhah",
    "perawi_melayu": "Dikisahkan oleh 'Aishah bahawa Fatimah binti Abi Hubaish mengalami Istihadhah. Rasulullah SAW bersabda:",
    "english_text": "\"Menstrual blood is blood that is black and recognizable, so if it is like that, then stop praying, and if it is otherwise, then perform Wudu' and pray.\"\nAbu 'Abdur-Rahman said: Others reported this Hadith, and none of them mentioned what Ibn 'Adi mentioned, and Allah knows best.",
    "arabic_text": "وَأَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، مِنْ حِفْظِهِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ فَاطِمَةَ بِنْتَ أَبِي حُبَيْشٍ، كَانَتْ تُسْتَحَاضُ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ دَمَ الْحَيْضِ دَمٌ أَسْوَدُ يُعْرَفُ فَإِذَا كَانَ ذَلِكِ فَأَمْسِكِي عَنِ الصَّلاَةِ فَإِذَا كَانَ الآخَرُ فَتَوَضَّئِي وَصَلِّي ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ قَدْ رَوَى هَذَا الْحَدِيثَ غَيْرُ وَاحِدٍ وَلَمْ يَذْكُرْ أَحَدٌ مِنْهُمْ مَا ذَكَرَ ابْنُ أَبِي عَدِيٍّ وَاللَّهُ تَعَالَى أَعْلَمُ ‏.‏",
    "malay_translation": "Darah haid itu adalah darah yang hitam dan boleh dikenali. Jika ia seperti itu, maka berhentilah daripada solat. Jika sebaliknya, maka lakukan wuduk dan solat.\nAbu 'Abdur-Rahman berkata:  Ada riwayat lain daripada Hadith ini, namun tiada seorang pun yang menyebut apa yang disebut oleh Ibn 'Adi. Wallahu a'lam."
  },
  {
    "id": 15100,
    "hadith_number": 364,
    "tajuk_hadith": "Penjelasan Tentang Perdarahan Istihadah dan Solat",
    "perawi_melayu": "'Aishah r.a. berkata:",
    "english_text": "\"Fatimah bint Abi Hubaish mengalami Istihadah dan dia bertanya kepada Rasulullah SAW: 'Wahai Rasulullah, saya mengalami Istihadah dan tidak suci. Adakah saya perlu berhenti solat?' Rasulullah SAW menjawab: 'Itu hanyalah urat dan bukanlah haid. Apabila datang haid, berhentilah daripada solat, dan apabila ia reda, basuhlah darah dari diri anda dan lakukan wuduk'. Itu hanyalah urat dan bukanlah haid.'\"\nDikatakan kepadanya (salah seorang perawi): \"Bagaimana pula dengan mandi wajib (ghusl)?\" Dia menjawab: \"Tiada siapa yang ragu tentang perkara itu.\"",
    "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ، عَنْ حَمَّادٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتِ اسْتُحِيضَتْ فَاطِمَةُ بِنْتُ أَبِي حُبَيْشٍ فَسَأَلَتِ النَّبِيَّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي أُسْتَحَاضُ فَلاَ أَطْهُرُ أَفَأَدَعُ الصَّلاَةَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا ذَلِكِ عِرْقٌ وَلَيْسَتْ بِالْحِيضَةِ فَإِذَا أَقْبَلَتِ الْحِيضَةُ فَدَعِي الصَّلاَةَ وَإِذَا أَدْبَرَتْ فَاغْسِلِي عَنْكِ الدَّمَ وَتَوَضَّئِي وَصَلِّي فَإِنَّمَا ذَلِكِ عِرْقٌ وَلَيْسَتْ بِالْحَيْضَةِ ‏\"‏ ‏.‏ قِيلَ لَهُ فَالْغُسْلُ قَالَ ‏\"‏ وَذَلِكَ لاَ يَشُكُّ فِيهِ أَحَدٌ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ قَدْ رَوَى هَذَا الْحَدِيثَ غَيْرُ وَاحِدٍ عَنْ هِشَامِ بْنِ عُرْوَةَ وَلَمْ يَذْكُرْ فِيهِ ‏\"‏ وَتَوَضَّئِي ‏\"‏ ‏.‏ غَيْرُ حَمَّادٍ وَاللَّهُ تَعَالَى أَعْلَمُ ‏.‏",
    "malay_translation": "Dikhabarkan oleh Yahya bin Habib bin Arabi, daripada Hammad, daripada Hisyam bin 'Urwah, daripada bapanya, daripada 'Aishah r.a. yang berkata: \"Fatimah binti Abi Hubaish mengalami Istihadah dan dia bertanya kepada Nabi SAW, 'Wahai Rasulullah, saya mengalami Istihadah dan tidak suci. Adakah saya perlu berhenti solat?' Rasulullah SAW menjawab, 'Itu hanyalah urat dan bukanlah haid. Apabila datang haid, berhentilah daripada solat, dan apabila ia reda, basuhlah darah dari diri anda dan lakukan wuduk. Itu hanyalah urat dan bukanlah haid.'\" Dikatakan kepadanya (salah seorang perawi), 'Bagaimana pula dengan mandi wajib (ghusl)?' Dia menjawab, 'Tiada siapa yang ragu tentang perkara itu.'  Abu Abdurrahman berkata, 'Hadis ini diriwayatkan oleh beberapa orang daripada Hisyam bin 'Urwah dan tidak menyebut 'dan lakukan wuduk'. Bukan Hammad. Allah SWT lebih mengetahui.'"
  },
  {
    "id": 15101,
    "hadith_number": 365,
    "tajuk_hadith": "Penjelasan Mengenai Haid dan Istihadhah",
    "perawi_melayu": "'Aishah meriwayatkan",
    "english_text": "\"Fatimah bint Abi Hubaish berkata kepada Rasulullah SAW: 'Wahai Rasulullah SAW, aku tidak suci. Bolehkah aku berhenti solat?' Rasulullah SAW menjawab: 'Itu adalah urat darah, bukan haid. Apabila haid datang, berhentilah daripada solat. Apabila ia berhenti, bersihkan darah dan solatlah.'\"",
    "arabic_text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ فَاطِمَةَ بِنْتَ أَبِي حُبَيْشٍ، أَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي أُسْتَحَاضُ فَلاَ أَطْهُرُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّمَا ذَلِكِ عِرْقٌ وَلَيْسَتْ بِالْحِيضَةِ فَإِذَا أَقْبَلَتِ الْحِيضَةُ فَأَمْسِكِي عَنِ الصَّلاَةِ وَإِذَا أَدْبَرَتْ فَاغْسِلِي عَنْكِ الدَّمَ وَصَلِّي ‏\"‏ ‏.‏",
    "malay_translation": "Fatimah binti Abi Hubaish menghadap Rasulullah SAW dan berkata, \"Wahai Rasulullah SAW, aku tidak suci. Adakah aku perlu berhenti solat?\"  Rasulullah SAW menjawab, \"Itu adalah urat darah, bukan haid.  Apabila haid datang, berhentilah daripada solat. Apabila ia berhenti, bersihkanlah darah dan teruskan solat.\""
  },
  {
    "id": 15102,
    "hadith_number": 366,
    "tajuk_hadith": "Penjelasan Mengenai Keadaan Tidak Suci Sementara dan Solat",
    "perawi_melayu": "Dikatakan oleh 'Aishah:",
    "english_text": "Fatimah bint Abi Hubaish berkata kepada Rasulullah SAW, \"Wahai Rasulullah SAW, aku tidak suci. Adakah aku perlu berhenti solat?\" Rasulullah SAW bersabda, \"Itu hanyalah urat, bukan haid. Apabila datang haid, berhentilah solat, dan apabila tempoh yang sama seperti tempoh haid biasa sudah berlalu, maka basuhlah darah dari diri anda dan solatlah.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ قَالَتْ فَاطِمَةُ بِنْتُ أَبِي حُبَيْشٍ لِرَسُولِ اللَّهِ صلى الله عليه وسلم لاَ أَطْهُرُ أَفَأَدَعُ الصَّلاَةَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّمَا ذَلِكِ عِرْقٌ وَلَيْسَتْ بِالْحِيضَةِ فَإِذَا أَقْبَلَتِ الْحِيضَةُ فَدَعِي الصَّلاَةَ وَإِذَا ذَهَبَ قَدْرُهَا فَاغْسِلِي عَنْكِ الدَّمَ وَصَلِّي ‏\"‏ ‏.‏",
    "malay_translation": "Fatimah binti Abi Hubaish bertanya kepada Rasulullah SAW, \"Wahai Rasulullah SAW, aku tidak suci. Adakah aku perlu meninggalkan solat?\"  Rasulullah SAW menjawab, \"Itu hanyalah urat, bukan haid. Apabila datang haid, tinggalkanlah solat. Dan apabila tempoh yang sama seperti tempoh haid biasa telah berlalu, basuhlah darah dari diri anda dan solatlah.\""
  },
  {
    "id": 15103,
    "hadith_number": 367,
    "tajuk_hadith": "Panduan Mengenai Ketidaksempurnaan dan Solat",
    "perawi_melayu": "Daripada 'Aishah رضي الله عنها bahawa anak perempuan Abu Hubaish berkata:",
    "english_text": "\"O Messenger of Allah, I do not become pure, so should I stop praying? He said: \"no, that is a vein.\" - (One of the narrators) Khalid said, in what I read from him - \"and it is not menstruation, so when your period comes, stop praying, and when it goes, wash the blood from yourself and pray.\"",
    "arabic_text": "أَخْبَرَنَا أَبُو الأَشْعَثِ، قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ سَمِعْتُ هِشَامًا، يُحَدِّثُ عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ بِنْتَ أَبِي حُبَيْشٍ، قَالَتْ يَا رَسُولَ اللَّهِ إِنِّي لاَ أَطْهُرُ أَفَأَتْرُكُ الصَّلاَةَ قَالَ ‏\"‏ لاَ إِنَّمَا هُوَ عِرْقٌ ‏\"‏ ‏.‏ قَالَ خَالِدٌ وَفِيمَا قَرَأْتُ عَلَيْهِ ‏\"‏ وَلَيْسَتْ بِالْحِيضَةِ فَإِذَا أَقْبَلَتِ الْحِيضَةُ فَدَعِي الصَّلاَةَ وَإِذَا أَدْبَرَتْ فَاغْسِلِي عَنْكِ الدَّمَ ثُمَّ صَلِّي ‏\"‏ ‏.‏",
    "malay_translation": "Wahai Rasulullah, aku tidak suci. Patutkah aku berhenti solat? Baginda bersabda, \"Tidak, ia hanyalah urat.\" Khalid berkata, dalam bacaan yang aku dapat daripadanya, \"Bukanlah ia haid. Maka, jika datang haid, berhentilah solat. Apabila ia reda, bersihkanlah darah daripada dirimu, kemudian solatlah."
  },
  {
    "id": 15104,
    "hadith_number": 368,
    "tajuk_hadith": "Pandangan Wanita Terdahulu Mengenai Pembuangan Cecair Kuning dan Coklat",
    "perawi_melayu": "Umm 'Atiyah telah meriwayatkan bahawa",
    "english_text": "\"Umm 'Atiyah berkata: 'Kami tidak menganggap lendir kuning dan coklat sebagai sesuatu yang penting.'\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ، قَالَ أَنْبَأَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، قَالَ قَالَتْ أُمُّ عَطِيَّةَ كُنَّا لاَ نَعُدُّ الصُّفْرَةَ وَالْكُدْرَةَ شَيْئًا ‏.‏",
    "malay_translation": "Umm 'Atiyah telah meriwayatkan, \"Kami, di masa dahulu, tidak menganggap lendir kuning dan coklat itu sebagai sesuatu yang penting.\" "
  },
  {
    "id": 15105,
    "hadith_number": 369,
    "tajuk_hadith": "Larangan dan Kebenaran Berinteraksi dengan Wanita Haid di Dalam Islam",
    "perawi_melayu": "Dikisahkan oleh Anas bahawa:",
    "english_text": "\"When one of their womenfolk menstruated, the Jews would not eat or drink with them, or mix with them in their houses. They (the Companions) asked the Prophet of Allah (ﷺ) about that, and Allah, the Mighty and Sublime, revealed the Ayah: They ask you concerning menstruation. Say: \"That is an Adha (a harmful thing). So the Messenger of Allah (ﷺ) commanded them to eat and drink with them (menstruating women) and to mix them in their houses, and to do everything with them except intercourse. The Jews said: 'The Messenger of Allah (ﷺ) does not leave anything of our affairs except he goes against it.' Usaid bin Hudair and 'Abbad bin Bishr went and told the Messenger of Allah (ﷺ) and they said: 'Should we have intercourse with them when they are menstruating?' The expression of the Messenger of Allah (ﷺ) changed greatly until we thought he was angry with them, and they left. Then the Messenger of Allah (ﷺ) received a gift of milk, so he sent someone to bring them back and he gave them some to drink, so we knew that he was not angry with them.\"\n\n Al-Baqarah 2:222\n Al-Baqarah 2:222",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ كَانَتِ الْيَهُودُ إِذَا حَاضَتِ الْمَرْأَةُ مِنْهُمْ لَمْ يُؤَاكِلُوهُنَّ وَلاَ يُشَارِبُوهُنَّ وَلاَ يُجَامِعُوهُنَّ فِي الْبُيُوتِ فَسَأَلُوا النَّبِيَّ صلى الله عليه وسلم فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ وَيَسْأَلُونَكَ عَنِ الْمَحِيضِ قُلْ هُوَ أَذًى ‏}‏ الآيَةَ فَأَمَرَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُؤَاكِلُوهُنَّ وَيُشَارِبُوهُنَّ وَيُجَامِعُوهُنَّ فِي الْبُيُوتِ وَأَنْ يَصْنَعُوا بِهِنَّ كُلَّ شَىْءٍ مَا خَلاَ الْجِمَاعَ ‏.‏ فَقَالَتِ الْيَهُودُ مَا يَدَعُ رَسُولُ اللَّهِ صلى الله عليه وسلم شَيْئًا مِنْ أَمْرِنَا إِلاَّ خَالَفَنَا ‏.‏ فَقَامَ أُسَيْدُ بْنُ حُضَيْرٍ وَعَبَّادُ بْنُ بِشْرٍ فَأَخْبَرَا رَسُولَ اللَّهِ صلى الله عليه وسلم قَالاَ أَنُجَامِعُهُنَّ فِي الْمَحِيضِ فَتَمَعَّرَ رَسُولُ اللَّهِ صلى الله عليه وسلم تَمَعُّرًا شَدِيدًا حَتَّى ظَنَنَّا أَنَّهُ قَدْ غَضِبَ فَقَامَا فَاسْتَقْبَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم هَدِيَّةَ لَبَنٍ فَبَعَثَ فِي آثَارِهِمَا فَرَدَّهُمَا فَسَقَاهُمَا فَعُرِفَ أَنَّهُ لَمْ يَغْضَبْ عَلَيْهِمَا ‏.‏",
    "malay_translation": "Diceritakan oleh Anas bahawa kaum Yahudi dahulu tidak makan, minum, atau bercampur dengan wanita mereka ketika haid di rumah.  Para sahabat bertanya kepada Nabi SAW tentang hal ini, lalu Allah SWT menurunkan ayat: \"Mereka bertanya kepadamu tentang haid. Katakanlah: 'Itulah suatu gangguan.'\" Ayat ini kemudiannya memerintahkan kaum muslimin untuk makan dan minum bersama wanita yang sedang haid, dan bercampur dengan mereka di rumah, kecuali dalam hal jima'. Kaum Yahudi berkata, 'Nabi SAW tidak membiarkan perkara kami tanpa bercanggah dengannya.' Usaid bin Hudhair dan 'Abbad bin Bishr menghadap Nabi SAW dan bertanya, 'Bolehkah kami bersetubuh dengan mereka ketika haid?' Ekspresi Nabi SAW berubah dengan drastik hingga kami mengira baginda murka. Lalu mereka pun pergi. Kemudian, Nabi SAW menerima hadiah susu, lalu baginda menghantar orang untuk memanggil mereka kembali dan memberi mereka minum susu, maka kami mengetahui baginda tidak murka kepada mereka."
  },
  {
    "id": 15106,
    "hadith_number": 370,
    "tajuk_hadith": "Perintah Sedekah bagi Lelaki yang Bersetubuh dengan Isteri Ketika Haid",
    "perawi_melayu": "Daripada Ibn 'Abbas daripada Nabi SAW mengenai seorang lelaki yang bersetubuh dengan isterinya ketika haid.",
    "english_text": "\"Let him give a Dinar or half a Dinar in charity.\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، قَالَ حَدَّثَنِي الْحَكَمُ، عَنْ عَبْدِ الْحَمِيدِ، عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم فِي الرَّجُلِ يَأْتِي امْرَأَتَهُ وَهِيَ حَائِضٌ يَتَصَدَّقُ بِدِينَارٍ أَوْ بِنِصْفِ دِينَارٍ ‏.‏",
    "malay_translation": "Hendaklah dia memberi sedekah sebanyak satu dinar atau separuh dinar."
  },
  {
    "id": 15107,
    "hadith_number": 371,
    "tajuk_hadith": "Peristiwa Haid di Hadapan Rasulullah SAW",
    "perawi_melayu": "Umm Salamah meriwayatkan:",
    "english_text": "\"While I was lying down with the Messenger of Allah (ﷺ) under a blanket, my period came so I slipped away and put on the clothes I used to wear when I was menstruating. The Messenger of Allah (ﷺ) said: 'Are you menstruating?' I said: 'Yes.' Then he called me to lie down with him under the blanket.\" This is the wording of 'Ubaidullah bin Sa'eed.\n\n That is, one of the narrators in one of the chains, as the author reported it through\ndifferent chains, as he did when it preceded, see No. 284.",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، ح وَأَنْبَأَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي ح، وَأَنْبَأَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، - وَهُوَ ابْنُ الْحَارِثِ - قَالَ حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ، أَنَّ زَيْنَبَ بِنْتَ أَبِي سَلَمَةَ، حَدَّثَتْهُ أَنَّ أُمَّ سَلَمَةَ حَدَّثَتْهَا قَالَتْ، بَيْنَمَا أَنَا مُضْطَجِعَةٌ، مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ حِضْتُ فَانْسَلَلْتُ فَأَخَذْتُ ثِيَابَ حَيْضَتِي فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَنَفِسْتِ ‏\"‏ ‏.‏ قُلْتُ نَعَمْ فَدَعَانِي فَاضْطَجَعْتُ مَعَهُ فِي الْخَمِيلَةِ ‏.‏ وَاللَّفْظُ لِعُبَيْدِ اللَّهِ بْنِ سَعِيدٍ ‏.‏",
    "malay_translation": "Umm Salamah meriwayatkan bahawa ketika baginda Rasulullah SAW berada di dalam selimut dengannya, beliau mengalami haid. Maka beliau keluar dari selimut tersebut dan memakai pakaian haid. Kemudian baginda Rasulullah SAW bertanya, \"Adakah engkau sedang haid?\" Jawabnya, \"Ya.\" Kemudian baginda Rasulullah SAW memanggilnya untuk kembali berbaring bersama baginda dalam selimut tersebut. Ini lafaz yang diriwayatkan oleh 'Ubaidullah bin Sa'eed. Ia adalah salah satu daripada perawi dalam salah satu sanad yang diriwayatkan oleh penulis melalui beberapa sanad yang berbeza, seperti yang telah disebutkan sebelum ini, sila rujuk No. 284."
  },
  {
    "id": 15108,
    "hadith_number": 372,
    "tajuk_hadith": "Perlakuan Rasulullah SAW Ketika Istri dalam Keadaan Haid",
    "perawi_melayu": "Dikisahkan oleh 'Aishah r.a.",
    "english_text": "\"The Messenger of Allah (ﷺ) and I would sleep under a single blanket when I was menstruating. If anything got on him from me, he would wash that spot and no more, and pray in it, then come back. If anything got on it again from me, he would do likewise and no more, and he would pray in it.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا يَحْيَى، عَنْ جَابِرِ بْنِ صُبْحٍ، قَالَ سَمِعْتُ خِلاَسًا، يُحَدِّثُ عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أَنَا وَرَسُولُ اللَّهِ، صلى الله عليه وسلم نَبِيتُ فِي الشِّعَارِ الْوَاحِدِ وَأَنَا طَامِثٌ حَائِضٌ فَإِنْ أَصَابَهُ مِنِّي شَىْءٌ غَسَلَ مَكَانَهُ لَمْ يَعْدُهُ ثُمَّ صَلَّى فِيهِ ثُمَّ يَعُودُ فَإِنْ أَصَابَهُ مِنِّي شَىْءٌ فَعَلَ مِثْلَ ذَلِكَ غَسَلَ مَكَانَهُ لَمْ يَعْدُهُ وَصَلَّى فِيهِ ‏.‏",
    "malay_translation": "Rasulullah SAW dan saya pernah tidur di bawah sehelai selimut yang sama ketika saya sedang haid. Sekiranya sesuatu terkena beliau dari saya, beliau akan membersihkan tempat tersebut sahaja dan tidak lebih daripada itu, lalu menunaikan solat di tempat tersebut, kemudian kembali ke tempat asal. Sekiranya sesuatu terkena beliau dari saya sekali lagi, beliau akan berbuat demikian dan tidak akan mengulangi lebih daripada itu, dan beliau akan menunaikan solat di tempat tersebut."
  },
  {
    "id": 15109,
    "hadith_number": 373,
    "tajuk_hadith": "Petunjuk Rasulullah SAW Mengenai Wanita Haid",
    "perawi_melayu": "Diceritakan oleh 'Aishah r.a.:",
    "english_text": "\"The Messenger of Allah (ﷺ) would tell one of us, if she was menstruating, to tie her Izar (waist wrap) tightly then he would fondle her.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَمْرِو بْنِ شُرَحْبِيلَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَأْمُرُ إِحْدَانَا إِذَا كَانَتْ حَائِضًا أَنْ تَشُدَّ إِزَارَهَا ثُمَّ يُبَاشِرُهَا ‏.‏",
    "malay_translation": "Rasulullah SAW pernah memberi arahan kepada salah seorang di antara kita, jika dia sedang haid, supaya mengikat kain Izarnya dengan erat, kemudian beliau akan menyentuhnya (melakukan hubungan intim).  (Riwayat 'Aishah r.a.)"
  },
  {
    "id": 15110,
    "hadith_number": 374,
    "tajuk_hadith": "Tindakan Rasulullah SAW Terhadap Wanita Haid",
    "perawi_melayu": "'Aishah r.a. meriwayatkan:",
    "english_text": "\"If one of us was menstruating, the Messenger of Allah (ﷺ) would tell her to put on an Izar (waist wrap) then he would fondle her.\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ كَانَتْ إِحْدَانَا إِذَا حَاضَتْ أَمَرَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ تَتَّزِرَ ثُمَّ يُبَاشِرُهَا ‏.‏",
    "malay_translation": "Jika salah seorang daripada kita mengalami haid, Rasulullah SAW akan suruh dia memakai izar (kain pelikat) kemudian akan berinteraksi dengannya."
  },
  {
    "id": 15111,
    "hadith_number": 375,
    "tajuk_hadith": "Tindakan Nabi SAW Ketika Isteri Menstruasi",
    "perawi_melayu": "Jumai' bin 'Umair berkata:",
    "english_text": "\"I entered upon 'Aishah with my mother and maternal aunt, and we asked her what the Prophet (ﷺ) used to do when one of (his wives) was menstruating. She said: He would tell us, when when of us menstruated, to wrap a wide Izar around herself then he would embrace her chest and breasts.",
    "arabic_text": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، عَنِ ابْنِ عَيَّاشٍ، - وَهُوَ أَبُو بَكْرٍ - عَنْ صَدَقَةَ بْنِ سَعِيدٍ، ثُمَّ ذَكَرَ كَلِمَةً مَعْنَاهَا حَدَّثَنَا جُمَيْعُ بْنُ عُمَيْرٍ، قَالَ دَخَلْتُ عَلَى عَائِشَةَ مَعَ أُمِّي وَخَالَتِي فَسَأَلَتَاهَا كَيْفَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصْنَعُ إِذَا حَاضَتْ إِحْدَاكُنَّ قَالَتْ كَانَ يَأْمُرُنَا إِذَا حَاضَتْ إِحْدَانَا أَنْ تَتَّزِرَ بِإِزَارٍ وَاسِعٍ ثُمَّ يَلْتَزِمُ صَدْرَهَا وَثَدْيَيْهَا ‏.‏",
    "malay_translation": "Saya masuk menemui 'Aishah bersama ibu dan bibiku, lalu kami bertanya kepadanya tentang apa yang dilakukan oleh Nabi SAW (ﷺ) apabila salah seorang isterinya mengalami haid. Beliau menjawab: Baginda akan memerintahkan kita, apabila salah seorang daripada kita mengalami haid, supaya melilitkan kain Izar yang luas pada dirinya, kemudian akan memeluk dadanya dan payudaranya."
  },
  {
    "id": 15112,
    "hadith_number": 376,
    "tajuk_hadith": "Perlakuan Rasulullah SAW dengan Isteri yang Haid",
    "perawi_melayu": "Dikatakan oleh Maimunah:",
    "english_text": "\"The Messenger of Allah (ﷺ) would fondle one of his wives when she was menstruating, if she wore and Izar (waist wrap) that reached halfway down her thighs or to her knees.",
    "arabic_text": "أَخْبَرَنَا الْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ وَهْبٍ، عَنْ يُونُسَ، وَاللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ حَبِيبٍ، مَوْلَى عُرْوَةَ عَنْ بُدَيَّةَ، - وَكَانَ اللَّيْثُ يَقُولُ نَدَبَةَ - مَوْلاَةِ مَيْمُونَةَ عَنْ مَيْمُونَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُبَاشِرُ الْمَرْأَةَ مِنْ نِسَائِهِ وَهِيَ حَائِضٌ إِذَا كَانَ عَلَيْهَا إِزَارٌ يَبْلُغُ أَنْصَافَ الْفَخِذَيْنِ وَالرُّكْبَتَيْنِ فِي حَدِيثِ اللَّيْثِ تَحْتَجِزُ بِهِ ‏.‏",
    "malay_translation": "Rasulullah SAW dilaporkan pernah menyentuh salah seorang isterinya ketika isteri itu sedang dalam keadaan haid, sekiranya isteri tersebut memakai `Izar` (tali pinggang) yang menutup separuh bahagian paha atau sampai ke lutut."
  },
  {
    "id": 15113,
    "hadith_number": 377,
    "tajuk_hadith": "Bolehkah Wanita Makan Bersama Suaminya ketika Haid?",
    "perawi_melayu": "Dikisahkan oleh Shuraih, beliau bertanya kepada 'Aisyah:",
    "english_text": "\"Can a woman eat with her husband while she is menstruating?' She said: 'Yes. The Messenger of Allah (ﷺ) would call me to eat with him while I was menstruating. He would take a piece of bone on which some bits of meat were left and insist that I take it first, so I would nibble a little from it, then put it down. Then he would take it and nibble from it, and he would put his mouth where mine had been on the bone. Then he would call for a drink and insist that I take it first before he drank from it. So I would take it and drink from it, then put it down, then he would take it and drink from it, putting his mouth where mine had been on the cup.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدِ بْنِ جَمِيلِ بْنِ طَرِيفٍ، قَالَ أَنْبَأَنَا يَزِيدُ بْنُ الْمِقْدَامِ بْنِ شُرَيْحِ بْنِ هَانِئٍ، عَنْ أَبِيهِ، عَنْ شُرَيْحٍ، أَنَّهُ سَأَلَ عَائِشَةَ هَلْ تَأْكُلُ الْمَرْأَةُ مَعَ زَوْجِهَا وَهِيَ طَامِثٌ قَالَتْ نَعَمْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدْعُونِي فَآكُلُ مَعَهُ وَأَنَا عَارِكٌ كَانَ يَأْخُذُ الْعَرْقَ فَيُقْسِمُ عَلَىَّ فِيهِ فَأَعْتَرِقُ مِنْهُ ثُمَّ أَضَعُهُ فَيَأْخُذُهُ فَيَعْتَرِقُ مِنْهُ وَيَضَعُ فَمَهُ حَيْثُ وَضَعْتُ فَمِي مِنَ الْعَرْقِ وَيَدْعُو بِالشَّرَابِ فَيُقْسِمُ عَلَىَّ فِيهِ مِنْ قَبْلِ أَنْ يَشْرَبَ مِنْهُ فَآخُذُهُ فَأَشْرَبُ مِنْهُ ثُمَّ أَضَعُهُ فَيَأْخُذُهُ فَيَشْرَبُ مِنْهُ وَيَضَعُ فَمَهُ حَيْثُ وَضَعْتُ فَمِي مِنَ الْقَدَحِ ‏.‏",
    "malay_translation": "Adakah seorang wanita boleh makan bersama suaminya ketika sedang haid?  'Aisyah menjawab, 'Ya. Rasulullah SAW akan mengajakku makan bersamanya ketika aku sedang haid. Baginda akan mengambil tulang yang masih ada sedikit daging dan meminta aku mengambilnya terlebih dahulu.  Aku akan sedikit menggigitnya, kemudian meletakkannya. Kemudian baginda mengambilnya, menggigitnya, dan meletakkan mulutnya pada tempat mulutku berada pada tulang tersebut.  Kemudian baginda akan meminta minuman dan menyuruh aku mengambilnya terlebih dahulu sebelum baginda minum. Aku akan mengambilnya, minum, dan meletakkannya.  Kemudian baginda akan mengambilnya dan minum, dan meletakkan mulutnya pada tempat mulutku berada pada gelas itu.'"
  },
  {
    "id": 15114,
    "hadith_number": 378,
    "tajuk_hadith": "Rasulullah SAW Mengambil Minuman Selepas Sahabatnya Ketika Haid",
    "perawi_melayu": "Daripada Al-Miqdam bin Shuraih, daripada bapanya, daripada 'Aisyah r.a., yang berkata:",
    "english_text": "\"The Messenger of Allah (ﷺ) would put his mouth on the place from which I had drunk, and he would drink from my leftovers when I was menstruating.\"",
    "arabic_text": "أَخْبَرَنِي أَيُّوبُ بْنُ مُحَمَّدٍ الْوَزَّانُ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو، عَنِ الأَعْمَشِ، عَنِ الْمِقْدَامِ بْنِ شُرَيْحٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَضَعُ فَاهُ عَلَى الْمَوْضِعِ الَّذِي أَشْرَبُ مِنْهُ وَيَشْرَبُ مِنْ فَضْلِ شَرَابِي وَأَنَا حَائِضٌ ‏.‏",
    "malay_translation": "Daripada perawi, Al-Miqdam bin Shuraih daripada bapanya, daripada 'Aisyah r.a.,  ia berkata: \"Rasulullah SAW akan meletakkan mulutnya ke tempat aku minum, dan baginda akan minum dari sisa minuman aku ketika aku sedang haid.\""
  },
  {
    "id": 15115,
    "hadith_number": 379,
    "tajuk_hadith": "Cara Rasulullah SAW Berurus Dengan Sahabat Yang Dalam Keadaan Haid",
    "perawi_melayu": "Disebutkan daripada Al-Miqdam bin Shuraih bahawa bapanya berkata:",
    "english_text": "\"I heard 'Aishah say: 'The Messenger of Allah (ﷺ) would give me the vessel and I would drink from it, when I was menstruating, then I would give it to him and he would look for the place where I had put my mouth and put that to his mouth.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ مِسْعَرٍ، عَنِ الْمِقْدَامِ بْنِ شُرَيْحٍ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ عَائِشَةَ، تَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُنَاوِلُنِي الإِنَاءَ فَأَشْرَبُ مِنْهُ وَأَنَا حَائِضٌ ثُمَّ أُعْطِيهِ فَيَتَحَرَّى مَوْضِعَ فَمِي فَيَضَعُهُ عَلَى فِيهِ ‏.‏",
    "malay_translation": "Aku mendengar 'Aishah r.a. berkata, \"Rasulullah SAW akan memberikan bekas kepada saya, dan saya akan minum daripadanya ketika saya dalam keadaan haid, kemudian saya akan memberikannya kembali kepada Baginda SAW, lalu Baginda akan mencari tempat di mana saya meletakkan mulut saya dan meletakkannya ke mulut Baginda SAW.\""
  },
  {
    "id": 15116,
    "hadith_number": 380,
    "tajuk_hadith": "Hadis tentang Nabi SAW dan Minuman Wanita Haid",
    "perawi_melayu": "Dikisahkan oleh 'Aisyah رضي الله عنها berkata:",
    "english_text": "\"I would drink when I was menstruating, then I would hand it to the Prophet (ﷺ), and he would put his mouth where mine had been and drink. And I would nibble at a bone on which some bits of meat were left when I was menstruating, then I would give it to the Prophet (ﷺ) and he would put his mouth where my mouth had been.\"",
    "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا وَكِيعٌ، قَالَ حَدَّثَنَا مِسْعَرٌ، وَسُفْيَانُ، عَنِ الْمِقْدَامِ بْنِ شُرَيْحٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أَشْرَبُ مِنَ الْقَدَحِ وَأَنَا حَائِضٌ، فَأُنَاوِلُهُ النَّبِيَّ صلى الله عليه وسلم فَيَضَعُ فَاهُ عَلَى مَوْضِعِ فِيَّ فَيَشْرَبُ مِنْهُ وَأَتَعَرَّقُ مِنَ الْعَرْقِ وَأَنَا حَائِضٌ فَأُنَاوِلُهُ النَّبِيَّ صلى الله عليه وسلم فَيَضَعُ فَاهُ عَلَى مَوْضِعِ فِيَّ ‏.‏",
    "malay_translation": "Dikatakan oleh 'Aisyah رضي الله عنها, \"Saya pernah minum dari cawan ketika saya sedang haid, kemudian saya akan menghulurkan cawan itu kepada Nabi SAW, dan baginda akan meletakkan mulut baginda pada tempat mulut saya dan minum daripadanya. Saya juga pernah makan sedikit daging yang masih melekat pada tulang ketika haid, kemudian saya akan menghulurkan tulang tersebut kepada Nabi SAW, dan baginda akan meletakkan mulut baginda pada tempat mulut saya.\""
  },
  {
    "id": 15117,
    "hadith_number": 381,
    "tajuk_hadith": "Rasulullah SAW Bersandar di Pangkuan Wanita Haid dan Membaca Al-Quran",
    "perawi_melayu": "Dikatakan oleh 'Aishah:",
    "english_text": "\"The head of the Messenger of Allah (ﷺ) would rest in the lap of one of us when she was menstruating, and he would recite Qur'an.\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَلِيُّ بْنُ حُجْرٍ، - وَاللَّفْظُ لَهُ - قَالاَ حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَأْسُ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي حِجْرِ إِحْدَانَا وَهِيَ حَائِضٌ وَهُوَ يَقْرَأُ الْقُرْآنَ ‏.‏",
    "malay_translation": "Kepala Rasulullah SAW akan bersandar di pangkuan salah seorang daripada kita ketika dia sedang haid, dan Baginda akan membaca Al-Quran."
  },
  {
    "id": 15118,
    "hadith_number": 382,
    "tajuk_hadith": "Perempuan Haid dan Solat Tertunggak",
    "perawi_melayu": "Dikatakan oleh Mu'adhah Al-'Adawiyyah:",
    "english_text": "\"A woman asked 'Aishah: 'Should a menstruating woman make up the Salah she misses? She said: 'Are you a Haruri?  We used to menstruate during the time of Allah's Messenger (ﷺ) but we did not make up the missed Salah nor were we commanded to do so.'\"\n\n Meaning are you one of the Khawarij. Harura is a place associated with a group of the Khawarij.",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ، قَالَ أَنْبَأَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ مُعَاذَةَ الْعَدَوِيَّةِ، قَالَتْ سَأَلَتِ امْرَأَةٌ عَائِشَةَ أَتَقْضِي الْحَائِضُ الصَّلاَةَ فَقَالَتْ أَحَرُورِيَّةٌ أَنْتِ قَدْ كُنَّا نَحِيضُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلاَ نَقْضِي وَلاَ نُؤْمَرُ بِقَضَاءٍ ‏.‏",
    "malay_translation": "Seorang wanita bertanya kepada 'Aisyah, \"Adakah wanita haid perlu menggantikan solat yang tertinggal?\" Jawab 'Aisyah, \"Adakah engkau seorang Haruri?  Kami pernah mengalami haid semasa zaman Rasulullah SAW, namun kami tidak menggantikan solat yang tertinggal dan juga tidak diperintahkan untuk melakukannya.\" (Mengenai makna Haruri, ia adalah sekelompok Khawarij yang terkenal kerana berpegang kepada pendapat tertentu).  "
  },
  {
    "id": 15119,
    "hadith_number": 383,
    "tajuk_hadith": "Perintah Rasulullah SAW Meminta Kain dan Jawapan 'Aisyah r.a.",
    "perawi_melayu": "Abu Hurairah berkata:",
    "english_text": "\"While the Messenger of Allah (ﷺ) was in the Masjid, he said: 'O 'Aishah, hand me the garment.' She said: 'I am not praying.' He said: 'It is not in your hand.' So she gave it to him.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ يَزِيدَ بْنِ كَيْسَانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، قَالَ قَالَ أَبُو هُرَيْرَةَ بَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْمَسْجِدِ إِذْ قَالَ ‏\"‏ يَا عَائِشَةُ نَاوِلِينِي الثَّوْبَ ‏\"‏ ‏.‏ فَقَالَتْ إِنِّي لاَ أُصَلِّي ‏.‏ فَقَالَ ‏\"‏ إِنَّهُ لَيْسَ فِي يَدِكِ ‏\"‏ ‏.‏ فَنَاوَلَتْهُ ‏.‏",
    "malay_translation": "\"Ketika Rasulullah SAW berada di Masjid, baginda bersabda, 'Wahai 'Aisyah, berikanlah aku kain itu.' 'Aisyah r.a. menjawab, 'Saya tidak sedang menunaikan solat.' Baginda menjawab, 'Ia tidak ada di tanganmu.' Maka 'Aisyah r.a. memberikan kain itu kepada baginda.\""
  },
  {
    "id": 15120,
    "hadith_number": 384,
    "tajuk_hadith": "Menstruasi dan Kewajipan di Masjid",
    "perawi_melayu": "Dikisahkan bahawa 'Aisyah berkata:",
    "english_text": "\"The Messenger of Allah (ﷺ) said: 'Give me the mat from the MAsjid.' She said: 'I am menstruating.' The Messenger of Allah (ﷺ) said: 'Your menstruation is not in your hand.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ عَبِيدَةَ، عَنِ الأَعْمَشِ، ح وَأَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ ثَابِتِ بْنِ عُبَيْدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، قَالَ قَالَتْ عَائِشَةُ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَاوِلِينِي الْخُمْرَةَ مِنَ الْمَسْجِدِ ‏\"‏ ‏.‏ فَقُلْتُ إِنِّي حَائِضٌ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَيْسَتْ حَيْضَتُكِ فِي يَدِكِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, ‘Bawakan tikar dari masjid.’ Aku berkata, ‘Aku sedang haid.’ Rasulullah SAW bersabda, ‘Haidmu bukan di tanganmu.’"
  },
  {
    "id": 15121,
    "hadith_number": 385,
    "tajuk_hadith": "Hadis yang Serupa",
    "perawi_melayu": "",
    "english_text": "(Another chain) with similarity.",
    "arabic_text": "قَالَ إِسْحَاقُ أَنْبَأَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
    "malay_translation": " (Rantai periwayatan lain) dengan persamaan yang sama."
  },
  {
    "id": 15122,
    "hadith_number": 386,
    "tajuk_hadith": "Rasulullah SAW Meletakkan Kepala di Pangkuan Wanita Haid dan Membaca Al-Quran",
    "perawi_melayu": "Maimunah berkata:",
    "english_text": "\"The Messenger of Allah (ﷺ) used to lay his head in the lap of one of us and recite Qur'an while she was menstruating, and one of us would take the mat to the Masjid and spread it out when she was menstruating.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، عَنْ سُفْيَانَ، عَنْ مَنْبُوذٍ، عَنْ أُمِّهِ، أَنَّ مَيْمُونَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَضَعُ رَأْسَهُ فِي حِجْرِ إِحْدَانَا فَيَتْلُو الْقُرْآنَ وَهِيَ حَائِضٌ وَتَقُومُ إِحْدَانَا بِخُمْرَتِهِ إِلَى الْمَسْجِدِ فَتَبْسُطُهَا وَهِيَ حَائِضٌ ‏.‏",
    "malay_translation": "“Rasulullah SAW (ﷺ) pernah meletakkan kepalanya di pangkuan salah seorang dari kami ketika beliau sedang membaca Al-Quran, dan beliau berada dalam keadaan haid.  Ada di antara kami yang akan membawa tikar ke Masjid dan menghamparkannya ketika wanita itu sedang dalam keadaan haid.”"
  },
  {
    "id": 15123,
    "hadith_number": 387,
    "tajuk_hadith": "Perawi 'Aishah Menyisir Rambut Rasulullah SAW semasa Berihram dan Mengasingkan Diri (I'tikaf)",
    "perawi_melayu": "Aishah",
    "english_text": "It was narrated from 'Aishah that she used to comb the hair of the Messenger of Allah (ﷺ) when she was menstruating and he was performing I'tikaf. He would put his head out to her while she was in her room.",
    "arabic_text": "أَخْبَرَنَا نَصْرُ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الأَعْلَى، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّهَا كَانَتْ تُرَجِّلُ رَأْسَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهِيَ حَائِضٌ وَهُوَ مُعْتَكِفٌ فَيُنَاوِلُهَا رَأْسَهُ وَهِيَ فِي حُجْرَتِهَا ‏.‏",
    "malay_translation": "Daripada 'Aishah RA, diceritakan bahawa beliau biasa menyisir rambut Rasulullah SAW ketika Baginda sedang berihram dan mengasingkan diri (ber-i'tikaf). Baginda akan menjulurkan kepala keluar kepada 'Aishah ketika beliau berada di dalam biliknya."
  },
  {
    "id": 15124,
    "hadith_number": 388,
    "tajuk_hadith": "Rasulullah SAW Meletakkan Kepalanya Dekat Dengan Sahabat Ketika Beriktikaf Walau Diri Sahabat Masih Dalam Keadaan Haid",
    "perawi_melayu": "Diceritakan oleh 'Aishah r.a.",
    "english_text": "\"The Prophet (ﷺ) would put his head out while he was performing I'tikaf and I would wash it, while I was menstruating.\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنِي سُفْيَانُ، قَالَ حَدَّثَنِي مَنْصُورٌ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُدْنِي إِلَىَّ رَأْسَهُ وَهُوَ مُعْتَكِفٌ فَأَغْسِلُهُ وَأَنَا حَائِضٌ ‏.‏",
    "malay_translation": "Rasulullah SAW akan mendekatkan kepalanya kepada saya ketika baginda sedang beriktikaf, dan saya akan membasuhnya, sedangkan saya ketika itu sedang dalam keadaan haid."
  },
  {
    "id": 15125,
    "hadith_number": 389,
    "tajuk_hadith": "Rasulullah SAW Mengeluarkan Kepala Dari Masjid Ketika Beriktikaf, Walaupun dalam Keadaan Haid",
    "perawi_melayu": "Daripada 'Aishah:",
    "english_text": "\"The Messenger of Allah (ﷺ) used to put his head out of the Masjid while he was performing I'tikaf, and I would wash it, while I was menstruating.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا الْفُضَيْلُ، - وَهُوَ ابْنُ عِيَاضٍ - عَنِ الأَعْمَشِ، عَنْ تَمِيمِ بْنِ سَلَمَةَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُخْرِجُ رَأْسَهُ مِنَ الْمَسْجِدِ وَهُوَ مُعْتَكِفٌ فَأَغْسِلُهُ وَأَنَا حَائِضٌ ‏.‏",
    "malay_translation": "Rasulullah SAW (ﷺ) biasa mengeluarkan kepalanya daripada masjid ketika sedang beriktikaf, dan aku akan membasuh kepalanya, sedangkan aku sedang dalam keadaan haid."
  },
  {
    "id": 15126,
    "hadith_number": 390,
    "tajuk_hadith": "Mengikat Rambut Nabi SAW Ketika Haid",
    "perawi_melayu": "Dikatakan oleh 'Aisyah:",
    "english_text": "\"I used to comb the hair of the Messenger of Allah (ﷺ) while I was menstruating.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أُرَجِّلُ رَأْسَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَنَا حَائِضٌ ‏.‏",
    "malay_translation": "“Aku pernah menyisir rambut Rasulullah SAW ketika aku sedang haid.”"
  },
  {
    "id": 15127,
    "hadith_number": 391,
    "tajuk_hadith": "Panduan Wanita dalam Menghadirin Majlis dan Solat",
    "perawi_melayu": "Dikatakan oleh Hafsah,",
    "english_text": "\"Umm 'Atiyah would never mention the Messenger of Allah (ﷺ) without saying: 'May my father be ransomed for him.' I said: 'Did you hear the Messenger of Allah (ﷺ) say such and such?' And she said: 'Yes, may my father be ransomed for him.' He said: 'Let the mature girls, virgins staying in seclusion, and menstruating woman go out and witness the good occasions and the supplications of the Muslims, but let the menstruating women keep away from the prayer place.'\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ، قَالَ أَنْبَأَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ حَفْصَةَ، قَالَتْ كَانَتْ أُمُّ عَطِيَّةَ لاَ تَذْكُرُ رَسُولَ اللَّهِ صلى الله عليه وسلم إِلاَّ قَالَتْ بِأَبَا ‏.‏ فَقُلْتُ أَسَمِعْتِ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ كَذَا وَكَذَا قَالَتْ نَعَمْ بِأَبَا قَالَ ‏\n\"‏ لِتَخْرُجِ الْعَوَاتِقُ وَذَوَاتُ الْخُدُورِ وَالْحُيَّضُ فَيَشْهَدْنَ الْخَيْرَ وَدَعْوَةَ الْمُسْلِمِينَ وَتَعْتَزِلِ الْحُيَّضُ الْمُصَلَّى ‏\"‏ ‏.‏",
    "malay_translation": "\"Umm 'Atiyah tidak pernah menyebut Rasulullah SAW melainkan dengan kata-kata: 'Semoga bapa ku ditebus dengannya.' Aku bertanya: 'Adakah engkau mendengar Rasulullah SAW bersabda begini dan begitu?' Dia menjawab: 'Ya, semoga bapa ku ditebus dengannya.' Beliau bersabda: 'Hendaklah gadis-gadis matang, gadis-gadis yang menjaga kehormatannya, dan wanita haid keluar untuk menyaksikan majlis-majlis kebaikan dan doa umat Islam. Tetapi hendaklah wanita haid menjauhi tempat solat.'\""
  },
  {
    "id": 15128,
    "hadith_number": 392,
    "tajuk_hadith": "Peraturan Haid bagi Wanita yang Menunaikan Umrah",
    "perawi_melayu": "'Aishah r.a. meriwayatkan kepada Rasulullah s.a.w.",
    "english_text": "\"Safiyyah bint Huyai began menstruating.\" The Messenger of Allah (ﷺ) said: \"Perhaps she has detained us. Did she not circumambulate the House with you?\" She said: \"Yes.\" He said: \"Then you can leave.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ، قَالَ أَخْبَرَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ أَبِيهِ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِنَّ صَفِيَّةَ بِنْتَ حُيَىٍّ قَدْ حَاضَتْ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَعَلَّهَا تَحْبِسُنَا أَلَمْ تَكُنْ طَافَتْ مَعَكُنَّ بِالْبَيْتِ ‏\"‏ ‏.‏ قَالَتْ بَلَى ‏.‏ قَالَ ‏\"‏ فَاخْرُجْنَ ‏\"‏ ‏.‏",
    "malay_translation": "\"Safiyyah binti Huyai telah mengalami haid.\" Rasulullah s.a.w. bersabda, \"Mungkin dia telah menyebabkan kita tertangguh. Bukankah dia telah tawaf bersama kamu di Baitullah?\" Dia menjawab, \"Ya.\" Baginda bersabda, \"Maka pergilah kamu semua.\""
  },
  {
    "id": 15129,
    "hadith_number": 393,
    "tajuk_hadith": "Arahan kepada Wanita yang Baru Bersalin",
    "perawi_melayu": "Dari Jabir bin 'Abdullah tentang Asma' binti Umais, ketika beliau melahirkan di Dzul Hulaifah, Rasulullah SAW bersabda kepada Abu Bakar:",
    "english_text": "\"Tell her to perform Ghusl and (begin the Talbiyah).\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، فِي حَدِيثِ أَسْمَاءَ بِنْتِ عُمَيْسٍ حِينَ نُفِسَتْ بِذِي الْحُلَيْفَةِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لأَبِي بَكْرٍ ‏\n\"‏ مُرْهَا أَنْ تَغْتَسِلَ وَتُهِلَّ ‏\"‏ ‏.‏",
    "malay_translation": "\"Katakan kepadanya supaya mandi wajib (ghusl) dan memulakan talbiyah.\""
  },
  {
    "id": 15130,
    "hadith_number": 394,
    "tajuk_hadith": "Rasulullah SAW Menunaikan Solat Jenazah di Tengah-Tengah Mayat Umm Ka'b",
    "perawi_melayu": "Dikisahkan oleh Samurah, katanya:",
    "english_text": "\"I offered the funeral prayer with the Messenger of Allah (ﷺ) for Umm Ka'b who had died during childbirth, and during the prayer, the Messenger of Allah (ﷺ) stood at her middle.\"",
    "arabic_text": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، عَنْ عَبْدِ الْوَارِثِ، عَنْ حُسَيْنٍ، - يَعْنِي الْمُعَلِّمَ - عَنِ ابْنِ بُرَيْدَةَ، عَنْ سَمُرَةَ، قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى أُمِّ كَعْبٍ مَاتَتْ فِي نِفَاسِهَا فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الصَّلاَةِ فِي وَسَطِهَا ‏.‏",
    "malay_translation": "Aku telah menunaikan solat jenazah bersama Rasulullah SAW untuk Umm Ka'b yang meninggal dunia ketika nifas (selepas bersalin). Semasa solat itu, Rasulullah SAW berdiri di tengah-tengah mayatnya."
  },
  {
    "id": 15131,
    "hadith_number": 395,
    "tajuk_hadith": "Petunjuk Mengenai Darah Haid yang Menimpa Pakaian",
    "perawi_melayu": "Daripada Asma' binti Abi Bakr, ia meriwayatkan daripada seorang wanita yang bertanya kepada Rasulullah SAW tentang darah haid yang terkena pakaian.",
    "english_text": "\"Scratch it, then rub it with water, then sprinkle water over it, and pray in it.\"",
    "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، - وَكَانَتْ تَكُونُ فِي حِجْرِهَا - أَنَّ امْرَأَةً اسْتَفْتَتِ النَّبِيَّ صلى الله عليه وسلم عَنْ دَمِ الْحَيْضِ يُصِيبُ الثَّوْبَ فَقَالَ ‏\n\"‏ حُتِّيهِ وَاقْرُصِيهِ وَانْضَحِيهِ وَصَلِّي فِيهِ ‏\"‏ ‏.‏",
    "malay_translation": "“Korek ia, kemudian gosok dengan air, kemudian siram dengan air, dan solat di atasnya.”"
  },
  {
    "id": 15132,
    "hadith_number": 396,
    "tajuk_hadith": "Petunjuk Rasulullah SAW Mengenai Darah Haid yang Menimpa Pakaian",
    "perawi_melayu": "Dikatakan bahawa 'Adi bin Dinar berkata:",
    "english_text": "\"I heard Umm Qais bint Mihsan say that she asked the Messenger of Allah (ﷺ) about menstrual blood that gets on one's clothes. He said: 'Scratch it with a stick and wash it with water and lotus leaves.'\"",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي أَبُو الْمِقْدَامِ، ثَابِتٌ الْحَدَّادُ عَنْ عَدِيِّ بْنِ دِينَارٍ، قَالَ سَمِعْتُ أُمَّ قَيْسٍ بِنْتَ مِحْصَنٍ، أَنَّهَا سَأَلَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ دَمِ الْحِيضَةِ يُصِيبُ الثَّوْبَ قَالَ ‏\n\"‏ حُكِّيهِ بِضِلَعٍ وَاغْسِلِيهِ بِمَاءٍ وَسِدْرٍ ‏\"‏ ‏.‏",
    "malay_translation": "Umm Qais binti Mihsan menceritakan bahawa beliau bertanya kepada Rasulullah SAW tentang darah haid yang terkena pakaian. Baginda bersabda, 'Gosokkan dengan kayu dan basuh dengan air dan daun sirih.' ."
  }
]