[
  {
    "id": 18338,
    "hadith_number": 3602,
    "tajuk_hadith": "Harta Pusaka Rasulullah SAW",
    "perawi_melayu": "Daripada Amr bin Al-Harith berkata:",
    "english_text": "\"The Messenger of Allah did not leave behind a Dinar nor a Dirham, or any slave, male or female; except his white mule which he used to ride, his weapon and some land which he left to be used for the cause of Allah.\" (One of the narrators) Qutaibah said on one occasion: \"In charity.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَمْرِو بْنِ الْحَارِثِ، قَالَ مَا تَرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم دِينَارًا وَلاَ دِرْهَمًا وَلاَ عَبْدًا وَلاَ أَمَةً إِلاَّ بَغْلَتَهُ الشَّهْبَاءَ الَّتِي كَانَ يَرْكَبُهَا وَسِلاَحَهُ وَأَرْضًا جَعَلَهَا فِي سَبِيلِ اللَّهِ ‏.‏ وَقَالَ قُتَيْبَةُ مَرَّةً أُخْرَى صَدَقَةً ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah bin Sa’id, dia berkata; telah menceritakan kepada kami Abu Al-Ahwas, daripada Abi Ishaq, daripada Amr bin Al-Harith, katanya:  Rasulullah SAW tidak meninggalkan sebarang dinar mahupun dirham, ataupun hamba lelaki mahupun hamba perempuan, kecuali seekor keldai betina putih yang selalu ditungganginya, senjata baginda dan sebidang tanah yang diwakafkannya untuk jalan Allah.  Dan Qutaibah berkata pada satu ketika yang lain: \"(Tanah itu sebagai) sedekah.\""
  },
  {
    "id": 18339,
    "hadith_number": 3603,
    "tajuk_hadith": "Wasiat Rasulullah SAW",
    "perawi_melayu": "Abu Ishaq meriwayatkan:",
    "english_text": "\"I heard 'Amr bin Al-Harith say: 'The Messenger of Allah did not leave behind anything except his white mule, his weapon and some land which he left as a charity.'\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي أَبُو إِسْحَاقَ، قَالَ سَمِعْتُ عَمْرَو بْنَ الْحَارِثِ، يَقُولُ مَا تَرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلاَّ بَغْلَتَهُ الْبَيْضَاءَ وَسِلاَحَهُ وَأَرْضًا تَرَكَهَا صَدَقَةً ‏.‏",
    "malay_translation": "Aku mendengar Amr bin Al-Harith berkata: 'Rasulullah SAW tidak meninggalkan apa-apa kecuali seekor bagal putihnya, senjatanya, dan sebidang tanah yang diwakafkannya sebagai sedekah.'"
  },
  {
    "id": 18340,
    "hadith_number": 3604,
    "tajuk_hadith": "Pusaka Rasulullah SAW",
    "perawi_melayu": "Yunus bin Abi Ishaq meriwayatkan bahawa bapanya berkata:",
    "english_text": "\"I heard 'Amr bin Al-Harith say: 'I saw the Messenger of Allah and he left nothing behind except his white mule, his weapon and some land which he left as a charity.'\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ، قَالَ حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَاقَ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ عَمْرَو بْنَ الْحَارِثِ، يَقُولُ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم مَا تَرَكَ إِلاَّ بَغْلَتَهُ الشَّهْبَاءَ وَسِلاَحَهُ وَأَرْضًا تَرَكَهَا صَدَقَةً ‏.‏",
    "malay_translation": "Aku mendengar Amr bin Al-Harith berkata: 'Aku melihat Rasulullah SAW, baginda tidak meninggalkan apa-apa kecuali seekor keldai betina putih, senjata baginda dan sebidang tanah yang diwakafkannya sebagai sedekah.'"
  },
  {
    "id": 18341,
    "hadith_number": 3605,
    "tajuk_hadith": "Sedekah Tanah Khaibar",
    "perawi_melayu": "Daripada Sufyan Ath-Thawri, daripada Ibn 'Awn, daripada Nafi', daripada Ibn 'Umar, daripada Umar, bahawa beliau berkata:",
    "english_text": "\"I was allocated some land of Khaibar. I came to the Messenger of Allah and said: 'I have acquired some land and I have never acquired any wealth that is dearer to me or more precious than it.' He said: 'If you wish, you can give it in charity.'\" So he gave it in charity on condition that it would not be bought or given away, for the poor, relatives, slaves, guests and wayfarers. And there is no sin on the administrator if he eats from it or feeds others on a reasonable basis, with no intention of becoming wealthy from it.",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا أَبُو دَاوُدَ الْحَفَرِيُّ، عُمَرُ بْنُ سَعْدٍ عَنْ سُفْيَانَ الثَّوْرِيِّ، عَنِ ابْنِ عَوْنٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ عُمَرَ، قَالَ أَصَبْتُ أَرْضًا مِنْ أَرْضِ خَيْبَرَ فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ أَصَبْتُ أَرْضًا لَمْ أُصِبْ مَالاً أَحَبَّ إِلَىَّ وَلاَ أَنْفَسَ عِنْدِي مِنْهَا ‏.‏ قَالَ ‏\n\"‏ إِنْ شِئْتَ تَصَدَّقْتَ بِهَا ‏\"‏ ‏.‏ فَتَصَدَّقَ بِهَا - عَلَى أَنْ لاَ تُبَاعَ وَلاَ تُوهَبَ - فِي الْفُقَرَاءِ وَذِي الْقُرْبَى وَالرِّقَابِ وَالضَّيْفِ وَابْنِ السَّبِيلِ لاَ جُنَاحَ عَلَى مَنْ وَلِيَهَا أَنْ يَأْكُلَ بِالْمَعْرُوفِ غَيْرَ مُتَمَوِّلٍ مَالاً وَيُطْعِمَ ‏.‏",
    "malay_translation": "Aku mendapat sebidang tanah di Khaibar. Maka aku pergi kepada Rasulullah SAW dan berkata: 'Wahai Rasulullah, aku telah mendapat sebidang tanah dan aku tidak pernah mendapat harta yang lebih aku cintai dan lebih berharga daripada tanah ini.' Baginda bersabda: 'Jika engkau mahu, sedekahkanlah ia.' Maka aku mensedekahkannya dengan syarat tanah itu tidak boleh dijual atau dihadiahkan, untuk golongan fakir miskin, kaum kerabat, hamba sahaya, tetamu dan orang yang sedang musafir.  Tiada dosa bagi pengurusan tanah tersebut jika dia makan daripada hasil tanah itu atau memberi makan kepada orang lain secara berpada-pada, tanpa niat untuk memperkayakan diri."
  },
  {
    "id": 18342,
    "hadith_number": 3606,
    "tajuk_hadith": "Riwayat Tentang Umar bin al-Khattab daripada Nabi SAW",
    "perawi_melayu": "Daripada Harun bin Abdullah, daripada Muawiyah bin Amr, daripada Abu Ishaq al-Fazari, daripada Ibn Awn, daripada Nafi', daripada Ibn Umar, daripada Umar r.a., daripada Nabi SAW.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، عَنْ أَبِي إِسْحَاقَ الْفَزَارِيِّ، عَنِ ابْنِ عَوْنٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ عُمَرَ، رضى الله عنه عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏",
    "malay_translation": "Aku diberitahu oleh Harun bin Abdullah, katanya: telah menceritakan kepada kami Muawiyah bin Amr, daripada Abu Ishaq al-Fazari, daripada Ibn Awn, daripada Nafi', daripada Ibn Umar, daripada Umar r.a., daripada Nabi SAW, lebih kurang seperti itu."
  },
  {
    "id": 18343,
    "hadith_number": 3607,
    "tajuk_hadith": "Amalan Sedekah Tanah di Khaibar",
    "perawi_melayu": "Daripada Yazid bin Zuraiq, yang meriwayatkan daripada Ibnu Awn, daripada Nafi', daripada Ibnu Umar, daripada Umar.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، قَالَ حَدَّثَنَا يَزِيدُ، - وَهُوَ ابْنُ زُرَيْعٍ - قَالَ حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عُمَرَ، قَالَ أَصَابَ عُمَرُ أَرْضًا بِخَيْبَرَ فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ أَصَبْتُ أَرْضًا لَمْ أُصِبْ مَالاً قَطُّ أَنْفَسَ عِنْدِي فَكَيْفَ تَأْمُرُ بِهِ قَالَ ‏\n\"‏ إِنْ شِئْتَ حَبَّسْتَ أَصْلَهَا وَتَصَدَّقْتَ بِهَا ‏\"‏ ‏.‏ فَتَصَدَّقَ بِهَا - عَلَى أَنْ لاَ تُبَاعَ وَلاَ تُوهَبَ وَلاَ تُورَثَ - فِي الْفُقَرَاءِ وَالْقُرْبَى وَالرِّقَابِ وَفِي سَبِيلِ اللَّهِ وَالضَّيْفِ وَابْنِ السَّبِيلِ لاَ جُنَاحَ عَلَى مَنْ وَلِيَهَا أَنْ يَأْكُلَ مِنْهَا بِالْمَعْرُوفِ وَيُطْعِمَ صَدِيقًا غَيْرَ مُتَمَوِّلٍ فِيهِ ‏.‏",
    "malay_translation": "Kami diberitakan oleh Humaid bin Mus'adah, katanya: Telah menceritakan kepada kami Yazid (yakni Ibnu Zurai'), katanya: Telah menceritakan kepada kami Ibnu Awn, daripada Nafi', daripada Ibnu Umar, bahawa Umar berkata: Umar telah memperoleh sebidang tanah di Khaibar, lalu dia datang kepada Nabi SAW, lalu berkata:  Wahai Rasulullah, saya telah memperoleh sebidang tanah, dan saya tidak pernah memperoleh harta yang lebih berharga daripada ini. Bagaimanakah baginda menyuruh saya berbuat dengannya? Baginda bersabda: Jika engkau suka, engkau wakafkan pokoknya dan sedekahkan hasilnya.  Maka dia mensedekahkannya dengan syarat tanah itu tidak boleh dijual, dihadiahkan, atau diwarisi, untuk golongan fakir miskin, kaum kerabat, hamba sahaya, di jalan Allah, tetamu, dan orang yang sedang musafir. Tiada dosa bagi yang menguruskannya jika dia makan daripadanya secara berpatutan dan memberi makan kepada sahabatnya, tanpa niat untuk memperkaya diri daripadanya."
  },
  {
    "id": 18344,
    "hadith_number": 3608,
    "tajuk_hadith": "Umar dan Sumbangan Tanah di Khaibar",
    "perawi_melayu": "Ia diriwayatkan daripada Bishr, daripada Ibn 'Awn, daripada Nafi', daripada Ibn 'Umar yang berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا بِشْرٌ، عَنِ ابْنِ عَوْنٍ، قَالَ وَأَنْبَأَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، قَالَ حَدَّثَنَا بِشْرٌ، قَالَ حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ أَصَابَ عُمَرُ أَرْضًا بِخَيْبَرَ فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَاسْتَأْمَرَهُ فِيهَا فَقَالَ إِنِّي أَصَبْتُ أَرْضًا كَثِيرًا لَمْ أُصِبْ مَالاً قَطُّ أَنْفَسَ عِنْدِي مِنْهُ فَمَا تَأْمُرُ فِيهَا قَالَ ‏\n\"‏ إِنْ شِئْتَ حَبَّسْتَ أَصْلَهَا وَتَصَدَّقْتَ بِهَا ‏\"‏ ‏.‏ فَتَصَدَّقَ بِهَا - عَلَى أَنَّهُ لاَ تُبَاعُ وَلاَ تُوهَبُ - فَتَصَدَّقَ بِهَا فِي الْفُقَرَاءِ وَالْقُرْبَى وَفِي الرِّقَابِ وَفِي سَبِيلِ اللَّهِ وَابْنِ السَّبِيلِ وَالضَّيْفِ لاَ جُنَاحَ - يَعْنِي - عَلَى مَنْ وَلِيَهَا أَنْ يَأْكُلَ أَوْ يُطْعِمَ صَدِيقًا غَيْرَ مُتَمَوِّلٍ اللَّفْظُ لإِسْمَاعِيلَ ‏.‏",
    "malay_translation": "Umar telah mendapat sebidang tanah di Khaibar.  Lalu dia menghadap Nabi SAW dan meminta nasihat baginda tentang tanah tersebut.  Dia berkata, \"Wahai Rasulullah, saya telah mendapat tanah yang banyak, dan saya tidak pernah mendapat harta yang lebih bernilai daripada ini. Apakah perintah baginda tentangnya?\" Baginda menjawab, \"Jika engkau mahu, engkau boleh wakafkan tanah itu dan menyedekahkan hasilnya.\" Maka dia pun menyedekahkannya dengan syarat tanah itu tidak boleh dijual atau dihadiahkan. Dia menyedekahkannya untuk golongan fakir miskin, kaum kerabat, untuk memerdekakan hamba sahaya, di jalan Allah,  untuk pengembara dan tetamu. Tiada dosa bagi pengurusan tanah wakaf itu jika mereka memakan hasilnya atau memberi makan kepada sahabat, tanpa niat untuk memperkaya diri.  (Lafaz daripada Isma'il)."
  },
  {
    "id": 18345,
    "hadith_number": 3609,
    "tajuk_hadith": "Umar dan Tanah Khaibar: Wakaf dan Pengurusan Harta",
    "perawi_melayu": "Daripada Azhar As-Samman, daripada Ibn 'Awn, daripada Nafi', daripada Ibn 'Umar,",
    "english_text": "\"If you wish, you may 'freeze' it and give it in charity.\" So he 'froze' it, stipulating that it should not be sold, given as a gift or inherited, and he gave it in charity to the poor, relatives, slaves, the needy, wayfarers and guests. There is no sin on the administrator if he eats from it on a reasonable basis or feeds a friend with no intention of becoming wealthy from it.",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا أَزْهَرُ السَّمَّانُ، عَنِ ابْنِ عَوْنٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عُمَرَ، أَصَابَ أَرْضًا بِخَيْبَرَ فَأَتَى النَّبِيَّ صلى الله عليه وسلم يَسْتَأْمِرُهُ فِي ذَلِكَ فَقَالَ ‏\n\"‏ إِنْ شِئْتَ حَبَّسْتَ أَصْلَهَا وَتَصَدَّقْتَ بِهَا ‏\"‏ ‏.‏ فَحَبَّسَ أَصْلَهَا أَنْ لاَ تُبَاعَ وَ لاَ تُوهَبَ وَلاَ تُورَثَ فَتَصَدَّقَ بِهَا عَلَى الْفُقَرَاءِ وَالْقُرْبَى وَالرِّقَابِ وَفِي الْمَسَاكِينِ وَابْنِ السَّبِيلِ وَالضَّيْفِ لاَ جُنَاحَ عَلَى مَنْ وَلِيَهَا أَنْ يَأْكُلَ مِنْهَا بِالْمَعْرُوفِ أَوْ يُطْعِمَ صَدِيقَهُ غَيْرَ مُتَمَوِّلٍ فِيهِ ‏.‏",
    "malay_translation": "Daripada Azhar As-Samman, daripada Ibn 'Awn, daripada Nafi', daripada Ibn 'Umar, bahawa Umar telah memperoleh sebidang tanah di Khaibar.  Lalu dia menghadap Nabi SAW untuk meminta nasihat tentang hal itu.  Nabi SAW bersabda: \"Jika engkau mahu, engkau boleh wakafkan tanah itu dan sedekahkan hasilnya.\"  Maka Umar mewakafkan tanah itu dengan syarat ia tidak boleh dijual, dihadiahkan atau diwarisi, dan dia mensedekahkan hasilnya kepada golongan fakir miskin, kaum kerabat, hamba sahaya, orang yang memerlukan, pengembara dan tetamu. Tiada dosa bagi pentadbirnya jika dia memakan sebahagian dari hasilnya secara berpada-pada atau memberi makan kepada sahabatnya tanpa niat untuk memperkaya diri daripadanya."
  },
  {
    "id": 18346,
    "hadith_number": 3610,
    "tajuk_hadith": "Sedekah Harta Kesayangan untuk Jalan Allah",
    "perawi_melayu": "Daripada Anas r.a.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ نَافِعٍ، قَالَ حَدَّثَنَا بَهْزٌ، قَالَ حَدَّثَنَا حَمَّادٌ، قَالَ حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، قَالَ لَمَّا نَزَلَتْ هَذِهِ الآيَةُ ‏{‏ لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ ‏}‏ قَالَ أَبُو طَلْحَةَ إِنَّ رَبَّنَا لَيَسْأَلُنَا عَنْ أَمْوَالِنَا فَأُشْهِدُكَ يَا رَسُولَ اللَّهِ أَنِّي قَدْ جَعَلْتُ أَرْضِي لِلَّهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اجْعَلْهَا فِي قَرَابَتِكَ فِي حَسَّانَ بْنِ ثَابِتٍ وَأُبَىِّ بْنِ كَعْبٍ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Bakar bin Nafi', dia berkata; telah menceritakan kepada kami Bahz, dia berkata; telah menceritakan kepada kami Hammad, dia berkata; telah menceritakan kepada kami Tsabit, daripada Anas r.a., bahawa apabila ayat ini diturunkan: {…kamu tidak akan memperoleh kebaikan sehingga kamu menafkahkan sebagian dari apa yang kamu cintai…} maka Abu Thalhah berkata: “Sesungguhnya Tuhan kita akan menyoal kita tentang harta benda kita, maka aku bersaksi kepadamu wahai Rasulullah s.a.w. bahawa aku telah menjadikan tanahku untuk Allah.”  Maka Rasulullah s.a.w. bersabda: “Jadikanlah ia untuk kaum kerabatmu, iaitu Hassan bin Tsabit dan Ubay bin Ka’ab.”"
  },
  {
    "id": 18347,
    "hadith_number": 3611,
    "tajuk_hadith": "Mengenai Sedekah Hasil Harta",
    "perawi_melayu": "Daripada Ibnu Umar",
    "english_text": "\"Umar said to the Prophet: 'The one hundred shares that I acquired in Khaibar -I have never acquired any wealth that I like more than that, and I want to give it in charity.' The Prophet said: Freeze it and donate its fruits.\"",
    "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ عُمَرُ لِلنَّبِيِّ صلى الله عليه وسلم إِنَّ الْمِائَةَ سَهْمٍ الَّتِي لِي بِخَيْبَرَ لَمْ أُصِبْ مَالاً قَطُّ أَعْجَبَ إِلَىَّ مِنْهَا قَدْ أَرَدْتُ أَنْ أَتَصَدَّقَ بِهَا ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ احْبِسْ أَصْلَهَا وَسَبِّلْ ثَمَرَتَهَا ‏\"‏ ‏.‏",
    "malay_translation": "Umar berkata kepada Nabi SAW, \"Seratus bahagian yang aku perolehi di Khaibar, aku tidak pernah memperoleh harta yang lebih aku sukai daripada harta ini, dan aku ingin menyedekahkannya.\"  Nabi SAW bersabda, \"Kekalkan pokok asalnya dan sedekahkanlah hasilnya.\""
  },
  {
    "id": 18348,
    "hadith_number": 3612,
    "tajuk_hadith": "Amal Jariah daripada Harta Kekayaan",
    "perawi_melayu": "Daripada Umar r.a.",
    "english_text": "\"Umar came to the Messenger of Allah and said: 'O Messenger of Allah, I have acquired some wealth the like of which I have never acquired before. I had one hundred head (of livestock) with which I bought one hundred shares of Khaibar from its people. I wanted to draw closer to Allah, the Mighty and Sublime, by means of it.' He said: 'Freeze it and donate its fruits.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْخَلَنْجِيُّ، بِبَيْتِ الْمَقْدِسِ قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ عُمَرَ، رضى الله عنه قَالَ جَاءَ عُمَرُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَصَبْتُ مَالاً لَمْ أُصِبْ مِثْلَهُ قَطُّ كَانَ لِي مِائَةُ رَأْسٍ فَاشْتَرَيْتُ بِهَا مِائَةَ سَهْمٍ مِنْ خَيْبَرَ مِنْ أَهْلِهَا وَإِنِّي قَدْ أَرَدْتُ أَنْ أَتَقَرَّبَ بِهَا إِلَى اللَّهِ عَزَّ وَجَلَّ ‏.‏ قَالَ ‏\n\"‏ فَاحْبِسْ أَصْلَهَا وَسَبِّلِ الثَّمَرَةَ ‏\"‏ ‏.‏",
    "malay_translation": "Umar r.a. datang kepada Rasulullah SAW dan berkata: \"Wahai Rasulullah, saya telah memperoleh kekayaan yang belum pernah saya peroleh sebelum ini. Saya mempunyai seratus ekor ternak dan saya telah membelinya dengan seratus bahagian Khaibar daripada penduduknya. Saya ingin mendekatkan diri kepada Allah SWT dengannya.\" Baginda SAW bersabda: \"Bekukan pokok asalnya dan sedekahkan hasilnya.\""
  },
  {
    "id": 18349,
    "hadith_number": 3613,
    "tajuk_hadith": "Mengenai Tanah di Thamgh",
    "perawi_melayu": "Daripada Umar r.a.",
    "english_text": "\"I asked the Messenger of Allah about some land of mine in Thamgh. He said: 'Freeze it and donate its fruits.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مُصَفَّى بْنِ بُهْلُولٍ، قَالَ حَدَّثَنَا بَقِيَّةُ، عَنْ سَعِيدِ بْنِ سَالِمٍ الْمَكِّيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ عُمَرَ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ أَرْضٍ لِي بِثَمْغٍ قَالَ ‏\n\"‏ احْبِسْ أَصْلَهَا وَسَبِّلْ ثَمَرَتَهَا ‏\"‏ ‏.‏",
    "malay_translation": "Umar r.a. berkata: Saya bertanya kepada Rasulullah SAW tentang tanah saya di Thamgh. Baginda bersabda: \"Bekukan pokoknya dan sedekahkan buahnya.\""
  },
  {
    "id": 18350,
    "hadith_number": 3614,
    "tajuk_hadith": "Keikhlasan Uthman bin Affan dalam Bersedekah",
    "perawi_melayu": "Al-Ahnaf berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ سَمِعْتُ أَبِي يُحَدِّثُ، عَنْ حُصَيْنِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَمْرِو بْنِ جَاوَانَ، - رَجُلٌ مِنْ بَنِي تَمِيمٍ - وَذَاكَ أَنِّي قُلْتُ لَهُ أَرَأَيْتَ اعْتِزَالَ الأَحْنَفِ بْنِ قَيْسٍ مَا كَانَ قَالَ سَمِعْتُ الأَحْنَفَ يَقُولُ أَتَيْتُ الْمَدِينَةَ وَأَنَا حَاجٌّ فَبَيْنَا نَحْنُ فِي مَنَازِلِنَا نَضَعُ رِحَالَنَا إِذْ أَتَى آتٍ فَقَالَ قَدِ اجْتَمَعَ النَّاسُ فِي الْمَسْجِدِ فَاطَّلَعْتُ فَإِذَا يَعْنِي النَّاسَ مُجْتَمِعُونَ وَإِذَا بَيْنَ أَظْهُرِهِمْ نَفَرٌ قُعُودٌ فَإِذَا هُوَ عَلِيُّ بْنُ أَبِي طَالِبٍ وَالزُّبَيْرُ وَطَلْحَةُ وَسَعْدُ بْنُ أَبِي وَقَّاصٍ رَحْمَةُ اللَّهِ عَلَيْهِمْ فَلَمَّا قُمْتُ عَلَيْهِمْ قِيلَ هَذَا عُثْمَانُ بْنُ عَفَّانَ قَدْ جَاءَ - قَالَ - فَجَاءَ وَعَلَيْهِ مُلَيَّةٌ صَفْرَاءُ فَقُلْتُ لِصَاحِبِي كَمَا أَنْتَ حَتَّى أَنْظُرَ مَا جَاءَ بِهِ ‏.‏ فَقَالَ عُثْمَانُ أَهَا هُنَا عَلِيٌّ أَهَا هُنَا الزُّبَيْرُ أَهَا هُنَا طَلْحَةُ أَهَا هُنَا سَعْدٌ قَالُوا نَعَمْ ‏.‏ قَالَ فَأَنْشُدُكُمْ بِاللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ أَتَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ يَبْتَاعُ مِرْبَدَ بَنِي فُلاَنٍ غَفَرَ اللَّهُ لَهُ ‏\"‏ ‏.‏ فَابْتَعْتُهُ فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ إِنِّي ابْتَعْتُ مِرْبَدَ بَنِي فُلاَنٍ ‏.‏ قَالَ ‏\"‏ فَاجْعَلْهُ فِي مَسْجِدِنَا وَأَجْرُهُ لَكَ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ قَالَ فَأَنْشُدُكُمْ بِاللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ هَلْ تَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ يَبْتَاعُ بِئْرَ رُومَةَ غَفَرَ اللَّهُ لَهُ ‏\"‏ ‏.‏ فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ قَدِ ابْتَعْتُ بِئْرَ رُومَةَ ‏.‏ قَالَ ‏\"‏ فَاجْعَلْهَا سِقَايَةً لِلْمُسْلِمِينَ وَأَجْرُهَا لَكَ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ قَالَ فَأَنْشُدُكُمْ بِاللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ هَلْ تَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ يُجَهِّزْ جَيْشَ الْعُسْرَةِ غَفَرَ اللَّهُ لَهُ ‏\"‏ ‏.‏ فَجَهَّزْتُهُمْ حَتَّى مَا يَفْقِدُونَ عِقَالاً وَلاَ خِطَامًا ‏.‏ قَالُوا نَعَمْ ‏.‏ قَالَ اللَّهُمَّ اشْهَدِ اللَّهُمَّ اشْهَدِ اللَّهُمَّ اشْهَدْ ‏.‏",
    "malay_translation": "Aku diberitahu oleh Ishak bin Ibrahim, katanya aku diberitahu oleh Al-Mu'tamir bin Sulaiman, katanya aku mendengar bapaku meriwayatkan, daripada Husain bin Abdur Rahman, daripada Amru bin Jawan – seorang lelaki daripada Bani Tamim – dan itu kerana aku bertanya kepadanya, “Bagaimana pendapatmu tentang pengasingan Al-Ahnaf bin Qais?” Katanya, “Aku mendengar Al-Ahnaf berkata, ‘Aku datang ke Madinah ketika aku sedang menunaikan haji. Ketika kami berada di tempat perkhemahan kami sedang menurunkan tunggangan kami, tiba-tiba datang seorang yang berkata, ‘Orang ramai telah berkumpul di masjid.’ Maka aku pun melihat, dan ternyata orang ramai telah berkumpul, dan di tengah-tengah mereka terdapat segolongan orang yang duduk. Maka mereka ialah Ali bin Abi Talib, Az-Zubair, Talhah dan Saad bin Abi Waqqas, semoga Allah merahmati mereka.  Setelah aku menghampiri mereka, dikatakan bahawa ini ialah Uthman bin Affan yang telah datang. – katanya – Maka dia datang dengan memakai jubah kuning. Lalu aku berkata kepada sahabatku, ‘Tunggulah di sini sehingga aku melihat apa yang berlaku.’ Maka Uthman berkata, ‘Adakah Ali di sini? Adakah Zubair di sini? Adakah Talhah di sini? Adakah Saad di sini?’ Mereka menjawab, ‘Ya.’  Maka dia berkata, ‘Aku bersumpah demi Allah, yang tiada Tuhan melainkan Dia, adakah kamu mengetahui bahawa Rasulullah SAW telah bersabda, “Barangsiapa membeli Mirbad Bani fulan, nescaya Allah mengampuninya.” Maka aku membelinya, lalu aku datang kepada Rasulullah SAW dan aku berkata, “Sesungguhnya aku telah membeli Mirbad Bani fulan.” Baginda bersabda, “Letakkanlah ia di masjid kita, dan pahalanya adalah untukmu.” Mereka berkata, ‘Ya.’ Maka dia berkata, ‘Aku bersumpah demi Allah, yang tiada Tuhan melainkan Dia, adakah kamu mengetahui bahawa Rasulullah SAW telah bersabda, “Barangsiapa membeli perigi Rumah, nescaya Allah mengampuninya.” Maka aku datang kepada Rasulullah SAW dan aku berkata, “Sesungguhnya aku telah membeli perigi Rumah.” Baginda bersabda, “Jadikanlah ia sebagai tempat menimba air untuk orang Islam, dan pahalanya adalah untukmu.” Mereka berkata, ‘Ya.’ Maka dia berkata, ‘Aku bersumpah demi Allah, yang tiada Tuhan melainkan Dia, adakah kamu mengetahui bahawa Rasulullah SAW telah bersabda, “Barangsiapa yang melengkapi pasukan perang Al-Usrah (iaitu Tabuk), nescaya Allah mengampuninya.” Maka aku melengkapinya sehingga mereka tidak kekurangan walau sehelai tali atau kekang.’ Mereka berkata, ‘Ya.’ Maka dia berkata, ‘Ya Allah, saksikanlah, ya Allah, saksikanlah, ya Allah, saksikanlah.’"
  },
  {
    "id": 18351,
    "hadith_number": 3615,
    "tajuk_hadith": "Kepercayaan Uthman terhadap Hadis Nabi SAW",
    "perawi_melayu": "Daripada riwayat Al-Ahnaf bin Qais yang berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، قَالَ سَمِعْتُ حُصَيْنَ بْنَ عَبْدِ الرَّحْمَنِ، يُحَدِّثُ عَنْ عَمْرِو بْنِ جَاوَانَ، عَنِ الأَحْنَفِ بْنِ قَيْسٍ، قَالَ خَرَجْنَا حُجَّاجًا فَقَدِمْنَا الْمَدِينَةَ وَنَحْنُ نُرِيدُ الْحَجَّ فَبَيْنَا نَحْنُ فِي مَنَازِلِنَا نَضَعُ رِحَالَنَا إِذْ أَتَانَا آتٍ فَقَالَ إِنَّ النَّاسَ قَدِ اجْتَمَعُوا فِي الْمَسْجِدِ وَفَزِعُوا ‏.‏ فَانْطَلَقْنَا فَإِذَا النَّاسُ مُجْتَمِعُونَ عَلَى نَفَرٍ فِي وَسَطِ الْمَسْجِدِ وَإِذَا عَلِيٌّ وَالزُّبَيْرُ وَطَلْحَةُ وَسَعْدُ بْنُ أَبِي وَقَّاصٍ فَإِنَّا لَكَذَلِكَ إِذْ جَاءَ عُثْمَانُ بْنُ عَفَّانَ عَلَيْهِ مُلاَءَةٌ صَفْرَاءُ قَدْ قَنَّعَ بِهَا رَأْسَهُ فَقَالَ أَهَا هُنَا عَلِيٌّ أَهَا هُنَا طَلْحَةُ أَهَا هُنَا الزُّبَيْرُ أَهَا هُنَا سَعْدٌ قَالُوا نَعَمْ ‏.‏ قَالَ فَإِنِّي أَنْشُدُكُمْ بِاللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ أَتَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ يَبْتَاعُ مِرْبَدَ بَنِي فُلاَنٍ غَفَرَ اللَّهُ لَهُ ‏\"‏ ‏.‏ فَابْتَعْتُهُ بِعِشْرِينَ أَلْفًا أَوْ بِخَمْسَةٍ وَعِشْرِينَ أَلْفًا فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَخْبَرْتُهُ فَقَالَ ‏\"‏ اجْعَلْهَا فِي مَسْجِدِنَا وَأَجْرُهُ لَكَ ‏\"‏ ‏.‏ قَالُوا اللَّهُمَّ نَعَمْ ‏.‏ قَالَ فَأَنْشُدُكُمْ بِاللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ أَتَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ يَبْتَاعُ بِئْرَ رُومَةَ غَفَرَ اللَّهُ لَهُ ‏\"‏ ‏.‏ فَابْتَعْتُهُ بِكَذَا وَكَذَا فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ قَدِ ابْتَعْتُهَا بِكَذَا وَكَذَا ‏.‏ قَالَ ‏\"‏ اجْعَلْهَا سِقَايَةً لِلْمُسْلِمِينَ وَأَجْرُهَا لَكَ ‏\"‏ ‏.‏ قَالُوا اللَّهُمَّ نَعَمْ ‏.‏ قَالَ فَأَنْشُدُكُمْ بِاللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ أَتَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَظَرَ فِي وُجُوهِ الْقَوْمِ فَقَالَ ‏\"‏ مَنْ جَهَّزَ هَؤُلاَءِ اللَّهُ غَفَرَ لَهُ ‏\"‏ ‏.‏ يَعْنِي جَيْشَ الْعُسْرَةِ فَجَهَّزْتُهُمْ حَتَّى مَا يَفْقِدُونَ عِقَالاً وَلاَ خِطَامًا ‏.‏ قَالُوا اللَّهُمَّ نَعَمْ ‏.‏ قَالَ اللَّهُمَّ اشْهَدِ اللَّهُمَّ اشْهَدْ ‏.‏",
    "malay_translation": "Kami bertolak menunaikan haji dan sampai ke Madinah dengan niat menunaikan haji. Ketika kami berada di tempat perkhemahan kami menurunkan kenderaan tunggangan kami, tiba-tiba seseorang datang kepada kami dan berkata: ‘Orang ramai telah berkumpul di masjid dan mereka cemas.’ Maka kami pun berangkat dan mendapati orang ramai telah berkumpul di sekeliling sekumpulan orang di tengah masjid, di antara mereka ialah Ali, Zubair, Talhah dan Saad bin Abi Waqqas. Ketika kami berada di situ, datanglah Uthman, memakai sehelai jubah kuning yang menutupi kepalanya. Dia bertanya: ‘Adakah Ali di sini? Adakah Talhah di sini? Adakah Zubair di sini? Adakah Saad di sini?’ Mereka menjawab: ‘Ya.’ Uthman berkata: ‘Aku bersumpah demi Allah, yang tiada Tuhan melainkan Dia, adakah kamu semua mengetahui bahawa Rasulullah SAW telah bersabda: “Barangsiapa membeli Mirbad Bani fulan, Allah akan mengampuninya.” Aku telah membelinya dengan harga dua puluh atau dua puluh lima ribu, kemudian aku pergi kepada Rasulullah SAW dan memberitahunya, lalu Baginda bersabda: “Letakkan ia di masjid kita dan pahalanya adalah untukmu.” Mereka berkata: ‘Demi Allah, ya.’ Uthman berkata: ‘Aku bersumpah demi Allah, yang tiada Tuhan melainkan Dia, adakah kamu semua mengetahui bahawa Rasulullah SAW telah bersabda: “Barangsiapa membeli perigi Rumah, Allah akan mengampuninya.” Aku telah membelinya dengan harga sekian-sekian, kemudian aku pergi kepada Rasulullah SAW dan memberitahunya, lalu Baginda bersabda: “Jadikan ia sebagai tempat menimba air untuk orang Islam dan pahalanya adalah untukmu.” Mereka berkata: ‘Demi Allah, ya.’ Uthman berkata: ‘Aku bersumpah demi Allah, yang tiada Tuhan melainkan Dia, adakah kamu semua mengetahui bahawa Rasulullah SAW telah melihat wajah-wajah orang ramai lalu bersabda: “Barangsiapa yang melengkapi mereka, Allah akan mengampuninya,” maksudnya tentera Usrah (Tabuk). Maka aku melengkapkan mereka sehingga mereka tidak kekurangan tali atau kekang.’ Mereka berkata: ‘Demi Allah, ya.’ Uthman berkata: ‘Ya Allah, jadi saksi, ya Allah, jadi saksi.’"
  },
  {
    "id": 18352,
    "hadith_number": 3616,
    "tajuk_hadith": "Keikhlasan Uthman bin Affan",
    "perawi_melayu": "Daripada riwayat Tumamah bin Hazn Al-Qushairi berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنِي زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ، عَنْ يَحْيَى بْنِ أَبِي الْحَجَّاجِ، عَنْ سَعِيدٍ الْجُرَيْرِيِّ، عَنْ ثُمَامَةَ بْنِ حَزْنٍ الْقُشَيْرِيِّ، قَالَ شَهِدْتُ الدَّارَ حِينَ أَشْرَفَ عَلَيْهِمْ عُثْمَانُ فَقَالَ أَنْشُدُكُمْ بِاللَّهِ وَبِالإِسْلاَمِ هَلْ تَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدِمَ الْمَدِينَةَ وَلَيْسَ بِهَا مَاءٌ يُسْتَعْذَبُ غَيْرَ بِئْرِ رُومَةَ فَقَالَ ‏\"‏ مَنْ يَشْتَرِي بِئْرَ رُومَةَ فَيَجْعَلُ فِيهَا دَلْوَهُ مَعَ دِلاَءِ الْمُسْلِمِينَ بِخَيْرٍ لَهُ مِنْهَا فِي الْجَنَّةِ ‏\"‏ ‏.‏ فَاشْتَرَيْتُهَا مِنْ صُلْبِ مَالِي فَجَعَلْتُ دَلْوِي فِيهَا مَعَ دِلاَءِ الْمُسْلِمِينَ وَأَنْتُمُ الْيَوْمَ تَمْنَعُونِي مِنَ الشُّرْبِ مِنْهَا حَتَّى أَشْرَبَ مِنْ مَاءِ الْبَحْرِ قَالُوا اللَّهُمَّ نَعَمْ ‏.‏ قَالَ فَأَنْشُدُكُمْ بِاللَّهِ وَالإِسْلاَمِ هَلْ تَعْلَمُونَ أَنِّي جَهَّزْتُ جَيْشَ الْعُسْرَةِ مِنْ مَالِي قَالُوا اللَّهُمَّ نَعَمْ ‏.‏ قَالَ فَأَنْشُدُكُمْ بِاللَّهِ وَالإِسْلاَمِ هَلْ تَعْلَمُونَ أَنَّ الْمَسْجِدَ ضَاقَ بِأَهْلِهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ يَشْتَرِي بُقْعَةَ آلِ فُلاَنٍ فَيَزِيدُهَا فِي الْمَسْجِدِ بِخَيْرٍ لَهُ مِنْهَا فِي الْجَنَّةِ ‏\"‏ ‏.‏ فَاشْتَرَيْتُهَا مِنْ صُلْبِ مَالِي فَزِدْتُهَا فِي الْمَسْجِدِ وَأَنْتُمْ تَمْنَعُونِي أَنْ أُصَلِّيَ فِيهِ رَكْعَتَيْنِ قَالُوا اللَّهُمَّ نَعَمْ ‏.‏ قَالَ أَنْشُدُكُمْ بِاللَّهِ وَالإِسْلاَمِ هَلْ تَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ عَلَى ثَبِيرٍ ثَبِيرِ مَكَّةَ وَمَعَهُ أَبُو بَكْرٍ وَعُمَرُ وَأَنَا فَتَحَرَّكَ الْجَبَلُ فَرَكَضَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بِرِجْلِهِ وَقَالَ ‏\"‏ اسْكُنْ ثَبِيرُ فَإِنَّمَا عَلَيْكَ نَبِيٌّ وَصِدِّيقٌ وَشَهِيدَانِ ‏\"‏ ‏.‏ قَالُوا اللَّهُمَّ نَعَمْ ‏.‏ قَالَ اللَّهُ أَكْبَرُ شَهِدُوا لِي وَرَبِّ الْكَعْبَةِ ‏.‏ يَعْنِي أَنِّي شَهِيدٌ ‏.‏",
    "malay_translation": "Aku menyaksikan sendiri ketika Uthman berada di atas tempat tinggi dan berkata: \"Aku bersumpah demi Allah dan Islam, adakah kamu semua sedar bahawa ketika Rasulullah SAW tiba di Madinah, dan ketika itu tidak ada air tawar kecuali telaga Rumah, Baginda berkata: “Siapakah yang mahu membeli telaga Rumah dan menceduk airnya bersama-sama dengan umat Islam, sebagai balasannya akan mendapat telaga yang lebih baik di syurga?” Maka aku membelinya dengan harta sendiri dan aku menceduk airnya bersama-sama dengan umat Islam. Namun hari ini kamu menghalang aku daripada minum daripadanya, sehingga aku terpaksa minum air masin.\" Mereka berkata: \"Demi Allah, ya.\" Beliau berkata: \"Aku bersumpah demi Allah dan Islam, adakah kamu semua sedar bahawa aku telah menanggung kos tentera Usrah (Tabuk) daripada harta sendiri?\" Mereka berkata: \"Demi Allah, ya.\" Beliau berkata: \"Aku bersumpah demi Allah dan Islam, adakah kamu semua sedar bahawa ketika masjid menjadi sempit dan Rasulullah SAW bersabda: “Siapakah yang mahu membeli tanah keluarga si fulan dan menambahkannya kepada masjid, sebagai balasannya akan mendapat tanah yang lebih baik di syurga?” Maka aku membelinya dengan harta sendiri dan aku menambahkannya kepada masjid. Namun kini kamu menghalang aku daripada menunaikan solat dua rakaat di dalamnya.\" Mereka berkata: \"Demi Allah, ya.\" Beliau berkata: \"Aku bersumpah demi Allah dan Islam, adakah kamu semua sedar bahawa Rasulullah SAW berada di atas Thabir - Thabir di Mekah - bersama Abu Bakar, Umar dan aku, dan gunung itu bergoncang, lalu Rasulullah SAW memijaknya dengan kaki Baginda dan bersabda: “Tenanglah wahai Thabir, kerana di atas kamu ada seorang Nabi, seorang Siddiq dan dua orang syuhada.” Mereka berkata: \"Demi Allah, ya.\" Beliau berkata: \"Allahu Akbar! Mereka telah memberi syahadah untukku, demi Tuhan Kaabah.\" Maksudnya, aku adalah seorang syuhada."
  },
  {
    "id": 18353,
    "hadith_number": 3617,
    "tajuk_hadith": "Kisah Keberanian dan Kemurahan Hati Uthman bin Affan",
    "perawi_melayu": "Daripada Abu Salamah bin 'Abdur-Rahman bahawa Uthman melihat mereka ketika mereka mengepungnya lalu berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عِمْرَانُ بْنُ بَكَّارِ بْنِ رَاشِدٍ، قَالَ حَدَّثَنَا خَطَّابُ بْنُ عُثْمَانَ، قَالَ حَدَّثَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنِي أَبِي، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ عُثْمَانَ، أَشْرَفَ عَلَيْهِمْ حِينَ حَصَرُوهُ فَقَالَ أَنْشُدُ بِاللَّهِ رَجُلاً سَمِعَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم يَقُولُ يَوْمَ الْجَبَلِ حِينَ اهْتَزَّ فَرَكَلَهُ بِرِجْلِهِ وَقَالَ ‏\"‏ اسْكُنْ فَإِنَّهُ لَيْسَ عَلَيْكَ إِلاَّ نَبِيٌّ أَوْ صِدِّيقٌ أَوْ شَهِيدَانِ ‏\"‏ ‏.‏ وَأَنَا مَعَهُ فَانْتَشَدَ لَهُ رِجَالٌ ثُمَّ قَالَ أَنْشُدُ بِاللَّهِ رَجُلاً شَهِدَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَوْمَ بَيْعَةِ الرِّضْوَانِ يَقُولُ ‏\"‏ هَذِهِ يَدُ اللَّهِ وَهَذِهِ يَدُ عُثْمَانَ ‏\"‏ ‏.‏ فَانْتَشَدَ لَهُ رِجَالٌ ثُمَّ قَالَ أَنْشُدُ بِاللَّهِ رَجُلاً سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَوْمَ جَيْشِ الْعُسْرَةِ يَقُولُ ‏\"‏ مَنْ يُنْفِقُ نَفَقَةً مُتَقَبَّلَةً ‏\"‏ ‏.‏ فَجَهَّزْتُ نِصْفَ الْجَيْشِ مِنْ مَالِي فَانْتَشَدَ لَهُ رِجَالٌ ثُمَّ قَالَ أَنْشُدُ بِاللَّهِ رَجُلاً سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَنْ يَزِيدُ فِي هَذَا الْمَسْجِدِ بِبَيْتٍ فِي الْجَنَّةِ ‏\"‏ ‏.‏ فَاشْتَرَيْتُهُ مِنْ مَالِي فَانْتَشَدَ لَهُ رِجَالٌ ثُمَّ قَالَ أَنْشُدُ بِاللَّهِ رَجُلاً شَهِدَ رُومَةَ تُبَاعُ فَاشْتَرَيْتُهَا مِنْ مَالِي فَأَبَحْتُهَا لاِبْنِ السَّبِيلِ فَانْتَشَدَ لَهُ رِجَالٌ ‏.‏",
    "malay_translation": "Diriwayatkan daripada Abu Salamah bin 'Abdur-Rahman bahawa Uthman melihat mereka ketika mereka mengepungnya lalu berkata, \"Aku bersumpah demi Allah, aku mencari seseorang yang mendengar Rasulullah SAW bersabda pada hari gunung bergoncang, lalu baginda menendangnya dengan kaki baginda dan bersabda: 'Tenanglah, kerana di atasmu tiada melainkan Nabi, atau Siddiq, atau dua orang syahid.' Dan aku bersama baginda.\" Beberapa orang lelaki menjawab dan mengesahkannya. Kemudian beliau berkata, \"Aku bersumpah demi Allah, aku mencari seseorang yang menyaksikan Rasulullah SAW pada hari Bai'ah ar-Ridwan bersabda: 'Inilah tangan Allah dan inilah tangan Uthman.'\" Beberapa orang lelaki menjawab dan mengesahkannya. Kemudian beliau berkata, \"Aku bersumpah demi Allah, aku mencari seseorang yang mendengar Rasulullah SAW bersabda pada hari tentera al-'Usrah (iaitu Tabuk): 'Siapakah yang akan berinfak, nescaya ia akan diterima?' Dan aku telah melengkapi separuh daripada tentera itu daripada hartaku sendiri.\" Beberapa orang lelaki menjawab dan mengesahkannya. Kemudian beliau berkata, \"Aku bersumpah demi Allah, aku mencari seseorang yang mendengar Rasulullah SAW bersabda: 'Siapakah yang akan menambah kepada masjid ini, sebagai balasan sebuah rumah di syurga?' Dan aku membelinya daripada hartaku sendiri.\" Beberapa orang lelaki menjawab dan mengesahkannya. Kemudian beliau berkata, \"Aku bersumpah demi Allah, aku mencari seseorang yang menyaksikan Rumah dijual, lalu aku membelinya daripada hartaku sendiri dan membenarkannya digunakan oleh orang yang musafir.\" Beberapa orang lelaki menjawab dan mengesahkannya."
  },
  {
    "id": 18354,
    "hadith_number": 3618,
    "tajuk_hadith": "Kejadian Pengepungan Uthman bin Affan",
    "perawi_melayu": "Daripada Abdur-Rahman As-Sulami, katanya:",
    "english_text": "\"When 'Uthman was besieged in his house, the people gathered around his house and he looked out over them\" and he quoted the same Hadith.",
    "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ وَهْبٍ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنِي أَبُو عَبْدِ الرَّحِيمِ، قَالَ حَدَّثَنِي زَيْدُ بْنُ أَبِي أُنَيْسَةَ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، قَالَ لَمَّا حُصِرَ عُثْمَانُ فِي دَارِهِ اجْتَمَعَ النَّاسُ حَوْلَ دَارِهِ - قَالَ - فَأَشْرَفَ عَلَيْهِمْ ‏.‏ وَسَاقَ الْحَدِيثَ ‏.‏",
    "malay_translation": "Daripada Muhammad bin Wahb, katanya: Telah menceritakan kepadaku Muhammad bin Salmah, katanya: Telah menceritakan kepadaku Abu Abdur-Rahim, katanya: Telah menceritakan kepadaku Zaid bin Abi Unaisah, daripada Abi Ishaq, daripada Abi Abdur-Rahman As-Sulami, katanya:  “Apabila Uthman telah dikepung di rumahnya, maka berkumpul manusia di sekeliling rumahnya.  (Uthman) melihat kepada mereka.” Kemudian beliau menyebut hadith yang sama."
  }
]
