[
  {
    "id": 18131,
    "hadith_number": 3395,
    "tajuk_hadith": "Talak Ketika Haid",
    "perawi_melayu": "Nafi' meriwayatkan daripada Abdullah bahawa beliau menceraikan isterinya ketika dalam keadaan haid. Umar bertanya kepada Rasulullah tentang hal itu dan berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ السَّرَخْسِيُّ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، قَالَ أَخْبَرَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ، أَنَّهُ طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ فَاسْتَفْتَى عُمَرُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنَّ عَبْدَ اللَّهِ طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ فَقَالَ ‏\n\"‏ مُرْ عَبْدَ اللَّهِ فَلْيُرَاجِعْهَا ثُمَّ يَدَعْهَا حَتَّى تَطْهُرَ مِنْ حَيْضَتِهَا هَذِهِ ثُمَّ تَحِيضَ حَيْضَةً أُخْرَى فَإِذَا طَهُرَتْ فَإِنْ شَاءَ فَلْيُفَارِقْهَا قَبْلَ أَنْ يُجَامِعَهَا وَإِنْ شَاءَ فَلْيُمْسِكْهَا فَإِنَّهَا الْعِدَّةُ الَّتِي أَمَرَ اللَّهُ عَزَّ وَجَلَّ أَنْ تُطَلَّقَ لَهَا النِّسَاءُ ‏\"‏ ‏.‏",
    "malay_translation": "Kami diberitakan oleh Ubaidullah bin Sa'id As-Sarakhsi, katanya:  Kami diberitakan oleh Yahya bin Sa'id Al-Qattan, daripada Ubaidullah bin Umar, katanya: Nafi' memberitakan kepadaku, daripada Abdullah bahawa beliau menceraikan isterinya ketika dalam keadaan haid. Maka Umar bertanya kepada Rasulullah ﷺ lalu berkata: \"Sesungguhnya Abdullah menceraikan isterinya ketika dia sedang haid.\"  Rasulullah ﷺ bersabda: \"Suruhlah Abdullah merujuk kembali isterinya, kemudian biarkanlah dia sehingga suci daripada haidnya ini, kemudian datang haid yang lain. Maka apabila dia suci, jika dia mahu, hendaklah dia berpisah dengannya sebelum dia menggauli isterinya, dan jika dia mahu, hendaklah dia meneruskan perkahwinannya.  Sesungguhnya itulah iddah yang Allah SWT perintahkan supaya wanita-wanita diceraikan.\" "
  },
  {
    "id": 18132,
    "hadith_number": 3396,
    "tajuk_hadith": "Talak Ketika Haid",
    "perawi_melayu": "Daripada Ibnu Umar bahawa beliau menceraikan isterinya ketika dalam keadaan haid, pada zaman Rasulullah SAW. Umar bin al-Khattab RA bertanya kepada Rasulullah SAW tentang perkara itu, dan Rasulullah SAW bersabda:",
    "english_text": "\"Tell him to take her back and keep her until she becomes pure, then menstruates again and becomes pure again. Then if he wishes he may keep her, or if he wishes, he may divorce her before he touches (has intercourse with) her. This is the time when Allah, the Mighty and Sublime, has stated that women may be divorced.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ أَنْبَأَنَا ابْنُ الْقَاسِمِ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَأَلَ عُمَرُ بْنُ الْخَطَّابِ رضى الله عنه رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مُرْهُ فَلْيُرَاجِعْهَا ثُمَّ لْيُمْسِكْهَا حَتَّى تَطْهُرَ ثُمَّ تَحِيضَ ثُمَّ تَطْهُرَ ثُمَّ إِنْ شَاءَ أَمْسَكَ بَعْدُ وَإِنْ شَاءَ طَلَّقَ قَبْلَ أَنْ يَمَسَّ فَتِلْكَ الْعِدَّةُ الَّتِي أَمَرَ اللَّهُ عَزَّ وَجَلَّ أَنْ تُطَلَّقَ لَهَا النِّسَاءُ ‏\"‏ ‏.‏",
    "malay_translation": "Suruhlah dia rujuk semula dan tahanlah dia sehingga suci, kemudian haid lagi, kemudian suci lagi. Kemudian jika dia mahu, dia boleh meneruskan perkahwinan, dan jika dia mahu, dia boleh menceraikannya sebelum disetubuhi. Inilah tempoh iddah yang Allah SWT perintahkan supaya wanita diceraikan."
  },
  {
    "id": 18133,
    "hadith_number": 3397,
    "tajuk_hadith": "Talak Ketika Haid",
    "perawi_melayu": "Salim bin Abdullah bin Umar meriwayatkan bahawa Abdullah bin Umar berkata:",
    "english_text": "\"I divorced my wife during the lifetime of the Messenger of Allah while she was menstruating. 'Umar mentioned that to the Messenger of Allah, and the Messenger of Allah got angry about that and said: 'Let him take her back, then keep her until she has menstruated again and become pure again. Then if he wants to divorce her when she is pure and before he touches her (has intercourse with her), then that is divorce at the prescribed time as Allah, the Mighty and Sublime, has revealed.'\" 'Abdullah bin 'Umar said: \"So I took her back, but I still counted the divorce that I had issued to her.\"",
    "arabic_text": "أَخْبَرَنِي كَثِيرُ بْنُ عُبَيْدٍ، عَنْ مُحَمَّدِ بْنِ حَرْبٍ، قَالَ حَدَّثَنَا الزُّبَيْدِيُّ، قَالَ سُئِلَ الزُّهْرِيُّ كَيْفَ الطَّلاَقُ لِلْعِدَّةِ فَقَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ قَالَ طَلَّقْتُ امْرَأَتِي فِي حَيَاةِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهِيَ حَائِضٌ ‏.‏ فَذَكَرَ ذَلِكَ عُمَرُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَتَغَيَّظَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ذَلِكَ فَقَالَ ‏\n\"‏ لِيُرَاجِعْهَا ثُمَّ يُمْسِكْهَا حَتَّى تَحِيضَ حَيْضَةً وَتَطْهُرَ فَإِنْ بَدَا لَهُ أَنْ يُطَلِّقَهَا طَاهِرًا قَبْلَ أَنْ يَمَسَّهَا فَذَاكَ الطَّلاَقُ لِلْعِدَّةِ كَمَا أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏\"‏ ‏.‏ قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ فَرَاجَعْتُهَا وَحَسِبْتُ لَهَا التَّطْلِيقَةَ الَّتِي طَلَّقْتُهَا ‏.‏",
    "malay_translation": "Abdullah bin Umar berkata, \"Saya menceraikan isteri saya ketika hayat Rasulullah SAW ketika dia sedang haid. Umar menyebut hal itu kepada Rasulullah SAW, lalu Rasulullah SAW marah dan bersabda: 'Hendaklah dia rujuk kembali isterinya, kemudian tahanlah dia sehingga dia haid lagi dan suci. Kemudian jika dia mahu menceraikannya ketika suci dan sebelum dia menyentuhnya (bersetubuh dengannya), maka itu adalah talak yang sah mengikut masa sebagaimana yang Allah SWT telah menurunkan wahyu.' Abdullah bin Umar berkata: 'Maka saya merujuk kembali isteri saya, tetapi saya tetap mengira talak yang telah saya lafazkan itu.'"
  },
  {
    "id": 18134,
    "hadith_number": 3398,
    "tajuk_hadith": "Talak Ketika Haid",
    "perawi_melayu": "Abdullah bin Ayman bertanya kepada Ibnu Umar ketika Abu Az-Zubair mendengar:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، وَعَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ تَمِيمٍ، عَنْ حَجَّاجٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ عَبْدَ الرَّحْمَنِ بْنَ أَيْمَنَ، يَسْأَلُ ابْنَ عُمَرَ وَأَبُو الزُّبَيْرِ يَسْمَعُ كَيْفَ تَرَى فِي رَجُلٍ طَلَّقَ امْرَأَتَهُ حَائِضًا فَقَالَ لَهُ طَلَّقَ عَبْدُ اللَّهِ بْنُ عُمَرَ امْرَأَتَهُ وَهِيَ حَائِضٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَأَلَ عُمَرُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ طَلَّقَ امْرَأَتَهُ وَ هِيَ حَائِضٌ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لِيُرَاجِعْهَا ‏\"‏ ‏.‏ فَرَدَّهَا عَلَىَّ قَالَ ‏\"‏ إِذَا طَهُرَتْ فَلْيُطَلِّقْ أَوْ لِيُمْسِكْ ‏\"‏ ‏.‏ قَالَ ابْنُ عُمَرَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏{‏ يَا أَيُّهَا النَّبِيُّ إِذَا طَلَّقْتُمُ النِّسَاءَ فَطَلِّقُوهُنَّ ‏}‏ فِي قُبُلِ عِدَّتِهِنَّ ‏.‏",
    "malay_translation": "Muhammad bin Ismail bin Ibrahim dan Abdullah bin Muhammad bin Tamim telah memberitahu aku daripada Hajjaj, katanya Ibnu Juraij telah memberitahu aku daripada Abu Az-Zubair bahawa dia telah mendengar Abdullah bin Ayman bertanya kepada Ibnu Umar (ketika Abu Az-Zubair mendengar),  \"Bagaimana pandangan tuan tentang seseorang lelaki menceraikan isterinya ketika haid?\"  Lalu dia berkata kepadanya: \"Abdullah bin Umar menceraikan isterinya ketika dia sedang haid pada zaman Rasulullah SAW. Umar bertanya kepada Rasulullah SAW dan berkata:  'Abdullah bin Umar telah menceraikan isterinya ketika dia sedang haid.' Rasulullah SAW bersabda: 'Hendaklah dia rujuk kembali (isterinya).' Maka baginda menyuruhku merujuk balik isteriku. Baginda bersabda: 'Apabila dia suci, maka hendaklah dia menceraikan atau menahannya.' Ibnu Umar berkata:  Nabi SAW bersabda:  'Wahai Nabi, apabila kamu menceraikan wanita, hendaklah kamu menceraikan mereka sebelum tamat iddah mereka.'"
  },
  {
    "id": 18135,
    "hadith_number": 3399,
    "tajuk_hadith": "Menceraikan Isteri Pada Tempoh Iddah",
    "perawi_melayu": "Daripada Ibnu Abbas رضي الله عنه, berkenaan firman Allah SWT:",
    "english_text": "\"O Prophet! When you divorce women, divorce them at their 'Iddah (prescribed periods).\" Ibn 'Abbas, may Allah be pleased with him, said: \"Before their 'Iddah elapses.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، قَالَ سَمِعْتُ مُجَاهِدًا، يُحَدِّثُهُ عَنِ ابْنِ عَبَّاسٍ، فِي قَوْلِهِ عَزَّ وَجَلَّ ‏{‏ يَا أَيُّهَا النَّبِيُّ إِذَا طَلَّقْتُمُ النِّسَاءَ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ ‏}‏ قَالَ ابْنُ عَبَّاسٍ رضى الله عنه قُبُلِ عِدَّتِهِنَّ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Bashar, katanya; telah menceritakan kepada kami Muhammad bin Ja’far, katanya; telah menceritakan kepada kami Syu’bah, daripada Al-Hakam, katanya; aku mendengar Mujahid menceritakan daripada Ibnu Abbas berkenaan firman Allah SWT: {Wahai Nabi, jika kamu menceraikan isteri-isteri kamu, maka ceraikanlah mereka pada masa iddah mereka}. Ibnu Abbas رضي الله عنه berkata: Sebelum tamat tempoh iddah mereka."
  },
  {
    "id": 18136,
    "hadith_number": 3400,
    "tajuk_hadith": "Talak Sunnah",
    "perawi_melayu": "Daripada Abdullah r.a.",
    "english_text": "\"The Sunnah divorce is a divorce issued when she is pure (not menstruating) without having had intercourse with her. If she menstruates and becomes pure again, give her another divorce, and if she menstruates and becomes pure again, give her another divorce, then after that, she should wait for another menstrual cycle.\"\n  (One of the narrators) Al-A'mash said: \"I asked Ibrahim, and he said something similar.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ أَيُّوبَ، قَالَ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، قَالَ حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي الأَحْوَصِ، عَنْ عَبْدِ اللَّهِ، أَنَّهُ قَالَ طَلاَقُ السُّنَّةِ تَطْلِيقَةٌ وَهِيَ طَاهِرٌ فِي غَيْرِ جِمَاعٍ فَإِذَا حَاضَتْ وَطَهُرَتْ طَلَّقَهَا أُخْرَى فَإِذَا حَاضَتْ وَطَهُرَتْ طَلَّقَهَا أُخْرَى ثُمَّ تَعْتَدُّ بَعْدَ ذَلِكَ بِحَيْضَةٍ ‏.‏ قَالَ الأَعْمَشُ سَأَلْتُ إِبْرَاهِيمَ فَقَالَ مِثْلَ ذَلِكَ ‏.‏",
    "malay_translation": "Talak sunnah ialah talak yang dijatuhkan ketika isteri dalam keadaan suci (tidak haid) tanpa jimak.  Jika dia haid kemudian suci, jatuhkanlah talak yang kedua. Dan jika dia haid kemudian suci lagi, jatuhkanlah talak yang ketiga. Selepas itu, dia perlu menunggu satu kitaran haid lagi.  Al-A’mash berkata: \"Saya bertanya kepada Ibrahim, dan beliau berkata sedemikian juga.\""
  },
  {
    "id": 18137,
    "hadith_number": 3401,
    "tajuk_hadith": "Talak Sunnah",
    "perawi_melayu": "Daripada Abdullah, baginda berkata:",
    "english_text": "\"The Sunnah divorce is to divorce her when she is pure (not menstruating) without having had intercourse with her.\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي الأَحْوَصِ، عَنْ عَبْدِ اللَّهِ، قَالَ طَلاَقُ السُّنَّةِ أَنْ يُطَلِّقَهَا طَاهِرًا فِي غَيْرِ جِمَاعٍ ‏.‏",
    "malay_translation": "Talak sunnah ialah menceraikan isteri ketika dia suci (tidak dalam haid) dan tidak disetubuhi."
  },
  {
    "id": 18138,
    "hadith_number": 3402,
    "tajuk_hadith": "Talak Ketika Haid",
    "perawi_melayu": "Daripada Abdullah bahawa dia menjatuhkan talak kepada isterinya ketika dia sedang haid. Maka Umar pergi memaklumkan kepada Nabi tentang hal itu. Nabi bersabda kepadanya:",
    "english_text": "\"Tell 'Abdullah to take her back, then, when she has performed Ghusl, let him leave her alone, until she menstruates (again). Then, when she performs Ghusl following that second period, he should not touch her until he divorces her. And if he wants to keep her, then let him keep her. That is the time when Allah has stated that women may be divorced.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا الْمُعْتَمِرُ، قَالَ سَمِعْتُ عُبَيْدَ اللَّهِ بْنَ عُمَرَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، أَنَّهُ طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ تَطْلِيقَةً فَانْطَلَقَ عُمَرُ فَأَخْبَرَ النَّبِيَّ صلى الله عليه وسلم بِذَلِكَ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مُرْ عَبْدَ اللَّهِ فَلْيُرَاجِعْهَا فَإِذَا اغْتَسَلَتْ فَلْيَتْرُكْهَا حَتَّى تَحِيضَ فَإِذَا اغْتَسَلَتْ مِنْ حَيْضَتِهَا الأُخْرَى فَلاَ يَمَسَّهَا حَتَّى يُطَلِّقَهَا فَإِنْ شَاءَ أَنْ يُمْسِكَهَا فَلْيُمْسِكْهَا فَإِنَّهَا الْعِدَّةُ الَّتِي أَمَرَ اللَّهُ عَزَّ وَجَلَّ أَنْ تُطَلَّقَ لَهَا النِّسَاءُ ‏\"‏ ‏.‏",
    "malay_translation": "Suruh Abdullah mengambilnya kembali. Kemudian, apabila dia telah bersuci (ghusl), hendaklah dia meninggalkannya sehingga dia datang haid lagi. Kemudian, apabila dia telah bersuci daripada haid keduanya, janganlah dia menyentuhnya sehingga dia menjatuhkan talak. Jika dia mahu meneruskan perkahwinan, maka hendaklah dia meneruskannya. Itulah masa yang Allah SWT telah tetapkan bagi wanita untuk diceraikan."
  },
  {
    "id": 18139,
    "hadith_number": 3403,
    "tajuk_hadith": "Menceraikan Isteri Ketika Haid",
    "perawi_melayu": "Daripada Ibnu Umar bahawa beliau menceraikan isterinya ketika dalam keadaan haid. Beliau menceritakan hal itu kepada Nabi SAW, lalu baginda bersabda:",
    "english_text": "\"Tell him to take her back, then divorce her while she is pure (not menstruating) or pregnant.\"",
    "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا وَكِيعٌ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، مَوْلَى طَلْحَةَ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عُمَرَ، أَنَّهُ طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ فَذَكَرَ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ مُرْهُ فَلْيُرَاجِعْهَا ثُمَّ لْيُطَلِّقْهَا وَهِيَ طَاهِرٌ أَوْ حَامِلٌ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Ibnu Umar bahawa beliau menceraikan isterinya ketika dalam keadaan haid.  Beliau menceritakan hal itu kepada Nabi SAW, lalu baginda bersabda:  “Suruhlah dia rujuk kembali dengan isterinya, kemudian ceraikanlah isterinya ketika dia suci (tidak haid) atau sedang hamil.”"
  },
  {
    "id": 18140,
    "hadith_number": 3404,
    "tajuk_hadith": "Talak Ketika Haid",
    "perawi_melayu": "Daripada Ibnu Umar",
    "english_text": "It was narrated from Ibn 'Umar that he divorced his wife when she was menstruating, but the Messenger of Allah told him to take her back, and divorce her when she was pure (not menstruating).",
    "arabic_text": "أَخْبَرَنِي زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا هُشَيْمٌ، قَالَ أَخْبَرَنَا أَبُو بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ فَرَدَّهَا عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى طَلَّقَهَا وَهِيَ طَاهِرٌ ‏.‏",
    "malay_translation": "Daripada Ibnu Umar, bahawa beliau menceraikan isterinya ketika dalam keadaan haid.  Namun, Rasulullah SAW menyuruhnya mengambil kembali isterinya dan menceraikannya ketika suci (tidak dalam keadaan haid)."
  },
  {
    "id": 18141,
    "hadith_number": 3405,
    "tajuk_hadith": "Talak Ketika Haid",
    "perawi_melayu": "Daripada Yunus bin Jubair berkata:",
    "english_text": "\"I asked Ibn 'Umar about a man who divorced his wife while she was menstruating. He said: 'Do you know 'Abdullah bin 'Umar?' He divorced his wife while she was menstruating, and 'Umar asked the Prophet about that, and he told him to take her back, then wait for the right time. I said to him: 'Was that divorce counted?' He said: 'Be quiet! What do you think if some becomes helpless and behaves foolishly?'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ يُونُسَ بْنِ جُبَيْرٍ، قَالَ سَأَلْتُ ابْنَ عُمَرَ عَنْ رَجُلٍ، طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ فَقَالَ هَلْ تَعْرِفُ عَبْدَ اللَّهِ بْنَ عُمَرَ فَإِنَّهُ طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ فَسَأَلَ عُمَرُ النَّبِيَّ صلى الله عليه وسلم فَأَمَرَهُ أَنْ يُرَاجِعَهَا ثُمَّ يَسْتَقْبِلَ عِدَّتَهَا ‏.‏ فَقُلْتُ لَهُ فَيَعْتَدُّ بِتِلْكَ التَّطْلِيقَةِ فَقَالَ مَهْ أَرَأَيْتَ إِنْ عَجَزَ وَاسْتَحْمَقَ ‏.‏",
    "malay_translation": "Aku bertanya kepada Ibnu Umar tentang seorang lelaki yang menceraikan isterinya ketika dalam keadaan haid.  Beliau berkata: \"Adakah kamu kenal Abdullah bin Umar?  Dia menceraikan isterinya ketika isterinya sedang haid, lalu Umar bertanya kepada Nabi ﷺ, maka baginda menyuruhnya rujuk semula kepada isterinya, kemudian tunggu masa yang sesuai. Aku berkata kepadanya: \"Adakah talak itu dikira sah?\" Beliau berkata: \"Diam! Bagaimana pendapatmu jika seseorang itu lemah dan bertindak bodoh?\""
  },
  {
    "id": 18142,
    "hadith_number": 3406,
    "tajuk_hadith": "Talak Ketika Haid",
    "perawi_melayu": "Telah diriwayatkan bahawa Yunus bin Jubair berkata:",
    "english_text": "\"I said to Ibn 'Umar: 'A man divorced his wife while she was menstruating.' He said: 'Do you know 'Abdullah bin 'Umar? He divorced his wife when she was menstruating, and 'Umar went to the Prophet and asked him about that, and he told him to take her back then wait for the right time.' I said to him: 'Was that divorce counted?' He said: 'Be quiet! What do you think if some becomes helpless and behaves foolishly?'\"",
    "arabic_text": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ، عَنْ يُونُسَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ يُونُسَ بْنِ جُبَيْرٍ، قَالَ قُلْتُ لاِبْنِ عُمَرَ رَجُلٌ طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ فَقَالَ أَتَعْرِفُ عَبْدَ اللَّهِ بْنَ عُمَرَ فَإِنَّهُ طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ فَأَتَى عُمَرُ النَّبِيَّ صلى الله عليه وسلم يَسْأَلُهُ فَأَمَرَهُ أَنْ يُرَاجِعَهَا ثُمَّ يَسْتَقْبِلَ عِدَّتَهَا قُلْتُ لَهُ إِذَا طَلَّقَ الرَّجُلُ امْرَأَتَهُ وَهِيَ حَائِضٌ أَيَعْتَدُّ بِتِلْكَ التَّطْلِيقَةِ فَقَالَ مَهْ وَإِنْ عَجَزَ وَاسْتَحْمَقَ ‏.‏",
    "malay_translation": "Aku berkata kepada Ibnu Umar: 'Seorang lelaki menceraikan isterinya ketika dalam keadaan haid.'  Beliau berkata: 'Adakah engkau kenal Abdullah bin Umar?  Sesungguhnya dia menceraikan isterinya ketika dalam keadaan haid, lalu Umar pergi kepada Nabi ﷺ dan bertanya kepadanya tentang hal itu, maka baginda menyuruhnya rujuk semula kepada isterinya, kemudian menunggu tempoh iddah yang baru.' Aku berkata kepadanya: 'Adakah talak itu dikira sah?' Beliau berkata: 'Diamlah! Bagaimana pendapatmu jika seseorang itu lemah akalnya dan bertindak bodoh?'"
  },
  {
    "id": 18143,
    "hadith_number": 3407,
    "tajuk_hadith": "Larangan Talak Tiga Serentak",
    "perawi_melayu": "Makhramah meriwayatkan bahawa bapanya berkata:",
    "english_text": "\"I heard Mahmud bin Labid say: 'The Messenger of Allah was told about a man who had divorced his wife with three simultaneous divorces. He stood up angrily and said: Is the Book of Allah being toyed with while I am still among you? Then a man stood up and said: 'O Messenger of Allah, shall I kill him?'\"",
    "arabic_text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ، عَنِ ابْنِ وَهْبٍ، قَالَ أَخْبَرَنِي مَخْرَمَةُ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ مَحْمُودَ بْنَ لَبِيدٍ، قَالَ أُخْبِرَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ رَجُلٍ، طَلَّقَ امْرَأَتَهُ ثَلاَثَ تَطْلِيقَاتٍ جَمِيعًا فَقَامَ غَضْبَانًا ثُمَّ قَالَ ‏\n\"‏ أَيُلْعَبُ بِكِتَابِ اللَّهِ وَأَنَا بَيْنَ أَظْهُرِكُمْ ‏\"‏ ‏.‏ حَتَّى قَامَ رَجُلٌ وَقَالَ يَا رَسُولَ اللَّهِ أَلاَ أَقْتُلُهُ ‏.‏",
    "malay_translation": "Aku mendengar Mahmud bin Labid berkata: ‘Rasulullah SAW diberitahu tentang seorang lelaki yang menceraikan isterinya dengan tiga talak sekaligus. Baginda berdiri dengan marah lalu bersabda: “Adakah kitab Allah dipermainkan sedangkan Aku masih di kalangan kamu?” Kemudian, seorang lelaki berdiri dan berkata: “Wahai Rasulullah, patutkah saya membunuhnya?”’"
  },
  {
    "id": 18144,
    "hadith_number": 3408,
    "tajuk_hadith": "Hukum Menemukan Suami Dengan Wanita Lain",
    "perawi_melayu": "Sahl bin Sa'd As-Sa'idi meriwayatkan bahawa 'Uwaimir Al-'Ajlani datang kepada 'Asim bin 'Adiy dan berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنَا ابْنُ الْقَاسِمِ، عَنْ مَالِكٍ، قَالَ حَدَّثَنِي ابْنُ شِهَابٍ، أَنَّ سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ، أَخْبَرَهُ أَنَّ عُوَيْمِرًا الْعَجْلاَنِيَّ جَاءَ إِلَى عَاصِمِ بْنِ عَدِيٍّ فَقَالَ أَرَأَيْتَ يَا عَاصِمُ لَوْ أَنَّ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً أَيَقْتُلُهُ فَيَقْتُلُونَهُ أَمْ كَيْفَ يَفْعَلُ سَلْ لِي يَا عَاصِمُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ ‏.‏ فَسَأَلَ عَاصِمٌ رَسُولَ اللَّهِ صلى الله عليه وسلم فَكَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَسَائِلَ وَعَابَهَا حَتَّى كَبُرَ عَلَى عَاصِمٍ مَا سَمِعَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا رَجَعَ عَاصِمٌ إِلَى أَهْلِهِ جَاءَهُ عُوَيْمِرٌ فَقَالَ يَا عَاصِمُ مَاذَا قَالَ لَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ عَاصِمٌ لِعُوَيْمِرٍ لَمْ تَأْتِنِي بِخَيْرٍ قَدْ كَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَسْأَلَةَ الَّتِي سَأَلْتَ عَنْهَا ‏.‏ فَقَالَ عُوَيْمِرٌ وَاللَّهِ لاَ أَنْتَهِي حَتَّى أَسْأَلَ عَنْهَا رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏ فَأَقْبَلَ عُوَيْمِرٌ حَتَّى أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم وَسَطَ النَّاسِ فَقَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً أَيَقْتُلُهُ فَتَقْتُلُونَهُ أَمْ كَيْفَ يَفْعَلُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ قَدْ نَزَلَ فِيكَ وَفِي صَاحِبَتِكَ فَاذْهَبْ فَائْتِ بِهَا ‏\"‏ ‏.‏ قَالَ سَهْلٌ فَتَلاَعَنَا وَأَنَا مَعَ النَّاسِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا فَرَغَ عُوَيْمِرٌ قَالَ كَذَبْتُ عَلَيْهَا يَا رَسُولَ اللَّهِ إِنْ أَمْسَكْتُهَا ‏.‏ فَطَلَّقَهَا ثَلاَثًا قَبْلَ أَنْ يَأْمُرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Muhammad bin Salmah memberitahu kami, katanya: Ibnul Qasim telah menceritakan kepada kami daripada Malik, katanya: Ibn Syihab telah menceritakan kepadaku bahawa Sahl bin Saad As-Sa'di telah memberitahunya bahawa Uwaimir Al-Ajlani telah datang kepada Asim bin Adiyy dan berkata: “Apakah pendapatmu wahai Asim? Jika seorang lelaki mendapati seorang lelaki lain bersama isterinya, patutkah dia membunuhnya lalu dibunuh sebagai balasan, atau bagaimanakah dia perlu bertindak? Tanya untukku wahai Asim kepada Rasulullah SAW tentang hal itu.” Maka Asim bertanya kepada Rasulullah SAW, lalu Rasulullah SAW tidak menyukai banyak pertanyaan dan mencela perbuatan itu sehingga Asim merasa tidak senang dengan apa yang didengarnya daripada Rasulullah SAW.  Setelah Asim kembali kepada keluarganya, Uwaimir datang kepadanya dan bertanya: “Wahai Asim, apakah yang dikatakan oleh Rasulullah SAW kepadamu?” Asim menjawab: “Engkau tidak membawa berita baik kepadaku. Rasulullah SAW tidak menyukai soalan yang engkau tanyakan itu.” Uwaimir berkata: “Demi Allah, aku tidak akan berhenti sehingga aku bertanya kepada Rasulullah SAW tentangnya.” Maka Uwaimir pergi sehingga dia sampai kepada Rasulullah SAW di tengah-tengah orang ramai dan berkata: “Wahai Rasulullah SAW, apakah pendapatmu jika seorang lelaki mendapati seorang lelaki lain bersama isterinya, patutkah dia membunuhnya lalu dibunuh sebagai balasan atau bagaimanakah dia perlu bertindak?” Rasulullah SAW menjawab: “Telah turun wahyu tentangmu dan isterimu. Pergilah dan bawalah dia ke sini.” Sahl berkata: “Maka mereka pun melakukan prosedur Li’an, dan aku berada di kalangan orang ramai di sisi Rasulullah SAW. Setelah Uwaimir selesai, dia berkata: “Aku telah berdusta terhadapnya wahai Rasulullah SAW jika aku meneruskannya.” Maka dia menceraikan isterinya tiga kali sebelum Rasulullah SAW menyuruhnya berbuat demikian."
  },
  {
    "id": 18145,
    "hadith_number": 3409,
    "tajuk_hadith": "Hak Nafkah dan Tempat Tinggal Wanita yang Diceraikan",
    "perawi_melayu": "Fatimah binti Qais berkata:",
    "english_text": "\"I came to the Prophet and said: 'I am the daughter of Ali Khalid and my husband, so and so, sent word to me divorcing me. I asked his family for provision and shelter but they refused.' They said: 'O Messenger of Allah, he sent word to her divorcing her thrice.'\" She said: \"The Messenger of Allah said: 'The woman is still entitled to provision and shelter if the husband can still take her back.'\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ يَحْيَى، قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ يَزِيدَ الأَحْمَسِيُّ، قَالَ حَدَّثَنَا الشَّعْبِيُّ، قَالَ حَدَّثَتْنِي فَاطِمَةُ بِنْتُ قَيْسٍ، قَالَتْ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَقُلْتُ أَنَا بِنْتُ آلِ خَالِدٍ وَإِنَّ زَوْجِي فُلاَنًا أَرْسَلَ إِلَىَّ بِطَلاَقِي وَإِنِّي سَأَلْتُ أَهْلَهُ النَّفَقَةَ وَالسُّكْنَى فَأَبَوْا عَلَىَّ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ إِنَّهُ قَدْ أَرْسَلَ إِلَيْهَا بِثَلاَثِ تَطْلِيقَاتٍ ‏.‏ قَالَتْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّمَا النَّفَقَةُ وَالسُّكْنَى لِلْمَرْأَةِ إِذَا كَانَ لِزَوْجِهَا عَلَيْهَا الرَّجْعَةُ ‏\"‏ ‏.‏",
    "malay_translation": "Aku menghadap Nabi SAW dan berkata, \"Wahai Rasulullah, saya adalah anak perempuan daripada keluarga Khalid, dan suami saya, si fulan, telah menceraikan saya melalui pesanan. Saya telah meminta nafkah dan tempat tinggal daripada keluarganya, tetapi mereka menolak.\" Mereka berkata, \"Wahai Rasulullah, sesungguhnya dia telah menghantar tiga talak kepadanya.\"  Lalu Rasulullah SAW bersabda, \"Nafkah dan tempat tinggal adalah hak wanita sekiranya suaminya masih mempunyai hak rujuk ke atasnya.\""
  },
  {
    "id": 18146,
    "hadith_number": 3410,
    "tajuk_hadith": "Wanita yang Diceraikan Tiga Kali",
    "perawi_melayu": "Daripada Fatimah binti Qais, bahawa Nabi SAW bersabda:",
    "english_text": "\"The thrice-divorced woman is not entitled to provision and shelter.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ سَلَمَةَ، عَنِ الشَّعْبِيِّ، عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\n\"‏ الْمُطَلَّقَةُ ثَلاَثًا لَيْسَ لَهَا سُكْنَى وَلاَ نَفَقَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Wanita yang telah diceraikan tiga kali tidak berhak mendapat tempat tinggal dan nafkah."
  },
  {
    "id": 18147,
    "hadith_number": 3411,
    "tajuk_hadith": "Talak Tiga dan Nafkah",
    "perawi_melayu": "Fatimah binti Qais meriwayatkan bahawa Abu 'Amr bin Hafs Al-Makhzumi menceraikannya sebanyak tiga kali. Khalid bin Al-Walid bersama beberapa orang dari Bani Makhzum pergi kepada Rasulullah SAW dan berkata:",
    "english_text": "\"O Messenger of Allah! Abu 'Amr bin Hafs has divorced Fatimah thrice, is she entitled to provision?\" He said: \"She is not entitled to provision nor shelter.\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ، قَالَ حَدَّثَنَا بَقِيَّةُ، عَنْ أَبِي عَمْرٍو، - وَهُوَ الأَوْزَاعِيُّ - قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ، قَالَ حَدَّثَتْنِي فَاطِمَةُ بِنْتُ قَيْسٍ، أَنَّ أَبَا عَمْرِو بْنَ حَفْصٍ الْمَخْزُومِيَّ، طَلَّقَهَا ثَلاَثًا فَانْطَلَقَ خَالِدُ بْنُ الْوَلِيدِ فِي نَفَرٍ مِنْ بَنِي مَخْزُومٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أَبَا عَمْرِو بْنَ حَفْصٍ طَلَّقَ فَاطِمَةَ ثَلاَثًا فَهَلْ لَهَا نَفَقَةٌ فَقَالَ ‏\n\"‏ لَيْسَ لَهَا نَفَقَةٌ وَلاَ سُكْنَى ‏\"‏ ‏.‏",
    "malay_translation": "Mereka bertanya, \"Wahai Rasulullah! Abu 'Amr bin Hafs telah menceraikan Fatimah sebanyak tiga kali, adakah dia berhak mendapat nafkah?\" Baginda menjawab: \"Dia tidak berhak mendapat nafkah mahupun tempat tinggal.\""
  },
  {
    "id": 18148,
    "hadith_number": 3412,
    "tajuk_hadith": "Talak Tiga Pada Zaman Rasulullah SAW",
    "perawi_melayu": "Daripada Ibnu Tawus, daripada bapanya, bahawa Abu As-Sahba' datang kepada Ibnu Abbas dan berkata:",
    "english_text": "\"O Ibn 'Abbas! Did you not know that the threefold divorce during the time of the Messenger of Allah and Abu Bakr, and during the early part of 'Umar's Caliphate, used to be counted as one divorce?\" He said: \"Yes.\"",
    "arabic_text": "أَخْبَرَنَا أَبُو دَاوُدَ، سُلَيْمَانُ بْنُ سَيْفٍ قَالَ حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، أَنَّ أَبَا الصَّهْبَاءِ، جَاءَ إِلَى ابْنِ عَبَّاسٍ فَقَالَ يَا ابْنَ عَبَّاسٍ أَلَمْ تَعْلَمْ أَنَّ الثَّلاَثَ، كَانَتْ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَبِي بَكْرٍ وَصَدْرًا مِنْ خِلاَفَةِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا تُرَدُّ إِلَى الْوَاحِدَةِ قَالَ نَعَمْ ‏.‏",
    "malay_translation": "Daripada Abu Daud, Sulaiman bin Saif berkata, telah menceritakan kepada kami Abu 'Asim, daripada Ibnu Juraij, daripada Ibnu Tawus, daripada bapanya, bahawa Abu As-Sahba' datang kepada Ibnu Abbas lalu berkata, \"Wahai Ibnu Abbas, tidakkah engkau tahu bahawa tiga kali talak pada zaman Rasulullah SAW, Abu Bakar dan pada awal pemerintahan Umar r.a. dikira sebagai satu talak sahaja?\"  Beliau berkata, \"Ya.\""
  },
  {
    "id": 18149,
    "hadith_number": 3413,
    "tajuk_hadith": "Perkahwinan Semula Selepas Talak",
    "perawi_melayu": "Daripada Aisyah r.a.",
    "english_text": "\"The Messenger of Allah was asked about a man who divorced his wife, and she married another man who had a closed meeting with her then divorced her, before having intercourse with her. Is it permissible for her to remarry the first husband? The Messenger of Allah said: 'No, not until the second one tastes her sweetness and she tastes his sweetness.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ رَجُلٍ طَلَّقَ امْرَأَتَهُ فَتَزَوَّجَتْ زَوْجًا غَيْرَهُ فَدَخَلَ بِهَا ثُمَّ طَلَّقَهَا قَبْلَ أَنْ يُوَاقِعَهَا أَتَحِلُّ لِلأَوَّلِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ حَتَّى يَذُوقَ الآخَرُ عُسَيْلَتَهَا وَتَذُوقَ عُسَيْلَتَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW ditanya tentang seorang lelaki yang menceraikan isterinya, lalu isterinya itu berkahwin dengan lelaki lain. Lelaki itu telah berjumpa dengannya (walaupun belum disetubuhi) kemudian menceraikannya.  Adakah dibolehkan bagi isteri itu berkahwin semula dengan bekas suaminya yang pertama?  Rasulullah SAW menjawab: \"Tidak, sehingga lelaki yang kedua merasai kemanisan (kehidupan berumah tangga) dengannya dan dia juga merasai kemanisan (kehidupan berumah tangga) dengan lelaki yang kedua itu.\""
  },
  {
    "id": 18150,
    "hadith_number": 3414,
    "tajuk_hadith": "Perkahwinan dan Kehidupan Berumah Tangga",
    "perawi_melayu": "Daripada Aisyah r.a.",
    "english_text": "\"The wife of Rifa'ah Al-Qurazi came to the Messenger of Allah and said: 'O Messenger of Allah! I got married to 'Abdur-Rahman bin Az-Zabir, and what he has is like this fringe.' The Messenger of Allah said: 'Perhaps you want to go back to Rifa'ah? No, not until he ('Abdur-Rahman) tastes your sweetness and you taste his sweetness.'\"",
    "arabic_text": "أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ، قَالَ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ، عَنْ أَبِيهِ، قَالَ حَدَّثَنِي أَيُّوبُ بْنُ مُوسَى، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ جَاءَتِ امْرَأَةُ رِفَاعَةَ الْقُرَظِيِّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي نَكَحْتُ عَبْدَ الرَّحْمَنِ بْنَ الزَّبِيرِ وَاللَّهِ مَا مَعَهُ إِلاَّ مِثْلَ هَذِهِ الْهُدْبَةِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَعَلَّكِ تُرِيدِينَ أَنْ تَرْجِعِي إِلَى رِفَاعَةَ لاَ حَتَّى يَذُوقَ عُسَيْلَتَكِ وَتَذُوقِي عُسَيْلَتَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Isteri Rifa'ah Al-Qurazi telah datang kepada Rasulullah SAW dan berkata, \"Wahai Rasulullah, saya telah berkahwin dengan Abdur-Rahman bin Az-Zabir, dan apa yang dimilikinya hanyalah sedikit sahaja.\"  Rasulullah SAW bersabda, \"Mungkin engkau ingin kembali kepada Rifa'ah? Tidak, sehingga dia (Abdur-Rahman) merasai kemanisanmu dan engkau merasai kemanisannya.\""
  },
  {
    "id": 18151,
    "hadith_number": 3415,
    "tajuk_hadith": "Perceraian dan Perkahwinan Semula",
    "perawi_melayu": "Daripada Aisyah r.a.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ جَاءَتِ امْرَأَةُ رِفَاعَةَ الْقُرَظِيِّ إِلَى النَّبِيِّ صلى الله عليه وسلم وَأَبُو بَكْرٍ عِنْدَهُ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي كُنْتُ تَحْتَ رِفَاعَةَ الْقُرَظِيِّ فَطَلَّقَنِي الْبَتَّةَ فَتَزَوَّجْتُ عَبْدَ الرَّحْمَنِ بْنَ الزَّبِيرِ وَأَنَّهُ وَاللَّهِ يَا رَسُولَ اللَّهِ مَا مَعَهُ إِلاَّ مِثْلَ هَذِهِ الْهُدْبَةِ وَأَخَذَتْ هُدْبَةً مِنْ جِلْبَابِهَا وَخَالِدُ بْنُ سَعِيدٍ بِالْبَابِ فَلَمْ يُأْذَنْ لَهُ فَقَالَ يَا أَبَا بَكْرٍ أَلاَ تَسْمَعُ هَذِهِ تَجْهَرُ بِمَا تَجْهَرُ بِهِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَقَالَ ‏\n\"‏ تُرِيدِينَ أَنْ تَرْجِعِي إِلَى رِفَاعَةَ لاَ حَتَّى تَذُوقِي عُسَيْلَتَهُ وَيَذُوقَ عُسَيْلَتَكِ ‏\"‏ ‏.‏",
    "malay_translation": "Dikhabarkan kepada kami oleh Amru bin Ali, katanya: telah menceritakan kepada kami Yazid bin Zurai’, katanya: telah menceritakan kepada kami Ma’mar, daripada Az- Zuhri, daripada Urwah, daripada Aisyah r.a., katanya: “Isteri Rifa’ah Al-Qurazi datang kepada Nabi SAW ketika Abu Bakar berada di sisi Baginda.  Lalu dia berkata: “Wahai Rasulullah, saya telah berkahwin dengan Rifa’ah Al-Qurazi, kemudian dia menceraikan saya secara muktamad.  Selepas itu, saya berkahwin dengan Abdur Rahman bin Az-Zabir.  Demi Allah, wahai Rasulullah, apa yang dimilikinya hanyalah seperti ini sahaja,” sambil menunjukkan hujung kain jilbabnya.  Khalid bin Sa’id berada di pintu dan tidak dibenarkan masuk.  Dia berkata: “Wahai Abu Bakar, tidakkah engkau dengar wanita ini bercakap dengan begitu lantang di hadapan Rasulullah SAW?”  Abu Bakar menjawab: “Adakah engkau ingin kembali kepada Rifa’ah?  Tidak, sehingga engkau merasai kemanisan darinya dan dia pun merasai kemanisan darimu.”"
  },
  {
    "id": 18152,
    "hadith_number": 3416,
    "tajuk_hadith": "Tiga Talak",
    "perawi_melayu": "Hammad bin Zaid berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ نَصْرِ بْنِ عَلِيٍّ، قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، قَالَ قُلْتُ لأَيُّوبَ هَلْ عَلِمْتَ أَحَدًا قَالَ فِي أَمْرِكِ بِيَدِكِ أَنَّهَا ثَلاَثٌ غَيْرَ الْحَسَنِ فَقَالَ لاَ ثُمَّ قَالَ اللَّهُمَّ غَفْرًا إِلاَّ مَا حَدَّثَنِي قَتَادَةُ عَنْ كَثِيرٍ مَوْلَى ابْنِ سَمُرَةَ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ ثَلاَثٌ ‏\"‏ ‏.‏ فَلَقِيتُ كَثِيرًا فَسَأَلْتُهُ فَلَمْ يَعْرِفْهُ فَرَجَعْتُ إِلَى قَتَادَةَ فَأَخْبَرْتُهُ فَقَالَ نَسِيَ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا حَدِيثٌ مُنْكَرٌ ‏.‏",
    "malay_translation": "Ali bin Nasr bin Ali telah memberitahu kami, katanya: Sulaiman bin Harb telah memberitahu kami, katanya: Hammad bin Zaid telah memberitahu kami, katanya: Aku berkata kepada Ayyub, \"Adakah engkau mengetahui sesiapa yang berkata mengenai perkataan 'hak pilihan di tanganmu' bahawa ia bersamaan dengan tiga (talak) selain Al-Hasan?\" Maka dia berkata, \"Tidak.\" Kemudian dia berkata, \"Ya Allah, ampunkanlah.\"  Kecuali apa yang telah diceritakan kepadaku oleh Qatadah daripada Kathir, hamba sahaya Ibn Samurah, daripada Abu Salamah, daripada Abu Hurairah, daripada Nabi SAW, baginda bersabda: \"Tiga.\"  Maka aku telah menemui Kathir lalu aku bertanya kepadanya, tetapi dia tidak mengetahuinya.  Lalu aku kembali kepada Qatadah dan aku memberitahunya, maka dia berkata: \"Dia telah lupa.\" Abu Abdur Rahman berkata: Hadis ini adalah hadis yang munkar."
  },
  {
    "id": 18153,
    "hadith_number": 3417,
    "tajuk_hadith": "Perkahwinan Semula Selepas Talak Bain",
    "perawi_melayu": "Daripada Aisyah r.a.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ جَاءَتِ امْرَأَةُ رِفَاعَةَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ إِنَّ زَوْجِي طَلَّقَنِي فَأَبَتَّ طَلاَقِي وَإِنِّي تَزَوَّجْتُ بَعْدَهُ عَبْدَ الرَّحْمَنِ بْنَ الزَّبِيرِ وَمَا مَعَهُ إِلاَّ مِثْلَ هُدْبَةِ الثَّوْبِ ‏.‏ فَضَحِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏\n\"‏ لَعَلَّكِ تُرِيدِينَ أَنْ تَرْجِعِي إِلَى رِفَاعَةَ لاَ حَتَّى يَذُوقَ عُسَيْلَتَكِ وَتَذُوقِي عُسَيْلَتَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ishak bin Ibrahim, katanya; telah memberitakan kepada kami Sufyan, daripada Az- Zuhri, daripada Urwah, daripada Aisyah r.a., katanya:  Isteri Rifa’ah datang kepada Rasulullah SAW lalu berkata: “Sesungguhnya,suamiku menceraikanku dengan talak bain (cerai tiga), dan aku telah berkahwin dengan Abdul Rahman bin Az-Zabir setelah itu.  Namun,harta bendanya sedikit sahaja, seperti tepi kain.” Rasulullah SAW tersenyum lalu bersabda: “Mungkin engkau ingin kembali kepada Rifa’ah? Tidak, sehingga dia merasai kelembutanmu dan engkau merasai kelembutannya.”"
  },
  {
    "id": 18154,
    "hadith_number": 3418,
    "tajuk_hadith": "Perkahwinan Semula Selepas Talak Tiga",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "\"Is she permissible for the first (husband to remarry her)?\" He said: \"No, not until he tastes her sweetness as the first tasted her sweetness.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنِي عُبَيْدُ اللَّهِ، قَالَ حَدَّثَنِي الْقَاسِمُ، عَنْ عَائِشَةَ، أَنَّ رَجُلاً، طَلَّقَ امْرَأَتَهُ ثَلاَثًا فَتَزَوَّجَتْ زَوْجًا فَطَلَّقَهَا قَبْلَ أَنْ يَمَسَّهَا فَسُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَتَحِلُّ لِلأَوَّلِ فَقَالَ ‏\n\"‏ لاَ حَتَّى يَذُوقَ عُسَيْلَتَهَا كَمَا ذَاقَ الأَوَّلُ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Aisyah r.a., bahawa seorang lelaki menceraikan isterinya dengan talak tiga. Kemudian, isterinya berkahwin dengan lelaki lain, tetapi diceraikan sebelum disetubuhi. Lalu Rasulullah s.a.w. ditanya, \"Adakah dia halal untuk suami pertamanya?\" Baginda menjawab, \"Tidak, sehingga dia merasai kemanisan isterinya sepertimana yang dirasai oleh suami pertamanya.\""
  },
  {
    "id": 18155,
    "hadith_number": 3419,
    "tajuk_hadith": "Perempuan Tidak Boleh Kembali Kepada Suami Pertama Sebelum Menikmati Kehidupan Perkahwinan",
    "perawi_melayu": "Daripada Abdullah bin Abbas bahawa Al-Ghumaisa atau Ar-Rumaisa datang kepada Nabi SAW mengadu tentang suaminya yang tidak menghampirinya. Tidak lama kemudian, suaminya datang dan berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَنْبَأَنَا هُشَيْمٌ، قَالَ أَنْبَأَنَا يَحْيَى بْنُ أَبِي إِسْحَاقَ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ الْغُمَيْصَاءَ، أَوِ الرُّمَيْصَاءَ أَتَتِ النَّبِيَّ صلى الله عليه وسلم تَشْتَكِي زَوْجَهَا أَنَّهُ لاَ يَصِلُ إِلَيْهَا فَلَمْ يَلْبَثْ أَنْ جَاءَ زَوْجُهَا فَقَالَ يَا رَسُولَ اللَّهِ هِيَ كَاذِبَةٌ وَهُوَ يَصِلُ إِلَيْهَا وَلَكِنَّهَا تُرِيدُ أَنْ تَرْجِعَ إِلَى زَوْجِهَا الأَوَّلِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَيْسَ ذَلِكَ حَتَّى تَذُوقِي عُسَيْلَتَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ali bin Hujr, katanya; telah menceritakan kepada kami Husyaim, katanya; telah menceritakan kepada kami Yahya bin Abi Ishaq, daripada Sulaiman bin Yasar, daripada Ubaidullah bin Abbas, bahawa Al-Ghumaisa atau Ar-Rumaisa datang kepada Nabi SAW mengadu tentang suaminya yang tidak menghampirinya. Tidak lama kemudian, suaminya datang dan berkata, \"Wahai Rasulullah, isteriku berdusta. Suami ini telah menghampirinya, tetapi dia ingin kembali kepada suaminya yang pertama.\"  Maka Rasulullah SAW bersabda: \"Itu tidak boleh sehingga dia merasai kemanisan (kehidupan perkahwinan) dengannya.\""
  },
  {
    "id": 18156,
    "hadith_number": 3420,
    "tajuk_hadith": "Perempuan Yang Diceraikan Kemudian Menikah Lagi Sebelum Dicampuri",
    "perawi_melayu": "Daripada Ibnu Umar bahawa Nabi SAW bersabda berkenaan seorang lelaki yang mempunyai isteri dan menceraikannya, kemudian isterinya itu berkahwin dengan lelaki lain yang menceraikannya sebelum di campuri, dan (ditanya) sama ada dia boleh kembali kepada suami pertamanya:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، قَالَ سَمِعْتُ سَالِمَ بْنَ رَزِينٍ، يُحَدِّثُ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم فِي الرَّجُلِ تَكُونُ لَهُ الْمَرْأَةُ يُطَلِّقُهَا ثُمَّ يَتَزَوَّجُهَا رَجُلٌ آخَرُ فَيُطَلِّقُهَا قَبْلَ أَنْ يَدْخُلَ بِهَا فَتَرْجِعَ إِلَى زَوْجِهَا الأَوَّلِ قَالَ ‏\n\"‏ لاَ حَتَّى تَذُوقَ الْعُسَيْلَةَ ‏\"‏ ‏.‏",
    "malay_translation": "Tidak, sehingga dia merasai kemanisan (hubungan suami isteri)."
  },
  {
    "id": 18157,
    "hadith_number": 3421,
    "tajuk_hadith": "Perkahwinan Selepas Talak Tiga",
    "perawi_melayu": "Daripada Ibnu Umar, ia berkata:",
    "english_text": "\"The Prophet was asked about a man who divorced his wife three times, then another man married her and he closed the door and drew the curtain, then divorced her before consummating the marriage with her. He said: \"She is not permissible for the first one (to remarry her) until the second one has had intercourse with her.\"\"",
    "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا وَكِيعٌ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ رَزِينِ بْنِ سُلَيْمَانَ الأَحْمَرِيِّ، عَنِ ابْنِ عُمَرَ، قَالَ سُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنِ الرَّجُلِ يُطَلِّقُ امْرَأَتَهُ ثَلاَثًا فَيَتَزَوَّجُهَا الرَّجُلُ فَيُغْلِقُ الْبَابَ وَيُرْخِي السِّتْرَ ثُمَّ يُطَلِّقُهَا قَبْلَ أَنْ يَدْخُلَ بِهَا قَالَ ‏\n\"‏ لاَ تَحِلُّ لِلأَوَّلِ حَتَّى يُجَامِعَهَا الآخَرُ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا أَوْلَى بِالصَّوَابِ ‏.‏",
    "malay_translation": "Daripada Ibnu Umar, bahawa Nabi SAW ditanya tentang seorang lelaki menceraikan isterinya tiga kali, kemudian lelaki lain mengahwininya, lalu lelaki itu menutup pintu dan menarik tirai, kemudian menceraikannya sebelum disetubuhi. Baginda bersabda:  \"Isteri itu tidak halal bagi yang pertama sehingga yang kedua menghampirinya.\"  (Riwayat Abu Abdur Rahman menyatakan ini lebih tepat)."
  },
  {
    "id": 18158,
    "hadith_number": 3422,
    "tajuk_hadith": "Laknat Rasulullah ke atas Wanita yang Mentazinkan dan yang Ditapaikan, dan Lain-lain",
    "perawi_melayu": "Daripada Abdullah, katanya:",
    "english_text": "\"The Messenger of Allah cursed the woman who tattoos and the one tattooed, the woman who fixed hair extensions and the one who had her hair get extended, the consumer of Riba and the one who pays it, and Al-Muhallil and Al-Muhallal Lahu.\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ، عَنْ سُفْيَانَ، عَنْ أَبِي قَيْسٍ، عَنْ هُزَيْلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْوَاشِمَةَ وَالْمُوتَشِمَةَ وَالْوَاصِلَةَ وَالْمَوْصُولَةَ وَآكِلَ الرِّبَا وَمُوكِلَهُ وَالْمُحَلِّلَ وَالْمُحَلَّلَ لَهُ ‏.‏",
    "malay_translation": "Rasulullah SAW melaknat wanita yang menindik dan yang ditindik, wanita yang menyambung rambut dan yang rambutnya disambung, pemakan riba dan yang memberi riba, dan al-Muhallil dan al-Muhallal lahu."
  },
  {
    "id": 18159,
    "hadith_number": 3423,
    "tajuk_hadith": "Melihat Perlindungan Allah",
    "perawi_melayu": "Daripada Aisyah r.a bahawa apabila wanita dari kabilah Kilāb memasuki pertemuan Nabi SAW, dia berkata:",
    "english_text": "\"I seek refuge with Allah from you.\" The Messenger of Allah said: \"You have sought refuge with One Who is Great. Go back to your family.\"",
    "arabic_text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ، قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ سَأَلْتُ الزُّهْرِيَّ عَنِ الَّتِي، اسْتَعَاذَتْ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ أَخْبَرَنِي عُرْوَةُ عَنْ عَائِشَةَ أَنَّ الْكِلاَبِيَّةَ لَمَّا دَخَلَتْ عَلَى النَّبِيِّ صلى الله عليه وسلم قَالَتْ أَعُوذُ بِاللَّهِ مِنْكَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَقَدْ عُذْتِ بِعَظِيمٍ الْحَقِي بِأَهْلِكِ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Aisyah r.a bahawa seorang wanita dari kabilah Kilāb telah masuk mengadap Nabi SAW, lalu berkata, \"Aku berlindung kepada Allah daripada engkau.\"  Maka Rasulullah SAW bersabda, \"Sesungguhnya engkau telah berlindung kepada yang Maha Agung. Pulanglah kepada keluargamu.\""
  },
  {
    "id": 18160,
    "hadith_number": 3424,
    "tajuk_hadith": "Talak Tiga dan Idah",
    "perawi_melayu": "Telah diriwayatkan bahawa Abu Bakar -anak Abu Al-Jahm- berkata:",
    "english_text": "\"I heard Fatimah bint Qais say: 'My husband sent word to me that I was divorced, so I put on my garments and went to the Prophet. He said: 'How many times did he divorce you?' I said: 'Three.' He said: 'You are not entitled to maintenance. Observe your 'Iddah in the house of your paternal cousin Ibn Umm Maktum, for he is blind and you can take off your garments there. And when your 'Iddah is over let me know.'\" This is an abridgment.",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ أَبِي بَكْرٍ، - وَهُوَ ابْنُ أَبِي الْجَهْمِ - قَالَ سَمِعْتُ فَاطِمَةَ بِنْتَ قَيْسٍ، تَقُولُ أَرْسَلَ إِلَىَّ زَوْجِي بِطَلاَقِي فَشَدَدْتُ عَلَىَّ ثِيَابِي ثُمَّ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ كَمْ طَلَّقَكِ ‏\"‏ ‏.‏ فَقُلْتُ ثَلاَثًا ‏.‏ قَالَ ‏\"‏ لَيْسَ لَكِ نَفَقَةٌ وَاعْتَدِّي فِي بَيْتِ ابْنِ عَمِّكِ ابْنِ أُمِّ مَكْتُومٍ فَإِنَّهُ ضَرِيرُ الْبَصَرِ تُلْقِينَ ثِيَابَكِ عِنْدَهُ فَإِذَا انْقَضَتْ عِدَّتُكِ فَآذِنِينِي ‏\"‏ ‏.‏ مُخْتَصَرٌ ‏.‏",
    "malay_translation": "Aku mendengar Fatimah binti Qais berkata, ‘Suamiku telah menghantar khabar kepadaku bahawa dia menceraikanku, maka aku memakai pakaianku dan pergi kepada Nabi SAW. Baginda bertanya, “Berapa kali dia menceraikanmu?” Aku menjawab, “Tiga kali.” Baginda bersabda, “Engkau tidak berhak mendapat nafkah.  Tunaikan iddahmu di rumah sepupu sebelah bapa saudaramu, Ibnu Umm Maktum, kerana dia seorang yang buta, dan engkau boleh menanggalkan pakaianmu di sisinya. Apabila iddahmu telah selesai, beritahu aku.” Ini adalah ringkasan."
  },
  {
    "id": 18161,
    "hadith_number": 3425,
    "tajuk_hadith": "Riwayat Serupa daripada Tamim, Mbebas Fatimah",
    "perawi_melayu": "Ubaidullah bin Sa'id; Abdur Rahman; Sufyan; Mansur; Mujahid; Tamim, hamba sahaya Fatimah; Fatimah.",
    "english_text": "A similar report was narrated from Tamim, the freed slave of Fatimah, from Fatimah.",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنْ تَمِيمٍ، مَوْلَى فَاطِمَةَ عَنْ فَاطِمَةَ، نَحْوَهُ ‏.‏",
    "malay_translation": "Kami diberitakan oleh Ubaidullah bin Sa'id, katanya: Telah menceritakan kepada kami Abdur Rahman, daripada Sufyan, daripada Mansur, daripada Mujahid, daripada Tamim, hamba sahaya Fatimah, daripada Fatimah, lebih kurang begitu."
  },
  {
    "id": 18162,
    "hadith_number": 3426,
    "tajuk_hadith": "Mengharamkan Isteri Sendiri",
    "perawi_melayu": "Daripada Ibnu Abbas r.a.",
    "english_text": "\"A man came to him and said: 'I have made my wife forbidden to myself.' He said: 'You are lying, she is not forbidden to you.' Then he recited this Verse: 'O Prophet! Why do you forbid (for yourself) that which Allah has allowed to you.' (And he said): 'You have to offer the severest form of expiation: Freeing a slave.'\"",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الصَّمَدِ بْنِ عَلِيٍّ الْمَوْصِلِيُّ، قَالَ حَدَّثَنَا مَخْلَدٌ، عَنْ سُفْيَانَ، عَنْ سَالِمٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أَتَاهُ رَجُلٌ فَقَالَ إِنِّي جَعَلْتُ امْرَأَتِي عَلَىَّ حَرَامًا ‏.‏ قَالَ كَذَبْتَ لَيْسَتْ عَلَيْكَ بِحَرَامٍ ثُمَّ تَلاَ هَذِهِ الآيَةَ ‏{‏ يَا أَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَا أَحَلَّ اللَّهُ لَكَ ‏}‏ عَلَيْكَ أَغْلَظُ الْكَفَّارَةِ عِتْقُ رَقَبَةٍ ‏.‏",
    "malay_translation": "Seorang lelaki datang kepada Nabi SAW dan berkata, \"Wahai Rasulullah, saya telah mengharamkan isteri saya daripada diri saya sendiri.\" Baginda menjawab, \"Kamu berdusta, isterimu bukanlah haram ke atasmu.\" Kemudian Baginda membaca ayat ini:  \"Wahai Nabi, mengapakah engkau mengharamkan apa yang Allah telah menghalalkan bagimu?\" (Al-Tahrim: 1).  Lalu Baginda bersabda, \"Kafarah yang paling berat untuk dosa ini adalah dengan membebaskan seorang hamba.\" "
  },
  {
    "id": 18163,
    "hadith_number": 3427,
    "tajuk_hadith": "Nabi SAW Minum Madu di Rumah Zainab",
    "perawi_melayu": "'Ubaid bin 'Umair meriwayatkan daripada Aisyah, isteri Nabi:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ حَجَّاجٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، أَنَّهُ سَمِعَ عُبَيْدَ بْنَ عُمَيْرٍ، قَالَ سَمِعْتُ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَمْكُثُ عِنْدَ زَيْنَبَ وَيَشْرَبُ عِنْدَهَا عَسَلاً فَتَوَاصَيْتُ وَحَفْصَةَ أَيَّتُنَا مَا دَخَلَ عَلَيْهَا النَّبِيُّ صلى الله عليه وسلم فَلْتَقُلْ إِنِّي أَجِدُ مِنْكَ رِيحَ مَغَافِيرَ فَدَخَلَ عَلَى إِحْدَاهُمَا فَقَالَتْ ذَلِكَ لَهُ فَقَالَ ‏\"‏ بَلْ شَرِبْتُ عَسَلاً عِنْدَ زَيْنَبَ - وَقَالَ - لَنْ أَعُودَ لَهُ ‏\"‏ ‏.‏ فَنَزَلَ ‏{‏ يَا أَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَا أَحَلَّ اللَّهُ لَكَ ‏}‏ ‏{‏ إِنْ تَتُوبَا إِلَى اللَّهِ ‏}‏ لِعَائِشَةَ وَحَفْصَةَ ‏{‏ وَإِذْ أَسَرَّ النَّبِيُّ إِلَى بَعْضِ أَزْوَاجِهِ حَدِيثًا ‏}‏ لِقَوْلِهِ ‏\"‏ بَلْ شَرِبْتُ عَسَلاَ ‏\"‏ ‏.‏ كُلُّهُ فِي حَدِيثِ عَطَاءٍ ‏.‏",
    "malay_translation": "Kami diberitakan oleh Qutaibah, daripada Hajjaj, daripada Ibnu Juraij, daripada Ataa’, bahawa dia mendengar Ubaid bin Umair berkata: Aku mendengar Aisyah, isteri Nabi SAW, bahawa Nabi SAW biasa tinggal di sisi Zainab dan minum madu di rumahnya. Maka aku dan Hafsah telah bersepakat, bahawa jika Nabi SAW datang kepada salah seorang daripada kami, maka hendaklah dia berkata: “Aku merasa bau Maghafir (sejenis getah yang berbau busuk) pada diri tuan, adakah tuan telah memakan Maghafir?”  Kemudian Nabi SAW datang kepada salah seorang daripada kami, lalu dia berkata demikian kepada Nabi SAW.  Nabi SAW menjawab: “Bukan, tetapi aku minum madu di rumah Zainab, tetapi aku tidak akan melakukannya lagi.” Kemudian turunlah ayat: {Wahai Nabi, mengapakah engkau mengharamkan apa yang Allah halalkan untukmu?} {Jika kamu berdua bertaubat kepada Allah} iaitu untuk Aisyah dan Hafsah. {Dan (ingatlah) ketika Nabi membisikkan sesuatu perkara rahsia kepada salah seorang isterinya} merujuk kepada sabdanya: “Bukan, tetapi aku minum madu.” Kesemuanya ini terdapat dalam hadis Ataa’."
  },
  {
    "id": 18164,
    "hadith_number": 3428,
    "tajuk_hadith": "Menjauhi Isteri atas Perintah Rasulullah",
    "perawi_melayu": "Ka'b bin Malik meriwayatkan hadis tentang ketika beliau tertinggal dan tidak menyertai Rasulullah SAW dalam ekspedisi Tabuk. Beliau menceritakan kisahnya dan berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ نُعَيْمٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ مَكِّيِّ بْنِ عِيسَى، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، قَالَ حَدَّثَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ، قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ، يُحَدِّثُ حَدِيثَهُ حِينَ تَخَلَّفَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ تَبُوكَ وَقَالَ فِيهِ إِذَا رَسُولُ رَسُولِ اللَّهِ صلى الله عليه وسلم يَأْتِينِي فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ح وَأَخْبَرَنِي سُلَيْمَانُ بْنُ دَاوُدَ قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبِ بْنِ مَالِكٍ قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ يُحَدِّثُ حَدِيثَهُ حِينَ تَخَلَّفَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ تَبُوكَ وَسَاقَ قِصَّتَهُ وَقَالَ إِذَا رَسُولُ رَسُولِ اللَّهِ صلى الله عليه وسلم يَأْتِي فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْمُرُكَ أَنْ تَعْتَزِلَ امْرَأَتَكَ ‏.‏ فَقُلْتُ أُطَلِّقُهَا أَمْ مَاذَا قَالَ لاَ بَلِ اعْتَزِلْهَا فَلاَ تَقْرَبْهَا ‏.‏ فَقُلْتُ لاِمْرَأَتِي الْحَقِي بِأَهْلِكِ فَكُونِي عِنْدَهُمْ حَتَّى يَقْضِيَ اللَّهُ عَزَّ وَجَلَّ فِي هَذَا الأَمْرِ ‏.‏",
    "malay_translation": "Muhammad bin Hatim bin Nu'aim telah memberitahu kami, katanya: Muhammad bin Makki bin Isa telah memberitahu kami, katanya: Abdullah telah memberitahu kami, katanya: Yunus telah memberitahu kami daripada Zuhri, daripada Abdurrahman bin Abdullah bin Ka'ab bin Malik, katanya: Aku mendengar Ka'ab bin Malik menceritakan hadisnya ketika beliau tertinggal daripada Rasulullah SAW dalam peperangan Tabuk dan beliau berkata di dalamnya: apabila utusan Rasulullah SAW datang kepadaku, lalu dia berkata: Sesungguhnya Rasulullah SAW memerintahkan engkau supaya menjauhi isterimu. Maka aku berkata: Patutkah aku menceraikannya atau apa? Dia berkata: Tidak, tetapi jauhilah dia dan jangan engkau menghampirinya. Maka aku berkata kepada isteriku: Pergilah kepada keluargamu dan tinggallah bersama mereka sehingga Allah SWT memutuskan perkara ini."
  },
  {
    "id": 18165,
    "hadith_number": 3429,
    "tajuk_hadith": "Menjauhi Isteri Atas Perintah Rasulullah",
    "perawi_melayu": "Abd al-Rahman bin Abdullah bin Ka'b bin Malik meriwayatkan bahawa bapanya berkata:",
    "english_text": "\"I heard my father Ka'b bin Malik -who was one of the three whose repentance was accepted- say: 'The Messenger of Allah sent word to me and to my two companions saying: The Messenger of Allah commands you to keep away from your wives. I said to his envoy: Shall I divorce my wife, or what should I do? He said: No, just keep away from her, and do not approach her. I said to my wife: Go to your family and stay with them. So she went to them.'\"",
    "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ جَبَلَةَ، وَمُحَمَّدُ بْنُ يَحْيَى بْنِ مُحَمَّدٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى بْنِ أَعْيَنَ، قَالَ حَدَّثَنَا أَبِي، عَنْ إِسْحَاقَ بْنِ رَاشِدٍ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ أَبِي كَعْبَ بْنَ مَالِكٍ، - قَالَ وَهُوَ أَحَدُ الثَّلاَثَةِ الَّذِينَ تِيبَ عَلَيْهِمْ - يُحَدِّثُ قَالَ أَرْسَلَ إِلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَإِلَى صَاحِبَىَّ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْمُرُكُمْ أَنْ تَعْتَزِلُوا نِسَاءَكُمْ ‏.‏ فَقُلْتُ لِلرَّسُولِ أُطَلِّقُ امْرَأَتِي أَمْ مَاذَا أَفْعَلُ قَالَ لاَ بَلْ تَعْتَزِلُهَا فَلاَ تَقْرَبْهَا ‏.‏ فَقُلْتُ لاِمْرَأَتِي الْحَقِي بِأَهْلِكِ فَكُونِي فِيهِمْ فَلَحِقَتْ بِهِمْ ‏.‏",
    "malay_translation": "Aku mendengar bapaku, Ka'b bin Malik – yang merupakan salah seorang daripada tiga orang yang taubatnya diterima – berkata: ‘Rasulullah SAW telah menghantar utusan kepada aku dan dua orang sahabatku dengan pesanan: Rasulullah SAW memerintahkan kamu supaya menjauhi isteri-isteri kamu. Aku bertanya kepada utusan baginda: Patutkah aku menceraikan isteriku, atau apakah yang harus aku lakukan? Jawabnya: Tidak, tetapi engkau hendaklah menjauhinya dan jangan mendekatinya. Aku berkata kepada isteriku: Pergilah kepada keluargamu dan tinggal bersama mereka. Maka pergilah dia kepada mereka.’"
  },
  {
    "id": 18166,
    "hadith_number": 3430,
    "tajuk_hadith": "Menjauhi Isteri Semasa Ekspedisi Tabuk",
    "perawi_melayu": "Abdullah bin Ka'b meriwayatkan bahawa Abdullah bin Ka'b berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبٍ، أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبٍ، قَالَ سَمِعْتُ كَعْبًا، يُحَدِّثُ حَدِيثَهُ حِينَ تَخَلَّفَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ تَبُوكَ وَقَالَ فِيهِ إِذَا رَسُولُ رَسُولِ اللَّهِ صلى الله عليه وسلم يَأْتِينِي وَيَقُولُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْمُرُكَ أَنْ تَعْتَزِلَ امْرَأَتَكَ ‏.‏ فَقُلْتُ أُطَلِّقُهَا أَمْ مَاذَا أَفْعَلُ قَالَ بَلِ اعْتَزِلْهَا وَلاَ تَقْرَبْهَا ‏.‏ وَأَرْسَلَ إِلَى صَاحِبَىَّ بِمِثْلِ ذَلِكَ فَقُلْتُ لاِمْرَأَتِي الْحَقِي بِأَهْلِكِ وَكُونِي عِنْدَهُمْ حَتَّى يَقْضِيَ اللَّهُ عَزَّ وَجَلَّ فِي هَذَا الأَمْرِ ‏.‏ خَالَفَهُمْ مَعْقِلُ بْنُ عُبَيْدِ اللَّهِ ‏.‏",
    "malay_translation": "Kami diberitahu oleh Yusuf bin Said, katanya; telah menceritakan kepada kami Hajjaj bin Muhammad, katanya; telah menceritakan kepada kami Laith bin Saad, katanya; telah menceritakan kepadaku Uqail, daripada Ibnu Syihab, katanya; telah memberitahu aku Abdur Rahman bin Abdullah bin Ka'ab, bahawa Abdullah bin Ka'ab berkata: Aku mendengar Ka'ab menceritakan tentang kisah baginda ketika ketinggalan daripada Rasulullah SAW dalam ekspedisi Tabuk, dan baginda berkata dalam cerita itu: Kemudian utusan Rasulullah SAW datang kepadaku dan berkata: Sesungguhnya Rasulullah SAW memerintahkan engkau supaya menjauhi isterimu. Maka aku bertanya: Patutkah aku menceraikannya atau apa yang harus aku lakukan?  Dia menjawab: Tidak, tetapi jauhilah dia dan janganlah engkau mendekatinya. Dan dia telah menghantar arahan yang sama kepada kedua temanku. Maka aku berkata kepada isteriku: Pergilah kepada keluargamu dan tinggallah bersama mereka sehingga Allah SWT memutuskan tentang perkara ini. Ma'qil bin Ubaidillah telah menyelisihi mereka."
  },
  {
    "id": 18167,
    "hadith_number": 3431,
    "tajuk_hadith": "Menjauhi Isteri Atas Perintah Rasulullah SAW",
    "perawi_melayu": "Dari Ma'qil, dari Az-Zuhri yang berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْدَانَ بْنِ عِيسَى، قَالَ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، قَالَ حَدَّثَنَا مَعْقِلٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبٍ، عَنْ عَمِّهِ، عُبَيْدِ اللَّهِ بْنِ كَعْبٍ قَالَ سَمِعْتُ أَبِي كَعْبًا، يُحَدِّثُ قَالَ أَرْسَلَ إِلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَإِلَى صَاحِبَىَّ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْمُرُكُمْ أَنْ تَعْتَزِلُوا نِسَاءَكُمْ فَقُلْتُ لِلرَّسُولِ أُطَلِّقُ امْرَأَتِي أَمْ مَاذَا أَفْعَلُ قَالَ لاَ بَلْ تَعْتَزِلُهَا وَلاَ تَقْرَبْهَا ‏.‏ فَقُلْتُ لاِمْرَأَتِي الْحَقِي بِأَهْلِكِ فَكُونِي فِيهِمْ حَتَّى يَقْضِيَ اللَّهُ عَزَّ وَجَلَّ ‏.‏ فَلَحِقَتْ بِهِمْ ‏.‏ خَالَفَهُ مَعْمَرٌ ‏.‏",
    "malay_translation": "Muhammad bin Ma'dan bin Isa telah memberitakan kepada kami, katanya: Al-Hasan bin A'yan telah menceritakan kepada kami, katanya: Ma'qil telah menceritakan kepada kami, daripada Az-Zuhri, katanya: Abdur-Rahman bin Abdullah bin Ka'b telah memberitakan kepadaku, daripada bapa saudaranya, Ubaidullah bin Ka'b yang berkata: Aku mendengar bapaku, Ka'b, menceritakan bahawa Rasulullah SAW telah mengutus seseorang kepadaku dan kepada dua orang sahabatku dengan pesanan bahawa Rasulullah SAW memerintahkan kami supaya menjauhi isteri-isteri kami. Maka aku bertanya kepada utusan itu: Patutkah aku menceraikan isteriku, atau apakah yang harus aku lakukan? Dia menjawab: Tidak, tetapi engkau hendaklah menjauhinya dan janganlah mendekatinya. Maka aku berkata kepada isteriku: Pergilah kepada keluargamu dan tinggallah bersama mereka sehingga Allah SWT menentukan (tentang hal ini). Maka pergilah isteriku kepada mereka. (Riwayat ini) bercanggah dengan riwayat Ma'mar."
  },
  {
    "id": 18168,
    "hadith_number": 3432,
    "tajuk_hadith": "Menjauhi Isteri Menurut Sabda Rasulullah",
    "perawi_melayu": "Daripada Abdur-Rahman bin Ka'b bin Malik bahawa bapanya berkata:",
    "english_text": "\"The envoy of the Messenger of Allah came to me and said: 'Keep away from your wife.' I said: 'Should I divorce her?' He said: 'No, but do not approach her.'\" And he (the narrator) did not mention (the words): \"Go to your family.\"",
    "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا مُحَمَّدٌ، - وَهُوَ ابْنُ ثَوْرٍ - عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، قَالَ فِي حَدِيثِهِ إِذَا رَسُولٌ مِنَ النَّبِيِّ صلى الله عليه وسلم قَدْ أَتَانِي فَقَالَ اعْتَزِلِ امْرَأَتَكَ ‏.‏ فَقُلْتُ أُطَلِّقُهَا قَالَ لاَ وَلَكِنْ لاَ تَقْرَبْهَا ‏.‏ وَلَمْ يَذْكُرْ فِيهِ الْحَقِي بِأَهْلِكِ ‏.‏",
    "malay_translation": "Seorang utusan daripada Rasulullah SAW datang kepadaku dan berkata: 'Jauhilah isterimu.' Aku bertanya: 'Patutkah aku menceraikannya?' Baginda menjawab: 'Tidak, tetapi janganlah engkau mendekatinya.'  Dan (perawi) tidak menyebut perkataan: 'Pergilah kepada keluargamu.'"
  },
  {
    "id": 18169,
    "hadith_number": 3433,
    "tajuk_hadith": "Talak Selepas Merdeka",
    "perawi_melayu": "Daripada Umar bin Mu'attib bahawa Abu Hasan, hamba sahaya Bani Nawfal, berkata:",
    "english_text": "\"My wife and I were slaves, and I divorced her twice, then we were both set free. I asked Ibn 'Abbas and he said: 'If you take her back, you have two divorces left. This is how the Messenger of Allah ruled.'\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ سَمِعْتُ يَحْيَى، قَالَ حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ، قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ عُمَرَ بْنِ مُعَتِّبٍ، أَنَّ أَبَا حَسَنٍ، مَوْلَى بَنِي نَوْفَلٍ أَخْبَرَهُ قَالَ كُنْتُ أَنَا وَامْرَأَتِي، مَمْلُوكَيْنِ فَطَلَّقْتُهَا تَطْلِيقَتَيْنِ ثُمَّ أُعْتِقْنَا جَمِيعًا فَسَأَلْتُ ابْنَ عَبَّاسٍ فَقَالَ إِنْ رَاجَعْتَهَا كَانَتْ عِنْدَكَ عَلَى وَاحِدَةٍ قَضَى بِذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ خَالَفَهُ مَعْمَرٌ ‏.‏",
    "malay_translation": "Aku dan isteriku adalah hamba sahaya. Aku menceraikannya sebanyak dua kali, kemudian kami berdua dibebaskan. Aku bertanya kepada Ibnu Abbas, lalu beliau berkata: 'Jika engkau rujukinya semula, engkau masih mempunyai dua kali talak lagi. Demikianlah keputusan Rasulullah ﷺ.'"
  },
  {
    "id": 18170,
    "hadith_number": 3434,
    "tajuk_hadith": "Perkahwinan Semula Selepas Talak Dua dan Pembebasan",
    "perawi_melayu": "Daripada Abu Al-Hasan, hamba sahaya yang dimerdekakan daripada Bani Nawfal, berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَنْبَأَنَا مَعْمَرٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عُمَرَ بْنِ مُعَتِّبٍ، عَنِ الْحَسَنِ، مَوْلَى بَنِي نَوْفَلٍ قَالَ سُئِلَ ابْنُ عَبَّاسٍ عَنْ عَبْدٍ طَلَّقَ، امْرَأَتَهُ تَطْلِيقَتَيْنِ ثُمَّ عُتِقَا أَيَتَزَوَّجُهَا قَالَ نَعَمْ ‏.‏ قَالَ عَمَّنْ قَالَ أَفْتَى بِذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ عَبْدُ الرَّزَّاقِ قَالَ ابْنُ الْمُبَارَكِ لِمَعْمَرٍ الْحَسَنُ هَذَا مَنْ هُوَ لَقَدْ حَمَلَ صَخْرَةً عَظِيمَةً ‏.‏",
    "malay_translation": "Kami diberitakan oleh Muhammad bin Rafi', katanya; telah menceritakan kepada kami Abdur Razzaq, katanya; telah memberitakan kepada kami Ma'mar, daripada Yahya bin Abi Katsir, daripada Umar bin Mu'attab, daripada Al-Hasan, hamba sahaya Bani Nawfal, katanya: Ibn Abbas ditanya tentang seorang hamba yang menceraikan isterinya sebanyak dua kali cerai, kemudian mereka dibebaskan, bolehkah dia mengahwininya semula?  Dia menjawab: \"Ya.\"  Ditanya: \"Daripada siapa (anda mendengarnya)?\"  Dia menjawab: \"Rasulullah SAW telah memberi fatwa demikian.\" Abdur Razzaq berkata: Ibn Mubarak berkata kepada Ma'mar: \"Siapakah Al-Hasan ini? Sesungguhnya dia telah memikul beban yang amat berat.\" "
  },
  {
    "id": 18171,
    "hadith_number": 3435,
    "tajuk_hadith": "Nasib Anak-Anak Quraizah pada Hari Quraizah",
    "perawi_melayu": "Daripada Kathir bin As-Sa'ib yang berkata:",
    "english_text": "\"The sons of Quraizah told me that they were presented to the Messenger of Allah on the Day of Quraizah, and whoever (among them) had reached puberty, or had grown pubic hair, was killed, and whoever had not reached puberty and had not grown pubic hair was left (alive).\"",
    "arabic_text": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا أَسَدُ بْنُ مُوسَى، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ أَبِي جَعْفَرٍ الْخَطْمِيِّ، عَنْ عُمَارَةَ بْنِ خُزَيْمَةَ، عَنْ كَثِيرِ بْنِ السَّائِبِ، قَالَ حَدَّثَنِي أَبْنَاءُ، قُرَيْظَةَ أَنَّهُمْ عُرِضُوا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ قُرَيْظَةَ فَمَنْ كَانَ مُحْتَلِمًا أَوْ نَبَتَتْ عَانَتُهُ قُتِلَ وَمَنْ لَمْ يَكُنْ مُحْتَلِمًا أَوْ لَمْ تَنْبُتْ عَانَتُهُ تُرِكَ ‏.‏",
    "malay_translation": "Anak-anak Quraizah memberitahu saya bahawa mereka dihadapkan kepada Rasulullah SAW pada Hari Quraizah. Sesiapa di kalangan mereka yang telah baligh atau telah tumbuh bulu kemaluannya telah dibunuh, dan sesiapa yang belum baligh dan belum tumbuh bulu kemaluannya telah dibiarkan hidup."
  },
  {
    "id": 18172,
    "hadith_number": 3436,
    "tajuk_hadith": "Kisah Atiyyah Al-Qurazi Semasa Hukuman Bani Quraizah",
    "perawi_melayu": "Daripada Atiyyah Al-Qurazi berkata:",
    "english_text": "\"On the day that Sa'd passed judgment on Banu Quraizah I was a young boy and they were not sure about me, but they did not find any pubic hair, so they let me live, and here I am among you.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ عَطِيَّةَ الْقُرَظِيِّ، قَالَ كُنْتُ يَوْمَ حُكْمِ سَعْدٍ فِي بَنِي قُرَيْظَةَ غُلاَمًا فَشَكُّوا فِيَّ فَلَمْ يَجِدُونِي أَنْبَتُّ فَاسْتُبْقِيتُ فَهَا أَنَا ذَا بَيْنَ أَظْهُرِكُمْ ‏.‏",
    "malay_translation": "Aku (Atiyyah Al-Qurazi) berkata: Pada hari Saad membuat keputusan terhadap Bani Quraizah, aku masih kanak-kanak. Mereka ragu-ragu tentang aku, lalu mereka mendapati aku belum baligh (belum tumbuh bulu kemaluan). Oleh itu, aku dibiarkan hidup, dan sekarang aku berada di tengah-tengah kamu."
  },
  {
    "id": 18173,
    "hadith_number": 3437,
    "tajuk_hadith": "Ibn Umar dan Penglibatan dalam Perang Uhud dan Al-Khandaq",
    "perawi_melayu": "Daripada Ibnu Umar",
    "english_text": "It was narrated from Ibn 'Umar that he presented himself to the Messenger of Allah on the Day of Uhud when he was fourteen years old, but he did not permit him (to join the army). He presented himself on the Day of Al-Khandaq when he was fifteen years old, and he permitted him (to join the army).",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم عَرَضَهُ يَوْمَ أُحُدٍ وَهُوَ ابْنُ أَرْبَعَ عَشْرَةَ سَنَةً فَلَمْ يُجِزْهُ وَعَرَضَهُ يَوْمَ الْخَنْدَقِ وَهُوَ ابْنُ خَمْسَ عَشْرَةَ سَنَةً فَأَجَازَهُ ‏.‏",
    "malay_translation": "Daripada Ibnu Umar, bahawa beliau telah menghadap Rasulullah SAW pada hari Perang Uhud ketika berusia empat belas tahun, tetapi baginda tidak membenarkannya (untuk menyertai tentera).  Beliau kemudian menghadap baginda lagi pada hari Perang Al-Khandaq ketika berusia lima belas tahun, dan baginda membenarkannya (untuk menyertai tentera)."
  },
  {
    "id": 18174,
    "hadith_number": 3438,
    "tajuk_hadith": "Pena Diangkat Daripada Tiga Golongan",
    "perawi_melayu": "Daripada Aisyah r.a., bahawa Nabi SAW bersabda:",
    "english_text": "\"The pen has been lifted from three: From the sleeper until he wakes up, from the minor until he grows up, and from the insane until he comes back to his senses or recovers.\"",
    "arabic_text": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ حَمَّادٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ رُفِعَ الْقَلَمُ عَنْ ثَلاَثٍ عَنِ النَّائِمِ حَتَّى يَسْتَيْقِظَ وَعَنِ الصَّغِيرِ حَتَّى يَكْبُرَ وَعَنِ الْمَجْنُونِ حَتَّى يَعْقِلَ أَوْ يَفِيقَ ‏\"‏ ‏.‏",
    "malay_translation": "Pena telah diangkat daripada tiga golongan: daripada orang yang tidur sehingga dia bangun, daripada kanak-kanak sehingga dia dewasa, dan daripada orang gila sehingga dia sembuh akal fikirannya."
  },
  {
    "id": 18175,
    "hadith_number": 3439,
    "tajuk_hadith": "Pengampunan Allah SWT terhadap Dosa Hati Umat",
    "perawi_melayu": "Daripada Abu Hurairah,  -(salah seorang perawi) Abdur-Rahman berkata:",
    "english_text": "\"The Messenger of Allah -said: 'Allah, the Most High, has forgiven my Ummah for everything that enters the mind, so long as it is not spoken of or put into action.'\"",
    "arabic_text": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ، وَعَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلاَّمٍ، قَالاَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم - قَالَ عَبْدُ الرَّحْمَنِ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم - قَالَ ‏\n\"‏ إِنَّ اللَّهَ تَعَالَى تَجَاوَزَ عَنْ أُمَّتِي كُلَّ شَىْءٍ حَدَّثَتْ بِهِ أَنْفُسَهَا مَا لَمْ تَكَلَّمْ بِهِ أَوْ تَعْمَلْ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  “Sesungguhnya Allah SWT telah mengampunkan umatku segala sesuatu yang terlintas di hati mereka, selagi mereka tidak menyebutkannya atau melakukannya.”"
  },
  {
    "id": 18176,
    "hadith_number": 3440,
    "tajuk_hadith": "Pengampunan Allah SWT terhadap bisikan dan fikiran umat",
    "perawi_melayu": "Daripada Abu Hurairah, katanya:",
    "english_text": "\"The Messenger of Allah said: 'Allah, the Mighty and Sublime, has forgiven my Ummah for what is whispered to them or what enters their minds, so long as they do not act upon it or speak of it.'\"",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا ابْنُ إِدْرِيسَ، عَنْ مِسْعَرٍ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ تَجَاوَزَ لأُمَّتِي مَا وَسْوَسَتْ بِهِ وَحَدَّثَتْ بِهِ أَنْفُسَهَا مَا لَمْ تَعْمَلْ أَوْ تَتَكَلَّمْ بِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Sesungguhnya Allah SWT telah memaafkan umatku akan bisikan-bisikan dan apa yang terlintas di hati mereka, selagi mereka tidak mengamalkannya atau menyebutkannya.\""
  },
  {
    "id": 18177,
    "hadith_number": 3441,
    "tajuk_hadith": "Pengampunan Allah SWT terhadap Dosa Hati Umat",
    "perawi_melayu": "Dari Abu Hurairah, bahawa Nabi SAW bersabda:",
    "english_text": "\"Allah, the Most High, has forgiven my Ummah for whatever enters the mind, so long as it is not spoken of or put into action.\"",
    "arabic_text": "أَخْبَرَنِي مُوسَى بْنُ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا حُسَيْنٌ الْجُعْفِيُّ، عَنْ زَائِدَةَ، عَنْ شَيْبَانَ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ اللَّهَ تَعَالَى تَجَاوَزَ لأُمَّتِي عَمَّا حَدَّثَتْ بِهِ أَنْفُسَهَا مَا لَمْ تَكَلَّمْ أَوْ تَعْمَلْ بِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Sesungguhnya Allah SWT telah mengampunkan umatku akan apa sahaja yang terlintas di hati mereka, selagi ia tidak diucapkan atau dipraktikkan."
  },
  {
    "id": 18178,
    "hadith_number": 3442,
    "tajuk_hadith": "Jiran Persia dan Rasulullah",
    "perawi_melayu": "Dari Anas r.a.",
    "english_text": "\"The Messenger of Allah had a Persian neighbor who was good at making soup. He came to the Messenger of Allah one day when 'Aishah was with him, and gestured to him with his hand to come. The Messenger of Allah gestured toward 'Aishah -meaning: 'What about her?'- and the man gestured to him like this, meaning, 'No,' two or three times.\"",
    "arabic_text": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ نَافِعٍ، قَالَ حَدَّثَنَا بَهْزٌ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، قَالَ كَانَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم جَارٌ فَارِسِيٌّ طَيِّبُ الْمَرَقَةِ فَأَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ وَعِنْدَهُ عَائِشَةُ فَأَوْمَأَ إِلَيْهِ بِيَدِهِ أَنْ تَعَالَ وَأَوْمَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى عَائِشَةَ أَىْ وَهَذِهِ فَأَوْمَأَ إِلَيْهِ الآخَرُ هَكَذَا بِيَدِهِ أَنْ لاَ مَرَّتَيْنِ أَوْ ثَلاَثًا ‏.‏",
    "malay_translation": "Rasulullah SAW mempunyai seorang jiran orang Persia yang mahir membuat sup.  Pada suatu hari, jiran itu datang kepada Rasulullah SAW ketika Aisyah berada di sisi baginda. Jiran itu memberi isyarat dengan tangannya supaya baginda datang. Rasulullah SAW pula memberi isyarat ke arah Aisyah – maksudnya: ‘Bagaimana pula dengannya?’ – dan lelaki itu memberi isyarat kepadanya begini, maksudnya ‘Tidak’, dua atau tiga kali."
  },
  {
    "id": 18179,
    "hadith_number": 3443,
    "tajuk_hadith": "Niat dalam Amalan",
    "perawi_melayu": "Daripada Umar bin al-Khattab r.a., bahawa Rasulullah s.a.w. bersabda:",
    "english_text": "\"Actions are but by intentions, and each man will have but that which he intended. Whoever emigrated for the sake of Allah and His Messenger, his emigration was for the sake of Allah and His Messenger, and whoever emigrated for the sake of some worldly gain or to marry some woman, his emigration was for that for which he emigrated.\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، قَالَ حَدَّثَنَا مَالِكٌ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ الْقَاسِمِ، قَالَ أَخْبَرَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ بْنِ وَقَّاصٍ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، رضى الله عنه - وَفِي حَدِيثِ الْحَارِثِ أَنَّهُ سَمِعَ عُمَرَ يَقُولُ - قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّمَا الأَعْمَالُ بِالنِّيَّةِ وَإِنَّمَا لاِمْرِئٍ مَا نَوَى فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا أَوِ امْرَأَةٍ يَتَزَوَّجُهَا فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ ‏\"‏ ‏.‏",
    "malay_translation": "Sesungguhnya amalan-amalan itu bergantung kepada niat, dan seseorang itu hanya mendapat apa yang diniatkannya. Barangsiapa yang berhijrah kerana Allah dan Rasul-Nya, maka hijrahnya itu adalah kerana Allah dan Rasul-Nya. Dan barangsiapa yang berhijrah kerana sesuatu keuntungan duniawi atau untuk mengahwini seorang wanita, maka hijrahnya itu adalah kerana apa yang diniatkannya."
  },
  {
    "id": 18180,
    "hadith_number": 3444,
    "tajuk_hadith": "Allah Melindungi Rasulullah daripada Kecaman Quraisy",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Look at how Allah diverts the insults and curses of Quraish from me. They insult 'Mudhammam' and curse 'Mudhammam' -but I am Muhammad.\"",
    "arabic_text": "أَخْبَرَنَا عِمْرَانُ بْنُ بَكَّارٍ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ، قَالَ حَدَّثَنِي شُعَيْبٌ، قَالَ حَدَّثَنِي أَبُو الزِّنَادِ، مِمَّا حَدَّثَهُ عَبْدُ الرَّحْمَنِ الأَعْرَجُ، مِمَّا ذَكَرَ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ قَالَ ‏\n\"‏ انْظُرُوا كَيْفَ يَصْرِفُ اللَّهُ عَنِّي شَتْمَ قُرَيْشٍ وَلَعْنَهُمْ إِنَّهُمْ يَشْتِمُونَ مُذَمَّمًا وَيَلْعَنُونَ مُذَمَّمًا وَأَنَا مُحَمَّدٌ ‏\"‏ ‏.‏",
    "malay_translation": "Lihatlah bagaimana Allah menolak cercaan dan laknat kaum Quraisy daripada diriku. Mereka mencerca Mudhammam dan melaknat Mudhammam, sedangkan aku Muhammad."
  },
  {
    "id": 18181,
    "hadith_number": 3445,
    "tajuk_hadith": "Pilihan Isteri-isteri Nabi SAW",
    "perawi_melayu": "Daripada Aisyah, isteri Nabi SAW, diriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَنْبَأَنَا يُونُسُ بْنُ يَزِيدَ، وَمُوسَى بْنُ عُلَىٍّ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ لَمَّا أُمِرَ رَسُولُ اللَّهِ بِتَخْيِيرِ أَزْوَاجِهِ بَدَأَ بِي فَقَالَ ‏\"‏ إِنِّي ذَاكِرٌ لَكِ أَمْرًا فَلاَ عَلَيْكِ أَنْ لاَ تُعَجِّلِي حَتَّى تَسْتَأْمِرِي أَبَوَيْكِ ‏\"‏ ‏.‏ قَالَتْ قَدْ عَلِمَ أَنَّ أَبَوَاىَ لَمْ يَكُونَا لِيَأْمُرَانِّي بِفِرَاقِهِ - قَالَتْ - ثُمَّ تَلاَ هَذِهِ الآيَةَ ‏{‏ يَا أَيُّهَا النَّبِيُّ قُلْ لأَزْوَاجِكَ إِنْ كُنْتُنَّ تُرِدْنَ الْحَيَاةَ الدُّنْيَا ‏}‏ إِلَى قَوْلِهِ ‏{‏ جَمِيلاً ‏}‏ فَقُلْتُ أَفِي هَذَا أَسْتَأْمِرُ أَبَوَىَّ فَإِنِّي أُرِيدُ اللَّهَ عَزَّ وَجَلَّ وَرَسُولَهُ وَالدَّارَ الآخِرَةَ - قَالَتْ عَائِشَةُ - ثُمَّ فَعَلَ أَزْوَاجُ النَّبِيِّ صلى الله عليه وسلم مِثْلَ مَا فَعَلْتُ وَلَمْ يَكُنْ ذَلِكَ حِينَ قَالَ لَهُنَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَاخْتَرْنَهُ طَلاَقًا مِنْ أَجْلِ أَنَّهُنَّ اخْتَرْنَهُ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Yunus bin Abdil A'la, dia berkata; telah menceritakan kepada kami Ibnu Wahb, dia berkata; telah memberitakan kepada kami Yunus bin Yazid dan Musa bin 'Ulai, daripada Ibnu Syihab, dia berkata; telah memberitakan kepadaku Abu Salamah bin Abdurrahman bahawa Aisyah, isteri Nabi SAW berkata: \"Apabila Rasulullah SAW diperintahkan untuk memberi pilihan kepada isteri-isterinya, baginda bermula dengan aku, lalu baginda bersabda: \"Sesungguhnya aku akan menyebut sesuatu kepadamu, maka janganlah engkau tergesa-gesa sehingga engkau bermusyawarah dengan kedua orang tuamu.\" Aku berkata: \"Baginda mengetahui bahawa kedua orang tuaku tidak akan menyuruh aku untuk meninggalkannya.\" Kemudian baginda membaca ayat ini: {Wahai Nabi, katakanlah kepada isteri-isterimu: Jika kamu menginginkan kehidupan dunia dan perhiasannya, maka datanglah, aku akan memberi nafkah kepadamu dan melepaskan kamu dengan cara yang baik.} Sehingga firman Allah SWT: {dengan cara yang baik}. Maka aku berkata: \"Adakah dalam perkara ini aku perlu bermusyawarah dengan kedua orang tuaku? Sesungguhnya aku menginginkan Allah SWT, Rasul-Nya dan rumah akhirat.\" Aisyah berkata: Kemudian isteri-isteri Nabi SAW melakukan seperti yang kulakukan, dan hal itu bukanlah talak ketika Rasulullah SAW memberi pilihan kepada mereka dan mereka memilih baginda."
  },
  {
    "id": 18182,
    "hadith_number": 3446,
    "tajuk_hadith": "Aisyah r.a. dan Pilihan Antara Dunia dan Akhirat",
    "perawi_melayu": "Daripada Aisyah r.a.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ ثَوْرٍ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا نَزَلَتْ ‏{‏ إِنْ كُنْتُنَّ تُرِدْنَ اللَّهَ وَرَسُولَهُ ‏}‏ دَخَلَ عَلَىَّ النَّبِيُّ صلى الله عليه وسلم بَدَأَ بِي فَقَالَ ‏\"‏ يَا عَائِشَةُ إِنِّي ذَاكِرٌ لَكِ أَمْرًا فَلاَ عَلَيْكِ أَنْ لاَ تُعَجِّلِي حَتَّى تَسْتَأْمِرِي أَبَوَيْكِ ‏\"‏ ‏.‏ قَالَتْ قَدْ عَلِمَ وَاللَّهِ أَنَّ أَبَوَىَّ لَمْ يَكُونَا لِيَأْمُرَانِّي بِفِرَاقِهِ فَقَرَأَ عَلَىَّ ‏{‏ يَا أَيُّهَا النَّبِيُّ قُلْ لأَزْوَاجِكَ إِنْ كُنْتُنَّ تُرِدْنَ الْحَيَاةَ الدُّنْيَا وَزِينَتَهَا ‏}‏ فَقُلْتُ أَفِي هَذَا أَسْتَأْمِرُ أَبَوَىَّ فَإِنِّي أُرِيدُ اللَّهَ وَرَسُولَهُ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا خَطَأٌ وَالأَوَّلُ أَوْلَى بِالصَّوَابِ وَاللَّهُ سُبْحَانَهُ وَتَعَالَى أَعْلَمُ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Abdul A'la, dia berkata; telah menceritakan kepada kami Muhammad bin Tsawr, dari Ma'mar, dari Az Zuhri, dari Urwah, dari Aisyah r.a., dia berkata; \"Apabila turun ayat: {In kuntunna turridna Allaha wa rasuluh}, Nabi SAW datang kepada aku dan mula-mula bercakap denganku. Baginda berkata: \"Wahai Aisyah, sesungguhnya aku akan memberitahu engkau sesuatu perkara, maka janganlah engkau terburu-buru sehingga engkau meminta nasihat daripada ibu bapa engkau.\" Aku berkata: \"Demi Allah, baginda telah mengetahui bahawa ibu bapaku tidak akan menyuruh aku berpisah dengan baginda.\" Kemudian baginda membaca kepadaku: {Ya ayyuhan nabi qul li azwajika in kuntunna turridna al-hayata ad-dunya wa zinat-ha}. Maka aku berkata: \"Apakah dalam hal ini aku perlu meminta nasihat daripada ibu bapaku? Kerana sesungguhnya aku mengingini Allah dan Rasul-Nya.\" Abu Abdur Rahman berkata: \"Ini adalah satu kesalahan dan yang pertama lebih hampir kepada kebenaran dan Allah SWT lebih mengetahui.\""
  },
  {
    "id": 18183,
    "hadith_number": 3447,
    "tajuk_hadith": "Pilihan Aisyah dan Rasulullah",
    "perawi_melayu": "Daripada Aisyah, beliau berkata:",
    "english_text": "\"The Messenger of Allah gave us the choice and we chose him; was that a divorce?\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، - هُوَ ابْنُ سَعِيدٍ - عَنْ إِسْمَاعِيلَ، عَنْ عَامِرٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ خَيَّرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَاخْتَرْنَاهُ فَهَلْ كَانَ طَلاَقًا",
    "malay_translation": "Rasulullah SAW memberi pilihan kepada kami dan kami memilih baginda. Adakah itu termasuk talak?"
  },
  {
    "id": 18184,
    "hadith_number": 3448,
    "tajuk_hadith": "Rasulullah SAW Memberi Pilihan kepada Isteri-isteri Baginda",
    "perawi_melayu": "Daripada Aisyah R.A., Baginda berkata:",
    "english_text": "\"The Messenger of Allah gave his wives the choice but that was not a divorce.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَاصِمٍ، قَالَ قَالَ الشَّعْبِيُّ عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ قَدْ خَيَّرَ رَسُولُ اللَّهِ صلى الله عليه وسلم نِسَاءَهُ فَلَمْ يَكُنْ طَلاَقًا ‏.‏",
    "malay_translation": "Daripada Aisyah R.A. bahawa Rasulullah SAW telah memberi pilihan kepada isteri-isteri baginda, tetapi ia bukanlah talak (cerai)."
  },
  {
    "id": 18185,
    "hadith_number": 3449,
    "tajuk_hadith": "Pilihan Nabi SAW Kepada Isteri-isterinya Bukan Talak",
    "perawi_melayu": "Dari Masruq, daripada Aisyah r.a. berkata:",
    "english_text": "\"The Prophet gave his wives the choice and that was not a divorce.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ بْنِ صُدْرَانَ، عَنْ خَالِدِ بْنِ الْحَارِثِ، قَالَ حَدَّثَنَا أَشْعَثُ، - وَهُوَ ابْنُ عَبْدِ الْمَلِكِ - عَنْ عَاصِمٍ، عَنِ الشَّعْبِيِّ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ قَدْ خَيَّرَ النَّبِيُّ صلى الله عليه وسلم نِسَاءَهُ فَلَمْ يَكُنْ طَلاَقًا ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Ibrahim bin Sudran, dari Khalid bin Harits, katanya; telah menceritakan kepada kami As'ats - iaitu anak Abd Malik - dari 'Asim, dari Asy-Sya'bi, dari Masruq, dari Aisyah r.a., dia berkata: \"Sesungguhnya Nabi SAW telah memberi pilihan kepada isteri-isterinya, dan ia bukanlah talak.\""
  },
  {
    "id": 18186,
    "hadith_number": 3450,
    "tajuk_hadith": "Pilihan Rasulullah SAW Kepada Isteri-isteri Baginda",
    "perawi_melayu": "Daripada Aisyah r.a. diriwayatkan bahawa:",
    "english_text": "\"The Messenger of Allah gave his wives the choice; was that a divorce?\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ قَدْ خَيَّرَ رَسُولُ اللَّهِ صلى الله عليه وسلم نِسَاءَهُ أَفَكَانَ طَلاَقًا ‏.‏",
    "malay_translation": "Aisyah r.a. berkata: Rasulullah SAW telah memberi pilihan kepada isteri-isteri baginda. Adakah itu termasuk talak (perceraian)?"
  },
  {
    "id": 18187,
    "hadith_number": 3451,
    "tajuk_hadith": "Pilihan Bebas dan Pilihan Sahabat",
    "perawi_melayu": "Daripada Aisyah r.a.",
    "english_text": "\"The Messenger of Allah gave us the choice and we chose him, and that was not counted as anything.\"",
    "arabic_text": "أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الضَّعِيفُ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، قَالَ حَدَّثَنَا الأَعْمَشُ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ خَيَّرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَاخْتَرْنَاهُ فَلَمْ يَعُدَّهَا عَلَيْنَا شَيْئًا ‏.‏",
    "malay_translation": "Rasulullah SAW memberi pilihan kepada kami dan kami memilih baginda, dan ia tidak dikira sebagai sesuatu pun."
  },
  {
    "id": 18188,
    "hadith_number": 3452,
    "tajuk_hadith": "Membebaskan Hamba Lelaki Terlebih Dahulu",
    "perawi_melayu": "Daripada al-Qasim bin Muhammad, katanya:",
    "english_text": "\"Aishah had a male slave and a female slave. She said: 'I wanted to set them free, and I mentioned that to the Messenger of Allah. He said: Start with the male slave before the female slave.'\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ، قَالَ حَدَّثَنَا ابْنُ مَوْهَبٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، قَالَ كَانَ لِعَائِشَةَ غُلاَمٌ وَجَارِيَةٌ قَالَتْ فَأَرَدْتُ أَنْ أُعْتِقَهُمَا فَذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ ابْدَئِي بِالْغُلاَمِ قَبْلَ الْجَارِيَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Aisyah mempunyai seorang hamba lelaki dan seorang hamba perempuan.  Beliau berkata: 'Saya ingin membebaskan mereka, lalu saya menceritakan hal itu kepada Rasulullah ﷺ. Baginda bersabda: Mulakan dengan hamba lelaki sebelum hamba perempuan.'"
  },
  {
    "id": 18189,
    "hadith_number": 3453,
    "tajuk_hadith": "Tiga Sunnah Berkaitan Barirah",
    "perawi_melayu": "Daripada Aisyah, isteri Nabi SAW.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ أَنْبَأَنَا ابْنُ الْقَاسِمِ، عَنْ مَالِكٍ، عَنْ رَبِيعَةَ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ كَانَ فِي بَرِيرَةَ ثَلاَثُ سُنَنٍ إِحْدَى السُّنَنِ أَنَّهَا أُعْتِقَتْ فَخُيِّرَتْ فِي زَوْجِهَا وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏ ‏.‏ وَدَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالْبُرْمَةُ تَفُورُ بِلَحْمٍ فَقُرِّبَ إِلَيْهِ خُبْزٌ وَأُدْمٌ مِنْ أُدْمِ الْبَيْتِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَلَمْ أَرَ بُرْمَةً فِيهَا لَحْمٌ ‏\"‏ ‏.‏ فَقَالُوا بَلَى يَا رَسُولَ اللَّهِ ذَلِكَ لَحْمٌ تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ وَأَنْتَ لاَ تَأْكُلُ الصَّدَقَةَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هُوَ عَلَيْهَا صَدَقَةٌ وَهُوَ لَنَا هَدِيَّةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Aisyah, isteri Nabi SAW, berkata: “Terdapat tiga sunnah yang berkaitan dengan Barirah. Salah satu sunnah tersebut ialah beliau dibebaskan dan diberi pilihan mengenai suaminya. Rasulullah SAW bersabda:  ‘Hak pengurusan (wala’) adalah bagi orang yang membebaskan hamba.’  Dan Rasulullah SAW masuk ketika periuk berisi daging sedang dimasak. Kemudian roti dan beberapa jenis makanan sampingan dihidangkan kepada baginda. Rasulullah SAW bertanya: ‘Bukankah aku melihat periuk yang berisi daging?’ Mereka menjawab: ‘Ya, wahai Rasulullah, itu adalah daging sedekah untuk Barirah dan tuan tidak makan sedekah.’ Rasulullah SAW bersabda: ‘Ia adalah sedekah baginya dan hadiah untuk kita.’"
  },
  {
    "id": 18190,
    "hadith_number": 3454,
    "tajuk_hadith": "Hukum Membeli dan Memerdekakan Hamba Sahaya",
    "perawi_melayu": "Daripada Aisyah r.a.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ آدَمَ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ هِشَامٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ فِي بَرِيرَةَ ثَلاَثُ قَضِيَّاتٍ أَرَادَ أَهْلُهَا أَنْ يَبِيعُوهَا وَيَشْتَرِطُوا الْوَلاَءَ فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ اشْتَرِيهَا وَأَعْتِقِيهَا فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏ ‏.‏ وَأُعْتِقَتْ فَخَيَّرَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَاخْتَارَتْ نَفْسَهَا وَكَانَ يُتَصَدَّقُ عَلَيْهَا فَتُهْدِي لَنَا مِنْهُ فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ كُلُوهُ فَإِنَّهُ عَلَيْهَا صَدَقَةٌ وَهُوَ لَنَا هَدِيَّةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Aku diberitahu oleh Muhammad bin Adam, katanya; telah menceritakan kepada kami Abu Muawiyah, daripada Hisyam, daripada Abdur Rahman bin Al-Qasim, daripada bapanya, daripada Aisyah r.a., katanya: “Terdapat tiga perkara hukum berkaitan Barirah. Tuanya ingin menjualnya dan mensyaratkan hak wali tetap kepada mereka. Maka aku ceritakan hal itu kepada Nabi SAW, lalu Baginda bersabda: “Belilah dan bebaskanlah dia, kerana hak wali adalah bagi orang yang memerdekakan.” Maka dia dibebaskan. Kemudian Rasulullah SAW memberi pilihan kepadanya, lalu dia memilih dirinya sendiri. Dan dia selalu diberikan sedekah, lalu dia menghadiahkan sebahagian daripadanya kepada kami. Maka aku ceritakan hal itu kepada Nabi SAW, lalu Baginda bersabda: “Makanlah, kerana ia adalah sedekah untuknya dan hadiah untuk kita.”"
  },
  {
    "id": 18191,
    "hadith_number": 3455,
    "tajuk_hadith": "Membebaskan Barirah dan Pilihannya",
    "perawi_melayu": "Daripada Aisyah r.a.",
    "english_text": "\"I bought Barirah and her masters stipulated that her Wala' should go to them. I mentioned that to the Prophet and he said: 'Set her free, and Al-Wala' is to the one who pays the silver.' So I set her free and the Messenger of Allah called her and gave her the choice concerning her husband. She said: 'Even if you gave me such and such, I would not stay with him,' so she chose herself and her husband was a free man.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتِ اشْتَرَيْتُ بَرِيرَةَ فَاشْتَرَطَ أَهْلُهَا وَلاَءَهَا فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ أَعْتِقِيهَا فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْطَى الْوَرِقَ ‏\"‏ ‏.‏ قَالَتْ فَأَعْتَقْتُهَا فَدَعَاهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَخَيَّرَهَا مِنْ زَوْجِهَا قَالَتْ لَوْ أَعْطَانِي كَذَا وَكَذَا مَا أَقَمْتُ عِنْدَهُ ‏.‏ فَاخْتَارَتْ نَفْسَهَا وَكَانَ زَوْجُهَا حُرًّا ‏.‏",
    "malay_translation": "Aku membeli Barirah, dan tuannya mensyaratkan bahawa kesetiaan (wala') kepadanya adalah kepada mereka. Aku menceritakan hal itu kepada Nabi SAW, lalu baginda bersabda: \"Bebaskanlah dia, kerana kesetiaan itu adalah untuk orang yang membayar tebusannya.\" Maka aku membebaskannya. Kemudian Rasulullah SAW memanggilnya dan memberi pilihan kepadanya tentang suaminya. Barirah berkata: \"Sekalipun diberikan kepadaku harta yang banyak, aku tetap tidak akan tinggal bersamanya.\" Maka dia memilih untuk tidak tinggal bersama suaminya, dan suaminya adalah seorang yang merdeka."
  },
  {
    "id": 18192,
    "hadith_number": 3456,
    "tajuk_hadith": "Membeli dan Memerdekakan Barirah",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، عَنْ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، أَنَّهَا أَرَادَتْ أَنْ تَشْتَرِيَ، بَرِيرَةَ فَاشْتَرَطُوا وَلاَءَهَا فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ اشْتَرِيهَا وَأَعْتِقِيهَا فَإِنَّ الْوَلاَءَ لِمَنْ أَعْتَقَ ‏\"‏ ‏.‏ وَأُتِيَ بِلَحْمٍ فَقِيلَ إِنَّ هَذَا مِمَّا تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ ‏.‏ فَقَالَ ‏\"‏ هُوَ لَهَا صَدَقَةٌ وَلَنَا هَدِيَّةٌ ‏\"‏ ‏.‏ وَخَيَّرَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَكَانَ زَوْجُهَا حُرًّا ‏.‏",
    "malay_translation": "Kami diberitakan oleh Amru bin Ali, daripada Abdul Rahman, katanya: telah menceritakan kepada kami Syu’bah, daripada Al-Hakam, daripada Ibrahim, daripada Aswad, daripada Aisyah, bahawa beliau ingin membeli Barirah, maka mereka mensyaratkan kesetiaannya (wala’). Maka aku menceritakan hal itu kepada Nabi SAW, lalu baginda bersabda: \"Belilah dia dan bebaskanlah dia, kerana kesetiaan (wala’) adalah bagi orang yang memerdekakan.\"  Dan didatangkan daging, lalu dikatakan: \"Ini sebahagian daripada sedekah untuk Barirah.\" Maka baginda bersabda: \"Ia adalah sedekah untuknya dan hadiah untuk kita.\" Dan Rasulullah SAW memberi pilihan kepadanya, dan suaminya adalah seorang yang merdeka."
  },
  {
    "id": 18193,
    "hadith_number": 3457,
    "tajuk_hadith": "Hukum Syarat Bebas Hamba dan Wali",
    "perawi_melayu": "Daripada Aisyah r.a.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا جَرِيرٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَاتَبَتْ بَرِيرَةُ عَلَى نَفْسِهَا بِتِسْعِ أَوَاقٍ فِي كُلِّ سَنَةٍ بِأُوقِيَّةٍ فَأَتَتْ عَائِشَةَ تَسْتَعِينُهَا فَقَالَتْ لاَ إِلاَّ أَنْ يَشَاءُوا أَنْ أَعُدَّهَا لَهُمْ عَدَّةً وَاحِدَةً وَيَكُونُ الْوَلاَءُ لِي ‏.‏ فَذَهَبَتْ بَرِيرَةُ فَكَلَّمَتْ فِي ذَلِكَ أَهْلَهَا فَأَبَوْا عَلَيْهَا إِلاَّ أَنْ يَكُونَ الْوَلاَءُ لَهُمْ فَجَاءَتْ إِلَى عَائِشَةَ وَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم عِنْدَ ذَلِكَ فَقَالَتْ لَهَا مَا قَالَ أَهْلُهَا فَقَالَتْ لاَهَا اللَّهِ إِذًا إِلاَّ أَنْ يَكُونَ الْوَلاَءُ لِي ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا هَذَا ‏\"‏ ‏.‏ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ بَرِيرَةَ أَتَتْنِي تَسْتَعِينُ بِي عَلَى كِتَابَتِهَا فَقُلْتُ لاَ إِلاَّ أَنْ يَشَاءُوا أَنْ أَعُدَّهَا لَهُمْ عَدَّةً وَاحِدَةً وَيَكُونُ الْوَلاَءُ لِي فَذَكَرَتْ ذَلِكَ لأَهْلِهَا فَأَبَوْا عَلَيْهَا إِلاَّ أَنْ يَكُونَ الْوَلاَءُ لَهُمْ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ابْتَاعِيهَا وَاشْتَرِطِي لَهُمُ الْوَلاَءَ فَإِنَّ الْوَلاَءَ لِمَنْ أَعْتَقَ ‏\"‏ ‏.‏ ثُمَّ قَامَ فَخَطَبَ النَّاسَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏\"‏ مَا بَالُ أَقْوَامٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ عَزَّ وَجَلَّ يَقُولُونَ أَعْتِقْ فُلاَنًا وَالْوَلاَءُ لِي كِتَابُ اللَّهِ عَزَّ وَجَلَّ أَحَقُّ وَشَرْطُ اللَّهِ أَوْثَقُ وَكُلُّ شَرْطٍ لَيْسَ فِي كِتَابِ اللَّهِ فَهُوَ بَاطِلٌ وَإِنْ كَانَ مِائَةَ شَرْطٍ ‏\"‏ ‏.‏ فَخَيَّرَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ زَوْجِهَا وَكَانَ عَبْدًا فَاخْتَارَتْ نَفْسَهَا ‏.‏ قَالَ عُرْوَةُ فَلَوْ كَانَ حُرًّا مَا خَيَّرَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Barirah telah membuat perjanjian untuk membebaskan dirinya dengan bayaran sembilan awaq, satu uqiyyah setiap tahun. Dia datang kepada Aisyah untuk meminta bantuan, lalu Aisyah berkata, \"Tidak, kecuali jika mereka bersetuju untuk menerima jumlah tersebut sekaligus, dan  wala' (hak pengurusan harta pusaka) menjadi milikku.\" Barirah pergi dan bercakap dengan tuannya, tetapi mereka menegaskan bahawa wala' harus menjadi milik mereka.  Dia kembali kepada Aisyah dan ketika itu Rasulullah SAW tiba. Aisyah menceritakan apa yang dikatakan oleh tuan Barirah. Aisyah berkata, \"Demi Allah, tidak, melainkan jika wala' menjadi milikku.\" Rasulullah SAW bertanya, \"Apakah ini?\" Aisyah menjawab, \"Wahai Rasulullah, Barirah datang kepada saya meminta bantuan untuk perjanjian pembebasannya, dan saya berkata tidak, melainkan jika mereka bersetuju untuk membayar sekaligus dan wala' menjadi milik saya. Dia memberitahu tuannya, tetapi mereka tetap mahu wala' menjadi milik mereka.\" Rasulullah SAW bersabda, \"Belilah dia dan tetapkan syarat bahawa wala' adalah untuk orang yang membebaskannya.\" Kemudian baginda berdiri dan berkhutbah kepada manusia seraya memuji Allah SWT dan bersabda, \"Apakah keadaan orang-orang yang menetapkan syarat yang tidak terdapat dalam Kitabullah SWT? Mereka berkata, 'Saya membebaskan fulan, tetapi wala' menjadi milik saya.' Kitabullah SWT adalah lebih berhak, dan syarat Allah SWT adalah lebih kuat. Setiap syarat yang tidak terdapat dalam Kitabullah SWT adalah batal, walaupun seratus syarat.\" Kemudian Rasulullah SAW memberi pilihan kepada Barirah mengenai suaminya yang masih hamba, lalu Barirah memilih untuk dirinya sendiri. Urwah berkata, \"Sekiranya suaminya seorang yang merdeka, Rasulullah SAW tidak akan memberi pilihan kepadanya.\""
  },
  {
    "id": 18194,
    "hadith_number": 3458,
    "tajuk_hadith": "Suami Barirah Seorang Hamba",
    "perawi_melayu": "Daripada Aisyah r.a. diriwayatkan bahawa:",
    "english_text": "\"The husband of Barirah was a slave.\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا الْمُغِيرَةُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنَا وُهَيْبٌ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ يَزِيدَ بْنِ رُومَانَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، رضى الله عنها قَالَتْ كَانَ زَوْجُ بَرِيرَةَ عَبْدًا ‏.‏",
    "malay_translation": "Aisyah r.a. berkata: \"Suami Barirah adalah seorang hamba.\""
  },
  {
    "id": 18195,
    "hadith_number": 3459,
    "tajuk_hadith": "Hak Wali dan Sedekah",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ، قَالَ حَدَّثَنَا حُسَيْنٌ، عَنْ زَائِدَةَ، عَنْ سِمَاكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا اشْتَرَتْ بَرِيرَةَ مِنْ أُنَاسٍ مِنَ الأَنْصَارِ فَاشْتَرَطُوا الْوَلاَءَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْوَلاَءُ لِمَنْ وَلِيَ النِّعْمَةَ ‏\"‏ ‏.‏ وَخَيَّرَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَكَانَ زَوْجُهَا عَبْدًا وَأَهْدَتْ لِعَائِشَةَ لَحْمًا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ وَضَعْتُمْ لَنَا مِنْ هَذَا اللَّحْمِ ‏\"‏ ‏.‏ قَالَتْ عَائِشَةُ تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ ‏.‏ فَقَالَ ‏\"‏ هُوَ عَلَيْهَا صَدَقَةٌ وَهُوَ لَنَا هَدِيَّةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Kami diberitakan oleh Qasim bin Zakaria bin Dinar, katanya: Telah menceritakan kepada kami Husain, daripada Zaidah, daripada Simaak, daripada Abdur Rahman bin Qasim, daripada bapanya, daripada Aisyah, bahawa dia telah membeli Barirah daripada sebilangan orang daripada kalangan Ansar. Mereka mensyaratkan wala’ (hak perlindungan).  Maka Rasulullah SAW bersabda:  \"Wala’ itu adalah untuk orang yang melepaskan (hamba itu).\"  Rasulullah SAW memberi pilihan kepada Barirah, sedang suaminya adalah seorang hamba.  Dan Barirah menghantar daging sebagai hadiah kepada Aisyah. Maka Rasulullah SAW bersabda:  \"Mengapa kamu tidak memberikan sebahagian daripada daging ini kepada kami?\"  Aisyah menjawab: \"Ia disedekahkan kepada Barirah.\"  Baginda bersabda:  \"Ia adalah sedekah baginya dan ia adalah hadiah bagi kita.\""
  },
  {
    "id": 18196,
    "hadith_number": 3460,
    "tajuk_hadith": "Hukum Membeli Hamba Sahaya dan Sedekah",
    "perawi_melayu": "Yahya bin Abi Bukair Al-Karmani berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ الْكَرْمَانِيُّ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، - قَالَ وَكَانَ وَصِيَّ أَبِيهِ قَالَ وَفَرِقْتُ أَنْ أَقُولَ، سَمِعْتُهُ مِنْ، أَبِيكَ - قَالَتْ عَائِشَةُ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ بَرِيرَةَ وَأَرَدْتُ أَنْ أَشْتَرِيَهَا وَاشْتُرِطَ الْوَلاَءُ لأَهْلِهَا فَقَالَ ‏\"‏ اشْتَرِيهَا فَإِنَّ الْوَلاَءَ لِمَنْ أَعْتَقَ ‏\"‏ ‏.‏ قَالَ وَخُيِّرَتْ وَكَانَ زَوْجُهَا عَبْدًا ثُمَّ قَالَ بَعْدَ ذَلِكَ مَا أَدْرِي وَأُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِلَحْمٍ ‏.‏ فَقَالُوا هَذَا مِمَّا تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ ‏.‏ قَالَ ‏\"‏ هُوَ لَهَا صَدَقَةٌ وَلَنَا هَدِيَّةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Muhammad bin Ismail bin Ibrahim telah memberitahu kami, katanya Yahya bin Abi Bakar Al-Karmani telah memberitahu kami, katanya Syu’bah telah memberitahu kami daripada Abdul Rahman bin Al-Qasim, daripada bapanya, daripada Aisyah.  Syu’bah berkata: “Dan dia (Abdul Rahman) adalah wasi kepada bapanya.”  Syu’bah berkata: “Saya ragu-ragu untuk bertanya kepadanya: ‘Adakah engkau mendengarnya daripada bapamu?’” Aisyah berkata: “Saya bertanya kepada Rasulullah SAW tentang Barirah, dan saya ingin membelinya, tetapi ditetapkan bahawa hak wala’ (pengikut) adalah kepada keluarganya. Maka Baginda bersabda:  “Belilah dia, kerana hak wala’ adalah bagi orang yang memerdekakannya.”  Katanya, dan Barirah diberi pilihan, dan suaminya adalah seorang hamba. Kemudian Baginda bersabda selepas itu: “Aku tidak tahu.”  Kemudian Rasulullah SAW diberi daging.  Mereka berkata: “Ini sebahagian daripada sedekah untuk Barirah.”  Baginda bersabda:  “Ia adalah sedekah baginya dan hadiah untuk kita.”"
  },
  {
    "id": 18197,
    "hadith_number": 3461,
    "tajuk_hadith": "Nabi SAW Bersumpah Tidak Menghampiri Isteri-isteri Baginda",
    "perawi_melayu": "Ibnu Abbas berkata:",
    "english_text": "\"One morning, we saw the wives of the Prophet weeping, and each one of them had her family with her. I entered the Masjid and found it filled with people. Then 'Umar, may Allah be pleased with him, came, and went to the Prophet who was in his room. He greeted him with the Salam but no one answered. He greeted him again but no one answered. He greeted him (a third time) but no one answered. So he went back and called out: 'Bilal!' He came to the Prophet and said: 'Have you divorced your wives?' He said: 'No, but I have sworn an oath of abstention from them for a month.' So he stayed away from them for twenty-nine days, then he came and went into his wives.\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ الْبَصْرِيُّ، قَالَ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، قَالَ حَدَّثَنَا أَبُو يَعْفُورٍ، عَنْ أَبِي الضُّحَى، قَالَ تَذَاكَرْنَا الشَّهْرَ عِنْدَهُ فَقَالَ بَعْضُنَا ثَلاَثِينَ ‏.‏ وَقَالَ بَعْضُنَا تِسْعًا وَعِشْرِينَ ‏.‏ فَقَالَ أَبُو الضُّحَى حَدَّثَنَا ابْنُ عَبَّاسٍ قَالَ أَصْبَحْنَا يَوْمًا وَنِسَاءُ النَّبِيِّ صلى الله عليه وسلم يَبْكِينَ عِنْدَ كُلِّ امْرَأَةٍ مِنْهُنَّ أَهْلُهَا فَدَخَلْتُ الْمَسْجِدَ فَإِذَا هُوَ مَلآنُ مِنَ النَّاسِ - قَالَ - فَجَاءَ عُمَرُ رضى الله عنه فَصَعِدَ إِلَى النَّبِيِّ صلى الله عليه وسلم وَهُوَ فِي عُلِّيَّةٍ لَهُ فَسَلَّمَ عَلَيْهِ فَلَمْ يُجِبْهُ أَحَدٌ ثُمَّ سَلَّمَ فَلَمْ يُجِبْهُ أَحَدٌ ثُمَّ سَلَّمَ فَلَمْ يُجِبْهُ أَحَدٌ فَرَجَعَ فَنَادَى بِلاَلاً فَدَخَلَ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ أَطَلَّقْتَ نِسَاءَكَ فَقَالَ ‏\n\"‏ لاَ وَلَكِنِّي آلَيْتُ مِنْهُنَّ شَهْرًا ‏\"‏ ‏.‏ فَمَكَثَ تِسْعًا وَعِشْرِينَ ثُمَّ نَزَلَ فَدَخَلَ عَلَى نِسَائِهِ ‏.‏",
    "malay_translation": "Pada suatu pagi, kami melihat isteri-isteri Nabi SAW menangis, dan setiap seorang daripada mereka bersama keluarga masing-masing. Aku masuk ke masjid dan mendapati ia penuh dengan orang ramai. Kemudian Umar r.a. datang dan pergi kepada Nabi SAW yang berada di bilik baginda. Beliau memberi salam, tetapi tiada siapa yang menjawab. Beliau memberi salam lagi, tetapi tiada siapa yang menjawab. Beliau memberi salam buat kali ketiga, tetapi tiada siapa yang menjawab. Maka beliau kembali dan memanggil Bilal. Bilal datang kepada Nabi SAW dan bertanya, \"Adakah baginda telah menceraikan isteri-isteri baginda?\" Baginda menjawab, \"Tidak, tetapi aku telah bersumpah untuk tidak menghampiri mereka selama sebulan.\" Maka baginda menjauhi mereka selama dua puluh sembilan hari, kemudian baginda datang dan masuk kepada isteri-isteri baginda."
  },
  {
    "id": 18198,
    "hadith_number": 3462,
    "tajuk_hadith": "Sumpah Nabi SAW Menjauhi Isteri-isteri Baginda",
    "perawi_melayu": "Dari Anas r.a.",
    "english_text": "\"The Prophet swore an oath of abstention from his wives for a month and stayed in his room for twenty-nine days. It was said: 'O Messenger of Allah, did you not swear an oath of abstention for a month?' He said: 'This month is twenty-nine days.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا حُمَيْدٌ، عَنْ أَنَسٍ، قَالَ آلَى النَّبِيُّ صلى الله عليه وسلم مِنْ نِسَائِهِ شَهْرًا فِي مَشْرَبَةٍ لَهُ فَمَكَثَ تِسْعًا وَعِشْرِينَ لَيْلَةً ثُمَّ نَزَلَ فَقِيلَ يَا رَسُولَ اللَّهِ أَلَيْسَ آلَيْتَ عَلَى شَهْرٍ قَالَ ‏\n\"‏ الشَّهْرُ تِسْعٌ وَعِشْرُونَ ‏\"‏ ‏.‏",
    "malay_translation": "Nabi SAW bersumpah untuk menjauhi isteri-isteri baginda selama sebulan dan baginda berada di dalam bilik baginda selama dua puluh sembilan hari. Kemudian dikatakan: ‘Wahai Rasulullah, bukankah tuan bersumpah untuk menjauhi isteri-isteri selama sebulan?’ Baginda menjawab: ‘Bulan itu ada dua puluh sembilan hari.’"
  },
  {
    "id": 18199,
    "hadith_number": 3463,
    "tajuk_hadith": "Zina selepas Zihar",
    "perawi_melayu": "Daripada Ibnu Abbas bahawa seorang lelaki datang kepada Nabi SAW yang telah melakukan zihar terhadap isterinya, kemudian dia melakukan hubungan seks dengannya.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ، قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، عَنْ مَعْمَرٍ، عَنِ الْحَكَمِ بْنِ أَبَانَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم قَدْ ظَاهَرَ مِنِ امْرَأَتِهِ فَوَقَعَ عَلَيْهَا فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي ظَاهَرْتُ مِنِ امْرَأَتِي فَوَقَعْتُ قَبْلَ أَنْ أُكَفِّرَ ‏.‏ قَالَ ‏\"‏ وَمَا حَمَلَكَ عَلَى ذَلِكَ يَرْحَمُكَ اللَّهُ ‏\"‏ ‏.‏ قَالَ رَأَيْتُ خَلْخَالَهَا فِي ضَوْءِ الْقَمَرِ ‏.‏ فَقَالَ ‏\"‏ لاَ تَقْرَبْهَا حَتَّى تَفْعَلَ مَا أَمَرَ اللَّهُ عَزَّ وَجَلَّ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami al-Husain bin Huraits, katanya; telah menceritakan kepada kami al-Fadl bin Musa, daripada Ma'mar, daripada al-Hakam bin Aban, daripada Ikrimah, daripada Ibnu Abbas, bahawa seorang lelaki datang kepada Nabi SAW yang telah melakukan zihar terhadap isterinya, kemudian dia melakukan hubungan seks dengannya.  Dia berkata, \"Wahai Rasulullah, sesungguhnya saya telah melakukan zihar terhadap isteri saya, kemudian saya telah melakukan hubungan seks dengannya sebelum saya menunaikan kafarah.\" Nabi SAW bertanya, \"Apakah yang mendorongmu melakukan demikian, semoga Allah merahmatimu?\" Lelaki itu menjawab, \"Saya melihat gelang kaki isteri saya di bawah cahaya bulan.\" Nabi SAW bersabda, \"Jangan engkau menghampirinya sehingga engkau melakukan apa yang Allah SWT perintahkan.\""
  },
  {
    "id": 18200,
    "hadith_number": 3464,
    "tajuk_hadith": "Zihar dan Kafarah",
    "perawi_melayu": "Daripada riwayat Ikrimah:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ الْحَكَمِ بْنِ أَبَانَ، عَنْ عِكْرِمَةَ، قَالَ تَظَاهَرَ رَجُلٌ مِنِ امْرَأَتِهِ فَأَصَابَهَا قَبْلَ أَنْ يُكَفِّرَ فَذَكَرَ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَا حَمَلَكَ عَلَى ذَلِكَ ‏\"‏ ‏.‏ قَالَ رَحِمَكَ اللَّهُ يَا رَسُولَ اللَّهِ رَأَيْتُ خَلْخَالَهَا أَوْ سَاقَيْهَا فِي ضَوْءِ الْقَمَرِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَاعْتَزِلْهَا حَتَّى تَفْعَلَ مَا أَمَرَكَ اللَّهُ عَزَّ وَجَلَّ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Rafi', katanya: Telah menceritakan kepada kami Abdurrazzaq, katanya: Telah menceritakan kepada kami Ma'mar, daripada Al-Hakam bin Aban, daripada Ikrimah, katanya: Seorang lelaki melakukan zihar terhadap isterinya, kemudian dia mengahwininya sebelum dia menunaikan kafarah. Maka dia menceritakan perkara itu kepada Nabi SAW.  Lalu Nabi SAW bertanya kepadanya: \"Apakah yang mendorongmu berbuat demikian?\" Lelaki itu menjawab: \"Semoga Allah merahmati tuan, wahai Rasulullah, saya melihat gelang kaki atau betisnya dalam cahaya bulan.\" Maka Rasulullah SAW bersabda: \"Jauhilah dia sehingga engkau melakukan apa yang Allah SWT perintahkan.\" "
  },
  {
    "id": 18201,
    "hadith_number": 3465,
    "tajuk_hadith": "Zihar dan Penghindaran Sehingga Melunaskan Kewajipan",
    "perawi_melayu": "Ikrinah berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا الْمُعْتَمِرُ، ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا الْمُعْتَمِرُ، قَالَ سَمِعْتُ الْحَكَمَ بْنَ أَبَانَ، قَالَ سَمِعْتُ عِكْرِمَةَ، قَالَ أَتَى رَجُلٌ نَبِيَّ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا نَبِيَّ اللَّهِ إِنَّهُ ظَاهَرَ مِنِ امْرَأَتِهِ ثُمَّ غَشِيَهَا قَبْلَ أَنْ يَفْعَلَ مَا عَلَيْهِ ‏.‏ قَالَ ‏\"‏ مَا حَمَلَكَ عَلَى ذَلِكَ ‏\"‏ ‏.‏ قَالَ يَا نَبِيَّ اللَّهِ رَأَيْتُ بَيَاضَ سَاقَيْهَا فِي الْقَمَرِ ‏.‏ قَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَاعْتَزِلْ حَتَّى تَقْضِيَ مَا عَلَيْكَ ‏\"‏ ‏.‏ وَقَالَ إِسْحَاقُ فِي حَدِيثِهِ ‏\"‏ فَاعْتَزِلْهَا حَتَّى تَقْضِيَ مَا عَلَيْكَ ‏\"‏ ‏.‏ وَاللَّفْظُ لِمُحَمَّدٍ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ الْمُرْسَلُ أَوْلَى بِالصَّوَابِ مِنَ الْمُسْنَدِ وَاللَّهُ سُبْحَانَهُ وَتَعَالَى أَعْلَمُ ‏.‏",
    "malay_translation": "Seorang lelaki datang kepada Nabi Allah SAW dan berkata, \"Wahai Nabi Allah, saya telah melakukan zihar terhadap isteri saya, kemudian saya menghampirinya sebelum menunaikan apa yang menjadi kewajipan saya.\" Baginda bertanya, \"Apakah yang mendorongmu berbuat demikian?\" Lelaki itu menjawab, \"Wahai Nabi Allah, saya melihat keputihan betis isteri saya dalam cahaya bulan.\" Nabi SAW bersabda, \"Jauhilah dia sehingga kamu menunaikan apa yang menjadi kewajipanmu.\" Ishak menyebut dalam hadisnya, \"Jauhilah dia sehingga kamu menunaikan apa yang menjadi kewajipanmu.\" Lafadz ini daripada Muhammad. Abu Abdur Rahman Al-Mursal berkata, yang mursal lebih hampir kepada kebenaran daripada yang musnad, dan Allah SWT lebih mengetahui."
  },
  {
    "id": 18202,
    "hadith_number": 3466,
    "tajuk_hadith": "Allah Mendengar Segala Aduan",
    "perawi_melayu": "Daripada Aisyah r.a. yang berkata:",
    "english_text": "\"Praise be to Allah Whose hearing encompasses all voices. Khawlah came to the Messenger of Allah complaining about her husband, but I could not hear what she said. Then Allah, the Mighty and Sublime, revealed: 'Indeed Allah has heard the statement of her that disputes with you concerning her husband, and complains to Allah. And Allah hears the argument between you both.'\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ تَمِيمِ بْنِ سَلَمَةَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتِ الْحَمْدُ لِلَّهِ الَّذِي وَسِعَ سَمْعُهُ الأَصْوَاتَ لَقَدْ جَاءَتْ خَوْلَةُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم تَشْكُو زَوْجَهَا فَكَانَ يَخْفَى عَلَىَّ كَلاَمُهَا فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ قَدْ سَمِعَ اللَّهُ قَوْلَ الَّتِي تُجَادِلُكَ فِي زَوْجِهَا وَتَشْتَكِي إِلَى اللَّهِ وَاللَّهُ يَسْمَعُ تَحَاوُرَكُمَا ‏}‏ الآيَةَ ‏.‏",
    "malay_translation": "Segala puji bagi Allah SWT yang meliputi pendengaran-Nya segala suara.  Khawlah telah datang mengadu kepada Rasulullah SAW tentang suaminya, tetapi aku tidak dapat mendengar perkataannya. Kemudian Allah SWT yang Maha Agung dan Maha Tinggi menurunkan wahyu:  'Sesungguhnya Allah telah mendengar perkataan wanita yang bertengkar denganmu tentang suaminya dan mengadu kepada Allah. Dan Allah mendengar percakapan kamu berdua.' "
  },
  {
    "id": 18203,
    "hadith_number": 3467,
    "tajuk_hadith": "Wanita yang Menuntut Cerai dan Khul'",
    "perawi_melayu": "Daripada Ayyub, daripada Al-Hasan, daripada Abu Hurairah, bahawa Nabi SAW bersabda:",
    "english_text": "\"Women who seek divorce and Khul' are like the female hypocrites.\" Al-Hasan said: \"I did not hear it from anyone other than Abu Hurairah.\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا الْمَخْزُومِيُّ، - وَهُوَ الْمُغِيرَةُ بْنُ سَلَمَةَ - قَالَ حَدَّثَنَا وُهَيْبٌ، عَنْ أَيُّوبَ، عَنِ الْحَسَنِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ الْمُنْتَزِعَاتُ وَالْمُخْتَلِعَاتُ هُنَّ الْمُنَافِقَاتُ ‏\"‏ ‏.‏ قَالَ الْحَسَنُ لَمْ أَسْمَعْهُ مِنْ غَيْرِ أَبِي هُرَيْرَةَ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ الْحَسَنُ لَمْ يَسْمَعْ مِنْ أَبِي هُرَيْرَةَ شَيْئًا ‏.‏",
    "malay_translation": "“Wanita-wanita yang meminta cerai dan khul’ ibarat wanita-wanita munafik.” Al-Hasan berkata: “Aku tidak pernah mendengarnya daripada selain Abu Hurairah.”"
  },
  {
    "id": 18204,
    "hadith_number": 3468,
    "tajuk_hadith": "Perceraian Habibah binti Sahl",
    "perawi_melayu": "Ia diriwayatkan daripada Yahya bin Sa'eed, daripada 'Amrah binti 'Abdur-Rahman, bahawa beliau memberitahunya tentang Habibah binti Sahl:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ أَنْبَأَنَا ابْنُ الْقَاسِمِ، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّهَا أَخْبَرَتْهُ عَنْ حَبِيبَةَ بِنْتِ سَهْلٍ، أَنَّهَا كَانَتْ تَحْتَ ثَابِتِ بْنِ قَيْسِ بْنِ شَمَّاسٍ وَأَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ إِلَى الصُّبْحِ فَوَجَدَ حَبِيبَةَ بِنْتَ سَهْلٍ عِنْدَ بَابِهِ فِي الْغَلَسِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ هَذِهِ ‏\"‏ ‏.‏ قَالَتْ أَنَا حَبِيبَةُ بِنْتُ سَهْلٍ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ مَا شَأْنُكِ ‏\"‏ ‏.‏ قَالَتْ لاَ أَنَا وَلاَ ثَابِتُ بْنُ قَيْسٍ ‏.‏ لِزَوْجِهَا فَلَمَّا جَاءَ ثَابِتُ بْنُ قَيْسٍ قَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَذِهِ حَبِيبَةُ بِنْتُ سَهْلٍ قَدْ ذَكَرَتْ مَا شَاءَ اللَّهُ أَنْ تَذْكُرَ ‏\"‏ ‏.‏ فَقَالَتْ حَبِيبَةُ يَا رَسُولَ اللَّهِ كُلُّ مَا أَعْطَانِي عِنْدِي ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِثَابِتٍ ‏\"‏ خُذْ مِنْهَا ‏\"‏ ‏.‏ فَأَخَذَ مِنْهَا وَجَلَسَتْ فِي أَهْلِهَا ‏.‏",
    "malay_translation": "Dikhabarkan kepada kami oleh Muhammad bin Salmah, katanya:  Diberitakan kepada kami oleh Ibnu Qasim, daripada Malik, daripada Yahya bin Sa'id, daripada Amrah binti Abdur-Rahman, bahawa dia memberitahunya tentang Habibah binti Sahl, bahawa dia berada di bawah jagaan Thabit bin Qais bin Syammas dan bahawa Rasulullah SAW keluar untuk solat Subuh, lalu mendapati Habibah binti Sahl di pintu rumahnya pada waktu gelap.  Lalu Rasulullah SAW bertanya, \"Siapakah ini?\"  Habibah menjawab, \"Saya Habibah binti Sahl, wahai Rasulullah.\"  Rasulullah bertanya, \"Apakah hal ehwalmu?\"  Habibah menjawab, \"Saya tidak boleh hidup bersama Thabit bin Qais.\"  (suaminya).  Apabila Thabit bin Qais datang, Rasulullah SAW berkata kepadanya, \"Inilah Habibah binti Sahl, dia telah menyatakan apa yang Allah SWT kehendaki dia nyatakan.\"  Habibah berkata, \"Wahai Rasulullah, semua yang diberikannya kepada saya ada pada saya.\"  Rasulullah SAW berkata kepada Thabit, \"Ambillah darinya.\"  Maka Thabit mengambilnya dan Habibah tinggal bersama keluarganya."
  },
  {
    "id": 18205,
    "hadith_number": 3469,
    "tajuk_hadith": "Perceraian dan Mengembalikan Harta",
    "perawi_melayu": "Daripada Ibnu Abbas bahawa isteri Thabit bin Qais telah datang kepada Nabi dan berkata:",
    "english_text": "\"O Messenger of Allah, I do not find any fault with Thabit bin Qais regarding his attitude or religious commitment, but I hate Kufr after becoming Muslim.\" The Messenger of Allah said: \"Will you give him back his garden?\" She said: \"Yes.\" The Messenger of Allah said: \"Take back the garden and divorce her once.\"",
    "arabic_text": "أَخْبَرَنَا أَزْهَرُ بْنُ جَمِيلٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ امْرَأَةَ، ثَابِتِ بْنِ قَيْسٍ أَتَتِ النَّبِيَّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ ثَابِتُ بْنُ قَيْسٍ أَمَا إِنِّي مَا أَعِيبُ عَلَيْهِ فِي خُلُقٍ وَلاَ دِينٍ وَلَكِنِّي أَكْرَهُ الْكُفْرَ فِي الإِسْلاَمِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَرُدِّينَ عَلَيْهِ حَدِيقَتَهُ ‏\"‏ ‏.‏ قَالَتْ نَعَمْ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اقْبَلِ الْحَدِيقَةَ وَطَلِّقْهَا تَطْلِيقَةً ‏\"‏ ‏.‏",
    "malay_translation": "Isteri Thabit bin Qais telah menghadap Nabi SAW lalu berkata, \"Wahai Rasulullah, saya tidak melihat sebarang kesalahan pada akhlak dan agama Thabit bin Qais, tetapi saya benci kepada kekufuran setelah memeluk Islam.\"  Nabi SAW bertanya, \"Adakah engkau akan mengembalikan kebunnya kepadanya?\" Jawabnya, \"Ya.\"  Nabi SAW bersabda, \"Terima kembali kebun itu dan ceraikanlah dia sekali.\" "
  },
  {
    "id": 18206,
    "hadith_number": 3470,
    "tajuk_hadith": "Isteri Yang Tidak Menolak Sentuhan Lelaki Lain",
    "perawi_melayu": "Daripada Ibnu Abbas r.a.",
    "english_text": "\"A man came to the Messenger of Allah and said: 'My wife does not object if anyone touches her.' He said: 'Divorce her if you wish.' He said: 'I am afraid that I will miss her.' He said: 'Then stay with her as much as you need to.'\"",
    "arabic_text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ، قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، قَالَ حَدَّثَنَا الْحُسَيْنُ بْنُ وَاقِدٍ، عَنْ عُمَارَةَ بْنِ أَبِي حَفْصَةَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ إِنَّ امْرَأَتِي لاَ تَمْنَعُ يَدَ لاَمِسٍ ‏.‏ فَقَالَ ‏\"‏ غَرِّبْهَا إِنْ شِئْتَ ‏\"‏ ‏.‏ قَالَ إِنِّي أَخَافُ أَنْ تَتَّبِعَهَا نَفْسِي ‏.‏ قَالَ ‏\"‏ اسْتَمْتِعْ بِهَا ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki datang kepada Rasulullah SAW dan berkata, \"Isteriku tidak menghalang sesiapa pun daripada menyentuhnya.\" Baginda SAW bersabda, \"Cerailah dia jika engkau mahu.\" Lelaki itu berkata, \"Aku bimbang aku akan merinduinya.\" Baginda SAW bersabda, \"Maka nikmatilah dia selagi yang engkau perlukan.\""
  },
  {
    "id": 18207,
    "hadith_number": 3471,
    "tajuk_hadith": "Menceraikan Isteri Yang Tidak Menolak Sentuhan Orang Lain",
    "perawi_melayu": "Daripada Ibnu Abbas r.a.",
    "english_text": "\"O Messenger of Allah, I have a wife who does not object if anyone touches her.\" He said: \"Divorce her.\" He said: \"I cannot live without her.\" He said: \"Then keep her.\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، قَالَ أَنْبَأَنَا هَارُونُ بْنُ رِئَابٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عُمَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَجُلاً، قَالَ يَا رَسُولَ اللَّهِ إِنَّ تَحْتِي امْرَأَةً لاَ تَرُدُّ يَدَ لاَمِسٍ قَالَ ‏\"‏ طَلِّقْهَا ‏\"‏ ‏.‏ قَالَ إِنِّي لاَ أَصْبِرُ عَنْهَا ‏.‏ قَالَ ‏\"‏ فَأَمْسِكْهَا ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا خَطَأٌ وَالصَّوَابُ مُرْسَلٌ ‏.‏",
    "malay_translation": "Daripada Ibnu Abbas r.a., bahawa seorang lelaki berkata, \"Wahai Rasulullah, saya mempunyai seorang isteri yang tidak menolak sentuhan sesiapa sahaja.\" Baginda SAW bersabda, \"Cerailah dia.\" Lelaki itu berkata, \"Saya tidak mampu hidup tanpanya.\" Baginda SAW bersabda, \"Maka, teruslah bersama dia.\""
  },
  {
    "id": 18208,
    "hadith_number": 3472,
    "tajuk_hadith": "Li'an:  Perceraian Melalui Sumpahan",
    "perawi_melayu": "Daripada Sahl bin Sa'd, daripada 'Asim bin 'Adiyy yang berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ، وَإِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ الزُّهْرِيِّ، عَنْ سَهْلِ بْنِ سَعْدٍ، عَنْ عَاصِمِ بْنِ عَدِيٍّ، قَالَ جَاءَنِي عُوَيْمِرٌ - رَجُلٌ مِنْ بَنِي الْعَجْلاَنِ - فَقَالَ أَىْ عَاصِمُ أَرَأَيْتُمْ رَجُلاً رَأَى مَعَ امْرَأَتِهِ رَجُلاً أَيَقْتُلُهُ فَتَقْتُلُونَهُ أَمْ كَيْفَ يَفْعَلُ يَا عَاصِمُ سَلْ لِي رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏ فَسَأَلَ عَاصِمٌ عَنْ ذَلِكَ النَّبِيَّ صلى الله عليه وسلم فَعَابَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَسَائِلَ وَكَرِهَهَا ‏.‏ فَجَاءَهُ عُوَيْمِرٌ فَقَالَ مَا صَنَعْتَ يَا عَاصِمُ فَقَالَ صَنَعْتُ أَنَّكَ لَمْ تَأْتِنِي بِخَيْرٍ كَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَسَائِلَ وَعَابَهَا ‏.‏ قَالَ عُوَيْمِرٌ وَاللَّهِ لأَسْأَلَنَّ عَنْ ذَلِكَ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏ فَانْطَلَقَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَأَلَهُ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ قَدْ أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ فِيكَ وَفِي صَاحِبَتِكَ فَائْتِ بِهَا ‏\"‏ ‏.‏ قَالَ سَهْلٌ وَأَنَا مَعَ النَّاسِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَجَاءَ بِهَا فَتَلاَعَنَا فَقَالَ يَا رَسُولَ اللَّهِ وَاللَّهِ لَئِنْ أَمْسَكْتُهَا لَقَدْ كَذَبْتُ عَلَيْهَا ‏.‏ فَفَارَقَهَا قَبْلَ أَنْ يَأْمُرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بِفِرَاقِهَا فَصَارَتْ سُنَّةَ الْمُتَلاَعِنَيْنِ ‏.‏",
    "malay_translation": "Uwaimir, seorang lelaki daripada Bani 'Ajlan, datang dan berkata: \"Wahai 'Asim, bagaimana pendapatmu jika seorang lelaki melihat lelaki lain bersama isterinya, patutkah dia membunuhnya lalu dibunuh sebagai balasan, atau apakah yang patut dia lakukan? Wahai 'Asim, tanyakanlah kepada Rasulullah SAW tentang hal itu untukku.\" Maka 'Asim bertanya kepada Rasulullah SAW tentang hal itu, dan Rasulullah SAW tidak menyukai soalan itu dan mengecam perbuatan bertanya terlalu banyak. Kemudian Uwaimir datang kepadanya dan berkata: \"Apa yang terjadi, wahai 'Asim?\" 'Asim berkata kepada Uwaimir: \"Apa yang terjadi?! Engkau tidak membawa apa-apa kebaikan untukku. Rasulullah SAW tidak menyukai soalan yang aku tanyakan.\" Uwaimir berkata: \"Demi Allah, aku akan pergi dan bertanya kepada Rasulullah SAW.\" Maka dia pergi kepada Rasulullah SAW dan bertanya kepadanya. Rasulullah SAW berkata: \"Allah SWT telah menurunkan (sesuatu) tentang kamu dan isterimu, maka bawalah dia ke sini.\" Sahl berkata: \"Aku berada di kalangan orang ramai di sisi Rasulullah SAW dan dia membawa isterinya lalu mereka melakukan Li'an.  Dia berkata:  'Wahai Rasulullah SAW, demi Allah! Sekiranya aku meneruskan perkahwinan ini, nescaya aku telah berdusta tentangnya.' Maka dia berpisah dengan isterinya sebelum Rasulullah SAW menyuruhnya berpisah, dan itulah yang menjadi sunnah bagi mereka yang melakukan Li'an."
  },
  {
    "id": 18209,
    "hadith_number": 3473,
    "tajuk_hadith": "Rasulullah SAW Melakukan Li'an antara Al-Ajlani dan Isterinya",
    "perawi_melayu": "Daripada Ibnu Abbas r.a.",
    "english_text": "\"The Messenger of Allah conducted the procedure of Li'an between the 'Ajlani and his wife, who was pregnant.\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ، قَالَ حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ عُقْبَةَ، عَنْ أَبِي الزِّنَادِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لاَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ الْعَجْلاَنِيِّ وَامْرَأَتِهِ وَكَانَتْ حُبْلَى ‏.‏",
    "malay_translation": "Daripada Ibnu Abbas r.a.: Rasulullah SAW telah menjalankan prosedur Li'an di antara Al-Ajlani dan isterinya yang ketika itu sedang hamil."
  },
  {
    "id": 18210,
    "hadith_number": 3474,
    "tajuk_hadith": "Li'an: Menentukan Bapa Anak Hasil Perzinaan",
    "perawi_melayu": "Daripada riwayat Muhammad:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَبْدُ الأَعْلَى، قَالَ سُئِلَ هِشَامٌ عَنِ الرَّجُلِ، يَقْذِفُ امْرَأَتَهُ فَحَدَّثَنَا هِشَامٌ، عَنْ مُحَمَّدٍ، قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ عَنْ ذَلِكَ، وَأَنَا أَرَى، أَنَّ عِنْدَهُ، مِنْ ذَلِكَ عِلْمًا فَقَالَ إِنَّ هِلاَلَ بْنَ أُمَيَّةَ قَذَفَ امْرَأَتَهُ بِشَرِيكِ ابْنِ السَّحْمَاءِ - وَكَانَ أَخُو الْبَرَاءِ بْنِ مَالِكٍ لأُمِّهِ وَكَانَ أَوَّلَ مَنْ لاَعَنَ - فَلاَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَهُمَا ثُمَّ قَالَ ‏\n\"‏ ابْصُرُوهُ فَإِنْ جَاءَتْ بِهِ أَبْيَضَ سَبِطًا قَضِيءَ الْعَيْنَيْنِ فَهُوَ لِهِلاَلِ بْنِ أُمَيَّةَ وَإِنْ جَاءَتْ بِهِ أَكْحَلَ جَعْدًا أَحْمَشَ السَّاقَيْنِ فَهُوَ لِشَرِيكِ ابْنِ السَّحْمَاءِ ‏\"‏ ‏.‏ قَالَ فَأُنْبِئْتُ أَنَّهَا جَاءَتْ بِهِ أَكْحَلَ جَعْدًا أَحْمَشَ السَّاقَيْنِ ‏.‏",
    "malay_translation": "Kami diberitahu oleh Ishak bin Ibrahim, yang berkata: Aku diberitahu oleh Abd al-A'la, yang berkata: Hisyam ditanya mengenai seorang lelaki yang menuduh isterinya, maka Hisyam menceritakan kepada kami daripada Muhammad, yang berkata: Aku bertanya kepada Anas bin Malik mengenai perkara itu, dan aku fikir bahawa dia mempunyai ilmu mengenainya. Maka dia berkata: Sesungguhnya Hilal bin Umaiyyah menuduh isterinya dengan Syarik bin As-Sahma – dan dia adalah saudara kepada al-Bara’ bin Malik melalui ibunya, dan dia adalah orang pertama yang melakukan Li’an. Maka Rasulullah ﷺ melakukan Li’an di antara mereka, kemudian baginda bersabda: \"Perhatikanlah, jika dia melahirkan anak yang putih, berambut lurus dan mata yang jernih, maka dia adalah anak Hilal bin Umaiyyah, dan jika dia melahirkan anak yang berkulit gelap di sekeliling matanya, berambut kerinting dan betis yang kurus, maka dia adalah anak Syarik bin As-Sahma.\" Dia berkata: Maka aku diberitahu bahawa dia melahirkan anak yang berkulit gelap di sekeliling matanya, berambut kerinting dan betis yang kurus."
  },
  {
    "id": 18211,
    "hadith_number": 3475,
    "tajuk_hadith": "Li'an Pertama dalam Islam",
    "perawi_melayu": "Dari Anas bin Malik:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عِمْرَانُ بْنُ يَزِيدَ، قَالَ حَدَّثَنَا مَخْلَدُ بْنُ حُسَيْنٍ الأَزْدِيُّ، قَالَ حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ إِنَّ أَوَّلَ لِعَانٍ كَانَ فِي الإِسْلاَمِ أَنَّ هِلاَلَ بْنَ أُمَيَّةَ قَذَفَ شَرِيكَ ابْنَ السَّحْمَاءِ بِامْرَأَتِهِ فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَأَخْبَرَهُ بِذَلِكَ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَرْبَعَةَ شُهَدَاءَ وَإِلاَّ فَحَدٌّ فِي ظَهْرِكَ ‏\"‏ ‏.‏ يُرَدِّدُ ذَلِكَ عَلَيْهِ مِرَارًا فَقَالَ لَهُ هِلاَلٌ وَاللَّهِ يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ عَزَّ وَجَلَّ لَيَعْلَمُ أَنِّي صَادِقٌ وَلَيُنْزِلَنَّ اللَّهُ عَزَّ وَجَلَّ عَلَيْكَ مَا يُبَرِّئُ ظَهْرِي مِنَ الْجَلْدِ ‏.‏ فَبَيْنَمَا هُمْ كَذَلِكَ إِذْ نَزَلَتْ عَلَيْهِ آيَةُ اللِّعَانِ ‏{‏ وَالَّذِينَ يَرْمُونَ أَزْوَاجَهُمْ ‏}‏ إِلَى آخِرِ الآيَةِ فَدَعَا هِلاَلاً فَشَهِدَ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ إِنَّهُ لَمِنَ الصَّادِقِينَ وَالْخَامِسَةُ أَنَّ لَعْنَةَ اللَّهِ عَلَيْهِ إِنْ كَانَ مِنَ الْكَاذِبِينَ ثُمَّ دُعِيَتِ الْمَرْأَةُ فَشَهِدَتْ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ إِنَّهُ لَمِنَ الْكَاذِبِينَ فَلَمَّا أَنْ كَانَ فِي الرَّابِعَةِ أَوِ الْخَامِسَةِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَقِّفُوهَا فَإِنَّهَا مُوجِبَةٌ ‏\"‏ ‏.‏ فَتَلَكَّأَتْ حَتَّى مَا شَكَكْنَا أَنَّهَا سَتَعْتَرِفُ ثُمَّ قَالَتْ لاَ أَفْضَحُ قَوْمِي سَائِرَ الْيَوْمِ ‏.‏ فَمَضَتْ عَلَى الْيَمِينِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ انْظُرُوهَا فَإِنْ جَاءَتْ بِهِ أَبْيَضَ سَبِطًا قَضِيءَ الْعَيْنَيْنِ فَهُوَ لِهِلاَلِ بْنِ أُمَيَّةَ وَإِنْ جَاءَتْ بِهِ آدَمَ جَعْدًا رَبْعًا حَمْشَ السَّاقَيْنِ فَهُوَ لِشَرِيكِ ابْنِ السَّحْمَاءِ ‏\"‏ ‏.‏ فَجَاءَتْ بِهِ آدَمَ جَعْدًا رَبْعًا حَمْشَ السَّاقَيْنِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْلاَ مَا سَبَقَ فِيهَا مِنْ كِتَابِ اللَّهِ لَكَانَ لِي وَلَهَا شَأْنٌ ‏\"‏ ‏.‏ قَالَ الشَّيْخُ وَالْقَضِيءُ طَوِيلُ شَعْرِ الْعَيْنَيْنِ لَيْسَ بِمَفْتُوحِ الْعَيْنِ وَلاَ جَاحِظِهِمَا وَاللَّهُ سُبْحَانَهُ وَتَعَالَى أَعْلَمُ ‏.‏",
    "malay_translation": "Dikatakan bahawa Anas bin Malik berkata:  Li'an pertama dalam Islam berlaku apabila Hilal bin Umayyah menuduh isterinya berzina dengan Sharik bin As-Sahma.  Dia mengadu kepada Nabi SAW dan Nabi SAW bersabda, \"Empat orang saksi, jika tidak, hukuman akan dijatuhkan di belakangmu.\"  Nabi SAW mengulanginya beberapa kali. Hilal berkata, \"Demi Allah, wahai Rasulullah, Allah SWT Maha Mengetahui bahawa saya benar, dan Allah SWT pasti akan menurunkan wahyu yang akan membersihkan saya daripada hukuman sebat.\"  Ketika itu, ayat Li'an diturunkan:  \"...dan orang-orang yang menuduh isteri-isterinya.\"  Maka Rasulullah SAW memanggil Hilal untuk bersumpah empat kali demi Allah bahawa dia benar, dan sumpah kelima memohon laknat Allah jika dia berbohong. Kemudian isterinya dipanggil dan bersumpah empat kali demi Allah bahawa Hilal berbohong.  Apabila sampai kepada sumpah keempat atau kelima, Rasulullah SAW bersabda, \"Hentikan dia, kerana sumpah ini akan pasti membawa hukuman Allah ke atas pendusta.\" Wanita itu teragak-agak sehingga kami sangka dia akan mengaku, tetapi kemudian dia berkata, \"Aku tidak akan memalukan kaumku hari ini.\" Dia meneruskan sumpahnya. Rasulullah SAW bersabda, \"Tunggu dan lihat. Jika dia melahirkan anak yang berkulit putih, berambut lurus, dan bermata yang cantik (Qadiy'a), maka anak itu kepunyaan Hilal bin Umayyah, tetapi jika dia melahirkan anak yang berkulit gelap, berambut kerinting, sederhana badannya dan betisnya kecil, maka anak itu kepunyaan Sharik bin As-Sahma.\"  Wanita itu melahirkan anak yang berkulit gelap, berambut kerinting, sederhana badannya dan betisnya kecil. Rasulullah SAW bersabda, \"Sekiranya perkara ini tidak telah diselesaikan oleh Kitabullah, nescaya aku akan menghukumnya dengan keras.\""
  },
  {
    "id": 18212,
    "hadith_number": 3476,
    "tajuk_hadith": "Li'an dan Kesaksian Rasulullah SAW",
    "perawi_melayu": "Daripada Ibnu Abbas r.a.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ، قَالَ أَنْبَأَنَا اللَّيْثُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ قَالَ ذُكِرَ التَّلاَعُنُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ عَاصِمُ بْنُ عَدِيٍّ فِي ذَلِكَ قَوْلاً ثُمَّ انْصَرَفَ فَأَتَاهُ رَجُلٌ مِنْ قَوْمِهِ يَشْكُو إِلَيْهِ أَنَّهُ وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً قَالَ عَاصِمٌ مَا ابْتُلِيتُ بِهَذَا إِلاَّ بِقَوْلِي فَذَهَبَ بِهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرَهُ بِالَّذِي وَجَدَ عَلَيْهِ امْرَأَتَهُ وَكَانَ ذَلِكَ الرَّجُلُ مُصْفَرًّا قَلِيلَ اللَّحْمِ سَبِطَ الشَّعَرِ وَكَانَ الَّذِي ادَّعَى عَلَيْهِ أَنَّهُ وَجَدَهُ عِنْدَ أَهْلِهِ آدَمَ خَدْلاً كَثِيرَ اللَّحْمِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ بَيِّنْ ‏\"‏ ‏.‏ فَوَضَعَتْ شَبِيهًا بِالرَّجُلِ الَّذِي ذَكَرَ زَوْجُهَا أَنَّهُ وَجَدَهُ عِنْدَهَا فَلاَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَهُمَا ‏.‏ فَقَالَ رَجُلٌ لاِبْنِ عَبَّاسٍ فِي الْمَجْلِسِ أَهِيَ الَّتِي قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ رَجَمْتُ أَحَدًا بِغَيْرِ بَيِّنَةٍ رَجَمْتُ هَذِهِ ‏\"‏ ‏.‏ قَالَ ابْنُ عَبَّاسٍ لاَ تِلْكَ امْرَأَةٌ كَانَتْ تُظْهِرُ فِي الإِسْلاَمِ الشَّرَّ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Isa bin Hammad, katanya; telah menceritakan kepada kami Laits, daripada Yahya bin Said, daripada Abdur Rahman bin Al-Qasim, daripada Qasim bin Muhammad, daripada Ibnu Abbas r.a., bahawa beliau berkata: “Telah disebut tentang li'an di sisi Rasulullah SAW.  Lalu Ashim bin Adiyy berkata sesuatu mengenainya, kemudian beliau beredar.  Kemudian datang seorang lelaki daripada kaumnya mengadu kepadanya bahawa dia telah mendapati seorang lelaki bersama isterinya. Ashim berkata: “Aku diuji dengan perkara ini hanyalah disebabkan perkataanku.”  Lalu dia membawa lelaki itu kepada Rasulullah SAW dan memberitahu baginda tentang apa yang dijumpainya bersama isterinya.  Lelaki itu berkulit pucat, sedikit daging, berambut lurus, manakala lelaki yang didakwanya bersama isterinya itu berkulit gelap, tegap tubuh.  Lalu Rasulullah SAW bersabda: “Ya Allah, jelaskanlah (kebenaran).”  Kemudian isterinya melahirkan anak yang menyerupai lelaki yang disebut suaminya itu.  Maka Rasulullah SAW melaksanakan prosedur li'an di antara mereka.  Lalu seorang lelaki di dalam majlis bertanya kepada Ibnu Abbas: “Adakah dia wanita yang Rasulullah SAW katakan: ‘Sekiranya aku merajam seseorang tanpa bukti, nescaya aku merajam wanita ini?’”  Ibnu Abbas menjawab: “Tidak, wanita itu adalah seorang wanita yang selalu melakukan kejahatan walaupun setelah memeluk Islam.”"
  },
  {
    "id": 18213,
    "hadith_number": 3477,
    "tajuk_hadith": "Kisah Li'an dan Wanita yang Berbuat Jahat",
    "perawi_melayu": "Daripada Abdullah bin Abbas, Baginda berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ مُحَمَّدِ بْنِ السَّكَنِ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَهْضَمٍ، عَنْ إِسْمَاعِيلَ بْنِ جَعْفَرٍ، عَنْ يَحْيَى، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ، يُحَدِّثُ عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّهُ قَالَ ذُكِرَ التَّلاَعُنُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ عَاصِمُ بْنُ عَدِيٍّ فِي ذَلِكَ قَوْلاً ثُمَّ انْصَرَفَ فَلَقِيَهُ رَجُلٌ مِنْ قَوْمِهِ فَذَكَرَ أَنَّهُ وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً فَذَهَبَ بِهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرَهُ بِالَّذِي وَجَدَ عَلَيْهِ امْرَأَتَهُ وَكَانَ ذَلِكَ الرَّجُلُ مُصْفَرًّا قَلِيلَ اللَّحْمِ سَبِطَ الشَّعْرِ وَكَانَ الَّذِي ادَّعَى عَلَيْهِ أَنَّهُ وَجَدَ عِنْدَ أَهْلِهِ آدَمَ خَدْلاً كَثِيرَ اللَّحْمِ جَعْدًا قَطَطًا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ بَيِّنْ ‏\"‏ ‏.‏ فَوَضَعَتْ شَبِيهًا بِالَّذِي ذَكَرَ زَوْجُهَا أَنَّهُ وَجَدَهُ عِنْدَهَا فَلاَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَهُمَا فَقَالَ رَجُلٌ لاِبْنِ عَبَّاسٍ فِي الْمَجْلِسِ أَهِيَ الَّتِي قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ رَجَمْتُ أَحَدًا بِغَيْرِ بَيِّنَةٍ رَجَمْتُ هَذِهِ ‏\"‏ ‏.‏ قَالَ ابْنُ عَبَّاسٍ لاَ تِلْكَ امْرَأَةٌ كَانَتْ تُظْهِرُ الشَّرَّ فِي الإِسْلاَمِ ‏.‏",
    "malay_translation": "Telah disebutkan tentang li'an di hadapan Rasulullah SAW.  'Asim bin 'Adiyy telah mengeluarkan pendapat mengenai hal itu, kemudian beliau berlalu pergi.  Beliau bertemu dengan seorang lelaki dari kaumnya yang memberitahu bahawa dia telah menemui seorang lelaki bersama isterinya.  Lelaki itu membawa perkara tersebut kepada Rasulullah SAW dan menceritakan apa yang telah dijumpainya bersama isterinya. Lelaki yang menuduh itu berwajah pucat, kurus, dan berambut lurus, manakala lelaki yang dituduhnya itu berbadan tegap, berambut kerinting dan hitam. Rasulullah SAW berdoa, \"Ya Allah, jelaskanlah.\" Kemudian, isteri tersebut melahirkan seorang anak yang menyerupai lelaki yang dituduh oleh suaminya.  Maka, Rasulullah SAW melaksanakan prosedur li'an di antara mereka.  Seorang lelaki dalam majlis itu bertanya kepada Ibnu Abbas, \"Adakah dia wanita yang Rasulullah SAW katakan, 'Sekiranya aku merajam seseorang tanpa bukti, nescaya aku akan merajam wanita ini?'\" Ibnu Abbas menjawab, \"Tidak.  Wanita itu seorang yang terus melakukan kejahatan walaupun setelah memeluk Islam.\""
  },
  {
    "id": 18214,
    "hadith_number": 3478,
    "tajuk_hadith": "Azab Bagi Pendusta dalam Li'an",
    "perawi_melayu": "Daripada Ibnu Abbas:",
    "english_text": "\"When the Prophet commanded the two who were engaging in Li'an to utter the fifth oath, he commanded a man to place his hand over his mouth, and he said: \"It will inevitably bring the punishment upon the liar.\"\"",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ مَيْمُونٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَاصِمِ بْنِ كُلَيْبٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَ رَجُلاً حِينَ أَمَرَ الْمُتَلاَعِنَيْنِ أَنْ يَتَلاَعَنَا أَنْ يَضَعَ يَدَهُ عِنْدَ الْخَامِسَةِ عَلَى فِيهِ وَقَالَ ‏\n\"‏ إِنَّهَا مُوجِبَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Ibnu Abbas, bahawa Nabi SAW, apabila memerintahkan dua orang yang sedang melakukan li'an untuk melafazkan sumpah kelima, baginda memerintahkan seorang lelaki untuk meletakkan tangannya ke atas mulutnya dan bersabda:  \"Sesungguhnya ia (sumpah kelima) mendatangkan azab ke atas pendusta.\""
  },
  {
    "id": 18215,
    "hadith_number": 3479,
    "tajuk_hadith": "Perceraian Pasangan yang Melakukan Li'an",
    "perawi_melayu": "'Abdul-Malik bin Abi Sulaiman berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ، قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، يَقُولُ سُئِلْتُ عَنِ الْمُتَلاَعِنَيْنِ، فِي إِمَارَةِ ابْنِ الزُّبَيْرِ أَيُفَرَّقُ بَيْنَهُمَا فَمَا دَرَيْتُ مَا أَقُولُ فَقُمْتُ مِنْ مَقَامِي إِلَى مَنْزِلِ ابْنِ عُمَرَ فَقُلْتُ يَا أَبَا عَبْدِ الرَّحْمَنِ الْمُتَلاَعِنَيْنِ أَيُفَرَّقُ بَيْنَهُمَا قَالَ نَعَمْ ‏.‏ سُبْحَانَ اللَّهِ إِنَّ أَوَّلَ مَنْ سَأَلَ عَنْ ذَلِكَ فُلاَنُ بْنُ فُلاَنٍ فَقَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ - وَلَمْ يَقُلْ عَمْرٌو أَرَأَيْتَ - الرَّجُلَ مِنَّا يَرَى عَلَى امْرَأَتِهِ فَاحِشَةً إِنْ تَكَلَّمَ فَأَمْرٌ عَظِيمٌ - وَقَالَ عَمْرٌو أَتَى أَمْرًا عَظِيمًا - وَإِنْ سَكَتَ سَكَتَ عَلَى مِثْلِ ذَلِكَ ‏.‏ فَلَمْ يُجِبْهُ فَلَمَّا كَانَ بَعْدَ ذَلِكَ أَتَاهُ فَقَالَ إِنَّ الأَمْرَ الَّذِي سَأَلْتُكَ ابْتُلِيتُ بِهِ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ هَؤُلاَءِ الآيَاتِ فِي سُورَةِ النُّورِ ‏{‏ وَالَّذِينَ يَرْمُونَ أَزْوَاجَهُمْ ‏}‏ حَتَّى بَلَغَ ‏{‏ وَالْخَامِسَةَ أَنَّ غَضَبَ اللَّهِ عَلَيْهَا إِنْ كَانَ مِنَ الصَّادِقِينَ ‏}‏ فَبَدَأَ بِالرَّجُلِ فَوَعَظَهُ وَذَكَّرَهُ وَأَخْبَرَهُ أَنَّ عَذَابَ الدُّنْيَا أَهْوَنُ مِنْ عَذَابِ الآخِرَةِ فَقَالَ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا كَذَبْتُ ‏.‏ ثُمَّ ثَنَّى بِالْمَرْأَةِ فَوَعَظَهَا وَذَكَّرَهَا فَقَالَتْ وَالَّذِي بَعَثَكَ بِالْحَقِّ إِنَّهُ لَكَاذِبٌ فَبَدَأَ بِالرَّجُلِ فَشَهِدَ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ إِنَّهُ لَمِنَ الصَّادِقِينَ وَالْخَامِسَةُ أَنَّ لَعْنَةَ اللَّهِ عَلَيْهِ إِنْ كَانَ مِنَ الْكَاذِبِينَ ثُمَّ ثَنَّى بِالْمَرْأَةِ فَشَهِدَتْ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ إِنَّهُ لَمِنَ الْكَاذِبِينَ وَالْخَامِسَةَ أَنَّ غَضَبَ اللَّهِ عَلَيْهَا إِنْ كَانَ مِنَ الصَّادِقِينَ فَفَرَّقَ بَيْنَهُمَا ‏.‏",
    "malay_translation": "Kami diberitahu oleh Amru bin Ali dan Muhammad bin Muthanna, mereka berdua berkata: “Kami diberitahu oleh Yahya bin Saeed, beliau berkata: “Kami diberitahu oleh Abdul Malik bin Abi Sulaiman, beliau berkata: Saya mendengar Said bin Jubair berkata: Saya ditanya tentang dua orang yang melakukan li'an pada zaman pemerintahan Ibnu Zubair, patutkah mereka dipisahkan? Saya tidak tahu apa yang harus saya katakan, maka saya pergi ke rumah Ibnu Umar lalu berkata: Wahai Abu Abdur Rahman, patutkah dua orang yang melakukan li'an dipisahkan? Beliau berkata: Ya. Maha Suci Allah! Orang yang pertama kali bertanya tentang hal itu ialah fulan bin fulan. Beliau bertanya: Wahai Rasulullah, bagaimana pendapat anda jika seseorang di antara kami melihat isterinya melakukan perbuatan keji, jika dia bercakap, itu adalah satu perkara yang besar, dan jika dia diam, dia juga berdiam diri terhadap perkara yang besar?  Baginda tidak menjawabnya. Kemudian, setelah itu dia datang lagi kepada baginda dan berkata: Saya diuji dengan perkara yang saya tanyakan itu, lalu Allah SWT menurunkan ayat-ayat ini dalam Surah An-Nur: {…dan orang-orang yang menuduh isteri-isteri mereka…} sehingga sampai kepada ayat: {…dan yang kelima ialah bahawa kemurkaan Allah akan menimpa wanita itu jika suaminya adalah daripada orang-orang yang benar.} Maka Nabi SAW mula dengan lelaki itu, memberi nasihat dan peringatan kepadanya serta memberitahu bahawa azab dunia adalah lebih ringan daripada azab akhirat. Lelaki itu berkata: Demi Tuhan yang telah mengutusmu dengan kebenaran, sesungguhnya aku tidak berdusta. Kemudian, Nabi SAW menasihati dan memberi peringatan kepada wanita itu. Wanita itu berkata: Demi Tuhan yang telah mengutusmu dengan kebenaran, sesungguhnya dia berdusta.  Maka Nabi SAW mula dengan lelaki itu, dia bersaksi empat kali demi Allah bahawa dia adalah daripada orang-orang yang benar, dan yang kelima, dia memohon laknat Allah ke atas dirinya jika dia berdusta.  Kemudian Nabi SAW kepada wanita itu, dia bersaksi empat kali demi Allah bahawa dia adalah daripada orang-orang yang berdusta, dan yang kelima, dia memohon kemurkaan Allah ke atas dirinya jika suaminya adalah daripada orang-orang yang benar.  Maka Nabi SAW memisahkan mereka.”"
  },
  {
    "id": 18216,
    "hadith_number": 3480,
    "tajuk_hadith": "Al-Mus'ab dan Perpisahan Pasangan yang Berli'an",
    "perawi_melayu": "Daripada Said bin Jubair berkata:",
    "english_text": "\"Al-Mus'ab did not separate the two who engaged in Li'an.\" Sa'eed said: \"I mentioned that to Ibn 'Umar and he said: 'The Messenger of Allah separated the couple from Banu 'Ajlan.'\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، - وَاللَّفْظُ لَهُ - قَالاَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ عَزْرَةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ لَمْ يُفَرِّقِ الْمُصْعَبُ بَيْنَ الْمُتَلاَعِنَيْنِ ‏.‏ قَالَ سَعِيدٌ فَذَكَرْتُ ذَلِكَ لاِبْنِ عُمَرَ فَقَالَ فَرَّقَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ أَخَوَىْ بَنِي الْعَجْلاَنِ ‏.‏",
    "malay_translation": "Al-Mus'ab tidak memisahkan pasangan yang melakukan li'an. Said berkata: \"Saya menyebutkannya kepada Ibnu Umar, lalu beliau berkata:  'Rasulullah SAW telah memisahkan pasangan daripada Bani Ajlan.'"
  },
  {
    "id": 18217,
    "hadith_number": 3481,
    "tajuk_hadith": "Perceraian Akibat Tuduhan Palsu",
    "perawi_melayu": "Daripada Ayyub, bahawa Said bin Jubair berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ، عَنْ أَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ قُلْتُ لاِبْنِ عُمَرَ رَجُلٌ قَذَفَ امْرَأَتَهُ ‏.‏ قَالَ فَرَّقَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ أَخَوَىْ بَنِي الْعَجْلاَنِ وَقَالَ ‏\"‏ اللَّهُ يَعْلَمُ إِنَّ أَحَدَكُمَا كَاذِبٌ فَهَلْ مِنْكُمَا تَائِبٌ ‏\"‏ ‏.‏ قَالَ لَهُمَا ثَلاَثًا فَأَبَيَا فَفَرَّقَ بَيْنَهُمَا ‏.‏ قَالَ أَيُّوبُ وَقَالَ عَمْرُو بْنُ دِينَارٍ إِنَّ فِي هَذَا الْحَدِيثِ شَيْئًا لاَ أَرَاكَ تُحَدِّثُ بِهِ قَالَ قَالَ الرَّجُلُ مَالِي قَالَ ‏\"‏ لاَ مَالَ لَكَ إِنْ كُنْتَ صَادِقًا فَقَدْ دَخَلْتَ بِهَا وَإِنْ كُنْتَ كَاذِبًا فَهِيَ أَبْعَدُ مِنْكَ ‏\"‏ ‏.‏",
    "malay_translation": "Ziyad bin Ayyub telah memberitahu kami, katanya: Ibn 'Ulayyah telah menceritakan kepada kami, daripada Ayyub, daripada Sa'id bin Jubair, katanya: Aku berkata kepada Ibnu Umar, \"Seorang lelaki menuduh isterinya.\" Dia berkata: \"Rasulullah SAW telah memisahkan dua orang saudara daripada Bani 'Ajlan dan berkata, \"Allah SWT mengetahui bahawa salah seorang daripada kamu adalah pendusta. Adakah di antara kamu yang bertaubat?\" Beliau berkata demikian kepada mereka sebanyak tiga kali, tetapi mereka enggan bertaubat, maka baginda memisahkan mereka.\" Ayyub berkata: Amr bin Dinar berkata, \"Di dalam hadis ini ada sesuatu yang aku rasa engkau tidak ceritakan.\" Dia berkata: Lelaki itu berkata: \"Hartaku.\" Baginda berkata: \"Engkau tidak berhak ke atas harta itu. Jika engkau benar, maka engkau telah mengahwininya, dan jika engkau berdusta, maka harta itu lebih jauh darimu.\""
  },
  {
    "id": 18218,
    "hadith_number": 3482,
    "tajuk_hadith": "Hukum Li'an",
    "perawi_melayu": "Ia diriwayatkan bahawa 'Amr berkata:",
    "english_text": "\"I heard Sa'eed bin Jubair say: 'I asked Ibn 'Umar about the two who engage in Li'an. He said: 'The Messenger of Allah said to the two who engaged in Li'an: Your reckoning will be with Allah. One of you is lying, and you cannot stay with her. He said: O Messenger of Allah, my wealth! He said: You are not entitled to any wealth. If you are telling the truth about her, then it is in return for having been allowed intimacy with her, and if you are lying then you are even less entitled to it.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، يَقُولُ سَأَلْتُ ابْنَ عُمَرَ عَنِ الْمُتَلاَعِنَيْنِ، فَقَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِلْمُتَلاَعِنَيْنِ ‏\"‏ حِسَابُكُمَا عَلَى اللَّهِ أَحَدُكُمَا كَاذِبٌ وَلاَ سَبِيلَ لَكَ عَلَيْهَا ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ مَالِي قَالَ ‏\"‏ لاَ مَالَ لَكَ إِنْ كُنْتَ صَدَقْتَ عَلَيْهَا فَهُوَ بِمَا اسْتَحْلَلْتَ مِنْ فَرْجِهَا وَإِنْ كُنْتَ كَذَبْتَ عَلَيْهَا فَذَاكَ أَبْعَدُ لَكَ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Said bin Jubair berkata, 'Aku bertanya kepada Ibnu Umar tentang dua orang yang melakukan li'an.  Beliau menjawab, “Rasulullah SAW bersabda kepada dua orang yang melakukan li’an:  Perhitungan kamu berdua di sisi Allah. Salah seorang daripada kamu berdua adalah pendusta, dan kamu tidak mempunyai hak ke atasnya.”  Dia berkata, “Wahai Rasulullah, harta saya?” Baginda menjawab, “Tidak ada harta untukmu. Jika kamu benar tentang dia, maka ia adalah balasan kerana telah dihalalkan kemesraan dengannya, dan jika kamu berdusta tentang dia, maka kamu lebih tidak berhak ke atasnya.”'"
  },
  {
    "id": 18219,
    "hadith_number": 3483,
    "tajuk_hadith": "Li'an dan Pemisahan Pasangan",
    "perawi_melayu": "Daripada Ibnu Umar, katanya:",
    "english_text": "\"The Messenger of Allah conducted the procedure of Li'an between a man and his wife, and he separated them and attributed the child to his mother.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ لاَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ رَجُلٍ وَامْرَأَتِهِ وَفَرَّقَ بَيْنَهُمَا وَأَلْحَقَ الْوَلَدَ بِالأُمِّ ‏.‏",
    "malay_translation": "Rasulullah SAW telah menjalankan prosedur Li'an di antara seorang lelaki dan isterinya, lalu Baginda memisahkan mereka dan mengaitkan anak kepada ibunya."
  },
  {
    "id": 18220,
    "hadith_number": 3484,
    "tajuk_hadith": "Keturunan dan Warna Kulit",
    "perawi_melayu": "Dari Abu Hurairah, bahawa seorang lelaki dari Bani Fazara datang kepada Rasulullah dan berkata:",
    "english_text": "\"My wife has given birth to a black boy.\" The Messenger of Allah said: \"Do you have camels?\" He said: \"Yes.\" He said: \"What color are they?\" He said: \"Red.\" He said: \"Are there any gray ones among them?\" He said: \"There are some gray ones among them.\" He said: \"Where do you think they come from?\" He said: \"Perhaps it is hereditary.\" He said: \"Likewise, perhaps this is hereditary.\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً، مِنْ بَنِي فَزَارَةَ أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنَّ امْرَأَتِي وَلَدَتْ غُلاَمًا أَسْوَدَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلْ لَكَ مِنْ إِبِلٍ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ فَمَا أَلْوَانُهَا ‏\"‏ ‏.‏ قَالَ حُمْرٌ ‏.‏ قَالَ ‏\"‏ فَهَلْ فِيهَا مِنْ أَوْرَقَ ‏\"‏ ‏.‏ قَالَ إِنَّ فِيهَا لَوُرْقًا ‏.‏ قَالَ ‏\"‏ فَأَنَّى تَرَى أَتَى ذَلِكَ ‏\"‏ ‏.‏ قَالَ عَسَى أَنْ يَكُونَ نَزَعَهُ عِرْقٌ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَهَذَا عَسَى أَنْ يَكُونَ نَزَعَهُ عِرْقٌ ‏\"‏ ‏.‏",
    "malay_translation": "“Isteriku telah melahirkan seorang bayi lelaki berkulit hitam.”  Rasulullah SAW bersabda, “Adakah engkau mempunyai unta?” Lelaki itu menjawab, “Ya.” Rasulullah SAW bertanya lagi, “Apakah warna unta-untamu?” Jawabnya, “Merah.” Rasulullah SAW bertanya lagi, “Adakah di antaranya yang berwarna kelabu?” Jawabnya, “Ya, ada beberapa ekor yang berwarna kelabu.” Rasulullah SAW bertanya lagi, “Dari manakah menurut pendapatmu warna kelabu itu datang?” Jawabnya, “Mungkin ia keturunan.” Rasulullah SAW bersabda, “Begitu juga, mungkin ini juga keturunan.”"
  },
  {
    "id": 18221,
    "hadith_number": 3485,
    "tajuk_hadith": "Anak Kulit Hitam dan Persoalan Keturunan",
    "perawi_melayu": "Daripada Abu Hurairah ra.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ رَجُلٌ مِنْ بَنِي فَزَارَةَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ إِنَّ امْرَأَتِي وَلَدَتْ غُلاَمًا أَسْوَدَ ‏.‏ وَهُوَ يُرِيدُ الاِنْتِفَاءَ مِنْهُ ‏.‏ فَقَالَ ‏\"‏ هَلْ لَكَ مِنْ إِبِلٍ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ مَا أَلْوَانُهَا ‏\"‏ ‏.‏ قَالَ حُمْرٌ ‏.‏ قَالَ ‏\"‏ هَلْ فِيهَا مِنْ أَوْرَقَ ‏\"‏ ‏.‏ قَالَ فِيهَا ذَوْدٌ وُرْقٌ ‏.‏ قَالَ ‏\"‏ فَمَا ذَاكَ تُرَى ‏\"‏ ‏.‏ قَالَ لَعَلَّهُ أَنْ يَكُونَ نَزَعَهَا عِرْقٌ ‏.‏ قَالَ ‏\"‏ فَلَعَلَّ هَذَا أَنْ يَكُونَ نَزَعَهُ عِرْقٌ ‏\"‏ ‏.‏ قَالَ فَلَمْ يُرَخِّصْ لَهُ فِي الاِنْتِفَاءِ مِنْهُ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Abdullah bin Bazie’, dia berkata; telah menceritakan kepada kami Yazid bin Zurai’, dia berkata; telah menceritakan kepada kami Ma’mar daripada Az-Zuhri, daripada Said bin Musayyab, daripada Abu Hurairah r.a., bahawa seorang lelaki dari Bani Fazzarah datang kepada Nabi SAW, lalu berkata: “Isteriku telah melahirkan seorang anak lelaki yang berkulit hitam.” Dan dia ingin menyangkal anak tersebut. Lalu Nabi SAW bertanya: “Adakah engkau mempunyai unta?” Lelaki itu menjawab: “Ya.” Nabi SAW bertanya lagi: “Apakah warna unta-untamu itu?” Lelaki itu menjawab: “Berwarna merah.” Nabi SAW bertanya lagi: “Adakah di antaranya yang berwarna kelabu?” Lelaki itu menjawab: “Ya, ada beberapa ekor yang berwarna kelabu.” Nabi SAW bertanya lagi: “Mengapa demikian menurut pendapatmu?” Lelaki itu menjawab: “Mungkin ia disebabkan keturunan.” Nabi SAW bersabda: “Maka mungkin juga anak ini disebabkan keturunan.” Lalu Nabi SAW tidak membenarkannya untuk menyangkal anaknya itu."
  },
  {
    "id": 18222,
    "hadith_number": 3486,
    "tajuk_hadith": "Anak Lelaki Kulit Hitam dan Hukum Menafikan Anak",
    "perawi_melayu": "Daripada Abu Hurairah",
    "english_text": "\"While we were with the Prophet, a man stood up and said: 'O Messenger of Allah, a black boy has been born to me.' The Messenger of Allah said: 'How did that happen?' He said: 'I do not know.' He said: 'Do you have camels?' He said: 'Yes.' He said: 'What color are they?' He said: 'Red.' He said: 'Are there any gray camels among them?' He said: 'There are some gray camels among them.' He said: 'Where do they come from?' He said: 'I do not know, O Allah's Messenger! Perhaps it is hereditary.' He said: 'Perhaps this is also hereditary.' Because of this, the Messenger of Allah decreed the following: 'It is not allowed for a man, to disown a child who was born on his bed, unless he claimed that he had seen an immoral act (Fahishah).'\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ الْمُغِيرَةِ، قَالَ حَدَّثَنَا أَبُو حَيْوَةَ، - حِمْصِيٌّ - قَالَ حَدَّثَنَا شُعَيْبُ بْنُ أَبِي حَمْزَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ بَيْنَمَا نَحْنُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم قَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي وُلِدَ لِي غُلاَمٌ أَسْوَدُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَأَنَّى كَانَ ذَلِكَ ‏\"‏ ‏.‏ قَالَ مَا أَدْرِي قَالَ ‏\"‏ فَهَلْ لَكَ مِنْ إِبِلٍ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ فَمَا أَلْوَانُهَا ‏\"‏ ‏.‏ قَالَ حُمْرٌ ‏.‏ قَالَ ‏\"‏ فَهَلْ فِيهَا جَمَلٌ أَوْرَقُ ‏\"‏ ‏.‏ قَالَ فِيهَا إِبِلٌ وُرْقٌ ‏.‏ قَالَ ‏\"‏ فَأَنَّى كَانَ ذَلِكَ ‏\"‏ ‏.‏ قَالَ مَا أَدْرِي يَا رَسُولَ اللَّهِ إِلاَّ أَنْ يَكُونَ نَزَعَهُ عِرْقٌ ‏.‏ قَالَ ‏\"‏ وَهَذَا لَعَلَّهُ نَزَعَهُ عِرْقٌ ‏\"‏ ‏.‏ فَمِنْ أَجْلِهِ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم هَذَا لاَ يَجُوزُ لِرَجُلٍ أَنْ يَنْتَفِيَ مِنْ وَلَدٍ وُلِدَ عَلَى فِرَاشِهِ إِلاَّ أَنْ يَزْعُمَ أَنَّهُ رَأَى فَاحِشَةً ‏.‏",
    "malay_translation": "Ketika kami bersama Rasulullah SAW, seorang lelaki bangun dan berkata, \"Wahai Rasulullah, seorang anak lelaki berkulit hitam telah lahir kepadaku.\" Rasulullah SAW bertanya, \"Bagaimana hal itu terjadi?\" Lelaki itu menjawab, \"Saya tidak tahu.\" Rasulullah SAW bertanya lagi, \"Adakah kamu mempunyai unta?\" Lelaki itu menjawab, \"Ya.\" Rasulullah SAW bertanya, \"Apakah warnanya?\" Lelaki itu menjawab, \"Merah.\" Rasulullah SAW bertanya lagi, \"Adakah di antaranya unta yang berwarna kelabu?\" Lelaki itu menjawab, \"Ya, ada beberapa unta kelabu.\" Rasulullah SAW bertanya, \"Dari manakah unta-unta itu?\" Lelaki itu menjawab, \"Saya tidak tahu, wahai Rasulullah! Mungkin ia keturunan.\" Rasulullah SAW berkata, \"Mungkin ini juga keturunan.\"  Atas sebab itulah, Rasulullah SAW menetapkan hukum: \"Tidak dibenarkan bagi seorang lelaki untuk menafikan anak yang lahir di ranjangnya, kecuali jika dia mendakwa telah melihat perbuatan keji (Fahishah).\""
  },
  {
    "id": 18223,
    "hadith_number": 3487,
    "tajuk_hadith": "Fitnah Menuduh Orang Lain dan Menafikan Anak Sendiri",
    "perawi_melayu": "Daripada Abu Hurairah, bahawa baginda mendengar Rasulullah SAW bersabda ketika ayat Mualanat diturunkan:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ، قَالَ شُعَيْبٌ قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ الْهَادِ، عَنْ عَبْدِ اللَّهِ بْنِ يُونُسَ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ حِينَ نَزَلَتْ آيَةُ الْمُلاَعَنَةِ ‏\n\"‏ أَيُّمَا امْرَأَةٍ أَدْخَلَتْ عَلَى قَوْمٍ رَجُلاً لَيْسَ مِنْهُمْ فَلَيْسَتْ مِنَ اللَّهِ فِي شَىْءٍ وَلاَ يُدْخِلُهَا اللَّهُ جَنَّتَهُ وَأَيُّمَا رَجُلٍ جَحَدَ وَلَدَهُ وَهُوَ يَنْظُرُ إِلَيْهِ احْتَجَبَ اللَّهُ عَزَّ وَجَلَّ مِنْهُ وَفَضَحَهُ عَلَى رُءُوسِ الأَوَّلِينَ وَالآخِرِينَ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Sebarang wanita yang menuduh seorang lelaki kepada kaum yang bukan kaumnya, maka dia tidak mendapat apa-apa daripada Allah dan Allah SWT tidak akan memasukkannya ke dalam syurga. Dan sesiapa lelaki yang menafikan anaknya sendiri sedangkan dia melihat anaknya (dan mengetahui bahawa anak itu adalah anaknya), maka Allah SWT akan menjauhkan diri daripada lelaki itu dan akan mempermalukannya di hadapan manusia terdahulu dan kemudian pada hari kiamat."
  },
  {
    "id": 18224,
    "hadith_number": 3488,
    "tajuk_hadith": "Anak Adalah Kepada Katil, dan Bagi Pezina Adalah Batu",
    "perawi_melayu": "Daripada Abu Hurairah, bahawa Nabi SAW bersabda:",
    "english_text": "\"The child is the bed's and for the fornicator is the stone.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، وَأَبِي، سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ ‏\"‏ ‏.‏",
    "malay_translation": "Anak adalah untuk tempat tidur (suami isteri), dan bagi pezina adalah hukuman rejam dengan batu."
  },
  {
    "id": 18225,
    "hadith_number": 3489,
    "tajuk_hadith": "Anak Adalah Kepada Katil, Dan Bagi Pezina Adalah Batu",
    "perawi_melayu": "Daripada Abu Hurairah, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"The child is the bed's and for the fornicator is the stone.\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّزَّاقِ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، وَأَبِي، سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ ‏\"‏ ‏.‏",
    "malay_translation": "Anak adalah kepada tempat tidur (suami isteri), dan bagi pezina adalah hukuman rejam dengan batu."
  },
  {
    "id": 18226,
    "hadith_number": 3490,
    "tajuk_hadith": "Pertikaian Anak Lelaki dan Hukuman bagi Perzinaan",
    "perawi_melayu": "Daripada Aisyah r.a.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتِ اخْتَصَمَ سَعْدُ بْنُ أَبِي وَقَّاصٍ وَعَبْدُ بْنُ زَمْعَةَ فِي غُلاَمٍ فَقَالَ سَعْدٌ هَذَا يَا رَسُولَ اللَّهِ ابْنُ أَخِي عُتْبَةَ بْنِ أَبِي وَقَّاصٍ عَهِدَ إِلَىَّ أَنَّهُ ابْنُهُ انْظُرْ إِلَى شَبَهِهِ ‏.‏ وَقَالَ عَبْدُ بْنُ زَمْعَةَ أَخِي وُلِدَ عَلَى فِرَاشِ أَبِي مِنْ وَلِيدَتِهِ ‏.‏ فَنَظَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى شَبَهِهِ فَرَأَى شَبَهًا بَيِّنًا بِعُتْبَةَ فَقَالَ ‏\n\"‏ هُوَ لَكَ يَا عَبْدُ الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ وَاحْتَجِبِي مِنْهُ يَا سَوْدَةُ بِنْتَ زَمْعَةَ ‏\"‏ ‏.‏ فَلَمْ يَرَ سَوْدَةَ قَطُّ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah, katanya; telah menceritakan kepada kami Laits, daripada Ibnu Syihab, daripada Urwah, daripada Aisyah r.a., katanya: Saad bin Abi Waqqas dan Abd bin Zam’ah bertengkar mengenai seorang budak lelaki. Saad berkata: “Wahai Rasulullah, ini anak saudara saya, Utbah bin Abi Waqqas. Dia telah berjanji kepada saya untuk menjaga anak ini kerana dia adalah anaknya. Lihatlah kepada siapa dia menyerupai.” Abd bin Zam’ah berkata: “Dia adalah saudara lelaki saya yang dilahirkan di atas tilam ayah saya daripada hamba perempuannya.”  Rasulullah s.a.w. melihat kepada rupa budak itu dan mendapati dia seakan-akan Utbah. Baginda bersabda: “Dia adalah untukmu wahai Abd. Anak itu adalah untuk tempat tidur (bapa kandungnya) dan bagi pezina adalah hukuman rejam. Jauhkan diri daripada dia, wahai Saudah binti Zam’ah.”  Kemudian Baginda tidak pernah lagi melihat Saudah."
  },
  {
    "id": 18227,
    "hadith_number": 3491,
    "tajuk_hadith": "Anak adalah milik suami isteri",
    "perawi_melayu": "Daripada Abdullah bin Az-Zubair",
    "english_text": "\"Zam'ah had a slave woman with whom he used to have intercourse, but he suspected that someone else was also having intercourse with her. She gave birth to a child who resembled the one whom he suspected. Zam'ah died when she was pregnant, and Sawdah mentioned that to the Messenger of Allah. The Messenger of Allah said: 'The child is the bed's, but veil yourself from him, O Sawdah, for he is not a brother of yours.'\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنْ يُوسُفَ بْنِ الزُّبَيْرِ، - مَوْلًى لَهُمْ - عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، قَالَ كَانَتْ لِزَمْعَةَ جَارِيَةٌ يَطَؤُهَا هُوَ وَكَانَ يَظُنُّ بِآخَرَ يَقَعُ عَلَيْهَا فَجَاءَتْ بِوَلَدٍ شِبْهِ الَّذِي كَانَ يَظُنُّ بِهِ فَمَاتَ زَمْعَةُ وَهِيَ حُبْلَى فَذَكَرَتْ ذَلِكَ سَوْدَةُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْوَلَدُ لِلْفِرَاشِ وَاحْتَجِبِي مِنْهُ يَا سَوْدَةُ فَلَيْسَ لَكِ بِأَخٍ ‏\"‏",
    "malay_translation": "Zam'ah mempunyai seorang hamba perempuan yang menjadi isterinya, tetapi dia menyangka orang lain turut mengahwininya.  Hamba perempuan itu melahirkan seorang anak yang rupa parasnya seakan-akan lelaki yang disangkanya. Zam'ah meninggal dunia ketika hamba perempuan itu sedang hamil.  Sawdah menceritakan hal ini kepada Rasulullah SAW.  Rasulullah SAW bersabda:  \"Anak itu adalah milik suami isteri.  Wahai Sawdah, jauhkanlah diri darinya, kerana dia bukanlah saudara kandungmu.\""
  },
  {
    "id": 18228,
    "hadith_number": 3492,
    "tajuk_hadith": "Anak Adalah Kepada Katilnya, Dan Bagi Pezina Adalah Batu",
    "perawi_melayu": "Daripada Abdullah bahawa Rasulullah SAW bersabda:",
    "english_text": "\"The child is the bed's, and for the fornicator is the stone.\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مُغِيرَةَ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ وَلاَ أَحْسُبُ هَذَا عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ وَاللَّهُ تَعَالَى أَعْلَمُ ‏.‏",
    "malay_translation": "Daripada Abdullah bahawa Rasulullah SAW bersabda:  \"Anak adalah milik katil (suaminya), dan bagi pezina adalah hukuman rejam (dengan batu).\""
  },
  {
    "id": 18229,
    "hadith_number": 3493,
    "tajuk_hadith": "Anak kepada tempat tidur",
    "perawi_melayu": "Daripada Aisyah r.a.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتِ اخْتَصَمَ سَعْدُ بْنُ أَبِي وَقَّاصٍ وَعَبْدُ بْنُ زَمْعَةَ فِي ابْنِ زَمْعَةَ قَالَ سَعْدٌ أَوْصَانِي أَخِي عُتْبَةُ إِذَا قَدِمْتَ مَكَّةَ فَانْظُرِ ابْنَ وَلِيدَةِ زَمْعَةَ فَهُوَ ابْنِي ‏.‏ فَقَالَ عَبْدُ بْنُ زَمْعَةَ هُوَ ابْنُ أَمَةِ أَبِي وُلِدَ عَلَى فِرَاشِ أَبِي ‏.‏ فَرَأَى رَسُولُ اللَّهِ صلى الله عليه وسلم شَبَهًا بَيِّنًا بِعُتْبَةَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْوَلَدُ لِلْفِرَاشِ وَاحْتَجِبِي مِنْهُ يَا سَوْدَةُ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ishaq bin Ibrahim, katanya; telah menceritakan kepada kami Sufyan, daripada Zuhri, daripada Urwah, daripada Aisyah r.a., katanya: Saad bin Abi Waqas dan Abd bin Zam'ah telah berselisih faham mengenai anak Zam'ah. Saad berkata: 'Abangku Utbah telah wasiat kepadaku, jika engkau sampai ke Mekah, maka carilah anak perempuan hamba Zam'ah, kerana dia adalah anakku.' Abd bin Zam'ah berkata: 'Dia adalah anak perempuan hamba bapaku yang dilahirkan di atas katil bapaku.'  Maka Rasulullah SAW melihat adanya persamaan yang jelas dengan Utbah, lalu Rasulullah SAW bersabda: \"Anak itu adalah milik tempat tidur (suami isteri yang berkahwin).  Wahai Saudah, jauhkan dirimu darinya.\""
  },
  {
    "id": 18230,
    "hadith_number": 3494,
    "tajuk_hadith": "Ali dan Tiga Lelaki yang Berhubungan dengan Wanita dalam Satu Kitaran Haid",
    "perawi_melayu": "Daripada Zaid bin Arqam, Baginda berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ، خُشَيْشُ بْنُ أَصْرَمَ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَنْبَأَنَا الثَّوْرِيُّ، عَنْ صَالِحٍ الْهَمْدَانِيِّ، عَنِ الشَّعْبِيِّ، عَنْ عَبْدِ خَيْرٍ، عَنْ زَيْدِ بْنِ أَرْقَمَ، قَالَ أُتِيَ عَلِيٌّ رضى الله عنه بِثَلاَثَةٍ وَهُوَ بِالْيَمَنِ وَقَعُوا عَلَى امْرَأَةٍ فِي طُهْرٍ وَاحِدٍ فَسَأَلَ اثْنَيْنِ أَتُقِرَّانِ لِهَذَا بِالْوَلَدِ قَالاَ لاَ ‏.‏ ثُمَّ سَأَلَ اثْنَيْنِ أَتُقِرَّانِ لِهَذَا بِالْوَلَدِ قَالاَ لاَ ‏.‏ فَأَقْرَعَ بَيْنَهُمْ فَأَلْحَقَ الْوَلَدَ بِالَّذِي صَارَتْ عَلَيْهِ الْقُرْعَةُ وَجَعَلَ عَلَيْهِ ثُلُثَىِ الدِّيَةِ فَذُكِرَ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu 'Aasim, Khusheesh bin Ashram, berkata: Telah menceritakan kepada kami 'Abdul Razzaq, berkata: Telah menceritakan kepada kami Tsauri, daripada Shaleh al-Hamdani, daripada al-Sya'bi, daripada 'Abd Khair, daripada Zaid bin Arqam, berkata:  Ali رضي الله عنه didatangi oleh tiga orang lelaki ketika beliau berada di Yaman, mereka telah melakukan hubungan seks dengan seorang wanita dalam satu kitaran suci (haid). Maka Ali bertanya kepada dua orang dari mereka: “Adakah kamu mengaku bahawa anak ini daripada (orang ketiga)?” Mereka menjawab: “Tidak.” Kemudian beliau bertanya kepada dua orang lagi: “Adakah kamu mengaku bahawa anak ini daripada (orang ketiga)?” Mereka menjawab: “Tidak.” Maka Ali melakukan undian di antara mereka, lalu dia mengaitkan anak itu kepada orang yang undian jatuh kepadanya, dan memikulkan kepadanya dua pertiga daripada diyat (tebusan).  Kisah ini telah sampai kepada Nabi ﷺ, maka Baginda ketawa sehingga kelihatan gigi geraham Baginda."
  },
  {
    "id": 18231,
    "hadith_number": 3495,
    "tajuk_hadith": "Perselisihan Tentang Anak di Zaman Ali",
    "perawi_melayu": "Daripada Zaid bin Arqam, Baginda berkata:",
    "english_text": "\"While we were with the Messenger of Allah, a man came to him from Yemen and started telling him (about an incident) while 'Ali was still in Yemen. He said: 'O Messenger of Allah, three men were brought to 'Ali who were disputing about a child, and they all had intercourse with a woman during a single menstrual cycle.'\" And he quoted the same Hadith.",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الأَجْلَحِ، عَنِ الشَّعْبِيِّ، قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ أَبِي الْخَلِيلِ الْحَضْرَمِيُّ، عَنْ زَيْدِ بْنِ أَرْقَمَ، قَالَ بَيْنَا نَحْنُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ جَاءَهُ رَجُلٌ مِنَ الْيَمَنِ فَجَعَلَ يُخْبِرُهُ وَيُحَدِّثُهُ وَعَلِيٌّ بِهَا فَقَالَ يَا رَسُولَ اللَّهِ أَتَى عَلِيًّا ثَلاَثَةُ نَفَرٍ يَخْتَصِمُونَ فِي وَلَدٍ وَقَعُوا عَلَى امْرَأَةٍ فِي طُهْرٍ ‏.‏ وَسَاقَ الْحَدِيثَ ‏.‏",
    "malay_translation": "Ketika kami berada di sisi Rasulullah SAW, datanglah seorang lelaki dari Yaman lalu menceritakan satu peristiwa kepada Baginda ketika Ali masih berada di Yaman. Lelaki itu berkata: \"Wahai Rasulullah, tiga orang lelaki telah datang kepada Ali untuk berselisih faham mengenai seorang anak, dan mereka semua telah melakukan hubungan seks dengan seorang wanita dalam satu kitaran haid.\" Kemudian, lelaki itu meriwayatkan hadis yang sama."
  },
  {
    "id": 18232,
    "hadith_number": 3496,
    "tajuk_hadith": "Kisah Ali dan Tiga Lelaki yang Menuntut Anak",
    "perawi_melayu": "Daripada riwayat Zaid bin Arqam:",
    "english_text": "\"I was with the Messenger of Allah, and 'Ali, may Allah be pleased with him, was in Yemen at that time. A man came to him and said: 'I saw 'Ali when three men were brought to him who all claimed (to be the father) of a child. 'Ali said to one of them: Will you give the child up to him? And he refused. He said to (the next one): Will you give the child up to him? And he refused. He said to (the next one): Will you give the child up to him? And he refused. 'Ali said: You are disputing partners. I will cast lots among you, and whoever wins the draw, the child is for him, and he has to pay two-thirds of the Diyah.' The Messenger of Allah laughed so much that his back teeth became visible.\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، عَنِ الأَجْلَحِ، عَنِ الشَّعْبِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي الْخَلِيلِ، عَنْ زَيْدِ بْنِ أَرْقَمَ، قَالَ كُنْتُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم وَعَلِيٌّ رضى الله عنه يَوْمَئِذٍ بِالْيَمَنِ فَأَتَاهُ رَجُلٌ فَقَالَ شَهِدْتُ عَلِيًّا أُتِيَ فِي ثَلاَثَةِ نَفَرٍ ادَّعَوْا وَلَدَ امْرَأَةٍ فَقَالَ عَلِيٌّ لأَحَدِهِمْ تَدَعُهُ لِهَذَا ‏.‏ فَأَبَى وَقَالَ لِهَذَا تَدَعُهُ لِهَذَا ‏.‏ فَأَبَى وَقَالَ لِهَذَا تَدَعُهُ لِهَذَا ‏.‏ فَأَبَى قَالَ عَلِيٌّ رضى الله عنه أَنْتُمْ شُرَكَاءُ مُتَشَاكِسُونَ وَسَأُقْرِعُ بَيْنَكُمْ فَأَيُّكُمْ أَصَابَتْهُ الْقُرْعَةُ فَهُوَ لَهُ وَعَلَيْهِ ثُلُثَا الدِّيَةِ ‏.‏ فَضَحِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى بَدَتْ نَوَاجِذُهُ ‏.‏",
    "malay_translation": "Aku berada bersama Rasulullah SAW, dan Ali r.a ketika itu berada di Yaman. Seorang lelaki datang kepada Baginda dan berkata: 'Aku menyaksikan Ali ketika tiga orang lelaki dibawa kepadanya, mereka semua mendakwa sebagai bapa kepada seorang anak. Ali berkata kepada seorang daripada mereka: “Adakah kamu akan melepaskan anak ini kepadanya?” Dan dia enggan.  Ali bertanya kepada seorang lagi: “Adakah kamu akan melepaskan anak ini kepadanya?” Dan dia enggan.  Ali bertanya kepada seorang lagi: “Adakah kamu akan melepaskan anak ini kepadanya?” Dan dia enggan.  Ali berkata: “Kamu semua adalah rakan kongsi yang berselisih. Aku akan membuat undian di antara kamu, dan sesiapa yang menang undian, anak itu adalah miliknya dan dia perlu membayar dua pertiga daripada diyat.”  Rasulullah SAW ketawa sehingga kelihatan gigi geraham Baginda."
  },
  {
    "id": 18233,
    "hadith_number": 3497,
    "tajuk_hadith": "Kisah Ali di Yaman dan Perselisihan Tiga Orang Mengenai Seorang Kanak-Kanak",
    "perawi_melayu": "Daripada seorang lelaki dari Hadramawt, bahawa Zaid bin Arqam berkata:",
    "english_text": "\"The Messenger of Allah sent 'Ali to (be the governor of) Yemen, and a child was brought to him concerning whom three men were disputing.\" Then he quoted the same Hadith. Salamah bin Kuhail contradicted them.",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ شَاهِينَ، قَالَ حَدَّثَنَا خَالِدٌ، عَنِ الشَّيْبَانِيِّ، عَنِ الشَّعْبِيِّ، عَنْ رَجُلٍ، مِنْ حَضْرَمَوْتَ عَنْ زَيْدِ بْنِ أَرْقَمَ، قَالَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلِيًّا عَلَى الْيَمَنِ فَأُتِيَ بِغُلاَمٍ تَنَازَعَ فِيهِ ثَلاَثَةٌ ‏.‏ وَسَاقَ الْحَدِيثَ ‏.‏ خَالَفَهُمْ سَلَمَةُ بْنُ كُهَيْلٍ ‏.‏",
    "malay_translation": "Rasulullah SAW telah mengutus Ali ke Yaman. Kemudian, seorang kanak-kanak dibawa kepada Ali, dan tiga orang lelaki bertelagah sesama mereka tentang kanak-kanak itu. Kemudian, beliau menyebut hadis yang sama. Salamah bin Kuhail menentang pendapat mereka."
  },
  {
    "id": 18234,
    "hadith_number": 3498,
    "tajuk_hadith": "Perihal Tiga Lelaki Yang Berhubungan Intim Dengan Wanita Yang Sama Semasa Haid",
    "perawi_melayu": "Salmah bin Kuhhail berkata:",
    "english_text": "\"I heard Ash-Sha'bi narrating from Abu Al-Khalil or Ibn Abi Al-Khalil that three men had intercourse (with the same woman) during a single menstrual cycle;\" and he mentioned something similar, but he did not mention Zaid bin Arqam or attribute anything to the Prophet.",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، قَالَ سَمِعْتُ الشَّعْبِيَّ، يُحَدِّثُ عَنْ أَبِي الْخَلِيلِ، أَوِ ابْنِ أَبِي الْخَلِيلِ أَنَّ ثَلاَثَةَ، نَفَرٍ اشْتَرَكُوا فِي طُهْرٍ فَذَكَرَ نَحْوَهُ وَلَمْ يَذْكُرْ زَيْدَ بْنَ أَرْقَمَ وَلَمْ يَرْفَعْهُ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا صَوَابٌ وَاللَّهُ سُبْحَانَهُ وَتَعَالَى أَعْلَمُ ‏.‏",
    "malay_translation": "Aku mendengar Al-Sya'bi meriwayatkan dari Abu Al-Khalil atau Ibnu Abi Al-Khalil bahawa tiga orang lelaki telah melakukan hubungan intim (dengan wanita yang sama) dalam satu kitaran haid; dan beliau menyebut perkara yang hampir sama, tetapi beliau tidak menyebut Zaid bin Arqam atau mengaitkannya dengan Nabi."
  },
  {
    "id": 18235,
    "hadith_number": 3499,
    "tajuk_hadith": "Kegembiraan Rasulullah dan Perumpamaan Kaki",
    "perawi_melayu": "Daripada Aisyah r.a.",
    "english_text": "\"The Messenger of Allah came to me looking happy and cheerful, and he said: 'Did you not see that Mujazziz looked at Zaid bin Harithah and Usamah and said: These feet belong to one another.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ عَلَىَّ مَسْرُورًا تَبْرُقُ أَسَارِيرُ وَجْهِهِ فَقَالَ ‏\n\"‏ أَلَمْ تَرَىْ أَنَّ مُجَزِّزًا نَظَرَ إِلَى زَيْدِ بْنِ حَارِثَةَ وَأُسَامَةَ فَقَالَ إِنَّ بَعْضَ هَذِهِ الأَقْدَامِ لَمِنْ بَعْضٍ ‏\"‏ ‏.‏",
    "malay_translation": "Aisyah r.a. berkata: Rasulullah SAW masuk ke rumahku dalam keadaan gembira dan wajahnya berseri-seri. Baginda bersabda: \"Tidakkah kamu lihat bagaimana Mujazziz melihat Zaid bin Harithah dan Usamah, lalu berkata: Sesungguhnya kaki-kaki ini adalah daripada satu keluarga.\""
  },
  {
    "id": 18236,
    "hadith_number": 3500,
    "tajuk_hadith": "Kisah Rasulullah SAW dan Mujazziz Al-Mudliji",
    "perawi_melayu": "Daripada Aisyah r.a., katanya:",
    "english_text": "\"The Messenger of Allah came to me one day looking happy and said: 'O 'Aishah! Did you not see that Mujazziz Al-Mudliji came to me when Usamah bin Zaid was with me. He saw Usamah bin Zaid and Zaid with a blanket over them; their heads were covered but their feet were exposed, and he said: These feet belong to one another.'\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، رضى الله عنها قَالَتْ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ مَسْرُورًا فَقَالَ ‏\n\"‏ يَا عَائِشَةُ أَلَمْ تَرَىْ أَنَّ مُجَزِّزًا الْمُدْلِجِيَّ دَخَلَ عَلَىَّ وَعِنْدِي أُسَامَةُ بْنُ زَيْدٍ فَرَأَى أُسَامَةَ بْنَ زَيْدٍ وَزَيْدًا وَعَلَيْهِمَا قَطِيفَةٌ وَقَدْ غَطَّيَا رُءُوسَهُمَا وَبَدَتْ أَقْدَامُهُمَا فَقَالَ هَذِهِ أَقْدَامٌ بَعْضُهَا مِنْ بَعْضٍ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW datang kepada saya suatu hari dalam keadaan gembira, lalu baginda bersabda: \"Wahai Aisyah! Tidakkah engkau lihat bahawa Mujazziz Al-Mudliji telah datang menjengukku ketika Usamah bin Zaid berada bersamaku. Dia melihat Usamah bin Zaid dan Zaid yang sedang berselimutkan kain tebal; kepala mereka tertutup tetapi kaki mereka terdedah, lalu dia berkata: \"Kaki-kaki ini sepadan antara satu sama lain.\""
  },
  {
    "id": 18237,
    "hadith_number": 3501,
    "tajuk_hadith": "Doa Anak untuk Ibu Bapa",
    "perawi_melayu": "Daripada Abdul-Hamid bin Salamah Al-Ansari, daripada bapanya, daripada datuknya, bahawa dia memeluk Islam tetapi isterinya enggan memeluk Islam.  Seorang anak lelaki mereka yang masih kecil, yang belum baligh, datang, dan Nabi SAW mendudukkan bapa di satu sisi dan ibu di sisi yang lain, dan baginda memberi pilihan kepada anak itu.",
    "english_text": "\"O Allah, guide him,\" and (the child) went to his father.",
    "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عُثْمَانَ الْبَتِّيِّ، عَنْ عَبْدِ الْحَمِيدِ بْنِ سَلَمَةَ الأَنْصَارِيِّ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّهُ أَسْلَمَ وَأَبَتِ امْرَأَتُهُ أَنْ تُسْلِمَ فَجَاءَ ابْنٌ لَهُمَا صَغِيرٌ لَمْ يَبْلُغِ الْحُلُمَ فَأَجْلَسَ النَّبِيُّ صلى الله عليه وسلم الأَبَ هَا هُنَا وَالأُمَّ هَا هُنَا ثُمَّ خَيَّرَهُ فَقَالَ ‏\n\"‏ اللَّهُمَّ اهْدِهِ ‏\"‏ ‏.‏ فَذَهَبَ إِلَى أَبِيهِ ‏.‏",
    "malay_translation": "Baginda berkata:  \"Ya Allah, berilah dia hidayah.\"  Kemudian (anak itu) pergi kepada bapanya."
  },
  {
    "id": 18238,
    "hadith_number": 3502,
    "tajuk_hadith": "Hak Penjagaan Anak dalam Islam",
    "perawi_melayu": "Daripada riwayat Abu Maimunah yang berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي زِيَادٌ، عَنْ هِلاَلِ بْنِ أُسَامَةَ، عَنْ أَبِي مَيْمُونَةَ، قَالَ بَيْنَا أَنَا عِنْدَ أَبِي هُرَيْرَةَ، فَقَالَ إِنَّ امْرَأَةً جَاءَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَتْ فَدَاكَ أَبِي وَأُمِّي إِنَّ زَوْجِي يُرِيدُ أَنْ يَذْهَبَ بِابْنِي وَقَدْ نَفَعَنِي وَسَقَانِي مِنْ بِئْرِ أَبِي عِنَبَةَ ‏.‏ فَجَاءَ زَوْجُهَا وَقَالَ مَنْ يُخَاصِمُنِي فِي ابْنِي فَقَالَ ‏\n\"‏ يَا غُلاَمُ هَذَا أَبُوكَ وَهَذِهِ أُمُّكَ فَخُذْ بِيَدِ أَيِّهِمَا شِئْتَ ‏\"‏ ‏.‏ فَأَخَذَ بِيَدِ أُمِّهِ فَانْطَلَقَتْ بِهِ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Abdul A'la, katanya: Telah menceritakan kepada kami Khalid, katanya: Telah menceritakan kepada kami Ibnu Juraij, katanya: Telah memberitakan kepadaku Ziad, daripada Hilal bin Usamah, daripada Abu Maimunah, katanya:  Ketika aku berada di sisi Abu Hurairah, beliau berkata: “Sesungguhnya seorang wanita datang kepada Rasulullah SAW lalu berkata: “Semoga ayah dan ibuku menjadi tebusan bagimu! Suamiku ingin mengambil anakku, padahal dia telah berbuat baik kepadaku dan memberi minum air kepadaku daripada perigi Abi ‘Inabah.” Kemudian datanglah suaminya dan berkata: “Siapa yang akan berselisih denganku tentang anakku?” Rasulullah SAW bersabda: “Wahai anakku, ini ayahmu dan ini ibumu, maka peganglah tangan mana yang engkau suka.”  Lalu dia memegang tangan ibunya, maka ibunya pergi bersamanya.”"
  },
  {
    "id": 18239,
    "hadith_number": 3503,
    "tajuk_hadith": "Menceraikan Isteri yang Didera",
    "perawi_melayu": "Ar-Rubayy' binti Mu'awwidh bin 'Afra' meriwayatkan bahawa Thabit bin Qais bin Shammas telah memukul isterinya sehingga patah tangannya - isterinya bernama Jamilah binti 'Abdullah bin Ubayy. Abangnya telah mengadu kepada Rasulullah ﷺ, dan Rasulullah ﷺ telah menghantar utusan kepada Thabit dan berkata:",
    "english_text": "\"Take what she owes you and let her go.\" He said: \"Yes.\" And the Messenger of Allah ordered her to wait for one menstrual cycle and then go to her family.",
    "arabic_text": "أَخْبَرَنَا أَبُو عَلِيٍّ، مُحَمَّدُ بْنُ يَحْيَى الْمَرْوَزِيُّ قَالَ أَخْبَرَنِي شَاذَانُ بْنُ عُثْمَانَ، أَخُو عَبْدَانَ قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ الرُّبَيِّعَ بِنْتَ مُعَوِّذِ ابْنِ عَفْرَاءَ، أَخْبَرَتْهُ أَنَّ ثَابِتَ بْنَ قَيْسِ بْنِ شَمَّاسٍ ضَرَبَ امْرَأَتَهُ فَكَسَرَ يَدَهَا وَهِيَ جَمِيلَةُ بِنْتُ عَبْدِ اللَّهِ بْنِ أُبَىٍّ فَأَتَى أَخُوهَا يَشْتَكِيهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَرْسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى ثَابِتٍ فَقَالَ لَهُ ‏\n\"‏ خُذِ الَّذِي لَهَا عَلَيْكَ وَخَلِّ سَبِيلَهَا ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ فَأَمَرَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ تَتَرَبَّصَ حَيْضَةً وَاحِدَةً فَتَلْحَقَ بِأَهْلِهَا ‏.‏",
    "malay_translation": "“Ambillah haknya yang ada padamu dan lepaskanlah dia.” Lelaki itu berkata, “Baik.” Kemudian Rasulullah ﷺ memerintahkan wanita itu menunggu satu kitaran haid, lalu kembali kepada keluarganya."
  },
  {
    "id": 18240,
    "hadith_number": 3504,
    "tajuk_hadith": "Iddah Selepas Khul'",
    "perawi_melayu": "Ubadah bin Al-Walid bin Ubadah bin As-Samit meriwayatkan daripada Rubayy' binti Mu'awwidh.  Baginda berkata:",
    "english_text": "\"I said to her: 'Tell me your Hadith.' She said: 'I was separated from husband by Khul', then I came to 'Uthman and asked him: What 'Iddah do I have to observe? He said: You do not have to observe any 'Iddah, unless you had intercourse with him recently, in which case you should stay with him until you have menstruated. He said: In that I am following the ruling of the Messenger of Allah concerning Mariam Al-Maghaliyyah, who was married to Thabit bin Qais and was separated by Khul' from him.'\"",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ، قَالَ حَدَّثَنَا عَمِّي، قَالَ حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، قَالَ حَدَّثَنِي عُبَادَةُ بْنُ الْوَلِيدِ بْنِ عُبَادَةَ بْنِ الصَّامِتِ، عَنْ رُبَيِّعٍ بِنْتِ مُعَوِّذٍ، قَالَ قُلْتُ لَهَا حَدِّثِينِي حَدِيثَكِ، ‏.‏ قَالَتِ اخْتَلَعْتُ مِنْ زَوْجِي ثُمَّ جِئْتُ عُثْمَانَ فَسَأَلْتُهُ مَاذَا عَلَىَّ مِنَ الْعِدَّةِ فَقَالَ لاَ عِدَّةَ عَلَيْكِ إِلاَّ أَنْ تَكُونِي حَدِيثَةَ عَهْدٍ بِهِ فَتَمْكُثِي حَتَّى تَحِيضِي حَيْضَةً - قَالَ - وَأَنَا مُتَّبِعٌ فِي ذَلِكَ قَضَاءَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي مَرْيَمَ الْمَغَالِيَّةِ كَانَتْ تَحْتَ ثَابِتِ بْنِ قَيْسِ بْنِ شَمَّاسٍ فَاخْتَلَعَتْ مِنْهُ ‏.‏",
    "malay_translation": "Aku berkata kepadanya: 'Ceritakan hadismu.'  Dia berkata: 'Aku telah bercerai dengan talak khul' daripada suamiku, kemudian aku datang kepada Uthman dan bertanya kepadanya: Apakah iddah yang wajib aku patuhi?  Dia berkata: Engkau tidak wajib beriddah melainkan jika engkau baru sahaja melakukan hubungan intim dengannya, maka engkau perlu menunggunya sehingga datang haid.  Dia berkata:  Aku mengikuti keputusan Rasulullah ﷺ dalam hal Maryam Al-Maghaliyyah, yang berkahwin dengan Thabit bin Qais, kemudian bercerai dengannya melalui khul'."
  },
  {
    "id": 18241,
    "hadith_number": 3505,
    "tajuk_hadith": "Penggantian Ayat Al-Quran dan Hukum-hukum yang Dimansuhkan",
    "perawi_melayu": "Daripada Ibnu Abbas berkenaan firman Allah:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَلِيُّ بْنُ الْحُسَيْنِ بْنِ وَاقِدٍ، قَالَ حَدَّثَنِي أَبِي قَالَ، أَنْبَأَنَا يَزِيدُ النَّحْوِيُّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، فِي قَوْلِهِ ‏{‏ مَا نَنْسَخْ مِنْ آيَةٍ أَوْ نُنْسِهَا نَأْتِ بِخَيْرٍ مِنْهَا أَوْ مِثْلِهَا ‏}‏ وَقَالَ ‏{‏ وَإِذَا بَدَّلْنَا آيَةً مَكَانَ آيَةٍ وَاللَّهُ أَعْلَمُ بِمَا يُنَزِّلُ ‏}‏ الآيَةَ وَقَالَ ‏{‏ يَمْحُو اللَّهُ مَا يَشَاءُ وَيُثْبِتُ وَعِنْدَهُ أُمُّ الْكِتَابِ ‏}‏ فَأَوَّلُ مَا نُسِخَ مِنَ الْقُرْآنِ الْقِبْلَةُ وَقَالَ ‏{‏ وَالْمُطَلَّقَاتُ يَتَرَبَّصْنَ بِأَنْفُسِهِنَّ ثَلاَثَةَ قُرُوءٍ ‏}‏ وَقَالَ ‏{‏ وَاللاَّئِي يَئِسْنَ مِنَ الْمَحِيضِ مِنْ نِسَائِكُمْ إِنِ ارْتَبْتُمْ فَعِدَّتُهُنَّ ثَلاَثَةُ أَشْهُرٍ ‏}‏ فَنُسِخَ مِنْ ذَلِكَ قَالَ تَعَالَى ‏{‏ وَإِنْ طَلَّقْتُمُوهُنَّ مِنْ قَبْلِ أَنْ تَمَسُّوهُنَّ ‏}‏ ‏{‏ فَمَا لَكُمْ عَلَيْهِنَّ مِنْ عِدَّةٍ تَعْتَدُّونَهَا ‏}‏ ‏.‏",
    "malay_translation": "Kami diberitakan oleh Zakaria bin Yahya, katanya: telah menceritakan kepada kami Ishak bin Ibrahim, katanya: telah memberitakan kepada kami Ali bin al-Husain bin Waqid, katanya: telah menceritakan kepadaku bapaku, katanya: telah memberitakan kepada kami Yazid an-Nahwi, daripada ‘Ikrimah, daripada Ibnu Abbas, berkenaan firman Allah SWT: {Apa jua ayat yang Kami mansuhkan atau Kami lupakan, nescaya Kami akan mendatangkan ayat yang lebih baik daripadanya atau yang serupa dengannya.} Dan katanya: {Dan apabila Kami menggantikan suatu ayat dengan ayat yang lain – dan Allah SWT lebih mengetahui akan apa yang diturunkan-Nya –} ayat tersebut. Dan katanya: {Allah SWT menghapuskan apa yang Dia kehendaki dan meneguhkan (apa yang Dia kehendaki). Dan di sisi-Nya ada Ummul Kitab.} Maka yang pertama sekali dimansuhkan daripada al-Quran ialah kiblat. Dan katanya: {Dan perempuan-perempuan yang diceraikan hendaklah menunggu (bagi diri mereka) tiga kali suci (haid).} Dan katanya: {Dan perempuan-perempuan kamu yang telah putus haidnya, jika kamu ragu-ragu (tentang haid mereka), maka ‘iddahnya ialah tiga bulan.} Maka dimansuhkan daripada hukum itu, firman Allah SWT: {Dan jika kamu menceraikan mereka sebelum kamu bercampur dengan mereka.} {Maka tidak ada ‘iddah yang perlu kamu tunggu bagi mereka.}"
  },
  {
    "id": 18242,
    "hadith_number": 3506,
    "tajuk_hadith": "Tempoh Berkabung Wanita Muslim",
    "perawi_melayu": "Daripada Zainab binti Umm Salamah, katanya:",
    "english_text": "\"Umm Habibah said: 'I heard the Messenger of Allah say: It is not permissible for a woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days, except for a husband; (she mourns for him for) four months and ten (days).\"",
    "arabic_text": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، عَنْ وَكِيعٍ، عَنْ شُعْبَةَ، قَالَ حَدَّثَنِي حُمَيْدُ بْنُ نَافِعٍ، عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ، قَالَتْ أُمُّ حَبِيبَةَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ تَحِدُّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثَةِ أَيَّامٍ إِلاَّ عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏ ‏.‏",
    "malay_translation": "Umm Habibah berkata:  Aku mendengar Rasulullah SAW bersabda:  “Tidak halal bagi seorang wanita yang beriman kepada Allah dan hari akhirat untuk berkabung atas kematian seseorang melebihi tiga hari, kecuali atas kematian suaminya; (ia dibenarkan berkabung) selama empat bulan sepuluh hari.”"
  },
  {
    "id": 18243,
    "hadith_number": 3507,
    "tajuk_hadith": "Iddah Wanita Yang Berduka",
    "perawi_melayu": "Daripada Zainab binti Umm Salamah - saya (perawi) berkata:",
    "english_text": "\"From her mother?\" He said: \"Yes\" - \"that the Prophet was asked about a woman whose husband had died but they were worried about her eyes - could she use kohl?\" He said: \"One of you used to stay in her house wearing her shabbiest clothes for a year, then she would come out. No, (the mourning period is) four months and ten (days).\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ حُمَيْدِ بْنِ نَافِعٍ، عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ، قُلْتُ عَنْ أُمِّهَا، قَالَ نَعَمْ إِنَّ النَّبِيَّ صلى الله عليه وسلم سُئِلَ عَنِ امْرَأَةٍ تُوُفِّيَ عَنْهَا زَوْجُهَا فَخَافُوا عَلَى عَيْنِهَا أَتَكْتَحِلُ فَقَالَ ‏\n\"‏ قَدْ كَانَتْ إِحْدَاكُنَّ تَمْكُثُ فِي بَيْتِهَا فِي شَرِّ أَحْلاَسِهَا حَوْلاً ثُمَّ خَرَجَتْ فَلاَ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏ ‏.‏",
    "malay_translation": "\"Dari ibunya?\"  Baginda menjawab, \"Ya.\"  \"Bahawa Nabi SAW ditanya tentang seorang wanita yang suaminya telah meninggal dunia, lalu mereka bimbang akan matanya – bolehkah dia menggunakan kohl?\" Baginda menjawab, \"Salah seorang daripada kamu dahulu akan menetap di rumahnya dengan memakai pakaian yang paling buruk selama setahun, kemudian dia akan keluar. Tidak, (tempoh berkabung adalah) empat bulan sepuluh (hari).\""
  },
  {
    "id": 18244,
    "hadith_number": 3508,
    "tajuk_hadith": "Iddah Wanita dan Penggunaan Kohl",
    "perawi_melayu": "Daripada Zainab binti Umm Salamah, bahawa Umm Salamah dan Umm Habibah berkata:",
    "english_text": "\"A woman came to the Prophet and said: 'My daughter's husband has died, and I am worried about her eyes. Can I apply kohl to her?' The Messenger of Allah said: 'One of you used to stay (in mourning) for a year. Rather (the mourning period is) four months and ten (days). And when that year had passed she would go out and fling a piece of dung behind her.'\"",
    "arabic_text": "أَخْبَرَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا جَرِيرٌ، عَنْ يَحْيَى بْنِ سَعِيدِ بْنِ قَيْسِ بْنِ قَهْدٍ الأَنْصَارِيِّ، - وَجَدُّهُ قَدْ أَدْرَكَ النَّبِيَّ صلى الله عليه وسلم - عَنْ حُمَيْدِ بْنِ نَافِعٍ عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَ وَأُمِّ حَبِيبَةَ قَالَتَا جَاءَتِ امْرَأَةٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ إِنَّ ابْنَتِي تُوُفِّيَ عَنْهَا زَوْجُهَا وَإِنِّي أَخَافُ عَلَى عَيْنِهَا أَفَأَكْحُلُهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ قَدْ كَانَتْ إِحْدَاكُنَّ تَجْلِسُ حَوْلاً وَإِنَّمَا هِيَ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا فَإِذَا كَانَ الْحَوْلُ خَرَجَتْ وَرَمَتْ وَرَاءَهَا بِبَعْرَةٍ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang wanita datang kepada Nabi SAW dan berkata, \"Suami anak perempuanku telah meninggal dunia, dan aku bimbangkan matanya. Bolehkah aku menggunakan kohl untuknya?\" Rasulullah SAW bersabda, \"Dahulu, salah seorang daripada kamu akan berkabung selama setahun. Tetapi tempoh berkabung (iddah) hanyalah empat bulan sepuluh hari.  Setelah tempoh itu berakhir, dia boleh keluar dan membuang seketul najis di belakangnya.\""
  },
  {
    "id": 18245,
    "hadith_number": 3509,
    "tajuk_hadith": "Tempoh Mengadukan Kematian",
    "perawi_melayu": "Daripada Safiyyah binti Abi 'Ubaid yang mendengar Hafsah binti Umar, isteri Nabi SAW, bahawa Nabi SAW bersabda:",
    "english_text": "\"It is not permissible for a woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days except for a husband; she should mourn for him for four months and ten (days).\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ سَمِعْتُ نَافِعًا، يَقُولُ عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ، أَنَّهَا سَمِعَتْ حَفْصَةَ بِنْتَ عُمَرَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ تَحِدُّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثٍ إِلاَّ عَلَى زَوْجٍ فَإِنَّهَا تَحِدُّ عَلَيْهِ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏ ‏.‏",
    "malay_translation": "Tidak halal bagi seorang wanita yang beriman kepada Allah dan hari akhirat untuk mengadukan kematian seseorang melebihi tiga hari kecuali bagi suaminya; maka baginya tempoh mengadukan kematian suami adalah empat bulan sepuluh hari."
  },
  {
    "id": 18246,
    "hadith_number": 3510,
    "tajuk_hadith": "Tempoh Mengandung Kesedihan Atas Kematian",
    "perawi_melayu": "Daripada Safiyyah binti Abi 'Ubaid daripada salah seorang isteri Nabi, dan daripada Ummu Salamah, bahawa Nabi SAW telah bersabda:",
    "english_text": "\"It is not permissible for a woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days except for a husband; she should mourn for him for four months and ten (days).\"",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الصَّبَّاحِ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَوَاءٍ، قَالَ أَنْبَأَنَا سَعِيدٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ، عَنْ بَعْضِ، أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم وَعَنْ أُمِّ سَلَمَةَ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ تَحِدُّ عَلَى مَيِّتٍ أَكْثَرَ مِنْ ثَلاَثَةِ أَيَّامٍ إِلاَّ عَلَى زَوْجٍ فَإِنَّهَا تَحِدُّ عَلَيْهِ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏ ‏.‏",
    "malay_translation": "Tidak halal bagi seorang perempuan yang beriman kepada Allah dan hari akhirat untuk berkabung atas kematian seseorang melebihi tiga hari, kecuali atas kematian suaminya; maka baginya untuk berkabung selama empat bulan sepuluh hari."
  },
  {
    "id": 18247,
    "hadith_number": 3511,
    "tajuk_hadith": "Riwayat daripada Safiah binti Abi Ubaid",
    "perawi_melayu": "Muhammad bin Ismail bin Ibrahim meriwayatkan daripada As-Sahmi (Abdullah bin Bakar), daripada Sa'id, daripada Ayub, daripada Nafi', daripada Safiah binti Abi Ubaid, daripada salah seorang isteri Nabi SAW iaitu Umm Salamah, daripada Nabi SAW.",
    "english_text": "A similar report was narrated from Safiyyah bint Abi 'Ubaid from one of the wives of the Prophet -and she is Umm Salamah- from the Prophet.",
    "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا السَّهْمِيُّ، - يَعْنِي عَبْدَ اللَّهِ بْنَ بَكْرٍ - قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ، عَنْ بَعْضِ، أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم وَهِيَ أُمُّ سَلَمَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏",
    "malay_translation": "Muhammad bin Ismail bin Ibrahim meriwayatkan daripada As-Sahmi (iaitu Abdullah bin Bakar), daripada Sa'id, daripada Ayub, daripada Nafi', daripada Safiah binti Abi Ubaid, daripada salah seorang isteri Nabi SAW iaitu Umm Salamah, daripada Nabi SAW.  (Hampir sama maksudnya)."
  },
  {
    "id": 18248,
    "hadith_number": 3512,
    "tajuk_hadith": "Perkahwinan Selepas Kematian Suami",
    "perawi_melayu": "Al-Miswar bin Makhramah",
    "english_text": "It was narrated from Al-Miswar bin Makhramah that Subai'ah Al-Aslamiyyah gave birth one day after her husband died. She came to the Messenger of Allah and asked his permission to marry, and he gave her permission to marry and she married.",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، - وَاللَّفْظُ لِمُحَمَّدٍ - قَالاَ أَنْبَأَنَا ابْنُ الْقَاسِمِ، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، أَنَّ سُبَيْعَةَ الأَسْلَمِيَّةَ، نُفِسَتْ بَعْدَ وَفَاةِ زَوْجِهَا بِلَيَالٍ فَجَاءَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَاسْتَأْذَنَتْ أَنْ تَنْكِحَ فَأَذِنَ لَهَا فَنَكَحَتْ ‏.‏",
    "malay_translation": "Daripada Al-Miswar bin Makhramah, diriwayatkan bahawa Subai’ah Al-Aslamiyyah melahirkan anak sehari selepas kematian suaminya.  Beliau datang kepada Rasulullah SAW dan memohon izin untuk berkahwin, dan baginda memberi izin kepadanya, lalu beliau berkahwin."
  },
  {
    "id": 18249,
    "hadith_number": 3513,
    "tajuk_hadith": "Perintah Perkahwinan Selepas Nifas",
    "perawi_melayu": "Al-Miswar bin Makhramah",
    "english_text": "It was narrated from Al-Miswar bin Makhramah that the Prophet commanded Sabai'ah to get married when her Nifas ended.",
    "arabic_text": "أَخْبَرَنَا نَصْرُ بْنُ عَلِيِّ بْنِ نَصْرٍ، عَنْ عَبْدِ اللَّهِ بْنِ دَاوُدَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَ سُبَيْعَةَ أَنْ تَنْكِحَ إِذَا تَعَلَّتْ مِنْ نِفَاسِهَا ‏.‏",
    "malay_translation": "Daripada Al-Miswar bin Makhramah, diriwayatkan bahawa Nabi Muhammad SAW memerintahkan Sabai'ah untuk berkahwin setelah selesai nifasnya."
  },
  {
    "id": 18250,
    "hadith_number": 3514,
    "tajuk_hadith": "Perkahwinan Selepas Tempoh Iddah",
    "perawi_melayu": "Daripada Abu As-Sanabil, katanya:",
    "english_text": "\"Subai'ah gave birth twenty-three or twenty-five days after her husband died, and when her Nifas ended she expressed her wish to remarry and was criticized for that. Mention of that was made to the Messenger of Allah and he said: 'There is nothing to stop her; her term has ended.'\"",
    "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ قُدَامَةَ، قَالَ أَخْبَرَنِي جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ أَبِي السَّنَابِلِ، قَالَ وَضَعَتْ سُبَيْعَةُ حَمْلَهَا بَعْدَ وَفَاةِ زَوْجِهَا بِثَلاَثَةٍ وَعِشْرِينَ أَوْ خَمْسَةٍ وَعِشْرِينَ لَيْلَةً فَلَمَّا تَعَلَّتْ تَشَوَّفَتْ لِلأَزْوَاجِ فَعِيبَ ذَلِكَ عَلَيْهَا فَذُكِرَ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ مَا يَمْنَعُهَا قَدِ انْقَضَى أَجَلُهَا ‏\"‏ ‏.‏",
    "malay_translation": "Subai'ah melahirkan anaknya dua puluh tiga atau dua puluh lima hari selepas kematian suaminya. Setelah nifas beliau berakhir, beliau menyatakan hasrat untuk berkahwin semula dan dikritik kerana itu. Perkara itu disebut kepada Rasulullah SAW, lalu baginda bersabda:  \"Tiada apa yang menghalangnya, tempohnya telah tamat.\""
  },
  {
    "id": 18251,
    "hadith_number": 3515,
    "tajuk_hadith": "Perkahwinan Janda Selepas Kematian Suami",
    "perawi_melayu": "Abu Salamah berkata:",
    "english_text": "\"Abu Hurairah and Ibn 'Abbas differed concerning the widow who gives birth after her husband's death. Abu Hurairah said: 'She may be married.' Ibn 'Abbas said: '(She has to wait) for the longer of the two periods.' They sent word to Umm Salamah and she said: 'The husband of Subai'ah died and she gave birth fifteen days -half a month- after her husband died.' She said: 'Two men proposed marriage to her, and she was inclined toward one of them. When they feared that she was becoming single-minded (on this issue, and not consulting her family), they said: It is not permissible for you to marry. She went to the Messenger of Allah and he said: 'It is permissible for you to marry, so marry whomever you want.''\"",
    "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَبْدُ رَبِّهِ بْنُ سَعِيدٍ، قَالَ سَمِعْتُ أَبَا سَلَمَةَ، يَقُولُ اخْتَلَفَ أَبُو هُرَيْرَةَ وَابْنُ عَبَّاسٍ فِي الْمُتَوَفَّى عَنْهَا زَوْجُهَا إِذَا وَضَعَتْ حَمْلَهَا قَالَ أَبُو هُرَيْرَةَ تُزَوَّجُ ‏.‏ وَقَالَ ابْنُ عَبَّاسٍ أَبْعَدَ الأَجَلَيْنِ ‏.‏ فَبَعَثُوا إِلَى أُمِّ سَلَمَةَ فَقَالَتْ تُوُفِّيَ زَوْجُ سُبَيْعَةَ فَوَلَدَتْ بَعْدَ وَفَاةِ زَوْجِهَا بِخَمْسَةَ عَشَرَ نِصْفِ شَهْرٍ - قَالَتْ - فَخَطَبَهَا رَجُلاَنِ فَحَطَّتْ بِنَفْسِهَا إِلَى أَحَدِهِمَا فَلَمَّا خَشُوا أَنْ تَفْتَاتَ بِنَفْسِهَا قَالُوا إِنَّكِ لاَ تَحِلِّينَ ‏.‏ قَالَتْ فَانْطَلَقْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ قَدْ حَلَلْتِ فَانْكِحِي مَنْ شِئْتِ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Hurairah dan Ibnu Abbas berbeza pendapat mengenai seorang balu yang melahirkan anak selepas kematian suaminya. Abu Hurairah berkata: 'Dia dibolehkan berkahwin.' Ibnu Abbas berkata: '(Dia perlu menunggu) tempoh yang lebih panjang daripada kedua-dua tempoh tersebut.' Mereka menghantar khabar kepada Ummu Salamah, dan beliau berkata: 'Suami Subai'ah meninggal dunia, dan beliau melahirkan anak lima belas hari – separuh bulan – selepas kematian suaminya.' Beliau berkata: 'Dua orang lelaki melamarnya, dan hatinya cenderung kepada salah seorang daripada mereka. Apabila mereka bimbang bahawa dia akan bertindak sendiri (tanpa berunding dengan keluarganya), mereka berkata: Tidak halal bagimu untuk berkahwin.  Maka dia pergi kepada Rasulullah SAW, dan baginda bersabda: \"Kamu telah dihalalkan, maka kahwinlah dengan sesiapa yang kamu suka.\""
  },
  {
    "id": 18252,
    "hadith_number": 3516,
    "tajuk_hadith": "Perkahwinan Wanita Hamil Selepas Kematian Suami",
    "perawi_melayu": "Daripada Abu Salamah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، - وَاللَّفْظُ لِمُحَمَّدٍ - قَالَ أَنْبَأَنَا ابْنُ الْقَاسِمِ، عَنْ مَالِكٍ، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، عَنْ أَبِي سَلَمَةَ، قَالَ سُئِلَ ابْنُ عَبَّاسٍ وَأَبُو هُرَيْرَةَ عَنِ الْمُتَوَفَّى، عَنْهَا زَوْجُهَا وَهِيَ حَامِلٌ قَالَ ابْنُ عَبَّاسٍ آخِرُ الأَجَلَيْنِ ‏.‏ وَقَالَ أَبُو هُرَيْرَةَ إِذَا وَلَدَتْ فَقَدْ حَلَّتْ ‏.‏ فَدَخَلَ أَبُو سَلَمَةَ إِلَى أُمِّ سَلَمَةَ فَسَأَلَهَا عَنْ ذَلِكَ، فَقَالَتْ وَلَدَتْ سُبَيْعَةُ الأَسْلَمِيَّةُ بَعْدَ وَفَاةِ زَوْجِهَا بِنِصْفِ شَهْرٍ فَخَطَبَهَا رَجُلاَنِ أَحَدُهُمَا شَابٌّ وَالآخَرُ كَهْلٌ فَحَطَّتْ إِلَى الشَّابِّ فَقَالَ الْكَهْلُ لَمْ تَحْلِلْ ‏.‏ وَكَانَ أَهْلُهَا غُيَّبًا فَرَجَا إِذَا جَاءَ أَهْلُهَا أَنْ يُؤْثِرُوهُ بِهَا فَجَاءَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ قَدْ حَلَلْتِ فَانْكِحِي مَنْ شِئْتِ ‏\"‏ ‏.‏",
    "malay_translation": "Dikhabarkan kepada kami oleh Muhammad bin Salmah dan Harits bin Miskin, dengan bacaan kepadanya dan saya mendengar, - dan lafaznya adalah daripada Muhammad - berkata: Memberitakan kepada kami Ibnu al-Qasim, daripada Malik, daripada Abd Rabb bin Sa'id, daripada Abu Salamah, katanya: Ditanya Ibnu Abbas dan Abu Hurairah tentang wanita yang suaminya meninggal dunia ketika dia sedang hamil. Ibnu Abbas berkata: “Tempoh yang lebih panjang daripada dua tempoh.” Dan Abu Hurairah berkata: “Apabila dia melahirkan, maka dia telah halal.” Maka Abu Salamah masuk kepada Umm Salamah lalu menanyakan kepadanya tentang hal itu. Maka dia berkata: Subai'ah al-Aslamiyyah melahirkan selepas kematian suaminya setengah bulan kemudian. Maka meminang wanita itu dua orang lelaki, seorang adalah muda dan seorang lagi tua. Maka wanita itu cenderung kepada lelaki yang muda, lalu lelaki yang tua berkata: “Engkau belum halal.” Dan keluarganya berada di tempat lain. Maka dia berharap sekiranya keluarganya datang mereka akan memilih dia untuk menikahinya. Maka wanita itu datang kepada Rasulullah SAW, lalu baginda berkata: \"Engkau telah halal, maka kahwinlah dengan sesiapa sahaja yang engkau suka.\""
  },
  {
    "id": 18253,
    "hadith_number": 3517,
    "tajuk_hadith": "Perkahwinan Wanita Selepas Kematian Suami",
    "perawi_melayu": "Abu Salamah bin 'Abdur-Rahman berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ، قَالَ حَدَّثَنَا يَزِيدُ، - وَهُوَ ابْنُ زُرَيْعٍ - قَالَ حَدَّثَنَا حَجَّاجٌ، قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ قِيلَ لاِبْنِ عَبَّاسٍ فِي امْرَأَةٍ وَضَعَتْ بَعْدَ وَفَاةِ زَوْجِهَا بِعِشْرِينَ لَيْلَةً أَيَصْلُحُ لَهَا أَنْ تَزَوَّجَ قَالَ لاَ إِلاَّ آخِرَ الأَجَلَيْنِ ‏.‏ قَالَ قُلْتُ قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى ‏{‏ وَأُولاَتُ الأَحْمَالِ أَجَلُهُنَّ أَنْ يَضَعْنَ حَمْلَهُنَّ ‏}‏ فَقَالَ إِنَّمَا ذَلِكَ فِي الطَّلاَقِ ‏.‏ فَقَالَ أَبُو هُرَيْرَةَ أَنَا مَعَ ابْنِ أَخِي ‏.‏ يَعْنِي أَبَا سَلَمَةَ ‏.‏ فَأَرْسَلَ غُلاَمَهُ كُرَيْبًا فَقَالَ ائْتِ أُمَّ سَلَمَةَ فَسَلْهَا هَلْ كَانَ هَذَا سُنَّةً مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَجَاءَ فَقَالَ قَالَتْ نَعَمْ سُبَيْعَةُ الأَسْلَمِيَّةُ وَضَعَتْ بَعْدَ وَفَاةِ زَوْجِهَا بِعِشْرِينَ لَيْلَةً فَأَمَرَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ تَزَوَّجَ فَكَانَ أَبُو السَّنَابِلِ فِيمَنْ يَخْطُبُهَا ‏.‏",
    "malay_translation": "Telah diberitakan kepadaku oleh Muhammad bin Abdullah bin Bazie', katanya: Telah menceritakan kepada kami Yazid - iaitu bin Zuraie' - katanya: Telah menceritakan kepada kami Hajjaj, katanya: Telah menceritakan kepada kami Yahya bin Abi Kasyir, katanya: Telah menceritakan kepadaku Abu Salamah bin Abdur Rahman, katanya: Ditanya kepada Ibnu Abbas tentang seorang wanita yang melahirkan anak setelah kematian suaminya selama dua puluh malam, adakah dia layak untuk berkahwin? Beliau menjawab: Tidak, melainkan setelah tempoh yang lebih panjang tamat.  Beliau berkata: Allah SWT berfirman, {Dan bagi wanita-wanita yang hamil, tempoh iddah mereka ialah sehingga mereka melahirkan kandungannya.}  Maka beliau berkata: Ini hanya berlaku dalam kes talak (cerai). Kemudian Abu Hurairah berkata: Aku bersetuju dengan anak saudara lelaki ku, iaitu Abu Salamah. Maka Abu Salamah menghantar hambanya, Kuraib dan berkata kepadanya: Pergilah kepada Umm Salamah dan tanyakan kepadanya, adakah ini merupakan sunnah Rasulullah SAW?  Kemudian dia kembali dan berkata:  Umm Salamah berkata: Ya, Suba'iah Al-Aslamiyyah melahirkan anak setelah kematian suaminya selama dua puluh malam, maka Rasulullah SAW menyuruhnya untuk berkahwin, dan Abu As-Sanabil adalah antara yang meminangnya."
  },
  {
    "id": 18254,
    "hadith_number": 3518,
    "tajuk_hadith": "Iddah Wanita Yang Suami Meninggal Dunia dan Melahirkan Selepas Kematian Suami",
    "perawi_melayu": "Dari Sulaiman bin Yasar bahawa Abu Hurairah, Ibnu Abbas, dan Abu Salamah bin Abdur-Rahman berbincang tentang iddah seorang wanita yang suaminya meninggal dunia, dan dia melahirkan selepas kematian suaminya. Ibnu Abbas berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَحْيَى، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ أَبَا هُرَيْرَةَ، وَابْنَ، عَبَّاسٍ وَأَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ تَذَاكَرُوا عِدَّةَ الْمُتَوَفَّى عَنْهَا زَوْجُهَا تَضَعُ عِنْدَ وَفَاةِ زَوْجِهَا فَقَالَ ابْنُ عَبَّاسٍ تَعْتَدُّ آخِرَ الأَجَلَيْنِ ‏.‏ وَقَالَ أَبُو سَلَمَةَ بَلْ تَحِلُّ حِينَ تَضَعُ ‏.‏ فَقَالَ أَبُو هُرَيْرَةَ أَنَا مَعَ ابْنِ أَخِي ‏.‏ فَأَرْسَلُوا إِلَى أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ وَضَعَتْ سُبَيْعَةُ الأَسْلَمِيَّةُ بَعْدَ وَفَاةِ زَوْجِهَا بِيَسِيرٍ فَاسْتَفْتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَمَرَهَا أَنْ تَتَزَوَّجَ ‏.‏",
    "malay_translation": "Dikhabarkan kepada kami oleh Qutaibah, katanya; telah menceritakan kepada kami oleh Laith, daripada Yahya, daripada Sulaiman bin Yasar, bahawa Abu Hurairah, Ibnu Abbas dan Abu Salamah bin Abdur-Rahman membincangkan tentang iddah wanita yang suaminya meninggal dunia dan melahirkan anak selepas kematian suaminya.  Ibnu Abbas berkata, \"Dia perlu menjalani iddah untuk tempoh yang lebih panjang.\"  Abu Salamah berkata, \"Tidak, dia dihalalkan untuk berkahwin setelah dia melahirkan.\" Abu Hurairah berkata, \"Aku bersetuju dengan anak saudara lelakiku.\" Maka mereka menghantar khabar kepada Ummu Salamah, isteri Nabi ﷺ, dan beliau berkata, \"Subai'ah Al-Aslamiyyah melahirkan anak sejurus selepas kematian suaminya; dia meminta fatwa kepada Rasulullah ﷺ, maka baginda memerintahkannya untuk berkahwin.\""
  },
  {
    "id": 18255,
    "hadith_number": 3519,
    "tajuk_hadith": "Perkahwinan Semula Selepas Kematian Suami",
    "perawi_melayu": "Daripada Ummu Salamah r.a.",
    "english_text": "\"Subai'ah gave birth a few days after her husband died, and the Messenger of Allah told her to get married.\"",
    "arabic_text": "أَخْبَرَنَا عَبْدُ الأَعْلَى بْنُ وَاصِلِ بْنِ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ سُفْيَانَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ كُرَيْبٍ، عَنْ أُمِّ سَلَمَةَ، وَمُحَمَّدُ بْنُ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ كُرَيْبٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ وَضَعَتْ سُبَيْعَةُ بَعْدَ وَفَاةِ زَوْجِهَا بِأَيَّامٍ فَأَمَرَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ تَزَوَّجَ ‏.‏",
    "malay_translation": "Ummu Salamah r.a. berkata: Subai’ah melahirkan anak beberapa hari selepas kematian suaminya.  Rasulullah SAW menyuruhnya berkahwin."
  },
  {
    "id": 18256,
    "hadith_number": 3520,
    "tajuk_hadith": "Iddah Wanita Selepas Kematian Suami",
    "perawi_melayu": "Daripada Sulaiman bin Yasar bahawa Abdullah bin Abbas dan Abu Salamah bin Abdur-Rahman berselisih pendapat mengenai wanita yang melahirkan anak sehari selepas kematian suaminya.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، عَنِ ابْنِ الْقَاسِمِ، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، وَأَبَا، سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ اخْتَلَفَا فِي الْمَرْأَةِ تُنْفَسُ بَعْدَ وَفَاةِ زَوْجِهَا بِلَيَالٍ فَقَالَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ آخِرُ الأَجَلَيْنِ ‏.‏ وَقَالَ أَبُو سَلَمَةَ إِذَا نُفِسَتْ فَقَدْ حَلَّتْ ‏.‏ فَجَاءَ أَبُو هُرَيْرَةَ فَقَالَ أَنَا مَعَ ابْنِ أَخِي ‏.‏ يَعْنِي أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ ‏.‏ فَبَعَثُوا كُرَيْبًا مَوْلَى ابْنِ عَبَّاسٍ إِلَى أُمِّ سَلَمَةَ يَسْأَلُهَا عَنْ ذَلِكَ فَجَاءَهُمْ فَأَخْبَرَهُمْ أَنَّهَا قَالَتْ وَلَدَتْ سُبَيْعَةُ بَعْدَ وَفَاةِ زَوْجِهَا بِلَيَالٍ فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ قَدْ حَلَلْتِ ‏\"‏ ‏.‏",
    "malay_translation": "Kami diberitakan oleh Muhammad bin Salmah, daripada Ibnu Qasim, daripada Malik, daripada Yahya bin Said, daripada Sulaiman bin Yasar, bahawa Abdullah bin Abbas dan Abu Salamah bin Abdur-Rahman berselisih pendapat tentang wanita yang nifas (bersalin) selepas kematian suaminya. Abdullah bin Abbas berkata: \"tempoh yang paling lama.\"  Abu Salamah berkata: \"Apabila dia sudah bersalin, maka dia telah halal (untuk berkahwin semula).\" Kemudian datang Abu Hurairah lalu berkata: \"Aku bersama anak saudara lelaki aku\" -maksudnya Abu Salamah bin Abdur-Rahman.  Lalu mereka menghantar Kuraib, hamba sahaya Ibn Abbas kepada Ummu Salamah untuk bertanya kepadanya mengenai perkara itu.  Lalu dia kembali kepada mereka dan memberitahu bahawa Ummu Salamah berkata: \"Subai'ah bersalin sehari selepas kematian suaminya.\" Dia menceritakan perkara itu kepada Rasulullah SAW, maka baginda SAW bersabda:  \"Engkau telah halal (untuk berkahwin semula).\""
  },
  {
    "id": 18257,
    "hadith_number": 3521,
    "tajuk_hadith": "Iddah Wanita Selepas Kematian Suami",
    "perawi_melayu": "Abu Salamah bin 'Abdur-Rahman berkata:",
    "english_text": "\"Ibn 'Abbas, Abu Hurairah and I were together, and Ibn 'Abbas said: 'If a woman gives birth after her husband dies, her 'Iddah is the longer of the two periods.'\" Abu Salamah said: \"We sent Kuraib to Umm Salamah to ask her about that. He came to us and told us from her that the husband of Subai'ah died and she gave birth a few days after her husband died, and the Messenger of Allah told her to get married.\"",
    "arabic_text": "أَخْبَرَنَا حُسَيْنُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ أَخْبَرَنِي سُلَيْمَانُ بْنُ يَسَارٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ كُنْتُ أَنَا وَابْنُ، عَبَّاسٍ وَأَبُو هُرَيْرَةَ فَقَالَ ابْنُ عَبَّاسٍ إِذَا وَضَعَتِ الْمَرْأَةُ بَعْدَ وَفَاةِ زَوْجِهَا فَإِنَّ عِدَّتَهَا آخِرُ الأَجَلَيْنِ ‏.‏ فَقَالَ أَبُو سَلَمَةَ فَبَعَثْنَا كُرَيْبًا إِلَى أُمِّ سَلَمَةَ يَسْأَلُهَا عَنْ ذَلِكَ فَجَاءَنَا مِنْ عِنْدِهَا أَنَّ سُبَيْعَةَ تُوُفِّيَ عَنْهَا زَوْجُهَا فَوَضَعَتْ بَعْدَ وَفَاةِ زَوْجِهَا بِأَيَّامٍ فَأَمَرَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ تَتَزَوَّجَ ‏.‏",
    "malay_translation": "Aku, Ibn Abbas dan Abu Hurairah berada bersama.  Ibn Abbas berkata: 'Jika seorang wanita melahirkan anak selepas kematian suaminya, maka iddahnya ialah tempoh yang lebih panjang daripada kedua-dua tempoh (tempoh nifas dan tempoh iddah).' Abu Salamah berkata: 'Kami menghantar Kuraib kepada Umm Salamah untuk bertanya tentang perkara itu.  Dia datang kepada kami dan memberitahu bahawa suami Subai'ah telah meninggal dunia dan dia melahirkan anak beberapa hari selepas kematian suaminya.  Rasulullah SAW menyuruhnya untuk berkahwin.'"
  },
  {
    "id": 18258,
    "hadith_number": 3522,
    "tajuk_hadith": "Perkahwinan Selepas Iddah",
    "perawi_melayu": "Daripada Abu Salamah bin 'Abdur-Rahman yang mana Zainab binti Abi Salamah telah menceritakan kepadanya daripada ibunya, Ummu Salamah, isteri Nabi:",
    "english_text": "\"That a woman from Aslam who was called Subai'ah was married to her husband, and he died while she was pregnant. Abu As-Sanabil bin Ba'kak proposed to her but she refused to marry him. He said: 'You cannot get married until you have observed 'Iddah for the longer of the two periods.' Approximately twenty days later she gave birth. She went to the Messenger of Allah and he said: 'Get married.'\"",
    "arabic_text": "أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ جَدِّي، قَالَ حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ زَيْنَبَ بِنْتَ أَبِي سَلَمَةَ، أَخْبَرَتْهُ عَنْ أُمِّهَا أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ امْرَأَةً مِنْ أَسْلَمَ يُقَالُ لَهَا سُبَيْعَةُ كَانَتْ تَحْتَ زَوْجِهَا فَتُوُفِّيَ عَنْهَا وَهِيَ حُبْلَى فَخَطَبَهَا أَبُو السَّنَابِلِ بْنُ بَعْكَكٍ فَأَبَتْ أَنْ تَنْكِحَهُ فَقَالَ مَا يَصْلُحُ لَكِ أَنْ تَنْكِحِي حَتَّى تَعْتَدِّي آخِرَ الأَجَلَيْنِ ‏.‏ فَمَكَثَتْ قَرِيبًا مِنْ عِشْرِينَ لَيْلَةً ثُمَّ نُفِسَتْ فَجَاءَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ انْكِحِي ‏\"‏ ‏.‏",
    "malay_translation": "Seorang wanita dari Aslam yang bernama Subai’ah telah berkahwin dengan suaminya, dan suaminya meninggal dunia ketika dia sedang hamil. Abu As-Sanabil bin Ba’kak melamarnya, tetapi dia menolak untuk berkahwin dengannya. Dia berkata: ‘Engkau tidak boleh berkahwin sehingga engkau telah menunaikan iddah bagi tempoh yang lebih panjang.’ Kira-kira dua puluh hari kemudian dia melahirkan. Dia pergi kepada Rasulullah SAW, dan baginda bersabda: ‘Berkahwinlah.’"
  },
  {
    "id": 18259,
    "hadith_number": 3523,
    "tajuk_hadith": "Iddah Wanita Hamil Yang Suaminya Meninggal Dunia",
    "perawi_melayu": "Abu Salamah bin 'Abdur-Rahman berkata:",
    "english_text": "\"While Abu Hurairah and I were with Ibn 'Abbas, a woman came and said that her husband had died while she was pregnant, then she had given birth less than four months after the day he died. Ibn 'Abbas said: '(You have to wait) for the longer of the two periods.'\" Abu Salamah said: \"A man from among the Companions of the Prophet told me that Subai'ah Al-Aslamiyyah came to the Messenger of Allah and said that her husband died while she was pregnant, and she gave birth less than four months after he died. The Messenger of Allah told her to get married. Abu Hurairah said: 'And I bear witness to that.'\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي دَاوُدُ بْنُ أَبِي عَاصِمٍ، أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ، أَخْبَرَهُ قَالَ بَيْنَمَا أَنَا وَأَبُو هُرَيْرَةَ عِنْدَ ابْنِ عَبَّاسٍ إِذْ جَاءَتْهُ امْرَأَةٌ فَقَالَتْ تُوُفِّيَ عَنْهَا زَوْجُهَا وَهِي حَامِلٌ فَوَلَدَتْ لأَدْنَى مِنْ أَرْبَعَةِ أَشْهُرٍ مِنْ يَوْمِ مَاتَ ‏.‏ فَقَالَ ابْنُ عَبَّاسٍ آخِرُ الأَجَلَيْنِ ‏.‏ فَقَالَ أَبُو سَلَمَةَ أَخْبَرَنِي رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم أَنَّ سُبَيْعَةَ الأَسْلَمِيَّةَ جَاءَتْ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ تُوُفِّيَ عَنْهَا زَوْجُهَا وَهِيَ حَامِلٌ فَوَلَدَتْ لأَدْنَى مِنْ أَرْبَعَةِ أَشْهُرٍ فَأَمَرَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ تَتَزَوَّجَ ‏.‏ قَالَ أَبُو هُرَيْرَةَ وَأَنَا أَشْهَدُ عَلَى ذَلِكَ ‏.‏",
    "malay_translation": "Ketika aku dan Abu Hurairah berada di sisi Ibnu Abbas, tiba-tiba datang seorang wanita lalu berkata bahawa suaminya telah meninggal dunia ketika dia sedang hamil, kemudian dia melahirkan kurang daripada empat bulan selepas kematian suaminya. Ibnu Abbas berkata: ‘(Engkau perlu menunggu) tempoh yang lebih lama daripada kedua-dua tempoh tersebut.’  Abu Salamah berkata: “Seorang lelaki daripada sahabat-sahabat Nabi ﷺ memberitahu aku bahawa Subai’ah Al-Aslamiyyah telah datang kepada Rasulullah ﷺ lalu berkata bahawa suaminya telah meninggal dunia ketika dia sedang hamil, dan dia melahirkan kurang daripada empat bulan selepas kematian suaminya.  Rasulullah ﷺ menyuruhnya untuk berkahwin. Abu Hurairah berkata: ‘Dan aku menjadi saksi terhadap perkara itu.’"
  },
  {
    "id": 18260,
    "hadith_number": 3524,
    "tajuk_hadith": "Perkahwinan Selepas Nifas",
    "perawi_melayu": "'Ubaidullah bin 'Abdullah meriwayatkan bahawa bapanya menulis kepada 'Umar bin 'Abdullah bin Arqam Az-Zuhri, menyuruhnya pergi kepada Subai'ah binti Al-Harith Al-Aslamiyyah dan menanyakan kepadanya tentang hadisnya dan apa yang telah dikatakan oleh Rasulullah SAW kepadanya ketika dia bermusyawarah dengan baginda. 'Umar bin 'Abdullah membalas surat kepada 'Abdullah bin 'Utbah dengan memberitahu bahawa Subai'ah memberitahu bahawa dia telah berkahwin dengan Sahl bin Khawlah - yang berasal dari Bani 'Amir bin Lu-ayy dan merupakan salah seorang yang hadir di Perang Badar - dan suaminya meninggal dunia ketika Haji Wada' ketika dia sedang hamil. Dia melahirkan anak tidak lama selepas kematian suaminya, dan apabila nifasnya telah suci, dia mengenakan pakaian yang cantik untuk menerima lamaran.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ، حَدَّثَهُ أَنَّ أَبَاهُ كَتَبَ إِلَى عُمَرَ بْنِ عَبْدِ اللَّهِ بْنِ أَرْقَمَ الزُّهْرِيِّ يَأْمُرُهُ أَنْ يَدْخُلَ عَلَى سُبَيْعَةَ بِنْتِ الْحَارِثِ الأَسْلَمِيَّةِ فَيَسْأَلَهَا حَدِيثَهَا وَعَمَّا قَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ اسْتَفْتَتْهُ فَكَتَبَ عُمَرُ بْنُ عَبْدِ اللَّهِ إِلَى عَبْدِ اللَّهِ بْنِ عُتْبَةَ يُخْبِرُهُ أَنَّ سُبَيْعَةَ أَخْبَرَتْهُ أَنَّهَا كَانَتْ تَحْتَ سَعْدِ ابْنِ خَوْلَةَ - وَهُوَ مِنْ بَنِي عَامِرِ بْنِ لُؤَىٍّ وَكَانَ مِمَّنْ شَهِدَ بَدْرًا فَتُوُفِّيَ عَنْهَا زَوْجُهَا فِي حَجَّةِ الْوَدَاعِ وَهِيَ حَامِلٌ - فَلَمْ تَنْشَبْ أَنْ وَضَعَتْ حَمْلَهَا بَعْدَ وَفَاتِهِ فَلَمَّا تَعَلَّتْ مِنْ نِفَاسِهَا تَجَمَّلَتْ لِلْخُطَّابِ فَدَخَلَ عَلَيْهَا أَبُو السَّنَابِلِ بْنُ بَعْكَكٍ - رَجُلٌ مِنْ بَنِي عَبْدِ الدَّارِ - فَقَالَ لَهَا مَا لِي أَرَاكِ مُتَجَمِّلَةً لَعَلَّكِ تُرِيدِينَ النِّكَاحَ إِنَّكِ وَاللَّهِ مَا أَنْتِ بِنَاكِحٍ حَتَّى تَمُرَّ عَلَيْكِ أَرْبَعَةُ أَشْهُرٍ وَعَشْرًا ‏.‏ قَالَتْ سُبَيْعَةُ فَلَمَّا قَالَ لِي ذَلِكَ جَمَعْتُ عَلَىَّ ثِيَابِي حِينَ أَمْسَيْتُ فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَسَأَلْتُهُ عَنْ ذَلِكَ فَأَفْتَانِي بِأَنِّي قَدْ حَلَلْتُ حِينَ وَضَعْتُ حَمْلِي وَأَمَرَنِي بِالتَّزْوِيجِ إِنْ بَدَا لِي ‏.‏",
    "malay_translation": "Yunus bin Abdul A'la meriwayatkan, katanya: Ibn Wahb meriwayatkan, katanya: Yunus meriwayatkan daripada Ibn Syihab, bahawa Ubaidullah bin Abdullah memberitahunya bahawa bapanya menulis kepada Umar bin Abdullah bin Arqam Az-Zuhri, menyuruhnya masuk menemui Subai'ah binti Al-Harith Al-Aslamiyyah dan bertanya kepadanya tentang hadisnya dan apa yang dikatakan Rasulullah SAW kepadanya ketika dia meminta fatwa. Umar bin Abdullah menulis balik kepada Abdullah bin Utbah, memberitahunya bahawa Subai'ah memberitahunya bahawa dia berada di bawah jagaan Sa'ad bin Khawlah - dia daripada Bani Amir bin Luayy dan merupakan antara yang menyaksikan Perang Badar - dan suaminya meninggal dunia ketika Haji Wada' ketika dia sedang hamil.  Dia melahirkan anaknya selepas kematian suaminya. Apabila suci daripada nifas, dia berhias untuk menerima lamaran. Abu As-Sanabil bin Ba'kak - seorang lelaki daripada Bani Abdul Dar - datang kepadanya dan berkata, \"Mengapa aku melihatmu berhias? Mungkin engkau ingin berkahwin. Demi Allah, engkau tidak boleh berkahwin sehingga empat bulan dan sepuluh hari berlalu.\" Subai'ah berkata: \"Apabila dia berkata demikian kepadaku, aku segera mengenakan pakaianku pada waktu petang dan pergi kepada Rasulullah SAW untuk bertanya tentang hal itu. Baginda memberikan fatwa bahawa aku telah dihalalkan berkahwin apabila aku melahirkan anakku, dan baginda menyuruhku untuk berkahwin jika aku mahu.\""
  },
  {
    "id": 18261,
    "hadith_number": 3525,
    "tajuk_hadith": "Tempoh Iddah dan Perkahwinan Semula",
    "perawi_melayu": "Dari Yazid bin Abi Habib bahawa Muhammad bin Muslim Az-Zuhri telah menulis kepadanya menyebut bahawa 'Ubaidullah bin 'Abdullah memberitahunya, bahawa Zufar bin Aws bin Al-Hadathan An-Nasri memberitahunya bahawa Abu As-Sanabil bin Ba'kak bin As-Sabbaq berkata kepada Subai'ah Al-Aslamiyyah:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ وَهْبٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنِي أَبُو عَبْدِ الرَّحِيمِ، قَالَ حَدَّثَنِي زَيْدُ بْنُ أَبِي أُنَيْسَةَ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ الزُّهْرِيِّ، قَالَ كَتَبَ إِلَيْهِ يَذْكُرُ أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ حَدَّثَهُ أَنَّ زُفَرَ بْنَ أَوْسِ بْنِ الْحَدَثَانِ النَّصْرِيَّ حَدَّثَهُ أَنَّ أَبَا السَّنَابِلِ بْنَ بَعْكَكِ بْنِ السَّبَّاقِ قَالَ لِسُبَيْعَةَ الأَسْلَمِيَّةِ لاَ تَحِلِّينَ حَتَّى يَمُرَّ عَلَيْكِ أَرْبَعَةُ أَشْهُرٍ وَعَشْرًا أَقْصَى الأَجَلَيْنِ ‏.‏ فَأَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَسَأَلَتْهُ عَنْ ذَلِكَ فَزَعَمَتْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَفْتَاهَا أَنْ تَنْكِحَ إِذَا وَضَعَتْ حَمْلَهَا وَكَانَتْ حُبْلَى فِي تِسْعَةِ أَشْهُرٍ حِينَ تُوُفِّيَ زَوْجُهَا وَكَانَتْ تَحْتَ سَعْدِ ابْنِ خَوْلَةَ فَتُوُفِّيَ فِي حَجَّةِ الْوَدَاعِ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَنَكَحَتْ فَتًى مِنْ قَوْمِهَا حِينَ وَضَعَتْ مَا فِي بَطْنِهَا ‏.‏",
    "malay_translation": "Diriwayatkan daripada Yazid bin Abi Habib bahawa Muhammad bin Muslim Az-Zuhri telah menulis kepadanya menyebut bahawa 'Ubaidullah bin 'Abdullah memberitahunya, bahawa Zufar bin Aws bin Al-Hadathan An-Nasri memberitahunya bahawa Abu As-Sanabil bin Ba'kak bin As-Sabbaq berkata kepada Subai'ah Al-Aslamiyyah: \"Engkau tidak halal (untuk berkahwin) sehingga berlalu padamu empat bulan dan sepuluh hari, tempoh yang paling lama.\" Maka Subai'ah datang kepada Rasulullah SAW dan bertanya tentang hal itu.  Dia mendakwa bahawa Rasulullah SAW memberi fatwa kepadanya supaya berkahwin setelah melahirkan anaknya.  Ketika itu, dia sedang hamil sembilan bulan ketika suaminya meninggal dunia. Suaminya ialah Saad bin Khawlah yang meninggal dunia ketika Haji Wada' bersama Rasulullah SAW.  Kemudian dia berkahwin dengan seorang pemuda daripada kaumnya setelah melahirkan anaknya."
  },
  {
    "id": 18262,
    "hadith_number": 3526,
    "tajuk_hadith": "Perkahwinan Selepas Melahirkan",
    "perawi_melayu": "Daripada Ubaidullah bin Abdullah bahawa Abdullah bin Utbah menulis kepada Umar bin Abdullah bin Al-Arqam Az-Zuhri, memberitahunya:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا كَثِيرُ بْنُ عُبَيْدٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، عَنِ الزُّبَيْدِيِّ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُتْبَةَ، كَتَبَ إِلَى عُمَرَ بْنِ عَبْدِ اللَّهِ بْنِ الأَرْقَمِ الزُّهْرِيِّ أَنِ ادْخُلْ، عَلَى سُبَيْعَةَ بِنْتِ الْحَارِثِ الأَسْلَمِيَّةِ فَاسْأَلْهَا عَمَّا أَفْتَاهَا بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَمْلِهَا ‏.‏ قَالَ فَدَخَلَ عَلَيْهَا عُمَرُ بْنُ عَبْدِ اللَّهِ فَسَأَلَهَا فَأَخْبَرَتْهُ أَنَّهَا كَانَتْ تَحْتَ سَعْدِ ابْنِ خَوْلَةَ - وَكَانَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم مِمَّنْ شَهِدَ بَدْرًا - فَتُوُفِّيَ عَنْهَا فِي حَجَّةِ الْوَدَاعِ فَوَلَدَتْ قَبْلَ أَنْ تَمْضِيَ لَهَا أَرْبَعَةُ أَشْهُرٍ وَعَشْرًا مِنْ وَفَاةِ زَوْجِهَا فَلَمَّا تَعَلَّتْ مِنْ نِفَاسِهَا دَخَلَ عَلَيْهَا أَبُو السَّنَابِلِ - رَجُلٌ مِنْ بَنِي عَبْدِ الدَّارِ - فَرَآهَا مُتَجَمِّلَةً فَقَالَ لَعَلَّكِ تُرِيدِينَ النِّكَاحَ قَبْلَ أَنْ تَمُرَّ عَلَيْكِ أَرْبَعَةُ أَشْهُرٍ وَعَشْرًا ‏.‏ قَالَتْ فَلَمَّا سَمِعْتُ ذَلِكَ مِنْ أَبِي السَّنَابِلِ جِئْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَحَدَّثْتُهُ حَدِيثِي ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ قَدْ حَلَلْتِ حِينَ وَضَعْتِ حَمْلَكِ ‏\"‏ ‏.‏",
    "malay_translation": "Kami diberitakan oleh Kasyir bin Ubaid, katanya;  Kami diberitakan oleh Muhammad bin Harb, daripada Az-Zubaidi, daripada Az-Zuhri, daripada Ubaidullah bin Abdullah, bahawa Abdullah bin Utbah menulis kepada Umar bin Abdullah bin Arqam Az-Zuhri: “Pergilah kepada Subai’ah binti Al-Harits Al-Aslamiyyah dan tanyakan kepadanya tentang hukum yang diberikan oleh Rasulullah SAW mengenai kehamilannya.”  Maka Umar bin Abdullah pergi kepadanya dan bertanya.  Dia memberitahu bahawa dia telah berkahwin dengan Saad bin Khawlah, yang merupakan salah seorang sahabat Rasulullah SAW yang telah hadir di Badar. Dia meninggal dunia ketika Haji Wada’, dan Subai’ah melahirkan sebelum genap empat bulan sepuluh hari selepas kematian suaminya. Setelah dia suci daripada nifas, Abu As-Sanabil –seorang lelaki daripada Bani Abd ad-Dar– datang kepadanya dan melihatnya telah berhias. Dia berkata: “Mungkin kamu hendak berkahwin sebelum genap empat bulan sepuluh hari?” Subai’ah berkata: “Setelah aku mendengar itu daripada Abu As-Sanabil, aku datang kepada Rasulullah SAW dan menceritakan hal kejadian ini.  Rasulullah SAW bersabda: “Sesungguhnya kamu telah halal (untuk berkahwin) apabila kamu telah melahirkan anakmu.”"
  },
  {
    "id": 18263,
    "hadith_number": 3527,
    "tajuk_hadith": "Kisah Subai'ah dan Pendapat Ibn Mas'ud",
    "perawi_melayu": "Daripada Muhammad yang meriwayatkan:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ مُحَمَّدٍ، قَالَ كُنْتُ جَالِسًا فِي نَاسٍ بِالْكُوفَةِ فِي مَجْلِسٍ - لِلأَنْصَارِ - عَظِيمٍ فِيهِمْ عَبْدُ الرَّحْمَنِ بْنُ أَبِي لَيْلَى فَذَكَرُوا شَأْنَ سُبَيْعَةَ فَذَكَرْتُ عَنْ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ فِي مَعْنَى قَوْلِ ابْنِ عَوْنٍ حَتَّى تَضَعَ ‏.‏ قَالَ ابْنُ أَبِي لَيْلَى لَكِنَّ عَمَّهُ لاَ يَقُولُ ذَلِكَ فَرَفَعْتُ صَوْتِي وَقُلْتُ إِنِّي لَجَرِيءٌ أَنْ أَكْذِبَ عَلَى عَبْدِ اللَّهِ بْنِ عُتْبَةَ وَهُوَ فِي نَاحِيَةِ الْكُوفَةِ ‏.‏ قَالَ فَلَقِيتُ مَالِكًا قُلْتُ كَيْفَ كَانَ ابْنُ مَسْعُودٍ يَقُولُ فِي شَأْنِ سُبَيْعَةَ قَالَ قَالَ أَتَجْعَلُونَ عَلَيْهَا التَّغْلِيظَ وَلاَ تَجْعَلُونَ لَهَا الرُّخْصَةَ لأُنْزِلَتْ سُورَةُ النِّسَاءِ الْقُصْرَى بَعْدَ الطُّولَى ‏.‏",
    "malay_translation": "Aku diberitahu oleh Muhammad bin Abdil A'la, katanya:  Aku diberitahu oleh Khalid, katanya:  Aku diberitahu oleh Ibn 'Awn daripada Muhammad yang berkata:  Aku sedang duduk bersama beberapa orang di Kufah dalam majlis yang besar dihadiri kaum Ansar, antaranya ialah Abdur-Rahman bin Abi Laila.  Mereka membincangkan hal Subai'ah, lalu aku menyebutkan apa yang telah dikatakan oleh Abdullah bin Utbah bin Mas'ud, iaitu seperti kata Ibn 'Awn: \"Sehinggalah dia melahirkan.\"  Kata Ibn Abi Laila: \"Tetapi bapa saudaranya tidak mengatakan demikian.\"  Lalu aku meninggikan suara dan berkata: \"Adakah aku berani berdusta terhadap Abdullah bin Utbah sedangkan dia berada di kawasan Kufah?\" Katanya: Kemudian aku bertemu Malik, lalu aku bertanya: \"Bagaimana pendapat Ibn Mas'ud tentang kisah Subai'ah?\"  Dia menjawab: \"Dia berkata: \"Adakah kamu akan bersikap keras terhadapnya dan tidak memberi kelonggaran kepadanya (berkenaan iddah)?  Surah tentang wanita yang pendek (At-Talaq) diturunkan selepas surah yang panjang (Al-Baqarah).\""
  },
  {
    "id": 18264,
    "hadith_number": 3528,
    "tajuk_hadith": "Mengenai Tempoh Iddah Wanita Hamil",
    "perawi_melayu": "Daripada Alqamah bin Qais bahawa Ibnu Mas'ud berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ مِسْكِينِ بْنِ نُمَيْلَةَ، - يَمَامِيٌّ - قَالَ أَنْبَأَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وَأَخْبَرَنِي مَيْمُونُ بْنُ الْعَبَّاسِ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ الْحَكَمِ بْنِ أَبِي مَرْيَمَ، قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنِي ابْنُ شُبْرُمَةَ الْكُوفِيُّ، عَنْ إِبْرَاهِيمَ النَّخَعِيِّ، عَنْ عَلْقَمَةَ بْنِ قَيْسٍ، أَنَّ ابْنَ مَسْعُودٍ، قَالَ مَنْ شَاءَ لاَعَنْتُهُ مَا أُنْزِلَتْ ‏{‏ وَأُولاَتُ الأَحْمَالِ أَجَلُهُنَّ أَنْ يَضَعْنَ حَمْلَهُنَّ ‏}‏ إِلاَّ بَعْدَ آيَةِ الْمُتَوَفَّى عَنْهَا زَوْجُهَا إِذَا وَضَعَتِ الْمُتَوَفَّى عَنْهَا زَوْجُهَا فَقَدْ حَلَّتْ وَاللَّفْظُ لِمَيْمُونٍ ‏.‏",
    "malay_translation": "Aku diberitahu oleh Muhammad bin Miskin bin Numailah – seorang lelaki dari Yamamah – katanya, “Aku diberitahu oleh Sa’id bin Abi Maryam, katanya, “Aku diberitahu oleh Muhammad bin Ja’far.” Dan aku diberitahu oleh Maimun bin Abbas, katanya, “Telah menceritakan kepada kami Sa’id bin Al-Hakam bin Abi Maryam, katanya, “Aku diberitahu oleh Muhammad bin Ja’far, katanya, “Telah menceritakan kepadaku Ibnu Syubrumah Al-Kufi daripada Ibrahim An-Nakha’i, daripada Alqamah bin Qais bahawa Ibnu Mas’ud berkata:  “Sesiapa yang mahu, aku akan berdebat dengannya dan akan memohon laknat Allah ke atas mereka yang berdusta. Ayat  (وَأُولَاتُ الأَحْمَالِ أَجَلُهُنَّ أَنْ يَضَعْنَ حَمْلَهُنَّ)  “Dan bagi wanita-wanita yang hamil, tempoh iddah mereka ialah sehingga mereka melahirkan kandungannya” tidak diturunkan melainkan selepas ayat mengenai wanita yang suaminya telah meninggal dunia:  “Apabila wanita yang suaminya telah meninggal dunia melahirkan anaknya, maka halal baginya untuk berkahwin.”  (Lafadz ini menurut riwayat Maimun)."
  },
  {
    "id": 18265,
    "hadith_number": 3529,
    "tajuk_hadith": "Surah At-Talaq Diturunkan Selepas Surah Al-Baqarah",
    "perawi_melayu": "Abdullah melalui beberapa perawi seperti Abu Dawud, Hasan bin A'yan, Zuhri, Muhammad bin Ismail bin Ibrahim, Yahya, dan Zuhri bin Muawiyah, Abu Ishaq, Aswad, Masruq dan Ubaidah.",
    "english_text": "It was narrated from 'Abdullah that the shorter Surah, that speaks of women (At-Talaq), was revealed after Al-Baqarah.",
    "arabic_text": "أَخْبَرَنَا أَبُو دَاوُدَ، سُلَيْمَانُ بْنُ سَيْفٍ قَالَ حَدَّثَنَا الْحَسَنُ، وَهُوَ ابْنُ أَعْيَنَ قَالَ حَدَّثَنَا زُهَيْرٌ، ح وَأَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا زُهَيْرُ بْنُ مُعَاوِيَةَ، قَالَ حَدَّثَنَا أَبُو إِسْحَاقَ، عَنِ الأَسْوَدِ، وَمَسْرُوقٍ، وَعَبِيدَةَ، عَنْ عَبْدِ اللَّهِ، أَنَّ سُورَةَ النِّسَاءِ الْقُصْرَى، نَزَلَتْ بَعْدَ الْبَقَرَةِ ‏.‏",
    "malay_translation": "Daripada Abdullah – melalui beberapa orang perawi seperti Abu Dawud, Hasan bin A’yan, Zuhri, Muhammad bin Ismail bin Ibrahim, Yahya, dan Zuhri bin Muawiyah, Abu Ishaq, Aswad, Masruq dan Ubaidah – bahawa Surah At-Talaq (surah yang pendek yang membicarakan tentang wanita) diturunkan selepas Surah Al-Baqarah."
  },
  {
    "id": 18266,
    "hadith_number": 3530,
    "tajuk_hadith": "Mas Kahwin dan Hak Waris Wanita",
    "perawi_melayu": "Daripada Ibnu Mas'ud",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنِ ابْنِ مَسْعُودٍ، أَنَّهُ سُئِلَ عَنْ رَجُلٍ، تَزَوَّجَ امْرَأَةً وَلَمْ يَفْرِضْ لَهَا صَدَاقًا وَلَمْ يَدْخُلْ بِهَا حَتَّى مَاتَ قَالَ ابْنُ مَسْعُودٍ لَهَا مِثْلُ صَدَاقِ نِسَائِهَا لاَ وَكْسَ وَلاَ شَطَطَ وَعَلَيْهَا الْعِدَّةُ وَلَهَا الْمِيرَاثُ ‏.‏ فَقَامَ مَعْقِلُ بْنُ سِنَانٍ الأَشْجَعِيُّ فَقَالَ قَضَى فِينَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي بِرْوَعَ بِنْتِ وَاشِقٍ - امْرَأَةٍ مِنَّا - مِثْلَ مَا قَضَيْتَ ‏.‏ فَفَرِحَ ابْنُ مَسْعُودٍ رضى الله عنه ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Mahmud bin Ghailan, katanya; telah menceritakan kepada kami Zaid bin Al-Hubab, katanya; telah menceritakan kepada kami Sufyan, daripada Mansur, daripada Ibrahim, daripada Al-Alaqamah, daripada Ibnu Mas'ud bahawa beliau ditanya tentang seorang lelaki yang mengahwini seorang wanita, tetapi tidak menetapkan mahar kepadanya dan tidak menidurinya sehingga dia meninggal dunia. Ibnu Mas'ud berkata: \"Wanita itu berhak mendapat mahar seperti wanita-wanita lain seumpama dia, tidak kurang dan tidak lebih, dan dia wajib beriddah dan berhak mendapat harta pusaka.\"  Kemudian bangunlah Ma'qil bin Sinan Al-Asy'ari lalu berkata: \"Rasulullah SAW telah membuat keputusan yang sama dalam kes Birwa' binti Wasik - seorang wanita daripada kalangan kami - seperti keputusan yang tuan buat.\" Lalu Ibnu Mas'ud gembira."
  },
  {
    "id": 18267,
    "hadith_number": 3531,
    "tajuk_hadith": "Tempoh Menangis Ke Atas Kematian",
    "perawi_melayu": "Daripada Aisyah r.a., bahawa Rasulullah s.a.w. bersabda:",
    "english_text": "\"It is not permissible for a woman to mourn for anyone who dies for more than three days, except for her husband.\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تَحِدُّ عَلَى مَيِّتٍ أَكْثَرَ مِنْ ثَلاَثٍ إِلاَّ عَلَى زَوْجِهَا ‏\"‏ ‏.‏",
    "malay_translation": "Tidak halal bagi seorang perempuan untuk menangisi orang mati lebih daripada tiga hari, kecuali untuk suaminya."
  },
  {
    "id": 18268,
    "hadith_number": 3532,
    "tajuk_hadith": "Tempoh Mengadu Dukh Cita",
    "perawi_melayu": "Daripada Aisyah r.a. bahawa Nabi s.a.w. bersabda:",
    "english_text": "\"It is not permissible for a woman who believes in Allah and the Last Day to mourn for more than three days, except for her husband.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، قَالَ حَدَّثَنَا حَبَّانُ، قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ كَثِيرٍ، قَالَ حَدَّثَنَا الزُّهْرِيُّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ تَحِدَّ فَوْقَ ثَلاَثَةِ أَيَّامٍ إِلاَّ عَلَى زَوْجٍ ‏\"‏ ‏.‏",
    "malay_translation": "Tidak halal bagi seorang wanita yang beriman kepada Allah dan hari akhirat untuk berkabung lebih daripada tiga hari, kecuali atas kematian suaminya."
  },
  {
    "id": 18269,
    "hadith_number": 3533,
    "tajuk_hadith": "Tempoh Berkabung Wanita Muslim",
    "perawi_melayu": "Daripada Zainab binti Abi Salamah bahawa Umm Habibah berkata:",
    "english_text": "\"I heard the Messenger of Allah say this on this Minbar: 'It is not permissible for a woman who believes in Allah and His Messenger to mourn for anyone who dies for more than three days, except for a husband, (for whom the mourning period is) four months and ten days.'\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي أَيُّوبُ بْنُ مُوسَى، عَنْ حُمَيْدِ بْنِ نَافِعٍ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، أَنَّ أُمَّ حَبِيبَةَ، قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ عَلَى هَذَا الْمِنْبَرِ ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَرَسُولِهِ أَنْ تَحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثِ لَيَالٍ إِلاَّ عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda di atas mimbar ini:  \"Tidak halal bagi seorang wanita yang beriman kepada Allah dan Rasul-Nya untuk berkabung melebihi tiga hari, kecuali bagi suaminya, (tempoh berkabungnya) empat bulan sepuluh hari.\""
  },
  {
    "id": 18270,
    "hadith_number": 3534,
    "tajuk_hadith": "Menunggu Tempoh Iddah",
    "perawi_melayu": "Daripada Al-Fari'ah binti Malik bahawa suaminya pergi mencari hamba dan mereka membunuhnya.  Shu'bah dan Ibn Juraij berkata:",
    "english_text": "\"She was in a remote house. She came with her brothers to the Messenger of Allah and told him (about the situation) and he granted her a concession. When she was leaving he called her back and said: 'Stay in your house until the term prescribed is fulfilled.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا ابْنُ إِدْرِيسَ، عَنْ شُعْبَةَ، وَابْنِ، جُرَيْجٍ وَيَحْيَى بْنِ سَعِيدٍ وَمُحَمَّدِ بْنِ إِسْحَاقَ عَنْ سَعْدِ بْنِ إِسْحَاقَ، عَنْ زَيْنَبَ بِنْتِ كَعْبٍ، عَنِ الْفَارِعَةِ بِنْتِ مَالِكٍ، أَنَّ زَوْجَهَا، خَرَجَ فِي طَلَبِ أَعْلاَجٍ فَقَتَلُوهُ - قَالَ شُعْبَةُ وَابْنُ جُرَيْجٍ وَكَانَتْ فِي دَارٍ قَاصِيَةٍ فَجَاءَتْ وَمَعَهَا أَخُوهَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرُوا لَهُ فَرَخَّصَ لَهَا حَتَّى إِذَا رَجَعَتْ دَعَاهَا فَقَالَ ‏\n\"‏ اجْلِسِي فِي بَيْتِكِ حَتَّى يَبْلُغَ الْكِتَابُ أَجَلَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Dia berada di sebuah rumah yang jauh.  Dia datang bersama saudara-saudaranya kepada Rasulullah SAW dan menceritakan (keadaannya) lalu baginda memberi kelonggaran kepadanya.  Ketika dia hendak pulang, baginda memanggilnya kembali dan berkata: 'Tinggallah di rumahmu sehingga tempoh yang ditetapkan telah berakhir.'"
  },
  {
    "id": 18271,
    "hadith_number": 3535,
    "tajuk_hadith": "Iddah Selepas Kematian Suami",
    "perawi_melayu": "Daripada Al-Furai'ah binti Malik bahawa suaminya telah mengupah beberapa orang hamba untuk bekerja baginya dan mereka telah membunuhnya.  Dia telah menceritakan perkara itu kepada Rasulullah SAW dan berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ يَزِيدَ بْنِ مُحَمَّدٍ، عَنْ سَعْدِ بْنِ إِسْحَاقَ، عَنْ عَمَّتِهِ، زَيْنَبَ بِنْتِ كَعْبٍ عَنِ الْفُرَيْعَةِ بِنْتِ مَالِكٍ، أَنَّ زَوْجَهَا، تَكَارَى عُلُوجًا لِيَعْمَلُوا لَهُ فَقَتَلُوهُ فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَقَالَتْ إِنِّي لَسْتُ فِي مَسْكَنٍ لَهُ وَلاَ يَجْرِي عَلَىَّ مِنْهُ رِزْقٌ أَفَأَنْتَقِلُ إِلَى أَهْلِي وَيَتَامَاىَ وَأَقُومُ عَلَيْهِمْ قَالَ ‏\"‏ افْعَلِي ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ كَيْفَ قُلْتِ ‏\"‏ ‏.‏ فَأَعَادَتْ عَلَيْهِ قَوْلَهَا قَالَ ‏\"‏ اعْتَدِّي حَيْثُ بَلَغَكِ الْخَبَرُ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah, katanya: Telah menceritakan kepada kami Laith, daripada Yazid bin Abi Habib, daripada Yazid bin Muhammad, daripada Saad bin Ishaq, daripada makciknya, Zainab binti Ka'ab, daripada Al-Furai'ah binti Malik bahawa suaminya telah mengupah beberapa orang hamba untuk bekerja baginya lalu mereka membunuhnya. Maka dia menceritakan perkara itu kepada Rasulullah SAW dan berkata: \"Sesungguhnya aku tidak tinggal di rumahnya dan aku tidak menerima nafkah darinya. Patutkah aku berpindah kepada keluargaku dan anak-anak yatimku dan aku menjaga mereka?\" Baginda SAW bersabda: \"Buatlah.\" Kemudian Baginda bertanya: \"Bagaimana engkau berkata?\"  Lalu dia mengulang kembali perkataannya. Baginda SAW bersabda: \"Tunaikan iddahmu di tempat kamu menerima berita itu.\""
  },
  {
    "id": 18272,
    "hadith_number": 3536,
    "tajuk_hadith": "Menunggu Tempoh Iddah",
    "perawi_melayu": "Daripada Furai'ah bahawa suaminya keluar mencari hamba-hambanya dan dia terbunuh di pinggir Al-Qadum.  Dia berkata:",
    "english_text": "\"I came to the Prophet and mentioned moving to (join) my family.\" She told him about her situation. She said: \"He allowed me, then, when I turned to leave, he called me back and said: 'Stay with your family until the term prescribed is fulfilled.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ سَعْدِ بْنِ إِسْحَاقَ، عَنْ زَيْنَبَ، عَنْ فُرَيْعَةَ، أَنَّ زَوْجَهَا، خَرَجَ فِي طَلَبِ أَعْلاَجٍ لَهُ فَقُتِلَ بِطَرَفِ الْقَدُّومِ - قَالَتْ - فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَذَكَرْتُ لَهُ النُّقْلَةَ إِلَى أَهْلِي وَذَكَرَتْ لَهُ حَالاً مِنْ حَالِهَا - قَالَتْ - فَرَخَّصَ لِي فَلَمَّا أَقْبَلْتُ نَادَانِي فَقَالَ ‏\n\"‏ امْكُثِي فِي أَهْلِكِ حَتَّى يَبْلُغَ الْكِتَابُ أَجَلَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Aku menghadap Nabi SAW dan menceritakan hasratku untuk berpindah kepada keluargaku. Aku menceritakan keadaanku kepadanya.  Baginda membenarkan aku. Namun, ketika aku hendak beredar, Baginda memanggilku semula dan bersabda: “Tinggallah bersama keluargamu sehingga tempoh iddah berakhir.”"
  },
  {
    "id": 18273,
    "hadith_number": 3537,
    "tajuk_hadith": "Penggantian Tempoh Iddah Wanita",
    "perawi_melayu": "Daripada Ibnu Abbas",
    "english_text": "without turning them out.",
    "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَزِيدُ، قَالَ حَدَّثَنَا وَرْقَاءُ، عَنِ ابْنِ أَبِي نَجِيحٍ، قَالَ عَطَاءٌ عَنِ ابْنِ عَبَّاسٍ، نَسَخَتْ هَذِهِ الآيَةُ عِدَّتَهَا فِي أَهْلِهَا فَتَعْتَدُّ حَيْثُ شَاءَتْ وَهُوَ قَوْلُ اللَّهِ عَزَّ وَجَلَّ ‏{‏ غَيْرَ إِخْرَاجٍ ‏}‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada saya Muhammad bin Ismail bin Ibrahim, katanya; telah menceritakan kepada kami Yazid, katanya; telah menceritakan kepada kami Warqoa', daripada Ibnu Abi Najih, katanya; Ata' daripada Ibnu Abbas berkata bahawa ayat ini telah mensahkan tempoh iddah bagi wanita di kalangan keluarganya, maka dia boleh menjalani iddah di mana sahaja dia suka.  Dan ini adalah firman Allah SWT  {غَيْرَ إِخْرَاجٍ}."
  },
  {
    "id": 18274,
    "hadith_number": 3538,
    "tajuk_hadith": "Iddah Selepas Kematian Suami",
    "perawi_melayu": "Furai'ah binti Malik, adik perempuan Abu Sa'eed Al-Khudri berkata:",
    "english_text": "\"My husband died in Al-Qadum, so I went to the Prophet and told him that our house was remote.\" He gave her permission then he called her back and said: \"Stay in your house for four months and ten days, until the term prescribed is fulfilled.\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ سَعْدِ بْنِ إِسْحَاقَ، قَالَ حَدَّثَتْنِي زَيْنَبُ بِنْتُ كَعْبٍ، قَالَتْ حَدَّثَتْنِي فُرَيْعَةُ بِنْتُ مَالِكٍ، أُخْتُ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَتْ تُوُفِّيَ زَوْجِي بِالْقَدُّومِ فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَذَكَرْتُ لَهُ أَنَّ دَارَنَا شَاسِعَةٌ فَأَذِنَ لَهَا ثُمَّ دَعَاهَا فَقَالَ ‏\n\"‏ امْكُثِي فِي بَيْتِكِ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا حَتَّى يَبْلُغَ الْكِتَابُ أَجَلَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Suamiku meninggal dunia di Al-Qadum, maka aku pergi kepada Nabi SAW dan memberitahunya bahawa rumah kami jauh.  Baginda memberi kebenaran kepadaku, kemudian Baginda memanggilku semula dan bersabda: \"Tinggallah di rumahmu selama empat bulan sepuluh hari, sehingga tempoh yang telah ditetapkan itu berakhir.\""
  },
  {
    "id": 18275,
    "hadith_number": 3539,
    "tajuk_hadith": "Tempoh Berkabung Menurut Sunnah",
    "perawi_melayu": "Daripada Humaid bin Nafi', bahawa Zainab binti Abi Salamah telah menceritakan kepadanya tiga hadis ini. Zainab berkata:",
    "english_text": "\"I entered upon Umm Habibah, the wife of the Prophet, when her father Abu Sufyan bin Harb died. Umm Habibah called for some perfume and put some on a young girl, then she put some on her cheeks. Then she said: 'By Allah, I do not have any need for perfume but I heard the Messenger of Allah say: It is not permissible for any woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days, except for a husband, (for whom the mourning period is) four months and ten days.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، - وَاللَّفْظُ لَهُ - قَالَ أَنْبَأَنَا ابْنُ الْقَاسِمِ، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ حُمَيْدِ بْنِ نَافِعٍ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، أَنَّهَا أَخْبَرَتْهُ بِهَذِهِ الأَحَادِيثِ الثَّلاَثَةِ، قَالَتْ زَيْنَبُ دَخَلْتُ عَلَى أُمِّ حَبِيبَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم حِينَ تُوُفِّيَ أَبُوهَا أَبُو سُفْيَانَ بْنُ حَرْبٍ فَدَعَتْ أُمُّ حَبِيبَةَ بِطِيبٍ فَدَهَنَتْ مِنْهُ جَارِيَةً ثُمَّ مَسَّتْ بِعَارِضَيْهَا ثُمَّ قَالَتْ وَاللَّهِ مَا لِي بِالطِّيبِ مِنْ حَاجَةٍ غَيْرَ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ تَحِدُّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثِ لَيَالٍ إِلاَّ عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏ ‏.‏",
    "malay_translation": "Aku masuk menjenguk Umm Hababah, isteri Nabi SAW, ketika bapanya, Abu Sufyan bin Harb, meninggal dunia. Umm Hababah meminta minyak wangi, lalu menyapukannya pada seorang hamba perempuan, kemudian dia menyapukannya pada pipinya.  Lalu dia berkata: 'Demi Allah, aku tidak memerlukan minyak wangi, tetapi aku mendengar Rasulullah SAW bersabda: Tidak halal bagi seorang perempuan yang beriman kepada Allah dan hari akhirat untuk berkabung atas kematian seseorang melebihi tiga hari, kecuali bagi suaminya, (tempoh berkabungnya adalah) empat bulan sepuluh hari.'"
  },
  {
    "id": 18276,
    "hadith_number": 3540,
    "tajuk_hadith": "Tempoh Berkabung Menurut Rasulullah SAW",
    "perawi_melayu": "Zainab berkata:",
    "english_text": "\"Then I went into Zainab bint Jahsh when her brother died, and she called for some perfume and put some on. Then she said: 'By Allah, I do not have any need for perfume but I heard the Messenger of Allah say on the Minbar: It is not permissible for any woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days, except for a husband, (for whom the mourning period is) four months and ten days.'\"",
    "arabic_text": "قَالَتْ زَيْنَبُ ثُمَّ دَخَلْتُ عَلَى زَيْنَبَ بِنْتِ جَحْشٍ حِينَ تُوُفِّيَ أَخُوهَا وَقَدْ دَعَتْ بِطِيبٍ وَمَسَّتْ مِنْهُ ثُمَّ قَالَتْ وَاللَّهِ مَا لِي بِالطِّيبِ مِنْ حَاجَةٍ غَيْرَ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ عَلَى الْمِنْبَرِ ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ تَحِدُّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثِ لَيَالٍ إِلاَّ عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏ ‏.‏",
    "malay_translation": "Zainab berkata: Kemudian aku masuk menjenguk Zainab binti Jahsy ketika saudaranya meninggal dunia.  Dia telah memanggil minyak wangi dan menggunakannya. Kemudian dia berkata: 'Demi Allah, aku tidak memerlukan minyak wangi, tetapi aku mendengar Rasulullah SAW bersabda di atas mimbar: Tidak halal bagi mana-mana wanita yang beriman kepada Allah dan hari akhirat untuk berkabung atas kematian seseorang melebihi tiga hari, kecuali bagi suami (tempoh berkabungnya adalah) empat bulan sepuluh hari.'"
  },
  {
    "id": 18277,
    "hadith_number": 3541,
    "tajuk_hadith": "Iddah Wanita dan Amalan Jahiliyyah",
    "perawi_melayu": "Zainab berkata:",
    "english_text": "",
    "arabic_text": "وَقَالَتْ زَيْنَبُ سَمِعْتُ أُمَّ سَلَمَةَ، تَقُولُ جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ ابْنَتِي تُوُفِّيَ عَنْهَا زَوْجُهَا وَقَدِ اشْتَكَتْ عَيْنَهَا أَفَأَكْحُلُهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ إِنَّمَا هِيَ أَرْبَعَةُ أَشْهُرٍ وَعَشْرًا وَقَدْ كَانَتْ إِحْدَاكُنَّ فِي الْجَاهِلِيَّةِ تَرْمِي بِالْبَعْرَةِ عِنْدَ رَأْسِ الْحَوْلِ ‏\"‏ ‏.‏ قَالَ حُمَيْدٌ فَقُلْتُ لِزَيْنَبَ وَمَا تَرْمِي بِالْبَعْرَةِ عِنْدَ رَأْسِ الْحَوْلِ قَالَتْ زَيْنَبُ كَانَتِ الْمَرْأَةُ إِذَا تُوُفِّيَ عَنْهَا زَوْجُهَا دَخَلَتْ حِفْشًا وَلَبِسَتْ شَرَّ ثِيَابِهَا وَلَمْ تَمَسَّ طِيبًا وَلاَ شَيْئًا حَتَّى تَمُرَّ بِهَا سَنَةٌ ثُمَّ تُؤْتَى بِدَابَّةٍ حِمَارٍ أَوْ شَاةٍ أَوْ طَيْرٍ فَتَفْتَضُّ بِهِ فَقَلَّمَا تَفْتَضُّ بِشَىْءٍ إِلاَّ مَاتَ ثُمَّ تَخْرُجُ فَتُعْطَى بَعْرَةً فَتَرْمِي بِهَا وَتُرَاجِعُ بَعْدُ مَا شَاءَتْ مِنْ طِيبٍ أَوْ غَيْرِهِ ‏.‏ قَالَ مَالِكٌ تَفْتَضُّ تَمْسَحُ بِهِ فِي حَدِيثِ مُحَمَّدٍ ‏.‏ قَالَ مَالِكٌ الْحِفْشُ الْخُصُّ ‏.‏",
    "malay_translation": "Zainab berkata, \"Aku mendengar Umm Salamah berkata, 'Seorang wanita datang kepada Rasulullah SAW dan berkata, 'Wahai Rasulullah, suami anak perempuanku telah meninggal dunia dan matanya sakit. Bolehkah aku memakai kohl untuknya?' Rasulullah SAW menjawab, 'Tidak.' Kemudian Baginda bersabda, 'Tempohnya hanyalah empat bulan sepuluh hari. Pada zaman Jahiliyyah, salah seorang daripada kamu akan membaling seketul tahi pada penghujung tahun.'\" Humaid berkata, \"Aku bertanya kepada Zainab, 'Apakah maksud membaling seketul tahi pada penghujung tahun itu?' Zainab menjawab, 'Jika suami seorang wanita meninggal dunia, dia akan masuk ke dalam sebuah pondok kecil (hifsh) dan memakai pakaian yang paling buruk. Dia tidak akan memakai minyak wangi atau apa-apa sehingga setahun berlalu. Kemudian, seekor haiwan, sama ada keldai, biri-biri atau burung akan dibawa, dan dia akan membersihkan dirinya (iftatha) dengannya. Jarang sekali haiwan yang digunakan untuk tujuan itu tidak mati. Kemudian dia akan keluar dan diberi seketul tahi untuk dibaling, lalu dia akan kembali menggunakan minyak wangi atau apa sahaja yang diingininya.'\" Malik berkata, 'Dalam riwayat Muhammad (bin Salamah), iftatha bermaksud menyapu dengannya.' Malik juga berkata, 'Hifsh bermaksud pondok kecil.'"
  },
  {
    "id": 18278,
    "hadith_number": 3542,
    "tajuk_hadith": "Tempoh Menghadapi Kematian dan Adabnya",
    "perawi_melayu": "Daripada Ummu Atiyyah ra.",
    "english_text": "\"The Messenger of Allah said: 'No woman should mourn for anyone who dies for more than three days, except for a husband, for whom she should mourn for four months and ten days. She should not wear garments that are dyed or patterned, or put on kohl or comb her hair, and she should not put on any perfume except when purifying herself after her period, when she may use a little of Qust or Azfar.'\"",
    "arabic_text": "أَخْبَرَنَا حُسَيْنُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَحِدُّ امْرَأَةٌ عَلَى مَيِّتٍ فَوْقَ ثَلاَثٍ إِلاَّ عَلَى زَوْجٍ فَإِنَّهَا تَحِدُّ عَلَيْهِ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا وَلاَ تَلْبَسُ ثَوْبًا مَصْبُوغًا وَلاَ ثَوْبَ عَصْبٍ وَلاَ تَكْتَحِلُ وَلاَ تَمْتَشِطُ وَلاَ تَمَسُّ طِيبًا إِلاَّ عِنْدَ طُهْرِهَا حِينَ تَطْهُرُ نُبَذًا مِنْ قُسْطٍ وَأَظْفَارٍ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Tidaklah seorang wanita itu berkabung atas kematian seseorang melebihi tiga hari, kecuali atas kematian suaminya, kerana baginya tempoh berkabung ialah empat bulan sepuluh hari. Dan dia tidak dibenarkan memakai pakaian yang berwarna-warni atau bercorak, memakai celak mata, menyisir rambut, dan memakai minyak wangi kecuali ketika suci daripada haid, maka bolehlah dia menggunakan sedikit kasturi atau afzal.\""
  },
  {
    "id": 18279,
    "hadith_number": 3543,
    "tajuk_hadith": "Larangan Bagi Wanita Yang Suami Meninggal Dunia",
    "perawi_melayu": "Daripada Safiyyah binti Shaibah, daripada Ummu Salamah, isteri Nabi SAW, bahawa Nabi SAW bersabda:",
    "english_text": "\"The woman whose husband has died should not wear clothes that are dyed with safflower or red clay, and she should not use dye nor kohl.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ، قَالَ حَدَّثَنِي بُدَيْلٌ، عَنِ الْحَسَنِ بْنِ مُسْلِمٍ، عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ، عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْمُتَوَفَّى عَنْهَا زَوْجُهَا لاَ تَلْبَسُ الْمُعَصْفَرَ مِنَ الثِّيَابِ وَلاَ الْمُمَشَّقَةَ وَلاَ تَخْتَضِبُ وَلاَ تَكْتَحِلُ ‏\"‏ ‏.‏",
    "malay_translation": "Wanita yang suaminya telah meninggal dunia tidak boleh memakai pakaian yang diwarnakan dengan bunga pacar atau tanah liat merah, dan dia tidak boleh menggunakan pewarna atau  kohl."
  },
  {
    "id": 18280,
    "hadith_number": 3544,
    "tajuk_hadith": "Tempoh Berkabung Wanita Muslim",
    "perawi_melayu": "Daripada Ummu Atiyyah, bahawa Nabi SAW bersabda:",
    "english_text": "\"It is not permissible for a woman who believes in Allah and the Last Day, to mourn for anyone who dies for more than three days, except for a husband; she should not use kohl, dye nor wear dyed clothes.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا عَاصِمٌ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ تَحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثٍ إِلاَّ عَلَى زَوْجٍ وَلاَ تَكْتَحِلُ وَلاَ تَخْتَضِبُ وَلاَ تَلْبَسُ ثَوْبًا مَصْبُوغًا ‏\"‏ ‏.‏",
    "malay_translation": "Tidak halal bagi seorang wanita yang beriman kepada Allah dan hari akhirat untuk berkabung lebih daripada tiga hari ke atas kematian seseorang kecuali bagi suaminya.  Dia juga tidak boleh menggunakan kohl, memakai pewarna, atau memakai pakaian yang berwarna-warni."
  },
  {
    "id": 18281,
    "hadith_number": 3545,
    "tajuk_hadith": "Kegunaan Kohl dan Penjagaan Rambut",
    "perawi_melayu": "Umm Hakim binti Asid meriwayatkan daripada ibunya bahawa suaminya meninggal dunia dan beliau mengalami masalah pada matanya, maka beliau menggunakan kohl untuk membersihkan matanya. Beliau menghantar seorang hamba perempuan kepada Umm Salamah untuk bertanya tentang penggunaan kohl untuk membersihkan mata.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي مَخْرَمَةُ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ الْمُغِيرَةَ بْنَ الضَّحَّاكِ، يَقُولُ حَدَّثَتْنِي أُمُّ حَكِيمٍ بِنْتُ أَسِيدٍ، عَنْ أُمِّهَا، أَنَّ زَوْجَهَا، تُوُفِّيَ وَكَانَتْ تَشْتَكِي عَيْنَهَا فَتَكْتَحِلُ الْجِلاَءَ فَأَرْسَلَتْ مَوْلاَةً لَهَا إِلَى أُمِّ سَلَمَةَ فَسَأَلَتْهَا عَنْ كُحْلِ الْجِلاَءِ فَقَالَتْ لاَ تَكْتَحِلُ إِلاَّ مِنْ أَمْرٍ لاَ بُدَّ مِنْهُ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ تُوُفِّيَ أَبُو سَلَمَةَ وَقَدْ جَعَلْتُ عَلَى عَيْنِي صَبِرًا فَقَالَ ‏\"‏ مَا هَذَا يَا أُمَّ سَلَمَةَ ‏\"‏ ‏.‏ قُلْتُ إِنَّمَا هُوَ صَبِرٌ يَا رَسُولَ اللَّهِ لَيْسَ فِيهِ طِيبٌ ‏.‏ قَالَ ‏\"‏ إِنَّهُ يَشُبُّ الْوَجْهَ فَلاَ تَجْعَلِيهِ إِلاَّ بِاللَّيْلِ وَلاَ تَمْتَشِطِي بِالطِّيبِ وَلاَ بِالْحِنَّاءِ فَإِنَّهُ خِضَابٌ ‏\"‏ ‏.‏ قُلْتُ بِأَىِّ شَىْءٍ أَمْتَشِطُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ بِالسِّدْرِ تُغَلِّفِينَ بِهِ رَأْسَكِ ‏\"‏ ‏.‏",
    "malay_translation": "Kami diberitakan oleh Ahmad bin Amru bin Sirh, katanya:  Kami diberitakan oleh Ibnu Wahb, katanya:  Makhramah memberitakan kepadaku daripada bapanya, katanya: Aku mendengar Mu'girah bin Dzuhakk berkata: Umm Hakim binti Asid memberitakan kepadaku daripada ibunya, bahawa suaminya telah meninggal dunia dan beliau mengalami masalah pada matanya, lalu beliau menggunakan kohl untuk membersihkan matanya.  Beliau menghantar seorang hamba perempuannya kepada Umm Salamah lalu bertanya tentang penggunaan kohl untuk membersihkan mata, maka beliau berkata: Janganlah kamu menggunakan kohl kecuali atas keperluan. Rasulullah SAW masuk menjengukku ketika Abu Salamah meninggal dunia, dan aku telah meletakkan jus lidah buaya pada mataku. Baginda bertanya, \"Apakah ini wahai Umm Salamah?\" Aku menjawab, \"Ini hanyalah jus lidah buaya wahai Rasulullah, ia tidak berwangian.\" Baginda berkata, \"Sesungguhnya ia mencerahkan wajah, maka janganlah kamu menggunakannya kecuali pada waktu malam, dan janganlah kamu menyisir rambutmu dengan minyak wangi atau inai kerana ia adalah pewarna.\" Aku bertanya, \"Dengan apakah aku menyisirnya wahai Rasulullah?\" Baginda menjawab, \"Dengan daun sidr, balutlah kepalamu dengannya.\""
  },
  {
    "id": 18282,
    "hadith_number": 3546,
    "tajuk_hadith": "Tempoh Iddah dan Penggunaan Kohl",
    "perawi_melayu": "Zainab binti Abi Salamah meriwayatkan bahawa ibunya, Ummu Salamah berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ، عَنْ أَبِيهِ، قَالَ حَدَّثَنَا أَيُّوبُ، - وَهُوَ ابْنُ مُوسَى - قَالَ حُمَيْدٌ وَحَدَّثَتْنِي زَيْنَبُ بِنْتُ أَبِي سَلَمَةَ، عَنْ أُمِّهَا أُمِّ سَلَمَةَ، قَالَتْ جَاءَتِ امْرَأَةٌ مِنْ قُرَيْشٍ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ ابْنَتِي رَمِدَتْ أَفَأَكْحُلُهَا ‏.‏ وَكَانَتْ مُتَوَفًّى عَنْهَا ‏.‏ فَقَالَ ‏\"‏ أَلاَ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏ ‏.‏ ثُمَّ قَالَتْ إِنِّي أَخَافُ عَلَى بَصَرِهَا فَقَالَ ‏\"‏ لاَ إِلاَّ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا قَدْ كَانَتْ إِحْدَاكُنَّ فِي الْجَاهِلِيَّةِ تَحِدُّ عَلَى زَوْجِهَا سَنَةً ثُمَّ تَرْمِي عَلَى رَأْسِ السَّنَةِ بِالْبَعْرَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Kami diberitahu oleh Rabiah bin Sulaiman, dia berkata: “Telah menceritakan kepada kami Shu’aib bin Laits, daripada bapanya, dia berkata: Telah menceritakan kepada kami Ayub – iaitu Ibnu Musa – dia berkata: Humaid dan Zainab binti Abi Salamah telah menceritakan kepadaku, daripada ibunya Ummu Salamah, katanya: “Seorang wanita dari Quraisy datang dan berkata, ‘Wahai Rasulullah, anak perempuan saya mengalami radang mata, bolehkah saya menggunakan kohl untuknya?’ (Anak perempuan itu) telah kematian suami. Maka Baginda berkata, ‘Tidak, melainkan empat bulan sepuluh hari.’ Kemudian wanita itu berkata, ‘Saya bimbang akan penglihatannya.’ Baginda berkata, ‘Tidak, melainkan empat bulan sepuluh hari.  Pada zaman Jahiliyyah, seorang wanita di antara kamu akan berkabung atas suaminya selama setahun, kemudian apabila setahun telah berlalu dia akan membuang seketul najis.’”"
  },
  {
    "id": 18283,
    "hadith_number": 3547,
    "tajuk_hadith": "Tempoh Iddah Wanita Yang Suaminya Meninggal Dunia",
    "perawi_melayu": "Daripada Zainab binti Abi Salamah, daripada ibunya, bahawa seorang wanita datang kepada Nabi SAW dan bertanya tentang anaknya perempuan yang suaminya telah meninggal dunia dan dia sedang sakit. Baginda SAW bersabda:",
    "english_text": "\"One of you used to mourn for a year, then throw a piece of dung when a year had passed. Rather it (the mourning period) is four months and ten days.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ حُمَيْدِ بْنِ نَافِعٍ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، عَنْ أُمِّهَا، أَنَّ امْرَأَةً، أَتَتِ النَّبِيَّ صلى الله عليه وسلم فَسَأَلَتْهُ عَنِ ابْنَتِهَا مَاتَ زَوْجُهَا وَهِيَ تَشْتَكِي قَالَ ‏\n\"‏ قَدْ كَانَتْ إِحْدَاكُنَّ تَحِدُّ السَّنَةَ ثُمَّ تَرْمِي الْبَعْرَةَ عَلَى رَأْسِ الْحَوْلِ وَإِنَّمَا هِيَ أَرْبَعَةُ أَشْهُرٍ وَعَشْرًا ‏\"‏ ‏.‏",
    "malay_translation": "Dahulu, ada di antara kamu yang berkabung selama setahun, kemudian membuang najis setelah setahun berlalu.  Tetapi tempohnya hanyalah empat bulan sepuluh hari."
  },
  {
    "id": 18284,
    "hadith_number": 3548,
    "tajuk_hadith": "Iddah Selepas Kematian Suami",
    "perawi_melayu": "Daripada Zainab binti Abi Salamah, daripada Ummu Salamah bahawa seorang wanita dari Quraisy datang kepada Rasulullah SAW dan berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْدَانَ بْنِ عِيسَى بْنِ مَعْدَانَ، قَالَ حَدَّثَنَا ابْنُ أَعْيَنَ، قَالَ حَدَّثَنَا زُهَيْرُ بْنُ مُعَاوِيَةَ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ حُمَيْدِ بْنِ نَافِعٍ، مَوْلَى الأَنْصَارِ عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، أَنَّ امْرَأَةً، مِنْ قُرَيْشٍ جَاءَتْ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ إِنَّ ابْنَتِي تُوُفِّيَ عَنْهَا زَوْجُهَا وَقَدْ خِفْتُ عَلَى عَيْنِهَا وَهِيَ تُرِيدُ الْكُحْلَ فَقَالَ ‏\n\"‏ قَدْ كَانَتْ إِحْدَاكُنَّ تَرْمِي بِالْبَعْرَةِ عَلَى رَأْسِ الْحَوْلِ وَإِنَّمَا هِيَ أَرْبَعَةُ أَشْهُرٍ وَعَشْرًا ‏\"‏ ‏.‏ فَقُلْتُ لِزَيْنَبَ مَا رَأْسُ الْحَوْلِ قَالَتْ كَانَتِ الْمَرْأَةُ فِي الْجَاهِلِيَّةِ إِذَا هَلَكَ زَوْجُهَا عَمَدَتْ إِلَى شَرِّ بَيْتٍ لَهَا فَجَلَسَتْ فِيهِ حَتَّى إِذَا مَرَّتْ بِهَا سَنَةٌ خَرَجَتْ فَرَمَتْ وَرَاءَهَا بِبَعْرَةٍ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Ma'dan bin Isa bin Ma'dan, dia berkata; telah menceritakan kepada kami Ibnu A'yan, dia berkata; telah menceritakan kepada kami Zuhair bin Mu'awiyah, dia berkata; telah menceritakan kepada kami Yahya bin Sa'id, daripada Humaid bin Nafi', hamba sahaya Ansar, daripada Zainab binti Abi Salamah, daripada Ummu Salamah, bahawa seorang wanita dari Quraisy datang kepada Rasulullah SAW lalu berkata: “Anak perempuanku telah meninggal suaminya, dan aku bimbang akan matanya kerana dia ingin memakai kohl.”  Rasulullah SAW bersabda:  “Dahulu salah seorang daripada kamu akan membuang najis selepas setahun berlalu.  Tetapi tempohnya hanyalah empat bulan sepuluh hari.”  Lalu aku bertanya kepada Zainab: “Apakah maksud ‘selepas setahun berlalu’?”  Zainab menjawab: “Pada zaman Jahiliyyah, jika suami seorang wanita meninggal dunia, dia akan pergi ke bilik yang paling buruk di rumahnya dan duduk di situ sehingga apabila setahun berlalu, barulah dia keluar dan membuang najis di belakangnya.”"
  },
  {
    "id": 18285,
    "hadith_number": 3549,
    "tajuk_hadith": "Iddah Wanita Selepas Kematian Suami",
    "perawi_melayu": "Daripada Zainab, bahawa seorang wanita bertanya kepada Ummu Salamah dan Ummu Habibah sama ada dia boleh memakai kohl semasa iddahnya selepas kematian suaminya.  Dia berkata:",
    "english_text": "\"A woman came to the Prophet and asked him about that, and he said: 'During the Jahiliyyah, if her husband died, one of you would stay (in mourning) for a year, then she would throw a piece of dung then come out. Rather it (the mourning period) is four months and ten days, until the term prescribed is fulfilled.'\"",
    "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ حُمَيْدِ بْنِ نَافِعٍ، عَنْ زَيْنَبَ، أَنَّ امْرَأَةً، سَأَلَتْ أُمَّ سَلَمَةَ وَأُمَّ حَبِيبَةَ أَتَكْتَحِلُ فِي عِدَّتِهَا مِنْ وَفَاةِ زَوْجِهَا فَقَالَتْ أَتَتِ امْرَأَةٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَسَأَلَتْهُ عَنْ ذَلِكَ فَقَالَ ‏\n\"‏ قَدْ كَانَتْ إِحْدَاكُنَّ فِي الْجَاهِلِيَّةِ إِذَا تُوُفِّيَ عَنْهَا زَوْجُهَا أَقَامَتْ سَنَةً ثُمَّ قَذَفَتْ خَلْفَهَا بِبَعْرَةٍ ثُمَّ خَرَجَتْ وَإِنَّمَا هِيَ أَرْبَعَةُ أَشْهُرٍ وَعَشْرًا حَتَّى يَنْقَضِيَ الأَجَلُ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang wanita datang kepada Nabi SAW dan bertanya tentang perkara itu. Baginda SAW bersabda:  “Pada zaman Jahiliyyah, jika suami salah seorang daripada kamu meninggal dunia, dia akan berkabung selama setahun, kemudian dia akan membuang seketul najis ke belakangnya, barulah dia keluar.  Tetapi sebenarnya tempoh berkabung itu ialah empat bulan sepuluh hari sehingga tempoh yang ditetapkan berakhir.”"
  },
  {
    "id": 18286,
    "hadith_number": 3550,
    "tajuk_hadith": "Keizinan Menggunakan Qust dan Azfar Semasa Bersuci Selepas Haid",
    "perawi_melayu": "Daripada Hafsah, daripada Umm Atiyyah, daripada Nabi SAW.",
    "english_text": "It was narrated from Hafsah, from Umm 'Atiyyah, from the Prophet, that he granted a concession to the woman whose husband has died, allowing her to use Qust and Azfar when purifying herself following her menses.",
    "arabic_text": "أَخْبَرَنَا الْعَبَّاسُ بْنُ مُحَمَّدٍ، - هُوَ الدُّورِيُّ - قَالَ حَدَّثَنَا الأَسْوَدُ بْنُ عَامِرٍ، عَنْ زَائِدَةَ، عَنْ هِشَامٍ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ رَخَّصَ لِلْمُتَوَفَّى عَنْهَا عِنْدَ طُهْرِهَا فِي الْقُسْطِ وَالأَظْفَارِ ‏.‏",
    "malay_translation": "Daripada Hafsah, daripada Umm Atiyyah, daripada Nabi SAW, bahawa baginda memberi kelonggaran kepada wanita yang suaminya telah meninggal dunia untuk menggunakan Qust dan Azfar ketika mensucikan diri selepas haid."
  },
  {
    "id": 18287,
    "hadith_number": 3551,
    "tajuk_hadith": "Penghapusan Waṣiyyah untuk Isteri dan Tempoh Iddah",
    "perawi_melayu": "Daripada Ibnu Abbas, berkaitan firman Allah:",
    "english_text": "\"And those of you who die and leave behind wives should bequeath for their wives a year's maintenance and residence without turning them out.\" This was abrogated by the Verse on inheritance, which allocated to her one-quarter or one-eighth. And the appointed time ('Iddah) of one year was abrogated and replaced with the ('Iddah) term of four months and ten days.",
    "arabic_text": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى السِّجْزِيُّ، خَيَّاطُ السُّنَّةِ قَالَ حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ الْحُسَيْنِ بْنِ وَاقِدٍ، قَالَ أَخْبَرَنِي أَبِي قَالَ، حَدَّثَنَا يَزِيدُ النَّحْوِيُّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، فِي قَوْلِهِ ‏{‏ وَالَّذِينَ يُتَوَفَّوْنَ مِنْكُمْ وَيَذَرُونَ أَزْوَاجًا وَصِيَّةً لأَزْوَاجِهِمْ مَتَاعًا إِلَى الْحَوْلِ غَيْرَ إِخْرَاجٍ ‏}‏ نُسِخَ ذَلِكَ بِآيَةِ الْمِيرَاثِ مِمَّا فُرِضَ لَهَا مِنَ الرُّبُعِ وَالثُّمُنِ وَنَسَخَ أَجَلَ الْحَوْلِ أَنْ جُعِلَ أَجَلُهَا أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Zakaria bin Yahya As-Sijzi, tukang jahit, katanya: Telah menceritakan kepada kami Ishaq bin Ibrahim, katanya: Telah menceritakan kepada kami Ali bin Al-Hussein bin Waqid, katanya: Telah memberitahu aku bapaku, katanya: Telah menceritakan kepada kami Yazid An-Nahwi, daripada ‘Ikrimah, daripada Ibnu Abbas, berkaitan firman Allah SWT: {…dan orang-orang yang meninggal dunia di antara kamu dan meninggalkan isteri-isteri, hendaklah mereka membuat wasiat untuk isteri-isteri mereka iaitu belanja nafkah selama setahun, tanpa mengusir mereka…}  Ayat ini telah dimansuhkan dengan ayat pusaka, yang mana telah ditetapkan baginya (isteri) daripada ¼ atau ⅛. Dan tempoh setahun (iddah) telah dimansuhkan dan digantikan dengan tempoh empat bulan sepuluh hari."
  },
  {
    "id": 18288,
    "hadith_number": 3552,
    "tajuk_hadith": "Pewarisan untuk Para Balu dan Tempoh Iddah",
    "perawi_melayu": "Daripada Ikrimah berkenaan firman Allah SWT:",
    "english_text": "\"And those of you who die and leave behind wives should bequeath for their wives a year's maintenance and residence without turning them out,\" that he said: \"This was abrogated by: 'And those of you who die and leave wives behind them, they (the wives) shall wait (as regards their marriage) for four months and ten days.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ سِمَاكٍ، عَنْ عِكْرِمَةَ، فِي قَوْلِهِ عَزَّ وَجَلَّ ‏{‏ وَالَّذِينَ يُتَوَفَّوْنَ مِنْكُمْ وَيَذَرُونَ أَزْوَاجًا وَصِيَّةً لأَزْوَاجِهِمْ مَتَاعًا إِلَى الْحَوْلِ غَيْرَ إِخْرَاجٍ ‏}‏ قَالَ نَسَخَتْهَا ‏{‏ وَالَّذِينَ يُتَوَفَّوْنَ مِنْكُمْ وَيَذَرُونَ أَزْوَاجًا يَتَرَبَّصْنَ بِأَنْفُسِهِنَّ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏}‏ ‏.‏",
    "malay_translation": "Daripada Ikrimah berkenaan firman Allah SWT: {“Dan orang-orang yang mati di antara kamu dan meninggalkan isteri-isteri, hendaklah mereka memberi wasiat kepada isteri-isteri mereka, iaitu nafkah selama setahun tanpa menghalau mereka.”}  beliau berkata: “Ayat ini telah dimansuhkan oleh ayat: {“Dan orang-orang yang mati di antara kamu dan meninggalkan isteri-isteri, maka isteri-isteri itu hendaklah menahan diri (daripada berkahwin lagi) empat bulan sepuluh hari.”}"
  },
  {
    "id": 18289,
    "hadith_number": 3553,
    "tajuk_hadith": "Fatimah binti Qais dan Pilihan Suami",
    "perawi_melayu": "Abdul Rahman bin Asim meriwayatkan bahawa Fatimah binti Qais - yang telah berkahwin dengan seorang lelaki dari Bani Makhzum - memberitahunya bahawa...",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَبْدُ الْحَمِيدِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا مَخْلَدٌ، قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ عَطَاءٍ، قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَاصِمٍ، أَنَّ فَاطِمَةَ بِنْتَ قَيْسٍ، أَخْبَرَتْهُ وَكَانَتْ، عِنْدَ رَجُلٍ مِنْ بَنِي مَخْزُومٍ أَنَّهُ طَلَّقَهَا ثَلاَثًا وَخَرَجَ إِلَى بَعْضِ الْمَغَازِي وَأَمَرَ وَكِيلَهُ أَنْ يُعْطِيَهَا بَعْضَ النَّفَقَةِ فَتَقَالَّتْهَا فَانْطَلَقَتْ إِلَى بَعْضِ نِسَاءِ النَّبِيِّ صلى الله عليه وسلم فَدَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهِيَ عِنْدَهَا فَقَالَتْ يَا رَسُولَ اللَّهِ هَذِهِ فَاطِمَةُ بِنْتُ قَيْسٍ طَلَّقَهَا فُلاَنٌ فَأَرْسَلَ إِلَيْهَا بِبَعْضِ النَّفَقَةِ فَرَدَّتْهَا وَزَعَمَ أَنَّهُ شَىْءٌ تَطَوَّلَ بِهِ ‏.‏ قَالَ ‏\"‏ صَدَقَ ‏\"‏ ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَانْتَقِلِي إِلَى أُمِّ كُلْثُومٍ فَاعْتَدِّي عِنْدَهَا ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ إِنَّ أُمَّ كُلْثُومٍ امْرَأَةٌ يَكْثُرُ عُوَّادُهَا فَانْتَقِلِي إِلَى عَبْدِ اللَّهِ ابْنِ أُمِّ مَكْتُومٍ فَإِنَّهُ أَعْمَى ‏\"‏ ‏.‏ فَانْتَقَلَتْ إِلَى عَبْدِ اللَّهِ فَاعْتَدَّتْ عِنْدَهُ حَتَّى انْقَضَتْ عِدَّتُهَا ثُمَّ خَطَبَهَا أَبُو الْجَهْمِ وَمُعَاوِيَةُ بْنُ أَبِي سُفْيَانَ فَجَاءَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم تَسْتَأْمِرُهُ فِيهِمَا فَقَالَ ‏\"‏ أَمَّا أَبُو الْجَهْمِ فَرَجُلٌ أَخَافُ عَلَيْكِ قَسْقَاسَتَهُ لِلْعَصَا وَأَمَّا مُعَاوِيَةُ فَرَجُلٌ أَمْلَقُ مِنَ الْمَالِ ‏\"‏ ‏.‏ فَتَزَوَّجَتْ أُسَامَةَ بْنَ زَيْدٍ بَعْدَ ذَلِكَ ‏.‏",
    "malay_translation": "Abdul Hamid bin Muhammad telah memberitahu kami, katanya: Makhalid telah menceritakan kepada kami, katanya: Ibnu Juraij telah menceritakan kepada kami daripada Ata', katanya: Abdul Rahman bin Asim telah memberitahu saya bahawa Fatimah binti Qais, yang ketika itu tinggal bersama seorang lelaki daripada Bani Makhzum, telah memberitahunya bahawa lelaki itu telah menceraikannya tiga kali talak. Lelaki itu telah pergi ke medan perang dan menyuruh wakilnya memberi Fatimah sedikit nafkah.  Fatimah merasakan nafkah itu terlalu sedikit, lalu dia pergi kepada salah seorang isteri Nabi SAW. Kemudian Rasulullah SAW masuk ketika Fatimah berada di situ. Fatimah berkata, \"Wahai Rasulullah, ini Fatimah binti Qais. Dia telah diceraikan oleh si fulan.  Dia telah menghantar sedikit nafkah kepadanya tetapi Fatimah telah menolaknya. Lelaki itu mendakwa pemberian itu adalah sedekah.\"  Rasulullah SAW bersabda, \"Dia berkata benar.\"  Rasulullah SAW bersabda, \"Pergilah kepada Ummu Kulthum dan tunaikan iddahmu di rumahnya.\" Kemudian baginda bersabda, \"Ummu Kulthum adalah seorang wanita yang banyak menerima kunjungan, maka pergilah kepada Abdullah bin Ummu Maktum kerana dia buta.\"  Maka Fatimah pergi kepada Abdullah dan menunaikan iddahnya di situ sehingga tamat. Kemudian Abu Jahm dan Muawiyah bin Abu Sufyan melamarnya.  Maka Fatimah datang kepada Rasulullah SAW untuk meminta pandangan baginda tentang mereka berdua. Baginda bersabda, \"Adapun Abu Jahm, dia adalah lelaki yang aku bimbangkan kekerasannya terhadapmu. Adapun Muawiyah, dia adalah lelaki yang miskin.\"  Kemudian Fatimah berkahwin dengan Usamah bin Zaid selepas itu."
  },
  {
    "id": 18290,
    "hadith_number": 3554,
    "tajuk_hadith": "Bantahan Aisyah terhadap Fatimah",
    "perawi_melayu": "Daripada Abu Salamah bin 'Abdur-Rahman bahawa Fatimah binti Qais memberitahunya bahawa dia telah berkahwin dengan Abu 'Amr bin Hafs bin Al-Mughirah, yang menceraikannya dengan memberikan talak yang terakhir daripada tiga talak. Fatimah berkata bahawa dia datang kepada Rasulullah ﷺ dan meminta pendapat baginda tentang keluar dari rumahnya. Baginda menyuruhnya berpindah ke rumah Ibn Umm Maktum, seorang yang buta. Marwan enggan mempercayai Fatimah tentang wanita yang diceraikan meninggalkan rumahnya. Urwah berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا حُجَيْنُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ، أَنَّهَا أَخْبَرَتْهُ أَنَّهَا، كَانَتْ تَحْتَ أَبِي عَمْرِو بْنِ حَفْصِ بْنِ الْمُغِيرَةِ فَطَلَّقَهَا آخِرَ ثَلاَثِ تَطْلِيقَاتٍ ‏.‏ فَزَعَمَتْ فَاطِمَةُ أَنَّهَا جَاءَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَاسْتَفْتَتْهُ فِي خُرُوجِهَا مِنْ بَيْتِهَا فَأَمَرَهَا أَنْ تَنْتَقِلَ إِلَى ابْنِ أُمِّ مَكْتُومٍ الأَعْمَى فَأَبَى مَرْوَانُ أَنْ يُصَدِّقَ فَاطِمَةَ فِي خُرُوجِ الْمُطَلَّقَةِ مِنْ بَيْتِهَا ‏.‏ قَالَ عُرْوَةُ أَنْكَرَتْ عَائِشَةُ ذَلِكَ عَلَى فَاطِمَةَ ‏.‏",
    "malay_translation": "Muhammad bin Rafi' meriwayatkan daripada kami,  Hujain bin Al-Mutsanna berkata, telah meriwayatkan kepada kami, Laits, daripada Uqaail, daripada Ibnu Syihab, daripada Abu Salamah bin Abdur Rahman, daripada Fatimah binti Qais, bahawa dia telah memberitahunya bahawa dia telah berada di bawah jagaan Abu Amr bin Hafs bin Mughirah, kemudian diceraikannya dengan talak yang terakhir daripada tiga talak.  Fatimah mendakwa bahawa dia telah datang kepada Rasulullah ﷺ dan meminta pendapat baginda tentang keluar daripada rumahnya.  Baginda menyuruhnya berpindah ke rumah Ibnu Umm Maktum, iaitu seorang yang buta. Marwan enggan mempercayai Fatimah tentang wanita yang diceraikan itu meninggalkan rumahnya. Urwah berkata, Aisyah membantah Fatimah tentang perkara itu."
  },
  {
    "id": 18291,
    "hadith_number": 3555,
    "tajuk_hadith": "Perceraian Tiga Kali dan Perlindungan",
    "perawi_melayu": "Hisham meriwayatkan daripada bapanya bahawa Fatimah berkata:",
    "english_text": "\"I said: 'O Messenger of Allah! My husband has divorced me three times and I am afraid that my house be broken into.' So he told her to move.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا حَفْصٌ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ فَاطِمَةَ، قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ زَوْجِي طَلَّقَنِي ثَلاَثًا وَأَخَافُ أَنْ يُقْتَحَمَ عَلَىَّ ‏.‏ فَأَمَرَهَا فَتَحَوَّلَتْ ‏.‏",
    "malay_translation": "Aku berkata, \"Wahai Rasulullah, Suamiku menceraikanku tiga kali dan aku takut rumahku akan dimasuki.\" Maka baginda menyuruhnya berpindah."
  },
  {
    "id": 18292,
    "hadith_number": 3556,
    "tajuk_hadith": "Hukum Perceraian dan Nafkah",
    "perawi_melayu": "Daripada riwayat Asy-Sya'bi:",
    "english_text": "\"I came to Fatimah bint Qais and asked her about the ruling of the Messenger of Allah concerning her. She said that her husband divorced her irrevocably, and she referred her dispute with him, concerning accommodation and maintenance, to the Messenger of Allah. She said: 'He did not give me (the right to) accommodation and maintenance, and he told me to observe my 'Iddah in the house of Ibn Umm Maktum,'\"",
    "arabic_text": "أَخْبَرَنَا يَعْقُوبُ بْنُ مَاهَانَ، - بَصْرِيٌّ - عَنْ هُشَيْمٍ، قَالَ حَدَّثَنَا سَيَّارٌ، وَحُصَيْنٌ، وَمُغِيرَةُ، وَدَاوُدُ بْنُ أَبِي هِنْدٍ، وَإِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، وَذَكَرَ، آخَرِينَ عَنِ الشَّعْبِيِّ، قَالَ دَخَلْتُ عَلَى فَاطِمَةَ بِنْتِ قَيْسٍ فَسَأَلْتُهَا عَنْ قَضَاءِ، رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَيْهَا فَقَالَتْ طَلَّقَهَا زَوْجُهَا الْبَتَّةَ فَخَاصَمَتْهُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فِي السُّكْنَى وَالنَّفَقَةِ قَالَتْ فَلَمْ يَجْعَلْ لِي سُكْنَى وَلاَ نَفَقَةً وَأَمَرَنِي أَنْ أَعْتَدَّ فِي بَيْتِ ابْنِ أُمِّ مَكْتُومٍ ‏.‏",
    "malay_translation": "Aku telah menemui Fatimah binti Qais dan bertanya kepadanya tentang keputusan Rasulullah SAW mengenai dirinya.  Beliau berkata bahawa suaminya menceraikannya secara mutlak, dan beliau membawa perselisihannya dengan suaminya, berkaitan tempat tinggal dan nafkah, kepada Rasulullah SAW. Beliau berkata: ‘Rasulullah SAW tidak memberikan tempat tinggal dan nafkah kepadaku, dan baginda menyuruhku untuk beriddah di rumah Ibn Umm Maktum.’"
  },
  {
    "id": 18293,
    "hadith_number": 3557,
    "tajuk_hadith": "Pindah Selepas Talak dan Iddah",
    "perawi_melayu": "Daripada Fatimah binti Qais, beliau berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنِي أَبُو بَكْرِ بْنُ إِسْحَاقَ الصَّاغَانِيُّ، قَالَ حَدَّثَنَا أَبُو الْجَوَّابِ، قَالَ حَدَّثَنَا عَمَّارٌ، - هُوَ ابْنُ رُزَيْقٍ - عَنْ أَبِي إِسْحَاقَ، عَنِ الشَّعْبِيِّ، عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ، قَالَتْ طَلَّقَنِي زَوْجِي فَأَرَدْتُ النُّقْلَةَ فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ انْتَقِلِي إِلَى بَيْتِ ابْنِ عَمِّكِ عَمْرِو ابْنِ أُمِّ مَكْتُومٍ فَاعْتَدِّي فِيهِ ‏\"‏ ‏.‏ فَحَصَبَهُ الأَسْوَدُ وَقَالَ وَيْلَكَ لِمَ تُفْتِي بِمِثْلِ هَذَا ‏.‏ قَالَ عُمَرُ إِنْ جِئْتِ بِشَاهِدَيْنِ يَشْهَدَانِ أَنَّهُمَا سَمِعَاهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَإِلاَّ لَمْ نَتْرُكْ كِتَابَ اللَّهِ لِقَوْلِ امْرَأَةٍ ‏{‏ لاَ تُخْرِجُوهُنَّ مِنْ بُيُوتِهِنَّ وَلاَ يَخْرُجْنَ إِلاَّ أَنْ يَأْتِينَ بِفَاحِشَةٍ مُبَيِّنَةٍ ‏}‏ ‏.‏",
    "malay_translation": "Aku diberitahu oleh Abu Bakar bin Ishaq As-Saggani, katanya: Telah menceritakan kepada kami Abu Al-Jawwab, katanya: Telah menceritakan kepada kami Ammar - iaitu Ibnu Ruzaiq - daripada Abu Ishaq, daripada Asy-Sya'bi, daripada Fatimah binti Qais, katanya: Suamiku menceraikanku, lalu aku ingin berpindah, maka aku pergi kepada Rasulullah SAW, lalu baginda bersabda: \"Pindahkanlah dirimu ke rumah anak saudara sebelah bapa kamu, Amru bin Umm Maktum, dan beriddahlah di situ.\"  Kemudian Al-Aswad menghujani beliau (Asy-Sya'bi) dengan batu kerikil lalu berkata: \"Celaka kamu! Mengapa kamu memberi fatwa sedemikian?\" Umar berkata: \"Sekiranya kamu membawa dua orang saksi yang akan memberi keterangan bahawa mereka mendengarnya daripada Rasulullah SAW, jika tidak, kami tidak akan meninggalkan Kitabullah kerana kata-kata seorang wanita.  {Janganlah kamu menghalau mereka dari rumah mereka dan janganlah mereka keluar melainkan jika mereka melakukan perbuatan keji yang nyata.}"
  },
  {
    "id": 18294,
    "hadith_number": 3558,
    "tajuk_hadith": "Mencukupi Kebajikan Melalui Hasil Kurma",
    "perawi_melayu": "Dari Jabir r.a, diriwayatkan bahawa makcik saudaranya telah diceraikan, dan dia ingin keluar ke beberapa pokok kurma miliknya, tetapi dia bertemu dengan seorang lelaki yang menyuruhnya jangan berbuat demikian. Dia pergi kepada Rasulullah SAW dan baginda bersabda:",
    "english_text": "\"Go out and take the harvest of your date palms, for perhaps you will give Zakah or do some good (give voluntary charity).\"",
    "arabic_text": "أَخْبَرَنَا عَبْدُ الْحَمِيدِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا مَخْلَدٌ، قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ طُلِّقَتْ خَالَتُهُ فَأَرَادَتْ أَنْ تَخْرُجَ إِلَى نَخْلٍ لَهَا فَلَقِيَتْ رَجُلاً فَنَهَاهَا فَجَاءَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ اخْرُجِي فَجُدِّي نَخْلَكِ لَعَلَّكِ أَنْ تَصَدَّقِي وَتَفْعَلِي مَعْرُوفًا ‏\"‏ ‏.‏",
    "malay_translation": "Keluarlah dan petiklah hasil kurma kamu.  Mungkin kamu akan dapat menunaikan zakat atau bersedekah (memberi sedekah)."
  },
  {
    "id": 18295,
    "hadith_number": 3559,
    "tajuk_hadith": "Perceraian dan Nafkah",
    "perawi_melayu": "Daripada Abu Bakar bin Abu Jahm",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بَكْرِ بْنِ أَبِي الْجَهْمِ، قَالَ دَخَلْتُ أَنَا وَأَبُو سَلَمَةَ عَلَى فَاطِمَةَ بِنْتِ قَيْسٍ قَالَتْ طَلَّقَنِي زَوْجِي فَلَمْ يَجْعَلْ لِي سُكْنَى وَلاَ نَفَقَةً - قَالَتْ - فَوَضَعَ لِي عَشْرَةَ أَقْفِزَةٍ عِنْدَ ابْنِ عَمٍّ لَهُ خَمْسَةُ شَعِيرٍ وَخَمْسَةُ تَمْرٍ فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ لَهُ ذَلِكَ فَقَالَ ‏\n\"‏ صَدَقَ ‏\"‏ ‏.‏ وَأَمَرَنِي أَنْ أَعْتَدَّ فِي بَيْتِ فُلاَنٍ وَكَانَ زَوْجُهَا طَلَّقَهَا طَلاَقًا بَائِنًا ‏.‏",
    "malay_translation": "Kami berdua, iaitu aku dan Abu Salamah, telah melawat Fatimah binti Qais.  Beliau berkata, \"Suamiku menceraikanku tanpa memberikan tempat tinggal mahupun nafkah.\"  Beliau menambah, \"Dia meninggalkan untukku sepuluh sukatan (Aqfizah) makanan di tempat seorang sepupunya: lima sukatan barli dan lima sukatan tamar.  Aku telah mengadu kepada Rasulullah ﷺ tentang hal ini.  Baginda bersabda, 'Dia berkata benar.'  Baginda kemudian memerintahkanku untuk menunaikan iddah di rumah si fulan.\"  Dan suaminya telah menceraikannya dengan talak bain."
  },
  {
    "id": 18296,
    "hadith_number": 3560,
    "tajuk_hadith": "Perceraian dan Tempat Tinggal Fatimah",
    "perawi_melayu": "Ubaidullah bin Abdullah bin Utbah meriwayatkan bahawa Abdullah bin Amr bin Utsman menceraikan anak perempuan Sa'eed bin Zaid - ibunya ialah Hamnah binti Qais - secara muktamad. Mak saudara perempuannya, Fatimah binti Qais menyuruhnya berpindah dari rumah Abdullah bin Amr. Marwan mendengar hal itu, lalu dia menghantar pesanan kepadanya, menyuruhnya kembali ke rumahnya sehingga habis iddahnya. Dia menghantar pesanan kepadanya memberitahu bahawa mak saudara perempuannya, Fatimah telah mengeluarkan fatwa demikian, dan dia memberitahunya bahawa Rasulullah ﷺ telah mengeluarkan fatwa kepadanya, menyuruhnya berpindah apabila Abu Amr bin Hafs Al-Makhzumi menceraikannya. Marwan menghantar Qabisah bin Dhu'aib kepada Fatimah untuk menanyakan hal itu. Dia berkata bahawa dia telah berkahwin dengan Abu Amr ketika Rasulullah ﷺ melantik Ali bin Abi Talib sebagai gabenor Yaman, dan dia keluar bersamanya, kemudian dia menghantar pesanan kepadanya menceraikannya, dan itulah talak yang terakhir baginya.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ، قَالَ حَدَّثَنَا أَبِي، عَنْ شُعَيْبٍ، قَالَ قَالَ الزُّهْرِيُّ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ عُثْمَانَ، طَلَّقَ ابْنَةَ سَعِيدِ بْنِ زَيْدٍ - وَأُمُّهَا حَمْنَةُ بِنْتُ قَيْسٍ - الْبَتَّةَ فَأَمَرَتْهَا خَالَتُهَا فَاطِمَةُ بِنْتُ قَيْسٍ بِالاِنْتِقَالِ مِنْ بَيْتِ عَبْدِ اللَّهِ بْنِ عَمْرٍو وَسَمِعَ بِذَلِكَ، مَرْوَانُ فَأَرْسَلَ إِلَيْهَا فَأَمَرَهَا أَنْ تَرْجِعَ إِلَى مَسْكَنِهَا حَتَّى تَنْقَضِيَ عِدَّتُهَا فَأَرْسَلَتْ إِلَيْهِ تُخْبِرُهُ أَنَّ خَالَتَهَا فَاطِمَةَ أَفْتَتْهَا بِذَلِكَ وَأَخْبَرَتْهَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَفْتَاهَا بِالاِنْتِقَالِ حِينَ طَلَّقَهَا أَبُو عَمْرِو بْنُ حَفْصٍ الْمَخْزُومِيُّ فَأَرْسَلَ مَرْوَانُ قَبِيصَةَ بْنَ ذُؤَيْبٍ إِلَى فَاطِمَةَ فَسَأَلَهَا عَنْ ذَلِكَ فَزَعَمَتْ أَنَّهَا كَانَتْ تَحْتَ أَبِي عَمْرٍو لَمَّا أَمَّرَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلِيَّ بْنَ أَبِي طَالِبٍ عَلَى الْيَمَنِ خَرَجَ مَعَهُ فَأَرْسَلَ إِلَيْهَا بِتَطْلِيقَةٍ وَهِيَ بَقِيَّةُ طَلاَقِهَا فَأَمَرَ لَهَا الْحَارِثَ بْنَ هِشَامٍ وَعَيَّاشَ بْنَ أَبِي رَبِيعَةَ بِنَفَقَتِهَا فَأَرْسَلَتْ إِلَى الْحَارِثِ وَعَيَّاشٍ تَسْأَلُهُمَا النَّفَقَةَ الَّتِي أَمَرَ لَهَا بِهَا زَوْجُهَا فَقَالاَ وَاللَّهِ مَا لَهَا عَلَيْنَا نَفَقَةٌ إِلاَّ أَنْ تَكُونَ حَامِلاً وَمَا لَهَا أَنْ تَسْكُنَ فِي مَسْكَنِنَا إِلاَّ بِإِذْنِنَا ‏.‏ فَزَعَمَتْ فَاطِمَةُ أَنَّهَا أَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَذَكَرَتْ ذَلِكَ لَهُ فَصَدَّقَهُمَا قَالَتْ فَقُلْتُ أَيْنَ أَنْتَقِلُ يَا رَسُولَ اللَّهِ فَقَالَ ‏\n\"‏ انْتَقِلِي عِنْدَ ابْنِ أُمِّ مَكْتُومٍ ‏\"‏ ‏.‏ وَهُوَ الأَعْمَى الَّذِي عَاتَبَهُ اللَّهُ عَزَّ وَجَلَّ فِي كِتَابِهِ فَانْتَقَلْتُ عِنْدَهُ فَكُنْتُ أَضَعُ ثِيَابِي عِنْدَهُ حَتَّى أَنْكَحَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم زَعَمَتْ أُسَامَةَ بْنَ زَيْدٍ ‏.‏",
    "malay_translation": "Amru bin Usman bin Sa'id bin Kasyir bin Dinar memberitahu kami, katanya:  Bapak saya telah meriwayatkan daripada Syu'aib, katanya: Zuhri berkata: Ubaidullah bin Abdullah bin Utbah telah memberitahu saya bahawa Abdullah bin Amr bin Usman telah menceraikan anak perempuan Sa'eed bin Zaid - ibunya Hamnah binti Qais - secara mutlak. Mak saudara perempuannya, Fatimah binti Qais menyuruhnya berpindah dari rumah Abdullah bin Amr. Marwan mendengar hal itu, lalu dia menghantar pesanan kepadanya, menyuruhnya kembali ke rumahnya sehingga habis iddahnya. Dia menghantar pesanan kepadanya memberitahu bahawa mak saudara perempuannya, Fatimah telah mengeluarkan fatwa demikian, dan dia memberitahunya bahawa Rasulullah ﷺ telah mengeluarkan fatwa kepadanya, menyuruhnya berpindah apabila Abu Amr bin Hafs Al-Makhzumi menceraikannya. Marwan menghantar Qabisah bin Dzu'aib kepada Fatimah untuk menanyakan hal itu. Dia berkata bahawa dia telah berkahwin dengan Abu Amr ketika Rasulullah ﷺ melantik Ali bin Abi Talib sebagai gabenor Yaman, dan dia keluar bersamanya, kemudian dia menghantar pesanan kepadanya menceraikannya, dan itulah talak yang terakhir baginya.  Lalu Al-Harits bin Hisyam dan Ayyasy telah diarah untuk menanggung nafkahnya.  Dia kemudian menghantar pesanan kepada Al-Harits dan Ayyasy meminta nafkah yang telah diarahkan oleh bekas suaminya. Mereka berkata, \"Demi Allah, dia tidak berhak mendapat nafkah daripada kami melainkan jika dia hamil, dan dia tidak berhak tinggal di rumah kami melainkan dengan izin kami.\" Fatimah mendakwa bahawa dia telah menemui Rasulullah ﷺ dan menceritakan hal itu. Rasulullah ﷺ membenarkan kedua-duanya.  Dia berkata:  \"Saya bertanya, 'Di manakah saya harus berpindah, wahai Rasulullah?' Baginda menjawab, 'Pindahlah ke rumah Ibnu Umm Maktum.' Ibnu Umm Maktum ialah orang buta yang ditegur Allah SWT dalam kitab-Nya. Saya berpindah ke rumahnya, dan saya meletakkan pakaian saya di situ sehingga Rasulullah ﷺ menikahkannya dengan Usamah bin Zaid."
  },
  {
    "id": 18297,
    "hadith_number": 3561,
    "tajuk_hadith": "Haid dan Solat",
    "perawi_melayu": "Daripada Amr bin Az-Zubair bahawa Fatimah binti Abi Hubaish memberitahunya bahawa dia datang kepada Rasulullah SAW dan mengadu kepadanya tentang pendarahan (berterusan). Rasulullah SAW berkata kepadanya:",
    "english_text": "\"That is a vein. Look and when your period comes, do not pray, and when your period ends, then purify yourself and pray during the time between one period and the next.\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، عَنِ الْمُنْذِرِ بْنِ الْمُغِيرَةِ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّ فَاطِمَةَ ابْنَةَ أَبِي حُبَيْشٍ، حَدَّثَتْهُ أَنَّهَا، أَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَشَكَتْ إِلَيْهِ الدَّمَ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّمَا ذَلِكِ عِرْقٌ فَانْظُرِي إِذَا أَتَاكِ قُرْؤُكِ فَلاَ تُصَلِّي فَإِذَا مَرَّ قُرْؤُكِ فَلْتَطْهُرِي - قَالَ - ثُمَّ صَلِّي مَا بَيْنَ الْقُرْءِ إِلَى الْقُرْءِ ‏\"‏ ‏.‏",
    "malay_translation": "Ia hanyalah darah haid. Perhatikanlah, apabila datang haidmu, maka janganlah kamu solat. Dan apabila haidmu telah berhenti, maka sucikanlah dirimu dan solatlah di antara waktu haid dengan haid yang seterusnya."
  },
  {
    "id": 18298,
    "hadith_number": 3562,
    "tajuk_hadith": "Penggantian Ayat dan Hukum Talak",
    "perawi_melayu": "Daripada Ibnu Abbas",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ الْحُسَيْنِ بْنِ وَاقِدٍ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنَا يَزِيدُ النَّحْوِيُّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، فِي قَوْلِهِ ‏{‏ مَا نَنْسَخْ مِنْ آيَةٍ أَوْ نُنْسِهَا نَأْتِ بِخَيْرٍ مِنْهَا أَوْ مِثْلِهَا ‏}‏ وَقَالَ ‏{‏ وَإِذَا بَدَّلْنَا آيَةً مَكَانَ آيَةٍ وَاللَّهُ أَعْلَمُ بِمَا يُنَزِّلُ ‏}‏ الآيَةَ وَقَالَ ‏{‏ يَمْحُو اللَّهُ مَا يَشَاءُ وَيُثْبِتُ وَعِنْدَهُ أُمُّ الْكِتَابِ ‏}‏ فَأَوَّلُ مَا نُسِخَ مِنَ الْقُرْآنِ الْقِبْلَةُ وَقَالَ ‏{‏ وَالْمُطَلَّقَاتُ يَتَرَبَّصْنَ بِأَنْفُسِهِنَّ ثَلاَثَةَ قُرُوءٍ وَلاَ يَحِلُّ لَهُنَّ أَنْ يَكْتُمْنَ مَا خَلَقَ اللَّهُ فِي أَرْحَامِهِنَّ ‏}‏ إِلَى قَوْلِهِ ‏{‏ إِنْ أَرَادُوا إِصْلاَحًا ‏}‏ وَذَلِكَ بِأَنَّ الرَّجُلَ كَانَ إِذَا طَلَّقَ امْرَأَتَهُ فَهُوَ أَحَقُّ بِرَجْعَتِهَا وَإِنْ طَلَّقَهَا ثَلاَثًا فَنَسَخَ ذَلِكَ وَقَالَ ‏{‏ الطَّلاَقُ مَرَّتَانِ فَإِمْسَاكٌ بِمَعْرُوفٍ أَوْ تَسْرِيحٌ بِإِحْسَانٍ ‏}‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Zakariya bin Yahya, katanya; telah menceritakan kepada kami Ishaq bin Ibrahim, katanya; telah menceritakan kepada kami Ali bin al-Hussein bin Waqid, katanya; telah menceritakan kepadaku ayahku, katanya; telah menceritakan kepada kami Yazid an-Nahwi, dari 'Ukrumah, dari Ibnu Abbas, mengenai firman Allah SWT: {Apa sahaja ayat yang Kami mansuhkan atau Kami lupakan, Kami akan datangkan ayat yang lebih baik daripadanya atau serupa dengannya.} Dan baginda berkata: {Dan apabila Kami menggantikan sesuatu ayat dengan ayat yang lain - dan Allah SWT lebih mengetahui apa yang diturunkanNya.} Ayat tersebut, dan baginda berkata: {Allah SWT akan memadamkan apa yang Dia kehendaki dan menetapkan (apa yang Dia kehendaki). Dan di sisiNya terdapat Ummul Kitab.} Maka yang pertama kali dimansuhkan daripada al-Quran ialah kiblat. Dan baginda berkata: {Dan perempuan-perempuan yang diceraikan hendaklah menunggu (mengenai perkahwinan mereka) selama tiga kali haid, dan tidak halal bagi mereka menyembunyikan apa yang Allah SWT ciptakan dalam rahim mereka,} sehingga kepada firmanNya: {Jika mereka menginginkan perbaikan.} Dan itu kerana seorang lelaki, jika menceraikan isterinya, maka dialah yang lebih berhak untuk mengambilnya kembali, walaupun dia telah menceraikannya sebanyak tiga kali. Kemudian (Allah SWT) mansuhkan itu dan berfirman: {Talak itu dua kali, kemudian berbaik-baiklah atau lepaskanlah dengan baik.}"
  },
  {
    "id": 18299,
    "hadith_number": 3563,
    "tajuk_hadith": "Talak Ketika Haid",
    "perawi_melayu": "Ibnu Umar berkata:",
    "english_text": "\"I divorced my wife when she was menstruating. 'Umar went to the Prophet and told him about that. The Prophet said: 'Tell him to take her back, then when she becomes pure, if he wants to, let him divorce her.'\" I said to Ibn 'Umar: \"Did that count as one divorce?\" He said: \"Why not? What do you think if some becomes helpless and behaves foolishly.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ يُونُسَ بْنَ جُبَيْرٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ، قَالَ طَلَّقْتُ امْرَأَتِي وَهِيَ حَائِضٌ فَأَتَى النَّبِيَّ صلى الله عليه وسلم عُمَرُ فَذَكَرَ لَهُ ذَلِكَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مُرْهُ أَنْ يُرَاجِعَهَا فَإِذَا طَهُرَتْ - يَعْنِي - فَإِنْ شَاءَ فَلْيُطَلِّقْهَا ‏\"‏ ‏.‏ قُلْتُ لاِبْنِ عُمَرَ فَاحْتَسَبْتَ مِنْهَا فَقَالَ مَا يَمْنَعُهَا أَرَأَيْتَ إِنْ عَجَزَ وَاسْتَحْمَقَ ‏.‏",
    "malay_translation": "Aku menceraikan isteriku ketika dia sedang haid. Umar pergi kepada Nabi ﷺ dan menceritakan hal itu. Nabi ﷺ bersabda: \"Suruhlah dia rujuk semula isterinya.  Kemudian apabila isterinya suci, jika dia mahu, bolehlah dia menceraikannya.\" Aku bertanya kepada Ibnu Umar: \"Adakah ia dikira sebagai satu talak?\" Jawabnya: \"Mengapa tidak? Bagaimana pendapatmu jika seseorang menjadi lemah dan bertindak bodoh?\"."
  },
  {
    "id": 18300,
    "hadith_number": 3564,
    "tajuk_hadith": "Talak Ketika Haid dan Panduan Rasulullah",
    "perawi_melayu": "Daripada Ibnu Umar bahawa beliau menceraikan isterinya ketika dalam keadaan haid. Umar r.a. menyebut perkara itu kepada Nabi SAW, lalu baginda bersabda:",
    "english_text": "\"Tell him to take her back until she menstruates again, then when she becomes pure, if he wants he may divorce her and if he wants he may keep her. This is the divorce that Allah has enjoined. Allah, the Mighty and Sublime, says: 'The divorce is twice, after that, either you retain her on reasonable terms or release her with kindness.'\"",
    "arabic_text": "حَدَّثَنَا بِشْرُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنِ ابْنِ إِدْرِيسَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، وَيَحْيَى بْنِ سَعِيدٍ، وَعُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، ح وَأَخْبَرَنَا زُهَيْرٌ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالُوا إِنَّ ابْنَ عُمَرَ طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ فَذَكَرَ عُمَرُ رضى الله عنه لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مُرْهُ فَلْيُرَاجِعْهَا حَتَّى تَحِيضَ حَيْضَةً أُخْرَى فَإِذَا طَهُرَتْ فَإِنْ شَاءَ طَلَّقَهَا وَإِنْ شَاءَ أَمْسَكَهَا فَإِنَّهُ الطَّلاَقُ الَّذِي أَمَرَ اللَّهُ عَزَّ وَجَلَّ بِهِ ‏\"‏ ‏.‏ قَالَ تَعَالَى ‏{‏ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ ‏}‏ ‏.‏",
    "malay_translation": "Suruhlah dia rujuk semula isterinya sehingga dia haid lagi. Kemudian apabila dia suci, jika dia mahu, dia boleh menceraikannya, dan jika dia mahu, dia boleh meneruskannya. Inilah talak yang Allah SWT perintahkan. Allah SWT berfirman:  'Maka ceraikanlah mereka untuk tempoh iddah mereka.'"
  },
  {
    "id": 18301,
    "hadith_number": 3565,
    "tajuk_hadith": "Talak Tiga dan Rujuk",
    "perawi_melayu": "Apabila Ibnu Umar ditanya tentang seorang lelaki yang menceraikan isterinya ketika haid, beliau akan berkata:",
    "english_text": "\"If it is the first or second divorce, the Messenger of Allah would tell him to take her back and keep her until she has menstruated again and purified herself, then divorce her before having intercourse with her. But if it was three simultaneous divorces, then you have disobeyed Allah with regard to the way in which divorce should be conducted and your wife has become irrevocably divorced.\"",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَنْبَأَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، قَالَ كَانَ ابْنُ عُمَرَ إِذَا سُئِلَ عَنِ الرَّجُلِ، طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ فَيَقُولُ أَمَّا إِنْ طَلَّقَهَا وَاحِدَةً أَوِ اثْنَتَيْنِ فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَهُ أَنْ يُرَاجِعَهَا ثُمَّ يُمْسِكَهَا حَتَّى تَحِيضَ حَيْضَةً أُخْرَى ثُمَّ تَطْهُرَ ثُمَّ يُطَلِّقَهَا قَبْلَ أَنْ يَمَسَّهَا وَأَمَّا إِنْ طَلَّقَهَا ثَلاَثًا فَقَدْ عَصَيْتَ اللَّهَ فِيمَا أَمَرَكَ بِهِ مِنْ طَلاَقِ امْرَأَتِكَ وَبَانَتْ مِنْكَ امْرَأَتُكَ ‏.‏",
    "malay_translation": "Jika talak itu adalah talak pertama atau kedua, maka Rasulullah SAW akan menyuruhnya rujuk dan menahan isterinya sehingga dia haid lagi dan suci, kemudian menceraikannya sebelum bercampur (jimak) dengannya.  Tetapi jika talak itu tiga sekaligus, maka kamu telah derhaka kepada Allah SWT dalam cara menjatuhkan talak dan isterimu telah jatuh talak tiga (tetap bercerai)."
  },
  {
    "id": 18302,
    "hadith_number": 3566,
    "tajuk_hadith": "Menceraikan Isteri Ketika Haid",
    "perawi_melayu": "Ibn Umar",
    "english_text": "It was narrated from Ibn 'Umar that he divorced his wife when she was menstruating, and the Messenger of Allah told him to take her back.",
    "arabic_text": "أَخْبَرَنَا يُوسُفُ بْنُ عِيسَى، - مَرْوَزِيٌّ - قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، قَالَ حَدَّثَنَا حَنْظَلَةُ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ فَأَمَرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَرَاجَعَهَا ‏.‏",
    "malay_translation": "Daripada Ibnu Umar, bahawa beliau menceraikan isterinya ketika isterinya sedang haid, maka Rasulullah SAW menyuruhnya merujuk kembali isterinya."
  },
  {
    "id": 18303,
    "hadith_number": 3567,
    "tajuk_hadith": "Talak Ketika Haid",
    "perawi_melayu": "Ibnu Tawus meriwayatkan daripada bapanya bahawa beliau mendengar Abdullah bin Umar ditanya tentang seorang lelaki yang menceraikan isterinya ketika haid.",
    "english_text": "\"Do you know 'Abdullah bin 'Umar?\" He said: \"Yes.\" He said: \"He divorced his wife when she was menstruating, and 'Umar went to the Prophet and told him about that. He ordered him to take her back until she became pure,\" and I did not hear him adding anything to that.",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا أَبُو عَاصِمٍ، قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِيهِ ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ، يُسْأَلُ عَنْ رَجُلٍ، طَلَّقَ امْرَأَتَهُ حَائِضًا فَقَالَ أَتَعْرِفُ عَبْدَ اللَّهِ بْنَ عُمَرَ قَالَ نَعَمْ ‏.‏ قَالَ فَإِنَّهُ طَلَّقَ امْرَأَتَهُ حَائِضًا فَأَتَى عُمَرُ النَّبِيَّ صلى الله عليه وسلم فَأَخْبَرَهُ الْخَبَرَ فَأَمَرَهُ أَنْ يُرَاجِعَهَا حَتَّى تَطْهُرَ ‏.‏ وَلَمْ أَسْمَعْهُ يَزِيدُ عَلَى هَذَا ‏.‏",
    "malay_translation": "Adakah kamu kenal Abdullah bin Umar?  Jawabnya: Ya.  Beliau berkata:  Dia menceraikan isterinya ketika dalam keadaan haid, lalu Umar pergi kepada Nabi ﷺ dan menceritakan hal itu.  Nabi ﷺ memerintahkannya untuk rujuk semula dengan isterinya sehingga suci. Dan saya tidak mendengar beliau menambah apa-apa lagi selain daripada ini."
  },
  {
    "id": 18304,
    "hadith_number": 3568,
    "tajuk_hadith": "Perceraian dan Perkahwinan Semula Rasulullah SAW dengan Hafsah",
    "perawi_melayu": "Daripada Umar, bahawa Nabi SAW – Amr (salah seorang perawi) berkata:",
    "english_text": "\"The Messenger of Allah- had divorced Hafsah, then he took her back.\" And Allah knows best.",
    "arabic_text": "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ، قَالَ أَنْبَأَنَا يَحْيَى بْنُ آدَمَ، ح وَأَنْبَأَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سَهْلُ بْنُ مُحَمَّدٍ أَبُو سَعِيدٍ، قَالَ نُبِّئْتُ عَنْ يَحْيَى بْنِ زَكَرِيَّا، عَنْ صَالِحِ بْنِ صَالِحٍ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم - وَقَالَ عَمْرٌو إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم - كَانَ طَلَّقَ حَفْصَةَ ثُمَّ رَاجَعَهَا ‏.‏ وَاللَّهُ أَعْلَمُ ‏.‏",
    "malay_translation": "Daripada Umar, bahawa Rasulullah SAW telah menceraikan Hafsah, kemudian baginda berkahwin semula dengannya.  Wallahu a'lam."
  }
]
