[
  {
    "id": 15480,
    "hadith_number": 744,
    "tajuk_hadith": "Peralihan Kiblat: Dari Baitul Maqdis ke Kaabah",
    "perawi_melayu": "Dikisahkan oleh Al-Barā' bin 'Azib:",
    "english_text": "Al Bara bin Azib said: The messenger of Allah (peace be upon him) came to Al-Madinah and prayed toward Bait-al-Maqdis for sixteen months, then he was commanded to pray toward the Ka'bah. A man who had prayed with the prophet (peace be upon him)passed by some of the Ansar and said: \"I bear witness that the messenger of Allah (peace be upon him) has been commanded to face toward the Ka'bah. So they turned to face the Ka'bah\".",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ الأَزْرَقُ، عَنْ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ فَصَلَّى نَحْوَ بَيْتِ الْمَقْدِسِ سِتَّةَ عَشَرَ شَهْرًا ثُمَّ وُجِّهَ إِلَى الْكَعْبَةِ فَمَرَّ رَجُلٌ قَدْ كَانَ صَلَّى مَعَ النَّبِيِّ صلى الله عليه وسلم عَلَى قَوْمٍ مِنَ الأَنْصَارِ فَقَالَ أَشْهَدُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ وُجِّهَ إِلَى الْكَعْبَةِ ‏.‏ فَانْحَرَفُوا إِلَى الْكَعْبَةِ ‏.‏",
    "malay_translation": "Al-Barā' bin 'Azib meriwayatkan, \"Utusan Allah (saw) tiba di Madinah dan mendirikan solat menghadap Baitul Maqdis selama enam belas bulan, kemudian baginda diperintahkan untuk mendirikan solat menghadap Kaabah.  Kemudian, seorang lelaki yang pernah menunaikan solat bersama Nabi (saw) melewati sekumpulan sahabat Ansar dan berkata, 'Aku bersaksi bahawa Utusan Allah (saw) telah diperintahkan untuk menghadap Kaabah.'  Lalu mereka pun menghadap ke arah Kaabah.\""
  },
  {
    "id": 15481,
    "hadith_number": 745,
    "tajuk_hadith": "Solat di Atas Unta Ketika Perjalanan",
    "perawi_melayu": "Dikatakan oleh Ibnu Umar bahawa:",
    "english_text": "\"The messenger of Allah (peace be upon him) used to pray atop his mount while travelling, facing whatever direction it was facing.\" (One of the narrators) Malik said: \"Abdullah bin Dinar said: and Ibn Umar used to do likewise\".",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي عَلَى رَاحِلَتِهِ فِي السَّفَرِ حَيْثُمَا تَوَجَّهَتْ بِهِ ‏.‏ قَالَ مَالِكٌ قَالَ عَبْدُ اللَّهِ بْنُ دِينَارٍ وَكَانَ ابْنُ عُمَرَ يَفْعَلُ ذَلِكَ ‏.‏",
    "malay_translation": "Telah diberitahu kepada kami oleh Qatadah daripada Malik bin Anas daripada Abdullah bin Dinar daripada Ibnu Umar, katanya: \"Rasulullah SAW biasanya menunaikan solat di atas kenderaan tunggangannya ketika dalam perjalanan, menghadap ke arah mana kenderaan itu menghadap.\" Malik berkata, Abdullah bin Dinar berkata, dan Ibnu Umar juga melakukan perkara yang sama."
  },
  {
    "id": 15482,
    "hadith_number": 746,
    "tajuk_hadith": "Rasulullah SAW Solat di atas Kenderaan",
    "perawi_melayu": "Telah diriwayatkan oleh Abdullah bahawa:",
    "english_text": "\"Rasulullah SAW (sallallahu alaihi wasallam) biasa solat di atas tunggangannya ketika perjalanan, menghadap ke arah mana pun tunggangan itu menghadap, dan beliau akan solat witir di atasnya, tetapi beliau tidak menunaikan solat fardu di atasnya.\"",
    "arabic_text": "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنْ عَبْدِ اللَّهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي عَلَى الرَّاحِلَةِ قِبَلَ أَىِّ وَجْهٍ تَوَجَّهُ بِهِ وَيُوتِرُ عَلَيْهَا غَيْرَ أَنَّهُ لاَ يُصَلِّي عَلَيْهَا الْمَكْتُوبَةَ ‏.‏",
    "malay_translation": "Telah diriwayatkan bahawa Rasulullah SAW (sallallahu alaihi wasallam) biasa menunaikan solat di atas tunggangan ketika dalam perjalanan, menghadap ke mana jua arah tunggangan itu menghadap, dan beliau akan menunaikan solat witir di atasnya, tetapi beliau tidak menunaikan solat fardu di atasnya."
  },
  {
    "id": 15483,
    "hadith_number": 747,
    "tajuk_hadith": "Perubahan Kiblat: Dari Ash-Sham ke Kaabah",
    "perawi_melayu": "Diriwayatkan oleh Ibnu Umar bahawa:",
    "english_text": "\"While the people were in Quba praying Subh prayer, someone came to them and said that revelation had come to Messenger of Allah(ﷺ) the night before, and he had been commanded to face Ka'bah. So face toward it. They had been facing toward Ash-Sham, so they turned to face toward Ka'bah.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ بَيْنَمَا النَّاسُ بِقُبَاءٍ فِي صَلاَةِ الصُّبْحِ جَاءَهُمْ آتٍ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ أُنْزِلَ عَلَيْهِ اللَّيْلَةَ قُرْآنٌ وَقَدْ أُمِرَ أَنْ يَسْتَقْبِلَ الْقِبْلَةَ ‏.‏ فَاسْتَقْبَلُوهَا وَكَانَتْ وُجُوهُهُمْ إِلَى الشَّامِ فَاسْتَدَارُوا إِلَى الْكَعْبَةِ ‏.‏",
    "malay_translation": "Ketika orang ramai sedang menunaikan solat Subuh di Quba, datang seseorang memberitahu mereka bahawa Rasulullah ﷺ telah menerima wahyu pada malam sebelumnya untuk mengubah arah kiblat.  Maka, mereka disuruh menghadap Kaabah. Sebelumnya, mereka menghadap ke arah Ash-Sham, lalu mereka mengubah arah kiblat ke Kaabah."
  },
  {
    "id": 15484,
    "hadith_number": 748,
    "tajuk_hadith": "Hadis tentang Ukuran Sutrah Semasa Solat",
    "perawi_melayu": "Dikatakan oleh Aisyah (ra) bahawa:",
    "english_text": "\"The messenger of Allah(ﷺ) was asked during the campaign of Tabuk about the Sutra of one who is praying. He said: \"Something as high as the back of a camel saddle.\"",
    "arabic_text": "أَخْبَرَنَا الْعَبَّاسُ بْنُ مُحَمَّدٍ الدُّورِيُّ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ، قَالَ حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ، عَنْ أَبِي الأَسْوَدِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ تَبُوكَ عَنْ سُتْرَةِ الْمُصَلِّي فَقَالَ ‏\n\"‏ مِثْلُ مُؤْخِرَةِ الرَّحْلِ ‏\"‏ ‏.‏",
    "malay_translation": "Utusan Allah (ﷺ) ditanya tentang sutrah orang yang sedang solat semasa kempen Tabuk. Baginda bersabda, \"Setinggi punggung unta."
  },
  {
    "id": 15485,
    "hadith_number": 749,
    "tajuk_hadith": "Rasulullah SAW Mendirikan Panah dan Solat Menghadapnya",
    "perawi_melayu": "Daripada Ibn Umar:",
    "english_text": "It was narrated from Ibn Umar concerning the Messenger of Allah (ﷺ) he said: \"He used to set up a short spear then pray facing toward it.\"",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ أَنْبَأَنَا نَافِعٌ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ كَانَ يَرْكُزُ الْحَرْبَةَ ثُمَّ يُصَلِّي إِلَيْهَا ‏.‏",
    "malay_translation": "Telah diriwayatkan daripada Ibn Umar bahawa Rasulullah SAW bersabda: \"Baginda biasa menancapkan anak panah lalu mendirikan solat menghadapnya.\""
  },
  {
    "id": 15486,
    "hadith_number": 750,
    "tajuk_hadith": "Kedekatan kepada Sutera dalam Solat dan Menjauhkan Diri dari Syaitan",
    "perawi_melayu": "Dikatakan oleh Sahl bin Abi Hathmah:",
    "english_text": "\"When anyone of you prays toward a Sutra, let him get close to it and not allow the Shaitan to sever his prayer for him.\"",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، وَإِسْحَاقُ بْنُ مَنْصُورٍ، قَالاَ حَدَّثَنَا سُفْيَانُ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ نَافِعِ بْنِ جُبَيْرٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا صَلَّى أَحَدُكُمْ إِلَى سُتْرَةٍ فَلْيَدْنُ مِنْهَا لاَ يَقْطَعُ الشَّيْطَانُ عَلَيْهِ صَلاَتَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila salah seorang daripada kamu solat menghadap sutera, maka hendaklah dia mendekatinya dan janganlah membiarkan syaitan memutuskan solatnya."
  },
  {
    "id": 15487,
    "hadith_number": 751,
    "tajuk_hadith": "Cara Rasulullah SAW Berdoa di Dalam Kaabah",
    "perawi_melayu": "Dikisahkan oleh Abdullah bin Umar:",
    "english_text": "It was narrated from Abdullah bin Umar that the Messenger of Allah (ﷺ) entered the Ka'bah with Usamah bin Zaid, Bilal and Uthman bin Talha  al Hajabi, and locked the door behind him. Abdullah bin Umar said: \"I asked Bilal when he came out: \" What did the Messenger of Allah (ﷺ) do?\" He said: \"He stood with one pillar to his left, two pillars to his right and three pillars behind him - at that time the House stood on six pillars - and he prayed with approximately three forearm's length between him and the wall.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ الْكَعْبَةَ هُوَ وَأُسَامَةُ بْنُ زَيْدٍ وَبِلاَلٌ وَعُثْمَانُ بْنُ طَلْحَةَ الْحَجَبِيُّ فَأَغْلَقَهَا عَلَيْهِ قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ فَسَأَلْتُ بِلاَلاً حِينَ خَرَجَ مَاذَا صَنَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ جَعَلَ عَمُودًا عَنْ يَسَارِهِ وَعَمُودَيْنِ عَنْ يَمِينِهِ وَثَلاَثَةَ أَعْمِدَةٍ وَرَاءَهُ - وَكَانَ الْبَيْتُ يَوْمَئِذٍ عَلَى سِتَّةِ أَعْمِدَةٍ - ثُمَّ صَلَّى وَجَعَلَ بَيْنَهُ وَبَيْنَ الْجِدَارِ نَحْوًا مِنْ ثَلاَثَةِ أَذْرُعٍ ‏.‏",
    "malay_translation": "Telah diceritakan oleh Abdullah bin Umar bahawa Rasulullah SAW memasuki Kaabah bersama Usamah bin Zaid, Bilal dan Uthman bin Talhah al-Hajabi, kemudian mengunci pintu di belakangnya. Abdullah bin Umar berkata, \"Kemudian saya bertanya kepada Bilal tatkala dia keluar, 'Apakah yang dilakukan oleh Rasulullah SAW?' Bilal menjawab, 'Baginda berdiri di sebelah kiri satu tiang, di sebelah kanan dua tiang dan di belakangnya tiga tiang – pada masa itu Baitullah disokong oleh enam tiang – dan baginda solat dengan jarak kira-kira tiga hasta antara baginda dan dinding.'"
  },
  {
    "id": 15488,
    "hadith_number": 752,
    "tajuk_hadith": "Pentingnya Halangan Semasa Solat dan Perbezaan Anjing Hitam",
    "perawi_melayu": "Dikisahkan oleh Abu Dzar bahawa:",
    "english_text": "The messenger of Allah(ﷺ) said: \"When anyone of you stands to pray, then he is screened if he has in front of him something as high as the back of a camel saddle. If he does not have something as high as the back of a camel saddle in front of him, then his prayer is nullified by a woman, a donkey or a black dog.\" I (one of the narrators)said: \"What is the difference between a black dog, a yellow one and a red one?\" He said: I asked the Messenger of Allah (ﷺ) just like you and he said:\"The black dog is a shaitan.\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ أَنْبَأَنَا يَزِيدُ، قَالَ حَدَّثَنَا يُونُسُ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا كَانَ أَحَدُكُمْ قَائِمًا يُصَلِّي فَإِنَّهُ يَسْتُرُهُ إِذَا كَانَ بَيْنَ يَدَيْهِ مِثْلُ آخِرَةِ الرَّحْلِ فَإِنْ لَمْ يَكُنْ بَيْنَ يَدَيْهِ مِثْلُ آخِرَةِ الرَّحْلِ فَإِنَّهُ يَقْطَعُ صَلاَتَهُ الْمَرْأَةُ وَالْحِمَارُ وَالْكَلْبُ الأَسْوَدُ ‏\"‏ ‏.‏ قُلْتُ مَا بَالُ الأَسْوَدِ مِنَ الأَصْفَرِ مِنَ الأَحْمَرِ فَقَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم كَمَا سَأَلْتَنِي فَقَالَ ‏\"‏ الْكَلْبُ الأَسْوَدُ شَيْطَانٌ ‏\"‏ ‏.‏",
    "malay_translation": "Pesuruh Allah (ﷺ) bersabda, \"Apabila salah seorang daripada kamu sedang berdiri untuk solat, maka ia terlindung jika ada sesuatu di hadapannya setinggi bonggol unta. Jika tiada sesuatu setinggi bonggol unta di hadapannya, maka solatnya terbatal disebabkan oleh wanita, keldai, atau anjing hitam.\" Aku (salah seorang perawi) bertanya, \"Apakah perbezaan antara anjing hitam, kuning dan merah?\" Beliau menjawab, \"Aku bertanya kepada Rasulullah (ﷺ) sebagaimana kamu bertanya kepadaku, maka baginda bersabda, \"Anjing hitam itu syaitan.\""
  },
  {
    "id": 15489,
    "hadith_number": 753,
    "tajuk_hadith": "Perkara Yang Membatalkan Solat Menurut Ibn Abbas",
    "perawi_melayu": "Dikatakan oleh Qatadah:",
    "english_text": "\"I aid to Jabir bin Zaid: \"What invalidates prayer?\" He said: \"Ibn Abbas used to say: A menstruating woman and a dog.\" (One of the narrators)Yahya said: \"Shubah said it was a marfu report.\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنِي شُعْبَةُ، وَهِشَامٌ، عَنْ قَتَادَةَ، قَالَ قُلْتُ لِجَابِرِ بْنِ زَيْدٍ مَا يَقْطَعُ الصَّلاَةَ قَالَ كَانَ ابْنُ عَبَّاسٍ يَقُولُ الْمَرْأَةُ الْحَائِضُ وَالْكَلْبُ ‏.‏ قَالَ يَحْيَى رَفَعَهُ شُعْبَةُ ‏.‏",
    "malay_translation": "Aku bertanya kepada Jabir bin Zaid, \"Apakah yang membatalkan solat?\" Dia menjawab, \"Ibn Abbas biasa berkata, wanita haid dan anjing.\"(Salah seorang perawi) Yahya berkata, \"Shubah mengatakan ia merupakan hadis marfu."
  },
  {
    "id": 15490,
    "hadith_number": 754,
    "tajuk_hadith": "Peristiwa di Arafah dan Kehadiran Rasulullah SAW Bersama Al-Fadl",
    "perawi_melayu": "Dikatakan oleh Ibn Abbas:",
    "english_text": "\"Al-Fadl dan saya menunggang seekor keldai betina milik kami, dan Rasulullah SAW sedang memimpin solat orang ramai di Arafah.\" Kemudian baginda mengucapkan sesuatu yang bermaksud demikian. \"Kami lalu di sebelah sebahagian barisan, kemudian kami turun dan membiarkan keldai itu meragut rumput, dan Rasulullah SAW tidak berkata apa-apa kepada kami.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، عَنْ سُفْيَانَ، قَالَ حَدَّثَنَا الزُّهْرِيُّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ جِئْتُ أَنَا وَالْفَضْلُ، عَلَى أَتَانٍ لَنَا وَرَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي بِالنَّاسِ بِعَرَفَةَ ثُمَّ ذَكَرَ كَلِمَةً مَعْنَاهَا فَمَرَرْنَا عَلَى بَعْضِ الصَّفِّ فَنَزَلْنَا وَتَرَكْنَاهَا تَرْتَعُ فَلَمْ يَقُلْ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم شَيْئًا ‏.‏",
    "malay_translation": "Diriwayatkan bahawa Ibn Abbas berkata: \"Saya dan Al-Fadl menunggang seekor keldai betina milik kami, dan Rasulullah SAW sedang memimpin solat orang ramai di Arafah. Kemudian baginda mengucapkan sesuatu yang bermaksud: \"Kami lalu di sebelah sebahagian barisan, kemudian kami turun dan membiarkan keldai itu meragut rumput, dan Rasulullah SAW tidak berkata apa-apa kepada kami.\""
  },
  {
    "id": 15491,
    "hadith_number": 755,
    "tajuk_hadith": "Rasulullah SAW Menziarahi Abbas di Padang Pasir dan Tidak Mengusir Haiwan",
    "perawi_melayu": "Dikatakan oleh Al-Fadl bin 'Abbas bahawa:",
    "english_text": "\"The Messenger of Allah(ﷺ)visited Al Abbas in some land of ours outside the city, and we had a small dog and a donkey which was grazing. The Messenger of Allah(ﷺ) prayed Asr and they\nwere in front of him, and they were \nnot shooed away or pushed away.\"",
    "arabic_text": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا حَجَّاجٌ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي مُحَمَّدُ بْنُ عُمَرَ بْنِ عَلِيٍّ، عَنْ عَبَّاسِ بْنِ عُبَيْدِ اللَّهِ بْنِ عَبَّاسٍ، عَنِ الْفَضْلِ بْنِ الْعَبَّاسِ، قَالَ زَارَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَبَّاسًا فِي بَادِيَةٍ لَنَا وَلَنَا كُلَيْبَةٌ وَحِمَارَةٌ تَرْعَى فَصَلَّى النَّبِيُّ صلى الله عليه وسلم الْعَصْرَ وَهُمَا بَيْنَ يَدَيْهِ فَلَمْ يُزْجَرَا وَلَمْ يُؤَخَّرَا ‏.‏",
    "malay_translation": "Utusan Allah (ﷺ) melawat Al-Abbas di sebidang tanah kami di luar bandar. Kami mempunyai seekor anjing kecil dan seekor keledai yang sedang meragut rumput. Utusan Allah (ﷺ) menunaikan solat Asar dan kedua-dua haiwan itu berada di hadapannya, dan haiwan tersebut tidak dihalau atau diusir."
  },
  {
    "id": 15492,
    "hadith_number": 756,
    "tajuk_hadith": "Rasulullah SAW Bersolat Walau Dilibat oleh Kanak-Kanak",
    "perawi_melayu": "Dikisahkan oleh Suhaib bin...",
    "english_text": "\"I heard Ibn Abbas narrate that he passed in front of the \nMessenger of Allah (ﷺ), he and a young boy of Banu Hashim, riding a donkey in front of the Messenger of Allah(ﷺ) when he was praying. \nThen they dismounted and joined the prayer, and he did not stop praying. Then two young girls of\nBanu Abdul-Muttalib started running around and grabbing him by the knees. He separated them\nbut he did not stop praying.\"",
    "arabic_text": "أَخْبَرَنَا أَبُو الأَشْعَثِ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، أَنَّ الْحَكَمَ، أَخْبَرَهُ قَالَ سَمِعْتُ يَحْيَى بْنَ الْجَزَّارِ، يُحَدِّثُ عَنْ صُهَيْبٍ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، يُحَدِّثُ أَنَّهُ مَرَّ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم هُوَ وَغُلاَمٌ مِنْ بَنِي هَاشِمٍ عَلَى حِمَارٍ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ يُصَلِّي فَنَزَلُوا وَدَخَلُوا مَعَهُ فَصَلَّوْا وَلَمْ يَنْصَرِفْ فَجَاءَتْ جَارِيَتَانِ تَسْعَيَانِ مِنْ بَنِي عَبْدِ الْمُطَّلِبِ فَأَخَذَتَا بِرُكْبَتَيْهِ فَفَرَعَ بَيْنَهُمَا وَلَمْ يَنْصَرِفْ ‏.‏",
    "malay_translation": "Rasulullah SAW tetap meneruskan solatnya walaupun diusik oleh kanak-kanak. Dikatakan,  beliau dan seorang budak lelaki Bani Hasyim yang menunggang keldai, melintas di hadapan Rasulullah SAW ketika baginda sedang menunaikan solat. Mereka berdua turun dari keldai dan turut serta dalam solat itu. Walaupun begitu, Rasulullah SAW tidak berhenti solat. Kemudian, dua orang gadis Bani Abdul-Muttalib datang dan menarik lutut baginda. Baginda memisahkan mereka, namun tetap meneruskan solat."
  },
  {
    "id": 15493,
    "hadith_number": 757,
    "tajuk_hadith": "Mengelak daripada Melintasi Rasulullah SAW semasa Solat",
    "perawi_melayu": "Dikisahkan bahawa Aisyah رضي الله عنها telah berkata:",
    "english_text": "\"I was in front of the Messenger of Allah (ﷺ) when he was praying, and when I wanted to leave I did not want to get up and pass in front of him, so I just slipped away slowly and quietly.\"",
    "arabic_text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ كُنْتُ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ يُصَلِّي فَإِذَا أَرَدْتُ أَنْ أَقُومَ كَرِهْتُ أَنْ أَقُومَ - فَأَمُرَّ بَيْنَ يَدَيْهِ - انْسَلَلْتُ انْسِلاَلاً ‏.‏",
    "malay_translation": "Saya berada di hadapan Rasulullah SAW ketika baginda sedang menunaikan solat. Apabila saya ingin keluar, saya tidak mahu bangun dan melintas di hadapan baginda, maka saya diam-diam bergerak perlahan untuk keluar."
  },
  {
    "id": 15494,
    "hadith_number": 758,
    "tajuk_hadith": "Balasan Orang Melintas di Hadapan Orang Solat",
    "perawi_melayu": "Dikisahkan oleh Busr bin Sa'eed:",
    "english_text": "It was narrated from Busr bin Sa'eed said that Zaid bin Khalid sent him to Abu Juhaim to ask him what he had heard the Messenger of Allah (ﷺ) say about one who passes in front of a person who is praying? Abu Juhaim said: \"The Messenger of Allah(ﷺ)said: \"If the one who passes in front of a person who is praying knew what (burden of sin) there is on him, standing for forty would be better for him than passing in front of him.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، أَنَّ زَيْدَ بْنَ خَالِدٍ، أَرْسَلَهُ إِلَى أَبِي جُهَيْمٍ يَسْأَلُهُ مَاذَا سَمِعَ مِنْ، رَسُولِ اللَّهِ صلى الله عليه وسلم يَقُولُ فِي الْمَارِّ بَيْنَ يَدَىِ الْمُصَلِّي فَقَالَ أَبُو جُهَيْمٍ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَوْ يَعْلَمُ الْمَارُّ بَيْنَ يَدَىِ الْمُصَلِّي مَاذَا عَلَيْهِ لَكَانَ أَنْ يَقِفَ أَرْبَعِينَ خَيْرًا لَهُ مِنْ أَنْ يَمُرَّ بَيْنَ يَدَيْهِ ‏\"‏ ‏.‏",
    "malay_translation": "Diriwayatkan daripada Busr bin Sa'eed bahawa Zaid bin Khalid menghantarnya kepada Abu Juhaim untuk bertanya apa yang didengarnya daripada Rasulullah SAW tentang orang yang melintas di hadapan orang yang sedang solat. Abu Juhaim berkata: \"Rasulullah SAW bersabda: Sekiranya orang yang melintas di hadapan orang yang sedang solat mengetahui betapa besar dosanya, lebih baik baginya berdiri selama empat puluh daripada melintas di hadapannya.\""
  },
  {
    "id": 15495,
    "hadith_number": 759,
    "tajuk_hadith": "Larangan Orang Melintas Semasa Solat dan Hukumnya",
    "perawi_melayu": "Dikisahkan oleh Abu Sa'id:",
    "english_text": "It was narrated from Abu Saeed that the  Messenger of Allah(ﷺ) said: \" If anyone of you is praying, he should not let anyone pass in front of him, and if he insists (on passing) then let him fight him.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي سَعِيدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا كَانَ أَحَدُكُمْ يُصَلِّي فَلاَ يَدَعْ أَحَدًا أَنْ يَمُرَّ بَيْنَ يَدَيْهِ فَإِنْ أَبَى فَلْيُقَاتِلْهُ ‏\"‏ ‏.‏",
    "malay_translation": "Dikabarkan daripada Abu Sa'id bahawa Rasulullah SAW bersabda, \"Jika salah seorang daripada kamu sedang menunaikan solat, janganlah dia membenarkan sesiapa pun melintas di hadapannya. Jika orang itu tetap ingin melintas, maka pertahankanlah solatnya (dengan cara yang sewajarnya).\" "
  },
  {
    "id": 15496,
    "hadith_number": 760,
    "tajuk_hadith": "Rasulullah SAW Melakukan Tawaf dan Solat di Samping Maqam Ibrahim",
    "perawi_melayu": "Dikisahkan oleh Kathir bin Kathir, daripada bapanya, daripada datuknya, bahawa beliau melihat Rasulullah SAW melakukan Tawaf tujuh kali mengelilingi Kaabah, kemudian menunaikan dua rakaat solat di tepi Maqam Ibrahim, dan tiada sesiapa pun di antara baginda dan orang ramai yang sedang melakukan Tawaf.",
    "english_text": "It was narrated from Kathir bin Kathir, from his father, that his grandfather said: \"I saw the Messenger of Allah (ﷺ) circumambulate the House seven times, then he prayed two Rak'ahs at the edge of the Maqam, and there was nothing between him and the people who were performing Tawaf.\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عِيسَى بْنُ يُونُسَ، قَالَ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَبْدِ الْعَزِيزِ بْنِ جُرَيْجٍ، عَنْ كَثِيرِ بْنِ كَثِيرٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم طَافَ بِالْبَيْتِ سَبْعًا ثُمَّ صَلَّى رَكْعَتَيْنِ بِحِذَائِهِ فِي حَاشِيَةِ الْمَقَامِ وَلَيْسَ بَيْنَهُ وَبَيْنَ الطُّوَّافِ أَحَدٌ ‏.‏",
    "malay_translation": "Dikisahkan oleh Kathir bin Kathir, daripada bapanya, daripada datuknya bahawa beliau melihat Rasulullah SAW melakukan Tawaf mengelilingi Kaabah sebanyak tujuh kali, kemudian menunaikan solat dua rakaat di sisi Maqam Ibrahim, dan tiada sesiapapun di antara Baginda dan orang ramai yang melakukan Tawaf."
  },
  {
    "id": 15497,
    "hadith_number": 761,
    "tajuk_hadith": "Rasulullah SAW Bersembahyang Malam dengan Sahabatnya yang Tidur",
    "perawi_melayu": "Dikisahkan oleh Aisyah RA:",
    "english_text": "\"The Messenger of Allah(ﷺ)used to pray at night while I was lying down sleeping between him and the Qibla on his bed. When he wanted to pray witr he would wake me up and I would pray witr\"",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، قَالَ حَدَّثَنَا أَبِي، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي مِنَ اللَّيْلِ وَأَنَا رَاقِدَةٌ مُعْتَرِضَةٌ بَيْنَهُ وَبَيْنَ الْقِبْلَةِ عَلَى فِرَاشِهِ فَإِذَا أَرَادَ أَنْ يُوتِرَ أَيْقَظَنِي فَأَوْتَرْتُ ‏.‏",
    "malay_translation": "“Baginda Rasulullah SAW  biasa menunaikan solat pada waktu malam ketika aku sedang tidur berbaring di antara baginda dan kiblat di atas katil baginda.  Apabila baginda ingin menunaikan solat witir, baginda akan membangunkan aku, dan aku akan menunaikan solat witir.”"
  },
  {
    "id": 15498,
    "hadith_number": 762,
    "tajuk_hadith": "Larangan Solat dan Duduk di Atas Kubur",
    "perawi_melayu": "Dikatakan oleh Abu Marthad al-Ghanawi:",
    "english_text": "\"The Messenger of Allah(ﷺ)said: 'Do not pray toward graves and do not sit on them.'\"",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا الْوَلِيدُ، عَنِ ابْنِ جَابِرٍ، عَنْ بُسْرِ بْنِ عُبَيْدِ اللَّهِ، عَنْ وَاثِلَةَ بْنِ الأَسْقَعِ، عَنْ أَبِي مَرْثَدٍ الْغَنَوِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تُصَلُّوا إِلَى الْقُبُورِ وَلاَ تَجْلِسُوا عَلَيْهَا ‏\"‏ ‏.‏",
    "malay_translation": "Baginda Rasulullah SAW bersabda, 'Janganlah kalian solat menghadap kubur dan jangan pula duduk di atasnya.'"
  },
  {
    "id": 15499,
    "hadith_number": 763,
    "tajuk_hadith": "Larangan Gambar dalam Rumah dan Tindakan Siti Aisyah",
    "perawi_melayu": "Dikisahkan oleh Aisyah:",
    "english_text": "\"In my house there was a cloth on which there were images, which I covered a closet which is in the house, and the Messenger of Allah (ﷺ) used to pray toward it. Then he  said: '0 Aisha, take it away from me.' So I removed it and made pillows out of it.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى الصَّنْعَانِيُّ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، قَالَ سَمِعْتُ الْقَاسِمَ، يُحَدِّثُ عَنْ عَائِشَةَ، قَالَتْ كَانَ فِي بَيْتِي ثَوْبٌ فِيهِ تَصَاوِيرُ فَجَعَلْتُهُ إِلَى سَهْوَةٍ فِي الْبَيْتِ فَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي إِلَيْهِ ثُمَّ قَالَ ‏\n\"‏ يَا عَائِشَةُ أَخِّرِيهِ عَنِّي ‏\"‏ ‏.‏ فَنَزَعْتُهُ فَجَعَلْتُهُ وَسَائِدَ ‏.‏",
    "malay_translation": "Dalam rumahku, terdapat sehelai kain yang terdapat gambar-gambar padanya. Aku meletakkannya di almari di dalam rumah itu, dan Rasulullah SAW selalu mendirikan solat menghadapnya. Kemudian baginda bersabda, ‘Wahai Aisyah, pindahkan ia dari sini.’ Lalu aku memindahkannya dan menggunakannya untuk dijadikan bantal."
  },
  {
    "id": 15500,
    "hadith_number": 764,
    "tajuk_hadith": "Keutamaan Amalan Berterusan dan Kepentingan Ikhlas dalam Ibadah",
    "perawi_melayu": "Dikhabarkan oleh 'Aishah r.a.,",
    "english_text": "\"The Messenger of Allah (ﷺ) had a mat which he would spread in the day and make into a small booth at night to pray in it. The people found out about that and they prayed when he prayed, with the mat in between him and them. He said: 'Do as much of good deeds as you can, for Allah does not get tired (of giving reward) until you get tired. And the most beloved of deeds to Allah are those that are continuous, even if they are few.' Then he stopped that prayer and did not return to it until Allah took him (in death), and if he started to do something he would persist in it.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ عَجْلاَنَ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم حَصِيرَةٌ يَبْسُطُهَا بِالنَّهَارِ وَيَحْتَجِرُهَا بِاللَّيْلِ فَيُصَلِّي فِيهَا فَفَطِنَ لَهُ النَّاسُ فَصَلَّوْا بِصَلاَتِهِ وَبَيْنَهُ وَبَيْنَهُمُ الْحَصِيرَةُ فَقَالَ ‏\n\"‏ اكْلَفُوا مِنَ الْعَمَلِ مَا تُطِيقُونَ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ لاَ يَمَلُّ حَتَّى تَمَلُّوا وَإِنَّ أَحَبَّ الأَعْمَالِ إِلَى اللَّهِ عَزَّ وَجَلَّ أَدْوَمُهُ وَإِنْ قَلَّ ‏\"‏ ‏.‏ ثُمَّ تَرَكَ مُصَلاَّهُ ذَلِكَ فَمَا عَادَ لَهُ حَتَّى قَبَضَهُ اللَّهُ عَزَّ وَجَلَّ وَكَانَ إِذَا عَمِلَ عَمَلاً أَثْبَتَهُ ‏.‏",
    "malay_translation": "Pesuruh Allah SAW mempunyai tikar yang digunakannya pada siang hari dan dijadikan tempat solat di malam hari.  Orang ramai mengetahui perkara tersebut lalu turut menunaikan solat bersama Baginda, dengan tikar itu berada di antara Baginda dan mereka.  Baginda bersabda, \"Lakukanlah amalan sebanyak yang mampu, kerana sesungguhnya Allah tidak jemu memberi ganjaran sehingga kamu jemu.  Dan amalan yang paling dicintai Allah adalah yang berterusan, walau sedikit.\"  Kemudian Baginda meninggalkan tempat solat itu dan tidak pernah kembali kepadanya sehingga Allah SWT mewafatkan Baginda. Dan sekiranya Baginda memulakan sesuatu amalan, Baginda akan teruskannya."
  },
  {
    "id": 15501,
    "hadith_number": 765,
    "tajuk_hadith": "Adakah Setiap Kamu Mempunyai Dua Pakaian?",
    "perawi_melayu": "Dikisahkan daripada Abu Hurairah bahawa seseorang bertanya kepada Rasulullah SAW tentang solat dalam satu pakaian, dan baginda menjawab:",
    "english_text": "\"Does everyone of you have two garments?\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ سَائِلاً، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الصَّلاَةِ فِي الثَّوْبِ الْوَاحِدِ فَقَالَ ‏\n\"‏ أَوَلِكُلِّكُمْ ثَوْبَانِ ‏\"‏ ‏.‏",
    "malay_translation": "\"Adakah setiap kamu mempunyai dua helai pakaian?\" \n\nPerawi: Dikabarkan kepada kami oleh Qatadah bin Said, dari Malik, dari Ibn Syihab, dari Said bin al-Musayyib, daripada Abu Hurairah, bahawa seorang yang bertanya kepada Rasulullah SAW tentang solat dalam satu pakaian, maka baginda menjawab:"
  },
  {
    "id": 15502,
    "hadith_number": 766,
    "tajuk_hadith": "Rasulullah SAW Bersembahyang dengan Satu Jubah",
    "perawi_melayu": "Dikisahkan oleh Umar bin Abi Salamah:",
    "english_text": "It was narrated from Umar bin Abi Salamah that he saw Messenger of Allah(ﷺ)praying in a single garment in the house of Umm Salamah, putting the ends of it on his shoulders.",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ، أَنَّهُ رَأَى رَسُولَ اللَّهِ صلى الله عليه وسلم يُصَلِّي فِي ثَوْبٍ وَاحِدٍ فِي بَيْتِ أُمِّ سَلَمَةَ وَاضِعًا طَرَفَيْهِ عَلَى عَاتِقَيْهِ ‏.‏",
    "malay_translation": "Dikisahkan oleh Umar bin Abi Salamah bahawa beliau melihat Rasulullah SAW sedang menunaikan solat di dalam rumah Umm Salamah dengan hanya mengenakan satu pakaian sahaja.  Baginda meletakkan hujung pakaian tersebut di atas kedua-dua bahu."
  },
  {
    "id": 15503,
    "hadith_number": 767,
    "tajuk_hadith": "Bolehkah Solat dengan Hanya Memakai Satu Baju?",
    "perawi_melayu": "Dikisahkan oleh Salamah bin Al-Akwa bahawa:",
    "english_text": "\" Saya berkata: 'Wahai Rasulullah ﷺ, saya pergi berburu hanya dengan memakai sehelai baju sahaja. Bolehkah saya solat dengannya?' Baginda bersabda: 'Kaitkanlah ia pada dirimu meskipun dengan duri.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا الْعَطَّافُ، عَنْ مُوسَى بْنِ إِبْرَاهِيمَ، عَنْ سَلَمَةَ بْنِ الأَكْوَعِ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي لأَكُونُ فِي الصَّيْدِ وَلَيْسَ عَلَىَّ إِلاَّ الْقَمِيصُ أَفَأُصَلِّي فِيهِ قَالَ ‏\n\"‏ وَزُرَّهُ عَلَيْكَ وَلَوْ بِشَوْكَةٍ ‏\"‏ ‏.‏",
    "malay_translation": "Dikatakan oleh Salamah bin Al-Akwa, \"Saya bertanya kepada Rasulullah ﷺ, 'Wahai Rasulullah, saya pergi berburu dengan hanya memakai sehelai baju. Bolehkah saya menunaikan solat dalam keadaan itu?' Baginda bersabda, 'Kaitkanlah baju itu ke badanmu, meskipun dengan sebatang duri.'"
  },
  {
    "id": 15504,
    "hadith_number": 768,
    "tajuk_hadith": "Tata Cara Solat Para Lelaki dan Wanita Ketika Rasullulah SAW",
    "perawi_melayu": "Dikisahkan oleh Sahl bin Sa'd bahawa:",
    "english_text": "\"Ada segolongan lelaki yang pernah menunaikan solat bersama Rasulullah SAW dengan melilitkan pakaian bawah mereka seperti anak-anak, dan dikatakan kepada para wanita, 'Jangan angkat kepala kalian sehingga para lelaki duduk dengan sempurna.'\"",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ كَانَ رِجَالٌ يُصَلُّونَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَاقِدِينَ أُزْرَهُمْ كَهَيْئَةِ الصِّبْيَانِ فَقِيلَ لِلنِّسَاءِ لاَ تَرْفَعْنَ رُءُوسَكُنَّ حَتَّى يَسْتَوِيَ الرِّجَالُ جُلُوسًا ‏.‏",
    "malay_translation": "Telah diberitakan bahawa ada segolongan lelaki pernah menunaikan solat bersama Rasulullah SAW dengan cara melilitkan pakaian bawah mereka seperti anak-anak. Kemudian dikatakan kepada para wanita, \"Jangan angkat kepala kalian sehingga para lelaki duduk dengan sempurna.\" "
  },
  {
    "id": 15505,
    "hadith_number": 769,
    "tajuk_hadith": "Keutamaan Pembaca Al-Quran dalam Solat",
    "perawi_melayu": "Dikisahkan oleh 'Amr bin Salamah bahawa:",
    "english_text": "\"Ketika kaumku kembali dari sisi Rasulullah ﷺ, mereka berkata: 'Dia telah bersabda: 'Semoga orang yang paling banyak membaca Al-Quran memimpin kamu dalam solat.' Maka mereka memanggilku dan mengajarkan kepadaku cara rukuk dan sujud, dan aku memimpin mereka dalam solat, dengan sehelai jubah yang koyak. Mereka pun berkata kepada ayahku: 'Tidakkah engkau menutupi belakang anakmu dari kami?\"",
    "arabic_text": "أَخْبَرَنَا شُعَيْبُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، قَالَ أَنْبَأَنَا عَاصِمٌ، عَنْ عَمْرِو بْنِ سَلِمَةَ، قَالَ لَمَّا رَجَعَ قَوْمِي مِنْ عِنْدِ النَّبِيِّ صلى الله عليه وسلم قَالُوا إِنَّهُ قَالَ ‏\n\"‏ لِيَؤُمَّكُمْ أَكْثَرُكُمْ قِرَاءَةً لِلْقُرْآنِ ‏\"‏ ‏.‏ قَالَ فَدَعَوْنِي فَعَلَّمُونِي الرُّكُوعَ وَالسُّجُودَ فَكُنْتُ أُصَلِّي بِهِمْ وَكَانَتْ عَلَىَّ بُرْدَةٌ مَفْتُوقَةٌ فَكَانُوا يَقُولُونَ لأَبِي أَلاَ تُغَطِّي عَنَّا اسْتَ ابْنِكَ ‏.‏",
    "malay_translation": "Dikisahkan bahawa apabila kaumku kembali dari sisi Nabi ﷺ, mereka berkata: \"Dia (Nabi ﷺ) bersabda: 'Semoga orang yang paling banyak membaca Al-Quran menjadi imam kamu dalam solat.' Kemudian mereka memanggilku dan mengajarkan kepadaku bagaimana rukuk dan sujud. Lalu aku memimpin mereka dalam solat, sedangkan aku mengenakan sehelai jubah yang koyak. Maka mereka berkata kepada ayahku: 'Tidakkah engkau menutupi belakang anakmu dari kami?'"
  },
  {
    "id": 15506,
    "hadith_number": 770,
    "tajuk_hadith": "Rasulullah SAW Berdoa di Malam Hari Walaupun Sahabatnya Haid",
    "perawi_melayu": "Diriwayatkan oleh Aisha RA bahawa:",
    "english_text": "\"The Messenger of Allah(ﷺ)used to pray at night when I was beside him and I was menstruating, and there was a garment over me, part of which was over Messenger of Allah(ﷺ)\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا وَكِيعٌ، قَالَ حَدَّثَنَا طَلْحَةُ بْنُ يَحْيَى، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي بِاللَّيْلِ وَأَنَا إِلَى جَنْبِهِ وَأَنَا حَائِضٌ وَعَلَىَّ مِرْطٌ بَعْضُهُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "“Rasulullah SAW pernah menunaikan solat di malam hari ketika aku berada di sisinya dan aku dalam keadaan haid.  Ada sehelai kain yang menutupi diriku, sebahagiannya turut menutupi Rasulullah SAW.”"
  },
  {
    "id": 15507,
    "hadith_number": 771,
    "tajuk_hadith": "Larangan Solat Dengan Satu Baju Tanpa Bahagian Di Bahu",
    "perawi_melayu": "Telah diriwayatkan oleh Abu Hurairah bahawa:",
    "english_text": "\"The Messenger of Allah(ﷺ)said: 'No one of you should pray in a single garment with no part of it on his shoulder.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يُصَلِّيَنَّ أَحَدُكُمْ فِي الثَّوْبِ الْوَاحِدِ لَيْسَ عَلَى عَاتِقِهِ مِنْهُ شَىْءٌ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, 'Janganlah salah seorang daripada kamu solat dalam satu pakaian sahaja tanpa sebarang bahagiannya di bahunya.'"
  },
  {
    "id": 15508,
    "hadith_number": 772,
    "tajuk_hadith": "Larangan Memakai Perhiasan Mewah dalam Solat",
    "perawi_melayu": "'Uqbah bin Amir meriwayatkan:",
    "english_text": "\"A silken Farruj was presented to the Messenger of\nAllah (ﷺ) and he put it on and offered the prayer in it, then when he had finished the prayer he tore it off as if he disliked it and said:'This is not befitting for those who\nhave Taqwa.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، وَعِيسَى بْنُ حَمَّادٍ، زُغْبَةُ عَنِ اللَّيْثِ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، قَالَ أُهْدِيَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَرُّوجُ حَرِيرٍ فَلَبِسَهُ ثُمَّ صَلَّى فِيهِ ثُمَّ انْصَرَفَ فَنَزَعَهُ نَزْعًا شَدِيدًا كَالْكَارِهِ لَهُ ثُمَّ قَالَ ‏\n\"‏ لاَ يَنْبَغِي هَذَا لِلْمُتَّقِينَ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang Farruj sutera dihadiahkan kepada Rasulullah SAW. Baginda memakainya dan menunaikan solat di dalamnya.  Setelah selesai solat, baginda menanggalkan Farruj itu dengan penuh keengganan seolah-olah tidak menyukainya dan bersabda, 'Ini tidak sesuai bagi orang-orang yang bertaqwa.'"
  },
  {
    "id": 15509,
    "hadith_number": 773,
    "tajuk_hadith": "Kekeliruan Tanda pada Pakaian Nabi SAW dan Perintah untuk Menggantinya",
    "perawi_melayu": "Daripada 'Aishah r.a. bahawa Rasulullah SAW solat di dalam sehelai khamisah yang mempunyai tanda-tanda.",
    "english_text": "\"These markings distracted me. Take it to Abu Jahm and bring me his Anbijani (a woolen garment with no markings).\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، - وَاللَّفْظُ لَهُ - عَنْ سُفْيَانَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى فِي خَمِيصَةٍ لَهَا أَعْلاَمٌ ثُمَّ قَالَ ‏\n\"‏ شَغَلَتْنِي أَعْلاَمُ هَذِهِ اذْهَبُوا بِهَا إِلَى أَبِي جَهْمٍ وَائْتُونِي بِأَنْبِجَانِيِّهِ ‏\"‏ ‏.‏",
    "malay_translation": "“Tanda-tanda ini mengganggu aku. Bawalah ia kepada Abu Jahm dan ambilkan Anbijani miliknya (sehelai kain bulu yang tidak bertanda).” Begitulah sabda Rasulullah SAW.  Daripada riwayat 'Aishah r.a. bahawa Rasulullah SAW pernah solat di dalam sehelai kain khamisah yang bertanda. Baginda kemudian bersabda seperti yang tersebut."
  },
  {
    "id": 15510,
    "hadith_number": 774,
    "tajuk_hadith": "Nabi SAW Keluar dengan Jubah Merah dan Solat ke arahnya walaupun dilalui anjing, wanita dan unta",
    "perawi_melayu": "Daripada Awn bin Abi Juhaifah, daripada bapanya",
    "english_text": "It was narrated from Awn bin Abi Juhaifah, from his father that, the Messenger of Allah(ﷺ) went out in a red Hullah, and he set up a short spear (Anazah) and prayed facing toward it, while dogs, women and donkeys were passing beyond it.",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ فِي حُلَّةٍ حَمْرَاءَ فَرَكَزَ عَنَزَةً فَصَلَّى إِلَيْهَا يَمُرُّ مِنْ وَرَائِهَا الْكَلْبُ وَالْمَرْأَةُ وَالْحِمَارُ ‏.‏",
    "malay_translation": "Telah diriwayatkan daripada Awn bin Abi Juhaifah, daripada bapanya, bahawa Rasulullah SAW keluar dengan memakai jubah berwarna merah. Baginda kemudian menancapkan tombak yang pendek (Anazah) dan mendirikan solat menghadap ke arahnya. Ketika itu, anjing, wanita dan unta lalu di belakangnya."
  },
  {
    "id": 15511,
    "hadith_number": 775,
    "tajuk_hadith": "Perlakuan Nabi SAW Semasa Haid",
    "perawi_melayu": "Khilas bin 'Amr berkata:",
    "english_text": "\"I heard Aisha (ra) say: 'The Messenger of Allah (ﷺ), Abii Al-Qbim, and I were beneath a single blanket, and\nI was menstruating. If something got on him from me, he would wash whatever had got on him and he did not wash anywhere else, and he prayed in it then came back to me.And if anything got on him from me,he would do exactly the same and he\ndid not wash anywhere else.\"'",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا جَابِرُ بْنُ صُبْحٍ، قَالَ سَمِعْتُ خِلاَسَ بْنَ عَمْرٍو، يَقُولُ سَمِعْتُ عَائِشَةَ، تَقُولُ كُنْتُ أَنَا وَرَسُولُ اللَّهِ، صلى الله عليه وسلم أَبُو الْقَاسِمِ فِي الشِّعَارِ الْوَاحِدِ وَأَنَا حَائِضٌ، طَامِثٌ فَإِنْ أَصَابَهُ مِنِّي شَىْءٌ غَسَلَ مَا أَصَابَهُ لَمْ يَعْدُهُ إِلَى غَيْرِهِ وَصَلَّى فِيهِ ثُمَّ يَعُودُ مَعِي فَإِنْ أَصَابَهُ مِنِّي شَىْءٌ فَعَلَ مِثْلَ ذَلِكَ لَمْ يَعْدُهُ إِلَى غَيْرِهِ ‏.‏",
    "malay_translation": "“Aku mendengar Aisyah (radhiyallahu ‘anha) berkata, ‘Aku dan Rasulullah SAW, Abu al-Qasim, dan berada di bawah selimut yang sama ketika aku sedang haid. Jika sesuatu terkena baginda daripadaku, baginda akan membersihkan tempat yang terkena itu sahaja, tanpa membersihkan tempat lain, dan baginda menunaikan solat di tempat yang terkena itu, kemudian kembali kepadaku. Dan jika ada sesuatu yang terkena baginda daripadaku, baginda akan melakukan perkara yang sama (membersihkan tempat yang terkena sahaja), tanpa membersihkan tempat lain.’”"
  },
  {
    "id": 15512,
    "hadith_number": 776,
    "tajuk_hadith": "Penjelasan tentang Wudu dan Solat Nabi SAW",
    "perawi_melayu": "Dikatakan oleh Hammam:",
    "english_text": "\"I saw Jarir urinate, then he called for water and performed wudhu, and wiped over his Khuffs, then he stood up and prayed. He was asked about that and he said: 'I saw the Prophet(ﷺ) do exactly like this.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، عَنْ إِبْرَاهِيمَ، عَنْ هَمَّامٍ، قَالَ رَأَيْتُ جَرِيرًا بَالَ ثُمَّ دَعَا بِمَاءٍ فَتَوَضَّأَ وَمَسَحَ عَلَى خُفَّيْهِ ثُمَّ قَامَ فَصَلَّى فَسُئِلَ عَنْ ذَلِكَ فَقَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم صَنَعَ مِثْلَ هَذَا ‏.‏",
    "malay_translation": "Saya melihat Jarir membuang air kecil, kemudian dia meminta air dan melakukan wuduk, dan membersihkan kasutnya (khuff), kemudian dia berdiri dan menunaikan solat. Dia ditanya tentang hal itu dan dia berkata: 'Saya melihat Rasulullah SAW melakukan seperti ini.' "
  },
  {
    "id": 15513,
    "hadith_number": 777,
    "tajuk_hadith": "Rasulullah صلى الله عليه وسلم Solat Dengan Kasut",
    "perawi_melayu": "Abu Maslamah – yang bernama Said bin Yazid, seorang yang dipercayai dari Basrah – telah memberitahu kami:",
    "english_text": "\"I asked Anas bin Malik: 'Did the Prophet (ﷺ) pray in sandals?' He said: 'Yes.'\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، عَنْ يَزِيدَ بْنِ زُرَيْعٍ، وَغَسَّانَ بْنِ مُضَرَ، قَالاَ حَدَّثَنَا أَبُو مَسْلَمَةَ، - وَاسْمُهُ سَعِيدُ بْنُ يَزِيدَ بَصْرِيٌّ - ثِقَةٌ قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ أَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي فِي النَّعْلَيْنِ قَالَ نَعَمْ ‏.‏",
    "malay_translation": "Saya bertanya kepada Anas bin Malik, \"Adakah Nabi saw. solat dengan memakai kasut?\" Jawabnya, \"Ya.\""
  },
  {
    "id": 15514,
    "hadith_number": 778,
    "tajuk_hadith": "Rasulullah SAW Menunaikan Solat pada Hari Pembebasan Mekah dengan Meletakkan Sandal di Kiri",
    "perawi_melayu": "Abdullah bin As Saib",
    "english_text": "It was narrated from Abdullah bin As Saib that the Messenger of Allah(ﷺ) prayed on the day of Conquest (of Makkah), and he put his sandals to his left.",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، وَشُعَيْبُ بْنُ يُوسُفَ، عَنْ يَحْيَى، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ عَبَّادٍ، عَنْ عَبْدِ اللَّهِ بْنِ سُفْيَانَ، عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى يَوْمَ الْفَتْحِ فَوَضَعَ نَعْلَيْهِ عَنْ يَسَارِهِ ‏.‏",
    "malay_translation": "Dikisahkan oleh Abdullah bin As Saib bahawa Rasulullah SAW menunaikan solat pada hari pembebasan Mekah (Fath Mekah), dan baginda meletakkan kedua-dua sandal di sebelah kiri baginda."
  }
]