[
  {
    "id": 18712,
    "hadith_number": 3976,
    "tajuk_hadith": "Perintah Jihad sehingga Mereka Mengesakan Allah",
    "perawi_melayu": "Dari Anas bin Malik",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا هَارُونُ بْنُ مُحَمَّدِ بْنِ بَكَّارِ بْنِ بِلاَلٍ، عَنْ مُحَمَّدِ بْنِ عِيسَى، - وَهُوَ ابْنُ سُمَيْعٍ - قَالَ حَدَّثَنَا حُمَيْدٌ الطَّوِيلُ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أُمِرْتُ أَنْ أُقَاتِلَ الْمُشْرِكِينَ حَتَّى يَشْهَدُوا أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ فَإِذَا شَهِدُوا أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ وَصَلَّوْا صَلاَتَنَا وَاسْتَقْبَلُوا قِبْلَتَنَا وَأَكَلُوا ذَبَائِحَنَا فَقَدْ حَرُمَتْ عَلَيْنَا دِمَاؤُهُمْ وَأَمْوَالُهُمْ إِلاَّ بِحَقِّهَا ‏\"‏ ‏.‏",
    "malay_translation": "Dari Anas bin Malik, bahawa Nabi SAW bersabda:  \"Aku diperintahkan untuk memerangi orang-orang musyrik sehingga mereka memberi kesaksian bahawa tiada Tuhan melainkan Allah, dan Muhammad adalah hamba dan utusan-Nya.  Maka apabila mereka memberi kesaksian bahawa tiada Tuhan melainkan Allah, dan Muhammad adalah hamba dan utusan-Nya, dan mereka menunaikan solat seperti solat kita, dan menghadap kiblat kita, dan memakan sembelihan kita, maka darah dan harta benda mereka menjadi haram ke atas kita kecuali dengan haknya.\""
  },
  {
    "id": 18713,
    "hadith_number": 3977,
    "tajuk_hadith": "Keharaman Menumpahkan Darah dan Merampas Harta Umat Islam",
    "perawi_melayu": "Dari Anas bin Malik ra.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ نُعَيْمٍ، قَالَ أَنْبَأَنَا حِبَّانُ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ فَإِذَا شَهِدُوا أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ وَاسْتَقْبَلُوا قِبْلَتَنَا وَأَكَلُوا ذَبِيحَتَنَا وَصَلَّوْا صَلاَتَنَا فَقَدْ حَرُمَتْ عَلَيْنَا دِمَاؤُهُمْ وَأَمْوَالُهُمْ إِلاَّ بِحَقِّهَا لَهُمْ مَا لِلْمُسْلِمِينَ وَعَلَيْهِمْ مَا عَلَيْهِمْ ‏\"‏ ‏.‏",
    "malay_translation": "Aku diperintahkan untuk memerangi manusia sehingga mereka mengakui bahawa tiada Tuhan melainkan Allah dan bahawa Muhammad adalah pesuruh Allah.  Apabila mereka mengakui bahawa tiada Tuhan melainkan Allah dan bahawa Muhammad adalah pesuruh Allah, menghadap kiblat kita, memakan binatang sembelihan kita dan menunaikan solat seperti kita, maka darah dan harta benda mereka menjadi haram ke atas kita kecuali atas hak yang tertentu. Mereka akan mendapat hak dan tanggungjawab yang sama seperti umat Islam."
  },
  {
    "id": 18714,
    "hadith_number": 3978,
    "tajuk_hadith": "Hukum Darah dan Harta Muslim",
    "perawi_melayu": "Maimun bin Siyah bertanya kepada Anas bin Malik:",
    "english_text": "\"O Abu Hamzah, what makes the blood and wealth of a Muslim forbidden?\" He said: \"Whoever bears witness to La ilaha illallah (there is none worthy of worship except Allah) and that Muhammad is the Messenger of Allah , faces our Qiblah, prays as we pray, and eats our slaughtered animals, he is a Muslim, and has the same rights and obligations as the Muslims.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ، قَالَ أَنْبَأَنَا حُمَيْدٌ، قَالَ سَأَلَ مَيْمُونُ بْنُ سِيَاهٍ أَنَسَ بْنَ مَالِكٍ قَالَ يَا أَبَا حَمْزَةَ مَا يُحَرِّمُ دَمَ الْمُسْلِمِ وَمَالَهُ فَقَالَ مَنْ شَهِدَ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ وَاسْتَقْبَلَ قِبْلَتَنَا وَصَلَّى صَلاَتَنَا وَأَكَلَ ذَبِيحَتَنَا فَهُوَ مُسْلِمٌ لَهُ مَا لِلْمُسْلِمِينَ وَعَلَيْهِ مَا عَلَى الْمُسْلِمِينَ ‏.‏",
    "malay_translation": "Wahai Abu Hamzah, apakah yang mengharamkan darah dan harta seorang Muslim?  Jawab Anas bin Malik: Sesiapa yang bersaksi bahawa tiada Tuhan melainkan Allah dan Muhammad adalah utusan Allah, menghadap kiblat kita, menunaikan solat seperti kita, dan memakan sembelihan kita, maka dia adalah seorang Muslim, dan dia mempunyai hak dan tanggungjawab yang sama seperti orang Islam yang lain."
  },
  {
    "id": 18715,
    "hadith_number": 3979,
    "tajuk_hadith": "Ketegasan Abu Bakar dalam Memerangi Kemurtadan",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ، قَالَ حَدَّثَنَا عِمْرَانُ أَبُو الْعَوَّامِ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ لَمَّا تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم ارْتَدَّتِ الْعَرَبُ فَقَالَ عُمَرُ يَا أَبَا بَكْرٍ كَيْفَ تُقَاتِلُ الْعَرَبَ فَقَالَ أَبُو بَكْرٍ إِنَّمَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنِّي رَسُولُ اللَّهِ وَيُقِيمُوا الصَّلاَةَ وَيُؤْتُوا الزَّكَاةَ ‏\"‏ ‏.‏ وَاللَّهِ لَوْ مَنَعُونِي عَنَاقًا مِمَّا كَانُوا يُعْطُونَ رَسُولَ اللَّهِ صلى الله عليه وسلم لَقَاتَلْتُهُمْ عَلَيْهِ ‏.‏ قَالَ عُمَرُ فَلَمَّا رَأَيْتُ رَأْىَ أَبِي بَكْرٍ قَدْ شُرِحَ عَلِمْتُ أَنَّهُ الْحَقُّ ‏.‏",
    "malay_translation": "Muhammad bin Bashar telah memberitahu kami, katanya: Amru bin 'Aasim telah menceritakan kepada kami, katanya: Imran Abu al-'Awwam telah menceritakan kepada kami, katanya: Ma'mar telah menceritakan kepada kami daripada az- Zuhri, daripada Anas bin Malik, katanya:  Apabila Rasulullah SAW wafat, orang-orang Arab murtad. Maka Umar berkata: \"Wahai Abu Bakar, bagaimana engkau akan memerangi orang-orang Arab?\"  Abu Bakar menjawab: \"Rasulullah SAW telah bersabda:  'Aku diperintahkan untuk memerangi manusia sehingga mereka mengakui bahawa tiada Tuhan melainkan Allah dan aku adalah utusan Allah, serta mendirikan solat dan menunaikan zakat.' Demi Allah, sekiranya mereka menghalangku daripada sebahagian daripada apa yang mereka berikan kepada Rasulullah SAW, nescaya aku akan memerangi mereka.\" Umar berkata: \"Apabila aku melihat ketegasan Abu Bakar, aku tahu bahawa itulah kebenaran.\""
  },
  {
    "id": 18716,
    "hadith_number": 3980,
    "tajuk_hadith": "Peperangan Abu Bakar al-Siddiq",
    "perawi_melayu": "Daripada Abu Hurairah r.a.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ لَمَّا تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَاسْتُخْلِفَ أَبُو بَكْرٍ وَكَفَرَ مَنْ كَفَرَ مِنَ الْعَرَبِ قَالَ عُمَرُ لأَبِي بَكْرٍ كَيْفَ تُقَاتِلُ النَّاسَ وَقَدْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللَّهُ فَمَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ عَصَمَ مِنِّي مَالَهُ وَنَفْسَهُ إِلاَّ بِحَقِّهِ وَحِسَابُهُ عَلَى اللَّهِ ‏\"‏ ‏.‏ قَالَ أَبُو بَكْرٍ وَاللَّهِ لأُقَاتِلَنَّ مَنْ فَرَّقَ بَيْنَ الصَّلاَةِ وَالزَّكَاةِ فَإِنَّ الزَّكَاةَ حَقُّ الْمَالِ وَاللَّهِ لَوْ مَنَعُونِي عِقَالاً كَانُوا يُؤَدُّونَهُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم لَقَاتَلْتُهُمْ عَلَى مَنْعِهِ قَالَ عُمَرُ فَوَاللَّهِ مَا هُوَ إِلاَّ أَنِّي رَأَيْتُ اللَّهَ شَرَحَ صَدْرَ أَبِي بَكْرٍ لِلْقِتَالِ فَعَرَفْتُ أَنَّهُ الْحَقُّ ‏.‏",
    "malay_translation": "Dikhabarkan kepada kami oleh Qutaibah bin Sa'id, katanya: telah menceritakan kepada kami Laith, daripada Uqail, daripada Az- Zuhri, telah memberitakan kepadaku Ubaidullah bin Abdullah bin Utba, daripada Abu Hurairah r.a., katanya:  Apabila Rasulullah SAW wafat dan Abu Bakar dilantik sebagai khalifah, dan orang-orang Arab yang kafir telah mengingkari Islam, Umar berkata kepada Abu Bakar: \"Bagaimana engkau memerangi manusia, sedangkan Rasulullah SAW telah bersabda:  \"Aku diperintahkan untuk memerangi manusia sehingga mereka mengucapkan tiada Tuhan melainkan Allah. Sesiapa yang mengucapkan tiada Tuhan melainkan Allah, maka dia telah memelihara harta dan dirinya daripada aku, kecuali atas haknya, dan hisabnya adalah di sisi Allah.\" Abu Bakar berkata: \"Demi Allah, aku pasti akan memerangi sesiapa yang memisahkan antara solat dan zakat, kerana zakat itu adalah hak harta. Demi Allah, sekiranya mereka menghalang aku daripada sesuatu yang mereka berikan kepada Rasulullah SAW, nescaya aku akan memerangi mereka kerana menghalangnya.\" Umar berkata: \"Demi Allah, ini hanyalah kerana aku melihat Allah telah melapangkan dada Abu Bakar untuk berperang, lalu aku mengetahui bahawa itulah yang benar.\""
  },
  {
    "id": 18717,
    "hadith_number": 3981,
    "tajuk_hadith": "Perintah Berjihad Sehingga Mereka Mengakui Tauhid dan Hubungan Solat dengan Zakat",
    "perawi_melayu": "Daripada Abu Hurairah, beliau berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ يَزِيدَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللَّهُ فَإِذَا قَالُوهَا فَقَدْ عَصَمُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إِلاَّ بِحَقِّهَا وَحِسَابُهُمْ عَلَى اللَّهِ ‏\"‏ ‏.‏ فَلَمَّا كَانَتِ الرِّدَّةُ قَالَ عُمَرُ لأَبِي بَكْرٍ أَتُقَاتِلُهُمْ وَقَدْ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ كَذَا وَكَذَا ‏.‏ فَقَالَ وَاللَّهِ لاَ أُفَرِّقُ بَيْنَ الصَّلاَةِ وَالزَّكَاةِ ‏.‏ وَلأُقَاتِلَنَّ مَنْ فَرَّقَ بَيْنَهُمَا ‏.‏ فَقَاتَلْنَا مَعَهُ فَرَأَيْنَا ذَلِكَ رُشْدًا ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ سُفْيَانُ فِي الزُّهْرِيِّ لَيْسَ بِالْقَوِيِّ وَهُوَ سُفْيَانُ بْنُ حُسَيْنٍ ‏.‏",
    "malay_translation": "Kami diberitakan oleh Ziad bin Ayyub, katanya: telah menceritakan kepada kami Muhammad bin Yazid, katanya: telah menceritakan kepada kami Sufian, daripada Az- Zuhri, daripada Ubaidullah bin Abdullah bin Utbah, daripada Abu Hurairah, katanya: Rasulullah SAW bersabda:\n\n\"Aku diperintahkan untuk memerangi manusia sehingga mereka berkata, Tiada Tuhan melainkan Allah. Apabila mereka mengucapkannya, maka terpeliharalah darah dan harta mereka daripada aku, kecuali dengan haknya, dan perhitungan mereka adalah di sisi Allah.\" \n\nKemudian, ketika berlaku peristiwa riddah (kemurtadan), Umar berkata kepada Abu Bakar: \"Adakah engkau akan memerangi mereka, sedangkan engkau telah mendengar Rasulullah SAW bersabda sedemikian dan sedemikian?\" Maka Abu Bakar menjawab: Demi Allah, aku tidak akan memisahkan antara solat dan zakat. Dan aku pasti akan memerangi sesiapa yang memisahkan antara keduanya. Maka kami berperang bersamanya dan kami dapati bahawa itu adalah jalan yang benar.\" Abu Abdurrahman Sufian berkata mengenai Az-Zuhri: \"Dia bukan seorang yang kuat.\" Dan dia (yang dimaksudkan) ialah Sufian bin Husain."
  },
  {
    "id": 18718,
    "hadith_number": 3982,
    "tajuk_hadith": "Perintah Jihad Hingga Mereka Mengucapkan Tauhid",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa :",
    "english_text": "The Messenger of Allah  said: \"I have been commanded to fight the people until they say La ilaha illallah (there is none worthy of worship but Allah). Whoever says La ilaha illallah, his wealth and his life are safe from me except for a right that is due, and his reckoning will be with Allah.\"",
    "arabic_text": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللَّهُ فَمَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ عَصَمَ مِنِّي مَالَهُ وَنَفْسَهُ إِلاَّ بِحَقِّهِ وَحِسَابُهُ عَلَى اللَّهِ عَزَّ وَجَلَّ ‏\"‏ ‏.‏ جَمَعَ شُعَيْبُ بْنُ أَبِي حَمْزَةَ الْحَدِيثَيْنِ جَمِيعًا ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Aku diperintahkan untuk memerangi manusia sehingga mereka mengucapkan La ilaha illallah (tiada Tuhan melainkan Allah). Sesiapa yang mengucapkan La ilaha illallah, maka harta dan nyawanya selamat daripada aku kecuali hak yang wajib dibayar, dan hisabnya adalah di sisi Allah SWT.\""
  },
  {
    "id": 18719,
    "hadith_number": 3983,
    "tajuk_hadith": "Ketegasan Abu Bakar dalam Memungut Zakat",
    "perawi_melayu": "Daripada Abu Hurairah, katanya:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ الْمُغِيرَةِ، قَالَ حَدَّثَنَا عُثْمَانُ، عَنْ شُعَيْبٍ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ لَمَّا تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَكَانَ أَبُو بَكْرٍ بَعْدَهُ وَكَفَرَ مَنْ كَفَرَ مِنَ الْعَرَبِ قَالَ عُمَرُ يَا أَبَا بَكْرٍ كَيْفَ تُقَاتِلُ النَّاسَ وَقَدْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللَّهُ فَمَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ فَقَدْ عَصَمَ مِنِّي مَالَهُ وَنَفْسَهُ إِلاَّ بِحَقِّهِ وَحِسَابُهُ عَلَى اللَّهِ عَزَّ وَجَلَّ ‏\"‏ ‏.‏ قَالَ أَبُو بَكْرٍ لأُقَاتِلَنَّ مَنْ فَرَّقَ بَيْنَ الصَّلاَةِ وَالزَّكَاةِ فَإِنَّ الزَّكَاةَ حَقُّ الْمَالِ فَوَاللَّهِ لَوْ مَنَعُونِي عَنَاقًا كَانُوا يُؤَدُّونَهَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم لَقَاتَلْتُهُمْ عَلَى مَنْعِهَا ‏.‏ قَالَ عُمَرُ فَوَاللَّهِ مَا هُوَ إِلاَّ أَنْ رَأَيْتُ اللَّهَ شَرَحَ صَدْرَ أَبِي بَكْرٍ لِلْقِتَالِ فَعَرَفْتُ أَنَّهُ الْحَقُّ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Muhammad bin al-Mughirah, katanya; telah menceritakan kepada kami Utsman, dari Syu'aib, dari az- Zuhri, katanya; telah menceritakan kepada kami Ubaidillah bin Abdullah bin Utbah, bahawa Abu Hurairah berkata: “Apabila Rasulullah SAW wafat, dan Abu Bakar menjadi khalifah selepasnya, dan orang-orang Arab yang kafir telah murtad. Umar berkata kepada Abu Bakar: “Wahai Abu Bakar, bagaimanakah engkau memerangi manusia, sedangkan Rasulullah SAW telah bersabda:  ‘Aku diperintahkan untuk memerangi manusia sehingga mereka mengatakan: “La ilaha illallah”. Barangsiapa yang mengatakan: “La ilaha illallah”, maka harta dan dirinya terpelihara daripada keganasanku, kecuali disebabkan haknya dan perhitungannya adalah di sisi Allah SWT.’”. Abu Bakar berkata: “Aku akan memerangi sesiapa yang memisahkan antara solat dan zakat, kerana zakat adalah hak daripada harta. Demi Allah, sekiranya mereka menghalang aku daripada mendapatkan sesuatu yang mereka wajib tunaikan kepada Rasulullah SAW, nescaya aku akan memerangi mereka kerana menghalangnya”. Umar berkata: “Demi Allah, aku hanya melihat Allah telah melapangkan dada Abu Bakar untuk berperang, maka aku tahu bahawa itulah kebenaran.”"
  },
  {
    "id": 18720,
    "hadith_number": 3984,
    "tajuk_hadith": "Peperangan Sehingga La ilaha illallah",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa :",
    "english_text": "The Messenger of Allah  said: \"I have been commanded to fight the people until they say La ilaha illallah, and whoever says it, his life and his wealth are safe from me, except for a right that is due, and his reckoning will be with Allah.\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ الْمُغِيرَةِ، قَالَ حَدَّثَنَا عُثْمَانُ، عَنْ شُعَيْبٍ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللَّهُ فَمَنْ قَالَهَا فَقَدْ عَصَمَ مِنِّي نَفْسَهُ وَمَالَهُ إِلاَّ بِحَقِّهِ وَحِسَابُهُ عَلَى اللَّهِ ‏\"‏ ‏.‏ خَالَفَهُ الْوَلِيدُ بْنُ مُسْلِمٍ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Aku diperintahkan untuk memerangi manusia sehingga mereka mengucapkan 'La ilaha illallah'.  Barangsiapa yang mengucapkannya, maka nyawanya dan hartanya selamat daripada aku, kecuali hak yang wajib dibayar, dan hisabnya di sisi Allah.\""
  },
  {
    "id": 18721,
    "hadith_number": 3985,
    "tajuk_hadith": "Keputusan Abu Bakar untuk berperang dan pengesahan Umar",
    "perawi_melayu": "Daripada Abu Hurairah ra.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا مُؤَمَّلُ بْنُ الْفَضْلِ، قَالَ حَدَّثَنَا الْوَلِيدُ، قَالَ حَدَّثَنِي شُعَيْبُ بْنُ أَبِي حَمْزَةَ، وَسُفْيَانُ بْنُ عُيَيْنَةَ، وَذَكَرَ، آخَرَ عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ فَأَجْمَعَ أَبُو بَكْرٍ لِقِتَالِهِمْ فَقَالَ عُمَرُ يَا أَبَا بَكْرٍ كَيْفَ تُقَاتِلُ النَّاسَ وَقَدْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللَّهُ فَإِذَا قَالُوهَا عَصَمُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إِلاَّ بِحَقِّهَا ‏\"‏ ‏.‏ قَالَ أَبُو بَكْرٍ لأُقَاتِلَنَّ مَنْ فَرَّقَ بَيْنَ الصَّلاَةِ وَالزَّكَاةِ وَاللَّهِ لَوْ مَنَعُونِي عَنَاقًا كَانُوا يُؤَدُّونَهَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم لَقَاتَلْتُهُمْ عَلَى مَنْعِهَا ‏.‏ قَالَ عُمَرُ فَوَاللَّهِ مَا هُوَ إِلاَّ أَنْ رَأَيْتُ اللَّهَ قَدْ شَرَحَ صَدْرَ أَبِي بَكْرٍ لِقِتَالِهِمْ فَعَرَفْتُ أَنَّهُ الْحَقُّ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Sulaiman, dia berkata; telah menceritakan kepada kami Mu'ammal bin al-Fadl, dia berkata; telah menceritakan kepada kami al-Walid, dia berkata; telah menceritakan kepadaku Syu'aib bin Abi Hamza, dan Sufyan bin Uyainah, dan yang lain daripada Az- Zuhri, daripada Sa'id bin al-Musayyab, daripada Abu Hurairah r.a., dia berkata: Maka Abu Bakar berazam untuk memerangi mereka. Maka Umar berkata: \"Wahai Abu Bakar, bagaimanakah engkau memerangi manusia sedangkan Rasulullah SAW telah bersabda: \"Aku diperintahkan untuk memerangi manusia sehingga mereka mengucapkan: Tiada Tuhan melainkan Allah. Jika mereka mengucapkannya, maka mereka terpelihara daripada ku (daripada ancamanku) akan darah dan harta mereka kecuali dengan hak.\" Abu Bakar berkata: Aku pasti akan memerangi sesiapa yang memisahkan solat dan zakat. Demi Allah, sekiranya mereka menghalang aku daripada sesuatu yang mereka sampaikan kepada Rasulullah SAW, nescaya aku akan memerangi mereka kerana menghalang sesuatu itu. Umar berkata: Demi Allah, ini hanyalah kerana aku melihat Allah telah melapangkan dada Abu Bakar untuk memerangi mereka, maka aku tahu bahawa itulah kebenaran."
  },
  {
    "id": 18722,
    "hadith_number": 3986,
    "tajuk_hadith": "Perintah Berjihad Hingga Lafaz Tauhid Dikatakan",
    "perawi_melayu": "Daripada Abu Hurairah r.a.",
    "english_text": "\"The Messenger of Allah  said: 'I have been commanded to fight the people until they say La ilaha illallah. If they say it, then their blood and wealth are prohibited for me, except for a right that is due, and their reckoning will be with Allah, the Mighty and Sublime.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَأَنْبَأَنَا أَحْمَدُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللَّهُ فَإِذَا قَالُوهَا مَنَعُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إِلاَّ بِحَقِّهَا وَحِسَابُهُمْ عَلَى اللَّهِ عَزَّ وَجَلَّ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Aku diperintahkan untuk memerangi manusia sehingga mereka mengucapkan 'La ilaha illallah'.  Sekiranya mereka mengucapkannya, maka darah dan harta mereka diharamkan ke atasku, kecuali hak yang wajib dibayar, dan perhitungan mereka adalah di sisi Allah SWT yang Maha Agung dan Maha Mulia.\""
  },
  {
    "id": 18723,
    "hadith_number": 3987,
    "tajuk_hadith": "Perintah Jihad Sehingga La ilaha illallah Diucapkan",
    "perawi_melayu": "Dari Abu Hurairah r.a.",
    "english_text": "\"The Messenger of Allah  said: 'I have been commanded to fight the people until they say La ilaha illallah. If they say it, then their blood and wealth are prohibited for me, except for a right that is due, and their reckoning will be with Allah.'\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا يَعْلَى بْنُ عُبَيْدٍ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، وَعَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالاَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللَّهُ فَإِذَا قَالُوهَا مَنَعُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إِلاَّ بِحَقِّهَا وَحِسَابُهُمْ عَلَى اللَّهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Aku diperintahkan untuk memerangi manusia sehingga mereka mengucapkan 'La ilaha illallah'.  Jika mereka mengucapkannya, maka darah dan harta benda mereka diharamkan ke atasku, kecuali hak yang sepatutnya, dan hisab mereka adalah di sisi Allah.\""
  },
  {
    "id": 18724,
    "hadith_number": 3988,
    "tajuk_hadith": "Jihad sehingga mereka mengucapkan Tauhid",
    "perawi_melayu": "Daripada Abu Hurairah",
    "english_text": "The Messenger of Allah  said: \"We will fight the people until they say La ilaha illallah. If they say La ilaha illallah then their blood and their wealth become forbidden to us, except for a right that is due, and their reckoning will be with Allah.\"",
    "arabic_text": "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، قَالَ حَدَّثَنَا شَيْبَانُ، عَنْ عَاصِمٍ، عَنْ زِيَادِ بْنِ قَيْسٍ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ نُقَاتِلُ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللَّهُ فَإِذَا قَالُوا لاَ إِلَهَ إِلاَّ اللَّهُ حَرُمَتْ عَلَيْنَا دِمَاؤُهُمْ وَأَمْوَالُهُمْ إِلاَّ بِحَقِّهَا وَحِسَابُهُمْ عَلَى اللَّهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Kami akan memerangi manusia sehingga mereka mengatakan لا إله إلا الله.  Apabila mereka mengatakan لا إله إلا الله, maka darah dan harta benda mereka menjadi haram ke atas kami, kecuali dengan haknya, dan hisab mereka adalah di sisi Allah.\""
  },
  {
    "id": 18725,
    "hadith_number": 3989,
    "tajuk_hadith": "Larangan membunuh sesiapa yang mengucap kalimah syahadah",
    "perawi_melayu": "Daripada Nu'man bin Bashir, katanya:",
    "english_text": "\"We were with the Messenger of Allah  said: 'Do not kill him, for I have been commanded to fight the people until they say La ilaha illallah, and if they say it, their blood and their wealth are safe from me, except for a right that is due, and their reckoning will be with Allah.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا الأَسْوَدُ بْنُ عَامِرٍ، قَالَ حَدَّثَنَا إِسْرَائِيلُ، عَنْ سِمَاكٍ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فَجَاءَ رَجُلٌ فَسَارَّهُ فَقَالَ ‏\"‏ اقْتُلُوهُ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ أَيَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ ‏\"‏ ‏.‏ قَالَ نَعَمْ وَلَكِنَّمَا يَقُولُهَا تَعَوُّذًا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَقْتُلُوهُ فَإِنَّمَا أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللَّهُ فَإِذَا قَالُوهَا عَصَمُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إِلاَّ بِحَقِّهَا وَحِسَابُهُمْ عَلَى اللَّهِ ‏\"‏ ‏.‏",
    "malay_translation": "Kami berada bersama Rasulullah SAW.  Lalu datang seorang lelaki dan berbisik kepada Baginda, lalu berkata, \"Bunuh dia!\" Kemudian Baginda bertanya, \"Adakah dia bersaksi bahawa tiada Tuhan melainkan Allah?\"  Jawab mereka, \"Ya, tetapi dia mengucapkannya hanya sebagai pelindung diri.\" Maka Rasulullah SAW bersabda, \"Jangan bunuh dia! Kerana aku hanya di perintahkan untuk memerangi manusia sehingga mereka mengucapkan 'La ilaha illallah'.  Apabila mereka mengucapkannya, maka terpeliharalah darah dan harta benda mereka daripada aku, kecuali kerana haknya, dan hisab mereka adalah di sisi Allah.\""
  },
  {
    "id": 18726,
    "hadith_number": 3990,
    "tajuk_hadith": "Jihad sehingga mereka mengucapkan La ilaha illallah",
    "perawi_melayu": "Daripada Nu'man bin Salim bahawa:",
    "english_text": "A man said to him: \"The Messenger of Allah  came to us while we were in a tent inside the Masjid of Al-Al-Madinah, and he said to us: 'It has been revealed to me that I should fight the people until they say La ilaha illallah.'\" A similar narration.",
    "arabic_text": "‏{‏ أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، ‏}‏ قَالَ عُبَيْدُ اللَّهِ حَدَّثَنَا إِسْرَائِيلُ، عَنْ سِمَاكٍ، عَنِ النُّعْمَانِ بْنِ سَالِمٍ، عَنْ رَجُلٍ، حَدَّثَهُ قَالَ دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَنَحْنُ فِي قُبَّةٍ فِي مَسْجِدِ الْمَدِينَةِ وَقَالَ فِيهِ ‏\n\"‏ إِنَّهُ أُوحِيَ إِلَىَّ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللَّهُ ‏\"‏ ‏.‏ نَحْوَهُ ‏.‏",
    "malay_translation": "Seorang lelaki memberitahu: \"Rasulullah SAW telah datang kepada kami ketika kami berada di dalam sebuah khemah di Masjid Madinah, dan baginda bersabda: 'Sesungguhnya telah diwahyukan kepadaku supaya aku memerangi manusia sehingga mereka mengucapkan La ilaha illallah.'\"  Riwayat yang serupa."
  },
  {
    "id": 18727,
    "hadith_number": 3991,
    "tajuk_hadith": "Rasulullah SAW Menziarahi Sahabat di dalam Khemah",
    "perawi_melayu": "Daripada Nu'man bin Salim, katanya:",
    "english_text": "\"I heard Aws say: 'The Messenger of Allah  came to us when we were in a tent.'\" And he quoted the same Hadith.",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدِ بْنِ أَعْيَنَ، قَالَ حَدَّثَنَا زُهَيْرٌ، قَالَ حَدَّثَنَا سِمَاكٌ، عَنِ النُّعْمَانِ بْنِ سَالِمٍ، قَالَ سَمِعْتُ أَوْسًا، يَقُولُ دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَنَحْنُ فِي قُبَّةٍ وَسَاقَ الْحَدِيثَ ‏.‏",
    "malay_translation": "Aku mendengar Aws berkata: 'Rasulullah SAW datang kepada kami ketika kami berada di dalam sebuah khemah.' Dan dia menyebutkan hadis yang sama."
  },
  {
    "id": 18728,
    "hadith_number": 3992,
    "tajuk_hadith": "Perintah Jihad Sehingga Mereka Mengucapkan Tauhid",
    "perawi_melayu": "Daripada Nu'man bin Salim, katanya:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ النُّعْمَانِ بْنِ سَالِمٍ، قَالَ سَمِعْتُ أَوْسًا، يَقُولُ أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي وَفْدِ ثَقِيفٍ فَكُنْتُ مَعَهُ فِي قُبَّةٍ فَنَامَ مَنْ كَانَ فِي الْقُبَّةِ غَيْرِي وَغَيْرُهُ فَجَاءَ رَجُلٌ فَسَارَّهُ فَقَالَ ‏\"‏ اذْهَبْ فَاقْتُلْهُ ‏\"‏ ‏.‏ فَقَالَ ‏\"‏ أَلَيْسَ يَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنِّي رَسُولُ اللَّهِ ‏\"‏ ‏.‏ قَالَ يَشْهَدُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ذَرْهُ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللَّهُ فَإِذَا قَالُوهَا حَرُمَتْ دِمَاؤُهُمْ وَأَمْوَالُهُمْ إِلاَّ بِحَقِّهَا ‏\"‏ ‏.‏ قَالَ مُحَمَّدٌ فَقُلْتُ لِشُعْبَةَ أَلَيْسَ فِي الْحَدِيثِ ‏\"‏ أَلَيْسَ يَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنِّي رَسُولُ اللَّهِ ‏\"‏ ‏.‏ قَالَ أَظُنُّهَا مَعَهَا وَلاَ أَدْرِي ‏.‏",
    "malay_translation": "Aku telah diberitahu oleh Muhammad bin Bashar, katanya: Aku telah diberitahu oleh Muhammad, katanya: Aku telah diberitahu oleh Syu'bah, daripada Nu'man bin Salim, katanya: Aku mendengar Aus berkata: Aku datang kepada Rasulullah SAW dalam satu rombongan dari suku Tsaqif, lalu aku berada bersamanya di dalam sebuah khemah.  Mereka yang lain di dalam khemah itu telah tidur kecuali aku dan seorang lagi. Lalu datanglah seorang lelaki dan berbisik kepadanya lalu berkata, \"Pergilah dan bunuh dia!\"  Kemudian (Rasulullah SAW) bertanya, \"Bukankah dia mengaku bahawa tiada Tuhan melainkan Allah dan aku adalah utusan Allah?\"  Dia menjawab, \"Ya, dia mengaku.\"  Lalu Rasulullah SAW bersabda, \"Biarkan dia.\"  Kemudian Baginda bersabda, \"Aku diperintahkan untuk memerangi manusia sehingga mereka mengucapkan La ilaha illallah.  Apabila mereka mengucapkannya, maka darah dan harta benda mereka menjadi haram bagiku, kecuali dengan haknya.\"  Muhammad berkata: Lalu aku bertanya kepada Syu'bah: Bukankah di dalam hadis itu ada (ayat), \"Bukankah dia mengaku bahawa tiada Tuhan melainkan Allah dan aku adalah utusan Allah?\"  Dia menjawab: Aku fikir ia ada di dalamnya, tetapi aku tidak pasti."
  },
  {
    "id": 18729,
    "hadith_number": 3993,
    "tajuk_hadith": "Perintah Jihad Sehingga Mereka Mengesakan Allah",
    "perawi_melayu": "Daripada An-Nu'man bin Salim bahawa:",
    "english_text": "'Amr bin Aws told him that his father Aws said: \"The Messenger of Allah  said: 'I have been commanded to fight the people until they bear witness to La ilaha illallah (there is none worthy of worship except Allah), then their blood and their wealth become forbidden to me, except for a right that is due.'\"",
    "arabic_text": "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَكْرٍ، قَالَ حَدَّثَنَا حَاتِمُ بْنُ أَبِي صَغِيرَةَ، عَنِ النُّعْمَانِ بْنِ سَالِمٍ، أَنَّ عَمْرَو بْنَ أَوْسٍ، أَخْبَرَهُ أَنَّ أَبَاهُ أَوْسًا قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ ثُمَّ تَحْرُمُ دِمَاؤُهُمْ وَأَمْوَالُهُمْ إِلاَّ بِحَقِّهَا ‏\"‏ ‏.‏",
    "malay_translation": "Amr bin Aws memberitahu bapanya, Aws, bahawa Rasulullah SAW bersabda:  \"Aku diperintahkan untuk memerangi manusia sehingga mereka memberi kesaksian bahawa tiada Tuhan melainkan Allah, maka darah dan harta benda mereka menjadi haram bagiku, kecuali dengan haknya.\""
  },
  {
    "id": 18730,
    "hadith_number": 3994,
    "tajuk_hadith": "Pengampunan Allah SWT Kecuali Dua Dos",
    "perawi_melayu": "Daripada Abu Idris berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى، عَنْ ثَوْرٍ، عَنْ أَبِي عَوْنٍ، عَنْ أَبِي إِدْرِيسَ، قَالَ سَمِعْتُ مُعَاوِيَةَ، يَخْطُبُ - وَكَانَ قَلِيلَ الْحَدِيثِ - عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ سَمِعْتُهُ يَخْطُبُ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ كُلُّ ذَنْبٍ عَسَى اللَّهُ أَنْ يَغْفِرَهُ إِلاَّ الرَّجُلُ يَقْتُلُ الْمُؤْمِنَ مُتَعَمِّدًا أَوِ الرَّجُلُ يَمُوتُ كَافِرًا ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Muawiyah menyampaikan khutbah, dan beliau meriwayatkan beberapa Hadis daripada Rasulullah SAW yang bermaksud: \"Setiap dosa, Allah SWT mungkin mengampunkannya, kecuali orang yang membunuh seorang mukmin dengan sengaja, atau orang yang mati dalam keadaan kafir.\""
  },
  {
    "id": 18731,
    "hadith_number": 3995,
    "tajuk_hadith": "Tanggungjawab atas Pembunuhan yang Zalim",
    "perawi_melayu": "Daripada Abdullah bahawa:",
    "english_text": "The Prophet  said: \"No person is killed wrongfully, but a share of responsibility for his blood will be upon the first son of Adam, because he was the first one to set the precedence, of killing.\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، عَنْ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تُقْتَلُ نَفْسٌ ظُلْمًا إِلاَّ كَانَ عَلَى ابْنِ آدَمَ الأَوَّلِ كِفْلٌ مِنْ دَمِهَا وَذَلِكَ أَنَّهُ أَوَّلُ مَنْ سَنَّ الْقَتْلَ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Tiada seorang pun dibunuh secara zalim melainkan sebahagian daripada tanggungjawab atas darahnya akan dikenakan ke atas anak Adam yang pertama. Ini kerana dia adalah orang pertama yang memulakan pembunuhan.\""
  },
  {
    "id": 18732,
    "hadith_number": 3996,
    "tajuk_hadith": "Kejahatan Membunuh Seorang Mukmin",
    "perawi_melayu": "Daripada Abdullah bin Amr bin Al-'As, katanya:",
    "english_text": "\"The Messenger of Allah  said: 'By the One in Whose Hand is my soul, killing a believer is more grievous before Allah than the extinction of the whole world.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مُعَاوِيَةَ بْنِ مَالَجَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْحَرَّانِيُّ، عَنِ ابْنِ إِسْحَاقَ، عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ، عَنْ إِسْمَاعِيلَ، مَوْلَى عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لَقَتْلُ مُؤْمِنٍ أَعْظَمُ عِنْدَ اللَّهِ مِنْ زَوَالِ الدُّنْيَا ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ إِبْرَاهِيمُ بْنُ الْمُهَاجِرِ لَيْسَ بِالْقَوِيِّ ‏.‏",
    "malay_translation": "Daripada Abdullah bin Amr bin Al-'As, katanya: Rasulullah SAW bersabda: \"Demi Zat yang jiwa ku berada di tangan-Nya, membunuh seorang mukmin lebih besar dosanya di sisi Allah daripada  kehancuran seluruh dunia.\""
  },
  {
    "id": 18733,
    "hadith_number": 3997,
    "tajuk_hadith": "Kehancuran Dunia dan Pembunuhan Muslim",
    "perawi_melayu": "Daripada Abdullah bin 'Amr, bahawa Baginda SAW bersabda:",
    "english_text": "The Prophet  said: \"The extinction of the whole world is less significant before Allah than killing a Muslim man.\"",
    "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ حَكِيمٍ الْبَصْرِيُّ، قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ يَعْلَى بْنِ عَطَاءٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَزَوَالُ الدُّنْيَا أَهْوَنُ عِنْدَ اللَّهِ مِنْ قَتْلِ رَجُلٍ مُسْلِمٍ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Abdullah bin 'Amr, bahawa Nabi SAW bersabda: \"Kehancuran dunia ini lebih ringan di sisi Allah daripada membunuh seorang lelaki Muslim.\""
  },
  {
    "id": 18734,
    "hadith_number": 3998,
    "tajuk_hadith": "Kejahatan Membunuh Seorang Mukmin",
    "perawi_melayu": "Daripada Abdullah bin 'Amr, beliau berkata:",
    "english_text": "\"Killing a believer is more grievous before Allah than the extinction of the whole world.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، عَنْ شُعْبَةَ، عَنْ يَعْلَى، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَتْلُ الْمُؤْمِنِ أَعْظَمُ عِنْدَ اللَّهِ مِنْ زَوَالِ الدُّنْيَا ‏.‏",
    "malay_translation": "Daripada Abdullah bin 'Amr, beliau berkata: \"Membunuh seorang mukmin adalah lebih besar dosanya di sisi Allah daripada kehancuran seluruh dunia.\""
  },
  {
    "id": 18735,
    "hadith_number": 3999,
    "tajuk_hadith": "Kejahatan membunuh seorang mukmin",
    "perawi_melayu": "Dari Abdullah bin Amr, Baginda berkata:",
    "english_text": "\"Killing a believer is more grievous before Allah than the extinction of the whole world.\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ هِشَامٍ، قَالَ حَدَّثَنَا مَخْلَدُ بْنُ يَزِيدَ، عَنْ سُفْيَانَ، عَنْ مَنْصُورٍ، عَنْ يَعْلَى بْنِ عَطَاءٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَتْلُ الْمُؤْمِنِ أَعْظَمُ عِنْدَ اللَّهِ مِنْ زَوَالِ الدُّنْيَا ‏.‏",
    "malay_translation": "Daripada Abdullah bin Amr, beliau berkata:  Membunuh seorang mukmin adalah lebih besar dosanya di sisi Allah daripada kehancuran seluruh dunia."
  },
  {
    "id": 18736,
    "hadith_number": 4000,
    "tajuk_hadith": "Kejahatan Membunuh Seorang Mukmin",
    "perawi_melayu": "Daripada Abdullah bin Buraidah daripada bapanya;",
    "english_text": "\"The Messenger of Allah  said: 'Killing a believer is more grievous before Allah than the extinction of the whole world.'\"",
    "arabic_text": "أَخْبَرَنَا الْحَسَنُ بْنُ إِسْحَاقَ الْمَرْوَزِيُّ، - ثِقَةٌ - حَدَّثَنِي خَالِدُ بْنُ خِدَاشٍ، قَالَ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ بَشِيرِ بْنِ الْمُهَاجِرِ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ قَتْلُ الْمُؤْمِنِ أَعْظَمُ عِنْدَ اللَّهِ مِنْ زَوَالِ الدُّنْيَا ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Membunuh seorang mukmin adalah lebih besar dosanya di sisi Allah daripada lenyapnya seluruh dunia.\""
  },
  {
    "id": 18737,
    "hadith_number": 4001,
    "tajuk_hadith": "Hisab Solat dan Darah",
    "perawi_melayu": "Daripada Abdullah, katanya:",
    "english_text": "\"The Messenger of Allah  said: 'The first thing concerning which a person will be brought to account will be the Salah, and the first thing concerning which scores will be settled among the people, will be bloodshed.\"",
    "arabic_text": "أَخْبَرَنَا سَرِيعُ بْنُ عَبْدِ اللَّهِ الْوَاسِطِيُّ الْخَصِيُّ، قَالَ حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ الأَزْرَقُ، عَنْ شَرِيكٍ، عَنْ عَاصِمٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَوَّلُ مَا يُحَاسَبُ بِهِ الْعَبْدُ الصَّلاَةُ وَأَوَّلُ مَا يُقْضَى بَيْنَ النَّاسِ فِي الدِّمَاءِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Perkara pertama yang akan dihisab daripada seorang hamba ialah solatnya, dan perkara pertama yang akan diputuskan di antara manusia ialah tentang pertumpahan darah.\""
  },
  {
    "id": 18738,
    "hadith_number": 4002,
    "tajuk_hadith": "Hukuman Pertama di Akhirat:  Penumpahan Darah",
    "perawi_melayu": "Daripada Abdullah, ia berkata:",
    "english_text": "\"The Messenger of Allah  said: 'The first matter concerning which judgment will be passed among the people will be bloodshed.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، عَنْ خَالِدٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، قَالَ سَمِعْتُ أَبَا وَائِلٍ، يُحَدِّثُ عَنْ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَوَّلُ مَا يُحْكَمُ بَيْنَ النَّاسِ فِي الدِّمَاءِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Perkara pertama yang akan diputuskan di antara manusia adalah mengenai penumpahan darah.\""
  },
  {
    "id": 18739,
    "hadith_number": 4003,
    "tajuk_hadith": "Pembalasan Pertama di Hari Kiamat: Penumpahan Darah",
    "perawi_melayu": "Daripada Abdullah, diriwayatkan bahawa:",
    "english_text": "The Messenger of Allah  said: \"The first matter concerning which scores will be settled among the people on the Day of Resurrection will be bloodshed.\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، عَنْ سُفْيَانَ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، قَالَ قَالَ عَبْدُ اللَّهِ أَوَّلُ مَا يُقْضَى بَيْنَ النَّاسِ يَوْمَ الْقِيَامَةِ فِي الدِّمَاءِ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Perkara pertama yang akan dihisab di antara manusia pada hari kiamat ialah mengenai penumpahan darah.\""
  },
  {
    "id": 18740,
    "hadith_number": 4004,
    "tajuk_hadith": "Hisab Pertama di Hari Kiamat: Pembunuhan",
    "perawi_melayu": "Daripada Abdullah, beliau berkata:",
    "english_text": "\"The first matter concerning which scores will be settled among the people on the Day of Resurrection will be bloodshed.\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصٍ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، ثُمَّ ذَكَرَ كَلِمَةً مَعْنَاهَا عَنْ عَمْرِو بْنِ شُرَحْبِيلَ، عَنْ عَبْدِ اللَّهِ، قَالَ أَوَّلُ مَا يُقْضَى بَيْنَ النَّاسِ يَوْمَ الْقِيَامَةِ فِي الدِّمَاءِ ‏.‏",
    "malay_translation": "Abdullah berkata:  Perkara pertama yang akan dihisab di antara manusia pada hari kiamat ialah tentang darah (pembunuhan)."
  },
  {
    "id": 18741,
    "hadith_number": 4005,
    "tajuk_hadith": "Hisab Pertama di Hari Kiamat: Penumpahan Darah",
    "perawi_melayu": "Daripada Amr bin Shurahbil, katanya:",
    "english_text": "\"The Messenger of Allah  said: 'The first matter concerning which scores will be settled among the people on the Day of Resurrection will be bloodshed.'\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ عَمْرِو بْنِ شُرَحْبِيلَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَوَّلُ مَا يُقْضَى فِيهِ بَيْنَ النَّاسِ يَوْمَ الْقِيَامَةِ فِي الدِّمَاءِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Perkara pertama yang akan dihisab di antara manusia pada hari kiamat ialah tentang penumpahan darah.\""
  },
  {
    "id": 18742,
    "hadith_number": 4006,
    "tajuk_hadith": "Hisab Pertama di Hari Akhirat",
    "perawi_melayu": "Dari Abdullah r.a.",
    "english_text": "\"The first matter concerning which scores will be settled among the people will be bloodshed.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، قَالَ حَدَّثَنَا الأَعْمَشُ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ أَوَّلُ مَا يُقْضَى بَيْنَ النَّاسِ فِي الدِّمَاءِ ‏.‏",
    "malay_translation": "Daripada Abdullah r.a., bahawa perkara pertama yang akan dihisab di antara manusia ialah mengenai darah (pembunuhan)."
  },
  {
    "id": 18743,
    "hadith_number": 4007,
    "tajuk_hadith": "Kemuliaan Milik Allah Semata-mata",
    "perawi_melayu": "Daripada Abdullah bin Mas'ud:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْمُسْتَمِرِّ، قَالَ حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ، قَالَ حَدَّثَنَا مُعْتَمِرٌ، عَنْ أَبِيهِ، عَنِ الأَعْمَشِ، عَنْ شَقِيقِ بْنِ سَلَمَةَ، عَنْ عَمْرِو بْنِ شُرَحْبِيلَ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَجِيءُ الرَّجُلُ آخِذًا بِيَدِ الرَّجُلِ فَيَقُولُ يَا رَبِّ هَذَا قَتَلَنِي ‏.‏ فَيَقُولُ اللَّهُ لَهُ لِمَ قَتَلْتَهُ فَيَقُولُ قَتَلْتُهُ لِتَكُونَ الْعِزَّةُ لَكَ ‏.‏ فَيَقُولُ فَإِنَّهَا لِي ‏.‏ وَيَجِيءُ الرَّجُلُ آخِذًا بِيَدِ الرَّجُلِ فَيَقُولُ إِنَّ هَذَا قَتَلَنِي ‏.‏ فَيَقُولُ اللَّهُ لَهُ لِمَ قَتَلْتَهُ فَيَقُولُ لِتَكُونَ الْعِزَّةُ لِفُلاَنٍ فَيَقُولُ إِنَّهَا لَيْسَتْ لِفُلاَنٍ فَيَبُوءُ بِإِثْمِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Seorang lelaki akan datang sambil memegang tangan lelaki lain, lalu berkata: 'Ya Tuhan, lelaki ini telah membunuhku.' Allah SWT akan bertanya kepadanya: 'Mengapa engkau membunuhnya?' Dia akan menjawab: 'Aku membunuhnya agar kemuliaan itu bagi-Mu.' Allah SWT akan berkata: 'Sesungguhnya kemuliaan itu adalah bagi-Ku.' Kemudian seorang lelaki lain akan datang sambil memegang tangan lelaki lain, lalu berkata: 'Lelaki ini telah membunuhku.' Allah SWT akan bertanya kepadanya: 'Mengapa engkau membunuhnya?' Dia akan menjawab: 'Agar kemuliaan itu bagi fulan.' Allah SWT akan berkata: 'Sesungguhnya kemuliaan itu bukanlah bagi fulan,' maka dia akan menanggung dosa tersebut.\""
  },
  {
    "id": 18744,
    "hadith_number": 4008,
    "tajuk_hadith": "Tanggungjawab Pembunuhan pada Hari Kiamat",
    "perawi_melayu": "Ia diriwayatkan bahawa Abu 'Imran Al-Jawni berkata:",
    "english_text": "\"Jundab said: 'So and so told me that the Messenger of Allah  said: The slain will bring his killer on the Day of Resurrection and will say: Ask him why he killed me. He will say: I killed him defending the kingdom of so and so.'\" Jundab said: \"So be careful.'\"",
    "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ تَمِيمٍ، قَالَ حَدَّثَنَا حَجَّاجٌ، قَالَ أَخْبَرَنِي شُعْبَةُ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، قَالَ قَالَ جُنْدَبٌ حَدَّثَنِي فُلاَنٌ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَجِيءُ الْمَقْتُولُ بِقَاتِلِهِ يَوْمَ الْقِيَامَةِ فَيَقُولُ سَلْ هَذَا فِيمَ قَتَلَنِي فَيَقُولُ قَتَلْتُهُ عَلَى مُلْكِ فُلاَنٍ ‏\"‏ ‏.‏ قَالَ جُنْدَبٌ فَاتَّقِهَا ‏.‏ 85",
    "malay_translation": "Junad berkata: “Si fulan memberitahu aku bahawa Rasulullah SAW bersabda: ‘Orang yang dibunuh akan membawa pembunuhnya pada Hari Kiamat, lalu berkata: ‘Tanya dia mengapa dia membunuhku.’ Pembunuh itu akan berkata: ‘Aku membunuhnya untuk mempertahankan kerajaan si fulan.’ ” Junad berkata: “Oleh itu, berhati-hatilah.”"
  },
  {
    "id": 18745,
    "hadith_number": 4009,
    "tajuk_hadith": "Taubat Pembunuh Orang Mukmin",
    "perawi_melayu": "Daripada Salim bin Abi Ja'd bahawa:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمَّارٍ الدُّهْنِيِّ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، أَنَّ ابْنَ عَبَّاسٍ، سُئِلَ عَمَّنْ قَتَلَ مُؤْمِنًا مُتَعَمِّدًا ثُمَّ تَابَ وَآمَنَ وَعَمِلَ صَالِحًا ثُمَّ اهْتَدَى فَقَالَ ابْنُ عَبَّاسٍ وَأَنَّى لَهُ التَّوْبَةُ سَمِعْتُ نَبِيَّكُمْ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ يَجِيءُ مُتَعَلِّقًا بِالْقَاتِلِ تَشْخُبُ أَوْدَاجُهُ دَمًا فَيَقُولُ أَىْ رَبِّ سَلْ هَذَا فِيمَ قَتَلَنِي ‏\"‏ ‏.‏ ثُمَّ قَالَ وَاللَّهِ لَقَدْ أَنْزَلَهَا اللَّهُ ثُمَّ مَا نَسَخَهَا ‏.‏",
    "malay_translation": "Kami diberitahu oleh Qotaibah, katanya; “Aku telah diberitahu oleh Sufyan daripada ‘Ammar Ad-Duhni, daripada Salim bin Abi al-Ja’d, bahawa Ibnu ‘Abbas ditanya mengenai seseorang yang membunuh seorang mukmin dengan sengaja, kemudian bertaubat, beriman, beramal soleh dan mendapat petunjuk. Maka Ibnu ‘Abbas berkata: “Bagaimanakah taubat itu akan bermanfaat kepadanya? Aku telah mendengar Nabi Muhammad SAW bersabda: “Mangsa akan datang bergantung pada pembunuhnya, urat lehernya mengalir darah, lalu berkata: ‘Ya Tuhanku, tanyakanlah kepada orang ini mengapa dia membunuhku.’” Kemudian beliau berkata: “Demi Allah, sesungguhnya Allah SWT telah menurunkan ayat ini dan tidak pernah ia dimansuhkan.”"
  },
  {
    "id": 18746,
    "hadith_number": 4010,
    "tajuk_hadith": "Pendapat Ibnu Abbas tentang Ayat Pembunuhan Mukmin",
    "perawi_melayu": "Daripada Said bin Jubair",
    "english_text": "\"The people of Al-Kufah differed concerning this Verse: \"And whoever kills a believer intentionally.\" So I went to Ibn 'Abbas and asked him, and he said: 'It was revealed among the last of what was revealed, and nothing of it was abrogated after that.'\"",
    "arabic_text": "قَالَ وَأَخْبَرَنِي أَزْهَرُ بْنُ جَمِيلٍ الْبَصْرِيُّ، قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الْمُغِيرَةِ بْنِ النُّعْمَانِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ اخْتَلَفَ أَهْلُ الْكُوفَةِ فِي هَذِهِ الآيَةِ ‏{‏ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا ‏}‏ فَرَحَلْتُ إِلَى ابْنِ عَبَّاسٍ فَسَأَلْتُهُ فَقَالَ لَقَدْ أُنْزِلَتْ فِي آخِرِ مَا أُنْزِلَ ثُمَّ مَا نَسَخَهَا شَىْءٌ ‏.‏",
    "malay_translation": "Dikatakan bahawa penduduk Kufah berbeza pendapat mengenai ayat ini: \"Dan sesiapa yang membunuh seorang mukmin dengan sengaja.\" Maka aku pergi kepada Ibnu Abbas dan bertanya kepadanya, lalu beliau berkata: \"Ayat ini diturunkan pada akhir wahyu dan tidak ada apa-apa yang telah mensahkannya selepas itu.\""
  },
  {
    "id": 18747,
    "hadith_number": 4011,
    "tajuk_hadith": "Taubat bagi Pembunuhan Sengaja Seorang Mukmin",
    "perawi_melayu": "Daripada Said bin Jubair berkata:",
    "english_text": "\"I said to Ibn 'Abbas: 'Can a person, who killed a believer intentionally, repent?' He said: 'No.' I recited the Verse from Al-Furqan to him: 'And those who invoke not any other ilah (god) along with Allah, or kill such person as Allah has forbidden, except by right,' he said: 'This Verse was revealed in Makkah and was abrogated by a Verse that was revealed in Al-Madinah: 'And whoever kills a believer intentionally, his recompense is Hell.'\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ، قَالَ حَدَّثَنِي الْقَاسِمُ بْنُ أَبِي بَزَّةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ قُلْتُ لاِبْنِ عَبَّاسٍ هَلْ لِمَنْ قَتَلَ مُؤْمِنًا مُتَعَمِّدًا مِنْ تَوْبَةٍ قَالَ لاَ ‏.‏ وَقَرَأْتُ عَلَيْهِ الآيَةَ الَّتِي فِي الْفُرْقَانِ ‏{‏ وَالَّذِينَ لاَ يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ وَلاَ يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ ‏}‏ قَالَ هَذِهِ آيَةٌ مَكِّيَّةٌ نَسَخَتْهَا آيَةٌ مَدَنِيَّةٌ ‏{‏ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ ‏}‏ ‏.‏",
    "malay_translation": "Aku berkata kepada Ibnu Abbas: \"Bolehkah seseorang yang membunuh seorang mukmin dengan sengaja bertaubat?\"  Beliau menjawab: \"Tidak.\" Aku membacakan ayat dari Surah Al-Furqan kepadanya: \"Dan orang-orang yang tidak menyembah tuhan selain Allah, dan tidak membunuh jiwa yang diharamkan Allah kecuali dengan hak,\"  beliau berkata: \"Ayat ini diturunkan di Mekah dan telah dimansuhkan oleh ayat yang diturunkan di Madinah: \"Dan sesiapa yang membunuh seorang mukmin dengan sengaja, maka balasannya ialah neraka Jahanam.\""
  },
  {
    "id": 18748,
    "hadith_number": 4012,
    "tajuk_hadith": "Hukum membunuh seorang mukmin dan ayat mengenai syirik",
    "perawi_melayu": "Daripada Said bin Jubair, beliau berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ أَمَرَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي لَيْلَى أَنْ أَسْأَلَ ابْنَ عَبَّاسٍ، عَنْ هَاتَيْنِ الآيَتَيْنِ، ‏{‏ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ ‏}‏ فَسَأَلْتُهُ فَقَالَ لَمْ يَنْسَخْهَا شَىْءٌ ‏.‏ وَعَنْ هَذِهِ الآيَةِ ‏{‏ وَالَّذِينَ لاَ يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ وَلاَ يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ ‏}‏ قَالَ نَزَلَتْ فِي أَهْلِ الشِّرْكِ ‏.‏",
    "malay_translation": "Muhammad bin al-Muthanna telah memberitahu kami, katanya: Muhammad telah memberitahu kami, katanya: Syu'bah telah memberitahu kami, daripada Mansur, daripada Sa'id bin Jubair, katanya: Abdur-Rahman bin Abi Laila menyuruhku bertanya kepada Ibnu Abbas tentang dua ayat ini: {Dan sesiapa yang membunuh seorang mukmin dengan sengaja, maka balasannya ialah neraka Jahannam}. Maka aku bertanya kepadanya, lalu dia berkata: Tiada apa yang menghapuskannya. Dan tentang ayat ini: {Dan orang-orang yang tidak menyembah tuhan selain Allah, dan tidak membunuh jiwa yang diharamkan Allah kecuali dengan hak}. Dia berkata: Ayat ini turun mengenai orang-orang musyrik."
  },
  {
    "id": 18749,
    "hadith_number": 4013,
    "tajuk_hadith": "Pengampunan Dosa-dosa Besar",
    "perawi_melayu": "Daripada Ibnu Abbas",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا حَاجِبُ بْنُ سُلَيْمَانَ الْمَنْبِجِيُّ، قَالَ حَدَّثَنَا ابْنُ أَبِي رَوَّادٍ، قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ عَبْدِ الأَعْلَى الثَّعْلَبِيِّ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ قَوْمًا، كَانُوا قَتَلُوا فَأَكْثَرُوا وَزَنَوْا فَأَكْثَرُوا وَانْتَهَكُوا فَأَتَوُا النَّبِيَّ صلى الله عليه وسلم قَالُوا يَا مُحَمَّدُ إِنَّ الَّذِي تَقُولُ وَتَدْعُو إِلَيْهِ لَحَسَنٌ لَوْ تُخْبِرُنَا أَنَّ لِمَا عَمِلْنَا كَفَّارَةً ‏.‏ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ وَالَّذِينَ لاَ يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ ‏}‏ إِلَى ‏{‏ فَأُولَئِكَ يُبَدِّلُ اللَّهُ سَيِّئَاتِهِمْ حَسَنَاتٍ ‏}‏ قَالَ يُبَدِّلُ اللَّهُ شِرْكَهُمْ إِيمَانًا وَزِنَاهُمْ إِحْصَانًا وَنَزَلَتْ ‏{‏ قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَى أَنْفُسِهِمْ ‏}‏ الآيَةَ ‏.‏",
    "malay_translation": "Daripada Ibnu Abbas bahawa ada segolongan manusia yang telah membunuh dan banyak melakukan pembunuhan, dan berzina serta banyak melakukannya, dan melakukan pelanggaran. Mereka datang kepada Nabi SAW dan berkata: \"Wahai Muhammad, apa yang engkau sampaikan dan serukan kepada manusia amat baik. Sekiranya engkau memberitahu kami adakah sebarang kafarah (penebus dosa) bagi apa yang telah kami lakukan.\" Maka Allah SWT menurunkan ayat: {…dan orang-orang yang tidak menyembah tuhan lain bersama Allah…} sehingga ayat {…maka orang-orang itulah yang akan Allah gantikan kejahatan-kejahatan mereka dengan kebaikan-kebaikan…}. Baginda berkata: Allah akan menggantikan syirik mereka dengan iman, dan zina mereka dengan kehormatan.  Dan turunlah ayat: {Katakanlah: Wahai hamba-hamba-Ku yang melampaui batas terhadap diri mereka sendiri…}."
  },
  {
    "id": 18750,
    "hadith_number": 4014,
    "tajuk_hadith": "Pengampunan Bagi Mereka Yang Terlibat Syirik",
    "perawi_melayu": "Daripada Ibnu Abbas r.a.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ، قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي يَعْلَى، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ نَاسًا، مِنْ أَهْلِ الشِّرْكِ أَتَوْا مُحَمَّدًا فَقَالُوا إِنَّ الَّذِي تَقُولُ وَتَدْعُو إِلَيْهِ لَحَسَنٌ لَوْ تُخْبِرُنَا أَنَّ لِمَا عَمِلْنَا كَفَّارَةً ‏.‏ فَنَزَلَتْ ‏{‏ وَالَّذِينَ لاَ يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ ‏}‏ وَنَزَلَتْ ‏{‏ قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَى أَنْفُسِهِمْ ‏}‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Al-Hasan bin Muhammad Az-Za'farani, katanya; telah menceritakan kepada kami Hajjaj bin Muhammad, katanya; Ibnu Juraij telah memberitakan kepadaku, iaitu Ya'la, daripada Sa'id bin Jubair, daripada Ibnu Abbas r.a., bahawa sesetengah daripada orang-orang musyrik telah datang kepada Nabi Muhammad SAW, lalu mereka berkata: \"Sesungguhnya apa yang engkau sampaikan dan seruan yang engkau ajak kepadanya itu adalah baik. Jika engkau dapat memberitahu kami adakah sebarang kaffarah (tebusan dosa) bagi apa yang telah kami lakukan.\" Maka turunlah ayat: \"Dan orang-orang yang tidak menyembah tuhan lain bersama Allah...\" dan turunlah juga ayat: \"Katakanlah: Wahai hamba-hambaKu yang telah melampaui batas terhadap diri mereka sendiri...\"."
  },
  {
    "id": 18751,
    "hadith_number": 4015,
    "tajuk_hadith": "Balas Dendam Orang yang Terbunuh pada Hari Kiamat",
    "perawi_melayu": "Daripada Ibnu Abbas",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ، قَالَ حَدَّثَنِي وَرْقَاءُ، عَنْ عَمْرٍو، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ يَجِيءُ الْمَقْتُولُ بِالْقَاتِلِ يَوْمَ الْقِيَامَةِ نَاصِيَتُهُ وَرَأْسُهُ فِي يَدِهِ وَأَوْدَاجُهُ تَشْخُبُ دَمًا يَقُولُ يَا رَبِّ قَتَلَنِي حَتَّى يُدْنِيَهُ مِنَ الْعَرْشِ ‏\"‏ ‏.‏ قَالَ فَذَكَرُوا لاِبْنِ عَبَّاسٍ التَّوْبَةَ فَتَلاَ هَذِهِ الآيَةَ ‏{‏ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا ‏}‏ قَالَ مَا نُسِخَتْ مُنْذُ نَزَلَتْ وَأَنَّى لَهُ التَّوْبَةُ",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Rafi', dia berkata; telah menceritakan kepada kami Syabaabah bin Sawwar, dia berkata; telah menceritakan kepadaku Warqo', daripada Amru, daripada Ibnu Abbas, daripada Nabi SAW, Baginda bersabda: \"Orang yang dibunuh akan datang membawa pembunuhnya pada hari kiamat, dengan memegang rambut kepala dan kepalanya di tangannya, dan urat lehernya mengalir dengan darah, sambil berkata: 'Ya Tuhanku, dia telah membunuhku,' sehingga dia didekatkan ke Arasy.\" Kemudian, mereka menyebut tentang taubat kepada Ibnu Abbas, lalu dia membaca ayat ini: {Dan sesiapa yang membunuh seorang Mukmin dengan sengaja,}  lalu dia berkata: \"Ayat ini tidak dimansuhkan sejak diturunkan, dan bagaimana mungkin baginya bertaubat?\"."
  },
  {
    "id": 18752,
    "hadith_number": 4016,
    "tajuk_hadith": "Wahyu Ayat Bunuh Orang Mukmin",
    "perawi_melayu": "Daripada Zaid bin Thabit, beliau berkata:",
    "english_text": "\"This Verse - 'And whoever kills a believer intentionally, his recompense is Hell' - was revealed six months after the Verse which was revealed in Surat Al-Furqan.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا الأَنْصَارِيُّ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو، عَنْ أَبِي الزِّنَادِ، عَنْ خَارِجَةَ بْنِ زَيْدٍ، عَنْ زَيْدِ بْنِ ثَابِتٍ، قَالَ نَزَلَتْ هَذِهِ الآيَةُ ‏{‏ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ خَالِدًا فِيهَا ‏}‏ الآيَةُ كُلُّهَا بَعْدَ الآيَةِ الَّتِي نَزَلَتْ فِي الْفُرْقَانِ بِسِتَّةِ أَشْهُرٍ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ مُحَمَّدُ بْنُ عَمْرٍو لَمْ يَسْمَعْهُ مِنْ أَبِي الزِّنَادِ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Al-Mutsanna, katanya; telah menceritakan kepada kami Al-Anshari, katanya; telah menceritakan kepada kami Muhammad bin Amr, daripada Abu Az-Zinad, daripada Kharajah bin Zaid, daripada Zaid bin Tsabit, katanya: Ayat ini, \"Barangsiapa membunuh seorang mukmin dengan sengaja, maka balasannya ialah neraka Jahannam, kekal di dalamnya,\" diturunkan enam bulan selepas ayat yang diturunkan di dalam Surah Al-Furqan.  Abu Abdur Rahman Muhammad bin Amr berkata: Aku tidak mendengarnya daripada Abu Az-Zinad."
  },
  {
    "id": 18753,
    "hadith_number": 4017,
    "tajuk_hadith": "Azab Neraka Bagi Pembunuh Mukmin",
    "perawi_melayu": "Daripada Zaid berkenaan firman Allah:",
    "english_text": "\"And whoever kills a believer intentionally, his recompense is Hell\" that he said: \"This Verse was revealed eight months after the Verse that is in Tabark Al-Furqan: \"And those who invoke not any other ilah (god) along with Allah, or kill such person as Allah has forbidden, except by right.\"",
    "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ بَشَّارٍ، عَنْ عَبْدِ الْوَهَّابِ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ أَبِي الزِّنَادِ، عَنْ خَارِجَةَ بْنِ زَيْدٍ، عَنْ زَيْدٍ، فِي قَوْلِهِ ‏{‏ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ ‏}‏ قَالَ نَزَلَتْ هَذِهِ الآيَةُ بَعْدَ الَّتِي فِي ‏{‏ تَبَارَكَ ‏}‏ الْفُرْقَانِ بِثَمَانِيَةِ أَشْهُرٍ ‏{‏ وَالَّذِينَ لاَ يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ وَلاَ يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ ‏}‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ أَدْخَلَ أَبُو الزِّنَادِ بَيْنَهُ وَبَيْنَ خَارِجَةَ مُجَالِدَ بْنَ عَوْفٍ ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Muhammad bin Bashar, daripada Abd al-Wahhab, katanya; telah menceritakan kepada kami Muhammad bin Amr, daripada Musa bin 'Uqbah, daripada Abi az-Zinad, daripada Kharajah bin Zaid, daripada Zaid, berkenaan firman Allah SWT: {Dan sesiapa yang membunuh seorang mukmin dengan sengaja, maka balasannya ialah neraka Jahannam}.  Zaid berkata: Ayat ini diturunkan lapan bulan selepas ayat yang terdapat dalam Surah al-Furqan: {Dan orang-orang yang tidak menyembah tuhan lain beserta Allah, dan tidak membunuh jiwa yang diharamkan Allah kecuali dengan hak}. Abu Abdur Rahman berkata: Abu az-Zinad memasukkan di antara dirinya dan Kharajah, Mujalid bin 'Auf."
  },
  {
    "id": 18754,
    "hadith_number": 4018,
    "tajuk_hadith": "Ayat mengenai pembunuhan orang mukmin",
    "perawi_melayu": "Daripada Mujalid bin 'Awf, katanya:",
    "english_text": "\"I heard Kharijah bin Zaid bin Thabit narrate that his father said: (The Verse) 'And whoever kills a believer intentionally, his recompense is Hell' was revealed and we became worried about it. Then the Verse in Al-Furqan 'And those who invoke not any other ilah (god) along with Allah, or kill such person as Allah has forbidden, except by right.' was revealed.\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، عَنْ مُسْلِمِ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَاقَ، عَنْ أَبِي الزِّنَادِ، عَنْ مُجَالِدِ بْنِ عَوْفٍ، قَالَ سَمِعْتُ خَارِجَةَ بْنَ زَيْدِ بْنِ ثَابِتٍ، يُحَدِّثُ عَنْ أَبِيهِ، أَنَّهُ قَالَ نَزَلَتْ ‏{‏ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ خَالِدًا فِيهَا ‏}‏ أَشْفَقْنَا مِنْهَا فَنَزَلَتِ الآيَةُ الَّتِي فِي الْفُرْقَانِ ‏{‏ وَالَّذِينَ لاَ يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ وَلاَ يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ ‏}‏ ‏.‏",
    "malay_translation": "Aku mendengar Kharijah bin Zaid bin Thabit meriwayatkan bahawa bapanya berkata: Ayat (yang bermaksud), \"Dan sesiapa yang membunuh seorang mukmin dengan sengaja, maka balasannya ialah neraka Jahannam; ia kekal di dalamnya,\" telah turun dan kami merasa bimbang mengenainya. Kemudian turunlah ayat yang terdapat dalam Surah Al-Furqan (yang bermaksud), \"Dan orang-orang yang tidak menyembah tuhan lain bersama-sama Allah, dan tidak membunuh jiwa yang diharamkan Allah kecuali dengan hak.\" "
  },
  {
    "id": 18755,
    "hadith_number": 4019,
    "tajuk_hadith": "Syurga Bagi Mereka Yang Mengabdi Kepada Allah",
    "perawi_melayu": "Abu Ayyub Al-Ansari meriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا بَقِيَّةُ، قَالَ حَدَّثَنِي بَحِيرُ بْنُ سَعْدٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، أَنَّ أَبَا رُهْمٍ السَّمَعِيَّ، حَدَّثَهُمْ أَنَّ أَبَا أَيُّوبَ الأَنْصَارِيَّ حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ جَاءَ يَعْبُدُ اللَّهَ وَلاَ يُشْرِكُ بِهِ شَيْئًا وَيُقِيمُ الصَّلاَةَ وَيُؤْتِي الزَّكَاةَ وَيَجْتَنِبُ الْكَبَائِرَ كَانَ لَهُ الْجَنَّةُ ‏\"‏ ‏.‏ فَسَأَلُوهُ عَنِ الْكَبَائِرِ فَقَالَ ‏\"‏ الإِشْرَاكُ بِاللَّهِ وَقَتْلُ النَّفْسِ الْمُسْلِمَةِ وَالْفِرَارُ يَوْمَ الزَّحْفِ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Ayyub Al-Ansari meriwayatkan bahawa Rasulullah SAW bersabda: \"Barangsiapa yang datang (menghadap Allah) dengan beribadah kepada Allah dan tidak menyekutukan-Nya dengan sesuatu pun, mendirikan solat, menunaikan zakat, dan menjauhi dosa-dosa besar, maka syurga adalah baginya.\" Mereka bertanya tentang dosa-dosa besar, maka baginda bersabda: \"Syirik kepada Allah, membunuh jiwa seorang Muslim, dan melarikan diri pada hari peperangan.\""
  },
  {
    "id": 18756,
    "hadith_number": 4020,
    "tajuk_hadith": "Dosa-dosa Besar Menurut Rasulullah SAW",
    "perawi_melayu": "Daripada Ubaidullah bin Abi Bakr:",
    "english_text": "\"I heard Anas say: 'The Messenger of Allah  said: The major sins are: Associating others with Allah (Shirk), disobeying one's parents, killing a soul (murder) and speaking falsely.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم ح وَأَنْبَأَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا النَّضْرُ بْنُ شُمَيْلٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْكَبَائِرُ الشِّرْكُ بِاللَّهِ وَعُقُوقُ الْوَالِدَيْنِ وَقَتْلُ النَّفْسِ وَقَوْلُ الزُّورِ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Anas berkata: 'Rasulullah SAW bersabda: Dosa-dosa besar ialah: Syirik kepada Allah, derhaka kepada ibu bapa, membunuh jiwa, dan berkata dusta.'"
  },
  {
    "id": 18757,
    "hadith_number": 4021,
    "tajuk_hadith": "Dosa-dosa Besar",
    "perawi_melayu": "Daripada Abdullah bin 'Amr, bahawa:",
    "english_text": "The Prophet  said: \"The major sins are: Associating others with Allah, disobeying parents, killing a soul (murder) and swearing a false oath knowingly.\"",
    "arabic_text": "أَخْبَرَنِي عَبْدَةُ بْنُ عَبْدِ الرَّحِيمِ، قَالَ أَنْبَأَنَا ابْنُ شُمَيْلٍ، قَالَ أَنْبَأَنَا شُعْبَةُ، قَالَ حَدَّثَنَا فِرَاسٌ، قَالَ سَمِعْتُ الشَّعْبِيَّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْكَبَائِرُ الإِشْرَاكُ بِاللَّهِ وَعُقُوقُ الْوَالِدَيْنِ وَقَتْلُ النَّفْسِ وَالْيَمِينُ الْغَمُوسُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Dosa-dosa besar ialah: Syirik kepada Allah, derhaka kepada ibu bapa, membunuh jiwa (membunuh manusia), dan bersumpah palsu dengan sengaja.\""
  },
  {
    "id": 18758,
    "hadith_number": 4022,
    "tajuk_hadith": "Tujuh Dosa Besar",
    "perawi_melayu": "Daripada Ubaid bin Umair bahawa:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ، قَالَ حَدَّثَنَا مُعَاذُ بْنُ هَانِئٍ، قَالَ حَدَّثَنَا حَرْبُ بْنُ شَدَّادٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ عَبْدِ الْحَمِيدِ بْنِ سِنَانٍ، عَنْ حَدِيثِ، عُبَيْدِ بْنِ عُمَيْرٍ أَنَّهُ حَدَّثَهُ أَبُوهُ، وَكَانَ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم - أَنَّ رَجُلاً قَالَ يَا رَسُولَ اللَّهِ مَا الْكَبَائِرُ قَالَ ‏\n\"‏ هُنَّ سَبْعٌ أَعْظَمُهُنَّ إِشْرَاكٌ بِاللَّهِ وَقَتْلُ النَّفْسِ بِغَيْرِ حَقٍّ وَفِرَارٌ يَوْمَ الزَّحْفِ ‏\"‏ ‏.‏ مُخْتَصَرٌ ‏.‏",
    "malay_translation": "Abbas bin Abd al-Azim telah memberitahu kami, katanya: Mu'adz bin Hanii' telah memberitahu kami, katanya: Harb bin Syaddad telah memberitahu kami, katanya: Yahya bin Abi Katsir telah memberitahu kami daripada Abd al-Hamid bin Sinan, daripada riwayat Ubaid bin Umair bahawa bapanya – dan bapanya adalah daripada kalangan sahabat Nabi SAW – telah menceritakan kepadanya bahawa seorang lelaki telah bertanya: \"Wahai Rasulullah, apakah dosa-dosa besar itu?\" Baginda menjawab: \"Ia tujuh; yang paling besar ialah syirik kepada Allah, membunuh jiwa secara tidak berhak dan melarikan diri pada hari pertempuran.\" (Hadis ini telah di ringkaskan)."
  },
  {
    "id": 18759,
    "hadith_number": 4023,
    "tajuk_hadith": "Dosa-dosa yang paling besar",
    "perawi_melayu": "Daripada Abdullah r.a.",
    "english_text": "\"I said: 'O Messenger of Allah, which sin is the most grievous?' He said: 'Setting up a rival to Allah while it is He that has created you.' I said: 'Then what?' He said: 'Killing your child for fear that he may eat with you.' I said: 'Then what?' He said: 'Committing adultery with your neighbor's wife.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ وَاصِلٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَمْرِو بْنِ شُرَحْبِيلَ، عَنْ عَبْدِ اللَّهِ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَىُّ الذَّنْبِ أَعْظَمُ قَالَ ‏\"‏ أَنْ تَجْعَلَ لِلَّهِ نِدًّا وَهُوَ خَلَقَكَ ‏\"‏ ‏.‏ قُلْتُ ثُمَّ مَاذَا قَالَ ‏\"‏ أَنْ تَقْتُلَ وَلَدَكَ خَشْيَةَ أَنْ يَطْعَمَ مَعَكَ ‏\"‏ ‏.‏ قُلْتُ ثُمَّ مَاذَا قَالَ ‏\"‏ أَنْ تُزَانِيَ بِحَلِيلَةِ جَارِكَ ‏\"‏ ‏.‏",
    "malay_translation": "Aku berkata, \"Wahai Rasulullah, dosa apakah yang paling besar?\" Baginda menjawab, \"Menetapkan sekutu bagi Allah, sedangkan Dialah yang telah menciptakanmu.\" Aku berkata, \"Kemudian apakah?\" Baginda menjawab, \"Membunuh anakmu kerana takut dia akan makan bersamamu.\" Aku berkata, \"Kemudian apakah?\" Baginda menjawab, \"Berzina dengan isteri jiranmu.\""
  },
  {
    "id": 18760,
    "hadith_number": 4024,
    "tajuk_hadith": "Dosa-dosa yang Paling Besar",
    "perawi_melayu": "Daripada Abdullah, katanya:",
    "english_text": "\"I said: 'O Messenger of Allah, which sin is most grievous?' He said: 'Setting up a rival to Allah while it is He that created you.' I said: 'Then what?' He said: 'Killing your child so that he will not eat with you.' I said: 'Then what?' He said: 'Committing adultery with your neighbor's wife.'\"",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي وَاصِلٌ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَىُّ الذَّنْبِ أَعْظَمُ قَالَ ‏\"‏ أَنْ تَجْعَلَ لِلَّهِ نِدًّا وَهُوَ خَلَقَكَ ‏\"‏ ‏.‏ قُلْتُ ثُمَّ أَىٌّ قَالَ ‏\"‏ أَنْ تَقْتُلَ وَلَدَكَ مِنْ أَجْلِ أَنْ يَطْعَمَ مَعَكَ ‏\"‏ ‏.‏ قُلْتُ ثُمَّ أَىٌّ قَالَ ‏\"‏ ثُمَّ أَنْ تُزَانِيَ بِحَلِيلَةِ جَارِكَ ‏\"‏ ‏.‏",
    "malay_translation": "Aku berkata, \"Wahai Rasulullah, dosa apakah yang paling besar?\" Baginda menjawab, \"Menetapkan sekutu bagi Allah, sedangkan Dialah yang menciptakanmu.\" Aku bertanya lagi, \"Kemudian apakah?\" Baginda menjawab, \"Membunuh anakmu supaya dia tidak makan bersamamu.\" Aku bertanya lagi, \"Kemudian apakah?\" Baginda menjawab, \"Berzina dengan isteri jiranmu.\""
  },
  {
    "id": 18761,
    "hadith_number": 4025,
    "tajuk_hadith": "Dosa-dosa yang Paling Besar",
    "perawi_melayu": "Daripada Abdullah yang meriwayatkan bahawa:",
    "english_text": "\"I asked the Messenger of Allah , which sin is most grievous?\" He said: \"Shirk, setting up a rival to Allah, committing adultery with your neighbor's wife, and killing your child for fear of poverty, and that he may eat with you.\" Then 'Abdullah recited the Verse: \"And those who invoke not any other Ilah (god) along with Allah.\"",
    "arabic_text": "أَخْبَرَنَا عَبْدَةُ، قَالَ أَنْبَأَنَا يَزِيدُ، قَالَ أَنْبَأَنَا شُعْبَةُ، عَنْ عَاصِمٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَىُّ الذَّنْبِ أَعْظَمُ قَالَ ‏\"‏ الشِّرْكُ أَنْ تَجْعَلَ لِلَّهِ نِدًّا وَأَنْ تُزَانِيَ بِحَلِيلَةِ جَارِكَ وَأَنْ تَقْتُلَ وَلَدَكَ مَخَافَةَ الْفَقْرِ أَنْ يَأْكُلَ مَعَكَ ‏\"‏ ‏.‏ ثُمَّ قَرَأَ عَبْدُ اللَّهِ ‏{‏ وَالَّذِينَ لاَ يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ ‏}‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا خَطَأٌ وَالصَّوَابُ الَّذِي قَبْلَهُ وَحَدِيثُ يَزِيدَ هَذَا خَطَأٌ إِنَّمَا هُوَ وَاصِلٌ وَاللَّهُ تَعَالَى أَعْلَمُ ‏.‏",
    "malay_translation": "Aku bertanya kepada Rasulullah SAW, \"Apakah dosa yang paling besar?\" Baginda menjawab, \"Syirik (menyekutukan Allah), berzina dengan isteri jiran, dan membunuh anak sendiri kerana takut miskin, supaya dia tidak perlu makan bersamamu.\" Kemudian Abdullah membaca ayat: \"Dan orang-orang yang tidak menyembah tuhan selain Allah.\" "
  },
  {
    "id": 18762,
    "hadith_number": 4026,
    "tajuk_hadith": "Keharaman Menumpahkan Darah Muslim",
    "perawi_melayu": "Daripada Abdullah, katanya:",
    "english_text": "\"The Messenger of Allah  said: 'By the One besides Whom there is no other god, it is not permissible to shed the blood of a Muslim who bears witness to La ilaha illalla (there is none worthy of worship except Allah) and that I am the Messenger of Allah, except in three cases: One who leaves Islam and splits away from the Jama'ah, a person who has been married and then commits adultery, and a life for a life.'\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنِ الأَعْمَشِ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ وَالَّذِي لاَ إِلَهَ غَيْرُهُ لاَ يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ يَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنِّي رَسُولُ اللَّهِ إِلاَّ ثَلاَثَةُ نَفَرٍ التَّارِكُ لِلإِسْلاَمِ مُفَارِقُ الْجَمَاعَةِ وَالثَّيِّبُ الزَّانِي وَالنَّفْسُ بِالنَّفْسِ ‏\"‏ ‏.‏ قَالَ الأَعْمَشُ فَحَدَّثْتُ بِهِ إِبْرَاهِيمَ فَحَدَّثَنِي عَنِ الأَسْوَدِ عَنْ عَائِشَةَ بِمِثْلِهِ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Demi Allah SWT yang tiada Tuhan melainkan Dia, tidak halal menumpahkan darah seorang Muslim yang mengaku bahawa tiada Tuhan melainkan Allah dan bahawa aku adalah utusan Allah, kecuali dalam tiga keadaan: Orang yang meninggalkan Islam dan keluar daripada Jamaah, orang yang telah berkahwin kemudian berzina, dan qisas (balasan nyawa dengan nyawa).\""
  },
  {
    "id": 18763,
    "hadith_number": 4027,
    "tajuk_hadith": "Keharaman Menumpahkan Darah Muslim",
    "perawi_melayu": "Daripada Amr bin Ghalib, katanya:",
    "english_text": "\"Aishah said: 'Do you not know that the Messenger of Allah  said: It is not permissible to shed the blood of a Muslim, except a man who committed adultery after being married, or one who reverted to Kufr after becoming Muslim, or a life for a life.'\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ عَمْرِو بْنِ غَالِبٍ، قَالَ قَالَتْ عَائِشَةُ أَمَا عَلِمْتَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلاَّ رَجُلٌ زَنَى بَعْدَ إِحْصَانِهِ أَوْ كَفَرَ بَعْدَ إِسْلاَمِهِ أَوِ النَّفْسُ بِالنَّفْسِ ‏\"‏ ‏.‏ وَقَّفَهُ زُهَيْرٌ ‏.‏",
    "malay_translation": "Aisyah berkata: \"Tidakkah kamu tahu bahawa Rasulullah SAW telah bersabda:  \"Tidak halal menumpahkan darah seorang Muslim melainkan orang yang berzina selepas berkahwin, atau orang yang murtad selepas memeluk Islam, atau qisas (balasan nyawa dengan nyawa).\""
  },
  {
    "id": 18764,
    "hadith_number": 4028,
    "tajuk_hadith": "Keharaman Menumpahkan Darah Muslim",
    "perawi_melayu": "Daripada Amr bin Ghalib, diriwayatkan bahawa:",
    "english_text": "\"Aishah said: 'O 'Ammar! Do you not know that it is not permissible to shed the blood of a Muslim except in three cases: a life for a life, a man who commits adultery after being married.'\"",
    "arabic_text": "أَخْبَرَنَا هِلاَلُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا حُسَيْنٌ، قَالَ حَدَّثَنَا زُهَيْرٌ، قَالَ حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ عَمْرِو بْنِ غَالِبٍ، قَالَ قَالَتْ عَائِشَةُ يَا عَمَّارُ أَمَا إِنَّكَ تَعْلَمُ أَنَّهُ لاَ يَحِلُّ دَمُ امْرِئٍ إِلاَّ ثَلاَثَةٌ النَّفْسُ بِالنَّفْسِ أَوْ رَجُلٌ زَنَى بَعْدَ مَا أُحْصِنَ وَسَاقَ الْحَدِيثَ ‏.‏",
    "malay_translation": "Aisyah berkata: \"Wahai Ammar! Tidakkah engkau tahu bahawa tidak halal menumpahkan darah seorang Muslim melainkan dalam tiga keadaan sahaja: nyawa dibalas dengan nyawa, atau lelaki yang berzina setelah berkahwin.\" "
  },
  {
    "id": 18765,
    "hadith_number": 4029,
    "tajuk_hadith": "Larangan membunuh Muslim kecuali dalam tiga keadaan",
    "perawi_melayu": "Abu Umamah bin Sahl dan Abdullah bin Amir bin Rabi'ah berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنِي أَبُو أُمَامَةَ بْنُ سَهْلٍ، وَعَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ رَبِيعَةَ، قَالاَ كُنَّا مَعَ عُثْمَانَ وَهُوَ مَحْصُورٌ - وَكُنَّا إِذَا دَخَلْنَا مَدْخَلاً نَسْمَعُ كَلاَمَ مَنْ بِالْبَلاَطِ - فَدَخَلَ عُثْمَانُ يَوْمًا ثُمَّ خَرَجَ فَقَالَ إِنَّهُمْ لَيَتَوَاعَدُونِي بِالْقَتْلِ ‏.‏ قُلْنَا يَكْفِيكَهُمُ اللَّهُ ‏.‏ قَالَ فَلِمَ يَقْتُلُونِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلاَّ بِإِحْدَى ثَلاَثٍ رَجُلٌ كَفَرَ بَعْدَ إِسْلاَمِهِ أَوْ زَنَى بَعْدَ إِحْصَانِهِ أَوْ قَتَلَ نَفْسًا بِغَيْرِ نَفْسٍ ‏\"‏ ‏.‏ فَوَاللَّهِ مَا زَنَيْتُ فِي جَاهِلِيَّةٍ وَلاَ إِسْلاَمٍ وَلاَ تَمَنَّيْتُ أَنَّ لِي بِدِينِي بَدَلاً مُنْذُ هَدَانِي اللَّهُ وَلاَ قَتَلْتُ نَفْسًا فَلِمَ يَقْتُلُونَنِي",
    "malay_translation": "Ibrahim bin Ya'qub meriwayatkan daripada Muhammad bin Isa, yang meriwayatkan daripada Hammad bin Zaid, yang meriwayatkan daripada Yahya bin Sa'id, yang meriwayatkan daripada Abu Umamah bin Sahl dan Abdullah bin Amir bin Rabi'ah. Mereka berdua berkata:  Kami bersama Usman ketika beliau dikurung.  Apabila kami masuk ke suatu tempat, kami dapat mendengar perbualan orang yang berada di Al-Balat. Suatu hari, Usman masuk kemudian keluar lalu berkata, “Mereka mengancam untuk membunuhku.” Kami berkata, “Allah akan cukup bagi kamu menghadapi mereka.” Beliau berkata, “Mengapa mereka mahu membunuhku? Aku mendengar Rasulullah SAW bersabda: “Tidak halal darah seorang Muslim melainkan dalam tiga keadaan: Seorang lelaki yang murtad selepas memeluk Islam, atau berzina selepas berkahwin, atau membunuh seseorang tanpa hak.” Demi Allah, aku tidak pernah berzina sama ada pada zaman jahiliyyah atau Islam, dan aku tidak pernah menginginkan agama lain sejak Allah membimbingku, dan aku tidak pernah membunuh sesiapa. Jadi, mengapa mereka mahu membunuhku?”"
  },
  {
    "id": 18766,
    "hadith_number": 4030,
    "tajuk_hadith": "Membunuh Mereka yang Meninggalkan Jamaah",
    "perawi_melayu": "Daripada riwayat 'Arfajah bin Shuraih Al-Ashja'I yang berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنِي أَحْمَدُ بْنُ يَحْيَى الصُّوفِيُّ، قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ مَرْدَانْبَهْ، عَنْ زِيَادِ بْنِ عِلاَقَةَ، عَنْ عَرْفَجَةَ بْنِ شُرَيْحٍ الأَشْجَعِيِّ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم عَلَى الْمِنْبَرِ يَخْطُبُ النَّاسَ فَقَالَ ‏\n\"‏ إِنَّهُ سَيَكُونُ بَعْدِي هَنَاتٌ وَهَنَاتٌ فَمَنْ رَأَيْتُمُوهُ فَارَقَ الْجَمَاعَةَ أَوْ يُرِيدُ تَفْرِيقَ أَمْرِ أُمَّةِ مُحَمَّدٍ صلى الله عليه وسلم كَائِنًا مَنْ كَانَ فَاقْتُلُوهُ فَإِنَّ يَدَ اللَّهِ عَلَى الْجَمَاعَةِ فَإِنَّ الشَّيْطَانَ مَعَ مَنْ فَارَقَ الْجَمَاعَةَ يَرْكُضُ ‏\"‏ ‏.‏",
    "malay_translation": "Aku diberitahu oleh Ahmad bin Yahya As-Sufi, katanya telah menceritakan kepada kami Abu Nu'aim, katanya telah menceritakan kepada kami Yazid bin Mardabah, daripada Ziyad bin 'Ilaqah, daripada 'Arfajah bin Syuraih Al-Asy'ari, katanya: Aku melihat Nabi SAW di atas mimbar menyampaikan khutbah kepada manusia, lalu baginda bersabda: \"Sesungguhnya selepas aku akan berlaku banyak perpecahan dan perselisihan.  Maka sesiapa yang kamu lihat meninggalkan jamaah atau ingin memecah belahkan umat Muhammad SAW, sesiapa pun dia, bunuhlah dia! Sesungguhnya pertolongan Allah SWT adalah bersama jamaah, dan syaitan pula bersama mereka yang meninggalkan jamaah, sentiasa berlari bersama mereka.\""
  },
  {
    "id": 18767,
    "hadith_number": 4031,
    "tajuk_hadith": "Membunuh Mereka Yang Mencuba Memecah Belahkan Ummah",
    "perawi_melayu": "Daripada Arfajah bin Shuraih, beliau berkata:",
    "english_text": "\"The Prophet  when they are all united, kill him, no matter who he is among the people.'\"",
    "arabic_text": "أَخْبَرَنَا أَبُو عَلِيٍّ، مُحَمَّدُ بْنُ عَلِيٍّ الْمَرْوَزِيُّ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنِ عُثْمَانَ، عَنْ أَبِي حَمْزَةَ، عَنْ زِيَادِ بْنِ عِلاَقَةَ، عَنْ عَرْفَجَةَ بْنِ شُرَيْحٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِنَّهَا سَتَكُونُ بَعْدِي هَنَاتٌ وَهَنَاتٌ وَهَنَاتٌ - وَرَفَعَ يَدَيْهِ - فَمَنْ رَأَيْتُمُوهُ يُرِيدُ تَفْرِيقَ أَمْرِ أُمَّةِ مُحَمَّدٍ صلى الله عليه وسلم وَهُمْ جَمِيعٌ فَاقْتُلُوهُ كَائِنًا مَنْ كَانَ مِنَ النَّاسِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  “Sesungguhnya selepas aku akan berlaku banyak fitnah demi fitnah demi fitnah.” Baginda mengangkat kedua belah tangan baginda, lalu bersabda: “Barangsiapa yang kamu lihat cuba memecah belahkan urusan umat Muhammad SAW, sedang mereka bersatu, maka bunuhlah dia, sesiapa pun dia di kalangan manusia.”"
  },
  {
    "id": 18768,
    "hadith_number": 4032,
    "tajuk_hadith": "Hukuman Bagi Mereka Yang Mencetuskan Perpecahan Dalam Ummah",
    "perawi_melayu": "Daripada riwayat Arfajah:",
    "english_text": "\"I heard the Messenger of Allah (ﷺ) say: 'After me there will be dissensions and disputes. Whoever wants to break up the affair of the community of Muhammad (ﷺ) when they are all united, strike him with the sword.'\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا زِيَادُ بْنُ عِلاَقَةَ، عَنْ عَرْفَجَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ سَتَكُونُ بَعْدِي هَنَاتٌ وَهَنَاتٌ فَمَنْ أَرَادَ أَنْ يُفَرِّقَ أَمْرَ أُمَّةِ مُحَمَّدٍ صلى الله عليه وسلم وَهُمْ جَمْعٌ فَاضْرِبُوهُ بِالسَّيْفِ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda:  \"Selepas aku, akan berlaku perselisihan dan perbalahan. Sesiapa yang ingin memecah-belahkan urusan umat Muhammad SAW ketika mereka bersatu padu, bunuhlah dia dengan pedang.\""
  },
  {
    "id": 18769,
    "hadith_number": 4033,
    "tajuk_hadith": "Hukuman Bagi Mereka Yang Mencipta Perpecahan Dalam Ummah",
    "perawi_melayu": "Daripada Usamah bin Syarik, katanya:",
    "english_text": "\"The Messenger of Allah  said: 'Any man who goes out and tries to create division among my Ummah, strike his neck (kill him).'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ زَيْدِ بْنِ عَطَاءِ بْنِ السَّائِبِ، عَنْ زِيَادِ بْنِ عِلاَقَةَ، عَنْ أُسَامَةَ بْنِ شَرِيكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَيُّمَا رَجُلٍ خَرَجَ يُفَرِّقُ بَيْنَ أُمَّتِي فَاضْرِبُوا عُنُقَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Usamah bin Syarik, katanya: Rasulullah SAW bersabda: \"Sesiapa yang keluar (memberontak) untuk memecah-belahkan umatku, maka pancunglah lehernya.\""
  },
  {
    "id": 18770,
    "hadith_number": 4034,
    "tajuk_hadith": "Kisah Sekumpulan Orang Ukul dan Hukuman Nabi SAW",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ حَجَّاجٍ الصَّوَّافِ، قَالَ حَدَّثَنَا أَبُو رَجَاءٍ، مَوْلَى أَبِي قِلاَبَةَ قَالَ حَدَّثَنَا أَبُو قِلاَبَةَ، قَالَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ نَفَرًا، مِنْ عُكْلٍ ثَمَانِيَةً قَدِمُوا عَلَى النَّبِيِّ صلى الله عليه وسلم فَاسْتَوْخَمُوا الْمَدِينَةَ وَسَقِمَتْ أَجْسَامُهُمْ فَشَكَوْا ذَلِكَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ أَلاَ تَخْرُجُونَ مَعَ رَاعِينَا فِي إِبِلِهِ فَتُصِيبُوا مِنْ أَلْبَانِهَا وَأَبْوَالِهَا ‏\"‏ ‏.‏ قَالُوا بَلَى ‏.‏ فَخَرَجُوا فَشَرِبُوا مِنْ أَلْبَانِهَا وَأَبْوَالِهَا فَصَحُّوا فَقَتَلُوا رَاعِيَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَبَعَثَ فَأَخَذُوهُمْ فَأُتِيَ بِهِمْ فَقَطَّعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ وَسَمَّرَ أَعْيُنَهُمْ وَنَبَذَهُمْ فِي الشَّمْسِ حَتَّى مَاتُوا ‏.‏",
    "malay_translation": "Kami diberitakan oleh Ismail bin Mas'ud, katanya: Telah menceritakan kepada kami Yazid bin Zurai', dari Hajjaj As-Sawwaf, katanya: Telah menceritakan kepada kami Abu Rajaa', hamba Abu Qilabah, katanya: Telah menceritakan kepada kami Abu Qilabah, katanya: Telah menceritakan kepadaku Anas bin Malik, bahawa sekumpulan orang dari Ukul, seramai lapan orang, datang kepada Nabi SAW. Mereka mengalami sakit dan tubuh mereka lemah. Lalu mereka mengadu kepada Rasulullah SAW. Baginda bersabda: \"Tidakkah kamu keluar bersama penggembala kami menjaga unta-unta, supaya kamu dapat minum air susu dan air kencingnya?\" Mereka menjawab: \"Ya.\" Maka mereka keluar, lalu meminum air susu dan air kencing unta itu, lalu mereka sembuh. Kemudian mereka membunuh penggembala Rasulullah SAW. Maka Baginda mengutus orang untuk menangkap mereka. Mereka dibawa kepada Baginda, lalu Baginda memotong tangan dan kaki mereka, mencacak mata mereka, dan membiarkan mereka di bawah terik matahari sehingga mereka mati."
  },
  {
    "id": 18771,
    "hadith_number": 4035,
    "tajuk_hadith": " Hukuman Ke Atas Orang-orang Yang Mempunyai Niat Jahat Terhadap Rasulullah SAW",
    "perawi_melayu": "Dari Anas r.a.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ، عَنِ الْوَلِيدِ، عَنِ الأَوْزَاعِيِّ، عَنْ يَحْيَى، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، أَنَّ نَفَرًا، مِنْ عُكْلٍ قَدِمُوا عَلَى النَّبِيِّ صلى الله عليه وسلم فَاجْتَوَوُا الْمَدِينَةَ فَأَمَرَهُمُ النَّبِيُّ صلى الله عليه وسلم أَنْ يَأْتُوا إِبِلَ الصَّدَقَةِ فَيَشْرَبُوا مِنْ أَبْوَالِهَا وَأَلْبَانِهَا فَفَعَلُوا فَقَتَلُوا رَاعِيَهَا وَاسْتَاقُوهَا فَبَعَثَ النَّبِيُّ صلى الله عليه وسلم فِي طَلَبِهِمْ - قَالَ - فَأُتِيَ بِهِمْ فَقَطَّعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ وَسَمَّرَ أَعْيُنَهُمْ وَلَمْ يَحْسِمْهُمْ وَتَرَكَهُمْ حَتَّى مَاتُوا فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ إِنَّمَا جَزَاءُ الَّذِينَ يُحَارِبُونَ اللَّهَ وَرَسُولَهُ ‏}‏ الآيَةَ ‏.‏",
    "malay_translation": "Aku diberitahu oleh Amru bin Usman bin Sa’id bin Katsir bin Dinar, daripada Al-Walid, daripada Al-Auza’i, daripada Yahya, daripada Abu Qilabah, daripada Anas bahawa beberapa orang dari kabilah Ukul datang kepada Nabi SAW. Mereka menjelajah Madinah. Maka Nabi SAW menyuruh mereka supaya datang kepada unta-unta zakat lalu minum air kencing dan susu unta-unta itu. Mereka melakukannya, lalu mereka membunuh gembala unta itu dan mencuri unta-unta tersebut.  Maka Nabi SAW mengutus orang untuk mencari mereka. Kemudian mereka dibawa kepada Nabi SAW. Lalu Nabi SAW memotong tangan dan kaki mereka, dan mencacak mata mereka, dan tidak membakar luka-luka mereka, dan membiarkan mereka sehingga mati.  Kemudian Allah SWT menurunkan ayat:  \"Sesungguhnya balasan bagi orang-orang yang memerangi Allah dan Rasul-Nya...\" (ayat seterusnya)."
  },
  {
    "id": 18772,
    "hadith_number": 4036,
    "tajuk_hadith": "Lapan Puluh Lelaki dari Ukul Menziarahi Rasulullah SAW",
    "perawi_melayu": "Dari Anas r.a.",
    "english_text": "\"Eighty men from 'Ukl came to the Messenger of Allah \" and he (the narrator) mentioned a similar report up to the words: \"And he did not have (their wounds) cauterized.\" And he said: \"They killed the herdsman.\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي أَبُو قِلاَبَةَ، عَنْ أَنَسٍ، قَالَ قَدِمَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم ثَمَانِيَةُ نَفَرٍ مِنْ عُكْلٍ فَذَكَرَ نَحْوَهُ إِلَى قَوْلِهِ لَمْ يَحْسِمْهُمْ وَقَالَ قَتَلُوا الرَّاعِيَ ‏.‏",
    "malay_translation": "Dari Anas r.a., bahawa lapan puluh orang lelaki dari Ukul telah datang kepada Rasulullah SAW.  Kemudian (perawi) menyebut laporan yang serupa sehingga kepada perkataan: “Dan baginda tidak membakar luka-luka mereka.” Dan baginda berkata: “Mereka telah membunuh gembala itu.”"
  },
  {
    "id": 18773,
    "hadith_number": 4037,
    "tajuk_hadith": " Hukuman Ke Atas Sekumpulan Lelaki Dari Ukul atau Uraynah",
    "perawi_melayu": "Dari Anas r.a.",
    "english_text": "\"A group of men from 'Ukl, or 'Uraynah, came to the Prophet , and when the climate of Al-Madinah did not suit them, he told them to go to some camels and drink their milk and urine. Then they killed the herdsman and stole the camels. He sent (men) after them, and had their hands and feet cut off, and their eyes gouged out.\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، قَالَ أَتَى النَّبِيَّ صلى الله عليه وسلم نَفَرٌ مِنْ عُكْلٍ أَوْ عُرَيْنَةَ فَأَمَرَ لَهُمْ - وَاجْتَوَوُا الْمَدِينَةَ - بِذَوْدٍ أَوْ لِقَاحٍ يَشْرَبُونَ أَلْبَانَهَا وَأَبْوَالَهَا فَقَتَلُوا الرَّاعِيَ وَاسْتَاقُوا الإِبِلَ فَبَعَثَ فِي طَلَبِهِمْ فَقَطَّعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ وَسَمَلَ أَعْيُنَهُمْ ‏.‏",
    "malay_translation": "Sekaumpulan lelaki dari Ukul atau Uraynah datang kepada Nabi SAW.  Oleh kerana iklim Madinah tidak sesuai dengan mereka, baginda menyuruh mereka pergi kepada beberapa ekor unta dan minum susu dan air kencingnya. Kemudian mereka membunuh gembala dan mencuri unta-unta tersebut. Baginda menghantar orang untuk mengejar mereka, lalu tangan dan kaki mereka dipotong, dan mata mereka dikorbankan."
  },
  {
    "id": 18774,
    "hadith_number": 4038,
    "tajuk_hadith": " Hukuman ke atas penduduk Uraynah",
    "perawi_melayu": "Dari Anas bin Malik, diriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، قَالَ أَخْبَرَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ عُمَرَ، وَغَيْرُهُ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ نَاسًا، مِنْ عُرَيْنَةَ قَدِمُوا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَاجْتَوَوُا الْمَدِينَةَ فَبَعَثَهُمُ النَّبِيُّ صلى الله عليه وسلم إِلَى ذَوْدٍ لَهُ فَشَرِبُوا مِنْ أَلْبَانِهَا وَأَبْوَالِهَا فَلَمَّا صَحُّوا ارْتَدُّوا عَنِ الإِسْلاَمِ وَقَتَلُوا رَاعِيَ رَسُولِ اللَّهِ صلى الله عليه وسلم مُؤْمِنًا وَاسْتَاقُوا الإِبِلَ فَبَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي آثَارِهِمْ فَأُخِذُوا فَقَطَّعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ وَسَمَلَ أَعْيُنَهُمْ وَصَلَبَهُمْ ‏.‏",
    "malay_translation": "Kami diberitahu oleh Ahmad bin Amru bin Sarh, katanya: Aku diberitahu oleh Ibnu Wahb, katanya: Aku diberitahu oleh Abdullah bin Umar dan lain-lain, daripada Humaid al-Thawil, daripada Anas bin Malik, bahawa segolongan orang dari Uraynah datang kepada Rasulullah SAW, lalu mereka merayau di Madinah. Kemudian Nabi SAW menghantar mereka kepada kambing milik baginda. Mereka minum susu dan air kencing kambing tersebut. Setelah mereka sihat, mereka murtad daripada Islam dan membunuh gembala Rasulullah SAW yang seorang mukmin, serta mencuri unta. Maka Rasulullah SAW menghantar orang untuk menjejaki mereka, lalu mereka ditangkap.  Kemudian tangan dan kaki mereka dipotong, mata mereka dibelak, dan mereka disalib."
  },
  {
    "id": 18775,
    "hadith_number": 4039,
    "tajuk_hadith": " Hukuman ke atas kaum 'Uraynah",
    "perawi_melayu": "Daripada Anas r.a.",
    "english_text": "\"Some people from 'Uraynah came to the Messenger of Allah . He sent (men) after them, and they were brought to him. He had their hands and feet cut off, and their eyes gouged out.\"",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَنْبَأَنَا إِسْمَاعِيلُ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ قَدِمَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أُنَاسٌ مِنْ عُرَيْنَةَ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَوْ خَرَجْتُمْ إِلَى ذَوْدِنَا فَكُنْتُمْ فِيهَا فَشَرِبْتُمْ مِنْ أَلْبَانِهَا وَأَبْوَالِهَا ‏\"‏ ‏.‏ فَفَعَلُوا فَلَمَّا صَحُّوا قَامُوا إِلَى رَاعِي رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَتَلُوهُ وَرَجَعُوا كُفَّارًا وَاسْتَاقُوا ذَوْدَ النَّبِيِّ صلى الله عليه وسلم فَأَرْسَلَ فِي طَلَبِهِمْ فَأُتِيَ بِهِمْ فَقَطَّعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ وَسَمَلَ أَعْيُنَهُمْ ‏.‏",
    "malay_translation": "Segelintir penduduk dari 'Uraynah telah datang kepada Rasulullah SAW.  Rasulullah SAW telah menghantar orang untuk menjejaki mereka, dan mereka dibawa menghadap baginda.  Baginda telah memerintahkan supaya tangan dan kaki mereka dipotong, dan mata mereka dikorbankan."
  },
  {
    "id": 18776,
    "hadith_number": 4040,
    "tajuk_hadith": " Hukuman ke atas penduduk Uraynah",
    "perawi_melayu": "Daripada Anas r.a.",
    "english_text": "\"Some people from 'Uraynah came to the Messenger of Allah , and left as those at war. He sent (men) after them and they were caught. Then he had their hands and feet cut off, and branded their eyes.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا حُمَيْدٌ، عَنْ أَنَسٍ، قَالَ قَدِمَ نَاسٌ مِنْ عُرَيْنَةَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَاجْتَوَوُا الْمَدِينَةَ فَقَالَ لَهُمُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَوْ خَرَجْتُمْ إِلَى ذَوْدِنَا فَشَرِبْتُمْ مِنْ أَلْبَانِهَا ‏\"‏ ‏.‏ قَالَ وَقَالَ قَتَادَةُ ‏\"‏ وَأَبْوَالِهَا ‏\"‏ ‏.‏ فَخَرَجُوا إِلَى ذَوْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا صَحُّوا كَفَرُوا بَعْدَ إِسْلاَمِهِمْ وَقَتَلُوا رَاعِيَ رَسُولِ اللَّهِ صلى الله عليه وسلم مُؤْمِنًا وَاسْتَاقُوا ذَوْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَانْطَلَقُوا مُحَارِبِينَ فَأَرْسَلَ فِي طَلَبِهِمْ فَأُخِذُوا فَقَطَّعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ وَسَمَّرَ أَعْيُنَهُمْ ‏.‏",
    "malay_translation": "Segelintir penduduk dari Uraynah datang kepada Rasulullah SAW, kemudian mereka meninggalkan Madinah seperti orang-orang yang sedang berperang.  Rasulullah SAW menghantar orang untuk mengejar mereka, dan mereka ditangkap. Kemudian, tangan dan kaki mereka dipotong, dan mata mereka dipancangkan (dibakar)."
  },
  {
    "id": 18777,
    "hadith_number": 4041,
    "tajuk_hadith": "Orang-orang Uraynah yang Murtad",
    "perawi_melayu": "Daripada Anas r.a.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عَدِيٍّ، قَالَ حَدَّثَنَا حُمَيْدٌ، عَنْ أَنَسٍ، قَالَ أَسْلَمَ أُنَاسٌ مِنْ عُرَيْنَةَ فَاجْتَوَوُا الْمَدِينَةَ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ خَرَجْتُمْ إِلَى ذَوْدٍ لَنَا فَشَرِبْتُمْ مِنْ أَلْبَانِهَا ‏\"‏ ‏.‏ قَالَ حُمَيْدٌ وَقَالَ قَتَادَةُ عَنْ أَنَسٍ ‏\"‏ وَأَبْوَالِهَا ‏\"‏ ‏.‏ فَفَعَلُوا فَلَمَّا صَحُّوا كَفَرُوا بَعْدَ إِسْلاَمِهِمْ وَقَتَلُوا رَاعِيَ رَسُولِ اللَّهِ صلى الله عليه وسلم مُؤْمِنًا وَاسْتَاقُوا ذَوْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهَرَبُوا مُحَارِبِينَ فَأَرْسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَنْ أَتَى بِهِمْ فَأُخِذُوا فَقَطَّعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ وَسَمَّرَ أَعْيُنَهُمْ وَتَرَكَهُمْ فِي الْحَرَّةِ حَتَّى مَاتُوا ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Al-Mutsanna, katanya; telah menceritakan kepada kami Muhammad bin Abi ‘Udayy, katanya; telah menceritakan kepada kami Humaid, daripada Anas r.a., bahawa sesetengah kaum dari Uraynah telah memeluk Islam, kemudian mereka tidak serasi dengan keadaan Madinah. Maka Rasulullah s.a.w. telah bersabda kepada mereka: \"Bagaimana jika kamu keluar ke kambing-kambing kami, lalu kamu minum susunya.\" Humaid berkata, dan Qatadah berkata daripada Anas: \"Dan air kencingnya.\" Mereka pun berbuat demikian. Setelah mereka sihat, mereka murtad selepas memeluk Islam, dan mereka membunuh gembala Rasulullah s.a.w. yang beriman, dan mereka mencuri kambing-kambing Rasulullah s.a.w., lalu mereka melarikan diri sebagai musuh. Maka Rasulullah s.a.w. telah menghantar orang untuk menangkap mereka, lalu mereka ditangkap. Kemudian Rasulullah s.a.w. memotong tangan dan kaki mereka, dan membutakan mata mereka, kemudian membiarkan mereka di Al-Harrah sehingga mereka mati."
  },
  {
    "id": 18778,
    "hadith_number": 4042,
    "tajuk_hadith": " Hukuman Ke Atas Orang-orang yang Ingkar Janji",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا يَزِيدُ، - وَهُوَ ابْنُ زُرَيْعٍ - قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا قَتَادَةُ، أَنَّ أَنَسَ بْنَ مَالِكٍ، حَدَّثَهُمْ أَنَّ نَاسًا أَوْ رِجَالاً مِنْ عُكْلٍ أَوْ عُرَيْنَةَ قَدِمُوا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّا أَهْلُ ضَرْعٍ وَلَمْ نَكُنْ أَهْلَ رِيفٍ ‏.‏ فَاسْتَوْخَمُوا الْمَدِينَةَ فَأَمَرَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم بِذَوْدٍ وَرَاعٍ وَأَمَرَهُمْ أَنْ يَخْرُجُوا فِيهَا فَيَشْرَبُوا مِنْ لَبَنِهَا وَأَبْوَالِهَا فَلَمَّا صَحُّوا - وَكَانُوا بِنَاحِيَةِ الْحَرَّةِ - كَفَرُوا بَعْدَ إِسْلاَمِهِمْ وَقَتَلُوا رَاعِيَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَاسْتَاقُوا الذَّوْدَ فَبَعَثَ الطَّلَبَ فِي آثَارِهِمْ فَأُتِيَ بِهِمْ فَسَمَّرَ أَعْيُنَهُمْ وَقَطَّعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ ثُمَّ تَرَكَهُمْ فِي الْحَرَّةِ عَلَى حَالِهِمْ حَتَّى مَاتُوا ‏.‏",
    "malay_translation": "Muhammad bin Abdil A'la telah memberitahu kami, katanya Yazid (iaitu anak Zuray') telah memberitahu kami, katanya Syu'bah telah memberitahu kami, katanya Qatadah telah memberitahu kami, bahawa Anas bin Malik telah menceritakan kepada mereka bahawa segelintir orang atau lelaki dari Ukul atau Uraynah telah datang kepada Rasulullah SAW, lalu mereka berkata: “Wahai Rasulullah, kami adalah penduduk padang pasir dan bukannya penduduk desa.” Kemudian mereka mengintai Madinah. Lalu Rasulullah SAW memerintahkan untuk memberi mereka kambing biri-biri dan gembala, dan memerintahkan mereka supaya keluar dan minum susu dan air kencing kambing biri-biri itu. Setelah mereka sembuh – dan mereka berada di kawasan Harrah – mereka murtad setelah memeluk Islam, dan membunuh gembala Rasulullah SAW serta merampas kambing biri-biri itu. Maka Rasulullah SAW menghantar orang untuk menjejaki mereka, lalu mereka ditangkap. Kemudian Rasulullah SAW mencacak mata mereka, memotong tangan dan kaki mereka, lalu membiarkan mereka di Harrah dalam keadaan sedemikian sehingga mereka mati."
  },
  {
    "id": 18779,
    "hadith_number": 4043,
    "tajuk_hadith": "Riwayat daripada Abdul-A'la",
    "perawi_melayu": "Daripada Abdul-A'la:",
    "english_text": "A similar report was narrated from 'Abdul-A'la.",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، عَنْ عَبْدِ الأَعْلَى، نَحْوَهُ ‏.‏",
    "malay_translation": "Satu laporan yang serupa diriwayatkan daripada Abdul-A'la."
  },
  {
    "id": 18780,
    "hadith_number": 4044,
    "tajuk_hadith": " Hukuman Ke Atas Kaum 'Uraynah",
    "perawi_melayu": "Daripada Anas r.a.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ نَافِعٍ أَبُو بَكْرٍ، قَالَ حَدَّثَنَا بَهْزٌ، قَالَ حَدَّثَنَا حَمَّادٌ، قَالَ حَدَّثَنَا قَتَادَةُ، وَثَابِتٌ، عَنْ أَنَسٍ، أَنَّ نَفَرًا، مِنْ عُرَيْنَةَ نَزَلُوا فِي الْحَرَّةِ فَأَتَوُا النَّبِيَّ صلى الله عليه وسلم فَاجْتَوَوُا الْمَدِينَةَ فَأَمَرَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَكُونُوا فِي إِبِلِ الصَّدَقَةِ وَأَنْ يَشْرَبُوا مِنْ أَلْبَانِهَا وَأَبْوَالِهَا فَقَتَلُوا الرَّاعِيَ وَارْتَدُّوا عَنِ الإِسْلاَمِ وَاسْتَاقُوا الإِبِلَ فَبَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي آثَارِهِمْ فَجِيءَ بِهِمْ فَقَطَّعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ وَسَمَّرَ أَعْيُنَهُمْ وَأَلْقَاهُمْ فِي الْحَرَّةِ ‏.‏ قَالَ أَنَسٌ فَلَقَدْ رَأَيْتُ أَحَدَهُمْ يَكْدُمُ الأَرْضَ بِفِيهِ عَطَشًا حَتَّى مَاتُوا ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Naufal Abu Bakar, katanya; telah menceritakan kepada kami Bahz, katanya; telah menceritakan kepada kami Hammad, katanya; telah menceritakan kepada kami Qatadah dan Tsabit, daripada Anas r.a., bahawa segolongan orang dari 'Uraynah telah menetap di Al-Harrah, kemudian mereka datang kepada Nabi SAW lalu mereka memasuki Madinah.  Rasulullah SAW memerintahkan mereka untuk tinggal di kalangan unta sedekah dan minum susu dan air kencingnya.  Kemudian mereka membunuh gembala dan murtad daripada Islam serta melarikan unta-unta tersebut.  Maka Rasulullah SAW menghantar orang untuk menjejaki mereka, lalu mereka ditangkap.  Kemudian Rasulullah SAW memotong tangan dan kaki mereka, mencacak mata mereka, dan membuang mereka ke Al-Harrah. Anas berkata: \"Aku telah melihat salah seorang daripada mereka menggigit tanah kerana dahaga sehingga mereka mati.\""
  },
  {
    "id": 18781,
    "hadith_number": 4045,
    "tajuk_hadith": "Azab ke atas kaum Badwi yang ingkar janji",
    "perawi_melayu": "Dari Anas bin Malik r.a.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ وَهْبٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنِي أَبُو عَبْدِ الرَّحِيمِ، قَالَ حَدَّثَنِي زَيْدُ بْنُ أَبِي أُنَيْسَةَ، عَنْ طَلْحَةَ بْنِ مُصَرِّفٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَدِمَ أَعْرَابٌ مِنْ عُرَيْنَةَ إِلَى نَبِيِّ اللَّهِ صلى الله عليه وسلم فَأَسْلَمُوا فَاجْتَوَوُا الْمَدِينَةَ حَتَّى اصْفَرَّتْ أَلْوَانُهُمْ وَعَظُمَتْ بُطُونُهُمْ فَبَعَثَ بِهِمْ نَبِيُّ اللَّهِ صلى الله عليه وسلم إِلَى لِقَاحٍ لَهُ فَأَمَرَهُمْ أَنْ يَشْرَبُوا مِنْ أَلْبَانِهَا وَأَبْوَالِهَا حَتَّى صَحُّوا فَقَتَلُوا رُعَاتِهَا وَاسْتَاقُوا الإِبِلَ فَبَعَثَ نَبِيُّ اللَّهِ صلى الله عليه وسلم فِي طَلَبِهِمْ فَأُتِيَ بِهِمْ فَقَطَّعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ وَسَمَّرَ أَعْيُنَهُمْ ‏.‏ قَالَ أَمِيرُ الْمُؤْمِنِينَ عَبْدُ الْمَلِكِ لأَنَسٍ وَهُوَ يُحَدِّثُهُ هَذَا الْحَدِيثَ بِكُفْرٍ أَوْ بِذَنْبٍ قَالَ بِكُفْرٍ ‏.‏",
    "malay_translation": "Aku diberitahu oleh Muhammad bin Wahb, katanya: telah menceritakan kepada kami Muhammad bin Salameh, katanya: telah menceritakan kepadaku Abu Abdur-Rahim, katanya: telah menceritakan kepadaku Zaid bin Abi Unaisah, daripada Thalhah bin Musarrif, daripada Yahya bin Said, daripada Anas bin Malik r.a., katanya: “Segelintir kaum Badwi dari Urainah datang kepada Nabi SAW lalu memeluk Islam.  Namun, mereka tidak sesuai dengan iklim Madinah, sehingga warna kulit mereka menjadi kuning dan perut mereka membesar.  Maka, Nabi SAW menghantar mereka ke beberapa ekor unta betina milik Baginda dan menyuruh mereka minum susu dan air kencing unta itu sehingga mereka sembuh.  Kemudian, mereka membunuh pengembala unta itu dan melarikan unta-unta tersebut. Nabi SAW menghantar orang untuk mengejar mereka, lalu mereka ditangkap.  Kemudian, Nabi SAW memerintahkan supaya tangan dan kaki mereka dipotong, dan mata mereka dibakar.” Amirul Mukminin Abd al-Malik bertanya kepada Anas ketika Baginda menceritakan hadis ini, “Adakah hukuman itu disebabkan kufur atau dosa?” Anas menjawab, “Disebabkan kufur.”"
  },
  {
    "id": 18782,
    "hadith_number": 4046,
    "tajuk_hadith": " Hukuman Ke Atas Orang Arab Yang Murtad",
    "perawi_melayu": "Daripada Said bin Musayyab",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ وَأَخْبَرَنِي يَحْيَى بْنُ أَيُّوبَ، وَمُعَاوِيَةُ بْنُ صَالِحٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، قَالَ قَدِمَ نَاسٌ مِنَ الْعَرَبِ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَسْلَمُوا ثُمَّ مَرِضُوا فَبَعَثَ بِهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى لِقَاحٍ لِيَشْرَبُوا مِنْ أَلْبَانِهَا فَكَانُوا فِيهَا ثُمَّ عَمَدُوا إِلَى الرَّاعِي غُلاَمِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَتَلُوهُ وَاسْتَاقُوا اللِّقَاحَ فَزَعَمُوا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ اللَّهُمَّ عَطِّشَ مَنْ عَطَّشَ آلَ مُحَمَّدٍ اللَّيْلَةَ ‏\"‏ ‏.‏ فَبَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي طَلَبِهِمْ فَأُخِذُوا فَقَطَّعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ وَسَمَلَ أَعْيُنَهُمْ ‏.‏ وَبَعْضُهُمْ يَزِيدُ عَلَى بَعْضٍ إِلاَّ أَنَّ مُعَاوِيَةَ قَالَ فِي هَذَا الْحَدِيثِ اسْتَاقُوا إِلَى أَرْضِ الشِّرْكِ ‏.‏",
    "malay_translation": "Kami diberitakan oleh Ahmad bin Amru bin Sarh, katanya:  Telah menceritakan kepada kami Ibn Wahb, katanya: Dan telah menceritakan kepadaku Yahya bin Ayyub dan Muawiyah bin Shalih, daripada Yahya bin Saeed, daripada Saeed bin Musayyab, katanya:  Segelintir orang Arab datang kepada Rasulullah SAW, lalu mereka memeluk Islam, kemudian mereka jatuh sakit. Maka Rasulullah SAW menghantar mereka ke tempat ternakan untuk meminum susu, lalu mereka berada di sana. Kemudian mereka menyerang gembala, iaitu budak Rasulullah SAW, lalu mereka membunuhnya dan merampas ternakan tersebut. Mereka mendakwa bahawa Rasulullah SAW telah berdoa: \"Ya Allah, hauskan sesiapa yang telah menyebabkan keluarga Muhammad haus pada malam ini.\" Maka Rasulullah SAW menghantar orang untuk mencari mereka, lalu mereka ditangkap. Kemudian tangan dan kaki mereka dipotong dan mata mereka dibutakan.  Dan sebahagian daripada mereka menambah cerita itu melebihi yang lain, kecuali Muawiyah yang berkata dalam hadis ini, mereka melarikan diri ke negeri syirik."
  },
  {
    "id": 18783,
    "hadith_number": 4047,
    "tajuk_hadith": " Hukuman Pencuri Unta Susu Rasulullah",
    "perawi_melayu": "Daripada Aisyah r.a.",
    "english_text": "\"Some people raided the milk camels of the Messenger of Allah . He caught them and had their hands and feet cut off and their eyes gouged out.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْخَلَنْجِيُّ، قَالَ حَدَّثَنَا مَالِكُ بْنُ سُعَيْرٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، رضى الله عنها قَالَتْ أَغَارَ قَوْمٌ عَلَى لِقَاحِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخَذَهُمْ فَقَطَّعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ وَسَمَلَ أَعْيُنَهُمْ ‏.‏",
    "malay_translation": "Aisyah r.a. berkata:  “Segolongan orang telah menyerang unta-unta susu Rasulullah SAW.  Rasulullah SAW menangkap mereka lalu memotong tangan dan kaki mereka serta membutakan mata mereka.”"
  },
  {
    "id": 18784,
    "hadith_number": 4048,
    "tajuk_hadith": " Hukuman Ke Atas Pencuri Unta Susu Rasulullah",
    "perawi_melayu": "Daripada Aisyah:",
    "english_text": "\"Some people raided the milk camels of the Messenger of Allah  had their hands and feet cut off and their eyes gouged out.\" This is the wording of Ibn Al-Muthanna.",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، عَنْ إِبْرَاهِيمَ بْنِ أَبِي الْوَزِيرِ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ، ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَبِي الْوَزِيرِ، قَالَ حَدَّثَنَا الدَّرَاوَرْدِيُّ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ قَوْمًا، أَغَارُوا عَلَى لِقَاحِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأُتِيَ بِهِمُ النَّبِيُّ صلى الله عليه وسلم فَقَطَّعَ النَّبِيُّ صلى الله عليه وسلم أَيْدِيَهُمْ وَأَرْجُلَهُمْ وَسَمَلَ أَعْيُنَهُمْ ‏.‏ اللَّفْظُ لاِبْنِ الْمُثَنَّى ‏.‏",
    "malay_translation": "Daripada Aisyah r.a., bahawa segolongan orang telah menyerbu unta-unta susu Rasulullah SAW.  Lalu mereka dibawa kepada Nabi SAW, dan Nabi SAW telah memotong tangan dan kaki mereka serta membutakan mata mereka.  Lafaz ini daripada Ibnu Muthanna."
  },
  {
    "id": 18785,
    "hadith_number": 4049,
    "tajuk_hadith": " Hukuman Ke Atas Pencuri Unta Rasulullah",
    "perawi_melayu": "Daripada Hisyam, daripada bapanya, bahawa:",
    "english_text": "Some people raided the camels of the Messenger of Allah . He had their hands and feet cut off and their eyes gouged out.",
    "arabic_text": "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ، قَالَ أَنْبَأَنَا اللَّيْثُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، أَنَّ قَوْمًا، أَغَارُوا عَلَى إِبِلِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَطَّعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ وَسَمَلَ أَعْيُنَهُمْ ‏.‏",
    "malay_translation": "Dikhabarkan kepada kami oleh Isa bin Hammad, katanya:  memberitakan kepada kami oleh Laith, daripada Hisyam, daripada bapanya, bahawa segolongan orang telah menyerbu unta-unta Rasulullah SAW, maka dipotong tangan dan kaki mereka, dan dibutakan mata mereka."
  },
  {
    "id": 18786,
    "hadith_number": 4050,
    "tajuk_hadith": "Pencurian Unta Susu dan Hukumannya",
    "perawi_melayu": "Daripada riwayat Urwah bin Az-Zubair:",
    "english_text": "\"Some people from 'Uraynah raided the milk camels of the Messenger of Allah  sent (men) after them, and they were caught, and he had their hands and feet cut off, and their eyes gouged out.\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ وَأَخْبَرَنِي يَحْيَى بْنُ عَبْدِ اللَّهِ بْنِ سَالِمٍ، وَسَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ، وَذَكَرَ، آخَرَ عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّهُ قَالَ أَغَارَ نَاسٌ مِنْ عُرَيْنَةَ عَلَى لِقَاحِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَاسْتَاقُوهَا وَقَتَلُوا غُلاَمًا لَهُ فَبَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي آثَارِهِمْ فَأُخِذُوا فَقَطَّعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ وَسَمَلَ أَعْيُنَهُمْ ‏.‏",
    "malay_translation": "Dikatakan bahawa Urwah bin Az-Zubair berkata:  Segolongan orang dari Uraynah menyerang unta-unta susu Rasulullah ﷺ, mencuri dan membunuh seorang budak lelaki baginda.  Lalu Rasulullah ﷺ menghantar orang untuk menjejaki mereka.  Mereka ditangkap, lalu tangan dan kaki mereka dipotong, dan mata mereka dibutakan."
  },
  {
    "id": 18787,
    "hadith_number": 4051,
    "tajuk_hadith": "Ayat Al-Muharabah Diturunkan Untuk Mereka",
    "perawi_melayu": "Daripada Abdullah bin Umar:",
    "english_text": "From the Messenger of Allah : \"The Verse about Al-Muharabah was revealed concerning them.\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، قَالَ أَخْبَرَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ أَبِي الزِّنَادِ، عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَنَزَلَتْ فِيهِمْ آيَةُ الْمُحَارَبَةِ ‏.‏",
    "malay_translation": "Daripada Rasulullah SAW:  \"Ayat al-Muharabah diturunkan mengenai mereka.\""
  },
  {
    "id": 18788,
    "hadith_number": 4052,
    "tajuk_hadith": "Rasulullah SAW dan Hukuman Ke Atas Pencuri Unta",
    "perawi_melayu": "Daripada Abu Az-Zinad bahawa:",
    "english_text": "The Messenger of Allah  had the (hands and feet) of those who drove off his camels cut off, and their eyes gouged out with fire. Allah rebuked him for that, and Allah, Most High, revealed the entire verse: \"The recompense of those who wage war against Allah and His Messenger.\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي اللَّيْثُ، عَنِ ابْنِ عَجْلاَنَ، عَنْ أَبِي الزِّنَادِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمَّا قَطَّعَ الَّذِينَ سَرَقُوا لِقَاحَهُ وَسَمَلَ أَعْيُنَهُمْ بِالنَّارِ عَاتَبَهُ اللَّهُ فِي ذَلِكَ فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏ إِنَّمَا جَزَاءُ الَّذِينَ يُحَارِبُونَ اللَّهَ وَرَسُولَهُ ‏}‏ الآيَةَ كُلَّهَا ‏.‏",
    "malay_translation": "Daripada Abu Az-Zinad, bahawa ketika Rasulullah SAW menjatuhkan hukuman potong tangan dan kaki, serta membutakan mata dengan api ke atas mereka yang mencuri unta-unta baginda, Allah SWT menegur baginda.  Kemudian Allah SWT menurunkan keseluruhan ayat:  \"Sesungguhnya balasan bagi orang-orang yang memerangi Allah dan Rasul-Nya…\""
  },
  {
    "id": 18789,
    "hadith_number": 4053,
    "tajuk_hadith": "Mencabut Mata oleh Nabi SAW",
    "perawi_melayu": "Dari Anas r.a.",
    "english_text": "\"The Prophet  only had the eyes of those people gouged out, because they had gouged out the eyes of the herdsmen.\"",
    "arabic_text": "أَخْبَرَنَا الْفَضْلُ بْنُ سَهْلٍ الأَعْرَجُ، قَالَ حَدَّثَنَا يَحْيَى بْنُ غَيْلاَنَ، - ثِقَةٌ مَأْمُونٌ - قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ أَنَسٍ، قَالَ إِنَّمَا سَمَلَ النَّبِيُّ صلى الله عليه وسلم أَعْيُنَ أُولَئِكَ لأَنَّهُمْ سَمَلُوا أَعْيُنَ الرُّعَاةِ ‏.‏",
    "malay_translation": "Dari Anas r.a., bahawa Nabi SAW hanya mencabut mata orang-orang itu kerana mereka telah mencabut mata para penggembala."
  },
  {
    "id": 18790,
    "hadith_number": 4054,
    "tajuk_hadith": " Hukuman terhadap Pembunuhan Wanita Ansar oleh Orang Yahudi",
    "perawi_melayu": "Dari Anas bin Malik:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ عَمْرٍو، عَنِ ابْنِ جُرَيْجٍ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَجُلاً، مِنَ الْيَهُودِ قَتَلَ جَارِيَةً مِنَ الأَنْصَارِ عَلَى حُلِيٍّ لَهَا وَأَلْقَاهَا فِي قَلِيبٍ وَرَضَخَ رَأْسَهَا بِالْحِجَارَةِ فَأُخِذَ فَأَمَرَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُرْجَمَ حَتَّى يَمُوتَ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Amr bin Ash-Shurah dan Al-Harits bin Miskin dengan cara membaca kepadanya dan saya mendengarnya. Dia berkata, telah menceritakan kepada kami Ibnu Wahb, katanya, telah menceritakan kepadaku Muhammad bin Amr dari Ibnu Juraij dari Ayyub dari Abu Qilabah dari Anas bin Malik, bahawa seorang lelaki dari kalangan Yahudi telah membunuh seorang hamba perempuan daripada kalangan Ansar kerana perhiasannya, lalu dia membuangnya ke dalam perigi dan menghancurkan kepalanya dengan batu. Maka dia ditangkap, lalu Rasulullah SAW memerintahkan supaya dia direjam sehingga mati."
  },
  {
    "id": 18791,
    "hadith_number": 4055,
    "tajuk_hadith": "Hukuman Pembunuhan Seorang Gadis Ansar",
    "perawi_melayu": "Daripada Anas r.a.",
    "english_text": "A man killed an Ansari girl for her jewelry, then he threw her in an empty well, and crushed her head with a rock. The Prophet  ordered that he be stoned to death.",
    "arabic_text": "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا حَجَّاجٌ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي مَعْمَرٌ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، أَنَّ رَجُلاً، قَتَلَ جَارِيَةً مِنَ الأَنْصَارِ عَلَى حُلِيٍّ لَهَا ثُمَّ أَلْقَاهَا فِي قَلِيبٍ وَرَضَخَ رَأْسَهَا بِالْحِجَارَةِ فَأَمَرَ النَّبِيُّ صلى الله عليه وسلم أَنْ يُرْجَمَ حَتَّى يَمُوتَ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Yusuf bin Said, katanya; telah menceritakan kepada kami Hajjaj, dari Ibnu Juraij, katanya; telah memberitakan kepadaku Ma'mar, dari Ayyub, dari Abu Qilabah, dari Anas r.a., bahawa seorang lelaki telah membunuh seorang gadis daripada kalangan Ansar kerana perhiasannya, kemudian dia membuangnya ke dalam perigi yang kosong dan menghancurkan kepalanya dengan batu.  Maka Nabi SAW memerintahkan supaya lelaki itu dirajam sehingga mati."
  },
  {
    "id": 18792,
    "hadith_number": 4056,
    "tajuk_hadith": "Hukuman bagi yang memerangi Allah dan Rasul-Nya",
    "perawi_melayu": "Daripada Ibnu Abbas r.a.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنِي عَلِيُّ بْنُ الْحُسَيْنِ بْنِ وَاقِدٍ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنَا يَزِيدُ النَّحْوِيُّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، فِي قَوْلِهِ تَعَالَى ‏{‏ إِنَّمَا جَزَاءُ الَّذِينَ يُحَارِبُونَ اللَّهَ وَرَسُولَهُ ‏}‏ الآيَةَ قَالَ نَزَلَتْ هَذِهِ الآيَةُ فِي الْمُشْرِكِينَ فَمَنْ تَابَ مِنْهُمْ قَبْلَ أَنْ يُقْدَرَ عَلَيْهِ لَمْ يَكُنْ عَلَيْهِ سَبِيلٌ وَلَيْسَتْ هَذِهِ الآيَةُ لِلرَّجُلِ الْمُسْلِمِ فَمَنْ قَتَلَ وَأَفْسَدَ فِي الأَرْضِ وَحَارَبَ اللَّهَ وَرَسُولَهُ ثُمَّ لَحِقَ بِالْكُفَّارِ قَبْلَ أَنْ يُقْدَرَ عَلَيْهِ لَمْ يَمْنَعْهُ ذَلِكَ أَنْ يُقَامَ فِيهِ الْحَدُّ الَّذِي أَصَابَ ‏.‏",
    "malay_translation": "Dikhabarkan kepada kami oleh Zakaria bin Yahya, katanya: telah menceritakan kepada kami Ishaq bin Ibrahim, katanya: telah memberitakan kepadaku Ali bin Hussein bin Waqid, katanya: telah menceritakan kepadaku bapaku, katanya: telah menceritakan kepada kami Yazid An-Nahwi, daripada Ikrimah, daripada Ibnu Abbas, berkenaan firman Allah SWT: {Innama jazaaullazina yuharribuuna Allaha wa rasuluhu...} (Surah At-Taubah ayat 29).  Baginda berkata: Ayat ini turun mengenai orang-orang musyrik.  Barangsiapa di antara mereka yang bertaubat sebelum dapat ditangkap, maka tidak ada jalan baginya.  Ayat ini bukanlah untuk orang Islam. Barangsiapa membunuh, melakukan kerosakan di muka bumi dan memerangi Allah dan Rasul-Nya, kemudian bergabung dengan orang-orang kafir sebelum dapat ditangkap, maka hal itu tidak menghalangnya daripada dikenakan hukuman had kerana perbuatannya."
  },
  {
    "id": 18793,
    "hadith_number": 4057,
    "tajuk_hadith": "Keutamaan Sedekah dan Larangan Mutilasi",
    "perawi_melayu": "Daripada Anas r.a.",
    "english_text": "\"The Messenger of Allah  used to stress charity in his sermons, and prohibit mutilation.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا عَبْدُ الصَّمَدِ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَحُثُّ فِي خُطْبَتِهِ عَلَى الصَّدَقَةِ وَيَنْهَى عَنِ الْمُثْلَةِ ‏.‏",
    "malay_translation": "Rasulullah SAW sentiasa menggalakkan sedekah dalam khutbah baginda dan melarang perbuatan mutilasi."
  },
  {
    "id": 18794,
    "hadith_number": 4058,
    "tajuk_hadith": "Hukum Menumpahkan Darah Muslim",
    "perawi_melayu": "Daripada Aisyah r.a.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْعَبَّاسُ بْنُ مُحَمَّدٍ الدُّورِيُّ، قَالَ حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ، عَنْ إِبْرَاهِيمَ بْنِ طَهْمَانَ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، عَنْ عُبَيْدِ بْنِ عُمَيْرٍ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلاَّ بِإِحْدَى ثَلاَثِ خِصَالٍ زَانٍ مُحْصَنٌ يُرْجَمُ أَوْ رَجُلٌ قَتَلَ رَجُلاً مُتَعَمِّدًا فَيُقْتَلُ أَوْ رَجُلٌ يَخْرُجُ مِنَ الإِسْلاَمِ يُحَارِبُ اللَّهَ عَزَّ وَجَلَّ وَرَسُولَهُ فَيُقْتَلُ أَوْ يُصْلَبُ أَوْ يُنْفَى مِنَ الأَرْضِ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Abbas bin Muhammad Ad-Duri, katanya: telah menceritakan kepada kami Abu Amir Al-'Aqdi, daripada Ibrahim bin Tahman, daripada Abdul Aziz bin Rufaie', daripada Ubaid bin Umair, daripada Aisyah r.a., bahawa Rasulullah SAW bersabda: \"Tidak halal darah seorang Muslim melainkan dengan salah satu daripada tiga perkara: orang yang berzina yang telah berkahwin direjam, atau orang yang membunuh orang lain dengan sengaja maka dia dibunuh, atau orang yang keluar daripada Islam lalu memerangi Allah SWT dan Rasul-Nya, maka dia dibunuh, atau disalib, atau diasingkan daripada negeri.\""
  },
  {
    "id": 18795,
    "hadith_number": 4059,
    "tajuk_hadith": "Solat Hamba yang Melarikan Diri",
    "perawi_melayu": "Daripada Jarir, katanya:",
    "english_text": "\"The Messenger of Allah  said: 'If a slave runs away, no Salah will be accepted from him until he goes back to his masters.'\"",
    "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ أَنْبَأَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنِ الشَّعْبِيِّ، عَنْ جَرِيرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا أَبَقَ الْعَبْدُ لَمْ تُقْبَلْ لَهُ صَلاَةٌ حَتَّى يَرْجِعَ إِلَى مَوَالِيهِ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Jarir, katanya bahawa Rasulullah SAW bersabda: \"Jika seorang hamba melarikan diri, solatnya tidak akan diterima sehingga dia kembali kepada tuannya.\""
  },
  {
    "id": 18796,
    "hadith_number": 4060,
    "tajuk_hadith": "Solat Hamba Lari dan Kematian",
    "perawi_melayu": "Jarir meriwayatkan daripada Nabi SAW:",
    "english_text": "\"If a slave runs away, no Salah will be accepted from him, and if he dies he will die a disbeliever.\" A slave of Jarir's ran away, and he caught him and struck his neck (killing him).",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ، عَنْ جَرِيرٍ، عَنْ مُغِيرَةَ، عَنِ الشَّعْبِيِّ، قَالَ كَانَ جَرِيرٌ يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\n\"‏ إِذَا أَبَقَ الْعَبْدُ لَمْ تُقْبَلْ لَهُ صَلاَةٌ وَإِنْ مَاتَ مَاتَ كَافِرًا ‏\"‏ ‏.‏ وَأَبَقَ غُلاَمٌ لِجَرِيرٍ فَأَخَذَهُ فَضَرَبَ عُنُقَهُ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Qudamah, daripada Jarir, daripada Mughirah, daripada As-Sya'bi, katanya: Jarir meriwayatkan daripada Nabi SAW: \"Jika seorang hamba melarikan diri, solatnya tidak akan diterima, dan jika dia mati, dia mati dalam keadaan kafir.\"  Seorang hamba Jarir telah melarikan diri, lalu Jarir menangkapnya dan memukul lehernya (membunuhnya)."
  },
  {
    "id": 18797,
    "hadith_number": 4061,
    "tajuk_hadith": "Pelarian Hamba ke Negeri Syirik",
    "perawi_melayu": "Daripada Jarir bin Abdullah, katanya:",
    "english_text": "\"If a slave runs away to the land of Shirk, there is no protection (or immunity) for him.\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، قَالَ أَنْبَأَنَا إِسْرَائِيلُ، عَنْ مُغِيرَةَ، عَنِ الشَّعْبِيِّ، عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ، قَالَ إِذَا أَبَقَ الْعَبْدُ إِلَى أَرْضِ الشِّرْكِ فَلاَ ذِمَّةَ لَهُ ‏.‏",
    "malay_translation": "Daripada Jarir bin Abdullah, katanya: \"Jika seorang hamba melarikan diri ke negeri syirik, maka tiada perlindungan (atau jaminan keselamatan) baginya.\""
  },
  {
    "id": 18798,
    "hadith_number": 4062,
    "tajuk_hadith": "Hukum Darah Hamba yang Melarikan Diri ke Negeri Syirik",
    "perawi_melayu": "Dari Jarir, ia berkata:",
    "english_text": "\"The Messenger of Allah  said: 'If a slave runs away to the land of Shirk, it becomes permissible to shed his blood.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي إِسْحَاقَ، عَنِ الشَّعْبِيِّ، عَنْ جَرِيرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا أَبَقَ الْعَبْدُ إِلَى أَرْضِ الشِّرْكِ فَقَدْ حَلَّ دَمُهُ ‏\"‏ ‏.‏",
    "malay_translation": "Dari Jarir, ia berkata bahawa Rasulullah SAW bersabda:  \"Sekiranya seorang hamba melarikan diri ke negeri syirik, maka halal darahnya.\""
  },
  {
    "id": 18799,
    "hadith_number": 4063,
    "tajuk_hadith": "Hukum Darah Hamba yang Melarikan Diri ke Negeri Syirik",
    "perawi_melayu": "Dari Jarir, diriwayatkan bahawa:",
    "english_text": "The Prophet  said: \"If a slave runs away to the land of Shirk, it becomes permissible to shed his blood.\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا قَاسِمٌ، قَالَ حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، ‏{‏ عَنِ الشَّعْبِيِّ، ‏}‏ عَنْ جَرِيرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا أَبَقَ الْعَبْدُ إِلَى أَرْضِ الشِّرْكِ فَقَدْ حَلَّ دَمُهُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Jika seorang hamba melarikan diri ke negeri syirik, maka halal darahnya.\""
  },
  {
    "id": 18800,
    "hadith_number": 4064,
    "tajuk_hadith": "Hukum Darah Hamba yang Melarikan Diri ke Negeri Syirik",
    "perawi_melayu": "Dari Jarir, beliau berkata:",
    "english_text": "\"Any slave who runs away to the land of Shirk, it becomes permissible to shed his blood.\"",
    "arabic_text": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا خَالِدُ بْنُ عَبْدِ الرَّحْمَنِ، ‏{‏ عَنْ إِسْرَائِيلَ، ‏}‏ عَنْ أَبِي إِسْحَاقَ، عَنِ الشَّعْبِيِّ، عَنْ جَرِيرٍ، قَالَ أَيُّمَا عَبْدٍ أَبَقَ إِلَى أَرْضِ الشِّرْكِ فَقَدْ حَلَّ دَمُهُ ‏.‏",
    "malay_translation": "Dari Jarir, beliau berkata: \"Sebarang hamba yang melarikan diri ke negeri syirik, maka halal darahnya.\""
  },
  {
    "id": 18801,
    "hadith_number": 4065,
    "tajuk_hadith": "Hukum Darah Hamba yang Melarikan Diri ke Negeri Syirik",
    "perawi_melayu": "Dari Jarir, diriwayatkan bahawa:",
    "english_text": "\"Any slave who runs away to the land of Shirk, it becomes permissible to shed his blood.\"",
    "arabic_text": "أَخْبَرَنِي صَفْوَانُ بْنُ عَمْرٍو، قَالَ حَدَّثَنَا أَحْمَدُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الشَّعْبِيِّ، عَنْ جَرِيرٍ، قَالَ أَيُّمَا عَبْدٍ أَبَقَ إِلَى أَرْضِ الشِّرْكِ فَقَدْ حَلَّ دَمُهُ ‏.‏",
    "malay_translation": "Dari Jarir, diriwayatkan bahawa: mana-mana hamba yang melarikan diri ke negeri syirik, maka halal darahnya."
  },
  {
    "id": 18802,
    "hadith_number": 4066,
    "tajuk_hadith": "Hukum Pembunuhan Hamba yang Melarikan Diri dan Bergabung dengan Musuh",
    "perawi_melayu": "Dari Jarir, diriwayatkan bahawa:",
    "english_text": "\"Any slave who runs away from his masters and joins the enemy, he has made it permissible to shed his blood.\"",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا شَرِيكٌ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَامِرٍ، عَنْ جَرِيرٍ، قَالَ أَيُّمَا عَبْدٍ أَبَقَ مِنْ مَوَالِيهِ وَلَحِقَ بِالْعَدُوِّ فَقَدْ أَحَلَّ بِنَفْسِهِ ‏.‏",
    "malay_translation": "Dari Jarir, diriwayatkan bahawa sesiapa hamba yang melarikan diri daripada tuannya dan bergabung dengan musuh, maka dia telah menghalalkan darahnya sendiri."
  },
  {
    "id": 18803,
    "hadith_number": 4067,
    "tajuk_hadith": "Hukum Menumpahkan Darah Seorang Muslim",
    "perawi_melayu": "Daripada Ibnu Umar bahawa:",
    "english_text": "'Uthman said: \"I heard the Messenger of Allah  say: 'It is not permissible to shed the blood of a Muslim except in three cases: A man who commits adultery after having married; or one who kills intentionally, in which case he deserves retaliation; or one who apostatizes after having become Muslim, in which case he deserves to be killed.'\"",
    "arabic_text": "أَخْبَرَنَا أَبُو الأَزْهَرِ، أَحْمَدُ بْنُ الأَزْهَرِ النَّيْسَابُورِيُّ قَالَ حَدَّثَنَا إِسْحَاقُ بْنُ سُلَيْمَانَ الرَّازِيُّ، قَالَ أَنْبَأَنَا الْمُغِيرَةُ بْنُ مُسْلِمٍ، عَنْ مَطَرٍ الْوَرَّاقِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عُثْمَانَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلاَّ بِإِحْدَى ثَلاَثٍ رَجُلٌ زَنَى بَعْدَ إِحْصَانِهِ فَعَلَيْهِ الرَّجْمُ أَوْ قَتَلَ عَمْدًا فَعَلَيْهِ الْقَوَدُ أَوِ ارْتَدَّ بَعْدَ إِسْلاَمِهِ فَعَلَيْهِ الْقَتْلُ ‏\"‏ ‏.‏",
    "malay_translation": "Uthman berkata: \"Saya mendengar Rasulullah SAW bersabda: 'Tidak halal menumpahkan darah seorang Muslim melainkan dalam tiga keadaan: Lelaki yang berzina setelah berkahwin, maka hukumannya dirajam; atau membunuh dengan sengaja, maka baginya qisas (balasan setimpal); atau murtad setelah memeluk Islam, maka baginya hukuman mati.'"
  },
  {
    "id": 18804,
    "hadith_number": 4068,
    "tajuk_hadith": "Hukum Menumpahkan Darah Muslim",
    "perawi_melayu": "Daripada Usman bin Affan r.a.",
    "english_text": "\"I heard the Messenger of Allah  say: 'It is not permissible to shed the blood of a Muslim except in three cases: A man who commits adultery after having married; or one who kills another person, who is to be killed; or who reverts to Kufr after having accepted Islam, who is to be killed.'\"",
    "arabic_text": "أَخْبَرَنَا مُؤَمَّلُ بْنُ إِهَابٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَخْبَرَنِي ابْنُ جُرَيْجٍ، عَنْ أَبِي النَّضْرِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلاَّ بِثَلاَثٍ أَنْ يَزْنِيَ بَعْدَ مَا أُحْصِنَ أَوْ يَقْتُلَ إِنْسَانًا فَيُقْتَلُ أَوْ يَكْفُرَ بَعْدَ إِسْلاَمِهِ فَيُقْتَلُ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda: \"Tidak halal menumpahkan darah seorang Muslim melainkan dalam tiga keadaan:  Lelaki yang berzina setelah berkahwin; atau orang yang membunuh seseorang lalu dibunuh; atau orang yang murtad setelah memeluk Islam lalu dibunuh.\""
  },
  {
    "id": 18805,
    "hadith_number": 4069,
    "tajuk_hadith": "Hukum Menukar Agama",
    "perawi_melayu": "Ibnu Abbas berkata:",
    "english_text": "\"The Messenger of Allah  said: 'Whoever changes his religion, kill him.'\"",
    "arabic_text": "أَخْبَرَنَا عِمْرَانُ بْنُ مُوسَى، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، قَالَ قَالَ ابْنُ عَبَّاسٍ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ بَدَّلَ دِينَهُ فَاقْتُلُوهُ ‏\"‏ ‏.‏",
    "malay_translation": "Ibnu Abbas berkata bahawa Rasulullah SAW bersabda: \"Barangsiapa yang menukar agamanya, bunuhlah dia.\""
  },
  {
    "id": 18806,
    "hadith_number": 4070,
    "tajuk_hadith": "Hukum Murtad",
    "perawi_melayu": "Daripada Ikrimah",
    "english_text": "\"Some people apostatized after accepting Islam, and 'Ali burned them with fire. Ibn 'Abbas said: 'If it had been me, I would not have burned them; the Messenger of Allah  said: 'Whoever changes his religion, kill him.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا أَبُو هِشَامٍ، قَالَ حَدَّثَنَا وُهَيْبٌ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، أَنَّ نَاسًا، ارْتَدُّوا عَنِ الإِسْلاَمِ، فَحَرَّقَهُمْ عَلِيٌّ بِالنَّارِ قَالَ ابْنُ عَبَّاسٍ لَوْ كُنْتُ أَنَا لَمْ، أُحَرِّقْهُمْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تُعَذِّبُوا بِعَذَابِ اللَّهِ أَحَدًا ‏\"‏ ‏.‏ وَلَوْ كُنْتُ أَنَا لَقَتَلْتُهُمْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ بَدَّلَ دِينَهُ فَاقْتُلُوهُ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Abdullah bin Mubarak, katanya: Telah menceritakan kepada kami Abu Hisyam, katanya: Telah menceritakan kepada kami Wahb, katanya: Telah menceritakan kepada kami Ayyub, daripada Ikrimah, bahawa ada segolongan orang yang murtad daripada Islam, lalu Ali membakar mereka dengan api.  Ibn Abbas berkata: Sekiranya aku, aku tidak akan membakar mereka.  Rasulullah SAW bersabda:  \"Janganlah kamu menyiksa dengan azab Allah sesiapa pun.\" Dan sekiranya aku, aku akan membunuh mereka. Rasulullah SAW bersabda: \"Barangsiapa yang menukar agamanya, maka bunuhlah dia.\""
  },
  {
    "id": 18807,
    "hadith_number": 4071,
    "tajuk_hadith": "Hukum Mengubah Agama",
    "perawi_melayu": "Daripada Ibnu Abbas r.a.",
    "english_text": "\"The Messenger of Allah  said: 'Whoever changes his religion, kill him.'\"",
    "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ، قَالَ أَنْبَأَنَا إِسْمَاعِيلُ، عَنْ مَعْمَرٍ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ بَدَّلَ دِينَهُ فَاقْتُلُوهُ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Ibnu Abbas r.a., bahawa Rasulullah SAW bersabda:  \"Barangsiapa yang menukar agamanya, bunuhlah dia.\""
  },
  {
    "id": 18808,
    "hadith_number": 4072,
    "tajuk_hadith": "Hukuman Bagi Mereka Yang Menukar Agama",
    "perawi_melayu": "Daripada Ibnu Abbas r.a.",
    "english_text": "\"The Messenger of Allah  said: 'Whoever changes his religion, kill him.'\"",
    "arabic_text": "أَخْبَرَنِي هِلاَلُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ بْنِ زُرَارَةَ، قَالَ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ، قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ بَدَّلَ دِينَهُ فَاقْتُلُوهُ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Ibnu Abbas r.a., bahawa Rasulullah SAW bersabda:  \"Barangsiapa yang menukar agamanya, bunuhlah dia.\""
  },
  {
    "id": 18809,
    "hadith_number": 4073,
    "tajuk_hadith": "Hukum Menukar Agama",
    "perawi_melayu": "Daripada Al-Hasan, katanya:",
    "english_text": "\"The Messenger of Allah  said: 'Whoever changes his religion, kill him.'\"",
    "arabic_text": "أَخْبَرَنَا مُوسَى بْنُ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ بَدَّلَ دِينَهُ فَاقْتُلُوهُ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ وَهَذَا أَوْلَى بِالصَّوَابِ مِنْ حَدِيثِ عَبَّادٍ ‏.‏",
    "malay_translation": "Daripada Al-Hasan, katanya bahawa Rasulullah SAW bersabda:  \"Barangsiapa yang menukar agamanya, bunuhlah dia.\""
  },
  {
    "id": 18810,
    "hadith_number": 4074,
    "tajuk_hadith": "Hukuman Bagi Mereka Yang Menukar Agama",
    "perawi_melayu": "Daripada Anas r.a.",
    "english_text": "Ibn 'Abbas said: \"The Messenger of Allah  said: 'Whoever changes his religion, kill him.'\"",
    "arabic_text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ عِيسَى، عَنْ عَبْدِ الصَّمَدِ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ ابْنَ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ بَدَّلَ دِينَهُ فَاقْتُلُوهُ ‏\"‏ ‏.‏",
    "malay_translation": "Ibn Abbas berkata: Rasulullah SAW bersabda: \"Barangsiapa yang menukar agamanya, bunuhlah dia.\""
  },
  {
    "id": 18811,
    "hadith_number": 4075,
    "tajuk_hadith": "Ali dan Pembakaran Berhala di Az-Zutt",
    "perawi_melayu": "Dari Anas r.a.",
    "english_text": "'Ali came to some people of Az-Zutt, who worshipped idols, and burned them. Ibn 'Abbas said: \"But the Messenger of Allah  said: 'Whoever changes his religion, kill him.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا عَبْدُ الصَّمَدِ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ عَلِيًّا، أُتِيَ بِنَاسٍ مِنَ الزُّطِّ يَعْبُدُونَ وَثَنًا فَأَحْرَقَهُمْ، قَالَ ابْنُ عَبَّاسٍ إِنَّمَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ بَدَّلَ دِينَهُ فَاقْتُلُوهُ ‏\"‏ ‏.‏",
    "malay_translation": "Dari Anas r.a., bahawa Ali telah datang kepada sekumpulan penduduk Az-Zutt yang menyembah berhala, lalu membakar mereka. Ibnu Abbas berkata: \"Tetapi Rasulullah SAW telah bersabda: 'Barangsiapa yang menukar agamanya, bunuhlah dia.'\""
  },
  {
    "id": 18812,
    "hadith_number": 4076,
    "tajuk_hadith": "Hukum Pembunuhan Murtad",
    "perawi_melayu": "Daripada Abu Burdah bin Abi Musa Al-Ash'ari, daripada bapanya:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنِي حَمَّادُ بْنُ مَسْعَدَةَ، قَالَ حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى الأَشْعَرِيِّ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَهُ إِلَى الْيَمَنِ ثُمَّ أَرْسَلَ مُعَاذَ بْنَ جَبَلٍ بَعْدَ ذَلِكَ فَلَمَّا قَدِمَ قَالَ أَيُّهَا النَّاسُ إِنِّي رَسُولُ رَسُولِ اللَّهِ إِلَيْكُمْ ‏.‏ فَأَلْقَى لَهُ أَبُو مُوسَى وِسَادَةً لِيَجْلِسَ عَلَيْهَا فَأُتِيَ بِرَجُلٍ كَانَ يَهُودِيًّا فَأَسْلَمَ ثُمَّ كَفَرَ فَقَالَ مُعَاذٌ لاَ أَجْلِسُ حَتَّى يُقْتَلَ قَضَاءُ اللَّهِ وَرَسُولِهِ ‏.‏ ثَلاَثَ مَرَّاتٍ ‏.‏ فَلَمَّا قُتِلَ قَعَدَ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Basysyar, telah menceritakan kepadaku Hammad bin Mas'adah, katanya; telah menceritakan kepada kami Qurrah bin Khalid, daripada Humaid bin Hilal, daripada Abu Burdah bin Abi Musa Al-Asy'ari, daripada bapanya, bahawa Nabi SAW telah mengutusnya ke Yaman, kemudian Rasulullah SAW mengutus Mu'adz bin Jabal selepas itu. Maka setelah Mu'adz tiba, dia berkata, \"Wahai sekalian manusia, sesungguhnya aku adalah utusan rasul Allah kepada kamu.\" Maka Abu Musa meletakkan bantal untuknya supaya dia duduk. Kemudian didatangkan seorang lelaki yang sebelum ini seorang Yahudi, kemudian dia memeluk Islam, lalu dia kembali kepada kekufuran.  Maka Mu'adz berkata, \"Aku tidak akan duduk sehingga dia dibunuh, sebagai hukuman Allah dan Rasul-Nya.\" (Dia berkata demikian) sebanyak tiga kali.  Maka setelah lelaki itu dibunuh, barulah dia duduk."
  },
  {
    "id": 18813,
    "hadith_number": 4077,
    "tajuk_hadith": "Kisah Pemberian Bai'ah kepada Abdullah bin Saad bin Abi Sarah pada Hari Fath Makkah",
    "perawi_melayu": "Ia diriwayatkan daripada Mus'ab bin Sa'd bahawa bapanya berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ، قَالَ حَدَّثَنِي أَحْمَدُ بْنُ مُفَضَّلٍ، قَالَ حَدَّثَنَا أَسْبَاطُ، قَالَ زَعَمَ السُّدِّيُّ عَنْ مُصْعَبِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، قَالَ لَمَّا كَانَ يَوْمُ فَتْحِ مَكَّةَ أَمَّنَ رَسُولُ اللَّهِ صلى الله عليه وسلم النَّاسَ إِلاَّ أَرْبَعَةَ نَفَرٍ وَامْرَأَتَيْنِ وَقَالَ ‏\"‏ اقْتُلُوهُمْ وَإِنْ وَجَدْتُمُوهُمْ مُتَعَلِّقِينَ بِأَسْتَارِ الْكَعْبَةِ ‏\"‏ ‏.‏ عِكْرِمَةُ بْنُ أَبِي جَهْلٍ وَعَبْدُ اللَّهِ بْنُ خَطَلٍ وَمِقْيَسُ بْنُ صُبَابَةَ وَعَبْدُ اللَّهِ بْنُ سَعْدِ بْنِ أَبِي السَّرْحِ فَأَمَّا عَبْدُ اللَّهِ بْنُ خَطَلٍ فَأُدْرِكَ وَهُوَ مُتَعَلِّقٌ بِأَسْتَارِ الْكَعْبَةِ فَاسْتَبَقَ إِلَيْهِ سَعِيدُ بْنُ حُرَيْثٍ وَعَمَّارُ بْنُ يَاسِرٍ فَسَبَقَ سَعِيدٌ عَمَّارًا - وَكَانَ أَشَبَّ الرَّجُلَيْنِ - فَقَتَلَهُ وَأَمَّا مِقْيَسُ بْنُ صُبَابَةَ فَأَدْرَكَهُ النَّاسُ فِي السُّوقِ فَقَتَلُوهُ وَأَمَّا عِكْرِمَةُ فَرَكِبَ الْبَحْرَ فَأَصَابَتْهُمْ عَاصِفٌ فَقَالَ أَصْحَابُ السَّفِينَةِ أَخْلِصُوا فَإِنَّ آلِهَتَكُمْ لاَ تُغْنِي عَنْكُمْ شَيْئًا هَا هُنَا ‏.‏ فَقَالَ عِكْرِمَةُ وَاللَّهِ لَئِنْ لَمْ يُنَجِّنِي مِنَ الْبَحْرِ إِلاَّ الإِخْلاَصُ لاَ يُنَجِّينِي فِي الْبَرِّ غَيْرُهُ اللَّهُمَّ إِنَّ لَكَ عَلَىَّ عَهْدًا إِنْ أَنْتَ عَافَيْتَنِي مِمَّا أَنَا فِيهِ أَنْ آتِيَ مُحَمَّدًا صلى الله عليه وسلم حَتَّى أَضَعَ يَدِي فِي يَدِهِ فَلأَجِدَنَّهُ عَفُوًّا كَرِيمًا ‏.‏ فَجَاءَ فَأَسْلَمَ وَأَمَّا عَبْدُ اللَّهِ بْنُ سَعْدِ بْنِ أَبِي السَّرْحِ فَإِنَّهُ اخْتَبَأَ عِنْدَ عُثْمَانَ بْنِ عَفَّانَ فَلَمَّا دَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم النَّاسَ إِلَى الْبَيْعَةِ جَاءَ بِهِ حَتَّى أَوْقَفَهُ عَلَى النَّبِيِّ صلى الله عليه وسلم قَالَ يَا رَسُولَ اللَّهِ بَايِعْ عَبْدَ اللَّهِ ‏.‏ قَالَ فَرَفَعَ رَأْسَهُ فَنَظَرَ إِلَيْهِ ثَلاَثًا كُلَّ ذَلِكَ يَأْبَى فَبَايَعَهُ بَعْدَ ثَلاَثٍ ثُمَّ أَقْبَلَ عَلَى أَصْحَابِهِ فَقَالَ ‏\"‏ أَمَا كَانَ فِيكُمْ رَجُلٌ رَشِيدٌ يَقُومُ إِلَى هَذَا حَيْثُ رَآنِي كَفَفْتُ يَدِي عَنْ بَيْعَتِهِ فَيَقْتُلَهُ ‏\"‏ ‏.‏ فَقَالُوا وَمَا يُدْرِينَا يَا رَسُولَ اللَّهِ مَا فِي نَفْسِكَ هَلاَّ أَوْمَأْتَ إِلَيْنَا بِعَيْنِكَ ‏.‏ قَالَ ‏\"‏ إِنَّهُ لاَ يَنْبَغِي لِنَبِيٍّ أَنْ يَكُونَ لَهُ خَائِنَةُ أَعْيُنٍ ‏\"‏ ‏.‏",
    "malay_translation": "Dikhabarkan kepada kami oleh al-Qasim bin Zakaria bin Dinar, katanya; telah menceritakan kepadaku Ahmad bin Mufaddal, katanya; telah menceritakan kepada kami Asbaat, katanya; al-Suddi meriwayatkan daripada Mus'ab bin Saad, daripada bapanya, katanya; ketika hari pembukaan Makkah, Rasulullah SAW memberi keamanan kepada orang ramai kecuali empat orang lelaki dan dua orang perempuan, dan baginda bersabda: “Bunuhlah mereka, walaupun kamu dapati mereka berpaut pada tirai Kaabah.” Mereka ialah: Uqrumah bin Abu Jahal, Abdullah bin Khathal, Miqyas bin Subabah dan Abdullah bin Saad bin Abi Sarh. Adapun Abdullah bin Khathal, dia dijumpai berpaut pada tirai Kaabah, maka Said bin Huraith dan Ammar bin Yasir berlumba-lumba untuk mendapatkannya, dan Said mendahului Ammar – dan dialah yang lebih gagah dari kedua-duanya – lalu membunuhnya. Adapun Miqyas bin Subabah, dia dijumpai oleh orang ramai di pasar lalu dibunuhnya. Adapun Uqrumah, dia pergi ke laut, lalu mereka ditimpa ribut. Maka berkata para penumpang kapal: “Ikhlaskanlah niat kamu, kerana tuhan-tuhan kamu tidak akan memberi manfaat kepadamu sedikit pun.” Lalu Uqrumah berkata: Demi Allah, jika keikhlasan sahaja yang menyelamatkanku dari laut, maka tidak ada yang akan menyelamatkanku di darat melainkan keikhlasan. Ya Allah, sesungguhnya Engkau telah membuat perjanjian denganku, jika Engkau selamatkanku daripada apa yang aku hadapi, nescaya aku akan datang kepada Muhammad SAW hingga aku meletakkan tanganku di tangannya, dan aku akan dapati dia sebagai seorang yang pemaaf dan mulia.” Maka dia datang lalu memeluk Islam. Adapun Abdullah bin Saad bin Abi Sarh, dia bersembunyi di sisi Uthman bin Affan. Apabila Rasulullah SAW memanggil orang ramai untuk memberi bai’ah, Uthman membawanya sehingga dihadapkan kepada Nabi SAW. Uthman berkata: “Wahai Rasulullah, terimalah bai’ah Abdullah.” Maka Rasulullah mengangkat kepalanya dan memandangnya tiga kali, setiap kali itu baginda menolak. Kemudian baginda menerimanya setelah tiga kali. Kemudian baginda berpaling kepada sahabatnya dan bersabda: “Bukankah di antara kamu ada seorang yang berakal yang bangun lalu membunuh orang ini apabila dia melihat aku menolak untuk memberi bai’ah kepadanya?” Mereka berkata: “Wahai Rasulullah, kami tidak mengetahui apa yang ada di hati baginda. Mengapa baginda tidak memberi isyarat kepada kami dengan matanya?” Baginda bersabda: “Tidak sepatutnya bagi seorang nabi untuk memiliki pandangan yang khianat.”"
  },
  {
    "id": 18814,
    "hadith_number": 4078,
    "tajuk_hadith": "Taubat Seorang Ansar",
    "perawi_melayu": "Daripada Ibnu Abbas r.a.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ، قَالَ حَدَّثَنَا يَزِيدُ، - وَهُوَ ابْنُ زُرَيْعٍ - قَالَ أَنْبَأَنَا دَاوُدُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ رَجُلٌ مِنَ الأَنْصَارِ أَسْلَمَ ثُمَّ ارْتَدَّ وَلَحِقَ بِالشِّرْكِ ثُمَّ تَنَدَّمَ فَأَرْسَلَ إِلَى قَوْمِهِ سَلُوا لِي رَسُولَ اللَّهِ صلى الله عليه وسلم هَلْ لِي مِنْ تَوْبَةٍ فَجَاءَ قَوْمُهُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالُوا إِنَّ فُلاَنًا قَدْ نَدِمَ وَإِنَّهُ أَمَرَنَا أَنْ نَسْأَلَكَ هَلْ لَهُ مِنْ تَوْبَةٍ فَنَزَلَتْ ‏{‏ كَيْفَ يَهْدِي اللَّهُ قَوْمًا كَفَرُوا بَعْدَ إِيمَانِهِمْ ‏}‏ إِلَى قَوْلِهِ ‏{‏ غَفُورٌ رَحِيمٌ ‏}‏ ‏\"‏ ‏.‏ فَأَرْسَلَ إِلَيْهِ فَأَسْلَمَ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Abdullah bin Bazie', dia berkata; telah menceritakan kepada kami Yazid - iaitu anak Zuray' - dia berkata; telah memberitakan kepada kami Daud, daripada 'Ikrimah, daripada Ibnu Abbas, bahawa seorang lelaki daripada kalangan Ansar telah memeluk Islam, kemudian dia murtad dan kembali kepada syirik. Kemudian dia menyesal, lalu dia menghantar pesanan kepada kaumnya: 'Tanyakanlah kepada Rasulullah SAW adakah taubat bagiku?' Kemudian kaumnya datang kepada Rasulullah SAW lalu mereka berkata: 'Sesungguhnya fulan telah menyesal dan dia telah menyuruh kami bertanya kepadamu adakah taubat baginya?' Maka turunlah ayat: {Bagaimana Allah akan memberi petunjuk kepada kaum yang telah kufur sesudah beriman...} sehingga firman-Nya: {...sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.} Kemudian Rasulullah SAW mengutus seseorang kepadanya, lalu dia memeluk Islam semula."
  },
  {
    "id": 18815,
    "hadith_number": 4079,
    "tajuk_hadith": "Pengampunan Allah SWT bagi Mereka yang Berhijrah dan Berjihad",
    "perawi_melayu": "Daripada Ibnu Abbas",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَلِيُّ بْنُ الْحُسَيْنِ بْنِ وَاقِدٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ يَزِيدَ النَّحْوِيِّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ فِي سُورَةِ النَّحْلِ ‏{‏ مَنْ كَفَرَ بِاللَّهِ مِنْ بَعْدِ إِيمَانِهِ إِلاَّ مَنْ أُكْرِهَ ‏}‏ إِلَى قَوْلِهِ ‏{‏ لَهُمْ عَذَابٌ عَظِيمٌ ‏}‏ فَنُسِخَ وَاسْتَثْنَى مِنْ ذَلِكَ فَقَالَ ‏{‏ ثُمَّ إِنَّ رَبَّكَ لِلَّذِينَ هَاجَرُوا مِنْ بَعْدِ مَا فُتِنُوا ثُمَّ جَاهَدُوا وَصَبَرُوا إِنَّ رَبَّكَ مِنْ بَعْدِهَا لَغَفُورٌ رَحِيمٌ ‏}‏ وَهُوَ عَبْدُ اللَّهِ بْنُ سَعْدِ بْنِ أَبِي سَرْحٍ الَّذِي كَانَ عَلَى مِصْرَ كَانَ يَكْتُبُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَأَزَلَّهُ الشَّيْطَانُ فَلَحِقَ بِالْكُفَّارِ فَأَمَرَ بِهِ أَنْ يُقْتَلَ يَوْمَ الْفَتْحِ فَاسْتَجَارَ لَهُ عُثْمَانُ بْنُ عَفَّانَ فَأَجَارَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Dikhabarkan kepada kami oleh Zakaria bin Yahya, katanya:  Diriwayatkan kepada kami oleh Ishaq bin Ibrahim, katanya:  Diberitakan kepada kami oleh Ali bin Hussein bin Waqid, katanya:  Diberitakan kepadaku oleh ayahku, daripada Yazid An-Nahwi, daripada Ikrimah, daripada Ibnu Abbas, katanya:  Dalam Surah An-Nahl:  \"Barangsiapa kufur kepada Allah selepas beriman, kecuali orang yang dipaksa dan hatinya tetap tenang dengan iman; tetapi orang-orang yang membuka dada mereka kepada kekufuran, maka mereka akan mendapat kemurkaan daripada Allah, dan bagi mereka azab yang besar.\"  Kemudian ia dianskhkan dan dikecualikan darinya, lalu Allah SWT berfirman:  \"Kemudian sesungguhnya Tuhanmu sentiasa mengampuni dan sentiasa merahmati orang-orang yang berhijrah setelah mereka diuji, kemudian mereka berjihad dan bersabar.\"  Dan yang dimaksudkan ialah Abdullah bin Saad bin Abi Sarh, iaitu yang menjadi gabenor di Mesir, yang selalu menulis untuk Rasulullah SAW.  Kemudian syaitan menyesatkannya, lalu ia menyertai orang-orang kafir.  Lalu diputuskan hukuman bunuh kepadanya pada hari penaklukan Makkah.  Kemudian Usman bin Affan meminta perlindungan baginya, maka Rasulullah SAW mengampuninya."
  },
  {
    "id": 18816,
    "hadith_number": 4080,
    "tajuk_hadith": "Hukum Darah Wanita Yang Menghina Rasulullah SAW",
    "perawi_melayu": "Ibn Abbas meriwayatkan bahawa:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا عُثْمَانُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا عَبَّادُ بْنُ مُوسَى، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنِي إِسْرَائِيلُ، عَنْ عُثْمَانَ الشَّحَّامِ، قَالَ كُنْتُ أَقُودُ رَجُلاً أَعْمَى فَانْتَهَيْتُ إِلَى عِكْرِمَةَ فَأَنْشَأَ يُحَدِّثُنَا قَالَ حَدَّثَنِي ابْنُ عَبَّاسٍ أَنَّ أَعْمَى كَانَ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَكَانَتْ لَهُ أُمُّ وَلَدٍ وَكَانَ لَهُ مِنْهَا ابْنَانِ وَكَانَتْ تُكْثِرُ الْوَقِيعَةَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم وَتَسُبُّهُ فَيَزْجُرُهَا فَلاَ تَنْزَجِرُ وَيَنْهَاهَا فَلاَ تَنْتَهِي فَلَمَّا كَانَ ذَاتَ لَيْلَةٍ ذَكَرْتُ النَّبِيَّ صلى الله عليه وسلم فَوَقَعَتْ فِيهِ فَلَمْ أَصْبِرْ أَنْ قُمْتُ إِلَى الْمِغْوَلِ فَوَضَعْتُهُ فِي بَطْنِهَا فَاتَّكَأْتُ عَلَيْهِ فَقَتَلْتُهَا فَأَصْبَحَتْ قَتِيلاً فَذُكِرَ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَجَمَعَ النَّاسَ وَقَالَ ‏\"‏ أَنْشُدُ اللَّهَ رَجُلاً لِي عَلَيْهِ حَقٌّ فَعَلَ مَا فَعَلَ إِلاَّ قَامَ ‏\"‏ ‏.‏ فَأَقْبَلَ الأَعْمَى يَتَدَلْدَلُ فَقَالَ يَا رَسُولَ اللَّهِ أَنَا صَاحِبُهَا كَانَتْ أُمَّ وَلَدِي وَكَانَتْ بِي لَطِيفَةً رَفِيقَةً وَلِي مِنْهَا ابْنَانِ مِثْلُ اللُّؤْلُؤَتَيْنِ وَلَكِنَّهَا كَانَتْ تُكْثِرُ الْوَقِيعَةَ فِيكَ وَتَشْتُمُكَ فَأَنْهَاهَا فَلاَ تَنْتَهِي وَأَزْجُرُهَا فَلاَ تَنْزَجِرُ فَلَمَّا كَانَتِ الْبَارِحَةَ ذَكَرْتُكَ فَوَقَعَتْ فِيكَ فَقُمْتُ إِلَى الْمِغْوَلِ فَوَضَعْتُهُ فِي بَطْنِهَا فَاتَّكَأْتُ عَلَيْهَا حَتَّى قَتَلْتُهَا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَلاَ اشْهَدُوا أَنَّ دَمَهَا هَدَرٌ ‏\"‏ ‏.‏",
    "malay_translation": "Dikhabarkan kepada kami oleh Usman bin Abdullah, katanya: telah menceritakan kepada kami oleh Abbad bin Musa, katanya: telah menceritakan kepada kami oleh Ismail bin Ja’far, katanya: telah menceritakan kepadaku oleh Israil, daripada Usman As-Syahham, katanya: Aku pernah menuntun seorang lelaki yang buta sehingga kami sampai kepada ‘Ukrumah, lalu dia mula menceritakan kepada kami, katanya: telah menceritakan kepadaku oleh Ibnu Abbas bahawa: seorang lelaki buta pada zaman Rasulullah SAW, mempunyai seorang wanita hamba (Ummu Walad), dan mempunyai dua orang anak darinya. Wanita itu seringkali mengumpat dan menghina Rasulullah SAW. Lelaki buta itu telah menegur dan melarangnya, tetapi wanita itu tidak berhenti.  Pada suatu malam, apabila aku menyebut nama Nabi SAW, maka wanita itu mengumpat Baginda SAW.  Aku tidak dapat menahan diri lalu mengambil kayu dan menusukkannya ke dalam perutnya hingga membunuhnya.  Kejadian itu sampai ke pengetahuan Nabi SAW.  Baginda mengumpulkan orang ramai dan berkata: \"Aku bersumpah dengan nama Allah, sesiapa yang mempunyai hak ke atas wanita ini dan telah melakukan perbuatan ini hendaklah tampil ke hadapan.\"  Maka lelaki buta itu datang sambil tertatih-tatih dan berkata: \"Wahai Rasulullah, saya adalah orangnya. Dia adalah Ummul Walad saya, dia baik dan penyayang terhadap saya dan saya mempunyai dua orang anak darinya yang seperti dua mutiara. Tetapi dia seringkali mengumpat dan menghina tuan, dan saya telah melarangnya tetapi dia tidak berhenti.  Malam tadi, apabila saya menyebut nama tuan, dia mengumpat tuan, lalu saya mengambil kayu dan menusukkannya ke dalam perutnya hingga membunuhnya.\"  Rasulullah SAW bersabda: \"Saksikanlah bahawa darahnya halal.\" "
  },
  {
    "id": 18817,
    "hadith_number": 4081,
    "tajuk_hadith": "Larangan Membunuh Selepas Zaman Rasulullah SAW",
    "perawi_melayu": "Daripada Abu Barzah Al-Aslami berkata:",
    "english_text": "\"A man spoke harshly to Abu Bakr As-Siddiq, and I said: 'Shall I kill him?' He told me off, and said: 'That is not for anyone after the Messenger of Allah .'\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ تَوْبَةَ الْعَنْبَرِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ قُدَامَةَ بْنِ عَنَزَةَ، عَنْ أَبِي بَرْزَةَ الأَسْلَمِيِّ، قَالَ أَغْلَظَ رَجُلٌ لأَبِي بَكْرٍ الصِّدِّيقِ فَقُلْتُ أَقْتُلُهُ فَانْتَهَرَنِي وَقَالَ لَيْسَ هَذَا لأَحَدٍ بَعْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Seorang lelaki berkata kasar kepada Abu Bakar As-Siddiq, lalu aku berkata: 'Hendakkah aku membunuhnya?'  Dia menegurku dan berkata: 'Ini bukan hak sesiapa pun selepas Rasulullah SAW.'"
  },
  {
    "id": 18818,
    "hadith_number": 4082,
    "tajuk_hadith": "Ketegasan Abu Bakar As-Siddiq",
    "perawi_melayu": "Daripada Abu Barzah ra.",
    "english_text": "\"Abu Bakr got infuriated with a man, and I said: 'Who is he, O Khalifah of the Messenger of Allah?' He said: 'Why?' I said: 'So that I might strike his neck (killing him) if you tell me to.' He said: 'Would you really do that?' I said: 'Yes. By Allah,' the seriousness of what I said took away his anger. Then he said: 'That is not for anyone after Muhammad .'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ أَبِي بَرْزَةَ، قَالَ تَغَيَّظَ أَبُو بَكْرٍ عَلَى رَجُلٍ فَقُلْتُ مَنْ هُوَ يَا خَلِيفَةَ رَسُولِ اللَّهِ قَالَ لِمَ قُلْتُ لأَضْرِبَ عُنُقَهُ إِنْ أَمَرْتَنِي بِذَلِكَ ‏.‏ قَالَ أَفَكُنْتَ فَاعِلاً قُلْتُ نَعَمْ ‏.‏ قَالَ فَوَاللَّهِ لأَذْهَبَ عِظَمُ كَلِمَتِي الَّتِي قُلْتُ غَضَبَهُ ثُمَّ قَالَ مَا كَانَ لأَحَدٍ بَعْدَ مُحَمَّدٍ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Abu Bakar As-Siddiq berang kepada seorang lelaki.  Lalu aku bertanya, “Siapakah dia, wahai Khalifah Rasulullah?”  Beliau bertanya, “Mengapa?” Aku menjawab, “Supaya aku boleh membunuh (menetak lehernya) jika tuan menyuruhku.” Beliau bertanya, “Benarkah engkau akan berbuat demikian?” Aku menjawab, “Ya, demi Allah.”  Kesungguhan ucapanku itu menghilangkan kemarahannya. Kemudian beliau berkata, “Perkara itu tidak dibenarkan bagi sesiapa pun selepas Muhammad SAW.”"
  },
  {
    "id": 18819,
    "hadith_number": 4083,
    "tajuk_hadith": "Ketegasan Abu Bakar as-Siddiq",
    "perawi_melayu": "Daripada Abu Barzah ra.",
    "english_text": "\"I passed by Abu Bakr and he was furious with one of his companions. I said: 'O Khalifah of the Messenger of Allah, who is the one with whom you are furious?' He said: 'Why are you asking about him?' I said: 'I will strike his neck (kill him).' By Allah, the seriousness of what I said took away his anger. Then he said: 'That is not for anyone after Muhammad .'\"",
    "arabic_text": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا يَعْلَى، قَالَ حَدَّثَنَا الأَعْمَشُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ أَبِي الْبَخْتَرِيِّ، عَنْ أَبِي بَرْزَةَ، قَالَ مَرَرْتُ عَلَى أَبِي بَكْرٍ وَهُوَ مُتَغَيِّظٌ عَلَى رَجُلٍ مِنْ أَصْحَابِهِ فَقُلْتُ يَا خَلِيفَةَ رَسُولِ اللَّهِ مَنْ هَذَا الَّذِي تَغَيَّظُ عَلَيْهِ قَالَ وَلِمَ تَسْأَلُ قُلْتُ أَضْرِبُ عُنُقَهُ ‏.‏ قَالَ فَوَاللَّهِ لأَذْهَبَ عِظَمُ كَلِمَتِي غَضَبَهُ ثُمَّ قَالَ مَا كَانَتْ لأَحَدٍ بَعْدَ مُحَمَّدٍ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Aku lalu berjumpa Abu Bakar ketika beliau sedang marah kepada salah seorang sahabatnya. Aku berkata, \"Wahai Khalifah Rasulullah, siapakah orang yang menyebabkan tuan marah?\" Beliau bertanya, \"Mengapa engkau bertanya?\" Aku menjawab, \"Aku akan memenggal lehernya (membunuhnya).\" Demi Allah, kesungguhan ucapanku itu menghilangkan kemarahannya. Kemudian beliau berkata, \"Perkara itu tidak dibenarkan bagi sesiapa pun selepas Muhammad ﷺ.\""
  },
  {
    "id": 18820,
    "hadith_number": 4084,
    "tajuk_hadith": "Kemarahan Abu Bakar dan Had Islam",
    "perawi_melayu": "Daripada Abu Barzah, diriwayatkan bahawa:",
    "english_text": "\"Abu Bakr became infuriated with a man.\" He said: \"If you tell me to, I will do it.\" He said: \"By Allah, that is not for any human being after Muhammad .\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، عَنْ يَحْيَى بْنِ حَمَّادٍ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سُلَيْمَانَ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ أَبِي الْبَخْتَرِيِّ، عَنْ أَبِي بَرْزَةَ، قَالَ تَغَيَّظَ أَبُو بَكْرٍ عَلَى رَجُلٍ فَقَالَ لَوْ أَمَرْتَنِي لَفَعَلْتُ ‏.‏ قَالَ أَمَا وَاللَّهِ مَا كَانَتْ لِبَشَرٍ بَعْدَ مُحَمَّدٍ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Abu Bakar pernah berang terhadap seorang lelaki.  Lalu lelaki itu berkata, \"Sekiranya tuan menyuruhku, nescaya aku akan melakukannya.\"  Abu Bakar menjawab, \"Demi Allah, sesungguhnya hal itu bukanlah untuk seorang manusia pun selepas Muhammad ﷺ.\""
  },
  {
    "id": 18821,
    "hadith_number": 4085,
    "tajuk_hadith": "Kesabaran Abu Bakar As-Siddiq",
    "perawi_melayu": "Daripada Abu Nadrah, bahawa Abu Barzah berkata:",
    "english_text": "\"Abu Bakr got very angry with a man, so much so that his color changed. I said: 'O Khalifah of the Messenger of Allah, if you tell me to, I will strike his neck (kill him).' It was as if cold water had been poured on him and he became calm. He said: 'May your mother be bereft of you, Abu Barzah! That is not for anyone after the Messenger of Allah .'\"",
    "arabic_text": "أَخْبَرَنَا مُعَاوِيَةُ بْنُ صَالِحٍ الأَشْعَرِيُّ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ زَيْدٍ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنِ أَبِي نَضْرَةَ، عَنْ أَبِي بَرْزَةَ، قَالَ غَضِبَ أَبُو بَكْرٍ عَلَى رَجُلٍ غَضَبًا شَدِيدًا حَتَّى تَغَيَّرَ لَوْنُهُ قُلْتُ يَا خَلِيفَةَ رَسُولِ اللَّهِ وَاللَّهِ لَئِنْ أَمَرْتَنِي لأَضْرِبَنَّ عُنُقَهُ فَكَأَنَّمَا صُبَّ عَلَيْهِ مَاءٌ بَارِدٌ فَذَهَبَ غَضَبُهُ عَنِ الرَّجُلِ ‏.‏ قَالَ ثَكِلَتْكَ أُمُّكَ أَبَا بَرْزَةَ وَإِنَّهَا لَمْ تَكُنْ لأَحَدٍ بَعْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا خَطَأٌ وَالصَّوَابُ أَبُو نَصْرٍ وَاسْمُهُ حُمَيْدُ بْنُ هِلاَلٍ خَالَفَهُ شُعْبَةُ ‏.‏",
    "malay_translation": "Abu Bakar sangat marah kepada seorang lelaki sehingga berubah warna mukanya. Aku berkata, 'Wahai Khalifah Rasulullah, demi Allah, jika tuan menyuruhku, nescaya aku akan membunuh lelaki itu.'  Seakan-akan air sejuk telah disiram ke atasnya lalu reda kemarahannya. Baginda berkata, 'Semoga ibumu kehilanganmu, Abu Barzah! Sesungguhnya perbuatan itu tidak dibenarkan bagi sesiapa pun selepas Rasulullah SAW.' "
  },
  {
    "id": 18822,
    "hadith_number": 4086,
    "tajuk_hadith": "Larangan Membunuh Selepas Rasulullah SAW",
    "perawi_melayu": "Abu Nasr meriwayatkan daripada Abu Barzah, bahawa beliau berkata:",
    "english_text": "\"I came to Abu Bakr when he had spoken harshly to a man who had answered back. I said: 'Shall I not strike his neck (kill him)?' He rebuked me, and said: 'That is not for anyone after the Messenger of Allah .'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، عَنْ أَبِي دَاوُدَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، قَالَ سَمِعْتُ أَبَا نَصْرٍ، يُحَدِّثُ عَنْ أَبِي بَرْزَةَ، قَالَ أَتَيْتُ عَلَى أَبِي بَكْرٍ وَقَدْ أَغْلَظَ لِرَجُلٍ فَرَدَّ عَلَيْهِ فَقُلْتُ أَلاَ أَضْرِبُ عُنُقَهُ فَانْتَهَرَنِي ‏.‏ فَقَالَ إِنَّهَا لَيْسَتْ لأَحَدٍ بَعْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ أَبُو نَصْرٍ حُمَيْدُ بْنُ هِلاَلٍ ‏.‏ وَرَوَاهُ عَنْهُ يُونُسُ بْنُ عُبَيْدٍ فَأَسْنَدَهُ ‏.‏",
    "malay_translation": "Aku datang kepada Abu Bakar ketika beliau telah berkata dengan keras kepada seorang lelaki yang telah membalasnya. Aku berkata: 'Patutkah aku tidak memukul lehernya (membunuhnya)?'  Beliau menegurku, dan berkata: 'Itu bukanlah bagi sesiapa pun selepas Rasulullah SAW.'"
  },
  {
    "id": 18823,
    "hadith_number": 4087,
    "tajuk_hadith": "Hadis Tentang Hukuman Bunuh Selepas Zaman Nabi Muhammad SAW",
    "perawi_melayu": "Ia diriwayatkan daripada Yunus bin 'Ubaid, daripada Humaid bin Hilal, daripada 'Abdullah bin Mutarrif bin Ash-Shikhkhir, daripada Abu Barzah Al-Aslami, bahawa beliau berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنِي أَبُو دَاوُدَ، قَالَ حَدَّثَنَا عَفَّانُ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، قَالَ حَدَّثَنَا يُونُسُ بْنُ عُبَيْدٍ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ عَبْدِ اللَّهِ بْنِ مُطَرِّفِ بْنِ الشِّخِّيرِ، عَنْ أَبِي بَرْزَةَ الأَسْلَمِيِّ، أَنَّهُ قَالَ كُنَّا عِنْدَ أَبِي بَكْرٍ الصِّدِّيقِ فَغَضِبَ عَلَى رَجُلٍ مِنَ الْمُسْلِمِينَ فَاشْتَدَّ غَضَبُهُ عَلَيْهِ جِدًّا فَلَمَّا رَأَيْتُ ذَلِكَ قُلْتُ يَا خَلِيفَةَ رَسُولِ اللَّهِ أَضْرِبُ عُنُقَهُ فَلَمَّا ذَكَرْتُ الْقَتْلَ أَضْرَبَ عَنْ ذَلِكَ الْحَدِيثِ أَجْمَعَ إِلَى غَيْرِ ذَلِكَ مِنَ النَّحْوِ فَلَمَّا تَفَرَّقْنَا أَرْسَلَ إِلَىَّ فَقَالَ يَا أَبَا بَرْزَةَ مَا قُلْتَ وَنَسِيتُ الَّذِي قُلْتُ قُلْتُ ذَكِّرْنِيهِ ‏.‏ قَالَ أَمَا تَذْكُرُ مَا قُلْتَ قُلْتُ لاَ وَاللَّهِ ‏.‏ قَالَ أَرَأَيْتَ حِينَ رَأَيْتَنِي غَضِبْتُ عَلَى رَجُلٍ فَقُلْتَ أَضْرِبُ عُنُقَهُ يَا خَلِيفَةَ رَسُولِ اللَّهِ أَمَا تَذْكُرُ ذَلِكَ أَوَكُنْتَ فَاعِلاً ذَلِكَ قُلْتُ نَعَمْ وَاللَّهِ وَالآنَ إِنْ أَمَرْتَنِي فَعَلْتُ ‏.‏ قَالَ وَاللَّهِ مَا هِيَ لأَحَدٍ بَعْدَ مُحَمَّدٍ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا الْحَدِيثُ أَحْسَنُ الأَحَادِيثِ وَأَجْوَدُهَا وَاللَّهُ تَعَالَى أَعْلَمُ ‏.‏",
    "malay_translation": "Aku diberitahu oleh Abu Daud, katanya; telah menceritakan kepada kami Afan, katanya; telah menceritakan kepada kami Yazid bin Zurai', katanya; telah menceritakan kepada kami Yunus bin Ubaid, daripada Humaid bin Hilal, daripada Abdullah bin Mutarrif bin Syikhkhir, daripada Abu Barzah Al-Aslami, bahawa beliau berkata:  Kami berada di sisi Abu Bakar As-Siddiq, lalu baginda marah kepada seorang lelaki daripada kalangan orang Islam, dan kemarahannya itu sangat hebat.  Apabila aku melihatnya, aku berkata: “Wahai Khalifah Rasulullah, hendakkah aku pukul lehernya?”  Apabila aku menyebut tentang pembunuhan, baginda berhenti daripada marah kepadanya dan beralih kepada perkara lain.  Apabila kami berpisah, baginda menghantar orang untuk memanggilku, lalu berkata: “Wahai Abu Barzah, apakah yang engkau katakan?” Aku berkata: “Aku telah lupa apa yang aku katakan; ingatkan aku.” Baginda berkata: “Tidakkah engkau ingat apa yang engkau katakan?” Aku berkata: “Tidak, demi Allah.” Baginda berkata: “Tidakkah engkau ingat, ketika engkau melihat aku marah kepada seseorang, lalu engkau berkata, ‘Aku akan memukul lehernya, wahai Khalifah Rasulullah’? Tidakkah engkau ingat itu? Adakah engkau benar-benar akan melakukannya?” Aku berkata: “Ya, demi Allah, dan sekarang pun jika engkau menyuruhku, aku akan melakukannya.” Baginda berkata: “Demi Allah, ia bukanlah untuk sesiapa pun selepas Muhammad SAW.”  Abu Abdurrahman berkata: Hadis ini adalah hadis yang paling baik dan paling sempurna. Dan Allah SWT lebih mengetahui."
  },
  {
    "id": 18824,
    "hadith_number": 4088,
    "tajuk_hadith": "Larangan-Larangan dan Kesaksian Orang Yahudi",
    "perawi_melayu": "Daripada Safwan bin 'Assal berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، عَنِ ابْنِ إِدْرِيسَ، قَالَ أَنْبَأَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ عَبْدِ اللَّهِ بْنِ سَلِمَةَ، عَنْ صَفْوَانَ بْنِ عَسَّالٍ، قَالَ قَالَ يَهُودِيٌّ لِصَاحِبِهِ اذْهَبْ بِنَا إِلَى هَذَا النَّبِيِّ ‏.‏ قَالَ لَهُ صَاحِبُهُ لاَ تَقُلْ نَبِيٌّ لَوْ سَمِعَكَ كَانَ لَهُ أَرْبَعَةُ أَعْيُنٍ ‏.‏ فَأَتَيَا رَسُولَ اللَّهِ صلى الله عليه وسلم وَسَأَلاَهُ عَنْ تِسْعِ آيَاتٍ بَيِّنَاتٍ فَقَالَ لَهُمْ ‏\"‏ لاَ تُشْرِكُوا بِاللَّهِ شَيْئًا وَلاَ تَسْرِقُوا وَلاَ تَزْنُوا وَلاَ تَقْتُلُوا النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ وَلاَ تَمْشُوا بِبَرِيءٍ إِلَى ذِي سُلْطَانٍ وَلاَ تَسْحَرُوا وَلاَ تَأْكُلُوا الرِّبَا وَلاَ تَقْذِفُوا الْمُحْصَنَةَ وَلاَ تَوَلَّوْا يَوْمَ الزَّحْفِ وَعَلَيْكُمْ خَاصَّةً يَهُودُ أَنْ لاَ تَعْدُوا فِي السَّبْتِ ‏\"‏ ‏.‏ فَقَبَّلُوا يَدَيْهِ وَرِجْلَيْهِ وَقَالُوا نَشْهَدُ أَنَّكَ نَبِيٌّ ‏.‏ قَالَ ‏\"‏ فَمَا يَمْنَعُكُمْ أَنْ تَتَّبِعُونِي ‏\"‏ ‏.‏ قَالُوا إِنَّ دَاوُدَ دَعَا بِأَنْ لاَ يَزَالَ مِنْ ذُرِّيَّتِهِ نَبِيٌّ وَإِنَّا نَخَافُ إِنِ اتَّبَعْنَاكَ أَنْ تَقْتُلَنَا يَهُودُ ‏.‏",
    "malay_translation": "Seorang Yahudi berkata kepada temannya: “Marilah kita pergi kepada Nabi ini.” Temannya berkata kepadanya: “Jangan sebut Nabi, jika dia mendengarmu, dia akan menjadi sombong.” Maka mereka datang kepada Rasulullah ﷺ dan bertanya kepadanya tentang sembilan tanda yang jelas. Baginda berkata kepada mereka: “Janganlah kamu menyekutukan Allah dengan sesuatu pun, jangan mencuri, jangan berzina, jangan membunuh jiwa yang diharamkan Allah kecuali dengan hak, janganlah kamu menuduh orang yang tidak bersalah kepada pemerintah, jangan mengamalkan sihir, jangan memakan riba, jangan menuduh wanita yang suci, dan jangan melarikan diri pada hari pertempuran. Dan khas untuk kamu wahai Yahudi, jangan melanggar hari Sabat.” Maka mereka mencium tangan dan kakinya dan berkata: “Kami bersaksi bahawa engkau adalah seorang Nabi.” Baginda bertanya: “Apakah yang menghalang kamu daripada mengikutku?” Mereka berkata: “Daud berdoa agar sentiasa ada seorang Nabi di kalangan keturunannya, dan kami bimbang jika kami mengikutmu, orang-orang Yahudi akan membunuh kami.”"
  },
  {
    "id": 18825,
    "hadith_number": 4089,
    "tajuk_hadith": "Menggunakan Sihir dan Menggantungkan Azimat",
    "perawi_melayu": "Dari Abu Hurairah r.a.",
    "english_text": "\"The Messenger of Allah  said: 'Whoever ties a know and blows on it, he has practiced magic; and whoever practices magic, he has committed Shirk; and whoever hangs up something (as an amulet) will be entrusted to it.'\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا عَبَّادُ بْنُ مَيْسَرَةَ الْمِنْقَرِيُّ، عَنِ الْحَسَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ عَقَدَ عُقْدَةً ثُمَّ نَفَثَ فِيهَا فَقَدْ سَحَرَ وَمَنْ سَحَرَ فَقَدْ أَشْرَكَ وَمَنْ تَعَلَّقَ شَيْئًا وُكِّلَ إِلَيْهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: “Barangsiapa mengikat simpulan lalu meniupnya, maka sesungguhnya dia telah melakukan sihir. Dan barangsiapa melakukan sihir, maka sesungguhnya dia telah melakukan syirik. Dan barangsiapa menggantungkan sesuatu (sebagai azimat), maka dia akan diserahkan kepada benda itu.”"
  },
  {
    "id": 18826,
    "hadith_number": 4090,
    "tajuk_hadith": "Sihir Terhadap Nabi SAW",
    "perawi_melayu": "Daripada Zaid bin Arqam, Baginda berkata:",
    "english_text": "\"A Jewish man cast a spell on the Prophet  got up as if he had been released from some bonds. No mention of that was made to that Jew, and he did not see that in his face at all.\"",
    "arabic_text": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، عَنْ أَبِي مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنِ ابْنِ حَيَّانَ، - يَعْنِي يَزِيدَ - عَنْ زَيْدِ بْنِ أَرْقَمَ، قَالَ سَحَرَ النَّبِيَّ صلى الله عليه وسلم رَجُلٌ مِنَ الْيَهُودِ فَاشْتَكَى لِذَلِكَ أَيَّامًا فَأَتَاهُ جِبْرِيلُ عَلَيْهِ السَّلاَمُ فَقَالَ إِنَّ رَجُلاً مِنَ الْيَهُودِ سَحَرَكَ عَقَدَ لَكَ عُقَدًا فِي بِئْرِ كَذَا وَكَذَا فَأَرْسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَاسْتَخْرَجُوهَا فَجِيءَ بِهَا فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم كَأَنَّمَا نُشِطَ مِنْ عِقَالٍ فَمَا ذَكَرَ ذَلِكَ لِذَلِكَ الْيَهُودِيِّ وَلاَ رَآهُ فِي وَجْهِهِ قَطُّ ‏.‏",
    "malay_translation": "Daripada Zaid bin Arqam, Baginda berkata: \"Seorang lelaki Yahudi telah menyihir Nabi SAW, lalu Baginda sakit beberapa hari. Kemudian Jibril AS datang kepada Baginda dan memberitahu bahawa seorang lelaki Yahudi telah menyihir Baginda, mengikat simpulan-simpulan sihir di dalam perigi begini dan begini.  Lalu Rasulullah SAW menghantar orang untuk mengambilnya, kemudian ia dibawa.  Rasulullah SAW pun bangun seakan-akan terlepas daripada ikatan.  Baginda tidak memberitahu orang Yahudi itu tentang perkara itu dan Baginda tidak menunjukkan apa-apa pun di wajah Baginda.\" "
  },
  {
    "id": 18827,
    "hadith_number": 4091,
    "tajuk_hadith": "Mencegah Pencerobohan Harta",
    "perawi_melayu": "Daripada Qabus bin Mukhariq, bahawa bapanya berkata:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، فِي حَدِيثِهِ عَنْ أَبِي الأَحْوَصِ، عَنْ سِمَاكٍ، عَنْ قَابُوسَ، عَنْ أَبِيهِ، قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم ح وَأَخْبَرَنِي عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَلِيٍّ قَالَ حَدَّثَنَا خَلَفُ بْنُ تَمِيمٍ قَالَ حَدَّثَنَا أَبُو الأَحْوَصِ قَالَ حَدَّثَنَا سِمَاكُ بْنُ حَرْبٍ عَنْ قَابُوسَ بْنِ مُخَارِقٍ عَنْ أَبِيهِ قَالَ وَسَمِعْتُ سُفْيَانَ الثَّوْرِيَّ يُحَدِّثُ بِهَذَا الْحَدِيثِ قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ الرَّجُلُ يَأْتِينِي فَيُرِيدُ مَالِي ‏.‏ قَالَ ‏\"‏ ذَكِّرْهُ بِاللَّهِ ‏\"‏ ‏.‏ قَالَ فَإِنْ لَمْ يَذَّكَّرْ قَالَ ‏\"‏ فَاسْتَعِنْ عَلَيْهِ مَنْ حَوْلَكَ مِنَ الْمُسْلِمِينَ ‏\"‏ ‏.‏ قَالَ فَإِنْ لَمْ يَكُنْ حَوْلِي أَحَدٌ مِنَ الْمُسْلِمِينَ قَالَ ‏\"‏ فَاسْتَعِنْ عَلَيْهِ بِالسُّلْطَانِ ‏\"‏ ‏.‏ قَالَ فَإِنْ نَأَى السُّلْطَانُ عَنِّي قَالَ ‏\"‏ قَاتِلْ دُونَ مَالِكَ حَتَّى تَكُونَ مِنْ شُهَدَاءِ الآخِرَةِ أَوْ تَمْنَعَ مَالَكَ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Sufyan Ath-Thawri meriwayatkan hadis ini.  Beliau berkata: \"Seorang lelaki datang kepada Nabi SAW dan berkata: \"Bagaimana jika seseorang datang kepada saya dan mahu mengambil harta saya?\" Baginda SAW bersabda: \"Ingatkan dia tentang Allah.\" Lelaki itu berkata: \"Bagaimana jika dia tidak mengingatnya?\" Baginda SAW bersabda: \"Minta bantuan daripada orang Islam di sekelilingmu.\" Lelaki itu berkata: \"Bagaimana jika tiada orang Islam di sekeliling saya?\" Baginda SAW bersabda: \"Minta bantuan daripada pemerintah.\" Lelaki itu berkata: \"Bagaimana jika pemerintah jauh daripada saya?\" Baginda SAW bersabda: \"Pertahankan hartamu sehingga engkau menjadi syuhada akhirat atau engkau berjaya melindungi hartamu.\""
  },
  {
    "id": 18828,
    "hadith_number": 4092,
    "tajuk_hadith": "Menangani Pencuri: Nasihat dan Pertahanan Diri",
    "perawi_melayu": "Daripada Abu Hurairah, diriwayatkan bahawa:",
    "english_text": "\"A man came to the Messenger of Allah  and said: 'O Messenger of Allah, what do you think if someone comes to steal my wealth?' He said: 'Urge him by Allah.' He said: 'What if he persists?' He said: 'Urge him by Allah.' He said: 'What if he persists?' He said: 'Urge him by Allah.' He said: 'What if he persists?' He said: 'Then fight. If you are killed you will be in Paradise, and if you kill him, he will be in the Fire.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ الْهَادِ، عَنْ عَمْرِو بْنِ قُهَيْدٍ الْغِفَارِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ عُدِيَ عَلَى مَالِي قَالَ ‏\"‏ فَانْشُدْ بِاللَّهِ ‏\"‏ ‏.‏ قَالَ فَإِنْ أَبَوْا عَلَىَّ ‏.‏ قَالَ ‏\"‏ فَانْشُدْ بِاللَّهِ ‏\"‏ ‏.‏ قَالَ فَإِنْ أَبَوْا عَلَىَّ ‏.‏ قَالَ ‏\"‏ فَانْشُدْ بِاللَّهِ ‏\"‏ ‏.‏ قَالَ فَإِنْ أَبَوْا عَلَىَّ قَالَ ‏\"‏ فَقَاتِلْ فَإِنْ قُتِلْتَ فَفِي الْجَنَّةِ وَإِنْ قَتَلْتَ فَفِي النَّارِ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki datang kepada Rasulullah SAW dan berkata, \"Wahai Rasulullah, bagaimana pendapat tuan jika seseorang datang mencuri harta benda saya?\" Baginda menjawab, \"Tegurlah dia dengan menyebut nama Allah.\" Lelaki itu bertanya lagi, \"Bagaimana jika dia tetap berdegil?\" Baginda menjawab, \"Tegurlah dia dengan menyebut nama Allah.\" Lelaki itu bertanya lagi, \"Bagaimana jika dia tetap berdegil?\" Baginda menjawab, \"Tegurlah dia dengan menyebut nama Allah.\" Lelaki itu bertanya lagi, \"Bagaimana jika dia tetap berdegil?\" Baginda menjawab, \"Maka berperanglah! Jika engkau terbunuh, engkau akan berada di syurga, dan jika engkau membunuhnya, dia akan berada di neraka.\""
  },
  {
    "id": 18829,
    "hadith_number": 4093,
    "tajuk_hadith": "Menuntut Hak melalui Allah dan Jihad",
    "perawi_melayu": "Daripada Abu Hurairah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ، عَنْ شُعَيْبِ بْنِ اللَّيْثِ، قَالَ أَنْبَأَنَا اللَّيْثُ، عَنِ ابْنِ الْهَادِ، عَنْ قُهَيْدِ بْنِ مُطَرِّفٍ الْغِفَارِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً، جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ عُدِيَ عَلَى مَالِي قَالَ ‏\"‏ فَانْشُدْ بِاللَّهِ ‏\"‏ ‏.‏ قَالَ فَإِنْ أَبَوْا عَلَىَّ قَالَ ‏\"‏ فَانْشُدْ بِاللَّهِ ‏\"‏ ‏.‏ قَالَ فَإِنْ أَبَوْا عَلَىَّ قَالَ ‏\"‏ فَانْشُدْ بِاللَّهِ ‏\"‏ ‏.‏ قَالَ فَإِنْ أَبَوْا عَلَىَّ قَالَ ‏\"‏ فَقَاتِلْ فَإِنْ قُتِلْتَ فَفِي الْجَنَّةِ وَإِنْ قَتَلْتَ فَفِي النَّارِ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Abu Hurairah, bahawa seorang lelaki datang kepada Rasulullah SAW lalu berkata: \"Wahai Rasulullah, bagaimana jika harta saya dicuri?\" Baginda menjawab: \"Mintalah hakmu dengan menyebut nama Allah.\" Lelaki itu berkata: \"Bagaimana jika dia enggan mengembalikannya?\" Baginda menjawab: \"Mintalah hakmu dengan menyebut nama Allah.\" Lelaki itu berkata lagi: \"Bagaimana jika dia masih enggan?\" Baginda menjawab: \"Mintalah hakmu dengan menyebut nama Allah.\" Lelaki itu berkata lagi: \"Bagaimana jika dia masih enggan?\" Baginda menjawab: \"Maka berperanglah! Jika engkau terkorban, engkau akan berada di syurga. Dan jika engkau membunuhnya, dia akan berada di neraka.\""
  },
  {
    "id": 18830,
    "hadith_number": 4094,
    "tajuk_hadith": "Syahid yang Mempertahankan Harta",
    "perawi_melayu": "Daripada Abdullah bin Amr, beliau berkata:",
    "english_text": "\"I heard the Messenger of Allah  say: 'Whoever fights to protect his wealth and is killed, he is a martyr.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا حَاتِمٌ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ قَاتَلَ دُونَ مَالِهِ فَقُتِلَ فَهُوَ شَهِيدٌ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda: \"Barangsiapa yang berperang mempertahankan hartanya lalu terbunuh, maka dia adalah syahid.\""
  },
  {
    "id": 18831,
    "hadith_number": 4095,
    "tajuk_hadith": "Syahid yang Mempertahankan Harta",
    "perawi_melayu": "Daripada Abdullah bin 'Amr, beliau berkata:",
    "english_text": "\"I heard the Messenger of Allah  say: 'Whoever fights to protect his wealth and is killed, he is a martyr.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ، قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ أَبِي يُونُسَ الْقُشَيْرِيِّ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ صَفْوَانَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ قَاتَلَ دُونَ مَالِهِ فَقُتِلَ فَهُوَ شَهِيدٌ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda: \"Barangsiapa yang berperang mempertahankan hartanya lalu terbunuh, maka dia adalah syahid.\""
  },
  {
    "id": 18832,
    "hadith_number": 4096,
    "tajuk_hadith": "Syurga Bagi Mereka Yang Terbunuh Ketika Membela Harta Mereka",
    "perawi_melayu": "Daripada Abdullah bin 'Amr bin Al-'As bahawa:",
    "english_text": "The Messenger of Allah  said: \"Whoever is killed defending his wealth and is killed unjustly, Paradise will be his.\"",
    "arabic_text": "أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ فَضَالَةَ بْنِ إِبْرَاهِيمَ النَّيْسَابُورِيُّ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، قَالَ حَدَّثَنَا سَعِيدٌ، قَالَ أَنْبَأَنَا أَبُو الأَسْوَدِ، مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ عِكْرِمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ قُتِلَ دُونَ مَالِهِ مَظْلُومًا فَلَهُ الْجَنَّةُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Barang siapa yang terbunuh ketika mempertahankan hartanya secara zalim, maka syurgalah tempatnya.\""
  },
  {
    "id": 18833,
    "hadith_number": 4097,
    "tajuk_hadith": "Syahid yang Mempertahankan Harta",
    "perawi_melayu": "Daripada Abdullah bin Amr, katanya:",
    "english_text": "\"The Messenger of Allah  said: 'Whoever is killed defending his wealth, he is a martyr.'\"",
    "arabic_text": "أَخْبَرَنَا جَعْفَرُ بْنُ مُحَمَّدِ بْنِ الْهُذَيْلِ، قَالَ حَدَّثَنَا عَاصِمُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا سُعَيْرُ بْنُ الْخِمْسِ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَسَنِ، عَنْ عِكْرِمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Abdullah bin Amr, katanya: Rasulullah SAW bersabda: \"Barangsiapa yang terbunuh ketika mempertahankan hartanya, maka dia adalah syahid.\""
  },
  {
    "id": 18834,
    "hadith_number": 4098,
    "tajuk_hadith": "Syahid yang Mempertahankan Harta",
    "perawi_melayu": "Daripada Ibrahim bin Muhammad bin Talhah yang mendengar Abdullah bin 'Amr meriwayatkan:",
    "english_text": "From the Prophet , that he said: \"If a person's wealth is sought without right, and he fights (to protect it) and is killed, he is a martyr.\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ حَسَنٍ، عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ طَلْحَةَ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عَمْرٍو، يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ أُرِيدَ مَالُهُ بِغَيْرِ حَقٍّ فَقَاتَلَ فَقُتِلَ فَهُوَ شَهِيدٌ ‏\"‏ ‏.‏ هَذَا خَطَأٌ وَالصَّوَابُ حَدِيثُ سُعَيْرِ بْنِ الْخِمْسِ ‏.‏",
    "malay_translation": "Daripada Nabi SAW, bahawa baginda bersabda: \"Barang siapa hartanya dituntut tanpa hak, lalu dia berperang (mempertahankan harta itu) dan terbunuh, maka dia adalah syahid.\""
  },
  {
    "id": 18835,
    "hadith_number": 4099,
    "tajuk_hadith": "Syahid yang Mempertahankan Harta",
    "perawi_melayu": "Daripada Abdullah bin Amr, ia berkata:",
    "english_text": "\"The Messenger of Allah  said: 'Whoever is killed defending his wealth, he is a martyr.'\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَسَنِ، عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ طَلْحَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Abdullah bin Amr, beliau berkata bahawa Rasulullah SAW bersabda: \"Sesiapa yang terbunuh ketika mempertahankan hartanya, maka dia adalah seorang syahid.\""
  },
  {
    "id": 18836,
    "hadith_number": 4100,
    "tajuk_hadith": "Syahid yang Membela Harta",
    "perawi_melayu": "Daripada Said bin Zaid, bahawa:",
    "english_text": "The Prophet  said: \"Whoever is killed defending his wealth, he is a martyr.\" This is an abridgement of it.",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَقُتَيْبَةُ، - وَاللَّفْظُ لإِسْحَاقَ - قَالاَ أَنْبَأَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَوْفٍ، عَنْ سَعِيدِ بْنِ زَيْدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Barang siapa yang terbunuh ketika mempertahankan hartanya, maka dia adalah seorang syahid.\"  (Ini adalah ringkasan hadis)."
  },
  {
    "id": 18837,
    "hadith_number": 4101,
    "tajuk_hadith": "Syahid yang Membela Harta",
    "perawi_melayu": "Daripada Said bin Zaid, diriwayatkan bahawa:",
    "english_text": "The Prophet  said: \"Whoever is killed defending his wealth, he is a martyr.\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَبْدَةُ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ، عَنِ الزُّهْرِيِّ، عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَوْفٍ، عَنْ سَعِيدِ بْنِ زَيْدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ قَاتَلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Barangsiapa yang terbunuh ketika mempertahankan hartanya, maka dia adalah seorang syahid.\""
  },
  {
    "id": 18838,
    "hadith_number": 4102,
    "tajuk_hadith": "Syahid yang Mempertahankan Harta",
    "perawi_melayu": "Daripada Sulaiman bin Buraidah daripada bapanya yang berkata:",
    "english_text": "\"The Messenger of Allah  said: 'Whoever is killed defending his wealth, he is a martyr.'\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا الْمُؤَمَّلُ، عَنْ سُفْيَانَ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Barangsiapa yang terbunuh ketika mempertahankan hartanya, maka dia adalah seorang syahid.\""
  },
  {
    "id": 18839,
    "hadith_number": 4103,
    "tajuk_hadith": "Syahid yang Mempertahankan Harta",
    "perawi_melayu": "Daripada Abu Ja'far, katanya:",
    "english_text": "\"The Messenger of Allah  said: 'Whoever is killed defending his wealth and is killed unjustly, he is a martyr.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَلْقَمَةَ، عَنْ أَبِي جَعْفَرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ قُتِلَ دُونَ مَظْلَمَتِهِ فَهُوَ شَهِيدٌ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ حَدِيثُ الْمُؤَمَّلِ خَطَأٌ وَالصَّوَابُ حَدِيثُ عَبْدِ الرَّحْمَنِ ‏.‏",
    "malay_translation": "Daripada Abu Ja'far, katanya: Rasulullah SAW bersabda:  \"Sesiapa yang terbunuh mempertahankan hartanya dan dibunuh secara zalim, maka dia adalah syahid.\""
  },
  {
    "id": 18840,
    "hadith_number": 4104,
    "tajuk_hadith": "Syahid yang Mempertahankan Harta, Diri, dan Keluarga",
    "perawi_melayu": "Daripada Said bin Zaid bahawa:",
    "english_text": "The Prophet  said: \"Whoever fights to protect his wealth and is killed, he is a martyr. Whoever fights to protect himself, he is a martyr. Whoever fights to protect his family is a martyr.\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ أَبِي عُبَيْدَةَ بْنِ مُحَمَّدٍ، عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَوْفٍ، عَنْ سَعِيدِ بْنِ زَيْدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ قَاتَلَ دُونَ مَالِهِ فَقُتِلَ فَهُوَ شَهِيدٌ وَمَنْ قَاتَلَ دُونَ دَمِهِ فَهُوَ شَهِيدٌ وَمَنْ قَاتَلَ دُونَ أَهْلِهِ فَهُوَ شَهِيدٌ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Barangsiapa yang berperang mempertahankan hartanya lalu terbunuh, maka dia adalah syahid. Barangsiapa yang berperang mempertahankan dirinya lalu terbunuh, maka dia adalah syahid. Barangsiapa yang berperang mempertahankan keluarganya lalu terbunuh, maka dia adalah syahid.\""
  },
  {
    "id": 18841,
    "hadith_number": 4105,
    "tajuk_hadith": "Syahid yang Mempertahankan Harta, Keluarga, Agama, dan Diri",
    "perawi_melayu": "Daripada Said bin Zaid, katanya:",
    "english_text": "\"The Messenger of Allah  said: 'Whoever is killed protecting his wealth, he is a martyr. Whoever is killed protecting his family, he is a martyr. Whoever is killed protecting his religion, he is a martyr. Whoever is killed protecting himself, is a martyr.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، وَمُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالاَ حَدَّثَنَا سُلَيْمَانُ، - يَعْنِي ابْنَ دَاوُدَ - الْهَاشِمِيُّ قَالَ حَدَّثَنَا إِبْرَاهِيمُ، عَنْ أَبِيهِ، عَنْ أَبِي عُبَيْدَةَ بْنِ مُحَمَّدِ بْنِ عَمَّارِ بْنِ يَاسِرٍ، عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَوْفٍ، عَنْ سَعِيدِ بْنِ زَيْدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ وَمَنْ قُتِلَ دُونَ أَهْلِهِ فَهُوَ شَهِيدٌ وَمَنْ قُتِلَ دُونَ دِينِهِ فَهُوَ شَهِيدٌ وَمَنْ قُتِلَ دُونَ دَمِهِ فَهُوَ شَهِيدٌ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: “Barangsiapa yang terbunuh mempertahankan hartanya, maka dia seorang syahid. Barangsiapa yang terbunuh mempertahankan keluarganya, maka dia seorang syahid. Barangsiapa yang terbunuh mempertahankan agamanya, maka dia seorang syahid. Barangsiapa yang terbunuh mempertahankan dirinya, maka dia seorang syahid.”"
  },
  {
    "id": 18842,
    "hadith_number": 4106,
    "tajuk_hadith": "Syahid yang Membela Diri",
    "perawi_melayu": "Dari Abu Ja'far, diriwayatkan bahawa:",
    "english_text": "\"I was sitting with Suwaid bin Muqarrin, and he said: The Messenger of Allah  said: \"Whoever is killed defending himself against injustice, he is a martyr.\"",
    "arabic_text": "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الأَشْعَثِيُّ، قَالَ حَدَّثَنَا عَبْثَرٌ، عَنْ مُطَرِّفٍ، عَنْ سَوَادَةَ بْنِ أَبِي الْجَعْدِ، عَنْ أَبِي جَعْفَرٍ، قَالَ كُنْتُ جَالِسًا عِنْدَ سُوَيْدِ بْنِ مُقَرِّنٍ فَقَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ قُتِلَ دُونَ مَظْلَمَتِهِ فَهُوَ شَهِيدٌ ‏\"‏ ‏.‏",
    "malay_translation": "Aku sedang duduk bersama Suwaid bin Muqarrin, lalu dia berkata: Rasulullah SAW bersabda: \"Barangsiapa yang terbunuh ketika mempertahankan dirinya daripada kezaliman, maka dia adalah seorang syahid.\""
  },
  {
    "id": 18843,
    "hadith_number": 4107,
    "tajuk_hadith": "Hukum Mengeluarkan Pedang dan Menyerang Orang",
    "perawi_melayu": "Daripada Ibnu Az-Zubair bahawa:",
    "english_text": "The Messenger of Allah  said: \"Whoever unsheathes his sword and starts to strike the people with it, it is permissible to shed his blood.\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ الزُّبَيْرِ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ شَهَرَ سَيْفَهُ ثُمَّ وَضَعَهُ فَدَمُهُ هَدَرٌ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Barang siapa yang mencabut kerisnya dan mula menyerang orang ramai dengannya, maka halal darahnya.\" "
  },
  {
    "id": 18844,
    "hadith_number": 4108,
    "tajuk_hadith": "Riwayat Abdur-Razzaq: Laporan Serupa Tanpa Sanad Kepada Nabi",
    "perawi_melayu": "Riwayat Abdur-Razzaq:",
    "english_text": "'Abdur-Razzaq narrated a similar report with the same chain, but he did not attribute it to the Prophet",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، بِهَذَا الإِسْنَادِ مِثْلَهُ وَلَمْ يَرْفَعْهُ ‏.‏",
    "malay_translation": "Abdur-Razzaq meriwayatkan laporan yang serupa dengan sanad yang sama, tetapi beliau tidak mensandarkannya kepada Nabi."
  },
  {
    "id": 18845,
    "hadith_number": 4109,
    "tajuk_hadith": "Hukum Membunuh Orang yang Menyerang dengan Senjata",
    "perawi_melayu": "Daripada Ibnu Az-Zubair, katanya:",
    "english_text": "\"Whoever wields a weapon and starts to strike (the people) with it, it is permissible to shed his blood.\"",
    "arabic_text": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ الزُّبَيْرِ، قَالَ مَنْ رَفَعَ السِّلاَحَ ثُمَّ وَضَعَهُ فَدَمُهُ هَدَرٌ ‏.‏",
    "malay_translation": "Daripada Ibnu Az-Zubair, katanya: \"Barangsiapa yang mengangkat senjata lalu menyerang orang ramai dengannya, maka halal darahnya.\" "
  },
  {
    "id": 18846,
    "hadith_number": 4110,
    "tajuk_hadith": "Mereka yang Membawa Senjata Melawan Kita Bukanlah dari Kalangan Kita",
    "perawi_melayu": "Daripada Abdullah bin Umar, bahawa:",
    "english_text": "The Prophet  said: \"Whoever bears weapons against us, he is not one of us.\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي مَالِكٌ، وَعَبْدُ اللَّهِ بْنُ عُمَرَ، وَأُسَامَةُ بْنُ زَيْدٍ، وَيُونُسُ بْنُ يَزِيدَ، أَنَّ نَافِعًا، أَخْبَرَهُمْ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ حَمَلَ عَلَيْنَا السِّلاَحَ فَلَيْسَ مِنَّا ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Abdullah bin Umar, bahawa Nabi SAW bersabda:  \"Barangsiapa yang mengangkat senjata terhadap kita, maka dia bukanlah daripada kalangan kita.\""
  },
  {
    "id": 18847,
    "hadith_number": 4111,
    "tajuk_hadith": "Mengenai Golongan yang Membaca Al-Quran tetapi Tidak Mendalam dan Pengkhianatan Mereka",
    "perawi_melayu": "Daripada Abu Said al-Khudri r.a.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَنْبَأَنَا الثَّوْرِيُّ، عَنْ أَبِيهِ، عَنِ ابْنِ أَبِي نُعْمٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ بَعَثَ عَلِيٌّ إِلَى النَّبِيِّ صلى الله عليه وسلم وَهُوَ بِالْيَمَنِ بِذُهَيْبَةٍ فِي تُرْبَتِهَا فَقَسَمَهَا بَيْنَ الأَقْرَعِ بْنِ حَابِسٍ الْحَنْظَلِيِّ ثُمَّ أَحَدِ بَنِي مُجَاشِعٍ وَبَيْنَ عُيَيْنَةَ بْنِ بَدْرٍ الْفَزَارِيِّ وَبَيْنَ عَلْقَمَةَ بْنِ عُلاَثَةَ الْعَامِرِيِّ ثُمَّ أَحَدِ بَنِي كِلاَبٍ وَبَيْنَ زَيْدِ الْخَيْلِ الطَّائِيِّ ثُمَّ أَحَدَ بَنِي نَبْهَانَ - قَالَ - فَغَضِبَتْ قُرَيْشٌ وَالأَنْصَارُ وَقَالُوا يُعْطِي صَنَادِيدَ أَهْلِ نَجْدٍ وَيَدَعُنَا فَقَالَ ‏\"‏ إِنَّمَا أَتَأَلَّفُهُمْ ‏\"‏ ‏.‏ فَأَقْبَلَ رَجُلٌ غَائِرَ الْعَيْنَيْنِ نَاتِئَ الْوَجْنَتَيْنِ كَثَّ اللِّحْيَةِ مَحْلُوقَ الرَّأْسِ فَقَالَ يَا مُحَمَّدُ اتَّقِ اللَّهَ قَالَ ‏\"‏ مَنْ يُطِعِ اللَّهَ إِذَا عَصَيْتُهُ أَيَأْمَنُنِي عَلَى أَهْلِ الأَرْضِ وَلاَ تَأْمَنُونِي ‏\"‏ ‏.‏ فَسَأَلَ رَجُلٌ مِنَ الْقَوْمِ قَتْلَهُ فَمَنَعَهُ فَلَمَّا وَلَّى قَالَ ‏\"‏ إِنَّ مِنْ ضِئْضِئِ هَذَا قَوْمًا يَخْرُجُونَ يَقْرَءُونَ الْقُرْآنَ لاَ يُجَاوِزُ حَنَاجِرَهُمْ يَمْرُقُونَ مِنَ الدِّينِ مُرُوقَ السَّهْمِ مِنَ الرَّمِيَّةِ يَقْتُلُونَ أَهْلَ الإِسْلاَمِ وَيَدَعُونَ أَهْلَ الأَوْثَانِ لَئِنْ أَنَا أَدْرَكْتُهُمْ لأَقْتُلَنَّهُمْ قَتْلَ عَادٍ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Mahmud bin Ghailan, katanya; Telah menceritakan kepada kami Abdur Razzaq, katanya; Telah memberitakan kepada kami Tsauri, daripada bapanya, daripada Ibnu Abu Nu'aim, daripada Abu Said al-Khudri r.a., katanya: Ali telah menghantar kepada Nabi SAW ketika baginda berada di Yaman sebahagian emas yang masih berada dalam batu. Lalu baginda membahagikannya di antara al-Aqra' bin Habis al-Hanthali, kemudian seorang daripada Bani Mujasiah, dan di antara Uyainah bin Badr al-Fazari, dan di antara Alqamah bin Ulatsah al-Amiri, kemudian seorang daripada Bani Kilab, dan di antara Zaid al-Khayl al-Tha'i, kemudian seorang daripada Bani Nabhan.  Maka marahlah Quraisy dan Ansar, dan mereka berkata: “Baginda memberi kepada para pemimpin penduduk Najd dan meninggalkan kami.” Maka baginda bersabda: “Sesungguhnya aku hanya ingin menyatukan mereka.” Lalu datang seorang lelaki yang matanya tenggelam, pipinya menonjol, berjanggut lebat dan kepalanya botak.  Lalu dia berkata: “Wahai Muhammad, bertaqwalah kepada Allah.”  Baginda bersabda:  “Siapakah yang mentaati Allah apabila aku menderhaka? Adakah kamu akan merasa aman terhadapku, terhadap penduduk bumi, sedangkan kamu tidak akan merasa aman kepadaku?”  Lalu seorang lelaki daripada kaum itu meminta izin untuk membunuhnya, lalu baginda melarangnya.  Setelah dia pergi, baginda bersabda:  “Sesungguhnya daripada keturunan orang ini akan keluar suatu kaum yang akan membaca Al-Quran tetapi tidak melampaui kerongkong mereka. Mereka akan keluar daripada agama Islam seperti anak panah yang keluar daripada sasaran. Mereka membunuh umat Islam dan membiarkan orang-orang musyrik.  Sekiranya aku sempat bertemu dengan mereka, nescaya aku akan membunuh mereka seperti pembunuhan kaum ‘Ad.”"
  },
  {
    "id": 18848,
    "hadith_number": 4112,
    "tajuk_hadith": "Pemuda Akhir Zaman yang Murtad",
    "perawi_melayu": "Daripada Ali r.a.",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ خَيْثَمَةَ، عَنْ سُوَيْدِ بْنِ غَفَلَةَ، عَنْ عَلِيٍّ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ يَخْرُجُ قَوْمٌ فِي آخِرِ الزَّمَانِ أَحْدَاثُ الأَسْنَانِ سُفَهَاءُ الأَحْلاَمِ يَقُولُونَ مِنْ خَيْرِ قَوْلِ الْبَرِيَّةِ لاَ يُجَاوِزُ إِيمَانُهُمْ حَنَاجِرَهُمْ يَمْرُقُونَ مِنَ الدِّينِ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ فَإِذَا لَقِيتُمُوهُمْ فَاقْتُلُوهُمْ فَإِنَّ قَتْلَهُمْ أَجْرٌ لِمَنْ قَتَلَهُمْ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Basysyar, katanya; telah menceritakan kepada kami Abdurrahman, katanya; telah menceritakan kepada kami Sufyan dari Al-A'masy dari Khaitsamah dari Suwaid bin Ghafilah dari Ali r.a., katanya; aku mendengar Rasulullah SAW bersabda: \"Akan keluar segolongan manusia di akhir zaman, mereka masih muda belia, tetapi lemah akalnya. Mereka mengucapkan kata-kata yang baik, tetapi keimanan mereka tidak sampai ke hati mereka. Mereka keluar dari agama Islam sebagaimana anak panah keluar dari busurnya. Jika kamu bertemu mereka, maka bunuhlah mereka, kerana membunuh mereka adalah satu ganjaran bagi orang yang membunuhnya pada hari kiamat.\" "
  },
  {
    "id": 18849,
    "hadith_number": 4113,
    "tajuk_hadith": "Hadis Mengenai Khawarij",
    "perawi_melayu": "Daripada riwayat Syarik bin Syihab:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ الْبَصْرِيُّ الْحَرَّانِيُّ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنِ الأَزْرَقِ بْنِ قَيْسٍ، عَنْ شَرِيكِ بْنِ شِهَابٍ، قَالَ كُنْتُ أَتَمَنَّى أَنْ أَلْقَى، رَجُلاً مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم أَسْأَلُهُ عَنِ الْخَوَارِجِ فَلَقِيتُ أَبَا بَرْزَةَ فِي يَوْمِ عِيدٍ فِي نَفَرٍ مِنْ أَصْحَابِهِ فَقُلْتُ لَهُ هَلْ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَذْكُرُ الْخَوَارِجَ فَقَالَ نَعَمْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم بِأُذُنِي وَرَأَيْتُهُ بِعَيْنِي أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمَالٍ فَقَسَمَهُ فَأَعْطَى مَنْ عَنْ يَمِينِهِ وَمَنْ عَنْ شِمَالِهِ وَلَمْ يُعْطِ مَنْ وَرَاءَهُ شَيْئًا فَقَامَ رَجُلٌ مِنْ وَرَائِهِ فَقَالَ يَا مُحَمَّدُ مَا عَدَلْتَ فِي الْقِسْمَةِ ‏.‏ رَجُلٌ أَسْوَدُ مَطْمُومُ الشَّعْرِ عَلَيْهِ ثَوْبَانِ أَبْيَضَانِ فَغَضِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم غَضَبًا شَدِيدًا وَقَالَ ‏\"‏ وَاللَّهِ لاَ تَجِدُونَ بَعْدِي رَجُلاً هُوَ أَعْدَلُ مِنِّي ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ يَخْرُجُ فِي آخِرِ الزَّمَانِ قَوْمٌ كَأَنَّ هَذَا مِنْهُمْ يَقْرَءُونَ الْقُرْآنَ لاَ يُجَاوِزُ تَرَاقِيَهُمْ يَمْرُقُونَ مِنَ الإِسْلاَمِ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ سِيمَاهُمُ التَّحْلِيقُ لاَ يَزَالُونَ يَخْرُجُونَ حَتَّى يَخْرُجَ آخِرُهُمْ مَعَ الْمَسِيحِ الدَّجَّالِ فَإِذَا لَقِيتُمُوهُمْ فَاقْتُلُوهُمْ هُمْ شَرُّ الْخَلْقِ وَالْخَلِيقَةِ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ رَحِمَهُ اللَّهُ شَرِيكُ بْنُ شِهَابٍ لَيْسَ بِذَلِكَ الْمَشْهُورِ ‏.‏",
    "malay_translation": "Dikhabarkan kepada kami oleh Muhammad bin Ma'mar al-Basri al-Harrani, katanya:  Diriwayatkan kepada kami oleh Abu Daud al-Tayalisi, katanya: Diriwayatkan kepada kami oleh Hammad bin Salamah, daripada Az-Zuraq bin Qais, daripada Syarik bin Syihab, katanya:  Aku pernah berharap dapat bertemu dengan seorang daripada sahabat Nabi ﷺ untuk bertanya kepadanya tentang Khawarij. Kemudian aku bertemu dengan Abu Barzah pada hari raya bersama beberapa orang sahabatnya.  Aku bertanya kepadanya: “Adakah engkau pernah mendengar Rasulullah ﷺ menyebut tentang Khawarij?” Katanya: “Ya, aku telah mendengar Rasulullah ﷺ dengan telingaku sendiri dan melihatnya dengan mataku sendiri.  Rasulullah ﷺ diberikan harta, lalu baginda membahagikannya. Baginda memberi kepada orang yang berada di sebelah kanan dan kiri baginda, tetapi tidak memberi kepada orang yang berada di belakang baginda.  Maka berdirilah seorang lelaki di belakang baginda lalu berkata:  ‘Wahai Muhammad, engkau tidak adil dalam pembahagian.’  Lelaki itu berkulit hitam, rambutnya pendek, dan memakai dua helai baju putih.  Lalu Rasulullah ﷺ sangat marah dan berkata:  ‘Demi Allah! Sesungguhnya kamu tidak akan menemui sesiapa selepasku yang lebih adil daripada aku.’  Kemudian baginda berkata:  ‘Pada akhir zaman akan muncul sekumpulan manusia, seakan-akan mereka ini, membaca al-Quran tetapi ia tidak melepasi kerongkong mereka. Mereka keluar daripada Islam seperti anak panah yang meleset daripada sasaran. Ciri-ciri mereka ialah mencukur (rambut). Mereka akan terus muncul sehingga yang terakhir daripada mereka keluar bersama al-Masih ad-Dajjal.  Maka apabila kamu bertemu dengan mereka, bunuhlah mereka, kerana mereka adalah makhluk yang paling jahat.’  Abu Abdur Rahman – semoga Allah merahmatinya – berkata, Syarik bin Syihab berkata:  Ini bukan perkara yang masyhur."
  },
  {
    "id": 18850,
    "hadith_number": 4114,
    "tajuk_hadith": "Perang terhadap Muslim Adalah Kefir dan Mencela Adalah Kejahatan",
    "perawi_melayu": "Sa'd bin Abi Waqas telah meriwayatkan bahawa:",
    "english_text": "The Messenger of Allah  said: \"Fighting a Muslim is Kufr and defaming him is evildoing.\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنْ أَبِي إِسْحَاقَ، عَنْ عُمَرَ بْنِ سَعْدٍ، قَالَ حَدَّثَنَا سَعْدُ بْنُ أَبِي وَقَّاصٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ قِتَالُ الْمُسْلِمِ كُفْرٌ وَسِبَابُهُ فُسُوقٌ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Perang terhadap seorang Muslim adalah kufur, dan mencelanya adalah satu perbuatan fasik.\""
  },
  {
    "id": 18851,
    "hadith_number": 4115,
    "tajuk_hadith": "Mencela Muslim Adalah Kejahatan, Memperanginya Adalah Kefasikan",
    "perawi_melayu": "Dari Abdullah r.a. diriwayatkan bahawa:",
    "english_text": "\"Defaming a Muslim is evildoing and fighting him is Kufr.\" (Sahih Mawquf)",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ أَبَا الأَحْوَصِ، عَنْ عَبْدِ اللَّهِ، قَالَ سِبَابُ الْمُسْلِمِ فُسُوقٌ وَقِتَالُهُ كُفْرٌ ‏.‏",
    "malay_translation": "Daripada Abdullah r.a., Baginda berkata: “Mencela seorang Muslim adalah satu perbuatan fasik dan memeranginya adalah kufur.” (Sahih Mawquf)"
  },
  {
    "id": 18852,
    "hadith_number": 4116,
    "tajuk_hadith": "Mencela Muslim Adalah Kejahatan dan Memperanginya Adalah Kefasikan",
    "perawi_melayu": "Ia diriwayatkan daripada Syu'bah, daripada Abu Ishaq yang berkata:",
    "english_text": "\"I heard Abu Al-Ahwas (narrate) that 'Abdullah said: 'Defaming a Muslim is evildoing and fighting him is Kufr.'\" So Aban said to him: \"O Abu Ishaq! You heard it only from Abu Al-Ahwas?\" He said: \"Rather, I heard it from Al-Aswad and Hubairah.\"",
    "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ حَكِيمٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ شُعْبَةَ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي الأَحْوَصِ، عَنْ عَبْدِ اللَّهِ، قَالَ سِبَابُ الْمُسْلِمِ فِسْقٌ وَقِتَالُهُ كُفْرٌ ‏.‏ فَقَالَ لَهُ أَبَانُ يَا أَبَا إِسْحَاقَ أَمَا سَمِعْتَهُ إِلاَّ مِنْ أَبِي الأَحْوَصِ قَالَ بَلْ سَمِعْتُهُ مِنَ الأَسْوَدِ وَهُبَيْرَةَ ‏.‏",
    "malay_translation": "Aku mendengar daripada Abu al-Ahwas (bercerita) bahawa Abdullah berkata: “Mencela seorang Muslim adalah perbuatan fasik dan memeranginya adalah kufur.” Maka Aban berkata kepadanya: “Wahai Abu Ishaq! Adakah engkau hanya mendengarnya daripada Abu al-Ahwas sahaja?” Dia berkata: “Bahkan, aku mendengarnya daripada al-Aswad dan Hubairah.”"
  },
  {
    "id": 18853,
    "hadith_number": 4117,
    "tajuk_hadith": "Menghina Muslim Adalah Kejahatan dan Memperanginya Adalah Kefir",
    "perawi_melayu": "Daripada Abdullah, baginda berkata:",
    "english_text": "\"Defaming a Muslim is evildoing and fighting him is Kufr.\" (Sahih Mawquf)",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي الزَّعْرَاءِ، عَنْ عَمِّهِ أَبِي الأَحْوَصِ، عَنْ عَبْدِ اللَّهِ، قَالَ سِبَابُ الْمُسْلِمِ فُسُوقٌ وَقِتَالُهُ كُفْرٌ ‏.‏",
    "malay_translation": "Abdullah berkata: “Menghina seorang Muslim adalah perbuatan fasik, dan memeranginya adalah kufur.” (Sahih Mawquf)"
  },
  {
    "id": 18854,
    "hadith_number": 4118,
    "tajuk_hadith": "Mencela Muslim Adalah Kejahatan dan Memperanginya Adalah Kefasikan",
    "perawi_melayu": "Daripada Ibnu Abdur Rahman, daripada bapanya,",
    "english_text": "The Messenger of Allah  said: \"Defaming a Muslim is evildoing and fighting him is Kufr.\"",
    "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، قَالَ حَدَّثَنَا أَبِي قَالَ، سَمِعْتُ عَبْدَ الْمَلِكِ بْنَ عُمَيْرٍ، يُحَدِّثُهُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ سِبَابُ الْمُسْلِمِ فُسُوقٌ وَقِتَالُهُ كُفْرٌ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Mencela seorang Muslim adalah satu kejahatan, dan memeranginya adalah kufur.\""
  },
  {
    "id": 18855,
    "hadith_number": 4119,
    "tajuk_hadith": "Mencaci Muslim Adalah Kejahatan dan Memperanginya Adalah Kefasikan",
    "perawi_melayu": "Daripada Syu'bah yang berkata:",
    "english_text": "\"I said to Hammad: 'I heard Mansur, and Sulaiman, and Zubaid narrating from Abu Wa'il, from 'Abdullah, that the Messenger of Allah  said: \"Defaming a Muslim is evildoing and fighting him is Kufr.\" - Who are you worried about? Are you worried about Mansur? Are you worried about Zubaid? Are you worried about Sulaiman?' He said: 'No, but I am worried about Abu Wa'il.'\"",
    "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ قُلْتُ لِحَمَّادٍ سَمِعْتُ مَنْصُورًا، وَسُلَيْمَانَ، وَزُبَيْدًا، يُحَدِّثُونَ عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ سِبَابُ الْمُسْلِمِ فُسُوقٌ وَقِتَالُهُ كُفْرٌ ‏\"‏ ‏.‏ مَنْ تَتَّهِمُ أَتَتَّهِمُ مَنْصُورًا أَتَتَّهِمُ زُبَيْدًا أَتَتَّهِمُ سُلَيْمَانَ قَالَ لاَ وَلَكِنِّي أَتَّهِمُ أَبَا وَائِلٍ ‏.‏",
    "malay_translation": "Aku berkata kepada Hammad: 'Aku mendengar Mansur, Sulaiman, dan Zubaid meriwayatkan daripada Abu Wa'il, daripada Abdullah, bahawa Rasulullah SAW bersabda: \"Mencaci seorang Muslim adalah perbuatan fasik dan memeranginya adalah kufur.\"  - Siapakah yang kamu bimbangkan? Adakah kamu bimbangkan Mansur? Adakah kamu bimbangkan Zubaid? Adakah kamu bimbangkan Sulaiman?' Dia berkata: 'Tidak, tetapi aku bimbangkan Abu Wa'il.'"
  },
  {
    "id": 18856,
    "hadith_number": 4120,
    "tajuk_hadith": "Mencela Muslim Adalah Kejahatan dan Memperanginya Adalah Kefir",
    "perawi_melayu": "Daripada Sufyan bin Zubaid, daripada Abu Wa'il, daripada Abdullah:",
    "english_text": "\"The Messenger of Allah  said: 'Defaming a Muslim is evildoing and fighting him is Kufr.'\" I said to Abu Wa'il: \"Did you hear it from 'Abdullah?\" He said: \"Yes.\"",
    "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا وَكِيعٌ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ زُبَيْدٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ سِبَابُ الْمُسْلِمِ فُسُوقٌ وَقِتَالُهُ كُفْرٌ ‏\"‏ ‏.‏ قُلْتُ لأَبِي وَائِلٍ سَمِعْتَهُ مِنْ عَبْدِ اللَّهِ قَالَ نَعَمْ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: “Mencela seorang Muslim adalah perbuatan fasik, dan memeranginya adalah kufur.”  Aku berkata kepada Abu Wa'il: “Adakah engkau mendengarnya daripada Abdullah?” Jawabnya: “Ya.”"
  },
  {
    "id": 18857,
    "hadith_number": 4121,
    "tajuk_hadith": "Mencela Muslim Adalah Kejahatan, Memeranginya Adalah Kefasikan",
    "perawi_melayu": "Daripada Abdullah, baginda berkata:",
    "english_text": "\"The Messenger of Allah  said: 'Defaming a Muslim is evildoing and fighting him is Kufr.'\"",
    "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا مُعَاوِيَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ سِبَابُ الْمُسْلِمِ فُسُوقٌ وَقِتَالُهُ كُفْرٌ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Mencela seorang Muslim adalah perbuatan fasik, dan memeranginya adalah kufur.\""
  },
  {
    "id": 18858,
    "hadith_number": 4122,
    "tajuk_hadith": "Mencela Muslim Adalah Kejahatan dan Memperanginya Adalah Kefasikan",
    "perawi_melayu": "Ia telah diriwayatkan bahawa Abu Wa'il berkata:",
    "english_text": "'Abdullah said: 'Defaming a Muslim is evildoing and fighting him is Kufr.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، قَالَ قَالَ عَبْدُ اللَّهِ سِبَابُ الْمُسْلِمِ فُسُوقٌ وَقِتَالُهُ كُفْرٌ ‏.‏",
    "malay_translation": "Abdullah berkata: “Mencela seorang Muslim adalah perbuatan fasik, dan memeranginya adalah kufur.”"
  },
  {
    "id": 18859,
    "hadith_number": 4123,
    "tajuk_hadith": "Perang Melawan Orang Beriman Adalah Kefir, Mencaci Adalah Kejahatan",
    "perawi_melayu": "Daripada Abdullah, katanya:",
    "english_text": "\"Fighting a believer is Kufr and defaming him is evildoing.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، عَنْ أَبِي مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قِتَالُ الْمُؤْمِنِ كُفْرٌ وَسِبَابُهُ فُسُوقٌ ‏.‏",
    "malay_translation": "Daripada Abdullah, katanya:  “Menegaskan orang yang beriman adalah kufur dan mencaci maki adalah satu kejahatan.”"
  },
  {
    "id": 18860,
    "hadith_number": 4124,
    "tajuk_hadith": "Mengenai Kehidupan Yang Mengabaikan Ketaatan dan Perpecahan dalam Ummah",
    "perawi_melayu": "Dikisahkan oleh Abu Hurairah bahawa:",
    "english_text": "\"The Messenger of Allah  said: 'Whoever parts from obedience, and splits away from the Jama'ah and dies, then he has died a death of Jahiliyyah. Whoever rebels against my Ummah, killing good and evil people alike, and does not try to avoid killing the believers, and does not pay attention to those who are under a covenant, then he is not of me. Whoever fights for a cause that is not clear, advocating tribalism, getting angry for the sake of tribalism, and he is killed, then he has died a death of Jahiliyyah.'\"",
    "arabic_text": "أَخْبَرَنَا بِشْرُ بْنُ هِلاَلٍ الصَّوَّافُ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ غَيْلاَنَ بْنِ جَرِيرٍ، عَنْ زِيَادِ بْنِ رَبَاحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ خَرَجَ مِنَ الطَّاعَةِ وَفَارَقَ الْجَمَاعَةَ فَمَاتَ مَاتَ مِيتَةً جَاهِلِيَّةً وَمَنْ خَرَجَ عَلَى أُمَّتِي يَضْرِبُ بَرَّهَا وَفَاجِرَهَا لاَ يَتَحَاشَى مِنْ مُؤْمِنِهَا وَلاَ يَفِي لِذِي عَهْدِهَا فَلَيْسَ مِنِّي وَمَنْ قَاتَلَ تَحْتَ رَايَةٍ عُمِّيَّةٍ يَدْعُو إِلَى عَصَبِيَّةٍ أَوْ يَغْضَبُ لِعَصَبِيَّةٍ فَقُتِلَ فَقِتْلَةٌ جَاهِلِيَّةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Utusan Allah s.a.w bersabda, \"Barangsiapa yang keluar dari ketaatan dan meninggalkan jamaah serta meninggal dunia, maka ia mati dengan kematian Jahiliyyah. Barangsiapa yang memberontak terhadap umatku, membunuh orang baik dan orang jahat tanpa membezakan, tidak berusaha mencegah pembunuhan orang mukmin, dan tidak menepati janji dengan mereka yang memiliki perjanjian, maka dia bukan dari kalangan umatku. Barangsiapa yang berperang di bawah panji-panji yang tidak jelas, menyeru kepada permusuhan suku, atau marah kerana permusuhan suku, dan terbunuh, maka kematiannya adalah kematian Jahiliyyah.\""
  },
  {
    "id": 18861,
    "hadith_number": 4125,
    "tajuk_hadith": "Perang Tanpa Tujuan dan Ikatan Kaumiah: Kematian Jahiliyyah",
    "perawi_melayu": "Dikisahkan oleh Jundub bin 'Abdullah bahawa:",
    "english_text": "\"The Messenger of Allah  said: 'Whoever fights for a cause that is not clear, advocating tribalism, getting angry for the sake of tribalism, then he has died a death of Jahiliyyah.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، عَنْ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا عِمْرَانُ الْقَطَّانُ، عَنْ قَتَادَةَ، عَنْ أَبِي مِجْلَزٍ، عَنْ جُنْدُبِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ قَاتَلَ تَحْتَ رَايَةٍ عُمِّيَّةٍ يُقَاتِلُ عَصَبِيَّةً وَيَغْضَبُ لِعَصَبِيَّةٍ فَقِتْلَتُهُ جَاهِلِيَّةٌ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ عِمْرَانُ الْقَطَّانُ لَيْسَ بِالْقَوِيِّ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Sesiapa yang berperang di bawah panji-panji yang tidak jelas, memperjuangkan permusuhan kaum, dan marah kerana permusuhan kaum, maka kematiannya adalah kematian Jahiliyyah.\""
  },
  {
    "id": 18862,
    "hadith_number": 4126,
    "tajuk_hadith": "Bahaya Menuding Saudaramu Muslim dengan Senjata",
    "perawi_melayu": "Dikisahkan oleh Abu Bakrah bahawa:",
    "english_text": "\"The Messenger of Allah  said: 'If a Muslim points a weapon at his fellow Muslim, then they are on the brink of Hell, and if he kills him, then they will both fall into it.'\"",
    "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، عَنْ شُعْبَةَ، قَالَ أَخْبَرَنِي مَنْصُورٌ، قَالَ سَمِعْتُ رِبْعِيًّا، يُحَدِّثُ عَنْ أَبِي بَكْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا أَشَارَ الْمُسْلِمُ عَلَى أَخِيهِ الْمُسْلِمِ بِالسِّلاَحِ فَهُمَا عَلَى جُرُفِ جَهَنَّمَ فَإِذَا قَتَلَهُ خَرَّا جَمِيعًا فِيهَا ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Jika seorang Muslim menudingkan senjata kepada saudaranya sesama Muslim, maka mereka berdua berada di tebing neraka. Dan jika dia membunuhnya, maka mereka berdua akan jatuh ke dalamnya bersama-sama.\""
  },
  {
    "id": 18863,
    "hadith_number": 4127,
    "tajuk_hadith": "Perpecahan di antara Muslim dan Akibatnya",
    "perawi_melayu": "Dikatakan oleh Abu Bakrah:",
    "english_text": "\"If two Muslim men bear weapons against each other, then they are both on the brink of Hell. And if one of them kills the other, they will both be in Hell.\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا يَعْلَى، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ رِبْعِيٍّ، عَنْ أَبِي بَكْرَةَ، قَالَ إِذَا حَمَلَ الرَّجُلاَنِ الْمُسْلِمَانِ السِّلاَحَ أَحَدُهُمَا عَلَى الآخَرِ فَهُمَا عَلَى جُرُفِ جَهَنَّمَ فَإِذَا قَتَلَ أَحَدُهُمَا الآخَرَ فَهُمَا فِي النَّارِ ‏.‏",
    "malay_translation": "Jika dua orang lelaki Muslim mengangkat senjata antara satu sama lain, maka mereka berdua berada di tebing neraka. Dan jika salah seorang daripada mereka membunuh yang lain, maka mereka berdua akan berada di dalam neraka."
  },
  {
    "id": 18864,
    "hadith_number": 4128,
    "tajuk_hadith": "Ancaman Neraka bagi Pembunuh dan Mereka yang Berhasrat Membunuh",
    "perawi_melayu": "Diriwayatkan daripada Abu Musa bahawa:",
    "english_text": "The Prophet  said: \"If two Muslims confront each other with swords, and one kills the other, they will both be in Hell.\" It was said: \"O Messenger of Allah, (we understand about) the killer, but what about the one who is killed?\" He said: \"He wanted to kill his companion.\"",
    "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، عَنْ يَزِيدَ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنِ الْحَسَنِ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا تَوَاجَهَ الْمُسْلِمَانِ بِسَيْفَيْهِمَا فَقَتَلَ أَحَدُهُمَا صَاحِبَهُ فَهُمَا فِي النَّارِ ‏\"‏ ‏.‏ قِيلَ يَا رَسُولَ اللَّهِ هَذَا الْقَاتِلُ فَمَا بَالُ الْمَقْتُولِ قَالَ ‏\"‏ أَرَادَ قَتْلَ صَاحِبِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Apabila dua orang Muslim berhadapan dengan pedang masing-masing, lalu salah seorang membunuh yang lain, maka kedua-duanya berada di dalam Neraka.\" Ditanya: \"Wahai Rasulullah, (kami faham tentang) si pembunuh, tetapi bagaimana pula dengan orang yang terbunuh?\" Baginda bersabda: \"Dia juga berhasrat untuk membunuh kawannya.\""
  },
  {
    "id": 18865,
    "hadith_number": 4129,
    "tajuk_hadith": "Ancaman Neraka Bagi Dua Muslim yang Saling Berbunuhan",
    "perawi_melayu": "Diriwayatkan dari Abu Musa Al-Ash'ari bahawa:",
    "english_text": "The Prophet  said: \"If two Muslims confront each other with swords and one of them kills the other, they will both be in Hell.\"",
    "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَزِيدُ، - وَهُوَ ابْنُ هَارُونَ - قَالَ أَنْبَأَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا تَوَاجَهَ الْمُسْلِمَانِ بِسَيْفَيْهِمَا فَقَتَلَ أَحَدُهُمَا صَاحِبَهُ فَهُمَا فِي النَّارِ مِثْلَهُ سَوَاءً ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Jika dua orang Muslim berhadapan antara satu sama lain dengan pedang, lalu salah seorang daripada mereka membunuh yang lain, maka kedua-duanya akan berada di dalam Neraka.\""
  },
  {
    "id": 18866,
    "hadith_number": 4130,
    "tajuk_hadith": "Ancaman Neraka Bagi Dua Muslim yang Berperang",
    "perawi_melayu": "Diriwayatkan daripada Abu Bakrah",
    "english_text": "The Prophet  said: \"If two Muslims confront each other with swords, each of them wanting to kill the other, they will both be in Hell.\" It was said to him: \"O Messenger of Allah, (we understand about) the killer, but what about the one who is killed?\" He said: \"He was determined to kill his companion.\"",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَلِيٍّ الْمِصِّيصِيُّ، قَالَ حَدَّثَنَا خَلَفٌ، عَنْ زَائِدَةَ، عَنْ هِشَامٍ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا تَوَاجَهَ الْمُسْلِمَانِ بِسَيْفَيْهِمَا كُلُّ وَاحِدٍ مِنْهُمَا يُرِيدُ قَتْلَ صَاحِبِهِ فَهُمَا فِي النَّارِ ‏\"‏ ‏.‏ قِيلَ لَهُ يَا رَسُولَ اللَّهِ هَذَا الْقَاتِلُ فَمَا بَالُ الْمَقْتُولِ قَالَ ‏\"‏ إِنَّهُ كَانَ حَرِيصًا عَلَى قَتْلِ صَاحِبِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Nabi ﷺ bersabda: \"Jika dua orang Muslim berhadapan dengan pedang masing-masing dengan niat untuk membunuh yang lain, maka kedua-duanya akan berada di dalam Neraka.\" Lalu Baginda ditanya: \"Wahai Rasulullah, (kami faham tentang) pembunuh, tetapi bagaimana pula dengan orang yang terbunuh?\" Baginda bersabda: \"Sesungguhnya dia juga berazam untuk membunuh temannya.\""
  },
  {
    "id": 18867,
    "hadith_number": 4131,
    "tajuk_hadith": "Ancaman Neraka bagi Pembunuh dan Orang yang Dibunuh dalam Pertempuran",
    "perawi_melayu": "Diriwayatkan daripada Abu Bakrah",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا الْخَلِيلُ بْنُ عُمَرَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي قَتَادَةُ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا الْتَقَى الْمُسْلِمَانِ بِسَيْفَيْهِمَا فَقَتَلَ أَحَدُهُمَا صَاحِبَهُ فَالْقَاتِلُ وَالْمَقْتُولُ فِي النَّارِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Apabila dua orang Muslim bertemu (dan bertempur) dengan pedang mereka, lalu salah seorang membunuh yang lain, maka pembunuh dan yang terbunuh kedua-duanya di dalam Neraka.\" (Hadith Sahih)"
  },
  {
    "id": 18868,
    "hadith_number": 4132,
    "tajuk_hadith": "Ancaman Neraka bagi Pembunuh dan Orang yang Ingin Membunuh",
    "perawi_melayu": "Daripada Abu Bakrah",
    "english_text": "If two Muslims confront each other with their swords and one of them kills the other, both the killer and the slain will be in Hell. He wanted to kill his companion.",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ فَضَالَةَ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَنْبَأَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، عَنِ الْحَسَنِ، عَنِ الأَحْنَفِ بْنِ قَيْسٍ، عَنْ أَبِي بَكْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِذَا تَوَاجَهَ الْمُسْلِمَانِ بِسَيْفَيْهِمَا فَقَتَلَ أَحَدُهُمَا صَاحِبَهُ فَالْقَاتِلُ وَالْمَقْتُولُ فِي النَّارِ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ هَذَا الْقَاتِلُ فَمَا بَالُ الْمَقْتُولِ قَالَ ‏\"‏ إِنَّهُ أَرَادَ قَتْلَ صَاحِبِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Saya mendengar Rasulullah ﷺ bersabda: 'Apabila dua orang Muslim berhadapan dengan pedang masing-masing, lalu salah seorang membunuh yang lain, maka pembunuh dan yang terbunuh kedua-duanya di dalam Neraka.' Mereka berkata: 'Wahai Rasulullah, (kami faham tentang) pembunuh, tetapi bagaimana pula dengan orang yang terbunuh?' Baginda bersabda: 'Sesungguhnya dia juga berkeinginan untuk membunuh kawannya.'"
  },
  {
    "id": 18869,
    "hadith_number": 4133,
    "tajuk_hadith": "Ancaman Neraka bagi Dua Muslim yang Berperang",
    "perawi_melayu": "Diriwayatkan daripada Abu Bakrah",
    "english_text": "\"The Messenger of Allah  said: 'If two Muslims fight with swords, and one of them kills the other, then the killer and the slain will both be in Hell.'\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدَةَ، عَنْ حَمَّادٍ، عَنْ أَيُّوبَ، وَيُونُسَ، وَالْعَلاَءِ بْنِ زِيَادٍ، عَنِ الْحَسَنِ، عَنِ الأَحْنَفِ بْنِ قَيْسٍ، عَنْ أَبِي بَكْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا الْتَقَى الْمُسْلِمَانِ بِسَيْفَيْهِمَا فَقَتَلَ أَحَدُهُمَا صَاحِبَهُ فَالْقَاتِلُ وَالْمَقْتُولُ فِي النَّارِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: 'Apabila dua orang Muslim bertempur dengan pedang, lalu salah seorang daripada mereka membunuh yang lain, maka pembunuh dan yang terbunuh kedua-duanya di dalam neraka.'"
  },
  {
    "id": 18870,
    "hadith_number": 4134,
    "tajuk_hadith": "Hukuman Bagi Dua Muslim Berhadapan dengan Pedang",
    "perawi_melayu": "Diriwayatkan daripada Abu Musa Al-Ash'ari bahawa :",
    "english_text": "The Messenger of Allah  said: \"If two Muslims confront each other with swords and one of them kills the other, then the killer and the slain will both be in Hell.\" A man said: \"O Messenger of Allah, (we understand about) the killer, but what about the one who is killed?\" He said: \"He wanted to kill his companion.\"",
    "arabic_text": "أَخْبَرَنَا مُجَاهِدُ بْنُ مُوسَى، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ عُلَيَّةَ - عَنْ يُونُسَ، عَنِ الْحَسَنِ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا تَوَاجَهَ الْمُسْلِمَانِ بِسَيْفَيْهِمَا فَقَتَلَ أَحَدُهُمَا صَاحِبَهُ فَالْقَاتِلُ وَالْمَقْتُولُ فِي النَّارِ ‏\"‏ ‏.‏ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ هَذَا الْقَاتِلُ فَمَا بَالُ الْمَقْتُولِ قَالَ ‏\"‏ إِنَّهُ أَرَادَ قَتْلَ صَاحِبِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Jika dua orang Muslim berhadapan antara satu sama lain dengan pedang, lalu salah seorang daripada mereka membunuh yang lain, maka pembunuh dan yang terbunuh kedua-duanya di dalam Neraka.\" Seorang lelaki bertanya: \"Wahai Rasulullah, (kami faham tentang) pembunuh itu, tetapi bagaimana pula dengan yang terbunuh?\" Baginda menjawab: \"Sesungguhnya dia juga ingin membunuh sahabatnya.\""
  },
  {
    "id": 18871,
    "hadith_number": 4135,
    "tajuk_hadith": "Larangan Kembali Kepada Kufur dan Membunuh Sesama Muslim",
    "perawi_melayu": "Dikisahkan oleh Ibn 'Umar daripada Nabi SAW bahawa :",
    "english_text": "The Prophet  said: \"Do not revert to disbelievers after I am gone, striking the necks of one another (killing one another).\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ وَاقِدِ بْنِ مُحَمَّدِ بْنِ زَيْدٍ، أَنَّهُ سَمِعَ أَبَاهُ، يُحَدِّثُ عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Janganlah kamu kembali menjadi kafir sesudahku, lalu saling membunuh antara satu sama lain.\""
  },
  {
    "id": 18872,
    "hadith_number": 4136,
    "tajuk_hadith": "Larangan Kembali kepada Kekafiran dan Hukuman atas Dosa Orang Lain",
    "perawi_melayu": "Daripada Ibnu Umar ra.",
    "english_text": "\"The Messenger of Allah  said: 'Do not revert to disbelievers after I am gone, striking the necks of one another (killing one another). No man is to be punished for the sins of his father, or for the sins of his brother.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، قَالَ حَدَّثَنَا شَرِيكٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ لاَ يُؤْخَذُ الرَّجُلُ بِجِنَايَةِ أَبِيهِ وَلاَ جِنَايَةِ أَخِيهِ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا خَطَأٌ وَالصَّوَابُ مُرْسَلٌ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Janganlah kamu kembali kepada kekufuran setelah aku tiada, lalu kamu membunuh antara satu sama lain.  Seseorang tidak akan dihukum disebabkan dosa bapanya, dan tidak juga dosa saudaranya.\""
  },
  {
    "id": 18873,
    "hadith_number": 4137,
    "tajuk_hadith": "Larangan Kembali kepada Kekafiran dan Hukuman atas Dosa Orang Lain",
    "perawi_melayu": "Daripada Abdullah, katanya:",
    "english_text": "\"The Messenger of Allah  said: 'Do not revert to disbelievers after I am gone, striking the necks of one another (killing one another). No man is to be punished for the sins of his father, or the sins of his brother.'\"",
    "arabic_text": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ، قَالَ حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، قَالَ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، عَنِ الأَعْمَشِ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ وَلاَ يُؤْخَذُ الرَّجُلُ بِجَرِيرَةِ أَبِيهِ وَلاَ بِجَرِيرَةِ أَخِيهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Janganlah kamu kembali kepada kekafiran selepas aku meninggal dunia, lalu kamu membunuh sesama kamu.  Seseorang itu tidak akan dihukum kerana dosa bapanya, dan tidak juga kerana dosa saudaranya.\""
  },
  {
    "id": 18874,
    "hadith_number": 4138,
    "tajuk_hadith": "Larangan Kembali kepada Kefasikan dan Pembunuhan Sesama",
    "perawi_melayu": "Daripada Masruq, katanya:",
    "english_text": "\"The Messenger of Allah  said: 'I do not want to see you after I am gone reverting to disbelievers, striking the necks of one another (killing one another). No man is punished for the crime of his father, or the crime of his brother.'\" This is correct.",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ أُلْفِيَنَّكُمْ تَرْجِعُونَ بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ لاَ يُؤْخَذُ الرَّجُلُ بِجَرِيرَةِ أَبِيهِ وَلاَ بِجَرِيرَةِ أَخِيهِ ‏\"‏ ‏.‏ هَذَا الصَّوَابُ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Aku tidak mahu melihat kamu setelah aku tiada, kembali kepada kekafiran, membunuh antara satu sama lain.  Seseorang tidak akan dihukum disebabkan kesalahan bapanya atau kesalahan saudaranya.\" Ini adalah benar."
  },
  {
    "id": 18875,
    "hadith_number": 4139,
    "tajuk_hadith": "Jangan Kembali Menjadi Kafir Selepas Kemangkatan Rasulullah",
    "perawi_melayu": "Daripada Masruq, bahawa:",
    "english_text": "The Messenger of Allah  said: \"Do not revert to disbelievers after I am gone.\" It is Mursal.",
    "arabic_text": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ، قَالَ حَدَّثَنَا يَعْلَى، قَالَ حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَرْجِعُوا بَعْدِي كُفَّارًا ‏\"‏ ‏.‏ مُرْسَلٌ ‏.‏",
    "malay_translation": "Daripada Masruq, bahawa Rasulullah SAW bersabda:  \"Janganlah kamu kembali menjadi orang-orang kafir setelah aku tiada.\" (Hadis Mursal)"
  },
  {
    "id": 18876,
    "hadith_number": 4140,
    "tajuk_hadith": "Larangan Kembali ke Kesesatan dan Perbunuhan Sesama",
    "perawi_melayu": "Diriwayatkan daripada Abu Bakrah r.a.",
    "english_text": "The Prophet  said: \"Do not revert to misguidance after I am gone, striking the necks of one another (killing one another).\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ، قَالَ أَنْبَأَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي بَكْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَرْجِعُوا بَعْدِي ضُلاَّلاً يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Janganlah kamu kembali kepada kesesatan sepeninggalku, dengan saling memukul leher sesama (membunuh satu sama lain).\""
  },
  {
    "id": 18877,
    "hadith_number": 4141,
    "tajuk_hadith": "Larangan Kembali kepada Kefasikan Selepas Wafatnya Rasulullah",
    "perawi_melayu": "Daripada Jarir, bahawa:",
    "english_text": "During the Farewell Pilgrimage, the Messenger of Allah  asked the people to be quiet and listen, and said: \"Do not revert to disbelievers after I am gone, striking the necks of one another (killing one another).\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، وَعَبْدُ الرَّحْمَنِ، قَالاَ حَدَّثَنَا شُعْبَةُ، عَنْ عَلِيِّ بْنِ مُدْرِكٍ، قَالَ سَمِعْتُ أَبَا زُرْعَةَ بْنَ عَمْرِو بْنِ جَرِيرٍ، عَنْ جَرِيرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ اسْتَنْصَتَ النَّاسَ قَالَ ‏\n\"‏ لاَ تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Jarir, bahawa Rasulullah SAW semasa Haji Wada’ telah menyuruh orang ramai supaya mendiamkan diri dan mendengar, lalu baginda bersabda:  \"Janganlah kamu kembali kepada kekafiran selepas aku meninggal dunia, lalu kamu saling membunuh antara satu sama lain.\""
  },
  {
    "id": 18878,
    "hadith_number": 4142,
    "tajuk_hadith": "Larangan Membunuh Sesama Muslim Setelah Kewafatan Nabi Muhammad SAW",
    "perawi_melayu": "Diriwayatkan daripada Jarir bin 'Abdullah, beliau berkata:",
    "english_text": "\"The Messenger of Allah  said to me: 'Ask the people to be quiet and listen.' Then he said: 'I do not want to see you after I am gone reverting to disbelievers, striking the necks of one another (killing one another).'\"",
    "arabic_text": "أَخْبَرَنَا أَبُو عُبَيْدَةَ بْنُ أَبِي السَّفَرِ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ قَيْسٍ، قَالَ بَلَغَنِي أَنَّ جَرِيرَ بْنَ عَبْدِ اللَّهِ، قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اسْتَنْصِتِ النَّاسَ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ لاَ أُلْفِيَنَّكُمْ بَعْدَ مَا أَرَى تَرْجِعُونَ بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ ‏\"‏ ‏.‏",
    "malay_translation": "\"Rasulullah SAW bersabda kepadaku: 'Minta orang ramai untuk diam dan mendengar.' Kemudian Baginda bersabda: 'Aku tidak mahu melihat kamu selepas pemergianku kembali menjadi kafir, saling memenggal leher antara satu sama lain (membunuh antara satu sama lain).'\""
  }
]
