[
  {
    "id": 18450,
    "hadith_number": 3714,
    "tajuk_hadith": "Keperluan Ar-Ruqba",
    "perawi_melayu": "Hilal bin Al-'Ala' memberitahu kita:",
    "english_text": "\"My father narrated to us: Ubaidullah -he is, Ibn 'Amr- narrated to us, from Sufyan, from Ibn Abi Najih, from Tawus, from Zaid bin Thabit, that the Prophet said: 'Ar-Ruqba is permissible.'\"",
    "arabic_text": "أَخْبَرَنَا هِلاَلُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، - وَهُوَ ابْنُ عَمْرٍو - عَنْ سُفْيَانَ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ طَاوُسٍ، عَنْ زَيْدِ بْنِ ثَابِتٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الرُّقْبَى جَائِزَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Hilal bin Al-'Ala' memberitahu kami: Bapa saya meriwayatkan kepada kami: Ubaidullah - iaitu Ibn 'Amr - meriwayatkan kepada kami daripada Sufyan, daripada Ibn Abi Najih, daripada Tawus, daripada Zaid bin Thabit, bahawa Nabi SAW bersabda: \"Ar-Ruqba adalah dibolehkan.\""
  },
  {
    "id": 18451,
    "hadith_number": 3715,
    "tajuk_hadith": "Hak Milik Ruqba",
    "perawi_melayu": "Muhammad bin 'Ali bin Maimun telah memberitahu kami, katanya:",
    "english_text": "\"Muhammad -he is, Ibn Yusuf- narrated to us, he said: 'Sufyan narrated to us from Ibn Abi Najih, from Tawus, from a man, from Zaid bin Thabit that the Prophet ruled that the Ruqba belongs to the one to whom it is given.'\"",
    "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ عَلِيِّ بْنِ مَيْمُونٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، - وَهُوَ ابْنُ يُوسُفَ - قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ طَاوُسٍ، عَنْ رَجُلٍ، عَنْ زَيْدِ بْنِ ثَابِتٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم جَعَلَ الرُّقْبَى لِلَّذِي أُرْقِبَهَا ‏.‏",
    "malay_translation": "Muhammad bin Ali bin Maimun telah memberitahu kami, katanya: Muhammad bin Yusuf telah meriwayatkan kepada kami, katanya: Sufyan telah meriwayatkan kepada kami daripada Ibnu Abi Najih, daripada Tawus, daripada seorang lelaki, daripada Zaid bin Thabit bahawa Nabi SAW telah menetapkan bahawa hamba sahaya yang dibebaskan (ruqba) menjadi milik orang yang telah membebaskannya."
  },
  {
    "id": 18452,
    "hadith_number": 3716,
    "tajuk_hadith": "Tiada Ruqba dan Harta Pusaka",
    "perawi_melayu": "Zakariyya bin Yahya memberitahu kami, katanya:",
    "english_text": "\"Abdul-Jabbar bin Al-'Ala' narrated to us, he said: 'Sufyan narrated to us from Ibn Abi Najih, from Tawus, and perhaps it is from Ibn 'Abbas, who said: There is no Ruqba, and whoever gives a gift on the basis of Ruqba, it is part of his estate.'\"",
    "arabic_text": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ طَاوُسٍ، لَعَلَّهُ عَنِ ابْنِ عَبَّاسٍ، قَالَ لاَ رُقْبَى فَمَنْ أُرْقِبَ شَيْئًا فَهُوَ سَبِيلُ الْمِيرَاثِ ‏.‏",
    "malay_translation": "Zakariyya bin Yahya memberitahu kami, katanya: Abdul-Jabbar bin Al-'Ala' meriwayatkan kepada kami, katanya: Sufyan meriwayatkan kepada kami daripada Ibnu Abi Najih, daripada Tawus, dan mungkin daripada Ibnu Abbas, yang berkata: Tiada Ruqba, dan sesiapa yang memberi hadiah atas dasar Ruqba, ia adalah sebahagian daripada harta pusakanya."
  },
  {
    "id": 18453,
    "hadith_number": 3717,
    "tajuk_hadith": "Larangan Memberi Harta Berdasarkan Ruqba",
    "perawi_melayu": "Zaid meriwayatkan daripada Abu Az-Zubair, daripada Tawus, daripada Ibnu Abbas bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Do not give away your property on the basis of Ruqba, for whoever gives a gift on that basis, it belongs to the one to whom he gave it.\"",
    "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ وَهْبٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنِي أَبُو عَبْدِ الرَّحِيمِ، قَالَ حَدَّثَنِي زَيْدٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تُرْقِبُوا أَمْوَالَكُمْ فَمَنْ أَرْقَبَ شَيْئًا فَهُوَ لِمَنْ أُرْقِبَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah kamu memberikan harta kamu berdasarkan ruqba, kerana sesiapa yang memberi hadiah atas dasar itu, maka ia menjadi milik orang yang dihadiahkan."
  },
  {
    "id": 18454,
    "hadith_number": 3718,
    "tajuk_hadith": "Kebebasan Memberi dan Menerima Hadiah",
    "perawi_melayu": "Hajjaj meriwayatkan daripada Abu Az-Zubair, daripada Tawus, daripada Ibn 'Abbas, yang berkata:",
    "english_text": "\"The Messenger of Allah said: 'Umra (life-long gift) is permissible for the one to whom it is given, and Ruqba is permissible for the one to whom it is given, and the one who takes back his gift is like the one who goes back to his vomit.'\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ حَجَّاجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْعُمْرَى جَائِزَةٌ لِمَنْ أُعْمِرَهَا وَالرُّقْبَى جَائِزَةٌ لِمَنْ أُرْقِبَهَا وَالْعَائِدُ فِي هِبَتِهِ كَالْعَائِدِ فِي قَيْئِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  'Umrah (hadiah seumur hidup) dibenarkan bagi sesiapa yang menerimanya, dan Ruqba (hadiah pembebasan hamba) dibenarkan bagi sesiapa yang menerimanya, dan orang yang menarik balik pemberiannya adalah seperti orang yang memakan semula muntahnya.'"
  },
  {
    "id": 18455,
    "hadith_number": 3719,
    "tajuk_hadith": "Umrah dan Ruqba Adalah Sama",
    "perawi_melayu": "Sufyan meriwayatkan daripada Abu Az-Zubair, daripada Tawus, daripada Ibnu Abbas, yang berkata:",
    "english_text": "'Umra and Ruqba are the same.",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ الْعُمْرَى وَالرُّقْبَى سَوَاءٌ ‏.‏",
    "malay_translation": "Ibnu Abbas berkata: Umrah dan Ruqba adalah sama."
  },
  {
    "id": 18456,
    "hadith_number": 3720,
    "tajuk_hadith": "Keharaman Ruqba dan 'Umra",
    "perawi_melayu": "(Sanad yang berbeza) daripada Sufyan, daripada Abu Az-Zubair, daripada Tawus, daripada Ibnu Abbas, yang berkata:",
    "english_text": "\"Ruqba and 'Umra are not permissible; whoever is given something on the basis of 'Umra, it is his, and whoever is given something on the basis of Ruqba, it is his.\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا يَعْلَى، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لاَ تَحِلُّ الرُّقْبَى وَلاَ الْعُمْرَى فَمَنْ أُعْمِرَ شَيْئًا فَهُوَ لَهُ وَمَنْ أُرْقِبَ شَيْئًا فَهُوَ لَهُ ‏.‏",
    "malay_translation": "Ruqba dan 'Umra adalah haram. Barangsiapa diberikan sesuatu atas dasar 'Umra, maka ia menjadi miliknya, dan barangsiapa diberikan sesuatu atas dasar Ruqba, maka ia menjadi miliknya."
  },
  {
    "id": 18457,
    "hadith_number": 3721,
    "tajuk_hadith": "Ketidaksahjian 'Umra dan Ruqba",
    "perawi_melayu": "(Sanad yang berbeza) daripada Hajjaj, daripada Abu Az-Zubair, daripada Tawus, daripada Ibnu Abbas, yang berkata:",
    "english_text": "\"'Umra and Ruqba are not proper. Whoever gives something on the basis of 'Umra or Ruqba, it belongs to the one to whom he gave it on that basis, both during his lifetime and after his death.\" Hanzalah narrated it in Mursal form.",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، قَالَ حَدَّثَنَا حَجَّاجٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لاَ تَصْلُحُ الْعُمْرَى وَلاَ الرُّقْبَى فَمَنْ أَعْمَرَ شَيْئًا أَوْ أَرْقَبَهُ فَإِنَّهُ لِمَنْ أُعْمِرَهُ وَأُرْقِبَهُ حَيَاتَهُ وَمَوْتَهُ ‏.‏ أَرْسَلَهُ حَنْظَلَةُ ‏.‏",
    "malay_translation": "'Umra dan Ruqba adalah tidak sah. Barangsiapa memberi sesuatu berdasarkan 'Umra atau Ruqba, maka ia menjadi milik orang yang kepadanya ia diberikan, sama ada ketika hayatnya atau selepas kematiannya.  Hanzalah meriwayatkannya secara mursal."
  },
  {
    "id": 18458,
    "hadith_number": 3722,
    "tajuk_hadith": "Keharaman Ruqba",
    "perawi_melayu": "Hanzalah meriwayatkan bahawa beliau mendengar Tawus berkata:",
    "english_text": "\"The Messenger of Allah said: 'Ruqba is not permissible. Whoever is given something on the basis of Ruqba, it is part of his estate.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ، قَالَ أَنْبَأَنَا حِبَّانُ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، عَنْ حَنْظَلَةَ، أَنَّهُ سَمِعَ طَاوُسًا، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَحِلُّ الرُّقْبَى فَمَنْ أُرْقِبَ رُقْبَى فَهُوَ سَبِيلُ الْمِيرَاثِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Ruqba adalah haram.  Barangsiapa yang diberi sesuatu berdasarkan Ruqba, maka ia termasuk dalam harta pusakanya.\""
  },
  {
    "id": 18459,
    "hadith_number": 3723,
    "tajuk_hadith": "Umrah Sebagai Harta Pusaka",
    "perawi_melayu": "Sufyan meriwayatkan daripada Ibnu Abi Najih, daripada Tawus, daripada Zaid bin Thabit, yang berkata:",
    "english_text": "\"The Messenger of Allah said: 'Umra (a gift given for life) is part of the estate.'\"",
    "arabic_text": "أَخْبَرَنِي عَبْدَةُ بْنُ عَبْدِ الرَّحِيمِ، عَنْ وَكِيعٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ طَاوُسٍ، عَنْ زَيْدِ بْنِ ثَابِتٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْعُمْرَى مِيرَاثٌ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Umrah (hadiah yang diberikan seumur hidup) adalah sebahagian daripada harta pusaka.\""
  },
  {
    "id": 18460,
    "hadith_number": 3724,
    "tajuk_hadith": "Umrah (Hadiah untuk Kehidupan) Milik Pewaris",
    "perawi_melayu": "Sufyan meriwayatkan daripada Ibnu Tawus, daripada bapanya, daripada Hujr Al-Madari, daripada Zaid, yang berkata:",
    "english_text": "\"The Messenger of Allah said: 'Umra (a gift given for life) is for the heir.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ حُجْرٍ الْمَدَرِيِّ، عَنْ زَيْدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْعُمْرَى لِلْوَارِثِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Umrah (hadiah untuk kehidupan) adalah untuk pewaris.\""
  },
  {
    "id": 18461,
    "hadith_number": 3725,
    "tajuk_hadith": "Keperluan Umrah",
    "perawi_melayu": "Ma'mar meriwayatkan daripada Ibnu Tawus, daripada bapanya, daripada Hujr Al-Madari, daripada Zaid bin Thabit, daripada Nabi SAW yang bersabda:",
    "english_text": "\"'Umra (a gift given for life) is permissible.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ مَعْمَرٍ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ حُجْرٍ الْمَدَرِيِّ، عَنْ زَيْدِ بْنِ ثَابِتٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْعُمْرَى جَائِزَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Diriwayatkan bahawa Nabi Muhammad SAW bersabda: \"Umrah itu dibolehkan.\""
  },
  {
    "id": 18462,
    "hadith_number": 3726,
    "tajuk_hadith": "Harta Umra Milik Waris",
    "perawi_melayu": "Ma'mar meriwayatkan daripada 'Amr bin Dinar, daripada Tawus, daripada Zaid bin Thabit, bahawa Nabi SAW bersabda:",
    "english_text": "\"'Umra (a gift given for life) belongs to the heir.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، عَنِ ابْنِ الْمُبَارَكِ، عَنْ مَعْمَرٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ طَاوُسٍ، عَنْ زَيْدِ بْنِ ثَابِتٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْعُمْرَى لِلْوَارِثِ ‏\"‏ ‏.‏",
    "malay_translation": "“Harta umrah adalah milik waris.”"
  },
  {
    "id": 18463,
    "hadith_number": 3727,
    "tajuk_hadith": "Harta 'Umra (Hadiah Hayat) Milik Pewaris",
    "perawi_melayu": "(Sanad berbeza) daripada Ma'mar yang berkata:",
    "english_text": "\"I heard 'Amr bin Dinar, narrating from Tawus, from Hujr Al-Madari, from Zaid bin Thabit, that the Messenger of Allah said: \"'Umra (a gift given for life) belongs to the heir.\" And Allah knows best.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ، قَالَ أَنْبَأَنَا حِبَّانُ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ مَعْمَرٍ، قَالَ سَمِعْتُ عَمْرَو بْنَ دِينَارٍ، يُحَدِّثُ عَنْ طَاوُسٍ، عَنْ حُجْرٍ الْمَدَرِيِّ، عَنْ زَيْدِ بْنِ ثَابِتٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْعُمْرَى لِلْوَارِثِ ‏\"‏ ‏.‏ وَاللَّهُ أَعْلَمُ ‏.‏",
    "malay_translation": "Aku mendengar daripada Amr bin Dinar, meriwayatkan daripada Tawus, daripada Hujr Al-Madari, daripada Zaid bin Thabit, bahawa Rasulullah SAW bersabda:  \"Harta 'Umra (hadiah yang diberikan sepanjang hayat) adalah milik pewaris.\"  Dan Allah jualah yang Maha Mengetahui."
  }
]