[
  {
    "id": 15133,
    "hadith_number": 397,
    "tajuk_hadith": "Larangan Mandi Junub di Air Mengalir",
    "perawi_melayu": "Abu Hurairah r.a. berkata:",
    "english_text": "\"The Messenger of Allah (ﷺ) said: 'None of you should perform ghusl in standing water while he is Junub.'\"",
    "arabic_text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ بُكَيْرٍ، أَنَّ أَبَا السَّائِبِ، حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏‏\n\"‏‏ لاَ يَغْتَسِلْ أَحَدُكُمْ فِي الْمَاءِ الدَّائِمِ وَهُوَ جُنُبٌ ‏‏\"‏‏ ‏‏.‏‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Janganlah sesiapa di antara kamu mandi hadas besar (ghusl) dalam air yang mengalir (air yang sentiasa bergerak).\""
  },
  {
    "id": 15134,
    "hadith_number": 398,
    "tajuk_hadith": "Larangan Memandi atau Berwuduk dengan Air Kencing di Air Bertakung",
    "perawi_melayu": "Daripada Abu Hurairah bahawa Rasulullah SAW bersabda:",
    "english_text": "\"None of you should urinate into standing water and then perform Ghusl or Wudu' with it.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ، قَالَ حَدَّثَنَا حِبَّانُ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏‏\n\"‏‏ لاَ يَبُولَنَّ الرَّجُلُ فِي الْمَاءِ الدَّائِمِ ثُمَّ يَغْتَسِلُ مِنْهُ أَوْ يَتَوَضَّأُ ‏‏\"‏‏ ‏‏.‏‏",
    "malay_translation": "Janganlah sesiapa di antara kamu membuang air kecil ke dalam air yang bertakung kemudian mandi atau berwuduk dengan air tersebut."
  },
  {
    "id": 15135,
    "hadith_number": 399,
    "tajuk_hadith": "Larangan Memandi Janabah di Air Tergenang",
    "perawi_melayu": "",
    "english_text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) forbade urinating into standing water and then performing Ghusl from Janabah in it.",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ صَالِحٍ الْبَغْدَادِيُّ، قَالَ حَدَّثَنَا يَحْيَى بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنِي ابْنُ عَجْلاَنَ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى أَنْ يُبَالَ فِي الْمَاءِ الدَّائِمِ ثُمَّ يُغْتَسَلَ فِيهِ مِنَ الْجَنَابَةِ ‏‏.‏‏",
    "malay_translation": "Telah diriwayatkan daripada Abu Hurairah bahawa Rasulullah SAW melarang membuang air kecil ke dalam air yang tergenang kemudian mandi hadas besar (ghusl janabah) di dalamnya."
  },
  {
    "id": 15136,
    "hadith_number": 400,
    "tajuk_hadith": "Larangan Membuang Air Kecil di Air Bertakung sebelum Mandi",
    "perawi_melayu": "Abu Hurairah رضي الله عنه",
    "english_text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) forbade urinating into standing water then performing Ghusl with it.",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، عَنْ سُفْيَانَ، عَنْ أَبِي الزِّنَادِ، عَنْ مُوسَى بْنِ أَبِي عُثْمَانَ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى أَنْ يُبَالَ فِي الْمَاءِ الرَّاكِدِ ثُمَّ يُغْتَسَلَ مِنْهُ ‏‏.‏‏",
    "malay_translation": "Telah diriwayatkan daripada Abu Hurairah bahawa Rasulullah SAW melarang membuang air kecil ke dalam air yang bertakung kemudian mandi menggunakan air tersebut."
  },
  {
    "id": 15137,
    "hadith_number": 401,
    "tajuk_hadith": "Larangan Membuang Air Kecil di Air Bertakung dan Mandi dengannya",
    "perawi_melayu": "Dikisahkan oleh Abu Hurairah",
    "english_text": "\"None of you should urinate into standing water which does not flow and then perform Ghusl with it.\" (One of the narrators) Sufyan said: \"They said to Hisham - meaning Ibn Hassan - 'Ayyub only attributed this Hadith to Abu Hurairah?' So he said: 'If Ayyub is not able to raise up a narration then he does not raise it.'\" \n\n That is, he narrated it from Abu Hurairah, rather than from him from the Prophet (ﷺ) while others narrated it in Marfu' form or \"raised\" to the Prophet (ﷺ) And perhaps by: \"If he is able to not raise it\" he means: \"If he is not able to raise it.\" And Allah knows best.",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ لاَ يَبُولَنَّ أَحَدُكُمْ فِي الْمَاءِ الدَّائِمِ الَّذِي لاَ يَجْرِي ثُمَّ يَغْتَسِلُ مِنْهُ ‏‏.‏‏ قَالَ سُفْيَانُ قَالُوا لِهِشَامٍ - يَعْنِي ابْنَ حَسَّانَ - أَنَّ أَيُّوبَ إِنَّمَا يَنْتَهِي بِهَذَا الْحَدِيثِ إِلَى أَبِي هُرَيْرَةَ فَقَالَ إِنَّ أَيُّوبَ لَوِ اسْتَطَاعَ أَنْ لاَ يَرْفَعَ حَدِيثًا لَمْ يَرْفَعْهُ ‏‏.‏‏",
    "malay_translation": "Tidak sepatutnya sesiapa di antara kamu membuang air kecil ke dalam air yang tidak mengalir, kemudian mandi dengannya. (Salah seorang perawi) Kata Sufyan, \"Mereka bertanya kepada Hisham, iaitu Ibn Hassan, 'Adakah Ayyub hanya menghasaskan hadis ini kepada Abu Hurairah?' Maka beliau menjawab, 'Sekiranya Ayyub tidak mampu untuk mengangkat satu riwayat, maka dia tidak akan mengangkatnya.'\"  Malah, beliau meriwayatkannya daripada Abu Hurairah, bukan daripada Nabi SAW, sedangkan yang lain meriwayatkannya dalam bentuk marfu', iaitu mengangkatnya kepada Nabi SAW. Mungkin ungkapan 'jika dia mampu untuk tidak mengangkatnya' bermaksud 'jika dia tidak mampu untuk mengangkatnya.' Dan Allah lebih mengetahui."
  },
  {
    "id": 15138,
    "hadith_number": 402,
    "tajuk_hadith": "Larangan Mandi Tanpa Izar bagi Orang Mukmin",
    "perawi_melayu": "Diceritakan oleh Jabir daripada Nabi SAW",
    "english_text": "\"Barangsiapa yang beriman kepada Allah dan Hari Akhirat, janganlah dia masuk ke rumah mandi kecuali dengan memakai Izar (seluar pendek).\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ عَطَاءٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏‏\n\"‏‏ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلاَ يَدْخُلِ الْحَمَّامَ إِلاَّ بِمِئْزَرٍ ‏‏\"‏‏ ‏‏.‏‏",
    "malay_translation": "\"Barangsiapa yang beriman kepada Allah dan Hari Akhirat, janganlah dia masuk ke rumah mandi kecuali dengan memakai Izar (seluar pendek).\""
  },
  {
    "id": 15139,
    "hadith_number": 403,
    "tajuk_hadith": "Doa Memohon Pembersihan Daripada Dosa",
    "perawi_melayu": "'Abdullah bin Abi Awfa meriwayatkan bahawa Rasulullah SAW selalu berdoa:",
    "english_text": "\"Allahumma tahhirni min adh-dhunub wal-khataya. Allahumma naqqini minha kama yunaqqa ath-thawb al-abyad min ad-danas, Allahumma tahhirni bith-thalji wal-barad wal-ma' al-barid (O Allah, purify me of sin and error, O Allah cleanse me of it as a white garment is cleansed of dirt, O Allah purify me with snow and hail and cold water).\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مَجْزَأَةَ بْنِ زَاهِرٍ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى، يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ يَدْعُو ‏‏\n\"‏‏ اللَّهُمَّ طَهِّرْنِي مِنَ الذُّنُوبِ وَالْخَطَايَا اللَّهُمَّ نَقِّنِي مِنْهَا كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ اللَّهُمَّ طَهِّرْنِي بِالثَّلْجِ وَالْبَرَدِ وَالْمَاءِ الْبَارِدِ ‏‏\"‏‏ ‏‏.‏‏",
    "malay_translation": "Semoga Allah SWT membersihkan saya dari dosa dan kesalahan. Ya Allah, bersihkanlah saya dari dosa itu sebagaimana kain putih dibersihkan dari kotoran. Ya Allah, bersihkanlah saya dengan salji, hujan batu, dan air sejuk."
  },
  {
    "id": 15140,
    "hadith_number": 404,
    "tajuk_hadith": "Doa Nabi Muhammad SAW Untuk Pembersihan Diri",
    "perawi_melayu": "Dikisahkan oleh Ibn Abi Awfa bahawa:",
    "english_text": "\"The Prophet (ﷺ) used to say: 'Allahumma tahhirni bith-thalji wal-barad wal-ma' al-barid, Allahumma tahhirni min adh-dhunub kama yutahhar ath-thawb al-abyad min ad-danas (O Allah, purify me with snow and hail and cold water, O Allah, purify me of sin as a white garment is cleansed of dirt).\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ مُحَمَّدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى، قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ يَزِيدَ، عَنْ رُقْبَةَ، عَنْ مَجْزَأَةَ الأَسْلَمِيِّ، عَنِ ابْنِ أَبِي أَوْفَى، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ ‏‏\n\"‏‏ اللَّهُمَّ طَهِّرْنِي بِالثَّلْجِ وَالْبَرَدِ وَالْمَاءِ الْبَارِدِ اللَّهُمَّ طَهِّرْنِي مِنَ الذُّنُوبِ كَمَا يُطَهَّرُ الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ ‏‏\"‏‏ ‏‏.‏‏",
    "malay_translation": "Nabi Muhammad SAW pernah berdoa, \"Ya Allah, sucikanlah aku dengan salji, hujan batu, dan air sejuk. Ya Allah, sucikanlah aku daripada dosa sebagaimana pakaian putih disucikan daripada kotoran.\""
  },
  {
    "id": 15141,
    "hadith_number": 405,
    "tajuk_hadith": "Cara Rasulullah SAW Tidur dalam Keadaan Junub",
    "perawi_melayu": "Diceritakan oleh Abdullah bin Abi Qais bahawa:",
    "english_text": "\"I asked 'Aishah: 'How did the Messenger of Allah (ﷺ) sleep while he was Junub? Did he perform Ghusl before sleeping or sleep before performing Ghusl?' She said: 'He did both. Sometimes he would perform Ghusl then sleep, and sometimes he would perform Wudu' then sleep.'\"",
    "arabic_text": "أَخْبَرَنَا شُعَيْبُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَيْسٍ، قَالَ سَأَلْتُ عَائِشَةَ كَيْفَ كَانَ نَوْمُ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الْجَنَابَةِ أَيَغْتَسِلُ قَبْلَ أَنْ يَنَامَ أَوْ يَنَامُ قَبْلَ أَنْ يَغْتَسِلَ قَالَتْ كُلُّ ذَلِكَ قَدْ كَانَ يَفْعَلُ رُبَّمَا اغْتَسَلَ فَنَامَ وَرُبَّمَا تَوَضَّأَ فَنَامَ ‏‏.‏‏",
    "malay_translation": "Aku bertanya kepada 'Aishah, \"Bagaimana Rasulullah SAW tidur dalam keadaan junub? Adakah baginda mandi wajib (ghusl) terlebih dahulu sebelum tidur atau tidur dahulu sebelum mandi wajib?\"  'Aishah menjawab, \"Kedua-duanya. Kadang-kadang baginda mandi wajib kemudian tidur, dan kadang-kadang baginda berwuduk kemudian tidur.\""
  },
  {
    "id": 15142,
    "hadith_number": 406,
    "tajuk_hadith": "Kebolehan Rasulullah SAW Mengamalkan Mandi Junub Pada Awal atau Akhir Malam",
    "perawi_melayu": "Dikatakan oleh Ghudaif bin Al-Harith:",
    "english_text": "\"I entered upon 'Aishah and asked her: 'Did the Messenger of Allah (ﷺ) perform Ghusl at the beginning of the night or at the end?' She said: 'Both. Sometimes he performed Ghusl at the beginning and sometimes at the end.' I said: 'Praise be to Allah who has made the matter flexible.'\"",
    "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ بُرْدٍ، عَنْ عُبَادَةَ بْنِ نُسَىٍّ، عَنْ غُضَيْفِ بْنِ الْحَارِثِ، قَالَ دَخَلْتُ عَلَى عَائِشَةَ فَسَأَلْتُهَا فَقُلْتُ أَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَغْتَسِلُ مِنْ أَوَّلِ اللَّيْلِ أَوْ مِنْ آخِرِهِ قَالَتْ كُلُّ ذَلِكَ كَانَ رُبَّمَا اغْتَسَلَ مِنْ أَوَّلِهِ وَرُبَّمَا اغْتَسَلَ مِنْ آخِرِهِ ‏‏.‏‏ قُلْتُ الْحَمْدُ لِلَّهِ الَّذِي جَعَلَ فِي الأَمْرِ سَعَةً ‏‏.‏‏",
    "malay_translation": "Aku masuk menemui 'Aishah dan bertanya kepadanya, 'Adakah Rasulullah SAW mandi wajib (ghusl) pada awal malam atau pada akhir malam?' Dia menjawab, 'Kedua-duanya. Kadang-kadang baginda mandi wajib pada awal malam dan kadang-kadang pada akhir malam.' Aku berkata, 'Segala puji bagi Allah yang telah menjadikan perkara ini fleksibel.'"
  },
  {
    "id": 15143,
    "hadith_number": 407,
    "tajuk_hadith": "Keutamaan Menutup Aurat Semasa Mandi,",
    "perawi_melayu": "Daripada Ya'la, bahawa Rasulullah SAW melihat seorang lelaki sedang mandi wuduk di tempat terbuka, lalu baginda naik mimbar dan memuji Allah, kemudian baginda bersabda:",
    "english_text": "'Allah, the Mighty and Sublime, is forbearing, modest and concealing, and He loves modesty and concealment. When any one of you performs Ghusl, let him conceal himself.'",
    "arabic_text": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ، قَالَ حَدَّثَنَا النُّفَيْلِيُّ، قَالَ حَدَّثَنَا زُهَيْرٌ، قَالَ حَدَّثَنَا عَبْدُ الْمَلِكِ، عَنْ عَطَاءٍ، عَنْ يَعْلَى، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَأَى رَجُلاً يَغْتَسِلُ بِالْبَرَازِ فَصَعِدَ الْمِنْبَرَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ وَقَالَ ‏‏\n\"‏‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ حَلِيمٌ حَيِيٌّ سِتِّيرٌ يُحِبُّ الْحَيَاءَ وَالسَّتْرَ فَإِذَا اغْتَسَلَ أَحَدُكُمْ فَلْيَسْتَتِرْ ‏‏\"‏‏ ‏‏.‏‏",
    "malay_translation": "'Sesungguhnya Allah Yang Maha Pemurah lagi Maha Tinggi, bersifat lemah lembut, berhati mulia, dan menutup aib. Dan Dia menyukai sifat malu dan menutup aurat. Maka, apabila salah seorang daripada kamu hendak mandi wajib (ghusl), hendaklah dia menutup auratnya.'"
  },
  {
    "id": 15144,
    "hadith_number": 408,
    "tajuk_hadith": "Keutamaan Menutup Aurat Semasa Mandi",
    "perawi_melayu": "Dikisahkan daripada Safwan bin Ya'la yang berkata bapanya berkata:",
    "english_text": "\"The Messenger of Allah (ﷺ) said: 'Allah loves concealment, so when any one of you performs Ghusl let him conceal himself with something.'\"",
    "arabic_text": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ إِسْحَاقَ، قَالَ حَدَّثَنَا الأَسْوَدُ بْنُ عَامِرٍ، قَالَ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ، عَنْ عَطَاءٍ، عَنْ صَفْوَانَ بْنِ يَعْلَى، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏‏\n\"‏‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ سِتِّيرٌ فَإِذَا أَرَادَ أَحَدُكُمْ أَنْ يَغْتَسِلَ فَلْيَتَوَارَ بِشَىْءٍ ‏‏\"‏‏ ‏‏.‏‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Sesungguhnya Allah SWT Maha Penutup Aurat. Oleh itu, jika salah seorang daripada kamu hendak mandi wajib (ghusl), hendaklah dia menutup auratnya dengan sesuatu."
  },
  {
    "id": 15145,
    "hadith_number": 409,
    "tajuk_hadith": "Kisah Baginda Rasulullah SAW Mandi dan Peristiwa Kain",
    "perawi_melayu": "Diriwayatkan oleh Maimunah r.a. bahawa:",
    "english_text": "\"I put some water out for the Messenger of Allah (ﷺ), then I concealed him\" - and she mentioned how he performed Ghusl, then she said: \"Then I brought him a cloth (a towel) but he did not want it.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا عَبِيدَةُ، عَنِ الأَعْمَشِ، عَنْ سَالِمٍ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، قَالَتْ وَضَعْتُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم مَاءً - قَالَتْ - فَسَتَرْتُهُ فَذَكَرَتِ الْغُسْلَ قَالَتْ ثُمَّ أَتَيْتُهُ بِخِرْقَةٍ فَلَمْ يُرِدْهَا ‏‏.‏‏",
    "malay_translation": "“Saya menyediakan air untuk Rasulullah SAW, kemudian saya menutupinya.” – dan dia menceritakan bagaimana Baginda SAW mandi, kemudian dia berkata, “Kemudian saya membawakan kain kepadanya, tetapi Baginda SAW tidak menerimanya.”"
  },
  {
    "id": 15146,
    "hadith_number": 410,
    "tajuk_hadith": "Kemewahan dan Keredhaan Allah SWT",
    "perawi_melayu": "Dikisahkan oleh Abu Hurairah r.a.",
    "english_text": "\"The Messenger of Allah (ﷺ) said: 'While Ayyub, peace be upon him, was bathing naked, locusts of gold landed on him and he started to collect them in his garment. Then his Lord called him (saying): \"O Ayyub, did I not make you rich?\" he said: \"Yes, O Lord, but I cannot do without Your blessing.\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي إِبْرَاهِيمُ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏‏\n\"‏‏ بَيْنَمَا أَيُّوبُ عَلَيْهِ الصَّلاَةُ وَالسَّلاَمُ يَغْتَسِلُ عُرْيَانًا خَرَّ عَلَيْهِ جَرَادٌ مِنْ ذَهَبٍ فَجَعَلَ يَحْثِي فِي ثَوْبِهِ قَالَ فَنَادَاهُ رَبُّهُ عَزَّ وَجَلَّ يَا أَيُّوبُ أَلَمْ أَكُنْ أَغْنَيْتُكَ قَالَ بَلَى يَا رَبِّ وَلَكِنْ لاَ غِنَى بِي عَنْ بَرَكَاتِكَ ‏‏\"‏‏ ‏‏.‏‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Ketika Ayyub a.s. sedang mandi telanjang, sejenis serangga emas turun ke atasnya. Beliau mula mengumpulnya di dalam pakaiannya. Kemudian, Tuhannya memanggilnya (dengan firman): \"Wahai Ayyub, bukankah Aku telah memberimu kekayaan?\" Dia menjawab: \"Ya, Tuhanku, tetapi aku tidak dapat hidup tanpa berkat-Mu.\""
  },
  {
    "id": 15147,
    "hadith_number": 411,
    "tajuk_hadith": "Cara Rasulullah SAW Mandi (Ghusl) Menggunakan Satu Bekas Air",
    "perawi_melayu": "Dikisahkan oleh 'Aishah r.a. bahawa:",
    "english_text": "\"The Messenger of Allah (ﷺ) used to perform Ghusl from a vessel which was the size of a Faraq  and he and I used to perform Ghusl from a single vessel.\"\n\n See No. 230",
    "arabic_text": "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ، قَالَ حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ، عَنِ الزُّهْرِيِّ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَغْتَسِلُ فِي الإِنَاءِ وَهُوَ الْفَرَقُ وَكُنْتُ أَغْتَسِلُ أَنَا وَهُوَ مِنْ إِنَاءٍ وَاحِدٍ ‏‏.‏‏",
    "malay_translation": "Pesuruhjaya Allah (ﷺ) biasa mandi wajib (ghusl) menggunakan bekas yang sebesar faraq dan saya juga mandi wajib bersamanya menggunakan satu bekas yang sama."
  },
  {
    "id": 15148,
    "hadith_number": 412,
    "tajuk_hadith": "Penggunaan Satu Pasu Air untuk Mandi Junub oleh Rasulullah SAW dan Aisyah RA",
    "perawi_melayu": "Daripada Aisyah رضي الله عنها",
    "english_text": "It was narrated from 'Aishah that the Messenger of Allah (ﷺ) used to perform Ghusl, he and I from a single vessel, both of us scooping water from it.",
    "arabic_text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، عَنْ هِشَامٍ، ح وَأَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَغْتَسِلُ وَأَنَا مِنْ إِنَاءٍ وَاحِدٍ نَغْتَرِفُ مِنْهُ جَمِيعًا ‏‏.‏‏ وَقَالَ سُوَيْدٌ قَالَتْ كُنْتُ أَنَا ‏‏.‏‏",
    "malay_translation": "Dikisahkan daripada 'Aisyah رضي الله عنها bahawa Rasulullah SAW pernah mandi junub bersama saya, menggunakan satu pasu air yang sama.  Kami berdua mengambil air dari pasu itu."
  },
  {
    "id": 15149,
    "hadith_number": 413,
    "tajuk_hadith": "Penggunaan Satu Bekas Mandi untuk Janabah oleh Nabi SAW dan Sayyidah 'Aishah",
    "perawi_melayu": "'Abdur-Rahman bin Al-Qasim berkata:",
    "english_text": "\"I heard Al-Qasim narrating that 'Aishah said: 'I used to perform Ghusl - the Messenger of Allah (ﷺ) and I - from a single vessel for Janabah.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ، قَالَ سَمِعْتُ الْقَاسِمَ، يُحَدِّثُ عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ، صلى الله عليه وسلم مِنْ إِنَاءٍ وَاحِدٍ مِنَ الْجَنَابَةِ ‏‏.‏‏",
    "malay_translation": "'Abdur-Rahman bin Al-Qasim meriwayatkan, bahawa beliau mendengar Al-Qasim menceritakan daripada 'Aishah r.a. yang berkata, 'Saya dan Rasulullah SAW pernah mandi hadas besar (janabah) daripada bekas yang sama.' "
  },
  {
    "id": 15150,
    "hadith_number": 414,
    "tajuk_hadith": "Pernah Bersaing Menggunakan Bekas Mandi Bersama Rasulullah SAW",
    "perawi_melayu": "Dikatakan oleh 'Aishah r.a.",
    "english_text": "\"I remember competing over the vessel  with the Messenger of Allah (ﷺ), when he and I were performing Ghusl from it.\"\n\n See the following narration and no. 240.",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ لَقَدْ رَأَيْتُنِي أُنَازِعُ رَسُولَ اللَّهِ صلى الله عليه وسلم الإِنَاءَ أَغْتَسِلُ أَنَا وَهُوَ مِنْهُ ‏‏.‏‏",
    "malay_translation": "Saya pernah menyaksikan saya dan Rasulullah SAW bersaing untuk menggunakan bekas air ketika mandi wajib (ghusl).  "
  },
  {
    "id": 15151,
    "hadith_number": 415,
    "tajuk_hadith": "Perbandingan Mengambil Air Semasa Mandi (Ghusl) Bersama Rasulullah SAW",
    "perawi_melayu": "Dikisahkan oleh 'Aishah رضي الله عنها:",
    "english_text": "\"I used to perform Ghusl - the Messenger of Allah (ﷺ) and I - from one vessel. He would compete with me and I would with him (to take the water) until he would say: 'Leave me some,' and I would say, 'Leave me some.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، عَنْ مُحَمَّدٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَاصِمٍ، ح وَأَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ عَاصِمٍ، عَنْ مُعَاذَةَ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ، صلى الله عليه وسلم مِنْ إِنَاءٍ وَاحِدٍ أُبَادِرُهُ وَيُبَادِرُنِي حَتَّى يَقُولَ ‏‏\n\"‏‏ دَعِي لِي ‏‏\"‏‏ ‏‏.‏‏ وَأَقُولَ أَنَا دَعْ لِي ‏‏.‏‏ قَالَ سُوَيْدٌ يُبَادِرُنِي وَأُبَادِرُهُ فَأَقُولُ دَعْ لِي دَعْ لِي ‏‏.‏‏",
    "malay_translation": "Saya pernah mandi hadas besar (ghusl) bersama Rasulullah SAW dari satu bekas air.  Kami saling berlumba mengambil air sehingga baginda SAW berkata, \"Tinggalkanlah sedikit untukku,\" dan aku pun berkata, \"Tinggalkanlah sedikit untukku.\"  Dikatakan, baginda SAW dan saya saling berlumba dan akhirnya saya akan meminta, \"Tinggalkanlah sedikit untukku.\" Tinggalkanlah sedikit untukku."
  },
  {
    "id": 15152,
    "hadith_number": 416,
    "tajuk_hadith": "Solat Dhuha Nabi SAW Selepas Mandi Wajib",
    "perawi_melayu": "Umm Hani',",
    "english_text": "He prayed Ad-Duha - but I do not know how many Rak'ahs he prayed - after he finished Ghusl.",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ مُحَمَّدٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى بْنِ أَعْيَنَ، قَالَ حَدَّثَنَا أَبِي، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ، عَنْ عَطَاءٍ، قَالَ حَدَّثَتْنِي أُمُّ هَانِئٍ، أَنَّهَا دَخَلَتْ عَلَى النَّبِيِّ صلى الله عليه وسلم يَوْمَ فَتْحِ مَكَّةَ وَهُوَ يَغْتَسِلُ قَدْ سَتَرَتْهُ بِثَوْبٍ دُونَهُ فِي قَصْعَةٍ فِيهَا أَثَرُ الْعَجِينِ ‏‏.‏‏ قَالَتْ فَصَلَّى الضُّحَى فَمَا أَدْرِي كَمْ صَلَّى حِينَ قَضَى غُسْلَهُ ‏‏.‏‏",
    "malay_translation": "Baginda SAW telah menunaikan solat Dhuha – namun aku tidak mengetahui berapa rakaatnya – setelah selesai mandi wajib (ghusl)."
  },
  {
    "id": 15153,
    "hadith_number": 417,
    "tajuk_hadith": "Cara Rasulullah SAW dan Sayyidah 'Aishah Mengamalkan Wudhuk",
    "perawi_melayu": "'Aishah r.a berkata:",
    "english_text": "\"I remember performing Ghusl - myself and the Messenger of Allah (ﷺ), from this\" - a vessel like a Sa' or smaller. \"We both started taking water from it and I poured water over my head with my hand, three times, without undoing any of my hair.\"",
    "arabic_text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ إِبْرَاهِيمَ بْنِ طَهْمَانَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ عُبَيْدِ بْنِ عُمَيْرٍ، أَنَّ عَائِشَةَ، قَالَتْ لَقَدْ رَأَيْتُنِي أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ هَذَا فَإِذَا تَوْرٌ مَوْضُوعٌ مِثْلُ الصَّاعِ أَوْ دُونَهُ فَنَشْرَعُ فِيهِ جَمِيعًا فَأُفِيضُ عَلَى رَأْسِي بِيَدَىَّ ثَلاَثَ مَرَّاتٍ وَمَا أَنْقُضُ لِي شَعْرًا ‏‏.‏‏",
    "malay_translation": "Aku pernah menyaksikan aku dan Rasulullah SAW mandi wajib (ghusl) daripada air di dalam bekas yang seumpama sa' atau lebih kecil. Kami berdua mengambil air daripadanya, dan aku menuangkan air ke atas kepalaku dengan tangan tiga kali tanpa menguraikan rambutku."
  },
  {
    "id": 15154,
    "hadith_number": 418,
    "tajuk_hadith": "Keutamaan Menjaga Kebersihan dan Larangan Penggunaan Wangi-wangian Sebelum Ihram",
    "perawi_melayu": "Dikisahkan daripada Ibrahim bin Muhammad bin Al-Muntashir, bahawa bapanya berkata:",
    "english_text": "\"I heard Ibn 'Umar say: 'I would rather wake up in the morning covered in tar than wake up and enter Ihram with the smell of perfume coming from me.' I entered upon 'Aishah and told her what he had said, and she said: 'I put perfume on the Messenger of Allah (ﷺ) and he went round to all his wives, then in the morning he entered Ihram.'\"",
    "arabic_text": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، عَنْ وَكِيعٍ، عَنْ مِسْعَرٍ، وَسُفْيَانَ، عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ ابْنَ عُمَرَ، يَقُولُ لأَنْ أُصْبِحَ مُطَّلِيًا بِقَطِرَانٍ أَحَبُّ إِلَىَّ مِنْ أَنْ أُصْبِحَ مُحْرِمًا أَنْضَخُ طِيبًا ‏‏.‏‏ فَدَخَلْتُ عَلَى عَائِشَةَ فَأَخْبَرْتُهَا بِقَوْلِهِ فَقَالَتْ طَيَّبْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَطَافَ عَلَى نِسَائِهِ ثُمَّ أَصْبَحَ مُحْرِمًا ‏‏.‏‏",
    "malay_translation": "Dilaporkan bahawa saya mendengar Ibn 'Umar berkata, 'Lebih baik aku bangun pagi hari ini berlumuran tar daripada bangun pagi hari dan memasuki Ihram dengan bau wangi pada diriku.' Aku kemudian menemui 'Aishah dan menceritakan perkataan Ibn 'Umar kepadanya. 'Aishah berkata, 'Aku telah menggunakan wangi-wangian pada Rasulullah SAW dan baginda telah melawat semua isteri baginda, kemudian pada keesokan harinya, baginda telah memasuki Ihram.'"
  },
  {
    "id": 15155,
    "hadith_number": 419,
    "tajuk_hadith": "Cara Rasulullah SAW Mengamalkan Mandi Junub",
    "perawi_melayu": "Dikatakan oleh Maimunah:",
    "english_text": "\"The Messenger of Allah (ﷺ) performed Wudu' as for prayer, but did not wash his feet, and he washed his private part and whatever had got onto it, then he poured water over himself, then he moved his feet and washed them.\" She said: \"This is Ghusl from Janabah.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ سَالِمٍ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، قَالَتْ تَوَضَّأَ رَسُولُ اللَّهِ صلى الله عليه وسلم وُضُوءَهُ لِلصَّلاَةِ غَيْرَ رِجْلَيْهِ وَغَسَلَ فَرْجَهُ وَمَا أَصَابَهُ ثُمَّ أَفَاضَ عَلَيْهِ الْمَاءَ ثُمَّ نَحَّى رِجْلَيْهِ فَغَسَلَهُمَا ‏‏.‏‏ قَالَتْ هَذِهِ غِسْلَةٌ لِلْجَنَابَةِ ‏‏.‏‏",
    "malay_translation": "“Rasulullah SAW melakukan wuduk seperti untuk solat, tetapi tidak membasuh kedua kakinya. Baginda membasuh kemaluan dan apa sahaja yang melekat padanya, kemudian menuangkan air ke atas dirinya, kemudian mengalihkan kakinya dan membasuhnya.”  Katanya: “Inilah mandi junub.”"
  },
  {
    "id": 15156,
    "hadith_number": 420,
    "tajuk_hadith": "Cara Rasulullah SAW Mandi Junub",
    "perawi_melayu": "Dikisahkan oleh Maimunah binti al-Harith, isteri Nabi SAW, bahawa:",
    "english_text": "\"When the Messenger of Allah (ﷺ) performed Ghusl from Janabah, he would start by washing his hands, then he would pour water with his right hand onto his left and wash his private part, then he would strike his hand on the ground then wipe it then wash it. Then he would perform Wudu' as for prayer, then he would pour water on his head and all of his body. Then he would move and wash his feet.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ بِنْتِ الْحَارِثِ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا اغْتَسَلَ مِنَ الْجَنَابَةِ يَبْدَأُ فَيَغْسِلُ يَدَيْهِ ثُمَّ يُفْرِغُ بِيَمِينِهِ عَلَى شِمَالِهِ فَيَغْسِلُ فَرْجَهُ ثُمَّ يَضْرِبُ بِيَدِهِ عَلَى الأَرْضِ ثُمَّ يَمْسَحُهَا ثُمَّ يَغْسِلُهَا ثُمَّ يَتَوَضَّأُ وُضُوءَهُ لِلصَّلاَةِ ثُمَّ يُفْرِغُ عَلَى رَأْسِهِ وَعَلَى سَائِرِ جَسَدِهِ ثُمَّ يَتَنَحَّى فَيَغْسِلُ رِجْلَيْهِ ‏‏.‏‏",
    "malay_translation": "Ketika Rasulullah SAW mandi junub, Baginda akan mula dengan mencuci kedua-dua tangannya, kemudian menuang air dengan tangan kanan ke tangan kiri dan mencuci bahagian sulitnya, kemudian menepuk tangannya ke tanah, kemudian mengesanya dan mencucinya. Kemudian Baginda akan berwuduk seperti untuk solat, kemudian menuang air ke atas kepalanya dan seluruh badannya. Kemudian Baginda akan bergerak dan mencuci kedua-dua kakinya."
  },
  {
    "id": 15157,
    "hadith_number": 421,
    "tajuk_hadith": "Cara Rasulullah SAW Mandi Junub",
    "perawi_melayu": "Dikatakan oleh 'Aishah:",
    "english_text": "\"When the Messenger of Allah (ﷺ) performed Ghusl from Janabah, he would wash his hands, then perform Wudu' as for prayer, then he would perform Ghusl, then run his fingers through his hair to be sure that the water pour water over his head three times, then wash the rest of his body.\"",
    "arabic_text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا اغْتَسَلَ مِنَ الْجَنَابَةِ غَسَلَ يَدَيْهِ ثُمَّ تَوَضَّأَ وُضُوءَهُ لِلصَّلاَةِ ثُمَّ اغْتَسَلَ ثُمَّ يُخَلِّلُ بِيَدِهِ شَعْرَهُ حَتَّى إِذَا ظَنَّ أَنَّهُ قَدْ أَرْوَى بَشَرَتَهُ أَفَاضَ عَلَيْهِ الْمَاءَ ثَلاَثَ مَرَّاتٍ ثُمَّ غَسَلَ سَائِرَ جَسَدِهِ ‏.‏",
    "malay_translation": "Apabila Rasulullah SAW mandi junub, baginda akan membasuh kedua-dua tangannya, kemudian melakukan wuduk seperti untuk solat, kemudian mandi junub, kemudian melepaskan rambutnya dengan jari tangan untuk memastikan air sampai ke kulit kepalanya sebanyak tiga kali, dan kemudian membasuh seluruh badannya."
  },
  {
    "id": 15158,
    "hadith_number": 422,
    "tajuk_hadith": "Keutamaan Berbuat Baik dengan Tangan Kanan",
    "perawi_melayu": "Dikisahkan oleh 'Aisyah r.a.",
    "english_text": "\"The Prophet (ﷺ) used to like to start with the right as much as he could when purifying himself, putting on sandals and combing his hair\" - and he (the narrator) said in Wasit (a place in Iraq): \"And in all his affairs.\"",
    "arabic_text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ شُعْبَةَ، عَنِ الأَشْعَثِ بْنِ أَبِي الشَّعْثَاءِ، عَنْ أَبِيهِ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُحِبُّ التَّيَمُّنَ مَا اسْتَطَاعَ فِي طُهُورِهِ وَتَنَعُّلِهِ وَتَرَجُّلِهِ وَقَالَ بِوَاسِطٍ فِي شَأْنِهِ كُلِّهِ ‏.‏",
    "malay_translation": "Rasulullah saw. amat suka memulakan sesuatu dengan tangan kanan semampu yang boleh ketika bersuci, memakai sandal, dan menyisir rambutnya. – dan beliau (perawi) berkata di Wasit (sebuah tempat di Iraq): – dan dalam semua urusannya."
  },
  {
    "id": 15159,
    "hadith_number": 423,
    "tajuk_hadith": "Cara Rasulullah SAW Melaksanakan Mandi Junub",
    "perawi_melayu": "Diceritakan daripada Abu Salamah daripada 'Aishah, dan daripada 'Amr bin Sa'd, daripada Nafi', daripada Ibn 'Umar",
    "english_text": "That 'Umar asked the Messenger of Allah (ﷺ) about Ghusl from Janabah - and the narrations agree on this - that one should start by pouring water on the right hand two or three times, then put the right hand into the vessel and pour water with it onto the private parts, with the left hand on the private parts to wash off whatever is there, until it is clean; then put the left hand on the dust if one wants to, then pour water over the left hand until it is clean; then wash the hands three times, (sniff water into the nose) and rinse the mouth, and wash the face and forearms, three times each until when reaching the head, he does not wipe the head, rather he pours water over it. This is how the Messenger of Allah (ﷺ) performed Ghusl according to what was mentioned.",
    "arabic_text": "أَخْبَرَنَا عِمْرَانُ بْنُ يَزِيدَ بْنِ خَالِدٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، - هُوَ ابْنُ سَمَاعَةَ - قَالَ أَنْبَأَنَا الأَوْزَاعِيُّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، وَعَنْ عَمْرِو بْنِ سَعْدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عُمَرَ، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الْغُسْلِ مِنَ الْجَنَابَةِ وَاتَّسَقَتِ الأَحَادِيثُ عَلَى هَذَا يَبْدَأُ فَيُفْرِغُ عَلَى يَدِهِ الْيُمْنَى مَرَّتَيْنِ أَوْ ثَلاَثًا ثُمَّ يُدْخِلُ يَدَهُ الْيُمْنَى فِي الإِنَاءِ فَيَصُبُّ بِهَا عَلَى فَرْجِهِ وَيَدُهُ الْيُسْرَى عَلَى فَرْجِهِ فَيَغْسِلُ مَا هُنَالِكَ حَتَّى يُنْقِيَهُ ثُمَّ يَضَعُ يَدَهُ الْيُسْرَى عَلَى التُّرَابِ إِنْ شَاءَ ثُمَّ يَصُبُّ عَلَى يَدِهِ الْيُسْرَى حَتَّى يُنْقِيَهَا ثُمَّ يَغْسِلُ يَدَيْهِ ثَلاَثًا وَيَسْتَنْشِقُ وَيُمَضْمِضُ وَيَغْسِلُ وَجْهَهُ وَذِرَاعَيْهِ ثَلاَثًا ثَلاَثًا حَتَّى إِذَا بَلَغَ رَأْسَهُ لَمْ يَمْسَحْ وَأَفْرَغَ عَلَيْهِ الْمَاءَ فَهَكَذَا كَانَ غُسْلُ رَسُولِ اللَّهِ صلى الله عليه وسلم فِيمَا ذُكِرَ ‏.‏",
    "malay_translation": "Umar r.a. bertanya kepada Rasulullah SAW tentang cara mandi junub. Hadis-hadis tersebut sepakat tentang perkara ini.  Dimulakan dengan menuang air ke tangan kanan dua atau tiga kali, kemudian memasukkan tangan kanan ke dalam bekas air dan menuangkannya ke bahagian sulit, sementara tangan kiri diletakkan di bahagian sulit untuk membasuh segala kotoran sehingga bersih. Kemudian, boleh meletakkan tangan kiri di atas tanah jika dikehendaki, lalu menuangkan air ke atas tangan kiri hingga bersih. Kemudian, cuci kedua tangan sebanyak tiga kali,  menghirup air ke dalam hidung, membilas mulut, mencuci muka dan kedua lengan sebanyak tiga kali masing-masing.  Apabila sampai pada kepala, tidak diusap, tetapi dituangkan air ke atasnya.  Demikianlah cara Rasulullah SAW mandi junub sebagaimana yang disebutkan."
  },
  {
    "id": 15160,
    "hadith_number": 424,
    "tajuk_hadith": "Cara Rasulullah SAW Mandi Junub",
    "perawi_melayu": "Dikisahkan oleh 'Aishah RA:",
    "english_text": "\"When the Messenger of Allah (ﷺ0 performed Ghusl from Janabah, he would wash his hands, then perform Wudu' as for prayer, then run his fingers through his hair until he was sure the water had reached the scalp, then he would pour water over his head three times, then wash the rest of his body.\"",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا اغْتَسَلَ مِنَ الْجَنَابَةِ غَسَلَ يَدَيْهِ ثُمَّ تَوَضَّأَ وُضُوءَهُ لِلصَّلاَةِ ثُمَّ يُخَلِّلُ رَأْسَهُ بِأَصَابِعِهِ حَتَّى إِذَا خُيِّلَ إِلَيْهِ أَنَّهُ قَدِ اسْتَبْرَأَ الْبَشَرَةَ غَرَفَ عَلَى رَأْسِهِ ثَلاَثًا ثُمَّ غَسَلَ سَائِرَ جَسَدِهِ ‏.‏",
    "malay_translation": "Ketika Rasulullah SAW mandi junub, baginda akan mencuci kedua-dua tangannya, kemudian melakukan wuduk seperti untuk solat, lalu mencelupkan jari-jarinya ke dalam rambutnya sehingga yakin air telah sampai ke kulit kepala, kemudian menuangkan air ke atas kepalanya sebanyak tiga kali, kemudian membasuh seluruh badan."
  },
  {
    "id": 15161,
    "hadith_number": 425,
    "tajuk_hadith": "Cara Rasulullah SAW Mandi Junub",
    "perawi_melayu": "'Aishah r.a. meriwayatkan:",
    "english_text": "\"When the Messenger of Allah (ﷺ) performed Ghusl from Janabah, he would call for something like a vessel used for milking a she-camel, then he would take (some water) in his hand and start with the right side of his head, then the left, then take (some water) in his hands and start pouring it on his head.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ، عَنْ حَنْظَلَةَ بْنِ أَبِي سُفْيَانَ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا اغْتَسَلَ مِنَ الْجَنَابَةِ دَعَا بِشَىْءٍ نَحْوِ الْحِلاَبِ فَأَخَذَ بِكَفِّهِ بَدَأَ بِشِقِّ رَأْسِهِ الأَيْمَنِ ثُمَّ الأَيْسَرِ ثُمَّ أَخَذَ بِكَفَّيْهِ فَقَالَ بِهِمَا عَلَى رَأْسِهِ ‏.‏",
    "malay_translation": "Ketika Rasulullah SAW mandi junub, Baginda akan memanggil sesuatu yang menyerupai bekas untuk memerah susu unta betina, kemudian Baginda akan mengambil air di tangannya dan memulakan dengan sebelah kanan kepala, kemudian sebelah kiri, kemudian mengambil air di kedua-dua tangan dan menuangkannya ke atas kepala."
  },
  {
    "id": 15162,
    "hadith_number": 426,
    "tajuk_hadith": "Cara Rasulullah SAW Melakukan Wudhuk",
    "perawi_melayu": "Diceritakan oleh Jubair bin Mut'im bahawa Nabi SAW pernah dibincangkan tentang Wudhuk, dan baginda bersabda:",
    "english_text": "\"As for me, I pour water on my head three times.\"",
    "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، عَنْ يَحْيَى، عَنْ شُعْبَةَ، قَالَ حَدَّثَنَا أَبُو إِسْحَاقَ، ح وَأَنْبَأَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، عَنْ شُعْبَةَ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ سُلَيْمَانَ بْنَ صُرَدٍ، يُحَدِّثُ عَنْ جُبَيْرِ بْنِ مُطْعِمٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم ذُكِرَ عِنْدَهُ الْغُسْلُ فَقَالَ ‏\n\"‏ أَمَّا أَنَا فَأُفْرِغُ عَلَى رَأْسِي ثَلاَثًا ‏\"‏ ‏.‏ لَفْظُ سُوَيْدٍ ‏.‏",
    "malay_translation": "“Adapun aku, aku menuangkan air ke atas kepalaku sebanyak tiga kali.”"
  },
  {
    "id": 15163,
    "hadith_number": 427,
    "tajuk_hadith": "Cara Rasulullah SAW Mengambil Mandi Wuduk",
    "perawi_melayu": "Dikatakan oleh Jabir bahawa:",
    "english_text": "\"Ketika Rasulullah SAW mengambil wuduk, baginda akan mencurahkan air ke atas kepalanya tiga kali.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ شُعْبَةَ، عَنْ مُخَوَّلٍ، عَنْ أَبِي جَعْفَرٍ، عَنْ جَابِرٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا اغْتَسَلَ أَفْرَغَ عَلَى رَأْسِهِ ثَلاَثًا ‏.‏",
    "malay_translation": "Baginda Rasulullah SAW apabila mandi, baginda akan menuangkan air ke atas kepalanya tiga kali."
  },
  {
    "id": 15164,
    "hadith_number": 428,
    "tajuk_hadith": "Penjelasan Mengenai Mandi Junub dan Kekeliruan Seorang Wanita",
    "perawi_melayu": "Daripada 'Aishah:",
    "english_text": "\"A woman asked the Prophet (ﷺ): 'O Messenger of Allah, how should I perform Ghusl when I become pure?' He said: 'Take a piece of cotton wool scented with musk and clean yourself with it.' She said: 'How should I clean myself with it?' He said: 'Clean yourself with it.' She said: \"How should I clean myself with it?' The Messenger of Allah (ﷺ) said: 'Subhan Allah!' and turned away from her.\" 'Aishah understood what the Messenger of Allah (ﷺ) meant, and said: \"So I pulled her toward me and told her what the Messenger of Allah (ﷺ) meant.\"",
    "arabic_text": "أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا عَفَّانُ، قَالَ حَدَّثَنَا وُهَيْبٌ، قَالَ حَدَّثَنَا مَنْصُورُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أُمِّهِ، صَفِيَّةَ بِنْتِ شَيْبَةَ عَنْ عَائِشَةَ، أَنَّ امْرَأَةً، سَأَلَتِ النَّبِيَّ صلى الله عليه وسلم قَالَتْ يَا رَسُولَ اللَّهِ كَيْفَ أَغْتَسِلُ عِنْدَ الطُّهُورِ قَالَ ‏\"‏ خُذِي فِرْصَةً مُمَسَّكَةً فَتَوَضَّئِي بِهَا ‏\"‏ ‏.‏ قَالَتْ كَيْفَ أَتَوَضَّأُ بِهَا قَالَ ‏\"‏ تَوَضَّئِي بِهَا ‏\"‏ ‏.‏ قَالَتْ كَيْفَ أَتَوَضَّأُ بِهَا قَالَتْ ثُمَّ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سَبَّحَ وَأَعْرَضَ عَنْهَا فَفَطِنَتْ عَائِشَةُ لِمَا يُرِيدُ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَتْ فَأَخَذْتُهَا وَجَبَذْتُهَا إِلَىَّ فَأَخْبَرْتُهَا بِمَا يُرِيدُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Seorang wanita bertanya kepada Nabi SAW, 'Ya Rasulullah, bagaimana saya harus mandi hadas ketika suci?' Baginda menjawab, 'Ambillah sekeping kapas yang berbau wangi seperti musk, dan bersihkan diri dengannya.' Wanita itu bertanya, 'Bagaimana saya harus membersihkan diri dengannya?' Baginda menjawab, 'Bersihkan diri dengannya.' Wanita itu bertanya lagi, 'Bagaimana saya harus membersihkan diri dengannya?'  Kemudian Rasulullah SAW berseru 'Subhanallah!' dan berpaling daripada wanita itu.  'Aishah memahami maksud Rasulullah SAW, lalu menarik wanita itu dan menjelaskan maksud Rasulullah SAW kepadanya."
  },
  {
    "id": 15165,
    "hadith_number": 429,
    "tajuk_hadith": "Cara Rasulullah SAW Mandi Junub",
    "perawi_melayu": "Diriwayatkan oleh Maimunah, isteri Nabi SAW, bahawa:",
    "english_text": "\"The Prophet (ﷺ) performed Ghusl from Janabah; he washed his private part then rubbed his hand on the ground or the wall, then he performed Wudu' as for prayer, then he poured water over his head and the rest of his body.\"",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتِ اغْتَسَلَ النَّبِيُّ صلى الله عليه وسلم مِنَ الْجَنَابَةِ فَغَسَلَ فَرْجَهُ وَدَلَكَ يَدَهُ بِالأَرْضِ أَوِ الْحَائِطِ ثُمَّ تَوَضَّأَ وُضُوءَهُ لِلصَّلاَةِ ثُمَّ أَفَاضَ عَلَى رَأْسِهِ وَسَائِرِ جَسَدِهِ ‏.‏",
    "malay_translation": "Rasulullah SAW telah mandi junub. Baginda membasuh anggota sulit, kemudian memijat tangannya ke tanah atau dinding. Selepas itu, Baginda melakukan wuduk seperti untuk solat, lalu mencurahkan air ke atas kepala dan seluruh badan."
  },
  {
    "id": 15166,
    "hadith_number": 430,
    "tajuk_hadith": "Keperluan dan Tindakan Ketika Melahirkan di Waktu Ihram Haji",
    "perawi_melayu": "Ja'far bin Muhammad berkata:",
    "english_text": "\"My father told me: 'We came to Jabir bin 'Abdullah and asked him about the Hajj of the Prophet (ﷺ). He narrated; \"The Messenger of Allah (ﷺ) set out when there were five (days) remaining in Dhul-Qa'dah, and we set out with him. When he came to Dhul-Hulaifah, Asma' bint 'Umais gave birth to Muhammad bin Abi Bakr. She sent word to the Messenger of Allah (ﷺ) asking what he should do. He said: 'Perform Ghusl, bind yourself with a cloth then begin (the Talbiyah for Ihram).'\"",
    "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لَهُ - قَالُوا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنِي أَبِي قَالَ، أَتَيْنَا جَابِرَ بْنَ عَبْدِ اللَّهِ فَسَأَلْنَاهُ عَنْ حَجَّةِ الْوَدَاعِ، فَحَدَّثَنَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ لِخَمْسٍ بَقِينَ مِنْ ذِي الْقَعْدَةِ ‏.‏ وَخَرَجْنَا مَعَهُ حَتَّى إِذَا أَتَى ذَا الْحُلَيْفَةِ وَلَدَتْ أَسْمَاءُ بِنْتُ عُمَيْسٍ مُحَمَّدَ بْنَ أَبِي بَكْرٍ فَأَرْسَلَتْ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم كَيْفَ أَصْنَعُ فَقَالَ ‏\n\"‏ اغْتَسِلِي ثُمَّ اسْتَثْفِرِي ثُمَّ أَهِلِّي ‏\"‏ ‏.‏",
    "malay_translation": "Amir bin 'Ali, Muhammad bin Al-Muthanna, dan Ya'qub bin Ibrahim, menceritakan kepada kami, yang mereka mendengar dari Yahya bin Said, yang mendengar dari Ja'far bin Muhammad, yang mendengar dari bapanya.  Mereka menemui Jabir bin Abdullah dan bertanya tentang haji perpisahan Nabi SAW. Jabir menceritakan bahawa Rasulullah SAW berangkat ketika tinggal lima hari lagi daripada Zulqaedah. Kami turut serta dengan baginda. Sampai di Dzul Hulaifah, Asma' binti Umais melahirkan Muhammad bin Abi Bakar. Beliau menghantar utusan kepada Rasulullah SAW bertanya apa yang perlu dilakukannya. Rasulullah SAW menjawab, \"Mandilah (ghusl), ikatlah dengan kain, kemudian niat ihram.\""
  },
  {
    "id": 15167,
    "hadith_number": 431,
    "tajuk_hadith": "Rasulullah SAW Tidak Berwuduk Selepas Mandi Besar",
    "perawi_melayu": "Dikatakan oleh 'Aishah:",
    "english_text": "\"The Messenger of Allah (ﷺ) would not perform Wudu' after Ghusl.\"",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ، قَالَ حَدَّثَنَا أَبِي، حَدَّثَنَا حَسَنٌ، عَنْ أَبِي إِسْحَاقَ، ح وَأَنْبَأَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا شَرِيكٌ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لاَ يَتَوَضَّأُ بَعْدَ الْغُسْلِ ‏.‏",
    "malay_translation": "Rasulullah SAW tidak akan berwuduk setelah mandi wajib (ghusl). "
  },
  {
    "id": 15168,
    "hadith_number": 432,
    "tajuk_hadith": "Rasulullah SAW Memakai Wangi sebelum Ihram",
    "perawi_melayu": "Aishah r.a berkata:",
    "english_text": "\"I used to put perfume on the Messenger of Allah (ﷺ) and he would go around to all his wives, then enter Ihram in the morning with the smell of perfume coming from him.\"",
    "arabic_text": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، عَنْ بِشْرٍ، - وَهُوَ ابْنُ الْمُفَضَّلِ - قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، قَالَ قَالَتْ عَائِشَةُ كُنْتُ أُطَيِّبُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَيَطُوفُ عَلَى نِسَائِهِ ثُمَّ يُصْبِحُ مُحْرِمًا يَنْضَخُ طِيبًا ‏.‏",
    "malay_translation": "Aishah r.a. berkata, \"Saya biasa memakai wangi-wangian pada Rasulullah SAW dan baginda akan melawat semua isteri baginda, kemudian masuk ihram pada waktu pagi dengan bau wangi masih tertinggal di tubuh baginda.\""
  },
  {
    "id": 15169,
    "hadith_number": 433,
    "tajuk_hadith": "Keistimewaan Rasulullah SAW dan Misi Kepada Seluruh Manusia",
    "perawi_melayu": "Diriwayatkan bahawa Jabir bin Abdullah berkata:",
    "english_text": "\"The Messenger of Allah (ﷺ) said: 'I have been given five things that were not given to anyone before me: I have been supported with fear being struck into the hearts of my enemy for a distance of one month's travel; the earth has been made a place of prostration and a means of purification for me, so wherever a man of my Ummah is when the time for prayer comes, let him pray; I have been given the intercession which was not given to any Prophet before me; and I have been sent to all of mankind whereas the Prophets before me were sent to their own people.\"",
    "arabic_text": "أَخْبَرَنَا الْحَسَنُ بْنُ إِسْمَاعِيلَ بْنِ سُلَيْمَانَ، قَالَ حَدَّثَنَا هُشَيْمٌ، قَالَ أَنْبَأَنَا سَيَّارٌ، عَنْ يَزِيدَ الْفَقِيرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أُعْطِيتُ خَمْسًا لَمْ يُعْطَهُنَّ أَحَدٌ قَبْلِي نُصِرْتُ بِالرُّعْبِ مَسِيرَةَ شَهْرٍ وَجُعِلَتْ لِيَ الأَرْضُ مَسْجِدًا وَطَهُورًا فَأَيْنَمَا أَدْرَكَ الرَّجُلَ مِنْ أُمَّتِي الصَّلاَةُ يُصَلِّي وَأُعْطِيتُ الشَّفَاعَةَ وَلَمْ يُعْطَ نَبِيٌّ قَبْلِي وَبُعِثْتُ إِلَى النَّاسِ كَافَّةً وَكَانَ النَّبِيُّ يُبْعَثُ إِلَى قَوْمِهِ خَاصَّةً ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Aku telah diberi lima perkara yang tidak diberikan kepada sesiapa pun sebelumku: Aku telah ditolong dengan rasa takut yang ditanam dalam hati musuhku sejauh perjalanan sebulan; bumi telah dijadikan tempat sujud dan penyucian bagiku, maka di mana sahaja seorang dari umatku dijumpai pada waktu solat, hendaklah dia solat; aku telah diberi syafaat yang tidak diberikan kepada mana-mana nabi sebelumku; dan aku diutus kepada seluruh umat manusia, sedangkan nabi-nabi sebelumku diutus kepada kaum mereka masing-masing.\" "
  },
  {
    "id": 15170,
    "hadith_number": 434,
    "tajuk_hadith": "Ketepatan Sunnah dan Ganjaran Dua Solat",
    "perawi_melayu": "Diriwayatkan daripada Abu Sa'id bahawa dua orang lelaki telah melakukan tayammum dan menunaikan solat, kemudian mereka mendapati air ketika masih ada masa untuk solat. Salah seorang daripada mereka telah melakukan wuduk dan mengulangi solat, manakala yang lain tidak. Mereka bertanyakan kepada Nabi SAW mengenai perkara tersebut, dan baginda bersabda kepada orang yang tidak mengulangi solat:",
    "english_text": "\"You followed the Sunnah and your prayer is acceptable.\" And he said to the other: \"And you will have something like the reward of two prayers.\"",
    "arabic_text": "أَخْبَرَنَا مُسْلِمُ بْنُ عَمْرِو بْنِ مُسْلِمٍ، قَالَ حَدَّثَنِي ابْنُ نَافِعٍ، عَنِ اللَّيْثِ بْنِ سَعْدٍ، عَنْ بَكْرِ بْنِ سَوَادَةَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ، أَنَّ رَجُلَيْنِ، تَيَمَّمَا وَصَلَّيَا ثُمَّ وَجَدَا مَاءً فِي الْوَقْتِ فَتَوَضَّأَ أَحَدُهُمَا وَعَادَ لِصَلاَتِهِ مَا كَانَ فِي الْوَقْتِ وَلَمْ يُعِدِ الآخَرُ فَسَأَلاَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ لِلَّذِي لَمْ يُعِدْ ‏\"‏ أَصَبْتَ السُّنَّةَ وَأَجْزَأَتْكَ صَلاَتُكَ ‏\"‏ ‏.‏ وَقَالَ لِلآخَرِ ‏\"‏ أَمَّا أَنْتَ فَلَكَ مِثْلُ سَهْمِ جَمْعٍ ‏\"‏ ‏.‏",
    "malay_translation": "“Engkau telah mengikut Sunnah dan solatmu dikira sah.” Dan baginda bersabda kepada yang lain, “Adapun engkau, engkau akan mendapat ganjaran seperti pahala dua solat.”"
  },
  {
    "id": 15171,
    "hadith_number": 435,
    "tajuk_hadith": "Dua Orang Lelaki dan Hadis yang Disampaikan",
    "perawi_melayu": "",
    "english_text": "It was narrated from 'Ata' bin Yasar that two men - and he quoted the Hadith.",
    "arabic_text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، عَنْ لَيْثِ بْنِ سَعْدٍ، قَالَ حَدَّثَنِي عَمِيرَةُ، وَغَيْرُهُ، عَنْ بَكْرِ بْنِ سَوَادَةَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ رَجُلَيْنِ، وَسَاقَ الْحَدِيثَ، ‏.‏",
    "malay_translation": "Diriwayatkan daripada 'Ata' bin Yasar bahawa dua orang lelaki – dan beliau telah menyampaikan hadis tersebut."
  },
  {
    "id": 15172,
    "hadith_number": 436,
    "tajuk_hadith": "Ketepatan Seorang yang Menunaikan Tayammum",
    "perawi_melayu": "Daripada Tariq bin Syihab",
    "english_text": "\"You did the right thing.\" Then another man became Junub so he performed Tayammum and prayed. He came (to the Prophet (ﷺ)) who said to him what he had said to the other man- meaning, \"You did the right thing.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، أَنْبَأَنَا أُمَيَّةُ بْنُ خَالِدٍ، حَدَّثَنَا شُعْبَةُ، أَنَّ مُخَارِقًا، أَخْبَرَهُمْ عَنْ طَارِقِ بْنِ شِهَابٍ، أَنَّ رَجُلاً، أَجْنَبَ فَلَمْ يُصَلِّ فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَذَكَرَ ذَلِكَ لَهُ فَقَالَ ‏\"‏ أَصَبْتَ ‏\"‏ ‏.‏ فَأَجْنَبَ رَجُلٌ آخَرُ فَتَيَمَّمَ وَصَلَّى فَأَتَاهُ فَقَالَ نَحْوًا مِمَّا قَالَ لِلآخَرِ يَعْنِي ‏\"‏ أَصَبْتَ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada Tariq bin Syihab, diceritakan bahawa seorang lelaki menjadi junub dan tidak menunaikan solat. Dia mendatangi Nabi SAW dan memberitahu hal itu, lalu baginda bersabda, \"Engkau telah berbuat betul.\"\" Kemudian, seorang lelaki lain menjadi junub, lalu dia melakukan tayammum dan menunaikan solat. Dia datang kepada baginda dan baginda bersabda dengan maksud yang sama seperti yang baginda katakan kepada orang yang pertama, iaitu, \"Engkau telah berbuat betul.\""
  },
  {
    "id": 15173,
    "hadith_number": 437,
    "tajuk_hadith": "Petunjuk Rasulullah SAW Mengenai Madhi",
    "perawi_melayu": "Dikisahkan oleh Ibn 'Abbas",
    "english_text": "\"Ali, Al-Miqdad dan 'Ammar sedang berbincang. 'Ali berkata: 'Aku seorang yang mengeluarkan banyak madhi, tetapi aku malu bertanya kepada Rasulullah SAW tentang hal itu kerana kedudukan anak baginda di sisiku. Maka biarkanlah salah seorang daripada kalian bertanya.' Dia memberitahu bahawa salah seorang dari mereka - tetapi aku lupa siapakah - bertanya kepadanya, dan Nabi SAW menjawab: 'Itulah madhi. Jika salah seorang daripada kalian menemukannya, hendaklah dia membasuhnya dan berwudhuk seperti wudhuk untuk solat.'\"",
    "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ مَيْمُونٍ، قَالَ حَدَّثَنَا مَخْلَدُ بْنُ يَزِيدَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ تَذَاكَرَ عَلِيٌّ وَالْمِقْدَادُ وَعَمَّارٌ فَقَالَ عَلِيٌّ إِنِّي امْرَؤٌ مَذَّاءٌ وَإِنِّي أَسْتَحِي أَنْ أَسْأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم لِمَكَانِ ابْنَتِهِ مِنِّي فَيَسْأَلُهُ أَحَدُكُمَا فَذَكَرَ لِي أَنَّ أَحَدَهُمَا وَنَسِيتُهُ سَأَلَهُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ ذَاكَ الْمَذْىُ إِذَا وَجَدَهُ أَحَدُكُمْ فَلْيَغْسِلْ ذَلِكَ مِنْهُ وَلْيَتَوَضَّأْ وُضُوءَهُ لِلصَّلاَةِ أَوْ كَوُضُوءِ الصَّلاَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Dikisahkan bahawa Ali, Al-Miqdad, dan 'Ammar sedang berbincang. Ali berkata, \"Aku seorang yang sering mengeluarkan madhi, tetapi aku malu bertanya kepada Rasulullah SAW tentangnya disebabkan kedudukan puteri baginda di sisiku. Biarlah salah seorang dari kalian bertanya.\" Dia menceritakan bahawa salah seorang dari mereka, tetapi aku lupa siapa, bertanya kepada baginda, dan Nabi SAW menjawab, \"Itulah madhi. Jika salah seorang dari kalian menjumpainya, hendaklah dia membasuhnya dan berwuduk seperti wuduk untuk solat.\""
  },
  {
    "id": 15174,
    "hadith_number": 438,
    "tajuk_hadith": "Keperluan Mandi Bersihkan Madzi",
    "perawi_melayu": "Dikisahkan bahawa 'Ali bin Abi Talib رضي الله عنه telah berkata:",
    "english_text": "\"I was a man who emotted a great deal of Madhi. I told a man to ask the Prophet (ﷺ) (about that) and he said: 'Wudu' (is required) for that.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ: حَدَّثَنَا عَبِيدَةُ قَالَ: حَدَّثَنَا سُلَيْمَانُ الأَعْمَشُ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: كُنْتُ رَجُلاً مَذَّاءً فَأَمَرْتُ رَجُلاً فَسَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «فِيهِ الْوُضُوءُ».",
    "malay_translation": "“Aku pernah seorang lelaki yang kerap mengeluarkan madzi. Lalu aku meminta seorang lelaki bertanya kepada Nabi SAW (tentang masalah itu) dan Baginda SAW menjawab, 'Diperlukan wuduk untuknya.’”"
  },
  {
    "id": 15175,
    "hadith_number": 439,
    "tajuk_hadith": "Keperluan Mandi Kecil (Wuduk) dalam Keadaan Madhi",
    "perawi_melayu": "Dikatakan oleh 'Ali bin Abi Talib, radhiyallahu 'anhu",
    "english_text": "\"I felt too shy to ask the Messenger of Allah (ﷺ) about Madhi because of Fatimah, so I told Al-Miqdad to ask him, and he said: 'Wudu' (is required) for that.'\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي سُلَيْمَانُ الأَعْمَشُ، قَالَ سَمِعْتُ مُنْذِرًا، عَنْ مُحَمَّدِ بْنِ عَلِيٍّ، عَنْ عَلِيٍّ، - رضى الله عنه - قَالَ اسْتَحْيَيْتُ أَنْ أَسْأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الْمَذْىِ مِنْ أَجْلِ فَاطِمَةَ فَأَمَرْتُ الْمِقْدَادَ فَسَأَلَهُ فَقَالَ ‏\n\"‏ فِيهِ الْوُضُوءُ ‏\"‏ ‏.‏",
    "malay_translation": "\"Saya merasa terlalu malu untuk bertanya kepada Rasulullah صلى الله عليه وسلم tentang Madhi kerana Fatimah, maka saya suruh Al-Miqdad bertanya kepadanya, dan beliau menjawab, 'Wuduk (mandi kecil) diperlukan untuk keadaan itu.'\""
  },
  {
    "id": 15176,
    "hadith_number": 440,
    "tajuk_hadith": "Petunjuk Mengenai Mandi Wajib Bagi Orang Yang Mengalami Madhi",
    "perawi_melayu": "'Ali r.a.",
    "english_text": "\"I sent Al-Miqdad to the Messenger of Allah (ﷺ) to ask him about Madhi, and he said: 'Perform Wudu' and sprinkle water over your private part.'\"\nAbu 'Abdur-Rahman said: Makhramah (one of the narrators) did not hear anything from his father.",
    "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عِيسَى عَنِ ابْنِ وَهْبٍ وَذَكَرَ كَلِمَةً مَعْنَاهَا أَخْبَرَنِي مَخْرَمَةُ بْنُ بُكَيْرٍ عَنْ أَبِيهِ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ أَرْسَلْتُ الْمِقْدَادَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْأَلُهُ عَنِ الْمَذْيِ فَقَالَ: «تَوَضَّأْ وَانْضَحْ فَرْجَكَ».\nقَالَ أَبُو عَبْدِ الرَّحْمَنِ: مَخْرَمَةُ لَمْ يَسْمَعْ مِنْ أَبِيهِ شَيْئًا.",
    "malay_translation": "“Aku mengutus Al-Miqdad kepada Rasulullah SAW untuk bertanya tentang Madhi, dan baginda bersabda: ‘Lakukan wuduk dan siramkan air ke bahagian sulitmu.’”  Abu Abdur-Rahman berkata: Makhramah (salah seorang perawi) tidak mendengar apa-apa daripada bapanya."
  },
  {
    "id": 15177,
    "hadith_number": 441,
    "tajuk_hadith": "Cara Membersihkan Diri Setelah Menemui Madzi",
    "perawi_melayu": "Dikatakan oleh Sulaiman bin Yasar bahawa:",
    "english_text": "\"Ali bin Abi Talib menghantar Al-Miqdad kepada Rasulullah SAW untuk bertanya tentang seorang lelaki yang mengalami madzi. Rasulullah SAW bersabda: 'Hendaklah dia mencuci zakarnya, kemudian berwuduk'.\"",
    "arabic_text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ لَيْثِ بْنِ سَعْدٍ، عَنْ بُكَيْرِ بْنِ الأَشَجِّ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، قَالَ أَرْسَلَ عَلِيُّ بْنُ أَبِي طَالِبٍ - رضى الله عنه - الْمِقْدَادَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم يَسْأَلُهُ عَنِ الرَّجُلِ يَجِدُ الْمَذْىَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَغْسِلُ ذَكَرَهُ ثُمَّ لْيَتَوَضَّأْ ‏\"‏ ‏.‏",
    "malay_translation": "Ali bin Abi Talib menghantar Al-Miqdad kepada Rasulullah SAW untuk menanyakan tentang seorang lelaki yang mengalami Madzi. Rasulullah SAW bersabda, \"Hendaklah dia mencuci zakarnya, kemudian berwuduk.\""
  },
  {
    "id": 15178,
    "hadith_number": 442,
    "tajuk_hadith": "Tatacara Membersihkan Diri Jika Mengalami Madzi",
    "perawi_melayu": "Daripada Al-Miqdad bin Al-Aswad, daripada Ali bin Abi Talib, semoga Allah merahmati mereka berdua.",
    "english_text": ") \"For his daughter is (married) to me and I feel too shy to ask him.\" So he asked the Messenger of Allah (ﷺ) about that and he said: \"If any one of you notices that let him sprinkle water on his private parts and perform Wudu' as for prayer.\"",
    "arabic_text": "أَخْبَرَنَا عُتْبَةُ بْنُ عَبْدِ اللَّهِ، قَالَ قُرِئَ عَلَى مَالِكٍ وَأَنَا أَسْمَعُ، عَنْ أَبِي النَّضْرِ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنِ الْمِقْدَادِ بْنِ الأَسْوَدِ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، رضى الله عنه أَمَرَهُ أَنْ يَسْأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الرَّجُلِ إِذَا دَنَا مِنَ الْمَرْأَةِ فَخَرَجَ مِنْهُ الْمَذْىُ فَإِنَّ عِنْدِي ابْنَتَهُ وَأَنَا أَسْتَحْيِي أَنْ أَسْأَلَهُ ‏.‏ فَسَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَقَالَ ‏\n\"‏ إِذَا وَجَدَ أَحَدُكُمْ ذَلِكَ فَلْيَنْضَحْ فَرْجَهُ وَلْيَتَوَضَّأْ وُضُوءَهُ لِلصَّلاَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Dikisahkan bahawa Ali bin Abi Talib, semoga Allah meridhainya, mengarahkan seseorang untuk bertanya kepada Rasulullah SAW tentang seorang lelaki yang hampir dengan seorang wanita dan mengalami keluarnya Madzi. Lelaki itu merasa malu untuk bertanya sendiri. Lalu lelaki itu bertanya kepada Rasulullah SAW.  Baginda bersabda, \"Apabila seseorang dari kalian menemui keadaan sedemikian, maka hendaknya ia menyiram zakarnya dan berwضو' sebagaimana wضو' untuk solat.\""
  },
  {
    "id": 15179,
    "hadith_number": 443,
    "tajuk_hadith": "Menjaga Kebersihan Diri Selepas Tidur Malam",
    "perawi_melayu": "Abu Hurairah berkata:",
    "english_text": "\"The Messenger of Allah (ﷺ) said: 'When any one of you gets up after (sleeping) at night, let him not put his hand into the vessel until he has poured water on it two or three times, for none of you knows where his hand spent the night.'\"",
    "arabic_text": "أَخْبَرَنَا عِمْرَانُ بْنُ يَزِيدَ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ مُسْلِمٍ الزُّهْرِيُّ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، قَالَ حَدَّثَنِي أَبُو هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا قَامَ أَحَدُكُمْ مِنَ اللَّيْلِ فَلاَ يُدْخِلْ يَدَهُ فِي الإِنَاءِ حَتَّى يُفْرِغَ عَلَيْهَا مَرَّتَيْنِ أَوْ ثَلاَثًا فَإِنَّ أَحَدَكُمْ لاَ يَدْرِي أَيْنَ بَاتَتْ يَدُهُ ‏\"‏ ‏.‏",
    "malay_translation": "Baginda Rasulullah SAW bersabda: \"Apabila salah seorang daripada kamu bangun dari tidur malam, janganlah dia memasukkan tangannya ke dalam bekas minuman sehingga dia mencuci tangannya dua atau tiga kali. Kerana, tidak ada seorang pun di antara kamu yang tahu di mana tangannya menghabiskan malam tersebut.\""
  },
  {
    "id": 15180,
    "hadith_number": 444,
    "tajuk_hadith": "Rasulullah SAW Berdoa dan Berehat Tanpa Berwuduk Selepas Solat",
    "perawi_melayu": "Dikisahkan oleh Ibn 'Abbas berkata:",
    "english_text": "\"Saya solat bersama Nabi SAW satu malam, dan saya berdiri di sebelah kiri Baginda, tetapi Baginda menyuruh saya berdiri di sebelah kanan Baginda, dan Baginda solat. Kemudian Baginda berbaring dan tidur sebentar, kemudian mu'adzin datang kepada Baginda dan Baginda solat tanpa berwudhuk.\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا دَاوُدُ، عَنْ عَمْرٍو، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم ذَاتَ لَيْلَةٍ فَقُمْتُ عَنْ يَسَارِهِ فَجَعَلَنِي عَنْ يَمِينِهِ فَصَلَّى ثُمَّ اضْطَجَعَ وَرَقَدَ فَجَاءَهُ الْمُؤَذِّنُ فَصَلَّى وَلَمْ يَتَوَضَّأْ مُخْتَصَرٌ ‏.‏",
    "malay_translation": "Dikisahkan oleh Ibn 'Abbas r.a. bahawa beliau pernah solat bersama Nabi SAW pada suatu malam. Beliau berdiri di sebelah kiri Nabi SAW, tetapi Nabi SAW memerintahkannya supaya berdiri di sebelah kanan Baginda. Selepas itu Nabi SAW solat, kemudian berbaring dan tidur sebentar. Lalu, mu'adzin datang kepada Baginda, dan Baginda solat tanpa berwuduk."
  },
  {
    "id": 15181,
    "hadith_number": 445,
    "tajuk_hadith": "Keutamaan Mengambil Istirahat Semasa Solat Jika Mengantuk",
    "perawi_melayu": "Daripada Anas bahawa Rasulullah SAW bersabda:",
    "english_text": "\"If anyone of you feels drowsy during his Salah, let him go and take a nap.\"",
    "arabic_text": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الطُّفَاوِيُّ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا نَعَسَ أَحَدُكُمْ فِي صَلاَتِهِ فَلْيَنْصَرِفْ وَلْيَرْقُدْ ‏\"‏ ‏.‏",
    "malay_translation": "Jika salah seorang daripada kamu mengantuk ketika sedang solat, maka hendaklah dia keluar dan tidur sebentar."
  },
  {
    "id": 15182,
    "hadith_number": 446,
    "tajuk_hadith": "Wajibnya Mandi (Wudu) Setelah Sentuh Anggota Kemaluan",
    "perawi_melayu": "Diceritakan oleh Busrah, katanya:",
    "english_text": "\"The Messenger of Allah (ﷺ) said: 'Whoever touches his private part, let him perform Wudu'.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ سُفْيَانَ، عَنْ عَبْدِ اللَّهِ، - يَعْنِي ابْنَ أَبِي بَكْرٍ - قَالَ عَلَى أَثَرِهِ قَالَ أَبُو عَبْدِ الرَّحْمَنِ وَلَمْ أُتْقِنْهُ عَنْ عُرْوَةَ، عَنْ بُسْرَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ مَسَّ فَرْجَهُ فَلْيَتَوَضَّأْ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Barangsiapa yang menyentuh kemaluannya, maka hendaklah ia berwضو'.\""
  },
  {
    "id": 15183,
    "hadith_number": 447,
    "tajuk_hadith": "Wuduk Jika Menyentuh Anggota Kemaluan",
    "perawi_melayu": "Daripada Busrah binti Safwan, daripada Nabi SAW",
    "english_text": "\"Jika sesiapa di antara kamu menyentuh anggota sulitnya dengan tangannya, hendaklah dia berwudhuk.\"",
    "arabic_text": "أَخْبَرَنَا عِمْرَانُ بْنُ مُوسَى، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَوَاءٍ، عَنْ شُعْبَةَ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ بُسْرَةَ بِنْتِ صَفْوَانَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا أَفْضَى أَحَدُكُمْ بِيَدِهِ إِلَى فَرْجِهِ فَلْيَتَوَضَّأْ ‏\"‏ ‏.‏",
    "malay_translation": "Telah diberitakan kepada kami oleh Imran bin Musa, beliau berkata, telah menceritakan kepada kami Muhammad bin Sawaih, daripada Syu’bah, daripada Ma’mar, daripada al-Zuhairi, daripada Urwah bin Zubair, daripada Busrah binti Safwan bahawa Nabi SAW bersabda:\n\"Jika salah seorang daripada kamu menyentuh anggota sulitnya dengan tangannya, maka hendaklah dia berwudhuk.\""
  },
  {
    "id": 15184,
    "hadith_number": 448,
    "tajuk_hadith": "Penjelasan Wudu' Berdasarkan Hadis Nabi SAW",
    "perawi_melayu": "Busrah binti Safwan telah menceritakan kepada 'Urwah bin Zubair, bahawa.",
    "english_text": "\"Busrah bint Safwan told me that.\" 'Urwah sent someone to check that, and she said: \"The Messenger of Allah (ﷺ) mentioned what Wudu' is done for, and said: 'Touching the penis.'\"",
    "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ مَرْوَانَ بْنِ الْحَكَمِ، أَنَّهُ قَالَ الْوُضُوءُ مِنْ مَسِّ الذَّكَرِ فَقَالَ مَرْوَانُ أَخْبَرَتْنِيهِ بُسْرَةُ بِنْتُ صَفْوَانَ ‏.‏ فَأَرْسَلَ عُرْوَةُ قَالَتْ ذَكَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَا يُتَوَضَّأُ مِنْهُ فَقَالَ ‏\n\"‏ مِنْ مَسِّ الذَّكَرِ ‏\"‏ ‏.‏",
    "malay_translation": "Busrah binti Safwan telah menceritakan kepada kami bahawa Rasulullah SAW telah menjelaskan tentang apa yang perlu dibasuh ketika wuduk, iaitu: \"Menyentuh zakar.\""
  },
  {
    "id": 15185,
    "hadith_number": 449,
    "tajuk_hadith": "Larangan Solat Tanpa Mandi Junub",
    "perawi_melayu": "Busrah bin Safwan",
    "english_text": "\"Whoever touches his penis, he should not perform Salah until he performs Wudu'.\"\nAbu 'Abdur-Rahman (An-Nasa'i) said: Hisham bin 'Urwah did not hear this Hadith from his father.",
    "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، قَالَ أَخْبَرَنِي أَبِي، عَنْ بُسْرَةَ بِنْتِ صَفْوَانَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ مَسَّ ذَكَرَهُ فَلاَ يُصَلِّي حَتَّى يَتَوَضَّأَ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ هِشَامُ بْنُ عُرْوَةَ لَمْ يَسْمَعْ مِنْ أَبِيهِ هَذَا الْحَدِيثَ وَاللَّهُ سُبْحَانَهُ وَتَعَالَى أَعْلَمُ ‏.‏",
    "malay_translation": "Barangsiapa yang menyentuh zakarnya, maka dia tidak boleh menunaikan solat sehingga dia berwuduk. \nAbu 'Abdur-Rahman (An-Nasa'i) berkata: Hisham bin 'Urwah tidak mendengar hadis ini daripada bapanya.  Allah SWT Maha Mengetahui."
  }
]