[
  {
    "id": 35628,
    "hadith_number": 1450,
    "tajuk_hadith": "Keadilan Umar al-Khattab dalam Perniagaan",
    "perawi_melayu": "Malik meriwayatkan daripada Zayd bin Aslam daripada bapanya",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ خَرَجَ عَبْدُ اللَّهِ وَعُبَيْدُ اللَّهِ ابْنَا عُمَرَ بْنِ الْخَطَّابِ فِي جَيْشٍ إِلَى الْعِرَاقِ فَلَمَّا قَفَلاَ مَرَّا عَلَى أَبِي مُوسَى الأَشْعَرِيِّ وَهُوَ أَمِيرُ الْبَصْرَةِ فَرَحَّبَ بِهِمَا وَسَهَّلَ ثُمَّ قَالَ لَوْ أَقْدِرُ لَكُمَا عَلَى أَمْرٍ أَنْفَعُكُمَا بِهِ لَفَعَلْتُ ‏.‏ ثُمَّ قَالَ بَلَى هَا هُنَا مَالٌ مِنْ مَالِ اللَّهِ أُرِيدُ أَنْ أَبْعَثَ بِهِ إِلَى أَمِيرِ الْمُؤْمِنِينَ فَأُسْلِفُكُمَاهُ فَتَبْتَاعَانِ بِهِ مَتَاعًا مِنْ مَتَاعِ الْعِرَاقِ ثُمَّ تَبِيعَانِهِ بِالْمَدِينَةِ فَتُؤَدِّيَانِ رَأْسَ الْمَالِ إِلَى أَمِيرِ الْمُؤْمِنِينَ وَيَكُونُ الرِّبْحُ لَكُمَا فَقَالاَ وَدِدْنَا ذَلِكَ ‏.‏ فَفَعَلَ وَكَتَبَ إِلَى عُمَرَ بْنِ الْخَطَّابِ أَنْ يَأْخُذَ مِنْهُمَا الْمَالَ فَلَمَّا قَدِمَا بَاعَا فَأُرْبِحَا فَلَمَّا دَفَعَا ذَلِكَ إِلَى عُمَرَ قَالَ أَكُلُّ الْجَيْشِ أَسْلَفَهُ مِثْلَ مَا أَسْلَفَكُمَا قَالاَ لاَ ‏.‏ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ ابْنَا أَمِيرِ الْمُؤْمِنِينَ فَأَسْلَفَكُمَا أَدِّيَا الْمَالَ وَرِبْحَهُ ‏.‏ فَأَمَّا عَبْدُ اللَّهِ فَسَكَتَ وَأَمَّا عُبَيْدُ اللَّهِ فَقَالَ مَا يَنْبَغِي لَكَ يَا أَمِيرَ الْمُؤْمِنِينَ هَذَا لَوْ نَقَصَ هَذَا الْمَالُ أَوْ هَلَكَ لَضَمِنَّاهُ ‏.‏ فَقَالَ عُمَرُ أَدِّيَاهُ ‏.‏ فَسَكَتَ عَبْدُ اللَّهِ وَرَاجَعَهُ عُبَيْدُ اللَّهِ ‏.‏ فَقَالَ رَجُلٌ مِنْ جُلَسَاءِ عُمَرَ يَا أَمِيرَ الْمُؤْمِنِينَ لَوْ جَعَلْتَهُ قِرَاضًا ‏.‏ فَقَالَ عُمَرُ قَدْ جَعَلْتُهُ قِرَاضًا ‏.‏ فَأَخَذَ عُمَرُ رَأْسَ الْمَالِ وَنِصْفَ رِبْحِهِ وَأَخَذَ عَبْدُ اللَّهِ وَعُبَيْدُ اللَّهِ ابْنَا عُمَرَ بْنِ الْخَطَّابِ نِصْفَ رِبْحِ الْمَالِ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Zayd bin Aslam daripada bapanya bahawa Abdullah dan Ubaydullah, anak-anak Umar bin al-Khattab, menyertai ekspedisi tentera ke Iraq.  Semasa perjalanan pulang, mereka singgah di tempat Abu Musa al-Ash'ari yang ketika itu menjadi gabenor Basrah.  Abu Musa al-Ash'ari menyambut mereka dengan mesra dan menawarkan bantuan. Kemudian beliau berkata, \"Saya ada sebahagian harta milik Allah yang ingin saya kirimkan kepada Amirul Mukminin.  Maka saya ingin memberikan pinjaman ini kepada kamu berdua.  Belilah barangan di Iraq, kemudian jual di Madinah. Serahkan modal kepada Amirul Mukminin, dan untungnya adalah untuk kamu.\"  Mereka berdua bersetuju.  Abu Musa al-Ash'ari pun memberikan wang tersebut dan menulis surat kepada Umar bin al-Khattab agar mengambil wang tersebut daripada mereka berdua.  Setelah tiba di Madinah dan menjual barangan tersebut, mereka berdua mendapat keuntungan. Apabila mereka menyerahkan modal kepada Umar, Umar bertanya, \"Adakah seluruh tentera mendapat pinjaman seperti kamu berdua?\" Mereka menjawab, \"Tidak.\" Umar bin al-Khattab berkata, \"Kamu berdua dipinjamkan kerana kamu anak-anak Amirul Mukminin, maka serahkan modal dan keuntungannya.\" Abdullah berdiam diri.  Ubaydullah berkata, \"Wahai Amirul Mukminin, ini tidak patut. Sekiranya modal berkurang atau hilang, kami sanggup menanggungnya.\"  Umar berkata, \"Serahkanlah.\" Abdullah masih berdiam diri dan Ubaydullah mengulanginya. Seorang lelaki yang duduk bersama Umar berkata, \"Wahai Amirul Mukminin, lebih baik menjadikannya sebagai perkongsian untung rugi (qirad).\" Umar berkata, \"Saya jadikannya sebagai perkongsian untung rugi (qirad).\" Maka Umar mengambil modal dan separuh keuntungan, manakala Abdullah dan Ubaydullah, anak-anak Umar bin al-Khattab, mengambil separuh keuntungan."
  },
  {
    "id": 35629,
    "hadith_number": 1451,
    "tajuk_hadith": "Uthman ibn Affan dan Transaksi Qirad",
    "perawi_melayu": "Malik meriwayatkan daripada al-Ala' ibn Abd ar-Rahman daripada bapanya daripada datuknya",
    "english_text": "Malik related to me from al-Ala ibn Abd ar-Rahman from his father\nfrom his father that Uthman ibn Affan gave him some money as qirad to\nuse provided the profit was shared between them.",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ عُثْمَانَ بْنَ عَفَّانَ، أَعْطَاهُ مَالاً قِرَاضًا يَعْمَلُ فِيهِ عَلَى أَنَّ الرِّبْحَ بَيْنَهُمَا ‏.‏",
    "malay_translation": "Malik meriwayatkan kepadaku daripada al-Ala' ibn Abd ar-Rahman, daripada bapanya, daripada datuknya bahawa Uthman ibn Affan memberinya sejumlah wang sebagai qirad untuk digunakan, dengan syarat keuntungan dikongsi di antara mereka."
  },
  {
    "id": 35630,
    "hadith_number": 1452,
    "tajuk_hadith": "Bentuk Qirad yang Diiktiraf dan Perkara-Perkara Berkaitan",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Malik berkata, \"Bentuk qirad yang diiktiraf dan dibenarkan ialah seseorang lelaki mengambil modal daripada seorang rakan untuk digunakan. Dia tidak menjaminnya dan semasa dalam perjalanan, dia menggunakan modal tersebut untuk makanan, pakaian dan keperluan lain yang bermanfaat, mengikut jumlah modal.  Ini adalah apabila dia melakukan perjalanan untuk bekerja dan modal itu mencukupi. Jika dia tinggal bersama kaumnya, dia tidak boleh menggunakan modal untuk perbelanjaan atau pakaian.\" \n\nMalik berkata, \"Tiada kemudaratan sekiranya kedua-dua pihak dalam satu perjanjian qirad saling membantu antara satu sama lain sebagai satu bentuk ihsan, jika kedua-duanya bersetuju.\" \n\nMalik berkata, \"Tiada kemudaratan sekiranya pelabur modal membeli sebahagian daripada barangan daripada ejen dalam qirad, jika ia dibolehkan dan tanpa syarat.\" \n\nMalik bercakap tentang pelabur yang membuat pinjaman qirad kepada seorang lelaki dan hambanya, untuk digunakan oleh kedua-duanya. Beliau berkata, \"Ia dibenarkan, dan tiada kemudaratan di dalamnya kerana keuntungan adalah hak milik hambanya, dan keuntungan itu bukan untuk tuan sehingga dia menerimanya. Ia seperti pendapatannya yang lain.\""
  },
  {
    "id": 35631,
    "hadith_number": 1453,
    "tajuk_hadith": "Hukum Pinjaman Qirad dan Riba Menurut Imam Malik",
    "perawi_melayu": "Imam Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Malik berkata, \"Apabila seseorang berhutang kepada orang lain dan meminta supaya hutang itu ditangguh sebagai qirad, ia adalah tidak digalakkan sehingga pemiutang menerima hartanya. Kemudian, dia boleh menjadikannya pinjaman qirad atau menyimpannya. Ini kerana penghutang mungkin dalam keadaan susah, dan mahu menangguhkannya untuk meningkatkannya untuknya.\"\n\n\nMalik bercakap tentang seorang pelabur yang membuat pinjaman qirad kepada seseorang, dan sebahagian daripada modal telah hilang sebelum ia digunakan, dan kemudian ia digunakan dan mendapat keuntungan. Ejen itu mahu menjadikan modal sebagai baki wang selepas apa yang hilang daripadanya. Malik berkata, \"Kenyataannya tidak diterima, dan modal itu dikembalikan kepada jumlah asalnya daripada keuntungannya. Kemudian mereka membahagikan apa yang tinggal selepas modal telah dibayar balik mengikut syarat-syarat qirad.\"\n\n\nMalik berkata, \"Pinjaman qirad hanya baik dalam bentuk emas atau perak dan ia tidak pernah dibenarkan dalam apa jua jenis barangan atau komoditi.\"\n\n\nMalik berkata, \"Terdapat beberapa transaksi yang jika tempoh masa yang panjang berlalu selepas transaksi itu berlaku, pembatalannya menjadi tidak boleh diterima. Bagi riba, tidak ada apa-apa kecuali penolakannya sama ada sedikit atau banyak. Apa yang dibenarkan selain daripadanya tidak dibenarkan di dalamnya kerana Allah SWT berfirman dalam kitab-Nya, 'Jika kamu bertaubat, kamu akan mendapat kembali modal kamu, tanpa menzalimi dan tanpa dizalimi.'\"\n\n\nSyarat-syarat yang dibenarkan dalam Qirad"
  },
  {
    "id": 35632,
    "hadith_number": 1454,
    "tajuk_hadith": "Syarat-Syarat dalam Pinjaman Qirad",
    "perawi_melayu": "Yahya melalui Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan bahawa Malik menyebut tentang seorang pelabur yang membuat pinjaman qirad dan mensyaratkan kepada ejen supaya hanya barangan tertentu sahaja yang dibeli dengan wangnya, atau dia melarang barangan tertentu yang disebut namanya daripada dibeli.  Beliau berkata, \"Tiada mudaratnya sekiranya pelabur meletakkan syarat kepada ejen dalam qirad supaya tidak membeli jenis haiwan atau barangan tertentu yang dinyatakannya.  Namun, tidak digalakkan bagi pelabur untuk mensyaratkan kepada ejen dalam qirad supaya hanya membeli barangan tertentu melainkan jika barangan yang disuruhnya dibeli itu banyak dan sentiasa ada baik di musim sejuk mahupun panas. Tiada masalah dalam keadaan sedemikian.\"\n\nMalik menyebut tentang seorang pelabur yang meminjamkan wang qirad dan mensyaratkan bahawa sebahagian daripada keuntungan itu adalah haknya sahaja tanpa perlu dikongsi dengan ejen. Beliau berkata, \"Itu tidak baik, walaupun hanya satu dirham, melainkan jika dia mensyaratkan bahawa separuh keuntungan adalah haknya dan separuh lagi adalah hak ejen, atau sepertiga, atau seperempat, atau apa sahaja. Apabila dia menetapkan peratusan, sama ada besar atau kecil, semua yang dinyatakan itu halal. Inilah qirad orang Islam.\"\n\nBeliau berkata, \"Ia juga tidak baik jika pelabur mensyaratkan bahawa satu dirham atau lebih daripada keuntungan itu semata-mata haknya tanpa perlu dikongsi dengan ejen, dan kemudian baki keuntungan dibahagikan dua di antara mereka. Itu bukanlah qirad orang Islam.\" "
  },
  {
    "id": 35633,
    "hadith_number": 1455,
    "tajuk_hadith": "Syarat-Syarat Qirad Menurut Imam Malik",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan daripada Malik: \"Seseorang yang memberikan modal tidak boleh menetapkan bahawa dia sahaja mendapat sebahagian keuntungan tanpa penyertaan ejen, dan ejen juga tidak boleh menetapkan bahawa dia sahaja mendapat sebahagian keuntungan tanpa penyertaan pelabur. Dalam qirad, tiada jual beli, tiada sewa, tiada upah, tiada pendahuluan, dan tiada kemudahan yang ditetapkan oleh salah satu pihak tanpa penyertaan pihak yang lain, melainkan jika salah satu pihak membenarkannya kepada pihak lain secara tanpa syarat sebagai ihsan dan ia dipersetujui oleh kedua-dua pihak. Tiada mana-mana pihak boleh meletakkan syarat ke atas pihak lain yang menambahkan harta berupa emas, perak atau makanan ke atas pihak lain.\"\n\nBeliau berkata: \"Jika sebarang perkara di atas dimasukkan ke dalam qirad, ia menjadi upah, dan upah hanya sah dengan syarat yang diketahui dan tetap. Ejen tidak boleh menetapkan semasa menerima modal bahawa dia akan membayar balik atau memberi komisen kepada sesiapa dengan barangan tersebut, mahupun mengambilnya untuk dirinya sendiri. Apabila terdapat keuntungan, dan tiba masanya untuk memisahkan modal, maka mereka membahagikan keuntungan mengikut terma kontrak. Jika modal tidak bertambah atau terdapat kerugian, ejen tidak perlu mengganti apa yang telah dibelanjakan untuk dirinya sendiri atau untuk kerugian tersebut. Itu menjadi tanggungjawab pelabur daripada modal. Qirad dibenarkan atas apa jua terma yang dipersetujui bersama oleh pelabur dan ejen, sama ada separuh daripada keuntungan, atau sepertiga, atau seperempat atau apa sahaja.\"\n\nMalik berkata: \"Tidak dibenarkan bagi ejen untuk menetapkan bahawa dia menggunakan wang qirad untuk tempoh tahun tertentu dan ia tidak boleh diambil daripada dia dalam tempoh tersebut.\"\n\nBeliau berkata: \"Tidak baik bagi pelabur untuk menetapkan bahawa wang qirad tidak boleh dikembalikan untuk tempoh tahun tertentu yang ditetapkan, kerana qirad bukan untuk tempoh tertentu. Pelabur meminjamkannya kepada ejen untuk digunakan untuknya. Jika ia sesuai untuk mana-mana pihak untuk membatalkan projek dan wang tersebut adalah wang tunai, dan tiada apa yang dibeli dengannya, ia boleh dibatalkan, dan pelabur mengambil balik wangnya. Jika ia sesuai bagi pelabur untuk mengambil balik pinjaman qirad selepas barangan dibeli dengannya, dia tidak boleh berbuat demikian sehingga pembeli menjual barangan tersebut dan ia menjadi wang. Jika ia sesuai bagi ejen untuk memulangkan pinjaman, dan ia telah ditukar kepada barangan, dia tidak boleh berbuat demikian sehingga dia menjualnya. Dia memulangkan pinjaman dalam bentuk tunai sepertimana dia menerimanya.\"\n\nMalik berkata: \"Tidak baik bagi pelabur untuk menetapkan agar ejen membayar sebarang zakat yang terhutang daripada bahagian keuntungannya, kerana pelabur dengan menetapkan itu, menetapkan peningkatan tetap untuk dirinya daripada keuntungan kerana bahagian zakat yang sepatutnya dibayar daripada bahagian keuntungannya, dikeluarkan darinya.\"\n\n\"Tidak dibenarkan bagi pelabur untuk menetapkan kepada ejen untuk hanya membeli daripada si polan, merujuk kepada seseorang yang tertentu. Itu tidak dibenarkan kerana dengan berbuat demikian dia akan menjadi orang upahannya dengan upah.\"\n\nMalik menceritakan tentang seorang pelabur dalam qirad yang menetapkan jaminan untuk sejumlah wang daripada ejen: \"Pelabur tidak dibenarkan untuk menetapkan syarat-syarat tentang modalnya selain daripada syarat-syarat yang menjadi asas qirad atau mengikut kebiasaan sunnah umat Islam. Jika modal ditambah dengan syarat jaminan, pelabur telah menambahkan bahagian keuntungannya kerana kedudukan jaminan. Tetapi keuntungan hanya dibahagikan mengikut apa yang sepatutnya jika pinjaman diberikan tanpa jaminan. Jika modal musnah, saya tidak fikir ejen mempunyai jaminan yang dipegang terhadapnya kerana penetapan jaminan dalam qirad adalah tidak sah.\"\n\nMalik menceritakan tentang seorang pelabur yang memberi wang qirad kepada seseorang dan orang itu menetapkan bahawa dia hanya akan membeli kurma atau haiwan dengannya kerana dia ingin memakan kurma atau anak haiwan tersebut dan dia menyimpannya untuk beberapa waktu untuk digunakan untuk dirinya sendiri. Beliau berkata: \"Itu tidak dibenarkan. Ia bukan sunnah umat Islam dalam qirad melainkan jika dia membelinya dan kemudian menjualnya sepertimana barangan lain dijual.\"\n\nMalik berkata: \"Tiada apa yang salah sekiranya ejen menetapkan kepada pelabur seorang hamba untuk membantunya dengan syarat hamba itu turut mendapat keuntungan daripada pelaburan, dan apabila hamba itu hanya membantunya dalam pelaburan, bukan perkara lain.\""
  },
  {
    "id": 35634,
    "hadith_number": 1456,
    "tajuk_hadith": "Qirad Pinjaman Hanya Dalam Wang Syiling",
    "perawi_melayu": "Yahya berkata bahawa Malik berkata, \"Tiada sesiapa yang harus membuat pinjaman qirad kecuali dalam wang syiling, kerana pinjaman itu tidak boleh dalam bentuk barangan, kerana meminjam barangan hanya boleh diusahakan dalam salah satu daripada dua cara:",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan bahawa Malik berkata, \"Tidak sepatutnya seseorang itu membuat pinjaman qirad melainkan dengan wang syiling, kerana pinjaman itu tidak boleh berbentuk barangan, kerana meminjam barangan hanya boleh diusahakan dengan salah satu daripada dua cara berikut:\n\nSama ada pemilik barangan memberitahu peminjam, ‘Ambillah barangan ini dan jual. Beli dan jual dengan modal yang diperolehi mengikut qirad.’ Pelabur menetapkan keuntungan untuk dirinya daripada jualan barangnya dan apa yang meringankan perbelanjaannya dalam menjualnya.  Atau dia berkata, ‘Tukar barangan ini dan jual. Apabila selesai, belikan saya barangan yang sama seperti yang saya berikan kepada anda. Jika ada keuntungan, ia adalah antara anda dan saya.’  Mungkin pelabur memberikan barangan kepada ejen pada masa ia sangat diperlukan dan mahal, kemudian ejen mengembalikannya ketika harganya murah dan mungkin dia telah membelinya hanya sepertiga daripada harga asal atau kurang daripada itu. Ejen kemudian mendapat keuntungan separuh daripada jumlah penurunan harga barangan sebagai bahagian keuntungannya. Atau dia mungkin mengambil barangan pada masa harganya rendah, dan menggunakannya sehingga dia mempunyai banyak wang. Kemudian barangan itu menjadi mahal dan harganya naik apabila dia mengembalikannya, jadi dia membelinya dengan semua yang dimilikinya sehingga semua usahanya dan keprihatinannya sia-sia. Ini adalah transaksi yang tidak menentu dan tidak baik. Walau bagaimanapun, jika itu tidak diketahui sehingga ia berlaku, maka upah ejen dalam qirad yang akan dibayar untuk menjualnya, akan dilihat dan dia diberi upah atas usahanya. Kemudian wang itu menjadi qirad dari hari wang itu menjadi tunai dan dikumpulkan sebagai syiling dan ia dikembalikan sebagai qirad seperti itu."
  },
  {
    "id": 35635,
    "hadith_number": 1457,
    "tajuk_hadith": "Tanggungjawab Ejen dalam Pinjaman Qirad",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan bahawa Malik menceritakan tentang seorang lelaki yang memberi pinjaman qirad kepada seseorang. Lelaki itu membeli barangan dengannya dan mengangkutnya ke pusat perdagangan.  Namun, jualannya tidak menguntungkan dan ejen bimbang akan kerugian jika menjualnya di situ. Maka, dia menyewa pengangkutan untuk membawa barangan tersebut ke bandar lain, dan menjualnya di sana, tetapi tetap mengalami kerugian. Kos pengangkutan pula lebih tinggi daripada modal asal.\n\nMalik berkata, \"Sekiranya ejen mampu membayar kos pengangkutan daripada hasil jualan modal, maka begitulah caranya.  Sebarang bahagian kos pengangkutan yang tidak ditanggung oleh modal, ejen perlu membayarnya. Pelabur tidak bertanggungjawab ke atasnya. Ini kerana pelabur hanya mengarahkannya untuk berniaga dengan modal tersebut. Pelabur tidak bertanggungjawab atas perkara selain daripada modal. Sekiranya pelabur bertanggungjawab, ia akan menjadi kerugian tambahan kepadanya di atas modal yang dilaburkannya. Ejen tidak boleh membebankan pelabur dengan perkara itu.\""
  },
  {
    "id": 35636,
    "hadith_number": 1458,
    "tajuk_hadith": "Perkongsian Qirad dan Tanggungjawab Ejen",
    "perawi_melayu": "Yahya daripada Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan bahawa Malik telah membincangkan tentang seorang pelabur yang memberikan pinjaman qirad kepada seseorang.  Orang tersebut menggunakan wang itu dan memperoleh keuntungan. Kemudian, dia membeli seorang hamba perempuan dengan semua keuntungan itu, dan berlaku hubungan intim sehingga hamba perempuan itu hamil, lalu modal berkurang. Malik berkata, \"Jika dia mempunyai wang, harga hamba perempuan itu diambil daripada hartanya, dan modal dikembalikan. Jika ada lebihan selepas wang dibayar, ia dibahagikan di antara mereka mengikut perjanjian qirad asal. Jika dia tidak mampu membayarnya, hamba perempuan itu dijual supaya modal dapat dikembalikan daripada harganya.\"\n\nMalik turut membincangkan tentang seorang pelabur yang memberikan pinjaman qirad, dan ejen tersebut membelanjakan lebih daripada jumlah pinjaman qirad semasa membeli barang dan membayar lebihan daripada wang sendiri. Malik berkata, \"Pelabur mempunyai pilihan jika barang-barang tersebut dijual dengan untung atau rugi, atau jika ia tidak dijual. Jika dia mahu mengambil barang-barang tersebut, dia mengambilnya dan membayar balik kepada ejen apa yang telah dibelanjakan oleh ejen. Jika ejen enggan, pelabur menjadi rakan kongsi mengikut bahagiannya dalam keuntungan dan kerugian mengikut jumlah yang dibayar lebih oleh ejen daripada wang sendiri.\"\n\nMalik juga membincangkan tentang seorang ejen yang mengambil wang qirad daripada seseorang, kemudian memberikannya kepada orang lain untuk digunakan sebagai qirad tanpa kebenaran pelabur. Beliau berkata, \"Ejen bertanggungjawab terhadap harta tersebut. Jika ia berkurang, dia bertanggungjawab atas kerugian. Jika ada keuntungan, pelabur mendapat bahagian keuntungannya, kemudian ejen mendapat bahagiannya daripada baki wang tersebut.\"\n\nMalik membincangkan tentang seorang ejen yang melebihi had dan meminjam sebahagian daripada wang qirad yang dimilikinya, kemudian membeli barang untuk dirinya sendiri. Malik berkata, \"Jika dia untung, keuntungan dibahagikan mengikut perjanjian di antara mereka dalam qirad. Jika dia rugi, dia bertanggungjawab atas kerugian tersebut.\"\n\nMalik berkata tentang seorang pelabur yang membayar wang qirad kepada seseorang, dan ejen itu meminjam sebahagian wang tunai dan membeli barang untuk dirinya sendiri, \"Pelabur modal mempunyai pilihan. Jika dia mahu, dia berkongsi barang-barang tersebut mengikut qirad, dan jika dia mahu, dia melepaskan diri daripada semuanya dan mengambil semua modal balik daripada ejen. Itulah yang dilakukan terhadap seseorang yang melangkaui batas.\" "
  },
  {
    "id": 35637,
    "hadith_number": 1459,
    "tajuk_hadith": "Perbelanjaan Ejen dalam Pinjaman Qirad",
    "perawi_melayu": "Yahya daripada Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan bahawa Malik menyebut tentang seorang pelabur yang memberi pinjaman qirad kepada seseorang. Beliau berkata, \"Apabila pelaburan besar, perbelanjaan perjalanan ejen diambil daripada pelaburan itu. Dia boleh menggunakannya untuk makan dan berpakaian dengan cara yang wajar mengikut jumlah pelaburan. Jika ia menjimatkan masanya, dia boleh mengambil upah daripada sebahagian modal, jika ia besar, dan dia tidak mampu menanggung perbelanjaannya sendiri. Ada beberapa kerja yang ejen atau orang seumpamanya tidak bertanggungjawab, antaranya ialah mengutip hutang, mengangkut barang, memunggah dan sebagainya. Dia boleh mengupah daripada modal seseorang untuk melakukan perkara itu untuknya. Ejen tidak boleh membelanjakan daripada modal atau berpakaian daripada modal tersebut ketika dia tinggal bersama keluarganya. Ia hanya dibenarkan untuknya menggunakan perbelanjaan apabila dia melakukan perjalanan untuk pelaburan. Perbelanjaan diambil daripada modal. Jika dia hanya berniaga dengan harta di bandar tempat tinggalnya, dia tidak mempunyai perbelanjaan daripada modal dan tiada pakaian.\" \n\nMalik menyebut tentang seorang pelabur yang membayar wang qirad kepada seseorang, dan ejen keluar dengan wang itu dan dengan modalnya sendiri. Beliau berkata, \"Perbelanjaan datang daripada qirad dan daripada modalnya sendiri mengikut kadar masing-masing.\""
  },
  {
    "id": 35638,
    "hadith_number": 1460,
    "tajuk_hadith": "Penggunaan Wang Qirad oleh Ejen",
    "perawi_melayu": "Yahya (dari Malik)",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan bahawa Malik menceritakan tentang seorang ejen yang memegang wang qirad dan menggunakannya untuk perbelanjaan dan pakaiannya.  Malik berkata, \"Ejen itu tidak boleh memberi sebahagian wang tersebut kepada sesiapa pun, sama ada pengemis atau orang lain. Dia juga tidak boleh membayar ganti rugi daripadanya. Sekiranya dia bertemu dengan beberapa orang, dan mereka mengeluarkan makanan dan dia juga mengeluarkan makanan, saya berharap ia dibolehkan jika dia tidak berniat untuk memberi sesuatu kepada mereka. Jika dia berniat demikian atau yang serupa tanpa kebenaran pelabur, dia mesti mendapatkan keizinan pelabur. Jika pelabur memberi kebenaran, tiada masalah. Jika pelabur enggan memberi kebenaran, dia mesti membayar balik dengan gantian yang serupa jika dia mempunyai sesuatu yang sesuai sebagai pampasan.\""
  },
  {
    "id": 35639,
    "hadith_number": 1461,
    "tajuk_hadith": "Hukum Ke Atas Waris Seorang Ejen Yang Meninggal Dunia Sebelum Menerima Bayaran",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan daripada Malik: “Amalan yang disepakati di kalangan kami mengenai pelabur yang membayar wang qirad kepada seorang ejen untuk membeli barang, dan ejen itu kemudian menjual barang tersebut dengan harga yang perlu dibayar kemudian, dan mendapat keuntungan dalam urus niaga itu, kemudian ejen itu meninggal dunia sebelum menerima bayaran, ialah jika warisnya ingin mengambil wang itu, mereka berhak mendapat bahagian yang ditetapkan bapa mereka daripada keuntungan itu. Itu adalah hak mereka jika mereka boleh dipercayai untuk mengambil bayaran tersebut. Jika mereka tidak mahu mengumpulnya daripada penghutang dan mereka merujuknya kepada pelabur, mereka tidak wajib mengumpulnya dan tiada apa-apa yang menentang mereka dan tiada apa-apa untuk mereka dengan menyerahkannya kepada pelabur. Jika mereka mengumpulnya, mereka mendapat bahagian daripadanya dan perbelanjaan seperti bapa mereka. Mereka berada di tempat bapa mereka. Jika mereka tidak boleh dipercayai untuk berbuat demikian, mereka boleh membawa seseorang yang boleh dipercayai untuk mengumpul wang itu. Jika dia mengumpul semua modal dan semua keuntungan, mereka berada di tempat bapa mereka.”\n\nMalik berkata mengenai seorang pelabur yang membayar wang qirad kepada seseorang dengan syarat bahawa dia menggunakannya dan bertanggungjawab terhadap sebarang bayaran tertangguh yang mana dia menjualnya. Beliau berkata, “Ini adalah wajib ke atas ejen. Jika dia menjualnya dengan bayaran tertangguh, dia bertanggungjawab terhadapnya.”"
  },
  {
    "id": 35640,
    "hadith_number": 1462,
    "tajuk_hadith": "Qirad dan Perhubungan Persaudaraan",
    "perawi_melayu": "Yahya daripada Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya berkata bahawa Malik menceritakan tentang seorang pelabur yang memberi wang qirad kepada seseorang, kemudian orang itu meminta pinjaman daripada pelabur atau pelabur meminjam wang daripada ejen, atau pelabur meninggalkan barang dengan ejen untuk dijual untuknya, atau pelabur memberi ejen dinar untuk membeli barang. Malik berkata, \"Tiada mudarat jika pelabur meninggalkan barangnya dengannya dengan mengetahui bahawa jika ejen tidak mempunyai wang dan dia telah meminta perkara yang sama darinya, dia tetap akan melakukannya kerana persaudaraan di antara mereka atau kerana ia tidak akan menyusahkannya dan sekiranya ejen menolaknya, dia tidak akan mengambil modalnya darinya. Atau jika ejen telah meminjam daripada pelabur atau membawa barangnya untuknya dan dia tahu bahawa jika pelabur tidak mempunyai modalnya bersamanya, dia tetap akan melakukan perkara yang sama untuknya, dan sekiranya dia menolaknya, dia tidak akan mengembalikan modalnya kepadanya. Jika demikian antara mereka berdua dan ia adalah sebagai satu bentuk ihsan di antara mereka dan ia bukan syarat dalam terma qirad, ia diharuskan dan tiada mudarat padanya. Jika ia menjadi satu syarat, atau dikhuatiri bahawa ejen hanya melakukannya untuk pelabur bagi memelihara modal yang ada padanya, atau pelabur hanya melakukannya kerana ejen telah mengambil modalnya dan tidak akan mengembalikannya kepadanya, ia tidak diharuskan dalam qirad dan ia termasuk dalam perkara yang dilarang oleh para ulama.\" "
  },
  {
    "id": 35641,
    "hadith_number": 1463,
    "tajuk_hadith": "Hukum Membiarkan Hutang Sebagai Qirad",
    "perawi_melayu": "Yahya melalui Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan bahawa Malik menceritakan tentang seorang lelaki yang meminjamkan wang kepada lelaki lain, kemudian orang yang berhutang itu memintanya untuk membiarkan wang itu sebagai qirad. Malik berkata, \"Saya tidak suka cara itu melainkan dia mengambil semula wangnya, kemudian memberikannya sebagai qirad jika dia mahu atau menyimpannya jika dia mahu.\" \n\nMalik menceritakan tentang seorang pelabur yang membayar wang qirad kepada seseorang, dan lelaki itu memberitahunya bahawa wang itu telah dikutip dan memintanya untuk menuliskannya sebagai pinjaman. Beliau berkata, \"Saya tidak suka cara itu melainkan dia mengambil wangnya, kemudian meminjamkannya kepadanya atau menyimpannya seperti yang dia kehendaki. Ini hanyalah kerana bimbang dia telah kehilangan sebahagian daripadanya, dan ingin menangguhkannya supaya dia dapat menggantikan apa yang telah hilang.  Cara ini tidak digalakkan dan tidak dibenarkan, dan ia tidak baik."
  },
  {
    "id": 35642,
    "hadith_number": 1464,
    "tajuk_hadith": "Peraturan Pembahagian Keuntungan Qirad",
    "perawi_melayu": "Yahya melalui Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan bahawa Malik telah membincangkan tentang seorang pelabur yang membayar wang qirad kepada seorang ejen yang telah memperoleh keuntungan, kemudian ingin mengambil bahagian keuntungannya dan pelabur itu tidak berada di tempat.  Beliau berkata, \"Dia tidak boleh mengambil apa-apa melainkan pelabur itu hadir. Jika dia mengambil sesuatu daripadanya, dia bertanggungjawab terhadapnya sehingga ia dikira dalam pembahagian modal.\" \n\nMalik berkata, \"Tidak dibenarkan bagi pihak-pihak yang terlibat dalam qirad untuk mengira dan membahagikan harta yang jauh dari mereka sehingga modal hadir, dan pelabur diberikan modal sepenuhnya. Kemudian mereka membahagikan keuntungan kepada bahagian yang dipersetujui.\" \n\nMalik membincangkan tentang seorang lelaki yang mengambil wang qirad, dan membeli barang dengannya sedangkan dia mempunyai hutang. Pemiutangnya mencarinya dan menemuinya ketika dia berada di sebuah bandar yang jauh dari pelabur, dan dia mempunyai barangan dagangan yang menguntungkan yang berkualiti tinggi. Mereka mahu dia menjual barangan tersebut untuk mereka supaya mereka boleh mengambil bahagian keuntungannya. Malik berkata, \"Tiada sebahagian daripada keuntungan qirad diambil sehingga pelabur hadir. Dia mengambil modalnya dan kemudian keuntungan dibahagikan bersama di antara mereka.\" \n\nMalik membincangkan tentang seorang pelabur yang meletakkan wang qirad dengan seorang ejen dan dia menggunakannya dan mendapat keuntungan. Kemudian modal itu diketepikan dan keuntungan dibahagikan. Dia mengambil bahagiannya dan menambah bahagian pelabur kepada modalnya di hadapan saksi-saksi yang telah dipanggilnya. Malik berkata, \"Tidak dibenarkan untuk membahagikan keuntungan melainkan pelabur hadir. Jika dia telah mengambil sesuatu di sini, ia akan dikembalikan sehingga pelabur menerima modal sepenuhnya. Kemudian baki dibahagikan kepada bahagian masing-masing.\" \n\nMalik membincangkan tentang seorang pelabur yang meletakkan wang qirad dengan seorang ejen. Ejen itu menggunakannya dan kemudian datang kepada pelabur dan berkata, \"Ini adalah bahagian keuntungan anda, dan saya telah mengambil bahagian yang sama untuk diri saya, dan saya telah menyimpan modal anda sepenuhnya.\" Malik berkata, \"Saya tidak suka itu, melainkan semua modal hadir, modal itu ada dan dia tahu bahawa ia lengkap dan dia menerimanya. Kemudian mereka membahagikan keuntungan di antara mereka. Dia mengembalikan modal itu kepadanya jika dia mahu, atau dia menyimpannya. Kehadiran modal itu perlu kerana takut ejen itu mungkin telah kehilangan sebahagian daripadanya, dan mungkin tidak mahu ia dikeluarkan daripadanya dan menyimpannya di tangannya.\" "
  },
  {
    "id": 35643,
    "hadith_number": 1465,
    "tajuk_hadith": "Perkongsian Qirad dan Penyelesaian Perselisihan",
    "perawi_melayu": "Yahya daripada Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan bahawa Malik menceritakan tentang seorang pelabur yang melaburkan wang qirad kepada seorang ejen yang membelinya barang dagangan. Pelabur menyuruh ejen menjualnya. Ejen berkata bahawa dia tidak nampak jalan untuk menjualnya pada ketika itu dan mereka bertengkar mengenainya.  Malik berkata, \"Pendapat kedua-dua pihak tidak dipertimbangkan. Orang yang berpengalaman dan berpengetahuan tentang barangan tersebut akan ditanya. Jika mereka nampak jalan untuk menjualnya, barangan itu dijual. Jika mereka berpendapat perlu menunggu, maka tunggulah.\" \n\nMalik menceritakan tentang seorang lelaki yang mengambil wang qirad daripada pelabur dan menggunakannya. Apabila pelabur meminta wangnya, lelaki itu berkata bahawa dia mempunyai wang itu sepenuhnya.  Apabila pelabur mendesaknya untuk menyelesaikannya, lelaki itu mengaku, \"Sejumlah wang telah hilang.\" Dia menyatakan jumlah wang tersebut.  \"Saya memberitahu anda supaya anda membiarkannya bersama saya.\" Malik berkata, \"Dia tidak akan mendapat manfaat dengan menafikannya selepas dia mengesahkan bahawa dia mempunyai semuanya. Dia bertanggungjawab atas pengakuannya melainkan dia mengemukakan bukti tentang kehilangan harta itu yang mengesahkan kenyataannya. Jika dia tidak mengemukakan alasan yang munasabah, dia bertanggungjawab atas pengakuannya, dan penafiannya tidak akan menyelamatkannya.\" \n\nMalik berkata, \"Begitu juga, jika dia berkata, 'Saya telah mendapat keuntungan sebegini daripada modal,' dan kemudian pemilik modal meminta wang pokok dan keuntungannya, dan dia berkata bahawa dia tidak mendapat sebarang keuntungan dan hanya berkata demikian supaya wang itu dibiarkan dalam simpanannya, ia tidak akan memberi manfaat kepadanya. Dia akan dipertanggungjawabkan terhadap apa yang telah dia sahkan melainkan dia membawa bukti yang boleh diterima untuk perkataannya, supaya kenyataan pertama tidak mengikatnya.\" \n\nMalik menceritakan tentang seorang pelabur yang melaburkan wang qirad kepada seorang ejen yang mendapat keuntungan daripadanya. Ejen berkata, \"Saya mengambil qirad daripada anda dengan syarat saya akan mendapat dua pertiga.\" Pemilik modal berkata, \"Saya memberi anda qirad dengan syarat anda mendapat sepertiga.\" Malik berkata, \"Kata-kata ejen adalah benar, dan dia mesti bersumpah jika apa yang dikatakannya menyerupai amalan qirad yang diketahui atau hampir dengannya. Jika dia mengemukakan sesuatu yang tidak boleh diterima dan orang ramai tidak membuat qirad seperti itu, dia tidak dipercayai, dan ia diputuskan mengikut cara qirad seperti itu biasanya dilakukan.\" \n\nMalik menceritakan tentang seorang lelaki yang memberi seratus dinar kepada seseorang sebagai qirad. Dia membeli barang dengannya dan kemudian pergi untuk membayar seratus dinar kepada pemilik barang dan mendapati bahawa barang itu telah dicuri. Pelabur berkata, \"Jual barang itu. Jika ada lebihan, ia adalah milik saya. Jika ada kerugian, ia adalah tanggungjawab anda kerana anda yang kehilangannya.\" Ejen berkata, \"Sebaliknya, anda mesti melunaskan hutang kepada penjual. Saya membelinya dengan modal anda yang anda berikan kepada saya.\" Malik berkata, \"Ejen wajib membayar harga kepada penjual dan pelabur diberitahu, 'Jika anda mahu, bayar seratus dinar kepada ejen dan barang itu adalah di antara anda. Qirad adalah mengikut apa yang telah dipersetujui pada seratus dinar pertama. Jika anda mahu, anda bebas daripada barang itu.' Jika seratus dinar dibayar kepada ejen, ia adalah qirad mengikut syarat qirad pertama. Jika dia menolak, barang itu milik ejen dan dia mesti membayar harganya.\" \n\nMalik menceritakan tentang dua orang dalam satu qirad yang telah menyelesaikan urus niaga dan ejen masih mempunyai beberapa barang yang digunakannya - kain buruk atau kulit air atau yang sewaktu dengannya. Malik berkata, \"Sebarang barang yang tidak bernilai adalah tidak penting dan milik ejen. Saya tidak pernah mendengar sesiapa membuat keputusan untuk mengembalikannya. Sebarang barang yang mempunyai harga akan dikembalikan. Jika ia adalah sesuatu yang bernilai seperti haiwan, unta, kain kasar atau yang sewaktu dengannya yang mempunyai harga, saya fikir dia harus mengembalikan apa yang tinggal padanya melainkan pemiliknya mengabaikannya."
  }
]