[
  {
    "id": 35234,
    "hadith_number": 1056,
    "tajuk_hadith": "Mengenai Pemenuhan Nazar Ibu yang Meninggal Dunia",
    "perawi_melayu": "Yahya daripada Malik daripada Ibn Shihab daripada Ubaydullah ibn Abdullah ibn Utba ibn Masud daripada Abdullah ibn Abbas",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Ubaydullah\nibn Abdullah ibn Utba ibn Masud from Abdullah ibn Abbas that Sad ibn\nUbada questioned the Messenger of Allah, may Allah bless him and grant\nhim peace, and said,\"My mother died while she still had a vow which\nshe had not fulfilled.\" The Messenger of Allah, may Allah bless him\nand grant him peace, said, \"Fulfill it for her.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ سَعْدَ بْنَ عُبَادَةَ، اسْتَفْتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنَّ أُمِّي مَاتَتْ وَعَلَيْهَا نَذْرٌ وَلَمْ تَقْضِهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اقْضِهِ عَنْهَا ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Ibn Shihab, daripada Ubaydullah ibn Abdullah ibn Utba ibn Masud, daripada Abdullah ibn Abbas bahawa Saad ibn Ubada bertanya kepada Rasulullah SAW, katanya: \"Ibuku telah meninggal dunia sedangkan dia masih mempunyai satu nazar yang belum ditunaikan.\"  Rasulullah SAW bersabda: \"Tunaikanlah nazar itu untuknya.\""
  },
  {
    "id": 35235,
    "hadith_number": 1057,
    "tajuk_hadith": "Menggantikan Nazar Orang Lain",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Abdullah ibn Abi Bakr",
    "english_text": "Yahya related to me from Malik from\n\n\nAbdullah ibn Abi\nBakr that his paternal aunt related that her grandmother made a vow to\nwalk to the Quba mosque. She died, and did not fulfill it, so Abdullah\nibn Abbas asked her daughter to walk for her.\n\n\nYahya said that\nhe had heard Malik say, \"No one walks for anyone else.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ عَمَّتِهِ، أَنَّهَا حَدَّثَتْهُ عَنْ جَدَّتِهِ، أَنَّهَا كَانَتْ جَعَلَتْ عَلَى نَفْسِهَا مَشْيًا إِلَى مَسْجِدِ قُبَاءٍ فَمَاتَتْ وَلَمْ تَقْضِهِ فَأَفْتَى عَبْدُ اللَّهِ بْنُ عَبَّاسٍ ابْنَتَهَا أَنْ تَمْشِيَ عَنْهَا ‏.‏ قَالَ يَحْيَى وَسَمِعْتُ مَالِكًا يَقُولُ لاَ يَمْشِي أَحَدٌ عَنْ أَحَدٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Abdullah bin Abi Bakr, dari bibinya, bahawa bibinya telah menceritakan kepadanya dari neneknya, bahawa neneknya telah bernazar untuk berjalan kaki ke Masjid Quba.  Kemudian neneknya meninggal dunia tanpa menunaikan nazar tersebut.  Maka Abdullah bin Abbas memberi fatwa kepada anak perempuan neneknya supaya berjalan kaki bagi menunaikan nazar tersebut. Yahya berkata bahawa dia telah mendengar Malik berkata: \"Tiada seorang pun boleh menunaikan nazar bagi orang lain.\""
  },
  {
    "id": 35236,
    "hadith_number": 1058,
    "tajuk_hadith": "Nazam Berjalan Ke Baitullah",
    "perawi_melayu": "Yahya (dari Malik), Abdullah ibn Abi Habiba",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي حَبِيبَةَ، قَالَ قُلْتُ لِرَجُلٍ وَأَنَا حَدِيثُ السِّنِّ، مَا عَلَى الرَّجُلِ أَنْ يَقُولَ عَلَىَّ مَشْىٌ إِلَى بَيْتِ اللَّهِ وَلَمْ يَقُلْ عَلَىَّ نَذْرُ مَشْىٍ ‏.‏ فَقَالَ لِي رَجُلٌ هَلْ لَكَ أَنْ أُعْطِيَكَ هَذَا الْجِرْوَ - لِجِرْوِ قِثَّاءٍ فِي يَدِهِ - وَتَقُولُ عَلَىَّ مَشْىٌ إِلَى بَيْتِ اللَّهِ قَالَ فَقُلْتُ نَعَمْ فَقُلْتُهُ وَأَنَا يَوْمَئِذٍ حَدِيثُ السِّنِّ ثُمَّ مَكَثْتُ حَتَّى عَقَلْتُ فَقِيلَ لِي إِنَّ عَلَيْكَ مَشْيًا فَجِئْتُ سَعِيدَ بْنَ الْمُسَيَّبِ فَسَأَلْتُهُ عَنْ ذَلِكَ فَقَالَ لِي عَلَيْكَ مَشْىٌ ‏.‏ فَمَشَيْتُ ‏.‏ قَالَ مَالِكٌ وَهَذَا الأَمْرُ عِنْدَنَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abdullah ibn Abi Habiba, katanya:  \"Aku berkata kepada seorang lelaki ketika aku masih muda, ‘Tidak wajib ke atas seseorang itu untuk berkata, ‘Aku hendak berjalan ke Baitullah,’ tanpa dia bernazar untuk berjalan.’ Seorang lelaki berkata kepadaku, ‘Adakah engkau mahu aku berikan timun kecil ini?’ – sambil memegang sebatang timun kecil di tangannya – ‘dan engkau berkata, ‘Aku hendak berjalan ke Baitullah?’ Aku berkata, ‘Ya,’ dan aku mengucapkannya, ketika itu aku masih muda. Kemudian, setelah aku dewasa, aku diberitahu bahawa aku perlu menunaikan nazarku. Aku pergi menemui Said ibn al-Musayyab dan bertanya kepadanya tentang hal itu, lalu beliau berkata, ‘Engkau perlu berjalan.’ Maka aku pun berjalan.’\n\nMalik berkata, ‘Demikianlah kebiasaan di kalangan kami.’"
  },
  {
    "id": 35237,
    "hadith_number": 1059,
    "tajuk_hadith": "Ibadah Haji: Perjalanan yang Terganggu",
    "perawi_melayu": "Yahya, Malik, Urwa bin Udhayna al-Laythi, Abdullah bin Umar, Sa’id bin al-Musayyab, dan Abu Salama bin Abd ar-Rahman",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عُرْوَةَ بْنِ أُذَيْنَةَ اللَّيْثِيِّ، أَنَّهُ قَالَ خَرَجْتُ مَعَ جَدَّةٍ لِي عَلَيْهَا مَشْىٌ إِلَى بَيْتِ اللَّهِ حَتَّى إِذَا كُنَّا بِبَعْضِ الطَّرِيقِ عَجَزَتْ فَأَرْسَلَتْ مَوْلًى لَهَا يَسْأَلُ عَبْدَ اللَّهِ بْنَ عُمَرَ فَخَرَجْتُ مَعَهُ فَسَأَلَ عَبْدَ اللَّهِ بْنَ عُمَرَ فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ عُمَرَ مُرْهَا فَلْتَرْكَبْ ثُمَّ لْتَمْشِي مِنْ حَيْثُ عَجَزَتْ ‏.‏ قَالَ يَحْيَى وَسَمِعْتُ مَالِكًا يَقُولُ وَنَرَى عَلَيْهَا مَعَ ذَلِكَ الْهَدْىَ ‏.‏ \n وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، وَأَبَا، سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ كَانَا يَقُولاَنِ مِثْلَ قَوْلِ عَبْدِ اللَّهِ بْنِ عُمَرَ ‏.",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Urwa bin Udhayna al-Laythi, bahawa dia berkata: \"Aku keluar bersama nenekku yang telah bernazar untuk berjalan kaki ke Baitullah.  Setibanya kami di sebahagian jalan, dia tidak mampu meneruskan perjalanan. Aku menghantar seorang hamba miliknya untuk bertanya kepada Abdullah bin Umar, lalu aku pun keluar bersamanya. Dia bertanya kepada Abdullah bin Umar, lalu Abdullah bin Umar berkata kepadanya:  'Suruhlah dia naik kenderaan, kemudian biarkan dia meneruskan perjalanan berjalan kaki dari tempat dia tidak mampu lagi meneruskan perjalanan.' Yahya berkata: Dan aku mendengar Malik berkata: 'Aku berpendapat bahawa dia perlu menyembelih seekor haiwan korban.'\n\nDan Yahya meriwayatkan daripada Malik bahawa telah sampai kepadanya bahawa Sa'id bin al-Musayyab dan Abu Salama bin Abd ar-Rahman, keduanya mengatakan seperti kata-kata Abdullah bin Umar."
  },
  {
    "id": 35238,
    "hadith_number": 1060,
    "tajuk_hadith": "Nazar Berjalan ke Baitullah dan Ketetapannya",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Yahya ibn Said",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ كَانَ عَلَىَّ مَشْىٌ فَأَصَابَتْنِي خَاصِرَةٌ فَرَكِبْتُ حَتَّى أَتَيْتُ مَكَّةَ فَسَأَلْتُ عَطَاءَ بْنَ أَبِي رَبَاحٍ وَغَيْرَهُ فَقَالُوا عَلَيْكَ هَدْىٌ ‏.‏ فَلَمَّا قَدِمْتُ الْمَدِينَةَ سَأَلْتُ عُلَمَاءَهَا فَأَمَرُونِي أَنْ أَمْشِيَ مَرَّةً أُخْرَى مِنْ حَيْثُ عَجَزْتُ فَمَشَيْتُ ‏.‏ قَالَ يَحْيَى وَسَمِعْتُ مَالِكًا يَقُولُ فَالأَمْرُ عِنْدَنَا فِيمَنْ يَقُولُ عَلَىَّ مَشْىٌ إِلَى بَيْتِ اللَّهِ أَنَّهُ إِذَا عَجَزَ رَكِبَ ثُمَّ عَادَ فَمَشَى مِنْ حَيْثُ عَجَزَ فَإِنْ كَانَ لاَ يَسْتَطِيعُ الْمَشْىَ فَلْيَمْشِ مَا قَدَرَ عَلَيْهِ ثُمَّ لْيَرْكَبْ وَعَلَيْهِ هَدْىُ بَدَنَةٍ أَوْ بَقَرَةٍ أَوْ شَاةٍ إِنْ لَمْ يَجِدْ إِلاَّ هِيَ ‏.‏ وَسُئِلَ مَالِكٌ عَنِ الرَّجُلِ يَقُولُ لِلرَّجُلِ أَنَا أَحْمِلُكَ إِلَى بَيْتِ اللَّهِ فَقَالَ مَالِكٌ إِنْ نَوَى أَنْ يَحْمِلَهُ عَلَى رَقَبَتِهِ يُرِيدُ بِذَلِكَ الْمَشَقَّةَ وَتَعَبَ نَفْسِهِ فَلَيْسَ ذَلِكَ عَلَيْهِ وَلْيَمْشِ عَلَى رِجْلَيْهِ وَلْيُهْدِ وَإِنْ لَمْ يَكُنْ نَوَى شَيْئًا فَلْيَحْجُجْ وَلْيَرْكَبْ وَلْيَحْجُجْ بِذَلِكَ الرَّجُلِ مَعَهُ وَذَلِكَ أَنَّهُ قَالَ أَنَا أَحْمِلُكَ إِلَى بَيْتِ اللَّهِ فَإِنْ أَبَى أَنْ يَحُجَّ مَعَهُ فَلَيْسَ عَلَيْهِ شَىْءٌ وَقَدْ قَضَى مَا عَلَيْهِ ‏.‏ قَالَ يَحْيَى سُئِلَ مَالِكٌ عَنِ الرَّجُلِ يَحْلِفُ بِنُذُورٍ مُسَمَّاةٍ مَشْيًا إِلَى بَيْتِ اللَّهِ أَنْ لاَ يُكَلِّمَ أَخَاهُ أَوْ أَبَاهُ بِكَذَا وَكَذَا نَذْرًا لِشَىْءٍ لاَ يَقْوَى عَلَيْهِ وَلَوْ تَكَلَّفَ ذَلِكَ كُلَّ عَامٍ لَعُرِفَ أَنَّهُ لاَ يَبْلُغُ عُمْرُهُ مَا جَعَلَ عَلَى نَفْسِهِ مِنْ ذَلِكَ فَقِيلَ لَهُ هَلْ يُجْزِيهِ مِنْ ذَلِكَ نَذْرٌ وَاحِدٌ أَوْ نُذُورٌ مُسَمَّاةٌ فَقَالَ مَالِكٌ مَا أَعْلَمُهُ يُجْزِئُهُ مِنْ ذَلِكَ إِلاَّ الْوَفَاءُ بِمَا جَعَلَ عَلَى نَفْسِهِ فَلْيَمْشِ مَا قَدَرَ عَلَيْهِ مِنَ الزَّمَانِ وَلْيَتَقَرَّبْ إِلَى اللَّهِ تَعَالَى بِمَا اسْتَطَاعَ مِنَ الْخَيْرِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said bahawa beliau berkata, \"Saya bernazar untuk berjalan kaki, tetapi saya ditimpa sakit pinggang, maka saya menunggang sehingga sampai ke Mekah. Saya bertanya kepada Ata bin Abi Rabah dan yang lain, lalu mereka berkata, ‘Engkau wajib menyembelih haiwan.’  Setelah sampai di Madinah, saya bertanya kepada ulama di sana, maka mereka menyuruh saya berjalan kaki lagi dari tempat saya tidak mampu meneruskan perjalanan. Maka saya berjalan kaki.\"\n\nYahya berkata bahawa beliau mendengar Malik berkata, \"Hukum kami bagi sesiapa yang bernazar untuk berjalan kaki ke Baitullah, kemudian tidak mampu dan menunggang, ialah dia mesti kembali dan berjalan kaki dari tempat dia tidak mampu meneruskan perjalanan. Sekiranya dia tidak mampu berjalan kaki, maka hendaklah dia berjalan sejauh yang mampu, kemudian menunggang, dan dia wajib menyembelih seekor unta, lembu atau kambing, jika itu sahaja yang mampu didapatinya.\"\n\nMalik, apabila ditanya tentang seseorang yang berkata kepada orang lain, \"Aku akan mendukungmu ke Baitullah,\" menjawab, \"Sekiranya dia berniat untuk mendukungnya di atas bahunya, bermaksud dengan itu kesukaran dan kepenatan dirinya, maka itu tidak wajib ke atasnya. Biarlah dia berjalan kaki dan menyembelih korban.  Sekiranya dia tidak berniat apa-apa, maka hendaklah dia menunaikan haji dan menunggang, dan membawa orang itu menunaikan haji bersamanya. Ini kerana dia berkata, ‘Aku akan mendukungmu ke Baitullah.’ Sekiranya orang itu enggan menunaikan haji bersamanya, maka tidak ada apa-apa ke atasnya, dan apa yang diwajibkan ke atasnya terbatal.\"\n\nYahya berkata bahawa Malik ditanya sama ada cukup bagi seseorang yang telah bernazar bahawa dia akan berjalan kaki ke Baitullah beberapa kali (yang banyak), atau yang telah melarang dirinya daripada bercakap dengan bapanya dan saudaranya, jika dia tidak menunaikan satu nazar, dan dia telah memikul sesuatu melalui nazar yang dia tidak mampu menunaikannya seumur hidupnya, walaupun dia berusaha setiap tahun, untuk menunaikan hanya satu atau beberapa (yang sedikit) nazar kepada Allah? Malik berkata, \"Setahu saya, hanya menunaikan apa yang telah diwajibkannya ke atas dirinya sahaja yang diterima. Biarlah dia berjalan kaki selagi mampu dan mendekatkan diri kepada Allah SWT dengan apa sahaja kebaikan yang mampu dilakukannya.\""
  },
  {
    "id": 35239,
    "hadith_number": 1061,
    "tajuk_hadith": "Nadzar Berjalan ke Baitullah",
    "perawi_melayu": "Yahya daripada Malik",
    "english_text": "Yahya related to me from Malik that what he preferred of what he\nhad heard from the people of knowledge about a man or woman who vowed\nto walk to the House of Allah, was that they fulfilled the oath when\nperforming umra, by walking until they had done say between Safa and\nMarwa. When they had done say it was finished. If they vowed to walk\nin the hajj, they walked until they came to Makka, then they walked\nuntil they had finished all the rites.\n\n\nMalik said, \"Walking\nis only for hajj or umra.\"",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik bahawa apa yang beliau lebih suka daripada apa yang beliau dengar daripada para ulama tentang seseorang lelaki atau perempuan yang bernazar untuk berjalan kaki ke Baitullah, ialah mereka menunaikan nazar tersebut ketika mengerjakan umrah, dengan berjalan kaki sehingga mereka selesai melakukan sa'i di antara Safa dan Marwa. Apabila mereka telah selesai sa'i, maka selesailah nazar tersebut. Jika mereka bernazar untuk berjalan kaki dalam haji, mereka berjalan kaki sehingga sampai ke Mekah, kemudian mereka berjalan kaki sehingga selesai semua ibadat haji.\n\n\nMalik berkata, \"Berjalan kaki hanya untuk haji atau umrah.\""
  },
  {
    "id": 35240,
    "hadith_number": 1062,
    "tajuk_hadith": "Nazar Berpuasa, Berdiam Diri, dan Tidak Berteduh",
    "perawi_melayu": "Yahya daripada Malik daripada Humayd ibn Qays dan Thawr ibn Zayd al-Dili",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ حُمَيْدِ بْنِ قَيْسٍ، وَثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ، أَنَّهُمَا أَخْبَرَاهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَحَدُهُمَا يَزِيدُ فِي الْحَدِيثِ عَلَى صَاحِبِهِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَأَى رَجُلاً قَائِمًا فِي الشَّمْسِ فَقَالَ ‏\"‏ مَا بَالُ هَذَا ‏\"‏ ‏.‏ فَقَالُوا نَذَرَ أَنْ لاَ يَتَكَلَّمَ وَلاَ يَسْتَظِلَّ مِنَ الشَّمْسِ وَلاَ يَجْلِسَ وَيَصُومَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مُرُوهُ فَلْيَتَكَلَّمْ وَلْيَسْتَظِلَّ وَلْيَجْلِسْ وَلْيُتِمَّ صِيَامَهُ ‏\"‏ ‏.‏ قَالَ مَالِكٌ وَلَمْ أَسْمَعْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَهُ بِكَفَّارَةٍ وَقَدْ أَمَرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُتِمَّ مَا كَانَ لِلَّهِ طَاعَةً وَيَتْرُكَ مَا كَانَ لِلَّهِ مَعْصِيَةً ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Humayd ibn Qays dan Thawr ibn Zayd al-Dili, bahawa mereka berdua memberitahunya daripada Rasulullah SAW – dan salah seorang daripada mereka lebih terperinci dalam hadis berbanding yang lain – bahawa Rasulullah SAW melihat seorang lelaki berdiri di bawah matahari. Baginda bertanya, \"Apakah keadaannya?\" Mereka menjawab, \"Dia telah bernazar untuk tidak berkata-kata, tidak berteduh daripada matahari, tidak duduk, dan berpuasa.\"  Rasulullah SAW bersabda, \"Suruhlah dia supaya berkata-kata, berteduh, dan duduk, tetapi hendaklah dia menyempurnakan puasanya.\" Malik berkata, \"Aku tidak pernah mendengar bahawa Rasulullah SAW menyuruh lelaki itu melakukan sebarang kafarah.  Rasulullah SAW hanya menyuruhnya menyempurnakan apa yang merupakan ketaatan kepada Allah dan meninggalkan apa yang merupakan kemaksiatan kepada Allah.\""
  },
  {
    "id": 35241,
    "hadith_number": 1063,
    "tajuk_hadith": "Kaffarah Nazar Mengorbankan Anak",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Yahya ibn Said, daripada al-Qasim ibn Muhammad",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُ سَمِعَهُ يَقُولُ أَتَتِ امْرَأَةٌ إِلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍ فَقَالَتْ إِنِّي نَذَرْتُ أَنْ أَنْحَرَ ابْنِي ‏.‏ فَقَالَ ابْنُ عَبَّاسٍ لاَ تَنْحَرِي ابْنَكِ وَكَفِّرِي عَنْ يَمِينِكِ، ‏.‏ فَقَالَ شَيْخٌ عِنْدَ ابْنِ عَبَّاسٍ وَكَيْفَ يَكُونُ فِي هَذَا كَفَّارَةٌ فَقَالَ ابْنُ عَبَّاسٍ إِنَّ اللَّهَ تَعَالَى قَالَ وَ ‏{‏الَّذِينَ يُظَاهِرُونَ مِنْكُمْ مِنْ نِسَائِهِمْ‏}‏ ثُمَّ جَعَلَ فِيهِ مِنَ الْكَفَّارَةِ مَا قَدْ رَأَيْتَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said, daripada al-Qasim bin Muhammad, bahawa baginda mendengar beliau berkata: Seorang wanita datang kepada Abdullah bin Abbas lalu berkata, \"Sesungguhnya aku telah bernazar untuk menyembelih anakku.\" Maka berkata Abdullah bin Abbas, \"Janganlah engkau menyembelih anakmu, dan cukupkanlah kaffarah atas sumpahmu.\" Lalu berkata seorang tua di sisi Abdullah bin Abbas, \"Bagaimanakah kaffarah bagi perkara ini?\" Maka kata Abdullah bin Abbas, \"Sesungguhnya Allah SWT berfirman, \"Dan orang-orang yang menzihar isteri-isteri mereka dari kalangan kamu,\" kemudian Dia menetapkan kaffarah di dalamnya sebagaimana yang telah kamu lihat."
  },
  {
    "id": 35242,
    "hadith_number": 1064,
    "tajuk_hadith": "Nazar Taat dan Maksiat kepada Allah",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Talhah bin Abd al-Malik al-Ayli, dari al-Qasim bin Muhammad bin ash-Shiddiq, dari Aisyah",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ طَلْحَةَ بْنِ عَبْدِ الْمَلِكِ الأَيْلِيِّ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدِ بْنِ الصِّدِّيقِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ نَذَرَ أَنْ يُطِيعَ اللَّهَ فَلْيُطِعْهُ وَمَنْ نَذَرَ أَنْ يَعْصِيَ اللَّهَ فَلاَ يَعْصِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Talhah bin Abd al-Malik al-Ayli, dari al-Qasim bin Muhammad bin ash-Shiddiq, dari Aisyah, bahawa Rasulullah SAW bersabda:  \"Barangsiapa bernazar untuk mentaati Allah, maka hendaklah dia mentaati-Nya. Dan barangsiapa bernazar untuk menderhakai Allah, maka janganlah dia menderhakai-Nya.\"  Yahya berkata bahawa dia mendengar Malik berkata, \"Maksud sabda Nabi SAW, 'Barangsiapa bernazar untuk menderhakai Allah, maka janganlah dia menderhakai-Nya,' ialah sepertimana seorang lelaki yang bernazar bahawa jika dia bercakap dengan seseorang, dia akan berjalan kaki ke Syria, Mesir, atau perkara-perkara lain yang tidak dianggap sebagai ibadah, dia tidak diwajibkan atas mana-mana perkara itu, walaupun dia bercakap dengan lelaki tersebut atau melanggar apa sahaja yang telah dia nazar, kerana Allah SWT tidak mewajibkan ketaatan dalam perkara-perkara sedemikian. Dia hanya perlu menunaikan perkara-perkara yang melibatkan ketaatan kepada Allah.\" "
  },
  {
    "id": 35243,
    "hadith_number": 1065,
    "tajuk_hadith": "Sumpah Yang Sia-sia dan Sumpah Yang Mengikat",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Hisyam bin Urwah daripada bapanya daripada Aisyah, Ummul Mukminin",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّهَا كَانَتْ تَقُولُ لَغْوُ الْيَمِينِ قَوْلُ الإِنْسَانِ لاَ وَاللَّهِ بَلَى وَاللَّهِ ‏.‏ قَالَ مَالِكٌ أَحْسَنُ مَا سَمِعْتُ فِي هَذَا أَنَّ اللَّغْوَ حَلِفُ الإِنْسَانِ عَلَى الشَّىْءِ يَسْتَيْقِنُ أَنَّهُ كَذَلِكَ ثُمَّ يُوجَدُ عَلَى غَيْرِ ذَلِكَ فَهُوَ اللَّغْوُ ‏.‏ قَالَ مَالِكٌ وَعَقْدُ الْيَمِينِ أَنْ يَحْلِفَ الرَّجُلُ أَنْ لاَ يَبِيعَ ثَوْبَهُ بِعَشَرَةِ دَنَانِيرَ ثُمَّ يَبِيعَهُ بِذَلِكَ أَوْ يَحْلِفَ لَيَضْرِبَنَّ غُلاَمَهُ ثُمَّ لاَ يَضْرِبُهُ وَنَحْوَ هَذَا فَهَذَا الَّذِي يُكَفِّرُ صَاحِبُهُ عَنْ يَمِينِهِ وَلَيْسَ فِي اللَّغْوِ كَفَّارَةٌ ‏.‏ قَالَ مَالِكٌ فَأَمَّا الَّذِي يَحْلِفُ عَلَى الشَّىْءِ وَهُوَ يَعْلَمُ أَنَّهُ آثِمٌ وَيَحْلِفُ عَلَى الْكَذِبِ وَهُوَ يَعْلَمُ لِيُرْضِيَ بِهِ أَحَدًا أَوْ لِيَعْتَذِرَ بِهِ إِلَى مُعْتَذَرٍ إِلَيْهِ أَوْ لِيَقْطَعَ بِهِ مَالاً فَهَذَا أَعْظَمُ مِنْ أَنْ تَكُونَ فِيهِ كَفَّارَةٌ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Hisyam bin Urwah daripada bapanya daripada Aisyah, Ummul Mukminin, bahawa beliau berkata: “Sumpah yang sia-sia ialah seseorang berkata, ‘Tidak, demi Allah! Ya, demi Allah!’ iaitu sebagai kebiasaan.”\n\nMalik berkata: “Yang paling baik yang aku dengar tentang perkara ini ialah sumpah yang sia-sia ialah seseorang bersumpah atas sesuatu perkara yang dia yakin akan keadaannya, kemudian ia didapati sebaliknya. Itulah sumpah yang sia-sia.”\n\nMalik berkata: “Adapun sumpah yang mengikat ialah seperti seseorang bersumpah bahawa dia tidak akan menjual kainnya dengan sepuluh dinar, kemudian dia menjualnya dengan harga itu, atau dia bersumpah bahawa dia akan menyeksa hambanya, kemudian dia tidak menyeksanya dan sebagainya.  Orang yang bersumpah seperti itu wajib membayar kafarah, manakala sumpah yang sia-sia tidak memerlukan kafarah.”\n\nMalik berkata: “Adapun orang yang bersumpah atas sesuatu perkara yang dia tahu ia berdosa, dan dia bersumpah dengan berbohong sedangkan dia tahu bahawa ia berbohong, untuk menyenangkan seseorang, atau untuk meminta maaf kepada seseorang, atau untuk mendapatkan harta, maka ini adalah lebih besar daripada kafarah yang dilakukannya.”"
  },
  {
    "id": 35244,
    "hadith_number": 1066,
    "tajuk_hadith": "Sumpah dan Niat InsyaAllah",
    "perawi_melayu": "Yahya daripada Malik daripada Nafi' daripada Abdullah bin Umar",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ يَقُولُ مَنْ قَالَ وَاللَّهِ ثُمَّ قَالَ إِنْ شَاءَ اللَّهُ ثُمَّ لَمْ يَفْعَلِ الَّذِي حَلَفَ عَلَيْهِ لَمْ يَحْنَثْ ‏.‏ قَالَ مَالِكٌ أَحْسَنُ مَا سَمِعْتُ فِي الثُّنْيَا أَنَّهَا لِصَاحِبِهَا مَا لَمْ يَقْطَعْ كَلاَمَهُ وَمَا كَانَ مِنْ ذَلِكَ نَسَقًا يَتْبَعُ بَعْضُهُ بَعْضًا قَبْلَ أَنْ يَسْكُتَ فَإِذَا سَكَتَ وَقَطَعَ كَلاَمَهُ فَلاَ ثُنْيَا لَهُ ‏.‏ قَالَ يَحْيَى وَقَالَ مَالِكٌ فِي الرَّجُلِ يَقُولُ كَفَرَ بِاللَّهِ أَوْ أَشْرَكَ بِاللَّهِ ثُمَّ يَحْنَثُ إِنَّهُ لَيْسَ عَلَيْهِ كَفَّارَةٌ وَلَيْسَ بِكَافِرٍ وَلاَ مُشْرِكٍ حَتَّى يَكُونَ قَلْبُهُ مُضْمِرًا عَلَى الشِّرْكِ وَالْكُفْرِ وَلْيَسْتَغْفِرِ اللَّهَ وَلاَ يَعُدْ إِلَى شَىْءٍ مِنْ ذَلِكَ وَبِئْسَ مَا صَنَعَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Nafi', daripada Abdullah bin Umar bahawa baginda berkata, \"Barangsiapa yang bersumpah dengan nama Allah, kemudian berkata, 'Insya-Allah', kemudian tidak melakukan apa yang telah disumpahinya, maka dia tidak dianggap mengingkari sumpahnya.\" \n\nMalik berkata, \"Pendapat terbaik yang aku dengar mengenai perkara ini ialah bahawa ia terpakai kepada orang yang bersumpah selagi dia tidak memutuskan kata-katanya sebelum dia diam. Jika dia diam dan memutuskan kata-katanya, maka tidak ada pengecualian baginya.\" \n\nYahya berkata, \"Malik berkata bahawa seseorang yang berkata bahawa dia telah kufur kepada Allah atau syirik kepada Allah, kemudian dia mengingkari sumpahnya, maka tidak wajib ke atasnya kafarah, dan dia bukanlah seorang yang kufur atau musyrik sehingga hatinya menyimpan niat syirik dan kufur.  Hendaklah dia memohon keampunan daripada Allah dan jangan mengulanginya lagi – kerana apa yang telah dilakukannya itu adalah sesuatu yang buruk.\""
  },
  {
    "id": 35245,
    "hadith_number": 1067,
    "tajuk_hadith": "Kaffarah Sumpah dan Nazar",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Suhayl bin Abi Shalih, dari bapanya, dari Abu Hurairah",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ حَلَفَ بِيَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيُكَفِّرْ عَنْ يَمِينِهِ وَلْيَفْعَلِ الَّذِي هُوَ خَيْرٌ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Suhayl bin Abi Shalih, daripada bapanya, daripada Abu Hurairah, bahawa Rasulullah SAW bersabda:  \"Barangsiapa yang bersumpah dengan suatu sumpah, kemudian dia mendapati sesuatu yang lain lebih baik daripada sumpah tersebut, maka hendaklah dia bertaubat daripada sumpahnya dan hendaklah dia melakukan apa yang lebih baik.\"  Yahya berkata bahawa dia mendengar Malik berkata: \"Sesiapa yang berkata bahawa dia mempunyai nazar tetapi tidak menyebut nama Allah, dia masih diwajibkan untuk menunaikan kafarah sumpah (jika dia melanggarnya).\" Malik berkata: \"Penegasan adalah apabila seseorang bersumpah sesuatu beberapa kali, mengulangi sumpah itu dalam ucapannya berulang kali. Contohnya, kenyataan, 'Demi Allah, aku tidak akan mengurangkannya daripada sekian-sekian,' yang disumpah tiga kali atau lebih. Kafarahnya adalah seperti kafarah satu sumpah. Jika seseorang bersumpah, 'Aku tidak akan makan makanan ini atau memakai pakaian ini atau memasuki rumah ini,' itu semua dalam satu sumpah, dan dia hanya diwajibkan melakukan satu kafarah.  Begitu juga bagi seseorang yang berkata kepada isterinya, 'Engkau diceraikan jika aku mengenakan pakaian ini kepadamu atau membiarkan engkau pergi ke masjid,' dan ia adalah satu pernyataan lengkap dalam pola pertuturan biasa. Jika dia melanggar mana-mana sumpah itu, talak adalah perlu, dan tidak ada pelanggaran sumpah selepas itu dalam apa sahaja yang dia lakukan. Hanya ada satu sumpah yang perlu ditunaikan dalam hal itu.\" Malik berkata: \"Apa yang kita lakukan terhadap seorang wanita yang membuat nazar tanpa izin suaminya ialah dia dibenarkan berbuat demikian dan dia mesti menunaikannya, jika ia hanya berkaitan dengan dirinya sendiri dan tidak akan membahayakan suaminya. Walau bagaimanapun, jika ia akan membahayakan suaminya, dia boleh melarang isterinya menunaikannya, tetapi ia tetap menjadi kewajipan ke atasnya sehingga dia berpeluang untuk menyempurnanya.\""
  },
  {
    "id": 35246,
    "hadith_number": 1068,
    "tajuk_hadith": "Kafaarah (TeBusan) Bagi Sumpah Yang Dipecah",
    "perawi_melayu": "Yahya daripada Malik daripada Nafi' daripada Abdullah bin Umar",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ يَقُولُ مَنْ حَلَفَ بِيَمِينٍ فَوَكَّدَهَا ثُمَّ حَنِثَ فَعَلَيْهِ عِتْقُ رَقَبَةٍ أَوْ كِسْوَةُ عَشَرَةِ مَسَاكِينَ وَمَنْ حَلَفَ بِيَمِينٍ فَلَمْ يُؤَكِّدْهَا ثُمَّ حَنِثَ فَعَلَيْهِ إِطْعَامُ عَشَرَةِ مَسَاكِينَ لِكُلِّ مِسْكِينٍ مُدٌّ مِنْ حِنْطَةٍ فَمَنْ لَمْ يَجِدْ فَصِيَامُ ثَلاَثَةِ أَيَّامٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Nafi', daripada Abdullah bin Umar bahawa baginda berkata: \"Barangsiapa yang bersumpah dengan sumpah yang ditegaskannya kemudian mengingkari sumpahnya, maka wajib ke atasnya memerdekakan seorang hamba sahaya atau memberi pakaian kepada sepuluh orang miskin. Dan barangsiapa yang bersumpah tetapi tidak menegasnya, kemudian mengingkari sumpahnya, maka wajib ke atasnya memberi makan kepada sepuluh orang miskin, iaitu bagi setiap orang miskin satu mud gandum. Dan barangsiapa yang tidak mampu berbuat demikian, maka hendaklah ia berpuasa tiga hari.\""
  },
  {
    "id": 35247,
    "hadith_number": 1069,
    "tajuk_hadith": "Kafaarah Sumpah Abdullah ibn Umar",
    "perawi_melayu": "Yahya daripada Malik daripada Nafi' daripada Abdullah ibn Umar",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to do kaffara for a broken oath by feeding ten poor people. Each\nperson got a mudd of wheat. He sometimes freed a slave if he had\nrepeated the oath.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ يُكَفِّرُ عَنْ يَمِينِهِ، بِإِطْعَامِ عَشَرَةِ مَسَاكِينَ لِكُلِّ مِسْكِينٍ مُدٌّ مِنْ حِنْطَةٍ وَكَانَ يَعْتِقُ الْمِرَارَ إِذَا وَكَّدَ الْيَمِينَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik, daripada Nafi', daripada Abdullah ibn Umar bahawa baginda biasa menunaikan kaffarah (tebusan) bagi sumpahnya dengan memberi makan sepuluh orang miskin. Setiap orang miskin diberi satu mud gandum.  Kadang kala baginda memerdekakan seorang hamba jika baginda mengulangi sumpah itu."
  },
  {
    "id": 35248,
    "hadith_number": 1070,
    "tajuk_hadith": "Kaffarah Sumpah dan Pakaian",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Yahya ibn Said daripada Sulaiman ibn Yasar",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّهُ قَالَ أَدْرَكْتُ النَّاسَ وَهُمْ إِذَا أَعْطَوْا فِي كَفَّارَةِ الْيَمِينِ أَعْطَوْا مُدًّا مِنْ حِنْطَةٍ بِالْمُدِّ الأَصْغَرِ وَرَأَوْا ذَلِكَ مُجْزِئًا عَنْهُمْ ‏.‏ قَالَ مَالِكٌ أَحْسَنُ مَا سَمِعْتُ فِي الَّذِي يُكَفِّرُ عَنْ يَمِينِهِ بِالْكِسْوَةِ أَنَّهُ إِنْ كَسَا الرِّجَالَ كَسَاهُمْ ثَوْبًا ثَوْبًا وَإِنْ كَسَا النِّسَاءَ كَسَاهُنَّ ثَوْبَيْنِ ثَوْبَيْنِ دِرْعًا وَخِمَارًا وَذَلِكَ أَدْنَى مَا يُجْزِي كُلاًّ فِي صَلاَتِهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Yahya ibn Said daripada Sulaiman ibn Yasar, bahawa beliau berkata: \"Aku mendapati orang ramai, apabila mereka memberi kaffarah bagi sumpah, mereka memberi satu mud gandum mengikut mud yang lebih kecil, dan mereka menganggapnya mencukupi bagi mereka.\" Malik berkata: \"Yang terbaik yang aku dengar tentang orang yang menunaikan kaffarah sumpahnya dengan pakaian ialah jika dia memberi pakaian kepada lelaki, dia memberi mereka sehelai baju setiap seorang. Jika dia memberi pakaian kepada wanita, dia memberi mereka dua helai pakaian, iaitu baju dan tudung kepala, kerana itulah yang paling minimum yang mencukupi bagi masing-masing untuk solat.\""
  },
  {
    "id": 35249,
    "hadith_number": 1071,
    "tajuk_hadith": "Larangan Bersumpah dengan Nama Bapa",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Nafi', daripada Abdullah bin Umar",
    "english_text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat one time the Messenger of Allah, may Allah bless him and grant\nhim peace, was speaking to Umar ibn al-Khattab while he was travelling\nwith a troop and Umar swore by his father and he (the Messenger) said,\n\"Allah forbids you to swear by your fathers. If anyone swears, let him\nswear by Allah or keep silent.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَدْرَكَ عُمَرَ بْنَ الْخَطَّابِ - رضى الله عنه - وَهُوَ يَسِيرُ فِي رَكْبٍ وَهُوَ يَحْلِفُ بِأَبِيهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ فَمَنْ كَانَ حَالِفًا فَلْيَحْلِفْ بِاللَّهِ أَوْ لِيَصْمُتْ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Nafi', daripada Abdullah bin Umar bahawa suatu ketika, Rasulullah SAW bertemu Umar bin al-Khattab ketika beliau sedang dalam perjalanan bersama rombongan. Umar bersumpah dengan nama bapanya. Maka Rasulullah SAW bersabda, \"Sesungguhnya Allah melarang kamu daripada bersumpah dengan nama bapa-bapa kamu. Barangsiapa yang hendak bersumpah, hendaklah bersumpah dengan nama Allah atau hendaklah dia berdiam diri.\""
  },
  {
    "id": 35250,
    "hadith_number": 1072,
    "tajuk_hadith": "Sumpah Rasulullah SAW dengan Yang Membolak-balikkan Hati",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik",
    "english_text": "Yahya related to me from Malik that he had heard that the\nMessenger of Allah, may Allah bless him and grant him peace, used\ntosay, \"No, by the Overturner of hearts.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَقُولُ ‏\n\"‏ لاَ وَمُقَلِّبِ الْقُلُوبِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik bahawa baginda telah mendengar bahawa Rasulullah SAW  berkata, \"Tidak, demi Yang membolak-balikkan hati.\""
  },
  {
    "id": 35251,
    "hadith_number": 1073,
    "tajuk_hadith": "Mengenai Sedekah Sebahagian Harta Selepas Bertaubat",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Usman bin Hafs bin Umar bin Khaldah, dari Ibnu Syihab bahawa beliau telah diberitahu bahawa Abu Lubabah bin Abd al-Munzir, ketika Allah menerima taubatnya, berkata: \"Wahai Rasulullah, patutkah saya meninggalkan rumah kaumku di mana saya telah melakukan dosa dan saya tinggal bersamamu serta menyedekahkan semua harta saya kepada Allah dan Rasul-Nya?\"  Rasulullah SAW bersabda: \"Sepertiga darinya sudah memadai untukmu.\"",
    "english_text": "Yahya related to me from Malik from Uthman ibn Hafs ibn Umar ibn\nKhalda that Ibn Shihab had heard that Abu Lubaba ibn Abd al-Mundhir,\nwhen Allah turned to him said, \"Messenger of Allah, should I leave my\npeople's house in which I committed wrong action and keep your\ncompany, and give away all my property as sadaqa for Allah and His\nMessenger? \"The Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Giving away a third of it is enough for you.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عُثْمَانَ بْنِ حَفْصِ بْنِ عُمَرَ بْنِ خَلْدَةَ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ بَلَغَهُ أَنَّ أَبَا لُبَابَةَ بْنَ عَبْدِ الْمُنْذِرِ، حِينَ تَابَ اللَّهُ عَلَيْهِ قَالَ يَا رَسُولَ اللَّهِ أَهْجُرُ دَارَ قَوْمِي الَّتِي أَصَبْتُ فِيهَا الذَّنْبَ وَأُجَاوِرُكَ وَأَنْخَلِعُ مِنْ مَالِي صَدَقَةً إِلَى اللَّهِ وَإِلَى رَسُولِهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يُجْزِيكَ مِنْ ذَلِكَ الثُّلُثُ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Usman bin Hafs bin Umar bin Khaldah, daripada Ibnu Syihab bahawa baginda telah diberitahu bahawa Abu Lubabah bin Abd al-Munzir, ketika Allah menerima taubatnya, berkata: \"Wahai Rasulullah, patutkah saya meninggalkan rumah kaumku di mana saya telah melakukan dosa dan saya tinggal bersamamu serta menyedekahkan semua harta saya kepada Allah dan Rasul-Nya?\" Rasulullah SAW bersabda: \"Sepertiga darinya sudah memadai untukmu.\""
  },
  {
    "id": 35252,
    "hadith_number": 1074,
    "tajuk_hadith": "Kafaarah Bagi Nadzar Harta",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Ayyub bin Musa, dari Mansur bin Abd ar-Rahman al-Hajabi, dari ibunya, dari Aisyah Ummul Mukminin, ra.",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَيُّوبَ بْنِ مُوسَى، عَنْ مَنْصُورِ بْنِ عَبْدِ الرَّحْمَنِ الْحَجَبِيِّ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، - رضى الله عنها أَنَّهَا سُئِلَتْ عَنْ رَجُلٍ قَالَ مَالِي فِي رِتَاجِ الْكَعْبَةِ ‏.‏ فَقَالَتْ عَائِشَةُ يُكَفِّرُهُ مَا يُكَفِّرُ الْيَمِينَ ‏.‏ قَالَ مَالِكٌ فِي الَّذِي يَقُولُ مَالِي فِي سَبِيلِ اللَّهِ ثُمَّ يَحْنَثُ قَالَ يَجْعَلُ ثُلُثَ مَالِهِ فِي سَبِيلِ اللَّهِ وَذَلِكَ لِلَّذِي جَاءَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي أَمْرِ أَبِي لُبَابَةَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ayyub bin Musa, daripada Mansur bin Abd ar-Rahman al-Hajabi, daripada ibunya, daripada Aisyah Ummul Mukminin, radiallahuanha, bahawa beliau ditanya tentang seorang lelaki yang berkata, \"Hartaku untuk Kaabah.\" Maka Aisyah berkata, \"Dia hendaklah menunaikan kafaarahnya sepertimana kafaarah sumpah.\" Malik berkata, \"Bagi orang yang berkata, \"Hartaku untuk jalan Allah,\" kemudian dia mengingkari janjinya, maka hendaklah dia memberikan sepertiga hartanya di jalan Allah.  Ini berdasarkan apa yang diriwayatkan daripada Rasulullah Sallallahu Alaihi Wasallam mengenai hal Abu Lubabah."
  }
]