[
  {
    "id": 36016,
    "hadith_number": 1838,
    "tajuk_hadith": "Penjelasan Tentang Mata Jahat dan Amalan Menangani Penyakit Mata Jahat",
    "perawi_melayu": null,
    "english_text": "Yahya related to me from Malik that Muhammad ibn Abi Umama ibn\nSahl ibn Hunayf heard his father say, \"My father, Sahl ibn Hunayf did\na ghusl at al-Kharrar. He removed the jubbah he had on while Amir ibn\nRabia was watching, and Sahl was a man with beautiful white skin. Amir\nsaid to him, 'I have never seen anything like what I have seen today,\nnot even the skin of a virgin.' Sahl fell ill on the spot, and his\ncondition grew worse. Somebody went to the Messenger of Allah, may\nAllah bless him and grant him peace, and told him that Sahl was ill,\nand could not go with him. The Messenger of Allah, may Allah bless him\nand grant him peace, came to him, and Sahl told him what had happened\nwith Amir. The Messenger of Allah, may Allah bless him and grant him\npeace, said, 'Why does one of you kill his brother? Why did you not\nsay, \"May Allah bless you?\" (ta baraka-llah) The evil eye is true. Do\nwudu from it.' Amir did wudu from it and Sahl went with the Messenger\nof Allah, may Allah bless him and grant him peace, and there was\nnothing wrong with him.\"",
    "arabic_text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، أَنَّهُ سَمِعَ أَبَاهُ، يَقُولُ اغْتَسَلَ أَبِي سَهْلُ بْنُ حُنَيْفٍ بِالْخَرَّارِ فَنَزَعَ جُبَّةً كَانَتْ عَلَيْهِ وَعَامِرُ بْنُ رَبِيعَةَ يَنْظُرُ قَالَ وَكَانَ سَهْلٌ رَجُلاً أَبْيَضَ حَسَنَ الْجِلْدِ - قَالَ - فَقَالَ لَهُ عَامِرُ بْنُ رَبِيعَةَ مَا رَأَيْتُ كَالْيَوْمِ وَلاَ جِلْدَ عَذْرَاءَ ‏.‏ قَالَ فَوُعِكَ سَهْلٌ مَكَانَهُ وَاشْتَدَّ وَعْكُهُ فَأُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأُخْبِرَ أَنَّ سَهْلاً وُعِكَ وَأَنَّهُ غَيْرُ رَائِحٍ مَعَكَ يَا رَسُولَ اللَّهِ فَأَتَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَخْبَرَهُ سَهْلٌ بِالَّذِي كَانَ مِنْ شَأْنِ عَامِرٍ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ عَلاَمَ يَقْتُلُ أَحَدُكُمْ أَخَاهُ أَلاَّ بَرَّكْتَ إِنَّ الْعَيْنَ حَقٌّ تَوَضَّأْ لَهُ ‏\"‏ ‏.‏ فَتَوَضَّأَ لَهُ عَامِرٌ فَرَاحَ سَهْلٌ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم لَيْسَ بِهِ بَأْسٌ ‏.‏",
    "malay_translation": "Hadis ini menceritakan tentang kejadian yang berlaku di antara Sahl ibn Hunayf dan Amir ibn Rabiah.  Sahl telah mandi wajib (ghusl) di al-Kharrar, dan Amir, ketika memerhatikannya, mengagumi kecantikan kulit putih Sahl.  Amir kemudian menyatakan kata-kata yang dianggap membawa 'mata jahat' terhadap Sahl. Akibatnya, Sahl jatuh sakit.  Berita tentang sakit Sahl disampaikan kepada Rasulullah SAW, dan baginda mengunjungi Sahl. Sahl menceritakan kejadian tersebut kepada Rasulullah SAW.  Rasulullah SAW kemudian menjelaskan tentang kesan 'mata jahat' dan mengarahkan Amir melakukan wuduk (wudu) untuk meniadakan kesan tersebut. Setelah itu, Sahl sembuh dan dapat kembali bersama Rasulullah SAW.  Hadis ini menjelaskan tentang bahaya mata jahat dan cara-cara untuk mengatasinya."
  },
  {
    "id": 36017,
    "hadith_number": 1839,
    "tajuk_hadith": "Kisah Amir bin Rabia dan Pemulihan Sahl bin Hunayf",
    "perawi_melayu": "Malik bin Anas",
    "english_text": "Malik related to me from Ibn Shihab that Abu Umama ibn Sahl ibn\nHunayf said, ''Amir ibn Rabia saw Sahl ibn Hunayf doing a ghusl and\nsaid, 'I have not seen the like of what I see today, not even the skin\nof a maiden who has never been out of doors.' Sahl fell to the ground.\nThe Messenger of Allah, may Allah bless him and grant him peace, was\napproached and it was said, 'Messenger of Allah, can you do anything\nabout Sahl ibn Hunayf? By Allah, he can not raise his head.' He said,\n'Do you suspect anyone of it?' They said, 'We suspect Amir ibn Rabia.'\n\"\n\n\nHe continued, \"The Messenger of Allah, may Allah bless him\nand grant him peace, summoned Amir and was furious with him and said,\n'Why does one of you kill his brother? Why did you not say, \"May Allah\nbless you?\" Do ghusl for it.' Amir washed his face, hands, elbows,\nknees, the end of his feet, and inside his lower garment in a vessel.\nThen he poured it over him, and Sahl went off with the people, and\nthere was nothing wrong with him.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، أَنَّهُ قَالَ رَأَى عَامِرُ بْنُ رَبِيعَةَ سَهْلَ بْنَ حُنَيْفٍ يَغْتَسِلُ فَقَالَ مَا رَأَيْتُ كَالْيَوْمِ وَلاَ جِلْدَ مُخْبَأَةٍ ‏.‏ فَلُبِطَ سَهْلٌ فَأُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقِيلَ يَا رَسُولَ اللَّهِ هَلْ لَكَ فِي سَهْلِ بْنِ حُنَيْفٍ وَاللَّهِ مَا يَرْفَعُ رَأْسَهُ ‏.‏ فَقَالَ ‏\"‏ هَلْ تَتَّهِمُونَ لَهُ أَحَدًا ‏\"‏ قَالُوا نَتَّهِمُ عَامِرَ بْنَ رَبِيعَةَ ‏.‏ قَالَ فَدَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَامِرًا فَتَغَيَّظَ عَلَيْهِ وَقَالَ ‏\"‏ عَلاَمَ يَقْتُلُ أَحَدُكُمْ أَخَاهُ أَلاَّ بَرَّكْتَ اغْتَسِلْ لَهُ ‏\"‏ ‏.‏ فَغَسَلَ عَامِرٌ وَجْهَهُ وَيَدَيْهِ وَمِرْفَقَيْهِ وَرُكْبَتَيْهِ وَأَطْرَافَ رِجْلَيْهِ وَدَاخِلَةَ إِزَارِهِ فِي قَدَحٍ ثُمَّ صُبَّ عَلَيْهِ فَرَاحَ سَهْلٌ مَعَ النَّاسِ لَيْسَ بِهِ بَأْسٌ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Ibn Shihab, daripada Abu Umama bin Sahl bin Hunayf, bahawa beliau berkata, \"Amir bin Rabia melihat Sahl bin Hunayf sedang berwضو, lalu berkata, 'Aku tidak pernah melihat sesuatu yang seperti hari ini, bahkan tidak seperti kulit seorang gadis yang tidak pernah keluar rumah.' Sahl pun pengsan.  Kemudian, Rasulullah SAW dihampiri dan dikatakan, 'Ya Rasulullah, adakah tuan dapat membantu Sahl bin Hunayf? Demi Allah, dia tidak dapat mengangkat kepalanya.' Baginda bertanya, 'Adakah kamu menuduh seseorang?' Mereka menjawab, 'Kami menuduh Amir bin Rabia.'  Baginda memanggil Amir dan murka kepadanya, lalu berkata, 'Mengapa salah seorang daripada kamu membunuh saudaranya? Mengapa kamu tidak mengucapkan 'Semoga Allah memberkatimu?' Berwuduklah untuknya.' Amir mencuci mukanya, tangan, siku, lutut, hujung kakinya, dan bahagian dalam pakaiannya di dalam sebuah bekas. Kemudian, dia menuangkan air tersebut ke atas Sahl. Sahl pun sihat kembali bersama orang ramai tanpa sebarang penyakit.\""
  },
  {
    "id": 36018,
    "hadith_number": 1840,
    "tajuk_hadith": "Keberkesanan Doa Pembacaan Ayat Al-Quran untuk Mengatasi Mata Jahat",
    "perawi_melayu": "Yahya daripada Malik, daripada Humayd ibn Qays al-Makki",
    "english_text": "Yahya related to me from Malik that Humayd ibn Qays al-Makki\nsaid, \"A man came to the Messenger of Allah, may Allah bless him and\ngrant him peace, with the two sons of Jafar ibn Abi Talib. He said to\ntheir nursemaid, 'Why do I see them so thin?' Their nursemaid said,\n'Messenger of Allah, the evil eye goes quickly to them. Nothing stops\nus from asking someone to make incantations (using ayats of Qur'an)\nfor them, except that we do not know what of that would agree with\nyou.' The Messenger of ,Allah, may Allah bless him and grant him\npeace, said, 'Make incantations for them. Had anything been able to\nprecede the decree, the evil eye would precede it.' \"",
    "arabic_text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ حُمَيْدِ بْنِ قَيْسٍ الْمَكِّيِّ، أَنَّهُ قَالَ دُخِلَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِابْنَىْ جَعْفَرِ بْنِ أَبِي طَالِبٍ فَقَالَ لِحَاضِنَتِهِمَا ‏\"‏ مَا لِي أَرَاهُمَا ضَارِعَيْنِ ‏\"‏ ‏.‏ فَقَالَتْ حَاضِنَتُهُمَا يَا رَسُولَ اللَّهِ إِنَّهُ تَسْرَعُ إِلَيْهِمَا الْعَيْنُ وَلَمْ يَمْنَعْنَا أَنْ نَسْتَرْقِيَ لَهُمَا إِلاَّ أَنَّا لاَ نَدْرِي مَا يُوَافِقُكَ مِنْ ذَلِكَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اسْتَرْقُوا لَهُمَا فَإِنَّهُ لَوْ سَبَقَ شَىْءٌ الْقَدَرَ لَسَبَقَتْهُ الْعَيْنُ ‏\"‏ ‏.‏",
    "malay_translation": "Perawi Yahya meriwayatkan daripada Malik, daripada Humayd ibn Qays al-Makki, bahawa beliau berkata, \"Seorang lelaki datang menemui Rasulullah SAW bersama dua anak lelaki Ja'far ibn Abi Talib. Beliau bertanya kepada pengasuh mereka, 'Mengapa aku melihat mereka begitu kurus?' Pengasuh mereka menjawab, 'Wahai Rasulullah, mata jahat sentiasa cepat menimpanya. Tiada yang menghalang kita daripada meminta seseorang membaca ayat-ayat Al-Quran untuk mereka, kecuali kita tidak tahu mana yang akan anda redhai.' Rasulullah SAW bersabda, 'Bacakan ayat-ayat Al-Quran untuk mereka. Sekiranya sesuatu perkara mampu mendahului takdir, nescaya mata jahat akan mendahuluinya.'\""
  },
  {
    "id": 36019,
    "hadith_number": 1841,
    "tajuk_hadith": "Petunjuk Nabi SAW Mengenai Penyakit Mata Jahat",
    "perawi_melayu": "Yahya daripada Malik daripada Yahya bin Said daripada Sulaiman bin Yasar, daripada Urwah bin Zubair",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said from Sulayman\nibn Yasar that Urwa ibn az-Zubayr told him that the Messenger of\nAllah, may Allah bless him and grant him peace, entered the house of\nUmm Salama, the wife of the Prophet, may Allah bless him and grant him\npeace. There was a child weeping in the house, and they told him that\nit was from the evil eye. Urwa said, \"The Messenger of Allah, may\nAllah bless him and grant him peace, said, 'Why do you not find\nsomeone to make an incantation to protect it from the evil eye?' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ، حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ بَيْتَ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم وَفِي الْبَيْتِ صَبِيٌّ يَبْكِي فَذَكَرُوا لَهُ أَنَّ بِهِ الْعَيْنَ - قَالَ عُرْوَةُ - فَقَالَ رَسُولُ اللَّهِ",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Yahya bin Said daripada Sulaiman bin Yasar, daripada Urwah bin Zubair, bahawa Rasulullah SAW memasuki rumah Umm Salamah, isteri Nabi SAW. Di dalam rumah itu terdapat seorang bayi yang menangis, dan mereka memberitahunya bahawa bayi itu terkena penyakit mata jahat. Urwah berkata, \"Rasulullah SAW bersabda, 'Mengapa kamu tidak mencari seseorang untuk melakukan bacaan mantera untuk melindungi bayi itu daripada penyakit mata jahat?'\""
  },
  {
    "id": 36020,
    "hadith_number": 1842,
    "tajuk_hadith": "Keadaan Orang Sakit dan Rahmat Allah",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn\nYasar that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"When the slave is ill, Allah ta'ala sends two angels to\nhim.\" He said, \"They look at what he says to his visitors. If he\npraises Allah and lauds Him, when they come to him, they take that up\nto Allah, the Mighty, the Majestic, and He knows best, and He says,\n'If I make my slave die, I will make him enter the Garden. If I heal\nhim, I will replace his flesh with better flesh and his blood with\nbetter blood and I will efface his evil actions.'\"",
    "arabic_text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا مَرِضَ الْعَبْدُ بَعَثَ اللَّهُ تَعَالَى إِلَيْهِ مَلَكَيْنِ فَقَالَ انْظُرَا مَاذَا يَقُولُ لِعُوَّادِهِ ‏.‏ فَإِنْ هُوَ - إِذَا جَاءُوهُ - حَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ رَفَعَا ذَلِكَ إِلَى اللَّهِ عَزَّ وَجَلَّ - وَهُوَ أَعْلَمُ - فَيَقُولُ لِعَبْدِي عَلَىَّ إِنْ تَوَفَّيْتُهُ أَنْ أُدْخِلَهُ الْجَنَّةَ وَإِنْ أَنَا شَفَيْتُهُ أَنْ أُبْدِلَ لَهُ لَحْمًا خَيْرًا مِنْ لَحْمِهِ وَدَمًا خَيْرًا مِنْ دَمِهِ وَأَنْ أُكَفِّرَ عَنْهُ سَيِّئَاتِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Diceritakan oleh Yahya dari Malik, dari Zayd ibn Aslam, dari Ata ibn Yasar, bahawa Rasulullah SAW bersabda, \"Apabila seorang hamba sakit, Allah SWT menghantar dua malaikat kepadanya.\" Mereka diperintahkan melihat apa yang dikatakannya kepada para pengunjungnya. Jika dia memuji Allah dan menyanjung-Nya ketika mereka datang kepadanya, mereka akan menyampaikan pujian itu kepada Allah Yang Maha Agung, Yang Maha Perkasa.  Dan Allah SWT berfirman, 'Jika Aku menyebabkan hambaku meninggal dunia, Aku akan memasukkannya ke dalam Syurga. Dan jika Aku menyembuhkannya, Aku akan menggantikan dagingnya dengan daging yang lebih baik dan darahnya dengan darah yang lebih baik, dan Aku akan mengampunkan kesalahan-kesalahannya.' "
  },
  {
    "id": 36021,
    "hadith_number": 1843,
    "tajuk_hadith": "Kadar Kesusahan yang Menghapuskan Dosa Seorang Mukmin",
    "perawi_melayu": "Yahya daripada Malik daripada Yazid bin Khusayfa daripada Urwa bin Zubayr yang mendengar Aisyah, isteri Nabi SAW, berkata",
    "english_text": "Yahya related to me from Malik from Yazid ibn Khusayfa that Urwa\nibn az-Zubayr said that he heard A'isha, the wife of the Prophet, may\nAllah bless him and grant him peace, say, \"The Messenger of Allah, may\nAllah bless him and grant him peace, said, 'When a mumin is afflicted\nby something, even a thorn, it removes (or effaces) his wrong\nactions.' \" Yazid did not know which of them Urwa said.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ خُصَيْفَةَ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّهُ قَالَ سَمِعْتُ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم تَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يُصِيبُ الْمُؤْمِنَ مِنْ مُصِيبَةٍ حَتَّى الشَّوْكَةُ إِلاَّ قُصَّ بِهَا أَوْ كُفِّرَ بِهَا مِنْ خَطَايَاهُ ‏\"‏ ‏.‏ لاَ يَدْرِي يَزِيدُ أَيَّهُمَا قَالَ عُرْوَةُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yazid bin Khusayfa, daripada Urwah bin Zubayr yang berkata: Aku mendengar Aisyah, isteri Nabi SAW, berkata: \"Rasulullah SAW bersabda: 'Tidaklah menimpa seorang Mukmin sebarang musibah, sekalipun duri, melainkan ia mengurangi atau menghapuskan dosa-dosanya.'\" Yazid tidak tahu yang mana satu yang dikatakan oleh Urwah."
  },
  {
    "id": 36022,
    "hadith_number": 1844,
    "tajuk_hadith": "Allah Menimpa Sesiapa Yang Ia Kehendaki Kebaikan",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik that Muhammad ibn Abdullah ibn Abi\nSasaca said that he heard Abu'l-Hubab Said ibn Yasar say that he had\nheard Abu Hurayra say, \"The Messenger of Allah, may Allah bless him\nand grant him peace, said, 'Allah afflicts the one for whom He desires\ngood.'\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي صَعْصَعَةَ، أَنَّهُ قَالَ سَمِعْتُ أَبَا الْحُبَابِ، سَعِيدَ بْنَ يَسَارٍ يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُصِبْ مِنْهُ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik bahawa Muhammad bin Abdullah bin Abi Sa'sa'ah berkata, dia mendengar Abu al-Hubab Said bin Yasar berkata, dia mendengar Abu Hurairah berkata, \"Pesuruh Allah, semoga Allah memberkatinya dan memberinya kesejahteraan, bersabda, 'Allah menimpa sesiapa yang Ia kehendaki kebaikan baginya.'\""
  },
  {
    "id": 36023,
    "hadith_number": 1845,
    "tajuk_hadith": "Kebahagiaan Kematian dan Ujian Penyakit",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said that death\ncame to a man in the time of the Messenger of Allah, may Allah bless\nhim and grant him peace. A man said, \"He was fortunate,\" as he had\ndied without being tried by illness. The Messenger of Allah, may Allah\nbless him and grant him peace, said, \"Alas for you, what will let you\nknow that if Allah had tried him with illness, He would have wiped out\nhis wrong actions.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ رَجُلاً، جَاءَهُ الْمَوْتُ فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَجُلٌ هَنِيئًا لَهُ مَاتَ وَلَمْ يُبْتَلَ بِمَرَضٍ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ وَيْحَكَ وَمَا يُدْرِيكَ لَوْ أَنَّ اللَّهَ ابْتَلاَهُ بِمَرَضٍ يُكَفِّرُ بِهِ مِنْ سَيِّئَاتِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said, bahawa kematian telah datang kepada seorang lelaki pada zaman Rasulullah SAW. Seorang lelaki berkata, \"Baginya nasib baik\", kerana dia meninggal dunia tanpa diuji dengan penyakit. Rasulullah SAW bersabda, \"Celakalah kamu, dan bagaimana engkau tahu? Sekiranya Allah menguji dia dengan penyakit, nescaya penyakit itu akan menghapuskan dosa-dosanya.\""
  },
  {
    "id": 36024,
    "hadith_number": 1846,
    "tajuk_hadith": "Mengubati Sakit dengan Isti'azah dan Sentuhan Tangan Kanan",
    "perawi_melayu": "Yahya dari Malik dari Yazid ibn Khusayfa; Amr ibn Abdullah ibn Kab as-Salami; Nafi ibn Jubayr; Uthman ibn Abi al-As",
    "english_text": "Yahya related to me from Malik from Yazid ibn Khusayfa that Amr\nibn Abdullah ibn Kab as-Salami told him that Nafi ibn Jubayr told him\nthat Uthman ibn Abi al-As came to the Messenger of Allah, may Allah\nbless him and grant him peace. Uthman said that he had a pain which\nwas enough to kill him. The Messenger of Allah, may Allah bless him\nand grant him peace, said, \"Rub it with your right hand seven times\nand say, 'I take refuge with the might of Allah and His power from the\nevil of what I feel.' \"\n\n\nUthman added, \"I said that, and Allah\nremoved what I had. I still command my family and others to say it.\"",
    "arabic_text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ خُصَيْفَةَ، أَنَّ عَمْرَو بْنَ عَبْدِ اللَّهِ بْنِ كَعْبٍ السَّلَمِيَّ، أَخْبَرَهُ أَنَّ نَافِعَ بْنَ جُبَيْرٍ أَخْبَرَهُ عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ، أَنَّهُ أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ عُثْمَانُ وَبِي وَجَعٌ قَدْ كَادَ يُهْلِكُنِي ‏.‏ قَالَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ امْسَحْهُ بِيَمِينِكَ سَبْعَ مَرَّاتٍ وَقُلْ أَعُوذُ بِعِزَّةِ اللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ ‏\"‏ ‏.‏ قَالَ فَقُلْتُ ذَلِكَ فَأَذْهَبَ اللَّهُ مَا كَانَ بِي فَلَمْ أَزَلْ آمُرُ بِهَا أَهْلِي وَغَيْرَهُمْ ‏.‏",
    "malay_translation": "Dikisahkan oleh Yahya dari Malik dari Yazid bin Khusayfa, bahawa Amr bin Abdullah bin Kab al-Salami memberitahunya, dan Nafi bin Jubayr memberitahunya lagi, bahawa Uthman bin Abi al-As telah datang kepada Rasulullah SAW. Uthman berkata, \"Aku ditimpa sakit yang hampir menamatkan nyawaku.\"  Rasulullah SAW bersabda, \"Sapalah (bahagian yang sakit itu) dengan tangan kananmu sebanyak tujuh kali dan ucapkan, 'Aku berlindung dengan keagungan Allah dan kekuatan-Nya dari keburukan yang kurasakan.'\" Uthman berkata lagi, \"Aku telah melakukannya, dan Allah menghilangkan sakitku. Dan aku sentiasa memerintahkan ahli keluarga dan orang lain untuk melakukannya.\" "
  },
  {
    "id": 36025,
    "hadith_number": 1847,
    "tajuk_hadith": "Rawatan Nabi SAW dengan Surah-Surah Mu'awwidzat",
    "perawi_melayu": "Yahya dari Malik dari Ibn Shihab dari Urwa bin Zubayr dari Aisyah",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Urwa ibn az-\nZubayr from A'isha that the Messenger of Allah, may Allah bless him\nand grant him peace, when he had a complaint, would recite the last\nthree suras of Qur'an, over himself and blow. She said, \"When his pain\nwas great, I would recite it over him and wipe him with his right hand\nhoping for its blessing.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا اشْتَكَى يَقْرَأُ عَلَى نَفْسِهِ بِالْمُعَوِّذَاتِ وَيَنْفِثُ ‏.‏ قَالَتْ فَلَمَّا اشْتَدَّ وَجَعُهُ كُنْتُ أَنَا أَقْرَأُ عَلَيْهِ وَأَمْسَحُ عَلَيْهِ بِيَمِينِهِ رَجَاءَ بَرَكَتِهَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Ibn Shihab, dari Urwah bin Zubayr, dari Aisyah RA bahawa Rasulullah SAW apabila merasa tidak sihat, akan membaca tiga surah terakhir al-Quran ke atas dirinya dan meniupnya.  Beliau berkata, \"Apabila sakitnya semakin teruk, aku akan membacanya ke atasnya dan mengusapnya dengan tangan kanannya dengan harapan untuk mendapatkan keberkatannya.\""
  },
  {
    "id": 36026,
    "hadith_number": 1848,
    "tajuk_hadith": "Menggunakan Kitab Allah dalam Rawatan Penyakit",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said, daripada Amrah binti Abd al-Rahman, bahawa Abu Bakar al-Siddiq telah menjenguk Aisyah ketika beliau sedang mengalami penyakit dan seorang wanita Yahudi sedang membaca ruqyah untuknya.  Abu Bakar berkata, \"Lakukan ruqyah dengan Kitab Allah.\"",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said from Amra bint\nAbd ar-Rahman that Abu Bakr as-Siddiq visited A'isha while she had a\n complaint and a jewish woman was making incantation (ruqya)\nfor her. Abu Bakr said, \"Do it (incantation) with the Book of Allah.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ، دَخَلَ عَلَى عَائِشَةَ وَهِيَ تَشْتَكِي وَيَهُودِيَّةٌ تَرْقِيهَا فَقَالَ أَبُو بَكْرٍ ارْقِيهَا بِكِتَابِ اللَّهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said, daripada Amrah binti Abd al-Rahman, bahawa Abu Bakar al-Siddiq telah melawat Aisyah ketika beliau sedang mengalami masalah kesihatan dan seorang wanita Yahudi sedang menjalankan rawatan ruqyah untuknya.  Abu Bakar berkata, \"Lakukan rawatan dengan Kitab Allah.\""
  },
  {
    "id": 36027,
    "hadith_number": 1849,
    "tajuk_hadith": "Perubatan dan Penyembuhan Menurut Rasulullah SAW",
    "perawi_melayu": "Yahya daripada Malik daripada Zayd bin Aslam",
    "english_text": "Yahya related to me from Malik from Zayd ibn Aslam that a man\nreceived a wound in the time of the Messenger of Allah, may Allah\nbless him and grant him peace. The blood clotted in the wound and the\nman called two men from the Banu Ammar tribe. They looked at it and\nclaimed that the Messenger of Allah, may Allah bless him and grant him\npeace, said to them, \"Which of you is the better doctor?\" They said,\n\"Is there any good in medicine, Messenger of Allah?\" Zayd claimed that\nthe Messenger of Allah, may Allah bless him and grant him peace, said,\n\"The one who sent down the disease sent down the remedy.\"",
    "arabic_text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ رَجُلاً، فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم أَصَابَهُ جُرْحٌ فَاحْتَقَنَ الْجُرْحُ الدَّمَ وَأَنَّ الرَّجُلَ دَعَا رَجُلَيْنِ مِنْ بَنِي أَنْمَارٍ فَنَظَرَا إِلَيْهِ فَزَعَمَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لَهُمَا ‏\"‏ أَيُّكُمَا أَطَبُّ ‏\"‏ ‏.‏ فَقَالاَ أَوَ فِي الطِّبِّ خَيْرٌ يَا رَسُولَ اللَّهِ فَزَعَمَ زَيْدٌ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ أَنْزَلَ الدَّوَاءَ الَّذِي أَنْزَلَ الأَدْوَاءَ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Zayd bin Aslam, bahawa seorang lelaki telah mengalami kecederaan pada zaman Rasulullah SAW. Darah membeku di luka tersebut. Lelaki itu memanggil dua orang daripada Bani Ammar. Mereka melihat luka tersebut dan kononnya Rasulullah SAW bertanya kepada mereka, \"Siapakah di antara kamu yang lebih mahir dalam bidang perubatan?\" Mereka menjawab, \"Adakah kebaikan dalam bidang perubatan, wahai Rasulullah?\" Zayd kononnya meriwayatkan bahawa Rasulullah SAW bersabda, \"Sesungguhnya Allah SWT telah menurunkan penawar bagi setiap penyakit yang diturunkan-Nya.\"  "
  },
  {
    "id": 36028,
    "hadith_number": 1850,
    "tajuk_hadith": "Pengobatan Diri dan Kematian Said bin Zurara",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik that Yahya ibn Said said, \"I heard\nthat Sad ibn Zurara cauterized himself because of a pain in the throat\naccompanied by blood and he died.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ بَلَغَنِي أَنَّ سَعْدَ بْنَ زُرَارَةَ، اكْتَوَى فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنَ الذُّبَحَةِ فَمَاتَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said, katanya, \"Aku diberitahu bahawa Said bin Zurara telah mengubati dirinya dengan kauterisasi kerana sakit tekak disertai darah dan dia meninggal dunia.\""
  },
  {
    "id": 36029,
    "hadith_number": 1851,
    "tajuk_hadith": "Rawatan Penyakit dan Penggunaan Azimat",
    "perawi_melayu": null,
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\ncauterized for the palsy and he had a talisman made for a scorpion\nsting.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، اكْتَوَى مِنَ اللَّقْوَةِ وَرُقِيَ مِنَ الْعَقْرَبِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, daripada Nafi', bahawa Abdullah bin Umar dirawat penyakit lumpuh dengan kauterisasi dan dirawat gigitan kala jengking dengan azimat."
  },
  {
    "id": 36030,
    "hadith_number": 1852,
    "tajuk_hadith": "Rawatan Demam dengan Air",
    "perawi_melayu": "Yahya daripada Malik, daripada Hisham bin Urwa, daripada Fatimah binti al-Mundhir",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from Fatima\nbint al-Mundhir that whenever a woman who had a fever, was brought to\nAsma bint Abi Bakr, she made dua for her and took water and poured it\ninside her collar. She said, \"The Messenger of Allah, may Allah bless\nhim and grant him peace, ordered us to cool it with water.\"",
    "arabic_text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ، أَنَّ أَسْمَاءَ بِنْتَ أَبِي بَكْرٍ، كَانَتْ إِذَا أُتِيَتْ بِالْمَرْأَةِ وَقَدْ حُمَّتْ تَدْعُو لَهَا أَخَذَتِ الْمَاءَ فَصَبَّتْهُ بَيْنَهَا وَبَيْنَ جَيْبِهَا وَقَالَتْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَأْمُرُنَا أَنْ نُبْرِدَهَا بِالْمَاءِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Hisham bin Urwa, daripada Fatimah binti al-Mundhir, bahawa Asma binti Abi Bakr, apabila ada seorang wanita yang demam dibawa kepadanya, akan berdoa untuknya, mengambil air dan menuangkannya di antara kerongkong dan baju wanita itu. Dia berkata, \"Sesungguhnya Rasulullah SAW memerintahkan kita untuk menyejukkannya dengan air.\""
  },
  {
    "id": 36031,
    "hadith_number": 1853,
    "tajuk_hadith": "Mengatasi Demam dengan Air",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Fever is from the vehemence of the heat of Jahannam, so\ncool it with water.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ فَابْرُدُوهَا بِالْمَاءِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik, daripada Hisham bin Urwa, daripada bapanya, bahawa Rasulullah SAW bersabda, \"Sesungguhnya demam adalah daripada hawa panas neraka Jahannam, maka sejukkanlah ia dengan air.\" "
  },
  {
    "id": 36032,
    "hadith_number": 1854,
    "tajuk_hadith": "Mengatasi Demam dengan Air",
    "perawi_melayu": "",
    "english_text": "Malik meriwayatkan kepada saya daripada Nafi daripada Ibn Umar bahawa Rasulullah SAW bersabda, \"Demam adalah daripada kepanasan neraka Jahannam, maka padamkannya dengan air.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ فَأَطْفِئُوهَا بِالْمَاءِ ‏\"‏ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Nafi', daripada Ibn Umar bahawa Rasulullah SAW bersabda, \"Demam itu daripada kepanasan api neraka Jahannam. Oleh itu, padamkannya dengan air."
  },
  {
    "id": 36033,
    "hadith_number": 1855,
    "tajuk_hadith": "Kasih Sayang dan Pengampunan dalam Menziarahi Orang Sakit",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik that he had heard from Jabir ibn\nAbdullah that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"When a man visits an invalid, he plunges into mercy\nto the extent that when he sits with him, it settles in him,\" or the\nlike of that.",
    "arabic_text": "حَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا عَادَ الرَّجُلُ الْمَرِيضَ خَاضَ الرَّحْمَةَ حَتَّى إِذَا قَعَدَ عِنْدَهُ قَرَّتْ فِيهِ ‏\"‏ ‏.‏ أَوْ نَحْوَ هَذَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, bahawa Malik mendengar daripada Jabir bin Abdullah bahawa Rasulullah SAW bersabda, \"Apabila seseorang melawat orang yang sakit, dia akan tenggelam dalam belas kasihan sehinggakan apabila dia duduk bersamanya, belas kasihan itu akan menetap di dalam hatinya,\" atau yang serupa dengan itu."
  },
  {
    "id": 36034,
    "hadith_number": 1856,
    "tajuk_hadith": "Penjelasan Tentang Penyakit dan Pencegahannya",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, yang mendengar daripada Bukayr ibn Abdullah ibn al-Ashajj dari Ibn Atiya bahawa Rasulullah SAW bersabda:",
    "english_text": "\"There is no contagion, no\nhama and no serpent in a hungry belly. However, the possessor of sick\nlivestock must not stop at the same place as the possessor of healthy\nlivestock, but the possessor of healthy livestock may stop wherever he\nwishes.\"\n\n\nThey said, \"Messenger of Allah, Why is that?\" The\nMessenger of Allah, may Allah bless him and grant him peace, said, \"It\nis harmful.\"\n\n\n\nNote: The majority of scholars interpret this to mean that these things in and of themselves do not transmit or cause harm through supernatural or hidden means but that Allah is ultimately in control and any fearful superstition around these is false.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، عَنِ ابْنِ عَطِيَّةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ عَدْوَى وَلاَ هَامَ وَلاَ صَفَرَ وَلاَ يَحُلَّ الْمُمْرِضُ عَلَى الْمُصِحِّ وَلْيَحْلُلِ الْمُصِحُّ حَيْثُ شَاءَ ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ وَمَا ذَاكَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّهُ أَذًى ‏\"‏ ‏.‏",
    "malay_translation": "Tidak ada wabak, hama, dan ular dalam perut yang kosong.  Akan tetapi, pemilik ternakan yang sakit tidak sepatutnya berhenti di tempat yang sama dengan pemilik ternakan yang sihat.  Sebaliknya, pemilik ternakan yang sihat boleh berhenti di mana sahaja yang diinginkannya.\n\nPara sahabat bertanya, \"Wahai Rasulullah, mengapa demikian?\" Rasulullah SAW menjawab, \"Kerana ia (perbuatan itu) membawa mudarat.\"\n\nCatatan: Kebanyakan ulama berpendapat bahawa perkara-perkara tersebut pada asasnya tidak menular atau menyebabkan mudarat melalui cara ghaib, tetapi Allah SWT yang menguasai segala-galanya dan sebarang kepercayaan khurafat yang menakutkan adalah tidak benar."
  }
]