[
  {
    "id": 34506,
    "hadith_number": 328,
    "tajuk_hadith": "Rasulullah SAW Menjamak Solat Zohor dan Asar di Tabuk",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "Yahya related to me from Malik from Da'ud ibn al-Husayn from al-\\nAraj from Abu Hurayra that the Messenger of Allah, may Allah bless him\\nand grant him peace, joined dhuhr and asr on his journey to Tabuk.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَجْمَعُ بَيْنَ الظُّهْرِ وَالْعَصْرِ فِي سَفَرِهِ إِلَى تَبُوكَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik, daripada Da'ud ibn al-Husayn, daripada al-A'raj, daripada Abu Hurairah bahawa Rasulullah SAW telah menjamakkan solat Zohor dan Asar dalam perjalanannya ke Tabuk."
  },
  {
    "id": 34507,
    "hadith_number": 329,
    "tajuk_hadith": "Nabi SAW Menggabungkan Solat dan Berkata Mengenai Mata Air Tabuk",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ، عَنْ أَبِي الطُّفَيْلِ، عَامِرِ بْنِ وَاثِلَةَ أَنَّ مُعَاذَ بْنَ جَبَلٍ، أَخْبَرَهُ أَنَّهُمْ، خَرَجُوا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ تَبُوكَ فَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَجْمَعُ بَيْنَ الظُّهْرِ وَالْعَصْرِ وَالْمَغْرِبِ وَالْعِشَاءِ - قَالَ - فَأَخَّرَ الصَّلاَةَ يَوْمًا ثُمَّ خَرَجَ فَصَلَّى الظُّهْرَ وَالْعَصْرَ جَمِيعًا ثُمَّ دَخَلَ ثُمَّ خَرَجَ فَصَلَّى الْمَغْرِبَ وَالْعِشَاءَ جَمِيعًا ثُمَّ قَالَ ‏\"‏ إِنَّكُمْ سَتَأْتُونَ غَدًا إِنْ شَاءَ اللَّهُ عَيْنَ تَبُوكَ وَإِنَّكُمْ لَنْ تَأْتُوهَا حَتَّى يَضْحَى النَّهَارُ فَمَنْ جَاءَهَا فَلاَ يَمَسَّ مِنْ مَائِهَا شَيْئًا حَتَّى آتِيَ ‏\"‏ ‏.‏ فَجِئْنَاهَا وَقَدْ سَبَقَنَا إِلَيْهَا رَجُلاَنِ وَالْعَيْنُ تَبِضُّ بِشَىْءٍ مِنْ مَاءٍ فَسَأَلَهُمَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلْ مَسِسْتُمَا مِنْ مَائِهَا شَيْئًا ‏\"‏ ‏.‏ فَقَالاَ نَعَمْ ‏.‏ فَسَبَّهُمَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ لَهُمَا مَا شَاءَ اللَّهُ أَنْ يَقُولَ ثُمَّ غَرَفُوا بِأَيْدِيهِمْ مِنَ الْعَيْنِ قَلِيلاً قَلِيلاً حَتَّى اجْتَمَعَ فِي شَىْءٍ ثُمَّ غَسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِيهِ وَجْهَهُ وَيَدَيْهِ ثُمَّ أَعَادَهُ فِيهَا فَجَرَتِ الْعَيْنُ بِمَاءٍ كَثِيرٍ فَاسْتَقَى النَّاسُ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يُوشِكُ يَا مُعَاذُ إِنْ طَالَتْ بِكَ حَيَاةٌ أَنْ تَرَى هَا هُنَا قَدْ مُلِئَ جِنَانًا ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abu'z-Zubayr al-Makki, daripada Abu't-Tufayl Amir ibn Wathila bahawa Muadh ibn Jabal memberitahunya bahawa mereka keluar bersama Rasulullah SAW pada tahun Tabuk, dan Rasulullah SAW menggabungkan solat Zohor dengan Asar, dan Maghrib dengan Isyak. Muadh berkata, \"Suatu hari baginda melewatkan solat, kemudian keluar dan menunaikan solat Zohor dan Asar bersama-sama. Kemudian baginda bersabda, 'Esok kamu akan datang, insya-Allah, ke mata air Tabuk. Tetapi kamu tidak akan sampai ke sana sehingga tengah pagi. Sesiapa yang sampai jangan menyentuh airnya sehingga aku datang.' Kami tiba di sana dan dua orang lelaki telah sampai lebih awal daripada kami dan mata air itu menitis dengan sedikit air. Rasulullah SAW bertanya kepada mereka, 'Adakah kamu telah menyentuh airnya?' Mereka menjawab, 'Ya.' Rasulullah SAW memarahi mereka dan berkata apa yang Allah kehendaki baginda katakan. Kemudian mereka mengambil air dengan tangan mereka daripada mata air sedikit demi sedikit sehingga terkumpul di sesuatu. Kemudian Rasulullah SAW membasuh muka dan tangan baginda di dalamnya. Kemudian baginda memasukkannya semula ke dalam mata air dan mata air itu mengalir dengan limpah ruah air dan orang ramai mengambil air daripadanya. Rasulullah SAW bersabda, 'Jika kamu berumur panjang, wahai Muadh, kamu akan segera melihat tempat ini dipenuhi dengan taman.'\""
  },
  {
    "id": 34508,
    "hadith_number": 330,
    "tajuk_hadith": "Menghimpunkan Solat Maghrib dan Isyak Ketika Musafir",
    "perawi_melayu": "Abdullah ibn Umar",
    "english_text": "3 Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid, \"The Messenger of Allah, may Allah bless him and grant him\npeace, used to join maghrib and isha together when it was urgent to\ntravel.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا عَجِلَ بِهِ السَّيْرُ يَجْمَعُ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik daripada Nafi bahawa Abdullah ibn Umar berkata, \"Rasulullah SAW apabila tergesa-gesa dalam perjalanan, baginda menghimpunkan solat Maghrib dan Isyak.\""
  },
  {
    "id": 34509,
    "hadith_number": 331,
    "tajuk_hadith": "Rasulullah SAW Solat Zohor & Asar, Maghrib & Isyak Secara Bersama",
    "perawi_melayu": "Abdullah ibn Abbas",
    "english_text": "Yahya related to me from Malik from Abu'z Zubayr al-Makki from Said ibn Jubayr that Abdullah ibn Abbas said, \"The Messenger of Allah, may Allah bless him and grant him peace, prayed dhuhr and asr together and maghrib and isha together, and not out of fear nor because of travelling.\"",
    "arabic_text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّهُ قَالَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم الظُّهْرَ وَالْعَصْرَ جَمِيعًا وَالْمَغْرِبَ وَالْعِشَاءَ جَمِيعًا فِي غَيْرِ خَوْفٍ وَلاَ سَفَرٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abu'z Zubayr al-Makki, daripada Sa'id ibn Jubayr bahawa Abdullah ibn Abbas berkata, \"Rasulullah SAW, semoga Allah melimpahkan rahmat dan kesejahteraan ke atasnya, menunaikan solat Zohor dan Asar secara bersama-sama, serta Maghrib dan Isyak secara bersama-sama, bukan kerana ketakutan atau musafir.\""
  },
  {
    "id": 34510,
    "hadith_number": 332,
    "tajuk_hadith": "Kepercayaan Malik tentang Waktu Hadis",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Malik berkata, \"Saya percaya perkara itu berlaku semasa hujan.\""
  },
  {
    "id": 34511,
    "hadith_number": 333,
    "tajuk_hadith": "Abdullah ibn Umar Menggabungkan Solat Maghrib dan Isyak Ketika Hujan",
    "perawi_melayu": "Malik daripada Nafi'",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to join the prayer along with the amirs if they joined maghrib\nand isha in the rain.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا جَمَعَ الأُمَرَاءُ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ فِي الْمَطَرِ جَمَعَ مَعَهُمْ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Nafi', bahawa Abdullah ibn Umar pernah menggabungkan solat bersama para amir, jika mereka menggabungkan solat Maghrib dan Isyak ketika hujan."
  },
  {
    "id": 34512,
    "hadith_number": 334,
    "tajuk_hadith": "Menjamak Solat Zohor dan Asar Semasa Musafir",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Ibn Shihab that he had asked\nSalim ibn Abdullah, \"Can you join dhuhr and asr when travelling?\" He\nsaid, \"Yes, there is no harm in that. Haven't you seen the people pray\non Arafa?\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ سَأَلَ سَالِمَ بْنَ عَبْدِ اللَّهِ هَلْ يُجْمَعُ بَيْنَ الظُّهْرِ وَالْعَصْرِ فِي السَّفَرِ فَقَالَ نَعَمْ لاَ بَأْسَ بِذَلِكَ أَلَمْ تَرَ إِلَى صَلاَةِ النَّاسِ بِعَرَفَةَ",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Ibn Shihab bahawa beliau bertanya kepada Salim bin Abdullah, \"Bolehkah anda menjamak solat Zohor dan Asar semasa bermusafir?\" Beliau menjawab, \"Ya, tidak mengapa dalam hal itu. Tidakkah anda melihat orang ramai solat di Arafah?\""
  },
  {
    "id": 34513,
    "hadith_number": 335,
    "tajuk_hadith": "Rasulullah SAW Menggabungkan Solat Ketika Musafir",
    "perawi_melayu": "Ali ibn Husain (dinyatakan)",
    "english_text": "Yahya related to me from Malik that he had heard that AIi ibn\nHusain used to say, \"The Messenger of Allah, may Allah bless him and\ngrant him peace, would join dhuhr and asr if he wished to travel the\nsame day, and he would join maghrib and isha if he wished to travel\nthe same night.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ عَلِيِّ بْنِ حُسَيْنٍ، أَنَّهُ كَانَ يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَرَادَ أَنْ يَسِيرَ يَوْمَهُ جَمَعَ بَيْنَ الظُّهْرِ وَالْعَصْرِ وَإِذَا أَرَادَ أَنْ يَسِيرَ لَيْلَهُ جَمَعَ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik bahawa dia mendengar Ali ibn Husain berkata, \"Rasulullah SAW akan menggabungkan solat Zohor dan Asar jika Baginda ingin bermusafir pada hari yang sama, dan Baginda akan menggabungkan solat Maghrib dan Isyak jika Baginda ingin bermusafir pada malam yang sama.\""
  },
  {
    "id": 34514,
    "hadith_number": 336,
    "tajuk_hadith": "Ibn Umar Mengenai Solat Musafir",
    "perawi_melayu": "Seorang lelaki dari keluarga Khalid bin Asid",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from a man of the\nfamily of Khalid ibn Asid that he said to Abdullah ibn Umar, \"Abu Abd\nar-Rahman, we find the fear prayer and the prayer when settled\nmentioned in the Qur'an, but we do not find any mention of the\ntravelling prayer in it.\" Ibn Umar said, \"Son of my brother!  Allah\nthe Mighty and Majestic sent us Muhammad, may Allah bless him and\ngrant him peace, and we know nothing. We only do as we saw him doing.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ رَجُلٍ، مِنْ آلِ خَالِدِ بْنِ أَسِيدٍ أَنَّهُ سَأَلَ عَبْدَ اللَّهِ بْنَ عُمَرَ فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنَّا نَجِدُ صَلاَةَ الْخَوْفِ وَصَلاَةَ الْحَضَرِ فِي الْقُرْآنِ وَلاَ نَجِدُ صَلاَةَ السَّفَرِ فَقَالَ ابْنُ عُمَرَ يَا ابْنَ أَخِي إِنَّ اللَّهَ عَزَّ وَجَلَّ بَعَثَ إِلَيْنَا مُحَمَّدًا صلى الله عليه وسلم وَلاَ نَعْلَمُ شَيْئًا فَإِنَّمَا نَفْعَلُ كَمَا رَأَيْنَاهُ يَفْعَلُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada seorang lelaki daripada keluarga Khalid bin Asid bahawa dia berkata kepada Abdullah bin Umar, \"Wahai Abu Abd ar-Rahman, kami dapati solat dalam ketakutan (solat al-khauf) dan solat ketika bermukim disebut dalam al-Quran, tetapi kami tidak menjumpai sebarang penyebutan mengenai solat musafir di dalamnya.\" Ibn Umar berkata, \"Wahai anak saudaraku! Sesungguhnya Allah Yang Maha Perkasa dan Maha Agung telah mengutus kepada kita Muhammad ﷺ, dan kami tidak mengetahui apa-apa. Kami hanya melakukan sebagaimana yang kami lihat dia lakukan.\""
  },
  {
    "id": 34515,
    "hadith_number": 337,
    "tajuk_hadith": "Solat Pada Awalnya Dua Rakaat, Kemudian Ditambah",
    "perawi_melayu": "Aisyah, isteri Nabi ﷺ",
    "english_text": "Yahya related to me from Malik from Salih ibn Kaysan from Urwa\nibn az-Zubayr that A'isha, the wife of the Prophet, may Allah bless\nhim and grant him peace, said, \"The prayer was prescribed as two\nrakas, both when settled and when travelling. Then the travelling\nprayer was kept as it was, and an increase was made in the prayer when\nsettled. \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ فُرِضَتِ الصَّلاَةُ رَكْعَتَيْنِ رَكْعَتَيْنِ فِي الْحَضَرِ وَالسَّفَرِ فَأُقِرَّتْ صَلاَةُ السَّفَرِ وَزِيدَ فِي صَلاَةِ الْحَضَرِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik, daripada Salih ibn Kaysan, daripada Urwa ibn az-Zubayr bahawa Aisyah, isteri Nabi ﷺ, berkata, \"Solat pada mulanya difardukan dua rakaat, sama ada ketika bermukim atau dalam perjalanan. Kemudian solat ketika bermusafir tetap seperti asalnya, dan ditambah dalam solat ketika bermukim.\""
  },
  {
    "id": 34516,
    "hadith_number": 338,
    "tajuk_hadith": "Kelewatan Solat Maghrib Semasa Musafir",
    "perawi_melayu": "Yahya ibn Said (daripada Malik)",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said that he said\nto Salim ibn Abdullah, \"What is the latest you have seen your father\ndelay maghrib while on a journey?\" and Salim replied, \"One time the\nsun set when we were at Dhat al-Jaysh and he prayed maghrib at al-\nAqiq.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ لِسَالِمِ بْنِ عَبْدِ اللَّهِ مَا أَشَدَّ مَا رَأَيْتَ أَبَاكَ أَخَّرَ الْمَغْرِبَ فِي السَّفَرِ فَقَالَ سَالِمٌ غَرَبَتِ الشَّمْسُ وَنَحْنُ بِذَاتِ الْجَيْشِ فَصَلَّى الْمَغْرِبَ بِالْعَقِيقِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Yahya ibn Said, bahawa dia berkata kepada Salim ibn Abdullah, \"Bilakah kali terakhir kamu melihat ayahmu melewatkan solat Maghrib semasa bermusafir?\" Salim menjawab, \"Suatu ketika matahari terbenam ketika kami berada di Dhat al-Jaysh, lalu dia solat Maghrib di al-Aqiq."
  },
  {
    "id": 34517,
    "hadith_number": 339,
    "tajuk_hadith": "Abdullah ibn Umar Memendekkan Solat di Dhu'l Hulayfa",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Nafi bahawa Abdullah ibn Umar",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar,\nshortened the prayer when he left for hajj or umra at Dhu'l Hulayfa.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا خَرَجَ حَاجًّا أَوْ مُعْتَمِرًا قَصَرَ الصَّلاَةَ بِذِي الْحُلَيْفَةِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Nafi bahawa Abdullah ibn Umar, memendekkan solatnya apabila beliau keluar untuk haji atau umrah di Dhu'l Hulayfa."
  },
  {
    "id": 34518,
    "hadith_number": 340,
    "tajuk_hadith": "Solat Qasar Semasa Musafir ke Rim",
    "perawi_melayu": "Salim bin Abdullah",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Salim ibn\nAbdullah that his father rode to Rim and shortened the prayer on the\njourney.\n\n\nMalik said, \"That was about four mail-stages.\"\n(approximately forty-eight miles).",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، أَنَّهُ رَكِبَ إِلَى رِيمٍ فَقَصَرَ الصَّلاَةَ فِي مَسِيرِهِ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ نَحْوٌ مِنْ أَرْبَعَةِ بُرُدٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik, daripada Ibn Shihab, daripada Salim bin Abdullah bahawa bapanya menunggang ke Rim dan meringkaskan solat dalam perjalanan tersebut.\n\nMalik berkata, \"Itu adalah kira-kira empat peringkat perjalanan.\" (kira-kira empat puluh lapan batu)."
  },
  {
    "id": 34519,
    "hadith_number": 341,
    "tajuk_hadith": "Abdullah ibn Umar Memendekkan Solat dalam Perjalanan",
    "perawi_melayu": "Malik, daripada Nafi', daripada Salim ibn Abdullah",
    "english_text": "Yahya related to me from Malik from Nafi from Salim ibn Abdullah\nthat Abdullah ibn Umar rode to Dhat an-Nusub and shortened the prayer\non the journey.\n\n\nMalik said, \"There are four mail-stages\nbetween Dhat an-Nusub and Madina.\"",
    "arabic_text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، رَكِبَ إِلَى ذَاتِ النُّصُبِ فَقَصَرَ الصَّلاَةَ فِي مَسِيرِهِ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَبَيْنَ ذَاتِ النُّصُبِ وَالْمَدِينَةِ أَرْبَعَةُ بُرُدٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Nafi', daripada Salim ibn Abdullah bahawa Abdullah ibn Umar menunggang ke Dhat an-Nusub dan memendekkan solat dalam perjalanan tersebut.\n\nMalik berkata, \"Terdapat empat peringkat perjalanan (burud) antara Dhat an-Nusub dan Madinah.\""
  },
  {
    "id": 34520,
    "hadith_number": 342,
    "tajuk_hadith": "Ibn Umar Memendekkan Solat dalam Perjalanan ke Khaybar",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Nafi from Ibn Umar that he\nused to travel to Khaybar and he would shorten the prayer.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ كَانَ يُسَافِرُ إِلَى خَيْبَرَ فَيَقْصُرُ الصَّلاَةَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Nafi', daripada Ibn Umar bahawa dia pernah bermusafir ke Khaybar dan dia memendekkan solat."
  },
  {
    "id": 34521,
    "hadith_number": 343,
    "tajuk_hadith": "Abdullah ibn Umar Memendekkan Solat dalam Musafir",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Salim ibn\nAbdullah that Abdullah ibn Umar used to shorten the prayer when he\ntravelled for a whole day.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقْصُرُ الصَّلاَةَ فِي مَسِيرِهِ الْيَوْمَ التَّامَّ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik daripada Ibn Shihab daripada Salim bin Abdullah bahawa Abdullah bin Umar memendekkan solat ketika bermusafir sepanjang hari."
  },
  {
    "id": 34522,
    "hadith_number": 344,
    "tajuk_hadith": "Ibn Umar Tidak Memendekkan Solat dalam Perjalanan Jauh",
    "perawi_melayu": "Malik meriwayatkan daripada Nafi'",
    "english_text": "Yahya related to me from Malik from Nafi that he used to travel\none mail-stage with Ibn Umar, and he would not shorten the prayer.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّهُ كَانَ يُسَافِرُ مَعَ ابْنِ عُمَرَ الْبَرِيدَ فَلاَ يَقْصُرُ الصَّلاَةَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Nafi', bahawa dia pernah bermusafir bersama Ibn Umar sejauh satu peringkat pos, dan beliau tidak memendekkan solat."
  },
  {
    "id": 34523,
    "hadith_number": 345,
    "tajuk_hadith": "Memendekkan Solat Semasa Musafir Jauh",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik that he had heard that Abdullah\nibn Abbas used to shorten the prayer when he travelled a distance\nequivalent to that between Makka and Ta'if, and that between Makka and\nUsfan and that between Makka and Jedda.\n\n\nMalik said, \"That is\nfour mail-stages, and to me that is the most preferable distance for\nshortening the prayer.\"\n\n\nMalik said, \"Someone who intends to\ntravel does not shorten the prayer until he has left the houses of the\nvillage. And he does not do it in full until he comes to the first\nhouses of the village, or is nearby.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، كَانَ يَقْصُرُ الصَّلاَةَ فِي مِثْلِ مَا بَيْنَ مَكَّةَ وَالطَّائِفِ وَفِي مِثْلِ مَا بَيْنَ مَكَّةَ وَعُسْفَانَ وَفِي مِثْلِ مَا بَيْنَ مَكَّةَ وَجُدَّةَ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ أَرْبَعَةُ بُرُدٍ وَذَلِكَ أَحَبُّ مَا تُقْصَرُ إِلَىَّ فِيهِ الصَّلاَةُ ‏.‏ قَالَ مَالِكٌ لاَ يَقْصُرُ الَّذِي يُرِيدُ السَّفَرَ الصَّلاَةَ حَتَّى يَخْرُجَ مِنْ بُيُوتِ الْقَرْيَةِ وَلاَ يُتِمُّ حَتَّى يَدْخُلَ أَوَّلَ بُيُوتِ الْقَرْيَةِ أَوْ يُقَارِبُ ذَلِكَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa dia mendengar bahawa Abdullah ibn Abbas memendekkan solat ketika bermusafir sejauh jarak antara Makkah dan Ta'if, dan jarak antara Makkah dan Usfan, serta jarak antara Makkah dan Jeddah.\n\nMalik berkata, \"Jarak tersebut adalah empat peringkat perjalanan, dan bagi saya, itulah jarak yang paling digalakkan untuk memendekkan solat.\"\n\nMalik berkata, \"Seseorang yang ingin bermusafir tidak memendekkan solat sehingga dia meninggalkan rumah-rumah kampung. Dan dia tidak menyempurnakannya sehingga dia sampai ke rumah-rumah pertama kampung, atau berhampiran dengannya.\""
  },
  {
    "id": 34524,
    "hadith_number": 346,
    "tajuk_hadith": "Solat Musafir: Tempoh Ketidakpastian",
    "perawi_melayu": "Malik dari Ibn Shihab dari Salim ibn Abdullah daripada Abdullah ibn Umar",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Salim ibn\nAbdullah that Abdullah ibn Umar used to say, \"I pray the prayerof a\ntraveller as long as I am undecided whether to remain somewhere or\nnot, even if I am detained for twelve nights.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ أُصَلِّي صَلاَةَ الْمُسَافِرِ مَا لَمْ أُجْمِعْ مُكْثًا وَإِنْ حَبَسَنِي ذَلِكَ اثْنَتَىْ عَشْرَةَ لَيْلَةً ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik daripada Ibn Shihab daripada Salim bin Abdullah bahawa Abdullah bin Umar pernah berkata, \"Aku solat solat musafir selagi aku belum berazam untuk menetap di sesuatu tempat, walaupun aku tertahan di situ selama dua belas malam.\""
  },
  {
    "id": 34525,
    "hadith_number": 347,
    "tajuk_hadith": "Solat Pendek Ketika Bermukim di Mekah",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Nafi that Ibn Umar stayed in\nMakka for ten nights, shortening the prayer, except when he prayed it\nbehind an imam, in which case he followed the imam's prayer.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، أَقَامَ بِمَكَّةَ عَشْرَ لَيَالٍ يَقْصُرُ الصَّلاَةَ إِلاَّ أَنْ يُصَلِّيَهَا مَعَ الإِمَامِ فَيُصَلِّيهَا بِصَلاَتِهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Nafi' bahawa Ibn Umar bermukim di Mekah selama sepuluh malam, memendekkan solat melainkan apabila dia menunaikannya di belakang imam, dalam hal ini dia mengikut solat imam."
  },
  {
    "id": 34526,
    "hadith_number": 348,
    "tajuk_hadith": "Solat Musafir yang Menetap Lebih Empat Malam dan Solat Tahanan",
    "perawi_melayu": "Ata al-Khurasani",
    "english_text": "Yahya related to me from Malik from Ata al-Khurasani that he\nheard Said ibn al Musayyab say, \"A traveller who has decided to remain\nsomewhere for four nights does the prayer in full.\"\n\n\nMalik\nsaid, \"That is what I prefer most out of what I have heard.\"\n\n\nMalik when asked about the prayer of a prisoner, said, \"It is the same\nas the prayer of a person who remains in one place, except if he is\ntravelling.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَطَاءٍ الْخُرَاسَانِيِّ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، قَالَ مَنْ أَجْمَعَ إِقَامَةً أَرْبَعَ لَيَالٍ وَهُوَ مُسَافِرٌ أَتَمَّ الصَّلاَةَ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ أَحَبُّ مَا سَمِعْتُ إِلَىَّ ‏.‏ وَسُئِلَ مَالِكٌ عَنْ صَلاَةِ الأَسِيرِ فَقَالَ مِثْلُ صَلاَةِ الْمُقِيمِ إِلاَّ أَنْ يَكُونَ مُسَافِرًا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Ata al-Khurasani bahawa beliau mendengar Said ibn al-Musayyab berkata, \"Seorang musafir yang bercadang untuk menetap di sesuatu tempat selama empat malam, maka dia menyempurnakan solatnya.\"\n\nMalik berkata, \"Itulah yang paling saya sukai daripada apa yang saya dengar.\"\n\nMalik ketika ditanya tentang solat seorang tahanan, berkata, \"Ia sama seperti solat orang yang menetap di suatu tempat, kecuali jika dia sedang bermusafir.\""
  },
  {
    "id": 34527,
    "hadith_number": 349,
    "tajuk_hadith": "Umar RA Mengerjakan Solat Qasar Semasa Bermusafir di Makkah",
    "perawi_melayu": "Yahya, dari Malik, dari Ibn Shihab, dari Salim bin Abdullah, dari bapanya",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Salim ibn Abdullah from his father that Umar ibn al-Khattab, when he went to Makka, used to lead them in prayer and do two rakas and then say, \"People of Makka,complete the prayer, we are a group travelling.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَانَ إِذَا قَدِمَ مَكَّةَ صَلَّى بِهِمْ رَكْعَتَيْنِ ثُمَّ يَقُولُ يَا أَهْلَ مَكَّةَ أَتِمُّوا صَلاَتَكُمْ فَإِنَّا قَوْمٌ سَفْرٌ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Salim bin Abdullah, daripada bapanya, bahawa Umar ibn al-Khattab, apabila beliau sampai ke Makkah, pernah mengimami mereka solat dengan dua rakaat, kemudian berkata, \"Wahai penduduk Makkah, sempurnakanlah solat kamu, kerana kami adalah golongan yang bermusafir.\""
  },
  {
    "id": 34528,
    "hadith_number": 350,
    "tajuk_hadith": "Riwayat daripada Umar bin al-Khattab",
    "perawi_melayu": "Zayd ibn Aslam daripada ayahnya daripada Umar ibn al-Khattab.",
    "english_text": "Yahya related the same as that to me from Malik from Zayd ibn Aslam from his father from Umar ibn al-Khattab.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، مِثْلَ ذَلِكَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan perkara yang sama kepada saya daripada Malik, daripada Zayd ibn Aslam, daripada ayahnya, daripada Umar ibn al-Khattab."
  },
  {
    "id": 34529,
    "hadith_number": 351,
    "tajuk_hadith": "Solat Abdullah ibn Umar di Mina",
    "perawi_melayu": "Malik meriwayatkan daripada Nafi' daripada Abdullah ibn Umar",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يُصَلِّي وَرَاءَ الإِمَامِ بِمِنًى أَرْبَعًا فَإِذَا صَلَّى لِنَفْسِهِ صَلَّى رَكْعَتَيْنِ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Nafi' bahawa Abdullah ibn Umar pernah solat empat rakaat di belakang imam di Mina, dan apabila beliau solat bersendirian, beliau solat dua rakaat."
  },
  {
    "id": 34530,
    "hadith_number": 352,
    "tajuk_hadith": "Abdullah bin Umar Melawat Abdullah bin Safwan",
    "perawi_melayu": "Malik daripada Ibn Shihab",
    "english_text": "Yahya related to me from Malik from Ibn Shihab that Safwan said,\n\"Abdullah ibn Umar used to come and visit Abdullah ibn Safwan and he\nwould pray two rakas with us, and when he went away we would stand and\ncomplete the prayer.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ صَفْوَانَ، أَنَّهُ قَالَ جَاءَ عَبْدُ اللَّهِ بْنُ عُمَرَ يَعُودُ عَبْدَ اللَّهِ بْنَ صَفْوَانَ فَصَلَّى لَنَا رَكْعَتَيْنِ ثُمَّ انْصَرَفَ فَقُمْنَا فَأَتْمَمْنَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Ibn Shihab bahawa Safwan berkata, \"Abdullah bin Umar selalu datang melawat Abdullah bin Safwan dan beliau akan solat dua rakaat bersama kami, dan apabila beliau pergi kami akan berdiri dan menyempurnakan solat.\""
  },
  {
    "id": 34531,
    "hadith_number": 353,
    "tajuk_hadith": "Abdullah bin Umar Tidak Melakukan Solat Sunat Bersama Solat Fardhu Semasa Musafir",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Nafi' bahawa Abdullah bin Umar",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nnever used to pray anything with the fard prayer, either before it or\nafter it, while travelling, except in the depths of the night. He\nwould pray on the ground or on his mount, whichever way it was facing.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ لَمْ يَكُنْ يُصَلِّي مَعَ صَلاَةِ الْفَرِيضَةِ فِي السَّفَرِ شَيْئًا قَبْلَهَا وَلاَ بَعْدَهَا إِلاَّ مِنْ جَوْفِ اللَّيْلِ فَإِنَّهُ كَانَ يُصَلِّي عَلَى الأَرْضِ وَعَلَى رَاحِلَتِهِ حَيْثُ تَوَجَّهَتْ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Nafi' bahawa Abdullah bin Umar tidak pernah mengerjakan solat sunat bersama dengan solat fardhu, sama ada sebelum atau selepasnya, ketika dalam perjalanan (musafir), kecuali pada tengah malam. Baginda akan solat di atas tanah atau di atas kenderaannya, menghadap ke mana sahaja kenderaan itu menghadap."
  },
  {
    "id": 34532,
    "hadith_number": 354,
    "tajuk_hadith": "Solat Sunat Ketika Musafir",
    "perawi_melayu": "Yahya meriwayatkan kepada saya daripada Malik bahawa beliau mendengar al-Qasim ibn Muhammad, Urwa ibn az-Zubayr dan Abu Bakr ibn Abd ar-Rahman biasa mengerjakan solat-solat sunat ketika bermusafir.",
    "english_text": "Yahya related to me from Malik that he had heard that al-Qasim\nibn Muhammad and Urwa ibn az-Zubayr and Abu Bakr ibn Abd ar Rahman\nused to pray nawafil when travelling.\n\n\nYahya said that Malik\nwas asked about voluntary prayers when travelling and he said, \"There\nis no harm in them, either at night or during the day. I have heard\nthat some of the people of knowledge used to do that.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، وَعُرْوَةَ بْنَ الزُّبَيْرِ، وَأَبَا، بَكْرِ بْنَ عَبْدِ الرَّحْمَنِ كَانُوا يَتَنَفَّلُونَ فِي السَّفَرِ ‏.‏ قَالَ يَحْيَى وَسُئِلَ مَالِكٌ عَنِ النَّافِلَةِ فِي السَّفَرِ فَقَالَ لاَ بَأْسَ بِذَلِكَ بِاللَّيْلِ وَالنَّهَارِ وَقَدْ بَلَغَنِي أَنَّ بَعْضَ أَهْلِ الْعِلْمِ كَانَ يَفْعَلُ ذَلِكَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik bahawa beliau mendengar al-Qasim ibn Muhammad, Urwa ibn az-Zubayr dan Abu Bakr ibn Abd ar-Rahman biasa mengerjakan solat-solat *nawafil* (sunat) ketika bermusafir.\n\nYahya berkata bahawa Malik ditanya tentang solat sunat ketika bermusafir, lalu beliau berkata, \"Tidak mengapa melakukannya, sama ada pada waktu malam atau siang hari. Saya telah mendengar bahawa sebahagian daripada ahli ilmu melakukannya.\""
  },
  {
    "id": 34533,
    "hadith_number": 355,
    "tajuk_hadith": "Solat Sunat dalam Perjalanan: Pandangan Abdullah bin Umar",
    "perawi_melayu": "Yahya meriwayatkan kepadaku bahawa Malik berkata, \"Aku mendengar daripada Nafi' bahawa Abdullah bin Umar melihat anaknya, Ubaydullah bin Abdullah, melakukan solat sunat dalam perjalanan, dan beliau tidak menegahnya.\"",
    "english_text": "Yahya related to me that Malik said, \"I have heard from Nafi that\nAbdullah ibn Umar used to see his son, Ubaydullah ibn Abdullah, doing\nvoluntary prayers on a journey,and he would not disapprove of it.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، قَالَ بَلَغَنِي عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَرَى ابْنَهُ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ يَتَنَفَّلُ فِي السَّفَرِ فَلاَ يُنْكِرُ عَلَيْهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku bahawa Malik berkata, \"Aku mendengar daripada Nafi' bahawa Abdullah bin Umar melihat anaknya, Ubaydullah bin Abdullah, melakukan solat sunat dalam perjalanan, dan beliau tidak menegahnya.\""
  },
  {
    "id": 34534,
    "hadith_number": 356,
    "tajuk_hadith": "Rasulullah SAW Solat di Atas Keldai Menghadap ke Khaibar",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada 'Amr ibn Yahya al-Mazini, daripada Abu'l-Hubab Said ibn Yasar bahawa Abdullah ibn Umar berkata,",
    "english_text": "Yahya related to me from Malik from Amr ibn Yahya al-Mazini from\nAbu'l-Hubab Said ibn Yasar that Abdullah ibn Umar said, \"I saw the\nMessenger of Allah, may Allah bless him and grant him peace, praying\non a donkey while heading towards Khaybar.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ، عَنْ أَبِي الْحُبَابِ، سَعِيدِ بْنِ يَسَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُصَلِّي وَهُوَ عَلَى حِمَارٍ وَهُوَ مُتَوَجِّهٌ إِلَى خَيْبَرَ ‏.‏",
    "malay_translation": "\"Aku melihat Rasulullah SAW solat di atas seekor keldai sambil menghadap ke Khaibar.\""
  },
  {
    "id": 34535,
    "hadith_number": 357,
    "tajuk_hadith": "Solat Sunat di Atas Kenderaan Semasa Musafir",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Abdullah ibn Dinar daripada Abdullah ibn Umar.",
    "english_text": "Yahya related to me from Malik from Abdullah ibn Dinar from\nAbdullah ibn Umar that the Messenger of Allah, may Allah bless him and\ngrant him peace, used to pray on his mount while travelling, whichever\nway it was facing. Abdullah ibn Dinar said, \"Abdullah ibn Umar would\nalso do that.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي عَلَى رَاحِلَتِهِ فِي السَّفَرِ حَيْثُ تَوَجَّهَتْ بِهِ ‏.‏ قَالَ عَبْدُ اللَّهِ بْنُ دِينَارٍ وَكَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ يَفْعَلُ ذَلِكَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Abdullah bin Dinar, daripada Abdullah bin Umar, bahawa Rasulullah SAW pernah solat di atas kenderaannya semasa dalam perjalanan, menghadap ke mana sahaja kenderaan itu menghadap. Abdullah bin Dinar berkata, \"Abdullah bin Umar juga melakukan demikian.\""
  },
  {
    "id": 34536,
    "hadith_number": 358,
    "tajuk_hadith": "Anas bin Malik Solat Sunat di Atas Keldai Semasa Musafir",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Yahya ibn Said, katanya:",
    "english_text": "Yahya related to me from Malik that Yahya ibn Said said, \"I saw\nAnas ibn Malik on a journey praying on a donkey facing away from the\nqibla. He did the raka and the sajda by motioning with his head,\nwithout putting his face on anything.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ رَأَيْتُ أَنَسَ بْنَ مَالِكٍ فِي السَّفَرِ وَهُوَ يُصَلِّي عَلَى حِمَارٍ وَهُوَ مُتَوَجِّهٌ إِلَى غَيْرِ الْقِبْلَةِ يَرْكَعُ وَيَسْجُدُ إِيمَاءً مِنْ غَيْرِ أَنْ يَضَعَ وَجْهَهُ عَلَى شَىْءٍ ‏.‏",
    "malay_translation": "\"Saya melihat Anas bin Malik dalam perjalanan, sedang solat di atas seekor keldai menghadap selain kiblat. Beliau melakukan rukuk dan sujud dengan isyarat kepala, tanpa meletakkan wajahnya pada sesuatu.\""
  },
  {
    "id": 34537,
    "hadith_number": 359,
    "tajuk_hadith": "Rasulullah SAW Solat Lapan Rakaat Semasa Pembukaan Kota Mekah",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Musa ibn Maysara, daripada Abu Murra, maula Aqil ibn Abi Talib, bahawa Umm Hani bint Abi Talib memberitahunya bahawa pada tahun pembukaan (Kota Mekah), Rasulullah SAW solat lapan rakaat dengan berselimutkan satu pakaian.",
    "english_text": "Yahya related to me from Malik from Musa ibn Maysara from Abu\nMurra, the mawla of Aqil ibn Abi Talib, that Umm Hani bint Abi Talib\ntold him that in the year of the conquest the Messenger of Allah, may\nAllah bless him and grant him peace, prayed eight rakas, covering\nhimself with one garment.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُوسَى بْنِ مَيْسَرَةَ، عَنْ أَبِي مُرَّةَ، مَوْلَى عَقِيلِ بْنِ أَبِي طَالِبٍ أَنَّ أُمَّ هَانِئٍ بِنْتَ أَبِي طَالِبٍ، أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى عَامَ الْفَتْحِ ثَمَانِيَ رَكَعَاتٍ مُلْتَحِفًا فِي ثَوْبٍ وَاحِدٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Musa ibn Maysara, daripada Abu Murra, maula Aqil ibn Abi Talib, bahawa Umm Hani bint Abi Talib memberitahunya bahawa Rasulullah SAW solat lapan rakaat pada tahun pembukaan (Kota Mekah), dengan berselimutkan sehelai kain."
  },
  {
    "id": 34538,
    "hadith_number": 360,
    "tajuk_hadith": "Perlindungan yang Diberikan Umm Hani Diiktiraf oleh Rasulullah SAW",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Abu'n Nadr, maula Umar ibn Ubaydullah, bahawa Abu Murra, maula Aqil ibn Abi Talib, memberitahunya bahawa dia mendengar Umm Hani bint Abi Talib berkata,",
    "english_text": "Yahya related to me from Malik from Abu'n Nadr, the mawla of Umar\nibn Ubaydullah, that Abu Murra, the mawla of Aqil ibn Abi Talib, told\nhim that he had heard Umm Hani bint Abi Talib say, \"I went to the\nMessenger of Allah, may Allah bless him and grant him peace, in the\nyear of the conquest and found him doing ghusl while his daughter\nFatima, was screening him with a garment. I said to him, 'Peace be\nupon you' and he said, 'Who is that?' I replied, 'Umm Hani bint Abi\nTalib,' and he said, 'Welcome, Umm Hani!'  When he had finished his\nghusl, he stood and prayed eight rakas, covering himself with one\ngarment, and then came away. I said, 'Messenger of Allah, the son of\nmy mother, AIi, says that he is determined to kill so-and-so, son of\nHubayra, a man I have placed under my protection.'  The Messenger of\nAllah, may Allah bless him and grant him peace, said, 'We give\nprotection to whoever you have given protection to, Umm Hani.' \"\n\n\nUmm Hani related that this incident happened in the morning.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ أَنَّ أَبَا مُرَّةَ، مَوْلَى عَقِيلِ بْنِ أَبِي طَالِبٍ أَخْبَرَهُ أَنَّهُ، سَمِعَ أُمَّ هَانِئٍ بِنْتَ أَبِي طَالِبٍ، تَقُولُ ذَهَبْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ الْفَتْحِ فَوَجَدْتُهُ يَغْتَسِلُ وَفَاطِمَةُ ابْنَتُهُ تَسْتُرُهُ بِثَوْبٍ - قَالَتْ - فَسَلَّمْتُ عَلَيْهِ فَقَالَ ‏\"‏ مَنْ هَذِهِ ‏\"‏ ‏.‏ فَقُلْتُ أُمُّ هَانِئٍ بِنْتُ أَبِي طَالِبٍ ‏.‏ فَقَالَ ‏\"‏ مَرْحَبًا بِأُمِّ هَانِئٍ ‏\"‏ ‏.‏ فَلَمَّا فَرَغَ مِنْ غُسْلِهِ قَامَ فَصَلَّى ثَمَانِيَ رَكَعَاتٍ مُلْتَحِفًا فِي ثَوْبٍ وَاحِدٍ ثُمَّ انْصَرَفَ فَقُلْتُ يَا رَسُولَ اللَّهِ زَعَمَ ابْنُ أُمِّي عَلِيٌّ أَنَّهُ قَاتِلٌ رَجُلاً أَجَرْتُهُ فُلاَنُ بْنُ هُبَيْرَةَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَدْ أَجَرْنَا مَنْ أَجَرْتِ يَا أُمَّ هَانِئٍ ‏\"‏ ‏.‏ قَالَتْ أُمُّ هَانِئٍ وَذَلِكَ ضُحًى ‏.‏",
    "malay_translation": "\"Saya pergi menemui Rasulullah SAW pada tahun pembukaan Kota Mekah dan mendapati baginda sedang mandi (ghusl), sementara puterinya, Fatimah, menutupinya dengan sehelai kain. Saya memberi salam kepada baginda, lalu baginda bertanya, 'Siapa ini?' Saya menjawab, 'Umm Hani bint Abi Talib.' Baginda bersabda, 'Selamat datang, Umm Hani!' Setelah selesai mandi, baginda berdiri dan solat lapan rakaat dengan berselimut sehelai kain, kemudian beredar. Saya berkata, 'Wahai Rasulullah, anak ibuku, Ali, berazam untuk membunuh seorang lelaki yang telah saya berikan perlindungan, Fulan bin Hubayra.' Rasulullah SAW bersabda, 'Kami memberikan perlindungan kepada sesiapa yang kamu berikan perlindungan, wahai Umm Hani.' Umm Hani berkata, 'Peristiwa ini berlaku pada waktu dhuha.'"
  },
  {
    "id": 34539,
    "hadith_number": 361,
    "tajuk_hadith": "Rasulullah SAW Meninggalkan Amalan Sunat kerana Bimbang Difardukan",
    "perawi_melayu": "Diriwayatkan daripada Malik, daripada Ibn Shihab, daripada Urwa ibn az-Zubayr, daripada Aisyah, isteri Nabi SAW",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Urwa ibn az-\nZubayr that A'isha, the wife of the Prophet, may Allah bless him and\ngrant him peace, said, \"I never once saw the Messenger of Allah, may\nAllah bless him and grant him peace, doing the voluntary prayer of\nduha, but I myself do it. Sometimes the Messenger of Allah, may Allah\nbless him and grant him peace, would refrain from a practice that he\nloved to do, fearing that people would do the same and it would become\nfard for them .\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُصَلِّي سُبْحَةَ الضُّحَى قَطُّ وَإِنِّي لأُسَبِّحُهَا وَإِنْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيَدَعُ الْعَمَلَ وَهُوَ يُحِبُّ أَنْ يَعْمَلَهُ خَشْيَةَ أَنْ يَعْمَلَ بِهِ النَّاسُ فَيُفْرَضَ عَلَيْهِمْ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Ibn Shihab, daripada Urwa ibn az-Zubayr bahawa Aisyah, isteri Nabi SAW, berkata, \"Aku tidak pernah melihat Rasulullah SAW menunaikan solat sunat Dhuha sama sekali, tetapi aku sendiri melakukannya. Kadang-kadang Rasulullah SAW meninggalkan sesuatu amalan yang baginda suka lakukan, kerana bimbang orang ramai akan melakukan perkara yang sama dan ia akan menjadi fardu ke atas mereka.\""
  },
  {
    "id": 34540,
    "hadith_number": 362,
    "tajuk_hadith": "Solat Dhuha Lapan Rakaat dan Keutamaan Melaksanakannya",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Zaid ibn Aslam, daripada Aisyah",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَائِشَةَ، أَنَّهَا كَانَتْ تُصَلِّي الضُّحَى ثَمَانِيَ رَكَعَاتٍ ثُمَّ تَقُولُ لَوْ نُشِرَ لِي أَبَوَاىَ مَا تَرَكْتُهُنَّ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Zaid ibn Aslam, daripada Aisyah bahawa beliau biasa menunaikan solat Dhuha sebanyak lapan rakaat, kemudian beliau berkata, \"Sekiranya kedua ibu bapaku dihidupkan kembali, aku tidak akan meninggalkannya (solat Dhuha tersebut).\""
  },
  {
    "id": 34541,
    "hadith_number": 363,
    "tajuk_hadith": "Rasulullah SAW Menunaikan Solat di Rumah Mulayka",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Ishaq ibn Abdullah ibn Abi Talha daripada Anas ibn Malik bahawa neneknya, Mulayka, menjemput Rasulullah SAW untuk menikmati hidangan dan baginda makan sebahagian daripadanya. Kemudian Rasulullah SAW bersabda, \"Bangunlah dan aku akan mengimamkan solat untuk kamu semua.\"",
    "english_text": "Yahya related to me from Malik from Ishaq ibn Abdullah ibn Abi\nTalha from Anas ibn Malik that his grandmother, Mulayka, invited the\nMessenger of Allah, may Allah bless him and grant him peace, for food\nand he ate some of it. Then the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Get up and I will lead you in prayer.\"\n\n\nAnas said, \"I stood up and took a woven mat belonging to us\nthat had become black through long use and sprinkled it with water,\nand the Messengerof Allah, may Allah bless him and grant him peace,\nstood on it. The orphan and I formed a row behind him, and the old\nwoman stood behind us. He prayed two rakas with us and then left.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ جَدَّتَهُ، مُلَيْكَةَ دَعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم لِطَعَامٍ فَأَكَلَ مِنْهُ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ قُومُوا فَلأُصَلِّيَ لَكُمْ ‏\"‏ ‏.‏ قَالَ أَنَسٌ فَقُمْتُ إِلَى حَصِيرٍ لَنَا قَدِ اسْوَدَّ مِنْ طُولِ مَا لُبِسَ فَنَضَحْتُهُ بِمَاءٍ فَقَامَ عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم وَصَفَفْتُ أَنَا وَالْيَتِيمُ وَرَاءَهُ وَالْعَجُوزُ مِنْ وَرَائِنَا فَصَلَّى لَنَا رَكْعَتَيْنِ ثُمَّ انْصَرَفَ ‏.‏",
    "malay_translation": "Anas berkata, \"Aku bangun menuju tikar kami yang telah menghitam kerana lama digunakan, lalu aku memercikkannya dengan air, kemudian Rasulullah SAW berdiri di atasnya. Aku dan seorang anak yatim berbaris di belakang baginda, dan wanita tua itu berdiri di belakang kami. Baginda solat dua rakaat bersama kami, kemudian beredar.\""
  },
  {
    "id": 34542,
    "hadith_number": 364,
    "tajuk_hadith": "Umar ibn al-Khattab Mengajak Makmum Berdiri di Sebelahnya dalam Solat Sunat",
    "perawi_melayu": "Malik meriwayatkan daripada Ibn Shihab bahawa Ubaydullah ibn Abdullah ibn Utba berkata",
    "english_text": "Yahya related to me from Malik from Ibn Shihab that Ubaydullah\nibn Abdullah ibn Utba said, \"I visited Umar ibn al-Khattab just before\nnoon and found him praying a voluntary prayer. So I stood behind him,\nbut he pulled me nearer and put me next to him, on his right hand\nside, and then Yarfa came and I moved back and we formed a row behind\nhim.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّهُ قَالَ دَخَلْتُ عَلَى عُمَرَ بْنِ الْخَطَّابِ بِالْهَاجِرَةِ فَوَجَدْتُهُ يُسَبِّحُ فَقُمْتُ وَرَاءَهُ فَقَرَّبَنِي حَتَّى جَعَلَنِي حِذَاءَهُ عَنْ يَمِينِهِ فَلَمَّا جَاءَ يَرْفَأُ تَأَخَّرْتُ فَصَفَفْنَا وَرَاءَهُ ‏.‏",
    "malay_translation": "\"Saya mengunjungi Umar ibn al-Khattab pada waktu tengah hari dan mendapati beliau sedang mengerjakan solat sunat. Maka saya berdiri di belakangnya, tetapi beliau menarik saya mendekat dan meletakkan saya di sebelahnya, di sebelah kanannya, dan kemudian Yarfa datang dan saya berundur dan kami membentuk saf di belakangnya.\""
  },
  {
    "id": 34543,
    "hadith_number": 365,
    "tajuk_hadith": "Larangan Melintas di Hadapan Orang yang Sedang Solat",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Zaid ibn Aslam, daripada Abd ar-Rahman ibn Abi Said al-Khudri, daripada bapanya",
    "english_text": "Yahya related to me from Malik from Zayd ibn Aslam from Abd ar-\nRahman ibn Abi Said al-Khudri from his father that the Messenger of\nAllah, may Allah bless him and grant him peace, said, \"Do not let\nanyone pass in front of you when you are praying. Repel him as much as\nyou can, and, if he refuses, fight him, for he is only a shaytan.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا كَانَ أَحَدُكُمْ يُصَلِّي فَلاَ يَدَعْ أَحَدًا يَمُرُّ بَيْنَ يَدَيْهِ وَلْيَدْرَأْهُ مَا اسْتَطَاعَ فَإِنْ أَبَى فَلْيُقَاتِلْهُ فَإِنَّمَا هُوَ شَيْطَانٌ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Zaid ibn Aslam, daripada Abd ar-Rahman ibn Abi Said al-Khudri, daripada bapanya bahawa Rasulullah ﷺ bersabda, \"Jangan biarkan sesiapa pun melintas di hadapan kamu ketika kamu sedang solat. Tolaklah dia sekuat mungkin, dan jika dia enggan, maka lawanlah dia, kerana sesungguhnya dia hanyalah syaitan.\""
  },
  {
    "id": 34544,
    "hadith_number": 366,
    "tajuk_hadith": "Larangan Melintas di Hadapan Orang yang Sedang Solat",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Abu'n Nadr, mawla Umar ibn Ubaydullah daripada Busr ibn Said bahawa Zayd ibn Khalid al-Juhani menghantarnya kepada Abu Juhaym untuk bertanya kepadanya apa yang dia dengar daripada Rasulullah SAW tentang lalu di hadapan orang yang sedang solat. Abu Juhaym berkata.",
    "english_text": "Yahya related to me from Malik from Abu'n Nadr, the mawla of Umar\nibn Ubaydullah from Busr ibn Said that Zayd ibn Khalid al-Juhani sent\nhim to Abu Juhaym to ask him what he had heard from the Messenger of\nAllah, may Allah bless him and grant him peace, about passing in front\nof someone praying. Abu Juhaym said, \"The Messenger of Allah, may\nAllah bless him and grant him peace, said, 'If the one who passes in\nfront of a man praying knew what he was bringing upon himself it would\nbe better for him to stop for forty than to pass in front of him.' \"\n\n\nAbu'n-Nadr said, \"I do not know whether he said forty days or\nmonths or years.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ بُسْرِ بْنِ سَعِيدٍ، أَنَّ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ، أَرْسَلَهُ إِلَى أَبِي جُهَيْمٍ يَسْأَلُهُ مَاذَا سَمِعَ مِنْ، رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الْمَارِّ بَيْنَ يَدَىِ الْمُصَلِّي فَقَالَ أَبُو جُهَيْمٍ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَوْ يَعْلَمُ الْمَارُّ بَيْنَ يَدَىِ الْمُصَلِّي مَاذَا عَلَيْهِ لَكَانَ أَنْ يَقِفَ أَرْبَعِينَ خَيْرًا لَهُ مِنْ أَنْ يَمُرَّ بَيْنَ يَدَيْهِ ‏\"‏ ‏.‏ قَالَ أَبُو النَّضْرِ لاَ أَدْرِي أَقَالَ أَرْبَعِينَ يَوْمًا أَوْ شَهْرًا أَوْ سَنَةً ‏.‏",
    "malay_translation": "\"Rasulullah SAW bersabda, 'Sekiranya orang yang melintas di hadapan orang yang sedang solat tahu betapa besar dosanya, maka adalah lebih baik baginya untuk berhenti selama empat puluh (tempoh waktu) daripada melintas di hadapannya.'\" Abu'n-Nadr berkata, \"Saya tidak tahu sama ada baginda berkata empat puluh hari, bulan atau tahun.\""
  },
  {
    "id": 34545,
    "hadith_number": 367,
    "tajuk_hadith": "Ancaman Bagi Orang yang Melintas di Hadapan Orang yang Sedang Solat",
    "perawi_melayu": "Diriwayatkan daripada Malik, daripada Zayd ibn Aslam, daripada Ata ibn Yasar, bahawa Kaab al-Ahbar berkata:",
    "english_text": "Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn\nYasar that Kab al-Ahbar said, \"If the person who passed in front of a\nman praying knew what he was bringing on himself, it would be better\nfor him to sink into the ground than to pass in front of him.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ كَعْبَ الأَحْبَارِ، قَالَ لَوْ يَعْلَمُ الْمَارُّ بَيْنَ يَدَىِ الْمُصَلِّي مَاذَا عَلَيْهِ لَكَانَ أَنْ يُخْسَفَ بِهِ خَيْرًا لَهُ مِنْ أَنْ يَمُرَّ بَيْنَ يَدَيْهِ ‏.‏",
    "malay_translation": "\"Sekiranya orang yang melintas di hadapan orang yang sedang solat mengetahui (dosa) apa yang akan menimpanya, maka sesungguhnya dibenamkan dia ke dalam bumi adalah lebih baik baginya daripada melintas di hadapannya.\""
  },
  {
    "id": 34546,
    "hadith_number": 368,
    "tajuk_hadith": "Larangan Melintas di Hadapan Wanita yang Sedang Solat",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik bahawa beliau mendengar Abdullah ibn Umar tidak menyukai melintas di hadapan wanita ketika mereka sedang solat.",
    "english_text": "Yahya related to me from Malik that he had heard that Abdullah\nibn Umar used to disapprove of passing in front of women while they\nwere praying.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَكْرَهُ أَنْ يَمُرَّ، بَيْنَ أَيْدِي النِّسَاءِ وَهُنَّ يُصَلِّينَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, bahawa telah sampai kepadanya bahawa Abdullah bin Umar tidak suka seseorang melintas di hadapan wanita ketika mereka sedang solat."
  },
  {
    "id": 34547,
    "hadith_number": 369,
    "tajuk_hadith": "Larangan Melintas di Hadapan Orang yang Sedang Solat dan Membiarkan Orang Lain Melintas",
    "perawi_melayu": "Diriwayatkan daripada Malik, daripada Nafi' bahawa Abdullah ibn Umar",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nwould neither pass in front of anyone, nor let anyone pass in front of\nhim.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ لاَ يَمُرُّ بَيْنَ يَدَىْ أَحَدٍ وَلاَ يَدَعُ أَحَدًا يَمُرُّ بَيْنَ يَدَيْهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Nafi' bahawa Abdullah ibn Umar tidak akan melintas di hadapan seseorang, dan tidak juga membiarkan seseorang melintas di hadapannya."
  },
  {
    "id": 34548,
    "hadith_number": 370,
    "tajuk_hadith": "Abdullah bin Abbas Menunggang Keldai di Mina Semasa Nabi Muhammad SAW Solat",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Ibn Shihab daripada Ubaydullah ibn Abdullah ibn Utba ibn Mas'ud bahawa Abdullah ibn Abbas berkata",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Ubaydullah\nibn Abdullah ibn Utba ibn Masud that Abdullah ibn Abbas said, \"I\napproached, riding on a donkey, while the Messenger of Allah, may\nAllah bless him and grant him peace, was leading the people in prayer\nat Mina, and I was, at that time, nearing puberty. I passed in front\nof part of the row, dismounted, sent the donkey off to graze, and then\njoined the row, and no one rebuked me for doing so.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّهُ قَالَ أَقْبَلْتُ رَاكِبًا عَلَى أَتَانٍ - وَأَنَا يَوْمَئِذٍ قَدْ نَاهَزْتُ الاِحْتِلاَمَ - وَرَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي لِلنَّاسِ بِمِنًى فَمَرَرْتُ بَيْنَ يَدَىْ بَعْضِ الصَّفِّ فَنَزَلْتُ فَأَرْسَلْتُ الأَتَانَ تَرْتَعُ وَدَخَلْتُ فِي الصَّفِّ فَلَمْ يُنْكِرْ ذَلِكَ عَلَىَّ أَحَدٌ ‏.‏",
    "malay_translation": "\"Saya menghampiri, menunggang seekor keldai betina, dan pada masa itu saya hampir baligh. Rasulullah SAW sedang mengimami solat orang ramai di Mina. Saya lalu di hadapan sebahagian saf, kemudian saya turun dari keldai, membiarkannya meragut rumput, dan kemudian saya menyertai saf, dan tiada seorang pun yang menegur saya kerana melakukan demikian.\""
  },
  {
    "id": 34549,
    "hadith_number": 371,
    "tajuk_hadith": "Melewati Saf Semasa Solat Berlangsung",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik bahawa dia mendengar Said ibn Abi Waqqas pernah lalu di hadapan beberapa saf ketika solat sedang berlangsung.",
    "english_text": "Yahya related to me from Malik that he had heard that Said ibn\nAbi Waqqas used to pass in front of some of the rows while the prayer\nwas in progress.\n\n\nMalik said, \"I consider that it is\npermissible to do that if the iqama for the prayer has been said and\nthe imam has said the initial takbir and a man cannot find any way\ninto the mosque except by going between the rows.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سَعْدَ بْنَ أَبِي وَقَّاصٍ، كَانَ يَمُرُّ بَيْنَ يَدَىْ بَعْضِ الصُّفُوفِ وَالصَّلاَةُ قَائِمَةٌ ‏.‏ قَالَ مَالِكٌ وَأَنَا أَرَى ذَلِكَ وَاسِعًا إِذَا أُقِيمَتِ الصَّلاَةُ وَبَعْدَ أَنْ يُحْرِمَ الإِمَامُ وَلَمْ يَجِدِ الْمَرْءُ مَدْخَلاً إِلَى الْمَسْجِدِ إِلاَّ بَيْنَ الصُّفُوفِ ‏.‏",
    "malay_translation": "Malik berkata, \"Saya berpendapat bahawa adalah dibolehkan untuk berbuat demikian jika iqama untuk solat telah dilaungkan dan imam telah mengucapkan takbir permulaan dan seseorang tidak dapat mencari jalan masuk ke masjid kecuali dengan melalui antara saf.\""
  },
  {
    "id": 34550,
    "hadith_number": 372,
    "tajuk_hadith": "Perkara yang Melintas di Hadapan Orang yang Solat Tidak Membatalkan Solat",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik bahawa beliau mendengar Ali ibn Abi Talib berkata, \"Perkara yang melintas di hadapan seseorang yang sedang solat tidak membatalkan solatnya.\"",
    "english_text": "Yahya related to me from Malik that he had heard that Ali ibn Abi Talib said, \"Things that pass in front of a man praying do not break his prayer.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ، قَالَ لاَ يَقْطَعُ الصَّلاَةَ شَىْءٌ مِمَّا يَمُرُّ بَيْنَ يَدَىِ الْمُصَلِّي ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik bahawa beliau telah mendengar Ali bin Abi Talib berkata, \"Tidak membatalkan solat sesuatu yang melintas di hadapan orang yang solat.\""
  },
  {
    "id": 34551,
    "hadith_number": 373,
    "tajuk_hadith": "Perkara yang Melintas di Hadapan Orang yang Solat Tidak Membatalkan Solat",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Ibn Shihab, daripada Salim bin Abdullah bahawa Abdullah bin Umar pernah berkata, \"Perkara yang melintas di hadapan orang yang solat tidak membatalkan solatnya.\"",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Salim ibn Abdullah that Abdullah ibn Umar used to say, \"Things that pass in front of a man praying do not break his prayer.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ لاَ يَقْطَعُ الصَّلاَةَ شَىْءٌ مِمَّا يَمُرُّ بَيْنَ يَدَىِ الْمُصَلِّي ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Ibn Shihab, daripada Salim bin Abdullah bahawa Abdullah bin Umar pernah berkata, \"Perkara yang melintas di hadapan orang yang solat tidak membatalkan solatnya.\""
  },
  {
    "id": 34552,
    "hadith_number": 374,
    "tajuk_hadith": "Abdullah bin Umar Menggunakan Kenderaannya Sebagai Sutrah Ketika Solat",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik bahawa dia mendengar Abdullah ibn Umar menggunakan haiwan tunggangannya sebagai sutrah ketika dia solat.",
    "english_text": "Yahya related to me from Malik that he had heard that Abdullah ibn Umar would use the animal he was riding as a sutra when he prayed.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَسْتَتِرُ بِرَاحِلَتِهِ إِذَا صَلَّى ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, bahawa telah sampai kepadanya bahawa Abdullah bin Umar menggunakan kenderaannya sebagai sutrah apabila dia solat."
  },
  {
    "id": 34553,
    "hadith_number": 375,
    "tajuk_hadith": "Solat di Padang Pasir Tanpa Sutrah",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Hisham ibn Urwa bahawa bapanya biasa solat di padang pasir tanpa sutrah.",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، أَنَّ أَبَاهُ، كَانَ يُصَلِّي فِي الصَّحْرَاءِ إِلَى غَيْرِ سُتْرَةٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Hisham ibn Urwa, bahawa bapanya biasa solat di padang pasir tanpa menggunakan sutrah."
  },
  {
    "id": 34554,
    "hadith_number": 376,
    "tajuk_hadith": "Membersihkan Tempat Sujud dari Kerikil Kecil",
    "perawi_melayu": "Yahya meriwayatkan kepadaku dari Malik, dari Abu Ja'far al-Qari, bahawa dia berkata,",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي جَعْفَرٍ الْقَارِئِ، أَنَّهُ قَالَ رَأَيْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ إِذَا أَهْوَى لِيَسْجُدَ مَسَحَ الْحَصْبَاءَ لِمَوْضِعِ جَبْهَتِهِ مَسْحًا خَفِيفًا ‏.‏",
    "malay_translation": "\"Aku melihat Abdullah ibn Umar dengan cepat menyapu kerikil-kerikil kecil dari tempat dahinya akan diletakkan ketika dia hendak sujud.\""
  },
  {
    "id": 34555,
    "hadith_number": 377,
    "tajuk_hadith": "Kebersihan Tempat Solat: Menyapu Kerikil Sekali Lebih Baik",
    "perawi_melayu": "Diriwayatkan daripada Malik, daripada Yahya bin Said, bahawa beliau mendengar Abu Dharr berkata",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said that he had\nheard that Abu Dharr used to say, \"Brush away the small stones with\none sweep, but if you leave them it is better than a red camel.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ بَلَغَهُ أَنَّ أَبَا ذَرٍّ، كَانَ يَقُولُ مَسْحُ الْحَصْبَاءِ مَسْحَةً وَاحِدَةً وَتَرْكُهَا خَيْرٌ مِنْ حُمْرِ النَّعَمِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Yahya bin Said bahawa dia mendengar Abu Dharr berkata, \"Menyapu kerikil dengan sekali sapuan, tetapi jika kamu membiarkannya, itu lebih baik daripada unta merah.\""
  },
  {
    "id": 34556,
    "hadith_number": 378,
    "tajuk_hadith": "Umar ibn al-Khattab mengarahkan meluruskan saf dan bertakbir",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Nafi' bahawa Umar ibn al-Khattab",
    "english_text": "Yahya related to me from Malik from Nafi that Umar ibn al-Khattab\nused to order the rows to be straightened, and when they had come to\nhim and told him that the rows were straight he would say the takbir.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَانَ يَأْمُرُ بِتَسْوِيَةِ الصُّفُوفِ فَإِذَا جَاءُوهُ فَأَخْبَرُوهُ أَنْ قَدِ اسْتَوَتْ كَبَّرَ ‏.‏",
    "malay_translation": "biasanya memerintahkan saf diluruskan, dan apabila mereka datang kepadanya dan memberitahunya bahawa saf telah lurus, dia akan mengucapkan takbir."
  },
  {
    "id": 34557,
    "hadith_number": 379,
    "tajuk_hadith": "Uthman bin Affan Meluruskan Saf Semasa Iqamah dan Menyuruh Sahabat Berbuat Demikian",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada bapa saudaranya, Abu Suhayl ibn Malik, bahawa bapanya berkata",
    "english_text": "Yahya related to me from Malik from his paternal uncle, Abu\nSuhayl ibn Malik, that his father said, \"I was with Uthman ibn Affan\nwhen the iqama was said for the prayer and I was talking to him about\nbeing assigned a definite allowance by him. I continued talking to him\nwhile he was levelling some small stones with his sandals, and then\nsome men that he had entrusted to straighten the rows came and told\nhim that the rows were straight. He said to me, 'Line up in the row,'\nand then he said the takbir.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَمِّهِ أَبِي سُهَيْلِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، أَنَّهُ قَالَ كُنْتُ مَعَ عُثْمَانَ بْنِ عَفَّانَ فَقَامَتِ الصَّلاَةُ وَأَنَا أُكَلِّمُهُ، فِي أَنْ يَفْرِضَ، لِي فَلَمْ أَزَلْ أُكَلِّمُهُ وَهُوَ يُسَوِّي الْحَصْبَاءَ بِنَعْلَيْهِ حَتَّى جَاءَهُ رِجَالٌ قَدْ كَانَ وَكَلَهُمْ بِتَسْوِيَةِ الصُّفُوفِ ‏.‏ فَأَخْبَرُوهُ أَنَّ الصُّفُوفَ قَدِ اسْتَوَتْ فَقَالَ لِي اسْتَوِ فِي الصَّفِّ ‏.‏ ثُمَّ كَبَّرَ ‏.‏",
    "malay_translation": "\"Saya bersama Uthman ibn Affan ketika iqamah dilaungkan untuk solat dan saya sedang berbicara dengannya tentang penetapan elaun tertentu olehnya. Saya terus berbicara dengannya sementara dia meratakan batu-batu kecil dengan sandalnya, sehingga datanglah beberapa orang lelaki yang telah diamanahkan untuk meluruskan saf dan memberitahunya bahawa saf telah lurus. Dia berkata kepada saya, 'Beratur dalam saf,' dan kemudian dia mengucapkan takbir.\""
  },
  {
    "id": 34558,
    "hadith_number": 380,
    "tajuk_hadith": "Perbuatan yang Tidak Memalukan, Meletakkan Tangan dalam Solat, Menyegerakan Berbuka dan Melewatkan Sahur",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik bahawa Abd al-Karim ibn Abi'l-Mukhariq al-Basri berkata, \"Antara perkara yang Nabi SAW sabdakan dan lakukan adalah:",
    "english_text": "'As long as you do\nnot feel ashamed, do whatever you wish', the placing of one hand on\nthe other in prayer (one places the right hand on the left), being\nquick to break the fast, and delaying the meal before dawn.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الْكَرِيمِ بْنِ أَبِي الْمُخَارِقِ الْبَصْرِيِّ، أَنَّهُ قَالَ مِنْ كَلاَمِ النُّبُوَّةِ إِذَا لَمْ تَسْتَحِي فَافْعَلْ مَا شِئْتَ وَوَضْعُ الْيَدَيْنِ إِحْدَاهُمَا عَلَى الأُخْرَى فِي الصَّلاَةِ يَضَعُ الْيُمْنَى عَلَى الْيُسْرَى وَتَعْجِيلُ الْفِطْرِ وَالاِسْتِينَاءُ بِالسَّحُورِ ‏.‏",
    "malay_translation": "\"'Selagi kamu tidak berasa malu, lakukanlah apa sahaja yang kamu inginkan', meletakkan satu tangan di atas tangan yang lain dalam solat (seseorang meletakkan tangan kanan di atas kiri), menyegerakan berbuka puasa, dan melewatkan makan sebelum subuh.\""
  },
  {
    "id": 34559,
    "hadith_number": 381,
    "tajuk_hadith": "Meletakkan Tangan Kanan di Atas Lengan Kiri dalam Solat",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Abu Hazim ibn Dinar, bahawa Sahl ibn Saad berkata, \"Orang ramai diperintahkan untuk meletakkan tangan kanan mereka di atas lengan kiri mereka dalam solat.\"\n\nAbu Hazim menambah, \"Saya tahu pasti bahawa Sahl menjejak perkara itu kembali kepada Nabi, semoga Allah memberkati dan mengurniakan kesejahteraan kepadanya.\"",
    "english_text": "Yahya related to me from Malik from Abu Hazim ibn Dinar that Sahl\nibn Sad said, \"People used to be ordered to place their right hands on\ntheir left forearms in the prayer.\"\n\n\nAbu Hazim added, \"I know\nfor sure that Sahl traces that back to the Prophet, may Allah bless\nhim and grant him peace.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، أَنَّهُ قَالَ كَانَ النَّاسُ يُؤْمَرُونَ أَنْ يَضَعَ الرَّجُلُ الْيَدَ الْيُمْنَى عَلَى ذِرَاعِهِ الْيُسْرَى فِي الصَّلاَةِ ‏.‏ قَالَ أَبُو حَازِمٍ لاَ أَعْلَمُ إِلاَّ أَنَّهُ يَنْمِي ذَلِكَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Abu Hazim ibn Dinar, bahawa Sahl ibn Saad berkata, \"Dahulu orang ramai diperintahkan untuk meletakkan tangan kanan mereka di atas lengan kiri mereka ketika solat.\"\n\nAbu Hazim menambah, \"Saya pasti Sahl menjejak perkara ini kembali kepada Nabi Muhammad SAW.\""
  },
  {
    "id": 34560,
    "hadith_number": 382,
    "tajuk_hadith": "Abdullah bin Umar Tidak Melakukan Qunut dalam Solat",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Nafi' bahawa Abdullah bin Umar tidak melakukan qunut dalam mana-mana solat.",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\ndid not say qunut in any of the prayers.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ لاَ يَقْنُتُ فِي شَىْءٍ مِنَ الصَّلاَةِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Nafi', bahawa Abdullah bin Umar tidak melakukan qunut dalam mana-mana solat."
  },
  {
    "id": 34561,
    "hadith_number": 383,
    "tajuk_hadith": "Didahulukan Buang Air Sebelum Solat",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Hisham bin Urwa daripada ayahnya bahawa Abdullah bin al-Arqam pernah mengimamkan sahabat-sahabatnya dalam solat. Pada suatu hari, waktu solat tiba dan dia pergi untuk membuang air. Ketika dia kembali, dia berkata, \"Aku mendengar Rasulullah SAW bersabda, 'Jika kamu ingin membuang air besar, maka lakukanlah sebelum solat.'\"",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that Abdullah ibn al-Arqam used to lead his companions in\nprayer. The time for prayer came one day and he went to relieve\nhimself. When he returned, he said, \"I heard the Messenger of Allah,\nmay Allah bless him and grant him peace, say, 'If you wish to\ndefecate, you should do so before the prayer.' \"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ عَبْدَ اللَّهِ بْنَ الأَرْقَمِ، كَانَ يَؤُمُّ أَصْحَابَهُ فَحَضَرَتِ الصَّلاَةُ يَوْمًا فَذَهَبَ لِحَاجَتِهِ ثُمَّ رَجَعَ فَقَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِذَا أَرَادَ أَحَدُكُمُ الْغَائِطَ فَلْيَبْدَأْ بِهِ قَبْلَ الصَّلاَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Hisham bin Urwa, daripada ayahnya, bahawa Abdullah bin al-Arqam biasanya mengimamkan sahabat-sahabatnya. Pada suatu hari, waktu solat tiba dan dia pergi untuk menunaikan hajatnya (buang air). Kemudian dia kembali dan berkata, “Sesungguhnya aku mendengar Rasulullah SAW bersabda: ‘Apabila salah seorang daripada kamu ingin buang air besar, maka hendaklah dia memulakannya sebelum solat.’”"
  },
  {
    "id": 34562,
    "hadith_number": 384,
    "tajuk_hadith": "Larangan Solat Ketika Menahan Buang Air",
    "perawi_melayu": "Diriwayatkan daripada Malik, daripada Zayd ibn Aslam bahawa Umar ibn al-Khattab berkata,",
    "english_text": "Yahya related to me from Malik from Zayd ibn Aslam that Umar ibn\nal-Khattab said, \"You should not pray while you are holding your\nbowels.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ لاَ يُصَلِّيَنَّ أَحَدُكُمْ وَهُوَ ضَامٌّ بَيْنَ وَرِكَيْهِ ‏.‏",
    "malay_translation": "\"Janganlah kamu solat ketika kamu sedang menahan buang air.\""
  },
  {
    "id": 34563,
    "hadith_number": 385,
    "tajuk_hadith": "Malaikat Memohon Rahmat ke atas Orang yang Berada di Tempat Solatnya",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Abu'z Zinad, daripada al-Araj, daripada Abu Hurayra, bahawa Rasulullah SAW bersabda:",
    "english_text": "Yahya related to me from Malik from Abu'z Zinad from al-Araj from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"The angels ask for blessings on each one of you as long as he is in the place where he has prayed and has not discharged anything. They say, 'Allah, forgive him. Allah have mercy on him.' \"",
    "arabic_text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْمَلاَئِكَةُ تُصَلِّي عَلَى أَحَدِكُمْ مَا دَامَ فِي مُصَلاَّهُ الَّذِي صَلَّى فِيهِ مَا لَمْ يُحْدِثِ اللَّهُمَّ اغْفِرْ لَهُ اللَّهُمَّ ارْحَمْهُ ‏\"‏ ‏.‏",
    "malay_translation": "\"Malaikat akan memohon rahmat ke atas setiap seorang daripada kamu selagi mana dia berada di tempat solatnya di mana dia telah solat, selagi dia tidak berhadas. Mereka (malaikat) berkata, 'Ya Allah, ampunilah dia. Ya Allah, rahmatilah dia.'\""
  },
  {
    "id": 34564,
    "hadith_number": 386,
    "tajuk_hadith": "Penjelasan tentang Perkara yang Membatalkan Wuduk",
    "perawi_melayu": "Imam Malik berkata",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Imam Malik berkata, \"Saya tidak menganggap bahawa kata-katanya, 'tidak mengeluarkan apa-apa' merujuk kepada apa-apa selain daripada pengeluaran yang membatalkan wuduk.\""
  },
  {
    "id": 34565,
    "hadith_number": 387,
    "tajuk_hadith": "Keutamaan Menunggu Solat",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Abu'z Zinad, daripada al-Araj, daripada Abu Hurayra",
    "english_text": "Yahya related to me from Malik from Abu'z Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"You are in prayer as long as the prayer detains you\nand there is nothing that prevents you from returning to your family\nexcept the prayer.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَزَالُ أَحَدُكُمْ فِي صَلاَةٍ مَا كَانَتِ الصَّلاَةُ تَحْبِسُهُ لاَ يَمْنَعُهُ أَنْ يَنْقَلِبَ إِلَى أَهْلِهِ إِلاَّ الصَّلاَةُ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Abu'z Zinad, daripada al-Araj, daripada Abu Hurayra bahawa Rasulullah SAW bersabda, \"Seseorang kamu sentiasa berada dalam solat selagi mana solat itu menahannya dan tidak ada yang menghalangnya daripada pulang kepada keluarganya kecuali solat.\" "
  },
  {
    "id": 34566,
    "hadith_number": 388,
    "tajuk_hadith": "Keutamaan Pergi ke Masjid untuk Menuntut Ilmu",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Sumayy, maula Abu Bakr, bahawa Abu Bakr ibn Abd ar-Rahman biasa berkata,",
    "english_text": "Yahya related to me from Malik from Sumayy, the mawla of Abu\nBakr, that Abu Bakr ibn Abd ar-Rahman used to say, \"Someone who goes\nto the mosque in the morning or the afternoon with no intention of\ngoing anywhere else, either to learn good or teach it, is like someone\nwho does jihad in the way of Allah and returns with booty.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ أَنَّ أَبَا بَكْرِ بْنَ عَبْدِ الرَّحْمَنِ، كَانَ يَقُولُ مَنْ غَدَا أَوْ رَاحَ إِلَى الْمَسْجِدِ لاَ يُرِيدُ غَيْرَهُ لِيَتَعَلَّمَ خَيْرًا أَوْ لِيُعَلِّمَهُ ثُمَّ رَجَعَ إِلَى بَيْتِهِ كَانَ كَالْمُجَاهِدِ فِي سَبِيلِ اللَّهِ رَجَعَ غَانِمًا ‏.‏",
    "malay_translation": "\"Sesiapa yang pergi ke masjid pada waktu pagi atau petang tanpa tujuan lain, sama ada untuk mempelajari kebaikan atau mengajarkannya, adalah seperti seseorang yang berjihad di jalan Allah dan kembali dengan rampasan perang.\""
  },
  {
    "id": 34567,
    "hadith_number": 389,
    "tajuk_hadith": "Keutamaan Duduk di Tempat Solat dan Menunggu Solat di Masjid",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Nu'aim ibn Abdullah al-Mujmir, bahawa dia mendengar Abu Hurairah berkata,",
    "english_text": "Yahya related to me from Malik from Nuaym ibn Abdullah al-Mujmir\nthat he heard Abu Hurayra say, \"If any one of you prays and then sits\ndown in the spot where he has prayed, the angels ask blessings on him\nsaying, 'Allah, forgive him. Allah, have mercy on him.' And if he\nmoves from the spot where he has prayed and sits elsewhere in the\nmosque waiting for the prayer, he remains in prayer until he prays.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمُجْمِرِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ إِذَا صَلَّى أَحَدُكُمْ ثُمَّ جَلَسَ فِي مُصَلاَّهُ لَمْ تَزَلِ الْمَلاَئِكَةُ تُصَلِّي عَلَيْهِ اللَّهُمَّ اغْفِرْ لَهُ اللَّهُمَّ ارْحَمْهُ فَإِنْ قَامَ مِنْ مُصَلاَّهُ فَجَلَسَ فِي الْمَسْجِدِ يَنْتَظِرُ الصَّلاَةَ لَمْ يَزَلْ فِي صَلاَةٍ حَتَّى يُصَلِّيَ ‏.‏",
    "malay_translation": "\"Jika salah seorang daripada kamu solat, kemudian dia duduk di tempat dia solat, para malaikat akan terus memohon berkat untuknya dengan berkata, 'Ya Allah, ampunilah dia. Ya Allah, rahmatilah dia.' Dan jika dia beranjak dari tempat dia solat dan duduk di tempat lain di masjid menunggu solat, dia tetap berada dalam solat sehingga dia solat.\" "
  },
  {
    "id": 34568,
    "hadith_number": 390,
    "tajuk_hadith": "Kelebihan Menyempurnakan Wuduk, Banyak Berjalan ke Masjid, dan Menunggu Solat",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada al Ala ibn Abd ar-Rahman ibn Yaqub, daripada bapanya, daripada Abu Hurairah bahawa Rasulullah SAW bersabda, \"Mahukah aku khabarkan kepada kamu tentang perkara-perkara yang dengannya Allah menghapuskan dosa-dosa dan mengangkat darjat:",
    "english_text": "the complete and correct performance of wudu in adverse\nconditions, a great number of steps towards the mosque,and waiting\nafter one prayer for the next prayer. That is the firm hold, that is\nthe firm hold, that is the firm hold.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَعْقُوبَ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَلاَ أُخْبِرُكُمْ بِمَا يَمْحُو اللَّهُ بِهِ الْخَطَايَا وَيَرْفَعُ بِهِ الدَّرَجَاتِ إِسْبَاغُ الْوُضُوءِ عِنْدَ الْمَكَارِهِ وَكَثْرَةُ الْخُطَا إِلَى الْمَسَاجِدِ وَانْتِظَارُ الصَّلاَةِ بَعْدَ الصَّلاَةِ فَذَلِكُمُ الرِّبَاطُ فَذَلِكُمُ الرِّبَاطُ فَذَلِكُمُ الرِّبَاطُ ‏\"‏ ‏.‏",
    "malay_translation": "Menyempurnakan wuduk dengan baik dalam keadaan yang sukar, banyak langkah menuju ke masjid, dan menunggu solat selepas solat yang lain. Itulah pegangan yang teguh, itulah pegangan yang teguh, itulah pegangan yang teguh."
  },
  {
    "id": 34569,
    "hadith_number": 391,
    "tajuk_hadith": "Larangan Meninggalkan Masjid Selepas Azan Kecuali dengan Niat untuk Kembali",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik bahawa dia mendengar Said ibn al-Musayyab berkata, \"Dikatakan bahawa tidak seorang pun yang meninggalkan masjid selepas azan, kecuali seseorang yang berniat untuk kembali, melainkan seorang munafik.\"",
    "english_text": "Yahya related to me from Malik that he had heard that Said ibn\nal-Musayyab said, \"It is said that no-one except a hypocrite leaves\nthe mosque after the call to prayer, except for someone who intends to\nreturn.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، قَالَ يُقَالُ لاَ يَخْرُجُ أَحَدٌ مِنَ الْمَسْجِدِ بَعْدَ النِّدَاءِ - إِلاَّ أَحَدٌ يُرِيدُ الرُّجُوعَ إِلَيْهِ - إِلاَّ مُنَافِقٌ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik bahawa dia telah mendengar Said ibn al-Musayyab berkata, \"Dikatakan bahawa tidak seorang pun keluar dari masjid selepas azan, kecuali seseorang yang ingin kembali kepadanya, melainkan dia seorang munafik.\""
  },
  {
    "id": 34570,
    "hadith_number": 392,
    "tajuk_hadith": "Solat Dua Rakaat Sebelum Duduk di Masjid",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Amir ibn Abdullah ibn az-Zubayr, daripada Amr ibn Sulaym az-Zuraqi, daripada Abu Qatada al-Ansari",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ، عَنْ أَبِي قَتَادَةَ الأَنْصَارِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا دَخَلَ أَحَدُكُمُ الْمَسْجِدَ فَلْيَرْكَعْ رَكْعَتَيْنِ قَبْلَ أَنْ يَجْلِسَ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Amir ibn Abdullah ibn az-Zubayr, daripada Amr ibn Sulaym az-Zuraqi, daripada Abu Qatada al-Ansari bahawa Rasulullah SAW bersabda, \"Apabila salah seorang daripada kamu masuk ke masjid, maka hendaklah dia solat dua rakaat sebelum dia duduk.\""
  },
  {
    "id": 34571,
    "hadith_number": 393,
    "tajuk_hadith": "Duduk Sebelum Solat Setelah Masuk Masjid: Hukumnya Harus, Bukan Wajib",
    "perawi_melayu": "Malik meriwayatkan daripada Abu'n-Nadr, maula Umar ibn Ubaydullah, daripada Abu Salama ibn Abd ar-Rahman",
    "english_text": "Yahya related to me from Malik from Abu'nNadr, the mawla of Umar\nibn Ubaydullah, that Abu Salama ibn Abd ar-Rahman asked him, \"Didn't I\nsee your master sit down before praying after he had entered the\nmosque?\"\n\n\nAbu'n-Nadr said, \"By that he meant Umar ibn\nUbaydullah, and he was finding fault with him for sitting down before\npraying after he had come into the mosque.\"\n\n\nYahya said that\nMalik said, \"It is good to do that but not obligatory.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ قَالَ لَهُ أَلَمْ أَرَ صَاحِبَكَ إِذَا دَخَلَ الْمَسْجِدَ يَجْلِسُ قَبْلَ أَنْ يَرْكَعَ قَالَ أَبُو النَّضْرِ يَعْنِي بِذَلِكَ عُمَرَ بْنَ عُبَيْدِ اللَّهِ وَيَعِيبُ ذَلِكَ عَلَيْهِ أَنْ يَجْلِسَ إِذَا دَخَلَ الْمَسْجِدَ قَبْلَ أَنْ يَرْكَعَ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَذَلِكَ حَسَنٌ وَلَيْسَ بِوَاجِبٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Abu'n-Nadr, maula Umar ibn Ubaydullah, bahawa Abu Salama ibn Abd ar-Rahman bertanya kepadanya, \"Tidakkah aku melihat tuanmu duduk sebelum solat setelah dia masuk masjid?\"\n\nAbu'n-Nadr berkata, \"Dengan itu dia bermaksud Umar ibn Ubaydullah, dan dia mencari kesalahan padanya kerana duduk sebelum solat setelah dia masuk ke dalam masjid.\"\n\nYahya berkata bahawa Malik berkata, \"Ia adalah baik untuk melakukan itu tetapi tidak wajib.\""
  },
  {
    "id": 34572,
    "hadith_number": 394,
    "tajuk_hadith": "Abdullah ibn Umar Meletakkan Tapak Tangan di Permukaan Tempat Sujud",
    "perawi_melayu": "Diriwayatkan daripada Yahya daripada Malik daripada Nafi':",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to place his palms flat on the surface where he put his forehead.\nNafi said, \"I have seen him take his hands out from under his burnus\non a very cold day and place them on the ground.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا سَجَدَ وَضَعَ كَفَّيْهِ عَلَى الَّذِي يَضَعُ عَلَيْهِ جَبْهَتَهُ ‏.‏ قَالَ نَافِعٌ وَلَقَدْ رَأَيْتُهُ فِي يَوْمٍ شَدِيدِ الْبَرْدِ وَإِنَّهُ لَيُخْرِجُ كَفَّيْهِ مِنْ تَحْتِ بُرْنُسٍ لَهُ حَتَّى يَضَعَهُمَا عَلَى الْحَصْبَاءِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Nafi' bahawa Abdullah ibn Umar meletakkan kedua tapak tangannya rata di atas permukaan tempat dia meletakkan dahinya (ketika sujud). Nafi' berkata, \"Aku pernah melihatnya mengeluarkan tangannya dari bawah burnusnya pada hari yang sangat sejuk dan meletakkannya di atas tanah berbatu kecil.\""
  },
  {
    "id": 34573,
    "hadith_number": 395,
    "tajuk_hadith": "Cara Meletakkan Tangan Ketika Sujud",
    "perawi_melayu": "Diriwayatkan daripada Malik, daripada Nafi':",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to say, \"When one of you puts his forehead on the ground he\nshould put his palms on the place where he puts his forehead. Then,\nwhen he rises, he should raise them, for the hands prostrate just as\nthe face prostrates.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ مَنْ وَضَعَ جَبْهَتَهُ بِالأَرْضِ فَلْيَضَعْ كَفَّيْهِ عَلَى الَّذِي يَضَعُ عَلَيْهِ جَبْهَتَهُ ثُمَّ إِذَا رَفَعَ فَلْيَرْفَعْهُمَا فَإِنَّ الْيَدَيْنِ تَسْجُدَانِ كَمَا يَسْجُدُ الْوَجْهُ ‏.‏",
    "malay_translation": "Abdullah ibn Umar pernah berkata: \"Apabila seseorang daripada kamu meletakkan dahinya di atas tanah, maka hendaklah dia meletakkan kedua tapak tangannya di tempat dia meletakkan dahinya. Kemudian, apabila dia bangkit (dari sujud), hendaklah dia mengangkat kedua-duanya, kerana kedua-dua tangan itu sujud sebagaimana wajah juga sujud.\""
  },
  {
    "id": 34574,
    "hadith_number": 396,
    "tajuk_hadith": "Nabi Muhammad SAW Mengimami Solat Setelah Abu Bakar RA Memulakannya",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Abu Hazim Salama ibn Dinar daripada Sahl ibn Said as-Saidi",
    "english_text": "Yahya related to me from Malik from Abu Hazim Salama ibn Dinar\nfrom Sahl ibn Said as-Saidi that the Messenger of Allah, may Allah\nbless him and grant him peace, went to the tribe of Bani Amr ibn Awf\nto settle their disputes .The time for the prayer came and the\nmuadhdhin came to Abu Bakr as-Siddiq and said, \"Could you lead the\npeople in prayer and I will say the iqama?\" He said, \"Yes,\" and Abu\nBakr prayed. The Messenger of Allah, may Allah bless him and grant him\npeace, came back while the people were praying, and approached and\njoined the row. People clapped, but Abu Bakr did not turn round. The\npeople increased their clapping, and Abu Bakr turned round and saw the\nMessenger of Allah, may Allah bless him and grant him peace, and the\nMessenger of Allah, may Allah bless him and grant him peace, indicated\nto him to stay in his place. Abu Bakr raised his hands and praised\nAllah that the Messenger of Allah, may Allah bless him and grant him\npeace, had told him to do that. Then  he drew back until he was in the\nrow, and the Messenger of Allah, may Allah bless him and grant him\npeace, stepped forward and led the prayer. When he had finished he\nsaid, \"Abu Bakr, what stopped you from staying put like I told you?\"\nAbu Bakr said, \"It is not for Ibn Abi Quhafa to pray in front of the\nMessenger of Allah, may Allah bless him and grant him peace.\"\n\n\nThe Messenger of Allah, may Allah bless him and grant him peace, said,\n\"Why did I see you all clapping so much? If something happens to you\nin the prayer you should say 'Subhana-llah' (Glory be to Allah), and\nwhen you say 'Subhana-llah' you will be heard. Clapping is only for\nwomen.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي حَازِمٍ، سَلَمَةَ بْنِ دِينَارٍ عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ذَهَبَ إِلَى بَنِي عَمْرِو بْنِ عَوْفٍ لِيُصْلِحَ بَيْنَهُمْ وَحَانَتِ الصَّلاَةُ فَجَاءَ الْمُؤَذِّنُ إِلَى أَبِي بَكْرٍ الصِّدِّيقِ فَقَالَ أَتُصَلِّي لِلنَّاسِ فَأُقِيمَ قَالَ نَعَمْ ‏.‏ فَصَلَّى أَبُو بَكْرٍ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالنَّاسُ فِي الصَّلاَةِ فَتَخَلَّصَ حَتَّى وَقَفَ فِي الصَّفِّ فَصَفَّقَ النَّاسُ وَكَانَ أَبُو بَكْرٍ لاَ يَلْتَفِتُ فِي صَلاَتِهِ فَلَمَّا أَكْثَرَ النَّاسُ مِنَ التَّصْفِيقِ الْتَفَتَ أَبُو بَكْرٍ فَرَأَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَشَارَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنِ امْكُثْ مَكَانَكَ فَرَفَعَ أَبُو بَكْرٍ يَدَيْهِ فَحَمِدَ اللَّهَ عَلَى مَا أَمَرَهُ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ ذَلِكَ ثُمَّ اسْتَأْخَرَ حَتَّى اسْتَوَى فِي الصَّفِّ وَتَقَدَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى ثُمَّ انْصَرَفَ فَقَالَ ‏\"‏ يَا أَبَا بَكْرٍ مَا مَنَعَكَ أَنْ تَثْبُتَ إِذْ أَمَرْتُكَ ‏\"‏ ‏.‏ فَقَالَ أَبُو بَكْرٍ مَا كَانَ لاِبْنِ أَبِي قُحَافَةَ أَنْ يُصَلِّيَ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا لِي رَأَيْتُكُمْ أَكْثَرْتُمْ مِنَ التَّصْفِيحِ مَنْ نَابَهُ شَىْءٌ فِي صَلاَتِهِ فَلْيُسَبِّحْ فَإِنَّهُ إِذَا سَبَّحَ الْتُفِتَ إِلَيْهِ وَإِنَّمَا التَّصْفِيحُ لِلنِّسَاءِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Abu Hazim Salama ibn Dinar daripada Sahl ibn Said as-Saidi bahawa Rasulullah SAW pergi ke perkampungan Bani Amr ibn Auf untuk menyelesaikan perselisihan antara mereka. Waktu solat tiba, dan muazin datang kepada Abu Bakar as-Siddiq dan berkata, \"Bolehkah anda mengimamkan solat dan saya akan membaca iqama?\" Beliau berkata, \"Ya,\" dan Abu Bakar pun solat. Rasulullah SAW kembali ketika orang ramai sedang solat, dan baginda mendekat dan menyertai saf. Orang ramai bertepuk tangan, tetapi Abu Bakar tidak menoleh. Orang ramai menambah tepukan mereka, dan Abu Bakar menoleh dan melihat Rasulullah SAW, dan Rasulullah SAW memberi isyarat kepadanya untuk kekal di tempatnya. Abu Bakar mengangkat tangannya dan memuji Allah kerana Rasulullah SAW telah menyuruhnya berbuat demikian. Kemudian beliau berundur sehingga berada di dalam saf, dan Rasulullah SAW maju ke hadapan dan mengimamkan solat. Setelah selesai, baginda bersabda, \"Wahai Abu Bakar, apakah yang menghalangmu daripada kekal di tempatmu seperti yang aku perintahkan?\" Abu Bakar berkata, \"Tidak layak bagi Ibn Abi Quhafa untuk solat di hadapan Rasulullah SAW.\"\n\nRasulullah SAW bersabda, \"Kenapa aku lihat kamu semua bertepuk tangan begitu banyak? Jika sesuatu berlaku kepada kamu dalam solat, kamu hendaklah mengucapkan 'Subhana-llah' (Maha Suci Allah), dan apabila kamu mengucapkan 'Subhana-llah' kamu akan didengari. Bertepuk tangan hanya untuk wanita.\""
  },
  {
    "id": 34575,
    "hadith_number": 397,
    "tajuk_hadith": "Larangan Menoleh Ketika Solat",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Nafi' bahawa Ibn Umar tidak pernah menoleh ketika solat.",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، لَمْ يَكُنْ يَلْتَفِتُ فِي صَلاَتِهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Nafi' bahawa Ibn Umar tidak pernah menoleh ketika solat."
  },
  {
    "id": 34576,
    "hadith_number": 398,
    "tajuk_hadith": "Teguran Abdullah bin Umar Semasa Solat",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik bahawa Abu Ja'far al-Qari berkata,",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي جَعْفَرٍ الْقَارِئِ، أَنَّهُ قَالَ كُنْتُ أُصَلِّي وَعَبْدُ اللَّهِ بْنُ عُمَرَ وَرَائِي وَلاَ أَشْعُرُ فَالْتَفَتُّ فَغَمَزَنِي ‏.‏",
    "malay_translation": "\"Saya sedang solat, dan Abdullah bin Umar berada di belakang saya dan saya tidak menyedarinya. Kemudian saya berpaling dan dia menegur saya (sebagai tanda tidak bersetuju).\""
  },
  {
    "id": 34577,
    "hadith_number": 399,
    "tajuk_hadith": "Zaid bin Thabit Menyertai Saf dalam Keadaan Ruku'",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Ibn Shihab bahawa Abu Umama ibn Sahl ibn Hunayf berkata,",
    "english_text": "Yahya related to me from Malik from Ibn Shihab that Abu Umama ibn\nSahl ibn Hunayf said, \"Zayd ibn Thabit entered the mosque and found\nthe people in ruku, so he went into ruku and then moved slowly forward\nuntil he reached the row.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، أَنَّهُ قَالَ دَخَلَ زَيْدُ بْنُ ثَابِتٍ الْمَسْجِدَ فَوَجَدَ النَّاسَ رُكُوعًا فَرَكَعَ ثُمَّ دَبَّ حَتَّى وَصَلَ الصَّفَّ ‏.‏",
    "malay_translation": "\"Zaid bin Thabit masuk ke dalam masjid dan mendapati orang ramai sedang ruku', lalu beliau turut ruku' kemudian bergerak perlahan-lahan ke hadapan sehingga sampai ke saf.\""
  },
  {
    "id": 34578,
    "hadith_number": 400,
    "tajuk_hadith": "Abdullah bin Mas'ud Bergerak Maju Semasa Ruku'",
    "perawi_melayu": "Malik meriwayatkan kepadaku bahawa beliau mendengar Abdullah bin Mas'ud bergerak maju semasa ruku'.",
    "english_text": "Yahya related to me from Malik that he had heard that Abdullah\nibn Masud used to move forward while in ruku.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، كَانَ يَدِبُّ رَاكِعًا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik bahawa beliau telah mendengar bahawa Abdullah bin Mas'ud bergerak maju semasa dalam keadaan ruku'."
  },
  {
    "id": 34579,
    "hadith_number": 401,
    "tajuk_hadith": "Cara Memohon Berkat ke Atas Nabi Muhammad SAW",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Abdullah ibn Abi Bakr ibn Hazm daripada bapanya bahawa Amr ibn Sulaym az-Zuraqi berkata, \"Abu Humayd as-Saidi memberitahuku bahawa mereka bertanya kepada Rasulullah SAW, bagaimana mereka harus memohon berkat ke atas baginda, dan baginda menjawab bahawa mereka harus berkata, 'Ya Allah, berkatilah Muhammad dan isteri-isterinya dan keturunannya sebagaimana Engkau memberkati keluarga Ibrahim, dan berikan barakah kepada Muhammad dan isteri-isterinya dan keturunannya sebagaimana Engkau memberikan barakah kepada keluarga Ibrahim. Sesungguhnya Engkau Maha Terpuji lagi Maha Mulia.'\"",
    "english_text": "Yahya related to me from Malik from Abdullah ibn Abi Bakr ibn\nHazim from his father that Amr ibn Sulaym az-Zuraqi said, \"Abu Humayd\nas-Saidi told me that they asked the Messenger of Allah, may Allah\nbless him and grant him peace, how they were to ask for blessings upon\nhim and he replied that they should say, 'O Allah, bless Muhammad and\nhis wives and his descendants asYou blessed the family of Ibrahim, and\ngive baraka to Muhammad and his wives and his descendants as You gave\nbaraka to the family of Ibrahim. You are worthy of Praise and\nGlorious.'\"\n\n\nAllahumma salli ala Muhammad wa azwajihi wa alihi\nkama sallaita ala ali Ibrahim, wa barakaala Muhammad wa azwajihi wa\nalihi kama baraktaalaali Ibrahim, innaka Hamidu'm - Majid.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ حَزْمٍ، عَنْ أَبِيهِ، عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ، أَنَّهُ قَالَ أَخْبَرَنِي أَبُو حُمَيْدٍ السَّاعِدِيُّ، أَنَّهُمْ قَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نُصَلِّي عَلَيْكَ فَقَالَ ‏\n\"‏ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَأَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ وَبَارِكْ عَلَى مُحَمَّدٍ وَأَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Abdullah ibn Abi Bakr ibn Hazm, daripada bapanya, daripada Amr ibn Sulaym az-Zuraqi, bahawa dia berkata: Abu Humayd as-Saidi memberitahuku bahawa mereka bertanya: Wahai Rasulullah, bagaimana kami hendak berselawat ke atasmu? Baginda bersabda: \"Katakanlah: 'Allahumma salli ala Muhammad wa azwajihi wa dhurriyyatihi kama sallaita ala ali Ibrahim, wa barik ala Muhammad wa azwajihi wa dhurriyyatihi kama barakta ala ali Ibrahim, innaka Hamidum Majid.' (Ya Allah, berilah selawat kepada Muhammad, isteri-isterinya dan keturunannya sebagaimana Engkau telah memberi selawat kepada keluarga Ibrahim, dan berkatilah Muhammad, isteri-isterinya dan keturunannya sebagaimana Engkau telah memberkati keluarga Ibrahim. Sesungguhnya Engkau Maha Terpuji lagi Maha Mulia).\""
  },
  {
    "id": 34580,
    "hadith_number": 402,
    "tajuk_hadith": "Cara Berselawat ke atas Nabi Muhammad SAW",
    "perawi_melayu": "Diriwayatkan daripada Malik, daripada Nu'aim ibn Abdullah al-Mujmir, daripada Muhammad ibn Abdullah ibn Zayd, bahawa Abu Mas'ud al-Ansari berkata:",
    "english_text": "Yahya related to me from Malik from Nuaym ibn Abdullah al-\nMujmirthat Muhammad ibn Abdullah ibn Zayd told him that Abu Masud al\nAnsari said, \"The Messenger of Allah, may Allah bless him and grant\nhim peace, came to us at the gathering of Sad ibn Ubada. Bashir ibn\nSad said to him, 'Allah has ordered us to ask for blessings on you,\nMessenger of Allah. How should we do it?' The Messenger of Allah, may\nAllah bless him and grant him peace, remained silent until we wished\nwe had not asked him. Then he told us to say, 'O Allah, bless Muhammad\nand the family of Muhammad as You blessed Ibrahim, and give baraka to\nMuhammad and the family of Muhammad as You gave baraka to the family\nof Ibrahim. In all the worlds You are worthy of Praise and Glorious,'\nand then give the taslim as you have learnt.\"\n\n\nAllahumma salli\nala Muhammad wa ali Muhammad kama sallaita Ibrahim, wa baraka ala\nMuhammad wa ali Muhammad kama baraktaala ali Ibrahim. Fi'l alamin,\ninnaka Hamidu'm - Majid.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمُجْمِرِ، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ زَيْدٍ، أَنَّهُ أَخْبَرَهُ عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ، أَنَّهُ قَالَ أَتَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي مَجْلِسِ سَعْدِ بْنِ عُبَادَةَ فَقَالَ لَهُ بَشِيرُ بْنُ سَعْدٍ أَمَرَنَا اللَّهُ أَنْ نُصَلِّيَ عَلَيْكَ يَا رَسُولَ اللَّهِ فَكَيْفَ نُصَلِّي عَلَيْكَ قَالَ فَسَكَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى تَمَنَّيْنَا أَنَّهُ لَمْ يَسْأَلْهُ ثُمَّ قَالَ ‏\n\"‏ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ فِي الْعَالَمِينَ إِنَّكَ حَمِيدٌ مَجِيدٌ وَالسَّلاَمُ كَمَا قَدْ عَلِمْتُمْ ‏\"‏ ‏.‏",
    "malay_translation": "\"Rasulullah SAW datang kepada kami di majlis Sa'd ibn Ubadah. Bashir ibn Sa'd berkata kepadanya, 'Allah telah memerintahkan kami untuk berselawat ke atasmu, ya Rasulullah. Bagaimana cara kami berselawat ke atasmu?' Rasulullah SAW berdiam diri sehingga kami berharap agar kami tidak bertanya kepadanya. Kemudian baginda bersabda, 'Katakanlah: 'Ya Allah, berilah selawat ke atas Muhammad dan keluarga Muhammad sebagaimana Engkau telah memberi selawat ke atas Ibrahim, dan berilah keberkatan kepada Muhammad dan keluarga Muhammad sebagaimana Engkau telah memberi keberkatan kepada keluarga Ibrahim. Sesungguhnya Engkau Maha Terpuji lagi Maha Mulia di seluruh alam.' Dan berilah salam sebagaimana yang telah kamu ketahui.\"\n\n(Allahumma salli ala Muhammad wa ala ali Muhammad kama sallaita ala Ibrahim, wa barik ala Muhammad wa ala ali Muhammad kama barakta ala ali Ibrahim. Fil 'alamina innaka hamidum majid.)"
  },
  {
    "id": 34581,
    "hadith_number": 403,
    "tajuk_hadith": "Abdullah bin Umar Berdoa di Kubur Nabi SAW dan Sahabatnya",
    "perawi_melayu": "Diriwayatkan daripada Malik, daripada Abdullah bin Dinar, katanya:",
    "english_text": "Yahya related to me from Malik that Abdullah ibn Dinar said, \"I\nsaw Abdullah ibn Umar stop by the grave of the Prophet, may Allah\nbless him and grant him peace, and ask for blessings on the Prophet,\nmay Allah bless him and grant him peace, and on Abu Bakr and Umar.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، قَالَ رَأَيْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقِفُ عَلَى قَبْرِ النَّبِيِّ صلى الله عليه وسلم فَيُصَلِّي عَلَى النَّبِيِّ صلى الله عليه وسلم وَعَلَى أَبِي بَكْرٍ وَعُمَرَ ‏.‏",
    "malay_translation": "\"Saya melihat Abdullah bin Umar berhenti di kubur Nabi SAW, lalu dia berselawat ke atas Nabi SAW, Abu Bakr, dan Umar.\""
  },
  {
    "id": 34582,
    "hadith_number": 404,
    "tajuk_hadith": "Solat Sunat Rasulullah SAW Sebelum dan Selepas Solat Fardhu dan Selepas Jumaat",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Nafi daripada Ibn Umar",
    "english_text": "Yahya related to me from Malik from Nafi from Ibn Umar that the\nMessenger of Allah, may Allah bless him and grant him peace, used to\npray two rakas before dhuhr and two rakas after it, two rakas after\nmaghrib, in his house, and two rakas after isha. He did not pray after\njumua until he had left, and then he prayed two rakas.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي قَبْلَ الظُّهْرِ رَكْعَتَيْنِ وَبَعْدَهَا رَكْعَتَيْنِ وَبَعْدَ الْمَغْرِبِ رَكْعَتَيْنِ فِي بَيْتِهِ وَبَعْدَ صَلاَةِ الْعِشَاءِ رَكْعَتَيْنِ وَكَانَ لاَ يُصَلِّي بَعْدَ الْجُمُعَةِ حَتَّى يَنْصَرِفَ فَيَرْكَعَ رَكْعَتَيْنِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Nafi daripada Ibn Umar bahawa Rasulullah SAW biasanya solat dua rakaat sebelum Zuhur dan dua rakaat selepasnya, dua rakaat selepas Maghrib, di rumahnya, dan dua rakaat selepas Isyak. Baginda tidak solat selepas Jumaat sehingga baginda telah beredar, dan kemudian baginda solat dua rakaat."
  },
  {
    "id": 34583,
    "hadith_number": 405,
    "tajuk_hadith": "Rasulullah SAW Melihat di Belakang Baginda Ketika Solat",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Abu'z Zinad daripada al-Araj daripada Abu Hurairah",
    "english_text": "Yahya related to me from Malik from Abu'z Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Do you see the direction I am facing here? By Allah,\nneither your concentration nor your ruku is hidden from me. I can see\nyou behind my back.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَتَرَوْنَ قِبْلَتِي هَاهُنَا فَوَاللَّهِ مَا يَخْفَى عَلَىَّ خُشُوعُكُمْ وَلاَ رُكُوعُكُمْ إِنِّي لأَرَاكُمْ مِنْ وَرَاءِ ظَهْرِي ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Abu'z Zinad, daripada al-Araj, daripada Abu Hurairah, bahawa Rasulullah SAW bersabda, \"Adakah kamu semua melihat arah kiblatku di sini? Demi Allah, tidak tersembunyi daripadaku kekhusyukan kamu dan juga rukuk kamu. Sesungguhnya aku melihat kamu dari belakangku.\""
  },
  {
    "id": 34584,
    "hadith_number": 406,
    "tajuk_hadith": "Rasulullah SAW Pergi ke Quba' dengan Berjalan Kaki dan Berkendaraan",
    "perawi_melayu": "Diriwayatkan daripada Malik, daripada Nafi', daripada Abdullah ibn Umar RA",
    "english_text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat when the Messenger of Allah, may Allah bless him and grant him\npeace, used to go to Quba (to pray), he would walk as well as ride.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَأْتِي قُبَاءً رَاكِبًا وَمَاشِيًا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Nafi', daripada Abdullah ibn Umar RA, bahawa Rasulullah SAW biasanya pergi ke Quba' (untuk solat), baginda berjalan kaki dan juga berkendaraan."
  },
  {
    "id": 34585,
    "hadith_number": 407,
    "tajuk_hadith": "Larangan Minum Arak, Mencuri, Berzina, dan Mencuri dalam Solat",
    "perawi_melayu": "Yahya meriwayatkan kepadaku dari Malik dari Yahya bin Said dari an-Numan bin Murra",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said from an-Numan\nibn Murra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said,\"What about drunkenness, stealing and adultery? \"That\nwas before anything had been revealed about them. They said, \"Allah\nand His Messenger know best.\" He said, \"They are excesses and in them\nis a punishment. And the worst of thieves is the one who steals his\nprayer.\" They said, \"How does he steal his prayer, Messenger of\nAllah?\" He replied, \"He does not do ruku or sajda properly.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ النُّعْمَانِ بْنِ مُرَّةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَا تَرَوْنَ فِي الشَّارِبِ وَالسَّارِقِ وَالزَّانِي ‏\"‏ ‏.‏ وَذَلِكَ قَبْلَ أَنْ يُنْزَلَ فِيهِمْ ‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏\"‏ هُنَّ فَوَاحِشُ وَفِيهِنَّ عُقُوبَةٌ وَأَسْوَأُ السَّرِقَةِ الَّذِي يَسْرِقُ صَلاَتَهُ ‏\"‏ ‏.‏ قَالُوا وَكَيْفَ يَسْرِقُ صَلاَتَهُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ لاَ يُتِمُّ رُكُوعَهَا وَلاَ سُجُودَهَا ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Yahya bin Said, daripada an-Numan bin Murra bahawa Rasulullah SAW bersabda, \"Bagaimana pendapat kamu tentang peminum arak, pencuri, dan penzina?\" Perkara itu berlaku sebelum diturunkan hukum mengenai mereka. Mereka berkata, \"Allah dan Rasul-Nya lebih mengetahui.\" Baginda bersabda, \"Perbuatan-perbuatan itu adalah keji dan terdapat hukuman di dalamnya. Dan seburuk-buruk pencuri adalah orang yang mencuri solatnya.\" Mereka bertanya, \"Bagaimana dia mencuri solatnya, wahai Rasulullah?\" Baginda menjawab, \"Dia tidak menyempurnakan rukuk dan sujudnya.\""
  },
  {
    "id": 34586,
    "hadith_number": 408,
    "tajuk_hadith": "Anjuran Melaksanakan Sebahagian Solat di Rumah",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Hisham bin Urwa daripada ayahnya",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Do some of the prayers in your houses.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ اجْعَلُوا مِنْ صَلاَتِكُمْ فِي بُيُوتِكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Jadikanlah sebahagian daripada solat kamu di rumah kamu.\""
  },
  {
    "id": 34587,
    "hadith_number": 409,
    "tajuk_hadith": "Isyarat Kepala Ketika Sujud Bagi Orang Sakit",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Nafi' bahawa Abdullah ibn Umar",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ إِذَا لَمْ يَسْتَطِعِ الْمَرِيضُ السُّجُودَ أَوْمَأَ بِرَأْسِهِ إِيمَاءً وَلَمْ يَرْفَعْ إِلَى جَبْهَتِهِ شَيْئًا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Nafi', bahawa Abdullah ibn Umar pernah berkata, \"Apabila seorang yang sakit tidak mampu untuk sujud, dia hendaklah memberi isyarat dengan kepalanya, dan tidak mengangkat sesuatu ke dahinya.\""
  },
  {
    "id": 34588,
    "hadith_number": 410,
    "tajuk_hadith": "Abdullah bin Umar Mendahulukan Solat Fardu Apabila Tiba di Masjid Selepas Orang Ramai Selesai Solat",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Rabia ibn Abi Abd ar-Rahman",
    "english_text": "Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman\nthat if Abdullah ibn Umar arrived at the mosque and the people had\nalready prayed, he would begin with the obligatory prayer and not pray\nanything before it.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا جَاءَ الْمَسْجِدَ - وَقَدْ صَلَّى النَّاسُ - بَدَأَ بِصَلاَةِ الْمَكْتُوبَةِ وَلَمْ يُصَلِّ قَبْلَهَا شَيْئًا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Rabia ibn Abi Abd ar-Rahman bahawa Abdullah bin Umar, apabila tiba di masjid dan orang ramai telah selesai solat, beliau akan memulakan dengan solat fardu dan tidak solat sunat apa-apa pun sebelumnya."
  },
  {
    "id": 34589,
    "hadith_number": 411,
    "tajuk_hadith": "Memberi Isyarat Ketika Solat Apabila Diberi Salam",
    "perawi_melayu": "Diriwayatkan daripada Malik, daripada Nafi' bahawa Abdullah ibn Umar",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\npassed by a man who was praying and said, \"Peace be upon you,\" and the\nman replied to him. Abdullah ibn Umar returned to him and said, \"When\nsomeone says, 'Peace be upon you' to you while you are praying do not\nreply, but give a signal with your hand.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، مَرَّ عَلَى رَجُلٍ وَهُوَ يُصَلِّي فَسَلَّمَ عَلَيْهِ فَرَدَّ الرَّجُلُ كَلاَمًا فَرَجَعَ إِلَيْهِ عَبْدُ اللَّهِ بْنُ عُمَرَ فَقَالَ لَهُ إِذَا سُلِّمَ عَلَى أَحَدِكُمْ وَهُوَ يُصَلِّي فَلاَ يَتَكَلَّمْ وَلْيُشِرْ بِيَدِهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Nafi' bahawa Abdullah ibn Umar lalu di hadapan seorang lelaki yang sedang solat dan berkata, \"Salam sejahtera ke atas kamu,\" dan lelaki itu menjawab kepadanya. Abdullah ibn Umar kembali kepadanya dan berkata, \"Apabila seseorang mengucapkan, 'Salam sejahtera ke atas kamu' ketika kamu sedang solat, jangan menjawab, tetapi berilah isyarat dengan tanganmu.\""
  },
  {
    "id": 34590,
    "hadith_number": 412,
    "tajuk_hadith": "Menunaikan Solat yang Terlupa Ketika Mengikuti Imam",
    "perawi_melayu": "Yahya meriwayatkan kepadaku dari Malik dari Nafi bahawa Abdullah ibn Umar pernah berkata:",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to say, \"Someone who only remembers that he has forgotten a\nprayer when he is praying the next prayer behind an imam, should pray\nthe prayer he has forgotten after the imam has said the taslim, and\nthen pray the other one again.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ مَنْ نَسِيَ صَلاَةً فَلَمْ يَذْكُرْهَا إِلاَّ وَهُوَ مَعَ الإِمَامِ فَإِذَا سَلَّمَ الإِمَامُ فَلْيُصَلِّ الصَّلاَةَ الَّتِي نَسِيَ ثُمَّ لِيُصَلِّ بَعْدَهَا الأُخْرَى ‏.‏",
    "malay_translation": "\"Sesiapa yang terlupa solat dan tidak mengingatinya kecuali ketika dia sedang solat di belakang imam, maka apabila imam telah memberi salam, hendaklah dia solat solat yang dia lupa itu, kemudian solat yang berikutnya semula.\""
  },
  {
    "id": 34591,
    "hadith_number": 413,
    "tajuk_hadith": "Kebolehan Menghadap ke Mana-Mana Selepas Solat",
    "perawi_melayu": "Yahya meriwayatkan kepada saya daripada Malik, daripada Yahya bin Said, daripada Muhammad bin Yahya bin Habban, bahawa bapa saudaranya, Wasi bin Habban, berkata,",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said from Muhammad\nibn Yahya ibn Habban that his paternal uncle Wasi ibn Habban said, \"I\nwas praying, and Abdullah ibn Umar was resting his back on the wall of\nthe qibla. When I had finished the prayer I turned towards him on my\nleft hand side. Abdullah ibn Umar said, 'What stopped you from turning\naway to your right?' I replied, 'I saw you and turned towards you.'\nAbdullah said, 'You have spoken correctly. People say that you should\nturn away to your right, but when you pray, you can turn whichever way\nyou wish. If you like, to your right, and if you like, to your left.'\n\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنْ عَمِّهِ، وَاسِعِ بْنِ حَبَّانَ، أَنَّهُ قَالَ كُنْتُ أُصَلِّي وَعَبْدُ اللَّهِ بْنُ عُمَرَ مُسْنِدٌ ظَهْرَهُ إِلَى جِدَارِ الْقِبْلَةِ فَلَمَّا قَضَيْتُ صَلاَتِي انْصَرَفْتُ إِلَيْهِ مِنْ قِبَلِ شِقِّي الأَيْسَرِ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ مَا مَنَعَكَ أَنْ تَنْصَرِفَ عَنْ يَمِينِكَ قَالَ فَقُلْتُ رَأَيْتُكَ فَانْصَرَفْتُ إِلَيْكَ ‏.‏ قَالَ عَبْدُ اللَّهِ فَإِنَّكَ قَدْ أَصَبْتَ إِنَّ قَائِلاً يَقُولُ انْصَرِفْ عَنْ يَمِينِكَ فَإِذَا كُنْتَ تُصَلِّي فَانْصَرِفْ حَيْثُ شِئْتَ إِنْ شِئْتَ عَنْ يَمِينِكَ وَإِنْ شِئْتَ عَنْ يَسَارِكَ ‏.‏",
    "malay_translation": "\"Saya sedang solat, dan Abdullah bin Umar menyandarkan belakangnya pada dinding kiblat. Apabila saya selesai solat, saya berpaling ke arahnya dari sebelah kiri saya. Abdullah bin Umar berkata, 'Apa yang menghalangmu daripada berpaling ke kanan?' Saya menjawab, 'Saya melihatmu dan berpaling ke arahmu.' Abdullah berkata, 'Kamu telah berkata benar. Orang ramai mengatakan bahawa kamu harus berpaling ke kanan, tetapi apabila kamu solat, kamu boleh berpaling ke mana sahaja yang kamu suka. Jika kamu suka, ke kananmu, dan jika kamu suka, ke kirimu.'\""
  },
  {
    "id": 34592,
    "hadith_number": 414,
    "tajuk_hadith": "Larangan Solat di Tempat Unta Diberi Minum dan Kebolehan Solat di Kandang Kambing",
    "perawi_melayu": "Malik meriwayatkan daripada Hisham ibn Urwa daripada ayahnya, daripada seorang lelaki Muhajirin yang tidak dilihat ada masalah padanya, bahawa dia bertanya kepada Abdullah ibn Amr ibn al-As:",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that one of the muhajirun in whom he saw no harm asked Abdullah\nibn Amr ibn al-As, \"Can I pray in a place where camels are watered?\"\nAbdullah replied, \"No, but you can pray in a sheep-pen.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ رَجُلٍ، مِنَ الْمُهَاجِرِينَ لَمْ يَرَ بِهِ بَأْسًا أَنَّهُ سَأَلَ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ أَأُصَلِّي فِي عَطَنِ الإِبِلِ فَقَالَ عَبْدُ اللَّهِ لاَ وَلَكِنْ صَلِّ فِي مُرَاحِ الْغَنَمِ ‏.‏",
    "malay_translation": "\"Bolehkah saya solat di tempat unta diberi minum?\" Abdullah menjawab, \"Tidak, tetapi kamu boleh solat di kandang kambing.\""
  },
  {
    "id": 34593,
    "hadith_number": 415,
    "tajuk_hadith": "Kaedah Menggantikan Rakaat yang Tertinggal dalam Solat Maghrib",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Ibn Shihab, bahawa Said ibn al-Musayyab berkata,",
    "english_text": "Yahya related to me from Malik from Ibn Shihab that Said ibn al-\nMusayyab said, \"Which prayer is it when you remain in the sitting\nposition in every raka?'' Said said, \"It is maghrib when you miss one\nraka, and that is the sunna in all the prayers.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ مَا صَلاَةٌ يُجْلَسُ فِي كُلِّ رَكْعَةٍ مِنْهَا ثُمَّ قَالَ سَعِيدٌ هِيَ الْمَغْرِبُ إِذَا فَاتَتْكَ مِنْهَا رَكْعَةٌ وَكَذَلِكَ سُنَّةُ الصَّلاَةِ كُلُّهَا ‏.‏",
    "malay_translation": "\"Solat apakah yang mana seseorang duduk pada setiap rakaatnya?\" Said menjawab, \"Itu adalah solat Maghrib apabila kamu tertinggal satu rakaat daripadanya, dan itulah sunnah dalam semua solat.\""
  },
  {
    "id": 34594,
    "hadith_number": 416,
    "tajuk_hadith": "Nabi Muhammad SAW Solat Sambil Mendukung Umamah",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Amir bin Abdullah bin az-Zubair, daripada Amr bin Sulaym az-Zuraqi, daripada Abu Qatada al-Ansari",
    "english_text": "Yahya related to me from Malik from Amir ibn Abdullah ibn az-\nZubayr from Amr ibn Sulaym az-Zuraqi from Abu Qutada al-Ansari that\nthe Messenger of Allah, may Allah bless him and grant him peace, used\nto pray carrying Umama, who was the daughter of his daughter Zaynab by\nAbu'l As ibn Rabia ibn Abd Shams. When he prostrated, he put her down,\nand when he got up he carried her.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ، عَنْ أَبِي قَتَادَةَ الأَنْصَارِيِّ، ‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي وَهُوَ حَامِلٌ أُمَامَةَ بِنْتَ زَيْنَبَ بِنْتِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلأَبِي الْعَاصِ بْنِ رَبِيعَةَ بْنِ عَبْدِ شَمْسٍ فَإِذَا سَجَدَ وَضَعَهَا وَإِذَا قَامَ حَمَلَهَا ‏.‏",
    "malay_translation": "Bahawa Rasulullah SAW pernah solat sambil mendukung Umamah, anak kepada anak perempuannya, Zainab, daripada Abu al-'As bin Rabia bin Abd Shams. Apabila baginda sujud, baginda meletakkannya, dan apabila baginda bangun, baginda mendukungnya semula."
  },
  {
    "id": 34595,
    "hadith_number": 417,
    "tajuk_hadith": "Malaikat Bergilir-gilir dan Berkumpul pada Waktu Asar dan Subuh",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Abu'z-Zinad daripada al-Araj daripada Abu Hurairah",
    "english_text": "Yahya related to me from Abu'z-Zinad from al-Araj from Abu\nHurayra that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"A group of angels in the night and a group of angels in\nthe day alternate with each other among you, and gather together at\nthe time of the asr and fajr prayers. Then those that have spent the\nnight among you ascend, and He asks them, and He knows best, 'How did\nyou leave my slaves?' and they say, 'When we left them they were\npraying, and when we came to them they were praying.' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَتَعَاقَبُونَ فِيكُمْ مَلاَئِكَةٌ بِاللَّيْلِ وَمَلاَئِكَةٌ بِالنَّهَارِ وَيَجْتَمِعُونَ فِي صَلاَةِ الْعَصْرِ وَصَلاَةِ الْفَجْرِ ثُمَّ يَعْرُجُ الَّذِينَ بَاتُوا فِيكُمْ فَيَسْأَلُهُمْ وَهُوَ أَعْلَمُ بِهِمْ كَيْفَ تَرَكْتُمْ عِبَادِي فَيَقُولُونَ تَرَكْنَاهُمْ وَهُمْ يُصَلُّونَ وَأَتَيْنَاهُمْ وَهُمْ يُصَلُّونَ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Abu'z-Zinad daripada al-Araj daripada Abu Hurairah bahawa Rasulullah SAW bersabda, \"Sekumpulan malaikat pada waktu malam dan sekumpulan malaikat pada waktu siang bergilir-gilir antara kamu, dan berkumpul bersama pada waktu solat Asar dan solat Subuh. Kemudian mereka yang telah bermalam di antara kamu naik (ke langit), dan Dia bertanya kepada mereka, dan Dia lebih mengetahui tentang mereka, 'Bagaimana kamu meninggalkan hamba-hamba-Ku?' Mereka berkata, 'Ketika kami meninggalkan mereka, mereka sedang solat, dan ketika kami datang kepada mereka, mereka sedang solat.'\""
  },
  {
    "id": 34596,
    "hadith_number": 418,
    "tajuk_hadith": "Arahan untuk Abu Bakar Memimpin Solat dan Teguran kepada Para Isteri Nabi",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Hisham ibn Urwa daripada ayahnya daripada Aisyah, isteri Nabi SAW",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather from A'isha, the wife of the Prophet, may Allah bless him and\ngrant him peace, that the Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"Tell Abu Bakr to lead the people in prayer.\"\nA'isha said, \"Messenger of Allah, when Abu Bakr stands in your place\nhis voice does not reach the ears of the people because of his\nweeping, so tell Umar to lead the people in prayer.\" He said, \"Tell\nAbu Bakr to lead the people in prayer.\" A'isha continued, \"I told\nHafsa to tell him that when Abu Bakr stood in his place his voice did\nnot reach the ears of the people because of his weeping, and that he\nshould tell Umar to lead the people in prayer. Hafsa did so, and the\nMessenger of Allah, may Allah bless him and grant him peace, said,\n'You are the companions of Yusuf! (referring to the women who cut\ntheir hands when they saw the beauty of Yusuf). Tell Abu Bakr to lead\nthe people in prayer!' \"\n\n\nA'isha added that Hafsa said to her,\n\"I have never had anything good from you!\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ لِلنَّاسِ ‏\"‏ ‏.‏ فَقَالَتْ عَائِشَةُ إِنَّ أَبَا بَكْرٍ يَا رَسُولَ اللَّهِ إِذَا قَامَ فِي مَقَامِكَ لَمْ يُسْمِعِ النَّاسَ مِنَ الْبُكَاءِ فَمُرْ عُمَرَ فَلِيُصَلِّيَ لِلنَّاسِ ‏.‏ قَالَ ‏\"‏ مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ لِلنَّاسِ ‏\"‏ ‏.‏ قَالَتْ عَائِشَةُ فَقُلْتُ لِحَفْصَةَ قُولِي لَهُ إِنَّ أَبَا بَكْرٍ إِذَا قَامَ فِي مَقَامِكَ لَمْ يُسْمِعِ النَّاسَ مِنَ الْبُكَاءِ فَمُرْ عُمَرَ فَلْيُصَلِّ لِلنَّاسِ فَفَعَلَتْ حَفْصَةُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّكُنَّ لأَنْتُنَّ صَوَاحِبُ يُوسُفَ مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ لِلنَّاسِ ‏\"‏ ‏.‏ فَقَالَتْ حَفْصَةُ لِعَائِشَةَ مَا كُنْتُ لأُصِيبَ مِنْكِ خَيْرًا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Hisham ibn Urwa daripada ayahnya daripada Aisyah, isteri Nabi SAW, bahawa Rasulullah SAW bersabda, \"Suruh Abu Bakar mengimami solat untuk orang ramai.\" Aisyah berkata, \"Wahai Rasulullah, sesungguhnya Abu Bakar, apabila dia berdiri di tempatmu, suaranya tidak sampai kepada orang ramai kerana tangisannya, maka suruhlah Umar mengimami solat untuk orang ramai.\" Baginda bersabda, \"Suruh Abu Bakar mengimami solat untuk orang ramai.\" Aisyah berkata, \"Aku berkata kepada Hafsah, 'Katakanlah kepadanya bahawa Abu Bakar, apabila dia berdiri di tempatmu, suaranya tidak sampai kepada orang ramai kerana tangisannya, maka suruhlah Umar mengimami solat untuk orang ramai.'\" Hafsah pun melakukannya, lalu Rasulullah SAW bersabda, \"Sesungguhnya kamu semua adalah seperti sahabat-sahabat Yusuf! Suruh Abu Bakar mengimami solat untuk orang ramai!\" Hafsah berkata kepada Aisyah, \"Aku tidak pernah mendapat kebaikan daripadamu!\""
  },
  {
    "id": 34597,
    "hadith_number": 419,
    "tajuk_hadith": "Larangan Membunuh Orang yang Mengucap Syahadat dan Solat",
    "perawi_melayu": "Diriwayatkan daripada Malik, daripada Ibn Shihab, daripada Ata ibn Yazid al-Laythi, daripada Ubaydullah ibn Adi ibnal-Khiyar.",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Ata ibn Yazid\nal-Laythi that Ubaydullah ibn Adi ibnal-Khiyar said, \"Once when the\nMessenger of Allah, may Allah bless him and grant him peace, was\nsitting with some people, a man came to him and spoke secretly to him.\nNobody knew what he had said until the Messenger of Allah, may Allah\nbless him and grant him peace, disclosed that he had asked for\npermission to kill one of the hypocrites. When he disclosed this, the\nMessenger of Allah, may Allah bless him and grant him peace, said,\n'Doesn't he testify that there is no god but Allah and that Muhammad\nis the Messenger of Allah?'  The man replied, 'Of course, but he\nhasn't really done so.' He said, 'Doesn't he do the prayer?' and the\nman replied, 'Of course, but he doesn't really do the prayer.'  He\nsaid, may Allah bless him and grant him peace, 'Those are the ones\nwhom Allah has forbidden me (to kill).' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَدِيِّ بْنِ الْخِيَارِ، أَنَّهُ قَالَ بَيْنَمَا رَسُولُ اللَّهِ صلى الله عليه وسلم جَالِسٌ بَيْنَ ظَهْرَانَىِ النَّاسِ إِذْ جَاءَهُ رَجُلٌ فَسَارَّهُ فَلَمْ يُدْرَ مَا سَارَّهُ بِهِ حَتَّى جَهَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَإِذَا هُوَ يَسْتَأْذِنُهُ فِي قَتْلِ رَجُلٍ مِنَ الْمُنَافِقِينَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ جَهَرَ ‏\"‏ أَلَيْسَ يَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ ‏\"‏ ‏.‏ فَقَالَ الرَّجُلُ بَلَى وَلاَ شَهَادَةَ لَهُ ‏.‏ فَقَالَ ‏\"‏ أَلَيْسَ يُصَلِّي ‏\"‏ ‏.‏ قَالَ بَلَى وَلاَ صَلاَةَ لَهُ ‏.‏ فَقَالَ صلى الله عليه وسلم ‏\"‏ أُولَئِكَ الَّذِينَ نَهَانِي اللَّهُ عَنْهُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Ibn Shihab daripada Ata ibn Yazid al-Laythi bahawa Ubaydullah ibn Adi ibnal-Khiyar berkata, \"Ketika Rasulullah SAW sedang duduk bersama beberapa orang, seorang lelaki datang kepadanya dan berbicara secara rahsia kepadanya. Tiada siapa yang tahu apa yang telah dikatakannya sehingga Rasulullah SAW mendedahkan bahawa dia telah meminta izin untuk membunuh salah seorang munafik. Apabila dia mendedahkan ini, Rasulullah SAW bersabda, 'Bukankah dia bersaksi bahawa tiada tuhan selain Allah dan bahawa Muhammad adalah Rasulullah?' Lelaki itu menjawab, 'Ya, tetapi dia tidak benar-benar melakukannya.' Baginda bersabda, 'Bukankah dia melakukan solat?' dan lelaki itu menjawab, 'Ya, tetapi dia tidak benar-benar melakukan solat.' Baginda SAW bersabda, 'Mereka itulah orang-orang yang Allah telah melarang aku (membunuh) mereka.'\""
  },
  {
    "id": 34598,
    "hadith_number": 420,
    "tajuk_hadith": "Larangan Menjadikan Kubur sebagai Berhala yang Disembah",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Zayd ibn Aslam, daripada Ata ibn Yasar bahawa Rasulullah SAW bersabda.",
    "english_text": "Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn\nYasar that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"O Allah! Do not make my grave an idol that is\nworshipped. The anger on those who took the graves of their Prophets\nas places of prostration was terrible.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ اللَّهُمَّ لاَ تَجْعَلْ قَبْرِي وَثَنًا يُعْبَدُ اشْتَدَّ غَضَبُ اللَّهِ عَلَى قَوْمٍ اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ ‏\"‏ ‏.‏",
    "malay_translation": "Ya Allah! Janganlah Engkau jadikan kuburku sebagai berhala yang disembah. Sangat besar kemurkaan Allah terhadap kaum yang menjadikan kubur para nabi mereka sebagai tempat sujud (masjid)."
  },
  {
    "id": 34599,
    "hadith_number": 421,
    "tajuk_hadith": "Rasulullah SAW Solat di Rumah Utban Ibn Malik yang Buta",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Ibn Shihab daripada Mahmud ibn Rabi' al-Ansari",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Mahmud ibn\nRabi al-Ansari that Utban ibn Malik, who was a blind man, used to lead\nhis people in prayer, and he said to the Messenger of Allah, may Allah\nbless him and grant him peace, \"Sometimes it is dark and rainy and\nthere is a lot of water around outside, and I am a man who has lost\nhis sight. Messenger of Allah, pray in a certain place in my house so\nthat I can take it as a place to pray.\" The Messenger of Allah, may\nAllah bless him and grant him peace, came to him and said, \"Where\nwould you like me to pray?\" He indicated a place to him and the\nMessengerof Allah, may Allah bless him and grant him peace, prayed\nthere.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ مَحْمُودِ بْنِ الرَّبِيعِ الأَنْصَارِيِّ، أَنَّ عِتْبَانَ بْنَ مَالِكٍ، كَانَ يَؤُمُّ قَوْمَهُ وَهُوَ أَعْمَى وَأَنَّهُ قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِنَّهَا تَكُونُ الظُّلْمَةُ وَالْمَطَرُ وَالسَّيْلُ وَأَنَا رَجُلٌ ضَرِيرُ الْبَصَرِ فَصَلِّ يَا رَسُولَ اللَّهِ فِي بَيْتِي مَكَانًا أَتَّخِذْهُ مُصَلًّى ‏.‏ فَجَاءَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ أَيْنَ تُحِبُّ أَنْ أُصَلِّيَ ‏\"‏ ‏.‏ فَأَشَارَ لَهُ إِلَى مَكَانٍ مِنَ الْبَيْتِ فَصَلَّى فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Ibn Shihab daripada Mahmud ibn Rabi' al-Ansari bahawa Utban ibn Malik, seorang lelaki buta, biasa mengimamkan kaumnya dalam solat. Beliau berkata kepada Rasulullah SAW, \"Kadang-kadang keadaan gelap, hujan, dan banjir, dan saya seorang lelaki yang penglihatannya lemah. Ya Rasulullah, solatlah di suatu tempat di rumah saya supaya saya dapat menjadikannya sebagai tempat untuk bersolat.\" Rasulullah SAW datang kepadanya dan bertanya, \"Di mana kamu suka saya solat?\" Beliau menunjuk ke suatu tempat di dalam rumah, lalu Rasulullah SAW solat di situ."
  },
  {
    "id": 34600,
    "hadith_number": 422,
    "tajuk_hadith": "Berbaring di Masjid dengan Satu Kaki di Atas Kaki Lain",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Ibn Shihab, daripada Abbad ibn Tamim, daripada bapa saudaranya, bahawa dia melihat Rasulullah SAW berbaring di masjid dengan satu kaki di atas kaki yang lain.",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Abbad ibn Tamim from his paternal uncle that he saw the Messenger of Allah, may Allah bless him and grant him peace, lying down in the mosque with one foot on top of the other.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَمِّهِ، أَنَّهُ رَأَى رَسُولَ اللَّهِ صلى الله عليه وسلم مُسْتَلْقِيًا فِي الْمَسْجِدِ وَاضِعًا إِحْدَى رِجْلَيْهِ عَلَى الأُخْرَى ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Ibn Shihab, daripada Abbad ibn Tamim, daripada bapa saudaranya, bahawa dia melihat Rasulullah SAW berbaring di dalam masjid dengan meletakkan satu kaki di atas kaki yang lain."
  },
  {
    "id": 34601,
    "hadith_number": 423,
    "tajuk_hadith": "Amalan Umar bin al-Khattab dan Uthman bin Affan",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Ibn Shihab, daripada Said ibn al-Musayyab bahawa Umar ibn al-Khattab dan Uthman ibn Affan, semoga Allah meredhai mereka berdua, biasa melakukan perkara yang sama.",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Said ihn al-Musayyab that Umar ibn al Khattab and Uthman ibn Affan, may Allah be pleased with them, used to do the same.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، وَعُثْمَانَ بْنَ عَفَّانَ، - رضى الله عنهما - كَانَا يَفْعَلاَنِ ذَلِكَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Ibn Shihab, daripada Said ibn al-Musayyab bahawa Umar ibn al-Khattab dan Uthman ibn Affan, semoga Allah meredhai mereka berdua, biasa melakukan perkara yang sama."
  },
  {
    "id": 34602,
    "hadith_number": 424,
    "tajuk_hadith": "Perubahan Zaman: Ilmu, Amal, dan Keutamaan",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Yahya ibn Said bahawa Abdullah ibn Mas'ud berkata kepada seorang lelaki,",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said that Abdullah\nibn Masud said to a certain man, \"You are in a time when men of\nunderstanding (fuqaha) are many and Qur'an reciters are few, when the\nlimits of behaviour defined in the Qur'an are guarded and its letters\nare lost, when few people ask and many give, when they make the prayer\nlong and the khutba short, and put their actions before their desires.\nA time will come upon men when their fuqaha are few but their Qur'an\nreciters are many, when the letters of the Qur'an are guarded\ncarefully but its limits are lost, when many ask but few give, when\nthey make the khutba long but the prayer short, and put their desires\nbefore their actions.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، قَالَ لإِنْسَانٍ إِنَّكَ فِي زَمَانٍ كَثِيرٌ فُقَهَاؤُهُ قَلِيلٌ قُرَّاؤُهُ تُحْفَظُ فِيهِ حُدُودُ الْقُرْآنِ وَتُضَيَّعُ حُرُوفُهُ قَلِيلٌ مَنْ يَسْأَلُ كَثِيرٌ مَنْ يُعْطِي يُطِيلُونَ فِيهِ الصَّلاَةَ وَيَقْصُرُونَ الْخُطْبَةَ يُبَدُّونَ أَعْمَالَهُمْ قَبْلَ أَهْوَائِهِمْ وَسَيَأْتِي عَلَى النَّاسِ زَمَانٌ قَلِيلٌ فُقَهَاؤُهُ كَثِيرٌ قُرَّاؤُهُ يُحْفَظُ فِيهِ حُرُوفُ الْقُرْآنِ وَتُضَيَّعُ حُدُودُهُ كَثِيرٌ مَنْ يَسْأَلُ قَلِيلٌ مَنْ يُعْطِي يُطِيلُونَ فِيهِ الْخُطْبَةَ وَيَقْصُرُونَ الصَّلاَةَ يُبَدُّونَ فِيهِ أَهْوَاءَهُمْ قَبْلَ أَعْمَالِهِمْ ‏.‏",
    "malay_translation": "\"Sesungguhnya kamu berada di suatu zaman di mana fuqaha (orang yang berilmu) ramai dan qurra' (pembaca al-Qur'an) sedikit, batasan-batasan (hukum) al-Qur'an dipelihara tetapi huruf-hurufnya diabaikan, sedikit orang yang meminta dan ramai yang memberi, mereka memanjangkan solat dan memendekkan khutbah, serta mendahulukan amalan mereka daripada hawa nafsu mereka. Akan datang suatu zaman kepada manusia di mana fuqaha mereka sedikit tetapi qurra' mereka ramai, huruf-huruf al-Qur'an dipelihara tetapi batasan-batasannya (hukum) diabaikan, ramai orang yang meminta tetapi sedikit yang memberi, mereka memanjangkan khutbah dan memendekkan solat, serta mendahulukan hawa nafsu mereka daripada amalan mereka.\""
  },
  {
    "id": 34603,
    "hadith_number": 425,
    "tajuk_hadith": "Amalan Pertama yang Dihisab pada Hari Kiamat adalah Solat",
    "perawi_melayu": "Yahya ibn Said",
    "english_text": "Yahya related to me from Malik that Yahya ibn Said said, \"I have\nheard that the first of the actions of a slave to be considered on the\nday of rising is the prayer. If it is accepted from him, the rest of\nhis actions will be considered, and if it is not accepted from him,\nnone of his actions will be considered.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ بَلَغَنِي أَنَّ أَوَّلَ، مَا يُنْظَرُ فِيهِ مِنْ عَمَلِ الْعَبْدِ الصَّلاَةُ فَإِنْ قُبِلَتْ مِنْهُ نُظِرَ فِيمَا بَقِيَ مِنْ عَمَلِهِ وَإِنْ لَمْ تُقْبَلْ مِنْهُ لَمْ يُنْظَرْ فِي شَىْءٍ مِنْ عَمَلِهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik bahawa Yahya ibn Said berkata, \"Aku telah mendengar bahawa amalan pertama seorang hamba yang akan dipertimbangkan pada hari kiamat adalah solat. Jika solatnya diterima, maka amalan-amalan lainnya akan dipertimbangkan. Dan jika solatnya tidak diterima, maka tidak ada amalan lain yang akan dipertimbangkan daripadanya.\""
  },
  {
    "id": 34604,
    "hadith_number": 426,
    "tajuk_hadith": "Amalan yang Paling Disukai Rasulullah SAW",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Hisham bin Urwa, daripada ayahnya, bahawa Aisyah, isteri Nabi SAW, berkata: \"Amalan yang paling disukai oleh Rasulullah SAW adalah amalan yang dilakukan secara berterusan oleh pelakunya.\"",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that A'isha, the wife of the Prophet, may Allah bless him and\ngrant him peace, said, \"The actions which the Messenger of Allah, may\nAllah bless him and grant him peace, loved most were those which were\ndone most constantly.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ كَانَ أَحَبُّ الْعَمَلِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم الَّذِي يَدُومُ عَلَيْهِ صَاحِبُهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Hisham bin Urwa, daripada ayahnya, bahawa Aisyah, isteri Nabi SAW, berkata: \"Amalan yang paling disukai oleh Rasulullah SAW adalah amalan yang dilakukan secara berterusan oleh pelakunya.\""
  },
  {
    "id": 34605,
    "hadith_number": 427,
    "tajuk_hadith": "Keutamaan Solat: Sungai yang Menghapuskan Dosa",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik bahawa dia mendengar daripada Amir ibn Saad ibn Abi Waqqas bahawa bapanya berkata,",
    "english_text": "Yahya related to me from Malik that he had heard from Amir ibn\nSad ibn Abi Waqqas that his father said, \"There were two brothers, one\nof whom died forty nights before the other. The merit of the first was\nbeing mentioned in the presence of the Messenger of Allah, may Allah\nbless him and grant him peace, and he said, 'Wasn't the other one a\nmuslim?'  They said, 'Of course, Messenger of Allah, and there was no\nharm in him.'  The Messenger of Allah, may Allah bless him and grant\nhim peace, said, 'What will make you realise what his prayer has\nbrought him. The prayer is like a deep river of sweet water running by\nyour door into which you plunge five times a day. How much of your\ndirtiness do you think that will leave? You do not realise what his\nprayer has brought him.' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِيهِ، أَنَّهُ قَالَ كَانَ رَجُلاَنِ أَخَوَانِ فَهَلَكَ أَحَدُهُمَا قَبْلَ صَاحِبِهِ بِأَرْبَعِينَ لَيْلَةً فَذُكِرَتْ فَضِيلَةُ الأَوَّلِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَلَمْ يَكُنِ الآخَرُ مُسْلِمًا ‏\"‏ ‏.‏ قَالُوا بَلَى يَا رَسُولَ اللَّهِ وَكَانَ لاَ بَأْسَ بِهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَمَا يُدْرِيكُمْ مَا بَلَغَتْ بِهِ صَلاَتُهُ إِنَّمَا مَثَلُ الصَّلاَةِ كَمَثَلِ نَهْرٍ غَمْرٍ عَذْبٍ بِبَابِ أَحَدِكُمْ يَقْتَحِمُ فِيهِ كُلَّ يَوْمٍ خَمْسَ مَرَّاتٍ فَمَا تَرَوْنَ ذَلِكَ يُبْقِي مِنْ دَرَنِهِ فَإِنَّكُمْ لاَ تَدْرُونَ مَا بَلَغَتْ بِهِ صَلاَتُهُ ‏\"‏ ‏.‏",
    "malay_translation": "\"Ada dua orang lelaki bersaudara, salah seorang daripada mereka meninggal dunia empat puluh malam sebelum saudaranya. Kelebihan yang pertama disebut di hadapan Rasulullah SAW, dan baginda bersabda, 'Bukankah yang seorang lagi itu seorang Muslim?' Mereka berkata, 'Ya, Rasulullah, dan tidak ada keburukan padanya.' Rasulullah SAW bersabda, 'Apa yang membuatkan kamu sedar tentang apa yang telah dibawa oleh solatnya kepadanya. Solat itu seperti sungai yang dalam dengan air tawar yang mengalir di depan pintu rumah kamu di mana kamu terjun ke dalamnya lima kali sehari. Berapa banyakkah kekotoran kamu yang kamu fikir akan ditinggalkan olehnya? Kamu tidak sedar apa yang telah dibawa oleh solatnya kepadanya.'\""
  },
  {
    "id": 34606,
    "hadith_number": 428,
    "tajuk_hadith": "Anjuran Menumpukan Perhatian kepada Ibadah di Masjid",
    "perawi_melayu": "Yahya meriwayatkan kepadaku dari Malik bahwa dia mendengar bahwa jika seseorang melewati Ata ibn Yasar di masjid dengan sesuatu untuk diperdagangkan, dia akan memanggilnya dan bertanya, \"Apa yang kamu bawa? Apa yang kamu inginkan?\" Jika orang itu mengatakan bahwa dia ingin berdagang dengannya, dia akan berkata, \"Kamu memerlukan pasar dunia ini. Ini adalah pasar akhirat.\"",
    "english_text": "Yahya related to me from Malik that he had heard that if some one\npassed by Ata ibn Yasar in the mosque with something to trade, he\nwould call him and ask, \"What is the matter with you? What do you\nwant?\" If the man said that he wished to trade with him, he would say,\n\"You need the market of this world. This is the market of the next\nworld.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَطَاءَ بْنَ يَسَارٍ، كَانَ إِذَا مَرَّ عَلَيْهِ بَعْضُ مَنْ يَبِيعُ فِي الْمَسْجِدِ دَعَاهُ فَسَأَلَهُ مَا مَعَكَ وَمَا تُرِيدُ فَإِنْ أَخْبَرَهُ أَنَّهُ يُرِيدُ أَنْ يَبِيعَهُ قَالَ عَلَيْكَ بِسُوقِ الدُّنْيَا وَإِنَّمَا هَذَا سُوقُ الآخِرَةِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, bahawa dia telah mendengar bahawa jika seseorang melewati 'Ata ibn Yasar di dalam masjid dengan sesuatu untuk diniagakan, dia akan memanggilnya dan bertanya, \"Apa yang kamu bawa? Apa yang kamu mahu?\" Jika orang itu memberitahu bahawa dia ingin menjualnya, dia akan berkata, \"Pergilah ke pasar dunia. Sesungguhnya ini adalah pasar akhirat.\""
  },
  {
    "id": 34607,
    "hadith_number": 429,
    "tajuk_hadith": "Umar bin al-Khattab Mengkhususkan Kawasan untuk Perbualan Kosong dan Syair di Luar Masjid",
    "perawi_melayu": "Malik meriwayatkan bahawa beliau mendengar Umar ibn al-Khattab memperuntukkan suatu kawasan berdekatan masjid yang dinamakan al-Butayha dan berkata, \"Sesiapa yang ingin bercakap perkara yang tidak bermanfaat, melagukan syair, atau meninggikan suara, hendaklah pergi ke kawasan tersebut.\"",
    "english_text": "Yahya related to me from Malik that he had heard that Umar ibn\nal-Khattab set aside an area near the mosque called al-Butayha and\nsaid, \"Whoever wishes to talk nonsense or recite poetry or raise his\nvoice should go to that area.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، بَنَى رَحْبَةً فِي نَاحِيَةِ الْمَسْجِدِ تُسَمَّى الْبُطَيْحَاءَ وَقَالَ مَنْ كَانَ يُرِيدُ أَنْ يَلْغَطَ أَوْ يُنْشِدَ شِعْرًا أَوْ يَرْفَعَ صَوْتَهُ فَلْيَخْرُجْ إِلَى هَذِهِ الرَّحْبَةِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik bahawa beliau telah mendengar Umar ibn al-Khattab memperuntukkan suatu kawasan berdekatan masjid yang dinamakan al-Butayha dan berkata, \"Sesiapa yang ingin bercakap perkara yang tidak bermanfaat, melagukan syair, atau meninggikan suara, hendaklah pergi ke kawasan tersebut.\""
  },
  {
    "id": 34608,
    "hadith_number": 430,
    "tajuk_hadith": "Rukun Islam: Solat, Puasa, dan Zakat",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada bapa saudaranya Abu Suhayl ibn Malik, daripada bapanya, bahawa dia mendengar Talha ibn Ubaydullah berkata",
    "english_text": "Yahya related to me from Malik from his paternal uncle Abu Suhayl\nibn Malik that his father heard Talha ibn Ubaydullah say, \"Once one of\nthe people of Najd came to the Messenger of Allah, may Allah bless him\nand grant him peace. He had dishevelled hair and although his voice\ncould be heard we could not make out what he was saying until he drew\nnearer and then we found he was asking about Islam. The Messenger of\nAllah, may Allah bless him and grant him peace, said to him, 'There\nare five prayers during the day and the night.' He said, 'Do I have to\ndo anything else besides that?'  The Messenger of Allah, may Allah\nbless him and grant him peace, added, 'And fasting the month of\nRamadan.'  He said, 'Is there anything else I have to do?'  He said,\n'No, except what you do of your own accord.'  The Messenger of Allah,\nmay Allah bless him and grant him peace, mentioned zakat. The man\nsaid, 'Is there anything else that I have to do?' He said, 'No, except\nwhat you do of your own accord.'\n\n\nHe continued, \"The man went\naway saying, 'By Allah, I won't do any more than this, nor will I do\nany less.' The Messenger of Allah, may Allah bless him and grant him\npeace, said, 'That man will be successful, if he is telling the\ntruth.'",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَمِّهِ أَبِي سُهَيْلِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ طَلْحَةَ بْنَ عُبَيْدِ اللَّهِ، يَقُولُ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ أَهْلِ نَجْدٍ ثَائِرُ الرَّأْسِ يُسْمَعُ دَوِيُّ صَوْتِهِ وَلاَ نَفْقَهُ مَا يَقُولُ حَتَّى دَنَا فَإِذَا هُوَ يَسْأَلُ عَنِ الإِسْلاَمِ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ خَمْسُ صَلَوَاتٍ فِي الْيَوْمِ وَاللَّيْلَةِ ‏\"‏ ‏.‏ قَالَ هَلْ عَلَىَّ غَيْرُهُنَّ قَالَ ‏\"‏ لاَ إِلاَّ أَنْ تَطَّوَّعَ ‏\"‏ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَصِيَامُ شَهْرِ رَمَضَانَ ‏\"‏ ‏.‏ قَالَ هَلْ عَلَىَّ غَيْرُهُ قَالَ ‏\"‏ لاَ إِلاَّ أَنْ تَطَّوَّعَ ‏\"‏ ‏.‏ قَالَ وَذَكَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم الزَّكَاةَ ‏.‏ فَقَالَ هَلْ عَلَىَّ غَيْرُهَا قَالَ ‏\"‏ لاَ إِلاَّ أَنْ تَطَّوَّعَ ‏\"‏ ‏.‏ قَالَ فَأَدْبَرَ الرَّجُلُ وَهُوَ يَقُولُ وَاللَّهِ لاَ أَزِيدُ عَلَى هَذَا وَلاَ أَنْقُصُ مِنْهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَفْلَحَ الرَّجُلُ إِنْ صَدَقَ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki dari Najd datang kepada Rasulullah SAW dengan rambut yang kusut. Suaranya kedengaran kuat, tetapi kami tidak memahami apa yang dikatakannya sehingga dia mendekat. Rupa-rupanya dia bertanya tentang Islam. Rasulullah SAW bersabda kepadanya, 'Lima solat sehari semalam.' Dia bertanya, 'Adakah ada kewajipan lain selain itu?' Baginda menjawab, 'Tidak, kecuali jika kamu melakukan solat sunat.' Rasulullah SAW bersabda, 'Dan berpuasa pada bulan Ramadan.' Dia bertanya, 'Adakah ada kewajipan lain selain itu?' Baginda menjawab, 'Tidak, kecuali jika kamu berpuasa sunat.' Rasulullah SAW menyebut tentang zakat. Lelaki itu bertanya, 'Adakah ada kewajipan lain selain itu?' Baginda menjawab, 'Tidak, kecuali jika kamu bersedekah sunat.' Kemudian, lelaki itu berpaling sambil berkata, 'Demi Allah, aku tidak akan menambah atau mengurangkan daripada ini.' Rasulullah SAW bersabda, 'Berjayalah lelaki itu jika dia benar.'"
  },
  {
    "id": 34609,
    "hadith_number": 431,
    "tajuk_hadith": "Ikatan Syaitan Semasa Tidur dan Cara Melepaskannya",
    "perawi_melayu": "Diriwayatkan daripada Malik, daripada Abu az-Zinad, daripada al-Araj, daripada Abu Hurairah",
    "english_text": "Yahya related to me from Malik from Abu'z-Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Shaytan ties three knots at the back of your head\nwhen you sleep, and he seals the place of each knot with 'You have a\nlong night ahead, so sleep.' If you wake up and remember Allah, a knot\nis untied. If you do wudu, a knot is untied. If you pray, a knot is\nuntied, and morning finds you lively and in good spirits, and if not,\nmorning finds you in bad spirits and lazy.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَعْقِدُ الشَّيْطَانُ عَلَى قَافِيَةِ رَأْسِ أَحَدِكُمْ إِذَا هُوَ نَامَ ثَلاَثَ عُقَدٍ يَضْرِبُ مَكَانَ كُلِّ عُقْدَةٍ عَلَيْكَ لَيْلٌ طَوِيلٌ فَارْقُدْ فَإِنِ اسْتَيْقَظَ فَذَكَرَ اللَّهَ انْحَلَّتْ عُقْدَةٌ فَإِنْ تَوَضَّأَ انْحَلَّتْ عُقْدَةٌ فَإِنْ صَلَّى انْحَلَّتْ عُقَدُهُ فَأَصْبَحَ نَشِيطًا طَيِّبَ النَّفْسِ وَإِلاَّ أَصْبَحَ خَبِيثَ النَّفْسِ كَسْلاَنَ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Abu az-Zinad, daripada al-Araj, daripada Abu Hurairah bahawa Rasulullah SAW bersabda, \"Syaitan mengikat tiga ikatan di belakang kepala kamu ketika kamu tidur, dan dia memeteraikan setiap ikatan dengan 'Kamu mempunyai malam yang panjang di hadapan, jadi tidurlah.' Jika kamu bangun dan mengingati Allah, satu ikatan terurai. Jika kamu berwuduk, satu ikatan terurai. Jika kamu solat, semua ikatannya terurai, dan pagi mendapati kamu cergas dan bersemangat, dan jika tidak, pagi mendapati kamu dalam keadaan buruk dan malas.\""
  }
]
