[
  {
    "id": 35180,
    "hadith_number": 1002,
    "tajuk_hadith": "Pahala Mujahid di Jalan Allah",
    "perawi_melayu": "Yahya daripada Malik daripada Abu az-Zinad daripada al-Araj daripada Abu Hurairah",
    "english_text": "Yahya related to me from Malik from Abu'z-Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said \"Someone who does jihad in the way of Allah is like\nsomeone who fasts and prays constantly and who does not slacken from\nhis prayer and fasting until he returns.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَثَلُ الْمُجَاهِدِ فِي سَبِيلِ اللَّهِ كَمَثَلِ الصَّائِمِ الْقَائِمِ الدَّائِمِ الَّذِي لا يَفْتُرُ مِنْ صَلاَةٍ وَلاَ صِيَامٍ حَتَّى يَرْجِعَ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Abu az-Zinad, dari al-Araj, dari Abu Hurairah bahawa Rasulullah SAW bersabda:  \"Perumpamaan seorang mujahid di jalan Allah adalah seperti orang yang berpuasa dan mendirikan solat dengan istiqamah, yang tidak pernah lalai daripada solat dan puasa sehingga dia kembali.\""
  },
  {
    "id": 35181,
    "hadith_number": 1003,
    "tajuk_hadith": "Jaminan Allah SWT kepada Mujahid",
    "perawi_melayu": "Yahya daripada Malik daripada Abu az-Zinad daripada al-Araj daripada Abu Hurairah",
    "english_text": "Yahya related to me from Malik from Abu'z Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Allah guarantees either the Garden or a safe return\nto his home with whatever he has obtained of reward or booty, for the\none who does jihad in His way, if it is solely jihad and trust in his\npromise that brings him out of his house.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ تَكَفَّلَ اللَّهُ لِمَنْ جَاهَدَ فِي سَبِيلِهِ - لاَ يُخْرِجُهُ مِنْ بَيْتِهِ إِلاَّ الْجِهَادُ فِي سَبِيلِهِ وَتَصْدِيقُ كَلِمَاتِهِ - أَنْ يُدْخِلَهُ الْجَنَّةَ أَوْ يَرُدَّهُ إِلَى مَسْكَنِهِ الَّذِي خَرَجَ مِنْهُ مَعَ مَا نَالَ مِنْ أَجْرٍ أَوْ غَنِيمَةٍ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Abu az-Zinad, dari al-Araj, dari Abu Hurairah bahawa Rasulullah SAW bersabda:  \"Allah menjamin bagi sesiapa yang berjihad di jalan-Nya – yang keluar dari rumahnya hanyalah kerana jihad di jalan-Nya dan membenarkan janji-janji-Nya – bahawa Allah akan memasukkannya ke dalam syurga atau mengembalikannya ke rumahnya tempat dia keluar itu bersama apa yang telah diperolehinya sama ada pahala atau ganjaran.\" "
  },
  {
    "id": 35182,
    "hadith_number": 1004,
    "tajuk_hadith": "Pahala, Perlindungan, dan Beban Kuda",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Zayd ibn Aslam, daripada Abu Salih as-Samman, daripada Abu Hurairah",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الْخَيْلُ لِرَجُلٍ أَجْرٌ وَلِرَجُلٍ سِتْرٌ وَعَلَى رَجُلٍ وِزْرٌ فَأَمَّا الَّذِي هِيَ لَهُ أَجْرٌ فَرَجُلٌ رَبَطَهَا فِي سَبِيلِ اللَّهِ فَأَطَالَ لَهَا فِي مَرْجٍ أَوْ رَوْضَةٍ فَمَا أَصَابَتْ فِي طِيَلِهَا ذَلِكَ مِنَ الْمَرْجِ أَوِ الرَّوْضَةِ كَانَ لَهُ حَسَنَاتٌ وَلَوْ أَنَّهَا قَطَعَتْ طِيَلَهَا ذَلِكَ فَاسْتَنَّتْ شَرَفًا أَوْ شَرَفَيْنِ كَانَتْ آثَارُهَا وَأَرْوَاثُهَا حَسَنَاتٍ لَهُ وَلَوْ أَنَّهَا مَرَّتْ بِنَهَرٍ فَشَرِبَتْ مِنْهُ وَلَمْ يُرِدْ أَنْ يَسْقِيَ بِهِ كَانَ ذَلِكَ لَهُ حَسَنَاتٍ فَهِيَ لَهُ أَجْرٌ وَرَجُلٌ رَبَطَهَا تَغَنِّيًا وَتَعَفُّفًا وَلَمْ يَنْسَ حَقَّ اللَّهِ فِي رِقَابِهَا وَلاَ فِي ظُهُورِهَا فَهِيَ لِذَلِكَ سِتْرٌ وَرَجُلٌ رَبَطَهَا فَخْرًا وَرِيَاءً وَنِوَاءً لأَهْلِ الإِسْلاَمِ فَهِيَ عَلَى ذَلِكَ وِزْرٌ ‏\"‏ ‏.‏ وَسُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْحُمُرِ فَقَالَ ‏\"‏ لَمْ يَنْزِلْ عَلَىَّ فِيهَا شَىْءٌ إِلاَّ هَذِهِ الآيَةُ الْجَامِعَةُ الْفَاذَّةُ ‏{‏فَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ  وَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ ‏}‏‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Zayd ibn Aslam, daripada Abu Salih as-Samman, daripada Abu Hurairah bahawa Rasulullah SAW bersabda: \"Kuda itu bagi seseorang adalah pahala, bagi seseorang lagi adalah perlindungan, dan bagi seseorang pula adalah beban. Adapun yang menjadi pahala baginya ialah orang yang mengikat kudanya untuk jalan Allah, lalu dibiarkannya meragut rumput di padang rumput atau taman. Apa sahaja yang dimakan kudanya dalam lingkungan ikatannya dari padang rumput atau taman itu adalah pahala baginya. Dan sekiranya kudanya memutuskan ikatannya lalu berlari ke atas satu atau dua bukit, maka tapak kakinya dan najisnya adalah pahala baginya. Dan sekiranya kudanya melalui sebatang sungai lalu meminum airnya, sedangkan dia tidak berniat menyuruhnya minum, maka itu adalah pahala baginya; maka kuda itu adalah pahala baginya.\n\nDan seseorang lagi mengikat kudanya untuk kesenangan dan kehormatan, dan dia tidak melupakan hak Allah pada leher dan punggungnya (iaitu dia tidak menyeksa atau membebani kudanya secara berlebihan), maka kuda itu adalah perlindungan baginya.\n\nDan seseorang lagi mengikat kudanya kerana riak dan untuk menunjuk-nunjuk dan bermusuhan dengan umat Islam, maka kuda itu adalah beban baginya.\" \n\nRasulullah SAW ditanya tentang keldai, lalu Baginda bersabda: \"Tiada apa yang diturunkan kepadaKu tentangnya kecuali ayat yang menyeluruh ini:  'Barangsiapa yang mengerjakan kebaikan walaupun sebesar zarrah, nescaya dia akan melihat (balasannya), dan barangsiapa yang mengerjakan kejahatan walaupun sebesar zarrah, nescaya dia akan melihat (balasannya).'\" (Surah Az-Zalzalah, ayat 7-8)."
  },
  {
    "id": 35183,
    "hadith_number": 1005,
    "tajuk_hadith": "Darjat Tertinggi dalam Islam",
    "perawi_melayu": "Yahya meriwayatkan daripada Abdullah bin Abd ar-Rahman bin Mamar al-Ansari, daripada Ata bin Yasar",
    "english_text": "Yahya related to me from Abdullah ibn Abd ar-Rahman ibn Mamar al-\nAnsari that Ata ibn Yasar said that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"Shall I tell you who has the\nbest degree among people? A man who takes the rein of his horse to do\njihad in the way of Allah. Shall I tell you who has the best degree\namong people after him? A man who lives alone with a few sheep,\nperforms the prayer, pays the zakat, and worships Allah without\nassociating anything with him.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ مَعْمَرٍ الأَنْصَارِيِّ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَلاَ أُخْبِرُكُمْ بِخَيْرِ النَّاسِ مَنْزِلاً رَجُلٌ آخِذٌ بِعِنَانِ فَرَسِهِ يُجَاهِدُ فِي سَبِيلِ اللَّهِ أَلاَ أُخْبِرُكُمْ بِخَيْرِ النَّاسِ مَنْزِلاً بَعْدَهُ رَجُلٌ مُعْتَزِلٌ فِي غُنَيْمَتِهِ يُقِيمُ الصَّلاَةَ وَيُؤْتِي الزَّكَاةَ وَيَعْبُدُ اللَّهَ لاَ يُشْرِكُ بِهِ شَيْئًا ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Abdullah bin Abd ar-Rahman bin Mamar al-Ansari, daripada Ata bin Yasar bahawa Rasulullah SAW bersabda: \"Inginkah aku memberitahu kamu siapakah manusia yang paling baik kedudukannya? Iaitu lelaki yang memegang tali kekang kudanya untuk berjihad di jalan Allah. Inginkah aku memberitahu kamu siapakah manusia yang paling baik kedudukannya selepasnya? Iaitu lelaki yang menyendiri dengan beberapa ekor kambingnya, mendirikan solat, menunaikan zakat, dan beribadah kepada Allah tanpa menyekutukan-Nya dengan sesuatu pun.\""
  },
  {
    "id": 35184,
    "hadith_number": 1006,
    "tajuk_hadith": "Bai'ah Kepada Rasulullah SAW",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said, yang memberitahu bahawa Ubadah bin al-Walid bin Ubadah bin as-Samit memberitahu daripada bapanya, daripada datuknya,",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ أَخْبَرَنِي عُبَادَةُ بْنُ الْوَلِيدِ بْنِ عُبَادَةَ بْنِ الصَّامِتِ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ بَايَعْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى السَّمْعِ وَالطَّاعَةِ فِي الْيُسْرِ وَالْعُسْرِ وَالْمَنْشَطِ وَالْمَكْرَهِ وَأَنْ لاَ نُنَازِعَ الأَمْرَ أَهْلَهُ وَأَنْ نَقُولَ أَوْ نَقُومَ بِالْحَقِّ حَيْثُمَا كُنَّا لاَ نَخَافُ فِي اللَّهِ لَوْمَةَ لاَئِمٍ ‏.‏",
    "malay_translation": "Kami telah memberi bai'ah kepada Rasulullah SAW untuk mendengar dan mentaati dalam keadaan senang dan susah, bersemangat dan terpaksa, dan untuk tidak menentang pihak yang berkuasa, serta untuk menegakkan kebenaran di mana sahaja kami berada tanpa takut akan celaan sesiapa pun kerana Allah."
  },
  {
    "id": 35185,
    "hadith_number": 1007,
    "tajuk_hadith": "Kesabaran dalam Menghadapi Kesusahan",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Zayd bin Aslam",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، قَالَ كَتَبَ أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ إِلَى عُمَرَ بْنِ الْخَطَّابِ يَذْكُرُ لَهُ جُمُوعًا مِنَ الرُّومِ وَمَا يَتَخَوَّفُ مِنْهُمْ فَكَتَبَ إِلَيْهِ عُمَرُ بْنُ الْخَطَّابِ أَمَّا بَعْدُ فَإِنَّهُ مَهْمَا يَنْزِلْ بِعَبْدٍ مُؤْمِنٍ مِنْ مُنْزَلِ شِدَّةٍ يَجْعَلِ اللَّهُ بَعْدَهُ فَرَجًا وَإِنَّهُ لَنْ يَغْلِبَ عُسْرٌ يُسْرَيْنِ وَأَنَّ اللَّهَ تَعَالَى يَقُولُ فِي كِتَابِهِ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا اصْبِرُوا وَصَابِرُوا وَرَابِطُوا وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُفْلِحُونَ ‏}‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Zayd bin Aslam bahawa Abu Ubaidah bin al-Jarrah telah menulis surat kepada Umar bin al-Khattab, menceritakan kepadanya tentang tentera Rom yang ramai dan apa yang ditakutinya daripada mereka. Maka Umar bin al-Khattab menulis jawapan kepadanya: “Sesungguhnya apa sahaja kesusahan yang menimpa seorang hamba yang beriman, nescaya Allah akan memberikan kelegaan selepasnya. Dan sesungguhnya kesusahan itu tidak akan mengalahkan dua kemudahan. Dan Allah SWT berfirman di dalam kitab-Nya: Wahai orang-orang yang beriman, bersabarlah kamu, dan kuatkanlah kesabaran kamu, dan berpegang teguhlah (kepada agama kamu), dan bertaqwalah kepada Allah supaya kamu berjaya.” (Surah Al-Imran 3:200)"
  },
  {
    "id": 35186,
    "hadith_number": 1008,
    "tajuk_hadith": "Larangan Membawa Al-Quran ke Tanah Musuh",
    "perawi_melayu": "Yahya meriwayatkan dari Malik dari Nafi' dari Abdullah bin Umar",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid that the Messenger of Allah, may Allah bless him and grant him\npeace, forbade travelling with a Qur'an in the land of the enemy.\nMalik commented, \"That is out of fear that the enemy will get hold of\nit.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُسَافَرَ بِالْقُرْآنِ إِلَى أَرْضِ الْعَدُوِّ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Nafi', daripada Abdullah bin Umar bahawa baginda berkata, Rasulullah SAW melarang membawa Al-Quran ke negeri musuh. Malik berkata, \"Itu kerana bimbang musuh akan merampas (Al-Quran) itu.\""
  },
  {
    "id": 35187,
    "hadith_number": 1009,
    "tajuk_hadith": "Larangan membunuh wanita dan kanak-kanak",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Ibnu Syihab, dari anak lelaki Ka'ab bin Malik (Malik berpendapat bahawa Ibnu Syihab berkata ia adalah Abdur Rahman bin Ka'ab)",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنٍ لِكَعْبِ بْنِ مَالِكٍ، - قَالَ حَسِبْتُ أَنَّهُ قَالَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبٍ، أَنَّهُ - قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم الَّذِينَ قَتَلُوا ابْنَ أَبِي الْحُقَيْقِ عَنْ قَتْلِ النِّسَاءِ وَالْوِلْدَانِ - قَالَ - فَكَانَ رَجُلٌ مِنْهُمْ يَقُولُ بَرَّحَتْ بِنَا امْرَأَةُ ابْنِ أَبِي الْحُقَيْقِ بِالصِّيَاحِ فَأَرْفَعُ السَّيْفَ عَلَيْهَا ثُمَّ أَذْكُرُ نَهْىَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَكُفُّ وَلَوْلاَ ذَلِكَ اسْتَرَحْنَا مِنْهَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibnu Syihab, daripada seorang anak lelaki Ka’ab bin Malik – (Malik menyangka bahawa Ibnu Syihab berkata ia adalah Abdur Rahman bin Ka’ab) – bahawa Rasulullah SAW melarang mereka yang membunuh Ibnu Abi Huqaiq daripada membunuh wanita dan kanak-kanak.  Seorang lelaki daripada mereka berkata, “Isteri Ibnu Abi Huqaiq amat menyusahkan kami dengan jeritannya, lalu aku mengangkat pedang ke arahnya. Kemudian aku teringat akan larangan Rasulullah SAW, maka aku berhenti. Sekiranya bukan kerana itu, nescaya kami telah menghilangkannya.”"
  },
  {
    "id": 35188,
    "hadith_number": 1010,
    "tajuk_hadith": "Larangan membunuh wanita dan kanak-kanak",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Nafi', daripada Ibnu Umar",
    "english_text": "Yahya related to me from Malik from Nafi from Ibn Umar that the\nMessenger of Allah, may Allah bless him and grant him peace, saw the\ncorpse of a woman who had been slain in one of the raids, and he\ndisapproved of it and forbade the killing of women and children.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَأَى فِي بَعْضِ مَغَازِيهِ امْرَأَةً مَقْتُولَةً فَأَنْكَرَ ذَلِكَ وَنَهَى عَنْ قَتْلِ النِّسَاءِ وَالصِّبْيَانِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Nafi', daripada Ibnu Umar bahawa Rasulullah SAW, semasa salah satu daripada ekspedisi peperangan baginda, melihat mayat seorang wanita yang terbunuh. Baginda tidak menyukai perbuatan itu dan melarang pembunuhan wanita dan kanak-kanak."
  },
  {
    "id": 35189,
    "hadith_number": 1011,
    "tajuk_hadith": "Sepuluh Nasihat Abu Bakar As-Siddiq",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Yahya bin Said bahawa Abu Bakar As-Siddiq telah menghantar tentera ke Syam.  Beliau berjalan kaki bersama Yazid bin Abi Sufyan yang merupakan panglima salah satu pasukan. Didakwa bahawa Yazid berkata kepada Abu Bakar, \"Adakah engkau akan menunggang atau aku akan turun?\" Abu Bakar berkata, \"Aku tidak akan menunggang dan engkau tidak akan turun. Aku berniat langkah-langkahku ini adalah di jalan Allah.\" Kemudian Abu Bakar menasihati Yazid, \"Engkau akan menemui suatu kaum yang mendakwa telah menyerahkan diri sepenuhnya kepada Allah. Biarkan mereka dengan apa yang mereka dakwa telah mereka serahkan. Engkau akan menemui suatu kaum yang telah mencukur bahagian tengah kepala mereka, tebaslah apa yang telah mereka cukur itu dengan pedang.\"",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ، بَعَثَ جُيُوشًا إِلَى الشَّامِ فَخَرَجَ يَمْشِي مَعَ يَزِيدَ بْنِ أَبِي سُفْيَانَ - وَكَانَ أَمِيرَ رُبْعٍ مِنْ تِلْكَ الأَرْبَاعِ - فَزَعَمُوا أَنَّ يَزِيدَ قَالَ لأَبِي بَكْرٍ إِمَّا أَنْ تَرْكَبَ وَإِمَّا أَنْ أَنْزِلَ ‏.‏ فَقَالَ أَبُو بَكْرٍ مَا أَنْتَ بِنَازِلٍ وَمَا أَنَا بِرَاكِبٍ إِنِّي أَحْتَسِبُ خُطَاىَ هَذِهِ فِي سَبِيلِ اللَّهِ ثُمَّ قَالَ لَهُ إِنَّكَ سَتَجِدُ قَوْمًا زَعَمُوا أَنَّهُمْ حَبَّسُوا أَنْفُسَهُمْ لِلَّهِ فَذَرْهُمْ وَمَا زَعَمُوا أَنَّهُمْ حَبَّسُوا أَنْفُسَهُمْ لَهُ وَسَتَجِدُ قَوْمًا فَحَصُوا عَنْ أَوْسَاطِ رُءُوسِهِمْ مِنَ الشَّعَرِ فَاضْرِبْ مَا فَحَصُوا عَنْهُ بِالسَّيْفِ وَإِنِّي مُوصِيكَ بِعَشْرٍ لاَ تَقْتُلَنَّ امْرَأَةً وَلاَ صَبِيًّا وَلاَ كَبِيرًا هَرِمًا وَلاَ تَقْطَعَنَّ شَجَرًا مُثْمِرًا وَلاَ تُخَرِّبَنَّ عَامِرًا وَلاَ تَعْقِرَنَّ شَاةً وَلاَ بَعِيرًا إِلاَّ لِمَأْكُلَةٍ وَلاَ تَحْرِقَنَّ نَحْلاً وَلاَ تُفَرِّقَنَّهُ وَلاَ تَغْلُلْ وَلاَ تَجْبُنْ ‏.‏",
    "malay_translation": "Aku menasihatkan kepadamu sepuluh perkara: Janganlah engkau membunuh perempuan, kanak-kanak, atau orang tua yang uzur. Janganlah engkau menebang pokok yang berbuah. Janganlah engkau merosakkan tempat kediaman. Janganlah engkau menyembelih biri-biri atau unta kecuali untuk makanan. Janganlah engkau membakar lebah atau mencerai-beraikannya. Janganlah engkau mencuri daripada rampasan perang, dan janganlah engkau menjadi pengecut."
  },
  {
    "id": 35190,
    "hadith_number": 1012,
    "tajuk_hadith": "Arahan Umar Ibn Abdul Aziz Berdasarkan Sunnah Rasulullah SAW",
    "perawi_melayu": "Yahya melalui Malik",
    "english_text": "Yahya related to me from Malik that he had heard that Umar ibn\nAbd al-Aziz wrote to one of his governors, \"It has been passed down to\nus that when the Messenger of Allah, may Allah bless him and grant him\npeace, sent out a raiding party, he would say to them, 'Make your\nraids in the name of Allah in the way of Allah. Fight whoever denies\nAllah. Do not steal from the booty, and do not act treacherously. Do\nnot mutilate and do not kill children.'  Say the same to your armies\nand raiding parties, Allah willing. Peace be upon you.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، كَتَبَ إِلَى عَامِلٍ مِنْ عُمَّالِهِ أَنَّهُ بَلَغَنَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا بَعَثَ سَرِيَّةً يَقُولُ لَهُمُ ‏\n\"‏ اغْزُوا بِاسْمِ اللَّهِ فِي سَبِيلِ اللَّهِ تُقَاتِلُونَ مَنْ كَفَرَ بِاللَّهِ لاَ تَغُلُّوا وَلاَ تَغْدِرُوا وَلاَ تُمَثِّلُوا وَلاَ تَقْتُلُوا وَلِيدًا وَقُلْ ذَلِكَ لِجِيُوشِكَ وَسَرَايَاكَ إِنْ شَاءَ اللَّهُ وَالسَّلاَمُ عَلَيْكَ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik bahawa baginda telah mendengar bahawa Umar ibn Abd al-Aziz telah menulis kepada salah seorang gabenornya, \"Telah sampai kepada kami bahawa apabila Rasulullah SAW  menghantar pasukan serbu, baginda akan berkata kepada mereka, 'Serbulah dengan nama Allah di jalan Allah. Perangi sesiapa yang kufur kepada Allah. Jangan kamu mencuri daripada rampasan perang, dan jangan kamu khianat. Jangan kamu mencacatkan dan jangan kamu membunuh kanak-kanak.'  Sampaikanlah perkara yang sama kepada tentera dan pasukan serbu kamu, jika Allah menghendaki. Salam sejahtera ke atas kamu.\""
  },
  {
    "id": 35191,
    "hadith_number": 1013,
    "tajuk_hadith": "Larangan membunuh tawanan perang dan janji aman",
    "perawi_melayu": "Yahya melalui Malik daripada seorang lelaki dari Kufah",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ رَجُلٍ، مِنْ أَهْلِ الْكُوفَةِ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَتَبَ إِلَى عَامِلِ جَيْشٍ كَانَ بَعَثَهُ إِنَّهُ بَلَغَنِي أَنَّ رِجَالاً مِنْكُمْ يَطْلُبُونَ الْعِلْجَ حَتَّى إِذَا أَسْنَدَ فِي الْجَبَلِ وَامْتَنَعَ قَالَ رَجُلٌ مَطْرَسْ - يَقُولَ لاَ تَخَفْ - فَإِذَا أَدْرَكَهُ قَتَلَهُ وَإِنِّي وَالَّذِي نَفْسِي بِيَدِهِ لاَ أَعْلَمُ مَكَانَ وَاحِدٍ فَعَلَ ذَلِكَ إِلاَّ ضَرَبْتُ عُنُقَهُ ‏.‏ قَالَ يَحْيَى سَمِعْتُ مَالِكًا يَقُولُ لَيْسَ هَذَا الْحَدِيثُ بِالْمُجْتَمَعِ عَلَيْهِ وَلَيْسَ عَلَيْهِ الْعَمَلُ ‏.‏ وَسُئِلَ مَالِكٌ عَنِ الإِشَارَةِ بِالأَمَانِ أَهِيَ بِمَنْزِلَةِ الْكَلاَمِ فَقَالَ نَعَمْ وَإِنِّي أَرَى أَنْ يُتَقَدَّمَ إِلَى الْجُيُوشِ أَنْ لاَ تَقْتُلُوا أَحَدًا أَشَارُوا إِلَيْهِ بِالأَمَانِ لأَنَّ الإِشَارَةَ عِنْدِي بِمَنْزِلَةِ الْكَلاَمِ وَإِنَّهُ بَلَغَنِي أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ قَالَ مَا خَتَرَ قَوْمٌ بِالْعَهْدِ إِلاَّ سَلَّطَ اللَّهُ عَلَيْهِمُ الْعَدُوَّ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada seorang lelaki dari penduduk Kufah bahawa Umar bin al-Khattab menulis kepada ketua tentera yang diutusnya:  \"Sesungguhnya telah sampai kepadaku bahawa sebahagian dari kalangan kamu mengejar musuh sehingga dia berlindung di tempat tinggi. Kemudian seorang lelaki berkata kepadanya dalam bahasa Parsi, 'Jangan takut!', lalu apabila dia sampai kepadanya, dia membunuhnya. Demi Allah yang memegang jiwaku, sekiranya aku mengetahui sesiapa yang melakukan perkara itu, nescaya aku akan memenggal kepalanya.\" Yahya berkata, aku mendengar Malik berkata, \"Hadis ini tidak disepakati, dan ia tidak boleh diamalkan.\"  Malik ditanya tentang isyarat (lambang) aman, adakah ia sama taraf dengan perkataan?  Beliau berkata, \"Ya.  Aku berpendapat bahawa boleh dimaklumkan kepada tentera supaya jangan membunuh sesiapa yang diberi isyarat aman, kerana menurutku isyarat itu sama taraf dengan perkataan. Sesungguhnya telah sampai kepadaku bahawa Abdullah bin Abbas berkata, 'Tidak ada satu kaum pun yang mengkhianati janji melainkan Allah akan memberikan musuh kuasa ke atas mereka.'\" "
  },
  {
    "id": 35192,
    "hadith_number": 1014,
    "tajuk_hadith": "Amalan Abdullah ibn Umar dalam Sedekah",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Nafi' daripada Abdullah ibn Umar",
    "english_text": "Yahya related to me from Malik from Nafi that when Abdullah ibn\nUmar gave something in the way of Allah, he would say to its owner,\n\"When you reach Wadi'l-Qura, (on the outskirts of Madina) then it is\nyour affair.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ إِذَا أَعْطَى شَيْئًا فِي سَبِيلِ اللَّهِ يَقُولُ لِصَاحِبِهِ إِذَا بَلَغْتَ وَادِيَ الْقُرَى فَشَأْنَكَ بِهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Nafi', daripada Abdullah bin Umar bahawa baginda apabila memberi sesuatu di jalan Allah, baginda akan berkata kepada pemiliknya, \"Apabila engkau sampai ke Wadi al-Qura (di pinggir Madinah), maka ia menjadi urusanmu.\" "
  },
  {
    "id": 35193,
    "hadith_number": 1015,
    "tajuk_hadith": "Harta Peralatan Ghazwah",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Yahya ibn Said bahawa Said ibn al-Musayyab berkata,",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، كَانَ يَقُولُ إِذَا أُعْطِيَ الرَّجُلُ الشَّىْءَ فِي الْغَزْوِ فَيَبْلُغُ بِهِ رَأْسَ مَغْزَاتِهِ فَهُوَ لَهُ ‏.‏ وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ أَوْجَبَ عَلَى نَفْسِهِ الْغَزْوَ فَتَجَهَّزَ حَتَّى إِذَا أَرَادَ أَنْ يَخْرُجَ مَنَعَهُ أَبَوَاهُ أَوْ أَحَدُهُمَا فَقَالَ لاَ يُكَابِرْهُمَا وَلَكِنْ يُؤَخِّرُ ذَلِكَ إِلَى عَامٍ آخَرَ فَأَمَّا الْجِهَازُ فَإِنِّي أَرَى أَنْ يَرْفَعَهُ حَتَّى يَخْرُجَ بِهِ فَإِنْ خَشِيَ أَنْ يَفْسُدَ بَاعَهُ وَأَمْسَكَ ثَمَنَهُ حَتَّى يَشْتَرِيَ بِهِ مَا يُصْلِحُهُ لِلْغَزْوِ فَإِنْ كَانَ مُوسِرًا يَجِدُ مِثْلَ جِهَازِهِ إِذَا خَرَجَ فَلْيَصْنَعْ بِجِهَازِهِ مَا شَاءَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Yahya ibn Said bahawa Said ibn al-Musayyab berkata, \"Apabila seseorang lelaki diberi sesuatu untuk digunakan dalam peperangan, dan dia membawanya ke medan perang, maka ia menjadi miliknya.\" \n\nMalik ditanya tentang seorang lelaki yang mewajibkan dirinya untuk berperang, maka dia bersiap sedia.  Kemudian, apabila dia hendak keluar, ibu bapanya atau salah seorang daripadanya menghalangnya.  Maka beliau berkata, \"Dia tidak harus menentang mereka, tetapi hendaklah dia menangguhkannya sehingga tahun hadapan.  Adapun peralatannya, aku berpendapat bahawa dia hendaklah menyimpannya sehingga dia keluar untuk berperang.  Jika dia bimbang ia akan rosak, hendaklah dia menjualnya dan menyimpan harganya sehingga dia boleh membeli apa yang diperlukan untuk peperangan. Jika dia berkemampuan, dia akan menemui peralatan seperti itu apabila dia keluar, maka hendaklah dia melakukan apa sahaja yang disukainya dengan peralatannya.\""
  },
  {
    "id": 35194,
    "hadith_number": 1016,
    "tajuk_hadith": "Pembahagian Ghanipah di Najd",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Nafi' daripada Abdullah bin Umar",
    "english_text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsent a raiding party which included Abdullah ibn Umar near Najd. They\nplundered many camels and their portions were twelve or eleven camels\neach. They divided it up camel by camel.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ سَرِيَّةً فِيهَا عَبْدُ اللَّهِ بْنُ عُمَرَ قِبَلَ نَجْدٍ فَغَنِمُوا إِبِلاً كَثِيرَةً فَكَانَ سُهْمَانُهُمُ اثْنَىْ عَشَرَ بَعِيرًا أَوْ أَحَدَ عَشَرَ بَعِيرًا وَنُفِّلُوا بَعِيرًا بَعِيرًا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Nafi' daripada Abdullah bin Umar bahawa Rasulullah SAW telah menghantar satu pasukan serbuan yang termasuk Abdullah bin Umar ke arah Najd. Mereka telah menawan banyak unta, dan bahagian masing-masing ialah dua belas atau sebelas ekor unta. Mereka membahagikannya seekor demi seekor."
  },
  {
    "id": 35195,
    "hadith_number": 1017,
    "tajuk_hadith": "Pembahagian Ghaniimah dalam Ekspedisi Tentera",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Yahya ibn Said bahawa beliau mendengar Said ibn al-Musayyab berkata",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ كَانَ النَّاسُ فِي الْغَزْوِ إِذَا اقْتَسَمُوا غَنَائِمَهُمْ يَعْدِلُونَ الْبَعِيرَ بِعَشْرِ شِيَاهٍ ‏.‏ قَالَ مَالِكٌ فِي الأَجِيرِ فِي الْغَزْوِ إِنَّهُ إِنْ كَانَ شَهِدَ الْقِتَالَ وَكَانَ مَعَ النَّاسِ عِنْدَ الْقِتَالِ وَكَانَ حُرًّا فَلَهُ سَهْمُهُ وَإِنْ لَمْ يَفْعَلْ ذَلِكَ فَلاَ سَهْمَ لَهُ وَأَرَى أَنْ لاَ يُقْسَمَ إِلاَّ لِمَنْ شَهِدَ الْقِتَالَ مِنَ الأَحْرَارِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said, bahawa beliau mendengar Said bin al-Musayyab berkata, \"Ketika orang ramai dalam ekspedisi tentera membahagikan ghanimah, mereka menyamakan seekor unta dengan sepuluh ekor kambing.\"  Malik berkata tentang pekerja upahan dalam ekspedisi tentera, \"Jika dia hadir dalam pertempuran dan bersama-sama orang ramai ketika pertempuran dan dia seorang yang merdeka, maka dia berhak mendapat bahagiannya. Jika dia tidak hadir, dia tidak berhak mendapat bahagian.\" Malik menyimpulkan, \"Pendapatku, ghanimah hanya dibahagikan kepada orang-orang merdeka yang hadir dalam pertempuran.\""
  },
  {
    "id": 35196,
    "hadith_number": 1018,
    "tajuk_hadith": "Hukum Askar Musuh di Pesisir Tanah Islam",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Malik berkata mengenai tentera musuh yang dijumpai di pesisir pantai tanah Islam, dan mereka mendakwa bahawa mereka adalah pedagang dan laut telah menghanyutkan mereka ke darat, manakala orang Islam tidak dapat mengesahkan apa-apa daripada itu kecuali kapal mereka rosak, atau mereka dahaga dan telah mendarat tanpa kebenaran orang Islam, \"Saya fikir ia terpulang kepada imam untuk memberikan pendapatnya tentang mereka, dan saya tidak fikir cukai sepersatu diambil daripada mereka.\""
  },
  {
    "id": 35197,
    "hadith_number": 1019,
    "tajuk_hadith": "Hukum Memakan Makanan di Wilayah Musuh",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Malik berkata, \"Saya tidak nampak sebarang kemudaratan jika orang Islam memakan apa sahaja makanan yang mereka temui di wilayah musuh sebelum rampasan perang dibahagikan.\"\n\nMalik berkata lagi, \"Saya berpendapat bahawa unta, lembu dan kambing (yang dirampas sebagai ghanimah) dianggap sebagai makanan yang boleh dimakan oleh orang Islam di wilayah musuh. Jika ia tidak boleh dimakan sehingga orang ramai berkumpul untuk pembahagian dan rampasan perang telah diagihkan di kalangan mereka, ia akan memudaratkan tentera. Saya tidak nampak sebarang bantahan untuk memakan perkara sedemikian dalam had yang munasabah. Bagaimanapun, saya tidak fikir sesiapa pun patut menyimpannya untuk dibawa pulang kepada keluarganya.\"\n\nMalik ditanya sama ada ia sesuai bagi seseorang yang mendapatkan makanan di wilayah musuh dan memakannya serta menyimpan sebahagiannya untuk dimakan bersama keluarganya, atau menjualnya sebelum pulang ke negaranya dan menggunakan harganya. Beliau berkata, \"Jika dia menjualnya ketika dalam ekspedisi tentera, saya fikir dia perlu memasukkan harganya ke dalam ghanimah orang Islam. Jika dia membawanya pulang ke negaranya, saya tidak nampak sebarang bantahan jika dia memakannya dan menggunakannya jika ia adalah sesuatu yang kecil dan tidak penting.\""
  },
  {
    "id": 35198,
    "hadith_number": 1020,
    "tajuk_hadith": "Harta rampasan perang dan hamba yang kembali kepada pemiliknya",
    "perawi_melayu": "Yahya dari Malik",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدًا، لِعَبْدِ اللَّهِ بْنِ عُمَرَ أَبَقَ وَأَنَّ فَرَسًا لَهُ عَارَ فَأَصَابَهُمَا الْمُشْرِكُونَ ثُمَّ غَنِمَهُمَا الْمُسْلِمُونَ فَرُدَّا عَلَى عَبْدِ اللَّهِ بْنِ عُمَرَ وَذَلِكَ قَبْلَ أَنْ تُصِيبَهُمَا الْمَقَاسِمُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik bahawa telah sampai kepadanya bahawa seorang hamba Abdullah bin Umar melarikan diri dan seekor kuda miliknya telah hilang. Kemudian, orang-orang musyrik telah mendapatkan keduanya. Selepas itu, orang Islam telah merampas kembali keduanya dan dikembalikan kepada Abdullah bin Umar sebelum pembahagian ghanimah berlaku.\n\nMalik berkata mengenai harta benda orang Islam yang dirampas oleh musuh, \"Sekiranya ia disedari sebelum pembahagian, maka ia dikembalikan kepada pemiliknya. Apa sahaja yang telahpun diagihkan tidak akan dikembalikan kepada sesiapa.\"\n\nMalik ditanya mengenai seorang lelaki yang hamba mudanya dirampas oleh orang musyrik dan kemudian dirampas kembali oleh orang Islam. Malik berkata, \"Pemiliknya lebih berhak kepadanya tanpa perlu membayar harga atau nilai atau menanggung sebarang kerugian sebelum pembahagian berlaku. Sekiranya pembahagian telah pun berlaku, maka saya berpendapat bahawa hamba itu milik tuannya dengan harganya jika tuan itu mahu mengambilnya kembali.\"\n\nBerkenaan seorang umm walad lelaki Islam yang telah dirampas oleh orang musyrik, kemudian dirampas kembali oleh orang Islam dan diagihkan dalam pembahagian ghanimah, lalu diiktiraf oleh tuannya selepas pembahagian, Malik berkata, \"Dia tidak boleh diperhamba. Saya berpendapat bahawa Imam harus membayar tebusan untuknya bagi pihak tuannya. Sekiranya Imam tidak melakukannya, maka tuannya mesti membayar tebusan untuknya dan tidak meninggalkannya. Saya tidak berpendapat bahawa dia harus diperhamba oleh sesiapa yang mengambilnya dan persetubuhan dengannya adalah haram. Dia berada dalam kedudukan seorang wanita yang merdeka kerana tuannya akan diwajibkan membayar pampasan jika dia mencederakan seseorang, maka dia berada dalam kedudukan yang sama (seperti isteri). Tuannya tidak boleh membiarkan ibu kepada anaknya diperhamba dan persetubuhan dengannya adalah haram.\"\n\nMalik ditanya mengenai seseorang yang pergi ke wilayah musuh untuk membayar tebusan atau berniaga, dan dia membeli seorang lelaki merdeka atau hamba, atau mereka diberikan kepadanya.  Beliau berkata, \"Bagi lelaki merdeka, harga yang dibelinya adalah hutang terhadap lelaki itu dan dia tidak diperhamba. Sekiranya tawanan itu diberikan kepadanya secara percuma, dia adalah merdeka dan tidak berhutang apa-apa melainkan lelaki itu memberi sesuatu sebagai balasan. Itu adalah hutang terhadap lelaki merdeka, sama seperti tebusan telah dibayar untuknya. Bagi seorang hamba, bekas tuannya boleh memilih untuk mengambilnya kembali dan membayar harganya kepada lelaki yang membelinya atau dia boleh meninggalkannya, mengikut kehendaknya. Sekiranya dia diberikan kepada lelaki itu, bekas tuannya lebih berhak kepadanya, dan dia tidak berhutang apa-apa untuknya melainkan lelaki itu memberi sesuatu sebagai balasan. Apa sahaja yang diberikannya untuk hamba itu adalah kerugian terhadap tuan jika dia mahu mengambilnya kembali.\" "
  },
  {
    "id": 35199,
    "hadith_number": 1021,
    "tajuk_hadith": "Ghanimah Abu Qatadah di Perang Hunain",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Yahya bin Said, dari Umar bin Kathir bin Aflah, dari Abu Muhammad, mawla Abu Qatadah, dari Abu Qatadah bin Ribi'i",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عُمَرَ بْنِ كَثِيرِ بْنِ أَفْلَحَ، عَنْ أَبِي مُحَمَّدٍ، مَوْلَى أَبِي قَتَادَةَ عَنْ أَبِي قَتَادَةَ بْنِ رِبْعِيٍّ، أَنَّهُ قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ حُنَيْنٍ فَلَمَّا الْتَقَيْنَا كَانَتْ لِلْمُسْلِمِينَ جَوْلَةٌ - قَالَ - فَرَأَيْتُ رَجُلاً مِنَ الْمُشْرِكِينَ قَدْ عَلاَ رَجُلاً مِنَ الْمُسْلِمِينَ - قَالَ - فَاسْتَدَرْتُ لَهُ حَتَّى أَتَيْتُهُ مِنْ وَرَائِهِ فَضَرَبْتُهُ بِالسَّيْفِ عَلَى حَبْلِ عَاتِقِهِ فَأَقْبَلَ عَلَىَّ فَضَمَّنِي ضَمَّةً وَجَدْتُ مِنْهَا رِيحَ الْمَوْتِ ثُمَّ أَدْرَكَهُ الْمَوْتُ فَأَرْسَلَنِي - قَالَ - فَلَقِيتُ عُمَرَ بْنَ الْخَطَّابِ فَقُلْتُ مَا بَالُ النَّاسِ فَقَالَ أَمْرُ اللَّهِ ‏.‏ ثُمَّ إِنَّ النَّاسَ رَجَعُوا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ قَتَلَ قَتِيلاً لَهُ عَلَيْهِ بَيِّنَةٌ فَلَهُ سَلَبُهُ ‏\"‏ ‏.‏ قَالَ فَقُمْتُ ثُمَّ قُلْتُ مَنْ يَشْهَدُ لِي ثُمَّ جَلَسْتُ ‏.‏ ثُمَّ قَالَ ‏\"‏ مَنْ قَتَلَ قَتِيلاً لَهُ عَلَيْهِ بَيِّنَةٌ فَلَهُ سَلَبُهُ ‏\"‏ ‏.‏ قَالَ فَقُمْتُ ثُمَّ قُلْتُ مَنْ يَشْهَدُ لِي ثُمَّ جَلَسْتُ ثُمَّ قَالَ ذَلِكَ الثَّالِثَةَ فَقُمْتُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا لَكَ يَا أَبَا قَتَادَةَ ‏\"‏ ‏.‏ قَالَ فَاقْتَصَصْتُ عَلَيْهِ الْقِصَّةَ ‏.‏ فَقَالَ رَجُلٌ مِنَ الْقَوْمِ صَدَقَ يَا رَسُولَ اللَّهِ وَسَلَبُ ذَلِكَ الْقَتِيلِ عِنْدِي فَأَرْضِهِ عَنْهُ يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ أَبُو بَكْرٍ لاَ هَاءَ اللَّهِ إِذًا لاَ يَعْمِدُ إِلَى أَسَدٍ مِنْ أُسْدِ اللَّهِ يُقَاتِلُ عَنِ اللَّهِ وَرَسُولِهِ فَيُعْطِيكَ سَلَبَهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ صَدَقَ فَأَعْطِهِ إِيَّاهُ ‏\"‏ ‏.‏ فَأَعْطَانِيهِ فَبِعْتُ الدِّرْعَ فَاشْتَرَيْتُ بِهِ مَخْرَفًا فِي بَنِي سَلِمَةَ فَإِنَّهُ لأَوَّلُ مَالٍ تَأَثَّلْتُهُ فِي الإِسْلاَمِ ‏.‏",
    "malay_translation": "Kami keluar bersama Rasulullah SAW pada tahun Hunain.  Apabila kami bertemu (dengan musuh), berlakulah kekacauan di kalangan kaum Muslimin.  Aku melihat seorang lelaki daripada kalangan musyrik telah menguasai seorang lelaki daripada kalangan kaum Muslimin. Maka aku berpusing ke arahnya sehingga aku berada di belakangnya, lalu aku tebas dia dengan pedang di bahagian tulang belikat. Dia berpaling kepadaku dan mencengkamku dengan sangat kuat sehingga aku merasakan bau kematian. Kemudian maut menjemputnya lalu dia melepaskan cengkamannya.\n\nKemudian aku bertemu Umar bin al-Khattab dan aku bertanya, \"Apakah keadaan orang ramai?\"  Dia menjawab, \"Perintah Allah.\"  Kemudian orang ramai kembali menyerang. Rasulullah SAW bersabda, \"Barangsiapa yang membunuh seorang musuh dan ada bukti (mengenainya), maka baginya ganjaran rampasan perang.\"  Maka aku berdiri, lalu aku berkata, \"Siapakah yang akan menjadi saksi untukku?\"  Kemudian aku duduk.  Rasulullah SAW mengulangi sabdanya, \"Barangsiapa yang membunuh seorang musuh dan ada bukti (mengenainya), maka baginya ganjaran rampasan perang.\"  Aku berdiri lagi dan berkata, \"Siapakah yang akan menjadi saksi untukku?\"  Kemudian aku duduk.  Beliau mengulangi sabdanya untuk kali ketiga. Maka aku berdiri. Rasulullah SAW bertanya, \"Apakah yang berlaku kepadamu wahai Abu Qatadah?\"  Maka aku menceritakan kisahku kepadanya.  Seorang lelaki berkata, \"Dia benar wahai Rasulullah, rampasan perang orang yang terbunuh itu ada padaku, maka berikanlah kepadanya wahai Rasulullah.\"  \n\nAbu Bakar berkata, \"Tidak demi Allah!  Tidaklah sepatutnya seorang pahlawan Allah yang berperang membela Allah dan Rasul-Nya, kemudian ganjaran rampasannya diberikan kepadamu.\"  Rasulullah SAW bersabda, \"Dia benar, berikanlah kepadanya.\"  Maka diberikannya kepadaku.  Aku menjual perisai itu dan aku membeli sebidang tanah di kawasan Bani Salima. Itulah harta pertamaku yang aku perolehi dalam Islam."
  },
  {
    "id": 35200,
    "hadith_number": 1022,
    "tajuk_hadith": "Hukum Ghunmah dan Sumbangan Perang",
    "perawi_melayu": "Yahya, Malik, Ibn Shihab, al-Qasim ibn Muhammad, Ibn Abbas, Umar ibn al-Khattab",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُ قَالَ سَمِعْتُ رَجُلاً، يَسْأَلُ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ عَنِ الأَنْفَالِ، فَقَالَ ابْنُ عَبَّاسٍ الْفَرَسُ مِنَ النَّفَلِ وَالسَّلَبُ مِنَ النَّفَلِ ‏.‏ قَالَ ثُمَّ عَادَ الرَّجُلُ لِمَسْأَلَتِهِ فَقَالَ ابْنُ عَبَّاسٍ ذَلِكَ أَيْضًا ثُمَّ قَالَ الرَّجُلُ الأَنْفَالُ الَّتِي قَالَ اللَّهُ فِي كِتَابِهِ مَا هِيَ قَالَ الْقَاسِمُ فَلَمْ يَزَلْ يَسْأَلُهُ حَتَّى كَادَ أَنْ يُحْرِجَهُ ثُمَّ قَالَ ابْنُ عَبَّاسٍ أَتَدْرُونَ مَا مَثَلُ هَذَا مَثَلُ صَبِيغٍ الَّذِي ضَرَبَهُ عُمَرُ بْنُ الْخَطَّابِ ‏.‏ قَالَ وَسُئِلَ مَالِكٌ عَمَّنْ قَتَلَ قَتِيلاً مِنَ الْعَدُوِّ أَيَكُونُ لَهُ سَلَبُهُ بِغَيْرِ إِذْنِ الإِمَامِ قَالَ لاَ يَكُونُ ذَلِكَ لأَحَدٍ بِغَيْرِ إِذْنِ الإِمَامِ وَلاَ يَكُونُ ذَلِكَ مِنَ الإِمَامِ إِلاَّ عَلَى وَجْهِ الاِجْتِهَادِ وَلَمْ يَبْلُغْنِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ قَتَلَ قَتِيلاً فَلَهُ سَلَبُهُ ‏\"‏ ‏.‏ إِلاَّ يَوْمَ حُنَيْنٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada al-Qasim bin Muhammad bahawa baginda berkata: Aku mendengar seorang lelaki bertanya kepada Abdullah bin Abbas tentang ganjaran peperangan (anfal). Maka Ibn Abbas berkata: Kuda adalah sebahagian daripada ganjaran peperangan dan rampasan juga adalah sebahagian daripada ganjaran peperangan.  Kemudian lelaki itu mengulang soalannya, maka Ibn Abbas mengulangi jawapannya. Kemudian lelaki itu berkata: Apakah ganjaran-ganjaran yang disebut oleh Allah SWT di dalam kitab-Nya?  Al-Qasim berkata: Lelaki itu terus bertanya sehingga hampir membuat Ibn Abbas marah, maka Ibn Abbas berkata: Tahukah kamu siapakah persamaan lelaki ini? Persamaan dia seperti Sabiigh yang dipukul oleh Umar bin al-Khattab kerana dia terkenal dengan soalan-soalan bodohnya.  Malik ditanya tentang seseorang yang membunuh musuh, adakah dia berhak menyimpan harta rampasan musuh tersebut tanpa izin Imam?  Malik berkata: Tiada seorang pun boleh berbuat demikian tanpa izin Imam.  Imam sahaja boleh membuat ijtihad. Aku tidak pernah mendengar bahawa Rasulullah SAW bersabda: \"Barangsiapa membunuh musuh, maka baginya harta rampasan musuh itu,\" kecuali pada hari Hunain."
  },
  {
    "id": 35201,
    "hadith_number": 1023,
    "tajuk_hadith": "Pemberian Bonus daripada Khums",
    "perawi_melayu": "Yahya daripada Malik daripada Abu az-Zinad daripada Said ibn al-Musayyab",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ كَانَ النَّاسُ يُعْطَوْنَ النَّفَلَ مِنَ الْخُمُسِ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ أَحْسَنُ مَا سَمِعْتُ إِلَىَّ فِي ذَلِكَ ‏.‏ وَسُئِلَ مَالِكٌ عَنِ النَّفَلِ هَلْ يَكُونُ فِي أَوَّلِ مَغْنَمٍ قَالَ ذَلِكَ عَلَى وَجْهِ الاِجْتِهَادِ مِنَ الإِمَامِ وَلَيْسَ عِنْدَنَا فِي ذَلِكَ أَمْرٌ مَعْرُوفٌ مَوْثُوقٌ إِلاَّ اجْتِهَادُ السُّلْطَانِ وَلَمْ يَبْلُغْنِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَفَّلَ فِي مَغَازِيهِ كُلِّهَا وَقَدْ بَلَغَنِي أَنَّهُ نَفَّلَ فِي بَعْضِهَا يَوْمَ حُنَيْنٍ وَإِنَّمَا ذَلِكَ عَلَى وَجْهِ الاِجْتِهَادِ مِنَ الإِمَامِ فِي أَوَّلِ مَغْنَمٍ وَفِيمَا بَعْدَهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abu az-Zinad, daripada Said ibn al-Musayyab bahawa baginda berkata, \"Dahulu, orang ramai diberikan bonus daripada khums.\" Malik berkata, \"Dan itu adalah yang terbaik yang aku pernah dengar mengenai perkara ini.\"  Malik ditanya tentang bonus, sama ada ia diambil daripada rampasan pertama, dan beliau berkata, \"Itu adalah berdasarkan ijtihad Imam dan kami tiada arahan yang sahih dan boleh dipercayai mengenainya kecuali ijtihad Sultan. Aku tidak pernah mendengar bahawa Rasulullah SAW memberi bonus dalam semua peperangan baginda. Aku hanya mendengar bahawa baginda memberi bonus dalam salah satu peperangan, iaitu pada hari Hunain.  Ia bergantung kepada ijtihad Imam sama ada ia diambil daripada rampasan pertama atau yang berikutnya.\""
  },
  {
    "id": 35202,
    "hadith_number": 1024,
    "tajuk_hadith": "Pembahagian Ganjaran dalam Jihad: Kuda dan Pejalan Kaki",
    "perawi_melayu": "Yahya daripada Malik daripada Umar ibn Abd al-Aziz",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ قَالَ بَلَغَنِي أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، كَانَ يَقُولُ لِلْفَرَسِ سَهْمَانِ وَلِلرَّجُلِ سَهْمٌ ‏.‏ قَالَ مَالِكٌ وَلَمْ أَزَلْ أَسْمَعُ ذَلِكَ ‏.‏ وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ يَحْضُرُ  بِأَفْرَاسٍ كَثِيرَةٍ فَهَلْ يُقْسَمُ لَهَا كُلِّهَا فَقَالَ لَمْ أَسْمَعْ بِذَلِكَ وَلاَ أَرَى أَنْ يُقْسَمَ إِلاَّ لِفَرَسٍ وَاحِدٍ الَّذِي يُقَاتِلُ عَلَيْهِ ‏.‏ قَالَ مَالِكٌ لاَ أَرَى الْبَرَاذِينَ وَالْهُجُنَ إِلاَّ مِنَ الْخَيْلِ لأَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَالَ فِي كِتَابِهِ ‏{‏وَالْخَيْلَ وَالْبِغَالَ وَالْحَمِيرَ لِتَرْكَبُوهَا وَزِينَةً‏}‏ وَقَالَ عَزَّ وَجَلَّ ‏{‏وَأَعِدُّوا لَهُمْ مَا اسْتَطَعْتُمْ مِنْ قُوَّةٍ وَمِنْ رِبَاطِ الْخَيْلِ تُرْهِبُونَ بِهِ عَدُوَّ اللَّهِ وَعَدُوَّكُمْ‏}‏ فَأَنَا أَرَى الْبَرَاذِينَ وَالْهُجُنَ مِنَ الْخَيْلِ إِذَا أَجَازَهَا الْوَالِي وَقَدْ قَالَ سَعِيدُ بْنُ الْمُسَيَّبِ وَسُئِلَ عَنِ الْبَرَاذِينَ هَلْ فِيهَا مِنْ صَدَقَةٍ فَقَالَ وَهَلْ فِي الْخَيْلِ مِنْ صَدَقَةٍ",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa baginda berkata: “Sampai kepadaku bahawa Umar bin Abdul Aziz berkata, ‘Bagi penunggang kuda dua bahagian dan bagi pejalan kaki satu bahagian.’ Malik berkata: ‘Dan aku sentiasa mendengar demikian.’ Malik ditanya tentang seseorang yang hadir dengan banyak kuda, adakah ia dibahagikan kesemuanya? Maka beliau berkata: ‘Aku tidak pernah mendengar demikian dan aku tidak berpendapat ia dibahagikan melainkan hanya untuk seekor kuda sahaja yang ditunggangi ketika berperang.’ Malik berkata: ‘Aku berpendapat kuda kacukan dan kuda campuran termasuk dalam kategori kuda kerana Allah SWT berfirman dalam kitab-Nya: {Dan kuda, keldai, dan binatang-binatang lain untuk kamu tunggangi dan sebagai perhiasan.} Dan firman-Nya lagi: {Dan sediakanlah untuk menghadapi mereka apa jua yang kamu mampu dari segi kekuatan dan kuda yang terikat untuk kamu menakutkan musuh-musuh Allah dan musuh-musuh kamu.} Maka aku berpendapat kuda kacukan dan kuda campuran termasuk dalam kategori kuda sekiranya gabenor membenarkannya.’ Said bin Musayyib ditanya tentang kuda kerja, adakah zakat dikenakan ke atasnya? Maka beliau berkata: ‘Adakah terdapat zakat ke atas kuda?’"
  },
  {
    "id": 35203,
    "hadith_number": 1025,
    "tajuk_hadith": "Keadilan Pembahagian Ghulam",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Abd ar-Rahman ibn Said, dari Amr ibn Shuayb",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حِينَ صَدَرَ مِنْ حُنَيْنٍ وَهُوَ يُرِيدُ الْجِعِرَّانَةَ سَأَلَهُ النَّاسُ حَتَّى دَنَتْ بِهِ نَاقَتُهُ مِنْ شَجَرَةٍ فَتَشَبَّكَتْ بِرِدَائِهِ حَتَّى نَزَعَتْهُ عَنْ ظَهْرِهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ رُدُّوا عَلَىَّ رِدَائِي أَتَخَافُونَ أَنْ لاَ أَقْسِمَ بَيْنَكُمْ مَا أَفَاءَ اللَّهُ عَلَيْكُمْ وَالَّذِي نَفْسِي بِيَدِهِ لَوْ أَفَاءَ اللَّهُ عَلَيْكُمْ مِثْلَ سَمُرِ تِهَامَةَ نَعَمًا لَقَسَمْتُهُ بَيْنَكُمْ ثُمَّ لاَ تَجِدُونِي بَخِيلاً وَلاَ جَبَانًا وَلاَ كَذَّابًا ‏\"‏ ‏.‏ فَلَمَّا نَزَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَامَ فِي النَّاسِ فَقَالَ ‏\"‏ أَدُّوا الْخِيَاطَ وَالْمِخْيَطَ فَإِنَّ الْغُلُولَ عَارٌ وَنَارٌ وَشَنَارٌ عَلَى أَهْلِهِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ قَالَ ثُمَّ تَنَاوَلَ مِنَ الأَرْضِ وَبَرَةً مِنْ بَعِيرٍ أَوْ شَيْئًا ثُمَّ قَالَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ مَا لِي مِمَّا أَفَاءَ اللَّهُ عَلَيْكُمْ وَلاَ مِثْلَ هَذِهِ إِلاَّ الْخُمُسُ وَالْخُمُسُ مَرْدُودٌ عَلَيْكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abd ar-Rahman ibn Said, daripada Amr ibn Shuayb, bahawa Rasulullah SAW ketika berangkat dari Hunain menuju al-Ji’ranah, baginda ditanya oleh orang ramai sehingga untanya hampir kepada sebatang pokok, lalu tersimpul pada jubah baginda sehingga tertanggal dari belakang baginda. Maka Rasulullah SAW bersabda: \"Kembalikan jubahku! Adakah kamu bimbang aku tidak akan membahagikan kepada kamu apa yang Allah telah kurniakan kepadamu? Demi Allah yang jiwaku berada di tanganNya! Sekiranya Allah memberikan kepadamu seperti jumlah pokok semer di dataran Tihamah, nescaya aku akan membahagikannya kepada kamu. Kamu tidak akan mendapati aku bakhil, pengecut, atau pendusta.\"  Kemudian, setelah Rasulullah SAW turun, baginda berdiri di tengah-tengah orang ramai, lalu bersabda: \"Serahkanlah walau sehelai benang sekalipun, kerana mengkhianati ganjaran (ghulul) adalah satu aib, neraka dan kehinaan di hari kiamat bagi mereka yang melakukannya.\" Baginda mengambil bulu unta atau sesuatu dari tanah, lalu bersabda: \"Demi Allah yang jiwaku berada di tanganNya! Aku tidak akan mengambil apa-apa daripada apa yang Allah telah jadikan sebagai ganjaran untuk kamu, walau sehelai bulu ini, kecuali khums, dan khums itu akan dikembalikan kepada kamu.\""
  },
  {
    "id": 35204,
    "hadith_number": 1026,
    "tajuk_hadith": "Solat Jenazah dan Kejadian Curi di Hunain",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said, daripada Muhammad bin Yahya bin Habban, bahawa Zayd bin Khalid al-Juhani berkata,",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، أَنَّ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ، قَالَ تُوُفِّيَ رَجُلٌ يَوْمَ حُنَيْنٍ وَإِنَّهُمْ ذَكَرُوهُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَزَعَمَ زَيْدٌ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ صَلُّوا عَلَى صَاحِبِكُمْ ‏\"‏ ‏.‏ فَتَغَيَّرَتْ وُجُوهُ النَّاسِ لِذَلِكَ فَزَعَمَ زَيْدٌ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ صَاحِبَكُمْ قَدْ غَلَّ فِي سَبِيلِ اللَّهِ ‏\"‏ ‏.‏ قَالَ فَفَتَحْنَا مَتَاعَهُ فَوَجَدْنَا خَرَزَاتٍ مِنْ خَرَزِ يَهُودَ مَا تُسَاوِينَ دِرْهَمَيْنِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said, daripada Muhammad bin Yahya bin Habban, bahawa Zayd bin Khalid al-Juhani berkata, \"Seorang lelaki meninggal dunia pada hari Hunain, dan mereka menyebutnya kepada Rasulullah SAW.\" Zayd mendakwa bahawa Rasulullah SAW bersabda, \"Solatkanlah sahabat kamu.\" Wajah-wajah orang ramai berubah mendengarnya. Zayd mendakwa bahawa Rasulullah SAW bersabda, \"Sesungguhnya sahabat kamu telah mencuri di jalan Allah.\" Zayd berkata, \"Maka kami membuka barang-barangnya dan kami dapati beberapa biji manik Yahudi yang bernilai kira-kira dua dirham.\""
  },
  {
    "id": 35205,
    "hadith_number": 1027,
    "tajuk_hadith": "Doa Nabi SAW untuk Kabilah dan Kisah Kalung Batu Onyx",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said, daripada Abdullah bin al-Mughira bin Abi Burda al-Kinani",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said from Abdullah\nibn al-Mughira ibn Abi Burda al-Kinani that he had heard that the\nMessenger of Allah, may Allah bless him and grant him peace, came to\nthe people in their tribes and made dua for them, but left out one of\nthe tribes. Abdullah related, \"The tribe found an onyx necklace in the\nsaddle-bags of one of their men. The Messenger of Allah, may Allah\nbless him and grant him peace, came to them, and then did the takbir\nover them as one does the takbir over the dead.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ بْنِ أَبِي بُرْدَةَ الْكِنَانِيِّ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَتَى النَّاسَ فِي قَبَائِلِهِمْ يَدْعُو لَهُمْ وَأَنَّهُ تَرَكَ قَبِيلَةً مِنَ الْقَبَائِلِ - قَالَ - وَإِنَّ الْقَبِيلَةَ وَجَدُوا فِي بَرْدَعَةِ رَجُلٍ مِنْهُمْ عِقْدَ جَزْعٍ غُلُولاً فَأَتَاهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم فَكَبَّرَ عَلَيْهِمْ كَمَا يُكَبِّرُ عَلَى الْمَيِّتِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Yahya bin Said, dari Abdullah bin al-Mughira bin Abi Burda al-Kinani, bahawa telah sampai kepadanya bahawa Rasulullah SAW telah datang kepada orang ramai di kalangan kabilah mereka dan berdoa untuk mereka, dan bahawa Baginda telah meninggalkan satu kabilah daripada kabilah-kabilah tersebut. Abdullah berkata, \"Kabilah itu menjumpai seutas kalung batu onyx di dalam beg galas seorang lelaki dari kalangan mereka. Rasulullah SAW datang kepada mereka, lalu Baginda mentakbirkan ke atas mereka sepertimana mentakbirkan ke atas orang yang telah meninggal dunia.\""
  },
  {
    "id": 35206,
    "hadith_number": 1028,
    "tajuk_hadith": "Azab Bagi Mereka Yang Mengambil Harta Rampasan Perang Secara Haram",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Thawr ibn Zayd ad-Dili, daripada Abu'l-Ghayth, Salim, hamba kepada Ibn Muti' daripada Abu Hurairah",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ، عَنْ أَبِي الْغَيْثِ، سَالِمٍ مَوْلَى ابْنِ مُطِيعٍ عَنْ أَبِي هُرَيْرَةَ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ حُنَيْنٍ فَلَمْ نَغْنَمْ ذَهَبًا وَلاَ وَرِقًا إِلاَّ الأَمْوَالَ الثِّيَابَ وَالْمَتَاعَ - قَالَ - فَأَهْدَى رِفَاعَةُ بْنُ زَيْدٍ لِرَسُولِ اللَّهِ صلى الله عليه وسلم غُلاَمًا أَسْوَدَ يُقَالُ لَهُ مِدْعَمٌ فَوَجَّهَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى وَادِي الْقُرَى حَتَّى إِذَا كُنَّا بِوَادِي الْقُرَى بَيْنَمَا مِدْعَمٌ يَحُطُّ رَحْلَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ جَاءَهُ سَهْمٌ عَائِرٌ فَأَصَابَهُ فَقَتَلَهُ فَقَالَ النَّاسُ هَنِيئًا لَهُ الْجَنَّةُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَلاَّ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّ الشَّمْلَةَ الَّتِي أَخَذَ يَوْمَ حُنَيْنٍ مِنَ الْمَغَانِمِ لَمْ تُصِبْهَا الْمَقَاسِمُ لَتَشْتَعِلُ عَلَيْهِ نَارًا ‏\"‏ ‏.‏ قَالَ فَلَمَّا سَمِعَ النَّاسُ ذَلِكَ جَاءَ رَجُلٌ بِشِرَاكٍ أَوْ شِرَاكَيْنِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ شِرَاكٌ أَوْ شِرَاكَانِ مِنْ نَارٍ ‏\"‏ ‏.‏",
    "malay_translation": "Kami keluar bersama Rasulullah SAW pada tahun Hunain. Kami tidak memperoleh emas dan perak kecuali harta benda, pakaian dan barang-barang. Rifaa'ah bin Zayd menghadiahkan seorang hamba lelaki berkulit hitam kepada Rasulullah SAW yang bernama Mid'am.  Rasulullah SAW menuju ke Wadi al-Qura'. Ketika kami berada di Wadi al-Qura', ketika Mid'am sedang menurunkan barang-barang daripada unta Rasulullah SAW, tiba-tiba sebuah anak panah yang sesat mengenai dan membunuhnya.  Maka kata orang ramai, \"Semoga syurga menjadi tempat tinggalnya!\" Rasulullah SAW bersabda, \"Tidak! Demi Allah yang jiwaku berada di tangan-Nya, sesungguhnya sehelai kain yang diambinya pada hari Hunain daripada harta rampasan perang yang tidak dibahagi-bahagikan, nescaya akan membakarnya di dalam neraka.\" Setelah mendengarnya, seorang lelaki datang membawa tali sandal atau dua tali sandal kepada Rasulullah SAW. Lalu Rasulullah SAW bersabda, \"Satu atau dua tali sandal daripada api!\"."
  },
  {
    "id": 35207,
    "hadith_number": 1029,
    "tajuk_hadith": "Akibat-Akibat Perbuatan Buruk",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Yahya bin Said bahawa ia telah mendengar bahawa Abdullah bin Abbas berkata,",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ بَلَغَهُ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّهُ قَالَ مَا ظَهَرَ الْغُلُولُ فِي قَوْمٍ قَطُّ إِلاَّ أُلْقِيَ فِي قُلُوبِهِمُ الرُّعْبُ وَلاَ فَشَا الزِّنَا فِي قَوْمٍ قَطُّ إِلاَّ كَثُرَ فِيهِمُ الْمَوْتُ وَلاَ نَقَصَ قَوْمٌ الْمِكْيَالَ وَالْمِيزَانَ إِلاَّ قُطِعَ عَنْهُمُ الرِّزْقُ وَلاَ حَكَمَ قَوْمٌ بِغَيْرِ الْحَقِّ إِلاَّ فَشَا فِيهِمُ الدَّمُ وَلاَ خَتَرَ قَوْمٌ بِالْعَهْدِ إِلاَّ سَلَّطَ اللَّهُ عَلَيْهِمُ الْعَدُوَّ ‏.‏",
    "malay_translation": "Tidak akan timbul penyelewengan harta rampasan perang dalam sesuatu kaum melainkan ketakutan akan menyelubungi hati mereka.  Tidak akan merebak zina dalam sesuatu kaum melainkan kematian akan bertambah di kalangan mereka. Tidak akan sesuatu kaum mengurangkan sukatan dan timbangan melainkan rezeki mereka akan diputuskan.  Tidak akan sesuatu kaum membuat hukum tanpa keadilan melainkan akan merebak pembunuhan di kalangan mereka.  Tidak akan sesuatu kaum melanggar janji melainkan Allah SWT akan memberi kuasa kepada musuh-musuh mereka ke atas mereka."
  },
  {
    "id": 35208,
    "hadith_number": 1030,
    "tajuk_hadith": "Keinginan untuk Syahid di Jalan Allah",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Abu az-Zinad daripada al-Araj daripada Abu Hurairah",
    "english_text": "Yahya related to me from Malik from Abu'z-Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"By He in whose hand my self is! I would like to\nfight in the way of Allah and be killed, then be brought to life again\nso I could be killed, and then be brought to life again so I could be\nkilled.\" Abu Hurayra said three times, \"I testify to it by Allah!\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لَوَدِدْتُ أَنِّي أُقَاتِلُ فِي سَبِيلِ اللَّهِ فَأُقْتَلُ ثُمَّ أُحْيَا فَأُقْتَلُ ثُمَّ أُحْيَا فَأُقْتَلُ ‏\"‏ ‏.‏ فَكَانَ أَبُو هُرَيْرَةَ يَقُولُ ثَلاَثًا أَشْهَدُ بِاللَّهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Abu az-Zinad, daripada al-Araj, daripada Abu Hurairah bahawa Rasulullah SAW bersabda: \"Demi Zat yang jiwaku berada di tangan-Nya, aku sangat mengimpikan untuk berperang di jalan Allah, lalu terbunuh, kemudian dihidupkan kembali, lalu terbunuh lagi, kemudian dihidupkan kembali, lalu terbunuh lagi.\" Abu Hurairah berkata tiga kali, \"Aku bersaksi demi Allah!\"."
  },
  {
    "id": 35209,
    "hadith_number": 1031,
    "tajuk_hadith": "Syahid yang Berjuang di Jalan Allah",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Abu az-Zinad daripada al-Araj daripada Abu Hurairah bahawa Rasulullah SAW bersabda,",
    "english_text": "one fights in the way\nof Allah and is killed, then Allah turns to the killer, so he fights\n(in the way of Allah) and also becomes a martyr.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَضْحَكُ اللَّهُ إِلَى رَجُلَيْنِ يَقْتُلُ أَحَدُهُمَا الآخَرَ كِلاَهُمَا يَدْخُلُ الْجَنَّةَ يُقَاتِلُ هَذَا فِي سَبِيلِ اللَّهِ فَيُقْتَلُ ثُمَّ يَتُوبُ اللَّهُ عَلَى الْقَاتِلِ فَيُقَاتِلُ فَيُسْتَشْهَدُ ‏\"‏ ‏.‏",
    "malay_translation": "Allah SWT tersenyum melihat dua orang lelaki. Seorang membunuh yang lain, tetapi kedua-duanya akan masuk syurga.  Salah seorang berjuang di jalan Allah lalu terbunuh. Kemudian, Allah SWT menerima taubat pembunuhnya, lalu dia juga berjuang dan syahid."
  },
  {
    "id": 35210,
    "hadith_number": 1032,
    "tajuk_hadith": "Darah Pewangi Musk bagi yang Terluka di Jalan Allah",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Abu az-Zinad, dari al-Araj, dari Abu Hurairah",
    "english_text": "Yahya related to me from Malik from Abu'z-Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"By He in whose hand my self is! None of you is\nwounded in the way of Allah - and Allah knows best who is wounded in\nHisWay, but that when the Day of Rising comes, blood will gush forth\nfrom his wound. It will be the colour of blood, but its scent will be\nthat of musk.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لاَ يُكْلَمُ أَحَدٌ فِي سَبِيلِ اللَّهِ - وَاللَّهُ أَعْلَمُ بِمَنْ يُكْلَمُ فِي سَبِيلِهِ - إِلاَّ جَاءَ يَوْمَ الْقِيَامَةِ وَجُرْحُهُ يَثْعَبُ دَمًا اللَّوْنُ لَوْنُ دَمٍ وَالرِّيحُ رِيحُ الْمِسْكِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abu az-Zinad, daripada al-Araj, daripada Abu Hurairah bahawa Rasulullah SAW bersabda: \"Demi Zat yang jiwaku berada di tangan-Nya, sesiapa yang cedera di jalan Allah – dan Allah SWT lebih mengetahui siapa yang cedera di jalan-Nya – maka pada hari kiamat nanti, darah akan memancar dari lukanya. Warnanya seperti darah, tetapi baunya seperti kasturi.\""
  },
  {
    "id": 35211,
    "hadith_number": 1033,
    "tajuk_hadith": "Doa Umar bin al-Khattab agar tidak dibunuh oleh orang yang pernah bersujud kepada Allah",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Zayd bin Aslam",
    "english_text": "Yahya related to me from Malik from Zayd ibn Aslam that Umar ibn\nal-Khattab used to say, \"O Allah! Do not let me be slain by the hand\nof a man who has prayed a single prostration to You with which he will\ndispute with me before You on the Day of Rising!\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَانَ يَقُولُ اللَّهُمَّ لاَ تَجْعَلْ قَتْلِي بِيَدِ رَجُلٍ صَلَّى لَكَ سَجْدَةً وَاحِدَةً يُحَاجُّنِي بِهَا عِنْدَكَ يَوْمَ الْقِيَامَةِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Zayd bin Aslam bahawa Umar bin al-Khattab selalu berdoa, \"Ya Allah, janganlah Engkau jadikan kematian aku di tangan seseorang yang pernah sujud kepada-Mu sekali pun, lalu dia akan membantahku dengannya di sisi-Mu pada hari kiamat.\""
  },
  {
    "id": 35212,
    "hadith_number": 1034,
    "tajuk_hadith": "Pengampunan Dosa Syahid Kecuali Hutang",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Yahya bin Said, dari Said bin Abi Said al-Maqburi, dari Abdullah bin Abi Qatadah, dari bapanya,",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنْ قُتِلْتُ فِي سَبِيلِ اللَّهِ صَابِرًا مُحْتَسِبًا مُقْبِلاً غَيْرَ مُدْبِرٍ أَيُكَفِّرُ اللَّهُ عَنِّي خَطَايَاىَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَعَمْ ‏\"‏ ‏.‏ فَلَمَّا أَدْبَرَ الرَّجُلُ نَادَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَوْ أَمَرَ بِهِ فَنُودِيَ لَهُ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَيْفَ قُلْتَ ‏\"‏ ‏.‏ فَأَعَادَ عَلَيْهِ قَوْلَهُ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ نَعَمْ إِلاَّ الدَّيْنَ كَذَلِكَ قَالَ لِي جِبْرِيلُ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said, daripada Said bin Abi Said al-Maqburi, daripada Abdullah bin Abi Qatadah, daripada bapanya, bahawa baginda berkata: Seorang lelaki datang kepada Rasulullah SAW lalu berkata, \"Wahai Rasulullah! Jika saya terkorban di jalan Allah, dengan sabar, ikhlas, berani menyerang dan tidak berundur, adakah Allah akan mengampunkan dosa-dosa saya?\"  Rasulullah SAW menjawab, \"Ya.\"  Setelah lelaki itu berpaling, Rasulullah SAW memanggilnya – atau menyuruh orang memanggilnya.  Lalu Rasulullah SAW bertanya kepadanya, \"Apakah yang engkau katakan tadi?\" Lelaki itu mengulangi kata-katanya.  Rasulullah SAW berkata, \"Ya, kecuali hutang.  Demikianlah Jibril memberitahu saya.\""
  },
  {
    "id": 35213,
    "hadith_number": 1035,
    "tajuk_hadith": "Saksi Rasulullah SAW ke atas Syuhada Uhud dan Kerisauan Abu Bakar",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Abu al-Nadhr, hamba Umar bin Ubaidillah",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لِشُهَدَاءِ أُحُدٍ ‏\"‏ هَؤُلاَءِ أَشْهَدُ عَلَيْهِمْ ‏\"‏ ‏.‏ فَقَالَ أَبُو بَكْرٍ الصِّدِّيقُ أَلَسْنَا يَا رَسُولَ اللَّهِ بِإِخْوَانِهِمْ أَسْلَمْنَا كَمَا أَسْلَمُوا وَجَاهَدْنَا كَمَا جَاهَدُوا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بَلَى وَلَكِنْ لاَ أَدْرِي مَا تُحْدِثُونَ بَعْدِي ‏\"‏ ‏.‏ فَبَكَى أَبُو بَكْرٍ ثُمَّ بَكَى ثُمَّ قَالَ أَئِنَّا لَكَائِنُونَ بَعْدَكَ",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abu al-Nadhr, hamba Umar bin Ubaidillah bahawa telah sampai kepadanya bahawa Rasulullah SAW bersabda kepada syuhada Uhud, \"Mereka ini, aku menjadi saksi kepada mereka.\" Maka Abu Bakar as-Siddiq berkata, \"Wahai Rasulullah, bukankah kami adalah saudara mereka? Kami memeluk Islam sebagaimana mereka memeluk Islam dan kami berjihad sebagaimana mereka berjihad.\"  Rasulullah SAW bersabda, \"Benar, tetapi aku tidak mengetahui apa yang akan kamu lakukan selepas aku.\"  Abu Bakar menangis teresak-esak lalu berkata, \"Adakah kami benar-benar akan hidup selepas kamu?\" "
  },
  {
    "id": 35214,
    "hadith_number": 1036,
    "tajuk_hadith": "Keutamaan Madinah sebagai Tempat Perkuburan Rasulullah",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Yahya bin Said",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم جَالِسًا وَقَبْرٌ يُحْفَرُ بِالْمَدِينَةِ فَاطَّلَعَ رَجُلٌ فِي الْقَبْرِ فَقَالَ بِئْسَ مَضْجَعُ الْمُؤْمِنِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بِئْسَ مَا قُلْتَ ‏\"‏ ‏.‏ فَقَالَ الرَّجُلُ إِنِّي لَمْ أُرِدْ هَذَا يَا رَسُولَ اللَّهِ إِنَّمَا أَرَدْتُ الْقَتْلَ فِي سَبِيلِ اللَّهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ مِثْلَ لِلْقَتْلِ فِي سَبِيلِ اللَّهِ مَا عَلَى الأَرْضِ بُقْعَةٌ هِيَ أَحَبُّ إِلَىَّ أَنْ يَكُونَ قَبْرِي بِهَا مِنْهَا ‏\"‏ ‏.‏ ثَلاَثَ مَرَّاتٍ يَعْنِي الْمَدِينَةَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said, bahawa Rasulullah SAW sedang duduk ketika sebuah kubur digali di Madinah.  Seorang lelaki meninjau ke dalam kubur lalu berkata, \"Betapa buruknya tempat tidur bagi orang beriman.\"  Rasulullah SAW bersabda, \"Buruknya perkataanmu!\" Lelaki itu berkata, \"Wahai Rasulullah, bukan itu yang saya maksudkan. Saya maksudkan terbunuh di jalan Allah.\" Rasulullah SAW bersabda, \"Tiada yang menyamai terbunuh di jalan Allah! Tiada tempat di muka bumi yang lebih aku sukai untuk menjadi kuburku selain di sini (Madinah).\" Baginda mengulanginya tiga kali."
  },
  {
    "id": 35215,
    "hadith_number": 1037,
    "tajuk_hadith": "Doa Umar Ibn al-Khattab untuk Syahid dan Wafat di Madinah",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Zayd bin Aslam",
    "english_text": "Yahya related to me from Malik from Zayd ibn Aslam that Umar ibn\nal-Khattab used to say, \"O Allah! I ask you for martyrdom in Your way\nand death in the city of Your Messenger!\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَانَ يَقُولُ اللَّهُمَّ إِنِّي أَسْأَلُكَ شَهَادَةً فِي سَبِيلِكَ وَوَفَاةً بِبَلَدِ رَسُولِكَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik dari Zayd bin Aslam bahawa Umar bin al-Khattab selalu berdoa: \"Ya Allah, sesungguhnya aku memohon kepada-Mu syahid di jalan-Mu dan kematian di kota Rasulullah.\""
  },
  {
    "id": 35216,
    "hadith_number": 1038,
    "tajuk_hadith": "Kemuliaan Seorang Mukmin",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Yahya bin Said bahawa Umar bin al-Khattab berkata,",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said that Umar ibn\nal-Khattab said, \"The nobility of the mumin is his taqwa. His deen is\nhis noble descent. His manliness is his good character. Boldness and\ncowardice are but instincts which Allah places wherever He wills. The\ncoward shrinks from defending even his father and mother, and the bold\none fights for the sake of the combat not for the spoils. Being slain\nis but one way of meeting death, and the martyr is the one who gives\nhimself, expectant of reward from Allah.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ كَرَمُ الْمُؤْمِنِ تَقْوَاهُ وَدِينُهُ حَسَبُهُ وَمُرُوءَتُهُ خُلُقُهُ وَالْجُرْأَةُ وَالْجُبْنُ غَرَائِزُ يَضَعُهَا اللَّهُ حَيْثُ شَاءَ فَالْجَبَانُ يَفِرُّ عَنْ أَبِيهِ وَأُمِّهِ وَالْجَرِيءُ يُقَاتِلُ عَمَّا لاَ يَؤُوبُ بِهِ إِلَى رَحْلِهِ وَالْقَتْلُ حَتْفٌ مِنَ الْحُتُوفِ وَالشَّهِيدُ مَنِ احْتَسَبَ نَفْسَهُ عَلَى اللَّهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said bahawa Umar bin al-Khattab berkata, \"Kemuliaan seorang mukmin ialah taqwanya.  Agama adalah keturunannya yang mulia.  Kejantanannya ialah akhlaknya yang baik.  Keberanian dan kepengecutan hanyalah naluri yang Allah SWT tempatkan di mana sahaja yang Dia kehendaki.  Orang yang pengecut lari daripada mempertahankan bahkan bapa dan ibunya, dan orang yang berani berperang kerana jihad, bukan kerana rampasan.  Kematian adalah satu daripada cara kematian, dan syahid ialah orang yang mengorbankan dirinya, dengan mengharapkan ganjaran daripada Allah SWT.\""
  },
  {
    "id": 35217,
    "hadith_number": 1039,
    "tajuk_hadith": "Pengurusan Jenazah Umar Ibn al-Khattab",
    "perawi_melayu": "Yahya daripada Malik daripada Nafi' daripada Abdullah ibn Umar",
    "english_text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat Umar ibn al-Khattab was washed and shrouded and prayed over, yet\nhe was a martyr, may Allah have mercy on him .",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، غُسِّلَ وَكُفِّنَ وَصُلِّيَ عَلَيْهِ وَكَانَ شَهِيدًا يَرْحَمُهُ اللَّهُ ‏.",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Nafi', daripada Abdullah ibn Umar bahawa Umar ibn al-Khattab telah dimandikan, dikafankan, dan disembahyangkan jenazahnya, walaupun beliau seorang syahid.  Semoga Allah merahmatinya."
  },
  {
    "id": 35218,
    "hadith_number": 1040,
    "tajuk_hadith": "Pengurusan Jenazah Syuhada'",
    "perawi_melayu": "Yahya daripada Malik",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ أَنَّهُ بَلَغَهُ عَنْ أَهْلِ الْعِلْمِ أَنَّهُمْ كَانُوا يَقُولُونَ الشُّهَدَاءُ فِي سَبِيلِ اللَّهِ لاَ يُغَسَّلُونَ وَلاَ يُصَلَّى عَلَى أَحَدٍ مِنْهُمْ وَإِنَّهُمْ يُدْفَنُونَ فِي الثِّيَابِ الَّتِي قُتِلُوا فِيهَا ‏.‏ قَالَ مَالِكٌ وَتِلْكَ السُّنَّةُ فِيمَنْ قُتِلَ فِي الْمُعْتَرَكِ فَلَمْ يُدْرَكْ حَتَّى مَاتَ ‏.‏ قَالَ وَأَمَّا مَنْ حُمِلَ مِنْهُمْ فَعَاشَ مَا شَاءَ اللَّهُ بَعْدَ ذَلِكَ فَإِنَّهُ يُغَسَّلُ وَيُصَلَّى عَلَيْهِ كَمَا عُمِلَ بِعُمَرَ بْنِ الْخَطَّابِ ‏.",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa baginda telah diberitahu daripada para ulama bahawa mereka berkata, \"Syuhada' di jalan Allah tidak dimandikan dan tidak disolatkan ke atas mereka, dan mereka dikebumikan dengan pakaian yang mereka kenakan ketika terkorban.\" Malik berkata, \"Inilah sunnah bagi mereka yang terkorban di medan perang dan tidak sempat dirawat sehingga meninggal dunia. Adapun mereka yang diangkat dan hidup selama Allah kehendaki selepas itu, maka mereka dimandikan dan disolatkan ke atas mereka sebagaimana yang dilakukan kepada Umar ibn al-Khattab.\""
  },
  {
    "id": 35219,
    "hadith_number": 1041,
    "tajuk_hadith": "Umar ibn al-Khattab dan Pemberian Unta",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Yahya bin Said",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَانَ يَحْمِلُ فِي الْعَامِ الْوَاحِدِ عَلَى أَرْبَعِينَ أَلْفِ بَعِيرٍ يَحْمِلُ الرَّجُلَ إِلَى الشَّامِ عَلَى بَعِيرٍ وَيَحْمِلُ الرَّجُلَيْنِ إِلَى الْعِرَاقِ عَلَى بَعِيرٍ فَجَاءَهُ رَجُلٌ مِنْ أَهْلِ الْعِرَاقِ فَقَالَ احْمِلْنِي وَسُحَيْمًا ‏.‏ فَقَالَ لَهُ عُمَرُ بْنُ الْخَطَّابِ نَشَدْتُكَ اللَّهَ أَسُحَيْمٌ زِقٌّ قَالَ لَهُ نَعَمْ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said, bahawa Umar bin al-Khattab, pada setiap tahun menyediakan empat puluh ribu ekor unta sebagai kenderaan. Kadang kala, beliau memberikan seekor unta kepada seseorang untuk ke Syam.  Kadang kala, beliau memberikan seekor unta untuk dua orang ke Iraq.  Maka datanglah seorang lelaki dari Iraq kepadanya lalu berkata, \"Angkut saya dan Suhaym.\"  Umar bin al-Khattab bertanya kepadanya, \"Demi Allah, adakah Suhaym itu sebuah kulit air?\" Lelaki itu menjawab, \"Ya.\""
  },
  {
    "id": 35220,
    "hadith_number": 1042,
    "tajuk_hadith": "Mimpi Rasulullah SAW tentang Ummahnya di Laut",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Ishaq bin Abdullah bin Abi Talhah, dari Anas bin Malik",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا ذَهَبَ إِلَى قُبَاءٍ يَدْخُلُ عَلَى أُمِّ حَرَامٍ بِنْتِ مِلْحَانَ فَتُطْعِمُهُ وَكَانَتْ أُمُّ حَرَامٍ تَحْتَ عُبَادَةَ بْنِ الصَّامِتِ فَدَخَلَ عَلَيْهَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمًا فَأَطْعَمَتْهُ وَجَلَسَتْ تَفْلِي فِي رَأْسِهِ فَنَامَ رَسُولُ اللَّهِ صلى الله عليه",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Ishaq bin Abdullah bin Abi Talhah, dari Anas bin Malik, bahawa Rasulullah SAW, apabila pergi ke Quba’, akan melawat Umm Haram binti Milhan. Umm Haram akan memberi makan baginda. Umm Haram adalah isteri kepada Ubadah bin As-Samit.  Pada suatu hari, Rasulullah SAW melawat Umm Haram.  Umm Haram memberi makan baginda, dan duduk sambil mengurut rambut baginda.  Rasulullah SAW kemudian tertidur, lalu terbangun sambil tersenyum.  Umm Haram bertanya, \"Wahai Rasulullah, apa yang menyebabkan Baginda tersenyum?\" Baginda menjawab, \"Sebahagian daripada umatku telah ditunjukkan kepadaku, sedang berjihad di jalan Allah. Mereka sedang menunggang di tengah laut, seperti raja-raja di atas takhta, atau seperti raja-raja di atas takhta.\" (Ishaq tidak pasti).  Umm Haram berkata, \"Wahai Rasulullah, mohonkanlah kepada Allah agar saya termasuk di kalangan mereka!\" Maka Baginda berdoa untuknya, lalu menundukkan kepala dan tidur. Kemudian Baginda terbangun sambil tersenyum, dan Umm Haram bertanya, \"Wahai Rasulullah, mengapa Baginda tersenyum?\" Baginda menjawab, \"Sebahagian daripada umatku telah ditunjukkan kepadaku, sedang berjihad di jalan Allah. Mereka seperti raja-raja di atas takhta, atau seperti raja-raja di atas takhta,\" seperti yang telah Baginda sebutkan sebelum ini.  Umm Haram berkata, \"Wahai Rasulullah, mohonkanlah kepada Allah agar saya termasuk di kalangan mereka!\" Baginda menjawab, \"Engkau termasuk dalam kalangan yang terawal.\"  Ishaq menambah, \"Umm Haram belayar di laut pada zaman pemerintahan Muawiyah, dan ketika mendarat, beliau tercampak dari tunggangannya dan terbunuh."
  },
  {
    "id": 35221,
    "hadith_number": 1043,
    "tajuk_hadith": "Keinginan Rasulullah untuk Sentiasa Berjihad",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said, daripada Abu Salih as-Samman, daripada Abu Hurairah",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَوْلاَ أَنْ أَشُقَّ عَلَى أُمَّتِي لأَحْبَبْتُ أَنْ لاَ أَتَخَلَّفَ عَنْ سَرِيَّةٍ تَخْرُجُ فِي سَبِيلِ اللَّهِ وَلَكِنِّي لاَ أَجِدُ مَا أَحْمِلُهُمْ عَلَيْهِ وَلاَ يَجِدُونَ مَا يَتَحَمَّلُونَ عَلَيْهِ فَيَخْرُجُونَ وَيَشُقُّ عَلَيْهِمْ أَنْ يَتَخَلَّفُوا بَعْدِي فَوَدِدْتُ أَنِّي أُقَاتِلُ فِي سَبِيلِ اللَّهِ فَأُقْتَلُ ثُمَّ أُحْيَا فَأُقْتَلُ ثُمَّ أُحْيَا فَأُقْتَلُ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said, daripada Abu Salih as-Samman, daripada Abu Hurairah bahawa Rasulullah SAW bersabda:  \"Sekiranya aku tidak bimbang akan kesukaran yang dihadapi umatku, nescaya aku lebih gemar untuk tidak ketinggalan daripada mana-mana pasukan yang keluar berjihad di jalan Allah.  Tetapi aku tidak mempunyai kenderaan untuk membawa mereka, dan mereka juga tidak mempunyai kenderaan untuk pergi, lalu mereka keluar berjihad dan akan terasa berat bagi mereka jika tinggal di belakangku.  Maka aku berharap agar aku dapat berjuang di jalan Allah, lalu terbunuh, kemudian dihidupkan semula, lalu terbunuh, kemudian dihidupkan semula, lalu terbunuh.\""
  },
  {
    "id": 35222,
    "hadith_number": 1044,
    "tajuk_hadith": "Kisah Saad bin Rabi' di Perang Uhud",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Yahya bin Said",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ لَمَّا كَانَ يَوْمُ أُحُدٍ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ يَأْتِينِي بِخَبَرِ سَعْدِ بْنِ الرَّبِيعِ الأَنْصَارِيِّ ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ أَنَا يَا رَسُولَ اللَّهِ ‏.‏ فَذَهَبَ الرَّجُلُ يَطُوفُ بَيْنَ الْقَتْلَى فَقَالَ لَهُ سَعْدُ بْنُ الرَّبِيعِ مَا شَأْنُكَ فَقَالَ لَهُ الرَّجُلُ بَعَثَنِي إِلَيْكَ رَسُولُ اللَّهِ صلى الله عليه وسلم لآتِيَهُ بِخَبَرِكَ ‏.‏ قَالَ فَاذْهَبْ إِلَيْهِ فَأَقْرِئْهُ مِنِّي السَّلاَمَ وَأَخْبِرْهُ أَنِّي قَدْ طُعِنْتُ اثْنَتَىْ عَشْرَةَ طَعْنَةً وَأَنِّي قَدْ أُنْفِذَتْ مَقَاتِلِي وَأَخْبِرْ قَوْمَكَ أَنَّهُ لاَ عُذْرَ لَهُمْ عِنْدَ اللَّهِ إِنْ قُتِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَوَاحِدٌ مِنْهُمْ حَىٌّ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said, bahawa baginda berkata:  Semasa Perang Uhud, Rasulullah SAW bersabda, \"Siapakah yang akan menyampaikan berita tentang Saad bin Rabi' al-Ansari?\" Seorang lelaki berkata, \"Saya, wahai Rasulullah!\"  Lalu lelaki itu pergi mencari di kalangan yang terkorban. Saad bin Rabi' bertanya kepadanya, \"Apakah halmu?\" Lelaki itu menjawab, \"Rasulullah SAW mengutus aku untuk mendapatkan khabar darimu.\" Saad berkata, \"Pergilah kepadanya dan sampaikan salamku dan beritahukan kepadanya bahawa aku telah ditikam sebanyak dua belas kali dan aku hampir mati. Beritahu kaumku bahawa mereka tidak akan mempunyai alasan di sisi Allah sekiranya Rasulullah SAW terbunuh dan seorang daripada mereka masih hidup."
  },
  {
    "id": 35223,
    "hadith_number": 1045,
    "tajuk_hadith": "Kegigihan Seorang Ansar dalam Jihad",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Yahya bin Said",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said that the\nMessenger of Allah, may Allah bless him and grant him peace,\nstimulated people for jihad and mentioned the Garden. One of the Ansar\nwas eating some dates in his hand, and said, \"Am I so desirous of this\nworld that I should sit until I finish them?\" He threw aside what was\nin his hand and took his sword, and fought until he was slain .",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَغَّبَ فِي الْجِهَادِ وَذَكَرَ الْجَنَّةَ وَرَجُلٌ مِنَ الأَنْصَارِ يَأْكُلُ تَمَرَاتٍ فِي يَدِهِ فَقَالَ إِنِّي لَحَرِيصُ عَلَى الدُّنْيَا إِنْ جَلَسْتُ حَتَّى أَفْرُغَ مِنْهُنَّ ‏.‏ فَرَمَى مَا فِي يَدِهِ فَحَمَلَ بِسَيْفِهِ فَقَاتَلَ حَتَّى قُتِلَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik, daripada Yahya bin Said bahawa Rasulullah SAW telah menggalakkan jihad dan menyebut tentang syurga. Seorang lelaki daripada kalangan Ansar sedang memakan beberapa biji tamar di tangannya, lalu berkata, \"Adakah aku begitu tamak kepada dunia sehingga aku duduk sehingga menghabiskan tamar ini?\"  Dia melemparkan apa yang ada di tangannya, mengambil pedangnya, lalu berperang sehingga terkorban."
  },
  {
    "id": 35224,
    "hadith_number": 1046,
    "tajuk_hadith": "Dua Jenis Perang",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Yahya ibn Said daripada Muadh ibn Jabal",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُعَاذِ بْنِ جَبَلٍ، أَنَّهُ قَالَ الْغَزْوُ غَزْوَانِ فَغَزْوٌ تُنْفَقُ فِيهِ الْكَرِيمَةُ وَيُيَاسَرُ فِيهِ الشَّرِيكُ وَيُطَاعُ فِيهِ ذُو الأَمْرِ وَيُجْتَنَبُ فِيهِ الْفَسَادُ فَذَلِكَ الْغَزْوُ خَيْرٌ كُلُّهُ وَغَزْوٌ لاَ تُنْفَقُ فِيهِ الْكَرِيمَةُ وَلاَ يُيَاسَرُ فِيهِ الشَّرِيكُ وَلاَ يُطَاعُ فِيهِ ذُو الأَمْرِ وَلاَ يُجْتَنَبُ فِيهِ الْفَسَادُ فَذَلِكَ الْغَزْوُ لاَ يَرْجِعُ صَاحِبُهُ كَفَافًا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Yahya bin Said daripada Mu'adz bin Jabal bahawa baginda berkata: \"Perang itu ada dua jenis. Perang yang pertama, harta benda yang bernilai dibelanjakan, para peserta saling membantu, perintah pemimpin dipatuhi, dan kerosakan dielakkan. Perang sebeginilah yang terbaik.  Dan ada perang yang harta benda yang bernilai tidak dibelanjakan, para peserta tidak saling membantu, perintah pemimpin tidak dipatuhi, dan kerosakan tidak dielakkan. Perang sedemikian, pesertanya tidak akan kembali dengan ganjaran.\""
  },
  {
    "id": 35225,
    "hadith_number": 1047,
    "tajuk_hadith": "Keberkatan Kuda Sehingga Hari Kiamat",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Nafi', daripada Abdullah bin Umar",
    "english_text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"Blessing is in the forelocks of horses until the Day of\nRising.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْخَيْلُ فِي نَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Nafi', daripada Abdullah bin Umar bahawa Rasulullah SAW bersabda: \"Kuda-kuda itu, keberkatannya terletak pada bulu roma di bahagian dahi mereka sehingga hari kiamat.\""
  },
  {
    "id": 35226,
    "hadith_number": 1048,
    "tajuk_hadith": "Rasulullah SAW Menonton Perlumbaan Kuda",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Nafi', dari Abdullah bin Umar",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سَابَقَ بَيْنَ الْخَيْلِ الَّتِي قَدْ أُضْمِرَتْ مِنَ الْحَفْيَاءِ وَكَانَ أَمَدُهَا ثَنِيَّةَ الْوَدَاعِ وَسَابَقَ بَيْنَ الْخَيْلِ الَّتِي لَمْ تُضَمَّرْ مِنَ الثَّنِيَّةِ إِلَى مَسْجِدِ بَنِي زُرَيْقٍ وَأَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ مِمَّنْ سَابَقَ بِهَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Nafi', daripada Abdullah bin Umar bahawa Rasulullah SAW telah mengadakan perlumbaan kuda yang telah dilatih secara intensif dari al-Hafya, dan titik akhirnya ialah Thaniyatul Wada'. Baginda juga mengadakan perlumbaan di antara kuda-kuda yang tidak dilatih secara intensif dari Thaniyyah (sebuah laluan gunung berhampiran Madinah) ke masjid Bani Zurayq. Abdullah bin Umar adalah antara mereka yang menyertai perlumbaan tersebut."
  },
  {
    "id": 35227,
    "hadith_number": 1049,
    "tajuk_hadith": "Keperluan Tiga Kuda Dalam Perjudian Kuda",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Yahya ibn Said, bahawa beliau mendengar Said ibn al-Musayyab berkata,",
    "english_text": "Yahya related to me from Malik that Yahya ibn Said heard Said ibn\nal-Musayyab say, \"There is  no harm in placing stakes on horses if a\nthird horse enters it. The winner takes the stake, and there is no\nfine against the loser.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ لَيْسَ بِرِهَانِ الْخَيْلِ بَأْسٌ إِذَا دَخَلَ فِيهَا مُحَلِّلٌ فَإِنْ سَبَقَ أَخَذَ السَّبَقَ وَإِنْ سُبِقَ لَمْ يَكُنْ عَلَيْهِ شَىْءٌ ‏.‏",
    "malay_translation": "Tiada apa-apa kesalahan dalam pertaruhan kuda jika terdapat kuda ketiga yang menyertainya.  Pemenang akan mengambil hadiah, dan tiada denda dikenakan ke atas yang kalah."
  },
  {
    "id": 35228,
    "hadith_number": 1050,
    "tajuk_hadith": "Baginda SAW Membersihkan Wajah Kudanya",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Yahya bin Said",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said that the\nMessenger of Allah, may Allah bless him and grant him peace, was seen\nwiping the face of his horse with his cloak. He was questioned about\nit and said, \"I was reproached in the night about horses.\" i.e. not\ntaking care of them.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رُئِيَ وَهُوَ يَمْسَحُ وَجْهَ فَرَسِهِ بِرِدَائِهِ فَسُئِلَ عَنْ ذَلِكَ فَقَالَ ‏\n\"‏ إِنِّي عُوتِبْتُ اللَّيْلَةَ فِي الْخَيْلِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said bahawa Rasulullah SAW dilihat sedang menyapu muka kudanya dengan jubah baginda. Baginda ditanya tentang perkara itu, lalu baginda menjawab, \"Sesungguhnya aku telah ditegur pada malam ini mengenai kuda,\" iaitu kerana tidak menjaga kuda-kudanya."
  },
  {
    "id": 35229,
    "hadith_number": 1051,
    "tajuk_hadith": "Kemusnahan Khaybar",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Humayd at-Tawil, dari Anas bin Malik",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حِينَ خَرَجَ إِلَى خَيْبَرَ أَتَاهَا لَيْلاً وَكَانَ إِذَا أَتَى قَوْمًا بِلَيْلٍ لَمْ يُغِرْ حَتَّى يُصْبِحَ فَخَرَجَتْ يَهُودُ بِمَسَاحِيهِمْ وَمَكَاتِلِهِمْ فَلَمَّا رَأَوْهُ قَالُوا مُحَمَّدٌ وَاللَّهِ مُحَمَّدٌ وَالْخَمِيسُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اللَّهُ أَكْبَرُ خَرِبَتْ خَيْبَرُ إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ فَسَاءَ صَبَاحُ الْمُنْذَرِينَ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Humayd at-Tawil, daripada Anas bin Malik bahawa apabila Rasulullah SAW berangkat ke Khaybar, baginda tiba di sana pada waktu malam. Dan apabila baginda tiba di suatu kaum pada waktu malam, baginda tidak menyerang sehingga waktu pagi. Maka pada waktu pagi, orang-orang Yahudi keluar dengan cangkul dan bakul mereka. Apabila mereka melihat baginda, mereka berkata, \"Muhammad! Demi Allah, Muhammad dan tenteranya!\"  Maka Rasulullah SAW bersabda, \"Allah Maha Besar! Khaybar telah hancur. Sesungguhnya apabila kami tiba di tempat tinggal suatu kaum, maka buruklah pagi bagi orang-orang yang telah diberi amaran.\""
  },
  {
    "id": 35230,
    "hadith_number": 1052,
    "tajuk_hadith": "Panggilan ke Syurga melalui pelbagai pintu kebaikan",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Ibn Shihab, dari Humayd ibn Abd ar-Rahman ibn Awf, dari Abu Hurairah",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ أَنْفَقَ زَوْجَيْنِ فِي سَبِيلِ اللَّهِ نُودِيَ فِي الْجَنَّةِ يَا عَبْدَ اللَّهِ هَذَا خَيْرٌ فَمَنْ كَانَ مِنْ أَهْلِ الصَّلاَةِ دُعِيَ مِنْ بَابِ الصَّلاَةِ وَمَنْ كَانَ مِنْ أَهْلِ الْجِهَادِ دُعِيَ مِنْ بَابِ الْجِهَادِ وَمَنْ كَانَ مِنْ أَهْلِ الصَّدَقَةِ دُعِيَ مِنْ بَابِ الصَّدَقَةِ وَمَنْ كَانَ مِنْ أَهْلِ الصِّيَامِ دُعِيَ مِنْ بَابِ الرَّيَّانِ ‏\"‏ ‏.‏ فَقَالَ أَبُو بَكْرٍ الصِّدِّيقُ يَا رَسُولَ اللَّهِ مَا عَلَى مَنْ يُدْعَى مِنْ هَذِهِ الأَبْوَابِ مِنْ ضَرُورَةٍ فَهَلْ يُدْعَى أَحَدٌ مِنْ هَذِهِ الأَبْوَابِ كُلِّهَا قَالَ ‏\"‏ نَعَمْ وَأَرْجُو أَنْ تَكُونَ مِنْهُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Humayd bin Abd ar-Rahman bin Awf, daripada Abu Hurairah, bahawa Rasulullah SAW bersabda: \"Barangsiapa yang membelanjakan dua jenis harta di jalan Allah, nescaya dia akan dipanggil di syurga, 'Wahai hamba Allah! Inilah kebaikan!'  Barangsiapa yang termasuk golongan ahli solat, dia akan dipanggil dari pintu solat. Barangsiapa yang termasuk golongan ahli jihad, dia akan dipanggil dari pintu jihad. Barangsiapa yang termasuk golongan ahli sedekah, dia akan dipanggil dari pintu sedekah. Dan barangsiapa yang termasuk golongan ahli puasa, dia akan dipanggil dari pintu Ar-Rayyan.\"  Lalu Abu Bakar As-Siddiq berkata, \"Wahai Rasulullah! Adakah wajib seseorang itu dipanggil hanya dari salah satu pintu ini sahaja? Adakah seseorang itu boleh dipanggil dari kesemua pintu ini?\" Baginda bersabda, \"Ya, dan aku berharap engkau termasuk di antara mereka.\""
  },
  {
    "id": 35231,
    "hadith_number": 1053,
    "tajuk_hadith": "Hukum Tanah dan Harta Milik Ahlul Dzimmah",
    "perawi_melayu": "Malik",
    "english_text": "Malik was asked whether, when an imam had accepted jizya from a\npeople and they gave it, he thought that the land of one of them who\nsurrendered belonged to him or whether his land and property belonged\nto the Muslims. Malik said, \"That varies. As for the people of peace,\nif one of them surrenders, then he is entitled to his land and\nproperty. As for the people of force who use force, if one of them\nsurrenders, his land and property belong to the Muslims because the\npeople of force are overcome in their towns, and it becomes booty for\nthe Muslims. As for the people of peace, their property and selves are\nprotected so that they make peace for them. Only what they have made\npeace for is obliged of them.\"",
    "arabic_text": "",
    "malay_translation": "Malik ditanya sama ada, apabila seorang imam telah menerima jizyah daripada suatu kaum dan mereka memberikannya, adakah beliau berpendapat bahawa tanah seseorang daripada mereka yang menyerah diri itu menjadi miliknya atau adakah tanah dan hartanya menjadi milik orang Islam. Malik berkata, \"Ia berbeza. Bagi kaum yang aman, jika salah seorang daripada mereka menyerah diri, maka dia berhak ke atas tanah dan hartanya. Bagi kaum yang menggunakan kekerasan, jika salah seorang daripada mereka menyerah diri, tanah dan hartanya menjadi milik orang Islam kerana kaum yang menggunakan kekerasan itu ditakluk di bandar-bandar mereka, dan ia menjadi rampasan perang bagi orang Islam. Bagi kaum yang aman, harta benda dan diri mereka dilindungi supaya mereka membuat perjanjian damai. Hanya apa yang telah mereka perjanjikan damai itu sahaja diwajibkan ke atas mereka.\""
  },
  {
    "id": 35232,
    "hadith_number": 1054,
    "tajuk_hadith": "Jenazah di Uhud dan Penguburan Bersama",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Abd ar-Rahman ibn Abi Sasaca",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ، أَنَّهُ بَلَغَهُ أَنَّ عَمْرَو بْنَ الْجَمُوحِ، وَعَبْدَ اللَّهِ بْنَ عَمْرٍو الأَنْصَارِيَّيْنِ، ثُمَّ السَّلَمِيَّيْنِ كَانَا قَدْ حَفَرَ السَّيْلُ قَبْرَهُمَا وَكَانَ قَبْرُهُمَا مِمَّا يَلِي السَّيْلَ وَكَانَا فِي قَبْرٍ وَاحِدٍ وَهُمَا مِمَّنِ اسْتُشْهِدَ يَوْمَ أُحُدٍ فَحُفِرَ عَنْهُمَا لِيُغَيَّرَا مِنْ مَكَانِهِمَا فَوُجِدَا لَمْ يَتَغَيَّرَا كَأَنَّهُمَا مَاتَا بِالأَمْسِ وَكَانَ أَحَدُهُمَا قَدْ جُرِحَ فَوَضَعَ يَدَهُ عَلَى جُرْحِهِ فَدُفِنَ وَهُوَ كَذَلِكَ فَأُمِيطَتْ يَدُهُ عَنْ جُرْحِهِ ثُمَّ أُرْسِلَتْ فَرَجَعَتْ كَمَا كَانَتْ وَكَانَ بَيْنَ أُحُدٍ وَبَيْنَ يَوْمَ حُفِرَ عَنْهُمَا سِتٌّ وَأَرْبَعُونَ سَنَةً ‏.‏ قَالَ مَالِكٌ لاَ بَأْسَ أَنْ يُدْفَنَ الرَّجُلاَنِ وَالثَّلاَثَةُ فِي قَبْرٍ وَاحِدٍ مِنْ ضَرُورَةٍ وَيُجْعَلَ الأَكْبَرُ مِمَّا يَلِي الْقِبْلَةَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Abd ar-Rahman ibn Abi Sasaca bahawa baginda telah dimaklumkan bahawa Amr ibn al-Jamuh dan Abdullah ibn Amr, kedua-duanya daripada kalangan Ansar, kemudian daripada puak Salami, kubur mereka telah digali oleh air bah.  Kubur mereka terletak berhampiran dengan tempat air bah itu mengalir. Mereka berdua dikebumikan dalam satu kubur dan mereka adalah antara syuhada di medan Uhud. Kemudian, kubur mereka digali untuk dipindahkan ke tempat lain, dan mereka dijumpai tanpa sebarang perubahan, seolah-olah mereka baru sahaja meninggal dunia pada hari sebelumnya. Salah seorang daripada mereka cedera dan meletakkan tangannya ke atas luka tersebut ketika dikebumikan. Kemudian, tangannya dialihkan daripada luka itu, dan dibiarkan, lalu kembali ke tempat asalnya. Tempoh masa antara peristiwa Uhud dan hari mereka digali adalah empat puluh enam tahun.\n\nMalik berkata, \"Tiada masalah sekiranya dua atau tiga orang lelaki dikebumikan dalam satu kubur atas sebab-sebab darurat. Dan orang yang paling tua hendaklah diletakkan berhampiran kiblat.\""
  },
  {
    "id": 35233,
    "hadith_number": 1055,
    "tajuk_hadith": "Abu Bakar As-Siddiq dan Harta Bahrayn",
    "perawi_melayu": "Yahya (dari Malik) daripada Rabi'ah ibn Abi Abd ar-Rahman",
    "english_text": "Yahya related to me from Malik that Rabia ibn Abi Abd ar-Rahman\nsaid, \"Property was sent to Abu Bakr as-Siddiq from Bahrayn. He said,\n'If someone had a promise or a pledge with the Messenger of Allah, may\nAllah bless him and grant him peace, let him come to me.' So Jabir ibn\nAbdullah came to him, and he gave him three times as much of it as\nwould fill both hands.''",
    "arabic_text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّهُ قَالَ قَدِمَ عَلَى أَبِي بَكْرٍ الصِّدِّيقِ مَالٌ مِنَ الْبَحْرَيْنِ فَقَالَ مَنْ كَانَ لَهُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأْىٌ أَوْ عِدَةٌ فَلْيَأْتِنِي فَجَاءَهُ جَابِرُ بْنُ عَبْدِ اللَّهِ فَحَفَنَ لَهُ ثَلاَثَ حَفَنَاتٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Rabi’ah bin Abi Abd ar-Rahman yang berkata, “Harta telah sampai kepada Abu Bakar As-Siddiq dari Bahrain.  Lalu beliau berkata, ‘Barangsiapa yang mempunyai janji atau amanah daripada Rasulullah SAW, maka hendaklah datang kepadaku.’ Maka datanglah Jabir bin Abdullah kepadanya, lalu Abu Bakar memberikan kepadanya harta sebanyak tiga genggaman.”"
  }
]