[
  {
    "id": 35276,
    "hadith_number": 1098,
    "tajuk_hadith": "Cara penyembelihan burung oleh Abdullah bin Umar",
    "perawi_melayu": "Yahya daripada Malik daripada Nafi'",
    "english_text": "ahya related to me from Malik that Nafi said, \"I was at al-Juruf\n(near Madina) and threw a stone at two birds, and hit them. One of\nthem died, and Abdullah ibn Umar threw it away, and then went to\nslaughter the other one with an adze. It died before he could\nslaughter it, so Abdullah threw that one away as well.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّهُ قَالَ رَمَيْتُ طَائِرَيْنِ بِحَجَرٍ وَأَنَا بِالْجُرْفِ، فَأَصَبْتُهُمَا فَأَمَّا أَحَدُهُمَا فَمَاتَ فَطَرَحَهُ عَبْدُ اللَّهِ بْنُ عُمَرَ وَأَمَّا الآخَرُ فَذَهَبَ عَبْدُ اللَّهِ بْنُ عُمَرَ يُذَكِّيهِ بِقَدُومٍ فَمَاتَ قَبْلَ أَنْ يُذَكِّيَهُ فَطَرَحَهُ عَبْدُ اللَّهِ أَيْضًا ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Nafi', bahawa dia berkata: \"Aku telah melempar dua ekor burung dengan sebiji batu ketika aku berada di al-Juruf (berhampiran Madinah), lalu aku terkena kedua-duanya. Salah seekor daripadanya mati, lalu Abdullah bin Umar membuangnya.  Manakala seekor lagi, Abdullah bin Umar cuba menyembelihnya dengan kapak kecil, tetapi ia mati sebelum sempat disembelih, lalu Abdullah membuangnya juga.\""
  },
  {
    "id": 35277,
    "hadith_number": 1099,
    "tajuk_hadith": "Al-Qasim bin Muhammad dan Buruan yang Dibunuh dengan Lemparan",
    "perawi_melayu": "Yahya meriwayatkan dari Malik",
    "english_text": "Yahya related to me from Malik that he had heard that al-Qasim\nibn Muhammad disapproved of eating game that had been killed with\nthrowing sticks and by clay pellets.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، كَانَ يَكْرَهُ مَا قَتَلَ الْمِعْرَاضُ وَالْبُنْدُقَةُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa baginda telah mendengar bahawa al-Qasim bin Muhammad tidak menyukai memakan binatang buruan yang dibunuh dengan menggunakan lemparan kayu dan peluru tanah liat."
  },
  {
    "id": 35278,
    "hadith_number": 1100,
    "tajuk_hadith": "Hukum Membunuh Haiwan Ternakan yang Menjadi Liar",
    "perawi_melayu": "Yahya meriwayatkan dari Malik bahawa beliau mendengar bahawa Said ibn al-Musayyab tidak menyukai membunuh haiwan ternakan yang telah menjadi liar dengan apa-apa cara yang digunakan untuk membunuh binatang buruan seperti dengan anak panah dan sebagainya.",
    "english_text": "",
    "arabic_text": "سَعِيدَ بْنَ الْمُسَيَّبِ، كَانَ يَكْرَهُ أَنْ تُقْتَلَ الإِنْسِيَّةُ، بِمَا يُقْتَلُ بِهِ الصَّيْدُ مِنَ الرَّمْىِ وَأَشْبَاهِهِ ‏.‏ قَالَ مَالِكٌ وَلاَ أَرَى بَأْسًا بِمَا أَصَابَ الْمِعْرَاضُ إِذَا خَسَقَ وَبَلَغَ الْمَقَاتِلَ أَنْ يُؤْكَلَ قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لَيَبْلُوَنَّكُمُ اللَّهُ بِشَىْءٍ مِنَ الصَّيْدِ تَنَالُهُ أَيْدِيكُمْ وَرِمَاحُكُمْ ‏}‏ قَالَ فَكُلُّ شَىْءٍ نَالَهُ الإِنْسَانُ بِيَدِهِ أَوْ رُمْحِهِ أَوْ بِشَىْءٍ مِنْ سِلاَحِهِ فَأَنْفَذَهُ وَبَلَغَ مَقَاتِلَهُ فَهُوَ صَيْدٌ كَمَا قَالَ اللَّهُ تَعَالَى",
    "malay_translation": "Said ibn al-Musayyab tidak menyukai pembunuhan haiwan ternakan yang telah menjadi liar dengan cara-cara yang digunakan untuk membunuh binatang buruan seperti menggunakan anak panah dan sebagainya. Malik berkata, \"Aku tidak nampak apa-apa masalah dengan memakan haiwan buruan yang terkena lemparan kayu yang menusuk organ penting.\" Allah SWT berfirman, \"Wahai orang-orang yang beriman! Sesungguhnya Allah akan menguji kamu dengan sesuatu daripada binatang buruan yang dapat dicapai oleh tangan dan lembing kamu.\" (Surah al-Maidah, ayat 97).  Apa sahaja yang didapati oleh manusia dengan tangannya, lembingnya atau dengan apa-apa senjata yang menembus dan mencapai organ pentingnya, ia adalah halal sepertimana yang telah Allah SWT firmankan."
  },
  {
    "id": 35279,
    "hadith_number": 1101,
    "tajuk_hadith": "Hukum Makan Buruan yang Dibantu oleh Faktor Lain",
    "perawi_melayu": "Yahya",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ أَنَّهُ سَمِعَ أَهْلَ الْعِلْمِ يَقُولُونَ إِذَا أَصَابَ الرَّجُلُ الصَّيْدَ فَأَعَانَهُ عَلَيْهِ غَيْرُهُ مِنْ مَاءٍ أَوْ كَلْبٍ غَيْرِ مُعَلَّمٍ لَمْ يُؤْكَلْ ذَلِكَ الصَّيْدُ إِلاَّ أَنْ يَكُونَ سَهْمُ الرَّامِي قَدْ قَتَلَهُ أَوْ بَلَغَ مَقَاتِلَ الصَّيْدِ حَتَّى لاَ يَشُكَّ أَحَدٌ فِي أَنَّهُ هُوَ قَتَلَهُ وَأَنَّهُ لاَ يَكُونُ لِلصَّيْدِ حَيَاةٌ بَعْدَهُ ‏.‏ قَالَ وَسَمِعْتُ مَالِكًا يَقُولُ لاَ بَأْسَ بِأَكْلِ الصَّيْدِ - وَإِنْ غَابَ عَنْكَ مَصْرَعُهُ - إِذَا وَجَدْتَ بِهِ أَثَرًا مِنْ كَلْبِكَ أَوْ كَانَ بِهِ سَهْمُكَ مَا لَمْ يَبِتْ فَإِذَا بَاتَ فَإِنَّهُ يُكْرَهُ أَكْلُهُ ‏.",
    "malay_translation": "Yahya meriwayatkan dari Malik bahawa beliau telah mendengar ahli ilmu berkata: \"Apabila seseorang memburu binatang buruan, dan ada faktor lain yang turut membantu membunuhnya, seperti air atau anjing yang tidak terlatih, maka binatang buruan itu tidak boleh dimakan melainkan jika jelas bahawa anak panah pemburu telah membunuhnya dengan terkena bahagian penting haiwan tersebut, sehingga tiada keraguan bahawa ia telah mati akibat anak panah itu dan binatang tersebut tidak lagi hidup selepas itu.\" Yahya berkata bahawa beliau mendengar Malik berkata: \"Tiada apa-apa masalah untuk memakan binatang buruan walaupun kamu tidak melihat bagaimana ia mati, jika kamu menjumpai kesan anjingmu atau anak panahmu padanya, selagi ia tidak bermalam.  Jika ia bermalam, maka dimakruhkan memakannya.\""
  },
  {
    "id": 35280,
    "hadith_number": 1102,
    "tajuk_hadith": "Memakan Hasil Buruan Anjing Terlatih",
    "perawi_melayu": "Yahya, Malik, Nafi', Abdullah bin Umar",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid about a trained dog, \"Eat whatever it catches for you whether it\neats from it or not.\"",
    "arabic_text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ يَقُولُ فِي الْكَلْبِ الْمُعَلَّمِ كُلْ مَا أَمْسَكَ عَلَيْكَ إِنْ قَتَلَ وَإِنْ لَمْ يَقْتُلْ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Nafi', daripada Abdullah bin Umar bahawa baginda berkata tentang anjing yang terlatih: \"Makanlah apa sahaja yang ia tangkap untukmu, sama ada ia memakannya atau tidak.\""
  },
  {
    "id": 35281,
    "hadith_number": 1103,
    "tajuk_hadith": "Pendapat Abdullah bin Umar tentang Makan Haiwan yang Mati Sendiri",
    "perawi_melayu": "Yahya (dari Malik) daripada Nafi', daripada Abdullah bin Umar",
    "english_text": "Yahya related to me from Malik that he heard Nafi say that\nAbdullah ibn Umar said, \"Whether it eats from it or not.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَمَّنْ سَمِعَ نَافِعًا، يَقُولُ قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ وَإِنْ أَكَلَ وَإِنْ لَمْ يَأْكُلْ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik bahawa beliau mendengar Nafi' berkata bahawa Abdullah bin Umar berkata, \"Sama ada ia memakannya atau tidak.\""
  },
  {
    "id": 35282,
    "hadith_number": 1104,
    "tajuk_hadith": "Hukum Memakan Daging Buruan yang Dibunuh Anjing Terlatih",
    "perawi_melayu": "Yahya daripada Malik daripada Saad bin Abi Waqqas",
    "english_text": "Yahya related to me from Malik that he had heard that Sad ibn Abi\nWaqqas had said, when asked about a trained dog killing game, \"Eat,\neven if only one piece of it remains.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، أَنَّهُ سُئِلَ عَنِ الْكَلْبِ الْمُعَلَّمِ، إِذَا قَتَلَ الصَّيْدَ فَقَالَ سَعْدٌ كُلْ وَإِنْ لَمْ تَبْقَ إِلاَّ بِضْعَةٌ وَاحِدَةٌ ‏.‏ وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، أَنَّهُ سُئِلَ عَنِ الْكَلْبِ الْمُعَلَّمِ، إِذَا قَتَلَ الصَّيْدَ فَقَالَ سَعْدٌ كُلْ وَإِنْ لَمْ تَبْقَ إِلاَّ بِضْعَةٌ وَاحِدَةٌ ‏.",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa baginda telah mendengar bahawa Saad bin Abi Waqqas telah berkata, apabila ditanya tentang anjing terlatih yang membunuh binatang buruan, \"Makanlah, walaupun hanya tinggal sebiji sahaja.\""
  },
  {
    "id": 35283,
    "hadith_number": 1105,
    "tajuk_hadith": "Kehalalan Makan Hasil Buruan Haiwan Buas Terlatih",
    "perawi_melayu": "Yahya melalui Malik",
    "english_text": "",
    "arabic_text": ".‏ وَحَدَّثَنِي عَنْ مَالِكٍ أَنَّهُ سَمِعَ بَعْضَ أَهْلِ الْعِلْمِ يَقُولُونَ فِي الْبَازِي وَالْعُقَابِ وَالصَّقْرِ وَمَا أَشْبَهَ ذَلِكَ أَنَّهُ إِذَا كَانَ يَفْقَهُ كَمَا تَفْقَهُ الْكِلاَبُ الْمُعَلَّمَةُ فَلاَ بَأْسَ بِأَكْلِ مَا قَتَلَتْ مِمَّا صَادَتْ إِذَا ذُكِرَ اسْمُ اللَّهِ عَلَى إِرْسَالِهَا ‏.‏ قَالَ مَالِكٌ وَأَحْسَنُ مَا سَمِعْتُ فِي الَّذِي يَتَخَلَّصُ الصَّيْدَ مِنْ مَخَالِبِ الْبَازِي أَوْ مِنَ الْكَلْبِ ثُمَّ يَتَرَبَّصُ بِهِ فَيَمُوتُ أَنَّهُ لاَ يَحِلُّ أَكْلُهُ ‏.‏ قَالَ مَالِكٌ وَكَذَلِكَ كُلُّ مَا قُدِرَ عَلَى ذَبْحِهِ وَهُوَ فِي مَخَالِبِ الْبَازِي أَوْ فِي الْكَلْبِ فَيَتْرُكُهُ صَاحِبُهُ وَهُوَ قَادِرٌ عَلَى ذَبْحِهِ حَتَّى يَقْتُلَهُ الْبَازِي أَوِ الْكَلْبُ فَإِنَّهُ لاَ يَحِلُّ أَكْلُهُ ‏.‏ قَالَ مَالِكٌ وَكَذَلِكَ الَّذِي يَرْمِي الصَّيْدَ فَيَنَالُهُ وَهُوَ حَىٌّ فَيُفَرِّطُ فِي ذَبْحِهِ حَتَّى يَمُوتَ فَإِنَّهُ لاَ يَحِلُّ أَكْلُهُ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّ الْمُسْلِمَ إِذَا أَرْسَلَ كَلْبَ الْمَجُوسِيِّ الضَّارِيَ فَصَادَ أَوْ قَتَلَ إِنَّهُ إِذَا كَانَ مُعَلَّمًا فَأَكْلُ ذَلِكَ الصَّيْدِ حَلاَلٌ لاَ بَأْسَ بِهِ وَإِنْ لَمْ يُذَكِّهِ الْمُسْلِمُ وَإِنَّمَا مَثَلُ ذَلِكَ مَثَلُ الْمُسْلِمِ يَذْبَحُ بِشَفْرَةِ الْمَجُوسِيِّ أَوْ يَرْمِي بِقَوْسِهِ أَوْ بِنَبْلِهِ فَيَقْتُلُ بِهَا فَصَيْدُهُ ذَلِكَ وَذَبِيحَتُهُ حَلاَلٌ لاَ بَأْسَ بِأَكْلِهِ وَإِذَا أَرْسَلَ الْمَجُوسِيُّ كَلْبَ الْمُسْلِمِ الضَّارِيَ عَلَى صَيْدٍ فَأَخَذَهُ فَإِنَّهُ لاَ يُؤْكَلُ ذَلِكَ الصَّيْدُ إِلاَّ أَنْ يُذَكَّى  وَإِنَّمَا مَثَلُ ذَلِكَ مَثَلُ قَوْسِ الْمُسْلِمِ وَنَبْلِهِ يَأْخُذُهَا الْمَجُوسِيُّ فَيَرْمِي بِهَا الصَّيْدَ فَيَقْتُلُهُ وَبِمَنْزِلَةِ شَفْرَةِ الْمُسْلِمِ يَذْبَحُ بِهَا الْمَجُوسِيُّ فَلاَ يَحِلُّ أَكْلُ شَىْءٍ مِنْ ذَلِكَ ‏.",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa beliau mendengar sebahagian daripada ulama berkata tentang burung helang, burung gagak, burung falcon dan seumpamanya, bahawa jika ia memahami sepertimana anjing yang terlatih memahami, maka tidak mengapa memakan apa yang dibunuh olehnya daripada hasil buruan, jika disebut nama Allah ketika ia dilepaskan.\n\nMalik berkata, \"Yang terbaik yang aku dengar tentang mendapatkan buruan daripada cakar burung helang atau daripada gigi anjing, kemudian menunggu sehingga ia mati, ialah ia tidak halal dimakan.\"\n\nMalik berkata, \"Begitu juga apa sahaja yang boleh disembelih ketika berada di cakar burung helang atau di gigi anjing. Jika pemburu membiarkannya sehingga burung helang atau anjing membunuhnya, maka ia tidak halal dimakan juga.\" Beliau meneruskan, \"Begitu juga mana-mana buruan yang terkena panahan pemburu dan ditangkap ketika masih hidup, yang dia abaikan untuk menyembelih sebelum ia mati.\"\n\nMalik berkata, \"Secara umumnya dipersetujui di kalangan kami bahawa halal memakan buruan yang diburu atau dibunuh oleh anjing pemburu milik Majusi, jika dilepaskan oleh seorang Muslim dan haiwan itu terlatih. Tidak mengapa walaupun Muslim itu tidak menyembelihnya.\n\nIa sama seperti seorang Muslim menggunakan pisau milik Majusi untuk menyembelih atau menggunakan anak panah dan busurnya untuk menembak dan membunuh. Buruan yang ditembaknya dan haiwan yang disembelihnya adalah halal. Tidak mengapa memakannya. Jika seorang Majusi melepaskan anjing pemburu milik Muslim ke atas buruan, dan ia menangkapnya, maka buruan itu tidak boleh dimakan melainkan ia disembelih oleh seorang Muslim.  Ia sepertimana Majusi menggunakan anak panah dan busur milik Muslim untuk memburu, atau sepertimana dia menggunakan pisau milik Muslim untuk menyembelih. Tidak halal memakan apa sahaja yang dibunuh dengan cara sedemikian."
  },
  {
    "id": 35284,
    "hadith_number": 1106,
    "tajuk_hadith": "Kehalalan Makan Hasil Laut",
    "perawi_melayu": "Yahya, Malik, dan Nafi'",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَبِي هُرَيْرَةَ، سَأَلَ عَبْدَ اللَّهِ بْنَ عُمَرَ عَمَّا لَفَظَ الْبَحْرُ فَنَهَاهُ عَنْ أَكْلِهِ، ‏.‏ قَالَ نَافِعٌ ثُمَّ انْقَلَبَ عَبْدُ اللَّهِ فَدَعَا بِالْمُصْحَفِ فَقَرَأَ ‏{‏أُحِلَّ لَكُمْ صَيْدُ الْبَحْرِ وَطَعَامُهُ‏}‏ قَالَ نَافِعٌ فَأَرْسَلَنِي عَبْدُ اللَّهِ بْنُ عُمَرَ إِلَى عَبْدِ الرَّحْمَنِ بْنِ أَبِي هُرَيْرَةَ إِنَّهُ لاَ بَأْسَ بِأَكْلِهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Nafi', bahawa Abdur Rahman bin Abi Hurairah bertanya kepada Abdullah bin Umar tentang sesuatu yang terdampar di laut, lalu Abdullah melarangnya memakannya. Nafi' berkata, \"Kemudian Abdullah kembali dan mengambil mushaf lalu membaca,  \"Dihalalkan bagi kamu binatang buruan laut dan makanannya.\" Nafi' berkata, \"Kemudian Abdullah bin Umar menghantar aku kepada Abdur Rahman bin Abi Hurairah untuk memberitahu bahawa tidak mengapa memakannya.\""
  },
  {
    "id": 35285,
    "hadith_number": 1107,
    "tajuk_hadith": "Hukum Makan Ikan yang Mati Sendiri",
    "perawi_melayu": "Yahya daripada Malik daripada Zayd bin Aslam daripada Saad al-Jari, hamba Umar bin al-Khattab",
    "english_text": "Yahya related to me from Malik from Zayd ibn Aslam that Sad al-\nJari, the mawla of Umar ibn al-Khattab asked Abdullah ibn Umar about\nfish which had killed each other or which had died from severe cold .\nHe said, \"There is no harm in eating them.'' Sad said,' 'I then asked\nAbdullah ibn Amr ibn al As and he said the same.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ سَعْدٍ الْجَارِيِّ، مَوْلَى عُمَرَ بْنِ الْخَطَّابِ أَنَّهُ قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ عَنِ الْحِيتَانِ، يَقْتُلُ بَعْضُهَا بَعْضًا أَوْ تَمُوتُ صَرَدًا فَقَالَ لَيْسَ بِهَا بَأْسٌ ‏.‏ قَالَ سَعْدٌ ثُمَّ سَأَلْتُ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ فَقَالَ مِثْلَ ذَلِكَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Zayd bin Aslam, daripada Saad al-Jari, hamba Umar bin al-Khattab bahawa beliau berkata: Aku bertanya kepada Abdullah bin Umar tentang ikan-ikan yang membunuh antara satu sama lain atau yang mati kerana kesejukan yang melampau.  Maka beliau menjawab, \"Tidak mengapa untuk memakannya.\" Saad berkata, \"Kemudian aku bertanya kepada Abdullah bin Amr bin al-As, dan beliau menjawab perkara yang sama.\""
  },
  {
    "id": 35286,
    "hadith_number": 1108,
    "tajuk_hadith": "Kehalalan Makanan yang Terhanyut di Laut",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Abu Az-Zinad, daripada Abu Salamah bin Abd ar-Rahman, daripada Abu Hurairah dan Zayd bin Thabit",
    "english_text": "Yahya related to me from Malik from Abu'z-Zinad from Abu Salama\nibn Abd ar-Rahman from Abu Hurayra and Zayd ibn Thabit that they saw\nno harm in eating what was cast up by the sea.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، وَزَيْدِ بْنِ ثَابِتٍ، أَنَّهُمَا كَانَا لاَ يَرَيَانِ بِمَا لَفَظَ الْبَحْرُ بَأْسًا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik, daripada Abu Az-Zinad, daripada Abu Salamah bin Abd ar-Rahman, daripada Abu Hurairah dan Zayd bin Thabit bahawa mereka berdua tidak menganggap sesuatu yang buruk untuk memakan apa yang terhanyut di laut."
  },
  {
    "id": 35287,
    "hadith_number": 1109,
    "tajuk_hadith": "Kehalalan Memakan Hasil Laut",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Abu az-Zinad, dari Abu Salama bin Abd ar-Rahman",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ نَاسًا، مِنْ أَهْلِ الْجَارِ قَدِمُوا فَسَأَلُوا مَرْوَانَ بْنَ الْحَكَمِ عَمَّا لَفَظَ الْبَحْرُ فَقَالَ لَيْسَ بِهِ بَأْسٌ وَقَالَ اذْهَبُوا إِلَى زَيْدِ بْنِ ثَابِتٍ وَأَبِي هُرَيْرَةَ فَاسْأَلُوهُمَا عَنْ ذَلِكَ ثُمَّ ائْتُونِي فَأَخْبِرُونِي مَاذَا يَقُولاَنِ فَأَتَوْهُمَا فَسَأَلُوهُمَا فَقَالاَ لاَ بَأْسَ بِهِ ‏.‏ فَأَتَوْا مَرْوَانَ فَأَخْبَرُوهُ ‏.‏ فَقَالَ مَرْوَانُ قَدْ قُلْتُ لَكُمْ ‏.‏ قَالَ مَالِكٌ لاَ بَأْسَ بِأَكْلِ الْحِيتَانِ يَصِيدُهَا الْمَجُوسِيُّ لأَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ فِي الْبَحْرِ ‏\n\"‏ هُوَ الطَّهُورُ مَاؤُهُ الْحِلُّ مَيْتَتُهُ ‏\"‏ ‏.‏ قَالَ مَالِكٌ وَإِذَا أُكِلَ ذَلِكَ مَيْتًا فَلاَ يَضُرُّهُ مَنْ صَادَهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abu az-Zinad, daripada Abu Salama bin Abd ar-Rahman bahawa beberapa orang dari penduduk al-Jar datang kepada Marwan bin al-Hakam dan bertanya kepadanya tentang memakan apa yang terhanyut di laut.  Marwan berkata, \"Tiada apa-apa yang salah dengan memakannya.\"  Kemudian Marwan berkata, \"Pergilah kepada Zayd bin Thabit dan Abu Hurairah, tanyakan kepada mereka tentang hal ini, kemudian kembalilah dan beritahu aku apa yang mereka katakan.\" Mereka pun pergi kepada mereka dan bertanya, dan mereka berdua menjawab, \"Tiada apa-apa yang salah dengan memakannya.\" Mereka kembali kepada Marwan dan memberitahunya. Marwan berkata, \"Seperti yang telah aku katakan kepada kamu.\" \n\nMalik berkata bahawa tiada apa yang salah dengan memakan ikan yang ditangkap oleh Majusi, kerana Rasulullah SAW bersabda,  \"Laut itu suci airnya, dan bangkainya halal.\" \n\nMalik berkata, \"Sekiranya ia dimakan dalam keadaan mati, maka tidak mengapa siapa yang menangkapnya.\""
  },
  {
    "id": 35288,
    "hadith_number": 1110,
    "tajuk_hadith": "Larangan Memakan Haiwan Berbisa",
    "perawi_melayu": "Yahya, Malik, Ibnu Shihab, Abu Idris al-Khawlani, dan Abu Tha'laba al-Khushani",
    "english_text": "Yahya related to me from Malik from Ibn Shibab from Abu Idris al-\nKhawlani from Abu Tha~laba al-Khushani that the Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"It is haram to eat\nanimals with fangs \"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنِ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ، عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَكْلُ كُلِّ ذِي نَابٍ مِنَ السِّبَاعِ حَرَامٌ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Ibnu Shihab, dari Abu Idris al-Khawlani, dari Abu Tha'laba al-Khushani bahawa Rasulullah SAW bersabda:  \"Memakan sebarang haiwan berbisa adalah haram.\""
  },
  {
    "id": 35289,
    "hadith_number": 1111,
    "tajuk_hadith": "Keharaman Memakan Haiwan Berbisa",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Ismail bin Abi Hakim, daripada Abiyda bin Sufyan al-Hadrami, daripada Abu Hurairah",
    "english_text": "Yahya related to me from Malik from Ismail ibn Abi Hakim from\nAbiyda ibn Sufyan al-Hadrami from Abu Hurayra that the Messenger of\nAllah, may Allah bless him and grant him peace, said, \"Eating animals\nwith fangs is haram. \"\n\n\nMalik said, \"This is the custom among\nus.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي حَكِيمٍ، عَنْ عَبِيدَةَ بْنِ سُفْيَانَ الْحَضْرَمِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَكْلُ كُلِّ ذِي نَابٍ مِنَ السِّبَاعِ حَرَامٌ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ismail bin Abi Hakim, daripada Abiyda bin Sufyan al-Hadrami, daripada Abu Hurairah bahawa Rasulullah SAW bersabda: \"Memakan semua haiwan berbisa adalah haram.\" \n\nMalik berkata: \"Inilah adat kebiasaan di kalangan kami.\""
  },
  {
    "id": 35290,
    "hadith_number": 1112,
    "tajuk_hadith": "Kegunaan Kuda, Keldai, dan Bestir",
    "perawi_melayu": "Yahya melalui Malik",
    "english_text": "Yahya related to me from Malik that the best of what he had heard\nabout horses, mules, and donkeys was that they were not eaten because\nAllah, the Blessed, the Exalted,said, \"And horses, and mules and\nasses, for you to ride, and as an adornment. \" (Sura 16 ayat 8) . He\nsaid, may He be Blessed and Exalted, \"In cattle, some of them you\nride, and some of them you eat.\" (Sura 6 ayat 79). He said, the\nBlessed, the Exalted, \"Mention Allah's name over what He has provided\nyou of cattle, and eat of them and feed the beggar (al-qani) and the\nsuppliant (al-mutarr). (Sura 22 ayat 34).\n\n\nMalik said \"Allah\nmentioned horses, mules, and donkeys for riding and adornment, and He\nmentioned cattle for riding and eating.\"\n\n\nMalik said, \"Al-qani\nalso means the poor.\"",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan dari Malik bahawa yang terbaik daripada apa yang telah didengarnya tentang kuda, keldai, dan binatang beban ialah bahawa ia tidak dimakan kerana Allah SWT berfirman, \"Dan kuda, keldai, dan binatang beban untuk kamu tunggang dan sebagai perhiasan.\" (Surah 16, ayat 8).  Allah SWT juga berfirman, \"Di antara binatang ternak, ada yang kamu tunggang dan ada yang kamu makan.\" (Surah 6, ayat 79).  Allah SWT juga berfirman, \"Sebutlah nama Allah ke atas apa yang telah direzekikan-Nya kepadamu dari binatang ternak, maka makanlah daripadanya dan berilah makan kepada orang yang meminta-minta (al-qani) dan orang yang memerlukan (al-mutarr).\" (Surah 22, ayat 34).\n\nMalik berkata, \"Allah menyebut kuda, keldai dan binatang beban untuk ditunggang dan sebagai perhiasan, dan Dia menyebut binatang ternak untuk ditunggang dan dimakan.\"\n\nMalik berkata, \"Al-qani juga bermaksud orang miskin.\""
  },
  {
    "id": 35291,
    "hadith_number": 1113,
    "tajuk_hadith": "Larangan Memakan Bangkai, Kulitnya Boleh Digunakan",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Ubaydullah ibn Abdullah ibn Utba ibn Masud, daripada Abdullah ibn Abbas",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّهُ قَالَ مَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِشَاةٍ مَيِّتَةٍ كَانَ أَعْطَاهَا مَوْلاَةً لِمَيْمُونَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَفَلاَ انْتَفَعْتُمْ بِجِلْدِهَا ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّهَا مَيْتَةٌ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا حُرِّمَ أَكْلُهَا ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Ubaydullah ibn Abdullah ibn Utba ibn Masud, daripada Abdullah ibn Abbas bahawa beliau berkata, \"Rasulullah SAW melalui seekor kambing mati yang telah diberikan kepada seorang hamba perempuan isterinya, Maimunah. Baginda bertanya, \"Mengapa kamu tidak memanfaatkan kulitnya?\" Mereka menjawab, \"Wahai Rasulullah, ia adalah bangkai.\" Rasulullah SAW bersabda, \"Hanya memakan bangkai itu sahaja yang diharamkan.\""
  },
  {
    "id": 35292,
    "hadith_number": 1114,
    "tajuk_hadith": "Kesucian Kulit yang Disamak",
    "perawi_melayu": "Malik meriwayatkan daripada Zayd ibn Aslam daripada Ibn Wala al-Misri daripada Abdullah ibn Abbas",
    "english_text": "Malik related to me from Zayd ibn Aslam from Ibn Wala al-Misri\nfrom Abdullah ibn Abbas that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"A skin when it is tanned is pure.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنِ ابْنِ وَعْلَةَ الْمِصْرِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا دُبِغَ الإِهَابُ فَقَدْ طَهُرَ ‏\"‏ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Zayd bin Aslam, daripada Ibnu Wala al-Misri, daripada Abdullah bin Abbas bahawa Rasulullah SAW bersabda:  \"Apabila kulit telah disamak, maka ia telah suci.\""
  },
  {
    "id": 35293,
    "hadith_number": 1115,
    "tajuk_hadith": "Kegunaan Kulit Bangkai Selepas Disamak",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Yazid bin Abdullah bin Qusayt, daripada Muhammad bin Abd ar-Rahman bin Thawban, daripada ibunya, daripada Aisyah, isteri Nabi SAW.",
    "english_text": "Yahya related to me from Malik from Yazid ibn Abdullah ibn Qusayt\nfrom Muhammad ibn Abd ar-Rahman ibn Thawban from his mother that\nA'isha, the wife of the Prophet, may Allah bless him and grant him\npeace, said that the Messenger of Allah, may Allah bless him and grant\nhim peace, ordered that the skins of carrion be used after they had\nbeen tanned.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ أَنْ يُسْتَمْتَعَ بِجُلُودِ الْمَيْتَةِ إِذَا دُبِغَتْ ‏.‏",
    "malay_translation": "Aisyah, isteri Nabi Muhammad SAW, berkata bahawa Rasulullah SAW memerintahkan supaya kulit bangkai boleh digunakan setelah ia disamak."
  },
  {
    "id": 35294,
    "hadith_number": 1116,
    "tajuk_hadith": "Hukum Memakan Bangkai Atas Keadaan Darurat",
    "perawi_melayu": "Yahya melalui Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan dari Malik bahawa yang terbaik daripada apa yang beliau dengar tentang seseorang yang terpaksa makan bangkai kerana keadaan darurat ialah dia memakannya sehingga kenyang, kemudian dia mengambil sedikit bekal daripadanya. Jika dia menjumpai sesuatu yang membolehkannya meninggalkan bangkai itu, maka hendaklah dia membuangnya.\n\nMalik, apabila ditanya sama ada seseorang yang terpaksa makan bangkai kerana keadaan darurat perlu memakannya sedangkan dia juga menjumpai buah-buahan, tanaman atau kambing biri-biri milik penduduk di tempat itu, menjawab: \"Jika dia beranggapan bahawa pemilik buah-buahan, tanaman atau kambing biri-biri itu akan mempercayai keadaan daruratnya,  sehingga dia tidak dianggap pencuri dan tangannya tidak dipotong, maka saya fikir dia harus makan apa sahaja yang dijumpainya untuk menghilangkan rasa lapar, tetapi dia tidak boleh membawa apa-apa darinya. Saya lebih suka dia berbuat demikian daripada makan bangkai. Jika dia bimbang tidak akan dipercayai, dan dianggap pencuri kerana apa yang diambilnya, maka saya fikir adalah lebih baik baginya untuk makan bangkai, dan dia dibenarkan makan bangkai dalam keadaan ini. Walaupun begitu, saya bimbang sesetengah orang yang tidak terpaksa makan bangkai mungkin akan melampaui batas kerana keinginan untuk memakan harta benda, tanaman atau buah-buahan orang lain.\"\n\nMalik berkata: \"Itulah yang terbaik daripada apa yang telah saya dengar.\""
  }
]