[
  {
    "id": 34829,
    "hadith_number": 651,
    "tajuk_hadith": "Mula dan Akhir Ramadan Ditentukan dengan Melihat Anak Bulan",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Nafi daripada Abdullah ibn Umar",
    "english_text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nonce mentioned Ramadan and said, \"Do not begin the fast until you see\nthe new moon, and do not break the fast (at the end of Ramadan) until\nyou see it. If the new moon is obscured from you, then work out (when\nit should be).\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ذَكَرَ رَمَضَانَ فَقَالَ ‏\n\"‏ لاَ تَصُومُوا حَتَّى تَرَوُا الْهِلاَلَ وَلاَ تُفْطِرُوا حَتَّى تَرَوْهُ فَإِنْ غُمَّ عَلَيْكُمْ فَاقْدُرُوا لَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Nafi', daripada Abdullah bin Umar, bahawa Rasulullah SAW pernah menyebut tentang Ramadan dan bersabda, \"Janganlah kamu berpuasa sehingga kamu melihat anak bulan, dan janganlah kamu berbuka (pada akhir Ramadan) sehingga kamu melihatnya. Jika anak bulan itu terhalang daripada kamu, maka tentukanlah (bilangan harinya).\""
  },
  {
    "id": 34830,
    "hadith_number": 652,
    "tajuk_hadith": "Bulan Hijriah: Penetapan Awal dan Akhir Ramadan",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Abdullah bin Dinar, daripada Abdullah bin Umar bahawa Rasulullah SAW bersabda:",
    "english_text": "Yahya related to me from Malik from Abdullah ibn Dinar from\nAbdullah ibn Umar that the Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"A month has twenty-nine days in it. Do not\nstart the fast or break it until you see the new moon. If the new moon\nis obscured from you, then work out (when it should be).\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الشَّهْرُ تِسْعٌ وَعِشْرُونَ فَلاَ تَصُومُوا حَتَّى تَرَوُا الْهِلاَلَ وَلاَ تُفْطِرُوا حَتَّى تَرَوْهُ فَإِنْ غُمَّ عَلَيْكُمْ فَاقْدُرُوا لَهُ ‏\"‏ ‏.‏",
    "malay_translation": "\"Sebulan itu (kadang-kadang) dua puluh sembilan hari. Janganlah kamu berpuasa sehingga kamu melihat hilal (anak bulan), dan janganlah kamu berbuka (berhari raya) sehingga kamu melihatnya. Jika hilal itu terlindung daripada kamu, maka tentukanlah (angkanya).\""
  },
  {
    "id": 34831,
    "hadith_number": 653,
    "tajuk_hadith": "Mengenai Permulaan dan Pengakhiran Puasa Ramadan",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Thawr ibn Zayd ad-Dili daripada Abdullah ibn Abbas",
    "english_text": "Yahya related to me from Malik from Thawr ibn Zayd ad-Dili from\nAbdullah ibn Abbas that the Messenger of Allah, may Allah bless him\nand grant him peace, once mentioned Ramadan and said, \"Do not start\nthe fast or break it until you see the new moon. If the new moon is\nobscured from you, then complete a full thirty days.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ذَكَرَ رَمَضَانَ فَقَالَ ‏\n\"‏ لاَ تَصُومُوا حَتَّى تَرَوُا الْهِلاَلَ وَلاَ تُفْطِرُوا حَتَّى تَرَوْهُ فَإِنْ غُمَّ عَلَيْكُمْ فَأَكْمِلُوا الْعِدَّةَ ثَلاَثِينَ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Thawr bin Zayd ad-Dili, daripada Abdullah bin Abbas, bahawa Rasulullah ﷺ menyebut tentang Ramadan dan bersabda, \"Janganlah kamu berpuasa sehingga kamu melihat anak bulan, dan janganlah kamu berbuka sehingga kamu melihatnya. Jika anak bulan itu terlindung daripada kamu, maka genapkanlah bilangan (hari) menjadi tiga puluh.\""
  },
  {
    "id": 34832,
    "hadith_number": 654,
    "tajuk_hadith": "Melihat Anak Bulan Ramadan dan Syawal: Amalan dan Hukum",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik",
    "english_text": "Yahya related to me from Malik that he had heard that once in the\ntime of Uthman ibn Affan the new moon had been seen in the afternoon\nand Uthman did not break his fast until evening had come and the sun\nhad set.\n\n\nYahya said that he had heard Malik say that some one\nwho sees the new moon of Ramadan when he is on his own should start\nthe fast and not break it if he knows that that day is part of\nRamadan. He added, \"Some one who sees the new moon of Shawwal when he\nis on his own does not break the fast, because people suspect the\nreliability of someone among them who breaks the fast. Such people\nshould say, when they sight the new moon, 'We have seen the new moon.'\nWhoever sees the new moon of Shawwal during the day should not break\nhis fast but should continue fasting for the rest of that day. This is\nbecause it is really the new moon of the night that is coming .\"\n\n\nYahya said that he heard Malik say, \"If people are fasting on the\nday of Fitr thinking that it is still Ramadan and then definite\nevidence comes to them that the new moon of Ramadan had been seen one\nday before they began to fast and that they are now into the thirty-\nfirst day, then they should break the fast on that day at whatever\ntime the news comes to them. However, they do not pray the id prayer\nif they hear the news after the sun has begun to decline.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ الْهِلاَلَ، رُئِيَ فِي زَمَانِ عُثْمَانَ بْنِ عَفَّانَ بِعَشِيٍّ فَلَمْ يُفْطِرْ عُثْمَانُ حَتَّى أَمْسَى وَغَابَتِ الشَّمْسُ ‏.‏ قَالَ يَحْيَى سَمِعْتُ مَالِكًا يَقُولُ فِي الَّذِي يَرَى هِلاَلَ رَمَضَانَ وَحْدَهُ أَنَّهُ يَصُومُ لاَ يَنْبَغِي لَهُ أَنْ يُفْطِرَ وَهُوَ يَعْلَمُ أَنَّ ذَلِكَ الْيَوْمَ مِنْ رَمَضَانَ ‏.‏ قَالَ وَمَنْ رَأَى هِلاَلَ شَوَّالٍ وَحْدَهُ فَإِنَّهُ لاَ يُفْطِرُ لأَنَّ النَّاسَ يَتَّهِمُونَ عَلَى أَنْ يُفْطِرَ مِنْهُمْ مَنْ لَيْسَ مَأْمُونًا وَيَقُولُ أُولَئِكَ إِذَا ظَهَرَ عَلَيْهِمْ قَدْ رَأَيْنَا الْهِلاَلَ وَمَنْ رَأَى هِلاَلَ شَوَّالٍ نَهَارًا فَلاَ يُفْطِرْ وَيُتِمُّ صِيَامَ يَوْمِهِ ذَلِكَ فَإِنَّمَا هُوَ هِلاَلُ اللَّيْلَةِ الَّتِي تَأْتِي ‏.‏ قَالَ يَحْيَى وَسَمِعْتُ مَالِكًا يَقُولُ إِذَا صَامَ النَّاسُ يَوْمَ الْفِطْرِ - وَهُمْ يَظُنُّونَ أَنَّهُ مِنْ رَمَضَانَ - فَجَاءَهُمْ ثَبَتٌ أَنَّ هِلاَلَ رَمَضَانَ قَدْ رُئِيَ قَبْلَ أَنْ يَصُومُوا بِيَوْمٍ وَأَنَّ يَوْمَهُمْ ذَلِكَ أَحَدٌ وَثَلاَثُونَ فَإِنَّهُمْ يُفْطِرُونَ فِي ذَلِكَ الْيَوْمِ أَيَّةَ سَاعَةٍ جَاءَهُمُ الْخَبَرُ غَيْرَ أَنَّهُمْ لاَ يُصَلُّونَ صَلاَةَ الْعِيدِ إِنْ كَانَ ذَلِكَ جَاءَهُمْ بَعْدَ زَوَالِ الشَّمْسِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik bahawa beliau mendengar bahawa pada zaman Uthman bin Affan, anak bulan pernah dilihat pada waktu petang dan Uthman tidak berbuka puasa sehingga tiba waktu malam dan matahari telah terbenam.\n\n\nYahya berkata bahawa beliau mendengar Malik berkata bahawa seseorang yang melihat anak bulan Ramadan seorang diri hendaklah memulakan puasa dan tidak boleh berbuka jika dia tahu bahawa hari itu adalah sebahagian daripada Ramadan. Beliau menambah, \"Seseorang yang melihat anak bulan Syawal seorang diri tidak boleh berbuka puasa, kerana orang ramai mengesyaki kebolehpercayaan seseorang di antara mereka yang berbuka puasa. Orang seperti itu harus berkata, apabila mereka melihat anak bulan, 'Kami telah melihat anak bulan.' Sesiapa yang melihat anak bulan Syawal pada siang hari tidak boleh berbuka puasa tetapi harus meneruskan puasanya sepanjang hari itu. Ini kerana ia sebenarnya anak bulan malam yang akan datang.\"\n\n\nYahya berkata bahawa beliau mendengar Malik berkata, \"Jika orang ramai berpuasa pada hari Fitr dengan menyangka bahawa ia masih Ramadan dan kemudian bukti yang pasti datang kepada mereka bahawa anak bulan Ramadan telah dilihat sehari sebelum mereka mula berpuasa dan bahawa hari mereka itu adalah hari ke-31, maka mereka harus berbuka puasa pada hari itu pada bila-bila masa berita itu sampai kepada mereka. Walau bagaimanapun, mereka tidak menunaikan solat Aid jika mereka mendengar berita itu selepas matahari mula tergelincir.\""
  },
  {
    "id": 34833,
    "hadith_number": 655,
    "tajuk_hadith": "Niat Puasa Sebelum Fajar",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Nafi', bahawa Abdullah bin Umar রাদিয়াল্লাহু আনহু biasa berkata, \"Tidak berpuasa kecuali orang yang berniat puasa sebelum fajar.\"",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar used to say, \"Only some one who makes the intention to fast before dawn (actually) fasts.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ يَقُولُ لاَ يَصُومُ إِلاَّ مَنْ أَجْمَعَ الصِّيَامَ قَبْلَ الْفَجْرِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Nafi', bahawa Abdullah bin Umar রাদিয়াল্লাহু আনহু biasa berkata, \"Tidak berpuasa kecuali orang yang berniat puasa sebelum fajar.\""
  },
  {
    "id": 34834,
    "hadith_number": 656,
    "tajuk_hadith": "Pernyataan Aisyah dan Hafsah, Isteri-isteri Nabi SAW",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Ibn Shihab bahawa Aisyah dan Hafsah, isteri-isteri Nabi SAW, juga berkata demikian.",
    "english_text": "Yahya related to me from Malik from Ibn Shihab that A'isha and Hafsa, the wives of the Prophet, may Allah bless him and grant him peace, also said that.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَائِشَةَ، وَحَفْصَةَ، زَوْجَىِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ ذَلِكَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Ibn Shihab, daripada Aisyah dan Hafsah, isteri-isteri Nabi SAW, dengan perkara yang serupa."
  },
  {
    "id": 34835,
    "hadith_number": 657,
    "tajuk_hadith": "Kelebihan Menyegerakan Berbuka Puasa",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Abu Hazim ibn Dinar, daripada Sahl ibn Sa'd as-Sa'idi, bahawa Rasulullah SAW bersabda:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَزَالُ النَّاسُ بِخَيْرٍ مَا عَجَّلُوا الْفِطْرَ ‏\"‏ ‏.‏",
    "malay_translation": "\"Manusia akan sentiasa berada dalam kebaikan selagi mereka menyegerakan berbuka puasa.\""
  },
  {
    "id": 34836,
    "hadith_number": 658,
    "tajuk_hadith": "Keutamaan Menyegerakan Berbuka Puasa",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Abd ar-Rahman ibn Harmala al-Aslami, daripada Said ibn al-Musayyab, bahawa Rasulullah SAW bersabda,",
    "english_text": "Yahya related to me from Malik from Abd ar-Rahman ibn Harmala al-\nAslami from Said ibn al-Musayyab that the Messenger of Allah, may\nAllah bless him and grant him peace, said, \"People will remain in good\nas long as they are quick to break the fast.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَرْمَلَةَ الأَسْلَمِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَزَالُ النَّاسُ بِخَيْرٍ مَا عَجَّلُوا الْفِطْرَ ‏\"‏ ‏.‏",
    "malay_translation": "\"Manusia akan sentiasa berada dalam kebaikan selagi mereka menyegerakan berbuka puasa.\""
  },
  {
    "id": 34837,
    "hadith_number": 659,
    "tajuk_hadith": "Umar dan Uthman Menunaikan Solat Maghrib Sebelum Berbuka Puasa di Bulan Ramadan",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Ibn Shihab daripada Humayd ibn Abd ar-Rahman",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Humayd ibn\nAbd ar-Rahman that Umar ibn al-Khattab and Uthman ibn Affan would pray\nmaghrib when they saw the night darkening, before they broke their\nfast, and that was during Ramadan.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، وَعُثْمَانَ بْنَ عَفَّانَ، كَانَا يُصَلِّيَانِ الْمَغْرِبَ حِينَ يَنْظُرَانِ إِلَى اللَّيْلِ الأَسْوَدِ قَبْلَ أَنْ يُفْطِرَا ثُمَّ يُفْطِرَانِ بَعْدَ الصَّلاَةِ وَذَلِكَ فِي رَمَضَانَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Ibn Shihab daripada Humayd ibn Abd ar-Rahman bahawa Umar bin al-Khattab dan Uthman bin Affan menunaikan solat Maghrib apabila mereka melihat kegelapan malam, sebelum mereka berbuka puasa, dan itu adalah pada bulan Ramadan."
  },
  {
    "id": 34838,
    "hadith_number": 660,
    "tajuk_hadith": "Rasulullah SAW Berpuasa Walaupun Berjunub di Pagi Hari",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Abdullah ibn Abd ar-Rahman ibn Mamar al-Ansari daripada Abu Yunus, maula A'isha, daripada A'isha",
    "english_text": "Yahya related to me from Malik from Abdullah ibn Abd ar-Rahman\nibn Mamar al-Ansari from Abu Yunus, the mawla of A'isha, from  A'isha\nthat she overheard a man standing at the door saying to the Messenger\nof Allah, may Allah bless him and grant him peace, \"Messenger of\nAllah, I get up in the morning junub, in a state of major ritual\nimpurity, and want to fast,\" and the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"I too get up in the morning\njunub and want to fast, so I do ghusl and fast.\"  The man said to him,\n\"You are not the same as us. Allah has forgiven you all your wrong\nactions that have gone before and those that have come after.\"  The\nMessenger of Allah, may Allah bless him and grant him peace, got angry\nand said, \"By Allah, I hope that I am the most fearful of you with\nrespect to Allah and the most knowledgeable of you in how I have\ntaqwa.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ مَعْمَرٍ الأَنْصَارِيِّ، عَنْ أَبِي يُونُسَ، مَوْلَى عَائِشَةَ عَنْ عَائِشَةَ، أَنَّ رَجُلاً، قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ وَاقِفٌ عَلَى الْبَابِ وَأَنَا أَسْمَعُ يَا رَسُولَ اللَّهِ إِنِّي أُصْبِحُ جُنُبًا وَأَنَا أُرِيدُ الصِّيَامَ ‏.‏ فَقَالَ صلى الله عليه وسلم ‏\"‏ وَأَنَا أُصْبِحُ جُنُبًا وَأَنَا أُرِيدُ الصِّيَامَ فَأَغْتَسِلُ وَأَصُومُ ‏\"‏ ‏.‏ فَقَالَ لَهُ الرَّجُلُ يَا رَسُولَ اللَّهِ إِنَّكَ لَسْتَ مِثْلَنَا قَدْ غَفَرَ اللَّهُ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ ‏.‏ فَغَضِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏\"‏ وَاللَّهِ إِنِّي لأَرْجُو أَنْ أَكُونَ أَخْشَاكُمْ لِلَّهِ وَأَعْلَمَكُمْ بِمَا أَتَّقِي ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Abdullah ibn Abd ar-Rahman ibn Mamar al-Ansari daripada Abu Yunus, maula A'isha, daripada A'isha bahawa dia terdengar seorang lelaki berdiri di pintu berkata kepada Rasulullah SAW, \"Ya Rasulullah, saya bangun di pagi hari dalam keadaan junub, dalam keadaan hadas besar, dan saya ingin berpuasa.\" Rasulullah SAW bersabda, \"Saya juga bangun di pagi hari dalam keadaan junub dan saya ingin berpuasa, jadi saya mandi wajib dan berpuasa.\" Lelaki itu berkata kepadanya, \"Engkau tidak sama seperti kami. Allah telah mengampuni dosa-dosamu yang telah lalu dan yang akan datang.\" Rasulullah SAW marah dan bersabda, \"Demi Allah, aku berharap menjadi orang yang paling takut di antara kamu kepada Allah dan yang paling berpengetahuan di antara kamu tentang bagaimana aku bertakwa.\""
  },
  {
    "id": 34839,
    "hadith_number": 661,
    "tajuk_hadith": "Nabi Muhammad SAW Berpuasa Walaupun Berada Dalam Keadaan Junub di Bulan Ramadan",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Abd Rabbih ibn Said, daripada Abu Bakr ibn Abd ar-Rahman ibn al-Harith ibn Hisham, daripada Aisyah dan Umm Salama, isteri-isteri Nabi SAW.",
    "english_text": "Yahya related to me from Malik from Abd Rabbih ibn Said from Abu\nBakr ibn Abd ar-Rahman ibn al-Harith ibn Hisham from A'isha and Umm\nSalama, the wives of the Prophet, may Allah bless him and grant him\npeace, that the Prophet, may Allah bless him and grant him peace, used\nto get up in the morning  junub from intercourse, not a dream, in\nRamadan, and then he would fast.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ عَائِشَةَ، وَأُمِّ سَلَمَةَ زَوْجَىِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُمَا قَالَتَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصْبِحُ جُنُبًا مِنْ جِمَاعٍ غَيْرِ احْتِلاَمٍ فِي رَمَضَانَ ثُمَّ يَصُومُ ‏.‏",
    "malay_translation": "Bahawa Rasulullah SAW pernah berada dalam keadaan junub pada waktu pagi disebabkan persetubuhan, bukan mimpi, di bulan Ramadan, kemudian baginda berpuasa."
  },
  {
    "id": 34840,
    "hadith_number": 662,
    "tajuk_hadith": "Hukum Berpuasa Bagi Orang yang Berjunub di Pagi Hari",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Sumayy, maula Abu Bakr ibn Abd ar-Rahman ibn al-Harith ibn Hisham bahawa dia mendengar Abu Bakr ibn Abd ar-Rahman ibn al-Harith ibn Hisham berkata, \"Aku dan ayahku bersama Marwan ibn al Hakam ketika dia menjadi amir Madinah, dan seseorang menyebut kepadanya bahawa Abu Hurayra biasa berkata, 'Jika seseorang memulakan pagi dalam keadaan junub, dia telah membatalkan puasa pada hari itu.' Marwan berkata, 'Aku bersumpah kepadamu, Abdar-Rahman, kamu mesti pergi kepada dua umm al muminin, A'isha dan Umm Salama, dan bertanya kepada mereka tentang perkara itu.'",
    "english_text": "Yahya related to me from Malik from Sumayy, the mawla of Abu Bakr\nibn Abd ar-Rahman ibn al-Harith ibn Hisham that he heard Abu Bakr ibn\nAbd ar-Rahman ibn al-Harith ibn Hisham say, \"My father and I were with\nMarwan ibn al Hakam at the time when he was amir of Madina, and\nsomeone mentioned to him that Abu Hurayra used to say, 'If someone\nbegins the morning junub, he has broken the fast for that day.'\nMarwan said, 'I swear to you, Abdar-Rahman, you must go to the two umm\nal muminin, A'isha and Umm Salama, and ask them about it.'\n\n\n''Abd ar-Rahman went to visit A'isha and I accompanied him. He greeted\nher and then said, 'Umm al-muminin, we were with Marwan ibn al Hakam\nand someone mentioned to him that Abu Hurayra used to say that if some\none had begun the morning junub, he had broken the fast for that day.'\nA'isha said, 'It is not as Abu Hurayra says Abd ar-Rahman. Do you\ndislike what the Messenger of Allah, may Allah bless him and grant him\npeace, used to do?', and Abd ar-Rahman said, 'No, by Allah.' A'isha\nsaid, 'I bear witness that the Messenger of Allah, may Allah bless him\nand grant him peace, used to get up in the morning junub from\nintercourse, not a dream, and would then fast for that day.' \"\n\n\nHe continued, \"Then we went and visited Umm Salama, and Abd ar-\nRahman asked her about the same matter and she said the same as A'isha\nhad said. Then we went off until we came to Marwan ibn al-Hakam Abd\nar-Rahman told him what they had both said and Marwan said, 'I swear\nto you, Abu Muhammad, you must use the mount which is at the door, and\ngo to Abu Hurayra, who is on his land at al Aqiq, and tell him this.'\nSo Abd ar-Rahman rode off, and I went with him, until we came to Abu\nHurayra. Abd ar-Rahman talked with him for a while, and then mentioned\nthe matter to him, and Abu Hurayra said, 'I don't know anything about\nit. I was just told that by someone.'\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ أَنَّهُ سَمِعَ أَبَا بَكْرِ بْنَ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، يَقُولُ كُنْتُ أَنَا وَأَبِي، عِنْدَ مَرْوَانَ بْنِ الْحَكَمِ - وَهُوَ أَمِيرُ الْمَدِينَةِ - فَذُكِرَ لَهُ أَنَّ أَبَا هُرَيْرَةَ يَقُولُ مَنْ أَصْبَحَ جُنُبًا أَفْطَرَ ذَلِكَ الْيَوْمَ ‏.‏ فَقَالَ مَرْوَانُ أَقْسَمْتُ عَلَيْكَ يَا عَبْدَ الرَّحْمَنِ لَتَذْهَبَنَّ إِلَى أُمَّىِ الْمُؤْمِنِينَ عَائِشَةَ وَأُمِّ سَلَمَةَ فَلَتَسْأَلَنَّهُمَا عَنْ ذَلِكَ فَذَهَبَ عَبْدُ الرَّحْمَنِ وَذَهَبْتُ مَعَهُ حَتَّى دَخَلْنَا عَلَى عَائِشَةَ فَسَلَّمَ عَلَيْهَا ثُمَّ قَالَ يَا أُمَّ الْمُؤْمِنِينَ إِنَّا كُنَّا عِنْدَ مَرْوَانَ بْنِ الْحَكَمِ فَذُكِرَ لَهُ أَنَّ أَبَا هُرَيْرَةَ يَقُولُ مَنْ أَصْبَحَ جُنُبًا أَفْطَرَ ذَلِكَ الْيَوْمَ ‏.‏ قَالَتْ عَائِشَةُ لَيْسَ كَمَا قَالَ أَبُو هُرَيْرَةَ يَا عَبْدَ الرَّحْمَنِ أَتَرْغَبُ عَمَّا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصْنَعُ فَقَالَ عَبْدُ الرَّحْمَنِ لاَ وَاللَّهِ ‏.‏ قَالَتْ عَائِشَةُ فَأَشْهَدُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ كَانَ يُصْبِحُ جُنُبًا مِنْ جِمَاعٍ غَيْرِ احْتِلاَمٍ ثُمَّ يَصُومُ ذَلِكَ الْيَوْمَ ‏.‏ قَالَ ثُمَّ خَرَجْنَا حَتَّى دَخَلْنَا عَلَى أُمِّ سَلَمَةَ فَسَأَلَهَا عَنْ ذَلِكَ فَقَالَتْ مِثْلَ مَا قَالَتْ عَائِشَةُ ‏.‏ قَالَ فَخَرَجْنَا حَتَّى جِئْنَا مَرْوَانَ بْنَ الْحَكَمِ فَذَكَرَ لَهُ عَبْدُ الرَّحْمَنِ مَا قَالَتَا فَقَالَ مَرْوَانُ أَقْسَمْتُ عَلَيْكَ يَا أَبَا مُحَمَّدٍ لَتَرْكَبَنَّ دَابَّتِي فَإِنَّهَا بِالْبَابِ فَلْتَذْهَبَنَّ إِلَى أَبِي هُرَيْرَةَ فَإِنَّهُ بِأَرْضِهِ بِالْعَقِيقِ فَلْتُخْبِرَنَّهُ ذَلِكَ ‏.‏ فَرَكِبَ عَبْدُ الرَّحْمَنِ وَرَكِبْتُ مَعَهُ حَتَّى أَتَيْنَا أَبَا هُرَيْرَةَ فَتَحَدَّثَ مَعَهُ عَبْدُ الرَّحْمَنِ سَاعَةً ثُمَّ ذَكَرَ لَهُ ذَلِكَ فَقَالَ لَهُ أَبُو هُرَيْرَةَ لاَ عِلْمَ لِي بِذَاكَ إِنَّمَا أَخْبَرَنِيهِ مُخْبِرٌ ‏.‏",
    "malay_translation": "'Abd ar-Rahman pergi melawat A'isha dan aku menemaninya. Dia memberi salam kepadanya dan kemudian berkata, 'Umm al-muminin, kami bersama Marwan ibn al Hakam dan seseorang menyebut kepadanya bahawa Abu Hurayra biasa berkata bahawa jika seseorang memulakan pagi dalam keadaan junub, dia telah membatalkan puasa pada hari itu.' A'isha berkata, 'Tidak seperti yang dikatakan Abu Hurayra, Abd ar-Rahman. Adakah kamu tidak menyukai apa yang Rasulullah, semoga Allah memberkati dan mengurniakan kesejahteraan kepadanya, biasa lakukan?', dan Abd ar-Rahman berkata, 'Tidak, demi Allah.' A'isha berkata, 'Aku bersaksi bahawa Rasulullah, semoga Allah memberkati dan mengurniakan kesejahteraan kepadanya, biasa bangun pada waktu pagi dalam keadaan junub dari persetubuhan, bukan mimpi, dan kemudian berpuasa pada hari itu.' \"Dia meneruskan, \"Kemudian kami pergi dan melawat Umm Salama, dan Abd ar-Rahman bertanya kepadanya tentang perkara yang sama dan dia berkata sama seperti yang dikatakan A'isha. Kemudian kami pergi sehingga kami datang kepada Marwan ibn al-Hakam Abd ar-Rahman memberitahunya apa yang telah mereka berdua katakan dan Marwan berkata, 'Aku bersumpah kepadamu, Abu Muhammad, kamu mesti menggunakan tunggangan yang ada di pintu, dan pergi kepada Abu Hurayra, yang berada di tanahnya di al Aqiq, dan beritahu dia ini.' Jadi Abd ar-Rahman menunggang pergi, dan aku pergi bersamanya, sehingga kami datang kepada Abu Hurayra. Abd ar-Rahman bercakap dengannya seketika, dan kemudian menyebut perkara itu kepadanya, dan Abu Hurayra berkata, 'Aku tidak tahu apa-apa tentangnya. Aku hanya diberitahu tentang itu oleh seseorang.'\""
  },
  {
    "id": 34841,
    "hadith_number": 663,
    "tajuk_hadith": "Rasulullah SAW Berpuasa dalam Keadaan Junub Selepas Bersetubuh",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Sumayy, maula Abu Bakr, daripada Abu Bakr ibn Abd ar-Rahman bahawa A'isha dan Umm Salama, isteri-isteri Nabi SAW, berkata,",
    "english_text": "Yahya related to me from Malik from Sumayy, the mawla of Abu\nBakr, from Abu Bakr ibn Abd ar-Rahman that A'isha and Umm Salama, the\nwives of the Prophet, may Allah bless him and grant him peace, said,\n\"The Messengerof Allah, may Allah bless him and grant him peace, used\nto get up in the morning junub from intercourse, not a dream, and\nwould then fast.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، وَأُمِّ سَلَمَةَ زَوْجَىِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُمَا قَالَتَا إِنْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيُصْبِحُ جُنُبًا مِنْ جِمَاعٍ غَيْرِ احْتِلاَمٍ ثُمَّ يَصُومُ ‏.‏",
    "malay_translation": "\"Rasulullah SAW bangun pagi dalam keadaan junub disebabkan persetubuhan, bukan mimpi, kemudian baginda berpuasa.\""
  },
  {
    "id": 34842,
    "hadith_number": 664,
    "tajuk_hadith": "Bercium Ketika Berpuasa dan Bantahan Seorang Lelaki",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Zayd ibn Aslam daripada Ata ibn Yasar",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ رَجُلاً، قَبَّلَ امْرَأَتَهُ وَهُوَ صَائِمٌ فِي رَمَضَانَ فَوَجَدَ مِنْ ذَلِكَ وَجْدًا شَدِيدًا فَأَرْسَلَ امْرَأَتَهُ تَسْأَلُ لَهُ عَنْ ذَلِكَ فَدَخَلَتْ عَلَى أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم فَذَكَرَتْ ذَلِكَ لَهَا فَأَخْبَرَتْهَا أُمُّ سَلَمَةَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يُقَبِّلُ وَهُوَ صَائِمٌ فَرَجَعَتْ فَأَخْبَرَتْ زَوْجَهَا بِذَلِكَ فَزَادَهُ ذَلِكَ شَرًّا وَقَالَ لَسْنَا مِثْلَ رَسُولِ اللَّهِ صلى الله عليه وسلم اللَّهُ يُحِلُّ لِرَسُولِ اللَّهِ صلى الله عليه وسلم مَا شَاءَ ‏.‏ ثُمَّ رَجَعَتِ امْرَأَتُهُ إِلَى أُمِّ سَلَمَةَ فَوَجَدَتْ عِنْدَهَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا لِهَذِهِ الْمَرْأَةِ ‏\"‏ ‏.‏ فَأَخْبَرَتْهُ أُمُّ سَلَمَةَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَلاَّ أَخْبَرْتِيهَا أَنِّي أَفْعَلُ ذَلِكَ ‏\"‏ ‏.‏ فَقَالَتْ قَدْ أَخْبَرْتُهَا فَذَهَبَتْ إِلَى زَوْجِهَا فَأَخْبَرَتْهُ فَزَادَهُ ذَلِكَ شَرًّا وَقَالَ لَسْنَا مِثْلَ رَسُولِ اللَّهِ صلى الله عليه وسلم اللَّهُ يُحِلُّ لِرَسُولِهِ صلى الله عليه وسلم مَا شَاءَ ‏.‏ فَغَضِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏\"‏ وَاللَّهِ إِنِّي لأَتْقَاكُمْ لِلَّهِ وَأَعْلَمُكُمْ بِحُدُودِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Zayd ibn Aslam daripada Ata ibn Yasar bahawa seorang lelaki mencium isterinya ketika dia berpuasa di bulan Ramadan. Ini menyebabkan dia berasa sangat bimbang, jadi dia menghantar isterinya untuk bertanya kepada Nabi Muhammad SAW tentang hal itu. Isterinya pergi dan berjumpa dengan Umm Salama, isteri Nabi SAW, dan menceritakan perkara itu kepadanya, dan Umm Salama memberitahunya bahawa Rasulullah SAW biasa bercium ketika berpuasa. Jadi dia kembali dan memberitahu suaminya tentang itu, tetapi ia hanya membuatnya lebih bersalah dan dia berkata, \"Kami tidak seperti Rasulullah SAW. Allah membenarkan bagi Rasulullah SAW apa sahaja yang Dia kehendaki.\"\n\nKemudian isterinya kembali kepada Umm Salama dan mendapati Rasulullah SAW bersamanya. Rasulullah SAW bersabda, \"Apa halnya dengan wanita ini?\" Umm Salama memberitahunya. Rasulullah SAW bersabda, \"Tidakkah kamu memberitahunya bahawa aku sendiri melakukan demikian?\" Umm Salama menjawab, \"Saya sudah memberitahunya, dan dia pergi kepada suaminya dan memberitahunya, tetapi ia hanya membuatnya lebih bersalah dan berkata, 'Kami tidak seperti Rasulullah SAW. Allah membenarkan bagi Rasul-Nya apa sahaja yang Dia kehendaki.'\" Rasulullah SAW marah dan bersabda, \"Demi Allah, sesungguhnya aku adalah orang yang paling bertakwa kepada Allah di antara kamu semua, dan orang yang paling mengetahui batasan-batasan-Nya.\""
  },
  {
    "id": 34843,
    "hadith_number": 665,
    "tajuk_hadith": "Rasulullah S.A.W. Mencium Isteri Baginda Ketika Berpuasa",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Hisham bin Urwa daripada ayahnya bahawa Aisyah, Umm al-Mu'minin, radiallahu anha, berkata, \"Rasulullah SAW pernah mencium sebahagian isterinya ketika berpuasa,\" kemudian dia ketawa.",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that A'isha, umm al-muminin, may Allah be pleased with her,\nsaid, \"The Messenger of Allah, may Allah bless him and grant him\npeace, used to kiss certain of his wives when fasting,\" and then she\nlaughed.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، - رضى الله عنها - أَنَّهَا قَالَتْ إِنْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيُقَبِّلُ بَعْضَ أَزْوَاجِهِ وَهُوَ صَائِمٌ ‏.‏ ثُمَّ ضَحِكَتْ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Hisham bin Urwa, daripada ayahnya, daripada Aisyah, Umm al-Mu'minin (semoga Allah meredhainya), bahawa dia berkata: Sesungguhnya Rasulullah SAW pernah mencium sebahagian daripada isteri-isteri baginda ketika baginda sedang berpuasa. Kemudian dia (Aisyah) ketawa."
  },
  {
    "id": 34844,
    "hadith_number": 666,
    "tajuk_hadith": "Mencium Kepala Suami yang Berpuasa",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Yahya bin Said bahawa Atika binti Zaid bin Amr bin Nufail, isteri Umar bin al-Khattab, pernah mencium kepala Umar bin al-Khattab ketika beliau sedang berpuasa, dan beliau tidak melarangnya.",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said that Atika\nbint Zayd ibn Amr ibn Nufayl, the wife of Umar ibn al-Khattab, used to\nkiss Umar ibn al-Khattab's head while he was fasting, and he did not\ntell her not to.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ عَاتِكَةَ ابْنَةَ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ، - امْرَأَةَ عُمَرَ بْنِ الْخَطَّابِ - كَانَتْ تُقَبِّلُ رَأْسَ عُمَرَ بْنِ الْخَطَّابِ وَهُوَ صَائِمٌ فَلاَ يَنْهَاهَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Yahya bin Said bahawa 'Atikah binti Zaid bin 'Amr bin Nufail, isteri kepada 'Umar bin al-Khattab, biasanya mencium kepala 'Umar bin al-Khattab ketika beliau sedang berpuasa, dan beliau tidak melarangnya."
  },
  {
    "id": 34845,
    "hadith_number": 667,
    "tajuk_hadith": "Hukum Mencium Isteri Ketika Berpuasa",
    "perawi_melayu": "Malik meriwayatkan daripada Abu'n-Nadr, maula Umar ibn Ubaydullah",
    "english_text": "Yahya related to me from Malik from Abu'n-Nadr, the mawla of Umar\nibn Ubaydullah that A'isha bint Talha told him that she was once with\nA'isha, the wife of the Prophet, may Allah bless him and grant him\npeace, and her husband, who was fasting, came and visited her there.\n(He was Abdullah ibn Abd ar-Rahman ibn Abi Bakras-Siddiq.) A'isha said\nto him, \"What's stopping you from coming close to your wife and\nkissing her and joking with her?\"  He said, \"Can I kiss her when I am\nfasting?\"  She said, \"Yes.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ أَنَّ عَائِشَةَ بِنْتَ طَلْحَةَ، أَخْبَرَتْهُ أَنَّهَا، كَانَتْ عِنْدَ عَائِشَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم فَدَخَلَ عَلَيْهَا زَوْجُهَا هُنَالِكَ وَهُوَ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ وَهُوَ صَائِمٌ فَقَالَتْ لَهُ عَائِشَةُ مَا يَمْنَعُكَ أَنْ تَدْنُوَ مِنْ أَهْلِكَ فَتُقَبِّلَهَا وَتُلاَعِبَهَا فَقَالَ أُقَبِّلُهَا وَأَنَا صَائِمٌ قَالَتْ نَعَمْ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Abu'n-Nadr, maula Umar ibn Ubaydullah bahawa A'isha bint Talha memberitahunya bahawa dia pernah bersama A'isha, isteri Nabi Muhammad SAW, dan suaminya yang sedang berpuasa datang dan mengunjunginya di sana. (Dia adalah Abdullah ibn Abd ar-Rahman ibn Abi Bakr as-Siddiq.) A'isha berkata kepadanya, \"Apa yang menghalangmu daripada mendekati isterimu, menciumnya dan bergurau dengannya?\" Dia berkata, \"Bolehkah aku menciumnya ketika aku sedang berpuasa?\" Dia menjawab, \"Ya.\""
  },
  {
    "id": 34846,
    "hadith_number": 668,
    "tajuk_hadith": "Keringanan Mencium Bagi Orang yang Berpuasa",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Zayd bin Aslam bahawa Abu Hurairah dan Sa'd bin Abi Waqqas pernah berkata bahawa seseorang yang berpuasa dibolehkan untuk mencium.",
    "english_text": "Yahya related to me from Malik from Zayd ibn Aslam that Abu\nHurayra and Sad ibn Abi Waqqas used to say that someone who was\nfasting was allowed to kiss.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ أَبَا هُرَيْرَةَ، وَسَعْدَ بْنَ أَبِي وَقَّاصٍ، كَانَا يُرَخِّصَانِ فِي الْقُبْلَةِ لِلصَّائِمِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Zayd bin Aslam, bahawa Abu Hurairah dan Sa'd bin Abi Waqqas memberi keringanan (rukhsah) dalam hal mencium bagi orang yang berpuasa."
  },
  {
    "id": 34847,
    "hadith_number": 669,
    "tajuk_hadith": "Ciuman Rasulullah SAW Ketika Berpuasa",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik bahawa dia mendengar Aisyah, isteri Nabi SAW, berkata apabila dia menyebut bahawa Rasulullah SAW mencium ketika berpuasa: \"Siapakah di antara kamu yang lebih mampu mengawal dirinya daripada Rasulullah SAW?\"",
    "english_text": "Yahya related to me from Malik that he had heard that A'isha, the wife of the Prophet, may Allah bless him and grant him peace, would say, when she mentioned that the Messenger of Allah, used to kiss while fasting, \"And who among you is more able to control himself than the Messenger of Allah, may Allah bless him and grant him peace?\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَانَتْ إِذَا ذَكَرَتْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يُقَبِّلُ وَهُوَ صَائِمٌ تَقُولُ وَأَيُّكُمْ أَمْلَكُ لِنَفْسِهِ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik bahawa dia telah mendengar Aisyah, isteri Nabi SAW, berkata, apabila dia menyebut bahawa Rasulullah SAW pernah mencium ketika berpuasa, \"Siapakah di antara kamu yang lebih mampu mengawal dirinya daripada Rasulullah SAW?\""
  },
  {
    "id": 34848,
    "hadith_number": 670,
    "tajuk_hadith": "Hukum Bercium Bagi Orang yang Berpuasa",
    "perawi_melayu": "Yahya meriwayatkan bahawa Malik berkata, Hisham ibn Urwa ibn az-Zubayr berkata, \"Aku tidak berpendapat bahawa bercium itu membawa kebaikan bagi orang yang berpuasa.\"",
    "english_text": "Yahya said that Malik said that Hisham ibn Urwa ibn az-Zubayr had said, \"I do not think that kissing invites to good for people who are fasting.\"",
    "arabic_text": "قَالَ يَحْيَى قَالَ مَالِكٌ قَالَ هِشَامُ بْنُ عُرْوَةَ قَالَ عُرْوَةُ بْنُ الزُّبَيْرِ لَمْ أَرَ الْقُبْلَةَ لِلصَّائِمِ تَدْعُو إِلَى خَيْرٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan bahawa Malik berkata, Hisham ibn Urwa ibn az-Zubayr berkata, \"Aku tidak berpendapat bahawa bercium itu membawa kebaikan bagi orang yang berpuasa.\""
  },
  {
    "id": 34849,
    "hadith_number": 671,
    "tajuk_hadith": "Hukum Bercium Bagi Orang yang Berpuasa: Kelonggaran untuk Orang Tua, Larangan untuk Pemuda",
    "perawi_melayu": "Malik meriwayatkan daripada Zayd ibn Aslam daripada Ata ibn Yasar bahawa Abdullah ibn Abbas ditanya tentang orang yang bercium ketika berpuasa.",
    "english_text": "Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn\nYasar that Abdullah ibn Abbas was asked about people kissing while\nfasting and he said that he allowed it for old men but disapproved of\nit for young men.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، سُئِلَ عَنِ الْقُبْلَةِ، لِلصَّائِمِ فَأَرْخَصَ فِيهَا لِلشَّيْخِ وَكَرِهَهَا لِلشَّابِّ ‏.‏",
    "malay_translation": "Abdullah ibn Abbas menjawab bahawa beliau membenarkannya bagi orang tua tetapi tidak menyukainya bagi pemuda."
  },
  {
    "id": 34850,
    "hadith_number": 672,
    "tajuk_hadith": "Larangan Mencium dan Bermesraan Bagi Orang yang Berpuasa",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Nafi' bahawa Abdullah ibn Umar melarang mencium dan bermesraan bagi orang yang berpuasa.",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to forbid kissing and fondling for people who were fasting .",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَنْهَى عَنِ الْقُبْلَةِ، وَالْمُبَاشَرَةِ، لِلصَّائِمِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Nafi', bahawa Abdullah bin Umar melarang ciuman dan perbuatan bermesra bagi orang yang berpuasa."
  },
  {
    "id": 34851,
    "hadith_number": 673,
    "tajuk_hadith": "Rasulullah SAW Berbuka Puasa di Al-Kadid Semasa Ramadan pada Tahun Pembukaan Mekah",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Ibn Shihab daripada Ubaydullah ibn Abdullah ibn Utba ibn Masud daripada Abdullah ibn Abbas",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Ubaydullah\nibn Abdullah ibn Utba ibn Masud from Abdullah ibn Abbas that the\nMessenger of Allah, may Allah bless him and grant him peace, left for\nMakka in Ramadan during the year of the conquest, and fasted until he\nreached al-Kadid. He then broke the fast, and so everyone else did so\nas well. What people used to do was act according to whatever the\nMessenger of Allah, may Allah bless him and grant him peace, had done\nmost recently.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ إِلَى مَكَّةَ عَامَ الْفَتْحِ فِي رَمَضَانَ فَصَامَ حَتَّى بَلَغَ الْكَدِيدَ ثُمَّ أَفْطَرَ فَأَفْطَرَ النَّاسُ وَكَانُوا يَأْخُذُونَ بِالأَحْدَثِ فَالأَحْدَثِ مِنْ أَمْرِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Ibn Shihab daripada Ubaydullah ibn Abdullah ibn Utba ibn Masud daripada Abdullah ibn Abbas bahawa Rasulullah SAW keluar menuju ke Mekah pada bulan Ramadan pada tahun pembukaan (Mekah), dan Baginda berpuasa sehingga tiba di al-Kadid. Kemudian Baginda berbuka puasa, lalu orang ramai juga turut berbuka. Kebiasaan orang ramai adalah mengikut apa sahaja yang Rasulullah SAW lakukan yang paling terkini."
  },
  {
    "id": 34852,
    "hadith_number": 674,
    "tajuk_hadith": "Perintah Berbuka Puasa Semasa Musafir di Tahun Pembukaan Kota Mekah",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Sumayy, maula Abu Bakr ibn Abd ar-Rahman, daripada Abu Bakr ibn Abd ar-Rahman daripada salah seorang sahabat Rasulullah SAW.",
    "english_text": "Yahya related to me from Malik from Sumayy, the mawla of Abu Bakr\nibn Abd ar-Rahman, from Abu Bakr ibn Abd ar-Rahman from one of the\ncompanions of the Messenger of Allah, that the Messenger of Allah, may\nAllah bless him and grant him peace, ordered everyone to break the\nfast on the journey he made in the year of the conquest saying, \"Be\nstrong for your enemy,\" while the Messenger of Allah, may Allah bless\nhim and grant him peace, kept on fasting. Abu Bakr said that the one\nwho related this to him said, \"I saw the Messenger of Allah, may Allah\nbless him and grant him peace, pouring water over his head at al-Arj,\neither from thirst or from the heat. Then some one said to the\nMessenger of Allah, may Allah bless him and grant him peace,\n'Messenger of Allah, a group of people kept on fasting when you did.'\nThen when the Messenger of Allah was at al-Kadid, he asked for a\ndrinking-bowl and drank, and everyone broke the fast.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ بَعْضِ، أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ النَّاسَ فِي سَفَرِهِ عَامَ الْفَتْحِ بِالْفِطْرِ وَقَالَ ‏\n\"‏ تَقَوَّوْا لِعَدُوِّكُمْ ‏\"‏ ‏.‏ وَصَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو بَكْرٍ قَالَ الَّذِي حَدَّثَنِي لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم بِالْعَرْجِ يَصُبُّ الْمَاءَ عَلَى رَأْسِهِ مِنَ الْعَطَشِ أَوْ مِنَ الْحَرِّ ثُمَّ قِيلَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم يَا رَسُولَ اللَّهِ إِنَّ طَائِفَةً مِنَ النَّاسِ قَدْ صَامُوا حِينَ صُمْتَ - قَالَ - فَلَمَّا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْكَدِيدِ دَعَا بِقَدَحٍ فَشَرِبَ فَأَفْطَرَ النَّاسُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Sumayy, maula Abu Bakr ibn Abd ar-Rahman, daripada Abu Bakr ibn Abd ar-Rahman daripada salah seorang sahabat Rasulullah SAW, bahawa Rasulullah SAW memerintahkan orang ramai untuk berbuka puasa dalam perjalanannya pada tahun pembukaan (Kota Mekah) dan bersabda, \"Kuatkanlah diri kamu untuk menghadapi musuh kamu.\" Rasulullah SAW berpuasa. Abu Bakr berkata, orang yang meriwayatkan ini kepadaku berkata, \"Aku melihat Rasulullah SAW di al-Arj menuangkan air ke atas kepalanya kerana dahaga atau kerana panas. Kemudian dikatakan kepada Rasulullah SAW, 'Wahai Rasulullah, sesungguhnya ada sekumpulan orang yang berpuasa ketika engkau berpuasa.' Kemudian ketika Rasulullah SAW berada di al-Kadid, baginda meminta sebuah bekas minuman lalu minum, maka orang ramai pun berbuka puasa."
  },
  {
    "id": 34853,
    "hadith_number": 675,
    "tajuk_hadith": "Toleransi dalam Perjalanan di Bulan Ramadan",
    "perawi_melayu": "Diriwayatkan daripada Anas bin Malik RA",
    "english_text": "Yahya related to me from Malik from Humayd at-Tawil that Anas ibn\nMalik said, \"We once travelled with the Messenger of Allah, may Allah\nbless him and grant him peace, in Ramadan, and those who were fasting\ndid not find fault with those who were not, and those who were not\nfasting did not find fault with those who were.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ سَافَرْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي رَمَضَانَ فَلَمْ يَعِبِ الصَّائِمُ عَلَى الْمُفْطِرِ وَلاَ الْمُفْطِرُ عَلَى الصَّائِمِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Humaid at-Tawil bahawa Anas bin Malik berkata, \"Kami pernah bermusafir bersama Rasulullah SAW pada bulan Ramadan, dan mereka yang berpuasa tidak mencela mereka yang tidak berpuasa, dan mereka yang tidak berpuasa tidak mencela mereka yang berpuasa."
  },
  {
    "id": 34854,
    "hadith_number": 676,
    "tajuk_hadith": "Hukum Berpuasa Ketika Musafir",
    "perawi_melayu": "Diriwayatkan dari Yahya, dari Malik, dari Hisham bin Urwa, dari ayahnya, bahawa Hamza bin Amr al-Aslami pernah berkata kepada Rasulullah SAW:",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that Hamza ibn Amr al-Aslami once said to the Messenger of\nAllah, may Allah bless him and grant him peace, \"Messenger of Allah, I\nam a man who fasts. Can I fast when travelling?\"  The Messenger of\nAllah, may Allah bless him and grant him peace, said, \"If you want you\ncan fast, and if you want you can break the fast.\"",
    "arabic_text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ حَمْزَةَ بْنَ عَمْرٍو الأَسْلَمِيَّ، قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم يَا رَسُولَ اللَّهِ إِنِّي رَجُلٌ أَصُومُ أَفَأَصُومُ فِي السَّفَرِ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ ‏\"‏ ‏.‏",
    "malay_translation": "\"Wahai Rasulullah, sesungguhnya aku seorang lelaki yang berpuasa. Bolehkah aku berpuasa ketika musafir?\" Rasulullah SAW bersabda kepadanya, \"Jika kamu mahu, berpuasalah, dan jika kamu mahu, berbukalah.\""
  },
  {
    "id": 34855,
    "hadith_number": 677,
    "tajuk_hadith": "Abdullah bin Umar Tidak Berpuasa Ketika Musafir",
    "perawi_melayu": "Diriwayatkan daripada Malik, daripada Nafi'",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused not to fast while travelling.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ لاَ يَصُومُ فِي السَّفَرِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Nafi', bahawa Abdullah bin Umar tidak berpuasa ketika dalam perjalanan (musafir)."
  },
  {
    "id": 34856,
    "hadith_number": 678,
    "tajuk_hadith": "Urusan Perjalanan dan Puasa di Bulan Ramadan: Contoh dari Urwa",
    "perawi_melayu": "Diriwayatkan daripada Malik, daripada Hisham bin Urwa, daripada ayahnya:",
    "english_text": "Yahya related to me from Malik that Hisham ibn Urwa said, \"My\nfather, Urwa, used to travel in Ramadan, and we would travel with him,\nand he used to fast while we would break the fast, and he would not\ntell us to fast.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يُسَافِرُ فِي رَمَضَانَ وَنُسَافِرُ مَعَهُ فَيَصُومُ عُرْوَةُ وَنُفْطِرُ نَحْنُ فَلاَ يَأْمُرُنَا بِالصِّيَامِ ‏.‏",
    "malay_translation": "\"Bapa saya, Urwa, biasa bermusafir pada bulan Ramadan, dan kami akan bermusafir bersamanya. Urwa berpuasa, dan kami berbuka, dan dia tidak menyuruh kami untuk berpuasa.\""
  },
  {
    "id": 34857,
    "hadith_number": 679,
    "tajuk_hadith": "Umar bin al-Khattab Berpuasa Ketika Kembali ke Madinah dalam Bulan Ramadan dan Hukum Berkaitan Musafir yang Berpuasa dan Tidak Berpuasa",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik",
    "english_text": "27 Yahya related to me from Malik that he had heard that Umar ibn\nal-Khattab, if he was travelling in Ramadan and knew that he would\nreach Madina at the begining of the day ,would do so fasting.\n\n\nYahya said that Malik said, \"Someone who is travelling and knows that\nhe will be reaching his people in the first part of the day, and then\ndawn breaks before he gets there, should be fasting when he gets\nthere.\"\n\n\nMalik said, \"Someone who intends to go away (on a\njourney) in Ramadan, and then dawn breaks while he is still on his\nland before he has left, should fast that day.\"\n\n\nMalik said\nthat a man who returns from a journey in Ramadan and is not fasting\nmay have sexual intercourse with his wife if he wishes, if she is not\nfasting and she has just become pure after her menses.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَانَ إِذَا كَانَ فِي سَفَرٍ فِي رَمَضَانَ فَعَلِمَ أَنَّهُ دَاخِلٌ الْمَدِينَةَ مِنْ أَوَّلِ يَوْمِهِ دَخَلَ وَهُوَ صَائِمٌ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ مَنْ كَانَ فِي سَفَرٍ فَعَلِمَ أَنَّهُ دَاخِلٌ عَلَى أَهْلِهِ مِنْ أَوَّلِ يَوْمِهِ وَطَلَعَ لَهُ الْفَجْرُ قَبْلَ أَنْ يَدْخُلَ دَخَلَ وَهُوَ صَائِمٌ ‏.‏ قَالَ مَالِكٌ وَإِذَا أَرَادَ أَنْ يَخْرُجَ فِي رَمَضَانَ فَطَلَعَ لَهُ الْفَجْرُ وَهُوَ بِأَرْضِهِ قَبْلَ أَنْ يَخْرُجَ فَإِنَّهُ يَصُومُ ذَلِكَ الْيَوْمَ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يَقْدَمُ مِنْ سَفَرِهِ وَهُوَ مُفْطِرٌ وَامْرَأَتُهُ مُفْطِرَةٌ حِينَ طَهُرَتْ مِنْ حَيْضِهَا فِي رَمَضَانَ أَنَّ لِزَوْجِهَا أَنْ يُصِيبَهَا إِنْ شَاءَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik bahawa beliau mendengar Umar ibn al-Khattab, jika beliau bermusafir dalam bulan Ramadan dan mengetahui bahawa beliau akan tiba di Madinah pada awal hari, beliau akan tiba dalam keadaan berpuasa.\n\n\nYahya berkata bahawa Malik berkata, \"Seseorang yang bermusafir dan mengetahui bahawa dia akan tiba kepada keluarganya pada bahagian pertama hari, dan kemudian fajar menyingsing sebelum dia tiba di sana, hendaklah berpuasa apabila dia tiba di sana.\"\n\n\nMalik berkata, \"Seseorang yang berniat untuk pergi (dalam perjalanan) dalam bulan Ramadan, dan kemudian fajar menyingsing ketika dia masih berada di tanahnya sebelum dia berangkat, hendaklah berpuasa pada hari itu.\"\n\n\nMalik berkata bahawa seorang lelaki yang kembali dari perjalanan dalam bulan Ramadan dan tidak berpuasa boleh melakukan hubungan seks dengan isterinya jika dia mahu, jika isterinya tidak berpuasa dan dia baru sahaja suci selepas haidnya."
  },
  {
    "id": 34858,
    "hadith_number": 680,
    "tajuk_hadith": "Kaffarah bagi Orang yang Membatalkan Puasa di Bulan Ramadan dan Tidak Mampu Melakukannya",
    "perawi_melayu": "Diriwayatkan daripada Yahya, daripada Malik, daripada Ibn Shihab, daripada Humaid ibn Abd ar-Rahman ibn Awf, daripada Abu Hurairah",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Hunayd ibn\nAbd arRahman ibn Awf from Abu Hurayra that a man broke the fast in\nRamadan and the Messenger of Allah, may Allah bless him and grant him\npeace, ordered him to make kaffara by freeing a slave, or fasting two\nconsecutive months, or feeding sixty poor people, and he said, \"I\ncan't do it.\"  Someone brought a large basket of dates to the\nthe Messenger of Allah, may Allah bless him and grant him peace, and he\nsaid, \"Take this and give it away as sadaqa.\"  He said, \"Messenger of\nAllah, there is no-ne more needy than I am.\"  The Messenger of Allah,\nmay Allah bless him and grant him peace, laughed until his eye-teeth\nappeared, and then he said, \"Eat them.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً، أَفْطَرَ فِي رَمَضَانَ فَأَمَرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُكَفِّرَ بِعِتْقِ رَقَبَةٍ أَوْ صِيَامِ شَهْرَيْنِ مُتَتَابِعَيْنِ أَوْ إِطْعَامِ سِتِّينَ مِسْكِينًا ‏.‏ فَقَالَ لاَ أَجِدُ ‏.‏ فَأُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِعَرَقِ تَمْرٍ ‏.‏ فَقَالَ ‏\"‏ خُذْ هَذَا فَتَصَدَّقْ بِهِ ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ مَا أَحَدٌ أَحْوَجَ مِنِّي ‏.‏ فَضَحِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى بَدَتْ أَنْيَابُهُ ثُمَّ قَالَ ‏\"‏ كُلْهُ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Ibn Shihab, daripada Humaid ibn Abd ar-Rahman ibn Awf, daripada Abu Hurairah bahawa seorang lelaki telah membatalkan puasanya di bulan Ramadan. Rasulullah SAW memerintahkannya untuk membayar kaffarah dengan membebaskan seorang hamba, atau berpuasa dua bulan berturut-turut, atau memberi makan enam puluh orang miskin. Lelaki itu berkata, \"Saya tidak mampu.\" Kemudian dibawakan kepada Rasulullah SAW seranjang tamar (kurma). Baginda bersabda, \"Ambillah ini dan sedekahkanlah.\" Lelaki itu berkata, \"Wahai Rasulullah, tidak ada seorang pun yang lebih memerlukan daripada saya.\" Rasulullah SAW tertawa sehingga kelihatan gigi gerahamnya, kemudian Baginda bersabda, \"Makanlah ia.\""
  },
  {
    "id": 34859,
    "hadith_number": 681,
    "tajuk_hadith": "Kafarah bagi Seseorang yang Melakukan Hubungan Seksual pada Siang Hari di Bulan Ramadan",
    "perawi_melayu": "Yahya meriwayatkan kepadaku dari Malik dari Ata ibn Abdullah al-Khurasani bahwa Said ibn al-Musayyab berkata",
    "english_text": "Yahya related to me from Malik from Ata ibn Abdullah al-Khurasani that Said ibn al-Musayyab said, \"A bedouin came to the Messenger of Allah, may Allah bless him and grant him peace, beating his breast and tearing out his hair and saying, 'I am destroyed.' The Messenger of Allah, may Allah bless him and grant him peace, said, 'Why is that?', and he said, 'I had intercourse with my wife while fasting in Ramadan.' The Messenger of Allah, may Allah bless him and grant him peace, asked him, 'Are you able to free a slave?', and the man said, 'No.' Then he asked him, 'Are you able to give away a camel?', and the man replied, 'No.' He said, 'Sit own,' and someone brought a large basket of dates to the Messenger of Allah, may Allah bless him and grant him peace, and he said to the man, 'Take this and give it away as sadaqa.' The man said, 'There is no one more needy than me,' and (the Messenger of Allah, may Allah bless him and grant him peace), said, 'Eat them, and fast one day for the day when you had intercourse.' \"   Malik said that Ata said that he had asked Said ibn al-Musayyab how many dates there were in that basket, and he said, \"Between fifteen and twenty sas.''",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَطَاءِ بْنِ عَبْدِ اللَّهِ الْخُرَاسَانِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ جَاءَ أَعْرَابِيٌّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم يَضْرِبُ نَحْرَهُ وَيَنْتِفُ شَعْرَهُ وَيَقُولُ هَلَكَ الأَبْعَدُ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَمَا ذَاكَ ‏\"‏ ‏.‏ فَقَالَ أَصَبْتُ أَهْلِي وَأَنَا صَائِمٌ فِي رَمَضَانَ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلْ تَسْتَطِيعُ أَنْ تُعْتِقَ رَقَبَةً ‏\"‏ ‏.‏ فَقَالَ لاَ ‏.‏ فَقَالَ ‏\"‏ هَلْ تَسْتَطِيعُ أَنْ تُهْدِيَ بَدَنَةً ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَاجْلِسْ ‏\"‏ ‏.‏ فَأُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِعَرَقِ تَمْرٍ فَقَالَ ‏\"‏ خُذْ هَذَا فَتَصَدَّقْ بِهِ ‏\"‏ ‏.‏ فَقَالَ مَا أَحَدٌ أَحْوَجَ مِنِّي ‏.‏ فَقَالَ ‏\"‏ كُلْهُ وَصُمْ يَوْمًا مَكَانَ مَا أَصَبْتَ ‏\"‏ ‏.‏ قَالَ مَالِكٌ قَالَ عَطَاءٌ فَسَأَلْتُ سَعِيدَ بْنَ الْمُسَيَّبِ كَمْ فِي ذَلِكَ الْعَرَقِ مِنَ التَّمْرِ فَقَالَ مَا بَيْنَ خَمْسَةَ عَشَرَ صَاعًا إِلَى عِشْرِينَ ‏.‏",
    "malay_translation": "\"Seorang Badwi datang kepada Rasulullah SAW sambil memukul dadanya dan mencabut rambutnya, seraya berkata, 'Celakalah aku!' Rasulullah SAW bertanya kepadanya, 'Kenapa begitu?', lalu dia menjawab, 'Aku telah berhubungan badan dengan isteriku ketika sedang berpuasa di bulan Ramadan.' Rasulullah SAW bertanya kepadanya, 'Adakah kamu mampu membebaskan seorang hamba?', dia menjawab, 'Tidak.' Kemudian Baginda bertanya, 'Adakah kamu mampu memberikan seekor unta?', dia menjawab, 'Tidak.' Baginda bersabda, 'Duduklah,' lalu seseorang membawa sekeranjang besar kurma kepada Rasulullah SAW, dan Baginda bersabda kepada lelaki itu, 'Ambillah ini dan sedekahkanlah.' Lelaki itu berkata, 'Tidak ada yang lebih memerlukan daripadaku.' Lalu (Rasulullah SAW) bersabda, 'Makanlah kurma ini, dan berpuasalah satu hari sebagai ganti hari kamu melakukan hubungan badan itu.'\" Malik berkata bahawa Ata berkata bahawa dia telah bertanya kepada Said ibn al-Musayyab berapa banyak kurma yang ada di dalam keranjang itu, dan dia menjawab, \"Antara lima belas hingga dua puluh *sa*'.\""
  },
  {
    "id": 34860,
    "hadith_number": 682,
    "tajuk_hadith": "Kafarah bagi Seseorang yang Melakukan Persetubuhan pada Siang Hari di Bulan Ramadan dan Qada'",
    "perawi_melayu": "Malik berkata",
    "english_text": "Malik said, \"I have heard people of knowledge saying that the kaffara specified by the Messenger of Allah, may Allah bless him and grant him peace, for a man who has intercourse with his wife during the day in Ramadan is not due from someone who, on a day when he is making up the fast of Ramadan, breaks his fast by having intercourse with his wife, or whatever. He only has to make up for that day.\"   Malik said, \"This is what I like most out of what I have heard about the matter.\"",
    "arabic_text": "",
    "malay_translation": "Malik berkata, \"Saya telah mendengar orang-orang berilmu mengatakan bahawa kaffarah yang ditetapkan oleh Rasulullah SAW bagi seorang lelaki yang melakukan persetubuhan dengan isterinya pada siang hari di bulan Ramadan tidak dikenakan kepada seseorang yang, pada hari dia menggantikan puasa Ramadan, membatalkan puasanya dengan melakukan persetubuhan dengan isterinya, atau apa sahaja. Dia hanya perlu menggantikan puasa pada hari itu.\" Malik berkata, \"Ini adalah apa yang paling saya sukai daripada apa yang telah saya dengar tentang perkara ini.\""
  },
  {
    "id": 34861,
    "hadith_number": 683,
    "tajuk_hadith": "Abdullah bin Umar Berbekam Semasa Berpuasa dan Kemudian Meninggalkannya",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Nafi' bahawa Abdullah ibn Umar",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to be cupped while he was fasting. Nafi said, \"He later stopped\ndoing that, and would not be cupped when he was fasting until he had\nbroken the fast.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ يَحْتَجِمُ وَهُوَ صَائِمٌ - قَالَ - ثُمَّ تَرَكَ ذَلِكَ بَعْدُ فَكَانَ إِذَا صَامَ لَمْ يَحْتَجِمْ حَتَّى يُفْطِرَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Nafi' bahawa Abdullah ibn Umar pernah berbekam ketika dia sedang berpuasa. Nafi' berkata, \"Kemudian dia berhenti melakukan itu, dan tidak lagi berbekam ketika dia berpuasa sehingga dia berbuka puasa.\""
  },
  {
    "id": 34862,
    "hadith_number": 684,
    "tajuk_hadith": "Berbekam Ketika Berpuasa",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Ibn Shihab bahawa Sa'd bin Abi Waqqas dan Abdullah bin Umar biasa berbekam ketika mereka sedang berpuasa.",
    "english_text": "Yahya related to me from Malik from Ibn Shihab that Sad ibn Abi\nWaqqas and Abdullah ibn Umar used to be cupped while they were\nfasting.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ سَعْدَ بْنَ أَبِي وَقَّاصٍ، وَعَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَا يَحْتَجِمَانِ وَهُمَا صَائِمَانِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Ibn Shihab, bahawa Sa'd bin Abi Waqqas dan Abdullah bin Umar pernah berbekam ketika mereka sedang berpuasa."
  },
  {
    "id": 34863,
    "hadith_number": 685,
    "tajuk_hadith": "Berbekam Ketika Berpuasa: Hukum dan Kebimbangan",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Hisham bin Urwa bahawa ayahnya",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa that his\nfather used to be cupped while he was fasting and he would not then\nbreak his fast. Hisham added, \"I only ever saw him being cupped when\nhe was fasting.\"\n\n\nMalik said, \"Cupping is only disapproved of\nfor some one who is fasting out of fear that he will become weak and\nif it were not for that, it would not be disapproved of. I do not\nthink that a man who is cupped in Ramadan and does not break his fast,\nowes anything, and I do not say that he has to make up for the day on\nwhich he was cupped, because cupping is only disapproved of for\nsomeone fasting if his fast is endangered. I do not think that someone\nwho is cupped, and is then well enough to keep the fast until evening,\nowes anything, nor does he have to make up for that day.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يَحْتَجِمُ وَهُوَ صَائِمٌ ثُمَّ لاَ يُفْطِرُ ‏.‏ قَالَ وَمَا رَأَيْتُهُ احْتَجَمَ قَطُّ إِلاَّ وَهُوَ صَائِمٌ ‏.‏ قَالَ مَالِكٌ لاَ تُكْرَهُ الْحِجَامَةُ لِلصَّائِمِ إِلاَّ خَشْيَةً مِنْ أَنْ يَضْعُفَ وَلَوْلاَ ذَلِكَ لَمْ تُكْرَهْ وَلَوْ أَنَّ رَجُلاً احْتَجَمَ فِي رَمَضَانَ ثُمَّ سَلِمَ مِنْ أَنْ يُفْطِرَ لَمْ أَرَ عَلَيْهِ شَيْئًا وَلَمْ آمُرْهُ بِالْقَضَاءِ لِذَلِكَ الْيَوْمِ الَّذِي احْتَجَمَ فِيهِ لأَنَّ الْحِجَامَةَ إِنَّمَا تُكْرَهُ لِلصَّائِمِ لِمَوْضِعِ التَّغْرِيرِ بِالصِّيَامِ فَمَنِ احْتَجَمَ وَسَلِمَ مِنْ أَنْ يُفْطِرَ حَتَّى يُمْسِيَ فَلاَ أَرَى عَلَيْهِ شَيْئًا وَلَيْسَ عَلَيْهِ قَضَاءُ ذَلِكَ الْيَوْمِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Hisham bin Urwa bahawa ayahnya pernah berbekam ketika berpuasa dan dia tidak berbuka. Hisham menambah, \"Saya tidak pernah melihatnya berbekam kecuali ketika dia berpuasa.\"\n\nMalik berkata, \"Berbekam hanya tidak disukai bagi seseorang yang berpuasa kerana khuatir dia akan menjadi lemah, dan jika tidak kerana itu, ia tidak akan tidak disukai. Saya tidak berpendapat bahawa seseorang yang berbekam di bulan Ramadan dan tidak membatalkan puasanya, tidak perlu melakukan apa-apa (qadha'), dan saya tidak menyuruhnya untuk menggantikan hari dia berbekam itu, kerana berbekam hanya tidak disukai bagi orang yang berpuasa jika puasanya terancam. Saya tidak berpendapat bahawa seseorang yang berbekam, dan kemudian cukup sihat untuk meneruskan puasa sehingga petang, tidak perlu melakukan apa-apa (qadha'), dan dia tidak perlu menggantikan hari itu.\""
  },
  {
    "id": 34864,
    "hadith_number": 686,
    "tajuk_hadith": "Puasa Asyura: Amalan Quraisy Jahiliyah dan Kemudiannya Pilihan Setelah Ramadan Difardhukan",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Hisham ibn Urwa, daripada ayahnya, daripada Aisyah, isteri Nabi SAW.",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that A'isha, the wife of the Prophet, may Allah bless him and\ngrant him peace, said, \"The day of Ashura was a day the Quraysh used\nto fast in the jahiliyya, and the Messenger of Allah, may Allah bless\nhim and grant him peace, used also to fast it during the jahiliyya.\nThen when the Messenger of Allah, may Allah bless him and grant him\npeace, came to Madina he fasted it and ordered that it be fasted. Then\nRamadan was made obligatory, and that became the fard instead of\nAshura, but whoever wanted to, fasted it, and whoever did not want to,\ndid not fast it.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ كَانَ يَوْمُ عَاشُورَاءَ يَوْمًا تَصُومُهُ قُرَيْشٌ فِي الْجَاهِلِيَّةِ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُهُ فِي الْجَاهِلِيَّةِ فَلَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ صَامَهُ وَأَمَرَ بِصِيَامِهِ فَلَمَّا فُرِضَ رَمَضَانُ كَانَ هُوَ الْفَرِيضَةَ وَتُرِكَ يَوْمُ عَاشُورَاءَ فَمَنْ شَاءَ صَامَهُ وَمَنْ شَاءَ تَرَكَهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Hisham ibn Urwa, daripada ayahnya, bahawa Aisyah, isteri Nabi SAW, berkata, \"Hari Asyura adalah hari yang biasa Quraisy berpuasa pada zaman jahiliyah, dan Rasulullah SAW juga berpuasa pada hari itu pada zaman jahiliyah. Kemudian, ketika Rasulullah SAW tiba di Madinah, baginda berpuasa pada hari itu dan memerintahkan untuk berpuasa. Kemudian, Ramadan difardhukan, dan ia menjadi fardhu menggantikan Asyura, tetapi sesiapa yang mahu, berpuasa, dan sesiapa yang tidak mahu, tidak berpuasa.\" "
  },
  {
    "id": 34865,
    "hadith_number": 687,
    "tajuk_hadith": "Muawiyah Menerangkan tentang Hari Asyura dan Puasanya",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Ibn Shihab, bahawa Humayd ibn Abd ar-Rahman ibn Awf mendengar Muawiya ibn Abi Sufyan berkata dari mimbar pada hari Asyura pada tahun dia mengerjakan haji,",
    "english_text": "Yahya related to me from Malik from Ibn Shihab that Humayd ibn\nAbd ar-Rahman ibn Awf heard Muawiya ibn Abi Sufyan say from the mimbar\non the day of Ashura in the year in which he made the hajj, \"People of\nMadina, where are your learned men?  I heard the Messenger of Allah,\nmay Allah bless him and grant him peace, say about this day, 'This is\nthe day of Ashura, and fasting it has not been prescribed for you. I\nam fasting it, and whoever of you wants to fast it can do so, and\nwhoever does not want to, does not have to.' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّهُ سَمِعَ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ، يَوْمَ عَاشُورَاءَ عَامَ حَجَّ وَهُوَ عَلَى الْمِنْبَرِ يَقُولُ يَا أَهْلَ الْمَدِينَةِ أَيْنَ عُلَمَاؤُكُمْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ لِهَذَا الْيَوْمِ ‏\n\"‏ هَذَا يَوْمُ عَاشُورَاءَ وَلَمْ يُكْتَبْ عَلَيْكُمْ صِيَامُهُ وَأَنَا صَائِمٌ فَمَنْ شَاءَ فَلْيَصُمْ وَمَنْ شَاءَ فَلْيُفْطِرْ ‏\"‏ ‏.‏",
    "malay_translation": "\"Wahai penduduk Madinah, di manakah orang-orang alim kamu? Aku mendengar Rasulullah SAW bersabda tentang hari ini, 'Ini adalah hari Asyura, dan puasa pada hari ini tidak diwajibkan ke atas kamu. Aku berpuasa, maka barangsiapa di antara kamu ingin berpuasa, maka berpuasalah, dan barangsiapa yang tidak ingin, maka tidak mengapa untuk tidak berpuasa.'\""
  },
  {
    "id": 34866,
    "hadith_number": 688,
    "tajuk_hadith": "Anjuran Berpuasa pada Hari Asyura",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik bahawa dia mendengar Umar ibn al-Khattab telah menghantar (pesanan berikut) kepada al-Harith ibn Hisham,\n''Esok adalah hari Asyura, maka berpuasalah (padanya) dan suruhlah keluargamu untuk berpuasa (juga).''",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، أَرْسَلَ إِلَى الْحَارِثِ بْنِ هِشَامٍ أَنَّ غَدًا، يَوْمُ عَاشُورَاءَ فَصُمْ وَأْمُرْ أَهْلَكَ أَنْ يَصُومُوا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik bahawa telah sampai kepadanya bahawa Umar bin al-Khattab telah menghantar (pesanan) kepada al-Harith bin Hisham: \"Esok adalah hari Asyura, maka berpuasalah dan perintahkan ahli keluargamu untuk berpuasa.\""
  },
  {
    "id": 34867,
    "hadith_number": 689,
    "tajuk_hadith": "Larangan Berpuasa pada Hari Raya Fitri dan Aidiladha",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Muhammad ibn Yahya ibn Habban, daripada al-Araj, daripada Abu Hurairah RA, bahawa Rasulullah SAW melarang berpuasa pada dua hari, iaitu Hari Raya Fitri dan Hari Raya Aidiladha.",
    "english_text": "Yahya related to me from Malik from Muhammad ibn Yahya ibn Habban\nfrom alAraj from Abu Hurayra that the Messenger of Allah, may Allah\nbless him and grant him peace, forbade fasting on two days, the day of\nFitr and the day of Adha.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، ‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ صِيَامِ يَوْمَيْنِ يَوْمِ الْفِطْرِ وَيَوْمِ الأَضْحَى ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Muhammad ibn Yahya ibn Habban, daripada al-Araj, daripada Abu Hurairah RA, bahawa Rasulullah SAW melarang berpuasa pada dua hari, iaitu Hari Raya Fitri dan Hari Raya Aidiladha."
  },
  {
    "id": 34868,
    "hadith_number": 690,
    "tajuk_hadith": "Hukum Berpuasa Sepanjang Tahun dengan Pengecualian Hari-Hari yang Dilarang",
    "perawi_melayu": "Malik",
    "english_text": "Yahya related to me from Malik that he used to hear the people of\nknowledge say,\"There is no harm in fasting continuously as long as one\nbreaks the fast on the days on which the Messenger of Allah, may Allah\nbless him and grant him peace, forbade fasting, namely, the days of\nMina, the day of Adha and the day of Fitr, according to what we have\nheard.\"\n\n\nMalik said, \"This is what I like most out of what I\nhave heard about the matter.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَمِعَ أَهْلَ الْعِلْمِ، يَقُولُونَ لاَ بَأْسَ بِصِيَامِ الدَّهْرِ إِذَا أَفْطَرَ الأَيَّامَ الَّتِي نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ صِيَامِهَا وَهِيَ أَيَّامُ مِنًى وَيَوْمُ الأَضْحَى وَيَوْمُ الْفِطْرِ فِيمَا بَلَغَنَا ‏.‏ قَالَ وَذَلِكَ أَحَبُّ مَا سَمِعْتُ إِلَىَّ فِي ذَلِكَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik bahawa beliau pernah mendengar para ulama berkata, \"Tidak mengapa berpuasa berterusan (sepanjang tahun) selagi mana seseorang itu berbuka pada hari-hari yang Rasulullah SAW melarang berpuasa, iaitu hari-hari Mina, hari Adha dan hari Fitr, menurut apa yang telah sampai kepada kami.\"\n\nMalik berkata, \"Inilah yang paling saya sukai daripada apa yang telah saya dengar mengenai perkara ini.\""
  },
  {
    "id": 34869,
    "hadith_number": 691,
    "tajuk_hadith": "Larangan Berpuasa Wisal dan Penjelasan Rasulullah SAW",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Nafi', daripada Abdullah bin Umar bahawa Rasulullah SAW melarang daripada berpuasa wisal.",
    "english_text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nforbade fasting for two days or more without breaking the fast in\nbetween. They said, \"But Messenger of Allah, you practise wisal.\"  He\nreplied, \"I am not the same as you. I am fed and given to drink.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْوِصَالِ فَقَالُوا يَا رَسُولَ اللَّهِ فَإِنَّكَ تُوَاصِلُ فَقَالَ ‏\n\"‏ إِنِّي لَسْتُ كَهَيْئَتِكُمْ إِنِّي أُطْعَمُ وَأُسْقَى ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Nafi', daripada Abdullah bin Umar, bahawa Rasulullah SAW melarang daripada berpuasa wisal. Mereka berkata, \"Wahai Rasulullah, sesungguhnya engkau berpuasa wisal.\" Baginda menjawab, \"Sesungguhnya aku tidak seperti kamu. Sesungguhnya aku diberi makan dan minum.\""
  },
  {
    "id": 34870,
    "hadith_number": 692,
    "tajuk_hadith": "Larangan Wisal (Puasa Bersambung) dan Keistimewaan Rasulullah SAW",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Abu'z-Zinad daripada al-Araj daripada Abu Hurairah",
    "english_text": "Yahya related to me from Malik from Abu'z-Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Beware of wisal. Beware of wisal.\"  They said, \"But\nyou practise wisal, Messenger of Allah.\" He replied, \"I am not the\nsame as you. My Lord feeds me and gives me to drink.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِيَّاكُمْ وَالْوِصَالَ إِيَّاكُمْ وَالْوِصَالَ ‏\"‏ ‏.‏ قَالُوا فَإِنَّكَ تُوَاصِلُ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ إِنِّي لَسْتُ كَهَيْئَتِكُمْ إِنِّي أَبِيتُ يُطْعِمُنِي رَبِّي وَيَسْقِينِي ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Abu'z-Zinad, daripada al-Araj, daripada Abu Hurairah bahawa Rasulullah SAW bersabda, \"Jauhilah *wisal*. Jauhilah *wisal*.\" Mereka berkata, \"Tetapi engkau melakukan *wisal*, wahai Rasulullah?\" Baginda menjawab, \"Sesungguhnya aku tidak seperti kamu. Sesungguhnya Tuhanku memberiku makan dan minum ketika aku bermalam.\""
  },
  {
    "id": 34871,
    "hadith_number": 693,
    "tajuk_hadith": "Hukum Menyambung Puasa Dua Bulan Berturut-Turut Selepas Sakit atau Haid",
    "perawi_melayu": "Malik",
    "english_text": "Yahya related to me, and I (myself) heard Malik say, \"The best\nthat I have heard about some one who has to fast for two consecutive\nmonths because of having killed someone by mistake or having\npronounced the dhihar form of divorce, becoming very ill and having to\nbreak his fast, is that if he recovers from his illness and is strong\nenough to fast, he must not delay doing so. He continues his fast from\nwhere he left off.\n\n\nSimilarly, a woman who has to fast because\nof having killed some one by mistake should not delay resuming her\nfast when she has become pure after her period. She continues her fast\nfrom where she left off.\n\n\nNo one who, by the Book of Allah,\nhas to fast for two consecutive months may break his fast except for a\nreason - illness or menstruation. He must not travel and break his\nfast.\"\n\n\nMalik said, \"This is the best that I have heard about\nthe matter.\"",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan kepadaku, dan aku sendiri mendengar Malik berkata, \"Sebaik-baik perkara yang pernah aku dengar tentang seseorang yang wajib berpuasa dua bulan berturut-turut kerana membunuh seseorang secara tidak sengaja atau telah melafazkan zihar, kemudian menjadi sangat sakit dan terpaksa membatalkan puasanya, adalah jika dia sembuh daripada penyakitnya dan cukup kuat untuk berpuasa, dia tidak boleh menangguhkan untuk berbuat demikian. Dia meneruskan puasanya dari tempat dia berhenti.\n\nBegitu juga, seorang wanita yang wajib berpuasa kerana membunuh seseorang secara tidak sengaja tidak boleh menangguhkan untuk menyambung puasanya apabila dia telah suci setelah haidnya. Dia meneruskan puasanya dari tempat dia berhenti.\n\nTidak seorang pun yang, dengan Kitab Allah, wajib berpuasa selama dua bulan berturut-turut boleh membatalkan puasanya kecuali dengan alasan - sakit atau haid. Dia tidak boleh bermusafir dan membatalkan puasanya.\"\n\nMalik berkata, \"Ini adalah sebaik-baik perkara yang pernah aku dengar tentang perkara ini.\""
  },
  {
    "id": 34872,
    "hadith_number": 694,
    "tajuk_hadith": "Keringanan bagi Orang Sakit yang Kesukaran Berpuasa",
    "perawi_melayu": "Yahya meriwayatkan bahawa beliau mendengar Malik berkata, \"Apa yang saya dengar daripada kalangan ahli ilmu adalah jika seseorang ditimpa penyakit yang menyukarkan puasa baginya, memenatkannya dan melelahkannya, maka dia boleh berbuka puasa. Ini sama seperti orang sakit dalam solat, yang mendapati berdiri terlalu sukar dan memenatkan, (dan Allah lebih mengetahui daripada hamba-Nya bahawa itu adalah alasan baginya dan ia benar-benar tidak dapat digambarkan). Jika seseorang itu berada dalam keadaan sedemikian, dia solat dengan duduk, dan agama Allah itu mudah.\n\nAllah telah mengizinkan seorang musafir untuk berbuka puasa ketika bermusafir, dan dia mempunyai lebih banyak kekuatan untuk berpuasa daripada orang sakit. Allah Taala berfirman dalam Kitab-Nya, 'Sesiapa antara kamu yang sakit atau dalam perjalanan (mesti berpuasa) pada hari-hari lain,' dan Allah telah mengizinkan seorang musafir untuk berbuka puasa ketika dalam perjalanan, dan dia lebih mampu berpuasa daripada orang sakit.\"",
    "english_text": "Yahya said that he heard Malik say, \"What I have heard from the\npeople of knowledge is that if a man succumbs to an illness which\nmakes fasting very difficult for him and exhausts him and wears him\nout, he can break his fast. This is the same as with a sick man in the\nprayer, who finds standing to be too difficult and exhausting, (and\nAllah knows better than the slave that it is an excuse for him and\nthat it really cannot be described).  If the man is in such a\ncondition he prays sitting, and the deen of Allah is ease.\n\n\nAllah has permitted a traveller to break the fast when travelling, and\nhe has more strength for fasting than a sick man. Allah, the Exalted,\nsays in His book, 'Whoever among you is ill or on a journey (must\nfast) a number of other days,' and Allah has thus permitted a\ntraveller to break his fast when on a journey, and he is more capable\nof fasting than a sick man.",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan bahawa beliau mendengar Malik berkata, \"Apa yang saya dengar daripada kalangan ahli ilmu adalah jika seseorang ditimpa penyakit yang menyukarkan puasa baginya, memenatkannya dan melelahkannya, maka dia boleh berbuka puasa. Ini sama seperti orang sakit dalam solat, yang mendapati berdiri terlalu sukar dan memenatkan, (dan Allah lebih mengetahui daripada hamba-Nya bahawa itu adalah alasan baginya dan ia benar-benar tidak dapat digambarkan). Jika seseorang itu berada dalam keadaan sedemikian, dia solat dengan duduk, dan agama Allah itu mudah.\n\nAllah telah mengizinkan seorang musafir untuk berbuka puasa ketika bermusafir, dan dia mempunyai lebih banyak kekuatan untuk berpuasa daripada orang sakit. Allah Taala berfirman dalam Kitab-Nya, 'Sesiapa antara kamu yang sakit atau dalam perjalanan (mesti berpuasa) pada hari-hari lain,' dan Allah telah mengizinkan seorang musafir untuk berbuka puasa ketika dalam perjalanan, dan dia lebih mampu berpuasa daripada orang sakit.\""
  },
  {
    "id": 34873,
    "hadith_number": 695,
    "tajuk_hadith": "Menunaikan Nazar Sebelum Puasa Sunat dan Pembahagian Harta Pusaka Berkaitan Nazar yang Belum Ditunaikan",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik bahawa beliau mendengar Said ibn al-Musayyab ditanya tentang seorang lelaki yang bernazar untuk berpuasa sebulan, bolehkah dia berpuasa sunat? Said menjawab, \"Dia harus menunaikan nazarnya sebelum dia melakukan puasa sunat.\"\n\nMalik berkata, \"Saya mendengar perkara yang sama daripada Sulayman ibn Yasar.\"\n\nMalik berkata, \"Jika seseorang meninggal dunia dengan nazar yang belum ditunaikan untuk membebaskan seorang hamba, atau berpuasa, atau memberi sedekah, atau memberikan unta, dan membuat wasiat agar nazarnya ditunaikan daripada hartanya, maka sedekah atau pemberian unta itu diambil daripada satu pertiga hartanya. Keutamaan diberikan kepadanya berbanding wasiat lain, kecuali perkara yang serupa dengannya, kerana dengan nazarnya ia telah menjadi wajib ke atasnya, dan ini tidak berlaku dengan sesuatu yang disumbangkannya secara sukarela. Mereka (nazar dan sumbangan sukarela) diselesaikan daripada satu pertiga hartanya yang terhad, dan bukan daripada keseluruhannya, kerana jika orang yang mati itu bebas untuk melupuskan seluruh hartanya, dia mungkin menangguhkan penyelesaian apa yang telah menjadi wajib ke atasnya (iaitu nazarnya), supaya apabila kematian datang dan harta itu berpindah ke tangan ahli warisnya, dia akan mewasiatkan perkara-perkara sedemikian (iaitu nazarnya) yang tidak dituntut oleh sesiapa (seperti hutang). Jika itu (iaitu untuk melupuskan hartanya secara bebas) dibenarkan kepadanya, dia akan menangguhkan perkara-perkara ini (iaitu nazarnya) sehingga apabila dia hampir mati, dia akan menetapkannya dan mereka mungkin mengambil semua hartanya. Dia tidak boleh melakukan itu.\"",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى عَنْ مَالِك أَنَّهُ بَلَغَهُ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ سُئِلَ عَنْ رَجُلٍ نَذَرَ صِيَامَ شَهْرٍ هَلْ لَهُ أَنْ يَتَطَوَّعَ فَقَالَ سَعِيدٌ لِيَبْدَأْ بِالنَّذْرِ قَبْلَ أَنْ يَتَطَوَّعَ قَالَ مَالِك وَبَلَغَنِي عَنْ سُلَيْمَانَ بْنِ يَسَارٍ مِثْلُ ذَلِكَ قَالَ مَالِك مَنْ مَاتَ وَعَلَيْهِ نَذْرٌ مِنْ رَقَبَةٍ يُعْتِقُهَا أَوْ صِيَامٍ أَوْ صَدَقَةٍ أَوْ بَدَنَةٍ فَأَوْصَى بِأَنْ يُوَفَّى ذَلِكَ عَنْهُ مِنْ مَالِهِ فَإِنَّ الصَّدَقَةَ وَالْبَدَنَةَ فِي ثُلُثِهِ وَهُوَ يُبَدَّى عَلَى مَا سِوَاهُ مِنْ الْوَصَايَا إِلَّا مَا كَانَ مِثْلَهُ وَذَلِكَ أَنَّهُ لَيْسَ الْوَاجِبُ عَلَيْهِ مِنْ النُّذُورِ وَغَيْرِهَا كَهَيْئَةِ مَا يَتَطَوَّعُ بِهِ مِمَّا لَيْسَ بِوَاجِبٍ وَإِنَّمَا يُجْعَلُ ذَلِكَ فِي ثُلُثِهِ خَاصَّةً دُونَ رَأْسِ مَالِهِ لِأَنَّهُ لَوْ جَازَ لَهُ ذَلِكَ فِي رَأْسِ مَالِهِ لَأَخَّرَ الْمُتَوَفَّى مِثْلَ ذَلِكَ مِنْ الْأُمُورِ الْوَاجِبَةِ عَلَيْهِ حَتَّى إِذَا حَضَرَتْهُ الْوَفَاةُ وَصَارَ الْمَالُ لِوَرَثَتِهِ سَمَّى مِثْلَ هَذِهِ الْأَشْيَاءِ الَّتِي لَمْ يَكُنْ يَتَقَاضَاهَا مِنْهُ مُتَقَاضٍ فَلَوْ كَانَ ذَلِكَ جَائِزًا لَهُ أَخَّرَ هَذِهِ الْأَشْيَاءَ حَتَّى إِذَا كَانَ عِنْدَ مَوْتِهِ سَمَّاهَا وَعَسَى أَنْ يُحِيطَ بِجَمِيعِ مَالِهِ فَلَيْسَ ذَلِكَ لَهُ",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa beliau telah mendengar daripada Said ibn al-Musayyab yang telah ditanya mengenai seorang lelaki yang bernazar untuk berpuasa selama sebulan, adakah dia boleh melakukan puasa sunat? Said berkata, \"Dia hendaklah memulakan dengan nazar sebelum dia melakukan puasa sunat.\"\n\nMalik berkata, \"Telah sampai kepadaku daripada Sulayman ibn Yasar perkara yang sama.\"\n\nMalik berkata, \"Sesiapa yang mati dan dia mempunyai nazar yang belum ditunaikan seperti membebaskan hamba, atau berpuasa, atau bersedekah, atau menyembelih unta, kemudian dia berwasiat agar ditunaikan nazar tersebut daripada hartanya, maka sedekah dan unta tersebut diambil daripada satu pertiga hartanya. Ia didahulukan berbanding wasiat-wasiat lain kecuali yang sepertinya. Hal ini kerana perkara wajib ke atasnya daripada nazar dan selainnya tidak sama seperti perkara sunat yang tidak wajib. Sesungguhnya perkara tersebut diletakkan pada satu pertiga hartanya sahaja, bukan daripada keseluruhan hartanya. Kerana sekiranya dibolehkan baginya berbuat demikian pada keseluruhan hartanya, nescaya orang yang mati akan melewatkan perkara-perkara wajib ke atasnya sehingga apabila datang kematian dan harta itu menjadi milik warisnya, dia akan menamakan perkara-perkara yang tidak dituntut oleh sesiapa pun daripadanya. Sekiranya dibolehkan baginya, nescaya dia akan melewatkan perkara-perkara ini sehingga apabila hampir mati, dia akan menamakannya dan boleh jadi ia meliputi seluruh hartanya. Maka tidak boleh baginya berbuat demikian."
  },
  {
    "id": 34874,
    "hadith_number": 696,
    "tajuk_hadith": "Puasa dan Solat Bagi Pihak Orang Lain",
    "perawi_melayu": "Malik meriwayatkan bahawa beliau mendengar Abdullah ibn Umar ditanya, \"Bolehkah seseorang berpuasa bagi pihak orang lain, atau menunaikan solat bagi pihak orang lain?\"",
    "english_text": "Yahya related to me from Malik that he had heard that Abdullah\nibn Umar used to be asked, \"an some one fast for some one else, or do\nthe prayer for some one else?\" and he would reply, \"No one can fast or\ndo the prayer for anyone else.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِك أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ يُسْأَلُ هَلْ يَصُومُ أَحَدٌ عَنْ أَحَدٍ أَوْ يُصَلِّي أَحَدٌ عَنْ أَحَدٍ فَيَقُولُ لَا يَصُومُ أَحَدٌ عَنْ أَحَدٍ وَلَا يُصَلِّي أَحَدٌ عَنْ أَحَدٍ",
    "malay_translation": "Malik meriwayatkan kepadaku daripada Yahya bahawa beliau telah mendengar Abdullah ibn Umar pernah ditanya, \"Adakah seseorang boleh berpuasa untuk orang lain, atau melakukan solat untuk orang lain?\" Lalu beliau menjawab, \"Tidak ada seorang pun yang boleh berpuasa untuk orang lain, dan tidak ada seorang pun yang boleh solat untuk orang lain.\""
  },
  {
    "id": 34875,
    "hadith_number": 697,
    "tajuk_hadith": "Hutang Nazar Yang Belum Ditunaikan Ketika Meninggal Dunia",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "قَالَ مَالِكٌ وَبَلَغَنِي عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، مِثْلُ ذَلِكَ ‏.‏ قَالَ مَالِكٌ مَنْ مَاتَ وَعَلَيْهِ نَذْرٌ مِنْ رَقَبَةٍ يُعْتِقُهَا أَوْ صِيَامٍ أَوْ صَدَقَةٍ أَوْ بَدَنَةٍ فَأَوْصَى بِأَنْ يُوَفَّى ذَلِكَ عَنْهُ مِنْ مَالِهِ فَإِنَّ الصَّدَقَةَ وَالْبَدَنَةَ فِي ثُلُثِهِ وَهُوَ يُبَدَّى عَلَى مَا سِوَاهُ مِنَ الْوَصَايَا إِلاَّ مَا كَانَ مِثْلَهُ وَذَلِكَ أَنَّهُ لَيْسَ الْوَاجِبُ عَلَيْهِ مِنَ النُّذُورِ وَغَيْرِهَا كَهَيْئَةِ مَا يَتَطَوَّعُ بِهِ مِمَّا لَيْسَ بِوَاجِبٍ وَإِنَّمَا يُجْعَلُ ذَلِكَ فِي ثُلُثِهِ خَاصَّةً دُونَ رَأْسِ مَالِهِ لأَنَّهُ لَوْ جَازَ لَهُ ذَلِكَ فِي رَأْسِ مَالِهِ لأَخَّرَ الْمُتَوَفَّى مِثْلَ ذَلِكَ مِنَ الأُمُورِ الْوَاجِبَةِ عَلَيْهِ حَتَّى إِذَا حَضَرَتْهُ الْوَفَاةُ وَصَارَ الْمَالُ لِوَرَثَتِهِ سَمَّى مِثْلَ هَذِهِ الأَشْيَاءِ الَّتِي لَمْ يَكُنْ يَتَقَاضَاهَا مِنْهُ مُتَقَاضٍ فَلَوْ كَانَ ذَلِكَ جَائِزًا لَهُ أَخَّرَ هَذِهِ الأَشْيَاءَ حَتَّى إِذَا كَانَ عِنْدَ مَوْتِهِ سَمَّاهَا وَعَسَى أَنْ يُحِيطَ بِجَمِيعِ مَالِهِ فَلَيْسَ ذَلِكَ لَهُ ‏.‏",
    "malay_translation": "Malik berkata: Telah sampai kepadaku daripada Sulaiman bin Yasar, seumpama itu. Malik berkata: Sesiapa yang mati dan dia mempunyai nazar yang belum ditunaikan seperti memerdekakan hamba, atau puasa, atau sedekah, atau korban unta, lalu dia berwasiat agar ditunaikan dari hartanya, maka sedekah dan korban unta itu diambil dari sepertiga hartanya, dan didahulukan daripada wasiat-wasiat yang lain kecuali yang seumpama dengannya. Hal ini kerana, kewajipan ke atasnya daripada nazar dan selainnya tidaklah sama seperti perkara sunat yang tidak wajib. Sesungguhnya, perkara itu diletakkan di dalam sepertiga hartanya sahaja, dan bukan daripada keseluruhan hartanya. Kerana sekiranya dibolehkan untuknya berbuat demikian daripada keseluruhan hartanya, nescaya orang yang mati itu akan melewatkan perkara-perkara wajib ke atasnya sehingga apabila kematian menghampirinya dan harta itu menjadi milik warisnya, barulah dia menyebut perkara-perkara yang tidak dituntut daripadanya. Sekiranya itu dibolehkan baginya, nescaya dia akan melewatkan perkara-perkara ini sehingga apabila hampir dengan kematiannya barulah dia menyebutnya, dan mungkin sahaja ia meliputi seluruh hartanya, maka tidaklah demikian baginya."
  },
  {
    "id": 34876,
    "hadith_number": 698,
    "tajuk_hadith": "Tidak Boleh Berpuasa atau Solat Bagi Pihak Orang Lain",
    "perawi_melayu": "Diriwayatkan daripada Malik bahawa telah sampai kepadanya, bahawa Abdullah bin Umar ditanya: \"Adakah seseorang boleh berpuasa bagi pihak orang lain, atau solat bagi pihak orang lain?\" Maka beliau menjawab: \"Tidak boleh seseorang berpuasa bagi pihak orang lain, dan tidak boleh seseorang solat bagi pihak orang lain.\"",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يُسْأَلُ هَلْ يَصُومُ أَحَدٌ عَنْ أَحَدٍ، أَوْ يُصَلِّي أَحَدٌ عَنْ أَحَدٍ، فَيَقُولُ لاَ يَصُومُ أَحَدٌ عَنْ أَحَدٍ، وَلاَ يُصَلِّي أَحَدٌ عَنْ أَحَدٍ‏.‏",
    "malay_translation": "Diriwayatkan daripada Malik, bahawa telah sampai kepadanya bahawa Abdullah bin Umar pernah ditanya, \"Adakah seseorang boleh berpuasa bagi pihak orang lain, atau solat bagi pihak orang lain?\" Maka beliau menjawab, \"Tidak boleh seseorang berpuasa bagi pihak orang lain, dan tidak boleh seseorang solat bagi pihak orang lain.\""
  },
  {
    "id": 34877,
    "hadith_number": 699,
    "tajuk_hadith": "Berbuka Puasa Kerana Menyangka Matahari Telah Terbenam, Kemudian Matahari Muncul Kembali",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Zayd ibn Aslam daripada saudaranya Khalid ibn Aslam",
    "english_text": "Yahya related to me from Malik from Zayd ibn Aslam from his\nbrother Khalid ibn Aslam that Umar ibn al-Khattab once broke thefast\non a cloudy day thinking that evening had come and the sun had set.\nThen a man came to him and said, \"Amir al-muminin, the sun has come\nout,'' and Umar said, \"That's an easy matter. It was our deduction\n(ijtihad).\"\n\n\nMalik said, \"According to what we think, and\nAllah knows best, what he was referring to when he said, 'That's an\neasy matter' was making up the fast, and how slight the effort\ninvolved was and how easy it was. He was saying (in effect), 'We will\nfast another day in its place.' \"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَخِيهِ، خَالِدِ بْنِ أَسْلَمَ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، أَفْطَرَ ذَاتَ يَوْمٍ فِي رَمَضَانَ فِي يَوْمٍ ذِي غَيْمٍ وَرَأَى أَنَّهُ قَدْ أَمْسَى وَغَابَتِ الشَّمْسُ ‏.‏ فَجَاءَهُ رَجُلٌ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ طَلَعَتِ الشَّمْسُ ‏.‏ فَقَالَ عُمَرُ الْخَطْبُ يَسِيرٌ وَقَدِ اجْتَهَدْنَا ‏.‏ قَالَ مَالِكٌ يُرِيدُ بِقَوْلِهِ الْخَطْبُ يَسِيرٌ الْقَضَاءَ فِيمَا نُرَى - وَاللَّهُ أَعْلَمُ - وَخِفَّةَ مَؤُونَتِهِ وَيَسَارَتِهِ يَقُولُ نَصُومُ يَوْمًا مَكَانَهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Zayd ibn Aslam, daripada saudaranya, Khalid ibn Aslam bahawa Umar ibn al-Khattab pernah berbuka puasa pada suatu hari di bulan Ramadan pada hari yang berawan, kerana menyangka bahawa waktu malam telah tiba dan matahari telah terbenam. Kemudian seorang lelaki datang kepadanya dan berkata, \"Wahai Amir al-Mukminin, matahari telah terbit!\" Umar berkata, \"Perkara itu mudah sahaja. Itu adalah ijtihad kami.\"\n\nMalik berkata, \"Menurut apa yang kami fikirkan, dan Allah lebih mengetahui, apa yang beliau maksudkan dengan 'Perkara itu mudah sahaja' adalah menggantikan puasa itu, dan betapa ringannya usaha yang terlibat dan betapa mudahnya ia. Beliau (seolah-olah) berkata, 'Kami akan berpuasa sehari sebagai gantinya.'\""
  },
  {
    "id": 34878,
    "hadith_number": 700,
    "tajuk_hadith": "Mengganti Puasa Ramadan Berturut-turut Kerana Sakit atau Musafir",
    "perawi_melayu": "Yahya meriwayatkan kepadaku dari Malik dari Nafi' bahawa Abdullah ibn Umar pernah berkata",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ يَصُومُ قَضَاءَ رَمَضَانَ مُتَتَابِعًا مَنْ أَفْطَرَهُ مِنْ مَرَضٍ أَوْ فِي سَفَرٍ ‏.‏",
    "malay_translation": "\"Sesiapa yang berbuka puasa di bulan Ramadan kerana sakit atau dalam perjalanan, hendaklah dia menggantikan hari-hari yang ditinggalkannya secara berturut-turut.\""
  },
  {
    "id": 34879,
    "hadith_number": 701,
    "tajuk_hadith": "Perbezaan Pendapat Mengenai Menggantikan Puasa Ramadan yang Tertinggal",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Ibn Shihab bahawa Abdullah ibn Abbas dan Abu Hurairah berbeza pendapat mengenai menggantikan hari-hari yang tertinggal dalam Ramadan. Salah seorang daripada mereka berkata bahawa ia dilakukan secara berasingan dan yang lain berkata bahawa ia dilakukan berturut-turut. Dia tidak tahu siapa antara mereka yang berkata bahawa ia dilakukan secara berasingan.",
    "english_text": "Yahya related to me from Malik from Ibr Shihab that Abdullah ibn\nAbbas and Abu Hurayra differed about making up days missed in Ramadan.\nOne of them said that they were done separately and the other said\nthat they were done consecutively. He did not know which one of them\nit was who said that they were done separately.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، وَأَبَا، هُرَيْرَةَ اخْتَلَفَا فِي قَضَاءِ رَمَضَانَ فَقَالَ أَحَدُهُمَا يُفَرِّقُ بَيْنَهُ ‏.‏ وَقَالَ الآخَرُ لاَ يُفَرِّقُ بَيْنَهُ ‏.‏ لاَ أَدْرِي أَيَّهُمَا قَالَ يُفَرِّقُ بَيْنَهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Ibn Shihab, bahawa Abdullah ibn Abbas dan Abu Hurairah berbeza pendapat tentang menggantikan (qada') puasa Ramadan. Salah seorang daripada mereka berkata, \"(Puasa qada') itu boleh dilakukan secara berasingan.\" Dan yang lain berkata, \"Tidak boleh dilakukan secara berasingan.\" Aku tidak tahu siapa antara mereka yang mengatakan, \"(Puasa qada') itu boleh dilakukan secara berasingan.\""
  },
  {
    "id": 34880,
    "hadith_number": 702,
    "tajuk_hadith": "Muntah Ketika Berpuasa: Sengaja dan Tidak Sengaja",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Nafi', bahawa Abdullah ibn Umar biasa berkata,",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ يَقُولُ مَنِ اسْتَقَاءَ وَهُوَ صَائِمٌ فَعَلَيْهِ الْقَضَاءُ وَمَنْ ذَرَعَهُ الْقَىْءُ فَلَيْسَ عَلَيْهِ الْقَضَاءُ ‏.‏",
    "malay_translation": "\"Sesiapa yang sengaja membuat dirinya muntah ketika dia berpuasa, maka dia wajib mengganti hari tersebut. Tetapi, sesiapa yang tidak dapat menahan muntah, maka dia tidak wajib mengganti apa-apa.\""
  },
  {
    "id": 34881,
    "hadith_number": 703,
    "tajuk_hadith": "Menggantikan Puasa Ramadan: Lebih Baik Berturut-turut",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Yahya ibn Said",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said that he heard\nSaid ibn al Musayyab being asked about making up days missed in\nRamadan, and Said said, \"What I like best is for days missed in\nRamadan to be made up consecutively, and not separately.\"\n\n\nYahya said that he had heard Malik say, about some one who made up the\ndays he had missed in Ramadan separately, that he did not have to\nrepeat them. (What he had done) was enough for him.  It was, however,\npreferable, if he did them consecutively.\n\n\nMalik said,\n\"Whoever eats or drinks thoughtlessly or forgetfully in Ramadan or\nduring any other obligatory fast that he must do, has to fast another\nday in its place.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يُسْأَلُ عَنْ قَضَاءِ، رَمَضَانَ فَقَالَ سَعِيدٌ أَحَبُّ إِلَىَّ أَنْ لاَ يُفَرَّقَ قَضَاءُ رَمَضَانَ وَأَنْ يُوَاتَرَ ‏.‏ قَالَ يَحْيَى سَمِعْتُ مَالِكًا يَقُولُ فِيمَنْ فَرَّقَ قَضَاءَ رَمَضَانَ فَلَيْسَ عَلَيْهِ إِعَادَةٌ وَذَلِكَ مُجْزِئٌ عَنْهُ وَأَحَبُّ ذَلِكَ إِلَىَّ أَنْ يُتَابِعَهُ ‏.‏ قَالَ مَالِكٌ مَنْ أَكَلَ أَوْ شَرِبَ فِي رَمَضَانَ سَاهِيًا أَوْ نَاسِيًا أَوْ مَا كَانَ مِنْ صِيَامٍ وَاجِبٍ عَلَيْهِ أَنَّ عَلَيْهِ قَضَاءَ يَوْمٍ مَكَانَهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Yahya ibn Said bahawa dia mendengar Said ibn al Musayyab ditanya tentang menggantikan hari-hari yang terlepas dalam Ramadan, dan Said berkata, \"Perkara yang paling saya sukai adalah hari-hari yang terlepas dalam Ramadan diganti secara berturut-turut, dan tidak berasingan.\"\n\nYahya berkata bahawa dia telah mendengar Malik berkata, tentang seseorang yang menggantikan hari-hari yang terlepas dalam Ramadan secara berasingan, bahawa dia tidak perlu mengulanginya. (Apa yang telah dia lakukan) sudah mencukupi baginya. Walau bagaimanapun, adalah lebih baik jika dia melakukannya secara berturut-turut.\n\nMalik berkata, \"Sesiapa yang makan atau minum tanpa sengaja atau terlupa dalam Ramadan atau semasa puasa wajib yang lain yang mesti dia lakukan, dia mesti berpuasa sehari lagi sebagai gantinya.\""
  },
  {
    "id": 34882,
    "hadith_number": 704,
    "tajuk_hadith": "Puasa Kaffarah Berturut-turut dan Hukum Darah Bukan Haid Bagi Wanita Berpuasa",
    "perawi_melayu": "Malik",
    "english_text": "Yahya related to me from Malik that Humayd ibn Oays al-Makki told\nhim, \"I was with Mujahid while he was performing tawaf around the\nKaba, and a man came to him and asked whether the days (of fasting)\nfor kaffara had to be fasted consecutively, or could they be split up.\nI said to him, 'Yes, they can be split up, if the person so wishes.'\nMujahid said, 'He should not split them up, because in Ubayy ibn Kab's\nrecitation they are referred to as three consecutive days.' \"\n\n\nMalik said, \"What I like most is what Allah has specified in the\nQur'an, that is, that they are fasted consecutively.\"\n\n\nMalik\nwas asked about a woman who began the day fasting in Ramadan and\nthough it was outside of the time of her period, fresh blood (i.e. not\nmenstrual blood) flowed from her. She then waited until evening to see\nthe same, but did not see anything.Then, on the next day in the\nmorning she had anotherflow, though less than the first. Then, some\ndays before her period, the flow stopped completely. Malik was asked\nwhat she should do about her fasting and prayer, and he said, \"This\nblood is like menstrual blood. When she sees it she should break her\nfast, and then make up the days she has missed. Then, when the blood\nhas completely stopped, she should do ghusl and fast.\"\n\n\nMalik\nwas asked whether someone who became muslim on the last day of Ramadan\nhad to make up all of Ramadan or whether he just had to make up the\nday when he became muslim, and he said, \"He does not have to make up\nany of the days that have passed. He begins fasting from that day\nonwards. What I like most is that he makes up the day on which he\nbecame muslim.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ حُمَيْدِ بْنِ قَيْسٍ الْمَكِّيِّ، أَنَّهُ أَخْبَرَهُ قَالَ كُنْتُ مَعَ مُجَاهِدٍ وَهُوَ يَطُوفُ بِالْبَيْتِ فَجَاءَهُ إِنْسَانٌ فَسَأَلَهُ عَنْ صِيَامِ أَيَّامِ الْكَفَّارَةِ أَمُتَتَابِعَاتٍ أَمْ يَقْطَعُهَا قَالَ حُمَيْدٌ فَقُلْتُ لَهُ نَعَمْ يَقْطَعُهَا إِنْ شَاءَ ‏.‏ قَالَ مُجَاهِدٌ لاَ يَقْطَعُهَا فَإِنَّهَا فِي قِرَاءَةِ أُبَىِّ بْنِ كَعْبٍ ثَلاَثَةِ أَيَّامٍ مُتَتَابِعَاتٍ ‏.‏ قَالَ مَالِكٌ وَأَحَبُّ إِلَىَّ أَنْ يَكُونَ مَا سَمَّى اللَّهُ فِي الْقُرْآنِ يُصَامُ مُتَتَابِعًا ‏.‏ وَسُئِلَ مَالِكٌ عَنِ الْمَرْأَةِ تُصْبِحُ صَائِمَةً فِي رَمَضَانَ فَتَدْفَعُ دَفْعَةً مِنْ دَمٍ عَبِيطٍ فِي غَيْرِ أَوَانِ حَيْضِهَا ثُمَّ تَنْتَظِرُ حَتَّى تُمْسِيَ أَنْ تَرَى مِثْلَ ذَلِكَ فَلاَ تَرَى شَيْئًا ثُمَّ تُصْبِحُ يَوْمًا آخَرَ فَتَدْفَعُ دَفْعَةً أُخْرَى وَهِيَ دُونَ الأُولَى ثُمَّ يَنْقَطِعُ ذَلِكَ عَنْهَا قَبْلَ حَيْضَتِهَا بِأَيَّامٍ فَسُئِلَ مَالِكٌ كَيْفَ تَصْنَعُ فِي صِيَامِهَا وَصَلاَتِهَا قَالَ مَالِكٌ ذَلِكَ الدَّمُ مِنَ الْحَيْضَةِ فَإِذَا رَأَتْهُ فَلْتُفْطِرْ وَلْتَقْضِ مَا أَفْطَرَتْ فَإِذَا ذَهَبَ عَنْهَا الدَّمُ فَلْتَغْتَسِلْ وَتَصُومُ ‏.‏ وَسُئِلَ عَمَّنْ أَسْلَمَ فِي آخِرِ يَوْمٍ مِنْ رَمَضَانَ هَلْ عَلَيْهِ قَضَاءُ رَمَضَانَ كُلِّهِ أَوْ يَجِبُ عَلَيْهِ قَضَاءُ الْيَوْمِ الَّذِي أَسْلَمَ فِيهِ فَقَالَ لَيْسَ عَلَيْهِ قَضَاءُ مَا مَضَى وَإِنَّمَا يَسْتَأْنِفُ الصِّيَامَ فِيمَا يُسْتَقْبَلُ وَأَحَبُّ إِلَىَّ أَنْ يَقْضِيَ الْيَوْمَ الَّذِي أَسْلَمَ فِيهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik bahawa Humayd ibn Oays al-Makki memberitahunya, \"Saya bersama Mujahid ketika dia melakukan tawaf di sekeliling Kaabah, dan seorang lelaki datang kepadanya dan bertanya sama ada hari-hari (berpuasa) untuk kaffarah perlu dilakukan berturut-turut, atau bolehkah ia dipecahkan. Saya berkata kepadanya, 'Ya, ia boleh dipecahkan, jika orang itu mahu.' Mujahid berkata, 'Dia tidak sepatutnya memecahkannya, kerana dalam bacaan Ubayy ibn Kab, ia dirujuk sebagai tiga hari berturut-turut.'\"\n\nMalik berkata, \"Apa yang paling saya sukai ialah apa yang telah Allah tetapkan dalam Al-Quran, iaitu, ia dilakukan secara berturut-turut.\"\n\nMalik ditanya tentang seorang wanita yang memulakan hari dengan berpuasa di bulan Ramadan dan walaupun di luar waktu haidnya, darah segar (iaitu bukan darah haid) mengalir darinya. Kemudian dia menunggu hingga petang untuk melihat yang sama, tetapi tidak melihat apa-apa. Kemudian, pada hari berikutnya pada waktu pagi dia mengalami aliran lain, walaupun kurang daripada yang pertama. Kemudian, beberapa hari sebelum haidnya, aliran itu berhenti sepenuhnya. Malik ditanya apa yang perlu dia lakukan tentang puasa dan solatnya, dan dia berkata, \"Darah ini seperti darah haid. Apabila dia melihatnya, dia harus berbuka puasa, dan kemudian menggantikan hari-hari yang telah dia tinggalkan. Kemudian, apabila darah telah berhenti sepenuhnya, dia harus melakukan mandi wajib dan berpuasa.\"\n\nMalik ditanya sama ada seseorang yang menjadi muslim pada hari terakhir Ramadan perlu menggantikan semua Ramadan atau sama ada dia hanya perlu menggantikan hari ketika dia menjadi muslim, dan dia berkata, \"Dia tidak perlu menggantikan mana-mana hari yang telah berlalu. Dia memulakan puasa dari hari itu dan seterusnya. Apa yang paling saya sukai ialah dia menggantikan hari di mana dia menjadi muslim."
  },
  {
    "id": 34883,
    "hadith_number": 705,
    "tajuk_hadith": "Mengganti Puasa Sunat yang Dibatalkan",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab",
    "english_text": "Yahya related to me from Malik from Ibn Shihab that A'isha and Hafsa, the wives of the Prophet, may Allah bless him and grant him peace, began fasting voluntarily one morning and then food was given to them and they broke their fast with it. Then the Messenger of Allah, may Allah bless him and grant him peace, came in. A'isha said, \"Hafsa asked, anticipating me in speech - she took after her father Umar - 'Messenger of Allah, A'isha and I began the morning fasting voluntarily and then food was given us and we broke the fast with it.' The Messenger of Allah, may Allah bless him and grant him peace, said, 'Fast another day in its place.' \"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عَائِشَةَ، وَحَفْصَةَ، زَوْجَىِ النَّبِيِّ صلى الله عليه وسلم أَصْبَحَتَا صَائِمَتَيْنِ مُتَطَوِّعَتَيْنِ فَأُهْدِيَ لَهُمَا طَعَامٌ فَأَفْطَرَتَا عَلَيْهِ فَدَخَلَ عَلَيْهِمَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَتْ عَائِشَةُ فَقَالَتْ حَفْصَةُ وَبَدَرَتْنِي بِالْكَلاَمِ - وَكَانَتْ بِنْتَ أَبِيهَا - يَا رَسُولَ اللَّهِ إِنِّي أَصْبَحْتُ أَنَا وَعَائِشَةُ صَائِمَتَيْنِ مُتَطَوِّعَتَيْنِ فَأُهْدِيَ إِلَيْنَا طَعَامٌ فَأَفْطَرْنَا عَلَيْهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اقْضِيَا مَكَانَهُ يَوْمًا آخَرَ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Ibn Shihab bahawa Aisyah dan Hafsa, isteri-isteri Nabi ﷺ, telah berpuasa sunat pada suatu pagi, kemudian makanan telah diberikan kepada mereka dan mereka membatalkan puasa mereka dengannya. Kemudian Rasulullah ﷺ masuk menemui mereka. Aisyah berkata, \"Hafsa bertanya, mendahului saya dalam percakapan - dia mengikut ayahnya Umar - 'Wahai Rasulullah, saya dan Aisyah telah memulakan pagi dengan berpuasa sunat dan kemudian makanan telah diberikan kepada kami dan kami membatalkan puasa dengannya.' Rasulullah ﷺ bersabda, 'Berpuasalah pada hari lain sebagai gantinya.' \""
  },
  {
    "id": 34884,
    "hadith_number": 706,
    "tajuk_hadith": "Hukum Makan atau Minum Secara Tidak Sengaja dalam Puasa Sunat dan Menyempurnakan Amalan Sunat",
    "perawi_melayu": "Yahya meriwayatkan bahawa beliau mendengar Malik berkata,",
    "english_text": "Yahya said that he heard Malik say, \"Someone who eats or drinks out of neglect or forgetfulness during a voluntary fast does not have to repeat his fast, but he should continue fasting for the rest of the day in which he eats or drinks while voluntarily fasting, and not stop fasting. Someone to whom something unexpected happens which causes him to break his fast while he is fasting voluntarily does not have to repeat his fast if he has broken it for a reason, and not simply because he decided to break his fast. Just as I do not think that someone has to repeat a voluntary prayer if he has had to stop it because of some discharge which he could prevent and which meant that he had to repeat his wudu.\"   Malik said, \"Once a man has begun doing any of the right actions (al-amal as-saliha) such as the prayer, the fast and the hajj, or similar right actions of a voluntary nature, he should not stop until he has completed it according to what the sunna for that action is. If he says the takbir he should not stop until he has prayed two rakas. If he is fasting he should not break his fast until he has completed that day's fast. If he goes into ihram he should not return until he has completed his hajj, and if he begins doing tawaf he should not stop doing so until he has gone around the Kaba seven times. He should not stop doing any of these actions once he has started them until he has completed them, except if something happens such as illness or some other matter by which a man is excused. This is because Allah, the Blessed and Exalted, says in His Book, 'And eat and drink until the white thread becomes clear to you from the black thread of dawn, (and) then complete the fast until night-time,' (Sura 2 ayat 187), and so he must complete his fast as Allah has said. Allah, the Exalted, (also) says, 'And complete the hajj and the umra for Allah,' and so if a man were to go into ihram for a voluntary hajj having done his one obligatory hajj (on a previous occasion), he could not then stop doing his hajj having once begun it and leave ihram while in the middle of his hajj. Anyone that begins a voluntary act must complete it once he has begun doing it, just as an obligatory act must be completed . This is the best of what I have heard.\"",
    "arabic_text": "",
    "malay_translation": "Yahya berkata bahawa beliau mendengar Malik berkata, \"Seseorang yang makan atau minum kerana lupa atau tidak sengaja semasa berpuasa sunat tidak perlu mengulangi puasanya, tetapi dia harus meneruskan puasanya sepanjang hari tersebut jika dia makan atau minum semasa berpuasa sunat, dan tidak berhenti berpuasa. Seseorang yang mengalami sesuatu yang tidak dijangka yang menyebabkan dia membatalkan puasanya semasa dia berpuasa sunat tidak perlu mengulangi puasanya jika dia membatalkannya atas sebab tertentu, dan bukan hanya kerana dia memutuskan untuk membatalkan puasanya. Sama seperti saya tidak berpendapat bahawa seseorang perlu mengulangi solat sunat jika dia terpaksa menghentikannya kerana sesuatu yang keluar yang boleh dia cegah dan yang bermaksud dia perlu mengulangi wudunya.\" Malik berkata, \"Setelah seseorang memulakan melakukan mana-mana amalan soleh (al-amal as-saliha) seperti solat, puasa dan haji, atau amalan soleh yang serupa yang bersifat sukarela, dia tidak patut berhenti sehingga dia telah menyempurnakannya menurut sunnah bagi amalan tersebut. Jika dia mengucapkan takbir, dia tidak patut berhenti sehingga dia telah solat dua rakaat. Jika dia berpuasa, dia tidak patut membatalkan puasanya sehingga dia telah menyempurnakan puasa hari itu. Jika dia masuk ihram, dia tidak patut kembali sehingga dia telah menyempurnakan hajinya, dan jika dia mula melakukan tawaf, dia tidak patut berhenti berbuat demikian sehingga dia telah mengelilingi Kaabah tujuh kali. Dia tidak patut berhenti melakukan mana-mana amalan ini setelah dia memulakannya sehingga dia telah menyempurnakannya, kecuali jika berlaku sesuatu seperti penyakit atau perkara lain yang mana seseorang itu dimaafkan. Ini kerana Allah, Yang Maha Berkat dan Maha Tinggi, berfirman dalam Kitab-Nya, 'Dan makan dan minumlah sehingga jelas kepada kamu benang putih dari benang hitam dari fajar, (dan) kemudian sempurnakanlah puasa itu sehingga malam,' (Surah 2 ayat 187), dan oleh itu dia mesti menyempurnakan puasanya seperti yang Allah firmankan. Allah, Yang Maha Tinggi, (juga) berfirman, 'Dan sempurnakanlah haji dan umrah kerana Allah,' dan oleh itu jika seseorang itu masuk ihram untuk haji sunat setelah menunaikan satu haji wajibnya (pada kesempatan sebelumnya), dia tidak boleh berhenti melakukan hajinya setelah memulakannya dan meninggalkan ihram semasa berada di tengah-tengah hajinya. Sesiapa yang memulakan perbuatan sukarela mesti menyempurnakannya setelah dia mula melakukannya, sama seperti perbuatan wajib mesti disempurnakan. Inilah yang terbaik yang pernah saya dengar.\""
  },
  {
    "id": 34885,
    "hadith_number": 707,
    "tajuk_hadith": "Anas bin Malik Membayar Fidyah Apabila Tidak Mampu Berpuasa",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik bahawa dia mendengar Anas ibn Malik membayar fidyah apabila dia sudah tua dan tidak lagi mampu berpuasa.",
    "english_text": "Yahya related to me from Malik that he had heard that Anas ibn\nMalik used to pay fidya when he had grown old and could no longer\nmanage to do the fast.\n\n\nMalik said, \"I do not consider that to\ndo so is obligatory, but what I like most is that a man does the fast\nwhen he is strong enough. Whoever pays compensation gives one mudd of\nfood in place of every day, using the mudd of the Prophet, may Allah\nbless him and grant him peace.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ أَنَسَ بْنَ مَالِكٍ، كَبِرَ حَتَّى كَانَ لاَ يَقْدِرُ عَلَى الصِّيَامِ فَكَانَ يَفْتَدِي ‏.‏ قَالَ مَالِكٌ وَلاَ أَرَى ذَلِكَ وَاجِبًا وَأَحَبُّ إِلَىَّ أَنْ يَفْعَلَهُ إِذَا كَانَ قَوِيًّا عَلَيْهِ فَمَنْ فَدَى فَإِنَّمَا يُطْعِمُ مَكَانَ كُلِّ يَوْمٍ مُدًّا بِمُدِّ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik bahawa dia telah mendengar bahawa Anas ibn Malik রাদিয়াল্লাহু আনহু biasa membayar fidyah apabila dia telah menjadi tua dan tidak lagi mampu untuk berpuasa. Malik berkata, \"Saya tidak menganggap bahawa berbuat demikian adalah wajib, tetapi apa yang paling saya sukai adalah seseorang itu berpuasa apabila dia cukup kuat. Sesiapa yang membayar fidyah, maka dia memberi satu mudd makanan sebagai ganti setiap hari, menggunakan mudd Nabi ﷺ."
  },
  {
    "id": 34886,
    "hadith_number": 708,
    "tajuk_hadith": "Hukum Wanita Hamil yang Bimbang akan Kandungannya Ketika Berpuasa",
    "perawi_melayu": "Malik",
    "english_text": "Yahya related to me from Malik that he had heard that Abdullah\nibn Umar was asked about what a pregnant woman should do if the fast\nbecame difficult for her and she feared for her child, and he said,\n\"She should break the fast and feed a poor man one mudd of wheat in\nplace of every day, using the mudd of the Prophet, may Allah bless him\nand grant him peace.\"\n\n\nMalik said, \"The people of  knowledge\nconsider that she has to make up for each day of the fast that she\nmisses as Allah, the Exalted and Glorified, says, 'And whoever of you\nis sick or on a journey should fast an equal number of other days, '\nand they consider her pregnancy and her concern for her child as a\nsickness.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، سُئِلَ عَنِ الْمَرْأَةِ الْحَامِلِ، إِذَا خَافَتْ عَلَى وَلَدِهَا وَاشْتَدَّ عَلَيْهَا الصِّيَامُ قَالَ تُفْطِرُ وَتُطْعِمُ مَكَانَ كُلِّ يَوْمٍ مِسْكِينًا مُدًّا مِنْ حِنْطَةٍ بِمُدِّ النَّبِيِّ صلى الله عليه وسلم ‏.‏ قَالَ مَالِكٌ وَأَهْلُ الْعِلْمِ يَرَوْنَ عَلَيْهَا الْقَضَاءَ كَمَا قَالَ اللَّهُ عَزَّ وَجَلَّ ‏{‏فَمَنْ كَانَ مِنْكُمْ مَرِيضًا أَوْ عَلَى سَفَرٍ فَعِدَّةٌ مِنْ أَيَّامٍ أُخَرَ‏}‏ وَيَرَوْنَ ذَلِكَ مَرَضًا مِنَ الأَمْرَاضِ مَعَ الْخَوْفِ عَلَى وَلَدِهَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik bahawa dia mendengar Abdullah bin Umar ditanya tentang apa yang perlu dilakukan oleh seorang wanita hamil jika puasa menjadi sukar baginya dan dia bimbang akan anaknya, lalu beliau berkata, \"Dia harus berbuka puasa dan memberi makan seorang miskin satu *mudd* gandum sebagai ganti setiap hari, menggunakan *mudd* Nabi, semoga Allah memberkati dan mengurniakan kesejahteraan kepadanya.\"\n\nMalik berkata, \"Para ulama berpendapat bahawa dia perlu menggantikan setiap hari puasa yang dia tinggalkan sebagaimana firman Allah, Maha Tinggi dan Maha Mulia, 'Dan sesiapa di antara kamu sakit atau dalam perjalanan (maka hendaklah ia berpuasa) sebanyak hari yang ditinggalkan itu pada hari-hari yang lain,' dan mereka menganggap kehamilannya dan kebimbangannya terhadap anaknya sebagai suatu penyakit.\""
  },
  {
    "id": 34887,
    "hadith_number": 709,
    "tajuk_hadith": "Kewajipan Mengganti Puasa Ramadan dan Memberi Makan Orang Miskin Jika Bertangguh",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Abd ar-Rahman ibn al-Qasim, daripada ayahnya.",
    "english_text": "Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nthat his father used to say, \"If someone has to make up for days not\nfasted in Ramadan and does not do them before the next Ramadan comes\nalthough he is strong enough to do so, he should feed a poor man with\na mudd of wheat for every day that he has missed, and he has to fast\nthe days he owes as well.\"\n\n\nYahya related to me from Malik\nthat he had heard the same thing from Said ibn Jubayr.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يَقُولُ مَنْ كَانَ عَلَيْهِ قَضَاءُ رَمَضَانَ فَلَمْ يَقْضِهِ - وَهُوَ قَوِيٌّ عَلَى صِيَامِهِ - حَتَّى جَاءَ رَمَضَانُ آخَرُ فَإِنَّهُ يُطْعِمُ مَكَانَ كُلِّ يَوْمٍ مِسْكِينًا مُدًّا مِنْ حِنْطَةٍ وَعَلَيْهِ مَعَ ذَلِكَ الْقَضَاءُ ‏.‏ \n وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ سَعِيدِ بْنِ جُبَيْرٍ، مِثْلُ ذَلِكَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Abd ar-Rahman ibn al-Qasim, bahawa ayahnya berkata, \"Sesiapa yang mempunyai tanggungan untuk mengganti puasa Ramadan dan tidak menggantikannya sebelum Ramadan berikutnya tiba, walaupun dia mampu untuk berpuasa, maka dia hendaklah memberi makan seorang miskin dengan satu *mudd* gandum bagi setiap hari yang dia tinggalkan, dan dia juga wajib mengganti puasa yang ditinggalkannya itu.\"\n\nYahya meriwayatkan kepadaku daripada Malik bahawa dia mendengar perkara yang sama daripada Said ibn Jubayr."
  },
  {
    "id": 34888,
    "hadith_number": 710,
    "tajuk_hadith": "Mengqadha' Puasa Ramadan Sebelum Bulan Sya'ban",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Yahya ibn Said, daripada Abu Salama ibn Abd ar-Rahman, bahawa dia mendengar Aisyah, isteri Nabi SAW, berkata:",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said from Abu\nSalama ibn Abd ar-Rahman that he heard A'isha, the wife of the\nProphet, may Allah bless him and grant him peace, say, \"I used to have\nto make up days from Ramadan and not be able to do them until Shaban\ncame.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم تَقُولُ إِنْ كَانَ لَيَكُونُ عَلَىَّ الصِّيَامُ مِنْ رَمَضَانَ فَمَا أَسْتَطِيعُ أَصُومُهُ حَتَّى يَأْتِيَ شَعْبَانُ",
    "malay_translation": "\"Sesungguhnya aku mempunyai tanggungan puasa dari Ramadan dan aku tidak mampu mengqadhanya sehingga tiba bulan Sya'ban.\""
  },
  {
    "id": 34889,
    "hadith_number": 711,
    "tajuk_hadith": "Hukum Berpuasa pada Hari Syak di Bulan Sya'ban",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik bahawa beliau mendengar orang-orang yang berilmu melarang orang ramai berpuasa pada hari yang meragukan di bulan Sya'ban (sama ada Sya'ban atau Ramadhan), jika mereka berniat untuk berpuasa Ramadhan. Mereka berpendapat bahawa sesiapa yang berpuasa pada hari itu tanpa melihat anak bulan, wajib menggantikan hari itu jika kemudiannya jelas bahawa ia adalah sebahagian daripada Ramadhan. Mereka tidak melihat sebarang mudarat dalam berpuasa sunat pada hari itu. Malik berkata, \"Inilah yang kami lakukan, dan apa yang saya lihat orang-orang berilmu di kota kami lakukan.\"",
    "english_text": "Yahya related to me from Malik that he had heard the people of\nknowledge telling people not to fast on the day in Shaban when there\nwas doubt (about whether it was Shaban or Ramadan), if they intended\nby it the fast of Ramadan . They considered that whoever fasted on\nthat day without having seen (the new moon) had to make up that day if\nit later became clear that it was part of Ramadan. They did not see\nany harm in voluntary fasting on that day.\n\n\nMalik said, \"This\nis what we do, and what I have seen the people of knowledge in our\ncity doing.\"",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik bahawa beliau mendengar orang-orang yang berilmu melarang orang ramai berpuasa pada hari yang meragukan di bulan Sya'ban (sama ada Sya'ban atau Ramadhan), jika mereka berniat untuk berpuasa Ramadhan. Mereka berpendapat bahawa sesiapa yang berpuasa pada hari itu tanpa melihat anak bulan, wajib menggantikan hari itu jika kemudiannya jelas bahawa ia adalah sebahagian daripada Ramadhan. Mereka tidak melihat sebarang mudarat dalam berpuasa sunat pada hari itu. Malik berkata, \"Inilah yang kami lakukan, dan apa yang saya lihat orang-orang berilmu di kota kami lakukan.\""
  },
  {
    "id": 34890,
    "hadith_number": 712,
    "tajuk_hadith": "Rasulullah S.A.W. Berpuasa dan Tidak Berpuasa",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Abu'n Nadr, mawla Umar ibn Ubaydullah, daripada Abu Salama ibn Abd ar-Rahman, daripada Aisyah, isteri Nabi S.A.W.",
    "english_text": "Yahya related to me from Malik from Abu'n Nadr, the mawla of Umar\nibn Ubaydullah, from Abu Salama ibn Abd ar-Rahman that A'isha, the\nwife of the Prophet, may Allah bless him and grant  him peace, said,\n\"The Messenger of Allah, may Allah bless him and grant him peace, used\nto fast for so long that we thought he would never stop fasting, and\nhe would go without fasting for so long that we thought he would never\nfast again. I never saw the Messenger of Allah, may Allah bless him\nand grant him peace, fast for a complete month except for Ramadan, and\nI never saw him do more fasting in any one month than he did in\nShaban.'",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ حَتَّى نَقُولَ لاَ يُفْطِرُ وَيُفْطِرُ حَتَّى نَقُولَ لاَ يَصُومُ وَمَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَكْمَلَ صِيَامَ شَهْرٍ قَطُّ إِلاَّ رَمَضَانَ وَمَا رَأَيْتُهُ فِي شَهْرٍ أَكْثَرَ صِيَامًا مِنْهُ فِي شَعْبَانَ ‏.‏",
    "malay_translation": "Aisyah, isteri Nabi S.A.W., berkata: \"Rasulullah S.A.W. berpuasa sehingga kami berkata, 'Baginda tidak akan berbuka,' dan baginda berbuka sehingga kami berkata, 'Baginda tidak akan berpuasa.' Aku tidak pernah melihat Rasulullah S.A.W. berpuasa sebulan penuh kecuali Ramadan, dan aku tidak pernah melihat baginda lebih banyak berpuasa dalam sebulan daripada bulan Syaaban.\""
  },
  {
    "id": 34891,
    "hadith_number": 713,
    "tajuk_hadith": "Puasa Sebagai Perisai dan Adab Ketika Berpuasa",
    "perawi_melayu": "Diriwayatkan daripada Malik, daripada Abu az-Zinad, daripada al-A'raj, daripada Abu Hurairah",
    "english_text": "Yahya related to me from Malik from Abu'z Zinad from al-A'raj\nfrom Abu Hurayra that the Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"Fasting is a protection for you, so when you\nare fasting, do not behave obscenely or foolishly, and if any one\nargues with you or abuses you, say, 'I am fasting. I am fasting.' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الصِّيَامُ جُنَّةٌ فَإِذَا كَانَ أَحَدُكُمْ صَائِمًا فَلاَ يَرْفُثْ وَلاَ يَجْهَلْ فَإِنِ امْرُؤٌ قَاتَلَهُ أَوْ شَاتَمَهُ فَلْيَقُلْ إِنِّي صَائِمٌ إِنِّي صَائِمٌ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Abu az-Zinad, daripada al-A'raj, daripada Abu Hurairah bahawa Rasulullah SAW bersabda, \"Puasa adalah perisai bagi kamu. Oleh itu, apabila kamu berpuasa, janganlah berkelakuan lucah atau bodoh. Jika seseorang bertengkar dengan kamu atau mencerca kamu, maka katakanlah, 'Sesungguhnya aku berpuasa, sesungguhnya aku berpuasa.'\""
  },
  {
    "id": 34892,
    "hadith_number": 714,
    "tajuk_hadith": "Keutamaan Bau Mulut Orang Berpuasa di Sisi Allah",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA",
    "english_text": "Yahya related to me from Malik from Abu'z Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"By the One in Whose hand my self is, the smell of\nthe breath of a man fasting is better with Allah than the scent of\nmusk.' He leaves his desires and his food and drink for My sake.\nFasting is for Me and I reward it. Every good action is rewarded by\nten times its kind, up to seven hundred times, except fasting, which\nis for Me, and I reward it.' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لَخُلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ إِنَّمَا يَذَرُ شَهْوَتَهُ وَطَعَامَهُ وَشَرَابَهُ مِنْ أَجْلِي فَالصِّيَامُ لِي وَأَنَا أَجْزِي بِهِ كُلُّ حَسَنَةٍ بِعَشْرِ أَمْثَالِهَا إِلَى سَبْعِمِائَةِ ضِعْفٍ إِلاَّ الصِّيَامَ فَهُوَ لِي وَأَنَا أَجْزِي بِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Abu'z Zinad, daripada al-Araj, daripada Abu Hurairah RA, bahawa Rasulullah SAW bersabda, \"Demi Zat yang jiwaku berada di tangan-Nya, sesungguhnya bau mulut orang yang berpuasa lebih harum di sisi Allah daripada bauan kasturi. Sesungguhnya dia meninggalkan syahwatnya, makanan dan minumannya kerana Aku. Puasa itu adalah untuk-Ku dan Aku yang akan membalasnya. Setiap kebaikan dibalas dengan sepuluh kali ganda hingga tujuh ratus kali ganda, kecuali puasa, maka ia adalah untuk-Ku dan Aku yang akan membalasnya.\""
  },
  {
    "id": 34893,
    "hadith_number": 715,
    "tajuk_hadith": "Keutamaan Bulan Ramadan: Pintu Syurga Dibuka, Pintu Neraka Ditutup, dan Syaitan Dibelenggu",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada bapa saudaranya Abu Suhayl ibn Malik, daripada bapanya, daripada Abu Hurairah, bahawa beliau berkata,",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَمِّهِ أَبِي سُهَيْلِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ إِذَا دَخَلَ رَمَضَانُ فُتِّحَتْ أَبْوَابُ الْجَنَّةِ وَغُلِّقَتْ أَبْوَابُ النَّارِ وَصُفِّدَتِ الشَّيَاطِينُ ‏.‏",
    "malay_translation": "Apabila Ramadan tiba, pintu-pintu Syurga dibuka, pintu-pintu Neraka ditutup, dan syaitan-syaitan dibelenggu."
  },
  {
    "id": 34894,
    "hadith_number": 716,
    "tajuk_hadith": "Bersiwak Ketika Berpuasa dan Puasa Enam Hari di Bulan Syawal serta Puasa Hari Jumaat",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik",
    "english_text": "Yahya related to me from Malik that he had heard that the people\nof knowledge did not disapprove of people fasting using tooth-sticks\nat any hour of the day in Ramadan, whether at the beginning or the\nend, nor had he heard any of the people of knowledge disapproving of\nor forbidding the practice.\n\n\nYahya said that he heard Malik\nsay, about fasting for six days after breaking the fast at the end of\nRamadan, that he had never seen any of the people of knowledge and\nfiqh fasting them. He said, \"I have not heard that any of our\npredecessors used to do that, and the people of knowledge disapprove\nof it and they are afraid that it might become a bida and that common\nand ignorant people might join to Ramadan what does not belong to it,\nif they were to think that the people of knowledge had given\npermission for that to be done and were seen doing it.\n\n\nYahya\nsaid that he heard Malik say, \"I have never heard any of the people of\nknowledge and fiqh and those whom people take as an example forbidding\nfasting on the day of jumua. Fasting on it is good, and I have seen\none of the people of knowledge fasting it, and it seemed to me that he\nwas keen to do so.\"",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik bahawa beliau mendengar bahawa para ulama tidak melarang orang yang berpuasa menggunakan kayu sugi (bersiwak) pada bila-bila masa sepanjang hari di bulan Ramadan, sama ada pada awal atau akhirnya, dan beliau juga tidak pernah mendengar mana-mana ulama yang tidak bersetuju atau melarang amalan tersebut.\n\nYahya berkata bahawa beliau mendengar Malik berkata, mengenai puasa enam hari selepas berbuka puasa pada akhir Ramadan, bahawa beliau tidak pernah melihat mana-mana ulama dan ahli fiqh berpuasa demikian. Beliau berkata, \"Saya tidak pernah mendengar mana-mana daripada pendahulu kita melakukan demikian, dan para ulama tidak menyukainya dan mereka bimbang ia mungkin menjadi bida'ah dan orang awam dan jahil mungkin menambah kepada Ramadan apa yang bukan termasuk di dalamnya, jika mereka berfikir bahawa para ulama telah memberikan kebenaran untuk itu dilakukan dan dilihat melakukannya.\"\n\nYahya berkata bahawa beliau mendengar Malik berkata, \"Saya tidak pernah mendengar mana-mana ulama dan ahli fiqh dan mereka yang dijadikan contoh oleh orang ramai melarang berpuasa pada hari Jumaat. Berpuasa pada hari itu adalah baik, dan saya telah melihat salah seorang daripada ulama berpuasa padanya, dan pada pandangan saya beliau sangat berminat untuk melakukannya."
  }
]