[
  {
    "id": 34400,
    "hadith_number": 222,
    "tajuk_hadith": "Syaitan Mengganggu Dalam Solat",
    "perawi_melayu": "Abu Hurairah r.a.",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Abu Salama ibn Abdar-Rahman ibn Awf from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"When you stand in prayer, Shaytan comes to you and confuses you until you do not know how much you have prayed. If you find that happening do two sajdas from the sitting position.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ أَحَدَكُمْ إِذَا قَامَ يُصَلِّي جَاءَهُ الشَّيْطَانُ فَلَبَسَ عَلَيْهِ حَتَّى لاَ يَدْرِي كَمْ صَلَّى فَإِذَا وَجَدَ ذَلِكَ أَحَدُكُمْ فَلْيَسْجُدْ سَجْدَتَيْنِ وَهُوَ جَالِسٌ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Abu Salama ibn Abdar-Rahman ibn Awf, daripada Abu Hurairah bahawa Rasulullah SAW bersabda: \"Sesungguhnya seseorang daripada kamu apabila berdiri untuk solat, syaitan datang kepadanya dan mengelirukannya sehingga dia tidak tahu berapa rakaat yang telah dia solat. Jika salah seorang daripada kamu mendapati hal itu, maka hendaklah dia sujud dua kali dalam keadaan duduk.\""
  },
  {
    "id": 34401,
    "hadith_number": 223,
    "tajuk_hadith": "Ketetapan Sunnah Melalui Kealpaan",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik bahawa dia mendengar bahawa Rasulullah ﷺ bersabda,",
    "english_text": "I forget or I am made to forget so that I may establish the sunna.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنِّي لأَنْسَى أَوْ أُنَسَّى لأَسُنَّ ‏\"‏ ‏.‏",
    "malay_translation": "“Sesungguhnya aku lupa atau aku dibuat lupa supaya aku menetapkan sunnah.”"
  },
  {
    "id": 34402,
    "hadith_number": 224,
    "tajuk_hadith": "Tumpuan dalam Solat dan Gangguan Fikiran",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik that he had heard that a man\nquestioned al-Qasim ibn Muhammad saying, \"My imagination works in the\nprayer, and it happens to me a lot.\" Al-Qasim ibn Muhammad said, \"Go\non with your prayer, for it will not go away from you until you go away\nsaying, 'I have not completed my prayer.' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَجُلاً، سَأَلَ الْقَاسِمَ بْنَ مُحَمَّدٍ فَقَالَ إِنِّي أَهِمُ فِي صَلاَتِي فَيَكْثُرُ ذَلِكَ عَلَىَّ ‏.‏ فَقَالَ الْقَاسِمُ بْنُ مُحَمَّدٍ امْضِ فِي صَلاَتِكَ فَإِنَّهُ لَنْ يَذْهَبَ عَنْكَ حَتَّى تَنْصَرِفَ وَأَنْتَ تَقُولُ مَا أَتْمَمْتُ صَلاَتِي ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik bahawa dia mendengar seorang lelaki bertanya kepada al-Qasim ibn Muhammad, \"Fikiran saya mengganggu dalam solat, dan ia kerap berlaku kepada saya.\" Al-Qasim ibn Muhammad berkata, \"Teruskan solatmu, kerana ia tidak akan hilang daripada kamu sehingga kamu selesai solat dan berkata, 'Saya belum menyempurnakan solat saya.'\""
  }
]
