[
  {
    "id": 35785,
    "hadith_number": 1607,
    "tajuk_hadith": "Status Anak-Anak Hamba Perempuan Mudabbara",
    "perawi_melayu": "Yahya melalui Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan daripada Malik yang berkata, \"Bagaimana hukumnya dalam masyarakat kita terhadap lelaki yang menjadikan hamba perempuannya sebagai mudabbara dan perempuan itu melahirkan anak-anak kemudiannya, dan hamba perempuan itu meninggal dunia sebelum lelaki yang memberikan tadbir kepadanya, maka anak-anaknya berada dalam kedudukan ibunya. Syarat-syarat yang telah ditetapkan untuk ibunya juga ditetapkan untuk mereka. Kematian ibu mereka tidak memberi kesan kepada mereka. Jika lelaki yang menjadikan hamba perempuan itu mudabbara meninggal dunia, mereka bebas jika nilai mereka kurang daripada satu pertiga daripada keseluruhan harta pusakanya.\"\n\nMalik berkata, \"Bagi setiap ibu kandung berbanding ibu susuan, anak-anaknya berada dalam kedudukan ibunya. Jika ibunya bebas dan melahirkan anak selepas bebas, anak-anaknya juga bebas. Jika ibunya mudabbara atau mukataba, atau dibebaskan selepas beberapa tahun berkhidmat, atau sebahagian darinya bebas atau di gadaikan atau dia seorang umm walad, setiap anak-anaknya berada dalam kedudukan yang sama seperti ibunya. Mereka dibebaskan apabila ibunya dibebaskan dan mereka menjadi hamba apabila ibunya menjadi hamba.\"\n\nMalik berkata mengenai mudabbara yang diberi tadbir ketika hamil, \"Anak-anaknya berada dalam kedudukan ibunya. Begitu juga kedudukan lelaki yang membebaskan hamba perempuannya ketika hamil dan tidak mengetahui bahawa dia hamil.\"\n\nMalik berkata, \"Sunnah mengenai perempuan sebegini ialah anak-anak mereka mengikut status mereka dan dibebaskan apabila mereka dibebaskan.\"\n\nMalik berkata, \"Ia sama seperti seseorang membeli hamba perempuan ketika hamil. Hamba perempuan dan kandungannya menjadi milik pembeli sama ada pembeli menyatakannya atau tidak.\"\n\nMalik meneruskan, \"Tidak halal bagi penjual untuk membuat pengecualian mengenai kandungan kerana ia merupakan transaksi yang tidak pasti. Ia mengurangkan harganya dan dia tidak tahu sama ada ia akan sampai kepadanya atau tidak. Ia seperti menjual janin dalam kandungan ibunya. Itu tidak halal kerana ia merupakan transaksi yang tidak pasti.\"\n\nMalik berkata mengenai mukatab atau mudabbar yang membeli hamba perempuan dan melakukan hubungan seks dengannya dan dia hamil olehnya dan melahirkan anak, \"Anak-anak mereka berdua daripada hamba perempuan itu berada dalam kedudukannya. Mereka dibebaskan apabila dia dibebaskan dan mereka menjadi hamba apabila dia menjadi hamba.\"\n\nMalik berkata, \"Apabila dia dibebaskan, umm walad adalah sebahagian daripada hartanya yang diserahkan kepadanya apabila dia dibebaskan.\""
  },
  {
    "id": 35786,
    "hadith_number": 1608,
    "tajuk_hadith": "Pembebasan Hamba Mudabbar dan Hutang",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Malik menceritakan tentang seorang hamba mudabbar yang berkata kepada tuannya, \"Bebaskanlah saya segera dan saya akan memberi lima puluh dinar yang akan saya bayar secara ansuran.\" Tuanya berkata, \"Baiklah. Kamu bebas dan kamu mesti membayar lima puluh dinar, dan kamu akan membayar sepuluh dinar setiap tahun.\" Hamba itu bersetuju. Kemudian tuannya meninggal dunia satu, dua atau tiga hari selepas itu.  Malik berkata, \"Pengembalian kebebasan itu sah dan lima puluh dinar itu menjadi hutang baginya. Kesaksiannya dibenarkan, kebebasannya disahkan, begitu juga dengan hartanya dan liabiliti kepada hukuman hudud sepenuhnya. Kematian tuannya, bagaimanapun, tidak mengurangkan hutangnya langsung.\" \n\nMalik juga berkata bahawa jika seorang lelaki yang menjadikan hambanya sebagai mudabbar meninggal dunia dan dia mempunyai beberapa harta di tangan dan beberapa harta yang jauh, dan dalam harta yang ada di tangannya tidak mencukupi (sepertiga yang dibenarkan untuk wasiat) untuk menampung nilai hamba mudabbar itu, maka hamba mudabbar itu dibiarkan bersama-sama dengan harta itu, dan cukai (kharaj)nya dikumpulkan sehingga harta tuannya yang jauh itu jelas. Kemudian, jika sepertiga daripada apa yang ditinggalkan oleh tuannya itu mencukupi untuk menampung nilainya, dia dibebaskan bersama hartanya dan apa yang telah terkumpul daripada cukaianya. Jika tidak cukup untuk menampung nilainya daripada apa yang ditinggalkan oleh tuannya, maka sebahagian daripadanya dibebaskan sebanyak yang dibenarkan oleh sepertiga itu, dan hartanya ditinggalkan di tangannya."
  },
  {
    "id": 35787,
    "hadith_number": 1609,
    "tajuk_hadith": "Pembebasan Hamba dalam Wasat dan Tadbir",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Malik berkata, \"Amalan yang lazim dalam masyarakat kita ialah sebarang pembebasan yang dilakukan oleh seseorang melalui wasiat sama ada ketika sihat atau sakit, boleh dibatalkan olehnya bila-bila masa dan diubah bila-bila masa selagi ia bukan tadbir. Tiada cara untuk membatalkan tadbir setelah ia dilakukan.\n\nBerkenaan dengan setiap anak yang dilahirkan oleh hamba perempuan yang diwasiatkan untuk dibebaskan tetapi tidak dibuat mudabbara, anak-anaknya tidak dibebaskan bersamanya apabila dia dibebaskan. Ini kerana tuannya boleh mengubah wasiatnya bila-bila masa dan membatalkannya bila-bila masa, dan pembebasan tidak disahkan untuknya. Dia berada dalam kedudukan hamba perempuan yang tuannya berkata, 'Jika si anu kekal bersamaku sehingga aku mati, dia bebas.' (iaitu dia tidak membuat kontrak yang pasti).\n\nMalik berkata, \"Jika dia memenuhi syarat itu, itu adalah haknya. Jika dia mahu, sebelum itu, dia boleh menjualnya dan anaknya kerana dia tidak memasukkan anaknya ke dalam sebarang syarat yang telah dibuatnya untuknya.\n\nWasiat dalam pembebasan berbeza daripada tadbir. Preseden sunnah membezakan di antara keduanya. Sekiranya wasiat berada dalam kedudukan tadbir, tiada pewasiat dapat mengubah wasiatnya dan apa yang disebutkannya tentang pembebasan. Harta bendanya akan terikat dan dia tidak akan dapat menggunakannya.\"\n\nMalik berkata tentang seseorang yang menjadikan semua hambanya mudabbar ketika dia sihat dan mereka adalah satu-satunya hartanya, \"Jika dia menjadikan sebahagian daripada mereka mudabbar sebelum yang lain, seseorang bermula dengan yang pertama sehingga sepertiga hartanya dicapai. (iaitu nilai mereka dipadankan dengan sepertiga, dan mereka yang nilainya mencukupi adalah bebas). Jika dia menjadikan semuanya mudabbar ketika sakit, dan berkata dalam satu kenyataan, 'Si anu bebas. Si anu bebas. Si anu bebas jika kematian saya berlaku dalam penyakit ini,' atau dia menjadikan semuanya mudabbar dalam satu kenyataan, mereka dipadankan dengan sepertiga dan seseorang tidak bermula dengan mana-mana daripada mereka sebelum yang lain. Ia adalah wasiat dan mereka mempunyai sepertiga daripada hartanya yang dibahagikan kepada mereka mengikut bahagian. Kemudian sepertiga daripada hartanya membebaskan setiap daripada mereka mengikut kadar bahagiannya.\n\nTiada seorang pun daripada mereka diberi keutamaan apabila semuanya berlaku ketika dia sakit.\"\n\nMalik bercakap tentang seorang tuan yang menjadikan hambanya mudabbar dan kemudian dia meninggal dunia dan satu-satunya harta yang dimilikinya ialah hamba mudabbar dan hamba itu mempunyai harta. Dia berkata, \"Sepertiga daripada mudabbar dibebaskan dan hartanya kekal dalam milikannya.\"\n\nMalik berkata tentang seorang mudabbar yang tuannya memberinya kitaba dan kemudian tuannya meninggal dunia dan tidak meninggalkan harta lain selain darinya, \"Sepertiga darinya dibebaskan dan sepertiga daripada kitabanya dikurangkan, dan dia berhutang dua pertiga.\"\n\nMalik bercakap tentang seseorang yang membebaskan separuh daripada hambanya ketika dia sakit dan menjadikan tidak boleh dibatalkan pembebasan separuh darinya atau kesemuanya, dan dia telah menjadikan hamba lain mudabbar sebelum itu. Dia berkata, \"Seseorang bermula dengan hamba yang dijadikannya mudabbar sebelum hamba yang dibebaskannya ketika dia sakit. Ini kerana orang itu tidak boleh membatalkan apa yang telah dijadikannya mudabbar dan tidak boleh mengikutinya dengan perkara yang akan membatalkannya. Apabila mudabbar ini dibebaskan, maka apa yang tinggal daripada sepertiga itu diberikan kepada orang yang separuh darinya dibebaskan supaya melengkapkan pembebasannya sepenuhnya dalam sepertiga daripada harta si mati. Jika apa yang tinggal daripada sepertiga itu tidak mencukupi, apa sahaja yang mencukupi daripada apa yang tinggal daripada sepertiga itu dibebaskan selepas mudabbar pertama dibebaskan.\""
  },
  {
    "id": 35788,
    "hadith_number": 1610,
    "tajuk_hadith": "Abdullah ibn Umar dan Dua Orang Gadis Hamba",
    "perawi_melayu": "Malik daripada Nafi'",
    "english_text": "Malik related to me from Nafi that Abdullah ibn Umar made two of\nhis slave-girls mudabbara, and he had intercourse with them while they\nwere mudabbara.",
    "arabic_text": "حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، دَبَّرَ جَارِيَتَيْنِ لَهُ فَكَانَ يَطَؤُهُمَا وَهُمَا مُدَبَّرَتَانِ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Nafi' bahawa Abdullah bin Umar telah menjadikan dua orang hamba perempuannya sebagai mudabbara, dan baginda telah melakukan hubungan intim dengan mereka ketika mereka dalam keadaan mudabbara."
  },
  {
    "id": 35789,
    "hadith_number": 1611,
    "tajuk_hadith": "Status Perempuan Hamba yang Dibebaskan Secara Mudabbara",
    "perawi_melayu": "Malik meriwayatkan daripada Yahya bin Said bahawa Said bin al-Musayyab",
    "english_text": "Malik related to me from Yahya ibn Said that Said ibn al-Musayyab\nused to say, \"When a man makes his slave-girl mudabbara, he can have\nintercourse with her. He cannot sell her or give her away and her\nchildren are in the same position as her.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، كَانَ يَقُولُ إِذَا دَبَّرَ الرَّجُلُ  جَارِيَتَهُ فَإِنَّ لَهُ أَنْ يَطَأَهَا وَلَيْسَ لَهُ أَنْ يَبِيعَهَا وَلاَ يَهَبَهَا وَوَلَدُهَا بِمَنْزِلَتِهَا ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Yahya bin Said bahawa Said bin al-Musayyab berkata, \"Apabila seorang lelaki membebaskan hamba perempuannya secara mudabbara, maka dia dibenarkan untuk menghampirinya (bersetubuh).  Dia tidak boleh menjual atau memberi hadiah hamba perempuan itu, dan anak-anaknya mempunyai status yang sama seperti ibunya.\""
  },
  {
    "id": 35790,
    "hadith_number": 1612,
    "tajuk_hadith": "Hukum Muallaf (Mudabbar) dalam Islam",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Malik berkata, \"Amalan yang lazim dalam masyarakat kita mengenai seorang muallaf (mudabbar) ialah pemiliknya tidak boleh menjualnya atau mengubah kedudukannya. Jika tuan punya hutang, pemiutangnya tidak boleh menjual muallaf selagi tuan masih hidup. Jika tuan meninggal dunia dan tiada hutang, muallaf termasuk dalam bahagian sepertiga (wasiat) kerana tuan mengharapkan khidmatnya sepanjang hayat.  Dia tidak boleh melayan tuannya seumur hidup, kemudian dimerdekakan oleh warisnya daripada harta pusaka utama apabila meninggal dunia. Jika tuan muallaf meninggal dunia dan tiada harta selain darinya, sepertiga darinya dibebaskan, dan dua pertiga milik waris. Jika tuan muallaf meninggal dunia dan berhutang yang melibatkan muallaf, dia dijual untuk melunaskan hutang kerana dia hanya boleh dibebaskan dalam sepertiga (yang dibenarkan untuk wasiat).\"\n\nBeliau berkata, \"Jika hutang hanya meliputi separuh daripada hamba, separuh darinya dijual untuk hutang. Kemudian sepertiga daripada baki selepas hutang dibebaskan.\"\n\nMalik berkata, \"Tidak dibenarkan menjual muallaf dan tidak dibenarkan sesiapa membelinya melainkan muallaf itu sendiri membeli dirinya daripada tuannya. Dia dibenarkan berbuat demikian. Atau seseorang memberi wang kepada tuan muallaf dan tuannya yang menjadikannya muallaf membebaskannya. Itu juga dibenarkan.\"\n\nMalik berkata, \"Wala'nya adalah milik tuannya yang menjadikannya muallaf.\"\n\nMalik berkata, \"Tidak dibenarkan menjual khidmat muallaf kerana ia adalah transaksi yang tidak menentu kerana seseorang tidak tahu berapa lama tuannya akan hidup. Itu tidak menentu dan tidak baik.\"\n\nMalik menyebut tentang hamba yang dikongsi oleh dua orang lelaki, dan seorang daripada mereka menjadikan bahagiannya muallaf. Beliau berkata, \"Mereka menganggarkan nilainya di antara mereka. Jika orang yang menjadikannya muallaf membelinya, dia menjadi muallaf sepenuhnya. Jika dia tidak membelinya, tadbirnya dibatalkan melainkan orang yang mengekalkan pemilikan ke atasnya ingin memberikan nilai kepada pasangannya yang menjadikannya muallaf. Jika dia memberikannya mengikut nilainya, itu mengikat, dan dia menjadi muallaf sepenuhnya.\"\n\nMalik menyebut tentang lelaki Kristian yang menjadikan hamba Kristiannya muallaf, kemudian hamba itu memeluk Islam. Beliau berkata, \"Orang itu memisahkan tuan dan hamba, dan hamba itu dikeluarkan daripada tuannya yang Kristian dan tidak dijual sehingga keadaannya jelas. Jika Kristian itu meninggal dunia dan berhutang, hutangnya dibayar daripada harga hamba melainkan dia mempunyai harta yang mencukupi untuk membayar hutang. Kemudian muallaf dibebaskan.\""
  },
  {
    "id": 35791,
    "hadith_number": 1613,
    "tajuk_hadith": "Hukum Mudabbar yang Mencederakan Orang Lain",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، قَضَى فِي الْمُدَبَّرِ إِذَا جَرَحَ أَنَّ لِسَيِّدِهِ أَنْ يُسَلِّمَ مَا يَمْلِكُ مِنْهُ إِلَى الْمَجْرُوحِ فَيَخْتَدِمُهُ الْمَجْرُوحُ وَيُقَاصُّهُ بِجِرَاحِهِ مِنْ دِيَةِ جَرْحِهِ فَإِنْ أَدَّى قَبْلَ أَنْ يَهْلِكَ سَيِّدُهُ رَجَعَ إِلَى سَيِّدِهِ ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ عِنْدَنَا فِي الْمُدَبَّرِ إِذَا جَرَحَ ثُمَّ هَلَكَ سَيِّدُهُ وَلَيْسَ لَهُ مَالٌ غَيْرُهُ أَنَّهُ يُعْتَقُ ثُلُثُهُ ثُمَّ يُقْسَمُ عَقْلُ الْجَرْحِ أَثْلاَثًا فَيَكُونُ ثُلُثُ الْعَقْلِ عَلَى الثُّلُثِ الَّذِي عَتَقَ مِنْهُ وَيَكُونُ ثُلُثَاهُ عَلَى الثُّلُثَيْنِ اللَّذَيْنِ بِأَيْدِي الْوَرَثَةِ إِنْ شَاءُوا أَسْلَمُوا الَّذِي لَهُمْ مِنْهُ إِلَى صَاحِبِ الْجَرْحِ وَإِنْ شَاءُوا أَعْطَوْهُ ثُلُثَىِ الْعَقْلِ وَأَمْسَكُوا نَصِيبَهُمْ مِنَ الْعَبْدِ وَذَلِكَ أَنَّ عَقْلَ ذَلِكَ الْجَرْحِ إِنَّمَا كَانَتْ جِنَايَتُهُ مِنَ الْعَبْدِ وَلَمْ تَكُنْ دَيْنًا عَلَى السَّيِّدِ فَلَمْ يَكُنْ ذَلِكَ الَّذِي أَحْدَثَ الْعَبْدُ بِالَّذِي يُبْطِلُ مَا صَنَعَ السَّيِّدُ مِنْ عِتْقِهِ وَتَدْبِيرِهِ فَإِنْ كَانَ عَلَى سَيِّدِ الْعَبْدِ دَيْنٌ لِلنَّاسِ مَعَ جِنَايَةِ الْعَبْدِ بِيعَ مِنَ الْمُدَبَّرِ بِقَدْرِ عَقْلِ الْجَرْحِ وَقَدْرِ الدَّيْنِ ثُمَّ يُبَدَّأُ بِالْعَقْلِ الَّذِي كَانَ فِي جِنَايَةِ الْعَبْدِ فَيُقْضَى مِنْ ثَمَنِ الْعَبْدِ ثُمَّ يُقْضَى دَيْنُ سَيِّدِهِ ثُمَّ يُنْظَرُ إِلَى مَا بَقِيَ بَعْدَ ذَلِكَ مِنَ الْعَبْدِ فَيَعْتِقُ ثُلُثُهُ وَيَبْقَى ثُلُثَاهُ لِلْوَرَثَةِ وَذَلِكَ أَنَّ جِنَايَةَ الْعَبْدِ هِيَ أَوْلَى مِنْ دَيْنِ سَيِّدِهِ وَذَلِكَ أَنَّ الرَّجُلَ إِذَا هَلَكَ وَتَرَكَ عَبْدًا مُدَبَّرًا قِيمَتُهُ خَمْسُونَ وَمِائَةُ دِينَارٍ وَكَانَ الْعَبْدُ قَدْ شَجَّ رَجُلاً حُرًّا مُوضِحَةً عَقْلُهَا خَمْسُونَ دِينَارًا وَكَانَ عَلَى سَيِّدِ الْعَبْدِ مِنَ الدَّيْنِ خَمْسُونَ دِينَارًا ‏.‏ قَالَ مَالِكٌ فَإِنَّهُ يُبْدَأُ بِالْخَمْسِينَ دِينَارًا الَّتِي فِي عَقْلِ الشَّجَّةِ فَتُقْضَى مِنْ ثَمَنِ الْعَبْدِ ثُمَّ يُقْضَى دَيْنُ سَيِّدِهِ ثُمَّ يُنْظَرُ إِلَى مَا بَقِيَ مِنَ الْعَبْدِ فَيَعْتِقُ ثُلُثُهُ وَيَبْقَى ثُلُثَاهُ لِلْوَرَثَةِ فَالْعَقْلُ أَوْجَبُ فِي رَقَبَتِهِ مِنْ دَيْنِ سَيِّدِهِ وَدَيْنُ سَيِّدِهِ أَوْجَبُ مِنَ التَّدْبِيرِ الَّذِي إِنَّمَا هُوَ وَصِيَّةٌ فِي ثُلُثِ مَالِ الْمَيِّتِ فَلاَ يَنْبَغِي أَنْ يَجُوزَ شَىْءٌ مِنَ التَّدْبِيرِ وَعَلَى سَيِّدِ الْمُدَبَّرِ دَيْنٌ لَمْ يُقْضَ وَإِنَّمَا هُوَ وَصِيَّةٌ وَذَلِكَ أَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَالَ ‏{‏مِنْ بَعْدِ وَصِيَّةٍ يُوصَى بِهَا أَوْ دَيْنٍ‏}‏ ‏.‏ قَالَ مَالِكٌ فَإِنْ كَانَ فِي ثُلُثِ الْمَيِّتِ مَا يَعْتِقُ فِيهِ الْمُدَبَّرُ كُلُّهُ عَتَقَ وَكَانَ عَقْلُ جِنَايَتِهِ دَيْنًا عَلَيْهِ يُتَّبَعُ بِهِ بَعْدَ عِتْقِهِ وَإِنْ كَانَ ذَلِكَ الْعَقْلُ الدِّيَةَ كَامِلَةً وَذَلِكَ إِذَا لَمْ يَكُنْ عَلَى سَيِّدِهِ دَيْنٌ ‏.‏ وَقَالَ مَالِكٌ فِي الْمُدَبَّرِ إِذَا جَرَحَ رَجُلاً فَأَسْلَمَهُ سَيِّدُهُ إِلَى الْمَجْرُوحِ ثُمَّ هَلَكَ سَيِّدُهُ وَعَلَيْهِ دَيْنٌ وَلَمْ يَتْرُكْ مَالاً غَيْرَهُ فَقَالَ الْوَرَثَةُ نَحْنُ نُسَلِّمُهُ إِلَى صَاحِبِ الْجُرْحِ ‏.‏ وَقَالَ صَاحِبُ الدَّيْنِ أَنَا أَزِيدُ عَلَى ذَلِكَ إِنَّهُ إِذَا زَادَ الْغَرِيمُ شَيْئًا فَهُوَ أَوْلَى بِهِ وَيُحَطُّ عَنِ الَّذِي عَلَيْهِ الدَّيْنُ قَدْرُ مَا زَادَ الْغَرِيمُ عَلَى دِيَةِ الْجَرْحِ فَإِنْ لَمْ يَزِدْ شَيْئًا لَمْ يَأْخُذِ الْعَبْدَ ‏.‏ وَقَالَ مَالِكٌ فِي الْمُدَبَّرِ إِذَا جَرَحَ وَلَهُ مَالٌ فَأَبَى سَيِّدُهُ أَنْ يَفْتَدِيَهُ فَإِنَّ الْمَجْرُوحَ يَأْخُذُ مَالَ الْمُدَبَّرِ فِي دِيَةِ جُرْحِهِ فَإِنْ كَانَ فِيهِ وَفَاءٌ اسْتَوْفَى الْمَجْرُوحُ دِيَةَ جُرْحِهِ وَرَدَّ الْمُدَبَّرَ إِلَى سَيِّدِهِ وَإِنْ لَمْ يَكُنْ فِيهِ وَفَاءٌ اقْتَضَاهُ مِنْ دِيَةِ جُرْحِهِ وَاسْتَعْمَلَ الْمُدَبَّرَ بِمَا بَقِيَ لَهُ مِنْ دِيَةِ جُرْحِهِ ‏.‏",
    "malay_translation": "Malik meriwayatkan bahawa baginda telah diberitahu bahawa Umar bin Abdul Aziz telah membuat keputusan mengenai seorang hamba yang dibebas bersyarat (mudabbar) yang mencederakan seseorang.  Keputusannya ialah, tuan hamba itu wajib menyerahkan apa sahaja yang dimilikinya daripada hamba tersebut kepada orang yang cedera.  Orang yang cedera boleh menggunakan khidmat hamba itu dan mendapatkan ganti rugi daripada hamba itu sebagai diat (tebusan) bagi kecederaannya. Jika hamba itu melunaskan ganti rugi tersebut sebelum tuannya meninggal dunia, maka hamba itu akan kembali kepada tuannya.\n\nMalik berkata, \"Cara yang lazim dilakukan dalam masyarakat kita mengenai hamba yang dibebas bersyarat yang mencederakan seseorang, kemudian tuannya meninggal dunia dan tuannya tiada harta selain hamba itu, ialah sepertiga daripada hamba itu dibebaskan, kemudian diat bagi kecederaan tersebut dibahagikan kepada tiga bahagian. Sebahagian diat dikira daripada sepertiga yang dibebaskan, dan dua pertiga lagi dikira daripada dua pertiga yang menjadi milik waris. Jika waris mahu, mereka boleh menyerahkan bahagian mereka daripada hamba tersebut kepada mangsa kecederaan, dan jika mereka mahu, mereka boleh membayar dua pertiga diat kepada mangsa kecederaan dan mengekalkan bahagian mereka daripada hamba tersebut. Ini kerana kecederaan itu adalah satu kesalahan jenayah yang dilakukan oleh hamba tersebut dan bukannya hutang tuan hamba yang boleh membatalkan pembebasan bersyarat dan pengaturan yang telah dibuat oleh tuan hamba itu. Jika tuan hamba itu mempunyai hutang kepada orang lain, di samping kesalahan jenayah yang dilakukan oleh hamba itu, maka sebahagian daripada hamba yang dibebas bersyarat itu akan dijual mengikut jumlah diat bagi kecederaan dan jumlah hutang. Kemudian, bayaran diat bagi kesalahan jenayah hamba itu akan diutamakan, dibayar daripada hasil jualan hamba tersebut.  Kemudian hutang tuannya dibayar, dan kemudian dilihat baki yang tinggal daripada hamba itu. Sepertiga daripadanya dibebaskan, dan dua pertiga lagi menjadi milik waris. Ini kerana kesalahan jenayah hamba itu lebih utama daripada hutang tuannya.  Sebagai contoh, jika seseorang meninggal dunia dan meninggalkan hamba yang dibebas bersyarat bernilai seratus lima puluh dinar, dan hamba itu memukul kepala seorang lelaki bebas sehingga mengalami kecederaan yang memerlukan diat sebanyak lima puluh dinar, dan tuan hamba itu mempunyai hutang sebanyak lima puluh dinar, maka bayaran diat bagi kecederaan kepala diutamakan terlebih dahulu, dibayar daripada hasil jualan hamba itu. Kemudian hutang tuannya dibayar. Kemudian dilihat baki yang tinggal daripada hamba tersebut, maka sepertiga dibebaskan dan dua pertiga lagi menjadi milik waris. Diat lebih utama daripada hutang tuannya. Hutang tuannya lebih utama daripada pengaturan pembebasan bersyarat yang merupakan wasiat daripada sepertiga harta si mati. Tiada pengaturan pembebasan bersyarat dibenarkan selagi tuan hamba yang dibebas bersyarat itu masih mempunyai hutang yang belum dibayar. Ini kerana ia merupakan wasiat. Ini berdasarkan firman Allah SWT, \"Selepas wasiat atau hutang.\" (Surah 4, ayat 10)\n\nMalik berkata, \"Jika terdapat wang yang cukup dalam sepertiga harta si mati untuk membebaskan sepenuhnya hamba yang dibebas bersyarat itu, maka dia dibebaskan dan diat bagi kesalahan jenayahnya menjadi hutang ke atasnya yang perlu dibayar selepas dibebaskan, walaupun diat itu adalah jumlah penuh. Ia bukanlah hutang tuan hambanya.\"\n\nMalik menyebut tentang hamba yang dibebas bersyarat yang mencederakan seseorang dan tuannya menyerahkannya kepada pihak yang cedera, kemudian tuannya meninggal dunia dan mempunyai hutang dan tidak meninggalkan harta lain selain hamba itu, dan waris berkata, \"Kami menyerahkan hamba itu kepada mangsa,\" manakala pemiutang berkata, \"Hutang saya melebihi itu.\" Malik berkata bahawa jika hutang pemiutang itu memang melebihi jumlah diat, maka pemiutang itu lebih berhak dan jumlah yang melebihi diat diambil daripada yang berhutang. Jika hutangnya tidak melebihi jumlah diat, maka dia tidak akan mengambil hamba itu.\n\nMalik menyebut tentang hamba yang dibebas bersyarat yang mencederakan seseorang dan mempunyai harta, dan tuannya enggan menebusnya.  Baginda berkata, \"Pihak yang cedera boleh mengambil harta hamba yang dibebas bersyarat itu sebagai bayaran diat. Jika hartanya cukup, maka pihak yang cedera dibayar penuh dan hamba itu dikembalikan kepada tuannya. Jika hartanya tidak cukup, maka pihak yang cedera mengambil harta itu dan menggunakan hamba itu untuk melunaskan baki diat.\""
  },
  {
    "id": 35792,
    "hadith_number": 1614,
    "tajuk_hadith": "Tanggungjawab Tuan terhadap Umm Walad yang Mencederakan Orang Lain",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Malik berkata, berkenaan dengan seorang umm walad yang mencederakan seseorang, \"Ditetapkan di atas tuan perempuan itu membayar diyat (tebusan darah) daripada hartanya, melainkan jika diyat kecederaan itu lebih besar daripada nilai umm walad tersebut. Tuannya tidak perlu membayar melebihi nilai umm walad itu.  Ini kerana apabila tuan hamba lelaki atau hamba perempuan menyerahkan hambanya untuk suatu kecederaan yang dilakukan oleh salah seorang daripada mereka, dia tidak perlu menanggung lebih daripada itu, walaupun diyat kecederaan itu lebih besar.  Oleh kerana tuan umm walad tidak boleh menyerahkannya kerana telah menjadi sunnah, maka apabila dia membayar harganya, ia seolah-olah dia telah menyerahkannya. Dia tidak perlu membayar lebih daripada itu. Inilah pendapat terbaik yang saya dengar tentang perkara ini. Tuan tidak wajib menanggung lebih daripada nilai umm walad disebabkan perbuatan jenayahnya.\""
  }
]