[
  {
    "id": 34179,
    "hadith_number": 1,
    "tajuk_hadith": "Waktu Solat Diajar oleh Jibril",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "قَالَ حَدَّثَنِي يَحْيَى بْنُ يَحْيَى اللَّيْثِيُّ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، أَخَّرَ الصَّلاَةَ يَوْمًا فَدَخَلَ عَلَيْهِ عُرْوَةُ بْنُ الزُّبَيْرِ فَأَخْبَرَهُ أَنَّ الْمُغِيرَةَ بْنَ شُعْبَةَ أَخَّرَ الصَّلاَةَ يَوْمًا وَهُوَ بِالْكُوفَةِ فَدَخَلَ عَلَيْهِ أَبُو مَسْعُودٍ الأَنْصَارِيُّ فَقَالَ مَا هَذَا يَا مُغِيرَةُ أَلَيْسَ قَدْ عَلِمْتَ أَنَّ جِبْرِيلَ نَزَلَ فَصَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ ‏\n\"‏ بِهَذَا أُمِرْتُ ‏\"‏ ‏.‏ فَقَالَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ اعْلَمْ مَا تُحَدِّثُ بِهِ يَا عُرْوَةُ أَوَ إِنَّ جِبْرِيلَ هُوَ الَّذِي أَقَامَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَقْتَ الصَّلاَةِ قَالَ عُرْوَةُ كَذَلِكَ كَانَ بَشِيرُ بْنُ أَبِي مَسْعُودٍ الأَنْصَارِيُّ يُحَدِّثُ عَنْ أَبِيهِ ‏.‏",
    "malay_translation": "Berkata Yahya bin Yahya al-Laythi telah menceritakan kepadaku, dari Malik bin Anas, dari Ibn Shihab, bahawa Umar bin Abd al-Aziz pernah melewatkan solat pada suatu hari. Urwa bin az-Zubayr masuk menemuinya lalu memberitahunya bahawa al-Mughira bin Shuba pernah melewatkan solat pada suatu hari ketika dia berada di Kufah, lalu Abu Masud al-Ansari masuk menemuinya dan berkata, 'Apakah ini, wahai Mughira? Tidakkah kamu tahu bahawa malaikat Jibril turun lalu solat, kemudian Rasulullah SAW solat. Kemudian dia solat lagi, lalu Rasulullah SAW solat. Kemudian dia solat lagi, lalu Rasulullah SAW solat. Kemudian dia solat lagi, lalu Rasulullah SAW solat. Kemudian dia solat lagi, lalu Rasulullah SAW solat. Kemudian Jibril berkata, 'Inilah yang telah diperintahkan kepadamu.' Umar bin Abd al-Aziz berkata, 'Pastikan apa yang kamu ceritakan, wahai Urwa. Adakah benar Jibril yang menetapkan waktu solat bagi Rasulullah?' Urwa berkata, 'Begitulah yang diceritakan oleh Bashir bin Abi Masud al-Ansari daripada ayahnya.'"
  },
  {
    "id": 34180,
    "hadith_number": 2,
    "tajuk_hadith": "Solat Asar Aisyah Ketika Matahari Masih Tinggi",
    "perawi_melayu": "Urwa",
    "english_text": "Urwa said that A'isha, the wife of the Prophet, may Allah bless\nhim and grant him peace used to pray asr while the sunlight was\npouring into her room, before the sun itself had become visible (i.e.\nbecause it was still high in the sky).",
    "arabic_text": "قَالَ عُرْوَةُ وَلَقَدْ حَدَّثَتْنِي عَائِشَةُ زَوْجُ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي الْعَصْرَ وَالشَّمْسُ فِي حُجْرَتِهَا قَبْلَ أَنْ تَظْهَرَ ‏.‏",
    "malay_translation": "Urwa berkata bahawa Aisyah, isteri Nabi ﷺ, pernah menunaikan solat Asar ketika cahaya matahari masih masuk ke dalam biliknya, sebelum matahari kelihatan (iaitu kerana ia masih tinggi di langit)."
  },
  {
    "id": 34181,
    "hadith_number": 3,
    "tajuk_hadith": "Waktu Solat Subuh",
    "perawi_melayu": "Ata' ibn Yasar",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّهُ قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَأَلَهُ عَنْ وَقْتِ صَلاَةِ الصُّبْحِ قَالَ فَسَكَتَ عَنْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى إِذَا كَانَ مِنَ الْغَدِ صَلَّى الصُّبْحَ حِينَ طَلَعَ الْفَجْرُ ثُمَّ صَلَّى الصُّبْحَ مِنَ الْغَدِ بَعْدَ أَنْ أَسْفَرَ ثُمَّ قَالَ ‏\"‏ أَيْنَ السَّائِلُ عَنْ وَقْتِ الصَّلاَةِ ‏\"‏ ‏.‏ قَالَ هَا أَنَا ذَا يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ ‏\"‏ مَا بَيْنَ هَذَيْنِ وَقْتٌ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Zayd ibn Aslam, daripada Ata' ibn Yasar, bahawa seorang lelaki datang kepada Rasulullah ﷺ dan bertanya tentang waktu solat Subuh. Rasulullah ﷺ berdiam diri daripadanya. Apabila keesokan harinya, baginda bersolat Subuh ketika terbit fajar, kemudian bersolat Subuh pada keesokan harinya selepas cerah. Kemudian baginda bersabda, \"Di manakah lelaki yang bertanya tentang waktu solat?\" Lelaki itu menjawab, \"Saya di sini, wahai Rasulullah.\" Baginda bersabda, \"Waktu (solat) adalah di antara kedua (waktu) ini.\""
  },
  {
    "id": 34182,
    "hadith_number": 4,
    "tajuk_hadith": "Solat Subuh dan Wanita dalam Kegelapan",
    "perawi_melayu": "A'ishah (Isteri Nabi)",
    "english_text": "The Messenger of Allah, may Allah bless him and grant him peace, used to pray subh and the women would leave wrapped in their garments and they could not yet be recognised in the darkness.",
    "arabic_text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ إِنْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيُصَلِّي الصُّبْحَ فَيَنْصَرِفُ النِّسَاءُ مُتَلَفِّعَاتٍ بِمُرُوطِهِنَّ مَا يُعْرَفْنَ مِنَ الْغَلَسِ ‏.‏",
    "malay_translation": "Rasulullah SAW pernah menunaikan solat Subuh, dan para wanita akan beredar dari tempat solat dengan menutup diri dengan pakaian mereka, sehingga mereka tidak dikenali kerana kegelapan."
  },
  {
    "id": 34183,
    "hadith_number": 5,
    "tajuk_hadith": "Sesiapa Yang Mendapati Satu Rakaat Solat Subuh atau Asar (dalam Waktunya)",
    "perawi_melayu": "Abu Hurairah رضي الله عنه",
    "english_text": "Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn\nYasar and from Busr ibn Said and from al-Araj-all of whom related it\nfrom Abu Hurayra - that the Messenger of Allah, may Allah bless him\nand grant him peace, said, \"Whoever manages to do a raka of subh\nbefore the sun has risen has done subh in time, and whoever manages to\ndo a raka of asr before the sun has set has done asr in time.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، وَعَنْ بُسْرِ بْنِ سَعِيدٍ، وَعَنِ الأَعْرَجِ، كُلُّهُمْ يُحَدِّثُونَهُ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ أَدْرَكَ رَكْعَةً مِنَ الصُّبْحِ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ فَقَدْ أَدْرَكَ الصُّبْحَ وَمَنْ أَدْرَكَ رَكْعَةً مِنَ الْعَصْرِ قَبْلَ أَنْ تَغْرُبَ الشَّمْسُ فَقَدْ أَدْرَكَ الْعَصْرَ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Zayd ibn Aslam, daripada Ata ibn Yasar dan daripada Busr ibn Said dan daripada al-A'raj - kesemuanya meriwayatkannya daripada Abu Hurairah رضي الله عنه, bahawa Rasulullah ﷺ bersabda: \"Sesiapa yang mendapati satu rakaat solat Subuh sebelum matahari terbit, maka sesungguhnya dia telah mendapati solat Subuh (pada waktunya), dan sesiapa yang mendapati satu rakaat solat Asar sebelum matahari terbenam, maka sesungguhnya dia telah mendapati solat Asar (pada waktunya).\""
  },
  {
    "id": 34184,
    "hadith_number": 6,
    "tajuk_hadith": "Kepentingan Solat dan Waktu-waktunya (Nasihat Umar ibn al-Khattab)",
    "perawi_melayu": "Malik dari Nafi', mawla Abdullah ibn Umar",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، مَوْلَى عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَتَبَ إِلَى عُمَّالِهِ إِنَّ أَهَمَّ أَمْرِكُمْ عِنْدِي الصَّلاَةُ فَمَنْ حَفِظَهَا وَحَافَظَ عَلَيْهَا حَفِظَ دِينَهُ وَمَنْ ضَيَّعَهَا فَهُوَ لِمَا سِوَاهَا أَضْيَعُ ‏.‏ ثُمَّ كَتَبَ أَنْ صَلُّوا الظُّهْرَ إِذَا كَانَ الْفَىْءُ ذِرَاعًا إِلَى أَنْ يَكُونَ ظِلُّ أَحَدِكُمْ مِثْلَهُ وَالْعَصْرَ وَالشَّمْسُ مُرْتَفِعَةٌ بَيْضَاءُ نَقِيَّةٌ قَدْرَ مَا يَسِيرُ الرَّاكِبُ فَرْسَخَيْنِ أَوْ ثَلاَثَةً قَبْلَ غُرُوبِ الشَّمْسِ وَالْمَغْرِبَ إِذَا غَرَبَتِ الشَّمْسُ وَالْعِشَاءَ إِذَا غَابَ الشَّفَقُ إِلَى ثُلُثِ اللَّيْلِ فَمَنْ نَامَ فَلاَ نَامَتْ عَيْنُهُ فَمَنْ نَامَ فَلاَ نَامَتْ عَيْنُهُ فَمَنْ نَامَ فَلاَ نَامَتْ عَيْنُهُ وَالصَّبْحَ وَالنُّجُومُ بَادِيَةٌ مُشْتَبِكَةٌ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Nafi', mawla Abdullah ibn Umar, bahawa Umar ibn al-Khattab menulis kepada para gabenurnya:\n\"Perkara yang paling penting dalam pandanganku adalah solat.\nSesiapa yang memeliharanya dan menjaganya dengan baik, maka dia memelihara agamanya,\nsedangkan sesiapa yang mengabaikannya, maka dia akan lebih mengabaikan perkara-perkara yang lain.\" Kemudian beliau menambah, \"Solat Zuhurlah apabila bayang-bayang (selepas waktu tengah hari) sepanjang lenganmu, sehingga panjang bayang-bayang seseorang itu menyamai ketinggiannya. Solat Asarlah ketika matahari masih putih bersih, sehingga seorang penunggang boleh berjalan sejauh dua atau tiga farsakh sebelum matahari terbenam. Solat Maghriblah apabila matahari telah terbenam. Solat Isyaklah apabila kemerahan di langit barat telah hilang sehingga sepertiga malam telah berlalu - dan orang yang tidur, semoga dia tidak mendapat rehat, orang yang tidur, semoga dia tidak mendapat rehat. Dan solat Subuhlah apabila semua bintang kelihatan jelas seperti kabut di langit.\""
  },
  {
    "id": 34185,
    "hadith_number": 7,
    "tajuk_hadith": "Waktu Solat Ditetapkan oleh Umar ibn al-Khattab",
    "perawi_melayu": "Daripada Abu Suhayl, daripada bapanya, bahawa Umar ibn al-Khattab",
    "english_text": "Yahya related to me from Malik, from his uncle Abu Suhayl from\nhis father that Umar ibn al-Khattab wrote to Abu Musa saying that he\nshould pray dhuhr when the sun had started to decline, asr when the\nsun was still pure white before any yellowness had entered it maghrib\nwhen the sun had set, and to delay isha as long as he did not sleep,\nand to pray subh when the stars were all visible and like a haze in\nthe sky and to read in it two long suras from the mufassal.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَمِّهِ أَبِي سُهَيْلٍ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَتَبَ إِلَى أَبِي مُوسَى أَنْ صَلِّ الظُّهْرَ، إِذَا زَاغَتِ الشَّمْسُ وَالْعَصْرَ وَالشَّمْسُ بَيْضَاءُ نَقِيَّةٌ قَبْلَ أَنْ يَدْخُلَهَا صُفْرَةٌ وَالْمَغْرِبَ إِذَا غَرَبَتِ الشَّمْسُ وَأَخِّرِ الْعِشَاءَ مَا لَمْ تَنَمْ وَصَلِّ الصُّبْحَ وَالنُّجُومُ بَادِيَةٌ مُشْتَبِكَةٌ وَاقْرَأْ فِيهَا بِسُورَتَيْنِ طَوِيلَتَيْنِ مِنَ الْمُفَصَّلِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada bapa saudaranya Abu Suhayl, daripada bapanya bahawa Umar ibn al-Khattab menulis kepada Abu Musa, katanya: \"Hendaklah kamu solat Zuhur apabila matahari telah mulai tergelincir, Asar ketika matahari masih putih bersih sebelum memasuki kekuningan, Maghrib apabila matahari telah terbenam, dan tangguhkan Isyak selama mana kamu belum tidur, dan solat Subuh ketika bintang-bintang jelas kelihatan seperti kabut di langit, dan bacalah di dalamnya dua surah yang panjang daripada al-Mufassal.\""
  },
  {
    "id": 34186,
    "hadith_number": 8,
    "tajuk_hadith": "Waktu Solat Asar dan Isyak: Arahan Umar kepada Abu Musa Al-Ash'ari",
    "perawi_melayu": "Malik, daripada Hisham ibn Urwa, daripada bapanya",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that Umar ibn al-Khattab wrote to Abu Musa al-Ashari that he\nshould pray asr when the sun was still pure white so that a man could\nride three farsakhs (before maghrib) and that he should pray Isha\nduring the first third of the night, or, if he delayed it, then up\nuntil the middle of the night, and he warned him not to be forgetful.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَتَبَ إِلَى أَبِي مُوسَى الأَشْعَرِيِّ أَنْ صَلِّ الْعَصْرَ، وَالشَّمْسُ، بَيْضَاءُ نَقِيَّةٌ قَدْرَ مَا يَسِيرُ الرَّاكِبُ ثَلاَثَةَ فَرَاسِخَ وَأَنْ صَلِّ الْعِشَاءَ مَا بَيْنَكَ وَبَيْنَ ثُلُثِ اللَّيْلِ فَإِنْ أَخَّرْتَ فَإِلَى شَطْرِ اللَّيْلِ وَلاَ تَكُنْ مِنَ الْغَافِلِينَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Hisham bin Urwa, daripada bapanya, bahawa Umar bin al-Khattab menulis kepada Abu Musa al-Ash'ari: \"Hendaklah kamu menunaikan solat Asar ketika matahari masih putih bersih (belum terbenam) sehingga seseorang boleh menunggang (kuda atau kenderaan) sejauh tiga farsakh (sebelum Maghrib). Hendaklah kamu menunaikan solat Isyak pada awal sepertiga malam, atau, jika kamu melambatkannya, maka sehingga pertengahan malam. Dan janganlah kamu menjadi orang yang lalai.\""
  },
  {
    "id": 34187,
    "hadith_number": 9,
    "tajuk_hadith": "Waktu Solat Menurut Abu Hurairah",
    "perawi_melayu": "Yazid bin Ziyad",
    "english_text": "Yahya related to me from Malik from Yazid ibn Ziyad that Abdullah\nibn Rafi, the mawla of Umm Salama, the wife of the Prophet, may Allah\nbless him and grant him peace, asked Abu Hurayra about the time of the\nprayer. Abu Hurayra said, \"Let me tell you. Pray dhuhr when the length\nof your shadow matches your height, asr when your shadow is twice your\nheight, maghrib when the sun has set, isha in the first third of the\nnight, and subh in the very first light of dawn,\" i.e. when the dawn\nhas definitely come.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ زِيَادٍ، عَنْ عَبْدِ اللَّهِ بْنِ رَافِعٍ، مَوْلَى أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ سَأَلَ أَبَا هُرَيْرَةَ عَنْ وَقْتِ الصَّلاَةِ فَقَالَ أَبُو هُرَيْرَةَ أَنَا أُخْبِرُكَ صَلِّ الظُّهْرَ إِذَا كَانَ ظِلُّكَ مِثْلَكَ وَالْعَصْرَ إِذَا كَانَ ظِلُّكَ مِثْلَيْكَ وَالْمَغْرِبَ إِذَا غَرَبَتِ الشَّمْسُ وَالْعِشَاءَ مَا بَيْنَكَ وَبَيْنَ ثُلُثِ اللَّيْلِ وَصَلِّ الصُّبْحَ بِغَبَشٍ ‏.‏ يَعْنِي الْغَلَسَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Yazid bin Ziyad bahawa Abdullah bin Rafi', mawla kepada Umm Salama, isteri Nabi ﷺ, bertanya kepada Abu Hurairah tentang waktu solat. Abu Hurairah berkata, \"Saya akan beritahu kamu. Solat Zuhur apabila panjang bayang-bayang kamu sama dengan ketinggian kamu, Asar apabila bayang-bayang kamu dua kali ganda ketinggian kamu, Maghrib apabila matahari telah terbenam, Isyak pada sepertiga pertama malam, dan Subuh pada cahaya fajar yang pertama,\" iaitu apabila fajar telah jelas terbit."
  },
  {
    "id": 34188,
    "hadith_number": 10,
    "tajuk_hadith": "Keutamaan Solat Asar (Diriwayatkan oleh Anas bin Malik)",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "Yahya related to me from Malik from Ishaq ibn Abdullah ibn Abi\nTalha that Anas ibn Malik said, \"We would pray asr and anyone who then\nwent to the Bani Amr ibn Awf would find them praying asr.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ كُنَّا نُصَلِّي الْعَصْرَ ثُمَّ يَخْرُجُ الإِنْسَانُ إِلَى بَنِي عَمْرِو بْنِ عَوْفٍ فَيَجِدُهُمْ يُصَلُّونَ الْعَصْرَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Ishaq bin Abdullah bin Abi Talha bahawa Anas bin Malik berkata, \"Kami menunaikan solat Asar dan sesiapa yang pergi ke Bani Amr ibn Awf selepas itu akan mendapati mereka sedang menunaikan solat Asar.\""
  },
  {
    "id": 34189,
    "hadith_number": 11,
    "tajuk_hadith": "Waktu Solat Asar dan Perjalanan ke Quba",
    "perawi_melayu": "Ibn Shihab meriwayatkan daripada Anas ibn Malik",
    "english_text": "Yahya related to me from Malik from Ibn Shihab that Anas ibn\nMalik said, \"We would pray asr and anyone who then went to Quba would\narrive there while the sun was still high.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ كُنَّا نُصَلِّي الْعَصْرَ ثُمَّ يَذْهَبُ الذَّاهِبُ إِلَى قُبَاءٍ فَيَأْتِيهِمْ وَالشَّمْسُ مُرْتَفِعَةٌ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Ibn Shihab bahawa Anas ibn Malik berkata, \"Kami solat Asar dan sesiapa yang pergi ke Quba selepas itu akan sampai ke sana sementara matahari masih tinggi.\""
  },
  {
    "id": 34190,
    "hadith_number": 12,
    "tajuk_hadith": "Sahabat Mendirikan Solat Zohor Selepas Tengah Hari",
    "perawi_melayu": "Rabia ibn Abi Abd ar-Rahman, daripada al-Qasim ibn Muhammad",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُ قَالَ مَا أَدْرَكْتُ النَّاسَ إِلاَّ وَهُمْ يُصَلُّونَ الظُّهْرَ بِعَشِيٍّ ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku daripada Malik, daripada Rabia ibn Abi Abd ar-Rahman, daripada al-Qasim ibn Muhammad, bahawa dia berkata: \"Aku tidak pernah bertemu dengan orang ramai melainkan mereka menunaikan solat Zohor selepas (waktu) tengah hari.\" (Maksudnya: Selepas matahari hilang teriknya)."
  },
  {
    "id": 34191,
    "hadith_number": 13,
    "tajuk_hadith": "Waktu Solat Jumaat di Zaman Umar ibn al-Khattab",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari bapa saudaranya Abu Suhayl ibn Malik, bahawa bapanya berkata",
    "english_text": "Yahya related to me from Malik from his uncle Abu Suhayl ibn\nMalik that his father said, \"I used to see a carpet belonging to Aqil\nibn Abi Talib spread out on the day of jumua up to the west wall of\nthe mosque. When the shadow of the wall covered the whole carpet, Umar\nibn al-Khattab would come out and pray the jumua prayer.\"\n\n\nMalik, Abu Suhayl's father, added, \"We would then return after the\njumua prayer and take our midday sleep.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَمِّهِ أَبِي سُهَيْلِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، أَنَّهُ قَالَ كُنْتُ أَرَى طِنْفِسَةً لِعَقِيلِ بْنِ أَبِي طَالِبٍ يَوْمَ الْجُمُعَةِ تُطْرَحُ إِلَى جِدَارِ الْمَسْجِدِ الْغَرْبِيِّ فَإِذَا غَشِيَ الطِّنْفِسَةَ كُلَّهَا ظِلُّ الْجِدَارِ خَرَجَ عُمَرُ بْنُ الْخَطَّابِ وَصَلَّى الْجُمُعَةَ - قَالَ مَالِكٌ وَالِدُ أَبِي سُهَيْلٍ - ثُمَّ نَرْجِعُ بَعْدَ صَلاَةِ الْجُمُعَةِ فَنَقِيلُ قَائِلَةَ الضَّحَاءِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada bapa saudaranya Abu Suhayl ibn Malik, bahawa bapanya berkata, \"Aku melihat permaidani kepunyaan Aqil ibn Abi Talib dibentangkan pada hari Jumaat sehingga ke dinding barat masjid. Apabila bayang-bayang dinding menutupi seluruh permaidani, Umar ibn al-Khattab akan keluar dan menunaikan solat Jumaat.\"\n\nMalik, ayah Abu Suhayl, menambah, \"Kami kemudian akan pulang selepas solat Jumaat dan tidur tengah hari.\""
  },
  {
    "id": 34192,
    "hadith_number": 14,
    "tajuk_hadith": "Solat Jumaat dan Asar oleh Uthman di Madinah dan Malal",
    "perawi_melayu": "Ibnu Abi Salit",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ، عَنِ ابْنِ أَبِي سَلِيطٍ، أَنَّ عُثْمَانَ بْنَ عَفَّانَ، صَلَّى الْجُمُعَةَ بِالْمَدِينَةِ وَصَلَّى الْعَصْرَ بِمَلَلٍ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ لِلتَّهْجِيرِ وَسُرْعَةِ السَّيْرِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik, daripada Amr ibn Yahya ibn Yahya al-Mazini, daripada Ibn Abi Salit bahawa Uthman ibn Affan solat Jumaat di Madinah dan Asar di Malal (tempat yang terletak tujuh belas batu dari Madinah).\n\nMalik mengulas, \"Itu adalah dengan solat Jumaat selepas tengah hari dan kemudian bergerak dengan cepat.\""
  },
  {
    "id": 34193,
    "hadith_number": 15,
    "tajuk_hadith": "Sesiapa yang Mendapati Satu Rakaat Solat, Maka Dia Mendapati Solat",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Abu Salama\nibn Abdar-Rahman from Abu Hurayra that the Messenger of Allah, may\nAllah bless him and grant him peace, said \"Whoever catches a raka of\nthe prayer has caught the prayer.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ أَدْرَكَ رَكْعَةً مِنَ الصَّلاَةِ فَقَدْ أَدْرَكَ الصَّلاَةَ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik, daripada Ibn Shihab, daripada Abu Salama bin Abdar-Rahman, daripada Abu Hurairah bahawa Rasulullah SAW bersabda: \"Sesiapa yang mendapati satu rakaat daripada solat, maka sesungguhnya dia telah mendapati solat.\""
  },
  {
    "id": 34194,
    "hadith_number": 16,
    "tajuk_hadith": "Hukum Terlepas Rukuk, Terlepaslah Sujud",
    "perawi_melayu": "Nafi dari Abdullah ibn Umar ibn al-Khattab",
    "english_text": "If the ruku has passed you by, so has the sajda.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ بْنِ الْخَطَّابِ، كَانَ يَقُولُ إِذَا فَاتَتْكَ الرَّكْعَةُ فَقَدْ فَاتَتْكَ السَّجْدَةُ ‏.‏",
    "malay_translation": "Abdullah ibn Umar ibn al-Khattab berkata: \"Jika rukuk telah terlepas dari kamu, maka sesungguhnya sujud juga terlepas.\""
  },
  {
    "id": 34195,
    "hadith_number": 17,
    "tajuk_hadith": "Sesiapa Yang Mendapati Rakaat, Maka Dia Mendapati Sujud",
    "perawi_melayu": "Abdullah ibn Umar dan Zayd ibn Thabit",
    "english_text": "Yahya related to me from Malik that he had heard that Abdullah\nibn Umar and Zayd ibn Thabit used to say, \"Whoever catches the raka`ah\nhas caught the sajda.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، وَزَيْدَ بْنَ ثَابِتٍ، كَانَا يَقُولاَنِ مَنْ أَدْرَكَ الرَّكْعَةَ فَقَدْ أَدْرَكَ السَّجْدَةَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik bahawa dia mendengar bahawa Abdullah ibn Umar dan Zayd ibn Thabit pernah berkata, \"Sesiapa yang mendapati rakaat, maka dia mendapati sujud.\""
  },
  {
    "id": 34196,
    "hadith_number": 18,
    "tajuk_hadith": "Kepentingan Mendapati Ruku' dan Membaca Umm al-Qur'an",
    "perawi_melayu": "Abu Hurairah (RA)",
    "english_text": "Yahya related to me from Malik that he had heard that Abu Hurayra\nused to say, \"Whoever catches the ruku has caught the sajda and\nwhoever misses the recitation of the umm al-Qur'an has missed much\ngood.\"",
    "arabic_text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ أَبَا هُرَيْرَةَ، كَانَ يَقُولُ مَنْ أَدْرَكَ الرَّكْعَةَ فَقَدْ أَدْرَكَ السَّجْدَةَ وَمَنْ فَاتَهُ قِرَاءَةُ أُمِّ الْقُرْآنِ فَقَدْ فَاتَهُ خَيْرٌ كَثِيرٌ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa dia mendengar bahawa Abu Hurairah (RA) berkata, \"Sesiapa yang mendapati ruku' (dalam solat), maka dia telah mendapati sujud (satu rakaat). Dan sesiapa yang terlepas bacaan Umm al-Qur'an (Surah Al-Fatihah), maka dia telah terlepas banyak kebaikan.\""
  },
  {
    "id": 34197,
    "hadith_number": 19,
    "tajuk_hadith": "Waktu Duluk Ash-Shams Menurut Abdullah bin Umar",
    "perawi_melayu": "Malik dari Nafi'",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ دُلُوكُ الشَّمْسِ مَيْلُهَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik daripada Nafi' bahawa Abdullah bin Umar berkata, \"Duluk ash-shams bermula apabila matahari melepasi meridian.\""
  },
  {
    "id": 34198,
    "hadith_number": 20,
    "tajuk_hadith": "Makna 'Duluk ash-Shams' dan 'Ghasaq al-Layl' Menurut Ibnu Abbas",
    "perawi_melayu": "Da'ud ibn al-Husayn, dari Abdullah ibn Abbas",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، قَالَ أَخْبَرَنِي مُخْبِرٌ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، كَانَ يَقُولُ دُلُوكُ الشَّمْسِ إِذَا فَاءَ الْفَىْءُ وَغَسَقُ اللَّيْلِ اجْتِمَاعُ اللَّيْلِ وَظُلْمَتُهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa Da'ud ibn al-Husayn berkata bahawa seseorang telah memberitahunya bahawa Abdullah ibn Abbas biasa berkata, \"Duluk ash-shams bermula apabila matahari melewati meridian. Ghasaq al-layl adalah perhimpunan malam dan kegelapannya.\""
  },
  {
    "id": 34199,
    "hadith_number": 21,
    "tajuk_hadith": "Kehilangan Solat Asar: Satu Musibah Besar",
    "perawi_melayu": "Abdullah ibn Umar (Melalui Nafi' dan Malik)",
    "english_text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"If someone misses the asr prayer it is as if he has suffered a\ngreat misfortune in his family and wealth .\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الَّذِي تَفُوتُهُ صَلاَةُ الْعَصْرِ كَأَنَّمَا وُتِرَ أَهْلَهُ وَمَالَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik, daripada Nafi', daripada Abdullah ibn Umar, bahawa Rasulullah ﷺ bersabda, \"Sesiapa yang terlepas solat Asar, seolah-olah dia ditimpa musibah besar pada keluarga dan hartanya.\""
  },
  {
    "id": 34200,
    "hadith_number": 22,
    "tajuk_hadith": "Umar ibn al-Khattab dan Solat Asar yang Tertinggal",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، انْصَرَفَ مِنْ صَلاَةِ الْعَصْرِ فَلَقِيَ رَجُلاً لَمْ يَشْهَدِ الْعَصْرَ فَقَالَ عُمَرُ مَا حَبَسَكَ عَنْ صَلاَةِ الْعَصْرِ فَذَكَرَ لَهُ الرَّجُلُ عُذْرًا فَقَالَ عُمَرُ طَفَّفْتَ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَيُقَالُ لِكُلِّ شَىْءٍ وَفَاءٌ وَتَطْفِيفٌ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya ibn Said, bahawa Umar ibn al-Khattab selesai daripada solat Asar dan bertemu dengan seorang lelaki yang tidak hadir solat Asar. Umar bertanya kepadanya, “Apa yang menghalangmu daripada solat Asar?” Lelaki itu memberi alasan. Umar berkata, “Kamu telah mengurangkan (hak).” Yahya menambah bahawa Malik berkata, “Dikatakan bahawa setiap sesuatu ada sukatan yang sempurna dan ada yang kurang.”"
  },
  {
    "id": 34201,
    "hadith_number": 23,
    "tajuk_hadith": "Keutamaan Solat Tepat pada Waktunya dan Qada' Solat",
    "perawi_melayu": "Yahya",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ كَانَ يَقُولُ إِنَّ الْمُصَلِّيَ لَيُصَلِّي الصَّلاَةَ وَمَا فَاتَهُ وَقْتُهَا وَلَمَا فَاتَهُ مِنْ وَقْتِهَا أَعْظَمُ - أَوْ أَفْضَلُ - مِنْ أَهْلِهِ وَمَالِهِ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ مَنْ أَدْرَكَ الْوَقْتَ وَهُوَ فِي سَفَرٍ فَأَخَّرَ الصَّلاَةَ سَاهِيًا أَوْ نَاسِيًا حَتَّى قَدِمَ عَلَى أَهْلِهِ أَنَّهُ إِنْ كَانَ قَدِمَ عَلَى أَهْلِهِ وَهُوَ فِي الْوَقْتِ فَلْيُصَلِّ صَلاَةَ الْمُقِيمِ وَإِنْ كَانَ قَدْ قَدِمَ وَقَدْ ذَهَبَ الْوَقْتُ فَلْيُصَلِّ صَلاَةَ الْمُسَافِرِ لأَنَّهُ إِنَّمَا يَقْضِي مِثْلَ الَّذِي كَانَ عَلَيْهِ ‏.‏ قَالَ مَالِكٌ وَهَذَا الأَمْرُ هُوَ الَّذِي أَدْرَكْتُ عَلَيْهِ النَّاسَ وَأَهْلَ الْعِلْمِ بِبَلَدِنَا ‏.‏ وَقَالَ مَالِكٌ الشَّفَقُ الْحُمْرَةُ الَّتِي فِي الْمَغْرِبِ فَإِذَا ذَهَبَتِ الْحُمْرَةُ فَقَدْ وَجَبَتْ صَلاَةُ الْعِشَاءِ وَخَرَجْتَ مِنْ وَقْتِ الْمَغْرِبِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa Yahya bin Said pernah berkata,\n\"Sesungguhnya seseorang yang solat sebelum waktu solat itu berlalu, waktu yang telah terlepas daripadanya adalah lebih penting, atau lebih baik, daripada keluarga dan hartanya.\"\n\nYahya berkata bahawa Malik berkata, \"Jika waktu solat telah masuk dan seorang musafir melewatkan solatnya kerana lalai atau terlupa sehingga dia sampai kepada keluarganya, maka dia hendaklah menunaikan solat secara sempurna jika dia tiba dalam waktu tersebut. Tetapi jika dia tiba setelah waktu solat berlalu, maka hendaklah dia menunaikan solat musafir. Dengan cara itu, dia hanya membayar hutangnya.\"\n\nMalik berkata, \"Inilah yang saya dapati orang ramai dan ahli ilmu melakukan dalam masyarakat kami.\"\nMalik menjelaskan bahawa *shafaq* adalah kemerahan di langit setelah matahari terbenam, dan berkata, \"Apabila kemerahan itu telah hilang, maka solat Isyak telah masuk dan anda telah keluar dari waktu Maghrib.\""
  },
  {
    "id": 34202,
    "hadith_number": 24,
    "tajuk_hadith": "Abdullah bin Umar Pengsan dan Tidak Mengqada Solat",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Nafi that one time Abdullah\nibn Umar fainted and lost his senses and he did not make up the\nprayer.\n\n\nMalik commented, \"We consider that that was because,\nand Allah knows best, the time had passed. Someone who recovers within\nthe time has to pray.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، أُغْمِيَ عَلَيْهِ فَذَهَبَ عَقْلُهُ فَلَمْ يَقْضِ الصَّلاَةَ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ فِيمَا نَرَى - وَاللَّهُ أَعْلَمُ - أَنَّ الْوَقْتَ قَدْ ذَهَبَ فَأَمَّا مَنْ أَفَاقَ فِي الْوَقْتِ فَإِنَّهُ يُصَلِّي ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Nafi', bahawa pada suatu ketika Abdullah bin Umar pengsan dan hilang akalnya, lalu dia tidak mengqada solatnya.\n\nMalik memberi komen, “Kami berpendapat bahawa hal itu kerana, dan Allah Maha Mengetahui, waktu solat telah berlalu. Sesiapa yang sedar dalam waktu solat, maka dia wajib solat.”"
  },
  {
    "id": 34203,
    "hadith_number": 25,
    "tajuk_hadith": "Kisah Tertinggal Solat Subuh Kerana Tidur",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Said ibn al-Musayyab that the Messenger of Allah, may Allah bless him and grant him peace, travelled by night on the way back from Khaybar.Towards the end of the night he stopped for a rest and told Bilal to stay awake to keep watch for the subh prayer. The Messenger of Allah, may Allah bless him and grant him peace, and his companions slept. Bilal stayed on guard as long as was decreed for him and then he leant against his riding camel facing the direction of the dawn and sleep overcame him and neither he nor the Messenger of Allah nor any of the party woke up until the sun's rays had struck them. The Messenger of Allah, may Allah bless him and grant him peace, was alarmed. Bilal excused himself, saying, \"Messenger of Allah! The One who took your self was the One who took myself. \"The Messenger of Allah, may Allah bless him and grant him peace, ordered the party to move on and so they roused thei r mounts and rode on a short distance. The Messenger of Allah, may Allah bless him and grant him peace, ordered Bilal to give the iqama and then led them in the subh prayer. When he had finished he said, \"Anyone who forgets a prayer should pray it when he remembers. Allah theBlessed and Exalted says in His book, 'Establish the prayer to remember Me.'\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حِينَ قَفَلَ مِنْ خَيْبَرَ أَسْرَى حَتَّى إِذَا كَانَ مِنْ آخِرِ اللَّيْلِ عَرَّسَ وَقَالَ لِبِلاَلٍ ‏\"‏ اكْلأْلَنَا الصُّبْحَ ‏\"‏ ‏.‏ وَنَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَصْحَابُهُ وَكَلأَ بِلاَلٌ مَا قُدِّرَ لَهُ ثُمَّ اسْتَنَدَ إِلَى رَاحِلَتِهِ وَهُوَ مُقَابِلُ الْفَجْرِ فَغَلَبَتْهُ عَيْنَاهُ فَلَمْ يَسْتَيْقِظْ رَسُولُ اللَّهِ صلى الله عليه وسلم وَلاَ بِلاَلٌ وَلاَ أَحَدٌ مِنَ الرَّكْبِ حَتَّى ضَرَبَتْهُمُ الشَّمْسُ فَفَزِعَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ بِلاَلٌ يَا رَسُولَ اللَّهِ أَخَذَ بِنَفْسِي الَّذِي أَخَذَ بِنَفْسِكَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اقْتَادُوا ‏\"‏ ‏.‏ فَبَعَثُوا رَوَاحِلَهُمْ وَاقْتَادُوا شَيْئًا ثُمَّ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِلاَلاً فَأَقَامَ الصَّلاَةَ فَصَلَّى بِهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم الصُّبْحَ ثُمَّ قَالَ حِينَ قَضَى الصَّلاَةَ ‏\"‏ مَنْ نَسِيَ الصَّلاَةَ فَلْيُصَلِّهَا إِذَا ذَكَرَهَا فَإِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقُولُ فِي كِتَابِهِ ‏{‏أَقِمِ الصَّلاَةَ لِذِكْرِي ‏}‏ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Said bin al-Musayyab bahawa Rasulullah SAW ketika kembali dari Khaybar, berjalan pada waktu malam. Apabila tiba di penghujung malam, Baginda berhenti untuk berehat dan menyuruh Bilal supaya berjaga untuk menjaga solat subuh. Rasulullah SAW dan para sahabat baginda tidur. Bilal berjaga sebagaimana yang telah ditetapkan untuknya, kemudian dia bersandar pada untanya yang menghadap ke arah fajar, lalu dia tertidur. Tidak bangun Rasulullah SAW, tidak juga Bilal, dan tidak juga sesiapa pun daripada rombongan itu sehingga pancaran matahari mengenai mereka. Rasulullah SAW merasa terkejut. Bilal meminta maaf dengan berkata, “Wahai Rasulullah! Zat yang mengambil nyawa tuan adalah Zat yang mengambil nyawa saya.” Rasulullah SAW menyuruh rombongan itu meneruskan perjalanan, lalu mereka membangunkan tunggangan mereka dan menunggang sejauh jarak yang pendek. Rasulullah SAW menyuruh Bilal melaungkan iqamah, kemudian Baginda memimpin mereka menunaikan solat subuh. Setelah selesai, Baginda bersabda, “Sesiapa yang terlupa solat, hendaklah dia menunaikannya apabila dia teringat. Allah SWT berfirman dalam kitab-Nya, ‘Dirikanlah solat untuk mengingati-Ku.’”"
  },
  {
    "id": 34204,
    "hadith_number": 26,
    "tajuk_hadith": "Tidur Lewat Solat dan Syaitan",
    "perawi_melayu": "Zayd ibn Aslam",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّهُ قَالَ عَرَّسَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيْلَةً بِطَرِيقِ مَكَّةَ وَوَكَّلَ بِلاَلاً أَنْ يُوقِظَهُمْ لِلصَّلاَةِ فَرَقَدَ بِلاَلٌ وَرَقَدُوا حَتَّى اسْتَيْقَظُوا وَقَدْ طَلَعَتْ عَلَيْهِمُ الشَّمْسُ فَاسْتَيْقَظَ الْقَوْمُ وَقَدْ فَزِعُوا فَأَمَرَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَرْكَبُوا حَتَّى يَخْرُجُوا مِنْ ذَلِكَ الْوَادِي وَقَالَ ‏\"‏ إِنَّ هَذَا وَادٍ بِهِ شَيْطَانٌ ‏\"‏ ‏.‏ فَرَكِبُوا حَتَّى خَرَجُوا مِنْ ذَلِكَ الْوَادِي ثُمَّ أَمَرَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَنْزِلُوا وَأَنْ يَتَوَضَّئُوا وَأَمَرَ بِلاَلاً أَنْ يُنَادِيَ بِالصَّلاَةِ أَوْ يُقِيمَ فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم بِالنَّاسِ ثُمَّ انْصَرَفَ إِلَيْهِمْ وَقَدْ رَأَى مِنْ فَزَعِهِمْ فَقَالَ ‏\"‏ يَا أَيُّهَا النَّاسُ إِنَّ اللَّهَ قَبَضَ أَرْوَاحَنَا وَلَوْ شَاءَ لَرَدَّهَا إِلَيْنَا فِي حِينٍ غَيْرِ هَذَا فَإِذَا رَقَدَ أَحَدُكُمْ عَنِ الصَّلاَةِ أَوْ نَسِيَهَا ثُمَّ فَزِعَ إِلَيْهَا فَلْيُصَلِّهَا كَمَا كَانَ يُصَلِّيهَا فِي وَقْتِهَا ‏\"‏ ‏.‏ ثُمَّ الْتَفَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى أَبِي بَكْرٍ فَقَالَ ‏\"‏ إِنَّ الشَّيْطَانَ أَتَى بِلاَلاً وَهُوَ قَائِمٌ يُصَلِّي فَأَضْجَعَهُ فَلَمْ يَزَلْ يُهَدِّئُهُ كَمَا يُهَدَّأُ الصَّبِيُّ حَتَّى نَامَ ‏\"‏ ‏.‏ ثُمَّ دَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِلاَلاً فَأَخْبَرَ بِلاَلٌ رَسُولَ اللَّهِ صلى الله عليه وسلم مِثْلَ الَّذِي أَخْبَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَبَا بَكْرٍ فَقَالَ أَبُو بَكْرٍ أَشْهَدُ أَنَّكَ رَسُولُ اللَّهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Zayd ibn Aslam bahawa dia berkata, \"Rasulullah SAW berhenti untuk berehat pada suatu malam dalam perjalanan ke Mekah dan melantik Bilal untuk mengejutkan mereka untuk solat. Bilal tidur dan semua orang tidur dan tiada seorang pun daripada mereka bangun sehingga matahari terbit. Apabila mereka bangun, mereka semua terkejut. Rasulullah SAW memerintahkan mereka keluar dari lembah itu, dengan berkata bahawa ada syaitan di dalamnya. Lalu mereka keluar dari lembah itu dan Rasulullah SAW memerintahkan mereka turun dan berwuduk dan Baginda menyuruh Bilal sama ada melaungkan azan atau iqamah. Rasulullah SAW kemudian memimpin solat bersama mereka. Memperhatikan kegelisahan mereka, Baginda pergi kepada mereka dan berkata, 'Wahai manusia! Allah telah mengambil roh kita (arwah) dan jika Dia menghendaki, Dia akan mengembalikannya kepada kita pada waktu selain ini. Oleh itu, jika kamu terlepas waktu solat atau terlupa dan kemudian berasa bimbang tentangnya, solatlah ia seperti kamu solat pada waktunya.' Rasulullah SAW berpaling kepada Abu Bakr dan berkata, 'Syaitan datang kepada Bilal ketika dia sedang berdiri dalam solat dan membuatnya berbaring dan membuainya sehingga tertidur seperti seorang budak kecil.' Rasulullah SAW kemudian memanggil Bilal dan memberitahunya perkara yang sama seperti yang Baginda beritahu kepada Abu Bakr. Abu Bakr berkata, 'Aku bersaksi bahawa engkau adalah Rasulullah.'\""
  },
  {
    "id": 34205,
    "hadith_number": 27,
    "tajuk_hadith": "Panas Terik dari Neraka: Tunda Solat Ketika Cuaca Panas",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Zayd ibn Aslam daripada Ata ibn Yasar.",
    "english_text": "Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn\nYasar that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Scorching heat is a part of the blast of Jahannam. So,\nwhen the heat is fierce, delay the prayer until it gets cooler.\"\n\n\nHe added in explanation, \"The Fire complained to its Lord and\nsaid, 'My Lord, part of me has eaten another part,' so He allowed it\ntwo breaths in every year, a breath in winter and a breath in summer.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ فَإِذَا اشْتَدَّ الْحَرُّ فَأَبْرِدُوا عَنِ الصَّلاَةِ ‏\"‏ ‏.‏ \n وَقَالَ ‏\"‏ اشْتَكَتِ النَّارُ إِلَى رَبِّهَا فَقَالَتْ يَا رَبِّ أَكَلَ بَعْضِي بَعْضًا ‏.‏ فَأَذِنَ لَهَا بِنَفَسَيْنِ فِي كُلِّ عَامٍ نَفَسٍ فِي الشِّتَاءِ وَنَفَسٍ فِي الصَّيْفِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Zayd ibn Aslam daripada Ata ibn Yasar bahawa Rasulullah SAW bersabda, \"Sesungguhnya kepanasan yang terik adalah daripada tiupan Jahannam. Oleh itu, apabila kepanasan itu melampau, sejuklah daripada solat (tundalah solat sehingga cuaca menjadi lebih sejuk).\n\nBaginda bersabda lagi, \"Api mengadu kepada Tuhannya dan berkata, 'Wahai Tuhanku, sebahagian daripadaku telah memakan sebahagian yang lain.' Lalu Allah mengizinkannya dua kali hembusan nafas setiap tahun, satu hembusan pada musim sejuk dan satu hembusan pada musim panas.\""
  },
  {
    "id": 34206,
    "hadith_number": 28,
    "tajuk_hadith": "Menangguhkan Solat Ketika Cuaca Panas",
    "perawi_melayu": "Abu Hurairah رضي الله عنه",
    "english_text": "Malik related to us from Abdullah ibn Yazid the mawla of al-Aswad\nibn Sufyan, from Abu Salama ibn Abd ar-Rahman from Muhammad ibn Abd\nar-Rahman ibn Thawban from Abu Hurayra that the Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"When the heat is\nfierce delay the prayer until it gets cooler, for scorching heat is a\npart of the blast of Jahannam.\"\n\n\nHe added, \"The Fire\ncomplained to its Lord, so He allowed it two breaths in each year, a\nbreath in winter and a breath in summer.\"",
    "arabic_text": "وَحَدَّثَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، مَوْلَى الأَسْوَدِ بْنِ سُفْيَانَ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، وَعَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا اشْتَدَّ الْحَرُّ فَأَبْرِدُوا عَنِ الصَّلاَةِ فَإِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ ‏\"‏ ‏.‏ وَذَكَرَ ‏\"‏ أَنَّ النَّارَ اشْتَكَتْ إِلَى رَبِّهَا فَأَذِنَ لَهَا فِي كُلِّ عَامٍ بِنَفَسَيْنِ نَفَسٍ فِي الشِّتَاءِ وَنَفَسٍ فِي الصَّيْفِ ‏\"‏ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Abdullah bin Yazid, maula al-Aswad bin Sufyan, daripada Abu Salamah bin Abd ar-Rahman, daripada Muhammad bin Abd ar-Rahman bin Thawban, daripada Abu Hurairah رضي الله عنه bahawa Rasulullah صلى الله عليه وسلم bersabda: \"Apabila cuaca sangat panas, tangguhkanlah solat sehingga menjadi lebih sejuk. Sesungguhnya kepanasan yang terik itu adalah daripada hembusan neraka Jahannam.\" Kemudian baginda bersabda: \"Api (neraka) mengadu kepada Tuhannya, lalu Dia mengizinkannya dua kali hembusan dalam setiap tahun, satu hembusan pada musim sejuk dan satu hembusan pada musim panas.\""
  },
  {
    "id": 34207,
    "hadith_number": 29,
    "tajuk_hadith": "Menangguhkan Solat Ketika Cuaca Terik",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "Yahya related to me from Malik from Abu'z Zinad from al-Araj from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"When the heat is fierce, wait until it gets cooler before you do the prayer, for scorching heat is from the blast of Jahannam.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا اشْتَدَّ الْحَرُّ فَأَبْرِدُوا عَنِ الصَّلاَةِ فَإِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Abu'z Zinad, daripada al-Araj, daripada Abu Hurairah bahawa Rasulullah SAW bersabda, \"Apabila cuaca sangat panas, tangguhkanlah solat sehingga cuaca menjadi lebih sejuk, kerana kepanasan yang terik itu adalah daripada tiupan Jahannam.\""
  },
  {
    "id": 34208,
    "hadith_number": 30,
    "tajuk_hadith": "Larangan Mendekati Masjid Selepas Memakan Bawang Putih",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Said ibn al-Musayyab",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Said ibn al-\nMusayyab that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Anyone who eats this plant should not come near our\nmosques. The smell of the garlic will offend us.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ فَلاَ يَقْرُبْ مَسَاجِدَنَا يُؤْذِينَا بِرِيحِ الثُّومِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Said ibn al-Musayyab bahawa Rasulullah SAW bersabda: \"Sesiapa yang makan daripada tumbuhan ini (iaitu bawang putih), janganlah dia mendekati masjid-masjid kami. Bau bawang putih itu akan mengganggu kami.\""
  },
  {
    "id": 34209,
    "hadith_number": 31,
    "tajuk_hadith": "Salim ibn Abdullah dan Menarik Kain dari Mulut ketika Solat",
    "perawi_melayu": "Abd ar-Rahman ibn al-Mujabbar",
    "english_text": "Yahya related to me from Malik from Abd ar-Rahman ibn al-Mujabbar\nthat he used to see Salim ibn Abdullah pull the cloth away fiercely\nfrom the mouth of any man he saw covering his mouth while praying.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْمُجَبَّرِ، أَنَّهُ كَانَ يَرَى سَالِمَ بْنَ عَبْدِ اللَّهِ إِذَا رَأَى الإِنْسَانَ يُغَطِّي فَاهُ وَهُوَ يُصَلِّي جَبَذَ الثَّوْبَ عَنْ فِيهِ جَبْذًا شَدِيدًا حَتَّى يَنْزِعَهُ عَنْ فِيهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Abd ar-Rahman ibn al-Mujabbar bahawa dia sering melihat Salim ibn Abdullah menarik kain dengan kasar dari mulut mana-mana lelaki yang dilihatnya menutup mulutnya semasa solat."
  }
]
