[
  {
    "id": 34639,
    "hadith_number": 461,
    "tajuk_hadith": "Larangan Menghadap atau Membelakangi Kiblat Ketika Buang Air",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Ishaq bin Abdullah bin Abi Talha, daripada Rafi' bin Ishaq, seorang *mawla* keluarga ash-Shifa yang dikenali sebagai *mawla* Abu Talha, bahawa dia mendengar Abu Ayyub al-Ansari, salah seorang sahabat Rasulullah ﷺ, ketika berada di Mesir, berkata, \"Demi Allah! Saya tidak tahu bagaimana untuk berurusan dengan tandas-tandas ini.\" Rasulullah ﷺ bersabda, \"Apabila kamu pergi untuk buang air besar atau kecil, jangan menghadap kiblat dan jangan membelakanginya dengan kemaluanmu.\"",
    "english_text": "Yahya related to me from Malik from Ishaq ibn Abdullah ibn Abi\nTalha that Rafiibn Ishaq, a mawla of the family of ash-Shifa who was\nknown as the mawla of Abu Talha, heard Abu Ayyub al-Ansari, one of the\ncompanions of the Messenger of Allah, may Allah bless him and grant\nhim peace, say, while he was in Egypt, \"By Allah! I don't know how to\ndeal with these lavatories.\" The Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"When you go to defecate or urinate, do\nnot expose your genitals towards the qibla, and do not put your back\nto it.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ رَافِعِ بْنِ إِسْحَاقَ، مَوْلًى لآلِ الشِّفَاءِ - وَكَانَ يُقَالُ لَهُ مَوْلَى أَبِي طَلْحَةَ - أَنَّهُ سَمِعَ أَبَا أَيُّوبَ الأَنْصَارِيَّ صَاحِبَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ بِمِصْرَ يَقُولُ وَاللَّهِ مَا أَدْرِي كَيْفَ أَصْنَعُ بِهَذِهِ الْكَرَايِيسِ وَقَدْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا ذَهَبَ أَحَدُكُمُ الْغَائِطَ أَوِ الْبَوْلَ فَلاَ يَسْتَقْبِلِ الْقِبْلَةَ وَلاَ يَسْتَدْبِرْهَا بِفَرْجِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Ishaq bin Abdullah bin Abi Talha, daripada Rafi' bin Ishaq, seorang *mawla* bagi keluarga ash-Shifa yang dikenali sebagai *mawla* Abu Talha, bahawa beliau mendengar Abu Ayyub al-Ansari, seorang sahabat Rasulullah ﷺ, ketika berada di Mesir, berkata, \"Demi Allah! Saya tidak tahu bagaimana hendak menggunakan tandas-tandas ini.\" Rasulullah ﷺ bersabda, \"Apabila salah seorang daripada kamu pergi untuk buang air besar atau kecil, maka janganlah menghadap kiblat dan jangan pula membelakanginya dengan kemaluan kamu.\""
  },
  {
    "id": 34640,
    "hadith_number": 462,
    "tajuk_hadith": "Larangan Menghadap Kiblat Ketika Buang Air Besar atau Kecil",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada seorang lelaki Ansar bahawa Rasulullah SAW melarang daripada menghadap kiblat ketika buang air besar atau kecil.",
    "english_text": "Yahya related to me from Malik from one of the Ansar that the\nMessenger of Allah, may Allah bless him and grant him peace, forbade\ndefecating or urinating while facing the qibla.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ رَجُلٍ، مِنَ الأَنْصَارِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى أَنْ تُسْتَقْبَلَ الْقِبْلَةُ لِغَائِطٍ أَوْ بَوْلٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada seorang lelaki Ansar bahawa Rasulullah SAW melarang daripada menghadap kiblat ketika buang air besar atau kecil."
  },
  {
    "id": 34641,
    "hadith_number": 463,
    "tajuk_hadith": "Menghadap Bayt al-Maqdis Ketika Buang Hajat: Penjelasan Abdullah ibn Umar",
    "perawi_melayu": "Diriwayatkan dari Yahya dari Malik dari Yahya ibn Said dari Muhammad ibn Yahya ibn Habban dari bapa saudaranya, Wasi ibn Habban, dari Abdullah ibn Umar.",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said from Muhammad ibn Yahya ibn Habban from his paternal uncle, Wasi ibn Habban, that Abdullah ibn Umar said, \"People say, 'When you sit to relieve yourself, do not face the qibla or the Bayt al-Maqdis.' \"   Abdullah continued, \"I went upon top of a house of ours and saw the Messenger of Allah, may Allah bless him and grant him peace, (squatting) on two unfired bricks facing the Bayt al-Maqdis, relieving himself.\"   Ibn Umar added, \"Perhaps you are one of those who pray folded on their haunches.\"   Wasi replied, \"I don't know, by Allah!\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنْ عَمِّهِ، وَاسِعِ بْنِ حَبَّانَ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ يَقُولُ إِنَّ أُنَاسًا يَقُولُونَ إِذَا قَعَدْتَ عَلَى حَاجَتِكَ فَلاَ تَسْتَقْبِلِ الْقِبْلَةَ وَلاَ بَيْتَ الْمَقْدِسِ - قَالَ عَبْدُ اللَّهِ - لَقَدِ ارْتَقَيْتُ عَلَى ظَهْرِ بَيْتٍ لَنَا فَرَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى لَبِنَتَيْنِ مُسْتَقْبِلَ بَيْتِ الْمَقْدِسِ لِحَاجَتِهِ ثُمَّ قَالَ لَعَلَّكَ مِنَ الَّذِينَ يُصَلُّونَ عَلَى أَوْرَاكِهِمْ ‏.‏ قَالَ قُلْتُ لاَ أَدْرِي وَاللَّهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku dari Malik dari Yahya ibn Said dari Muhammad ibn Yahya ibn Habban dari bapa saudaranya, Wasi ibn Habban, bahawa Abdullah ibn Umar berkata, \"Sesungguhnya orang ramai berkata, 'Apabila kamu duduk untuk membuang hajat, jangan menghadap kiblat atau Bayt al-Maqdis.'\" Abdullah meneruskan, \"Aku telah naik ke atas bumbung rumah kami dan melihat Rasulullah ﷺ di atas dua bata yang belum dibakar menghadap Bayt al-Maqdis, sedang membuang hajat.\" Ibn Umar menambah, \"Mungkin kamu adalah salah seorang daripada mereka yang solat dengan bertongkat pada pinggul mereka.\" Wasi menjawab, \"Aku tidak tahu, demi Allah!\""
  },
  {
    "id": 34642,
    "hadith_number": 464,
    "tajuk_hadith": "Maksud Perbuatan Sujud yang Betul",
    "perawi_melayu": "Malik meriwayatkan bahawa yang dimaksudkan adalah seseorang yang, ketika dia sujud, merapatkan badannya ke tanah.",
    "english_text": "Malik said that he meant someone who, when he prostrated, kept his body close to the ground.",
    "arabic_text": "",
    "malay_translation": "Malik berkata bahawa yang dimaksudkannya adalah seseorang yang, ketika dia bersujud, merapatkan badannya ke tanah."
  },
  {
    "id": 34643,
    "hadith_number": 465,
    "tajuk_hadith": "Larangan Meludah ke Arah Kiblat Ketika Solat",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Nafi daripada Abdullah ibn Umar bahawa Rasulullah SAW melihat kahak di dinding kiblat lalu Baginda mengikisnya. Kemudian Baginda menghadap orang ramai dan bersabda, \"Apabila seseorang kamu solat, janganlah meludah ke arah hadapan kerana Allah SWT berada di hadapan kamu ketika kamu solat.\"",
    "english_text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaw spittle on the wall of the qibla and scraped it off. Then he went\nup to the people and said, \"Do not spit in front of you when you are\npraying, because Allah, the Blessed and Exalted, is in front of you\nwhen you pray.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَأَى بُصَاقًا فِي جِدَارِ الْقِبْلَةِ فَحَكَّهُ ثُمَّ أَقْبَلَ عَلَى النَّاسِ فَقَالَ ‏\n\"‏ إِذَا كَانَ أَحَدُكُمْ يُصَلِّي فَلاَ يَبْصُقْ قِبَلَ وَجْهِهِ فَإِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قِبَلَ وَجْهِهِ إِذَا صَلَّى ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Nafi daripada Abdullah ibn Umar bahawa Rasulullah SAW melihat kahak di dinding kiblat lalu Baginda mengikisnya. Kemudian Baginda menghadap orang ramai dan bersabda, \"Apabila seseorang kamu solat, janganlah meludah ke arah hadapan kerana Allah SWT berada di hadapan kamu ketika kamu solat.\""
  },
  {
    "id": 34644,
    "hadith_number": 466,
    "tajuk_hadith": "Menghilangkan Kahak atau Ludah dari Dinding Kiblat",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Hisham bin Urwa daripada ayahnya daripada Aisyah, isteri Nabi SAW",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Hisham bin Urwa, daripada ayahnya, daripada Aisyah, isteri Nabi SAW, bahawa Nabi SAW melihat kahak, atau mukus, atau dahak, di dinding kiblat lalu Baginda mengikisnya."
  },
  {
    "id": 34645,
    "hadith_number": 467,
    "tajuk_hadith": "Perubahan Kiblat ke Kaabah Semasa Solat Subuh di Quba'",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Abdullah bin Dinar, bahawa Abdullah bin Umar berkata",
    "english_text": "Yahya related to me from Malik from Abdullah ibn Dinar that\nAbdullah ibn Umar said, \"On one occasion when the people were praying\nsubhat Quba a man came to them and said, 'A piece of Qur'an was sent\ndown to the Messenger of Allah, may Allah bless him and grant him\npeace, last night, and he was ordered to face the Kaba, so face it.'\nThey had been facing ash-Sham, so they turned round and faced the\nKaba.''",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ بَيْنَمَا النَّاسُ بِقُبَاءٍ فِي صَلاَةِ الصُّبْحِ إِذْ جَاءَهُمْ آتٍ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ أُنْزِلَ عَلَيْهِ اللَّيْلَةَ قُرْآنٌ وَقَدْ أُمِرَ أَنْ يَسْتَقْبِلَ الْكَعْبَةَ فَاسْتَقْبِلُوهَا وَكَانَتْ وُجُوهُهُمْ إِلَى الشَّامِ فَاسْتَدَارُوا إِلَى الْكَعْبَةِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Abdullah bin Dinar bahawa Abdullah bin Umar berkata, \"Pada suatu ketika ketika orang ramai sedang solat Subuh di Quba', seorang lelaki datang kepada mereka dan berkata, 'Sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah diturunkan wahyu kepadanya malam tadi dan baginda diperintahkan untuk menghadap Kaabah, maka hadaplah ia.' Mereka pada ketika itu sedang menghadap ke arah Syam, lalu mereka berpaling menghadap Kaabah.\""
  },
  {
    "id": 34646,
    "hadith_number": 468,
    "tajuk_hadith": "Perpindahan Kiblat ke Kaabah",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Yahya ibn Said bahawa Said ibn al-Musayyab berkata",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said that Said ibn\nal-Musayyab said, \"The Messenger of Allah, may Allah bless him and\ngrant him peace, prayed towards the Baytal-Maqdis for sixteen months\nafter arriving in Madina. Then the qibla was moved, two months before\nthe battle of Badr. \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم بَعْدَ أَنْ قَدِمَ الْمَدِينَةَ سِتَّةَ عَشَرَ شَهْرًا نَحْوَ بَيْتِ الْمَقْدِسِ ثُمَّ حُوِّلَتِ الْقِبْلَةُ قَبْلَ بَدْرٍ بِشَهْرَيْنِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Yahya ibn Said bahawa Said ibn al-Musayyab berkata, \"Rasulullah SAW solat menghadap Baitulmaqdis selama enam belas bulan setelah tiba di Madinah. Kemudian kiblat dipindahkan, dua bulan sebelum peperangan Badar.\""
  },
  {
    "id": 34647,
    "hadith_number": 469,
    "tajuk_hadith": "Arah Kiblat Antara Timur dan Barat",
    "perawi_melayu": "Diriwayatkan daripada Malik, daripada Nafi'",
    "english_text": "Yahya related to me from Malik from Nafi that Umar ibn al-Khattab\nsaid, \"Any direction that is between east and west can be taken as a\nqibla if the person praying is face-on to the House.\"",
    "arabic_text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ مَا بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ قِبْلَةٌ إِذَا تُوُجِّهَ قِبَلَ الْبَيْتِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Nafi' bahawa Umar ibn al-Khattab berkata, \"Arah mana pun yang terletak antara timur dan barat boleh dijadikan sebagai kiblat jika orang yang solat itu menghadap ke arah Kaabah.\""
  },
  {
    "id": 34648,
    "hadith_number": 470,
    "tajuk_hadith": "Keutamaan Solat di Masjid Nabawi berbanding Masjid Lain",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Zayd ibn Rabah dan Ubaydullah ibn Abi Abdullah Salman al-Agharr, daripada Abu Hurairah.",
    "english_text": "Yahya related to me from Malik from Zayd ibn Rabah and Ubaydullah\nibn Abi Abdullah Salman al-Agharr from Abu Hurayra that the Messenger\nof Allah, may Allah bless him and grant him peace, said, \"A prayer in\nthis mosque of mine is better than a thousand prayers in any other\nmosque, except the Masjid al-Haram (in Makka).\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ رَبَاحٍ، وَعُبَيْدِ اللَّهِ بْنِ أَبِي عَبْدِ اللَّهِ، عَنْ أَبِي عَبْدِ اللَّهِ، سَلْمَانَ الأَغَرِّ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ صَلاَةٌ فِي مَسْجِدِي هَذَا خَيْرٌ مِنْ أَلْفِ صَلاَةٍ فِيمَا سِوَاهُ إِلاَّ الْمَسْجِدَ الْحَرَامَ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Zayd ibn Rabah dan Ubaydullah ibn Abi Abdullah Salman al-Agharr, daripada Abu Hurairah, bahawa Rasulullah SAW bersabda, \"Solat di masjidku ini lebih baik daripada seribu solat di masjid lain, kecuali Masjid al-Haram (di Makkah).\""
  },
  {
    "id": 34649,
    "hadith_number": 471,
    "tajuk_hadith": "Keutamaan Antara Rumah Nabi dan Mimbar Baginda",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik, daripada Khubayb ibn Abd ar-Rahman, daripada Hafs ibn Asim, daripada Abu Hurairah, atau daripada Abu Said al-Khudri, bahawa Rasulullah SAW bersabda,",
    "english_text": "Yahya related to me from Malik from Khubayb ibn Abd ar-Rahman\nfrom Hafs ibn Asim from Abu Hurayra or from Abu Said al-Khudri that\nthe Messenger of Allah, may Allah bless him and grant him peace, said,\n\"What is between my house and my mimbar is one of the meadows of the\nGarden, and my mimbar is on my watering-place (al-Hawd).\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ، أَوْ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا بَيْنَ بَيْتِي وَمِنْبَرِي رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ وَمِنْبَرِي عَلَى حَوْضِي ‏\"‏ ‏.‏",
    "malay_translation": "\"Antara rumahku dan mimbarku adalah salah satu taman daripada taman-taman syurga, dan mimbarku berada di atas telagaku (al-Hawd).\""
  },
  {
    "id": 34650,
    "hadith_number": 472,
    "tajuk_hadith": "Kelebihan Antara Rumah Nabi dan Mimbar Baginda: Taman dari Taman-Taman Syurga",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Abdullah ibn Abi Bakr daripada Abbad ibn Tamim daripada Abdullah ibn Zayd al-Mazini bahawa Rasulullah SAW bersabda,",
    "english_text": "Yahya related to me from Malik from Abdullah ibn Abi Bakr from\nAbbad ibn Tamim from Abdullah ibn Zayd al-Mazini that the Messenger of\nAllah, may Allah bless him and grant him peace, said, \"What is between\nmy house and my mimbar is one of the meadows of the Garden.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ الْمَازِنِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا بَيْنَ بَيْتِي وَمِنْبَرِي رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ ‏\"‏ ‏.‏",
    "malay_translation": "\"Antara rumahku dan mimbarku adalah salah satu taman daripada taman-taman syurga.\""
  },
  {
    "id": 34651,
    "hadith_number": 473,
    "tajuk_hadith": "Larangan Menghalang Hamba Perempuan ke Masjid",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik bahawa dia mendengar Abdullah bin Umar berkata, \"Rasulullah SAW bersabda: 'Janganlah kamu menghalang hamba perempuan Allah daripada (pergi ke) masjid-masjid Allah.'\"",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَمْنَعُوا إِمَاءَ اللَّهِ مَسَاجِدَ اللَّهِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, bahawa telah sampai kepadanya daripada Abdullah bin Umar, bahawa dia berkata: Rasulullah SAW bersabda: \"Janganlah kamu menghalang hamba-hamba perempuan Allah ( الإِمَاءَ ) daripada (pergi ke) masjid-masjid Allah.\""
  },
  {
    "id": 34652,
    "hadith_number": 474,
    "tajuk_hadith": "Larangan Memakai Wangian Ketika Menghadiri Solat Isyak bagi Wanita",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik bahawa dia mendengar daripada Busr bin Said bahawa Rasulullah SAW bersabda,",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ بُسْرِ بْنِ سَعِيدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا شَهِدَتْ إِحْدَاكُنَّ صَلاَةَ الْعِشَاءِ فَلاَ تَمَسَّنَّ طِيبًا ‏\"‏ ‏.‏",
    "malay_translation": "\"Janganlah seorang pun di antara kamu (kaum wanita) memakai wangi-wangian apabila hadir untuk solat Isyak.\""
  },
  {
    "id": 34653,
    "hadith_number": 475,
    "tajuk_hadith": "Atikah binti Zaid Meminta Izin ke Masjid",
    "perawi_melayu": "Malik meriwayatkan daripada Yahya ibn Said bahawa Atika binti Zayd ibn Amr ibn Nufayl, isteri Umar ibn al-Khattab,",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said that Atika\nbint Zayd ibn Amr ibn Nufayl, the wife of Umar ibn al-Khattab, used to\nask Umar ibn al-Khattab for permission to go to the mosque. He would\nkeep silent, so she would say, \"By Allah, I will go out, unless you\nforbid me,\" and he would not forbid her.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَاتِكَةَ بِنْتِ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ، امْرَأَةِ عُمَرَ بْنِ الْخَطَّابِ أَنَّهَا كَانَتْ تَسْتَأْذِنُ عُمَرَ بْنَ الْخَطَّابِ إِلَى الْمَسْجِدِ فَيَسْكُتُ فَتَقُولُ وَاللَّهِ لأَخْرُجَنَّ إِلاَّ أَنْ تَمْنَعَنِي ‏.‏ فَلاَ يَمْنَعُهَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Yahya ibn Said bahawa Atika binti Zayd ibn Amr ibn Nufayl, isteri kepada Umar ibn al-Khattab, biasanya meminta izin daripada Umar ibn al-Khattab untuk pergi ke masjid. Umar berdiam diri, jadi dia (Atika) berkata, \"Demi Allah, aku akan keluar, kecuali jika engkau melarangku.\" Dan Umar tidak melarangnya."
  },
  {
    "id": 34654,
    "hadith_number": 476,
    "tajuk_hadith": "Larangan Wanita ke Masjid Jika Rasulullah SAW Melihat Perbuatan Mereka Sekarang",
    "perawi_melayu": "Malik meriwayatkan daripada Yahya ibn Said daripada Amra bint Abd ar-Rahman bahawa A'isha, isteri Nabi SAW, berkata, \"Jika Rasulullah SAW melihat apa yang wanita lakukan sekarang, baginda pasti akan melarang mereka pergi ke masjid, sama seperti wanita Bani Israil dilarang.\"",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said from Amra bint\nAbd ar-Rahman that A'isha, the wife of the Prophet, may Allah bless\nhim and grant him peace, said, \"If the Messenger of Allah, may Allah\nbless him and grant him peace, had seen what women do now, he would\nhave forbidden them to go into the mosques,  just as the women of the\nBani Israil were forbidden.\"\n\n\nYahya ibn Said said that he\nasked Amra, \"Were the women of the Bani Israil forbidden to go into\nthe mosques?\" and she said, \"Yes.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ لَوْ أَدْرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَا أَحْدَثَ النِّسَاءُ لَمَنَعَهُنَّ الْمَسَاجِدَ كَمَا مُنِعَهُ نِسَاءُ بَنِي إِسْرَائِيلَ ‏.‏ قَالَ يَحْيَى بْنُ سَعِيدٍ فَقُلْتُ لِعَمْرَةَ أَوَمُنِعَ نِسَاءُ بَنِي إِسْرَائِيلَ الْمَسَاجِدَ قَالَتْ نَعَمْ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Yahya ibn Said daripada Amra bint Abd ar-Rahman bahawa A'isha, isteri Nabi SAW, berkata, \"Jika Rasulullah SAW melihat apa yang wanita lakukan sekarang, baginda pasti akan melarang mereka pergi ke masjid, sama seperti wanita Bani Israil dilarang.\" Yahya ibn Said berkata bahawa dia bertanya kepada Amra, \"Adakah wanita Bani Israil dilarang pergi ke masjid?\" dan dia menjawab, \"Ya.\""
  }
]