[
  {
    "id": 34467,
    "hadith_number": 289,
    "tajuk_hadith": "Keutamaan Solat Berjemaah",
    "perawi_melayu": "Abdullah ibn Umar",
    "english_text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"Prayer in congregation is better than the prayer of a man by\nhimself by twenty-seven degrees.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ صَلاَةُ الْجَمَاعَةِ تَفْضُلُ صَلاَةَ الْفَذِّ بِسَبْعٍ وَعِشْرِينَ دَرَجَةً ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Nafi', daripada Abdullah ibn Umar bahawa Rasulullah ﷺ bersabda, \"Solat berjemaah adalah lebih baik daripada solat seseorang bersendirian dengan dua puluh tujuh darjat.\""
  },
  {
    "id": 34468,
    "hadith_number": 290,
    "tajuk_hadith": "Keutamaan Solat Berjemaah",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Said ibn al-Musayyab from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Prayer in congregation is better than the prayer of one of you on his own by twenty-five parts.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ صَلاَةُ الْجَمَاعَةِ أَفْضَلُ مِنْ صَلاَةِ أَحَدِكُمْ وَحْدَهُ بِخَمْسَةٍ وَعِشْرِينَ جُزْءًا ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Said ibn al-Musayyab, daripada Abu Hurairah bahawa Rasulullah SAW bersabda, \"Solat berjemaah adalah lebih utama daripada solat seseorang daripada kamu bersendirian dengan dua puluh lima kali ganda.\""
  },
  {
    "id": 34469,
    "hadith_number": 291,
    "tajuk_hadith": "Ancaman Meninggalkan Solat Isyak Berjemaah",
    "perawi_melayu": "Abu Hurairah رضي الله عنه",
    "english_text": "Yahya related to me from Malik from Abu'zZinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"By Him in whose hand myself is! I had in mind to\norder firewood to be collected, then to order the prayer to be called,\nand to appoint a man to lead the people in prayer, and then to come up\nbehind certain men and burn their houses down about them! By Him in\nwhose hand myself is! If one of them knew that he would find a meaty\nbone or two good legs of meat, he would be present at isha.''",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لَقَدْ هَمَمْتُ أَنْ آمُرَ بِحَطَبٍ فَيُحْطَبَ ثُمَّ آمُرَ بِالصَّلاَةِ فَيُؤَذَّنَ لَهَا ثُمَّ آمُرَ رَجُلاً فَيَؤُمَّ النَّاسَ ثُمَّ أُخَالِفَ إِلَى رِجَالٍ فَأُحَرِّقَ عَلَيْهِمْ بُيُوتَهُمْ",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abu'z-Zinad, daripada al-A'raj, daripada Abu Hurairah رضي الله عنه bahawa Rasulullah ﷺ bersabda, \"Demi (Allah) yang jiwaku berada di tangan-Nya! Sungguh, aku hampir-hampir memerintahkan agar kayu api dikumpulkan, kemudian memerintahkan solat didirikan, kemudian memerintahkan seseorang untuk menjadi imam solat bersama manusia, kemudian mendatangi beberapa orang (yang tidak hadir solat berjemaah) dan membakar rumah mereka! Demi (Allah) yang jiwaku berada di tangan-Nya! Sekiranya salah seorang daripada mereka tahu bahawa dia akan mendapat tulang yang berdaging atau dua kaki daging yang baik, nescaya dia akan hadir solat Isyak (berjemaah).\""
  },
  {
    "id": 34470,
    "hadith_number": 292,
    "tajuk_hadith": "Solat Terbaik di Rumah Kecuali Solat Fardhu",
    "perawi_melayu": "Zayd ibn Thabit",
    "english_text": "Yahya related to me from Malik from Abu'n-Nadr, the mawla of Umar\nibn Ubaydullah from Yusr ibn Said that Zayd ibn Thabit said, \"The most\nexcellent prayer is your prayer in your house, except for the\nprescribed prayers.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ بُسْرِ بْنِ سَعِيدٍ، أَنَّ زَيْدَ بْنَ ثَابِتٍ، قَالَ أَفْضَلُ الصَّلاَةِ صَلاَتُكُمْ فِي بُيُوتِكُمْ إِلاَّ صَلاَةَ الْمَكْتُوبَةِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abu'n-Nadr, mawla Umar ibn Ubaydullah daripada Yusr ibn Said bahawa Zayd ibn Thabit berkata, \"Solat yang paling utama adalah solat kamu di rumah kamu, kecuali solat fardhu.\""
  },
  {
    "id": 34471,
    "hadith_number": 293,
    "tajuk_hadith": "Perbezaan Antara Muslim dan Munafik",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Abd ar-Rahman ibn Harmala al-\nAslami from Said ibn al-Musayyab that the Messenger of Allah, may\nAllah bless him and grant him peace, said, \"What separates us from the\nhypocrites is being present at isha and subh. They cannot do it,\" or\nwords to that effect.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَرْمَلَةَ الأَسْلَمِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ بَيْنَنَا وَبَيْنَ الْمُنَافِقِينَ شُهُودُ الْعِشَاءِ وَالصُّبْحِ لاَ يَسْتَطِيعُونَهُمَا ‏\"‏ ‏.‏ أَوْ نَحْوَ هَذَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik, daripada Abd ar-Rahman ibn Harmala al-Aslami, daripada Said ibn al-Musayyab bahawa Rasulullah SAW bersabda: \"Perkara yang membezakan antara kita dan orang munafik adalah kehadiran mereka pada solat Isyak dan Subuh. Mereka tidak mampu melakukannya,\" atau kata-kata yang serupa."
  },
  {
    "id": 34472,
    "hadith_number": 294,
    "tajuk_hadith": "Ganjaran bagi Mereka yang Syahid dan Amalan Mulia",
    "perawi_melayu": "Yahya meriwayatkan kepada saya dari Malik dari Sumayy, mawla Abu Bakr ibn Abd ar-Rahman dari Abu Salih dari Abu Hurayra bahawa Rasulullah SAW bersabda",
    "english_text": "If a man who is walking along a road finds a branch of thorns on the road and removes it, Allah thanks him for doing it and forgives him.\n\n\nHe also said, \"Martyrs are five:\nthe one killed by a plague, the one\nkilled by a disease of the belly, the one who drowns, the one killed\nby a collapsing building, and the martyr in the path of Allah.'\n\n\nHe also said, \"If people knew what there was in the call to prayer\nand the first row, and they could find no other way except to draw\nlots for it, they would draw lots for it. And if they knew what there\nwas in doing dhuhr at its time, they would race each other to it. And\nif they knew what there was in the prayers of isha and maghrib, they\nwould come to them even if they had to crawl .",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَمَا رَجُلٌ يَمْشِي بِطَرِيقٍ إِذْ وَجَدَ غُصْنَ شَوْكٍ عَلَى الطَّرِيقِ فَأَخَّرَهُ فَشَكَرَ اللَّهُ لَهُ فَغَفَرَ لَهُ ‏\"‏ ‏.‏ \n وَقَالَ ‏\"‏ الشُّهَدَاءُ خَمْسَةٌ الْمَطْعُونُ وَالْمَبْطُونُ وَالْغَرِقُ وَصَاحِبُ الْهَدْمِ وَالشَّهِيدُ فِي سَبِيلِ اللَّهِ ‏\"‏ ‏.‏ \n وَقَالَ ‏\"‏ لَوْ يَعْلَمُ النَّاسُ مَا فِي النِّدَاءِ وَالصَّفِّ الأَوَّلِ ثُمَّ لَمْ يَجِدُوا إِلاَّ أَنْ يَسْتَهِمُوا عَلَيْهِ لاَسْتَهَمُوا وَلَوْ يَعْلَمُونَ مَا فِي التَّهْجِيرِ لاَسْتَبَقُوا إِلَيْهِ وَلَوْ يَعْلَمُونَ مَا فِي الْعَتَمَةِ وَالصُّبْحِ لأَتَوْهُمَا وَلَوْ حَبْوًا ‏\"‏ ‏.‏",
    "malay_translation": "Sabda Rasulullah SAW: \"Jika seseorang berjalan di jalan lalu mendapati ranting berduri di jalan dan membuangnya, Allah berterima kasih kepadanya atas perbuatannya dan mengampuninya.\"\n\nBaginda juga bersabda: \"Syuhada itu ada lima:\nyang mati kerana wabak, yang mati kerana penyakit perut, yang mati lemas, yang mati kerana runtuhan bangunan, dan syahid di jalan Allah.\"\n\nBaginda juga bersabda: \"Sekiranya manusia mengetahui kelebihan azan dan saf pertama, nescaya mereka akan mengundi untuk mendapatkannya. Dan sekiranya mereka mengetahui kelebihan solat Zuhur di awal waktu, nescaya mereka akan berlumba-lumba mengerjakannya. Dan sekiranya mereka mengetahui kelebihan solat Isyak dan Maghrib, nescaya mereka akan mendatanginya walaupun terpaksa merangkak.\""
  },
  {
    "id": 34473,
    "hadith_number": 295,
    "tajuk_hadith": "Keutamaan Solat Subuh Berjemaah",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ سُلَيْمَانَ بْنِ أَبِي حَثْمَةَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، فَقَدَ سُلَيْمَانَ بْنَ أَبِي حَثْمَةَ فِي صَلاَةِ الصُّبْحِ وَأَنَّ عُمَرَ بْنَ الْخَطَّابِ غَدَا إِلَى السُّوقِ - وَمَسْكَنُ سُلَيْمَانَ بَيْنَ السُّوقِ وَالْمَسْجِدِ النَّبَوِيِّ - فَمَرَّ عَلَى الشِّفَاءِ أُمِّ سُلَيْمَانَ فَقَالَ لَهَا لَمْ أَرَ سُلَيْمَانَ فِي الصُّبْحِ فَقَالَتْ إِنَّهُ بَاتَ يُصَلِّي فَغَلَبَتْهُ عَيْنَاهُ ‏.‏ فَقَالَ عُمَرُ لأَنْ أَشْهَدَ صَلاَةَ الصُّبْحِ فِي الْجَمَاعَةِ أَحَبُّ إِلَىَّ مِنْ أَنْ أَقُومَ لَيْلَةً ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Abu Bakr ibn Sulayman ibn Abi Hathma bahawa Umar ibn al-Khattab tidak mendapati Sulayman ibn Abi Hathma dalam solat subuh. Pada waktu pagi, beliau pergi ke pasar, dan rumah Sulayman terletak di antara pasar dan Masjid Nabi. Beliau melalui ash-Shifa, ibu Sulayman, dan berkata kepadanya, \"Saya tidak melihat Sulayman dalam solat subuh.\" Dia menjawab, \"Dia menghabiskan malam dengan solat dan matanya mengalahkannya.\" Umar berkata, \"Saya lebih suka hadir dalam solat subuh berjemaah daripada berdiri sepanjang malam dalam solat.\" "
  },
  {
    "id": 34474,
    "hadith_number": 296,
    "tajuk_hadith": "Keutamaan Solat Isyak dan Subuh Berjemaah",
    "perawi_melayu": "Abd ar-Rahman ibn Abi Amra al-Ansari",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said from Muhammad\nibn Ibrahim that Abd ar-Rahman ibn Abi Amra al-Ansari said that Uthman\nibn Affan came to the isha prayer and seeing only a few people in the\nmosque, he lay down at the back of the mosque to wait for the number\nof people to increase. Ibn Abi Amra went and sat down beside him and\nUthman asked him who he was, so he told him. Uthman said, \"What have\nyou memorised of the Qur'an?\", and he told him. Uthman said, \"If\nsomeone is present at isha, it is as if he had stood in prayer for\nhalf a night, and if some one is present at subh, it is as if he had\nstood in prayer for a whole night.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمْرَةَ الأَنْصَارِيِّ، أَنَّهُ قَالَ جَاءَ عُثْمَانُ بْنُ عَفَّانَ إِلَى صَلاَةِ الْعِشَاءِ فَرَأَى أَهْلَ الْمَسْجِدِ قَلِيلاً فَاضْطَجَعَ فِي مُؤَخَّرِ الْمَسْجِدِ يَنْتَظِرُ النَّاسَ أَنْ يَكْثُرُوا فَأَتَاهُ ابْنُ أَبِي عَمْرَةَ فَجَلَسَ إِلَيْهِ فَسَأَلَهُ مَنْ هُوَ فَأَخْبَرَهُ فَقَالَ مَا مَعَكَ مِنَ الْقُرْآنِ فَأَخْبَرَهُ ‏.‏ فَقَالَ لَهُ عُثْمَانُ مَنْ شَهِدَ الْعِشَاءَ فَكَأَنَّمَا قَامَ نِصْفَ لَيْلَةٍ وَمَنْ شَهِدَ الصُّبْحَ فَكَأَنَّمَا قَامَ لَيْلَةً ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Yahya ibn Said daripada Muhammad ibn Ibrahim bahawa Abd ar-Rahman ibn Abi Amra al-Ansari berkata bahawa Uthman ibn Affan datang untuk solat isyak dan melihat hanya sedikit orang di masjid, beliau berbaring di belakang masjid untuk menunggu bilangan orang bertambah. Ibn Abi Amra datang dan duduk di sebelahnya dan Uthman bertanya kepadanya siapa dia, lalu dia memberitahunya. Uthman berkata, \"Apa yang kamu hafal daripada al-Quran?\", dan dia memberitahunya. Uthman berkata, \"Jika seseorang hadir pada solat isyak, seolah-olah dia telah berdiri dalam solat separuh malam, dan jika seseorang hadir pada solat subuh, seolah-olah dia telah berdiri dalam solat sepanjang malam."
  },
  {
    "id": 34475,
    "hadith_number": 297,
    "tajuk_hadith": "Mengerjakan Solat Berjemaah Walaupun Sudah Solat",
    "perawi_melayu": "Busr ibn Mihjan (dari bapanya, Mihjan)",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ رَجُلٍ، مِنْ بَنِي الدِّيلِ يُقَالُ لَهُ بُسْرُ بْنُ مِحْجَنٍ عَنْ أَبِيهِ، مِحْجَنٍ أَنَّهُ كَانَ فِي مَجْلِسٍ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأُذِّنَ بِالصَّلاَةِ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى ثُمَّ رَجَعَ وَمِحْجَنٌ فِي مَجْلِسِهِ لَمْ يُصَلِّ مَعَهُ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا مَنَعَكَ أَنْ تُصَلِّيَ مَعَ النَّاسِ أَلَسْتَ بِرَجُلٍ مُسْلِمٍ ‏\"‏ ‏.‏ فَقَالَ بَلَى يَا رَسُولَ اللَّهِ وَلَكِنِّي قَدْ صَلَّيْتُ فِي أَهْلِي ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا جِئْتَ فَصَلِّ مَعَ النَّاسِ وَإِنْ كُنْتَ قَدْ صَلَّيْتَ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya dari Malik dari Zayd ibn Aslam dari seorang lelaki dari Bani'd-Dil yang bernama Busr ibn Mihjan dari bapanya Mihjan bahawa dia berada dalam majlis bersama Rasulullah SAW, lalu azan dilaungkan. Rasulullah SAW bangun dan solat, kemudian kembali. Mihjan masih duduk dan tidak solat bersama baginda. Rasulullah SAW bersabda, \"Apakah yang menghalangmu daripada solat bersama orang ramai? Bukankah engkau seorang Muslim?\" Dia menjawab, \"Tentu sahaja, wahai Rasulullah, tetapi saya telah solat bersama keluarga saya.\" Rasulullah SAW bersabda, \"Apabila engkau datang, solatlah bersama orang ramai, walaupun engkau telah solat sebelumnya.\""
  },
  {
    "id": 34476,
    "hadith_number": 298,
    "tajuk_hadith": "Menunaikan Solat Berjemaah Setelah Solat Sendiri di Rumah",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Nafi that a man asked\nAbdullah ibn Umar, \"Sometimes I pray in my house, and then catch the\nprayer with the imam. Should I pray with him?\" Abdullah ibn Umar said\nto him, \"Yes,\" and the man said, \"Which of them do I make my prayer?\"\nAbdullah ibn Umar said, \"Is that up to you? It is up to Allah. He will\ndecide on whichever of them He wishes.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ رَجُلاً، سَأَلَ عَبْدَ اللَّهِ بْنَ عُمَرَ فَقَالَ إِنِّي أُصَلِّي فِي بَيْتِي ثُمَّ أُدْرِكُ الصَّلاَةَ مَعَ الإِمَامِ أَفَأُصَلِّي مَعَهُ فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ عُمَرَ نَعَمْ ‏.‏ فَقَالَ الرَّجُلُ أَيَّتَهُمَا أَجْعَلُ صَلاَتِي فَقَالَ لَهُ ابْنُ عُمَرَ أَوَذَلِكَ إِلَيْكَ إِنَّمَا ذَلِكَ إِلَى اللَّهِ يَجْعَلُ أَيَّتَهُمَا شَاءَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Nafi', bahawa seorang lelaki bertanya kepada Abdullah bin Umar: \"Kadang-kadang saya solat di rumah, kemudian saya mengejar solat berjemaah dengan imam. Perlukah saya solat bersama mereka?\" Abdullah bin Umar berkata kepadanya, \"Ya.\" Lelaki itu bertanya, \"Yang manakah solat saya kira?\" Abdullah bin Umar berkata kepadanya, \"Adakah itu terpulang kepada kamu? Ia terpulang kepada Allah. Dia akan menentukan yang mana Dia kehendaki.\""
  },
  {
    "id": 34477,
    "hadith_number": 299,
    "tajuk_hadith": "Solat Berjemaah di Masjid Selepas Solat di Rumah",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said that a man\nasked Said ibn al-Musayyab, \"I pray in my house, and then I come to\nthe mosque and find the imam praying. Should I pray with him?\" Said\nsaid, \"Yes,\" and the man said, \"Which of them is my prayer?\" Said\nsaid, \"Are you the one to decide that? That is up to Allah.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ رَجُلاً، سَأَلَ سَعِيدَ بْنَ الْمُسَيَّبِ فَقَالَ إِنِّي أُصَلِّي فِي بَيْتِي ثُمَّ آتِي الْمَسْجِدَ فَأَجِدُ الإِمَامَ يُصَلِّي أَفَأُصَلِّي مَعَهُ فَقَالَ سَعِيدٌ نَعَمْ ‏.‏ فَقَالَ الرَّجُلُ فَأَيُّهُمَا صَلاَتِي فَقَالَ سَعِيدٌ أَوَأَنْتَ تَجْعَلُهُمَا إِنَّمَا ذَلِكَ إِلَى اللَّهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik daripada Yahya bin Said bahawa seorang lelaki bertanya kepada Said ibn al-Musayyab, \"Saya solat di rumah saya, kemudian saya datang ke masjid dan mendapati imam sedang solat. Patutkah saya solat bersamanya?\" Said berkata, \"Ya,\" dan lelaki itu berkata, \"Yang mana satu antara solat saya?\" Said berkata, \"Adakah kamu yang akan menentukannya? Itu terserah kepada Allah.\""
  },
  {
    "id": 34478,
    "hadith_number": 300,
    "tajuk_hadith": "Ganjaran Solat Bersama Imam Walaupun Sudah Mengerjakan Solat",
    "perawi_melayu": "Afif as-Sahmi",
    "english_text": "Yahya related to me from Malik from Afif as-Sahmi that a man from\nthe tribe of Bani Asad asked Abu Ayyub al-Ansari. \"Sometimes I pray in\nmy house, and then come to the mosque and find the imam praying.\nShould I pray with him?\" Abu Ayyub said, \"Yes, pray with him, for some\none who does so has the reward of the group, or the equivalent of the\nreward of the group.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَفِيفٍ السَّهْمِيِّ، عَنْ رَجُلٍ، مِنْ بَنِي أَسَدٍ أَنَّهُ سَأَلَ أَبَا أَيُّوبَ الأَنْصَارِيَّ فَقَالَ إِنِّي أُصَلِّي فِي بَيْتِي ثُمَّ آتِي الْمَسْجِدَ فَأَجِدُ الإِمَامَ يُصَلِّي أَفَأُصَلِّي مَعَهُ فَقَالَ أَبُو أَيُّوبَ نَعَمْ فَصَلِّ مَعَهُ فَإِنَّ مَنْ صَنَعَ ذَلِكَ فَإِنَّ لَهُ سَهْمَ جَمْعٍ أَوْ مِثْلَ سَهْمِ جَمْعٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Afif as-Sahmi bahawa seorang lelaki daripada Bani Asad bertanya kepada Abu Ayyub al-Ansari. \"Kadang-kadang saya solat di rumah saya, kemudian datang ke masjid dan mendapati imam sedang solat. Patutkah saya solat bersamanya?\" Abu Ayyub berkata, \"Ya, solatlah bersamanya, kerana sesiapa yang berbuat demikian akan mendapat ganjaran seperti ganjaran berjemaah, atau setara dengan ganjaran berjemaah.\""
  },
  {
    "id": 34479,
    "hadith_number": 301,
    "tajuk_hadith": "Hukum Mengulangi Solat Maghrib dan Subuh",
    "perawi_melayu": "Nafi meriwayatkan dari Abdullah ibn Umar",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to say, \"Someone who prays maghrib or subh and then catches them\nwith the imam should not repeat them.\"\n\n\nMalik said, \"I do not\nsee any harm in someone who has already prayed in his house praying\nwith the imam, except for maghrib, because if he repeats it, he makes\nit even.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ مَنْ صَلَّى الْمَغْرِبَ أَوِ الصُّبْحَ ثُمَّ أَدْرَكَهُمَا مَعَ الإِمَامِ فَلاَ يَعُدْ لَهُمَا ‏.‏ قَالَ مَالِكٌ وَلاَ أَرَى بَأْسًا أَنْ يُصَلِّيَ مَعَ الإِمَامِ مَنْ كَانَ قَدْ صَلَّى فِي بَيْتِهِ إِلاَّ صَلاَةَ الْمَغْرِبِ فَإِنَّهُ إِذَا أَعَادَهَا كَانَتْ شَفْعًا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya dari Malik dari Nafi bahawa Abdullah ibn Umar pernah berkata, \"Sesiapa yang telah menunaikan solat Maghrib atau Subuh kemudian mendapati solat tersebut bersama imam, maka janganlah dia mengulanginya.\"\n\nMalik berkata, \"Saya tidak melihat sebarang masalah bagi seseorang yang telah menunaikan solat di rumahnya untuk solat bersama imam, kecuali solat Maghrib, kerana jika dia mengulanginya, ia akan menjadi genap (yakni, ganjil akan jadi genap, dan tidak disyariatkan)."
  },
  {
    "id": 34480,
    "hadith_number": 302,
    "tajuk_hadith": "Memendekkan Solat Berjemaah Kerana Keadaan Jemaah",
    "perawi_melayu": "Abu Hurayra",
    "english_text": "Yahya related to me from Malik from Abu'z Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"When you lead people in the prayer, make it short,\nbecause there are among them some people who are weak, ill and old.\nBut when you pray on your own, make it as long as you wish.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا صَلَّى أَحَدُكُمْ بِالنَّاسِ فَلْيُخَفِّفْ فَإِنَّ فِيهِمُ الضَّعِيفَ وَالسَّقِيمَ وَالْكَبِيرَ وَإِذَا صَلَّى أَحَدُكُمْ لِنَفْسِهِ فَلْيُطَوِّلْ مَا شَاءَ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Abu'z Zinad daripada al-Araj daripada Abu Hurayra bahawa Rasulullah SAW bersabda, \"Apabila seseorang daripada kamu mengimamkan solat bersama orang ramai, hendaklah dia meringankannya kerana sesungguhnya dalam kalangan mereka ada yang lemah, sakit dan tua. Tetapi apabila seseorang daripada kamu bersolat bersendirian, maka hendaklah dia memanjangkannya sekehendaknya.\""
  },
  {
    "id": 34481,
    "hadith_number": 303,
    "tajuk_hadith": "Abdullah ibn Umar Memposisikan Sahabat di Sampingnya dalam Solat",
    "perawi_melayu": "Nafi'",
    "english_text": "Yahya related to me from Malik that Nafi said, \"I stood behind\nAbdullah ibn Umar in one of the prayers when there was no one else\nwith him, and he reached behind with his hand and placed me beside\nhim.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّهُ قَالَ قُمْتُ وَرَاءَ عَبْدِ اللَّهِ بْنِ عُمَرَ فِي صَلاَةٍ مِنَ الصَّلَوَاتِ وَلَيْسَ مَعَهُ أَحَدٌ غَيْرِي فَخَالَفَ عَبْدُ اللَّهِ بِيَدِهِ فَجَعَلَنِي حِذَاءَهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa Nafi' berkata, \"Saya berdiri di belakang Abdullah ibn Umar dalam satu daripada solat ketika tiada sesiapa pun bersama beliau selain saya, lalu beliau mencapai ke belakang dengan tangannya dan meletakkan saya di sampingnya.\""
  },
  {
    "id": 34482,
    "hadith_number": 304,
    "tajuk_hadith": "Umar ibn Abd al-Aziz Melarang Imam di al-Aqiq",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said that a man\nused to lead the people in prayer in al-Aqiq (a place near Madina),\nand Umar ibn Abd al-Aziz sent a message to him forbidding him to do\nso.\n\n\nMalik said, \"He only forbade him because his father was\nnot known.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ رَجُلاً، كَانَ يَؤُمُّ النَّاسَ بِالْعَقِيقِ فَأَرْسَلَ إِلَيْهِ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ فَنَهَاهُ ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا نَهَاهُ لأَنَّهُ كَانَ لاَ يُعْرَفُ أَبُوهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya ibn Said bahawa seorang lelaki mengimami solat berjemaah di al-Aqiq (tempat berhampiran Madinah), dan Umar ibn Abd al-Aziz menghantar surat kepadanya melarangnya berbuat demikian.\n\nMalik berkata, \"Sesungguhnya dia melarangnya kerana bapanya tidak diketahui.\""
  },
  {
    "id": 34483,
    "hadith_number": 305,
    "tajuk_hadith": "Solat Imam Perlu Diikuti",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Anas ibn\nMalik that the Messenger of Allah, may Allah bless him and grant him\npeace, fell off his horse when riding, and his right side was scraped,\nso he did one of the prayers sitting, and we prayed behind him\nsitting. When he left, he said, \"The imam is appointed to be followed.\nIf he prays standing, then pray standing, and when he goes into ruku,\ngo into ruku, and when he rises, rise, and when he says, 'Allah hears\nwhoever praises him,' say, 'Our Lord, praise belongs to You,' and if\nhe prays sitting, then all of you pray sitting.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَكِبَ فَرَسًا فَصُرِعَ فَجُحِشَ شِقُّهُ الأَيْمَنُ فَصَلَّى صَلاَةً مِنَ الصَّلَوَاتِ وَهُوَ قَاعِدٌ وَصَلَّيْنَا وَرَاءَهُ قُعُودًا فَلَمَّا انْصَرَفَ قَالَ ‏\n\"‏ إِنَّمَا جُعِلَ الإِمَامُ لِيُؤْتَمَّ بِهِ فَإِذَا صَلَّى قَائِمًا فَصَلُّوا قِيَامًا وَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا رَفَعَ فَارْفَعُوا وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا رَبَّنَا وَلَكَ الْحَمْدُ وَإِذَا صَلَّى جَالِسًا فَصَلُّوا جُلُوسًا أَجْمَعُونَ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Anas bin Malik bahawa Rasulullah SAW pernah terjatuh daripada kudanya ketika menunggang, dan bahagian kanan baginda tercedera. Maka, baginda menunaikan salah satu solat dalam keadaan duduk, dan kami solat di belakang baginda dalam keadaan duduk. Apabila baginda selesai solat, baginda bersabda, \"Sesungguhnya imam itu dijadikan untuk diikuti. Apabila dia solat berdiri, maka solatlah kamu berdiri, dan apabila dia rukuk, maka rukuklah kamu, dan apabila dia bangun, maka bangunlah kamu, dan apabila dia mengucapkan, 'Allah mendengar orang yang memuji-Nya,' maka ucapkanlah, 'Ya Tuhan kami, bagi-Mu segala puji,' dan apabila dia solat duduk, maka solatlah kamu semua duduk.\""
  },
  {
    "id": 34484,
    "hadith_number": 306,
    "tajuk_hadith": "Imam Perlu Diikuti dalam Solat",
    "perawi_melayu": "Aisyah, isteri Nabi ﷺ",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that A'isha, the wife of the Prophet, may Allah bless him and\ngrant him peace, said, \"The Messenger of Allah, may Allah bless him\nand grant him peace, prayed while he was ill. He prayed sitting, and\nsome people prayed behind him standing, and he indicated to them to\nsit down. When he left, he said, 'The imam is only appointed to be\nfollowed. When he goes into ruku, go into ruku and when he rises, rise\nand if he prays sitting, pray sitting .' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ شَاكٍ فَصَلَّى جَالِسًا وَصَلَّى وَرَاءَهُ قَوْمٌ قِيَامًا فَأَشَارَ إِلَيْهِمْ أَنِ اجْلِسُوا فَلَمَّا انْصَرَفَ قَالَ ‏\n\"‏ إِنَّمَا جُعِلَ الإِمَامُ لِيُؤْتَمَّ بِهِ فَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا رَفَعَ فَارْفَعُوا وَإِذَا صَلَّى جَالِسًا فَصَلُّوا جُلُوسًا ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Hisyam bin Urwah, daripada ayahnya, daripada Aisyah, isteri Nabi ﷺ, bahawa dia berkata: \"Rasulullah ﷺ solat dalam keadaan sakit. Baginda solat sambil duduk, dan sebahagian orang solat di belakang baginda sambil berdiri, lalu baginda memberi isyarat kepada mereka supaya duduk. Apabila baginda selesai, baginda bersabda: 'Sesungguhnya imam itu dijadikan untuk diikuti. Apabila dia rukuk, maka rukuklah, dan apabila dia bangun, maka bangunlah, dan jika dia solat sambil duduk, maka solatlah sambil duduk.'\""
  },
  {
    "id": 34485,
    "hadith_number": 307,
    "tajuk_hadith": "Rasulullah SAW Menghadiri Solat Berjemaah Semasa Sakit",
    "perawi_melayu": "Malik, daripada Hisham ibn Urwa, daripada bapanya",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that the Messenger of Allah, may Allah bless him and grant him\npeace, came out during his illness, and approached and found Abu Bakr\nstanding, leading the people in prayer. Abu Bakr began to go back, but\nthe Messenger of Allah, may Allah bless him and grant him peace,\nindicated to him to stay where he was. The Messenger of Allah, may\nAllah bless him and grant him peace, sat by the side of Abu Bakr, and\nAbu Bakr prayed following the prayer of the Messenger of Allah, may\nAllah bless him and grant him peace, who was sitting, and the people\nprayed following the prayer of Abu Bakr.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ فِي مَرَضِهِ فَأَتَى فَوَجَدَ أَبَا بَكْرٍ وَهُوَ قَائِمٌ يُصَلِّي بِالنَّاسِ فَاسْتَأْخَرَ أَبُو بَكْرٍ فَأَشَارَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ كَمَا أَنْتَ فَجَلَسَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى جَنْبِ أَبِي بَكْرٍ فَكَانَ أَبُو بَكْرٍ يُصَلِّي بِصَلاَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ جَالِسٌ وَكَانَ النَّاسُ يُصَلُّونَ بِصَلاَةِ أَبِي بَكْرٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Hisham ibn Urwa, daripada bapanya bahawa Rasulullah SAW keluar semasa baginda sakit. Baginda tiba dan mendapati Abu Bakar sedang berdiri mengimami solat berjemaah. Abu Bakar berundur, tetapi Rasulullah SAW memberi isyarat kepadanya supaya tetap berada di tempatnya. Rasulullah SAW duduk di sisi Abu Bakar, dan Abu Bakar solat mengikut solat Rasulullah SAW yang sedang duduk, dan orang ramai solat mengikut solat Abu Bakar."
  },
  {
    "id": 34486,
    "hadith_number": 308,
    "tajuk_hadith": "Solat Duduk Sama dengan Separuh Solat Berdiri",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Ismail ibn Muhammad ibn Said\nibn Abi Waqqas from a mawla of Amr ibn al-As or of Abdullah ibn Amr\nibn al-As that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"The prayer of one of you sitting down is only equal\nto half the prayer of one of you when he is standing.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ إِسْمَاعِيلَ بْنِ مُحَمَّدِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ مَوْلًى، لِعَمْرِو بْنِ الْعَاصِ - أَوْ لِعَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ - عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ صَلاَةُ أَحَدِكُمْ وَهُوَ قَاعِدٌ مِثْلُ نِصْفِ صَلاَتِهِ وَهُوَ قَائِمٌ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik, daripada Ismail bin Muhammad bin Sa'd bin Abi Waqqas, daripada seorang *mawla* Amr ibn al-As atau Abdullah ibn Amr ibn al-As bahawa Rasulullah SAW bersabda, \"Solat seseorang daripada kamu dalam keadaan duduk adalah bersamaan dengan separuh solatnya dalam keadaan berdiri.\""
  },
  {
    "id": 34487,
    "hadith_number": 309,
    "tajuk_hadith": "Solat Orang Duduk Separuh Daripada Solat Orang Berdiri",
    "perawi_melayu": "Abdullah ibn Amr ibn al As",
    "english_text": "Yahya related to me from Malik from Ibn Shihab that Abdullah ibn\nAmr ibn al As said, \"When we arrived at Madina we were struck down by\na severe epidemic which debilitated us greatly. The Messenger of\nAllah, may Allah bless him and grant him peace, came out to the people\nwhile they were praying nawafil prayers sitting down. The Messenger of\nAllah, may Allah bless him and grant him peace, said, 'The prayer of\nthe one sitting is equal to only half the prayer of the one standing.'\n\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، أَنَّهُ قَالَ لَمَّا قَدِمْنَا الْمَدِينَةَ نَالَنَا وَبَاءٌ مِنْ وَعْكِهَا شَدِيدٌ فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى النَّاسِ وَهُمْ يُصَلُّونَ فِي سُبْحَتِهِمْ قُعُودًا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ صَلاَةُ الْقَاعِدِ مِثْلُ نِصْفِ صَلاَةِ الْقَائِمِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik daripada Ibn Shihab bahawa Abdullah ibn Amr ibn al As berkata, \"Ketika kami tiba di Madinah, kami dilanda wabak penyakit yang teruk yang melemahkan kami. Rasulullah SAW keluar kepada orang ramai ketika mereka sedang menunaikan solat sunat sambil duduk. Rasulullah SAW bersabda, 'Solat orang yang duduk adalah sama dengan separuh daripada solat orang yang berdiri.'\""
  },
  {
    "id": 34488,
    "hadith_number": 310,
    "tajuk_hadith": "Rasulullah SAW Mengerjakan Solat Sunat Duduk",
    "perawi_melayu": "Al-Muttalib ibn Abi Wadaa as-Sahmi",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from as-Sa'ib ibn\nYazid from al Muttalib ibn Abi Wadaa as-Sahmi that Hafsa, the wife of\nthe Prophet, may Allah bless him and grant him peace, said, \"I never\nsaw the Messenger of Allah, may Allah bless him and grant him peace,\npraying nawafil sitting, until a year before his death, when he began\nto pray them sitting. He would recite the sura with a measured\nslowness so that it would seem to be longer than other suras which\nwere actually longer than it.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنِ السَّائِبِ بْنِ يَزِيدَ، عَنِ الْمُطَّلِبِ بْنِ أَبِي وَدَاعَةَ السَّهْمِيِّ، عَنْ حَفْصَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى فِي سُبْحَتِهِ قَاعِدًا قَطُّ حَتَّى كَانَ قَبْلَ وَفَاتِهِ بِعَامٍ فَكَانَ يُصَلِّي فِي سُبْحَتِهِ قَاعِدًا وَيَقْرَأُ بِالسُّورَةِ فَيُرَتِّلُهَا حَتَّى تَكُونَ أَطْوَلَ مِنْ أَطْوَلَ مِنْهَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada as-Sa'ib ibn Yazid, daripada al-Muttalib ibn Abi Wadaa as-Sahmi bahawa Hafsa, isteri Nabi SAW, berkata, \"Saya tidak pernah melihat Rasulullah SAW mengerjakan solat sunat (nawafil) dalam keadaan duduk sehinggalah setahun sebelum kewafatannya. Ketika itu, baginda mula mengerjakan solat sunat dalam keadaan duduk. Baginda akan membaca surah dengan perlahan-lahan dan teratur sehingga ia kelihatan lebih panjang daripada surah-surah lain yang sebenarnya lebih panjang daripadanya.\""
  },
  {
    "id": 34489,
    "hadith_number": 311,
    "tajuk_hadith": "Solat Malam Rasulullah SAW Ketika Usia Lanjut",
    "perawi_melayu": "A'ishah r.a.",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that A'isha, the wife of the Prophet, may Allah bless him and\ngrant him peace, told him that she had never seen the Messenger of\nAllah, may Allah bless him and grant him peace, doing night prayers\nsitting down until he was getting on in years. He would recite sitting\ndown until when he wanted to go into ruku, he would stand up and\nrecite about thirty or forty ayats and then go into ruku.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا أَخْبَرَتْهُ أَنَّهَا لَمْ تَرَ رَسُولَ اللَّهِ صلى الله عليه وسلم يُصَلِّي صَلاَةَ اللَّيْلِ قَاعِدًا قَطُّ حَتَّى أَسَنَّ فَكَانَ يَقْرَأُ قَاعِدًا حَتَّى إِذَا أَرَادَ أَنْ يَرْكَعَ قَامَ فَقَرَأَ نَحْوًا مِنْ ثَلاَثِينَ أَوْ أَرْبَعِينَ آيَةً ثُمَّ رَكَعَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Hisyam bin Urwah, daripada bapanya, daripada A'ishah, isteri Nabi SAW, bahawa beliau memberitahu bahawa beliau tidak pernah melihat Rasulullah SAW solat malam dalam keadaan duduk sehinggalah baginda semakin lanjut usia. Baginda membaca dalam keadaan duduk sehingga apabila baginda hendak rukuk, baginda akan berdiri dan membaca kira-kira tiga puluh atau empat puluh ayat, kemudian rukuk."
  },
  {
    "id": 34490,
    "hadith_number": 312,
    "tajuk_hadith": "Solat Rasulullah SAW Secara Duduk dan Berdiri (Ketika Bacaan)",
    "perawi_melayu": "Abdullah ibn Yazid al-Madani, Abu'n Nadr, Abu Salama ibn Abd ar-Rahman, daripada A'ishah, isteri Nabi SAW",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْمَدَنِيِّ، وَعَنْ أَبِي النَّضْرِ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي جَالِسًا فَيَقْرَأُ وَهُوَ جَالِسٌ فَإِذَا بَقِيَ مِنْ قِرَاءَتِهِ قَدْرُ مَا يَكُونُ ثَلاَثِينَ أَوْ أَرْبَعِينَ آيَةً قَامَ فَقَرَأَ وَهُوَ قَائِمٌ ثُمَّ رَكَعَ وَسَجَدَ ثُمَّ صَنَعَ فِي الرَّكْعَةِ الثَّانِيَةِ مِثْلَ ذَلِكَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abdullah ibn Yazid al-Madani, dan daripada Abu'n Nadr, daripada Abu Salama ibn Abd ar-Rahman, daripada A'ishah, isteri Nabi SAW bahawa Rasulullah SAW solat secara duduk. Baginda membaca dalam keadaan duduk, kemudian, apabila tinggal lebih kurang tiga puluh atau empat puluh ayat daripada bacaannya, baginda bangun dan membaca dalam keadaan berdiri, kemudian rukuk dan sujud. Baginda melakukan perkara yang sama dalam rakaat kedua."
  },
  {
    "id": 34491,
    "hadith_number": 313,
    "tajuk_hadith": "Solat Sunat Secara Duduk",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ، وَسَعِيدَ بْنَ الْمُسَيَّبِ، كَانَا يُصَلِّيَانِ النَّافِلَةَ وَهُمَا مُحْتَبِيَانِ ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku daripada Malik, bahawa telah sampai kepadanya bahawa Urwah ibn az-Zubayr dan Said ibn al-Musayyab, mereka berdua solat sunat dalam keadaan duduk."
  },
  {
    "id": 34492,
    "hadith_number": 314,
    "tajuk_hadith": "Perintah A'ishah untuk Menulis Ayat Mengenai Solat",
    "perawi_melayu": "Abu Yunus, mawla A'ishah, umm al-muminin",
    "english_text": "Yahya related to me from Malik from Zayd ibn Aslam from al-Qaqa\nibn Hakim that Abu Yunus, the mawla of A'isha, umm al-muminin said,\n''A'isha ordered  me to write out a Qur'an for her. She said, 'When\nyou reach this ayat, let me know, \"Guard the prayers carefully and the\nmiddle prayer and stand obedient to Allah.\" ' When I reached it I told\nher, and she dictated to me, 'Guard the prayers carefully and the\nmiddle prayer and the asr prayer and stand obedient to Allah.'  A'isha\nsaid, 'I heard it from the Messenger of Allah, may Allah bless him and\ngrant him peace.' \"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنِ الْقَعْقَاعِ بْنِ حَكِيمٍ، عَنْ أَبِي يُونُسَ، مَوْلَى عَائِشَةَ أُمِّ الْمُؤْمِنِينَ أَنَّهُ قَالَ أَمَرَتْنِي عَائِشَةُ أَنْ أَكْتُبَ لَهَا مُصْحَفًا ثُمَّ قَالَتْ إِذَا بَلَغْتَ هَذِهِ الآيَةَ فَآذِنِّي ‏{‏حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلاَةِ الْوُسْطَى وَقُومُوا لِلَّهِ قَانِتِينَ‏}‏ فَلَمَّا بَلَغْتُهَا آذَنْتُهَا فَأَمْلَتْ عَلَىَّ حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلاَةِ الْوُسْطَى وَصَلاَةِ الْعَصْرِ وَقُومُوا لِلَّهِ قَانِتِينَ قَالَتْ عَائِشَةُ سَمِعْتُهَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Zayd ibn Aslam daripada al-Qaqa' ibn Hakim bahawa Abu Yunus, mawla A'ishah, umm al-muminin berkata, ''A'ishah memerintahkan saya untuk menuliskan al-Quran untuknya. Dia berkata, 'Apabila kamu sampai pada ayat ini, beritahu saya, \"Peliharalah solat-solat dan solat pertengahan serta berdirilah (dalam solat) kerana Allah dengan taat.\" ' Apabila saya sampai kepadanya, saya memberitahunya, dan dia mengarahkan saya, 'Peliharalah solat-solat dan solat pertengahan dan solat Asar serta berdirilah (dalam solat) kerana Allah dengan taat.' A'ishah berkata, 'Saya mendengarnya daripada Rasulullah, semoga Allah memberkatinya dan mengurniakannya kesejahteraan.'\""
  },
  {
    "id": 34493,
    "hadith_number": 315,
    "tajuk_hadith": "Hafsah R.A. Membetulkan Ayat Mengenai Solat",
    "perawi_melayu": "Zayd ibn Aslam, daripada Amr ibn Rafi",
    "english_text": "Yahya related to me from Malik from Zayd ibn Aslam that Amr ibn Rafi said, \"I was writing a Qur'an for Hafsa, umm al-muminin, and she said, 'When you reach this ayat, let me know, \"Guard the prayers carefully and the middle prayer and stand obedient to Allah.\" When I reached it I told her and she dictated to me, 'Guard the prayers carefully and the middle prayer and the asr prayer and stand obedient to Allah.' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَمْرِو بْنِ رَافِعٍ، أَنَّهُ قَالَ كُنْتُ أَكْتُبُ مُصْحَفًا لِحَفْصَةَ أُمِّ الْمُؤْمِنِينَ فَقَالَتْ إِذَا بَلَغْتَ هَذِهِ الآيَةَ فَآذِنِّي ‏{‏حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلاَةِ الْوُسْطَى وَقُومُوا لِلَّهِ قَانِتِينَ ‏}‏ فَلَمَّا بَلَغْتُهَا آذَنْتُهَا فَأَمْلَتْ عَلَىَّ حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلاَةِ الْوُسْطَى وَصَلاَةِ الْعَصْرِ وَقُومُوا لِلَّهِ قَانِتِينَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Zayd ibn Aslam bahawa Amr ibn Rafi berkata, \"Aku sedang menulis al-Quran untuk Hafsah, umm al-muminin, dan dia berkata, 'Apabila kamu sampai pada ayat ini, beritahu aku, \"Peliharalah solat-solat dan solat wusta serta berdirilah untuk Allah dengan taat.\" Apabila aku sampai padanya, aku memberitahunya dan dia mendiktekan kepadaku, 'Peliharalah solat-solat dan solat wusta serta solat Asar dan berdirilah untuk Allah dengan taat.' \""
  },
  {
    "id": 34494,
    "hadith_number": 316,
    "tajuk_hadith": "Solat Tengahari (Zuhur) adalah Solat Pertengahan",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Da'ud ibn al-Husayn that Ibn\nYarbu al-Makhzumi said, \"I heard Zayd ibn Thabit say, 'The middle\nprayer is the prayer of dhuhr.' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، عَنِ ابْنِ يَرْبُوعٍ الْمَخْزُومِيِّ، أَنَّهُ قَالَ سَمِعْتُ زَيْدَ بْنَ ثَابِتٍ، يَقُولُ الصَّلاَةُ الْوُسْطَى صَلاَةُ الظُّهْرِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik daripada Da'ud ibn al-Husayn bahawa Ibn Yarbu al-Makhzumi berkata, \"Saya mendengar Zayd ibn Thabit berkata, 'Solat pertengahan adalah solat Zuhur.'\""
  },
  {
    "id": 34495,
    "hadith_number": 317,
    "tajuk_hadith": "Solat Pertengahan: Solat Subuh",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik that he had heard that AIi ibn Abi\nTalib and Abdullah ibn Abbas used to say, \"The middle prayer is the\nprayer of subh.\"\n\n\nMalik said, \"Out of all that I have heard\nabout the matter, I prefer what Ali ibn Abi Talib and Abdullah ibn\nAbbas said.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ، وَعَبْدَ اللَّهِ بْنَ عَبَّاسٍ، كَانَا يَقُولاَنِ الصَّلاَةُ الْوُسْطَى صَلاَةُ الصُّبْحِ ‏.‏ قَالَ مَالِكٌ وَقَوْلُ عَلِيٍّ وَابْنِ عَبَّاسٍ أَحَبُّ مَا سَمِعْتُ إِلَىَّ فِي ذَلِكَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa beliau mendengar bahawa Ali ibn Abi Talib dan Abdullah ibn Abbas berkata, \"Solat pertengahan adalah solat Subuh.\" Malik berkata, \"Daripada semua yang saya dengar mengenai perkara ini, saya lebih suka apa yang dikatakan oleh Ali ibn Abi Talib dan Abdullah ibn Abbas.\""
  },
  {
    "id": 34496,
    "hadith_number": 318,
    "tajuk_hadith": "Solat Rasulullah SAW dengan Satu Pakaian",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Hisham ibn Urwa, daripada bapanya, bahawa Umar ibn Abi Salama",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that Umar ibn Abi Salama saw the Messenger of Allah, may Allah\nbless him and grant him peace, praying in one garment in the house of\nUmm Salama. He was completely covered by it, and had put both ends\nover his shoulders.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ، أَنَّهُ رَأَى رَسُولَ اللَّهِ صلى الله عليه وسلم يُصَلِّي فِي ثَوْبٍ وَاحِدٍ مُشْتَمِلاً بِهِ فِي بَيْتِ أُمِّ سَلَمَةَ وَاضِعًا طَرَفَيْهِ عَلَى عَاتِقَيْهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Hisham ibn Urwa, daripada bapanya bahawa Umar ibn Abi Salama melihat Rasulullah SAW solat dengan satu pakaian di rumah Umm Salama. Baginda menutup seluruh tubuh dengan pakaian itu dan meletakkan kedua-dua hujungnya di atas bahu baginda."
  },
  {
    "id": 34497,
    "hadith_number": 319,
    "tajuk_hadith": "Solat dengan Satu Pakaian",
    "perawi_melayu": "Abu Hurayra",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Said ibn al-Musayyab from Abu Hurayra that some one asked the Messenger of Allah, may Allah bless him and grant him peace about praying in one garment. The Messenger of Allah, may Allah bless him and grant him peace, said, \"Do you all have two garments?\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ سَائِلاً، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الصَّلاَةِ فِي ثَوْبٍ وَاحِدٍ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَوَلِكُلِّكُمْ ثَوْبَانِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Said ibn al-Musayyab, daripada Abu Hurayra bahawa seseorang bertanya kepada Rasulullah ﷺ tentang solat dengan satu pakaian. Rasulullah ﷺ bersabda, \"Adakah kamu semua mempunyai dua pakaian?\""
  },
  {
    "id": 34498,
    "hadith_number": 320,
    "tajuk_hadith": "Solat dengan Satu Pakaian",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Ibn Shihab that Said ibn al-\nMusayyab said that Abu Hurayra was asked, \"May a man pray in one\ngarment?\" He said, \"Yes.\" The man then said to him \"Do you do that?\"\nand he replied, \"Yes, I pray in one garment while my clothes are on\nthe clothes-rack.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ سُئِلَ أَبُو هُرَيْرَةَ هَلْ يُصَلِّي الرَّجُلُ فِي ثَوْبٍ وَاحِدٍ فَقَالَ نَعَمْ ‏.‏ فَقِيلَ لَهُ هَلْ تَفْعَلُ أَنْتَ ذَلِكَ فَقَالَ نَعَمْ إِنِّي لأُصَلِّي فِي ثَوْبٍ وَاحِدٍ وَإِنَّ ثِيَابِي لَعَلَى الْمِشْجَبِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Ibn Shihab bahawa Said ibn al-Musayyab berkata bahawa Abu Hurairah ditanya, \"Bolehkah seseorang lelaki solat dengan satu pakaian sahaja?\" Beliau menjawab, \"Ya.\" Lelaki itu kemudian berkata kepadanya, \"Adakah kamu berbuat demikian?\" dan beliau menjawab, \"Ya, saya solat dengan satu pakaian sahaja sedangkan pakaian saya yang lain berada di rak pakaian.\""
  },
  {
    "id": 34499,
    "hadith_number": 321,
    "tajuk_hadith": "Jabir bin Abdullah Solat dengan Satu Pakaian",
    "perawi_melayu": "Malik",
    "english_text": "Yahya related to me from Malik that he had heard that Jabir ibn\nAbdullah used to pray in one garment.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ، كَانَ يُصَلِّي فِي الثَّوْبِ الْوَاحِدِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa dia pernah mendengar bahawa Jabir bin Abdullah pernah solat dengan hanya memakai sehelai pakaian."
  },
  {
    "id": 34500,
    "hadith_number": 322,
    "tajuk_hadith": "Solat dengan Satu Baju Panjang",
    "perawi_melayu": "Rabia ibn Abi Abd ar-Rahman (melalui Yahya dan Malik)",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّ مُحَمَّدَ بْنَ عَمْرِو بْنِ حَزْمٍ، كَانَ يُصَلِّي فِي الْقَمِيصِ الْوَاحِدِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik, daripada Rabia ibn Abi Abd ar-Rahman bahawa Muhammad ibn Amr ibn Hazm pernah bersolat dengan hanya memakai sehelai baju panjang."
  },
  {
    "id": 34501,
    "hadith_number": 323,
    "tajuk_hadith": "Solat dengan Satu Pakaian",
    "perawi_melayu": "Jabir ibn Abdullah",
    "english_text": "Yahya related to me from Malik that he had heard from Jabir ibn\nAbdullah that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Let anyone who cannot find two garments pray in one\ngarment and wrap himself in it, and if the garment is short, let him\nwrap it around his waist.\"\n\n\nMalik said, \"In my view it is\npreferable for someone who prays in a single shirt to put a garment or\na turban over his shoulders.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ لَمْ يَجِدْ ثَوْبَيْنِ فَلْيُصَلِّي فِي ثَوْبٍ وَاحِدٍ مُلْتَحِفًا بِهِ فَإِنْ كَانَ الثَّوْبُ قَصِيرًا فَلْيَتَّزِرْ بِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik bahawa dia telah mendengar daripada Jabir ibn Abdullah bahawa Rasulullah SAW bersabda, \"Sesiapa yang tidak mendapati dua helai pakaian, maka hendaklah dia solat dengan satu helai pakaian dan selimutkan dengannya. Jika pakaian itu pendek, hendaklah dia menutupnya di sekeliling pinggangnya.\" Malik berkata, \"Pada pandangan saya, adalah lebih baik bagi seseorang yang solat dengan sehelai baju untuk meletakkan pakaian atau serban di atas bahunya.\""
  },
  {
    "id": 34502,
    "hadith_number": 324,
    "tajuk_hadith": "Solat A'ishah (r.a.) dengan Pakaian",
    "perawi_melayu": "Yahya meriwayatkan kepada saya dari Malik",
    "english_text": "Yahya related to me from Malik that he had heard that A'isha, the\nwife of the Prophet, may Allah bless him and grant him peace, used to\npray in a shift and head-covering.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَانَتْ تُصَلِّي فِي الدِّرْعِ وَالْخِمَارِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik bahawa beliau telah mendengar bahawa A'ishah, isteri Nabi s.a.w., pernah solat dengan memakai jubah (baju kurung) dan penutup kepala."
  },
  {
    "id": 34503,
    "hadith_number": 325,
    "tajuk_hadith": "Pakaian Wanita dalam Solat",
    "perawi_melayu": "Muhammad ibn Zayd ibn Qunfudh (daripada ibunya) meriwayatkan daripada Umm Salama, isteri Nabi ﷺ",
    "english_text": "Yahya related to me from Malik from Muhammad ibn Zayd ibn Qunfudh\nthat his mother asked Umm Salama, the wife of the Prophet, may Allah\nbless him and grant him peace, \"What clothes can a woman wear in\nprayer?\" She said, \"She can pray in a shift that reaches down and\ncovers the top of her feet.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ زَيْدِ بْنِ قُنْفُذٍ، عَنْ أُمِّهِ، أَنَّهَا سَأَلَتْ أُمَّ سَلَمَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم مَاذَا تُصَلِّي فِيهِ الْمَرْأَةُ مِنَ الثِّيَابِ فَقَالَتْ تُصَلِّي فِي الْخِمَارِ وَالدِّرْعِ السَّابِغِ إِذَا غَيَّبَ ظُهُورَ قَدَمَيْهَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Muhammad ibn Zayd ibn Qunfudh bahawa ibunya bertanya kepada Umm Salama, isteri Nabi ﷺ, \"Pakaian apakah yang boleh dipakai oleh seorang wanita dalam solat?\" Beliau menjawab, \"Dia boleh solat dengan memakai khimar (tudung kepala) dan dir' (baju labuh) yang menutup bahagian atas kakinya.\""
  },
  {
    "id": 34504,
    "hadith_number": 326,
    "tajuk_hadith": "Solat Maimunah dalam Pakaian Solat",
    "perawi_melayu": "Daripada sumber yang dipercayai, daripada Bukayr ibn Abdullah ibn al-Ashajj, daripada Busr ibn Said, daripada Ubaydullah ibn al-Aswad al-Khawlani",
    "english_text": "Yahya related to me from Malik from a reliable source from Bukayr ibn Abdullah ibn al-Ashajj from Busr ibn Said that when Ubaydullah ibn al-Aswad al-Khawlani was in the room of Maimuna, the wife of the Prophet, may Allah bless him and grant him peace, she used to pray in a shift and head-covering, without a waist-wrapper.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ الثِّقَةِ، عِنْدَهُ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ الأَسْوَدِ الْخَوْلاَنِيِّ، وَكَانَ، فِي حَجْرِ مَيْمُونَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ مَيْمُونَةَ كَانَتْ تُصَلِّي فِي الدِّرْعِ وَالْخِمَارِ لَيْسَ عَلَيْهَا إِزَارٌ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada sumber yang dipercayai, daripada Bukayr ibn Abdullah ibn al-Ashajj, daripada Busr ibn Said bahawa ketika Ubaydullah ibn al-Aswad al-Khawlani berada di dalam bilik Maimuna, isteri Nabi Muhammad SAW, beliau solat dengan memakai baju kurung dan tudung kepala, tanpa memakai kain bawah."
  },
  {
    "id": 34505,
    "hadith_number": 327,
    "tajuk_hadith": "Wanita Boleh Solat dengan Baju Labuh dan Tudung",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Hisham ibn Urwa daripada bapanya",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that a woman asked him for a decision, saying, \"Waist-wrappers\nare painful to me. Can I pray in a shift and head-covering?\"  He\nreplied, \"Yes, if the shift is long.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ امْرَأَةً، اسْتَفْتَتْهُ فَقَالَتْ إِنَّ الْمِنْطَقَ يَشُقُّ عَلَىَّ أَفَأُصَلِّي فِي دِرْعٍ وَخِمَارٍ فَقَالَ نَعَمْ إِذَا كَانَ الدِّرْعُ سَابِغًا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Hisham ibn Urwa daripada bapanya, bahawa seorang wanita meminta fatwa daripadanya, berkata, \"Pemakaian tali pinggang menyakitkan saya. Bolehkah saya solat dengan memakai baju labuh dan tudung?\" Beliau menjawab, \"Ya, jika baju tersebut labuh.\""
  }
]
