[
  {
    "id": 35507,
    "hadith_number": 1329,
    "tajuk_hadith": "Larangan Bercampur Gaul Akibat Susuan",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Abdullah bin Abi Bakar, daripada Amra binti Abdur Rahman, bahawa Aisyah, Ummul Mukminin, memberitahunya bahawa Rasulullah SAW berada di sisinya dan beliau mendengar suara seorang lelaki meminta izin untuk memasuki rumah Hafsah. Aisyah berkata bahawa beliau berkata, \"Wahai Rasulullah, ini seorang lelaki meminta izin untuk memasuki rumah tuan!\" Rasulullah SAW bersabda, \"Aku sangkakan ia fulan.\" (merujuk kepada bapa saudara susuan Hafsah). Aisyah berkata, \"Wahai Rasulullah, andai fulan masih hidup (merujuk kepada bapa saudara susuannya), bolehkah dia memasuki tempatku?\" Rasulullah SAW bersabda, \"Ya. Sesungguhnya susuan mengharamkan sebagaimana kelahiran mengharamkan.\"",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ، أَخْبَرَتْهَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ عِنْدَهَا وَأَنَّهَا سَمِعَتْ صَوْتَ رَجُلٍ يَسْتَأْذِنُ فِي بَيْتِ حَفْصَةَ قَالَتْ عَائِشَةُ فَقُلْتُ يَا رَسُولَ اللَّهِ هَذَا رَجُلٌ يَسْتَأْذِنُ فِي بَيْتِكَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أُرَاهُ فُلاَنًا ‏\"‏ ‏.‏ لِعَمٍّ لِحَفْصَةَ مِنَ الرَّضَاعَةِ ‏.‏ فَقَالَتْ عَائِشَةُ يَا رَسُولَ اللَّهِ لَوْ كَانَ فُلاَنٌ حَيًّا - لِعَمِّهَا مِنَ الرَّضَاعَةِ - دَخَلَ عَلَىَّ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَعَمْ إِنَّ الرَّضَاعَةَ تُحَرِّمُ مَا تُحَرِّمُ الْوِلاَدَةُ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abdullah bin Abi Bakar, daripada Amra binti Abdur Rahman, bahawa Aisyah, Ummul Mukminin, memberitahunya bahawa Rasulullah SAW berada di sisinya dan beliau mendengar suara seorang lelaki meminta izin untuk memasuki rumah Hafsah. Aisyah berkata bahawa beliau berkata, \"Wahai Rasulullah, ini seorang lelaki meminta izin untuk memasuki rumah tuan!\" Rasulullah SAW bersabda, \"Aku sangkakan ia fulan.\" (merujuk kepada bapa saudara susuan Hafsah). Aisyah berkata, \"Wahai Rasulullah, andai fulan masih hidup (merujuk kepada bapa saudara susuannya), bolehkah dia memasuki tempatku?\" Rasulullah SAW bersabda, \"Ya. Sesungguhnya susuan mengharamkan sebagaimana kelahiran mengharamkan."
  },
  {
    "id": 35508,
    "hadith_number": 1330,
    "tajuk_hadith": "Hukum Perkahwinan dengan Saudara Susuan",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Hisyam bin Urwah, daripada bapanya, daripada Aisyah Ummul Mukminin",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّهَا قَالَتْ جَاءَ عَمِّي مِنَ الرَّضَاعَةِ يَسْتَأْذِنُ عَلَىَّ فَأَبَيْتُ أَنْ آذَنَ لَهُ عَلَىَّ حَتَّى أَسْأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَأَلْتُهُ عَنْ ذَلِكَ فَقَالَ ‏\"‏ إِنَّهُ عَمُّكِ فَأْذَنِي لَهُ ‏\"‏ ‏.‏ قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّمَا أَرْضَعَتْنِي الْمَرْأَةُ وَلَمْ يُرْضِعْنِي الرَّجُلُ ‏.‏ فَقَالَ ‏\"‏ إِنَّهُ عَمُّكِ فَلْيَلِجْ عَلَيْكِ ‏\"‏ ‏.‏ قَالَتْ عَائِشَةُ وَذَلِكَ بَعْدَ مَا ضُرِبَ عَلَيْنَا الْحِجَابُ ‏.‏ وَقَالَتْ عَائِشَةُ يَحْرُمُ مِنَ الرَّضَاعَةِ مَا يَحْرُمُ مِنَ الْوِلاَدَةِ ‏.‏",
    "malay_translation": "Aisyah Ummul Mukminin berkata, \"Bapa saudara susuan saya datang meminta izin untuk masuk menemui saya. Saya enggan memberi izin sehingga saya bertanya kepada Rasulullah SAW mengenainya.  Rasulullah SAW pun datang, lalu saya bertanya kepada baginda. Baginda bersabda,  'Dia adalah bapa saudara kamu, maka izinkanlah dia.' Saya berkata, 'Wahai Rasulullah, yang menyusukan saya hanyalah perempuan, bukan lelaki.' Baginda bersabda, 'Dia adalah bapa saudara kamu, maka izinkanlah dia masuk.'\" \n\nAisyah berkata, \"Perkara ini berlaku setelah hijab dikenakan kepada kami.\" \nAisyah menambah, \"Apa yang diharamkan melalui pertalian darah juga diharamkan melalui persusuan.\""
  },
  {
    "id": 35509,
    "hadith_number": 1331,
    "tajuk_hadith": "Ziarah Saudara Susuan Selepas Hijab Diturunkan",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Ibn Shihab, dari Urwa bin az-Zubayr, dari Aisyah Ummul Mukminin",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّهَا أَخْبَرَتْهُ أَنَّ أَفْلَحَ أَخَا أَبِي الْقُعَيْسِ جَاءَ يَسْتَأْذِنُ عَلَيْهَا وَهُوَ عَمُّهَا مِنَ الرَّضَاعَةِ بَعْدَ أَنْ أُنْزِلَ الْحِجَابُ قَالَتْ فَأَبَيْتُ أَنْ آذَنَ لَهُ عَلَىَّ فَلَمَّا جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَخْبَرْتُهُ بِالَّذِي صَنَعْتُ فَأَمَرَنِي أَنْ آذَنَ لَهُ عَلَىَّ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Urwa bin az-Zubayr, daripada Aisyah Ummul Mukminin, bahawa beliau memberitahunya bahawa Aflah, saudara lelaki Abu al-Qays datang meminta izin untuk melawatnya setelah hijab diturunkan.  Beliau adalah bapa saudara Aisyah dari susuan. Aisyah berkata, \"Aku enggan memberi izin kepadanya.  Apabila Rasulullah SAW datang, aku memberitahunya apa yang telah aku lakukan, maka baginda menyuruhku memberi izin kepadanya.\" "
  },
  {
    "id": 35510,
    "hadith_number": 1332,
    "tajuk_hadith": "Susuan dan Haram Perkahwinan",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Thawr ibn Zayd ad-Dili, dari Abdullah ibn Abbas",
    "english_text": "Yahya related to me from Malik from Thawr ibn Zayd ad-Dili that\nAbdullah ibn Abbas said, \"The milk which a child under two years old\nsucks, even if it is only one suck, makes the foster relatives haram.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّهُ كَانَ يَقُولُ مَا كَانَ فِي الْحَوْلَيْنِ وَإِنْ كَانَ مَصَّةً وَاحِدَةً فَهُوَ يُحَرِّمُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Thawr ibn Zayd ad-Dili, daripada Abdullah ibn Abbas bahawa beliau berkata: \"Susu yang diminum oleh anak yang berumur kurang daripada dua tahun, walaupun hanya sekali menyusu, ia mengharamkan pertalian susuan.\""
  },
  {
    "id": 35511,
    "hadith_number": 1333,
    "tajuk_hadith": "Perkahwinan Antara Anak Susuan Daripada Dua Isteri",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Amr ibn ash-Sharid",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Amr ibn ash-\nSharid that Abdullah ibn Abbas was asked whether, if a man had two\nwives, and one of them nursed a slave-boy, and the other had nursed a\nslave-girl, could the slave-boy marry the slave-girl. He said, \"No.\nThe husband is the same.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَمْرِو بْنِ الشَّرِيدِ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، سُئِلَ عَنْ رَجُلٍ، كَانَتْ لَهُ امْرَأَتَانِ فَأَرْضَعَتْ إِحْدَاهُمَا غُلاَمًا وَأَرْضَعَتِ الأُخْرَى جَارِيَةً فَقِيلَ لَهُ هَلْ يَتَزَوَّجُ الْغُلاَمُ الْجَارِيَةَ فَقَالَ لاَ اللِّقَاحُ وَاحِدٌ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Ibn Shihab, dari Amr bin asy-Sharid bahawa Abdullah bin Abbas ditanya mengenai seorang lelaki yang mempunyai dua orang isteri. Seorang isterinya menyusukan seorang budak lelaki dan isterinya yang lain menyusukan seorang hamba perempuan.  Lalu ditanya kepadanya: \"Bolehkah budak lelaki itu mengahwini hamba perempuan itu?\"  Beliau menjawab: \"Tidak.  Perkahwinan (asal usul) mereka adalah satu.\" "
  },
  {
    "id": 35512,
    "hadith_number": 1334,
    "tajuk_hadith": "Saudara Susuan",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Nafi' bahawa Abdullah bin Umar berkata,",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid, \"There is no kinship by suckling except for a person who is\nnursed when he is small. There is no kinship by suckling over the age\nof two years.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ لاَ رَضَاعَةَ إِلاَّ لِمَنْ أُرْضِعَ فِي الصِّغَرِ وَلاَ رَضَاعَةَ لِكَبِيرٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Nafi' bahawa Abdullah bin Umar berkata, \"Tiada pertalian saudara melalui penyusuan melainkan bagi mereka yang disusukan ketika kecil.  Tiada pertalian saudara melalui penyusuan bagi mereka yang berusia lebih daripada dua tahun.\""
  },
  {
    "id": 35513,
    "hadith_number": 1335,
    "tajuk_hadith": "Kisah Menyusukan Salim supaya Dapat Berjumpa Aisyah",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Nafi', bahawa Salim bin Abdullah bin Umar memberitahu bahawa Aisyah Ummul Mukminin telah menghantarnya ketika masih menyusu kepada saudari perempuannya, Umm Kulthum binti Abi Bakar As-Siddiq, lalu berkata, \"Susukanlah dia sepuluh kali supaya dia dapat masuk menziarahiku.\"",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ سَالِمَ بْنَ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَخْبَرَهُ أَنَّ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ أَرْسَلَتْ بِهِ وَهُوَ يَرْضَعُ إِلَى أُخْتِهَا أُمِّ كُلْثُومٍ بِنْتِ أَبِي بَكْرٍ الصِّدِّيقِ فَقَالَتْ أَرْضِعِيهِ عَشْرَ رَضَعَاتٍ حَتَّى يَدْخُلَ عَلَىَّ ‏.‏ قَالَ سَالِمٌ فَأَرْضَعَتْنِي أُمُّ كُلْثُومٍ ثَلاَثَ رَضَعَاتٍ ثُمَّ مَرِضَتْ فَلَمْ تُرْضِعْنِي غَيْرَ ثَلاَثِ رَضَعَاتٍ فَلَمْ أَكُنْ أَدْخُلُ عَلَى عَائِشَةَ مِنْ أَجْلِ أَنَّ أُمَّ كُلْثُومٍ لَمْ تُتِمَّ لِي عَشْرَ رَضَعَاتٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Nafi', bahawa Salim bin Abdullah bin Umar memberitahunya bahawa Aisyah Ummul Mukminin telah menghantarnya ketika sedang menyusu kepada adik perempuannya, Umm Kulthum binti Abi Bakar As-Siddiq, lalu berkata, \"Susukanlah dia sepuluh kali supaya dia dapat masuk menziarahiku.\" Salim berkata, \"Umm Kulthum menyusukan saya tiga kali, kemudian dia jatuh sakit, lalu dia hanya menyusukan saya tiga kali sahaja.  Saya tidak dapat masuk menziarahi Aisyah kerana Umm Kulthum tidak menghabiskan sepuluh kali penyusuan untuk saya.\""
  },
  {
    "id": 35514,
    "hadith_number": 1336,
    "tajuk_hadith": "Hafsah Mengirim Asim untuk Menyusu Kepada Fatimah",
    "perawi_melayu": "Yahya daripada Malik daripada Nafi' daripada Safiyyah binti Abi Ubayd",
    "english_text": "Yahya related to me from Malik from Nafi that Safiyya bint Abi\nUbayd told him that Hafsa, umm al-muminin, sent Asim ibn Abdullah ibn\nSad to her sister Fatima bint Umar ibn al-Khattab for her to suckle\nhim ten times so that he could come in to see her. She did it, so he\nused to come in to see her.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ صَفِيَّةَ بِنْتَ أَبِي عُبَيْدٍ، أَخْبَرَتْهُ أَنَّ حَفْصَةَ أُمَّ الْمُؤْمِنِينَ أَرْسَلَتْ بِعَاصِمِ بْنِ عَبْدِ اللَّهِ بْنِ سَعْدٍ إِلَى أُخْتِهَا فَاطِمَةَ بِنْتِ عُمَرَ بْنِ الْخَطَّابِ تُرْضِعُهُ عَشْرَ رَضَعَاتٍ لِيَدْخُلَ عَلَيْهَا وَهُوَ صَغِيرٌ يَرْضَعُ فَفَعَلَتْ فَكَانَ يَدْخُلُ عَلَيْهَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Nafi', bahawa Safiyyah binti Abi Ubayd memberitahunya bahawa Hafsah, Ummul Mukminin, telah menghantar Asim bin Abdullah bin Saad kepada saudari Fatimah binti Umar bin al-Khattab supaya menyusukannya sebanyak sepuluh kali supaya dia (Asim) dibolehkan masuk menjenguknya.  Fatimah telah melakukannya, maka Asim selalu masuk menjenguknya."
  },
  {
    "id": 35515,
    "hadith_number": 1337,
    "tajuk_hadith": "Peraturan Menyusukan dalam Hubungan Persaudaraan",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Abd ar-Rahman ibn al-Qasim, daripada bapanya",
    "english_text": "Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nthat his father told him that A'isha, the wife of the Prophet, may\nAllah bless him and grant him peace, admitted those whom her sisters\nand the daughters of her brother had nursed, and she did not admit\nthose who were nursed by the wives of her brothers.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، أَنَّهُ أَخْبَرَهُ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَانَ يَدْخُلُ عَلَيْهَا مَنْ أَرْضَعَتْهُ أَخَوَاتُهَا وَبَنَاتُ أَخِيهَا وَلاَ يَدْخُلُ عَلَيْهَا مَنْ أَرْضَعَهُ نِسَاءُ إِخْوَتِهَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Abd ar-Rahman bin al-Qasim, dari bapanya, bahawa Aisyah, isteri Nabi SAW, menerima sesiapa yang disusukan oleh saudara-saudaranya perempuan dan anak-anak perempuan abangnya, tetapi tidak menerima sesiapa yang disusukan oleh isteri-isteri saudara lelakinya."
  },
  {
    "id": 35516,
    "hadith_number": 1338,
    "tajuk_hadith": "Hukum Menyusu dan Tempoh Haramnya",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Ibrahim bin Uqbah",
    "english_text": "Yahya related to me from Malik that Ibrahim ibn Uqba asked Said\nibn al-Musayyab about suckling. Said said, \"All that occurs in the\nfirst two years, even if it is only a drop, makes haram. Whatever is\nafter two years, is only food that is eaten.\"\n\n\nIbrahim ibn\nUqba said, ''Then I asked Urwa ibn az-Zubayr and he told me the same\nas what Said ibn al-Musayyab said.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِبْرَاهِيمَ بْنِ عُقْبَةَ، أَنَّهُ سَأَلَ سَعِيدَ بْنَ الْمُسَيَّبِ عَنِ الرَّضَاعَةِ، فَقَالَ سَعِيدٌ كُلُّ مَا كَانَ فِي الْحَوْلَيْنِ وَإِنْ كَانَتْ قَطْرَةً وَاحِدَةً فَهُوَ يُحَرِّمُ وَمَا كَانَ بَعْدَ الْحَوْلَيْنِ فَإِنَّمَا هُوَ طَعَامٌ يَأْكُلُهُ ‏.‏ قَالَ إِبْرَاهِيمُ بْنُ عُقْبَةَ ثُمَّ سَأَلْتُ عُرْوَةَ بْنَ الزُّبَيْرِ فَقَالَ مِثْلَ مَا قَالَ سَعِيدُ بْنُ الْمُسَيَّبِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa Ibrahim bin Uqbah bertanya kepada Said bin al-Musayyab tentang penyusuan. Said berkata, \"Segala sesuatu yang berlaku dalam tempoh dua tahun pertama, walaupun hanya setitis, ia mengharamkan. Apa yang berlaku selepas dua tahun, hanyalah makanan yang dimakan.\" \n\nIbrahim bin Uqbah berkata, \"Kemudian aku bertanya kepada Urwah bin az-Zubair, dan dia memberitahu aku perkara yang sama seperti yang dikatakan oleh Said bin al-Musayyab.\""
  },
  {
    "id": 35517,
    "hadith_number": 1339,
    "tajuk_hadith": "Tempoh Menyusu dan Hubungan Darah",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said, bahawa Said bin al-Musayyab berkata",
    "english_text": "Yahya related to me from Malik that Yahya ibn Said said that he\nheard Said ibn al-Musayyab say, \"Suckling is only while the child is\nin the cradle. If not, it does not cause flesh and blood relations.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ لاَ رَضَاعَةَ إِلاَّ مَا كَانَ فِي الْمَهْدِ وَإِلاَّ مَا أَنْبَتَ اللَّحْمَ وَالدَّمَ ‏.‏",
    "malay_translation": "Hanya penyusuan yang berlaku ketika anak masih dalam buaian sahaja yang dikira sebagai hubungan susuan.  Jika tidak, ia tidak menyebabkan hubungan darah."
  },
  {
    "id": 35518,
    "hadith_number": 1340,
    "tajuk_hadith": "Penyusuan Susu Ibu dan Hukum Haram",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Ibnu Syihab",
    "english_text": "Yahya related to me from Malik from Ibn Shihab that he said,\n\"Suckling however little or much, makes haram. Kinship by suckling\nmakes men mahram.\"\n\n\nYahya said that he had heard Malik say,\n\"Suckling, however little or much when it is in the first two years,\nmakes haram. As for what is after the first two years, little or much,\nit does not make anything haram. It is like food.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ كَانَ يَقُولُ الرَّضَاعَةُ قَلِيلُهَا وَكَثِيرُهَا تُحَرِّمُ وَالرَّضَاعَةُ مِنْ قِبَلِ الرِّجَالِ تُحَرِّمُ ‏.‏ قَالَ يَحْيَى وَسَمِعْتُ مَالِكًا يَقُولُ الرَّضَاعَةُ قَلِيلُهَا وَكَثِيرُهَا إِذَا كَانَ فِي الْحَوْلَيْنِ تُحَرِّمُ فَأَمَّا مَا كَانَ بَعْدَ الْحَوْلَيْنِ فَإِنَّ قَلِيلَهُ وَكَثِيرَهُ لاَ يُحَرِّمُ شَيْئًا وَإِنَّمَا هُوَ بِمَنْزِلَةِ الطَّعَامِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Ibnu Syihab bahawa beliau berkata, \"Penyusuan susu ibu, sedikit atau banyak, menjadikan haram.  Hubungan kekeluargaan melalui penyusuan menjadikan lelaki mahram.\"\n\nYahya berkata bahawa beliau mendengar Malik berkata, \"Penyusuan susu ibu, sedikit atau banyak, jika dilakukan dalam tempoh dua tahun pertama, menjadikan haram.  Adapun selepas dua tahun pertama, sedikit atau banyak, ia tidak mengharamkan apa-apa. Ia seperti makanan biasa.\""
  },
  {
    "id": 35519,
    "hadith_number": 1341,
    "tajuk_hadith": "Merawat Anak Angkat dan Hukum Menyusukan Orang Dewasa",
    "perawi_melayu": "Yahya, Malik, dan Ibnu Shihab",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ سُئِلَ عَنْ رَضَاعَةِ الْكَبِيرِ، فَقَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ أَبَا حُذَيْفَةَ بْنَ عُتْبَةَ بْنِ رَبِيعَةَ، وَكَانَ، مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَكَانَ قَدْ شَهِدَ بَدْرًا وَكَانَ تَبَنَّى سَالِمًا الَّذِي يُقَالُ لَهُ سَالِمٌ مَوْلَى أَبِي حُذَيْفَةَ كَمَا تَبَنَّى رَسُولُ اللَّهِ صلى الله عليه وسلم زَيْدَ بْنَ حَارِثَةَ وَأَنْكَحَ أَبُو حُذَيْفَةَ سَالِمًا وَهُوَ يَرَى أَنَّهُ ابْنُهُ أَنْكَحَهُ بِنْتَ أَخِيهِ فَاطِمَةَ بِنْتَ الْوَلِيدِ بْنِ عُتْبَةَ بْنِ رَبِيعَةَ وَهِيَ يَوْمَئِذٍ مِنَ الْمُهَاجِرَاتِ الأُوَلِ وَهِيَ مِنْ أَفْضَلِ أَيَامَى قُرَيْشٍ فَلَمَّا أَنْزَلَ اللَّهُ تَعَالَى فِي كِتَابِهِ فِي زَيْدِ بْنِ حَارِثَةَ مَا أَنْزَلَ فَقَالَ ‏{‏ادْعُوهُمْ لآبَائِهِمْ هُوَ أَقْسَطُ عِنْدَ اللَّهِ فَإِنْ لَمْ تَعْلَمُوا آبَاءَهُمْ فَإِخْوَانُكُمْ فِي الدِّينِ وَمَوَالِيكُمْ‏}‏ رُدَّ كُلُّ وَاحِدٍ مِنْ أُولَئِكَ إِلَى أَبِيهِ فَإِنْ لَمْ يُعْلَمْ أَبُوهُ رُدَّ إِلَى مَوْلاَهُ فَجَاءَتْ سَهْلَةُ بِنْتُ سُهَيْلٍ وَهِيَ امْرَأَةُ أَبِي حُذَيْفَةَ وَهِيَ مِنْ بَنِي عَامِرِ بْنِ لُؤَىٍّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ كُنَّا نَرَى سَالِمًا وَلَدًا وَكَانَ يَدْخُلُ عَلَىَّ وَأَنَا فُضُلٌ وَلَيْسَ لَنَا إِلاَّ بَيْتٌ وَاحِدٌ فَمَاذَا تَرَى فِي شَأْنِهِ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَرْضِعِيهِ خَمْسَ رَضَعَاتٍ فَيَحْرُمُ بِلَبَنِهَا ‏\"‏ ‏.‏ وَكَانَتْ تَرَاهُ ابْنًا مِنَ الرَّضَاعَةِ فَأَخَذَتْ بِذَلِكَ عَائِشَةُ أُمُّ الْمُؤْمِنِينَ فِيمَنْ كَانَتْ تُحِبُّ أَنْ يَدْخُلَ عَلَيْهَا مِنَ الرِّجَالِ فَكَانَتْ تَأْمُرُ أُخْتَهَا أُمَّ كُلْثُومٍ بِنْتَ أَبِي بَكْرٍ الصِّدِّيقِ وَبَنَاتِ أَخِيهَا أَنْ يُرْضِعْنَ مَنْ أَحَبَّتْ أَنْ يَدْخُلَ عَلَيْهَا مِنَ الرِّجَالِ وَأَبَى سَائِرُ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم أَنْ يَدْخُلَ عَلَيْهِنَّ بِتِلْكَ الرَّضَاعَةِ أَحَدٌ مِنَ النَّاسِ وَقُلْنَ لاَ وَاللَّهِ مَا نَرَى الَّذِي أَمَرَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم سَهْلَةَ بِنْتَ سُهَيْلٍ إِلاَّ رُخْصَةً مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي رَضَاعَةِ سَالِمٍ وَحْدَهُ لاَ وَاللَّهِ لاَ يَدْخُلُ عَلَيْنَا بِهَذِهِ الرَّضَاعَةِ أَحَدٌ فَعَلَى هَذَا كَانَ أَزْوَاجُ النَّبِيِّ صلى الله عليه وسلم فِي رَضَاعَةِ الْكَبِيرِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibnu Shihab bahawa beliau ditanya tentang penyusuan orang dewasa. Beliau berkata, “Urwah bin Az-Zubair memberitahu saya bahawa Abu Hudzaifah bin Utbah bin Rabi’ah, yang merupakan salah seorang sahabat Rasulullah SAW dan telah menyaksikan perang Badar, telah mengangkat Salim (yang dikenali sebagai Salim, hamba Abu Hudzaifah) sebagai anak angkat, sebagaimana Rasulullah SAW telah mengangkat Zayd bin Harithah sebagai anak angkat. Abu Hudzaifah menikahkan Salim, yang dianggapnya sebagai anak sendiri, dengan saudara perempuannya, Fatimah binti Al-Walid bin Utbah bin Rabi’ah. Pada masa itu, Fatimah merupakan golongan Muhajirin awal dan merupakan salah seorang wanita Quraisy yang terbaik. Setelah Allah SWT menurunkan ayat dalam kitab-Nya mengenai Zayd bin Harithah: {“Panggil mereka dengan nama bapa mereka; itulah yang lebih adil di sisi Allah. Jika kamu tidak mengetahui bapa mereka, maka mereka adalah saudara kamu seagama dan saudara kamu seketurunan.”} (Surah 33:5), setiap individu daripada golongan tersebut dikesan kembali kepada bapa mereka. Sekiranya bapa mereka tidak diketahui, maka mereka dikesan kepada tuan mereka. Sahlah binti Suhayl, isteri Abu Hudzaifah daripada kabilah Amir bin Luai, datang kepada Rasulullah SAW lalu berkata, “Wahai Rasulullah, kami menganggap Salim sebagai anak kami, dan dia selalu masuk menemui saya ketika saya sedang tidak berpakaian. Kami hanya mempunyai satu rumah sahaja. Apakah pandangan tuan tentang perkara ini?” Rasulullah SAW bersabda, “Susukanlah dia sebanyak lima kali, maka dia akan menjadi mahram bagimu.” Kemudian, Sahlah menganggap Salim sebagai anak susuannya. Aisyah Ummul Mukminin mengambil contoh ini untuk sesiapa yang diingininya masuk menemui dirinya.  Beliau menyuruh adik perempuannya, Umm Kulthum binti Abu Bakar As-Siddiq dan anak-anak perempuan abangnya menyusu sesiapa yang diingininya masuk menemui dirinya. Manakala isteri-isteri Nabi yang lain menolak untuk membenarkan sesiapa pun masuk menemui mereka dengan cara penyusuan ini. Mereka berkata, “Tidak demi Allah, kami tidak menganggap perintah Rasulullah SAW kepada Sahlah binti Suhayl ini melainkan satu kelonggaran sahaja dalam hal penyusuan Salim. Tidak demi Allah, tiada sesiapa yang akan masuk menemui kami dengan cara penyusuan ini!” Inilah pandangan isteri-isteri Nabi SAW tentang penyusuan orang dewasa."
  },
  {
    "id": 35520,
    "hadith_number": 1342,
    "tajuk_hadith": "Perihal Menyusu Bagi Orang Dewasa",
    "perawi_melayu": "Yahya daripada Malik daripada Abdullah ibn Dinar",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّهُ قَالَ جَاءَ رَجُلٌ إِلَى عَبْدِ اللَّهِ بْنِ عُمَرَ وَأَنَا مَعَهُ عِنْدَ دَارِ الْقَضَاءِ يَسْأَلُهُ عَنْ رَضَاعَةِ الْكَبِيرِ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ جَاءَ رَجُلٌ إِلَى عُمَرَ بْنِ الْخَطَّابِ فَقَالَ إِنِّي كَانَتْ لِي وَلِيدَةٌ وَكُنْتُ أَطَؤُهَا فَعَمَدَتِ امْرَأَتِي إِلَيْهَا فَأَرْضَعَتْهَا فَدَخَلْتُ عَلَيْهَا فَقَالَتْ دُونَكَ فَقَدْ وَاللَّهِ أَرْضَعْتُهَا ‏.‏ فَقَالَ عُمَرُ أَوْجِعْهَا وَأْتِ جَارِيتَكَ فَإِنَّمَا الرَّضَاعَةُ رَضَاعَةُ الصَّغِيرِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Abdullah ibn Dinar, bahawa beliau berkata: “Seorang lelaki datang kepada Abdullah ibn Umar, ketika saya bersama beliau di mahkamah, untuk bertanya tentang penyusuan orang dewasa.  Maka Abdullah ibn Umar berkata: ‘Seorang lelaki datang kepada Umar ibn al-Khattab lalu berkata: “Aku mempunyai seorang hamba perempuan dan aku pernah melakukan hubungan seksual dengannya. Isteriku menyusukannya. Kemudian aku menghampiri hamba perempuanku itu, lalu isteriku berkata kepadaku: “Jangan bimbang, sesungguhnya aku telah menyusukannya.”  Maka Umar berkata kepadanya: “Pukul isterimu dan campuri hamba perempuanmu itu, kerana penyusuan itu hanya sah bagi yang kecil sahaja.”’”"
  },
  {
    "id": 35521,
    "hadith_number": 1343,
    "tajuk_hadith": "Pensyariatan Menyusu Hanya Dalam Tempoh Dua Tahun",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Yahya bin Said",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ رَجُلاً، سَأَلَ أَبَا مُوسَى الأَشْعَرِيَّ فَقَالَ إِنِّي مَصِصْتُ عَنِ امْرَأَتِي، مِنْ ثَدْيِهَا لَبَنًا فَذَهَبَ فِي بَطْنِي فَقَالَ أَبُو مُوسَى لاَ أُرَاهَا إِلاَّ قَدْ حَرُمَتْ عَلَيْكَ ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ انْظُرْ مَاذَا تُفْتِي بِهِ الرَّجُلَ فَقَالَ أَبُو مُوسَى فَمَاذَا تَقُولُ أَنْتَ فَقَالَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ لاَ رَضَاعَةَ إِلاَّ مَا كَانَ فِي الْحَوْلَيْنِ ‏.‏ فَقَالَ أَبُو مُوسَى لاَ تَسْأَلُونِي عَنْ شَىْءٍ مَا كَانَ هَذَا الْحَبْرُ بَيْنَ أَظْهُرِكُمْ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said bahawa seorang lelaki bertanya kepada Abu Musa al-Asy'ari, “Aku telah menyusu susu daripada isteriku, daripada buah dadanya, lalu masuk ke dalam perutku.” Abu Musa berkata, “Aku kira dia telah haram ke atasmu.” Abdullah bin Mas'ud berkata, “Lihatlah apa yang engkau fatwakan kepada lelaki ini.” Abu Musa berkata, “Maka apakah pendapatmu?” Abdullah bin Mas'ud berkata, “Tidak ada penyusuan melainkan yang berlaku dalam tempoh dua tahun.” Abu Musa berkata, “Janganlah kamu bertanya kepadaku tentang sesuatu manakala ulama’ ini berada di kalangan kamu.”"
  },
  {
    "id": 35522,
    "hadith_number": 1344,
    "tajuk_hadith": "Keharaman Susuan Sama Seperti Keharaman Pertalian Darah",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Abdullah ibn Dinar, daripada Sulaiman ibn Yasar, daripada Urwa ibn az-Zubayr, daripada Aisyah Ummul Mukminin",
    "english_text": "Yahya related to me from Malik from Abdullah ibn Dinar from\nSulayman ibn Yasar and from Urwa ibn az-Zubayr from A'isha umm al-\nmuminin, that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \" What is haram by birth is haram by suckling.\"",
    "arabic_text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَحْرُمُ مِنَ الرَّضَاعَةِ مَا يَحْرُمُ مِنَ الْوِلاَدَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abdullah ibn Dinar, daripada Sulaiman ibn Yasar, dan daripada Urwa ibn az-Zubayr, daripada Aisyah Ummul Mukminin, bahawa Rasulullah SAW bersabda:  \"Apa yang haram disebabkan pertalian darah, adalah haram juga disebabkan penyusuan.\""
  },
  {
    "id": 35523,
    "hadith_number": 1345,
    "tajuk_hadith": "Larangan Ghilah dan Amalan Orang Rom dan Parsi",
    "perawi_melayu": "Yahya (dari Malik), Muhammad ibn Abd ar-Rahman ibn Nawfal, Urwa ibn az-Zubayr, Aisyah Ummul Mukminin, Judamah binti Wahb al-Asadiyyah",
    "english_text": "Yahya related to me from Malik that Muhammad ibn Abd ar-Rahman\nibn Nawfal said, ''Urwa ibn az-Zubayr informed me from A'isha umm al-\nmuminin that Judama bint Wahb al-Asadiyya informed her that she heard\nthe Messenger of Allah, may Allah bless him and grant him peace, say,\n'I intended to prohibit ghila but I remembered that the Greeks and\nPersians do that without it causing any injury to their children.' \"\n\n\nMalik explained, \"Ghila is that a man has intercourse with\nhis wife while she is suckling.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ، أَنَّهُ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، عَنْ جُدَامَةَ بِنْتِ وَهْبٍ الأَسَدِيَّةِ، أَنَّهَا أَخْبَرَتْهَا أَنَّهَا، سَمِعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لَقَدْ هَمَمْتُ أَنْ أَنْهَى عَنِ الْغِيلَةِ حَتَّى ذَكَرْتُ أَنَّ الرُّومَ وَفَارِسَ يَصْنَعُونَ ذَلِكَ فَلاَ يَضُرُّ أَوْلاَدَهُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, daripada Muhammad bin Abd ar-Rahman bin Nawfal, bahawa dia berkata: “Urwah bin az-Zubayr memberitakan kepadaku daripada Aisyah Ummul Mukminin, daripada Judamah binti Wahb al-Asadiyyah, bahawa dia memberitakan kepadanya bahawa dia mendengar Rasulullah SAW bersabda:  \"Sesungguhnya aku berniat untuk melarang ghilah, sehingga aku teringat bahawa orang Rom dan Parsi melakukan perkara itu, dan ia tidak memudaratkan anak-anak mereka.\" \n\nMalik menjelaskan, \"Ghilah ialah seorang lelaki melakukan hubungan seks dengan isterinya ketika isterinya sedang menyusukan anak.\""
  },
  {
    "id": 35524,
    "hadith_number": 1346,
    "tajuk_hadith": "Pensabhan Menyusu: Sepuluh kepada Lima",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Abdullah ibn Abi Bakr ibn Hazm, daripada Amra bint Abd ar-Rahman, daripada Aisyah, isteri Nabi SAW.",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ حَزْمٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ كَانَ فِيمَا أُنْزِلَ مِنَ الْقُرْآنِ عَشْرُ رَضَعَاتٍ مَعْلُومَاتٍ يُحَرِّمْنَ ثُمَّ نُسِخْنَ بِخَمْسٍ مَعْلُومَاتٍ فَتُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ فِيمَا يُقْرَأُ مِنَ الْقُرْآنِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abdullah bin Abi Bakr bin Hazm, daripada Amra binti Abd ar-Rahman, daripada Aisyah, isteri Nabi SAW, bahawa baginda berkata:  \"Di antara ayat yang diturunkan dalam al-Quran ialah: 'Sepuluh kali menyusu yang diketahui mengharamkan (perkahwinan)', kemudian ia dimansuhkan dengan: 'Lima kali menyusu yang diketahui'.  Maka Rasulullah SAW wafat dan hukum yang termaktub dalam al-Quran yang dibaca sekarang adalah seperti itu.\" \n\nYahya berkata bahawa Malik berkata: \"Kita tidak bertindak berdasarkan (hukum yang telah dimansuhkan itu).\""
  }
]