[
  {
    "id": 35525,
    "hadith_number": 1347,
    "tajuk_hadith": "Larangan Transaksi Dengan Deposit Tidak Dikembalikan dan Beberapa Jenis Transaksi Lain",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari sumber yang dipercayai, daripada Amr ibn Shuayb, daripada bapanya, daripada datuknya",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ الثِّقَةِ، عِنْدَهُ عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الْعُرْبَانِ ‏.‏ \n\nقَالَ مَالِكٌ: وَذلِكَ فِيمَا نُرَى - وَاللهُ أَعْلَمُ - أَنْ يَشْتَرِيَ الرَّجُلُ الْعَبْدَ، أَوِ الْوَلِيدَةَ. أَوْ يَتَكَارَى الدَّابَّةَ. ثُمَّ يَقُولُ لِلَّذِي اشْتَرَى مِنْهُ، أَوْ تَكَارَى مِنْهُ: أُعْطِيكَ دِينَاراً، أَوْ دِرْهَماً، أَوْ أَكْثَرَ مِنْ ذلِكَ، أَوْ أَقَلَّ. عَلَى أَنِّي إِنْ أَخَذْتُ السِّلْعَةَ، أَوْ رَكِبْتُ مَا تَكَارَيْتُ مِنْكَ، فَالَّذِي أَعْطَيْتُكَ هُوَ مِنْ ثَمَنِ السِّلْعَةِ. أَوْ مِنْ كِرَاءِ الدَّابَّةِ، وَإِنْ تَرَكْتُ ابْتِيَاعَ السِّلْعَةِ، أَوْ كِرَاءَ الدَّابَّةِ، فَمَا أَعْطَيْتُكَ لَكَ بَاطِلٌ بِغَيْرِ شَيْءٍ.\n\nقَالَ مَالِكٌ: وَالْأَمْرُ عِنْدَنَا، أَنَّهُ لاَ بَأْسَ بِأَنْ يَبْتَاعَ الْعَبْدَ التَّاجِرَ الْفَصِيحَ، بِالْأَعْبُدِ مِنَ الْحَبَشَةِ، أَوْ مِنْ جِنْسٍ مِنَ الْأَجْنَاسِ، لَيْسُوا مِثْلَهُ فِي الْفَصَاحَةِ، وَلاَ فِي التِّجَارَةِ، وَالنَّفَاذِ، وَالْمَعْرِفَةِ. لاَ بَأْسَ بِهذَا، أَنْ يَشْتَرِيَ مِنْهُ الْعَبْدَ بِالْعَبْدَيْنِ، أَوْ بِالْأَعْبُدِ إِلَى أَجَلٍ مَعْلُومٍ. إِذَا اخْتَلَفَ، فَبَانَ اخْتِلاَفُهُ .فَإِنْ أَشْبَهَ بَعْضُ ذلِكَ بَعْضاً، حَتَّى يَتَقَارَبَ، فَلاَ تَأْخُذَنْ مِنْهُ اثْنَيْنِ بِوَاحِدٍ، إِلَى أَجَلٍ. وَإِنِ اخْتَلَفَتْ أَجْنَاسُهُمْ.\n\nقَالَ مَالِكٌ: وَلاَ بَأْسَ بِأَنْ تَبِيعَ مَا اشْتَرَيْتَ مِنْ ذلِكَ، قَبْلَ أَنْ تَسْتَوْفِيَهُ. إِذَا انْتَقَدْتَ ثَمَنَهُ مِنْ غَيْرِ صَاحِبِهِ الَّذِي اشْتَرَيْتَهُ مِنْهُ.\n\nقَالَ مَالِكٌ: لاَ يَنْبَغِي أَنْ يُسْتَثْنَى جَنِينٌ فِي بَطْنِ أُمِّهِ، إِذَا بِيعَتْ. لِأَنَّ ذلِكَ غَرَرٌ. لاَ يُدْرَى أَذَكَرٌ هُوَ أَمْ (1) أُنْثَى أو حَسَنٌ (2) أَوْ قَبِيحٌ، أَوْ نَاقِصٌ، أَوْ تَامٌّ، أَوْ حَيٌّ أَوْ مَيِّتٌ؟. وَذلِكَ يَضَعُ مِنْ ثَمَنِهَا.\n\nقَالَ مَالِكٌ، فِي الرَّجُلِ يَبْتَاعُ الْعَبْدَ، أَوِ الْوَلِيدَةَ، بِمِائَةِ دِينَارٍ إِلَى أَجَلٍ. ثُمَّ يَنْدَمُ الْبَائِعُ. فَيَسْأَلُ الْمُبْتَاعَ أَنْ يُقِيلَهُ بِعَشَرَةِ دَنَانِيرَ، يَدْفَعُهَا إِلَيْهِ نَقْداً. أَوْ إِلَى أَجَلٍ. وَيَمْحُو عَنْهُ الْمِائَةَ دِينَارٍ الَّتِي لَهُ.\nقَالَ مَالِكٌ: لاَ بَأْسَ بِذلِكَ. وَإِنْ نَدِمَ الْمُبْتَاعُ، فَسَأَلَ الْبَائِعَ أَنْ يُقِيلَهُ فِي الْجَارِيَةِ، أَوِ الْعَبْدِ، وَيَزِيدَهُ عَشَرَةَ دَنَانِيرَ نَقْداً، أَوْ إِلَى أَجَلٍ أَبْعَدَ مِنَ الْأَجَلِ الَّذِي اشْتَرَى إِلَيْهِ الْعَبْدَ، أَوِ الْوَلِيدَةَ. فَإِنَّ ذلِكَ لاَ يَنْبَغِي.\nوَإِنَّمَا كَرِهَ ذلِكَ؛ لِأَنَّ الْبَائِعَ كَأَنَّهُ بَاعَ مِنْهُ مِائَةَ دِينَارٍ لَهُ، إِلَى سَنَةٍ قَبْلَ أَنْ تَحِلَّ، بِجَارِيَةٍ، وَبِعَشَرَةِ دَنَانِيرَ نَقْداً. أَوْ إِلَى أَجَلٍ أَبْعَدَ مِنَ السَّنَةِ. فَدَخَلَ فِي ذلِكَ بَيْعُ الذَّهَبِ بِالذَّهَبِ إِلَى أَجَلٍ.\n\nقَالَ مَالِكٌ، فِي الرَّجُلِ يَبِيعُ مِنَ الرَّجُلِ الْجَارِيَةَ بِمِائَةِ دِينَارٍ إِلَى أَجَلٍ، ثُمَّ يَشْتَرِيهَا بِأَكْثَرَ مِنْ ذلِكَ الثَّمَنِ الَّذِي بَاعَهَا بِهِ إِلَى أَبْعَدَ مِنْ ذلِكَ الْأَجَلِ، الَّذِي بَاعَهَا إِلَيْهِ: إِنَّ ذلِكَ لاَ يَصْلُحُ. وَتَفْسِيرُ مَا كَرِهَ مِنْ ذلِكَ، أَنْ يَبِيعَ الرَّجُلُ الْجَارِيَةَ إِلَى أَجَلٍ. ثُمَّ يَبْتَاعُهَا إِلَى أَجَلٍ أَبْعَدَ مِنْهُ. يَبِيعُهَا بِثَلاَثِينَ دِينَاراً إِلَى شَهْرٍ، ثُمَّ يَبْتَاعُهَا بِسِتِّينَ دِينَاراً، إِلَى سَنَةٍ، أَوْ إِلَى نِصْفِ  سَنَةٍ. فَصَارَ، إِنْ رَجَعَتْ إِلَيْهِ سِلْعَتُهُ بِعَيْنِهَا، وَأَعْطَاهُ صَاحِبُهُ ثَلاَثِينَ دِينَاراً، إِلَى شَهْرٍ؛ بِسِتِّينَ دِينَاراً، إِلَى سَنَةٍ، أَوْ إِلَى نِصْفِ سَنَةٍ. فَهذَا لاَ يَنْبَغِي.",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada sumber yang dipercayai, daripada Amr bin Shuayb, daripada bapanya, daripada datuknya bahawa Rasulullah SAW melarang jual beli dengan bayaran pendahuluan yang tidak dikembalikan.\n\nMalik berkata, \"Pendapat kami – dan Allah SWT lebih mengetahui –  ialah sepertimana seseorang membeli hamba sahaya, atau hamba perempuan, atau menyewa binatang, kemudian dia berkata kepada orang yang menjual atau menyewakan kepadanya: Aku akan memberikan kepadamu satu dinar, atau dirham, atau lebih daripada itu, atau kurang.  Dengan syarat jika aku mengambil barang tersebut atau menunggang apa yang aku sewa darimu, maka apa yang telah aku berikan kepadamu adalah sebahagian daripada harga barang atau sewa binatang itu.  Dan jika aku membatalkan pembelian atau penyewaan, maka apa yang telah aku berikan kepadamu adalah milikmu tanpa sebarang liabiliti di pihakmu.\"\n\nMalik berkata, \"Dalam pandangan kami, tiada masalah sekiranya seseorang membeli hamba sahaya pedagang yang fasih berbahasa Arab dengan hamba sahaya Habsyi atau jenis lain yang tidak setaraf dengannya dari segi kefasihan, perdagangan, kepandaian dan pengetahuan.  Tiada masalah juga sekiranya dia menukarkan seorang hamba sahaya seperti itu dengan dua atau lebih hamba sahaya lain dengan tempoh bayaran yang ditentukan, jika perbezaan di antara mereka jelas.  Tetapi jika perbezaan di antara hamba sahaya tersebut tidak ketara, maka dua hamba sahaya tidak boleh ditukar dengan satu hamba sahaya dengan tempoh bayaran yang ditentukan walaupun jenis bangsa mereka berbeza.\"\n\nMalik berkata, \"Tiada masalah juga sekiranya kamu menjual apa yang telah kamu beli sebelum mengambilnya sepenuhnya, selagi kamu menerima bayarannya daripada orang lain selain daripada pemilik asal.\"\n\nMalik berkata, \"Tidak sepatutnya ditambah harga bagi janin di dalam kandungan ibunya apabila ibunya dijual, kerana ia merupakan gharar (transaksi yang tidak pasti). Tidak diketahui sama ada bayi itu lelaki atau perempuan, cantik atau hodoh, sempurna atau cacat, hidup atau mati. Semua ini akan mempengaruhi harganya.\"\n\nMalik berkata bahawa dalam transaksi di mana seorang hamba sahaya atau hamba perempuan dibeli dengan seratus dinar dengan tempoh kredit yang ditetapkan, sekiranya penjual menyesal, tiada masalah baginya untuk meminta pembeli membatalkannya dengan sepuluh dinar yang akan dibayar segera atau kemudian, dan dia akan melepaskan haknya ke atas seratus dinar yang terhutang.\n\nMalik berkata, \"Namun, jika pembeli menyesal dan meminta penjual membatalkan jual beli hamba sahaya atau hamba perempuan itu dengan syarat dia akan membayar tambahan sepuluh dinar secara tunai atau kredit, yang lebih lama daripada tempoh asal, maka itu tidak sepatutnya dilakukan.  Ia dibenci kerana ia seolah-olah penjual menjual seratus dinar yang belum jatuh tempo setahun sebelum tempoh tamat, untuk seorang hamba perempuan, dan sepuluh dinar secara tunai atau kredit yang lebih lama daripada setahun.  Ini termasuk dalam kategori jual beli emas dengan emas dengan tempoh bayaran yang ditangguhkan.\"\n\nMalik berkata bahawa tidak patut bagi seseorang menjual seorang hamba perempuan kepada orang lain dengan seratus dinar secara kredit, kemudian membelinya semula dengan harga yang lebih tinggi atau dengan tempoh kredit yang lebih lama daripada tempoh asal.  Untuk memahami mengapa ia dibenci, contohnya ialah seseorang menjual seorang hamba perempuan secara kredit, kemudian membelinya semula dengan tempoh kredit yang lebih lama daripada tempoh asal.  Dia mungkin menjualnya dengan tiga puluh dinar dengan tempoh bayaran sebulan, kemudian membelinya semula dengan enam puluh dinar dengan tempoh bayaran setahun atau setengah tahun.  Kesannya hanyalah barangannya kembali kepadanya seperti sedia kala, dan pihak lain telah memberinya tiga puluh dinar secara kredit sebulan untuk enam puluh dinar secara kredit setahun atau setengah tahun.  Ini tidak sepatutnya dilakukan."
  },
  {
    "id": 35526,
    "hadith_number": 1348,
    "tajuk_hadith": "Harta Hamba yang Dijual",
    "perawi_melayu": "Yahya daripada Malik daripada Nafi daripada Abdullah bin Umar",
    "english_text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat Umar ibn al-Khattab said, \"If a slave who has wealth is sold,\nthat wealth belongs to the seller unless the buyer stipulates its\ninclusion.\"\n\n\nMalik said, \"The generally agreed upon way of\ndoing things among us is that if the buyer stipulates the inclusion of\nthe slave's property whether it be cash, debts, or goods of known or\nunknown value, then they belong to the buyer, even if the slave\npossesses more than that for which he was purchased, whether he was\nbought for cash, as payment for a debt, or in exchange for goods. This\nis possible because a master is not asked to pay zakat on his slave's\nproperty. If a slave has a slave-girl, it is halal for him to have\nintercourse with her by his right of possession. If a slave is freed\nor put under contract (kitaba) to purchase his freedom, then his\nproperty goes with him. If he becomes bankrupt, his creditors take his\nproperty and his master is not liable for any of his debts.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ مَنْ بَاعَ عَبْدًا وَلَهُ مَالٌ فَمَالُهُ لِلْبَائِعِ إِلاَّ أَنْ يَشْتَرِطَهُ الْمُبْتَاعُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik, daripada Nafi', daripada Abdullah bin Umar bahawa Umar bin al-Khattab berkata, \"Jika seorang hamba yang mempunyai harta dijual, maka harta itu kepunyaan penjual melainkan jika pembeli mensyaratkan penyertaannya.\"\n\nMalik berkata, \"Cara yang umumnya dipersetujui di kalangan kami ialah jika pembeli mensyaratkan penyertaan harta hamba itu sama ada wang tunai, hutang, atau barang yang diketahui atau tidak diketahui nilainya, maka ia menjadi milik pembeli, walaupun hamba itu memiliki lebih daripada harga yang dibeli, sama ada dibeli dengan wang tunai, sebagai bayaran hutang, atau sebagai pertukaran barang. Ini adalah mungkin kerana tuan tidak diminta membayar zakat ke atas harta hambanya. Jika seorang hamba mempunyai seorang hamba perempuan, adalah halal baginya untuk melakukan hubungan seksual dengannya melalui hak pemilikannya. Jika seorang hamba dibebaskan atau diletakkan di bawah kontrak (kitaba) untuk membeli kebebasannya, maka hartanya akan mengikutinya. Jika dia muflis, pemiutangnya akan mengambil hartanya dan tuannya tidak bertanggungjawab terhadap sebarang hutangnya."
  },
  {
    "id": 35527,
    "hadith_number": 1349,
    "tajuk_hadith": "Liabiliti Penjual Hamba dalam Islam",
    "perawi_melayu": "Yahya daripada Malik daripada Abdullah ibn Abi Bakr ibn Muhammad ibn Amr ibn Hazm",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، أَنَّ أَبَانَ بْنَ عُثْمَانَ، وَهِشَامَ بْنَ إِسْمَاعِيلَ، كَانَا يَذْكُرَانِ فِي خُطْبَتِهِمَا عُهْدَةَ الرَّقِيقِ فِي الأَيَّامِ الثَّلاَثَةِ مِنْ حِينِ يُشْتَرَى الْعَبْدُ أَوِ الْوَلِيدَةُ وَعُهْدَةَ السَّنَةِ ‏.‏ قَالَ مَالِكٌ مَا أَصَابَ الْعَبْدُ أَوِ الْوَلِيدَةُ فِي الأَيَّامِ الثَّلاَثَةِ مِنْ حِينِ يُشْتَرَيَانِ حَتَّى تَنْقَضِيَ الأَيَّامُ الثَّلاَثَةُ فَهُوَ مِنَ الْبَائِعِ وَإِنَّ عُهْدَةَ السَّنَةِ مِنَ الْجُنُونِ وَالْجُذَامِ وَالْبَرَصِ فَإِذَا مَضَتِ السَّنَةُ فَقَدْ بَرِئَ الْبَائِعُ مِنَ الْعُهْدَةِ كُلِّهَا ‏.‏ قَالَ مَالِكٌ وَمَنْ بَاعَ عَبْدًا أَوْ وَلِيدَةً مِنْ أَهْلِ الْمِيرَاثِ أَوْ غَيْرِهِمْ بِالْبَرَاءَةِ فَقَدْ بَرِئَ مِنْ كُلِّ عَيْبٍ وَلاَ عُهْدَةَ عَلَيْهِ إِلاَّ أَنْ يَكُونَ عَلِمَ عَيْبًا فَكَتَمَهُ فَإِنْ كَانَ عَلِمَ عَيْبًا فَكَتَمَهُ لَمْ تَنْفَعْهُ الْبَرَاءَةُ وَكَانَ ذَلِكَ الْبَيْعُ مَرْدُودًا وَلاَ عُهْدَةَ عِنْدَنَا إِلاَّ فِي الرَّقِيقِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Abdullah bin Abi Bakar bin Muhammad bin Amr bin Hazm, bahawa Aban bin Usman dan Hisyam bin Ismail, menyebut dalam khutbah mereka tentang jaminan hamba dalam tempoh tiga hari dari saat hamba atau hamba perempuan dibeli, dan jaminan setahun. Malik berkata, \"Apa sahaja yang berlaku ke atas hamba atau hamba perempuan dalam tempoh tiga hari dari saat mereka dibeli sehingga tempoh tiga hari itu berakhir, adalah tanggungjawab penjual.  Dan jaminan setahun itu meliputi kegilaan, kusta, dan kehilangan anggota badan akibat penyakit. Setelah setahun, penjual bebas daripada semua liabiliti.\" Malik berkata, \"Dan sesiapa yang menjual hamba lelaki atau perempuan daripada ahli waris atau selainnya tanpa sebarang jaminan, maka dia bebas daripada sebarang kecacatan dan tidak ada liabiliti ke atasnya kecuali jika dia mengetahui kecacatan dan menyembunyikannya. Jika dia mengetahui kecacatan dan menyembunyikannya, maka jaminan itu tidak melindunginya dan jual beli itu dibatalkan. Dan menurut pandangan kami, jaminan hanya terpakai dalam jual beli hamba.\" "
  },
  {
    "id": 35528,
    "hadith_number": 1350,
    "tajuk_hadith": "Hukum Membeli Hamba Sahaya yang Berpenyakit",
    "perawi_melayu": "Yahya meriwayatkan dari Malik dari Yahya ibn Said dari Salim ibn Abdullah",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، بَاعَ غُلاَمًا لَهُ بِثَمَانِمِائَةِ دِرْهَمٍ وَبَاعَهُ بِالْبَرَاءَةِ فَقَالَ الَّذِي ابْتَاعَهُ لِعَبْدِ اللَّهِ بْنِ عُمَرَ بِالْغُلاَمِ دَاءٌ لَمْ تُسَمِّهِ لِي ‏.‏ فَاخْتَصَمَا إِلَى عُثْمَانَ بْنِ عَفَّانَ ‏.‏ فَقَالَ الرَّجُلُ بَاعَنِي عَبْدًا وَبِهِ دَاءٌ لَمْ يُسَمِّهِ ‏.‏ وَقَالَ عَبْدُ اللَّهِ بِعْتُهُ بِالْبَرَاءَةِ ‏.‏ فَقَضَى عُثْمَانُ بْنُ عَفَّانَ عَلَى عَبْدِ اللَّهِ بْنِ عُمَرَ أَنْ يَحْلِفَ لَهُ لَقَدْ بَاعَهُ الْعَبْدَ وَمَا بِهِ دَاءٌ يَعْلَمُهُ فَأَبَى عَبْدُ اللَّهِ أَنْ يَحْلِفَ وَارْتَجَعَ الْعَبْدَ فَصَحَّ عِنْدَهُ فَبَاعَهُ عَبْدُ اللَّهِ بَعْدَ ذَلِكَ بِأَلْفٍ وَخَمْسِمِائَةِ دِرْهَمٍ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّ كُلَّ مَنِ ابْتَاعَ وَلِيدَةً فَحَمَلَتْ أَوْ عَبْدًا فَأَعْتَقَهُ وَكُلَّ أَمْرٍ دَخَلَهُ الْفَوْتُ حَتَّى لاَ يُسْتَطَاعَ رَدُّهُ فَقَامَتِ الْبَيِّنَةُ إِنَّهُ قَدْ كَانَ بِهِ عَيْبٌ عِنْدَ الَّذِي بَاعَهُ أَوْ عُلِمَ ذَلِكَ بِاعْتِرَافٍ مِنَ الْبَائِعِ أَوْ غَيْرِهِ فَإِنَّ الْعَبْدَ أَوِ الْوَلِيدَةَ يُقَوَّمُ وَبِهِ الْعَيْبُ الَّذِي كَانَ بِهِ يَوْمَ اشْتَرَاهُ فَيُرَدُّ مِنَ الثَّمَنِ قَدْرُ مَا بَيْنَ قِيمَتِهِ صَحِيحًا وَقِيمَتِهِ وَبِهِ ذَلِكَ الْعَيْبُ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا فِي الرَّجُلِ يَشْتَرِي الْعَبْدَ ثُمَّ يَظْهَرُ مِنْهُ عَلَى عَيْبٍ يَرُدُّهُ مِنْهُ وَقَدْ حَدَثَ بِهِ عِنْدَ الْمُشْتَرِي عَيْبٌ آخَرُ إِنَّهُ إِذَا كَانَ الْعَيْبُ الَّذِي حَدَثَ بِهِ مُفْسِدًا مِثْلُ الْقَطْعِ أَوِ الْعَوَرِ أَوْ مَا أَشْبَهَ ذَلِكَ مِنَ الْعُيُوبِ الْمُفْسِدَةِ فَإِنَّ الَّذِي اشْتَرَى الْعَبْدَ بِخَيْرِ النَّظَرَيْنِ إِنْ أَحَبَّ أَنْ يُوضَعَ عَنْهُ مِنْ ثَمَنِ الْعَبْدِ بِقَدْرِ الْعَيْبِ الَّذِي كَانَ بِالْعَبْدِ يَوْمَ اشْتَرَاهُ وُضِعَ عَنْهُ وَإِنْ أَحَبَّ أَنْ يَغْرَمَ قَدْرَ مَا أَصَابَ الْعَبْدَ مِنَ الْعَيْبِ عِنْدَهُ ثُمَّ يَرُدُّ الْعَبْدَ فَذَلِكَ لَهُ وَإِنْ مَاتَ الْعَبْدُ عِنْدَ الَّذِي اشْتَرَاهُ أُقِيمَ الْعَبْدُ وَبِهِ الْعَيْبُ الَّذِي كَانَ بِهِ يَوْمَ اشْتَرَاهُ فَيُنْظَرُ كَمْ ثَمَنُهُ فَإِنْ كَانَتْ قِيمَةُ الْعَبْدِ يَوْمَ اشْتَرَاهُ بِغَيْرِ عَيْبٍ مِائَةَ دِينَارٍ وَقِيمَتُهُ يَوْمَ اشْتَرَاهُ وَبِهِ الْعَيْبُ ثَمَانُونَ دِينَارًا وُضِعَ عَنِ الْمُشْتَرِي مَا بَيْنَ الْقِيمَتَيْنِ وَإِنَّمَا تَكُونُ الْقِيمَةُ يَوْمَ اشْتُرِيَ الْعَبْدُ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّ مَنْ رَدَّ وَلِيدَةً مِنْ عَيْبٍ وَجَدَهُ بِهَا وَكَانَ قَدْ أَصَابَهَا أَنَّهَا إِنْ كَانَتْ بِكْرًا فَعَلَيْهِ مَا نَقَصَ مِنْ ثَمَنِهَا وَإِنْ كَانَتْ ثَيِّبًا فَلَيْسَ عَلَيْهِ فِي إِصَابَتِهِ إِيَّاهَا شَىْءٌ لأَنَّهُ كَانَ ضَامِنًا لَهَا ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا فِيمَنْ بَاعَ عَبْدًا أَوْ وَلِيدَةً أَوْ حَيَوَانًا بِالْبَرَاءَةِ مِنْ أَهْلِ الْمِيرَاثِ أَوْ غَيْرِهِمْ فَقَدْ بَرِئَ مِنْ كُلِّ عَيْبٍ فِيمَا بَاعَ إِلاَّ أَنْ يَكُونَ عَلِمَ فِي ذَلِكَ عَيْبًا فَكَتَمَهُ فَإِنْ كَانَ عَلِمَ عَيْبًا فَكَتَمَهُ لَمْ تَنْفَعْهُ تَبْرِئَتُهُ وَكَانَ مَا بَاعَ مَرْدُودًا عَلَيْهِ ‏.‏ قَالَ مَالِكٌ فِي الْجَارِيَةِ تُبَاعُ بِالْجَارِيَتَيْنِ ثُمَّ يُوجَدُ بِإِحْدَى الْجَارِيَتَيْنِ عَيْبٌ تُرَدُّ مِنْهُ قَالَ تُقَامُ الْجَارِيَةُ الَّتِي كَانَتْ قِيمَةَ الْجَارِيَتَيْنِ فَيُنْظَرُ كَمْ ثَمَنُهَا ثُمَّ تُقَامُ الْجَارِيَتَانِ بِغَيْرِ الْعَيْبِ الَّذِي وُجِدَ بِإِحْدَاهُمَا تُقَامَانِ صَحِيحَتَيْنِ سَالِمَتَيْنِ ثُمَّ يُقْسَمُ ثَمَنُ الْجَارِيَةِ الَّتِي بِيعَتْ بِالْجَارِيَتَيْنِ عَلَيْهِمَا بِقَدْرِ ثَمَنِهِمَا حَتَّى يَقَعَ عَلَى كُلِّ وَاحِدَةٍ مِنْهُمَا حِصَّتُهَا مِنْ ذَلِكَ عَلَى الْمُرْتَفِعَةِ بِقَدْرِ ارْتِفَاعِهَا وَعَلَى الأُخْرَى بِقَدْرِهَا ثُمَّ يُنْظَرُ إِلَى الَّتِي بِهَا الْعَيْبُ فَيُرَدُّ بِقَدْرِ الَّذِي وَقَعَ عَلَيْهَا مِنْ تِلْكَ الْحِصَّةِ إِنْ كَانَتْ كَثِيرَةً أَوْ قَلِيلَةً وَإِنَّمَا تَكُونُ قِيمَةُ الْجَارِيَتَيْنِ عَلَيْهِ يَوْمَ قَبْضِهِمَا ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يَشْتَرِي الْعَبْدَ فَيُؤَاجِرُهُ بِالإِجَارَةِ الْعَظِيمَةِ أَوِ الْغَلَّةِ الْقَلِيلَةِ ثُمَّ يَجِدُ بِهِ عَيْبًا يُرَدُّ مِنْهُ إِنَّهُ يَرُدُّهُ بِذَلِكَ الْعَيْبِ وَتَكُونُ لَهُ إِجَارَتُهُ وَغَلَّتُهُ وَهَذَا الأَمْرُ الَّذِي كَانَتْ عَلَيْهِ الْجَمَاعَةُ بِبَلَدِنَا وَذَلِكَ لَوْ أَنَّ رَجُلاً ابْتَاعَ عَبْدًا فَبَنَى لَهُ دَارًا قِيمَةُ بِنَائِهَا ثَمَنُ الْعَبْدِ أَضْعَافًا ثُمَّ وَجَدَ بِهِ عَيْبًا يُرَدُّ مِنْهُ رَدَّهُ وَلاَ يُحْسَبُ لِلْعَبْدِ عَلَيْهِ إِجَارَةٌ فِيمَا عَمِلَ لَهُ فَكَذَلِكَ تَكُونُ لَهُ إِجَارَتُهُ إِذَا آجَرَهُ مِنْ غَيْرِهِ لأَنَّهُ ضَامِنٌ لَهُ وَهَذَا الأَمْرُ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِيمَنِ ابْتَاعَ رَقِيقًا فِي صَفْقَةٍ وَاحِدَةٍ فَوَجَدَ فِي ذَلِكَ الرَّقِيقِ عَبْدًا مَسْرُوقًا أَوْ وَجَدَ بِعَبْدٍ مِنْهُمْ عَيْبًا أَنَّهُ يُنْظَرُ فِيمَا وُجِدَ مَسْرُوقًا أَوْ وَجَدَ بِهِ عَيْبًا فَإِنْ كَانَ هُوَ وَجْهَ ذَلِكَ الرَّقِيقِ أَوْ أَكْثَرَهُ ثَمَنًا أَوْ مِنْ أَجْلِهِ اشْتَرَى وَهُوَ الَّذِي فِيهِ الْفَضْلُ فِيمَا يَرَى النَّاسُ كَانَ ذَلِكَ الْبَيْعُ مَرْدُودًا كُلُّهُ وَإِنْ كَانَ الَّذِي وُجِدَ مَسْرُوقًا أَوْ وُجِدَ بِهِ الْعَيْبُ مِنْ ذَلِكَ الرَّقِيقِ فِي الشَّىْءِ الْيَسِيرِ مِنْهُ لَيْسَ هُوَ وَجْهَ ذَلِكَ الرَّقِيقِ وَلاَ مِنْ أَجْلِهِ اشْتُرِيَ وَلاَ فِيهِ الْفَضْلُ فِيمَا يَرَى النَّاسُ رُدَّ ذَلِكَ الَّذِي وُجِدَ بِهِ الْعَيْبُ أَوْ وُجِدَ مَسْرُوقًا بِعَيْنِهِ بِقَدْرِ قِيمَتِهِ مِنَ الثَّمَنِ الَّذِي اشْتَرَى بِهِ أُولَئِكَ الرَّقِيقَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said, daripada Salim bin Abdullah bahawa Abdullah bin Umar menjual seorang hambanya dengan harga lapan ratus dirham dengan syarat bahawa beliau tidak bertanggungjawab terhadap sebarang kecacatan.  Orang yang membelinya mengadu kepada Abdullah bin Umar bahawa hamba itu mempunyai penyakit yang tidak diberitahu kepadanya. Mereka bertelagah dan membawa perkara ini kepada Uthman bin Affan untuk diputuskan. Lelaki itu berkata, \"Dia menjual hamba kepada saya yang mempunyai penyakit dan tidak memberitahu saya.\" Abdullah berkata, \"Saya menjualnya dengan syarat bahawa saya tidak bertanggungjawab.\" Uthman bin Affan memutuskan supaya Abdullah bin Umar bersumpah bahawa dia telah menjual hamba itu tanpa mengetahui penyakitnya. Abdullah bin Umar enggan bersumpah, maka hamba itu dikembalikan kepadanya dan sihat semula dalam penjagaannya. Abdullah kemudian menjualnya semula dengan harga seribu lima ratus dirham.\n\nMalik berkata, \"Cara yang lazim diamalkan di kalangan kami ialah bagi sesiapa yang membeli seorang hamba perempuan lalu mengandung, atau membeli seorang hamba lalu membebaskannya, dan apa sahaja perkara yang telah berlaku sehingga tidak dapat dikembalikan, dan bukti yang jelas menunjukkan bahawa terdapat kecacatan pada pembelian tersebut semasa berada di tangan penjual, atau kecacatan tersebut diakui oleh penjual atau orang lain, maka hamba lelaki atau perempuan tersebut dinilai dengan mengambil kira kecacatan yang wujud pada hari pembelian, dan pembeli akan dikembalikan wang lebihan daripada jumlah yang dibayar, iaitu perbezaan antara harga hamba yang sihat dan hamba yang berpenyakit.\"\n\nMalik berkata, \"Cara yang lazim diamalkan di kalangan kami berkenaan seseorang yang membeli seorang hamba, kemudian mendapati hamba itu mempunyai kecacatan yang membolehkannya dikembalikan, dan pada masa yang sama berlaku kecacatan lain ke atas hamba itu semasa di bawah penjagaannya, ialah sekiranya kecacatan yang berlaku ke atas hamba itu semasa di bawah penjagaannya itu menyebabkan kerosakan, seperti kehilangan anggota badan, kehilangan mata, atau seumpamanya, maka pembeli mempunyai dua pilihan. Sekiranya dia mahu, dia boleh meminta pengurangan harga hamba itu mengikut kadar kecacatan asal pada hari pembelian, atau sekiranya dia suka, dia boleh membayar pampasan bagi kecacatan yang dialami hamba itu semasa di bawah penjagaannya dan mengembalikan hamba itu. Pilihan itu terpulang kepadanya.  Sekiranya hamba itu mati semasa di bawah penjagaannya, hamba itu dinilai dengan mengambil kira kecacatan yang wujud pada hari pembelian. Harga sebenarnya akan ditentukan. Jika harga hamba itu pada hari pembelian tanpa kecacatan adalah seratus dinar, dan harganya pada hari pembelian dengan kecacatan adalah lapan puluh dinar, maka harga akan dikurangkan sebanyak perbezaan tersebut. Penilaian harga ini adalah berdasarkan harga pasaran pada hari hamba itu dibeli.\"\n\nMalik berkata, \"Cara yang lazim diamalkan di kalangan kami ialah sekiranya seseorang mengembalikan hamba perempuan yang didapati mempunyai kecacatan dan dia telah melakukan hubungan seks dengannya, maka dia mesti membayar balik jumlah pengurangan harga jika hamba perempuan itu dara.  Sekiranya dia bukan dara, maka tiada sebarang kesalahan ke atasnya kerana telah melakukan hubungan seks dengannya kerana dia bertanggungjawab ke atasnya.\"\n\nMalik berkata, \"Cara yang lazim diamalkan di kalangan kami berkenaan seseorang, sama ada waris atau bukan, yang menjual seorang hamba lelaki, hamba perempuan atau haiwan dengan syarat tidak bertanggungjawab, maka dia tidak bertanggungjawab terhadap sebarang kecacatan pada apa yang dijualnya melainkan jika dia mengetahui kecacatan tersebut dan menyembunyikannya. Sekiranya dia mengetahui kecacatan tersebut dan menyembunyikannya, maka syarat tidak bertanggungjawab itu tidak melepaskan tanggungjawabnya, dan apa yang dijualnya akan dikembalikan kepadanya.\"\n\nMalik menceritakan tentang situasi di mana seorang hamba perempuan ditukar dengan dua orang hamba perempuan lain, kemudian salah seorang hamba perempuan itu didapati mempunyai kecacatan yang membolehkannya dikembalikan. Beliau berkata, \"Hamba perempuan yang ditukar dengan dua orang hamba perempuan lain itu dinilai harganya. Kemudian dua orang hamba perempuan yang lain dinilai harganya, tanpa mengambil kira kecacatan yang terdapat pada salah seorang daripada mereka.  Kemudian harga hamba perempuan yang ditukar dengan dua orang hamba perempuan lain itu dibahagikan kepada mereka berdua mengikut harga masing-masing supaya bahagian masing-masing dapat ditentukan – kepada yang lebih mahal mengikut harga yang lebih mahal, dan kepada yang lain mengikut harganya. Kemudian, hamba perempuan yang berpenyakit itu dinilai, dan pembeli akan dikembalikan wang mengikut jumlah bahagian yang terjejas oleh kecacatan tersebut, sama ada sedikit atau banyak. Penilaian harga dua orang hamba perempuan itu adalah berdasarkan harga pasaran pada hari mereka dibeli.\"\n\nMalik menceritakan tentang seseorang yang membeli seorang hamba dan mengupahkannya untuk jangka masa panjang atau pendek, kemudian mendapati hamba itu mempunyai kecacatan yang menyebabkannya perlu dikembalikan. Beliau berkata, sekiranya orang itu mengembalikan hamba tersebut kerana kecacatan itu, dia boleh menyimpan upah dan hasil kerjanya.  \"Inilah cara yang diamalkan di bandar kami. Ini kerana, sekiranya seseorang membeli seorang hamba yang kemudian membina sebuah rumah untuknya, dan nilai rumah itu berkali ganda lebih daripada harga hamba itu, dan dia kemudian mendapati hamba itu mempunyai kecacatan yang menyebabkannya perlu dikembalikan, dan dia dikembalikan, maka dia tidak perlu membayar untuk kerja yang telah dilakukan oleh hamba itu. Begitu juga, dia boleh menyimpan sebarang hasil daripada pengupahannya, kerana dia bertanggungjawab ke atasnya. Inilah cara yang diamalkan di kalangan kami.\"\n\nMalik berkata, \"Cara yang diamalkan di kalangan kami apabila seseorang membeli beberapa orang hamba dalam satu urus niaga, kemudian mendapati salah seorang daripada mereka telah dicuri atau mempunyai kecacatan, ialah dengan melihat kepada hamba yang telah dicuri atau yang mempunyai kecacatan itu. Sekiranya hamba itu adalah yang terbaik di antara hamba-hamba tersebut, atau yang paling mahal, atau dia membelinya kerana hamba itu, atau dia adalah hamba yang paling cemerlang menurut pandangan orang ramai, maka keseluruhan jual beli itu akan dikembalikan. Sekiranya hamba yang telah dicuri atau yang mempunyai kecacatan itu bukanlah yang terbaik di antara hamba-hamba tersebut, dan dia tidak membelinya kerana hamba itu, dan tiada kelebihan yang dilihat orang ramai terhadapnya, maka hamba yang didapati telah dicuri atau mempunyai kecacatan itu akan dikembalikan sebagaimana adanya, dan pembeli akan dikembalikan wang mengikut bahagian harganya daripada jumlah keseluruhan harga.\""
  },
  {
    "id": 35529,
    "hadith_number": 1351,
    "tajuk_hadith": "Syarat Pembelian Hamba Perempuan",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, bahawa Ubaydullah ibn Abdullah ibn Utba ibn Masud memberitahunya bahawa Abdullah ibn Masud",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ ابْتَاعَ جَارِيَةً مِنِ امْرَأَتِهِ زَيْنَبَ الثَّقَفِيَّةِ وَاشْتَرَطَتْ عَلَيْهِ أَنَّكَ إِنْ بِعْتَهَا فَهِيَ لِي بِالثَّمَنِ الَّذِي تَبِيعُهَا بِهِ فَسَأَلَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ عَنْ ذَلِكَ عُمَرَ بْنَ الْخَطَّابِ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ لاَ تَقْرَبْهَا وَفِيهَا شَرْطٌ لأَحَدٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, bahawa Ubaydullah bin Abdullah bin Utba bin Mas'ud memberitahunya bahawa Abdullah bin Mas'ud membeli seorang hamba perempuan daripada isterinya, Zaynab Ath Thaqafiyyah. Isterinya mensyaratkan kepadanya bahawa jika engkau menjualnya, maka dia akan menjadi milikku semula dengan harga yang engkau jual. Maka Abdullah bin Mas'ud bertanya tentang perkara itu kepada Umar bin al-Khattab. Umar bin al-Khattab berkata, \"Janganlah engkau mendekatinya selagi masih ada syarat daripada orang lain terhadapnya.\""
  },
  {
    "id": 35530,
    "hadith_number": 1352,
    "tajuk_hadith": "Perkahwinan dengan hamba perempuan",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Nafi' daripada Abdullah bin Umar",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ يَقُولُ لاَ يَطَأُ الرَّجُلُ وَلِيدَةً إِلاَّ وَلِيدَةً إِنْ شَاءَ بَاعَهَا وَإِنْ شَاءَ وَهَبَهَا وَإِنْ شَاءَ أَمْسَكَهَا وَإِنْ شَاءَ صَنَعَ بِهَا مَا شَاءَ ‏.‏ قَالَ مَالِكٌ فِيمَنِ اشْتَرَى جَارِيَةً عَلَى شَرْطِ أَنْ لاَ يَبِيعَهَا أَوْ لاَ يَهَبَهَا أَوْ مَا أَشْبَهَ ذَلِكَ مِنَ الشُّرُوطِ فَإِنَّهُ لاَ يَنْبَغِي لِلْمُشْتَرِي أَنْ يَطَأَهَا وَذَلِكَ أَنَّهُ لاَ يَجُوزُ لَهُ أَنْ يَبِيعَهَا وَلاَ يَهَبَهَا فَإِذَا كَانَ لاَ يَمْلِكُ ذَلِكَ مِنْهَا فَلَمْ يَمْلِكْهَا مِلْكًا تَامًّا لأَنَّهُ قَدِ اسْتُثْنِيَ عَلَيْهِ فِيهَا مَا مَلَكَهُ بِيَدِ غَيْرِهِ فَإِذَا دَخَلَ هَذَا الشَّرْطُ لَمْ يَصْلُحْ وَكَانَ بَيْعًا مَكْرُوهًا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Nafi’ daripada Abdullah bin Umar bahawa baginda berkata, \"Tidak sepatutnya seorang lelaki melakukan hubungan intim dengan seorang hamba perempuan melainkan hamba perempuan yang jika dia mahu, dia boleh menjualnya, jika dia mahu, dia boleh memberikannya sebagai hadiah, jika dia mahu, dia boleh menyimpannya, dan jika dia mahu, dia boleh melakukan apa sahaja yang dia mahu terhadapnya.\"  Malik berkata, “Bagi seseorang yang membeli seorang hamba perempuan dengan syarat bahawa dia tidak akan menjualnya, atau memberikannya sebagai hadiah, atau syarat-syarat yang serupa, maka tidak sepatutnya pembeli melakukan hubungan intim dengannya. Ini kerana dia tidak dibenarkan menjualnya atau memberikannya sebagai hadiah.  Oleh itu, jika dia tidak memiliki kuasa sepenuhnya ke atasnya, maka dia tidak memiliki sepenuhnya hamba perempuan tersebut kerana telah ada pengecualian ke atasnya oleh pihak lain. Jika syarat sedemikian dimasukkan, maka ia tidak sah dan jual beli itu adalah makruh.”"
  },
  {
    "id": 35531,
    "hadith_number": 1353,
    "tajuk_hadith": "Ketaatan Uthman ibn Affan kepada Syariat",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab",
    "english_text": "Yahya related to me from Malik from Ibn Shihab that Abdullah ibn\nAmir gave Uthman ibn Affan a slave-girl who had a husband whom he had\npurchased at Basra. Uthman said, \"I will not go near her until her\nhusband separates from her.\" Ibn Amir compensated the husband and he\nseparated from her.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عَامِرٍ، أَهْدَى لِعُثْمَانَ بْنِ عَفَّانَ جَارِيَةً وَلَهَا زَوْجٌ ابْتَاعَهَا بِالْبَصْرَةِ فَقَالَ عُثْمَانُ لاَ أَقْرَبُهَا حَتَّى يُفَارِقَهَا زَوْجُهَا ‏.‏ فَأَرْضَى ابْنُ عَامِرٍ زَوْجَهَا فَفَارَقَهَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab bahawa Abdullah ibn Amir telah memberikan seorang hamba perempuan kepada Uthman ibn Affan. Hamba perempuan itu telah mempunyai suami yang dibelinya di Basrah.  Uthman berkata, \"Aku tidak akan mendekatinya sehingga suaminya meninggalkannya.\"  Kemudian, Abdullah ibn Amir memberikan pampasan kepada suami hamba perempuan itu, lalu suaminya meninggalkannya."
  },
  {
    "id": 35532,
    "hadith_number": 1354,
    "tajuk_hadith": "Pengembalian Hamba Perempuan yang Sudah Berkahwin",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Abu Salamah ibn Abd ar-Rahman ibn Awf",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Abu Salama ibn Abd ar-Rahman ibn Awf that Abd ar-Rahman ibn Awf bought a slave-girl and found that she had a husband, so he returned her.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ، ابْتَاعَ وَلِيدَةً فَوَجَدَهَا ذَاتَ زَوْجٍ فَرَدَّهَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Ibn Shihab, dari Abu Salamah bin Abd ar-Rahman bin Auf bahawa Abd ar-Rahman bin Auf membeli seorang hamba perempuan, lalu didapati bahawa perempuan itu sudah berkahwin, maka dia memulangkannya."
  },
  {
    "id": 35533,
    "hadith_number": 1355,
    "tajuk_hadith": "Jual Beli Pokok Kurma Selepas Persenyawaan",
    "perawi_melayu": "Yahya daripada Malik daripada Nafi' daripada Abdullah bin Umar",
    "english_text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"If palm trees are sold after they have been pollinated, the\nfruit belongs to the seller unless the buyer makes a stipulation about\nits inclusion.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ بَاعَ نَخْلاً قَدْ أُبِّرَتْ فَثَمَرُهَا لِلْبَائِعِ إِلاَّ أَنْ يَشْتَرِطَ الْمُبْتَاعُ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Nafi', dari Abdullah bin Umar bahawa Rasulullah SAW bersabda:  \"Barangsiapa menjual pokok kurma yang telah disenyawakan, maka buahnya adalah milik penjual, kecuali jika pembeli mensyaratkannya.\""
  },
  {
    "id": 35534,
    "hadith_number": 1356,
    "tajuk_hadith": "Larangan Menjual Buah Sebelum Masak",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Nafi', daripada Ibnu Umar",
    "english_text": "Yahya related to me from Malik from Nafi from Ibn Umar that the\nMessenger of Allah, may Allah bless him and grant him peace, forbade\nselling fruit until it had started to ripen. He forbade the\ntransaction to both buyer and seller.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الثِّمَارِ حَتَّى يَبْدُوَ صَلاَحُهَا نَهَى الْبَائِعَ وَالْمُشْتَرِيَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Nafi', daripada Ibnu Umar bahawa Rasulullah SAW melarang menjual buah-buahan sehingga ia mula menunjukkan kematangannya. Baginda melarang urus niaga tersebut kepada penjual dan pembeli."
  },
  {
    "id": 35535,
    "hadith_number": 1357,
    "tajuk_hadith": "Larangan Menjual Buah Sebelum Masak",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Humayd at-Tawil, dari Anas bin Malik",
    "english_text": "Yahya related to me from Malik from Humayd at-Tawil from Anas ibn\nMalik that the Messenger of Allah, may Allah bless him and grant him\npeace, forbade selling fruit until it had become mellow. He was asked,\n\"Messenger ofAllah! What do you mean by become mellow?\" He said, \"When\nit becomes rosy.\"\n\n\nThe Messenger of Allah, may Allah bless him\nand grant him peace, added, \"Allah may prevent the fruit from\nmaturing, so how can you take payment from your brother for it.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الثِّمَارِ حَتَّى تُزْهِيَ ‏.‏ فَقِيلَ لَهُ يَا رَسُولَ اللَّهِ وَمَا تُزْهِي فَقَالَ ‏\"‏ حِينَ تَحْمَرُّ ‏\"‏ ‏.‏ وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَرَأَيْتَ إِذَا مَنَعَ اللَّهُ الثَّمَرَةَ فَبِمَ يَأْخُذُ أَحَدُكُمْ مَالَ أَخِيهِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Humayd at-Tawil, daripada Anas bin Malik bahawa Rasulullah SAW melarang penjualan buah-buahan sehingga ia masak. Baginda ditanya, \"Wahai Rasulullah! Apakah maksud masak itu?\" Baginda menjawab, \"Apabila ia bertukar merah.\" \n\nRasulullah SAW menambah, \"Bagaimana jika Allah SWT menghalang buah itu daripada masak, maka dengan apakah kamu mengambil bayaran daripada saudaramu?"
  },
  {
    "id": 35536,
    "hadith_number": 1358,
    "tajuk_hadith": "Larangan Menjual Buah Sebelum Matang",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Abu'r-Rijal, Muhammad bin Abd ar-Rahman bin Haritha dari ibunya, Amra binti Abd ar-Rahman",
    "english_text": "Yahya related to me from Malik from Abu'r-Rijal Muhammad ibn Abd\nar-Rahman ibn Haritha from his mother, Amra bint Abd ar-Rahman that\nthe Messenger of Allah, may Allah bless him and grant him peace,\nforbade selling fruit until it was clear of blight. Malik said,\n\"Selling fruit before it has begun to ripen is an uncertain\ntransaction (gharar) .\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الرِّجَالِ، مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ حَارِثَةَ عَنْ أُمِّهِ، عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الثِّمَارِ حَتَّى تَنْجُوَ مِنَ الْعَاهَةِ ‏.‏ قَالَ مَالِكٌ وَبَيْعُ الثِّمَارِ قَبْلَ أَنْ يَبْدُوَ صَلاَحُهَا مِنْ بَيْعِ الْغَرَرِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Abu'r-Rijal, Muhammad bin Abd ar-Rahman bin Haritha daripada ibunya, Amra binti Abd ar-Rahman bahawa Rasulullah SAW melarang penjualan buah-buahan sehingga ia bebas daripada penyakit. Malik berkata, \"Penjualan buah-buahan sebelum ia mula masak adalah termasuk jual beli yang tidak pasti (gharar).\""
  },
  {
    "id": 35537,
    "hadith_number": 1359,
    "tajuk_hadith": "Penjualan Buah-buahan dan Sayuran",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Abu az-Zinad, daripada Kharija bin Zayd bin Thabit, daripada Zayd bin Thabit",
    "english_text": "Yahya related to me from Malik from Abu'z-Zinad from Kharija ibn\nZayd ibn Thabit that Zayd ibn Thabit did not sell fruit until the\nPleiades were visible, at the end of May.\n\n\nMalik said, \"The\nway of doing things among us about selling melons, cucumbers, water-\nmelons, and carrots is that it is halal to sell them when it is clear\nthat they have begun to ripen. Then the buyer has what grows until the\nseason is over. There is no specific timing laid down for that because\nthe time is well known with people, and it may happen that the crop\nwill be affected by blight and put a premature end to the season. If\nblight strikes and a third or more of the crop is damaged, an\nallowance for that is deducted from the price of purchase.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنْ خَارِجَةَ بْنِ زَيْدِ بْنِ ثَابِتٍ، عَنْ زَيْدِ بْنِ ثَابِتٍ، أَنَّهُ كَانَ لاَ يَبِيعُ ثِمَارَهُ حَتَّى تَطْلُعَ الثُّرَيَّا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Abu az-Zinad, daripada Kharija bin Zayd bin Thabit, daripada Zayd bin Thabit bahawa beliau tidak menjual buah-buahannya sehingga bintang Thuraiya (Pleiades) muncul.  Malik berkata, \"Cara urus niaga di kalangan kami mengenai jual beli tembikai, timun, tembikai air, dan lobak merah ialah ia halal untuk dijual apabila jelas bahawa ia telah mula masak. Kemudian pembeli berhak mendapat hasil tanaman sehingga musim berakhir. Tiada masa spesifik yang ditetapkan kerana masa itu diketahui umum, dan mungkin berlaku tanaman tersebut akan rosak akibat penyakit dan menamatkan musim lebih awal. Sekiranya penyakit menyerang dan sekurang-kurangnya sepertiga daripada tanaman rosak, maka potongan harga akan dibuat.\" "
  },
  {
    "id": 35538,
    "hadith_number": 1360,
    "tajuk_hadith": "Keizinan Menjual Kurma Sebelum Dipetik",
    "perawi_melayu": "Yahya daripada Malik daripada Nafi' daripada Abdullah bin Umar daripada Zayd bin Thabit",
    "english_text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nfrom Zayd ibn Thabit that the Messenger of Allah, may Allah bless him\nand grant him peace, allowed the holder of an ariya to barter the\ndates on the palm for the amount of dried dates it was estimated that\nthe palms would produce.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ زَيْدِ بْنِ ثَابِتٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَرْخَصَ لِصَاحِبِ الْعَرِيَّةِ أَنْ يَبِيعَهَا بِخَرْصِهَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Nafi', daripada Abdullah bin Umar, daripada Zayd bin Thabit bahawa Rasulullah SAW membenarkan pemilik ariyah menjualnya berdasarkan anggaran hasil kurma kering yang akan diperoleh."
  },
  {
    "id": 35539,
    "hadith_number": 1361,
    "tajuk_hadith": "Perdagangan Hasil Kurma Sebelum Dipetik",
    "perawi_melayu": "Yahya daripada Malik daripada Da'ud ibn al-Husayn, daripada Abu Sufyan, mawla Ibn Abi Ahmad, daripada Abu Hurairah",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، عَنْ أَبِي سُفْيَانَ، مَوْلَى ابْنِ أَبِي أَحْمَدَ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَرْخَصَ فِي بَيْعِ الْعَرَايَا بِخَرْصِهَا فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ أَوْ فِي خَمْسَةِ أَوْسُقٍ ‏.‏ يَشُكُّ دَاوُدُ قَالَ خَمْسَةِ أَوْسُقٍ أَوْ دُونَ خَمْسَةِ أَوْسُقٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Da'ud bin al-Husayn, dari Abu Sufyan, mawla Ibnu Abi Ahmad, dari Abu Hurairah, bahawa Rasulullah SAW membenarkan jual beli hasil kurma (ariya) dengan anggaran jumlahnya sebelum dipetik, bagi jumlah kurang daripada lima awsuq atau lima awsuq. Da'ud ragu-ragu sama ada baginda menyebut lima awsuq atau kurang daripada lima awsuq.\n\nMalik berkata, \"Ariya boleh dijual dengan anggaran jumlah kurma kering yang akan dihasilkan. Hasil tanaman diperiksa dan dianggarkan ketika masih di pokok. Ini dibenarkan kerana ia termasuk dalam kategori pendelegasian tanggungjawab, penyerahan hak, dan melibatkan rakan kongsi. Sekiranya ia seperti jual beli biasa, tiada sesiapa akan menjadikan orang lain rakan kongsi dalam hasil tersebut sehingga ia siap, dan tidak akan melepaskan haknya ke atas apa-apa bahagian daripadanya atau meletakkan seseorang yang bertanggungjawab ke atasnya sehingga pembeli mengambil hak miliknya.\""
  },
  {
    "id": 35540,
    "hadith_number": 1362,
    "tajuk_hadith": "Sumpah Tidak Berbuat Baik",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Abu ar-Rijal, Muhammad bin Abd ar-Rahman dari ibunya, Amra binti Abd ar-Rahman.",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الرِّجَالِ، مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أُمِّهِ، عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ أَنَّهُ سَمِعَهَا تَقُولُ، ابْتَاعَ رَجُلٌ ثَمَرَ حَائِطٍ فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَعَالَجَهُ وَقَامَ فِيهِ حَتَّى تَبَيَّنَ لَهُ النُّقْصَانُ فَسَأَلَ رَبَّ الْحَائِطِ أَنْ يَضَعَ لَهُ أَوْ أَنْ يُقِيلَهُ فَحَلَفَ أَنْ لاَ يَفْعَلَ فَذَهَبَتْ أُمُّ الْمُشْتَرِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَتْ ذَلِكَ لَهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ تَأَلَّى أَنْ لاَ يَفْعَلَ خَيْرًا ‏\"‏ ‏.‏ فَسَمِعَ بِذَلِكَ رَبُّ الْحَائِطِ فَأَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ هُوَ لَهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abu ar-Rijal, Muhammad bin Abd ar-Rahman daripada ibunya, Amra binti Abd ar-Rahman bahawa dia mendengar ibunya berkata: Seorang lelaki membeli hasil kebun yang bertembok pada zaman Rasulullah SAW.  Dia mengusahakannya dan tinggal di situ sehingga dia mendapati akan mengalami kerugian.  Dia meminta pemilik kebun untuk menurunkan harga atau membatalkan jual beli, tetapi pemilik kebun bersumpah tidak akan berbuat demikian.  Ibu pembeli pergi kepada Rasulullah SAW dan menceritakan hal tersebut.  Rasulullah SAW bersabda: \"Dia telah bersumpah untuk tidak berbuat baik.\" Pemilik kebun mendengar hal itu lalu pergi kepada Rasulullah SAW dan berkata: \"Wahai Rasulullah, pilihan itu adalah miliknya.\""
  },
  {
    "id": 35541,
    "hadith_number": 1363,
    "tajuk_hadith": "Keputusan Umar ibn Abd al-Aziz Mengenai Kerugian Tanaman",
    "perawi_melayu": "Yahya daripada Malik",
    "english_text": "Yahya related to me from Malik that he had heard that Umar ibn\nAbd al-Aziz decided in a case to make a reduction for crop damage.\n\n\nMalik said, \"That is what we do in the situation.\"\n\n\nMalik added, \"Crop damage is whatever causes loss of a third or more\nfor the purchaser. Anything less is not counted as crop damage.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، قَضَى بِوَضْعِ الْجَائِحَةِ ‏.‏ قَالَ مَالِكٌ وَعَلَى ذَلِكَ الأَمْرُ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ وَالْجَائِحَةُ الَّتِي تُوضَعُ عَنِ الْمُشْتَرِي الثُّلُثُ فَصَاعِدًا وَلاَ يَكُونُ مَا دُونَ ذَلِكَ جَائِحَةً ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik bahawa baginda telah mendengar bahawa Umar ibn Abd al-Aziz telah membuat keputusan dalam suatu kes untuk mengurangkan kerugian tanaman.\n\nMalik berkata, \"Itulah yang kami lakukan dalam situasi ini.\"\n\nMalik menambah, \"Kerugian tanaman ialah apa sahaja yang menyebabkan kehilangan sebanyak satu pertiga atau lebih bagi pembeli. Apa sahaja yang kurang daripada itu tidak dikira sebagai kerugian tanaman.\""
  },
  {
    "id": 35542,
    "hadith_number": 1364,
    "tajuk_hadith": "Al-Qasim ibn Muhammad Menjual Hasil Kebunnya",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Rabiah ibn Abi Abdur Rahman",
    "english_text": "Yahya related to me from Malik from Rabia ibn Abd ar-Rahman that\nal-Qasim ibn Muhammad would sell produce from his orchard and keep\nsome of it aside.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، كَانَ يَبِيعُ ثَمَرَ حَائِطِهِ وَيَسْتَثْنِي مِنْهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Rabiah bin Abi Abdur Rahman, bahawa al-Qasim bin Muhammad, biasa menjual hasil kebunnya dan menyimpan sebahagian daripadanya."
  },
  {
    "id": 35543,
    "hadith_number": 1365,
    "tajuk_hadith": "Jualan Hasil Kebun Kurma",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Abdullah ibn Abi Bakr",
    "english_text": "Yahya related to me from Malik from Abdullah ibn Abi Bakr that\nhis grandfather, Muhammad ibn Amr ibn Hazm sold the fruit of an\norchard of his called al-Afraq, for 4,000 dirhams, and he kept aside\n800 dirhams' worth of dry dates.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، أَنَّ جَدَّهُ، مُحَمَّدَ بْنَ عَمْرِو بْنِ حَزْمٍ بَاعَ ثَمَرَ حَائِطٍ لَهُ يُقَالُ لَهُ الأَفْرَاقُ بِأَرْبَعَةِ آلاَفِ دِرْهَمٍ وَاسْتَثْنَى مِنْهُ بِثَمَانِمِائَةِ دِرْهَمٍ تَمْرًا ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Abdullah bin Abi Bakr, bahawa datuknya, Muhammad bin Amr bin Hazm telah menjual hasil kebunnya yang bernama al-Afraq dengan harga empat ribu dirham, dan dia mengetepikan tamar (kurma kering) bernilai lapan ratus dirham."
  },
  {
    "id": 35544,
    "hadith_number": 1366,
    "tajuk_hadith": "Menjual Hasil Kebun dan Pengecualian",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Abu'r-Rijal, Muhammad ibn Abd ar-Rahman ibn Haritha",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الرِّجَالِ، مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ حَارِثَةَ أَنَّ أُمَّهُ، عَمْرَةَ بِنْتَ عَبْدِ الرَّحْمَنِ كَانَتْ تَبِيعُ ثِمَارَهَا وَتَسْتَثْنِي مِنْهَا ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّ الرَّجُلَ إِذَا بَاعَ ثَمَرَ حَائِطِهِ أَنَّ لَهُ أَنْ يَسْتَثْنِيَ مِنْ ثَمَرِ حَائِطِهِ مَا بَيْنَهُ وَبَيْنَ ثُلُثِ الثَّمَرِ لاَ يُجَاوِزُ ذَلِكَ وَمَا كَانَ دُونَ الثُّلُثِ فَلاَ بَأْسَ بِذَلِكَ ‏.‏ قَالَ مَالِكٌ فَأَمَّا الرَّجُلُ يَبِيعُ ثَمَرَ حَائِطِهِ وَيَسْتَثْنِي مِنْ ثَمَرِ حَائِطِهِ ثَمَرَ نَخْلَةٍ أَوْ نَخَلاَتٍ يَخْتَارُهَا وَيُسَمِّي عَدَدَهَا فَلاَ أَرَى بِذَلِكَ بَأْسًا لأَنَّ رَبَّ الْحَائِطِ إِنَّمَا اسْتَثْنَى شَيْئًا مِنْ ثَمَرِ حَائِطِ نَفْسِهِ وَإِنَّمَا ذَلِكَ شَىْءٌ احْتَبَسَهُ مِنْ حَائِطِهِ وَأَمْسَكَهُ لَمْ يَبِعْهُ وَبَاعَ مِنْ حَائِطِهِ مَا سِوَى ذَلِكَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Abu'r-Rijal, Muhammad bin Abd ar-Rahman bin Haritha bahawa ibunya, Amra binti Abd ar-Rahman, biasa menjual buah-buahannya dan mengecualikan sebahagian daripadanya. Malik berkata, \"Amalan yang disepakati di kalangan kami ialah jika seseorang lelaki menjual hasil kebunnya, dia dibenarkan mengecualikan sehingga satu pertiga daripada hasil kebunnya, dan tidak boleh melebihi had itu.  Tidak mengapa jika kurang daripada satu pertiga.\" Malik menambah bahawa baginda berpendapat tidak mengapa bagi seseorang lelaki menjual hasil kebunnya dan mengecualikan hanya buah daripada pokok kurma tertentu atau beberapa pokok kurma yang telah dipilihnya dan telah dinyatakan bilangannya, kerana pemilik kebun itu hanya mengecualikan sebahagian buah daripada kebunnya sendiri dan selebihnya dijualnya."
  },
  {
    "id": 35545,
    "hadith_number": 1367,
    "tajuk_hadith": "Pertukaran Kurma yang Sama dan Adil",
    "perawi_melayu": "Yahya, Malik, Zayd bin Aslam, dan Ata bin Yasar",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ التَّمْرُ بِالتَّمْرِ مِثْلاً بِمِثْلٍ ‏\"‏ ‏.‏ فَقِيلَ لَهُ إِنَّ عَامِلَكَ عَلَى خَيْبَرَ يَأْخُذُ الصَّاعَ بِالصَّاعَيْنِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ادْعُوهُ لِي ‏\"‏ ‏.‏ فَدُعِيَ لَهُ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَأْخُذُ الصَّاعَ بِالصَّاعَيْنِ ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ لاَ يَبِيعُونَنِي الْجَنِيبَ بِالْجَمْعِ صَاعًا بِصَاعٍ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بِعِ الْجَمْعَ بِالدَّرَاهِمِ ثُمَّ ابْتَعْ بِالدَّرَاهِمِ جَنِيبًا ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Zayd bin Aslam, dari Ata bin Yasar bahawa baginda berkata: Rasulullah SAW bersabda, \"Kurma ditukar dengan kurma yang sama jenis dan mutu.\" Kemudian baginda dimaklumkan, \"Wakil baginda di Khaibar mengambil satu saa dengan dua saa.\" Rasulullah SAW bersabda, \"Panggil dia kepadaKu.\" Maka dia dipanggil. Rasulullah SAW bertanya kepadanya, \"Adakah engkau mengambil satu saa dengan dua saa?\" Dia menjawab, \"Wahai Rasulullah, mereka tidak menjual kurma yang baik kepadaku dengan kurma yang kurang baik, satu saa dengan satu saa.\" Rasulullah SAW bersabda, \"Jual kurma yang kurang baik itu dengan wang, kemudian beli kurma yang baik dengan wang itu.\""
  },
  {
    "id": 35546,
    "hadith_number": 1368,
    "tajuk_hadith": "Larangan Menukar Kurma Berkualiti Rendah dengan Kurma Berkualiti Tinggi",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Abd al-Hamid ibn Suhayl ibn Abd ar-Rahman ibn Awf, dari Said ibn al-Musayyab, dari Abu Said al-Khudri dan dari Abu Hurairah",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الْحَمِيدِ بْنِ سُهَيْلِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، وَعَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَعْمَلَ رَجُلاً عَلَى خَيْبَرَ فَجَاءَهُ بِتَمْرٍ جَنِيبٍ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَكُلُّ تَمْرِ خَيْبَرَ هَكَذَا ‏\"‏ ‏.‏ فَقَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ إِنَّا لَنَأْخُذُ الصَّاعَ مِنْ هَذَا بِالصَّاعَيْنِ وَالصَّاعَيْنِ بِالثَّلاَثَةِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَفْعَلْ بِعِ الْجَمْعَ بِالدَّرَاهِمِ ثُمَّ ابْتَعْ بِالدَّرَاهِمِ جَنِيبًا ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abd al-Hamid ibn Suhayl ibn Abd ar-Rahman ibn Awf, daripada Said ibn al-Musayyab, daripada Abu Said al-Khudri, dan daripada Abu Hurairah bahawa Rasulullah SAW telah melantik seorang lelaki sebagai wakil di Khaybar.  Lelaki itu membawa kepadanya beberapa kurma yang berkualiti tinggi. Rasulullah SAW bertanya kepadanya, \"Adakah semua kurma di Khaybar seperti ini?\" Lelaki itu menjawab, \"Tidak, demi Allah, wahai Rasulullah! Kami menukar satu sa' kurma seperti ini dengan dua sa', dan dua sa' dengan tiga sa'.\"  Rasulullah SAW bersabda, \"Janganlah kamu berbuat demikian. Juallah kurma yang pelbagai jenis itu dengan wang dirham, kemudian belilah kurma yang berkualiti tinggi dengan wang tersebut.\""
  },
  {
    "id": 35547,
    "hadith_number": 1369,
    "tajuk_hadith": "Larangan Menjual Gandum Putih dengan Barli Berkualiti",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Abdullah ibn Yazid, bahawa Zayd ibn Ayyash memberitahunya bahawa beliau pernah bertanya kepada Sa'd ibn Abi Waqqas tentang penjualan gandum putih dengan sejenis barli yang baik.",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، أَنَّ زَيْدًا أَبَا عَيَّاشٍ، أَخْبَرَهُ أَنَّهُ، سَأَلَ سَعْدَ بْنَ أَبِي وَقَّاصٍ عَنِ الْبَيْضَاءِ، بِالسُّلْتِ فَقَالَ لَهُ سَعْدٌ أَيَّتُهُمَا أَفْضَلُ قَالَ الْبَيْضَاءُ ‏.‏ فَنَهَاهُ عَنْ ذَلِكَ ‏.‏ وَقَالَ سَعْدٌ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُسْأَلُ عَنِ اشْتِرَاءِ التَّمْرِ بِالرُّطَبِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَيَنْقُصُ الرُّطَبُ إِذَا يَبِسَ ‏\"‏ ‏.‏ فَقَالُوا نَعَمْ ‏.‏ فَنَهَى عَنْ ذَلِكَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abdullah bin Yazid, bahawa Zayd Abu Ayyasy memberitahunya bahawa beliau pernah bertanya kepada Sa'd bin Abi Waqqas tentang penjualan gandum putih dengan barli yang berkualiti.  Sa'd bertanya kepadanya, “Manakah yang lebih baik?”  Beliau menjawab, “Gandum putih.” Maka Sa’d melarangnya daripada melakukan transaksi tersebut. Sa’d berkata, “Aku mendengar Rasulullah SAW ditanya tentang pembelian kurma kering dengan kurma basah.  Rasulullah SAW bertanya, ‘Adakah kurma basah berkurang saiznya apabila kering?’  Mereka menjawab, ‘Ya.’ Maka baginda melarang (perbuatan itu)."
  },
  {
    "id": 35548,
    "hadith_number": 1370,
    "tajuk_hadith": "Larangan Muzabana",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Nafi', daripada Abdullah bin Umar",
    "english_text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nforbade muzabana. Muzabana was selling fresh dates for dried dates by\nmeasure, and selling grapes for raisins by measure.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُزَابَنَةِ وَالْمُزَابَنَةُ بَيْعُ الثَّمَرِ بِالتَّمْرِ كَيْلاً وَبَيْعُ الْكَرْمِ بِالزَّبِيبِ كَيْلاً ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Nafi', dari Abdullah bin Umar bahawa Rasulullah SAW melarang muzabana. Muzabana ialah menjual buah tamar segar dengan tamar kering secara sukatan, dan menjual buah anggur dengan kismis secara sukatan."
  },
  {
    "id": 35549,
    "hadith_number": 1371,
    "tajuk_hadith": "Larangan Muzabanah dan Muhaaqalah",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Daud bin al-Husayn, daripada Abu Sufyan, mawla Ibnu Abi Ahmad, daripada Abu Said al-Khudri",
    "english_text": "Yahya related to me from Malik from Da'ud ibn al-Husayn from Abu\nSufyan, the mawla of Ibn Abi Ahmad, from Abu Said al-Khudri that the\nMessenger of Allah, may Allah bless him and grant him peace, forbade\nmuzabana and muhaqala. Muzabana was selling fresh dates for dried\ndates while they were still on the trees. Muhaqala was renting land in\nexchange for wheat.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، عَنْ أَبِي سُفْيَانَ، مَوْلَى ابْنِ أَبِي أَحْمَدَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُزَابَنَةِ وَالْمُحَاقَلَةِ وَالْمُزَابَنَةُ اشْتِرَاءُ الثَّمَرِ بِالتَّمْرِ فِي رُءُوسِ النَّخْلِ وَالْمُحَاقَلَةُ كِرَاءُ الأَرْضِ بِالْحِنْطَةِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Daud bin al-Husayn, daripada Abu Sufyan, mawla Ibnu Abi Ahmad, daripada Abu Said al-Khudri bahawa Rasulullah SAW melarang muzabanah dan muhaaqalah. Muzabanah ialah menjual buah tamar yang masih di pokok dengan tamar kering. Muhaaqalah ialah menyewa tanah dengan bayaran gandum."
  },
  {
    "id": 35550,
    "hadith_number": 1372,
    "tajuk_hadith": "Larangan Muzabana dan Muhaqaqala",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Ibn Shihab daripada Said ibn al-Musayyab",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُزَابَنَةِ وَالْمُحَاقَلَةِ وَالْمُزَابَنَةُ اشْتِرَاءُ الثَّمَرِ بِالتَّمْرِ وَالْمُحَاقَلَةُ اشْتِرَاءُ الزَّرْعِ بِالْحِنْطَةِ وَاسْتِكْرَاءُ الأَرْضِ بِالْحِنْطَةِ ‏.‏ قَالَ ابْنُ شِهَابٍ فَسَأَلْتُ سَعِيدَ بْنَ الْمُسَيَّبِ عَنِ اسْتِكْرَاءِ الأَرْضِ بِالذَّهَبِ وَالْوَرِقِ فَقَالَ لاَ بَأْسَ بِذَلِكَ ‏.‏ قَالَ مَالِكٌ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُزَابَنَةِ وَتَفْسِيرُ الْمُزَابَنَةِ أَنَّ كُلَّ شَىْءٍ مِنَ الْجِزَافِ الَّذِي لاَ يُعْلَمُ كَيْلُهُ وَلاَ وَزْنُهُ وَلاَ عَدَدُهُ ابْتِيعَ بِشَىْءٍ مُسَمًّى مِنَ الْكَيْلِ أَوِ الْوَزْنِ أَوِ الْعَدَدِ وَذَلِكَ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ يَكُونُ لَهُ الطَّعَامُ الْمُصَبَّرُ الَّذِي لاَ يُعْلَمُ كَيْلُهُ مِنَ الْحِنْطَةِ أَوِ التَّمْرِ أَوْ مَا أَشْبَهَ ذَلِكَ مِنَ الأَطْعِمَةِ أَوْ يَكُونُ لِلرَّجُلِ السِّلْعَةُ مِنَ الْحِنْطَةِ أَوِ النَّوَى أَوِ الْقَضْبِ أَوِ الْعُصْفُرِ أَوِ الْكُرْسُفِ أَوِ الْكَتَّانِ أَوِ الْقَزِّ أَوْ مَا أَشْبَهَ ذَلِكَ مِنَ السِّلَعِ لاَ يُعْلَمُ كَيْلُ شَىْءٍ مِنْ ذَلِكَ وَلاَ وَزْنُهُ وَلاَ عَدَدُهُ فَيَقُولُ الرَّجُلُ لِرَبِّ تِلْكَ السِّلْعَةِ كِلْ سِلْعَتَكَ هَذِهِ أَوْ مُرْ مَنْ يَكِيلُهَا أَوْ زِنْ مِنْ ذَلِكَ مَا يُوزَنُ أَوْ عُدَّ مِنْ ذَلِكَ مَا كَانَ يُعَدُّ فَمَا نَقَصَ عَنْ كَيْلِ كَذَا وَكَذَا صَاعًا - لِتَسْمِيَةٍ يُسَمِّيهَا - أَوْ وَزْنِ كَذَا وَكَذَا رِطْلاً أَوْ عَدَدِ كَذَا وَكَذَا فَمَا نَقَصَ مِنْ ذَلِكَ فَعَلَىَّ غُرْمُهُ لَكَ حَتَّى أُوفِيَكَ تِلْكَ التَّسْمِيَةَ فَمَا زَادَ عَلَى تِلْكَ التَّسْمِيَةِ فَهُوَ لِي أَضْمَنُ مَا نَقَصَ مِنْ ذَلِكَ عَلَى أَنْ يَكُونَ لِي مَا زَادَ ‏.‏ فَلَيْسَ ذَلِكَ بَيْعًا وَلَكِنَّهُ الْمُخَاطَرَةُ وَالْغَرَرُ وَالْقِمَارُ يَدْخُلُ هَذَا لأَنَّهُ لَمْ يَشْتَرِ مِنْهُ شَيْئًا بِشَىْءٍ أَخْرَجَهُ وَلَكِنَّهُ ضَمِنَ لَهُ مَا سُمِّيَ مِنْ ذَلِكَ الْكَيْلِ أَوِ الْوَزْنِ أَوِ الْعَدَدِ عَلَى أَنْ يَكُونَ لَهُ مَا زَادَ عَلَى ذَلِكَ فَإِنْ نَقَصَتْ تِلْكَ السِّلْعَةُ عَنْ تِلْكَ التَّسْمِيَةِ أَخَذَ مِنْ مَالِ صَاحِبِهِ مَا نَقَصَ بِغَيْرِ ثَمَنٍ وَلاَ هِبَةٍ طَيِّبَةٍ بِهَا نَفْسُهُ فَهَذَا يُشْبِهُ الْقِمَارَ وَمَا كَانَ مِثْلَ هَذَا مِنَ الأَشْيَاءِ فَذَلِكَ يَدْخُلُهُ ‏.‏ قَالَ مَالِكٌ وَمِنْ ذَلِكَ أَيْضًا أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ لَهُ الثَّوْبُ أَضْمَنُ لَكَ مِنْ ثَوْبِكَ هَذَا كَذَا وَكَذَا ظِهَارَةَ قَلَنْسُوَةٍ قَدْرُ كُلِّ ظِهَارَةٍ كَذَا وَكَذَا - لِشَىْءٍ يُسَمِّيهِ - فَمَا نَقَصَ مِنْ ذَلِكَ فَعَلَىَّ غُرْمُهُ حَتَّى أُوفِيَكَ وَمَا زَادَ فَلِي ‏.‏ أَوْ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ أَضْمَنُ لَكَ مِنْ ثِيَابِكَ هَذِي كَذَا وَكَذَا قَمِيصًا ذَرْعُ كُلِّ قَمِيصٍ كَذَا وَكَذَا فَمَا نَقَصَ مِنْ ذَلِكَ فَعَلَىَّ غُرْمُهُ وَمَا زَادَ عَلَى ذَلِكَ فَلِي ‏.‏ أَوْ أَنْ يَقُولُ الرَّجُلُ لِلرَّجُلِ لَهُ الْجُلُودُ مِنْ جُلُودِ الْبَقَرِ أَوِ الإِبِلِ أُقَطِّعُ جُلُودَكَ هَذِهِ نِعَالاً عَلَى إِمَامٍ يُرِيهِ إِيَّاهُ ‏.‏ فَمَا نَقَصَ مِنْ مِائَةِ زَوْجٍ فَعَلَىَّ غُرْمُهُ وَمَا زَادَ فَهُوَ لِي بِمَا ضَمِنْتُ لَكَ ‏.‏ وَمِمَّا يُشْبِهُ ذَلِكَ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ عِنْدَهُ حَبُّ الْبَانِ اعْصُرْ حَبَّكَ هَذَا فَمَا نَقَصَ مِنْ كَذَا وَكَذَا رِطْلاً فَعَلَىَّ أَنْ أُعْطِيَكَهُ وَمَا زَادَ فَهُوَ لِي ‏.‏ فَهَذَا كُلُّهُ وَمَا أَشْبَهَهُ مِنَ الأَشْيَاءِ أَوْ ضَارَعَهُ مِنَ الْمُزَابَنَةِ الَّتِي لاَ تَصْلُحُ وَلاَ تَجُوزُ ‏.‏ وَكَذَلِكَ - أَيْضًا - إِذَا قَالَ الرَّجُلُ لِلرَّجُلِ لَهُ الْخَبَطُ أَوِ النَّوَى أَوِ الْكُرْسُفُ أَوِ الْكَتَّانُ أَوِ الْقَضْبُ أَوِ الْعُصْفُرُ أَبْتَاعُ مِنْكَ هَذَا الْخَبَطَ بِكَذَا وَكَذَا صَاعًا مِنْ خَبَطٍ يُخْبَطُ مِثْلَ خَبَطِهِ أَوْ هَذَا النَّوَى بِكَذَا وَكَذَا صَاعًا مِنْ نَوًى مِثْلِهِ وَفِي الْعُصْفُرِ وَالْكُرْسُفِ وَالْكَتَّانِ وَالْقَضْبِ مِثْلَ ذَلِكَ ‏.‏ فَهَذَا كُلُّهُ يَرْجِعُ إِلَى مَا وَصَفْنَا مِنَ الْمُزَابَنَةِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Ibn Shihab daripada Said bin al-Musayyab bahawa Rasulullah SAW melarang muzabana dan muhaqaqalah. Muzabana ialah membeli tamar segar dengan tamar kering. Muhaqaqalah ialah membeli tanaman dengan gandum dan menyewa tanah dengan gandum.\n\nIbn Shihab menambah bahawa beliau pernah bertanya kepada Said bin al-Musayyab tentang menyewa tanah dengan emas dan perak. Beliau berkata, \"Tiada apa-apa masalah dengannya.\"\n\nMalik berkata, \"Rasulullah SAW melarang muzabana. Tafsiran muzabana ialah setiap sesuatu yang tidak diketahui sukatan, berat atau bilangannya dijual dengan sesuatu yang telah disahkan sukatan, berat atau bilangannya. Contohnya, jika seseorang mempunyai timbunan makanan yang tidak diketahui sukatannya sama ada gandum, tamar atau makanan lain, atau seseorang mempunyai barangan seperti gandum, biji tamar, herba, bunga safron, kapas, rami, sutera dan tidak mengetahui sukatan, berat atau bilangannya, kemudian seorang pembeli menghampirinya dan mencadangkan supaya dia menyukat, menimbang atau mengira barangan tersebut, tetapi sebelum itu, dia menetapkan berat, sukatan atau bilangan tertentu dan menjamin untuk membayar harga bagi jumlah tersebut, bersetuju bahawa apa sahaja yang kurang daripada jumlah itu adalah kerugian baginya dan apa sahaja yang melebihi jumlah itu adalah keuntungan baginya. Itu bukanlah jual beli. Ia adalah mengambil risiko dan transaksi yang tidak menentu. Ia termasuk dalam kategori perjudian kerana dia tidak membeli sesuatu daripadanya dengan sesuatu yang pasti yang dibayarnya. Segala sesuatu yang menyerupai ini juga dilarang.\"\n\nMalik berkata bahawa contoh lain ialah, contohnya, seseorang mencadangkan kepada orang lain, \"Anda mempunyai kain. Saya akan menjamin kepada anda daripada kain anda ini sekian banyak jubah bertopi, sukatan setiap jubah adalah sekian-sekian (menyatakan ukuran). Apa sahaja kerugian yang ada, adalah tanggungjawab saya dan saya akan melunaskan jumlah yang ditetapkan dan apa sahaja lebihan yang ada, adalah milik saya.\" Atau mungkin orang itu mencadangkan, \"Saya akan menjamin kepada anda daripada kain anda ini sekian banyak kemeja, ukuran setiap kemeja adalah sekian-sekian, dan apa sahaja kerugian yang ada, adalah tanggungjawab saya dan saya akan melunaskan jumlah yang ditetapkan dan apa sahaja lebihan yang ada, adalah milik saya.\" Atau mungkin seseorang mencadangkan kepada orang yang mempunyai kulit lembu atau unta, \"Saya akan memotong kulit anda ini menjadi sandal mengikut corak yang akan saya tunjukkan kepada anda. Apa sahaja yang kurang daripada seratus pasang, saya akan menanggung kerugiannya dan apa sahaja yang lebih adalah milik saya kerana saya telah menjaminnya.\" Contoh lain ialah seseorang berkata kepada orang yang mempunyai biji ben, \"Saya akan memerah biji anda ini. Apa sahaja yang kurang daripada sekian-sekian berat mengikut paun, saya akan melengkapkannya, dan apa sahaja yang lebih daripada itu adalah milik saya.\"\n\nMalik berkata bahawa semua ini dan apa sahaja yang serupa atau menyerupainya termasuk dalam kategori muzabana, yang tidak baik dan tidak dibenarkan. Begitu juga halnya jika seseorang berkata kepada orang yang mempunyai daun makanan ternakan, biji tamar, kapas, rami, herba atau bunga safron, \"Saya akan membeli daun ini daripada anda sebagai pertukaran bagi sekian-sekian sa' (menunjukkan daun yang ditumbuk seperti daunnya)... atau biji tamar ini untuk sekian-sekian sa' biji tamar seperti ini, dan yang serupa dengan itu dalam hal bunga safron, kapas, rami dan herba.\"\n\nMalik berkata, \"Semua ini adalah apa yang telah kita huraikan tentang muzabana.\""
  },
  {
    "id": 35551,
    "hadith_number": 1373,
    "tajuk_hadith": "Pembelian Kurma, Susu, dan Harta Lain Secara Tunai",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Malik berkata, \"Tiada apa-apa yang salah dalam membeli kurma daripada pokok atau kebun tertentu, atau membeli susu daripada biri-biri tertentu apabila pembeli mengambilnya sebaik sahaja dia membayar harganya.  Ini sama seperti membeli minyak daripada bekas. Seseorang membeli sebahagian daripadanya dengan satu atau dua dinar dan memberikan emasnya dan menetapkan bahawa ia diukur untuknya. Tiada apa-apa yang salah dengan itu. Jika bekas itu pecah dan minyak itu terbuang, pembeli mendapat kembali emasnya dan tiada transaksi di antara mereka.\"\n\nMalik berkata, \"Tiada apa-apa yang salah dalam semua yang diambil serta-merta sebagaimana adanya, seperti susu segar dan kurma segar yang boleh diambil oleh pembeli setiap hari. Jika bekalan habis sebelum pembeli mendapat apa yang telah dibayar sepenuhnya, penjual mengembalikan sebahagian emas yang terhutang kepadanya, atau pembeli mengambil barang lain daripada penjual mengikut nilai apa yang terhutang dan yang mereka sepakati bersama. Pembeli hendaklah berada bersama penjual sehingga dia menerimanya.  Ia tidak digalakkan bagi penjual untuk meninggalkan pembeli kerana transaksi itu akan jatuh ke dalam kategori hutang bagi hutang yang dilarang. Jika tempoh masa yang dinyatakan untuk pembayaran atau penghantaran dimasukkan ke dalam transaksi, ia juga tidak digalakkan. Kelewatan dan penangguhan tidak dibenarkan di dalamnya, dan hanya boleh diterima apabila ia merupakan amalan standard dengan terma yang pasti di mana penjual menjaminnya kepada pembeli, tetapi ini bukan daripada satu kebun tertentu atau daripada biri-biri tertentu.\"\n\nMalik ditanya tentang seorang lelaki yang membeli sebuah kebun daripada lelaki lain yang mempunyai pelbagai jenis pokok kurma - pokok kurma ajwa yang sangat baik, pokok kurma kabis yang baik, pokok kurma adhq dan jenis-jenis lain. Penjual menyimpan hasil daripada pokok pilihannya daripada jualan. Malik berkata, \"Itu tidak baik kerana jika dia berbuat demikian, dan menyimpan, contohnya, kurma jenis ajwa yang hasilnya ialah 15 sa, dan dia memetik kurma kabis sebagai gantinya, dan hasilnya ialah 10 sa atau dia memetik ajwa yang menghasilkan 15 sa dan meninggalkan kabis yang menghasilkan 10 sa, ia seolah-olah dia membeli ajwa untuk kabis dengan mengambil kira perbezaan kualiti mereka. Ini sama seperti seseorang yang berurusan dengan seseorang yang mempunyai timbunan kurma di hadapannya - timbunan 15 sa ajwa, timbunan 10 sa kabis, dan timbunan 12 sa cadhq, memberi pemilik kurma satu dinar untuk membiarkannya memilih dan mengambil mana-mana timbunan yang disukainya.\" Malik berkata, \"Itu tidak baik.\"\n\nMalik ditanya apa yang berhak diterima oleh seorang lelaki yang membeli kurma segar daripada pemilik kebun dan membayar satu dinar terlebih dahulu jika tanaman itu rosak. Malik berkata, \"Pembeli membuat perhitungan dengan pemilik kebun dan mengambil apa yang menjadi haknya daripada dinar itu. Jika pembeli telah mengambil kurma bernilai dua pertiga dinar, dia mendapat kembali satu pertiga dinar yang terhutang kepadanya. Jika pembeli telah mengambil kurma bernilai tiga suku dinar, maka dia mendapat kembali suku yang terhutang kepadanya, atau mereka mencapai persetujuan bersama, dan pembeli mengambil apa yang terhutang kepadanya daripada dinarnya daripada pemilik kebun dalam sesuatu yang lain pilihannya. Contohnya, jika dia lebih suka mengambil kurma kering atau beberapa barang lain, dia mengambilnya mengikut apa yang terhutang. Jika dia mengambil kurma kering atau beberapa barang lain, dia hendaklah berada bersamanya sehingga dia dibayar sepenuhnya.\"\n\nMalik berkata, \"Ini adalah situasi yang sama seperti menyewa unta tunggangan tertentu atau menyewa tukang jahit hamba, tukang kayu atau pekerja jenis lain atau menyewakan rumah dan mengambil bayaran terlebih dahulu untuk sewa hamba atau sewa rumah atau unta. Kemudian, kemalangan berlaku kepada apa yang telah disewa yang mengakibatkan kematian atau sesuatu yang lain. Pemilik unta, hamba atau rumah mengembalikan baki sewa unta, upah hamba atau sewa rumah kepada orang yang membayar wang terlebih dahulu, dan pemilik itu mengira apa yang akan menyelesaikannya sepenuhnya. Contohnya, jika dia telah menyediakan separuh daripada apa yang dibayar oleh lelaki itu, dia mengembalikan separuh lagi daripada apa yang dibayar terlebih dahulu, atau mengikut jumlah apa sahaja yang terhutang.\" Malik berkata, \"Membayar terlebih dahulu untuk sesuatu yang ada di tangan hanya baik apabila pembeli mengambil hak milik apa yang telah dibayarnya sebaik sahaja dia menyerahkan emas itu, sama ada ia hamba, unta, atau rumah, atau dalam kes kurma, dia mula memetiknya sebaik sahaja dia membayar wang itu.\"\n\nTidak baik jika terdapat sebarang penangguhan atau kredit dalam transaksi sedemikian.\n\nMalik berkata, \"Contoh yang menggambarkan apa yang tidak digalakkan dalam situasi ini ialah, contohnya, seseorang mungkin berkata bahawa dia akan membayar seseorang terlebih dahulu untuk penggunaan untanya untuk ditunggang dalam haji, dan haji masih ada sedikit masa lagi, atau dia mungkin berkata sesuatu yang serupa dengan itu tentang hamba atau rumah. Apabila dia berbuat demikian, dia hanya membayar wang terlebih dahulu dengan pemahaman bahawa jika dia mendapati unta itu sihat pada masa sewa itu perlu bermula, dia akan mengambilnya berdasarkan apa yang telah dibayarnya. Jika kemalangan, atau kematian, atau sesuatu berlaku kepada unta itu, maka dia akan mendapat kembali wangnya dan wang yang dibayar terlebih dahulu akan dianggap sebagai pinjaman.\"\n\nMalik berkata, \"Ini berbeza daripada seseorang yang mengambil hak milik serta-merta terhadap apa yang disewanya, supaya ia tidak jatuh ke dalam kategori 'ketidakpastian,' atau pembayaran terlebih dahulu yang tidak digalakkan. Itu mengikuti amalan biasa. Contohnya ialah seseorang membeli seorang hamba, atau hamba perempuan, dan mengambil hak milik mereka dan membayar harganya. Jika sesuatu berlaku kepada mereka dalam tempoh kontrak pampasan setahun, dia mengambil kembali emasnya daripada orang yang dibelinya. Tiada apa-apa yang salah dengan itu. Ini adalah preseden sunnah dalam hal menjual hamba.\"\n\nMalik berkata, \"Seseorang yang menyewa hamba tertentu, atau menyewa unta tertentu, untuk tarikh akan datang, di mana pada masa itu dia akan mengambil hak milik unta atau hamba itu, tidak bertindak dengan betul kerana dia tidak mengambil hak milik apa yang disewanya, dan dia juga tidak membayar pinjaman terlebih dahulu yang perlu dibayar balik oleh orang itu."
  },
  {
    "id": 35552,
    "hadith_number": 1374,
    "tajuk_hadith": "Peraturan Menjual dan Menukar Buah-buahan",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Malik berkata, \"Amalan yang disepakati di kalangan kami ialah seseorang yang membeli buah-buahan, sama ada segar atau kering, tidak boleh menjualnya semula sehingga dia memiliki sepenuhnya. Dia tidak boleh menukar barang yang sejenis, kecuali secara tunai. Apa sahaja yang boleh dikeringkan untuk disimpan dan dimakan, tidak boleh ditukar ganti dengan jenisnya yang sama, kecuali secara tunai, seperti dengan seperti, jika ia adalah jenis buah yang sama. Bagi dua jenis buah yang berbeza, tiada masalah untuk menukar dua daripada satu jenis dengan satu daripada jenis yang lain, secara tunai di tempat.  Tidak elok untuk menetapkan tempoh bayaran yang ditangguhkan.  Bagi hasil pertanian yang tidak dikeringkan dan disimpan tetapi dimakan segar seperti tembikai, timun, betik, lobak merah, limau purut, medlar, delima, dan sebagainya, yang apabila dikeringkan tidak lagi dianggap sebagai buah, dan bukan sesuatu yang disimpan seperti buah, saya fikir adalah sesuai untuk menukar barang-barang tersebut dua untuk satu daripada jenis yang sama secara tunai. Jika tiada tempoh bayaran ditetapkan, tiada mudaratnya.\""
  },
  {
    "id": 35553,
    "hadith_number": 1375,
    "tajuk_hadith": "Larangan Riba dalam Jual Beli",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said",
    "english_text": "Yahya related to me from Malik that Yahya ibn Said said, \"The\nMessenger of Allah, mayAllah bless him and grant him peace, ordered\nthe two Sads to sell a vessel made of either gold or silver from the\nbooty. They either sold each three units of weight for four units of\nweight of coins or each four units of weight for three units of weight\nor coins. The Messenger of Allah, may Allah bless him and grant him\npeace, said to them, 'You have taken usury, so return it.' \"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم السَّعْدَيْنِ أَنْ يَبِيعَا آنِيَةً مِنَ الْمَغَانِمِ مِنْ ذَهَبٍ أَوْ فِضَّةٍ فَبَاعَا كُلَّ ثَلاَثَةٍ بِأَرْبَعَةٍ عَيْنًا أَوْ كُلَّ أَرْبَعَةٍ بِثَلاَثَةٍ عَيْنًا فَقَالَ لَهُمَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَرْبَيْتُمَا فَرُدَّا",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Yahya bin Said bahawa baginda berkata: Rasulullah SAW telah memerintahkan dua orang lelaki yang bernama Saad supaya menjual sebuah bekas daripada ghanimah yang diperbuat daripada emas atau perak. Mereka menjual tiga unit berat dengan empat unit berat duit syiling atau empat unit berat dengan tiga unit berat duit syiling. Maka Rasulullah SAW bersabda kepada mereka: \"Kamu telah melakukan riba, maka kembalikanlah.\" "
  },
  {
    "id": 35554,
    "hadith_number": 1376,
    "tajuk_hadith": "Pertukaran Dinar dan Dirham",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Musa ibn Abi Tamim, dari Abu’l Hubab Said ibn Yasar dari Abu Hurairah",
    "english_text": "Yahya related to me from Malik from Musa ibn Abi Tamim from Abu'l\nHubab Said ibn Yasar from Abu Hurayra that the Messenger of Allah, may\nAllah bless him and grant him peace, said, \"A dinar for a dinar, a\ndirham for a dirham, no excess between the two.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُوسَى بْنِ أَبِي تَمِيمٍ، عَنْ أَبِي الْحُبَابِ، سَعِيدِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الدِّينَارُ بِالدِّينَارِ وَالدِّرْهَمُ بِالدِّرْهَمِ لاَ فَضْلَ بَيْنَهُمَا ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Musa bin Abi Tamim, daripada Abu al-Hubab Said bin Yasar daripada Abu Hurairah bahawa Rasulullah SAW bersabda:  \"Satu dinar untuk satu dinar, satu dirham untuk satu dirham, tiada kelebihan antara keduanya.\""
  },
  {
    "id": 35555,
    "hadith_number": 1377,
    "tajuk_hadith": "Larangan Menjual Emas dan Perak Secara Tidak Adil",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Nafi', daripada Abu Said al-Khudri",
    "english_text": "Yahya related to me from Malik from Nafi from Abu Said al-Khudri\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"Do not sell gold for gold except like for like and do not\nincrease one part over another part. Do not sell silver for silver,\nexcept like for like and do not increase one part over another part.\nDo not sell some of it which is not there for some of it which is.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَبِيعُوا الذَّهَبَ بِالذَّهَبِ إِلاَّ مِثْلاً بِمِثْلٍ وَلاَ تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلاَ تَبِيعُوا الْوَرِقَ بِالْوَرِقِ إِلاَّ مِثْلاً بِمِثْلٍ وَلاَ تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلاَ تَبِيعُوا مِنْهَا شَيْئًا غَائِبًا بِنَاجِزٍ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Nafi', daripada Abu Said al-Khudri bahawa Rasulullah SAW bersabda:  \"Janganlah kamu menjual emas dengan emas melainkan dengan timbangan yang sama, dan janganlah kamu menambahkan sebahagiannya ke atas sebahagian yang lain.  Janganlah kamu menjual perak dengan perak melainkan dengan timbangan yang sama, dan janganlah kamu menambahkan sebahagiannya ke atas sebahagian yang lain.  Dan janganlah kamu menjual sesuatu yang belum ada dengan sesuatu yang ada.\""
  },
  {
    "id": 35556,
    "hadith_number": 1378,
    "tajuk_hadith": "Larangan Menjual Emas Dengan Tambahan Harga Kerana Upah",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Humayd ibn Qays al-Makki daripada Mujahid",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ حُمَيْدِ بْنِ قَيْسٍ الْمَكِّيِّ، عَنْ مُجَاهِدٍ، أَنَّهُ قَالَ كُنْتُ مَعَ عَبْدِ اللَّهِ بْنِ عُمَرَ فَجَاءَهُ صَائِغٌ فَقَالَ لَهُ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنِّي أَصُوغُ الذَّهَبَ ثُمَّ أَبِيعُ الشَّىْءَ مِنْ ذَلِكَ بِأَكْثَرَ مِنْ وَزْنِهِ فَأَسْتَفْضِلُ مِنْ ذَلِكَ قَدْرَ عَمَلِ يَدِي ‏.‏ فَنَهَاهُ عَبْدُ اللَّهِ عَنْ ذَلِكَ فَجَعَلَ الصَّائِغُ يُرَدِّدُ عَلَيْهِ الْمَسْأَلَةَ وَعَبْدُ اللَّهِ يَنْهَاهُ حَتَّى انْتَهَى إِلَى بَابِ الْمَسْجِدِ أَوْ إِلَى دَابَّةٍ يُرِيدُ أَنْ يَرْكَبَهَا ثُمَّ قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ الدِّينَارُ بِالدِّينَارِ وَالدِّرْهَمُ بِالدِّرْهَمِ لاَ فَضْلَ بَيْنَهُمَا هَذَا عَهْدُ نَبِيِّنَا إِلَيْنَا وَعَهْدُنَا إِلَيْكُمْ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Humayd ibn Qays al-Makki daripada Mujahid, bahawa beliau berkata: Aku bersama Abdullah ibn Umar, lalu datang seorang tukang emas kepadanya dan berkata, ‘Wahai Abu Abd ar-Rahman, sesungguhnya aku menukang emas, kemudian aku menjualnya melebihi beratnya, lalu aku mengambil keuntungan daripada itu sebagai upah kerja tanganku.’ Abdullah melarangnya daripada melakukan perkara itu, lalu tukang emas itu mengulangi soalannya, dan Abdullah terus melarangnya sehingga mereka sampai ke pintu masjid atau ke kenderaan yang ingin ditungganginya. Kemudian Abdullah ibn Umar berkata, ‘Satu dinar dengan satu dinar, dan satu dirham dengan satu dirham. Tiada kelebihan di antara keduanya. Inilah perintah Nabi kita kepada kita dan pesanan kita kepada kamu.’"
  },
  {
    "id": 35557,
    "hadith_number": 1379,
    "tajuk_hadith": "Larangan Menjual Dinar dan Dirham dengan Harga Berganda",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik bahawa beliau mendengar daripada datuknya, Malik ibn Abi Amir bahawa Usman ibn Affan berkata,",
    "english_text": "Yahya related to me from Malik that he had heard from his\ngrandfather, Malik ibn Abi Amir that Uthman ibn Affan said, \"The\nMessenger of Allah, may Allah bless him and grant him peace, said to\nme, 'Do not sell a dinar for two dinars nor a dirham for two dirhams.'\n\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ جَدِّهِ، مَالِكِ بْنِ أَبِي عَامِرٍ أَنَّ عُثْمَانَ بْنَ عَفَّانَ، \nقَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَبِيعُوا الدِّينَارَ بِالدِّينَارَيْنِ وَلاَ الدِّرْهَمَ بِالدِّرْهَمَيْنِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa beliau mendengar daripada datuknya, Malik ibn Abi Amir bahawa Usman ibn Affan berkata, \"Rasulullah SAW telah bersabda kepadaku, 'Janganlah kamu menjual satu dinar dengan dua dinar dan janganlah kamu menjual satu dirham dengan dua dirham.'"
  },
  {
    "id": 35558,
    "hadith_number": 1380,
    "tajuk_hadith": "Larangan Menjual Barang Emas atau Perak Melebihi Berat Asalnya",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Zayd ibn Aslam, daripada Ata ibn Yasar",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ، بَاعَ سِقَايَةً مِنْ ذَهَبٍ أَوْ وَرِقٍ بِأَكْثَرَ مِنْ وَزْنِهَا فَقَالَ أَبُو الدَّرْدَاءِ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَنْهَى عَنْ مِثْلِ هَذَا إِلاَّ مِثْلاً بِمِثْلٍ ‏.‏ فَقَالَ لَهُ مُعَاوِيَةُ مَا أَرَى بِمِثْلِ هَذَا بَأْسًا ‏.‏ فَقَالَ أَبُو الدَّرْدَاءِ مَنْ يَعْذِرُنِي مِنْ مُعَاوِيَةَ أَنَا أُخْبِرُهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَيُخْبِرُنِي عَنْ رَأْيِهِ لاَ أُسَاكِنُكَ بِأَرْضٍ أَنْتَ بِهَا ‏.‏ ثُمَّ قَدِمَ أَبُو الدَّرْدَاءِ عَلَى عُمَرَ بْنِ الْخَطَّابِ فَذَكَرَ ذَلِكَ لَهُ فَكَتَبَ عُمَرُ بْنُ الْخَطَّابِ إِلَى مُعَاوِيَةَ أَنْ لاَ تَبِيعَ ذَلِكَ إِلاَّ مِثْلاً بِمِثْلٍ وَزْنًا بِوَزْنٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Zayd ibn Aslam, daripada Ata ibn Yasar bahawa Muawiyah ibn Abi Sufyan telah menjual sebuah bekas minuman daripada emas atau perak dengan harga yang melebihi beratnya.  Abu Darda berkata, \"Saya mendengar Rasulullah SAW melarang jual beli sebegini kecuali secara tulus, barang seumpama dengan barang seumpama.\" Muawiyah berkata kepadanya, \"Saya tidak nampak apa-apa kesalahan dalam hal ini.\" Abu Darda berkata kepadanya, \"Siapakah yang akan melindungiku daripada Muawiyah? Saya memberitahunya tentang sesuatu daripada Rasulullah SAW, dan dia pula memberitahu saya tentang pendapatnya sendiri! Saya tidak akan tinggal se-tanah dengan kamu!\" Kemudian Abu Darda pergi menghadap Umar ibn al-Khattab dan menceritakan hal itu kepadanya. Maka Umar ibn al-Khattab menulis surat kepada Muawiyah, \"Janganlah engkau menjualnya kecuali secara tulus, barang seumpama dengan barang seumpama, berat dengan berat.\""
  },
  {
    "id": 35559,
    "hadith_number": 1381,
    "tajuk_hadith": "Larangan Menjual Emas dan Perak dengan Cara yang Tidak Adil",
    "perawi_melayu": "Yahya meriwayatkan dari Malik dari Nafi' dari Abdullah bin Umar bahawa Umar bin al-Khattab berkata,",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ لاَ تَبِيعُوا الذَّهَبَ بِالذَّهَبِ إِلاَّ مِثْلاً بِمِثْلٍ وَلاَ تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلاَ تَبِيعُوا الْوَرِقَ بِالْوَرِقِ إِلاَّ مِثْلاً بِمِثْلٍ وَلاَ تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلاَ تَبِيعُوا الْوَرِقَ بِالذَّهَبِ أَحَدُهُمَا غَائِبٌ وَالآخَرُ نَاجِزٌ وَإِنِ اسْتَنْظَرَكَ إِلَى أَنْ يَلِجَ بَيْتَهُ فَلاَ تُنْظِرْهُ إِنِّي أَخَافُ عَلَيْكُمُ الرَّمَاءَ وَالرَّمَاءُ هُوَ الرِّبَا ‏.‏",
    "malay_translation": "Janganlah kamu menjual emas dengan emas melainkan sama berat dengan sama berat, dan janganlah kamu menambahkan sebahagiannya ke atas sebahagian yang lain.  Janganlah kamu menjual perak dengan perak melainkan sama berat dengan sama berat, dan janganlah kamu menambahkan sebahagiannya ke atas sebahagian yang lain.  Janganlah kamu menjual perak dengan emas, salah satunya secara tangguh dan yang lainnya secara tunai.  Dan jika seseorang meminta tempoh sehingga dia sampai ke rumahnya, maka janganlah kamu beri tempoh kepadanya. Sesungguhnya aku bimbang akan riba ke atas kamu.  Dan riba itu ialah usury."
  },
  {
    "id": 35560,
    "hadith_number": 1382,
    "tajuk_hadith": "Larangan Menjual Emas dan Perak Secara Tidak Adil",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Abdullah ibn Dinar daripada Abdullah ibn Umar bahawa Umar ibn al-Khattab berkata",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ لاَ تَبِيعُوا الذَّهَبَ بِالذَّهَبِ إِلاَّ مِثْلاً بِمِثْلٍ وَلاَ تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلاَ تَبِيعُوا الْوَرِقَ بِالْوَرِقِ إِلاَّ مِثْلاً بِمِثْلٍ وَلاَ تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلاَ تَبِيعُوا شَيْئًا مِنْهَا غَائِبًا بِنَاجِزٍ ‏.‏ وَإِنِ اسْتَنْظَرَكَ إِلَى أَنْ يَلِجَ بَيْتَهُ فَلاَ تُنْظِرْهُ إِنِّي أَخَافُ عَلَيْكُمُ الرَّمَاءَ وَالرَّمَاءُ هُوَ الرِّبَا ‏.‏",
    "malay_translation": "Janganlah kamu menjual emas dengan emas melainkan sama dengan sama, dan janganlah kamu menambahkan sebahagiannya pada sebahagian yang lain. Dan janganlah kamu menjual perak dengan perak melainkan sama dengan sama, dan janganlah kamu menambahkan sebahagiannya pada sebahagian yang lain. Dan janganlah kamu menjual sesuatu yang ada padamu dengan sesuatu yang tidak ada padamu.  Dan jika seseorang meminta tempoh sehingga dia sampai ke rumahnya, maka janganlah kamu beri tempoh kepadanya. Sesungguhnya aku bimbang akan riba ke atas kamu. Dan riba itu adalah haram."
  },
  {
    "id": 35561,
    "hadith_number": 1383,
    "tajuk_hadith": "Pertukaran yang Sama Nilai",
    "perawi_melayu": "Yahya melalui Malik daripada al-Qasim bin Muhammad",
    "english_text": "Yahya related to me from Malik that he had heard that al-Oasim\nibn Muhammad said, ''Umar ibn al-Khattab said, 'A dinar for a dinar,\nand a dirham for adirham, and a sa for a sa. Something to be collected\nlater is not to be sold for something at hand. ' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُ قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ الدِّينَارُ بِالدِّينَارِ وَالدِّرْهَمُ بِالدِّرْهَمِ وَالصَّاعُ بِالصَّاعِ وَلاَ يُبَاعُ كَالِئٌ بِنَاجِزٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik bahawa baginda telah mendengar bahawa al-Qasim bin Muhammad berkata, Umar bin al-Khattab berkata, 'Sebuah dinar untuk sebuah dinar, dan sebuah dirham untuk sebuah dirham, dan satu sa' untuk satu sa'.  Sesuatu yang akan dikutip kemudian tidak boleh dijual untuk sesuatu yang ada di tangan.'"
  },
  {
    "id": 35562,
    "hadith_number": 1384,
    "tajuk_hadith": "Riba Terhad kepada Emas, Perak, dan Barangan yang Diukur atau Ditimbang",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Abu az-Zinad, bahawa beliau mendengar Said bin al-Musayyab berkata,",
    "english_text": "Yahya related to me from Malik that Abu'z-Zinad heard Said ibn\nal-Musayyab say, \"There is usury only in gold or silver or what is\nweighed or measured of what is eaten or drunk.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ لاَ رِبًا إِلاَّ فِي ذَهَبٍ أَوْ فِضَّةٍ أَوْ مَا يُكَالُ أَوْ يُوزَنُ بِمَا يُؤْكَلُ أَوْ يُشْرَبُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abu az-Zinad, bahawa beliau mendengar Said bin al-Musayyab berkata, \"Tiada riba melainkan dalam emas atau perak atau apa yang diukur atau ditimbang daripada makanan atau minuman.\""
  },
  {
    "id": 35563,
    "hadith_number": 1385,
    "tajuk_hadith": "Peraturan Mengenai Jual Beli Emas dan Perak",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said, bahawa beliau mendengar Said bin al-Musayyab berkata,",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ قَطْعُ الذَّهَبِ وَالْوَرِقِ مِنَ الْفَسَادِ فِي الأَرْضِ ‏.‏ قَالَ مَالِكٌ وَلاَ بَأْسَ أَنْ يَشْتَرِيَ الرَّجُلُ الذَّهَبَ بِالْفِضَّةِ وَالْفِضَّةَ بِالذَّهَبِ جِزَافًا إِذَا كَانَ تِبْرًا أَوْ حَلْيًا قَدْ صِيغَ فَأَمَّا الدَّرَاهِمُ الْمَعْدُودَةُ وَالدَّنَانِيرُ الْمَعْدُودَةُ فَلاَ يَنْبَغِي لأَحَدٍ أَنْ يَشْتَرِيَ ذَلِكَ جِزَافًا حَتَّى يُعْلَمَ وَيُعَدَّ فَإِنِ اشْتُرِيَ ذَلِكَ جِزَافًا فَإِنَّمَا يُرَادُ بِهِ الْغَرَرُ حِينَ يُتْرَكُ عَدُّهُ وَيُشْتَرَى جِزَافًا وَلَيْسَ هَذَا مِنْ بُيُوعِ الْمُسْلِمِينَ فَأَمَّا مَا كَانَ يُوزَنُ مِنَ التِّبْرِ وَالْحَلْىِ فَلاَ بَأْسَ أَنْ يُبَاعَ ذَلِكَ جِزَافًا وَإِنَّمَا ابْتِيَاعُ ذَلِكَ جِزَافًا كَهَيْئَةِ الْحِنْطَةِ وَالتَّمْرِ وَنَحْوِهِمَا مِنَ الأَطْعِمَةِ الَّتِي تُبَاعُ جِزَافًا وَمِثْلُهَا يُكَالُ فَلَيْسَ بِابْتِيَاعِ ذَلِكَ جِزَافًا بَأْسٌ ‏.‏ قَالَ مَالِكٌ مَنِ اشْتَرَى مُصْحَفًا أَوْ سَيْفًا أَوْ خَاتَمًا وَفِي شَىْءٍ مِنْ ذَلِكَ ذَهَبٌ أَوْ فِضَّةٌ بِدَنَانِيرَ أَوْ دَرَاهِمَ فَإِنَّ مَا اشْتُرِيَ مِنْ ذَلِكَ وَفِيهِ الذَّهَبُ بِدَنَانِيرَ فَإِنَّهُ يُنْظَرُ إِلَى قِيمَتِهِ فَإِنْ كَانَتْ قِيمَةُ ذَلِكَ الثُّلُثَيْنِ وَقِيمَةُ مَا فِيهِ مِنَ الذَّهَبِ الثُّلُثَ فَذَلِكَ جَائِزٌ لاَ بَأْسَ بِهِ إِذَا كَانَ ذَلِكَ يَدًا بِيَدٍ وَلاَ يَكُونُ فِيهِ تَأْخِيرٌ وَمَا اشْتُرِيَ مِنْ ذَلِكَ بِالْوَرِقِ مِمَّا فِيهِ الْوَرِقُ نُظِرَ إِلَى قِيمَتِهِ فَإِنْ كَانَ قِيمَةُ ذَلِكَ الثُّلُثَيْنِ وَقِيمَةُ مَا فِيهِ مِنَ الْوَرِقِ الثُّلُثَ فَذَلِكَ جَائِزٌ لاَ بَأْسَ بِهِ إِذَا كَانَ ذَلِكَ يَدًا بِيَدٍ وَلَمْ يَزَلْ ذَلِكَ مِنْ أَمْرِ النَّاسِ عِنْدَنَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said, bahawa beliau mendengar Said bin al-Musayyab berkata, \"Menghentikan peredaran emas dan perak adalah sebahagian daripada kerosakan di muka bumi.\" Malik berkata, \"Tiada kesalahan sekiranya seseorang membeli emas dengan perak dan perak dengan emas secara sekaligus jika ia berupa emas tulen atau perhiasan yang telah dibentuk.  Tetapi, bagi dirham dan dinar yang telah dikira, tidak sepatutnya seseorang membelinya secara sekaligus sehingga ia diketahui dan dikira. Jika dibeli secara sekaligus, ia bertujuan untuk menipu apabila bilangannya diabaikan dan dibeli begitu sahaja. Ini bukanlah amalan urus niaga orang Islam.  Adapun barang yang ditimbang seperti emas tulen dan perhiasan, tiada kesalahan sekiranya ia dijual secara sekaligus. Membeli secara sekaligus adalah seperti membeli gandum, tamar kering dan seumpamanya daripada makanan yang dijual secara sekaligus, walaupun seumpamanya diukur. Tiada kesalahan dalam membeli secara sekaligus.  Malik berkata, sesiapa yang membeli mushaf, pedang atau cincin yang mempunyai sedikit emas atau perak dengan dinar atau dirham, maka apa yang dibeli yang mengandungi emas dengan dinar, maka hendaklah dilihat nilainya. Jika nilai keseluruhannya dua pertiga dan nilai emasnya sepertiga, maka ia diharuskan dan tiada kesalahan jika ia secara tunai dan tanpa penangguhan. Apa yang dibeli dengan perak yang mengandungi perak, nilainya hendaklah dilihat. Jika nilai keseluruhannya dua pertiga dan nilai perak itu sepertiga, maka ia diharuskan dan tiada kesalahan jika ia secara tunai.  Inilah masih cara urus niaga di kalangan kami.\""
  },
  {
    "id": 35564,
    "hadith_number": 1386,
    "tajuk_hadith": "Larangan Riba dalam Pertukaran Emas dan Perak",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Ibnu Syihab, dari Malik bin Aus bin al-Hadatsan an-Nasri",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ النَّصْرِيِّ، أَنَّهُ الْتَمَسَ صَرْفًا بِمِائَةِ دِينَارٍ قَالَ فَدَعَانِي طَلْحَةُ بْنُ عُبَيْدِ اللَّهِ فَتَرَاوَضْنَا حَتَّى اصْطَرَفَ مِنِّي وَأَخَذَ الذَّهَبَ يُقَلِّبُهَا فِي يَدِهِ ثُمَّ قَالَ حَتَّى يَأْتِيَنِي خَازِنِي مِنَ الْغَابَةِ ‏.‏ وَعُمَرُ بْنُ الْخَطَّابِ يَسْمَعُ ‏.‏ فَقَالَ عُمَرُ وَاللَّهِ لاَ تُفَارِقْهُ حَتَّى تَأْخُذَ مِنْهُ - ثُمَّ قَالَ - قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الذَّهَبُ بِالْوَرِقِ رِبًا إِلاَّ هَاءَ وَهَاءَ وَالْبُرُّ بِالْبُرِّ رِبًا إِلاَّ هَاءَ وَهَاءَ وَالتَّمْرُ بِالتَّمْرِ رِبًا إِلاَّ هَاءَ وَهَاءَ وَالشَّعِيرُ بِالشَّعِيرِ رِبًا إِلاَّ هَاءَ وَهَاءَ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibnu Syihab, daripada Malik bin Aus bin al-Hadatsan an-Nasri, bahawa dia pernah meminta menukar 100 dinar.  Dia berkata, \"Talhah bin Ubaidillah memanggilku, lalu kami berunding sehingga dia menukarkan wangku. Dia mengambil emas itu dan memusing-musingkannya di tangannya, kemudian berkata, 'Aku tidak dapat melakukannya sehingga bendaharaku membawa wang itu dari al-Ghaba.' Umar bin al-Khattab mendengarnya.  Lalu Umar berkata, \"Demi Allah! Janganlah kau tinggalkannya sehingga kau mengambilnya darinya!\" Kemudian dia berkata, \"Rasulullah SAW bersabda:  'Emas dengan perak adalah riba kecuali secara tunai. Gandum dengan gandum adalah riba kecuali secara tunai. Kurma dengan kurma adalah riba kecuali secara tunai. Barli dengan barli adalah riba kecuali secara tunai.'\"\n\nMalik berkata, \"Apabila seseorang membeli dirham dengan dinar, kemudian dia mendapati dirham yang rosak di antaranya dan ingin mengembalikannya, maka pertukaran dinar itu batal, dan dia mengembalikan perak serta mengambil semula dinarnya.  Penjelasan bagi apa yang dimakruhkan dalam hal itu ialah kerana sabda Rasulullah SAW: 'Emas dengan perak adalah riba kecuali secara tunai.' Dan Umar bin al-Khattab berkata, 'Jika seseorang memintamu untuk menunggu pembayaran sehingga dia pulang ke rumahnya, janganlah kau tinggalkannya.'  Apabila dia mengembalikan satu dirham kepadanya daripada pertukaran itu setelah meninggalkannya, ia seperti hutang atau sesuatu yang ditangguh.  Oleh sebab itu, ia dimakruhkan, dan pertukaran itu batal. Umar bin al-Khattab menghendaki agar semua emas, perak dan makanan tidak dijual dengan bayaran yang ditangguhkan. Dia tidak mahu ada sebarang penangguhan atau penundaan dalam jual beli sedemikian, sama ada melibatkan satu jenis barangan atau pelbagai jenis barangan.\""
  },
  {
    "id": 35565,
    "hadith_number": 1387,
    "tajuk_hadith": "Pertukaran Emas dan Perak Secara Timbang Tara",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Yazid ibn Abdullah ibn Qusayt",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ، أَنَّهُ رَأَى سَعِيدَ بْنَ الْمُسَيَّبِ يُرَاطِلُ الذَّهَبَ بِالذَّهَبِ فَيُفْرِغُ ذَهَبَهُ فِي كِفَّةِ الْمِيزَانِ وَيُفْرِغُ صَاحِبُهُ الَّذِي يُرَاطِلُهُ ذَهَبَهُ فِي كِفَّةِ الْمِيزَانِ الأُخْرَى فَإِذَا اعْتَدَلَ لِسَانُ الْمِيزَانِ أَخَذَ وَأَعْطَى ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِي بَيْعِ الذَّهَبِ بِالذَّهَبِ وَالْوَرِقِ بِالْوَرِقِ مُرَاطَلَةً أَنَّهُ لاَ بَأْسَ بِذَلِكَ أَنْ يَأْخُذَ أَحَدَ عَشَرَ دِينَارًا بِعَشَرَةِ دَنَانِيرَ يَدًا بِيَدٍ إِذَا كَانَ وَزْنُ الذَّهَبَيْنِ سَوَاءً عَيْنًا بِعَيْنٍ وَإِنْ تَفَاضَلَ الْعَدَدُ وَالدَّرَاهِمُ أَيْضًا فِي ذَلِكَ بِمَنْزِلَةِ الدَّنَانِيرِ ‏.‏ قَالَ مَالِكٌ مَنْ رَاطَلَ ذَهَبًا بِذَهَبٍ أَوْ وَرِقًا بِوَرِقٍ فَكَانَ بَيْنَ الذَّهَبَيْنِ فَضْلُ مِثْقَالٍ فَأَعْطَى صَاحِبَهُ قِيمَتَهُ مِنَ الْوَرِقِ أَوْ مِنْ غَيْرِهَا فَلاَ يَأْخُذُهُ فَإِنَّ ذَلِكَ قَبِيحٌ وَذَرِيعَةٌ إِلَى الرِّبَا لأَنَّهُ إِذَا جَازَ لَهُ أَنْ يَأْخُذَ الْمِثْقَالَ بِقِيمَتِهِ حَتَّى كَأَنَّهُ اشْتَرَاهُ عَلَى حِدَتِهِ جَازَ لَهُ أَنْ يَأْخُذَ الْمِثْقَالَ بِقِيمَتِهِ مِرَارًا لأَنْ يُجِيزَ ذَلِكَ الْبَيْعَ بَيْنَهُ وَبَيْنَ صَاحِبِهِ ‏.‏ قَالَ مَالِكٌ وَلَوْ أَنَّهُ بَاعَهُ ذَلِكَ الْمِثْقَالَ مُفْرَدًا لَيْسَ مَعَهُ غَيْرُهُ لَمْ يَأْخُذْهُ بِعُشْرِ الثَّمَنِ الَّذِي أَخَذَهُ بِهِ لأَنْ يُجَوِّزَ لَهُ الْبَيْعَ فَذَلِكَ الذَّرِيعَةُ إِلَى إِحْلاَلِ الْحَرَامِ وَالأَمْرُ الْمَنْهِيُّ عَنْهُ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يُرَاطِلُ الرَّجُلَ وَيُعْطِيهِ الذَّهَبَ الْعُتُقَ الْجِيَادَ وَيَجْعَلُ مَعَهَا تِبْرًا ذَهَبًا غَيْرَ جَيِّدَةٍ وَيَأْخُذُ مِنْ صَاحِبِهِ ذَهَبًا كُوفِيَّةً مُقَطَّعَةً وَتِلْكَ الْكُوفِيَّةُ مَكْرُوهَةٌ عِنْدَ النَّاسِ فَيَتَبَايَعَانِ ذَلِكَ مِثْلاً بِمِثْلٍ إِنَّ ذَلِكَ لاَ يَصْلُحُ ‏.‏ قَالَ مَالِكٌ وَتَفْسِيرُ مَا كُرِهَ مِنْ ذَلِكَ أَنَّ صَاحِبَ الذَّهَبِ الْجِيَادِ أَخَذَ فَضْلَ عُيُونِ ذَهَبِهِ فِي التِّبْرِ الَّذِي طَرَحَ مَعَ ذَهَبِهِ وَلَوْلاَ فَضْلُ ذَهَبِهِ عَلَى ذَهَبِ صَاحِبِهِ لَمْ يُرَاطِلْهُ صَاحِبُهُ بِتِبْرِهِ ذَلِكَ إِلَى ذَهَبِهِ الْكُوفِيَّةِ فَامْتَنَعَ وَإِنَّمَا مَثَلُ ذَلِكَ كَمَثَلِ رَجُلٍ أَرَادَ أَنْ يَبْتَاعَ ثَلاَثَةَ أَصْوُعٍ مِنْ تَمْرٍ عَجْوَةٍ بِصَاعَيْنِ وَمُدٍّ مِنْ تَمْرٍ كَبِيسٍ فَقِيلَ لَهُ هَذَا لاَ يَصْلُحُ ‏.‏ فَجَعَلَ صَاعَيْنِ مِنْ كَبِيسٍ وَصَاعًا مِنْ حَشَفٍ يُرِيدُ أَنْ يُجِيزَ بِذَلِكَ بَيْعَهُ فَذَلِكَ لاَ يَصْلُحُ لأَنَّهُ لَمْ يَكُنْ صَاحِبُ الْعَجْوَةِ لِيُعْطِيَهُ صَاعًا مِنَ الْعَجْوَةِ بِصَاعٍ مِنْ حَشَفٍ وَلَكِنَّهُ إِنَّمَا أَعْطَاهُ ذَلِكَ لِفَضْلِ الْكَبِيسِ أَوْ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ بِعْنِي ثَلاَثَةَ أَصْوُعٍ مِنَ الْبَيْضَاءِ بِصَاعَيْنِ وَنِصْفٍ مِنْ حِنْطَةٍ شَامِيَّةٍ فَيَقُولُ هَذَا لاَ يَصْلُحُ إِلاَّ مِثْلاً بِمِثْلٍ ‏.‏ فَيَجْعَلُ صَاعَيْنِ مِنْ حِنْطَةٍ شَامِيَّةٍ وَصَاعًا مِنْ شَعِيرٍ يُرِيدُ أَنْ يُجِيزَ بِذَلِكَ الْبَيْعَ فِيمَا بَيْنَهُمَا فَهَذَا لاَ يَصْلُحُ لأَنَّهُ لَمْ يَكُنْ لِيُعْطِيَهُ بِصَاعٍ مِنْ شَعِيرٍ صَاعًا مِنْ حِنْطَةٍ بَيْضَاءَ لَوْ كَانَ ذَلِكَ الصَّاعُ مُفْرَدًا وَإِنَّمَا أَعْطَاهُ إِيَّاهُ لِفَضْلِ الشَّامِيَّةِ عَلَى الْبَيْضَاءِ فَهَذَا لاَ يَصْلُحُ وَهُوَ مِثْلُ مَا وَصَفْنَا مِنَ التِّبْرِ ‏.‏ قَالَ مَالِكٌ فَكُلُّ شَىْءٍ مِنَ الذَّهَبِ وَالْوَرِقِ وَالطَّعَامِ كُلِّهِ الَّذِي لاَ يَنْبَغِي أَنْ يُبَاعَ إِلاَّ مِثْلاً بِمِثْلٍ فَلاَ يَنْبَغِي أَنْ يُجْعَلَ مَعَ الصِّنْفِ الْجَيِّدِ مِنَ الْمَرْغُوبِ فِيهِ الشَّىْءُ الرَّدِيءُ الْمَسْخُوطُ لِيُجَازَ الْبَيْعُ وَلِيُسْتَحَلَّ بِذَلِكَ مَا نُهِيَ عَنْهُ مِنَ الأَمْرِ الَّذِي لاَ يَصْلُحُ إِذَا جُعِلَ ذَلِكَ مَعَ الصِّنْفِ الْمَرْغُوبِ فِيهِ وَإِنَّمَا يُرِيدُ صَاحِبُ ذَلِكَ أَنْ يُدْرِكَ بِذَلِكَ فَضْلَ جَوْدَةِ مَا يَبِيعُ فَيُعْطِيَ الشَّىْءَ الَّذِي لَوْ أَعْطَاهُ وَحْدَهُ لَمْ يَقْبَلْهُ صَاحِبُهُ وَلَمْ يَهْمُمْ بِذَلِكَ وَإِنَّمَا يَقْبَلُهُ مِنْ أَجْلِ الَّذِي يَأْخُذُ مَعَهُ لِفَضْلِ سِلْعَةِ صَاحِبِهِ عَلَى سِلْعَتِهِ فَلاَ يَنْبَغِي لِشَىْءٍ مِنَ الذَّهَبِ وَالْوَرِقِ وَالطَّعَامِ أَنْ يَدْخُلَهُ شَىْءٌ مِنْ هَذِهِ الصِّفَةِ فَإِنْ أَرَادَ صَاحِبُ الطَّعَامِ الرَّدِيءِ أَنْ يَبِيعَهُ بِغَيْرِهِ فَلْيَبِعْهُ عَلَى حِدَتِهِ وَلاَ يَجْعَلْ مَعَ ذَلِكَ شَيْئًا فَلاَ بَأْسَ بِهِ إِذَا كَانَ كَذَلِكَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Yazid bin Abdullah bin Qusayt bahawa baginda melihat Said bin al-Musayyab menukar emas dengan emas secara timbang tara.  Dia akan menuang emasnya ke dalam satu dulang timbangan, dan pihak yang berurus niaga dengannya akan menuang emasnya ke dalam dulang timbangan yang lain. Apabila penunjuk timbangan seimbang, barulah mereka mengambil dan memberi.\n\nMalik berkata, \"Menurut kebiasaan kami, tiada masalah dalam menjual emas dengan emas dan perak dengan perak secara timbang tara, walaupun seseorang mengambil sebelas dinar dengan sepuluh dinar secara tunai, jika berat kedua-dua emas itu sama, sama banyak, walaupun jumlahnya berbeza.  Begitu juga dengan dirham, ianya sama seperti dinar.\"\n\nMalik berkata, \"Jika dalam menukar emas dengan emas atau perak dengan perak, terdapat perbezaan berat, maka salah satu pihak tidak boleh memberikan kepada pihak lain nilai perbezaan itu dalam bentuk perak atau apa-apa yang lain.  Transaksi sebegini adalah buruk dan menjadi jalan kepada riba kerana jika salah satu pihak dibenarkan mengambil perbezaan itu dengan harga berasingan, ia seolah-olah dia telah membelinya secara berasingan, maka ia dibenarkan.  Kemudian, dia boleh meminta berlipat kali ganda nilai perbezaan itu untuk membenarkan penyelesaian transaksi di antara kedua-dua pihak.\"\n\nMalik berkata, \"Sekiranya dia benar-benar menjual perbezaan itu secara berasingan tanpa apa-apa yang lain, dia tidak akan mengambilnya dengan seperseratus daripada harga yang diambilnya untuk mewajarkan transaksi tersebut. Ini membawa kepada pengizinan perkara yang haram. Perkara ini adalah haram.\"\n\nMalik berkata bahawa ia tidak baik jika dalam menukar emas, seseorang memberikan syiling emas lama yang berkualiti baik dan mencampurkannya dengan emas mentah sebagai balasan untuk emas Kufi yang telah haus dan tidak popular, kemudian menganggap pertukaran itu sebagai sama nilainya.\n\nMalik berkata, \"Penjelasan mengapa perkara itu dibenci ialah pemilik emas berkualiti baik menggunakan kelebihan syiling emas lamanya sebagai alasan untuk mencampurkan emas mentah itu. Sekiranya bukan kerana kualiti emasnya yang lebih baik daripada emas pihak lain, pihak lain tidak akan menukar emas mentahnya dengan emas Kufi miliknya, dan urus niaga itu akan ditolak.\"\n\n\"Ia seperti seseorang yang ingin membeli tiga sa' tamar Ajwa dengan dua sa' dan satu mudd tamar Kabis, dan apabila diberitahu bahawa ia tidak baik, kemudian menawarkan dua sa' tamar Kabis dan satu sa' tamar yang buruk untuk membolehkan jualan.  Itu tidak baik kerana pemilik tamar Ajwa tidak seharusnya memberikan satu sa' tamar Ajwa dengan satu sa' tamar yang buruk.  Dia hanya akan memberikannya kerana kelebihan tamar Kabis.\"\n\n\"Atau seperti seseorang meminta seseorang untuk menjual kepadanya tiga sa' gandum putih dengan dua setengah sa' gandum Syria, dan apabila diberitahu bahawa ia tidak baik kecuali yang sama jenisnya, kemudian menawarkan dua sa' gandum dan satu sa' barli untuk membolehkan jualan di antara mereka.  Itu tidak baik kerana tiada siapa akan memberikan satu sa' barli untuk satu sa' gandum putih sekiranya ia dijual secara berasingan. Ia hanya diberikan kerana kelebihan gandum Syria berbanding gandum putih.  Ini tidak baik. Ia sama seperti kes emas mentah.\"\n\nMalik berkata, \"Bagi emas, perak dan makanan, iaitu benda-benda yang hanya boleh dijual dengan benda yang sama jenisnya, maka tidak sepatutnya sesuatu yang tidak disenangi dan berkualiti rendah dicampurkan dengan sesuatu yang baik dan diingini untuk membolehkan jualan dan menghalalkan sesuatu yang haram. Apabila sesuatu yang berkualiti baik dicampurkan dengan sesuatu yang berkualiti rendah dan ia hanya dimasukkan supaya kebaikannya dapat dilihat, maka sesuatu dijual yang jika dijual sendiri, tidak akan diterima dan pembeli tidak akan mempedulikannya.  Ia hanya diterima oleh pembeli kerana kelebihan barang yang disertakan itu berbanding barang miliknya sendiri. Transaksi yang melibatkan emas, perak atau makanan, tidak sepatutnya melibatkan apa-apa sifat ini. Jika pemilik barang yang berkualiti rendah ingin menjualnya, juallah ia secara berasingan, dan jangan mencampurkan apa-apa dengannya. Tiada masalah jika ia seperti itu.\""
  },
  {
    "id": 35566,
    "hadith_number": 1388,
    "tajuk_hadith": "Larangan Menjual Makanan Sebelum Menerimanya Keseluruhan",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Nafi', dari Abdullah bin Umar",
    "english_text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"Someone who buys food, must not resell it until he takes\ndelivery of it all.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنِ ابْتَاعَ طَعَامًا فَلاَ يَبِعْهُ حَتَّى يَسْتَوْفِيَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Nafi', dari Abdullah bin Umar bahawa Rasulullah SAW bersabda:  \"Barangsiapa yang membeli makanan, maka janganlah dia menjualnya sehingga dia menerimanya sepenuhnya.\""
  },
  {
    "id": 35567,
    "hadith_number": 1389,
    "tajuk_hadith": "Larangan Menjual Makanan Sebelum Menerimanya",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Abdullah ibn Dinar, daripada Abdullah ibn Umar",
    "english_text": "Yahya related to me from Malik from Abdullah ibn Dinar from\nAbdullah ibn Umar that the Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"Someone who buys food, must not sell it until\nhe takes possession of it.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنِ ابْتَاعَ طَعَامًا فَلاَ يَبِعْهُ حَتَّى يَقْبِضَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abdullah ibn Dinar, daripada Abdullah ibn Umar bahawa Rasulullah SAW bersabda:  \"Sesiapa yang membeli makanan, janganlah dia menjualnya sehingga dia menerimanya.\""
  },
  {
    "id": 35568,
    "hadith_number": 1390,
    "tajuk_hadith": "Memindahkan Barang Dagangan pada Zaman Rasulullah SAW",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Nafi' daripada Abdullah bin Umar",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid, \"In the time of the Messenger of Allah, may Allah bless him and\ngrant him peace, we used to buy food. He sent orders for us to move\nour purchases from the place in which we purchased them to another\nplace before we re-sold them.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ كُنَّا فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم نَبْتَاعُ الطَّعَامَ فَيَبْعَثُ عَلَيْنَا مَنْ يَأْمُرُنَا بِانْتِقَالِهِ مِنَ الْمَكَانِ الَّذِي ابْتَعْنَاهُ فِيهِ إِلَى مَكَانٍ سِوَاهُ قَبْلَ أَنْ نَبِيعَهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Nafi' daripada Abdullah bin Umar bahawa beliau berkata:  \"Pada zaman Rasulullah SAW, kami biasa membeli makanan.  Rasulullah SAW akan mengutus orang untuk mengarahkan kami memindahkan barang-barang yang dibeli itu dari tempat pembelian ke tempat lain sebelum kami menjualnya.\" "
  },
  {
    "id": 35569,
    "hadith_number": 1391,
    "tajuk_hadith": "Larangan Menjual Makanan Sebelum Menerimanya",
    "perawi_melayu": "Yahya daripada Malik daripada Nafi'",
    "english_text": "Yahya related to me from Malik from Nafi that Hakim ibn Hizam\ntraded in food for people as Umar ibn al-Khattab had ordered him to\ndo. Hakim re-sold the food before he had taken delivery of it. That\nreached Umar ibn al-Khattab and he revoked the sale and said, \"Do not\nsell food which you have purchased until you take delivery of it.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، ‏.‏ أَنَّ حَكِيمَ بْنَ حِزَامٍ، ابْتَاعَ طَعَامًا أَمَرَ بِهِ عُمَرُ بْنُ الْخَطَّابِ لِلنَّاسِ فَبَاعَ حَكِيمٌ الطَّعَامَ قَبْلَ أَنْ يَسْتَوْفِيَهُ فَبَلَغَ ذَلِكَ عُمَرَ بْنَ الْخَطَّابِ فَرَدَّهُ عَلَيْهِ وَقَالَ لاَ تَبِعْ طَعَامًا ابْتَعْتَهُ حَتَّى تَسْتَوْفِيَهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Nafi’ bahawa Hakim bin Hizam telah membeli makanan atas perintah Umar bin al-Khattab untuk orang ramai.  Hakim kemudian menjual makanan tersebut sebelum menerimanya. Perkara itu sampai kepada Umar bin al-Khattab, lalu beliau membatalkan jualan tersebut dan berkata, “Janganlah kamu menjual makanan yang kamu beli sehingga kamu menerimanya.”"
  },
  {
    "id": 35570,
    "hadith_number": 1392,
    "tajuk_hadith": "Larangan Jual Beli Suku Sebelum Penerimaan Barang",
    "perawi_melayu": "Yahya melalui Malik",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ ‏.‏ أَنَّ صُكُوكًا، خَرَجَتْ لِلنَّاسِ فِي زَمَانِ مَرْوَانَ بْنِ الْحَكَمِ مِنْ طَعَامِ الْجَارِ فَتَبَايَعَ النَّاسُ تِلْكَ الصُّكُوكَ بَيْنَهُمْ قَبْلَ أَنْ يَسْتَوْفُوهَا فَدَخَلَ زَيْدُ بْنُ ثَابِتٍ وَرَجُلٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى مَرْوَانَ بْنِ الْحَكَمِ فَقَالاَ أَتُحِلُّ بَيْعَ الرِّبَا يَا مَرْوَانُ ‏.‏ فَقَالَ أَعُوذُ بِاللَّهِ وَمَا ذَاكَ فَقَالاَ هَذِهِ الصُّكُوكُ تَبَايَعَهَا النَّاسُ ثُمَّ بَاعُوهَا قَبْلَ أَنْ يَسْتَوْفُوهَا فَبَعَثَ مَرْوَانُ الْحَرَسَ يَتْبَعُونَهَا يَنْزِعُونَهَا مِنْ أَيْدِي النَّاسِ وَيَرُدُّونَهَا إِلَى أَهْلِهَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik bahawa baginda telah diberitahu bahawa pada zaman pemerintahan Marwan ibn al-Hakam, wujudnya suatu sistem penerimaan (suku) bagi hasil pasaran di al-Jar.  Orang ramai kemudiannya saling menjual beli suku-suku tersebut sebelum mereka menerima barang dagangan yang sepatutnya. Zayd ibn Thabit dan seorang sahabat Rasulullah SAW telah menghadap Marwan ibn al-Hakam lalu berkata, \"Wahai Marwan! Adakah engkau menghalalkan riba?\"  Marwan menjawab, \"Aku berlindung kepada Allah! Apakah itu?\" Mereka menjelaskan, \"Suku-suku ini yang dijual beli oleh orang ramai sebelum mereka menerima barang dagangannya.\"  Atas sebab itu, Marwan menghantar pengawal untuk mengambil semula suku-suku tersebut daripada orang ramai dan mengembalikannya kepada pemilik yang asal."
  },
  {
    "id": 35571,
    "hadith_number": 1393,
    "tajuk_hadith": "Larangan Membeli dan Menjual Barang yang Tidak Dimiliki",
    "perawi_melayu": "Yahya melalui Malik",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَجُلاً، أَرَادَ أَنْ يَبْتَاعَ طَعَامًا مِنْ رَجُلٍ إِلَى أَجَلٍ فَذَهَبَ بِهِ الرَّجُلُ الَّذِي يُرِيدُ أَنْ يَبِيعَهُ الطَّعَامَ إِلَى السُّوقِ فَجَعَلَ يُرِيهِ الصُّبَرَ وَيَقُولُ لَهُ مِنْ أَيِّهَا تُحِبُّ أَنْ أَبْتَاعَ لَكَ فَقَالَ الْمُبْتَاعُ أَتَبِيعُنِي مَا لَيْسَ عِنْدَكَ فَأَتَيَا عَبْدَ اللَّهِ بْنَ عُمَرَ فَذَكَرَا ذَلِكَ لَهُ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ لِلْمُبْتَاعِ لاَ تَبْتَعْ مِنْهُ مَا لَيْسَ عِنْدَهُ ‏.‏ وَقَالَ لِلْبَائِعِ لاَ تَبِعْ مَا لَيْسَ عِنْدَكَ ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Yahya daripada Malik bahawa telah sampai kepadanya bahawa seorang lelaki ingin membeli makanan daripada seorang lelaki secara kredit.  Maka lelaki yang ingin menjual makanan itu membawanya ke pasar dan menunjukkan kepadanya timbunan makanan itu sambil berkata, \"Yang mana satu kamu suka aku belikan untukmu?\" Pembeli berkata kepadanya, \"Adakah engkau menjual kepadaku apa yang tidak ada padamu?\"  Kemudian mereka berdua datang kepada Abdullah bin Umar dan menceritakan hal itu kepadanya. Abdullah bin Umar berkata kepada pembeli, \"Janganlah kamu membeli darinya apa yang tidak ada padanya.\" Dan beliau berkata kepada penjual, \"Janganlah kamu menjual apa yang tidak ada padamu.\""
  },
  {
    "id": 35572,
    "hadith_number": 1394,
    "tajuk_hadith": "Larangan Menjual Makanan Sebelum Menerimanya",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Yahya bin Said, bahawa Yahya mendengar Jamil bin Abd ar-Rahman al-Muazzin berkata kepada Said bin al-Musayyab",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ جَمِيلَ بْنَ عَبْدِ الرَّحْمَنِ الْمُؤَذِّنَ، يَقُولُ لِسَعِيدِ بْنِ الْمُسَيَّبِ إِنِّي رَجُلٌ أَبْتَاعُ مِنَ الأَرْزَاقِ الَّتِي تُعْطَى النَّاسُ بِالْجَارِ مَا شَاءَ اللَّهُ ثُمَّ أُرِيدُ أَنْ أَبِيعَ الطَّعَامَ الْمَضْمُونَ عَلَىَّ إِلَى أَجَلٍ ‏.‏ فَقَالَ لَهُ سَعِيدٌ أَتُرِيدُ أَنْ تُوَفِّيَهُمْ مِنْ تِلْكَ الأَرْزَاقِ الَّتِي ابْتَعْتَ فَقَالَ نَعَمْ ‏.‏ فَنَهَاهُ عَنْ ذَلِكَ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا الَّذِي لاَ اخْتِلاَفَ فِيهِ أَنَّهُ مَنِ اشْتَرَى طَعَامًا بُرًّا أَوْ شَعِيرًا أَوْ سُلْتًا أَوْ ذُرَةً أَوْ دُخْنًا أَوْ شَيْئًا مِنَ الْحُبُوبِ الْقِطْنِيَّةِ أَوْ شَيْئًا مِمَّا يُشْبِهُ الْقِطْنِيَّةَ مِمَّا تَجِبُ فِيهِ الزَّكَاةُ أَوْ شَيْئًا مِنَ الأُدْمِ كُلِّهَا الزَّيْتِ وَالسَّمْنِ وَالْعَسَلِ وَالْخَلِّ وَالْجُبْنِ وَالشَّبْرَقِ وَاللَّبَنِ وَمَا أَشْبَهَ ذَلِكَ مِنَ الأُدْمِ فَإِنَّ الْمُبْتَاعَ لاَ يَبِيعُ شَيْئًا مِنْ ذَلِكَ حَتَّى يَقْبِضَهُ وَيَسْتَوْفِيَهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said, bahawa beliau mendengar Jamil bin Abd ar-Rahman al-Muazzin berkata kepada Said bin al-Musayyab, \"Saya seorang lelaki yang membeli daripada rezeki yang diberikan kepada orang ramai di al-Jar apa sahaja yang dikehendaki Allah, kemudian saya ingin menjual makanan yang telah saya jamin penghantarannya pada tarikh yang akan datang.\"  Maka Said berkata kepadanya, \"Adakah engkau bermaksud untuk memenuhi mereka daripada rezeki yang telah engkau beli itu?\"  Dia menjawab, \"Ya.\" Maka Said melarangnya daripada berbuat demikian.\n\nMalik berkata, \"Perkara yang disepakati di kalangan kami tanpa sebarang perselisihan pendapat ialah: Sesiapa yang membeli makanan seperti gandum, barli, sorgum, jagung, jawawut, atau apa sahaja jenis bijirin atau yang serupa dengannya yang wajib dikenakan zakat, atau apa sahaja jenis perasa seperti minyak, mentega, madu, cuka, keju, minyak bijan, susu dan sebagainya, maka pembeli tidak boleh menjualnya sehinggalah dia menerimanya dan mengambilnya sepenuhnya.\""
  },
  {
    "id": 35573,
    "hadith_number": 1395,
    "tajuk_hadith": "Larangan Menjual Gandum Dengan Emas Secara Tangguh",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Abu Az-Zinad bahawa beliau mendengar Said bin al-Musayyab dan Sulaiman bin Yasar melarang seseorang menjual gandum dengan emas secara tangguh, kemudian membeli tamar dengan emas tersebut sebelum menerima emas itu.",
    "english_text": "Yahya related to me from Malik that Abu'z-Zinad heard Sa'id ibn\nal-Musayyab andSulayman ibn Yasar forbid a man to sell wheat for gold\non delayed terms and then to buy dried dates with the gold before he\nhad taken delivery of the gold.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، وَسُلَيْمَانَ بْنَ يَسَارٍ، يَنْهَيَانِ أَنْ يَبِيعَ الرَّجُلُ، حِنْطَةً بِذَهَبٍ إِلَى أَجَلٍ ثُمَّ يَشْتَرِيَ بِالذَّهَبِ تَمْرًا قَبْلَ أَنْ يَقْبِضَ الذَّهَبَ",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Abu Az-Zinad, bahawa beliau mendengar Said bin al-Musayyab dan Sulaiman bin Yasar melarang seseorang lelaki menjual gandum dengan emas secara ansuran, kemudian membeli tamar dengan emas tersebut sebelum menerima emas itu."
  },
  {
    "id": 35574,
    "hadith_number": 1396,
    "tajuk_hadith": "Larangan Jual Beli Makanan Secara Tangguh Dengan Emas Sebelum Penerimaan Bayaran",
    "perawi_melayu": "Yahya",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ كَثِيرِ بْنِ فَرْقَدٍ، ‏.‏ أَنَّهُ سَأَلَ أَبَا بَكْرِ بْنَ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنِ الرَّجُلِ، يَبِيعُ الطَّعَامَ مِنَ الرَّجُلِ بِذَهَبٍ إِلَى أَجَلٍ ثُمَّ يَشْتَرِي بِالذَّهَبِ تَمْرًا قَبْلَ أَنْ يَقْبِضَ الذَّهَبَ فَكَرِهَ ذَلِكَ وَنَهَى عَنْهُ ‏.‏ \n وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، بِمِثْلِ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا نَهَى سَعِيدُ بْنُ الْمُسَيَّبِ وَسُلَيْمَانُ بْنُ يَسَارٍ وَأَبُو بَكْرِ بْنُ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ وَابْنُ شِهَابٍ عَنْ أَنْ لاَ يَبِيعَ الرَّجُلُ حِنْطَةً بِذَهَبٍ ثُمَّ يَشْتَرِيَ الرَّجُلُ بِالذَّهَبِ تَمْرًا قَبْلَ أَنْ يَقْبِضَ الذَّهَبَ مِنْ بَيْعِهِ الَّذِي اشْتَرَى مِنْهُ الْحِنْطَةَ فَأَمَّا أَنْ يَشْتَرِيَ بِالذَّهَبِ الَّتِي بَاعَ بِهَا الْحِنْطَةَ إِلَى أَجَلٍ تَمْرًا مِنْ غَيْرِ بَائِعِهِ الَّذِي بَاعَ مِنْهُ الْحِنْطَةَ قَبْلَ أَنْ يَقْبِضَ الذَّهَبَ وَيُحِيلَ الَّذِي اشْتَرَى مِنْهُ التَّمْرَ عَلَى غَرِيمِهِ الَّذِي بَاعَ مِنْهُ الْحِنْطَةَ بِالذَّهَبِ الَّتِي لَهُ عَلَيْهِ فِي ثَمَنِ التَّمْرِ فَلاَ بَأْسَ بِذَلِكَ ‏.‏ قَالَ مَالِكٌ وَقَدْ سَأَلْتُ عَنْ ذَلِكَ غَيْرَ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ فَلَمْ يَرَوْا بِهِ بَأْسًا ‏.",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa Kathir bin Farqad bertanya kepada Abu Bakar bin Muhammad bin Amr bin Hazm tentang seorang lelaki yang menjual makanan kepada seseorang dengan bayaran emas secara tangguh, kemudian membeli tamar dengan emas itu sebelum menerima bayaran emas tersebut.  Baginda tidak menyukai dan melarangnya.\n\nYahya meriwayatkan daripada Malik daripada Ibn Shihab perkara yang serupa.\n\nMalik berkata, \"Said bin al-Musayyab, Sulaiman bin Yasar, Abu Bakar bin Muhammad bin Amr bin Hazm, dan Ibn Shihab melarang seseorang menjual gandum dengan emas secara tangguh, kemudian membeli tamar dengan emas itu sebelum menerima bayaran gandum tersebut.  Tetapi, tidak mengapa jika seseorang membeli tamar secara tangguh dengan emas hasil jualan gandumnya daripada orang lain selain daripada pembeli gandum tersebut, sebelum menerima bayaran emas, dan menghubungkan penjual tamar kepada pemiutang yang membeli gandumnya untuk mendapatkan bayaran tamar tersebut.\"\n\nMalik berkata, \"Saya telah bertanya tentang perkara ini kepada beberapa orang alim, dan mereka tidak melihat sebarang kemudaratan dalam hal ini.\""
  },
  {
    "id": 35575,
    "hadith_number": 1397,
    "tajuk_hadith": "Pemberian Pinjaman Makanan dan Pembatalan Jual Beli",
    "perawi_melayu": "Yahya meriwayatkan dari Malik dari Nafi' dari Abdullah bin Umar",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ لاَ بَأْسَ بِأَنْ يُسَلِّفَ الرَّجُلُ الرَّجُلَ فِي الطَّعَامِ الْمَوْصُوفِ بِسِعْرٍ مَعْلُومٍ إِلَى أَجَلٍ مُسَمًّى مَا لَمْ يَكُنْ فِي زَرْعٍ لَمْ يَبْدُ صَلاَحُهُ أَوْ تَمْرٍ لَمْ يَبْدُ صَلاَحُهُ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِيمَنْ سَلَّفَ فِي طَعَامٍ بِسِعْرٍ مَعْلُومٍ إِلَى أَجَلٍ مُسَمًّى فَحَلَّ الأَجَلُ فَلَمْ يَجِدِ الْمُبْتَاعُ عِنْدَ الْبَائِعِ وَفَاءً مِمَّا ابْتَاعَ مِنْهُ فَأَقَالَهُ فَإِنَّهُ لاَ يَنْبَغِي لَهُ أَنْ يَأْخُذَ مِنْهُ إِلاَّ وَرِقَهُ أَوْ ذَهَبَهُ أَوِ الثَّمَنَ الَّذِي دَفَعَ إِلَيْهِ بِعَيْنِهِ وَإِنَّهُ لاَ يَشْتَرِي مِنْهُ بِذَلِكَ الثَّمَنِ شَيْئًا حَتَّى يَقْبِضَهُ مِنْهُ وَذَلِكَ أَنَّهُ إِذَا أَخَذَ غَيْرَ الثَّمَنِ الَّذِي دَفَعَ إِلَيْهِ أَوْ صَرَفَهُ فِي سِلْعَةٍ غَيْرِ الطَّعَامِ الَّذِي ابْتَاعَ مِنْهُ فَهُوَ بَيْعُ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى ‏.‏ قَالَ مَالِكٌ وَقَدْ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى ‏.‏ قَالَ مَالِكٌ فَإِنْ نَدِمَ الْمُشْتَرِي فَقَالَ لِلْبَائِعِ أَقِلْنِي وَأُنْظِرُكَ بِالثَّمَنِ الَّذِي دَفَعْتُ إِلَيْكَ ‏.‏ فَإِنَّ ذَلِكَ لاَ يَصْلُحُ وَأَهْلُ الْعِلْمِ يَنْهَوْنَ عَنْهُ وَذَلِكَ أَنَّهُ لَمَّا حَلَّ الطَّعَامُ لِلْمُشْتَرِي عَلَى الْبَائِعِ أَخَّرَ عَنْهُ حَقَّهُ عَلَى أَنْ يُقِيلَهُ فَكَانَ ذَلِكَ بَيْعَ الطَّعَامِ إِلَى أَجَلٍ قَبْلَ أَنْ يُسْتَوْفَى ‏.‏ قَالَ مَالِكٌ وَتَفْسِيرُ ذَلِكَ أَنَّ الْمُشْتَرِيَ حِينَ حَلَّ الأَجَلُ وَكَرِهَ الطَّعَامَ أَخَذَ بِهِ دِينَارًا إِلَى أَجَلٍ وَلَيْسَ ذَلِكَ بِالإِقَالَةِ وَإِنَّمَا الإِقَالَةُ مَا لَمْ يَزْدَدْ فِيهِ الْبَائِعُ وَلاَ الْمُشْتَرِي فَإِذَا وَقَعَتْ فِيهِ الزِّيَادَةُ بِنَسِيئَةٍ إِلَى أَجَلٍ أَوْ بِشَىْءٍ يَزْدَادُهُ أَحَدُهُمَا عَلَى صَاحِبِهِ أَوْ بِشَىْءٍ يَنْتَفِعُ بِهِ أَحَدُهُمَا فَإِنَّ ذَلِكَ لَيْسَ بِالإِقَالَةِ وَإِنَّمَا تَصِيرُ الإِقَالَةُ إِذَا فَعَلاَ ذَلِكَ بَيْعًا وَإِنَّمَا أُرْخِصَ فِي الإِقَالَةِ وَالشِّرْكِ وَالتَّوْلِيَةِ مَا لَمْ يَدْخُلْ شَيْئًا مِنْ ذَلِكَ زِيَادَةٌ أَوْ نُقْصَانٌ أَوْ نَظِرَةٌ فَإِنْ دَخَلَ ذَلِكَ زِيَادَةٌ أَوْ نُقْصَانٌ أَوْ نَظِرَةٌ صَارَ بَيْعًا يُحِلُّهُ مَا يُحِلُّ الْبَيْعَ وَيُحَرِّمُهُ مَا يُحَرِّمُ الْبَيْعَ ‏.‏ قَالَ مَالِكٌ مَنْ سَلَّفَ فِي حِنْطَةٍ شَامِيَّةٍ فَلاَ بَأْسَ أَنْ يَأْخُذَ مَحْمُولَةً بَعْدَ مَحِلِّ الأَجَلِ ‏.‏ قَالَ مَالِكٌ وَكَذَلِكَ مَنْ سَلَّفَ فِي صِنْفٍ مِنَ الأَصْنَافِ فَلاَ بَأْسَ أَنْ يَأْخُذَ خَيْرًا مِمَّا سَلَّفَ فِيهِ أَوْ أَدْنَى بَعْدَ مَحِلِّ الأَجَلِ وَتَفْسِيرُ ذَلِكَ أَنْ يُسَلِّفَ الرَّجُلُ فِي حِنْطَةٍ مَحْمُولَةٍ فَلاَ بَأْسَ أَنْ يَأْخُذَ شَعِيرًا أَوْ شَامِيَّةً وَإِنْ سَلَّفَ فِي تَمْرٍ عَجْوَةٍ فَلاَ بَأْسَ أَنْ يَأْخُذَ صَيْحَانِيًّا أَوْ جَمْعًا وَإِنْ سَلَّفَ فِي زَبِيبٍ أَحْمَرَ فَلاَ بَأْسَ أَنْ يَأْخُذَ أَسْوَدَ إِذَا كَانَ ذَلِكَ كُلُّهُ بَعْدَ مَحِلِّ الأَجَلِ إِذَا كَانَتْ مَكِيلَةُ ذَلِكَ سَوَاءً بِمِثْلِ كَيْلِ مَا سَلَّفَ فِيهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Nafi', daripada Abdullah bin Umar bahawa beliau berkata: \"Tiada masalah sekiranya seseorang memberi pinjaman kepada orang lain dalam makanan yang telah dinyatakan dengan harga yang diketahui sehingga tempoh yang telah ditetapkan, selagi ia bukan dalam tanaman yang belum masak atau kurma yang belum masak.\"\n\nMalik berkata: \"Cara yang diamalkan di kalangan kami bagi seseorang yang memberi pinjaman makanan dengan harga yang diketahui sehingga tempoh yang telah ditetapkan, kemudian tempoh itu tiba dan pembeli tidak menemui kepuasan daripada penjual untuk apa yang dibelinya, lalu pembatalan dilakukan, maka dia hanya perlu mengambil balik wang, emas atau harga yang dibayar sahaja.  Dia tidak boleh membeli apa-apa yang lain daripada penjual itu dengan harga yang sama sehingga dia menerima balik apa yang dibayar. Ini kerana jika dia mengambil sesuatu selain daripada wang yang dibayarnya atau menukarnya dengan barangan selain daripada makanan yang dibelinya, maka ia adalah jual beli makanan sebelum ia diterima.\"\n\nMalik berkata: \"Rasulullah SAW telah melarang jual beli makanan sebelum ia diterima.\"\n\nMalik berkata: \"Sekiranya pembeli menyesal dan meminta penjual membatalkan jual beli dan menangguhkan bayaran balik wang yang dibayar, maka ia tidak dibenarkan, dan ulama' melarang perkara ini. Ini kerana apabila makanan itu telah tersedia untuk pembeli daripada penjual, pembeli menangguhkan haknya daripada penjual untuk membatalkan jual beli, maka ia menjadi jual beli makanan dengan tempoh tertentu sebelum ia diterima.\"\n\nMalik berkata: \"Penjelasannya ialah apabila tempoh telah tiba dan pembeli tidak menyukai makanan tersebut, penjual mengambil bayaran balik dengan tempoh tertentu. Ini bukanlah pembatalan. Pembatalan jual beli ialah di mana kedua-dua penjual dan pembeli tidak mendapat keuntungan. Sekiranya terdapat keuntungan dengan menangguhkan bayaran atau dengan apa sahaja yang memberikan keuntungan kepada salah seorang daripada mereka, maka ia bukan pembatalan. Sekiranya salah seorang daripada mereka melakukannya, pembatalan jual beli akan menjadi jual beli. Pembatalan jual beli, perkongsian dan peralihan dibenarkan selagi tidak melibatkan peningkatan, pengurangan atau penangguhan. Sekiranya terdapat peningkatan, pengurangan atau penangguhan, ia menjadi jual beli. Apa yang menghalalkan jual beli akan menghalalkan ia dan apa yang mengharamkan jual beli akan mengharamkannya.\"\n\nMalik berkata: \"Sekiranya seseorang membayar pendahuluan untuk gandum Syria, tiada masalah sekiranya dia mengambil muatan selepas tempoh yang ditetapkan.\"\n\nMalik berkata: \"Begitu juga bagi seseorang yang membayar pendahuluan untuk apa-apa jenis barang. Tiada masalah sekiranya dia mengambil yang lebih baik atau lebih buruk daripada apa yang dibayar pendahuluannya selepas tarikh penghantaran yang dipersetujui. Penjelasannya ialah, contohnya, jika seseorang membayar pendahuluan untuk berat gandum tertentu. Tiada masalah sekiranya dia mengambil barli atau gandum Syria. Sekiranya dia membayar pendahuluan untuk kurma yang baik, tiada masalah sekiranya dia mengambil kurma yang berkualiti rendah. Sekiranya dia membayar pendahuluan untuk kismis merah, tiada masalah sekiranya dia mengambil yang hitam, jika semuanya selepas tarikh penghantaran yang dipersetujui, dan ukurannya sama dengan ukuran yang dibayar pendahuluannya.\" "
  },
  {
    "id": 35576,
    "hadith_number": 1398,
    "tajuk_hadith": "Saad ibn Abi Waqqas dan Bekalan Makanan Keldai",
    "perawi_melayu": "Yahya melalui Malik daripada Sulaiman ibn Yasar",
    "english_text": "Yahya related to me from Malik that he had heard that Sulayman\nibn Yasar said, \"The fodder of the donkeys of Saad ibn Abi Waqqas ran\nout and so he told his slave to take some of the family's wheat and\nbuy barley with it, and to only take a like quantity.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سُلَيْمَانَ بْنَ يَسَارٍ، قَالَ فَنِيَ عَلَفُ حِمَارِ سَعْدِ بْنِ أَبِي وَقَّاصٍ فَقَالَ لِغُلاَمِهِ خُذْ مِنْ حِنْطَةِ أَهْلِكَ فَابْتَعْ بِهَا شَعِيرًا وَلاَ تَأْخُذْ إِلاَّ مِثْلَهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik bahawa baginda telah mendengar bahawa Sulaiman bin Yasar berkata, \"Makanan haiwan keldai Saad bin Abi Waqqas telah habis. Maka baginda memberitahu hambanya untuk mengambil sebahagian daripada gandum keluarga dan menukarkannya dengan barli, dan hanya mengambil kuantiti yang sama.\""
  },
  {
    "id": 35577,
    "hadith_number": 1399,
    "tajuk_hadith": "Mencari Makan Haiwan: Kisah Abd ar-Rahman ibn al-Aswad",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Nafi', daripada Sulaiman bin Yasar",
    "english_text": "Yahya related to me from Malik from Nafi that Sulayman ibn Yasar\ntold him that one time the fodder of the animals of Abd ar-Rahman ibn\nal-Aswad ibn Abd Yaghuth was finished so he said  to his slave, \"Take\nsome of your family's wheat as food and buy with it barley, and take\nonly a like quantity.' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّهُ أَخْبَرَهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الأَسْوَدِ بْنِ عَبْدِ يَغُوثَ فَنِيَ عَلَفُ دَابَّتِهِ فَقَالَ لِغُلاَمِهِ خُذْ مِنْ حِنْطَةِ أَهْلِكَ طَعَامًا فَابْتَعْ بِهَا شَعِيرًا وَلاَ تَأْخُذْ إِلاَّ مِثْلَهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Nafi', daripada Sulaiman bin Yasar, bahawa baginda memberitahu bahawa Abdur Rahman bin Aswad bin Abd Yaghuth kehabisan makanan ternakan binatang tunggangannya. Maka dia berkata kepada hambanya: \"Ambillah sedikit gandum daripada makanan keluarga kamu, kemudian belilah barli dengannya, dan janganlah kamu mengambil melainkan jumlah yang sama.\" "
  },
  {
    "id": 35578,
    "hadith_number": 1400,
    "tajuk_hadith": "Peraturan Pertukaran dan Perdagangan Makanan",
    "perawi_melayu": "Yahya melalui Malik daripada al-Qasim ibn Muhammad daripada Ibn Muayqib ad-Dawsi",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنِ ابْنِ مُعَيْقِيبٍ الدَّوْسِيِّ، مِثْلُ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَهُوَ الأَمْرُ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنْ لاَ تُبَاعَ الْحِنْطَةُ بِالْحِنْطَةِ وَلاَ التَّمْرُ بِالتَّمْرِ وَلاَ الْحِنْطَةُ بِالتَّمْرِ وَلاَ التَّمْرُ بِالزَّبِيبِ وَلاَ الْحِنْطَةُ بِالزَّبِيبِ وَلاَ شَىْءٌ مِنَ الطَّعَامِ كُلِّهِ إِلاَّ يَدًا بِيَدٍ فَإِنْ دَخَلَ شَيْئًا مِنْ ذَلِكَ الأَجَلُ لَمْ يَصْلُحْ وَكَانَ حَرَامًا وَلاَ شَىْءَ مِنَ الأُدْمِ كُلِّهَا إِلاَّ يَدًا بِيَدٍ ‏.‏ قَالَ مَالِكٌ وَلاَ يُبَاعُ شَىْءٌ مِنَ الطَّعَامِ وَالأُدْمِ إِذَا كَانَ مِنْ صِنْفٍ وَاحِدٍ اثْنَانِ بِوَاحِدٍ فَلاَ يُبَاعُ مُدُّ حِنْطَةٍ بِمُدَّىْ حِنْطَةٍ وَلاَ مُدُّ تَمْرٍ بِمُدَّىْ تَمْرٍ وَلاَ مُدُّ زَبِيبٍ بِمُدَّىْ زَبِيبٍ وَلاَ مَا أَشْبَهَ ذَلِكَ مِنَ الْحُبُوبِ وَالأُدْمِ كُلِّهَا إِذَا كَانَ مِنْ صِنْفٍ وَاحِدٍ وَإِنْ كَانَ يَدًا بِيَدٍ إِنَّمَا ذَلِكَ بِمَنْزِلَةِ الْوَرِقِ بِالْوَرِقِ وَالذَّهَبِ بِالذَّهَبِ لاَ يَحِلُّ فِي شَىْءٍ مِنْ ذَلِكَ الْفَضْلُ وَلاَ يَحِلُّ إِلاَّ مِثْلاً بِمِثْلٍ يَدًا بِيَدٍ ‏.‏ قَالَ مَالِكٌ وَإِذَا اخْتَلَفَ مَا يُكَالُ أَوْ يُوزَنُ مِمَّا يُؤْكَلُ أَوْ يُشْرَبُ فَبَانَ اخْتِلاَفُهُ فَلاَ بَأْسَ أَنْ يُؤْخَذَ مِنْهُ اثْنَانِ بِوَاحِدٍ يَدًا بِيَدٍ وَلاَ بَأْسَ أَنْ يُؤْخَذَ صَاعٌ مِنْ تَمْرٍ بِصَاعَيْنِ مِنْ حِنْطَةٍ وَصَاعٌ مِنْ تَمْرٍ بِصَاعَيْنِ مِنْ زَبِيبٍ وَصَاعٌ مِنْ حِنْطَةٍ بِصَاعَيْنِ مِنْ سَمْنٍ فَإِذَا كَانَ الصِّنْفَانِ مِنْ هَذَا مُخْتَلِفَيْنِ فَلاَ بَأْسَ بِاثْنَيْنِ مِنْهُ بِوَاحِدٍ أَوْ أَكْثَرَ مِنْ ذَلِكَ يَدًا بِيَدٍ فَإِنْ دَخَلَ ذَلِكَ الأَجَلُ فَلاَ يَحِلُّ ‏.‏ قَالَ مَالِكٌ وَلاَ تَحِلُّ صُبْرَةُ الْحِنْطَةِ بِصُبْرَةِ الْحِنْطَةِ وَلاَ بَأْسَ بِصُبْرَةِ الْحِنْطَةِ بِصُبْرَةِ التَّمْرِ يَدًا بِيَدٍ وَذَلِكَ أَنَّهُ لاَ بَأْسَ أَنْ يُشْتَرَى الْحِنْطَةُ بِالتَّمْرِ جِزَافًا ‏.‏ قَالَ مَالِكٌ وَكُلُّ مَا اخْتَلَفَ مِنَ الطَّعَامِ وَالأُدْمِ فَبَانَ اخْتِلاَفُهُ فَلاَ بَأْسَ أَنْ يُشْتَرَى بَعْضُهُ بِبَعْضٍ جِزَافًا يَدًا بِيَدٍ فَإِنْ دَخَلَهُ الأَجَلُ فَلاَ خَيْرَ فِيهِ وَإِنَّمَا اشْتِرَاءُ ذَلِكَ جِزَافًا كَاشْتِرَاءِ بَعْضِ ذَلِكَ بِالذَّهَبِ وَالْوَرِقِ جِزَافًا ‏.‏ قَالَ مَالِكٌ وَذَلِكَ أَنَّكَ تَشْتَرِي الْحِنْطَةَ بِالْوَرِقِ جِزَافًا وَالتَّمْرَ بِالذَّهَبِ جِزَافًا فَهَذَا حَلاَلٌ لاَ بَأْسَ بِهِ ‏.‏ قَالَ مَالِكٌ وَمَنْ صَبَّرَ صُبْرَةَ طَعَامٍ وَقَدْ عَلِمَ كَيْلَهَا ثُمَّ بَاعَهَا جِزَافًا وَكَتَمَ الْمُشْتَرِي كَيْلَهَا فَإِنَّ ذَلِكَ لاَ يَصْلُحُ فَإِنْ أَحَبَّ الْمُشْتَرِي أَنْ يَرُدَّ ذَلِكَ الطَّعَامَ عَلَى الْبَائِعِ رَدَّهُ بِمَا كَتَمَهُ كَيْلَهُ وَغَرَّهُ وَكَذَلِكَ كُلُّ مَا عَلِمَ الْبَائِعُ كَيْلَهُ وَعَدَدَهُ مِنَ الطَّعَامِ وَغَيْرِهِ ثُمَّ بَاعَهُ جِزَافًا وَلَمْ يَعْلَمِ الْمُشْتَرِي ذَلِكَ فَإِنَّ الْمُشْتَرِيَ إِنْ أَحَبَّ أَنْ يَرُدَّ ذَلِكَ عَلَى الْبَائِعِ رَدَّهُ وَلَمْ يَزَلْ أَهْلُ الْعِلْمِ يَنْهَوْنَ عَنْ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَلاَ خَيْرَ فِي الْخُبْزِ قُرْصٍ بِقُرْصَيْنِ وَلاَ عَظِيمٍ بِصَغِيرٍ إِذَا كَانَ بَعْضُ ذَلِكَ أَكْبَرَ مِنْ بَعْضٍ فَأَمَّا إِذَا كَانَ يَتَحَرَّى أَنْ يَكُونَ مِثْلاً بِمِثْلٍ فَلاَ بَأْسَ بِهِ وَإِنْ لَمْ يُوزَنْ ‏.‏ قَالَ مَالِكٌ لاَ يَصْلُحُ مُدُّ زُبْدٍ وَمُدُّ لَبَنٍ بِمُدَّىْ زُبْدٍ وَهُوَ مِثْلُ الَّذِي وَصَفْنَا مِنَ التَّمْرِ الَّذِي يُبَاعُ صَاعَيْنِ مِنْ كَبِيسٍ وَصَاعًا مِنْ حَشَفٍ بِثَلاَثَةِ أَصْوُعٍ مِنْ عَجْوَةٍ حِينَ قَالَ لِصَاحِبِهِ إِنَّ صَاعَيْنِ مِنْ كَبِيسٍ بِثَلاَثَةِ أَصْوُعٍ مِنَ الْعَجْوَةِ لاَ يَصْلُحُ ‏.‏ فَفَعَلَ ذَلِكَ لِيُجِيزَ بَيْعَهُ وَإِنَّمَا جَعَلَ صَاحِبُ اللَّبَنِ اللَّبَنَ مَعَ زُبْدِهِ لِيَأْخُذَ فَضْلَ زُبْدِهِ عَلَى زُبْدِ صَاحِبِهِ حِينَ أَدْخَلَ مَعَهُ اللَّبَنَ ‏.‏ قَالَ مَالِكٌ وَالدَّقِيقُ بِالْحِنْطَةِ مِثْلاً بِمِثْلٍ لاَ بَأْسَ بِهِ وَذَلِكَ لأَنَّهُ أَخْلَصَ الدَّقِيقَ فَبَاعَهُ بِالْحِنْطَةِ مِثْلاً بِمِثْلٍ وَلَوْ جَعَلَ نِصْفَ الْمُدِّ مِنْ دَقِيقٍ وَنِصْفَهُ مِنْ حِنْطَةٍ فَبَاعَ ذَلِكَ بِمُدٍّ مِنْ حِنْطَةٍ كَانَ ذَلِكَ مِثْلَ الَّذِي وَصَفْنَا لاَ يَصْلُحُ لأَنَّهُ إِنَّمَا أَرَادَ أَنْ يَأْخُذَ فَضْلَ حِنْطَتِهِ الْجَيِّدَةِ حَتَّى جَعَلَ مَعَهَا الدَّقِيقَ فَهَذَا لاَ يَصْلُحُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa beliau telah mendengar perkara yang sama daripada al-Qasim bin Muhammad, daripada Ibn Muayqib ad-Dawsi. Malik berkata, “Inilah cara yang diamalkan di kalangan kami.”  Malik berkata, “Cara yang umumnya dipersetujui di kalangan kami ialah gandum tidak dijual dengan gandum, kurma dengan kurma, gandum dengan kurma, kurma dengan kismis, gandum dengan kismis, mahupun apa-apa jenis makanan dengan makanan, melainkan secara tunai. Jika terdapat sebarang tempoh yang ditangguh dalam transaksi, ia tidak dibenarkan dan ia adalah haram. Rempah ratus juga tidak boleh ditukar ganti melainkan secara tunai.”\n\nMalik berkata, “Makanan dan rempah ratus tidak boleh ditukar ganti jika ia daripada jenis yang sama, dua unit untuk satu unit. Satu mudd gandum tidak dijual dengan dua mudd gandum, mahupun satu mudd kurma dengan dua mudd kurma, mahupun satu mudd kismis dengan dua mudd kismis, mahupun apa-apa yang serupa dengan bijirin dan rempah ratus jika ia daripada jenis yang sama, walaupun secara tunai. Ini adalah seperti perak dengan perak dan emas dengan emas. Tiada tambahan yang halal dalam transaksi, dan hanya sama dengan sama, secara tunai sahaja yang halal.”\n\nMalik berkata, “Jika terdapat perbezaan yang jelas dalam makanan yang diukur dan ditimbang, tiada masalah untuk mengambil dua unit daripada satu jenis untuk satu unit yang lain, secara tunai. Tiada masalah untuk mengambil satu sa’ kurma untuk dua sa’ gandum, dan satu sa’ kurma untuk dua sa’ kismis, dan satu sa’ gandum untuk dua sa’ minyak sapi. Jika kedua-dua jenis dalam transaksi adalah berbeza, tiada masalah untuk dua unit untuk satu unit atau lebih daripada itu secara tunai. Jika tempoh yang ditangguh dimasukkan ke dalam jual beli, ia tidak halal.”\n\nMalik berkata, “Tidak halal untuk menukar gandum sekelompok dengan gandum sekelompok. Tiada masalah untuk menukar gandum sekelompok dengan kurma sekelompok, secara tunai. Ini kerana tiada masalah untuk membeli gandum dengan kurma tanpa ukuran yang tepat.”\n\nMalik berkata, “Bagi jenis makanan dan rempah ratus yang berbeza antara satu sama lain, dan perbezaannya jelas, tiada masalah untuk menukarkan satu jenis dengan jenis yang lain, tanpa ukuran yang tepat secara tunai. Jika tempoh yang ditangguh dimasukkan ke dalam jual beli, ia tidak dibenarkan. Menukar barangan sebegini tanpa ukuran yang tepat adalah seperti membelinya dengan emas dan perak tanpa ukuran yang tepat.”\n\nMalik berkata, “Ini kerana anda membeli gandum dengan perak tanpa ukuran yang tepat, dan kurma dengan emas tanpa ukuran yang tepat, dan ia adalah halal. Tiada masalah dengannya.”\n\nMalik berkata, “Tidak dibenarkan untuk seseorang menimbun makanan, mengetahui sukatannya, kemudian menjualnya seolah-olah ia tidak diukur dengan tepat, menyembunyikan sukatannya daripada pembeli. Jika pembeli ingin mengembalikan makanan itu kepada penjual, dia boleh, kerana dia menyembunyikan sukatannya dan oleh itu ia adalah transaksi yang tidak pasti. Ini dilakukan dengan apa-apa jenis makanan atau barangan lain yang sukatan dan bilangannya diketahui oleh penjual, dan kemudian dijual tanpa ukuran dan pembeli tidak mengetahuinya. Jika pembeli ingin mengembalikannya kepada penjual, dia boleh mengembalikannya. Ulama masih melarang transaksi sebegini.”\n\nMalik berkata, “Tidak dibenarkan menjual satu biji roti bulat untuk dua biji roti bulat, mahupun yang besar untuk yang kecil jika sebahagian daripadanya lebih besar daripada yang lain. Tetapi jika dipastikan ia sama, tiada masalah dalam jual beli, walaupun ia tidak ditimbang.”\n\nMalik berkata, “Tidak dibenarkan menjual satu mudd mentega dan satu mudd susu untuk dua mudd mentega. Ini adalah seperti apa yang kami huraikan tentang jual beli kurma di mana dua sa’ kurma kabis dan satu sa’ kurma berkualiti rendah dijual dengan tiga sa’ kurma ajwa selepas pembeli berkata kepada penjual, ‘Dua sa’ kurma kabis untuk tiga sa’ kurma ajwa tidak dibenarkan,’ kemudian dia melakukannya untuk membolehkan transaksi tersebut. Pemilik susu mencampurkan susu dengan menteganya supaya dia boleh menggunakan kelebihan menteganya berbanding mentega pihak lain dengan memasukkan susunya.”\n\nMalik berkata, “Tepung dengan gandum adalah sama, dan tiada masalah dengannya. Ini jika dia tidak mencampurkan apa-apa dengan tepung dan menjualnya dengan gandum, sama dengan sama. Sekiranya dia meletakkan separuh mudd tepung dan separuh gandum, kemudian menjualnya dengan satu mudd gandum, ia adalah seperti yang kami huraikan, dan ia tidak dibenarkan kerana dia ingin menggunakan kelebihan gandumnya yang baik dengan mencampurkan tepung. Transaksi sebegini tidak dibenarkan.”"
  },
  {
    "id": 35579,
    "hadith_number": 1401,
    "tajuk_hadith": "Nasihat Said ibn al-Musayyab tentang Pembelian Makanan",
    "perawi_melayu": "Yahya (dari Malik, dari Muhammad ibn Abdullah ibn Abi Maryam)",
    "english_text": "Yahya related to me from Malik that Muhammad ibn Abdullah ibn Abi\nMaryam asked Said ibn al-Musayyab's advice. \"I am a man who buys food\nwith receipts from al-Jar. Perhaps I will buy something for a dinar\nand half a dirham, and will be given food for a half.\" Said said, \"No.\nYou give a dirham, and take the rest in food.\" (A half dirham did not\nexist as a coin.)",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي مَرْيَمَ، أَنَّهُ سَأَلَ سَعِيدَ بْنَ الْمُسَيَّبِ فَقَالَ إِنِّي رَجُلٌ أَبْتَاعُ الطَّعَامَ يَكُونُ مِنَ الصُّكُوكِ بِالْجَارِ فَرُبَّمَا ابْتَعْتُ مِنْهُ بِدِينَارٍ وَنِصْفِ دِرْهَمٍ فَأُعْطَى بِالنِّصْفِ طَعَامًا ‏.‏ فَقَالَ سَعِيدٌ لاَ وَلَكِنْ أَعْطِ أَنْتَ دِرْهَمًا وَخُذْ بَقِيَّتَهُ طَعَامًا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Muhammad bin Abdullah bin Abi Maryam, bahawa dia bertanya nasihat kepada Said bin al-Musayyab.  Dia berkata, \"Saya seorang lelaki yang membeli makanan dengan menggunakan wang kertas daripada al-Jar.  Kadang-kadang saya membeli sesuatu dengan satu dinar dan setengah dirham, dan saya diberi makanan untuk setengah dirham.\" Said berkata, \"Tidak. Tetapi berikanlah satu dirham, dan ambillah selebihnya sebagai makanan.\" (Setengah dirham tidak wujud sebagai duit syiling.)"
  },
  {
    "id": 35580,
    "hadith_number": 1402,
    "tajuk_hadith": "Larangan Menjual Bijirin Sebelum Putih dan Transaksi Makanan",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik yang mendengar daripada Muhammad bin Sirin",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ مُحَمَّدَ بْنَ سِيرِينَ، كَانَ يَقُولُ لاَ تَبِيعُوا الْحَبَّ فِي سُنْبُلِهِ حَتَّى يَبْيَضَّ ‏.‏ قَالَ مَالِكٌ مَنِ اشْتَرَى طَعَامًا بِسِعْرٍ مَعْلُومٍ إِلَى أَجَلٍ مُسَمًّى فَلَمَّا حَلَّ الأَجَلُ قَالَ الَّذِي عَلَيْهِ الطَّعَامُ لِصَاحِبِهِ لَيْسَ عِنْدِي طَعَامٌ فَبِعْنِي الطَّعَامَ الَّذِي لَكَ عَلَىَّ إِلَى أَجَلٍ ‏.‏ فَيَقُولُ صَاحِبُ الطَّعَامِ هَذَا لاَ يَصْلُحُ لأَنَّهُ قَدْ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الطَّعَامِ حَتَّى يُسْتَوْفَى ‏.‏ فَيَقُولُ الَّذِي عَلَيْهِ الطَّعَامُ لِغَرِيمِهِ فَبِعْنِي طَعَامًا إِلَى أَجَلٍ حَتَّى أَقْضِيَكَهُ ‏.‏ فَهَذَا لاَ يَصْلُحُ لأَنَّهُ إِنَّمَا يُعْطِيهِ طَعَامًا ثُمَّ يَرُدُّهُ إِلَيْهِ ‏.‏ فَيَصِيرُ الذَّهَبُ الَّذِي أَعْطَاهُ ثَمَنَ الَّذِي كَانَ لَهُ عَلَيْهِ وَيَصِيرُ الطَّعَامُ الَّذِي أَعْطَاهُ مُحَلَّلاً فِيمَا بَيْنَهُمَا وَيَكُونُ ذَلِكَ إِذَا فَعَلاَهُ بَيْعَ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ لَهُ عَلَى رَجُلٍ طَعَامٌ ابْتَاعَهُ مِنْهُ وَلِغَرِيمِهِ عَلَى رَجُلٍ طَعَامٌ مِثْلُ ذَلِكَ الطَّعَامِ فَقَالَ الَّذِي عَلَيْهِ الطَّعَامُ لِغَرِيمِهِ أُحِيلُكَ عَلَى غَرِيمٍ لِي عَلَيْهِ مِثْلُ الطَّعَامِ الَّذِي لَكَ عَلَىَّ بِطَعَامِكَ الَّذِي لَكَ عَلَىَّ ‏.‏ قَالَ مَالِكٌ إِنْ كَانَ الَّذِي عَلَيْهِ الطَّعَامُ إِنَّمَا هُوَ طَعَامٌ ابْتَاعَهُ فَأَرَادَ أَنْ يُحِيلَ غَرِيمَهُ بِطَعَامٍ ابْتَاعَهُ فَإِنَّ ذَلِكَ لاَ يَصْلُحُ وَذَلِكَ بَيْعُ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى فَإِنْ كَانَ الطَّعَامُ سَلَفًا حَالاًّ فَلاَ بَأْسَ أَنْ يُحِيلَ بِهِ غَرِيمَهُ لأَنَّ ذَلِكَ لَيْسَ بِبَيْعٍ وَلاَ يَحِلُّ بَيْعُ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى لِنَهْىِ رَسُولِ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ غَيْرَ أَنَّ أَهْلَ الْعِلْمِ قَدِ اجْتَمَعُوا عَلَى أَنَّهُ لاَ بَأْسَ بِالشِّرْكِ وَالتَّوْلِيَةِ وَالإِقَالَةِ فِي الطَّعَامِ وَغَيْرِهِ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ أَنَّ أَهْلَ الْعِلْمِ أَنْزَلُوهُ عَلَى وَجْهِ الْمَعْرُوفِ وَلَمْ يُنْزِلُوهُ عَلَى وَجْهِ الْبَيْعِ وَذَلِكَ مِثْلُ الرَّجُلِ يُسَلِّفُ الدَّرَاهِمَ النُّقَّصَ فَيُقْضَى دَرَاهِمَ وَازِنَةً فِيهَا فَضْلٌ فَيَحِلُّ لَهُ ذَلِكَ وَيَجُوزُ وَلَوِ اشْتَرَى مِنْهُ دَرَاهِمَ نُقَّصًا بِوَازِنَةٍ لَمْ يَحِلَّ ذَلِكَ وَلَوِ اشْتَرَطَ عَلَيْهِ حِينَ أَسْلَفَهُ وَازِنَةً وَإِنَّمَا أَعْطَاهُ نُقَّصًا لَمْ يَحِلَّ لَهُ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَمِمَّا يُشْبِهُ ذَلِكَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الْمُزَابَنَةِ وَأَرْخَصَ فِي بَيْعِ الْعَرَايَا بِخَرْصِهَا مِنَ التَّمْرِ وَإِنَّمَا فُرِقَ بَيْنَ ذَلِكَ أَنَّ بَيْعَ الْمُزَابَنَةِ بَيْعٌ عَلَى وَجْهِ الْمُكَايَسَةِ وَالتِّجَارَةِ وَأَنَّ بَيْعَ الْعَرَايَا عَلَى وَجْهِ الْمَعْرُوفِ لاَ مُكَايَسَةَ فِيهِ ‏.‏ قَالَ مَالِكٌ وَلاَ يَنْبَغِي أَنْ يَشْتَرِيَ رَجُلٌ طَعَامًا بِرُبُعٍ أَوْ ثُلُثٍ أَوْ كِسْرٍ مِنْ دِرْهَمٍ عَلَى أَنْ يُعْطَى بِذَلِكَ طَعَامًا إِلَى أَجَلٍ وَلاَ بَأْسَ أَنْ يَبْتَاعَ الرَّجُلُ طَعَامًا بِكِسْرٍ مِنْ دِرْهَمٍ إِلَى أَجَلٍ ثُمَّ يُعْطَى دِرْهَمًا وَيَأْخُذُ بِمَا بَقِيَ لَهُ مِنْ دِرْهَمِهِ سِلْعَةً مِنَ السِّلَعِ لأَنَّهُ أَعْطَى الْكِسْرَ الَّذِي عَلَيْهِ فِضَّةً وَأَخَذَ بِبَقِيَّةِ دِرْهَمِهِ سِلْعَةً فَهَذَا لاَ بَأْسَ بِهِ ‏.‏ قَالَ مَالِكٌ وَلاَ بَأْسَ أَنْ يَضَعَ الرَّجُلُ عِنْدَ الرَّجُلِ دِرْهَمًا ثُمَّ يَأْخُذُ مِنْهُ بِرُبُعٍ أَوْ بِثُلُثٍ أَوْ بِكِسْرٍ مَعْلُومٍ سِلْعَةً مَعْلُومَةً فَإِذَا لَمْ يَكُنْ فِي ذَلِكَ سِعْرٌ مَعْلُومٌ وَقَالَ الرَّجُلُ آخُذُ مِنْكَ بِسِعْرِ كُلِّ يَوْمٍ فَهَذَا لاَ يَحِلُّ لأَنَّهُ غَرَرٌ يَقِلُّ مَرَّةً وَيَكْثُرُ مَرَّةً وَلَمْ يَفْتَرِقَا عَلَى بَيْعٍ مَعْلُومٍ ‏.‏ قَالَ مَالِكٌ وَمَنْ بَاعَ طَعَامًا جِزَافًا وَلَمْ يَسْتَثْنِ مِنْهُ شَيْئًا ثُمَّ بَدَا لَهُ أَنْ يَشْتَرِيَ مِنْهُ شَيْئًا فَإِنَّهُ لاَ يَصْلُحُ لَهُ أَنْ يَشْتَرِيَ مِنْهُ شَيْئًا إِلاَّ مَا كَانَ يَجُوزُ لَهُ أَنْ يَسْتَثْنِيَ مِنْهُ وَذَلِكَ الثُّلُثُ فَمَا دُونَهُ فَإِنْ زَادَ عَلَى الثُّلُثِ صَارَ ذَلِكَ إِلَى الْمُزَابَنَةِ وَإِلَى مَا يُكْرَهُ فَلاَ يَنْبَغِي لَهُ أَنْ يَشْتَرِيَ مِنْهُ شَيْئًا إِلاَّ مَا كَانَ يَجُوزُ لَهُ أَنْ يَسْتَثْنِيَ مِنْهُ وَلاَ يَجُوزُ لَهُ أَنْ يَسْتَثْنِيَ مِنْهُ إِلاَّ الثُّلُثَ فَمَا دُونَهُ وَهَذَا الأَمْرُ الَّذِي لاَ اخْتِلاَفَ فِيهِ عِنْدَنَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa baginda telah diberitahu bahawa Muhammad bin Sirin berkata, \"Janganlah kamu menjual bijirin dalam bentuk tangkai sebelum ia menjadi putih.\" Malik berkata, \"Sekiranya seseorang membeli makanan dengan harga yang telah diketahui pada tarikh yang telah ditetapkan, maka apabila tarikh itu tiba, orang yang berhutang makanan itu berkata kepada pemiliknya, 'Saya tidak mempunyai makanan, maka juallah kepada saya makanan yang menjadi hak anda ke atas saya dengan tempoh bayaran yang ditangguhkan.' Pemilik makanan itu berkata, 'Ini tidak dibenarkan kerana Rasulullah SAW telah melarang penjualan makanan sehingga ia diterima sepenuhnya.' Orang yang berhutang makanan itu berkata kepada pemiutangnya, 'Maka juallah kepada saya makanan dengan tempoh bayaran yang ditangguhkan sehingga saya dapat membayar anda.' Ini tidak dibenarkan, kerana dia hanya memberi makanan kemudian menerimanya semula. Emas yang diberikannya menjadi harga makanan yang menjadi hak pemiutang ke atasnya, dan makanan yang diberikannya menjadi penunaian hutang di antara mereka. Jika mereka berbuat demikian, ia menjadi penjualan makanan sebelum ia diterima sepenuhnya.\" Malik berkata tentang seorang lelaki yang berhutang makanan yang dibelinya daripada seorang lelaki, dan pemiutang itu pula berhutang makanan yang sama daripada lelaki lain. Lelaki yang berhutang makanan itu berkata kepada pemiutangnya, \"Saya akan menghala kamu kepada penghutang saya yang berhutang makanan yang sama seperti yang kamu hutangkan kepada saya, supaya kamu boleh mendapat makanan yang menjadi hutang saya.\" Malik berkata, \"Sekiranya lelaki yang sepatutnya menyerahkan makanan itu telah membelinya untuk membayar hutangnya, itu tidak dibenarkan. Itu adalah penjualan makanan sebelum ia diterima sepenuhnya. Sekiranya makanan itu adalah bayaran pendahuluan yang jatuh tempo pada masa itu, maka tidak mengapa jika dia membayar hutangnya dengannya kerana ia bukanlah jual beli. Tidak halal menjual makanan sebelum menerimanya sepenuhnya kerana Rasulullah SAW telah melarang perkara tersebut. Namun, para ulama' telah bersepakat bahawa tidak mengapa melakukan syarikat, penyerahan tanggungjawab dan pembatalan dalam jual beli makanan dan barangan lain.\" Malik berkata, \"Ini kerana para ulama' menganggapnya sebagai suatu kebaikan, dan bukan jual beli. Ia seperti seseorang meminjamkan dinar yang kurang berat. Kemudian dia dibayar balik dengan dinar yang cukup berat, lalu dia mendapat lebih daripada yang dipinjamkannya. Ini halal dan dibolehkan baginya. Sekiranya dia membeli dinar yang kurang berat daripada orang itu sebagai dinar yang cukup berat, itu tidak halal. Dan sekiranya telah dipersetujui bahawa dia meminjamkan dinar yang cukup berat, tetapi dia memberikan dinar yang kurang berat, maka ia tidak halal baginya.\" "
  },
  {
    "id": 35581,
    "hadith_number": 1403,
    "tajuk_hadith": "Larangan Muzabana dan Hukum Jual Beli Makanan Secara Kredit",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Malik berkata: “Contohnya ialah bahawa Rasulullah SAW melarang jual beli jenis muzabana, dan membenarkan dalam urusan ariyah (pinjaman) pengiraan yang sama nilainya dalam tamar (kurma). Perbezaannya ialah muzabana mengandungi unsur tipu daya dan perdagangan, manakala ariyah adalah berdasarkan ihsan (kebaikan), dan tidak ada unsur tipu daya di dalamnya.”\n\nMalik berkata: “Tiada apa-apa kesalahan bagi seseorang yang membeli makanan dengan seperempat dirham, atau sepertiganya, atau sebahagian daripadanya secara kredit, dan tiada apa-apa kesalahan bagi seseorang yang membeli makanan dengan sebahagian daripada dirham secara kredit, kemudian dia memberi satu dirham dan mengambil tambahan daripada baki dirhamnya, kerana dia telah membayar bahagian yang menjadi tanggungannya dengan wang perak, dan mengambil tambahan untuk melengkapkan dirhamnya, maka tiada apa-apa kesalahan dalam urus niaga tersebut.”\n\nMalik berkata: “Tiada apa-apa kesalahan bagi seseorang yang menyimpan satu dirham di tempat seseorang, kemudian mengambil darinya barangan yang diketahui nilainya dengan seperempat, atau sepertiga, atau sebahagian yang diketahui nilainya. Sekiranya harga barangan tersebut tidak diketahui, dan dia berkata: ‘Aku akan mengambilnya daripada kamu dengan upah setiap hari,’ maka ini adalah haram, kerana ia mengandungi unsur ketidakpastian (gharar), mungkin berkurangan pada suatu hari dan bertambah pada suatu hari yang lain, dan mereka tidak berpisah dengan jual beli yang diketahui nilainya.”\n\nMalik berkata: “Sekiranya seseorang menjual makanan tanpa sukatan yang tepat, dan tidak mengecualikan sebarang bahagian daripadanya daripada jual beli, kemudian dia menyesal dan ingin membelinya semula, maka tidak halal baginya untuk membeli melainkan apa yang dibenarkan baginya untuk dikecualikan, iaitu sepertiga atau kurang daripada sepertiga. Jika melebihi sepertiga, ia menjadi muzabana dan dibenci. Dia hanya boleh membeli apa yang dibenarkan untuk dikecualikan, dan dia hanya dibenarkan mengecualikan sepertiga atau kurang daripada itu. Inilah cara yang tidak ada perselisihan di kalangan kita.”"
  },
  {
    "id": 35582,
    "hadith_number": 1404,
    "tajuk_hadith": "Larangan Mengawal Harga dan Menimbun Barang di Pasaran",
    "perawi_melayu": "Yahya meriwayatkan dari Malik bahawa baginda telah mendengar bahawa Umar bin al-Khattab berkata",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ لاَ حُكْرَةَ فِي سُوقِنَا لاَ يَعْمِدُ رِجَالٌ بِأَيْدِيهِمْ فُضُولٌ مِنْ أَذْهَابٍ إِلَى رِزْقٍ مِنْ رِزْقِ اللَّهِ نَزَلَ بِسَاحَتِنَا فَيَحْتَكِرُونَهُ عَلَيْنَا وَلَكِنْ أَيُّمَا جَالِبٍ جَلَبَ عَلَى عَمُودِ كَبِدِهِ فِي الشِّتَاءِ وَالصَّيْفِ فَذَلِكَ ضَيْفُ عُمَرَ فَلْيَبِعْ كَيْفَ شَاءَ اللَّهُ وَلْيُمْسِكْ كَيْفَ شَاءَ اللَّهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa telah sampai kepadanya bahawa Umar bin al-Khattab berkata, \"Tiada penimbunan di pasaran kita.  Janganlah orang yang mempunyai banyak emas di tangan mereka membeli sebahagian daripada rezeki Allah yang telah diturunkan ke pasaran kita, kemudian menimbunnya terhadap kita.  Tetapi sesiapa yang membawa barangan import dengan susah payah pada musim sejuk dan panas, maka dia adalah tetamu Umar.  Hendaklah dia menjual sepertimana yang Allah kehendaki dan hendaklah dia menyimpan sepertimana yang Allah kehendaki.\""
  },
  {
    "id": 35583,
    "hadith_number": 1405,
    "tajuk_hadith": "Larangan Menjual Murah di Pasar",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Yunus bin Yusuf, daripada Said bin al-Musayyab",
    "english_text": "Yahya related to me from Malik from Yunus ibn Yusuf from Said ibn\nal-Musayyab that Umar ibn al-Khattab passed by Hatab ibn Abi Baltaa\nwho was underselling some of his raisins in the market. Umar ibn al-\nKhattab said to him, \"Either increase the price or leave our market.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يُونُسَ بْنِ يُوسُفَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، مَرَّ بِحَاطِبِ بْنِ أَبِي بَلْتَعَةَ وَهُوَ يَبِيعُ زَبِيبًا لَهُ بِالسُّوقِ فَقَالَ لَهُ عُمَرُ بْنُ الْخَطَّابِ إِمَّا أَنْ تَزِيدَ فِي السِّعْرِ وَإِمَّا أَنْ تُرْفَعَ مِنْ سُوقِنَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yunus bin Yusuf, daripada Said bin al-Musayyab bahawa Umar bin al-Khattab telah lalu di sisi Hatab bin Abi Baltaah yang ketika itu menjual kismisnya dengan harga yang terlalu rendah di pasar.  Umar bin al-Khattab berkata kepadanya, \"Sama ada engkau menaikkan harga atau engkau keluar dari pasar kami.\""
  },
  {
    "id": 35584,
    "hadith_number": 1406,
    "tajuk_hadith": "Larangan Othman bin Affan terhadap Penimbunan Harta",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik bahawa baginda telah mendengar bahawa Usman bin Affan melarang penimbunan harta.",
    "english_text": "Yahya related to me from Malik that he had heard that Uthman ibn Affan forbade hoarding .",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُثْمَانَ بْنَ عَفَّانَ، كَانَ يَنْهَى عَنِ الْحُكْرَةِ، ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik bahawa baginda telah mendengar bahawa Usman bin Affan melarang penimbunan harta."
  },
  {
    "id": 35585,
    "hadith_number": 1407,
    "tajuk_hadith": "Jualan Unta Ali bin Abi Talib",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Saleh bin Kaysan, dari Hasan bin Muhammad bin Ali bin Abi Talib",
    "english_text": "Yahya related to me from Malik from Salih ibn Kaysan from Hasan\nibn Muhammad ibn Ali ibn Abi Talib that Ali ibn Abi Talib sold one of\nhis camels called Usayfir for 20 camels to be delivered later.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنْ حَسَنِ بْنِ مُحَمَّدِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ، أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ، بَاعَ جَمَلاً لَهُ يُدْعَى عُصَيْفِيرًا بِعِشْرِينَ بَعِيرًا إِلَى أَجَلٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik, daripada Saleh bin Kaysan, daripada Hasan bin Muhammad bin Ali bin Abi Talib, bahawa Ali bin Abi Talib telah menjual seekor untanya yang bernama Usayfir dengan harga dua puluh ekor unta yang akan dihantar kemudian."
  },
  {
    "id": 35586,
    "hadith_number": 1408,
    "tajuk_hadith": "Transaksi Unta Abdullah bin Umar",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Nafi'",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nbought a female riding-camel for four camels and he guaranteed to give\nthem in full to the buyer at ar-Rabadha.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، اشْتَرَى رَاحِلَةً بِأَرْبَعَةِ أَبْعِرَةٍ مَضْمُونَةٍ عَلَيْهِ يُوفِيهَا صَاحِبَهَا بِالرَّبَذَةِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik, daripada Nafi', bahawa Abdullah bin Umar telah membeli seekor unta betina tunggangan dengan harga empat ekor unta, dan beliau menjamin akan melunaskan bayaran sepenuhnya kepada pembeli di ar-Rabadhah."
  },
  {
    "id": 35587,
    "hadith_number": 1409,
    "tajuk_hadith": "Pertukaran Haiwan dan Jual Beli Secara Tangguh",
    "perawi_melayu": "Yahya melalui Malik daripada Ibn Shihab",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنْ بَيْعٍ الْحَيَوَانِ، اثْنَيْنِ بِوَاحِدٍ إِلَى أَجَلٍ فَقَالَ لاَ بَأْسَ بِذَلِكَ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّهُ لاَ بَأْسَ بِالْجَمَلِ بِالْجَمَلِ مِثْلِهِ وَزِيَادَةِ دَرَاهِمَ يَدًا بِيَدٍ وَلاَ بَأْسَ بِالْجَمَلِ بِالْجَمَلِ مِثْلِهِ وَزِيَادَةِ دَرَاهِمَ الْجَمَلُ بِالْجَمَلِ يَدًا بِيَدٍ وَالدَّرَاهِمُ إِلَى أَجَلٍ ‏.‏ قَالَ وَلاَ خَيْرَ فِي الْجَمَلِ بِالْجَمَلِ مِثْلِهِ وَزِيَادَةِ دَرَاهِمَ الدَّرَاهِمُ نَقْدًا وَالْجَمَلُ إِلَى أَجَلٍ وَإِنْ أَخَّرْتَ الْجَمَلَ وَالدَّرَاهِمَ لاَ خَيْرَ فِي ذَلِكَ أَيْضًا ‏.‏ قَالَ مَالِكٌ وَلاَ بَأْسَ أَنْ يَبْتَاعَ الْبَعِيرَ النَّجِيبَ بِالْبَعِيرَيْنِ أَوْ بِالأَبْعِرَةِ مِنَ الْحَمُولَةِ مِنْ مَاشِيَةِ الإِبِلِ وَإِنْ كَانَتْ مِنْ نَعَمٍ وَاحِدَةٍ فَلاَ بَأْسَ أَنْ يُشْتَرَى مِنْهَا اثْنَانِ بِوَاحِدٍ إِلَى أَجَلٍ إِذَا اخْتَلَفَتْ فَبَانَ اخْتِلاَفُهَا وَإِنْ أَشْبَهَ بَعْضُهَا بَعْضًا وَاخْتَلَفَتْ أَجْنَاسُهَا أَوْ لَمْ تَخْتَلِفْ فَلاَ يُؤْخَذُ مِنْهَا اثْنَانِ بِوَاحِدٍ إِلَى أَجَلٍ ‏.‏ قَالَ مَالِكٌ وَتَفْسِيرُ مَا كُرِهَ مِنْ ذَلِكَ أَنْ يُؤْخَذَ الْبَعِيرُ بِالْبَعِيرَيْنِ لَيْسَ بَيْنَهُمَا تَفَاضُلٌ فِي نَجَابَةٍ وَلاَ رِحْلَةٍ فَإِذَا كَانَ هَذَا عَلَى مَا وَصَفْتُ لَكَ فَلاَ يُشْتَرَى مِنْهُ اثْنَانِ بِوَاحِدٍ إِلَى أَجَلٍ وَلاَ بَأْسَ أَنْ تَبِيعَ مَا اشْتَرَيْتَ مِنْهَا قَبْلَ أَنْ تَسْتَوْفِيَهُ مِنْ غَيْرِ الَّذِي اشْتَرَيْتَهُ مِنْهُ إِذَا انْتَقَدْتَ ثَمَنَهُ ‏.‏ قَالَ مَالِكٌ وَمَنْ سَلَّفَ فِي شَىْءٍ مِنَ الْحَيَوَانِ إِلَى أَجَلٍ مُسَمًّى فَوَصَفَهُ وَحَلاَّهُ وَنَقَدَ ثَمَنَهُ فَذَلِكَ جَائِزٌ وَهُوَ لاَزِمٌ لِلْبَائِعِ وَالْمُبْتَاعِ عَلَى مَا وَصَفَا وَحَلَّيَا وَلَمْ يَزَلْ ذَلِكَ مِنْ عَمَلِ النَّاسِ الْجَائِزِ بَيْنَهُمْ وَالَّذِي لَمْ يَزَلْ عَلَيْهِ أَهْلُ الْعِلْمِ بِبَلَدِنَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa beliau bertanya kepada Ibnu Syihab tentang jual beli haiwan, dua ekor dengan satu ekor secara tangguh. Ibnu Syihab berkata, \"Tiada masalah dengannya.\"  Malik berkata, \"Amalan yang disepakati di kalangan kami ialah tiada masalah untuk menukar unta dengan unta yang serupa dan menambah beberapa dirham secara tunai.  Tiada masalah juga untuk menukar unta dengan unta yang serupa dan menambah beberapa dirham, unta ditukar secara tunai, dan dirham dibayar secara tangguh.  Tetapi,\" katanya, \"tidak baik menukar unta dengan unta yang serupa dan menambah beberapa dirham, dirham dibayar tunai dan unta dibayar secara tangguh. Jika kedua-dua unta dan dirham ditangguhkan, ia juga tidak baik.\"  Malik berkata, \"Tiada masalah untuk membeli unta tunggangan dengan dua atau lebih unta beban, jika ia daripada baka yang rendah. Tiada masalah untuk menukar dua ekor dengan satu ekor secara tangguh, jika ia berbeza dan perbezaannya jelas. Tetapi jika ia serupa, sama ada spesiesnya berbeza atau tidak, dua ekor tidak boleh ditukar dengan satu ekor secara tangguh.\"  Malik berkata, \"Penjelasan tentang apa yang dibenci dalam hal ini ialah unta tidak boleh dibeli dengan dua unta lain jika tiada perbezaan di antara keduanya dari segi kelajuan atau ketahanan. Jika ia seperti yang saya terangkan kepada anda, maka dua ekor tidak boleh dibeli dengan satu ekor secara tangguh. Tiada masalah untuk menjual apa yang anda beli sebelum anda melunaskan bayarannya kepada orang lain selain daripada orang yang anda beli darinya, jika anda membayar tunai.\"  Malik berkata, \"Ia diharuskan bagi seseorang untuk membayar pendahuluan bagi haiwan secara tangguh dengan jumlah yang telah ditetapkan dan membayar tunai harganya. Apa yang telah dipersetujui oleh pembeli dan penjual adalah wajib ke atas mereka. Ia masih merupakan amalan yang dibenarkan di kalangan manusia dan amalan yang diamalkan oleh para ulama di negara kita.\""
  },
  {
    "id": 35588,
    "hadith_number": 1410,
    "tajuk_hadith": "Larangan Rasulullah SAW terhadap jual beli Habal al-Habalah",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Nafi', daripada Abdullah bin Umar",
    "english_text": "Yahya related to me from Malih from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nforbade the transaction called habal alhabala. It was a transaction\nwhich the people of Jahiliya practised. A man would buy the unborn\noffspring of the unborn offspring of a she-camel.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ حَبَلِ الْحَبَلَةِ ‏.‏ وَكَانَ بَيْعًا يَتَبَايَعُهُ أَهْلُ الْجَاهِلِيَّةِ كَانَ الرَّجُلُ يَبْتَاعُ الْجَزُورَ إِلَى أَنْ تُنْتَجَ النَّاقَةُ ‏.‏ ثُمَّ تُنْتَجَ الَّتِي فِي بَطْنِهَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Nafi', daripada Abdullah bin Umar bahawa Rasulullah SAW melarang jual beli Habal al-Habalah.  Ia adalah satu jenis jual beli yang diamalkan oleh orang-orang Jahiliyyah.  Seorang lelaki akan membeli anak unta yang belum lahir daripada anak unta yang belum lahir lagi."
  },
  {
    "id": 35589,
    "hadith_number": 1411,
    "tajuk_hadith": "Larangan Menjual Haiwan Tertentu",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Ibn Shihab bahawa Said ibn al-Musayyab berkata, \"Tiada riba dalam haiwan. Tiga perkara yang dilarang dalam haiwan:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ لاَ رِبًا فِي الْحَيَوَانِ وَإِنَّمَا نُهِيَ مِنَ الْحَيَوَانِ عَنْ ثَلاَثَةٍ عَنِ الْمَضَامِينِ وَالْمَلاَقِيحِ وَحَبَلِ الْحَبَلَةِ ‏.‏ وَالْمَضَامِينُ بَيْعُ مَا فِي بُطُونِ إِنَاثِ الإِبِلِ وَالْمَلاَقِيحُ بَيْعُ مَا فِي ظُهُورِ الْجِمَالِ ‏.‏ قَالَ مَالِكٌ لاَ يَنْبَغِي أَنْ يَشْتَرِيَ أَحَدٌ شَيْئًا مِنَ الْحَيَوَانِ بِعَيْنِهِ إِذَا كَانَ غَائِبًا عَنْهُ وَإِنْ كَانَ قَدْ رَآهُ وَرَضِيَهُ عَلَى أَنْ يَنْقُدَ ثَمَنَهُ لاَ قَرِيبًا وَلاَ بَعِيدًا ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا كُرِهَ ذَلِكَ لأَنَّ الْبَائِعَ يَنْتَفِعُ بِالثَّمَنِ وَلاَ يُدْرَى هَلْ تُوجَدُ تِلْكَ السِّلْعَةُ عَلَى مَا رَآهَا الْمُبْتَاعُ أَمْ لاَ فَلِذَلِكَ كُرِهَ ذَلِكَ وَلاَ بَأْسَ بِهِ إِذَا كَانَ مَضْمُونًا مَوْصُوفًا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Ibn Shihab bahawa Said ibn al-Musayyab berkata, \"Tiada riba dalam haiwan.  Tiga perkara yang dilarang dalam haiwan: al-madamin, al-malaqih dan habal al-habala. Al-madamin ialah jual beli kandungan rahim unta betina. Al-malaqih ialah jual beli sifat pembiakan unta (iaitu untuk tujuan mengawan). \n\nMalik berkata, \"Tidak sepatutnya seseorang membeli sesuatu haiwan tertentu jika ia berada di tempat yang tersembunyi darinya, walaupun dia telah melihatnya sebelum ini, sama ada baru-baru ini atau tidak, dan telah berpuas hati untuk membayar harganya secara tunai.\"\n\nMalik berkata, \"Perkara itu dibenci kerana penjual mendapat manfaat daripada harga jualan, dan tidak diketahui sama ada barangan itu seperti yang dilihat oleh pembeli atau tidak. Atas sebab itu, ia dibenci. Tiada apa-apa salahnya jika ia diterangkan dan dijamin.\""
  },
  {
    "id": 35590,
    "hadith_number": 1412,
    "tajuk_hadith": "Larangan Menukar Haiwan Hidup dengan Daging",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Zayd bin Aslam, daripada Said bin al-Musayyab",
    "english_text": "Yahya related to me from Malik from Zayd ibn Aslam from Said ibn\nal-Musayyab that the Messenger of Allah, may Allah bless him and grant\nhim peace, forbade bartering live animals for meat.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Zayd bin Aslam, dari Said bin al-Musayyab bahawa Rasulullah SAW melarang pertukaran haiwan hidup dengan daging."
  },
  {
    "id": 35591,
    "hadith_number": 1413,
    "tajuk_hadith": "Perjudian Zaman Jahiliyyah: Menukar Haiwan Hidup dengan Daging",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Daud bin al-Husayn, bahawa beliau mendengar Said bin al-Musayyab berkata,",
    "english_text": "Yahya related to me from Malik from Da'ud ibn al-Husayn that he\nheard Said ibn alMusayyab say, \"Part of the gambling of the people of\nJahiliya was bartering live animals for slaughtered meat, for instance\none live sheep for two slaughtered sheep.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ مِنْ مَيْسِرِ أَهْلِ الْجَاهِلِيَّةِ بَيْعُ الْحَيَوَانِ بِاللَّحْمِ بِالشَّاةِ وَالشَّاتَيْنِ ‏.‏",
    "malay_translation": "Sebahagian daripada perjudian orang Jahiliyyah ialah menukar haiwan hidup dengan daging, contohnya seekor kambing hidup dengan dua ekor kambing yang telah disembelih."
  },
  {
    "id": 35592,
    "hadith_number": 1414,
    "tajuk_hadith": "Larangan Menukar Haiwan Hidup dengan Daging",
    "perawi_melayu": "Yahya melalui Malik daripada Abu az-Zinad daripada Said ibn al-Musayyab",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ كَانَ يَقُولُ نُهِيَ عَنْ بَيْعِ الْحَيَوَانِ، بِاللَّحْمِ ‏.‏ قَالَ أَبُو الزِّنَادِ فَقُلْتُ لِسَعِيدِ بْنِ الْمُسَيَّبِ أَرَأَيْتَ رَجُلاً اشْتَرَى شَارِفًا بِعَشَرَةِ شِيَاهٍ فَقَالَ سَعِيدٌ إِنْ كَانَ اشْتَرَاهَا لِيَنْحَرَهَا فَلاَ خَيْرَ فِي ذَلِكَ ‏.‏ قَالَ أَبُو الزِّنَادِ وَكُلُّ مَنْ أَدْرَكْتُ مِنَ النَّاسِ يَنْهَوْنَ عَنْ بَيْعِ الْحَيَوَانِ بِاللَّحْمِ ‏.‏ قَالَ أَبُو الزِّنَادِ وَكَانَ ذَلِكَ يُكْتَبُ فِي عُهُودِ الْعُمَّالِ فِي زَمَانِ أَبَانَ بْنِ عُثْمَانَ وَهِشَامِ بْنِ إِسْمَاعِيلَ يَنْهَوْنَ عَنْ ذَلِكَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abu az-Zinad, daripada Said ibn al-Musayyab bahawa beliau berkata: “Dilarang menukar haiwan hidup dengan daging.” Abu az-Zinad berkata: “Aku bertanya kepada Said ibn al-Musayyab, ‘Bagaimana pendapatmu tentang seseorang yang membeli unta tua dengan sepuluh ekor kambing?’” Said menjawab: “Jika dia membelinya untuk disembelih, maka tiada kebaikan dalam perbuatan itu.” Abu az-Zinad menambah: “Semua orang yang kutemui melarang menukar haiwan hidup dengan daging.” Abu az-Zinad berkata lagi: “Perkara ini pernah ditulis dalam surat pelantikan gabenor pada zaman Aban ibn Uthman dan Hisham ibn Ismail, yang melarang perbuatan itu.”"
  },
  {
    "id": 35593,
    "hadith_number": 1415,
    "tajuk_hadith": "Pertukaran Daging: Unta, Lembu, Kambing, dan Unggas",
    "perawi_melayu": "Malik",
    "english_text": "Malik said, \"It is the generally agreed on way of doing things\namong us that the meat of camels, cattle, sheep and so on is not to be\nbartered one for one, except like for like, weight for weight, from\nhand to hand. There is no harm in that. If it is not weighed, then it\nis estimated to be like for like from hand to hand.\"\n\n\nMalik\nsaid, \"There is no harm in bartering the meat of fish for the meat of\ncamels, cattle, and sheep and so on two or more for one, from hand to\nhand. If delayed terms enter the transaction however, there is no good\nin it.\"\n\n\nMalik said, \"I think that poultry is different from\nthe meat of cattle and fish. I see no harm in selling some of it for\nsomething different, more of one than another, from hand to hand. None\nof that is to be sold on delayed terms.\"",
    "arabic_text": "",
    "malay_translation": "Malik berkata, \"Amalan yang lazim di kalangan kami ialah daging unta, lembu, kambing dan sebagainya tidak boleh ditukarkan satu dengan satu, kecuali yang serupa dengan serupa, berat dengan berat, dari tangan ke tangan. Tiada mudaratnya dalam hal ini. Jika tidak ditimbang, maka dianggarkan serupa dengan serupa dari tangan ke tangan.\"\n\nMalik berkata, \"Tiada mudaratnya dalam menukar daging ikan dengan daging unta, lembu, dan kambing dan sebagainya dua atau lebih dengan satu, dari tangan ke tangan.  Namun, jika tempoh bayaran ditangguhkan, ia tidak baik.\"\n\nMalik berkata, \"Saya fikir unggas berbeza daripada daging lembu dan ikan. Saya tidak nampak mudaratnya dalam menjual sebahagian daripadanya dengan sesuatu yang berbeza, lebih daripada satu daripada yang lain, dari tangan ke tangan. Tiada satu pun daripada itu boleh dijual dengan tempoh bayaran yang ditangguhkan.\""
  },
  {
    "id": 35594,
    "hadith_number": 1416,
    "tajuk_hadith": "Larangan Keuntungan daripada Anjing, Pelacur, dan Peramal",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Abu Bakar ibn Abd ar-Rahman ibn al-Harith ibn Hisham, daripada Abu Masud al-Ansari",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ ثَمَنِ الْكَلْبِ وَمَهْرِ الْبَغِيِّ وَحُلْوَانِ الْكَاهِنِ ‏.‏ يَعْنِي بِمَهْرِ الْبَغِيِّ مَا تُعْطَاهُ الْمَرْأَةُ عَلَى الزِّنَا وَحُلْوَانُ الْكَاهِنِ رَشْوَتُهُ وَمَا يُعْطَى عَلَى أَنْ يَتَكَهَّنَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Abu Bakar bin Abd ar-Rahman bin al-Harith bin Hisham, daripada Abu Masud al-Ansari bahawa Rasulullah SAW telah melarang keuntungan daripada jual beli anjing, upah pelacur, dan bayaran kepada tukang ramal. Maksud upah pelacur ialah apa yang diberikan kepada wanita atas perzinaan, manakala bayaran kepada tukang ramal ialah ganjaran atau apa sahaja yang diberikan kepadanya untuk meramal. Malik berkata, \"Saya tidak menyenangi harga anjing, sama ada anjing pemburu atau selainnya, kerana Rasulullah SAW telah melarang harga anjing.\""
  },
  {
    "id": 35595,
    "hadith_number": 1417,
    "tajuk_hadith": "Larangan Jual Beli dan Pinjaman Serta Pertukaran Barangan",
    "perawi_melayu": "Yahya melalui Malik",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعٍ وَسَلَفٍ ‏.‏ قَالَ مَالِكٌ وَتَفْسِيرُ ذَلِكَ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ آخُذُ سِلْعَتَكَ بِكَذَا وَكَذَا عَلَى أَنْ تُسْلِفَنِي كَذَا وَكَذَا ‏.‏ فَإِنْ عَقَدَا بَيْعَهُمَا عَلَى هَذَا فَهُوَ غَيْرُ جَائِزٍ فَإِنْ تَرَكَ الَّذِي اشْتَرَطَ السَّلَفَ مَا اشْتَرَطَ مِنْهُ كَانَ ذَلِكَ الْبَيْعُ جَائِزًا ‏.‏ قَالَ مَالِكٌ وَلاَ بَأْسَ أَنْ يُشْتَرَى الثَّوْبُ مِنَ الْكَتَّانِ أَوِ الشَّطَوِيِّ أَوِ الْقَصَبِيِّ بِالأَثْوَابِ مِنَ الإِتْرِيبِيِّ أَوِ الْقَسِّيِّ أَوِ الزِّيقَةِ أَوِ الثَّوْبِ الْهَرَوِيِّ أَوِ الْمَرْوِيِّ بِالْمَلاَحِفِ الْيَمَانِيَّةِ وَالشَّقَائِقِ وَمَا أَشْبَهَ ذَلِكَ الْوَاحِدُ بِالاِثْنَيْنِ أَوِ الثَّلاَثَةِ يَدًا بِيَدٍ أَوْ إِلَى أَجَلٍ وَإِنْ كَانَ مِنْ صِنْفٍ وَاحِدٍ فَإِنْ دَخَلَ ذَلِكَ نَسِيئَةٌ فَلاَ خَيْرَ فِيهِ ‏.‏ قَالَ مَالِكٌ وَلاَ يَصْلُحُ حَتَّى يَخْتَلِفَ فَيَبِينَ اخْتِلاَفُهُ فَإِذَا أَشْبَهَ بَعْضُ ذَلِكَ بَعْضًا وَإِنِ اخْتَلَفَتْ أَسْمَاؤُهُ فَلاَ يَأْخُذْ مِنْهُ اثْنَيْنِ بِوَاحِدٍ إِلَى أَجَلٍ وَذَلِكَ أَنْ يَأْخُذَ الثَّوْبَيْنِ مِنَ الْهَرَوِيِّ بِالثَّوْبِ مِنَ الْمَرْوِيِّ أَوِ الْقُوهِيِّ إِلَى أَجَلٍ أَوْ يَأْخُذَ الثَّوْبَيْنِ مِنَ الْفُرْقُبِيِّ بِالثَّوْبِ مِنَ الشَّطَوِيِّ فَإِذَا كَانَتْ هَذِهِ الأَجْنَاسُ عَلَى هَذِهِ الصِّفَةِ فَلاَ يُشْتَرَى مِنْهَا اثْنَانِ بِوَاحِدٍ إِلَى أَجَلٍ ‏.‏ قَالَ مَالِكٌ وَلاَ بَأْسَ أَنْ تَبِيعَ مَا اشْتَرَيْتَ مِنْهَا قَبْلَ أَنْ تَسْتَوْفِيَهُ مِنْ غَيْرِ صَاحِبِهِ الَّذِي اشْتَرَيْتَهُ مِنْهُ إِذَا انْتَقَدْتَ ثَمَنَهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik bahawa telah sampai kepadanya bahawa Rasulullah SAW melarang jual beli dan pinjaman secara serentak. Malik berkata, \"Maksudnya ialah seorang lelaki berkata kepada lelaki lain, 'Aku akan mengambil baranganmu dengan harga sekian-sekian dengan syarat engkau memberi pinjaman kepadaku sekian-sekian.' Jika mereka bersetuju dengan transaksi sebegini, ia adalah tidak dibenarkan.  Jika pihak yang menetapkan pinjaman itu membatalkan syaratnya, maka jual beli itu dibenarkan.\" \n\nMalik berkata, \"Tiada masalah untuk menukar kain linen dari Shata dengan pakaian dari Itribi, atau Qass, atau Ziqa. Atau kain dari Herat atau Merv dengan jubah dan selendang Yaman dan sebagainya, satu dengan dua atau tiga, tunai atau kredit. Tetapi jika barangan itu daripada jenis yang sama, dan tempoh kredit dimasukkan ke dalam transaksi, ia tidak baik.\"\n\nMalik berkata, \"Ia tidak baik melainkan jika ia berbeza, dan perbezaannya jelas. Jika ia serupa, walaupun namanya berbeza, jangan ambil dua dengan satu secara kredit, contohnya dua pakaian dari Herat dengan satu dari Merv atau Quhy secara kredit, atau dua pakaian dari Furqub dengan satu dari Shata. Semua jenis ini adalah daripada jenis yang sama, jadi jangan beli dua dengan satu secara kredit.\"\n\nMalik berkata, \"Tiada masalah untuk menjual apa yang anda beli daripada barangan sebegini sebelum anda melengkapkan urus niaga, kepada orang lain selain daripada orang yang anda beli darinya, jika harga telah dibayar tunai.\""
  },
  {
    "id": 35596,
    "hadith_number": 1418,
    "tajuk_hadith": "Larangan Menjual Hutang dengan Hutang dan Panduan Transaksi Niaga",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Yahya bin Said bahawa al-Qasim bin Muhammad berkata, \"Saya mendengar Abdullah bin Abbas berkata, apabila seorang lelaki bertanya kepadanya tentang seorang lelaki yang membuat pendahuluan bagi beberapa pakaian dan kemudian ingin menjualnya semula sebelum mengambil milikannya, 'Itu adalah perak untuk perak,' dan beliau tidak menyukainya.\"\n\nMalik berkata, \"Pendapat kami ialah - dan Allah lebih mengetahui - bahawa itu kerana dia ingin menjualnya kepada orang yang darinya dia membelinya dengan harga lebih daripada harga yang dibelinya. Sekiranya dia menjualnya kepada orang lain selain daripada orang yang darinya dia membelinya, tidak akan ada mudaratnya.\"\n\nMalik berkata, \"Cara yang umumnya dipersetujui di kalangan kami berkenaan membuat pendahuluan untuk hamba, ternakan atau barang dagangan ialah apabila semua yang akan dijual diterangkan dan pendahuluan dibuat untuknya pada satu tarikh, dan tarikh itu tiba, pembeli tidak menjual apa-apa daripada itu kepada orang yang darinya dia telah membelinya dengan harga lebih daripada harga yang telah didahulukannya sebelum dia mengambil milikan sepenuhnya apa yang telah didahulukannya. Ia adalah riba jika dia berbuat demikian. Sekiranya pembeli memberi penjual dinar atau dirham dan dia mendapat keuntungan dengannya, maka, apabila barang dagangan sampai kepada pembeli dan dia tidak mengambilnya ke dalam milikannya tetapi menjualnya kembali kepada pemiliknya dengan harga lebih daripada apa yang telah didahulukannya, hasilnya ialah apa yang telah didahulukannya telah kembali kepadanya dan telah ditambah untuknya.\"\n\nMalik berkata, \"Sekiranya seseorang mendahulukan emas atau perak untuk haiwan atau barang dagangan yang diterangkan yang hendak dihantar sebelum tarikh yang disebut, dan tarikh itu tiba, atau sebelum atau selepas tarikh itu, tidak ada mudaratnya pembeli menjual barang-barang itu kepada penjual, untuk barang-barang lain, untuk diambil segera dan tidak ditangguhkan, tidak kira berapa banyak jumlah barang-barang itu, kecuali dalam kes makanan kerana ia tidak halal untuk menjualnya sebelum dia memiliki sepenuhnya. Pembeli boleh menjual barang-barang itu kepada orang lain selain daripada orang yang darinya dia membelinya dengan emas atau perak atau apa-apa barang. Dia mengambil milikannya dan tidak menangguhkannya kerana jika dia menangguhkannya, itu adalah buruk dan memasuki transaksi apa yang tidak disenangi:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، وَرَجُلٌ، يَسْأَلُهُ عَنْ رَجُلٍ، سَلَّفَ فِي سَبَائِبَ فَأَرَادَ بَيْعَهَا قَبْلَ أَنْ يَقْبِضَهَا فَقَالَ ابْنُ عَبَّاسٍ تِلْكَ الْوَرِقُ بِالْوَرِقِ ‏.‏ وَكَرِهَ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ فِيمَا نُرَى وَاللَّهُ أَعْلَمُ أَنَّهُ أَرَادَ أَنْ يَبِيعَهَا مِنْ صَاحِبِهَا الَّذِي اشْتَرَاهَا مِنْهُ بِأَكْثَرَ مِنَ الثَّمَنِ الَّذِي ابْتَاعَهَا بِهِ وَلَوْ أَنَّهُ بَاعَهَا مِنْ غَيْرِ الَّذِي اشْتَرَاهَا مِنْهُ لَمْ يَكُنْ بِذَلِكَ بَأْسٌ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا فِيمَنْ سَلَّفَ فِي رَقِيقٍ أَوْ مَاشِيَةٍ أَوْ عُرُوضٍ فَإِذَا كَانَ كُلُّ شَىْءٍ مِنْ ذَلِكَ مَوْصُوفًا فَسَلَّفَ فِيهِ إِلَى أَجَلٍ فَحَلَّ الأَجَلُ فَإِنَّ الْمُشْتَرِيَ لاَ يَبِيعُ شَيْئًا مِنْ ذَلِكَ مِنَ الَّذِي اشْتَرَاهُ مِنْهُ بِأَكْثَرَ مِنَ الثَّمَنِ الَّذِي سَلَّفَهُ فِيهِ قَبْلَ أَنْ يَقْبِضَ مَا سَلَّفَهُ فِيهِ وَذَلِكَ أَنَّهُ إِذَا فَعَلَهُ فَهُوَ الرِّبَا صَارَ الْمُشْتَرِي إِنْ أَعْطَى الَّذِي بَاعَهُ دَنَانِيرَ أَوْ دَرَاهِمَ فَانْتَفَعَ بِهَا فَلَمَّا حَلَّتْ عَلَيْهِ السِّلْعَةُ وَلَمْ يَقْبِضْهَا الْمُشْتَرِي بَاعَهَا مِنْ صَاحِبِهَا بِأَكْثَرَ مِمَّا سَلَّفَهُ فِيهَا فَصَارَ أَنْ رَدَّ إِلَيْهِ مَا سَلَّفَهُ وَزَادَهُ مِنْ عِنْدِهِ ‏.‏ قَالَ مَالِكٌ مَنْ سَلَّفَ ذَهَبًا أَوْ وَرِقًا فِي حَيَوَانٍ أَوْ عُرُوضٍ إِذَا كَانَ مَوْصُوفًا إِلَى أَجَلٍ مُسَمًّى ثُمَّ حَلَّ الأَجَلُ فَإِنَّهُ لاَ بَأْسَ أَنْ يَبِيعَ الْمُشْتَرِي تِلْكَ السِّلْعَةَ مِنَ الْبَائِعِ قَبْلَ أَنْ يَحِلَّ الأَجَلُ أَوْ بَعْدَ مَا يَحِلُّ بِعَرْضٍ مِنَ الْعُرُوضِ يُعَجِّلُهُ وَلاَ يُؤَخِّرُهُ بَالِغًا مَا بَلَغَ ذَلِكَ الْعَرْضُ إِلاَّ الطَّعَامَ فَإِنَّهُ لاَ يَحِلُّ أَنْ يَبِيعَهُ حَتَّى يَقْبِضَهُ وَلِلْمُشْتَرِي أَنْ يَبِيعَ تِلْكَ السِّلْعَةَ مِنْ غَيْرِ صَاحِبِهِ الَّذِي ابْتَاعَهَا مِنْهُ بِذَهَبٍ أَوْ وَرِقٍ أَوْ عَرْضٍ مِنَ الْعُرُوضِ يَقْبِضُ ذَلِكَ وَلاَ يُؤَخِّرُهُ لأَنَّهُ إِذَا أَخَّرَ ذَلِكَ قَبُحَ وَدَخَلَهُ مَا يُكْرَهُ مِنَ الْكَالِئِ بِالْكَالِئِ وَالْكَالِئُ بِالْكَالِئِ أَنْ يَبِيعَ الرَّجُلُ دَيْنًا لَهُ عَلَى رَجُلٍ بِدَيْنٍ عَلَى رَجُلٍ آخَرَ ‏.‏ قَالَ مَالِكٌ وَمَنْ سَلَّفَ فِي سِلْعَةٍ إِلَى أَجَلٍ وَتِلْكَ السِّلْعَةُ مِمَّا لاَ يُؤْكَلُ وَلاَ يُشْرَبُ فَإِنَّ الْمُشْتَرِيَ يَبِيعُهَا مِمَّنْ شَاءَ بِنَقْدٍ أَوْ عَرْضٍ قَبْلَ أَنْ يَسْتَوْفِيَهَا مِنْ غَيْرِ صَاحِبِهَا الَّذِي اشْتَرَاهَا مِنْهُ وَلاَ يَنْبَغِي لَهُ أَنْ يَبِيعَهَا مِنَ الَّذِي ابْتَاعَهَا مِنْهُ إِلاَّ بِعَرْضٍ يَقْبِضُهُ وَلاَ يُؤَخِّرُهُ ‏.‏ قَالَ مَالِكٌ وَإِنْ كَانَتِ السِّلْعَةُ لَمْ تَحِلَّ فَلاَ بَأْسَ بِأَنْ يَبِيعَهَا مِنْ صَاحِبِهَا بِعَرْضٍ مُخَالِفٍ لَهَا بَيِّنٍ خِلاَفُهُ يَقْبِضُهُ وَلاَ يُؤَخِّرُهُ ‏.‏ قَالَ مَالِكٌ فِيمَنْ سَلَّفَ دَنَانِيرَ أَوْ دَرَاهِمَ فِي أَرْبَعَةِ أَثْوَابٍ مَوْصُوفَةٍ إِلَى أَجَلٍ فَلَمَّا حَلَّ الأَجَلُ تَقَاضَى صَاحِبَهَا فَلَمْ يَجِدْهَا عِنْدَهُ وَوَجَدَ عِنْدَهُ ثِيَابًا دُونَهَا مِنْ صِنْفِهَا فَقَالَ لَهُ الَّذِي عَلَيْهِ الأَثْوَابُ أُعْطِيكَ بِهَا ثَمَانِيَةَ أَثْوَابٍ مِنْ ثِيَابِي هَذِهِ ‏.‏ إِنَّهُ لاَ بَأْسَ بِذَلِكَ إِذَا أَخَذَ تِلْكَ الأَثْوَابَ الَّتِي يُعْطِيهِ قَبْلَ أَنْ يَفْتَرِقَا فَإِنْ دَخَلَ ذَلِكَ الأَجَلُ فَإِنَّهُ لاَ يَصْلُحُ وَإِنْ كَانَ ذَلِكَ قَبْلَ مَحِلِّ الأَجَلِ فَإِنَّهُ لاَ يَصْلُحُ أَيْضًا إِلاَّ أَنْ يَبِيعَهُ ثِيَابًا لَيْسَتْ مِنْ صِنْفِ الثِّيَابِ الَّتِي سَلَّفَهُ فِيهَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Yahya bin Said bahawa al-Qasim bin Muhammad berkata, \"Saya mendengar Abdullah bin Abbas berkata, apabila seorang lelaki bertanya kepadanya tentang seorang lelaki yang membuat pendahuluan bagi beberapa pakaian dan kemudian ingin menjualnya semula sebelum mengambil milikannya, 'Itu adalah perak untuk perak,' dan beliau tidak menyukainya.\"\n\nMalik berkata, \"Pendapat kami ialah - dan Allah lebih mengetahui - bahawa itu kerana dia ingin menjualnya kepada orang yang darinya dia membelinya dengan harga lebih daripada harga yang dibelinya. Sekiranya dia menjualnya kepada orang lain selain daripada orang yang darinya dia membelinya, tidak akan ada mudaratnya.\"\n\nMalik berkata, \"Cara yang umumnya dipersetujui di kalangan kami berkenaan membuat pendahuluan untuk hamba, ternakan atau barang dagangan ialah apabila semua yang akan dijual diterangkan dan pendahuluan dibuat untuknya pada satu tarikh, dan tarikh itu tiba, pembeli tidak menjual apa-apa daripada itu kepada orang yang darinya dia telah membelinya dengan harga lebih daripada harga yang telah didahulukannya sebelum dia mengambil milikan sepenuhnya apa yang telah didahulukannya. Ia adalah riba jika dia berbuat demikian. Sekiranya pembeli memberi penjual dinar atau dirham dan dia mendapat keuntungan dengannya, maka, apabila barang dagangan sampai kepada pembeli dan dia tidak mengambilnya ke dalam milikannya tetapi menjualnya kembali kepada pemiliknya dengan harga lebih daripada apa yang telah didahulukannya, hasilnya ialah apa yang telah didahulukannya telah kembali kepadanya dan telah ditambah untuknya.\"\n\nMalik berkata, \"Sekiranya seseorang mendahuluan emas atau perak untuk haiwan atau barang dagangan yang diterangkan yang hendak dihantar sebelum tarikh yang disebut, dan tarikh itu tiba, atau sebelum atau selepas tarikh itu, tidak ada mudaratnya pembeli menjual barang-barang itu kepada penjual, untuk barang-barang lain, untuk diambil segera dan tidak ditangguhkan, tidak kira berapa banyak jumlah barang-barang itu, kecuali dalam kes makanan kerana ia tidak halal untuk menjualnya sebelum dia memiliki sepenuhnya. Pembeli boleh menjual barang-barang itu kepada orang lain selain daripada orang yang darinya dia membelinya dengan emas atau perak atau apa-apa barang. Dia mengambil milikannya dan tidak menangguhkannya kerana jika dia menangguhkannya, itu adalah buruk dan memasuki transaksi apa yang tidak disenangi:"
  },
  {
    "id": 35597,
    "hadith_number": 1419,
    "tajuk_hadith": "Pertukaran Barangan Bertimbang dan Berukur",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Malik berkata, \"Amalan yang lazim di kalangan kami mengenai barangan yang ditimbang, kecuali emas dan perak, seperti tembaga, besi kuning, plumbum, grafit, besi, herba, buah tin, kapas, dan sebagainya yang ditimbang, adalah tiada salahnya menukar dua unit dengan satu unit secara tunai. Tiada salahnya mengambil satu ritl besi untuk dua ritl besi, dan satu ritl besi kuning untuk dua ritl besi kuning.\"\n\nMalik berkata, \"Tidak dibenarkan menukar dua unit dengan satu unit daripada jenis yang sama dengan tempoh bayaran yang ditangguh. Tiada salahnya menukar dua unit daripada satu jenis dengan satu unit daripada jenis lain dengan tempoh bayaran yang ditangguh, jika kedua-dua jenis itu berbeza dengan jelas. Jika kedua-dua jenis itu serupa tetapi namanya berbeza, seperti plumbum dan grafit, besi kuning dan besi kuning tua, saya tidak menyarankan menukar dua unit daripada satu jenis dengan satu unit daripada jenis yang lain dengan tempoh bayaran yang ditangguh.\"\n\nMalik berkata, \"Apabila membeli sesuatu barangan sebegini, tiada salahnya menjualnya sebelum mengambilnya daripada orang lain selain daripada penjual asal, jika harganya dibayar segera dan ia dibeli berdasarkan ukuran atau timbangan. Jika ia dibeli tanpa pengukuran, ia boleh dijual kepada orang lain selain daripada penjual asal, secara tunai atau dengan tempoh bayaran yang ditangguh. Ini kerana barangan perlu dijamin apabila dibeli tanpa pengukuran, dan ia tidak boleh dijamin apabila dibeli berdasarkan timbangan sehingga ia ditimbang dan urus niaga selesai. Inilah yang terbaik yang pernah saya dengar mengenai semua perkara ini. Inilah yang terus diamalkan di kalangan kami.\"\n\nMalik berkata, \"Amalan kami terhadap barangan yang diukur atau ditimbang yang tidak dimakan atau diminum, seperti bunga safflower, biji kurma, daun makanan ternakan, pewarna nila dan seumpamanya, adalah tiada salahnya menukar dua unit dengan satu unit secara tunai. Jangan menukar dua unit dengan satu unit daripada jenis yang sama dengan tempoh bayaran yang ditangguh. Jika jenisnya berbeza dengan jelas, tiada salahnya menukar dua unit daripada satu jenis dengan satu unit daripada jenis yang lain dengan tempoh bayaran yang ditangguh. Tiada salahnya menjual apa sahaja yang dibeli daripada semua jenis ini, sebelum mengambilnya jika harganya dibayar oleh orang lain selain daripada penjual asal.\"\n\nMalik berkata, \"Sebarang jenis barangan yang memberi keuntungan kepada orang ramai, seperti kerikil dan gypsum, satu unit untuk dua unit yang serupa dengan tempoh bayaran yang ditangguh adalah riba. Satu unit daripada kedua-duanya untuk jumlah yang sama ditambah dengan apa-apa peningkatan dengan tempoh bayaran yang ditangguh, adalah riba.\""
  },
  {
    "id": 35598,
    "hadith_number": 1420,
    "tajuk_hadith": "Larangan Dua Jualan dalam Satu Jualan",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik",
    "english_text": "Yahya related to me from Malik that he had heard that the\nMessenger of Allah, may Allah bless him and grant him peace, forbade\ntwo sales in one sale.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ ‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعَتَيْنِ فِي بَيْعَةٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik bahawa baginda telah mendengar bahawa Rasulullah SAW telah melarang dua jualan dalam satu jualan."
  },
  {
    "id": 35599,
    "hadith_number": 1421,
    "tajuk_hadith": "Larangan Transaksi Jual Beli Secara Kredit Berurutan",
    "perawi_melayu": "Yahya (dari Malik)",
    "english_text": "Yahya related to me from Malik that he had heard that a man said\nto another, \"Buy this camel for me immediately so that I can buy him\nfrom you on credit.\" Abdullah ibn Umar was asked about that and he\ndisapproved of it and forbade it.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَجُلاً، قَالَ لِرَجُلٍ ابْتَعْ لِي هَذَا الْبَعِيرَ بِنَقْدٍ حَتَّى أَبْتَاعَهُ مِنْكَ إِلَى أَجَلٍ فَسُئِلَ عَنْ ذَلِكَ عَبْدُ اللَّهِ بْنُ عُمَرَ فَكَرِهَهُ وَنَهَى عَنْهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik bahawa baginda telah mendengar bahawa seorang lelaki berkata kepada lelaki yang lain, \"Beli unta ini untukku dengan tunai supaya aku boleh membelinya semula darimu secara kredit.\" Abdullah bin Umar telah ditanya mengenai perkara itu, lalu baginda membencinya dan melarangnya."
  },
  {
    "id": 35600,
    "hadith_number": 1422,
    "tajuk_hadith": "Larangan Dua Jualan dalam Satu Jualan",
    "perawi_melayu": "Yahya melalui Malik",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، سُئِلَ عَنْ رَجُلٍ، اشْتَرَى سِلْعَةً بِعَشَرَةِ دَنَانِيرَ نَقْدًا أَوْ بِخَمْسَةَ عَشَرَ دِينَارًا إِلَى أَجَلٍ فَكَرِهَ ذَلِكَ وَنَهَى عَنْهُ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ ابْتَاعَ سِلْعَةً مِنْ رَجُلٍ بِعَشَرَةِ دَنَانِيرَ نَقْدًا أَوْ بِخَمْسَةَ عَشَرَ دِينَارًا إِلَى أَجَلٍ قَدْ وَجَبَتْ لِلْمُشْتَرِي بِأَحَدِ الثَّمَنَيْنِ إِنَّهُ لاَ يَنْبَغِي ذَلِكَ لأَنَّهُ إِنْ أَخَّرَ الْعَشَرَةَ كَانَتْ خَمْسَةَ عَشَرَ إِلَى أَجَلٍ وَإِنْ نَقَدَ الْعَشَرَةَ كَانَ إِنَّمَا اشْتَرَى بِهَا الْخَمْسَةَ عَشَرَ الَّتِي إِلَى أَجَلٍ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ اشْتَرَى مِنْ رَجُلٍ سِلْعَةً بِدِينَارٍ نَقْدًا أَوْ بِشَاةٍ مَوْصُوفَةٍ إِلَى أَجَلٍ قَدْ وَجَبَ عَلَيْهِ بِأَحَدِ الثَّمَنَيْنِ إِنَّ ذَلِكَ مَكْرُوهٌ لاَ يَنْبَغِي لأَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ نَهَى عَنْ بَيْعَتَيْنِ فِي بَيْعَةٍ وَهَذَا مِنْ بَيْعَتَيْنِ فِي بَيْعَةٍ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ قَالَ لِرَجُلٍ أَشْتَرِي مِنْكَ هَذِهِ الْعَجْوَةَ خَمْسَةَ عَشَرَ صَاعًا أَوِ الصَّيْحَانِيَّ عَشَرَةَ أَصْوُعٍ أَوِ الْحِنْطَةَ الْمَحْمُولَةَ خَمْسَةَ عَشَرَ صَاعًا أَوِ الشَّامِيَّةَ عَشَرَةَ أَصْوُعٍ بِدِينَارٍ قَدْ وَجَبَتْ لِي إِحْدَاهُمَا إِنَّ ذَلِكَ مَكْرُوهٌ لاَ يَحِلُّ وَذَلِكَ أَنَّهُ قَدْ أَوْجَبَ لَهُ عَشَرَةَ أَصْوُعٍ صَيْحَانِيًّا فَهُوَ يَدَعُهَا وَيَأْخُذُ خَمْسَةَ عَشَرَ صَاعًا مِنَ الْعَجْوَةِ أَوْ تَجِبُ عَلَيْهِ خَمْسَةَ عَشَرَ صَاعًا مِنَ الْحِنْطَةِ الْمَحْمُولَةِ فَيَدَعُهَا وَيَأْخُذُ عَشَرَةَ أَصْوُعٍ مِنَ الشَّامِيَّةِ فَهَذَا أَيْضًا مَكْرُوهٌ لاَ يَحِلُّ وَهُوَ أَيْضًا يُشْبِهُ مَا نُهِيَ عَنْهُ مِنْ بَيْعَتَيْنِ فِي بَيْعَةٍ وَهُوَ أَيْضًا مِمَّا نُهِيَ عَنْهُ أَنْ يُبَاعَ مِنْ صِنْفٍ وَاحِدٍ مِنَ الطَّعَامِ اثْنَانِ بِوَاحِدٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa telah sampai kepadanya bahawa al-Qasim bin Muhammad ditanya tentang seseorang yang membeli barang dengan sepuluh dinar tunai atau lima belas dinar secara kredit.  Beliau tidak menyukai dan melarang perbuatan itu.\n\nMalik berkata, “Jika seseorang membeli barang daripada seseorang dengan sepuluh dinar tunai atau lima belas dinar secara kredit, maka salah satu daripada dua harga itu wajib ke atas pembeli.  Perbuatan itu tidak sepatutnya dilakukan kerana jika dia menangguh pembayaran sepuluh dinar, maka ia menjadi lima belas dinar secara kredit, dan jika dia membayar sepuluh dinar, maka dia hanya membeli barang yang bernilai lima belas dinar secara kredit.”\n\nMalik berkata, “Jika seseorang membeli barang daripada seseorang dengan satu dinar tunai atau dengan seekor kambing yang telah dinyatakan harganya secara kredit, maka salah satu daripada dua harga itu wajib ke atasnya. Perbuatan ini adalah makruh dan tidak sepatutnya dilakukan kerana Rasulullah SAW telah melarang dua jualan dalam satu jualan, dan ini termasuk dalam dua jualan dalam satu jualan.”\n\nMalik berkata tentang seseorang yang berkata kepada seseorang yang lain, “Aku akan membeli daripada kamu kurma ajwa sebanyak lima belas sa’ atau kurma Sa’ihani sebanyak sepuluh sa’ atau gandum yang berkualiti rendah sebanyak lima belas sa’ atau gandum Syam sebanyak sepuluh sa’ dengan satu dinar, dan salah satunya wajib ke atasku.” Malik berkata bahawa perbuatan itu adalah makruh dan tidak halal. Ini kerana dia telah mewajibkan ke atasnya sepuluh sa’ kurma Sa’ihani, kemudian dia meninggalkannya dan mengambil lima belas sa’ kurma ajwa, atau dia telah mewajibkan ke atasnya lima belas sa’ gandum yang berkualiti rendah, kemudian dia meninggalkannya dan mengambil sepuluh sa’ gandum Syam. Perbuatan ini juga makruh dan tidak halal. Ia juga menyerupai apa yang dilarang iaitu dua jualan dalam satu jualan. Ia juga termasuk dalam larangan membeli dua jenis makanan yang sama dengan harga satu."
  },
  {
    "id": 35601,
    "hadith_number": 1423,
    "tajuk_hadith": "Larangan Jual Beli Gharar (Transaksi Tidak Tentu)",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Abu Hazim ibn Dinar, dari Said ibn al-Musayyab",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الْغَرَرِ ‏.‏ قَالَ مَالِكٌ وَمِنَ الْغَرَرِ وَالْمُخَاطَرَةِ أَنْ يَعْمِدَ الرَّجُلُ قَدْ ضَلَّتْ دَابَّتُهُ أَوْ أَبَقَ غُلاَمُهُ وَثَمَنُ الشَّىْءِ مِنْ ذَلِكَ خَمْسُونَ دِينَارًا فَيَقُولُ رَجُلٌ أَنَا آخُذُهُ مِنْكَ بِعِشْرِينَ دِينَارًا ‏.‏ فَإِنْ وَجَدَهُ الْمُبْتَاعُ ذَهَبَ مِنَ الْبَائِعِ ثَلاَثُونَ دِينَارًا وَإِنْ لَمْ يَجِدْهُ ذَهَبَ الْبَائِعُ مِنَ الْمُبْتَاعِ بِعِشْرِينَ دِينَارًا ‏.‏ قَالَ مَالِكٌ وَفِي ذَلِكَ عَيْبٌ آخَرُ إِنَّ تِلْكَ الضَّالَّةَ إِنْ وُجِدَتْ لَمْ يُدْرَ أَزَادَتْ أَمْ نَقَصَتْ أَمْ مَا حَدَثَ بِهَا مِنَ الْعُيُوبِ فَهَذَا أَعْظَمُ الْمُخَاطَرَةِ ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ عِنْدَنَا أَنَّ مِنَ الْمُخَاطَرَةِ وَالْغَرَرِ اشْتِرَاءَ مَا فِي بُطُونِ الإِنَاثِ مِنَ النِّسَاءِ وَالدَّوَابِّ لأَنَّهُ لاَ يُدْرَى أَيَخْرُجُ أَمْ لاَ يَخْرُجُ فَإِنْ خَرَجَ لَمْ يُدْرَ أَيَكُونُ حَسَنًا أَمْ قَبِيحًا أَمْ تَامًّا أَمْ نَاقِصًا أَمْ ذَكَرًا أَمْ أُنْثَى وَذَلِكَ كُلُّهُ يَتَفَاضَلُ إِنْ كَانَ عَلَى كَذَا فَقِيمَتُهُ كَذَا وَإِنْ كَانَ عَلَى كَذَا فَقِيمَتُهُ كَذَا ‏.‏ قَالَ مَالِكٌ وَلاَ يَنْبَغِي بَيْعُ الإِنَاثِ وَاسْتِثْنَاءُ مَا فِي بُطُونِهَا وَذَلِكَ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ ثَمَنُ شَاتِي الْغَزِيرَةِ ثَلاَثَةُ دَنَانِيرَ فَهِيَ لَكَ بِدِينَارَيْنِ وَلِي مَا فِي بَطْنِهَا ‏.‏ فَهَذَا مَكْرُوهٌ لأَنَّهُ غَرَرٌ وَمُخَاطَرَةٌ ‏.‏ قَالَ مَالِكٌ وَلاَ يَحِلُّ بَيْعُ الزَّيْتُونِ بِالزَّيْتِ وَلاَ الْجُلْجُلاَنِ بِدُهْنِ الْجُلْجُلاَنِ وَلاَ الزُّبْدِ بِالسَّمْنِ لأَنَّ الْمُزَابَنَةَ تَدْخُلُهُ وَلأَنَّ الَّذِي يَشْتَرِي الْحَبَّ وَمَا أَشْبَهَهُ بِشَىْءٍ مُسَمًّى مِمَّا يَخْرُجُ مِنْهُ لاَ يَدْرِي أَيَخْرُجُ مِنْهُ أَقَلُّ مِنْ ذَلِكَ أَوْ أَكْثَرُ فَهَذَا غَرَرٌ وَمُخَاطَرَةٌ ‏.‏ قَالَ مَالِكٌ وَمِنْ ذَلِكَ أَيْضًا اشْتِرَاءُ حَبِّ الْبَانِ بِالسَّلِيخَةِ فَذَلِكَ غَرَرٌ لأَنَّ الَّذِي يَخْرُجُ مِنْ حَبِّ الْبَانِ هُوَ السَّلِيخَةُ وَلاَ بَأْسَ بِحَبِّ الْبَانِ بِالْبَانِ الْمُطَيَّبِ لأَنَّ الْبَانَ الْمُطَيَّبَ قَدْ طُيِّبَ وَنُشَّ وَتَحَوَّلَ عَنْ حَالِ السَّلِيخَةِ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ بَاعَ سِلْعَةً مِنْ رَجُلٍ عَلَى أَنَّهُ لاَ نُقْصَانَ عَلَى الْمُبْتَاعِ إِنَّ ذَلِكَ بَيْعٌ غَيْرُ جَائِزٍ وَهُوَ مِنَ الْمُخَاطَرَةِ وَتَفْسِيرُ ذَلِكَ أَنَّهُ كَأَنَّهُ اسْتَأْجَرَهُ بِرِبْحٍ إِنْ كَانَ فِي تِلْكَ السِّلْعَةِ وَإِنْ بَاعَ بِرَأْسِ الْمَالِ أَوْ بِنُقْصَانٍ فَلاَ شَىْءَ لَهُ وَذَهَبَ عَنَاؤُهُ بَاطِلاً فَهَذَا لاَ يَصْلُحُ وَلِلْمُبْتَاعِ فِي هَذَا أُجْرَةٌ بِمِقْدَارِ مَا عَالَجَ مِنْ ذَلِكَ وَمَا كَانَ فِي تِلْكَ السِّلْعَةِ مِنْ نُقْصَانٍ أَوْ رِبْحٍ فَهُوَ لِلْبَائِعِ وَعَلَيْهِ وَإِنَّمَا يَكُونُ ذَلِكَ إِذَا فَاتَتِ السِّلْعَةُ وَبِيعَتْ ‏.‏ فَإِنْ لَمْ تَفُتْ فُسِخَ الْبَيْعُ بَيْنَهُمَا ‏.‏ قَالَ مَالِكٌ فَأَمَّا أَنْ يَبِيعَ رَجُلٌ مِنْ رَجُلٍ سِلْعَةً يَبُتُّ بَيْعَهَا ثُمَّ يَنْدَمُ الْمُشْتَرِي فَيَقُولُ لِلْبَائِعِ ضَعْ عَنِّي فَيَأْبَى الْبَائِعُ وَيَقُولُ بِعْ فَلاَ نُقْصَانَ عَلَيْكَ ‏.‏ فَهَذَا لاَ بَأْسَ بِهِ لأَنَّهُ لَيْسَ مِنَ الْمُخَاطَرَةِ وَإِنَّمَا هُوَ شَىْءٌ وَضَعَهُ لَهُ وَلَيْسَ عَلَى ذَلِكَ عَقَدَا بَيْعَهُمَا وَذَلِكَ الَّذِي عَلَيْهِ الأَمْرُ عِنْدَنَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abu Hazim ibn Dinar, daripada Said ibn al-Musayyab bahawa Rasulullah SAW melarang jual beli Gharar (transaksi yang tidak tentu).\n\nMalik berkata, \"Antaranya termasuk dalam Gharar dan Mukhatarah (transaksi yang berisiko) ialah seseorang yang kehilangan binatang ternakannya atau hambanya melarikan diri, dan harga haiwan tersebut ialah lima puluh dinar, kemudian seseorang berkata, 'Saya akan membelinya daripada awak dengan harga dua puluh dinar.' Sekiranya pembeli menjumpainya, maka pembeli akan membayar tiga puluh dinar kepada penjual, dan sekiranya tidak menjumpainya, maka penjual akan mengembalikan dua puluh dinar kepada pembeli.\"\n\nMalik berkata, \"Terdapat satu lagi kelemahan di dalamnya. Sekiranya binatang yang hilang itu dijumpai, tidak diketahui sama ada nilainya telah meningkat atau menurun, atau apa-apa kecacatan yang mungkin telah berlaku padanya. Transaksi ini adalah transaksi yang sangat tidak tentu dan berisiko.\"\n\nMalik berkata, \"Menurut pandangan kami, termasuk dalam Mukhatarah dan Gharar ialah membeli apa yang terdapat dalam kandungan betina, sama ada manusia atau haiwan, kerana tidak diketahui sama ada ia akan keluar atau tidak. Jika ia keluar, tidak diketahui sama ada ia akan menjadi cantik atau hodoh, sempurna atau cacat, jantan atau betina. Semua itu mempunyai nilai yang berbeza. Jika ia seperti ini, maka harganya begini, dan jika ia seperti itu, maka harganya begitu.\"\n\nMalik berkata, \"Tidak sepatutnya menjual betina dan mengecualikan apa yang ada dalam kandungannya. Contohnya, seseorang berkata kepada orang lain, 'Harga kambing betina yang banyak susu ini ialah tiga dinar. Ia menjadi milik awak dengan harga dua dinar, dan anak-anaknya menjadi milik saya.' Ini adalah perkara yang dibenci kerana ia adalah transaksi yang tidak tentu dan berisiko.\"\n\nMalik berkata, \"Tidak halal menjual buah zaitun dengan minyak zaitun, atau biji bijan dengan minyak bijan, atau mentega dengan ghee kerana Muzabana (pertukaran yang tidak diketahui kuantitinya) termasuk di dalamnya. Kerana orang yang membeli biji-bijian dan seumpamanya dengan sesuatu yang disebut daripada apa yang akan dikeluarkan daripadanya, tidak tahu sama ada kuantiti yang akan dikeluarkan itu lebih sedikit atau lebih banyak, jadi ia adalah transaksi yang tidak tentu dan berisiko.\"\n\nMalik berkata, \"Begitu juga dengan membeli biji ben dengan minyak ben. Ini adalah transaksi yang tidak tentu kerana apa yang dihasilkan daripada biji ben ialah minyak ben. Tiada masalah menjual biji ben dengan minyak ben yang wangi kerana minyak ben yang wangi telah diwangi, dicampur, dan telah berubah daripada keadaan minyak ben mentah.\"\n\nMalik, ketika menceritakan tentang seseorang yang menjual barangan kepada seseorang dengan syarat bahawa tidak akan ada kerugian bagi pembeli (iaitu, jika pembeli tidak dapat menjual semula barangan tersebut, barangan itu boleh dikembalikan kepada penjual), berkata, \"Transaksi ini tidak dibenarkan dan ia adalah sebahagian daripada Mukhatarah. Penjelasannya ialah seolah-olah penjual telah mengupah pembeli dengan keuntungan sekiranya barangan itu mendatangkan keuntungan. Sekiranya dia menjual stok itu dengan kerugian, dia tidak mendapat apa-apa, dan usahanya sia-sia. Ini tidak baik. Pembeli dalam transaksi sedemikian harus diberi upah mengikut usaha yang telah dilakukan. Apa jua kerugian atau keuntungan dalam barangan tersebut adalah tanggungjawab penjual. Ini hanya berlaku apabila barangan tersebut telah dijual. Sekiranya barangan tersebut tidak dijual, maka transaksi di antara mereka adalah batal.\"\n\nMalik berkata, \"Adapun seseorang yang membeli barangan daripada seseorang dan mereka telah selesai urus niaga, kemudian pembeli menyesal dan meminta harga diturunkan, dan penjual enggan dan berkata, 'Juallah ia, dan saya akan mengganti kerugian awak.' Tiada masalah dengan ini kerana ia bukan transaksi yang berisiko. Ia adalah sesuatu yang dicadangkan olehnya, dan transaksi mereka tidak berasaskan perkara itu. Itulah yang diamalkan di kalangan kami.\""
  },
  {
    "id": 35602,
    "hadith_number": 1424,
    "tajuk_hadith": "Larangan Mulamasa dan Munabadhah",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Muhammad bin Yahya bin Habban, dan dari Abu Az-Zinad, dari Al-Araj, dari Abu Hurairah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، وَعَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُلاَمَسَةِ وَالْمُنَابَذَةِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Muhammad bin Yahya bin Habban, dan daripada Abu Az-Zinad, daripada Al-Araj, daripada Abu Hurairah, bahawa Rasulullah SAW melarang mulamasa dan munabadhah.\n\nMalik berkata, \"Mulamasa ialah apabila seseorang itu boleh merasai kain tetapi tidak dibenarkan membukanya atau memeriksa apa yang ada di dalamnya, atau dia membeli pada waktu malam dan tidak tahu apa yang ada di dalamnya. Munabadhah ialah apabila seseorang itu membaling kainnya kepada orang lain, dan orang lain itu membaling kainnya tanpa pemeriksaan daripada kedua-duanya. Masing-masing berkata, 'ini untuk ini.' Inilah yang dilarang daripada mulamasa dan munabadhah.\"\n\nMalik berkata bahawa penjualan guni dengan senarai kandungannya adalah berbeza daripada penjualan jubah yang disembunyikan dalam beg atau kain yang dilipat dan sebagainya. Perbezaannya ialah ia adalah amalan biasa dan ia adalah perkara yang biasa dilakukan oleh orang ramai, dan apa yang telah dilakukan oleh orang ramai pada masa lalu, dan ia masih lagi di antara urus niaga dan perdagangan yang dibenarkan oleh orang ramai di mana mereka tidak melihat sebarang kemudaratan kerana dalam penjualan guni dengan senarai kandungan tanpa membukanya, urus niaga yang tidak menentu tidak dimaksudkan dan ia tidak menyerupai mulamasa."
  },
  {
    "id": 35603,
    "hadith_number": 1425,
    "tajuk_hadith": "Murabahah dalam Perniagaan",
    "perawi_melayu": "Yahya meriwayatkan dari Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa, “Amalan yang disepakati di kalangan kami tentang seseorang yang membeli kain di sebuah bandar, kemudian membawanya ke bandar lain untuk dijual secara murabahah, ialah dia tidak dikira mendapat upah sebagai ejen, atau apa-apa elaun untuk menyeterika, melipat, meluruskan, perbelanjaan, atau sewa rumah.  Bagi kos pengangkutan kain tersebut, ia termasuk dalam harga asas, dan tiada bahagian keuntungan diperuntukkan kepadanya melainkan ejen memberitahu semua itu kepada pelabur. Jika mereka bersetuju untuk berkongsi keuntungan selepas mengetahui perkara tersebut, tiada apa yang salah dengan itu.”\n\nMalik berkata, “Bagi pencucian, menjahit, mewarna, dan perkara-perkara seumpama itu, ia dirawat dengan cara yang sama seperti kain. Keuntungan dikira di dalamnya sepertimana ia dikira dalam barangan kain. Jadi, jika dia menjual barangan kain tanpa menjelaskan perkara-perkara yang kami sebutkan sebagai tidak mendapat keuntungan, dan jika kain itu telah pun dijual, pengangkutan perlu dikira, tetapi tiada keuntungan diberikan. Jika barangan kain belum dijual, transaksi di antara mereka adalah tidak sah melainkan mereka membuat persetujuan bersama yang baharu tentang apa yang dibenarkan di antara mereka.”\n\nMalik menyebut tentang seorang ejen yang membeli barang untuk emas atau perak, dan kadar pertukaran pada hari pembelian ialah sepuluh dirham kepada satu dinar. Dia membawanya ke sebuah bandar untuk dijual secara murabahah, atau menjualnya di tempat dia membelinya mengikut kadar pertukaran pada hari dia menjualnya. Jika dia membelinya dengan dirham dan menjualnya dengan dinar, atau dia membelinya dengan dinar dan menjualnya dengan dirham, dan barangan itu belum dijual, dia mempunyai pilihan. Jika dia mahu, dia bersetuju untuk menjual barangan tersebut dan jika dia mahu, dia meninggalkannya. Jika barangan itu telah dijual, dia mendapat harga yang dibeli oleh penjual, dan penjual dikira mendapat keuntungan daripada apa yang dibeli, melebihi apa yang pelabur peroleh sebagai keuntungan.\n\nMalik berkata, “Jika seseorang menjual barang bernilai seratus dinar dengan seratus sepuluh, dan dia mendengar kemudiannya bahawa ia bernilai sembilan puluh dinar, dan barangan itu telah dijual, penjual mempunyai pilihan. Jika dia suka, dia mendapat harga barangan pada hari ia diambil darinya melainkan harga itu lebih daripada harga yang dia diwajibkan untuk menjualnya pada mulanya, dan dia tidak mendapat lebih daripada itu - dan ia adalah seratus sepuluh dinar. Jika dia suka, ia dikira sebagai keuntungan terhadap sembilan puluh melainkan harga yang dicapai barangannya kurang daripada nilainya. Dia diberi pilihan antara apa yang diperolehi barangannya dan modal tambah keuntungan, iaitu sembilan puluh sembilan dinar.”\n\nMalik berkata, “Jika seseorang menjual barang secara murabahah dan dia berkata, ‘Ia dinilai seratus dinar bagi saya.’ Kemudian dia mendengar kemudiannya bahawa ia bernilai seratus dua puluh dinar, pelanggan diberi pilihan. Jika dia mahu, dia memberi penjual nilai barang pada hari dia mengambilnya, dan jika dia mahu, dia memberi harga yang dibelinya mengikut kiraan keuntungan yang diberikannya, setakat mana ia pergi, melainkan ia kurang daripada harga yang dibelinya, kerana dia tidak seharusnya memberi pemilik barang kerugian daripada harga yang dibelinya kerana dia berpuas hati dengan itu. Pemilik barang datang untuk meminta tambahan, jadi pembeli tidak mempunyai hujah terhadap penjual untuk membuat pengurangan daripada harga pertama yang dibelinya mengikut senarai kandungan.”"
  },
  {
    "id": 35604,
    "hadith_number": 1426,
    "tajuk_hadith": "Jual Beli Berdasarkan Penerangan Barangan",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Malik menceritakan tentang amalan yang dilakukan oleh sekumpulan orang yang membeli barangan, sama ada kain atau hamba.  Seseorang mendengar tentangnya dan berkata kepada salah seorang daripada kumpulan itu, \"Aku telah mendengar perihal kain yang kamu beli daripada si polan.  Bolehkah aku memberi keuntungan tertentu untuk mengambil bahagianmu?\"  Orang itu bersetuju, dan lelaki itu memberikan keuntungan dan menjadi rakan kongsi menggantikannya.  Apabila dia melihat pembelian itu, dia mendapati ia buruk dan terlalu mahal.\n\nMalik berkata, \"Dia wajib menerimanya dan tiada pilihan baginya jika dia membelinya berdasarkan senarai kandungan dan penerangannya diketahui umum.\"\n\nMalik menceritakan tentang seorang lelaki yang menerima kain, dan penjual datang kepadanya. Lelaki itu membacakan senarai kandungannya kepada mereka dan berkata, \"Dalam setiap guni terdapat kain sebegini daripada Basrah dan kain ringan sebegini daripada Sabir. Saiznya sebegini,\" dan dia memberitahu mereka jenis-jenis kain mengikut jenisnya, dan berkata, \"Belilah daripada saya mengikut penerangan ini.\" Mereka membeli guni-guni itu mengikut penerangan yang diberikan, kemudian mereka membelinya dan mendapati ia terlalu mahal dan menyesalinya. Malik berkata, \"Jual beli itu mengikat mereka, jika barangan itu sepadan dengan senarai kandungan yang dijualnya.\"\n\nMalik berkata, \"Inilah cara urus niaga yang masih digunakan oleh orang ramai sehingga hari ini. Mereka membenarkan jual beli di antara mereka apabila barangan itu sepadan dengan senarai kandungan dan tidak berbeza daripadanya.\""
  },
  {
    "id": 35605,
    "hadith_number": 1427,
    "tajuk_hadith": "Hak Menarik Diri dalam Transaksi Niaga",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Nafi', daripada Abdullah bin Umar",
    "english_text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"Both parties in a business transaction have the right of\nwithdrawal as long as they have not separated, except in the\ntransaction called khiyar.\"\n\n\nMalik said, \"There is no\nspecified limit nor any matter which is applied in this case according\nto us.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْمُتَبَايِعَانِ كُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ عَلَى صَاحِبِهِ مَا لَمْ يَتَفَرَّقَا إِلاَّ بَيْعَ الْخِيَارِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Nafi', daripada Abdullah bin Umar bahawa Rasulullah SAW bersabda, \"Kedua-dua pihak dalam transaksi perniagaan mempunyai hak untuk menarik diri selagi mereka belum berpisah, kecuali dalam transaksi yang dinamakan khiyar.\" \n\nMalik berkata, \"Tiada had masa yang ditetapkan atau sebarang perkara yang diguna pakai dalam kes ini menurut kami.\""
  },
  {
    "id": 35606,
    "hadith_number": 1428,
    "tajuk_hadith": "Perjanjian Jual Beli dan Penyelesaian Pertikaian",
    "perawi_melayu": "Malik",
    "english_text": "Malik related to me that he had heard that Abdullah ibn Masud\nused to relate that the Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"When two parties dispute about a business\ntransaction, the seller's word is taken, or they make an agreement\namong themselves.\n\n\nMalik spoke about someone who sold goods to\na man, and said at the contracting of the sale, 'I will sell to you\nprovided I consult so-and-so. If he is satisfied, the sale is\npermitted. If he dislikes it, there is no sale between us.' They made\nthe transaction on that basis. Then the buyer regretted before the\nseller consulted the person.\n\n\nMalik said, \"That sale is\nbinding on them according to what they described. The buyer has no\nright of withdrawal, and it is binding on him, if the person whom the\nseller stipulated to him, permits it.\"\n\n\nMalik said, \"The way\nof doing things among us about a man who buys goods from another and\nthey differ about the price, and the seller says, 'I sold them to you\nfor ten dinars,' and the buyer says, 'I bought them from you for five\ndinars,' is that it is said to the seller, 'If you like, give them to\nthe buyer for what he said. If you like, swear by Allah that you only\nsold your goods for what you said.' If he swears it is said to the\nbuyer, 'Either you take the goods for what the seller said, or you\nswears by Allah that you bought them only for what you said.' If he\nswears, he is free to return the goods. That is when each of them\ntestifies against the other.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، كَانَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَيُّمَا بَيِّعَيْنِ تَبَايَعَا فَالْقَوْلُ مَا قَالَ الْبَائِعُ أَوْ يَتَرَادَّانِ ‏\"‏ ‏.‏",
    "malay_translation": "Malik telah meriwayatkan kepadaku bahawa baginda telah mendengar bahawa Abdullah bin Mas'ud telah meriwayatkan bahawa Rasulullah SAW bersabda: \"Apabila dua orang berjual beli, maka kata-kata penjual itu yang dipegang, atau mereka berunding sesama sendiri.\" \n\nMalik menceritakan tentang seseorang yang menjual barang kepada seorang lelaki, dan berkata ketika akad jual beli itu, 'Aku akan menjual kepadamu dengan syarat aku berunding dengan si fulan. Jika dia bersetuju, jual beli ini dibenarkan. Jika dia tidak bersetuju, maka tidak sah jual beli di antara kita.' Mereka membuat transaksi berdasarkan syarat itu. Kemudian pembeli menyesal sebelum penjual berunding dengan orang tersebut.\n\nMalik berkata, \"Jual beli itu mengikat mereka mengikut apa yang telah mereka sebutkan. Pembeli tidak berhak membatalkan, dan ia mengikatnya jika orang yang penjual tentukan itu membenarkannya.\"\n\nMalik berkata, \"Cara yang diamalkan di kalangan kita tentang seseorang yang membeli barang daripada orang lain dan mereka berselisih tentang harga, dan penjual berkata, 'Aku menjualnya kepadamu dengan harga sepuluh dinar,' dan pembeli berkata, 'Aku membelinya darimu dengan harga lima dinar,' maka dikatakan kepada penjual, 'Jika engkau suka, berikanlah kepada pembeli dengan harga yang dikatakannya. Jika engkau suka, bersumpahlah dengan Allah bahawa engkau hanya menjual baranganmu dengan harga yang engkau sebutkan.' Jika dia bersumpah, maka dikatakan kepada pembeli, 'Sama ada engkau ambil barang itu dengan harga yang penjual sebutkan, atau engkau bersumpah dengan Allah bahawa engkau hanya membelinya dengan harga yang engkau sebutkan.' Jika dia bersumpah, dia bebas untuk memulangkan barang itu. Itulah apabila masing-masing memberi keterangan terhadap yang lain.\""
  },
  {
    "id": 35607,
    "hadith_number": 1429,
    "tajuk_hadith": "Larangan Mengurangkan Harga Setelah Memberi Kredit",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Abu az-Zinad, dari Busr ibn Said, dari Ubayd Abu Salih, mawla as-Saffah",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ عُبَيْدٍ أَبِي صَالِحٍ، مَوْلَى السَّفَّاحِ أَنَّهُ قَالَ بِعْتُ بَزًّا لِي مِنْ أَهْلِ دَارِ نَخْلَةَ إِلَى أَجَلٍ ثُمَّ أَرَدْتُ الْخُرُوجَ إِلَى الْكُوفَةِ فَعَرَضُوا عَلَىَّ أَنْ أَضَعَ عَنْهُمْ بَعْضَ الثَّمَنِ وَيَنْقُدُونِي فَسَأَلْتُ عَنْ ذَلِكَ زَيْدَ بْنَ ثَابِتٍ فَقَالَ لاَ آمُرُكَ أَنْ تَأْكُلَ هَذَا وَلاَ تُوكِلَهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abu az-Zinad, daripada Busr bin Said, daripada Ubayd Abu Salih, mawla as-Saffah bahawa beliau berkata: \"Aku telah menjual kain kepada penduduk Dar Nakhl secara kredit. Kemudian aku berhasrat untuk pergi ke Kufah, lalu mereka menawarkan untuk mengurangkan harga dan membayar tunai. Maka aku bertanya kepada Zaid bin Thabit tentang perkara itu, lalu beliau berkata: 'Aku tidak mengizinkan kamu untuk menerima pengurangan harga atau memberikannya kepada sesiapa pun.'\""
  },
  {
    "id": 35608,
    "hadith_number": 1430,
    "tajuk_hadith": "Pendapat Abdullah ibn Umar tentang Pengurangan Hutang",
    "perawi_melayu": "Yahya meriwayatkan dari Malik dari Uthman ibn Hafs ibn Khalda dari Ibn Shihab dari Salim ibn Abdullah dari Abdullah ibn Umar",
    "english_text": "Yahya related to me from Malik from Uthman ibn Hafs ibn Khalda\nfrom Ibn Shihab from Salim ibn Abdullah that Abdullah ibn Umar was\nasked about a man who took a loan from another man for a set term. The\ncreditor reduced the debt, and the man paid it immediately Abdullah\nibn Umar disliked that, and forbade it.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عُثْمَانَ بْنِ حَفْصِ بْنِ خَلْدَةَ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ سُئِلَ عَنِ الرَّجُلِ، يَكُونُ لَهُ الدَّيْنُ عَلَى الرَّجُلِ إِلَى أَجَلٍ فَيَضَعُ عَنْهُ صَاحِبُ الْحَقِّ وَيُعَجِّلُهُ الآخَرُ فَكَرِهَ ذَلِكَ عَبْدُ اللَّهِ بْنُ عُمَرَ وَنَهَى عَنْهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Uthman ibn Hafs ibn Khalda, daripada Ibn Shihab, daripada Salim ibn Abdullah, daripada Abdullah ibn Umar bahawa beliau ditanya tentang seorang lelaki yang berhutang kepada orang lain sehingga tempoh tertentu.  Pihak pemiutang mengurangkan hutang itu, dan orang yang berhutang membayarnya dengan segera. Abdullah ibn Umar tidak menyukai perkara itu, dan melarangnya."
  },
  {
    "id": 35609,
    "hadith_number": 1431,
    "tajuk_hadith": "Riba dalam Jahiliyyah dan Bentuk-bentuknya yang Dimakruhkan",
    "perawi_melayu": "Malik melalui Zayd ibn Aslam",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّهُ قَالَ كَانَ الرِّبَا فِي الْجَاهِلِيَّةِ أَنْ يَكُونَ لِلرَّجُلِ عَلَى الرَّجُلِ الْحَقُّ إِلَى أَجَلٍ فَإِذَا حَلَّ الأَجَلُ قَالَ أَتَقْضِي أَمْ تُرْبِي فَإِنْ قَضَى أَخَذَ وَإِلاَّ زَادَهُ فِي حَقِّهِ وَأَخَّرَ عَنْهُ فِي الأَجَلِ ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ الْمَكْرُوهُ الَّذِي لاَ اخْتِلاَفَ فِيهِ عِنْدَنَا أَنْ يَكُونَ لِلرَّجُلِ عَلَى الرَّجُلِ الدَّيْنُ إِلَى أَجَلٍ فَيَضَعُ عَنْهُ الطَّالِبُ وَيُعَجِّلُهُ الْمَطْلُوبُ وَذَلِكَ عِنْدَنَا بِمَنْزِلَةِ الَّذِي يُؤَخِّرُ دَيْنَهُ بَعْدَ مَحِلِّهِ عَنْ غَرِيمِهِ وَيَزِيدُهُ الْغَرِيمُ فِي حَقِّهِ قَالَ فَهَذَا الرِّبَا بِعَيْنِهِ لاَ شَكَّ فِيهِ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يَكُونُ لَهُ عَلَى الرَّجُلِ مِائَةُ دِينَارٍ إِلَى أَجَلٍ فَإِذَا حَلَّتْ قَالَ لَهُ الَّذِي عَلَيْهِ الدَّيْنُ بِعْنِي سِلْعَةً يَكُونُ ثَمَنُهَا مِائَةَ دِينَارٍ نَقْدًا بِمِائَةٍ وَخَمْسِينَ إِلَى أَجَلٍ هَذَا بَيْعٌ لاَ يَصْلُحُ وَلَمْ يَزَلْ أَهْلُ الْعِلْمِ يَنْهَوْنَ عَنْهُ ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا كُرِهَ ذَلِكَ لأَنَّهُ إِنَّمَا يُعْطِيهِ ثَمَنَ مَا بَاعَهُ بِعَيْنِهِ وَيُؤَخِّرُ عَنْهُ الْمِائَةَ الأُولَى إِلَى الأَجَلِ الَّذِي ذَكَرَ لَهُ آخِرَ مَرَّةٍ وَيَزْدَادُ عَلَيْهِ خَمْسِينَ دِينَارًا فِي تَأْخِيرِهِ عَنْهُ فَهَذَا مَكْرُوهٌ وَلاَ يَصْلُحُ وَهُوَ أَيْضًا يُشْبِهُ حَدِيثَ زَيْدِ بْنِ أَسْلَمَ فِي بَيْعِ أَهْلِ الْجَاهِلِيَّةِ إِنَّهُمْ كَانُوا إِذَا حَلَّتْ دُيُونُهُمْ قَالُوا لِلَّذِي عَلَيْهِ الدَّيْنُ إِمَّا أَنْ تَقْضِيَ وَإِمَّا أَنْ تُرْبِيَ ‏.‏ فَإِنْ قَضَى أَخَذُوا وَإِلاَّ زَادُوهُمْ فِي حُقُوقِهِمْ وَزَادُوهُمْ فِي الأَجَلِ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Zayd bin Aslam yang berkata, \"Riba pada zaman Jahiliyyah ialah seseorang memberi pinjaman kepada orang lain untuk tempoh tertentu. Apabila tempoh itu tamat, dia akan bertanya, 'Adakah engkau akan membayarnya atau akan menambahnya?' Jika orang itu membayar, maka dia menerimanya. Jika tidak, maka dia akan menambahkan hutang orang itu dan melanjutkan tempohnya.\" \n\nMalik berkata, \"Perkara yang dimakruhkan dan tiada perselisihan di kalangan kita ialah seseorang berhutang kepada seseorang lain sehingga tempoh tertentu, kemudian si peminjam mengurangkan hutang itu dan si berhutang membayarnya lebih awal.  Bagi kita, ia sama seperti orang yang menangguh hutangnya selepas tempohnya berakhir kepada pemiutangnya dan pemiutang menambahkan hutangnya.\" Malik berkata, \"Ini adalah riba yang terang lagi nyata, tiada keraguan padanya.\" \n\nMalik menyebut tentang seseorang yang meminjamkan seratus dinar kepada seseorang lain untuk dua tempoh. Apabila tempohnya tamat, orang yang berhutang itu berkata kepadanya, \"Jualkanlah kepadaku barang dagangan yang bernilai seratus dinar tunai dengan harga seratus lima puluh dinar secara kredit.\" Malik berkata, \"Ini adalah jual beli yang tidak sah, dan para ulama sentiasa melarangnya.\" \n\nMalik berkata, \"Ini dimakruhkan kerana pemiutang memberikan kepada si berhutang harga barang yang dibelinya secara tunai, dan dia menangguhkan bayaran seratus dinar yang pertama kepada si berhutang untuk tempoh yang dinyatakan dalam transaksi kedua, dan si berhutang menambah lima puluh dinar kepadanya sebagai bayaran menangguhan. Ini adalah dimakruhkan dan tidak sah. Ia juga serupa dengan riwayat Zayd bin Aslam tentang transaksi orang-orang Jahiliyyah. Apabila hutang mereka tamat tempoh, mereka akan berkata kepada orang yang berhutang, 'Sama ada engkau membayar sepenuhnya atau engkau menambahnya.' Jika mereka membayar, mereka menerimanya, dan jika tidak, mereka akan menambah hutang mereka dan melanjutkan tempohnya."
  },
  {
    "id": 35610,
    "hadith_number": 1432,
    "tajuk_hadith": "Keadaan Mengundur Bayaran Orang Kaya",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Abu az-Zinad, daripada al-Araj, daripada Abu Hurairah",
    "english_text": "Yahya related to me from Malik from Abu'z-Zinad from al Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Delay in payment by a rich man is injustice, but\nwhen one of you is referred for payment to a wealthy man, let him be\nreferred.\"",
    "arabic_text": "حَدَّثَنَا يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَطْلُ الْغَنِيِّ ظُلْمٌ وَإِذَا أُتْبِعَ أَحَدُكُمْ عَلَى مَلِيءٍ فَلْيَتْبَعْ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abu az-Zinad, daripada al-Araj, daripada Abu Hurairah bahawa Rasulullah SAW bersabda:  \"Mengundur bayaran oleh orang kaya adalah satu kezaliman.  Tetapi jika seseorang daripada kamu menuntut bayaran daripada orang kaya, maka tuntutlah.\""
  },
  {
    "id": 35611,
    "hadith_number": 1433,
    "tajuk_hadith": "Larangan Menjual Hutang dan Beberapa Transaksi Lain",
    "perawi_melayu": "Malik melalui Musa ibn Maysara",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ مُوسَى بْنِ مَيْسَرَةَ، أَنَّهُ سَمِعَ رَجُلاً، يَسْأَلُ سَعِيدَ بْنَ الْمُسَيَّبِ فَقَالَ إِنِّي رَجُلٌ أَبِيعُ بِالدَّيْنِ ‏.‏ فَقَالَ سَعِيدٌ لاَ تَبِعْ إِلاَّ مَا آوَيْتَ إِلَى رَحْلِكَ ‏.‏ قَالَ مَالِكٌ فِي الَّذِي يَشْتَرِي السِّلْعَةَ مِنَ الرَّجُلِ عَلَى أَنْ يُوَفِّيَهُ تِلْكَ السِّلْعَةَ إِلَى أَجَلٍ مُسَمًّى إِمَّا لِسُوقٍ يَرْجُو نَفَاقَهَا فِيهِ وَإِمَّا لِحَاجَةٍ فِي ذَلِكَ الزَّمَانِ الَّذِي اشْتَرَطَ عَلَيْهِ ثُمَّ يُخْلِفُهُ الْبَائِعُ عَنْ ذَلِكَ الأَجَلِ فَيُرِيدُ الْمُشْتَرِي رَدَّ تِلْكَ السِّلْعَةِ عَلَى الْبَائِعِ إِنَّ ذَلِكَ لَيْسَ لِلْمُشْتَرِي وَإِنَّ الْبَيْعَ لاَزِمٌ لَهُ وَإِنَّ الْبَائِعَ لَوْ جَاءَ بِتِلْكَ السِّلْعَةِ قَبْلَ مَحِلِّ الأَجَلِ لَمْ يُكْرَهِ الْمُشْتَرِي عَلَى أَخْذِهَا ‏.‏ قَالَ مَالِكٌ فِي الَّذِي يَشْتَرِي الطَّعَامَ فَيَكْتَالُهُ ثُمَّ يَأْتِيهِ مَنْ يَشْتَرِيهِ مِنْهُ فَيُخْبِرُ الَّذِي يَأْتِيهِ أَنَّهُ قَدِ اكْتَالَهُ لِنَفْسِهِ وَاسْتَوْفَاهُ فَيُرِيدُ الْمُبْتَاعُ أَنْ يُصَدِّقَهُ وَيَأْخُذَهُ بِكَيْلِهِ إِنَّ مَا بِيعَ عَلَى هَذِهِ الصِّفَةِ بِنَقْدٍ فَلاَ بَأْسَ بِهِ وَمَا بِيعَ عَلَى هَذِهِ الصِّفَةِ إِلَى أَجَلٍ فَإِنَّهُ مَكْرُوهٌ حَتَّى يَكْتَالَهُ الْمُشْتَرِي الآخَرُ لِنَفْسِهِ وَإِنَّمَا كُرِهَ الَّذِي إِلَى أَجَلٍ لأَنَّهُ ذَرِيعَةٌ إِلَى الرِّبَا وَتَخَوُّفٌ أَنْ يُدَارَ ذَلِكَ عَلَى هَذَا الْوَجْهِ بِغَيْرِ كَيْلٍ وَلاَ وَزْنٍ فَإِنْ كَانَ إِلَى أَجَلٍ فَهُوَ مَكْرُوهٌ وَلاَ اخْتِلاَفَ فِيهِ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ لاَ يَنْبَغِي أَنْ يُشْتَرَى دَيْنٌ عَلَى رَجُلٍ غَائِبٍ وَلاَ حَاضِرٍ إِلاَّ بِإِقْرَارٍ مِنَ الَّذِي عَلَيْهِ الدَّيْنُ وَلاَ عَلَى مَيِّتٍ وَإِنْ عَلِمَ الَّذِي تَرَكَ الْمَيِّتُ وَذَلِكَ أَنَّ اشْتِرَاءَ ذَلِكَ غَرَرٌ لاَ يُدْرَى أَيَتِمُّ أَمْ لاَ يَتِمُّ ‏.‏ قَالَ وَتَفْسِيرُ مَا كُرِهَ مِنْ ذَلِكَ أَنَّهُ إِذَا اشْتَرَى دَيْنًا عَلَى غَائِبٍ أَوْ مَيِّتٍ أَنَّهُ لاَ يُدْرَى مَا يَلْحَقُ الْمَيِّتَ مِنَ الدَّيْنِ الَّذِي لَمْ يُعْلَمْ بِهِ فَإِنْ لَحِقَ الْمَيِّتَ دَيْنٌ ذَهَبَ الثَّمَنُ الَّذِي أَعْطَى الْمُبْتَاعُ بَاطِلاً ‏.‏ قَالَ مَالِكٌ وَفِي ذَلِكَ أَيْضًا عَيْبٌ آخَرُ أَنَّهُ اشْتَرَى شَيْئًا لَيْسَ بِمَضْمُونٍ لَهُ وَإِنْ لَمْ يَتِمَّ ذَهَبَ ثَمَنُهُ بَاطِلاً فَهَذَا غَرَرٌ لاَ يَصْلُحُ ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا فُرِقَ بَيْنَ أَنْ لاَ يَبِيعَ الرَّجُلُ إِلاَّ مَا عِنْدَهُ وَأَنْ يُسَلِّفَ الرَّجُلُ فِي شَىْءٍ لَيْسَ عِنْدَهُ أَصْلُهُ أَنَّ صَاحِبَ الْعِينَةِ إِنَّمَا يَحْمِلُ ذَهَبَهُ الَّتِي يُرِيدُ أَنْ يَبْتَاعَ بِهَا فَيَقُولُ هَذِهِ عَشَرَةُ دَنَانِيرَ فَمَا تُرِيدُ أَنْ أَشْتَرِيَ لَكَ بِهَا فَكَأَنَّهُ يَبِيعُ عَشَرَةَ دَنَانِيرَ نَقْدًا بِخَمْسَةَ عَشَرَ دِينَارًا إِلَى أَجَلٍ فَلِهَذَا كُرِهَ هَذَا وَإِنَّمَا تِلْكَ الدُّخْلَةُ وَالدُّلْسَةُ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Musa bin Maisarah bahawa beliau mendengar seorang lelaki bertanya kepada Said bin al-Musayyab, \"Saya seorang lelaki yang menjual dengan hutang.\" Said berkata, \"Janganlah kamu menjual kecuali apa yang telah sampai ke tungganganmu.\" \n\nMalik berkata tentang seseorang yang membeli barang daripada seseorang dengan syarat bahawa penjual itu akan memberikan barang tersebut kepadanya pada tarikh yang telah ditetapkan, sama ada untuk pasaran yang diharap dapat dijual, atau untuk memenuhi keperluan pada masa yang telah ditetapkan. Kemudian penjual itu melanggar janji mengenai tarikh tersebut, dan pembeli ingin mengembalikan barang-barang tersebut kepada penjual. Malik berkata, \"Pembeli tidak boleh berbuat demikian, dan jual beli itu tetap mengikatnya. Sekiranya penjual membawa barang-barang tersebut sebelum tamatnya tempoh, pembeli tidak boleh dipaksa menerimanya.\"\n\nMalik berkata tentang seseorang yang membeli makanan dan mengukurnya. Kemudian datanglah seseorang kepadanya untuk membelinya dan dia memberitahu orang itu bahawa dia telah mengukurnya sendiri dan mengambilnya sepenuhnya. Pembeli yang baru ingin mempercayainya dan menerima ukurannya. Malik berkata, \"Apa sahaja yang dijual dengan cara ini secara tunai, tidak mengapa. Tetapi apa sahaja yang dijual dengan cara ini secara kredit, adalah makruh sehingga pembeli yang baru mengukurnya sendiri. Jual beli secara kredit adalah makruh kerana ia menjadi jalan kepada riba dan dikhuatiri ia akan dilakukan dengan cara ini tanpa ukuran dan timbangan. Jika ia secara kredit, maka ia adalah makruh dan tiada perselisihan di kalangan kami mengenainya.\"\n\nMalik berkata, \"Tidak sepatutnya dibeli hutang seseorang yang hadir mahupun yang ghaib kecuali dengan pengakuan daripada orang yang berhutang, dan tidak juga hutang orang yang telah meninggal dunia walaupun diketahui harta pusaka si mati. Ini kerana membeli hutang adalah satu bentuk gharar (transaksi yang penuh risiko) yang tidak diketahui sama ada akan selesai atau tidak.\"\n\nBeliau berkata, \"Penjelasan bagi apa yang makruh daripada membeli hutang orang yang ghaib atau yang telah meninggal dunia adalah kerana tidak diketahui hutang lain yang mungkin ditanggung oleh si mati. Sekiranya si mati mempunyai hutang lain, maka harga yang dibayar pembeli akan menjadi sia-sia.\"\n\nMalik berkata, \"Terdapat juga satu lagi kelemahan dalam perkara ini.  Dia membeli sesuatu yang tidak dijamin untuknya, dan sekiranya urus niaga tidak selesai, wang yang dibayarnya akan menjadi sia-sia. Ini adalah satu bentuk gharar (transaksi yang penuh risiko) dan ia tidak baik.\"\n\nMalik berkata, \"Perbezaan di antara seseorang yang hanya menjual apa yang dimilikinya dan seseorang yang menerima bayaran pendahuluan untuk sesuatu yang belum dimilikinya adalah seperti berikut:  Orang yang membayar pendahuluan membawa emasnya yang ingin dibelinya. Penjual berkata, 'Ini sepuluh dinar. Apakah yang kamu ingin saya belikan untukmu?'  Ia seolah-olah dia menjual sepuluh dinar tunai dengan lima belas dinar secara kredit. Oleh sebab itu, ia adalah makruh. Ia adalah perkara yang membawa kepada riba dan penipuan.\""
  },
  {
    "id": 35612,
    "hadith_number": 1434,
    "tajuk_hadith": "Perkongsian dan Transaksi Niaga Menurut Imam Malik",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Malik berkata bahawa tidak mengapa sekiranya seseorang yang menjual beberapa kain dan mengecualikan beberapa pakaian dengan tanda-tandanya, mensyaratkan bahawa dia memilih yang bertanda daripada itu. Jika dia tidak mensyaratkan bahawa dia akan memilih daripada itu apabila dia membuat pengecualian, saya fikir dia adalah rakan kongsi dalam jumlah barang kain yang dibeli darinya. Ini kerana dua pakaian boleh serupa dalam tanda dan sangat berbeza harganya.\n\nMalik berkata, \"Cara melakukan sesuatu di kalangan kami ialah tidak mengapa dalam perkongsian, memindahkan tanggungjawab kepada ejen, dan pembatalan apabila berurusan dengan makanan dan perkara lain, sama ada atau tidak pemilikan telah diambil, apabila transaksi itu dengan wang tunai, dan tiada keuntungan, kerugian, atau penangguhan harga di dalamnya. Jika keuntungan atau kerugian atau penangguhan harga daripada salah satu daripada dua itu memasuki mana-mana transaksi ini, ia menjadi jual beli yang dihalalkan oleh apa yang menghalalkan jual beli, dan diharamkan oleh apa yang mengharamkan jual beli, dan ia bukanlah perkongsian, memindahkan tanggungjawab kepada ejen, atau pembatalan.\"\n\nMalik bercakap tentang seseorang yang membeli barang kain atau hamba, dan jual beli itu telah selesai, kemudian seorang lelaki memintanya untuk menjadi rakan kongsinya dan dia bersetuju dan rakan kongsi baru itu membayar harga keseluruhan kepada penjual dan kemudian sesuatu berlaku kepada barang-barang itu yang mengeluarkannya daripada pemilikan mereka. Malik berkata, \"Rakan kongsi baru mengambil harga daripada rakan kongsi asal dan rakan kongsi asal menuntut daripada penjual harga keseluruhan melainkan rakan kongsi asal mensyaratkan ke atas rakan kongsi baru semasa jual beli dan sebelum transaksi dengan penjual selesai bahawa penjual bertanggungjawab kepadanya. Jika transaksi telah berakhir dan penjual telah pergi, prasyarat rakan kongsi asal adalah batal, dan dia mempunyai tanggungjawab.\"\n\nMalik bercakap tentang seorang lelaki yang meminta lelaki lain untuk membeli barangan tertentu untuk dikongsi di antara mereka, dan dia mahu lelaki lain membayar untuknya dan dia akan menjual barangan itu untuk lelaki lain. Malik berkata, \"Itu tidak baik. Apabila dia berkata, 'Bayar untuk saya dan saya akan menjualnya untuk anda,' ia menjadi pinjaman yang dia berikan kepadanya supaya dia menjualnya untuknya dan jika barangan itu rosak, atau hilang, lelaki yang membayar harga akan menuntut daripada rakan kongsinya apa yang dia masukkan untuknya. Ini adalah sebahagian daripada pendahuluan yang mendatangkan keuntungan.\"\n\nMalik berkata, \"Jika seseorang membeli barangan, dan ia diselesaikan untuknya, dan kemudian seseorang berkata kepadanya, 'Kongsi separuh daripada barangan ini dengan saya, dan saya akan menjual semuanya untuk anda,' itu halal, tidak mengapa. Penjelasannya ialah ini adalah jual beli baru dan dia menjual kepadanya separuh daripada barangan itu dengan syarat dia menjual keseluruhannya.\""
  },
  {
    "id": 35613,
    "hadith_number": 1435,
    "tajuk_hadith": "Hak Penjual Terhadap Harta Pembeli yang Muflis",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Ibnu Syihab, dari Abu Bakar bin Abdur Rahman bin Al-Harits bin Hisyam",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَيُّمَا رَجُلٍ بَاعَ مَتَاعًا فَأَفْلَسَ الَّذِي ابْتَاعَهُ مِنْهُ وَلَمْ يَقْبِضِ الَّذِي بَاعَهُ مِنْ ثَمَنِهِ شَيْئًا فَوَجَدَهُ بِعَيْنِهِ فَهُوَ أَحَقُّ بِهِ وَإِنْ مَاتَ الَّذِي ابْتَاعَهُ فَصَاحِبُ الْمَتَاعِ فِيهِ أُسْوَةُ الْغُرَمَاءِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibnu Syihab, daripada Abu Bakar bin Abdur Rahman bin Al-Harits bin Hisyam, bahawa Rasulullah SAW bersabda: \"Sesiapa yang menjual barang dagangan, kemudian pembeli tersebut muflis dan penjual belum menerima sebarang harga jualan, kemudian dia menjumpai barang dagangannya masih ada pada pembeli, maka dia lebih berhak mendapatnya.  Jika pembeli itu mati, maka penjual itu sama seperti pemiutang yang lain terhadap harta tersebut.\""
  },
  {
    "id": 35614,
    "hadith_number": 1436,
    "tajuk_hadith": "Hak Penjual ke Atas Barangan yang Dijual kepada Pembeli Muflis",
    "perawi_melayu": "Malik meriwayatkan daripada Yahya bin Said daripada Abu Bakar bin Muhammad bin Amr bin Hazm daripada Umar bin Abd al-Aziz daripada Abu Bakar bin Abd ar-Rahman bin al-Harith bin Hisham daripada Abu Hurairah",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَيُّمَا رَجُلٍ أَفْلَسَ فَأَدْرَكَ الرَّجُلُ مَالَهُ بِعَيْنِهِ فَهُوَ أَحَقُّ بِهِ مِنْ غَيْرِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Yahya bin Said daripada Abu Bakar bin Muhammad bin Amr bin Hazm daripada Umar bin Abd al-Aziz daripada Abu Bakar bin Abd ar-Rahman bin al-Harith bin Hisham daripada Abu Hurairah bahawa Rasulullah SAW bersabda:  \"Sesiapa yang muflis dan seseorang menemui hartanya sendiri, maka dia lebih berhak terhadapnya daripada orang lain.\"  \n\nMalik juga menyebut tentang seseorang yang menjual barang kepada seseorang, dan pembeli itu muflis.  Beliau berkata, \"Penjual mengambil apa sahaja barangnya yang dijumpai. Jika pembeli telah menjual sebahagian daripadanya dan mengagihkannya, penjual barang itu lebih berhak terhadapnya daripada pemiutang. Apa yang telah diagihkan oleh pembeli tidak menghalang penjual daripada mengambil apa sahaja yang dijumpainya. Ia adalah hak penjual jika dia telah menerima sebahagian daripada harga daripada pembeli dan dia mahu mengembalikannya untuk mengambil apa yang dijumpainya daripada barangannya, dan apa yang tidak dijumpainya, dia adalah seperti pemiutang.\" \n\nMalik juga menyebut tentang seseorang yang membeli bulu yang telah dipintal atau sebidang tanah, dan kemudian melakukan beberapa kerja di atasnya, seperti membina rumah di atas sebidang tanah atau menenun bulu yang telah dipintal menjadi kain. Kemudian dia muflis selepas membelinya, dan pemilik asal tanah itu berkata, \"Saya akan mengambil tanah itu dan apa sahaja struktur yang ada di atasnya.\" Malik berkata, \"Struktur itu bukan miliknya.  Bagaimanapun, tanah dan apa yang ada di dalamnya yang telah diperbaiki oleh pembeli dinilai. Kemudian dilihat berapa harga tanah itu dan berapa banyak nilai itu adalah harga struktur. Mereka adalah rakan kongsi dalam hal itu. Pemilik tanah itu mempunyai bahagiannya, dan pemiutang mempunyai jumlah bahagian struktur.\" \n\nMalik berkata, \"Penjelasannya ialah nilai keseluruhannya ialah seribu lima ratus dirham. Nilai tanah itu ialah lima ratus dirham, dan nilai bangunan itu ialah seribu dirham. Pemilik tanah itu mempunyai sepertiga, dan pemiutang mempunyai dua pertiga.\" \n\nMalik berkata, \"Begitu juga dengan pemintalan dan perkara lain yang serupa dalam keadaan ini dan pembeli mempunyai hutang yang tidak dapat dibayar. Inilah tindakan dalam kes sedemikian.\" \n\nMalik berkata, \"Bagi barangan yang telah dijual dan yang tidak diperbaiki oleh pembeli, tetapi barangan itu dijual dengan baik dan harganya meningkat, maka pemiliknya menginginkannya dan pemiutang juga mahu merampasnya, maka pemiutang memilih antara memberi pemilik barangan itu harga yang dijualnya dan tidak memberinya sebarang kerugian dan menyerahkan barangannya kepadanya.\n\nJika harga barangan itu telah turun, penjual mempunyai pilihan. Jika dia suka, dia boleh mengambil barangannya dan dia tidak mempunyai tuntutan ke atas harta si peminjamnya, dan itulah haknya. Jika dia suka, dia boleh menjadi salah seorang pemiutang dan mengambil sebahagian daripada haknya dan tidak mengambil barangannya. Itu terpulang kepadanya.\" \n\nMalik berkata tentang seseorang yang membeli seorang hamba perempuan atau binatang dan dia melahirkan anak dalam milikannya dan pembeli itu muflis, \"Hamba perempuan atau binatang dan anaknya adalah milik penjual melainkan pemiutang menghendakinya. Dalam kes itu, mereka memberinya hak sepenuhnya dan mereka mengambilnya.\""
  },
  {
    "id": 35615,
    "hadith_number": 1437,
    "tajuk_hadith": "Keutamaan Melunaskan Hutang dengan Sebaiknya",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Zayd bin Aslam, daripada Ata bin Yasar, daripada Abu Rafi', mawla Rasulullah SAW",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي رَافِعٍ، مَوْلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ اسْتَسْلَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَكْرًا فَجَاءَتْهُ إِبِلٌ مِنَ الصَّدَقَةِ قَالَ أَبُو رَافِعٍ فَأَمَرَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ أَقْضِيَ الرَّجُلَ بَكْرَهُ فَقُلْتُ لَمْ أَجِدْ فِي الإِبِلِ إِلاَّ جَمَلاً خِيَارًا رَبَاعِيًا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَعْطِهِ إِيَّاهُ فَإِنَّ خِيَارَ النَّاسِ أَحْسَنُهُمْ قَضَاءً ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Zayd bin Aslam, daripada Ata bin Yasar, daripada Abu Rafi', mawla Rasulullah SAW bahawa baginda berkata:  Rasulullah SAW meminjam seekor unta muda, kemudian baginda menerima unta-unta daripada zakat. Abu Rafi' berkata, \"Rasulullah SAW menyuruhku untuk membayar balik unta muda itu kepada lelaki tersebut. Aku berkata, 'Aku hanya menjumpai unta yang bagus berusia tujuh tahun di dalam unta-unta itu.' Rasulullah SAW bersabda, 'Berikan kepadanya. Sesungguhnya sebaik-baik manusia ialah mereka yang paling baik melunaskan hutang mereka.'"
  },
  {
    "id": 35616,
    "hadith_number": 1438,
    "tajuk_hadith": "Mengenai Membayar Hutang dengan Barang yang Lebih Baik",
    "perawi_melayu": "Malik, daripada Humayd ibn Qays al-Makki, daripada Mujahid",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ حُمَيْدِ بْنِ قَيْسٍ الْمَكِّيِّ، عَنْ مُجَاهِدٍ، أَنَّهُ قَالَ اسْتَسْلَفَ عَبْدُ اللَّهِ بْنُ عُمَرَ مِنْ رَجُلٍ دَرَاهِمَ ثُمَّ قَضَاهُ دَرَاهِمَ خَيْرًا مِنْهَا فَقَالَ الرَّجُلُ يَا أَبَا عَبْدِ الرَّحْمَنِ هَذِهِ خَيْرٌ مِنْ دَرَاهِمِي الَّتِي أَسْلَفْتُكَ ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ قَدْ عَلِمْتُ وَلَكِنْ نَفْسِي بِذَلِكَ طَيِّبَةٌ ‏.‏ قَالَ مَالِكٌ لاَ بَأْسَ بِأَنْ يُقْبِضَ مَنْ أُسْلِفَ شَيْئًا مِنَ الذَّهَبِ أَوِ الْوَرِقِ أَوِ الطَّعَامِ أَوِ الْحَيَوَانِ مِمَّنْ أَسْلَفَهُ ذَلِكَ أَفْضَلَ مِمَّا أَسْلَفَهُ إِذَا لَمْ يَكُنْ ذَلِكَ عَلَى شَرْطٍ مِنْهُمَا أَوْ عَادَةٍ فَإِنْ كَانَ ذَلِكَ عَلَى شَرْطٍ أَوْ وَأْىٍ أَوْ عَادَةٍ فَذَلِكَ مَكْرُوهٌ وَلاَ خَيْرَ فِيهِ ‏.‏ قَالَ وَذَلِكَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى جَمَلاً رَبَاعِيًا خِيَارًا مَكَانَ بَكْرٍ اسْتَسْلَفَهُ وَأَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ اسْتَسْلَفَ دَرَاهِمَ فَقَضَى خَيْرًا مِنْهَا فَإِنْ كَانَ ذَلِكَ عَلَى طِيبِ نَفْسٍ مِنَ الْمُسْتَسْلِفِ وَلَمْ يَكُنْ ذَلِكَ عَلَى شَرْطٍ وَلاَ وَأْىٍ وَلاَ عَادَةٍ كَانَ ذَلِكَ حَلاَلاً لاَ بَأْسَ بِهِ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Humayd ibn Qays al-Makki, daripada Mujahid, bahawa baginda berkata: Abdullah ibn Umar meminjam beberapa dirham daripada seorang lelaki, kemudian baginda membayarnya dengan dirham yang lebih baik. Lelaki itu berkata, \"Wahai Abu Abdur-Rahman, ini lebih baik daripada dirhamku yang engkau pinjam.\" Abdullah ibn Umar berkata, \"Saya tahu, tetapi hati saya senang dengannya.\"  Malik berkata: \"Tiada masalah sekiranya seseorang yang dipinjami sesuatu daripada emas, perak, makanan atau haiwan, membayar balik kepada pemberi pinjaman sesuatu yang lebih baik daripada apa yang dipinjam, jika ia bukan suatu syarat di antara mereka berdua atau kebiasaan. Jika ia atas syarat, janji atau kebiasaan, maka ia adalah makruh dan tiada kebaikan padanya.\" Baginda berkata: \"Ini kerana Rasulullah SAW membayar balik seekor unta jantan yang baik sebagai ganti seekor unta muda yang dipinjamnya, dan Abdullah ibn Umar meminjam beberapa dirham, kemudian membayar balik dengan yang lebih baik. Jika ia atas kebaikan peminjam dan bukan atas syarat, janji atau kebiasaan, maka ia halal dan tiada masalah dengannya.\""
  },
  {
    "id": 35617,
    "hadith_number": 1439,
    "tajuk_hadith": "Larangan Meminjam Makanan dengan Syarat Pemulangan di Tempat Lain",
    "perawi_melayu": "Yahya daripada Malik",
    "english_text": "Yahya related to me from Malik that he had heard that Umar ibn\nal-Khattab said that he disapproved of one man lending another food on\nthe provision that he gave it back to him in another city. He said,\n\"Where is the transport?\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ فِي رَجُلٍ أَسْلَفَ رَجُلاً طَعَامًا عَلَى أَنْ يُعْطِيَهُ إِيَّاهُ فِي بَلَدٍ آخَرَ فَكَرِهَ ذَلِكَ عُمَرُ بْنُ الْخَطَّابِ وَقَالَ فَأَيْنَ الْحَمْلُ يَعْنِي حُمْلاَنَهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik bahawa baginda telah mendengar bahawa Umar ibn al-Khattab berkata bahawa baginda tidak menyukai seseorang meminjamkan makanan kepada orang lain dengan syarat makanan itu dikembalikan di bandar lain. Baginda berkata, \"Di manakah pengangkutannya?\" "
  },
  {
    "id": 35618,
    "hadith_number": 1440,
    "tajuk_hadith": "Tiga Jenis Pinjaman",
    "perawi_melayu": "Malik meriwayatkan bahawa baginda telah mendengar bahawa seorang lelaki datang kepada Abdullah ibn Umar dan berkata, \"Wahai Abu Abd ar-Rahman, saya telah memberi pinjaman kepada seorang lelaki dan mensyaratkan agar dia memberi saya lebih baik daripada apa yang saya pinjamkan kepadanya.\" Abdullah ibn Umar berkata, \"Itu adalah riba.\" Abdullah berkata, \"Pinjaman itu ada tiga jenis:",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ رَجُلاً، أَتَى عَبْدَ اللَّهِ بْنَ عُمَرَ فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنِّي أَسْلَفْتُ رَجُلاً سَلَفًا وَاشْتَرَطْتُ عَلَيْهِ أَفْضَلَ مِمَّا أَسْلَفْتُهُ ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ فَذَلِكَ الرِّبَا ‏.‏ قَالَ فَكَيْفَ تَأْمُرُنِي يَا أَبَا عَبْدِ الرَّحْمَنِ فَقَالَ عَبْدُ اللَّهِ السَّلَفُ عَلَى ثَلاَثَةِ وُجُوهٍ سَلَفٌ تُسْلِفُهُ تُرِيدُ بِهِ وَجْهَ اللَّهِ فَلَكَ وَجْهُ اللَّهِ وَسَلَفٌ تُسْلِفُهُ تُرِيدُ بِهِ وَجْهَ صَاحِبِكَ فَلَكَ وَجْهُ صَاحِبِكَ وَسَلَفٌ تُسْلِفُهُ لِتَأْخُذَ خَبِيثًا بِطَيِّبٍ فَذَلِكَ الرِّبَا ‏.‏ قَالَ فَكَيْفَ تَأْمُرُنِي يَا أَبَا عَبْدِ الرَّحْمَنِ قَالَ أَرَى أَنْ تَشُقَّ الصَّحِيفَةَ فَإِنْ أَعْطَاكَ مِثْلَ الَّذِي أَسْلَفْتَهُ قَبِلْتَهُ وَإِنْ أَعْطَاكَ دُونَ الَّذِي أَسْلَفْتَهُ فَأَخَذْتَهُ أُجِرْتَ وَإِنْ أَعْطَاكَ أَفْضَلَ مِمَّا أَسْلَفْتَهُ طَيِّبَةً بِهِ نَفْسُهُ فَذَلِكَ شُكْرٌ شَكَرَهُ لَكَ وَلَكَ أَجْرُ مَا أَنْظَرْتَهُ ‏.‏",
    "malay_translation": "Pinjaman itu ada tiga jenis: Pinjaman yang kamu berikan kerana mengharapkan keredaan Allah, maka kamu akan mendapat keredaan Allah. Pinjaman yang kamu berikan kerana mengharapkan keredaan sahabatmu, maka kamu akan mendapat keredaan sahabatmu. Dan pinjaman yang kamu berikan dengan niat untuk mengambil sesuatu yang buruk dengan sesuatu yang baik, maka itulah riba.  Dia berkata, \"Apakah yang tuan suruh saya lakukan, wahai Abu Abd ar-Rahman?\"  Jawabnya, \"Pendapat saya, engkau patut membatalkan perjanjian itu. Jika dia memberi kepadamu sama banyak dengan apa yang telah kamu pinjamkan kepadanya, terimalah. Jika dia memberi kepadamu kurang daripada apa yang telah kamu pinjamkan kepadanya, terimalah juga dan engkau akan mendapat pahala. Jika dia memberi kepadamu lebih baik daripada apa yang telah kamu pinjamkan kepadanya, atas kerelaannya sendiri, maka itu adalah tanda kesyukurannya kepadamu dan engkau akan mendapat upah atas tempoh masa engkau memberi pinjaman kepadanya.\""
  },
  {
    "id": 35619,
    "hadith_number": 1441,
    "tajuk_hadith": "Syarat Pinjaman: Hanya Pengembalian",
    "perawi_melayu": "Yahya daripada Malik daripada Nafi'",
    "english_text": "Yahya related to me from Malik from Nafi that he heard Abdullah ibn Umar say, \"If someone lends something, let the only condition be that it is repaid.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ، يَقُولُ مَنْ أَسْلَفَ سَلَفًا فَلاَ يَشْتَرِطْ إِلاَّ قَضَاءَهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Nafi' bahawa beliau mendengar Abdullah bin Umar berkata, \"Barang siapa memberi pinjaman, maka janganlah dia mensyaratkan melainkan hanya pengembaliannya.\""
  },
  {
    "id": 35620,
    "hadith_number": 1442,
    "tajuk_hadith": "Larangan Menentukan Faedah Tambahan dalam Pinjaman dan Pinjaman Hamba Wanita",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، كَانَ يَقُولُ مَنْ أَسْلَفَ سَلَفًا فَلاَ يَشْتَرِطْ أَفْضَلَ مِنْهُ وَإِنْ كَانَتْ قَبْضَةً مِنْ عَلَفٍ فَهُوَ رِبًا ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّ مَنِ اسْتَسْلَفَ شَيْئًا مِنَ الْحَيَوَانِ بِصِفَةٍ وَتَحْلِيَةٍ مَعْلُومَةٍ فَإِنَّهُ لاَ بَأْسَ بِذَلِكَ وَعَلَيْهِ أَنْ يَرُدَّ مِثْلَهُ إِلاَّ مَا كَانَ مِنَ الْوَلاَئِدِ فَإِنَّهُ يُخَافُ فِي ذَلِكَ الذَّرِيعَةُ إِلَى إِحْلاَلِ مَا لاَ يَحِلُّ فَلاَ يَصْلُحُ وَتَفْسِيرُ مَا كُرِهَ مِنْ ذَلِكَ أَنْ يَسْتَسْلِفَ الرَّجُلُ الْجَارِيَةَ فَيُصِيبُهَا مَا بَدَا لَهُ ثُمَّ يَرُدُّهَا إِلَى صَاحِبِهَا بِعَيْنِهَا فَذَلِكَ لاَ يَصْلُحُ وَلاَ يَحِلُّ وَلَمْ يَزَلْ أَهْلُ الْعِلْمِ يَنْهَوْنَ عَنْهُ وَلاَ يُرَخِّصُونَ فِيهِ لأَحَدٍ ‏.‏",
    "malay_translation": "Malik meriwayatkan bahawa beliau telah diberitahu bahawa Abdullah bin Mas'ud berkata, \"Barangsiapa memberi pinjaman, maka janganlah dia mensyaratkan sesuatu yang lebih baik daripada pinjaman itu. Walaupun hanya segenggam rumput, ia tetap merupakan riba.\"  Malik berkata, \"Perkara yang disepakati di kalangan kami ialah bahawa tidak mengapa meminjam haiwan dengan sifat dan keterangan yang diketahui, dan hendaklah dikembalikan serupa. Kecuali bagi hamba wanita, kerana dikhuatiri ia akan menjadi jalan kepada menghalalkan apa yang haram, maka ia tidak dibenarkan. Penjelasan bagi apa yang dibenci daripada perkara itu ialah seseorang meminjam hamba wanita, kemudian melakukan hubungan seks dengannya sebagaimana yang dikehendakinya, kemudian mengembalikannya kepada tuannya. Perkara itu tidak dibenarkan dan tidak halal. Para ulama terus melarangnya dan tidak memberi kelonggaran kepada sesiapa pun dalam hal ini.\""
  },
  {
    "id": 35621,
    "hadith_number": 1443,
    "tajuk_hadith": "Larangan Bersaing dalam Tawar-Menawar",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Nafi' daripada Abdullah bin Umar",
    "english_text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"Do not let any of you bid against each other.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Nafi' daripada Abdullah bin Umar bahawa Rasulullah SAW bersabda:  \"Janganlah sebahagian daripada kamu menawar melebihi tawaran sebahagian yang lain.\""
  },
  {
    "id": 35622,
    "hadith_number": 1444,
    "tajuk_hadith": "Larangan Mencari Untung dalam Perniagaan",
    "perawi_melayu": "Malik, Abu az-Zinad, al-Araj, Abu Hurairah",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَلَقَّوُا الرُّكْبَانَ لِلْبَيْعِ وَلاَ يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ وَلاَ تَنَاجَشُوا وَلاَ يَبِعْ حَاضِرٌ لِبَادٍ وَلاَ تُصَرُّوا الإِبِلَ وَالْغَنَمَ فَمَنِ ابْتَاعَهَا بَعْدَ ذَلِكَ فَهُوَ بِخَيْرِ النَّظَرَيْنِ بَعْدَ أَنْ يَحْلُبَهَا إِنْ رَضِيَهَا أَمْسَكَهَا وَإِنْ سَخِطَهَا رَدَّهَا وَصَاعًا مِنْ تَمْرٍ ‏\"‏ ‏.‏",
    "malay_translation": "Malik telah meriwayatkan daripada Abu az-Zinad, daripada al-Araj, daripada Abu Hurairah bahawa Rasulullah SAW bersabda:  \"Janganlah kamu semua menunggu kafilah untuk berniaga, dan janganlah sebahagian daripada kamu menjual atas jualan sebahagian yang lain, dan janganlah kamu menawar secara berlebihan, dan janganlah penduduk bandar menjual bagi pihak penduduk padang pasir, dan janganlah kamu menyumbat puting susu unta dan kambing supaya kelihatan banyak susunya.  Sesiapa yang membelinya selepas itu, maka dia mempunyai dua pilihan selepas memerah susunya: jika dia berpuas hati, dia menyimpannya, dan jika dia tidak berpuas hati, dia boleh memulangkannya bersama satu sha’ tamar (kurma).\"\n\nMalik berkata: \"Penjelasan bagi perkataan Rasulullah SAW – semoga Allah merahmati dan memberi kesejahteraan ke atasnya –  \"janganlah kamu menawar secara berlebihan\"  ialah haram bagi seseorang untuk menawar lebih tinggi daripada tawaran saudaranya, apabila penjual telah cenderung kepada pembeli dan menetapkan syarat-syarat mengenai berat emas dan dia telah menyatakan dirinya tidak bertanggungjawab atas kecacatan dan perkara-perkara seumpamanya yang menunjukkan penjual ingin berurus niaga dengan pembeli. Inilah yang dilarangnya, dan Allah Maha Mengetahui.\"\n\nMalik berkata: \"Bagaimanapun, tidak mengapa sekiranya lebih daripada seorang menawar terhadap barangan yang dilelong.\"\n\nBeliau berkata: \"Sekiranya manusia meninggalkan tawar-menawar apabila orang pertama mula menawar, harga yang tidak realistik mungkin akan diambil dan perkara yang tidak disenangi akan berlaku dalam jual beli barangan. Inilah masih cara urusannya di kalangan kita.\" "
  },
  {
    "id": 35623,
    "hadith_number": 1445,
    "tajuk_hadith": "Larangan Najsy",
    "perawi_melayu": "Malik, daripada Nafi', daripada Abdullah bin Umar",
    "english_text": "Malik said, from Nafi from Abdullah ibn Umar that the Messenger\nof Allah, may Allah bless him and grant him peace, forbade najsh.\n\n\nMalik said, \"Najsh is to offer a man more than the worth of his\ngoods when you do not mean to buy them and someone else follows you in\nbidding.\"",
    "arabic_text": "قَالَ مَالِكٌ عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ النَّجْشِ ‏.‏",
    "malay_translation": "Malik berkata daripada Nafi', daripada Abdullah bin Umar bahawa Rasulullah SAW melarang najsy.\n\nMalik berkata, \"Najsy ialah menawar sesuatu barang melebihi harga sebenarnya tanpa niat untuk membelinya, kemudian orang lain mengikuti tawaran tersebut.\""
  },
  {
    "id": 35624,
    "hadith_number": 1446,
    "tajuk_hadith": "Doa Memelihara Daripada Penipuan dalam Perniagaan",
    "perawi_melayu": "Yahya daripada Malik daripada Abdullah ibn Dinar daripada Abdullah ibn Umar",
    "english_text": "Yahya related to me from Malik from Abdullah ibn Dinar from\nAbdullah ibn Umar that a man mentioned to the Messenger of Allah, may\nAllah bless him and grant him peace, that he was always being cheated\nin business transactions. The Messenger of Allah, may Allah bless him\nand grant him peace, said, \"When you enter a transaction, say, 'No\ntrickery.' So whenever that man entered a transaction, he would say,\n'No trickery.' \"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَجُلاً، ذَكَرَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ يُخْدَعُ فِي الْبُيُوعِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا بَايَعْتَ فَقُلْ لاَ خِلاَبَةَ ‏\"‏ ‏.‏ قَالَ فَكَانَ الرَّجُلُ إِذَا بَايَعَ يَقُولُ لاَ خِلاَبَةَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Abdullah ibn Dinar, dari Abdullah ibn Umar bahawa seorang lelaki memberitahu Rasulullah SAW bahawa dia selalu ditipu dalam urusan jual beli.  Rasulullah SAW bersabda, \"Apabila kamu berurus niaga, katakanlah, ‘Tiada penipuan.’\"  Maka lelaki itu, setiap kali berurus niaga, akan berkata, ‘Tiada penipuan.’"
  },
  {
    "id": 35625,
    "hadith_number": 1447,
    "tajuk_hadith": "Tinggal di Tanah yang Mempunyai Ukuran dan Timbangan yang Tepat",
    "perawi_melayu": "Malik meriwayatkan daripada Yahya bin Said bahawa Said bin al-Musayyab berkata,",
    "english_text": "Malik related to me that Yahya ibn Said heard Said ibn al-\nMusayyab say, \"When you come to a land where they give full measure\nand full weight, stay there. When you come to a land where they\nshorten the measure and weight, then do not stay there very long.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ إِذَا جِئْتَ أَرْضًا يُوفُونَ الْمِكْيَالَ وَالْمِيزَانَ فَأَطِلِ الْمُقَامَ بِهَا وَإِذَا جِئْتَ أَرْضًا يُنَقِّصُونَ الْمِكْيَالَ وَالْمِيزَانَ فَأَقْلِلِ الْمُقَامَ بِهَا ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Yahya bin Said bahawa beliau mendengar Said bin al-Musayyab berkata, \"Apabila kamu sampai ke sesuatu tempat di mana penduduknya memberikan ukuran dan timbangan yang penuh, maka berdiamlah di situ.  Apabila kamu sampai ke sesuatu tempat di mana penduduknya mengurangkan ukuran dan timbangan, maka janganlah kamu berlama-lama di situ.\""
  },
  {
    "id": 35626,
    "hadith_number": 1448,
    "tajuk_hadith": "Kedermawanan dalam Perniagaan dan Ganjaran",
    "perawi_melayu": "Malik meriwayatkan daripada Yahya bin Said bahawa beliau mendengar Muhammad bin al-Munkadir berkata,",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ مُحَمَّدَ بْنَ الْمُنْكَدِرِ، يَقُولُ أَحَبَّ اللَّهُ عَبْدًا سَمْحًا إِنْ بَاعَ سَمْحًا إِنِ ابْتَاعَ سَمْحًا إِنْ قَضَى سَمْحًا إِنِ اقْتَضَى ‏.‏ قَالَ  مَالِكٌ فِي الرَّجُلِ يَشْتَرِي الإِبِلَ أَوِ الْغَنَمَ أَوِ الْبَزَّ أَوِ الرَّقِيقَ أَوْ شَيْئًا مِنَ الْعُرُوضِ جِزَافًا إِنَّهُ لاَ يَكُونُ الْجِزَافُ فِي شَىْءٍ مِمَّا يُعَدُّ عَدًّا ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يُعْطِي الرَّجُلَ السِّلْعَةَ  يَبِيعُهَا لَهُ وَقَدْ قَوَّمَهَا صَاحِبُهَا قِيمَةً فَقَالَ إِنْ بِعْتَهَا بِهَذَا الثَّمَنِ الَّذِي أَمَرْتُكَ بِهِ فَلَكَ دِينَارٌ - أَوْ شَىْءٌ يُسَمِّيهِ لَهُ يَتَرَاضَيَانِ عَلَيْهِ - وَإِنْ لَمْ تَبِعْهَا فَلَيْسَ لَكَ شَىْءٌ إِنَّهُ لاَ بَأْسَ بِذَلِكَ إِذَا سَمَّى ثَمَنًا يَبِيعُهَا بِهِ وَسَمَّى أَجْرًا مَعْلُومًا إِذَا بَاعَ أَخَذَهُ وَإِنْ لَمْ يَبِعْ فَلاَ شَىْءَ لَهُ ‏.‏ قَالَ مَالِكٌ وَمِثْلُ ذَلِكَ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ إِنْ قَدَرْتَ عَلَى غُلاَمِي الآبِقِ أَوْ جِئْتَ بِجَمَلِي الشَّارِدِ فَلَكَ كَذَا ‏.‏ فَهَذَا مِنْ بَابِ الْجُعْلِ وَلَيْسَ مِنْ بَابِ الإِجَارَةِ وَلَوْ كَانَ مِنْ بَابِ الإِجَارَةِ لَمْ يَصْلُحْ ‏.‏ قَالَ مَالِكٌ فَأَمَّا الرَّجُلُ يُعْطَى السِّلْعَةَ فَيُقَالُ لَهُ بِعْهَا وَلَكَ كَذَا وَكَذَا فِي كُلِّ دِينَارٍ ‏.‏ لِشَىْءٍ يُسَمِّيهِ فَإِنَّ ذَلِكَ لاَ يَصْلُحُ لأَنَّهُ كُلَّمَا نَقَصَ دِينَارٌ مِنْ ثَمَنِ السِّلْعَةِ نَقَصَ مِنْ حَقِّهِ الَّذِي سَمَّى لَهُ فَهَذَا غَرَرٌ لاَ يَدْرِي كَمْ جَعَلَ لَهُ ‏.‏",
    "malay_translation": "Allah SWT menyukai hamba yang murah hati sama ada ketika menjual, membeli, membayar hutang, atau menuntut hutang.  Malik berkata mengenai seseorang yang membeli unta, kambing biri-biri, kain, hamba sahaya, atau barangan lain secara rambang tanpa ukuran yang tepat, bahawa jual beli secara rambang tidak dibenarkan bagi sesuatu yang boleh dikira.  Malik juga berkata mengenai seseorang yang memberikan barangan kepada orang lain untuk dijual dengan harga yang telah ditetapkan, iaitu jika barangan itu terjual pada harga tersebut, penjual akan mendapat satu dinar (atau sesuatu yang telah dipersetujui bersama), tetapi jika tidak terjual, maka dia tidak akan mendapat apa-apa.  Ini adalah dibolehkan selagi harga jualan dan upah telah ditetapkan. Jika barangan terjual, dia akan mendapat upahnya, tetapi jika tidak, dia tidak akan mendapat apa-apa.  Malik juga berkata bahawa ini seperti seseorang yang berkata kepada orang lain, \"Jika kamu berjaya menangkap hamba saya yang melarikan diri atau membawa kembali unta saya yang sesat, kamu akan mendapat ganjaran sebegini.\" Ini termasuk dalam kategori ganjaran, bukan upah.  Sekiranya ia termasuk dalam kategori upah, ia tidak dibenarkan.  Malik turut menyatakan bahawa jika seseorang diberi barangan dan diberitahu bahawa sekiranya dia menjualnya, dia akan mendapat peratusan tertentu bagi setiap dinar, ia tidak dibenarkan kerana setiap kali harga barangan berkurang satu dinar, maka haknya juga akan berkurang. Ini adalah transaksi yang tidak pasti, kerana dia tidak tahu berapa banyak yang akan diterimanya."
  },
  {
    "id": 35627,
    "hadith_number": 1449,
    "tajuk_hadith": "Menyewakan Semula Haiwan Dengan Harga Lebih Tinggi",
    "perawi_melayu": "Malik meriwayatkan daripada Ibn Shihab",
    "english_text": "Malik related to me that he asked Ibn Shihab about a man who\nhired an animal, and then re-hired it out for more than what he hired\nit for. He said, \"There is no harm in that.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ سَأَلَهُ عَنِ الرَّجُلِ، يَتَكَارَى الدَّابَّةَ ثُمَّ يُكْرِيهَا بِأَكْثَرَ مِمَّا تَكَارَاهَا بِهِ فَقَالَ لاَ بَأْسَ بِذَلِكَ ‏.‏",
    "malay_translation": "Malik memberitahu aku bahawa beliau bertanya kepada Ibn Shihab tentang seorang lelaki yang menyewa seekor haiwan, kemudian menyewakannya semula dengan harga yang lebih tinggi daripada harga sewanya.  Beliau berkata, \"Tiada apa-apa kesalahan dalam hal itu.\""
  }
]