[
  {
    "id": 34895,
    "hadith_number": 717,
    "tajuk_hadith": "Rasulullah SAW Mendekatkan Kepala kepada Aisyah RA ketika I'tikaf",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Ibn Shihab daripada Urwa ibn az-Zubayr daripada Amra bint Abd ar-Rahman bahawa A'isha, isteri Nabi SAW, berkata,",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Urwa ibn az-\nZubayr from Amra bint Abd ar-Rahman that A'isha, the wife of the\nProphet, may Allah bless him and grant him peace, said,\"When the\nMessenger of Allah, may Allah bless him and grant him peace, did\nitikaf he would bring his head near to me and I would comb it. He\nwould only go into the house to relieve himself.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا اعْتَكَفَ يُدْنِي إِلَىَّ رَأْسَهُ فَأُرَجِّلُهُ وَكَانَ لاَ يَدْخُلُ الْبَيْتَ إِلاَّ لِحَاجَةِ الإِنْسَانِ ‏.‏",
    "malay_translation": "Bahawa Rasulullah SAW apabila beri'tikaf, baginda mendekatkan kepalanya kepadaku lalu aku menyisirnya. Baginda tidak masuk ke rumah kecuali untuk hajat manusia (buang air)."
  },
  {
    "id": 34896,
    "hadith_number": 718,
    "tajuk_hadith": "Larangan Menziarahi Orang Sakit dan Urusan Duniawi Semasa Iktikaf",
    "perawi_melayu": "Malik meriwayatkan daripada Ibn Shihab daripada Amra binti Abd ar-Rahman",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Amra bint Abd\nar-Rahman that when A'isha was doing itikaf she would only ask after\nsick people if she was walking and not if she was standing still.\n\n\nMalik said, \"A person doing itikaf should not carry out\nobligations of his, nor leave the mosque for them, nor should he help\nanyone. He should only leave the mosque to relieve himself. If he were\nable to go out to do things for people, visiting the sick, praying\nover the dead and following funeral processions would be the things\nwith the most claim on his coming out.\"\n\n\nMalik said, \"A person\ndoing itikaf is not doing itikaf until he avoids what some one doing\nitikaf should avoid, namely, visiting the sick, praying over the dead,\nand entering houses, except to relieve himself.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ، كَانَتْ إِذَا اعْتَكَفَتْ لاَ تَسْأَلُ عَنِ الْمَرِيضِ إِلاَّ وَهِيَ تَمْشِي لاَ تَقِفُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Ibn Shihab, daripada Amra binti Abd ar-Rahman bahawa apabila Aisyah RA melakukan iktikaf, beliau hanya akan bertanya khabar orang sakit sambil berjalan dan tidak berhenti.\n\nMalik berkata, \"Seseorang yang melakukan iktikaf tidak sepatutnya melaksanakan kewajipan-kewajipannya, atau meninggalkan masjid untuk urusan tersebut, atau membantu sesiapa pun. Dia hanya boleh meninggalkan masjid untuk membuang hajat. Jika dia mampu keluar untuk melakukan perkara-perkara untuk orang lain, menziarahi orang sakit, menyembahyangkan jenazah dan mengikuti perarakan pengebumian adalah perkara-perkara yang paling utama untuk dia keluar.\"\n\nMalik berkata, \"Seseorang yang melakukan iktikaf tidak dikira melakukan iktikaf sehingga dia menjauhi perkara-perkara yang sepatutnya dijauhi oleh orang yang melakukan iktikaf, iaitu, menziarahi orang sakit, menyembahyangkan jenazah, dan memasuki rumah-rumah, kecuali untuk membuang hajat.\""
  },
  {
    "id": 34897,
    "hadith_number": 719,
    "tajuk_hadith": "Kebolehan Orang yang Beriktikaf untuk Memasuki Rumah untuk Keperluan dan Tempat Iktikaf",
    "perawi_melayu": "Malik",
    "english_text": "Yahya related to me from Malik that he had asked Ibn Shihab\nwhether someone doing itikaf could go into a house to relieve himself,\nand he said, \"Yes, there is no harm in that.\"\n\n\nMalik said,\n\"The situation that we are all agreed upon here is that there is no\ndisapproval of anyone doing itikaf in a mosque where jumua is held.\nThe only reason I see for disapproving of doing itikaf in a mosque\nwhere jumua is not held is that the man doing itikaf would have to\nleave the mosque where he was doing itikaf in order to go to jumua, or\nelse not go there at all. If, however, he is doing itikaf in a mosque\nwhere jumua is not held, and he does not have to go to jumua in any\nother mosque, then I see no harm in him doing itikaf there, because\nAllah, the Blessed and Exalted, says, 'While you are doing itikaf in\nmosques,' and refers to all mosques in general, without specifying any\nparticular kind.\"\n\n\nMalik continued, \"Accordingly, it is\npermissiblefor a man to do itikaf in a mosque where jumua is not held\nif he does not have to leave it to go to a mosque where jumua is\nheld.\"\n\n\nMalik said, \"A person doing itikaf should spend the\nnight only in the mosque where he is doing itikaf, except if his tent\nis in one of the courtyards of the mosque. I have never heard that\nsomeone doing itikaf can put up a shelter anywhere except in the\nmosque itself or in one of the courtyards of the mosque.\n\n\nPart\nof what shows that he must spend the night in the mosque is the saying\nof A'isha, 'When the Messenger of Allah, may Allah bless him and grant\nhim peace, was doing itikaf, he would only go into the house to\nrelieve himself.' Nor should he do itikaf on the roof of the mosque or\nin the minaret.\"\n\n\nMalik said, \"The person who is going to do\nitikaf should enter the place where he wishes to do itikaf before the\nsun sets on the night when he wishes to begin his itikaf, so that he\nis ready to begin the itikaf at the beginning of the night when he is\ngoing to start his itikaf. A person doing itikaf should be occupied\nwith his itikaf, and not turn his attention to other things which\nmight occupy him, such as trading or whatever. There is no harm,\nhowever, if some one doing itikaf tells some one to do something for\nhim regarding his estate, or the affairs of  his family, or tells\nsomeone to sell some property of his, or something else that does not\noccupy him directly. There is no harm in him arranging for someone\nelse to do that for him if it is a simple matter.\"\n\n\nMalik\nsaid, \"I have never heard any of the people of knowledge mentioning\nany modification as far as how to do itikaf is concerned. Itikaf is an\nact of ibada like the prayer, fasting, the hajj, and such like acts,\nwhether they are obligatory or voluntary. Anyone who begins doing any\nof these acts should do them according to what has come down in the\nsunna. He should not start doing anything in them that the muslims\nhave not done, whether it is a modification that he imposes on others,\nor one that he begins doing himself. The Messenger of Allah, may Allah\nbless him and grant him peace, practised itikaf, and the muslims know\nwhat the sunna of itikaf is.\"\n\n\nMalik said, \"Itikaf and jiwar\nare the same, and Itikaf is the same for a village-dweller as it is\nfor a nomad.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنِ الرَّجُلِ، يَعْتَكِفُ هَلْ يَدْخُلُ لِحَاجَتِهِ تَحْتَ سَقْفٍ فَقَالَ نَعَمْ لاَ بَأْسَ بِذَلِكَ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا الَّذِي لاَ اخْتِلاَفَ فِيهِ أَنَّهُ لاَ يُكْرَهُ الاِعْتِكَافُ فِي كُلِّ مَسْجِدٍ يُجَمَّعُ فِيهِ وَلاَ أُرَاهُ كُرِهَ الاِعْتِكَافُ فِي الْمَسَاجِدِ الَّتِي لاَ يُجَمَّعُ فِيهَا إِلاَّ كَرَاهِيَةَ أَنْ يَخْرُجَ الْمُعْتَكِفُ مِنْ مَسْجِدِهِ الَّذِي اعْتَكَفَ فِيهِ إِلَى الْجُمُعَةِ أَوْ يَدَعَهَا فَإِنْ كَانَ مَسْجِدًا لاَ يُجَمَّعُ فِيهِ الْجُمُعَةُ وَلاَ يَجِبُ عَلَى صَاحِبِهِ إِتْيَانُ الْجُمُعَةِ فِي مَسْجِدٍ سِوَاهُ فَإِنِّي لاَ أَرَى بَأْسًا بِالاِعْتِكَافِ فِيهِ لأَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَالَ ‏{‏وَأَنْتُمْ عَاكِفُونَ فِي الْمَسَاجِدِ‏}‏ فَعَمَّ اللَّهُ الْمَسَاجِدَ كُلَّهَا وَلَمْ يَخُصَّ شَيْئًا مِنْهَا ‏.‏ قَالَ مَالِكٌ فَمِنْ هُنَالِكَ جَازَ لَهُ أَنْ يَعْتَكِفَ فِي الْمَسَاجِدِ الَّتِي لاَ يُجَمَّعُ فِيهَا الْجُمُعَةُ إِذَا كَانَ لاَ يَجِبُ عَلَيْهِ أَنْ يَخْرُجَ مِنْهُ إِلَى الْمَسْجِدِ الَّذِي تُجَمَّعُ فِيهِ الْجُمُعَةُ ‏.‏ قَالَ مَالِكٌ وَلاَ يَبِيتُ الْمُعْتَكِفُ إِلاَّ فِي الْمَسْجِدِ الَّذِي اعْتَكَفَ فِيهِ إِلاَّ أَنْ يَكُونَ خِبَاؤُهُ فِي رَحَبَةٍ مِنْ رِحَابِ الْمَسْجِدِ وَلَمْ أَسْمَعْ أَنَّ الْمُعْتَكِفَ يَضْرِبُ بِنَاءً يَبِيتُ فِيهِ إِلاَّ فِي الْمَسْجِدِ أَوْ فِي رَحَبَةٍ مِنْ رِحَابِ الْمَسْجِدِ وَمِمَّا يَدُلُّ عَلَى أَنَّهُ لاَ يَبِيتُ إِلاَّ فِي الْمَسْجِدِ قَوْلُ عَائِشَةَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا اعْتَكَفَ لاَ يَدْخُلُ الْبَيْتَ إِلاَّ لِحَاجَةِ الإِنْسَانِ ‏.‏ وَلاَ يَعْتَكِفُ فَوْقَ ظَهْرِ الْمَسْجِدِ وَلاَ فِي الْمَنَارِ يَعْنِي الصَّوْمَعَةَ ‏.‏ وَقَالَ مَالِكٌ يَدْخُلُ الْمُعْتَكِفُ الْمَكَانَ الَّذِي يُرِيدُ أَنْ يَعْتَكِفَ فِيهِ قَبْلَ غُرُوبِ الشَّمْسِ مِنَ اللَّيْلَةِ الَّتِي يُرِيدُ أَنْ يَعْتَكِفَ فِيهَا حَتَّى يَسْتَقْبِلَ بِاعْتِكَافِهِ أَوَّلَ اللَّيْلَةِ الَّتِي يُرِيدُ أَنْ يَعْتَكِفَ فِيهَا وَالْمُعْتَكِفُ مُشْتَغِلٌ بِاعْتِكَافِهِ لاَ يَعْرِضُ لِغَيْرِهِ مِمَّا يَشْتَغِلُ بِهِ مِنَ التِّجَارَاتِ أَوْ غَيْرِهَا وَلاَ بَأْسَ بِأَنْ يَأْمُرَ الْمُعْتَكِفُ بِبَعْضِ حَاجَتِهِ بِضَيْعَتِهِ وَمَصْلَحَةِ أَهْلِهِ وَأَنْ يَأْمُرَ بِبَيْعِ مَالِهِ أَوْ بِشَىْءٍ لاَ يَشْغَلُهُ فِي نَفْسِهِ فَلاَ بَأْسَ بِذَلِكَ إِذَا كَانَ خَفِيفًا أَنْ يَأْمُرَ بِذَلِكَ مَنْ يَكْفِيهِ إِيَّاهُ ‏.‏ قَالَ مَالِكٌ لَمْ أَسْمَعْ أَحَدًا مِنْ أَهْلِ الْعِلْمِ يَذْكُرُ فِي الاِعْتِكَافِ شَرْطًا وَإِنَّمَا الاِعْتِكَافُ عَمَلٌ مِنَ الأَعْمَالِ مِثْلُ الصَّلاَةِ وَالصِّيَامِ وَالْحَجِّ وَمَا أَشْبَهَ ذَلِكَ مِنَ الأَعْمَالِ مَا كَانَ مِنْ ذَلِكَ فَرِيضَةً أَوْ نَافِلَةً فَمَنْ دَخَلَ فِي شَىْءٍ مِنْ ذَلِكَ فَإِنَّمَا يَعْمَلُ بِمَا مَضَى مِنَ السُّنَّةِ وَلَيْسَ لَهُ أَنْ يُحْدِثَ فِي ذَلِكَ غَيْرَ مَا مَضَى عَلَيْهِ الْمُسْلِمُونَ لاَ مِنْ شَرْطٍ يَشْتَرِطُهُ وَلاَ يَبْتَدِعُهُ وَقَدِ اعْتَكَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَعَرَفَ الْمُسْلِمُونَ سُنَّةَ الاِعْتِكَافِ ‏.‏ قَالَ مَالِكٌ وَالاِعْتِكَافَ وَالْجِوَارُ سَوَاءٌ وَالاِعْتِكَافُ لِلْقَرَوِيِّ وَالْبَدَوِيِّ سَوَاءٌ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik bahawa dia telah bertanya kepada Ibn Shihab adakah seseorang yang melakukan iktikaf boleh masuk ke dalam rumah untuk melepaskan hajatnya, dan dia berkata, \"Ya, tidak mengapa.\"\n\nMalik berkata, \"Perkara yang telah kita sepakati di sini ialah tidak ada larangan bagi sesiapa pun yang melakukan iktikaf di masjid yang diadakan Jumaat. Satu-satunya alasan saya melihat mengapa tidak digalakkan melakukan iktikaf di masjid yang tidak diadakan Jumaat ialah kerana orang yang melakukan iktikaf itu perlu meninggalkan masjid tempat dia melakukan iktikaf untuk pergi ke Jumaat, atau tidak pergi langsung. Walau bagaimanapun, jika dia melakukan iktikaf di masjid yang tidak diadakan Jumaat, dan dia tidak perlu pergi ke Jumaat di masjid lain, maka saya tidak melihat sebarang masalah untuk dia melakukan iktikaf di sana, kerana Allah, Yang Maha Berkat dan Maha Tinggi, berfirman, 'Sedang kamu beriktikaf di masjid,' dan merujuk kepada semua masjid secara umum, tanpa menentukan jenis tertentu.\"\n\nMalik meneruskan, \"Oleh itu, dibolehkan bagi seseorang lelaki untuk melakukan iktikaf di masjid yang tidak diadakan Jumaat jika dia tidak perlu meninggalkannya untuk pergi ke masjid yang diadakan Jumaat.\"\n\nMalik berkata, \"Seseorang yang melakukan iktikaf hanya boleh menghabiskan malam di masjid tempat dia melakukan iktikaf, kecuali jika khemahnya berada di salah satu halaman masjid. Saya tidak pernah mendengar bahawa seseorang yang melakukan iktikaf boleh mendirikan tempat perlindungan di mana-mana sahaja kecuali di masjid itu sendiri atau di salah satu halaman masjid.\"\n\nSebahagian daripada apa yang menunjukkan bahawa dia mesti menghabiskan malam di masjid ialah ucapan Aisyah, 'Apabila Rasulullah SAW melakukan iktikaf, dia hanya akan masuk ke dalam rumah untuk melepaskan hajatnya.' Dia juga tidak boleh melakukan iktikaf di atas bumbung masjid atau di menara.\"\n\nMalik berkata, \"Orang yang akan melakukan iktikaf hendaklah memasuki tempat yang dia ingin melakukan iktikaf sebelum matahari terbenam pada malam ketika dia ingin memulakan iktikafnya, supaya dia bersedia untuk memulakan iktikaf pada permulaan malam ketika dia akan memulakan iktikafnya. Seseorang yang melakukan iktikaf hendaklah sibuk dengan iktikafnya, dan tidak mengalihkan perhatiannya kepada perkara lain yang mungkin menyibukkannya, seperti perniagaan atau apa sahaja. Walau bagaimanapun, tidak mengapa jika seseorang yang melakukan iktikaf memberitahu seseorang untuk melakukan sesuatu untuknya mengenai hartanya, atau urusan keluarganya, atau memberitahu seseorang untuk menjual beberapa hartanya, atau sesuatu lain yang tidak menyibukkannya secara langsung. Tidak mengapa dia mengaturkan orang lain untuk melakukan itu untuknya jika ia adalah perkara yang mudah.\"\n\nMalik berkata, \"Saya tidak pernah mendengar mana-mana orang yang berilmu menyebut sebarang pengubahsuaian sejauh mana cara melakukan iktikaf. Iktikaf adalah ibadah seperti solat, puasa, haji, dan perbuatan-perbuatan yang seumpamanya, sama ada wajib atau sukarela. Sesiapa yang mula melakukan mana-mana perbuatan ini hendaklah melakukannya mengikut apa yang telah diturunkan dalam sunnah. Dia tidak boleh mula melakukan apa-apa di dalamnya yang tidak dilakukan oleh orang Islam, sama ada ia adalah pengubahsuaian yang dia kenakan kepada orang lain, atau yang dia mula lakukan sendiri. Rasulullah SAW mengamalkan iktikaf, dan umat Islam mengetahui apa itu sunnah iktikaf.\"\n\nMalik berkata, \"Iktikaf dan jiwar adalah sama, dan iktikaf adalah sama bagi penduduk kampung seperti halnya bagi nomad.\""
  },
  {
    "id": 34898,
    "hadith_number": 720,
    "tajuk_hadith": "Iktikaf Hanya Sah Dengan Berpuasa",
    "perawi_melayu": "Malik",
    "english_text": "Yahya related to me from Malik that he had heard that al-Qasim\nibn Muhammad and Nafi, the mawla of Abdullah ibn Umar said, \"You\ncannot do itikaf unless you are fasting, because of what Allah, the\nBlessed and Exalted, says in His Book, 'And eat and drink until the\nwhite thread becomes clear to you from the black thread of dawn, then\ncomplete the fast until night-time, and do not have intercourse with\nthem while you are doing itikaf in mosques,' (Sura 2 ayat 187). Allah\nonly mentions itikaf together with fasting.\"\n\n\nMalik said,\n\"That is what we go by here.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، وَنَافِعًا، مَوْلَى عَبْدِ اللَّهِ بْنِ عُمَرَ قَالاَ لاَ اعْتِكَافَ إِلاَّ بِصِيَامٍ بِقَوْلِ اللَّهِ تَبَارَكَ وَتَعَالَى فِي كِتَابِهِ ‏{‏وَكُلُوا وَاشْرَبُوا حَتَّى يَتَبَيَّنَ لَكُمُ الْخَيْطُ الأَبْيَضُ مِنَ الْخَيْطِ الأَسْوَدِ مِنَ الْفَجْرِ ثُمَّ أَتِمُّوا الصِّيَامَ إِلَى اللَّيْلِ وَلاَ تُبَاشِرُوهُنَّ وَأَنْتُمْ عَاكِفُونَ فِي الْمَسَاجِدِ‏}‏ فَإِنَّمَا ذَكَرَ اللَّهُ الاِعْتِكَافَ مَعَ الصِّيَامِ ‏.‏ قَالَ مَالِكٌ وَعَلَى  ذَلِكَ الأَمْرُ عِنْدَنَا أَنَّهُ لاَ اعْتِكَافَ إِلاَّ بِصِيَامٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik bahawa beliau mendengar bahawa al-Qasim ibn Muhammad dan Nafi', maula Abdullah ibn Umar, berkata, \"Tidak boleh melakukan iktikaf kecuali dengan berpuasa, kerana firman Allah, Yang Maha Berkat dan Maha Tinggi, dalam Kitab-Nya, 'Dan makan dan minumlah sehingga jelas kepada kamu benang putih dari benang hitam iaitu fajar. Kemudian sempurnakanlah puasa itu sehingga malam, dan janganlah kamu campuri mereka (isteri-isteri kamu) ketika kamu sedang beriktikaf di masjid-masjid,' (Surah al-Baqarah, ayat 187). Sesungguhnya Allah hanya menyebut iktikaf bersama dengan puasa.\"\n\nMalik berkata,\n\"Itulah yang kami amalkan di sini bahawa tidak sah iktikaf kecuali dengan berpuasa.\""
  },
  {
    "id": 34899,
    "hadith_number": 721,
    "tajuk_hadith": "Abu Bakr bin Abd ar-Rahman Melakukan I'tikaf dan Keluar untuk Hajatnya",
    "perawi_melayu": "Yahya meriwayatkan daripada Ziyad ibn Abd ar-Rahman yang berkata, \"Malik meriwayatkan kepada kami daripada Sumayy, mawla Abu Bakr ibn Abd ar-Rahman, bahawa Abu Bakr ibn Abd ar-Rahman pernah melakukan i'tikaf dan beliau akan keluar untuk membuang hajat di dalam bilik tertutup di bawah laluan beratap di rumah Khalid ibn Walid. Selain daripada itu, beliau tidak meninggalkan tempat i'tikafnya sehingga beliau pergi untuk solat Hari Raya bersama umat Islam.\"",
    "english_text": "Yahya related to me that Ziyad ibn Abd ar-Rahman said, \"Malik\nrelated to us from Sumayy, the mawla of Abu Bakr ibn Abd ar-Rahman,\nthat Abu Bakr ibn Abd ar-Rahman was once doing itikaf and he would go\nout to relieve himself in a closed room under a roofed passage in\nKhalid ibn Walid's house. Otherwise he did not leave his place of\nitikaf until he went to pray at the Id with the muslims.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ زِيَادِ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا مَالِكٌ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا بَكْرِ بْنَ عَبْدِ الرَّحْمَنِ، اعْتَكَفَ فَكَانَ يَذْهَبُ لِحَاجَتِهِ تَحْتَ سَقِيفَةٍ فِي حُجْرَةٍ مُغْلَقَةٍ فِي دَارِ خَالِدِ بْنِ الْوَلِيدِ ثُمَّ لاَ يَرْجِعُ حَتَّى يَشْهَدَ الْعِيدَ مَعَ الْمُسْلِمِينَ ‏.",
    "malay_translation": "Yahya meriwayatkan kepadaku bahawa Ziyad ibn Abd ar-Rahman berkata, \"Malik meriwayatkan kepada kami daripada Sumayy, maula Abu Bakr ibn Abd ar-Rahman, bahawa Abu Bakr ibn Abd ar-Rahman pernah melakukan i'tikaf dan beliau akan pergi untuk membuang hajatnya di bawah sebuah laluan beratap di dalam sebuah bilik berkunci di rumah Khalid ibn Walid. Kemudian beliau tidak kembali sehinggalah beliau menyaksikan (menghadiri) solat Hari Raya bersama-sama orang Muslim."
  },
  {
    "id": 34900,
    "hadith_number": 722,
    "tajuk_hadith": "Kekal di Masjid untuk Itikaf Sehingga Solat Hari Raya Aidilfitri",
    "perawi_melayu": "Yahya meriwayatkan daripada Ziyad, daripada Malik",
    "english_text": "Yahya related to me from Ziyad from Malik that he saw some of the\npeople of knowledge who, when they did itikaf in the last ten days of\nRamadan, would not go back to their families until they had attended\nthe Id al-Fitr with everybody.\n\n\nZiyad said that Malik said, \"I\nheard this from the people of excellence who have passed away, and it\nis what I like most out of what I have heard about the matter.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى عَنْ زِيَادٍ عَنْ مَالِكٍ أَنَّهُ رَأَى بَعْضَ أَهْلِ الْعِلْمِ إِذَا اعْتَكَفُوا الْعَشْرَ الأَوَاخِرَ مِنْ رَمَضَانَ لاَ يَرْجِعُونَ إِلَى أَهَالِيهِمْ حَتَّى يَشْهَدُوا الْفِطْرَ مَعَ النَّاسِ ‏.‏ قَالَ زِيَادٌ قَالَ مَالِكٌ وَبَلَغَنِي ذَلِكَ عَنْ أَهْلِ الْفَضْلِ الَّذِينَ مَضَوْا وَهَذَا أَحَبُّ مَا سَمِعْتُ إِلَىَّ فِي ذَلِكَ ‏.",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Ziyad, daripada Malik bahawa beliau melihat sebahagian daripada ahli ilmu yang, apabila mereka beriktikaf pada sepuluh hari terakhir Ramadan, tidak akan kembali kepada keluarga mereka sehingga mereka menghadiri solat Hari Raya Aidilfitri bersama orang ramai. Ziyad berkata bahawa Malik berkata, \"Aku mendengar perkara ini daripada orang-orang yang mempunyai kelebihan yang telah meninggal dunia, dan ini adalah perkara yang paling aku sukai daripada apa yang telah aku dengar tentang perkara ini.\" "
  },
  {
    "id": 34901,
    "hadith_number": 723,
    "tajuk_hadith": "Rasulullah SAW Membatalkan I'tikaf Kerana Khemah Para Isteri",
    "perawi_melayu": "Ziyad meriwayatkan daripada Malik daripada Ibn Shihab daripada Amra bint Abd ar-Rahman daripada A'isha",
    "english_text": "Ziyad related to me from Malik from Ibn Shihab from Amra bint Abd\nar-Rahman from A'isha that the Messenger of Allah, may Allah bless him\nand grant him peace, once wanted to do itikaf, and when he went off to\nthe place where he wanted to do itikaf  he found some tents there,\nwhich were A'isha's tent, Hafsa's tent, and Zaynab's tent. When he saw\nthem he asked about them and someone told him that they were the tents\nof A'isha, Hafsa and Zaynab. The Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Do you think them devout?\" Then he\nleft, and did not do itikaf until Shawwal, when he then did it for ten\ndays.",
    "arabic_text": "حَدَّثَنِي زِيَادٌ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَرَادَ أَنْ يَعْتَكِفَ فَلَمَّا انْصَرَفَ إِلَى الْمَكَانِ الَّذِي أَرَادَ أَنْ يَعْتَكِفَ فِيهِ وَجَدَ أَخْبِيَةً خِبَاءَ عَائِشَةَ وَخِبَاءَ حَفْصَةَ وَخِبَاءَ زَيْنَبَ فَلَمَّا رَآهَا سَأَلَ عَنْهَا فَقِيلَ لَهُ هَذَا خِبَاءُ عَائِشَةَ وَحَفْصَةَ وَزَيْنَبَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ آلْبِرَّ تَقُولُونَ بِهِنَّ ‏\"‏ ‏.‏ ثُمَّ انْصَرَفَ فَلَمْ يَعْتَكِفْ حَتَّى اعْتَكَفَ عَشْرًا مِنْ شَوَّالٍ ‏.‏",
    "malay_translation": "Ziyad meriwayatkan kepadaku daripada Malik daripada Ibn Shihab daripada Amra bint Abd ar-Rahman daripada A'isha bahawa Rasulullah SAW pernah berhasrat untuk melakukan i'tikaf. Apabila Baginda pergi ke tempat yang Baginda ingin beri'tikaf, Baginda mendapati beberapa khemah di sana, iaitu khemah A'isha, khemah Hafsa, dan khemah Zaynab. Apabila Baginda melihatnya, Baginda bertanya tentangnya dan seseorang memberitahu Baginda bahawa itu adalah khemah A'isha, Hafsa dan Zaynab. Rasulullah SAW bersabda, \"Adakah kamu menyangka mereka bertakwa?\" Kemudian Baginda pergi, dan tidak melakukan i'tikaf sehingga bulan Syawal, apabila Baginda melakukannya selama sepuluh hari."
  },
  {
    "id": 34902,
    "hadith_number": 724,
    "tajuk_hadith": "Menggantikan I'tikaf yang Terputus Kerana Sakit atau Haid",
    "perawi_melayu": "Malik",
    "english_text": "Malik was asked whether someone who went into a mosque to do\nitikaf for the last ten days of Ramadan and stayed there for a day or\ntwo but then became ill and left the mosque, had to do itikaf for the\nnumber of days that were left from the ten, or not, and if he did have\nto do so, then what month should he do it in, and he replied, \"He\nshould make up whatever he has to do of the itikaf when he recovers,\nwhether in Ramadan or otherwise. I have heard that the Messenger of\nAllah, may Allah bless him and grant him peace, once wanted to do\nitikaf in Ramadan, but then came back without having done so, and then\nwhen Ramadan had gone, he did itikaf for ten days in Shawwal.\n\n\nSome one who does itikaf voluntarily in Ramadan and some one who has\nto do itikaf are in the same position regarding what is halal for them\nand what is haram. I have not heard that the Messenger of Allah, may\nAllah bless him and grant him peace, ever did itikaf other than\nvoluntarily.\"\n\n\nMalik said, that if a woman did itikaf and then\nmenstruated during her itikaf, she went back to her house, and, when\nshe was pure again she returned to the mosque, at whatever time it was\nthat she became pure. She then continued her itikaf from where she\nleft off. This was the same situation as with a woman who had to fast\ntwo consecutive months, and who menstruated and then became pure. She\nthen continued the fast from where she had left off and did not delay\ndoing so.",
    "arabic_text": "",
    "malay_translation": "Malik ditanya tentang seseorang yang masuk ke masjid untuk melakukan i'tikaf pada sepuluh hari terakhir Ramadan dan tinggal di sana selama sehari atau dua hari, tetapi kemudian jatuh sakit dan meninggalkan masjid, adakah dia perlu melakukan i'tikaf untuk jumlah hari yang tinggal dari sepuluh hari itu, atau tidak. Jika dia perlu melakukannya, bulan apakah dia harus melakukannya? Malik menjawab, \"Dia harus menggantikan apa sahaja yang perlu dia lakukan dari i'tikaf apabila dia sembuh, sama ada pada bulan Ramadan atau bulan lain. Saya telah mendengar bahawa Rasulullah SAW pernah ingin melakukan i'tikaf pada bulan Ramadan, tetapi kemudian kembali tanpa melakukannya, dan kemudian apabila Ramadan telah berlalu, dia melakukan i'tikaf selama sepuluh hari pada bulan Syawal.\n\nSeseorang yang melakukan i'tikaf secara sukarela pada bulan Ramadan dan seseorang yang wajib melakukan i'tikaf berada dalam kedudukan yang sama mengenai apa yang halal bagi mereka dan apa yang haram. Saya tidak pernah mendengar bahawa Rasulullah SAW pernah melakukan i'tikaf selain daripada secara sukarela.\"\n\nMalik berkata, jika seorang wanita melakukan i'tikaf dan kemudian datang haid semasa i'tikafnya, dia kembali ke rumahnya, dan apabila dia suci semula, dia kembali ke masjid, pada bila-bila masa dia menjadi suci. Dia kemudian meneruskan i'tikafnya dari tempat dia berhenti. Ini adalah situasi yang sama seperti dengan seorang wanita yang perlu berpuasa dua bulan berturut-turut, dan yang datang haid dan kemudian menjadi suci. Dia kemudian meneruskan puasa dari tempat dia berhenti dan tidak menangguhkannya."
  },
  {
    "id": 34903,
    "hadith_number": 725,
    "tajuk_hadith": "Rasulullah SAW Menunaikan Hajat di Rumah dan Larangan Bagi yang Beriktikaf Keluar",
    "perawi_melayu": "Ziyad meriwayatkan kepadaku daripada Malik, daripada Ibn Shihab bahawa Rasulullah SAW biasa pergi menunaikan hajatnya di rumah-rumah. Malik berkata, \"Seseorang yang beriktikaf tidak boleh keluar untuk pengebumian ibu bapanya atau untuk perkara lain.\"",
    "english_text": "Ziyad related to me from Malik from Ibn Shihab that the Messenger\nof Allah, may Allah bless him and grant him peace, used to go to\nrelieve himself in houses.\n\n\nMalik said, \"Someone doing itikaf\nshould not leave for his parents' funeral or for anything else.\"",
    "arabic_text": "وَحَدَّثَنِي زِيَادٌ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، ‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَذْهَبُ لِحَاجَةِ الإِنْسَانِ فِي الْبُيُوتِ ‏.‏ قَالَ مَالِكٌ لاَ يَخْرُجُ الْمُعْتَكِفُ مَعَ جَنَازَةِ أَبَوَيْهِ وَلاَ مَعَ غَيْرِهَا ‏.‏",
    "malay_translation": "Ziyad meriwayatkan kepadaku daripada Malik, daripada Ibn Shihab bahawa Rasulullah SAW biasa pergi menunaikan hajatnya di rumah-rumah. Malik berkata, \"Seseorang yang sedang beriktikaf tidak boleh keluar untuk mengiringi jenazah ibu bapanya atau untuk urusan yang lain.\""
  },
  {
    "id": 34904,
    "hadith_number": 726,
    "tajuk_hadith": "Hukum Nikah dan Perkara yang Dilarang Semasa I'tikaf",
    "perawi_melayu": "Malik",
    "english_text": "Malik said, \"There is no harm in someone who is in itikaf\nentering into a marriage contract as long as there is no physical\nrelationship. A woman in itikaf may also be betrothed as long as there\nis no physical relationship. What is haram for someone in itikaf in\nrelation to his womenfolk during the day is haram for him during the\nnight.\"\n\n\nYahya said that Ziyad said that Malik said, \"It is\nnot halal for a man to have intercourse with his wife while he is in\nitikaf, nor for him to take pleasure in her by kissing her, or\nwhatever. However, I have not heard anyone disapproving of a man, or\nwoman, in itikaf getting married as long as there is no physical\nrelationship. Marriage is not disapproved of for someone fasting.\"\n\n\n\"There is, however, a distinction between the marriage of\nsomeone in itikaf and that of someone who is muhrim, in that some one\nwho is muhrim can eat, drink, visit the sick and attend funerals, but\ncannot put on perfume, whilst a man or woman in itikaf can put on oil\nand perfume and groom their hair, but cannot attend funerals or pray\nover the dead or visit the sick. Thus their situations with regard to\nmarriage are different.\"\n\n\n\"This is the sunna as it has come\ndown to us regarding marriage for those who are muhrim, doing itikaf,\nor fasting.",
    "arabic_text": "",
    "malay_translation": "Malik berkata, \"Tidak mengapa bagi seseorang yang berada dalam i'tikaf untuk memasuki akad nikah selagi tidak ada hubungan fizikal. Seorang wanita dalam i'tikaf juga boleh dipinang selagi tidak ada hubungan fizikal. Apa yang haram bagi seseorang dalam i'tikaf berhubung dengan kaum wanitanya pada siang hari adalah haram baginya pada waktu malam.\"\n\n\nYahya berkata bahawa Ziyad berkata bahawa Malik berkata, \"Tidak halal bagi seorang lelaki untuk melakukan persetubuhan dengan isterinya semasa dia dalam i'tikaf, mahupun untuk mengambil kesenangan daripadanya dengan menciumnya, atau apa sahaja. Walau bagaimanapun, saya tidak pernah mendengar sesiapa pun yang tidak bersetuju dengan seorang lelaki, atau wanita, dalam i'tikaf untuk berkahwin selagi tidak ada hubungan fizikal. Perkahwinan tidak dilarang bagi seseorang yang berpuasa.\"\n\n\n\"Walau bagaimanapun, terdapat perbezaan antara perkahwinan seseorang dalam i'tikaf dan seseorang yang muhrim, di mana seseorang yang muhrim boleh makan, minum, melawat orang sakit dan menghadiri pengebumian, tetapi tidak boleh memakai minyak wangi, sementara seorang lelaki atau wanita dalam i'tikaf boleh memakai minyak dan minyak wangi dan merapikan rambut mereka, tetapi tidak boleh menghadiri pengebumian atau solat jenazah atau melawat orang sakit. Oleh itu, keadaan mereka berkaitan dengan perkahwinan adalah berbeza.\"\n\n\n\"Inilah sunnah sebagaimana yang telah sampai kepada kita mengenai perkahwinan bagi mereka yang muhrim, melakukan i'tikaf, atau berpuasa."
  },
  {
    "id": 34905,
    "hadith_number": 727,
    "tajuk_hadith": "Rasulullah S.A.W. Beriktikaf dan Mencari Lailatul Qadar pada Sepuluh Hari Terakhir Ramadan",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Yazid bin Abdullah bin al-Hadi daripada Muhammad bin Ibrahim al-Harith at-Taymi daripada Abu Salama bin Abd ar-Rahman bahawa Abu Said al-Khudri berkata,",
    "english_text": "Yahya related to me from Malik from Yazid ibn Abdullah ibn al-\nHadi from Muhammad ibn Ibrahim al-Harith at-Taymi from Abu Salama ibn\nAbd ar-Rahman that Abu Said al-Khudri said, \"The Messenger of Allah,\nmay Allah bless him and grant him peace, used to do itikaf in the\nmiddle ten days of Ramadan. One year he was doing itikaf and then,\nwhen it came to the night of the twenty-first, which was the night\nbefore the morning when he would normally have finished his itikaf, he\nsaid, 'Whoever has done i'tikaf with me should continue doing itikaf\nfor the last ten days. I saw a certain night and then I was made to\nforget it. I saw myself prostrating the following morning in water and\nclay. Look for it in the last ten days, and look for it on the odd\ndays.' \"\n\n\nAbu Said continued, \"The sky poured with rain that\nnight and the mosque had a roof (made of palm fronds) and the mosque\nwas soaked. With my own eyes I saw the Messenger of Allah, may Allah\nbless him and grant him peace, leave with traces of water and clay on\nhis forehead and nose, in the morning after the night of the twenty-\nfirst.\"",
    "arabic_text": "حَدَّثَنِي زِيَادٌ، عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّهُ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَعْتَكِفُ الْعَشْرَ الْوُسُطَ مِنْ رَمَضَانَ فَاعْتَكَفَ عَامًا حَتَّى إِذَا كَانَ لَيْلَةَ إِحْدَى وَعِشْرِينَ وَهِيَ اللَّيْلَةُ الَّتِي يَخْرُجُ فِيهَا مِنْ صُبْحِهَا مِنَ اعْتِكَافِهِ قَالَ ‏\n\"‏ مَنِ اعْتَكَفَ مَعِي فَلْيَعْتَكِفِ الْعَشْرَ الأَوَاخِرَ وَقَدْ رَأَيْتُ هَذِهِ اللَّيْلَةَ ثُمَّ أُنْسِيتُهَا وَقَدْ رَأَيْتُنِي أَسْجُدُ مِنْ صُبْحِهَا فِي مَاءٍ وَطِينٍ فَالْتَمِسُوهَا فِي الْعَشْرِ الأَوَاخِرِ وَالْتَمِسُوهَا فِي كُلِّ وِتْرٍ ‏\"‏ ‏.‏ قَالَ أَبُو سَعِيدٍ فَأُمْطِرَتِ السَّمَاءُ تِلْكَ اللَّيْلَةَ وَكَانَ الْمَسْجِدُ عَلَى عَرِيشٍ فَوَكَفَ الْمَسْجِدُ - قَالَ أَبُو سَعِيدٍ - فَأَبْصَرَتْ عَيْنَاىَ رَسُولَ اللَّهِ صلى الله عليه وسلم انْصَرَفَ وَعَلَى جَبْهَتِهِ وَأَنْفِهِ أَثَرُ الْمَاءِ وَالطِّينِ مِنْ صُبْحِ لَيْلَةِ إِحْدَى وَعِشْرِينَ ‏.‏",
    "malay_translation": "\"Rasulullah SAW biasa beriktikaf pada sepuluh hari pertengahan Ramadan. Pada suatu tahun, baginda beriktikaf, dan apabila tiba malam kedua puluh satu, iaitu malam sebelum pagi di mana baginda biasanya menamatkan iktikafnya, baginda bersabda, 'Sesiapa yang telah beriktikaf bersama saya, hendaklah meneruskan iktikaf untuk sepuluh hari terakhir. Sesungguhnya aku telah melihat malam tersebut, kemudian aku dilupakan mengenainya. Aku melihat diriku sujud pada pagi berikutnya di dalam air dan lumpur. Carilah ia pada sepuluh hari terakhir, dan carilah ia pada malam-malam ganjil.'\"\n\nAbu Said meneruskan, \"Langit mencurahkan hujan pada malam itu dan masjid itu beratap (diperbuat daripada pelepah kurma) dan masjid itu basah. Dengan mata kepala saya sendiri, saya melihat Rasulullah SAW pergi dengan kesan air dan lumpur di dahi dan hidungnya, pada pagi selepas malam kedua puluh satu.\""
  },
  {
    "id": 34906,
    "hadith_number": 728,
    "tajuk_hadith": "Mencari Lailatulqadar pada Sepuluh Malam Terakhir Ramadan",
    "perawi_melayu": "Diriwayatkan daripada Ziyad, daripada Malik, daripada Hisham bin Urwa, daripada ayahnya",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي زِيَادٌ، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ تَحَرَّوْا لَيْلَةَ الْقَدْرِ فِي الْعَشْرِ الأَوَاخِرِ مِنْ رَمَضَانَ ‏\"‏ ‏.‏",
    "malay_translation": "Ziyad meriwayatkan kepadaku daripada Malik, daripada Hisham bin Urwa, daripada ayahnya, bahawa Rasulullah SAW bersabda, \"Carilah Lailatulqadar pada sepuluh malam terakhir bulan Ramadan.\""
  },
  {
    "id": 34907,
    "hadith_number": 729,
    "tajuk_hadith": "Mencari Lailatulqadar pada Tujuh Hari Terakhir",
    "perawi_melayu": "Ziyad meriwayatkan kepadaku daripada Malik daripada Abdullah ibn Dinar daripada Abdullah ibn Umar bahawa Rasulullah SAW bersabda.",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي زِيَادٌ، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ تَحَرَّوْا لَيْلَةَ الْقَدْرِ فِي السَّبْعِ الأَوَاخِرِ ‏\"‏ ‏.‏",
    "malay_translation": "\"Carilah Lailatulqadar pada tujuh hari yang terakhir.\""
  },
  {
    "id": 34908,
    "hadith_number": 730,
    "tajuk_hadith": "Malam ke-23 Ramadan: Masa untuk Beribadah",
    "perawi_melayu": "Diriwayatkan daripada Ziyad, daripada Malik, daripada Abu'n Nadr, maula Umar ibn Ubaydullah, bahawa Abdullah ibn Unays al-Juhani berkata kepada Rasulullah SAW:",
    "english_text": "Ziyad related to me from Malik from Abu'n Nadr, the mawla of Umar\nibn Ubaydullah, that Abdullah ibn Unays al-Juhani said to the\nMessenger of Allah, may Allah bless him and grant him peace,\n\"Messenger of Allah, I am a man whose house is a long way away. Tell\nme one night so that I can stop my journey for it.\" The Messenger of\nAllah, may Allah bless him and grant him peace, said, \"Stop on the\ntwenty-third night of Ramadan.\"",
    "arabic_text": "وَحَدَّثَنِي زِيَادٌ، عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ أَنَّ عَبْدَ اللَّهِ بْنَ أُنَيْسٍ الْجُهَنِيَّ، قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم يَا رَسُولَ اللَّهِ إِنِّي رَجُلٌ شَاسِعُ الدَّارِ فَمُرْنِي لَيْلَةً أَنْزِلُ لَهَا ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ انْزِلْ لَيْلَةَ ثَلاَثٍ وَعِشْرِينَ مِنْ رَمَضَانَ ‏\"‏ ‏.‏",
    "malay_translation": "\"Wahai Rasulullah, sesungguhnya aku seorang lelaki yang rumahnya jauh. Maka perintahkanlah aku satu malam untuk aku berhenti (dalam perjalananku) kerana malam itu.\" Rasulullah SAW bersabda kepadanya, \"Berhentilah pada malam ke-23 Ramadan.\""
  },
  {
    "id": 34909,
    "hadith_number": 731,
    "tajuk_hadith": "Mencari Lailatul Qadar pada Malam Ganjil di Sepuluh Malam Terakhir Ramadan",
    "perawi_melayu": "Diriwayatkan daripada Anas bin Malik RA",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي زِيَادٌ، عَنْ مَالِكٍ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي رَمَضَانَ فَقَالَ ‏\n\"‏ إِنِّي أُرِيتُ هَذِهِ اللَّيْلَةَ فِي رَمَضَانَ حَتَّى تَلاَحَى رَجُلاَنِ فَرُفِعَتْ فَالْتَمِسُوهَا فِي التَّاسِعَةِ وَالسَّابِعَةِ وَالْخَامِسَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Ziyad meriwayatkan kepadaku daripada Malik, daripada Humaid at-Tawil, daripada Anas bin Malik, bahawa beliau berkata, \"Rasulullah SAW keluar kepada kami pada bulan Ramadan dan bersabda, 'Sesungguhnya aku diperlihatkan malam ini (Lailatul Qadar) dalam bulan Ramadan sehingga dua orang lelaki bertengkar, lalu (pengetahuan tentang) malam itu diangkat (daripada aku). Maka carilah ia pada malam ke-29, 27 dan 25 (dari bulan Ramadan).'"
  },
  {
    "id": 34910,
    "hadith_number": 732,
    "tajuk_hadith": "Mencari Lailatul Qadar pada Tujuh Hari Terakhir Ramadan",
    "perawi_melayu": "Diriwayatkan dari Ziyad, dari Malik, dari Nafi', dari Ibn 'Umar",
    "english_text": "Ziyad related to me from Malik from Nafi from Ibn 'Umar that\nsome of the companions of the Messenger of Allah, may Allah bless him\nand grant him peace, were shown Laylat al-Qadr in their sleep during\nthe last seven days. The Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"I see that your visions agree about the last\nseven days, so whoever is searching for it should do so in the last\nseven days.\"",
    "arabic_text": "وَحَدَّثَنِي زِيَادٌ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رِجَالاً، مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم أُرُوا لَيْلَةَ الْقَدْرِ فِي الْمَنَامِ فِي السَّبْعِ الأَوَاخِرِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنِّي أَرَى رُؤْيَاكُمْ قَدْ تَوَاطَأَتْ فِي السَّبْعِ الأَوَاخِرِ فَمَنْ كَانَ مُتَحَرِّيَهَا فَلْيَتَحَرَّهَا فِي السَّبْعِ الأَوَاخِرِ ‏\"‏ ‏.‏",
    "malay_translation": "Ziyad meriwayatkan kepadaku dari Malik dari Nafi' dari Ibn 'Umar bahawa beberapa orang sahabat Rasulullah SAW telah diperlihatkan Lailatul Qadar dalam mimpi mereka pada tujuh hari terakhir (Ramadan). Rasulullah SAW bersabda, \"Aku melihat bahawa penglihatan kamu semua bersepakat tentang tujuh hari terakhir, maka sesiapa yang ingin mencarinya, hendaklah dia mencarinya pada tujuh hari terakhir.\""
  },
  {
    "id": 34911,
    "hadith_number": 733,
    "tajuk_hadith": "Kelebihan Malam Lailatul Qadar bagi Umat Nabi Muhammad SAW",
    "perawi_melayu": "Ziyad meriwayatkan daripada Malik",
    "english_text": "Ziyad related to me from Malik that he had heard a man he trusted\nof the people of knowledge say, \"The Messenger of Allah, may Allah\nbless him and grant him peace, was shown the lifespans of the people\n(who had gone) before him, or what Allah willed of that, and it was as\nif the lives of the people of his community had become too short for\nthem to be able to do as many good actions as others before them had\nbeen able to do with their long lives, so Allah gave him Laylat al-\nQadr, which is better than a thousand months.\"",
    "arabic_text": "وَحَدَّثَنِي زِيَادٌ، عَنْ مَالِكٍ، أَنَّهُ سَمِعَ مَنْ، يَثِقُ بِهِ مِنْ أَهْلِ الْعِلْمِ يَقُولُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أُرِيَ أَعْمَارَ النَّاسِ قَبْلَهُ أَوْ مَا شَاءَ اللَّهُ مِنْ ذَلِكَ فَكَأَنَّهُ تَقَاصَرَ أَعْمَارَ أُمَّتِهِ أَنْ لاَ يَبْلُغُوا مِنَ الْعَمَلِ مِثْلَ الَّذِي بَلَغَ غَيْرُهُمْ فِي طُولِ الْعُمْرِ فَأَعْطَاهُ اللَّهُ لَيْلَةَ الْقَدْرِ خَيْرٌ مِنْ أَلْفِ شَهْرٍ ‏.‏",
    "malay_translation": "Ziyad meriwayatkan kepadaku daripada Malik bahawa beliau mendengar seorang lelaki yang dipercayainya daripada kalangan ahli ilmu berkata, \"Sesungguhnya Rasulullah SAW diperlihatkan umur umat-umat terdahulu, atau apa yang Allah kehendaki dari hal tersebut. Maka seolah-olah umur umatnya menjadi pendek sehingga mereka tidak dapat mencapai amalan seperti yang dicapai oleh umat-umat lain dengan umur yang panjang. Lalu Allah memberikan baginda Lailatul Qadar yang lebih baik daripada seribu bulan."
  },
  {
    "id": 34912,
    "hadith_number": 734,
    "tajuk_hadith": "Keutamaan Menghadiri Isyak pada Malam Lailatulqadar",
    "perawi_melayu": "Diriwayatkan daripada Ziyad, daripada Malik, bahawa beliau mendengar Said ibn al-Musayyab berkata,",
    "english_text": "Ziyad related to me from Malik that he had heard that Said ibn\nal-Musayyab used to say, \"Whoever is present at isha on Laylat al-Qadr\nhas taken his portion from it.\"",
    "arabic_text": "وَحَدَّثَنِي زِيَادٌ، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، كَانَ يَقُولُ مَنْ شَهِدَ الْعِشَاءَ مِنْ لَيْلَةِ الْقَدْرِ فَقَدْ أَخَذَ بِحَظِّهِ مِنْهَا ‏.‏",
    "malay_translation": "\"Sesiapa yang hadir solat Isyak pada malam Lailatulqadar, maka dia telah mengambil bahagiannya daripada malam tersebut.\""
  }
]