[
  {
    "id": 35295,
    "hadith_number": 1117,
    "tajuk_hadith": "Aqiqah: Sunnah Nabi SAW",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Zayd bin Aslam, dari seorang lelaki daripada Bani Damrah daripada bapanya",
    "english_text": "Yahya related to me from Zayd ibn Aslam from a man of the Banu\nDamra that his father said, \"The Messenger of Allah, may Allah bless\nhim and grant him peace, was asked about the Aqiqa. He said, 'I do not\nlike disobedience (uquq),' as if he disliked the name. He said, 'If\nanyone has a child born to him, and wants to sacrifice for his child,\nthen let him do it.' \"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ رَجُلٍ، مِنْ بَنِي ضَمْرَةَ عَنْ أَبِيهِ، أَنَّهُ قَالَ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْعَقِيقَةِ فَقَالَ ‏\"‏ لاَ أُحِبُّ الْعُقُوقَ ‏\"‏ ‏.‏ وَكَأَنَّهُ إِنَّمَا كَرِهَ الاِسْمَ وَقَالَ ‏\"‏ مَنْ وُلِدَ لَهُ وَلَدٌ فَأَحَبَّ أَنْ يَنْسُكَ عَنْ وَلَدِهِ فَلْيَفْعَلْ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Zayd bin Aslam, dari seorang lelaki daripada Bani Damrah daripada bapanya bahawa Rasulullah SAW ditanya tentang aqiqah. Baginda SAW bersabda,  \"Aku tidak suka kepada uquq.\"  Seakan-akan Baginda tidak menyukai nama itu. Baginda SAW bersabda, \"Barangsiapa yang dikurniakan anak dan ingin berkorban untuk anaknya, maka hendaklah dia berbuat demikian.\""
  },
  {
    "id": 35296,
    "hadith_number": 1118,
    "tajuk_hadith": "Sedekah Fatimah berdasarkan Berat Rambut Anak-anaknya",
    "perawi_melayu": "Yahya melalui Malik daripada Jaafar bin Muhammad daripada bapanya",
    "english_text": "Yahya related to me from Malik from Jafar ibn Muhammad that his\nfather said, \"Fatima, the daughter of the Messenger of Allah, may\nAllah bless him and grant him peace, weighed the hair of Hasan,\nHusayn, Zaynab and Umm Kulthum, and gave away in sadaqa an equivalent\nweight of silver.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، أَنَّهُ قَالَ وَزَنَتْ فَاطِمَةُ بِنْتُ رَسُولِ اللَّهِ صلى الله عليه وسلم شَعَرَ حَسَنٍ وَحُسَيْنٍ وَزَيْنَبَ وَأُمِّ كُلْثُومٍ فَتَصَدَّقَتْ بِزِنَةِ ذَلِكَ فِضَّةً ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Jaafar bin Muhammad, daripada bapanya, bahawa bapanya berkata: \"Fatimah, puteri Rasulullah SAW telah menimbang rambut Hasan, Husain, Zainab dan Ummu Kulthum, kemudian dia bersedekah dengan berat perak yang sama banyaknya.\""
  },
  {
    "id": 35297,
    "hadith_number": 1119,
    "tajuk_hadith": "Fatimah Menyedekah Berat Rambut Hasan dan Husain",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Rabi'ah bin Abi Abdur Rahman, daripada Muhammad bin Ali bin al-Husain",
    "english_text": "Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman\nthat Muhammad ibn Ali ibn al-Husayn said, \"Fatima, the daughter of the\nMessenger of Allah, may Allah bless him and grant him peace, weighed\nthe hair of Hasan and Husayn, and gave away in sadaqa the equivalent\nweight in silver.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ، أَنَّهُ قَالَ وَزَنَتْ فَاطِمَةُ بِنْتُ رَسُولِ اللَّهِ صلى الله عليه وسلم شَعَرَ حَسَنٍ وَحُسَيْنٍ فَتَصَدَّقَتْ بِزِنَتِهِ فِضَّةً ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Rabi’ah bin Abi Abdur Rahman, daripada Muhammad bin Ali bin al-Husain, bahawa baginda berkata: Fatimah, anak perempuan Rasulullah SAW, telah menimbang rambut Hasan dan Husain, kemudian menyedekahkan perak seberat rambut mereka."
  },
  {
    "id": 35298,
    "hadith_number": 1120,
    "tajuk_hadith": "Aqiqah Abdullah bin Umar",
    "perawi_melayu": "Yahya daripada Malik daripada Nafi'",
    "english_text": "Yahya related to me from Malik from Nafi that if any of Abdullah\nibn Umar's family asked him for an aqiqa, he would give it to them. He\ngave a sheep as aqiqa for both his male and female children.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، لَمْ يَكُنْ يَسْأَلُهُ أَحَدٌ مِنْ أَهْلِهِ عَقِيقَةً إِلاَّ أَعْطَاهُ إِيَّاهَا وَكَانَ يَعُقُّ عَنْ وَلَدِهِ بِشَاةٍ شَاةٍ عَنِ الذُّكُورِ وَالإِنَاثِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Nafi', bahawa Abdullah bin Umar, jika ada seorang pun daripada keluarganya meminta aqiqah darinya, nescaya dia akan memberikannya. Dan dia biasa menyembelih seekor kambing sebagai aqiqah bagi anak lelakinya dan anak perempuannya."
  },
  {
    "id": 35299,
    "hadith_number": 1121,
    "tajuk_hadith": "Aqiqah Walaupun Hanya Seekor Burung",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Rabi’ah bin Abi Abdur Rahman, daripada Muhammad bin Ibrahim bin al-Harith at-Taymi",
    "english_text": "Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman\nthat Muhammad ibn Ibrahim ibn al-Harith at-Taymi said, \"I heard my\nfather say that the aqiqa was desirable, even if it was only a\nsparrow.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، أَنَّهُ قَالَ سَمِعْتُ أَبِي يَسْتَحِبُّ الْعَقِيقَةَ، وَلَوْ بِعُصْفُورٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Rabi’ah bin Abi Abdur Rahman, daripada Muhammad bin Ibrahim bin al-Harith at-Taymi, bahawa baginda berkata: \"Aku mendengar bapaku mengatakan bahawa aqiqah itu sunat, walaupun hanya seekor burung.\""
  },
  {
    "id": 35300,
    "hadith_number": 1122,
    "tajuk_hadith": "Aqiqah untuk Hasan dan Husain",
    "perawi_melayu": "Yahya daripada Malik",
    "english_text": "Yahya related to me from Malik that he heard that there had been\nan aqiqa for Hasan and Husayn, the sons of Ali ibn Abi Talib.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّهُ عُقَّ عَنْ حَسَنٍ، وَحُسَيْنٍ، ابْنَىْ عَلِيِّ بْنِ أَبِي طَالِبٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa baginda telah diberitahu bahawa telah diadakan aqiqah untuk Hasan dan Husain, anakanda Ali bin Abi Talib."
  },
  {
    "id": 35301,
    "hadith_number": 1123,
    "tajuk_hadith": "Aqiqah untuk Anak Lelaki dan Perempuan",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Hisyam bin Urwah",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، أَنَّ أَبَاهُ، عُرْوَةَ بْنَ الزُّبَيْرِ كَانَ يَعُقُّ عَنْ بَنِيهِ الذُّكُورِ، وَالإِنَاثِ، بِشَاةٍ شَاةٍ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِي الْعَقِيقَةِ أَنَّ مَنْ عَقَّ فَإِنَّمَا يَعُقُّ عَنْ وَلَدِهِ بِشَاةٍ شَاةٍ الذُّكُورِ وَالإِنَاثِ وَلَيْسَتِ الْعَقِيقَةُ بِوَاجِبَةٍ وَلَكِنَّهَا يُسْتَحَبُّ الْعَمَلُ بِهَا وَهِيَ مِنَ الأَمْرِ الَّذِي لَمْ يَزَلْ عَلَيْهِ النَّاسُ عِنْدَنَا فَمَنْ عَقَّ عَنْ وَلَدِهِ فَإِنَّمَا هِيَ بِمَنْزِلَةِ النُّسُكِ وَالضَّحَايَا لاَ يَجُوزُ فِيهَا عَوْرَاءُ وَلاَ عَجْفَاءُ وَلاَ مَكْسُورَةٌ وَلاَ مَرِيضَةٌ وَلاَ يُبَاعُ مِنْ لَحْمِهَا شَىْءٌ وَلاَ جِلْدُهَا وَيُكْسَرُ عِظَامُهَا وَيَأْكُلُ أَهْلُهَا مِنْ لَحْمِهَا وَيَتَصَدَّقُونَ مِنْهَا وَلاَ يُمَسُّ الصَّبِيُّ بِشَىْءٍ مِنْ دَمِهَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Hisyam bin Urwah bahawa bapanya, Urwah bin Zubair, telah melakukan aqiqah untuk anak-anak lelakinya dan perempuannya, seekor kambing untuk setiap seorang.\n\nMalik berkata, \"Hukum di sisi kami tentang aqiqah ialah, sesiapa yang melakukan aqiqah, maka dia hanya melakukan aqiqah untuk anaknya dengan seekor kambing, sama ada anak lelaki atau perempuan. Aqiqah bukanlah wajib, tetapi ia adalah sunat untuk melakukannya, dan ia adalah perkara yang sentiasa dilakukan oleh orang ramai di sisi kami.  Oleh itu, sesiapa yang melakukan aqiqah untuk anaknya, maka ia seperti hukum binatang sembelihan dan korban, iaitu tidak dibenarkan menggunakan haiwan yang buta sebelah mata, kurus, patah kaki, atau sakit.  Daging dan kulitnya tidak boleh dijual. Tulang-tulang haiwan itu dipecahkan, dan keluarganya memakan dagingnya dan sebahagiannya disedekahkan.  Bayi tidak disentuh dengan darahnya.\""
  }
]