[
  {
    "id": 34403,
    "hadith_number": 225,
    "tajuk_hadith": "Ganjaran Datang Awal ke Solat Jumaat",
    "perawi_melayu": "Abu Hurairah (RA)",
    "english_text": "Yahya related to me from Malik from Sumayy, the mawla of Abu Bakr ibn Abd ar-Rahman, from Abu Salih as-Sammani from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"If someone does ghusl for major ritual impurity on the day of jumua and then goes in the first part of the time, it is as if he had offered up a camel. If he goes in the second part of the time, it is as if he had offered up a cow. If he goes in the third part of the time, it is as if he had offered up a horned ram. If he goes in the fourth part of the time, it is as if he had offered up a hen. If he goes in the fifth part of the time, it is as if he had offered up an egg. And when the imam comes out, the angels settle down listening to the dhikr (remembrance of Allah).\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنِ اغْتَسَلَ يَوْمَ الْجُمُعَةِ غُسْلَ الْجَنَابَةِ ثُمَّ رَاحَ فِي السَّاعَةِ الأُولَى فَكَأَنَّمَا قَرَّبَ بَدَنَةً وَمَنْ رَاحَ فِي السَّاعَةِ الثَّانِيَةِ فَكَأَنَّمَا قَرَّبَ بَقَرَةً وَمَنْ رَاحَ فِي السَّاعَةِ الثَّالِثَةِ فَكَأَنَّمَا قَرَّبَ كَبْشًا أَقْرَنَ وَمَنْ رَاحَ فِي السَّاعَةِ الرَّابِعَةِ فَكَأَنَّمَا قَرَّبَ دَجَاجَةً وَمَنْ رَاحَ فِي السَّاعَةِ الْخَامِسَةِ فَكَأَنَّمَا قَرَّبَ بَيْضَةً فَإِذَا خَرَجَ الإِمَامُ حَضَرَتِ الْمَلاَئِكَةُ يَسْتَمِعُونَ الذِّكْرَ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Sumayy, mawla Abu Bakr bin Abd ar-Rahman, daripada Abu Salih as-Sammani daripada Abu Hurairah bahawa Rasulullah SAW bersabda: \"Sesiapa yang mandi pada hari Jumaat seperti mandi junub, kemudian pergi (ke masjid) pada waktu yang pertama, seolah-olah dia telah mengorbankan seekor unta. Jika dia pergi pada waktu kedua, seolah-olah dia telah mengorbankan seekor lembu. Jika dia pergi pada waktu ketiga, seolah-olah dia telah mengorbankan seekor kambing yang bertanduk. Jika dia pergi pada waktu keempat, seolah-olah dia telah mengorbankan seekor ayam. Jika dia pergi pada waktu kelima, seolah-olah dia telah mengorbankan sebiji telur. Dan apabila imam keluar (untuk khutbah), para malaikat akan hadir dan mendengar zikir (peringatan kepada Allah).\""
  },
  {
    "id": 34404,
    "hadith_number": 226,
    "tajuk_hadith": "Kewajipan Mandi pada Hari Jumaat",
    "perawi_melayu": "Said ibn Abi Said al-Maqburi, daripada Abu Hurayra",
    "english_text": "Yahya related to me from Malik from Said ibn Abi Said al-Maqburi\nthat Abu Hurayra used to say, \"Doing ghusl as prescribed for major\nritual impurity is incumbent (wajib) on the day of jumua on every male\nwho has reached puberty.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ كَانَ يَقُولُ غُسْلُ يَوْمِ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ كَغُسْلِ الْجَنَابَةِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik, daripada Said ibn Abi Said al-Maqburi bahawa Abu Hurayra berkata, \"Mandi pada hari Jumaat adalah wajib ke atas setiap lelaki yang telah baligh, seperti mandi junub."
  },
  {
    "id": 34405,
    "hadith_number": 227,
    "tajuk_hadith": "Kedatangan Terlewat ke Solat Jumaat dan Nasihat Umar",
    "perawi_melayu": "Salim ibn Abdullah",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ قَالَ دَخَلَ رَجُلٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم الْمَسْجِدَ يَوْمَ الْجُمُعَةِ وَعُمَرُ بْنُ الْخَطَّابِ يَخْطُبُ فَقَالَ عُمَرُ أَيَّةُ سَاعَةٍ هَذِهِ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ انْقَلَبْتُ مِنَ السُّوقِ فَسَمِعْتُ النِّدَاءَ فَمَا زِدْتُ عَلَى أَنْ تَوَضَّأْتُ ‏.‏ فَقَالَ عُمَرُ وَالْوُضُوءَ أَيْضًا وَقَدْ عَلِمْتَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَأْمُرُ بِالْغُسْلِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Ibn Shihab bahawa Salim ibn Abdullah berkata, \"Seorang sahabat Rasulullah ﷺ datang ke masjid pada hari Jumaat, dan Umar ibn al-Khattab sedang menyampaikan khutbah. Umar berkata, 'Waktu apakah ini (untuk tiba)?' Dia berkata, 'Wahai Amir al-Mu'minin, saya pulang dari pasar dan mendengar azan, jadi saya hanya berwudhu.' Umar berkata, 'Kamu hanya berwudhu sahaja? Kamu tahu bahawa Rasulullah ﷺ selalu menyuruh orang untuk mandi (ghusl).\""
  },
  {
    "id": 34406,
    "hadith_number": 228,
    "tajuk_hadith": "Kewajipan Mandi pada Hari Jumaat",
    "perawi_melayu": "Abu Said al-Khudri",
    "english_text": "Yahya related to me from Malik from Safwan ibn Sulaym from Ata\nibn Yasar from Abu Said al-Khudri that the Messenger of Allah, may\nAllah bless him and grant him peace, said, \"Ghusl on the day of jumua\nis incumbent on every male who has reached puberty.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ غُسْلُ يَوْمِ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Safwan ibn Sulaym, daripada Ata' ibn Yasar, daripada Abu Said al-Khudri bahawa Rasulullah SAW bersabda, \"Ghusl (mandi) pada hari Jumaat adalah wajib ke atas setiap lelaki yang telah baligh.\""
  },
  {
    "id": 34407,
    "hadith_number": 229,
    "tajuk_hadith": "Mandi Jumaat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا جَاءَ أَحَدُكُمُ الْجُمُعَةَ فَلْيَغْتَسِلْ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku daripada Malik, daripada Nafi', daripada Ibn Umar, bahawa Rasulullah SAW bersabda: \"Apabila salah seorang daripada kamu hendak menunaikan solat Jumaat, maka hendaklah dia mandi.\" Malik berkata, \"Tidak mencukupi bagi seseorang itu untuk melakukan ghusl pada hari Jumaat dan berniat dengannya ghusl Jumaat melainkan dia melakukan ghusl dan kemudian keluar. Ini kerana Rasulullah SAW bersabda dalam hadis yang diriwayatkan oleh Ibn Umar, 'Apabila kamu datang untuk Jumaat, maka mandilah.'\" Malik berkata, \"Jika seseorang itu melakukan ghusl pada hari Jumaat dan berniat dengannya ghusl pada hari Jumaat dan kemudian keluar, sama ada awal atau lewat, dan melakukan sesuatu yang membatalkan wudunya, dia hanya perlu berwudhu dan ghuslnya tetap sah baginya.\""
  },
  {
    "id": 34408,
    "hadith_number": 230,
    "tajuk_hadith": "Larangan Bercakap Ketika Khutbah Jumaat",
    "perawi_melayu": "Abu Hurairah رضي الله عنه",
    "english_text": "Yahya related to me from Malik from Abu'z Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Even saying to your companion 'Listen' while the\nimam is giving the khutba on the day of jumua, is to speak foolishly.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا قُلْتَ لِصَاحِبِكَ أَنْصِتْ وَالإِمَامُ يَخْطُبُ يَوْمَ الْجُمُعَةِ فَقَدْ لَغَوْتَ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Abu'z Zinad daripada al-Araj daripada Abu Hurairah رضي الله عنه bahawa Rasulullah ﷺ bersabda: \"Apabila engkau berkata kepada sahabatmu, 'Dengar!' sedangkan imam sedang berkhutbah pada hari Jumaat, maka sesungguhnya engkau telah melakukan perbuatan sia-sia.\""
  },
  {
    "id": 34409,
    "hadith_number": 231,
    "tajuk_hadith": "Adab Mendengar Khutbah Jumaat di Zaman Umar bin al-Khattab",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ ثَعْلَبَةَ بْنِ أَبِي مَالِكٍ الْقُرَظِيِّ، أَنَّهُ أَخْبَرَهُ أَنَّهُمْ، كَانُوا فِي زَمَانِ عُمَرَ بْنِ الْخَطَّابِ يُصَلُّونَ يَوْمَ الْجُمُعَةِ حَتَّى يَخْرُجَ عُمَرُ فَإِذَا خَرَجَ عُمَرُ وَجَلَسَ عَلَى الْمِنْبَرِ وَأَذَّنَ الْمُؤَذِّنُونَ - قَالَ ثَعْلَبَةُ - جَلَسْنَا نَتَحَدَّثُ فَإِذَا سَكَتَ الْمُؤَذِّنُونَ وَقَامَ عُمَرُ يَخْطُبُ أَنْصَتْنَا فَلَمْ يَتَكَلَّمْ مِنَّا أَحَدٌ ‏.‏ قَالَ ابْنُ شِهَابٍ فَخُرُوجُ الإِمَامِ يَقْطَعُ الصَّلاَةَ وَكَلاَمُهُ يَقْطَعُ الْكَلاَمَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik daripada Ibn Shihab bahawa Thalaba ibn Abi Malik al Quradhi memaklumkan kepadanya bahawa pada zaman Umar ibn al Khattab mereka pernah menunaikan solat pada hari Jumaat sehinggalah Umar keluar. Apabila Umar keluar dan duduk di atas mimbar dan muadzin melaungkan azan, mereka duduk dan berbual. Kemudian, apabila muadzin berdiam diri dan Umar berdiri untuk menyampaikan khutbah, mereka menumpukan perhatian dan tiada seorang pun yang bercakap. Ibn Shihab berkata, \"Keluarnya imam memberhentikan solat dan percakapannya memberhentikan perbualan.\""
  },
  {
    "id": 34410,
    "hadith_number": 232,
    "tajuk_hadith": "Perintah Uthman ibn Affan untuk Mendengar Khutbah dan Meluruskan Saf",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ مَالِكِ بْنِ أَبِي عَامِرٍ، أَنَّ عُثْمَانَ بْنَ عَفَّانَ، كَانَ يَقُولُ فِي خُطْبَتِهِ قَلَّمَا يَدَعُ ذَلِكَ إِذَا خَطَبَ إِذَا قَامَ الإِمَامُ يَخْطُبُ يَوْمَ الْجُمُعَةِ فَاسْتَمِعُوا وَأَنْصِتُوا فَإِنَّ لِلْمُنْصِتِ الَّذِي لاَ يَسْمَعُ مِنَ الْحَظِّ مِثْلَ مَا لِلْمُنْصِتِ السَّامِعِ فَإِذَا قَامَتِ الصَّلاَةُ فَاعْدِلُوا الصُّفُوفَ وَحَاذُوا بِالْمَنَاكِبِ فَإِنَّ اعْتِدَالَ الصُّفُوفِ مِنْ تَمَامِ الصَّلاَةِ ‏.‏ ثُمَّ لاَ يُكَبِّرُ حَتَّى يَأْتِيَهُ رِجَالٌ قَدْ وَكَّلَهُمْ بِتَسْوِيَةِ الصُّفُوفِ فَيُخْبِرُونَهُ أَنْ قَدِ اسْتَوَتْ فَيُكَبِّرُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Abu'n Nadr, mawla Umar ibn Ubaydullah, daripada Malik ibn Abi Amir bahawa Uthman ibn Affan berkata dalam khutbahnya, dan jarang sekali beliau meninggalkannya jika berkhutbah, \"Apabila imam berdiri menyampaikan khutbah pada hari Jumaat, dengarlah dan perhatikanlah, kerana bagi orang yang mendengar tetapi tidak dapat mendengar mempunyai bahagian yang sama dengan orang yang memberi perhatian dan mendengar. Dan apabila iqamat solat dilaungkan, luruskan saf-saf kamu dan rapatkan bahu kamu antara satu sama lain, kerana meluruskan saf adalah sebahagian daripada kesempurnaan solat.\" Kemudian beliau tidak akan mengucapkan takbir sehingga beberapa orang yang telah diamanahkan untuk meluruskan saf datang dan memberitahunya bahawa saf-saf telah lurus. Kemudian beliau mengucapkan takbir."
  },
  {
    "id": 34411,
    "hadith_number": 233,
    "tajuk_hadith": "Abdullah bin Umar Memerintah Diam Semasa Khutbah Jumaat",
    "perawi_melayu": "Malik daripada Nafi daripada Abdullah bin Umar",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaw two men talking while the imam was giving the khutba on the day of\njumua and he threw pebbles at them to tell them to be quiet.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، رَأَى رَجُلَيْنِ يَتَحَدَّثَانِ وَالإِمَامُ يَخْطُبُ يَوْمَ الْجُمُعَةِ فَحَصَبَهُمَا أَنِ اصْمُتَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Nafi bahawa Abdullah bin Umar melihat dua orang lelaki bercakap-cakap semasa imam sedang menyampaikan khutbah pada hari Jumaat, lalu beliau membaling mereka dengan kerikil untuk menyuruh mereka diam."
  },
  {
    "id": 34412,
    "hadith_number": 234,
    "tajuk_hadith": "Larangan Berdoa Ketika Khutbah Jumaat",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik that he had heard that a man\nsneezed on the day of jumua while the imam was giving the khutba, and\na man by his side asked Allah to bless him. Said ibn al Musayyab was\nasked about it and he forbade the man to do what he had done and said,\n\"Don't do it again.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَجُلاً، عَطَسَ يَوْمَ الْجُمُعَةِ وَالإِمَامُ يَخْطُبُ فَشَمَّتَهُ إِنْسَانٌ إِلَى جَنْبِهِ فَسَأَلَ عَنْ ذَلِكَ سَعِيدَ بْنَ الْمُسَيَّبِ فَنَهَاهُ عَنْ ذَلِكَ وَقَالَ لاَ تَعُدْ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa dia telah mendengar bahawa seorang lelaki bersin pada hari Jumaat semasa imam sedang menyampaikan khutbah, dan seorang lelaki di sebelahnya meminta Allah memberkatinya. Said ibn al-Musayyab ditanya mengenai hal itu dan dia melarang lelaki itu daripada melakukan apa yang telah dilakukannya dan berkata, \"Jangan lakukan lagi.\""
  },
  {
    "id": 34413,
    "hadith_number": 235,
    "tajuk_hadith": "Hukum Berbicara Selepas Imam Turun dari Mimbar Sebelum Takbir",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik that he asked Ibn Shihab about\ntalking in the jumua after the imam had come down from the mimbar but\nbefore he had said the takbir. Ibn Shihab said, \"There is no harm in\nthat.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنِ الْكَلاَمِ، يَوْمَ الْجُمُعَةِ إِذَا نَزَلَ الإِمَامُ عَنِ الْمِنْبَرِ، قَبْلَ أَنْ يُكَبِّرَ، ‏.‏ فَقَالَ ابْنُ شِهَابٍ لاَ بَأْسَ بِذَلِكَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa dia bertanya kepada Ibn Shihab tentang bercakap dalam solat Jumaat selepas imam turun dari mimbar tetapi sebelum dia mengucapkan takbir. Ibn Shihab berkata, \"Tiada masalah dalam hal itu.\""
  },
  {
    "id": 34414,
    "hadith_number": 236,
    "tajuk_hadith": "Sesiapa yang Mendapatkan Satu Rakaat Solat Jumaat",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ كَانَ يَقُولُ مَنْ أَدْرَكَ مِنْ صَلاَةِ الْجُمُعَةِ رَكْعَةً فَلْيُصَلِّ إِلَيْهَا أُخْرَى ‏.‏ قَالَ ابْنُ شِهَابٍ وَهِيَ السُّنَّةُ ‏.‏ قَالَ مَالِكٌ وَعَلَى ذَلِكَ أَدْرَكْتُ أَهْلَ الْعِلْمِ بِبَلَدِنَا وَذَلِكَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ أَدْرَكَ مِنَ الصَّلاَةِ رَكْعَةً فَقَدْ أَدْرَكَ الصَّلاَةَ ‏\"‏ ‏.‏ قَالَ مَالِكٌ فِي الَّذِي يُصِيبُهُ زِحَامٌ يَوْمَ الْجُمُعَةِ فَيَرْكَعُ وَلاَ يَقْدِرُ عَلَى أَنْ يَسْجُدَ حَتَّى يَقُومَ الإِمَامُ أَوْ يَفْرُغَ الإِمَامُ مِنْ صَلاَتِهِ إِنَّهُ إِنْ قَدَرَ عَلَى أَنْ يَسْجُدَ إِنْ كَانَ قَدْ رَكَعَ فَلْيَسْجُدْ إِذَا قَامَ النَّاسُ وَإِنْ لَمْ يَقْدِرْ عَلَى أَنْ يَسْجُدَ حَتَّى يَفْرُغَ الإِمَامُ مِنْ صَلاَتِهِ فَإِنَّهُ أَحَبُّ إِلَىَّ أَنْ يَبْتَدِئَ صَلاَتَهُ ظُهْرًا أَرْبَعًا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik, daripada Ibn Shihab, bahawa dia berkata: \"Sesiapa yang sempat melakukan satu rakaat daripada solat Jumaat, hendaklah dia menambah satu lagi rakaat.\" Ibn Shihab berkata, \"Itulah sunnah.\" Malik berkata, \"Saya dapati ahli ilmu di bandar kami melakukan demikian. Hal ini kerana Rasulullah ﷺ bersabda: 'Sesiapa yang sempat melakukan satu rakaat daripada solat, maka sesungguhnya dia telah mendapat solat.' \" Malik berkata mengenai seseorang yang berada dalam kesesakan pada hari Jumaat lalu rukuk tetapi tidak dapat sujud sehingga imam bangun atau imam selesai solatnya: \"Jika dia dapat sujud dan telah rukuk, maka hendaklah dia sujud apabila orang ramai bangun. Jika dia tidak dapat sujud sehingga imam selesai solatnya, maka saya lebih suka dia memulakan solatnya dengan empat rakaat Zuhur.\""
  },
  {
    "id": 34415,
    "hadith_number": 237,
    "tajuk_hadith": "Hukum Orang yang Berdarah Hidung ketika Khutbah Jumaat",
    "perawi_melayu": "Imam Malik",
    "english_text": "Malik said, \"Someone who has a nosebleed on the day of jumua\nwhile the imam is giving the khutba and he leaves and does not come\nback until the imam has finished the prayer, should pray four rakas.''\n\n\nMalik said that someone who prayed a raka with the imam on\nthe day of jumua, then had a nosebleed and left and came back and the\nimam had prayed both rakas, should complete the prayer with another\nraka as long as he had not spoken.\n\n\nMalik said, \"If some one\nhas a nosebleed, or something happens to him and he has no alternative\nbut to leave, he does not have to ask permission of the imam if he\nwants to leave on the day of jumua.\"",
    "arabic_text": "",
    "malay_translation": "Malik berkata, \"Sesiapa yang mengalami pendarahan hidung pada hari Jumaat ketika imam sedang menyampaikan khutbah, lalu dia meninggalkan (masjid) dan tidak kembali sehingga imam selesai solat, hendaklah dia menunaikan solat empat rakaat.\"\n\nMalik berkata bahawa sesiapa yang bersolat satu rakaat bersama imam pada hari Jumaat, kemudian mengalami pendarahan hidung dan meninggalkan (masjid) dan kembali semula dan imam telah menunaikan kedua-dua rakaat, hendaklah dia menyempurnakan solat dengan satu lagi rakaat selagi dia tidak bercakap.\n\nMalik berkata, \"Jika seseorang mengalami pendarahan hidung, atau sesuatu berlaku kepadanya dan dia tiada pilihan lain selain untuk meninggalkan (masjid), dia tidak perlu meminta izin daripada imam jika dia ingin keluar pada hari Jumaat.\""
  },
  {
    "id": 34416,
    "hadith_number": 238,
    "tajuk_hadith": "Maksud 'Bersegera' dalam Surah Al-Jumu'ah",
    "perawi_melayu": "Yahya, dari Malik",
    "english_text": "Yahya related to me from Malik that he had asked Ibn Shihab about\nthe word of Allah, the Majestic, the Mighty, \"O you who accept, when\nthe call is made for the prayer on the day of jumua, make haste to the\nremembrance of Allah.\"(Sura 62 ayat 9). Ibn Shihab said, ''Umar ibn\nal-Khattab used to recite, 'When the call is made for the prayer on\nthe day of jumua, go to the remembrance of Allah.' \"\n\n\nMalik\nsaid, \"Making haste in the Book of Allah is only deed and action.\nAllah the Blessed, the Exalted, says 'and when he turns away, he acts\nin the land' (Sura 2 ayat 205), and He, the Exalted, said, 'and as for\nthe one who comes to you acting with fear' (Sura 80 ayat 8), and He\nsaid, 'then he turned his back, and acted' (Sura 79 ayat 22),and He\nsaid, 'Your deeds are diverse' \" (Sura 92  ayat 4). Malik said, \"Thus\nmaking haste which Allah mentions in His Book is not running on the\nfeet or exertion. It only means deed and actions.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنْ قَوْلِ اللَّهِ، عَزَّ وَجَلَّ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا نُودِيَ لِلصَّلاَةِ مِنْ يَوْمِ الْجُمُعَةِ فَاسْعَوْا إِلَى ذِكْرِ اللَّهِ‏}‏ فَقَالَ ابْنُ شِهَابٍ كَانَ عُمَرُ بْنُ الْخَطَّابِ يَقْرَؤُهَا إِذَا نُودِيَ لِلصَّلاَةِ مِنْ يَوْمِ الْجُمُعَةِ فَامْضُوا إِلَى ذِكْرِ اللَّهِ ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا السَّعْىُ فِي كِتَابِ اللَّهِ الْعَمَلُ وَالْفِعْلُ يَقُولُ اللَّهُ تَبَارَكَ وَتَعَالَى ‏{‏وَإِذَا تَوَلَّى سَعَى فِي الأَرْضِ‏}‏ وَقَالَ تَعَالَى ‏{‏وَأَمَّا مَنْ جَاءَكَ يَسْعَى وَهُوَ يَخْشَى‏}‏ وَقَالَ ‏{‏ثُمَّ أَدْبَرَ يَسْعَى‏}‏ وَقَالَ ‏{‏إِنَّ سَعْيَكُمْ لَشَتَّى‏}‏ قَالَ مَالِكٌ فَلَيْسَ السَّعْىُ الَّذِي ذَكَرَ اللَّهُ فِي كِتَابِهِ بِالسَّعْىِ عَلَى الأَقْدَامِ وَلاَ الاِشْتِدَادَ وَإِنَّمَا عَنَى الْعَمَلَ وَالْفِعْلَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa dia telah bertanya kepada Ibn Shihab tentang firman Allah, Yang Maha Agung, Yang Maha Perkasa, \"Wahai orang-orang yang beriman, apabila diseru untuk menunaikan solat pada hari Jumaat, maka bersegeralah kamu kepada mengingati Allah.\" (Surah 62 ayat 9). Ibn Shihab berkata, ''Umar ibn al-Khattab membaca, 'Apabila diseru untuk menunaikan solat pada hari Jumaat, pergilah kepada mengingati Allah.'\"\n\nMalik berkata, \"Bersegera dalam Kitab Allah hanyalah perbuatan dan amalan. Allah Yang Maha Suci, Yang Maha Tinggi berfirman 'dan apabila dia berpaling, dia berusaha di bumi' (Surah 2 ayat 205), dan Dia, Yang Maha Tinggi berfirman, 'dan adapun orang yang datang kepadamu dengan berusaha dalam ketakutan' (Surah 80 ayat 8), dan Dia berfirman, 'kemudian dia berpaling, dan berusaha' (Surah 79 ayat 22), dan Dia berfirman, 'Sesungguhnya usaha kamu adalah berbagai-bagai'\" (Surah 92 ayat 4). Malik berkata, \"Maka bersegera yang Allah sebutkan dalam Kitab-Nya bukanlah berlari dengan kaki atau bersungguh-sungguh. Ia hanya bermaksud perbuatan dan amalan.\""
  },
  {
    "id": 34417,
    "hadith_number": 239,
    "tajuk_hadith": "Hukum Solat Jumaat Bagi Musafir dan Imam",
    "perawi_melayu": "Imam Malik",
    "english_text": "Malik said, \"If the imam stops off on a journey in a town where\njumua is obligatory and he gives a khutba and takes the jumua prayer\nfor them, then the people of the town and any other people present do\nthe jumua prayer with him.\"\n\n\nMalik said, \"If the imam gathers\npeople for prayer while he is travelling in a town where the jumua\nprayer is not obligatory, then there is no jumua for him, nor for the\npeople of the town, nor for anyone else who joins them for the prayer\nin congregation, and the people of the town and anyone else who is not\ntravelling should complete the prayer.\"\n\n\nMalik added, \"A\ntraveller does not have to do jumua \"",
    "arabic_text": "",
    "malay_translation": "Malik berkata, \"Jika imam singgah dalam perjalanan di sebuah bandar yang mewajibkan solat Jumaat dan dia menyampaikan khutbah serta menunaikan solat Jumaat untuk mereka, maka penduduk bandar tersebut dan sesiapa sahaja yang hadir menunaikan solat Jumaat bersama-sama dengannya.\"\n\nMalik berkata, \"Jika imam mengumpulkan orang ramai untuk solat semasa dia bermusafir di sebuah bandar yang tidak mewajibkan solat Jumaat, maka tidak ada solat Jumaat baginya, mahupun bagi penduduk bandar tersebut, mahupun bagi sesiapa sahaja yang menyertai mereka dalam solat berjemaah, dan penduduk bandar tersebut dan sesiapa sahaja yang tidak bermusafir hendaklah menyempurnakan solat.\"\n\nMalik menambah, \"Seorang musafir tidak perlu menunaikan solat Jumaat.\""
  },
  {
    "id": 34418,
    "hadith_number": 240,
    "tajuk_hadith": "Waktu Mustajab Doa pada Hari Jumaat",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "Yahya related to me from Malik from Abu'z Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, mentioned the day of jumua and said, \"There is a time in it\nwhen Allah gives to a muslim slave standing in prayer whatever he asks\nfor,\" and the Messenger of Allah, may Allah bless him and grant him\npeace, indicated with his hand how small it was.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ذَكَرَ يَوْمَ الْجُمُعَةِ فَقَالَ ‏\n\"‏ فِيهِ سَاعَةٌ لاَ يُوَافِقُهَا عَبْدٌ مُسْلِمٌ وَهُوَ قَائِمٌ يُصَلِّي يَسْأَلُ اللَّهَ شَيْئًا إِلاَّ أَعْطَاهُ إِيَّاهُ ‏\"‏ ‏.‏ وَأَشَارَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَدِهِ يُقَلِّلُهَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abu'z Zinad, daripada al-A'raj, daripada Abu Hurairah bahawa Rasulullah ﷺ menyebut tentang hari Jumaat, lalu bersabda, \"Pada hari itu ada satu waktu yang mana seorang hamba Muslim yang berdiri solat memohon sesuatu kepada Allah, melainkan Allah akan mengkabulkannya.\" Dan Rasulullah ﷺ mengisyaratkan dengan tangannya betapa singkatnya waktu tersebut."
  },
  {
    "id": 34419,
    "hadith_number": 241,
    "tajuk_hadith": "Keistimewaan Hari Jumaat dan Waktu Mustajab",
    "perawi_melayu": "Yahya meriwayatkan kepada saya dari Malik dari Yazid bin Abdullah bin al-Had dari Muhammad bin Ibrahim bin al-Harith at-Taymi dari Abu Salama bin Abd ar-Rahman bin Awf bahawa Abu Hurayra berkata, \"Aku keluar ke at-Tur (Gunung Sinai) dan bertemu dengan Ka'b al-Ahbar dan duduk bersamanya. Dia menceritakan kepadaku perkara dari Taurat dan aku menceritakan kepadanya perkara dari Rasulullah SAW. Antara perkara yang aku ceritakan kepadanya adalah Rasulullah SAW bersabda, 'Sebaik-baik hari yang terbit padanya matahari ialah hari Jumaat. Padanya Adam diciptakan, dan padanya dia diturunkan dari Syurga. Padanya dia diampuni, dan padanya dia meninggal dunia. Padanya berlaku Kiamat, dan setiap makhluk bergerak mendengar dari pagi hingga terbenam matahari dalam ketakutan terhadap Kiamat kecuali jin dan manusia. Padanya ada suatu waktu di mana Allah memberikan kepada hamba Muslim yang berdiri dalam solat apa sahaja yang dia minta.' Ka'b berkata, 'Itu adalah satu hari dalam setiap tahun.' Aku berkata, 'Tidak, dalam setiap Jumaat.' Kemudian Ka'b membaca Taurat dan berkata, 'Rasulullah telah berkata benar.'\"",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ خَرَجْتُ إِلَى الطُّورِ فَلَقِيتُ كَعْبَ الأَحْبَارِ فَجَلَسْتُ مَعَهُ فَحَدَّثَنِي عَنِ التَّوْرَاةِ وَحَدَّثْتُهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَكَانَ فِيمَا حَدَّثْتُهُ أَنْ قُلْتُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ خَيْرُ يَوْمٍ طَلَعَتْ عَلَيْهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ أُهْبِطَ مِنَ الْجَنَّةِ وَفِيهِ تِيبَ عَلَيْهِ وَفِيهِ مَاتَ وَفِيهِ تَقُومُ السَّاعَةُ وَمَا مِنْ دَابَّةٍ إِلاَّ وَهِيَ مُصِيخَةٌ يَوْمَ الْجُمُعَةِ مِنْ حِينِ تُصْبِحُ حَتَّى تَطْلُعَ الشَّمْسُ شَفَقًا مِنَ السَّاعَةِ إِلاَّ الْجِنَّ وَالإِنْسَ وَفِيهِ سَاعَةٌ لاَ يُصَادِفُهَا عَبْدٌ مُسْلِمٌ وَهُوَ يُصَلِّي يَسْأَلُ اللَّهَ شَيْئًا إِلاَّ أَعْطَاهُ إِيَّاهُ ‏\"‏ ‏.‏ قَالَ كَعْبٌ ذَلِكَ فِي كُلِّ سَنَةٍ يَوْمٌ ‏.‏ فَقُلْتُ بَلْ فِي كُلِّ جُمُعَةٍ ‏.‏ فَقَرَأَ كَعْبٌ التَّوْرَاةَ فَقَالَ صَدَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو هُرَيْرَةَ فَلَقِيتُ بَصْرَةَ بْنَ أَبِي بَصْرَةَ الْغِفَارِيَّ فَقَالَ مِنْ أَيْنَ أَقْبَلْتَ فَقُلْتُ مِنَ الطُّورِ ‏.‏ فَقَالَ لَوْ أَدْرَكْتُكَ قَبْلَ أَنْ تَخْرُجَ إِلَيْهِ مَا خَرَجْتَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ تُعْمَلُ الْمَطِيُّ إِلاَّ إِلَى ثَلاَثَةِ مَسَاجِدَ إِلَى الْمَسْجِدِ الْحَرَامِ وَإِلَى مَسْجِدِي هَذَا وَإِلَى مَسْجِدِ إِيلْيَاءَ أَوْ بَيْتِ الْمَقْدِسِ ‏\"‏ ‏.‏ يَشُكُّ ‏.‏ قَالَ أَبُو هُرَيْرَةَ ثُمَّ لَقِيتُ عَبْدَ اللَّهِ بْنَ سَلاَمٍ فَحَدَّثْتُهُ بِمَجْلِسِي مَعَ كَعْبِ الأَحْبَارِ وَمَا حَدَّثْتُهُ بِهِ فِي يَوْمِ الْجُمُعَةِ فَقُلْتُ قَالَ كَعْبٌ ذَلِكَ فِي كُلِّ سَنَةٍ يَوْمٌ ‏.‏ قَالَ قَالَ عَبْدُ اللَّهِ بْنُ سَلاَمٍ كَذَبَ كَعْبٌ ‏.‏ فَقُلْتُ ثُمَّ قَرَأَ كَعْبٌ التَّوْرَاةَ فَقَالَ بَلْ هِيَ فِي كُلِّ جُمُعَةٍ ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ سَلاَمٍ صَدَقَ كَعْبٌ ‏.‏ ثُمَّ قَالَ عَبْدُ اللَّهِ بْنُ سَلاَمٍ قَدْ عَلِمْتُ أَيَّةَ سَاعَةٍ هِيَ ‏.‏ قَالَ أَبُو هُرَيْرَةَ فَقُلْتُ لَهُ أَخْبِرْنِي بِهَا وَلاَ تَضِنَّ عَلَىَّ ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ سَلاَمٍ هِيَ آخِرُ سَاعَةٍ فِي يَوْمِ الْجُمُعَةِ ‏.‏ قَالَ أَبُو هُرَيْرَةَ فَقُلْتُ وَكَيْفَ تَكُونُ آخِرُ سَاعَةٍ فِي يَوْمِ الْجُمُعَةِ وَقَدْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ يُصَادِفُهَا عَبْدٌ مُسْلِمٌ وَهُوَ يُصَلِّي ‏\"‏ ‏.‏ وَتِلْكَ السَّاعَةُ سَاعَةٌ لاَ يُصَلَّى فِيهَا فَقَالَ عَبْدُ اللَّهِ بْنُ سَلاَمٍ أَلَمْ يَقُلْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ جَلَسَ مَجْلِسًا يَنْتَظِرُ الصَّلاَةَ فَهُوَ فِي صَلاَةٍ حَتَّى يُصَلِّيَ ‏\"‏ ‏.‏ قَالَ أَبُو هُرَيْرَةَ فَقُلْتُ بَلَى ‏.‏ قَالَ فَهُوَ ذَلِكَ ‏.‏",
    "malay_translation": "Abu Hurairah RA berkata: Aku keluar ke Thur (Gunung Sinai) lalu bertemu Ka'ab Al-Ahbar. Aku duduk bersamanya, lalu dia menceritakan tentang Taurat kepadaku, dan aku menceritakan kepada dia (Ka'ab) tentang Rasulullah SAW. Di antara apa yang aku ceritakan kepadanya, aku berkata: Rasulullah SAW bersabda: “Sebaik-baik hari yang terbit padanya matahari adalah hari Jumaat. Padanya Adam diciptakan, padanya dia dimasukkan ke dalam syurga, padanya dia dikeluarkan dari syurga, dan padanya juga dia wafat. Pada hari itu juga akan terjadi kiamat. Tidak ada satu pun binatang melata melainkan akan menunggu (dengan penuh perhatian) pada hari Jumaat sejak waktu pagi hingga terbit matahari kerana takut akan kedatangan kiamat, kecuali jin dan manusia. Pada hari itu terdapat satu waktu yang mana tidaklah seorang hamba Muslim yang meminta sesuatu kepada Allah SWT dalam keadaan dia sedang solat melainkan akan Allah SWT kabulkan permintaan tersebut.” Ka'ab berkata: “Demikian itu berlaku pada setiap tahun ada satu hari.” Aku berkata: “Bahkan (berlaku) pada setiap hari Jumaat.” Kemudian Ka'ab membaca Taurat lalu berkata: “Rasulullah SAW telah berkata benar.” Abu Hurairah RA berkata: Aku berjumpa pula dengan Basrah bin Abi Basrah Al-Ghifari, lalu dia bertanya: “Dari manakah engkau datang?” Aku menjawab: “Dari Thur.” Dia berkata: “Seandainya aku menemuimu sebelum engkau pergi ke sana, nescaya engkau tidak akan ke sana. Aku mendengar Rasulullah SAW bersabda: “Tidak boleh melakukan perjalanan jauh (untuk tujuan ziarah) melainkan ke tiga masjid, iaitu Masjidil Haram, masjidku ini (Masjid Nabawi), dan Masjid Ilya (Baitul Maqdis).” Abu Hurairah RA berkata: Kemudian aku bertemu Abdullah bin Salam, lalu aku menceritakan kepadanya perihal perjumpaan aku dengan Ka'ab Al-Ahbar, dan apa yang aku ceritakan kepadanya mengenai hari Jumaat. Aku berkata: Ka'ab berkata: “Demikian itu berlaku pada setiap tahun ada satu hari.” Abdullah bin Salam berkata: “Ka'ab berdusta.” Aku berkata: Kemudian Ka'ab membaca Taurat lalu berkata: “Bahkan (berlaku) pada setiap hari Jumaat.” Abdullah bin Salam berkata: “Ka'ab benar.” Kemudian Abdullah bin Salam berkata: “Aku telah mengetahui waktu apakah itu.” Abu Hurairah RA berkata: Aku berkata kepadanya: “Beritahulah aku, janganlah engkau kedekut (menyembunyikannya) daripadaku.” Abdullah bin Salam berkata: “Iaitu pada waktu akhir hari Jumaat.” Abu Hurairah RA berkata: Aku berkata: “Bagaimana mungkin waktu akhir hari Jumaat, sedangkan Rasulullah SAW bersabda: “Tidaklah seorang hamba Muslim yang sedang bersolat pada waktu itu melainkan akan diperkenankan doanya” sedangkan pada waktu itu bukanlah waktu untuk solat?” Abdullah bin Salam menjawab: “Bukankah Rasulullah SAW bersabda: “Sesiapa yang duduk di majlis untuk menunggu solat, maka dia (mendapat pahala) seperti orang yang sedang bersolat sehingga dia solat?” Abu Hurairah RA berkata: “Benar.” Dia berkata: “Maka itulah (waktunya).”"
  },
  {
    "id": 34420,
    "hadith_number": 242,
    "tajuk_hadith": "Pakaian Terbaik untuk Solat Jumaat",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said that he had\nheard that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"There is nothing wrong in wearing two garments which are\nnot work-clothes for jumua.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ قَالَ ‏\n\"‏ مَا عَلَى أَحَدِكُمْ لَوِ اتَّخَذَ ثَوْبَيْنِ لِجُمُعَتِهِ سِوَى ثَوْبَىْ مَهْنَتِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said, bahawa dia mendengar bahawa Rasulullah SAW bersabda, \"Tiada salahnya bagi seseorang daripada kamu memakai dua helai pakaian selain pakaian kerja untuk solat Jumaat.\""
  },
  {
    "id": 34421,
    "hadith_number": 243,
    "tajuk_hadith": "Abdullah bin Umar Memakai Minyak Wangi ke Solat Jumaat",
    "perawi_melayu": "Nafi",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nwould never go to jumua without wearing oil and perfume except when it\nwas forbidden (i.e. when he was muhrim).",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ لاَ يَرُوحُ إِلَى الْجُمُعَةِ إِلاَّ ادَّهَنَ وَتَطَيَّبَ إِلاَّ أَنْ يَكُونَ حَرَامًا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Nafi bahawa Abdullah bin Umar tidak pernah pergi ke solat Jumaat melainkan memakai minyak wangi dan berharum-haruman, kecuali ketika ia di dalam ihram (iaitu ketika ia muhrim)."
  },
  {
    "id": 34422,
    "hadith_number": 244,
    "tajuk_hadith": "Keutamaan Solat di Permukaan Al-Harra Berbanding Melepasi Orang untuk Khutbah",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Nafi from Abdullah ibn Abi\nBakr ibn Hazm from whoever related it to him that Abu Hurayra used to\nsay, \"It is better for a man to pray on the surface of al Harra (a\nrocky area in Madina) than for him to wait until the imam stands to\ngive the khutba and then come and step over people's necks.\"\n\n\nMalik said, \"The sunna with us is that the people face the imam on the\nday of jumua when he intends to give the khutba, whether they are near\nthe qibla or elsewhere.\"",
    "arabic_text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ حَزْمٍ، عَمَّنْ حَدَّثَهُ عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ كَانَ يَقُولُ لأَنْ يُصَلِّيَ أَحَدُكُمْ بِظَهْرِ الْحَرَّةِ خَيْرٌ لَهُ مِنْ أَنْ يَقْعُدَ حَتَّى إِذَا قَامَ الإِمَامُ يَخْطُبُ جَاءَ يَتَخَطَّى رِقَابَ النَّاسِ يَوْمَ الْجُمُعَةِ ‏.‏ قَالَ مَالِكٌ السُّنَّةُ عِنْدَنَا أَنْ يَسْتَقْبِلَ النَّاسُ الإِمَامَ يَوْمَ الْجُمُعَةِ إِذَا أَرَادَ أَنْ يَخْطُبَ مَنْ كَانَ مِنْهُمْ يَلِي الْقِبْلَةَ وَغَيْرَهَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Nafi', daripada Abdullah ibn Abi Bakr ibn Hazm daripada sesiapa yang meriwayatkannya daripada Abu Hurairah, bahawa beliau berkata, \"Adalah lebih baik bagi seseorang itu untuk solat di permukaan al-Harra (kawasan berbatu di Madinah) daripada dia menunggu sehingga imam berdiri untuk memberikan khutbah, kemudian datang dan melangkah di atas leher orang.\"\n\nMalik berkata, \"Sunnah menurut kami ialah orang ramai menghadap imam pada hari Jumaat apabila dia berniat untuk menyampaikan khutbah, sama ada mereka berada berhampiran qiblat atau di tempat lain."
  },
  {
    "id": 34423,
    "hadith_number": 245,
    "tajuk_hadith": "Rasulullah SAW Membaca Surah al-Ghashiya selepas Surah al-Jumu'ah",
    "perawi_melayu": "Ubaydullah ibn Abdullah ibn Utba ibn Masud",
    "english_text": "Yahya related to me from Malik from Damra ibn Said al-Mazini from\nUbaydullah ibn Abdullah ibn Utba ibn Masud that ad-Dahhak ibn Qays\nasked an-Numan ibn Bashir, \"What did the Messenger of Allah, may Allah\nbless him and grant him peace, use to recite on the day of jumua after\nsuratal-Jumua (Sura 62)?\" He said, \"He used to recite al-Ghashiya\n(Sura 88).\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ ضَمْرَةَ بْنِ سَعِيدٍ الْمَازِنِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ الضَّحَّاكَ بْنَ قَيْسٍ، سَأَلَ النُّعْمَانَ بْنَ بَشِيرٍ مَاذَا كَانَ يَقْرَأُ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ الْجُمُعَةِ عَلَى إِثْرِ سُورَةِ الْجُمُعَةِ قَالَ كَانَ يَقْرَأُ ‏{‏هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ‏}‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik daripada Damra ibn Said al-Mazini daripada Ubaydullah ibn Abdullah ibn Utba ibn Masud bahawa ad-Dahhak ibn Qays bertanya kepada an-Numan ibn Bashir, \"Apakah yang dibacakan oleh Rasulullah SAW pada hari Jumaat selepas Surah al-Jumu'ah (Surah 62)?\" Beliau menjawab, \"Baginda membaca Surah al-Ghashiya (Surah 88).\""
  },
  {
    "id": 34424,
    "hadith_number": 246,
    "tajuk_hadith": "Kesan Meninggalkan Solat Jumaat Tiga Kali Berturut-turut",
    "perawi_melayu": "Safwan ibn Sulaym (Malik berkata, \"Saya tidak tahu sama ada daripada Rasulullah SAW atau tidak.\")",
    "english_text": "Yahya related to me from Malik that Safwan ibn Sulaym said, \"If\nanyone omits jumua three times without reason or illness, Allah will\nset a seal on his heart.\" (Malik said, \"I don't know if it was from\nthe Messenger of Allah, may Allah bless him and grant him peace, or\nnot.\")",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، - قَالَ مَالِكٌ لاَ أَدْرِي أَعَنِ النَّبِيِّ صلى الله عليه وسلم أَمْ لاَ - أَنَّهُ قَالَ ‏\n\"‏ مَنْ تَرَكَ الْجُمُعَةَ ثَلاَثَ مَرَّاتٍ مِنْ غَيْرِ عُذْرٍ وَلاَ عِلَّةٍ طَبَعَ اللَّهُ عَلَى قَلْبِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa Safwan ibn Sulaym berkata, \"Sesiapa yang meninggalkan solat Jumaat tiga kali tanpa sebab atau penyakit, Allah akan meteraikan hatinya.\" (Malik berkata, \"Saya tidak tahu sama ada daripada Nabi SAW atau tidak.\")"
  },
  {
    "id": 34425,
    "hadith_number": 247,
    "tajuk_hadith": "Rasulullah SAW Berkhutbah Dua Kali pada Hari Jumaat",
    "perawi_melayu": "Jafar ibn Muhammad daripada bapanya",
    "english_text": "Yahya related to me from Malik from Jafar ibn Muhammad from his\nfather that the Messenger of Allah, may Allah bless him and grant him\npeace, gave two khutbas on the day of jumua and sat down between them.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَطَبَ خُطْبَتَيْنِ يَوْمَ الْجُمُعَةِ وَجَلَسَ بَيْنَهُمَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik daripada Jafar ibn Muhammad daripada bapanya bahawa Rasulullah SAW menyampaikan dua khutbah pada hari Jumaat dan duduk di antara kedua-duanya."
  }
]
