[
  {
    "id": 35974,
    "hadith_number": 1796,
    "tajuk_hadith": "Penerangan Sifat Rasulullah SAW",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik that Rabia ibn Abi Abd ar-Rahman\nheard Anas ibn Malik say, \"The Messenger of Allah, may Allah bless him\nand grant him peace, was not excessively tall or short. He was not\nvery pallid nor dark. He did not have curly hair or lank hair. Allah\ncommissioned him at the age of forty. He stayed in Makka ten years and\nat Madina for ten years and Allah the Mighty, the Majestic made him\ndie when he was sixty. There were not twenty white hairs in his hair\nor beard, may Allah bless him and grant him peace.\"",
    "arabic_text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ سَمِعَهُ يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيْسَ بِالطَّوِيلِ الْبَائِنِ وَلاَ بِالْقَصِيرِ وَلَيْسَ بِالأَبْيَضِ الأَمْهَقِ وَلاَ بِالآدَمِ وَلاَ بِالْجَعْدِ الْقَطَطِ وَلاَ بِالسَّبِطِ بَعَثَهُ اللَّهُ عَلَى رَأْسِ أَرْبَعِينَ سَنَةً فَأَقَامَ بِمَكَّةَ عَشْرَ سِنِينَ وَبِالْمَدِينَةِ عَشْرَ سِنِينَ وَتَوَفَّاهُ اللَّهُ عَزَّ وَجَلَّ عَلَى رَأْسِ سِتِّينَ سَنَةً وَلَيْسَ فِي رَأْسِهِ وَلِحْيَتِهِ عِشْرُونَ شَعْرَةً بَيْضَاءَ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, yang mendengar daripada Rabia bin Abi Abd ar-Rahman, yang mendengar Anas bin Malik berkata, \"Rasulullah SAW bukanlah terlalu tinggi atau terlalu pendek. Baginda bukan berwajah pucat atau hitam. Baginda tidak berambut kerinting atau berambut lurus. Allah mengutusnya pada usia empat puluh tahun. Baginda tinggal di Mekah selama sepuluh tahun dan di Madinah selama sepuluh tahun, dan Allah SWT wafatkan baginda pada usia enam puluh tahun. Tidak terdapat dua puluh helai rambut putih di kepala dan janggut baginda, semoga Allah memberkati dan memberi salam kepadanya.\""
  },
  {
    "id": 35975,
    "hadith_number": 1797,
    "tajuk_hadith": "Mimpi Rasulullah SAW Mengenai Al-Masih dan Al-Dajjal di Kaabah",
    "perawi_melayu": "Yahya daripada Malik daripada Nafi daripada Abdullah bin Umar",
    "english_text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"I dreamt at night that I was at the Kaba, and I saw a dark man\nlike the most handsome of dark men you have ever seen. He had hair\nreaching to between his ears and his shoulders like the most excellent\nof such hair that you have seen. He had combed his hair, and water was\ndripping from it. He was leaning on two men or on the shoulders of two\nmen doing tawaf around Kaba. I asked, 'Who is this?' It was said, 'al-\nMasih ibn Maryam.' Then we were with a man with wiry hair and blind in\nhis right eye, as if it was a floating grape. I asked 'Who is this?'\nIt was said to me, 'This is al-Masih ad-Dajjal.' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَرَانِي اللَّيْلَةَ عِنْدَ الْكَعْبَةِ فَرَأَيْتُ رَجُلاً آدَمَ كَأَحْسَنِ مَا أَنْتَ رَاءٍ مِنْ أُدْمِ الرِّجَالِ لَهُ لِمَّةٌ كَأَحْسَنِ مَا أَنْتَ رَاءٍ مِنَ اللِّمَمِ قَدْ رَجَّلَهَا فَهِيَ تَقْطُرُ مَاءً مُتَّكِئًا عَلَى رَجُلَيْنِ - أَوْ عَلَى عَوَاتِقِ رَجُلَيْنِ - يَطُوفُ بِالْكَعْبَةِ فَسَأَلْتُ مَنْ هَذَا قِيلَ هَذَا الْمَسِيحُ ابْنُ مَرْيَمَ ثُمَّ إِذَا أَنَا بِرَجُلٍ جَعْدٍ قَطَطٍ أَعْوَرِ الْعَيْنِ الْيُمْنَى كَأَنَّهَا عِنَبَةٌ طَافِيَةٌ فَسَأَلْتُ مَنْ هَذَا فَقِيلَ لِي هَذَا الْمَسِيحُ الدَّجَّالُ ‏\"‏ ‏.‏",
    "malay_translation": "Perawi-melayu Yahya meriwayatkan daripada Malik daripada Nafi daripada Abdullah bin Umar bahawa Rasulullah SAW bersabda, \"Pada malam itu aku bermimpi di sisi Kaabah. Aku melihat seorang lelaki berkulit gelap yang paling tampan di antara lelaki-lelaki berkulit gelap yang pernah kau lihat. Dia mempunyai rambut yang sangat cantik, memanjang hingga ke bahu, seperti rambut yang terbaik yang pernah kamu lihat. Rambutnya disisir rapi, dan air menitis daripadanya. Dia bersandar pada dua orang lelaki - atau pada bahu dua orang lelaki - sedang melakukan tawaf di sekitar Kaabah. Aku bertanya, 'Siapakah orang ini?' Dikatakan, 'Ini adalah al-Masih ibnu Maryam.' Kemudian aku melihat seorang lelaki berambut kerinting dan buta sebelah mata kanannya, seperti buah anggur yang terapung. Aku bertanya, 'Siapakah orang ini?' Dikatakan kepadaku, 'Ini adalah al-Masih ad-Dajjal.'\""
  },
  {
    "id": 35976,
    "hadith_number": 1798,
    "tajuk_hadith": "Lima perkara fitrah",
    "perawi_melayu": "Yahya menceritakan kepada saya daripada Malik, daripada Said bin Abi Said al-Maqburi, daripada bapanya, daripada Abu Hurairah, yang berkata: \"Terdapat lima perkara daripada fitrah:",
    "english_text": "cutting the nails, trimming the moustache, removing the hair\nfrom the armpit, shaving the pubic region and circumcision.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ خَمْسٌ مِنَ الْفِطْرَةِ تَقْلِيمُ الأَظَافِرِ وَقَصُّ الشَّارِبِ وَنَتْفُ الإِبْطِ وَحَلْقُ الْعَانَةِ وَالاِخْتِتَانُ ‏.‏",
    "malay_translation": "Memotong kuku, mencukur misai, mencabut bulu ketiak, mencukur kemaluan dan berkhatan.  Ini adalah lima perkara dari fitrah."
  },
  {
    "id": 35977,
    "hadith_number": 1799,
    "tajuk_hadith": "Keutamaan Nabi Ibrahim a.s. dan Adab Memotong Janggut",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said that Said ibn\nal-Musayyub said, \"Ibrahim, may Allah bless him and grant him peace,\nwas the first to give hospitality to the guest and the first person to\nbe circumcised and the first person to trim the moustache and the\nfirst person to see grey hair. He said, 'O Lord! What is this?' Allah\nthe Blessed, the Exalted, said, 'It is dignity, Ibrahim.' He said,\n'Lord, increase me in dignity!' \"\n\n\nYahya said that he had\nheard Malik say, \"One takes from the moustache until the edge of the\nlip appears, that is the rim. One does not cut if off completely so\nthat one mutilates oneself.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ كَانَ إِبْرَاهِيمُ صلى الله عليه وسلم أَوَّلَ النَّاسِ ضَيَّفَ الضَّيْفَ وَأَوَّلَ النَّاسِ اخْتَتَنَ وَأَوَّلَ النَّاسِ قَصَّ الشَّارِبَ وَأَوَّلَ النَّاسِ رَأَى الشَّيْبَ فَقَالَ يَا رَبِّ مَا هَذَا فَقَالَ اللَّهُ تَبَارَكَ وَتَعَالَى وَقَارٌ يَا إِبْرَاهِيمُ ‏.‏ فَقَالَ رَبِّ زِدْنِي وَقَارًا ‏.‏ قَالَ يَحْيَى وَسَمِعْتُ مَالِكًا يَقُولُ يُؤْخَذُ مِنَ الشَّارِبِ حَتَّى يَبْدُوَ طَرَفُ الشَّفَةِ وَهُوَ الإِطَارُ وَلاَ يَجُزُّهُ فَيُمَثِّلُ بِنَفْسِهِ ‏.‏",
    "malay_translation": "Dikisahkan oleh Yahya, beliau mendengar dari Malik, yang mendengar dari Yahya bin Said, dari Said bin al-Musayyib, bahawa Ibrahim a.s. adalah orang pertama yang menjamu tetamu, orang pertama yang dikhitan, orang pertama yang mencukur janggut, dan orang pertama yang melihat uban. Beliau bertanya kepada Allah, \"Wahai Tuhanku, apakah ini?\" Allah menjawab, \"Ini adalah kehormatan, wahai Ibrahim.\" Ibrahim kemudian memohon, \"Ya Tuhanku, tambahkanlah kehormatan kepadaku.\" Yahya menambah, dia mendengar Malik berkata, \"Janggut hanya dipotong sehingga tepi bibir kelihatan, iaitu bingkai janggut. Jangan sampai dipotong habis sehingga mencacatkan diri sendiri.\""
  },
  {
    "id": 35978,
    "hadith_number": 1800,
    "tajuk_hadith": "Larangan Makan dengan Tangan Kiri dan Adab Berpakaian",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Abu'z-Zubayr from Jabir ibn\nAbdullah as-Salami that the Messenger of Allah, may Allah bless him\nand grant him peace, forbade a man to eat with his left hand or walk\nin one sandal or wrap a single garment around his drawn-up legs\nexposing his genitals.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ السَّلَمِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى أَنْ يَأْكُلَ الرَّجُلُ بِشِمَالِهِ أَوْ يَمْشِيَ فِي نَعْلٍ وَاحِدَةٍ وَأَنْ يَشْتَمِلَ الصَّمَّاءَ وَأَنْ يَحْتَبِيَ فِي ثَوْبٍ وَاحِدٍ كَاشِفًا عَنْ فَرْجِهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Abu Zubair, dari Jabir bin Abdullah al-Salami bahawa Rasulullah SAW melarang seseorang lelaki makan dengan tangan kirinya atau berjalan dengan hanya satu sandal atau menutup dirinya dengan sehelai kain sahaja sehingga mendedahkan aurat."
  },
  {
    "id": 35979,
    "hadith_number": 1801,
    "tajuk_hadith": "Makan dan Minum dengan Tangan Kanan",
    "perawi_melayu": "Yahya daripada Malik daripada Ibn Shihab daripada Abu Bakr ibn Ubaydullah ibn Abdullah ibn Umar daripada Abdullah ibn Umar",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Abu Bakr ibn\nUbaydullah ibn Abdullah ibn Umar from Abdullah ibn Umar that the\nMessenger of Allah, may Allah bless him and grant him peace, said,\n\"When you eat, eat with your right hand and drink with your right\nhand. Shaytan eats with his left hand and drinks with his left hand.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا أَكَلَ أَحَدُكُمْ فَلْيَأْكُلْ بِيَمِينِهِ وَلْيَشْرَبْ بِيَمِينِهِ فَإِنَّ الشَّيْطَانَ يَأْكُلُ بِشِمَالِهِ وَيَشْرَبُ بِشِمَالِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Abu Bakr ibn Ubaydullah ibn Abdullah ibn Umar, daripada Abdullah ibn Umar bahawa Rasulullah SAW bersabda,\n\"Apabila salah seorang daripada kamu makan, maka hendaklah dia makan dengan tangan kanannya dan minum dengan tangan kanannya. Sesungguhnya syaitan makan dengan tangan kirinya dan minum dengan tangan kirinya.\""
  },
  {
    "id": 35980,
    "hadith_number": 1802,
    "tajuk_hadith": "Penjelasan Kemiskinan Yang Sebenar",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Abu'z-Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"The very poor are not the people who constantly walk\nfrom person to person and are given one or two morsels, and one or two\ndates.\" They said, \"Who are the very poor, Messenger of Allah?\" He\nsaid, \"People who do not find enough for themselves and other people\nare not aware of them to give sadaqa to them, and they do not start\nbegging from other people.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لَيْسَ الْمِسْكِينُ بِهَذَا الطَّوَّافِ الَّذِي يَطُوفُ عَلَى النَّاسِ فَتَرُدُّهُ اللُّقْمَةُ وَاللُّقْمَتَانِ وَالتَّمْرَةُ وَالتَّمْرَتَانِ ‏\"‏ ‏.‏ قَالُوا فَمَا الْمِسْكِينُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الَّذِي لاَ يَجِدُ غِنًى يُغْنِيهِ وَلاَ يَفْطُنُ النَّاسُ لَهُ فَيُتَصَدَّقَ عَلَيْهِ وَلاَ يَقُومُ فَيَسْأَلَ النَّاسَ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abu az-Zinad, daripada al-Araj, daripada Abu Hurairah bahawa Rasulullah SAW bersabda, \"Orang miskin yang sebenarnya bukanlah orang yang sentiasa mengemis daripada orang ramai sehingga diberi sekerat atau dua kerat makanan, dan sebiji atau dua biji kurma.\" Mereka bertanya, \"Siapakah orang miskin yang sebenarnya, wahai Rasulullah?\" Baginda menjawab, \"Orang yang tidak memperoleh rezeki yang mencukupi untuk dirinya dan orang lain tidak menyedari akan keadaannya untuk memberi sedekah kepadanya, dan dia tidak meminta-minta daripada orang lain.\""
  },
  {
    "id": 35981,
    "hadith_number": 1803,
    "tajuk_hadith": "Menolong Orang Miskin Walaupun Sedikit",
    "perawi_melayu": "Yahya daripada Malik, daripada Zayd bin Aslam, daripada Ibn Bujayd (dahulu al-Ansari), kemudian al-Harithi, daripada neneknya, ",
    "english_text": "Yahya related to me from Malik from Zayd ibn Aslam from Ibn\nBujayd (formerly al-Ansari) from his grandmother that the Messenger of\nAllah, may Allah bless him and grant him peace, said, \"Give to the\nvery poor, if only a roasted hoof.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنِ ابْنِ بُجَيْدٍ الأَنْصَارِيِّ، ثُمَّ الْحَارِثِيِّ عَنْ جَدَّتِهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ رُدُّوا الْمِسْكِينَ وَلَوْ بِظِلْفٍ مُحْرَقٍ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Zayd bin Aslam, daripada Ibn Bujayd (dahulu al-Ansari), kemudian al-Harithi, daripada neneknya, bahawa Rasulullah SAW bersabda, \"Sumbangkanlah kepada orang miskin, walau sekadar seketul kuku kaki yang dibakar.\""
  },
  {
    "id": 35982,
    "hadith_number": 1804,
    "tajuk_hadith": "Perbezaan Pencernaan Makanan Antara Muslim dan Kafir",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Abu'z-Zinad from al-Araj that\nAbu Hurayra said, \"The Messenger of Allah, may Allah bless him and\ngrant him peace, said, 'The muslim eats in one intestine, and the\nkafir eats in seven!' \"",
    "arabic_text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَأْكُلُ الْمُسْلِمُ فِي مِعًى وَاحِدٍ وَالْكَافِرُ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abu'z-Zinad, daripada al-Araj, daripada Abu Hurairah yang berkata, \"Rasulullah SAW bersabda, 'Muslim makan dalam satu usus, dan kafir makan dalam tujuh usus!' \""
  },
  {
    "id": 35983,
    "hadith_number": 1805,
    "tajuk_hadith": "Ketamadunan dan Kefahaman Tetamu Bukan Islam",
    "perawi_melayu": "Yahya daripada Malik daripada Suhayl bin Abi Salih daripada bapanya daripada Abu Hurairah",
    "english_text": "Yahya related to me from Malik from Suhayl ibn Abi Salih from his\nfather from Abu Hurayra that the Messenger of Allah, may Allah bless\nhim and grant him peace, gave hospitality to a kafir guest. The\nMessenger of Allah, may Allah bless him and grant him peace, ordered a\nsheep to be brought for him and it was milked. He drank its milk. Then\nanother came, and he drank it. Then another came and he drank it until\nhe had drunk the milk of seven sheep. In the morning he became muslim,\nand the Messenger of Allah, may Allah bless him and grant him peace,\nordered a sheep for him. It was milked and he drank its milk. Then he\nordered another for him and he could not finish it. The Messenger of\nAllah, may Allah bless him and grant him peace, said, \"The mumin\ndrinks in one intestine, and the kafir drinks in seven intestines.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ضَافَهُ ضَيْفٌ كَافِرٌ فَأَمَرَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بِشَاةٍ فَحُلِبَتْ فَشَرِبَ حِلاَبَهَا ثُمَّ أُخْرَى فَشَرِبَهُ ثُمَّ أُخْرَى فَشَرِبَهُ حَتَّى شَرِبَ حِلاَبَ سَبْعِ شِيَاهٍ ثُمَّ إِنَّهُ أَصْبَحَ فَأَسْلَمَ فَأَمَرَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بِشَاةٍ فَحُلِبَتْ فَشَرِبَ حِلاَبَهَا ثُمَّ أَمَرَ لَهُ بِأُخْرَى فَلَمْ يَسْتَتِمَّهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْمُؤْمِنُ يَشْرَبُ فِي مِعًى وَاحِدٍ وَالْكَافِرُ يَشْرَبُ فِي سَبْعَةِ أَمْعَاءٍ ‏\"‏ ‏.‏",
    "malay_translation": "Perawi Yahya meriwayatkan daripada Malik, daripada Suhayl bin Abi Salih, daripada bapanya, daripada Abu Hurairah, bahawa Rasulullah SAW menjamu tetamu kafir. Baginda memerintahkan seekor kambing untuk diperah susu. Tetamu itu meminum susunya. Kemudian, seekor kambing lagi, dan begitulah seterusnya sehingga dia meminum susu tujuh ekor kambing. Keesokan harinya, dia memeluk Islam. Rasulullah SAW kemudian memerintahkan seekor kambing lagi untuk diperah. Dia meminum susunya. Baginda memerintahkan kambing lagi, tetapi dia tidak dapat menghabiskan susunya. Lalu, Rasulullah SAW bersabda, \"Orang beriman minum dalam satu usus, manakala orang kafir minum dalam tujuh usus.\""
  },
  {
    "id": 35984,
    "hadith_number": 1806,
    "tajuk_hadith": "Larangan Minum Daripada Pinggan Perak",
    "perawi_melayu": "Yahya daripada Malik, daripada Nafi, daripada Zayd bin Abdullah bin Umar bin al-Khattab, daripada Abdullah bin Abd ar-Rahman bin Abi Bakras al-Siddiq, daripada Umm Salamah, isteri Nabi SAW.",
    "english_text": "Yahya related to me from Malik from Nafi from Zayd ibn Abdullah\nibn Umar ibn al-Khattab from Abdullah ibn Abd ar-Rahman ibn Abi\nBakras-Siddiq from Umm Salama, the wife of the Prophet, may Allah\nbless him and grant him peace, that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"A person who drinks from a\nsilver vessel brings the fire of Jahannam into his belly.\"",
    "arabic_text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ زَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ، عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الَّذِي يَشْرَبُ فِي آنِيَةِ الْفِضَّةِ إِنَّمَا يُجَرْجِرُ فِي بَطْنِهِ نَارَ جَهَنَّمَ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Nafi, daripada Zayd bin Abdullah bin Umar bin al-Khattab, daripada Abdullah bin Abd ar-Rahman bin Abi Bakras al-Siddiq, daripada Umm Salamah, isteri Nabi SAW, bahawa Rasulullah SAW bersabda, \"Sesungguhnya orang yang minum daripada bekas perak, ia membawa api neraka Jahannam ke dalam perutnya.\""
  },
  {
    "id": 35985,
    "hadith_number": 1807,
    "tajuk_hadith": "Larangan Meniup Minuman dan Tindakan Mengatasinya",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Ayyub ibn Habib, the mawla of\nSad ibn Abi Waqqas that Abu'l-Muthanna al-Juhani said, \"I was with\nMarwan ibn al-Hakam and Abu Said al-Khudri came to him. Marwan ibn al-\nHakam said to him, 'Have you heard that the Messenger of Allah, may\nAllah bless him and grant him peace, forbade blowing into drinks?' Abu\nSaid said to him, 'Yes.' A man said to him, 'Messenger of Allah, I am\nnot quenched from one breath.' The Messenger of Allah, may Allah bless\nhim and grant him peace, said to him, 'Remove the cup from your mouth\nand then breathe.' He said, 'Sometimes I see something floating in\nit?' He said, 'Then pour it out.'",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَيُّوبَ بْنِ حَبِيبٍ، مَوْلَى سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ أَبِي الْمُثَنَّى الْجُهَنِيِّ، أَنَّهُ قَالَ كُنْتُ عِنْدَ مَرْوَانَ بْنِ الْحَكَمِ فَدَخَلَ عَلَيْهِ أَبُو سَعِيدٍ الْخُدْرِيُّ فَقَالَ لَهُ مَرْوَانُ بْنُ الْحَكَمِ أَسَمِعْتَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ نَهَى عَنِ النَّفْخِ فِي الشَّرَابِ فَقَالَ لَهُ أَبُو سَعِيدٍ نَعَمْ فَقَالَ لَهُ رَجُلٌ يَا رَسُولَ اللَّهِ إِنِّي لاَ أَرْوَى مِنْ نَفَسٍ وَاحِدٍ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَأَبِنِ الْقَدَحَ عَنْ فِيكَ ثُمَّ تَنَفَّسْ ‏\"‏ ‏.‏ قَالَ فَإِنِّي أَرَى الْقَذَاةَ فِيهِ ‏.‏ قَالَ ‏\"‏ فَأَهْرِقْهَا ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Ayyub bin Habib, hamba kepada Sad bin Abi Waqqas, dari Abu Muthanna al-Juhani. Beliau berkata, \"Saya berada di sisi Marwan bin al-Hakam, dan Abu Said al-Khudri masuk menemui beliau. Marwan bin al-Hakam bertanya kepadanya, 'Adakah engkau mendengar Rasulullah SAW melarang meniup minuman?' Abu Said menjawab, 'Ya.' Kemudian seorang lelaki berkata, 'Wahai Rasulullah, aku tidak dapat minum dengan satu nafas sahaja.' Rasulullah SAW bersabda, 'Alihkan cawan itu dari mulutmu, kemudian tarik nafas.' Lelaki itu berkata, 'Kadang-kadang aku melihat kotoran terapung di dalamnya.' Baginda bersabda, 'Maka tuangkanlah.' "
  },
  {
    "id": 35986,
    "hadith_number": 1808,
    "tajuk_hadith": "Umar, Ali, dan Uthman Minum Berdiri",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik that he had heard that Umar ibn\nal-Khattab and Ali ibn Abi Talib and Uthman ibn Affan drank while\nstanding.",
    "arabic_text": "حَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، وَعَلِيَّ بْنَ أَبِي طَالِبٍ، وَعُثْمَانَ بْنَ عَفَّانَ، كَانُوا يَشْرَبُونَ قِيَامًا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik bahawa dia mendengar bahawa Umar al-Khattab, Ali bin Abi Talib, dan Uthman bin Affan pernah minum sambil berdiri."
  },
  {
    "id": 35987,
    "hadith_number": 1809,
    "tajuk_hadith": "Tidak Menemukan Kerugian dalam Minum Ketika Berdiri",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Ibn Shihab that A'isha, umm\nal-muminin and Sad ibn Abi Waqqas did not see any harm in a man\ndrinking while standing.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ، وَسَعْدَ بْنَ أَبِي وَقَّاصٍ، كَانَا لاَ يَرَيَانِ بِشُرْبِ الإِنْسَانِ وَهُوَ قَائِمٌ بَأْسًا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Ibn Shihab, bahawa Aisyah, Ummul Mukminin, dan Said bin Abi Waqqas tidak melihat sebarang keburukan dalam seorang lelaki meminum air ketika berdiri."
  },
  {
    "id": 35988,
    "hadith_number": 1810,
    "tajuk_hadith": "Abdullah bin Umar Minum Berdiri",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik that Abu Jafar al-Qari said, \"I\nsaw Abdullah ibn Umar drink while standing.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ أَبِي جَعْفَرٍ الْقَارِيِّ، أَنَّهُ قَالَ رَأَيْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ يَشْرَبُ قَائِمًا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik bahawa Abu Ja'far al-Qari berkata, \"Saya melihat Abdullah bin Umar minum sambil berdiri.\""
  },
  {
    "id": 35989,
    "hadith_number": 1811,
    "tajuk_hadith": "Minuman Semasa Berdiri",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Amir ibn Abdullah ibn az-\nZubayr that his father used to drink while standing.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يَشْرَبُ قَائِمًا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Amir bin Abdullah bin Zubair, daripada bapanya, bahawa bapanya itu biasa minum sambil berdiri."
  },
  {
    "id": 35990,
    "hadith_number": 1812,
    "tajuk_hadith": "Rasulullah SAW Membagikan Susu Kepada Orang Arab Badui",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Anas ibn\nMalik that the Messenger of Allah, may Allah bless him and grant him\npeace, was brought some milk which was mixed with well-water. There\nwas a Bedouin at his right side and Abu Bakr as-Siddiq on his left. He\ndrank and then gave it to the Bedouin and said, \"The right-hand to the\nright-hand.\"",
    "arabic_text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أُتِيَ بِلَبَنٍ قَدْ شِيبَ بِمَاءٍ مِنَ الْبِئْرِ وَعَنْ يَمِينِهِ أَعْرَابِيٌّ وَعَنْ يَسَارِهِ أَبُو بَكْرٍ الصِّدِّيقُ فَشَرِبَ ثُمَّ أَعْطَى الأَعْرَابِيَّ وَقَالَ ‏\n\"‏ الأَيْمَنَ فَالأَيْمَنَ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Anas bin Malik bahawa Rasulullah SAW dihidangkan susu yang dicampur dengan air telaga. Di sebelah kanan baginda ada seorang Arab Badwi dan di sebelah kiri baginda, Abu Bakar al-Siddiq. Baginda meminum susu itu, kemudian memberikannya kepada orang Arab Badwi itu dan bersabda, \"Yang sebelah kanan untuk yang sebelah kanan.\""
  },
  {
    "id": 35991,
    "hadith_number": 1813,
    "tajuk_hadith": "Perlakuan Rasulullah SAW dengan Anak Muda dan Orang Tua",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Abu Hazim ibn Dinar from Sahl\nibn Sad al-Ansari that the Messenger of Allah, may Allah bless him and\ngrant him peace, was brought a drink and he drank some of it. There\nwas a boy at his right and some old men on his left. He said to the\nboy, \"Will you give me permission to give it to these people?\" The boy\nsaid, \"No, Messenger of Allah, I will not prefer anyone to get my\nportion from you.\" He said, \"So the Messenger of Allah, may Allah\nbless him and grant him peace, placed it in his hand.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ، عَنْ سَهْلِ بْنِ سَعْدٍ الأَنْصَارِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أُتِيَ بِشَرَابٍ فَشَرِبَ مِنْهُ وَعَنْ يَمِينِهِ غُلاَمٌ وَعَنْ يَسَارِهِ الأَشْيَاخُ فَقَالَ لِلْغُلاَمِ ‏\n\"‏ أَتَأْذَنُ لِي أَنْ أُعْطِيَ هَؤُلاَءِ ‏\"‏ ‏.‏ فَقَالَ الْغُلاَمُ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ لاَ أُوثِرُ بِنَصِيبِي مِنْكَ أَحَدًا ‏.‏ قَالَ فَتَلَّهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي يَدِهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abu Hazim bin Dinar, daripada Sahl bin Sa'ad al-Ansari bahawa Rasulullah SAW didatangi dengan minuman, lalu Baginda minum sebahagiannya.  Di sebelah kanan Baginda ada seorang budak lelaki, dan di sebelah kiri ada beberapa orang tua. Baginda bertanya kepada budak lelaki itu, \"Bolehkah saya memberikan minuman ini kepada mereka?\" Budak lelaki itu menjawab, \"Tidak, wahai Rasulullah, saya tidak akan mengutamakan sesiapa pun untuk mendapatkan bahagian saya daripada minuman tuan.\" Baginda lalu meletakkan minuman itu di tangan budak lelaki itu."
  },
  {
    "id": 35992,
    "hadith_number": 1814,
    "tajuk_hadith": "Kisah Rasulullah SAW Menerima Makanan dari Umm Sulaim",
    "perawi_melayu": "Yahya dari Malik, dari Ishaq bin Abdullah bin Abi Talha, yang mendengar Anas bin Malik berkata",
    "english_text": "Yahya related to me from Malik that Ishaq ibn Abdullah ibn Abi\nTalha heard Anas ibn Malik say that Abu Talha had said to Umm Sulaym,\n\"I have just been listening to the Messenger of Allah, may Allah bless\nhim and grant him peace, and his voice was very weak. I recognised\nhunger in it, so, do you have anything?\" She replied, \"Yes,\" and\nbrought out some barley loaves. She took her long head scarf and\nwrapped up the bread with part of it and put it into my (Anas's) hand\nand gave me part of it to wear. Then she sent me to the Messenger of\nAllah, may Allah bless him and grant him peace.\"\n\n\nAnas\ncontinued, \"I took it, and I found the Messenger of Allah, may Allah\nbless him and grant him peace, sitting in the mosque with some people.\nI watched them. The Messenger of Allah, may Allah bless him and grant\nhim peace, said, 'Did Abu Talha send you?' I replied, 'Yes.' He said,\n'For food?' I said, 'Yes.' The Messenger of Allah, may Allah bless him\nand grant him peace, said to those with him, 'Let us go.' He set off\nand I went among them until I came to Abu Talha and told him. Abu\nTalha said, 'Umm Sulaym! The Messenger of Allah, may Allah bless him\nand grant him peace, has brought people and we have no food. What\nshall we give them to eat?' She said, 'Allah and His Messenger know\nbest.' \"\n\n\nAnas continued, \"Abu Talha went out and met the\nMessenger of Allah, may Allah bless him and grant him peace, and the\nMessenger of Allah, may Allah bless him and grant him peace,\napproached with Abu Talha until they entered. The Messenger of Allah,\nmay Allah bless him and grant him peace, said, 'Come now, Umm Sulaym,\nwhat have you got?' She brought out bread. The Messenger of Allah, may\nAllah bless him and grant him peace, ordered it to be broken into\npieces, and Umm Sulaym squeezed out onto it a container of clarified\nbutter which she had seasoned. Then the Messenger of Allah, may Allah\nbless him and grant him peace, said whatever Allah wished him to say,\nand said, 'Will you give permission for ten of them to come in?' He\ngave them permission, and they ate until they were full and then left.\nHe said, 'Give permission to ten more.' He gave them permission, and\nthey ate until they were full and left. Then he said, 'Give permission\nto ten more.' He gave them permission and they ate until they were\nfull and left. Then he said, 'Give permission to ten more.' He gave\npermission and they ate until they were full and left. There were\nseventy or eighty men.\"",
    "arabic_text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ أَبُو طَلْحَةَ لأُمِّ سُلَيْمٍ لَقَدْ سَمِعْتُ صَوْتَ، رَسُولِ اللَّهِ صلى الله عليه وسلم ضَعِيفًا أَعْرِفُ فِيهِ الْجُوعَ فَهَلْ عِنْدَكِ مِنْ شَىْءٍ فَقَالَتْ نَعَمْ ‏.‏ فَأَخْرَجَتْ أَقْرَاصًا مِنْ شَعِيرٍ ثُمَّ أَخَذَتْ خِمَارًا لَهَا فَلَفَّتِ الْخُبْزَ بِبَعْضِهِ ثُمَّ دَسَّتْهُ تَحْتَ يَدِي وَرَدَّتْنِي بِبَعْضِهِ ثُمَّ أَرْسَلَتْنِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ فَذَهَبْتُ بِهِ فَوَجَدْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم جَالِسًا فِي الْمَسْجِدِ وَمَعَهُ النَّاسُ فَقُمْتُ عَلَيْهِمْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ آرْسَلَكَ أَبُو طَلْحَةَ ‏\"‏ ‏.‏ قَالَ فَقُلْتُ نَعَمْ ‏.‏ قَالَ ‏\"‏ لِلطَّعَامِ ‏\"‏ ‏.‏ فَقُلْتُ نَعَمْ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِمَنْ مَعَهُ ‏\"‏ قُومُوا ‏\"‏ ‏.‏ قَالَ فَانْطَلَقَ وَانْطَلَقْتُ بَيْنَ أَيْدِيهِمْ حَتَّى جِئْتُ أَبَا طَلْحَةَ فَأَخْبَرْتُهُ فَقَالَ أَبُو طَلْحَةَ يَا أُمَّ سُلَيْمٍ قَدْ جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالنَّاسِ وَلَيْسَ عِنْدَنَا مِنَ الطَّعَامِ مَا نُطْعِمُهُمْ ‏.‏ فَقَالَتِ اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ فَانْطَلَقَ أَبُو طَلْحَةَ حَتَّى لَقِيَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَقْبَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو طَلْحَةَ مَعَهُ حَتَّى دَخَلاَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلُمِّي يَا أُمَّ سُلَيْمٍ مَا عِنْدَكِ ‏\"‏ ‏.‏ فَأَتَتْ بِذَلِكَ الْخُبْزِ فَأَمَرَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَفُتَّ وَعَصَرَتْ عَلَيْهِ أُمُّ سُلَيْمٍ عُكَّةً لَهَا فَآدَمَتْهُ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَا شَاءَ اللَّهُ أَنْ يَقُولَ ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ بِالدُّخُولِ ‏\"‏ ‏.‏ فَأَذِنَ لَهُمْ فَأَكَلُوا حَتَّى شَبِعُوا ثُمَّ خَرَجُوا ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ ‏\"‏ ‏.‏ فَأَذِنَ لَهُمْ فَأَكَلُوا حَتَّى شَبِعُوا ثُمَّ خَرَجُوا ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ ‏\"‏ ‏.‏ فَأَذِنَ لَهُمْ فَأَكَلُوا حَتَّى شَبِعُوا ثُمَّ خَرَجُوا ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ ‏\"‏ ‏.‏ فَأَذِنَ لَهُمْ فَأَكَلُوا حَتَّى شَبِعُوا ثُمَّ خَرَجُوا ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ ‏\"‏ ‏.‏ حَتَّى أَكَلَ الْقَوْمُ كُلُّهُمْ وَشَبِعُوا وَالْقَوْمُ سَبْعُونَ رَجُلاً أَوْ ثَمَانُونَ رَجُلاً ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Ishaq bin Abdullah bin Abi Talhah, bahawa beliau mendengar Anas bin Malik berkata: Abu Talhah berkata kepada Umm Sulaim, \"Sesungguhnya aku mendengar suara Rasulullah SAW yang lemah, aku dapati rasa lapar di dalamnya. Adakah ada sesuatu di sisi tuan?\"  Umm Sulaim menjawab, \"Ya.\" Kemudian, beliau mengeluarkan beberapa keping roti dari gandum. Umm Sulaim mengambil selendang kepalanya, membalut roti dengan sebahagiannya, meletakkannya di tangan saya (Anas), dan memberikan sebahagiannya untuk dipakai. Kemudian, beliau menghantar saya kepada Rasulullah SAW.  Saya membawa roti itu, dan saya mendapati Rasulullah SAW sedang duduk di masjid bersama beberapa orang. Saya memerhatikan mereka. Rasulullah SAW bertanya, \"Adakah Abu Talhah menghantar kamu?\" Saya menjawab, \"Ya.\" Beliau bertanya, \"Untuk makanan?\" Saya menjawab, \"Ya.\" Rasulullah SAW bersabda kepada orang-orang yang bersama-Nya, \"Marilah kita pergi.\" Kemudian,  beliau pergi dan saya mengikuti mereka hingga sampai kepada Abu Talhah dan memberitahunya. Abu Talhah berkata, \"Umm Sulaim, Rasulullah SAW telah membawa orang ramai, tetapi kami tidak mempunyai makanan. Apakah yang akan kita berikan kepada mereka untuk dimakan?\" Umm Sulaim menjawab, \"Allah dan Rasul-Nya lebih mengetahui.\"  Abu Talhah keluar dan bertemu Rasulullah SAW. Rasulullah SAW bersama Abu Talhah masuk. Rasulullah SAW bertanya, \"Umm Sulaim, apa yang ada di sisi tuan?\" Beliau membawa roti. Rasulullah SAW menyuruh roti dipecahkan dan Umm Sulaim mengoleskan mentega cair yang dibumbui ke atasnya. Kemudian Rasulullah SAW bersabda (sesuatu yang diinginkan oleh Allah) dan berkata, \"Izinkan sepuluh orang masuk.\" Rasulullah SAW mengizinkan mereka masuk, mereka makan hingga kenyang dan keluar. Beliau berkata, \"Izinkan sepuluh orang lagi.\" Beliau mengizinkan mereka, mereka makan hingga kenyang dan keluar.  Beliau berkata, \"Izinkan sepuluh orang lagi.\" Beliau mengizinkan mereka, mereka makan hingga kenyang dan keluar. Beliau berkata, \"Izinkan sepuluh orang lagi.\" Beliau mengizinkan mereka, mereka makan hingga kenyang dan keluar. Terdapat tujuh puluh atau delapan puluh lelaki."
  },
  {
    "id": 35993,
    "hadith_number": 1815,
    "tajuk_hadith": "Keberkatan Makanan dan Kekurangannya",
    "perawi_melayu": "Yahya daripada Malik daripada Abu'z-Zinad daripada al-Araj daripada Abu Hurairah",
    "english_text": "Yahya related to me from Malik from Abu'z-Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"The food of two is enough for three, and the food of\nthree is enough for four.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ طَعَامُ الاِثْنَيْنِ كَافِي الثَّلاَثَةِ وَطَعَامُ الثَّلاَثَةِ كَافِي الأَرْبَعَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abu'z-Zinad, daripada al-Araj, daripada Abu Hurairah bahawa Rasulullah SAW bersabda, \"Makanan dua orang cukup untuk tiga orang, dan makanan tiga orang cukup untuk empat orang.\""
  },
  {
    "id": 35994,
    "hadith_number": 1816,
    "tajuk_hadith": "Langkah-langkah Pencegahan Daripada Gangguan Syaitan dan Bahaya",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Abu'z-Zubayr al-Makki from\nJabir ibn Abdullah that the Messenger of Allah, may Allah bless him\nand grant him peace, said, \"Lock the door, tie the waterskin, turn the\nvessel over or cover it, and put out the lamp. Shaytan does not open a\nlocked door or untie a tied knot, or uncover a vessel. A mouse may set\nfire to people's houses about them.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَغْلِقُوا الْبَابَ وَأَوْكُوا السِّقَاءَ وَأَكْفِئُوا الإِنَاءَ - أَوْ خَمِّرُوا الإِنَاءَ - وَأَطْفِئُوا الْمِصْبَاحَ فَإِنَّ الشَّيْطَانَ لاَ يَفْتَحُ غَلَقًا وَلاَ يَحُلُّ وِكَاءً وَلاَ يَكْشِفُ إِنَاءً وَإِنَّ الْفُوَيْسِقَةَ تُضْرِمُ عَلَى النَّاسِ بَيْتَهُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abu Zubair al-Makki, daripada Jabir bin Abdullah bahawa Rasulullah SAW bersabda, \"Kuncilah pintu, ikatlah kulit air, tolak atau tutup bekas, dan padamkan pelita. Sesungguhnya Syaitan tidak akan membuka pintu yang terkunci, tidak akan melonggarkan ikatan yang terikat, dan tidak akan membuka bekas. Sesungguhnya tikus boleh menyebabkan kebakaran rumah orang.\""
  },
  {
    "id": 35995,
    "hadith_number": 1817,
    "tajuk_hadith": "Mengutamakan Jiran dan Tetamu dalam Islam",
    "perawi_melayu": "Yahya daripada Malik daripada Said bin Abi Said al-Maqburi daripada Abu Shurayh al-Kabi",
    "english_text": "Yahya related to me from Malik from Said ibn Abi Said al-Maqburi\nfrom Abu Shurayh al-Kabi that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Whoever believes in Allah and the Last\nDay should speak good or be silent. Whoever believes in Allah and the\nLast Day should be generous to his neighbour. Whoever believes in\nAllah and the Last Day, should be generous to his guest. His welcome\nis for a day and a night, and his hospitality is for three days.\nWhatever is more than that is sadaqa. It is not halal for a guest to\nstay with a man until he becomes a burden.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي شُرَيْحٍ الْكَعْبِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ جَارَهُ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ جَائِزَتُهُ يَوْمٌ وَلَيْلَةٌ وَضِيَافَتُهُ ثَلاَثَةُ أَيَّامٍ فَمَا كَانَ بَعْدَ ذَلِكَ فَهُوَ صَدَقَةٌ وَلاَ يَحِلُّ لَهُ أَنْ يَثْوِيَ عِنْدَهُ حَتَّى يُحْرِجَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Perawi Yahya meriwayatkan daripada Malik, daripada Said bin Abi Said al-Maqburi, daripada Abu Shurayh al-Kabi bahawa Rasulullah SAW bersabda:\n\"Sesiapa yang beriman kepada Allah dan Hari Akhirat, hendaklah dia berkata yang baik atau diam. Sesiapa yang beriman kepada Allah dan Hari Akhirat, hendaklah dia memuliakan jirannya. Sesiapa yang beriman kepada Allah dan Hari Akhirat, hendaklah dia memuliakan tetamunya. Tempoh sambutan tetamu adalah sehari semalam, dan perkhidmatannya adalah selama tiga hari. Apa yang melebihi tempoh itu adalah sedekah. Tidak dibolehkan tetamu tinggal di rumah seseorang sehingga menyusahkan tuan rumah.\""
  },
  {
    "id": 35996,
    "hadith_number": 1818,
    "tajuk_hadith": "Kebaikan Menolong Haiwan dan Ganjarannya",
    "perawi_melayu": "Yahya daripada Malik daripada Sumayyah, mawla Abu Bakar, daripada Abu Salih al-Samman, daripada Abu Hurairah",
    "english_text": "Yahya related to me from Malik from Sumayy, the mawla of Abu Bakr\nfrom Abu Salih as-Samman from Abu Hurayra that the Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"A man was walking on a\nroad when he became very thirsty. He found a well and went into it and\ndrank and came out. There was a dog panting and eating earth out of\nthirst. The man said, 'This dog has become as thirsty as I was.' He\nwent down into the well and filled his shoe and then held it in his\nmouth until he climbed out and gave the dog water to drink. Allah\nthanked him for it and forgave him.\" They said, \"Messenger of Allah,\ndo we have a reward for taking care of beasts?\" He said, \"There is a\nreward for every one with a moist liver.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَمَا رَجُلٌ يَمْشِي بِطَرِيقٍ إِذِ اشْتَدَّ عَلَيْهِ الْعَطَشُ فَوَجَدَ بِئْرًا فَنَزَلَ فِيهَا فَشَرِبَ وَخَرَجَ فَإِذَا كَلْبٌ يَلْهَثُ يَأْكُلُ الثَّرَى مِنَ الْعَطَشِ فَقَالَ الرَّجُلُ لَقَدْ بَلَغَ هَذَا الْكَلْبَ مِنَ الْعَطَشِ مِثْلُ الَّذِي بَلَغَ مِنِّي فَنَزَلَ الْبِئْرَ فَمَلأَ خُفَّهُ ثُمَّ أَمْسَكَهُ بِفِيهِ حَتَّى رَقِيَ فَسَقَى الْكَلْبَ فَشَكَرَ اللَّهُ لَهُ فَغَفَرَ لَهُ ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ وَإِنَّ لَنَا فِي الْبَهَائِمِ لأَجْرًا فَقَالَ ‏\"‏ فِي كُلِّ ذَاتِ كَبِدٍ رَطْبَةٍ أَجْرٌ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku (Yahya) daripada Malik daripada Sumayyah, mawla Abu Bakar, daripada Abu Salih al-Samman, daripada Abu Hurairah bahawa Rasulullah SAW bersabda, \"Suatu ketika, seorang lelaki sedang berjalan di jalan raya, lalu dia sangat kehausan. Dia mendapati sebuah telaga, maka dia turun ke dalamnya, minum dan keluar. Dia mendapati seekor anjing yang sedang tercungap-cungap dan memakan tanah kerana kehausan. Lelaki itu berkata, 'Anjing ini juga merasakan kehausan sama seperti aku.' Lalu dia turun ke telaga, mengisikan sepatunya dengan air, dan memegangnya dengan mulutnya sehingga naik ke atas dan memberikan air kepada anjing itu untuk diminum. Allah bersyukur kepadanya dan mengampuninya.\" Mereka bertanya, \"Wahai Rasulullah, adakah ganjaran untuk kita menjaga haiwan?\" Baginda bersabda, \"Setiap yang berhati basah (hidup) akan mendapat ganjaran.\""
  },
  {
    "id": 35997,
    "hadith_number": 1819,
    "tajuk_hadith": "Pengorbanan dan Rezeki dalam Perjalanan Usrah Nabi",
    "perawi_melayu": "Yahya daripada Malik daripada Wahb ibn Kaysan daripada Jabir ibn Abdullah",
    "english_text": "Yahya related to me from Malik from Wahb ibn Kaysan that Jabir\nibn Abdullah said, \"The Messenger of Allah, may Allah bless him and\ngrant him peace, sent a delegation to the coast. Abu Ubayda ibn al-\nJarrah was in command of them. There were 300 people and I was among\nthem. We went out until we had gone part of the way and our provisions\nwere finished. Abu Ubayda ordered that the provisions of the army be\ngathered up and they amounted to two containers of dates. He used to\ngive us a little provision from it each day until it was finished, and\nwe used to have only a single date each. I said, 'What use is one\ndate?' He said, 'We will certainly feel its loss when they are\nfinished.' \"\n\n\nJabir continued, \"Then we reached the sea and\nthere was a fish like a small mountain. The army ate from it for\neighteen nights. Then Abu Ubayda ordered two ribs from it to be set\nup. Then he commanded that a camel be ridden underneath them and it\ndid not touch them.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ وَهْبِ بْنِ كَيْسَانَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ قَالَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَعْثًا قِبَلَ السَّاحِلِ فَأَمَّرَ عَلَيْهِمْ أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ وَهُمْ ثَلاَثُمِائَةٍ ‏.‏ قَالَ وَأَنَا فِيهِمْ - قَالَ - فَخَرَجْنَا حَتَّى إِذَا كُنَّا بِبَعْضِ الطَّرِيقِ فَنِيَ الزَّادُ فَأَمَرَ أَبُو عُبَيْدَةَ بِأَزْوَادِ ذَلِكَ الْجَيْشِ فَجُمِعَ ذَلِكَ كُلُّهُ فَكَانَ مِزْوَدَىْ تَمْرٍ - قَالَ - فَكَانَ يُقَوِّتُنَاهُ كُلَّ يَوْمٍ قَلِيلاً قَلِيلاً حَتَّى فَنِيَ وَلَمْ تُصِبْنَا إِلاَّ تَمْرَةٌ تَمْرَةٌ فَقُلْتُ وَمَا تُغْنِي تَمْرَةٌ فَقَالَ لَقَدْ وَجَدْنَا فَقْدَهَا حِينَ فَنِيَتْ - قَالَ - ثُمَّ انْتَهَيْنَا إِلَى الْبَحْرِ فَإِذَا حُوتٌ مِثْلُ الظَّرِبِ فَأَكَلَ مِنْهُ ذَلِكَ الْجَيْشُ ثَمَانِيَ عَشْرَةَ لَيْلَةً ثُمَّ أَمَرَ أَبُو عُبَيْدَةَ بِضِلَعَيْنِ مِنْ أَضْلاَعِهِ فَنُصِبَا ثُمَّ أَمَرَ بِرَاحِلَةٍ فَرُحِلَتْ ثُمَّ مَرَّتْ تَحْتَهُمَا وَلَمْ تُصِبْهُمَا",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Wahb bin Kaysan, daripada Jabir bin Abdullah yang berkata, \"Rasulullah SAW telah menghantar rombongan ke pantai. Abu Ubaydah bin al-Jarrah dilantik sebagai pemimpin mereka, seramai 300 orang, dan saya turut serta. Kami berjalan sehingga bekalan makanan kami habis di pertengahan perjalanan. Abu Ubaydah memerintahkan agar semua bekalan tentera dikumpulkan, dan ia cukup untuk dua tong kurma. Setiap hari, sedikit demi sedikit bekalan diberi sehingga habis, dan setiap kami hanya mendapat sehelai kurma sahaja. Saya bertanya, 'Apakah faedah satu kurma?', Dia menjawab, 'Tentu, kita akan merinduinya apabila habis.'\" Kemudian kami sampai ke laut, dan terdapat seekor ikan sebesar gunung. Tentera memakan ikan itu selama 18 malam. Kemudian Abu Ubaydah memerintahkan agar dua rusuk ikan itu didirikan. Kemudian beliau memerintahkan agar unta dilalui di bawah rusuk itu dan unta itu tidak menyentuhnya.\""
  },
  {
    "id": 35998,
    "hadith_number": 1820,
    "tajuk_hadith": "Keutamaan Bersedekah Kepada Jiran Walau Sedikit",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Zayd ibn Aslam from Amr ibn\nSad ibn Muadh from his grandmother that the Messenger of Allah, may\nAllah bless him and grant him peace, said, \"O trusting women, none of\nyou must consider even a roasted sheep's trotter too small to give to\nher neighbour.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَمْرِو بْنِ سَعْدِ بْنِ مُعَاذٍ، عَنْ جَدَّتِهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَا نِسَاءَ الْمُؤْمِنَاتِ لاَ تَحْقِرَنَّ إِحْدَاكُنَّ لِجَارَتِهَا وَلَوْ كُرَاعَ شَاةٍ مُحْرَقًا ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, daripada Zayd bin Aslam, daripada Amr bin Sa'ad bin Mu'adz, daripada neneknya, bahawa Rasulullah SAW bersabda, \"Wahai kaum wanita yang beriman, janganlah sesiapa di antara kamu meremehkan pemberian kepada jirannya, walaupun ia sekadar tulang rusuk kambing bakar.\""
  },
  {
    "id": 35999,
    "hadith_number": 1821,
    "tajuk_hadith": "Kutukan Allah terhadap Yahudi kerana Makan Harga Lemak yang Diharamkan",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik that Abdullah ibn Abi Bakr said,\n\"The Messenger of Allah, may Allah bless him and grant him peace,\nsaid, 'May Allah curse the jews! They were forbidden to eat fat, so\nthey sold it and ate its price.' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ قَاتَلَ اللَّهُ الْيَهُودَ نُهُوا عَنْ أَكْلِ الشَّحْمِ فَبَاعُوهُ فَأَكَلُوا ثَمَنَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abdullah bin Abi Bakar, bahawa dia berkata, Rasulullah SAW bersabda:\n\"Semoga Allah melaknat orang Yahudi! Mereka dilarang makan lemak, lalu mereka menjualnya dan makan hasilnya.\""
  },
  {
    "id": 36000,
    "hadith_number": 1822,
    "tajuk_hadith": "Petua kesihatan daripada Nabi Isa alaihissalam kepada Bani Israil",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik that he had heard that Isa ibn\nMaryam used to say, \"O Banu Israil! You must drink pure water and the\ngreen things of the land and barley bread . Beware of wheat bread, for\nyou will not be grateful enough for it.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عِيسَى ابْنَ مَرْيَمَ، كَانَ يَقُولُ يَا بَنِي إِسْرَائِيلَ عَلَيْكُمْ بِالْمَاءِ الْقَرَاحِ وَالْبَقْلِ الْبَرِّيِّ وَخُبْزِ الشَّعِيرِ وَإِيَّاكُمْ وَخُبْزَ الْبُرِّ فَإِنَّكُمْ لَنْ تَقُومُوا بِشُكْرِهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa beliau mendengar bahawa Isa bin Maryam pernah berkata, \"Wahai Bani Israil! Minumlah air yang suci dan sayur-sayuran hijau serta roti barli. Jauhkan diri daripada roti gandum, kerana kamu tidak akan mampu bersyukur atasnya.\""
  },
  {
    "id": 36001,
    "hadith_number": 1823,
    "tajuk_hadith": "Rasulullah SAW Menghibur Orang Yang Kelaparan",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik that he heard that the Messenger\nof Allah, may Allah bless him and grant him peace, entered the mosque\nand found Abu Bakr as-Siddiq and Umar ibn al-Khattab there. He\nquestioned them and they said, \"Hunger has driven us out.\" The\nMessenger of Allah, may Allah bless him and grant him peace, said,\n\"And hunger has brought me out.\" They went to Abu'l-Haytham ibn at-\nTayyihan al-Ansari. He ordered that some barley that was in the house\nbe prepared and he got up to slaughter a sheep for them. The Messenger\nof Allah, may Allah bless him and grant him peace, said, \"Leave the\none with milk.\" He slaughtered a sheep for them and brought them sweet\nwater and it was hung on a palm-tree. Then they were brought the food\nand ate it and drank the water. The Messenger of Allah, may Allah\nbless him and grant him peace, recited, \"Then, on that day, you will\nbe asked concerning pleasure.\" (Sura 102 ayat 8).",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ الْمَسْجِدَ فَوَجَدَ فِيهِ أَبَا بَكْرٍ الصِّدِّيقَ وَعُمَرَ بْنَ الْخَطَّابِ فَسَأَلَهُمَا فَقَالاَ أَخْرَجَنَا الْجُوعُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَأَنَا أَخْرَجَنِي الْجُوعُ ‏\"‏ ‏.‏ فَذَهَبُوا إِلَى أَبِي الْهَيْثَمِ بْنِ التَّيِّهَانِ الأَنْصَارِيِّ فَأَمَرَ لَهُمْ بِشَعِيرٍ عِنْدَهُ يُعْمَلُ وَقَامَ يَذْبَحُ لَهُمْ شَاةً فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَكِّبْ عَنْ ذَاتِ الدَّرِّ ‏\"‏ ‏.‏ فَذَبَحَ لَهُمْ شَاةً وَاسْتَعْذَبَ لَهُمْ مَاءً فَعُلِّقَ فِي نَخْلَةٍ ثُمَّ أُتُوا بِذَلِكَ الطَّعَامِ فَأَكَلُوا مِنْهُ وَشَرِبُوا مِنْ ذَلِكَ الْمَاءِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَتُسْئَلُنَّ عَنْ نَعِيمِ هَذَا الْيَوْمِ ‏\"‏ ‏.‏",
    "malay_translation": "Diceritakan oleh Yahya daripada Malik bahawa beliau mendengar bahawa Rasulullah SAW memasuki masjid dan mendapati Abu Bakar al-Siddiq dan Umar al-Khattab di situ.  Baginda bertanya kepada mereka, dan mereka menjawab, \"Kelaparan telah mengusir kami.\"  Rasulullah SAW menjawab, \"Dan kelaparan juga telah mengusirku.\" Mereka pergi kepada Abu al-Haytham bin al-Tayyihan al-Ansari. Beliau memerintahkan agar sebahagian barli yang ada di rumahnya disediakan dan bangkit untuk menyembelih seekor kambing untuk mereka. Rasulullah SAW bersabda, \"Tinggalkan yang mengandung susu.\" Beliau menyembelih kambing untuk mereka dan membawa air tawar yang digantung di atas pokok kurma. Kemudian, mereka dihidangkan makanan dan minum air itu. Rasulullah SAW kemudiannya membaca ayat, \"Maka pada hari itu kamu akan ditanya tentang kenikmatan ini.\" (Surah Al-Duha, ayat 8)."
  },
  {
    "id": 36002,
    "hadith_number": 1824,
    "tajuk_hadith": "Umar bin al-Khattab Menolak Makan Samin Sehingga Hari Kebangkitan",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said that Umar ibn\nal-Khattab was eating bread with ghee. He summoned one of the desert\npeople and he began to eat and follow the grease in the dish with a\nmorsel of bread. Umar said, \"It is as if you were poor.\" He said, \"By\nAllah. I have not eaten ghee nor have I seen food with it since such-\nand-such a time.\" Umar declared, \"I shall not eat clarified butter\nuntil people are given life again like they were first given life,\"\n(i.e. on the Day of Rising.)",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَانَ يَأْكُلُ خُبْزًا بِسَمْنٍ فَدَعَا رَجُلاً مِنْ أَهْلِ الْبَادِيَةِ فَجَعَلَ يَأْكُلُ وَيَتَّبِعُ بِاللُّقْمَةِ وَضَرَ الصَّحْفَةِ فَقَالَ عُمَرُ كَأَنَّكَ مُقْفِرٌ ‏.‏ فَقَالَ وَاللَّهِ مَا أَكَلْتُ سَمْنًا وَلاَ رَأَيْتُ أَكْلاً بِهِ مُنْذُ كَذَا وَكَذَا ‏.‏ فَقَالَ عُمَرُ لاَ آكُلُ السَّمْنَ حَتَّى يَحْيَا النَّاسُ مِنْ أَوَّلِ مَا يَحْيَوْنَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik daripada Yahya bin Said bahawa Umar bin al-Khattab makan roti dengan mentega. Baginda memanggil seorang lelaki dari penduduk padang pasir dan lelaki itu mula makan serta mengikuti minyak di dalam pinggan dengan sesuap roti. Umar berkata, \"Seolah-olah engkau seorang yang miskin.\" Lelaki itu berkata, \"Demi Allah, aku tidak makan mentega dan tidak melihat makanan dengannya sejak masa yang demikian dan demikian.\" Umar berkata, \"Aku tidak akan makan mentega sehingga manusia dihidupkan kembali seperti ketika mereka dihidupkan pertama kali (iaitu pada Hari Kebangkitan)."
  },
  {
    "id": 36003,
    "hadith_number": 1825,
    "tajuk_hadith": "Keteladanan Umar al-Khattab dalam Makan Kurma",
    "perawi_melayu": "Yahya daripada Malik daripada Ishaq bin Abdullah bin Abi Talha daripada Anas bin Malik",
    "english_text": "Yahya related to me from Malik from Ishaq ibn Abdullah ibn Abi\nTalha that Anas ibn Malik said, \"I saw Umar ibn al-Khattab when he was\namir al-muminin being given a sa of dates, and he ate all of them,\neven the inferior ones.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ رَأَيْتُ عُمَرَ بْنَ الْخَطَّابِ - وَهُوَ يَوْمَئِذٍ أَمِيرُ الْمُؤْمِنِينَ - يُطْرَحُ لَهُ صَاعٌ مِنْ تَمْرٍ فَيَأْكُلُهُ حَتَّى يَأْكُلَ حَشَفَهَا ‏.‏",
    "malay_translation": "Yahya menceritakan kepada saya daripada Malik, daripada Ishaq bin Abdullah bin Abi Talha, daripada Anas bin Malik yang berkata, \"Saya melihat Umar al-Khattab, ketika itu beliau adalah Amirul Mukminin, diberi satu sa kurma.  Beliau memakannya sehingga habis, termasuk yang kurang baik kualitinya."
  },
  {
    "id": 36004,
    "hadith_number": 1826,
    "tajuk_hadith": "Keinginan Umar al-Khattab Mengenai Belalang",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Abdullah bin Dinar, dari Abdullah bin Umar.",
    "english_text": "Yahya related to me from Malik from\nAbdullah ibn Dinar that Abdullah ibn Umar said, ''Umar ibn al-Khattab\nwas asked about locusts. He said, 'I would like to have a basket of\nthem, from which we could eat.' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ سُئِلَ عُمَرُ بْنُ الْخَطَّابِ عَنِ الْجَرَادِ، فَقَالَ وَدِدْتُ أَنَّ عِنْدِي، قَفْعَةً نَأْكُلُ مِنْهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Abdullah bin Dinar, dari Abdullah bin Umar bahawa Abdullah bin Umar berkata, \"Umar al-Khattab ditanya tentang belalang. Baginda menjawab, 'Saya ingin memiliki bakul belalang untuk kita makan.'\""
  },
  {
    "id": 36005,
    "hadith_number": 1827,
    "tajuk_hadith": "Keutamaan Mengasihi dan Merawat Ternakan",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Muhammad bin Amr bin Halhala, dari Humaid bin Malik bin Khu'haym",
    "english_text": "Yahya related to me from Malik from Muhammad ibn Amr ibn Halhala\nthat Humayd ibn Malik ibn Khu'haym said, \"I was sitting with Abu\nHurayra on his land at al-Aqiq. Some people rode out from Madina to\ncall upon Abu Hurayra. He told me to go to his mother, sending his\ngreetings and asking her to prepare some food.\" Humayd continued, \"She\nset down three loaves on a plate and some oil and salt. Then she put\nit on my head and I carried it to them. When I set it before them, Abu\nHurayra said, 'Allah is greater' and added, 'Praise be to Allah who\nhas filled us with bread after our food had previously been only water\nand dates,' as the people did not touch any of the food.\n\n\nWhen\nthey left, he said, 'O son of my brother, be good to your sheep and\nwipe the mucus from them and clean their pen. Pray in their quarter\nfor they are among the animals of the Garden. By He in Whose Hand my\nself is, a time is about to come upon people when a small group of\nsheep will be more beloved to their owner than the house of Marwan . '\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ، عَنْ حُمَيْدِ بْنِ مَالِكِ بْنِ خُثَيْمٍ، أَنَّهُ قَالَ كُنْتُ جَالِسًا مَعَ أَبِي هُرَيْرَةَ بِأَرْضِهِ بِالْعَقِيقِ فَأَتَاهُ قَوْمٌ مِنْ أَهْلِ الْمَدِينَةِ عَلَى دَوَابَّ فَنَزَلُوا عِنْدَهُ - قَالَ حُمَيْدٌ - فَقَالَ أَبُو هُرَيْرَةَ اذْهَبْ إِلَى أُمِّي فَقُلْ إِنَّ ابْنَكِ يُقْرِئُكِ السَّلاَمَ وَيَقُولُ أَطْعِمِينَا شَيْئًا ‏.‏ قَالَ فَوَضَعَتْ ثَلاَثَةَ أَقْرَاصٍ فِي صَحْفَةٍ وَشَيْئًا مِنْ زَيْتٍ وَمِلْحٍ ثُمَّ وَضَعَتْهَا عَلَى رَأْسِي وَحَمَلْتُهَا إِلَيْهِمْ فَلَمَّا وَضَعْتُهَا بَيْنَ أَيْدِيهِمْ كَبَّرَ أَبُو هُرَيْرَةَ وَقَالَ الْحَمْدُ لِلَّهِ الَّذِي أَشْبَعَنَا مِنَ الْخُبْزِ بَعْدَ أَنْ لَمْ يَكُنْ طَعَامُنَا إِلاَّ الأَسْوَدَيْنِ الْمَاءَ وَالتَّمْرَ ‏.‏ فَلَمْ يُصِبِ الْقَوْمُ مِنَ الطَّعَامِ شَيْئًا فَلَمَّا انْصَرَفُوا قَالَ يَا ابْنَ أَخِي أَحْسِنْ إِلَى غَنَمِكَ وَامْسَحِ الرُّعَامَ عَنْهَا وَأَطِبْ مُرَاحَهَا وَصَلِّ فِي نَاحِيَتِهَا فَإِنَّهَا مِنْ دَوَابِّ الْجَنَّةِ وَالَّذِي نَفْسِي بِيَدِهِ لَيُوشِكُ أَنْ يَأْتِيَ عَلَى النَّاسِ زَمَانٌ تَكُونُ الثُّلَّةُ مِنَ الْغَنَمِ أَحَبَّ إِلَى صَاحِبِهَا مِنْ دَارِ مَرْوَانَ ‏.‏",
    "malay_translation": "Humaid bin Malik bin Khu'haym menceritakan, \"Saya duduk bersama Abu Hurairah di tanah miliknya di Al-Aqiq. Beberapa orang dari Madinah datang menemuinya dengan kenderaan.  Abu Hurairah menyuruh saya pergi kepada ibunya, menyampaikan salam dan meminta makanan.\nIbunya meletakkan tiga roti dalam pinggan, bersama minyak dan garam. Beliau meletakkan makanan itu di kepala saya dan saya bawanya kepada Abu Hurairah dan rombongannya.\nKetika saya meletakkan makanan itu di hadapan mereka, Abu Hurairah bertakbir dan berkata, \"Segala puji bagi Allah yang telah memberi kita makanan setelah sebelumnya hanya air dan kurma.\"  Para tetamu itu tidak mengambil sebarang makanan.\nKetika mereka pulang, beliau berkata, \"Wahai anak saudaraku, berbuat baiklah kepada kambing-kambingmu. Lapiskan kotoran daripadanya dan bersihkan kandang mereka. Berdoalah bagi mereka, kerana mereka termasuk haiwan syurga. Demi Dia yang memegang nyawa saya, suatu zaman akan datang kepada manusia di mana sekumpulan kecil kambing lebih disukai oleh pemiliknya berbanding rumah Marwan.\""
  },
  {
    "id": 36006,
    "hadith_number": 1828,
    "tajuk_hadith": "Meminta Izin Sebelum Makan dan Mengingati Allah SWT",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Abu Nu'aim, dan Wahb bin Kaysan berkata",
    "english_text": "Yahya related to me from Malik from Abu Nuaym that Wahb ibn\nKaysan said, \"The Messenger of Allah, may Allah bless him and grant\nhim peace, was brought food while his stepson Umar ibn Salama was with\nhim. The Messenger of Allah, may Allah bless him and grant him peace,\nsaid to him, 'Say \"Bismillah,\" and eat what is in front of you.' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي نُعَيْمٍ، وَهْبِ بْنِ كَيْسَانَ قَالَ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِطَعَامٍ وَمَعَهُ رَبِيبُهُ عُمَرُ بْنُ أَبِي سَلَمَةَ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ سَمِّ اللَّهَ وَكُلْ مِمَّا يَلِيكَ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Yahya daripada Malik daripada Abu Nu'aim, dan Wahb bin Kaysan berkata, \" Rasulullah SAW dihidangkan makanan ketika itu bersama anak angkatnya, Umar bin Abi Salamah. Maka Rasulullah SAW bersabda kepadanya, 'Sebut nama Allah (Bismillah), dan makanlah apa yang ada di hadapanmu'."
  },
  {
    "id": 36007,
    "hadith_number": 1829,
    "tajuk_hadith": "Menyelia dan Memelihara Unta Anak Yatim",
    "perawi_melayu": "Yahya ibn Said dari Malik, daripada Yahya ibn Said, katanya dia mendengar al-Qasim ibn Muhammad berkata:",
    "english_text": "Yahya related to me from Malik that Yahya ibn Said said that he\nhad heard al-Qasim ibn Muhammad say that a man came to Abdullah ibn\nAbbas and said to him, \"I have an orphan and he has camels. Can I\ndrink from the camels' milk?\" Ibn Abbas said, \"If you search for the\nlost camels of his and treat the camels' mange and fill in the cracks\nin their water basin and give it water on the day it drinks, then\ndrink it without doing harm to the suckling camels by milking them\nexcessively.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ سَمِعْتُ الْقَاسِمَ بْنَ مُحَمَّدٍ، يَقُولُ جَاءَ رَجُلٌ إِلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍ فَقَالَ لَهُ إِنَّ لِي يَتِيمًا وَلَهُ إِبِلٌ أَفَأَشْرَبُ مِنْ لَبَنِ إِبِلِهِ فَقَالَ ابْنُ عَبَّاسٍ إِنْ كُنْتَ تَبْغِي ضَالَّةَ إِبِلِهِ وَتَهْنَأُ جَرْبَاهَا وَتَلُطُّ حَوْضَهَا وَتَسْقِيهَا يَوْمَ وِرْدِهَا فَاشْرَبْ غَيْرَ مُضِرٍّ بِنَسْلٍ وَلاَ نَاهِكٍ فِي الْحَلْبِ ‏.‏",
    "malay_translation": "Telah diceritakan kepada saya oleh Malik, dari Yahya bin Said, bahawa dia mendengar al-Qasim bin Muhammad berkata, \"Seorang lelaki datang kepada Abdullah bin Abbas dan berkata kepadanya, 'Saya mempunyai seorang anak yatim dan dia mempunyai unta. Bolehkah saya minum susu unta itu?\" Abdullah bin Abbas menjawab, 'Jika engkau mencari unta yang hilang miliknya, merawat penyakit kudis unta-unta itu, menutup lubang-lubang di bekas airnya, dan memberinya minum pada hari ia meminum air, maka minumlah susu itu tanpa merosakkan anak-anak unta yang menyusu dengan memerah susu terlalu banyak.'\" "
  },
  {
    "id": 36008,
    "hadith_number": 1830,
    "tajuk_hadith": "Doa Syukur atas Nikmat dan Pemeliharaan Allah SWT",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa that his\nfather never brought food or drink, nor even a remedy which he ate or\ndrank but that he said, \"Praise be to Allah who has guided us and fed\nus and given us to drink and blessed us. Allah is greater. O Allah! We\nhave found Your blessing with every evil, give us every good in the\nmorning and evening. We ask You for its completion and its gratitude.\nThere is no good except Your good. There is no god other than You, the\nGod of the salihun and the Lord of the Worlds. Praise be to Allah.\nThere is no god but Allah. What Allah wills. There is no power except\nin Allah. O Allah! Bless us in what You have provided us with and\nprotect us from the punishment of the Fire!\"\n\n\nAl-hamdu\nlillahi-lladhi hadana wa at amana wa saqana wa naamana. Allahu akbar.\nAllahumma'l fatna nimatik bi-kulli sharr. Fa asbahna minha wa amsayna\nbi-kulli khayr. Nasaluka tamamaha wa shukraha. La khayr illa khayruk.\nWa la ilaha ghayruk. Ilaha'-saliheen wa rabba'l-alameen. Al-hamdu\nlillah. Wa la ilaha illa'llah. Ma sha'Allah. Wa la quwwata illa\nbillah. Allahumma barik lana fima razaqtana. Waqina adhaba'n-nar.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ كَانَ لاَ يُؤْتَى أَبَدًا بِطَعَامٍ وَلاَ شَرَابٍ حَتَّى الدَّوَاءُ فَيَطْعَمَهُ أَوْ يَشْرَبَهُ إِلاَّ قَالَ الْحَمْدُ لِلَّهِ الَّذِي هَدَانَا وَأَطْعَمَنَا وَسَقَانَاوَنَعَّمَنَا اللَّهُ أَكْبَرُ اللَّهُمَّ أَلْفَتْنَا نِعْمَتُكَ بِكُلِّ شَرٍّ فَأَصْبَحْنَا مِنْهَا وَأَمْسَيْنَا بِكُلِّ خَيْرٍ نَسْأَلُكَ تَمَامَهَا وَشُكْرَهَا لاَ خَيْرَ إِلاَّ خَيْرُكَ وَلاَ إِلَهَ غَيْرُكَ إِلَهَ الصَّالِحِينَ وَرَبَّ الْعَالَمِينَ الْحَمْدُ لِلَّهِ وَلاَ إِلَهَ إِلاَّ اللَّهُ مَا شَاءَ اللَّهُ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ اللَّهُمَّ بَارِكْ لَنَا فِيمَا رَزَقْتَنَا وَقِنَا عَذَابَ النَّارِ ‏.‏ قَالَ يَحْيَى سُئِلَ مَالِكٌ هَلْ تَأْكُلُ الْمَرْأَةُ مَعَ غَيْرِ ذِي مَحْرَمٍ مِنْهَا أَوْ مَعَ غُلاَمِهَا فَقَالَ مَالِكٌ لَيْسَ بِذَلِكَ بَأْسٌ إِذَا كَانَ ذَلِكَ عَلَى وَجْهِ مَا يُعْرَفُ لِلْمَرْأَةِ أَنْ تَأْكُلَ مَعَهُ مِنَ الرِّجَالِ ‏.‏ قَالَ وَقَدْ تَأْكُلُ الْمَرْأَةُ مَعَ زَوْجِهَا وَمَعَ غَيْرِهِ مِمَّنْ يُؤَاكِلُهُ أَوْ مَعَ أَخِيهَا عَلَى مِثْلِ ذَلِكَ وَيُكْرَهُ لِلْمَرْأَةِ أَنْ تَخْلُوَ مَعَ الرَّجُلِ لَيْسَ بَيْنَهُ وَبَيْنَهَا حُرْمَةٌ ‏.‏",
    "malay_translation": "Dari Yahya, daripada Malik, daripada Hisham bin Urwah daripada bapanya, bahawa bapanya tidak pernah menerima makanan atau minuman, bahkan ubat, melainkan dia mengucapkan, \"Segala puji bagi Allah yang telah memberi petunjuk kepada kami, memberi kami makanan dan minuman, dan menganugerahkan nikmat kepada kami. Allah Maha Besar. Ya Allah, limpahkan nikmat-Mu atas segala kesusahan, dan limpahkanlah segala kebaikan kepada kami pada waktu pagi dan petang. Kami memohon kepada-Mu kesempurnaan dan kesyukuran terhadap nikmat tersebut. Tidak ada kebaikan melainkan kebaikan-Mu. Tiada Tuhan melainkan Engkau, Tuhan orang-orang yang saleh dan Tuhan sekalian alam. Segala puji bagi Allah. Tiada Tuhan melainkan Allah. Apa yang dikehendaki Allah. Tiada kekuatan melainkan dengan pertolongan Allah. Ya Allah, berilah keberkatan kepada kami dalam rezeki yang Engkau berikan kepada kami dan peliharalah kami dari azab neraka!\"\n\nAlhamdulillah, Allah SWT yang memberi petunjuk, memberi rezeki, memberi minuman dan menganugerahkan nikmat. Allahuakbar. Ya Allah, nikmat Engkau telah menyelamatkan kita dari segala keburukan. Jadikanlah kami dalam kebaikan pada waktu pagi dan petang. Kami memohon kepada-Mu kesempurnaan dan kesyukuran. Tidak ada kebaikan melainkan kebaikan-Mu. Dan tidak ada Tuhan melainkan Engkau, Tuhan orang-orang saleh dan Tuhan sekalian alam. Alhamdulillah. Wa ilaaha illa Allah. Apa yang dikehendaki Allah. Tiada kekuatan melainkan dengan pertolongan Allah. Ya Allah, berilah keberkatan kepada kami di dalam rezeki yang Engkau berikan kepada kami dan peliharalah kami daripada azab neraka!"
  },
  {
    "id": 36009,
    "hadith_number": 1831,
    "tajuk_hadith": "Kebolehan Wanita Makan Bersama Bukan Keluarga atau Hamba",
    "perawi_melayu": "Yahya melaporkan bahawa Malik ditanya, \"Bolehkah seorang wanita makan dengan orang lain selain keluarganya atau hambanya?\" Malik menjawab, \"Tidak ada masalah jika cara makan tersebut dibenarkan bagi seorang wanita untuk makan bersama lelaki.\"",
    "english_text": "Yahya said that Malik was asked, \"Can a woman eat with other than\nher relative or slave?\" Malik said, \"There is no harm in that if it is\nin a manner which is accepted for a woman to eat with men.\"\n\n\nMalik said, \"A woman sometimes eats with her husband and with others\nhe dines with or with her brother in the same way. It is disapproved\nof for a woman to be alone with a man when there is no relationship\nbetween them by blood, marriage or suckling that would prevent him\nmarrying her.\"",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan bahawa Malik ditanya, \"Bolehkah seorang wanita makan bersama orang lain selain keluarganya atau hambanya?\" Malik menjawab, \"Tidak mengapa jika cara makan itu dibenarkan bagi seorang wanita untuk makan bersama lelaki.\"\n\nMalik berkata lagi, \"Kadangkala seorang wanita makan bersama suaminya dan orang-orang yang dia makan bersama atau bersama saudaranya dengan cara yang sama. Tidak digalakkan bagi seorang wanita untuk bersendirian dengan seorang lelaki jika tiada hubungan kekeluargaan, perkahwinan atau penyusuan yang menghalang perkahwinan di antara mereka.\""
  },
  {
    "id": 36010,
    "hadith_number": 1832,
    "tajuk_hadith": "Larangan Mengonsumsi Daging Dengan Sifat Keras",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ إِيَّاكُمْ وَاللَّحْمَ فَإِنَّ لَهُ ضَرَاوَةً كَضَرَاوَةِ الْخَمْرِ ‏.‏",
    "malay_translation": "Dan telah menceritakan kepadaku (dari) Malik, dari Yahya bin Said, bahawa Umar bin al-Khattab berkata, \"Jauhilah daging, kerana ia mempunyai kekerasan seperti kekerasan minuman keras.\""
  },
  {
    "id": 36011,
    "hadith_number": 1833,
    "tajuk_hadith": "Amaran Tentang Ketagihan Daging",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Yahya ibn Said, bahawa Umar ibn al-Khattab...",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said that Umar ibn\nal-Khattab said, \"Beware of meat. It has addictiveness like the\naddictiveness of wine.\"\n\n\nYahya related to me from Malik from\nYahya ibn Said that Umar ibn al-Khattab saw Jabir ibn Abdullah\ncarrying some meat. He said, \"What is this?\" He said, \"Amir al-\nmuminin. We desired meat and I bought some meat for a dirham.\" Umar\nsaid, \"Does one of you want to fill his belly apart from his neighbour\nor nephew? How can you overlook this ayat? 'You squandered your good\nthings in the life of this world and sought comfort in them.' \" (Sura\n46 ayat 20).",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، أَدْرَكَ جَابِرَ بْنَ عَبْدِ اللَّهِ وَمَعَهُ حِمَالُ لَحْمٍ فَقَالَ مَا هَذَا فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ قَرِمْنَا إِلَى اللَّحْمِ فَاشْتَرَيْتُ بِدِرْهَمٍ لَحْمًا ‏.‏ فَقَالَ عُمَرُ أَمَا يُرِيدُ أَحَدُكُمْ أَنْ يَطْوِيَ بَطْنَهُ عَنْ جَارِهِ أَوِ ابْنِ عَمِّهِ أَيْنَ تَذْهَبُ عَنْكُمْ هَذِهِ الآيَةُ ‏{‏أَذْهَبْتُمْ طَيِّبَاتِكُمْ فِي حَيَاتِكُمُ الدُّنْيَا وَاسْتَمْتَعْتُمْ بِهَا ‏}‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said, bahawa Umar bin al-Khattab melihat Jabir bin Abdullah membawa daging. Umar bertanya, \"Apa ini?\" Jabir menjawab, \"Wahai Amir al-Muminin, kami teringin daging, dan saya telah membelinya dengan satu dirham.\" Umar berkata, \"Adakah salah seorang daripada kamu ingin mengisi perutnya tanpa memikirkan jiran atau sepupunya? Di manakah ayat ini dalam ingatan kamu? 'Kamu telah membazirkan perkara baik kamu di dunia dan mencari kesenangan di dalamnya.'\" (Surah 46 ayat 20)."
  },
  {
    "id": 36012,
    "hadith_number": 1834,
    "tajuk_hadith": "Larangan Rasulullah SAW Memakai Cincin Emas dan Kesannya",
    "perawi_melayu": "Yahya daripada Malik daripada Abdullah bin Dinar daripada Abdullah bin Umar",
    "english_text": "Yahya related to me from Malik from Abdullah ibn Dinar from\n'Abdullah ibn 'Umar that the Messenger of Allah, may Allah bless him\nand grant him peace, used to wear a gold ring. Then the Messenger of\nAllah, may Allah bless him and grant him peace, stood up and threw it\naway and said, \"I will never wear it.\" He said, \"So the people threw\naway their rings.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَلْبَسُ خَاتَمًا مِنْ ذَهَبٍ ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَنَبَذَهُ وَقَالَ ‏\n\"‏ لاَ أَلْبَسُهُ أَبَدًا ‏\"‏ ‏.‏ قَالَ فَنَبَذَ النَّاسُ خَوَاتِيمَهُمْ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Abdullah bin Dinar daripada Abdullah bin Umar bahawa Rasulullah SAW pernah memakai cincin emas. Kemudian, Rasulullah SAW bangun dan membuangnya sambil bersabda, \"Aku tidak akan memakainya lagi.\"  Dikatakan bahawa orang ramai kemudian membuang cincin mereka."
  },
  {
    "id": 36013,
    "hadith_number": 1835,
    "tajuk_hadith": "Memohon Keizinan dan Memberikan Ijtihad Mengenai Memakai Cincin",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, yang meriwayatkan dari Sadaqa bin Yasar, yang berkata:",
    "english_text": "Yahya related to me from Malik that Sadaqa ibn Yasar said, \"I\nasked Said ibn al-Musayyab about wearing a ring. He said, 'Wear it,\nand tell people that I gave you that decision.' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ صَدَقَةَ بْنِ يَسَارٍ، أَنَّهُ قَالَ سَأَلْتُ سَعِيدَ بْنَ الْمُسَيَّبِ عَنْ لُبْسِ الْخَاتَمِ، فَقَالَ الْبَسْهُ وَأَخْبِرِ النَّاسَ، أَنِّي أَفْتَيْتُكَ بِذَلِكَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, yang meriwayatkan dari Sadaqa bin Yasar, bahawa dia berkata, \"Saya bertanya kepada Said bin al-Musayyab tentang memakai cincin. Beliau menjawab, 'Pakailah dan beritahu orang ramai bahawa saya telah memberi fatwa itu kepadamu.'\""
  },
  {
    "id": 36014,
    "hadith_number": 1836,
    "tajuk_hadith": "Perihal Menyingkirkan Perhiasan dan Loceng dari Leher",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "باب مَا جَاءَ فِي نَزْعِ الْمَعَالِيقِ وَالْجَرَسِ مِنَ الْعُنُقِ",
    "malay_translation": "Bab mengenai kisah-kisah yang menceritakan tentang menyingkirkan perhiasan dan loceng daripada leher."
  },
  {
    "id": 36015,
    "hadith_number": 1837,
    "tajuk_hadith": "Larangan Membiarkan Kalung Unta Tidak Diputuskan",
    "perawi_melayu": "Yahya daripada Malik daripada Abdullah bin Abi Bakr daripada Abbad bin Tamim, daripada Abu Bashir al-Ansari.",
    "english_text": "Yahya related to me from Malik from Abdullah ibn Abi Bakr from\nAbbad ibn Tamim that Abu Bashir al-Ansari told him that he was with\nthe Messenger of Allah, may Allah bless him and grant him peace, on\none of his journeys. He related, \"The Messenger of Allah,  may Allah\nbless him and grant him peace, sent a messenger.\" (Abdullah ibn Abi\nBakr said, (I think that he said it was while the people were in their\nresting place.) He said, \"Do not let a single-string necklace, or any\nnecklace, remain unbroken on the neck of a camel.\"\n\n\nYahya\nsaid, \"I heard Malik say, 'I think that was because of the evil eye.'\n''",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، أَنَّ أَبَا بَشِيرٍ الأَنْصَارِيَّ، أَخْبَرَهُ أَنَّهُ، كَانَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي بَعْضِ أَسْفَارِهِ - قَالَ - فَأَرْسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَسُولاً قَالَ عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ حَسِبْتُ أَنَّهُ قَالَ وَالنَّاسُ فِي مَقِيلِهِمْ ‏\n\"‏ لاَ تَبْقَيَنَّ فِي رَقَبَةِ بَعِيرٍ قِلاَدَةٌ مِنْ وَتَرٍ أَوْ قِلاَدَةٌ إِلاَّ قُطِعَتْ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya menceritakan kepada saya daripada Malik, daripada Abdullah bin Abi Bakr, daripada Abbad bin Tamim, bahawa Abu Bashir al-Ansari memberitahunya bahawa dia pernah bersama Rasulullah SAW dalam beberapa perjalanan. Beliau menceritakan, \"Rasulullah SAW telah menghantar utusan.\" (Abdullah bin Abi Bakr berkata, (Saya rasa baginda berkata demikian ketika orang ramai sedang berehat.) Baginda bersabda, \"Jangan biarkan sebarang kalung, sama ada daripada tali tunggal atau kalung lain, kekal tidak putus pada leher unta.\"\n\nYahya berkata, \"Saya mendengar Malik berkata, 'Saya rasa itu adalah kerana gangguan mata jahat.'\""
  }
]