[
  {
    "id": 35729,
    "hadith_number": 1551,
    "tajuk_hadith": "Kewajipan Menulis Wasiat",
    "perawi_melayu": "Malik meriwayatkan daripada Nafi', daripada Abdullah bin Umar",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا حَقُّ امْرِئٍ مُسْلِمٍ لَهُ شَىْءٌ يُوصَى فِيهِ يَبِيتُ لَيْلَتَيْنِ إِلاَّ وَوَصِيَّتُهُ عِنْدَهُ مَكْتُوبَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Nafi', daripada Abdullah bin Umar bahawa Rasulullah SAW bersabda:  \"Tidaklah sepatutnya seorang muslim yang mempunyai sesuatu yang boleh diwasiatkan itu bermalam dua malam melainkan wasiatnya telah tertulis di sisinya.\"\n\nMalik berkata, \"Amalan yang disepakati dalam masyarakat kita ialah apabila pewasiat menulis sesuatu ketika sihat atau sakit sebagai wasiat, dan di dalamnya terdapat pembebasan hamba atau perkara-perkara lain, dia boleh mengubahnya mengikut kehendaknya sehingga dia berada di ambang kematian. Sekiranya dia lebih suka meninggalkan wasiat atau mengubahnya, dia boleh berbuat demikian melainkan jika dia telah menjadikan seorang hamba sebagai mudabbar (dibebaskan selepas kematiannya). Jika dia telah menjadikannya mudabbar, tiada cara untuk mengubah apa yang telah dibuat mudabbar. Dia dibenarkan untuk mengubah wasiatnya kerana Rasulullah SAW bersabda:  \"Tidaklah sepatutnya seorang muslim yang mempunyai sesuatu yang boleh diwasiatkan itu bermalam dua malam melainkan wasiatnya telah tertulis di sisinya.\"\n\nMalik menjelaskan, \"Sekiranya pewasiat tidak dapat mengubah wasiatnya atau apa yang disebut di dalamnya tentang pembebasan hamba, setiap pewasiat mungkin akan menahan diri daripada membuat wasiat daripada hartanya, sama ada dalam pembebasan hamba atau selainnya. Seseorang itu memberi wasiat ketika sihat dan ketika dalam perjalanan.\" (iaitu dia tidak menunggu sehingga ke penghujung hayatnya).\n\nMalik menyimpulkan, \"Amalan dalam masyarakat kita yang tidak diperselisihkan ialah dia boleh mengubah apa sahaja yang dia suka kecuali mudabbar.\" "
  },
  {
    "id": 35730,
    "hadith_number": 1552,
    "tajuk_hadith": "Wasiat Remaja kepada Anak Saudara",
    "perawi_melayu": "Malik, daripada Abdullah ibn Abi Bakr ibn Hazm, daripada bapanya, daripada Amr ibn Sulaym az-Zuraqi",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ حَزْمٍ، عَنْ أَبِيهِ، أَنَّ عَمْرَو بْنَ سُلَيْمٍ الزُّرَقِيَّ، أَخْبَرَهُ أَنَّهُ، قِيلَ لِعُمَرَ بْنِ الْخَطَّابِ إِنَّ هَا هُنَا غُلاَمًا يَفَاعًا لَمْ يَحْتَلِمْ مِنْ غَسَّانَ وَوَارِثُهُ بِالشَّامِ وَهُوَ ذُو مَالٍ وَلَيْسَ لَهُ هَا هُنَا إِلاَّ ابْنَةُ عَمٍّ لَهُ ‏.‏ قَالَ عُمَرُ بْنُ الْخَطَّابِ فَلْيُوصِ لَهَا ‏.‏ قَالَ فَأَوْصَى لَهَا بِمَالٍ يُقَالُ لَهُ بِئْرُ جُشَمٍ قَالَ عَمْرُو بْنُ سُلَيْمٍ فَبِيعَ ذَلِكَ الْمَالُ بِثَلاَثِينَ أَلْفَ دِرْهَمٍ وَابْنَةُ عَمِّهِ الَّتِي أَوْصَى لَهَا هِيَ أُمُّ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Abdullah ibn Abi Bakr ibn Hazm, daripada bapanya, bahawa Amr ibn Sulaym az-Zuraqi memberitahunya bahawa telah dikatakan kepada Umar ibn al-Khattab, \"Di sini ada seorang budak lelaki yang belum baligh daripada suku Ghassan, dan warisnya berada di Syam. Dia mempunyai harta, dan di sini dia hanya mempunyai anak perempuan saudara bapanya.\" Umar ibn al-Khattab berkata, \"Hendaklah dia mewakafkan harta untuknya.\" Maka dia mewakafkan harta kepadanya yang dikenali sebagai perigi Jusham. Amr ibn Sulaym berkata, \"Harta itu dijual dengan harga tiga puluh ribu dirham, dan anak perempuan saudaranya yang diwakafkan hartanya itu adalah ibu kepada Amr ibn Sulaym az-Zuraqi.\""
  },
  {
    "id": 35731,
    "hadith_number": 1553,
    "tajuk_hadith": "Wasiat Seorang Kanak-Kanak",
    "perawi_melayu": "Malik meriwayatkan daripada Yahya bin Said daripada Abu Bakar bin Hazm",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي بَكْرِ بْنِ حَزْمٍ، أَنَّ غُلاَمًا، مِنْ غَسَّانَ حَضَرَتْهُ الْوَفَاةُ بِالْمَدِينَةِ وَوَارِثُهُ بِالشَّامِ فَذُكِرَ ذَلِكَ لِعُمَرَ بْنِ الْخَطَّابِ فَقِيلَ لَهُ إِنَّ فُلاَنًا يَمُوتُ أَفَيُوصِي قَالَ فَلْيُوصِ ‏.‏ قَالَ يَحْيَى بْنُ سَعِيدٍ قَالَ أَبُو بَكْرٍ وَكَانَ الْغُلاَمُ ابْنَ عَشْرِ سِنِينَ أَوِ اثْنَتَىْ عَشْرَةَ سَنَةً ‏.‏ قَالَ فَأَوْصَى بِبِئْرِ جُشَمٍ فَبَاعَهَا أَهْلُهَا بِثَلاَثِينَ أَلْفَ دِرْهَمٍ ‏.‏ قَالَ يَحْيَى سَمِعْتُ مَالِكًا يَقُولُ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّ الضَّعِيفَ فِي عَقْلِهِ وَالسَّفِيهَ وَالْمُصَابَ الَّذِي يُفِيقُ أَحْيَانًا تَجُوزُ وَصَايَاهُمْ إِذَا كَانَ مَعَهُمْ مِنْ عُقُولِهِمْ مَا يَعْرِفُونَ مَا يُوصُونَ بِهِ فَأَمَّا مَنْ لَيْسَ مَعَهُ مِنْ عَقْلِهِ مَا يَعْرِفُ بِذَلِكَ مَا يُوصِي بِهِ وَكَانَ مَغْلُوبًا عَلَى عَقْلِهِ فَلاَ وَصِيَّةَ لَهُ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Yahya bin Said daripada Abu Bakar bin Hazm bahawa seorang kanak-kanak lelaki dari Ghassan hampir meninggal dunia di Madinah, manakala warisnya berada di Syam. Perkara ini disebut kepada Umar bin al-Khattab. Lalu dikatakan kepadanya, \"Fulan sedang nazak. Patutkah dia membuat wasiat?\" Umar berkata, \"Biarlah dia membuat wasiat.\" Yahya bin Said berkata bahawa Abu Bakar berkata, \"Kanak-kanak lelaki itu berumur sepuluh atau dua belas tahun.\" Yahya berkata, \"Dia mewasiatkan perigi Jusham, dan keluarganya menjualnya dengan harga tiga puluh ribu dirham.\" Yahya berkata bahawa dia mendengar Malik berkata, \"Amalan yang disepakati dalam masyarakat kita ialah bahawa orang yang lemah akal, orang bodoh, atau orang yang sakit jiwa yang kadang-kadang sedar, dibenarkan membuat wasiat jika mereka masih mempunyai cukup akal untuk memahami apa yang mereka wasiatkan.  Manakala bagi mereka yang tidak cukup akal untuk memahami apa yang mereka wasiatkan dan akal mereka telah hilang, maka wasiat mereka tidak sah."
  },
  {
    "id": 35732,
    "hadith_number": 1554,
    "tajuk_hadith": "Wakaf dan Hijrah",
    "perawi_melayu": "Malik, daripada Ibn Shihab, daripada Amir ibn Saad ibn Abi Waqqas, daripada bapanya",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِيهِ، أَنَّهُ قَالَ جَاءَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم يَعُودُنِي عَامَ حَجَّةِ الْوَدَاعِ مِنْ وَجَعٍ اشْتَدَّ بِي فَقُلْتُ يَا رَسُولَ اللَّهِ قَدْ بَلَغَ بِي مِنَ الْوَجَعِ مَا تَرَى وَأَنَا ذُو مَالٍ وَلاَ يَرِثُنِي إِلاَّ ابْنَةٌ لِي أَفَأَتَصَدَّقُ بِثُلُثَىْ مَالِي قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ ‏\"‏ ‏.‏ فَقُلْتُ فَالشَّطْرُ قَالَ ‏\"‏ لاَ ‏\"‏ ‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الثُّلُثُ وَالثُّلُثُ كَثِيرٌ إِنَّكَ أَنْ تَذَرَ وَرَثَتَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَذَرَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ وَإِنَّكَ لَنْ تُنْفِقَ نَفَقَةً تَبْتَغِي بِهَا وَجْهَ اللَّهِ إِلاَّ أُجِرْتَ حَتَّى مَا تَجْعَلُ فِي فِي امْرَأَتِكَ ‏\"‏ ‏.‏ قَالَ فَقُلْتُ يَا رَسُولَ اللَّهِ أَأُخَلَّفُ بَعْدَ أَصْحَابِي فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّكَ لَنْ تُخَلَّفَ فَتَعْمَلَ عَمَلاً صَالِحًا إِلاَّ ازْدَدْتَ بِهِ دَرَجَةً وَرِفْعَةً وَلَعَلَّكَ أَنْ تُخَلَّفَ حَتَّى يَنْتَفِعَ بِكَ أَقْوَامٌ وَيُضَرَّ بِكَ آخَرُونَ اللَّهُمَّ أَمْضِ لأَصْحَابِي هِجْرَتَهُمْ وَلاَ تَرُدَّهُمْ عَلَى أَعْقَابِهِمْ لَكِنِ الْبَائِسُ سَعْدُ ابْنُ خَوْلَةَ يَرْثِي لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ مَاتَ بِمَكَّةَ ‏\"‏ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Ibn Shihab, daripada Amir bin Saad bin Abi Waqqas, daripada bapanya bahawa bapanya berkata, \"Rasulullah SAW melawatku pada tahun Haji Wada’ kerana penyakit yang amat menyeksakan aku. Aku berkata, ‘Wahai Rasulullah, engkau melihat sendiri betapa teruknya penyakitku. Aku mempunyai harta, dan hanya anak perempuanku yang mewarisi aku.  Bolehkah aku bersedekah dengan dua pertiga hartaku?’ Rasulullah SAW bersabda, ‘Tidak.’ Aku berkata, ‘Setengahnya?’ Baginda bersabda, ‘Tidak.’ Kemudian Rasulullah SAW bersabda, ‘Sepertiga, dan sepertiga itu banyak. Sesungguhnya meninggalkan waris-warismu dalam keadaan kaya adalah lebih baik daripada meninggalkan mereka dalam keadaan miskin yang terpaksa meminta-minta kepada orang lain.  Sesungguhnya kamu tidak akan membelanjakan apa-apa perbelanjaan dengan mengharapkan keredaan Allah melainkan engkau akan diberi ganjaran, bahkan apa yang engkau berikan kepada isterimu.’\n\nSad berkata, ‘Wahai Rasulullah, adakah aku akan ditinggalkan di Mekah setelah sahabat-sahabatku berangkat ke Madinah?’ Rasulullah SAW bersabda, ‘Sesungguhnya engkau tidak akan ditinggalkan kemudian engkau melakukan amal soleh melainkan engkau akan bertambah darjat dan ketinggian dengannya.  Dan mungkin engkau akan ditinggalkan sehingga segolongan manusia mendapat manfaat darimu dan segolongan yang lain akan mendapat mudarat darimu. Ya Allah, sempurnakanlah hijrah sahabat-sahabatku dan janganlah engkau kembalikan mereka ke belakang.  Tetapi malanglah Saad bin Khawlah,’ Rasulullah SAW meratapi kematiannya di Mekah.\"\n\nYahya berkata bahawa dia mendengar Malik menceritakan tentang seorang lelaki yang mewakafkan sepertiga hartanya kepada seorang lelaki dan berkata juga, \"Hamba sahayaku akan berkhidmat kepada fulan (lelaki lain) selama hayatnya, kemudian dia akan dibebaskan,\" kemudian hal itu dikaji, dan hamba itu didapati sebagai sepertiga daripada harta si mati. Malik berkata, \"Perkhidmatan hamba itu dinilai. Kemudian kedua-duanya membahagikannya di antara mereka. Orang yang diwakafkan sepertiga harta mengambil sepertiga baginya sebagai bahagian, dan orang yang diwakafkan perkhidmatan hamba itu mengambil apa yang dinilai untuknya daripada perkhidmatan hamba itu. Setiap mereka mengambil daripada perkhidmatan hamba itu atau daripada upahnya jika dia mempunyai upah, menurut bahagiannya. Jika orang yang diwakafkan perkhidmatan hamba itu selama hayatnya meninggal dunia, maka hamba itu dibebaskan.\"\n\nYahya berkata bahawa dia mendengar Malik menceritakan tentang seseorang yang mewakafkan sepertiga hartanya dan berkata, \"Fulan mempunyai ini dan itu, dan fulan mempunyai ini dan itu,\" menyebut sebahagian daripada hartanya, dan waris-warisnya membantah bahawa ia melebihi sepertiga. Malik berkata, \"Maka waris-waris itu mempunyai pilihan sama ada memberikan penerima-penerima wasiat harta pusaka mereka sepenuhnya dan mengambil baki harta si mati, atau membahagikan di antara penerima-penerima wasiat sepertiga daripada harta si mati dan menyerahkan kepada mereka sepertiga mereka. Jika mereka mahu, hak mereka di dalamnya mencapai sejauh mana ia tercapai.\""
  },
  {
    "id": 35733,
    "hadith_number": 1555,
    "tajuk_hadith": "Wasat  Harta Wanita Hamil dan Orang Sakit",
    "perawi_melayu": "Yahya daripada Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan bahawa beliau mendengar Malik berkata, \"Yang terbaik daripada apa yang aku dengar tentang wasiat wanita hamil dan tentang penyelesaian harta yang dibenarkan baginya ialah wanita hamil itu seperti orang sakit.  Apabila penyakit itu ringan, dan seseorang tidak bimbang akan pesakit itu, dia boleh berbuat apa sahaja yang disukainya dengan hartanya. Jika penyakit itu sehinggakan nyawanya dikhuatiri, dia hanya boleh mengagihkan sepertiga daripada hartanya.\"\n\nBeliau berkata, \"Begitu juga dengan wanita yang hamil. Permulaan kehamilan adalah berita gembira dan kegembiraan. Ia bukan penyakit dan tiada rasa bimbang kerana Allah Yang Maha Berkat, Yang Maha Tinggi, berfirman di dalam Kitab-Nya, 'Dan Kami gembirakan dia dengan Ishak, dan sesudah Ishak, Yaakub.' (Surah Al-Anbiya' ayat 71). Dan Dia berfirman, 'Dan dia mengandungnya, lalu ia membawa bebannya; maka ketika ia merasa berat, mereka berdua berdoa kepada Allah Tuhan mereka: “Jika Engkau anugerahkan kepada kami anak yang soleh, nescaya kami akan termasuk orang-orang yang bersyukur.”' (Surah Al-A’raf ayat 189).\n\n\"Apabila wanita hamil itu merasa berat, dia hanya dibenarkan mengagihkan sepertiga daripada hartanya. Permulaan sekatan ini ialah selepas enam bulan. Allah Yang Maha Berkat, Yang Maha Tinggi, berfirman di dalam Kitab-Nya, 'Ibu-ibu hendaklah menyusukan anak-anak mereka selama dua tahun penuh...' Dan Dia berfirman,  '...tempoh mengandung dan menyusu ialah tiga puluh bulan...' (Surah Al-Baqarah ayat 233).\n\n\"Apabila enam bulan telah berlalu bagi wanita hamil itu dari hari dia mengandung, dia hanya dibenarkan mengagihkan sepertiga daripada hartanya.\"\n\nYahya meriwayatkan bahawa beliau mendengar Malik berkata, \"Seseorang lelaki yang sedang mara ke medan perang, hanya boleh mengagihkan sepertiga daripada hartanya. Dia berada dalam kedudukan yang sama seperti wanita hamil atau orang sakit yang dikhuatiri, selagi dia berada dalam keadaan itu.\""
  },
  {
    "id": 35734,
    "hadith_number": 1556,
    "tajuk_hadith": "Penghapusan Ayat Waris dan Kehendak Wasat",
    "perawi_melayu": "Yahya",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya berkata bahawa beliau mendengar Malik berkata, \"Ayat ini telah dimansuhkan. Ia adalah firman Allah SWT, 'Jika dia meninggalkan harta, wasiat adalah untuk ibu bapa dan kaum kerabat.'  Apa yang diturunkan tentang pembahagian bahagian warisan tetap dalam Kitab Allah SWT telah menghapuskannya.\"\n\nYahya berkata bahawa beliau mendengar Malik berkata, \"Sunnah yang mantap dalam kalangan kami, yang tidak ada perselisihan padanya, ialah bahawa ia tidak dibenarkan bagi seorang pewasiat untuk membuat wasiat (sebagai tambahan kepada bahagian tetap) untuk seorang waris, melainkan waris-waris yang lain membenarkannya. Jika sebahagian daripada mereka membenarkannya dan yang lain menolak, dia dibenarkan mengurangkan bahagian mereka yang telah memberi kebenaran. Mereka yang menolak mengambil bahagian penuh mereka daripada harta pusaka.\"\n\nYahya berkata bahawa beliau mendengar Malik bercakap tentang seorang yang tidak sah membuat wasiat dan meminta waris-warisnya untuk memberi kebenaran kepadanya membuat wasiat ketika dia sangat sakit sehingga dia hanya mempunyai kuasa ke atas sepertiga hartanya, dan mereka memberi kebenaran kepadanya untuk memberi lebih daripada sepertiga kepada sebahagian warisnya. Malik berkata, \"Mereka tidak boleh membatalkannya. Sekiranya mereka dibenarkan berbuat demikian, setiap waris akan berbuat demikian, dan kemudian, apabila pewasiat meninggal dunia, mereka akan mengambilnya untuk diri mereka sendiri dan menghalangnya daripada mewasiatkan sepertiga dan apa yang dibenarkan kepadanya berkenaan dengan hartanya.\"\n\nMalik berkata, \"Sekiranya dia meminta kebenaran daripada waris-warisnya untuk memberi wasiat kepada seorang waris ketika dia sihat dan mereka memberi kebenaran kepadanya, ia tidak mengikat mereka. Waris-waris boleh membatalkannya jika mereka mahu.  Ini kerana apabila seseorang itu sihat, dia berhak ke atas semua hartanya dan boleh melakukan apa sahaja yang diinginkannya dengannya. Jika dia mahu, dia boleh membelanjakan semuanya. Dia boleh membelanjakannya dan memberi sedekah dengannya atau memberikannya kepada sesiapa sahaja yang disukainya.  Permintaan kebenaran daripada waris-warisnya dibenarkan untuk waris-waris, apabila mereka memberi kebenaran kepadanya apabila kuasa ke atas semua hartanya ditutup dan tiada apa-apa di luar sepertiga dibenarkan kepadanya, dan apabila mereka lebih berhak ke atas dua pertiga hartanya daripada dirinya sendiri.  Itulah ketika kebenaran mereka menjadi relevan. Sekiranya dia meminta salah seorang waris untuk menyerahkan hartanya kepadanya ketika dia hampir mati, dan waris itu bersetuju dan kemudian orang yang hampir mati itu tidak membelanjakannya langsung, ia dikembalikan kepada orang yang memberikannya melainkan si mati berkata kepadanya, 'Fulan - (salah seorang warisnya) - lemah, dan saya ingin awak memberikan hartanya kepadanya.' Jadi dia memberikannya kepadanya. Itu dibenarkan apabila si mati menetapkannya untuknya.\"\n\nMalik berkata, \"Apabila seseorang memberi orang yang hampir mati kegunaan percuma bahagiannya daripada harta pusaka, dan orang yang hampir mati itu mengagihkan sebahagian daripadanya dan sebahagiannya masih ada, ia dikembalikan kepada pemberi, selepas orang itu meninggal dunia.\"\n\nYahya berkata bahawa beliau mendengar Malik bercakap tentang seseorang yang membuat wasiat dan menyebut bahawa dia telah memberi sesuatu kepada salah seorang warisnya yang belum diambil milikinya, jadi waris-waris menolak untuk membenarkannya. Malik berkata, \"Hadiah itu dikembalikan kepada waris-waris sebagai harta pusaka menurut Kitab Allah kerana si mati tidak bermaksud untuk diambil daripada sepertiga dan waris-waris tidak mempunyai bahagian dalam sepertiga (yang dibenarkan untuk diwasiatkan oleh orang yang hampir mati)."
  },
  {
    "id": 35735,
    "hadith_number": 1557,
    "tajuk_hadith": "Larangan Kemasukan Lelaki Berwatak Wanita",
    "perawi_melayu": "Malik, daripada Hisyam bin Urwah, daripada bapanya",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ مُخَنَّثًا، كَانَ عِنْدَ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ فَقَالَ لِعَبْدِ اللَّهِ بْنِ أَبِي أُمَيَّةَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَسْمَعُ يَا عَبْدَ اللَّهِ إِنْ فَتَحَ اللَّهُ عَلَيْكُمُ الطَّائِفَ غَدًا فَأَنَا أَدُلُّكَ عَلَى ابْنَةِ غَيْلاَنَ فَإِنَّهَا تُقْبِلُ بِأَرْبَعٍ وَتُدْبِرُ بِثَمَانٍ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَدْخُلَنَّ هَؤُلاَءِ عَلَيْكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Hisyam bin Urwah, daripada bapanya, bahawa seorang lelaki berwatak wanita berada di sisi Ummu Salamah, isteri Nabi SAW.  Dia berkata kepada Abdullah bin Abi Umayah, sementara Rasulullah SAW mendengar, \"Wahai Abdullah! Jika Allah SWT memberikan kemenangan kepada kamu ke atas Taif esok, maka aku akan menunjukkan kepadamu anak perempuan Ghailan.  Sesungguhnya dia mempunyai empat lipatan di bahagian hadapan dan lapan lipatan di bahagian belakang.\"  Maka Rasulullah SAW bersabda,  \"Mereka sebegini janganlah dibiarkan masuk dengan bebas kepada kamu.\" (Adalah kebiasaan untuk membenarkan lelaki yang tidak mempunyai kecenderungan seksual masuk dengan bebas ke tempat wanita.)"
  },
  {
    "id": 35736,
    "hadith_number": 1558,
    "tajuk_hadith": "Hak Penjagaan Anak: Kisah Umar ibn al-Khattab dan Isterinya",
    "perawi_melayu": "Malik, Yahya ibn Said, al-Qasim ibn Muhammad",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ سَمِعْتُ الْقَاسِمَ بْنَ مُحَمَّدٍ، يَقُولُ كَانَتْ عِنْدَ عُمَرَ بْنِ الْخَطَّابِ امْرَأَةٌ مِنَ الأَنْصَارِ فَوَلَدَتْ لَهُ عَاصِمَ بْنَ عُمَرَ ثُمَّ إِنَّهُ فَارَقَهَا فَجَاءَ عُمَرُ قُبَاءً فَوَجَدَ ابْنَهُ عَاصِمًا يَلْعَبُ بِفِنَاءِ الْمَسْجِدِ فَأَخَذَ بِعَضُدِهِ فَوَضَعَهُ بَيْنَ يَدَيْهِ عَلَى الدَّابَّةِ فَأَدْرَكَتْهُ جَدَّةُ الْغُلاَمِ فَنَازَعَتْهُ إِيَّاهُ حَتَّى أَتَيَا أَبَا بَكْرٍ الصِّدِّيقَ فَقَالَ عُمَرُ ابْنِي ‏.‏ وَقَالَتِ الْمَرْأَةُ ابْنِي ‏.‏ فَقَالَ أَبُو بَكْرٍ خَلِّ بَيْنَهَا وَبَيْنَهُ ‏.‏ قَالَ فَمَا رَاجَعَهُ عُمَرُ الْكَلاَمَ ‏.‏ قَالَ وَسَمِعْتُ مَالِكًا يَقُولُ وَهَذَا الأَمْرُ الَّذِي آخُذُ بِهِ فِي ذَلِكَ ‏.‏",
    "malay_translation": "Malik telah meriwayatkan kepadaku daripada Yahya bin Said, bahawa Yahya berkata, aku telah mendengar al-Qasim bin Muhammad berkata, \"Seorang wanita dari kalangan Ansar telah berkahwin dengan Umar ibn al-Khattab. Wanita itu melahirkan anak lelaki baginya iaitu Asim bin Umar, kemudian Umar menceraikannya. Umar kemudiannya pergi ke Quba dan mendapati anaknya Asim sedang bermain di halaman masjid.  Umar memegang lengan anaknya lalu meletakkan Asim di hadapannya di atas kenderaan. Nenek kepada Asim melihat kejadian itu lalu bertelagah dengan Umar mengenai hak penjagaan Asim sehingga mereka berdua pergi kepada Abu Bakar as-Siddiq. Umar berkata, ‘Anakku.’ Wanita itu berkata, ‘Anakku.’ Abu Bakar berkata, ‘Biarkan sahaja anak itu bersama ibunya.’ Umar tidak membantah lagi.  Aku telah mendengar Malik berkata, ‘Inilah tindakan yang akan aku ambil dalam situasi sedemikian.’\""
  },
  {
    "id": 35737,
    "hadith_number": 1559,
    "tajuk_hadith": "Nilai Harta Pada Masa Pemilikan Ditarik Balik",
    "perawi_melayu": "Yahya",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya berkata bahawa beliau mendengar Malik bercakap tentang seorang lelaki yang membeli barang-barang - haiwan, pakaian atau barangan, dan jual beli itu didapati tidak dibenarkan, maka ia dibatalkan dan orang yang telah mengambil barang-barang itu diperintahkan untuk mengembalikan barang-barang itu kepada pemiliknya. Malik berkata, \"Pemilik barang hanya mempunyai nilai barang pada hari ia diambil darinya, dan bukan pada hari ia dikembalikan kepadanya.  Ini kerana lelaki itu bertanggungjawab ke atasnya dari hari dia mengambilnya dan apa sahaja kerugian yang terdapat padanya selepas itu adalah tanggungjawabnya. Atas sebab itu, peningkatan dan pertumbuhannya juga adalah miliknya.  Seseorang mungkin mengambil barang pada masa ia dijual dengan harga yang baik dan mendapat permintaan, dan kemudian terpaksa mengembalikannya pada masa harganya jatuh dan tiada siapa yang menginginkannya. Contohnya, lelaki itu mungkin mengambil barang daripada lelaki lain, dan menjualnya dengan sepuluh dinar atau menyimpannya sementara harganya begitu. Kemudian dia mungkin terpaksa mengembalikannya sementara harganya hanya satu dinar. Dia tidak boleh mengambil sembilan dinar daripada harta lelaki itu. Atau mungkin ia diambil oleh lelaki itu, dan dia menjualnya dengan satu dinar atau menyimpannya, sementara harganya hanya satu dinar, maka dia terpaksa mengembalikannya, dan nilainya pada hari dia mengembalikannya ialah sepuluh dinar. Orang yang mengambilnya tidak perlu membayar sembilan dinar daripada hartanya kepada pemiliknya. Dia hanya wajib membayar nilai apa yang telah diambil milikannya pada hari ia diambil.\" \n\nBeliau berkata, \"Sebahagian daripada apa yang menjelaskan ini ialah apabila pencuri mencuri barang, hanya harga barang pada hari dia mencurinya sahaja yang dipertimbangkan. Jika memotong tangan itu perlu kerana perkara itu, maka ia dilakukan. Jika pemotongan itu ditangguhkan, sama ada kerana pencuri dipenjara sehingga keadaannya diperiksa atau dia melarikan diri dan kemudian ditangkap, penangguhan pemotongan tangan itu tidak menyebabkan had, yang diwajibkan ke atasnya pada hari dia mencuri, gugur darinya walaupun barang-barang itu menjadi murah selepas itu.  Begitu juga, penangguhan tidak mewajibkan pemotongan tangan jika ia tidak diwajibkan pada hari dia mengambil barang-barang itu, walaupun ia menjadi mahal selepas itu."
  },
  {
    "id": 35738,
    "hadith_number": 1560,
    "tajuk_hadith": "Keikhlasan Amal, Pengurusan Hamba, dan Hak Ibu Bapa",
    "perawi_melayu": "Malik meriwayatkan daripada Yahya bin Said",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ أَبَا الدَّرْدَاءِ، كَتَبَ إِلَى سَلْمَانَ الْفَارِسِيِّ أَنْ هَلُمَّ إِلَى الأَرْضِ الْمُقَدَّسَةِ فَكَتَبَ إِلَيْهِ سَلْمَانُ إِنَّ الأَرْضَ لاَ تُقَدِّسُ أَحَدًا وَإِنَّمَا يُقَدِّسُ الإِنْسَانَ عَمَلُهُ وَقَدْ بَلَغَنِي أَنَّكَ جُعِلْتَ طَبِيبًا تُدَاوِي فَإِنْ كُنْتَ تُبْرِئُ فَنِعِمَّا لَكَ وَإِنْ كُنْتَ مُتَطَبِّبًا فَاحْذَرْ أَنْ تَقْتُلَ إِنْسَانًا فَتَدْخُلَ النَّارَ ‏.‏ فَكَانَ أَبُو الدَّرْدَاءِ إِذَا قَضَى بَيْنَ اثْنَيْنِ ثُمَّ أَدْبَرَا عَنْهُ نَظَرَ إِلَيْهِمَا وَقَالَ ارْجِعَا إِلَىَّ أَعِيدَا عَلَىَّ قِصَّتَكُمَا مُتَطَبِّبٌ وَاللَّهِ ‏.‏ قَالَ وَسَمِعْتُ مَالِكًا يَقُولُ مَنِ اسْتَعَانَ عَبْدًا بِغَيْرِ إِذْنِ سَيِّدِهِ فِي شَىْءٍ لَهُ بَالٌ وَلِمِثْلِهِ إِجَارَةٌ فَهُوَ ضَامِنٌ لِمَا أَصَابَ الْعَبْدَ إِنْ أُصِيبَ الْعَبْدُ بِشَىْءٍ وَإِنْ سَلِمَ الْعَبْدُ فَطَلَبَ سَيِّدُهُ إِجَارَتَهُ لِمَا عَمِلَ فَذَلِكَ لِسَيِّدِهِ وَهُوَ الأَمْرُ عِنْدَنَا ‏.‏ قَالَ وَسَمِعْتُ مَالِكًا يَقُولُ فِي الْعَبْدِ يَكُونُ بَعْضُهُ حُرًّا وَبَعْضُهُ مُسْتَرَقًّا إِنَّهُ يُوقَفُ مَالُهُ بِيَدِهِ وَلَيْسَ لَهُ أَنْ يُحْدِثَ فِيهِ شَيْئًا وَلَكِنَّهُ يَأْكُلُ فِيهِ وَيَكْتَسِي بِالْمَعْرُوفِ فَإِذَا هَلَكَ فَمَالُهُ لِلَّذِي بَقِيَ لَهُ فِيهِ الرِّقُّ ‏.‏ قَالَ وَسَمِعْتُ مَالِكًا يَقُولُ الأَمْرُ عِنْدَنَا أَنَّ الْوَالِدَ يُحَاسِبُ وَلَدَهُ بِمَا أَنْفَقَ عَلَيْهِ مِنْ يَوْمِ يَكُونُ لِلْوَلَدِ مَالٌ - نَاضًّا كَانَ أَوْ عَرْضًا - إِنْ أَرَادَ الْوَالِدُ ذَلِكَ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Yahya bin Said bahawa Abu Darda’ menulis surat kepada Salman al-Farsi: \"Marilah segera ke tanah suci.\" Salman membalas suratnya: \"Tanah tidak mensucikan seseorang, tetapi amalannya yang mensucikannya. Aku telah mendengar bahawa engkau telah dilantik sebagai doktor untuk merawat dan menyembuhkan orang. Jika engkau benar-benar dapat menyembuhkan, maka baguslah bagimu. Tetapi jika engkau hanyalah seorang yang berlagak doktor, maka berhati-hatilah supaya engkau tidak membunuh seseorang lalu masuk neraka.\" Abu Darda’, apabila dia menghakimi di antara dua orang, kemudian mereka berpaling darinya, dia akan memandang mereka dan berkata: \"Kembalilah kepadaku, ceritakan semula kisahkan kamu.  Wahai doktor yang berlagak! Demi Allah!\" Yahya berkata bahawa dia mendengar Malik berkata: \"Jika seseorang menggunakan hamba tanpa izin tuannya untuk sesuatu yang bernilai dan mempunyai upah, maka dia bertanggungjawab atas apa sahaja yang menimpa hamba itu. Jika hamba itu selamat, dan tuannya meminta upah atas pekerjaannya, maka itu adalah hak tuannya. Inilah amalan di kalangan kami.\" Yahya berkata bahawa dia mendengar Malik berkata tentang hamba yang sebahagiannya bebas dan sebahagiannya hamba: \"Hartanya digantung di tangannya dan dia tidak boleh melakukan apa-apa dengannya, kecuali memakan daripadanya dan berpakaian dengan cara yang baik. Jika dia mati, hartanya adalah milik orang yang masih memiliki hak perhambaan ke atasnya.\" Yahya berkata bahawa dia mendengar Malik berkata: \"Amalan di kalangan kami ialah ibu bapa boleh meminta pertanggungjawaban anaknya terhadap apa yang dibelanjakan untuknya sejak anak itu mempunyai harta, sama ada wang tunai atau barangan, jika ibu bapa itu mahu berbuat demikian.\""
  },
  {
    "id": 35739,
    "hadith_number": 1561,
    "tajuk_hadith": "Amaran Tentang Hutang",
    "perawi_melayu": "Malik meriwayatkan daripada Umar ibn Abd ar-Rahman ibn Dalaf al-Muzani daripada bapanya",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ عُمَرَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ دَلاَفٍ الْمُزَنِيِّ، عَنْ أَبِيهِ، أَنَّ رَجُلاً، مِنْ جُهَيْنَةَ كَانَ يَسْبِقُ الْحَاجَّ فَيَشْتَرِي الرَّوَاحِلَ فَيُغْلِي بِهَا ثُمَّ يُسْرِعُ السَّيْرَ فَيَسْبِقُ الْحَاجَّ فَأَفْلَسَ فَرُفِعَ أَمْرُهُ إِلَى عُمَرَ بْنِ الْخَطَّابِ فَقَالَ أَمَّا بَعْدُ أَيُّهَا النَّاسُ فَإِنَّ الأُسَيْفِعَ أُسَيْفِعَ جُهَيْنَةَ رَضِيَ مِنْ دِينِهِ وَأَمَانَتِهِ بِأَنْ يُقَالَ سَبَقَ الْحَاجَّ أَلاَ وَإِنَّهُ قَدْ دَانَ مُعْرِضًا فَأَصْبَحَ قَدْ رِينَ بِهِ فَمَنْ كَانَ لَهُ عَلَيْهِ دَيْنٌ فَلْيَأْتِنَا بِالْغَدَاةِ نَقْسِمُ مَالَهُ بَيْنَهُمْ وَإِيَّاكُمْ وَالدَّيْنَ فَإِنَّ أَوَّلَهُ هَمٌّ وَآخِرَهُ حَرْبٌ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Umar ibn Abd ar-Rahman ibn Dalaf al-Muzani daripada bapanya bahawa seorang lelaki daripada suku Juhayna biasa mendahului orang-orang haji lalu membeli unta-unta tunggangan kemudian menaikkan harganya.  Kemudian dia mempercepatkan perjalanan dan mendahului orang-orang haji.  Lalu dia muflis.  Maka perkara itu dimaklumkan kepada Umar ibn al-Khattab.  Lalu beliau berkata: “Wahai sekalian manusia!  Sesungguhnya al-Usayfi, al-Usayfi daripada Juhayna, telah diredai agamanya dan amanahnya kerana dikatakan bahawa dia mendahului orang-orang haji.  Ketahuilah bahawa dia telah berhutang tanpa menghiraukannya, lalu hartanya telah habis dimakan hutang.  Barangsiapa yang mempunyai hutang terhadapnya, hendaklah datang kepada kami esok, nescaya kami akan membahagikan hartanya di antara mereka.  Dan jauhilah kamu daripada hutang, kerana permulaannya adalah kerisauan dan akhirnya adalah kehancuran.”"
  },
  {
    "id": 35740,
    "hadith_number": 1562,
    "tajuk_hadith": "Hukuman Bagi Hamba Yang Melakukan Jenayah",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik",
    "english_text": "Yahya said that he heard Malik say, \"The sunna with us about the\ncrime of slaves is that the hand is not cut off for any harm that a\nslave causes a man, or something he pilfers, or something guarded\nwhich he steals, or hanging dates he cuts down or ruins, or steals.\nThat is against the slave's person and does not exceed the price of\nthe slave whether it is little or much. If his master wishes to give\nthe value of what the slave took or ruined, or pay the blood-price for\nthe injury, he pays it and keeps his slave. If he wishes to surrender\nhim, he surrenders him, and none of that is against him. The master\nhas the option in that.\"",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan bahawa beliau mendengar Malik berkata, \"Sunnah yang diamalkan di kalangan kami berkaitan jenayah hamba ialah tangannya tidak dipotong bagi apa jua kemudaratan yang dilakukan hamba kepada seseorang, atau sesuatu yang dicurinya, atau sesuatu yang dijaganya yang dicurinya, atau buah kurma yang tergantung yang ditebang atau dimusnahkannya, atau dicurinya.  Itu adalah terhadap diri hamba dan tidak melebihi harga hamba itu sama ada sedikit atau banyak. Jika tuannya ingin membayar ganti rugi bagi apa yang diambil atau dimusnahkan oleh hamba itu, atau membayar diat (tebusan darah) bagi kecederaan itu, maka dia membayarnya dan mengekalkan hambanya. Jika dia ingin menyerahkannya, maka dia menyerahkannya, dan tiada apa-apa yang menentang dirinya. Tuan punya pilihan dalam hal ini.\""
  },
  {
    "id": 35741,
    "hadith_number": 1563,
    "tajuk_hadith": "Hibah Kepada Anak Kecil",
    "perawi_melayu": "Malik meriwayatkan daripada Ibn Shihab daripada Said ibn al-Musayyab",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ عُثْمَانَ بْنَ عَفَّانَ، قَالَ مَنْ نَحَلَ وَلَدًا لَهُ صَغِيرًا لَمْ يَبْلُغْ أَنْ يَحُوزَ نُحْلَهُ فَأَعْلَنَ ذَلِكَ لَهُ وَأَشْهَدَ عَلَيْهَا فَهِيَ جَائِزَةٌ وَإِنْ وَلِيَهَا أَبُوهُ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا أَنَّ مَنْ نَحَلَ ابْنًا لَهُ صَغِيرًا ذَهَبًا أَوْ وَرِقًا ثُمَّ هَلَكَ وَهُوَ يَلِيهِ إِنَّهُ لاَ شَىْءَ لِلاِبْنِ مِنْ ذَلِكَ إِلاَّ أَنْ يَكُونَ الأَبُ عَزَلَهَا بِعَيْنِهَا أَوْ دَفَعَهَا إِلَى رَجُلٍ وَضَعَهَا لاِبْنِهِ عِنْدَ ذَلِكَ الرَّجُلِ فَإِنْ فَعَلَ ذَلِكَ فَهُوَ جَائِزٌ لِلاِبْنِ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Ibn Shihab daripada Said ibn al-Musayyab bahawa Uthman ibn Affan berkata, \"Jika seseorang memberikan sesuatu kepada anaknya yang kecil yang belum cukup umur untuk mengurus sendiri pemberian itu, dan untuk memastikan pemberiannya dibenarkan, dia mengumumkan pemberian itu dan disaksikan, maka pemberian itu dibenarkan, walaupun bapanya yang menguruskannya.\" \n\nMalik berkata, \"Amalan dalam masyarakat kita ialah jika seseorang memberikan emas atau perak kepada anaknya yang kecil, kemudian dia meninggal dunia dan harta itu masih diuruskannya, maka anaknya tidak berhak ke atasnya melainkan jika bapanya telah memisahkannya atau menyerahkannya kepada seseorang untuk disimpan bagi anaknya. Jika dia berbuat demikian, maka ia dibenarkan untuk anaknya.\""
  }
]