[
  {
    "id": 35657,
    "hadith_number": 1479,
    "tajuk_hadith": "Keadilan Rasulullah dan Amaran Tentang Kezaliman",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Hisyam bin Urwah daripada bapanya daripada Zaynab binti Abi Salamah daripada Ummu Salamah, isteri Nabi SAW",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّمَا أَنَا بَشَرٌ وَإِنَّكُمْ تَخْتَصِمُونَ إِلَىَّ فَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَلْحَنَ بِحُجَّتِهِ مِنْ بَعْضٍ فَأَقْضِيَ لَهُ عَلَى نَحْوِ مَا أَسْمَعُ مِنْهُ فَمَنْ قَضَيْتُ لَهُ بِشَىْءٍ مِنْ حَقِّ أَخِيهِ فَلاَ يَأْخُذَنَّ مِنْهُ شَيْئًا فَإِنَّمَا أَقْطَعُ لَهُ قِطْعَةً مِنَ النَّارِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Hisyam bin Urwah daripada bapanya daripada Zaynab binti Abi Salamah daripada Ummu Salamah, isteri Nabi SAW bahawa Rasulullah SAW bersabda:  \"Sesungguhnya aku hanyalah seorang manusia, dan kamu bertelagah di sisiku.  Mungkin sebahagian daripada kamu lebih fasih hujahnya daripada yang lain, maka aku memberi keputusan berdasarkan apa yang kudengar darinya.  Barangsiapa yang aku putuskan kepadanya sesuatu daripada hak saudaranya, maka janganlah dia mengambilnya, kerana sesungguhnya aku memotong baginya sebahagian daripada api neraka.\""
  },
  {
    "id": 35658,
    "hadith_number": 1480,
    "tajuk_hadith": "Keadilan Umar dan Pandangan Yahudi tentang Keadilan Ilahi",
    "perawi_melayu": "Malik meriwayatkan daripada Yahya bin Said daripada Said bin al-Musayyab",
    "english_text": "Malik related to me from Yahya ibn Said from Said ibn al-Musayyab\nthat Umar ibn al-Khattab had a dispute brought to him between a muslim\nand a jew. Umar saw that the right belonged to the jew and decided in\nhis favour. The jew said to him, \"By Allah! You have judged\ncorrectly.'' So Umar ibn al-Khattab struck him with a whip and said,\n\"How can you be sure.\" The jew said to him, \"We find that there is no\njudge who judges correctly but that there is an angel on his right\nside and an angel on his left side who guide him and give him success\nin the truth as long as he is with the truth. When he leaves the\ntruth, they rise and leave him.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، اخْتَصَمَ إِلَيْهِ مُسْلِمٌ وَيَهُودِيٌّ فَرَأَى عُمَرُ أَنَّ الْحَقَّ لِلْيَهُودِيِّ فَقَضَى لَهُ فَقَالَ لَهُ الْيَهُودِيُّ وَاللَّهِ لَقَدْ قَضَيْتَ بِالْحَقِّ ‏.‏ فَضَرَبَهُ عُمَرُ بْنُ الْخَطَّابِ بِالدِّرَّةِ ثُمَّ قَالَ وَمَا يُدْرِيكَ فَقَالَ لَهُ الْيَهُودِيُّ إِنَّا نَجِدُ أَنَّهُ لَيْسَ قَاضٍ يَقْضِي بِالْحَقِّ إِلاَّ كَانَ عَنْ يَمِينِهِ مَلَكٌ وَعَنْ شِمَالِهِ مَلَكٌ يُسَدِّدَانِهِ وَيُوَفِّقَانِهِ لِلْحَقِّ مَادَامَ مَعَ الْحَقِّ فَإِذَا تَرَكَ الْحَقَّ عَرَجَا وَتَرَكَاهُ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Yahya bin Said daripada Said bin al-Musayyab bahawa Umar bin al-Khattab telah diadili suatu perselisihan antara seorang Muslim dan seorang Yahudi. Umar mendapati bahawa keadilan berpihak kepada Yahudi lalu menghakiminya.  Yahudi itu berkata kepadanya, \"Demi Allah! Sesungguhnya engkau telah menghakimi dengan adil!\" Maka Umar bin al-Khattab memukulnya dengan cambuk lalu berkata, \"Bagaimana engkau tahu?\"  Yahudi itu berkata kepadanya, \"Kami mendapati bahawa tiada seorang hakim pun yang menghakimi dengan adil melainkan ada seorang malaikat di sebelah kanannya dan seorang malaikat di sebelah kirinya yang membimbing dan memberi taufik kepadanya menuju kebenaran selagi dia bersama kebenaran.  Apabila dia meninggalkan kebenaran, kedua-dua malaikat itu akan pergi meninggalkannya.\""
  },
  {
    "id": 35659,
    "hadith_number": 1481,
    "tajuk_hadith": "Saksi yang Terbaik",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Abdullah bin Abi Bakr bin Muhammad bin Amr bin Hazm, daripada bapanya, daripada Abdullah bin Amr bin Uthman, daripada Abu Amra al-Ansari, daripada Zayd bin Khalid al-Juhani",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عُثْمَانَ، عَنْ أَبِي عَمْرَةَ الأَنْصَارِيِّ، عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَلاَ أُخْبِرُكُمْ بِخَيْرِ الشُّهَدَاءِ الَّذِي يَأْتِي بِشَهَادَتِهِ قَبْلَ أَنْ يُسْأَلَهَا أَوْ يُخْبِرُ بِشَهَادَتِهِ قَبْلَ أَنْ يُسْأَلَهَا ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abdullah bin Abi Bakr bin Muhammad bin Amr bin Hazm, daripada bapanya, daripada Abdullah bin Amr bin Uthman, daripada Abu Amra al-Ansari, daripada Zayd bin Khalid al-Juhani, bahawa Rasulullah SAW bersabda, \"Adakah aku tidak akan memberitahu kamu siapakah saksi yang terbaik? Iaitu orang yang menyampaikan kesaksiannya sebelum ditanya atau memberitahu kesaksiannya sebelum ditanya.\""
  },
  {
    "id": 35660,
    "hadith_number": 1482,
    "tajuk_hadith": "Saksi Benar dalam Islam",
    "perawi_melayu": "Malik, daripada Rabiah bin Abi Abdur Rahman",
    "english_text": "Malik related to me that Rabia ibn Abi Abd ar-Rahman said, \"An\nIraqi man came before Umar ibn al-Khattab and said, 'I have come to\nyou because of a matter which has no beginning and no end.' Umar said,\n'What is it?' The man said, 'False testimony has appeared in our\nland.' Umar said, 'Is that so?' He said, 'Yes.' Umar said, 'By Allah!\nA man is not detained in Islam without just witnesses.' \"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّهُ قَالَ قَدِمَ عَلَى عُمَرَ بْنِ الْخَطَّابِ رَجُلٌ مِنْ أَهْلِ الْعِرَاقِ فَقَالَ لَقَدْ جِئْتُكَ لأَمْرٍ مَا لَهُ رَأْسٌ وَلاَ ذَنَبٌ ‏.‏ فَقَالَ عُمَرُ مَا هُوَ قَالَ شَهَادَاتُ الزُّورِ ظَهَرَتْ بِأَرْضِنَا ‏.‏ فَقَالَ عُمَرُ أَوَقَدْ كَانَ ذَلِكَ قَالَ نَعَمْ ‏.‏ فَقَالَ عُمَرُ وَاللَّهِ لاَ يُؤْسَرُ رَجُلٌ فِي الإِسْلاَمِ بِغَيْرِ الْعُدُولِ ‏.‏",
    "malay_translation": "Malik telah meriwayatkan kepadaku daripada Rabiah bin Abi Abdur Rahman bahawa beliau berkata: “Seorang lelaki dari Iraq telah datang menghadap Umar bin al-Khattab lalu berkata, ‘Aku datang kepadamu kerana suatu perkara yang tiada permulaan dan tiada penghujungnya.’ Umar bertanya, ‘Apakah itu?’ Lelaki itu menjawab, ‘Saksi palsu telah muncul di tanah air kami.’ Umar bertanya, ‘Benarkah demikian?’ Lelaki itu menjawab, ‘Ya.’ Umar berkata, ‘Demi Allah! Tiada seorang lelaki pun akan dipenjarakan dalam Islam tanpa saksi yang adil.’"
  },
  {
    "id": 35661,
    "hadith_number": 1483,
    "tajuk_hadith": "Kesaksian Orang yang Berdendam atau Tidak Dipercayai",
    "perawi_melayu": "Malik",
    "english_text": "Malik related to me that Umar ibn al-Khattab said, \"The testimony of\nsome one known to bear a grudge or to be unreliable is not accepted.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ لاَ تَجُوزُ شَهَادَةُ خَصْمٍ وَلاَ ظَنِينٍ ‏.‏",
    "malay_translation": "Malik telah meriwayatkan kepadaku bahawa Umar ibn al-Khattab berkata, \"Tidak diterima kesaksian daripada seseorang yang diketahui berdendam atau tidak boleh dipercayai.\""
  },
  {
    "id": 35662,
    "hadith_number": 1484,
    "tajuk_hadith": "Kesaksian Orang Yang Didera Kerana Hukuman Hadd",
    "perawi_melayu": "Yahya daripada Malik",
    "english_text": "",
    "arabic_text": "قَالَ يَحْيَى عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، وَغَيْرِهِ، أَنَّهُمْ سُئِلُوا عَنْ رَجُلٍ، جُلِدَ الْحَدَّ أَتَجُوزُ شَهَادَتُهُ فَقَالُوا نَعَمْ إِذَا ظَهَرَتْ مِنْهُ التَّوْبَةُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa telah sampai kepadanya daripada Sulaiman bin Yasar dan lain-lain lagi bahawa mereka ditanya tentang seorang lelaki yang didera kerana hukuman hadd, adakah keterangannya diterima? Mereka menjawab, \"Ya, jika taubatnya telah nyata.\""
  },
  {
    "id": 35663,
    "hadith_number": 1485,
    "tajuk_hadith": "Saksi Yang Telah Dirajam Kemudian Bertaubat",
    "perawi_melayu": "Malik meriwayatkan daripada Ibn Syihab",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ سَمِعَ ابْنَ شِهَابٍ، يُسْأَلُ عَنْ ذَلِكَ، فَقَالَ مِثْلَ مَا قَالَ سُلَيْمَانُ بْنُ يَسَارٍ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ الأَمْرُ عِنْدَنَا وَذَلِكَ لِقَوْلِ اللَّهِ تَبَارَكَ وَتَعَالَى ‏{‏وَالَّذِينَ يَرْمُونَ الْمُحْصَنَاتِ ثُمَّ لَمْ يَأْتُوا بِأَرْبَعَةِ شُهَدَاءَ فَاجْلِدُوهُمْ ثَمَانِينَ جَلْدَةً وَلاَ تَقْبَلُوا لَهُمْ شَهَادَةً أَبَدًا وَأُولَئِكَ هُمُ الْفَاسِقُونَ * إِلاَّ الَّذِينَ تَابُوا مِنْ بَعْدِ ذَلِكَ وَأَصْلَحُوا فَإِنَّ اللَّهَ غَفُورٌ رَحِيمٌ‏}‏‏.‏ قَالَ مَالِكٌ فَالأَمْرُ الَّذِي لاَ اخْتِلاَفَ فِيهِ عِنْدَنَا أَنَّ الَّذِي يُجْلَدُ الْحَدَّ ثُمَّ تَابَ وَأَصْلَحَ تَجُوزُ شَهَادَتُهُ وَهُوَ أَحَبُّ مَا سَمِعْتُ إِلَىَّ فِي ذَلِكَ ‏.‏",
    "malay_translation": "Malik meriwayatkan bahawa beliau mendengar Ibn Syihab ditanya tentang perkara itu, lalu beliau berkata sepertimana yang dikatakan oleh Sulaiman bin Yasar. Malik berkata, dan itulah perkara yang kami amalkan, dan itu berdasarkan firman Allah SWT: {Dan orang-orang yang menuduh perempuan-perempuan yang baik-baik (berzina) kemudian tidak mendatangkan empat orang saksi, maka deralah mereka (yang menuduh itu) delapan puluh kali dera, dan janganlah kamu terima kesaksian mereka selama-lamanya. Dan mereka itulah orang-orang yang fasik, kecuali orang-orang yang bertaubat sesudah itu dan memperbaiki diri. Maka sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.} Malik berkata, maka perkara yang tidak ada perselisihan padanya di kalangan kami ialah sesiapa yang dijatuhkan hukuman dera kemudian bertaubat dan memperbaiki diri, maka keterangannya diterima, dan itulah yang paling aku sukai yang aku dengar dalam hal ini."
  },
  {
    "id": 35664,
    "hadith_number": 1486,
    "tajuk_hadith": "Hukum Berdasarkan Sumpah dan Seorang Saksi",
    "perawi_melayu": "Yahya berkata, Malik meriwayatkan daripada Jaafar bin Muhammad daripada bapanya",
    "english_text": "Yahya said, \"Malik said from Jafar ibn Muhammad from his father\nthat the Messenger of Allah, may Allah bless him and grant him peace,\npronounced judgement on the basis of an oath with one witness.\"",
    "arabic_text": "قَالَ يَحْيَى قَالَ مَالِكٌ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى بِالْيَمِينِ مَعَ الشَّاهِدِ ‏.‏",
    "malay_translation": "Yahya berkata, \"Malik meriwayatkan daripada Jaafar bin Muhammad daripada bapanya bahawa Rasulullah SAW telah membuat keputusan berdasarkan sumpah bersama seorang saksi.\""
  },
  {
    "id": 35665,
    "hadith_number": 1487,
    "tajuk_hadith": "Hukum Mengikut Sumpah dengan Satu Saksi",
    "perawi_melayu": "Malik melalui Abu az-Zinad",
    "english_text": "From Malik from Abu'z-Zinad that Umar ibn Abd al-Aziz wrote to\nAbd al-Hamid ibn Abd ar-Rahman ibn Zayd ibn al-Khattab who was the\ngovernor of Kufa, \"Pronounce judgement on the basis of an oath with\none witness.\"",
    "arabic_text": "وَعَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، كَتَبَ إِلَى عَبْدِ الْحَمِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ زَيْدِ بْنِ الْخَطَّابِ وَهُوَ عَامِلٌ عَلَى الْكُوفَةِ أَنِ اقْضِ بِالْيَمِينِ مَعَ الشَّاهِدِ ‏.‏",
    "malay_translation": "Dari Malik, melalui Abu az-Zinad, bahawa Umar ibn Abd al-Aziz telah menulis kepada Abd al-Hamid ibn Abd ar-Rahman ibn Zayd ibn al-Khattab, yang ketika itu menjadi gabenor Kufah:  “Buatlah keputusan berdasarkan sumpah bersama seorang saksi.”"
  },
  {
    "id": 35666,
    "hadith_number": 1488,
    "tajuk_hadith": "Saksi Tunggal dan Sumpah dalam Perkara Harta",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ، وَسُلَيْمَانَ بْنَ يَسَارٍ، سُئِلاَ هَلْ يُقْضَى بِالْيَمِينِ مَعَ الشَّاهِدِ فَقَالاَ نَعَمْ ‏.‏ قَالَ مَالِكٌ مَضَتِ السُّنَّةُ فِي الْقَضَاءِ بِالْيَمِينِ مَعَ الشَّاهِدِ الْوَاحِدِ يَحْلِفُ صَاحِبُ الْحَقِّ مَعَ شَاهِدِهِ وَيَسْتَحِقُّ حَقَّهُ فَإِنْ نَكَلَ وَأَبَى أَنْ يَحْلِفَ أُحْلِفَ الْمَطْلُوبُ فَإِنْ حَلَفَ سَقَطَ عَنْهُ ذَلِكَ الْحَقُّ وَإِنْ أَبَى أَنْ يَحْلِفَ ثَبَتَ عَلَيْهِ الْحَقُّ لِصَاحِبِهِ ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا يَكُونُ ذَلِكَ فِي الأَمْوَالِ خَاصَّةً وَلاَ يَقَعُ ذَلِكَ فِي شَىْءٍ مِنَ الْحُدُودِ وَلاَ فِي نِكَاحٍ وَلاَ فِي طَلاَقٍ وَلاَ فِي عَتَاقَةٍ وَلاَ فِي سَرِقَةٍ وَلاَ فِي فِرْيَةٍ فَإِنْ قَالَ قَائِلٌ فَإِنَّ الْعَتَاقَةَ مِنَ الأَمْوَالِ ‏.‏ فَقَدْ أَخْطَأَ لَيْسَ ذَلِكَ عَلَى مَا قَالَ وَلَوْ كَانَ ذَلِكَ عَلَى مَا قَالَ لَحَلَفَ الْعَبْدُ مَعَ شَاهِدِهِ إِذَا جَاءَ بِشَاهِدٍ أَنَّ سَيِّدَهُ أَعْتَقَهُ وَأَنَّ الْعَبْدَ إِذَا جَاءَ بِشَاهِدٍ عَلَى مَالٍ مِنَ الأَمْوَالِ ادَّعَاهُ حَلَفَ مَعَ شَاهِدِهِ وَاسْتَحَقَّ حَقَّهُ كَمَا يَحْلِفُ الْحُرُّ ‏.‏ قَالَ مَالِكٌ فَالسُّنَّةُ عِنْدَنَا أَنَّ الْعَبْدَ إِذَا جَاءَ بِشَاهِدٍ عَلَى عَتَاقَتِهِ اسْتُحْلِفَ سَيِّدُهُ مَا أَعْتَقَهُ وَبَطَلَ ذَلِكَ عَنْهُ ‏.‏ قَالَ مَالِكٌ وَكَذَلِكَ السُّنَّةُ عِنْدَنَا أَيْضًا فِي الطَّلاَقِ إِذَا جَاءَتِ الْمَرْأَةُ بِشَاهِدٍ أَنَّ زَوْجَهَا طَلَّقَهَا أُحْلِفَ زَوْجُهَا مَا طَلَّقَهَا فَإِذَا حَلَفَ لَمْ يَقَعْ عَلَيْهِ الطَّلاَقُ ‏.‏ قَالَ مَالِكٌ فَسُنَّةُ الطَّلاَقِ وَالْعَتَاقَةِ فِي الشَّاهِدِ الْوَاحِدِ وَاحِدَةٌ إِنَّمَا يَكُونُ الْيَمِينُ عَلَى زَوْجِ الْمَرْأَةِ وَعَلَى سَيِّدِ الْعَبْدِ وَإِنَّمَا الْعَتَاقَةُ حَدٌّ مِنَ الْحُدُودِ لاَ تَجُوزُ فِيهَا شَهَادَةُ النِّسَاءِ لأَنَّهُ إِذَا عَتَقَ الْعَبْدُ ثَبَتَتْ حُرْمَتُهُ وَوَقَعَتْ لَهُ الْحُدُودُ وَوَقَعَتْ عَلَيْهِ وَإِنْ زَنَى وَقَدْ أُحْصِنَ رُجِمَ وَإِنْ قَتَلَ الْعَبْدَ قُتِلَ بِهِ وَثَبَتَ لَهُ الْمِيرَاثُ بَيْنَهُ وَبَيْنَ مَنْ يُوَارِثُهُ فَإِنِ احْتَجَّ مُحْتَجٌّ فَقَالَ لَوْ أَنَّ رَجُلاً أَعْتَقَ عَبْدَهُ وَجَاءَ رَجُلٌ يَطْلُبُ سَيِّدَ الْعَبْدِ بِدَيْنٍ لَهُ عَلَيْهِ فَشَهِدَ لَهُ عَلَى حَقِّهِ ذَلِكَ رَجُلٌ وَامْرَأَتَانِ فَإِنَّ ذَلِكَ يُثْبِتُ الْحَقَّ عَلَى سَيِّدِ الْعَبْدِ حَتَّى تُرَدَّ بِهِ عَتَاقَتُهُ إِذَا لَمْ يَكُنْ لِسَيِّدِ الْعَبْدِ مَالٌ غَيْرُ الْعَبْدِ يُرِيدُ أَنْ يُجِيزَ بِذَلِكَ شَهَادَةَ النِّسَاءِ فِي الْعَتَاقَةِ فَإِنَّ ذَلِكَ لَيْسَ عَلَى مَا قَالَ وَإِنَّمَا مَثَلُ ذَلِكَ الرَّجُلُ يَعْتِقُ عَبْدَهُ ثُمَّ يَأْتِي طَالِبُ الْحَقِّ عَلَى سَيِّدِهِ بِشَاهِدٍ وَاحِدٍ فَيَحْلِفُ مَعَ شَاهِدِهِ ثُمَّ يَسْتَحِقُّ حَقَّهُ وَتُرَدُّ بِذَلِكَ عَتَاقَةُ الْعَبْدِ أَوْ يَأْتِي الرَّجُلُ قَدْ كَانَتْ بَيْنَهُ وَبَيْنَ سَيِّدِ الْعَبْدِ مُخَالَطَةٌ وَمُلاَبَسَةٌ فَيَزْعُمُ أَنَّ لَهُ عَلَى سَيِّدِ الْعَبْدِ مَالاً فَيُقَالُ لِسَيِّدِ الْعَبْدِ احْلِفْ مَا عَلَيْكَ مَا ادَّعَى فَإِنْ نَكَلَ وَأَبَى أَنْ يَحْلِفَ حُلِّفَ صَاحِبُ الْحَقِّ وَثَبَتَ حَقُّهُ عَلَى سَيِّدِ الْعَبْدِ فَيَكُونُ ذَلِكَ يَرُدُّ عَتَاقَةَ الْعَبْدِ إِذَا ثَبَتَ الْمَالُ عَلَى سَيِّدِهِ ‏.‏ قَالَ وَكَذَلِكَ أَيْضًا الرَّجُلُ يَنْكِحُ الأَمَةَ فَتَكُونُ امْرَأَتَهُ فَيَأْتِي سَيِّدُ الأَمَةِ إِلَى الرَّجُلِ الَّذِي تَزَوَّجَهَا فَيَقُولُ ابْتَعْتَ مِنِّي جَارِيَتِي فُلاَنَةَ أَنْتَ وَفُلاَنٌ بِكَذَا وَكَذَا دِينَارًا ‏.‏ فَيُنْكِرُ ذَلِكَ زَوْجُ الأَمَةِ فَيَأْتِي سَيِّدُ الأَمَةِ بِرَجُلٍ وَامْرَأَتَيْنِ فَيَشْهَدُونَ عَلَى مَا قَالَ فَيَثْبُتُ بَيْعُهُ وَيَحِقُّ حَقُّهُ وَتَحْرُمُ الأَمَةُ عَلَى زَوْجِهَا وَيَكُونُ ذَلِكَ فِرَاقًا بَيْنَهُمَا وَشَهَادَةُ النِّسَاءِ لاَ تَجُوزُ فِي الطَّلاَقِ ‏.‏ قَالَ مَالِكٌ وَمِنْ ذَلِكَ أَيْضًا الرَّجُلُ يَفْتَرِي عَلَى الرَّجُلِ الْحُرِّ فَيَقَعُ عَلَيْهِ الْحَدُّ فَيَأْتِي رَجُلٌ وَامْرَأَتَانِ فَيَشْهَدُونَ أَنَّ الَّذِي افْتُرِيَ عَلَيْهِ عَبْدٌ مَمْلُوكٌ فَيَضَعُ ذَلِكَ الْحَدَّ عَنِ الْمُفْتَرِي بَعْدَ أَنْ وَقَعَ عَلَيْهِ وَشَهَادَةُ النِّسَاءِ لاَ تَجُوزُ فِي الْفِرْيَةِ ‏.‏ قَالَ مَالِكٌ وَمِمَّا يُشْبِهُ ذَلِكَ أَيْضًا مِمَّا يَفْتَرِقُ فِيهِ الْقَضَاءُ وَمَا مَضَى مِنَ السُّنَّةِ أَنَّ الْمَرْأَتَيْنِ يَشْهَدَانِ عَلَى اسْتِهْلاَلِ الصَّبِيِّ فَيَجِبُ بِذَلِكَ مِيرَاثُهُ حَتَّى يَرِثَ وَيَكُونُ مَالُهُ لِمَنْ يَرِثُهُ إِنْ مَاتَ الصَّبِيُّ وَلَيْسَ مَعَ الْمَرْأَتَيْنِ اللَّتَيْنِ شَهِدَتَا رَجُلٌ وَلاَ يَمِينٌ وَقَدْ يَكُونُ ذَلِكَ فِي الأَمْوَالِ الْعِظَامِ مِنَ الذَّهَبِ وَالْوَرِقِ وَالرِّبَاعِ وَالْحَوَائِطِ وَالرَّقِيقِ وَمَا سِوَى ذَلِكَ مِنَ الأَمْوَالِ وَلَوْ شَهِدَتِ امْرَأَتَانِ عَلَى دِرْهَمٍ وَاحِدٍ أَوْ أَقَلَّ مِنْ ذَلِكَ أَوْ أَكْثَرَ لَمْ تَقْطَعْ شَهَادَتُهُمَا شَيْئًا وَلَمْ تَجُزْ إِلاَّ أَنْ يَكُونَ مَعَهُمَا شَاهِدٌ أَوْ يَمِينٌ ‏.‏ قَالَ مَالِكٌ وَمِنَ النَّاسِ مَنْ يَقُولُ لاَ تَكُونُ الْيَمِينُ مَعَ الشَّاهِدِ الْوَاحِدِ ‏.‏ وَيَحْتَجُّ بِقَوْلِ اللَّهِ تَبَارَكَ وَتَعَالَى وَقَوْلُهُ الْحَقُّ ‏{‏وَاسْتَشْهِدُوا شَهِيدَيْنِ مِنْ رِجَالِكُمْ فَإِنْ لَمْ يَكُونَا رَجُلَيْنِ فَرَجُلٌ وَامْرَأَتَانِ مِمَّنْ تَرْضَوْنَ مِنَ الشُّهَدَاءِ‏}‏ يَقُولُ فَإِنْ لَمْ يَأْتِ بِرَجُلٍ وَامْرَأَتَيْنِ فَلاَ شَىْءَ لَهُ وَلاَ يُحَلَّفُ مَعَ شَاهِدِهِ ‏.‏ قَالَ مَالِكٌ فَمِنَ الْحُجَّةِ عَلَى مَنْ قَالَ ذَلِكَ الْقَوْلَ أَنْ يُقَالَ لَهُ أَرَأَيْتَ لَوْ أَنَّ رَجُلاً ادَّعَى عَلَى رَجُلٍ مَالاً أَلَيْسَ يَحْلِفُ الْمَطْلُوبُ مَا ذَلِكَ الْحَقُّ عَلَيْهِ فَإِنْ حَلَفَ بَطَلَ ذَلِكَ عَنْهُ وَإِنْ نَكَلَ عَنِ الْيَمِينِ حُلِّفَ صَاحِبُ الْحَقِّ إِنَّ حَقَّهُ لَحَقٌّ ‏.‏ وَثَبَتَ حَقُّهُ عَلَى صَاحِبِهِ فَهَذَا مَا لاَ اخْتِلاَفَ فِيهِ عِنْدَ أَحَدٍ مِنَ النَّاسِ وَلاَ بِبَلَدٍ مِنَ الْبُلْدَانِ فَبِأَىِّ شَىْءٍ أَخَذَ هَذَا أَوْ فِي أَىِّ مَوْضِعٍ مِنْ كِتَابِ اللَّهِ وَجَدَهُ فَإِنْ أَقَرَّ بِهَذَا فَلْيُقْرِرْ بِالْيَمِينِ مَعَ الشَّاهِدِ وَإِنْ لَمْ يَكُنْ ذَلِكَ فِي كِتَابِ اللَّهِ عَزَّ وَجَلَّ وَأَنَّهُ لَيَكْفِي مِنْ ذَلِكَ مَا مَضَى مِنَ السُّنَّةِ وَلَكِنِ الْمَرْءُ قَدْ يُحِبُّ أَنْ يَعْرِفَ وَجْهَ الصَّوَابِ وَمَوْقِعَ الْحُجَّةِ فَفِي هَذَا بَيَانُ مَا أَشْكَلَ مِنْ ذَلِكَ إِنْ شَاءَ اللَّهُ تَعَالَى ‏.‏",
    "malay_translation": "Malik telah meriwayatkan kepadaku bahawa baginda telah diberitahu bahawa Abu Salamah ibn Abd al-Rahman dan Sulaiman ibn Yasar telah ditanya, \"Adakah seseorang membuat keputusan berdasarkan sumpah dengan seorang saksi?\" Mereka berdua menjawab, \"Ya.\"\n\nMalik berkata, \"Sunnah yang telah diamalkan dalam membuat keputusan berdasarkan sumpah dengan seorang saksi ialah jika penggugat bersumpah dengan saksi, maka dia berhak atas haknya. Jika dia menolak dan enggan bersumpah, maka yang dituduh perlu bersumpah. Jika dia bersumpah, tuntutan terhadapnya gugur. Jika dia enggan bersumpah, maka tuntutan itu tetap terhadapnya.\"\n\nMalik berkata, \"Prosedur ini khusus untuk kes harta benda sahaja. Ia tidak digunakan dalam sebarang hukuman had, mahupun dalam perkahwinan, perceraian, pembebasan hamba, kecurian atau fitnah. Jika ada yang berkata, 'Pembebasan hamba termasuk dalam kategori harta', maka dia telah melakukan kesilapan. Ia bukan seperti yang dikatakannya. Sekiranya ia seperti yang dikatakannya, seorang hamba boleh bersumpah dengan seorang saksi, jika dia dapat menemuinya, bahawa tuannya telah membebaskannya.\n\n\"Walau bagaimanapun, apabila seorang hamba menuntut sebidang harta, dia boleh bersumpah dengan seorang saksi dan menuntut haknya sepertimana orang merdeka menuntut haknya.\"\n\nMalik berkata, \"Sunnah di kalangan kita ialah apabila seorang hamba membawa seseorang yang menyaksikan bahawa dia telah dibebaskan, tuannya diminta bersumpah bahawa dia tidak membebaskannya, dan tuntutan hamba itu gugur.\"\n\nMalik berkata, \"Sunnah tentang perceraian juga sama di kalangan kita. Apabila seorang wanita membawa seseorang yang menyaksikan bahawa suaminya telah menceraikannya, suaminya diminta bersumpah bahawa dia tidak menceraikannya. Jika dia bersumpah, perceraian itu tidak berlaku.\"\n\nMalik berkata, \"Hanya ada satu sunnah membawa saksi dalam kes perceraian dan pembebasan hamba. Hak untuk bersumpah hanya milik suami kepada wanita itu, dan tuan kepada hamba itu. Pembebasan adalah perkara had, dan keterangan wanita tidak dibenarkan di dalamnya kerana apabila seorang hamba dibebaskan, kebebasan dan martabatnya ditegakkan dan hukuman had dikenakan ke atasnya dan terhadapnya. Jika dia melakukan zina dan telah berkahwin, dia direjam. Jika dia membunuh seorang hamba, dia dibunuh sebagai balasan. Pewarisan ditetapkan untuknya, di antara dia dan sesiapa yang mewarisinya. Jika seseorang membantah ini, dengan mengatakan bahawa jika seseorang membebaskan hambanya dan kemudian seseorang datang menuntut bayaran hutang daripada tuan hamba itu, dan seorang lelaki dan dua wanita memberi keterangan, itu akan mengesahkan hak terhadap tuan hamba itu sehingga pembebasannya dibatalkan jika dia hanya mempunyai hamba itu sebagai harta, dengan menyimpulkan bahawa keterangan wanita dibenarkan dalam kes pembebasan. Kes itu bukan seperti yang dicadangkannya (iaitu kes harta bukan pembebasan). Ia seperti seorang lelaki yang membebaskan hambanya, dan kemudian peminta hutang datang kepada tuan dan bersumpah dengan seorang saksi, menuntut haknya. Dengan itu, pembebasan hamba itu akan dibatalkan. Atau seorang lelaki datang yang sering berurusan dan bertransaksi dengan tuan hamba itu. Dia mendakwa bahawa dia berhutang wang kepada tuan hamba itu. Seseorang berkata kepada tuan hamba itu, 'Bersumpahlah bahawa engkau tidak berhutang apa yang didakwanya'. Jika dia menolak dan enggan bersumpah, pihak yang membuat tuntutan bersumpah dan haknya terhadap tuan hamba itu disahkan. Itu akan membatalkan pembebasan hamba itu jika disahkan bahawa harta itu dihutangi oleh tuan.\"\n\nMalik berkata, \"Begitu juga dengan seorang lelaki yang mengahwini seorang hamba perempuan dan kemudian tuan hamba perempuan itu datang kepada lelaki yang telah mengahwininya dan mendakwa, 'Engkau dan si polan telah membeli hamba perempuanku daripadaku dengan sejumlah dinar.' Suami hamba perempuan itu menafikannya. Tuan hamba perempuan itu membawa seorang lelaki dan dua wanita dan mereka memberi keterangan tentang apa yang telah dikatakannya. Jual beli itu disahkan dan tuntutannya dianggap benar. Oleh itu, hamba perempuan itu haram bagi suaminya dan mereka terpaksa berpisah, walaupun keterangan wanita tidak diterima dalam perceraian.\"\n\nMalik berkata, \"Begitu juga dengan seorang lelaki yang menuduh seorang lelaki merdeka, maka hukuman had dikenakan ke atasnya. Seorang lelaki dan dua wanita datang dan memberi keterangan bahawa yang dituduh itu adalah seorang hamba. Itu akan menghapuskan hukuman had daripada yang dituduh selepas ia dikenakan ke atasnya, walaupun keterangan wanita tidak diterima dalam tuduhan yang melibatkan hukuman had.\"\n\nMalik berkata, \"Satu lagi kes yang serupa di mana keputusan nampaknya bertentangan dengan sunnah ialah dua wanita memberi keterangan bahawa seorang kanak-kanak dilahirkan hidup dan oleh itu dia perlu mewarisi jika keadaan timbul di mana dia berhak mewarisi, dan harta kanak-kanak itu pergi kepada mereka yang mewarisinya, jika dia meninggal dunia, dan tidak perlu dua wanita saksi itu disertai oleh seorang lelaki atau sumpah walaupun ia mungkin melibatkan harta benda yang banyak seperti emas, perak, ternakan, kebun dan hamba dan harta lain. Walau bagaimanapun, sekiranya dua wanita memberi keterangan mengenai satu dirham atau lebih atau kurang daripada itu dalam kes harta, keterangan mereka tidak akan memberi kesan apa-apa dan tidak dibenarkan melainkan terdapat saksi atau sumpah bersama mereka.\"\n\nMalik berkata, \"Ada orang yang mengatakan bahawa sumpah tidak boleh diterima hanya dengan seorang saksi dan mereka berhujah dengan firman Allah yang diberkati, Yang Maha Tinggi, dan firman-Nya adalah Kebenaran, 'Dan panggil dua orang saksi, lelaki; atau jika dua orang itu bukan lelaki, maka seorang lelaki dan dua orang perempuan, sebagai saksi yang kamu redhai.' (Surah 2 ayat 282). Orang-orang itu berhujah bahawa jika dia tidak membawa seorang lelaki dan dua wanita, dia tidak mempunyai tuntutan dan dia tidak dibenarkan bersumpah dengan seorang saksi.\"\n\nMalik berkata, \"Sebahagian daripada bukti menentang mereka yang berhujah ini, ialah untuk menjawab mereka, 'Adakah kamu fikir bahawa jika seorang lelaki menuntut harta daripada seorang lelaki, yang dituduh itu tidak akan bersumpah bahawa tuntutan itu palsu?' Jika dia bersumpah, tuntutan terhadapnya gugur. Jika dia enggan bersumpah, penggugat diminta bersumpah bahawa tuntutannya adalah benar, dan haknya terhadap temannya ditegakkan. Tiada perselisihan tentang ini dengan sesiapa pun atau di mana-mana negara. Dengan apa dia mengambil ini? Di manakah dalam Kitab Allah dia menemuinya? Jadi jika dia mengesahkan ini, biarlah dia mengesahkan sumpah dengan seorang saksi, walaupun ia tidak ada dalam Kitab Allah, Yang Maha Kuasa, Yang Maha Agung! Sudah memadai bahawa ini adalah sunnah yang telah diamalkan. Walau bagaimanapun, manusia ingin mengetahui cara tindakan yang betul dan lokasi bukti. Dalam hal ini terdapat penjelasan bagi apa yang samar-samar tentang itu, jika Allah ta'ala berkehendak."
  },
  {
    "id": 35667,
    "hadith_number": 1489,
    "tajuk_hadith": "Hutang Piutang dan Sumpah",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan bahawa Malik menceritakan tentang seorang lelaki yang meninggal dunia dan mempunyai hutang yang tertunggak kepadanya, dan hanya terdapat seorang saksi.  Ada juga orang yang berhutang kepadanya, dan mereka juga hanya mempunyai seorang saksi.  Warisnya enggan bersumpah atas hak mereka dengan saksi tersebut.  Malik berkata, \"Pihak pemiutang bersumpah dan mengambil hak mereka. Jika ada lebihan, waris tidak mengambil apa-apa pun. Ini kerana sumpah telah ditawarkan kepada mereka sebelum ini, tetapi mereka menolaknya, melainkan jika mereka berkata, ‘Kami tidak tahu bahawa rakan kami mempunyai lebihan,’ dan diketahui bahawa mereka hanya menolak sumpah kerana perkara itu.  Saya berpendapat bahawa mereka patut bersumpah dan mengambil apa yang tinggal selepas hutangnya dilunaskan.\""
  },
  {
    "id": 35668,
    "hadith_number": 1490,
    "tajuk_hadith": "Hukum Sumpah dalam Perbicaraan Zaman Umar bin Abdul Aziz",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Jamil bin Abdur Rahman al-Muazzin",
    "english_text": "",
    "arabic_text": "قَالَ يَحْيَى قَالَ مَالِكٌ عَنْ جَمِيلِ بْنِ عَبْدِ الرَّحْمَنِ الْمُؤَذِّنِ، أَنَّهُ كَانَ يَحْضُرُ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ وَهُوَ يَقْضِي بَيْنَ النَّاسِ فَإِذَا جَاءَهُ الرَّجُلُ يَدَّعِي عَلَى الرَّجُلِ حَقًّا نَظَرَ فَإِنْ كَانَتْ بَيْنَهُمَا مُخَالَطَةٌ أَوْ مُلاَبَسَةٌ أَحْلَفَ الَّذِي ادُّعِيَ عَلَيْهِ وَإِنْ لَمْ يَكُنْ شَىْءٌ مِنْ ذَلِكَ لَمْ يُحَلِّفْهُ ‏.‏ قَالَ مَالِكٌ وَعَلَى ذَلِكَ الأَمْرُ عِنْدَنَا أَنَّهُ مَنِ ادَّعَى عَلَى رَجُلٍ بِدَعْوَى نُظِرَ فَإِنْ كَانَتْ بَيْنَهُمَا مُخَالَطَةٌ أَوْ مُلاَبَسَةٌ أُحْلِفَ الْمُدَّعَى عَلَيْهِ فَإِنْ حَلَفَ بَطَلَ ذَلِكَ الْحَقُّ عَنْهُ وَإِنْ أَبَى أَنْ يَحْلِفَ وَرَدَّ الْيَمِينَ عَلَى الْمُدَّعِي فَحَلَفَ طَالِبُ الْحَقِّ أَخَذَ حَقَّهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Jamil bin Abdur Rahman al-Muazzin, bahawa beliau pernah hadir ketika Umar bin Abdul Aziz menghakimi di antara manusia.  Jika seseorang datang kepadanya mendakwa hak ke atas seseorang, maka baginda akan melihat. Jika terdapat urusan atau transaksi di antara mereka, maka orang yang didakwa akan disumpah.  Jika tidak ada apa-apa, maka baginda tidak akan menyuruhnya bersumpah.\n\nMalik berkata, “Begitulah hukumnya di sisi kami, iaitu jika seseorang mendakwa seseorang dengan sesuatu dakwaan, maka ia akan dikaji. Jika terdapat urusan atau transaksi di antara mereka, maka orang yang didakwa akan disumpah. Jika dia bersumpah, maka gugurlah hak itu darinya.  Jika dia enggan bersumpah dan memulangkan sumpah kepada orang yang mendakwa, maka orang yang mendakwa itu bersumpah dan mendapat haknya.”"
  },
  {
    "id": 35669,
    "hadith_number": 1491,
    "tajuk_hadith": "Saksi Kanak-Kanak Mengenai Kecederaan",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Hisyam bin Urwah daripada Abdullah bin Zubair",
    "english_text": "",
    "arabic_text": "قَالَ يَحْيَى قَالَ مَالِكٌ عَنْ هِشَامِ بْنِ عُرْوَةَ، أَنَّ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ، كَانَ يَقْضِي بِشَهَادَةِ الصِّبْيَانِ فِيمَا بَيْنَهُمْ مِنَ الْجِرَاحِ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّ شَهَادَةَ الصِّبْيَانِ تَجُوزُ فِيمَا بَيْنَهُمْ مِنَ الْجِرَاحِ وَلاَ تَجُوزُ عَلَى غَيْرِهِمْ وَإِنَّمَا تَجُوزُ شَهَادَتُهُمْ فِيمَا بَيْنَهُمْ مِنَ الْجِرَاحِ وَحْدَهَا لاَ تَجُوزُ فِي غَيْرِ ذَلِكَ إِذَا كَانَ ذَلِكَ قَبْلَ أَنْ يَتَفَرَّقُوا أَوْ يُخَبَّبُوا أَوْ يُعَلَّمُوا فَإِنِ افْتَرَقُوا فَلاَ شَهَادَةَ لَهُمْ إِلاَّ أَنْ يَكُونُوا قَدْ أَشْهَدُوا الْعُدُولَ عَلَى شَهَادَتِهِمْ قَبْلَ أَنْ يَفْتَرِقُوا ‏.‏",
    "malay_translation": "Yahya berkata, Malik berkata daripada Hisyam bin Urwah bahawa Abdullah bin Zubair telah menghakimi berdasarkan keterangan kanak-kanak mengenai kecederaan di antara mereka.  Malik berkata, perkara yang telah disepakati di kalangan kita ialah keterangan kanak-kanak dibenarkan mengenai kecederaan di antara mereka sahaja, dan tidak dibenarkan bagi perkara lain. Keterangan mereka hanya dibenarkan mengenai kecederaan di antara mereka sahaja, dan tidak dibenarkan bagi perkara lain, jika ia berlaku sebelum mereka berpecah atau dihasut atau diajar. Jika mereka telah berpecah, maka tiada keterangan bagi mereka melainkan jika mereka telah menyaksikan kepada saksi-saksi yang adil mengenai keterangan mereka sebelum mereka berpecah."
  },
  {
    "id": 35670,
    "hadith_number": 1492,
    "tajuk_hadith": "Sumpah Palsu di Mimbar",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Hisyam bin Hisyam bin Utbah bin Abi Waqqas, daripada Abdullah bin Nistas, daripada Jabir bin Abdullah al-Ansari",
    "english_text": "Yahya said, Malik related to us from Hisham ibn Hisham ibn Utba ibn Abi Waqqas from Abdullah ibn Nistas from Jabir ibn Abdullah al-Ansari that the Messenger of Allah, may Allah bless him and grant him peace, said, 'If someone swears a false oath near this mimbar of mine, he will take his seat in the fire.' ",
    "arabic_text": "قَالَ يَحْيَى حَدَّثَنَا مَالِكٌ، عَنْ هَاشِمِ بْنِ هَاشِمِ بْنِ عُتْبَةَ بْنِ أَبِي وَقَّاصٍ، عَنْ عَبْدِ اللَّهِ بْنِ نِسْطَاسٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ الأَنْصَارِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ حَلَفَ عَلَى مِنْبَرِي آثِمًا تَبَوَّأَ مَقْعَدَهُ مِنَ النَّارِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya berkata, Malik meriwayatkan kepada kami daripada Hisyam bin Hisyam bin Utbah bin Abi Waqqas, daripada Abdullah bin Nistas, daripada Jabir bin Abdullah al-Ansari bahawa Rasulullah SAW bersabda:  \"Barangsiapa bersumpah palsu di mimbarku, nescaya dia akan mendapat tempat duduknya di dalam neraka.\""
  },
  {
    "id": 35671,
    "hadith_number": 1493,
    "tajuk_hadith": "Menghalang Hak Muslim Dengan Sumpah",
    "perawi_melayu": "Malik meriwayatkan daripada al-Ala' ibn Abd ar-Rahman daripada Mabad ibn Kab as-Salami daripada saudaranya Abdullah ibn Kab ibn Malik al-Ansari daripada Abu Umamah",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ مَعْبَدِ بْنِ كَعْبٍ السَّلَمِيِّ، عَنْ أَخِيهِ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ الأَنْصَارِيِّ، عَنْ أَبِي أُمَامَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنِ اقْتَطَعَ حَقَّ امْرِئٍ مُسْلِمٍ بِيَمِينِهِ حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ وَأَوْجَبَ لَهُ النَّارَ ‏\"‏ ‏.‏ قَالُوا وَإِنْ كَانَ شَيْئًا يَسِيرًا يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَإِنْ كَانَ قَضِيبًا مِنْ أَرَاكٍ وَإِنْ كَانَ قَضِيبًا مِنْ أَرَاكٍ وَإِنْ كَانَ قَضِيبًا مِنْ أَرَاكٍ ‏\"‏ ‏.‏ قَالَهَا ثَلاَثَ مَرَّاتٍ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada al-Ala' ibn Abd ar-Rahman daripada Mabad ibn Kab as-Salami daripada saudaranya Abdullah ibn Kab ibn Malik al-Ansari daripada Abu Umamah bahawa Rasulullah SAW bersabda:  \"Barang siapa yang menghalang hak seorang muslim dengan sumpahnya, maka Allah mengharamkan syurga ke atasnya dan mewajibkan neraka baginya.\" Mereka bertanya: \"Walaupun ia sesuatu yang sedikit wahai Rasulullah?\" Baginda menjawab:  \"Walaupun ia sebesar lidi, walaupun ia sebesar lidi, walaupun ia sebesar lidi.\" Baginda mengulanginya sebanyak tiga kali."
  },
  {
    "id": 35672,
    "hadith_number": 1494,
    "tajuk_hadith": "Pertikaian Rumah dan Sumpah di Mimbar",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Daud bin al-Husayn, bahawa beliau mendengar Abu Ghatafan bin Tarif al-Muri berkata:",
    "english_text": "",
    "arabic_text": "قَالَ يَحْيَى قَالَ مَالِكٌ عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، أَنَّهُ سَمِعَ أَبَا غَطَفَانَ بْنَ طَرِيفٍ الْمُرِّيَّ، يَقُولُ اخْتَصَمَ زَيْدُ بْنُ ثَابِتٍ الأَنْصَارِيُّ وَابْنُ مُطِيعٍ فِي دَارٍ كَانَتْ بَيْنَهُمَا إِلَى مَرْوَانَ بْنِ الْحَكَمِ وَهُوَ أَمِيرٌ عَلَى الْمَدِينَةِ فَقَضَى مَرْوَانُ عَلَى زَيْدِ بْنِ ثَابِتٍ بِالْيَمِينِ عَلَى الْمِنْبَرِ ‏.‏ فَقَالَ زَيْدُ بْنُ ثَابِتٍ أَحْلِفُ لَهُ مَكَانِي ‏.‏ قَالَ فَقَالَ مَرْوَانُ لاَ وَاللَّهِ إِلاَّ عِنْدَ مَقَاطِعِ الْحُقُوقِ ‏.‏ قَالَ فَجَعَلَ زَيْدُ بْنُ ثَابِتٍ يَحْلِفُ أَنَّ حَقَّهُ لَحَقٌّ ‏.‏ وَيَأْبَى أَنْ يَحْلِفَ عَلَى الْمِنْبَرِ - قَالَ - فَجَعَلَ مَرْوَانُ بْنُ الْحَكَمِ يَعْجَبُ مِنْ ذَلِكَ ‏.‏ قَالَ مَالِكٌ لاَ أَرَى أَنْ يُحَلَّفَ أَحَدٌ عَلَى الْمِنْبَرِ عَلَى أَقَلَّ مِنْ رُبُعِ دِينَارٍ وَذَلِكَ ثَلاَثَةُ دَرَاهِمَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Daud bin al-Husayn, bahawa beliau mendengar Abu Ghatafan bin Tarif al-Muri berkata, \"Zayd bin Thabit al-Ansari dan Ibn Mutiy berselisih faham mengenai sebuah rumah yang mereka kongsi. Mereka mengadu kepada Marwan bin al-Hakam yang ketika itu merupakan gabenor Madinah. Marwan memutuskan bahawa Zayd bin Thabit perlu bersumpah di atas mimbar. Zayd bin Thabit berkata, 'Saya bersumpah di tempat saya berdiri sekarang.' Marwan berkata, 'Tidak, demi Allah! Hanya di tempat penyelesaian tuntutan (iaitu mimbar).' Zayd bin Thabit mula bersumpah bahawa haknya adalah benar, dan dia enggan bersumpah di mimbar. Marwan bin al-Hakam hairan dengan perkara itu.\" \n\nMalik berkata, \"Saya berpendapat bahawa tiada sesiapa pun yang patut dipaksa bersumpah di mimbar untuk sesuatu yang kurang daripada suku dinar, iaitu tiga dirham.\""
  },
  {
    "id": 35673,
    "hadith_number": 1495,
    "tajuk_hadith": "Janji Cagaran Tidak Dibatalkan",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Sa'id ibn al-Musayyab",
    "english_text": "Yahya said, \"Malik related to us from Ibn Shihab from Sa'id ibn\nal-Musayyab that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, 'The pledge given as security is not forfeited.' \"\n\n\nMalik said, \"The explanation of that according to what we\nthink - and Allah knows best - is that a man gives a pledge to\nsomebody in security for something. The pledge is superior to that for\nwhich he pawned it. The pledger says to the pawn-broker, 'I will bring\nyou your due, after such-and-such a time. If not, the pledge is yours\nfor what it was pawned for.' \"\n\n\nMalik said, \"This transaction\nis not good and it is not halal. This is what was forbidden. If the\nowner brings what he pledged it for after the period, it is his. I\nthink that the time condition is void.\"",
    "arabic_text": "قَالَ يَحْيَى حَدَّثَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَغْلَقُ الرَّهْنُ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya berkata, \"Malik telah meriwayatkan kepada kami daripada Ibn Shihab, daripada Sa'id ibn al-Musayyab bahawa Rasulullah SAW bersabda, 'Cagaran yang diberikan sebagai jaminan tidak akan dirampas.'\"\n\nMalik berkata, \"Penjelasannya, menurut pendapat kami – dan Allah SWT lebih mengetahui – ialah seseorang memberikan cagaran kepada seseorang sebagai jaminan untuk sesuatu. Cagaran itu lebih bernilai daripada barang yang digadai. Orang yang memberi cagaran berkata kepada orang yang menerima gadai, 'Saya akan memberikan hak anda selepas tempoh tertentu. Jika tidak, cagaran ini menjadi milik anda sebagai bayaran untuk barang yang digadai.'\"\n\nMalik berkata, \"Transaksi ini tidak baik dan tidak halal. Inilah yang telah dilarang. Jika pemilik barang tersebut membawa apa yang telah digadai selepas tempoh tersebut, ia adalah miliknya. Pendapat saya, syarat tempoh itu adalah batal.\" "
  },
  {
    "id": 35674,
    "hadith_number": 1496,
    "tajuk_hadith": "Gadai Tanaman dan Hamba Sahaya",
    "perawi_melayu": "Yahya daripada Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya berkata, \"Saya mendengar Malik berkata bahawa jika seseorang menggadai kebunnya untuk tempoh masa tertentu dan buah-buahan kebun itu telah masak sebelum tamat tempoh tersebut, maka buah-buahan itu tidak termasuk dalam gadai tersebut bersama-sama dengan harta tanah, melainkan jika ia dinyatakan oleh yang menggadai dalam akad gadainya.  Namun, jika seseorang menerima seorang hamba perempuan sebagai gadai dan dia sedang hamil atau hamil selepas dia menerimanya sebagai gadai, maka anaknya termasuk bersama-samanya.\n\nPerbezaan dibuat di antara buah dan anak hamba perempuan. Rasulullah ﷺ bersabda, 'Jika seseorang menjual pohon kurma yang telah disenyawakan, maka buahnya adalah milik penjual melainkan jika pembeli menetapkan penyertaannya.' Amalan yang tidak dipertikaikan dalam masyarakat kita ialah jika seseorang menjual hamba perempuan atau binatang yang mengandung, maka anak dalam kandungan itu adalah milik pembeli, sama ada pembeli menetapkannya atau tidak. Pohon kurma tidak seperti binatang. Buah tidak seperti anak dalam kandungan ibunya. Sebahagian daripada yang menjelaskan perkara ini ialah amalan manusia menggadai buah kurma berasingan daripada pokok kurma. Tiada siapa yang menggadai anak dalam kandungan ibunya sama ada hamba atau binatang.\""
  },
  {
    "id": 35675,
    "hadith_number": 1497,
    "tajuk_hadith": "Tanggungjawab Broker dalam Gadai Janji",
    "perawi_melayu": "Yahya melalui Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan bahawa beliau mendengar Malik berkata, \"Cara yang tidak dipertikaikan dalam masyarakat kita berkaitan dengan gadai janji ialah sekiranya tanah, rumah atau haiwan diketahui telah musnah semasa dalam simpanan broker gadai janji, dan keadaan kehilangan tersebut diketahui, maka kerugian tersebut ditanggung oleh yang menggadai. Tiada potongan dibuat daripada apa yang sepatutnya dibayar kepada broker. Sebarang gadai janji yang rosak dalam simpanan broker dan keadaan kehilangannya hanya diketahui melalui kata-katanya, maka kerugian tersebut ditanggung oleh broker dan dia bertanggungjawab terhadap nilainya. Dia diminta untuk menerangkan apa yang telah musnah dan kemudian dia diminta bersumpah mengenai keterangan tersebut dan apa yang telah dipinjamnya sebagai cagaran. Kemudian, orang yang bijaksana menilai keterangan tersebut. Sekiranya gadai janji itu bernilai lebih daripada apa yang dipinjam oleh broker, yang menggadai akan mengambil lebihannya. Sekiranya nilai gadai janji yang dinilai kurang daripada apa yang dipinjam, yang menggadai diminta bersumpah mengenai jumlah yang dipinjam oleh broker dan dia tidak perlu membayar lebihan yang dipinjam oleh broker melebihi nilai gadai janji yang dinilai. Sekiranya yang menggadai enggan bersumpah, dia perlu memberikan lebihan kepada broker melebihi nilai gadai janji yang dinilai. Sekiranya broker mengatakan bahawa dia tidak tahu nilai gadai janji tersebut, yang menggadai diminta bersumpah mengenai keterangan gadai janji tersebut dan ia menjadi miliknya jika dia membawa perkara yang tidak ditolak.\" \n\nMalik berkata, \"Semua ini terpakai apabila broker mengambil gadai janji dan tidak menyerahkannya kepada orang lain.\""
  },
  {
    "id": 35676,
    "hadith_number": 1498,
    "tajuk_hadith": "Mengenai Janji dan Hamba yang Dijamin",
    "perawi_melayu": "Yahya",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya berkata bahawa beliau mendengar Malik bercakap tentang dua orang lelaki yang mempunyai janji di antara mereka. Seorang daripada mereka bersetuju untuk menjual janjinya, dan yang lain telah memintanya untuk menunggu setahun untuk haknya. Beliau berkata, \"Sekiranya mungkin untuk membahagikan janji itu, dan hak orang yang memintanya untuk menunggu tidak akan dikurangkan, separuh daripada janji yang di antara mereka dijual untuknya dan dia diberi haknya. Sekiranya ditakuti bahawa haknya akan dikurangkan, seluruh janji itu dijual, dan orang yang bersetuju untuk menjual janjinya diberi haknya daripada itu. Sekiranya orang yang memintanya untuk menunggu haknya berpuas hati, separuh daripada harga dibayar kepada penjamin. Sekiranya tidak, penjamin disuruh bersumpah bahawa dia hanya memintanya untuk menunggu supaya dia dapat memindahkan janji saya kepadanya dalam bentuk asalnya.\" Kemudian dia diberi haknya dengan segera.\n\nYahya berkata bahawa beliau mendengar Malik berkata tentang seorang hamba yang tuannya telah menjaminnya dan hamba itu mempunyai harta sendiri, \"Harta hamba itu bukanlah sebahagian daripada jaminan melainkan jika perantara menyatakan demikian.\""
  },
  {
    "id": 35677,
    "hadith_number": 1499,
    "tajuk_hadith": "Hukum Gadai Janji yang Hilang",
    "perawi_melayu": "Yahya",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya berkata bahawa beliau mendengar Malik bercakap tentang seseorang yang menjaminkan barang sebagai cagaran untuk pinjaman, dan barang tersebut telah musnah bersama orang tengah.  Peminjam mengesahkan spesifikasi pinjaman tersebut. Mereka bersetuju dengan jumlah pinjaman, tetapi berselisih faham tentang nilai cagaran, si penjamin mengatakan bahawa nilainya dua puluh dinar, manakala orang tengah mengatakan bahawa nilainya hanya sepuluh dinar, dan jumlah yang dipinjamkan sebagai cagaran adalah dua puluh dinar. Malik berkata, \"Orang yang memegang cagaran itu disuruh, 'terangkanlah ia.' Jika dia menerangkannya, dia diminta bersumpah mengenainya dan kemudian pakar-pakar menilai penerangan itu. Jika nilainya lebih daripada jumlah yang dipinjamkan sebagai cagaran, maka dikatakan kepada orang tengah, 'Kembalikan baki haknya kepada penjamin.' Jika nilainya kurang daripada jumlah yang dipinjamkan sebagai cagaran, orang tengah mengambil baki hutangnya daripada penjamin. Jika nilainya sama dengan jumlah pinjaman, cagaran itu dibayar balik dengan pinjaman.\"\n\n\nYahya berkata bahawa beliau mendengar Malik berkata, \"Apa yang dilakukan dalam masyarakat kita tentang dua orang lelaki yang berselisih faham tentang jumlah wang yang dipinjamkan dengan cagaran - penjamin mendakwa bahawa dia menjaminkan barang tersebut dengan sepuluh dinar dan orang tengah menegaskan bahawa dia mengambil barang tersebut sebagai cagaran untuk dua puluh dinar, dan cagaran itu jelas berada dalam penguasaan orang tengah - ialah orang tengah itu diminta bersumpah apabila nilai cagaran diketahui sepenuhnya. Jika nilai cagaran sama dengan jumlah yang dia bersumpah dipinjamkannya sebagai cagaran, orang tengah mengambil cagaran itu sebagai haknya. Dia lebih berhak untuk didahulukan dengan sumpah kerana dia mempunyai cagaran itu. Jika pemilik cagaran ingin memberikannya jumlah yang dia bersumpah dipinjamkannya, dia boleh mengambil balik cagarannya. Jika cagaran itu bernilai kurang daripada dua puluh dinar yang dipinjamkannya, maka dikatakan kepada penjamin, 'Sama ada anda memberikannya apa yang dia bersumpah dan mengambil balik cagaran anda, atau anda bersumpah tentang apa yang anda katakan anda menjaminkannya.' Jika penjamin bersumpah, maka apa yang orang tengah telah tambahkan melebihi nilai cagaran akan menjadi tidak sah. Jika penjamin tidak bersumpah, dia mesti membayar apa yang orang tengah bersumpah.\"\n\n\nMalik berkata, \"Jika cagaran yang diberikan sebagai cagaran untuk pinjaman musnah, dan kedua-dua pihak menafikan hak masing-masing, dengan orang tengah yang berhutang mengatakan bahawa dia memberikan dua puluh dinar, dan penjamin yang berhutang mengatakan bahawa dia hanya diberi sepuluh, dan dengan orang tengah yang berhutang mengatakan cagaran itu bernilai sepuluh dinar, dan penjamin yang berhutang mengatakan ia bernilai dua puluh, maka orang tengah yang berhutang diminta menerangkan cagaran itu. Jika dia menerangkannya, dia mesti bersumpah mengenai penerangannya. Kemudian pakar-pakar menilai penerangan itu. Jika nilai cagaran dianggarkan lebih daripada apa yang orang tengah dakwa, dia bersumpah tentang apa yang dia dakwa, dan penjamin diberikan lebihan daripada nilai cagaran. Jika nilainya kurang daripada apa yang orang tengah dakwa, dia diminta bersumpah tentang apa yang dia dakwa. Kemudian dia menuntut penyelesaian mengikut nilai sebenar cagaran. Orang yang berhutang kemudian diminta bersumpah tentang jumlah tambahan yang masih terhutang kepadanya kepada peminjam selepas harga cagaran dicapai. Itu kerana orang tengah menjadi peminjam terhadap penjamin. Jika dia bersumpah, baki yang orang tengah bersumpah melebihi nilai cagaran akan dibatalkan. Jika dia menarik balik, dia wajib membayar baki yang terhutang kepada orang tengah selepas nilai cagaran."
  },
  {
    "id": 35678,
    "hadith_number": 1500,
    "tajuk_hadith": "Hukum Sewaan Haiwan dan Pinjaman Wang",
    "perawi_melayu": "Yahya daripada Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya berkata bahawa beliau mendengar Malik berkata, \"Bagaimana amalan dalam masyarakat kita terhadap seseorang yang menyewa haiwan untuk perjalanan ke tempat tertentu, kemudian dia pergi melebihi tempat itu dan lebih jauh? Pemilik haiwan mempunyai pilihan. Jika dia mahu mengambil sewa tambahan untuk haiwannya bagi meliputi jarak yang dilepasi, dia diberi tambahan di atas sewa pertama dan haiwan dikembalikan. Jika pemilik haiwan itu mahu menjual haiwan itu dari tempat dia melepasi had, dia mendapat harga haiwan itu di atas sewa.  Namun, jika penyewa menyewa haiwan untuk pergi dan balik, kemudian dia melepasi had apabila sampai ke bandar yang disewanya, pemilik haiwan hanya mendapat separuh daripada sewa pertama.  Ini kerana separuh daripada sewa adalah untuk pergi, dan separuh lagi untuk balik. Jika dia melepasi had dengan haiwan itu, hanya separuh daripada sewa pertama sahaja yang diwajibkan ke atasnya. Sekiranya haiwan itu mati apabila sampai ke bandar yang disewanya, penyewa tidak bertanggungjawab dan penyewa hanya mendapat separuh sewa.\"\n\n\nMalik berkata,\n\"Itulah amalan terhadap orang yang melepasi had dan bertelagah tentang tujuan mereka menyewa haiwan itu.\"\n\n\nMalik berkata, \"Begitu juga dengan seseorang yang mengambil wang qirad daripada sahabatnya. Pemilik harta berkata kepadanya, 'Jangan beli haiwan sebegini atau barang sebegini.' Dia menyebutnya dan melarangnya dan tidak bersetuju wang itu dilaburkan di dalamnya. Orang yang mengambil wang itu kemudian membeli apa yang dilarangnya. Dengan itu, dia bermaksud bertanggungjawab terhadap wang itu dan mengambil keuntungan sahabatnya. Apabila dia berbuat demikian, pemilik wang mempunyai pilihan. Jika dia mahu berkongsi dalam barang-barang itu mengikut perjanjian asal antara mereka tentang keuntungan, dia boleh berbuat demikian. Jika dia mahu, modalnya dijamin daripada orang yang mengambil modal dan melepasi batas.\"\n\n\nMalik berkata,\n\"Begitu juga dengan seseorang yang melaburkan beberapa barang dengan orang lain. Pemilik harta menyuruhnya membeli barang-barang tertentu yang disebutnya. Dia berlainan pendapat, dan membeli dengan barang-barang itu sesuatu yang berlainan daripada apa yang disuruhnya beli. Dia melanggar arahannya. Pemilik barang mempunyai pilihan. Jika dia mahu mengambil apa yang dibeli dengan hartanya, dia boleh mengambilnya. Jika dia mahu rakan kongsi bertanggungjawab terhadap modalnya, dia berhak demikian.\" "
  },
  {
    "id": 35679,
    "hadith_number": 1501,
    "tajuk_hadith": "Hukum Rogol Menurut Abd al-Malik ibn Marwan",
    "perawi_melayu": "Malik meriwayatkan daripada Ibn Shihab",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، أَنَّ عَبْدَ الْمَلِكِ بْنَ مَرْوَانَ، قَضَى فِي امْرَأَةٍ أُصِيبَتْ مُسْتَكْرَهَةً بِصَدَاقِهَا عَلَى مَنْ فَعَلَ ذَلِكَ بِهَا ‏.‏ قَالَ يَحْيَى سَمِعْتُ مَالِكًا يَقُولُ الأَمْرُ عِنْدَنَا فِي الرَّجُلِ يَغْتَصِبُ الْمَرْأَةَ بِكْرًا كَانَتْ أَوْ ثَيِّبًا إِنَّهَا إِنْ كَانَتْ حُرَّةً فَعَلَيْهِ صَدَاقُ مِثْلِهَا وَإِنْ كَانَتْ أَمَةً فَعَلَيْهِ مَا نَقَصَ مِنْ ثَمَنِهَا وَالْعُقُوبَةُ فِي ذَلِكَ عَلَى الْمُغْتَصِبِ وَلاَ عُقُوبَةَ عَلَى الْمُغْتَصَبَةِ فِي ذَلِكَ كُلِّهِ وَإِنْ كَانَ الْمُغْتَصِبُ عَبْدًا فَذَلِكَ عَلَى سَيِّدِهِ إِلاَّ أَنْ يَشَاءَ أَنْ يُسَلِّمَهُ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Ibn Shihab bahawa Abd al-Malik ibn Marwan telah memutuskan hukum bagi seorang wanita yang dirogol dengan memaksa, iaitu orang yang melakukan perbuatan itu hendaklah membayar mas kahwin wanita tersebut. Yahya berkata bahawa dia mendengar Malik berkata, \"Hukum dalam masyarakat kita bagi lelaki yang merogol wanita, sama ada dara atau tidak dara, jika wanita itu bebas, maka lelaki itu wajib membayar mas kahwin seperti wanita tersebut.  Jika wanita itu hamba, maka dia wajib membayar nilai yang telah susut daripada nilai wanita itu. Hukuman had bagi kes sedemikian dikenakan ke atas perogol, dan tiada hukuman dikenakan ke atas wanita yang dirogol. Jika perogol itu hamba, maka hukuman itu dijatuhkan ke atas tuannya, kecuali jika tuannya ingin menyerahkan hambanya itu.\" "
  },
  {
    "id": 35680,
    "hadith_number": 1502,
    "tajuk_hadith": "Hukum Memakan Haiwan dan Makanan Tanpa Keizinan Pemilik",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan bahawa beliau mendengar Malik berkata, \"Apa yang diamalkan dalam masyarakat kita tentang seseorang yang memakan haiwan tanpa izin pemiliknya ialah dia hendaklah membayar harganya pada hari dia memakannya. Dia tidak diwajibkan menggantikannya dengan haiwan yang serupa, dan dia tidak perlu memberi ganti rugi kepada pemiliknya dengan sebarang jenis haiwan. Dia mesti membayar harganya pada hari ia dimakan, dan memberi nilai adalah lebih adil sebagai pampasan untuk haiwan dan barang.\" \n\nYahya meriwayatkan bahawa beliau mendengar Malik berkata tentang seseorang yang memakan makanan tanpa izin pemiliknya, \"Dia mengembalikan kepada pemiliknya berat yang sama jenis makanan yang sama. Makanan adalah seperti kedudukan emas dan perak. Emas dan perak dikembalikan dengan emas dan perak. Haiwan tidak seperti kedudukan emas dalam hal ini. Apa yang membezakan antara keduanya ialah sunnah dan amalan yang dikuatkuasakan.\" \n\nYahya meriwayatkan bahawa beliau mendengar Malik berkata, \"Jika seseorang diamanahkan dengan harta benda dan kemudian berniaga dengannya untuk dirinya sendiri dan mendapat keuntungan, keuntungan itu adalah miliknya kerana dia bertanggungjawab terhadap harta itu sehingga dia mengembalikannya kepada pemiliknya.\""
  },
  {
    "id": 35681,
    "hadith_number": 1503,
    "tajuk_hadith": "Hukuman Bagi Mereka Yang Murtad",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Zayd ibn Aslam",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ غَيَّرَ دِينَهُ فَاضْرِبُوا عُنُقَهُ ‏\"‏ ‏.‏ وَمَعْنَى قَوْلِ النَّبِيِّ صلى الله عليه وسلم فِيمَا نُرَى - وَاللَّهُ أَعْلَمُ - ‏\"‏ مَنْ غَيَّرَ دِينَهُ فَاضْرِبُوا عُنُقَهُ ‏\"‏ ‏.‏ أَنَّهُ مَنْ خَرَجَ مِنَ الإِسْلاَمِ إِلَى غَيْرِهِ مِثْلُ الزَّنَادِقَةِ وَأَشْبَاهِهِمْ فَإِنَّ أُولَئِكَ إِذَا ظُهِرَ عَلَيْهِمْ قُتِلُوا وَلَمْ يُسْتَتَابُوا لأَنَّهُ لاَ تُعْرَفُ تَوْبَتُهُمْ وَأَنَّهُمْ كَانُوا يُسِرُّونَ الْكُفْرَ وَيُعْلِنُونَ الإِسْلاَمَ فَلاَ أَرَى أَنْ يُسْتَتَابَ هَؤُلاَءِ وَلاَ يُقْبَلُ مِنْهُمْ قَوْلُهُمْ وَأَمَّا مَنْ خَرَجَ مِنَ الإِسْلاَمِ إِلَى غَيْرِهِ وَأَظْهَرَ ذَلِكَ فَإِنَّهُ يُسْتَتَابُ فَإِنْ  تَابَ وَإِلاَّ قُتِلَ وَذَلِكَ لَوْ أَنَّ قَوْمًا كَانُوا عَلَى ذَلِكَ رَأَيْتُ أَنْ يُدْعَوْا إِلَى الإِسْلاَمِ وَيُسْتَتَابُوا فَإِنْ تَابُوا قُبِلَ ذَلِكَ مِنْهُمْ وَإِنْ لَمْ يَتُوبُوا قُتِلُوا وَلَمْ يُعْنَ بِذَلِكَ فِيمَا نُرَى وَاللَّهُ أَعْلَمُ مَنْ خَرَجَ مِنَ الْيَهُودِيَّةِ إِلَى النَّصْرَانِيَّةِ وَلاَ مِنَ النَّصْرَانِيَّةِ إِلَى الْيَهُودِيَّةِ وَلاَ مَنْ يُغَيِّرُ دِينَهُ مِنْ أَهْلِ الأَدْيَانِ كُلِّهَا إِلاَّ الإِسْلاَمَ فَمَنْ خَرَجَ مِنَ الإِسْلاَمِ إِلَى غَيْرِهِ وَأَظْهَرَ ذَلِكَ فَذَلِكَ الَّذِي عُنِيَ بِهِ وَاللَّهُ أَعْلَمُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Zayd ibn Aslam bahawa Rasulullah SAW bersabda: \"Barangsiapa yang menukar agamanya, maka bunuhlah dia.\"  Maksud sabda Nabi SAW, menurut pandangan kami dan Allah SWT lebih mengetahui, ialah sesiapa yang keluar daripada Islam kepada agama lain, seperti golongan zanadiqa dan seumpamanya, maka jika mereka diketahui, mereka dibunuh tanpa diberi peluang bertaubat kerana taubat mereka tidak diterima.  Mereka menyembunyikan kekufuran dan mengisytiharkan keislaman, maka saya tidak berpendapat bahawa mereka perlu diberi peluang bertaubat dan perkataan mereka tidak diterima.  Adapun sesiapa yang keluar daripada Islam kepada agama lain dan mengumumkannya, maka dia diberi peluang bertaubat. Jika bertaubat, maka diterima, jika tidak, maka dibunuh.  Dan sekiranya ada orang yang berada dalam keadaan sedemikian, maka saya berpendapat mereka perlu diajak kepada Islam dan diberi peluang bertaubat.  Jika mereka bertaubat, maka diterima, jika tidak, maka dibunuh.  Dan menurut pandangan kami, dan Allah SWT lebih mengetahui, ia tidak merujuk kepada mereka yang keluar daripada Yahudi kepada Kristian atau daripada Kristian kepada Yahudi, atau sesiapa yang menukar agamanya daripada pelbagai agama kecuali Islam.  Sesungguhnya sesiapa yang keluar daripada Islam kepada agama lain dan mengumumkannya, maka itulah yang dimaksudkan, dan Allah SWT lebih mengetahui."
  },
  {
    "id": 35682,
    "hadith_number": 1504,
    "tajuk_hadith": "Ketegasan Umar ibn al-Khattab terhadap Hukuman",
    "perawi_melayu": "Malik meriwayatkan daripada Abd ar-Rahman ibn Muhammad ibn Abdullah ibn Abd al-Qari daripada bapanya",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدٍ الْقَارِيِّ، عَنْ أَبِيهِ، أَنَّهُ قَالَ قَدِمَ عَلَى عُمَرَ بْنِ الْخَطَّابِ رَجُلٌ مِنْ قِبَلِ أَبِي مُوسَى الأَشْعَرِيِّ فَسَأَلَهُ عَنِ النَّاسِ، فَأَخْبَرَهُ ثُمَّ، قَالَ لَهُ عُمَرُ هَلْ كَانَ فِيكُمْ مِنْ مُغَرِّبَةِ خَبَرٍ فَقَالَ نَعَمْ رَجُلٌ كَفَرَ بَعْدَ إِسْلاَمِهِ ‏.‏ قَالَ فَمَا فَعَلْتُمْ بِهِ قَالَ قَرَّبْنَاهُ فَضَرَبْنَا عُنُقَهُ ‏.‏ فَقَالَ عُمَرُ أَفَلاَ حَبَسْتُمُوهُ ثَلاَثًا وَأَطْعَمْتُمُوهُ كُلَّ يَوْمٍ رَغِيفًا وَاسْتَتَبْتُمُوهُ لَعَلَّهُ يَتُوبُ وَيُرَاجِعُ أَمْرَ اللَّهِ ثُمَّ قَالَ عُمَرُ اللَّهُمَّ إِنِّي لَمْ أَحْضُرْ وَلَمْ آمُرْ وَلَمْ أَرْضَ إِذْ بَلَغَنِي ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Abd ar-Rahman ibn Muhammad ibn Abdullah ibn Abd al-Qari daripada bapanya bahawa seorang lelaki datang kepada Umar ibn al-Khattab daripada pihak Abu Musa al-Ashari.  Umar bertanya khabar tentang pelbagai orang, lalu lelaki itu memberitahunya. Kemudian Umar bertanya, \"Adakah sebarang berita terkini?\" Lelaki itu menjawab, \"Ya. Seorang lelaki telah murtad selepas memeluk Islam.\" Umar bertanya, \"Apakah yang telah kamu lakukan kepadanya?\" Lelaki itu menjawab, \"Kami membawanya menghampiri kami lalu memenggal kepalanya.\" Umar berkata, \"Patutkah kamu tidak menahannya selama tiga hari, memberi makan kepadanya sebuku roti setiap hari dan menyeru taubat kepadanya, agar dia bertaubat dan kembali kepada perintah Allah?\" Kemudian Umar berkata, \"Ya Allah! Sesungguhnya aku tidak hadir, aku tidak memerintahkan dan aku tidak redha apabila aku mendengar berita ini.\""
  },
  {
    "id": 35683,
    "hadith_number": 1505,
    "tajuk_hadith": "Hukum Memberi Tempoh Masa Kepada Penzina",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Suhayl bin Abi Salih As-Samman, dari bapanya, dari Abu Hurairah",
    "english_text": "Yahya related to me from Malik from Suhayl ibn Abi Salih as-\nSamman from his father from Abu Hurayra that Sad ibn Ubada said to the\nMessenger of Allah, may Allah bless him and grant him peace, \"What do\nyou think if I find a man with my wife? Shall I grant him a respite\nuntil I bring four witnesses?\" The Messenger of Allah, may Allah bless\nhim and grant him peace, replied, \"Yes.\"",
    "arabic_text": "حَدَّثَنَا يَحْيَى، عَنْ مَالِكٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ سَعْدَ بْنَ عُبَادَةَ، قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَرَأَيْتَ إِنْ وَجَدْتُ مَعَ امْرَأَتِي رَجُلاً أَأُمْهِلُهُ حَتَّى آتِيَ بِأَرْبَعَةِ شُهَدَاءَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ نَعَمْ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Suhayl bin Abi Salih As-Samman, daripada bapanya, daripada Abu Hurairah bahawa Saad bin Ubadah berkata kepada Rasulullah SAW, \"Bagaimana pendapat tuan jika aku mendapati seorang lelaki bersama isteriku? Patutkah aku memberi tempoh masa kepadanya sehingga aku membawa empat orang saksi?\"  Rasulullah SAW menjawab, \"Ya.\""
  },
  {
    "id": 35684,
    "hadith_number": 1506,
    "tajuk_hadith": "Hukum Qisas: Ketetapan Ali bin Abi Talib",
    "perawi_melayu": "Malik meriwayatkan daripada Yahya bin Said daripada Said bin al-Musayyab",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَجُلاً، مِنْ أَهْلِ الشَّامِ - يُقَالُ لَهُ ابْنُ خَيْبَرِيٍّ - وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً فَقَتَلَهُ أَوْ قَتَلَهُمَا مَعًا فَأَشْكَلَ عَلَى مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ الْقَضَاءُ فِيهِ فَكَتَبَ إِلَى أَبِي مُوسَى الأَشْعَرِيِّ يَسْأَلُ لَهُ عَلِيَّ بْنَ أَبِي طَالِبٍ عَنْ ذَلِكَ فَسَأَلَ أَبُو مُوسَى عَنْ ذَلِكَ عَلِيَّ بْنَ أَبِي طَالِبٍ فَقَالَ لَهُ عَلِيٌّ إِنَّ هَذَا الشَّىْءَ مَا هُوَ بِأَرْضِي عَزَمْتُ عَلَيْكَ لَتُخْبِرَنِّي ‏.‏ فَقَالَ لَهُ أَبُو مُوسَى كَتَبَ إِلَىَّ مُعَاوِيَةُ بْنُ أَبِي سُفْيَانَ أَنْ أَسْأَلَكَ عَنْ ذَلِكَ ‏.‏ فَقَالَ عَلِيٌّ أَنَا أَبُو حَسَنٍ إِنْ لَمْ يَأْتِ بِأَرْبَعَةِ شُهَدَاءَ فَلْيُعْطَ بِرُمَّتِهِ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Yahya bin Said daripada Said bin al-Musayyab bahawa seorang lelaki dari penduduk Syam – yang dikenali sebagai Ibn Khaybari – mendapati seorang lelaki bersama isterinya, lalu membunuhnya atau membunuh mereka berdua.  Muawiyah bin Abi Sufyan mengalami kesukaran dalam membuat keputusan, lalu menulis kepada Abu Musa al-Asy'ari untuk menanyakan kepada Ali bin Abi Talib mengenainya.  Maka Abu Musa bertanya kepada Ali bin Abi Talib, lalu Ali berkata kepadanya, \"Adakah perkara ini berlaku di tanahku? Aku bersumpah kepadamu, engkau mesti memberitahuku.\"  Abu Musa menerangkan kepadanya bagaimana Muawiyah bin Abi Sufyan telah menulis kepadanya untuk bertanya kepada Ali mengenainya.  Ali berkata, \"Aku ialah Abu Hasan. Jika dia tidak membawa empat orang saksi, maka biarlah dia diserahkan sepenuhnya (kepada keluarga mangsa yang dibunuh).\""
  },
  {
    "id": 35685,
    "hadith_number": 1507,
    "tajuk_hadith": "Anak Terbiar di Zaman Umar ibn al-Khattab",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Sunayn Abi Jamila",
    "english_text": "",
    "arabic_text": "قَالَ يَحْيَى قَالَ مَالِكٌ عَنِ ابْنِ شِهَابٍ، عَنْ سُنَيْنٍ أَبِي جَمِيلَةَ، رَجُلٌ مِنْ بَنِي سُلَيْمٍ أَنَّهُ وَجَدَ مَنْبُوذًا فِي زَمَانِ عُمَرَ بْنِ الْخَطَّابِ قَالَ فَجِئْتُ بِهِ إِلَى عُمَرَ بْنِ الْخَطَّابِ فَقَالَ مَا حَمَلَكَ عَلَى أَخْذِ هَذِهِ النَّسَمَةِ فَقَالَ وَجَدْتُهَا ضَائِعَةً فَأَخَذْتُهَا ‏.‏ فَقَالَ لَهُ عَرِيفُهُ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّهُ رَجُلٌ صَالِحٌ ‏.‏ فَقَالَ لَهُ عُمَرُ أَكَذَلِكَ قَالَ نَعَمْ ‏.‏ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ اذْهَبْ فَهُوَ حُرٌّ وَلَكَ وَلاَؤُهُ وَعَلَيْنَا نَفَقَتُهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan bahawa Malik meriwayatkan daripada Ibn Shihab, daripada Sunayn Abi Jamila, seorang lelaki daripada Bani Sulaim bahawa beliau telah menjumpai seorang bayi yang dibuang pada zaman Umar ibn al-Khattab.  Beliau berkata, \"Maka aku membawanya kepada Umar ibn al-Khattab.\"  Lalu Umar bertanya, \"Apakah yang mendorong engkau mengambil bayi ini?\"  Sunayn menjawab, \"Aku menjumpainya dalam keadaan hilang, maka aku mengambilnya.\"  Penasihat Umar berkata kepadanya, \"Wahai Amirul Mukminin, sesungguhnya dia seorang lelaki yang soleh.\"  Umar bertanya kepadanya, \"Benarkah demikian?\"  Sunayn menjawab, \"Ya.\"  Umar ibn al-Khattab berkata, \"Pergilah, dia adalah orang merdeka, dan dia menjadi tanggungjawabmu, dan kami akan menanggung perbelanjaannya.\""
  },
  {
    "id": 35686,
    "hadith_number": 1508,
    "tajuk_hadith": "Anak Milik Keluarga (Di Mana Dia Dilahirkan)",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Urwa ibn az-Zubayr, daripada Aisyah, isteri Nabi SAW",
    "english_text": "",
    "arabic_text": "قَالَ يَحْيَى عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ كَانَ عُتْبَةُ بْنُ أَبِي وَقَّاصٍ عَهِدَ إِلَى أَخِيهِ سَعْدِ بْنِ أَبِي وَقَّاصٍ أَنَّ ابْنَ وَلِيدَةِ زَمْعَةَ مِنِّي فَاقْبِضْهُ إِلَيْكَ ‏.‏ قَالَتْ فَلَمَّا كَانَ عَامُ الْفَتْحِ أَخَذَهُ سَعْدٌ وَقَالَ ابْنُ أَخِي قَدْ كَانَ عَهِدَ إِلَىَّ فِيهِ ‏.‏ فَقَامَ إِلَيْهِ عَبْدُ بْنُ زَمْعَةَ فَقَالَ أَخِي وَابْنُ وَلِيدَةِ أَبِي وُلِدَ عَلَى فِرَاشِهِ ‏.‏ فَتَسَاوَقَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ سَعْدٌ يَا رَسُولَ اللَّهِ ابْنُ أَخِي قَدْ كَانَ عَهِدَ إِلَىَّ فِيهِ ‏.‏ وَقَالَ عَبْدُ بْنُ زَمْعَةَ أَخِي وَابْنُ وَلِيدَةِ أَبِي وُلِدَ عَلَى فِرَاشِهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هُوَ لَكَ يَا عَبْدُ بْنَ زَمْعَةَ ‏\"‏ ‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ ‏\"‏ ‏.‏ ثُمَّ قَالَ لِسَوْدَةَ بِنْتِ زَمْعَةَ ‏\"‏ احْتَجِبِي مِنْهُ ‏\"‏ ‏.‏ لِمَا رَأَى مِنْ شَبَهِهِ بِعُتْبَةَ بْنِ أَبِي وَقَّاصٍ قَالَتْ فَمَا رَآهَا حَتَّى لَقِيَ اللَّهَ عَزَّ وَجَلَّ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Urwa ibn az-Zubayr, daripada Aisyah, isteri Nabi SAW bahawa beliau berkata: Utba bin Abi Waqqas telah berjanji kepada saudaranya, Saad bin Abi Waqqas, bahawa anak perempuan hamba perempuan Zam’ah adalah daripadanya, maka ambillah dia.  Beliau berkata:  Apabila tiba tahun Fathu Makkah, Saad mengambil anak itu dan berkata: “Dia adalah anak saudara lelakiku, dia telah berjanji kepadaku mengenainya.”  Maka berdirilah Abd bin Zam’ah dan berkata: “Dia adalah saudaraku dan anak perempuan hamba perempuan bapaku, dia dilahirkan di atas katil bapaku.”  Maka mereka berdua datang kepada Rasulullah SAW. Saad berkata: “Wahai Rasulullah, dia adalah anak saudara lelakiku, dia telah berjanji kepadaku mengenainya.”  Dan Abd bin Zam’ah berkata: “Dia adalah saudaraku dan anak perempuan hamba perempuan bapaku, dia dilahirkan di atas katil bapaku.”  Maka Rasulullah SAW bersabda: “Dia adalah milikmu, wahai Abd bin Zam’ah.”  Kemudian Rasulullah SAW bersabda: “Anak itu adalah milik keluarga tempat dia dilahirkan, dan bagi pezina adalah hukuman rejam.”  Kemudian baginda bersabda kepada Saudah binti Zam’ah: “Tutup aurat darinya,” kerana baginda melihat persamaan antara anak itu dengan Utba bin Abi Waqqas.  Beliau berkata: “Maka dia tidak pernah melihatnya lagi sehingga dia bertemu Allah SWT.”"
  },
  {
    "id": 35687,
    "hadith_number": 1509,
    "tajuk_hadith": "Hukum Anak yang Dilahirkan Selepas Tempoh Iddah",
    "perawi_melayu": "Malik meriwayatkan daripada Yazid bin Abdullah bin al-Hadi, daripada Muhammad bin Ibrahim bin al-Harith at-Taymi, daripada Sulaiman bin Yasar, daripada Abdullah bin Abi Umayya",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الْهَادِي، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أُمَيَّةَ، أَنَّ امْرَأَةً، هَلَكَ عَنْهَا زَوْجُهَا فَاعْتَدَّتْ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ثُمَّ تَزَوَّجَتْ حِينَ حَلَّتْ فَمَكَثَتْ عِنْدَ زَوْجِهَا أَرْبَعَةَ أَشْهُرٍ وَنِصْفَ شَهْرٍ ثُمَّ وَلَدَتْ وَلَدًا تَامًّا فَجَاءَ زَوْجُهَا إِلَى عُمَرَ بْنِ الْخَطَّابِ فَذَكَرَ ذَلِكَ لَهُ فَدَعَا عُمَرُ نِسْوَةً مِنْ نِسَاءِ الْجَاهِلِيَّةِ قُدَمَاءَ فَسَأَلَهُنَّ عَنْ ذَلِكَ فَقَالَتِ امْرَأَةٌ مِنْهُنَّ أَنَا أُخْبِرُكَ عَنْ هَذِهِ الْمَرْأَةِ هَلَكَ عَنْهَا زَوْجُهَا حِينَ حَمَلَتْ مِنْهُ فَأُهْرِيقَتْ عَلَيْهِ الدِّمَاءُ فَحَشَّ وَلَدُهَا فِي بَطْنِهَا فَلَمَّا أَصَابَهَا زَوْجُهَا الَّذِي نَكَحَهَا وَأَصَابَ الْوَلَدَ الْمَاءُ تَحَرَّكَ الْوَلَدُ فِي بَطْنِهَا وَكَبِرَ ‏.‏ فَصَدَّقَهَا عُمَرُ بْنُ الْخَطَّابِ وَفَرَّقَ بَيْنَهُمَا وَقَالَ عُمَرُ أَمَا إِنَّهُ لَمْ يَبْلُغْنِي عَنْكُمَا إِلاَّ خَيْرٌ وَأَلْحَقَ الْوَلَدَ بِالأَوَّلِ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Yazid bin Abdullah bin al-Hadi, daripada Muhammad bin Ibrahim bin al-Harith at-Taymi, daripada Sulaiman bin Yasar, daripada Abdullah bin Abi Umayya, bahawa seorang wanita, suaminya meninggal dunia. Maka dia beriddah selama empat bulan sepuluh hari. Kemudian dia berkahwin setelah tamat iddah. Dia tinggal bersama suaminya selama empat bulan setengah, kemudian melahirkan anak yang sempurna. Suaminya datang kepada Umar bin al-Khattab dan menceritakan hal itu kepadanya. Maka Umar memanggil beberapa wanita tua daripada zaman jahiliyyah lalu bertanya kepada mereka tentang perkara itu. Seorang wanita di antara mereka berkata, \"Saya akan beritahu awak tentang wanita ini. Suaminya meninggal dunia ketika dia sedang hamil darinya. Lalu darah keluar daripadanya disebabkan kematian suaminya, dan anaknya menjadi kering di dalam rahimnya. Kemudian apabila suami barunya menghampirinya dan air mani mencapai anaknya, anak itu bergerak di dalam rahimnya dan membesar.\" Umar bin al-Khattab mempercayai perkataan wanita itu dan memisahkan mereka berdua. Umar berkata, \"Sesungguhnya aku hanya menerima kebaikan sahaja daripada kamu berdua.\" Dan dia mengaitkan anak itu kepada suami pertamanya."
  },
  {
    "id": 35688,
    "hadith_number": 1510,
    "tajuk_hadith": "Keputusan Umar ibn al-Khattab tentang Anak Luar Nikah",
    "perawi_melayu": "Malik meriwayatkan daripada Yahya ibn Said daripada Sulaiman ibn Yasar",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَانَ يُلِيطُ أَوْلاَدَ الْجَاهِلِيَّةِ بِمَنِ ادَّعَاهُمْ فِي الإِسْلاَمِ فَأَتَى رَجُلاَنِ كِلاَهُمَا يَدَّعِي وَلَدَ امْرَأَةٍ فَدَعَا عُمَرُ بْنُ الْخَطَّابِ قَائِفًا فَنَظَرَ إِلَيْهِمَا فَقَالَ الْقَائِفُ لَقَدِ اشْتَرَكَا فِيهِ فَضَرَبَهُ عُمَرُ بْنُ الْخَطَّابِ بِالدِّرَّةِ ثُمَّ دَعَا الْمَرْأَةَ فَقَالَ أَخْبِرِينِي خَبَرَكِ فَقَالَتْ كَانَ هَذَا - لأَحَدِ الرَّجُلَيْنِ - يَأْتِينِي ‏.‏ وَهِيَ فِي إِبِلٍ لأَهْلِهَا فَلاَ يُفَارِقُهَا حَتَّى يَظُنَّ وَتَظُنَّ أَنَّهُ قَدِ اسْتَمَرَّ بِهَا حَبَلٌ ثُمَّ انْصَرَفَ عَنْهَا فَأُهْرِيقَتْ عَلَيْهِ دِمَاءٌ ثُمَّ خَلَفَ عَلَيْهَا هَذَا - تَعْنِي الآخَرَ - فَلاَ أَدْرِي مِنْ أَيِّهِمَا هُوَ قَالَ فَكَبَّرَ الْقَائِفُ فَقَالَ عُمَرُ لِلْغُلاَمِ وَالِ أَيَّهُمَا شِئْتَ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Yahya ibn Said daripada Sulaiman ibn Yasar bahawa Umar ibn al-Khattab, biasa memutuskan pertalian anak-anak daripada zaman Jahiliyyah kepada sesiapa yang mengakuinya dalam Islam.  Maka datanglah dua orang lelaki, masing-masing mengaku anak seorang perempuan. Umar ibn al- Khattab memanggil seorang pakar mengenal ciri-ciri wajah lalu memeriksanya. Pakar tersebut berkata, \"Mereka berdua berkongsi ciri-ciri dengannya.\" Umar ibn al-Khattab memukulnya dengan cambuk. Kemudian beliau memanggil perempuan itu dan berkata, \"Ceritakanlah kisahmu.\"  Jawabnya, \"Lelaki ini (menunjuk salah seorang lelaki) biasa datang kepadaku ketika aku bersama unta kaumku. Dia tidak meninggalkanku sehingga kami berdua menyangka aku telah hamil. Kemudian dia meninggalkanku, dan darah keluar dariku, dan lelaki ini (menunjuk lelaki yang lain) menggantikannya. Aku tidak tahu daripada siapa anak ini.\" Pakar itu berkata, \"Allah Maha Besar.\" Umar berkata kepada kanak-kanak lelaki itu, \"Pergilah kepada sesiapa sahaja yang engkau kehendaki.\""
  },
  {
    "id": 35689,
    "hadith_number": 1511,
    "tajuk_hadith": "Hukum Wanita Hamba Yang Menipu Suami",
    "perawi_melayu": "Malik",
    "english_text": "Malik related to me that he had heard that Umar ibn al-Khattab or\nUthman ibn Affan gave a judgement about a slave woman who misled a man\nabout herself and said that she was free. He married her and she bore\nchildren. It was decided that he should ransom his children with their\nlike of slaves.\n\n\nYahya said that he heard Malik say, \"To\nransom them with their price is more equitable in this case, Allah\nwilling.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، أَوْ عُثْمَانَ بْنَ عَفَّانَ قَضَى أَحَدُهُمَا فِي امْرَأَةٍ غَرَّتْ رَجُلاً بِنَفْسِهَا وَذَكَرَتْ أَنَّهَا حُرَّةٌ فَتَزَوَّجَهَا فَوَلَدَتْ لَهُ أَوْلاَدًا فَقَضَى أَنْ يَفْدِيَ وَلَدَهُ بِمِثْلِهِمْ ‏.‏ قَالَ يَحْيَى سَمِعْتُ مَالِكًا يَقُولُ وَالْقِيمَةُ أَعْدَلُ فِي هَذَا إِنْ شَاءَ اللَّهُ ‏.‏",
    "malay_translation": "Malik telah menceritakan kepadaku bahawa baginda telah mendengar bahawa Umar ibn al-Khattab atau Uthman ibn Affan telah memberi keputusan mengenai seorang wanita hamba yang telah menipu seorang lelaki tentang dirinya dan mengatakan bahawa dia seorang yang merdeka. Lelaki itu telah mengahwininya dan dia telah melahirkan anak-anak.  Telah diputuskan bahawa dia hendak menebus anak-anaknya dengan hamba yang serupa.\n\nYahya berkata bahawa dia mendengar Malik berkata, \"Untuk menebus mereka dengan harga mereka adalah lebih adil dalam hal ini, jika Allah menghendaki.\""
  },
  {
    "id": 35690,
    "hadith_number": 1512,
    "tajuk_hadith": "Pengakuan Anak dan Hutang Pusaka",
    "perawi_melayu": "Yahya daripada Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya berkata bahawa baginda mendengar Malik berkata, \"Cara yang lazim dilakukan dalam masyarakat kita sekiranya seorang lelaki meninggal dunia dan mempunyai anak-anak, dan salah seorang daripada mereka mendakwa, 'Bapa saya mengesahkan bahawa si polan adalah anaknya,' maka hubungan kekeluargaan itu tidak dapat dipastikan hanya dengan keterangan seorang lelaki sahaja, dan pengesahan daripada orang yang mengesahkannya itu hanya dibenarkan berkaitan dengan bahagiannya sendiri dalam pembahagian harta pusaka bapanya.  Orang yang disahkan sebagai anaknya itu hanya diberi haknya daripada bahagian si pengesah.\"\n\nMalik berkata, \"Contohnya ialah seorang lelaki meninggal dunia dan meninggalkan dua orang anak lelaki dan 600 dinar. Setiap seorang daripada mereka mengambil 300 dinar. Kemudian salah seorang daripada mereka memberi keterangan bahawa bapanya yang telah meninggal dunia mengesahkan bahawa si polan adalah anaknya.  Orang yang memberi keterangan itu wajib memberi 100 dinar kepada orang yang dihubungkan itu. Ini adalah separuh daripada harta pusaka orang yang dianggap sebagai saudara, sekiranya dia benar-benar saudara. Jika yang lain mengesahkannya, dia mengambil 100 dinar lagi dan dengan itu haknya lengkap dan hubungan kekeluargaannya disahkan. Kedudukannya sama seperti seorang wanita yang mengesahkan hutang terhadap bapanya atau suaminya dan pewaris lain menafikannya. Dia mesti membayar kepada orang yang hutangnya disahkan itu, jumlahnya mengikut bahagiannya daripada jumlah hutang sepenuhnya, sekiranya ia disahkan terhadap semua pewaris. Jika wanita itu mewarisi satu per lapan, dia membayar pemiutang satu per lapan daripada hutangnya. Jika seorang anak perempuan mewarisi separuh, dia membayar pemiutang separuh daripada hutangnya. Wanita mana pun yang mengesahkannya, membayarnya mengikut cara ini.\"\n\nMalik berkata, \"Jika keterangan seorang lelaki adalah selaras dengan keterangan wanita itu, bahawa si polan mempunyai hutang terhadap bapanya, pemiutang itu diwajibkan bersumpah dengan seorang saksi dan dia diberi semua haknya. Ini tidak sama dengan wanita kerana keterangan lelaki dibenarkan dan pemiutang mesti bersumpah dengan keterangan saksi dan mengambil semua haknya. Jika dia tidak bersumpah, dia hanya mengambil daripada harta pusaka orang yang mengesahkannya mengikut bahagian hutangnya, kerana dia mengesahkan haknya dan pewaris lain menafikannya.  Dia dibenarkan untuk mengesahkannya.\""
  },
  {
    "id": 35691,
    "hadith_number": 1513,
    "tajuk_hadith": "Hukum Perhubungan Dengan Gadis Hamba dan Anak Hasilnya",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Ibn Shihab, daripada Salim bin Abdullah bin Umar, daripada bapanya,",
    "english_text": "Yahya said that Malik related from Ibn Shihab from Salim ibn\nAbdullah ibn Umar from his father that Umar ibn al-Khattab said,\n\"What's the matter with men who have intercourse with their slave-\ngirls and then dismiss them? No slave-girl comes to me whose master\nconfesses that he has had intercourse with her but that I connect her\nchild to him, whether or not he has practised coitus interruptus or\nstopped having intercourse with her.\"",
    "arabic_text": "قَالَ يَحْيَى قَالَ مَالِكٌ عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ مَا بَالُ رِجَالٍ يَطَئُونَ وَلاَئِدَهُمْ ثُمَّ يَعْزِلُوهُنَّ لاَ تَأْتِينِي وَلِيدَةٌ يَعْتَرِفُ سَيِّدُهَا أَنْ قَدْ أَلَمَّ بِهَا إِلاَّ أَلْحَقْتُ بِهِ وَلَدَهَا فَاعْزِلُوا بَعْدُ أَوِ اتْرُكُوا ‏.‏",
    "malay_translation": "Yahya meriwayatkan bahawa Malik telah meriwayatkan daripada Ibn Shihab, daripada Salim bin Abdullah bin Umar, daripada bapanya, bahawa Umar bin al-Khattab berkata, \"Apakah halnya dengan lelaki-lelaki yang melakukan hubungan seksual dengan hamba perempuan mereka, kemudian menceraikan mereka? Tiada seorang pun hamba perempuan yang datang kepadaku yang tuannya mengaku telah melakukan hubungan seksual dengannya melainkan aku akan mengaitkan anaknya kepadanya, sama ada dia telah melakukan azl (kawalan kelahiran) atau tidak.\" "
  },
  {
    "id": 35692,
    "hadith_number": 1514,
    "tajuk_hadith": "Hukum Perhubungan Antara Tuan dan Hambanya serta Tanggungjawab Tuan terhadap Hamba Wanita yang Berbuat Salah",
    "perawi_melayu": "Malik daripada Nafi' daripada Safiyyah binti Abi Ubayd",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ، أَنَّهَا أَخْبَرَتْهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ قَالَ مَا بَالُ رِجَالٍ يَطَئُونَ وَلاَئِدَهُمْ ثُمَّ يَدَعُوهُنَّ يَخْرُجْنَ لاَ تَأْتِينِي وَلِيدَةٌ يَعْتَرِفُ سَيِّدُهَا أَنْ قَدْ أَلَمَّ بِهَا إِلاَّ قَدْ أَلْحَقْتُ بِهِ وَلَدَهَا فَأَرْسِلُوهُنَّ بَعْدُ أَوْ أَمْسِكُوهُنَّ ‏.‏ قَالَ يَحْيَى سَمِعْتُ مَالِكًا يَقُولُ الأَمْرُ عِنْدَنَا فِي أُمِّ الْوَلَدِ إِذَا جَنَتْ جِنَايَةً ضَمِنَ سَيِّدُهَا مَا بَيْنَهَا وَبَيْنَ قِيمَتِهَا وَلَيْسَ لَهُ أَنْ يُسَلِّمَهَا وَلَيْسَ عَلَيْهِ أَنْ يَحْمِلَ مِنْ جِنَايَتِهَا أَكْثَرَ مِنْ قِيمَتِهَا ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Nafi', daripada Safiyyah binti Abi Ubayd bahawa dia memberitahu bahawa Umar bin al-Khattab berkata, \"Apakah keadaan lelaki yang melakukan hubungan seks dengan hamba perempuan mereka, kemudian membiarkan mereka pergi? Tiada hamba perempuan yang datang kepadaku yang tuannya mengaku telah melakukan hubungan seks dengannya melainkan aku mengaitkan anaknya kepadanya, sama ada dia telah melakukan azl (coitus interruptus) atau tidak.\" Yahya berkata bahawa dia mendengar Malik berkata, \"Perkara yang berlaku dalam masyarakat kita mengenai seorang Ummul Walad (hamba perempuan yang melahirkan anak daripada tuannya) jika dia melakukan jenayah, maka tuannya bertanggungjawab terhadap apa yang telah dilakukannya sehingga nilai dirinya. Tuannya tidak perlu menyerahkannya, dan dia tidak perlu menanggung lebih daripada nilai dirinya untuk jenayah yang dilakukannya.\""
  },
  {
    "id": 35693,
    "hadith_number": 1515,
    "tajuk_hadith": "Hak Memiliki Tanah Yang Dihidupkan",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Hisyam bin Urwah daripada bapanya",
    "english_text": "Yahya related from Malik from Hisham ibn Urwa from his father\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"If anyone revives dead land, it belongs to him, and the unjust\nroot has no right.\"\n\n\nMalik explained, \"The unjust root is\nwhatever is taken, or planted without right.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله  عليه وسلم قَالَ ‏\n\"‏ مَنْ أَحْيَا أَرْضًا مَيِّتَةً فَهِيَ لَهُ وَلَيْسَ لِعِرْقٍ ظَالِمٍ حَقٌّ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Hisyam bin Urwah daripada bapanya bahawa Rasulullah SAW bersabda: \"Barangsiapa menghidupkan tanah yang mati, maka tanah itu menjadi miliknya, dan tidak ada hak bagi akar yang zalim.\" \n\nMalik menjelaskan: \"Akar yang zalim ialah apa sahaja yang diambil atau ditanam tanpa hak.\""
  },
  {
    "id": 35694,
    "hadith_number": 1516,
    "tajuk_hadith": "Hak Memiliki Tanah Yang Dihidupkan",
    "perawi_melayu": "Malik meriwayatkan daripada Ibn Shihab, daripada Salim bin Abdullah, daripada bapanya",
    "english_text": "Malik related to me from Ibn Shihab from Salim ibn Abdullah from\nhis father that Umar ibn al-Khattab said, \"Whoever revives dead land,\nit belongs to him.\"\n\n\nMalik said, \"That is what is done in our\ncommunity.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ مَنْ أَحْيَا أَرْضًا مَيِّتَةً فَهِيَ لَهُ ‏.‏ قَالَ مَالِكٌ وَعَلَى ذَلِكَ الأَمْرُ عِنْدَنَا ‏.‏",
    "malay_translation": "Malik meriwayatkan kepadaku daripada Ibn Shihab, daripada Salim bin Abdullah, daripada bapanya, bahawa Umar bin al-Khattab berkata, \"Barangsiapa menghidupkan tanah yang mati, maka tanah itu menjadi miliknya.\"  Malik berkata, \"Demikianlah amalan yang dilakukan dalam masyarakat kita.\""
  },
  {
    "id": 35695,
    "hadith_number": 1517,
    "tajuk_hadith": "Panduan Mengurus Saliran Air di Madinah",
    "perawi_melayu": "Yahya daripada Malik daripada Abdullah ibn Abi Bakr ibn Muhammad ibn Amr ibn Hazm",
    "english_text": "Yahya related to me from Malik from Abdullah ibn Abi Bakr ibn\nMuhammad ibn Amr ibn Hazm that he heard that the Messenger of Allah,\nmay Allah bless him and grant him peace, said about the flood-channels\nof Mahzur and Mudhaynib (in Madinah), \"Dam them systematically, so that\nthe water is diverted into each property in turn up to ankle level,\nstarting upstream.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ فِي سَيْلِ مَهْزُورٍ وَمُذَيْنِبٍ ‏\n\"‏ يُمْسَكُ حَتَّى الْكَعْبَيْنِ ثُمَّ يُرْسِلُ الأَعْلَى عَلَى الأَسْفَلِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Abdullah bin Abi Bakar bin Muhammad bin Amr bin Hazm, bahawa baginda telah mendengar bahawa Rasulullah SAW telah bersabda mengenai saluran air bah Mahzur dan Mudhainib (di Madinah):  \"Bendunglah ia secara sistematik, supaya air disalurkan ke setiap harta benda secara bergilir-gilir sehingga paras buku lali, bermula dari hulu.\""
  },
  {
    "id": 35696,
    "hadith_number": 1518,
    "tajuk_hadith": "Larangan Menahan Air Lebihan",
    "perawi_melayu": "Malik meriwayatkan daripada Abu az-Zinad daripada al-Araj daripada Abu Hurairah",
    "english_text": "Malik related to me from Abu'z-Zinad from al-Araj from Abu\nHurayra that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Excess water is not withheld in order to prevent herbage\nfrom growing.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يُمْنَعُ فَضْلُ الْمَاءِ لِيُمْنَعَ بِهِ الْكَلأُ ‏\"‏ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Abu az-Zinad daripada al-Araj daripada Abu Hurairah bahawa Rasulullah SAW bersabda:  \"Air yang berlebihan tidak boleh ditahan untuk menghalang tumbuhan daripada tumbuh.\""
  },
  {
    "id": 35697,
    "hadith_number": 1519,
    "tajuk_hadith": "Larangan Menahan Air Perigi",
    "perawi_melayu": "Malik meriwayatkan daripada Abu r-Rijal, Muhammad bin Abd ar-Rahman daripada ibunya, Amra binti Abd ar-Rahman bahawa beliau memberitahu bahawa Rasulullah SAW bersabda:",
    "english_text": "Malik related to me from Abu'r-Rijal Muhammad ibn Abd ar-Rahman\nfrom his mother Amra bint Abd ar-Rahman that she informed him that the\nMessenger of Allah, may Allah bless him and grant him peace, said, \"Do\nnot withhold the surplus water of a well from people.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ أَبِي الرِّجَالِ، مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أُمِّهِ، عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ أَنَّهَا أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يُمْنَعُ نَقْعُ بِئْرٍ ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah menghalang air berlebihan daripada telaga daripada orang ramai."
  },
  {
    "id": 35698,
    "hadith_number": 1520,
    "tajuk_hadith": "Tiada Kemudaratan dan Pembalasan Kemudaratan",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Amr ibn Yahya al-Mazini, daripada bapanya",
    "english_text": "Yahya related to me from Malik from Amr ibn Yahya al-Mazini from\nhis father that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"There is no injury nor return of injury.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ ضَرَرَ وَلاَ ضِرَارَ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Amr ibn Yahya al-Mazini, dari bapanya bahawa Rasulullah SAW bersabda:  \"Tiada kemudaratan dan tiada pembalasan kemudaratan.\""
  },
  {
    "id": 35699,
    "hadith_number": 1521,
    "tajuk_hadith": "Mencegah Jiran Menancapkan Pasak Kayu",
    "perawi_melayu": "Malik meriwayatkan daripada Ibn Shihab daripada al-Araj daripada Abu Hurairah",
    "english_text": "Malik related to me from Ibn Shihab from al-Araj from Abu Hurayra\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"No one should prevent his neighbour from fixing a wooden peg in\nhis wall.\" Then Abu Hurayra said, \"Why do I see you turning away from\nit? By Allah! I shall keep on at you about it.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَمْنَعُ أَحَدُكُمْ جَارَهُ خَشَبَةً يَغْرِزُهَا فى جِدَارِهِ ‏\"‏ ‏.‏ ثُمَّ يَقُولُ أَبُو هُرَيْرَةَ مَا لِي أَرَاكُمْ عَنْهَا مُعْرِضِينَ وَاللَّهِ لأَرْمِيَنَّ بِهَا بَيْنَ أَكْتَافِكُمْ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Ibn Shihab daripada al-Araj daripada Abu Hurairah bahawa Rasulullah SAW bersabda:  \"Tiada seorang pun daripada kamu harus menghalang jirannya daripada menancapkan sebatang kayu di dinding rumahnya.\" Kemudian Abu Hurairah berkata: \"Mengapa aku lihat kamu semua berpaling darinya? Demi Allah! Aku akan terus menegur kamu tentang perkara ini.\""
  },
  {
    "id": 35700,
    "hadith_number": 1522,
    "tajuk_hadith": "Umar ibn al-Khattab dan Saliran Air",
    "perawi_melayu": "Malik meriwayatkan daripada Amr ibn Yahya al-Mazini daripada bapanya",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ، عَنْ أَبِيهِ، أَنَّ الضَّحَّاكَ بْنَ خَلِيفَةَ، سَاقَ خَلِيجًا لَهُ مِنَ الْعُرَيْضِ فَأَرَادَ أَنْ يَمُرَّ بِهِ فِي أَرْضِ مُحَمَّدِ بْنِ مَسْلَمَةَ فَأَبَى مُحَمَّدٌ ‏.‏ فَقَالَ لَهُ الضَّحَّاكُ لِمَ تَمْنَعُنِي وَهُوَ لَكَ مَنْفَعَةٌ تَشْرَبُ بِهِ أَوَّلاً وَآخِرًا وَلاَ يَضُرُّكَ ‏.‏ فَأَبَى مُحَمَّدٌ فَكَلَّمَ فِيهِ الضَّحَّاكُ عُمَرَ بْنَ الْخَطَّابِ فَدَعَا عُمَرُ بْنُ الْخَطَّابِ مُحَمَّدَ بْنَ مَسْلَمَةَ فَأَمَرَهُ أَنْ يُخَلِّيَ سَبِيلَهُ فَقَالَ مُحَمَّدٌ لاَ ‏.‏ فَقَالَ عُمَرُ لِمَ تَمْنَعُ أَخَاكَ مَا يَنْفَعُهُ وَهُوَ لَكَ نَافِعٌ تَسْقِي بِهِ أَوَّلاً وَآخِرًا وَهُوَ لاَ يَضُرُّكَ ‏.‏ فَقَالَ مُحَمَّدٌ لاَ وَاللَّهِ ‏.‏ فَقَالَ عُمَرُ وَاللَّهِ لَيَمُرَّنَّ بِهِ وَلَوْ عَلَى بَطْنِكَ ‏.‏ فَأَمَرَهُ عُمَرُ أَنْ يَمُرَّ بِهِ فَفَعَلَ الضَّحَّاكُ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Amr ibn Yahya al-Mazini daripada bapanya bahawa ad-Dahhak ibn Khalifa membina terusan pengairan daripada sumber air yang besar. Dia ingin meneruskannya melalui tanah milik Muhammad ibn Maslama, tetapi Muhammad menolak. Ad-Dahhak berkata kepadanya, \"Mengapa engkau menghalangku? Ia memberi manfaat kepadamu. Engkau boleh menggunakan airnya terlebih dahulu dan kemudian, dan ia tidak akan merugikanmu.\" Muhammad tetap menolak. Maka ad-Dahhak mengadu kepada Umar ibn al-Khattab. Umar ibn al-Khattab memanggil Muhammad ibn Maslama dan menyuruhnya memberi laluan. Muhammad berkata, \"Tidak.\" Umar berkata, \"Mengapa engkau menghalang saudaramu daripada sesuatu yang memberi manfaat kepadanya dan juga kepadamu? Engkau akan menggunakan airnya terlebih dahulu dan kemudian, dan ia tidak akan merugikanmu.\" Muhammad berkata, \"Tidak, demi Allah!\" Umar berkata, \"Demi Allah, ia akan tetap diteruskan, walaupun ia melalui perutmu!\" Umar memerintahkannya untuk memberi laluan, dan ad-Dahhak melakukannya."
  },
  {
    "id": 35701,
    "hadith_number": 1523,
    "tajuk_hadith": "Keputusan Umar ibn al-Khattab tentang Pemindahan Saliran",
    "perawi_melayu": "Malik, Amr ibn Yahya al-Mazini, dan bapanya",
    "english_text": "Malik related to me from Amr ibn Yahya al-Mazini that his father\nsaid, \"There was a stream in my grand-father's garden belonging to Abd\nar-Rahman ibn Awf Abd ar-Rahman ibn Awf wanted to transfer it to a\ncorner of the garden nearer to his land, and the owner of the garden\nprevented him. Abd ar-Rahman ibn Awf spoke to Umar ibn al-Khattab\nabout it, and he gave a judgement to Abd ar-Rahman ibn Awf that he\nshould transfer it.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ، عَنْ أَبِيهِ، أَنَّهُ قَالَ كَانَ فِي حَائِطِ جَدِّهِ رَبِيعٌ لِعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ فَأَرَادَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ أَنْ يُحَوِّلَهُ إِلَى نَاحِيَةٍ مِنَ الْحَائِطِ هِيَ أَقْرَبُ إِلَى أَرْضِهِ فَمَنَعَهُ صَاحِبُ الْحَائِطِ فَكَلَّمَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ عُمَرَ بْنَ الْخَطَّابِ فِي ذَلِكَ فَقَضَى لِعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ بِتَحْوِيلِهِ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Amr ibn Yahya al-Mazini bahawa bapanya berkata, \"Terdapat sebuah aliran air di kebun datukku yang kepunyaan Abd ar-Rahman ibn Awf. Abd ar-Rahman ibn Awf ingin memindahkannya ke satu sudut kebun yang lebih hampir ke tanahnya, tetapi pemilik kebun melarangnya. Abd ar-Rahman ibn Awf bercakap dengan Umar ibn al-Khattab mengenainya, dan beliau memberi keputusan kepada Abd ar-Rahman ibn Awf supaya memindahkannya.\""
  },
  {
    "id": 35702,
    "hadith_number": 1524,
    "tajuk_hadith": "Pembahagian Harta Tanah Sebelum dan Selepas Islam",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Thawr ibn Zayd ad-Dili",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ، أَنَّهُ قَالَ بَلَغَنِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَيُّمَا دَارٍ أَوْ أَرْضٍ قُسِمَتْ فِي الْجَاهِلِيَّةِ فَهِيَ عَلَى قَسْمِ الْجَاهِلِيَّةِ وَأَيُّمَا دَارٍ أَوْ أَرْضٍ أَدْرَكَهَا الإِسْلاَمُ وَلَمْ تُقْسَمْ فَهِيَ عَلَى قَسْمِ الإِسْلاَمِ ‏\"‏ ‏.‏ قَالَ يَحْيَى سَمِعْتُ مَالِكًا يَقُولُ فِيمَنْ هَلَكَ وَتَرَكَ أَمْوَالاً بِالْعَالِيَةِ وَالسَّافِلَةِ إِنَّ الْبَعْلَ لاَ يُقْسَمُ مَعَ النَّضْحِ إِلاَّ أَنْ يَرْضَى أَهْلُهُ بِذَلِكَ وَإِنَّ الْبَعْلَ يُقْسَمُ مَعَ الْعَيْنِ إِذَا كَانَ يُشْبِهُهَا وَأَنَّ الأَمْوَالَ إِذَا كَانَتْ بِأَرْضٍ وَاحِدَةٍ الَّذِي بَيْنَهُمَا مُتَقَارِبٌ أَنَّهُ يُقَامُ كُلُّ مَالٍ مِنْهَا ثُمَّ يُقْسَمُ بَيْنَهُمْ وَالْمَسَاكِنُ وَالدُّورُ بِهَذِهِ الْمَنْزِلَةِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Thawr bin Zayd ad-Dili, bahawa beliau berkata: Telah sampai kepadaku bahawa Rasulullah SAW bersabda: \"Rumah atau tanah yang telah dibahagikan pada zaman Jahiliyyah, maka ia mengikut pembahagian Jahiliyyah.  Dan rumah atau tanah yang telah dicapai oleh Islam dan belum dibahagikan, maka ia mengikut pembahagian Islam.\" Yahya berkata: Aku mendengar Malik berkata tentang orang yang mati dan meninggalkan harta di tanah tinggi dan rendah:  Tanah kering tidak dibahagikan bersama tanah lembap kecuali jika ahli warisnya bersetuju.  Dan tanah kering dibahagikan bersama mata air jika ia menyerupainya.  Dan harta benda, jika ia berada di satu kawasan tanah yang berdekatan antara satu sama lain, maka setiap harta dianggarkan nilainya, kemudian dibahagikan di antara mereka.  Rumah dan bangunan juga mengikut kaedah yang sama."
  },
  {
    "id": 35703,
    "hadith_number": 1525,
    "tajuk_hadith": "Pembahagian Harta Tanah Pusaka",
    "perawi_melayu": "Yahya (dari Malik)",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya berkata bahawa beliau mendengar Malik bercakap tentang seorang lelaki yang meninggal dunia dan meninggalkan harta tanah di Aliya dan Safila (daerah pinggir Madinah).  Beliau berkata, \"Tanah yang tidak diairi secara semula jadi tidak sama kategori dengan tanah yang diairi kecuali jika keluarga berpuas hati dengannya. Tanah yang tidak diairi hanya sama kategori dengan tanah yang mempunyai mata air apabila ia menyerupainya. Apabila harta tanah berada di satu kawasan, dan berdekatan antara satu sama lain, setiap harta tanah dinilai dan kemudian dibahagikan di antara waris.  Rumah kediaman dan bangunan berada dalam kedudukan yang sama.\""
  },
  {
    "id": 35704,
    "hadith_number": 1526,
    "tajuk_hadith": "Tanggungjawab Penjagaan dan Kerusakan Haiwan pada Siang dan Malam",
    "perawi_melayu": "Yahya meriwayatkan dari Malik dari Ibnu Syihab dari Haram bin Saad bin Muhayysah",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Haram ibn Sad ibn Muhayyisa that a female camel of al-Bara ibn Azib entered the garden of a man and it did some damage to it. The Messenger of Allah, may Allah bless him and grant him peace, gave a judgement that the people of the garden were responsible for guarding it in the day, and the owner of the animals was liable for what the animals destroyed at night.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حَرَامِ بْنِ سَعْدِ بْنِ مُحَيِّصَةَ، أَنَّ نَاقَةً، لِلْبَرَاءِ بْنِ عَازِبٍ دَخَلَتْ حَائِطَ رَجُلٍ فَأَفْسَدَتْ فِيهِ فَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنَّ عَلَى أَهْلِ الْحَوَائِطِ حِفْظَهَا بِالنَّهَارِ وَأَنَّ مَا أَفْسَدَتِ الْمَوَاشِي بِاللَّيْلِ ضَامِنٌ عَلَى أَهْلِهَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Ibnu Syihab, daripada Haram bin Saad bin Muhayysah bahawa seekor unta betina milik Al-Bara’ bin Azib telah memasuki kebun seseorang lelaki lalu merosakkannya.  Rasulullah SAW telah memutuskan bahawa penduduk kebun tersebut bertanggungjawab untuk menjaganya pada siang hari, dan pemilik haiwan itu bertanggungjawab terhadap kerosakan yang dilakukan oleh haiwannya pada waktu malam."
  },
  {
    "id": 35705,
    "hadith_number": 1527,
    "tajuk_hadith": "Hukuman Mencuri dan Ganti Rugi Unta",
    "perawi_melayu": "Malik meriwayatkan daripada Hisyam bin Urwah daripada bapanya, daripada Yahya bin Abdur Rahman bin Hatib",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ يَحْيَى بْنِ عَبْدِ الرَّحْمَنِ بْنِ حَاطِبٍ، أَنَّ رَقِيقًا، لِحَاطِبٍ سَرَقُوا نَاقَةً لِرَجُلٍ مِنْ مُزَيْنَةَ فَانْتَحَرُوهَا فَرُفِعَ ذَلِكَ إِلَى عُمَرَ بْنِ الْخَطَّابِ فَأَمَرَ عُمَرُ كَثِيرَ بْنَ الصَّلْتِ أَنْ يَقْطَعَ أَيْدِيَهُمْ ثُمَّ قَالَ عُمَرُ أَرَاكَ تُجِيعُهُمْ ‏.‏ ثُمَّ قَالَ عُمَرُ وَاللَّهِ لأُغَرِّمَنَّكَ غُرْمًا يَشُقُّ عَلَيْكَ ثُمَّ قَالَ لِلْمُزَنِيِّ كَمْ ثَمَنُ نَاقَتِكَ فَقَالَ الْمُزَنِيُّ قَدْ كُنْتُ وَاللَّهِ أَمْنَعُهَا مِنْ أَرْبَعِمِائَةِ دِرْهَمٍ ‏.‏ فَقَالَ عُمَرُ أَعْطِهِ ثَمَانَمِائَةِ دِرْهَمٍ ‏.‏ قَالَ يَحْيَى سَمِعْتُ مَالِكًا يَقُولُ وَلَيْسَ عَلَى هَذَا الْعَمَلُ عِنْدَنَا فِي تَضْعِيفِ الْقِيمَةِ وَلَكِنْ مَضَى أَمْرُ النَّاسِ عِنْدَنَا عَلَى أَنَّهُ إِنَّمَا يَغْرَمُ الرَّجُلُ قِيمَةَ الْبَعِيرِ أَوِ الدَّابَّةِ يَوْمَ يَأْخُذُهَا ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Hisyam bin Urwah daripada bapanya, daripada Yahya bin Abdur Rahman bin Hatib, bahawa beberapa orang hamba milik Hatib mencuri seekor unta betina milik seorang lelaki dari kabilah Muzaynah lalu menyembelihnya.  Perkara ini dibawa kepada Umar bin al-Khattab, lalu Umar memerintahkan Kathir bin as-Salt untuk memotong tangan mereka. Kemudian Umar berkata kepada Habib, \"Aku nampak engkau telah  menjejas mereka.\" Kemudian Umar berkata, \"Demi Allah! Aku akan mengenakan denda yang berat kepadamu.\" Kemudian Umar bertanya kepada lelaki dari Muzaynah itu, \"Berapakah harga untamu?\" Lelaki Muzaynah itu berkata, \"Demi Allah, aku enggan menjualnya walaupun dengan 400 dirham.\" Umar berkata, \"Berikan kepadanya 800 dirham.\" Yahya berkata bahawa dia mendengar Malik berkata, \"Menggandakan harga bukanlah amalan masyarakat kita.  Namun, yang telah diamalkan di kalangan kita ialah seseorang itu hanya perlu membayar nilai unta atau haiwan tersebut pada hari ia diambil."
  },
  {
    "id": 35706,
    "hadith_number": 1528,
    "tajuk_hadith": "Ganti Rugi Kerana Kecederaan Haiwan Ternak",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik",
    "english_text": "Yahya said that he heard Malik say, \"What is done in our\ncommunity about injury to a domestic animal, is that the one who\ninjures it must pay the amount by which he has diminished the animal's\nprice.\"\n\n\nYahya said that he heard Malik speak about a camel\nwho attacked a man and he feared for himself and killed it or\nhamstrung it. He said, \"If he has a clear proof that it was heading\nfor him and had attacked him, there are no damages against him. If\nthere is no clear proof except his word, he is responsible for the\ncamel.\"",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan bahawa beliau mendengar Malik berkata, \"Apa yang diamalkan dalam masyarakat kita mengenai kecederaan terhadap haiwan ternak ialah orang yang melukakannya hendaklah membayar ganti rugi sebanyak nilai penurunan harga haiwan tersebut.\"\n\nYahya juga meriwayatkan bahawa beliau mendengar Malik bercakap tentang seekor unta yang menyerang seorang lelaki, lalu lelaki itu khuatir akan dirinya dan membunuh atau mencederakan unta tersebut. Malik berkata, \"Sekiranya lelaki itu mempunyai bukti yang jelas bahawa unta itu menuju ke arahnya dan telah menyerangnya, maka tiada ganti rugi ke atasnya.  Sekiranya tiada bukti yang jelas melainkan kata-katanya sahaja, maka dia bertanggungjawab terhadap unta tersebut.\""
  },
  {
    "id": 35707,
    "hadith_number": 1529,
    "tajuk_hadith": "Tanggungjawab Pencelup dan Tukang Jahit",
    "perawi_melayu": "Yahya",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan bahawa beliau mendengar Malik berkata bahawa jika seseorang lelaki memberikan kain kepada pencelup untuk dicelup dan pencelup tersebut telah mencelupnya, kemudian pemilik kain tersebut berkata, \"Saya tidak menyuruh awak menggunakan pewarna ini,\" dan pencelup itu membantah bahawa dia telah melakukannya, maka pencelup itu perlu dipercayai. Begitu juga dengan tukang jahit dan tukang emas. Mereka bersumpah mengenainya melainkan jika mereka menghasilkan sesuatu yang biasanya mereka tidak akan diupah untuk melakukannya. Dalam situasi itu, kenyataan mereka tidak dibenarkan dan pemilik kain itu perlu bersumpah. Jika dia menolak dan enggan bersumpah, maka pencelup itu perlu bersumpah.\n\nYahya berkata, \"Saya mendengar Malik bercakap tentang seorang pencelup yang diberi sehelai kain dan dia melakukan kesilapan dan memberikannya kepada lelaki lain dan orang yang menerimanya itu memakainya. Dia berkata, 'Orang yang memakainya tidak menanggung sebarang kerosakan, dan pencelup membayar ganti rugi kepada pemilik kain.' Itulah ketika lelaki itu memakai kain yang diberikan kepadanya tanpa menyedari bahawa ia bukan miliknya. Jika dia memakainya dengan mengetahui bahawa ia bukan kainnya, dia bertanggungjawab ke atasnya.\""
  },
  {
    "id": 35708,
    "hadith_number": 1530,
    "tajuk_hadith": "Tanggungjawab Hutang Piutang dalam Masyarakat",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan bahawa beliau mendengar Malik berkata, \"Amalan masyarakat kita terhadap seseorang yang merujuk pemiutang kepada orang lain bagi hutang yang dihutanginya ialah jika orang yang dirujuk itu muflis atau meninggal dunia, dan tidak meninggalkan harta yang mencukupi untuk membayar hutang, maka pemiutang tidak mempunyai tuntutan terhadap orang yang merujuknya dan hutang itu tidak kembali kepada pihak pertama.\"\n\nMalik berkata, \"Inilah cara melakukan perkara yang tidak ada perselisihan pendapat dalam masyarakat kita.\"\n\nMalik berkata, \"Jika seseorang itu mempunyai hutangnya kepada seseorang yang diambil alih oleh orang lain dan kemudian orang yang mengambil alih itu meninggal dunia atau muflis, maka apa sahaja yang diambil alih olehnya akan dikembalikan kepada penghutang pertama.\""
  },
  {
    "id": 35709,
    "hadith_number": 1531,
    "tajuk_hadith": "Pengembalian Pakaian Bercela",
    "perawi_melayu": "Yahya daripada Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan bahawa beliau mendengar Malik berkata, \"Jika seseorang membeli pakaian yang mempunyai kecacatan, seperti terbakar atau sebagainya, yang diketahui oleh penjual dan disahkan atau penjual mengakuinya, dan pembeli tersebut menyebabkan koyakan baru yang mengurangkan harga pakaian itu, kemudian dia mengetahui tentang kecacatan asal, dia boleh mengembalikannya kepada penjual dan dia tidak bertanggungjawab atas koyakan yang dibuatnya.\n\nJika seseorang membeli pakaian yang mempunyai kecacatan seperti terbakar atau cela, dan penjual mendakwa dia tidak mengetahuinya, dan pembeli telah menggunting atau mewarnainya, maka pembeli mempunyai pilihan. Jika dia mahu, dia boleh meminta potongan harga mengikut nilai kecacatan terbakar atau cela itu daripada harga pakaian dan boleh menyimpan pakaian tersebut, atau jika dia mahu membayar ganti rugi atas pengurangan harga pakaian akibat digunting atau diwarna dan mengembalikannya, dia boleh berbuat demikian.\n\nJika pembeli telah mewarnakan pakaian itu dengan pewarna yang meningkatkan nilainya, pembeli mempunyai pilihan. Jika dia mahu, dia boleh meminta potongan harga daripada harga pakaian mengikut nilai kecacatan, atau jika dia mahu menjadi rakan kongsi dengan penjual, dia boleh berbuat demikian. Harga pakaian yang terbakar atau bercela akan dinilai. Jika harganya sepuluh dirham, dan nilai peningkatan akibat pewarnaan adalah lima dirham, maka mereka adalah rakan kongsi dalam pakaian itu, masing-masing mengikut bahagian mereka. Pengiraan ini adalah berdasarkan nilai peningkatan harga pakaian akibat pewarnaan.\" "
  },
  {
    "id": 35710,
    "hadith_number": 1532,
    "tajuk_hadith": "Keadilan dalam Pemberian Hadiah kepada Anak",
    "perawi_melayu": "Yahya, Malik, Ibn Shihab, Humayd ibn Abd ar-Rahman ibn Awf, dan Muhammad ibn an-Numan ibn Bashir",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، وَعَنْ مُحَمَّدِ بْنِ النُّعْمَانِ بْنِ بَشِيرٍ، أَنَّهُمَا حَدَّثَاهُ عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، أَنَّهُ قَالَ إِنَّ أَبَاهُ بَشِيرًا أَتَى بِهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنِّي نَحَلْتُ ابْنِي هَذَا غُلاَمًا كَانَ لِي ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَكُلَّ وَلَدِكَ نَحَلْتَهُ مِثْلَ هَذَا ‏\"‏ ‏.‏ فَقَالَ لاَ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَارْتَجِعْهُ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada kita daripada Malik, daripada Ibn Shihab, daripada Humayd ibn Abd ar-Rahman ibn Awf, dan daripada Muhammad ibn an-Numan ibn Bashir, bahawa mereka berdua menceritakan kepadanya daripada an-Numan ibn Bashir, bahawa dia berkata: \"Bapaku, Bashir, membawaku kepada Rasulullah SAW, lalu berkata: \"Sesungguhnya aku telah memberi hadiah kepada anakku ini seorang hamba sahaya yang menjadi milikku.\"  Rasulullah SAW bersabda: \"Adakah engkau telah memberi hadiah yang sama kepada semua anakmu?\" Dia menjawab: \"Tidak.\" Rasulullah SAW bersabda: \"Maka ambillah kembali hamba sahaya itu.\""
  },
  {
    "id": 35711,
    "hadith_number": 1533,
    "tajuk_hadith": "Pewarisan Harta Oleh Abu Bakar As-Siddiq",
    "perawi_melayu": "Malik meriwayatkan daripada Ibn Shihab daripada Urwa bin az-Zubayr daripada Aisyah",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ إِنَّ أَبَا بَكْرٍ الصِّدِّيقَ كَانَ نَحَلَهَا جَادَّ عِشْرِينَ وَسْقًا مِنْ مَالِهِ بِالْغَابَةِ فَلَمَّا حَضَرَتْهُ الْوَفَاةُ قَالَ وَاللَّهِ يَا بُنَيَّةُ مَا مِنَ النَّاسِ أَحَدٌ أَحَبُّ إِلَىَّ غِنًى بَعْدِي مِنْكِ وَلاَ أَعَزُّ عَلَىَّ فَقْرًا بَعْدِي مِنْكِ وَإِنِّي كُنْتُ نَحَلْتُكِ جَادَّ عِشْرِينَ وَسْقًا فَلَوْ كُنْتِ جَدَدْتِيهِ وَاحْتَزْتِيهِ كَانَ لَكِ وَإِنَّمَا هُوَ الْيَوْمَ مَالُ وَارِثٍ وَإِنَّمَا هُمَا أَخَوَاكِ وَأُخْتَاكِ فَاقْتَسِمُوهُ عَلَى كِتَابِ اللَّهِ ‏.‏ قَالَتْ عَائِشَةُ فَقُلْتُ يَا أَبَتِ وَاللَّهِ لَوْ كَانَ كَذَا وَكَذَا لَتَرَكْتُهُ إِنَّمَا هِيَ أَسْمَاءُ فَمَنِ الأُخْرَى فَقَالَ أَبُو بَكْرٍ ذُو بَطْنِ بِنْتِ خَارِجَةَ ‏.‏ أُرَاهَا جَارِيَةً ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Ibn Shihab, daripada Urwa bin az-Zubayr, daripada Aisyah, isteri Nabi SAW bahawa beliau berkata: \"Abu Bakar As-Siddiq telah memberikan kepadaku sebatang pokok kurma yang hasilnya dua puluh wasaq daripada hartanya di Al-Ghabah.  Apabila beliau hampir meninggal dunia, beliau berkata, \"Demi Allah, wahai anakku, tiada seorang pun di kalangan manusia yang lebih aku sukai kekayaannya selepas kematianku melainkan kamu, dan tiada seorang pun yang lebih aku susah melihatnya miskin selepas kematianku melainkan kamu.  Sesungguhnya aku telah memberikan kepadamu sebatang pokok kurma yang hasilnya dua puluh wasaq. Sekiranya kamu telah menebangnya dan mengambil hasilnya, ia adalah milikmu.  Tetapi hari ini ia adalah harta pusaka, dan pewarisnya ialah kedua-dua saudaramu lelaki dan kedua-dua saudarimu perempuan, maka bahagikanlah ia mengikut Kitabullah.\" Aisyah berkata: \"Maka aku berkata, \"Wahai ayahku, demi Allah, walaupun ia lebih daripada itu, nescaya aku akan meninggalkannya.  Hanya Asma sahaja. Siapakah saudariku yang lain?\" Abu Bakar menjawab, \"Yang di dalam kandungan Kharijah (Kharijah ialah isteri saudara lelaki Abu Bakar daripada kalangan Ansar). Aku kira ia perempuan.\""
  },
  {
    "id": 35712,
    "hadith_number": 1534,
    "tajuk_hadith": "Kesahihan Hibah (Pemberian)",
    "perawi_melayu": "Malik meriwayatkan daripada Ibn Shihab, daripada Urwa ibn az-Zubayr, daripada Abd ar-Rahman ibn Abd al-Qari, bahawa Umar ibn al-Khattab berkata,",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدٍ الْقَارِيِّ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ مَا بَالُ رِجَالٍ يَنْحَلُونَ أَبْنَاءَهُمْ نُحْلاً ثُمَّ يُمْسِكُونَهَا فَإِنْ مَاتَ ابْنُ أَحَدِهِمْ قَالَ مَالِي بِيَدِي لَمْ أُعْطِهِ أَحَدًا ‏.‏ وَإِنْ مَاتَ هُوَ قَالَ هُوَ لاِبْنِي قَدْ كُنْتُ أَعْطَيْتُهُ إِيَّاهُ ‏.‏ مَنْ نَحَلَ نِحْلَةً فَلَمْ يَحُزْهَا الَّذِي نُحِلَهَا - حَتَّى يَكُونَ إِنْ مَاتَ لِوَرَثَتِهِ - فَهِيَ بَاطِلٌ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Ibn Shihab, daripada Urwa ibn az-Zubayr, daripada Abd ar-Rahman ibn Abd al-Qari, bahawa Umar ibn al-Khattab berkata, \"Apakah keadaan orang-orang yang memberikan hadiah kepada anak-anak mereka, kemudian menyimpannya? Jika anak salah seorang daripada mereka meninggal dunia, dia berkata, ‘Harta saya ada di tangan saya, saya tidak memberikannya kepada sesiapa.’ Tetapi jika dia sendiri yang meninggal dunia, dia berkata, ‘Ia adalah milik anak saya, saya telah memberikannya kepadanya.’ Sesiapa yang memberi hadiah, tetapi tidak menyerahkannya kepada orang yang diberi hadiah itu sehingga sekiranya dia meninggal dunia harta tersebut menjadi milik warisnya, maka ia adalah tidak sah.\""
  },
  {
    "id": 35713,
    "hadith_number": 1535,
    "tajuk_hadith": "Hukum Pemberian Hadiah Tanpa Harapan Balasan",
    "perawi_melayu": "Yahya daripada Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan bahawa beliau mendengar Malik berkata, \"Amalan dalam masyarakat kita terhadap seseorang yang memberi hadiah tanpa mengharapkan balasan adalah dengan memanggil saksi. Hadiah itu disahkan milik penerima melainkan pemberi meninggal dunia sebelum penerima menerima hadiah tersebut.\"\n\nBeliau berkata, \"Sekiranya pemberi ingin menyimpan kembali hadiah tersebut selepas ia disaksikan, dia tidak boleh berbuat demikian. Sekiranya penerima menuntutnya darinya, dia wajib menyerahkannya.\"\n\nMalik berkata, \"Sekiranya seseorang memberi hadiah kemudian menariknya kembali dan penerima membawa saksi untuk memberi keterangan bahawa dia telah diberi hadiah itu, sama ada barang, emas, perak atau binatang, penerima perlu bersumpah. Sekiranya dia enggan, pemberi perlu bersumpah. Sekiranya dia juga enggan bersumpah, dia perlu memberi kepada penerima apa yang dituntut olehnya sekiranya penerima mempunyai sekurang-kurangnya seorang saksi. Sekiranya penerima tidak mempunyai saksi, dia tidak akan mendapat apa-apa.\"\n\nMalik berkata, \"Sekiranya seseorang memberi hadiah tanpa mengharapkan apa-apa balasan dan kemudian penerima meninggal dunia, warisnya menggantikan tempatnya. Sekiranya pemberi meninggal dunia sebelum penerima menerima hadiah tersebut, penerima tidak akan mendapat apa-apa. Ini kerana dia diberi hadiah yang belum diambil milikinya. Sekiranya pemberi ingin menyimpannya, dan dia telah memanggil saksi untuk hadiah tersebut, dia tidak boleh berbuat demikian. Sekiranya penerima menuntut haknya, dia akan menerimanya.\""
  },
  {
    "id": 35714,
    "hadith_number": 1536,
    "tajuk_hadith": "Hukum Pemberian Hadiah dalam Islam",
    "perawi_melayu": "Malik meriwayatkan daripada Da'ud ibn al-Husayn daripada Abu Ghatafan ibn Tarif al-Muriyi",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مَالِكٌ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، عَنْ أَبِي غَطَفَانَ بْنِ طَرِيفٍ الْمُرِّيِّ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ مَنْ وَهَبَ هِبَةً لِصِلَةِ رَحِمٍ أَوْ عَلَى وَجْهِ صَدَقَةٍ فَإِنَّهُ لاَ يَرْجِعُ فِيهَا وَمَنْ وَهَبَ هِبَةً يَرَى أَنَّهُ إِنَّمَا أَرَادَ بِهَا الثَّوَابَ فَهُوَ عَلَى هِبَتِهِ يَرْجِعُ فِيهَا إِذَا لَمْ يُرْضَ مِنْهَا ‏.‏ قَالَ يَحْيَى سَمِعْتُ مَالِكًا يَقُولُ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّ الْهِبَةَ إِذَا تَغَيَّرَتْ عِنْدَ الْمَوْهُوبِ لَهُ لِلثَّوَابِ بِزِيَادَةٍ أَوْ نُقْصَانٍ فَإِنَّ عَلَى الْمَوْهُوبِ لَهُ أَنْ يُعْطِيَ صَاحِبَهَا قِيمَتَهَا يَوْمَ قَبَضَهَا ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Da'ud ibn al-Husayn daripada Abu Ghatafan ibn Tarif al-Muriyi bahawa Umar ibn al-Khattab berkata, \"Barangsiapa memberi hadiah untuk mengeratkan silaturahim atau sebagai sedekah, maka dia tidak boleh menarik baliknya.  Tetapi barangsiapa memberi hadiah dengan mengharapkan balasan, maka dia berhak atas hadiahnya dan boleh menariknya balik jika dia tidak berpuas hati.\" Yahya berkata bahawa dia mendengar Malik berkata, \"Amalan yang disepakati di kalangan kami ialah jika hadiah itu berubah pada penerima untuk mendapat pahala, sama ada bertambah atau berkurang nilainya, maka penerima hendaklah memberikan kepada pemberi hadiah itu nilai pada hari dia menerimanya.\""
  },
  {
    "id": 35715,
    "hadith_number": 1537,
    "tajuk_hadith": "Mengenai Pemberian Sedekah dan Hadiah kepada Anak",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya meriwayatkan bahawa beliau mendengar Malik berkata, \"Cara yang diamalkan dalam masyarakat kita tanpa sebarang perselisihan pendapat ialah sekiranya seseorang lelaki memberikan sedekah kepada anaknya – sedekah yang telah diterima oleh anaknya atau yang disimpan oleh bapanya dan bapanya telah menyaksikan sedekahnya, maka dia tidak boleh mengambil kembali sebarang bahagian daripadanya kerana dia tidak boleh menuntut semula sebarang sedekah.\"\n\nYahya meriwayatkan bahawa beliau mendengar Malik berkata, \"Cara yang dipersetujui secara umum dalam masyarakat kita dalam kes seseorang yang memberikan hadiah kepada anaknya yang bukan sedekah ialah dia boleh mengambilnya kembali selagi anaknya belum berhutang, yang mana orang ramai menuntutnya darinya, dan yang mereka mempercayainya berdasarkan hadiah yang diberikan oleh bapanya. Bapanya tidak boleh mengambil kembali apa-apa daripada hadiah itu selepas hutang-hutang bermula.\"\n\n\"Sekiranya seseorang lelaki memberikan sesuatu kepada anaknya lelaki atau perempuan dan seorang wanita mengahwini lelaki itu, dan dia hanya mengahwininya kerana kekayaan dan harta yang diberikan oleh bapanya kepadanya, maka bapanya ingin mengambilnya kembali, atau, sekiranya seseorang lelaki mengahwini seorang wanita yang bapanya telah memberikannya hadiah dan dia mengahwininya dengan mas kahwin yang lebih tinggi kerana kekayaan dan harta yang diberikan oleh bapanya, maka bapanya berkata, 'Saya akan mengambilnya kembali,' maka bapanya tidak boleh mengambil kembali apa-apa daripada anak lelaki atau perempuan itu jika ia seperti yang telah saya terangkan kepada anda.\""
  },
  {
    "id": 35716,
    "hadith_number": 1538,
    "tajuk_hadith": "Hukum Harta Pusaka Wakaf",
    "perawi_melayu": "Malik, daripada Ibn Shihab, daripada Abu Salama ibn Abd ar-Rahman ibn Awf, daripada Jabir ibn Abdullah al-Ansari",
    "english_text": "Malik related to me from Ibn Shihab from Abu Salama ibn Abd ar-\nRahman ibn Awf from Jabir ibn Abdullah al-Ansari that the Messenger of\nAllah, may Allah bless him and grant him peace, said, \"If someone is\ngiven a life pension, for him and his posterity, it belongs to the\nperson to whom it has been given. It never reverts to the one who gave\nit because he gave a gift and the rules of inheritance apply to it.\"",
    "arabic_text": "حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ الأَنْصَارِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَيُّمَا رَجُلٍ أُعْمِرَ عُمْرَى لَهُ وَلِعَقِبِهِ فَإِنَّهَا لِلَّذِي يُعْطَاهَا لاَ تَرْجِعُ إِلَى الَّذِي أَعْطَاهَا أَبَدًا ‏\"‏ ‏.‏ لأَنَّهُ أَعْطَى عَطَاءً وَقَعَتْ فِيهِ الْمَوَارِيثُ ‏.‏",
    "malay_translation": "Malik meriwayatkan kepadaku daripada Ibn Shihab, daripada Abu Salama ibn Abd ar-Rahman ibn Awf, daripada Jabir ibn Abdullah al-Ansari bahawa Rasulullah SAW bersabda:  \"Sesiapa yang diberikan suatu geran hayat (wakaf) untuk dirinya dan keturunannya, maka ia adalah milik orang yang diberi geran tersebut. Ia tidak akan kembali kepada orang yang memberi geran tersebut selama-lamanya, kerana ia telah memberi pemberian dan hukum-hukum pewarisan telah jatuh ke atasnya.\""
  },
  {
    "id": 35717,
    "hadith_number": 1539,
    "tajuk_hadith": "Hukum Harta Pusaka (Wakaf)",
    "perawi_melayu": "Malik, Yahya bin Said, Abd ar-Rahman bin al-Qasim, Makhul ad-Dimashqi, dan al-Qasim bin Muhammad",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، أَنَّهُ سَمِعَ مَكْحُولاً الدِّمَشْقِيَّ، يَسْأَلُ الْقَاسِمَ بْنَ مُحَمَّدٍ عَنِ الْعُمْرَى، وَمَا يَقُولُ النَّاسُ فِيهَا فَقَالَ الْقَاسِمُ بْنُ مُحَمَّدٍ مَا أَدْرَكْتُ النَّاسَ إِلاَّ وَهُمْ عَلَى شُرُوطِهِمْ فِي أَمْوَالِهِمْ وَفِيمَا أُعْطُوا ‏.‏ قَالَ يَحْيَى سَمِعْتُ مَالِكًا يَقُولُ وَعَلَى ذَلِكَ الأَمْرُ عِنْدَنَا أَنَّ الْعُمْرَى تَرْجِعُ إِلَى الَّذِي أَعْمَرَهَا إِذَا لَمْ يَقُلْ هِيَ لَكَ وَلِعَقِبِكَ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Yahya bin Said, daripada Abd ar-Rahman bin al-Qasim, bahawa dia mendengar Makhul ad-Dimashqi bertanya kepada al-Qasim bin Muhammad tentang harta wakaf (umurā), dan apa yang dikatakan oleh orang ramai mengenainya. Maka berkata al-Qasim bin Muhammad, \"Aku tidak menemui orang ramai melainkan mereka tetap dengan syarat-syarat mereka terhadap harta benda mereka dan apa yang diberikan kepada mereka.\" Yahya berkata bahawa dia mendengar Malik berkata, \"Dan menurut amalan kita, harta wakaf (umurā) akan dikembalikan kepada orang yang mewakafkannya jika dia tidak berkata, 'Harta ini untukmu dan zuriatmu.'\""
  },
  {
    "id": 35718,
    "hadith_number": 1540,
    "tajuk_hadith": "Pewarisan Rumah Hafsah binti Umar",
    "perawi_melayu": "Malik daripada Nafi'",
    "english_text": "Malik related to me from Nafi that Abdullah ibn Umar inherited\nthe house of Hafsa bint Umar. He said, \"Hafsa gave lodging to the\ndaughter of Zayd ibn al-Khattab for as long as she lived. When the\ndaughter of Zayd died, Abdullah ibn Umar took possession of the\ndwelling and considered that it was his.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، ‏.‏ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، وَرِثَ مِنْ حَفْصَةَ بِنْتِ عُمَرَ دَارَهَا قَالَ وَكَانَتْ حَفْصَةُ قَدْ أَسْكَنَتْ بِنْتَ زَيْدِ بْنِ الْخَطَّابِ مَا عَاشَتْ فَلَمَّا تُوُفِّيَتْ بِنْتُ زَيْدٍ قَبَضَ عَبْدُ اللَّهِ بْنُ عُمَرَ الْمَسْكَنَ وَرَأَى أَنَّهُ لَهُ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Nafi' bahawa Abdullah bin Umar mewarisi rumah Hafsah binti Umar.  Baginda berkata, \"Hafsah telah memberi tempat tinggal kepada anak perempuan Zayd bin al-Khattab sepanjang hayatnya.  Apabila anak perempuan Zayd meninggal dunia, Abdullah bin Umar mengambil alih kediaman tersebut dan menganggapnya sebagai miliknya.\""
  },
  {
    "id": 35719,
    "hadith_number": 1541,
    "tajuk_hadith": "Hukum Barang Terjumpa dan Haiwan Hilang",
    "perawi_melayu": "Malik meriwayatkan daripada Rabiah ibn Abi Abd ar-Rahman, daripada Yazid, mawla al-Munbaith, daripada Zayd ibn Khalid al-Juhani",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مَالِكٌ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ يَزِيدَ، مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَنَّهُ قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَأَلَهُ عَنِ اللُّقَطَةِ ‏.‏ فَقَالَ ‏\"‏ اعْرِفْ عِفَاصَهَا وَوِكَاءَهَا ثُمَّ عَرِّفْهَا سَنَةً فَإِنْ جَاءَ صَاحِبُهَا وَإِلاَّ فَشَأْنَكَ بِهَا ‏\"‏ ‏.‏ قَالَ فَضَالَّةُ الْغَنَمِ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ هِيَ لَكَ أَوْ لأَخِيكَ أَوْ لِلذِّئْبِ ‏\"‏ ‏.‏ قَالَ فَضَالَّةُ الإِبِلِ قَالَ ‏\"‏ مَا لَكَ وَلَهَا مَعَهَا سِقَاؤُهَا وَحِذَاؤُهَا تَرِدُ الْمَاءَ وَتَأْكُلُ الشَّجَرَ حَتَّى يَلْقَاهَا رَبُّهَا ‏\"‏ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Rabiah ibn Abi Abd ar-Rahman, daripada Yazid, mawla al-Munbaith, daripada Zayd ibn Khalid al-Juhani, bahawa dia berkata:  Seorang lelaki datang kepada Rasulullah SAW lalu bertanya tentang barang terjumpa. Baginda menjawab:  \"Kenali ciri-ciri dan tanda barang tersebut, kemudian umumkan selama setahun. Jika pemiliknya datang, berikan kepadanya. Jika tidak, maka ia menjadi hak kamu.\" Lelaki itu bertanya: \"Bagaimana pula dengan kambing yang hilang, wahai Rasulullah?\" Baginda menjawab: \"Ia menjadi hak kamu, atau saudara kamu, atau serigala.\" Lelaki itu bertanya lagi: \"Bagaimana pula dengan unta yang hilang?\" Baginda menjawab: \"Tidak ada kena mengena dengan kamu. Ia mempunyai air minuman dan kaki. Ia akan pergi ke tempat air dan makan tumbuh-tumbuhan sehingga pemiliknya menemuinya.\""
  },
  {
    "id": 35720,
    "hadith_number": 1542,
    "tajuk_hadith": "Mencari Pemilik Wang Yang Hilang",
    "perawi_melayu": "Malik meriwayatkan daripada Ayyub ibn Musa daripada Muawiya ibn Abdullah ibn Badr al-Juhani",
    "english_text": "Malik related to me from Ayyub ibn Musa from Muawiya ibn Abdullah\nibn Badr al-Juhani that his father informed him that he stopped with a\npeople on the way to Syria and he found a purse which had eighty\ndinars in it. He mentioned that to Umar ibn al-Khattab. Umar said to\nhim, \"Announce it at the doors of the mosques and mention it to\neveryone who comes from Syria for a year. When a year passes, it is\nyour business.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ أَيُّوبَ بْنِ مُوسَى، عَنْ مُعَاوِيَةَ بْنِ عَبْدِ اللَّهِ بْنِ بَدْرٍ الْجُهَنِيِّ، أَنَّ أَبَاهُ، أَخْبَرَهُ أَنَّهُ، نَزَلَ مَنْزِلَ قَوْمٍ بِطَرِيقِ الشَّامِ فَوَجَدَ صُرَّةً فِيهَا ثَمَانُونَ دِينَارًا فَذَكَرَهَا لِعُمَرَ بْنِ الْخَطَّابِ فَقَالَ لَهُ عُمَرُ عَرِّفْهَا عَلَى أَبْوَابِ الْمَسَاجِدِ وَاذْكُرْهَا لِكُلِّ مَنْ يَأْتِي مِنَ الشَّأْمِ سَنَةً فَإِذَا مَضَتِ السَّنَةُ فَشَأْنَكَ بِهَا ‏.‏",
    "malay_translation": "Malik telah meriwayatkan kepada saya daripada Ayyub ibn Musa, daripada Muawiya ibn Abdullah ibn Badr al-Juhani, bahawa bapanya telah memberitahunya bahawa dia telah berhenti di tempat tinggal sekumpulan orang di jalan menuju ke Syam, lalu dia menjumpai sebuah beg berisi lapan puluh dinar. Dia memberitahu Umar ibn al-Khattab tentangnya. Umar berkata kepadanya, \" Umumkanlah di pintu-pintu masjid dan sebutkanlah kepada setiap orang yang datang dari Syam selama setahun. Apabila setahun berlalu, maka ia adalah hak milikmu.\""
  },
  {
    "id": 35721,
    "hadith_number": 1543,
    "tajuk_hadith": "Mencari Barang Hilang dan Pengumumannya",
    "perawi_melayu": "Malik daripada Nafi'",
    "english_text": "Malik related to me from Nafi that a man found something and went\nto Abdullah ibn Umar and said to him, \"I have found something. What do\nyou think I should do about it?\" Abdullah ibn Umar said to him,\n\"Publicise it!\" He said, \"I have done so.\" He said, \"Do it again.\" He\nsaid, \"I have done so.\" Abdullah said, \"I do not order you to use it.\nIf you wished, you could have left it.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، أَنَّ رَجُلاً، وَجَدَ لُقَطَةً فَجَاءَ إِلَى عَبْدِ اللَّهِ بْنِ عُمَرَ فَقَالَ لَهُ إِنِّي وَجَدْتُ لُقَطَةً فَمَاذَا تَرَى فِيهَا فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ عُمَرَ عَرِّفْهَا ‏.‏ قَالَ قَدْ فَعَلْتُ ‏.‏ قَالَ زِدْ ‏.‏ قَالَ قَدْ فَعَلْتُ ‏.‏ فَقَالَ عَبْدُ اللَّهِ لاَ آمُرُكَ أَنْ تَأْكُلَهَا وَلَوْ شِئْتَ لَمْ تَأْخُذْهَا ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Nafi’ bahawa seorang lelaki telah menjumpai sesuatu dan pergi kepada Abdullah bin Umar lalu berkata kepadanya, \"Saya telah menjumpai sesuatu. Apakah pandangan tuan tentangnya?\" Abdullah bin Umar berkata kepadanya, \"Sebarkanlah khabar penemuan itu!\" Lelaki itu berkata, \"Saya telah melakukannya.\" Abdullah berkata lagi, \"Sebarkan lagi!\" Lelaki itu berkata, \"Saya telah melakukannya.\"  Abdullah berkata, \"Saya tidak menyuruh engkau menggunakannya. Sekiranya engkau mahu, engkau boleh meninggalkannya.\""
  },
  {
    "id": 35722,
    "hadith_number": 1544,
    "tajuk_hadith": "Hamba yang Menemukan Harta Terpendam",
    "perawi_melayu": "Yahya daripada Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya berkata bahawa beliau mendengar Malik berkata, \"Apa yang dilakukan dalam masyarakat kita tentang seorang hamba yang menjumpai sesuatu dan menggunakannya sebelum tempoh yang ditetapkan untuk harta terpendam iaitu setahun, adalah ia dikira sebagai kesalahan terhadap dirinya.  Sama ada tuannya membayar harga barang yang telah digunakan hambanya, atau dia menyerahkan hambanya sebagai pampasan. Jika dia menyimpannya sehingga tempoh yang ditetapkan untuk harta terpendam itu tamat dan dia menggunakannya, maka ia adalah hutang terhadap dirinya dan bukan terhadap dirinya secara fizikal dan tiada apa-apa terhadap tuannya.\" "
  },
  {
    "id": 35723,
    "hadith_number": 1545,
    "tajuk_hadith": "Mencari Unta Hilang di Harrah",
    "perawi_melayu": "Malik meriwayatkan daripada Yahya bin Said daripada Sulaiman bin Yasar bahawa Thabit bin ad-Dahhak al-Ansari memberitahunya,",
    "english_text": "Malik related to me from Yahya ibn Said from Sulayman ibn Yasar\nthat Thabit ibn ad-Dahhak al-Ansari told him that he had found a camel\nat Harra, so he hobbled it and mentioned it to Umar ibn al-Khattab and\nUmar ordered him to make it known three times. Thabit said to him,\n\"That would distract me from the running of my estate.\" Umar said to\nhim, \"Then let it go where you found it.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ ثَابِتَ بْنَ الضَّحَّاكِ الأَنْصَارِيَّ، أَخْبَرَهُ ‏.‏ أَنَّهُ، وَجَدَ بَعِيرًا بِالْحَرَّةِ فَعَقَلَهُ ثُمَّ ذَكَرَهُ لِعُمَرَ بْنِ الْخَطَّابِ فَأَمَرَهُ عُمَرُ أَنْ يُعَرِّفَهُ ثَلاَثَ مَرَّاتٍ فَقَالَ لَهُ ثَابِتٌ إِنَّهُ قَدْ شَغَلَنِي عَنْ ضَيْعَتِي ‏.‏ فَقَالَ لَهُ عُمَرُ أَرْسِلْهُ حَيْثُ وَجَدْتَهُ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Yahya bin Said daripada Sulaiman bin Yasar bahawa Thabit bin ad-Dahhak al-Ansari memberitahunya bahawa dia telah menjumpai seekor unta di Harrah, lalu dia mengikatnya dan memberitahu Umar bin al-Khattab. Umar menyuruhnya memaklumkan penemuan itu sebanyak tiga kali. Thabit berkata kepadanya, \"Itu akan mengganggu urusan ladang saya.\" Umar berkata kepadanya, \"Maka lepaskanlah ia ke tempat engkau menjumpainya.\""
  },
  {
    "id": 35724,
    "hadith_number": 1546,
    "tajuk_hadith": "Orang yang Mengambil Barang Hilang Adalah Sesat",
    "perawi_melayu": "Malik meriwayatkan dari Yahya bin Said dari Said bin al-Musayyab",
    "english_text": "Malik related to me from Yahya ibn Said from Said ibn al-Musayyab\nthat Umar ibn al-Khattab said while he was leaning his back against\nthe Kaba, \"Whoever takes a stray is astray.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ وَهُوَ مُسْنِدٌ ظَهْرَهُ إِلَى الْكَعْبَةِ مَنْ أَخَذَ ضَالَّةً فَهُوَ ضَالٌّ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Yahya bin Said daripada Said bin al-Musayyab bahawa Umar bin al-Khattab berkata ketika beliau bersandar pada Kaabah, \"Barangsiapa mengambil barang yang hilang, maka dia adalah orang yang sesat.\""
  },
  {
    "id": 35725,
    "hadith_number": 1547,
    "tajuk_hadith": "Unta-unta Terbiar pada Zaman Umar dan Uthman",
    "perawi_melayu": "Malik meriwayatkan daripada Ibn Shihab",
    "english_text": "Malik related to me that he heard Ibn Shihab say, \"The stray\ncamels in the time of Umar ibn al-Khattab were numerous and left\nalone. No one touched them until the time of Uthman ibn Affan. He\nordered that they be publicised and then sold, and if the owner came\nafterwards, he was given their price.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ سَمِعَ ابْنَ شِهَابٍ، يَقُولُ كَانَتْ ضَوَالُّ الإِبِلِ فِي زَمَانِ عُمَرَ بْنِ الْخَطَّابِ إِبِلاً مُؤَبَّلَةً تَنَاتَجُ لاَ يَمَسُّهَا أَحَدٌ حَتَّى إِذَا كَانَ زَمَانُ عُثْمَانَ بْنِ عَفَّانَ أَمَرَ بِتَعْرِيفِهَا ثُمَّ تُبَاعُ فَإِذَا جَاءَ صَاحِبُهَا أُعْطِيَ ثَمَنَهَا ‏.‏",
    "malay_translation": "Malik meriwayatkan bahawa beliau mendengar Ibn Shihab berkata, \"Unta-unta yang sesat pada zaman Umar ibn al-Khattab adalah banyak dan dibiarkan begitu sahaja. Tiada sesiapa yang menyentuhnya sehingga pada zaman Uthman ibn Affan. Baginda memerintahkan agar unta-unta tersebut dimaklumkan kepada umum, kemudian dijual, dan jika pemiliknya datang kemudian, dia diberi harganya.\""
  },
  {
    "id": 35726,
    "hadith_number": 1548,
    "tajuk_hadith": "Sadaqah bagi Ibu yang Meninggal",
    "perawi_melayu": "Malik meriwayatkan dari Said ibn Amr ibn Shurahbil ibn Said ibn Saad ibn Ubada, dari bapanya, dari datuknya",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مَالِكٌ، عَنْ سَعِيدِ بْنِ عَمْرِو بْنِ شُرَحْبِيلَ بْنِ سَعِيدِ بْنِ سَعْدِ بْنِ عُبَادَةَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّهُ قَالَ خَرَجَ سَعْدُ بْنُ عُبَادَةَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي بَعْضِ  مَغَازِيهِ فَحَضَرَتْ أُمَّهُ الْوَفَاةُ بِالْمَدِينَةِ فَقِيلَ لَهَا أَوْصِي ‏.‏ فَقَالَتْ فِيمَ أُوصِي إِنَّمَا الْمَالُ مَالُ سَعْدٍ ‏.‏ فَتُوُفِّيَتْ قَبْلَ أَنْ يَقْدَمَ سَعْدٌ فَلَمَّا قَدِمَ سَعْدُ بْنُ عُبَادَةَ ذُكِرَ ذَلِكَ لَهُ فَقَالَ سَعْدٌ",
    "malay_translation": "Malik meriwayatkan daripada Said bin Amr bin Shurahbil bin Said bin Saad bin Ubada, daripada bapanya, daripada datuknya, bahawa baginda berkata: Saad bin Ubada keluar bersama Rasulullah SAW dalam salah satu peperangan.  Ketika itu, ibunya hampir meninggal dunia di Madinah.  Lalu dikatakan kepadanya, \"Wasiatkanlah sesuatu.\"  Ibunya berkata, \"Apa yang hendak kuwasiatkan? Harta ini adalah harta Saad.\"  Kemudian ibunya meninggal dunia sebelum Saad pulang.  Setelah Saad bin Ubada pulang, perkara itu diberitahu kepadanya.  Lalu Saad berkata, \"Wahai Rasulullah! Adakah memberi sedekah untuknya dapat memberi manfaat kepadanya?\" Rasulullah SAW bersabda, \"Ya.\"  Saad berkata, \"Taman ini kusedekahkan untuknya,\" sambil menyebut nama taman tersebut."
  },
  {
    "id": 35727,
    "hadith_number": 1549,
    "tajuk_hadith": "Sedekah Bagi Ibu Yang Meninggal Secara Mengejut",
    "perawi_melayu": "Malik meriwayatkan daripada Hisyam bin Urwah daripada bapanya daripada Aisyah, isteri Nabi SAW",
    "english_text": "Malik related to me from Hisham ibn Urwa from his father from\nA'isha, the wife of the Prophet, may Allah bless him and grant him\npeace, that a man said to the Messenger of Allah, may Allah bless him\nand grant him peace, \"My mother died suddenly, and I think that had\nshe spoken, she would have given sadaqa. Shall I give sadaqa for her?\"\nThe Messenger of Allah, may Allah bless him and grant him peace, said,\n\"Yes.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَجُلاً قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِنَّ أُمِّي افْتُلِتَتْ نَفْسُهَا وَأُرَاهَا لَوْ تَكَلَّمَتْ تَصَدَّقَتْ أَفَأَتَصَدَّقُ عَنْهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ نَعَمْ ‏\"‏ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Hisyam bin Urwah daripada bapanya daripada Aisyah, isteri Nabi Muhammad SAW, bahawa seorang lelaki berkata kepada Rasulullah SAW, \"Ibu saya meninggal dunia secara mengejut, dan saya rasa sekiranya beliau sempat bercakap, nescaya beliau akan memberi sedekah.  Bolehkah saya memberi sedekah bagi pihak beliau?\"  Rasulullah SAW bersabda, \"Ya.\""
  },
  {
    "id": 35728,
    "hadith_number": 1550,
    "tajuk_hadith": "Ganjaran Sedekah Kepada Ibu Bapa",
    "perawi_melayu": "Malik",
    "english_text": "Malik related to me that he heard that a man of the Ansar from\nthe tribe of Banu al-Harith ibn al-Khazraj, gave sadaqa to his parents\nand then they died. Their son inherited the property he had given them\nand it was palm-trees. He asked the Messenger of Allah, may Allah\nbless him and grant him peace, about it and he said, \"You are rewarded\nfor your sadaqa, and take it as your inheritance.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ رَجُلاً، مِنَ الأَنْصَارِ مِنْ بَنِي الْحَارِثِ بْنِ الْخَزْرَجِ تَصَدَّقَ عَلَى أَبَوَيْهِ بِصَدَقَةٍ فَهَلَكَا فَوَرِثَ ابْنُهُمَا الْمَالَ وَهُوَ نَخْلٌ فَسَأَلَ عَنْ ذَلِكَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ قَدْ أُجِرْتَ فِي صَدَقَتِكَ وَخُذْهَا بِمِيرَاثِكَ ‏\"‏ ‏.‏",
    "malay_translation": "Malik telah menceritakan kepadaku bahawa baginda telah diberitahu bahawa seorang lelaki daripada kalangan Ansar dari kabilah Bani al-Harith bin al-Khazraj telah memberi sedekah kepada ibu bapanya, kemudian mereka meninggal dunia. Anak mereka mewarisi harta yang telah diberikan kepada ibu bapanya iaitu sebatang pokok kurma.  Lalu dia bertanya kepada Rasulullah SAW tentang hal itu, maka Baginda SAW bersabda: \"Sesungguhnya engkau telah mendapat pahala atas sedekahmu, dan ambillah ia sebagai harta pusaka.\" "
  }
]