[
  {
    "id": 34629,
    "hadith_number": 451,
    "tajuk_hadith": "Solat Gerhana Matahari dan Nasihat Rasulullah SAW",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Hisham bin Urwa daripada ayahnya bahawa Aisyah, isteri Nabi SAW, berkata, \"Berlaku gerhana matahari pada zaman Rasulullah SAW. Rasulullah SAW mengimamkan solat untuk orang ramai. Baginda berdiri dan memanjangkan berdiri. Kemudian baginda rukuk dan memanjangkan rukuk. Kemudian baginda berdiri lagi dan memanjangkan berdiri, tetapi tidak sepanjang yang pertama. Kemudian baginda rukuk dan memanjangkan rukuk, tetapi tidak sepanjang rukuk yang pertama. Kemudian baginda bangkit dan sujud. Baginda melakukan perkara yang sama pada rakaat yang kedua, dan menjelang baginda selesai, matahari telah muncul. Kemudian baginda memberikan khutbah kepada orang ramai, di mana baginda memuji Allah dan kemudian bersabda, 'Sesungguhnya matahari dan bulan adalah dua tanda daripada tanda-tanda Allah. Keduanya tidak mengalami gerhana kerana kematian seseorang atau kerana kehidupannya. Apabila kamu melihat gerhana, serulah Allah dan ucapkanlah, \"Allahu Akbar\" dan bersedekahlah.' Kemudian baginda bersabda, 'Wahai umat Muhammad! Demi Allah, tidak ada yang lebih cemburu daripada Allah terhadap hamba lelaki atau perempuan-Nya yang melakukan zina. Wahai umat Muhammad! Demi Allah, jika kamu mengetahui apa yang aku ketahui, nescaya kamu akan sedikit ketawa dan banyak menangis'.\"",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that A'isha, the wife of the Prophet, may Allah bless him and\ngrant him peace, said, \"There was an eclipse of the sun in the time of\nthe Messenger of Allah, may Allah bless him and grant him peace, and\nthe Messenger of Allah, may Allah bless him and grant him peace, led\nthe people in prayer. He stood, and did so for a long time. Then he\nwent into ruku, and made the ruku long. Then he stood again, and did\nso for a long time, though not as long as the first time. Then he went\ninto ruku, and made the ruku long, though not as long as thefirst\ntime. Then he rose, and went down into sajda. He then did the same in\nthe second raka, and by the time he had finished the sun had appeared.\nHe then gave a khutba to the people, in which he praised Allah and\nthen said, 'The sun and the moon are two of Allah's signs. They do not\neclipse for anyone's death nor for anyone's life. When you see an\neclipse, call on Allah and say, \"Allah is greater\" and give sadaqa.'\nThen he said, 'O community of Muhammad! ByAllah, there is no-one more\njealous than Allah of a male or female slave of his who commits\nadultery. O community of Muhammad! By Allah, if you knew what I knew,\nyou would laugh little and weep much'.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ خَسَفَتِ الشَّمْسُ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم بِالنَّاسِ فَقَامَ فَأَطَالَ الْقِيَامَ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ ثُمَّ قَامَ فَأَطَالَ الْقِيَامَ وَهُوَ دُونَ الْقِيَامِ الأَوَّلِ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ وَهُوَ دُونَ الرُّكُوعِ الأَوَّلِ ثُمَّ رَفَعَ فَسَجَدَ ثُمَّ فَعَلَ فِي الرَّكْعَةِ الآخِرَةِ مِثْلَ ذَلِكَ ثُمَّ انْصَرَفَ وَقَدْ تَجَلَّتِ الشَّمْسُ فَخَطَبَ النَّاسَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏\n\"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ لاَ يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ فَإِذَا رَأَيْتُمْ ذَلِكَ فَادْعُوا اللَّهَ وَكَبِّرُوا وَتَصَدَّقُوا - ثُمَّ قَالَ - يَا أُمَّةَ مُحَمَّدٍ وَاللَّهِ مَا مِنْ أَحَدٍ أَغْيَرَ مِنَ اللَّهِ أَنْ يَزْنِيَ عَبْدُهُ أَوْ تَزْنِيَ أَمَتُهُ يَا أُمَّةَ مُحَمَّدٍ وَاللَّهِ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَضَحِكْتُمْ قَلِيلاً وَلَبَكَيْتُمْ كَثِيرًا ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Hisham bin Urwa daripada ayahnya bahawa Aisyah, isteri Nabi SAW, berkata, \"Berlaku gerhana matahari pada zaman Rasulullah SAW. Rasulullah SAW mengimamkan solat untuk orang ramai. Baginda berdiri dan memanjangkan berdiri. Kemudian baginda rukuk dan memanjangkan rukuk. Kemudian baginda berdiri lagi dan memanjangkan berdiri, tetapi tidak sepanjang yang pertama. Kemudian baginda rukuk dan memanjangkan rukuk, tetapi tidak sepanjang rukuk yang pertama. Kemudian baginda bangkit dan sujud. Baginda melakukan perkara yang sama pada rakaat yang kedua, dan menjelang baginda selesai, matahari telah muncul. Kemudian baginda memberikan khutbah kepada orang ramai, di mana baginda memuji Allah dan kemudian bersabda, 'Sesungguhnya matahari dan bulan adalah dua tanda daripada tanda-tanda Allah. Keduanya tidak mengalami gerhana kerana kematian seseorang atau kerana kehidupannya. Apabila kamu melihat gerhana, serulah Allah dan ucapkanlah, \"Allahu Akbar\" dan bersedekahlah.' Kemudian baginda bersabda, 'Wahai umat Muhammad! Demi Allah, tidak ada yang lebih cemburu daripada Allah terhadap hamba lelaki atau perempuan-Nya yang melakukan zina. Wahai umat Muhammad! Demi Allah, jika kamu mengetahui apa yang aku ketahui, nescaya kamu akan sedikit ketawa dan banyak menangis'.\""
  },
  {
    "id": 34630,
    "hadith_number": 452,
    "tajuk_hadith": "Solat Gerhana dan Peringatan tentang Neraka",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Zayd ibn Aslam daripada Ata ibn Yasar bahawa Abdullah ibn Abbas berkata,",
    "english_text": "Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn\nYasar that Abdullah ibn Abbas said, \"There was an eclipse of the sun\nand the Messenger of Allah, may Allah bless him and grant him peace,\nprayed, and the people prayed with him. He stood for a long time,\nnearly as long as (it takes to recite) Surat al-Baqara (Sura 2), and\nthen went into ruku for a long time. Then he rose and stood for a long\ntime, though less than the first time.Then he went into ruku for a\nlong time, though less than the first time. Then he went down into\nsajda. Then he stood for a long time, though less than the first time.\nThen he went into ruku for a long time, though less than the first\ntime. Then he rose and stood for a long time, though less than the\nfirsttime. Then he went into ruku for a long time, though less than\nthe first time. Then he went down into sajda, and by the time he had\nfinished the sun had appeared. Then he said, 'The sun and the moon are\ntwo of Allah's signs. They do not eclipse for anyone's death nor for\nanyone's life. When you see an eclipse, remember Allah.' They said,\n'Messenger of Allah, we saw you reach out for something while you were\nstanding here and then we saw you withdraw.' He said, 'I saw the\nGarden and I reached out for a bunch of grapes from it, and if I had\ntaken it you would have been able to eat from it for as long as this\nworld lasted. Then I saw the Fire - and I have never seen anything\nmore hideous than what I saw today - and I saw that most of  its\npeople were women.'  They said, 'Why, Messenger of Allah?'  He said,\n'Because of their ungratefulness (kufr).' Someone said, 'Are they\nungrateful toAllah?'  He said, 'They are ungrateful to their husbands\nand they are ungrateful for good behaviour (towards them) . Even if\nyou were to behave well towards one of them for a whole lifetime and\nthen she were to see you do something (that she did not like) she\nwould say that she had never seen anything good from you.' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّهُ قَالَ خَسَفَتِ الشَّمْسُ فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم وَالنَّاسُ مَعَهُ فَقَامَ قِيَامًا طَوِيلاً نَحْوًا مِنْ سُورَةِ الْبَقَرَةِ - قَالَ - ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلاً وَهُوَ دُونَ الْقِيَامِ الأَوَّلِ ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً وَهُوَ دُونَ الرُّكُوعِ الأَوَّلِ ثُمَّ سَجَدَ ثُمَّ قَامَ قِيَامًا طَوِيلاً وَهُوَ دُونَ الْقِيَامِ الأَوَّلِ ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً وَهُوَ دُونَ الرُّكُوعِ الأَوَّلِ ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلاً وَهُوَ دُونَ الْقِيَامِ الأَوَّلِ ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً وَهُو دُونَ الرُّكُوعِ الأَوَّلِ ثُمَّ سَجَدَ ثُمَّ انْصَرَفَ وَقَدْ تَجَلَّتِ الشَّمْسُ فَقَالَ ‏\"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ لاَ يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ فَإِذَا رَأَيْتُمْ ذَلِكَ فَاذْكُرُوا اللَّهَ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ رَأَيْنَاكَ تَنَاوَلْتَ شَيْئًا فِي مَقَامِكَ هَذَا ثُمَّ رَأَيْنَاكَ تَكَعْكَعْتَ ‏.‏ فَقَالَ ‏\"‏ إِنِّي رَأَيْتُ الْجَنَّةَ فَتَنَاوَلْتُ مِنْهَا عُنْقُودًا وَلَوْ أَخَذْتُهُ لأَكَلْتُمْ مِنْهُ مَا بَقِيَتِ الدُّنْيَا وَرَأَيْتُ النَّارَ فَلَمْ أَرَ كَالْيَوْمِ مَنْظَرًا قَطُّ أَفْظَعَ وَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ ‏\"‏ ‏.‏ قَالُوا لِمَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ لِكُفْرِهِنَّ ‏\"‏ ‏.‏ قِيلَ أَيَكْفُرْنَ بِاللَّهِ ‏.‏ قَالَ ‏\"‏ وَيَكْفُرْنَ الْعَشِيرَ وَيَكْفُرْنَ الإِحْسَانَ لَوْ أَحْسَنْتَ إِلَى إِحْدَاهُنَّ الدَّهْرَ كُلَّهُ ثُمَّ رَأَتْ مِنْكَ شَيْئًا قَالَتْ مَا رَأَيْتُ مِنْكَ خَيْرًا قَطُّ ‏\"‏ ‏.‏",
    "malay_translation": "\"Berlaku gerhana matahari, lalu Rasulullah SAW solat, dan orang ramai solat bersamanya. Baginda berdiri lama, hampir selama (tempoh membaca) Surah al-Baqarah, kemudian ruku' lama. Kemudian baginda bangkit dan berdiri lama, tetapi kurang daripada yang pertama. Kemudian baginda ruku' lama, tetapi kurang daripada yang pertama. Kemudian baginda sujud. Kemudian baginda berdiri lama, tetapi kurang daripada yang pertama. Kemudian baginda ruku' lama, tetapi kurang daripada yang pertama. Kemudian baginda bangkit dan berdiri lama, tetapi kurang daripada yang pertama. Kemudian baginda ruku' lama, tetapi kurang daripada yang pertama. Kemudian baginda sujud, dan apabila baginda selesai, matahari telah kelihatan. Kemudian baginda bersabda, 'Sesungguhnya matahari dan bulan adalah dua tanda daripada tanda-tanda Allah. Keduanya tidak mengalami gerhana kerana kematian seseorang atau kerana kehidupannya. Apabila kamu melihatnya, ingatlah Allah.' Mereka berkata, 'Wahai Rasulullah, kami melihat engkau menghulurkan tangan untuk mengambil sesuatu semasa engkau berdiri di sini, kemudian kami melihat engkau berundur.' Baginda bersabda, 'Aku melihat syurga dan aku menghulurkan tangan untuk mengambil setangkai anggur daripadanya, dan jika aku mengambilnya, kamu pasti akan dapat memakannya selama dunia ini masih ada. Kemudian aku melihat neraka - dan aku tidak pernah melihat pemandangan yang lebih dahsyat daripada apa yang aku lihat hari ini - dan aku melihat bahawa kebanyakan penghuninya adalah wanita.' Mereka bertanya, 'Mengapa, wahai Rasulullah?' Baginda bersabda, 'Kerana kekufuran mereka.' Dikatakan, 'Adakah mereka kufur kepada Allah?' Baginda bersabda, 'Mereka kufur kepada suami mereka dan mereka kufur terhadap kebaikan. Sekiranya kamu berbuat baik kepada salah seorang daripada mereka sepanjang hayatnya, kemudian dia melihat sesuatu (yang dia tidak suka) daripada kamu, dia akan berkata bahawa dia tidak pernah melihat kebaikan daripada kamu sama sekali.'\""
  },
  {
    "id": 34631,
    "hadith_number": 453,
    "tajuk_hadith": "Perlindungan dari Azab Kubur Selepas Solat Gerhana",
    "perawi_melayu": "Yahya meriwayatkan kepadaku daripada Malik daripada Yahya ibn Said daripada 'Amra bint Abd ar-Rahman daripada A'isha, isteri Nabi, semoga Allah memberkati baginda dan mengurniakan kesejahteraan.",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said from 'Amra\nbint Abd ar-Rahman from A'isha, the wife of the Prophet, may Allah\nbless him and grant him peace, that a jewish woman came to beg from\nher and said, \"May Allah give you refuge from the punishment of the\ngrave.\"  So A'isha asked the Messenger of Allah, may Allah bless him\nand grant him peace, \"Are people punished in their graves?\", and the\nMessenger of Allah, may Allah bless him and grant him peace, took\nrefuge in Allah from that. Then one morning the Messenger of Allah,\nmay Allah bless him and grant him peace, went out on a journey and\nthere was an eclipse of the sun, and he returned in the late morning\nand passed through his apartments. Then he stood and prayed, and the\npeople stood behind him. He stood for a long time, and then went into\nruku for a long time. Then he rose and stood for a long time, though\nless than the first time, and then went into ruku for a long time,\nthough less than the first time. Then he rose, and went down into\nsajda. Then he stood for a long time, though less than the time\nbefore, and then went into ruku for a long time, though less than the\ntime before. Then he rose and stood for a long time, though less than\nthe time before, and then went into ruku for a long time, though less\nthan the time before. Then he rose, and went down into sajda. When he\nhad finished he said what Allah willed him to say, and then he told\nthem to seek protection for themselves from the punishment of the\ngrave.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ يَهُودِيَّةً جَاءَتْ تَسْأَلُهَا فَقَالَتْ أَعَاذَكِ اللَّهُ مِنْ عَذَابِ الْقَبْرِ ‏.‏ فَسَأَلَتْ عَائِشَةُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَيُعَذَّبُ النَّاسُ فِي قُبُورِهِمْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَائِذًا بِاللَّهِ مِنْ ذَلِكَ ثُمَّ رَكِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ غَدَاةٍ مَرْكَبًا فَخَسَفَتِ الشَّمْسُ فَرَجَعَ ضُحًى فَمَرَّ بَيْنَ ظَهْرَانَىِ الْحُجَرِ ثُمَّ قَامَ يُصَلِّي وَقَامَ النَّاسُ وَرَاءَهُ فَقَامَ قِيَامًا طَوِيلاً ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلاً وَهُوَ دُونَ الْقِيَامِ الأَوَّلِ ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً وَهُوَ دُونَ الرُّكُوعِ الأَوَّلِ ثُمَّ رَفَعَ فَسَجَدَ ثُمَّ قَامَ قِيَامًا طَوِيلاً وَهُوَ دُونَ الْقِيَامِ الأَوَّلِ ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً وَهُوَ دُونَ الرُّكُوعِ الأَوَّلِ ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلاً وَهُوَ دُونَ الْقِيَامِ الأَوَّلِ ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً وَهُوَ دُونَ الرُّكُوعِ الأَوَّلِ ثُمَّ رَفَعَ ثُمَّ سَجَدَ ثُمَّ انْصَرَفَ فَقَالَ مَا شَاءَ اللَّهُ أَنْ يَقُولَ ثُمَّ أَمَرَهُمْ أَنْ يَتَعَوَّذُوا مِنْ عَذَابِ الْقَبْرِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Yahya ibn Said daripada 'Amra bint Abd ar-Rahman daripada A'isha, isteri Nabi Muhammad SAW, bahawa seorang wanita Yahudi datang meminta-minta kepadanya dan berkata, \"Semoga Allah melindungimu daripada azab kubur.\" Maka A'isha bertanya kepada Rasulullah SAW, \"Adakah manusia diazab di dalam kubur mereka?\" Rasulullah SAW berlindung kepada Allah daripada hal itu. Kemudian pada suatu pagi Rasulullah SAW menunggang kenderaan, lalu berlaku gerhana matahari. Baginda kembali pada waktu dhuha dan melalui antara rumah-rumah (isteri-isteri baginda). Kemudian baginda berdiri dan solat, dan orang ramai berdiri di belakang baginda. Baginda berdiri dengan lama, kemudian rukuk dengan lama. Kemudian baginda bangun dan berdiri dengan lama, tetapi kurang daripada berdiri yang pertama, kemudian rukuk dengan lama, tetapi kurang daripada rukuk yang pertama. Kemudian baginda bangun, lalu sujud. Kemudian baginda berdiri dengan lama, tetapi kurang daripada berdiri yang sebelumnya, kemudian rukuk dengan lama, tetapi kurang daripada rukuk yang sebelumnya. Kemudian baginda bangun dan berdiri dengan lama, tetapi kurang daripada berdiri yang sebelumnya, kemudian rukuk dengan lama, tetapi kurang daripada rukuk yang sebelumnya. Kemudian baginda bangun, lalu sujud. Apabila baginda selesai, baginda bersabda apa yang Allah kehendaki untuk baginda sabdakan, kemudian baginda memerintahkan mereka untuk memohon perlindungan untuk diri mereka daripada azab kubur."
  },
  {
    "id": 34632,
    "hadith_number": 454,
    "tajuk_hadith": "Gerhana Matahari, Solat, dan Fitnah Kubur",
    "perawi_melayu": "Malik",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from Fatima\nbint al Mundhir that Asma bint Abi Bakr as-Siddiq said, \"I went to\nA'isha, the wife of the Prophet, may Allah bless him and grant him\npeace, during an eclipse of the sun, and everybody was standing in\nprayer, and she too was standing praying. I said, 'What is everybody\ndoing?'  She pointed towards the sky with her hand and said, 'Glory be\nto Allah.' I said,  'A sign?'  She nodded  'Yes'  with her head.\"\n\n\nShe continued, \"I stood until I had almost fainted, and I began to\npour water over my head. The Messenger of Allah, may Allah bless him\nand grant him peace, praised Allah and spoke well of Him, and then\nsaid, 'There is nothing which I had previously not seen beforehand\nthat I have not now seen while standing - even the Garden and the\nFire. It has been revealed to me that you will be tried in your graves\nwith a trial, like, or near to, the trial of the Dajjal (I do not know\nwhich one Asma said). Every one of you will have someone who comes to\nhim and asks him, 'What do you know about this man?' A mumin, or one\nwho has certainty (muqin)  (I do not know which one Asma said), will\nsay, 'He is Muhammad, the Messenger of Allah, may Allah bless him and\ngrant him peace, who came to us with clear proofs and guidance, and we\nanswered and believed and followed.' He will then be told, 'Sleep in a\ngood state. We know now that you were a mumin.' A hypocrite, however,\nor one who has doubts (l do not know which one Asma said), will say,\n'I do not know, I heard everybody saying something and I said it.' \"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ الصِّدِّيقِ، أَنَّهَا قَالَتْ أَتَيْتُ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم حِينَ خَسَفَتِ الشَّمْسُ فَإِذَا النَّاسُ قِيَامٌ يُصَلُّونَ وَإِذَا هِيَ قَائِمَةٌ تُصَلِّي فَقُلْتُ مَا لِلنَّاسِ فَأَشَارَتْ بِيَدِهَا نَحْوَ السَّمَاءِ وَقَالَتْ سُبْحَانَ اللَّهِ ‏.‏ فَقُلْتُ آيَةٌ فَأَشَارَتْ بِرَأْسِهَا أَنْ نَعَمْ ‏.‏ قَالَتْ فَقُمْتُ حَتَّى تَجَلاَّنِي الْغَشْىُ وَجَعَلْتُ أَصُبُّ فَوْقَ رَأْسِي الْمَاءَ فَحَمِدَ اللَّهَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏\n\"‏ مَا مِنْ شَىْءٍ كُنْتُ لَمْ أَرَهُ إِلاَّ قَدْ رَأَيْتُهُ فِي مَقَامِي هَذَا حَتَّى الْجَنَّةُ وَالنَّارُ وَلَقَدْ أُوحِيَ إِلَىَّ أَنَّكُمْ تُفْتَنُونَ فِي الْقُبُورِ مِثْلَ - أَوْ قَرِيبًا - مِنْ فِتْنَةِ الدَّجَّالِ - لاَ أَدْرِي أَيَّتَهُمَا قَالَتْ أَسْمَاءُ - يُؤْتَى أَحَدُكُمْ فَيُقَالُ لَهُ مَا عِلْمُكَ بِهَذَا الرَّجُلِ فَأَمَّا الْمُؤْمِنُ - أَوِ الْمُوقِنُ لاَ أَدْرِي أَىَّ ذَلِكَ قَالَتْ أَسْمَاءُ - فَيَقُولُ هُوَ مُحَمَّدٌ رَسُولُ اللَّهِ جَاءَنَا بِالْبَيِّنَاتِ وَالْهُدَى فَأَجَبْنَا وَآمَنَّا وَاتَّبَعْنَا فَيُقَالُ لَهُ نَمْ صَالِحًا قَدْ عَلِمْنَا إِنْ كُنْتَ لَمُؤْمِنًا وَأَمَّا الْمُنَافِقُ - أَوِ الْمُرْتَابُ لاَ أَدْرِي أَيَّتَهُمَا قَالَتْ أَسْمَاءُ - فَيَقُولُ لاَ أَدْرِي سَمِعْتُ النَّاسَ يَقُولُونَ شَيْئًا فَقُلْتُهُ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Hisham ibn Urwa daripada Fatima binti al-Mundhir bahawa Asma' binti Abi Bakr as-Siddiq berkata, \"Aku pergi kepada A'isha, isteri Nabi ﷺ, ketika berlaku gerhana matahari, dan semua orang berdiri solat, dan dia juga berdiri solat. Aku bertanya, 'Apa yang sedang dilakukan oleh orang ramai?' Dia menunjuk ke arah langit dengan tangannya dan berkata, 'Subhanallah.' Aku bertanya, 'Tanda?' Dia mengangguk 'Ya' dengan kepalanya.\"\n\nDia menyambung, \"Aku berdiri sehingga aku hampir pengsan, dan aku mula menuangkan air ke atas kepalaku. Rasulullah ﷺ memuji Allah dan menyebut kebaikan-Nya, kemudian bersabda, 'Tidak ada sesuatu pun yang belum pernah aku lihat sebelum ini melainkan aku telah melihatnya sekarang ketika aku berdiri ini - bahkan Syurga dan Neraka. Sesungguhnya telah diwahyukan kepadaku bahawa kamu akan diuji di dalam kubur kamu dengan ujian, seperti, atau hampir dengan, fitnah Dajjal (aku tidak tahu yang mana satu Asma' katakan). Setiap seorang daripada kamu akan didatangi oleh seseorang yang bertanya kepadanya, 'Apa yang kamu tahu tentang lelaki ini?' Seorang mukmin, atau orang yang mempunyai keyakinan (muqin) (aku tidak tahu yang mana satu Asma' katakan), akan berkata, 'Dia adalah Muhammad, Rasulullah ﷺ, yang datang kepada kami dengan bukti yang jelas dan petunjuk, dan kami menjawab dan beriman dan mengikutinya.' Dia kemudian akan diberitahu, 'Tidurlah dalam keadaan baik. Kami tahu sekarang bahawa kamu adalah seorang mukmin.' Seorang munafik, bagaimanapun, atau orang yang mempunyai keraguan (aku tidak tahu yang mana satu Asma' katakan), akan berkata, 'Aku tidak tahu, aku mendengar orang ramai mengatakan sesuatu dan aku mengatakannya.'\""
  }
]