[
  {
    "id": 35901,
    "hadith_number": 1723,
    "tajuk_hadith": "Doa Keselamatan dan Kemakmuran untuk Orang Madinah",
    "perawi_melayu": "",
    "english_text": "Yahya ibn Yahya related to me from Ishaq ibn Abdullah ibn Abi\nTalha al-Ansari from Anas ibn Malik that the Messenger of Allah, may\nAllah bless him and grant him peace, said, \"O Allah! Bless them in\ntheir measure, and bless them in their sa and mudd.\" He meant the\npeople of Madinah.",
    "arabic_text": "وَحَدَّثَنِي يَحْيَى بْنُ يَحْيَى، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ الأَنْصَارِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ اللَّهُمَّ بَارِكْ لَهُمْ فِي مِكْيَالِهِمْ وَبَارِكْ لَهُمْ فِي صَاعِهِمْ وَمُدِّهِمْ ‏\"‏ ‏.‏ يَعْنِي أَهْلَ الْمَدِينَةِ ‏.‏",
    "malay_translation": "Yahya bin Yahya meriwayatkan daripada Ishaq bin Abdullah bin Abi Talha al-Ansari, daripada Anas bin Malik bahawa Rasulullah SAW bersabda, \"Ya Allah, berkatilah mereka dalam sukatan mereka, dan berkatilah mereka dalam sa dan mudd mereka.\"  Maksudnya adalah penduduk Madinah."
  },
  {
    "id": 35902,
    "hadith_number": 1724,
    "tajuk_hadith": "Doa untuk Berkat Rezeki dan Kemakmuran",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Suhayl ibn Abi Salih from his\nfather that Abu Hurayra said, \"When people saw the first fruits of the\nseason, they brought them to the Messenger of Allah, may Allah bless\nhim and grant him peace. The Messenger of Allah, may Allah bless him\nand grant him peace, took them and said, 'O Allah! Bless us in our\nfruits. Bless us in our city. Bless us in our sa and bless us in our\nmudd. O Allah! Ibrahim is Your slave, Your Khalil and Your Prophet. I\nam Your slave and Your Prophet. He prayed to You for Makka. I pray to\nYou for Madina for the like of what He prayed to You for Makka, and\nthe like of it with it.' Then he called the smallest child he saw and\ngave him the fruits.\"",
    "arabic_text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ كَانَ النَّاسُ إِذَا رَأَوْا أَوَّلَ الثَّمَرِ جَاءُوا بِهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَإِذَا أَخَذَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ اللَّهُمَّ بَارِكْ لَنَا فِي ثَمَرِنَا وَبَارِكْ لَنَا فِي مَدِينَتِنَا وَبَارِكْ لَنَا فِي صَاعِنَا وَبَارِكْ لَنَا فِي مُدِّنَا اللَّهُمَّ إِنَّ إِبْرَاهِيمَ عَبْدُكَ وَخَلِيلُكَ وَنَبِيُّكَ وَإِنِّي عَبْدُكَ وَنَبِيُّكَ وَإِنَّهُ دَعَاكَ لِمَكَّةَ وَإِنِّي أَدْعُوكَ لِلْمَدِينَةِ بِمِثْلِ مَا دَعَاكَ بِهِ لِمَكَّةَ وَمِثْلِهِ مَعَهُ ‏\"‏ ‏.‏ ثُمَّ يَدْعُو أَصْغَرَ وَلِيدٍ يَرَاهُ فَيُعْطِيهِ ذَلِكَ الثَّمَرَ ‏.‏",
    "malay_translation": "Diceritakan oleh Yahya dari Malik, daripada Suhayl bin Abi Salih daripada bapanya, daripada Abu Hurairah bahawa, \"Apabila orang ramai melihat hasil tuaian pertama, mereka membawanya kepada Rasulullah SAW.  Apabila Rasulullah SAW mengambilnya, baginda berdoa, 'Ya Allah, berkatilah hasil-hasil kami. Berkatilah kota kami. Berkatilah sa' dan mudd kami. Ya Allah, sesungguhnya Ibrahim adalah hamba-Mu, kekasih-Mu dan Nabi-Mu. Dan aku adalah hamba-Mu dan Nabi-Mu.  Sesungguhnya dia (Ibrahim) memohon kepada-Mu untuk Makkah. Dan aku memohon kepada-Mu untuk Madinah dengan keistimewaan yang sama yang dipohonnya untuk Makkah dan seperti itu dengannya.' Kemudian baginda memanggil anak kecil yang paling kecil yang dilihatnya dan memberikan buah-buahan itu kepadanya.\""
  },
  {
    "id": 35903,
    "hadith_number": 1725,
    "tajuk_hadith": "Sabar dalam Kesusahan dan Kesukaran di Madinah",
    "perawi_melayu": "Yahya, daripada Malik, daripada Qatan bin Wahb bin Umayr bin al-Ajda, daripada Yuhannas, hamba kepada az-Zubayr bin al-Awwam",
    "english_text": "Yahya related to me from Malik from Qatan ibn Wahb ibn Umayr ibn\nal-Ajda that Yuhannas, the mawla of az-Zubayr ibn al-Awwam informed\nhim that he was sitting with Abdullah ibn Umar during the troubles (at\nthe time of al-Hajaj ibn Yusuf) . A female mawla of his came and\ngreeted him. She said, \"I want to leave, Abu Abd ar-Rahman. The time\nis harsh for us.\" Abdullah ibn Umar said to her, \"Sit down, O you with\nlittle knowledge, for I have heard the Messenger of Allah, may Allah\nbless him and grant him peace, say, 'No one will be patient in hunger\nand hardship in it (Madina) except that I will be a witness or\nintercede for him on the Day of Rising.' \"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ قَطَنِ بْنِ وَهْبِ بْنِ عُمَيْرِ بْنِ الأَجْدَعِ، أَنْ يُحَنَّسَ، مَوْلَى الزُّبَيْرِ بْنِ الْعَوَّامِ أَخْبَرَهُ أَنَّهُ، كَانَ جَالِسًا عِنْدَ عَبْدِ اللَّهِ بْنِ عُمَرَ فِي الْفِتْنَةِ فَأَتَتْهُ مَوْلاَةٌ لَهُ تُسَلِّمُ عَلَيْهِ فَقَالَتْ إِنِّي أَرَدْتُ الْخُرُوجَ يَا أَبَا عَبْدِ الرَّحْمَنِ اشْتَدَّ عَلَيْنَا الزَّمَانُ ‏.‏ فَقَالَ لَهَا عَبْدُ اللَّهِ بْنُ عُمَرَ اقْعُدِي لُكَعُ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ يَصْبِرُ عَلَى لأْوَائِهَا وَشِدَّتِهَا أَحَدٌ إِلاَّ كُنْتُ لَهُ شَفِيعًا أَوْ شَهِيدًا يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Qatan bin Wahb bin Umayr bin al-Ajda, bahawa Yuhannas, hamba kepada az-Zubayr bin al-Awwam memberitahunya bahawa beliau sedang duduk bersama Abdullah bin Umar ketika berlaku fitnah (pada zaman al-Hajjaj bin Yusuf). Seorang hamba perempuannya datang dan memberi salam kepadanya. Wanita itu berkata, \"Saya ingin keluar, wahai Abu Abd ar-Rahman. Zaman ini sangat keras ke atas kita.\" Abdullah bin Umar berkata kepadanya, \"Duduklah, wahai kamu yang sedikit pengetahuan, kerana aku telah mendengar Rasulullah SAW bersabda, 'Tidak ada sesiapa yang bersabar terhadap kesusahan dan penderitaan di Madinah ini melainkan aku akan menjadi saksi atau pemberi syafaat baginya pada Hari Kiamat.'\""
  },
  {
    "id": 35904,
    "hadith_number": 1726,
    "tajuk_hadith": "Ketabahan dan Penyucian Diri di Madinah",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Muhammad ibn al-Munkadir from\nJabir ibn Abdullah that a Bedouin took an oath of allegiance in Islam\nwith the Messenger of Allah, may Allah bless him and grant him peace.\nA fever befell the Bedouin at Madina. He came to the Messenger of\nAllah, and said, \"Messenger of Allah, release me from my pledge.\" The\nMessenger of Allah, may Allah bless him and grant him peace, refused.\nThen he came to him again and said, \"Release me from my pledge.\" The\nMessenger of Allah may Allah bless him and grant him peace, refused.\nThen he came again and said, \"Release me from my pledge.\" He refused.\nThen he came again and said, \"Release me from my pledge.\" He refused.\nThe Bedouin left and the Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"Madina is like the blacksmith's furnace. It\nremoves the impurities and purifies the good.\"",
    "arabic_text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ أَعْرَابِيًّا، بَايَعَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى الإِسْلاَمِ فَأَصَابَ الأَعْرَابِيَّ وَعْكٌ بِالْمَدِينَةِ فَأَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَقِلْنِي بَيْعَتِي ‏.‏ فَأَبَى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ جَاءَهُ فَقَالَ أَقِلْنِي بَيْعَتِي ‏.‏ فَأَبَى ثُمَّ جَاءَهُ فَقَالَ أَقِلْنِي بَيْعَتِي ‏.‏ فَأَبَى فَخَرَجَ الأَعْرَابِيُّ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّمَا الْمَدِينَةُ كَالْكِيرِ تَنْفِي خَبَثَهَا وَيَنْصَعُ طِيبُهَا ‏\"‏ ‏.‏",
    "malay_translation": "Dikisahkan oleh Yahya daripada Malik daripada Muhammad bin al-Munkadir daripada Jabir bin Abdullah bahawa seorang pengembara padang pasir telah berbai'ah di atas Islam dengan Rasulullah SAW. Kemudian, pengembara itu ditimpa demam di Madinah. Lalu, dia mendatangi Rasulullah SAW dan berkata, \"Ya Rasulullah, lepaskanlah aku daripada bai'ahku.\" Rasulullah SAW menolak. Kemudian, dia datang lagi dan berkata, \"Lepaskanlah aku daripada bai'ahku.\" Rasulullah SAW tetap menolak. Kemudian, dia datang lagi dan berkata, \"Lepaskanlah aku daripada bai'ahku.\" Rasulullah SAW tetap menolak. Kemudian, dia datang lagi dan berkata, \"Lepaskanlah aku daripada bai'ahku.\" Rasulullah SAW tetap menolak. Akhirnya, pengembara itu pergi dan Rasulullah SAW bersabda, \"Sesungguhnya Madinah ibarat dapur tukang besi. Ia mengeluarkan kotoran dan menyucikan yang baik.\" "
  },
  {
    "id": 35905,
    "hadith_number": 1727,
    "tajuk_hadith": "Madinah: Kota Yang Menghapuskan Orang Jahat",
    "perawi_melayu": "Malik meriwayatkan daripada Yahya bin Said, yang berkata, beliau mendengar Abu al-Hubab Said bin Yasar berkata, beliau mendengar Abu Hurairah berkata, beliau mendengar Rasulullah SAW bersabda:",
    "english_text": "Malik related to me that Yahya ibn Said said, \"I heard\nAbu'l-Hubab Said ibn Yasar say that he heard Abu Hurayra say that he\nheard the Messenger of Allah, may Allah bless him and grant him peace,\nsay, 'I was ordered to a town which will eat up towns. They used to\nsay, 'Yathrib,' but it is Madina. It removes the bad people like the\nblacksmith's furnace removes impurities from the iron.' \"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ سَمِعْتُ أَبَا الْحُبَابِ، سَعِيدَ بْنَ يَسَارٍ يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ أُمِرْتُ بِقَرْيَةٍ تَأْكُلُ الْقُرَى يَقُولُونَ يَثْرِبُ ‏.‏ وَهِيَ الْمَدِينَةُ تَنْفِي النَّاسَ كَمَا يَنْفِي الْكِيرُ خَبَثَ الْحَدِيدِ ‏\"‏ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Yahya bin Said, yang berkata, \"Aku mendengar Abu al-Hubab Said bin Yasar berkata, aku mendengar Abu Hurairah berkata, aku mendengar Rasulullah SAW bersabda, 'Aku diutuskan kepada sebuah kota yang akan menelan kota-kota lain. Mereka menyebutnya Yathrib, tetapi ia adalah Madinah. Ia menolak orang-orang jahat seperti dapur tukang besi menolak kotoran dari besi.'"
  },
  {
    "id": 35906,
    "hadith_number": 1728,
    "tajuk_hadith": "Ganjaran Allah kepada Mereka yang Meninggalkan Madinah",
    "perawi_melayu": "",
    "english_text": "Malik meriwayatkan kepada saya daripada Hisham bin Urwa daripada bapanya bahawa Rasulullah SAW bersabda, \"Tidaklah seseorang meninggalkan Madinah kerana ingin tinggal di tempat lain melainkan Allah akan menggantikannya dengan sesuatu yang lebih baik daripada dirinya.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَخْرُجُ أَحَدٌ مِنَ الْمَدِينَةِ رَغْبَةً عَنْهَا إِلاَّ أَبْدَلَهَا اللَّهُ خَيْرًا مِنْهُ ‏\"‏ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Hisham bin Urwa daripada bapanya bahawa Rasulullah SAW bersabda, \"Tidaklah sesiapa meninggalkan Madinah kerana ingin tinggal di tempat lain melainkan Allah akan menggantikannya dengan sesuatu yang lebih baik daripada dirinya.\" "
  },
  {
    "id": 35907,
    "hadith_number": 1729,
    "tajuk_hadith": "Penaklukan Yaman, Syam, dan Iraq serta Nasihat Madinah",
    "perawi_melayu": "Malik daripada Hisham bin Urwa daripada bapanya daripada Abdullah bin az-Zubayr daripada Sufyan bin Abi Zuhayr",
    "english_text": "Malik related to me from Hisham ibn Urwa from his father from\nAbdullah ibn az-Zubayr that Sufyan ibn Abi Zuhayr said, \"I heard the\nMessenger of Allah, may Allah bless him and grant him peace, say,\n'Yemen will be conquered and the people will be attracted to it,\ntaking their families and whoever obeys them. Madina would have been\nbetter for them, had they but known. Ash-Sham will be conquered and\npeople will be attracted to it, taking their families and whoever\nobeys them. Madina would have been better for them, had they but\nknown. Iraq will be conquered and people will be attracted to it,\ntaking their families and whoever obeys them. Madina would have been\nbetter for them, had they but known.' \"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ سُفْيَانَ بْنِ أَبِي زُهَيْرٍ، أَنَّهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ تُفْتَحُ الْيَمَنُ فَيَأْتِي قَوْمٌ يَبِسُّونَ فَيَتَحَمَّلُونَ بِأَهْلِيهِمْ وَمَنْ أَطَاعَهُمْ وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ وَتُفْتَحُ الشَّامُ فَيَأْتِي قَوْمٌ يَبِسُّونَ فَيَتَحَمَّلُونَ بِأَهْلِيهِمْ وَمَنْ أَطَاعَهُمْ وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ وَتُفْتَحُ الْعِرَاقُ فَيَأْتِي قَوْمٌ يَبِسُّونَ فَيَتَحَمَّلُونَ بِأَهْلِيهِمْ وَمَنْ أَطَاعَهُمْ وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ ‏\"‏ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Hisham bin Urwa daripada bapanya daripada Abdullah bin az-Zubayr daripada Sufyan bin Abi Zuhayr, yang berkata: \"Aku mendengar Rasulullah SAW bersabda:\n\"Yaman akan ditakluk, lalu datang suatu kaum yang berhijrah ke sana membawa keluarga dan siapa sahaja yang menurutinya. Madinah lebih baik untuk mereka sekiranya mereka mengetahuinya. Syam akan ditakluk, lalu datang suatu kaum yang berhijrah ke sana membawa keluarga dan siapa sahaja yang menurutinya. Madinah lebih baik untuk mereka sekiranya mereka mengetahuinya. Iraq akan ditakluk, lalu datang suatu kaum yang berhijrah ke sana membawa keluarga dan siapa sahaja yang menurutinya. Madinah lebih baik untuk mereka sekiranya mereka mengetahuinya.\""
  },
  {
    "id": 35908,
    "hadith_number": 1730,
    "tajuk_hadith": "Nasib Madinah dan Kedatangan Binatang Liar",
    "perawi_melayu": "Yahya dari Malik daripada Ibn Himas daripada pakciknya daripada Abu Hurairah",
    "english_text": "Yahya related to me from Malik from Ibn Himas from his paternal\nuncle from Abu Hurayra that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Madina will be left in the best way\nthat it is until a dog or wolf enters it and urinates on one of the\npillars of the mosque or on the mimbar.\" They asked, \"Messenger of\nAllah! Who will have the fruit at that time?\" He replied, \"Animals\nseeking food, birds and wild beasts.\"",
    "arabic_text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ حِمَاسٍ، عَنْ عَمِّهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لَتُتْرَكَنَّ الْمَدِينَةُ عَلَى أَحْسَنِ مَا كَانَتْ حَتَّى يَدْخُلَ الْكَلْبُ  أَوِ الذِّئْبُ فَيُغَذِّي عَلَى بَعْضِ سَوَارِي الْمَسْجِدِ أَوْ عَلَى الْمِنْبَرِ ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ فَلِمَنْ تَكُونُ الثِّمَارُ ذَلِكَ الزَّمَانَ قَالَ ‏\"‏ لِلْعَوَافِي الطَّيْرِ وَالسِّبَاعِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Ibn Himas daripada pakciknya daripada Abu Hurairah bahawa Rasulullah SAW bersabda, \"Madinah akan ditinggalkan dalam keadaan sebaik-baiknya sehinggalah seekor anjing atau serigala masuk ke dalamnya dan kencing di atas salah satu tiang masjid atau mimbar.\" Mereka bertanya, \"Wahai Rasulullah! Siapakah yang akan menikmati hasil pada masa itu?\" Baginda menjawab, \"Haiwan yang mencari makanan, burung dan binatang buas.\""
  },
  {
    "id": 35909,
    "hadith_number": 1731,
    "tajuk_hadith": "Tangisan Umar bin Abdul Aziz dan Kerisauan tentang Madinah",
    "perawi_melayu": "",
    "english_text": "Malik related to me that he had heard that when Umar ibn Abd al-\nAziz left Madina, he turned towards it and wept. Then he said, \"O\nMuzahim! Do you fear that we might be among those that Madina casts\noff?\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، حِينَ خَرَجَ مِنَ الْمَدِينَةِ الْتَفَتَ إِلَيْهَا فَبَكَى ثُمَّ قَالَ يَا مُزَاحِمُ أَتَخْشَى أَنْ نَكُونَ مِمَّنْ نَفَتِ الْمَدِينَةُ",
    "malay_translation": "Malik meriwayatkan kepadaku bahawa dia mendengar bahawa apabila Umar bin Abdul Aziz meninggalkan Madinah, dia menoleh ke arahnya dan menangis. Kemudian dia berkata, \"Wahai Muzahim! Adakah engkau khuatir kita termasuk di antara mereka yang dijauhkan oleh Madinah?"
  },
  {
    "id": 35910,
    "hadith_number": 1732,
    "tajuk_hadith": "Percintaan Bukit Uhud dan Penetapan Tanah Haram Madinah",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Amr, the mawla of al-Muttalib\nfrom Anas ibn Malik that the Messenger of Allah, may Allah bless him\nand grant him peace, saw Uhud and said, \"This is a mountain which\nloves us and we love it. O Allah! Ibrahim made Makka Haram, and I will\nmake what is between the two tracts of black stones (in Madina) a\nHaram.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَمْرٍو، مَوْلَى الْمُطَّلِبِ عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم طَلَعَ لَهُ أُحُدٌ فَقَالَ ‏\n\"‏ هَذَا جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ اللَّهُمَّ إِنَّ إِبْرَاهِيمَ حَرَّمَ مَكَّةَ وَأَنَا أُحَرِّمُ مَا بَيْنَ لاَبَتَيْهَا ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Amr, mawla al-Muttalib, dari Anas bin Malik bahawa Rasulullah SAW melihat Bukit Uhud lalu bersabda, “Inilah gunung yang mencintai kita dan kita mencintainya. Ya Allah, sesungguhnya Ibrahim telah menjadikan Mekah sebagai tanah haram, dan aku menjadikan kawasan di antara dua batu hitam (di Madinah) sebagai tanah haram.”"
  },
  {
    "id": 35911,
    "hadith_number": 1733,
    "tajuk_hadith": "Larangan Mengganggu Binatang di Madinah dan Keabadian Haram di Antara Dua Batu Hitam",
    "perawi_melayu": "Malik daripada Ibn Shihab, daripada Said ibn al-Musayyab, daripada Abu Hurairah",
    "english_text": "Malik related to me from Ibn Shihab from Said ibn al-Musayyab\nthat Abu Hurayra said, \"Had I seen a gazelle at Madina, I would have\nleft it to graze and would not have frightened it. The Messenger of\nAllah, may Allah bless him and grant him peace, said, 'What is between\nthe two tracts of black stones is a Haram.' \"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ كَانَ يَقُولُ لَوْ رَأَيْتُ الظِّبَاءَ بِالْمَدِينَةِ تَرْتَعُ مَا ذَعَرْتُهَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا بَيْنَ لاَبَتَيْهَا حَرَامٌ ‏\"‏ ‏.‏",
    "malay_translation": "Malik meriwayatkan dari Ibn Shihab, dari Said ibn al-Musayyab, dari Abu Hurairah, bahawa dia (Abu Hurairah) berkata, \"Sekiranya aku melihat rusa-rusa betina di Madinah sedang meragut rumput, aku tidak akan menakutkannya. Rasulullah SAW bersabda, 'Antara dua batas batu hitam itu adalah kawasan yang diharamkan.'"
  },
  {
    "id": 35912,
    "hadith_number": 1734,
    "tajuk_hadith": "Larangan Menyakiti Binatang di Tanah Haram Rasulullah SAW",
    "perawi_melayu": "Malik, daripada Yunus bin Yusuf, daripada Ata bin Yasar, daripada Abu Ayyub al-Ansari",
    "english_text": "Malik related to me from Yunus ibn Yusuf from Ata ibn Yasar that\nAbu Ayyub al-Ansari found some boys who had driven a fox into a\ncorner, and he chased them away from it.\n\n\nMalik said, \"I only\nknow that he said, 'Is this done in the Haram of the Messenger of\nAllah, may Allah bless him and grant him peace?' \"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ يُونُسَ بْنِ يُوسُفَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي أَيُّوبَ الأَنْصَارِيِّ، أَنَّهُ وَجَدَ غِلْمَانًا قَدْ أَلْجَئُوا ثَعْلَبًا إِلَى زَاوِيَةٍ فَطَرَدَهُمْ عَنْهُ ‏.‏ قَالَ مَالِكٌ لاَ أَعْلَمُ إِلاَّ أَنَّهُ قَالَ أَفِي حَرَمِ رَسُولِ اللَّهِ صلى الله عليه وسلم يُصْنَعُ هَذَا",
    "malay_translation": "Malik meriwayatkan dari Yunus bin Yusuf, daripada Ata bin Yasar, daripada Abu Ayyub al-Ansari, bahawa beliau mendapati beberapa budak lelaki yang telah mengusir seekor rubah ke dalam satu sudut, lalu mereka mengusirnya. Malik berkata, \"Aku hanya tahu bahawa beliau berkata, 'Adakah perbuatan ini dilakukan di dalam Tanah Haram Rasulullah SAW?'"
  },
  {
    "id": 35913,
    "hadith_number": 1735,
    "tajuk_hadith": "Perbuatan Baik Sayyidina Zaid bin Tsabit Membebaskan Burung",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from a man who said, \"Zayd ibn\nThabit came across me while I was at al-Aswaf (on the outskirts of\nMadina). I had captured a hawk. He took it from my hands and set it\nfree.\"",
    "arabic_text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ رَجُلٍ، قَالَ دَخَلَ عَلَىَّ زَيْدُ بْنُ ثَابِتٍ وَأَنَا بِالأَسْوَافِ، قَدِ اصْطَدْتُ نُهَسًا فَأَخَذَهُ مِنْ يَدِي فَأَرْسَلَهُ ‏.‏",
    "malay_translation": "Yahya menceritakan kepadaku daripada Malik, daripada seorang lelaki yang berkata, \"Zaid bin Tsabit menemui aku di Aswaf (di pinggir Madinah). Aku telah menangkap seekor burung hantu. Beliau mengambilnya dari tanganku dan melepaskannya."
  },
  {
    "id": 35914,
    "hadith_number": 1736,
    "tajuk_hadith": "Doa Rasulullah SAW Agar Madinah Menjadi Kota Yang Dicintai dan Bebas Penyakit",
    "perawi_melayu": "Yahya daripada Malik daripada Hisham bin Urwah daripada bapanya daripada Aisyah, Ummul Mukminin",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that A'isha, umm al-muminin said, \"When the Messenger of Allah,\nmay Allah bless him and grant him peace, came to Madina, Abu Bakr and\nBilal came down with a fever. I visited them and said, 'Father, how\nare you? Bilal, how are you?'\" She continued, \"When Abu Bakr's fever\nworsened he would say, 'Every man is struck down among his people in\nthe morning - death is nearer than the strap of his sandal.'\"\n\n\nWhen it left Bilal, he raised his voice and said, 'Would that I knew\nwhether I will spend a night at the valley of Makka with the idhkhir\nherb and jalil herb around me. Will I go one day to the waters of\nMajinna? Will the mountains of Shama and Tafil appear to me?' \" '\n\n\nA'isha continued, \"I went to the Messenger of Allah, may Allah\nbless him and grant him peace, and informed him. He said, 'O Allah!\nMake us love Madina as much as we love Makka or even more. Make it\nsound and bless us in our sa and mudd. Remove its fever and put it in\nal-Juhfa.' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّهَا قَالَتْ لَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ وُعِكَ أَبُو بَكْرٍ وَبِلاَلٌ - قَالَتْ - فَدَخَلْتُ عَلَيْهِمَا فَقُلْتُ يَا أَبَتِ كَيْفَ تَجِدُكَ وَيَا بِلاَلُ كَيْفَ تَجِدُكَ قَالَتْ فَكَانَ أَبُو بَكْرٍ إِذَا أَخَذَتْهُ الْحُمَّى يَقُولُ كُلُّ امْرِئٍ مُصَبَّحٌ فِي أَهْلِهِ وَالْمَوْتُ أَدْنَى مِنْ شِرَاكِ نَعْلِهِ وَكَانَ بِلاَلٌ إِذَا أُقْلِعَ عَنْهُ يَرْفَعُ عَقِيرَتَهُ فَيَقُولُ أَلاَ لَيْتَ شِعْرِي هَلْ أَبِيتَنَّ لَيْلَةً بِوَادٍ وَحَوْلِي إِذْخِرٌ وَجَلِيلُ وَهَلْ أَرِدَنْ يَوْمًا مِيَاهَ مَجَنَّةٍ وَهَلْ يَبْدُوَنْ لِي شَامَةٌ وَطَفِيلُ قَالَتْ عَائِشَةُ فَجِئْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَخْبَرْتُهُ فَقَالَ ‏\n\"‏ اللَّهُمَّ حَبِّبْ إِلَيْنَا الْمَدِينَةَ كَحُبِّنَا مَكَّةَ أَوْ أَشَدَّ وَصَحِّحْهَا وَبَارِكْ لَنَا فِي صَاعِهَا وَمُدِّهَا وَانْقُلْ حُمَّاهَا فَاجْعَلْهَا بِالْجُحْفَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku (Yahya) dari Malik daripada Hisham bin Urwah daripada bapanya daripada Aisyah, Ummul Mukminin, bahawa beliau berkata, \"Apabila Rasulullah SAW datang ke Madinah, Abu Bakar dan Bilal ditimpa demam.  Saya melawat mereka dan bertanya, 'Wahai bapa, bagaimana keadaanmu? Wahai Bilal, bagaimana keadaanmu?'\"  Beliau meneruskan, \"Apabila demam Abu Bakar bertambah teruk, dia akan berkata, 'Setiap orang pasti akan ditimpa kematian di kalangan kaumnya pada pagi hari; kematian itu lebih dekat daripada tali kasutnya.'\"  Apabila demam Bilal hilang, dia mengangkat suaranya dan berkata, 'Kiranya aku tahu adakah aku akan bermalam di lembah Mekah dengan tumbuhan idhkhir dan jalil di sekelilingku. Adakah aku akan pergi ke air Majinna suatu hari nanti? Adakah gunung Shama dan Tafil akan kelihatan kepadaku?'\"  Aisyah meneruskan, \"Kemudian aku menghadap Rasulullah SAW dan memberitahunya. Baginda SAW bersabda, 'Ya Allah, jadikanlah Madinah dihati kami sebagaimana kami cintakan Makkah atau lebih kuat lagi.  Jadikanlah ia sihat dan berkatilah rezekinya, baik dalam sa' mahupun mudd. Hapuskanlah penyakit demamnya, dan pindahkanlah ke Al-Juhfa.'"
  },
  {
    "id": 35915,
    "hadith_number": 1737,
    "tajuk_hadith": "Pengalaman Kematian dan Nasib Orang Pengecut",
    "perawi_melayu": "Malik",
    "english_text": "Malik said that Yahya ibn Said had related to him that A'isha\nsaid that Amir ibn Fuhayra had said at the time of the epidemic, \"I\nhave seen death before tasting it, the coward's destination is from\nabove him.\"",
    "arabic_text": "قَالَ مَالِكٌ وَحَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ، أَنَّ عَائِشَةَ، قَالَتْ وَكَانَ عَامِرُ بْنُ فُهَيْرَةَ يَقُولُ قَدْ رَأَيْتُ الْمَوْتَ قَبْلَ ذَوْقِهِ إِنَّ الْجَبَانَ حَتْفُهُ مِنْ فَوْقِهِ ‏.‏",
    "malay_translation": "Malik meriwayatkan bahawa Yahya ibn Said telah menceritakan kepadanya bahawa Aisyah berkata, dan Amir ibn Fuhayra berkata pada masa wabak itu, \"Aku telah melihat kematian sebelum merasainya. Sesungguhnya, kecelakaan orang pengecut datang dari atasnya.\""
  },
  {
    "id": 35916,
    "hadith_number": 1738,
    "tajuk_hadith": "Malaikat Menjaga Madinah daripada Wabak dan Dajjal",
    "perawi_melayu": "Yahya daripada Malik daripada Nuaym bin Abdullah al-Mujmir daripada Abu Hurairah",
    "english_text": "Yahya related to me from Malik from Nuaym ibn Abdullah al-Mujmir\nthat Abu Hurayra said, \"The Messenger of Allah, may Allah bless him\nand grant him peace, said, 'There are angels at the entries of Madina,\nand neither plague nor the Dajjal will enter it.' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمُجْمِرِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ عَلَى أَنْقَابِ الْمَدِينَةِ مَلاَئِكَةٌ لاَ يَدْخُلُهَا الطَّاعُونُ وَلاَ الدَّجَّالُ",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Nuaym bin Abdullah al-Mujmir, daripada Abu Hurairah yang berkata: Rasulullah SAW bersabda, \"Terdapat malaikat di pintu masuk Madinah. Wabak dan Dajjal tidak akan memasukinya.\" "
  },
  {
    "id": 35917,
    "hadith_number": 1739,
    "tajuk_hadith": "Perkataan Rasulullah SAW Mengenai Permusuhan dan Penyatuan Agama",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Ismail ibn Abi Hakim that he\nheard Umar ibn Abd al-Aziz say, \"One of the last things that the\nMessenger of Allah, may Allah bless him and grant him peace, said was,\n'May Allah fight the jews and the christians. They took the graves of\ntheir Prophets as places of prostration . Two deens shall not co-exist\nin the land of the Arabs.' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي حَكِيمٍ، أَنَّهُ سَمِعَ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، يَقُولُ كَانَ مِنْ آخِرِ مَا تَكَلَّمَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ قَالَ ‏\n\"‏ قَاتَلَ اللَّهُ الْيَهُودَ وَالنَّصَارَى اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ لاَ يَبْقَيَنَّ دِينَانِ بِأَرْضِ الْعَرَبِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik daripada Ismail bin Abi Hakim bahawa dia mendengar Umar bin Abdul Aziz berkata, \"Salah satu perkataan terakhir yang diucapkan oleh Rasulullah SAW ialah, 'Semoga Allah memerangi orang Yahudi dan Nasrani. Mereka menjadikan kubur para Nabi mereka sebagai tempat sujud. Tidak akan ada dua agama tinggal di bumi Arab.'\""
  },
  {
    "id": 35918,
    "hadith_number": 1740,
    "tajuk_hadith": "Larangan Dua Agama Bercampur di Semenanjung Arab",
    "perawi_melayu": "Yahya, daripada Malik, daripada Ibn Shihab",
    "english_text": "Yahya related to me from Malik from Ibn Shihab that the Messenger\nof Allah, may Allah bless him and grant him peace, said, \"Two deens\nshall not co-exist in the Arabian Peninsula.\"\n\n\nMalik said that\nIbn Shihab said, ''Umar ibn al-Khattab searched for information about\nthat until he was absolutely convinced that the Messenger of Allah,\nmay Allah bless him and grant him peace, had said, 'Two deens shall\nnot co-exist in the Arabian Peninsula,' and he therefore expelled the\njews from Khaybar.\"\n\n\nMalik said, ''Umar ibn al-Khattab expelled the jews from Najran\n(a jewish settlement in the Yemen) and Fadak (a jewish settlement\nthirty miles from Madina). When the jews of Khaybar left, they did not\ntake any fruit or land. The jews of Fadak took half the fruit and half\nthe land, because the Messenger of Allah, may Allah bless him and\ngrant him peace, had made a settlement with them for that. So Umar\nentrusted to them the value in gold, silver, camels, ropes and saddle\nbags of half the fruit and half the land, and handed the value over to\nthem and expelled them.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَجْتَمِعُ دِينَانِ فِي جَزِيرَةِ الْعَرَبِ ‏\"‏ ‏.‏ قَالَ مَالِكٌ قَالَ ابْنُ شِهَابٍ فَفَحَصَ عَنْ ذَلِكَ عُمَرُ بْنُ الْخَطَّابِ حَتَّى أَتَاهُ الثَّلْجُ وَالْيَقِينُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَجْتَمِعُ دِينَانِ فِي جَزِيرَةِ الْعَرَبِ ‏\"‏ فَأَجْلَى يَهُودَ خَيْبَرَ ‏.‏ قَالَ مَالِكٌ وَقَدْ أَجْلَى عُمَرُ بْنُ الْخَطَّابِ يَهُودَ نَجْرَانَ وَفَدَكَ فَأَمَّا يَهُودُ خَيْبَرَ فَخَرَجُوا مِنْهَا لَيْسَ لَهُمْ مِنَ الثَّمَرِ وَلاَ مِنَ الأَرْضِ شَىْءٌ وَأَمَّا يَهُودُ فَدَكَ فَكَانَ لَهُمْ نِصْفُ الثَّمَرِ وَنِصْفُ الأَرْضِ لأَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ صَالَحَهُمْ عَلَى نِصْفِ الثَّمَرِ وَنِصْفِ الأَرْضِ فَأَقَامَ لَهُمْ عُمَرُ نِصْفَ الثَّمَرِ وَنِصْفَ الأَرْضِ قِيمَةً مِنْ ذَهَبٍ وَوَرِقٍ وَإِبِلٍ وَحِبَالٍ وَأَقْتَابٍ ثُمَّ أَعْطَاهُمُ الْقِيمَةَ وَأَجْلاَهُمْ مِنْهَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, bahawa Rasulullah SAW bersabda, \"Tidak akan wujud dua agama di Semenanjung Arab.\"\n\nMalik berkata, Ibn Shihab berkata lagi, \"Umar al-Khattab mencari maklumat tentang perkara ini sehingga dia yakin bahawa Rasulullah SAW telah bersabda, \"Tidak akan wujud dua agama di Semenanjung Arab.\" Oleh itu, beliau mengusir Yahudi dari Khaibar.\"\n\nMalik berkata lagi, \"Umar al-Khattab telah mengusir Yahudi dari Najran dan Fadak. Adapun Yahudi Khaibar, mereka tidak mengambil apa-apa daripada buah-buahan atau tanah. Namun, Yahudi Fadak mendapat separuh daripada buah-buahan dan separuh daripada tanah kerana Rasulullah SAW telah bersetuju dengan mereka untuk itu. Maka, Umar menyediakan nilai separuh daripada buah-buahan dan separuh daripada tanah dalam emas, perak, unta, tali, dan beg pelana, dan menyerahkannya kepada mereka sebelum mengusir mereka dari situ.\""
  },
  {
    "id": 35919,
    "hadith_number": 1741,
    "tajuk_hadith": "Keindahan Gunung Uhud dan Kasih Sayang Bersama",
    "perawi_melayu": "Yahya meriwayatkan dari Malik, dari Hisham bin Urwa dari bapanya, bahawa Rasulullah SAW melihat Gunung Uhud lalu bersabda, \"Gunung ini mencintai kita dan kita mencintainya.\"",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that the Messenger of Allah, may Allah bless him and grant him\npeace, came in view of Uhud and said, \"This is a mountain which loves\nus and we love it.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم طَلَعَ لَهُ أُحُدٌ فَقَالَ ‏\n\"‏ هَذَا جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Hisham bin Urwa daripada bapanya bahawa Rasulullah SAW melihat Gunung Uhud lalu bersabda, “Inilah gunung yang mencintai kita dan kita mencintainya.”"
  },
  {
    "id": 35920,
    "hadith_number": 1742,
    "tajuk_hadith": "Perbincangan Mengenai Keutamaan Mekah dan Madinah",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said from Abd ar-\nRahman ibn al-Qasim that Aslam, the mawla of Umar ibn al-Khattab\ninformed him that he had visited Abdullah ibn Ayyash al-Makhzumi. He\nsaw that he had some nabidh with him and he was at that moment on the\nway to Makka. Aslam said to him, ''Umar ibn al-Khattab loves this\ndrink.\" Abdullah ibn Ayyash therefore carried a great drinking bowl\nand brought it to Umar ibn al-Khattab and placed it before him. Umar\nbrought it near to him and then raised his head. Umar said, \"This\ndrink is good,\" so he drank some of it and then passed it to a man on\nhis right. When Abdullah turned to go, Umar ibn al-Khattab called him\nand asked, \"Are you the person who says that Makka is better than\nMadina?\" Abdullah said, \"I said that it was the Haram of Allah, and\nHis place of security, and His House was in it.\" Umar said, \"I am not\nsaying anything about the House of Allah or His Haram.\" Then Umar\nrepeated \"Are you the person who says that Makka is better than\nMadina?\" He replied, \"I said that it was the Haram of Allah and His\nplace of security, and His House was in it.\" Umar said, \"I am not\nsaying anything about the House of Allah and His Haram.\" Then Abdullah\nleft.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، أَنَّ أَسْلَمَ، مَوْلَى عُمَرَ بْنِ الْخَطَّابِ أَخْبَرَهُ أَنَّهُ، زَارَ عَبْدَ اللَّهِ بْنَ عَيَّاشٍ الْمَخْزُومِيَّ فَرَأَى عِنْدَهُ نَبِيذًا وَهُوَ بِطَرِيقِ مَكَّةَ فَقَالَ لَهُ أَسْلَمُ إِنَّ هَذَا الشَّرَابَ يُحِبُّهُ عُمَرُ بْنُ الْخَطَّابِ فَحَمَلَ عَبْدُ اللَّهِ بْنُ عَيَّاشٍ قَدَحًا عَظِيمًا فَجَاءَ بِهِ إِلَى عُمَرَ بْنِ الْخَطَّابِ فَوَضَعَهُ فِي يَدَيْهِ فَقَرَّبَهُ عُمَرُ إِلَى فِيهِ ثُمَّ رَفَعَ رَأْسَهُ فَقَالَ عُمَرُ إِنَّ هَذَا لَشَرَابٌ طَيِّبٌ فَشَرِبَ مِنْهُ ثُمَّ نَاوَلَهُ رَجُلاً عَنْ يَمِينِهِ ‏.‏ فَلَمَّا أَدْبَرَ عَبْدُ اللَّهِ نَادَاهُ عُمَرُ بْنُ الْخَطَّابِ فَقَالَ أَأَنْتَ الْقَائِلُ لَمَكَّةُ خَيْرٌ مِنَ الْمَدِينَةِ فَقَالَ عَبْدُ اللَّهِ فَقُلْتُ هِيَ حَرَمُ اللَّهِ وَأَمْنُهُ وَفِيهَا بَيْتُهُ ‏.‏ فَقَالَ عُمَرُ لاَ أَقُولُ فِي بَيْتِ اللَّهِ وَلاَ فِي حَرَمِهِ شَيْئًا ‏.‏ ثُمَّ قَالَ عُمَرُ أَأَنْتَ الْقَائِلُ لَمَكَّةُ خَيْرٌ مِنَ الْمَدِينَةِ قَالَ فَقُلْتُ هِيَ حَرَمُ اللَّهِ وَأَمْنُهُ وَفِيهَا بَيْتُهُ ‏.‏ فَقَالَ عُمَرُ لاَ أَقُولُ فِي حَرَمِ اللَّهِ وَلاَ فِي بَيْتِهِ شَيْئًا ثُمَّ انْصَرَفَ ‏.‏",
    "malay_translation": "Diceritakan oleh Yahya daripada Malik daripada Yahya bin Said daripada Abd al-Rahman bin al-Qasim, bahawa Aslam, hamba Umar al-Khattab, memberitahu bahawa beliau telah melawat Abdullah bin Ayyash al-Makhzumi. Beliau mendapati Abdullah memiliki minuman nabidh ketika dalam perjalanan ke Mekah. Aslam berkata, \"Umar al-Khattab menyukai minuman ini.\" Abdullah bin Ayyash kemudian membawa mangkuk besar dan membawanya kepada Umar al-Khattab lalu meletakkannya di hadapannya. Umar mendekatkan mangkuk itu ke mulutnya, kemudian mengangkat kepalanya. Umar berkata, \"Minuman ini baik,\" lalu meminumnya dan memberikannya kepada seorang lelaki di sebelah kanannya.  Apabila Abdullah hendak pergi, Umar al-Khattab memanggilnya dan bertanya, \"Engkaukah yang mengatakan Mekah lebih baik daripada Madinah?\" Abdullah menjawab, \"Aku berkata Mekah adalah Haram Allah, tempat perlindungan-Nya, dan di dalamnya terdapat Baitullah.\" Umar berkata, \"Aku tidak bermaksud apa-apa mengenai Baitullah atau Haram-Nya.\" Kemudian Umar bertanya lagi, \"Engkaukah yang mengatakan Mekah lebih baik daripada Madinah?\" Abdullah menjawab, \"Aku berkata Mekah adalah Haram Allah, tempat perlindungan-Nya, dan di dalamnya terdapat Baitullah.\" Umar berkata, \"Aku tidak bermaksud apa-apa mengenai Haram Allah dan Baitullah.\" Kemudian Abdullah pergi."
  },
  {
    "id": 35921,
    "hadith_number": 1743,
    "tajuk_hadith": "Keputusan Umar al-Khattab dalam Menghadapi Wabak di Syam",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Abd al-Hamid ibn Abd ar-Rahman ibn Zayd ibn al-Khattab, daripada Abdullah ibn Abdullah ibn al-Harith ibn Nawfal, daripada Abdullah ibn Abbas, bahawa Umar ibn al-Khattab berangkat ke Syam...",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Abd al-Hamid\nibn Abd ar-Rahman ibn Zayd ibn al-Khattab from Abdullah ibn Abdullah\nibn al-Harith ibn Nawfal from Abdullah ibn Abbas that Umar ibn al-\nKhattab set out for ash Sham and when he was at Sargh, near Tabuk, the\ncommanders of the army, Abu Ubayda ibn al-Jarrah and his companions,\nmet him and told him that the plague had broken out in ash-Sham. Ibn\nAbbas said, \"Umar ibn al-Khattab said, 'all the first Muhajir unto\nme.' He assembled them and asked them for advice, informing them that\nthe plague had broken out in ash Sham. They disagreed. Some said, 'You\nhave set out for something, and we do not think that you should leave\nit.' Others said, 'You have the companions of the Prophet, may Allah\nbless him and grant him peace, and the rest of the people with you,\nand we do not think that you should send them towards this plague.'\nUmar said, 'Leave me.'\n\n\nThen he said, 'Summon the Ansar to\nme.' They were summoned and he asked them for advice. They acted as\nthe Muhajirun had and disagreed as they had disagreed. He said, 'Leave\nme.' \"Then he said, 'Summon to me whoever is here of the aged men of\nQuraysh from the Muhajirun of the conquest.' He summoned them and not\none of them differed. They said, 'We think that you should withdraw\nthe people and not send them towards the plague.' Umar called out to\nthe people, 'I am leaving by camel in the morning,' so they set out.\nAbu Ubayda said, 'Is it flight from the decree of Allah?' Umar said,\n'Better that someone other than you had said it, Abu Ubayda. Yes. We\nflee from the decree of Allah to the decree of Allah. What would you\nthink if these camels had gone down into a valley which had two\nslopes, one of them fertile, and the other barren. If you pastured in\nthe fertile part, wouldn't you pasture them by the decree of Allah? If\nyou pastured them in the barren part, wouldn't you pasture them by the\ndecree of Allah?'\n\n\n''Abd ar-Rahman ibn Awf arrived and he had\nbeen off doing something and he said, 'I have some knowledge of this.\nI heard the Messenger of Allah, may Allah bless him and grant him\npeace, say, \"If you hear about it in a land, do not go forward to it.\nIf it comes upon a land and you are in it, then do not depart in\nflight from it.\" ' Umar praised Allah and then set off.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الْحَمِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ زَيْدِ بْنِ الْخَطَّابِ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، خَرَجَ إِلَى الشَّامِ حَتَّى إِذَا كَانَ بِسَرْغَ لَقِيَهُ أُمَرَاءُ الأَجْنَادِ أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ وَأَصْحَابُهُ فَأَخْبَرُوهُ أَنَّ الْوَبَأَ قَدْ وَقَعَ بِأَرْضِ الشَّامِ قَالَ ابْنُ عَبَّاسٍ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ ادْعُ لِي الْمُهَاجِرِينَ الأَوَّلِينَ ‏.‏ فَدَعَاهُمْ فَاسْتَشَارَهُمْ وَأَخْبَرَهُمْ أَنَّ الْوَبَأَ قَدْ وَقَعَ بِالشَّامِ فَاخْتَلَفُوا فَقَالَ بَعْضُهُمْ قَدْ خَرَجْتَ لأَمْرٍ وَلاَ نَرَى أَنْ تَرْجِعَ عَنْهُ ‏.‏ وَقَالَ بَعْضُهُمْ مَعَكَ بَقِيَّةُ النَّاسِ وَأَصْحَابُ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلاَ نَرَى أَنْ تُقْدِمَهُمْ عَلَى هَذَا الْوَبَإِ ‏.‏ فَقَالَ عُمَرُ ارْتَفِعُوا عَنِّي ‏.‏ ثُمَّ قَالَ ادْعُ لِي الأَنْصَارَ فَدَعَوْتُهُمْ فَاسْتَشَارَهُمْ فَسَلَكُوا سَبِيلَ الْمُهَاجِرِينَ وَاخْتَلَفُوا كَاخْتِلاَفِهِمْ فَقَالَ ارْتَفِعُوا عَنِّي ‏.‏ ثُمَّ قَالَ ادْعُ لِي مَنْ كَانَ هَا هُنَا مِنْ مَشْيَخَةِ قُرَيْشٍ مِنْ مُهَاجِرَةِ الْفَتْحِ ‏.‏ فَدَعَوْتُهُمْ فَلَمْ يَخْتَلِفْ عَلَيْهِ مِنْهُمُ اثْنَانِ فَقَالُوا نَرَى أَنْ تَرْجِعَ بِالنَّاسِ وَلاَ تُقْدِمَهُمْ عَلَى هَذَا الْوَبَإِ فَنَادَى عُمَرُ فِي النَّاسِ إِنِّي مُصْبِحٌ عَلَى ظَهْرٍ فَأَصْبِحُوا عَلَيْهِ ‏.‏ فَقَالَ أَبُو عُبَيْدَةَ أَفِرَارًا مِنْ قَدَرِ اللَّهِ فَقَالَ عُمَرُ لَوْ غَيْرُكَ قَالَهَا يَا أَبَا عُبَيْدَةَ نَعَمْ نَفِرُّ مِنْ قَدَرِ اللَّهِ إِلَى قَدَرِ اللَّهِ أَرَأَيْتَ لَوْ كَانَ لَكَ إِبِلٌ فَهَبَطَتْ وَادِيًا لَهُ عُدْوَتَانِ إِحْدَاهُمَا مُخْصِبَةٌ وَالأُخْرَى جَدْبَةٌ أَلَيْسَ إِنْ رَعَيْتَ الْخَصِبَةَ رَعَيْتَهَا بِقَدَرِ اللَّهِ وَإِنْ رَعَيْتَ الْجَدْبَةَ رَعَيْتَهَا بِقَدَرِ اللَّهِ فَجَاءَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ - وَكَانَ غَائِبًا فِي بَعْضِ حَاجَتِهِ - فَقَالَ إِنَّ عِنْدِي مِنْ هَذَا عِلْمًا سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِذَا سَمِعْتُمْ بِهِ بِأَرْضٍ فَلاَ تَقْدَمُوا عَلَيْهِ وَإِذَا وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلاَ تَخْرُجُوا فِرَارًا مِنْهُ ‏\"‏ ‏.‏ قَالَ فَحَمِدَ اللَّهَ عُمَرُ ثُمَّ انْصَرَفَ ‏.‏",
    "malay_translation": "Hadith ini menceritakan bagaimana Khalifah Umar al-Khattab membuat keputusan dalam menangani wabak yang merebak di Syam.  Beliau berunding dengan pelbagai kumpulan orang, termasuk Muhajirin awal dan Ansar, untuk mendapatkan pandangan mereka.  Mereka berbeza pendapat; ada yang mencadangkan untuk terus maju, ada pula yang mencadangkan untuk menarik balik pasukan. Akhirnya, dengan mendengar pandangan golongan tua Quraisy, beliau mengambil keputusan untuk menarik balik pasukan.  Hadith ini juga menerangkan perbincangan Khalifah Umar al-Khattab dengan Abu Ubaydah dan penjelasannya mengenai pandangan yang diambilnya.  Ia mengandungi perumpamaan mengenai memilih jalan yang terbaik bagi keselamatan dan kesejahteraan ramai.  Hadith ini menunjukkan hikmah dan kebijaksanaan Umar al-Khattab dalam mengambil keputusan penting berkaitan isu kesihatan dan keselamatan jamaah."
  },
  {
    "id": 35922,
    "hadith_number": 1744,
    "tajuk_hadith": "Penjelasan Mengenai Wabak Penyakit dan Petunjuk Rasulullah SAW",
    "perawi_melayu": "Yahya daripada Malik daripada Muhammad bin al-Munkadir dan daripada Salim bin Abi'n-Nadr, mawla Umar bin Ubaydullah daripada Amir bin Saad bin Abi Waqqas daripada bapanya. Amir bertanya kepada Usamah bin Zaid.",
    "english_text": "Yahya related to me from Malik from Muhammad ibn al-Munkadir and\nfrom Salim ibn Abi'n-Nadr, the mawla of Umar ibn Ubaydullah that Amir\nibn Sad ibn Abi Waqqas heard his father ask Usama ibn Zayd, \"Have you\nheard anything from the Messenger of Allah, may Allah bless him and\ngrant him peace, about the plague?\" Usama said, \"The Messenger of\nAllah, may Allah bless him and grant him peace, said, 'The plague is a\npunishment that was sent down on a party of the Banu Israil or whoever\nwas before them. When you hear of it in a land, do not enter it. If it\ncomes upon a land and you are in it, do not depart in flight from it.'\n\"\n\n\nMalik said that Abu'n-Nadr said, \"That is, do not depart\nwith no other intention but flight.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، وَعَنْ سَالِمٍ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَهُ يَسْأَلُ، أُسَامَةَ بْنَ زَيْدٍ مَا سَمِعْتَ مِنْ، رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الطَّاعُونِ فَقَالَ أُسَامَةُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الطَّاعُونُ رِجْزٌ أُرْسِلَ عَلَى طَائِفَةٍ مِنْ بَنِي إِسْرَائِيلَ أَوْ عَلَى مَنْ كَانَ قَبْلَكُمْ فَإِذَا سَمِعْتُمْ بِهِ بِأَرْضٍ فَلاَ تَدْخُلُوا عَلَيْهِ وَإِذَا وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلاَ تَخْرُجُوا فِرَارًا مِنْهُ ‏\"‏ ‏.‏ قَالَ مَالِكٌ قَالَ أَبُو النَّضْرِ لاَ يُخْرِجُكُمْ إِلاَّ فِرَارٌ مِنْهُ ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku (Yahya) dari Malik, dari Muhammad bin al-Munkadir, dan dari Salim bin Abi'n-Nadr, mawla Umar bin Ubaydillah, dari Amir bin Saad bin Abi Waqqas daripada bapanya, bahawa dia mendengarnya bertanya kepada Usamah bin Zaid, \"Apakah engkau mendengar sesuatu daripada Rasulullah SAW tentang wabak penyakit?\" Usamah menjawab, \"Rasulullah SAW bersabda, 'Wabak penyakit itu adalah azab yang ditimpakan ke atas sebahagian daripada Bani Israil atau orang-orang sebelum mereka. Jika kamu mendengarnya di sebuah negeri, janganlah kamu masuk ke dalamnya. Jika ia melanda negeri dan kamu berada di dalamnya, janganlah kamu lari daripadanya.'\" Malik berkata, Abu'n-Nadr berkata, \"Maksudnya, janganlah kamu keluar melainkan dengan niat lari.\" "
  },
  {
    "id": 35923,
    "hadith_number": 1745,
    "tajuk_hadith": "Larangan Menyerang Tanah Berjangkit Wabak",
    "perawi_melayu": "Yahya dari Malik dari Ibn Shihab dari Abdullah ibn Amir ibn Rabia",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Abdullah ibn\nAmir ibn Rabia that Umar ibn al-Khattab went out to ash-Sham. When he\ncame to Sargh, near Tabuk, he heard that the plague had broken out in\nash-Sham. Abd ar-Rahman ibn Awf told him that the Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"If you hear that a\nland has a plague in it, do not go forward to it. If it comes upon a\nland which you are in, do not depart in flight from it.\" Umar ibn al-\nKhattab came back from Sargh.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، خَرَجَ إِلَى الشَّامِ فَلَمَّا جَاءَ سَرْغَ بَلَغَهُ أَنَّ الْوَبَأَ قَدْ وَقَعَ بِالشَّامِ فَأَخْبَرَهُ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا سَمِعْتُمْ بِهِ بِأَرْضٍ فَلاَ تَقْدَمُوا عَلَيْهِ وَإِذَا وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلاَ تَخْرُجُوا فِرَارًا مِنْهُ ‏\"‏ ‏.‏ فَرَجَعَ عُمَرُ بْنُ الْخَطَّابِ مِنْ سَرْغَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik, dari Ibn Shihab, dari Abdullah bin Amir bin Rabiah bahawa Umar al-Khattab keluar ke Syam.  Apabila sampai di Sargh, berhampiran Tabuk, beliau diberitahu bahawa wabak telah merebak di Syam.  Abdul Rahman bin Auf memberitahunya bahawa Rasulullah SAW bersabda, \"Jika kamu mendengar wabak di suatu negeri, janganlah kamu menghampirinya. Jika wabak itu melanda negeri di mana kamu berada, janganlah kamu melarikan diri darinya.\" Kemudian Umar al-Khattab kembali dari Sargh."
  },
  {
    "id": 35924,
    "hadith_number": 1746,
    "tajuk_hadith": "Umar bin al-Khattab Memulangkan Orang Ramai dari Sargh",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Salim ibn\nAbdullah that Umar ibn al-Khattab turned people back at Sargh\naccording to the hadith of Abd ar-Rahman ibn Awf.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، إِنَّمَا رَجَعَ بِالنَّاسِ مِنْ سَرْغَ عَنْ حَدِيثِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik, daripada Ibn Shihab, daripada Salim bin Abdullah, bahawa Umar bin al-Khattab telah memulangkan orang ramai dari Sargh berdasarkan hadis daripada Abd ar-Rahman bin Auf."
  },
  {
    "id": 35925,
    "hadith_number": 1747,
    "tajuk_hadith": "Keutamaan Bermalam di Rukba Berbanding di Syam",
    "perawi_melayu": "",
    "english_text": "Yahya related to me that Malik said, \"I heard that Umar ibn al-\nKhattab said, 'A night in Rukba (a valley near Taif,) is more\npreferable to me than ten nights in ash-Sham.' \"\n\n\nMalik said,\n\"He meant to lengthen and preserve their lives because of the severity\nof the plague in ash-Sham .\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ قَالَ بَلَغَنِي أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ لَبَيْتٌ بِرُكْبَةَ أَحَبُّ إِلَىَّ مِنْ عَشَرَةِ أَبْيَاتٍ بِالشَّامِ ‏.‏ قَالَ مَالِكٌ يُرِيدُ لِطُولِ الأَعْمَارِ وَالْبَقَاءِ وَلِشِدَّةِ الْوَبَإِ بِالشَّامِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya bahawa Malik berkata, \"Aku mendengar bahawa Umar al-Khattab berkata, 'Satu malam di Rukba (lembah berhampiran Taif) lebih aku sukai daripada sepuluh malam di Syam.'\" \n\nMalik berkata, \"Maksud beliau adalah untuk memanjangkan umur dan memelihara nyawa mereka disebabkan wabak yang teruk di Syam.\""
  }
]