[
  {
    "id": 34434,
    "hadith_number": 256,
    "tajuk_hadith": "Ganjaran Solat Malam dan Tidur Kerana Keletihan",
    "perawi_melayu": "Muhammad ibn al-Munkadir, daripada Said ibn al-Jubayr, daripada seorang lelaki yang dipercayai, bahawa A'ishah, isteri Nabi ﷺ, meriwayatkan.",
    "english_text": "Yahya related to me from Malik from Muhammad ibn al-Munkadir from\nSaid ibn al-Jubayr that a man who has approval (as a relater of\nhadith), told him that A'isha, the wife of the Prophet, may Allah\nbless him and grant him peace, said, \"If a man prays in the night and\nsleep overcomes him during it, Allah writes for him the reward of his\nprayer, and his sleep is sadaqa for him.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ رَجُلٍ، عِنْدَهُ رِضًا أَنَّهُ أَخْبَرَهُ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا مِنِ امْرِئٍ تَكُونُ لَهُ صَلاَةٌ بِلَيْلٍ يَغْلِبُهُ عَلَيْهَا نَوْمٌ إِلاَّ كَتَبَ اللَّهُ لَهُ أَجْرَ صَلاَتِهِ وَكَانَ نَوْمُهُ عَلَيْهِ صَدَقَةً ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Muhammad ibn al-Munkadir, daripada Said ibn al-Jubayr bahawa seorang lelaki yang dipercayai, menceritakan kepadanya bahawa A'ishah, isteri Nabi ﷺ, berkata, \"Jika seseorang lelaki menunaikan solat pada waktu malam dan dia tertidur, Allah akan menuliskan ganjaran solatnya dan tidurnya itu adalah sedekah baginya.\""
  },
  {
    "id": 34435,
    "hadith_number": 257,
    "tajuk_hadith": "Kedudukan Kaki Aisyah Semasa Rasulullah SAW Solat",
    "perawi_melayu": "Aisyah (RA)",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ كُنْتُ أَنَامُ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَرِجْلاَىَ فِي قِبْلَتِهِ فَإِذَا سَجَدَ غَمَزَنِي فَقَبَضْتُ رِجْلَىَّ فَإِذَا قَامَ بَسَطْتُهُمَا ‏.‏ قَالَتْ وَالْبُيُوتُ يَوْمَئِذٍ لَيْسَ فِيهَا مَصَابِيحُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abu'nNadr, maula Umar ibn 'Ubaydullah, daripada Abu Salama ibn Abd ar-Rahman bahawa A'ishah, isteri Nabi SAW berkata: \"Aku tidur di hadapan Rasulullah SAW, dan kedua kakiku berada di arah kiblatnya. Apabila baginda sujud, baginda menyentuhku, lalu aku menarik kakiku. Apabila baginda berdiri, aku menghulurkannya.\" Beliau menambah, \"Ketika itu, rumah tidak mempunyai lampu.\""
  },
  {
    "id": 34436,
    "hadith_number": 258,
    "tajuk_hadith": "Larangan Solat Dalam Keadaan Mengantuk",
    "perawi_melayu": "A'ishah, isteri Nabi Muhammad SAW",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا نَعَسَ أَحَدُكُمْ فِي صَلاَتِهِ فَلْيَرْقُدْ حَتَّى يَذْهَبَ عَنْهُ النَّوْمُ فَإِنَّ أَحَدَكُمْ إِذَا صَلَّى وَهُوَ نَاعِسٌ لاَ يَدْرِي لَعَلَّهُ يَذْهَبُ يَسْتَغْفِرُ فَيَسُبُّ نَفْسَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Hisyam bin Urwah daripada bapanya daripada A'ishah, isteri Nabi Muhammad SAW, bahawa Rasulullah SAW bersabda, \"Apabila seseorang daripada kamu mengantuk dalam solatnya, maka hendaklah dia tidur sehingga hilang rasa mengantuk itu. Sesungguhnya, jika seseorang daripada kamu solat dalam keadaan mengantuk, dia tidak sedar, barangkali dia ingin memohon keampunan tetapi (sebenarnya) memaki dirinya sendiri.\""
  },
  {
    "id": 34437,
    "hadith_number": 259,
    "tajuk_hadith": "Larangan Beribadah Secara Berlebihan",
    "perawi_melayu": "Malik, daripada Ismail bin Abi Hakim",
    "english_text": "Yahya related to me from Malik from Ismail from Ibn Abi Hakim\nthat he had heard that the Messenger of Allah, may Allah bless him and\ngrant him peace, heard a woman praying at night. He said, \"Who is\nthat?\" and someone said to him,\"It is al-Hawla bint Tuwayt, she does\nnot sleep in the night.\" The Messenger of Allah, may Allah bless him\nand grant him peace, disapproved of that and his disapproval showed in\nhis face. Then he said, \"Allah, the Blessed and Exalted, does not\nbecome weary, but you become weary. Take on whatever is within your\ncapability.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي حَكِيمٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سَمِعَ امْرَأَةً مِنَ اللَّيْلِ تُصَلِّي فَقَالَ ‏\"‏ مَنْ هَذِهِ ‏\"‏ ‏.‏ فَقِيلَ لَهُ هَذِهِ الْحَوْلاَءُ بِنْتُ تُوَيْتٍ لاَ تَنَامُ اللَّيْلَ ‏.‏ فَكَرِهَ ذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى عُرِفَتِ الْكَرَاهِيَةُ فِي وَجْهِهِ ثُمَّ قَالَ ‏\"‏ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى لاَ يَمَلُّ حَتَّى تَمَلُّوا اكْلَفُوا مِنَ الْعَمَلِ مَا لَكُمْ بِهِ طَاقَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Ismail daripada Ibn Abi Hakim bahawa beliau mendengar Rasulullah SAW mendengar seorang wanita sedang solat pada waktu malam. Baginda bertanya, \"Siapakah itu?\" Seseorang berkata kepada baginda, \"Dia ialah al-Hawla bint Tuwayt, dia tidak tidur pada waktu malam.\" Rasulullah SAW tidak menyukai perbuatan itu dan rasa tidak suka itu terpancar di wajah baginda. Kemudian baginda bersabda, \"Sesungguhnya Allah SWT tidak pernah merasa jemu sehingga kamu pula yang merasa jemu. Lakukanlah amalan yang kamu mampu melakukannya.\""
  },
  {
    "id": 34438,
    "hadith_number": 260,
    "tajuk_hadith": "Umar ibn al-Khattab Mendidik Keluarga untuk Solat",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Zayd ibn Aslam from his\nfather that Umar ibn al-Khattab used to pray as much as Allah willed\nin the night until at the end of the night he would wake his family\nfor the prayer. He used to say to them, \"The prayer, the prayer.\" Then\nhe would recite the ayat, \"Enjoin prayer on your family and be\nconstant in it. We do not ask you for your provision. We provide for\nyou. And the end result is for taqwa.\" (Sura 20 ayat 132)",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَانَ يُصَلِّي مِنَ اللَّيْلِ مَا شَاءَ اللَّهُ حَتَّى إِذَا كَانَ مِنْ آخِرِ اللَّيْلِ أَيْقَظَ أَهْلَهُ لِلصَّلاَةِ يَقُولُ لَهُمُ الصَّلاَةَ الصَّلاَةَ ثُمَّ يَتْلُو هَذِهِ الآيَةَ ‏{‏وَأْمُرْ أَهْلَكَ بِالصَّلاَةِ وَاصْطَبِرْ عَلَيْهَا لاَ نَسْأَلُكَ رِزْقًا نَحْنُ نَرْزُقُكَ وَالْعَاقِبَةُ لِلتَّقْوَى‏}‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik, daripada Zayd ibn Aslam, daripada bapanya bahawa Umar ibn al-Khattab pernah bersolat sebanyak yang Allah kehendaki pada waktu malam. Sehingga apabila tiba akhir malam, beliau akan membangunkan keluarganya untuk solat. Beliau berkata kepada mereka, \"Solat, solat.\" Kemudian beliau membaca ayat, \"Perintahkanlah keluargamu untuk solat dan bersabarlah dalam melakukannya. Kami tidak meminta rezeki daripadamu, Kami yang memberi rezeki kepadamu. Dan kesudahan yang baik adalah bagi mereka yang bertaqwa.\" (Surah 20 ayat 132)"
  },
  {
    "id": 34439,
    "hadith_number": 261,
    "tajuk_hadith": "Tidur Sebelum Isyak dan Perbualan Selepas Isyak",
    "perawi_melayu": "Said ibn al-Musayyab",
    "english_text": "Yahya related to me from Malik that he had heard that Said ibn\nal-Musayyab used to say, \"Sleep is disapproved of before isha and\nconversation after it.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، كَانَ يَقُولُ يُكْرَهُ النَّوْمُ قَبْلَ الْعِشَاءِ وَالْحَدِيثُ بَعْدَهَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik bahawa dia telah mendengar bahawa Said ibn al-Musayyab berkata, \"Tidur adalah tidak digalakkan sebelum solat Isyak dan perbualan selepasnya.\""
  },
  {
    "id": 34440,
    "hadith_number": 262,
    "tajuk_hadith": "Solat Sunat Dua Rakaat dan Taslim",
    "perawi_melayu": "Abdullah ibn Umar (RA)",
    "english_text": "Yahya related to me from Malik that he had heard that Abdullah\nibn Umar used to say, \"(Voluntary) prayer in both the day and night is\ntwo at a time with a taslim after every 2 raka'ahs.\"\n\n\nMalik said,\n\"That is the custom among us.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ صَلاَةُ اللَّيْلِ وَالنَّهَارِ مَثْنَى مَثْنَى يُسَلِّمُ مِنْ كُلِّ رَكْعَتَيْنِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya dari Malik bahawa beliau mendengar bahawa Abdullah ibn Umar pernah berkata, \"Solat sunat pada waktu siang dan malam adalah dua-dua (dua rakaat) dan memberi salam (taslim) selepas setiap dua rakaat.\"\n\nMalik berkata, \"Itulah kebiasaan kami.\""
  },
  {
    "id": 34441,
    "hadith_number": 263,
    "tajuk_hadith": "Solat Malam Rasulullah SAW Sebanyak Sebelas Rakaat",
    "perawi_melayu": "Aisyah RA",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Urwa ibn az- Zubayr from A'isha, the wife of the Prophet, may Allah bless him and grant him peace, that the Messenger of Allah, may Allah bless him and grant him peace, used to pray eleven rakas in the night, making them odd by a single one, and when he had finished he lay down on his right side.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي مِنَ اللَّيْلِ إِحْدَى عَشْرَةَ رَكْعَةً يُوتِرُ مِنْهَا بِوَاحِدَةٍ فَإِذَا فَرَغَ اضْطَجَعَ عَلَى شِقِّهِ الأَيْمَنِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Urwa ibn az-Zubayr, daripada A'isyah, isteri Nabi SAW, bahawa Rasulullah SAW pernah solat pada waktu malam sebanyak sebelas rakaat, dengan satu daripadanya adalah witir. Apabila selesai, baginda berbaring di sisi kanan baginda."
  },
  {
    "id": 34442,
    "hadith_number": 264,
    "tajuk_hadith": "Solat Rasulullah SAW di Bulan Ramadhan",
    "perawi_melayu": "A'ishah RA",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّهُ سَأَلَ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَيْفَ كَانَتْ صَلاَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي رَمَضَانَ فَقَالَتْ مَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَزِيدُ فِي رَمَضَانَ وَلاَ فِي غَيْرِهِ عَلَى إِحْدَى عَشْرَةَ رَكْعَةً يُصَلِّي أَرْبَعًا فَلاَ تَسْأَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ ثُمَّ يُصَلِّي أَرْبَعًا فَلاَ تَسْأَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ ثُمَّ يُصَلِّي ثَلاَثًا فَقَالَتْ عَائِشَةُ فَقُلْتُ يَا رَسُولَ اللَّهِ أَتَنَامُ قَبْلَ أَنْ تُوتِرَ فَقَالَ ‏\n\"‏ يَا عَائِشَةُ إِنَّ عَيْنَىَّ تَنَامَانِ وَلاَ يَنَامُ قَلْبِي ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Sa'id bin Abi Sa'id al-Maqburi, daripada Abu Salama bin Abd ar-Rahman bin Awf bahawa dia bertanya kepada A'ishah, isteri Nabi SAW, bagaimana solat Rasulullah SAW pada bulan Ramadhan. Beliau menjawab: \"Rasulullah SAW tidak pernah menambah (solat sunat) melebihi sebelas rakaat sama ada di bulan Ramadhan atau di bulan-bulan lain. Baginda solat empat rakaat, janganlah kamu bertanya tentang keindahan dan kepanjangan solatnya. Kemudian baginda solat lagi empat rakaat, janganlah kamu bertanya tentang keindahan dan kepanjangan solatnya. Kemudian baginda solat tiga rakaat.\" A'ishah berkata: \"Aku berkata, 'Wahai Rasulullah, adakah tuan tidur sebelum solat witir?' Baginda bersabda: 'Wahai A'ishah, sesungguhnya kedua mataku tidur tetapi hatiku tidak tidur.'\""
  },
  {
    "id": 34443,
    "hadith_number": 265,
    "tajuk_hadith": "Bilangan Rakaat Solat Malam Rasulullah SAW",
    "perawi_melayu": "A'ishah, umm al-muminin",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that A'isha, umm al-muminin said, \"The Messenger of Allah, may\nAllah bless him and grant him peace, used to pray thirteen rakas in\nthe night and then would pray two rakas when he heard the adhan for\nthe subh prayer.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي بِاللَّيْلِ ثَلاَثَ عَشْرَةَ رَكْعَةً ثُمَّ يُصَلِّي إِذَا سَمِعَ النِّدَاءَ بِالصُّبْحِ رَكْعَتَيْنِ خَفِيفَتَيْنِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik daripada Hisham ibn Urwa daripada bapanya bahawa A'ishah, umm al-muminin berkata, \"Rasulullah SAW biasanya bersolat tiga belas rakaat pada waktu malam, kemudian Baginda bersolat dua rakaat apabila mendengar azan Subuh.\""
  },
  {
    "id": 34444,
    "hadith_number": 266,
    "tajuk_hadith": "Solat Malam Nabi SAW dan Abdullah bin Abbas",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّهُ، بَاتَ لَيْلَةً عِنْدَ مَيْمُونَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم - وَهِيَ خَالَتُهُ - قَالَ فَاضْطَجَعْتُ فِي عَرْضِ الْوِسَادَةِ وَاضْطَجَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَهْلُهُ فِي طُولِهَا فَنَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى إِذَا انْتَصَفَ اللَّيْلُ - أَوْ قَبْلَهُ بِقَلِيلٍ أَوْ بَعْدَهُ بِقَلِيلٍ - اسْتَيْقَظَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَجَلَسَ يَمْسَحُ النَّوْمَ عَنْ وَجْهِهِ بِيَدِهِ ثُمَّ قَرَأَ الْعَشْرَ الآيَاتِ الْخَوَاتِمَ مِنْ سُورَةِ آلِ عِمْرَانَ ثُمَّ قَامَ إِلَى شَنٍّ مُعَلَّقٍ فَتَوَضَّأَ مِنْهُ فَأَحْسَنَ وُضُوءَهُ ثُمَّ قَامَ يُصَلِّي - قَالَ ابْنُ عَبَّاسٍ - فَقُمْتُ فَصَنَعْتُ مِثْلَ مَا صَنَعَ ثُمَّ ذَهَبْتُ فَقُمْتُ إِلَى جَنْبِهِ فَوَضَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ الْيُمْنَى عَلَى رَأْسِي وَأَخَذَ بِأُذُنِي الْيُمْنَى يَفْتِلُهَا فَصَلَّى رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ أَوْتَرَ ثُمَّ اضْطَجَعَ حَتَّى أَتَاهُ الْمُؤَذِّنُ فَصَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ ثُمَّ خَرَجَ فَصَلَّى الصُّبْحَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Makhrama ibn Sulayman, daripada Kurayb, maula Ibn Abbas, bahawa Abdullah ibn Abbas telah memberitahunya bahawa dia telah bermalam di rumah Maimuna, isteri Nabi, semoga Allah memberkatinya dan mengurniakan kesejahteraan kepadanya, yang juga merupakan kakak ibu Ibn Abbas. Ibn Abbas berkata, \"Saya berbaring dengan kepala saya di atas bantal, dan Rasulullah, semoga Allah memberkatinya dan mengurniakan kesejahteraan kepadanya, dan isterinya berbaring dengan kepala mereka di atas bantal itu. Rasulullah, semoga Allah memberkatinya dan mengurniakan kesejahteraan kepadanya, tidur, sehingga, separuh malam atau sedikit sebelum atau selepasnya, dia terjaga dan duduk dan menyapu tidur dari wajahnya dengan tangannya. Kemudian dia membaca sepuluh ayat terakhir surah Ali Imran (Sura3). Kemudian dia bangun dan pergi ke kulit air yang tergantung dan berwudhu daripadanya, melakukan wudhunya dengan teliti, dan kemudian dia berdiri untuk solat.\"\n\nIbn Abbas meneruskan, \"Saya bangun dan melakukan perkara yang sama dan kemudian pergi dan berdiri di sisinya. Rasulullah, semoga Allah memberkatinya dan mengurniakan kesejahteraan kepadanya, meletakkan tangan kanannya di atas kepala saya dan memegang telinga kanan saya dan memulasnya. Dia solat dua rakaat, kemudian dua rakaat, kemudian dua rakaat, kemudian dua rakaat, kemudian dua rakaat, kemudian dua rakaat, dan kemudian solat witir. Kemudian dia berbaring sehingga muadzin datang kepadanya, dan kemudian solat dua rakaat yang cepat, dan keluar dan solat subuh."
  },
  {
    "id": 34445,
    "hadith_number": 267,
    "tajuk_hadith": "Solat Malam Rasulullah SAW",
    "perawi_melayu": "Zayd ibn Khalid al-Juhani",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ أَبِيهِ، أَنَّ عَبْدَ اللَّهِ بْنَ قَيْسِ بْنِ مَخْرَمَةَ، أَخْبَرَهُ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَنَّهُ قَالَ لأَرْمُقَنَّ اللَّيْلَةَ صَلاَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم - قَالَ - فَتَوَسَّدْتُ عَتَبَتَهُ - أَوْ فُسْطَاطَهُ - فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى رَكْعَتَيْنِ طَوِيلَتَيْنِ طَوِيلَتَيْنِ طَوِيلَتَيْنِ ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ أَوْتَرَ فَتِلْكَ ثَلاَثَ عَشْرَةَ رَكْعَةً ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abdullah ibn Abi Bakr, daripada bapanya, bahawa Abdullah ibn Qays ibn Makhrama memberitahunya daripada Zayd ibn Khalid al-Juhani, bahawa dia berkata: \"Sesungguhnya pada suatu malam aku akan melihat solat Rasulullah SAW.\" Dia berkata: \"Aku meletakkan kepalaku di ambang pintu baginda. Rasulullah SAW bangun dan solat dua rakaat yang panjang, panjang, panjang. Kemudian baginda solat dua rakaat yang sedikit kurang panjang daripada dua rakaat sebelumnya. Kemudian baginda solat dua rakaat yang sedikit kurang panjang daripada dua rakaat sebelumnya. Kemudian baginda solat dua rakaat yang sedikit kurang panjang daripada dua rakaat sebelumnya. Kemudian baginda solat dua rakaat yang sedikit kurang panjang daripada dua rakaat sebelumnya. Kemudian baginda solat dua rakaat yang sedikit kurang panjang daripada dua rakaat sebelumnya. Kemudian baginda solat witir, maka semuanya tiga belas rakaat.\""
  },
  {
    "id": 34446,
    "hadith_number": 268,
    "tajuk_hadith": "Solat Malam: Dua Rakaat-Dua Rakaat",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Nafi dan Abdullah ibn Umar",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، وَعَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَجُلاً، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ صَلاَةِ اللَّيْلِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ صَلاَةُ اللَّيْلِ مَثْنَى مَثْنَى فَإِذَا خَشِيَ أَحَدُكُمُ الصُّبْحَ صَلَّى رَكْعَةً وَاحِدَةً تُوتِرُ لَهُ مَا قَدْ صَلَّى ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Nafi dan Abdullah ibn Umar bahawa seorang lelaki bertanya kepada Rasulullah SAW tentang solat malam. Rasulullah SAW bersabda, \"Solat malam adalah dua rakaat-dua rakaat, dan apabila kamu khuatir fajar akan terbit, maka solatlah satu rakaat untuk menjadikan solatmu ganjil.\""
  },
  {
    "id": 34447,
    "hadith_number": 269,
    "tajuk_hadith": "Kewajipan Solat Lima Waktu",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said from Muhammad\nibn Yahya ibn Habban from Ibn Muhayriz that a man from the Kinana\ntribe called al-Mukhdaji heard a man in Syria known as Abu Muhammad\nsaying, \"The witr is obligatory (fard).\" Al-Mukhdaji said, \"I went to\nUbada ibn as-Samit and presented myself to him as he was going to the\nmosque, and told him what Abu Muhammad had said. Ubada said that Abu\nMuhammad had lied and that he had heard the Messenger of Allah, may\nAllah bless him and grant him peace, say, 'Allah the Majestic and\nMighty has written five prayers for mankind, and whoever does them and\ndoes not waste anything of them by making light of what is due to\nthem, there is a pact for him with Allah that He will admit him into\nthe Garden.Whoever does not do them, there is no pact for him with\nAllah. If He wishes, He punishes him, and if He wishes, He admits him\ninto the Garden.' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنِ ابْنِ مُحَيْرِيزٍ، أَنَّ رَجُلاً، مِنْ بَنِي كِنَانَةَ يُدْعَى الْمُخْدَجِيَّ سَمِعَ رَجُلاً، بِالشَّامِ يُكَنَّى أَبَا مُحَمَّدٍ يَقُولُ إِنَّ الْوِتْرَ وَاجِبٌ ‏.‏ فَقَالَ الْمُخْدَجِيُّ فَرُحْتُ إِلَى عُبَادَةَ بْنِ الصَّامِتِ فَاعْتَرَضْتُ لَهُ وَهُوَ رَائِحٌ إِلَى الْمَسْجِدِ فَأَخْبَرْتُهُ بِالَّذِي قَالَ أَبُو مُحَمَّدٍ فَقَالَ عُبَادَةُ كَذَبَ أَبُو مُحَمَّدٍ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ خَمْسُ صَلَوَاتٍ كَتَبَهُنَّ اللَّهُ عَزَّ وَجَلَّ عَلَى الْعِبَادِ فَمَنْ جَاءَ بِهِنَّ لَمْ يُضَيِّعْ مِنْهُنَّ شَيْئًا اسْتِخْفَافًا بِحَقِّهِنَّ كَانَ لَهُ عِنْدَ اللَّهِ عَهْدٌ أَنْ يُدْخِلَهُ الْجَنَّةَ وَمَنْ لَمْ يَأْتِ بِهِنَّ فَلَيْسَ لَهُ عِنْدَ اللَّهِ عَهْدٌ إِنْ شَاءَ عَذَّبَهُ وَإِنْ شَاءَ أَدْخَلَهُ الْجَنَّةَ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said, daripada Muhammad bin Yahya bin Habban, daripada Ibn Muhayriz bahawa seorang lelaki dari suku Kinana yang bernama al-Mukhdaji mendengar seorang lelaki di Syria yang dikenali sebagai Abu Muhammad berkata, \"Solat witr adalah wajib (fard).\" Al-Mukhdaji berkata, \"Saya pergi kepada 'Ubada bin as-Samit dan memberitahunya semasa dia hendak ke masjid, dan memberitahunya apa yang dikatakan oleh Abu Muhammad. 'Ubada berkata bahawa Abu Muhammad telah berbohong dan dia telah mendengar Rasulullah SAW bersabda, 'Allah SWT telah mewajibkan lima solat ke atas manusia, sesiapa yang melakukannya dan tidak mengabaikannya sedikit pun dengan memandang ringan terhadap haknya, maka ada perjanjian baginya dengan Allah bahawa Dia akan memasukkannya ke dalam Syurga. Sesiapa yang tidak melakukannya, maka tidak ada perjanjian baginya dengan Allah. Jika Dia berkehendak, Dia akan menyeksanya, dan jika Dia berkehendak, Dia akan memasukkannya ke dalam Syurga.'\""
  },
  {
    "id": 34448,
    "hadith_number": 270,
    "tajuk_hadith": "Solat Witir Nabi SAW di Atas Unta",
    "perawi_melayu": "Said ibn Yasar",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي بَكْرِ بْنِ عُمَرَ، عَنْ سَعِيدِ بْنِ يَسَارٍ، قَالَ كُنْتُ أَسِيرُ مَعَ عَبْدِ اللَّهِ بْنِ عُمَرَ بِطَرِيقِ مَكَّةَ - قَالَ سَعِيدٌ - فَلَمَّا خَشِيتُ الصُّبْحَ نَزَلْتُ فَأَوْتَرْتُ ثُمَّ أَدْرَكْتُهُ فَقَالَ لِي عَبْدُ اللَّهِ بْنُ عُمَرَ أَيْنَ كُنْتَ فَقُلْتُ لَهُ خَشِيتُ الصُّبْحَ فَنَزَلْتُ فَأَوْتَرْتُ ‏.‏ فَقَالَ عَبْدُ اللَّهِ أَلَيْسَ لَكَ فِي رَسُولِ اللَّهِ أُسْوَةٌ ‏.‏ فَقُلْتُ بَلَى وَاللَّهِ ‏.‏ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُوتِرُ عَلَى الْبَعِيرِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Abu Bakr ibn Umar bahawa Said ibn Yasar berkata, “Aku sedang dalam perjalanan bersama Abdullah ibn Umar di jalan ke Makkah. Apabila aku khuatir hampir subuh, aku turun dan menunaikan solat witir. Kemudian aku menyusulnya. Abdullah berkata, ‘Di manakah kamu?’ Aku menjawab, ‘Aku khuatir subuh, maka aku turun untuk solat witir.’ Abdullah berkata, ‘Bukankah bagi kamu contoh yang baik pada diri Rasulullah SAW?’ Aku menjawab, ‘Bahkan, demi Allah!’ Dia berkata, ‘Sesungguhnya Rasulullah SAW mengerjakan solat witir di atas unta.’”"
  },
  {
    "id": 34449,
    "hadith_number": 271,
    "tajuk_hadith": "Waktu Solat Witir Abu Bakar as-Siddiq, Umar, dan Said ibn al-Musayyab",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ كَانَ أَبُو بَكْرٍ الصِّدِّيقُ إِذَا أَرَادَ أَنْ يَأْتِيَ، فِرَاشَهُ أَوْتَرَ وَكَانَ عُمَرُ بْنُ الْخَطَّابِ يُوتِرُ آخِرَ اللَّيْلِ قَالَ سَعِيدُ بْنُ الْمُسَيَّبِ فَأَمَّا أَنَا فَإِذَا جِئْتُ فِرَاشِي أَوْتَرْتُ ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku daripada Malik, daripada Yahya bin Said, daripada Said bin al-Musayyab, bahawasanya dia berkata: Adalah Abu Bakar as-Siddiq apabila dia ingin pergi ke tempat tidurnya, dia berwitir. Dan adalah Umar ibn al-Khattab berwitir pada akhir malam. Said bin al-Musayyab berkata: Adapun aku, maka apabila aku pergi ke tempat tidurku, aku berwitir."
  },
  {
    "id": 34450,
    "hadith_number": 272,
    "tajuk_hadith": "Solat Witir: Amalan Rasulullah SAW dan Umat Islam",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَجُلاً، سَأَلَ عَبْدَ اللَّهِ بْنَ عُمَرَ عَنِ الْوِتْرِ أَوَاجِبٌ هُوَ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ قَدْ أَوْتَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَوْتَرَ الْمُسْلِمُونَ ‏.‏ فَجَعَلَ الرَّجُلُ يُرَدِّدُ عَلَيْهِ وَعَبْدُ اللَّهِ بْنُ عُمَرَ يَقُولُ أَوْتَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَوْتَرَ الْمُسْلِمُونَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa dia mendengar seorang lelaki bertanya kepada Abdullah ibn Umar sama ada solat witir itu wajib. Abdullah ibn Umar menjawab, \"Rasulullah SAW telah mengerjakan solat witir, dan umat Islam juga mengerjakan solat witir.\" Lelaki itu mengulangi pertanyaannya, dan Abdullah ibn Umar terus berkata, \"Rasulullah SAW telah mengerjakan solat witir, dan umat Islam juga mengerjakan solat witir.\""
  },
  {
    "id": 34451,
    "hadith_number": 273,
    "tajuk_hadith": "Witr: Disyorkan Sebelum Tidur atau Ditangguhkan",
    "perawi_melayu": "A'ishah (r.a.), isteri Nabi (s.a.w.)",
    "english_text": "Yahya related to me from Malik that he had heard that A'isha, the\nwife of the Prophet, may Allah bless him and grant him peace, used to\nsay, \"If someone fears that he will sleep through till the morning,\nlet him pray the witr before he sleeps, and if some one hopes to wake\nfor the last part of the night, let him delay his witr.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَانَتْ تَقُولُ مَنْ خَشِيَ أَنْ يَنَامَ حَتَّى يُصْبِحَ فَلْيُوتِرْ قَبْلَ أَنْ يَنَامَ وَمَنْ رَجَا أَنْ يَسْتَيْقِظَ آخِرَ اللَّيْلِ فَلْيُؤَخِّرْ وِتْرَهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa beliau telah mendengar bahawa A'ishah, isteri Nabi (s.a.w.) berkata, \"Sesiapa yang bimbang tidak akan bangun sehingga ke pagi, hendaklah dia menunaikan solat witr sebelum tidur. Dan sesiapa yang berharap untuk bangun pada akhir malam, hendaklah dia menangguhkan solat witrnya.\""
  },
  {
    "id": 34452,
    "hadith_number": 274,
    "tajuk_hadith": "Abdullah ibn Umar Solat Witir Ketika Awan Mendung",
    "perawi_melayu": "Nafi",
    "english_text": "Yahya related to me from Malik that Nafi said, \"I was with\nAbdullah ibn Umar in Makka. The sky was clouded over and Abdullah\nfeared that dawn was approaching so he prayed one raka for witr. Then\nthe clouds cleared and he saw that it was still night, so he made his\nprayers even with one raka. Then he continued to pray two rakas at a\ntime, until when he feared the approach of dawn, he prayed one raka\nfor witr.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّهُ قَالَ كُنْتُ مَعَ عَبْدِ اللَّهِ بْنِ عُمَرَ بِمَكَّةَ وَالسَّمَاءُ مُغِيمَةٌ فَخَشِيَ عَبْدُ اللَّهِ الصُّبْحَ فَأَوْتَرَ بِوَاحِدَةٍ ثُمَّ انْكَشَفَ الْغَيْمُ فَرَأَى أَنَّ عَلَيْهِ لَيْلاً فَشَفَعَ بِوَاحِدَةٍ ثُمَّ صَلَّى بَعْدَ ذَلِكَ رَكْعَتَيْنِ رَكْعَتَيْنِ فَلَمَّا خَشِيَ الصُّبْحَ أَوْتَرَ بِوَاحِدَةٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa Nafi berkata, \"Aku bersama Abdullah ibn Umar di Mekah. Langit berawan dan Abdullah khuatir fajar akan terbit, lalu dia solat witir satu rakaat. Kemudian awan hilang dan dia melihat bahawa masih malam, maka dia menyempurnakan solatnya dengan satu rakaat. Kemudian dia terus solat dua rakaat pada satu masa, sehingga apabila dia khuatir fajar akan terbit, dia solat satu rakaat untuk witir.\""
  },
  {
    "id": 34453,
    "hadith_number": 275,
    "tajuk_hadith": "Taslim antara Dua Rakaat dan Witir",
    "perawi_melayu": "Abdullah ibn Umar",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar used to say the taslim between the two rakas and the one raka of witr so that he could order something he needed.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يُسَلِّمُ بَيْنَ الرَّكْعَتَيْنِ وَالرَّكْعَةِ فِي الْوِتْرِ حَتَّى يَأْمُرَ بِبَعْضِ حَاجَتِهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Nafi bahawa Abdullah ibn Umar biasa memberi salam (taslim) antara dua rakaat dan satu rakaat dalam solat witir, supaya dia boleh mengarahkan sesuatu yang diperlukannya."
  },
  {
    "id": 34454,
    "hadith_number": 276,
    "tajuk_hadith": "Solat Witir Satu Rakaat Selepas Isyak",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Ibn Shihab that Sad ibn Abi\nWaqqas used to pray witr after isha with one raka.\n\n\nMalik\nsaid, \"This is not the situation with us. Rather three is the minimum\nfor witr.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ سَعْدَ بْنَ أَبِي وَقَّاصٍ، كَانَ يُوتِرُ بَعْدَ الْعَتَمَةِ بِوَاحِدَةٍ ‏.‏ قَالَ مَالِكٌ وَلَيْسَ عَلَى هَذَا الْعَمَلُ عِنْدَنَا وَلَكِنْ أَدْنَى الْوِتْرِ ثَلاَثٌ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Ibn Shihab bahawa Sa'ad bin Abi Waqqas dahulu mengerjakan solat witir selepas Isyak dengan satu rakaat.\n\nMalik berkata, \"Ini bukanlah amalan kami. Bahkan, tiga adalah minimum untuk witir."
  },
  {
    "id": 34455,
    "hadith_number": 277,
    "tajuk_hadith": "Solat Maghrib Adalah Witr Solat Siang",
    "perawi_melayu": "Abdullah ibn Dinar",
    "english_text": "Yahya related to me from Malik from Abdullah ibn Dinar that\nAbdullah ibn Umar used to say, \"The maghrib prayer is the witr of the\ndaytime prayers.\"\n\n\nMalik said, \"If someone prays witr at the\nbeginning of the night, and goes to sleep, and then wakes up and it\nseems good to him to pray, let him pray, two rakas at a time. That is\nwhat I like most of what I have heard.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ صَلاَةُالمغرب وتر صلاة النهار ‏.‏ قال مالك من أوتر أول الليل ثم نام ثم قام فبدا له أن يصلي فليصل مثنى مثنى فهو أحب ما سمعت إلى ‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Abdullah ibn Dinar bahawa Abdullah ibn Umar berkata, \"Solat Maghrib adalah witr solat siang.\"\n\nMalik berkata, \"Jika seseorang bersolat witr pada awal malam, kemudian tidur, dan bangun semula dan berasa elok untuk bersolat, maka hendaklah dia bersolat, dua rakaat dua rakaat. Itulah yang paling saya sukai daripada apa yang saya dengar."
  },
  {
    "id": 34456,
    "hadith_number": 278,
    "tajuk_hadith": "Ibnu Abbas Solat Witr dan Subuh Selepas Bangun Tidur",
    "perawi_melayu": "Said bin Jubayr",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الْكَرِيمِ بْنِ أَبِي الْمُخَارِقِ الْبَصْرِيِّ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، رَقَدَ ثُمَّ اسْتَيْقَظَ فَقَالَ لِخَادِمِهِ انْظُرْ مَا صَنَعَ النَّاسُ ‏.‏ وَهُوَ يَوْمَئِذٍ قَدْ ذَهَبَ بَصَرُهُ ‏.‏ فَذَهَبَ الْخَادِمُ ثُمَّ رَجَعَ فَقَالَ قَدِ انْصَرَفَ النَّاسُ مِنَ الصُّبْحِ ‏.‏ فَقَامَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ فَأَوْتَرَ ثُمَّ صَلَّى الصُّبْحَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Abd al-Karim ibn Abi'l-Mukhariq al-Basri, daripada Said ibn Jubayr, bahawa Abdullah ibn Abbas tidur, kemudian bangun dan berkata kepada pembantunya, \"Pergilah lihat apa yang telah dilakukan oleh orang ramai.\" Pada waktu itu, penglihatannya telah hilang. Pembantu itu pergi, kemudian kembali dan berkata, \"Orang ramai telah selesai solat Subuh.\" Lalu Abdullah ibn Abbas bangun dan solat witr, kemudian menunaikan solat Subuh."
  },
  {
    "id": 34457,
    "hadith_number": 279,
    "tajuk_hadith": "Solat Witir Selepas Fajar",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik that he had heard that Abdullah\nibn Abbas and Ubada ibn as-Samit and al-Qasim ibn Muhammad and\nAbdullah ibn Amir ibn Rabia had all prayed witr after the break of\ndawn.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، وَعُبَادَةَ بْنَ الصَّامِتِ، وَالْقَاسِمَ بْنَ مُحَمَّدٍ، وَعَبْدَ اللَّهِ بْنَ عَامِرِ بْنِ رَبِيعَةَ، قَدْ أَوْتَرُوا بَعْدَ الْفَجْرِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa dia telah mendengar bahawa Abdullah ibn Abbas dan Ubada ibn as-Samit dan al-Qasim ibn Muhammad dan Abdullah ibn Amir ibn Rabia semuanya telah solat witir selepas terbit fajar."
  },
  {
    "id": 34458,
    "hadith_number": 280,
    "tajuk_hadith": "Abdullah ibn Mas'ud tentang Solat Witir dan Iqamat Subuh",
    "perawi_melayu": "Malik meriwayatkan daripada Hisham ibn Urwa daripada bapanya bahawa Abdullah ibn Mas'ud berkata",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that Abdullah ibn Masud said, \"I do not mind if the iqama for\nthe subh prayer is called while I am still praying witr.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، قَالَ مَا أُبَالِي لَوْ أُقِيمَتْ صَلاَةُ الصُّبْحِ وَأَنَا أُوتِرُ، ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Hisham ibn Urwa, daripada bapanya, bahawa Abdullah ibn Mas'ud berkata, \"Aku tidak kisah jika iqamat untuk solat Subuh dilaungkan sedangkan aku masih mengerjakan solat Witir.\""
  },
  {
    "id": 34459,
    "hadith_number": 281,
    "tajuk_hadith": "Ubada ibn as-Samit Memimpin Solat Subuh Setelah Solat Witir",
    "perawi_melayu": "Yahya ibn Said",
    "english_text": "Yahya related to me from Malik that Yahya ibn Said said, ''Ubada\nibn as-Samit used to lead the people in prayer. One day he came out\nfor subh and the muadhdhin began to give the iqama for the subh prayer\nUbada silenced him, prayed witr and then led them in subh.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ كَانَ عُبَادَةُ بْنُ الصَّامِتِ يَؤُمُّ قَوْمًا فَخَرَجَ يَوْمًا إِلَى الصُّبْحِ فَأَقَامَ الْمُؤَذِّنُ صَلاَةَ الصُّبْحِ فَأَسْكَتَهُ عُبَادَةُ حَتَّى أَوْتَرَ ثُمَّ صَلَّى بِهِمُ الصُّبْحَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa Yahya ibn Said berkata, 'Ubada ibn as-Samit pernah memimpin solat jemaah. Pada suatu hari, beliau keluar untuk solat Subuh dan muazzin mula melaungkan iqamat untuk solat Subuh. Ubada menghentikannya, menunaikan solat Witir, kemudian memimpin mereka menunaikan solat Subuh."
  },
  {
    "id": 34460,
    "hadith_number": 282,
    "tajuk_hadith": "Solat Witir dengan Mendengar Iqamah atau Selepas Fajar",
    "perawi_melayu": "Abdullah ibn Amir ibn Rabia",
    "english_text": "Yahya related to me from Malik that Abd ar-Rahman ibn al-Qasim\nsaid, \"I heard Abdullah ibn Amir ibn Rabia say, 'I sometimes pray witr\nwhile hearing the iqama, or after the break of dawn.' \" Abd ar-Rahman\nwas not certain which he said.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، أَنَّهُ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَامِرِ بْنِ رَبِيعَةَ، يَقُولُ إِنِّي لأُوتِرُ وَأَنَا أَسْمَعُ الإِقَامَةَ، أَوْ بَعْدَ الْفَجْرِ ‏.‏ يَشُكُّ عَبْدُ الرَّحْمَنِ أَىَّ ذَلِكَ قَالَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa Abd ar-Rahman ibn al-Qasim berkata, \"Aku mendengar Abdullah ibn Amir ibn Rabia berkata, 'Sesungguhnya aku kadang-kadang menunaikan solat witir ketika mendengar iqamah, atau selepas terbit fajar.'\" Abd ar-Rahman tidak pasti yang mana dia katakan."
  },
  {
    "id": 34461,
    "hadith_number": 283,
    "tajuk_hadith": "Witr Selepas Fajar (Subuh) Kerana Terlepas",
    "perawi_melayu": "Abd ar-Rahman ibn al-Qasim, daripada bapanya al-Qasim ibn Muhammad",
    "english_text": "Malik related to me that Abd ar-Rahman ibn al-Qasim heard his\nfather al-Qasim ibn Muhammad say, \"I have prayed witr after dawn.\"\n\n\nMalik said, \"Only a person who oversleeps so that he does not\ndo the witr prays it after dawn. No one should intentionally make his\nwitr after dawn.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، أَنَّهُ سَمِعَ أَبَاهُ الْقَاسِمَ بْنَ مُحَمَّدٍ، يَقُولُ إِنِّي لأُوتِرُ بَعْدَ الْفَجْرِ ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا يُوتِرُ بَعْدَ الْفَجْرِ مَنْ نَامَ عَنِ الْوِتْرِ وَلاَ يَنْبَغِي لأَحَدٍ أَنْ يَتَعَمَّدَ ذَلِكَ حَتَّى يَضَعَ وِتْرَهُ بَعْدَ الْفَجْرِ ‏.‏",
    "malay_translation": "Malik meriwayatkan kepada saya bahawa Abd ar-Rahman ibn al-Qasim mendengar bapanya al-Qasim ibn Muhammad berkata, \"Saya telah menunaikan solat witr selepas fajar (Subuh).\n\nMalik berkata, \"Hanya orang yang terlelap sehingga tidak menunaikan solat witr yang menunaikannya selepas fajar. Tidak sepatutnya seseorang dengan sengaja menunaikan solat witrnya selepas fajar.\""
  },
  {
    "id": 34462,
    "hadith_number": 284,
    "tajuk_hadith": "Solat Sunat Dua Rakaat Sebelum Solat Subuh",
    "perawi_melayu": "Abdullah ibn Umar (melalui Hafsa, isteri Nabi Muhammad SAW)",
    "english_text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat Hafsa, the wife of the Prophet, may Allah bless him and grant him\npeace, told him that the Messenger of Allah, may Allah bless him and\ngrant him peace, used to pray two quick rakas when the muadhdhin had\nfinished the adhan for the subh prayer, before the iqama was said for\nthe prayer.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ حَفْصَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا سَكَتَ الْمُؤَذِّنُ عَنِ الأَذَانِ لِصَلاَةِ الصُّبْحِ صَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ قَبْلَ أَنْ تُقَامَ الصَّلاَةُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Nafi, daripada Abdullah ibn Umar, bahawa Hafsa, isteri Nabi SAW, memberitahunya bahawa Rasulullah SAW selalu menunaikan solat sunat dua rakaat yang ringan selepas muazzin selesai melaungkan azan Subuh, sebelum iqamat didirikan untuk solat."
  },
  {
    "id": 34463,
    "hadith_number": 285,
    "tajuk_hadith": "Solat Sunat Fajar Rasulullah SAW yang Ringkas",
    "perawi_melayu": "A'ishah (RA), isteri Nabi Muhammad SAW",
    "english_text": "Malik related to me from Yahya ibn Said that A'isha, the wife of\nthe Prophet, may Allah bless him and grant him peace, said, \"The\nMessenger of Allah, may Allah bless him and grant him peace, used to\npray the two rakas of the dawn (fajr) so quickly that I would say to\nmyself  'Has he recited the umm al-Qur'an or not?' \"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ إِنْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيُخَفِّفُ رَكْعَتَىِ الْفَجْرِ حَتَّى إِنِّي لأَقُولُ أَقَرَأَ بِأُمِّ الْقُرْآنِ أَمْ لاَ",
    "malay_translation": "Malik meriwayatkan daripada Yahya bin Said bahawa A'ishah, isteri Nabi SAW, berkata, \"Rasulullah SAW seringkali menunaikan solat sunat dua rakaat sebelum fajar (Subuh) dengan begitu ringkas sehingga saya berkata dalam hati, 'Adakah baginda telah membaca Umm al-Quran (Surah al-Fatihah) atau tidak?'\""
  },
  {
    "id": 34464,
    "hadith_number": 286,
    "tajuk_hadith": "Larangan Mengerjakan Solat Sunat Sebelum Subuh Semasa Iqamah",
    "perawi_melayu": "Abu Salama ibn Abd ar-Rahman",
    "english_text": "Yahya related to me from Malik from Sharik ibn Abdullah ibn Abi\nNamir that Abu Salama ibn Abd ar-Rahman said, \"Some people heard the\niqama and started to pray. The Messenger of Allah, may Allah bless him\nand grant him peace, came out and said, 'Are you doing two prayers at\nthe same time? Are you doing two prayers at the same time?'  That was\nabout the subh prayer and the two rakas before subh.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ قَالَ سَمِعَ قَوْمٌ الإِقَامَةَ، فَقَامُوا يُصَلُّونَ فَخَرَجَ عَلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ أَصَلاَتَانِ مَعًا أَصَلاَتَانِ مَعًا ‏\"‏ ‏.‏ وَذَلِكَ فِي صَلاَةِ الصُّبْحِ فِي الرَّكْعَتَيْنِ اللَّتَيْنِ قَبْلَ الصُّبْحِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Sharik ibn Abdullah ibn Abi Namir bahawa Abu Salama ibn Abd ar-Rahman berkata, \"Sesetengah orang mendengar iqamah dan mula bersolat. Rasulullah ﷺ keluar kepada mereka lalu bersabda, 'Adakah kamu melakukan dua solat pada masa yang sama? Adakah kamu melakukan dua solat pada masa yang sama?' Hal itu adalah berkenaan solat Subuh dan dua rakaat sebelum Subuh."
  },
  {
    "id": 34465,
    "hadith_number": 287,
    "tajuk_hadith": "Qada' Solat Sunat Fajar Selepas Matahari Terbit",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik that he had heard that Abdullah\nibn Umar missed the two rakas of dawn, and then did them after the sun\nrose.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، فَاتَتْهُ رَكْعَتَا الْفَجْرِ فَقَضَاهُمَا بَعْدَ أَنْ طَلَعَتِ الشَّمْسُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa beliau mendengar bahawa Abdullah ibn Umar tertinggal dua rakaat solat sunat fajar, lalu beliau menunaikannya selepas matahari terbit."
  },
  {
    "id": 34466,
    "hadith_number": 288,
    "tajuk_hadith": "Perbuatan Al-Qasim ibn Muhammad Seperti Ibn Umar",
    "perawi_melayu": "Yahya meriwayatkan dari Malik dari Abd ar-Rahman ibn al-Qasim",
    "english_text": "Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nthat al-Qasim ibn Muhammad had done the same as Ibn Umar.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُ صَنَعَ مِثْلَ الَّذِي صَنَعَ ابْنُ عُمَرَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya dari Malik, dari Abd ar-Rahman ibn al-Qasim bahawa al-Qasim ibn Muhammad telah melakukan perkara yang sama seperti yang dilakukan oleh Ibn Umar."
  }
]
