[
  {
    "id": 34210,
    "hadith_number": 32,
    "tajuk_hadith": "Cara Wuduk Rasulullah ﷺ",
    "perawi_melayu": "Amr ibn Yahya al-Mazini, daripada ayahnya",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ، عَنْ أَبِيهِ، أَنَّهُ قَالَ لِعَبْدِ اللَّهِ بْنِ زَيْدِ بْنِ عَاصِمٍ وَهُوَ جَدُّ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ وَكَانَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم هَلْ تَسْتَطِيعُ أَنْ تُرِيَنِي كَيْفَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَتَوَضَّأُ فَقَالَ عَبْدُ اللَّهِ بْنُ زَيْدِ بْنِ عَاصِمٍ نَعَمْ ‏.‏ فَدَعَا بِوَضُوءٍ فَأَفْرَغَ عَلَى يَدِهِ فَغَسَلَ يَدَيْهِ مَرَّتَيْنِ مَرَّتَيْنِ ثُمَّ تَمَضْمَضَ وَاسْتَنْثَرَ ثَلاَثًا ثُمَّ غَسَلَ وَجْهَهُ ثَلاَثًا ثُمَّ غَسَلَ يَدَيْهِ مَرَّتَيْنِ مَرَّتَيْنِ إِلَى الْمِرْفَقَيْنِ ثُمَّ مَسَحَ رَأْسَهُ بِيَدَيْهِ فَأَقْبَلَ بِهِمَا وَأَدْبَرَ بَدَأَ بِمُقَدَّمِ رَأْسِهِ ثُمَّ ذَهَبَ بِهِمَا إِلَى قَفَاهُ ثُمَّ رَدَّهُمَا حَتَّى رَجَعَ إِلَى الْمَكَانِ الَّذِي بَدَأَ مِنْهُ ثُمَّ غَسَلَ رِجْلَيْهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Amr ibn Yahya al-Mazini, daripada ayahnya, bahawa dia pernah bertanya kepada Abdullah ibn Zayd ibn Asim, iaitu datuk kepada Amr ibn Yahya al-Mazini dan salah seorang sahabat Rasulullah ﷺ, \"Bolehkah kamu menunjukkan kepadaku bagaimana Rasulullah ﷺ berwuduk?\" Abdullah ibn Zayd ibn Asim menjawab, \"Ya.\" Lalu dia meminta air untuk berwuduk. Dia menuangkan air ke tangannya, membasuh kedua tangannya dua kali, kemudian berkumur-kumur dan memasukkan air ke dalam hidung dan mengeluarkannya tiga kali. Kemudian dia membasuh mukanya tiga kali, dan kedua lengannya hingga ke siku dua kali. Kemudian dia mengusap kepalanya dengan kedua tangannya, meletakkan tangannya dari dahinya ke tengkuknya dan kemudian mengembalikannya ke tempat dia memulai. Kemudian dia membasuh kakinya."
  },
  {
    "id": 34211,
    "hadith_number": 33,
    "tajuk_hadith": "Perintah Berwudhu dan Istinjak dengan Bilangan Ganjil",
    "perawi_melayu": "Abu Hurairah r.a.",
    "english_text": "When you do wudu, snuff water into your nose and blow it out, and if you use stones to clean your private parts use an odd number.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا تَوَضَّأَ أَحَدُكُمْ فَلْيَجْعَلْ فِي أَنْفِهِ مَاءً ثُمَّ لِيَنْثِرْ وَمَنِ اسْتَجْمَرَ فَلْيُوتِرْ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila kamu berwudhu, masukkan air ke dalam hidung dan hembuskannya keluar. Jika kamu menggunakan batu untuk membersihkan tempat sulit, gunakanlah bilangan ganjil."
  },
  {
    "id": 34212,
    "hadith_number": 34,
    "tajuk_hadith": "Perintah Berwuduk dengan Memasukkan Air ke Dalam Hidung",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "Yahya related to me from Ibn Shihab from Abu Idris al-Khawlani\nfrom Abu Hurayra that the Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"The person doing wudu should snuff water up\nhis nose and blow it out again.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ تَوَضَّأَ فَلْيَسْتَنْثِرْ وَمَنِ اسْتَجْمَرَ فَلْيُوتِرْ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Ibn Shihab daripada Abu Idris al-Khawlani daripada Abu Hurairah bahawa Rasulullah SAW bersabda: \"Sesiapa yang berwuduk, hendaklah dia memasukkan air ke dalam hidungnya dan mengeluarkannya semula.\""
  },
  {
    "id": 34213,
    "hadith_number": 35,
    "tajuk_hadith": "Kebenaran Membasuh Mulut dan Membersih Hidung dengan Satu Genggam Air",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Yahya berkata bahawa dia mendengar Malik berkata bahawa tiada masalah dalam membasuh mulut dan membersih hidung hanya dengan satu genggam air."
  },
  {
    "id": 34214,
    "hadith_number": 36,
    "tajuk_hadith": "Kecelakaan Bagi Tumit yang Tidak Sempurna dalam Wuduk",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ، قَدْ دَخَلَ عَلَى عَائِشَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم يَوْمَ مَاتَ سَعْدُ بْنُ أَبِي وَقَّاصٍ فَدَعَا بِوَضُوءٍ فَقَالَتْ لَهُ عَائِشَةُ يَا عَبْدَ الرَّحْمَنِ أَسْبِغِ الْوُضُوءَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ وَيْلٌ لِلأَعْقَابِ مِنَ النَّارِ ‏\"‏ ‏.‏",
    "malay_translation": "Malik meriwayatkan bahawa telah sampai kepadanya bahawa Abd ar-Rahman ibn Abi Bakr telah menemui A'ishah, isteri Nabi s.a.w., pada hari kematian Sa'd ibn Abi Waqqas. Beliau meminta air untuk berwuduk. A'ishah berkata kepadanya, \"Wahai Abd ar-Rahman! Sempurnakanlah wudukmu, kerana aku telah mendengar Rasulullah s.a.w. bersabda, 'Kecelakaan bagi tumit daripada api neraka.'\""
  },
  {
    "id": 34215,
    "hadith_number": 37,
    "tajuk_hadith": "Hukum Membasuh Bahagian Bawah Seluar Dalam Wuduk dan Perkara yang Terlupa dalam Wuduk",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Yahya ibn Muhammad ibn\nTalhafrom Uthman ibn Abd ar-Rahman that his father related to him that\nhe had heard that Umar ibn al-Khattab used to wash what was beneath\nhis waist wrapper with water.\n\n\nYahya said that Malik was asked what a man should do if, when he\ndid wudu, he forgot and washed his face before he had rinsed his\nmouth, or washed his forearms before he had washed his face. He said,\n\"If someone washes his face before rinsing his mouth, he should rinse\nhis mouth and not wash his face again. If someone washes his forearms\nbefore his face, however, he should wash his forearms again so that he\nhas washed them after his face. This is if he is still near the place\n(of wudu).\"\n\n\nYahya said that Malik was asked about what a man should do if he\nhad forgotten to rinse his mouth and nose until he had prayed, and he\nsaid, \"He does not have to repeat the prayer, but should rinse his\nmouth and nose if he wishes to do any more prayers after that.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ مُحَمَّدِ بْنِ طَحْلاَءَ، عَنْ عُثْمَانَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَاهُ، حَدَّثَهُ أَنَّهُ، سَمِعَ عُمَرَ بْنَ الْخَطَّابِ، يَتَوَضَّأُ بِالْمَاءِ لِمَا تَحْتَ إِزَارِهِ ‏.‏ قَالَ يَحْيَى سُئِلَ مَالِكٌ عَنْ رَجُلٍ تَوَضَّأَ فَنَسِيَ فَغَسَلَ وَجْهَهُ قَبْلَ أَنْ يَتَمَضْمَضَ أَوْ غَسَلَ ذِرَاعَيْهِ قَبْلَ أَنْ يَغْسِلَ وَجْهَهُ فَقَالَ أَمَّا الَّذِي غَسَلَ وَجْهَهُ قَبْلَ أَنْ يَتَمَضْمَضَ فَلْيُمَضْمِضْ وَلاَ يُعِدْ غَسْلَ وَجْهِهِ وَأَمَّا الَّذِي غَسَلَ ذِرَاعَيْهِ قَبْلَ وَجْهِهِ فَلْيَغْسِلْ وَجْهَهُ ثُمَّ لِيُعِدْ غَسْلَ ذِرَاعَيْهِ حَتَّى يَكُونَ غَسْلُهُمَا بَعْدَ وَجْهِهِ إِذَا كَانَ ذَلِكَ فِي مَكَانِهِ أَوْ بِحَضْرَةِ ذَلِكَ ‏.‏ قَالَ يَحْيَى وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ نَسِيَ أَنْ يَتَمَضْمَضَ وَيَسْتَنْثِرَ حَتَّى صَلَّى قَالَ لَيْسَ عَلَيْهِ أَنْ يُعِيدَ صَلاَتَهُ وَلْيُمَضْمِضْ وَيَسْتَنْثِرْ مَا يَسْتَقْبِلُ إِنْ كَانَ يُرِيدُ أَنْ يُصَلِّيَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Muhammad bin Talha, daripada Uthman bin Abd ar-Rahman, bahawa bapanya meriwayatkan kepadanya bahawa dia pernah mendengar Umar bin al-Khattab membasuh bahagian bawah kainnya dengan air.\n\nYahya berkata bahawa Malik ditanya tentang apa yang harus dilakukan oleh seseorang jika, ketika dia berwuduk, dia terlupa dan membasuh mukanya sebelum dia berkumur, atau membasuh lengan bawahnya sebelum dia membasuh mukanya. Dia berkata, \"Jika seseorang membasuh mukanya sebelum berkumur, hendaklah dia berkumur dan tidak membasuh mukanya lagi. Jika seseorang membasuh lengan bawahnya sebelum mukanya, hendaklah dia membasuh lengan bawahnya lagi supaya dia membasuhnya selepas mukanya. Ini adalah jika dia masih berhampiran tempat (wuduk).\"\n\nYahya berkata bahawa Malik ditanya tentang apa yang harus dilakukan oleh seseorang jika dia terlupa untuk berkumur dan menyedut air ke dalam hidung sehingga dia telah solat, dan dia berkata, \"Dia tidak perlu mengulangi solatnya, tetapi hendaklah dia berkumur dan menyedut air ke dalam hidung jika dia ingin menunaikan solat lain selepas itu.\""
  },
  {
    "id": 34216,
    "hadith_number": 38,
    "tajuk_hadith": "Membasuh Tangan Sebelum Berwudhu' Setelah Bangun Tidur",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Abu'zZinad daripada al-Araj daripada Abu Hurayra",
    "english_text": "Yahya related to me from Malik from Abu'zZinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"When you wake up from sleep to pray, wash your hands\nbefore you put them in the wudu water, for you do not know where your\nhands have spent the night.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا اسْتَيْقَظَ أَحَدُكُمْ مِنْ نَوْمِهِ فَلْيَغْسِلْ يَدَهُ قَبْلَ أَنْ يُدْخِلَهَا فِي وَضُوئِهِ فَإِنَّ أَحَدَكُمْ لاَ يَدْرِي أَيْنَ بَاتَتْ يَدُهُ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Abu'zZinad daripada al-Araj daripada Abu Hurayra bahawa Rasulullah SAW bersabda, \"Apabila seseorang daripada kamu bangun daripada tidur untuk menunaikan solat, hendaklah dia membasuh tangannya sebelum memasukkannya ke dalam air wudhu', kerana sesungguhnya seseorang daripada kamu tidak tahu di mana tangannya bermalam.\""
  },
  {
    "id": 34217,
    "hadith_number": 39,
    "tajuk_hadith": "Wuduk Diperlukan Selepas Tidur Berbaring",
    "perawi_melayu": "Umar ibn al-Khattab",
    "english_text": "Yahya related to me from Malik from Zayd ibn Aslam that Umar ibn\nal-Khattab said, \"If you fall asleep Iying down you must do wudu (\nbefore you pray) . \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ إِذَا نَامَ أَحَدُكُمْ مُضْطَجِعًا فَلْيَتَوَضَّأْ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Zayd ibn Aslam bahawa Umar ibn al-Khattab berkata, \"Jika seseorang daripada kamu tertidur dalam keadaan berbaring, maka hendaklah dia berwuduk.\""
  },
  {
    "id": 34218,
    "hadith_number": 40,
    "tajuk_hadith": "Penjelasan Ayat Al-Quran Berkaitan Wuduk",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ تَفْسِيرَ، هَذِهِ الآيَةِ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلاَةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ وَامْسَحُوا بِرُءُوسِكُمْ وَأَرْجُلَكُمْ إِلَى الْكَعْبَيْنِ‏}‏ أَنَّ ذَلِكَ إِذَا قُمْتُمْ مِنَ الْمَضَاجِعِ ‏.‏ يَعْنِي النَّوْمَ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا أَنَّهُ لاَ يَتَوَضَّأُ مِنْ رُعَافٍ وَلاَ مِنْ دَمٍ وَلاَ مِنْ قَيْحٍ يَسِيلُ مِنَ الْجَسَدِ وَلاَ يَتَوَضَّأُ إِلاَّ مِنْ حَدَثٍ يَخْرُجُ مِنْ ذَكَرٍ أَوْ دُبُرٍ أَوْ نَوْمٍ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Zayd ibn Aslam bahawa tafsiran ayat, \"Wahai orang-orang yang beriman! Apabila kamu hendak mengerjakan solat, maka basuhlah muka kamu dan tangan kamu hingga ke siku, dan sapulah kepala kamu dan (basuhlah) kaki kamu hingga ke kedua mata kaki,\" merujuk kepada bangun daripada tempat tidur, iaitu tidur.\n\nYahya berkata bahawa Malik berkata, \"Keadaan pada kami adalah seseorang itu tidak perlu berwuduk kerana hidung berdarah, atau kerana darah, atau kerana nanah yang keluar dari badan. Seseorang itu hanya perlu berwuduk kerana perkara najis yang keluar daripada kemaluan atau dubur, atau kerana tidur.\""
  },
  {
    "id": 34219,
    "hadith_number": 41,
    "tajuk_hadith": "Ibnu Umar Tidur Sambil Duduk, Kemudian Solat Tanpa Wuduk",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Nafithat Ibn Umar used to sleep\nsitting and then would pray without doing wudu.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، كَانَ يَنَامُ جَالِسًا ثُمَّ يُصَلِّي وَلاَ يَتَوَضَّأُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Nafi', bahawa Ibnu Umar pernah tidur dalam keadaan duduk, kemudian solat tanpa berwuduk."
  },
  {
    "id": 34220,
    "hadith_number": 42,
    "tajuk_hadith": "Kesucian Air Laut dan Halalnya Bangkai Haiwan Laut",
    "perawi_melayu": "Al-Mughira ibn Abi Burda, dari Abu Hurairah",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ سَعِيدِ بْنِ سَلَمَةَ، - مِنْ آلِ بَنِي الأَزْرَقِ - عَنِ الْمُغِيرَةِ بْنِ أَبِي بُرْدَةَ، - وَهُوَ مِنْ بَنِي عَبْدِ الدَّارِ - أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّا نَرْكَبُ الْبَحْرَ وَنَحْمِلُ مَعَنَا الْقَلِيلَ مِنَ الْمَاءِ فَإِنْ تَوَضَّأْنَا بِهِ عَطِشْنَا أَفَنَتَوَضَّأُ بِهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ هُوَ الطَّهُورُ مَاؤُهُ الْحِلُّ مَيْتَتُهُ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Safwan ibn Sulaym, daripada Said ibn Salama dari Bani Azraq, daripada al-Mughira ibn Abi Burda dari kabilah Bani Abd ad-Dar, bahawa dia mendengar Abu Hurairah berkata tentang seorang lelaki yang datang kepada Rasulullah SAW dan berkata, \"Wahai Rasulullah! Kami belayar di laut dan kami tidak membawa banyak air tawar bersama kami, jika kami berwuduk dengannya, kami akan kehausan. Bolehkah kami berwuduk dengan air laut?\" Rasulullah SAW menjawab, \"Airnya suci, dan bangkai haiwannya halal.\""
  },
  {
    "id": 34221,
    "hadith_number": 43,
    "tajuk_hadith": "Kucing Tidak Najis",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Ishaq ibn Abdullah ibn Abi\nTalha from Humayda bint Abi Ubayda ibn Farwa that her maternal aunt\nKabsha bint Kab ibn Malik, who was the wife of the son of Abu Qatada\nal-Ansari, told her that once Abu Qatada was visiting her and she\npoured out some water for him to do wudu with. Just then a cat came to\ndrink from it, so he tilted the vessel towards it to let it drink.\nKabsha continued, \"He saw me looking at him and said, 'Are you\nsurprised, daughter of my brother?' I said, 'Yes.' He replied that the\nMessenger of Allah, may Allah bless him and grant him peace, said,\ncats are not impure. They intermingle with you .' \"\n\n\nYahya\nsaid that Malik said, \"There is no harm in that unless one sees\nimpurities on the cat's mouth.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ حُمَيْدَةَ بِنْتِ أَبِي عُبَيْدَةَ بْنِ فَرْوَةَ، عَنْ خَالَتِهَا، كَبْشَةَ بِنْتِ كَعْبِ بْنِ مَالِكٍ - وَكَانَتْ تَحْتَ ابْنِ أَبِي قَتَادَةَ الأَنْصَارِيِّ - أَنَّهَا أَخْبَرَتْهَا أَنَّ أَبَا قَتَادَةَ دَخَلَ عَلَيْهَا فَسَكَبَتْ لَهُ وَضُوءًا فَجَاءَتْ هِرَّةٌ لِتَشْرَبَ مِنْهُ فَأَصْغَى لَهَا الإِنَاءَ حَتَّى شَرِبَتْ قَالَتْ كَبْشَةُ فَرَآنِي أَنْظُرُ إِلَيْهِ فَقَالَ أَتَعْجَبِينَ يَا ابْنَةَ أَخِي قَالَتْ فَقُلْتُ نَعَمْ ‏.‏ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّهَا لَيْسَتْ بِنَجَسٍ إِنَّمَا هِيَ مِنَ الطَّوَّافِينَ عَلَيْكُمْ أَوِ الطَّوَّافَاتِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ishaq bin Abdullah bin Abi Talha, daripada Humayda binti Abi Ubayda bin Farwa, daripada ibu saudaranya, Kabsha binti Kab bin Malik – yang merupakan isteri kepada anak Abu Qatada al-Ansari – bahawa dia memberitahu bahawa Abu Qatada pernah datang melawatnya, lalu dia menuangkan air untuknya berwuduk. Tiba-tiba datang seekor kucing untuk minum daripada air itu, maka dia memiringkan bekas air itu kepadanya sehingga ia minum. Kabsha berkata, “Dia melihatku memandangnya lalu berkata, 'Adakah kamu terkejut, wahai anak saudaraku?' Aku berkata, 'Ya.' Dia menjawab bahawa Rasulullah ﷺ bersabda, 'Sesungguhnya ia (kucing) tidak najis. Sesungguhnya ia (kucing) adalah daripada kalangan yang sering bersama kamu.' ” Yahya berkata bahawa Malik berkata, “Tidak mengapa dalam hal itu melainkan jika seseorang melihat najis pada mulut kucing itu.”"
  },
  {
    "id": 34222,
    "hadith_number": 44,
    "tajuk_hadith": "Umar ibn al-Khattab dan Adab Minum di Tempat Air",
    "perawi_melayu": "Yahya ibn Abd ar-Rahman ibn Hatib",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said from Muhammad\nibn Ibrahim ibn alHarith at-Taymi from Yahya ibn Abd ar-Rahman ibn\nHatib that Umar ibn al-Khattab set out on one occasion with a party of\nriders, one of whom was Amr ibn al-As. They came to a watering place\nand Amr ibn al-As asked the man who owned it whether wild beasts drank\nfrom it. Umar ibn al-Khattab told the owner of the watering place not\nto answer, since the people drank after the wild beasts and the wild\nbeasts drank after them.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، عَنْ يَحْيَى بْنِ عَبْدِ الرَّحْمَنِ بْنِ حَاطِبٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، خَرَجَ فِي رَكْبٍ فِيهِمْ عَمْرُو بْنُ الْعَاصِ حَتَّى وَرَدُوا حَوْضًا فَقَالَ عَمْرُو بْنُ الْعَاصِ لِصَاحِبِ الْحَوْضِ يَا صَاحِبَ الْحَوْضِ هَلْ تَرِدُ حَوْضَكَ السِّبَاعُ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ يَا صَاحِبَ الْحَوْضِ لاَ تُخْبِرْنَا فَإِنَّا نَرِدُ عَلَى السِّبَاعِ وَتَرِدُ عَلَيْنَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said, daripada Muhammad bin Ibrahim bin al-Harith at-Taymi, daripada Yahya bin Abd ar-Rahman bin Hatib, bahawa Umar ibn al-Khattab keluar bersama sekumpulan penunggang, antaranya Amr ibn al-As. Mereka sampai ke tempat air, dan Amr ibn al-As bertanya kepada pemilik tempat air itu sama ada binatang buas minum daripadanya. Umar ibn al-Khattab memberitahu pemilik tempat air itu supaya tidak menjawab, kerana manusia minum selepas binatang buas dan binatang buas minum selepas mereka."
  },
  {
    "id": 34223,
    "hadith_number": 45,
    "tajuk_hadith": "Lelaki dan Isteri Berwudhu' Bersama di Zaman Rasulullah",
    "perawi_melayu": "Nafi",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to say that men and their wives used to do wudu together in the\ntime of the Messenger of Allah.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ إِنْ كَانَ الرِّجَالُ وَالنِّسَاءُ فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم لَيَتَوَضَّئُونَ جَمِيعًا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Nafi bahawa Abdullah ibn Umar pernah berkata: \"Sesungguhnya lelaki dan isteri mereka pernah berwudhu' bersama-sama di zaman Rasulullah ﷺ.\" "
  },
  {
    "id": 34224,
    "hadith_number": 46,
    "tajuk_hadith": "Pakaian Wanita dan Tempat Kotor",
    "perawi_melayu": "Umm Salama",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ عُمَارَةَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أُمِّ وَلَدٍ، لإِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَنَّهَا سَأَلَتْ أُمَّ سَلَمَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ إِنِّي امْرَأَةٌ أُطِيلُ ذَيْلِي وَأَمْشِي فِي الْمَكَانِ الْقَذِرِ قَالَتْ أُمُّ سَلَمَةَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يُطَهِّرُهُ مَا بَعْدَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Muhammad ibn Umara, daripada Muhammad ibn Ibrahim, daripada Umm Walad, hamba kepada Ibrahim ibn Abd ar-Rahman ibn Awf, bahawa dia bertanya kepada Umm Salama, isteri Nabi, sallallahu 'alaihi wasallam, dan berkata, \"Sesungguhnya aku adalah seorang wanita yang memanjangkan pakaiannya dan berjalan di tempat yang kotor.\" Umm Salama menjawab, Rasulullah, sallallahu 'alaihi wasallam bersabda, \"Apa yang mengikutinya (tempat yang bersih) menyucikannya.\""
  },
  {
    "id": 34225,
    "hadith_number": 47,
    "tajuk_hadith": "Rabiah ibn Abd ar-Rahman Muntah Beberapa Kali di Masjid Tanpa Membatalkan Solat",
    "perawi_melayu": "Yahya",
    "english_text": "Yahya related to me from Malik that he saw Rabia ibn Abd ar-\nRahman vomit several times when he was in the mosque and he did not\nleave, nor did he do wudu before he prayed.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ رَأَى رَبِيعَةَ بْنَ أَبِي عَبْدِ الرَّحْمَنِ يَقْلِسُ مِرَارًا وَهُوَ فِي الْمَسْجِدِ فَلاَ يَنْصَرِفُ وَلاَ يَتَوَضَّأُ حَتَّى يُصَلِّيَ ‏.‏ قَالَ يَحْيَى وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ قَلَسَ طَعَامًا هَلْ عَلَيْهِ وُضُوءٌ فَقَالَ لَيْسَ عَلَيْهِ وُضُوءٌ وَلْيَتَمَضْمَضْ مِنْ ذَلِكَ وَلْيَغْسِلْ فَاهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa beliau melihat Rabia ibn Abd ar-Rahman muntah beberapa kali ketika berada di masjid dan dia tidak beredar, juga tidak berwuduk sebelum solat.\n\nYahya berkata bahawa Malik ditanya sama ada seseorang yang memuntahkan makanan perlu berwuduk dan beliau berkata, \"Dia tidak perlu berwuduk, tetapi dia hendaklah berkumur-kumur di dalam mulutnya dan membasuh mulutnya.\""
  },
  {
    "id": 34226,
    "hadith_number": 48,
    "tajuk_hadith": "Abdullah bin Umar: Solat Selepas Menguruskan Jenazah & Soalan Berkaitan Muntah",
    "perawi_melayu": "Malik dari Nafi",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، حَنَّطَ ابْنًا لِسَعِيدِ بْنِ زَيْدٍ وَحَمَلَهُ ثُمَّ دَخَلَ الْمَسْجِدَ فَصَلَّى وَلَمْ يَتَوَضَّأْ ‏.‏ قَالَ يَحْيَى وَسُئِلَ مَالِكٌ هَلْ فِي الْقَىْءِ وُضُوءٌ قَالَ لاَ وَلَكِنْ لِيَتَمَضْمَضْ مِنْ ذَلِكَ وَلْيَغْسِلْ فَاهُ وَلَيْسَ عَلَيْهِ وُضُوءٌ ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku daripada Malik, daripada Nafi’, bahawa Abdullah bin Umar telah memandikan jenazah anak Said bin Zayd dan membawanya, kemudian masuk ke dalam masjid lalu solat tanpa berwudhu. Yahya berkata: Malik ditanya: Adakah perlu berwudhu kerana muntah? Malik menjawab: Tidak, tetapi hendaklah berkumur-kumur dan membasuh mulutnya, dan tidak perlu berwudhu."
  },
  {
    "id": 34227,
    "hadith_number": 49,
    "tajuk_hadith": "Nabi SAW Makan Bahu Kambing dan Solat Tanpa Wudu'",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Zayd Aslam, daripada Ata' ibn Yasar, daripada Abdullah Abbas",
    "english_text": "Yahya related to me from Malik from Zayd Aslam from Ata ibn Yasar\nfrom Abdullah Abbas that the Messenger of Allah, may Allah bless him\nand grant him peace, ate a shoulder of lamb and then prayed without\ndoing wudu.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، ‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَكَلَ كَتِفَ شَاةٍ ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Zayd Aslam, daripada Ata' ibn Yasar, daripada Abdullah Abbas bahawa Rasulullah SAW memakan bahu kambing kemudian solat tanpa berwudu'."
  },
  {
    "id": 34228,
    "hadith_number": 50,
    "tajuk_hadith": "Rasulullah SAW Berbuka Puasa dengan Barli Panggang di Khaybar",
    "perawi_melayu": "Suwayd ibn an-Numan",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said from Bushayr ibn Yasar, the mawla of the Bani Haritha, that Suwayd ibn anNuman told him that he went with the Messenger of Allah, may Allah bless him and grant him peace, on the expedition to Khaybar. When they reached as Suhba, which was near Khaybar, the Messenger of Allah, may Allah bless him and grant him peace, stopped and prayed asr. He asked for provisions but only parched barley was brought, so he asked for it to be moistened. The Messenger of Allah, may Allah bless him and grant him peace, ate and the people ate with him. Then he got up to do maghrib and rinsed his mouth out and they rinsed out theirs. Then he prayed without doing wudu.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، مَوْلَى بَنِي حَارِثَةَ عَنْ سُوَيْدِ بْنِ النُّعْمَانِ، أَنَّهُ أَخْبَرَهُ أَنَّهُ، خَرَجَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ خَيْبَرَ حَتَّى إِذَا كَانُوا بِالصَّهْبَاءِ - وَهِيَ مِنْ أَدْنَى خَيْبَرَ - نَزَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى الْعَصْرَ ثُمَّ دَعَا بِالأَزْوَادِ فَلَمْ يُؤْتَ إِلاَّ بِالسَّوِيقِ فَأَمَرَ بِهِ فَثُرِّيَ فَأَكَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَكَلْنَا ثُمَّ قَامَ إِلَى الْمَغْرِبِ فَمَضْمَضَ وَمَضْمَضْنَا ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Yahya bin Said daripada Bushayr bin Yasar, maula Bani Haritha, bahawa Suwayd ibn an-Numan menceritakan kepadanya bahawa dia keluar bersama Rasulullah SAW dalam peperangan ke Khaybar. Apabila mereka sampai di as-Suhba, yang berhampiran Khaybar, Rasulullah SAW berhenti dan menunaikan solat Asar. Baginda meminta bekalan makanan tetapi hanya barli panggang yang dibawa, lalu baginda meminta ia dilembapkan. Rasulullah SAW makan dan orang ramai juga makan bersama baginda. Kemudian baginda bangun untuk solat Maghrib dan berkumur-kumur dan mereka juga berkumur-kumur. Kemudian baginda solat tanpa berwudhu."
  },
  {
    "id": 34229,
    "hadith_number": 51,
    "tajuk_hadith": "Umar bin al-Khattab Solat Tanpa Wuduk Setelah Makan",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik that both Muhammad ibn al-Munkadir\nand Safwan ibn Sulaym transmitted to him from Muhammad ibn Ibrahim ibn\nal-Harith at-Taymi from Rabia ibn Abdullah ibn al-Hudayr that he had\neaten an evening meal with Umar ibn al-Khattab who then prayed without\ndoing wudu.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، وَعَنْ صَفْوَانَ بْنِ سُلَيْمٍ، أَنَّهُمَا أَخْبَرَاهُ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، عَنْ رَبِيعَةَ بْنِ عَبْدِ اللَّهِ بْنِ الْهُدَيْرِ، أَنَّهُ تَعَشَّى مَعَ عُمَرَ بْنِ الْخَطَّابِ ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik bahawa kedua-dua Muhammad ibn al-Munkadir dan Safwan ibn Sulaym meriwayatkan kepadanya daripada Muhammad ibn Ibrahim ibn al-Harith at-Taymi daripada Rabia ibn Abdullah ibn al-Hudayr bahawa dia telah makan malam bersama Umar ibn al-Khattab yang kemudiannya solat tanpa berwuduk."
  },
  {
    "id": 34230,
    "hadith_number": 52,
    "tajuk_hadith": "Uthman ibn Affan Makan Roti dan Daging, Kemudian Solat tanpa Wudu'",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Damra ibn Said al-Mazini from\nAban ibn Uthman that Uthman ibn Affan ate bread and meat, rinsed his\nmouth out, washed his hands and wiped his face with them, and then\nprayed without doing wudu.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ ضَمْرَةَ بْنِ سَعِيدٍ الْمَازِنِيِّ، عَنْ أَبَانَ بْنِ عُثْمَانَ، أَنَّ عُثْمَانَ بْنَ عَفَّانَ، أَكَلَ خُبْزًا وَلَحْمًا ثُمَّ مَضْمَضَ وَغَسَلَ يَدَيْهِ وَمَسَحَ بِهِمَا وَجْهَهُ ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik, daripada Damra ibn Said al-Mazini, daripada Aban ibn Uthman bahawa Uthman ibn Affan makan roti dan daging, kemudian berkumur, membasuh tangannya dan menyapu wajahnya dengan tangan tersebut, kemudian solat tanpa berwudu'."
  },
  {
    "id": 34231,
    "hadith_number": 53,
    "tajuk_hadith": "Ali dan Ibnu Abbas Tidak Berwudhu' Selepas Makan Makanan Dimasak",
    "perawi_melayu": "Malik",
    "english_text": "Yahya related to me from Malik that he had heard that Ali ibn Abi\nTalib and Abdullah ibn Abbas did not do wudu after eating cooked food.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ، وَعَبْدَ اللَّهِ بْنَ عَبَّاسٍ، كَانَا لاَ يَتَوَضَّآنِ مِمَّا مَسَّتِ النَّارُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik bahawa beliau telah mendengar bahawa Ali bin Abi Talib dan Abdullah bin Abbas tidak berwudhu' selepas memakan makanan yang dimasak."
  },
  {
    "id": 34232,
    "hadith_number": 54,
    "tajuk_hadith": "Tidak Perlu Wudu Selepas Makan Makanan Dimasak",
    "perawi_melayu": "Yahya ibn Said",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said that he asked\nAbdullah ibn Amir ibn Rabia whether a man who did wudu for prayer and\nthen ate cooked food had to do wudu again. He said, \"I saw my father\ndo that without doing wudu .\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَأَلَ عَبْدَ اللَّهِ بْنَ عَامِرِ بْنِ رَبِيعَةَ عَنِ الرَّجُلِ، يَتَوَضَّأُ لِلصَّلاَةِ ثُمَّ يُصِيبُ طَعَامًا قَدْ مَسَّتْهُ النَّارُ أَيَتَوَضَأُ قَالَ رَأَيْتُ أَبِي يَفْعَلُ ذَلِكَ وَلاَ يَتَوَضَّأُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya ibn Said bahawa dia bertanya kepada Abdullah ibn Amir ibn Rabia tentang seorang lelaki yang berwudu untuk solat, kemudian memakan makanan yang telah dimasak. Adakah dia perlu berwudu lagi? Dia berkata, \"Saya melihat ayah saya melakukan demikian tanpa berwudu.\""
  },
  {
    "id": 34233,
    "hadith_number": 55,
    "tajuk_hadith": "Abu Bakr as-Siddiq Makan Daging dan Solat Tanpa Wuduk",
    "perawi_melayu": "Jabir ibn Abdullah al-Ansari",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي نُعَيْمٍ، وَهْبِ بْنِ كَيْسَانَ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ الأَنْصَارِيَّ، يَقُولُ رَأَيْتُ أَبَا بَكْرٍ الصِّدِّيقَ أَكَلَ لَحْمًا ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Abu Nuaym Wahb ibn Kaysan bahawa dia mendengar Jabir ibn Abdullah al-Ansari berkata, \"Saya melihat Abu Bakr as-Siddiq makan daging, kemudian solat tanpa berwuduk.\""
  },
  {
    "id": 34234,
    "hadith_number": 56,
    "tajuk_hadith": "Rasulullah SAW Makan dan Solat Tanpa Wudhu Selepasnya",
    "perawi_melayu": "Muhammad ibn al-Munkadir",
    "english_text": "Yahya related to me from Malik from Muhammad ibn al-Munkadir that\nthe Messenger of Allah, may Allah bless him and grant him peace, was\ninvited to eat, and some bread and meat was brought to him. He ate\nsome of it, and then did wudu and prayed. Then more of the same food\nwas brought and he ate some more and then prayed without doing wudu.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دُعِيَ لِطَعَامٍ فَقُرِّبَ إِلَيْهِ خُبْزٌ وَلَحْمٌ فَأَكَلَ مِنْهُ ثُمَّ تَوَضَّأَ وَصَلَّى ثُمَّ أُتِيَ بِفَضْلِ ذَلِكَ الطَّعَامِ فَأَكَلَ مِنْهُ ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Muhammad ibn al-Munkadir bahawa Rasulullah SAW dijemput untuk makan, dan dibawakan kepada Baginda roti dan daging. Baginda makan sedikit daripadanya, kemudian berwudhu dan solat. Kemudian, makanan yang sama dibawa lagi dan Baginda makan lagi, kemudian solat tanpa berwudhu."
  },
  {
    "id": 34235,
    "hadith_number": 57,
    "tajuk_hadith": "Anas bin Malik dan Wuduk Selepas Makan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ زَيْدٍ الأَنْصَارِيِّ، أَنَّ أَنَسَ بْنَ مَالِكٍ، قَدِمَ مِنَ الْعِرَاقِ فَدَخَلَ عَلَيْهِ أَبُو طَلْحَةَ وَأُبَىُّ بْنُ كَعْبٍ فَقَرَّبَ لَهُمَا طَعَامًا قَدْ مَسَّتْهُ النَّارُ فَأَكَلُوا مِنْهُ فَقَامَ أَنَسٌ فَتَوَضَّأَ فَقَالَ أَبُو طَلْحَةَ وَأُبَىُّ بْنُ كَعْبٍ مَا هَذَا يَا أَنَسُ أَعِرَاقِيَّةٌ فَقَالَ أَنَسٌ لَيْتَنِي لَمْ أَفْعَلْ ‏.‏ وَقَامَ أَبُو طَلْحَةَ وَأُبَىُّ بْنُ كَعْبٍ فَصَلَّيَا وَلَمْ يَتَوَضَّآ ‏.‏",
    "malay_translation": "Diriwayatkan kepada saya daripada Malik, daripada Musa bin Uqba, daripada Abd ar-Rahman bin Yazid al-Ansari bahawa ketika Anas bin Malik pulang dari Iraq, Abu Talha dan Ubayy ibn Kab menziarahinya. Beliau menghidangkan makanan yang telah dimasak dan mereka makan, kemudian Anas bangun dan mengambil wuduk. Abu Talha dan Ubayy ibn Kab bertanya, \"Apakah ini, Anas? Adakah ini adat orang Iraq?\" dan Anas berkata, \"Saya berharap saya tidak melakukannya.\" (iaitu wuduk). Abu Talha dan Ubayy ibn Kab berdua bangun dan solat tanpa mengambil wuduk."
  },
  {
    "id": 34236,
    "hadith_number": 58,
    "tajuk_hadith": "Penggunaan Tiga Batu untuk Pembersihan Selepas Buang Air",
    "perawi_melayu": "Yahya meriwayatkan dari Malik dari Hisham ibn Urwa dari ayahnya",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that the Messenger of Allah, may Allah bless him and grant him\npeace, was asked about cleaning after excretion. He replied, \"Are any\nof you unable to find three stones?\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ عَنْ الاِسْتِطَابَةِ فَقَالَ ‏\n\"‏ أَوَلاَ يَجِدُ أَحَدُكُمْ ثَلاَثَةَ أَحْجَارٍ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan dari Malik dari Hisham bin Urwa dari ayahnya bahawa Rasulullah ﷺ pernah ditanya tentang cara bersuci selepas membuang air. Baginda menjawab, \"Adakah sesiapa di antara kamu tidak dapat mencari tiga biji batu?\""
  },
  {
    "id": 34237,
    "hadith_number": 59,
    "tajuk_hadith": "Mengenali Umat di Hari Kiamat dan Hawd Nabi",
    "perawi_melayu": "Yahya meriwayatkan kepada saya daripada Malik daripada al-Ala ibn Abd ar-Rahman daripada bapanya daripada Abu Hurayra",
    "english_text": "the watering\nplace of the Prophet, may Allah bless him and grant him peace, from\nwhich he will give to the people of his community on the day of\nrising.)\" They asked him, \"Messenger of Allah! How will you recognise\nthose of your community who come after you?\"\n\n\nHe said,\n\"Doesn't a man who has horses with white legs and white blazes on\ntheir foreheads among totally black horses recognise which ones are\nhis own?\" They said, \"Of course, Messenger of Allah.\" He went on,\n\"Even so will they come on the day of rising with white marks on their\nforeheads, hands and feet from wudu, and I will precede them to the\nHawd. Some men will be driven away from the Hawd as if they were\nstraying camels and I shall call out to them, 'Will you not come? Will\nyou not come? Will you not come?' and someone will say, 'They changed\nthings after you,' so I shall say, 'Then away with them, away with\nthem, away with them!' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ إِلَى الْمَقْبُرَةِ فَقَالَ ‏\"‏ السَّلاَمُ عَلَيْكُمْ دَارَ قَوْمٍ مُؤْمِنِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لاَحِقُونَ وَدِدْتُ أَنِّي قَدْ رَأَيْتُ إِخْوَانَنَا ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ أَلَسْنَا بِإِخْوَانِكَ قَالَ ‏\"‏ بَلْ أَنْتُمْ أَصْحَابِي وَإِخْوَانُنَا الَّذِينَ لَمْ يَأْتُوا بَعْدُ وَأَنَا فَرَطُهُمْ عَلَى الْحَوْضِ ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ كَيْفَ تَعْرِفُ مَنْ يَأْتِي بَعْدَكَ مِنْ أُمَّتِكَ قَالَ ‏\"‏ أَرَأَيْتَ لَوْ كَانَ لِرَجُلٍ خَيْلٌ غُرٌّ مُحَجَّلَةٌ فِي خَيْلٍ دُهْمٍ بُهْمٍ أَلاَ يَعْرِفُ خَيْلَهُ ‏\"‏ ‏.‏ قَالُوا بَلَى يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ فَإِنَّهُمْ يَأْتُونَ يَوْمَ الْقِيَامَةِ غُرًّا مُحَجَّلِينَ مِنَ الْوُضُوءِ وَأَنَا فَرَطُهُمْ عَلَى الْحَوْضِ فَلاَ يُذَادَنَّ رِجَالٌ عَنْ حَوْضِي كَمَا يُذَادُ الْبَعِيرُ الضَّالُّ أُنَادِيهِمْ أَلاَ هَلُمَّ أَلاَ هَلُمَّ أَلاَ هَلُمَّ فَيُقَالُ إِنَّهُمْ قَدْ بَدَّلُوا بَعْدَكَ فَأَقُولُ فَسُحْقًا فَسُحْقًا فَسُحْقًا ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, “Tempat minum (Hawd) Nabi SAW, yang akan diberikan kepada umatnya pada hari kebangkitan.” Mereka bertanya, “Wahai Rasulullah! Bagaimana engkau akan mengenali mereka yang datang sesudahmu?”\n\nBaginda bersabda, “Tidakkah seorang lelaki yang mempunyai kuda dengan kaki dan dahi yang putih di antara kuda yang hitam legam, mengenal kuda-kudanya sendiri?” Mereka menjawab, “Tentu sekali, wahai Rasulullah.” Baginda bersabda, “Begitu juga mereka akan datang pada hari kebangkitan dengan tanda putih pada dahi, tangan dan kaki mereka kerana wuduk, dan aku akan mendahului mereka ke Hawd. Sesetengah lelaki akan dihalau dari Hawd seperti mereka adalah unta yang sesat dan aku akan memanggil mereka, 'Tidakkah kamu datang? Tidakkah kamu datang? Tidakkah kamu datang?' dan seseorang akan berkata, 'Mereka telah mengubah perkara selepasmu,' maka aku akan berkata, 'Jauhilah mereka, jauhilah mereka, jauhilah mereka!'”"
  },
  {
    "id": 34238,
    "hadith_number": 60,
    "tajuk_hadith": "Keutamaan Wuduk dan Solat dalam Pengampunan Dosa",
    "perawi_melayu": "Humran, bekas hamba Uthman ibn Affan",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather from Humran, the mawla of Uthman ibn Affan, that Uthman ibn\nAffan was once sitting on the Maqaid (the benches surrounding the\nMadina Mosque, or else a stone near Uthman ibn Affan's house where he\nsat to discuss with people), when the muadhdhin came and told him that\nit was time for the asr prayer. He called for water and did wudu. Then\nhe said, \"By Allah, I shall tell you something which I would not tell\nyou if it were not in the Book of Allah. I heard the Messenger of\nAllah, may Allah bless him and grant him peace, say, 'If a man does\nwudu, and makes sure he does it correctly, and then does the prayer,\nhe will be forgiven everything that he does between then and the time\nwhen he prays the next prayer.' \"\n\n\nYahya said that Malik said,\n\"I believe he meant this ayat - 'Establish prayer at the two ends of\nthe day and in some watches of the night. Good actions take away wrong\nactions. That is a reminder for those who remember.' \" (Sura 11 ayat\n114).",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ حُمْرَانَ، مَوْلَى عُثْمَانَ بْنِ عَفَّانَ أَنَّ عُثْمَانَ بْنَ عَفَّانَ، جَلَسَ عَلَى الْمَقَاعِدِ فَجَاءَ الْمُؤَذِّنُ فَآذَنَهُ بِصَلاَةِ الْعَصْرِ فَدَعَا بِمَاءٍ فَتَوَضَّأَ ثُمَّ قَالَ وَاللَّهِ لأُحَدِّثَنَّكُمْ حَدِيثًا لَوْلاَ أَنَّهُ فِي كِتَابِ اللَّهِ مَا حَدَّثْتُكُمُوهُ ثُمَّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَا مِنِ امْرِئٍ يَتَوَضَّأُ فَيُحْسِنُ وُضُوءَهُ ثُمَّ يُصَلِّي الصَّلاَةَ إِلاَّ غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الصَّلاَةِ الأُخْرَى حَتَّى يُصَلِّيَهَا ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Hisham bin Urwa, daripada bapanya, daripada Humran, bekas hamba Uthman bin Affan, bahawa Uthman bin Affan pernah duduk di atas Maqaid (bangku-bangku mengelilingi Masjid Madinah, atau batu berhampiran rumah Uthman bin Affan di mana beliau duduk berbincang dengan orang ramai), ketika muazzin datang dan memberitahunya bahawa waktu solat Asar telah tiba. Beliau meminta air dan mengambil wuduk. Kemudian beliau berkata, \"Demi Allah, aku akan menceritakan kepada kamu sesuatu yang tidak akan aku ceritakan jika ia tidak ada dalam Kitab Allah. Aku mendengar Rasulullah s.a.w bersabda, 'Jika seseorang berwuduk, dan memastikan dia melakukannya dengan betul, dan kemudian menunaikan solat, maka dia akan diampuni segala yang dilakukannya antara waktu tersebut dan waktu dia menunaikan solat yang berikutnya.'\"\n\n\nYahya berkata bahawa Malik berkata,\n\"Saya percaya beliau maksudkan ayat ini - 'Dirikanlah solat pada kedua-dua hujung siang (pagi dan petang) dan pada sebahagian daripada malam. Sesungguhnya amal kebajikan itu menghapuskan (dosa) kejahatan. Itulah peringatan bagi orang-orang yang mahu mengambil peringatan.' \" (Surah 11 ayat 114)."
  },
  {
    "id": 34239,
    "hadith_number": 61,
    "tajuk_hadith": "Pembersihan Dosa Melalui Wudhu dan Ganjaran Seterusnya",
    "perawi_melayu": "Zayd ibn Aslam, Ata ibn Yasar, daripada Abdullah as-Sanabihi",
    "english_text": "Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn\nYasar from Abdullah as-Sanabihi that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"A trusting slave does wudu and\nas he rinses his mouth the wrong actions leave it. As he cleans his\nnose the wrong actions leave it. As he washes his face, the wrong\nactions leave it, even from underneath his eyelashes. As he washes his\nhands the wrong actions leave them, even from underneath his\nfingernails. As he wipes his head the wrong actions leave it, even\nfrom his ears. And as he washes his feet the wrong actions leave them,\neven from underneath the toenails of both his feet.\" He added, \"Then\nhis walking to the mosque and his prayer are an extra reward for him.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ عَبْدِ اللَّهِ الصُّنَابِحِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا تَوَضَّأَ الْعَبْدُ الْمُؤْمِنُ فَتَمَضْمَضَ خَرَجَتِ الْخَطَايَا مِنْ فِيهِ وَإِذَا اسْتَنْثَرَ خَرَجَتِ الْخَطَايَا مِنْ أَنْفِهِ فَإِذَا غَسَلَ وَجْهَهُ خَرَجَتِ الْخَطَايَا مِنْ وَجْهِهِ حَتَّى تَخْرُجَ مِنْ تَحْتِ أَشْفَارِ عَيْنَيْهِ فَإِذَا غَسَلَ يَدَيْهِ خَرَجَتِ الْخَطَايَا مِنْ يَدَيْهِ حَتَّى تَخْرُجَ مِنْ تَحْتِ أَظْفَارِ يَدَيْهِ فَإِذَا مَسَحَ بِرَأْسِهِ خَرَجَتِ الْخَطَايَا مِنْ رَأْسِهِ حَتَّى تَخْرُجَ مِنْ أُذُنَيْهِ فَإِذَا غَسَلَ رِجْلَيْهِ خَرَجَتِ الْخَطَايَا مِنْ رِجْلَيْهِ حَتَّى تَخْرُجَ مِنْ تَحْتِ أَظْفَارِ رِجْلَيْهِ - قَالَ - ثُمَّ كَانَ مَشْيُهُ إِلَى الْمَسْجِدِ وَصَلاَتُهُ نَافِلَةً لَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Zayd ibn Aslam, daripada Ata ibn Yasar, daripada Abdullah as-Sanabihi, bahawa Rasulullah SAW bersabda, \"Apabila seorang hamba yang beriman berwudhu', maka ketika dia berkumur, keluarlah kesalahan-kesalahan dari mulutnya. Apabila dia membersihkan hidungnya, keluarlah kesalahan-kesalahan dari hidungnya. Apabila dia membasuh wajahnya, keluarlah kesalahan-kesalahan dari wajahnya, sehingga keluar dari bawah bulu matanya. Apabila dia membasuh kedua tangannya, keluarlah kesalahan-kesalahan dari kedua tangannya, sehingga keluar dari bawah kuku-kukunya. Apabila dia menyapu kepalanya, keluarlah kesalahan-kesalahan dari kepalanya, sehingga keluar dari kedua telinganya. Dan apabila dia membasuh kedua kakinya, keluarlah kesalahan-kesalahan dari kedua kakinya, sehingga keluar dari bawah kuku jari kedua kakinya.\" Baginda menambah, \"Kemudian, langkahnya ke masjid dan solatnya adalah sebagai ganjaran tambahan baginya.\""
  },
  {
    "id": 34240,
    "hadith_number": 62,
    "tajuk_hadith": "Keistimewaan Wudhu dan Penghapusan Dosa",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Suhayl ibn Abi Salih, daripada bapanya, daripada Abu Hurayra.",
    "english_text": "Yahya related to me from Malik from Suhayl ibn Abi Salih from his\nfather from Abu Hurayra that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"A muslim slave (or a trusting slave)\ndoes wudu and as he washes his face every wrong action he has seen\nwith his eyes leaves with the water (or the last drop of water). As he\nwashes his hands every wrong action he has done with his hands leaves\nwith the water (orthe last drop of water). And as he washes his feet\nevery wrong action his feet have walked to leaves with the water (or\nthe last drop of water) so that he comes away purified of wrong\nactions.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا تَوَضَّأَ الْعَبْدُ الْمُسْلِمُ - أَوِ الْمُؤْمِنُ - فَغَسَلَ وَجْهَهُ خَرَجَتْ مِنْ وَجْهِهِ كُلُّ خَطِيئَةٍ نَظَرَ إِلَيْهَا بِعَيْنَيْهِ مَعَ الْمَاءِ - أَوْ مَعَ آخِرِ قَطْرِ الْمَاءِ - فَإِذَا غَسَلَ يَدَيْهِ خَرَجَتْ مِنْ يَدَيْهِ كُلُّ خَطِيئَةٍ بَطَشَتْهَا يَدَاهُ مَعَ الْمَاءِ - أَوْ مَعَ آخِرِ قَطْرِ الْمَاءِ فَإِذَا غَسَلَ رِجْلَيْهِ خَرَجَتْ كُلُّ خَطِيئَةٍ مَشَتْهَا رِجْلاَهُ مَعَ الْمَاءِ - أَوْ مَعَ آخِرِ قَطْرِ الْمَاءِ - حَتَّى يَخْرُجَ نَقِيًّا مِنَ الذُّنُوبِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Suhayl ibn Abi Salih, daripada bapanya, daripada Abu Hurayra bahawa Rasulullah SAW bersabda, \"Apabila seorang hamba Muslim (atau seorang hamba yang beriman) berwudhu, dan membasuh mukanya, maka keluarlah dari mukanya setiap kesalahan yang telah dilihat oleh kedua matanya bersama air (atau titisan air yang terakhir). Apabila dia membasuh kedua tangannya, maka keluarlah dari kedua tangannya setiap kesalahan yang telah dilakukan oleh kedua tangannya bersama air (atau titisan air yang terakhir). Dan apabila dia membasuh kedua kakinya, maka keluarlah dari kedua kakinya setiap kesalahan yang telah dilalui oleh kedua kakinya bersama air (atau titisan air yang terakhir), sehingga dia keluar dalam keadaan bersih daripada dosa.\""
  },
  {
    "id": 34241,
    "hadith_number": 63,
    "tajuk_hadith": "Air Mengalir dari Jari Nabi SAW untuk Wuduk",
    "perawi_melayu": "Ishaq ibn Abdullah ibn Abi Talha, daripada Anas ibn Malik",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَحَانَتْ صَلاَةُ الْعَصْرِ فَالْتَمَسَ النَّاسُ وَضُوءًا فَلَمْ يَجِدُوهُ فَأُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِوَضُوءٍ فِي إِنَاءٍ فَوَضَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ذَلِكَ الإِنَاءِ يَدَهُ ثُمَّ أَمَرَ النَّاسَ يَتَوَضَّئُونَ مِنْهُ - قَالَ أَنَسٌ - فَرَأَيْتُ الْمَاءَ يَنْبُعُ مِنْ تَحْتِ أَصَابِعِهِ فَتَوَضَّأَ النَّاسُ حَتَّى تَوَضَّئُوا مِنْ عِنْدِ آخِرِهِمْ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ishaq ibn Abdullah ibn Abi Talha, daripada Anas ibn Malik, bahawa beliau berkata, \"Saya melihat Rasulullah SAW ketika waktu solat Asar telah tiba. Orang ramai mencari air untuk berwuduk tetapi tidak menjumpainya. Kemudian, Rasulullah SAW dibawakan air wuduk di dalam sebuah bekas. Rasulullah SAW meletakkan tangannya ke dalam bekas itu, kemudian baginda menyuruh semua orang berwuduk daripadanya.\" Anas menambah, \"Saya melihat air memancut keluar dari jari-jarinya. Kemudian, semua orang berwuduk sehingga orang yang terakhir.\""
  },
  {
    "id": 34242,
    "hadith_number": 64,
    "tajuk_hadith": "Keutamaan Berjalan ke Masjid untuk Solat",
    "perawi_melayu": "Nuaym ibn Abdullah al-Madani al-Mujmir, daripada Abu Hurairah",
    "english_text": "Yahya related to me from Malik from Nuaym ibn Abdullah al-Madani\nal-Mujmir that he heard Abu Hurayra say, \"If someone does wudu and\ndoes it correctly and then goes off intending to do the prayer, then\nhe is in prayer as long as he intends to do the prayer. A good action\nis written for every alternate step he makes and a wrong action is\nerased for the second. When you hear the iqama do not lengthen your\nstride, and the one who has the greatest reward is the one whose house\nis farthest away.\" They said, \"Why, Abu Hurayra?\" He replied, \"Because\nof the greater number of steps.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمَدَنِيِّ الْمُجْمِرِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ مَنْ تَوَضَّأَ فَأَحْسَنَ وُضُوءَهُ ثُمَّ خَرَجَ عَامِدًا إِلَى الصَّلاَةِ فَإِنَّهُ فِي صَلاَةٍ مَادَامَ يَعْمِدُ إِلَى الصَّلاَةِ وَإِنَّهُ يُكْتَبُ لَهُ بِإِحْدَى خُطْوَتَيْهِ حَسَنَةٌ وَيُمْحَى عَنْهُ بِالأُخْرَى سَيِّئَةٌ فَإِذَا سَمِعَ أَحَدُكُمُ الإِقَامَةَ فَلاَ يَسْعَ فَإِنَّ أَعْظَمَكُمْ أَجْرًا أَبْعَدُكُمْ دَارًا ‏.‏ قَالُوا لِمَ يَا أَبَا هُرَيْرَةَ قَالَ مِنْ أَجْلِ كَثْرَةِ الْخُطَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Nuaym ibn Abdullah al-Madani al-Mujmir, bahawa dia mendengar Abu Hurairah berkata, \"Sesiapa yang berwuduk dengan sempurna kemudian keluar dengan niat untuk menunaikan solat, maka dia seolah-olah berada dalam solat selagi dia berniat untuk solat. Setiap langkah yang dilalui akan ditulis satu kebaikan, dan satu keburukan akan dihapuskan. Apabila kamu mendengar iqamah, janganlah berlari, dan sesungguhnya orang yang paling besar pahalanya adalah orang yang rumahnya paling jauh (dari masjid).\" Mereka bertanya, \"Mengapa, wahai Abu Hurairah?\" Beliau menjawab, \"Kerana banyaknya langkah (yang diambil).\""
  },
  {
    "id": 34243,
    "hadith_number": 65,
    "tajuk_hadith": "Cara Berwuduk Selepas Buang Air Besar",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said that he heard\nsomeone ask Said ibn al-Musayyab about washing off excreta with water.\nSaid said, \"That is the way women wash.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يُسْأَلُ عَنِ الْوُضُوءِ، مِنَ الْغَائِطِ بِالْمَاءِ فَقَالَ سَعِيدٌ إِنَّمَا ذَلِكَ وُضُوءُ النِّسَاءِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Yahya ibn Said bahawa dia mendengar seseorang bertanya kepada Said ibn al-Musayyab tentang berwuduk (membersihkan diri) selepas buang air besar dengan air. Said berkata, \"Itu adalah cara wanita berwuduk.\""
  },
  {
    "id": 34244,
    "hadith_number": 66,
    "tajuk_hadith": "Cara Membersihkan Bekas yang Dijilat Anjing",
    "perawi_melayu": "Abu Hurairah رضي الله عنه",
    "english_text": "If a dog drinks from your vessel, wash it seven times.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا شَرِبَ الْكَلْبُ فِي إِنَاءِ أَحَدِكُمْ فَلْيَغْسِلْهُ سَبْعَ مَرَّاتٍ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik daripada Abu'z-Zinad daripada al-A'raj daripada Abu Hurairah رضي الله عنه bahawa Rasulullah ﷺ bersabda, \"Jika anjing minum dari bekas kamu, basuhlah ia tujuh kali.\""
  },
  {
    "id": 34245,
    "hadith_number": 67,
    "tajuk_hadith": "Usaha Menuju Istiqamah dalam Ibadah",
    "perawi_melayu": "Malik",
    "english_text": "Try to go straight, although you will not be able to do so. Act, and the best of your actions is the prayer. And only a mumin is constant in his wudu.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ اسْتَقِيمُوا وَلَنْ تُحْصُوا وَاعْمَلُوا وَخَيْرُ أَعْمَالِكُمُ الصَّلاَةُ وَلاَ يُحَافِظُ عَلَى الْوُضُوءِ إِلاَّ مُؤْمِنٌ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik bahawa dia mendengar bahawa Rasulullah ﷺ bersabda, \"Berusahalah untuk istiqamah (tetap dalam kebaikan), walaupun kamu tidak akan mampu melakukannya sepenuhnya. Beramallah, dan sebaik-baik amalan kamu adalah solat. Dan tidaklah seseorang itu sentiasa menjaga wuduknya melainkan seorang mukmin.\""
  },
  {
    "id": 34246,
    "hadith_number": 68,
    "tajuk_hadith": "Cara Abdullah bin Umar Memasukkan Air ke Telinga",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Nafi'",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَأْخُذُ الْمَاءَ بِأَصْبُعَيْهِ لأُذُنَيْهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Nafi' bahawa Abdullah bin Umar menggunakan dua jarinya untuk mengambil air ke telinganya."
  },
  {
    "id": 34247,
    "hadith_number": 69,
    "tajuk_hadith": "Hukum Mengusap Serban",
    "perawi_melayu": "Jabir bin Abdullah al-Ansari",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ الأَنْصَارِيَّ، سُئِلَ عَنِ الْمَسْحِ، عَلَى الْعِمَامَةِ فَقَالَ لاَ حَتَّى يُمْسَحَ الشَّعْرُ بِالْمَاءِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, bahawa telah sampai kepadanya bahawa Jabir bin Abdullah al-Ansari pernah ditanya tentang mengusap serban. Beliau menjawab, \"Tidak boleh (mengusap serban) kecuali jika kamu telah membasahi rambutmu dengan air terlebih dahulu.\""
  },
  {
    "id": 34248,
    "hadith_number": 70,
    "tajuk_hadith": "Urwah bin Zubayr Melepaskan Serban dan Menyapu Kepala dengan Air",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa that Abu Urwa\nibn az-Zubayr used to take off his turban and wipe his head with\nwater.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، أَنَّ أَبَاهُ، عُرْوَةَ بْنَ الزُّبَيْرِ كَانَ يَنْزِعُ الْعِمَامَةَ وَيَمْسَحُ رَأْسَهُ بِالْمَاءِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Hisham bin Urwah bahawa Abu Urwah bin az-Zubayr biasa menanggalkan serbannya dan menyapu kepalanya dengan air."
  },
  {
    "id": 34249,
    "hadith_number": 71,
    "tajuk_hadith": "Safiyya bint Abi Ubayd Menyapu Kepala dengan Air Semasa Berwuduk",
    "perawi_melayu": "Malik daripada Nafi",
    "english_text": "Yahya related to me from Malik from Nafi that she saw Safiyya\nbint Abi Ubayd, the wife of Abdullah ibn 'Umar, take off her head-\ncovering and wipe her head with water. Nafi was a child at the time.\n\n\nMalik was asked about a man who did wudu but forgot to wipe\nhis head until the water had dried. He said, \"I consider that he\nshould wipe his head and then repeat the prayer if he has already\nperformed it.\"\n\n\nMalik was asked about a man who did wudu but\nforgot to wipe his head until the water had dried. He said, \"I\nconsider that he should wipe his head and then repeat the prayer if he\nhas already performed it.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّهُ رَأَى صَفِيَّةَ بِنْتَ أَبِي عُبَيْدٍ امْرَأَةَ عَبْدِ اللَّهِ بْنِ عُمَرَ تَنْزِعُ خِمَارَهَا وَتَمْسَحُ عَلَى رَأْسِهَا بِالْمَاءِ وَنَافِعٌ يَوْمَئِذٍ صَغِيرٌ ‏.‏ وَسُئِلَ مَالِكٌ عَنِ الْمَسْحِ عَلَى الْعِمَامَةِ وَالْخِمَارِ فَقَالَ لاَ يَنْبَغِي أَنْ يَمْسَحَ الرَّجُلُ وَلاَ الْمَرْأَةُ عَلَى عِمَامَةٍ وَلاَ خِمَارٍ وَلْيَمْسَحَا عَلَى رُءُوسِهِمَا ‏.‏ وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ تَوَضَّأَ فَنَسِيَ أَنْ يَمْسَحَ عَلَى رَأْسِهِ حَتَّى جَفَّ وَضُوءُهُ قَالَ أَرَى أَنْ يَمْسَحَ بِرَأْسِهِ وَإِنْ كَانَ قَدْ صَلَّى أَنْ يُعِيدَ الصَّلاَةَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Nafi bahawa dia melihat Safiyya bint Abi Ubayd, isteri Abdullah ibn 'Umar, menanggalkan penutup kepalanya dan menyapu kepalanya dengan air. Nafi masih kecil pada masa itu.\n\nMalik ditanya tentang seorang lelaki yang berwuduk tetapi terlupa menyapu kepalanya sehingga airnya kering. Dia berkata, \"Saya berpendapat bahawa dia harus menyapu kepalanya dan kemudian mengulangi solat jika dia telah melakukannya.\"\n\nMalik ditanya tentang seorang lelaki yang berwuduk tetapi terlupa menyapu kepalanya sehingga airnya kering. Dia berkata, \"Saya berpendapat bahawa dia harus menyapu kepalanya dan kemudian mengulangi solat jika dia telah melakukannya.\""
  },
  {
    "id": 34250,
    "hadith_number": 72,
    "tajuk_hadith": "Rasulullah SAW Solat Bersama Para Sahabat Selepas Berwuduk",
    "perawi_melayu": "al-Mughira ibn Shuba (melalui perantaraan perawi lain)",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبَّادِ بْنِ زِيَادٍ، مِنْ وَلَدِ الْمُغِيرَةِ بْنِ شُعْبَةَ عَنْ أَبِيهِ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ذَهَبَ لِحَاجَتِهِ فِي غَزْوَةِ تَبُوكَ - قَالَ الْمُغِيرَةُ - فَذَهَبْتُ مَعَهُ بِمَاءٍ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَكَبْتُ عَلَيْهِ الْمَاءَ فَغَسَلَ وَجْهَهُ ثُمَّ ذَهَبَ يُخْرِجُ يَدَيْهِ مِنْ كُمَّىْ جُبَّتِهِ فَلَمْ يَسْتَطِعْ مِنْ ضِيقِ كُمَّىِ الْجُبَّةِ فَأَخْرَجَهُمَا مِنْ تَحْتِ الْجُبَّةِ فَغَسَلَ يَدَيْهِ وَمَسَحَ بِرَأْسِهِ وَمَسَحَ عَلَى الْخُفَّيْنِ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَعَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ يَؤُمُّهُمْ وَقَدْ صَلَّى بِهِمْ رَكْعَةً فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم الرَّكْعَةَ الَّتِي بَقِيَتْ عَلَيْهِمْ فَفَزِعَ النَّاسُ فَلَمَّا قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَحْسَنْتُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Abbad bin Ziyad, keturunan al-Mughira ibn Shuba, daripada bapanya, daripada al-Mughira ibn Shuba bahawa Rasulullah SAW pergi untuk membuang air dalam peperangan Tabuk. Al-Mughira berkata, \"Saya pergi bersama Baginda dengan membawa air. Kemudian Rasulullah SAW kembali dan saya menuangkan air untuknya. Baginda membasuh wajahnya, kemudian cuba mengeluarkan kedua tangannya daripada lengan jubahnya tetapi tidak dapat kerana sempitnya. Lalu Baginda mengeluarkannya dari bawah jubah. Kemudian Baginda membasuh kedua tangannya, mengusap kepalanya dan mengusap atas kedua khuf (stokin kulit). Rasulullah SAW kembali dan Abdur Rahman bin Awf sedang mengimami orang ramai solat, dan dia telah selesai satu rakaat bersama mereka. Rasulullah SAW solat rakaat yang tinggal bersama mereka. Apabila Rasulullah SAW selesai solat, Baginda bersabda, 'Kamu telah melakukan dengan baik.'\""
  },
  {
    "id": 34251,
    "hadith_number": 73,
    "tajuk_hadith": "Hukum Mengusap Khuf (Stokin Kulit)",
    "perawi_melayu": "Nafi dan Abdullah ibn Dinar",
    "english_text": "Yahya related to me from Malik that Nafi and Abdullah ibn Dinar\ntold him that Abdullah ibn Umar arrived at Kufa and went to Sad ibn\nAbi Waqqas, who was the Amir of Kufa at that time. Abdullah ibn Umar\nsaw him wiping over his leather socks and disapproved of it. So Sad\nsaid to him, \"Ask your father when you get back.\" Abdullah returned\nbut forgot to ask Umar about the matter until Sad arrived and said,\n\"Have you asked your father?\" and he said, \"No.\"\n\n\nAbdullah\nthen asked Umar and Umar replied, \"If your feet are ritually pure when\nyou put them in the leather socks then you can wipe over the socks.\"\nAbdullah said ,\"What about if we have just come from relieving\nourselves?\" Umar said, \"Yes, even if you have just come from relieving\nyourself.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، وَعَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّهُمَا أَخْبَرَاهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ قَدِمَ الْكُوفَةَ عَلَى سَعْدِ بْنِ أَبِي وَقَّاصٍ وَهُوَ أَمِيرُهَا فَرَآهُ عَبْدُ اللَّهِ بْنُ عُمَرَ يَمْسَحُ عَلَى الْخُفَّيْنِ فَأَنْكَرَ ذَلِكَ عَلَيْهِ فَقَالَ لَهُ سَعْدٌ سَلْ أَبَاكَ إِذَا قَدِمْتَ عَلَيْهِ فَقَدِمَ عَبْدُ اللَّهِ فَنَسِيَ أَنْ يَسْأَلَ عُمَرَ عَنْ ذَلِكَ حَتَّى قَدِمَ سَعْدٌ فَقَالَ أَسَأَلْتَ أَبَاكَ فَقَالَ لاَ ‏.‏ فَسَأَلَهُ عَبْدُ اللَّهِ فَقَالَ عُمَرُ إِذَا أَدْخَلْتَ رِجْلَيْكَ فِي الْخُفَّيْنِ وَهُمَا طَاهِرَتَانِ فَامْسَحْ عَلَيْهِمَا ‏.‏ قَالَ عَبْدُ اللَّهِ وَإِنْ جَاءَ أَحَدُنَا مِنَ الْغَائِطِ فَقَالَ عُمَرُ نَعَمْ وَإِنْ جَاءَ أَحَدُكُمْ مِنَ الْغَائِطِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa Nafi dan Abdullah ibn Dinar memberitahu kepadanya bahawa Abdullah ibn Umar tiba di Kufa dan pergi kepada Sad ibn Abi Waqqas, yang merupakan Amir Kufa pada masa itu. Abdullah ibn Umar melihatnya mengusap atas khuf (stokin kulit)nya dan tidak menyukainya. Lalu Sad berkata kepadanya, \"Tanyakanlah kepada ayahmu apabila kamu kembali.\" Abdullah kembali tetapi lupa untuk bertanya kepada Umar tentang perkara itu sehingga Sad tiba dan berkata, \"Adakah kamu telah bertanya kepada ayahmu?\" dan dia berkata, \"Tidak.\"\n\nAbdullah kemudian bertanya kepada Umar dan Umar menjawab, \"Jika kakimu suci ketika kamu memasukkannya ke dalam khuf (stokin kulit) maka kamu boleh mengusap atasnya.\" Abdullah berkata, \"Bagaimana pula jika kami baru sahaja selesai membuang air?\" Umar berkata, \"Ya, walaupun kamu baru sahaja selesai membuang air.\""
  },
  {
    "id": 34252,
    "hadith_number": 74,
    "tajuk_hadith": "Abdullah bin Umar Berwudhu' dan Solat Jenazah Selepas Membasuh",
    "perawi_melayu": "Malik daripada Nafi' daripada Abdullah bin Umar",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nurinated in the market place and then did wudu, washing his face and\nhands and wiping his head. Then as soon as he had come into the\nmosque, he was called to pray over a dead person, so he wiped over his\nleather socks and prayed.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، بَالَ فِي السُّوقِ ثُمَّ تَوَضَّأَ فَغَسَلَ وَجْهَهُ وَيَدَيْهِ وَمَسَحَ رَأْسَهُ ثُمَّ دُعِيَ لِجَنَازَةٍ لِيُصَلِّيَ عَلَيْهَا حِينَ دَخَلَ الْمَسْجِدَ فَمَسَحَ عَلَى خُفَّيْهِ ثُمَّ صَلَّى عَلَيْهَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Nafi' bahawa Abdullah bin Umar membuang air kecil di pasar, kemudian berwudhu', membasuh muka dan tangannya serta menyapu kepalanya. Kemudian, sebaik sahaja dia masuk ke dalam masjid, dia dipanggil untuk solat jenazah ke atas seseorang yang meninggal dunia, lalu dia menyapu di atas stokin kulitnya dan solat."
  },
  {
    "id": 34253,
    "hadith_number": 75,
    "tajuk_hadith": "Tata Cara Wuduk dan Mengusap Khuf (Stokin Kulit)",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ رُقَيْشٍ، أَنَّهُ قَالَ رَأَيْتُ أَنَسَ بْنَ مَالِكٍ أَتَى قُبَا فَبَالَ ثُمَّ أُتِيَ بِوَضُوءٍ فَتَوَضَّأَ فَغَسَلَ وَجْهَهُ وَيَدَيْهِ إِلَى الْمِرْفَقَيْنِ وَمَسَحَ بِرَأْسِهِ وَمَسَحَ عَلَى الْخُفَّيْنِ ثُمَّ جَاءَ الْمَسْجِدَ فَصَلَّى ‏.‏ قَالَ يَحْيَى وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ تَوَضَّأَ وُضُوءَ الصَّلاَةِ ثُمَّ لَبِسَ خُفَّيْهِ ثُمَّ بَالَ ثُمَّ نَزَعَهُمَا ثُمَّ رَدَّهُمَا فِي رِجْلَيْهِ أَيَسْتَأْنِفُ الْوُضُوءَ فَقَالَ لِيَنْزِعْ خُفَّيْهِ وَلْيَغْسِلْ رِجْلَيْهِ وَإِنَّمَا يَمْسَحُ عَلَى الْخُفَّيْنِ مَنْ أَدْخَلَ رِجْلَيْهِ فِي الْخُفَّيْنِ وَهُمَا طَاهِرَتَانِ بِطُهْرِ الْوُضُوءِ وَأَمَّا مَنْ أَدْخَلَ رِجْلَيْهِ فِي الْخُفَّيْنِ وَهُمَا غَيْرُ طَاهِرَتَيْنِ بِطُهْرِ الْوُضُوءِ فَلاَ يَمْسَحْ عَلَى الْخُفَّيْنِ ‏.‏ قَالَ وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ تَوَضَّأَ وَعَلَيْهِ خُفَّاهُ فَسَهَا عَنِ الْمَسْحِ عَلَى الْخُفَّيْنِ حَتَّى جَفَّ وَضُوءُهُ وَصَلَّى قَالَ لِيَمْسَحْ عَلَى خُفَّيْهِ وَلْيُعِدِ الصَّلاَةَ وَلاَ يُعِيدُ الْوُضُوءَ ‏.‏ وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ غَسَلَ قَدَمَيْهِ ثُمَّ لَبِسَ خُفَّيْهِ ثُمَّ اسْتَأْنَفَ الْوُضُوءَ فَقَالَ لِيَنْزِعْ خُفَّيْهِ ثُمَّ لْيَتَوَضَّأْ وَلْيَغْسِلْ رِجْلَيْهِ ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku daripada Malik, daripada Sa'id bin Abdur Rahman bin Ruqasy, bahawa dia berkata: \"Aku melihat Anas bin Malik datang ke Quba' lalu kencing, kemudian dibawakan kepadanya air wuduk, lalu dia berwuduk. Dia membasuh wajahnya dan kedua tangannya hingga ke siku, dan mengusap kepalanya, dan mengusap atas khuf (stokin kulit). Kemudian dia datang ke masjid lalu solat.\" Yahya berkata: \"Malik ditanya mengenai seorang lelaki yang berwuduk untuk solat, kemudian memakai khufnya, kemudian kencing, kemudian menanggalkannya, kemudian memakainya semula di kakinya, adakah dia perlu mengulangi wuduknya?\" Maka dia menjawab: \"Hendaklah dia menanggalkan khufnya dan membasuh kakinya. Sesungguhnya hanya orang yang memasukkan kakinya ke dalam khuf, sedangkan kedua kakinya dalam keadaan suci dengan wuduk, boleh mengusap atasnya. Adapun orang yang memasukkan kakinya ke dalam khuf, sedangkan kedua kakinya tidak suci dengan wuduk, maka janganlah dia mengusap atas khufnya.\" Dia berkata: \"Malik ditanya mengenai seorang lelaki yang berwuduk dan memakai khufnya, tetapi terlupa mengusap atas khufnya sehingga air wuduknya kering dan dia telah solat.\" Dia berkata: \"Hendaklah dia mengusap atas khufnya dan mengulangi solatnya, tetapi tidak perlu mengulangi wuduknya.\" Malik ditanya mengenai seorang lelaki yang membasuh kakinya kemudian memakai khufnya, kemudian memulakan wuduk, maka dia berkata: \"Hendaklah dia menanggalkan khufnya kemudian berwuduk dan membasuh kakinya.\""
  },
  {
    "id": 34254,
    "hadith_number": 76,
    "tajuk_hadith": "Menyapu di Atas Stokin Kulit (Khuf)",
    "perawi_melayu": "Yahya meriwayatkan kepada saya dari Malik dari Hisham ibn Urwa",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa that he saw\nhis father wiping over his leather socks. He said, \"When he wiped over\nhis socks he would never do more than wipe the tops and he would not\nwipe the bottoms.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، أَنَّهُ رَأَى أَبَاهُ يَمْسَحُ عَلَى الْخُفَّيْنِ قَالَ وَكَانَ لاَ يَزِيدُ إِذَا مَسَحَ عَلَى الْخُفَّيْنِ عَلَى أَنْ يَمْسَحَ ظُهُورَهُمَا وَلاَ يَمْسَحُ بُطُونَهُمَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Hisham ibn Urwa bahawa dia melihat bapanya menyapu di atas stokin kulit. Dia berkata, \"Apabila dia menyapu di atas stokin, dia tidak akan melakukan lebih daripada menyapu bahagian atasnya sahaja dan dia tidak menyapu bahagian bawahnya.\""
  },
  {
    "id": 34255,
    "hadith_number": 77,
    "tajuk_hadith": "Cara Mengusap Khuf (Stokin Kulit)",
    "perawi_melayu": "Yahya (meriwayatkan dari Malik)",
    "english_text": "Yahya related to me that Malik had asked Ibn Shihab how to wipe\nover leather socks. Ibn Shihab had put one hand under the sock and his\nother hand above the sock and then passed them over it.\n\n\nYahya\nsaid that Malik said, \"Out of all that I have heard about the matter I\nlike what Ibn Shihab said the most.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنِ الْمَسْحِ، عَلَى الْخُفَّيْنِ كَيْفَ هُوَ فَأَدْخَلَ ابْنُ شِهَابٍ إِحْدَى يَدَيْهِ تَحْتَ الْخُفِّ وَالأُخْرَى فَوْقَهُ ثُمَّ أَمَرَّهُمَا ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَقَوْلُ ابْنِ شِهَابٍ أَحَبُّ مَا سَمِعْتُ إِلَىَّ فِي ذَلِكَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan bahawa Malik bertanya kepada Ibn Shihab tentang cara mengusap khuf (stokin kulit). Ibn Shihab memasukkan satu tangan di bawah khuf dan satu lagi di atasnya, kemudian mengusapnya.\n\nYahya berkata bahawa Malik berkata, \"Daripada semua yang telah aku dengar tentang perkara ini, aku paling menyukai apa yang dikatakan oleh Ibn Shihab.\""
  },
  {
    "id": 34256,
    "hadith_number": 78,
    "tajuk_hadith": "Abdullah ibn Umar Berwuduk Selepas Hidung Berdarah dalam Solat",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Nafi bahawa Abdullah ibn Umar",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nwould leave and do wudu if he had a nose-bleed and then return and\ncomplete his prayer without saying anything.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا رَعَفَ انْصَرَفَ فَتَوَضَّأَ ثُمَّ رَجَعَ فَبَنَى وَلَمْ يَتَكَلَّمْ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Nafi bahawa Abdullah ibn Umar akan keluar dan berwuduk jika hidungnya berdarah, kemudian kembali dan menyempurnakan solatnya tanpa berkata apa-apa."
  },
  {
    "id": 34257,
    "hadith_number": 79,
    "tajuk_hadith": "Abdullah ibn Abbas dan Pendarahan Hidung Semasa Solat",
    "perawi_melayu": "Malik meriwayatkan dari Nafi",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Abbas\nused to have nose-bleeds and would leave to wash off the blood. He\nwould then return and complete his prayer.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، كَانَ يَرْعُفُ فَيَخْرُجُ فَيَغْسِلُ الدَّمَ عَنْهُ ثُمَّ يَرْجِعُ فَيَبْنِي عَلَى مَا قَدْ صَلَّى ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku dari Malik, dari Nafi, bahawasanya Abdullah ibn Abbas pernah mengalami pendarahan hidung dan beliau keluar untuk membasuh darah tersebut. Kemudian, beliau kembali dan menyempurnakan solatnya."
  },
  {
    "id": 34258,
    "hadith_number": 80,
    "tajuk_hadith": "Said ibn al-Musayyab Mengalami Hidung Berdarah Semasa Solat",
    "perawi_melayu": "Yazid ibn Abdullah Qusayt al-Laythi",
    "english_text": "Yahya related to me from Malik from Yazid ibn Abdullah Qusayt al-Laythi that he saw Said ibn al-Musayyab having a nose-bleed while praying. He went off to the room of Umm Salama, the wife of the Prophet, may Allah bless him and grant him peace, and water was brought to him and he did wudu. He then returned and completed his prayer.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ اللَّيْثِيِّ، أَنَّهُ رَأَى سَعِيدَ بْنَ الْمُسَيَّبِ رَعَفَ وَهُوَ يُصَلِّي فَأَتَى حُجْرَةَ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم فَأُتِيَ بِوَضُوءٍ فَتَوَضَّأَ ثُمَّ رَجَعَ فَبَنَى عَلَى مَا قَدْ صَلَّى ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Yazid ibn Abdullah Qusayt al-Laythi bahawa dia melihat Said ibn al-Musayyab mengalami hidung berdarah semasa solat. Beliau kemudian pergi ke bilik Umm Salama, isteri Nabi, semoga Allah memberkatinya dan mengurniakan kesejahteraan kepadanya, dan air dibawa kepadanya dan beliau berwuduk. Selepas itu, beliau kembali dan menyempurnakan solatnya."
  },
  {
    "id": 34259,
    "hadith_number": 81,
    "tajuk_hadith": "Said ibn al-Musayyab Solat dengan Hidung Berdarah",
    "perawi_melayu": "Yahya",
    "english_text": "Yahya related to me that Abd ar-Rahman ibn Harmala al-Aslami\nsaid,  \"I saw Said ibn al-Musayyab with his nose bleeding and blood\npoured out of it so that his fingers were all red from the blood\ncoming out of his nose, and he prayed without doing wudu.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَرْمَلَةَ الأَسْلَمِيِّ، أَنَّهُ قَالَ رَأَيْتُ سَعِيدَ",
    "malay_translation": "Yahya meriwayatkan kepada saya bahawa Abd ar-Rahman ibn Harmala al-Aslami berkata, \"Saya melihat Said ibn al-Musayyab dengan hidungnya berdarah dan darah mengalir keluar sehingga jari-jarinya merah kerana darah yang keluar dari hidungnya, dan dia solat tanpa berwudhu.\""
  },
  {
    "id": 34260,
    "hadith_number": 82,
    "tajuk_hadith": "Salim ibn Abdullah dan Solat dengan Darah dari Hidung",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Abd ar-Rahman ibn al-Mujabbar",
    "english_text": "Yahya related to me from Malik from Abd ar Rahman ibn al-Mujabbar\nthat he saw Salim ibn Abdullah with blood running from his nose so\nthat his fingers were all coloured red. Then he rubbed it and prayed\nwithout doing wudu.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْمُجَبَّرِ، أَنَّهُ رَأَى سَالِمَ بْنَ عَبْدِ اللَّهِ يَخْرُجُ مِنْ أَنْفِهِ الدَّمُ حَتَّى تَخْتَضِبَ أَصَابِعُهُ ثُمَّ يَفْتِلُهُ ثُمَّ يُصَلِّي وَلاَ يَتَوَضَّأُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abd ar-Rahman ibn al-Mujabbar, bahawa dia melihat Salim ibn Abdullah dengan darah mengalir dari hidungnya sehingga jari-jarinya berwarna merah. Kemudian dia menggosoknya dan solat tanpa mengambil wuduk."
  },
  {
    "id": 34261,
    "hadith_number": 83,
    "tajuk_hadith": "Umar r.a. Mengerjakan Solat Subuh Ketika Terluka",
    "perawi_melayu": "Al-Miswar ibn Makhrama",
    "english_text": "Yahya related to me from Hisham ibn Urwa from his father that al-\nMiswar ibn Makhrama told him that he had visited Umar ibn al Khattab\non the night he was stabbed and had woken him up for the subh prayer\nand Umar had said, ''Yes. Whoever stops doing the prayer will get\nnothing from Islam,\" and he did the prayer with blood pouring from his\nwound.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ الْمِسْوَرَ بْنَ مَخْرَمَةَ، أَخْبَرَهُ أَنَّهُ، دَخَلَ عَلَى عُمَرَ بْنِ الْخَطَّابِ مِنَ اللَّيْلَةِ الَّتِي طُعِنَ فِيهَا فَأَيْقَظَ عُمَرَ لِصَلاَةِ الصُّبْحِ فَقَالَ عُمَرُ نَعَمْ وَلاَ حَظَّ فِي الإِسْلاَمِ لِمَنْ تَرَكَ الصَّلاَةَ ‏.‏ فَصَلَّى عُمَرُ وَجُرْحُهُ يَثْعَبُ دَمًا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Hisham bin Urwah, daripada bapanya, bahawa al-Miswar bin Makhrama memberitahu bahawa dia telah melawat Umar bin al-Khattab pada malam dia ditikam dan telah membangunkan Umar untuk solat Subuh. Umar berkata, 'Ya. Sesiapa yang meninggalkan solat, maka tiada bahagian baginya dalam Islam.' Lalu Umar mengerjakan solat dengan luka beliau mengalirkan darah."
  },
  {
    "id": 34262,
    "hadith_number": 84,
    "tajuk_hadith": "Hukum Seseorang Mengalami Pendarahan Hidung Berterusan dalam Solat",
    "perawi_melayu": "Yahya ibn Said, daripada Malik",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said that Said ibn\nal-Musayyab was asked, \"What do you say about someone who is afflicted\nby a nose-bleed which does not stop? \"Malik said that Yahya ibn Said\nsaid that Said ibn al Musayyab said, \"I say that he should signal with\nhis head.\" (i.e. instead of doing sajda or ruku.)\n\n\nYahya said\nthat Malik said, \"That is what I like most out of what I have heard\nabout the matter.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، قَالَ مَا تَرَوْنَ فِيمَنْ غَلَبَهُ الدَّمُ مِنْ رُعَافٍ فَلَمْ يَنْقَطِعْ عَنْهُ قَالَ مَالِكٌ قَالَ يَحْيَى بْنُ سَعِيدٍ ثُمَّ قَالَ سَعِيدُ بْنُ الْمُسَيَّبِ أَرَى أَنْ يُومِئَ بِرَأْسِهِ إِيمَاءً ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَذَلِكَ أَحَبُّ مَا سَمِعْتُ إِلَىَّ فِي ذَلِكَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya bin Said, bahawa Said bin al-Musayyab ditanya, \"Apakah pendapatmu tentang seseorang yang mengalami pendarahan hidung yang tidak berhenti?\" Malik berkata bahawa Yahya bin Said berkata bahawa Said bin al-Musayyab berkata, \"Saya berpendapat dia hendaklah memberi isyarat dengan kepalanya.\" (iaitu, sebagai ganti daripada melakukan sujud atau rukuk).\n\nYahya berkata bahawa Malik berkata, \"Itulah yang paling saya sukai daripada apa yang saya dengar tentang perkara itu.\""
  },
  {
    "id": 34263,
    "hadith_number": 85,
    "tajuk_hadith": "Hukum Mandi dan Wuduk Apabila Mengeluarkan Mazi",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنِ الْمِقْدَادِ بْنِ الأَسْوَدِ، أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ، أَمَرَهُ أَنْ يَسْأَلَ، لَهُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الرَّجُلِ إِذَا دَنَا مِنْ أَهْلِهِ فَخَرَجَ مِنْهُ الْمَذْىُ مَاذَا عَلَيْهِ قَالَ عَلِيٌّ فَإِنَّ عِنْدِي ابْنَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَنَا أَسْتَحِي أَنْ أَسْأَلَهُ ‏.‏ قَالَ الْمِقْدَادُ فَسَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَقَالَ ‏\n\"‏ إِذَا وَجَدَ ذَلِكَ أَحَدُكُمْ فَلْيَنْضَحْ فَرْجَهُ بِالْمَاءِ وَلْيَتَوَضَّأْ وُضُوءَهُ لِلصَّلاَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Abu'n Nadr, bekas hamba Umar ibn Ubaydullah, daripada Sulayman ibn Yasar daripada al-Miqdad ibn al-Aswad bahawa Ali ibn Abi Talib memerintahkannya untuk bertanya kepada Rasulullah SAW tentang seorang lelaki yang mengeluarkan mazi (cecair prostatik) apabila hampir dengan isterinya. Ali menjelaskan bahawa anak perempuan Rasulullah SAW tinggal bersamanya ketika itu dan dia terlalu malu untuk bertanya untuk dirinya sendiri. Al-Miqdad berkata, \"Saya bertanya kepada Rasulullah SAW tentang hal itu, dan Baginda bersabda, 'Apabila kamu mendapati hal itu, basuhlah kemaluan kamu dengan air dan berwuduklah seperti wuduk untuk solat.'\""
  },
  {
    "id": 34264,
    "hadith_number": 86,
    "tajuk_hadith": "Hukum Mengeluarkan Mazy (Cecair) dan Wuduk",
    "perawi_melayu": "Umar ibn al-Khattab (RA)",
    "english_text": "Yahya related to me from Zayd ibn Aslam from his father that Umar\nibn al-Khattab said, \"I find it dropping from me like small beads.\nWhen you find that, wash your penis and do wudu as for prayer.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ إِنِّي لأَجِدُهُ يَنْحَدِرُ مِنِّي مِثْلَ الْخُرَيْزَةِ فَإِذَا وَجَدَ ذَلِكَ أَحَدُكُمْ فَلْيَغْسِلْ ذَكَرَهُ وَلْيَتَوَضَّأْ وُضُوءَهُ لِلصَّلاَةِ يَعْنِي الْمَذْىَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Zayd ibn Aslam daripada bapanya bahawa Umar ibn al-Khattab berkata, \"Sesungguhnya aku mendapati ia (mazi) keluar daripada ku seperti manik-manik kecil. Apabila seseorang daripada kamu mendapati keadaan demikian, hendaklah dia membasuh zakarnya dan berwuduk seperti wuduk untuk solat.\""
  },
  {
    "id": 34265,
    "hadith_number": 87,
    "tajuk_hadith": "Hukum Mengenai Air Mazi",
    "perawi_melayu": "Jundub, mawla Abdullah ibn Ayyash",
    "english_text": "Yahya related to me from Malik from Zayd ibn Aslam from his\nfather that Jundub, the mawla of Abdullah ibn Ayyash, said, \"I asked\nAbdullah ibn Umar about prostatic fluid and he said, 'When you find\nit, wash your genitals and do wudu as for prayer.' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ جُنْدَبٍ، مَوْلَى عَبْدِ اللَّهِ بْنِ عَيَّاشٍ أَنَّهُ قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ عَنِ الْمَذْىِ، فَقَالَ إِذَا وَجَدْتَهُ فَاغْسِلْ فَرْجَكَ وَتَوَضَّأْ وُضُوءَكَ لِلصَّلاَةِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Zayd ibn Aslam daripada bapanya bahawa Jundub, mawla Abdullah ibn Ayyash, berkata, \"Saya bertanya kepada Abdullah ibn Umar tentang air mazi, lalu dia berkata, 'Apabila kamu mendapatinya, basuhlah kemaluanmu dan berwuduklah seperti wuduk untuk solat.'\""
  },
  {
    "id": 34266,
    "hadith_number": 88,
    "tajuk_hadith": "Said ibn al-Musayyab: Teruskan Solat Walaupun Mengalami Kebasahan",
    "perawi_melayu": "Malik meriwayatkan daripada Yahya ibn Said, daripada Said ibn al-Musayyab",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said that he was\nlistening to Said ibn al-Musayyab and a man questioned him saying, \"I\ndiscover a liquid when I am praying. Should I leave?\"\n\n\nSaid\nibn al-Musayyab said to him, \"Even if it were to flow on my leg I\nwould not leave until I had finished the prayer.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ سَمِعَهُ وَرَجُلٌ، يَسْأَلُهُ فَقَالَ إِنِّي لأَجِدُ الْبَلَلَ وَأَنَا أُصَلِّي، أَفَأَنْصَرِفُ فَقَالَ لَهُ سَعِيدٌ لَوْ سَالَ عَلَى فَخِذِي مَا انْصَرَفْتُ حَتَّى أَقْضِيَ صَلاَتِي ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya ibn Said bahawa dia mendengar Said ibn al-Musayyab dan seorang lelaki bertanya kepadanya, \"Saya mendapati ada cecair ketika saya sedang solat. Patutkah saya berhenti?\"\n\nSaid ibn al-Musayyab berkata kepadanya, \"Walaupun ia mengalir di atas paha saya, saya tidak akan berhenti sehingga saya selesai solat.\""
  },
  {
    "id": 34267,
    "hadith_number": 89,
    "tajuk_hadith": "Hukum Mengenai Cecair yang Dijumpai pada Pakaian",
    "perawi_melayu": "as-Salt ibn Zuyayd",
    "english_text": "Yahya related to me from Malik that as-Salt ibn Zuyayd said, \"I\nasked Sulayman ibn Yasar about a liquid I discovered. He said, 'Wash\nwhat is under your garments with water and forget about it.' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ الصَّلْتِ بْنِ زُيَيْدٍ، أَنَّهُ قَالَ سَأَلْتُ سُلَيْمَانَ بْنَ يَسَارٍ عَنِ الْبَلَلِ، أَجِدُهُ فَقَالَ انْضَحْ مَا تَحْتَ ثَوْبِكَ بِالْمَاءِ وَالْهَ عَنْهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya dari Malik bahawa as-Salt ibn Zuyayd berkata, \"Saya bertanya kepada Sulayman ibn Yasar tentang cecair yang saya temui. Beliau berkata, 'Basuhlah apa yang ada di bawah pakaianmu dengan air dan lupakanlah ia.'\""
  },
  {
    "id": 34268,
    "hadith_number": 90,
    "tajuk_hadith": "Wuduk Diperlukan Selepas Menyentuh Zakar",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik that Abdullah ibn Abi Bakr ibn\nMuhammad ibn Amr ibn Hazim heard Urwa ibn az-Zubayr saying, \"I went to\nsee Marwan ibn al-Hakam and we talked about what you had to do wudu\nfor, and Marwan said, 'You have to do wudu if you touch your penis.'\nUrwa said, 'I didn't know that.' Marwan ibn al-Hakam said that Busra\nbint Safwan had told him that she heard the Messenger of Allah, may\nAllah bless him and grant him peace, say, 'If any of you touches his\npenis he should do wudu.' \"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، أَنَّهُ سَمِعَ عُرْوَةَ بْنَ الزُّبَيْرِ، يَقُولُ دَخَلْتُ عَلَى مَرْوَانَ بْنِ الْحَكَمِ فَتَذَاكَرْنَا مَا يَكُونُ مِنْهُ الْوُضُوءُ فَقَالَ مَرْوَانُ وَمِنْ مَسِّ الذَّكَرِ الْوُضُوءُ ‏.‏ فَقَالَ عُرْوَةُ مَا عَلِمْتُ هَذَا ‏.‏ فَقَالَ مَرْوَانُ بْنُ الْحَكَمِ أَخْبَرَتْنِي بُسْرَةُ بِنْتُ صَفْوَانَ أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِذَا مَسَّ أَحَدُكُمْ ذَكَرَهُ فَلْيَتَوَضَّأْ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa Abdullah bin Abi Bakr bin Muhammad bin Amr bin Hazim mendengar Urwa bin az-Zubayr berkata, \"Saya pergi berjumpa Marwan bin al-Hakam dan kami berbincang tentang perkara yang mewajibkan wuduk, dan Marwan berkata, 'Wuduk diperlukan jika kamu menyentuh zakar kamu.' Urwa berkata, 'Saya tidak tahu perkara ini.' Marwan bin al-Hakam berkata bahawa Busra bint Safwan telah memberitahunya bahawa dia mendengar Rasulullah SAW bersabda, 'Jika sesiapa di antara kamu menyentuh zakarnya, hendaklah dia berwuduk.'\""
  },
  {
    "id": 34269,
    "hadith_number": 91,
    "tajuk_hadith": "Menyentuh Zakar Membatalkan Wuduk",
    "perawi_melayu": "Mus'ab bin Sa'd bin Abi Waqqas",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْمَاعِيلَ بْنِ مُحَمَّدِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ مُصْعَبِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، أَنَّهُ قَالَ كُنْتُ أُمْسِكُ الْمُصْحَفَ عَلَى سَعْدِ بْنِ أَبِي وَقَّاصٍ فَاحْتَكَكْتُ فَقَالَ سَعْدٌ لَعَلَّكَ مَسِسْتَ ذَكَرَكَ قَالَ فَقُلْتُ نَعَمْ ‏.‏ فَقَالَ قُمْ فَتَوَضَّأْ فَقُمْتُ فَتَوَضَّأْتُ ثُمَّ رَجَعْتُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ismail bin Muhammad bin Sa'd bin Abi Waqqas, daripada Mus'ab bin Sa'd bin Abi Waqqas bahawa beliau berkata, \"Saya memegang Mushaf untuk Sa'd bin Abi Waqqas lalu saya menggosok diri. Sa'd bertanya, 'Adakah kamu menyentuh zakarmu?' Saya menjawab, 'Ya,' dan dia berkata, 'Bangun dan berwuduklah.' Maka saya bangun dan berwuduk, kemudian kembali.\""
  },
  {
    "id": 34270,
    "hadith_number": 92,
    "tajuk_hadith": "Menyentuh Kemaluan Memerlukan Wudhu",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to say, \"If you touch your penis you have to do wudu.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ إِذَا مَسَّ أَحَدُكُمْ ذَكَرَهُ فَقَدْ وَجَبَ عَلَيْهِ الْوُضُوءُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Nafi' bahawa Abdullah ibn Umar pernah berkata, \"Jika salah seorang daripada kamu menyentuh kemaluannya, maka wajiblah dia berwudhu.\""
  },
  {
    "id": 34271,
    "hadith_number": 93,
    "tajuk_hadith": "Wuduk Selepas Menyentuh Kemaluan",
    "perawi_melayu": "Malik daripada Hisham ibn Urwa daripada ayahnya",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa that his\nfather used to say, \"If any of you touches his penis he has to do\nwudu.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يَقُولُ مَنْ مَسَّ ذَكَرَهُ فَقَدْ وَجَبَ عَلَيْهِ الْوُضُوءُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik daripada Hisham ibn Urwa bahawa ayahnya berkata, \"Sesiapa di antara kamu yang menyentuh kemaluannya, maka wajiblah dia berwuduk.\""
  },
  {
    "id": 34272,
    "hadith_number": 94,
    "tajuk_hadith": "Menyentuh Kemaluan Selepas Mandi Wajib",
    "perawi_melayu": "Salim bin Abdullah",
    "english_text": "Yahya related from Malik from Ibn Shihab that Salim ibn Abdullah\nsaid, \"I saw my father Abdullah ibn Umar, do ghusl and then do wudu. I\nsaid to him, 'Father, isn't ghusl enough for you?' He said, 'Of\ncourse, but sometimes I touch my penis, so I do wudu.' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ قَالَ رَأَيْتُ أَبِي عَبْدَ اللَّهِ بْنَ عُمَرَ يَغْتَسِلُ ثُمَّ يَتَوَضَّأُ فَقُلْتُ لَهُ يَا أَبَتِ أَمَا يَجْزِيكَ الْغُسْلُ مِنَ الْوُضُوءِ قَالَ بَلَى وَلَكِنِّي أَحْيَانًا أَمَسُّ ذَكَرِي فَأَتَوَضَّأُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Ibn Shihab bahawa Salim bin Abdullah berkata, \"Saya melihat ayah saya, Abdullah bin Umar, mandi wajib (ghusl) dan kemudian berwudhu. Saya berkata kepadanya, 'Wahai ayah, bukankah mandi wajib (ghusl) sudah mencukupi bagi ayah?' Beliau menjawab, 'Tentu saja, tetapi kadangkala saya menyentuh kemaluan saya, jadi saya berwudhu.'\""
  },
  {
    "id": 34273,
    "hadith_number": 95,
    "tajuk_hadith": "Abdullah ibn Umar: Wuduk Selepas Menyentuh Kemaluan dan Lupa",
    "perawi_melayu": "Nafi daripada Salim ibn 'Abdullah",
    "english_text": "Yahya related to me from Malik from Nafi that Salim ibn 'Abdullah\nsaid, \"I was with Abdullah ibn Umar on a journey and after the sun had\nrisen I saw him do wudu and then pray. So I said to him, 'This isn't a\nprayer that you normally do. 'He said, 'After I had done wudu for the\nsubh prayer, I touched my genitals. Then I forgot to do wudu. So I did\nwudu again and repeated my prayer.' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ قَالَ كُنْتُ مَعَ عَبْدِ اللَّهِ بْنِ عُمَرَ فِي سَفَرٍ فَرَأَيْتُهُ بَعْدَ أَنْ طَلَعَتِ الشَّمْسُ تَوَضَّأَ ثُمَّ صَلَّى قَالَ فَقُلْتُ لَهُ إِنَّ هَذِهِ لَصَلاَةٌ مَا كُنْتَ تُصَلِّيهَا ‏.‏ قَالَ إِنِّي بَعْدَ أَنْ تَوَضَّأْتُ لِصَلاَةِ الصُّبْحِ مَسِسْتُ فَرْجِي ثُمَّ نَسِيتُ أَنْ أَتَوَضَّأَ فَتَوَضَّأْتُ وَعُدْتُ لِصَلاَتِي ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Nafi, bahawa Salim ibn 'Abdullah berkata, \"Aku bersama Abdullah ibn Umar dalam suatu perjalanan dan setelah matahari terbit, aku melihatnya berwuduk kemudian solat. Aku berkata kepadanya, 'Ini bukan solat yang biasa kamu lakukan.' Dia berkata, 'Setelah aku berwuduk untuk solat Subuh, aku menyentuh kemaluanku. Kemudian aku lupa untuk berwuduk. Lalu aku berwuduk semula dan mengulangi solatku.'\""
  },
  {
    "id": 34274,
    "hadith_number": 96,
    "tajuk_hadith": "Ciuman dan Sentuhan Suami Isteri Memerlukan Wuduk",
    "perawi_melayu": "Salim bin Abdullah, daripada bapanya Abdullah bin Umar",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Salim ibn\nAbdullah that his father Abdullah ibn Umar used to say, \"A man's\nkissing his wife and fondling her with his hands are part of\nintercourse. Someone who kisses his wife or fondles her with his hand\nmust do wudu.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ يَقُولُ قُبْلَةُ الرَّجُلِ امْرَأَتَهُ وَجَسُّهَا بِيَدِهِ مِنَ الْمُلاَمَسَةِ فَمَنْ قَبَّلَ امْرَأَتَهُ أَوْ جَسَّهَا بِيَدِهِ فَعَلَيْهِ الْوُضُوءُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Salim bin Abdullah, bahawa bapanya Abdullah bin Umar pernah berkata, \"Ciuman seorang lelaki terhadap isterinya dan meraba isterinya dengan tangannya adalah sebahagian daripada perhubungan. Sesiapa yang mencium isterinya atau meraba isterinya dengan tangannya, maka wajiblah dia berwuduk.\""
  },
  {
    "id": 34275,
    "hadith_number": 97,
    "tajuk_hadith": "Wuduk Diperlukan Selepas Mencium Isteri",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، كَانَ يَقُولُ مِنْ قُبْلَةِ الرَّجُلِ امْرَأَتَهُ الْوُضُوءُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa dia mendengar bahawa Abdullah ibn Mas'ud pernah berkata, \"Wuduk diperlukan jika seorang lelaki mencium isterinya.\""
  },
  {
    "id": 34276,
    "hadith_number": 98,
    "tajuk_hadith": "Wuduk selepas mencium isteri",
    "perawi_melayu": "Malik dari Ibn Shihab",
    "english_text": "Yahya related to me from Malik that Ibn Shihab used to say, \"Wudu\nis necessary if a man kisses his wife.\" Nafi said that Malik said,\n\"That is what I like most out of what I have heard.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ كَانَ يَقُولُ مِنْ قُبْلَةِ الرَّجُلِ امْرَأَتَهُ الْوُضُوءُ ‏.‏ قَالَ ‏{‏ ابْنُ ‏}‏ نَافِعٍ قَالَ مَالِكٌ وَذَلِكَ أَحَبُّ مَا سَمِعْتُ إِلَىَّ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa Ibn Shihab berkata, \"Wuduk diperlukan jika seorang lelaki mencium isterinya.\" Nafi berkata bahawa Malik berkata, \"Itulah yang paling saya sukai daripada apa yang telah saya dengar.\""
  },
  {
    "id": 34277,
    "hadith_number": 99,
    "tajuk_hadith": "Cara Mandi Junub Nabi Muhammad SAW",
    "perawi_melayu": "A'isha, umm al-muminin",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا اغْتَسَلَ مِنَ الْجَنَابَةِ بَدَأَ بِغَسْلِ يَدَيْهِ ثُمَّ تَوَضَّأَ كَمَا يَتَوَضَّأُ لِلصَّلاَةِ ثُمَّ يُدْخِلُ أَصَابِعَهُ فِي الْمَاءِ فَيُخَلِّلُ بِهَا أُصُولَ شَعْرِهِ ثُمَّ يَصُبُّ عَلَى رَأْسِهِ ثَلاَثَ غَرَفَاتٍ بِيَدَيْهِ ثُمَّ يُفِيضُ الْمَاءَ عَلَى جِلْدِهِ كُلِّهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya, daripada Malik, daripada Hisham bin Urwa, daripada bapanya, daripada A'ishah, umm al-muminin, bahawasanya Rasulullah SAW apabila mandi junub, baginda memulakan dengan membasuh kedua tangannya, kemudian berwuduk seperti wuduk untuk solat. Selepas itu, baginda memasukkan jari-jarinya ke dalam air dan menyapu (membasahi) akar rambutnya. Kemudian, baginda menuang air ke atas kepalanya tiga kali dengan kedua tangannya, kemudian menyiramkan air ke seluruh kulitnya."
  },
  {
    "id": 34278,
    "hadith_number": 100,
    "tajuk_hadith": "Nabi SAW Mandi Junub dengan Faraq",
    "perawi_melayu": "Aisyah, umm al-muminin",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Urwa ibn az-\nZubayr from A'isha, umm al-muminin, that the Messenger of Allah, may\nAllah bless him and grant him peace, used to do ghusl for major ritual\nimproperity from a vessel which contained a faraq.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَغْتَسِلُ مِنْ إِنَاءٍ - هُوَ الْفَرَقُ - مِنَ الْجَنَابَةِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik daripada Ibn Shihab daripada Urwa ibn az-Zubayr daripada A'ishah, umm al-muminin, bahawa Rasulullah SAW biasa mandi junub daripada bekas yang mengandungi faraq."
  },
  {
    "id": 34279,
    "hadith_number": 101,
    "tajuk_hadith": "Cara Mandi Junub Abdullah bin Umar",
    "perawi_melayu": "Nafi",
    "english_text": "Yahya related to me from Malik from Nafi that when Abdullah ibn\nUmar used to do ghusl for major ritual impurity he would begin by\npouring water on his right hand and washing it. Then, in order, he\nwould wash his genitals, rinse his mouth, snuff water in and out of\nhis nose, wash his face and splash his eyes with water. Then he would\nwash his right arm and then his left, and after that he would wash his\nhead. He would finish by having a complete wash and pouring water all\nover himself.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا اغْتَسَلَ مِنَ الْجَنَابَةِ بَدَأَ فَأَفْرَغَ عَلَى يَدِهِ الْيُمْنَى فَغَسَلَهَا ثُمَّ غَسَلَ فَرْجَهُ ثُمَّ مَضْمَضَ وَاسْتَنْثَرَ ثُمَّ غَسَلَ وَجْهَهُ وَنَضَحَ فِي عَيْنَيْهِ ثُمَّ غَسَلَ يَدَهُ الْيُمْنَى ثُمَّ الْيُسْرَى ثُمَّ غَسَلَ رَأْسَهُ ثُمَّ اغْتَسَلَ وَأَفَاضَ عَلَيْهِ الْمَاءَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Nafi bahawa apabila Abdullah bin Umar mandi junub, dia akan memulakan dengan menuangkan air ke tangan kanannya dan membasuhnya. Kemudian, mengikut turutan, dia akan membasuh kemaluannya, berkumur, memasukkan air ke dalam hidung dan mengeluarkannya, membasuh mukanya dan menyimbah air ke matanya. Kemudian dia akan membasuh lengan kanannya dan kemudian kirinya, dan selepas itu dia akan membasuh kepalanya. Dia akan mengakhiri dengan mandi yang sempurna dan menuangkan air ke seluruh badannya."
  },
  {
    "id": 34280,
    "hadith_number": 102,
    "tajuk_hadith": "Cara Mandi Wajib bagi Wanita",
    "perawi_melayu": "A'ishah",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَائِشَةَ، سُئِلَتْ عَنْ غُسْلِ الْمَرْأَةِ، مِنَ الْجَنَابَةِ فَقَالَتْ لِتَحْفِنْ عَلَى رَأْسِهَا ثَلاَثَ حَفَنَاتٍ مِنَ الْمَاءِ وَلْتَضْغَثْ رَأْسَهَا بِيَدَيْهَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa dia telah mendengar bahawa A'ishah pernah ditanya tentang cara seorang wanita mandi wajib daripada hadas besar. Beliau menjawab, \"Hendaklah dia menyiramkan air ke atas kepalanya dengan kedua-dua tangannya sebanyak tiga kali dan menggosokkan akar rambutnya dengan tangannya.\""
  },
  {
    "id": 34281,
    "hadith_number": 103,
    "tajuk_hadith": "Kewajipan Ghusl Apabila Bertemu Dua Khatan",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Said ibn al-\nMusayyab that Umar ibn al-Khattab and Uthman ibn Affan and A'isha, the\nwife of the Prophet, may Allah bless him and grant him peace, used to\nsay, \"When the circumcised part touches the circumcised part, ghusl is\nobligatory.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، وَعُثْمَانَ بْنَ عَفَّانَ، وَعَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَانُوا يَقُولُونَ إِذَا مَسَّ الْخِتَانُ الْخِتَانَ فَقَدْ وَجَبَ الْغُسْلُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik daripada Ibn Shihab daripada Said ibn al-Musayyab bahawa Umar ibn al-Khattab dan Uthman ibn Affan dan A'ishah, isteri Nabi, semoga Allah memberkatinya dan mengurniakan kesejahteraan ke atasnya, pernah berkata, \"Apabila bahagian yang berkhatan bertemu dengan bahagian yang berkhatan, maka wajiblah mandi ghusl.\""
  },
  {
    "id": 34282,
    "hadith_number": 104,
    "tajuk_hadith": "Kewajipan Mandi Junub (Ghusl) selepas Persetubuhan",
    "perawi_melayu": "Abu Salama ibn Abdar-Rahman ibn Awf, daripada A'ishah (Isteri Nabi Muhammad SAW)",
    "english_text": "Yahya related to me from Malik from Abu'n Nadr, the mawla of Umar\nibn Abdullah that Abu Salamaibn Abdar-Rahman ibn Awf related that he\nhad asked A'isha, the wife of the Prophet, may Allah bless him and\ngrant him peace, what made ghusl obligatory. She said, \"Do you know\nwhat you are like, Abu Salama? You are like a chick when it hears the\ncocks crowing and so crows with them. When the circumcised part passes\nthe circumcised part, ghusl is obligatory.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّهُ قَالَ سَأَلْتُ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم مَا يُوجِبُ الْغُسْلَ فَقَالَتْ هَلْ تَدْرِي مَا مَثَلُكَ يَا أَبَا سَلَمَةَ مَثَلُ الْفَرُّوجِ يَسْمَعُ الدِّيَكَةَ تَصْرُخُ فَيَصْرُخُ مَعَهَا إِذَا جَاوَزَ الْخِتَانُ الْخِتَانَ فَقَدْ وَجَبَ الْغُسْلُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abu'n Nadr, maula Umar ibn Abdullah, bahawa Abu Salama ibn Abdar-Rahman ibn Awf meriwayatkan bahawa dia telah bertanya kepada A'ishah, isteri Nabi SAW, apakah yang mewajibkan ghusl. A'ishah berkata, \"Adakah kamu tahu bagaimana keadaan kamu, wahai Abu Salama? Kamu seperti anak ayam apabila ia mendengar ayam jantan berkokok, lalu ia berkokok bersama-sama. Apabila bahagian yang berkhatan bertemu dengan bahagian yang berkhatan, maka wajiblah ghusl.\""
  },
  {
    "id": 34283,
    "hadith_number": 105,
    "tajuk_hadith": "Kewajipan Mandi Wajib: Apabila Bertemu Dua Khatan",
    "perawi_melayu": "Said ibn al-Musayyab",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said from Said ibn\nal-Musayyab that Abu Musa al-Ashari came to A'isha, the wife of the\nProphet, may Allah bless him and grant him peace, and said to her,\n\"The disagreement of the companions in a matter which I hate to bring\nbefore you has distressed me.\" She said, \"What is that? You did not\nask your mother about it, so ask me.\" He said, \"A man penetrates his\nwife, but becomes listless and does not ejaculate. \"She said, \"When\nthe circumcised part passes the circumcised part ghusl is obligatory.\"\nAbu Musa added, \"I shall never ask anyone about this after you.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ أَبَا مُوسَى الأَشْعَرِيَّ، أَتَى عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ لَهَا لَقَدْ شَقَّ عَلَىَّ اخْتِلاَفُ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فِي أَمْرٍ إِنِّي لأُعْظِمُ أَنْ أَسْتَقْبِلَكِ بِهِ ‏.‏ فَقَالَتْ مَا هُوَ مَا كُنْتَ سَائِلاً عَنْهُ أُمَّكَ فَسَلْنِي عَنْهُ ‏.‏ فَقَالَ الرَّجُلُ يُصِيبُ أَهْلَهُ ثُمَّ يُكْسِلُ وَلاَ يُنْزِلُ فَقَالَتْ إِذَا جَاوَزَ الْخِتَانُ الْخِتَانَ فَقَدْ وَجَبَ الْغُسْلُ ‏.‏ فَقَالَ أَبُو مُوسَى الأَشْعَرِيُّ لاَ أَسْأَلُ عَنْ هَذَا أَحَدًا بَعْدَكِ أَبَدًا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Yahya ibn Said daripada Said ibn al-Musayyab bahawa Abu Musa al-Ashari datang kepada A'ishah, isteri Nabi SAW, lalu berkata kepadanya, \"Sesungguhnya perbezaan pendapat sahabat mengenai suatu perkara yang saya malu untuk kemukakan kepada anda telah menyusahkan saya.\" A'ishah berkata, \"Apakah itu? Kamu tidak bertanya kepada ibumu tentangnya, maka tanyakanlah kepadaku.\" Abu Musa berkata, \"Seorang lelaki menggauli isterinya, tetapi kemudiannya menjadi lemah dan tidak mengeluarkan mani.\" A'ishah berkata, \"Apabila bahagian yang dikhatankan bertemu dengan bahagian yang dikhatankan, maka wajiblah mandi ghusl.\" Abu Musa menambahkan, \"Saya tidak akan bertanya tentang perkara ini kepada sesiapa pun selepas ini.\""
  },
  {
    "id": 34284,
    "hadith_number": 106,
    "tajuk_hadith": "Ghusl Diperlukan Selepas Persetubuhan Walaupun Tidak Mengeluarkan Air Mani",
    "perawi_melayu": "Yahya ibn Said, daripada Abdullah ibn Kab",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَبْدِ اللَّهِ بْنِ كَعْبٍ، مَوْلَى عُثْمَانَ بْنِ عَفَّانَ أَنَّ مَحْمُودَ بْنَ لَبِيدٍ الأَنْصَارِيَّ، سَأَلَ زَيْدَ بْنَ ثَابِتٍ عَنِ الرَّجُلِ، يُصِيبُ أَهْلَهُ ثُمَّ يُكْسِلُ وَلاَ يُنْزِلُ فَقَالَ زَيْدٌ يَغْتَسِلُ ‏.‏ فَقَالَ لَهُ مَحْمُودٌ إِنَّ أُبَىَّ بْنَ كَعْبٍ كَانَ لاَ يَرَى الْغُسْلَ ‏.‏ فَقَالَ لَهُ زَيْدُ بْنُ ثَابِتٍ إِنَّ أُبَىَّ بْنَ كَعْبٍ نَزَعَ عَنْ ذَلِكَ قَبْلَ أَنْ يَمُوتَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya ibn Said, daripada Abdullah ibn Kab, mawla Uthman ibn Affan bahawa Mahmud ibn Labid al-Ansari bertanya kepada Zayd ibn Thabit tentang seorang lelaki yang menyetubuhi isterinya tetapi menjadi lemah dan tidak mengeluarkan air mani. Zayd ibn Thabit berkata, \"Dia perlu mandi ghusl.\" Mahmud berkata kepadanya, \"Ubayy ibn Kab tidak berpendapat bahawa ghusl perlu,\" tetapi Zayd ibn Thabit berkata, \"Ubayy ibn Kab menarik diri daripada pendapat itu sebelum dia meninggal dunia.\""
  },
  {
    "id": 34285,
    "hadith_number": 107,
    "tajuk_hadith": "Kewajipan Ghusl Apabila Dua Bahagian Bersunat Bertemu",
    "perawi_melayu": "Abdullah ibn Umar (melalui Nafi' dan Malik)",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to say, \"When the circumcised part passes the circumcised part,\nghusl is obligatory.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ إِذَا جَاوَزَ الْخِتَانُ الْخِتَانَ فَقَدْ وَجَبَ الْغُسْلُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik daripada Nafi', bahawa Abdullah ibn Umar pernah berkata, \"Apabila bahagian bersunat (lelaki dan perempuan) bertemu, maka wajiblah mandi junub (ghusl).\""
  },
  {
    "id": 34286,
    "hadith_number": 108,
    "tajuk_hadith": "Cara Tidur Setelah Junub",
    "perawi_melayu": "Abdullah ibn Umar",
    "english_text": "Yahya related to me from Malik from Abdullah ibn Dinar that\nAbdullah ibn Umar related that Umar ibn al-Khattab mentioned to the\nMessenger of Allah, may Allah bless him and grant him peace, that he\nwould sometimes become junub in the night. The Messenger of Allah, may\nAllah bless him and grant him peace, said to him, \"Do wudu and wash\nyour penis, and then sleep.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ ذَكَرَ عُمَرُ بْنُ الْخَطَّابِ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ يُصِيبُهُ جَنَابَةٌ مِنَ اللَّيْلِ فَقَالَ لَهُ رَسُولُ اللَّهِ ‏\n\"‏ تَوَضَّأْ وَاغْسِلْ ذَكَرَكَ ثُمَّ نَمْ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abdullah ibn Dinar, daripada Abdullah ibn Umar, bahawa Umar ibn al-Khattab menyebut kepada Rasulullah ﷺ bahawa dia kadang-kadang mengalami junub pada waktu malam. Rasulullah ﷺ bersabda kepadanya, \"Berwuduklah dan basuhlah kemaluanmu, kemudian tidurlah.\""
  },
  {
    "id": 34287,
    "hadith_number": 109,
    "tajuk_hadith": "Wuduk Sebelum Tidur Selepas Berjimak",
    "perawi_melayu": "A'ishah (r.a.), isteri Nabi (s.a.w.)",
    "english_text": "If you have intercourse with your wife and then wish to go to sleep before doing ghusl, do not sleep until you have done wudu as for prayer.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا كَانَتْ تَقُولُ إِذَا أَصَابَ أَحَدُكُمُ الْمَرْأَةَ ثُمَّ أَرَادَ أَنْ يَنَامَ قَبْلَ أَنْ يَغْتَسِلَ فَلاَ يَنَمْ حَتَّى يَتَوَضَّأَ وُضُوءَهُ لِلصَّلاَةِ ‏.‏",
    "malay_translation": "A'ishah, isteri Nabi Muhammad (s.a.w.), pernah berkata, \"Jika seseorang daripada kamu telah bersama isterinya, kemudian ingin tidur sebelum mandi wajib, maka janganlah dia tidur sehingga berwuduk seperti wuduk untuk solat.\""
  },
  {
    "id": 34288,
    "hadith_number": 110,
    "tajuk_hadith": "Cara Abdullah bin Umar Apabila Ingin Tidur atau Makan dalam Keadaan Junub",
    "perawi_melayu": "Malik meriwayatkan daripada Nafi, bahawa Abdullah bin Umar",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar,\nif he wished to sleep or eat while junub, would wash his face, and his\narms to the elbows, and wipe his head. Then he would eat or sleep.\n\n\n2.20 The Repetition of the Prayer by a Person in a State of\nMajor Ritual Impurity, his Doing Ghusl, when He has Prayed without\nRemembering it, and his Washing his Garments.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا أَرَادَ أَنْ يَنَامَ، أَوْ يَطْعَمَ وَهُوَ جُنُبٌ غَسَلَ وَجْهَهُ وَيَدَيْهِ إِلَى الْمِرْفَقَيْنِ وَمَسَحَ بِرَأْسِهِ ثُمَّ طَعِمَ أَوْ نَامَ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Nafi, bahawa Abdullah bin Umar, apabila beliau ingin tidur atau makan dalam keadaan junub, akan membasuh wajahnya dan kedua tangannya hingga ke siku, dan menyapu kepalanya. Kemudian, beliau akan makan atau tidur."
  },
  {
    "id": 34289,
    "hadith_number": 111,
    "tajuk_hadith": "Rasulullah SAW Kembali ke Solat dengan Kesan Air",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Ismail ibn Abi Hakim that Ata\nibn Yasar told him that the Messenger of Allah, may Allah bless him\nand grant him peace, said the takbir in one of the prayers and then\nindicated to them with his hand to stay in place. He left and then\nreturned with traces of water on his skin.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي حَكِيمٍ، أَنَّ عَطَاءَ بْنَ يَسَارٍ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَبَّرَ فِي صَلاَةٍ مِنَ الصَّلَوَاتِ ثُمَّ أَشَارَ إِلَيْهِمْ بِيَدِهِ أَنِ امْكُثُوا فَذَهَبَ ثُمَّ رَجَعَ وَعَلَى جِلْدِهِ أَثَرُ الْمَاءِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik daripada Ismail bin Abi Hakim bahawa Ata' bin Yasar memberitahu beliau bahawa Rasulullah SAW bertakbir dalam salah satu solat, kemudian memberi isyarat dengan tangannya kepada mereka supaya kekal di tempat mereka. Baginda pergi kemudian kembali dengan kesan air pada kulitnya."
  },
  {
    "id": 34290,
    "hadith_number": 112,
    "tajuk_hadith": "Umar bin al-Khattab dan Ghusl selepas Mimpi Basah",
    "perawi_melayu": "Zuyayd ibn as-Salt",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ زُيَيْدِ بْنِ الصَّلْتِ، أَنَّهُ قَالَ خَرَجْتُ مَعَ عُمَرَ بْنِ الْخَطَّابِ إِلَى الْجُرُفِ فَنَظَرَ فَإِذَا هُوَ قَدِ احْتَلَمَ وَصَلَّى وَلَمْ يَغْتَسِلْ فَقَالَ وَاللَّهِ مَا أَرَانِي إِلاَّ احْتَلَمْتُ وَمَا شَعَرْتُ وَصَلَّيْتُ وَمَا اغْتَسَلْتُ قَالَ فَاغْتَسَلَ وَغَسَلَ مَا رَأَى فِي ثَوْبِهِ وَنَضَحَ مَا لَمْ يَرَ وَأَذَّنَ أَوْ أَقَامَ ثُمَّ صَلَّى بَعْدَ ارْتِفَاعِ الضُّحَى مُتَمَكِّنًا ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik daripada Hisham ibn Urwa bahawa Zuyayd ibn as-Salt berkata, \"Saya pergi bersama Umar ibn al-Khattab ke Juruf dan dia memandang ke bawah dan mendapati bahawa dia telah bermimpi basah dan telah solat tanpa melakukan ghusl. Dia berseru, 'Demi Allah, saya sedar bahawa saya telah bermimpi basah dan tidak mengetahuinya dan belum melakukan ghusl.' Lalu dia melakukan ghusl dan membasuh apa yang dilihatnya pada pakaiannya, dan memercikkan air pada apa yang tidak dilihatnya. Kemudian dia melaungkan azan atau iqamah dan solat di pertengahan pagi.\""
  },
  {
    "id": 34291,
    "hadith_number": 113,
    "tajuk_hadith": "Umar ibn al-Khattab dan Mimpi Basah",
    "perawi_melayu": "Sulayman ibn Yasar",
    "english_text": "Yahya related to me from Malik from Ismail ibn Abi Hakim from\nSulayman ibn Yasar that Umar ibn al-Khattab went out early in the\nmorning to his land in al-Juruf and found semen on his garment. He\nsaid, \"I have been tried with wet dreams since I have been entrusted\nwith governing the people.\" He did ghusl and washed his garment of\nwhat he saw of the semen, and then prayed after the sun had risen.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي حَكِيمٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، غَدَا إِلَى أَرْضِهِ بِالْجُرُفِ فَوَجَدَ فِي ثَوْبِهِ احْتِلاَمًا فَقَالَ لَقَدِ ابْتُلِيتُ بِالاِحْتِلاَمِ مُنْذُ وُلِّيتُ أَمْرَ النَّاسِ ‏.‏ فَاغْتَسَلَ وَغَسَلَ مَا رَأَى فِي ثَوْبِهِ مِنَ الاِحْتِلاَمِ ثُمَّ صَلَّى بَعْدَ أَنْ طَلَعَتِ الشَّمْسُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ismail ibn Abi Hakim, daripada Sulayman ibn Yasar bahawa Umar ibn al-Khattab keluar awal pagi ke tanahnya di al-Juruf dan mendapati air mani pada pakaiannya. Beliau berkata, \"Aku telah diuji dengan mimpi basah sejak aku diamanahkan untuk mentadbir urusan manusia.\" Beliau mandi wajib (ghusl) dan membasuh pakaiannya daripada apa yang dilihatnya daripada air mani, kemudian solat setelah matahari terbit."
  },
  {
    "id": 34292,
    "hadith_number": 114,
    "tajuk_hadith": "Umar ibn al-Khattab Mendapati Air Mani pada Pakaian",
    "perawi_melayu": "Yahya ibn Said, Sulayman ibn Yasar (melalui Malik)",
    "english_text": "Yahya related to me from Malik from Yahya ibn Said from Sulayman\nibn Yasar that Umar ibn al-Khattab led the people in the subh prayer\nand then went out to his land in Juruf and found semen on his clothes.\nHe said, \"Since we have been eating rich meat our veins have become\nfulsome.\" He did ghusl, washed the semen from his clothing, and did\nhis prayer again.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، صَلَّى بِالنَّاسِ الصُّبْحَ ثُمَّ غَدَا إِلَى أَرْضِهِ بِالْجُرُفِ فَوَجَدَ فِي ثَوْبِهِ احْتِلاَمًا فَقَالَ إِنَّا لَمَّا أَصَبْنَا الْوَدَكَ لاَنَتِ الْعُرُوقُ ‏.‏ فَاغْتَسَلَ وَغَسَلَ الاِحْتِلاَمَ مِنْ ثَوْبِهِ وَعَادَ لِصَلاَتِهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya ibn Said, daripada Sulayman ibn Yasar bahawa Umar ibn al-Khattab mengimami solat Subuh, kemudian pergi ke tanahnya di Juruf dan mendapati air mani pada pakaiannya. Beliau berkata, \"Sejak kita memakan daging yang kaya, urat kita telah menjadi gemuk.\" Beliau mandi wajib (ghusl), membasuh air mani dari pakaiannya, dan mengulangi solatnya."
  },
  {
    "id": 34293,
    "hadith_number": 115,
    "tajuk_hadith": "Umar ibn al-Khattab: Cara Mandi Junub dan Pensucian Pakaian",
    "perawi_melayu": "Yahya bin Abd ar-Rahman bin Hatib",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ يَحْيَى بْنِ عَبْدِ الرَّحْمَنِ بْنِ حَاطِبٍ، أَنَّهُ اعْتَمَرَ مَعَ عُمَرَ بْنِ الْخَطَّابِ فِي رَكْبٍ فِيهِمْ عَمْرُو بْنُ الْعَاصِ وَأَنَّ عُمَرَ بْنَ الْخَطَّابِ عَرَّسَ بِبَعْضِ الطَّرِيقِ قَرِيبًا مِنْ بَعْضِ الْمِيَاهِ فَاحْتَلَمَ عُمَرُ وَقَدْ كَادَ أَنْ يُصْبِحَ فَلَمْ يَجِدْ مَعَ الرَّكْبِ مَاءً فَرَكِبَ حَتَّى جَاءَ الْمَاءَ فَجَعَلَ يَغْسِلُ مَا رَأَى مِنْ ذَلِكَ الاِحْتِلاَمِ حَتَّى أَسْفَرَ فَقَالَ لَهُ عَمْرُو بْنُ الْعَاصِ أَصْبَحْتَ وَمَعَنَا ثِيَابٌ فَدَعْ ثَوْبَكَ يُغْسَلُ ‏.‏ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ وَاعَجَبًا لَكَ يَا عَمْرُو بْنَ الْعَاصِ لَئِنْ كُنْتَ تَجِدُ ثِيَابًا أَفَكُلُّ النَّاسِ يَجِدُ ثِيَابًا وَاللَّهِ لَوْ فَعَلْتُهَا لَكَانَتْ سُنَّةً بَلْ أَغْسِلُ مَا رَأَيْتُ وَأَنْضِحُ مَا لَمْ أَرَ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ وَجَدَ فِي ثَوْبِهِ أَثَرَ احْتِلاَمٍ وَلاَ يَدْرِي مَتَى كَانَ وَلاَ يَذْكُرُ شَيْئًا رَأَى فِي مَنَامِهِ قَالَ لِيَغْتَسِلْ مِنْ أَحْدَثِ نَوْمٍ نَامَهُ فَإِنْ كَانَ صَلَّى بَعْدَ ذَلِكَ النَّوْمِ فَلْيُعِدْ مَا كَانَ صَلَّى بَعْدَ ذَلِكَ النَّوْمِ مِنْ أَجْلِ أَنَّ الرَّجُلَ رُبَّمَا احْتَلَمَ وَلاَ يَرَى شَيْئًا وَيَرَى وَلاَ يَحْتَلِمُ فَإِذَا وَجَدَ فِي ثَوْبِهِ مَاءً فَعَلَيْهِ الْغُسْلُ وَذَلِكَ أَنَّ عُمَرَ أَعَادَ مَا كَانَ صَلَّى لآخِرِ نَوْمٍ نَامَهُ وَلَمْ يُعِدْ مَا كَانَ قَبْلَهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Hisham ibn Urwa, daripada bapanya, daripada Yahya ibn Abd ar-Rahman ibn Hatib bahawa dia pernah menunaikan umrah bersama Umar ibn al-Khattab dalam satu rombongan yang turut serta Amr ibn al-As. Umar ibn al-Khattab berhenti berehat pada lewat malam di satu jalan berhampiran sebuah oasis. Umar mengalami mimpi basah ketika hampir subuh dan tiada air dalam rombongan tersebut. Dia menunggang sehingga sampai ke tempat air, kemudian dia mula mencuci apa yang dilihatnya daripada air mani tersebut sehingga ia hilang. Amr ibn al-As berkata kepadanya, \"Sudah pagi dan kami ada pakaian, jadi biarkan pakaianmu dicuci.\" Umar ibn al-Khattab berkata kepadanya, \"Aku hairan denganmu, Amr ibn al-As! Walaupun kamu boleh mendapatkan pakaian, adakah semua orang boleh mendapatkannya? Demi Allah, jika aku melakukannya, ia akan menjadi sunnah. Tidak, aku mencuci apa yang aku lihat, dan aku menyembur dengan air apa yang aku tidak lihat.\"\n\nMalik berkata tentang seorang lelaki yang mendapati kesan mimpi basah pada pakaiannya dan tidak tahu bila ia berlaku dan tidak mengingati apa-apa yang dilihatnya dalam tidurnya. Dia berkata, \"Hendaklah niat ghuslnya dari masa dia tidur terakhir, dan jika dia telah solat sejak tidur terakhir itu, hendaklah dia mengulanginya. Ini kerana selalunya seorang lelaki bermimpi basah dan tidak melihat apa-apa, dan selalunya dia melihat sesuatu tetapi tidak keluar mani. Tetapi, jika dia mendapati cecair pada pakaiannya, dia mesti melakukan ghusl. Ini kerana Umar mengulangi apa yang telah dia solat selepas waktu dia tidur terakhir dan bukan apa yang sebelumnya."
  },
  {
    "id": 34294,
    "hadith_number": 116,
    "tajuk_hadith": "Wanita Mengalami Ghusl Setelah Mimpi Basah",
    "perawi_melayu": "Umm Sulayman, Aisyah",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Urwa ibn az-Zubayr that Umm Sulayman said to the Messenger of Allah, may Allah bless him and grant him peace, \"Should a woman do ghusl when she experiences the same as a man in her sleep?\" The Messenger of Al lah said to her, \"Yes, she should do ghusl. \"A'isha said to her, \"Shame on you! Does a woman see that?\" (i.e. a liquid.) The Messenger of Allah, may Allah bless him and grant him peace, said to her, \"May your right hand be full of dust. From where does family resemblance come?\"",
    "arabic_text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّ أُمَّ سُلَيْمٍ، قَالَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم الْمَرْأَةُ تَرَى فِي الْمَنَامِ مِثْلَ مَا يَرَى الرَّجُلُ أَتَغْتَسِلُ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَعَمْ فَلْتَغْتَسِلْ ‏\"‏ ‏.‏ فَقَالَتْ لَهَا عَائِشَةُ أُفٍّ لَكِ وَهَلْ تَرَى ذَلِكَ الْمَرْأَةُ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تَرِبَتْ يَمِينُكِ وَمِنْ أَيْنَ يَكُونُ الشَّبَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Urwa bin az-Zubayr, bahawa Umm Sulayman berkata kepada Rasulullah ﷺ: \"Seorang wanita bermimpi seperti yang dialami lelaki, adakah dia perlu mandi wajib (ghusl)?\" Rasulullah ﷺ bersabda kepadanya: \"Ya, dia perlu mandi wajib.\" Aisyah berkata kepadanya: \"Alangkah malunya kamu! Adakah wanita melihat perkara itu?\" (iaitu cecair). Rasulullah ﷺ bersabda kepadanya: \"Semoga tangan kananmu dipenuhi debu. Dari mana datangnya persamaan (anak dengan ibu bapa)?\""
  },
  {
    "id": 34295,
    "hadith_number": 117,
    "tajuk_hadith": "Kewajipan Mandi Junub bagi Wanita Selepas Mimpi Basah",
    "perawi_melayu": "Umm Salama",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather from Zaynab bint Abi Salama that Umm Salama, the wife of the\nProphet, may Allah bless him and grant him peace, said, \"Umm Salama,\nthe wife of Abu Talha al-Ansari, came to the Messenger of Allah, may\nAllah bless him and grant him peace, and said, 'Messenger of Allah!\nAllah is not ashamed of the truth-does a woman have to do ghusl if she\nhas had an erotic dream?' He said, 'Yes, if she sees any liquid.' \"",
    "arabic_text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ جَاءَتْ أُمُّ سُلَيْمٍ امْرَأَةُ أَبِي طَلْحَةَ الأَنْصَارِيِّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ لاَ يَسْتَحْيِي مِنَ الْحَقِّ هَلْ عَلَى الْمَرْأَةِ مِنْ غُسْلٍ إِذَا هِيَ احْتَلَمَتْ فَقَالَ ‏\n\"‏ نَعَمْ إِذَا رَأَتِ الْمَاءَ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Hisyam bin Urwah, daripada bapanya, daripada Zainab binti Abi Salama, daripada Umm Salama, isteri Nabi SAW, bahawa beliau berkata, \"Umm Sulaim, isteri Abu Talha al-Ansari, datang kepada Rasulullah SAW lalu berkata, 'Wahai Rasulullah! Sesungguhnya Allah tidak malu terhadap kebenaran. Adakah wanita wajib mandi junub jika bermimpi basah?' Baginda menjawab, 'Ya, jika dia melihat air.'\""
  },
  {
    "id": 34296,
    "hadith_number": 118,
    "tajuk_hadith": "Boleh Mandi Junub dengan Air Bekas Isteri (Selain Haid atau Junub)",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Nafi', bahawa Abdullah ibn Umar berkata",
    "english_text": "There is no harm in doing ghusl with water that has been used by one's wife as long as she is not menstruating or in a state of major ritual impurity (junub).",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ لاَ بَأْسَ أَنْ يُغْتَسَلَ بِفَضْلِ الْمَرْأَةِ مَا لَمْ تَكُنْ حَائِضًا أَوْ جُنُبًا ‏.‏",
    "malay_translation": "Tiada masalah untuk mandi *ghusl* dengan air bekas isteri selagi dia tidak dalam keadaan haid atau dalam keadaan junub."
  },
  {
    "id": 34297,
    "hadith_number": 119,
    "tajuk_hadith": "Solat dengan Pakaian yang Berpeluh dalam Keadaan Junub",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to sweat in a garment while he was junub and then pray with it\non.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَعْرَقُ فِي الثَّوْبِ وَهُوَ جُنُبٌ ثُمَّ يُصَلِّي فِيهِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik daripada Nafi', bahawasanya Abdullah ibn Umar pernah berpeluh di dalam pakaiannya sedangkan dia dalam keadaan junub, kemudian dia solat dengan pakaian itu."
  },
  {
    "id": 34298,
    "hadith_number": 120,
    "tajuk_hadith": "Hukum Menyentuh Wanita Haid dan Perkara Berkaitan Junub",
    "perawi_melayu": "Malik, daripada Nafi'",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَغْسِلُ جَوَارِيهِ رِجْلَيْهِ وَيُعْطِينَهُ الْخُمْرَةَ وَهُنَّ حُيَّضٌ ‏.‏ وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ لَهُ نِسْوَةٌ وَجَوَارِي هَلْ يَطَؤُهُنَّ جَمِيعًا قَبْلَ أَنْ يَغْتَسِلَ فَقَالَ لاَ بَأْسَ بِأَنْ يُصِيبَ الرَّجُلُ جَارِيَتَيْهِ قَبْلَ أَنْ يَغْتَسِلَ فَأَمَّا النِّسَاءُ الْحَرَائِرُ فَيُكْرَهُ أَنْ يُصِيبَ الرَّجُلُ الْمَرْأَةَ الْحُرَّةَ فِي يَوْمِ الأُخْرَى فَأَمَّا أَنَّ يُصِيبَ الْجَارِيَةَ ثُمَّ يُصِيبَ الأُخْرَى وَهُوَ جُنُبٌ فَلاَ بَأْسَ بِذَلِكَ ‏.‏ وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ جُنُبٍ وُضِعَ لَهُ مَاءٌ يَغْتَسِلُ بِهِ فَسَهَا فَأَدْخَلَ أَصْبُعَهُ فِيهِ لِيَعْرِفَ حَرَّ الْمَاءِ مِنْ بَرْدِهِ ‏.‏ قَالَ مَالِكٌ إِنْ لَمْ يَكُنْ أَصَابَ أَصْبُعَهُ أَذًى فَلاَ أَرَى ذَلِكَ يُنَجِّسُ عَلَيْهِ الْمَاءَ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Nafi', bahawasanya Abdullah bin Umar membasuh kaki hamba-hambanya perempuan dan mereka memberikan khumrah (tikar kecil) kepadanya ketika mereka sedang haid. Malik ditanya mengenai seorang lelaki yang mempunyai isteri dan hamba perempuan. Bolehkah dia menggauli mereka semua sebelum mandi junub? Beliau menjawab: \"Tiada masalah bagi seorang lelaki menggauli dua hamba perempuannya sebelum mandi junub. Adapun isteri-isteri yang merdeka, adalah makruh bagi seorang lelaki menggauli isteri yang merdeka pada hari isteri yang lain. Adapun menggauli seorang hamba perempuan kemudian menggauli yang lain sedangkan dia junub, maka tiada masalah dalam hal itu.\" Malik ditanya tentang seorang lelaki yang junub, dan air telah disediakan untuk dia mandi. Kemudian dia terlupa dan memasukkan jarinya ke dalam air tersebut untuk mengetahui panas atau sejuknya air. Malik berkata: \"Jika tidak ada kotoran yang mengenai jarinya, saya tidak menganggap hal itu akan mencemarkan air tersebut.\""
  },
  {
    "id": 34299,
    "hadith_number": 121,
    "tajuk_hadith": "Kisah Tayammum Aisyah dan Keutamaan Keluarga Abu Bakr",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik, daripada Abd ar-Rahman ibn al-Qasim, daripada ayahnya, daripada A'ishah umm al-muminin",
    "english_text": "Yahya related to me from Malik from Abd arRahman ibn al-Qasim\nfrom his father that A'isha umm al-muminin said, \"We went out on a\njourney with the Messenger of Allah, may Allah bless him and grant him\npeace, and, when we came to Bayda' or Dhat al-Jaysh, a necklace of\nmine broke. The Messenger of Allah, may Allah bless him and grant him\npeace, stopped to look for it and the people stopped with him. There\nwas no water nearby and the people were not carrying any with them, so\nthey came to Abu Bakr as-Siddiq and said, 'Don't you see what A'isha\nhas done? She has made the Messenger of Allah, may Allah bless him and\ngrant him peace, and the people stop when there is no water nearby and\nthey are not carrying any with them.' \"\n\n\nA'isha continued,\n\"Abu Bakr came and the Messenger of Allah, may Allah bless him and\ngrant him peace, had fallen asleep with his head on my thigh . Abu\nBakr said, 'You have made the Messenger of Allah, may Allah bless him\nand grant him peace, and the people stop when there is no water nearby\nand they are not carrying any with them ' \"\n\n\nShe continued,\n\"Abu Bakr remonstrated with me and said whatever Allah willed him to\nsay, and began to poke me in the waist. The only thing that stopped me\nfrom moving was that the Messenger of Allah, may Allah bless him and\ngrant him peace, had his head on my thigh. The Messenger of Allah, may\nAllah bless him and grant him peace, slept until morning found him\nwith no water. Allah, the Blessed and Exalted, sent down the ayat of\ntayammum and so they did tayammum. Usayd ibn Hudayr said, 'This is not\nthe first baraka from you, O family of Abu Bakr.'\"\n\n\nA'isha\nadded, \"We roused the camel I had been on and found the necklace under\nit.\"\n\n\nMalik was asked whether a man who did tayammum for one\nprayer should do tayammum when the time of the next prayer came or\nwhether the first tayammum was enough. He said, \"No, he does tayammum\nfor every prayer, because he has to look for water for every prayer.\nIf he looks for it and does not find it then he does tayammum.\"\n\n\nMalik was asked whether a man who did tayammum could lead others\nin prayer if they were in wudu. He said, \"I prefer that someone else\nshould lead them. However, I see no harm in it if he does lead them in\nprayer.\"\n\n\nYahya said that Malik said that a man who did\ntayammum because he could not find any water, and then stood and said\nthe takbir and entered into the prayer, and then someone came with\nsome water, did not stop his prayer but completed it with tayammum and\ndid wudu for future prayers.\n\n\nYahya said that Malik said,\n\"Whoever rises for prayer and does not find water and so does what\nAllah has ordered him to do of tayammum has obeyed Allah. Someone who\ndoes find water is neither purer than him nor more perfect in prayer,\nbecause both have been commanded and each does as Allah has commanded.\nWhat Allah has commanded as far as wudu is concerned is for the one\nwho finds water, and tayammum is for the one who does not find water\nbefore he enters into the prayer.\"\n\n\nMalik said that a man who\nwas in a state of major ritual impurity could do tayammum and read his\nportion of Qur'an and do voluntary prayers as long as he did not find\nany water. This applied only to circumstances in which it was\nallowable to pray with tayammum.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّهَا قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي بَعْضِ أَسْفَارِهِ حَتَّى إِذَا كُنَّا بِالْبَيْدَاءِ - أَوْ بِذَاتِ الْجَيْشِ - انْقَطَعَ عِقْدٌ لِي فَأَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الْتِمَاسِهِ وَأَقَامَ النَّاسُ مَعَهُ وَلَيْسُوا عَلَى مَاءٍ وَلَيْسَ مَعَهُمْ مَاءٌ فَأَتَى النَّاسُ إِلَى أَبِي بَكْرٍ الصِّدِّيقِ فَقَالُوا أَلاَ تَرَى مَا صَنَعَتْ عَائِشَةُ أَقَامَتْ بِرَسُولِ اللَّهِ صلى الله عليه وسلم وَبِالنَّاسِ وَلَيْسُوا عَلَى مَاءٍ وَلَيْسَ مَعَهُمْ مَاءٌ ‏.‏ قَالَتْ عَائِشَةُ فَجَاءَ أَبُو بَكْرٍ وَرَسُولُ اللَّهِ صلى الله عليه وسلم وَاضِعٌ رَأْسَهُ عَلَى فَخِذِي قَدْ نَامَ فَقَالَ حَبَسْتِ رَسُولَ اللَّهِ صلى الله عليه وسلم وَالنَّاسَ وَلَيْسُوا عَلَى مَاءٍ وَلَيْسَ مَعَهُمْ مَاءٌ قَالَتْ عَائِشَةُ فَعَاتَبَنِي أَبُو بَكْرٍ فَقَالَ مَا شَاءَ اللَّهُ أَنْ يَقُولَ وَجَعَلَ يَطْعُنُ بِيَدِهِ فِي خَاصِرَتِي فَلاَ يَمْنَعُنِي مِنَ التَّحَرُّكِ إِلاَّ مَكَانُ رَأْسِ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى فَخِذِي فَنَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى أَصْبَحَ عَلَى غَيْرِ مَاءٍ فَأَنْزَلَ اللَّهُ تَبَارَكَ وَتَعَالَى آيَةَ التَّيَمُّمِ فَتَيَمَّمُوا ‏.‏ فَقَالَ أُسَيْدُ بْنُ حُضَيْرٍ مَا هِيَ بِأَوَّلِ بَرَكَتِكُمْ يَا آلَ أَبِي بَكْرٍ ‏.‏ قَالَتْ فَبَعَثْنَا الْبَعِيرَ الَّذِي كُنْتُ عَلَيْهِ فَوَجَدْنَا الْعِقْدَ تَحْتَهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abd ar-Rahman bin al-Qasim, daripada ayahnya, daripada A'ishah, Ummul Mukminin, bahawa beliau berkata: \"Kami keluar bersama Rasulullah SAW dalam suatu perjalanan. Apabila kami sampai di al-Bayda' atau Dhat al-Jaysh, rantai kalungku terputus. Rasulullah SAW berhenti untuk mencarinya, dan orang ramai turut berhenti bersama Baginda. Ketika itu tiada air berhampiran dan orang ramai juga tidak membawa air bersama mereka. Lalu mereka menemui Abu Bakar as-Siddiq dan berkata: 'Tidakkah kamu melihat apa yang telah dilakukan oleh A'ishah? Dia telah menyebabkan Rasulullah SAW dan orang ramai berhenti sedangkan tiada air berhampiran dan mereka juga tidak membawa air bersama mereka.'\"\n\nA'ishah meneruskan: \"Abu Bakar datang dan Rasulullah SAW sedang meletakkan kepala Baginda di atas pahaku dalam keadaan tertidur. Abu Bakar berkata: 'Kamu telah menyebabkan Rasulullah SAW dan orang ramai berhenti sedangkan tiada air berhampiran dan mereka juga tidak membawa air bersama mereka.'\"\n\nBeliau meneruskan: \"Abu Bakar menegurku dan berkata apa yang Allah kehendaki untuk dikatakannya, dan mula mencucuk pinggangku dengan tangannya. Satu-satunya perkara yang menghalangnya daripada bergerak ialah kerana Rasulullah SAW meletakkan kepalanya di atas pahaku. Rasulullah SAW tidur sehingga waktu pagi tiba tanpa air. Allah SWT menurunkan ayat tayammum, lalu mereka bertayammum. Usayd bin Hudayr berkata: 'Ini bukanlah keberkatan pertama daripada kamu, wahai keluarga Abu Bakar.'\"\n\nA'ishah menambah: \"Kami membangkitkan unta yang saya tunggangi dan mendapati rantai kalung itu di bawahnya.\"\n\nMalik ditanya sama ada seseorang yang bertayammum untuk satu solat perlu bertayammum semula apabila masuk waktu solat seterusnya atau adakah tayammum yang pertama itu sudah memadai. Beliau menjawab: \"Tidak, dia perlu bertayammum untuk setiap solat, kerana dia perlu mencari air untuk setiap solat. Jika dia mencari tetapi tidak menjumpainya, maka dia bertayammum.\"\n\nMalik ditanya sama ada seseorang yang bertayammum boleh mengimamkan solat bagi orang lain yang berwuduk. Beliau menjawab: \"Saya lebih suka jika orang lain yang mengimamkan mereka. Walau bagaimanapun, saya tidak melihat sebarang kemudaratan jika dia mengimamkan mereka dalam solat.\"\n\nYahya berkata bahawa Malik berkata bahawa seseorang yang bertayammum kerana tidak menjumpai air, kemudian berdiri dan mengucapkan takbir dan memulakan solat, dan kemudian seseorang datang membawa air, tidak perlu menghentikan solatnya tetapi menyempurnakannya dengan tayammum dan berwuduk untuk solat-solat yang akan datang.\n\nYahya berkata bahawa Malik berkata: \"Sesiapa yang bangkit untuk solat dan tidak menjumpai air, lalu melakukan apa yang Allah perintahkan kepadanya iaitu tayammum, maka dia telah mentaati Allah. Seseorang yang menjumpai air tidaklah lebih suci daripadanya dan tidak pula lebih sempurna dalam solat, kerana kedua-duanya telah diperintahkan dan masing-masing melakukan seperti yang Allah perintahkan. Apa yang Allah perintahkan berkaitan wuduk adalah bagi orang yang menjumpai air, dan tayammum adalah bagi orang yang tidak menjumpai air sebelum dia memulakan solat.\"\n\nMalik berkata bahawa seseorang yang berada dalam keadaan hadas besar boleh bertayammum dan membaca sebahagian daripada Al-Quran dan melakukan solat sunat selama dia tidak menjumpai air. Ini terpakai hanya dalam keadaan di mana dibenarkan untuk solat dengan tayammum."
  },
  {
    "id": 34300,
    "hadith_number": 122,
    "tajuk_hadith": "Abdullah bin Umar Melakukan Tayammum",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nand he were approaching Juruf. When they got to Mirbad, Abdullah got\ndown and did tayammum with some good earth. He wiped his face, and his\narms to the elbows, and then prayed.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّهُ أَقْبَلَ هُوَ وَعَبْدُ اللَّهِ بْنُ عُمَرَ مِنَ الْجُرُفِ حَتَّى إِذَا كَانَا بِالْمِرْبَدِ نَزَلَ عَبْدُ اللَّهِ فَتَيَمَّمَ صَعِيدًا طَيِّبًا فَمَسَحَ وَجْهَهُ وَيَدَيْهِ إِلَى الْمِرْفَقَيْنِ ثُمَّ صَلَّى ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik, daripada Nafi', bahawa dia dan Abdullah bin Umar sedang menghampiri Juruf. Apabila mereka sampai di Mirbad, Abdullah turun dan melakukan tayammum dengan tanah yang baik. Dia menyapu mukanya dan kedua-dua tangannya hingga ke siku, kemudian menunaikan solat."
  },
  {
    "id": 34301,
    "hadith_number": 123,
    "tajuk_hadith": "Tayammum Abdullah ibn Umar",
    "perawi_melayu": "Malik daripada Nafi'",
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to do tayammum up to his elbows.\n\n\nMalik was asked about\nhow tayammum was done and what parts were covered and he said, \"Strike\nthe ground once for the face and once for the arms and wipe them to\nthe elbows.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَتَيَمَّمُ إِلَى الْمِرْفَقَيْنِ ‏.‏ وَسُئِلَ مَالِكٌ كَيْفَ التَّيَمُّمُ وَأَيْنَ يَبْلُغُ بِهِ فَقَالَ يَضْرِبُ ضَرْبَةً لِلْوَجْهِ وَضَرْبَةً لِلْيَدَيْنِ وَيَمْسَحُهُمَا إِلَى الْمِرْفَقَيْنِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Nafi' bahawa Abdullah ibn Umar melakukan tayammum hingga ke siku.\n\nMalik ditanya tentang bagaimana tayammum dilakukan dan bahagian mana yang perlu disapu, lalu beliau berkata, \"Pukul tanah sekali untuk muka dan sekali untuk tangan, dan sapu mereka ke siku.\""
  },
  {
    "id": 34302,
    "hadith_number": 124,
    "tajuk_hadith": "Hukum Tayammum Apabila Menemui Air dan Tanah Bergaram",
    "perawi_melayu": "Yahya",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَرْمَلَةَ، أَنَّ رَجُلاً، سَأَلَ سَعِيدَ بْنَ الْمُسَيَّبِ عَنِ الرَّجُلِ الْجُنُبِ، يَتَيَمَّمُ ثُمَّ يُدْرِكُ الْمَاءَ فَقَالَ سَعِيدٌ إِذَا أَدْرَكَ الْمَاءَ فَعَلَيْهِ الْغُسْلُ لِمَا يُسْتَقْبَلُ ‏.‏ قَالَ مَالِكٌ فِيمَنِ احْتَلَمَ وَهُوَ فِي سَفَرٍ وَلاَ يَقْدِرُ مِنَ الْمَاءِ إِلاَّ عَلَى قَدْرِ الْوُضُوءِ وَهُوَ لاَ يَعْطَشُ حَتَّى يَأْتِيَ الْمَاءَ قَالَ يَغْسِلُ بِذَلِكَ فَرْجَهُ وَمَا أَصَابَهُ مِنْ ذَلِكَ الأَذَى ثُمَّ يَتَيَمَّمُ صَعِيدًا طَيِّبًا كَمَا أَمَرَهُ اللَّهُ ‏.‏ وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ جُنُبٍ أَرَادَ أَنْ يَتَيَمَّمَ فَلَمْ يَجِدْ تُرَابًا إِلاَّ تُرَابَ سَبَخَةٍ هَلْ يَتَيَمَّمُ بِالسِّبَاخِ وَهَلْ تُكْرَهُ الصَّلاَةُ فِي السِّبَاخِ قَالَ مَالِكٌ لاَ بَأْسَ بِالصَّلاَةِ فِي السِّبَاخِ وَالتَّيَمُّمِ مِنْهَا لأَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَالَ ‏{‏فَتَيَمَّمُوا صَعِيدًا طَيِّبًا‏}‏ فَكُلُّ مَا كَانَ صَعِيدًا فَهُوَ يُتَيَمَّمُ بِهِ سِبَاخًا كَانَ أَوْ غَيْرَهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Abd ar-Rahman ibn Harmala bahawa seorang lelaki bertanya kepada Said ibn al-Musayyab tentang seorang lelaki yang junub yang bertayammum kemudian mendapati air. Said berkata, \"Apabila dia mendapati air, maka dia wajib mandi wajib untuk apa yang akan datang (selepas itu).\" Malik berkata tentang seseorang yang bermimpi basah semasa dalam perjalanan dan hanya mempunyai air sekadar untuk wuduk dan dia tidak dahaga, dan dia tidak perlu menggunakannya untuk itu, \"Hendaklah dia mencuci kemaluannya, dan apa sahaja yang terkena air mani, dengan air tersebut dan kemudian dia bertayammum dengan tanah yang baik sebagaimana yang diperintahkan Allah.\" Malik ditanya sama ada seorang lelaki yang junub dan ingin bertayammum tetapi hanya menemui tanah bergaram boleh bertayammum dengannya, dan sama ada makruh untuk solat di atas tanah bergaram. Dia berkata, \"Tidak mengapa solat di atas tanah bergaram atau menggunakannya untuk bertayammum, kerana Allah Subhanahu Wa Ta'ala telah berfirman, '...dan bertayammumlah dengan tanah yang baik.' Seseorang itu menjadi suci dengan bertayammum dengan segala sesuatu yang merupakan tanah, sama ada ia bergaram atau sebaliknya.\""
  },
  {
    "id": 34303,
    "hadith_number": 125,
    "tajuk_hadith": "Hukum Berinteraksi dengan Isteri Ketika Haid",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Zayd ibn Aslam",
    "english_text": "Yahya related to me from Malik from Zayd ibn Aslam that a man\nquestioned the Messenger of Allah, may Allah bless him and grant him\npeace, saying, \"What is permitted me from my wife when she is\nmenstruating?\" The Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Let her wrap her waist-wrapper round herself\ntightly, and then what is above that is your concern.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ رَجُلاً، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ مَا يَحِلُّ لِي مِنِ امْرَأَتِي وَهِيَ حَائِضٌ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لِتَشُدَّ عَلَيْهَا إِزَارَهَا ثُمَّ شَأْنَكَ بِأَعْلاَهَا ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Zayd ibn Aslam, bahawa seorang lelaki bertanya kepada Rasulullah ﷺ: \"Apakah yang halal bagiku daripada isteriku ketika dia sedang haid?\" Rasulullah ﷺ bersabda: \"Hendaklah dia mengikat kain sarungnya dengan ketat, kemudian (interaksi) di atasnya adalah urusanmu.\""
  },
  {
    "id": 34304,
    "hadith_number": 126,
    "tajuk_hadith": "Aisyah dan Rasulullah SAW: Perihal Haid",
    "perawi_melayu": "Rabiah ibn Abi Abd ar-Rahman",
    "english_text": "Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman\nthat on one occasion A'isha, the wife of the Prophet, may Allah bless\nhim and grant him peace, was sleeping with the Messenger of Allah, may\nAllah bless him and grant him peace, in one garment, when suddenly she\njumped up sharply. The Messenger of Allah, may Allah bless him and\ngrant him peace, said to her, \"What's the matter with you? Are you\nlosing blood?\", meaning menstruating. She said, \"Yes.\" He said, \"Wrap\nyour waist-wrapper tightly about you, and return to your sleeping-\nplace.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَانَتْ مُضْطَجِعَةً مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي ثَوْبٍ وَاحِدٍ وَأَنَّهَا قَدْ وَثَبَتْ وَثْبَةً شَدِيدَةً فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا لَكِ لَعَلَّكِ نَفِسْتِ ‏\"‏ ‏.‏ يَعْنِي الْحَيْضَةَ ‏.‏ فَقَالَتْ نَعَمْ ‏.‏ قَالَ ‏\"‏ شُدِّي عَلَى نَفْسِكِ إِزَارَكِ ثُمَّ عُودِي إِلَى مَضْجَعِكِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik daripada Rabiah ibn Abi Abd ar-Rahman bahawa pada suatu ketika Aisyah, isteri Nabi, semoga Allah melimpahkan rahmat dan kesejahteraan ke atasnya, sedang tidur bersama Rasulullah SAW, dalam sehelai kain, tiba-tiba dia melompat dengan tiba-tiba. Rasulullah SAW bersabda kepadanya, \"Apakah yang berlaku kepada kamu? Adakah kamu mengalami pendarahan?\" maksudnya haid. Dia berkata, \"Ya.\" Baginda bersabda, \"Ikatlah kain pinggangmu dengan ketat, dan kembalilah ke tempat tidurmu.\""
  },
  {
    "id": 34305,
    "hadith_number": 127,
    "tajuk_hadith": "Hukum Bersentuhan Suami Isteri Ketika Haid",
    "perawi_melayu": "Ubaydullah bin Abdullah bin Umar",
    "english_text": "Yahya related to me from Malik from Nafi that Ubaydullah ibn\nAbdullah ibn Umar sent a question to A'isha asking her, \"May a man\nfondle his wife when she is menstruating?\" She replied, \"Let her wrap\nher waist-wrapper around her lower part and then he may fondle her if\nhe wishes.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَرْسَلَ إِلَى عَائِشَةَ يَسْأَلُهَا هَلْ يُبَاشِرُ الرَّجُلُ امْرَأَتَهُ وَهِيَ حَائِضٌ فَقَالَتْ لِتَشُدَّ إِزَارَهَا عَلَى أَسْفَلِهَا ثُمَّ يُبَاشِرُهَا إِنْ شَاءَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Nafi' bahawa Ubaydullah bin Abdullah bin Umar telah menghantar soalan kepada A'ishah, bertanya, \"Bolehkah seorang lelaki menyentuh isterinya ketika dia sedang haid?\" Beliau menjawab, \"Hendaklah dia mengikat kainnya di bahagian bawahnya, kemudian dia boleh menyentuhnya jika dia mahu.\""
  },
  {
    "id": 34306,
    "hadith_number": 128,
    "tajuk_hadith": "Hubungan Seks Suami Isteri Ketika Haid",
    "perawi_melayu": "Salim ibn Abdullah dan Sulayman ibn Yasar (seperti yang diriwayatkan daripada Imam Malik)",
    "english_text": "Yahya related to me from Malik that he had heard that Salim ibn\nAbdullah and Sulayman ibn Yasar were asked whether the husband of a\nmenstruating woman could have sexual intercourse with her when she saw\nthat she was pure but before she had had a ghusl. They said, \"No, not\nuntil she has had a ghusl.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سَالِمَ بْنَ عَبْدِ اللَّهِ، وَسُلَيْمَانَ بْنَ يَسَارٍ، سُئِلاَ عَنِ الْحَائِضِ، هَلْ يُصِيبُهَا زَوْجُهَا إِذَا رَأَتِ الطُّهْرَ قَبْلَ أَنْ تَغْتَسِلَ فَقَالاَ لاَ حَتَّى تَغْتَسِلَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa dia mendengar Salim ibn Abdullah dan Sulayman ibn Yasar ditanya sama ada suami wanita yang sedang haid boleh melakukan hubungan seksual dengannya apabila dia melihat dirinya suci tetapi sebelum dia mandi wajib. Mereka berkata, \"Tidak, sehingga dia mandi wajib.\""
  },
  {
    "id": 34307,
    "hadith_number": 129,
    "tajuk_hadith": "Wanita Bertanya Kepada A'ishah (RA) Mengenai Solat Semasa Haid",
    "perawi_melayu": "Alqama ibn Abi AIqama",
    "english_text": "Yahya related to me from Malik from AIqama ibn Abi AIqama that\nhis mother, the mawla of A'isha, umm al-muminin, said, \"Women used to\nsend little boxes to A'isha, umm al-muminin, with a piece of cotton\ncloth in each one on which was yellowness from menstrual blood, asking\nher about the prayer. She said to them, 'Do not be hasty until you see\na white discharge.\" By that she meant purity from menses.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَلْقَمَةَ بْنِ أَبِي عَلْقَمَةَ، عَنْ أُمِّهِ، مَوْلاَةِ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ أَنَّهَا قَالَتْ كَانَ النِّسَاءُ يَبْعَثْنَ إِلَى عَائِشَةَ أُمِّ الْمُؤْمِنِينَ بِالدِّرَجَةِ فِيهَا الْكُرْسُفُ فِيهِ الصُّفْرَةُ مِنْ دَمِ الْحَيْضَةِ يَسْأَلْنَهَا عَنِ الصَّلاَةِ فَتَقُولُ لَهُنَّ لاَ تَعْجَلْنَ حَتَّى تَرَيْنَ الْقَصَّةَ الْبَيْضَاءَ ‏.‏ تُرِيدُ بِذَلِكَ الطُّهْرَ مِنَ الْحَيْضَةِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Alqama ibn Abi Alqama, daripada ibunya, mawla A'ishah, umm al-muminin, bahawa dia berkata, \"Wanita-wanita dahulu menghantar kotak-kotak kecil kepada A'ishah, umm al-muminin, dengan sehelai kain kapas di dalamnya terdapat kesan kekuningan daripada darah haid, bertanya kepadanya mengenai solat. Beliau berkata kepada mereka, 'Janganlah tergesa-gesa sehingga kamu melihat cecair putih.' Dengan itu, beliau bermaksud kesucian daripada haid."
  },
  {
    "id": 34308,
    "hadith_number": 130,
    "tajuk_hadith": "Wanita Memeriksa Kesucian di Tengah Malam",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Abdullah ibn Abi Bakr from\nhis paternal aunt from the daughter of Zayd ibn Thabit that she had\nheard that women used to ask for lamps in the middle of the night to\ncheck their purity. She would criticise them for this saying, \"Women\nnever used to do this,\" i.e. in the time of the companions.\n\n\nMalik was asked whether a woman whose period had finished could\ndo tayammum to purify herself if she could not find waterand he said,\n\"Yes, because she is like some one in a state of major ritual\nimpurity, who, if he cannot find water, does tayammum.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ عَمَّتِهِ، عَنِ ابْنَةِ زَيْدِ بْنِ ثَابِتٍ، أَنَّهُ بَلَغَهَا أَنَّ نِسَاءً، كُنَّ يَدْعُونَ بِالْمَصَابِيحِ مِنْ جَوْفِ اللَّيْلِ يَنْظُرْنَ إِلَى الطُّهْرِ فَكَانَتْ تَعِيبُ ذَلِكَ عَلَيْهِنَّ وَتَقُولُ مَا كَانَ النِّسَاءُ يَصْنَعْنَ هَذَا ‏.‏ وَسُئِلَ مَالِكٌ عَنِ الْحَائِضِ تَطْهُرُ فَلاَ تَجِدُ مَاءً هَلْ تَتَيَمَّمُ قَالَ نَعَمْ لِتَتَيَمَّمْ فَإِنَّ مِثْلَهَا مِثْلُ الْجُنُبِ إِذَا لَمْ يَجِدْ مَاءً تَيَمَّمَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik, daripada Abdullah bin Abi Bakr, daripada ibu saudaranya (sebelah bapa), daripada anak perempuan Zayd ibn Thabit, bahawa dia mendengar wanita-wanita dahulu meminta lampu pada tengah malam untuk memeriksa kesucian mereka. Dia mengkritik mereka kerana perbuatan ini sambil berkata, \"Wanita-wanita tidak pernah melakukan ini,\" iaitu pada zaman para sahabat.\n\nMalik ditanya sama ada seorang wanita yang telah selesai haidnya boleh bertayammum untuk membersihkan dirinya jika dia tidak menemui air, dan dia menjawab, \"Ya, kerana dia seperti seseorang dalam keadaan najis besar, yang jika dia tidak menemui air, dia bertayammum.\""
  },
  {
    "id": 34309,
    "hadith_number": 131,
    "tajuk_hadith": "Wanita Hamil Berdarah Meninggalkan Solat",
    "perawi_melayu": "Aisyah (RA)",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ فِي الْمَرْأَةِ الْحَامِلِ تَرَى الدَّمَ أَنَّهَا تَدَعُ الصَّلاَةَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa beliau mendengar bahawa Aisyah, isteri Nabi ﷺ, berkata mengenai wanita hamil yang melihat darah, bahawa dia meninggalkan solat."
  },
  {
    "id": 34310,
    "hadith_number": 132,
    "tajuk_hadith": "Wanita Hamil Berdarah dan Larangan Solat",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik that he asked Ibn Shihab about a\npregnant woman who noticed bleeding. Ibn Shihab replied, \"She refrains\nfrom prayer.\"\n\n\nYahya said that Malik said, \"That is what is\ndone in our community.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنِ الْمَرْأَةِ الْحَامِلِ، تَرَى الدَّمَ قَالَ تَكُفُّ عَنِ الصَّلاَةِ، ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَذَلِكَ الأَمْرُ عِنْدَنَا ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa dia bertanya kepada Ibn Shihab tentang seorang wanita hamil yang melihat pendarahan. Ibn Shihab menjawab, \"Dia berhenti daripada solat.\"\n\nYahya berkata bahawa Malik berkata, \"Itulah yang diamalkan dalam komuniti kami.\""
  },
  {
    "id": 34311,
    "hadith_number": 133,
    "tajuk_hadith": "Menyikat Rambut Rasulullah SAW Ketika Haid",
    "perawi_melayu": "Aisyah RA",
    "english_text": "I used to comb the head of the Messenger of Allah, may Allah bless him and grant him peace, while I was menstruating.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ كُنْتُ أُرَجِّلُ رَأْسَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَنَا حَائِضٌ ‏.‏",
    "malay_translation": "Daripada Aisyah RA, isteri Nabi SAW, berkata: \"Saya pernah menyikat rambut Rasulullah SAW ketika saya sedang haid.\""
  },
  {
    "id": 34312,
    "hadith_number": 134,
    "tajuk_hadith": "Cara Menangani Darah Haid pada Pakaian",
    "perawi_melayu": "Asma' binti Abu Bakr as-Siddiq",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ بْنِ الزُّبَيْرِ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ الصِّدِّيقِ، أَنَّهَا قَالَتْ سَأَلَتِ امْرَأَةٌ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَتْ أَرَأَيْتَ إِحْدَانَا إِذَا أَصَابَ ثَوْبَهَا الدَّمُ مِنَ الْحَيْضَةِ كَيْفَ تَصْنَعُ فِيهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا أَصَابَ ثَوْبَ إِحْدَاكُنَّ الدَّمُ مِنَ الْحَيْضَةِ فَلْتَقْرُصْهُ ثُمَّ لِتَنْضَحْهُ بِالْمَاءِ ثُمَّ لِتُصَلِّي فِيهِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik daripada Hisham bin Urwa daripada bapanya daripada Fatimah binti al-Mundhir ibn az-Zubayr bahawa Asma' binti Abu Bakr as-Siddiq berkata, \"Seorang wanita bertanya kepada Rasulullah SAW, katanya, 'Jika darah haid terkena pakaian kami, apakah yang perlu kami lakukan?' Rasulullah SAW bersabda, 'Jika darah haid terkena pakaian salah seorang daripada kamu, hendaklah ia menggosoknya, kemudian menyiramnya dengan air, dan kemudian solat di dalamnya.'\""
  },
  {
    "id": 34313,
    "hadith_number": 135,
    "tajuk_hadith": "Hukum Wanita yang Mengalami Istihadah (Pendarahan)",
    "perawi_melayu": "A'ishah (r.a.)",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ قَالَتْ فَاطِمَةُ بِنْتُ أَبِي حُبَيْشٍ يَا رَسُولَ اللَّهِ إِنِّي لاَ أَطْهُرُ أَفَأَدَعُ الصَّلاَةَ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّمَا ذَلِكِ عِرْقٌ وَلَيْسَتْ بِالْحَيْضَةِ فَإِذَا أَقْبَلَتِ الْحَيْضَةُ فَاتْرُكِي الصَّلاَةَ فَإِذَا ذَهَبَ قَدْرُهَا فَاغْسِلِي الدَّمَ عَنْكِ وَصَلِّي ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik, daripada Hisham bin Urwah, daripada ayahnya, daripada A'ishah, isteri Nabi ﷺ, bahawa beliau berkata: Fatimah binti Abu Hubaysh berkata, \"Wahai Rasulullah, sesungguhnya saya tidak pernah suci, adakah saya perlu meninggalkan solat?\" Rasulullah ﷺ bersabda kepadanya, \"Itu hanyalah urat dan bukanlah haid. Apabila datang haid, tinggalkanlah solat, dan apabila tempohnya berakhir, basuhlah darah daripada dirimu dan solatlah.\""
  },
  {
    "id": 34314,
    "hadith_number": 136,
    "tajuk_hadith": "Wanita Mengalami Pendarahan Berlebihan: Arahan Rasulullah SAW",
    "perawi_melayu": "Umm Salama",
    "english_text": "Yahya related to me from Malik from Nafi from Sulayman ibn\nYasarfrom Umm Salama, the wife of the Prophet, may Allah bless him and\ngrant him peace, that a certain woman in the time of the Messenger of\nAllah, may Allah bless him and grant him peace, used to bleed\nprofusely, so Umm Salama consulted the Messenger of Allah, may Allah\nbless him and grant him peace, for her, and he said, \"She should\ncalculate the number of nights and days a month that she used to\nmenstruate before it started happening, and she should leave off from\nprayerfor that much of the month. When she has completed that she\nshould do ghusl, bind her private parts with a cloth, and then pray.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ امْرَأَةً كَانَتْ تُهَرَاقُ الدِّمَاءَ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَاسْتَفْتَتْ لَهَا أُمُّ سَلَمَةَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ لِتَنْظُرْ إِلَى عَدَدِ اللَّيَالِي وَالأَيَّامِ الَّتِي كَانَتْ تَحِيضُهُنَّ مِنَ الشَّهْرِ قَبْلَ أَنْ يُصِيبَهَا الَّذِي أَصَابَهَا فَلْتَتْرُكِ الصَّلاَةَ قَدْرَ ذَلِكَ مِنَ الشَّهْرِ فَإِذَا خَلَّفَتْ ذَلِكَ فَلْتَغْتَسِلْ ثُمَّ لِتَسْتَثْفِرْ بِثَوْبٍ ثُمَّ لِتُصَلِّي ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Nafi', daripada Sulayman bin Yasar, daripada Umm Salama, isteri Nabi SAW, bahawa seorang wanita pada zaman Rasulullah SAW mengalami pendarahan yang berlebihan. Umm Salama meminta fatwa kepada Rasulullah SAW mengenai hal itu, lalu Baginda bersabda: \"Hendaklah dia mengira bilangan malam dan hari yang dia biasa haid sebelum ia ditimpa dengan apa yang menimpanya (pendarahan). Hendaklah dia meninggalkan solat sebanyak bilangan itu daripada bulan. Apabila dia telah selesai dari tempoh itu, hendaklah dia mandi wajib (ghusl), menutup kemaluannya dengan kain, kemudian solat.\""
  },
  {
    "id": 34315,
    "hadith_number": 137,
    "tajuk_hadith": "Wanita Istihadhah: Mandi dan Solat",
    "perawi_melayu": "",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather from Zaynab bint Abu Salama that she saw Zaynab bint Jahsh, the\nwife of Abd ar-Rahman ibn Awf, and she used to bleed as if\nmenstruating. She would do ghusl and pray.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، أَنَّهَا رَأَتْ زَيْنَبَ بِنْتَ جَحْشٍ الَّتِي كَانَتْ تَحْتَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَكَانَتْ تُسْتَحَاضُ فَكَانَتْ تَغْتَسِلُ وَتُصَلِّي ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Hisyam bin Urwah daripada bapanya daripada Zaynab binti Abu Salamah bahawa dia melihat Zaynab binti Jahsh, isteri Abd ar-Rahman ibn Awf, dan dia mengalami istihadhah (pendarahan di luar waktu haid). Dia mandi (ghusl) dan solat."
  },
  {
    "id": 34316,
    "hadith_number": 138,
    "tajuk_hadith": "Cara Mandi Wajib Bagi Wanita yang Mengalami Istihadhah",
    "perawi_melayu": "Malik daripada Sumayy, mawla Abu Bakr ibn Abd ar-Rahman",
    "english_text": "Yahya related to me from Malik from Sumayy, the mawla of Abu Bakr ibn Abd ar-Rahman that al-Qaqa ibn Hakim and Zayd ibn Aslam sent him to Said ibn al-Musayyab to ask how a woman who was bleeding as if menstruating should do ghusl. Said said, \"She does a ghusl to cover from the end of one period to the end of the next, and does wudu for every prayer, and if bleeding overtakes her she should bind her private parts.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ أَنَّ الْقَعْقَاعَ بْنَ حَكِيمٍ، وَزَيْدَ بْنَ أَسْلَمَ، أَرْسَلاَهُ إِلَى سَعِيدِ بْنِ الْمُسَيَّبِ يَسْأَلُهُ كَيْفَ تَغْتَسِلُ الْمُسْتَحَاضَةُ فَقَالَ تَغْتَسِلُ مِنْ طُهْرٍ إِلَى طُهْرٍ وَتَتَوَضَّأُ لِكُلِّ صَلاَةٍ فَإِنْ غَلَبَهَا الدَّمُ اسْتَثْفَرَتْ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Sumayy, mawla Abu Bakr ibn Abd ar-Rahman, bahawa al-Qa'qa ibn Hakim dan Zayd ibn Aslam telah mengutusnya kepada Sa'id ibn al-Musayyab untuk bertanya tentang cara seorang wanita yang mengalami pendarahan seperti haid perlu melakukan ghusl. Sa'id berkata, \"Dia melakukan ghusl dari satu tempoh suci ke tempoh suci yang lain, dan berwuduk untuk setiap solat. Sekiranya pendarahan berterusan, dia harus mengikat kemaluannya.\""
  },
  {
    "id": 34317,
    "hadith_number": 139,
    "tajuk_hadith": "Wanita Istihadhah dan Nifas: Hukum Solat dan Hubungan Suami Isteri",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ لَيْسَ عَلَى الْمُسْتَحَاضَةِ إِلاَّ أَنْ تَغْتَسِلَ غُسْلاً وَاحِدًا ثُمَّ تَتَوَضَّأُ بَعْدَ ذَلِكَ لِكُلِّ صَلاَةٍ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا أَنَّ الْمُسْتَحَاضَةَ إِذَا صَلَّتْ أَنَّ لِزَوْجِهَا أَنْ يُصِيبَهَا وَكَذَلِكَ النُّفَسَاءُ إِذَا بَلَغَتْ أَقْصَى مَا يُمْسِكُ النِّسَاءَ الدَّمُ فَإِنْ رَأَتِ الدَّمَ بَعْدَ ذَلِكَ فَإِنَّهُ يُصِيبُهَا زَوْجُهَا وَإِنَّمَا هِيَ بِمَنْزِلَةِ الْمُسْتَحَاضَةِ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِي الْمُسْتَحَاضَةِ عَلَى حَدِيثِ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ وَهُوَ أَحَبُّ مَا سَمِعْتُ إِلَىَّ فِي ذَلِكَ ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku daripada Malik, daripada Hisyam bin Urwah, daripada bapanya, bahawa sesungguhnya dia berkata: \"Wanita yang mengalami istihadhah tidak wajib ke atasnya kecuali mandi sekali sahaja, kemudian berwuduk selepas itu untuk setiap solat.\" Yahya berkata: \"Malik berkata: 'Pendapat kami ialah wanita yang mengalami istihadhah apabila telah selesai solat, maka suaminya boleh menggaulinya. Begitu juga wanita nifas apabila telah sampai tempoh maksimum darah yang menahan wanita, jika dia melihat darah selepas itu, maka suaminya boleh menggaulinya dan dia seperti wanita yang mengalami istihadhah.'\" Yahya berkata: \"Malik berkata: 'Pendapat kami tentang wanita yang mengalami istihadhah adalah berdasarkan hadith Hisyam bin Urwah daripada bapanya, dan ia adalah yang paling saya sukai daripada apa yang saya dengar tentang perkara itu.'"
  },
  {
    "id": 34318,
    "hadith_number": 140,
    "tajuk_hadith": "Menyucikan Air Kencing Bayi Lelaki",
    "perawi_melayu": "A'ishah (Isteri Nabi)",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِصَبِيٍّ فَبَالَ عَلَى ثَوْبِهِ فَدَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِمَاءٍ فَأَتْبَعَهُ إِيَّاهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepadaku daripada Malik, daripada Hisham bin Urwah, daripada bapanya, daripada A'ishah, isteri Nabi ﷺ, bahawa dia berkata, \"Seorang bayi lelaki dibawa kepada Rasulullah ﷺ, lalu dia kencing pada pakaiannya. Kemudian Rasulullah ﷺ meminta air dan menyapukan air tersebut ke atasnya.\""
  },
  {
    "id": 34319,
    "hadith_number": 141,
    "tajuk_hadith": "Nabi SAW Memercikkan Air pada Air Kencing Bayi",
    "perawi_melayu": "Umm Qays binti Mihsan",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Ubaydullah\nibn Abdullah ibn Utba ibn Masud from Umm Qays ibn Mihsan that she\nbrought a baby boy of hers who was not yet eating food to the\nMessenger of Allah, may Allah bless him and grant him peace, and he\nsat it in his arms and it urinated on his garment, so the Messenger of\nAllah, may Allah bless him and grant him peace, called for some water\nand sprinkled over it but did not wash it.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ، أَنَّهَا أَتَتْ بِابْنٍ لَهَا صَغِيرٍ لَمْ يَأْكُلِ الطَّعَامَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَجْلَسَهُ فِي حَجْرِهِ فَبَالَ عَلَى ثَوْبِهِ فَدَعَا رَسُولُ اللَّهِ بِمَاءٍ فَنَضَحَهُ وَلَمْ يَغْسِلْهُ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Ubaydullah bin Abdullah bin Utba bin Masud, daripada Umm Qays binti Mihsan bahawa dia membawa seorang bayi lelaki yang belum makan makanan kepada Rasulullah SAW, lalu baginda mendudukannya di dalam pangkuannya. Kemudian bayi itu kencing pada pakaian baginda. Rasulullah SAW lalu meminta air dan memercikkannya pada pakaian itu, tetapi tidak membasuhnya."
  },
  {
    "id": 34320,
    "hadith_number": 142,
    "tajuk_hadith": "Kisah Badwi Kencing di Masjid",
    "perawi_melayu": "Yahya ibn Said",
    "english_text": "Yahya related to me from Malik that Yahya ibn Said said, \"A\nBedouin came into the mosque and uncovered his private parts to\nurinate. The people called out to him and began to raise their voices\nbut the Messenger of Allah, may Allah bless him and grant him peace,\nsaid ,'Let him be. 'So they let him be and he urinated. Then the\nMessenger of Allah, may Allah bless him and grant him peace, ordered a\nbucketful of water to be brought and it was poured on the place.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ دَخَلَ أَعْرَابِيٌّ الْمَسْجِدَ فَكَشَفَ عَنْ فَرْجِهِ لِيَبُولَ فَصَاحَ النَّاسُ بِهِ حَتَّى عَلاَ الصَّوْتُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اتْرُكُوهُ ‏\"‏ ‏.‏ فَتَرَكُوهُ فَبَالَ ثُمَّ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِذَنُوبٍ مِنْ مَاءٍ فَصُبَّ عَلَى ذَلِكَ الْمَكَانِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yahya ibn Said, bahawa seorang Badwi masuk ke dalam masjid dan membuka auratnya untuk kencing. Orang ramai memarahinya dan meninggikan suara mereka, tetapi Rasulullah SAW bersabda, 'Biarkan dia.' Lalu mereka membiarkannya dan dia kencing. Kemudian Rasulullah SAW memerintahkan supaya dibawa sebaldi air dan air itu dituang di tempat tersebut."
  },
  {
    "id": 34321,
    "hadith_number": 143,
    "tajuk_hadith": "Abdullah ibn Umar Kencing Berdiri dan Pensucian Daripada Air Kencing",
    "perawi_melayu": "Abdullah ibn Dinar, Yahya dan Malik",
    "english_text": "Yahya related to mefrom Malikthat Abdullah ibn Dinar said, \"I saw\nAbdullah ibn Umar urinating while standing.\"\n\n\nYahya said that\nMalik was asked if any hadith had come down about washing the private\nparts of urine and faeces and he said, \"I have heard that some of\nthose who have passed away used to wash themselves of faeces. I like\nto wash my private parts of urine.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّهُ قَالَ رَأَيْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ يَبُولُ قَائِمًا ‏.‏ قَالَ يَحْيَى وَسُئِلَ مَالِكٌ عَنْ غَسْلِ الْفَرْجِ مِنَ الْبَوْلِ وَالْغَائِطِ هَلْ جَاءَ فِيهِ أَثَرٌ فَقَالَ بَلَغَنِي أَنَّ بَعْضَ مَنْ مَضَى كَانُوا يَتَوَضَّئُونَ مِنَ الْغَائِطِ وَأَنَا أُحِبُّ أَنْ أَغْسِلَ الْفَرْجَ مِنَ الْبَوْلِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik bahawa Abdullah ibn Dinar berkata, \"Saya melihat Abdullah ibn Umar kencing sambil berdiri.\" Yahya berkata bahawa Malik ditanya jika terdapat hadis tentang mencuci kemaluan daripada air kencing dan najis dan dia berkata, \"Saya telah mendengar bahawa sebahagian daripada mereka yang telah meninggal dunia pernah mencuci diri mereka daripada najis. Saya suka mencuci kemaluan saya daripada air kencing.\""
  },
  {
    "id": 34322,
    "hadith_number": 144,
    "tajuk_hadith": "Perintah Rasulullah SAW untuk Bersuci dan Berwangi-wangian pada Hari Jumaat",
    "perawi_melayu": "Yahya meriwayatkan daripada Malik daripada Ibn Shihab daripada Ibn as-Sabbaq",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Ibn as-Sabbaq\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid in a jumua, \"Muslims! Allah has made this day a festival day (id)\nso do ghusl, and it will not harm whoever has perfume to apply some of\nit, and use a tooth-stick . \"",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ السَّبَّاقِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ فِي جُمُعَةٍ مِنَ الْجُمَعِ ‏\n\"‏ يَا مَعْشَرَ الْمُسْلِمِينَ إِنَّ هَذَا يَوْمٌ جَعَلَهُ اللَّهُ عِيدًا فَاغْتَسِلُوا وَمَنْ كَانَ عِنْدَهُ طِيبٌ فَلاَ يَضُرُّهُ أَنْ يَمَسَّ مِنْهُ وَعَلَيْكُمْ بِالسِّوَاكِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik daripada Ibn Shihab daripada Ibn as-Sabbaq bahawa Rasulullah SAW bersabda pada hari Jumaat, \"Wahai kaum Muslimin! Sesungguhnya hari ini Allah telah menjadikannya sebagai hari raya (hari perayaan), maka mandilah (ghusl), dan sesiapa yang mempunyai minyak wangi, tidak mengapa dia memakainya, dan gunakanlah kayu sugi (siwak).\""
  },
  {
    "id": 34323,
    "hadith_number": 145,
    "tajuk_hadith": "Keutamaan Penggunaan Kayu Sugi (Siwak)",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "Were it not that I would be overburdening my community I would have ordered them to use a tooth-stick.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَوْلاَ أَنْ أَشُقَّ عَلَى أُمَّتِي لأَمَرْتُهُمْ بِالسِّوَاكِ ‏\"‏ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik, daripada Abu'z Zinad, daripada al-A'raj, daripada Abu Hurairah bahawa Rasulullah SAW bersabda, \"Jika tidak kerana aku khuatir akan membebankan umatku, nescaya aku akan memerintahkan mereka menggunakan kayu sugi (siwak).\""
  },
  {
    "id": 34324,
    "hadith_number": 146,
    "tajuk_hadith": "Perintah Menggunakan Kayu Sugi (Siwak) Jika Tidak Memberatkan Umat",
    "perawi_melayu": "Abu Hurairah رضي الله عنه",
    "english_text": "Were it not that he would be overburdening his community he (the Messenger of Allah, may Allah bless him and grant him peace,) would have ordered them to use a tooth-stick with each wudu.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ لَوْلاَ أَنْ يَشُقَّ، عَلَى أُمَّتِهِ لأَمَرَهُمْ بِالسِّوَاكِ مَعَ كُلِّ وُضُوءٍ ‏.‏",
    "malay_translation": "Daripada Abu Hurairah رضي الله عنه berkata, \"Sekiranya tidak memberatkan umatnya, nescaya Rasulullah صلى الله عليه وسلم memerintahkan mereka menggunakan siwak (kayu sugi) setiap kali berwudhu.\""
  }
]
