[
  {
    "id": 34426,
    "hadith_number": 248,
    "tajuk_hadith": "Solat Tarawih: Kekhuatiran Menjadi Wajib",
    "perawi_melayu": "A'ishah, isteri Nabi ﷺ",
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Urwa ibn az-Zubayr from A'isha, the wife of the Prophet, may Allah bless him and grant him peace, that the Messenger of Allah, may Allah bless him and grant him peace, prayed in the mosque one night and people prayed behind him. Then he prayed the next night and there were more people. Then they gathered on the third or fourth night and the Messenger of Allah, may Allah bless him and grant him peace, did not come out to them. In the morning, he said, \"I saw what you were doing and the only thing that prevented me from coming out to you was that I feared that it would become obligatory (fard) for you.\" This happened in Ramadan.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى فِي الْمَسْجِدِ ذَاتَ لَيْلَةٍ فَصَلَّى بِصَلاَتِهِ نَاسٌ ثُمَّ صَلَّى اللَّيْلَةَ الْقَابِلَةَ فَكَثُرَ النَّاسُ ثُمَّ اجْتَمَعُوا مِنَ اللَّيْلَةِ الثَّالِثَةِ أَوِ الرَّابِعَةِ فَلَمْ يَخْرُجْ إِلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمَّا أَصْبَحَ قَالَ ‏\n\"‏ قَدْ رَأَيْتُ الَّذِي صَنَعْتُمْ وَلَمْ يَمْنَعْنِي مِنَ الْخُرُوجِ إِلَيْكُمْ إِلاَّ أَنِّي خَشِيتُ أَنْ تُفْرَضَ عَلَيْكُمْ ‏\"‏ ‏.‏ وَذَلِكَ فِي رَمَضَانَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Urwa bin az-Zubayr, daripada A'ishah, isteri Nabi ﷺ, bahawasanya Rasulullah ﷺ bersolat di masjid pada suatu malam, lalu orang ramai bersolat di belakang baginda. Kemudian baginda bersolat pada malam berikutnya, dan orang ramai bertambah. Kemudian mereka berkumpul pada malam ketiga atau keempat, tetapi Rasulullah ﷺ tidak keluar kepada mereka. Pada waktu pagi, baginda bersabda, \"Sesungguhnya aku telah melihat apa yang kamu lakukan, dan tiada apa yang menghalangku daripada keluar kepada kamu melainkan aku khuatir ia akan menjadi wajib (fard) ke atas kamu.\" Peristiwa ini berlaku di bulan Ramadhan."
  },
  {
    "id": 34427,
    "hadith_number": 249,
    "tajuk_hadith": "Ganjaran Solat Malam di Bulan Ramadan",
    "perawi_melayu": "Abu Hurairah r.a.",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُرَغِّبُ فِي قِيَامِ رَمَضَانَ مِنْ غَيْرِ أَنْ يَأْمُرَ بِعَزِيمَةٍ فَيَقُولُ ‏\n\"‏ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏ ‏.‏ قَالَ ابْنُ شِهَابٍ فَتُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالأَمْرُ عَلَى ذَلِكَ ثُمَّ كَانَ الأَمْرُ عَلَى ذَلِكَ فِي خِلاَفَةِ أَبِي بَكْرٍ وَصَدْرًا مِنْ خِلاَفَةِ عُمَرَ بْنِ الْخَطَّابِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Ibn Shihab, daripada Abu Salama bin Abd ar-Rahman bin Awf, daripada Abu Hurairah r.a. bahawa Rasulullah SAW menggalakkan manusia untuk melakukan solat malam di bulan Ramadan tanpa mewajibkannya. Baginda bersabda, \"Sesiapa yang melakukan solat malam di bulan Ramadan dengan penuh keimanan dan mengharapkan ganjaran daripada Allah, akan diampunkan segala dosanya yang lalu.\" Ibn Shihab berkata, \"Rasulullah SAW wafat dalam keadaan yang sedemikian, dan keadaan tersebut berterusan pada zaman pemerintahan Abu Bakr dan pada awal pemerintahan Umar ibn al-Khattab.\""
  },
  {
    "id": 34428,
    "hadith_number": 250,
    "tajuk_hadith": "Umar Mengumpulkan Orang Ramai dalam Solat Tarawih",
    "perawi_melayu": "Abd ar-Rahman ibn Abd al-Qari",
    "english_text": "Malik related to me from Ibn Shihab from Urwa ibn az-Zubayr that\nAbd ar-Rahman ibn Abd al-Qari said, \"I went out with Umar ibn\nalKhattab in Ramadan to the mosque and the people there were spread\nout in groups. Some men were praying by themselves, whilst others were\npraying in small groups. Umar said, 'By Allah! It would be better in\nmy opinion if these people gathered behind one reciter.' So he\ngathered them behind Ubayy ibn Kab. Then I went out with him another\nnight and the people were praying behind their Qur'an reciter. Umar\nsaid, 'How excellent this new way is, but what you miss while you are\nasleep is better than what you watch in prayer.' He meant the end of\nthe night, and people used to watch the beginning of the night in\nprayer.\"",
    "arabic_text": "حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدٍ الْقَارِيِّ، أَنَّهُ قَالَ خَرَجْتُ مَعَ عُمَرَ بْنِ الْخَطَّابِ فِي رَمَضَانَ إِلَى الْمَسْجِدِ فَإِذَا النَّاسُ أَوْزَاعٌ مُتَفَرِّقُونَ يُصَلِّي الرَّجُلُ لِنَفْسِهِ وَيُصَلِّي الرَّجُلُ فَيُصَلِّي بِصَلاَتِهِ الرَّهْطُ فَقَالَ عُمَرُ وَاللَّهِ إِنِّي لأَرَانِي لَوْ جَمَعْتُ هَؤُلاَءِ عَلَى قَارِئٍ وَاحِدٍ لَكَانَ أَمْثَلَ ‏.‏ فَجَمَعَهُمْ عَلَى أُبَىِّ بْنِ كَعْبٍ - قَالَ - ثُمَّ خَرَجْتُ مَعَهُ لَيْلَةً أُخْرَى وَالنَّاسُ يُصَلُّونَ بِصَلاَةِ قَارِئِهِمْ فَقَالَ عُمَرُ نِعْمَتِ الْبِدْعَةُ هَذِهِ وَالَّتِي تَنَامُونَ عَنْهَا أَفْضَلُ مِنَ الَّتِي تَقُومُونَ ‏.‏ يَعْنِي آخِرَ اللَّيْلِ وَكَانَ النَّاسُ يَقُومُونَ أَوَّلَهُ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Ibn Shihab daripada Urwa ibn az-Zubayr bahawa Abd ar-Rahman ibn Abd al-Qari berkata, \"Aku keluar bersama Umar ibn al-Khattab pada bulan Ramadan ke masjid, dan orang ramai berpecah kepada beberapa kumpulan. Sebahagian lelaki bersolat sendirian, sementara yang lain bersolat dalam kumpulan kecil. Umar berkata, 'Demi Allah! Adalah lebih baik pada pendapatku jika orang-orang ini berkumpul di belakang seorang pembaca.' Maka beliau mengumpulkan mereka di belakang Ubayy ibn Kab. Kemudian aku keluar bersamanya pada malam yang lain, dan orang ramai bersolat di belakang pembaca al-Quran mereka. Umar berkata, 'Alangkah baiknya cara baharu ini, tetapi apa yang kamu tinggalkan semasa kamu tidur adalah lebih baik daripada apa yang kamu tonton dalam solat.' Beliau bermaksud akhir malam, dan orang ramai dahulu bersolat pada awal malam.\""
  },
  {
    "id": 34429,
    "hadith_number": 251,
    "tajuk_hadith": "Umar memerintahkan solat malam 11 rakaat",
    "perawi_melayu": "Muhammad ibn Yusuf, daripada as-Sa'ib ibn Yazid",
    "english_text": "Yahya related to me from Malik from Muhammad ibn Yusuf that as-\nSa'ib ibn Yazid said, \"Umar ibn al-Khattab ordered Ubayy ibn Kab and\nTamim ad-Dari to watch the night in prayer with the people for eleven\nrakas.The reciterof the Qur'an would recite the Mi'in (a group of\nmedium-sized suras) until we would be leaning on our staffs from\nhaving stood so long in prayer. And we would not leave until the\napproach of dawn.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ يُوسُفَ، عَنِ السَّائِبِ بْنِ يَزِيدَ، أَنَّهُ قَالَ أَمَرَ عُمَرُ بْنُ الْخَطَّابِ أُبَىَّ بْنَ كَعْبٍ وَتَمِيمًا الدَّارِيَّ أَنْ يَقُومَا، لِلنَّاسِ بِإِحْدَى عَشْرَةَ رَكْعَةً قَالَ وَقَدْ كَانَ الْقَارِئُ يَقْرَأُ بِالْمِئِينَ حَتَّى كُنَّا نَعْتَمِدُ عَلَى الْعِصِيِّ مِنْ طُولِ الْقِيَامِ وَمَا كُنَّا نَنْصَرِفُ إِلاَّ فِي فُرُوعِ الْفَجْرِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Muhammad ibn Yusuf, daripada as-Sa'ib ibn Yazid bahawa beliau berkata, \"Umar ibn al-Khattab memerintahkan Ubayy ibn Kab dan Tamim ad-Dari untuk mengimamkan solat malam bersama-sama manusia dengan sebelas rakaat. Pembaca al-Quran akan membaca surah-surah Mi'in (kumpulan surah bersaiz sederhana) sehinggalah kami bersandar pada tongkat kami kerana berdiri lama dalam solat. Dan kami tidak akan beredar sehingga hampir fajar."
  },
  {
    "id": 34430,
    "hadith_number": 252,
    "tajuk_hadith": "Solat Tarawih 23 Rakaat di Zaman Umar ibn al-Khattab",
    "perawi_melayu": "Yahya meriwayatkan dari Malik bahawa Yazid ibn Ruman berkata,",
    "english_text": "Yahya related to me from Malik that Yazid ibn Ruman said, \"The\npeople used to watch the night in prayer during Ramadan for twenty-\nthree rakas in the time of Umar ibn al-Khattab.\"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ رُومَانَ، أَنَّهُ قَالَ كَانَ النَّاسُ يَقُومُونَ فِي زَمَانِ عُمَرَ بْنِ الْخَطَّابِ فِي رَمَضَانَ بِثَلاَثٍ وَعِشْرِينَ رَكْعَةً ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Yazid ibn Ruman, bahawa beliau berkata: \"Manusia mengerjakan solat malam (Tarawih) dalam bulan Ramadhan pada zaman Umar ibn al-Khattab sebanyak tiga dan dua puluh rakaat."
  },
  {
    "id": 34431,
    "hadith_number": 253,
    "tajuk_hadith": "Amalan Orang Ramai Semasa Bulan Ramadan",
    "perawi_melayu": "",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، أَنَّهُ سَمِعَ الأَعْرَجَ، يَقُولُ مَا أَدْرَكْتُ النَّاسَ إِلاَّ وَهُمْ يَلْعَنُونَ الْكَفَرَةَ فِي رَمَضَانَ ‏.‏ قَالَ وَكَانَ الْقَارِئُ يَقْرَأُ سُورَةَ الْبَقَرَةِ فِي ثَمَانِ رَكَعَاتٍ فَإِذَا قَامَ بِهَا فِي اثْنَتَىْ عَشْرَةَ رَكْعَةً رَأَى النَّاسُ أَنَّهُ قَدْ خَفَّفَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Da'ud ibn al-Husayn bahawa dia mendengar al-A'raj berkata, \"Aku tidak pernah menemui orang ramai kecuali mereka melaknat orang-orang kafir di bulan Ramadan.\"  Dia menambah, \"Pembaca al-Quran dahulu membaca Surah al-Baqarah dalam lapan rakaat, dan jika dia melakukannya dalam dua belas rakaat, orang ramai akan beranggapan bahawa dia telah meringankannya.\""
  },
  {
    "id": 34432,
    "hadith_number": 254,
    "tajuk_hadith": "Berbuka Puasa Segera Selepas Selesai Solat di Bulan Ramadan",
    "perawi_melayu": "Abdullah ibn Abi Bakr (daripada bapanya)",
    "english_text": "Yahya related to me from Malik that Abdullah ibn Abi Bakr said,\n\"I heard my father say, 'We finished praying in Ramadan and the\nservants hurried with the food, fearing the approach of dawn.' \"",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، قَالَ سَمِعْتُ أَبِي يَقُولُ، كُنَّا نَنْصَرِفُ فِي رَمَضَانَ فَنَسْتَعْجِلُ الْخَدَمَ بِالطَّعَامِ مَخَافَةَ الْفَجْرِ ‏.‏",
    "malay_translation": "Yahya meriwayatkan kepada saya daripada Malik bahawa Abdullah ibn Abi Bakr berkata, \"Saya mendengar bapa saya berkata, 'Kami selesai solat pada bulan Ramadan dan para pelayan segera menyediakan makanan, kerana bimbang terbit fajar.'\""
  },
  {
    "id": 34433,
    "hadith_number": 255,
    "tajuk_hadith": "Dhakwan Membaca al-Quran Dalam Solat Tarawih Untuk A'ishah (R.A)",
    "perawi_melayu": "Malik meriwayatkan dari Hisham ibn Urwa dari bapanya.",
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that Dhakwan Abu Amr (a slave belonging to A'isha, the wife of\nthe Prophet, may Allah bless him and grant him peace, who was freed by\nher after her death) used to stand in prayer and recite for her in\nRamadan.",
    "arabic_text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ ذَكْوَانَ أَبَا عَمْرٍو، - وَكَانَ عَبْدًا لِعَائِشَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم فَأَعْتَقَتْهُ عَنْ دُبُرٍ مِنْهَا - كَانَ يَقُومُ يَقْرَأُ لَهَا فِي رَمَضَانَ ‏.‏",
    "malay_translation": "Yahya meriwayatkan daripada Malik, daripada Hisham bin Urwa, daripada bapanya, bahawa Dhakwan Abu Amr (seorang hamba kepada A'ishah, isteri Nabi ﷺ, yang dimerdekakan olehnya selepas kematiannya) biasa berdiri dalam solat dan membacakan al-Quran untuknya pada bulan Ramadan."
  }
]
