[
  {
    "id": 35770,
    "hadith_number": 1592,
    "tajuk_hadith": "Status Mukatab (Hamba yang Mempunyai Perjanjian Pembebasan)",
    "perawi_melayu": "Malik daripada Nafi', daripada Abdullah bin Umar",
    "english_text": "Malik related to me from Nafi that Abdullah ibn Umar said, \"A\nmukatab is a slave as long as any of his kitaba remains to be paid.\"",
    "arabic_text": "حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ الْمُكَاتَبُ عَبْدٌ مَا بَقِيَ عَلَيْهِ مِنْ كِتَابَتِهِ شَىْءٌ ‏.‏",
    "malay_translation": "Malik meriwayatkan daripada Nafi' bahawa Abdullah bin Umar berkata, \"Mukatab itu masih dianggap sebagai hamba selagi mana dia masih belum melunaskan sepenuhnya bayaran pembebasannya.\""
  },
  {
    "id": 35771,
    "hadith_number": 1593,
    "tajuk_hadith": "Status Mukatab dan Pewarisannya",
    "perawi_melayu": "Malik",
    "english_text": "Malik related to me that he had heard that Urwa ibn az-Zubayr and\nSulayman ibn Yasar said, \"The mukatab is a slave as long as any of his\nkitaba remains to be paid.\"\n\n\nMalik said, \"This is my opinion\nas well.\"\n\n\nMalik said, \"If a mukatab dies and leaves more\nproperty than what remains to be paid of his kitaba and he has\nchildren who were born during the time of his kitaba or whose kitaba\nhas been written as well, they inherit any property that remains after\nthe kitaba has been paid.\"",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ، وَسُلَيْمَانَ بْنَ يَسَارٍ، كَانَا يَقُولاَنِ الْمُكَاتَبُ عَبْدٌ مَا بَقِيَ عَلَيْهِ مِنْ كِتَابَتِهِ شَىْءٌ ‏.‏ قَالَ مَالِكٌ وَهُو رَأْيِي ‏.‏ قَالَ مَالِكٌ فَإِنْ هَلَكَ الْمُكَاتَبُ وَتَرَكَ مَالاً أَكْثَرَ مِمَّا بَقِيَ عَلَيْهِ مِنْ كِتَابَتِهِ وَلَهُ وَلَدٌ وُلِدُوا فِي كِتَابَتِهِ أَوْ كَاتَبَ عَلَيْهِمْ وَرِثُوا مَا بَقِيَ مِنَ الْمَالِ بَعْدَ قَضَاءِ كِتَابَتِهِ ‏.‏",
    "malay_translation": "Malik telah meriwayatkan kepadaku bahawa baginda telah mendengar bahawa Urwa ibn az-Zubayr dan Sulaiman ibn Yasar berkata, \"Mukatab adalah hamba selagi mana masih ada baki hutang kitabahnya.\" \n\nMalik berkata, \"Ini juga pendapatku.\" \n\nMalik berkata, \"Jika seorang mukatab meninggal dunia dan meninggalkan harta yang lebih banyak daripada baki hutang kitabahnya, dan dia mempunyai anak-anak yang dilahirkan semasa tempoh kitabahnya atau yang telah diikat kontrak kitabahnya juga, maka mereka berhak mewarisi harta yang tinggal selepas hutang kitabah tersebut dijelaskan.\""
  },
  {
    "id": 35772,
    "hadith_number": 1594,
    "tajuk_hadith": "Hukum Mukatab dan Pembahagian Harta",
    "perawi_melayu": "Malik melalui Humayd ibn Qays al-Makki",
    "english_text": "",
    "arabic_text": "وَحَدَّثَنِي مَالِكٌ، عَنْ حُمَيْدِ بْنِ قَيْسٍ الْمَكِّيِّ، أَنَّ مُكَاتَبًا، كَانَ لاِبْنِ الْمُتَوَكِّلِ هَلَكَ بِمَكَّةَ وَتَرَكَ عَلَيْهِ بَقِيَّةً مِنْ كِتَابَتِهِ وَدُيُونًا لِلنَّاسِ وَتَرَكَ ابْنَتَهُ فَأَشْكَلَ عَلَى عَامِلِ مَكَّةَ الْقَضَاءُ فِيهِ فَكَتَبَ إِلَى عَبْدِ الْمَلِكِ بْنِ مَرْوَانَ يَسْأَلُهُ عَنْ ذَلِكَ فَكَتَبَ إِلَيْهِ عَبْدُ الْمَلِكِ أَنِ ابْدَأْ بِدُيُونِ النَّاسِ ثُمَّ اقْضِ مَا بَقِيَ مِنْ كِتَابَتِهِ ثُمَّ اقْسِمْ مَا بَقِيَ مِنْ مَالِهِ بَيْنَ ابْنَتِهِ وَمَوْلاَهُ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا أَنَّهُ لَيْسَ عَلَى سَيِّدِ الْعَبْدِ أَنْ يُكَاتِبَهُ إِذَا سَأَلَهُ ذَلِكَ وَلَمْ أَسْمَعْ أَنَّ أَحَدًا مِنَ الأَئِمَّةِ أَكْرَهَ رَجُلاً عَلَى أَنْ يُكَاتِبَ عَبْدَهُ وَقَدْ سَمِعْتُ بَعْضَ أَهْلِ الْعِلْمِ إِذَا سُئِلَ عَنْ ذَلِكَ فَقِيلَ لَهُ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقُولُ ‏{‏فَكَاتِبُوهُمْ إِنْ عَلِمْتُمْ فِيهِمْ خَيْرًا‏}‏ ‏.‏ يَتْلُو هَاتَيْنِ الآيَتَيْنِ ‏{‏وَإِذَا حَلَلْتُمْ فَاصْطَادُوا‏}‏ ‏.‏ ‏{‏فَإِذَا قُضِيَتِ الصَّلاَةُ فَانْتَشِرُوا فِي الأَرْضِ وَابْتَغُوا مِنْ فَضْلِ اللَّهِ‏}‏ ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا ذَلِكَ أَمْرٌ أَذِنَ اللَّهُ عَزَّ وَجَلَّ فِيهِ لِلنَّاسِ وَلَيْسَ بِوَاجِبٍ عَلَيْهِمْ ‏.‏ قَالَ مَالِكٌ وَسَمِعْتُ بَعْضَ أَهْلِ الْعِلْمِ يَقُولُ فِي قَوْلِ اللَّهِ تَبَارَكَ وَتَعَالَى ‏{‏وَآتُوهُمْ مِنْ مَالِ اللَّهِ الَّذِي آتَاكُمْ‏}‏ ‏.‏ إِنَّ ذَلِكَ أَنْ يُكَاتِبَ الرَّجُلُ غُلاَمَهُ ثُمَّ يَضَعُ عَنْهُ مِنْ آخِرِ كِتَابَتِهِ شَيْئًا مُسَمًّى ‏.‏ قَالَ مَالِكٌ فَهَذَا الَّذِي سَمِعْتُ مِنْ أَهْلِ الْعِلْمِ وَأَدْرَكْتُ عَمَلَ النَّاسِ عَلَى ذَلِكَ عِنْدَنَا ‏.‏ \n قَالَ مَالِكٌ وَقَدْ بَلَغَنِي أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَاتَبَ غُلاَمًا لَهُ عَلَى خَمْسَةٍ وَثَلاَثِينَ أَلْفَ دِرْهَمٍ ثُمَّ وَضَعَ عَنْهُ مِنْ آخِرِ كِتَابَتِهِ خَمْسَةَ آلاَفِ دِرْهَمٍ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا أَنَّ الْمُكَاتَبَ إِذَا كَاتَبَهُ سَيِّدُهُ تَبِعَهُ مَالُهُ وَلَمْ يَتْبَعْهُ وَلَدُهُ إِلاَّ أَنْ يَشْتَرِطَهُمْ فِي كِتَابَتِهِ ‏.‏ قَالَ يَحْيَى سَمِعْتُ مَالِكًا يَقُولُ فِي الْمُكَاتَبِ يُكَاتِبُهُ سَيِّدُهُ وَلَهُ جَارِيَةٌ بِهَا حَبَلٌ مِنْهُ لَمْ يَعْلَمْ بِهِ هُوَ وَلاَ سَيِّدُهُ يَوْمَ كِتَابَتِهِ فَإِنَّهُ لاَ يَتْبَعُهُ ذَلِكَ الْوَلَدُ لأَنَّهُ لَمْ يَكُنْ دَخَلَ فِي كِتَابَتِهِ وَهُوَ لِسَيِّدِهِ فَأَمَّا الْجَارِيَةُ فَإِنَّهَا لِلْمُكَاتَبِ لأَنَّهَا مِنْ مَالِهِ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ وَرِثَ مُكَاتَبًا مِنِ امْرَأَتِهِ هُوَ وَابْنُهَا إِنَّ الْمُكَاتَبَ إِنْ مَاتَ قَبْلَ أَنْ يَقْضِيَ كِتَابَتَهُ اقْتَسَمَا مِيرَاثَهُ عَلَى كِتَابِ اللَّهِ وَإِنْ أَدَّى كِتَابَتَهُ ثُمَّ مَاتَ فَمِيرَاثُهُ لاِبْنِ الْمَرْأَةِ وَلَيْسَ لِلزَّوْجِ مِنْ مِيرَاثِهِ شَىْءٌ ‏.‏ قَالَ مَالِكٌ فِي الْمُكَاتَبِ يُكَاتِبُ عَبْدَهُ قَالَ يُنْظَرُ فِي ذَلِكَ فَإِنْ كَانَ إِنَّمَا أَرَادَ الْمُحَابَاةَ لِعَبْدِهِ وَعُرِفَ ذَلِكَ مِنْهُ بِالتَّخْفِيفِ عَنْهُ فَلاَ يَجُوزُ ذَلِكَ وَإِنْ كَانَ إِنَّمَا كَاتَبَهُ عَلَى وَجْهِ الرَّغْبَةِ وَطَلَبِ الْمَالِ وَابْتِغَاءِ الْفَضْلِ وَالْعَوْنِ عَلَى كِتَابَتِهِ فَذَلِكَ جَائِزٌ لَهُ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ وَطِئَ مُكَاتَبَةً لَهُ إِنَّهَا إِنْ حَمَلَتْ فَهِيَ بِالْخِيَارِ إِنْ شَاءَتْ كَانَتْ أُمَّ وَلَدٍ وَإِنْ شَاءَتْ قَرَّتْ عَلَى كِتَابَتِهَا فَإِنْ لَمْ تَحْمِلْ فَهِيَ عَلَى كِتَابَتِهَا ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا فِي الَعَبْدِ يَكُونُ بَيْنَ الرَّجُلَيْنِ إِنَّ أَحَدَهُمَا لاَ يُكَاتِبُ نَصِيبَهُ مِنْهُ أَذِنَ لَهُ بِذَلِكَ صَاحِبُهُ أَوْ لَمْ يَأْذَنْ إِلاَّ أَنْ يُكَاتِبَاهُ جَمِيعًا لأَنَّ ذَلِكَ يَعْقِدُ لَهُ عِتْقًا وَيَصِيرُ إِذَا أَدَّى الْعَبْدُ مَا كُوتِبَ عَلَيْهِ إِلَى أَنْ يَعْتِقَ نِصْفُهُ وَلاَ يَكُونُ عَلَى الَّذِي كَاتَبَ بَعْضَهُ أَنْ يَسْتَتِمَّ عِتْقَهُ فَذَلِكَ خِلاَفُ مَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَعْتَقَ شِرْكًا لَهُ فِي عَبْدٍ قُوِّمَ عَلَيْهِ قِيمَةَ الْعَدْلِ ‏\"‏ ‏.‏ قَالَ مَالِكٌ فَإِنْ جَهِلَ ذَلِكَ حَتَّى يُؤَدِّيَ الْمُكَاتَبُ أَوْ قَبْلَ أَنْ يُؤَدِّيَ رَدَّ إِلَيْهِ الَّذِي كَاتَبَهُ مَا قَبَضَ مِنَ الْمُكَاتَبِ فَاقْتَسَمَهُ هُوَ وَشَرِيكُهُ عَلَى قَدْرِ حِصَصِهِمَا وَبَطَلَتْ كِتَابَتُهُ وَكَانَ عَبْدًا لَهُمَا عَلَى حَالِهِ الأُولَى ‏.‏ قَالَ مَالِكٌ فِي مُكَاتَبٍ بَيْنَ رَجُلَيْنِ فَأَنْظَرَهُ أَحَدُهُمَا بِحَقِّهِ الَّذِي عَلَيْهِ وَأَبَى الآخَرُ أَنْ يُنْظِرَهُ فَاقْتَضَى الَّذِي أَبَى أَنْ يُنْظِرَهُ بَعْضَ حَقِّهِ ثُمَّ مَاتَ الْمُكَاتَبُ وَتَرَكَ مَالاً لَيْسَ فِيهِ وَفَاءٌ مِنْ كِتَابَتِهِ قَالَ مَالِكٌ يَتَحَاصَّانِ بِقَدْرِ مَا بَقِيَ لَهُمَا عَلَيْهِ يَأْخُذُ كُلُّ وَاحِدٍ مِنْهُمَا بِقَدْرِ حِصَّتِهِ فَإِنْ تَرَكَ الْمُكَاتَبُ فَضْلاً عَنْ كِتَابَتِهِ أَخَذَ كُلُّ وَاحِدٍ مِنْهُمَا مَا بَقِيَ مِنَ الْكِتَابَةِ وَكَانَ مَا بَقِيَ بَيْنَهُمَا بِالسَّوَاءِ فَإِنْ عَجَزَ الْمُكَاتَبُ وَقَدِ اقْتَضَى الَّذِي لَمْ يُنْظِرْهُ أَكْثَرَ مِمَّا اقْتَضَى صَاحِبُهُ كَانَ الْعَبْدُ بَيْنَهُمَا نِصْفَيْنِ وَلاَ يَرُدُّ عَلَى صَاحِبِهِ فَضْلَ مَا اقْتَضَى لأَنَّهُ إِنَّمَا اقْتَضَى الَّذِي لَهُ بِإِذْنِ صَاحِبِهِ وَإِنْ وَضَعَ عَنْهُ أَحَدُهُمَا الَّذِي لَهُ ثُمَّ اقْتَضَى صَاحِبُهُ بَعْضَ الَّذِي لَهُ عَلَيْهِ ثُمَّ عَجَزَ فَهُوَ بَيْنَهُمَا وَلاَ يَرُدُّ الَّذِي اقْتَضَى عَلَى صَاحِبِهِ شَيْئًا لأَنَّهُ إِنَّمَا اقْتَضَى الَّذِي لَهُ عَلَيْهِ وَذَلِكَ بِمَنْزِلَةِ الدَّيْنِ لِلرَّجُلَيْنِ بِكِتَابٍ وَاحِدٍ عَلَى رَجُلٍ وَاحِدٍ فَيُنْظِرُهُ أَحَدُهُمَا وَيَشِحُّ الآخَرُ فَيَقْتَضِي بَعْضَ حَقِّهِ ثُمَّ يُفْلِسُ الْغَرِيمُ فَلَيْسَ عَلَى الَّذِي اقْتَضَى أَنْ يَرُدَّ شَيْئًا مِمَّا أَخَذَ ‏.",
    "malay_translation": "Malik meriwayatkan daripada Humayd bin Qays al-Makki bahawa seorang mukātab milik anak lelaki al-Mutawakkil meninggal dunia di Mekah.  Mukātab tersebut meninggalkan baki hutang pembebasan dirinya (kitāb), hutang kepada orang ramai, dan seorang anak perempuan.  Pengurus Mekah mengalami kesukaran dalam membuat keputusan, lalu beliau menulis surat kepada Abd al-Malik bin Marwan untuk meminta pandangan. Abd al-Malik membalas, \" Mulakan dengan membayar hutang kepada orang ramai, kemudian bayar baki hutang pembebasan diri (kitāb)nya.  Selepas itu, bahagikan baki hartanya di antara anak perempuannya dan tuannya.\" \n\nMalik berkata, \"Amalan kita ialah tuan hamba tidak wajib membebaskan hambanya melalui kitāb sekiranya hamba itu meminta pembebasan.  Saya tidak pernah mendengar mana-mana Imam memaksa seseorang untuk membebaskan hambanya melalui kitāb.  Saya pernah mendengar sebahagian ulama, apabila ditanya mengenai perkara ini dan disebutkan firman Allah SWT yang bermaksud, 'Maka bebaskanlah mereka jika kamu mengetahui kebaikan pada diri mereka,' (Surah 24, ayat 33) membacakan dua ayat ini, 'Apabila kamu telah selesai dari ibadah haji, maka berburu (hewan buruan)lah.' (Surah 5, ayat 3)  'Maka apabila telah selesai sembahyang, berserakkanlah kamu di muka bumi dan carilah kurnia Allah.' (Surah 62, ayat 10)\n\nMalik berkata, \"Ini hanyalah satu amalan yang Allah SWT telah membenarkan, dan ia bukan satu kewajipan.\" Malik berkata, \"Saya pernah mendengar sebahagian ulama berkata mengenai firman Allah SWT yang bermaksud, 'Berilah mereka daripada harta yang Allah telah berikan kepadamu,' (maksudnya) seseorang itu membebaskan hambanya melalui kitāb, kemudian mengurangkan baki hutang pembebasan dirinya.\" \n\nMalik berkata, \"Inilah yang saya dengar daripada ulama dan yang saya lihat diamalkan di sini.\" \n\nMalik berkata, \"Saya pernah mendengar bahawa Abdullah bin Umar membebaskan hambanya melalui kitāb dengan bayaran 35,000 dirham, kemudian mengurangkan baki hutang pembebasan dirinya sebanyak 5,000 dirham.\" \n\nMalik berkata, \"Amalan kita ialah apabila tuan membebaskan mukātab melalui kitāb, harta mukātab itu akan menjadi miliknya, tetapi anak-anaknya tidak akan mengikutinya kecuali jika dinyatakan dalam kitāb tersebut.\" \n\nYahya berkata, \"Saya mendengar Malik berkata, sekiranya mukātab yang telah dibebaskan oleh tuannya mempunyai seorang hamba perempuan yang mengandung anaknya, dan keadaan itu tidak diketahui olehnya mahupun tuannya pada hari pembebasan, maka anak tersebut tetap menjadi milik tuannya kerana tidak termasuk dalam kitāb.  Adapun hamba perempuan itu, ia menjadi milik mukātab kerana ia merupakan sebahagian daripada hartanya.\" \n\nMalik berkata, sekiranya seorang lelaki dan anak lelakinya daripada isterinya (daripada suami yang lain) mewarisi seorang mukātab daripada isteri tersebut, dan mukātab itu meninggal dunia sebelum melunaskan hutang pembebasan dirinya, maka mereka berdua akan membahagikan harta pusaka mukātab itu mengikut hukum Allah SWT. Sekiranya hamba itu telah melunaskan hutang pembebasan dirinya, kemudian meninggal dunia, maka hartanya akan menjadi milik anak perempuan tersebut, dan suaminya tidak akan mendapat apa-apa daripada hartanya. \n\nMalik berkata, sekiranya seorang mukātab membebaskan hambanya sendiri melalui kitāb, maka perkara ini perlu dipertimbangkan. Sekiranya dia berbuat demikian semata-mata kerana ingin berbuat baik kepada hambanya dan perbuatan itu dapat dilihat dengan jelas melalui kemudahan yang diberikan, maka ia tidak dibenarkan.  Tetapi jika dia membebaskan hambanya itu kerana ingin mendapatkan wang untuk membayar hutang pembebasan dirinya sendiri, maka ia dibenarkan. \n\nMalik berkata, sekiranya seorang lelaki melakukan hubungan seks dengan seorang mukātaba miliknya dan mukātaba tersebut mengandung anaknya, maka mukātaba itu mempunyai pilihan. Sekiranya dia mahu, dia boleh menjadi umm walad (hamba perempuan yang melahirkan anak bagi tuannya). Sekiranya dia mahu, dia boleh meneruskan tempoh hutang pembebasannya.  Sekiranya dia tidak mengandung, dia masih mempunyai hak untuk meneruskan tempoh hutang pembebasannya. \n\nMalik berkata, \"Amalan yang lazim dalam kalangan kita mengenai hamba yang dimiliki bersama oleh dua orang lelaki ialah salah seorang daripada mereka tidak boleh membebaskan bahagiannya, sama ada rakannya membenarkan atau tidak, melainkan jika mereka berdua menulis kitāb tersebut bersama-sama, kerana hanya dengan cara itu sahaja ia mengikat pembebasan.  Sekiranya hamba itu melunaskan hutang pembebasan dirinya sehingga separuh, dan pihak yang membebaskannya tidak wajib untuk melunaskan sepenuhnya pembebasannya, maka ia bercanggah dengan sabda Rasulullah SAW: 'Barangsiapa membebaskan sebahagian daripada hambanya dan mempunyai wang yang mencukupi untuk membayar keseluruhan harga hamba itu dengan harga yang adil, maka hendaklah dia membayar bahagian kepada rakan kongsinya supaya hamba itu dibebaskan sepenuhnya.' \n\nMalik berkata, \"Sekiranya perkara ini tidak diketahui sehingga mukātab itu melunaskan hutang pembebasannya atau sebelum dia melunaskan, maka pihak yang telah menulis kitāb itu hendaklah mengembalikan apa yang telah diterimanya daripada mukātab itu. Kemudian, dia dan rakannya akan membahagikan hamba itu mengikut bahagian asal masing-masing dan kitāb itu terbatal. Hamba itu kembali menjadi hamba mereka berdua seperti sedia kala.\" \n\nMalik membincangkan tentang seorang mukātab yang dimiliki bersama oleh dua orang lelaki, dan salah seorang daripada mereka memberi tempoh kepada mukātab itu untuk membayar hutang pembebasannya, manakala yang seorang lagi enggan memberi tempoh.  Maka, pihak yang enggan memberi tempoh itu menuntut bahagian hutangnya. Malik berkata, sekiranya mukātab itu meninggal dunia dan meninggalkan harta yang tidak mencukupi untuk melunaskan hutang pembebasannya, maka \"Mereka berdua akan membahagikan harta itu mengikut baki hutang mukātab itu.  Setiap orang akan mengambil mengikut bahagiannya. Sekiranya mukātab itu meninggalkan harta yang melebihi hutang pembebasannya, maka setiap orang akan mengambil baki hutang pembebasan dirinya, dan baki harta akan dibahagikan sama rata di antara mereka.  Sekiranya mukātab itu tidak mampu membayar sepenuhnya hutang pembebasannya dan pihak yang enggan memberi tempoh itu menuntut lebih daripada rakannya, maka hamba itu tetap akan dibahagikan sama rata di antara mereka, dan dia tidak perlu mengembalikan lebihan yang telah dituntutnya, kerana dia hanya menuntut haknya dengan kebenaran rakannya.  Sekiranya salah seorang daripada mereka melepaskan haknya, kemudian rakannya menuntut bahagian hutangnya dan mukātab itu tidak mampu membayar, maka hamba itu menjadi milik mereka berdua.  Dan pihak yang telah menuntut tidak perlu mengembalikan apa-apa kerana dia hanya menuntut haknya.  Ini sama seperti hutang dua orang lelaki yang ditulis dalam satu dokumen terhadap seorang lelaki.  Salah seorang daripada mereka memberi tempoh, manakala yang seorang lagi tamak dan menuntut hutangnya.  Kemudian, penghutang itu muflis.  Pihak yang telah menuntut hutangnya tidak perlu mengembalikan apa yang telah diambilnya."
  },
  {
    "id": 35773,
    "hadith_number": 1595,
    "tajuk_hadith": "Hukum Kitaba Hamba",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Malik berkata, \"Amalan yang lazim di kalangan kami ialah apabila hamba-hamba menulis kitabah mereka bersama-sama dalam satu kitabah, dan sebahagian daripada mereka bertanggungjawab ke atas yang lain, dan mereka tidak dikurangkan apa-apa dengan kematian salah seorang yang bertanggungjawab, kemudian salah seorang daripada mereka berkata, 'Saya tidak mampu', dan menyerah, rakan-rakannya boleh menggunakannya dalam apa sahaja kerja yang mampu dilakukannya dan mereka saling membantu dalam kitabah mereka sehingga mereka dibebaskan, jika mereka dibebaskan, atau kekal sebagai hamba jika mereka kekal sebagai hamba.\"\n\n\nMalik berkata, \"Amalan yang lazim di kalangan kami ialah apabila seorang tuan memberi hambanya kitabah, tuan itu tidak dibenarkan membiarkan sesiapa mengambil alih tanggungjawab kitabah hambanya jika hamba itu mati atau tidak berupaya. Ini bukan sebahagian daripada sunnah orang Islam. Ini kerana apabila seseorang mengambil tanggungjawab kepada tuan seorang mukatab bagi apa yang terhutang oleh mukatab daripada kitabahnya, kemudian tuan mukatab menuntut daripada orang yang mengambil tanggungjawab itu, dia mengambil wang itu secara salah. Ia bukan seolah-olah dia membeli mukatab, supaya apa yang diberikannya adalah sebahagian daripada harga sesuatu yang menjadi miliknya, dan mukatab juga tidak dibebaskan supaya harga yang ditetapkan baginya membeli kebebasannya sebagai orang merdeka. Jika mukatab tidak mampu memenuhi pembayaran, dia kembali kepada tuannya dan menjadi hambanya. Ini kerana kitabah bukanlah hutang tetap yang boleh diambil alih oleh tuan mukatab. Ia adalah sesuatu yang, apabila dibayar oleh mukatab, membebaskannya. Jika mukatab mati dan mempunyai hutang, tuannya bukanlah salah seorang daripada pemiutang bagi apa yang masih belum dibayar daripada kitabah. Pemiutang mendahului tuan. Jika mukatab tidak dapat memenuhi pembayaran, dan dia berhutang kepada orang ramai, dia kembali menjadi hamba milik tuannya dan hutang kepada orang ramai adalah liabiliti mukatab. Pemiutang tidak berkongsi dengan tuan dalam apa-apa bahagian daripada harga dirinya.\"\n\n\nMalik berkata, \"Apabila orang ramai ditulis bersama-sama dalam satu kitabah dan tiada hubungan kekeluargaan di antara mereka yang dengannya mereka mewarisi antara satu sama lain, dan sebahagian daripada mereka bertanggungjawab ke atas yang lain, maka tiada seorang pun daripada mereka dibebaskan sebelum yang lain sehingga semua kitabah telah dibayar. Jika salah seorang daripada mereka mati dan meninggalkan harta dan ia lebih daripada semua yang menentang mereka, ia membayar semua yang menentang mereka. Lebihan harta itu pergi kepada tuan, dan tiada seorang pun daripada mereka yang telah ditulis dalam kitabah bersama si mati mendapat sebahagian daripada lebihan itu. Tuntutan tuan diatasi oleh tuntutan mereka untuk bahagian-bahagian yang masih menentang mereka daripada kitabah yang boleh dipenuhi daripada harta si mati, kerana si mati telah mengambil tanggungjawab mereka dan mereka mesti menggunakan hartanya untuk membayar kebebasan mereka. Jika mukatab yang mati mempunyai anak yang merdeka yang tidak dilahirkan dalam kitabah dan yang tidak ditulis dalam kitabah, ia tidak mewarisi darinya kerana mukatab tidak dibebaskan sehingga dia mati.\""
  },
  {
    "id": 35774,
    "hadith_number": 1596,
    "tajuk_hadith": "Pembebasan Hamba Mukatab: Perjanjian dan Pembahagian Harta",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ أُمَّ سَلَمَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَانَتْ تُقَاطِعُ مُكَاتَبِيهَا بِالذَّهَبِ وَالْوَرِقِ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا فِي الْمَكَاتَبِ يَكُونُ بَيْنَ الشَّرِيكَيْنِ فَإِنَّهُ لاَ يَجُوزُ لأَحَدِهِمَا أَنْ يُقَاطِعَهُ عَلَى حِصَّتِهِ إِلاَّ بِإِذْنِ شَرِيكِهِ وَذَلِكَ أَنَّ الْعَبْدَ وَمَالَهُ بَيْنَهُمَا فَلاَ يَجُوزُ لأَحَدِهِمَا أَنْ يَأْخُذَ شَيْئًا مِنْ مَالِهِ إِلاَّ بِإِذْنِ شَرِيكِهِ وَلَوْ قَاطَعَهُ أَحَدُهُمَا دُونَ صَاحِبِهِ ثُمَّ حَازَ ذَلِكَ ثُمَّ مَاتَ الْمُكَاتَبُ وَلَهُ مَالٌ أَوْ عَجَزَ لَمْ يَكُنْ لِمَنْ قَاطَعَهُ شَىْءٌ مِنْ مَالِهِ وَلَمْ يَكُنْ لَهُ أَنْ يَرُدَّ مَا قَاطَعَهُ عَلَيْهِ وَيَرْجِعَ حَقُّهُ فِي رَقَبَتِهِ وَلَكِنْ مَنْ قَاطَعَ مُكَاتَبًا بِإِذْنِ شَرِيكِهِ ثُمَّ عَجَزَ الْمُكَاتَبُ فَإِنْ أَحَبَّ الَّذِي قَاطَعَهُ أَنْ يَرُدَّ الَّذِي أَخَذَ مِنْهُ مِنَ الْقَطَاعَةِ وَيَكُونُ عَلَى نَصِيبِهِ مِنْ رَقَبَةِ الْمُكَاتَبِ كَانَ ذَلِكَ لَهُ وَإِنْ مَاتَ الْمُكَاتَبُ وَتَرَكَ مَالاً اسْتَوْفَى الَّذِي بَقِيَتْ لَهُ الْكِتَابَةُ حَقَّهُ الَّذِي بَقِيَ لَهُ عَلَى الْمُكَاتَبِ مِنْ مَالِهِ ثُمَّ كَانَ مَا بَقِيَ مِنْ مَالِ الْمُكَاتَبِ بَيْنَ الَّذِي قَاطَعَهُ وَبَيْنَ شَرِيكِهِ عَلَى قَدْرِ حِصَصِهِمَا فِي الْمُكَاتَبِ وَإِنْ كَانَ أَحَدُهُمَا قَاطَعَهُ وَتَمَاسَكَ صَاحِبُهُ بِالْكِتَابَةِ ثُمَّ عَجَزَ الْمُكَاتَبُ قِيلَ لِلَّذِي قَاطَعَهُ إِنْ شِئْتَ أَنْ تَرُدَّ عَلَى صَاحِبِكَ نِصْفَ الَّذِي أَخَذْتَ وَيَكُونُ الْعَبْدُ بَيْنَكُمَا شَطْرَيْنِ وَإِنْ أَبَيْتَ فَجَمِيعُ الْعَبْدِ لِلَّذِي تَمَسَّكَ بِالرِّقِّ خَالِصًا ‏.‏ قَالَ مَالِكٌ فِي الْمُكَاتَبِ يَكُونُ بَيْنَ الرَّجُلَيْنِ فَيُقَاطِعُهُ أَحَدُهُمَا بِإِذْنِ صَاحِبِهِ ثُمَّ يَقْتَضِي الَّذِي تَمَسَّكَ بِالرِّقِّ مِثْلَ مَا قَاطَعَ عَلَيْهِ صَاحِبُهُ أَوْ أَكْثَرَ مِنْ ذَلِكَ ثُمَّ يَعْجِزُ الْمُكَاتَبُ ‏.‏ قَالَ مَالِكٌ فَهُوَ بَيْنَهُمَا لأَنَّهُ إِنَّمَا اقْتَضَى الَّذِي لَهُ عَلَيْهِ وَإِنِ اقْتَضَى أَقَلَّ مِمَّا أَخَذَ الَّذِي قَاطَعَهُ ثُمَّ عَجَزَ الْمُكَاتَبُ فَأَحَبَّ الَّذِي قَاطَعَهُ أَنَّ يَرُدَّ عَلَى صَاحِبِهِ نِصْفَ مَا تَفَضَّلَهُ بِهِ وَيَكُونُ الْعَبْدُ بَيْنَهُمَا نِصْفَيْنِ فَذَلِكَ لَهُ وَإِنْ أَبَى فَجَمِيعُ الْعَبْدِ لِلَّذِي لَمْ يُقَاطِعْهُ وَإِنْ مَاتَ الْمُكَاتَبُ وَتَرَكَ مَالاً فَأَحَبَّ الَّذِي قَاطَعَهُ أَنْ يَرُدَّ عَلَى صَاحِبِهِ نِصْفَ مَا تَفَضَّلَهُ بِهِ وَيَكُونُ الْمِيرَاثُ بَيْنَهُمَا فَذَلِكَ لَهُ وَإِنْ كَانَ الَّذِي تَمَسَّكَ بِالْكِتَابَةِ قَدْ أَخَذَ مِثْلَ مَا قَاطَعَ عَلَيْهِ شَرِيكُهُ أَوْ أَفْضَلَ فَالْمِيرَاثُ بَيْنَهُمَا بِقَدْرِ مِلْكِهِمَا لأَنَّهُ إِنَّمَا أَخَذَ حَقَّهُ ‏.‏ قَالَ مَالِكٌ فِي الْمُكَاتَبِ يَكُونُ بَيْنَ الرَّجُلَيْنِ فَيُقَاطِعُ أَحَدُهُمَا عَلَى نِصْفِ حَقِّهُ بِإِذْنِ صَاحِبِهِ ثُمَّ يَقْبِضُ الَّذِي تَمَسَّكَ بِالرِّقِّ أَقَلَّ مِمَّا قَاطَعَ عَلَيْهِ صَاحِبُهُ ثُمَّ يَعْجِزُ الْمُكَاتَبُ ‏.‏ قَالَ مَالِكٌ إِنْ أَحَبَّ الَّذِي قَاطَعَ الْعَبْدَ أَنْ يَرُدَّ عَلَى صَاحِبِهِ نِصْفَ مَا تَفَضَّلَهُ بِهِ كَانَ الْعَبْدُ بَيْنَهُمَا شَطْرَيْنِ وَإِنْ أَبَى أَنْ يَرُدَّ فَلِلَّذِي تَمَسَّكَ بِالرِّقِّ حِصَّةُ صَاحِبِهِ الَّذِي كَانَ قَاطَعَ عَلَيْهِ الْمُكَاتَبَ ‏.‏ قَالَ مَالِكٌ وَتَفْسِيرُ ذَلِكَ أَنَّ الْعَبْدَ يَكُونُ بَيْنَهُمَا شَطْرَيْنِ فَيُكَاتِبَانِهِ جَمِيعًا ثُمَّ يُقَاطِعُ أَحَدُهُمَا الْمُكَاتَبَ عَلَى نِصْفِ حَقِّهِ بِإِذْنِ صَاحِبِهِ وَذَلِكَ الرُّبُعُ مِنْ جَمِيعِ الْعَبْدِ ثُمَّ يَعْجِزُ الْمُكَاتَبُ فَيُقَالُ لِلَّذِي قَاطَعَهُ إِنْ شِئْتَ فَارْدُدْ عَلَى صَاحِبِكَ نِصْفَ مَا فَضَلْتَهُ بِهِ وَيَكُونُ الْعَبْدُ بَيْنَكُمَا شَطْرَيْنِ ‏.‏ وَإِنْ أَبَى كَانَ لِلَّذِي تَمَسَّكَ بِالْكِتَابَةِ رُبُعُ صَاحِبِهِ الَّذِي قَاطَعَ الْمُكَاتَبَ عَلَيْهِ خَالِصًا وَكَانَ لَهُ نِصْفُ الْعَبْدِ فَذَلِكَ ثَلاَثَةُ أَرْبَاعِ الْعَبْدِ وَكَانَ لِلَّذِي قَاطَعَ رُبُعُ الْعَبْدِ لأَنَّهُ أَبَى أَنْ يَرُدَّ ثَمَنَ رُبُعِهِ الَّذِي قَاطَعَ عَلَيْهِ ‏.‏ قَالَ مَالِكٌ فِي الْمُكَاتَبِ يُقَاطِعُهُ سَيِّدُهُ فَيَعْتِقُ وَيَكْتُبُ عَلَيْهِ مَا بَقِيَ مِنْ قَطَاعَتِهِ دَيْنًا عَلَيْهِ ثُمَّ يَمُوتُ الْمُكَاتَبُ وَعَلَيْهِ دَيْنٌ لِلنَّاسِ ‏.‏ قَالَ مَالِكٌ فَإِنَّ سَيِّدَهُ لاَ يُحَاصُّ غُرَمَاءَهُ بِالَّذِي عَلَيْهِ مِنْ قَطَاعَتِهِ وَلِغُرَمَائِهِ أَنْ يُبَدَّءُوا عَلَيْهِ ‏.‏ قَالَ مَالِكٌ لَيْسَ لِلْمُكَاتَبِ أَنْ يُقَاطِعَ سَيِّدَهُ إِذَا كَانَ عَلَيْهِ دَيْنٌ لِلنَّاسِ فَيَعْتِقُ وَيَصِيرُ لاَ شَىْءَ لَهُ لأَنَّ أَهْلَ الدَّيْنِ أَحَقُّ بِمَالِهِ مِنْ سَيِّدِهِ فَلَيْسَ ذَلِكَ بِجَائِزٍ لَهُ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِي الرَّجُلِ يُكَاتِبُ عَبْدَهُ ثُمَّ يُقَاطِعُهُ بِالذَّهَبِ فَيَضَعُ عَنْهُ مِمَّا عَلَيْهِ مِنَ الْكِتَابَةِ عَلَى أَنْ يُعَجِّلَ لَهُ مَا قَاطَعَهُ عَلَيْهِ أَنَّهُ لَيْسَ بِذَلِكَ بَأْسٌ وَإِنَّمَا كَرِهَ ذَلِكَ مَنْ كَرِهَهُ لأَنَّهُ أَنْزَلَهُ بِمَنْزِلَةِ الدَّيْنِ يَكُونُ لِلرَّجُلِ عَلَى الرَّجُلِ إِلَى أَجَلٍ فَيَضَعُ عَنْهُ وَيَنْقُدُهُ وَلَيْسَ هَذَا مِثْلَ الدَّيْنِ إِنَّمَا كَانَتْ قَطَاعَةُ الْمُكَاتَبِ سَيِّدَهُ عَلَى أَنْ يُعْطِيَهُ مَالاً فِي أَنْ يَتَعَجَّلَ الْعِتْقَ فَيَجِبُ لَهُ الْمِيرَاثُ وَالشَّهَادَةُ وَالْحُدُودُ وَتَثْبُتُ لَهُ حُرْمَةُ الْعَتَاقَةِ وَلَمْ يَشْتَرِ دَرَاهِمَ بِدَرَاهِمَ وَلاَ ذَهَبًا بِذَهَبٍ وَإِنَّمَا مَثَلُ ذَلِكَ مَثَلُ رَجُلٍ قَالَ لِغُلاَمِهِ ائْتِنِي بِكَذَا وَكَذَا دِينَارًا وَأَنْتَ حُرٌّ فَوَضَعَ عَنْهُ مِنْ ذَلِكَ فَقَالَ إِنْ جِئْتَنِي بِأَقَلَّ مِنْ ذَلِكَ فَأَنْتَ حُرٌّ ‏.‏ فَلَيْسَ هَذَا دَيْنًا ثَابِتًا وَلَوْ كَانَ دَيْنًا ثَابِتًا لَحَاصَّ بِهِ السَّيِّدُ غُرَمَاءَ الْمُكَاتَبِ إِذَا مَاتَ أَوْ أَفْلَسَ فَدَخَلَ مَعَهُمْ فِي مَالِ مُكَاتَبِهِ ‏.‏",
    "malay_translation": "Malik meriwayatkan bahawa baginda telah diberitahu bahawa Umm Salamah, isteri Nabi SAW, telah mengadakan perjanjian pembebasan dengan hamba mukatabnya dengan menggunakan emas dan perak.\n\nMalik berkata, \"Perkara yang telah disepakati di kalangan kami mengenai mukatab yang dimiliki bersama oleh dua orang rakan kongsi ialah tidak dibenarkan bagi salah seorang daripada mereka untuk membuat perjanjian pembebasan dengan hamba itu bagi bahagiannya tanpa kebenaran rakan kongsinya. Ini kerana hamba dan hartanya adalah milik bersama mereka berdua, maka tidak dibenarkan bagi salah seorang daripada mereka untuk mengambil sesuatu daripada hartanya tanpa kebenaran rakan kongsinya. Sekiranya salah seorang daripada mereka membuat perjanjian pembebasan dengan hamba itu tanpa kebenaran rakan kongsinya, kemudian mengambil wang tersebut, dan kemudian hamba mukatab itu meninggal dunia dengan meninggalkan harta atau gagal membayar, maka orang yang membuat perjanjian pembebasan itu tidak akan mendapat apa-apa daripada harta hamba itu dan tidak boleh memulangkan wang yang telah diterimanya untuk mendapatkan kembali haknya ke atas hamba tersebut. Akan tetapi, sesiapa yang membuat perjanjian pembebasan dengan hamba mukatab dengan kebenaran rakan kongsinya, kemudian hamba mukatab itu gagal membayar, maka adalah lebih baik bagi orang yang membuat perjanjian pembebasan itu untuk memulangkan wang yang telah diterimanya daripada hamba mukatab sebagai bayaran pembebasan dan dia akan menerima bahagiannya daripada hamba mukatab. Dia boleh berbuat demikian. Sekiranya hamba mukatab itu meninggal dunia dan meninggalkan harta, maka orang yang masih memegang perjanjian akan menerima sepenuhnya haknya yang masih tertunggak daripada hamba mukatab daripada hartanya. Kemudian, baki harta hamba mukatab itu akan dibahagikan di antara orang yang membuat perjanjian pembebasan itu dan rakan kongsinya mengikut bahagian masing-masing dalam mukatab. Sekiranya salah seorang daripada mereka membuat perjanjian pembebasan dan rakan kongsinya masih memegang perjanjian, kemudian hamba mukatab itu gagal membayar, maka akan dikatakan kepada orang yang membuat perjanjian pembebasan itu: \"Jika kamu mahu memulangkan separuh daripada wang yang telah kamu terima kepada rakan kamu dan hamba itu akan dibahagikan kepada dua bahagian, maka berbuatlah demikian. Jika engkau enggan, maka seluruh hamba itu menjadi milik orang yang memegang perjanjian itu.\" \n\nMalik bercakap tentang seorang hamba mukatab yang dimiliki bersama oleh dua orang lelaki dan salah seorang daripada mereka membuat perjanjian pembebasan dengannya dengan kebenaran rakan kongsinya. Kemudian, orang yang masih memegang perjanjian itu menuntut jumlah yang sama atau lebih daripada jumlah yang telah dibayar oleh rakan kongsinya, dan hamba mukatab itu tidak mampu membayarnya. Malik berkata, \"Hamba mukatab itu akan dibahagikan di antara mereka berdua kerana orang itu hanya menuntut apa yang menjadi haknya. Sekiranya dia menuntut kurang daripada jumlah yang telah diterima oleh orang yang membuat perjanjian pembebasan itu dan hamba mukatab itu tidak mampu membayarnya, dan orang yang membuat perjanjian pembebasan itu mahu memulangkan separuh daripada wang yang telah diterimanya kepada rakan kongsinya supaya hamba itu dibahagikan kepada dua bahagian, maka dia boleh berbuat demikian. Jika dia enggan, maka seluruh hamba itu menjadi milik orang yang tidak membuat perjanjian pembebasan itu. Sekiranya hamba mukatab itu meninggal dunia dan meninggalkan harta, dan orang yang membuat perjanjian pembebasan itu mahu memulangkan separuh daripada wang yang telah diterimanya kepada rakan kongsinya supaya harta pusaka itu dibahagikan di antara mereka, maka dia boleh berbuat demikian. Sekiranya orang yang memegang perjanjian itu menerima jumlah yang sama atau lebih daripada jumlah yang telah dibayar oleh rakan kongsinya, maka harta pusaka itu akan dibahagikan di antara mereka mengikut bahagian masing-masing dalam hamba itu kerana dia hanya mengambil haknya.\"\n\nMalik bercakap tentang seorang hamba mukatab yang dimiliki bersama oleh dua orang lelaki dan salah seorang daripada mereka membuat perjanjian pembebasan dengannya untuk separuh daripada jumlah yang sepatutnya dibayar dengan kebenaran rakan kongsinya, kemudian orang yang masih memegang perjanjian itu menerima kurang daripada jumlah yang telah dibayar oleh rakan kongsinya dan hamba mukatab itu tidak mampu membayar. Malik berkata, \"Sekiranya orang yang membuat perjanjian pembebasan dengan hamba itu mahu memulangkan separuh daripada jumlah yang telah diterimanya kepada rakan kongsinya, maka hamba itu akan dibahagikan kepada dua bahagian. Jika dia enggan memulangkannya, maka orang yang masih memegang perjanjian itu akan mendapat bahagian yang sepatutnya dibayar oleh rakan kongsinya untuk pembebasan hamba mukatab itu.\"\n\nMalik berkata, \"Penjelasannya ialah hamba itu akan dibahagikan kepada dua bahagian. Mereka menulis perjanjian bersama-sama, kemudian salah seorang daripada mereka membuat perjanjian pembebasan dengan hamba mukatab itu untuk separuh daripada jumlah yang sepatutnya dibayar dengan kebenaran rakan kongsinya. Jumlah itu merupakan suku daripada keseluruhan nilai hamba itu. Kemudian, hamba mukatab itu tidak mampu membayar, maka akan dikatakan kepada orang yang membuat perjanjian pembebasan itu: \"Jika kamu mahu, pulangkan separuh daripada jumlah yang telah kamu terima kepada rakan kamu, dan hamba itu akan dibahagikan sama rata di antara kamu.\" Jika dia enggan, maka orang yang masih memegang perjanjian itu akan mendapat sepenuhnya suku daripada bahagian rakan kongsinya yang telah dibuat perjanjian pembebasan olehnya. Dia telah mendapat separuh daripada hamba itu, maka sekarang dia akan mendapat tiga suku daripada hamba itu. Orang yang telah membuat perjanjian pembebasan itu akan mendapat suku daripada hamba itu kerana dia enggan memulangkan jumlah yang sepatutnya dibayar untuk suku bahagian itu.\"\n\nMalik bercakap tentang seorang hamba mukatab yang tuannya telah membuat perjanjian pembebasan dengannya dan membebaskannya, dan baki jumlah pembebasan itu ditulis sebagai hutang ke atasnya, kemudian hamba mukatab itu meninggal dunia dan mempunyai hutang kepada orang lain. Malik berkata, \"Tuannya tidak akan berkongsi dengan pemiutang disebabkan apa yang masih tertunggak daripada jumlah pembebasan itu. Pemiutang akan dibayar terlebih dahulu.\"\n\nMalik berkata, \"Hamba mukatab tidak boleh membuat perjanjian pembebasan dengan tuannya jika dia mempunyai hutang kepada orang lain. Dia akan dibebaskan tanpa mendapat apa-apa kerana pemiutang lebih berhak ke atas hartanya daripada tuannya. Perkara ini tidak dibenarkan.\"\n\nMalik berkata, \"Menurut kebiasaan di kalangan kami, tidak mengapa jika seseorang memberikan perjanjian kepada hambanya dan membuat perjanjian pembebasan dengannya dengan menggunakan emas dan mengurangkan jumlah yang sepatutnya dibayar daripada perjanjian itu dengan syarat hanya wang emas dibayar dengan segera. Sesiapa yang tidak bersetuju dengan perkara ini, ia kerana dia menganggapnya sebagai hutang yang tertangguh bayarannya. Dia memberikan pengurangan dan wang tersebut dibayar dengan segera. Ini bukan seperti hutang tersebut. Perjanjian pembebasan hamba mukatab dengan tuannya adalah bergantung kepada pemberian wang untuk mempercepatkan pembebasan.  Hamba itu diwajibkan mewarisi, memberi keterangan dan hukuman hudud dikenakan ke atasnya dan pembebasannya adalah sah. Dia bukan membeli dirham dengan dirham atau emas dengan emas. Sebaliknya, ia seperti seseorang yang telah berkata kepada hambanya, ‘Bawalah sejumlah dinar dan kamu akan bebas,’ kemudian mengurangkan jumlah tersebut, dengan berkata, ‘Jika kamu membawa kurang daripada jumlah tersebut, kamu akan bebas.’ Ini bukanlah hutang yang tetap. Sekiranya ia adalah hutang yang tetap, maka tuannya akan berkongsi dengan pemiutang hamba mukatab itu sekiranya dia meninggal dunia atau muflis. Tuntutannya ke atas harta hamba mukatab akan digabungkan dengan tuntutan pemiutang.\""
  },
  {
    "id": 35775,
    "hadith_number": 1597,
    "tajuk_hadith": "Hukum Darah Wanita Mukātabah",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Malik berkata, \"Cara terbaik yang saya dengar mengenai seorang mukātab yang mencederakan seseorang sehingga diwajibkan membayar diyat (wang tebusan darah), ialah jika mukātab itu mampu membayar diyat kecederaan itu dengan kitabahnya, dia melakukannya, dan ia dikira terhadap kitabahnya. Jika dia tidak mampu berbuat demikian, dan dia tidak mampu membayar kitabahnya kerana dia mesti membayar diyat kecederaan itu sebelum kitabahnya, dan dia tidak mampu membayar diyat kecederaan itu, maka tuannya mempunyai pilihan. Jika dia lebih suka membayar diyat kecederaan itu, dia melakukannya dan mengekalkan hambanya dan hamba itu menjadi hamba kepunyaannya. Jika dia ingin menyerahkan hamba itu kepada yang cedera, dia menyerahkannya. Tuan tidak perlu melakukan lebih daripada menyerahkan hambanya.\" \n\n\nMalik bercakap tentang orang-orang yang berada dalam satu kitabah umum dan salah seorang daripada mereka menyebabkan kecederaan yang melibatkan diyat. Dia berkata, \"Jika mana-mana daripada mereka melakukan kecederaan yang melibatkan diyat, dia dan mereka yang bersamanya dalam kitabah itu diminta untuk membayar semua diyat kecederaan itu. Jika mereka membayar, mereka disahkan dalam kitabah mereka. Jika mereka tidak membayar, dan mereka tidak mampu, maka tuannya mempunyai pilihan. Jika dia mahu, dia boleh membayar semua diyat kecederaan itu dan semua hamba kembali kepadanya. Jika dia mahu, dia boleh menyerahkan hanya orang yang melakukan kecederaan itu sahaja dan yang lain semuanya kembali menjadi hambanya kerana mereka tidak dapat membayar diyat kecederaan yang dilakukan oleh rakan mereka.\"\n\n\nMalik berkata, \"Cara melakukan perkara-perkara yang tidak ada perselisihan di antara kita, ialah apabila seorang mukātab cedera dengan cara yang melibatkan diyat atau salah seorang daripada anak-anak mukātab yang tertulis bersamanya dalam kitabah cedera, diyat mereka ialah diyat hamba-hamba yang setaraf dengan nilai mereka, dan apa yang ditetapkan untuk mereka sebagai diyat mereka dibayar kepada tuan yang memiliki kitabah dan dia mengira itu untuk mukātab pada akhir kitabahnya dan ada pengurangan untuk diyat yang telah diambil oleh tuan untuk kecederaan itu.\"\n\n\nMalik berkata, \"Penjelasannya ialah, sebagai contoh, dia telah menulis kitabahnya untuk tiga ribu dirham dan diyat yang diambil oleh tuan untuk kecederaannya ialah seribu dirham. Apabila mukātab telah membayar dua ribu dirham kepada tuannya, dia bebas. Jika baki kitabahnya ialah seribu dirham dan diyat kecederaan itu ialah seribu dirham, dia bebas serta-merta. Jika diyat kecederaan itu lebih daripada baki kitabah, tuan mukātab mengambil baki kitabahnya dan membebaskannya. Baki selepas pembayaran kitabah adalah milik mukātab. Seseorang tidak boleh membayar mukātab apa-apa daripada diyat kecederaan itu sekiranya dia mungkin membelanjakannya dan menggunakannya. Jika dia tidak dapat membayar kitabahnya sepenuhnya, dia akan kembali kepada tuannya buta sebelah mata, dengan tangan terputus, atau cacat badan. Tuanya hanya menulis kitabahnya terhadap hartanya dan pendapatannya, dan dia tidak menulis kitabahnya supaya dia akan mengambil diyat untuk apa yang berlaku kepada anaknya atau kepada dirinya dan menggunakannya dan membelanjakannya. Seseorang membayar diyat kecederaan kepada mukātab dan anak-anaknya yang dilahirkan dalam kitabahnya, atau kitabahnya ditulis, kepada tuan dan dia mengambil kira untuknya pada akhir kitabahnya.\""
  },
  {
    "id": 35776,
    "hadith_number": 1598,
    "tajuk_hadith": "Hukum Jual Beli Kitabah Mukatab",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Malik berkata, \"Sebaik-baik perkataan tentang seseorang yang membeli kitabah seseorang ialah jika orang itu menulis kitabah hamba itu dengan dinar atau dirham, dia tidak menjualnya melainkan untuk barangan yang dibayar segera dan bukan ditangguh, kerana jika ditangguh, ia akan menjadi hutang atas hutang. Hutang atas hutang adalah haram.\" \n\nBeliau berkata, \"Jika tuan memberi mukatab kitabahnya untuk barangan tertentu seperti unta, lembu, biri-biri, atau hamba, lebih tepat jika pembeli membelinya dengan emas, perak, atau barangan lain selain daripada yang ditulis oleh tuannya dalam kitabah itu, dan itu mesti dibayar segera, bukan ditangguh.\" \n\nMalik berkata, \"Sebaik-baik yang aku dengar tentang mukatab apabila dia dijual ialah dia lebih berhak membeli kitabahnya daripada orang yang membelinya jika dia mampu membayar tuannya harga yang dia dijual dengan tunai. Itu kerana pembelian dirinya sendiri adalah kebebasannya, dan kebebasan lebih utama daripada wasiat yang menyertainya. Jika salah seorang yang telah menulis kitabah untuk mukatab menjual bahagiannya, supaya separuh, sepertiga, seperempat, atau apa sahaja bahagian mukatab itu dijual, mukatab tidak mempunyai hak pilihan dalam apa yang dijual darinya. Itu kerana ia seperti pemisahan rakan kongsi, dan rakan kongsi hanya boleh membuat penyelesaian untuk rakan kongsi orang yang bermuktab dengan izin rakan kongsi kerana apa yang dijual darinya tidak memberikannya hak sepenuhnya sebagai orang bebas dan hartanya dihalang darinya, dan dengan membeli sebahagian dirinya, dikhuatiri dia akan menjadi tidak mampu melengkapkan pembayaran kerana apa yang perlu dibelanjakannya. Itu tidak seperti mukatab membeli dirinya sendiri sepenuhnya melainkan sesiapa yang mempunyai sebahagian daripada kitabah yang masih terhutang kepadanya memberikan izin kepadanya. Jika mereka memberikan izin kepadanya, dia lebih berhak terhadap apa yang dijual darinya.\" \n\nMalik berkata, \"Menjual salah satu ansuran mukatab adalah tidak halal. Itu kerana ia adalah transaksi yang tidak pasti. Jika mukatab tidak dapat membayarnya, apa yang dia hutang adalah terbatal. Jika dia meninggal dunia atau muflis dan dia berhutang kepada orang ramai, maka orang yang membeli ansurannya tidak mengambil sebarang bahagiannya bersama pemiutang. Orang yang membeli salah satu ansuran mukatab berada dalam kedudukan tuan mukatab. Tuan mukatab tidak mempunyai bahagian bersama pemiutang mukatab untuk apa yang terhutang kepadanya daripada kitabah hambanya. Begitu juga dengan kharaj, (jumlah tetap yang ditolak setiap hari daripada hamba terhadap pendapatannya), yang terkumpul untuk tuan daripada pendapatan hambanya. Pemiutang hambanya tidak membenarkannya berkongsi apa yang telah terkumpul untuknya daripada potongan-potongan itu.\" \n\nMalik berkata, \"Tiada mudaratnya jika mukatab membayar kitabahnya dengan wang syiling atau barangan selain daripada barangan yang dia tulis kitabahnya jika ia serupa dengannya, tepat pada masanya (untuk ansuran) atau ditangguh.\" \n\nMalik berkata bahawa jika seorang mukatab meninggal dunia dan meninggalkan seorang umm walad dan anak-anak kecil olehnya atau oleh orang lain dan mereka tidak dapat bekerja dan dikhuatiri mereka tidak akan dapat memenuhi kitabah mereka, umm walad bapa itu dijual jika harganya akan membayar semua kitabah untuk mereka, sama ada dia ibu mereka atau tidak. Mereka dibayar dan dibebaskan kerana bapa mereka tidak melarang penjualannya jika dia bimbang dia tidak akan dapat melengkapkan kitabahnya. Jika harganya tidak akan membayar untuk mereka dan sama ada dia atau mereka tidak dapat bekerja, mereka semua kembali menjadi hamba tuan mereka. \n\nMalik berkata, \"Apa yang dilakukan di kalangan kita dalam kes seseorang yang membeli kitabah seorang mukatab, dan kemudian mukatab itu meninggal dunia sebelum dia membayar kitabahnya, ialah orang yang membeli kitabah itu mewarisi darinya. Jika, bukannya meninggal dunia, mukatab tidak dapat membayar, pembeli mempunyai orangnya. Jika mukatab membayar kitabahnya kepada orang yang membelinya dan dia dibebaskan, wala'nya pergi kepada orang yang menulis kitabah dan orang yang membeli kitabahnya tidak mempunyai sebarang bahagian darinya.\""
  },
  {
    "id": 35777,
    "hadith_number": 1599,
    "tajuk_hadith": "Status Anak-Anak Mukatab Selepas Kematian Bapa Mereka",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ، وَسُلَيْمَانَ بْنَ يَسَارٍ، سُئِلاَ عَنْ رَجُلٍ، كَاتَبَ عَلَى نَفْسِهِ وَعَلَى بَنِيهِ ثُمَّ مَاتَ هَلْ يَسْعَى بَنُو الْمُكَاتَبِ فِي كِتَابَةِ أَبِيهِمْ أَمْ هُمْ عَبِيدٌ فَقَالاَ بَلْ يَسْعَوْنَ فِي كِتَابَةِ أَبِيهِمْ وَلاَ يُوْضَعُ عَنْهُمْ لِمَوْتِ أَبِيهِمْ شَىْءٌ ‏.‏ قَالَ مَالِكٌ وَإِنْ كَانُوا صِغَارًا لاَ يُطِيقُونَ السَّعْىَ لَمْ يُنْتَظَرْ بِهِمْ أَنْ يَكْبَرُوا وَكَانُوا رَقِيقًا لِسَيِّدِ أَبِيهِمْ إِلاَّ أَنْ يَكُونَ الْمُكَاتَبُ تَرَكَ مَا يُؤَدَّى بِهِ عَنْهُمْ نُجُومُهُمْ إِلَى أَنْ يَتَكَلَّفُوا السَّعْىَ فَإِنْ كَانَ فِيمَا تَرَكَ مَا يُؤَدَّى عَنْهُمْ أُدِّيَ ذَلِكَ عَنْهُمْ وَتُرِكُوا عَلَى حَالِهِمْ حَتَّى يَبْلُغُوا السَّعْىَ فَإِنْ أَدَّوْا عَتَقُوا وَإِنْ عَجَزُوا رَقُّوا ‏.‏ قَالَ مَالِكٌ فِي الْمُكَاتَبِ يَمُوتُ وَيَتْرُكُ مَالاً لَيْسَ فِيهِ وَفَاءُ الْكِتَابَةِ وَيَتْرُكُ وَلَدًا مَعَهُ فِي كِتَابَتِهِ وَأُمَّ وَلَدٍ فَأَرَادَتْ أُمُّ وَلَدِهِ أَنْ تَسْعَى عَلَيْهِمْ إِنَّهُ يُدْفَعُ إِلَيْهَا الْمَالُ إِذَا كَانَتْ مَأْمُونَةً عَلَى ذَلِكَ قَوِيَّةً عَلَى السَّعْىِ وَإِنْ لَمْ تَكُنْ قَوِيَّةً عَلَى السَّعْىِ وَلاَ مَأْمُونَةً عَلَى الْمَالِ لَمْ تُعْطَ شَيْئًا مِنْ ذَلِكَ وَرَجَعَتْ هِيَ وَوَلَدُ الْمُكَاتَبِ رَقِيقًا لِسَيِّدِ الْمُكَاتَبِ ‏.‏ قَالَ مَالِكٌ إِذَا كَاتَبَ الْقَوْمُ جَمِيعًا كِتَابَةً وَاحِدَةً وَلاَ رَحِمَ بَيْنَهُمْ فَعَجَزَ بَعْضُهُمْ وَسَعَى بَعْضُهُمْ حَتَّى عَتَقُوا جَمِيعًا فَإِنَّ الَّذِينَ سَعَوْا يَرْجِعُونَ عَلَى الَّذِينَ عَجَزُوا بِحِصَّةِ مَا أَدَّوْا عَنْهُمْ لأَنَّ بَعْضَهُمْ حُمَلاَءُ عَنْ بَعْضٍ ‏.‏",
    "malay_translation": "Malik meriwayatkan bahawa baginda telah diberitahu bahawa Urwah bin az-Zubair dan Sulaiman bin Yasar, telah ditanya tentang seorang lelaki yang telah membebaskan dirinya dan anak-anaknya secara bertahap (mukātabah) kemudian meninggal dunia.  Adakah anak-anak mukātab itu perlu meneruskan usaha untuk menyelesaikan bayaran pembebasan  (kitāb) ayah mereka atau mereka menjadi hamba?  Mereka menjawab, \"Mereka perlu meneruskan usaha untuk menyelesaikan bayaran pembebasan ayah mereka, dan tiada apa yang dikurangkan daripada mereka disebabkan kematian ayah mereka.\" \n\nMalik berkata, \"Sekiranya mereka masih kecil dan tidak mampu bekerja, mereka tidak perlu ditunggu sehingga mereka membesar, dan mereka tetap menjadi hamba kepada tuan ayah mereka, kecuali jika orang yang membebaskan dirinya secara bertahap (mukātab) itu meninggalkan harta yang mencukupi untuk membayar hutang pembebasan mereka sehingga mereka mampu bekerja.  Sekiranya terdapat harta yang mencukupi untuk membayar hutang pembebasan mereka, maka ia akan dibayar bagi pihak mereka, dan mereka akan dibiarkan dalam keadaan mereka sehinggalah mereka mampu bekerja. Kemudian, jika mereka dapat membayar baki hutang pembebasan, mereka akan bebas. Sekiranya mereka tidak mampu, maka mereka tetap menjadi hamba.\"\n\nMalik menceritakan tentang seorang mukātab yang meninggal dunia dan meninggalkan harta yang tidak mencukupi untuk membayar hutang pembebasannya, dan dia juga meninggalkan seorang anak bersama-sama dengannya dalam hutang pembebasannya dan seorang wanita yang melahirkan anak untuk tuannya (umm walad).  Wanita itu ingin berusaha untuk menyelesaikan hutang pembebasan mereka. Malik berkata, \"Harta itu akan diberikan kepadanya jika dia boleh dipercayai dan cukup kuat untuk bekerja.  Sekiranya dia tidak cukup kuat untuk bekerja dan tidak boleh dipercayai untuk menjaga harta, maka dia tidak akan diberi apa-apa, dan dia dan anak-anak mukātab itu akan kembali menjadi hamba kepada tuan mukātab itu.\"\n\nMalik berkata, \"Sekiranya sekumpulan orang membuat perjanjian pembebasan secara bersama dalam satu perjanjian (kitāb) dan tiada hubungan kekeluargaan di antara mereka, dan sebahagian daripada mereka tidak mampu bekerja manakala sebahagian yang lain bekerja sehingga semuanya bebas, maka mereka yang bekerja boleh menuntut daripada mereka yang tidak mampu, sebahagian daripada apa yang telah mereka bayar bagi pihak mereka, kerana sebahagian daripada mereka telah menanggung beban bagi pihak yang lain.\""
  },
  {
    "id": 35778,
    "hadith_number": 1600,
    "tajuk_hadith": "Kebebasan Seorang Mukātab yang Melunaskan Hutang",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مَالِكٌ، أَنَّهُ سَمِعَ رَبِيعَةَ بْنَ أَبِي عَبْدِ الرَّحْمَنِ، وَغَيْرَهُ، يَذْكُرُونَ أَنَّ مَكَاتَبًا، كَانَ لِلْفُرَافِصَةِ بْنِ عُمَيْرٍ الْحَنَفِيِّ وَأَنَّهُ عَرَضَ عَلَيْهِ أَنْ يَدْفَعَ إِلَيْهِ جَمِيعَ مَا عَلَيْهِ مِنْ كِتَابَتِهِ فَأَبَى الْفُرَافِصَةُ فَأَتَى الْمُكَاتَبُ مَرْوَانَ بْنَ الْحَكَمِ وَهُوَ أَمِيرُ الْمَدِينَةِ فَذَكَرَ ذَلِكَ لَهُ فَدَعَا مَرْوَانُ الْفُرَافِصَةَ فَقَالَ لَهُ ذَلِكَ فَأَبَى فَأَمَرَ مَرْوَانُ بِذَلِكَ الْمَالِ أَنْ يُقْبَضَ مِنَ الْمُكَاتَبِ فَيُوضَعَ فِي بَيْتِ الْمَالِ وَقَالَ لِلْمُكَاتَبِ اذْهَبْ فَقَدْ عَتَقْتَ ‏.‏ فَلَمَّا رَأَى ذَلِكَ الْفُرَافِصَةُ قَبَضَ الْمَالَ ‏.‏ قَالَ مَالِكٌ فَالأَمْرُ عِنْدَنَا أَنَّ الْمُكَاتَبَ إِذَا أَدَّى جَمِيعَ مَا عَلَيْهِ مِنْ نُجُومِهِ قَبْلَ مَحِلِّهَا جَازَ ذَلِكَ لَهُ وَلَمْ يَكُنْ لِسَيِّدِهِ أَنْ يَأْبَى ذَلِكَ عَلَيْهِ وَذَلِكَ أَنَّهُ يَضَعُ عَنِ الْمُكَاتَبِ بِذَلِكَ كُلَّ شَرْطٍ أَوْ خِدْمَةٍ أَوْ سَفَرٍ لأَنَّهُ لاَ تَتِمُّ عَتَاقَةُ رَجُلٍ وَعَلَيْهِ بَقِيَّةٌ مِنْ رِقٍّ وَلاَ تَتِمُّ حُرْمَتُهُ وَلاَ تَجُوزُ شَهَادَتُهُ وَلاَ يَجِبُ مِيرَاثُهُ وَلاَ أَشْبَاهُ هَذَا مِنْ أَمْرِهِ وَلاَ يَنْبَغِي لِسَيِّدِهِ أَنْ يَشْتَرِطَ عَلَيْهِ خِدْمَةً بَعْدَ عَتَاقَتِهِ ‏.‏ قَالَ مَالِكٌ فِي مُكَاتَبٍ مَرِضَ مَرَضًا شَدِيدًا فَأَرَادَ أَنْ يَدْفَعَ نُجُومَهُ كُلَّهَا إِلَى سَيِّدِهِ لأَنْ يَرِثَهُ وَرَثَةٌ لَهُ أَحْرَارٌ وَلَيْسَ مَعَهُ فِي كِتَابَتِهِ وَلَدٌ لَهُ ‏.‏ قَالَ مَالِكٌ ذَلِكَ جَائِزٌ لَهُ لأَنَّهُ تَتِمُّ بِذَلِكَ حُرْمَتُهُ وَتَجُوزُ شَهَادَتُهُ وَيَجُوزُ اعْتِرَافُهُ بِمَا عَلَيْهِ مِنْ دُيُونِ النَّاسِ وَتَجُوزُ وَصِيَّتُهُ وَلَيْسَ لِسَيِّدِهِ أَنْ يَأْبَى ذَلِكَ عَلَيْهِ بِأَنْ يَقُولَ فَرَّ مِنِّي بِمَالِهِ ‏.‏",
    "malay_translation": "Malik meriwayatkan bahawa beliau mendengar Rabiah ibn Abi Abd ar-Rahman, dan lain-lain, menyebut bahawa seorang mukātab milik al-Furafisha ibn Umayr al-Hanafi telah menawarkan untuk membayar semua hutang kitabahnya.  Al-Furafisha enggan menerimanya, lalu mukātab itu pergi kepada Marwan ibn al-Hakam, iaitu gabenor Madinah, dan menceritakan hal tersebut. Marwan memanggil al-Furafisha dan menyuruhnya menerima bayaran itu, tetapi dia enggan.  Marwan kemudian memerintahkan agar wang itu diambil daripada mukātab dan dimasukkan ke dalam Baitulmal.  Beliau berkata kepada mukātab itu, \"Pergilah, engkau telah merdeka.\" Apabila al-Furafisha melihat itu, dia mengambil wang tersebut.\n\nMalik berkata, \"Perkara yang berlaku di kalangan kita ialah sekiranya seorang mukātab membayar semua ansuran hutangnya sebelum tempohnya, ia dibenarkan, dan tuannya tidak boleh menolaknya. Ini kerana bayaran tersebut menghapuskan semua syarat, khidmat atau perjalanan bagi mukātab tersebut.  Kebebasan seseorang itu tidak sempurna selagi masih ada sisa perhambaan, dan kemuliaannya sebagai orang merdeka tidak sempurna, dan keterangannya tidak sah, dan pusakanya tidak wajib, dan perkara-perkara seumpamanya. Tuannya tidak boleh menetapkan sebarang syarat khidmat ke atasnya selepas pembebasannya.\"\n\nMalik berkata bahawa dibenarkan bagi seorang mukātab yang jatuh sakit tenat dan ingin membayar semua ansuran kepada tuannya supaya waris-warisnya yang merdeka dapat mewarisi hartanya, dan dia tidak mempunyai anak dalam kitabahnya, untuk berbuat demikian, kerana dengan itu, kemuliaannya sebagai orang merdeka akan sempurna, keterangannya dibenarkan, dan pengakuannya terhadap hutang-hutangnya kepada orang lain dibenarkan.  Wasiatnya juga dibenarkan. Tawannya tidak boleh menolaknya dengan mengatakan, \"Dia melarikan diri daripada saya dengan hartanya.\""
  },
  {
    "id": 35779,
    "hadith_number": 1601,
    "tajuk_hadith": "Pewarisan Mukatib",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، سُئِلَ عَنْ مُكَاتَبٍ، كَانَ بَيْنَ رَجُلَيْنِ فَأَعْتَقَ أَحَدُهُمَا نَصِيبَهُ فَمَاتَ الْمُكَاتَبُ وَتَرَكَ مَالاً كَثِيرًا فَقَالَ يُؤَدَّى إِلَى الَّذِي تَمَاسَكَ بِكِتَابَتِهِ الَّذِي بَقِيَ لَهُ ثُمَّ يَقْتَسِمَانِ مَا بَقِيَ بِالسَّوِيَّةِ ‏.‏ قَالَ مَالِكٌ إِذَا كَاتَبَ الْمُكَاتَبُ فَعَتَقَ فَإِنَّمَا يَرِثُهُ أَوْلَى النَّاسِ بِمَنْ كَاتَبَهُ مِنَ الرِّجَالِ يَوْمَ تُوُفِّيَ الْمُكَاتَبُ مِنْ وَلَدٍ أَوْ عَصَبَةٍ ‏.‏ قَالَ وَهَذَا أَيْضًا فِي كُلِّ مَنْ أُعْتِقَ فَإِنَّمَا مِيرَاثُهُ لأَقْرَبِ النَّاسِ مِمَّنْ أَعْتَقَهُ مِنْ وَلَدٍ أَوْ عَصَبَةٍ مِنَ الرِّجَالِ يَوْمَ يَمُوتُ الْمُعْتَقُ بَعْدَ أَنْ يَعْتِقَ وَيَصِيرَ مَوْرُوثًا بِالْوَلاَءِ ‏.‏ قَالَ مَالِكٌ الإِخْوَةُ فِي الْكِتَابَةِ بِمَنْزِلَةِ الْوَلَدِ إِذَا كُوتِبُوا جَمِيعًا كِتَابَةً وَاحِدَةً إِذَا لَمْ يَكُنْ لأَحَدٍ مِنْهُمْ وَلَدٌ كَاتَبَ عَلَيْهِمْ أَوْ وُلِدُوا فِي كِتَابَتِهِ أَوْ كَاتَبَ عَلَيْهِمْ ثُمَّ هَلَكَ أَحَدُهُمْ وَتَرَكَ مَالاً أُدِّيَ عَنْهُمْ جَمِيعُ مَا عَلَيْهِمْ مِنْ كِتَابَتِهِمْ وَعَتَقُوا وَكَانَ فَضْلُ الْمَالِ بَعْدَ ذَلِكَ لِوَلَدِهِ دُونَ إِخْوَتِهِ ‏.‏",
    "malay_translation": "Malik meriwayatkan bahawa baginda telah diberitahu bahawa Said bin al-Musayyab ditanya tentang seorang mukatib yang di antara dua orang lelaki.  Salah seorang daripada mereka membebaskan bahagiannya, kemudian mukatib itu meninggal dunia dan meninggalkan harta yang banyak. Maka Said menjawab, \"Harta yang masih tertunggak kepada yang memegang kitabahnya dibayar terlebih dahulu, kemudian mereka berdua membahagikan baki harta tersebut secara sama rata.\" \n\nMalik berkata, \"Apabila seorang mukatib menunaikan kitabahnya dan menjadi merdeka, maka warisnya ialah orang yang terdekat dengannya daripada kalangan yang telah menulis kitabahnya, sama ada anak atau keluarga terdekat.\" \n\nBaginda berkata, \"Begitu juga bagi sesiapa yang dibebaskan, maka warisnya ialah orang yang terdekat dengannya daripada kalangan anak atau keluarga terdekat pada hari kematiannya setelah dibebaskan dan menjadi waris melalui wala' (ikatan kerabat).\"\n\nMalik berkata, \"Saudara-saudara yang ditulis bersama dalam satu kitabah adalah seperti anak-anak antara satu sama lain, jika tiada seorang pun daripada mereka mempunyai anak yang ditulis dalam kitabah atau dilahirkan dalam tempoh kitabah tersebut.  Apabila salah seorang daripada mereka meninggal dunia dan meninggalkan harta, maka semua hutang kitabah mereka dibayar, dan mereka dibebaskan.  Baki harta selepas itu menjadi milik anaknya, bukan saudara-saudaranya.\""
  },
  {
    "id": 35780,
    "hadith_number": 1602,
    "tajuk_hadith": "Mukatabah dan Syarat-Syaratnya",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Malik memberitahu saya tentang seorang lelaki yang menulis kitabah untuk hambanya dengan bayaran emas atau perak, dan mensyaratkan dalam kitabah itu perjalanan, perkhidmatan, korban atau yang serupa, yang telah dinyatakan namanya. Kemudian, orang yang dimukatab itu mampu membayar semua ansurannya sebelum tamat tempoh.\n\nBeliau berkata, \"Sekiranya dia membayar semua ansuran dan dibebaskan, dan kebebasan dirinya telah lengkap, tetapi dia masih mempunyai syarat ini untuk ditunaikan, syarat itu akan diperiksa. Dan apa sahaja yang melibatkan dirinya seperti perkhidmatan atau perjalanan dan sebagainya, akan dihapuskan darinya, dan tuannya tidak mempunyai apa-apa hak ke atasnya. Apa sahaja yang melibatkan korban, pakaian, atau apa sahaja yang perlu dibayar, yang berupa dinar dan dirham, dinilai dan dibayar bersama-sama dengan ansurannya. Dan dia tidak bebas sehingga dia membayarnya bersama-sama dengan ansurannya.\"\n\nMalik berkata, \"Cara yang umumnya dipersetujui di kalangan kami tanpa sebarang perselisihan, ialah orang yang dimukatab itu berada dalam kedudukan yang sama seperti hamba yang akan dibebaskan oleh tuannya selepas perkhidmatan sepuluh tahun. Sekiranya tuan yang akan membebaskannya meninggal dunia sebelum sepuluh tahun, baki perkhidmatannya akan diwarisi oleh warisnya, dan wala'nya akan diwarisi oleh orang yang telah membuat perjanjian untuk membebaskannya, dan anak-anak lelakinya atau saudara-mara sebelah bapa.\"\n\nMalik memberitahu tentang seorang lelaki yang mensyaratkan terhadap orang yang dimukatabnya bahawa dia tidak boleh melakukan perjalanan, berkahwin, atau meninggalkan tanahnya tanpa kebenaran, dan jika dia berbuat demikian tanpa kebenaran, dia berkuasa membatalkan kitabah. Beliau berkata, \"Sekiranya orang yang dimukatab itu melakukan perkara-perkara ini, lelaki itu tidak berkuasa membatalkan kitabah. Biar tuan itu membawanya kepada Sultan.  Bagaimanapun, orang yang dimukatab itu tidak boleh berkahwin, melakukan perjalanan, atau meninggalkan tanah tuannya tanpa kebenaran, sama ada dia mensyaratkannya atau tidak. Ini kerana lelaki itu mungkin menulis kitabah untuk hambanya dengan bayaran 100 dinar, dan hamba itu mungkin mempunyai 1000 dinar atau lebih. Dia pergi berkahwin dengan seorang wanita dan membayar mas kahwinnya yang menghabiskan wang simpanannya, dan dia tidak dapat membayar. Dia kembali menjadi hamba tuannya tanpa harta. Atau dia mungkin melakukan perjalanan dan ansurannya jatuh tempo semasa dia tidak berada di tempat. Dia tidak boleh berbuat demikian, dan kitabah tidak boleh berdasarkan perkara itu.  Ia di tangan tuannya. Jika dia mahu, dia memberikan kebenaran. Jika dia mahu, dia menolaknya.\" "
  },
  {
    "id": 35781,
    "hadith_number": 1603,
    "tajuk_hadith": "Hukum Membebaskan Hamba oleh Mukatib",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Malik berkata, \"Apabila seorang mukatib membebaskan hambanya sendiri, ia hanya dibenarkan dengan izin tuannya. Jika tuannya memberi izin dan mukatib membebaskan hambanya, maka wala’ hamba itu menjadi milik mukatib. Jika mukatib meninggal dunia sebelum dirinya dibebaskan, wala’ hamba yang dibebaskan itu menjadi milik tuan mukatib. Jika hamba yang dibebaskan itu meninggal dunia sebelum mukatib dibebaskan, maka tuan mukatib mewarisi hartanya.\" \n\nMalik berkata, \"Begitu juga jika seorang mukatib memberi kitabah kepada hambanya dan mukatib itu dibebaskan sebelum dirinya. Wala’ itu menjadi milik tuan mukatib selagi dia belum bebas. Jika orang yang menulis kitabah itu dibebaskan, maka wala’ mukatibnya yang dibebaskan sebelumnya kembali kepadanya. Jika mukatib pertama meninggal dunia sebelum membayar atau tidak mampu membayar kitabahnya dan dia mempunyai anak-anak, mereka tidak mewarisi wala’ mukatib bapa mereka kerana wala’ itu belum ditetapkan untuk bapa mereka dan dia tidak mempunyai wala’ sehingga dia bebas.\" \n\nMalik menceritakan tentang seorang mukatib yang dimiliki bersama oleh dua orang lelaki dan seorang dari mereka melepaskan apa yang terhutang oleh mukatib itu manakala yang lain tetap menuntut haknya. Kemudian mukatib itu meninggal dunia dan meninggalkan harta.\n\nMalik berkata, \"Orang yang tidak melepaskan apa yang terhutang kepadanya dibayar sepenuhnya. Kemudian harta itu dibahagikan di antara mereka berdua sepertimana jika seorang hamba meninggal dunia kerana apa yang dilakukan oleh orang pertama itu bukanlah membebaskannya. Dia hanya melepaskan hutang yang terhutang kepadanya.\" \n\nMalik berkata, \"Satu penjelasan tentang perkara itu ialah apabila seseorang meninggal dunia dan meninggalkan seorang mukatib dan dia juga meninggalkan anak-anak lelaki dan perempuan dan seorang daripada anak-anak itu membebaskan bahagiannya daripada mukatib, itu tidak menetapkan apa-apa wala’ untuknya. Sekiranya ia benar-benar pembebasan, wala’ itu akan ditetapkan untuk lelaki dan perempuan yang membebaskannya.\" \n\nMalik berkata, \"Satu lagi penjelasan tentang perkara itu ialah jika salah seorang daripada mereka membebaskan bahagiannya dan kemudian mukatib itu tidak mampu membayar, nilai baki mukatib itu akan berubah kerana orang yang membebaskan bahagiannya. Sekiranya ia benar-benar pembebasan, nilai anggaran tersebut akan diambil daripada harta orang yang membebaskan sehingga dia dibebaskan sepenuhnya sebagaimana yang dikatakan oleh Rasulullah SAW, 'Barangsiapa membebaskan bahagiannya dalam seorang hamba dan mempunyai wang untuk menampung harga penuh hamba itu, yang dinilai dengan adil baginya, memberikan bahagian kepada rakan-rakannya. Jika tidak, dia membebaskan apa yang dibebaskannya.' (Lihat Kitab 37 hadis 1).\" \n\nBeliau berkata, \"Satu lagi penjelasan tentang perkara itu ialah sebahagian daripada sunnah umat Islam yang tidak ada perselisihan pendapat, ialah barangsiapa membebaskan bahagiannya daripada seorang mukatib, mukatib itu tidak dibebaskan sepenuhnya dengan menggunakan hartanya. Sekiranya dia benar-benar dibebaskan, wala’ itu akan menjadi miliknya sahaja dan bukan rakan-rakannya. Sebahagian daripada apa yang akan menjelaskan perkara itu juga ialah sebahagian daripada sunnah umat Islam ialah wala’ itu milik sesiapa yang menulis kontrak kitabah. Wanita-wanita yang mewarisi daripada tuan mukatib tidak mempunyai wala’ mukatib. Jika mereka membebaskan sebahagian daripada bahagian mereka, wala’ itu menjadi milik anak-anak lelaki tuan mukatib atau kaum kerabat lelaki sebelah bapanya.\" "
  },
  {
    "id": 35782,
    "hadith_number": 1604,
    "tajuk_hadith": "Membebaskan Hamba Sahaya Secara Adil",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Malik berkata, \"Jika sekumpulan hamba sahaya bersama-sama dalam satu kitabah (perjanjian pembebasan), tuan mereka tidak boleh membebaskan seorang daripada mereka tanpa berunding dengan hamba sahaya lain yang turut terikat dalam kitabah tersebut dan mendapat persetujuan mereka. Namun, jika mereka masih muda, perundingan itu tidak bermakna dan tidak dibenarkan. Ini kerana mungkin ada seorang hamba yang bekerja untuk semua orang dan membayar kitabah mereka untuk mendapatkan kebebasan. Tuan mereka akan menghampiri orang yang sanggup membayar bagi pembebasan mereka.  Pembebasan mereka bergantung kepadanya. Dia membebaskan seorang hamba dan menyebabkan mereka yang lain tidak mampu membayar.  Dia berbuat demikian bertujuan untuk mendapat keuntungan dan peningkatan untuk dirinya sendiri.  Tetapi, dia tidak dibenarkan berbuat demikian kepada hamba sahaya yang lain. Rasulullah SAW bersabda, 'Tiada kemudaratan dan tiada pembalasan kemudaratan.' Ini adalah kemudaratan yang paling besar.\" \n\nMalik turut menyatakan tentang hamba sahaya yang menulis kitabah bersama-sama bahawa adalah dibenarkan bagi tuan mereka untuk membebaskan hamba sahaya yang tua dan uzur, serta yang muda jika mereka tidak mampu membayar apa-apa, dan tiada sebarang pertolongan atau kekuatan yang boleh didapati daripada mereka dalam kitabah tersebut."
  },
  {
    "id": 35783,
    "hadith_number": 1605,
    "tajuk_hadith": "Hukum Umm Walad dan Mukātab",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Malik berkata mengenai seorang lelaki yang mempunyai seorang hamba perempuan dalam bentuk perjanjian pembebasan bertahap (kitabah), kemudian hamba tersebut meninggal dunia dan meninggalkan ibunya (umm walad).  Terdapat baki pembayaran daripada perjanjian tersebut, dan lelaki itu meninggal dunia tanpa melunaskan baki pembayaran.  Malik menyatakan bahawa umm walad tersebut masih tetap hamba, kerana hamba lelaki itu tidak dibebaskan sepenuhnya sebelum kematiannya dan tidak meninggalkan anak-anak yang boleh menebus kebebasannya dengan melunaskan baki pembayaran. Oleh itu, umm walad tersebut tidak dibebaskan melalui pembebasan anak-anaknya. \n\nMalik juga berkata mengenai seorang hamba yang sedang dalam proses pembebasan bertahap (mukātab) yang membebaskan hamba lain miliknya atau bersedekah dengan sebahagian hartanya tanpa pengetahuan tuannya.  Sekiranya tuan mengetahui hal ini selepas hamba tersebut dibebaskan, maka tindakan hamba tersebut sah dan tuan tidak boleh membatalkannya.  Namun, sekiranya tuan mengetahui sebelum pembebasan, tuan berhak menolak dan tidak membenarkannya. Jika hamba tersebut dibebaskan kemudian, dan dia berkemampuan untuk berbuat demikian, dia tidak diwajibkan membebaskan hamba tersebut atau bersedekah, melainkan atas kerelaannya sendiri."
  },
  {
    "id": 35784,
    "hadith_number": 1606,
    "tajuk_hadith": "Hukum Pembebasan Mukātab Selepas Kematian Tuannya",
    "perawi_melayu": "Malik",
    "english_text": "",
    "arabic_text": "",
    "malay_translation": "Malik berkata, “Yang terbaik daripada apa yang aku dengar tentang seorang mukātab yang dibebaskan oleh tuannya setelah kematian, ialah mukātab itu dinilai mengikut harga jualnya. Jika nilai itu kurang daripada baki kitābanya, maka kebebasannya diambil daripada sepertiga harta pusaka si mati. Kita tidak melihat kepada jumlah dirham yang masih tertunggak dalam kitābanya. Ini kerana sekiranya dia terbunuh, pembunuhnya tidak akan berhutang melainkan nilai dirinya pada hari dia terbunuh. Sekiranya dia cedera, orang yang mencederakannya tidak akan bertanggungjawab melainkan diat kerana kecederaan itu pada hari dia cedera. Kita tidak melihat berapa banyak dinar dan dirham yang telah dibayar daripada kontrak yang telah ditulis kerana dia masih hamba selagi mana ada baki kitābanya. Sekiranya baki kitābanya kurang daripada nilainya, hanya baki hutang kitābanya sahaja yang diambil kira daripada sepertiga harta pusaka si mati. Ini kerana si mati meninggalkan kepadanya baki kitābanya, maka ia menjadi wasiat yang dibuat oleh si mati.”\n\nMalik berkata, “Contohnya ialah jika harga mukātab itu seribu dirham, dan hanya seratus dirham yang tinggal daripada kitābanya, tuannya meninggalkan kepadanya seratus dirham untuk melunaskan hutangnya. Ia diambil kira daripada sepertiga harta tuannya dan dengan itu dia menjadi bebas.”\n\nMalik berkata bahawa sekiranya seseorang lelaki menulis kitābanya kepada hambanya ketika kematiannya, nilai hamba itu dianggarkan. Sekiranya terdapat wang yang cukup untuk menampung harga hamba itu dalam sepertiga hartanya, ia dibenarkan untuknya.\n\nMalik berkata, “Contohnya ialah harga hamba itu seribu dinar. Tuannya menulis kitāba untuknya sebanyak dua ratus dinar ketika kematiannya. Sepertiga harta tuannya ialah seribu dinar, maka ia dibenarkan untuknya. Ia hanyalah wasiat yang dibuatnya daripada sepertiga hartanya. Sekiranya tuan itu telah meninggalkan wasiat kepada orang lain, dan tidak ada lebihan dalam sepertiga harta itu selepas nilai mukātab itu, maka kita mulakan dengan mukātab kerana kitāba itu untuk pembebasan, dan pembebasan didahulukan berbanding wasiat. Apabila wasiat-wasiat itu dibayar daripada kitāba mukātab, ia mengikutinya. Pewaris wasiat itu mempunyai pilihan. Sekiranya mereka mahu memberikan kepada semua yang berwasiat semua wasiat mereka dan kitāba mukātab menjadi milik mereka, mereka boleh berbuat demikian. Sekiranya mereka menolak dan menyerahkan mukātab dan apa yang dia hutang kepada orang yang berwasiat, mereka boleh berbuat demikian, kerana sepertiga harta itu bermula dengan mukātab dan kerana semua wasiat yang dibuatnya adalah satu kesatuan.”\n\nSekiranya pewaris kemudiannya berkata, “Apa yang diwasiatkan oleh sahabat kita lebih daripada sepertiga hartanya dan dia telah mengambil apa yang bukan haknya,” Malik berkata, “Pewarisnya mempunyai pilihan. Mereka diberitahu, ‘Sahabat kamu telah membuat wasiat yang kamu ketahui dan jika kamu mahu memberikannya kepada mereka yang akan menerimanya mengikut wasiat si mati, maka lakukanlah. Jika tidak, serahkan kepada orang yang berwasiat sepertiga daripada jumlah harta si mati.’”\n\nMalik meneruskan, “Sekiranya pewaris menyerahkan mukātab kepada orang yang berwasiat, orang yang berwasiat mendapat apa yang dia hutang daripada kitābanya. Sekiranya mukātab membayar apa yang dia hutang daripada kitābanya, mereka mengambilnya dalam wasiat mereka mengikut bahagian masing-masing. Sekiranya mukātab tidak dapat membayar, dia menjadi hamba orang yang berwasiat dan tidak kembali kepada pewaris kerana mereka telah menyerahkannya ketika membuat pilihan mereka, dan kerana apabila dia diserahkan kepada orang yang berwasiat, mereka bertanggungjawab. Sekiranya dia mati, mereka tidak akan mempunyai apa-apa tuntutan terhadap pewaris. Sekiranya mukātab mati sebelum membayar kitābanya dan dia meninggalkan harta yang lebih daripada apa yang dia hutang, hartanya pergi kepada orang yang berwasiat. Sekiranya mukātab membayar apa yang dia hutang, dia bebas dan walinya kembali kepada keluarga bapa orang yang menulis kitāba untuknya.”\n\nMalik bercakap tentang seorang mukātab yang berhutang sepuluh ribu dirham kepada tuannya dalam kitābanya, dan apabila dia meninggal dunia, dia membayar seribu dirham daripadanya. Dia berkata, “Mukātab itu dinilai dan nilainya diambil kira. Sekiranya nilainya seribu dirham dan pengurangan itu ialah sepersepuluh daripada kitāba, bahagian daripada harga hamba itu ialah seratus dirham. Ia ialah sepersepuluh daripada harga. Sepersepuluh daripada kitāba itu dikurangkan untuknya. Ia ditukar kepada sepersepuluh daripada harga dalam wang tunai. Ia seolah-olah dia telah mendapat pengurangan semua hutangnya. Sekiranya dia berbuat demikian, hanya nilai hamba itu – seribu dirham – akan diambil kira dalam sepertiga harta si mati. Sekiranya apa yang telah dibayar itu ialah separuh daripada kitāba, separuh daripada harga itu diambil kira dalam sepertiga harta si mati. Sekiranya ia lebih atau kurang daripada itu, ia mengikut perkiraan ini.”\n\nMalik berkata, “Apabila seseorang lelaki mengurangkan kitāba mukātabnya sebanyak seribu dirham ketika kematiannya daripada kitāba sepuluh ribu dirham, dan dia tidak menyatakan sama ada ia daripada awal atau akhir kitābanya, setiap bayaran ansuran dikurangkan untuknya sebanyak sepersepuluh.”\n\nMalik berkata, “Sekiranya seseorang lelaki membayar seribu dirham daripada mukātabnya ketika kematiannya daripada awal atau akhir kitābanya, dan asas asal kitāba itu ialah tiga ribu dirham, nilai tunai mukātab itu dianggarkan. Kemudian nilai itu dibahagikan. Seribu yang daripada awal kitāba itu ditukar kepada bahagiannya daripada harga mengikut jarak masanya dan keutamaan, dan kemudian seribu yang mengikut seribu pertama mengikut keutamaannya juga sehingga ke penghujungnya, dan setiap seribu dibayar mengikut tempatnya dalam menunda dan mempercepatkan tempoh kerana apa yang ditunda itu kurang nilainya. Kemudian ia diletakkan dalam sepertiga harta si mati mengikut apa sahaja daripada harga yang jatuh kepada seribu itu mengikut perbezaan keutamaan itu, sama ada lebih atau kurang, maka ia mengikut perkiraan ini.”\n\nMalik bercakap tentang seorang lelaki yang mewariskan kepada seseorang lelaki seperempat daripada seorang mukātab atau membebaskan seperempat, dan kemudian lelaki itu meninggal dunia dan mukātab itu meninggal dunia dan meninggalkan banyak harta, lebih daripada apa yang dia hutang. Dia berkata, “Pewaris tuan pertama dan orang yang diwariskan seperempat daripada mukātab itu diberi apa yang masih mereka hutang oleh mukātab. Kemudian mereka membahagikan baki, dan orang yang diwariskan seperempat itu mendapat sepertiga daripada baki selepas kitāba dibayar. Pewaris tuannya mendapat dua pertiga. Ini kerana mukātab itu masih hamba selagi mana ada baki kitābanya yang perlu dibayar. Dia diwarisi daripada pemilikan dirinya.”\n\nMalik berkata tentang seorang mukātab yang dibebaskan oleh tuannya ketika kematiannya, “Sekiranya sepertiga harta si mati tidak mencukupi untuk membebaskannya, dia dibebaskan mengikut apa yang dapat dibayar daripada sepertiga itu dan kitābanya dikurangkan mengikut itu. Sekiranya mukātab itu berhutang lima ribu dirham dan nilainya ialah dua ribu dirham tunai, dan sepertiga harta si mati ialah seribu dirham, separuh darinya dibebaskan dan separuh daripada kitābanya dikurangkan untuknya.” Malik berkata tentang seseorang lelaki yang berkata dalam wasiatnya, “Hamba saya si anu dibebaskan dan tulis kitāba untuk si anu,” bahawa pembebasan didahulukan berbanding kitāba."
  }
]