[
  {
    "id": 21906,
    "hadith_number": 1402,
    "tajuk_hadith": "Jumlah Sujud Tilawah dalam Al-Quran dan Penjelasan Mengenainya",
    "perawi_melayu": "Diriwayatkan daripada Amr ibn al-'As:",
    "english_text": "The Prophet (ﷺ) taught me fifteen prostrations while reciting the Qur'an, including three in al-Mufassal and two in Surah al-Hajj.\n\n\nAbu Dawud said: Abu al-Darda' has reported eleven prostrations from the Prophet (ﷺ), but chain of this tradition is weak.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ بْنِ الْبَرْقِيِّ، حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا نَافِعُ بْنُ يَزِيدَ، عَنِ الْحَارِثِ بْنِ سَعِيدٍ الْعُتَقِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ مُنَيْنٍ، - مِنْ بَنِي عَبْدِ كُلاَلٍ - عَنْ عَمْرِو بْنِ الْعَاصِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَقْرَأَهُ خَمْسَ عَشْرَةَ سَجْدَةً فِي الْقُرْآنِ مِنْهَا ثَلاَثٌ فِي الْمُفَصَّلِ وَفِي سُورَةِ الْحَجِّ سَجْدَتَانِ ‏.‏ قَالَ أَبُو دَاوُدَ رُوِيَ عَنْ أَبِي الدَّرْدَاءِ عَنِ النَّبِيِّ صلى الله عليه وسلم إِحْدَى عَشْرَةَ سَجْدَةً وَإِسْنَادُهُ وَاهٍ ‏.‏",
    "malay_translation": "Nabi Muhammad ﷺ mengajarkan saya lima belas sujud ketika membaca Al-Quran, termasuk tiga di al-Mufassal dan dua di Surah al-Hajj.\n\nAbu Dawud berkata: Abu al-Darda' telah meriwayatkan sebelas sujud daripada Nabi ﷺ, tetapi sanad hadis ini adalah lemah."
  },
  {
    "id": 21907,
    "hadith_number": 1403,
    "tajuk_hadith": "Anjuran Melakukan Dua Sujud dalam Surah Al-Hajj",
    "perawi_melayu": "Diriwayatkan oleh Uqbah ibn Amir:",
    "english_text": "I said to the Messenger of Allah (ﷺ): Are there two prostrations in Surah al-Hajj? He replied: Yes; if anyone does not make two prostrations, he should not recite them.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي ابْنُ لَهِيعَةَ، أَنَّ مِشْرَحَ بْنَ هَاعَانَ أَبَا الْمُصْعَبِ، حَدَّثَهُ أَنَّ عُقْبَةَ بْنَ عَامِرٍ حَدَّثَهُ قَالَ قُلْتُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَفِي سُورَةِ الْحَجِّ سَجْدَتَانِ قَالَ ‏\n\"‏ نَعَمْ وَمَنْ لَمْ يَسْجُدْهُمَا فَلاَ يَقْرَأْهُمَا ‏\"‏ ‏.‏",
    "malay_translation": "Aku berkata kepada Rasulullah (ﷺ): Adakah dua sujud dalam Surah al-Hajj? Baginda menjawab: Ya; jika sesiapa tidak melakukan dua sujud itu, maka janganlah dia membacanya."
  },
  {
    "id": 21908,
    "hadith_number": 1404,
    "tajuk_hadith": "Nabi Muhammad SAW Tidak Sujud dalam Surah al-Mufassal Selepas Berhijrah ke Madinah",
    "perawi_melayu": "Diriwayatkan daripada Abdullah ibn Abbas:",
    "english_text": "The Messenger of Allah (ﷺ) did not make a prostration at any verse in al-Mufassal from the time he moved to Medina.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا أَزْهَرُ بْنُ الْقَاسِمِ، - قَالَ مُحَمَّدٌ رَأَيْتُهُ بِمَكَّةَ - حَدَّثَنَا أَبُو قُدَامَةَ، عَنْ مَطَرٍ الْوَرَّاقِ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يَسْجُدْ فِي شَىْءٍ مِنَ الْمُفَصَّلِ مُنْذُ تَحَوَّلَ إِلَى الْمَدِينَةِ ‏.‏",
    "malay_translation": "Rasulullah SAW tidak melakukan sujud pada mana-mana ayat dalam surah al-Mufassal sejak baginda berhijrah ke Madinah."
  },
  {
    "id": 21909,
    "hadith_number": 1405,
    "tajuk_hadith": "Rasulullah ﷺ Tidak Sujud Ketika Dibacakan Surah An-Najm",
    "perawi_melayu": "Diriwayatkan daripada Zaid bin Thabit, beliau berkata:",
    "english_text": "\"I recited to the Messenger of Allah (ﷺ) (Surat) An-Najm and he did not prostrate in it.\"",
    "arabic_text": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا وَكِيعٌ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ زَيْدِ بْنِ ثَابِتٍ، قَالَ قَرَأْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم النَّجْمَ فَلَمْ يَسْجُدْ فِيهَا ‏.‏",
    "malay_translation": "\"Saya membacakan (Surah) An-Najm kepada Rasulullah ﷺ dan baginda tidak sujud di dalamnya.\""
  },
  {
    "id": 21910,
    "hadith_number": 1406,
    "tajuk_hadith": "Zaid menjadi Imam dan Tidak Melakukan Sujud dalam Solat",
    "perawi_melayu": "Hadis ini juga diriwayatkan oleh Zaid b. Thabit melalui rantai periwayat yang berbeza dengan kesan yang sama.\n\nAbu Dawud berkata:",
    "english_text": "Zaid was imam (in a prayer) and he did not make prostration.",
    "arabic_text": "حَدَّثَنَا ابْنُ السَّرْحِ، أَخْبَرَنَا ابْنُ وَهْبٍ، حَدَّثَنَا أَبُو صَخْرٍ، عَنِ ابْنِ قُسَيْطٍ، عَنْ خَارِجَةَ بْنِ زَيْدِ بْنِ ثَابِتٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَاهُ ‏.‏ قَالَ أَبُو دَاوُدَ كَانَ زَيْدٌ الإِمَامَ فَلَمْ يَسْجُدْ فِيهَا ‏.‏",
    "malay_translation": "Zaid menjadi imam (dalam solat) dan dia tidak melakukan sujud. Abu Dawud berkata: Zaid adalah imam dan tidak sujud di dalamnya."
  },
  {
    "id": 21911,
    "hadith_number": 1407,
    "tajuk_hadith": "Rasulullah ﷺ Sujud Ketika Membaca Surah An-Najm dan Akibat Seorang Lelaki yang Enggan Sujud",
    "perawi_melayu": "Diriwayatkan daripada 'Abd Allah (b. Mas'ud):",
    "english_text": "The Messenger of Allah (ﷺ) recited Surah al-Najm and prostrated himself. No one remained there who did not prostrate (along with him). A man from the people took a handful of pebbles or dust and raised it to his face saying: This is enough for me. 'Abd Allah (b. Mas'ud) said: I later saw him killed as an infidel.",
    "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ، عَنْ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَرَأَ سُورَةَ النَّجْمِ فَسَجَدَ فِيهَا وَمَا بَقِيَ أَحَدٌ مِنَ الْقَوْمِ إِلاَّ سَجَدَ فَأَخَذَ رَجُلٌ مِنَ الْقَوْمِ كَفًّا مِنْ حَصًى أَوْ تُرَابٍ فَرَفَعَهُ إِلَى وَجْهِهِ وَقَالَ يَكْفِينِي هَذَا ‏.‏ قَالَ عَبْدُ اللَّهِ فَلَقَدْ رَأَيْتُهُ بَعْدَ ذَلِكَ قُتِلَ كَافِرًا ‏.‏",
    "malay_translation": "Rasulullah ﷺ membaca Surah an-Najm dan sujud. Tidak ada seorang pun yang tinggal di situ melainkan turut sujud bersama baginda. Seorang lelaki daripada kaum itu mengambil segenggam batu kerikil atau tanah, lalu mengangkatnya ke wajahnya seraya berkata: 'Ini sudah cukup bagiku.' 'Abd Allah (b. Mas'ud) berkata: 'Kemudian aku melihatnya terbunuh sebagai seorang kafir.'"
  },
  {
    "id": 21912,
    "hadith_number": 1408,
    "tajuk_hadith": "Sujud Bersama Rasulullah SAW dalam Surah Al-Inshiqaq dan Al-Alaq",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "We prostrated ourselves along with the Messenger of Allah (ﷺ) on account of: \"When the sky is rent asunder\" and \"Recite in the name of Your Lord Who created\"",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ بْنِ مُوسَى، عَنْ عَطَاءِ بْنِ مِينَاءَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ سَجَدْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي ‏{‏ إِذَا السَّمَاءُ انْشَقَّتْ ‏}‏ وَ ‏{‏ اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ ‏}‏ ‏.‏",
    "malay_translation": "Kami sujud bersama Rasulullah SAW disebabkan ayat: \"Apabila langit terbelah\" dan \"Bacalah dengan nama Tuhanmu yang telah menciptakan\"."
  },
  {
    "id": 21913,
    "hadith_number": 1409,
    "tajuk_hadith": "Sujud dalam Solat Isyak Kerana Membaca Surah Al-Inshiqaq",
    "perawi_melayu": "Diriwayatkan oleh Abu Rafi':",
    "english_text": "I offered the night prayer behind Abu Hurairah. He recited Surah Inshiqaq (\"When the sky is rent asunder\") and prostrated himself. I asked him: What is this prostration ? He replied: I prostrated myself on account of this (surah) behind Abu al-Qasim (i.e. the Prophet). I shall continue prostrating on account of this till I meet him.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا الْمُعْتَمِرُ، قَالَ سَمِعْتُ أَبِي، حَدَّثَنَا بَكْرٌ، عَنْ أَبِي رَافِعٍ، قَالَ صَلَّيْتُ مَعَ أَبِي هُرَيْرَةَ الْعَتَمَةَ فَقَرَأَ ‏{‏ إِذَا السَّمَاءُ انْشَقَّتْ ‏}‏ فَسَجَدَ فَقُلْتُ مَا هَذِهِ السَّجْدَةُ قَالَ سَجَدْتُ بِهَا خَلْفَ أَبِي الْقَاسِمِ صلى الله عليه وسلم فَلاَ أَزَالُ أَسْجُدُ بِهَا حَتَّى أَلْقَاهُ ‏.‏",
    "malay_translation": "Saya menunaikan solat Isyak di belakang Abu Hurairah. Beliau membaca Surah Al-Inshiqaq (\"Apabila langit terbelah\") dan sujud. Saya bertanya kepadanya: Apakah sujud ini? Beliau menjawab: Saya sujud kerana (surah) ini di belakang Abu al-Qasim (iaitu Nabi Muhammad SAW). Saya akan terus sujud kerananya sehingga saya bertemu dengan Baginda."
  },
  {
    "id": 21914,
    "hadith_number": 1410,
    "tajuk_hadith": "Sujud Ketika Membaca Surah Sad Bukanlah Wajib Tetapi Nabi Pernah Melakukannya",
    "perawi_melayu": "Diriwayatkan dari Ibn 'Abbas:",
    "english_text": "A prostration when reciting Sad is not one of those which are divinely commanded, but I have seen Messenger of Allah (ﷺ) prostrate himself.",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَيْسَ ‏{‏ ص ‏}‏ مِنْ عَزَائِمِ السُّجُودِ وَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَسْجُدُ فِيهَا ‏.‏",
    "malay_translation": "Sujud ketika membaca Surah Sad bukanlah daripada sujud yang diperintahkan oleh Allah, tetapi aku telah melihat Rasulullah ﷺ sujud padanya."
  },
  {
    "id": 21915,
    "hadith_number": 1411,
    "tajuk_hadith": "Rasulullah ﷺ Sujud Ketika Membaca Surah Sad di Mimbar",
    "perawi_melayu": "Diriwayatkan daripada Sa'id al-Khudri:",
    "english_text": "The Messenger of Allah (ﷺ) recited surah Sad on the pulpit. When he reached the place of prostration (in the surah), he descended and prostrated himself and the people prostrated with him. When the next day came, he recited it. When he reached the place of prostration (in the surah), the people became ready for prostration. Thereupon the Messenger of Allah (ﷺ) said: This is the repentance of a Prophet ; but I saw you being ready for prostration. So he descended and prostrated himself and the people prostrated along with him.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، - يَعْنِي ابْنَ الْحَارِثِ - عَنِ ابْنِ أَبِي هِلاَلٍ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ سَعْدِ بْنِ أَبِي سَرْحٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّهُ قَالَ قَرَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ عَلَى الْمِنْبَرِ ‏{‏ ص ‏}‏ فَلَمَّا بَلَغَ السَّجْدَةَ نَزَلَ فَسَجَدَ وَسَجَدَ النَّاسُ مَعَهُ فَلَمَّا كَانَ يَوْمٌ آخَرُ قَرَأَهَا فَلَمَّا بَلَغَ السَّجْدَةَ تَشَزَّنَ النَّاسُ لِلسُّجُودِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِنَّمَا هِيَ تَوْبَةُ نَبِيٍّ وَلَكِنِّي رَأَيْتُكُمْ تَشَزَّنْتُمْ لِلسُّجُودِ ‏\"‏ ‏.‏ فَنَزَلَ فَسَجَدَ وَسَجَدُوا ‏.‏",
    "malay_translation": "Rasulullah ﷺ membaca surah Sad di atas mimbar. Apabila baginda sampai pada ayat sajadah (dalam surah itu), baginda turun lalu sujud, dan orang ramai turut sujud bersama baginda. Apabila tiba hari berikutnya, baginda membacanya lagi. Apabila baginda sampai pada ayat sajadah, orang ramai bersedia untuk sujud. Kemudian Rasulullah ﷺ bersabda: Ini adalah taubat seorang Nabi; tetapi aku melihat kamu bersedia untuk sujud. Maka baginda turun lalu sujud, dan orang ramai turut sujud bersama baginda."
  },
  {
    "id": 21916,
    "hadith_number": 1412,
    "tajuk_hadith": "Sujud Tilawah Berjemaah Semasa Pembukaan Kota Mekah",
    "perawi_melayu": "Diriwayatkan daripada Abdullah bin Umar:",
    "english_text": "In the year of Conquest the Messenger of Allah (ﷺ) recited a verse at which a prostration should be made and all the people prostrated themselves. Some were mounted, and some were prostrating themselves on the ground, and those who were mounted prostrated themselves on their hands.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ أَبُو الْجُمَاهِرِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ مُحَمَّدٍ - عَنْ مُصْعَبِ بْنِ ثَابِتِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَرَأَ عَامَ الْفَتْحِ سَجْدَةً فَسَجَدَ النَّاسُ كُلُّهُمْ مِنْهُمُ الرَّاكِبُ وَالسَّاجِدُ فِي الأَرْضِ حَتَّى إِنَّ الرَّاكِبَ لَيَسْجُدُ عَلَى يَدِهِ ‏.‏",
    "malay_translation": "Pada tahun Pembukaan Kota Mekah, Rasulullah ﷺ membaca ayat yang mana disunatkan sujud tilawah, lalu semua orang bersujud. Sebahagian mereka menunggang kenderaan, dan sebahagian lagi bersujud di atas tanah. Bahkan, orang yang menunggang kenderaan turut bersujud di atas tangan mereka."
  },
  {
    "id": 21917,
    "hadith_number": 1413,
    "tajuk_hadith": "Rasulullah ﷺ Membaca Surah dan Sujud Bersama Para Sahabat",
    "perawi_melayu": "Diriwayatkan dari Ibn 'Umar:",
    "english_text": "The Messenger of Allah (ﷺ) would recite to us a surah (according to the version of Ibn Numair) outside the prayer (the agreed version goes), then he would prostrate along with him, and none of us could find a place for his forehead.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ح وَحَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ، حَدَّثَنَا ابْنُ نُمَيْرٍ، - الْمَعْنَى - عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْرَأُ عَلَيْنَا السُّورَةَ - قَالَ ابْنُ نُمَيْرٍ فِي غَيْرِ الصَّلاَةِ ثُمَّ اتَّفَقَا - فَيَسْجُدُ وَنَسْجُدُ مَعَهُ حَتَّى لاَ يَجِدُ أَحَدُنَا مَكَانًا لِمَوْضِعِ جَبْهَتِهِ ‏.‏",
    "malay_translation": "Rasulullah ﷺ membacakan kepada kami suatu surah (menurut riwayat Ibn Numair) di luar solat (menurut kesepakatan riwayat), kemudian baginda sujud bersama kami, sehingga tidak seorang pun di antara kami yang dapat menemukan tempat untuk dahinya."
  },
  {
    "id": 21918,
    "hadith_number": 1414,
    "tajuk_hadith": "Rasulullah SAW Bertakbir dan Sujud Ketika Membaca Ayat Sajdah",
    "perawi_melayu": "Diriwayatkan dari Abdullah ibn Umar:",
    "english_text": "The Messenger of Allah (ﷺ) used to recite the Qur'an to us. When he came upon the verse containing prostration, he would utter the takbir (Allah is most great) and we would prostrate ourselves along with him.\n\n\n\nThe narrator 'Abd al-Razzaq said: Al-Thawri liked this tradition very much.\n\n\nAbu Dawud said: This was liked by him for this contains the uttering of takbir.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ الْفُرَاتِ أَبُو مَسْعُودٍ الرَّازِيُّ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْرَأُ عَلَيْنَا الْقُرْآنَ فَإِذَا مَرَّ بِالسَّجْدَةِ كَبَّرَ وَسَجَدَ وَسَجَدْنَا ‏.‏ قَالَ عَبْدُ الرَّزَّاقِ وَكَانَ الثَّوْرِيُّ يُعْجِبُهُ هَذَا الْحَدِيثُ ‏.‏ قَالَ أَبُو دَاوُدَ يُعْجِبُهُ لأَنَّهُ كَبَّرَ ‏.‏",
    "malay_translation": "Rasulullah SAW membacakan Al-Quran kepada kami. Apabila baginda sampai pada ayat yang mengandungi sujud, baginda akan mengucapkan takbir (Allahu Akbar) dan kami pun turut sujud bersama baginda. \n\n'Abd al-Razzaq berkata: Al-Thawri sangat menyukai hadis ini.\n\nAbu Dawud berkata: Beliau menyukai hadis ini kerana terdapat ucapan takbir di dalamnya."
  },
  {
    "id": 21919,
    "hadith_number": 1415,
    "tajuk_hadith": "Rasulullah SAW Bersujud dan Berdoa Ketika Membaca Al-Quran di Malam Hari",
    "perawi_melayu": "Diriwayatkan dari Aisyah, Ummul Mu'minin:",
    "english_text": "The Messenger of Allah (ﷺ) prostrated himself at night when reciting the Qur'an. He said repeatedly: My face prostrates itself to Him Who created it and brought forth its hearing and seeing by His might and power.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنْ رَجُلٍ، عَنْ أَبِي الْعَالِيَةِ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقُولُ فِي سُجُودِ الْقُرْآنِ بِاللَّيْلِ يَقُولُ فِي السَّجْدَةِ مِرَارًا ‏\n\"‏ سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ وَشَقَّ سَمْعَهُ وَبَصَرَهُ بِحَوْلِهِ وَقُوَّتِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersujud pada waktu malam ketika membaca Al-Quran. Baginda berulang kali berkata: Mukaku bersujud kepada Dia yang menciptakannya dan menjadikan pendengaran dan penglihatannya dengan daya dan kekuatan-Nya."
  },
  {
    "id": 21920,
    "hadith_number": 1416,
    "tajuk_hadith": "Larangan Sujud Selepas Solat Subuh Sehingga Matahari Terbit",
    "perawi_melayu": "Diriwayatkan oleh AbuTamimah al-Hujaymi:",
    "english_text": "When we came to Medina accompanying the caravan, I used to preach after the dawn prayer, and prostrate on account of the recitation of the Qur'an. Ibn Umar prohibited me three times, but I did not cease  doing that. He then repeated (his prohibition) saying: I prayed behind the Messenger of Allah (ﷺ), AbuBakr, Umar and Uthman, they would not prostrate (on account of the recitation of the Qur'an) till the sun had risen.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الصَّبَّاحِ الْعَطَّارُ، حَدَّثَنَا أَبُو بَحْرٍ، حَدَّثَنَا ثَابِتُ بْنُ عُمَارَةَ، حَدَّثَنَا أَبُو تَمِيمَةَ الْهُجَيْمِيُّ، قَالَ لَمَّا بَعَثْنَا الرَّكْبَ - قَالَ أَبُو دَاوُدَ يَعْنِي إِلَى الْمَدِينَةِ قَالَ - كُنْتُ أَقُصُّ بَعْدَ صَلاَةِ الصُّبْحِ فَأَسْجُدُ فَنَهَانِي ابْنُ عُمَرَ فَلَمْ أَنْتَهِ ثَلاَثَ مِرَارٍ ثُمَّ عَادَ فَقَالَ إِنِّي صَلَّيْتُ خَلْفَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَمَعَ أَبِي بَكْرٍ وَعُمَرَ وَعُثْمَانَ - رضى الله عنهم - فَلَمْ يَسْجُدُوا حَتَّى تَطْلُعَ الشَّمْسُ ‏.‏",
    "malay_translation": "Ketika kami tiba di Madinah bersama rombongan, saya biasa berkhutbah selepas solat Subuh, dan sujud kerana bacaan Al-Qur'an. Ibn Umar melarang saya sebanyak tiga kali, tetapi saya tidak berhenti melakukannya. Kemudian beliau mengulangi (larangannya) dengan berkata: Saya telah solat di belakang Rasulullah (ﷺ), Abu Bakar, Umar dan Uthman, mereka tidak akan sujud (kerana bacaan Al-Qur'an) sehingga matahari terbit."
  }
]