[
  {
    "id": 24431,
    "hadith_number": 3927,
    "tajuk_hadith": "Hamba yang Berjanji Bebas Masih Hamba Selagi Hutangnya Ada",
    "perawi_melayu": "Diceritakan oleh 'Amr bin Shu'aib",
    "english_text": "on his father's authority, told that his grandfather reported the Prophet (ﷺ) said: A slave who has entered into an agreement to purchase his freedom is a slave as long as a dirham of the agreed price remains to be paid.",
    "arabic_text": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا أَبُو بَدْرٍ، حَدَّثَنِي أَبُو عُتْبَةَ، إِسْمَاعِيلُ بْنُ عَيَّاشٍ حَدَّثَنِي سُلَيْمَانُ بْنُ سُلَيْمٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْمُكَاتَبُ عَبْدٌ مَا بَقِيَ عَلَيْهِ مِنْ مُكَاتَبَتِهِ دِرْهَمٌ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada hadis yang diriwayatkan oleh 'Amr bin Shu'aib daripada bapanya, daripada datuknya, daripada Nabi SAW, sabdanya:\" Hamba yang telah berjanji untuk membeli kebebasannya masih dianggap sebagai hamba selagi hutangnya masih ada, walaupun hanya satu dirham."
  },
  {
    "id": 24432,
    "hadith_number": 3928,
    "tajuk_hadith": "Hukum Perhambaan dan Bayaran Utang Kebebasan",
    "perawi_melayu": "Diceritakan oleh 'Amr bin Syu'aib, dari ayahnya, dari datuknya:",
    "english_text": "On his father's authority, told that his grandfather reported the Prophet (ﷺ) said: If any slave entered into an agreement to buy his freedom for one hundred uqiyahs and he pays them all but ten, he remains a slave (until he pays the remaining ten); and if a slave entered into an agreement to purchase his freedom for one hundred dinars, and he pays them all but ten dinars, he remains a slave (until he pays the remaining ten).\n\n\nAbu Dawud said: This narrator 'Abbas al-Jariri is not the same person. They said: It is misunderstanding. He is some other narrator.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي عَبْدُ الصَّمَدِ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا عَبَّاسٌ الْجُرَيْرِيُّ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَيُّمَا عَبْدٍ كَاتَبَ عَلَى مِائَةِ أُوقِيَّةٍ فَأَدَّاهَا إِلاَّ عَشْرَةَ أَوَاقٍ فَهُوَ عَبْدٌ وَأَيُّمَا عَبْدٍ كَاتَبَ عَلَى مِائَةِ دِينَارٍ فَأَدَّاهَا إِلاَّ عَشْرَةَ دَنَانِيرَ فَهُوَ عَبْدٌ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ لَيْسَ هُوَ عَبَّاسٌ الْجُرَيْرِيُّ قَالُوا هُوَ وَهَمٌ وَلَكِنَّهُ هُوَ شَيْخٌ آخَرُ ‏.‏",
    "malay_translation": "Daripada bapanya, diceritakan bahawa datuknya meriwayatkan bahawa Nabi SAW bersabda: \"Sesiapa hamba yang berjanji untuk membeli kebebasan dengan harga seratus uqiyah dan dia membayar semuanya kecuali sepuluh, maka dia tetap hamba (sehingga dia membayar sepuluh yang tinggal). Dan sesiapa hamba yang berjanji untuk membeli kebebasan dengan harga seratus dinar, dan dia membayar semuanya kecuali sepuluh dinar, maka dia tetap hamba (sehingga dia membayar sepuluh yang tinggal).\"  Abu Dawud berkata: \"'Abbas al-Jariri yang meriwayatkan ini bukanlah orang yang sama. Mereka mengatakan ini adalah kesilapan dan dia adalah seorang perawi lain.\""
  },
  {
    "id": 24433,
    "hadith_number": 3929,
    "tajuk_hadith": "Keharusan Wanita Hamba yang Dibebaskan Berhijab dari Tuannya",
    "perawi_melayu": "Umm Salamah, Ummul Mu'minin",
    "english_text": "The Messenger of Allah (ﷺ) said to us: If one of you has a slave, and he enters into an agreement to purchase his freedom, and can pay the full price, she must veil herself from him.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ نَبْهَانَ، مُكَاتَبِ أُمِّ سَلَمَةَ قَالَ سَمِعْتُ أُمَّ سَلَمَةَ، تَقُولُ قَالَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنْ كَانَ لإِحْدَاكُنَّ مُكَاتَبٌ فَكَانَ عِنْدَهُ مَا يُؤَدِّي فَلْتَحْتَجِبْ مِنْهُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda kepada kita: Jika salah seorang dari kamu mempunyai hamba wanita, dan dia telah bersetuju untuk membeli kebebasannya dan mampu membayar harga penuh, maka hendaklah dia menutup auratnya daripada lelaki tersebut."
  },
  {
    "id": 24434,
    "hadith_number": 3930,
    "tajuk_hadith": "Hukum Pembebasan dan Warisan Barirah",
    "perawi_melayu": "'Urwah meriwayatkan daripada 'Aishah yang berkata bahawa Barirah datang kepadanya meminta bantuan untuk membeli kebebasannya, dan dia belum membayar apa-apa untuk pembebasannya. 'Aishah berkata kepadanya:",
    "english_text": "Return to your people ; if you like that I make payment for the purchase of your freedom on your behalf and I shall have the right to inherit from you, I shall do so. Barirah mentioned it to her people, but they refused and said: If she wants to purchase your freedom for reward from Allah, she may do so, but the right to inherit from her shall be ours. She mentioned it to the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) said: Purchase her (freedom) and set her free, for the right of inheritance belongs to only to the one who set a person free. The Messenger of Allah (ﷺ) then stood up and said: If anyone makes a condition which is not in Allah's Book, he has no right to it, even if he stipulates it hundred times. Allah's condition is more valid and binding.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ، رضى الله عنها أَخْبَرَتْهُ أَنَّ بَرِيرَةَ جَاءَتْ عَائِشَةَ تَسْتَعِينُهَا فِي كِتَابَتِهَا وَلَمْ تَكُنْ قَضَتْ مِنْ كِتَابَتِهَا شَيْئًا فَقَالَتْ لَهَا عَائِشَةُ ارْجِعِي إِلَى أَهْلِكِ فَإِنْ أَحَبُّوا أَنْ أَقْضِيَ عَنْكِ كِتَابَتَكِ وَيَكُونَ وَلاَؤُكِ لِي فَعَلْتُ ‏.‏ فَذَكَرَتْ ذَلِكَ بَرِيرَةُ لأَهْلِهَا فَأَبَوْا وَقَالُوا إِنْ شَاءَتْ أَنْ تَحْتَسِبَ عَلَيْكِ فَلْتَفْعَلْ وَيَكُونَ لَنَا وَلاَؤُكِ ‏.‏ فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ابْتَاعِي فَأَعْتِقِي فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏ ‏.‏ ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا بَالُ أُنَاسٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ مَنِ اشْتَرَطَ شَرْطًا لَيْسَ فِي كِتَابِ اللَّهِ فَلَيْسَ لَهُ وَإِنْ شَرَطَهُ مِائَةَ مَرَّةٍ شَرْطُ اللَّهِ أَحَقُّ وَأَوْثَقُ ‏\"‏ ‏.‏",
    "malay_translation": "Kembalilah kepada keluargamu; jika mereka setuju, aku akan membeli kebebasanmu atas namaku dan aku akan berhak mewarisi dirimu. Barirah menceritakan hal ini kepada keluarganya, tetapi mereka menolak dan berkata: Jika dia ingin membeli kebebasanmu dengan pahala daripada Allah, biarlah dia berbuat demikian, tetapi hak mewarisi dirimu akan menjadi milik kami. Dia menceritakan hal ini kepada Rasulullah SAW. Rasulullah SAW bersabda: Belilah dia dan bebaskannya, kerana hak waris adalah milik orang yang membebaskannya. Kemudian Rasulullah SAW berdiri dan bersabda: Mengapa segolongan orang menetapkan syarat-syarat yang tidak terdapat dalam Kitab Allah? Barangsiapa menetapkan syarat yang tidak terdapat dalam Kitab Allah, maka tidak berhak dia atasnya, walaupun dia menetapkannya seratus kali. Syarat Allah lebih berhak dan lebih kukuh."
  },
  {
    "id": 24435,
    "hadith_number": 3931,
    "tajuk_hadith": "Permohonan Kebebasan Barirah dan Perjanjian Warisan",
    "perawi_melayu": "'Aisyah r.a. berkata:",
    "english_text": "Barirah came seeking my help to purchase her freedom. She said: I have arranged with my people to buy my freedom for nine 'uqiyahs: one to be paid annually. So help me. She ('Aishah) said: If your people are willing that I should count them ('uqiyahs) out to them all at one time and set you free and that I shall have the right to inherit from you, I shall do so. She then went to her people. The narrator then transmitted the rest of the tradition like the version of al-Zuhri. He added to the wordings of the Prophet (ﷺ) in the last: What is the matter with people that one of you says: Set free, O so-and-so, and the right of inheritance belongs to me. The right of inheritance belongs to the one who has set a person free.",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ جَاءَتْ بَرِيرَةُ لِتَسْتَعِينَ فِي كِتَابَتِهَا فَقَالَتْ إِنِّي كَاتَبْتُ أَهْلِي عَلَى تِسْعِ أَوَاقٍ فِي كُلِّ عَامٍ أُوقِيَّةٌ فَأَعِينِينِي ‏.‏ فَقَالَتْ إِنْ أَحَبَّ أَهْلُكِ أَنْ أَعُدَّهَا عَدَّةً وَاحِدَةً وَأُعْتِقَكِ وَيَكُونَ وَلاَؤُكِ لِي فَعَلْتُ ‏.‏ فَذَهَبَتْ إِلَى أَهْلِهَا وَسَاقَ الْحَدِيثَ نَحْوَ الزُّهْرِيِّ زَادَ فِي كَلاَمِ النَّبِيِّ صلى الله عليه وسلم فِي آخِرِهِ ‏\n\"‏ مَا بَالُ رِجَالٍ يَقُولُ أَحَدُهُمْ أَعْتِقْ يَا فُلاَنُ وَالْوَلاَءُ لِي إِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏ ‏.‏",
    "malay_translation": "Barirah datang meminta bantuan untuk membeli kebebasannya. Dia berkata: Saya telah membuat perjanjian dengan keluargaku untuk membeli kebebasanku dengan sembilan *uqiyah*, satu *uqiyah* setiap tahun. Tolonglah saya.  'Aisyah r.a. berkata: Jika keluargamu bersedia agar aku membayar semuanya sekaligus dan membebaskanmu, dan agar aku memiliki hak waris darimu, aku akan melakukannya. Kemudian dia pergi kepada keluarganya. Perawi kemudian menyampaikan hadis ini seperti versi al-Zuhri. Beliau menambahkan dalam perkataan Nabi SAW di akhir: \"Apa masalahnya dengan beberapa orang yang berkata: Bebaskanlah si fulan, dan hak warisan adalah milikku. Padahal hak warisan adalah milik orang yang membebaskan orang itu.\" "
  },
  {
    "id": 24436,
    "hadith_number": 3932,
    "tajuk_hadith": "Perkahwinan Nabi SAW dengan Juwayriyyah dan Kebebasan Tawanan",
    "perawi_melayu": "Dikisahkan oleh 'Aisyah, Ummul Mukminin:",
    "english_text": "Juwayriyyah, anak perempuan al-Harith ibn al-Mustaliq, telah ditakdirkan menjadi milik Thabit ibn Qays ibn Shammas, atau sepupunya.  Dia telah bersetuju untuk membeli kebebasannya. Dia seorang wanita yang sangat cantik, memikat pandangan. \n\nAisyah berkata: Kemudian, Juwayriyyah datang menemui Rasulullah SAW meminta bantuan untuk membeli kebebasannya.  Ketika dia berdiri di pintu, aku melihatnya dengan tidak senang hati. Aku menyedari bahawa Rasulullah SAW akan melihatnya dengan cara yang sama seperti aku melihatnya.  \n\nDia berkata: Wahai Rasulullah, aku Juwayriyyah, anak perempuan al-Harith, dan aku ada masalah yang tidak tersembunyi dari pandanganMu. Aku telah ditakdirkan menjadi milik Thabit ibn Qays ibn Shammas dan aku telah bersetuju untuk membeli kebebasanku. Aku datang kepadaMu untuk memohon bantuan dalam pembelian kebebasanku.  \n\nRasulullah SAW berkata: Adakah engkau berminat kepada sesuatu yang lebih baik?  Dia bertanya: Apakah itu, wahai Rasulullah?  Baginda menjawab: Aku akan membayar harga kebebasanmu dan aku akan mengahwinimu.  \n\nDia berkata: Aku bersetuju.  Aisyah berkata: Kemudian, orang ramai mengetahui bahawa Rasulullah SAW telah mengahwini Juwayriyyah. Mereka membebaskan para tawanan yang ada di tangan mereka dan berkata: Mereka adalah sanak saudara Rasulullah SAW melalui perkahwinan. Kami tidak pernah melihat wanita lain yang lebih membawa keberkatan kepada kaumnya seperti Juwayriyyah. Seratus keluarga Bani al-Mustaliq dibebaskan kerana kebaikannya. \n\nAbu Daud berkata:  Bukti ini menunjukkan bahawa seorang pemimpin Muslim boleh mengahwini seorang wanita hamba.",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى أَبُو الأَصْبَغِ الْحَرَّانِيُّ، حَدَّثَنِي مُحَمَّدٌ، - يَعْنِي ابْنَ سَلَمَةَ - عَنِ ابْنِ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ الزُّبَيْرِ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ وَقَعَتْ جُوَيْرِيَةُ بِنْتُ الْحَارِثِ بْنِ الْمُصْطَلِقِ فِي سَهْمِ ثَابِتِ بْنِ قَيْسِ بْنِ شَمَّاسٍ أَوِ ابْنِ عَمٍّ لَهُ فَكَاتَبَتْ عَلَى نَفْسِهَا وَكَانَتِ امْرَأَةً مَلاَّحَةً تَأْخُذُهَا الْعَيْنُ - قَالَتْ عَائِشَةُ رضى الله عنها - فَجَاءَتْ تَسْأَلُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي كِتَابَتِهَا فَلَمَّا قَامَتْ عَلَى الْبَابِ فَرَأَيْتُهَا كَرِهْتُ مَكَانَهَا وَعَرَفْتُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سَيَرَى مِنْهَا مِثْلَ الَّذِي رَأَيْتُ فَقَالَتْ يَا رَسُولَ اللَّهِ أَنَا جُوَيْرِيَةُ بِنْتُ الْحَارِثِ وَإِنَّمَا كَانَ مِنْ أَمْرِي مَا لاَ يَخْفَى عَلَيْكَ وَإِنِّي وَقَعْتُ فِي سَهْمِ ثَابِتِ بْنِ قَيْسِ بْنِ شَمَّاسٍ وَإِنِّي كَاتَبْتُ عَلَى نَفْسِي فَجِئْتُكَ أَسْأَلُكَ فِي كِتَابَتِي فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَهَلْ لَكِ إِلَى مَا هُوَ خَيْرٌ مِنْهُ ‏\"‏ ‏.‏ قَالَتْ وَمَا هُوَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ أُؤَدِّي عَنْكِ كِتَابَتَكِ وَأَتَزَوَّجُكِ ‏\"‏ ‏.‏ قَالَتْ قَدْ فَعَلْتُ قَالَتْ فَتَسَامَعَ - تَعْنِي النَّاسَ - أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ تَزَوَّجَ جُوَيْرِيَةَ فَأَرْسَلُوا مَا فِي أَيْدِيهِمْ مِنَ السَّبْىِ فَأَعْتَقُوهُمْ وَقَالُوا أَصْهَارُ رَسُولِ اللَّهِ صلى الله عليه وسلم فَمَا رَأَيْنَا امْرَأَةً كَانَتْ أَعْظَمَ بَرَكَةً عَلَى قَوْمِهَا مِنْهَا أُعْتِقَ فِي سَبَبِهَا مِائَةُ أَهْلِ بَيْتٍ مِنْ بَنِي الْمُصْطَلِقِ ‏.‏ قَالَ أَبُو دَاوُدَ هَذَا حُجَّةٌ فِي أَنَّ الْوَلِيَّ هُوَ يُزَوِّجُ نَفْسَهُ ‏.‏",
    "malay_translation": "Hadis ini menceritakan tentang perkahwinan Rasulullah SAW dengan Juwayriyyah binti al-Harith bin al-Mustaliq dan pembebasan para tawanan.  Juwayriyyah telah ditakdirkan menjadi milik Thabit bin Qays bin Shammas atau sepupunya.  Dia telah bersetuju untuk membeli kebebasannya. Dia terkenal cantik dan menarik. Aisyah menceritakan bahawa Juwayriyyah datang kepada Rasulullah SAW untuk memohon bantuan dalam membeli kebebasannya.  Ketika dia berdiri di pintu, Aisyah melihatnya dengan kurang senang dan menduga Rasulullah SAW juga akan berbuat demikian.  Juwayriyyah menyatakan masalahnya, bahawa dia telah ditakdirkan kepada Thabit bin Qays bin Shammas dan telah bersetuju untuk membelinya sendiri.  Dia memohon bantuan daripada Rasulullah SAW.  Rasulullah SAW menawarkan sesuatu yang lebih baik, iaitu Baginda akan membebaskannya dan mengahwininya. Juwayriyyah menerima tawaran tersebut.  Berita perkahwinan Rasulullah SAW dengan Juwayriyyah tersebar, lalu orang ramai membebaskan para tawanan yang mereka miliki dan berkata, “Mereka adalah saudara mara Rasulullah SAW melalui perkahwinan.”  Tidak pernah ada wanita yang membawa keberkatan lebih besar kepada kaumnya seperti Juwayriyyah. Seratus keluarga Bani al-Mustaliq dibebaskan kerana kebaikannya. Abu Daud berkata, ini menunjukkan bahawa seorang pemimpin Muslim boleh mengahwini wanita hamba."
  },
  {
    "id": 24437,
    "hadith_number": 3933,
    "tajuk_hadith": "Keikhlasan Perhambaan dan Ikrar Kepada Rasulullah SAW",
    "perawi_melayu": "Umm Salamah, Ummul Mu'minin",
    "english_text": "Safinah said: I was a slave of Umm Salamah, and she said: I shall emancipate you, but I stipulate that you must serve the Messenger of Allah (ﷺ) as long as you live. I said: Even if you do not make a stipulation, I shall not leave the Messenger of Allah (ﷺ). She then emancipated me and made the stipulation with me.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ سَعِيدِ بْنِ جُمْهَانَ، عَنْ سَفِينَةَ، قَالَ كُنْتُ مَمْلُوكًا لأُمِّ سَلَمَةَ فَقَالَتْ أُعْتِقُكَ وَأَشْتَرِطُ عَلَيْكَ أَنْ تَخْدُمَ رَسُولَ اللَّهِ صلى الله عليه وسلم مَا عِشْتَ ‏.‏ فَقُلْتُ إِنْ لَمْ تَشْتَرِطِي عَلَىَّ مَا فَارَقْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم مَا عِشْتُ فَأَعْتَقَتْنِي وَاشْتَرَطَتْ عَلَىَّ ‏.‏",
    "malay_translation": "Safinah berkata: Saya adalah hamba Umm Salamah.  Lalu beliau berkata: Aku akan memerdekakanmu, tetapi aku menetapkan syarat, engkau wajib melayani Rasulullah SAW selama engkau hidup.  Saya berkata: Walaupun engkau tidak menetapkan syarat, saya tidak akan meninggalkan Rasulullah SAW selama hidup saya. Lalu beliau memerdekakan saya dan menetapkan syarat tersebut kepadaku."
  },
  {
    "id": 24438,
    "hadith_number": 3934,
    "tajuk_hadith": "Kebebasan Seorang Hamba dan Keadilan Allah",
    "perawi_melayu": "Dikisahkan oleh Abu al-Malih",
    "english_text": "On his father's authority (this is AbulWalid's version): A man emancipated a share in a slave and the matter was mentioned to the Prophet (ﷺ). He said: Allah has no partner. \n\n\n\n\n\nIbn Kathir added in his version: The Prophet (ﷺ) allowed his emancipation.",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ، حَدَّثَنَا هَمَّامٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، - الْمَعْنَى - أَخْبَرَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَبِي الْمَلِيحِ، - قَالَ أَبُو الْوَلِيدِ - عَنْ أَبِيهِ، أَنَّ رَجُلاً، أَعْتَقَ شِقْصًا لَهُ مِنْ غُلاَمٍ فَذَكَرَ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ لَيْسَ لِلَّهِ شَرِيكٌ ‏\"‏ ‏.‏ زَادَ ابْنُ كَثِيرٍ فِي حَدِيثِهِ فَأَجَازَ النَّبِيُّ صلى الله عليه وسلم عِتْقَهُ ‏.‏",
    "malay_translation": "Menurut riwayat dari bapanya (ini versi Abul Walid): Seorang lelaki membebaskan sebahagian daripada hambanya dan hal itu disampaikan kepada Nabi (ﷺ). Baginda bersabda: Allah tidak ada sekutu. \n\nIbn Kathir menambahkan dalam riwayatnya: Nabi (ﷺ) membenarkan pembebasan tersebut."
  },
  {
    "id": 24439,
    "hadith_number": 3935,
    "tajuk_hadith": "Membebaskan Hamba dan Pembayaran Harga",
    "perawi_melayu": "Daripada Abu Hurairah:",
    "english_text": "A man emancipated his share in a slave. The Prophet (ﷺ) allowed his (full) emancipation, and required him to pay the rest of his price.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً، أَعْتَقَ شِقْصًا لَهُ مِنْ غُلاَمٍ فَأَجَازَ النَّبِيُّ صلى الله عليه وسلم عِتْقَهُ وَغَرَّمَهُ بَقِيَّةَ ثَمَنِهِ ‏.‏",
    "malay_translation": "Seorang lelaki membebaskan sebahagian daripada hambanya. Nabi SAW membenarkan pembebasan penuh hamba itu, dan mewajibkannya membayar baki harga."
  },
  {
    "id": 24440,
    "hadith_number": 3936,
    "tajuk_hadith": "Kebebasan Hamba yang Dimiliki Bersama",
    "perawi_melayu": "Qatadah meriwayatkan dengan sanadnya:",
    "english_text": "The Prophet (ﷺ) said: If a man emancipates a slave shared by him with another man, his emancipation rests with him (who emancipated his share). This is the version of Ibn Suwaid.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وَحَدَّثَنَا أَحْمَدُ بْنُ عَلِيِّ بْنِ سُوَيْدٍ، حَدَّثَنَا رَوْحٌ، قَالاَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، بِإِسْنَادِهِ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ أَعْتَقَ مَمْلُوكًا بَيْنَهُ وَبَيْنَ آخَرَ فَعَلَيْهِ خَلاَصُهُ ‏\"‏ ‏.‏ وَهَذَا لَفْظُ ابْنِ سُوَيْدٍ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: \"Jika seseorang membebaskan hamba yang dimiliki bersama dengan orang lain, maka kebebasan hamba itu adalah tanggungjawabnya (orang yang membebaskannya).\" Ini adalah riwayat daripada Ibn Suwaid."
  },
  {
    "id": 24441,
    "hadith_number": 3937,
    "tajuk_hadith": "Memerdekakan Hamba Sebahagian Melalui Harta",
    "perawi_melayu": "Qatadah meriwayatkan dengan sanadnya. Nabi SAW bersabda:",
    "english_text": "If anyone emancipates his share in a slave, he emancipates him (completely) by his property if he has property. The narrator Ibn al-Muthanna did not mention al-Nadr b. Anas. This is the version of Ibn Suwaid.",
    "arabic_text": "حَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي ح، وَحَدَّثَنَا أَحْمَدُ بْنُ عَلِيِّ بْنِ سُوَيْدٍ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا هِشَامُ بْنُ أَبِي عَبْدِ اللَّهِ، عَنْ قَتَادَةَ، بِإِسْنَادِهِ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ أَعْتَقَ نَصِيبًا لَهُ فِي مَمْلُوكٍ عَتَقَ مِنْ مَالِهِ إِنْ كَانَ لَهُ مَالٌ ‏\"‏ ‏.‏ وَلَمْ يَذْكُرِ ابْنُ الْمُثَنَّى النَّضْرَ بْنَ أَنَسٍ وَهَذَا لَفْظُ ابْنِ سُوَيْدٍ ‏.‏",
    "malay_translation": "Jika seseorang membebaskan sebahagian hamba sahaya yang dimilikinya, maka pembebasan itu adalah sepenuhnya daripada hartanya jika dia mempunyai harta. Perawi Ibn al-Muthanna tidak menyebut al-Nadr bin Anas. Ini adalah lafaz Ibn Suwaid."
  },
  {
    "id": 24442,
    "hadith_number": 3938,
    "tajuk_hadith": "Membebaskan Hamba: Kebebasan dan Kewajipan",
    "perawi_melayu": "Abu Hurairah meriwayatkan daripada Nabi SAW bahawa:",
    "english_text": "If anyone emancipates a share in his slave, he should completely emancipate him if he has money; but if he has none, then slave will be required to work (to pay for his freedom), but he must not be overburdened.",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبَانُ، - يَعْنِي الْعَطَّارَ - حَدَّثَنَا قَتَادَةُ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَنْ أَعْتَقَ شَقِيصًا فِي مَمْلُوكِهِ فَعَلَيْهِ أَنْ يُعْتِقَهُ كُلَّهُ إِنْ كَانَ لَهُ مَالٌ وَإِلاَّ اسْتُسْعِيَ الْعَبْدُ غَيْرَ مَشْقُوقٍ عَلَيْهِ ‏\"‏ ‏.‏",
    "malay_translation": "Sekiranya sesiapa membebaskan sebahagian hambanya, maka dia wajib membebaskan sepenuhnya hamba tersebut jika dia mempunyai harta; tetapi jika tidak, maka hamba itu perlu bekerja (untuk membayar kebebasannya), tetapi tidak boleh dibebani dengan kerja yang terlalu berat."
  },
  {
    "id": 24443,
    "hadith_number": 3939,
    "tajuk_hadith": "Kaedah Membebaskan Hamba dan Tugasnya",
    "perawi_melayu": "Abu Hurairah meriwayatkan daripada Rasulullah SAW:",
    "english_text": "If anyone emancipates his share in a slave, he is to be completely emancipated by his money if he has money. But if he has no money, a fair price for the slave should be fixed, and the slave is required to work for his master according to the proportion of his price, but he must not be overburdened.\n\n\nAbu Dawud said: In the version of both the narrators the words are \"he will be required to work and must not be overburdened\". This is the version of 'Ali.",
    "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، أَخْبَرَنَا يَزِيدُ، - يَعْنِي ابْنَ زُرَيْعٍ - ح وَحَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، - وَهَذَا لَفْظُهُ - عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ أَعْتَقَ شِقْصًا لَهُ - أَوْ شَقِيصًا لَهُ - فِي مَمْلُوكٍ فَخَلاَصُهُ عَلَيْهِ فِي مَالِهِ إِنْ كَانَ لَهُ مَالٌ فَإِنْ لَمْ يَكُنْ لَهُ مَالٌ قُوِّمَ الْعَبْدُ قِيمَةَ عَدْلٍ ثُمَّ اسْتُسْعِيَ لِصَاحِبِهِ فِي قِيمَتِهِ غَيْرَ مَشْقُوقٍ عَلَيْهِ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ فِي حَدِيثِهِمَا جَمِيعًا ‏\"‏ فَاسْتُسْعِيَ غَيْرَ مَشْقُوقٍ عَلَيْهِ ‏\"‏ ‏.‏ وَهَذَا لَفْظُ عَلِيٍّ ‏.‏",
    "malay_translation": "Sekiranya seseorang membebaskan sebahagian daripada hambanya, maka pembebasan itu hendaklah dipenuhi sepenuhnya dengan hartanya sekiranya dia mempunyai harta. Tetapi jika dia tidak mempunyai harta, maka harga hamba itu hendaklah ditentukan dengan adil. Kemudian hamba itu hendaklah bekerja untuk tuannya mengikut kadar harganya, tetapi janganlah membebani hamba itu melebihi kemampuannya.\n\nAbu Dawud berkata: Dalam kedua-dua riwayat tersebut, perkataannya ialah \"hendaklah dia bekerja tetapi janganlah membebani dia melebihi kemampuannya\". Ini adalah lafaz daripada 'Ali."
  },
  {
    "id": 24444,
    "hadith_number": 3940,
    "tajuk_hadith": "Hadis Mengenai Kewajipan Membekalkan Kerja kepada Hamba",
    "perawi_melayu": "",
    "english_text": "The tradition mentioned above by Rawh b. 'Ubadah from Sa'id b. Abu 'Arubah. In this version he did not mention the words \"the slave should be required to work.\" If has also been transmitted by Jarir b. Hazim and Musa b. Khalaf from Qatadah through the chain of Yazid b. Zurai' and to the same effect. In this version they mentioned the words \"the slave should be required to work\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى، وَابْنُ أَبِي عَدِيٍّ، عَنْ سَعِيدٍ، بِإِسْنَادِهِ وَمَعْنَاهُ ‏.‏ قَالَ أَبُو دَاوُدَ وَرَوَاهُ رَوْحُ بْنُ عُبَادَةَ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، لَمْ يَذْكُرِ السِّعَايَةَ وَرَوَاهُ جَرِيرُ بْنُ حَازِمٍ وَمُوسَى بْنُ خَلَفٍ جَمِيعًا عَنْ قَتَادَةَ، بِإِسْنَادِ يَزِيدَ بْنِ زُرَيْعٍ وَمَعْنَاهُ وَذَكَرَا فِيهِ السِّعَايَةَ ‏.‏",
    "malay_translation": "Hadis ini, yang diriwayatkan oleh Rawh bin 'Ubadah daripada Sa'id bin Abi 'Arubah, tidak menyebut perkataan \"hendaklah hamba diwajibkan bekerja\". Ia juga diriwayatkan oleh Jarir bin Hazim dan Musa bin Khalaf daripada Qatadah melalui sanad Yazid bin Zurai', dan maksudnya sama. Dalam riwayat ini, mereka menyebut perkataan \"hendaklah hamba diwajibkan bekerja\"."
  },
  {
    "id": 24445,
    "hadith_number": 3941,
    "tajuk_hadith": "Membebaskan Hamba yang Dimiliki Secara Bersama",
    "perawi_melayu": "'Abd Allah bin 'Umar meriwayatkan daripada Rasulullah SAW:",
    "english_text": "If anyone emancipates his share in slave, a fair price for the slave should be fixed, give his partners their shares, and the slave be thus emancipated. Otherwise he is emancipated to the extent of the share which he emancipated.",
    "arabic_text": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ أَعْتَقَ شِرْكًا لَهُ فِي مَمْلُوكٍ أُقِيمَ عَلَيْهِ قِيمَةَ الْعَدْلِ فَأَعْطَى شُرَكَاءَهُ حِصَصَهُمْ وَأُعْتِقَ عَلَيْهِ الْعَبْدُ وَإِلاَّ فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ ‏\"‏ ‏.‏ ‏.‏",
    "malay_translation": "Jika seseorang membebaskan sebahagian hamba yang dimilikinya secara bersama, harga yang adil untuk hamba itu perlu ditetapkan, dan dia perlu memberikan bahagian kepada rakan-rakannya, serta hamba itu dibebaskan. Jika tidak, dia hanya membebaskan sebahagian hamba itu sepadan dengan bahagian yang dibebaskannya."
  },
  {
    "id": 24446,
    "hadith_number": 3942,
    "tajuk_hadith": "Pembebasan Berdasarkan Amalan Pembebasan",
    "perawi_melayu": "Hadis ini diriwayatkan oleh Ibn 'Umar dari Nabi SAW melalui beberapa perawi, termasuk Nafi'.",
    "english_text": "He will be emancipated to the extent of the share which he emancipated, and sometimes he did not say these words.",
    "arabic_text": "حَدَّثَنَا مُؤَمَّلٌ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَاهُ قَالَ وَكَانَ نَافِعٌ رُبَّمَا قَالَ ‏\n\"‏ فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ ‏\"‏ ‏.‏ وَرُبَّمَا لَمْ يَقُلْهُ ‏.‏",
    "malay_translation": "Orang itu akan dibebaskan seberapa banyak yang ia bebaskan. Kadangkala, dia (Nafi') tidak menyebut perkataan ini."
  },
  {
    "id": 24447,
    "hadith_number": 3943,
    "tajuk_hadith": "Perihal Pembebasan Hamba dan Perkongsian Lelaki Pertama",
    "perawi_melayu": "Hadith di atas juga diriwayatkan oleh Ibn 'Umar daripada Nabi (ﷺ). Perawi Ayyub berkata:",
    "english_text": "I do not know whether the following words are part of the tradition of the Prophet (ﷺ) or Nafi' told them himself: \"Otherwise he will be emancipated to the extent of the first man's share.\"",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا الْحَدِيثِ قَالَ أَيُّوبُ فَلاَ أَدْرِي هُوَ فِي الْحَدِيثِ عَنِ النَّبِيِّ صلى الله عليه وسلم أَوْ شَىْءٌ قَالَهُ نَافِعٌ وَإِلاَّ عَتَقَ مِنْهُ مَا عَتَقَ ‏.‏",
    "malay_translation": "Aku tidak pasti sama ada perkataan berikut merupakan sebahagian daripada hadis Nabi (ﷺ) atau Nafi' yang mengucapkannya sendiri: \"Jika tidak, dia akan dibebaskan sehinggalah sama dengan bahagian lelaki pertama.\""
  },
  {
    "id": 24448,
    "hadith_number": 3944,
    "tajuk_hadith": "Membebaskan Hamba Sahaya: Nisbah dan Pembebasan Penuh",
    "perawi_melayu": "Ibn 'Umar meriwayatkan Rasulullah SAW bersabda:",
    "english_text": "If anyone emancipates his share in a slave, he should emancipate him completely if he has enough money to pay the full price ; but if he has none, he will be emancipated to the extent of his share.",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ أَعْتَقَ شِرْكًا مِنْ مَمْلُوكٍ لَهُ فَعَلَيْهِ عِتْقُهُ كُلُّهُ إِنْ كَانَ لَهُ مَا يَبْلُغُ ثَمَنَهُ وَإِنْ لَمْ يَكُنْ لَهُ مَالٌ عَتَقَ نَصِيبُهُ ‏\"‏ ‏.‏",
    "malay_translation": "Sekiranya seseorang membebaskan sebahagian daripada hamba sahayanya, dia wajib membebaskan sepenuhnya hamba tersebut jika dia mempunyai wang yang mencukupi untuk membayar harga penuh; tetapi jika dia tidak mempunyai wang, maka hanya bahagiannya yang akan dibebaskan."
  },
  {
    "id": 24449,
    "hadith_number": 3945,
    "tajuk_hadith": "Hadis yang Sama dari Nabi SAW melalui Jalan Berbeza",
    "perawi_melayu": "",
    "english_text": "The tradition mentioned above has also been transmitted by Ibn 'Umar from the Prophet (ﷺ) to the same effect as mentioned by Ibrahim b. Musa through a different chain.",
    "arabic_text": "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَى إِبْرَاهِيمَ بْنِ مُوسَى ‏.‏",
    "malay_translation": "Hadis yang disebutkan di atas juga telah disampaikan oleh Ibn 'Umar daripada Nabi SAW (ﷺ) dengan maksud yang sama seperti yang disebutkan oleh Ibrahim b. Musa melalui rangkaian sanad yang berbeza."
  },
  {
    "id": 24450,
    "hadith_number": 3946,
    "tajuk_hadith": "Perihal Pembebasan Hamba mengikut Riwayat Ibn 'Umar",
    "perawi_melayu": "",
    "english_text": "The tradition mentioned above has also been narrated by Ibn 'Umar through a different chain of transmitters to the same effect as mentioned by Malik. In this version there is no mention of the words \"otherwise he will be emancipated to the extent of the first man's share.\" His version ends \"and the slave be thus emancipated,\" to the same effect as he (Malik) mentioned.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَى مَالِكٍ وَلَمْ يَذْكُرْ ‏\"‏ وَإِلاَّ فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ ‏\"‏ ‏.‏ انْتَهَى حَدِيثُهُ إِلَى ‏\"‏ وَأُعْتِقَ عَلَيْهِ الْعَبْدُ ‏\"‏ ‏.‏ عَلَى مَعْنَاهُ ‏.‏",
    "malay_translation": "Hadis yang disebut di atas juga telah diriwayatkan oleh Ibn 'Umar melalui rantaian perawi yang berbeza, dengan makna yang sama seperti yang disebut oleh Malik. Dalam riwayat ini, tiada disebut perkataan \"jika tidak, maka ia dibebaskan sebanyak bahagian lelaki pertama.\" Riwayatnya diakhiri dengan \"dan hamba itu dibebaskan,\" dengan makna yang sama seperti yang disebut oleh Malik."
  },
  {
    "id": 24451,
    "hadith_number": 3947,
    "tajuk_hadith": "Membebaskan Hamba Sahaya Secara Beransur-ansur",
    "perawi_melayu": "Ibn 'Umar melaporkan Nabi (ﷺ) bersabda:",
    "english_text": "If a man emancipates his share in a slave, the rest will be emancipated by his money if he has enough money to pay the full price for him.",
    "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ أَعْتَقَ شِرْكًا لَهُ فِي عَبْدٍ عَتَقَ مِنْهُ مَا بَقِيَ فِي مَالِهِ إِذَا كَانَ لَهُ مَا يَبْلُغُ ثَمَنَ الْعَبْدِ ‏\"‏ ‏.‏",
    "malay_translation": "Jika seseorang membebaskan hamba sahaya yang merupakan sebahagian daripada miliknya, maka baki harga pembebasan hamba sahaya tersebut akan ditanggung oleh hartanya jika dia mempunyai wang yang mencukupi untuk membayar harga penuh untuk membebaskan hamba sahaya tersebut sepenuhnya."
  },
  {
    "id": 24452,
    "hadith_number": 3948,
    "tajuk_hadith": "Peraturan Membebaskan Hamba yang Dimiliki Bersama",
    "perawi_melayu": "Ibn 'Umar meriwayatkan daripada Nabi SAW:",
    "english_text": "If a man is shared by two men, and one of them emancipates his share, a price of the slave will be fixed, not more or less, and he will be emancipated by him in case he is rich.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم ‏\n\"‏ إِذَا كَانَ الْعَبْدُ بَيْنَ اثْنَيْنِ فَأَعْتَقَ أَحَدُهُمَا نَصِيبَهُ فَإِنْ كَانَ مُوسِرًا يُقَوَّمُ عَلَيْهِ قِيمَةً لاَ وَكْسَ وَلاَ شَطَطَ ثُمَّ يُعْتَقُ ‏\"‏ ‏.‏",
    "malay_translation": "Jika seorang hamba dipunyai bersama oleh dua orang, dan salah seorang daripada mereka membebaskan bahagiannya, maka harga hamba itu perlu ditentukan dengan harga yang adil, tidak terlalu tinggi atau terlalu rendah. Kemudian, hamba itu dibebaskan olehnya jika dia kaya."
  },
  {
    "id": 24453,
    "hadith_number": 3949,
    "tajuk_hadith": "Pembebasan Sebahagian Hamba dan Tanggungjawabnya",
    "perawi_melayu": "Diceritakan oleh ath-Thalabb:",
    "english_text": "On the authority of his father: A man emancipated his share in a slave. The Prophet (ﷺ) did not put the responsibility on him to emancipate the rest.\n\n\n\nAhmad said: The name Ibn al-Thalabb is to be pronounced with a ta' (and not with tha). As Shu'bah could not pronounce ta, he said tha.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ خَالِدٍ، عَنْ أَبِي بِشْرٍ الْعَنْبَرِيِّ، عَنِ ابْنِ التَّلِبِّ، عَنْ أَبِيهِ، أَنَّ رَجُلاً، أَعْتَقَ نَصِيبًا لَهُ مِنْ مَمْلُوكٍ فَلَمْ يُضَمِّنْهُ النَّبِيُّ صلى الله عليه وسلم ‏.‏ قَالَ أَحْمَدُ إِنَّمَا هُوَ بِالتَّاءِ - يَعْنِي التَّلِبَّ - وَكَانَ شُعْبَةُ أَلْثَغَ لَمْ يُبَيِّنِ التَّاءَ مِنَ الثَّاءِ ‏.‏",
    "malay_translation": "Berdasarkan perawi yang meriwayatkan dari bapanya: Seorang lelaki telah membebaskan bahagian hamba yang menjadi miliknya. Rasulullah SAW tidak mewajibkan padanya untuk membebaskan baki hamba itu.  Ahmad berkata: Nama Ibn al-Thalabb sepatutnya dilafazkan dengan huruf ta’ (bukan tha’).  Shu'bah tidak dapat melafazkan huruf ta’, maka dia menyebutnya dengan tha’."
  },
  {
    "id": 24454,
    "hadith_number": 3950,
    "tajuk_hadith": "Kebebasan Orang Yang Memiliki Kerabat Haram",
    "perawi_melayu": "Dikisahkan oleh Samurah:",
    "english_text": "The Prophet (ﷺ) said: (The narrator Musa said in another place: From Samurah ibn Jundub as presumed by Hammad): If anyone gets possession of a relative who is within the prohibited degrees, that person becomes free. AbuDawud said: A similar tradition has also been transmitted by Samurah from the Prophet (ﷺ) through a different chain.\n\n\n\nAbu Dawud said: Only Hammad b. Salamah has transmitted this tradition and he had doubt in it.",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، وَمُوسَى بْنُ إِسْمَاعِيلَ، قَالاَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم وَقَالَ مُوسَى فِي مَوْضِعٍ آخَرَ عَنْ سَمُرَةَ بْنِ جُنْدُبٍ فِيمَا يَحْسِبُ حَمَّادٌ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ مَلَكَ ذَا رَحِمٍ مَحْرَمٍ فَهُوَ حُرٌّ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَى مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ قَتَادَةَ وَعَاصِمٍ عَنِ الْحَسَنِ عَنْ سَمُرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَ ذَلِكَ الْحَدِيثِ ‏.‏ قَالَ أَبُو دَاوُدَ وَلَمْ يُحَدِّثْ ذَلِكَ الْحَدِيثَ إِلاَّ حَمَّادُ بْنُ سَلَمَةَ وَقَدْ شَكَّ فِيهِ ‏.‏",
    "malay_translation": "Daripada Nabi SAW, diriwayatkan (Musa berkata pada tempat lain: Dari Samurah ibn Jundub seperti yang disangka oleh Hammad): Sesiapa yang memiliki kerabat yang dilarang (dalam hubungan pernikahan), maka dia tergolong sebagai orang yang bebas. Abu Dawud berkata: Hadis yang serupa juga telah disampaikan oleh Samurah daripada Nabi SAW melalui rantaian sanad yang berbeza.  Abu Dawud turut menyatakan, hanya Hammad bin Salamah yang meriwayatkan hadis ini, dan beliau sendiri ragu-ragu terhadapnya."
  },
  {
    "id": 24455,
    "hadith_number": 3951,
    "tajuk_hadith": "Kebebasan Bagi Yang Mempunyai Kerabat Haram",
    "perawi_melayu": "Dikisahkan oleh Umar ibn al-Khattab:",
    "english_text": "Qatadah reported Umar ibn al-Khattab (may Allah be pleased with him) as saying: If anyone gets possession of a relative who is within the prohibited degrees, that person becomes free.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الأَنْبَارِيُّ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، - رضى الله عنه - قَالَ مَنْ مَلَكَ ذَا رَحِمٍ مَحْرَمٍ فَهُوَ حُرٌّ ‏.‏",
    "malay_translation": "Qatadah meriwayatkan bahawa Umar ibn al-Khattab (radhiallahu 'anhu) bersabda: Sesiapa yang memiliki kerabat yang berada dalam darjah larangan (mahram), maka dia bebas."
  },
  {
    "id": 24456,
    "hadith_number": 3952,
    "tajuk_hadith": "Kebebasan Melalui Kerabat yang Dilarang",
    "perawi_melayu": "Qatadah meriwayatkan daripada 'Umar bin al-Khattab (ra) bahawa:",
    "english_text": "If anyone gets possession of a relative who is within the prohibited degrees, that person becomes free.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، قَالَ مَنْ مَلَكَ ذَا رَحِمٍ مَحْرَمٍ فَهُوَ حُرٌّ ‏.‏",
    "malay_translation": "Jika seseorang memiliki kerabat yang terlarang, maka dia dibebaskan."
  },
  {
    "id": 24457,
    "hadith_number": 3953,
    "tajuk_hadith": "Perawi yang Lebih Teliti dalam Menjaga Hadis",
    "perawi_melayu": "Perawi tersebut, Sa'id, lebih teliti dalam menyampaikan hadis berbanding Hammad.",
    "english_text": "The narrator sa'id retained te tradition more carefully than Hammad.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ جَابِرِ بْنِ زَيْدٍ، وَالْحَسَنِ، مِثْلَهُ ‏.‏ قَالَ أَبُو دَاوُدَ سَعِيدٌ أَحْفَظُ مِنْ حَمَّادٍ ‏.‏",
    "malay_translation": "Perawi Sa'id telah menyampaikan hadis ini dengan lebih teliti dan cermat berbanding Hammad.  Abu Dawud menyatakan bahawa Sa'id lebih hafalan berbanding Hammad."
  },
  {
    "id": 24458,
    "hadith_number": 3954,
    "tajuk_hadith": "Pengampunan dan Penyelesaian Permasalahan Perhambaan dalam Islam",
    "perawi_melayu": "Dikisahkan oleh Sulamah binti Ma'qil al-Qasiyyah:",
    "english_text": "My uncle brought me (to Medina) in the pre-Islamic days. He sold me to al-Hubab ibn Amr, brother of AbulYusr ibn Amr. I bore a child, AbdurRahman ibn al-Hubab, to him and he (al-Hubab) then died.  \n\n\n\n\n\nThereupon his wife said: I swear by Allah, now you will be sold (as a repayment) for his loan.  \n\n\n\n\n\nSo I came to the Messenger of Allah (ﷺ) and said: Messenger of Allah! I am a woman of Banu Kharijah Qays ibn Aylan. My uncle had brought me to Medina in pre-Islamic days. He sold me to al-Hubab ibn Amr, brother of AbulYusr ibn Amr. I bore AbdurRahman ibn al-Hubab to him. His wife said: I swear by Allah, you will be sold for his loan.  \n\n\n\n\n\nThe Messenger of Allah (ﷺ) said: Who is the guardian of al-Hubab?  \n\n\n\n\n\nHe was told: His brother, AbulYusr ibn Amr. He then sent for him and said: Set her free; when you hear that some slaves have been brought to me, came to me, and I shall compensate you for her.  \n\n\n\n\n\nShe said: They set me free, and when some slaves were brought to the Messenger of Allah (ﷺ), he gave them a slave in compensation for me.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ خَطَّابِ بْنِ صَالِحٍ، مَوْلَى الأَنْصَارِيِّ عَنْ أُمِّهِ، عَنْ سَلاَمَةَ بِنْتِ مَعْقِلٍ، - امْرَأَةٍ مِنْ خَارِجَةِ قَيْسِ عَيْلاَنَ - قَالَتْ قَدِمَ بِي عَمِّي فِي الْجَاهِلِيَّةِ فَبَاعَنِي مِنَ الْحُبَابِ بْنِ عَمْرٍو أَخِي أَبِي الْيَسَرِ بْنِ عَمْرٍو فَوَلَدْتُ لَهُ عَبْدَ الرَّحْمَنِ بْنَ الْحُبَابِ ثُمَّ هَلَكَ فَقَالَتِ امْرَأَتُهُ الآنَ وَاللَّهِ تُبَاعِينَ فِي دَيْنِهِ فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي امْرَأَةٌ مِنْ خَارِجَةِ قَيْسِ عَيْلاَنَ قَدِمَ بِي عَمِّي الْمَدِينَةَ فِي الْجَاهِلِيَّةِ فَبَاعَنِي مِنَ الْحُبَابِ بْنِ عَمْرٍو أَخِي أَبِي الْيَسَرِ بْنِ عَمْرٍو فَوَلَدْتُ لَهُ عَبْدَ الرَّحْمَنِ بْنَ الْحُبَابِ فَقَالَتِ امْرَأَتُهُ الآنَ وَاللَّهِ تُبَاعِينَ فِي دَيْنِهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ وَلِيُّ الْحُبَابِ ‏\"‏ ‏.‏ قِيلَ أَخُوهُ أَبُو الْيَسَرِ بْنُ عَمْرٍو فَبَعَثَ إِلَيْهِ فَقَالَ ‏\"‏ أَعْتِقُوهَا فَإِذَا سَمِعْتُمْ بِرَقِيقٍ قَدِمَ عَلَىَّ فَأْتُونِي أُعَوِّضْكُمْ مِنْهَا ‏\"‏ ‏.‏ قَالَتْ فَأَعْتَقُونِي وَقَدِمَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم رَقِيقٌ فَعَوَّضَهُمْ مِنِّي غُلاَمًا ‏.‏",
    "malay_translation": "Diceritakan oleh Sulamah binti Ma'qil al-Qasiyyah, seorang wanita dari Bani Kharijah Qays ibn Aylan.  Dia menceritakan, \"Ayahku membawa saya ke Madinah pada zaman Jahiliah. Dia menjual saya kepada Al-Hubab bin Amr, saudara lelaki Abu al-Yasir bin Amr. Saya melahirkan seorang anak lelaki bernama AbdurRahman bin Al-Hubab untuknya, tetapi kemudian Al-Hubab meninggal dunia.\n\nIsterinya berkata, 'Demi Allah, sekarang engkau akan dijual untuk melunaskan hutangnya.'\n\nLalu saya pergi menemui Rasulullah SAW dan berkata, 'Wahai Rasulullah, saya seorang wanita dari Bani Kharijah Qays ibn Aylan. Ayahku membawa saya ke Madinah pada zaman Jahiliah. Dia menjual saya kepada Al-Hubab bin Amr, saudara lelaki Abu al-Yasir bin Amr. Saya melahirkan seorang anak lelaki bernama AbdurRahman bin Al-Hubab untuknya. Isterinya berkata, 'Demi Allah, sekarang engkau akan dijual untuk melunaskan hutangnya.'\n\nRasulullah SAW bertanya, 'Siapakah wali Al-Hubab?'\n\nDijawab, 'Saudaranya, Abu al-Yasir bin Amr.'  Kemudian Rasulullah SAW menghantar utusan kepada Abu al-Yasir dan berkata, 'Bebaskan dia. Apabila kamu mendengar bahawa ada hamba yang dibawa kepadaKu, datanglah kepadaKu dan Aku akan menggantikannya.'\n\nSulamah binti Ma'qil berkata, 'Mereka membebaskanku. Kemudian datanglah hamba-hamba kepada Rasulullah SAW dan Baginda menggantikan mereka dengan seorang hamba lelaki untukku.'\""
  },
  {
    "id": 24459,
    "hadith_number": 3955,
    "tajuk_hadith": "Larangan Jual Beli Ibu Anak pada Masa Khalifah Umar",
    "perawi_melayu": "Dikisahkan oleh Jabir ibn Abdullah:",
    "english_text": "We sold slave-mothers during the time of the Messenger of Allah (ﷺ) and of AbuBakr. When Umar was in power, he forbade us and we stopped.",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ قَيْسٍ، عَنْ عَطَاءٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ بِعْنَا أُمَّهَاتِ الأَوْلاَدِ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَبِي بَكْرٍ فَلَمَّا كَانَ عُمَرُ نَهَانَا فَانْتَهَيْنَا ‏.‏",
    "malay_translation": "Kami menjual ibu-ibu hamba abdi pada zaman Rasulullah SAW dan Abu Bakar.  Apabila Umar al-Khattab menjadi khalifah, baginda melarang amalan tersebut dan kami berhenti melakukannya."
  },
  {
    "id": 24460,
    "hadith_number": 3956,
    "tajuk_hadith": "Membebaskan Hamba dengan Harta yang Terbatas",
    "perawi_melayu": "Jabir bin Abdullah berkata:",
    "english_text": "A man declared that his slave would be free after his death, but he had no other property. So the Prophet (ﷺ) ordered (to sell him). He was then sold for seven hundred or nine hundred (dirhams).",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا هُشَيْمٌ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ، عَنْ عَطَاءٍ، وَإِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ عَطَاءٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَجُلاً، أَعْتَقَ غُلاَمًا لَهُ عَنْ دُبُرٍ مِنْهُ وَلَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُ فَأَمَرَ بِهِ النَّبِيُّ صلى الله عليه وسلم فَبِيعَ بِسَبْعِمِائَةٍ أَوْ بِتِسْعِمِائَةٍ ‏.‏",
    "malay_translation": "Seorang lelaki telah menuntut pembebasan hambanya selepas kematiannya, tetapi dia tidak mempunyai harta lain. Oleh itu, Nabi SAW memerintahkan agar hamba tersebut dijual.  Kemudian, hamba itu dijual dengan harga tujuh ratus atau sembilan ratus dirham."
  },
  {
    "id": 24461,
    "hadith_number": 3957,
    "tajuk_hadith": "Hak Hakikat Pemilik Harga Barang dan Kekayaan Allah",
    "perawi_melayu": "Jabir bin Abdullah melalui beberapa jalur periwayatan",
    "english_text": "The Prophet (ﷺ) said: You are more entitled to his price, and Allah has no need of it.",
    "arabic_text": "حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ، حَدَّثَنَا بِشْرُ بْنُ بَكْرٍ، أَخْبَرَنَا الأَوْزَاعِيُّ، حَدَّثَنِي عَطَاءُ بْنُ أَبِي رَبَاحٍ، حَدَّثَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ، بِهَذَا زَادَ وَقَالَ - يَعْنِي النَّبِيَّ صلى الله عليه وسلم - ‏\n\"‏ أَنْتَ أَحَقُّ بِثَمَنِهِ وَاللَّهُ أَغْنَى عَنْهُ ‏\"‏ ‏.‏",
    "malay_translation": "Nabi SAW bersabda: \"Kamu lebih berhak atas harganya, dan Allah tidak memerlukannya.\" "
  },
  {
    "id": 24462,
    "hadith_number": 3958,
    "tajuk_hadith": "Cara Menguruskan Harta yang Terbatas dalam Islam",
    "perawi_melayu": "Jabir berkata:",
    "english_text": "A man of the Ansar called Abu Madhkur declared that his slave called Ya'qub would be free after his death, but he had no other property. So the Messenger of Allah (ﷺ) called him and said: Who will buy him ? Nu'aim b. 'Abd Allah b. al-Nahham bought him for eight hundred dirhams. When he handed them over to him, he  (Prophet) said: If any of you is poor, he should begin from himself ; if anything is left over, give it to your family; if anything is left over, give it to your relatives ; if anything is left over (when they received something), then here and here.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَجُلاً، مِنَ الأَنْصَارِ يُقَالُ لَهُ أَبُو مَذْكُورٍ أَعْتَقَ غُلاَمًا لَهُ يُقَالُ لَهُ يَعْقُوبُ عَنْ دُبُرٍ وَلَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُ فَدَعَا بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَنْ يَشْتَرِيهِ ‏\"‏ ‏.‏ فَاشْتَرَاهُ نُعَيْمُ بْنُ عَبْدِ اللَّهِ بْنِ النَّحَّامِ بِثَمَانِمِائَةِ دِرْهَمٍ فَدَفَعَهَا إِلَيْهِ ثُمَّ قَالَ ‏\"‏ إِذَا كَانَ أَحَدُكُمْ فَقِيرًا فَلْيَبْدَأْ بِنَفْسِهِ فَإِنْ كَانَ فِيهَا فَضْلٌ فَعَلَى عِيَالِهِ فَإِنْ كَانَ فِيهَا فَضْلٌ فَعَلَى ذِي قَرَابَتِهِ ‏\"‏ ‏.‏ أَوْ قَالَ ‏\"‏ عَلَى ذِي رَحِمِهِ فَإِنْ كَانَ فَضْلاً فَهَا هُنَا وَهَا هُنَا ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki daripada kalangan Ansar yang dikenali sebagai Abu Madhkur telah membebaskan hambanya yang bernama Ya'qub selepas kematiannya, tetapi dia tidak mempunyai harta lain.  Maka, Rasulullah SAW memanggilnya dan bertanya, \"Siapakah yang ingin membelinya?\"  Kemudian, Nu'aim bin 'Abd Allah bin al-Nahham membelinya dengan harga lapan ratus dirham.  Selepas penyerahan bayaran, baginda SAW bersabda, \"Jika di antara kalian ada yang miskin, hendaklah dia mulakan dengan dirinya sendiri. Jika masih ada lebihan, berikan kepada keluarganya. Jika masih ada lebihan, berikan kepada sanak saudara terdekatnya. Jika masih ada lebihan, maka bagikan kepada mereka yang layak menerima.\" "
  },
  {
    "id": 24463,
    "hadith_number": 3959,
    "tajuk_hadith": "Perbuatan Membebaskan Hamba Tetapi Tidak Seimbang Dengan Keadaan",
    "perawi_melayu": "'Imran bin Husain berkata:",
    "english_text": "A man who had no other property emancipated six slaves of his at the time of the death. When the Prophet (ﷺ) was informed about it, he spoke severely of him. He then called them, divided them into three sections, cast lots among them, and emancipated two and kept four in slavery.",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الْمُهَلَّبِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّ رَجُلاً، أَعْتَقَ سِتَّةَ أَعْبُدٍ عِنْدَ مَوْتِهِ وَلَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُمْ فَبَلَغَ ذَلِكَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ لَهُ قَوْلاً شَدِيدًا ثُمَّ دَعَاهُمْ فَجَزَّأَهُمْ ثَلاَثَةَ أَجْزَاءٍ فَأَقْرَعَ بَيْنَهُمْ فَأَعْتَقَ اثْنَيْنِ وَأَرَقَّ أَرْبَعَةً ‏.‏",
    "malay_translation": "Seorang lelaki yang tidak memiliki harta selain enam orang hamba membebaskan mereka semua di saat kematiannya.  Ketika Nabi (ﷺ) mengetahui hal itu, baginda menyampaikan teguran yang tegas. Kemudian, baginda memanggil mereka, membahagikan mereka kepada tiga bahagian, melempar undi di antara mereka, dan membebaskan dua orang dan mengekalkan empat orang dalam perhambaan."
  },
  {
    "id": 24464,
    "hadith_number": 3960,
    "tajuk_hadith": "Hadis tentang Perkataan Keras Nabi SAW kepada Orang-orang",
    "perawi_melayu": "",
    "english_text": "Tradisi yang disebutkan di atas juga telah disampaikan oleh Abu Qilabah melalui rangkaian perawi yang berbeza dengan sanad yang berbeza, berdasarkan perkataan 'Imran bin Husain dengan maksud yang sama. Tetapi dalam versi ini, beliau tidak menyebut \"Beliau berbicara keras kepada mereka.\"",
    "arabic_text": "حَدَّثَنَا أَبُو كَامِلٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ الْمُخْتَارِ - حَدَّثَنَا خَالِدٌ، عَنْ أَبِي قِلاَبَةَ، بِإِسْنَادِهِ وَمَعْنَاهُ وَلَمْ يَقُلْ فَقَالَ لَهُ قَوْلاً شَدِيدًا ‏.‏",
    "malay_translation": "Hadis yang disebutkan sebelum ini juga telah diriwayatkan oleh Abu Qilabah melalui sanad yang berbeza, berdasarkan riwayat 'Imran bin Husain dengan maksud yang sama. Tetapi dalam versi ini, beliau tidak menyebut bahawa Nabi SAW telah berkata dengan tegas kepada mereka."
  },
  {
    "id": 24465,
    "hadith_number": 3961,
    "tajuk_hadith": "Larangan Menguburkan Sesuatu Jasad di Tanah Perkuburan Muslim",
    "perawi_melayu": "Hadis ini juga diriwayatkan oleh Abu Qilabah daripada Abu Zaid melalui rantaian perawi yang berbeza dengan maksud yang sama:",
    "english_text": "A man of the Ansar ... The Prophet (ﷺ) said: Had I been present before his burial, he would not have been buried in a Muslim cemetry.",
    "arabic_text": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، - هُوَ الطَّحَّانُ - عَنْ خَالِدٍ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي زَيْدٍ، أَنَّ رَجُلاً، مِنَ الأَنْصَارِ بِمَعْنَاهُ وَقَالَ - يَعْنِي النَّبِيَّ صلى الله عليه وسلم - ‏\n\"‏ لَوْ شَهِدْتُهُ قَبْلَ أَنْ يُدْفَنَ لَمْ يُدْفَنْ فِي مَقَابِرِ الْمُسْلِمِينَ ‏\"‏ ‏.‏",
    "malay_translation": "Seseorang lelaki daripada kalangan Ansar… Nabi SAW bersabda, \"Sekiranya Aku hadir sebelum dia dikebumikan, dia tidak akan dikuburkan di tanah perkuburan umat Islam.\""
  },
  {
    "id": 24466,
    "hadith_number": 3962,
    "tajuk_hadith": "Pembebasan Hamba dan Pengagihan Harta Warisan",
    "perawi_melayu": "'Imran bin Husain berkata:",
    "english_text": "A man emancipated six slaves at the time of his death and he had no other property. The Prophet (ﷺ) was informed about it. He cast lots among them, emancipated two and retained four in slavery.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ يَحْيَى بْنِ عَتِيقٍ، وَأَيُّوبَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّ رَجُلاً، أَعْتَقَ سِتَّةَ أَعْبُدٍ عِنْدَ مَوْتِهِ وَلَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُمْ فَبَلَغَ ذَلِكَ النَّبِيَّ صلى الله عليه وسلم فَأَقْرَعَ بَيْنَهُمْ فَأَعْتَقَ اثْنَيْنِ وَأَرَقَّ أَرْبَعَةً ‏.‏",
    "malay_translation": "Seorang lelaki membebaskan enam orang hamba pada waktu kematiannya dan tidak memiliki harta lain selain mereka. Hal tersebut diberitahu kepada Nabi SAW. Baginda mengundi di antara mereka, lalu membebaskan dua orang dan mengekalkan empat orang sebagai hamba."
  },
  {
    "id": 24467,
    "hadith_number": 3963,
    "tajuk_hadith": "Pembebasan Hamba dan Harta Miliknya",
    "perawi_melayu": "'Abd Allah bin 'Umar meriwayatkan dari Rasulullah SAW:",
    "english_text": "If anyone emancipates a slave who has property, the property of the slave belongs to him except that the master makes a stipulation.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي ابْنُ لَهِيعَةَ، وَاللَّيْثُ بْنُ سَعْدٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ، عَنْ بُكَيْرِ بْنِ الأَشَجِّ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ أَعْتَقَ عَبْدًا وَلَهُ مَالٌ فَمَالُ الْعَبْدِ لَهُ إِلاَّ أَنْ يَشْتَرِطَهُ السَّيِّدُ ‏\"‏ ‏.‏",
    "malay_translation": "Jika seseorang membebaskan hamba yang memiliki harta, maka harta hamba tersebut adalah miliknya kecuali jika tuannya menetapkan syarat lain."
  },
  {
    "id": 24468,
    "hadith_number": 3964,
    "tajuk_hadith": "Anak Zina, Yang Paling Tercela",
    "perawi_melayu": "Riwayat Abu Hurairah",
    "english_text": "The Prophet (ﷺ) said: The child of adultery is worst of the three.\n\n\n\n\nAbu Hurairah said: That I give a flog in the path of Allah (as a charity) is dearer to me than emancipating a child of adultery.",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا جَرِيرٌ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ وَلَدُ الزِّنَا شَرُّ الثَّلاَثَةِ ‏\"‏ ‏.‏ وَقَالَ أَبُو هُرَيْرَةَ لأَنْ أُمَتِّعَ بِسَوْطٍ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ أَحَبُّ إِلَىَّ مِنْ أَنْ أَعْتِقَ وَلَدَ زِنْيَةٍ ‏.‏",
    "malay_translation": "Nabi SAW bersabda: Anak zina adalah yang paling tercela daripada tiga (jenis) anak tersebut. \n\nAbu Hurairah berkata: Memberi sebat di jalan Allah (sebagai sedekah) lebih aku sukai daripada membebaskan hamba anak zina."
  },
  {
    "id": 24469,
    "hadith_number": 3965,
    "tajuk_hadith": "Membebaskan Hamba untuk Menebus Hukuman Neraka",
    "perawi_melayu": "Dikisahkan oleh Wathilah ibn al-Asqa",
    "english_text": "Al-Arif ibn ad-Daylami said: We went to Wathilah ibn al-Asqa and said to him: Tell us a tradition which has not addition or omission. He became angry and replied: One of you recites when his copy of a Qur'an is hung up in his house, and he makes additions and omissions. We said: All we mean is a tradition you have heard from the Messenger of Allah (ﷺ). He said: We went to the Prophet (ﷺ) about a friend of ours who deserved. Hell for murder. He said: Emancipate a slave on his behalf; Allah will set free from Hell a member of the body for every member of his.",
    "arabic_text": "حَدَّثَنَا عِيسَى بْنُ مُحَمَّدٍ الرَّمْلِيُّ، حَدَّثَنَا ضَمْرَةُ، عَنْ إِبْرَاهِيمَ بْنِ أَبِي عَبْلَةَ، عَنِ الْغَرِيفِ بْنِ الدَّيْلَمِيِّ، قَالَ أَتَيْنَا وَاثِلَةَ بْنَ الأَسْقَعِ فَقُلْنَا لَهُ حَدِّثْنَا حَدِيثًا، لَيْسَ فِيهِ زِيَادَةٌ وَلاَ نُقْصَانٌ فَغَضِبَ وَقَالَ إِنَّ أَحَدَكُمْ لَيَقْرَأُ وَمُصْحَفُهُ مُعَلَّقٌ فِي بَيْتِهِ فَيَزِيدُ وَيَنْقُصُ ‏.‏ قُلْنَا إِنَّمَا أَرَدْنَا حَدِيثًا سَمِعْتَهُ مِنَ النَّبِيِّ صلى الله عليه وسلم ‏.‏ قَالَ أَتَيْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم فِي صَاحِبٍ لَنَا أَوْجَبَ - يَعْنِي - النَّارَ بِالْقَتْلِ فَقَالَ ‏\n\"‏ أَعْتِقُوا عَنْهُ يُعْتِقِ اللَّهُ بِكُلِّ عُضْوٍ مِنْهُ عُضْوًا مِنْهُ مِنَ النَّارِ ‏\"‏ ‏.‏",
    "malay_translation": "Al-Arif bin ad-Daylami meriwayatkan: Kami menemui Wathilah bin al-Asqa dan berkata kepadanya, \"Ceritakan hadis yang tiada tambahan dan kekurangan.\" Beliau menjadi marah dan menjawab, \"Sesungguhnya di antara kamu ada yang membaca Al-Quran yang digantung di rumahnya, namun menambahkan atau mengurangkan ayatnya.\" Kami berkata, \"Yang kami maksudkan hanyalah hadis yang anda dengar daripada Rasulullah SAW.\" Beliau berkata, \"Kami menemui Rasulullah SAW mengenai sahabat kami yang telah melakukan pembunuhan sehingga berhak mendapat azab neraka. Baginda bersabda, \"Bebaskan seorang hamba untuknya, maka Allah akan membebaskan satu anggota badannya daripada azab neraka untuk setiap anggota badannya.\" "
  },
  {
    "id": 24470,
    "hadith_number": 3966,
    "tajuk_hadith": "Kebebasan Membebaskan Dan Pahala Dalam Jihad",
    "perawi_melayu": "Dikisahkan oleh Abu Najih al-Sulami:",
    "english_text": "Along with the Messenger of Allah (ﷺ) we besieged the palace of at-Ta'if. The narrator, Mutadh, said: I heard my father (sometimes) say: \"Palace of at-Ta'if,\" and (sometimes) \"Fort of at-Ta'if,\" which are the same.  \n\n\n\n\n\nI heard the Messenger of Allah (ﷺ) say: he who causes an arrow to hit its mark in Allah's cause will have it counted as a degree for him (in Paradise). He then transmitted the rest of the tradition.  \n\n\n\n\n\nI heard the Messenger of Allah (ﷺ) say: If a Muslim man emancipates a Muslim man, Allah, the Exalted, will make  every bone of his protection for every bone of his emancipator from Hell; and if a Muslim woman emancipates a Muslim woman, Allah will make every bone of hers protection for every bone of her emancipator from Hell on the Day of Resurrection.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ الْيَعْمَرِيِّ، عَنْ أَبِي نَجِيحٍ السُّلَمِيِّ، قَالَ حَاصَرْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِقَصْرِ الطَّائِفِ - قَالَ مُعَاذٌ سَمِعْتُ أَبِي يَقُولُ بِقَصْرِ الطَّائِفِ بِحِصْنِ الطَّائِفِ كُلُّ ذَلِكَ - فَسَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَنْ بَلَغَ بِسَهْمٍ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ فَلَهُ دَرَجَةٌ ‏\"‏ ‏.‏ وَسَاقَ الْحَدِيثَ وَسَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ أَيُّمَا رَجُلٍ مُسْلِمٍ أَعْتَقَ رَجُلاً مُسْلِمًا فَإِنَّ اللَّهَ عَزَّ وَجَلَّ جَاعِلٌ وِقَاءَ كُلِّ عَظْمٍ مِنْ عِظَامِهِ عَظْمًا مِنْ عِظَامِ مُحَرَّرِهِ مِنَ النَّارِ وَأَيُّمَا امْرَأَةٍ أَعْتَقَتِ امْرَأَةً مُسْلِمَةً فَإِنَّ اللَّهَ جَاعِلٌ وِقَاءَ كُلِّ عَظْمٍ مِنْ عِظَامِهَا عَظْمًا مِنْ عِظَامِ مُحَرَّرِهَا مِنَ النَّارِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Kami bersama Rasulullah SAW telah mengepung istana Taif. Perawi, Mutadh, berkata: Saya mendengar ayah saya (kadang-kadang) berkata: \"Istana Taif,\" dan (kadang-kadang) \"Benteng Taif,\" yang sama maknanya. \n\nSaya mendengar Rasulullah SAW bersabda: Barangsiapa yang menembakkan anak panah tepat pada sasaran dalam jalan Allah, maka baginya satu darjat (di Syurga). Kemudian dia menyampaikan hadis yang lain. \n\nSaya mendengar Rasulullah SAW bersabda: Setiap lelaki Muslim yang membebaskan seorang lelaki Muslim, maka Allah SWT akan menjadikan setiap tulang perlindungannya untuk setiap tulang penyebebasannya dari neraka. Dan setiap wanita Muslim yang membebaskan seorang wanita Muslim, maka Allah akan menjadikan setiap tulang perlindungannya untuk setiap tulang penyebebasannya dari neraka pada hari kiamat."
  },
  {
    "id": 24471,
    "hadith_number": 3967,
    "tajuk_hadith": "Membebaskan Hamba Muslim sebagai Penebus Azab Neraka",
    "perawi_melayu": "Amr ibn Abasah, katanya Marrah ibn Ka'b berkata:",
    "english_text": "I heard the Messenger of Allah (ﷺ) say: If anyone emancipates a Muslim slave, that will be his ransom from Jahannam.",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ نَجْدَةَ، حَدَّثَنَا بَقِيَّةُ، حَدَّثَنَا صَفْوَانُ بْنُ عَمْرٍو، حَدَّثَنِي سُلَيْمُ بْنُ عَامِرٍ، عَنْ شُرَحْبِيلَ بْنِ السِّمْطِ، أَنَّهُ قَالَ لِعَمْرِو بْنِ عَبَسَةَ حَدِّثْنَا حَدِيثًا، سَمِعْتَهُ مِنْ، رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ أَعْتَقَ رَقَبَةً مُؤْمِنَةً كَانَتْ فِدَاءَهُ مِنَ النَّارِ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda: \"Barangsiapa yang membebaskan hamba Muslim, maka ia akan menjadi penebus dirinya daripada azab neraka."
  },
  {
    "id": 24472,
    "hadith_number": 3968,
    "tajuk_hadith": "Membebaskan Wanita Muslim Dari Api Neraka Melalui Perhambaan",
    "perawi_melayu": "Hadis ini diriwayatkan oleh Mu'adh melalui rantaian perawi yang berbeza.  Setelah menyebut perkataan \"Jika seorang Muslim membebaskan hamba Muslim... dan jika seorang wanita membebaskan wanita Muslim\", versi ini menambah:",
    "english_text": "\"If a man emancipates two Muslim women, they will be deliverance from Hell fire; two bones of their will be emancipation for each of his bone.\"\n\n\nAbu Dawud said: Salim did not hear (traditions) from Shurahbil. Shurahbil died at Siffin.",
    "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ شُرَحْبِيلَ بْنِ السِّمْطِ، أَنَّهُ قَالَ لِكَعْبِ بْنِ مُرَّةَ أَوْ مُرَّةَ بْنِ كَعْبٍ حَدِّثْنَا حَدِيثًا، سَمِعْتَهُ مِنْ، رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ مَعْنَى مُعَاذٍ إِلَى قَوْلِهِ ‏\"‏ وَأَيُّمَا امْرِئٍ أَعْتَقَ مُسْلِمًا وَأَيُّمَا امْرَأَةٍ أَعْتَقَتِ امْرَأَةً مُسْلِمَةً ‏\"‏ ‏.‏ زَادَ ‏\"‏ وَأَيُّمَا رَجُلٍ أَعْتَقَ امْرَأَتَيْنِ مُسْلِمَتَيْنِ إِلاَّ كَانَتَا فِكَاكَهُ مِنَ النَّارِ يُجْزَى مَكَانَ كُلِّ عَظْمَيْنِ مِنْهُمَا عَظْمٌ مِنْ عِظَامِهِ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ سَالِمٌ لَمْ يَسْمَعْ مِنْ شُرَحْبِيلَ مَاتَ شُرَحْبِيلُ بِصِفِّينَ ‏.‏",
    "malay_translation": "\"Jika seorang lelaki membebaskan dua wanita Muslim, mereka akan terlepas dari api neraka; dua tulang mereka akan menjadi penebus bagi setiap tulang miliknya.\"\n\nAbu Dawud berkata: Salim tidak mendengar (hadis) daripada Shurahbil. Shurahbil meninggal di Siffin."
  },
  {
    "id": 24473,
    "hadith_number": 3969,
    "tajuk_hadith": "Perumpamaan Membebaskan Hamba pada Saat Kematian",
    "perawi_melayu": "Dikisahkan oleh Abu Darda':",
    "english_text": "The Prophet (ﷺ) said: the similitude of a man who emancipates a slave at the time of his death is like that of a man who gives a present after satisfying his appetite.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي حَبِيبَةَ الطَّائِيِّ، عَنْ أَبِي الدَّرْدَاءِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَثَلُ الَّذِي يُعْتِقُ عِنْدَ الْمَوْتِ كَمَثَلِ الَّذِي يُهْدِي إِذَا شَبِعَ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Perumpamaan orang yang membebaskan hamba pada saat ajalnya seperti orang yang memberi hadiah setelah kenyang.\" "
  }
]