[
  {
    "id": 24784,
    "hadith_number": 4280,
    "tajuk_hadith": "Ketetapan Agama dan Dua Belas Khalifah dari Quraisy",
    "perawi_melayu": "Dikisahkan oleh Jabir ibn Samurah:",
    "english_text": "The Prophet (ﷺ) said: The religion will continue to be established till there are twelve caliphs over you, and the whole community will agree on each of them. I then heard from the Prophet (ﷺ) some remarks which I could not understand. I asked my father: What is he saying: He said: all of them will belong to Quraysh.",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، عَنْ إِسْمَاعِيلَ، - يَعْنِي ابْنَ أَبِي خَالِدٍ - عَنْ أَبِيهِ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ يَزَالُ هَذَا الدِّينُ قَائِمًا حَتَّى يَكُونَ عَلَيْكُمُ اثْنَا عَشَرَ خَلِيفَةً كُلُّهُمْ تَجْتَمِعُ عَلَيْهِ الأُمَّةُ ‏\"‏ ‏.‏ فَسَمِعْتُ كَلاَمًا مِنَ النَّبِيِّ صلى الله عليه وسلم لَمْ أَفْهَمْهُ قُلْتُ لأَبِي مَا يَقُولُ قَالَ ‏\"‏ كُلُّهُمْ مِنْ قُرَيْشٍ ‏\"‏ ‏.‏",
    "malay_translation": "Nabi ﷺ bersabda: Agama ini akan tetap tegak hingga terdapat dua belas khalifah yang memerintah kamu, dan seluruh umat akan bersepakat dengan setiap seorang dari mereka. Kemudian aku mendengar beberapa perkataan dari Nabi ﷺ yang tidak ku fahami. Aku bertanya kepada ayahku, “Apa yang dikatakannya?” Beliau menjawab, “Semuanya adalah dari kalangan Quraisy.”"
  },
  {
    "id": 24785,
    "hadith_number": 4281,
    "tajuk_hadith": "Keteguhan Agama Hingga Dua Belas Khalifah Dari Quraisy",
    "perawi_melayu": "Dikisahkan oleh Jabir bin Samurah:",
    "english_text": "I heard the Messenger of Allah (ﷺ) say: This religion will continue to be strong till the time of twelve caliphs. The people then uttered: Allah is more great and uproared. He then silently a word which I could not understand. So I said to my father: What did he say, father ? He said: All of them will belong to Quraish.",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا دَاوُدُ، عَنْ عَامِرٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ يَزَالُ هَذَا الدِّينُ عَزِيزًا إِلَى اثْنَىْ عَشَرَ خَلِيفَةً ‏\"‏ ‏.‏ قَالَ فَكَبَّرَ النَّاسُ وَضَجُّوا ثُمَّ قَالَ كَلِمَةً خَفِيَّةً قُلْتُ لأَبِي يَا أَبَةِ مَا قَالَ قَالَ ‏\"‏ كُلُّهُمْ مِنْ قُرَيْشٍ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda: Agama ini akan tetap teguh hingga zaman dua belas khalifah. Kemudian, orang ramai bertakbir dan bersorak. Beliau kemudian mengucapkan satu perkataan dengan suara perlahan yang tidak dapat aku fahami. Maka aku bertanya kepada ayahku, \"Wahai ayah, apakah yang baginda ucapkan?\" Ayahku menjawab, \"Semua mereka dari kalangan Quraisy.\""
  },
  {
    "id": 24786,
    "hadith_number": 4282,
    "tajuk_hadith": "Kegoncangan dan Kerusuhan Selepas Kepulangan",
    "perawi_melayu": "Jabir bin Samurah melalui beberapa perawi lain. Versi ini menambahkan:",
    "english_text": "When he came back to his home. the Quraish came to him and said: Then what will happen ? He said: Then turmoil will prevail.",
    "arabic_text": "حَدَّثَنَا ابْنُ نُفَيْلٍ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا زِيَادُ بْنُ خَيْثَمَةَ، حَدَّثَنَا الأَسْوَدُ بْنُ سَعِيدٍ الْهَمْدَانِيُّ، عَنْ جَابِرِ بْنِ سَمُرَةَ، بِهَذَا الْحَدِيثِ زَادَ فَلَمَّا رَجَعَ إِلَى مَنْزِلِهِ أَتَتْهُ قُرَيْشٌ فَقَالُوا ثُمَّ يَكُونُ مَاذَا قَالَ ‏\n\"‏ ثُمَّ يَكُونُ الْهَرْجُ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila baginda pulang ke rumahnya, kaum Quraisy datang kepadanya dan bertanya, \"Kemudian apakah yang akan terjadi?\" Baginda menjawab, \"Kemudian akan berlaku kegoncangan dan kerusuhan.\""
  },
  {
    "id": 24787,
    "hadith_number": 4283,
    "tajuk_hadith": "Kedatangan Pemimpin Adil dari Ahlulbait Nabi SAW",
    "perawi_melayu": "Dikisahkan oleh Abdullah ibn Mas'ud",
    "english_text": "The Prophet (ﷺ) said: If only one day of this world remained. Allah would lengthen that day (according to the version of Za'idah), till He raised up in it a man who belongs to me or to my family whose father's name is the same as my father's, who will fill the earth with equity and justice as it has been filled with oppression and tyranny (according to the version of Fitr). Sufyan's version says: The world will not pass away before the Arabs are ruled by a man of my family whose name will be the same as mine.\n\n\nAbu Dawud said: The version of 'Umar and Abu Bakr is the same as that of Sufyan.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، أَنَّ عُمَرَ بْنَ عُبَيْدٍ، حَدَّثَهُمْ ح، وَحَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو بَكْرٍ، - يَعْنِي ابْنَ عَيَّاشٍ ح وَحَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، ح وَحَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، أَخْبَرَنَا زَائِدَةُ، ح وَحَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ، حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ فِطْرٍ، - الْمَعْنَى وَاحِدٌ - كُلُّهُمْ عَنْ عَاصِمٍ، عَنْ زِرٍّ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لَوْ لَمْ يَبْقَ مِنَ الدُّنْيَا إِلاَّ يَوْمٌ ‏\"‏ ‏.‏ قَالَ زَائِدَةُ فِي حَدِيثِهِ ‏\"‏ لَطَوَّلَ اللَّهُ ذَلِكَ الْيَوْمَ ‏\"‏ ‏.‏ ثُمَّ اتَّفَقُوا ‏\"‏ حَتَّى يَبْعَثَ فِيهِ رَجُلاً مِنِّي ‏\"‏ ‏.‏ أَوْ ‏\"‏ مِنْ أَهْلِ بَيْتِي يُوَاطِئُ اسْمُهُ اسْمِي وَاسْمُ أَبِيهِ اسْمَ أَبِي ‏\"‏ ‏.‏ زَادَ فِي حَدِيثِ فِطْرٍ ‏\"‏ يَمْلأُ الأَرْضَ قِسْطًا وَعَدْلاً كَمَا مُلِئَتْ ظُلْمًا وَجَوْرًا ‏\"‏ ‏.‏ وَقَالَ فِي حَدِيثِ سُفْيَانَ ‏\"‏ لاَ تَذْهَبُ أَوْ لاَ تَنْقَضِي الدُّنْيَا حَتَّى يَمْلِكَ الْعَرَبَ رَجُلٌ مِنْ أَهْلِ بَيْتِي يُوَاطِئُ اسْمُهُ اسْمِي ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ لَفْظُ عُمَرَ وَأَبِي بَكْرٍ بِمَعْنَى سُفْيَانَ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: Sekiranya hanya tinggal sehari lagi dari dunia ini, Allah SWT akan memanjangkan hari itu (mengikut riwayat Za'idah), sehingga Dia membangkitkan seorang lelaki yang berasal daripada keturunan atau keluarga-Ku, yang nama bapanya sama dengan nama bapa-Ku, yang akan memenuhi bumi dengan keadilan dan kesejahteraan sebagaimana bumi telah dipenuhi dengan kezaliman dan penindasan (mengikut riwayat Fitr).  Dalam riwayat Sufyan, sabdanya: Dunia tidak akan lenyap sebelum bangsa Arab diperintah oleh seorang lelaki dari keluarga-Ku yang namanya sama dengan nama-Ku. Abu Dawud berkata:  Riwayat 'Umar dan Abu Bakar mempunyai makna yang sama dengan riwayat Sufyan."
  },
  {
    "id": 24788,
    "hadith_number": 4284,
    "tajuk_hadith": "Kemunculan Orang Adil di Akhir Zaman",
    "perawi_melayu": "Diceritakan oleh Ali bin Abi Talib:",
    "english_text": "The Prophet (ﷺ) said: If only one day of this time (world) remained, Allah would raise up a man from my family who would fill this earth with justice as it has been filled with oppression.",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ، حَدَّثَنَا فِطْرٌ، عَنِ الْقَاسِمِ بْنِ أَبِي بَزَّةَ، عَنْ أَبِي الطُّفَيْلِ، عَنْ عَلِيٍّ، - رضى الله تعالى عنه - عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَوْ لَمْ يَبْقَ مِنَ الدَّهْرِ إِلاَّ يَوْمٌ لَبَعَثَ اللَّهُ رَجُلاً مِنْ أَهْلِ بَيْتِي يَمْلأُهَا عَدْلاً كَمَا مُلِئَتْ جَوْرًا ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: Sekiranya hanya tinggal satu hari lagi di dunia ini, Allah akan bangkitkan seorang lelaki dari ahli keluarga-Ku yang akan memenuhi bumi ini dengan keadilan sebagaimana ia telah dipenuhi dengan kezaliman."
  },
  {
    "id": 24789,
    "hadith_number": 4285,
    "tajuk_hadith": "Perihal Imam Mahdi dan Puji-pujian terhadap Ali bin Nufayl",
    "perawi_melayu": "Umm Salamah, Ummul Mukminin",
    "english_text": "The Prophet (ﷺ) said: The Mahdi will be of my family, of the descendants of Fatimah. Abdullah ibn Ja'far said: I heard AbulMalih praising Ali ibn Nufayl and describing his good qualities.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الرَّقِّيُّ، حَدَّثَنَا أَبُو الْمَلِيحِ الْحَسَنُ بْنُ عُمَرَ، عَنْ زِيَادِ بْنِ بَيَانٍ، عَنْ عَلِيِّ بْنِ نُفَيْلٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الْمَهْدِيُّ مِنْ عِتْرَتِي مِنْ وَلَدِ فَاطِمَةَ ‏\"‏ ‏.‏ قَالَ عَبْدُ اللَّهِ بْنُ جَعْفَرٍ وَسَمِعْتُ أَبَا الْمَلِيحِ يُثْنِي عَلَى عَلِيِّ بْنِ نُفَيْلٍ وَيَذْكُرُ مِنْهُ صَلاَحًا ‏.‏",
    "malay_translation": "Nabi SAW bersabda: Imam Mahdi akan daripada keturunan keluarga Nabi, daripada keturunan Fatimah. Abdullah bin Ja'far berkata: Aku mendengar Abu Malik memuji Ali bin Nufayl dan menerangkan kebaikannya."
  },
  {
    "id": 24790,
    "hadith_number": 4286,
    "tajuk_hadith": "Kehadiran Imam Mahdi dan Keadilannya",
    "perawi_melayu": "Dikisahkan oleh Abu Sa'id al-Khudri:",
    "english_text": "The Prophet (ﷺ) said: The Mahdi will be of my stock, and will have a broad forehead a prominent nose. He will fill the earth will equity and justice as it was filled with oppression and tyranny, and he will rule for seven years.",
    "arabic_text": "حَدَّثَنَا سَهْلُ بْنُ تَمَّامِ بْنِ بَزِيعٍ، حَدَّثَنَا عِمْرَانُ الْقَطَّانُ، عَنْ قَتَادَةَ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْمَهْدِيُّ مِنِّي أَجْلَى الْجَبْهَةِ أَقْنَى الأَنْفِ يَمْلأُ الأَرْضَ قِسْطًا وَعَدْلاً كَمَا مُلِئَتْ جَوْرًا وَظُلْمًا يَمْلِكُ سَبْعَ سِنِينَ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: Imam Mahdi adalah dari keturunan saya, dan beliau akan memiliki dahi yang luas dan hidung yang mancung. Dia akan memenuhi bumi dengan keadilan dan kesejahteraan sebagaimana bumi pernah dipenuhi dengan kezaliman dan penindasan, dan beliau akan memerintah selama tujuh tahun."
  },
  {
    "id": 24791,
    "hadith_number": 4287,
    "tajuk_hadith": "Peristiwa Perselisihan dan Kejatuhan Ekspedisi, serta Kemunculan Pemimpin yang Adil",
    "perawi_melayu": "Dikisahkan oleh Umm Salamah, isteri Nabi SAW",
    "english_text": "The Prophet (ﷺ) said: Disagreement will occur at the death of a caliph and a man of the people of Medina will come flying forth to Mecca. Some of the people of Mecca will come to him, bring him out against his will and swear allegiance to him between the Corner and the Maqam. An expeditionary force will then be sent against him from Syria but will be swallowed up in the desert between Mecca and Medina. When the people see that, the eminent saints of Syria and the best people of Iraq will come to him and swear allegiance to him between the Corner and the Maqam.  \n\n\n\n\n\nThen there will arise a man of Quraysh whose maternal uncles belong to Kalb and send against them an expeditionary force which will be overcome by them, and that is the expedition of Kalb. Disappointed will be the one who does not receive the booty of Kalb. He will divide the property, and will govern the people by the Sunnah of their Prophet (ﷺ) and establish Islam on Earth. He will remain seven years, then die, and the Muslims will pray over him.\n\n\n\nAbu Dawud said: Some transmitted from Hisham \"nine years\" and some \"seven years\".",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ صَالِحٍ أَبِي الْخَلِيلِ، عَنْ صَاحِبٍ، لَهُ عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ يَكُونُ اخْتِلاَفٌ عِنْدَ مَوْتِ خَلِيفَةٍ فَيَخْرُجُ رَجُلٌ مِنْ أَهْلِ الْمَدِينَةِ هَارِبًا إِلَى مَكَّةَ فَيَأْتِيهِ نَاسٌ مِنْ أَهْلِ مَكَّةَ فَيُخْرِجُونَهُ وَهُوَ كَارِهٌ فَيُبَايِعُونَهُ بَيْنَ الرُّكْنِ وَالْمَقَامِ وَيُبْعَثُ إِلَيْهِ بَعْثٌ مِنَ الشَّامِ فَيُخْسَفُ بِهِمْ بِالْبَيْدَاءِ بَيْنَ مَكَّةَ وَالْمَدِينَةِ فَإِذَا رَأَى النَّاسُ ذَلِكَ أَتَاهُ أَبْدَالُ الشَّامِ وَعَصَائِبُ أَهْلِ الْعِرَاقِ فَيُبَايِعُونَهُ بَيْنَ الرُّكْنِ وَالْمَقَامِ ثُمَّ يَنْشَأُ رَجُلٌ مِنْ قُرَيْشٍ أَخْوَالُهُ كَلْبٌ فَيَبْعَثُ إِلَيْهِمْ بَعْثًا فَيَظْهَرُونَ عَلَيْهِمْ وَذَلِكَ بَعْثُ كَلْبٍ وَالْخَيْبَةُ لِمَنْ لَمْ يَشْهَدْ غَنِيمَةَ كَلْبٍ فَيَقْسِمُ الْمَالَ وَيَعْمَلُ فِي النَّاسِ بِسُنَّةِ نَبِيِّهِمْ صلى الله عليه وسلم وَيُلْقِي الإِسْلاَمُ بِجِرَانِهِ إِلَى الأَرْضِ فَيَلْبَثُ سَبْعَ سِنِينَ ثُمَّ يُتَوَفَّى وَيُصَلِّي عَلَيْهِ الْمُسْلِمُونَ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ قَالَ بَعْضُهُمْ عَنْ هِشَامٍ ‏\"‏ تِسْعَ سِنِينَ ‏\"‏ ‏.‏ وَقَالَ بَعْضُهُمْ ‏\"‏ سَبْعَ سِنِينَ ‏\"‏ ‏.‏",
    "malay_translation": "Nabi SAW bersabda, \"Akan berlaku perselisihan pada kematian seorang khalifah. Seorang lelaki daripada penduduk Madinah akan melarikan diri ke Mekah. Sesetengah penduduk Mekah akan mendatanginya, memaksanya untuk diangkat menjadi pemimpin dan membai'atnya di antara Rukun dan Makam. Pasukan tentera dari Syam akan dihantar untuk menentang beliau, namun mereka akan ditimpa malapetaka di Padang Pasir antara Mekah dan Madinah.  Apabila penduduk menyaksikan kejadian itu, ahli-ahli sufi dari Syam dan orang-orang terbaik dari Iraq akan datang kepadanya dan membai'atnya di antara Rukun dan Makam.\n\nKemudian akan muncul seorang lelaki dari Quraisy yang mempunyai saudara-saudara mara dari kaum Kalb.  Beliau akan menghantar tentera untuk menentang mereka, namun tentera itu akan dikalahkan. Itulah ekspedisi Kalb.  Sesiapa yang tidak memperoleh rampasan perang Kalb akan kecewa. Beliau akan membahagikan harta benda dan memerintah manusia dengan sunnah Nabi SAW dan menyebarkan Islam ke seluruh bumi. Beliau akan memerintah selama tujuh tahun, kemudian meninggal dunia dan umat Islam akan solat jenazahnya.\"\n\nAbu Dawud berkata: Ada yang meriwayatkan daripada Hisham dengan menyebut 'sembilan tahun', dan ada yang menyebut 'tujuh tahun'."
  },
  {
    "id": 24792,
    "hadith_number": 4288,
    "tajuk_hadith": "Perbezaan Riwayat Mengenai Tempoh Sembilan Tahun",
    "perawi_melayu": "Perawi-perawi lain menyebut \"sembilan tahun\" daripada Hisham kecuali Mu'adh.",
    "english_text": "The other narrators mentioned \"nine years\" from Hisham except Mu'adh.",
    "arabic_text": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا عَبْدُ الصَّمَدِ، عَنْ هَمَّامٍ، عَنْ قَتَادَةَ، بِهَذَا الْحَدِيثِ وَقَالَ ‏\"‏ تِسْعَ سِنِينَ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ وَقَالَ غَيْرُ مُعَاذٍ عَنْ هِشَامٍ ‏\"‏ تِسْعَ سِنِينَ ‏\"‏ ‏.‏",
    "malay_translation": "Perawi-perawi yang lain meriwayatkan dari Hisham, \"sembilan tahun\", kecuali Mu'adh.  Hadis ini diriwayatkan oleh Harun bin Abdullah, dari Abdullah al-Samad, dari Hammam, dari Qatadah, dengan menyebut, \"Sembilan tahun.\"  Abu Dawud berkata, dan selain Mu'adh, dari Hisham juga meriwayatkan, \"sembilan tahun.\""
  },
  {
    "id": 24793,
    "hadith_number": 4289,
    "tajuk_hadith": "Hadis yang Dikisahkan Semula oleh Umm Salamah dan Kesempurnaan Hadis Mu'adz",
    "perawi_melayu": "Umm Salamah",
    "english_text": "The tradition mentioned above has also been transmitted by Umm Salamah from the Prophet (ﷺ) through a different chain of narrators. The tradition of Mu'adh is more perfect.",
    "arabic_text": "حَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ، حَدَّثَنَا أَبُو الْعَوَّامِ، حَدَّثَنَا قَتَادَةُ، عَنْ أَبِي الْخَلِيلِ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، عَنْ أُمِّ سَلَمَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا الْحَدِيثِ وَحَدِيثُ مُعَاذٍ أَتَمُّ ‏.‏",
    "malay_translation": "Hadis di atas juga telah disampaikan oleh Umm Salamah daripada Rasulullah SAW melalui sanad yang berbeza. Hadis Mu'adz lebih sempurna."
  },
  {
    "id": 24794,
    "hadith_number": 4290,
    "tajuk_hadith": "Nasib Orang Yang Terpaksa Terlibat Perang dan Kiamat",
    "perawi_melayu": "Umm Salmah meriwayatkan Nabi SAW menceritakan tentang kejadian tentera yang ditelan bumi. Saya bertanya:",
    "english_text": "How will a man who comes against his will (be swallowed up by the earth), Messenger of Allah ? He replied:  All will be swallowed up, but each will be raised according to his intention on the Day of Resurrection.",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، عَنْ عُبَيْدِ اللَّهِ ابْنِ الْقِبْطِيَّةِ، عَنْ أُمِّ سَلَمَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِقِصَّةِ جَيْشِ الْخَسْفِ قُلْتُ يَا رَسُولَ اللَّهِ فَكَيْفَ بِمَنْ كَانَ كَارِهًا قَالَ ‏\n\"‏ يُخْسَفُ بِهِمْ وَلَكِنْ يُبْعَثُ يَوْمَ الْقِيَامَةِ عَلَى نِيَّتِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Bagaimana nasib orang yang terpaksa terlibat dalam peperangan (yang ditelan bumi), Rasulullah? Baginda menjawab: Semua akan ditelan bumi, namun setiap individu akan dibangkitkan pada Hari Kiamat berdasarkan niatnya."
  },
  {
    "id": 24795,
    "hadith_number": 4291,
    "tajuk_hadith": "Keturunan Sayyid Hasan dan Kemunculan Seorang yang Mirip Rasulullah SAW dalam Akhlak",
    "perawi_melayu": "Abu Dawud berkata:",
    "english_text": "Abu Ishaq melaporkan bahawa Ali melihat anaknya al-Hasan dan berkata: Anakku ini adalah seorang sayyid (pemimpin) sebagaimana yang dinamakan oleh Nabi SAW, dan dari keturunannya akan muncul seorang lelaki yang akan dinamakan dengan nama Nabi kalian dan menyerupai beliau dalam akhlak tetapi tidak dalam rupa. Beliau kemudian menceritakan kisah tentang seseorang yang akan memenuhi bumi dengan keadilan.",
    "arabic_text": "الْمُغِيرَةِ، قَالَ حَدَّثَنَا عَمْرُو بْنُ أَبِي قَيْسٍ، عَنْ شُعَيْبِ بْنِ خَالِدٍ، عَنْ أَبِي إِسْحَاقَ، قَالَ قَالَ عَلِيٌّ - رضى الله عنه - وَنَظَرَ إِلَى ابْنِهِ الْحَسَنِ فَقَالَ إِنَّ ابْنِي هَذَا سَيِّدٌ كَمَا سَمَّاهُ النَّبِيُّ صلى الله عليه وسلم وَسَيَخْرُجُ مِنْ صُلْبِهِ رَجُلٌ يُسَمَّى بِاسْمِ نَبِيِّكُمْ يُشْبِهُهُ فِي الْخُلُقِ وَلاَ يُشْبِهُهُ فِي الْخَلْقِ ثُمَّ ذَكَرَ قِصَّةَ يَمْلأُ الأَرْضَ عَدْلاً ‏.‏",
    "malay_translation": "Abu Ishaq meriwayatkan bahawa Ali –redha Allah kepadanya– memandang anaknya al-Hasan dan berkata, \"Sesungguhnya anakku ini seorang sayyid (pemimpin) sebagaimana yang dinamakan oleh Nabi SAW. Dan dari keturunannya akan lahir seorang lelaki yang akan dinamakan dengan nama Nabi kalian dan akan menyerupai Nabi kalian dalam akhlak tetapi tidak dalam rupa. Kemudian beliau menceritakan kisah tentang seorang yang akan memenuhi bumi dengan keadilan."
  },
  {
    "id": 24796,
    "hadith_number": 4292,
    "tajuk_hadith": "Kedatangan Al-Harith bin Harrath dan Peranan Mansur untuk Keluarga Nabi Muhammad SAW",
    "perawi_melayu": "Diceritakan oleh Ali bin Abu Talib:",
    "english_text": "The Prophet (ﷺ) said: A man called al-Harith ibn Harrath will come forth from Ma Wara an-Nahr. His army will be led by a man called Mansur who will establish or consolidate things for Muhammad's family as Quraysh consolidated them for the Messenger of Allah (ﷺ). Every believer must help him, or he said: respond to his sermons.",
    "arabic_text": "وَقَالَ هَارُونُ حَدَّثَنَا عَمْرُو بْنُ أَبِي قَيْسٍ عَنْ مُطَرِّفِ بْنِ طَرِيفٍ عَنْ أَبِي الْحَسَنِ عَنْ هِلاَلِ بْنِ عَمْرٍو قَالَ سَمِعْتُ عَلِيًّا - رضى الله عنه - يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ يَخْرُجُ رَجُلٌ مِنْ وَرَاءِ النَّهْرِ يُقَالُ لَهُ الْحَارِثُ بْنُ حَرَّاثٍ عَلَى مُقَدِّمَتِهِ رَجُلٌ يُقَالُ لَهُ مَنْصُورٌ يُوَطِّئُ أَوْ يُمَكِّنُ لآلِ مُحَمَّدٍ كَمَا مَكَّنَتْ قُرَيْشٌ لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَجَبَ عَلَى كُلِّ مُؤْمِنٍ نَصْرُهُ ‏\"‏ ‏.‏ أَوْ قَالَ ‏\"‏ إِجَابَتُهُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Akan muncul seorang lelaki bernama Al-Harith bin Harrath dari Ma Wara an-Nahr. Tentaranya akan dipimpin oleh seorang lelaki bernama Mansur yang akan memantapkan atau memperkukuhkan kedudukan keluarga Muhammad sebagaimana kaum Quraisy memperkuatkan kedudukan Rasulullah SAW. Setiap orang mukmin wajib menolongnya, atau menurut riwayat lain, wajib memenuhi seruannya.\""
  }
]