[
  {
    "id": 22818,
    "hadith_number": 2314,
    "tajuk_hadith": "Penjelasan Ayat Al-Quran tentang Puasa dan Keringanan dari Allah",
    "perawi_melayu": "Diriwayatkan oleh Abdullah ibn Abbas:",
    "english_text": "Ibn Abbas explained the following Qur'anic verse: \"O ye who believe! fasting is prescribed for you as it was prescribed for those before you\" During the lifetime of the Prophet (ﷺ), when the people offered night prayer, they were asked to abstain from food and drink and (intercourse with) women, they kept fast till the next night. A man betrayed himself and had intercourse with his wife after he had offered the night prayer, and he did not break his fast. So Allah, the Exalted, intended to make it (fasting) easy for those who survived,  thus providing a concession and utility. Allah, the Glorified, said: \"Allah knoweth what ye used to do secretly among yourselves.\" By this Allah benefited the people and provided concession and ease to them.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ شَبُّويَةَ، حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنِ بْنِ وَاقِدٍ، عَنْ أَبِيهِ، عَنْ يَزِيدَ النَّحْوِيِّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، ‏{‏ يَا أَيُّهَا الَّذِينَ آمَنُوا كُتِبَ عَلَيْكُمُ الصِّيَامُ كَمَا كُتِبَ عَلَى الَّذِينَ مِنْ قَبْلِكُمْ ‏}‏ فَكَانَ النَّاسُ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم إِذَا صَلَّوُا الْعَتَمَةَ حَرُمَ عَلَيْهِمُ الطَّعَامُ وَالشَّرَابُ وَالنِّسَاءُ وَصَامُوا إِلَى الْقَابِلَةِ فَاخْتَانَ رَجُلٌ نَفْسَهُ فَجَامَعَ امْرَأَتَهُ وَقَدْ صَلَّى الْعِشَاءَ وَلَمْ يُفْطِرْ فَأَرَادَ اللَّهُ عَزَّ وَجَلَّ أَنْ يَجْعَلَ ذَلِكَ يُسْرًا لِمَنْ بَقِيَ وَرُخْصَةً وَمَنْفَعَةً فَقَالَ سُبْحَانَهُ ‏{‏ عَلِمَ اللَّهُ أَنَّكُمْ كُنْتُمْ تَخْتَانُونَ أَنْفُسَكُمْ ‏}‏ ‏.‏ وَكَانَ هَذَا مِمَّا نَفَعَ اللَّهُ بِهِ النَّاسَ وَرَخَّصَ لَهُمْ وَيَسَّرَ ‏.‏",
    "malay_translation": "Ibn Abbas menjelaskan ayat Al-Quran berikut: \"Wahai orang-orang yang beriman! diwajibkan ke atas kamu berpuasa sebagaimana diwajibkan ke atas orang-orang sebelum kamu.\" Pada zaman Nabi (ﷺ), apabila orang ramai menunaikan solat Isyak, mereka diminta untuk menahan diri daripada makan dan minum serta (bersetubuh dengan) wanita, mereka berpuasa hingga malam berikutnya. Seorang lelaki mengkhianati dirinya sendiri dan bersetubuh dengan isterinya setelah dia menunaikan solat Isyak, dan dia tidak membatalkan puasanya. Maka Allah, Yang Maha Tinggi, berkehendak untuk menjadikan (puasa) itu mudah bagi mereka yang masih hidup, dengan itu memberikan keringanan dan manfaat. Allah, Yang Maha Suci, berfirman: \"Allah mengetahui apa yang kamu lakukan secara sembunyi di antara kamu.\" Dengan ini Allah memberi manfaat kepada manusia dan memberikan keringanan serta kemudahan kepada mereka."
  },
  {
    "id": 22819,
    "hadith_number": 2315,
    "tajuk_hadith": "Hukum Makan dan Minum Selepas Tidur bagi Orang yang Berpuasa dan Kemudahan yang Diberikan",
    "perawi_melayu": "Al-Bara' bin Azib",
    "english_text": "Al Bara’ (bin Azib) said “When a man fasted and slept, he could not eat till (another nigh) like it.” Sarmah bin Qais Al Ansari came to his wife while he was fasting and asked her Do you have something (to eat)? She replied “No”. Let me go and seek something for you. So, she went out and sleep overcame him. She came (back) and said (to him) .You are deprived (of food). He fainted before noon. He used to work all day long at his land. This was mentioned to the Prophet (ﷺ). So the following verse was revealed. “Permitted to you on the nights of the fasts, is the approach to your wives. They are your garments and ye are their garments. Allah knoweth what yes used to do secretly amongst yourselves. But he turned to you and forgave you. So now associate with them and seek what Allaah hath ordained for you. And eat and drink until the white thread of dawn appears to you. He recited up to the words “of dawn”.",
    "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيِّ بْنِ نَصْرٍ الْجَهْضَمِيُّ، أَخْبَرَنَا أَبُو أَحْمَدَ، أَخْبَرَنَا إِسْرَائِيلُ، عَنْ إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ كَانَ الرَّجُلُ إِذَا صَامَ فَنَامَ لَمْ يَأْكُلْ إِلَى مِثْلِهَا وَإِنَّ صِرْمَةَ بْنَ قَيْسٍ الأَنْصَارِيَّ أَتَى امْرَأَتَهُ وَكَانَ صَائِمًا فَقَالَ عِنْدَكِ شَىْءٌ قَالَتْ لاَ لَعَلِّي أَذْهَبُ فَأَطْلُبُ لَكَ شَيْئًا ‏.‏ فَذَهَبَتْ وَغَلَبَتْهُ عَيْنُهُ فَجَاءَتْ فَقَالَتْ خَيْبَةً لَكَ ‏.‏ فَلَمْ يَنْتَصِفِ النَّهَارُ حَتَّى غُشِيَ عَلَيْهِ وَكَانَ يَعْمَلُ يَوْمَهُ فِي أَرْضِهِ فَذَكَرَ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَنَزَلَتْ ‏{‏ أُحِلَّ لَكُمْ لَيْلَةَ الصِّيَامِ الرَّفَثُ إِلَى نِسَائِكُمْ ‏}‏ قَرَأَ إِلَى قَوْلِهِ ‏{‏ مِنَ الْفَجْرِ ‏}‏ ‏.‏",
    "malay_translation": "Al Bara’ (bin Azib) berkata, “Apabila seseorang berpuasa dan tidur, dia tidak boleh makan hingga (malam) seperti itu lagi.” Sarmah bin Qais Al Ansari datang kepada isterinya ketika dia sedang berpuasa dan bertanya kepadanya, “Adakah kamu mempunyai sesuatu (untuk dimakan)?” Dia menjawab, “Tidak.” “Biarkan saya pergi mencari sesuatu untukmu.” Lalu, dia keluar dan tidur menguasainya. Dia datang (kembali) dan berkata (kepadanya), “Kamu telah kehilangan (makanan).” Dia pengsan sebelum tengah hari. Dia biasanya bekerja sepanjang hari di tanahnya. Hal ini disebutkan kepada Nabi (ﷺ). Maka ayat berikut diturunkan. “Dihalalkan bagi kamu pada malam hari puasa untuk bercampur dengan isteri-isteri kamu. Mereka adalah pakaian bagimu dan kamu adalah pakaian bagi mereka. Allah mengetahui apa yang kamu lakukan secara sembunyi-sembunyi di antara kamu sendiri. Tetapi Dia telah kembali kepadamu dan memaafkan kamu. Maka sekarang campurilah mereka dan carilah apa yang telah Allah tetapkan bagimu. Dan makan dan minumlah hingga jelas bagimu benang putih fajar.” Beliau membacakan hingga perkataan “fajar”."
  },
  {
    "id": 22820,
    "hadith_number": 2316,
    "tajuk_hadith": "Ayat Fidyah Puasa Dimansuhkan",
    "perawi_melayu": "",
    "english_text": "Salamah bin Al Akwa said “After the revelation of the verse “For those who can do it(with hardship) is a ransom, the feeding of one, that is indigent, is one of us intended to leave fast and pay ransom, he could do so.” until the verse following it was revealed and abrogated the (previous) verse.”",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا بَكْرٌ، - يَعْنِي ابْنَ مُضَرَ - عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ بُكَيْرٍ، عَنْ يَزِيدَ، مَوْلَى سَلَمَةَ عَنْ سَلَمَةَ بْنِ الأَكْوَعِ، قَالَ لَمَّا نَزَلَتْ هَذِهِ الآيَةُ ‏{‏ وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ ‏}‏ كَانَ مَنْ أَرَادَ مِنَّا أَنْ يُفْطِرَ وَيَفْتَدِيَ فَعَلَ حَتَّى نَزَلَتِ الآيَةُ الَّتِي بَعْدَهَا فَنَسَخَتْهَا ‏.‏",
    "malay_translation": "Salamah bin Al Akwa berkata, “Setelah penurunan ayat “Dan bagi orang-orang yang berat menjalankannya, wajib membayar fidyah, iaitu memberi makan seorang miskin,” sesiapa di antara kami yang ingin tidak berpuasa dan membayar fidyah, dia boleh melakukannya.” sehingga ayat yang berikutnya diturunkan dan memansuhkan ayat (sebelumnya) tersebut.”"
  },
  {
    "id": 22821,
    "hadith_number": 2317,
    "tajuk_hadith": "Keringanan Fidyah dan Kewajipan Puasa",
    "perawi_melayu": "",
    "english_text": "Ibn ‘Abbas explain the Qur’anic verse “For those who can do it(with hardship) is a ransom, the feeding of one, that is indigent” said “If one of them wished to pay ransom by providing food to an indigent person he could pay ransom.. Thus, his fast was complete. Allaah, the Exalted pronounced “But he that will give more of his own free will, it is better for him”. Again he pronounced “So every one of you who is present (at his home) during that month should spend it in fasting.” But, if anyone is ill or on a journey the prescribed period (should be made up) by days later.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنٍ، عَنْ أَبِيهِ، عَنْ يَزِيدَ النَّحْوِيِّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، ‏{‏ وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ ‏}‏ فَكَانَ مَنْ شَاءَ مِنْهُمْ أَنْ يَفْتَدِيَ بِطَعَامِ مِسْكِينٍ افْتَدَى وَتَمَّ لَهُ صَوْمُهُ فَقَالَ ‏{‏ فَمَنْ تَطَوَّعَ خَيْرًا فَهُوَ خَيْرٌ لَهُ وَأَنْ تَصُومُوا خَيْرٌ لَكُمْ ‏}‏ وَقَالَ ‏{‏ فَمَنْ شَهِدَ مِنْكُمُ الشَّهْرَ فَلْيَصُمْهُ وَمَنْ كَانَ مَرِيضًا أَوْ عَلَى سَفَرٍ فَعِدَّةٌ مِنْ أَيَّامٍ أُخَرَ ‏}‏ ‏.‏",
    "malay_translation": "Ibn ‘Abbas menjelaskan ayat Al-Quran “Dan bagi mereka yang mampu melakukannya (dengan kesukaran) adalah fidyah, iaitu memberi makan seorang miskin,” berkata, “Jika salah seorang daripada mereka ingin membayar fidyah dengan menyediakan makanan kepada seorang miskin, dia boleh membayar fidyah. Maka, puasanya telah sempurna. Allah, Yang Maha Tinggi berfirman, “Tetapi sesiapa yang memberi lebih secara sukarela, itu adalah lebih baik baginya”. Sekali lagi Dia berfirman “Oleh itu, sesiapa di antara kamu yang hadir (di rumahnya) dalam bulan itu, hendaklah dia berpuasa di dalamnya.” Tetapi, jika sesiapa sakit atau dalam perjalanan, maka tempoh yang ditetapkan (hendaklah diganti) pada hari-hari lain.”"
  },
  {
    "id": 22822,
    "hadith_number": 2318,
    "tajuk_hadith": "Fidiah Sah untuk Wanita Hamil dan Menyusukan Anak",
    "perawi_melayu": "Ibnu Abbas",
    "english_text": "Ibn ‘Abbas said “The verse concerning the payment of ransom stands valid for pregnant and sucking woman.”",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبَانُ، حَدَّثَنَا قَتَادَةُ، أَنَّ عِكْرِمَةَ، حَدَّثَهُ أَنَّ ابْنَ عَبَّاسٍ قَالَ أُثْبِتَتْ لِلْحُبْلَى وَالْمُرْضِعِ ‏.‏",
    "malay_translation": "Ibnu Abbas berkata, “Ayat mengenai pembayaran fidiah adalah sah untuk wanita hamil dan wanita yang menyusukan anak.”"
  },
  {
    "id": 22823,
    "hadith_number": 2319,
    "tajuk_hadith": "Keringanan bagi Orang Tua, Wanita Hamil dan Menyusui untuk Tidak Berpuasa",
    "perawi_melayu": "Diriwayatkan oleh Abdullah ibn Abbas:",
    "english_text": "Explaining the verse; \"For those who can do it (with hard-ship) is a ransom, the feeding of one, that is indigent,\" he said: This was a concession granted to the aged man and woman who were able to keep fast; they were allowed to leave the fast and instead feed an indigent person for each fast; (and a concession) to pregnant and suckling woman when they apprehended harm (to themselves).",
    "arabic_text": "حَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ عَزْرَةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، ‏{‏ وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ ‏}‏ قَالَ كَانَتْ رُخْصَةً لِلشَّيْخِ الْكَبِيرِ وَالْمَرْأَةِ الْكَبِيرَةِ وَهُمَا يُطِيقَانِ الصِّيَامَ أَنْ يُفْطِرَا وَيُطْعِمَا مَكَانَ كُلِّ يَوْمٍ مِسْكِينًا وَالْحُبْلَى وَالْمُرْضِعُ إِذَا خَافَتَا - قَالَ أَبُو دَاوُدَ يَعْنِي عَلَى أَوْلاَدِهِمَا - أَفْطَرَتَا وَأَطْعَمَتَا ‏.‏",
    "malay_translation": "Menjelaskan ayat; \"Dan bagi mereka yang berat menjalankannya, wajib membayar fidyah, iaitu memberi makan seorang miskin,\" beliau bersabda: Ini adalah keringanan yang diberikan kepada lelaki dan wanita tua yang mampu berpuasa; mereka dibenarkan untuk tidak berpuasa dan sebagai gantinya memberi makan seorang miskin untuk setiap hari puasa; (dan keringanan) kepada wanita hamil dan wanita yang menyusui apabila mereka khuatir akan bahaya (kepada diri mereka)."
  },
  {
    "id": 22824,
    "hadith_number": 2320,
    "tajuk_hadith": "Penetapan Bulan Ramadan dan Syawal Melalui Ru'yah",
    "perawi_melayu": "Diriwayatkan oleh Abdullah ibn Umar:",
    "english_text": "The Prophet (ﷺ) said: The month consists of twenty-nine days, but do not fast till you sight it (the moon) and do not break your fast till you sight it. If the weather is cloudy, calculate it thirty days. When the twenty-ninth of Sha'ban came, Ibn Umar would send someone (who tried) to sight the moon for him. If it was sighted, then well and good; in case it was not sighted, and there was no cloud and dust before him (on the horizon), he would not keep fast the next day. If there appeared (on the horizon) before him cloud or dust, he would fast the following day. Ibn Umar would end his fasting alone with the people, and did not follow this calculation.",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَسْوَدِ بْنِ قَيْسٍ، عَنْ سَعِيدِ بْنِ عَمْرٍو، - يَعْنِي ابْنَ سَعِيدِ بْنِ الْعَاصِ - عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّا أُمَّةٌ أُمِّيَّةٌ لاَ نَكْتُبُ وَلاَ نَحْسُبُ الشَّهْرُ هَكَذَا وَ هَكَذَا وَهَكَذَا ‏\"‏ ‏.‏ وَخَنَسَ سُلَيْمَانُ أُصْبَعَهُ فِي الثَّالِثَةِ يَعْنِي تِسْعًا وَعِشْرِينَ وَثَلاَثِينَ ‏.‏",
    "malay_translation": "Nabi ﷺ bersabda: 'Sebulan itu (kadang-kadang) dua puluh sembilan hari. Oleh itu, janganlah kamu berpuasa sehingga kamu melihat anak bulan, dan janganlah kamu berbuka puasa sehingga kamu melihat anak bulan. Jika cuaca mendung, maka genapkanlah menjadi tiga puluh hari.' Apabila tiba malam kedua puluh sembilan Sya'ban, Ibn Umar akan menghantar seseorang untuk melihat anak bulan. Jika anak bulan kelihatan, maka (berpuasalah keesokan harinya); jika tidak kelihatan, dan langit cerah tidak berawan, beliau tidak akan berpuasa pada hari berikutnya. Jika ada awan atau debu di langit, beliau akan berpuasa pada hari berikutnya. Ibn Umar berbuka puasa bersama orang ramai dan tidak mengikut perkiraan hisab."
  },
  {
    "id": 22825,
    "hadith_number": 2321,
    "tajuk_hadith": "Penentuan Bulan Ramadan dan Syawal Melalui Ru'yah (Melihat Anak Bulan)",
    "perawi_melayu": "",
    "english_text": "Ibn ‘Umar reported the Apostle of Allaah(ﷺ) as saying “The month consists of twenty nine days, but do not fast till you sight it (the moon) and do not break your fast till you sight it. If the weather is cloudy, calculate it thirty days. When the twenty-ninth of Sha’ban came, Ibn ‘Umar would send someone (who tried) to sight the moon for him. If it was sighted then well and good, in case it was not sighted and there was no cloud and dust before him (on the horizon) he would not keep fast the next day. If there appeared (on the horizon) before him cloud or dust, he would fast the following day. Ibn ‘Umar would end his fasting alone with the people and did not follow this calculation.”",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الشَّهْرُ تِسْعٌ وَعِشْرُونَ فَلاَ تَصُومُوا حَتَّى تَرَوْهُ وَلاَ تُفْطِرُوا حَتَّى تَرَوْهُ فَإِنْ غُمَّ عَلَيْكُمْ فَاقْدُرُوا لَهُ ثَلاَثِينَ ‏\"‏ ‏.‏ قَالَ فَكَانَ ابْنُ عُمَرَ إِذَا كَانَ شَعْبَانُ تِسْعًا وَعِشْرِينَ نُظِرَ لَهُ فَإِنْ رُؤِيَ فَذَاكَ وَإِنْ لَمْ يُرَ وَلَمْ يَحُلْ دُونَ مَنْظَرِهِ سَحَابٌ وَلاَ قَتَرَةٌ أَصْبَحَ مُفْطِرًا فَإِنْ حَالَ دُونَ مَنْظَرِهِ سَحَابٌ أَوْ قَتَرَةٌ أَصْبَحَ صَائِمًا ‏.‏ قَالَ فَكَانَ ابْنُ عُمَرَ يُفْطِرُ مَعَ النَّاسِ وَلاَ يَأْخُذُ بِهَذَا الْحِسَابِ ‏.‏",
    "malay_translation": "Daripada Ibn ‘Umar R.A., beliau melaporkan bahawa Rasulullah ﷺ bersabda, “Sebulan itu (kadang-kadang) terdiri daripada dua puluh sembilan hari. Oleh itu, janganlah kamu berpuasa sehingga kamu melihat anak bulan, dan janganlah kamu berbuka puasa sehingga kamu melihat anak bulan. Jika pandangan kamu terhalang oleh awan, maka genapkanlah bilangan hari Sya'ban menjadi tiga puluh hari.”  Nafi’ berkata: “Apabila tiba malam kedua puluh sembilan Sya'ban, Ibn ‘Umar akan menghantar seseorang untuk melihat anak bulan. Jika anak bulan itu kelihatan, maka itu sudah memadai. Tetapi jika anak bulan tidak kelihatan dan langit tidak berawan atau berdebu, beliau tidak akan berpuasa pada keesokan harinya. Namun, jika langit berawan atau berdebu, beliau akan berpuasa pada hari berikutnya. Ibn ‘Umar berbuka puasa bersama orang ramai dan tidak mengikut perkiraan hisab.”"
  },
  {
    "id": 22826,
    "hadith_number": 2322,
    "tajuk_hadith": "Penetapan Awal Puasa Berdasarkan Rukyah Hilal Sya'ban",
    "perawi_melayu": "Diriwayatkan oleh Ayyub :",
    "english_text": "'Umar b. 'Abd al-'Aziz wrote (a letter) to the people of Basrah: It has reached us from the Messenger of Allah (ﷺ), like the tradition narrated by Ibn 'Umar from the Prophet (ﷺ). This version adds: The best calculation is that when we sight the moon of Sha'ban on such-and-such date, fasting will being on such-and-such dates, Allah willing, except they they sight the moon before that (date).",
    "arabic_text": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنِي أَيُّوبُ، قَالَ كَتَبَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ إِلَى أَهْلِ الْبَصْرَةِ بَلَغَنَا عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ نَحْوَ حَدِيثِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم زَادَ وَإِنَّ أَحْسَنَ مَا يُقَدَّرُ لَهُ إِذَا رَأَيْنَا هِلاَلَ شَعْبَانَ لِكَذَا وَكَذَا فَالصَّوْمُ إِنْ شَاءَ اللَّهُ لِكَذَا وَكَذَا إِلاَّ أَنْ تَرَوُا الْهِلاَلَ قَبْلَ ذَلِكَ ‏.‏",
    "malay_translation": "Umar bin Abdul Aziz menulis (sepucuk surat) kepada penduduk Basrah: Telah sampai kepada kami daripada Rasulullah (ﷺ), seperti hadis yang diriwayatkan oleh Ibn Umar daripada Nabi (ﷺ). Versi ini menambah: Perkiraan terbaik adalah apabila kita melihat anak bulan Sya'ban pada tarikh sekian-sekian, puasa akan bermula pada tarikh sekian-sekian, Insya Allah, kecuali jika mereka melihat anak bulan sebelum tarikh itu."
  },
  {
    "id": 22827,
    "hadith_number": 2323,
    "tajuk_hadith": "Berpuasa 29 Hari Lebih Kerap Bersama Nabi (ﷺ)",
    "perawi_melayu": "Diriwayatkan oleh Abdullah ibn Mas'ud:",
    "english_text": "We kept fast for twenty-nine days along with the Prophet (ﷺ) more often than we kept fast for thirty days.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، عَنِ ابْنِ أَبِي زَائِدَةَ، عَنْ عِيسَى بْنِ دِينَارٍ، عَنْ أَبِيهِ، عَنْ عَمْرِو بْنِ الْحَارِثِ بْنِ أَبِي ضِرَارٍ، عَنِ ابْنِ مَسْعُودٍ، قَالَ لَمَا صُمْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم تِسْعًا وَعِشْرِينَ أَكْثَرُ مِمَّا صُمْنَا مَعَهُ ثَلاَثِينَ ‏.‏",
    "malay_translation": "Kami berpuasa selama dua puluh sembilan hari bersama Nabi (ﷺ) lebih kerap daripada kami berpuasa selama tiga puluh hari."
  },
  {
    "id": 22828,
    "hadith_number": 2324,
    "tajuk_hadith": "Bulan-bulan 'Id (Ramadan dan Dhu al-Hijjah) Tidak Kurang",
    "perawi_melayu": "Diriwayatkan oleh Abu Bakrah:",
    "english_text": "The Prophet (ﷺ) as saying: The two months of 'Id (festival), Ramadan and Dhu al-Hijjah, are not defective.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، أَنَّ يَزِيدَ بْنَ زُرَيْعٍ، حَدَّثَهُمْ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ شَهْرَا عِيدٍ لاَ يَنْقُصَانِ رَمَضَانُ وَذُو الْحِجَّةِ ‏\"‏ ‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda: Dua bulan 'Id (perayaan), Ramadan dan Dhu al-Hijjah, tidaklah kurang."
  },
  {
    "id": 22829,
    "hadith_number": 2325,
    "tajuk_hadith": "Penetapan Hari Raya, Tempat Wuquf di Arafah dan Tempat Korban di Mina",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said: The end of Ramadan is on the day when you end it, and the 'Id (festival) of sacrifice is on the day when you sacrifice. The whole of Arafah is the place of staying, and the whole of Mina is the place of sacrifice, and all the roads of Mecca are the place of sacrifice, and the whole of Muzdalifah is the place of staying.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، حَدَّثَنَا حَمَّادٌ، - فِي حَدِيثِ أَيُّوبَ - عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ أَبِي هُرَيْرَةَ، ذَكَرَ النَّبِيَّ صلى الله عليه وسلم فِيهِ قَالَ ‏\n\"‏ وَفِطْرُكُمْ يَوْمَ تُفْطِرُونَ وَأَضْحَاكُمْ يَوْمَ تُضَحُّونَ وَكُلُّ عَرَفَةَ مَوْقِفٌ وَكُلُّ مِنًى مَنْحَرٌ وَكُلُّ فِجَاجِ مَكَّةَ مَنْحَرٌ وَكُلُّ جَمْعٍ مَوْقِفٌ ‏\"‏ ‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda: Berakhirnya Ramadan adalah pada hari kamu mengakhirinya, dan 'Id (perayaan) korban adalah pada hari kamu berkorban. Seluruh Arafah adalah tempat untuk berwuquf, dan seluruh Mina adalah tempat penyembelihan korban, dan semua jalan di Mekah adalah tempat penyembelihan korban, dan seluruh Muzdalifah adalah tempat untuk bermalam (bermabit)."
  },
  {
    "id": 22830,
    "hadith_number": 2326,
    "tajuk_hadith": "Kiraan Sya'ban dan Puasa Ramadan Rasulullah ﷺ",
    "perawi_melayu": "Diriwayatkan oleh Aisyah, Ummul Mu'minin:",
    "english_text": "The Messenger of Allah (ﷺ) used to count the days in Sha'ban in a manner he did not count any other month; then he fasted when he sighted the new moon of Ramadan; but if the weather was cloudy he counted thirty days and then fasted.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنِي مُعَاوِيَةُ بْنُ صَالِحٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَيْسٍ، قَالَ سَمِعْتُ عَائِشَةَ، - رضى الله عنها - تَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَتَحَفَّظُ مِنْ شَعْبَانَ مَا لاَ يَتَحَفَّظُ مِنْ غَيْرِهِ ثُمَّ يَصُومُ لِرُؤْيَةِ رَمَضَانَ فَإِنْ غُمَّ عَلَيْهِ عَدَّ ثَلاَثِينَ يَوْمًا ثُمَّ صَامَ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) biasa menghitung hari-hari dalam bulan Sya'ban dengan cara yang tidak beliau lakukan pada bulan lain; kemudian beliau berpuasa ketika melihat anak bulan Ramadan; tetapi jika cuaca mendung, beliau menghitung tiga puluh hari dan kemudian berpuasa."
  },
  {
    "id": 22831,
    "hadith_number": 2327,
    "tajuk_hadith": "Larangan Berpuasa Ramadan Sebelum Melihat Anak Bulan",
    "perawi_melayu": "Diriwayatkan oleh Hudhayfah:",
    "english_text": "The Prophet (ﷺ) said: Do not fast (for Ramadan) before the coming of the month until you sight the moon or complete the number (of thirty days); then fast until you sight the moon or complete the number (of thirty days).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ، حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ الضَّبِّيُّ، عَنْ مَنْصُورِ بْنِ الْمُعْتَمِرِ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ حُذَيْفَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تُقَدِّمُوا الشَّهْرَ حَتَّى تَرَوُا الْهِلاَلَ أَوْ تُكْمِلُوا الْعِدَّةَ ثُمَّ صُومُوا حَتَّى تَرَوُا الْهِلاَلَ أَوْ تُكْمِلُوا الْعِدَّةَ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ وَرَوَاهُ سُفْيَانُ وَغَيْرُهُ عَنْ مَنْصُورٍ عَنْ رِبْعِيٍّ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم لَمْ يُسَمِّ حُذَيْفَةَ ‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda: Janganlah kamu berpuasa (untuk Ramadan) sebelum tiba bulan tersebut sehingga kamu melihat anak bulan atau menyempurnakan bilangan (tiga puluh hari); kemudian berpuasalah sehingga kamu melihat anak bulan atau menyempurnakan bilangan (tiga puluh hari)."
  },
  {
    "id": 22832,
    "hadith_number": 2328,
    "tajuk_hadith": "Larangan Berpuasa Sehari atau Dua Hari Sebelum Ramadan Kecuali Bagi Kebiasaan Puasa",
    "perawi_melayu": "Diriwayatkan dari Abdullah ibn Abbas:",
    "english_text": "The Prophet (ﷺ) said: Do not fast one day or two days just before Ramadan except in the case of a man who has been in the habit or observing a fast (on that day); and do not fast until you sight it (the moon). Then fast until you sight it. If a cloud appears on that day (i.e. 29th of Ramadan) then complete the number thirty (days) and then end the fasting: a month consists of twenty-nine days.",
    "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا حُسَيْنٌ، عَنْ زَائِدَةَ، عَنْ سِمَاكٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تُقَدِّمُوا الشَّهْرَ بِصِيَامِ يَوْمٍ وَلاَ يَوْمَيْنِ إِلاَّ أَنْ يَكُونَ شَىْءٌ يَصُومُهُ أَحَدُكُمْ وَلاَ تَصُومُوا حَتَّى تَرَوْهُ ثُمَّ صُومُوا حَتَّى تَرَوْهُ فَإِنْ حَالَ دُونَهُ غَمَامَةٌ فَأَتِمُّوا الْعِدَّةَ ثَلاَثِينَ ثُمَّ أَفْطِرُوا وَ الشَّهْرُ تِسْعٌ وَعِشْرُونَ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ حَاتِمُ بْنُ أَبِي صَغِيرَةَ وَشُعْبَةُ وَالْحَسَنُ بْنُ صَالِحٍ عَنْ سِمَاكٍ بِمَعْنَاهُ لَمْ يَقُولُوا ‏\"‏ ثُمَّ أَفْطِرُوا ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ وَهُوَ حَاتِمُ بْنُ مُسْلِمِ بْنِ أَبِي صَغِيرَةَ وَأَبُو صَغِيرَةَ زَوْجُ أُمِّهِ ‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda: Jangan berpuasa sehari atau dua hari tepat sebelum Ramadan kecuali bagi seseorang yang sudah terbiasa atau berpuasa (pada hari itu); dan jangan berpuasa sehingga kamu melihatnya (anak bulan). Kemudian berpuasalah sehingga kamu melihatnya. Jika awan muncul pada hari itu (iaitu 29 Ramadan) maka sempurnakanlah bilangan tiga puluh (hari) dan kemudian berbukalah: sebulan terdiri dari dua puluh sembilan hari."
  },
  {
    "id": 22833,
    "hadith_number": 2329,
    "tajuk_hadith": "Perintah Mengganti Puasa Sunat Sya'ban",
    "perawi_melayu": "Diriwayatkan oleh 'Imran bin Husain:",
    "english_text": "The Messenger of Allah (ﷺ) asked a man: Did you fast the last day of Sha'ban ? He replied: No. He said: If you did not observe a fast, you must fast for a day. One of the two narrators said: For two days.",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ، عَنْ مُطَرِّفٍ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، وَسَعِيدٍ الْجُرَيْرِيِّ، عَنْ أَبِي الْعَلاَءِ، عَنْ مُطَرِّفٍ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لِرَجُلٍ ‏\"‏ هَلْ صُمْتَ مِنْ سَرَرِ شَعْبَانَ شَيْئًا ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَإِذَا أَفْطَرْتَ فَصُمْ يَوْمًا ‏\"‏ ‏.‏ وَقَالَ أَحَدُهُمَا ‏\"‏ يَوْمَيْنِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bertanya kepada seorang lelaki: “Adakah kamu berpuasa pada hari terakhir bulan Sya'ban?” Lelaki itu menjawab: “Tidak.” Baginda bersabda: “Jika kamu tidak berpuasa, maka berpuasalah sehari sebagai gantinya.” Salah seorang daripada dua perawi berkata: “Dua hari sebagai gantinya.”"
  },
  {
    "id": 22834,
    "hadith_number": 2330,
    "tajuk_hadith": "Arahan Mu'awiyah untuk Berpuasa Awal dan Penjelasan dari Rasulullah SAW",
    "perawi_melayu": "Diriwayatkan oleh Mu'awiyah:",
    "english_text": "AbulAzhar al-Mughirah ibn Farwah said: Mu'awiyah stood among the people at Dayr Mustahill lying at the gate of Hims. He said: O people, we sighted the moon on such-and-such day. We shall fast in advance. Anyone who likes to do so may do it. Malik ibn Hubayrah as-Saba'i stood up and asked: Mu'awiyah, did you hear the Messenger of Allah (ﷺ) say something (about this matter), or is this something on the basis of your opinion? He replied: I heard the Messenger of Allah (ﷺ) as saying: Fast the month (in the beginning) and in the last.",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْعَلاَءِ الزُّبَيْدِيُّ، مِنْ كِتَابِهِ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْعَلاَءِ، عَنْ أَبِي الأَزْهَرِ الْمُغِيرَةِ بْنِ فَرْوَةَ، قَالَ قَامَ مُعَاوِيَةُ فِي النَّاسِ بِدَيْرِ مِسْحَلٍ الَّذِي عَلَى بَابِ حِمْصَ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّا قَدْ رَأَيْنَا الْهِلاَلَ يَوْمَ كَذَا وَكَذَا وَأَنَا مُتَقَدِّمٌ بِالصِّيَامِ فَمَنْ أَحَبَّ أَنْ يَفْعَلَهُ فَلْيَفْعَلْهُ ‏.‏ قَالَ فَقَامَ إِلَيْهِ مَالِكُ بْنُ هُبَيْرَةَ السَّبَئِيُّ فَقَالَ يَا مُعَاوِيَةُ أَشَىْءٌ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَمْ شَىْءٌ مِنْ رَأْيِكَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ صُومُوا الشَّهْرَ وَسِرَّهُ ‏\"‏ ‏.‏",
    "malay_translation": "AbulAzhar al-Mughirah ibn Farwah berkata: Mu'awiyah berdiri di antara orang ramai di Dayr Mustahill yang terletak di pintu Hims. Beliau berkata: Wahai orang ramai, kami telah melihat anak bulan pada hari sekian-sekian. Kami akan berpuasa lebih awal. Sesiapa yang suka melakukannya, boleh melakukannya. Malik ibn Hubayrah as-Saba'i berdiri dan bertanya: Mu'awiyah, adakah kamu mendengar Rasulullah (ﷺ) bersabda sesuatu (mengenai perkara ini), atau adakah ini sesuatu berdasarkan pendapat kamu? Beliau menjawab: Saya mendengar Rasulullah (ﷺ) bersabda: Berpuasalah bulan (pada permulaannya) dan pada akhirnya."
  },
  {
    "id": 22835,
    "hadith_number": 2331,
    "tajuk_hadith": "Penjelasan Maksud 'Sirrahu'",
    "perawi_melayu": "Sulaiman b. 'Abd al-Rahman al-Dimashqi meriwayatkan tentang hadis ini bahawa al-Walid berkata:",
    "english_text": "I heard Abu 'Amr al-Auza'i say: The word sirrahu means beginning of the month.",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ عَبْدِ الرَّحْمَنِ الدِّمَشْقِيُّ، - فِي هَذَا الْحَدِيثِ - قَالَ قَالَ الْوَلِيدُ سَمِعْتُ أَبَا عَمْرٍو - يَعْنِي الأَوْزَاعِيَّ - يَقُولُ سِرُّهُ أَوَّلُهُ ‏.‏",
    "malay_translation": "Saya mendengar Abu 'Amr al-Auza'i berkata: Perkataan 'sirrahu' bermaksud permulaan bulan."
  },
  {
    "id": 22836,
    "hadith_number": 2332,
    "tajuk_hadith": "Maksud Perkataan 'Sirraha'",
    "perawi_melayu": "Diriwayatkan oleh Ahmad bin 'Abd al-Wahid:",
    "english_text": "On the authority of Abu Mushir. He said: Sa'id, that is, Ibn 'Abd al-'Aziz said: The meaning of the word sirraha is \"in the beginning of it (the month)\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ الْوَاحِدِ، حَدَّثَنَا أَبُو مُسْهِرٍ، قَالَ كَانَ سَعِيدٌ - يَعْنِي ابْنَ عَبْدِ الْعَزِيزِ - يَقُولُ سِرُّهُ أَوَّلُهُ ‏.‏ قَالَ أَبُو دَاوُدَ وَقَالَ بَعْضُهُمْ سِرُّهُ وَسَطُهُ وَقَالُوا آخِرُهُ ‏.‏",
    "malay_translation": "Daripada Abu Mushir. Beliau berkata: Sa'id, iaitu Ibn 'Abd al-'Aziz berkata: Maksud perkataan sirraha adalah \"pada permulaan bulan tersebut\"."
  },
  {
    "id": 22837,
    "hadith_number": 2333,
    "tajuk_hadith": "Arahan Rasulullah SAW tentang Melihat Anak Bulan",
    "perawi_melayu": "Diriwayatkan oleh Kuraib:",
    "english_text": "That Umm al-Fadl, daughter of al-Harith, sent him to Mu'aqiyah in Syria. He said: I came to syria and performed her work. The moon of Ramadan appeared while I was in Syria. We sighted the moon on the night of Friday. When I came to Median towards the end of the month (of Ramadan), Ibn 'Abbas asked me about the moon. He said: When did you sight the moon ? I said: I sighted it on the night of Friday. He asked: Did you sight it yourself ? I said: Yes, and the people sighted it. They fasted and Mu'awiyah also fasted. He said: But we sighted it on the night of saturday. Since then we have been fasting until we complete thirty days or we sight it. Then I said: Are the sighting of the moon by Mu'awiyah and his fasts not sufficient for us? He replied: No. The Messenger of Allah (ﷺ) commanded us to do so.",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنِي ابْنَ جَعْفَرٍ - أَخْبَرَنِي مُحَمَّدُ بْنُ أَبِي حَرْمَلَةَ، أَخْبَرَنِي كُرَيْبٌ، أَنَّ أُمَّ الْفَضْلِ ابْنَةَ الْحَارِثِ، بَعَثَتْهُ إِلَى مُعَاوِيَةَ بِالشَّامِ قَالَ فَقَدِمْتُ الشَّامَ فَقَضَيْتُ حَاجَتَهَا فَاسْتُهِلَّ رَمَضَانُ وَأَنَا بِالشَّامِ فَرَأَيْنَا الْهِلاَلَ لَيْلَةَ الْجُمُعَةِ ثُمَّ قَدِمْتُ الْمَدِينَةَ فِي آخِرِ الشَّهْرِ فَسَأَلَنِي ابْنُ عَبَّاسٍ ثُمَّ ذَكَرَ الْهِلاَلَ فَقَالَ مَتَى رَأَيْتُمُ الْهِلاَلَ قُلْتُ رَأَيْتُهُ لَيْلَةَ الْجُمُعَةِ ‏.‏ قَالَ أَنْتَ رَأَيْتَهُ قُلْتُ نَعَمْ وَرَآهُ النَّاسُ وَصَامُوا وَصَامَ مُعَاوِيَةُ ‏.‏ قَالَ لَكِنَّا رَأَيْنَاهُ لَيْلَةَ السَّبْتِ فَلاَ نَزَالُ نَصُومُهُ حَتَّى نُكْمِلَ الثَّلاَثِينَ أَوْ نَرَاهُ ‏.‏ فَقُلْتُ أَفَلاَ تَكْتَفِي بِرُؤْيَةِ مُعَاوِيَةَ وَصِيَامِهِ قَالَ لاَ هَكَذَا أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Bahawa Umm al-Fadl, puteri al-Harith, telah menghantarnya kepada Mu'aqiyah di Syam. Dia berkata: Saya datang ke Syam dan melaksanakan tugasnya. Anak bulan Ramadan muncul ketika saya berada di Syam. Kami melihat anak bulan pada malam Jumaat. Ketika saya datang ke Madinah menjelang akhir bulan Ramadan, Ibn 'Abbas bertanya kepada saya tentang anak bulan. Dia berkata: Bilakah kamu melihat anak bulan? Saya berkata: Saya melihatnya pada malam Jumaat. Dia bertanya: Adakah kamu melihatnya sendiri? Saya berkata: Ya, dan orang ramai juga melihatnya. Mereka berpuasa dan Mu'awiyah juga berpuasa. Dia berkata: Tetapi kami melihatnya pada malam Sabtu. Sejak itu kami terus berpuasa sehingga kami melengkapkan tiga puluh hari atau kami melihatnya. Kemudian saya berkata: Adakah penglihatan anak bulan oleh Mu'awiyah dan puasanya tidak mencukupi bagi kami? Dia menjawab: Tidak. Rasulullah (ﷺ) memerintahkan kami untuk berbuat demikian."
  },
  {
    "id": 22838,
    "hadith_number": 2334,
    "tajuk_hadith": "Puasa Ganti Jika Umat Islam Lain Berpuasa",
    "perawi_melayu": "Al-Hasan berkata tentang seorang lelaki yang berada di sebuah kota. Dia berpuasa pada hari Isnin, dan dua orang memberi kesaksian bahawa mereka telah melihat anak bulan pada malam Ahad. Dia berkata:",
    "english_text": "That man and the people of his city should not fast as an atonement except that they know (for certain) that the people of a certain city of Muslims had fasted on Sunday. In that case they should keep fast as an atonement.",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنِي أَبِي، حَدَّثَنَا الأَشْعَثُ، عَنِ الْحَسَنِفِي رَجُلٍ كَانَ بِمِصْرٍ مِنَ الأَمْصَارِ فَصَامَ يَوْمَ الاِثْنَيْنِ وَشَهِدَ رَجُلاَنِ أَنَّهُمَا رَأَيَا الْهِلاَلَ لَيْلَةَ الأَحَدِ فَقَالَ لاَ يَقْضِي ذَلِكَ الْيَوْمَ الرَّجُلُ وَلاَ أَهْلُ مِصْرِهِ إِلاَّ أَنْ يَعْلَمُوا أَنَّ أَهْلَ مِصْرٍ مِنْ أَمْصَارِ الْمُسْلِمِينَ قَدْ صَامُوا يَوْمَ الأَحَدِ فَيَقْضُونَهُ ‏.‏",
    "malay_translation": "Lelaki itu dan penduduk kotanya tidak sepatutnya berpuasa sebagai penebus dosa kecuali mereka mengetahui (dengan pasti) bahawa penduduk kota tertentu dari kaum Muslimin telah berpuasa pada hari Ahad. Dalam kes itu, mereka patut berpuasa sebagai penebus dosa."
  },
  {
    "id": 22839,
    "hadith_number": 2335,
    "tajuk_hadith": "Larangan Berpuasa pada Hari yang Meragukan kerana Menderhakai Nabi (ﷺ)",
    "perawi_melayu": "Diriwayatkan oleh Ammar:",
    "english_text": "AbuIshaq reported on the authority of Silah: We were with Ammar on the day when the appearance of the moon was doubtful. (The meat of) goat was brought to him. Some people kept aloof from (eating) it. Ammar said: He who keeps fast on this day disobeys AbulQasim (i.e. the Prophet) (ﷺ).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ عَمْرِو بْنِ قَيْسٍ، عَنْ أَبِي إِسْحَاقَ، عَنْ صِلَةَ، قَالَ كُنَّا عِنْدَ عَمَّارٍ فِي الْيَوْمِ الَّذِي يُشَكُّ فِيهِ فَأُتِيَ بِشَاةٍ فَتَنَحَّى بَعْضُ الْقَوْمِ فَقَالَ عَمَّارٌ مَنْ صَامَ هَذَا الْيَوْمَ فَقَدْ عَصَى أَبَا الْقَاسِمِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Abu Ishaq meriwayatkan daripada Silah: Kami bersama Ammar pada hari yang diragui kemunculan bulan. (Daging) kambing dibawa kepadanya. Beberapa orang menjauhkan diri daripada (memakannya). Ammar berkata: Sesiapa yang berpuasa pada hari ini, maka sesungguhnya dia telah mengingkari Abul Qasim (iaitu Nabi) (ﷺ)."
  },
  {
    "id": 22840,
    "hadith_number": 2336,
    "tajuk_hadith": "Larangan Berpuasa Sehari atau Dua Hari Sebelum Ramadan Kecuali Bagi yang Biasa Berpuasa",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "The Messenger of Allah (ﷺ) as saying: Do not fast one day or two days just before Ramadan, except in the case of a man who has been in the habit of observing the particular fast, for he may fast on that day.",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَقَدَّمُوا صَوْمَ رَمَضَانَ بِيَوْمٍ وَلاَ يَوْمَيْنِ إِلاَّ أَنْ يَكُونَ صَوْمًا يَصُومُهُ رَجُلٌ فَلْيَصُمْ ذَلِكَ الصَّوْمَ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda: Janganlah kamu berpuasa sehari atau dua hari sebelum Ramadan, kecuali bagi seseorang yang telah biasa berpuasa pada hari tersebut, maka dia boleh berpuasa pada hari itu."
  },
  {
    "id": 22841,
    "hadith_number": 2337,
    "tajuk_hadith": "Puasa Sunat Nabi (ﷺ) di Bulan Sya'ban",
    "perawi_melayu": "Diriwayatkan oleh Umm Salamah, Ummul Mu'minin:",
    "english_text": "She never saw the Prophet (ﷺ) fasting the whole month except Sha'ban which he combined with Ramadan.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ تَوْبَةَ الْعَنْبَرِيِّ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ لَمْ يَكُنْ يَصُومُ مِنَ السَّنَةِ شَهْرًا تَامًّا إِلاَّ شَعْبَانَ يَصِلُهُ بِرَمَضَانَ ‏.‏",
    "malay_translation": "Beliau tidak pernah melihat Nabi (ﷺ) berpuasa sebulan penuh kecuali bulan Sya'ban yang baginda sambungkan dengan Ramadan."
  },
  {
    "id": 22842,
    "hadith_number": 2338,
    "tajuk_hadith": "Larangan Berpuasa Selepas Pertengahan Sya'ban",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "AbdulAziz ibn  Muhammad said: Abbad ibn Kathir came to Medina and went to the assembly of al-Ala'. He caught hold of his hand and made him stand and said: O Allah, he narrates a tradition from his father on the authority of AbuHurayrah who reported the Messenger of Allah (ﷺ) as saying: When the middle of Sha'ban comes, do not fast. Al-Ala' said: O Allah, my father narrated this tradition on the authority of AbuHurayrah from the Prophet (ﷺ)",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، قَالَ قَدِمَ عَبَّادُ بْنُ كَثِيرٍ الْمَدِينَةَ فَمَالَ إِلَى مَجْلِسِ الْعَلاَءِ فَأَخَذَ بِيَدِهِ فَأَقَامَهُ ثُمَّ قَالَ اللَّهُمَّ إِنَّ هَذَا يُحَدِّثُ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا انْتَصَفَ شَعْبَانُ فَلاَ تَصُومُوا ‏\"‏ ‏.‏ فَقَالَ الْعَلاَءُ اللَّهُمَّ إِنَّ أَبِي حَدَّثَنِي عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم بِذَلِكَ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ الثَّوْرِيُّ وَشِبْلُ بْنُ الْعَلاَءِ وَأَبُو عُمَيْسٍ وَزُهَيْرُ بْنُ مُحَمَّدٍ عَنِ الْعَلاَءِ ‏.‏ قَالَ أَبُو دَاوُدَ وَكَانَ عَبْدُ الرَّحْمَنِ لاَ يُحَدِّثُ بِهِ قُلْتُ لأَحْمَدَ لِمَ قَالَ لأَنَّهُ كَانَ عِنْدَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَصِلُ شَعْبَانَ بِرَمَضَانَ وَقَالَ عَنِ النَّبِيِّ صلى الله عليه وسلم خِلاَفَهُ ‏.‏ قَالَ أَبُو دَاوُدَ وَلَيْسَ هَذَا عِنْدِي خِلاَفَهُ وَلَمْ يَجِئْ بِهِ غَيْرُ الْعَلاَءِ عَنْ أَبِيهِ ‏.‏",
    "malay_translation": "Abdul Aziz ibn Muhammad berkata: Abbad ibn Kathir datang ke Madinah dan pergi ke majlis al-Ala'. Dia memegang tangannya dan membuatkannya berdiri lalu berkata: Ya Allah, sesungguhnya dia menceritakan hadis daripada ayahnya daripada Abu Hurairah yang meriwayatkan bahawa Rasulullah (ﷺ) bersabda: \"Apabila tiba pertengahan Sya'ban, maka janganlah kamu berpuasa.\" Al-Ala' berkata: Ya Allah, sesungguhnya ayahku menceritakan hadis ini daripada Abu Hurairah daripada Nabi (ﷺ) tentang perkara itu."
  },
  {
    "id": 22843,
    "hadith_number": 2339,
    "tajuk_hadith": "Perintah Melaksanakan Haji Berdasarkan Ru'yah Hilal dan Kesaksian",
    "perawi_melayu": "Diriwayatkan oleh Abdullah ibn Umar:",
    "english_text": "Husayn ibn al-Harith al-Jadli from the tribe of Jadilah Qays said: The governor of Mecca delivered a speech and said: The Messenger of Allah (ﷺ) took a pledge from us that we should perform the rites of hajj after sighting the moon. If we do not sight it and two reliable persons bear witness, we should perform the rites of hajj on the basis of their witness.  \n\n\n\n\n\nI then asked al-Husayn ibn al-Harith: Who was the governor of Mecca?  He replied: I do not know. He then met me later on and told me: He was al-Harith ibn Hatib, brother of Muhammad ibn Hatib. The governor then said: There is among you a man who is more acquainted with Allah and His Apostle than I. He witnessed this from the Messenger of Allah (ﷺ). He then pointed with his hand to a man. Al-Husayn said: I asked an old man beside me: Who is that man to whom the governor has alluded?  \n\n\n\n\n\nHe said: \"This is Abdullah ibn Umar, and he spoke the truth. He was more acquainted with Allah than he. He (Abdullah ibn Umar) said: For this is what the Messenger of Allah (ﷺ) commanded us (to do).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ أَبُو يَحْيَى الْبَزَّازُ، حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، حَدَّثَنَا عَبَّادٌ، عَنْ أَبِي مَالِكٍ الأَشْجَعِيِّ، حَدَّثَنَا حُسَيْنُ بْنُ الْحَارِثِ الْجَدَلِيُّ، - مِنْ جَدِيلَةِ قَيْسٍ أَنَّ أَمِيرَ مَكَّةَ خَطَبَ ثُمَّ قَالَ عَهِدَ إِلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ نَنْسُكَ لِلرُّؤْيَةِ فَإِنْ لَمْ نَرَهُ وَشَهِدَ شَاهِدَا عَدْلٍ نَسَكْنَا بِشَهَادَتِهِمَا فَسَأَلْتُ الْحُسَيْنَ بْنَ الْحَارِثِ مَنْ أَمِيرُ مَكَّةَ قَالَ لاَ أَدْرِي ‏.‏ ثُمَّ لَقِيَنِي بَعْدُ فَقَالَ هُوَ الْحَارِثُ بْنُ حَاطِبٍ أَخُو مُحَمَّدِ بْنِ حَاطِبٍ ثُمَّ قَالَ الأَمِيرُ إِنَّ فِيكُمْ مَنْ هُوَ أَعْلَمُ بِاللَّهِ وَرَسُولِهِ مِنِّي وَشَهِدَ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ وَأَوْمَأَ بِيَدِهِ إِلَى رَجُلٍ قَالَ الْحُسَيْنُ فَقُلْتُ لِشَيْخٍ إِلَى جَنْبِي مَنْ هَذَا الَّذِي أَوْمَأَ إِلَيْهِ الأَمِيرُ قَالَ هَذَا عَبْدُ اللَّهِ بْنُ عُمَرَ ‏.‏ وَصَدَقَ كَانَ أَعْلَمَ بِاللَّهِ مِنْهُ فَقَالَ بِذَلِكَ أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Husayn ibn al-Harith al-Jadli dari suku Jadilah Qays berkata: Gabenor Mekah menyampaikan ucapan dan berkata: Rasulullah (ﷺ) telah mengambil janji daripada kami bahawa kami harus melaksanakan ibadah haji setelah melihat anak bulan. Jika kami tidak melihatnya dan dua orang yang dipercayai memberi kesaksian, kami harus melaksanakan ibadah haji berdasarkan kesaksian mereka. Kemudian saya bertanya kepada al-Husayn ibn al-Harith: Siapakah gabenor Mekah itu? Beliau menjawab: Saya tidak tahu. Kemudian beliau bertemu saya kemudian dan memberitahu saya: Beliau adalah al-Harith ibn Hatib, saudara kepada Muhammad ibn Hatib. Gabenor itu kemudian berkata: Di antara kamu ada seorang lelaki yang lebih mengenali Allah dan Rasul-Nya daripada saya. Beliau menyaksikan ini daripada Rasulullah (ﷺ). Kemudian beliau menunjuk dengan tangannya kepada seorang lelaki. Al-Husayn berkata: Saya bertanya kepada seorang lelaki tua di sebelah saya: Siapakah lelaki yang ditunjuk oleh gabenor itu? Beliau berkata: \"Ini adalah Abdullah ibn Umar, dan beliau berkata benar. Beliau lebih mengenali Allah daripada beliau. Beliau (Abdullah ibn Umar) berkata: Inilah yang diperintahkan oleh Rasulullah (ﷺ) kepada kami (untuk dilakukan)."
  },
  {
    "id": 22844,
    "hadith_number": 2340,
    "tajuk_hadith": "Pengesahan Hilal Ramadan oleh Badwi dan Arahan untuk Berbuka Puasa",
    "perawi_melayu": "Diriwayatkan oleh Rib'i b. Hirash:",
    "english_text": "On the authority of a man from the Companions of the Prophet (ﷺ): People differed among themselves on the last day of Ramadan (about the appearance of the moon of Shawwal). Then two bedouins came and witnessed before the Prophet (ﷺ) swearing by Allah that they had sighted moon the previous evening. So the Messenger of Allah (ﷺ) commanded the people to break the fast. The narrator Khalaf has added in his version: \"and that they should proceed to the place of prayer (for 'Id)\".",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، وَخَلَفُ بْنُ هِشَامٍ الْمُقْرِئُ، قَالاَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مَنْصُورٍ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ رَجُلٍ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم قَالَ اخْتَلَفَ النَّاسُ فِي آخِرِ يَوْمٍ مِنْ رَمَضَانَ فَقَدِمَ أَعْرَابِيَّانِ فَشَهِدَا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِاللَّهِ لأَهَلاَّ الْهِلاَلَ أَمْسِ عَشِيَّةً فَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم النَّاسَ أَنْ يُفْطِرُوا زَادَ خَلَفٌ فِي حَدِيثِهِ وَأَنْ يَغْدُوا إِلَى مُصَلاَّهُمْ ‏.‏",
    "malay_translation": "Daripada seorang lelaki dari kalangan Sahabat Nabi (ﷺ): Orang ramai berselisih pendapat pada hari terakhir Ramadan (mengenai kemunculan anak bulan Syawal). Kemudian datang dua orang Badwi dan memberi kesaksian di hadapan Nabi (ﷺ) bersumpah dengan nama Allah bahawa mereka telah melihat anak bulan pada petang sebelumnya. Maka Rasulullah (ﷺ) memerintahkan orang ramai untuk berbuka puasa. Perawi Khalaf telah menambahkan dalam riwayatnya: \"dan supaya mereka pergi ke tempat solat (untuk 'Id)\"."
  },
  {
    "id": 22845,
    "hadith_number": 2341,
    "tajuk_hadith": "Pengisytiharan Puasa Ramadan Berdasarkan Penglihatan Anak Bulan",
    "perawi_melayu": "Diriwayatkan oleh Abdullah ibn Abbas:",
    "english_text": "A bedouin came to the Prophet (ﷺ) and said: I have sighted the moon. Al-Hasan added in his version: that is, of Ramadan. He asked: Do you testify that there is no god but Allah? He replied: Yes. He again asked: Do you testify that Muhammad is the Messenger of Allah? He replied: Yes. and he testified that he had sighted the moon. He said: Bilal, announce to the people that they must fast tomorrow.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارِ بْنِ الرَّيَّانِ، حَدَّثَنَا الْوَلِيدُ، - يَعْنِي ابْنَ أَبِي ثَوْرٍ ح وَحَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا الْحُسَيْنُ، - يَعْنِي الْجُعْفِيَّ - عَنْ زَائِدَةَ، - الْمَعْنَى - عَنْ سِمَاكٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ إِنِّي رَأَيْتُ الْهِلاَلَ - قَالَ الْحَسَنُ فِي حَدِيثِهِ يَعْنِي رَمَضَانَ - فَقَالَ ‏\"‏ أَتَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ أَتَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ يَا بِلاَلُ أَذِّنْ فِي النَّاسِ فَلْيَصُومُوا غَدًا ‏\"‏ ‏.‏",
    "malay_translation": "Seorang Badwi datang kepada Nabi (ﷺ) dan berkata: 'Saya telah melihat anak bulan.' Al-Hasan menambahkan dalam riwayatnya: iaitu, bulan Ramadan. Baginda bertanya: 'Adakah kamu bersaksi bahawa tiada tuhan melainkan Allah?' Dia menjawab: 'Ya.' Baginda bertanya lagi: 'Adakah kamu bersaksi bahawa Muhammad adalah Rasul Allah?' Dia menjawab: 'Ya.' dan dia bersaksi bahawa dia telah melihat anak bulan. Baginda bersabda: 'Wahai Bilal, umumkan kepada orang ramai supaya mereka berpuasa esok.'"
  },
  {
    "id": 22846,
    "hadith_number": 2342,
    "tajuk_hadith": "Keraguan Terhadap Kemunculan Anak Bulan Ramadan dan Kesaksian Seorang Badwi",
    "perawi_melayu": "Diriwayatkan oleh Ikrimah:",
    "english_text": "Once the people doubted the appearance of the moon of Ramadan, and intended neither to offer the tarawih prayer nor to keep fast. A bedouin came from al-Harrah and testified that he had sighted the moon. He was brought to the Prophet (ﷺ). He asked: Do you testify that there is no god but Allah, and that I am the Messenger of Allah? He said: Yes; and he testified that he had sighted the moon. He commanded Bilal who announced to the people to offer the tarawih prayer and to keep fast.",
    "arabic_text": "حَدَّثَنِي مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ عِكْرِمَةَ، أَنَّهُمْ شَكُّوا فِي هِلاَلِ رَمَضَانَ مَرَّةً فَأَرَادُوا أَنْ لاَ يَقُومُوا وَلاَ يَصُومُوا فَجَاءَ أَعْرَابِيٌّ مِنَ الْحَرَّةِ فَشَهِدَ أَنَّهُ رَأَى الْهِلاَلَ فَأُتِيَ بِهِ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ أَتَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنِّي رَسُولُ اللَّهِ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ وَشَهِدَ أَنَّهُ رَأَى الْهِلاَلَ فَأَمَرَ بِلاَلاً فَنَادَى فِي النَّاسِ أَنْ يَقُومُوا وَأَنْ يَصُومُوا ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ جَمَاعَةٌ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ مُرْسَلاً وَلَمْ يَذْكُرِ الْقِيَامَ أَحَدٌ إِلاَّ حَمَّادُ بْنُ سَلَمَةَ ‏.‏",
    "malay_translation": "Pada suatu ketika, orang ramai meragui kemunculan anak bulan Ramadan, dan bercadang untuk tidak menunaikan solat tarawih atau berpuasa. Seorang Badwi datang dari al-Harrah dan memberi kesaksian bahawa dia telah melihat anak bulan. Dia dibawa kepada Nabi (ﷺ). Baginda bertanya: Adakah kamu bersaksi bahawa tiada tuhan melainkan Allah, dan bahawa aku adalah Rasul Allah? Dia berkata: Ya; dan dia bersaksi bahawa dia telah melihat anak bulan. Baginda memerintahkan Bilal untuk mengumumkan kepada orang ramai untuk menunaikan solat tarawih dan berpuasa."
  },
  {
    "id": 22847,
    "hadith_number": 2343,
    "tajuk_hadith": "Penglihatan Anak Bulan dan Arahan untuk Berpuasa",
    "perawi_melayu": "Diriwayatkan oleh Abdullah ibn Umar:",
    "english_text": "The people looked for the moon, so I informed the Messenger of Allah (ﷺ) that I had sighted it. He fasted and commanded the people to fast.",
    "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ، وَعَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ السَّمَرْقَنْدِيُّ، - وَأَنَا لِحَدِيثِهِ، أَتْقَنُ - قَالاَ حَدَّثَنَا مَرْوَانُ، - هُوَ ابْنُ مُحَمَّدٍ - عَنْ عَبْدِ اللَّهِ بْنِ وَهْبٍ، عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ سَالِمٍ، عَنْ أَبِي بَكْرِ بْنِ نَافِعٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، قَالَ تَرَاءَى النَّاسُ الْهِلاَلَ فَأَخْبَرْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنِّي رَأَيْتُهُ فَصَامَهُ وَأَمَرَ النَّاسَ بِصِيَامِهِ ‏.‏",
    "malay_translation": "Orang ramai mencari anak bulan, jadi saya memberitahu Rasulullah (ﷺ) bahawa saya telah melihatnya. Baginda berpuasa dan memerintahkan orang ramai untuk berpuasa."
  },
  {
    "id": 22848,
    "hadith_number": 2344,
    "tajuk_hadith": "Perbezaan Puasa Kita dengan Ahli Kitab: Sahur",
    "perawi_melayu": "Diriwayatkan oleh 'Amr b. al-'As:",
    "english_text": "The Messenger of Allah (ﷺ) as saying: The difference between our fasting and that of the people of the Book is eating shortly before dawn.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ مُوسَى بْنِ عُلَىِّ بْنِ رَبَاحٍ، عَنْ أَبِيهِ، عَنْ أَبِي قَيْسٍ، مَوْلَى عَمْرِو بْنِ الْعَاصِ عَنْ عَمْرِو بْنِ الْعَاصِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ فَصْلَ مَا بَيْنَ صِيَامِنَا وَصِيَامِ أَهْلِ الْكِتَابِ أَكْلَةُ السَّحَرِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda: Perbezaan antara puasa kita dan puasa Ahli Kitab adalah makan sebelum fajar (sahur)."
  },
  {
    "id": 22849,
    "hadith_number": 2345,
    "tajuk_hadith": "Jemputan Rasulullah SAW ke Sahur yang Berkat",
    "perawi_melayu": "Diriwayatkan oleh Al-Irbad ibn Sariyyah:",
    "english_text": "The Messenger of Allah (ﷺ) invited me to a meal shortly before dawn in Ramadan saying: Come to the blessed morning meal.",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ النَّاقِدُ، حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ الْخَيَّاطُ، حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ، عَنْ يُونُسَ بْنِ سَيْفٍ، عَنِ الْحَارِثِ بْنِ زِيَادٍ، عَنْ أَبِي رُهْمٍ، عَنِ الْعِرْبَاضِ بْنِ سَارِيَةَ، قَالَ دَعَانِي رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى السَّحُورِ فِي رَمَضَانَ فَقَالَ ‏\n\"‏ هَلُمَّ إِلَى الْغَدَاءِ الْمُبَارَكِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) menjemput saya untuk makan sebelum fajar di bulan Ramadan, dengan bersabda: Marilah menuju ke hidangan pagi yang diberkati ini."
  },
  {
    "id": 22850,
    "hadith_number": 2346,
    "tajuk_hadith": "Keutamaan Kurma Sebagai Sahur Bagi Mukmin",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) as saying: How good is the believers meal of dates shortly before dawn.",
    "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ الْحَسَنِ بْنِ إِبْرَاهِيمَ، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي الْوَزِيرِ أَبُو الْمُطَرِّفِ، حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ نِعْمَ سَحُورُ الْمُؤْمِنِ التَّمْرُ ‏\"‏ ‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda: “Sebaik-baik makanan sahur bagi seorang mukmin adalah kurma.”"
  },
  {
    "id": 22851,
    "hadith_number": 2347,
    "tajuk_hadith": "Azan Bilal Bukan Penghalang Sahur",
    "perawi_melayu": "Daripada (orang ramai) Samurah bin Jundub meriwayatkan bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "The adhan (call to prayer) of Bilal should not prevent you from taking a meal shortly before dawn, not does the whiteness of horizon (before dawn) in this way (vertically) until it spreads out horizontally.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَبْدِ اللَّهِ بْنِ سَوَادَةَ الْقُشَيْرِيِّ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ سَمُرَةَ بْنَ جُنْدُبٍ، يَخْطُبُ وَهُوَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَمْنَعَنَّ مِنْ سَحُورِكُمْ أَذَانُ بِلاَلٍ وَلاَ بَيَاضُ الأُفُقِ الَّذِي هَكَذَا حَتَّى يَسْتَطِيرَ ‏\"‏ ‏.‏",
    "malay_translation": "Azan (seruan untuk solat) Bilal tidak seharusnya menghalang kamu daripada mengambil makanan sahur, begitu juga keputihan ufuk (sebelum fajar) secara ini (menegak) sehingga ia merebak secara mendatar."
  },
  {
    "id": 22852,
    "hadith_number": 2348,
    "tajuk_hadith": "Azan Bilal dan Waktu Sahur serta Fajar",
    "perawi_melayu": "Diriwayatkan oleh 'Abd Allah bin Mas'ud:",
    "english_text": "The Messenger of Allah (ﷺ) as saying: The summons (adhan) of Bilal should not restrain one of you from taking a meal shortly before dawn, for he utters adhan or calls (for prayer) so that the man at prayer may return, and the man asleep may get up. Dawn is not (the whiteness) which indicates thus (in perpendicular) - the narrator Musaddad said: Yahya joined his palms (indicating the spread of whiteness vertically - until it indicates thus - and Yahya spread out two ring-fingers of his (demonstrating the spread of whiteness horizontally)l",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنِ التَّيْمِيِّ، ح وَحَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا سُلَيْمَانُ التَّيْمِيُّ، عَنْ أَبِي عُثْمَانَ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَمْنَعَنَّ أَحَدَكُمْ أَذَانُ بِلاَلٍ مِنْ سَحُورِهِ فَإِنَّهُ يُؤَذِّنُ - أَوْ قَالَ يُنَادِي - لِيَرْجِعَ قَائِمُكُمْ وَيَنْتَبِهَ نَائِمُكُمْ وَلَيْسَ الْفَجْرُ أَنْ يَقُولَ هَكَذَا ‏\"‏ ‏.‏ قَالَ مُسَدَّدٌ وَجَمَعَ يَحْيَى كَفَّيْهِ حَتَّى يَقُولَ هَكَذَا وَمَدَّ يَحْيَى بِأُصْبَعَيْهِ السَّبَّابَتَيْنِ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda: \"Azan Bilal tidak seharusnya menghalang kamu daripada bersahur, kerana beliau melaungkan azan (atau menyeru) supaya orang yang sedang solat dapat kembali dan orang yang tidur dapat bangun. Fajar bukanlah (keputihan) yang seperti ini (menegak).\" Perawi Musaddad berkata: \"Yahya menggabungkan kedua tapak tangannya (menunjukkan keputihan merebak secara menegak) - sehingga ia menjadi seperti ini - dan Yahya menghulurkan dua jari telunjuknya (menunjukkan keputihan merebak secara mendatar).\""
  },
  {
    "id": 22853,
    "hadith_number": 2349,
    "tajuk_hadith": "Anjuran Makan dan Minum Sehingga Cahaya Merah Mendatar",
    "perawi_melayu": "Diriwayatkan oleh Talq ibn Ali al-Yamami:",
    "english_text": "The Messenger of Allah (ﷺ) said: Eat and drink; let not the white and ascending light prevent you from (eating and drinking); so eat and drink until the red light spreads horizontally.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، حَدَّثَنَا مُلاَزِمُ بْنُ عَمْرٍو، عَنْ عَبْدِ اللَّهِ بْنِ النُّعْمَانِ، حَدَّثَنِي قَيْسُ بْنُ طَلْقٍ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ كُلُوا وَاشْرَبُوا وَلاَ يَهِيدَنَّكُمُ السَّاطِعُ الْمُصْعِدُ فَكُلُوا وَاشْرَبُوا حَتَّى يَعْتَرِضَ لَكُمُ الأَحْمَرُ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ هَذَا مِمَّا تَفَرَّدَ بِهِ أَهْلُ الْيَمَامَةِ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda: Makan dan minumlah; janganlah cahaya putih yang meninggi menghalang kamu dari (makan dan minum); maka makan dan minumlah sehingga cahaya merah merebak secara mendatar."
  },
  {
    "id": 22854,
    "hadith_number": 2350,
    "tajuk_hadith": "Penjelasan Ayat tentang Benang Putih dan Hitam Fajar",
    "perawi_melayu": "Diriwayatkan dari 'Adi bin Hatim:",
    "english_text": "When the verse \"Until the white thread of dawn appear to you distinct from its black thread\" was revealed, I took a white rope and a black rope, and placed them beneath my pillow ; and then I looked at them, byt they were not clear to me. So I mentioned it to the Messenger of Allah (ﷺ). He laughed and said: Your pillow is so broad and lengthy ; that is (i.e. means) night and day. The version of the narrator 'Uthman has: That is the blackness of night and whiteness of day.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حُصَيْنُ بْنُ نُمَيْرٍ، ح وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ إِدْرِيسَ، - الْمَعْنَى - عَنْ حُصَيْنٍ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ لَمَّا نَزَلَتْ هَذِهِ الآيَةُ ‏{‏ حَتَّى يَتَبَيَّنَ لَكُمُ الْخَيْطُ الأَبْيَضُ مِنَ الْخَيْطِ الأَسْوَدِ ‏}‏ ‏.‏ قَالَ أَخَذْتُ عِقَالاً أَبْيَضَ وَعِقَالاً أَسْوَدَ فَوَضَعْتُهُمَا تَحْتَ وِسَادَتِي فَنَظَرْتُ فَلَمْ أَتَبَيَّنْ فَذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَضَحِكَ فَقَالَ ‏\"‏ إِنَّ وِسَادَكَ لَعَرِيضٌ طَوِيلٌ إِنَّمَا هُوَ اللَّيْلُ وَالنَّهَارُ ‏\"‏ ‏.‏ قَالَ عُثْمَانُ ‏\"‏ إِنَّمَا هُوَ سَوَادُ اللَّيْلِ وَبَيَاضُ النَّهَارِ ‏\"‏ ‏.‏",
    "malay_translation": "Ketika ayat \"Sehingga jelas kepada kamu benang putih fajar daripada benang hitam\" diturunkan, saya mengambil seutas tali putih dan seutas tali hitam, dan meletakkannya di bawah bantal saya; kemudian saya melihatnya, tetapi ia tidak jelas bagi saya. Lalu saya menyebutkan hal itu kepada Rasulullah (ﷺ). Baginda tertawa dan bersabda: Bantalmu sungguh lebar dan panjang; yang dimaksudkan adalah malam dan siang. Versi perawi 'Uthman menyatakan: Yang dimaksudkan adalah kegelapan malam dan keputihan siang."
  },
  {
    "id": 22855,
    "hadith_number": 2351,
    "tajuk_hadith": "Jangan Meletakkan Bekas Ketika Azan Sehingga Selesai Hajat",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said: When any of you hears the summons to prayer while he has a vessel in his hand, he should not lay it down till he fulfils his need.",
    "arabic_text": "حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، حَدَّثَنَا حَمَّادٌ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا سَمِعَ أَحَدُكُمُ النِّدَاءَ وَالإِنَاءُ عَلَى يَدِهِ فَلاَ يَضَعْهُ حَتَّى يَقْضِيَ حَاجَتَهُ مِنْهُ ‏\"‏ ‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda: Apabila salah seorang daripada kamu mendengar seruan azan sedangkan bekas berada di tangannya, maka janganlah dia meletakkannya sehingga dia menunaikan hajatnya daripadanya."
  },
  {
    "id": 22856,
    "hadith_number": 2352,
    "tajuk_hadith": "Waktu Berbuka Puasa",
    "perawi_melayu": "Diriwayatkan oleh 'Umar:",
    "english_text": "The Prophet (ﷺ) as saying: When the night approaches from this side and the day retreats on that side, and the sun sets  - according to the version of Musaddad - he who fasts has reached the time to break it.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا هِشَامٌ، ح وَحَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ، عَنْ هِشَامٍ، - الْمَعْنَى - قَالَ هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ، عَنْ عَاصِمِ بْنِ عُمَرَ، عَنْ أَبِيهِ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِذَا جَاءَ اللَّيْلُ مِنْ هَا هُنَا وَذَهَبَ النَّهَارُ مِنْ هَا هُنَا ‏\"‏ ‏.‏ زَادَ مُسَدَّدٌ ‏\"‏ وَغَابَتِ الشَّمْسُ فَقَدْ أَفْطَرَ الصَّائِمُ ‏\"‏ ‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda: Apabila malam menjelang dari arah ini dan siang berundur dari arah itu, dan matahari terbenam - menurut riwayat Musaddad - maka orang yang berpuasa telah tiba waktu untuk berbuka."
  },
  {
    "id": 22857,
    "hadith_number": 2353,
    "tajuk_hadith": "Waktu Berbuka Puasa: Malam Tiba dari Timur",
    "perawi_melayu": "Perawi: 'Abd Allah b. Abi Awfa:",
    "english_text": "We went along with the Messenger of Allah (ﷺ) while he was fasting. When the sun set, he said to Bilal: Bilal, come down and prepare barley beverage for us. He said: Messenger of Allah, would  that you waited for the evening. He said: Come down and prepare barley beverage for us. He said: Messenger of Allah, the say still remains on you (i.e. there remains the brightness of the day). He said: Come down and prepare barley drink for us. So he came down and prepared barley drink. The Messenger of Allah (ﷺ) drank it and said: When you see that the night approaches from this side, he who fasts has reached the time to break it ; and he pointed to the east with his finger.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا سُلَيْمَانُ الشَّيْبَانِيُّ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى، يَقُولُ سِرْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ صَائِمٌ فَلَمَّا غَرَبَتِ الشَّمْسُ قَالَ ‏\"‏ يَا بِلاَلُ انْزِلْ فَاجْدَحْ لَنَا ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ لَوْ أَمْسَيْتَ ‏.‏ قَالَ ‏\"‏ انْزِلْ فَاجْدَحْ لَنَا ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ إِنَّ عَلَيْكَ نَهَارًا ‏.‏ قَالَ ‏\"‏ انْزِلْ فَاجْدَحْ لَنَا ‏\"‏ ‏.‏ فَنَزَلَ فَجَدَحَ فَشَرِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ ‏\"‏ إِذَا رَأَيْتُمُ اللَّيْلَ قَدْ أَقْبَلَ مِنْ هَا هُنَا فَقَدْ أَفْطَرَ الصَّائِمُ ‏\"‏ ‏.‏ وَأَشَارَ بِأُصْبُعِهِ قِبَلَ الْمَشْرِقِ ‏.‏",
    "malay_translation": "Kami berjalan bersama Rasulullah (ﷺ) ketika baginda sedang berpuasa. Apabila matahari terbenam, baginda bersabda kepada Bilal: Bilal, turun dan sediakan minuman barli untuk kita. Bilal berkata: Ya Rasulullah, bagaimana jika engkau menunggu sehingga petang? Baginda bersabda: Turun dan sediakan minuman barli untuk kita. Bilal berkata: Ya Rasulullah, sesungguhnya masih siang lagi. Baginda bersabda: Turun dan sediakan minuman barli untuk kita. Maka Bilal pun turun dan menyediakan minuman barli. Rasulullah (ﷺ) meminumnya dan bersabda: Apabila kamu melihat malam datang dari arah ini, maka orang yang berpuasa telah tiba waktu untuk berbuka puasa; dan baginda menunjuk ke arah timur dengan jarinya."
  },
  {
    "id": 22858,
    "hadith_number": 2354,
    "tajuk_hadith": "Keutamaan Menyegerakan Berbuka Puasa",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said: Religion will continue to prevail as long as people hasten to break the fast, because the Jews and the Christians delay doing so.",
    "arabic_text": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ، عَنْ خَالِدٍ، عَنْ مُحَمَّدٍ، - يَعْنِي ابْنَ عَمْرٍو - عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَزَالُ الدِّينُ ظَاهِرًا مَا عَجَّلَ النَّاسُ الْفِطْرَ لأَنَّ الْيَهُودَ وَالنَّصَارَى يُؤَخِّرُونَ ‏\"‏ ‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda: Agama akan sentiasa teguh selagi orang ramai menyegerakan berbuka puasa, kerana orang Yahudi dan Nasrani melambatkan berbuat demikian."
  },
  {
    "id": 22859,
    "hadith_number": 2355,
    "tajuk_hadith": "Bersegera Berbuka Puasa dan Solat Seperti Rasulullah ﷺ",
    "perawi_melayu": "Diriwayatkan oleh Abu 'Atiyyah:",
    "english_text": "I and Masruq entered upon 'Aishah and we said: Mother of believers, there are two persons from the Companions of the Muhammad (ﷺ). One of them hastens to break the fast and hastens to pray while the other delays to break the fast and delays praying. She asked: Which of them hastens to break the fast and hasten to pray ? We replied: 'Abd Allah (b. Mas'ud). She said: Thus did the Messenger of Allah (ﷺ) do.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ أَبِي عَطِيَّةَ، قَالَ دَخَلْتُ عَلَى عَائِشَةَ - رضى الله عنها - أَنَا وَمَسْرُوقٌ فَقُلْنَا يَا أُمَّ الْمُؤْمِنِينَ رَجُلاَنِ مِنْ أَصْحَابِ مُحَمَّدٍ صلى الله عليه وسلم أَحَدُهُمَا يُعَجِّلُ الإِفْطَارَ وَيُعَجِّلُ الصَّلاَةَ وَالآخَرُ يُؤَخِّرُ الإِفْطَارَ وَيُؤَخِّرُ الصَّلاَةَ قَالَتْ أَيُّهُمَا يُعَجِّلُ الإِفْطَارَ وَيُعَجِّلُ الصَّلاَةَ قُلْنَا عَبْدُ اللَّهِ ‏.‏ قَالَتْ كَذَلِكَ كَانَ يَصْنَعُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Saya dan Masruq masuk menemui Aisyah dan kami berkata: Wahai Ibu orang-orang mukmin, ada dua orang daripada sahabat Muhammad ﷺ. Salah seorang daripada mereka bersegera berbuka puasa dan bersegera solat manakala yang seorang lagi melambatkan berbuka puasa dan melambatkan solat. Dia bertanya: Siapakah antara mereka yang bersegera berbuka puasa dan bersegera solat? Kami menjawab: 'Abd Allah (bin Mas'ud). Dia berkata: Demikianlah yang dilakukan oleh Rasulullah ﷺ."
  },
  {
    "id": 22860,
    "hadith_number": 2356,
    "tajuk_hadith": "Berbuka Puasa dengan Kurma atau Air",
    "perawi_melayu": "Perawi: Salman ibn Amir:",
    "english_text": "The Prophet (ﷺ) said: When one of you is fasting, he should break his fast with dates; but if he cannot get any, then (he should break his fast) with water, for water is purifying.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، عَنْ عَاصِمٍ الأَحْوَلِ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ، عَنِ الرَّبَابِ، عَنْ سَلْمَانَ بْنِ عَامِرٍ، عَمِّهَا قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا كَانَ أَحَدُكُمْ صَائِمًا فَلْيُفْطِرْ عَلَى التَّمْرِ فَإِنْ لَمْ يَجِدِ التَّمْرَ فَعَلَى الْمَاءِ فَإِنَّ الْمَاءَ طَهُورٌ ‏\"‏ ‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda: Apabila salah seorang daripada kamu berpuasa, maka hendaklah dia berbuka puasa dengan kurma; tetapi jika dia tidak mendapatkannya, maka (hendaklah dia berbuka puasa) dengan air, kerana air itu suci."
  },
  {
    "id": 22861,
    "hadith_number": 2357,
    "tajuk_hadith": "Cara Rasulullah ﷺ Berbuka Puasa",
    "perawi_melayu": "Diriwayatkan oleh Anas ibn Malik:",
    "english_text": "The Messenger of Allah (ﷺ) used to break his fast before praying with some fresh dates; but if there were no fresh dates, he had a few dry dates, and if there were no dry dates, he took some mouthfuls of water.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُفْطِرُ عَلَى رُطَبَاتٍ قَبْلَ أَنْ يُصَلِّيَ فَإِنْ لَمْ تَكُنْ رُطَبَاتٌ فَعَلَى تَمَرَاتٍ فَإِنْ لَمْ تَكُنْ حَسَا حَسَوَاتٍ مِنْ مَاءٍ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) biasa berbuka puasa sebelum solat dengan beberapa biji kurma segar; jika tiada kurma segar, baginda akan berbuka dengan beberapa biji kurma kering; dan jika tiada kurma kering, baginda mengambil beberapa teguk air."
  },
  {
    "id": 22862,
    "hadith_number": 2358,
    "tajuk_hadith": "Amalan Ibn Umar Memotong Janggut dan Doa Ketika Berbuka Puasa",
    "perawi_melayu": "Marwan ibn Salim al-Muqaffa' berkata:",
    "english_text": "I saw Ibn Umar holding his beard with his hand and cutting what exceeded the handful of it. He (Ibn Umar) said that the Prophet (ﷺ) said when he broke his fast: Thirst has gone, the arteries are moist, and the reward is sure, if Allah wills.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ يَحْيَى أَبُو مُحَمَّدٍ، حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ، أَخْبَرَنِي الْحُسَيْنُ بْنُ وَاقِدٍ، حَدَّثَنَا مَرْوَانُ، - يَعْنِي ابْنَ سَالِمٍ - الْمُقَفَّعُ - قَالَ رَأَيْتُ ابْنَ عُمَرَ يَقْبِضُ عَلَى لِحْيَتِهِ فَيَقْطَعُ مَا زَادَ عَلَى الْكَفِّ وَقَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَفْطَرَ قَالَ ‏\n\"‏ ذَهَبَ الظَّمَأُ وَابْتَلَّتِ الْعُرُوقُ وَثَبَتَ الأَجْرُ إِنْ شَاءَ اللَّهُ ‏\"‏ ‏.‏",
    "malay_translation": "Saya melihat Ibn Umar memegang janggutnya dengan tangannya dan memotong lebihan daripada genggamannya. Beliau (Ibn Umar) berkata bahawa Nabi (ﷺ) bersabda ketika baginda berbuka puasa: Dahaga telah hilang, urat-urat telah basah, dan ganjaran adalah pasti, insya-Allah."
  },
  {
    "id": 22863,
    "hadith_number": 2359,
    "tajuk_hadith": "Doa Berbuka Puasa Nabi (ﷺ)",
    "perawi_melayu": "Diriwayatkan oleh Mu'adh ibn Zuhrah:",
    "english_text": "The Prophet of Allah (ﷺ) used to say when he broke his fast: O Allah, for Thee I have fasted, and with Thy provision I have broken my fast.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا هُشَيْمٌ، عَنْ حُصَيْنٍ، عَنْ مُعَاذِ بْنِ زُهْرَةَ، أَنَّهُ بَلَغَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا أَفْطَرَ قَالَ ‏\n\"‏ اللَّهُمَّ لَكَ صُمْتُ وَعَلَى رِزْقِكَ أَفْطَرْتُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) biasa mengucapkan ketika berbuka puasa: Ya Allah, untuk-Mu aku berpuasa, dan dengan rezeki-Mu aku berbuka."
  },
  {
    "id": 22864,
    "hadith_number": 2360,
    "tajuk_hadith": "Berbuka Puasa pada Hari Mendung dan Matahari Muncul Semula",
    "perawi_melayu": "Diriwayatkan dari Asma' binti Abu Bakr :",
    "english_text": "We broke the fast one during Ramadan when it was cloudy in the lifetime of the Messenger of Allah (ﷺ) ; then the sun rose. Abu Usamah said: I said to Hisham: Were they commanded to atone for it ? He replied: That was inevitable.",
    "arabic_text": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، وَمُحَمَّدُ بْنُ الْعَلاَءِ، - الْمَعْنَى - قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، قَالَتْ أَفْطَرْنَا يَوْمًا فِي رَمَضَانَ فِي غَيْمٍ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ طَلَعَتِ الشَّمْسُ قَالَ أَبُو أُسَامَةَ قُلْتُ لِهِشَامٍ أُمِرُوا بِالْقَضَاءِ قَالَ وَبُدٌّ مِنْ ذَلِكَ",
    "malay_translation": "Kami berbuka puasa pada suatu hari di bulan Ramadan ketika hari mendung pada zaman Rasulullah (ﷺ); kemudian matahari muncul. Abu Usamah berkata: Saya berkata kepada Hisham: Adakah mereka diperintahkan untuk menggantinya (qadha')? Dia menjawab: Itu tidak dapat dielakkan."
  },
  {
    "id": 22865,
    "hadith_number": 2361,
    "tajuk_hadith": "Larangan Puasa Berterusan dan Keistimewaan Rasulullah",
    "perawi_melayu": "Diriwayatkan oleh Ibn 'Umar:",
    "english_text": "The Messenger of Allah (ﷺ) prohibited perpetual fasting. They (the people) said: You keep perpetual fasting, Messenger of Allah. He said: My position is not like that you yours. I am provided with food and drink.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ نَهَى عَنِ الْوِصَالِ، قَالُوا فَإِنَّكَ تُوَاصِلُ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\n\"‏ إِنِّي لَسْتُ كَهَيْئَتِكُمْ إِنِّي أُطْعَمُ وَأُسْقَى ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) melarang puasa berterusan. Mereka (orang ramai) berkata: Anda melakukan puasa berterusan, ya Rasulullah. Baginda bersabda: Kedudukan saya tidak seperti kedudukan kamu. Saya diberi makan dan minum."
  },
  {
    "id": 22866,
    "hadith_number": 2362,
    "tajuk_hadith": "Larangan Berpuasa Berterusan dan Keistimewaan Rasulullah ﷺ",
    "perawi_melayu": "Diriwayatkan oleh Abu Sa'id al-Khudri:",
    "english_text": "The Messenger of Allah (ﷺ) as saying: Do not observe perpetual fasting. If any of you wants to observe perpetual fast, he should observe it until the dawn. They (the people) asked: You observe perpetual fast ? He replied: My position is not like that of yours. There is One Who gives me to eat, and there is One who gives me to drink.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، أَنَّ بَكْرَ بْنَ مُضَرَ، حَدَّثَهُمْ عَنِ ابْنِ الْهَادِ، عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ تُوَاصِلُوا فَأَيُّكُمْ أَرَادَ أَنْ يُوَاصِلَ فَلْيُوَاصِلْ حَتَّى السَّحَرِ ‏\"‏ ‏.‏ قَالُوا فَإِنَّكَ تُوَاصِلُ ‏.‏ قَالَ ‏\"‏ إِنِّي لَسْتُ كَهَيْئَتِكُمْ إِنَّ لِي مُطْعِمًا يُطْعِمُنِي وَسَاقِيًا يَسْقِينِي ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda: Janganlah kamu berpuasa berterusan. Jika ada di antara kamu yang ingin berpuasa berterusan, maka hendaklah dia berpuasa hingga waktu sahur. Mereka (para sahabat) bertanya: Engkau berpuasa berterusan? Baginda menjawab: Kedudukanku tidaklah seperti kedudukan kamu. Sesungguhnya ada Zat yang memberi makan kepadaku, dan ada Zat yang memberi minum kepadaku."
  },
  {
    "id": 22867,
    "hadith_number": 2363,
    "tajuk_hadith": "Larangan Dusta dan Perbuatan Buruk Walaupun Berpuasa",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "The Messenger of Allah (ﷺ) as saying: If anyone does not abandon falsehood and action is accordance with it, Allah has no need that he should abandon his food and drink.\n\n\nThe narrator Ahmad (b. Yunus) said: I learnt the chain of narrators from Ibn Abi Dhi'b, and a man by his side made me understand the tradition. I think he was his cousin.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الْمَقْبُرِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ لَمْ يَدَعْ قَوْلَ الزُّورِ وَالْعَمَلَ بِهِ فَلَيْسَ لِلَّهِ حَاجَةٌ أَنْ يَدَعَ طَعَامَهُ وَشَرَابَهُ ‏\"‏ ‏.‏ قَالَ أَحْمَدُ فَهِمْتُ إِسْنَادَهُ مِنَ ابْنِ أَبِي ذِئْبٍ وَأَفْهَمَنِي الْحَدِيثَ رَجُلٌ إِلَى جَنْبِهِ أُرَاهُ ابْنَ أَخِيهِ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda: Jika seseorang tidak meninggalkan perkataan dusta dan perbuatan yang sesuai dengannya, maka Allah tidak memerlukan dia meninggalkan makanan dan minumannya.\n\nPerawi Ahmad (b. Yunus) berkata: Saya mempelajari sanad hadis dari Ibn Abi Dhi'b, dan seorang lelaki di sisinya membuat saya memahami hadis ini. Saya rasa dia adalah sepupunya."
  },
  {
    "id": 22868,
    "hadith_number": 2364,
    "tajuk_hadith": "Puasa Adalah Perisai dan Adab Berpuasa",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) as saying: Fast is a shield ; when one of you is fasting, he should neither behave in an obscene manner nor foolishly. If a man fights or abuses him, he should say: I am fasting, I am fasting.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الصِّيَامُ جُنَّةٌ إِذَا كَانَ أَحَدُكُمْ صَائِمًا فَلاَ يَرْفُثْ وَلاَ يَجْهَلْ فَإِنِ امْرُؤٌ قَاتَلَهُ أَوْ شَاتَمَهُ فَلْيَقُلْ إِنِّي صَائِمٌ إِنِّي صَائِمٌ ‏\"‏ ‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda: Puasa adalah perisai; apabila salah seorang daripada kamu berpuasa, maka janganlah dia berkelakuan lucah atau bodoh. Jika seseorang bertengkar atau mencacinya, maka hendaklah dia berkata: Sesungguhnya aku berpuasa, sesungguhnya aku berpuasa."
  },
  {
    "id": 22869,
    "hadith_number": 2365,
    "tajuk_hadith": "Rasulullah (ﷺ) Menggunakan Kayu Sugi Ketika Berpuasa",
    "perawi_melayu": "Diriwayatkan oleh Amir ibn Rabi'ah:",
    "english_text": "I have seen the Messenger of Allah (ﷺ) using a tooth-stick while he was fasting. Musaddad added in his version: \"more often than I could count.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا شَرِيكٌ، ح وَحَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ، عَنْ أَبِيهِ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَسْتَاكُ وَهُوَ صَائِمٌ ‏.‏ زَادَ مُسَدَّدٌ مَا لاَ أَعُدُّ وَلاَ أُحْصِي ‏.‏",
    "malay_translation": "Saya telah melihat Rasulullah (ﷺ) menggunakan kayu sugi ketika baginda berpuasa. Musaddad menambah dalam riwayatnya: \"lebih kerap daripada yang dapat saya hitung.\""
  },
  {
    "id": 22870,
    "hadith_number": 2366,
    "tajuk_hadith": "Keringanan Berbuka Puasa Ketika Musafir dan Amalan Nabi (ﷺ)",
    "perawi_melayu": "Perawi: Sahabat Nabi:",
    "english_text": "AbuBakr ibn AbdurRahman reported on the authority of a Companion of the Prophet (ﷺ): I saw the Prophet (ﷺ) commanding the people while he was travelling on the occasion of the conquest of Mecca not to observe fast. He said: Be strong for your enemy. The Messenger of Allah (ﷺ) fasted himself.\n\n\n\n\n\n\nNarrated AbuBakr:\n\n\n\n\n\n\nA man who narrated his tradition to me said: I have seen the Messenger of Allah (ﷺ) in al-Arj pouring water over his head while he was fasting, either because of thirst or because of heat.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ بَعْضِ، أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ النَّاسَ فِي سَفَرِهِ عَامَ الْفَتْحِ بِالْفِطْرِ وَقَالَ ‏\n\"‏ تَقَوَّوْا لِعَدُوِّكُمْ ‏\"‏ ‏.‏ وَصَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو بَكْرٍ قَالَ الَّذِي حَدَّثَنِي لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم بِالْعَرْجِ يَصُبُّ عَلَى رَأْسِهِ الْمَاءَ وَهُوَ صَائِمٌ مِنَ الْعَطَشِ أَوْ مِنَ الْحَرِّ ‏.‏",
    "malay_translation": "Abu Bakr ibn AbdurRahman meriwayatkan dari seorang Sahabat Nabi (ﷺ): Saya melihat Nabi (ﷺ) memerintahkan orang ramai ketika baginda sedang bermusafir pada peristiwa pembukaan Kota Mekah untuk tidak berpuasa. Baginda bersabda: 'Kuatkan diri kamu untuk menghadapi musuh kamu.' Rasulullah (ﷺ) sendiri berpuasa.\n\n\n\n\n\n\nDiriwayatkan oleh Abu Bakr:\n\n\n\n\n\n\nSeorang lelaki yang meriwayatkan hadis ini kepada saya berkata: Saya telah melihat Rasulullah (ﷺ) di al-Arj menyiram air ke atas kepala baginda ketika baginda sedang berpuasa, sama ada kerana dahaga atau kerana panas."
  },
  {
    "id": 22871,
    "hadith_number": 2367,
    "tajuk_hadith": "Galakan Bersungguh-sungguh dalam Istinsyak Kecuali Ketika Berpuasa",
    "perawi_melayu": "Diriwayatkan oleh Laqit ibn Saburah:",
    "english_text": "The Prophet (ﷺ) said: Snuff up water freely unless you are fasting.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنِي يَحْيَى بْنُ سُلَيْمٍ، عَنْ إِسْمَاعِيلَ بْنِ كَثِيرٍ، عَنْ عَاصِمِ بْنِ لَقِيطِ بْنِ صَبِرَةَ، عَنْ أَبِيهِ، لَقِيطِ بْنِ صَبِرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ بَالِغْ فِي الاِسْتِنْشَاقِ إِلاَّ أَنْ تَكُونَ صَائِمًا ‏\"‏ ‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda: Bersungguh-sungguhlah dalam memasukkan air ke hidung kecuali jika kamu sedang berpuasa."
  },
  {
    "id": 22872,
    "hadith_number": 2368,
    "tajuk_hadith": "Pembatalan Puasa Bagi Pembekam dan yang Dibekam",
    "perawi_melayu": "Diriwayatkan oleh Thawban:",
    "english_text": "The Prophet (ﷺ) said: A man who cupped and a man who has himself cupped broke their fast. The narrator Shayban said in his version: AbuQilabah told me that AbuAsma' ar-Rahbi told him that Thawban, the client of the Messenger of Allah (ﷺ), told him that he heard the Prophet (ﷺ) say this.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، ح وَحَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا حَسَنُ بْنُ مُوسَى، حَدَّثَنَا شَيْبَانُ، - جَمِيعًا - عَنْ يَحْيَى، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي أَسْمَاءَ، - يَعْنِي الرَّحَبِيَّ - عَنْ ثَوْبَانَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ ‏\"‏ ‏.‏ قَالَ شَيْبَانُ أَخْبَرَنِي أَبُو قِلاَبَةَ أَنَّ أَبَا أَسْمَاءَ الرَّحَبِيَّ حَدَّثَهُ أَنَّ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَخْبَرَهُ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda: Seorang lelaki yang berbekam dan seorang lelaki yang membekam dirinya telah membatalkan puasa mereka. Perawi Shayban berkata dalam riwayatnya: Abu Qilabah memberitahu saya bahawa Abu Asma' ar-Rahbi memberitahunya bahawa Thawban, hamba Rasulullah (ﷺ), memberitahunya bahawa dia mendengar Nabi (ﷺ) bersabda demikian."
  },
  {
    "id": 22873,
    "hadith_number": 2369,
    "tajuk_hadith": "Rantaian Sanad Lain dan Kisah Shaddad ibn Aws Bersama Nabi (ﷺ)",
    "perawi_melayu": "Diriwayatkan oleh Shaddad ibn Aws:",
    "english_text": "The tradition mentioned above (No. 2361) has also been transmitted by Shaddad ibn Aws through a different chain of narrators. \n\n\n\n\n\nThis version adds: While Shaddad ibn Aws was walking along with the Prophet (ﷺ)....The narrator then transmitted the rest of the tradition to the same effect.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا حَسَنُ بْنُ مُوسَى، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، قَالَ حَدَّثَنِي أَبُو قِلاَبَةَ الْجَرْمِيُّ، أَنَّهُ أَخْبَرَهُ أَنَّ شَدَّادَ بْنَ أَوْسٍ بَيْنَمَا هُوَ يَمْشِي مَعَ النَّبِيِّ صلى الله عليه وسلم فَذَكَرَ نَحْوَهُ ‏.‏",
    "malay_translation": "Hadis yang disebutkan di atas (No. 2361) juga telah diriwayatkan oleh Shaddad ibn Aws melalui rangkaian perawi yang berbeza. Versi ini menambahkan: Ketika Shaddad ibn Aws sedang berjalan bersama Nabi (ﷺ)....Kemudian perawi itu meriwayatkan sisa hadis dengan kesan yang sama."
  },
  {
    "id": 22874,
    "hadith_number": 2370,
    "tajuk_hadith": "Berbekam Membatalkan Puasa Bagi Pembekam dan yang Dibekam",
    "perawi_melayu": "Diriwayatkan oleh Shaddad bin Aws:",
    "english_text": "The Messenger of Allah (ﷺ) came to a man at al-Baqi' while he was cupping on the 18th of Ramadan ; he (the Prophet) was holding my hand. Thereupon he said: A man who cups and a man who gets himself cupped break their fast.\n\n\nAbu Dawud said: The narrator Khalid al-Hadhdha' transmitted a similar tradition from Abu Qilabah through a different chain of narrators mentioned by the narrator Ayyub.",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الأَشْعَثِ، عَنْ شَدَّادِ بْنِ أَوْسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَتَى عَلَى رَجُلٍ بِالْبَقِيعِ وَهُوَ يَحْتَجِمُ وَهُوَ آخِذٌ بِيَدِي لِثَمَانَ عَشْرَةَ خَلَتْ مِنْ رَمَضَانَ فَقَالَ ‏\n\"‏ أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ وَرَوَى خَالِدٌ الْحَذَّاءُ عَنْ أَبِي قِلاَبَةَ بِإِسْنَادِ أَيُّوبَ مِثْلَهُ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) datang kepada seorang lelaki di Baqi' ketika dia sedang berbekam pada tanggal 18 Ramadan; Baginda (Nabi) memegang tangan saya. Kemudian Baginda bersabda: 'Orang yang membekam dan orang yang dibekam telah berbuka puasa.'\n\nAbu Daud berkata: Perawi Khalid al-Hadhdha' meriwayatkan hadis yang serupa daripada Abu Qilabah melalui sanad perawi yang berbeza yang disebut oleh perawi Ayyub."
  },
  {
    "id": 22875,
    "hadith_number": 2371,
    "tajuk_hadith": "Pembatalan Puasa bagi Tukang Bekam dan yang Dibekam",
    "perawi_melayu": "Diriwayatkan oleh Thawban, maula (bekas hamba) Nabi (ﷺ):",
    "english_text": "The Prophet (ﷺ) as saying: A man who cups and a man who gets himself cupped break their fast.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، وَعَبْدُ الرَّزَّاقِ، ح وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنِي ابْنَ إِبْرَاهِيمَ - عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي مَكْحُولٌ، أَنَّ شَيْخًا، مِنَ الْحَىِّ - قَالَ عُثْمَانُ فِي حَدِيثِهِ مُصَدَّقٌ - أَخْبَرَهُ أَنَّ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَخْبَرَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ ‏\"‏ ‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda: Seorang lelaki yang membekam dan seorang lelaki yang dibekam telah membatalkan puasa mereka."
  },
  {
    "id": 22876,
    "hadith_number": 2372,
    "tajuk_hadith": "Hukum Berbekam Membatalkan Puasa",
    "perawi_melayu": "Diriwayatkan oleh Thawban:",
    "english_text": "The Prophet (ﷺ) as saying: A man who cups and a man who gets himself cupped break their fast.\n\n\nAbu Dawud said: Ibn Thawban transmitted a similar tradition from his father on the authority of Makhul through an chain of narrators mentioned by him.",
    "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ، حَدَّثَنَا مَرْوَانُ، حَدَّثَنَا الْهَيْثَمُ بْنُ حُمَيْدٍ، أَخْبَرَنَا الْعَلاَءُ بْنُ الْحَارِثِ، عَنْ مَكْحُولٍ، عَنْ أَبِي أَسْمَاءَ الرَّحَبِيِّ، عَنْ ثَوْبَانَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ وَرَوَاهُ ابْنُ ثَوْبَانَ عَنْ أَبِيهِ عَنْ مَكْحُولٍ بِإِسْنَادِهِ مِثْلَهُ ‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda: Seseorang yang melakukan bekam dan seseorang yang dibekam telah membatalkan puasa mereka.\n\n\nAbu Daud berkata: Ibn Thawban meriwayatkan hadis yang serupa dari ayahnya dari Makhul melalui rangkaian perawi yang disebutkan olehnya."
  },
  {
    "id": 22877,
    "hadith_number": 2373,
    "tajuk_hadith": "Rasulullah Berbekam Ketika Berpuasa",
    "perawi_melayu": "Diriwayatkan oleh Ibn 'Abbas:",
    "english_text": "The Messenger of Allah (ﷺ) had himself cupped when he was fasting.\n\n\nAbu Dawud said: Wuhaib b. Khalid narrated a similar tradition from Ayyub through a different chain of narrators. Ja'far b. Rabi'ah and Hisham, that is, Ibn Hassan, narrated a similar tradition from 'Ikrimah on the authority of Ibn 'Abbas.",
    "arabic_text": "حَدَّثَنَا أَبُو مَعْمَرٍ عَبْدُ اللَّهِ بْنُ عَمْرٍو، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم احْتَجَمَ وَهُوَ صَائِمٌ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ وُهَيْبُ بْنُ خَالِدٍ عَنْ أَيُّوبَ بِإِسْنَادِهِ مِثْلَهُ ‏.‏ وَجَعْفَرُ بْنُ رَبِيعَةَ وَهِشَامُ بْنُ حَسَّانَ عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ مِثْلَهُ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) sendiri telah berbekam ketika beliau sedang berpuasa.\n\nAbu Daud berkata: Wuhaib b. Khalid meriwayatkan hadis yang serupa dari Ayyub melalui rangkaian perawi yang berbeza. Ja'far b. Rabi'ah dan Hisham, iaitu Ibn Hassan, meriwayatkan hadis yang serupa dari 'Ikrimah daripada Ibn 'Abbas."
  },
  {
    "id": 22878,
    "hadith_number": 2374,
    "tajuk_hadith": "Berbekam Ketika Berpuasa dan Berihram",
    "perawi_melayu": "Diriwayatkan oleh Abdullah ibn Abbas:",
    "english_text": "The Messenger of Allah (ﷺ) had himself cupped when he was fasting and wearing ihram (pilgrim garb).",
    "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم احْتَجَمَ وَهُوَ صَائِمٌ مُحْرِمٌ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) sendiri telah berbekam ketika baginda sedang berpuasa dan memakai ihram (pakaian ihram)."
  },
  {
    "id": 22879,
    "hadith_number": 2375,
    "tajuk_hadith": "Larangan Berbekam dan Puasa Wisal serta Penjelasan Rasulullah SAW tentang Puasa Wisal Baginda",
    "perawi_melayu": "Diriwayatkan oleh 'Abd al-Rahman b. Abi Laila:",
    "english_text": "A man from the Companions of the Prophet (ﷺ) told me that the Messenger of Allah (ﷺ) prohibited cupping and perpetual fasting, but he had not made them unlawful showing mercy on his Companions. Thereupon he was asked: Messenger of Allah, you observe perpetual fast till dawn. He replied: I observe perpetual fast till dawn (for) my Lord gives me food and drink.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، حَدَّثَنِي رَجُلٌ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْحِجَامَةِ وَالْمُوَاصَلَةِ وَلَمْ يُحَرِّمْهُمَا إِبْقَاءً عَلَى أَصْحَابِهِ فَقِيلَ لَهُ يَا رَسُولَ اللَّهِ إِنَّكَ تُوَاصِلُ إِلَى السَّحَرِ ‏.‏ فَقَالَ ‏\n\"‏ إِنِّي أُوَاصِلُ إِلَى السَّحَرِ وَرَبِّي يُطْعِمُنِي وَيَسْقِينِي ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki daripada kalangan sahabat Nabi (ﷺ) menceritakan kepadaku bahawa Rasulullah (ﷺ) melarang berbekam dan puasa *wisal* (puasa berterusan), tetapi baginda tidak mengharamkannya sebagai rahmat kepada para sahabatnya. Lalu baginda ditanya: 'Wahai Rasulullah, sesungguhnya engkau berpuasa *wisal* hingga waktu sahur?' Baginda menjawab: 'Sesungguhnya aku berpuasa *wisal* hingga waktu sahur, dan Tuhanku memberikan aku makan dan minum.'"
  },
  {
    "id": 22880,
    "hadith_number": 2376,
    "tajuk_hadith": "Larangan Berbekam bagi Orang Berpuasa Kerana Kesukaran",
    "perawi_melayu": "Diriwayatkan oleh Anas:",
    "english_text": "We would not allow a man who was fasting to get himself cupped due to abomination of hardship.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا سُلَيْمَانُ، - يَعْنِي ابْنَ الْمُغِيرَةِ - عَنْ ثَابِتٍ، قَالَ قَالَ أَنَسٌ مَا كُنَّا نَدَعُ الْحِجَامَةَ لِلصَّائِمِ إِلاَّ كَرَاهِيَةَ الْجَهْدِ ‏.‏",
    "malay_translation": "Kami tidak membenarkan seorang lelaki yang sedang berpuasa untuk berbekam kerana bimbangkan kesukaran."
  },
  {
    "id": 22881,
    "hadith_number": 2377,
    "tajuk_hadith": "Perkara yang Tidak Membatalkan Puasa",
    "perawi_melayu": "Diriwayatkan daripada seorang lelaki dari kalangan sahabat:",
    "english_text": "The Messenger of Allah (ﷺ) said: Neither vomiting, nor emission, nor cupping breaks the fast of the one who is fasting.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ رَجُلٍ، مِنْ أَصْحَابِهِ عَنْ رَجُلٍ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يُفْطِرُ مَنْ قَاءَ وَلاَ مَنِ احْتَلَمَ وَلاَ مَنِ احْتَجَمَ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda: Tidak membatalkan puasa bagi orang yang berpuasa kerana muntah, keluar air mani, atau berbekam."
  },
  {
    "id": 22882,
    "hadith_number": 2378,
    "tajuk_hadith": "Anjuran Memakai Celak Bercampur Kasturi Ketika Tidur dan Larangan Bagi Orang Berpuasa",
    "perawi_melayu": "Diriwayatkan oleh Ma'bad b. Hudhah:",
    "english_text": "The Prophet (ﷺ) commanded to apply collyrium mixed with musk at the time of sleep. He said: A man who is fasting should abstain from it.\n\n\nAbu Dawud said: Yahya b. Ma'in said to me: This tradition about the use of collyrium is munkar (i.e. contradicts the sound traditions on the subject).",
    "arabic_text": "حَدَّثَنَا النُّفَيْلِيُّ، حَدَّثَنَا عَلِيُّ بْنُ ثَابِتٍ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ النُّعْمَانِ بْنِ مَعْبَدِ بْنِ هَوْذَةَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ أَمَرَ بِالإِثْمِدِ الْمُرَوَّحِ عِنْدَ النَّوْمِ وَقَالَ ‏\n\"‏ لِيَتَّقِهِ الصَّائِمُ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ قَالَ لِي يَحْيَى بْنُ مَعِينٍ هُوَ حَدِيثٌ مُنْكَرٌ يَعْنِي حَدِيثَ الْكَحْلِ ‏.‏",
    "malay_translation": "Nabi (ﷺ) memerintahkan untuk memakai celak yang dicampur dengan kasturi pada waktu tidur. Baginda bersabda: Seseorang yang berpuasa hendaklah menjauhinya.\n\n\nAbu Dawud berkata: Yahya b. Ma'in berkata kepadaku: Tradisi mengenai penggunaan celak ini adalah munkar (iaitu bertentangan dengan tradisi yang sahih mengenai perkara ini)."
  },
  {
    "id": 22883,
    "hadith_number": 2379,
    "tajuk_hadith": "Memakai Celak Ketika Berpuasa",
    "perawi_melayu": "",
    "english_text": "'Ubaid Allah b. Abu Bakr b. Anas reported on the authority of Anas b. Malik that he used to apply collyrium when he was fasting.",
    "arabic_text": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنْ عُتْبَةَ، عَنْ أَبِي مُعَاذٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ أَنَسٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ كَانَ يَكْتَحِلُ وَهُوَ صَائِمٌ ‏.‏",
    "malay_translation": "Ubaid Allah b. Abu Bakr b. Anas meriwayatkan daripada Anas b. Malik bahawa beliau pernah memakai celak ketika berpuasa."
  },
  {
    "id": 22884,
    "hadith_number": 2380,
    "tajuk_hadith": "Hukum Bercelak Bagi Orang yang Berpuasa",
    "perawi_melayu": "Al-A'mash berkata:",
    "english_text": "I did not see any of our companions who abominated the use of collyrium by a man who fasting. Ibrahim would permit the man who was fasting to apply collyrium with aloes.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْمُخَرِّمِيُّ، وَيَحْيَى بْنُ مُوسَى الْبَلْخِيُّ، قَالاَ حَدَّثَنَا يَحْيَى بْنُ عِيسَى، عَنِ الأَعْمَشِ، قَالَ مَا رَأَيْتُ أَحَدًا مِنْ أَصْحَابِنَا يَكْرَهُ الْكَحْلَ لِلصَّائِمِ وَكَانَ إِبْرَاهِيمُ يُرَخِّصُ أَنْ يَكْتَحِلَ الصَّائِمُ بِالصَّبِرِ ‏.‏",
    "malay_translation": "Saya tidak melihat seorang pun dari sahabat kami yang membenci penggunaan celak oleh orang yang berpuasa. Ibrahim membolehkan orang yang berpuasa untuk memakai celak dengan lidah buaya."
  },
  {
    "id": 22885,
    "hadith_number": 2381,
    "tajuk_hadith": "Hukum Muntah Ketika Berpuasa: Tidak Sengaja dan Sengaja",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said: if one has a sudden attack of vomiting while one is fasting, no atonement is required of him, but if he vomits intentionally he must make atonement.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ ذَرَعَهُ قَىْءٌ وَهُوَ صَائِمٌ فَلَيْسَ عَلَيْهِ قَضَاءٌ وَإِنِ اسْتَقَاءَ فَلْيَقْضِ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ أَيْضًا حَفْصُ بْنُ غِيَاثٍ عَنْ هِشَامٍ مِثْلَهُ ‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda: jika seseorang mengalami muntah secara tiba-tiba ketika dia sedang berpuasa, tidak ada penebusan yang diperlukan baginya, tetapi jika dia muntah dengan sengaja, dia harus melakukan penebusan."
  },
  {
    "id": 22886,
    "hadith_number": 2382,
    "tajuk_hadith": "Muntah Membatalkan Puasa dan Pengesahan Thawban",
    "perawi_melayu": "Diriwayatkan oleh Ma'dan b. Talhah:",
    "english_text": "That Abu ad-Darda' narrated to him: The Messenger of Allah (ﷺ) vomited and broke his fast. Then I met Thawban, the client of the Messenger of Allah (ﷺ), in the mosque in Damascus, I said (to him): Abu al-Darda has told me that the Messenger of Allah (ﷺ) vomited and broke his fast. He said: He spoke the truth ; and I poured out water for his ablution (ﷺ).",
    "arabic_text": "حَدَّثَنَا أَبُو مَعْمَرٍ عَبْدُ اللَّهِ بْنُ عَمْرٍو، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا الْحُسَيْنُ، عَنْ يَحْيَى، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ عَمْرٍو الأَوْزَاعِيُّ، عَنْ يَعِيشَ بْنِ الْوَلِيدِ بْنِ هِشَامٍ، أَنَّ أَبَاهُ، حَدَّثَهُ حَدَّثَنِي مَعْدَانُ بْنُ طَلْحَةَ، أَنَّ أَبَا الدَّرْدَاءِ، حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَاءَ فَأَفْطَرَ فَلَقِيتُ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فِي مَسْجِدِ دِمَشْقَ فَقُلْتُ إِنَّ أَبَا الدَّرْدَاءِ حَدَّثَنِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَاءَ فَأَفْطَرَ ‏.‏ قَالَ صَدَقَ وَأَنَا صَبَبْتُ لَهُ وَضُوءَهُ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Bahawa Abu ad-Darda' meriwayatkan kepadanya: Rasulullah (ﷺ) muntah dan membatalkan puasanya. Kemudian saya bertemu Thawban, hamba Rasulullah (ﷺ), di masjid di Damsyik, saya berkata kepadanya: Abu al-Darda telah memberitahu saya bahawa Rasulullah (ﷺ) muntah dan membatalkan puasanya. Dia berkata: Benar kata beliau; dan saya menuangkan air untuk wuduk baginda (ﷺ)."
  },
  {
    "id": 22887,
    "hadith_number": 2383,
    "tajuk_hadith": "Rasulullah Mencium dan Memeluk Ketika Berpuasa",
    "perawi_melayu": "Diriwayatkan oleh 'Aishah:",
    "english_text": "The Messenger of Allah (ﷺ) used to kiss and embrace while he was fasting, but he was the one of you who had most control over his desire.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، وَعَلْقَمَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُقَبِّلُ وَهُوَ صَائِمٌ وَيُبَاشِرُ وَهُوَ صَائِمٌ وَلَكِنَّهُ كَانَ أَمْلَكَ لإِرْبِهِ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) pernah mencium dan memeluk ketika baginda sedang berpuasa, tetapi baginda adalah orang yang paling mampu mengawal nafsunya di antara kamu."
  },
  {
    "id": 22888,
    "hadith_number": 2384,
    "tajuk_hadith": "Nabi Mencium (Isterinya) Semasa Bulan Puasa",
    "perawi_melayu": "Diriwayatkan oleh 'Aishah:",
    "english_text": "The Prophet (ﷺ) used to kiss (me) during the month of fasting.",
    "arabic_text": "حَدَّثَنَا أَبُو تَوْبَةَ الرَّبِيعُ بْنُ نَافِعٍ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ زِيَادِ بْنِ عِلاَقَةَ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُقَبِّلُ فِي شَهْرِ الصَّوْمِ ‏.‏",
    "malay_translation": "Nabi (ﷺ) biasa mencium (saya) pada bulan puasa."
  },
  {
    "id": 22889,
    "hadith_number": 2385,
    "tajuk_hadith": "Ciuman Rasulullah kepada Isterinya Ketika Berpuasa",
    "perawi_melayu": "Diriwayatkan oleh Aisyah, Ummul Mu'minin:",
    "english_text": "The Messenger of Allah (ﷺ) used to kiss me when he was fasting and when I was fasting.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ، - يَعْنِي ابْنَ عُثْمَانَ الْقُرَشِيَّ - عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُقَبِّلُنِي وَهُوَ صَائِمٌ وَأَنَا صَائِمَةٌ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) biasa menciumku ketika baginda sedang berpuasa dan ketika aku sedang berpuasa."
  },
  {
    "id": 22890,
    "hadith_number": 2386,
    "tajuk_hadith": "Mencium Semasa Berpuasa: Perbandingan dengan Berkumur",
    "perawi_melayu": "Diriwayatkan oleh Umar ibn al-Khattab:",
    "english_text": "I got excited, so I kissed while I was fasting, I then said: Messenger of Allah, I have done a big deed; I kissed while I was fasting. He said: What do you think if you rinse your mouth with water while you are fasting. The narrator Isa ibn Hammad said in his version: I said to him: There is no harm in it. Then both of them agreed on the version: He said: Then what?",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا اللَّيْثُ، ح وَحَدَّثَنَا عِيسَى بْنُ حَمَّادٍ، أَخْبَرَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ الْمَلِكِ بْنِ سَعِيدٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ هَشِشْتُ فَقَبَّلْتُ وَأَنَا صَائِمٌ، فَقُلْتُ يَا رَسُولَ اللَّهِ صَنَعْتُ الْيَوْمَ أَمْرًا عَظِيمًا قَبَّلْتُ وَأَنَا صَائِمٌ ‏.‏ قَالَ ‏\"‏ أَرَأَيْتَ لَوْ مَضْمَضْتَ مِنَ الْمَاءِ وَأَنْتَ صَائِمٌ ‏\"‏ ‏.‏ قَالَ عِيسَى بْنُ حَمَّادٍ فِي حَدِيثِهِ قُلْتُ لاَ بَأْسَ بِهِ ‏.‏ ثُمَّ اتَّفَقَا قَالَ ‏\"‏ فَمَهْ ‏\"‏ ‏.‏",
    "malay_translation": "Saya menjadi teruja, lalu saya mencium ketika saya sedang berpuasa, kemudian saya berkata: Wahai Rasulullah, saya telah melakukan perkara yang besar; saya mencium ketika saya sedang berpuasa. Baginda bersabda: Bagaimana pendapatmu jika kamu berkumur dengan air ketika kamu sedang berpuasa. Perawi Isa ibn Hammad berkata dalam riwayatnya: Saya berkata kepadanya: Tidak mengapa dengan itu. Kemudian kedua-duanya bersetuju dengan riwayat: Baginda bersabda: Lalu mengapa?"
  },
  {
    "id": 22891,
    "hadith_number": 2387,
    "tajuk_hadith": "Nabi Mencium dan Menghisap Lidah Isterinya Ketika Berpuasa",
    "perawi_melayu": "Diriwayatkan oleh Aisyah, Ummul Mu'minin:",
    "english_text": "The Prophet (ﷺ) used to kiss her and suck her tongue when he was fasting.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، حَدَّثَنَا مُحَمَّدُ بْنُ دِينَارٍ، حَدَّثَنَا سَعْدُ بْنُ أَوْسٍ الْعَبْدِيُّ، عَنْ مِصْدَعٍ أَبِي يَحْيَى، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُقَبِّلُهَا وَهُوَ صَائِمٌ وَيَمُصُّ لِسَانَهَا ‏.‏",
    "malay_translation": "Nabi (ﷺ) biasa menciumnya dan menghisap lidahnya ketika baginda berpuasa."
  },
  {
    "id": 22892,
    "hadith_number": 2388,
    "tajuk_hadith": "Hukum Mencium Isteri Bagi Orang Berpuasa: Perbezaan Antara Lelaki Tua dan Pemuda",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "A man  asked the Prophet (ﷺ) whether one who was fasting could embrace (his wife) and he gave him permission; but when another man came to him, and asked him, he forbade him. The one to whom he gave permission was an old man and the one whom he forbade was a youth.",
    "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، حَدَّثَنَا أَبُو أَحْمَدَ، - يَعْنِي الزُّبَيْرِيَّ - أَخْبَرَنَا إِسْرَائِيلُ، عَنْ أَبِي الْعَنْبَسِ، عَنِ الأَغَرِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً، سَأَلَ النَّبِيَّ صلى الله عليه وسلم عَنِ الْمُبَاشَرَةِ لِلصَّائِمِ فَرَخَّصَ لَهُ وَأَتَاهُ آخَرُ فَسَأَلَهُ فَنَهَاهُ ‏.‏ فَإِذَا الَّذِي رَخَّصَ لَهُ شَيْخٌ وَالَّذِي نَهَاهُ شَابٌّ ‏.‏",
    "malay_translation": "Seorang lelaki bertanya kepada Nabi (ﷺ) adakah orang yang berpuasa boleh mencium (isterinya), dan baginda memberikan keizinan kepadanya. Tetapi apabila seorang lelaki lain datang kepada baginda dan bertanya kepadanya, baginda melarangnya. Orang yang diberikan keizinan oleh baginda adalah seorang lelaki tua, dan orang yang dilarang oleh baginda adalah seorang pemuda."
  },
  {
    "id": 22893,
    "hadith_number": 2389,
    "tajuk_hadith": "Rasulullah (ﷺ) Berpuasa Walaupun Berada dalam Keadaan Junub Ketika Subuh",
    "perawi_melayu": "Diriwayatkan oleh 'Aishah dan Umm Salamah, isteri-isteri Nabi (ﷺ):",
    "english_text": "The Messenger of Allah (ﷺ) would be overtaken by the dawn when he was in a state of sexual defilement. The narrator 'Abd Allah al-Adhrami said in his version: During Ramadan, due to sexual intercourse and no owing to a dream (i.e. nocturnal emission), and would fast.\n\n\nAbu Dawud said: How brief is this sentence uttered by the narrator, this is, \"he was overtaken by daw when he was in the state of sexual defilement\"? The tradition says: The Prophet (ﷺ) was overtaken by dawn in the state of sexual defilement when he was fasting.",
    "arabic_text": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، ح وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ إِسْحَاقَ الأَذْرَمِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ مَالِكٍ، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ عَائِشَةَ، وَأُمِّ سَلَمَةَ زَوْجَىِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُمَا قَالَتَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصْبِحُ جُنُبًا ‏.‏ قَالَ عَبْدُ اللَّهِ الأَذْرَمِيُّ فِي حَدِيثِهِ فِي رَمَضَانَ مِنْ جِمَاعٍ غَيْرِ احْتِلاَمٍ ثُمَّ يَصُومُ ‏.‏ قَالَ أَبُو دَاوُدَ وَمَا أَقَلَّ مَنْ يَقُولُ هَذِهِ الْكَلِمَةَ - يَعْنِي يُصْبِحُ جُنُبًا فِي رَمَضَانَ - وَإِنَّمَا الْحَدِيثُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصْبِحُ جُنُبًا وَهُوَ صَائِمٌ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) pernah mendapati waktu subuh ketika baginda dalam keadaan junub. Perawi 'Abd Allah al-Adhrami berkata dalam riwayatnya: Pada bulan Ramadan, disebabkan persetubuhan dan bukan kerana mimpi (yakni, mimpi basah), dan baginda berpuasa.\n\nAbu Dawud berkata: Betapa ringkasnya kalimat ini yang diucapkan oleh perawi, iaitu, \"baginda mendapati waktu subuh ketika baginda dalam keadaan junub\"? Tradisi ini mengatakan: Nabi (ﷺ) mendapati waktu subuh dalam keadaan junub ketika baginda berpuasa."
  },
  {
    "id": 22894,
    "hadith_number": 2390,
    "tajuk_hadith": "Keadaan Junub Ketika Subuh dan Puasa",
    "perawi_melayu": "Diriwayatkan oleh 'Aishah, isteri Nabi (ﷺ):",
    "english_text": "A man said to Messenger of Allah (ﷺ): Messenger of Allah, I was overtaken by dawn while I was sexually defiled, and I want to keep fast. The Messenger of Allah (ﷺ) said: I am also overtaken by dawn while I am in the state of sexual defilement ; I also want to keep fast. I take a bath and I keep fast. The man said: Messenger of Allah, you are not like us ; Allah has forgiven you your past and future sins. The Messenger of Allah (ﷺ) became angry and said: I swear by Allah, I hope I shall be the most fearful of you of Allah, and most familiar of you with what I follow.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، - يَعْنِي الْقَعْنَبِيَّ - عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ مَعْمَرٍ الأَنْصَارِيِّ، عَنْ أَبِي يُونُسَ، مَوْلَى عَائِشَةَ عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَجُلاً قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ وَاقِفٌ عَلَى الْبَابِ يَا رَسُولَ اللَّهِ إِنِّي أُصْبِحُ جُنُبًا وَأَنَا أُرِيدُ الصِّيَامَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَأَنَا أُصْبِحُ جُنُبًا وَأَنَا أُرِيدُ الصِّيَامَ فَأَغْتَسِلُ وَأَصُومُ ‏\"‏ ‏.‏ فَقَالَ الرَّجُلُ يَا رَسُولَ اللَّهِ إِنَّكَ لَسْتَ مِثْلَنَا قَدْ غَفَرَ اللَّهُ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ فَغَضِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏\"‏ وَاللَّهِ إِنِّي لأَرْجُو أَنْ أَكُونَ أَخْشَاكُمْ لِلَّهِ وَأَعْلَمَكُمْ بِمَا أَتَّبِعُ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki berkata kepada Rasulullah (ﷺ): Wahai Rasulullah, saya berada dalam keadaan junub ketika subuh, dan saya ingin berpuasa. Rasulullah (ﷺ) bersabda: Aku juga berada dalam keadaan junub ketika subuh; Aku juga ingin berpuasa. Aku mandi dan aku berpuasa. Lelaki itu berkata: Wahai Rasulullah, engkau tidak seperti kami; Allah telah mengampuni dosa-dosamu yang telah lalu dan yang akan datang. Rasulullah (ﷺ) menjadi marah dan bersabda: Demi Allah, aku berharap menjadi orang yang paling takut kepada Allah di antara kamu, dan paling mengetahui tentang apa yang aku ikuti."
  },
  {
    "id": 22895,
    "hadith_number": 2391,
    "tajuk_hadith": "Kaffarah bagi Hubungan Seksual di Bulan Ramadan",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "A man came to the Prophet (ﷺ) and said: I am undone. He asked him: What has happened to you ? He said: I had intercourse with my wife in Ramadan (while I was fasting). He asked: Can you set a slave free ? He said: No. He again asked: Can you fast for two consecutive months ? He said: No. He asked: Can you provide food for sixty poor people ? He said: No. He said: Sit down. Then a huge basket containing dates ('araq) was brought to the Prophet (ﷺ). He then said to him: Give it as sadaqah (i.e. alms). He said: Messenger of Allah, there is no poorer family than mine between the two lave plains of it (Medina). The Messenger of Allah (ﷺ) laughed so that his eye-teeth became visible, and said: Give it to your family to eat. Musaddad said in another place: \"his canine teeth\".",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، وَمُحَمَّدُ بْنُ عِيسَى، - الْمَعْنَى - قَالاَ حَدَّثَنَا سُفْيَانُ، - قَالَ مُسَدَّدٌ - حَدَّثَنَا الزُّهْرِيُّ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أَتَى رَجُلٌ النَّبِيَّ صلى الله عليه وسلم فَقَالَ هَلَكْتُ ‏.‏ فَقَالَ ‏\"‏ مَا شَأْنُكَ ‏\"‏ ‏.‏ قَالَ وَقَعْتُ عَلَى امْرَأَتِي فِي رَمَضَانَ ‏.‏ قَالَ ‏\"‏ فَهَلْ تَجِدُ مَا تُعْتِقُ رَقَبَةً ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَهَلْ تَسْتَطِيعُ أَنْ تَصُومَ شَهْرَيْنِ مُتَتَابِعَيْنِ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَهَلْ تَسْتَطِيعُ أَنْ تُطْعِمَ سِتِّينَ مِسْكِينًا ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ اجْلِسْ ‏\"‏ ‏.‏ فَأُتِيَ النَّبِيُّ صلى الله عليه وسلم بِعَرَقٍ فِيهِ تَمْرٌ فَقَالَ ‏\"‏ تَصَدَّقْ بِهِ ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ مَا بَيْنَ لاَبَتَيْهَا أَهْلُ بَيْتٍ أَفْقَرَ مِنَّا فَضَحِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى بَدَتْ ثَنَايَاهُ قَالَ ‏\"‏ فَأَطْعِمْهُ إِيَّاهُمْ ‏\"‏ ‏.‏ وَقَالَ مُسَدَّدٌ فِي مَوْضِعٍ آخَرَ أَنْيَابُهُ ‏.‏",
    "malay_translation": "Seorang lelaki datang kepada Nabi (ﷺ) dan berkata: \"Celakalah aku!\" Baginda bertanya kepadanya: \"Apa yang terjadi padamu?\" Dia berkata: \"Saya telah melakukan hubungan seks dengan isteri saya di bulan Ramadan (semasa saya berpuasa).\" Baginda bertanya: \"Adakah kamu mampu memerdekakan seorang hamba?\" Dia berkata: \"Tidak.\" Baginda bertanya lagi: \"Adakah kamu mampu berpuasa selama dua bulan berturut-turut?\" Dia berkata: \"Tidak.\" Baginda bertanya: \"Adakah kamu mampu memberi makan kepada enam puluh orang miskin?\" Dia berkata: \"Tidak.\" Baginda bersabda: \"Duduklah.\" Kemudian, sebuah bakul besar berisi kurma ('araq) dibawa kepada Nabi (ﷺ). Baginda kemudian bersabda kepadanya: \"Berikan ini sebagai sedekah.\" Dia berkata: \"Wahai Rasulullah, tidak ada keluarga yang lebih miskin daripada keluarga saya di antara dua kawasan berbatu hitam di Madinah ini.\" Rasulullah (ﷺ) tertawa sehingga gigi gerahamnya kelihatan, dan bersabda: \"Berikan ini kepada keluargamu untuk dimakan.\" Musaddad berkata di tempat lain: \"gigi taringnya\"."
  },
  {
    "id": 22896,
    "hadith_number": 2392,
    "tajuk_hadith": "Keringanan Khusus dan Kewajipan Kaffarah",
    "perawi_melayu": "Hadis ini juga diriwayatkan oleh al-Zuhri melalui rangkaian perawi yang berbeza dengan maksud yang sama. Al-Zuhri menambahkan dalam versinya:",
    "english_text": "This was a special concession for him. If a man commits this act today, the expiation is necessary for him.\n\n\nAbu Dawud said: Al-Laith b. Sa'd, al-Awza'i, Mansur b. al-Mu'tamir and 'Irak b. Malik have narrated this tradition like the one narrated by Ibn 'Uyainah. Al-Awza'i narrated in his version the words: Beg pardon of Allah.",
    "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، بِهَذَا الْحَدِيثِ بِمَعْنَاهُ ‏.‏ زَادَ الزُّهْرِيُّ وَإِنَّمَا كَانَ هَذَا رُخْصَةً لَهُ خَاصَّةً فَلَوْ أَنَّ رَجُلاً فَعَلَ ذَلِكَ الْيَوْمَ لَمْ يَكُنْ لَهُ بُدٌّ مِنَ التَّكْفِيرِ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ اللَّيْثُ بْنُ سَعْدٍ وَالأَوْزَاعِيُّ وَمَنْصُورُ بْنُ الْمُعْتَمِرِ وَعِرَاكُ بْنُ مَالِكٍ عَلَى مَعْنَى ابْنِ عُيَيْنَةَ ‏.‏ زَادَ الأَوْزَاعِيُّ وَاسْتَغْفِرِ اللَّهَ ‏.‏",
    "malay_translation": "Ini adalah keringanan khusus untuknya. Jika seseorang melakukan perbuatan ini hari ini, maka kafarat adalah wajib baginya. Abu Daud berkata: Al-Laith b. Sa'd, al-Awza'i, Mansur b. al-Mu'tamir dan 'Irak b. Malik telah meriwayatkan hadis ini seperti yang diriwayatkan oleh Ibn 'Uyainah. Al-Awza'i meriwayatkan dalam versinya perkataan: Mohon ampunan Allah."
  },
  {
    "id": 22897,
    "hadith_number": 2393,
    "tajuk_hadith": "Hukuman bagi Membatalkan Puasa Ramadan dengan Sengaja dan Ketidakmampuan untuk Melaksanakan Hukuman",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "(A man broke his fast intentionally) during Ramadan. The Messenger of Allah (ﷺ) commanded him to emancipate a slave, or fast for two months, or feed sixty poor men. He said: I cannot provide. The Messenger of Allah (ﷺ) said: Sit down. Thereafter a huge basket of dates ('araq) was brought to the Messenger of Allah (ﷺ). He said: Take this and give it as sadaqah (alms). He said: Messenger of Allah, there is no poorer than I. The Messenger of Allah (ﷺ) thereupon laughed so that his canine teeth became visible and said: Eat it yourself.\n\n\nAbu Dawud said: Ibn Juraij narrated it from al-Zuhri in the wordings of the narrator Malik that a man broke his fast. This version says: You should either free a slave, or fast for two months, or provide food for sixty poor men.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً، أَفْطَرَ فِي رَمَضَانَ فَأَمَرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُعْتِقَ رَقَبَةً أَوْ يَصُومَ شَهْرَيْنِ مُتَتَابِعَيْنِ أَوْ يُطْعِمَ سِتِّينَ مِسْكِينًا ‏.‏ قَالَ لاَ أَجِدُ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اجْلِسْ ‏\"‏ ‏.‏ فَأُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِعَرَقٍ فِيهِ تَمْرٌ فَقَالَ ‏\"‏ خُذْ هَذَا فَتَصَدَّقْ بِهِ ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ مَا أَحَدٌ أَحْوَجَ مِنِّي ‏.‏ فَضَحِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى بَدَتْ أَنْيَابُهُ وَقَالَ لَهُ ‏\"‏ كُلْهُ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ ابْنُ جُرَيْجٍ عَنِ الزُّهْرِيِّ عَلَى لَفْظِ مَالِكٍ أَنَّ رَجُلاً أَفْطَرَ وَقَالَ فِيهِ ‏\"‏ أَوْ تُعْتِقَ رَقَبَةً أَوْ تَصُومَ شَهْرَيْنِ أَوْ تُطْعِمَ سِتِّينَ مِسْكِينًا ‏\"‏ ‏.‏",
    "malay_translation": "(Seorang lelaki telah membatalkan puasanya dengan sengaja) pada bulan Ramadan. Rasulullah (ﷺ) memerintahkannya untuk memerdekakan seorang hamba, atau berpuasa selama dua bulan, atau memberi makan enam puluh orang miskin. Lelaki itu berkata: Saya tidak mampu. Rasulullah (ﷺ) bersabda: Duduklah. Kemudian, sebuah bakul besar berisi kurma ('araq) dibawa kepada Rasulullah (ﷺ). Baginda bersabda: Ambillah ini dan sedekahkan. Lelaki itu berkata: Ya Rasulullah, tidak ada yang lebih miskin daripada saya. Rasulullah (ﷺ) kemudian tertawa sehingga gigi taringnya kelihatan dan bersabda: Makanlah sendiri. Abu Dawud berkata: Ibn Juraij meriwayatkannya dari al-Zuhri dengan lafaz perawi Malik bahawa seorang lelaki telah membatalkan puasanya. Versi ini menyatakan: Kamu hendaklah memerdekakan seorang hamba, atau berpuasa selama dua bulan, atau memberi makan enam puluh orang miskin."
  },
  {
    "id": 22898,
    "hadith_number": 2394,
    "tajuk_hadith": "Lelaki Berbuka Puasa di Bulan Ramadan dan Diperintahkan untuk Mengganti",
    "perawi_melayu": "Abu Hurairah berkata:",
    "english_text": "A man came to the Prophet (ﷺ). He broke his fast during Ramadan. He then narrated the rest of this tradition adding: Then a huge basket containing fifteen sa's of dates was brought to him. He said: Eat it yourself and your family and keep one fast and beg pardon of Allah.",
    "arabic_text": "حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، حَدَّثَنَا هِشَامُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم أَفْطَرَ فِي رَمَضَانَ بِهَذَا الْحَدِيثِ ‏.‏ قَالَ فَأُتِيَ بِعَرَقٍ فِيهِ تَمْرٌ قَدْرُ خَمْسَةَ عَشَرَ صَاعًا وَقَالَ فِيهِ ‏\n\"‏ كُلْهُ أَنْتَ وَأَهْلُ بَيْتِكَ وَصُمْ يَوْمًا وَاسْتَغْفِرِ اللَّهَ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki datang kepada Nabi (ﷺ). Dia telah berbuka puasa pada bulan Ramadan. Kemudian beliau meriwayatkan baki hadis ini dengan tambahan: Kemudian sebuah bakul besar berisi lima belas sa' kurma dibawa kepadanya. Baginda bersabda: Makanlah ini kamu dan keluargamu, berpuasalah sehari, dan beristighfarlah kepada Allah."
  },
  {
    "id": 22899,
    "hadith_number": 2395,
    "tajuk_hadith": "Lelaki yang Melakukan Hubungan Seksual pada Siang Hari Ramadan dan Arahan untuk Bersedekah",
    "perawi_melayu": "Diriwayatkan oleh Aishah, isteri Nabi (ﷺ):",
    "english_text": "A man came to the Prophet (ﷺ) during Ramadan in the mosque. He said: Messenger of Allah, I am burnt. The Prophet (ﷺ) asked him what happened to him. He said: I had sexual intercourse with my wife. He said: Give sadaqah (alms). He said: I swear by Allah, I possess nothing with me, and I cannot do this. He said: Sit down. He sat down. While he was waiting, a man came forward driving his donkey loaded with food. The Messenger of Allah (ﷺ) said: Where is the man who was burnt just now ? Thereupon the man stood up. The Messenger of Allah (ﷺ) said: Give it as sadaqah (alms). He asked: Messenger of Allah, to others than us ? By Allah. we are hungry, we have nothing (to eat). He said: Eat it yourselves.",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ، حَدَّثَهُ أَنَّ مُحَمَّدَ بْنَ جَعْفَرِ بْنِ الزُّبَيْرِ حَدَّثَهُ أَنَّ عَبَّادَ بْنَ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ حَدَّثَهُ أَنَّهُ، سَمِعَ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم تَقُولُ أَتَى رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فِي الْمَسْجِدِ فِي رَمَضَانَ فَقَالَ يَا رَسُولَ اللَّهِ احْتَرَقْتُ ‏.‏ فَسَأَلَهُ النَّبِيُّ صلى الله عليه وسلم مَا شَأْنُهُ قَالَ أَصَبْتُ أَهْلِي ‏.‏ قَالَ ‏\"‏ تَصَدَّقْ ‏\"‏ ‏.‏ قَالَ وَاللَّهِ مَا لِي شَىْءٌ وَلاَ أَقْدِرُ عَلَيْهِ ‏.‏ قَالَ ‏\"‏ اجْلِسْ ‏\"‏ ‏.‏ فَجَلَسَ فَبَيْنَمَا هُوَ عَلَى ذَلِكَ أَقْبَلَ رَجُلٌ يَسُوقُ حِمَارًا عَلَيْهِ طَعَامٌ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَيْنَ الْمُحْتَرِقُ آنِفًا ‏\"‏ ‏.‏ فَقَامَ الرَّجُلُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تَصَدَّقْ بِهَذَا ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ أَعَلَى غَيْرِنَا فَوَاللَّهِ إِنَّا لَجِيَاعٌ مَا لَنَا شَىْءٌ ‏.‏ قَالَ ‏\"‏ كُلُوهُ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki datang kepada Nabi (ﷺ) pada bulan Ramadan di masjid. Dia berkata: Wahai Rasulullah, saya terbakar. Nabi (ﷺ) bertanya kepadanya apa yang terjadi padanya. Dia berkata: Saya telah melakukan hubungan seksual dengan isteri saya. Baginda bersabda: Berikanlah sedekah. Dia berkata: Demi Allah, saya tidak memiliki apa pun dengan saya, dan saya tidak mampu melakukan ini. Baginda bersabda: Duduklah. Dia duduk. Ketika dia sedang menunggu, seorang lelaki datang menghadap membawa seekor keldai yang dimuatkan dengan makanan. Rasulullah (ﷺ) bersabda: Di mana lelaki yang terbakar tadi? Maka lelaki itu berdiri. Rasulullah (ﷺ) bersabda: Berikanlah ini sebagai sedekah. Dia bertanya: Wahai Rasulullah, kepada orang lain selain kami? Demi Allah, kami lapar, kami tidak mempunyai apa pun (untuk dimakan). Baginda bersabda: Makanlah sendiri."
  },
  {
    "id": 22900,
    "hadith_number": 2396,
    "tajuk_hadith": "Bakul Besar Berisi Dua Puluh Sa' (Kurma) Dibawa",
    "perawi_melayu": "Tradisi yang disebutkan di atas juga diriwayatkan oleh 'Aishah melalui rangkaian perawi yang berbeza. Versi ini menambah:",
    "english_text": "A huge basket containing twenty sa's (of dates) was brought.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ، عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ الزُّبَيْرِ، عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ، عَنْ عَائِشَةَ، بِهَذِهِ الْقِصَّةِ قَالَ فَأُتِيَ بِعَرَقٍ فِيهِ عِشْرُونَ صَاعًا ‏.‏",
    "malay_translation": "Sebuah bakul besar berisi dua puluh sa' (kurma) telah dibawa."
  },
  {
    "id": 22901,
    "hadith_number": 2397,
    "tajuk_hadith": "Tidak Ada Tebusan Bagi Membatalkan Puasa Ramadan Tanpa Keringanan",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said: If anyone breaks his fast one day in Ramadan without a concession granted to him by Allah, a perpetual fast will not atone for it.",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ أَخْبَرَنَا شُعْبَةُ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنِ ابْنِ مُطَوِّسٍ، عَنْ أَبِيهِ، - قَالَ ابْنُ كَثِيرٍ عَنْ أَبِي الْمُطَوِّسِ، عَنْ أَبِيهِ، - عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ أَفْطَرَ يَوْمًا مِنْ رَمَضَانَ مِنْ غَيْرِ رُخْصَةٍ رَخَّصَهَا اللَّهُ لَهُ لَمْ يَقْضِ عَنْهُ صِيَامُ الدَّهْرِ ‏\"‏ ‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda: Jika seseorang membatalkan puasanya satu hari di bulan Ramadan tanpa keringanan yang diberikan Allah kepadanya, maka puasa sepanjang masa tidak dapat menebusnya."
  },
  {
    "id": 22902,
    "hadith_number": 2398,
    "tajuk_hadith": "Perbezaan Pendapat Mengenai Nama Perawi Ibn al-Mutawwas dan Abu al-Mutawwas",
    "perawi_melayu": "Hadis yang disebutkan di atas juga diriwayatkan oleh Abu Hurairah melalui rangkaian perawi yang berbeza yang serupa dengan hadis yang diriwayatkan oleh Ibn Kathir dan Sulaiman.\n\nAbu Dawud berkata:",
    "english_text": "Sufyan and Shu'bah differed among themselves on the name of the narrator Ibn al-Mutawwas and Abu al-Mutawwas.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، حَدَّثَنِي حَبِيبٌ، عَنْ عُمَارَةَ، عَنِ ابْنِ الْمُطَوِّسِ، - قَالَ فَلَقِيتُ ابْنَ الْمُطَوِّسِ فَحَدَّثَنِي - عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم مِثْلَ حَدِيثِ ابْنِ كَثِيرٍ وَسُلَيْمَانَ ‏.‏ قَالَ أَبُو دَاوُدَ وَاخْتُلِفَ عَلَى سُفْيَانَ وَشُعْبَةَ عَنْهُمَا ابْنُ الْمُطَوِّسِ وَأَبُو الْمُطَوِّسِ ‏.‏",
    "malay_translation": "Sufyan dan Shu'bah berbeza pendapat antara mereka mengenai nama perawi Ibn al-Mutawwas dan Abu al-Mutawwas."
  },
  {
    "id": 22903,
    "hadith_number": 2399,
    "tajuk_hadith": "Makan dan Minum dalam Keadaan Lupa Ketika Berpuasa",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "A man came to the Prophet (ﷺ) and said: Messenger of Allah, I ate and drank in forgetfulness when I was fasting. Hie said: Allah had fed you and given you drink.",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، وَحَبِيبٌ، وَهِشَامٌ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَكَلْتُ وَشَرِبْتُ نَاسِيًا وَأَنَا صَائِمٌ ‏.‏ فَقَالَ ‏\n\"‏ أَطْعَمَكَ اللَّهُ وَسَقَاكَ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki datang kepada Nabi (ﷺ) dan berkata: Wahai Rasulullah, saya telah makan dan minum dalam keadaan lupa ketika saya sedang berpuasa. Baginda bersabda: Allah telah memberi kamu makan dan minum."
  },
  {
    "id": 22904,
    "hadith_number": 2400,
    "tajuk_hadith": "Kelewatan Mengganti Puasa Ramadan sehingga Sya'ban",
    "perawi_melayu": "Diriwayatkan oleh 'Aishah:",
    "english_text": "If I had some part of the fast of Ramadan to make up, I would not be able to atone for it except in Sha'ban.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ عَائِشَةَ، - رضى الله عنها - تَقُولُ إِنْ كَانَ لَيَكُونُ عَلَىَّ الصَّوْمُ مِنْ رَمَضَانَ فَمَا أَسْتَطِيعُ أَنْ أَقْضِيَهُ حَتَّى يَأْتِيَ شَعْبَانُ ‏.‏",
    "malay_translation": "Sekiranya saya masih mempunyai hari puasa Ramadan yang perlu diganti, saya tidak dapat melakukannya kecuali pada bulan Sya'ban."
  },
  {
    "id": 22905,
    "hadith_number": 2401,
    "tajuk_hadith": "Berpuasa bagi Pihak Orang yang Meninggal Dunia yang Mempunyai Hutang Puasa",
    "perawi_melayu": "Diriwayatkan dari Aisyah:",
    "english_text": "The Prophet (ﷺ) as saying: If anyone dies when some fast is due from him (i.e. which he could not keep) his heir must fast on his behalf.\n\n\nAbu Dawud said: This applies to the fast which a man vows ; and this is the opinion of Ahmad b. Hanbal.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ، عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ الزُّبَيْرِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ مَاتَ وَعَلَيْهِ صِيَامٌ صَامَ عَنْهُ وَلِيُّهُ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ هَذَا فِي النَّذْرِ وَهُوَ قَوْلُ أَحْمَدَ بْنِ حَنْبَلٍ ‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda: Jika seseorang meninggal dunia dan masih mempunyai hutang puasa (iaitu puasa yang tidak dapat ditunaikannya), maka warisnya hendaklah berpuasa bagi pihaknya.\n\n\nAbu Daud berkata: Ini terpakai untuk puasa nazar; dan ini adalah pendapat Ahmad b. Hanbal."
  },
  {
    "id": 22906,
    "hadith_number": 2402,
    "tajuk_hadith": "Hukum bagi Orang Sakit yang Meninggal Dunia dalam Bulan Ramadan",
    "perawi_melayu": "Diriwayatkan oleh Ibn 'Abbas:",
    "english_text": "If a man falls ill during Ramadan and he dies, while he could not keep the fast, food will be provided (for the poor men) on his behalf ; there is no atonement (for his fasts) due from him. If there is some vow which he could not fulfill, his heir must atone on his behalf.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ أَبِي حَصِينٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ إِذَا مَرِضَ الرَّجُلُ فِي رَمَضَانَ ثُمَّ مَاتَ وَلَمْ يَصُمْ أُطْعِمَ عَنْهُ وَلَمْ يَكُنْ عَلَيْهِ قَضَاءٌ وَإِنْ كَانَ عَلَيْهِ نَذْرٌ قَضَى عَنْهُ وَلِيُّهُ ‏.‏",
    "malay_translation": "Jika seseorang lelaki jatuh sakit semasa Ramadan dan dia meninggal dunia, sedangkan dia tidak dapat berpuasa, makanan akan disediakan (untuk orang miskin) bagi pihaknya; tidak ada penebusan (untuk puasanya) yang perlu ditanggung olehnya. Jika ada nazar yang tidak dapat dipenuhinya, warisnya mesti menebus bagi pihaknya."
  },
  {
    "id": 22907,
    "hadith_number": 2403,
    "tajuk_hadith": "Pilihan Berpuasa atau Tidak Berpuasa Semasa Musafir",
    "perawi_melayu": "Diriwayatkan oleh Aisyah:",
    "english_text": "Hamzat al-Aslami asked the Prophet (ﷺ): Messenger of Allah, I am a man who keeps perpetual fast, may I fast while on a journey? He replied: Fast if you like, or break your fast if you like.",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، وَمُسَدَّدٌ، قَالاَ حَدَّثَنَا حَمَّادٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ حَمْزَةَ الأَسْلَمِيَّ، سَأَلَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي رَجُلٌ أَسْرُدُ الصَّوْمَ أَفَأَصُومُ فِي السَّفَرِ قَالَ ‏\n\"‏ صُمْ إِنْ شِئْتَ وَأَفْطِرْ إِنْ شِئْتَ ‏\"‏ ‏.‏",
    "malay_translation": "Hamzah al-Aslami bertanya kepada Nabi (ﷺ): Wahai Rasulullah, sesungguhnya aku seorang lelaki yang berpuasa berterusan, bolehkah aku berpuasa ketika dalam perjalanan? Baginda menjawab: Berpuasalah jika kamu mahu, atau berbukalah jika kamu mahu."
  },
  {
    "id": 22908,
    "hadith_number": 2404,
    "tajuk_hadith": "Pilihan Berpuasa atau Berbuka bagi Musafir di Bulan Ramadan",
    "perawi_melayu": "Diriwayatkan oleh Hamzah al-Aslami:",
    "english_text": "I said: Messenger of Allah. I am a master of mounts and I use them ! I myself travel on them and I rent them. This month, that is, Ramadan, happend to come to me (while I am on a journey), and I find myself strong enough (to fast) as I am young, and I find that it is easier for me to fast than to postpone it, and i becomes debt due from me. Does it bring me more reward, Messenger of Allah, if I fast, or if I break ? He replied: Whichever you like, Hamzah.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَجِيدِ الْمَدَنِيُّ، قَالَ سَمِعْتُ حَمْزَةَ بْنَ مُحَمَّدِ بْنِ حَمْزَةَ الأَسْلَمِيَّ، يَذْكُرُ أَنَّ أَبَاهُ، أَخْبَرَهُ عَنْ جَدِّهِ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي صَاحِبُ ظَهْرٍ أُعَالِجُهُ أُسَافِرُ عَلَيْهِ وَأَكْرِيهِ وَإِنَّهُ رُبَّمَا صَادَفَنِي هَذَا الشَّهْرُ - يَعْنِي رَمَضَانَ - وَأَنَا أَجِدُ الْقُوَّةَ وَأَنَا شَابٌّ وَأَجِدُ بِأَنْ أَصُومَ يَا رَسُولَ اللَّهِ أَهْوَنَ عَلَىَّ مِنْ أَنْ أُؤَخِّرَهُ فَيَكُونَ دَيْنًا أَفَأَصُومُ يَا رَسُولَ اللَّهِ أَعْظَمُ لأَجْرِي أَوْ أُفْطِرُ قَالَ ‏\n\"‏ أَىُّ ذَلِكَ شِئْتَ يَا حَمْزَةُ ‏\"‏ ‏.‏",
    "malay_translation": "Saya berkata: Wahai Rasulullah. Sesungguhnya saya adalah pemilik haiwan tunggangan, yang saya uruskan, saya gunakan untuk perjalanan dan saya sewakan. Bulan ini, iaitu Ramadan, datang kepada saya (ketika saya sedang dalam perjalanan), dan saya dapati diri saya cukup kuat (untuk berpuasa) kerana saya masih muda. Saya juga mendapati bahawa lebih mudah bagi saya untuk berpuasa daripada menundanya, yang akan menjadi hutang bagi saya. Adakah berpuasa lebih besar ganjarannya bagi saya, wahai Rasulullah, atau berbuka? Baginda menjawab: Yang mana sahaja kamu suka, wahai Hamzah."
  },
  {
    "id": 22909,
    "hadith_number": 2405,
    "tajuk_hadith": "Berbuka Puasa Ketika Musafir di Bulan Ramadan",
    "perawi_melayu": "Diriwayatkan oleh Ibnu 'Abbas:",
    "english_text": "The Prophet (ﷺ) left Medina for Mecca till he reached 'Usfan, He then called for a vessel (of water). It was raised to his mouth to show it to the people, and that was in Ramadan. Ibn 'Abbas used to say: The Prophet (ﷺ) fasted and he broke his fast. He who likes may fast and he who likes may break.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم مِنَ الْمَدِينَةِ إِلَى مَكَّةَ حَتَّى بَلَغَ عُسْفَانَ ثُمَّ دَعَا بِإِنَاءٍ فَرَفَعَهُ إِلَى فِيهِ لِيُرِيَهُ النَّاسَ وَذَلِكَ فِي رَمَضَانَ ‏.‏ فَكَانَ ابْنُ عَبَّاسٍ يَقُولُ قَدْ صَامَ النَّبِيُّ صلى الله عليه وسلم وَأَفْطَرَ فَمَنْ شَاءَ صَامَ وَمَنْ شَاءَ أَفْطَرَ ‏.‏",
    "malay_translation": "Nabi (ﷺ) keluar dari Madinah menuju Mekah sehingga tiba di 'Usfan. Kemudian Baginda meminta sebuah bekas (air). Bekas itu diangkat ke mulut Baginda untuk menunjukkannya kepada orang ramai, dan peristiwa itu berlaku pada bulan Ramadan. Ibnu 'Abbas pernah berkata: Nabi (ﷺ) berpuasa dan Baginda berbuka. Sesiapa yang suka boleh berpuasa dan sesiapa yang suka boleh berbuka."
  },
  {
    "id": 22910,
    "hadith_number": 2406,
    "tajuk_hadith": "Toleransi Berpuasa dalam Musafir Ramadan",
    "perawi_melayu": "Diriwayatkan oleh Anas:",
    "english_text": "We travelled along with the Prophet (ﷺ) during Ramadan. Some of us were fasting and other broke their fast. Those who fasted did not find fault with those who broke, and those who broke their fast did not find fault with those who fasted.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زَائِدَةُ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسٍ، قَالَ سَافَرْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي رَمَضَانَ فَصَامَ بَعْضُنَا وَأَفْطَرَ بَعْضُنَا فَلَمْ يَعِبِ الصَّائِمُ عَلَى الْمُفْطِرِ وَلاَ الْمُفْطِرُ عَلَى الصَّائِمِ ‏.‏",
    "malay_translation": "Kami telah bermusafir bersama Nabi (ﷺ) semasa Ramadan. Sebahagian daripada kami berpuasa dan sebahagian lagi berbuka. Mereka yang berpuasa tidak mencela mereka yang berbuka, dan mereka yang berbuka tidak mencela mereka yang berpuasa."
  },
  {
    "id": 22911,
    "hadith_number": 2407,
    "tajuk_hadith": "Keringanan Berbuka Puasa Ketika Musafir dan Menghadapi Musuh",
    "perawi_melayu": "Diriwayatkan oleh Qaza'ah:",
    "english_text": "I came to Abu Sa'id al-Khudri while he was giving his legal opinion to the people who bent down on him. So I waited to see hi when he was alone. When he became alone, I asked him about keeping fast while travelling. He said: we went out along with the Prophet (ﷺ) in Ramadan in the year of conquest of Mecca. The Messenger of Allah (ﷺ) fasted and we fasted until he reached a certain stage. He said: You have come near your enemy; the breaking of fast will bring you more strength. Then morning came when some of us fasted and other broke their fast. He (Abu Sa'id al-Khudri) said: We then proceeded and alighted at a stage. He said: You are going to attack your enemy tomorrow morning ; breaking the fast will bring you more strength ; so break your fast (i.e. do not keep fast). This resolution (of breaking the fast) took place (due to the announcement) from the Messenger of Allah (ﷺ). \n\n\nAbu Sa'id said: Then I found myself keeping fast along with the Prophet (ﷺ) before and after that.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، وَوَهْبُ بْنُ بَيَانٍ، - الْمَعْنَى - قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنِي مُعَاوِيَةُ، عَنْ رَبِيعَةَ بْنِ يَزِيدَ، أَنَّهُ حَدَّثَهُ عَنْ قَزَعَةَ، قَالَ أَتَيْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ وَهُوَ يُفْتِي النَّاسَ وَهُمْ مُكِبُّونَ عَلَيْهِ فَانْتَظَرْتُ خَلْوَتَهُ فَلَمَّا خَلاَ سَأَلْتُهُ عَنْ صِيَامِ رَمَضَانَ فِي السَّفَرِ فَقَالَ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي رَمَضَانَ عَامَ الْفَتْحِ فَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ وَنَصُومُ حَتَّى بَلَغَ مَنْزِلاً مِنَ الْمَنَازِلِ فَقَالَ ‏\"‏ إِنَّكُمْ قَدْ دَنَوْتُمْ مِنْ عَدُوِّكُمْ وَالْفِطْرُ أَقْوَى لَكُمْ ‏\"‏ ‏.‏ فَأَصْبَحْنَا مِنَّا الصَّائِمُ وَمِنَّا الْمُفْطِرُ - قَالَ - ثُمَّ سِرْنَا فَنَزَلْنَا مَنْزِلاً فَقَالَ ‏\"‏ إِنَّكُمْ تُصَبِّحُونَ عَدُوَّكُمْ وَالْفِطْرُ أَقْوَى لَكُمْ فَأَفْطِرُوا ‏\"‏ ‏.‏ فَكَانَتْ عَزِيمَةً مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو سَعِيدٍ ثُمَّ لَقَدْ رَأَيْتُنِي أَصُومُ مَعَ النَّبِيِّ صلى الله عليه وسلم قَبْلَ ذَلِكَ وَبَعْدَ ذَلِكَ ‏.‏",
    "malay_translation": "Saya datang kepada Abu Sa'id al-Khudri ketika beliau sedang memberikan pendapat hukum kepada orang ramai yang tunduk di hadapannya. Lalu saya menunggu hingga beliau bersendirian. Apabila beliau bersendirian, saya bertanya kepadanya tentang berpuasa ketika dalam perjalanan. Beliau berkata: kami keluar bersama Nabi (ﷺ) pada bulan Ramadan tahun pembukaan Mekah. Rasulullah (ﷺ) berpuasa dan kami pun berpuasa sehingga baginda sampai di suatu tempat. Baginda bersabda: Kamu telah mendekati musuh kamu; berbuka puasa akan memberi kamu lebih kekuatan. Kemudian pagi tiba, sebahagian kami berpuasa dan sebahagian lagi berbuka puasa. Beliau (Abu Sa'id al-Khudri) berkata: Kemudian kami meneruskan perjalanan dan berhenti di suatu tempat. Baginda bersabda: Kamu akan menyerang musuh kamu esok pagi; berbuka puasa akan memberi kamu lebih kekuatan; maka berbukalah puasa (iaitu jangan berpuasa). Ketetapan (berbuka puasa) ini berlaku (kerana pengumuman) daripada Rasulullah (ﷺ). Abu Sa'id berkata: Kemudian saya dapati diri saya berpuasa bersama Nabi (ﷺ) sebelum dan selepas itu."
  },
  {
    "id": 22912,
    "hadith_number": 2408,
    "tajuk_hadith": "Berpuasa Semasa Musafir Bukanlah Kebaikan",
    "perawi_melayu": "Diriwayatkan oleh Jabir bin 'Abd Allah :",
    "english_text": "The Prophet (ﷺ) saw a man who had been put in the shade and saw a crowd of people around him (in the course of a journey). He said: Fasting while on journey is not part of righteousness.",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، - يَعْنِي ابْنَ سَعْدِ بْنِ زُرَارَةَ - عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَسَنٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَأَى رَجُلاً يُظَلَّلُ عَلَيْهِ وَالزِّحَامُ عَلَيْهِ فَقَالَ ‏\n\"‏ لَيْسَ مِنَ الْبِرِّ الصِّيَامُ فِي السَّفَرِ ‏\"‏ ‏.‏",
    "malay_translation": "Nabi (ﷺ) melihat seorang lelaki yang diletakkan di tempat teduh dan melihat sekumpulan orang ramai di sekelilingnya (dalam perjalanan). Baginda bersabda: Berpuasa semasa dalam perjalanan bukanlah sebahagian daripada kebaikan."
  },
  {
    "id": 22913,
    "hadith_number": 2409,
    "tajuk_hadith": "Keringanan Solat dan Puasa untuk Musafir, Wanita Menyusu dan Wanita Hamil",
    "perawi_melayu": "Diriwayatkan oleh Anas ibn Malik:",
    "english_text": "A man from Banu Abdullah ibn Ka'b brethren of Banu Qushayr (not Anas ibn Malik, the well-known Companion), said: A contingent from the cavalry of the Messenger of Allah (ﷺ) raided us. I reached (for he said went) to the Messenger of Allah (ﷺ) who was taking his meals. He said: Sit down, and take some from this meal of ours. I said: I am fasting, he said: Sit down, I shall tell you about prayer and fasting. Allah has remitted half the prayer to a traveller, and fasting to the traveller, the woman who is suckling an infant and the woman who is pregnant, I swear by Allah, he mentioned both (i.e. suckling and pregnant women) or one of them. I was grieved for not taking the food of the Messenger of Allah (ﷺ).",
    "arabic_text": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا أَبُو هِلاَلٍ الرَّاسِبِيُّ، حَدَّثَنَا ابْنُ سَوَادَةَ الْقُشَيْرِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ، - رَجُلٍ مِنْ بَنِي عَبْدِ اللَّهِ بْنِ كَعْبٍ إِخْوَةِ بَنِي قُشَيْرٍ - قَالَ أَغَارَتْ عَلَيْنَا خَيْلٌ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَانْتَهَيْتُ - أَوْ قَالَ فَانْطَلَقْتُ - إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ يَأْكُلُ فَقَالَ ‏\"‏ اجْلِسْ فَأَصِبْ مِنْ طَعَامِنَا هَذَا ‏\"‏ ‏.‏ فَقُلْتُ إِنِّي صَائِمٌ ‏.‏ قَالَ ‏\"‏ اجْلِسْ أُحَدِّثْكَ عَنِ الصَّلاَةِ وَعَنِ الصِّيَامِ إِنَّ اللَّهَ تَعَالَى وَضَعَ شَطْرَ الصَّلاَةِ أَوْ نِصْفَ الصَّلاَةِ وَالصَّوْمَ عَنِ الْمُسَافِرِ وَعَنِ الْمُرْضِعِ أَوِ الْحُبْلَى ‏\"‏ ‏.‏ وَاللَّهِ لَقَدْ قَالَهُمَا جَمِيعًا أَوْ أَحَدَهُمَا قَالَ فَتَلَهَّفَتْ نَفْسِي أَنْ لاَ أَكُونَ أَكَلْتُ مِنْ طَعَامِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Seorang lelaki daripada Banu Abdullah ibn Ka'b, saudara Banu Qushayr (bukan Anas ibn Malik, Sahabat yang terkenal), berkata: Sekumpulan pasukan berkuda Rasulullah ﷺ menyerang kami. Saya sampai (atau dia berkata pergi) kepada Rasulullah ﷺ yang sedang makan. Baginda bersabda: \"Duduklah, dan ambillah sedikit dari makanan kami ini.\" Saya berkata: \"Saya sedang berpuasa.\" Baginda bersabda: \"Duduklah, aku akan memberitahumu tentang solat dan puasa. Sesungguhnya Allah Ta'ala telah meringankan separuh solat atau separuh solat dan puasa bagi musafir, dan bagi wanita yang menyusukan bayi dan wanita yang hamil,\" - demi Allah, baginda menyebut kedua-duanya (iaitu wanita menyusu dan wanita hamil) atau salah satu daripadanya. Saya berasa sedih kerana tidak mengambil makanan Rasulullah ﷺ."
  },
  {
    "id": 22914,
    "hadith_number": 2410,
    "tajuk_hadith": "Keadaan Panas Terik Ketika Peperangan: Hanya Rasulullah ﷺ dan Abdullah bin Rawahah Berpuasa",
    "perawi_melayu": "Diriwayatkan oleh Abu al-Darda:",
    "english_text": "We went out along with the Messenger of Allah (ﷺ) for some battle in intense heat, so much so that one of us placed his hand on his head, or placed his palm on his head, due to intense heat, No one of us fasted except the Messenger of Allah (ﷺ) and 'Abd Allah b. Rawahah.",
    "arabic_text": "حَدَّثَنَا مُؤَمَّلُ بْنُ الْفَضْلِ، حَدَّثَنَا الْوَلِيدُ، حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ، حَدَّثَنِي إِسْمَاعِيلُ بْنُ عُبَيْدِ اللَّهِ، حَدَّثَتْنِي أُمُّ الدَّرْدَاءِ، عَنْ أَبِي الدَّرْدَاءِ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي بَعْضِ غَزَوَاتِهِ فِي حَرٍّ شَدِيدٍ حَتَّى إِنَّ أَحَدَنَا لَيَضَعُ يَدَهُ عَلَى رَأْسِهِ أَوْ كَفَّهُ عَلَى رَأْسِهِ مِنْ شِدَّةِ الْحَرِّ مَا فِينَا صَائِمٌ إِلاَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَعَبْدُ اللَّهِ بْنُ رَوَاحَةَ ‏.‏",
    "malay_translation": "Kami keluar bersama Rasulullah ﷺ untuk beberapa peperangan dalam cuaca panas yang teruk, sehingga salah seorang daripada kami meletakkan tangannya di atas kepala, atau meletakkan telapak tangannya di atas kepala, kerana panas yang teruk. Tiada seorang pun daripada kami yang berpuasa kecuali Rasulullah ﷺ dan 'Abd Allah bin Rawahah."
  },
  {
    "id": 22915,
    "hadith_number": 2411,
    "tajuk_hadith": "Kewajipan Berpuasa Ramadan Bagi Musafir yang Mencukupi Bekalan Makanan",
    "perawi_melayu": "Diriwayatkan oleh Salamah ibn al-Muhabbaq al-Hudhali:",
    "english_text": "The Messenger of Allah (ﷺ) said: If anyone has a riding beast which carries him to where he can get sufficient food, he should keep the fast of Ramadan wherever he is when it comes.",
    "arabic_text": "حَدَّثَنَا حَامِدُ بْنُ يَحْيَى، حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، ح وَحَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ، حَدَّثَنَا أَبُو قُتَيْبَةَ، - الْمَعْنَى - قَالاَ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ حَبِيبِ بْنِ عَبْدِ اللَّهِ الأَزْدِيُّ، حَدَّثَنِي حَبِيبُ بْنُ عَبْدِ اللَّهِ، قَالَ سَمِعْتُ سِنَانَ بْنَ سَلَمَةَ بْنِ الْمُحَبَّقِ الْهُذَلِيَّ، يُحَدِّثُ عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ كَانَتْ لَهُ حَمُولَةٌ تَأْوِي إِلَى شِبَعٍ فَلْيَصُمْ رَمَضَانَ حَيْثُ أَدْرَكَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda: Jika seseorang memiliki binatang tunggangan yang membawanya ke tempat di mana dia boleh mendapatkan makanan yang mencukupi, maka hendaklah dia berpuasa Ramadan di mana sahaja dia berada ketika bulan itu tiba."
  },
  {
    "id": 22916,
    "hadith_number": 2412,
    "tajuk_hadith": "Kewajipan Berpuasa Bagi Musafir di Bulan Ramadan",
    "perawi_melayu": "Diriwayatkan oleh Salamah bin al-Muhabbaq:",
    "english_text": "The Messenger of Allah (ﷺ) as saying: If anyone is on a journey and Ramadan comes... He then narrated the rest of the tradition to the same effect.",
    "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ الْمُهَاجِرِ، حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ حَبِيبٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ سِنَانِ بْنِ سَلَمَةَ، عَنْ سَلَمَةَ بْنِ الْمُحَبَّقِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ أَدْرَكَهُ رَمَضَانُ فِي السَّفَرِ ‏\"‏ ‏.‏ فَذَكَرَ مَعْنَاهُ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda: Jika seseorang berada dalam perjalanan dan Ramadan tiba... Kemudian baginda meriwayatkan sisa hadis dengan maksud yang sama."
  },
  {
    "id": 22917,
    "hadith_number": 2413,
    "tajuk_hadith": "Sunnah Berbuka Puasa di dalam Kapal",
    "perawi_melayu": "Diriwayatkan oleh AbuBusrah al-Ghifari:",
    "english_text": "Ja'far ibn Jubayr said: I accompanied AbuBusrah al-Ghifari, a Companion of the Messenger of Allah (ﷺ), in a boat proceeding from al-Fustat (Cairo) during Ramadan. He was lifted (to the boat), then his meal was brought to him. The narrator Ja'far said in his version: He did not go beyond the houses (of the city) but he called for the dining sheet. He said (to me): Come near. I said: Do you not see the houses? AbuBusrah said: Do you detest the sunnah (practice) of the Messenger of Allah (ﷺ)? The narrator Ja'far said in his version: He then ate (it).",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ يَزِيدَ، ح وَحَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَحْيَى، - الْمَعْنَى - حَدَّثَنِي سَعِيدُ بْنُ أَبِي أَيُّوبَ، وَزَادَ، جَعْفَرٌ وَاللَّيْثُ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، أَنَّ كُلَيْبَ بْنَ ذُهْلٍ الْحَضْرَمِيَّ، أَخْبَرَهُ عَنْ عُبَيْدٍ، - قَالَ جَعْفَرٌ ابْنُ جَبْرٍ - قَالَ كُنْتُ مَعَ أَبِي بَصْرَةَ الْغِفَارِيِّ صَاحِبِ النَّبِيِّ صلى الله عليه وسلم فِي سَفِينَةٍ مِنَ الْفُسْطَاطِ فِي رَمَضَانَ فَرُفِعَ ثُمَّ قُرِّبَ غَدَاهُ - قَالَ جَعْفَرٌ فِي حَدِيثِهِ - فَلَمْ يُجَاوِزِ الْبُيُوتَ حَتَّى دَعَا بِالسُّفْرَةِ قَالَ اقْتَرِبْ ‏.‏ قُلْتُ أَلَسْتَ تَرَى الْبُيُوتَ قَالَ أَبُو بَصْرَةَ أَتَرْغَبُ عَنْ سُنَّةِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ جَعْفَرٌ فِي حَدِيثِهِ فَأَكَلَ ‏.‏",
    "malay_translation": "Ja'far ibn Jubayr berkata: Saya menemani AbuBusrah al-Ghifari, seorang Sahabat Rasulullah (ﷺ), di dalam sebuah perahu yang bergerak dari al-Fustat (Kaherah) semasa Ramadan. Beliau diangkat (ke atas perahu), kemudian makanannya dibawa kepadanya. Perawi Ja'far berkata dalam riwayatnya: Beliau tidak melampaui rumah-rumah (di bandar) tetapi beliau meminta alas makan. Beliau berkata (kepada saya): Mendekatlah. Saya berkata: Tidakkah kamu melihat rumah-rumah? AbuBusrah berkata: Adakah kamu membenci sunnah (amalan) Rasulullah (ﷺ)? Perawi Ja'far berkata dalam riwayatnya: Kemudian beliau makan (makanan itu)."
  },
  {
    "id": 22918,
    "hadith_number": 2414,
    "tajuk_hadith": "Dihyah ibn Khalifah Berbuka Puasa Semasa Perjalanan dan Tegur Sikap Enggan Mengikut Sunnah",
    "perawi_melayu": "Diriwayatkan oleh Dihyah:",
    "english_text": "Mansur al-Kalbi said: Dihyah ibn Khalifah once went out from a village of Damascus at as much distance as it measures between Aqabah and al-Fustat during Ramadan; and that is three miles. He then broke his fast and the people broke their fast along with him. But some of them disliked to break their fast. When he came back to his village, he said: I swear by Allah, today I witnessed a thing of which I could not even think to see. The people detested the way of the Messenger of Allah (ﷺ) and his Companions. He said this to those who fasted. At this moment he said: O Allah, make me die.",
    "arabic_text": "حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ، أَخْبَرَنَا اللَّيْثُ، - يَعْنِي ابْنَ سَعْدٍ - عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ مَنْصُورٍ الْكَلْبِيِّ، أَنَّ دِحْيَةَ بْنَ خَلِيفَةَ، خَرَجَ مِنْ قَرْيَةٍ مِنْ دِمَشْقَ مَرَّةً إِلَى قَدْرِ قَرْيَةِ عُقْبَةَ مِنَ الْفُسْطَاطِ وَذَلِكَ ثَلاَثَةُ أَمْيَالٍ فِي رَمَضَانَ ثُمَّ إِنَّهُ أَفْطَرَ وَأَفْطَرَ مَعَهُ نَاسٌ وَكَرِهَ آخَرُونَ أَنْ يُفْطِرُوا فَلَمَّا رَجَعَ إِلَى قَرْيَتِهِ قَالَ وَاللَّهِ لَقَدْ رَأَيْتُ الْيَوْمَ أَمْرًا مَا كُنْتُ أَظُنُّ أَنِّي أَرَاهُ إِنَّ قَوْمًا رَغِبُوا عَنْ هَدْىِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَصْحَابِهِ ‏.‏ يَقُولُ ذَلِكَ لِلَّذِينَ صَامُوا ثُمَّ قَالَ عِنْدَ ذَلِكَ اللَّهُمَّ اقْبِضْنِي إِلَيْكَ ‏.‏",
    "malay_translation": "Mansur al-Kalbi berkata: Dihyah ibn Khalifah pernah keluar dari sebuah kampung di Damsyik pada bulan Ramadan, sejauh jarak antara Aqabah dan al-Fustat; iaitu kira-kira tiga batu. Beliau kemudian berbuka puasa, dan orang ramai turut berbuka puasa bersamanya. Namun, ada sebahagian daripada mereka yang tidak suka untuk berbuka puasa. Apabila beliau kembali ke kampungnya, beliau berkata: 'Demi Allah, hari ini aku menyaksikan suatu perkara yang tidak pernah terlintas di fikiran aku untuk melihatnya. Sesungguhnya, ada orang yang membenci sunnah Rasulullah (ﷺ) dan para Sahabatnya.' Beliau berkata demikian kepada orang-orang yang berpuasa. Pada ketika itu, beliau berdoa: 'Ya Allah, wafatkanlah aku.'"
  },
  {
    "id": 22919,
    "hadith_number": 2415,
    "tajuk_hadith": "Ibnu Umar Tidak Berbuka Puasa atau Memendekkan Solat di Al-Ghabah",
    "perawi_melayu": "Berkata Nafi':",
    "english_text": "Ibn 'Umar used to go out to al-Ghabah (jungle), but he neither broke his fast, nor shortened his prayer.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا الْمُعْتَمِرُ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، كَانَ يَخْرُجُ إِلَى الْغَابَةِ فَلاَ يُفْطِرُ وَلاَ يَقْصُرُ ‏.‏",
    "malay_translation": "Ibnu Umar pernah keluar ke al-Ghabah (hutan), tetapi beliau tidak berbuka puasa, dan tidak juga memendekkan solatnya."
  },
  {
    "id": 22920,
    "hadith_number": 2416,
    "tajuk_hadith": "Larangan Mengaku Beribadah Sepanjang Ramadan",
    "perawi_melayu": "Diriwayatkan oleh AbuBakrah:",
    "english_text": "The Prophet (ﷺ) said: One of you should not say: I fasted the whole of Ramadan, and I prayed during the night in the whole of Ramadan. I do not know whether he disliked the purification; or he (the narrator) said: He must have slept a little and taken rest.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنِ الْمُهَلَّبِ بْنِ أَبِي حَبِيبَةَ، حَدَّثَنَا الْحَسَنُ، عَنْ أَبِي بَكْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَقُولَنَّ أَحَدُكُمْ إِنِّي صُمْتُ رَمَضَانَ كُلَّهُ وَ قُمْتُهُ كُلَّهُ ‏\"‏ ‏.‏ فَلاَ أَدْرِي أَكَرِهَ التَّزْكِيَةَ أَوْ قَالَ لاَ بُدَّ مِنْ نَوْمَةٍ أَوْ رَقْدَةٍ ‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda: Janganlah salah seorang daripada kamu berkata: Aku berpuasa sepanjang Ramadan, dan aku solat malam sepanjang Ramadan. Aku tidak tahu sama ada baginda tidak menyukai penyucian diri; atau perawi berkata: Dia pasti tidur sedikit dan berehat."
  },
  {
    "id": 22921,
    "hadith_number": 2417,
    "tajuk_hadith": "Larangan Berpuasa pada Hari Raya Aidilfitri dan Aidiladha",
    "perawi_melayu": "Diriwayatkan oleh Abu 'Ubaid:",
    "english_text": "I attended the 'Id (prayer) along with 'Umar. He offered prayer before the sermon. He then said: The Messenger of Allah (ﷺ) prohibited fasting on these two days. As regards Id al-Adha, you eat the meat of your sacrificial animals. As for 'Id al-Fitr, you break (i.e. end) your fast.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَزُهَيْرُ بْنُ حَرْبٍ، - وَهَذَا حَدِيثُهُ - قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي عُبَيْدٍ، قَالَ شَهِدْتُ الْعِيدَ مَعَ عُمَرَ فَبَدَأَ بِالصَّلاَةِ قَبْلَ الْخُطْبَةِ ثُمَّ قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ صِيَامِ هَذَيْنِ الْيَوْمَيْنِ أَمَّا يَوْمُ الأَضْحَى فَتَأْكُلُونَ مِنْ لَحْمِ نُسُكِكُمْ وَأَمَّا يَوْمُ الْفِطْرِ فَفِطْرُكُمْ مِنْ صِيَامِكُمْ ‏.‏",
    "malay_translation": "Saya menghadiri solat 'Id bersama 'Umar. Beliau menunaikan solat sebelum khutbah. Kemudian beliau berkata: Sesungguhnya Rasulullah (ﷺ) melarang berpuasa pada dua hari ini. Mengenai 'Id al-Adha, kamu makan daging haiwan korban kamu. Adapun 'Id al-Fitr, kamu berbuka (iaitu menamatkan) puasa kamu."
  },
  {
    "id": 22922,
    "hadith_number": 2418,
    "tajuk_hadith": "Larangan Berpuasa pada Hari Raya, Pakaian Tertentu, Cara Duduk, dan Waktu Solat Tertentu",
    "perawi_melayu": "Diriwayatkan oleh Abu Sa’id Al Khudri:",
    "english_text": "The Messenger of Allah (ﷺ) forbade fasting on two days, al-Fitr (breaking the fast of Ramadan) and al-Adha (the day of sacrifice), and wearing a tight single garment the raising of which discloses private parts, and sitting with one's legs drawn up and wrapped in one's garment, and forbade praying at two hours, after the Fajr prayer and after the Asr prayer.",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَمْرُو بْنُ يَحْيَى، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ صِيَامِ يَوْمَيْنِ يَوْمِ الْفِطْرِ وَيَوْمِ الأَضْحَى وَعَنْ لِبْسَتَيْنِ الصَّمَّاءِ وَأَنْ يَحْتَبِيَ الرَّجُلُ فِي الثَّوْبِ الْوَاحِدِ وَعَنِ الصَّلاَةِ فِي سَاعَتَيْنِ بَعْدَ الصُّبْحِ وَبَعْدَ الْعَصْرِ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) melarang berpuasa pada dua hari, iaitu Hari Raya Fitri (hari berbuka puasa Ramadan) dan Hari Raya Adha (hari korban), dan (melarang) memakai pakaian satu lapis yang ketat sehingga menampakkan aurat apabila diangkat, dan (melarang) duduk ihtiba' (iaitu duduk dengan kaki ditarik ke atas dan dibalut dengan pakaian), serta melarang solat pada dua waktu, iaitu selepas solat Subuh dan selepas solat Asar."
  },
  {
    "id": 22923,
    "hadith_number": 2419,
    "tajuk_hadith": "Larangan Berpuasa pada Hari Tasyrik",
    "perawi_melayu": "Abu Murrah, maula Umm Hani, masuk bersama 'Abd Allah b. 'Amr menemui ayahnya 'Amr b. 'As dan beliau menghidangkan makanan untuk mereka berdua. Beliau berkata:",
    "english_text": "Eat. He said: I am fasting. 'Amr said: Eat, these are the days on which the Messenger of Allah (ﷺ) used to command us to break fast, and forbid us to keep fast. The narrator Malik said: These are the day of al-tashriq (i.e. 11th, 12th, and 13th of Dhu al-Hijjah).",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ الْهَادِ، عَنْ أَبِي مُرَّةَ، مَوْلَى أُمِّ هَانِئٍ أَنَّهُ دَخَلَ مَعَ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَلَى أَبِيهِ عَمْرِو بْنِ الْعَاصِ فَقَرَّبَ إِلَيْهِمَا طَعَامًا فَقَالَ كُلْ ‏.‏ فَقَالَ إِنِّي صَائِمٌ ‏.‏ فَقَالَ عَمْرٌو كُلْ فَهَذِهِ الأَيَّامُ الَّتِي كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَأْمُرُنَا بِإِفْطَارِهَا وَيَنْهَانَا عَنْ صِيَامِهَا ‏.‏ قَالَ مَالِكٌ وَهِيَ أَيَّامُ التَّشْرِيقِ ‏.‏",
    "malay_translation": "Makanlah. Dia berkata: Saya sedang berpuasa. 'Amr berkata: Makanlah, ini adalah hari-hari di mana Rasulullah (ﷺ) memerintahkan kami untuk berbuka puasa, dan melarang kami untuk berpuasa. Perawi Malik berkata: Ini adalah hari-hari tasyrik (iaitu 11, 12, dan 13 Dhu al-Hijjah)."
  },
  {
    "id": 22924,
    "hadith_number": 2420,
    "tajuk_hadith": "Hari-hari Perayaan bagi Umat Islam",
    "perawi_melayu": "Diriwayatkan oleh Uqbah ibn Amir:",
    "english_text": "The Prophet (ﷺ) said: The day of Arafah, the day of sacrifice, the days of tashriq are (the days of) our festival, O people of Islam. These are the days of eating and drinking.",
    "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا وَهْبٌ، حَدَّثَنَا مُوسَى بْنُ عُلَىٍّ، ح وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ مُوسَى بْنِ عُلَىٍّ، - وَالإِخْبَارُ فِي حَدِيثِ وَهْبٍ - قَالَ سَمِعْتُ أَبِي أَنَّهُ، سَمِعَ عُقْبَةَ بْنَ عَامِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَوْمُ عَرَفَةَ وَيَوْمُ النَّحْرِ وَأَيَّامُ التَّشْرِيقِ عِيدُنَا أَهْلَ الإِسْلاَمِ وَهِيَ أَيَّامُ أَكْلٍ وَشُرْبٍ ‏\"‏ ‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda: Hari Arafah, hari korban, hari-hari tasyrik adalah (hari-hari) perayaan kita, wahai umat Islam. Ini adalah hari-hari makan dan minum."
  },
  {
    "id": 22925,
    "hadith_number": 2421,
    "tajuk_hadith": "Larangan Berpuasa pada Hari Jumaat Kecuali dengan Puasa Tambahan",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "The Messenger of Allah (ﷺ) as saying: None of you must fast on Friday unless he fasts the day before or the day after.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَصُمْ أَحَدُكُمْ يَوْمَ الْجُمُعَةِ إِلاَّ أَنْ يَصُومَ قَبْلَهُ بِيَوْمٍ أَوْ بَعْدَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda: Janganlah sekali-kali kamu berpuasa pada hari Jumaat kecuali jika kamu berpuasa sehari sebelumnya atau sehari sesudahnya."
  },
  {
    "id": 22926,
    "hadith_number": 2422,
    "tajuk_hadith": "Larangan Berpuasa pada Hari Sabtu Kecuali yang Diwajibkan",
    "perawi_melayu": "Perawi: As-Samma', saudara perempuan Abdullah ibn Busr:",
    "english_text": "The Prophet (ﷺ) said: Do not fast on Saturday except what has been made obligatory on you; and if one of you can get nothing but a grape skin or a piece of wood from a tree, he should chew it.",
    "arabic_text": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا سُفْيَانُ بْنُ حَبِيبٍ، ح وَحَدَّثَنَا يَزِيدُ بْنُ قُبَيْسٍ، - مِنْ أَهْلِ جَبَلَةَ - حَدَّثَنَا الْوَلِيدُ، جَمِيعًا عَنْ ثَوْرِ بْنِ يَزِيدَ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ السُّلَمِيِّ، عَنْ أُخْتِهِ، - وَقَالَ يَزِيدُ الصَّمَّاءِ - أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَصُومُوا يَوْمَ السَّبْتِ إِلاَّ فِيمَا افْتُرِضَ عَلَيْكُمْ وَإِنْ لَمْ يَجِدْ أَحَدُكُمْ إِلاَّ لِحَاءَ عِنَبَةٍ أَوْ عُودَ شَجَرَةٍ فَلْيَمْضُغْهُ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ وَهَذَا حَدِيثٌ مَنْسُوخٌ ‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda: Janganlah kamu berpuasa pada hari Sabtu kecuali puasa yang telah diwajibkan ke atas kamu; dan jika salah seorang daripada kamu tidak mendapat apa-apa kecuali kulit anggur atau sepotong kayu dari pokok, maka hendaklah dia mengunyahnya."
  },
  {
    "id": 22927,
    "hadith_number": 2423,
    "tajuk_hadith": "Perintah Berbuka Puasa Sunat Jika Tidak Berpuasa Semalam dan Esok",
    "perawi_melayu": "Diriwayatkan oleh Juwairiyah binti al-Harith:",
    "english_text": "That the Prophet (ﷺ) entered upon her on Friday while she was fasting. He asked: Did you fast yesterday ? She said: No. He again asked: Do you intend to fast tomorrow ? She said: No. He said: So break your fast.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، ح وَحَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَبِي أَيُّوبَ، - قَالَ حَفْصٌ الْعَتَكِيُّ - عَنْ جُوَيْرِيَةَ بِنْتِ الْحَارِثِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَلَيْهَا يَوْمَ الْجُمُعَةِ وَهِيَ صَائِمَةٌ فَقَالَ ‏\"‏ أَصُمْتِ أَمْسِ ‏\"‏ ‏.‏ قَالَتْ لاَ ‏.‏ قَالَ ‏\"‏ تُرِيدِينَ أَنْ تَصُومِي غَدًا ‏\"‏ ‏.‏ قَالَتْ لاَ ‏.‏ قَالَ ‏\"‏ فَأَفْطِرِي ‏\"‏ ‏.‏",
    "malay_translation": "Bahawa Nabi (ﷺ) masuk menemuinya pada hari Jumaat ketika dia sedang berpuasa. Baginda bertanya: Adakah kamu berpuasa semalam? Dia menjawab: Tidak. Baginda bertanya lagi: Adakah kamu berniat untuk berpuasa esok? Dia menjawab: Tidak. Baginda bersabda: Maka berbukalah."
  },
  {
    "id": 22928,
    "hadith_number": 2424,
    "tajuk_hadith": "Pandangan Ibn Shihab tentang Larangan Berpuasa pada Hari Sabtu",
    "perawi_melayu": "Diriwayatkan oleh Al-Laith:",
    "english_text": "When it was mentioned to Ibn Shihab (al-Zuhri) that fasting on Saturday had been prohibited, he would say: This is a Himsi tradition.",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبٍ، حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ سَمِعْتُ اللَّيْثَ، يُحَدِّثُ عَنِ ابْنِ شِهَابٍ، أَنَّهُ كَانَ إِذَا ذُكِرَ لَهُ أَنَّهُ نُهِيَ عَنْ صِيَامِ يَوْمِ السَّبْتِ يَقُولُ ابْنُ شِهَابٍ هَذَا حَدِيثٌ حِمْصِيٌّ ‏.‏",
    "malay_translation": "Apabila disebutkan kepada Ibn Shihab (al-Zuhri) bahawa berpuasa pada hari Sabtu telah dilarang, beliau akan berkata: 'Ini adalah tradisi Himsi.'"
  },
  {
    "id": 22929,
    "hadith_number": 2425,
    "tajuk_hadith": "Pendedahan Hadis Palsu Mengenai Puasa Hari Sabtu",
    "perawi_melayu": "Al-Auza'i berkata:",
    "english_text": "I always concealed it, but I found that it became known widely, that is, the tradition on Ibn Busr about fasting on Saturday.\n\n\nAbu Dawud said: Malik said: This is a false (tradition).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ بْنِ سُفْيَانَ، حَدَّثَنَا الْوَلِيدُ، عَنِ الأَوْزَاعِيِّ، قَالَ مَا زِلْتُ لَهُ كَاتِمًا حَتَّى رَأَيْتُهُ انْتَشَرَ ‏.‏ يَعْنِي حَدِيثَ عَبْدِ اللَّهِ بْنِ بُسْرٍ هَذَا فِي صَوْمِ يَوْمِ السَّبْتِ ‏.‏ قَالَ أَبُو دَاوُدَ قَالَ مَالِكٌ هَذَا كَذِبٌ ‏.‏",
    "malay_translation": "Saya sentiasa menyembunyikannya, tetapi saya mendapati bahawa ia menjadi terkenal secara meluas, iaitu, tradisi mengenai Ibn Busr tentang berpuasa pada hari Sabtu.\n\nAbu Dawud berkata: Malik berkata: Ini adalah (tradisi) palsu."
  },
  {
    "id": 22930,
    "hadith_number": 2426,
    "tajuk_hadith": "Jenis-jenis Puasa dan Kelebihan Puasa 'Arafah dan 'Asyura'",
    "perawi_melayu": "Diriwayatkan oleh Abu Qatadah:",
    "english_text": "A man came to the Prophet (ﷺ) and said: How do you fast, Messenger of Allah? The Messenger of Allah (ﷺ) became angry at what he said.  \n\n\n\n\n\nWhen Umar observed this (his anger), he said: We are satisfied with Allah as Lord, with Islam as religion, and with Muhammad as Prophet. We seek refuge in Allah from the anger of Allah, and from the anger of His Apostle. Umar continued to repeat these words till his anger cooled down. He then asked: Messenger of Allah, what is the position of one who observes a perpetual fast?  \n\n\n\n\n\nHe replied: May he not fast or break his fast.  Musaddad said in his version: He has neither fasted nor broken his fast. The narrator, Ghaylan, doubted the actual wordings.  \n\n\n\n\n\nHe asked: What is the position of one who fasts two days and does not fast one day?  \n\n\n\n\n\nHe said: Is anyone able to do that?  He asked: What is the position of one who fasts every second day (i.e. fasts one day and does not fasts the next day)?  \n\n\n\n\n\nHe (the Prophet) said: This is the fast that David observed.  \n\n\n\n\n\nHe asked: Messenger of Allah, what is the position of one who fasts one day and breaks it for two days?  He replied: I wish I were given the power to observe that. Then the Messenger of Allah (ﷺ) said: The observance of three days' fast every month and of one Ramadan to the other (i.e. the fast of Ramadan every year) is (equivalent to) a perpetual fast. I seek from Allah that fasting on the day of Arafah may atone for the sins of the preceding and the coming year, and I seek from Allah that fasting on the day of Ashura' may atone for the sins of the preceding year.",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، وَمُسَدَّدٌ، قَالاَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ غَيْلاَنَ بْنِ جَرِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَعْبَدٍ الزِّمَّانِيِّ، عَنْ أَبِي قَتَادَةَ، أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ تَصُومُ فَغَضِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ قَوْلِهِ فَلَمَّا رَأَى ذَلِكَ عُمَرُ قَالَ رَضِينَا بِاللَّهِ رَبًّا وَبِالإِسْلاَمِ دِينًا وَبِمُحَمَّدٍ نَبِيًّا نَعُوذُ بِاللَّهِ مِنْ غَضَبِ اللَّهِ وَمِنْ غَضَبِ رَسُولِهِ ‏.‏ فَلَمْ يَزَلْ عُمَرُ يُرَدِّدُهَا حَتَّى سَكَنَ غَضَبُ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ بِمَنْ يَصُومُ الدَّهْرَ كُلَّهُ قَالَ ‏\"‏ لاَ صَامَ وَلاَ أَفْطَرَ ‏\"‏ ‏.‏ قَالَ مُسَدَّدٌ ‏\"‏ لَمْ يَصُمْ وَلَمْ يُفْطِرْ أَوْ مَا صَامَ وَلاَ أَفْطَرَ ‏\"‏ ‏.‏ شَكَّ غَيْلاَنُ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ كَيْفَ بِمَنْ يَصُومُ يَوْمَيْنِ وَيُفْطِرُ يَوْمًا قَالَ ‏\"‏ أَوَيُطِيقُ ذَلِكَ أَحَدٌ ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ فَكَيْفَ بِمَنْ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا قَالَ ‏\"‏ ذَلِكَ صَوْمُ دَاوُدَ ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ فَكَيْفَ بِمَنْ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمَيْنِ قَالَ ‏\"‏ وَدِدْتُ أَنِّي طُوِّقْتُ ذَلِكَ ‏\"‏ ‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ثَلاَثٌ مِنْ كُلِّ شَهْرٍ وَرَمَضَانُ إِلَى رَمَضَانَ فَهَذَا صِيَامُ الدَّهْرِ كُلِّهِ وَصِيَامُ عَرَفَةَ إِنِّي أَحْتَسِبُ عَلَى اللَّهِ أَنْ يُكَفِّرَ السَّنَةَ الَّتِي قَبْلَهُ وَالسَّنَةَ الَّتِي بَعْدَهُ وَصَوْمُ يَوْمِ عَاشُورَاءَ إِنِّي أَحْتَسِبُ عَلَى اللَّهِ أَنْ يُكَفِّرَ السَّنَةَ الَّتِي قَبْلَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki datang kepada Nabi (ﷺ) dan berkata: 'Wahai Rasulullah, bagaimana cara kamu berpuasa?' Rasulullah (ﷺ) menjadi marah dengan perkataannya itu.\n\nApabila Umar melihat kemarahan Baginda, beliau berkata: 'Kami redha Allah sebagai Tuhan kami, Islam sebagai agama kami, dan Muhammad sebagai Nabi kami. Kami berlindung kepada Allah daripada kemurkaan Allah, dan daripada kemurkaan Rasul-Nya.' Umar terus mengulangi kata-kata ini sehingga kemarahan Rasulullah (ﷺ) reda. Kemudian beliau bertanya: 'Wahai Rasulullah, bagaimana pula dengan orang yang berpuasa berterusan (sepanjang tahun)?'\n\nBaginda menjawab: 'Dia tidak berpuasa dan tidak berbuka.' Musaddad meriwayatkan dalam versinya: 'Dia tidak berpuasa dan tidak berbuka, atau dia tidak berpuasa dan tidak berbuka.' Perawi, Ghaylan, meragui perkataan sebenar.\n\nLelaki itu bertanya: 'Bagaimana pula dengan orang yang berpuasa dua hari dan tidak berpuasa satu hari?'\n\nBaginda bersabda: 'Adakah sesiapa yang mampu melakukan itu?' Lelaki itu bertanya: 'Bagaimana pula dengan orang yang berpuasa selang sehari (iaitu berpuasa satu hari dan tidak berpuasa hari berikutnya)?'\n\nBaginda (Nabi) bersabda: 'Itulah puasa yang diamalkan oleh Daud.'\n\nLelaki itu bertanya: 'Wahai Rasulullah, bagaimana pula dengan orang yang berpuasa satu hari dan berbuka dua hari?' Baginda menjawab: 'Aku berharap aku diberi kekuatan untuk mengamalkannya.' Kemudian Rasulullah (ﷺ) bersabda: 'Berpuasa tiga hari setiap bulan dan dari satu Ramadan ke Ramadan yang lain (iaitu puasa Ramadan setiap tahun) adalah (sama dengan) puasa berterusan. Aku mengharapkan daripada Allah bahawa puasa pada hari Arafah dapat menghapuskan dosa tahun yang lalu dan tahun yang akan datang, dan aku mengharapkan daripada Allah bahawa puasa pada hari Asyura' dapat menghapuskan dosa tahun yang lalu.'"
  },
  {
    "id": 22931,
    "hadith_number": 2427,
    "tajuk_hadith": "Keutamaan Puasa Isnin dan Khamis",
    "perawi_melayu": "Hadis yang disebutkan di atas juga diriwayatkan oleh Abu Qatadah melalui rangkaian perawi yang berbeza. Versi ini menambah:",
    "english_text": "He said: Messenger of Allah, tell me about keeping fast on Monday and Thursday. He said: On it I was born, and on it the Qur'an was first revealed to me.",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا مَهْدِيُّ، حَدَّثَنَا غَيْلاَنُ، عَنْ عَبْدِ اللَّهِ بْنِ مَعْبَدٍ الزِّمَّانِيِّ، عَنْ أَبِي قَتَادَةَ، بِهَذَا الْحَدِيثِ زَادَ قَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ صَوْمَ يَوْمِ الاِثْنَيْنِ وَيَوْمِ الْخَمِيسِ قَالَ ‏\n\"‏ فِيهِ وُلِدْتُ وَفِيهِ أُنْزِلَ عَلَىَّ الْقُرْآنُ ‏\"‏ ‏.‏",
    "malay_translation": "Beliau berkata: Wahai Rasulullah, beritahu saya tentang berpuasa pada hari Isnin dan Khamis. Baginda bersabda: Pada hari itu aku dilahirkan, dan pada hari itu al-Quran pertama kali diturunkan kepadaku."
  },
  {
    "id": 22932,
    "hadith_number": 2428,
    "tajuk_hadith": "Anjuran Berpuasa Secara Sederhana dan Keutamaan Puasa Nabi Daud",
    "perawi_melayu": "Diriwayatkan oleh 'Abd Allah b. 'Amr b. al-'As:",
    "english_text": "The Messenger of Allah (ﷺ) met me and said: Have I not been informed that you told: I shall stand at prayer all the night, and I shall fast during the day ? He said: I think so. Yes, Messenger of Allah, I have said this. He said: Get up and pray at night and sleep ; fast and break your fast ; fast three days every month: that is equivalent to keeping perpetual fast. I said: Messenger of Allah, I have more power than that. He said: Then fast one day and break your fast one day. That is the most moderate fast ; that is the fast of Dawud (David). He said: I have more power than that. The Messenger of Allah (ﷺ) said: There is no fast more excellent that it.",
    "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، قَالَ لَقِيَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَلَمْ أُحَدَّثْ أَنَّكَ تَقُولُ لأَقُومَنَّ اللَّيْلَ وَلأَصُومَنَّ النَّهَارَ ‏\"‏ ‏.‏ قَالَ - أَحْسِبُهُ قَالَ - نَعَمْ يَا رَسُولَ اللَّهِ قَدْ قُلْتُ ذَاكَ ‏.‏ قَالَ ‏\"‏ قُمْ وَنَمْ وَصُمْ وَأَفْطِرْ وَصُمْ مِنْ كُلِّ شَهْرٍ ثَلاَثَةَ أَيَّامٍ وَذَاكَ مِثْلُ صِيَامِ الدَّهْرِ ‏\"‏ ‏.‏ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أُطِيقُ أَفْضَلَ مِنْ ذَلِكَ ‏.‏ قَالَ ‏\"‏ فَصُمْ يَوْمًا وَأَفْطِرْ يَوْمَيْنِ ‏\"‏ ‏.‏ قَالَ فَقُلْتُ إِنِّي أُطِيقُ أَفْضَلَ مِنْ ذَلِكَ قَالَ ‏\"‏ فَصُمْ يَوْمًا وَأَفْطِرْ يَوْمًا وَهُوَ أَعْدَلُ الصِّيَامِ وَهُوَ صِيَامُ دَاوُدَ ‏\"‏ ‏.‏ قُلْتُ إِنِّي أُطِيقُ أَفْضَلَ مِنْ ذَلِكَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ أَفْضَلَ مِنْ ذَلِكَ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bertemu saya dan bersabda: 'Bukankah telah diberitahu kepadaku bahawa kamu berkata: Aku akan berdiri solat sepanjang malam, dan aku akan berpuasa pada siang hari?' Dia berkata: 'Saya rasa begitu. Ya, Rasulullah, saya telah mengatakan ini.' Baginda bersabda: 'Bangun dan solat pada malam hari dan tidur; berpuasa dan berbuka puasa; berpuasa tiga hari setiap bulan: itu sama dengan berpuasa sepanjang masa.' Saya berkata: 'Rasulullah, saya mempunyai lebih banyak kekuatan daripada itu.' Baginda bersabda: 'Kemudian berpuasalah satu hari dan berbukalah puasa satu hari.' Itulah puasa yang paling sederhana; itulah puasa Daud (David).' Dia berkata: 'Saya mempunyai lebih banyak kekuatan daripada itu.' Rasulullah (ﷺ) bersabda: 'Tidak ada puasa yang lebih utama daripada itu.'"
  },
  {
    "id": 22933,
    "hadith_number": 2429,
    "tajuk_hadith": "Larangan Memberatkan Diri dalam Berpuasa Sunat",
    "perawi_melayu": "Diriwayatkan daripada Abdullah ibn al-Harith atau Bapa Saudara Mujibah al-Bahiliyyah:",
    "english_text": "The father or Uncle of Mujibah al-Bahiliyyah visited the Messenger of Allah (ﷺ). He then went away and came to him (again) after one year when his condition and appearance had changed.  \n\n\n\n\n\nHe said: Messenger of Allah, do you not recognize me?  He asked: Who are you?  He replied: I am al-Bahili who came to you last year.  He said: What has changed you? You were looking well, then you were good in appearance?  He said: I have only food at night since I departed from you.  \n\n\n\n\n\nThereupon the Messenger of Allah (ﷺ) said: Why did you torment yourself? Fast during Ramadan (the month of patience) and fast for one day every month.  He said: Increase it for me, for I have (more) strength.  He said: Fast two days.  He again said: Increase it for me.  He said: Fast three days.  He again said: Increase it for me. He said: Fast during the inviolable months and then stop; fast during the inviolable months and then stop; fast during the inviolable months and then stop. He indicated by his three fingers, and joined them and then opened them.",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ سَعِيدٍ الْجُرَيْرِيِّ، عَنْ أَبِي السَّلِيلِ، عَنْ مُجِيبَةَ الْبَاهِلِيَّةِ، عَنْ أَبِيهَا، أَوْ عَمِّهَا أَنَّهُ أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم ثُمَّ انْطَلَقَ فَأَتَاهُ بَعْدَ سَنَةٍ وَقَدْ تَغَيَّرَتْ حَالَتُهُ وَهَيْئَتُهُ فَقَالَ يَا رَسُولَ اللَّهِ أَمَا تَعْرِفُنِي قَالَ ‏\"‏ وَمَنْ أَنْتَ ‏\"‏ ‏.‏ قَالَ أَنَا الْبَاهِلِيُّ الَّذِي جِئْتُكَ عَامَ الأَوَّلِ ‏.‏ قَالَ ‏\"‏ فَمَا غَيَّرَكَ وَقَدْ كُنْتَ حَسَنَ الْهَيْئَةِ ‏\"‏ ‏.‏ قَالَ مَا أَكَلْتُ طَعَامًا إِلاَّ بِلَيْلٍ مُنْذُ فَارَقْتُكَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لِمَ عَذَّبْتَ نَفْسَكَ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ صُمْ شَهْرَ الصَّبْرِ وَيَوْمًا مِنْ كُلِّ شَهْرٍ ‏\"‏ ‏.‏ قَالَ زِدْنِي فَإِنَّ بِي قُوَّةً ‏.‏ قَالَ ‏\"‏ صُمْ يَوْمَيْنِ ‏\"‏ ‏.‏ قَالَ زِدْنِي ‏.‏ قَالَ ‏\"‏ صُمْ ثَلاَثَةَ أَيَّامٍ ‏\"‏ ‏.‏ قَالَ زِدْنِي ‏.‏ قَالَ ‏\"‏ صُمْ مِنَ الْحُرُمِ وَاتْرُكْ صُمْ مِنَ الْحُرُمِ وَاتْرُكْ صُمْ مِنَ الْحُرُمِ وَاتْرُكْ ‏\"‏ ‏.‏ وَقَالَ بِأَصَابِعِهِ الثَّلاَثَةِ فَضَمَّهَا ثُمَّ أَرْسَلَهَا ‏.‏",
    "malay_translation": "Bapa atau bapa saudara Mujibah al-Bahiliyyah telah melawat Rasulullah (ﷺ). Kemudian dia pergi dan datang kepada baginda (lagi) selepas setahun apabila keadaan dan penampilannya telah berubah.\n\nDia berkata: Wahai Rasulullah, tidakkah anda mengenali saya? Baginda bertanya: Siapa kamu? Dia menjawab: Saya al-Bahili yang datang kepada anda tahun lepas. Baginda bersabda: Apa yang telah mengubah kamu? Kamu kelihatan baik, kemudian kamu bagus dalam penampilan? Dia berkata: Saya hanya makan makanan pada waktu malam sejak saya berpisah dari anda.\n\nMaka Rasulullah (ﷺ) bersabda: Mengapa kamu menyeksa diri kamu sendiri? Berpuasalah pada bulan Ramadan (bulan kesabaran) dan berpuasalah satu hari setiap bulan. Dia berkata: Tambahkan untuk saya, kerana saya mempunyai (lebih) kekuatan. Baginda bersabda: Berpuasalah dua hari. Dia berkata lagi: Tambahkan untuk saya. Baginda bersabda: Berpuasalah tiga hari. Dia berkata lagi: Tambahkan untuk saya. Baginda bersabda: Berpuasalah pada bulan-bulan haram dan kemudian berhenti; berpuasalah pada bulan-bulan haram dan kemudian berhenti; berpuasalah pada bulan-bulan haram dan kemudian berhenti. Baginda memberi isyarat dengan tiga jarinya, dan menggabungkannya dan kemudian membukanya."
  },
  {
    "id": 22934,
    "hadith_number": 2430,
    "tajuk_hadith": "Keutamaan Puasa Muharram dan Solat Malam",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "The Messenger of Allah (ﷺ) as saying: The most excellent fast after Ramadan is Allah's month al-Muharram, and the most excellent prayer after the prescribed prayer is the prayer during night.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَفْضَلُ الصِّيَامِ بَعْدَ شَهْرِ رَمَضَانَ شَهْرُ اللَّهِ الْمُحَرَّمُ وَإِنَّ أَفْضَلَ الصَّلاَةِ بَعْدَ الْمَفْرُوضَةِ صَلاَةٌ مِنَ اللَّيْلِ ‏\"‏ ‏.‏ لَمْ يَقُلْ قُتَيْبَةُ ‏\"‏ شَهْرِ ‏\"‏ ‏.‏ قَالَ ‏\"‏ رَمَضَانَ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda: Puasa yang paling utama setelah Ramadan adalah bulan Allah, Muharram, dan solat yang paling utama setelah solat fardhu adalah solat malam."
  },
  {
    "id": 22935,
    "hadith_number": 2431,
    "tajuk_hadith": "Rasulullah (ﷺ) Berpuasa dan Tidak Berpuasa",
    "perawi_melayu": "Diriwayatkan oleh 'Uthman b. Hakim:",
    "english_text": "I asked Sa'id b. Jubair about fasting during Rajab. He said: Ibn 'Abbas told me that the Messenger of Allah (ﷺ) used to fast to such an extent that we thought that he would never break his fast; and he would go without fasting to such an extent that we thought he would never fast.",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، حَدَّثَنَا عِيسَى، حَدَّثَنَا عُثْمَانُ، - يَعْنِي ابْنَ حَكِيمٍ - قَالَ سَأَلْتُ سَعِيدَ بْنَ جُبَيْرٍ عَنْ صِيَامِ رَجَبَ، فَقَالَ أَخْبَرَنِي ابْنُ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَصُومُ حَتَّى نَقُولَ لاَ يُفْطِرُ وَيُفْطِرُ حَتَّى نَقُولَ لاَ يَصُومُ ‏.‏",
    "malay_translation": "Saya bertanya kepada Sa'id b. Jubair mengenai puasa pada bulan Rejab. Beliau berkata: Ibn 'Abbas telah memberitahu saya bahawa Rasulullah (ﷺ) biasa berpuasa sehingga kami menyangka bahawa baginda tidak akan berbuka; dan baginda juga biasa tidak berpuasa sehingga kami menyangka baginda tidak akan berpuasa."
  },
  {
    "id": 22936,
    "hadith_number": 2432,
    "tajuk_hadith": "Bulan Sya'ban Bulan Puasa Kegemaran Rasulullah ﷺ",
    "perawi_melayu": "Diriwayatkan oleh Aisyah, Ummul Mu'minin:",
    "english_text": "The month most liked by the Messenger of Allah (ﷺ) for fasting was Sha'ban. He then joined it with Ramadan.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَيْسٍ، سَمِعَ عَائِشَةَ، تَقُولُ كَانَ أَحَبَّ الشُّهُورِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَنْ يَصُومَهُ شَعْبَانُ ثُمَّ يَصِلُهُ بِرَمَضَانَ ‏.‏",
    "malay_translation": "Bulan yang paling disukai oleh Rasulullah (ﷺ) untuk berpuasa adalah Sya'ban. Kemudian baginda menyambungnya dengan Ramadan."
  },
  {
    "id": 22937,
    "hadith_number": 2433,
    "tajuk_hadith": "Puasa Berterusan dan Kewajipan Terhadap Keluarga",
    "perawi_melayu": "Diriwayatkan oleh Muslim al-Qurashi:",
    "english_text": "I asked or someone asked the Prophet (ﷺ) about perpetual fasting. He replied: You have a duty to your family. Fast during Ramadan and the following month, and every Wednesday and Thursday. You will then have observed a perpetual fast.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ الْعِجْلِيُّ، حَدَّثَنَا عُبَيْدُ اللَّهِ، - يَعْنِي ابْنَ مُوسَى - عَنْ هَارُونَ بْنِ سَلْمَانَ، عَنْ عُبَيْدِ اللَّهِ بْنِ مُسْلِمٍ الْقُرَشِيِّ، عَنْ أَبِيهِ، قَالَ سَأَلْتُ - أَوْ سُئِلَ النَّبِيُّ صلى الله عليه وسلم - عَنْ صِيَامِ الدَّهْرِ فَقَالَ ‏\n\"‏ إِنَّ لأَهْلِكَ عَلَيْكَ حَقًّا صُمْ رَمَضَانَ وَالَّذِي يَلِيهِ وَكُلَّ أَرْبِعَاءَ وَخَمِيسٍ فَإِذَا أَنْتَ قَدْ صُمْتَ الدَّهْرَ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ وَافَقَهُ زَيْدٌ الْعُكْلِيُّ وَخَالَفَهُ أَبُو نُعَيْمٍ قَالَ مُسْلِمُ بْنُ عُبَيْدِ اللَّهِ ‏.‏",
    "malay_translation": "Saya bertanya atau seseorang bertanya kepada Nabi ﷺ tentang puasa berterusan. Baginda menjawab: “Sesungguhnya kamu mempunyai kewajipan terhadap keluargamu. Berpuasalah pada bulan Ramadan dan bulan yang menyusulnya, serta setiap hari Rabu dan Khamis. Dengan itu, kamu telah berpuasa berterusan.”"
  },
  {
    "id": 22938,
    "hadith_number": 2434,
    "tajuk_hadith": "Keutamaan Puasa Enam Hari di Bulan Syawal",
    "perawi_melayu": "Diriwayatkan oleh Abu Ayyub:",
    "english_text": "The Prophet (ﷺ) as saying: If anyone fasts during Ramadan, then follows it with six days in Shawwal, it will be like a perpetual fast.",
    "arabic_text": "حَدَّثَنَا النُّفَيْلِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، وَسَعْدِ بْنِ سَعِيدٍ، عَنْ عُمَرَ بْنِ ثَابِتٍ الأَنْصَارِيِّ، عَنْ أَبِي أَيُّوبَ، صَاحِبِ النَّبِيِّ صلى الله عليه وسلم عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ صَامَ رَمَضَانَ ثُمَّ أَتْبَعَهُ بِسِتٍّ مِنْ شَوَّالٍ فَكَأَنَّمَا صَامَ الدَّهْرَ ‏\"‏ ‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda: Sesiapa yang berpuasa di bulan Ramadan, kemudian diikuti dengan enam hari di bulan Syawal, ia seperti berpuasa sepanjang tahun."
  },
  {
    "id": 22939,
    "hadith_number": 2435,
    "tajuk_hadith": "Kebiasaan Puasa Rasulullah SAW: Puasa Sunnah dan Puasa di Bulan Sya'ban",
    "perawi_melayu": "Diriwayatkan oleh Aisyah, isteri Nabi (ﷺ):",
    "english_text": "The Messenger of Allah (ﷺ) used to fast to such an extent that we thought that he would never break his fast, and he would go without fasting to such an extent that we thought he would never fast. I never saw the Messenger of Allah (ﷺ) fast a complete month except in Ramadan, and I never saw his fast more in any month than in Sha'ban.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ حَتَّى نَقُولَ لاَ يُفْطِرُ وَيُفْطِرُ حَتَّى نَقُولَ لاَ يَصُومُ وَمَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَكْمَلَ صِيَامَ شَهْرٍ قَطُّ إِلاَّ رَمَضَانَ وَمَا رَأَيْتُهُ فِي شَهْرٍ أَكْثَرَ صِيَامًا مِنْهُ فِي شَعْبَانَ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) pernah berpuasa sehingga kami menyangka baginda tidak akan berbuka, dan baginda pernah tidak berpuasa sehingga kami menyangka baginda tidak akan berpuasa. Saya tidak pernah melihat Rasulullah (ﷺ) berpuasa sebulan penuh kecuali pada bulan Ramadan, dan saya tidak pernah melihat baginda lebih banyak berpuasa dalam bulan Sya'ban berbanding bulan-bulan lain."
  },
  {
    "id": 22940,
    "hadith_number": 2436,
    "tajuk_hadith": "Puasa Nabi SAW di Bulan Sya'ban",
    "perawi_melayu": "Tradisi yang disebutkan di atas juga diriwayatkan oleh Abu Hurairah melalui rangkaian perawi yang berbeza dengan maksud yang sama. Versi ini menambah:",
    "english_text": "He would fast all but a little of Sha'ban, rather he used to fast the whole of Sha'ban.",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَاهُ ‏.‏ زَادَ كَانَ يَصُومُهُ إِلاَّ قَلِيلاً بَلْ كَانَ يَصُومُهُ كُلَّهُ ‏.‏",
    "malay_translation": "Baginda berpuasa hampir sepanjang bulan Sya'ban, malah Baginda berpuasa sepanjang bulan Sya'ban."
  },
  {
    "id": 22941,
    "hadith_number": 2437,
    "tajuk_hadith": "Keutamaan Puasa Hari Isnin dan Khamis kerana Amalan Dibentangkan pada Hari Tersebut",
    "perawi_melayu": "Diriwayatkan oleh Usamah ibn Zayd:",
    "english_text": "The client of Usamah ibn Zayd said that he went along with Usamah to Wadi al-Qura in pursuit of his camels. He would fast on Monday and Thursday. His client said to him: Why do you fast on Monday and Thursday, while you are an old man? He said: The Prophet of Allah (ﷺ) used to fast on Monday and Thursday. When he was asked about it, he said: The works of the servants (of Allah) are presented (to Allah) on Monday and Thursday.",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبَانُ، حَدَّثَنَا يَحْيَى، عَنْ عُمَرَ بْنِ أَبِي الْحَكَمِ بْنِ ثَوْبَانَ، عَنْ مَوْلَى، قُدَامَةَ بْنِ مَظْعُونٍ عَنْ مَوْلَى، أُسَامَةَ بْنِ زَيْدٍ أَنَّهُ انْطَلَقَ مَعَ أُسَامَةَ إِلَى وَادِي الْقُرَى فِي طَلَبِ مَالٍ لَهُ فَكَانَ يَصُومُ يَوْمَ الاِثْنَيْنِ وَيَوْمَ الْخَمِيسِ فَقَالَ لَهُ مَوْلاَهُ لِمَ تَصُومُ يَوْمَ الاِثْنَيْنِ وَيَوْمَ الْخَمِيسِ وَأَنْتَ شَيْخٌ كَبِيرٌ فَقَالَ إِنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم كَانَ يَصُومُ يَوْمَ الاِثْنَيْنِ وَيَوْمَ الْخَمِيسِ وَسُئِلَ عَنْ ذَلِكَ فَقَالَ ‏\n\"‏ إِنَّ أَعْمَالَ الْعِبَادِ تُعْرَضُ يَوْمَ الاِثْنَيْنِ وَيَوْمَ الْخَمِيسِ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ كَذَا قَالَ هِشَامٌ الدَّسْتَوَائِيُّ عَنْ يَحْيَى عَنْ عُمَرَ بْنِ أَبِي الْحَكَمِ ‏.‏",
    "malay_translation": "Anak guam Usamah ibn Zayd berkata bahawa dia pergi bersama Usamah ke Wadi al-Qura untuk mencari untanya. Dia berpuasa pada hari Isnin dan Khamis. Anak guamnya berkata kepadanya: \"Mengapa kamu berpuasa pada hari Isnin dan Khamis, sedangkan kamu seorang lelaki tua?\" Dia berkata: \"Nabi Allah (ﷺ) biasa berpuasa pada hari Isnin dan Khamis.\" Apabila dia ditanya tentang hal itu, dia berkata: \"Amalan hamba-hamba (Allah) dipersembahkan (kepada Allah) pada hari Isnin dan Khamis.\""
  },
  {
    "id": 22942,
    "hadith_number": 2438,
    "tajuk_hadith": "Amalan Puasa Sunnah Rasulullah ﷺ: Sembilan Hari Pertama Zulhijjah, Asyura' dan Puasa Tiga Hari Setiap Bulan",
    "perawi_melayu": "Diriwayatkan oleh Salah seorang isteri Nabi:",
    "english_text": "Hunaydah ibn Khalid narrated from his wife on the authority of one of the wives of the Prophet (ﷺ) who said: The Messenger of Allah (ﷺ) used to fast the first nine days of Dhul-Hijjah, Ashura' and three days of every month, that is, the first Monday (of the month) and Thursday.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الْحُرِّ بْنِ الصَّبَّاحِ، عَنْ هُنَيْدَةَ بْنِ خَالِدٍ، عَنِ امْرَأَتِهِ، عَنْ بَعْضِ، أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ تِسْعَ ذِي الْحِجَّةِ وَيَوْمَ عَاشُورَاءَ وَثَلاَثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ أَوَّلَ اثْنَيْنِ مِنَ الشَّهْرِ وَالْخَمِيسَ ‏.‏",
    "malay_translation": "Hunaydah ibn Khalid meriwayatkan daripada isterinya, daripada salah seorang isteri Nabi ﷺ yang berkata: Rasulullah ﷺ biasa berpuasa pada sembilan hari pertama Zulhijjah, hari Asyura' dan tiga hari setiap bulan, iaitu hari Isnin pertama (dalam bulan itu) dan hari Khamis."
  },
  {
    "id": 22943,
    "hadith_number": 2439,
    "tajuk_hadith": "Keutamaan Amalan Soleh pada Sepuluh Hari Pertama Zulhijjah",
    "perawi_melayu": "Daripada Ibn 'Abbas r.a.:",
    "english_text": "The Messenger of Allah (ﷺ) as saying: There is no virtue more to the liking of Allah in any day than in these days, that is, the first ten days of Dhu al-Hijjah. They (the Companions) asked: Messenger of Allah, not even the struggle in the path of Allah (Jihad) ? He said: (Yes), not even the struggle in the path of Allah, except a man who goes out (in the path of Allah) with his life and property, and does not return with any of them.",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي صَالِحٍ، وَمُجَاهِدٍ، وَمُسْلِمٍ الْبَطِينِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا مِنْ أَيَّامٍ الْعَمَلُ الصَّالِحُ فِيهَا أَحَبُّ إِلَى اللَّهِ مِنْ هَذِهِ الأَيَّامِ ‏\"‏ ‏.‏ يَعْنِي أَيَّامَ الْعَشْرِ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَلاَ الْجِهَادُ فِي سَبِيلِ اللَّهِ قَالَ ‏\"‏ وَلاَ الْجِهَادُ فِي سَبِيلِ اللَّهِ إِلاَّ رَجُلٌ خَرَجَ بِنَفْسِهِ وَمَالِهِ فَلَمْ يَرْجِعْ مِنْ ذَلِكَ بِشَىْءٍ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda: Tidak ada keutamaan yang lebih disukai oleh Allah pada mana-mana hari selain hari-hari ini, iaitu sepuluh hari pertama Zulhijjah. Mereka (para Sahabat) bertanya: Wahai Rasulullah, tidak juga jihad di jalan Allah? Baginda bersabda: (Ya), tidak juga jihad di jalan Allah, kecuali seorang lelaki yang keluar (di jalan Allah) dengan jiwa dan hartanya, dan tidak kembali dengan apa-apa pun daripadanya."
  },
  {
    "id": 22944,
    "hadith_number": 2440,
    "tajuk_hadith": "Rasulullah ﷺ Tidak Berpuasa pada Sepuluh Hari Pertama Zulhijjah",
    "perawi_melayu": "Aisyah berkata:",
    "english_text": "I never saw the Messenger of Allah (ﷺ) fasting during the first ten days of Dhu al-Hijjah.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم صَائِمًا الْعَشْرَ قَطُّ ‏.‏",
    "malay_translation": "Saya tidak pernah melihat Rasulullah ﷺ berpuasa pada sepuluh hari pertama bulan Zulhijjah."
  },
  {
    "id": 22945,
    "hadith_number": 2441,
    "tajuk_hadith": "Larangan Berpuasa pada Hari Arafah di Arafah",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "Ikrimah said: We were with AbuHurayrah in his house when he narrated to us: The Messenger of Allah (ﷺ) prohibited fasting on the day of Arafah at Arafah.",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَوْشَبُ بْنُ عَقِيلٍ، عَنْ مَهْدِيٍّ الْهَجَرِيِّ، حَدَّثَنَا عِكْرِمَةُ، قَالَ كُنَّا عِنْدَ أَبِي هُرَيْرَةَ فِي بَيْتِهِ فَحَدَّثَنَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ صَوْمِ يَوْمِ عَرَفَةَ بِعَرَفَةَ ‏.‏",
    "malay_translation": "Ikrimah berkata: Kami bersama Abu Hurairah di rumahnya ketika beliau meriwayatkan kepada kami: Rasulullah (ﷺ) melarang berpuasa pada hari Arafah di Arafah."
  },
  {
    "id": 22946,
    "hadith_number": 2442,
    "tajuk_hadith": "Rasulullah ﷺ Minum Susu pada Hari Arafah",
    "perawi_melayu": "Umm al-Fadl, puteri al-Harith, berkata:",
    "english_text": "On the day of 'Arafah some people near her argued whether the Messenger of Allah (ﷺ) was fasting, some saying that he was, and others saying that he was not. I, therefore, sent him a cup of milk while he was observing the halt at 'Arafah on his camel, and he drank it.",
    "arabic_text": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، عَنْ عُمَيْرٍ، مَوْلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ أُمِّ الْفَضْلِ بِنْتِ الْحَارِثِ، أَنَّ نَاسًا، تَمَارَوْا عِنْدَهَا يَوْمَ عَرَفَةَ فِي صَوْمِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ بَعْضُهُمْ هُوَ صَائِمٌ ‏.‏ وَقَالَ بَعْضُهُمْ لَيْسَ بِصَائِمٍ ‏.‏ فَأَرْسَلَتْ إِلَيْهِ بِقَدَحِ لَبَنٍ وَهُوَ وَاقِفٌ عَلَى بَعِيرِهِ بِعَرَفَةَ فَشَرِبَ ‏.‏",
    "malay_translation": "Pada hari Arafah, beberapa orang di dekatnya bertengkar sama ada Rasulullah ﷺ berpuasa, ada yang mengatakan bahawa baginda berpuasa, dan yang lain mengatakan bahawa baginda tidak berpuasa. Oleh itu, saya menghantar kepadanya secawan susu ketika baginda sedang berwuquf di Arafah di atas untanya, dan baginda meminumnya."
  },
  {
    "id": 22947,
    "hadith_number": 2443,
    "tajuk_hadith": "Sejarah Puasa Asyura",
    "perawi_melayu": "Kata 'Aishah:",
    "english_text": "The Quraish used to fast on the day of 'Ashurah in pre Islamic days. The Messenger of Allah (ﷺ) would fast on it in pre-Islamic period. When the Messenger of Allah (ﷺ) came to Medina, he fasted on it and commanded to fast on it. When the fast of Ramadan was prescribed, that became obligatory, and (fasting on) 'Ashurah was abandoned. He who wishes may fast on it and he who wishes may leave it.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ كَانَ يَوْمُ عَاشُورَاءَ يَوْمًا تَصُومُهُ قُرَيْشٌ فِي الْجَاهِلِيَّةِ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُهُ فِي الْجَاهِلِيَّةِ فَلَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ صَامَهُ وَأَمَرَ بِصِيَامِهِ فَلَمَّا فُرِضَ رَمَضَانُ كَانَ هُوَ الْفَرِيضَةَ وَتُرِكَ عَاشُورَاءُ فَمَنْ شَاءَ صَامَهُ وَمَنْ شَاءَ تَرَكَهُ ‏.‏",
    "malay_translation": "Kaum Quraisy dahulu berpuasa pada hari 'Asyura pada zaman pra-Islam. Rasulullah (ﷺ) juga berpuasa pada hari tersebut pada zaman pra-Islam. Ketika Rasulullah (ﷺ) tiba di Madinah, baginda berpuasa pada hari itu dan memerintahkan untuk berpuasa padanya. Apabila puasa Ramadan difardukan, puasa Ramadan menjadi wajib, dan (puasa) 'Asyura ditinggalkan. Sesiapa yang mahu boleh berpuasa pada hari itu dan sesiapa yang mahu boleh meninggalkannya."
  },
  {
    "id": 22948,
    "hadith_number": 2444,
    "tajuk_hadith": "Puasa Asyura Sebelum Ramadan dan Pilihan Selepasnya",
    "perawi_melayu": "Ibn 'Umar berkata:",
    "english_text": "'Ashurah was a day on which we used to fast in pre-Islamic days. When (fasting of) Ramadan was prescribed, the Messenger of Allah (ﷺ) said: This is one of the days of Allah ; he who wishes may fast on it.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ عَاشُورَاءُ يَوْمًا نَصُومُهُ فِي الْجَاهِلِيَّةِ فَلَمَّا نَزَلَ رَمَضَانُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ هَذَا يَوْمٌ مِنْ أَيَّامِ اللَّهِ فَمَنْ شَاءَ صَامَهُ وَمَنْ شَاءَ تَرَكَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Asyura adalah hari di mana kami biasa berpuasa pada zaman pra-Islam. Ketika (puasa) Ramadan diwajibkan, Rasulullah (ﷺ) bersabda: Ini adalah salah satu hari Allah; barangsiapa yang ingin boleh berpuasa padanya."
  },
  {
    "id": 22949,
    "hadith_number": 2445,
    "tajuk_hadith": "Puasa Asyura dan Nabi Musa",
    "perawi_melayu": "Ibnu Abbas berkata:",
    "english_text": "When the Prophet (ﷺ) came to Medina, he found the Jews observing fast on the day of 'Ashurah; so they were asked about it (by the Prophet). They said: This is a day on which Allah gave Moses domination over Pharaoh. We fast on it out of reverence to him. The Messenger of Allah (ﷺ) said: We have a closer connection with Moses than you have. He then gave orders that it should be observed.",
    "arabic_text": "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ، حَدَّثَنَا هُشَيْمٌ، حَدَّثَنَا أَبُو بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمَّا قَدِمَ النَّبِيُّ صلى الله عليه وسلم الْمَدِينَةَ وَجَدَ الْيَهُودَ يَصُومُونَ عَاشُورَاءَ فَسُئِلُوا عَنْ ذَلِكَ فَقَالُوا هَذَا الْيَوْمُ الَّذِي أَظْهَرَ اللَّهُ فِيهِ مُوسَى عَلَى فِرْعَوْنَ وَنَحْنُ نَصُومُهُ تَعْظِيمًا لَهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ نَحْنُ أَوْلَى بِمُوسَى مِنْكُمْ ‏\"‏ ‏.‏ وَأَمَرَ بِصِيَامِهِ ‏.‏",
    "malay_translation": "Ketika Nabi (ﷺ) tiba di Madinah, baginda mendapati orang Yahudi berpuasa pada hari Asyura; lalu mereka ditanya tentang hal itu (oleh Nabi). Mereka berkata: Ini adalah hari di mana Allah memberikan kemenangan kepada Musa atas Firaun. Kami berpuasa pada hari ini sebagai penghormatan kepadanya. Rasulullah (ﷺ) bersabda: Kami lebih berhak dengan Musa daripada kamu. Kemudian baginda memerintahkan agar hari itu dipuasakan."
  },
  {
    "id": 22950,
    "hadith_number": 2446,
    "tajuk_hadith": "Puasa Hari 'Asyura dan Niat Puasa Hari ke-9 Muharram",
    "perawi_melayu": "Ibn 'Abbas berkata:",
    "english_text": "When the Prophet (ﷺ) on the day of 'Ashurah and commanded us to fast on it, they  (i.e. Companions) said: Messenger of Allah, this is a day which is considered great by Jews and Christians ? The Messenger of Allah (ﷺ) said: When the next year comes, we shall fast on the 9th of Muharram. But the next year the Messenger of Allah (ﷺ) breathed his last.",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يَحْيَى بْنُ أَيُّوبَ، أَنَّ إِسْمَاعِيلَ بْنَ أُمَيَّةَ الْقُرَشِيَّ، حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا غَطَفَانَ، يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، يَقُولُ حِينَ صَامَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ عَاشُورَاءَ وَأَمَرَنَا بِصِيَامِهِ قَالُوا يَا رَسُولَ اللَّهِ إِنَّهُ يَوْمٌ تُعَظِّمُهُ الْيَهُودُ وَالنَّصَارَى ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ فَإِذَا كَانَ الْعَامُ الْمُقْبِلُ صُمْنَا يَوْمَ التَّاسِعِ ‏\"‏ ‏.‏ فَلَمْ يَأْتِ الْعَامُ الْمُقْبِلُ حَتَّى تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
    "malay_translation": "Ketika Nabi (ﷺ) pada hari 'Asyura dan memerintahkan kami untuk berpuasa padanya, mereka (para Sahabat) berkata: Wahai Rasulullah, ini adalah hari yang dianggap agung oleh Yahudi dan Nasrani? Rasulullah (ﷺ) bersabda: Apabila tahun depan tiba, kita akan berpuasa pada hari ke-9 Muharram. Tetapi tahun berikutnya Rasulullah (ﷺ) telah wafat."
  },
  {
    "id": 22951,
    "hadith_number": 2447,
    "tajuk_hadith": "Puasa Hari Asyura dan Amalan Nabi Muhammad ﷺ",
    "perawi_melayu": "Al-Hakam bin al-A'raj telah berkata:",
    "english_text": "I came to Ibn 'Abbas who was leaning against his sheet of cloth in the Sacred Mosque (al-Masjid al-Haram). I asked him about fasting on the day of 'Ashurah. He said: When you sight the moon of al-Muharram, count (the days). When the 9th of Muharram comes, fast from the morning. I said: Would Muhammad (ﷺ) observe this fast ? He replied: Thus Muhammad (ﷺ) used to fast.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، - يَعْنِي ابْنَ سَعِيدٍ - عَنْ مُعَاوِيَةَ بْنِ غَلاَبٍ، ح وَحَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا إِسْمَاعِيلُ، أَخْبَرَنِي حَاجِبُ بْنُ عُمَرَ، - جَمِيعًا الْمَعْنَى - عَنِ الْحَكَمِ بْنِ الأَعْرَجِ، قَالَ أَتَيْتُ ابْنَ عَبَّاسٍ وَهُوَ مُتَوَسِّدٌ رِدَاءَهُ فِي الْمَسْجِدِ الْحَرَامِ فَسَأَلْتُهُ عَنْ صَوْمِ يَوْمِ عَاشُورَاءَ فَقَالَ إِذَا رَأَيْتَ هِلاَلَ الْمُحَرَّمِ فَاعْدُدْ فَإِذَا كَانَ يَوْمُ التَّاسِعِ فَأَصْبِحْ صَائِمًا ‏.‏ فَقُلْتُ كَذَا كَانَ مُحَمَّدٌ صلى الله عليه وسلم يَصُومُ فَقَالَ كَذَلِكَ كَانَ مُحَمَّدٌ صلى الله عليه وسلم يَصُومُ ‏.‏",
    "malay_translation": "Saya telah datang kepada Ibn 'Abbas yang sedang bersandar pada kainnya di Masjid al-Haram. Saya bertanya kepadanya mengenai puasa pada hari Asyura. Beliau berkata: Apabila kamu melihat anak bulan Muharram, maka hitunglah (hari-hari). Apabila tiba hari ke-9 Muharram, maka berpuasalah dari waktu pagi. Saya bertanya: Adakah Rasulullah Muhammad ﷺ melakukan puasa ini? Beliau menjawab: Ya, Rasulullah Muhammad ﷺ berpuasa (seperti itu)."
  },
  {
    "id": 22952,
    "hadith_number": 2448,
    "tajuk_hadith": "Menyempurnakan Hari dan Qada' Puasa",
    "perawi_melayu": "Diriwayatkan oleh AbdurRahman ibn Maslamah:",
    "english_text": "AbdurRahman reported on the authority of his uncle that the people of the tribe Aslam came to the Prophet (ﷺ). He said (to them): Did you fast on this day? They replied: No. He said: Complete the rest of your day, and make atonement for it.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمِنْهَالِ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَسْلَمَةَ، عَنْ عَمِّهِ، أَنَّ أَسْلَمَ، أَتَتِ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ صُمْتُمْ يَوْمَكُمْ هَذَا ‏\"‏ ‏.‏ قَالُوا لاَ ‏.‏ قَالَ ‏\"‏ فَأَتِمُّوا بَقِيَّةَ يَوْمِكُمْ وَاقْضُوهُ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ يَعْنِي يَوْمَ عَاشُورَاءَ ‏.‏",
    "malay_translation": "AbdurRahman meriwayatkan daripada bapa saudaranya bahawa orang-orang dari suku Aslam datang kepada Nabi (ﷺ). Baginda bersabda kepada mereka: Adakah kamu berpuasa pada hari ini? Mereka menjawab: Tidak. Baginda bersabda: Sempurnakanlah sisa hari kamu, dan qada'lah puasa itu."
  },
  {
    "id": 22953,
    "hadith_number": 2449,
    "tajuk_hadith": "Puasa dan Solat Nabi Dawud AS yang Paling Disukai Allah",
    "perawi_melayu": "'Abd Allah b. 'Amr (b. al-'As) berkata:",
    "english_text": "The Messenger of Allah (ﷺ) said to me: The fast most liked by Allah is the one observed by Dawud (David), and the prayer dearer to Allah is the one offered by Dawud (David): he would sleep half the night, and stand (in prayer) one-third of it, and sleep one-sixth of it. He would go without fasting one day, and fast the other day.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، وَمُحَمَّدُ بْنُ عِيسَى، وَمُسَدَّدٌ، - وَالإِخْبَارُ فِي حَدِيثِ أَحْمَدَ - قَالُوا حَدَّثَنَا سُفْيَانُ قَالَ سَمِعْتُ عَمْرًا قَالَ أَخْبَرَنِي عَمْرُو بْنُ أَوْسٍ سَمِعَهُ مِنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَحَبُّ الصِّيَامِ إِلَى اللَّهِ تَعَالَى صِيَامُ دَاوُدَ وَأَحَبُّ الصَّلاَةِ إِلَى اللَّهِ صَلاَةُ دَاوُدَ كَانَ يَنَامُ نِصْفَهُ وَيَقُومُ ثُلُثَهُ وَيَنَامُ سُدُسَهُ وَكَانَ يُفْطِرُ يَوْمًا وَيَصُومُ يَوْمًا ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda kepadaku: Puasa yang paling disukai oleh Allah adalah puasa yang dilakukan oleh Dawud (David), dan solat yang paling disayangi oleh Allah adalah solat yang dilakukan oleh Dawud (David): beliau tidur separuh malam, dan berdiri (untuk solat) satu pertiga malam, dan tidur satu perenam malam. Beliau berpuasa selang sehari."
  },
  {
    "id": 22954,
    "hadith_number": 2450,
    "tajuk_hadith": "Galakan Berpuasa Hari Putih (Ayyamul Bidh)",
    "perawi_melayu": "Diriwayatkan oleh Qatadah Ibn Malhan al-Qaysi:",
    "english_text": "The Messenger of Allah (ﷺ) used to command us to fast the days of the white (nights): thirteenth, fourteenth and fifteenth of the month. He said: This is like keeping perpetual fast.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، حَدَّثَنَا هَمَّامٌ، عَنْ أَنَسٍ، أَخِي مُحَمَّدٍ عَنِ ابْنِ مِلْحَانَ الْقَيْسِيِّ، عَنْ أَبِيهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَأْمُرُنَا أَنْ نَصُومَ الْبِيضَ ثَلاَثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ ‏.‏ قَالَ وَقَالَ ‏\n\"‏ هُنَّ كَهَيْئَةِ الدَّهْرِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) biasa memerintahkan kami untuk berpuasa pada hari-hari putih (Ayyamul Bidh): tiga belas, empat belas dan lima belas setiap bulan. Baginda bersabda: \"Ini seperti berpuasa sepanjang masa.\""
  },
  {
    "id": 22955,
    "hadith_number": 2451,
    "tajuk_hadith": "Amalan Puasa Tiga Hari Setiap Bulan oleh Rasulullah (ﷺ)",
    "perawi_melayu": "Diriwayatkan oleh Abdullah ibn Mas'ud:",
    "english_text": "The Messenger of Allah (ﷺ) used to fast three days every month.",
    "arabic_text": "حَدَّثَنَا أَبُو كَامِلٍ، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا شَيْبَانُ، عَنْ عَاصِمٍ، عَنْ زِرٍّ، عَنْ عَبْدِ اللَّهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ - يَعْنِي مِنْ غُرَّةِ كُلِّ شَهْرٍ - ثَلاَثَةَ أَيَّامٍ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) biasa berpuasa tiga hari setiap bulan."
  },
  {
    "id": 22956,
    "hadith_number": 2452,
    "tajuk_hadith": "Amalan Puasa Tiga Hari Sebulan Rasulullah (ﷺ)",
    "perawi_melayu": "Diriwayatkan oleh Hafsah, Ummul Mu'minin:",
    "english_text": "The apostle of Allah (ﷺ) used to fast three days every month: Monday, Thursday and Monday in the next week.",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ عَاصِمِ بْنِ بَهْدَلَةَ، عَنْ سَوَاءٍ الْخُزَاعِيِّ، عَنْ حَفْصَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ ثَلاَثَةَ أَيَّامٍ مِنَ الشَّهْرِ الاِثْنَيْنِ وَالْخَمِيسِ وَالاِثْنَيْنِ مِنَ الْجُمُعَةِ الأُخْرَى ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) biasa berpuasa tiga hari setiap bulan: hari Isnin, hari Khamis, dan hari Isnin pada minggu berikutnya."
  },
  {
    "id": 22957,
    "hadith_number": 2453,
    "tajuk_hadith": "Anjuran Berpuasa Tiga Hari Sebulan Dimulai Hari Isnin atau Khamis",
    "perawi_melayu": "Diriwayatkan oleh Umm Salamah, Ummul Mu'minin:",
    "english_text": "Hunaydah al-Khuza'i reported on the authority of her mother who said: I entered upon Umm Salamah and asked her about fasting. She said: The Messenger of Allah (ﷺ) used to command me to fast three days every month beginning with Monday or Thursday.",
    "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، حَدَّثَنَا الْحَسَنُ بْنُ عُبَيْدِ اللَّهِ، عَنْ هُنَيْدَةَ الْخُزَاعِيِّ، عَنْ أُمِّهِ، قَالَتْ دَخَلْتُ عَلَى أُمِّ سَلَمَةَ فَسَأَلْتُهَا عَنِ الصِّيَامِ فَقَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَأْمُرُنِي أَنْ أَصُومَ ثَلاَثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ أَوَّلُهَا الاِثْنَيْنِ وَالْخَمِيسِ ‏.‏",
    "malay_translation": "Hunaydah al-Khuza'i meriwayatkan daripada ibunya yang berkata: Saya masuk menemui Umm Salamah dan bertanya kepadanya tentang puasa. Beliau berkata: Rasulullah (ﷺ) biasa memerintahkan saya untuk berpuasa tiga hari setiap bulan, bermula dengan hari Isnin atau Khamis."
  },
  {
    "id": 22958,
    "hadith_number": 2454,
    "tajuk_hadith": "Rasulullah SAW Berpuasa Tiga Hari Sebulan Tanpa Menentukan Hari Tertentu",
    "perawi_melayu": "Mu'adhah (al-'Adawiyyah) berkata:",
    "english_text": "I asked 'Aishah: Would the Messenger of Allah (ﷺ) fast three days every month ? She replied: Yes. I asked: Which days in the month he used to fast ? She replied: He did not care which days of the month he fasted.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ يَزِيدَ الرِّشْكِ، عَنْ مُعَاذَةَ، قَالَتْ قُلْتُ لِعَائِشَةَ أَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ مِنْ كُلِّ شَهْرٍ ثَلاَثَةَ أَيَّامٍ قَالَتْ نَعَمْ ‏.‏ قُلْتُ مِنْ أَىِّ شَهْرٍ كَانَ يَصُومُ قَالَتْ مَا كَانَ يُبَالِي مِنْ أَىِّ أَيَّامِ الشَّهْرِ كَانَ يَصُومُ ‏.‏",
    "malay_translation": "Saya bertanya kepada 'Aishah: Adakah Rasulullah (ﷺ) berpuasa tiga hari setiap bulan? Beliau menjawab: Ya. Saya bertanya: Hari-hari mana dalam bulan yang baginda biasa berpuasa? Beliau menjawab: Baginda tidak kisah hari mana dalam bulan baginda berpuasa."
  },
  {
    "id": 22959,
    "hadith_number": 2455,
    "tajuk_hadith": "Niat Puasa Sebelum Fajar",
    "perawi_melayu": "Diriwayatkan oleh Hafsah, Ummul Mu'minin:",
    "english_text": "The Messenger of Allah (ﷺ) said: He who does not determine to fast before dawn does not fast.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، حَدَّثَنِي ابْنُ لَهِيعَةَ، وَيَحْيَى بْنُ أَيُّوبَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ حَزْمٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، عَنْ حَفْصَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ لَمْ يُجْمِعِ الصِّيَامَ قَبْلَ الْفَجْرِ فَلاَ صِيَامَ لَهُ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ اللَّيْثُ وَإِسْحَاقُ بْنُ حَازِمٍ أَيْضًا جَمِيعًا عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ مِثْلَهُ وَوَقَفَهُ عَلَى حَفْصَةَ مَعْمَرٌ وَالزُّبَيْدِيُّ وَابْنُ عُيَيْنَةَ وَيُونُسُ الأَيْلِيُّ كُلُّهُمْ عَنِ الزُّهْرِيِّ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda: Sesiapa yang tidak berniat untuk berpuasa sebelum fajar, maka tidak sah puasanya."
  },
  {
    "id": 22960,
    "hadith_number": 2456,
    "tajuk_hadith": "Nabi Bertanya Tentang Makanan dan Membatalkan Puasa Sunat",
    "perawi_melayu": "Aisyah berkata:",
    "english_text": "When the Prophet (ﷺ) entered upon me, he would ask: Do you have food ? When we said: No, he would say: I am fasting. Waki' added in his version: Another day when he entered upon us, we said: Messenger of Allah, some pudding (hair) has been presented to us and we have retained it for you. He said: Bring it to me. Talhah said: He fasted in the morning, but broke his fast (that day).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، حَدَّثَنَا سُفْيَانُ، ح وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، جَمِيعًا عَنْ طَلْحَةَ بْنِ يَحْيَى، عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا دَخَلَ عَلَىَّ قَالَ ‏\"‏ هَلْ عِنْدَكُمْ طَعَامٌ ‏\"‏ ‏.‏ فَإِذَا قُلْنَا لاَ قَالَ ‏\"‏ إِنِّي صَائِمٌ ‏\"‏ ‏.‏ زَادَ وَكِيعٌ فَدَخَلَ عَلَيْنَا يَوْمًا آخَرَ فَقُلْنَا يَا رَسُولَ اللَّهِ أُهْدِيَ لَنَا حَيْسٌ فَحَبَسْنَاهُ لَكَ ‏.‏ فَقَالَ ‏\"‏ أَدْنِيهِ ‏\"‏ ‏.‏ قَالَ طَلْحَةُ فَأَصْبَحَ صَائِمًا وَأَفْطَرَ ‏.‏",
    "malay_translation": "Apabila Nabi (ﷺ) masuk menemuiku, baginda akan bertanya: Adakah kamu mempunyai makanan? Apabila kami berkata: Tidak, baginda akan bersabda: Sesungguhnya aku berpuasa. Waki' menambah dalam riwayatnya: Pada hari lain ketika baginda masuk menemui kami, kami berkata: Wahai Rasulullah, sedikit bubur (hais) telah dihadiahkan kepada kami dan kami telah menyimpannya untukmu. Baginda bersabda: Bawakan ia kepadaku. Talhah berkata: Baginda berpuasa pada pagi hari, tetapi membatalkan puasanya (pada hari itu)."
  },
  {
    "id": 22961,
    "hadith_number": 2457,
    "tajuk_hadith": "Ummu Hani Berbuka Puasa Sunat pada Hari Pembukaan Kota Mekah",
    "perawi_melayu": "Diriwayatkan oleh Ummu Hani:",
    "english_text": "On the days of the  conquest of Mecca, when Mecca was captured, Fatimah came and sat on the left side of the Messenger of Allah (ﷺ), and Umm Hani was on his right side. A slave-girl brought a vessel which contained some drink; she gave it to him and he drank of it. He then gave it to Umm Hani who drank of it. She said: Messenger of Allah, I have broken my fast; I was fasting. He said to her: Were you making atonement for something? She replied: No. He said: Then it does not harm you if it was voluntary (fast).",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، عَنْ أُمِّ هَانِئٍ، قَالَتْ لَمَّا كَانَ يَوْمُ الْفَتْحِ فَتْحِ مَكَّةَ جَاءَتْ فَاطِمَةُ فَجَلَسَتْ عَنْ يَسَارِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأُمُّ هَانِئٍ عَنْ يَمِينِهِ قَالَتْ فَجَاءَتِ الْوَلِيدَةُ بِإِنَاءٍ فِيهِ شَرَابٌ فَنَاوَلَتْهُ فَشَرِبَ مِنْهُ ثُمَّ نَاوَلَهُ أُمَّ هَانِئٍ فَشَرِبَتْ مِنْهُ فَقَالَتْ يَا رَسُولَ اللَّهِ لَقَدْ أَفْطَرْتُ وَكُنْتُ صَائِمَةً ‏.‏ فَقَالَ لَهَا ‏\"‏ أَكُنْتِ تَقْضِينَ شَيْئًا ‏\"‏ ‏.‏ قَالَتْ لاَ ‏.‏ قَالَ ‏\"‏ فَلاَ يَضُرُّكِ إِنْ كَانَ تَطَوُّعًا ‏\"‏ ‏.‏",
    "malay_translation": "Pada hari pembukaan Kota Mekah, ketika Mekah ditawan, Fatimah datang dan duduk di sebelah kiri Rasulullah ﷺ, dan Ummu Hani di sebelah kanannya. Seorang hamba perempuan membawa sebuah bekas berisi minuman; dia menghidangkannya kepada baginda dan baginda meminumnya. Kemudian baginda menghidangkannya kepada Ummu Hani dan dia pun meminumnya. Ummu Hani berkata: Wahai Rasulullah, sesungguhnya saya telah berbuka sedangkan saya sedang berpuasa. Baginda bertanya kepadanya: Adakah kamu menggantikan puasa (qadha) untuk sesuatu? Dia menjawab: Tidak. Baginda bersabda: Maka tidak mengapa bagimu jika puasa itu adalah puasa sunat."
  },
  {
    "id": 22962,
    "hadith_number": 2458,
    "tajuk_hadith": "Berbuka Puasa Sunat dan Menggantinya",
    "perawi_melayu": "Diriwayatkan oleh Aisyah, Ummul Mu'minin:",
    "english_text": "Some food was presented to me and Hafsah. We were fasting, but broke our fast. Then the Messenger of Allah (ﷺ) entered upon us. We said to him: A gift was presented to us; we coveted it and we broke our fast. The Messenger of Allah (ﷺ) said: There is no harm to you; keep a fast another day in lieu of it.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي حَيْوَةُ بْنُ شُرَيْحٍ، عَنِ ابْنِ الْهَادِ، عَنْ زُمَيْلٍ، مَوْلَى عُرْوَةَ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، قَالَتْ أُهْدِيَ لِي وَلِحَفْصَةَ طَعَامٌ وَكُنَّا صَائِمَتَيْنِ فَأَفْطَرْنَا ثُمَّ دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقُلْنَا لَهُ يَا رَسُولَ اللَّهِ إِنَّا أُهْدِيَتْ لَنَا هَدِيَّةٌ فَاشْتَهَيْنَاهَا فَأَفْطَرْنَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ عَلَيْكُمَا صُومَا مَكَانَهُ يَوْمًا آخَرَ ‏\"‏ ‏.‏",
    "malay_translation": "Makanan telah dihidangkan kepada saya dan Hafsah. Kami sedang berpuasa, tetapi kami membatalkan puasa kami. Kemudian Rasulullah (ﷺ) masuk menemui kami. Kami berkata kepada baginda: Hadiah telah diberikan kepada kami; kami menginginkannya dan kami membatalkan puasa kami. Rasulullah (ﷺ) bersabda: Tidak mengapa bagi kamu berdua; berpuasalah pada hari lain sebagai ganti."
  },
  {
    "id": 22963,
    "hadith_number": 2459,
    "tajuk_hadith": "Larangan Puasa Sunat dan Kebenaran Masuk Rumah Tanpa Izin Suami",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "It is not allowable for a woman to keep (voluntary) fast when her husband is present without his permission, and she may not allow anyone to enter his house without his permission.",
    "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَصُومُ الْمَرْأَةُ وَبَعْلُهَا شَاهِدٌ إِلاَّ بِإِذْنِهِ غَيْرَ رَمَضَانَ وَلاَ تَأْذَنُ فِي بَيْتِهِ وَهُوَ شَاهِدٌ إِلاَّ بِإِذْنِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Tidak dibenarkan bagi seorang wanita untuk berpuasa sunat ketika suaminya hadir tanpa izinnya, dan dia juga tidak boleh membenarkan sesiapa pun masuk ke rumahnya tanpa izin suaminya."
  },
  {
    "id": 22964,
    "hadith_number": 2460,
    "tajuk_hadith": "Aduan Wanita Mengenai Tindakan Suami dan Penjelasan Nabi",
    "perawi_melayu": "Diriwayatkan oleh Abu Sa'id al-Khudri:",
    "english_text": "A woman came to the Prophet (ﷺ) while we were with him.  \n\n\n\n\n\nShe said: Messenger of Allah, my husband, Safwan ibn al-Mu'attal, beats me when I pray, and makes me break my fast when I keep a fast, and he does not offer the dawn prayer until the sun rises. \n\n\n\n\n\nHe asked Safwan, who was present, about what she had said.  He replied: Messenger of Allah, as for her statement \"he beats me when I pray\", she recites two surahs (during prayer) and I have prohibited her (to do so).  \n\n\n\n\n\nHe (the Prophet) said: If one surah is recited (during prayer), that is sufficient for the people.  \n\n\n\n\n\n(Safwan continued:) As regards her saying \"he makes me break my fast,\" she dotes on fasting; I am a young man, I cannot restrain myself.  \n\n\n\n\n\nThe Messenger of Allah (ﷺ) said on that day: A woman should not fast except with the permission of her husband.  \n\n\n\n\n\n(Safwan said:) As for her statement that I do not pray until the sun rises, we are a people belonging to a class, and that (our profession of supplying water) is already known about us. We do not awake until the sun rises.  He said: When you awake, offer your prayer.",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي سَعِيدٍ، قَالَ جَاءَتِ امْرَأَةٌ إِلَى النَّبِيِّ صلى الله عليه وسلم وَنَحْنُ عِنْدَهُ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ زَوْجِي صَفْوَانَ بْنَ الْمُعَطَّلِ يَضْرِبُنِي إِذَا صَلَّيْتُ وَيُفَطِّرُنِي إِذَا صُمْتُ وَلاَ يُصَلِّي صَلاَةَ الْفَجْرِ حَتَّى تَطْلُعَ الشَّمْسُ ‏.‏ قَالَ وَصَفْوَانُ عِنْدَهُ ‏.‏ قَالَ فَسَأَلَهُ عَمَّا قَالَتْ فَقَالَ يَا رَسُولَ اللَّهِ أَمَّا قَوْلُهَا يَضْرِبُنِي إِذَا صَلَّيْتُ فَإِنَّهَا تَقْرَأُ بِسُورَتَيْنِ وَقَدْ نَهَيْتُهَا ‏.‏ قَالَ فَقَالَ ‏\"‏ لَوْ كَانَتْ سُورَةً وَاحِدَةً لَكَفَتِ النَّاسَ ‏\"‏ ‏.‏ وَأَمَّا قَوْلُهَا يُفَطِّرُنِي فَإِنَّهَا تَنْطَلِقُ فَتَصُومُ وَأَنَا رَجُلٌ شَابٌّ فَلاَ أَصْبِرُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَئِذٍ ‏\"‏ لاَ تَصُومُ امْرَأَةٌ إِلاَّ بِإِذْنِ زَوْجِهَا ‏\"‏ ‏.‏ وَأَمَّا قَوْلُهَا إِنِّي لاَ أُصَلِّي حَتَّى تَطْلُعَ الشَّمْسُ فَإِنَّا أَهْلُ بَيْتٍ قَدْ عُرِفَ لَنَا ذَاكَ لاَ نَكَادُ نَسْتَيْقِظُ حَتَّى تَطْلُعَ الشَّمْسُ ‏.‏ قَالَ ‏\"‏ فَإِذَا اسْتَيْقَظْتَ فَصَلِّ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ حَمَّادٌ - يَعْنِي ابْنَ سَلَمَةَ - عَنْ حُمَيْدٍ أَوْ ثَابِتٍ عَنْ أَبِي الْمُتَوَكِّلِ ‏.‏",
    "malay_translation": "Seorang wanita datang kepada Nabi (ﷺ) ketika kami bersama baginda. Wanita itu berkata: Wahai Rasulullah, suamiku, Safwan ibn al-Mu'attal, memukul saya ketika saya solat, dan membuat saya berbuka puasa ketika saya berpuasa, dan dia tidak menunaikan solat Subuh sehingga matahari terbit. Baginda bertanya kepada Safwan, yang hadir di situ, tentang apa yang wanita itu katakan. Safwan menjawab: Wahai Rasulullah, mengenai kata-katanya \"dia memukul saya ketika saya solat\", dia membaca dua surah (semasa solat) dan saya telah melarangnya (berbuat demikian). Baginda (Nabi) bersabda: Jika satu surah dibaca (semasa solat), itu sudah memadai bagi orang ramai. (Safwan menyambung:) Mengenai kata-katanya \"dia membuat saya berbuka puasa,\" dia gemar berpuasa; saya seorang lelaki muda, saya tidak dapat menahan diri. Rasulullah (ﷺ) bersabda pada hari itu: Seorang wanita tidak boleh berpuasa kecuali dengan izin suaminya. (Safwan berkata:) Mengenai kata-katanya bahawa saya tidak solat sehingga matahari terbit, kami adalah kaum yang tergolong dalam kelas tertentu, dan itu (profesi kami membekalkan air) sudah diketahui tentang kami. Kami tidak bangun sehingga matahari terbit. Baginda bersabda: Apabila kamu bangun, maka solatlah."
  },
  {
    "id": 22965,
    "hadith_number": 2461,
    "tajuk_hadith": "Adab Menerima Jemputan Makan",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "When one of you receives an invitation (for a meal), he should accept it. If he isn to fasting, he should eat, and if he is fasten, he should pray. Hisham said: The word salat means to pray (for him to Allah).\n\n\nAbu Dawud said: This tradition has also been narrated by Hafs b. Ghiyath from Hisham.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو خَالِدٍ، عَنْ هِشَامٍ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا دُعِيَ أَحَدُكُمْ فَلْيُجِبْ فَإِنْ كَانَ مُفْطِرًا فَلْيَطْعَمْ وَإِنْ كَانَ صَائِمًا فَلْيُصَلِّ ‏\"‏ ‏.‏ قَالَ هِشَامٌ وَالصَّلاَةُ الدُّعَاءُ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ حَفْصُ بْنُ غِيَاثٍ أَيْضًا عَنْ هِشَامٍ ‏.‏",
    "malay_translation": "Apabila salah seorang daripada kamu menerima jemputan (makan), maka hendaklah dia menerimanya. Jika dia tidak berpuasa, maka hendaklah dia makan, dan jika dia berpuasa, maka hendaklah dia berdoa. Hisham berkata: Perkataan 'solat' bermaksud doa (untuknya kepada Allah). Abu Daud berkata: Hadis ini juga diriwayatkan oleh Hafs bin Ghiyath daripada Hisham."
  },
  {
    "id": 22966,
    "hadith_number": 2462,
    "tajuk_hadith": "Apabila Dijemput Makan Ketika Berpuasa",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "When one of you is invited (to a meal), and he is fasting, he should say that he is fasting.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا دُعِيَ أَحَدُكُمْ إِلَى طَعَامٍ وَهُوَ صَائِمٌ فَلْيَقُلْ إِنِّي صَائِمٌ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila salah seorang daripada kamu dijemput (ke suatu jamuan makan), dan dia sedang berpuasa, maka hendaklah dia mengatakan bahawa dia sedang berpuasa."
  },
  {
    "id": 22967,
    "hadith_number": 2463,
    "tajuk_hadith": "Amalan Iktikaf Nabi (ﷺ) dan Isteri-isteri Baginda",
    "perawi_melayu": "Aisyah berkata:",
    "english_text": "The Prophet (ﷺ) used to observe retirement (i'tikaf) to the mosque during the last ten days of Ramadan till Allah took him, and then his wives observed retirement to the mosque after his death.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَعْتَكِفُ الْعَشْرَ الأَوَاخِرَ مِنْ رَمَضَانَ حَتَّى قَبَضَهُ اللَّهُ ثُمَّ اعْتَكَفَ أَزْوَاجُهُ مِنْ بَعْدِهِ ‏.‏",
    "malay_translation": "Nabi (ﷺ) selalu melakukan iktikaf di masjid pada sepuluh hari terakhir Ramadan hingga Allah mewafatkan baginda, kemudian isteri-isteri baginda melakukan iktikaf di masjid setelah kewafatan baginda."
  },
  {
    "id": 22968,
    "hadith_number": 2464,
    "tajuk_hadith": "Iktikaf Nabi ﷺ Sebagai Ganti Tahun yang Tertinggal",
    "perawi_melayu": "Diriwayatkan oleh Ubayy ibn Ka'b:",
    "english_text": "The Prophet (ﷺ) used to observe i'tikaf during the last ten days of Ramadan. One year he did not observe i'tikaf. When the next year came, he observed i'tikaf for twenty nights (i.e. days).",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، أَخْبَرَنَا ثَابِتٌ، عَنْ أَبِي رَافِعٍ، عَنْ أُبَىِّ بْنِ كَعْبٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَعْتَكِفُ الْعَشْرَ الأَوَاخِرَ مِنْ رَمَضَانَ فَلَمْ يَعْتَكِفْ عَامًا فَلَمَّا كَانَ الْعَامُ الْمُقْبِلُ اعْتَكَفَ عِشْرِينَ لَيْلَةً ‏.‏",
    "malay_translation": "Nabi ﷺ biasanya beriktikaf pada sepuluh hari terakhir bulan Ramadan. Pada suatu tahun, baginda tidak beriktikaf. Apabila tiba tahun berikutnya, baginda beriktikaf selama dua puluh malam (iaitu hari)."
  },
  {
    "id": 22969,
    "hadith_number": 2465,
    "tajuk_hadith": "Niat Rasulullah SAW untuk Beriktikaf dan Penangguhannya",
    "perawi_melayu": "Aisyah R.A. berkata:",
    "english_text": "When the Messenger of Allah (ﷺ) intended to observe I'tikaf, he prayed the fajr prayer and then entered his place of seclusion. Once he intended to observe I'tikaf during the last ten days of Ramadan. She said: He ordered to pitch a tent for him, and it was pitched. She said: The other wives of the Prophet (ﷺ) also ordered to pitch tents for them and they were pitched. When he offered the fajr prayer, he saw the tents, and said: What is this ? Did you intend to do an act of virtue ? She said: He then ordered to demolish his tent, and it was demolished. Then his wives also ordered to demolish their tents and they were demolished. He then postponed I'tikaf till the first ten days, that is of Shawwal.\n\n\nAbu Dawud said: This tradition has been transmitted by Ibn Ishaq and al-Auza'i from Yahya b. Sa'id in a similar manner, and Malik narrated it from Yahya b. Sa'id, saying: He observed I'tikaf during twenty days of Shawwal.",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَيَعْلَى بْنُ عُبَيْدٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَرَادَ أَنْ يَعْتَكِفَ صَلَّى الْفَجْرَ ثُمَّ دَخَلَ مُعْتَكَفَهُ ‏.‏ قَالَتْ وَإِنَّهُ أَرَادَ مَرَّةً أَنْ يَعْتَكِفَ فِي الْعَشْرِ الأَوَاخِرِ مِنْ رَمَضَانَ ‏.‏ قَالَتْ فَأَمَرَ بِبِنَائِهِ فَضُرِبَ فَلَمَّا رَأَيْتُ ذَلِكَ أَمَرْتُ بِبِنَائِي فَضُرِبَ ‏.‏ قَالَتْ وَأَمَرَ غَيْرِي مِنْ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم بِبِنَائِهِ فَضُرِبَ فَلَمَّا صَلَّى الْفَجْرَ نَظَرَ إِلَى الأَبْنِيَةِ فَقَالَ ‏\n\"‏ مَا هَذِهِ آلْبِرَّ تُرِدْنَ ‏\"‏ ‏.‏ قَالَتْ فَأَمَرَ بِبِنَائِهِ فَقُوِّضَ وَأَمَرَ أَزْوَاجُهُ بِأَبْنِيَتِهِنَّ فَقُوِّضَتْ ثُمَّ أَخَّرَ الاِعْتِكَافَ إِلَى الْعَشْرِ الأُوَلِ يَعْنِي مِنْ شَوَّالٍ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ ابْنُ إِسْحَاقَ وَالأَوْزَاعِيُّ عَنْ يَحْيَى بْنِ سَعِيدٍ نَحْوَهُ وَرَوَاهُ مَالِكٌ عَنْ يَحْيَى بْنِ سَعِيدٍ قَالَ اعْتَكَفَ عِشْرِينَ مِنْ شَوَّالٍ ‏.‏",
    "malay_translation": "Apabila Rasulullah (ﷺ) berhasrat untuk melakukan I'tikaf, baginda solat Subuh dan kemudian masuk ke tempat pengasingannya. Pernah sekali baginda berhasrat untuk melakukan I'tikaf pada sepuluh hari terakhir Ramadan. Aisyah R.A. berkata: Baginda memerintahkan agar khemah didirikan untuk baginda, lalu ia didirikan. Aisyah R.A. berkata: Isteri-isteri Nabi (ﷺ) yang lain juga memerintahkan agar khemah didirikan untuk mereka dan ia pun didirikan. Ketika baginda selesai solat Subuh, baginda melihat khemah-khemah itu, dan bersabda: 'Apakah ini? Adakah kamu semua berniat untuk melakukan suatu kebajikan?' Aisyah R.A. berkata: Kemudian baginda memerintahkan agar khemah baginda dirobohkan, dan ia pun dirobohkan. Kemudian isteri-isteri baginda juga memerintahkan agar khemah-khemah mereka dirobohkan dan ia pun dirobohkan. Kemudian baginda menangguhkan I'tikaf hingga sepuluh hari pertama, iaitu bulan Syawal.\n\nAbu Daud berkata: Hadis ini diriwayatkan oleh Ibn Ishaq dan al-Auza'i dari Yahya b. Sa'id dengan cara yang serupa, dan Malik meriwayatkannya dari Yahya b. Sa'id, dengan berkata: Baginda melakukan I'tikaf selama dua puluh hari dari bulan Syawal."
  },
  {
    "id": 22970,
    "hadith_number": 2466,
    "tajuk_hadith": "Amalan I'tikaf Nabi (ﷺ) pada Sepuluh Hari Terakhir Ramadan dan Lokasinya di Masjid",
    "perawi_melayu": "Ibn 'Umar berkata:",
    "english_text": "The Prophet (ﷺ) used to observe I'tikaf during the last ten days of Ramadan. Nafi' said: 'Abd Allah (b. 'Umar) showed me the place in the mosque where Messenger of Allah (ﷺ) used to observe I'tikaf.",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، أَنَّ نَافِعًا، أَخْبَرَهُ عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَعْتَكِفُ الْعَشْرَ الأَوَاخِرَ مِنْ رَمَضَانَ ‏.‏ قَالَ نَافِعٌ وَقَدْ أَرَانِي عَبْدُ اللَّهِ الْمَكَانَ الَّذِي يَعْتَكِفُ فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنَ الْمَسْجِدِ ‏.‏",
    "malay_translation": "Nabi (ﷺ) biasa melakukan I'tikaf pada sepuluh hari terakhir bulan Ramadan. Nafi' berkata: 'Abd Allah (b. 'Umar) telah menunjukkan kepadaku tempat di dalam masjid di mana Rasulullah (ﷺ) biasa melakukan I'tikaf."
  },
  {
    "id": 22971,
    "hadith_number": 2467,
    "tajuk_hadith": "Iktikaf Nabi SAW di Bulan Ramadan",
    "perawi_melayu": "Abu Hurairah berkata:",
    "english_text": "The Prophet (ﷺ) used to observe I'tikaf during ten days of Ramadan every year. But when the year in which he died, he observed I'tikaf for twenty days.",
    "arabic_text": "حَدَّثَنَا هَنَّادٌ، عَنْ أَبِي بَكْرٍ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَعْتَكِفُ كُلَّ رَمَضَانَ عَشَرَةَ أَيَّامٍ فَلَمَّا كَانَ الْعَامُ الَّذِي قُبِضَ فِيهِ اعْتَكَفَ عِشْرِينَ يَوْمًا ‏.‏",
    "malay_translation": "Nabi (ﷺ) biasa melakukan I'tikaf selama sepuluh hari pada bulan Ramadan setiap tahun. Tetapi pada tahun di mana baginda wafat, baginda melakukan I'tikaf selama dua puluh hari."
  },
  {
    "id": 22972,
    "hadith_number": 2468,
    "tajuk_hadith": "Keadaan Rasulullah SAW Ketika I'tikaf: Mendekatkan Kepala kepada Aisyah R.A.",
    "perawi_melayu": "Daripada Aisyah R.A., katanya:",
    "english_text": "When the Messenger of Allah (ﷺ) observed I'tikaf, he would put his head near me, and I would comb it.  and he entered the house only to fulfill human needs (i.e. to urinate or to relieve himself).",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا اعْتَكَفَ يُدْنِي إِلَىَّ رَأْسَهُ فَأُرَجِّلُهُ وَكَانَ لاَ يَدْخُلُ الْبَيْتَ إِلاَّ لِحَاجَةِ الإِنْسَانِ ‏.‏",
    "malay_translation": "Ketika Rasulullah (ﷺ) beri'tikaf, baginda akan mendekatkan kepala baginda kepada saya, lalu saya menyikat rambut baginda. Dan baginda tidak memasuki rumah kecuali untuk keperluan manusia (seperti buang air kecil atau buang air besar)."
  },
  {
    "id": 22973,
    "hadith_number": 2469,
    "tajuk_hadith": "Riwayat Yunus dan Sokongan untuk Riwayat daripada al-Zuhri daripada 'Aishah",
    "perawi_melayu": "Tradisi yang serupa telah diriwayatkan oleh 'Aishah daripada Nabi (ﷺ) melalui rantaian perawi yang berbeza.\n\n\nAbu Dawud berkata:",
    "english_text": "And Yunus also narrated in a similar way from al-Zuhri, and no one supported Malik in his narration from 'Urwah from 'Umrah ; and Ma'mar, Ziyad b. Sad and others have also narrated it from al-Zuhri from 'Urwah on the authority of 'Aishah.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَعَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، قَالاَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏ قَالَ أَبُو دَاوُدَ وَكَذَلِكَ رَوَاهُ يُونُسُ عَنِ الزُّهْرِيِّ وَلَمْ يُتَابِعْ أَحَدٌ مَالِكًا عَلَى عُرْوَةَ عَنْ عَمْرَةَ وَرَوَاهُ مَعْمَرٌ وَزِيَادُ بْنُ سَعْدٍ وَغَيْرُهُمَا عَنِ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ ‏.‏",
    "malay_translation": "Dan Yunus juga meriwayatkan dengan cara yang serupa daripada al-Zuhri, dan tiada seorang pun yang menyokong Malik dalam riwayatnya daripada 'Urwah daripada 'Umrah; dan Ma'mar, Ziyad bin Sa'd dan lain-lain juga meriwayatkannya daripada al-Zuhri daripada 'Urwah atas autoriti 'Aishah."
  },
  {
    "id": 22974,
    "hadith_number": 2470,
    "tajuk_hadith": "Iktikaf Nabi SAW: Aisyah Membasuh Kepala Baginda",
    "perawi_melayu": "'Aisyah berkata:",
    "english_text": "The Messenger of Allah (ﷺ) used to observe I'tikaf in the mosque and put his head near me through the opening of the apartment, and I would wash his head. Musaddad said: \"And I would comb it while I was menstruating.\"",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، وَمُسَدَّدٌ، قَالاَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَكُونُ مُعْتَكِفًا فِي الْمَسْجِدِ فَيُنَاوِلُنِي رَأْسَهُ مِنْ خَلَلِ الْحُجْرَةِ فَأَغْسِلُ رَأْسَهُ ‏.‏ وَقَالَ مُسَدَّدٌ فَأُرَجِّلُهُ وَأَنَا حَائِضٌ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) biasa beriktikaf di masjid dan menghulurkan kepalanya ke arah saya melalui bukaan bilik, lalu saya membasuh kepalanya. Musaddad berkata: \"Dan saya menyikat rambutnya ketika saya sedang haid.\""
  },
  {
    "id": 22975,
    "hadith_number": 2471,
    "tajuk_hadith": "Penjelasan tentang Syaitan Mengalir dalam Diri Manusia Seperti Darah",
    "perawi_melayu": "Safiyyah berkata:",
    "english_text": "When the Messenger of Allah (ﷺ) was observing I'tikaf (in the mosque), I would come to him to visit him. I had a talk with him and then stood up. I then returned and he (the Prophet) also stood up to accompany me (to my house). Her dwelling place was in the house of Usamah b. Zaid. Two men from the Ansar (helpers) passed (by him at the moment). When they saw the Prophet (ﷺ), they walked quickly. The Prophet (ﷺ) said: Be at ease, she is Safiyyah daughter of Huyayy. They said: Be glory to Allah, Messenger of Allah! He said: Satan runs in man like blood. I feared he might inspire something in your mind, or he said: evil (the narrator doubted).",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ شَبُّويَةَ الْمَرْوَزِيُّ، حَدَّثَنِي عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، عَنْ صَفِيَّةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم مُعْتَكِفًا فَأَتَيْتُهُ أَزُورُهُ لَيْلاً فَحَدَّثْتُهُ ثُمَّ قُمْتُ فَانْقَلَبْتُ فَقَامَ مَعِي لِيَقْلِبَنِي - وَكَانَ مَسْكَنُهَا فِي دَارِ أُسَامَةَ بْنِ زَيْدٍ - فَمَرَّ رَجُلاَنِ مِنَ الأَنْصَارِ فَلَمَّا رَأَيَا النَّبِيَّ صلى الله عليه وسلم أَسْرَعَا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ عَلَى رِسْلِكُمَا إِنَّهَا صَفِيَّةُ بِنْتُ حُيَىٍّ ‏\"‏ ‏.‏ قَالاَ سُبْحَانَ اللَّهِ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ إِنَّ الشَّيْطَانَ يَجْرِي مِنَ الإِنْسَانِ مَجْرَى الدَّمِ فَخَشِيتُ أَنْ يَقْذِفَ فِي قُلُوبِكُمَا شَيْئًا ‏\"‏ ‏.‏ أَوْ قَالَ ‏\"‏ شَرًّا ‏\"‏ ‏.‏",
    "malay_translation": "Ketika Rasulullah (ﷺ) sedang beriktikaf (di masjid), saya datang menziarahinya pada waktu malam. Saya berbual-bual dengannya, kemudian saya bangun dan beredar pulang, lalu baginda (Nabi) turut bangun untuk menemani saya pulang (ke rumah saya). Tempat tinggal beliau adalah di rumah Usamah bin Zaid. Dua orang lelaki dari Ansar (golongan penolong) lalu (di hadapan baginda pada ketika itu). Apabila mereka melihat Nabi (ﷺ), mereka berjalan dengan pantas. Nabi (ﷺ) bersabda: \"Bertenanglah, ini adalah Safiyyah binti Huyayy.\" Mereka berkata: \"Maha Suci Allah, wahai Rasulullah!\" Baginda bersabda: \"Sesungguhnya syaitan bergerak dalam diri manusia seperti aliran darah, dan saya khuatir ia akan menimbulkan sesuatu dalam hati kamu berdua,\" atau baginda bersabda: \"kejahatan\" (perawi ragu-ragu)."
  },
  {
    "id": 22976,
    "hadith_number": 2472,
    "tajuk_hadith": "Riwayat Lain dari Zuhri dengan Sanad Berbeza",
    "perawi_melayu": "",
    "english_text": "The tradition mentioned above has also been transmitted by Al Zuhri through a different chain of narrators. In this version she said “When he was at the gate of the mosque which was near the gate of Umm Salamah, two men passed them. The narrator then transmitted the tradition to the same effect.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ، حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، بِإِسْنَادِهِ بِهَذَا قَالَتْ حَتَّى إِذَا كَانَ عِنْدَ بَابِ الْمَسْجِدِ الَّذِي عِنْدَ بَابِ أُمِّ سَلَمَةَ مَرَّ بِهِمَا رَجُلاَنِ ‏.‏ وَسَاقَ مَعْنَاهُ ‏.‏",
    "malay_translation": "Hadis yang disebutkan di atas juga diriwayatkan oleh Al Zuhri melalui sanad yang berbeza. Dalam versi ini, beliau berkata, \"Ketika beliau berada di pintu masjid yang berdekatan dengan pintu Umm Salamah, dua orang lelaki melewati mereka.\" Kemudian perawi meriwayatkan hadis tersebut dengan makna yang sama."
  },
  {
    "id": 22977,
    "hadith_number": 2473,
    "tajuk_hadith": "Nabi (ﷺ) Menziarahi Orang Sakit Semasa Iktikaf",
    "perawi_melayu": "",
    "english_text": "According to the version of Al Nufaili, A’ishah said “The Prophet (ﷺ) used to pass by a patient while he was observing I’tikaf(in the mosque) but he passed as usual and did not stay asking about him.”\n\n\nAccording to the version of Ibn Isa she said “The Prophet (ﷺ) would visit a patient while he was observing I’tikaf.”",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، وَمُحَمَّدُ بْنُ عِيسَى، قَالاَ حَدَّثَنَا عَبْدُ السَّلاَمِ بْنُ حَرْبٍ، أَخْبَرَنَا اللَّيْثُ بْنُ أَبِي سُلَيْمٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، - قَالَ النُّفَيْلِيُّ - قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يَمُرُّ بِالْمَرِيضِ وَهُوَ مُعْتَكِفٌ فَيَمُرُّ كَمَا هُوَ وَلاَ يُعَرِّجُ يَسْأَلُ عَنْهُ ‏.‏ وَقَالَ ابْنُ عِيسَى قَالَتْ إِنْ كَانَ النَّبِيُّ صلى الله عليه وسلم يَعُودُ الْمَرِيضَ وَهُوَ مُعْتَكِفٌ ‏.‏",
    "malay_translation": "Menurut riwayat Al Nufaili, Aisyah berkata, “Nabi (ﷺ) pernah melalui orang sakit ketika baginda sedang beriktikaf (di masjid), tetapi baginda berlalu seperti biasa dan tidak berhenti untuk bertanya tentangnya.” Menurut riwayat Ibn Isa, beliau berkata, “Nabi (ﷺ) akan mengunjungi orang sakit ketika baginda sedang beriktikaf.”"
  },
  {
    "id": 22978,
    "hadith_number": 2474,
    "tajuk_hadith": "Adab dalam Beriktikaf",
    "perawi_melayu": "Diriwayatkan dari Aisyah, Ummul Mu'minin:",
    "english_text": "The sunnah for one who is observing i'tikaf (in a mosque) is not to visit a patient, or to attend a funeral, or touch or embrace one's wife, or go out for anything but necessary purposes. There is no i'tikaf without fasting, and there is no i'tikaf except in a congregational mosque.",
    "arabic_text": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ، أَخْبَرَنَا خَالِدٌ، عَنْ عَبْدِ الرَّحْمَنِ، - يَعْنِي ابْنَ إِسْحَاقَ - عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتِ السُّنَّةُ عَلَى الْمُعْتَكِفِ أَنْ لاَ يَعُودَ مَرِيضًا وَلاَ يَشْهَدَ جَنَازَةً وَلاَ يَمَسَّ امْرَأَةً وَلاَ يُبَاشِرَهَا وَلاَ يَخْرُجَ لِحَاجَةٍ إِلاَّ لِمَا لاَ بُدَّ مِنْهُ وَلاَ اعْتِكَافَ إِلاَّ بِصَوْمٍ وَلاَ اعْتِكَافَ إِلاَّ فِي مَسْجِدٍ جَامِعٍ ‏.‏ قَالَ أَبُو دَاوُدَ غَيْرُ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَاقَ لاَ يَقُولُ فِيهِ قَالَتِ السُّنَّةُ ‏.‏ قَالَ أَبُو دَاوُدَ جَعَلَهُ قَوْلَ عَائِشَةَ ‏.‏",
    "malay_translation": "Sunnah bagi orang yang sedang beriktikaf (di dalam masjid) adalah untuk tidak menziarahi orang sakit, atau menghadiri jenazah, atau menyentuh atau memeluk isterinya, atau keluar untuk apa pun kecuali tujuan yang perlu. Tidak ada iktikaf tanpa berpuasa, dan tidak ada iktikaf kecuali di masjid jamek."
  },
  {
    "id": 22979,
    "hadith_number": 2475,
    "tajuk_hadith": "Nazar Umar pada Zaman Jahiliyah dan Arahan Nabi tentang Iktikaf dan Puasa",
    "perawi_melayu": "Diriwayatkan oleh Abdullah ibn Umar:",
    "english_text": "Umar (may Allah be pleased with him) took a vow in the pre-Islamic days to spend a night or a day in devotion near the Ka'bah (in the sacred mosque). He asked the Prophet (ﷺ) about it. He said: Observe i'tikaf (i.e. spend a night or a day near the Ka'bah) and fast.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُدَيْلٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عُمَرَ، - رضى الله عنه - جَعَلَ عَلَيْهِ أَنْ يَعْتَكِفَ فِي الْجَاهِلِيَّةِ لَيْلَةً أَوْ يَوْمًا عِنْدَ الْكَعْبَةِ فَسَأَلَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ اعْتَكِفْ وَصُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Umar (semoga Allah meredhainya) telah bernazar pada zaman pra-Islam untuk menghabiskan satu malam atau satu hari dalam ibadah dekat Ka'bah (di masjid suci). Beliau bertanya kepada Nabi (ﷺ) tentang hal itu. Baginda bersabda: 'Lakukanlah i'tikaf (iaitu menghabiskan satu malam atau satu hari dekat Ka'bah) dan berpuasalah.'"
  },
  {
    "id": 22980,
    "hadith_number": 2476,
    "tajuk_hadith": "Umar bertanya tentang takbir orang ramai ketika i'tikaf dan pembebasan tawanan Hawazin",
    "perawi_melayu": "Diriwayatkan oleh Abdullah ibn Umar:",
    "english_text": "The tradition mentioned above (No. 2468) has also been transmitted by Abdullah ibn Budayl through a different chain of narrators in a similar way. \n\n\n\n\n\nThis version adds: While he (Umar) was observing i'tikaf (in the sacred mosque), the people uttered (loudly):  \"Allah is most great.\" He said: What is this, Abdullah?  He said: These are the captives of the Hawazin whom the Messenger of Allah (ﷺ) has set free. He said: This slave-girl too? He sent her along with them.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ بْنِ مُحَمَّدٍ، عَنْ أَبَانَ بْنِ صَالِحٍ الْقُرَشِيِّ، حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ، - يَعْنِي الْعَنْقَزِيَّ - عَنْ عَبْدِ اللَّهِ بْنِ بُدَيْلٍ، بِإِسْنَادِهِ نَحْوَهُ قَالَ فَبَيْنَمَا هُوَ مُعْتَكِفٌ إِذْ كَبَّرَ النَّاسُ فَقَالَ مَا هَذَا يَا عَبْدَ اللَّهِ قَالَ سَبْىُ هَوَازِنَ أَعْتَقَهُمُ النَّبِيُّ صلى الله عليه وسلم قَالَ وَتِلْكَ الْجَارِيَةُ ‏.‏ فَأَرْسَلَهَا مَعَهُمْ ‏.‏",
    "malay_translation": "Hadis yang disebutkan di atas (No. 2468) juga telah diriwayatkan oleh Abdullah ibn Budayl melalui rantai periwayat yang berbeza dengan cara yang serupa. Versi ini menambah: Ketika beliau (Umar) sedang beriktikaf (di masjid suci), orang ramai mengucapkan (dengan kuat): \"Allahu Akbar.\" Beliau bertanya: Apa ini, Abdullah? Beliau menjawab: Ini adalah tawanan Hawazin yang telah dibebaskan oleh Rasulullah (ﷺ). Beliau bertanya: Budak perempuan ini juga? Lalu beliau menghantarnya bersama mereka."
  },
  {
    "id": 22981,
    "hadith_number": 2477,
    "tajuk_hadith": "Iktikaf Seorang Isteri Nabi dan Keadaan Istihadahnya",
    "perawi_melayu": "",
    "english_text": "A’ishah(may Allaah be pleased with her) said “One of the wives of the Apostle of Allaah(ﷺ) observed I’tikaf along with him (in the mosque). She would see yellowness and redness. Sometimes we would place a washbasin while she prayed.”",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، وَقُتَيْبَةُ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا يَزِيدُ، عَنْ خَالِدٍ، عَنْ عِكْرِمَةَ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتِ اعْتَكَفَتْ مَعَ النَّبِيِّ صلى الله عليه وسلم امْرَأَةٌ مِنْ أَزْوَاجِهِ فَكَانَتْ تَرَى الصُّفْرَةَ وَالْحُمْرَةَ فَرُبَّمَا وَضَعْنَا الطَّسْتَ تَحْتَهَا وَهِيَ تُصَلِّي ‏.‏",
    "malay_translation": "Aisyah (semoga Allah meredainya) berkata, “Salah seorang isteri Rasulullah ﷺ beriktikaf bersama baginda (di masjid). Beliau melihat kekuningan dan kemerahan (darah istihadah). Kadang-kadang kami meletakkan besen di bawahnya ketika beliau solat.”"
  }
]
