[
  {
    "id": 24474,
    "hadith_number": 3970,
    "tajuk_hadith": "Mengambil Miqat Ibrahim Sebagai Tempat Solat",
    "perawi_melayu": "Dikisahkan oleh Jabir ibn Abdullah:",
    "english_text": "The Prophet (ﷺ) read the Qur'anic verse, \"And take ye the Station of Abraham as a place of prayer.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، ح وَحَدَّثَنَا نَصْرُ بْنُ عَاصِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرٍ، رضى الله عنه أَنَّ النَّبِيَّ صلى الله عليه وسلم قَرَأَ ‏{‏ وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى ‏}‏",
    "malay_translation": "Rasulullah SAW membaca ayat al-Quran, \"Dan jadikanlah sebahagian dari Miqat Ibrahim itu sebagai tempat sembahyang.\""
  },
  {
    "id": 24475,
    "hadith_number": 3971,
    "tajuk_hadith": "Seorang Lelaki Berzikir Pada Malam dan Pengingatan Rasulullah SAW",
    "perawi_melayu": "Dikisahkan oleh Aisyah:",
    "english_text": "A man got up (for prayer) at night, he read the Qur'an and raised his voice in reading. When the morning came, the Messenger of Allah (ﷺ) said: May Allah have mercy on so-and-so! Last night he reminded me a number of verses which I was about to forget.",
    "arabic_text": "حَدَّثَنَا مُوسَى، - يَعْنِي ابْنَ إِسْمَاعِيلَ - حَدَّثَنَا حَمَّادٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، رضى الله عنها أَنَّ رَجُلاً، قَامَ مِنَ اللَّيْلِ فَقَرَأَ فَرَفَعَ صَوْتَهُ بِالْقُرْآنِ فَلَمَّا أَصْبَحَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَرْحَمُ اللَّهُ فُلاَنًا كَائِنٌ مِنْ آيَةٍ أَذْكَرَنِيهَا اللَّيْلَةَ كُنْتُ قَدْ أَسْقَطْتُهَا ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki bangun pada waktu malam, membaca Al-Quran dengan suara yang lantang. Ketika pagi menjelang, Rasulullah SAW bersabda: Semoga Allah merahmati si fulan! Tadi malam dia mengingatkan aku beberapa ayat yang hampir aku lupakan."
  },
  {
    "id": 24476,
    "hadith_number": 3972,
    "tajuk_hadith": "Penjelasan Ayat tentang Kejujuran Nabi SAW dan Kisah Kain Sutera Merah di Perang Badar",
    "perawi_melayu": "Diceritakan oleh Abdullah ibn Abbas:",
    "english_text": "The verse \"And no Prophet could (ever) be false to his trust\" was revealed about a red velvet. When it was found missing on the day of Badr, some people said; Perhaps the Messenger of Allah (ﷺ) has taken it. So Allah, the Exalted, sent down \"And no prophet could (ever) be false to his trust\" to the end of the verse.\n\n\n\n\nAbu Dawud said: In the word yaghulla the letter ya has a short vowel a.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا خُصَيْفٌ، حَدَّثَنَا مِقْسَمٌ، مَوْلَى ابْنِ عَبَّاسٍ قَالَ قَالَ ابْنُ عَبَّاسٍ رضى الله عنهما نَزَلَتْ هَذِهِ الآيَةُ ‏{‏ وَمَا كَانَ لِنَبِيٍّ أَنْ يَغُلَّ ‏}‏ فِي قَطِيفَةٍ حَمْرَاءَ فُقِدَتْ يَوْمَ بَدْرٍ فَقَالَ بَعْضُ النَّاسِ لَعَلَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَخَذَهَا فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ وَمَا كَانَ لِنَبِيٍّ أَنْ يَغُلَّ ‏}‏ إِلَى آخِرِ الآيَةِ ‏.‏ قَالَ أَبُو دَاوُدَ يَغُلَّ مَفْتُوحَةُ الْيَاءِ ‏.‏",
    "malay_translation": "Ayat suci Al-Quran \"Dan tidaklah patut bagi seorang Nabi untuk berkhianat\" diturunkan berkaitan dengan sehelai sutera merah.  Ketika ia hilang pada hari Perang Badar, sebahagian orang berkata, \"Mungkin Rasulullah SAW telah mengambilnya.\"  Lalu Allah SWT menurunkan ayat tersebut hingga akhir ayat, sebagai penegasan tentang keteguhan dan kejujuran Rasulullah SAW.  Abu Dawud berkata: Dalam perkataan \"yaghulla\", huruf \"ya\" dibaca dengan fathah."
  },
  {
    "id": 24477,
    "hadith_number": 3973,
    "tajuk_hadith": "Mencari Lindungan daripada Kedekut dan Tua",
    "perawi_melayu": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "O Allah, I seek refuge in Thee from niggardliness and old age.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ أَبِي قَالَ، سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبُخْلِ وَالْهَرَمِ ‏\"‏ ‏.‏",
    "malay_translation": "Ya Allah, aku memohon perlindungan-Mu daripada sifat kedekut dan usia tua."
  },
  {
    "id": 24478,
    "hadith_number": 3974,
    "tajuk_hadith": "Ketidakpastian Perkataan Nabi SAW dalam Hadis",
    "perawi_melayu": "Diceritakan oleh Laqit bin Sabirah:",
    "english_text": "I came in the deputation of Banu al-Muntafiq to the Messenger of Allah (ﷺ). He then narrated the rest of the tradition. The Prophet (ﷺ) said: la tahsibanna (do not think) and did not say: la tahsabanna (do not think).",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ، عَنْ إِسْمَاعِيلَ بْنِ كَثِيرٍ، عَنْ عَاصِمِ بْنِ لَقِيطِ بْنِ صَبِرَةَ، عَنْ أَبِيهِ، لَقِيطِ بْنِ صَبِرَةَ قَالَ كُنْتُ وَافِدَ بَنِي الْمُنْتَفِقِ - أَوْ فِي وَفْدِ بَنِي الْمُنْتَفِقِ - إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ الْحَدِيثَ فَقَالَ - يَعْنِي النَّبِيَّ صلى الله عليه وسلم - ‏\n\"‏ لاَ تَحْسِبَنَّ ‏\"‏ ‏.‏ وَلَمْ يَقُلْ لاَ تَحْسَبَنَّ ‏.‏",
    "malay_translation": "Aku datang sebagai utusan Banu al-Muntafiq kepada Rasulullah SAW. Kemudian beliau menceritakan hadis yang lain. Nabi SAW berkata: \"La tahsibanna\" (janganlah engkau sangka) dan tidak berkata: \"La tahsabanna\". Dalam riwayat lain, perkataan itu disebut tanpa huruf \"na\".  Ini menunjukkan ketelitian dan kepastian dalam penyampaian perkataan Nabi SAW."
  },
  {
    "id": 24479,
    "hadith_number": 3975,
    "tajuk_hadith": "Larangan Membunuh dan Mengambil Harta Orang Lain setelah Salam",
    "perawi_melayu": "Dikisahkan oleh Ibn 'Abbas:",
    "english_text": "The Muslims met a man with some sheep of his. He said: Peace be upon you. But they killed him and took those few sheep. Thereupon the following Qur'anic verse was revealed: \"...And say to anyone who offers you a salutation: Thou art none of believer, coveting the perishable good of this life.\" meaning these few sheep.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَحِقَ الْمُسْلِمُونَ رَجُلاً فِي غُنَيْمَةٍ لَهُ فَقَالَ السَّلاَمُ عَلَيْكُمْ فَقَتَلُوهُ وَأَخَذُوا تِلْكَ الْغُنَيْمَةَ فَنَزَلَتْ ‏{‏ وَلاَ تَقُولُوا لِمَنْ أَلْقَى إِلَيْكُمُ السَّلاَمَ لَسْتَ مُؤْمِنًا تَبْتَغُونَ عَرَضَ الْحَيَاةِ الدُّنْيَا ‏}‏ تِلْكَ الْغُنَيْمَةَ ‏.‏",
    "malay_translation": "Para Muslim bertemu seorang lelaki yang memiliki beberapa ekor kambing. Dia mengucapkan salam: \"Semoga kesejahteraan ke atas kamu.\" Namun, mereka membunuhnya dan mengambil kambing-kambing tersebut. Kemudian turunlah ayat al-Quran berikut: \"...Dan janganlah kamu berkata kepada orang yang memberi salam kepadamu: Kamu bukan orang yang beriman, sedangkan kamu mencari harta duniawi yang sementara.\" Maksudnya ialah kambing-kambing tersebut."
  },
  {
    "id": 24480,
    "hadith_number": 3976,
    "tajuk_hadith": "Bacaan Nabi SAW dan Kedudukan Orang Mukmin Yang Tidak Menanggung Kerugian",
    "perawi_melayu": "Dikisahkan oleh Zayd bin Thabit",
    "english_text": "The Prophet (ﷺ) used to read: \"Not equal are those believers who sit (at home) and receive no hurt (ghayru ulid-darari) but the narrator Sa'id did not say the words \"used to read\"",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الأَنْبَارِيُّ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، عَنِ ابْنِ أَبِي الزِّنَادِ، - وَهُوَ أَشْبَعُ - عَنْ أَبِيهِ، عَنْ خَارِجَةَ بْنِ زَيْدِ بْنِ ثَابِتٍ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقْرَأُ ‏{‏ غَيْرُ أُولِي الضَّرَرِ ‏}‏ وَلَمْ يَقُلْ سَعِيدٌ كَانَ يَقْرَأُ ‏.‏",
    "malay_translation": "Nabi SAW pernah membaca ayat {غير أولي الضرر} (Bukan termasuk orang-orang yang menyebabkan kerugian). Namun, perawi Sa'id tidak menyebut Nabi SAW 'pernah membaca'."
  },
  {
    "id": 24481,
    "hadith_number": 3977,
    "tajuk_hadith": "Penjelasan Ayat \"Mata dengan Mata\"",
    "perawi_melayu": "Dikisahkan oleh Anas bin Malik:",
    "english_text": "The Messenger of Allah (ﷺ) read the verse: \"eye for eye\" (al-'aynu bil-'ayn).",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْعَلاَءِ، قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، حَدَّثَنَا يُونُسُ بْنُ يَزِيدَ، عَنْ أَبِي عَلِيِّ بْنِ يَزِيدَ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَرَأَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏{‏ وَالْعَيْنُ بِالْعَيْنِ ‏}‏ ‏.‏",
    "malay_translation": "Rasulullah SAW membaca ayat: \"Mata dengan mata\" (al-'aynu bil-'ayn)."
  },
  {
    "id": 24482,
    "hadith_number": 3978,
    "tajuk_hadith": "Penjelasan Mengenai Hukum Balas Dalam Al-Quran",
    "perawi_melayu": "Dikisahkan oleh Anas bin Malik:",
    "english_text": "The Prophet (ﷺ) read the verse: \"We ordained therein for them: Life for life and eye for eye (an-nafsa bin-nafsi wal-'aynu bil-'ayn).",
    "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، حَدَّثَنَا أَبِي، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، حَدَّثَنَا يُونُسُ بْنُ يَزِيدَ، عَنْ أَبِي عَلِيِّ بْنِ يَزِيدَ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَرَأَ ‏{‏ وَكَتَبْنَا عَلَيْهِمْ فِيهَا أَنَّ النَّفْسَ بِالنَّفْسِ وَالْعَيْنُ بِالْعَيْنِ ‏}‏ ‏.‏",
    "malay_translation": "Nabi (ﷺ) membaca ayat: \"Dan Kami tetapkan bagi mereka di dalamnya (Al-Quran) bahawa nyawa dengan nyawa, dan mata dengan mata (an-nafsa bin-nafsi wal-'aynu bil-'ayn).\""
  },
  {
    "id": 24483,
    "hadith_number": 3979,
    "tajuk_hadith": "Penjelasan Ayat tentang Penciptaan Manusia dan Tindakan Nabi SAW",
    "perawi_melayu": "Abdullah bin Umar",
    "english_text": "Atiyyah ibn Sa'd al-Awfi said: I recited to Abdullah ibn Umar the verse: \"It is Allah Who created you in a state of (helplessness) weakness (min da'f).\"  He said: (Read) min du'f. I recited it to the Messenger of Allah (ﷺ) as you recited it to me, and he gripped me as I gripped you.",
    "arabic_text": "حَدَّثَنَا النُّفَيْلِيُّ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا فُضَيْلُ بْنُ مَرْزُوقٍ، عَنْ عَطِيَّةَ بْنِ سَعْدٍ الْعَوْفِيِّ، قَالَ قَرَأْتُ عَلَى عَبْدِ اللَّهِ بْنِ عُمَرَ ‏{‏ اللَّهُ الَّذِي خَلَقَكُمْ مِنْ ضَعْفٍ ‏}‏ فَقَالَ ‏{‏ مِنْ ضُعْفٍ ‏}‏ قَرَأْتُهَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم كَمَا قَرَأْتَهَا عَلَىَّ فَأَخَذَ عَلَىَّ كَمَا أَخَذْتُ عَلَيْكَ ‏.‏",
    "malay_translation": "Atiyyah ibn Sa'd al-Awfi berkata: Saya membacakan ayat, \"Allah yang menciptakan kamu dari kelemahan,\" kepada Abdullah ibn Umar. Beliau berkata, \"Bacalah 'dari kelemahan'.\" Saya membacakannya kepada Rasulullah SAW sebagaimana engkau membacakannya kepada ku, dan Baginda memegangku seperti engkau memegangku."
  },
  {
    "id": 24484,
    "hadith_number": 3980,
    "tajuk_hadith": "Tafsir Ayat \"Min Dhu'f\"",
    "perawi_melayu": "Dikisahkan oleh Abu Sa'id al-Khudri:",
    "english_text": "The Prophet (ﷺ) read the verse mentioned above, \"min du'f.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى الْقُطَعِيُّ، حَدَّثَنَا عُبَيْدٌ، - يَعْنِي ابْنَ عَقِيلٍ - عَنْ هَارُونَ، عَنْ عَبْدِ اللَّهِ بْنِ جَابِرٍ، عَنْ عَطِيَّةَ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏{‏ مِنْ ضُعْفٍ ‏}‏ ‏.‏",
    "malay_translation": "Nabi (ﷺ) membaca ayat yang disebut di atas, \"min du'f.\""
  },
  {
    "id": 24485,
    "hadith_number": 3981,
    "tajuk_hadith": "Bersyukur dan bergembira atas Nikmat dan Rahmat Allah",
    "perawi_melayu": "Dikisahkan oleh Ubayy bin Ka'b:",
    "english_text": "\"Say, in the bounty of Allah, and in His mercy- in that let you rejoice.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ أَسْلَمَ الْمِنْقَرِيِّ، عَنْ عَبْدِ اللَّهِ، عَنْ أَبِيهِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، قَالَ قَالَ أُبَىُّ بْنُ كَعْبٍ ‏{‏ بِفَضْلِ اللَّهِ وَبِرَحْمَتِهِ فَبِذَلِكَ فَلْتَفْرَحُوا ‏}‏ ‏.‏ قَالَ أَبُو دَاوُدَ بِالتَّاءِ ‏.‏",
    "malay_translation": "Katakanlah, 'Dengan kurnia dan rahmat Allah, maka bergembiralah dengan itu.'"
  },
  {
    "id": 24486,
    "hadith_number": 3982,
    "tajuk_hadith": "Kebaikan Rahmat dan Anugerah Allah SWT",
    "perawi_melayu": "Dikisahkan oleh Ibn Abzi",
    "english_text": "Ubayy ibn Ka'b berkata: Rasulullah SAW membacakan ayat: \"Katakanlah, 'Dengan kurnia Allah dan rahmat-Nya, maka bergembiralah dengannya. Yang demikian itu lebih baik daripada apa yang kamu kumpulkan.'\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا الْمُغِيرَةُ بْنُ سَلَمَةَ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، عَنِ الأَجْلَحِ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، عَنْ أُبَىٍّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَرَأَ ‏{‏ بِفَضْلِ اللَّهِ وَبِرَحْمَتِهِ فَبِذَلِكَ فَلْيَفْرَحُوا هُوَ خَيْرٌ مِمَّا تَجْمَعُونَ ‏}‏ ‏.‏",
    "malay_translation": "Ubayy ibn Ka'b meriwayatkan bahawa Rasulullah SAW membaca ayat: \"Katakanlah, 'Dengan kurnia Allah dan rahmat-Nya, maka bergembiralah dengannya. Sesungguhnya ia lebih baik daripada apa yang kamu kumpulkan.'\" (Surah Yunus: 10).  Perawi: Ibnu Abzi."
  },
  {
    "id": 24487,
    "hadith_number": 3983,
    "tajuk_hadith": "Mendengar Nabi SAW Membaca Ayat Mengenai Perbuatan Tidak Baik",
    "perawi_melayu": "Diceritakan oleh Asma' binti Yazid:",
    "english_text": "She heard the Prophet (ﷺ) read the verse: \"He acted unrighteously.\" (innahu 'amila ghayra salih).",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، أَخْبَرَنَا ثَابِتٌ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ، أَنَّهَا سَمِعَتِ النَّبِيَّ صلى الله عليه وسلم يَقْرَأُ ‏{‏ إِنَّهُ عَمِلَ غَيْرَ صَالِحٍ ‏}‏ ‏.‏",
    "malay_translation": "Beliau mendengar Rasulullah SAW membaca ayat: \"Sesungguhnya dia telah melakukan perbuatan yang tidak baik.\" (innahu 'amila ghayra salih)."
  },
  {
    "id": 24488,
    "hadith_number": 3984,
    "tajuk_hadith": "Cara Rasulullah SAW Membaca Ayat \"Amal Yang Tidak Baik\"",
    "perawi_melayu": "Umm Salamah, Ummul Mukminin",
    "english_text": "Shahr ibn Hawshab berkata: Saya bertanya kepada Umm Salamah: Bagaimana Rasulullah SAW membaca ayat ini: \"Sesungguhnya ia amalan yang tidak baik\" (innahu 'amalun ghayru salih)? Beliau menjawab: Baginda membaca: \"Sesungguhnya dia telah beramal dengan tidak baik\" (innahu 'amila ghayra salih).  Abu Dawud berkata: Hadis ini diriwayatkan oleh Harun al-Nahwi dan Musa b. Khalaf daripada Thabit, sebagaimana yang diceritakan oleh 'Abd al-Aziz.",
    "arabic_text": "حَدَّثَنَا أَبُو كَامِلٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ الْمُخْتَارِ - حَدَّثَنَا ثَابِتٌ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، قَالَ سَأَلْتُ أُمَّ سَلَمَةَ كَيْفَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم صلى الله عليه وسلم يَقْرَأُ هَذِهِ الآيَةَ ‏{‏ إِنَّهُ عَمَلٌ غَيْرُ صَالِحٍ ‏}‏ فَقَالَتْ قَرَأَهَا ‏{‏ إِنَّهُ عَمِلَ غَيْرَ صَالِحٍ ‏}‏ قَالَ أَبُو دَاوُدَ وَرَوَاهُ هَارُونُ النَّحْوِيُّ وَمُوسَى بْنُ خَلَفٍ عَنْ ثَابِتٍ كَمَا قَالَ عَبْدُ الْعَزِيزِ ‏.‏",
    "malay_translation": "Shahr bin Hawshab meriwayatkan: Aku bertanya kepada Umm Salamah, \"Bagaimana Rasulullah SAW membaca ayat ini: 'Sesungguhnya ia amalan yang tidak baik' (innahu 'amalun ghayru salih)?\" Beliau menjawab: Baginda membaca, 'Sesungguhnya dia telah beramal dengan tidak baik' (innahu 'amila ghayra salih). Abu Dawud berkata: Hadis ini diriwayatkan oleh Harun al-Nahwi dan Musa bin Khalaf daripada Thabit, seperti yang diceritakan oleh 'Abd al-Aziz."
  },
  {
    "id": 24489,
    "hadith_number": 3985,
    "tajuk_hadith": "Doa Nabi SAW dan Kesabaran Nabi Musa AS",
    "perawi_melayu": "Dikisahkan oleh Ubayy bin Ka'b:",
    "english_text": ":\n\n\n\n\n\n\nWhen the Messenger of Allah (ﷺ) prayed, he began with himself and said: May the mercy of Allah be upon us and upon Moses. If he had patience, he would have seen marvels from his Companion. But he said: \"(Moses) said: If ever I ask thee about anything after this, keep me not in they company: then wouldst thou have received (full) excuse from my side\". Hamzah lengthened it.",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا عِيسَى، عَنْ حَمْزَةَ الزَّيَّاتِ، عَنْ أَبِي إِسْحَاقَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ أُبَىِّ بْنِ كَعْبٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا دَعَا بَدَأَ بِنَفْسِهِ وَقَالَ ‏\"‏ رَحْمَةُ اللَّهِ عَلَيْنَا وَعَلَى مُوسَى لَوْ صَبَرَ لَرَأَى مِنْ صَاحِبِهِ الْعَجَبَ وَلَكِنَّهُ قَالَ ‏{‏ إِنْ سَأَلْتُكَ عَنْ شَىْءٍ بَعْدَهَا فَلاَ تُصَاحِبْنِي قَدْ بَلَغْتَ مِنْ لَدُنِي ‏}‏ ‏\"‏ ‏.‏ طَوَّلَهَا حَمْزَةُ ‏.‏",
    "malay_translation": "Rasulullah SAW apabila berdoa, baginda akan bermula dengan diri sendiri dan berdoa: Semoga rahmat Allah SWT ke atas kita dan ke atas Nabi Musa AS. Sekiranya Nabi Musa bersabar, nescaya baginda akan melihat keajaiban dari sahabatnya. Tetapi Nabi Musa berkata: \"Sekiranya aku bertanya kepadamu tentang sesuatu perkara selepas ini, maka janganlah engkau menemani aku, kerana engkau sudah mendapat alasan yang kukuh dariku.\". Hamzah mengulangi doa tersebut dengan lebih panjang."
  },
  {
    "id": 24490,
    "hadith_number": 3986,
    "tajuk_hadith": "Penjelasan tentang Bacaan Ayat Al-Quran dan Penggunaan Tashdid",
    "perawi_melayu": "Dikisahkan oleh Ubayy bin Ka'b:",
    "english_text": "The Prophet (ﷺ) read the Qur'anic verse: \"Thou hast received (full) excuse from me (min ladunni)\" and put tashdid (doubling of consonants) on nun (n).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ أَبُو عَبْدِ اللَّهِ الْعَنْبَرِيُّ، حَدَّثَنَا أُمَيَّةُ بْنُ خَالِدٍ، حَدَّثَنَا أَبُو الْجَارِيَةِ الْعَبْدِيُّ، عَنْ شُعْبَةَ، عَنْ أَبِي إِسْحَاقَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ أُبَىِّ بْنِ كَعْبٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَرَأَهَا ‏{‏ قَدْ بَلَغْتَ مِنْ لَدُنِّي ‏}‏ وَثَقَّلَهَا ‏.‏",
    "malay_translation": "Rasulullah SAW membaca ayat al-Quran: \"Sesungguhnya (sekarang) engkau telah sampai kepada (kehendak)Ku (min ladunni)\" dan meletakkan tasydid pada huruf nun (n)."
  },
  {
    "id": 24491,
    "hadith_number": 3987,
    "tajuk_hadith": "Penjelasan Bacaan Ayat ‘Di Sebuah Mata Air Keruh’",
    "perawi_melayu": "Diriwayatkan oleh Abdullah ibn Abbas:",
    "english_text": "Ubayy ibn Ka'b made me read the following verse as the Messenger of Allah (ﷺ) made him read: \"in a spring of murky water\" (fi 'aynin hami'atin) with short vowel a after h.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مَسْعُودٍ الْمِصِّيصِيُّ، حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنَا مُحَمَّدُ بْنُ دِينَارٍ، حَدَّثَنَا سَعْدُ بْنُ أَوْسٍ، عَنْ مِصْدَعٍ أَبِي يَحْيَى، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ أَقْرَأَنِي أُبَىُّ بْنُ كَعْبٍ كَمَا أَقْرَأَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏{‏ فِي عَيْنٍ حَمِئَةٍ ‏}‏ مُخَفَّفَةً ‏.‏",
    "malay_translation": "Ubayy bin Ka'ab telah membacakan ayat berikut kepada saya sepertimana yang dibaca oleh Rasulullah SAW:  \"Di sebuah mata air keruh\" (fi 'aynin hami'atin) dengan harakat pendek (fathah) di huruf h. "
  },
  {
    "id": 24492,
    "hadith_number": 3988,
    "tajuk_hadith": "Terserlah Cahaya Syurga kepada Ahli 'Illiyyin",
    "perawi_melayu": "Dikisahkan oleh Abu Sa'id al-Khudri",
    "english_text": "The Prophet (ﷺ) said: A man from the Illiyyun will look downwards at the people of Paradise and Paradise will be glittering as if it were a brilliant star. \n\n\n\n\n\nHe (the narrator) said: In this way the word durri (brilliant) occurs in this tradition, i.e. the letter dal (d) has short vowel u and it has no hamzah ('). AbuBakr and Umar will be of them and will have some additional blessings.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ الْفَضْلِ، حَدَّثَنَا وُهَيْبٌ، - يَعْنِي ابْنَ عَمْرٍو النَّمَرِيَّ - أَخْبَرَنَا هَارُونُ، أَخْبَرَنِي أَبَانُ بْنُ تَغْلِبَ، عَنْ عَطِيَّةَ الْعَوْفِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ الرَّجُلَ مِنْ أَهْلِ عِلِّيِّينَ لَيُشْرِفُ عَلَى أَهْلِ الْجَنَّةِ فَتُضِيءُ الْجَنَّةُ لِوَجْهِهِ كَأَنَّهَا كَوْكَبٌ دُرِّيٌّ ‏\"‏ ‏.‏ قَالَ وَهَكَذَا جَاءَ الْحَدِيثُ ‏\"‏ دُرِّيٌّ ‏\"‏ ‏.‏ مَرْفُوعَةُ الدَّالِ لاَ تُهْمَزُ ‏\"‏ وَإِنَّ أَبَا بَكْرٍ وَعُمَرَ لَمِنْهُمْ وَأَنْعَمَا ‏\"‏ ‏.‏",
    "malay_translation": "Daripada perawi yang meriwayatkan kisah ini: Rasulullah SAW bersabda, \"Sesungguhnya seseorang dari kalangan ahli 'Illiyyun akan memandang ke bawah kepada penghuni Syurga, lalu Syurga akan bercahaya di wajahnya bagaikan bintang yang berkilauan (durri).\" Dikatakan, penggunaan perkataan 'durri' (berkilauan) dalam hadis ini, iaitu huruf dal (d) diiringi bunyi pendek 'u' dan tidak ada hamzah ('). Dan sesungguhnya Abu Bakar dan Umar termasuk di antara mereka dan mendapat tambahan nikmat."
  },
  {
    "id": 24493,
    "hadith_number": 3989,
    "tajuk_hadith": "Penjelasan Mengenai Saba' dan Asalnya",
    "perawi_melayu": "Farwah ibn Musayk al-Ghutayfi",
    "english_text": "I came to the Prophet (ﷺ). He then narrated the rest of the tradition.\n\n\nA man from the people said: \"Messenger of Allah! tell us about Saba'; what is it: land or woman? He replied: It is neither land nor woman; it is a man to whom ten children of the Arabs were born: six of them lived in the Yemen and four lived in Syria.\n\nThe narrator Uthman said al-Ghatafani instead of al-Ghutayfi. He said: It has been transmitted to us by al-Hasan ibn al-Hakam an-Nakha'i.",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَهَارُونُ بْنُ عَبْدِ اللَّهِ، قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنِي الْحَسَنُ بْنُ الْحَكَمِ النَّخَعِيُّ، حَدَّثَنَا أَبُو سَبْرَةَ النَّخَعِيُّ، عَنْ فَرْوَةَ بْنِ مُسَيْكٍ الْغُطَيْفِيِّ، قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَذَكَرَ الْحَدِيثَ فَقَالَ رَجُلٌ مِنَ الْقَوْمِ يَا رَسُولَ اللَّهِ أَخْبِرْنَا عَنْ سَبَإٍ مَا هُوَ أَرْضٌ أَمِ امْرَأَةٌ فَقَالَ ‏\n\"‏ لَيْسَ بِأَرْضٍ وَلاَ امْرَأَةٍ وَلَكِنَّهُ رَجُلٌ وَلَدَ عَشَرَةً مِنَ الْعَرَبِ فَتَيَامَنَ سِتَّةٌ وَتَشَاءَمَ أَرْبَعَةٌ ‏\"‏ ‏.‏ قَالَ عُثْمَانُ الْغَطَفَانِيِّ مَكَانَ الْغُطَيْفِيِّ وَقَالَ حَدَّثَنَا الْحَسَنُ بْنُ الْحَكَمِ النَّخَعِيُّ ‏.‏",
    "malay_translation": "Saya datang kepada Nabi SAW. Baginda kemudiannya menceritakan hadis tersebut.\n\nKemudian seorang lelaki dari kalangan jemaah bertanya, \"Wahai Rasulullah, beritahu kami tentang Saba'; adakah ia sebuah negeri atau seorang wanita?\" Baginda menjawab, \"Bukan negeri dan bukan juga wanita, tetapi seorang lelaki yang melahirkan sepuluh orang anak daripada kalangan orang Arab. Enam daripadanya menetap di Yaman dan empat lagi di Syria.\"\n\nPerawi Uthman menyebut al-Ghatafani sebagai ganti al-Ghutayfi. Beliau juga berkata: Hadis ini telah disampaikan kepada kami oleh al-Hasan ibn al-Hakam an-Nakha'i."
  },
  {
    "id": 24494,
    "hadith_number": 3990,
    "tajuk_hadith": "Perihal Turunnya Wahyu dan Penghilangan Ketakutan dari Hati",
    "perawi_melayu": "Dikisahkan oleh Abu Hurairah",
    "english_text": "The Prophet (ﷺ) as saying - the narrator Isma'il transmitted it from Abu Hurairah, and mentioned the tradition about the coming down of revelation-: \"So far (is this the case) that when terror is removed from their hearts.\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ، وَإِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ أَبُو مَعْمَرٍ الْهُذَلِيُّ، عَنْ سُفْيَانَ، عَنْ عَمْرٍو، عَنْ عِكْرِمَةَ، قَالَ حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم - قَالَ إِسْمَاعِيلُ عَنْ أَبِي هُرَيْرَةَ رِوَايَةً - فَذَكَرَ حَدِيثَ الْوَحْىِ قَالَ فَذَلِكَ قَوْلُهُ تَعَالَى ‏{‏ حَتَّى إِذَا فُزِّعَ عَنْ قُلُوبِهِمْ ‏}‏ ‏.‏",
    "malay_translation": "Nabi SAW bersabda – perawi Isma'il meriwayatkan daripada Abu Hurairah, dan menyebut hadis tentang turunnya wahyu: \"Sehingga apabila ketakutan dihilangkan dari hati mereka.\""
  },
  {
    "id": 24495,
    "hadith_number": 3991,
    "tajuk_hadith": "Penolakan dan Ketinggian Hati terhadap Ayat-ayat Allah SWT",
    "perawi_melayu": "Umm Salamah, isteri Nabi SAW",
    "english_text": "The reading of the following verse by the Prophet (ﷺ) goes: \"Nay, but there came to thee (ja'atki) my signs, and thou didst reject them (fakadhdhabti biha) ; thou wast haughty (wastakbarti) and became one of those who reject Faith (wa kunti).\n\n\nAbu Dawud said: This is a mursal tradition, i.e. the link of the Companion has been omitted, for the narrator al-Rabi' did not meet Umm Salamah.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ النَّيْسَابُورِيُّ، حَدَّثَنَا إِسْحَاقُ بْنُ سُلَيْمَانَ الرَّازِيُّ، سَمِعْتُ أَبَا جَعْفَرٍ، يَذْكُرُ عَنِ الرَّبِيعِ بْنِ أَنَسٍ، عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ قِرَاءَةُ النَّبِيِّ صلى الله عليه وسلم ‏{‏ بَلَى قَدْ جَاءَتْكِ آيَاتِي فَكَذَّبْتِ بِهَا وَاسْتَكْبَرْتِ وَكُنْتِ مِنَ الْكَافِرِينَ ‏}‏ قَالَ أَبُو دَاوُدَ هَذَا مُرْسَلٌ الرَّبِيعُ لَمْ يُدْرِكْ أُمَّ سَلَمَةَ ‏.‏",
    "malay_translation": "Bacaan ayat berikut oleh Nabi SAW: \"Sungguh, telah datang kepadamu tanda-tanda-Ku, tetapi engkau mendustakannya; engkau bersikap sombong dan menjadi salah seorang yang kafir.\"\n\nAbu Dawud berkata: Hadis ini mursal, iaitu hubungan dengan sahabat telah terputus, kerana perawi al-Rabi' tidak pernah bertemu dengan Umm Salamah."
  },
  {
    "id": 24496,
    "hadith_number": 3992,
    "tajuk_hadith": "Ketenangan dan Kebahagiaan yang Dijanjikan Rasulullah SAW",
    "perawi_melayu": "Dikisahkan oleh Aisyah, Ummul Mukminin:",
    "english_text": "I heard the Messenger of Allah (ﷺ) read: \"(There is for him) Rest and satisfaction\" (faruhun wa rayhan).",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هَارُونُ بْنُ مُوسَى النَّحْوِيُّ، عَنْ بُدَيْلِ بْنِ مَيْسَرَةَ، عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ، عَنْ عَائِشَةَ، - رضى الله تعالى عنها - قَالَتْ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقْرَؤُهَا ‏{‏ فَرُوحٌ وَرَيْحَانٌ ‏}‏ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW membaca: \"(Baginya) ketenangan dan kesejahteraan.\" (faruhun wa rayhan)."
  },
  {
    "id": 24497,
    "hadith_number": 3993,
    "tajuk_hadith": "Penjelasan Ayat \"Mereka Menjerit: Wahai Malik\"",
    "perawi_melayu": "Safwan bin Ya'la, meriwayatkan daripada bapanya berkata:",
    "english_text": "I heard the Prophet (ﷺ) read on the pulpit the verse: \"They will cry: O Malik.\"\n\n\nAbu Dawud said: That is, without shortening the name (Malik).",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، وَأَحْمَدُ بْنُ عَبْدَةَ، قَالاَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ عَطَاءٍ، - قَالَ ابْنُ حَنْبَلٍ لَمْ أَفْهَمْهُ جَيِّدًا - عَنْ صَفْوَانَ، - قَالَ ابْنُ عَبْدَةَ ابْنِ يَعْلَى - عَنْ أَبِيهِ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم عَلَى الْمِنْبَرِ يَقْرَأُ ‏{‏ وَنَادَوْا يَا مَالِكُ ‏}‏ ‏.‏ قَالَ أَبُو دَاوُدَ يَعْنِي بِلاَ تَرْخِيمٍ ‏.‏",
    "malay_translation": "Aku mendengar Nabi SAW membaca di atas mimbar ayat, \"Mereka akan menjerit: Wahai Malik.\"  Abu Dawud berkata: Maksudnya tanpa memendekkan nama (Malik)."
  },
  {
    "id": 24498,
    "hadith_number": 3994,
    "tajuk_hadith": "Kesejahteraan dan Kekuasaan Allah SWT dalam Memberi Rezeki",
    "perawi_melayu": "Dikisahkan oleh Abdullah bin Mas'ud",
    "english_text": "The Messenger of Allah (ﷺ) made me read the verse \"It is I who give (all) sustenance, Lord of power, steadfast (for ever).\"",
    "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، أَخْبَرَنَا أَبُو أَحْمَدَ، أَخْبَرَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ عَبْدِ اللَّهِ، قَالَ أَقْرَأَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏{‏ إِنِّي أَنَا الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ ‏}‏ ‏.‏",
    "malay_translation": "Rasulullah SAW menjadikan saya membaca ayat, \"Sesungguhnya Aku lah Pemberi rezeki, Yang Maha Perkasa, Yang Maha Kokoh.\" "
  },
  {
    "id": 24499,
    "hadith_number": 3995,
    "tajuk_hadith": "Cara Nabi SAW Membaca Ayat \"Hahal Min Muddakir\"",
    "perawi_melayu": "Dikisahkan oleh Abdullah ibn Mas'ud",
    "english_text": "Nabi (ﷺ) sering membaca ayat \"Adakah sesiapa yang mahu menerima nasihat (muddakir)?\" dengan pengulangan huruf konsonan.\n\nAbu Dawud berkata: Perkataan muddakir boleh dilafazkan dengan huruf mim (m) dengan vokal pendek u, dal (d) dengan vokal pendek a, dan kaf (k) dengan vokal pendek i.",
    "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ، عَنْ عَبْدِ اللَّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقْرَؤُهَا ‏{‏ فَهَلْ مِنْ مُدَّكِرٍ ‏}‏ يَعْنِي مُثَقَّلاً ‏.‏ قَالَ أَبُو دَاوُدَ مَضْمُومَةَ الْمِيمِ مَفْتُوحَةَ الدَّالِ مَكْسُورَةَ الْكَافِ ‏.‏",
    "malay_translation": "Nabi SAW pernah membaca ayat \"Adakah sesiapa yang mahu menerima nasihat (muddakir)?\" dengan pengulangan huruf konsonan. Abu Dawud menjelaskan bahawa perkataan \"muddakir\" boleh dilafazkan dengan huruf mim (m) dengan bunyi vokal pendek u, dal (d) dengan bunyi vokal pendek a, dan kaf (k) dengan bunyi vokal pendek i."
  },
  {
    "id": 24500,
    "hadith_number": 3996,
    "tajuk_hadith": "Kefaian Harta dan Keabadiannya",
    "perawi_melayu": "Dikisahkan oleh Jabir bin Abdullah:",
    "english_text": "I saw the Prophet (ﷺ) reading the verse; \"does he think that his wealth would make him last for ever?\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَبْدِ الرَّحْمَنِ الذِّمَارِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنِي مُحَمَّدُ بْنُ الْمُنْكَدِرِ، عَنْ جَابِرٍ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَقْرَأُ ‏{‏ يَحْسَبُ أَنَّ مَالَهُ أَخْلَدَهُ ‏}‏",
    "malay_translation": "Saya melihat Rasulullah SAW membaca ayat; \"Adakah dia menyangka bahawa hartanya akan kekal abadi?\"."
  },
  {
    "id": 24501,
    "hadith_number": 3997,
    "tajuk_hadith": "Kisah Nabi SAW Membaca Ayat Azab Allah yang Berat",
    "perawi_melayu": "Diceritakan oleh Abu Qilabah:",
    "english_text": "Bahawa Rasulullah SAW memerintahkan seorang lelaki membaca ayat: \"Sesungguhnya pada hari itu, tiada sesiapa yang akan dihukum seperti hukuman-Nya, dan tiada sesiapa yang akan diikat dengan ikatan-Nya.\"",
    "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ خَالِدٍ، عَنْ أَبِي قِلاَبَةَ، عَمَّنْ أَقْرَأَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏{‏ فَيَوْمَئِذٍ لاَ يُعَذَّبُ عَذَابَهُ أَحَدٌ * وَلاَ يُوثَقُ وَثَاقَهُ أَحَدٌ ‏}‏ ‏.‏ قَالَ أَبُو دَاوُدَ بَعْضُهُمْ أَدْخَلَ بَيْنَ خَالِدٍ وَأَبِي قِلاَبَةَ رَجُلاً ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Hafsh bin Umar, telah menceritakan kepada kami Syu'bah, daripada Khalid, daripada Abu Qilabah, bahawa Rasulullah SAW memerintahkan seseorang untuk membaca ayat: \"Sesungguhnya pada hari itu, tiada seorang pun akan dihukum dengan hukuman-Nya, dan tiada seorang pun yang akan diikat dengan ikatan-Nya.\"\n\nKemudian Abu Daud berkata: Sesetengah ulama memasukkan seseorang di antara Khalid dan Abu Qilabah."
  },
  {
    "id": 24502,
    "hadith_number": 3998,
    "tajuk_hadith": "Hukum Azab dan Ikatan pada Hari Kiamat",
    "perawi_melayu": "Dikisahkan oleh Abu Qilabah:",
    "english_text": "A man whom the Prophet (ﷺ) made the following verse read informed me, or he was informed by a man whom a man made the following verse read through a man whom the Prophet (ﷺ) made the following verse read: \"For, that day His chastisement will be such as none (else) can be inflicted (la yu'adhdhabu)\n\n \nAbu Dawud said: 'Asim, al-A'mash, Talhah b. Musarrif, Abu Ja'far Yazid b. al-Qa'qa', Shaibah b. Nassah, Nafi' b. 'Abd al-Rahman, 'Abd Allah b. Kathir al-Dari, Abu 'Amr b. al-'Ala', Hamzat al-Zayyat, 'Abd al-Rahman al-A'raj, Qatadah, al-Hasan al-Basri, Mujahid, Hamid al=A'raj, Abd Allah b. 'Abbas and 'Abd al-Rahman b. Abi Bakr recited: \"For,that day His chastisement will be such as none (else) can inflict (la ya'adhdhibu), and His bonds will be such as none (other) can bind (wa la yathiqu), except the verse mentioned in this tradition from the Prophet (ﷺ). It has een read yu'adhdhabu with short vowel a in passive voice.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، حَدَّثَنَا حَمَّادٌ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلاَبَةَ، قَالَ أَنْبَأَنِي مَنْ، أَقْرَأَهُ النَّبِيُّ صلى الله عليه وسلم أَوْ مَنْ أَقْرَأَهُ مَنْ أَقْرَأَهُ النَّبِيُّ صلى الله عليه وسلم ‏{‏ فَيَوْمَئِذٍ لاَ يُعَذَّبُ ‏}‏ ‏.‏ قَالَ أَبُو دَاوُدَ قَرَأَ عَاصِمٌ وَالأَعْمَشُ وَطَلْحَةُ بْنُ مُصَرِّفٍ وَأَبُو جَعْفَرٍ يَزِيدُ بْنُ الْقَعْقَاعِ وَشَيْبَةُ بْنُ نَصَّاحٍ وَنَافِعُ بْنُ عَبْدِ الرَّحْمَنِ وَعَبْدُ اللَّهِ بْنُ كَثِيرٍ الدَّارِيُّ وَأَبُو عَمْرِو بْنِ الْعَلاَءِ وَحَمْزَةُ الزَّيَّاتُ وَعَبْدُ الرَّحْمَنِ الأَعْرَجُ وَقَتَادَةُ وَالْحَسَنُ الْبَصْرِيُّ وَمُجَاهِدٌ وَحُمَيْدٌ الأَعْرَجُ وَعَبْدُ اللَّهِ بْنُ عَبَّاسٍ وَعَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرٍ ‏{‏ لاَ يُعَذِّبُ ‏}‏ ‏{‏ وَلاَ يُوثِقُ ‏}‏ إِلاَّ الْحَدِيثَ الْمَرْفُوعَ فَإِنَّهُ ‏{‏ يُعَذَّبُ ‏}‏ بِالْفَتْحِ ‏.‏",
    "malay_translation": "Diceritkan oleh Abu Qilabah, bahawa seorang lelaki yang telah dibacakan ayat tersebut oleh Nabi SAW telah memberitahuku, atau dia diberitahu oleh seorang lelaki yang dibacakan oleh seorang lelaki yang telah dibacakan oleh Nabi SAW: \"Sesungguhnya pada hari itu, azab-Nya tidak akan ditimpakan kepada sesiapapun (la yu'adhdhabu).\"  Abu Dawud berkata: 'Asim, al-A'mash, Talhah bin Musarrif, Abu Ja'far Yazid bin al-Qa'qa', Shaibah bin Nassah, Nafi' bin 'Abd al-Rahman, 'Abd Allah bin Kathir al-Dari, Abu 'Amr bin al-'Ala', Hamzah al-Zayyat, 'Abd al-Rahman al-A'raj, Qatadah, al-Hasan al-Basri, Mujahid, Hamid al-A'raj, 'Abd Allah bin 'Abbas dan 'Abd al-Rahman bin Abi Bakr telah membacanya dengan sebutan: \"Pada hari itu, Dia tidak akan menyeksa (la ya'adhdhibu), dan ikatan-Nya tidak akan diikat oleh sesiapapun (wa la yathiqu), kecuali hadis yang diriwayatkan dari Nabi SAW.  Ia dibaca sebagai yu'adhdhabu dengan vokal pendek a dalam bentuk pasif."
  },
  {
    "id": 24503,
    "hadith_number": 3999,
    "tajuk_hadith": "Penjelasan Nabi SAW Mengenai Nama Jibril dan Mikail",
    "perawi_melayu": "Dikisahkan oleh Abu Sa'id al-Khudri",
    "english_text": "The Messenger of Allah (ﷺ) related a tradition in which he mentioned the words \"Jibril and Mikal\" and he pronounced them \"Jibra'ila wa Mika'ila.\"\n\n\n\n\nAbu Dawud said: Khalaf said: I did not put the pen aside from writing letters (huruf) for forty years: nothing tired me (or made me incapable of writing), even Jibril and Mika'il did not tire me.",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْعَلاَءِ، أَنَّ مُحَمَّدَ بْنَ أَبِي عُبَيْدَةَ، حَدَّثَهُمْ قَالَ حَدَّثَنَا أَبِي، عَنِ الأَعْمَشِ، عَنْ سَعْدٍ الطَّائِيِّ، عَنْ عَطِيَّةَ الْعَوْفِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ حَدَّثَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَدِيثًا ذَكَرَ فِيهِ ‏\n\"‏ جِبْرِيلَ وَمِيكَالَ ‏\"‏ ‏.‏ فَقَرَأَ ‏{‏ جِبْرَائِلَ وَمِيكَائِلَ ‏}‏ ‏.‏ قَالَ أَبُو دَاوُدَ قَالَ خَلَفٌ مُنْذُ أَرْبَعِينَ سَنَةً لَمْ أَرْفَعِ الْقَلَمَ عَنْ كِتَابَةِ الْحُرُوفِ مَا أَعْيَانِي شَىْءٌ مَا أَعْيَانِي جِبْرَائِلُ وَمِيكَائِلُ ‏.‏",
    "malay_translation": "Rasulullah SAW meriwayatkan satu hadis yang menyebut nama Jibril dan Mikail, dan beliau menyebutnya sebagai Jibra'ila dan Mika'ila.\n\nAbu Dawud meriwayatkan perkataan Khalaf, \"Selama empat puluh tahun aku tidak meletakkan pen dari menulis huruf-huruf, tiada apa yang membuatku letih, bahkan Jibril dan Mikail pun tidak membuatku letih.\""
  },
  {
    "id": 24504,
    "hadith_number": 4000,
    "tajuk_hadith": "Perihal Malaikat Jibril dan Mikail Bersama Pemberi Isyarat (Sahib As-Sur)",
    "perawi_melayu": "Dikisahkan oleh Abu Sa'id al-Khudri",
    "english_text": "The Messenger of Allah (ﷺ) mentioned the name of the one who will sound the trumpet (sahib as-sur) and said: On his right will be Jibra'il and on his left will be Mika'il.",
    "arabic_text": "حَدَّثَنَا زَيْدُ بْنُ أَخْزَمَ، حَدَّثَنَا بِشْرٌ، - يَعْنِي ابْنَ عُمَرَ - حَدَّثَنَا مُحَمَّدُ بْنُ خَازِمٍ، قَالَ ذُكِرَ كَيْفَ قِرَاءَةُ جِبْرَائِلَ وَمِيكَائِلَ عِنْدَ الأَعْمَشِ فَحَدَّثَنَا الأَعْمَشُ عَنْ سَعْدٍ الطَّائِيِّ عَنْ عَطِيَّةَ الْعَوْفِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ ذَكَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم صَاحِبَ الصُّورِ فَقَالَ ‏\n\"‏ عَنْ يَمِينِهِ جِبْرَائِلُ وَعَنْ يَسَارِهِ مِيكَائِلُ ‏\"‏ ‏.‏",
    "malay_translation": "Utusan Allah (ﷺ) menyebut nama orang yang akan meniup sangkakala (sahib as-sur) dan bersabda: Di sebelah kanannya ada Jibril dan di sebelah kirinya ada Mikail."
  },
  {
    "id": 24505,
    "hadith_number": 4001,
    "tajuk_hadith": "Keutamaan Membaca Ayat \"Malik Yawmid-Dīn\"",
    "perawi_melayu": "Dikisahkan oleh Ibn al-Musayyab",
    "english_text": "The Prophet (ﷺ), AbuBakr, Umar and Uthman used to read \"maliki yawmid-din (master of the Day of Judgment)\". The first to read maliki yawmid-din was Marwan.\n\n\n\nAbu Dawud said: This is sounder that the tradition which transmitted by al-Zuhri from Anas, and al-Zuhri from Salim, from his father (Ibn 'Umar).",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، قَالَ مَعْمَرٌ وَرُبَّمَا ذَكَرَ ابْنَ الْمُسَيَّبِ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم وَأَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ يَقْرَءُونَ ‏{‏ مَالِكِ يَوْمِ الدِّينِ ‏}‏ وَأَوَّلُ مَنْ قَرَأَهَا ‏{‏ مَلِكِ يَوْمِ الدِّينِ ‏}‏ مَرْوَانُ ‏.‏ قَالَ أَبُو دَاوُدَ هَذَا أَصَحُّ مِنْ حَدِيثِ الزُّهْرِيِّ عَنْ أَنَسٍ وَالزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ ‏.‏",
    "malay_translation": "Rasulullah SAW, Abu Bakar, Umar, dan Uthman pernah membaca ayat \"Malik Yawmid-Dīn (Pemilik Hari Pembalasan)\". Marwan ialah orang pertama yang membacanya.\n\nAbu Dawud berkata: Hadis ini lebih sahih berbanding hadis yang disampaikan oleh al-Zuhri daripada Anas, dan al-Zuhri daripada Salim, daripada bapanya (Ibn 'Umar)."
  },
  {
    "id": 24506,
    "hadith_number": 4002,
    "tajuk_hadith": "Cara Rasulullah SAW Membaca Ayat Pembukaan Al-Quran",
    "perawi_melayu": "Umm Salamah, Ummul Mukminin",
    "english_text": "The Messenger of Allah (ﷺ) used to recite: \"In the name of Allah, the Cherisher and Sustainer of the worlds; most Gracious, most Merciful; Master of the Day of Judgment,\" breaking its recitation into verses, one after another.\n\n\n\nAbu Dawud said: I heard Ahmad (b. Hanbal) say: The early reading is: Maliki yawmi'l-din.",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى الأُمَوِيُّ، حَدَّثَنِي أَبِي، حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، عَنْ أُمِّ سَلَمَةَ، أَنَّهَا ذَكَرَتْ - أَوْ كَلِمَةً غَيْرَهَا - قِرَاءَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏{‏ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ * الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ * الرَّحْمَنِ الرَّحِيمِ * مَلِكِ يَوْمِ الدِّينِ ‏}‏ يَقْطَعُ قِرَاءَتَهُ آيَةً آيَةً ‏.‏ قَالَ أَبُو دَاوُدَ سَمِعْتُ أَحْمَدَ يَقُولُ الْقِرَاءَةُ الْقَدِيمَةُ ‏{‏ مَالِكِ يَوْمِ الدِّينِ ‏}‏ ‏.‏",
    "malay_translation": "Rasulullah SAW biasanya membaca ayat pembukaan al-Quran, iaitu \"Dengan nama Allah, Yang Maha Pemurah lagi Maha Penyayang, Tuhan sekalian alam; Yang Maha Pemurah lagi Maha Penyayang; Pemilik Hari Pembalasan\", dengan memecah bacaannya ayat demi ayat.\n\nAbu Dawud berkata: Aku mendengar Ahmad (bin Hanbal) berkata: Bacaan awal ialah: Maliki yawmi'l-din."
  },
  {
    "id": 24507,
    "hadith_number": 4003,
    "tajuk_hadith": "Ketahui Tempat Matahari Terbenam Menurut Rasulullah SAW",
    "perawi_melayu": "Dikisahkan oleh Abu Dzar RA",
    "english_text": "I was sitting behind the Messenger of Allah (ﷺ) who was riding a donkey while the sun was setting. He asked: Do you know where this sets ? I replied: Allah and his Apostle know best. He said: It sets in a spring of warm water (Hamiyah).",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَعُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ، - الْمَعْنَى - قَالاَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ سُفْيَانَ بْنِ حُسَيْنٍ، عَنِ الْحَكَمِ بْنِ عُتَيْبَةَ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي ذَرٍّ، قَالَ كُنْتُ رَدِيفَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ عَلَى حِمَارٍ وَالشَّمْسُ عِنْدَ غُرُوبِهَا فَقَالَ ‏\"‏ هَلْ تَدْرِي أَيْنَ تَغْرُبُ هَذِهِ ‏\"‏ ‏.‏ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏\"‏ فَإِنَّهَا تَغْرُبُ فِي عَيْنِ حَامِيَةٍ ‏\"‏ ‏.‏",
    "malay_translation": "Aku pernah duduk di belakang Rasulullah SAW ketika baginda menaiki unta sambil matahari hampir terbenam. Baginda bertanya, \"Tahukah engkau di mana matahari terbenam ini?\" Aku menjawab, \"Allah dan Rasul-Nya lebih mengetahui.\" Baginda bersabda, \"Ia terbenam di mata air yang panas (Hamiyah).\""
  },
  {
    "id": 24508,
    "hadith_number": 4004,
    "tajuk_hadith": "Ayat Teragung dalam Al-Quran",
    "perawi_melayu": "Dikisahkan oleh Ibn al-Asqa':",
    "english_text": "The Prophet (ﷺ) came to them in the swelling place of immigrants and a man asked him: Which is the greatest verse of the Qur'an ? The Prophet (ﷺ) replied: Allah, there is no god but He - the Living, the Self-Subsisting Eternal. No slumber can seize Him nor sleep.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، حَدَّثَنَا حَجَّاجٌ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي عُمَرُ بْنُ عَطَاءٍ، أَنَّ مَوْلًى، لاِبْنِ الأَسْقَعِ - رَجُلَ صِدْقٍ - أَخْبَرَهُ عَنِ ابْنِ الأَسْقَعِ أَنَّهُ سَمِعَهُ يَقُولُ إِنَّ النَّبِيَّ صلى الله عليه وسلم جَاءَهُمْ فِي صُفَّةِ الْمُهَاجِرِينَ فَسَأَلَهُ إِنْسَانٌ أَىُّ آيَةٍ فِي الْقُرْآنِ أَعْظَمُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ ‏{‏ اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَىُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ ‏}‏ ‏\"‏ ‏.‏",
    "malay_translation": "Nabi SAW datang kepada mereka di tempat kediaman para Muhajirin. Seorang lelaki bertanya, \"Ayat manakah yang paling agung dalam Al-Quran?\" Nabi SAW menjawab, \"Allah, tiada Tuhan melainkan Dia, Yang Hidup, Yang Kekal. Tidak menguasainya kantuk atau tidur.\""
  },
  {
    "id": 24509,
    "hadith_number": 4005,
    "tajuk_hadith": "Perbezaan Bacaan Ayat 'Haiya laka'",
    "perawi_melayu": "Dikisahkan oleh Shariq:",
    "english_text": "Ibn Mas'ud said read the verse: \"Now come, thou\" (haita laka). Then Shariq said: We read it, \"hi'tu laka\" (I am prepared for thee). Ibn Mas'ud said: I read it as I have been taught ; it is dearer to me.",
    "arabic_text": "حَدَّثَنَا أَبُو مَعْمَرٍ عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ أَبِي الْحَجَّاجِ الْمِنْقَرِيُّ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا شَيْبَانُ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنِ ابْنِ مَسْعُودٍ، أَنَّهُ قَرَأَ ‏{‏ هَيْتَ لَكَ ‏}‏ فَقَالَ شَقِيقٌ إِنَّا نَقْرَؤُهَا ‏{‏ هِئْتُ لَكَ ‏}‏ يَعْنِي فَقَالَ ابْنُ مَسْعُودٍ أَقْرَؤُهَا كَمَا عُلِّمْتُ أَحَبُّ إِلَىَّ ‏.‏",
    "malay_translation": "Ibnu Mas'ud menceritakan bahawa beliau membaca ayat: \"Haiya laka\" (Marilah, wahai engkau!). Kemudian, Shariq berkata: Kami membacanya sebagai \"Hi'tu laka\" (Aku bersedia untukmu). Ibnu Mas'ud berkata: Aku membacanya seperti yang telah diajar kepadaku; ia lebih aku cintai."
  },
  {
    "id": 24510,
    "hadith_number": 4006,
    "tajuk_hadith": "Perbezaan Bacaan Ayat al-Quran dan Keutamaan Pengajaran Asas",
    "perawi_melayu": "Dikisahkan oleh Shariq",
    "english_text": "'Abd Allah (b. Mas'ud) was told that the people had read this verse: \"She said: Now come, thou\" (hita laka). He said: I read it as I have been taught ; it is dearer to me. It goes \"wa qalat haita laka\" (She said: Now come thou).",
    "arabic_text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، قَالَ قِيلَ لِعَبْدِ اللَّهِ إِنَّ أُنَاسًا يَقْرَءُونَ هَذِهِ الآيَةَ ‏{‏ وَقَالَتْ هِيتَ لَكَ ‏}‏ فَقَالَ إِنِّي أَقْرَأُ كَمَا عُلِّمْتُ أَحَبُّ إِلَىَّ ‏{‏ وَقَالَتْ هَيْتَ لَكَ ‏}‏ ‏.‏",
    "malay_translation": "Dikatakan kepada 'Abd Allah (b. Mas'ud) bahawa ada segolongan orang yang membaca ayat ini: \"Dia berkata: Sekarang datanglah engkau\" (hita laka). Beliau menjawab: Aku membacanya seperti yang diajar kepadaku; ia lebih aku sukai. Ia sepatutnya \"wa qalat haita laka\" (Dia berkata: Sekarang datanglah engkau)."
  },
  {
    "id": 24511,
    "hadith_number": 4007,
    "tajuk_hadith": "Petunjuk Masuk Syurga dengan Kerendahan Hati",
    "perawi_melayu": "Dikisahkan oleh Abu Sa’id Al-Khudri",
    "english_text": "The Messenger of Allah (ﷺ) said: Allah, the Exalted, said to the children of Israel : \"... but enter the gate with humility, in posture and in words, and you will be forgiven your faults (tughfar lakum)\".",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، قَالَ حَدَّثَنَا ح، وَحَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنَا هِشَامُ بْنُ سَعْدٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَالَ اللَّهُ عَزَّ وَجَلَّ لِبَنِي إِسْرَائِيلَ ‏{‏ ادْخُلُوا الْبَابَ سُجَّدًا وَقُولُوا حِطَّةٌ تُغْفَرْ لَكُمْ خَطَايَاكُمْ ‏}‏ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: Allah SWT berfirman kepada Bani Israil, \"... masuklah ke pintu gerbang dengan merendahkan diri, dalam sikap dan perkataan, dan dosa-dosa kalian akan diampuni (tughfar lakum).\" "
  },
  {
    "id": 24512,
    "hadith_number": 4008,
    "tajuk_hadith": "Hadis yang Disampaikan dengan Rantaian Perawi yang Berbeza",
    "perawi_melayu": "Hisham bin Sa'd",
    "english_text": "The tradition mentioned above has also been transmitted by Hisham b. Sa'd with a different chain of narrators in a similar way.",
    "arabic_text": "حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، عَنْ هِشَامِ بْنِ سَعْدٍ، بِإِسْنَادِهِ مِثْلَهُ ‏.‏",
    "malay_translation": "Hadis yang disebut di atas juga telah disampaikan oleh Hisham bin Sa'd dengan rantaian perawi yang berbeza, dengan cara yang serupa."
  },
  {
    "id": 24513,
    "hadith_number": 4009,
    "tajuk_hadith": "Turunnya Wahyu dan Penjelasan Ayat \"Surah yang Kami Turunkan dan Kami Perintahkan\"",
    "perawi_melayu": "Dikisahkan oleh 'Aisyah رضي الله عنها",
    "english_text": "The revelation came down to Messenger of Allah (ﷺ) and he recited to is: \"A surah which We have sent down and which We have ordained (faradnaha)\"\n\n\nAbu Dawud said: The letter ra (r) is the word faradnaha has short vowel a (with out doubling of consonant r), and then he reached the verses after this verse.",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ، - رضى الله عنها - قَالَتْ نَزَلَ الْوَحْىُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَرَأَ عَلَيْنَا ‏{‏ سُورَةٌ أَنْزَلْنَاهَا وَفَرَضْنَاهَا ‏}‏ ‏.‏ قَالَ أَبُو دَاوُدَ يَعْنِي مُخَفَّفَةً حَتَّى أَتَى عَلَى هَذِهِ الآيَاتِ ‏.‏",
    "malay_translation": "Wahyu telah turun kepada Rasulullah SAW dan Baginda membacakan kepada kami: \"Surah yang Kami turunkan dan Kami perintahkan (faradnaha).\" \n\nAbu Dawud berkata: Huruf ra (r) pada kata faradnaha dibaca pendek (dengan harakat fathah) dan kemudian Baginda sampai kepada ayat-ayat yang berikutnya."
  }
]