[
  {
    "id": 31657,
    "hadith_number": 1824,
    "tajuk_hadith": "Sumpah Nabi SAW dengan Nama Allah",
    "perawi_melayu": "Dikatakan oleh Rifa'ah al-Juhani, bahawa:",
    "english_text": "\"When the Prophet (ﷺ) took an oath he would say: 'By the One in Whose Hand is the soul of Muhammad.\"'",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ مُصْعَبٍ، عَنِ الأَوْزَاعِيِّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ هِلاَلِ بْنِ أَبِي مَيْمُونَةَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ رِفَاعَةَ الْجُهَنِيِّ، قَالَ كَانَ النَّبِيُّ ـ صلى الله عليه وسلم ـ إِذَا حَلَفَ قَالَ ‏\n\"‏ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila Nabi SAW bersumpah, baginda akan berfirman, ‘Demi Yang jiwa Muhammad di tangan-Nya.’"
  },
  {
    "id": 31658,
    "hadith_number": 1825,
    "tajuk_hadith": "Sumpah Rasulullah SAW dan Persaksian Ilahi",
    "perawi_melayu": "Dikatakan oleh Rifa'ah bin 'Arabah al-Juhani:",
    "english_text": "\"The swearing of the Messenger of Allah (ﷺ) when he took an oath and I bear witness before Allah was: 'By the One in Whose Hand is my soul.\"'",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ مُحَمَّدٍ الصَّنْعَانِيُّ، حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ هِلاَلِ بْنِ أَبِي مَيْمُونَةَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ رِفَاعَةَ بْنِ عَرَابَةَ الْجُهَنِيِّ، قَالَ كَانَتْ يَمِينُ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ التَّى يَحْلِفُ بِهَا أَشْهَدُ عِنْدَ اللَّهِ ‏\n\"‏ وَالَّذِي نَفْسِي بِيَدِهِ ‏\"‏ ‏.‏",
    "malay_translation": "\"Sumpah Rasulullah SAW ketika bersumpah dan aku bersaksi di sisi Allah adalah: ‘Demi Yang jiwanya dalam genggaman-Nya.’”"
  },
  {
    "id": 31659,
    "hadith_number": 1826,
    "tajuk_hadith": "Sumpah Nabi SAW yang Paling Lazim: \"Demi Pemilik Hati\"",
    "perawi_melayu": "Diriwayatkan daripada Salim bahawa bapanya berkata:",
    "english_text": "\"The swearing most frequently sworn by the Messenger of Allah (ﷺ) was: 'No, by the Controller of the hearts.'\"",
    "arabic_text": "حَدَّثَنَا أَبُو إِسْحَاقَ الشَّافِعِيُّ، إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ الْعَبَّاسِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ الْمَكِّيُّ، عَنْ عَبَّادِ بْنِ إِسْحَاقَ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ كَانَتْ أَكْثَرُ أَيْمَانِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ وَمُصَرِّفِ الْقُلُوبِ ‏\"‏ ‏.‏",
    "malay_translation": "Perkataan sumpah yang paling kerap diucapkan oleh Rasulullah SAW ialah: \"Tidak, demi Pemilik Hati.\""
  },
  {
    "id": 31660,
    "hadith_number": 1827,
    "tajuk_hadith": "Sumpah Rasulullah SAW dan Mohon Ampun kepada Allah",
    "perawi_melayu": "Dikatakan oleh Abu Hurairah:",
    "english_text": "\"The swearing of the Messenger of Allah (ﷺ) was: 'No, and I ask Allah for forgiveness.'\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ، ح وَحَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، حَدَّثَنَا مَعْنُ بْنُ عِيسَى، جَمِيعًا عَنْ مُحَمَّدِ بْنِ هِلاَلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَتْ يَمِينُ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ وَأَسْتَغْفِرُ اللَّهَ ‏\"‏ ‏.‏",
    "malay_translation": "Perkataan sumpah Rasulullah SAW (ﷺ) ialah, 'Tidak, dan aku memohon ampun kepada Allah.'"
  },
  {
    "id": 31661,
    "hadith_number": 1828,
    "tajuk_hadith": "Larangan Bersumpah dengan Leluhur",
    "perawi_melayu": "Dari Salim bin Abdullah bin Umar, dari bapanya, dari Umar bin al-Khattab, bahawa:",
    "english_text": "the Messenger of Allah (ﷺ) heard him swearing by his father. The Messenger of Allah (ﷺ) said: 'Allah forbids you from making oaths by your forefathers.\" 'Umar said: I never took an oath by them (i.e., my forefathers) myself nor narrating such words from anyone else.”",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْعَدَنِيُّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ أَبِيهِ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ سَمِعَهُ يَحْلِفُ بِأَبِيهِ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ ‏\"‏ ‏.‏ قَالَ عُمَرُ فَمَا حَلَفْتُ بِهَا ذَاكِرًا وَلاَ آثِرًا ‏.‏",
    "malay_translation": "Rasulullah SAW mendengar seseorang bersumpah dengan bapanya. Rasulullah SAW bersabda, \"Sesungguhnya Allah melarang kamu daripada bersumpah dengan nenek moyang kamu.\" Umar berkata, \"Aku tidak pernah bersumpah dengan mereka (nenek moyangku) sama ada secara langsung atau menyampaikannya dari orang lain.\""
  },
  {
    "id": 31662,
    "hadith_number": 1829,
    "tajuk_hadith": "Larangan Bersumpah dengan Berhala dan Leluhur",
    "perawi_melayu": "Diceritakan daripada 'Abdur-Rahman bin Samurah bahawa:",
    "english_text": "Pesuruh Allah (ﷺ) bersabda: 'Jangan bersumpah dengan berhala atau nenek moyang kamu.'",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ هِشَامٍ، عَنِ الْحَسَنِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ تَحْلِفُوا بِالطَّوَاغِي وَلاَ بِآبَائِكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Utusan Allah (ﷺ) bersabda: \"Janganlah kamu bersumpah dengan berhala atau nenek moyang kamu.\" "
  },
  {
    "id": 31663,
    "hadith_number": 1830,
    "tajuk_hadith": "Mengganti Sumpah dengan Syahadat bagi yang Bersumpah dengan Al-Lat dan Al-Uzza",
    "perawi_melayu": "Daripada Abu Hurairah, bahawa:",
    "english_text": "the Messenger of Allah (ﷺ) said: \"Whoever takes an oath, and swears, saying: 'By Al-Lat and Al-Uzza,' let him say:'La ilaha illallah.' \"",
    "arabic_text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، حَدَّثَنَا عُمَرُ بْنُ عَبْدِ الْوَاحِدِ، عَنِ الأَوْزَاعِيِّ، عَنِ الزُّهْرِيِّ، عَنْ حُمَيْدٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَنْ حَلَفَ فَقَالَ فِي يَمِينِهِ بِاللاَّتِ وَالْعُزَّى فَلْيَقُلْ لاَ إِلَهَ إِلاَّ اللَّهُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Barangsiapa bersumpah dengan nama Al-Lat dan Al-Uzza, maka hendaklah dia mengucapkan 'La ilaha illallah'."
  },
  {
    "id": 31664,
    "hadith_number": 1831,
    "tajuk_hadith": "Larangan Bersumpah dengan Berhala dan Cara Mengatasi Kesalahan",
    "perawi_melayu": "Dikatakan bahawa Sa'd telah berkata:",
    "english_text": "\"I took an oath by Lat and 'Uzza. The Messenger of Allah (ﷺ) said : 'Say: \"La ilaha illallah wahdahu la sharika lahu\" (None has the right to be worshipped but Allah alone, with no partner or associate),\" then spit toward your left three times, and seek refuge with Allah, and do not do that again.\"'",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَالْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، قَالاَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنْ مُصْعَبِ بْنِ سَعْدٍ، عَنْ سَعْدٍ، قَالَ حَلَفْتُ بِاللاَّتِ وَالْعُزَّى فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ قُلْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ ثُمَّ انْفُثْ عَنْ يَسَارِكَ ثَلاَثًا وَتَعَوَّذْ وَلاَ تَعُدْ ‏\"‏ ‏.‏",
    "malay_translation": "Aku bersumpah dengan Lat dan Uzza. Rasulullah SAW bersabda: \"Katakanlah: \"La ilaha illallah wahdahu la sharika lah\" (Tiada Tuhan yang berhak disembah melainkan Allah Yang Maha Esa, tiada sekutu bagi-Nya),\" kemudian ludahkan ke arah kiri tiga kali, dan cari perlindungan kepada Allah, dan jangan ulangi perbuatan itu lagi.\""
  },
  {
    "id": 31665,
    "hadith_number": 1832,
    "tajuk_hadith": "Janji Palsu Mengenai Agama Lain",
    "perawi_melayu": "Dikisahkan oleh Thabit bin Ad-Dahhak bahawa:",
    "english_text": "The Messenger of Allah (ﷺ) said: 'Whoever takes an oath to follow a religion other than Islam, telling a deliberate lie, he will be as he said.'",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلاَبَةَ، عَنْ ثَابِتِ بْنِ الضَّحَّاكِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ حَلَفَ بِمِلَّةٍ سِوَى الإِسْلاَمِ كَاذِبًا مُتَعَمِّدًا فَهُوَ كَمَا قَالَ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, 'Barangsiapa bersumpah untuk memeluk agama selain Islam dengan sengaja berdusta, maka dia akan dihukum seperti apa yang disumpahnya.' "
  },
  {
    "id": 31666,
    "hadith_number": 1833,
    "tajuk_hadith": "Janji Kepastian Tentang Kepercayaan Orang Yang Berubah Agama",
    "perawi_melayu": "Diceritakan oleh Anas bahawa Rasulullah SAW mendengar seorang lelaki berkata:",
    "english_text": "\"Jika itu berlaku, aku akan menjadi Yahudi.\" Rasulullah SAW bersabda: 'Sudah pasti.'",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا بَقِيَّةُ، عَنْ عَبْدِ اللَّهِ بْنِ مُحَرَّرٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ سَمِعَ النَّبِيُّ ـ صلى الله عليه وسلم ـ رَجُلاً يَقُولُ أَنَا إِذًا لَيَهُودِيٌّ ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ وَجَبَتْ ‏\"‏ ‏.‏",
    "malay_translation": "“Jika keadaan itu berlaku, aku akan menjadi seorang Yahudi.” Rasulullah SAW bersabda, “Sudah pasti.”"
  },
  {
    "id": 31667,
    "hadith_number": 1834,
    "tajuk_hadith": "Ketidakikhlasan dalam Islam",
    "perawi_melayu": "Dikisahkan daripada Abdullah bin Buraidah bahawa bapanya telah berkata:",
    "english_text": "the Messenger of Allah (ﷺ) said: \"Whoever says: 'I have nothing to do with Islam,' if he is lying then he is as he said, and if he is telling the truth, his Islam will not be sound.\"",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ الْبَجَلِيُّ، حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، عَنِ الْحُسَيْنِ بْنِ وَاقِدٍ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ قَالَ إِنِّي بَرِيءٌ مِنَ الإِسْلاَمِ فَإِنْ كَانَ كَاذِبًا فَهُوَ كَمَا قَالَ وَإِنْ كَانَ صَادِقًا لَمْ يَعُدْ إِلَيْهِ الإِسْلاَمُ سَالِمًا ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Barangsiapa yang berkata, 'Aku berlepas diri daripada Islam,' jika dia pendusta, maka dia akan menerima balasan seperti yang dikatakannya. Dan jika dia berkata benar, Islamnya tidak akan lagi murni.\""
  },
  {
    "id": 31668,
    "hadith_number": 1835,
    "tajuk_hadith": "Larangan Bersumpah dengan Leluhur dan Kepentingan Memenuhi Sumpah Atas Nama Allah",
    "perawi_melayu": "Dikisahkan oleh Ibn 'Umar bahawa:",
    "english_text": "\"The Messenger of Allah (ﷺ) heard a man taking an oath by his father and said: 'Do not make oaths by your forefathers. Whoever makes an oath by Allah, let him fulfill his oath, and if an oath is sworn for a person by Allah, let him accept it. Whoever is not content with Allah has nothing to do with Allah.'",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ سَمُرَةَ، حَدَّثَنَا أَسْبَاطُ بْنُ مُحَمَّدٍ، عَنْ مُحَمَّدِ بْنِ عَجْلاَنَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ سَمِعَ النَّبِيُّ ـ صلى الله عليه وسلم ـ رَجُلاً يَحْلِفُ بِأَبِيهِ فَقَالَ ‏\n\"‏ لاَ تَحْلِفُوا بِآبَائِكُمْ مَنْ حَلَفَ بِاللَّهِ فَلْيَصْدُقْ وَمَنْ حُلِفَ لَهُ بِاللَّهِ فَلْيَرْضَ وَمَنْ لَمْ يَرْضَ بِاللَّهِ فَلَيْسَ مِنَ اللَّهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW mendengar seorang lelaki bersumpah dengan bapanya, lalu baginda bersabda: \"Jangan bersumpah dengan nenek moyang kamu. Barangsiapa bersumpah dengan Allah, hendaklah dia menepati sumpahnya, dan barangsiapa yang disumpah atas namanya Allah, hendaklah dia menerima sumpah itu dengan reda. Barangsiapa yang tidak reda dengan Allah, maka bukanlah dia dari kalangan Allah.\""
  },
  {
    "id": 31669,
    "hadith_number": 1836,
    "tajuk_hadith": "Peristiwa Yesus bin Maryam Menyaksikan Perbuatan Pencurian",
    "perawi_melayu": "Daripada Abu Hurairah, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Eisa bin Maryam saw a man stealing and said: 'Did you steal?'  He said: 'No, by the One besides Whom there is no other God.' 'Eisa said: 'I believe in Allah, and I do not believe what my eyes see.'\"",
    "arabic_text": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ أَبِي بَكْرِ بْنِ يَحْيَى بْنِ النَّضْرِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ رَأَى عِيسَى ابْنُ مَرْيَمَ رَجُلاً يَسْرِقُ فَقَالَ أَسَرَقْتَ قَالَ لاَ وَالَّذِي لاَ إِلَهَ إِلاَّ هُوَ ‏.‏ فَقَالَ عِيسَى آمَنْتُ بِاللَّهِ وَكَذَّبْتُ بَصَرِي ‏\"‏ ‏.‏",
    "malay_translation": "Penglihatan Isa bin Maryam terhadap seorang lelaki yang mencuri. Baginda bertanya, 'Adakah engkau mencuri?' Lelaki itu menjawab, 'Tidak, demi Yang Esa tiada Tuhan melainkan Dia.' Isa berkata, 'Aku beriman kepada Allah dan aku mendustakan penglihatan mataku.'"
  },
  {
    "id": 31670,
    "hadith_number": 1837,
    "tajuk_hadith": "Sumpah: Menerbitkan Dosa atau Penyesalan",
    "perawi_melayu": "Dikisahkan daripada Ibn 'Umar bahawa:",
    "english_text": "the Messenger of Allah (ﷺ) said: \"An oath (leads to) either sin or regret. \"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ بَشَّارِ بْنِ كِدَامٍ، عَنْ مُحَمَّدِ بْنِ زَيْدٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِنَّمَا الْحَلِفُ حِنْثٌ أَوْ نَدَمٌ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Sesungguhnya sumpah itu sama ada membawa dosa atau penyesalan.\""
  },
  {
    "id": 31671,
    "hadith_number": 1838,
    "tajuk_hadith": "Penjelasan Janji dan Ikrar dengan 'Insya Allah'",
    "perawi_melayu": "Daripada Abu Hurairah bahawa Rasulullah SAW bersabda:",
    "english_text": "'Whoever swears an oath and says In sha' Allah, he will have made an exception.\"(2)",
    "arabic_text": "حَدَّثَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَنْبَأَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ حَلَفَ فَقَالَ إِنْ شَاءَ اللَّهُ فَلَهُ ثُنْيَاهُ ‏\"‏ ‏.‏",
    "malay_translation": "'Sesiapa yang bersumpah dan berkata 'Insya-Allah', maka dia telah membuat pengecualian.' (2)"
  },
  {
    "id": 31672,
    "hadith_number": 1839,
    "tajuk_hadith": "Janji dan Kehendak Allah SWT",
    "perawi_melayu": "Daripada Ibn 'Umar bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Whoever swears an oath and says In sha' Allah, if he wishes he may go ahead and if he wishes he may not, without having broken his oath.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ حَلَفَ وَاسْتَثْنَى إِنْ شَاءَ رَجَعَ وَإِنْ شَاءَ تَرَكَ غَيْرُ حَانِثٍ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa bersumpah dan berkata \"Insya-Allah\", jika dia mahu dia boleh meneruskan dan jika dia mahu dia boleh membatalkannya, tanpa mengkhianati sumpahnya."
  },
  {
    "id": 31673,
    "hadith_number": 1840,
    "tajuk_hadith": "Janji yang Disertai 'Insya-Allah' Tidak Akan Dilanggar",
    "perawi_melayu": "Dikisahkan oleh Ibnu Umar",
    "english_text": "\"Whoever swears an oath and says In sha' Allah, will never break his oath.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الزُّهْرِيُّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، رِوَايَةً قَالَ ‏\n\"‏ مَنْ حَلَفَ وَاسْتَثْنَى فَلَمْ يَحْنَثْ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa bersumpah dan menyebut \"Insya-Allah\", maka sumpahnya tidak akan dilanggar."
  },
  {
    "id": 31674,
    "hadith_number": 1841,
    "tajuk_hadith": "Keutamaan Mengganti Sumpah Dengan Amalan Yang Lebih Baik",
    "perawi_melayu": "Dikisahkan oleh Abu Burdah, daripada bapanya Abu Musa berkata:",
    "english_text": "\"I came to the Messenger of Allah (ﷺ) with a group of Asharites and asked him to give us animals to ride. He said: 'By Allah, I cannot give you anything to ride, and I have nothing to give you to ride.' We stayed as long as Allah willed, then some camels were brought to him. He ordered that we be given three she-camels with fine humps. When we left, we said to one another: 'We came to the Messenger of Allah (ﷺ) to ask him for animals to ride, and he swore by Allah that he would not give us anything to ride, then he gave us something. Let us go back.' So we went to him and we said: 'O Messenger of Allah! We came to you seeking mounts, and you took an oath that you would not give us mounts, then you gave us some mounts.' He said: 'By Allah, I did not give you animals to ride, rather Allah gave you them to ride. I, by Allah, if Allah wills, do not swear and then see something better than it, but I offer expiation for what I swore about, and do that which is better.' Or he said: 'I do that which is better and offer expiation for what I swore about.'\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ، أَنْبَأَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا غَيْلاَنُ بْنُ جَرِيرٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِيهِ أَبِي مُوسَى، قَالَ أَتَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ فِي رَهْطٍ مِنَ الأَشْعَرِيِّينَ نَسْتَحْمِلُهُ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ وَاللَّهِ مَا أَحْمِلُكُمْ وَمَا عِنْدِي مَا أَحْمِلُكُمْ عَلَيْهِ ‏\"‏ ‏.‏ قَالَ فَلَبِثْنَا مَا شَاءَ اللَّهُ ثُمَّ أُتِيَ بِإِبِلٍ فَأَمَرَ لَنَا بِثَلاَثَةِ إِبِلٍ ذَوْدٍ غُرِّ الذُّرَى فَلَمَّا انْطَلَقْنَا قَالَ بَعْضُنَا لِبَعْضٍ أَتَيْنَا رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ نَسْتَحْمِلُهُ فَحَلَفَ أَلاَّ يَحْمِلَنَا ثُمَّ حَمَلَنَا ارْجِعُوا بِنَا ‏.‏ فَأَتَيْنَاهُ فَقُلْنَا يَا رَسُولَ اللَّهِ إِنَّا أَتَيْنَاكَ نَسْتَحْمِلُكَ فَحَلَفْتَ أَنْ لاَ تَحْمِلَنَا ‏.‏ ثُمَّ حَمَلْتَنَا فَقَالَ ‏\"‏ وَاللَّهِ مَا أَنَا حَمَلْتُكُمْ فَإِنَّ اللَّهَ حَمَلَكُمْ وَاللَّهِ مَا أَنَا حَمَلْتُكُمْ بَلِ اللَّهُ حَمَلَكُمْ إِنِّي وَاللَّهِ إِنْ شَاءَ اللَّهُ لاَ أَحْلِفُ عَلَى يَمِينٍ فَأَرَى غَيْرَهَا خَيْرًا مِنْهَا إِلاَّ كَفَّرْتُ عَنْ يَمِينِي وَأَتَيْتُ الَّذِي هُوَ خَيْرٌ ‏\"‏ ‏.‏ أَوْ قَالَ ‏\"‏ أَتَيْتُ الَّذِي هُوَ خَيْرٌ وَكَفَّرْتُ عَنْ يَمِينِي ‏\"‏ ‏.‏",
    "malay_translation": "Sebahagian daripada hadis ini menceritakan bahawa Abu Burdah meriwayatkan daripada bapanya, Abu Musa, yang berkata, \"Kami telah menemui Rasulullah SAW bersama beberapa orang Asy'ari dan meminta beliau menyediakan kenderaan untuk kami. Baginda bersumpah, 'Demi Allah, aku tidak dapat memberikan kenderaan untuk kalian, dan aku tidak mempunyai kenderaan untuk diberikan.' Kami tinggal selagi Allah kehendaki, kemudian beberapa ekor unta dibawa kepada Baginda. Baginda memerintahkan agar kami diberi tiga ekor unta betina yang berkaki licin dan berpunuk cantik. Ketika kami berangkat, kami berkata antara satu sama lain, 'Kami telah menemui Rasulullah SAW meminta kenderaan, dan beliau bersumpah tidak akan memberikan kenderaan kepada kami, tetapi kemudian beliau memberikannya. Mari kita kembali.' Maka kami menemui Baginda dan berkata, 'Wahai Rasulullah, kami datang kepada Anda untuk meminta kenderaan, dan Anda telah bersumpah tidak akan memberikan kenderaan, namun kemudian Anda memberikannya.' Baginda menjawab, 'Demi Allah, bukan aku yang memberikan kenderaan untuk kalian, tetapi Allah yang memberikannya kepada kalian. Demi Allah, jika Allah menghendaki, aku tidak akan bersumpah dan kemudian melihat sesuatu yang lebih baik daripada yang telah dijanjikan, melainkan aku akan menebus sumpahku dan melakukan perkara yang lebih baik.' Atau Baginda berkata, 'Aku akan melakukan perkara yang lebih baik dan menebus sumpahku.'\""
  },
  {
    "id": 31675,
    "hadith_number": 1842,
    "tajuk_hadith": "Mengganti Sumpah dengan Perbuatan yang Lebih Baik",
    "perawi_melayu": "Daripada 'Adi bin Hatim bahawa:",
    "english_text": "the Messenger of Allah (ﷺ), said: \"Whoever swears an oath then sees that something else is better than it, let him do that which is better and offer expiation for what he swore about. \"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَعَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ زُرَارَةَ، قَالاَ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، عَنْ تَمِيمِ بْنِ طَرَفَةَ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيَأْتِ الَّذِي هُوَ خَيْرٌ وَلْيُكَفِّرْ عَنْ يَمِينِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Barangsiapa yang bersumpah, kemudian melihat sesuatu yang lebih baik darinya, maka hendaklah dia melakukan yang lebih baik itu dan mengganti sumpahnya.\""
  },
  {
    "id": 31676,
    "hadith_number": 1843,
    "tajuk_hadith": "Meminta Pengampunan atas Sumpah yang Dilanggar dengan Saudara Sepupu",
    "perawi_melayu": "Dikisahkan oleh Abul-Ahwas 'Awf bin Malik Al-Jushmi daripada bapanya yang berkata:",
    "english_text": "\"I said: 'O Messenger of Allah, my cousin comes to me and I swear that I will not give him anything or uphold the ties of kinship with him.' He said: 'Offer expiation for what you swore about.'\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْعَدَنِيُّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، حَدَّثَنَا أَبُو الزَّعْرَاءِ، عَمْرُو بْنُ عَمْرٍو عَنْ عَمِّهِ أَبِي الأَحْوَصِ، عَوْفِ بْنِ مَالِكٍ الْجُشَمِيِّ عَنْ أَبِيهِ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ يَأْتِينِي ابْنُ عَمِّي فَأَحْلِفُ أَنْ لاَ، أُعْطِيَهُ وَلاَ أَصِلَهُ ‏.‏ قَالَ ‏\n\"‏ كَفِّرْ عَنْ يَمِينِكَ ‏\"‏ ‏.‏",
    "malay_translation": "Saya berkata: 'Wahai Rasulullah, saudara sepupu saya datang kepada saya dan saya bersumpah bahawa saya tidak akan memberi apa-apa kepadanya dan tidak akan memelihara hubungan kekeluargaan dengannya.' Baginda bersabda: 'Bayar denda atas sumpahmu itu.'"
  },
  {
    "id": 31677,
    "hadith_number": 1844,
    "tajuk_hadith": "Janji Sumpah yang Tidak Membawa Kepada Kebaikan",
    "perawi_melayu": "Daripada 'Aishah r.a., bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Whoever takes an oath to cut off the ties of kinship, or to do something that is not right, the fulfillment of his vow is not to do that.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ حَارِثَةَ بْنِ أَبِي الرِّجَالِ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ حَلَفَ فِي قَطِيعَةِ رَحِمٍ أَوْ فِيمَا لاَ يَصْلُحُ فَبِرُّهُ أَنْ لاَ يَتِمَّ عَلَى ذَلِكَ ‏\"‏ ‏.‏",
    "malay_translation": "“Barangsiapa yang bersumpah untuk memutuskan hubungan kekeluargaan atau melakukan sesuatu yang tidak baik, maka kebaikannya adalah supaya sumpah itu tidak dipenuhi.”"
  },
  {
    "id": 31678,
    "hadith_number": 1845,
    "tajuk_hadith": "Menjauhkan Diri daripada Sumpah yang Tidak Membawa Kebaikan",
    "perawi_melayu": "Daripada 'Amr bin Shu'aib, daripada bapanya, daripada datuknya, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Whoever swears an oath then sees  that something else is better than it, let him not do it, and his leaving it is the expiation for it. \"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْمُؤْمِنِ الْوَاسِطِيُّ، حَدَّثَنَا عَوْنُ بْنُ عُمَارَةَ، حَدَّثَنَا رَوْحُ بْنُ الْقَاسِمِ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، ‏.‏ أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيَتْرُكْهَا فَإِنَّ تَرْكَهَا كَفَّارَتُهَا ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa yang bersumpah, kemudian melihat sesuatu yang lebih baik daripada sumpah itu, maka hendaklah dia meninggalkannya. Sesungguhnya meninggalkan sumpah itu adalah kafaratnya."
  },
  {
    "id": 31679,
    "hadith_number": 1846,
    "tajuk_hadith": "Pengampunan dengan Kurma atau Gandum",
    "perawi_melayu": "Dikatakan oleh Ibnu Abbas:",
    "english_text": "\"The Messenger of Allah (ﷺ) offered expiation of a Sa' of dates, and he enjoined the people to do likewise. Whoever does not have that (must give) half a Sa' of wheat.\"",
    "arabic_text": "حَدَّثَنَا الْعَبَّاسُ بْنُ يَزِيدَ، حَدَّثَنَا زِيَادُ بْنُ عَبْدِ اللَّهِ الْبَكَّائِيُّ، حَدَّثَنَا عُمَرُ بْنُ عَبْدِ اللَّهِ بْنِ يَعْلَى الثَّقَفِيُّ، عَنِ الْمِنْهَالِ بْنِ عَمْرٍو، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَفَّرَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ بِصَاعٍ مِنْ تَمْرٍ وَأَمَرَ النَّاسَ بِذَلِكَ فَمَنْ لَمْ يَجِدْ فَنِصْفُ صَاعٍ مِنْ بُرٍّ ‏.‏",
    "malay_translation": "“Rasulullah SAW mengampunkan dosa dengan satu sa’ kurma, dan beliau mewajibkan perkara yang sama kepada umat Islam.  Barangsiapa tidak mempunyai kurma, maka dia perlu membayar separuh sa’ gandum.”"
  },
  {
    "id": 31680,
    "hadith_number": 1847,
    "tajuk_hadith": "Tentang Pemberian Makanan kepada Keluarga dengan Ukuran Sedang",
    "perawi_melayu": "Dikisahkan oleh Ibn 'Abbas bahawa:",
    "english_text": "\"A man would give his family food that was abundant and another would give his family food that was barely sufficient, then the following was revealed: 'With the Awsat of that with which you feed your families...’”(2)",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ سُلَيْمَانَ بْنِ أَبِي الْمُغِيرَةِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ الرَّجُلُ يَقُوتُ أَهْلَهُ قُوتًا فِيهِ سَعَةٌ وَكَانَ الرَّجُلُ يَقُوتُ أَهْلَهُ قُوتًا فِيهِ شِدَّةٌ فَنَزَلَتْ ‏{مِنْ أَوْسَطِ مَا تُطْعِمُونَ أَهْلِيكُمْ}‏ ‏.‏",
    "malay_translation": "Dikatakan bahawa seorang lelaki akan memberi keluarganya makanan yang banyak, dan ada juga lelaki yang memberi makan keluarganya dengan makanan yang sedikit. Kemudian turunlah firman Allah: 'Dengan pertengahan dari apa yang kamu berikan makan kepada keluarga kamu…' (2)."
  },
  {
    "id": 31681,
    "hadith_number": 1848,
    "tajuk_hadith": "Melanggar Sumpah yang Tidak Sah Lebih Berdosa daripada Mengeluarkan Denda",
    "perawi_melayu": "Dikisahkan bahawa Hammam mendengar Abu Hurairah berkata bahawa Rasulullah SAW bersabda:",
    "english_text": "\"If anyone of you insists on fulfilling what he swore to (after learning that it is wrong) then it is more sinful before Allah than (breaking the oath for which) the expiation that has been enjoined upon him.\"",
    "arabic_text": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ، حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الْمَعْمَرِيُّ، عَنْ مَعْمَرٍ، عَنْ هَمَّامٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ أَبُو الْقَاسِمِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِذَا اسْتَلَجَّ أَحَدُكُمْ فِي الْيَمِينِ فَإِنَّهُ آثَمُ لَهُ عِنْدَ اللَّهِ مِنَ الْكَفَّارَةِ الَّتِي أُمِرَ بِهَا ‏\"‏ ‏.‏ \n حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا يَحْيَى بْنُ صَالِحٍ الْوُحَاظِيُّ، حَدَّثَنَا مُعَاوِيَةُ بْنُ سَلاَّمٍ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عِكْرِمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ نَحْوَهُ ‏.‏",
    "malay_translation": "Jika seseorang daripada kamu memaksa untuk menunaikan sumpah yang telah dibuatnya (selepas mengetahui ia tidak sah), maka perbuatannya itu lebih berdosa di sisi Allah daripada mengeluarkan denda yang diwajibkan."
  },
  {
    "id": 31682,
    "hadith_number": 1849,
    "tajuk_hadith": "Keperluan Memenuhi Sumpah",
    "perawi_melayu": "Diriwayatkan oleh Bara' bin 'Azib bahawa:",
    "english_text": "'The Messenger of Allah (ﷺ) commanded us to help fulfill the oath.",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ عَلِيِّ بْنِ صَالِحٍ، عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ، عَنْ مُعَاوِيَةَ بْنِ سُوَيْدِ بْنِ مُقَرِّنٍ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ أَمَرَنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ بِإِبْرَارِ الْمُقْسِمِ ‏.‏",
    "malay_translation": "Rasulullah SAW telah memerintahkan kita untuk menunaikan sumpah dengan baik."
  },
  {
    "id": 31683,
    "hadith_number": 1850,
    "tajuk_hadith": "Penjelasan Tentang Hijrah Selepas Penaklukan Mekah",
    "perawi_melayu": "Dikisahkan oleh Mujahid, dari 'Abdur-Rahman bin Safwan, atau Safwan bin 'Abdur-Rahman Al-Qurashi,",
    "english_text": "\"On the Day of the conquest of Makkah, he came with his father and he said: 'O Messenger of Allah, give my father a share of Hijrah.' He said: 'There is no Hijrah.' Then he went away and entered upon 'Abbas and said: 'Do you know who I am?' He said: 'Yes.' Then 'Abbas went out, wearing a shirt and no upper wrap, and said: 'O Messenger of Allah, do you know so-and-so with whom we have friendly ties? He brought his father to swear an oath of allegiance (i.e., promise) to emigrate.' The Prophet (ﷺ) said: 'There is no Hijrah.' 'Abbas said: 'I adjure you to do it.' The Prophet (ﷺ) stretched forth his hand and touched his hand, and said: 'I have fulfilled the oath of my uncle, but there is no Hijrah.\"' (Da'if)Another chain with similar wording. Yazid bin Abu Ziyad said: \"Meaning: There is no Hijrah from a land whose people have accepted Islam.\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ صَفْوَانَ، أَوْ عَنْ صَفْوَانَ بْنِ عَبْدِ الرَّحْمَنِ الْقُرَشِيِّ، قَالَ لَمَّا كَانَ يَوْمُ فَتْحِ مَكَّةَ جَاءَ بِأَبِيهِ فَقَالَ يَا رَسُولَ اللَّهِ اجْعَلْ لأَبِي نَصِيبًا فِي الْهِجْرَةِ ‏.‏ فَقَالَ ‏\"‏ إِنَّهُ لاَ هِجْرَةَ ‏\"‏ ‏.‏ فَانْطَلَقَ فَدَخَلَ عَلَى الْعَبَّاسِ فَقَالَ قَدْ عَرَفْتَنِي فَقَالَ أَجَلْ ‏.‏ فَخَرَجَ الْعَبَّاسُ فِي قَمِيصٍ لَيْسَ عَلَيْهِ رِدَاءٌ فَقَالَ يَا رَسُولَ اللَّهِ قَدْ عَرَفْتَ فُلاَنًا وَالَّذِي بَيْنَنَا وَبَيْنَهُ جَاءَ بِأَبِيهِ لِيُبَايِعَكَ عَلَى الْهِجْرَةِ ‏.‏ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ إِنَّهُ لاَ هِجْرَةَ ‏\"‏ ‏.‏ فَقَالَ الْعَبَّاسُ أَقْسَمْتُ عَلَيْكَ ‏.‏ فَمَدَّ النَّبِيُّ ـ صلى الله عليه وسلم ـ يَدَهُ فَمَسَّ يَدَهُ فَقَالَ ‏\"‏ أَبْرَرْتُ عَمِّي وَلاَ هِجْرَةَ ‏\"‏ ‏.‏ \n حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا الْحَسَنُ بْنُ الرَّبِيعِ، عَنْ عَبْدِ اللَّهِ بْنِ إِدْرِيسَ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، بِإِسْنَادِهِ نَحْوَهُ ‏.‏ قَالَ يَزِيدُ بْنُ أَبِي زِيَادٍ يَعْنِي لاَ هِجْرَةَ مِنْ دَارٍ قَدْ أَسْلَمَ أَهْلُهَا ‏.‏",
    "malay_translation": "Pada hari penaklukan Mekah, dia datang bersama bapanya dan berkata, 'Wahai Rasulullah, berikanlah kepada ayahku bahagian dalam hijrah.' Baginda menjawab, 'Tidak ada lagi hijrah.' Kemudian dia pergi dan menemui 'Abbas, dan bertanya, 'Adakah engkau mengenali diriku?' 'Abbas menjawab, 'Ya.' Kemudian 'Abbas keluar dengan hanya memakai kemeja tanpa jubah dan berkata, 'Wahai Rasulullah, adakah engkau mengenali si fulan yang ada hubungan baik dengan kita? Dia membawa bapanya untuk berbai'ah (berjanji) untuk berhijrah.' Nabi SAW bersabda, 'Tidak ada lagi hijrah.' 'Abbas berkata, 'Aku bersumpah kepadamu.' Nabi SAW mengulurkan tangannya dan menyentuh tangan 'Abbas, dan bersabda, 'Aku telah menunaikan sumpah amanah kepadamu, tetapi tidak ada lagi hijrah.' (Da'if) Rangkaian lain dengan perkataan yang serupa. Yazid bin Abu Ziyad berkata, 'Maksudnya: Tiada lagi hijrah dari sebuah negeri yang penduduknya telah memeluk Islam.'"
  },
  {
    "id": 31684,
    "hadith_number": 1851,
    "tajuk_hadith": "Elakkan Perkataan 'Apa yang Allah kehendaki dan apa yang engkau kehendaki'",
    "perawi_melayu": "Dikisahkan daripada Ibn 'Abbas bahawa Rasulullah SAW bersabda:",
    "english_text": "'When anyone of you swears an oath, let him not say: 'What Allah wills and what you will.' Rather let him say: 'What Allah wills and then what you will.'",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا الأَجْلَحُ الْكِنْدِيُّ، عَنْ يَزِيدَ بْنِ الأَصَمِّ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِذَا حَلَفَ أَحَدُكُمْ فَلاَ يَقُلْ مَا شَاءَ اللَّهُ وَشِئْتَ ‏.‏ وَلَكِنْ لِيَقُلْ مَا شَاءَ اللَّهُ ثُمَّ شِئْتَ ‏\"‏ ‏.‏",
    "malay_translation": "'Apabila seseorang di antara kamu bersumpah, janganlah dia berkata: \"Apa yang dikehendaki Allah dan apa yang engkau kehendaki.\" Sebaliknya, hendaklah dia berkata: \"Apa yang dikehendaki Allah, kemudian apa yang engkau kehendaki.\""
  },
  {
    "id": 31685,
    "hadith_number": 1852,
    "tajuk_hadith": "Larangan Menggabungkan Kehendak Allah dan Nabi Muhammad SAW",
    "perawi_melayu": "Dikisahkan oleh Hudzaifah bin Yaman bahawa:",
    "english_text": "a Muslim man saw in a dream that he met a man from among the People of the Book, who said: \"What good people you would be if only you were not committing Shirk. For you say: 'What Allah  wills and Muhammad wills.\"' He mentioned that to the Prophet (ﷺ) and he said: \"By Allah, I am aware of that. Say: 'What Allah wills then what Muhammad wills.\"'Another chain from Tufail bin Sakhbarah, the brother of 'Aishah by her mother, from the Prophet (ﷺ), with similar wording.",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ حُذَيْفَةَ بْنِ الْيَمَانِ، أَنَّ رَجُلاً، مِنَ الْمُسْلِمِينَ رَأَى فِي النَّوْمِ أَنَّهُ لَقِيَ رَجُلاً مِنْ أَهْلِ الْكِتَابِ فَقَالَ نِعْمَ الْقَوْمُ أَنْتُمْ لَوْلاَ أَنَّكُمْ تُشْرِكُونَ تَقُولُونَ مَا شَاءَ اللَّهُ وَشَاءَ مُحَمَّدٌ ‏.‏ وَذَكَرَ ذَلِكَ لِلنَّبِيِّ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\n\"‏ أَمَا وَاللَّهِ إِنْ كُنْتُ لأَعْرِفُهَا لَكُمْ قُولُوا مَا شَاءَ اللَّهُ ثُمَّ شَاءَ مُحَمَّدٌ ‏\"‏ ‏.‏ \n حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنِ الطُّفَيْلِ بْنِ سَخْبَرَةَ، أَخِي عَائِشَةَ لأُمِّهَا عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ بِنَحْوِهِ ‏.‏",
    "malay_translation": "Seorang lelaki Muslim bermimpi bertemu dengan seorang lelaki dari kalangan Ahli Kitab. Lelaki itu berkata, \"Wahai kaum yang baik, sekiranya kalian tidak melakukan syirik, nescaya kalian adalah umat yang baik. Kerana kalian berkata, 'Apa yang dikehendaki Allah dan Muhammad.'\" Kemudian, dia menceritakan hal itu kepada Nabi SAW. Nabi SAW menjawab, \"Demi Allah, aku mengetahuinya. Katakanlah, 'Apa yang dikehendaki Allah, kemudian apa yang dikehendaki Muhammad.'\"  Hadis ini juga diriwayatkan melalui sanad lain daripada Tufail bin Sakhbarah, saudara 'Aisyah melalui ibunya, dari Nabi SAW, dengan redaksi yang sama."
  },
  {
    "id": 31686,
    "hadith_number": 1853,
    "tajuk_hadith": "Persaudaraan Islam dan Kepentingan Sumpah Setia",
    "perawi_melayu": "Dikisahkan oleh Suwaid bin Hanzalah, beliau berkata:",
    "english_text": "\"We went out looking for the Messenger of Allah (ﷺ) and Wa'il bin Hujr was with us. An enemy of his seized him and the people were reluctant to swear an oath but I swore that he was my brother, so they set him free. We came to the Messenger of Allah (ﷺ) and I told him that the people had been reluctant to swear an oath, but I had sworn that he was my brother. He said: 'You told the truth. The Muslim is the brother of his fellow Muslim.' \"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، ح وَحَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَهْدِيٍّ، عَنْ إِسْرَائِيلَ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الأَعْلَى، عَنْ جَدَّتِهِ، عَنْ أَبِيهَا، سُوَيْدِ بْنِ حَنْظَلَةَ قَالَ خَرَجْنَا نُرِيدُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ وَمَعَنَا وَائِلُ بْنُ حُجْرٍ فَأَخَذَهُ عَدُوٌّ لَهُ فَتَحَرَّجَ النَّاسُ أَنْ يَحْلِفُوا فَحَلَفْتُ أَنَا أَنَّهُ أَخِي فَخَلَّى سَبِيلَهُ فَأَتَيْنَا رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ فَأَخْبَرْتُهُ أَنَّ الْقَوْمَ تَحَرَّجُوا أَنْ يَحْلِفُوا وَحَلَفْتُ أَنَا أَنَّهُ أَخِي فَقَالَ ‏\n\"‏ صَدَقْتَ الْمُسْلِمُ أَخُو الْمُسْلِمِ ‏\"‏ ‏.‏",
    "malay_translation": "Kami keluar mencari Rasulullah SAW, dan Wa'il bin Hujr bersama kami. Seorang musuh merebutnya, dan orang ramai enggan bersumpah. Namun, aku bersumpah bahawa dia adalah saudaraku, lalu mereka melepaskannya. Kami menemui Rasulullah SAW dan aku memberitahunya bahawa orang ramai enggan bersumpah, tetapi aku bersumpah bahawa dia adalah saudaraku. Baginda bersabda, \"Engkau telah berkata benar. Seorang Muslim adalah saudara kepada sesama Muslim.\""
  },
  {
    "id": 31687,
    "hadith_number": 1854,
    "tajuk_hadith": "Sumpah Bergantung kepada Niat Peminta Sumpah",
    "perawi_melayu": "Daripada Abu Hurairah, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"The oath is only according to the intention of the one who requests the oath to be taken.\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا هُشَيْمٌ، عَنْ عَبَّادِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِنَّمَا الْيَمِينُ عَلَى نِيَّةِ الْمُسْتَحْلِفِ ‏\"‏ ‏.‏",
    "malay_translation": "Sumpah itu hanya berdasarkan niat orang yang meminta sumpah tersebut."
  },
  {
    "id": 31688,
    "hadith_number": 1855,
    "tajuk_hadith": "Janji Sumpah dan Pemahaman",
    "perawi_melayu": "Daripada Abu Hurairah, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Sumpah kamu diukur mengikut pemahaman rakan kamu.\"",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، حَدَّثَنَا هُشَيْمٌ، أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ يَمِينُكَ عَلَى مَا يُصَدِّقُكَ بِهِ صَاحِبُكَ ‏\"‏ ‏.‏",
    "malay_translation": "Sumpah anda diukur mengikut pemahaman rakan anda."
  },
  {
    "id": 31689,
    "hadith_number": 1856,
    "tajuk_hadith": "Larangan Sumpah dan Tujuannya",
    "perawi_melayu": "'Abdullah bin 'Umar meriwayatkan:",
    "english_text": "\"The Messenger of Allah (ﷺ) forbade vows and said: 'They are just a means of taking wealth from the miserly.\"'",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ مَنْصُورٍ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ النَّذْرِ وَقَالَ ‏\n\"‏ إِنَّمَا يُسْتَخْرَجُ بِهِ مِنَ اللَّئِيمِ ‏\"‏ ‏.‏",
    "malay_translation": "Utusan Allah (ﷺ) melarang bernazar dan bersabda, 'Ia hanyalah cara untuk mengeluarkan harta daripada orang yang kikir.'"
  },
  {
    "id": 31690,
    "hadith_number": 1857,
    "tajuk_hadith": "Nazar dan Takdir Ilahi",
    "perawi_melayu": "Daripada Abu Hurairah bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Vows do not bring the son of Adam anything unless it has been decreed for him. But he is dominated by Divine preordainment, and will get what is decreed for him. And (vows) are a means of making the miser give something, so what he desires becomes obtainable for him, which was not obtainable before his vow. And Allah says: 'Spend, I will spend on you.'\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُوسُفَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ سُفْيَانَ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِنَّ النَّذْرَ لاَ يَأْتِي ابْنَ آدَمَ بِشَىْءٍ إِلاَّ مَا قُدِّرَ لَهُ وَلَكِنْ يَغْلِبُهُ الْقَدَرُ مَا قُدِّرَ لَهُ فَيُسْتَخْرَجُ بِهِ مِنَ الْبَخِيلِ فَيَتَيَسَّرُ عَلَيْهِ مَا لَمْ يَكُنْ يَتَيَسَّرُ عَلَيْهِ مِنْ قَبْلِ ذَلِكَ وَقَدْ قَالَ اللَّهُ أَنْفِقْ أُنْفِقْ عَلَيْكَ ‏\"‏ ‏.‏",
    "malay_translation": "Nazar atau ikrar tidak akan memberikan apa-apa kepada anak Adam melainkan apa yang telah ditetapkan untuknya. Akan tetapi, ketentuan Allah tetap menguasainya, dan dia akan mendapatkan apa yang telah ditetapkan untuknya.  Nazar itu juga merupakan cara untuk mendorong orang yang bakhil mengeluarkan sesuatu, maka apa yang dihajati menjadi mudah diperolehnya, yang tidak mudah sebelumnya sebelum ikrar tersebut. Dan Allah SWT berfirman: \"Keluarkan (sedekah), Aku akan mengeluarkan (rezeki) kepadamu.\""
  },
  {
    "id": 31691,
    "hadith_number": 1858,
    "tajuk_hadith": "Larangan Nazar dalam Durhaka dan Sesuatu yang Tidak Dimiliki Manusia",
    "perawi_melayu": "Dikisahkan oleh 'Imran bin al-Husain bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Tidak ada nazar dalam maksiat, dan tidak ada nazar dalam sesuatu yang tidak dimiliki anak Adam.\"",
    "arabic_text": "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلاَبَةَ، عَنْ عَمِّهِ، عَنْ عِمْرَانَ بْنِ الْحُصَيْنِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ نَذْرَ فِي مَعْصِيَةٍ وَلاَ نَذْرَ فِيمَا لاَ يَمْلِكُ ابْنُ آدَمَ ‏\"‏ ‏.‏",
    "malay_translation": "Tidak ada janji (nazar) dalam maksiat, dan tidak ada janji dalam sesuatu yang tidak mampu dimiliki anak Adam."
  },
  {
    "id": 31692,
    "hadith_number": 1859,
    "tajuk_hadith": "Tidak Ada Nazar dalam Durhaka dan Penebusan Nazar Sama dengan Penebusan Sumpah",
    "perawi_melayu": "Daripada 'Aishah r.a bahawa Rasulullah SAW bersabda:",
    "english_text": "\"There is no vow to commit disobedience, and the expiation (for such a vow) is the expiation for breaking an oath.\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ الْمِصْرِيُّ أَبُو طَاهِرٍ، حَدَّثَنَا ابْنُ وَهْبٍ، أَنْبَأَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لاَ نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ ‏\"‏ ‏.‏",
    "malay_translation": "Tidak ada nazar (janji) untuk melakukan maksiat. Dan penebusan (bagi nazar tersebut) adalah sama seperti penebusan sumpah."
  },
  {
    "id": 31693,
    "hadith_number": 1860,
    "tajuk_hadith": "Menunaikan Janji Kepada Allah SWT",
    "perawi_melayu": "Daripada 'Aishah رضي الله عنها, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Whoever vows to obey Allah, let him obey Him, and whoever vows to disobey Allah, let him not disobey Him. \"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ طَلْحَةَ بْنِ عَبْدِ الْمَلِكِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ نَذَرَ أَنْ يُطِيعَ اللَّهَ فَلْيُطِعْهُ وَمَنْ نَذَرَ أَنْ يَعْصِيَ اللَّهَ فَلاَ يَعْصِهِ ‏\"‏ ‏.‏",
    "malay_translation": "“Barangsiapa yang berjanji untuk mentaati Allah, maka hendaklah ia mentaatinya. Dan barangsiapa yang berjanji untuk mengingkari Allah, maka janganlah ia mengingkarinya.”"
  },
  {
    "id": 31694,
    "hadith_number": 1861,
    "tajuk_hadith": "Ketetapan Denda Janji Tanpa Penentuan",
    "perawi_melayu": "Daripada 'Uqbah bin 'Amir al-Juhani, daripada Rasulullah SAW",
    "english_text": "\"Whoever makes a vow and does not state it specifically, the expiation (for such a vow) is the expiation for breaking an oath.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ رَافِعٍ، عَنْ خَالِدِ بْنِ يَزِيدَ، عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ نَذَرَ نَذْرًا وَلَمْ يُسَمِّهِ فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa yang bernazar dan tidak menyebutnya secara khusus, maka kafaratnya adalah kafarat melanggar sumpah."
  },
  {
    "id": 31695,
    "hadith_number": 1862,
    "tajuk_hadith": "Kefaarah Nazar dan Kemampuan Menunaikan Nuzur",
    "perawi_melayu": "Dikisahkan oleh Ibnu 'Abbas bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Whoever makes a vow and does not state it specifically, the expiation (for such a vow) is the expiation for breaking an oath. Whoever makes a vow and is not able to fulfill it, the expiation for that is the expiation for breaking an oath. Whoever makes a vow and is able to fulfill it, let him do so.\"",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ مُحَمَّدٍ الصَّنْعَانِيُّ، حَدَّثَنَا خَارِجَةُ بْنُ مُصْعَبٍ، عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَنْ نَذَرَ نَذْرًا وَلَمْ يُسَمِّهِ فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ وَمَنْ نَذَرَ نَذْرًا لَمْ يُطِقْهُ فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ وَمَنْ نَذَرَ نَذْرًا أَطَاقَهُ فَلْيَفِ بِهِ ‏\"‏ ‏.‏",
    "malay_translation": "\"Barangsiapa yang bernazar dan tidak menyebutnya secara khusus, maka kafaratnya adalah kafarat sumpah. Dan barangsiapa yang bernazar sesuatu yang dia tidak mampu tunaikan, maka kafaratnya adalah kafarat sumpah. Dan barangsiapa yang bernazar sesuatu yang dia mampu tunaikan, maka hendaklah dia tunaikannya.\""
  },
  {
    "id": 31696,
    "hadith_number": 1863,
    "tajuk_hadith": "Menunaikan Nazar di Zaman Jahiliyyah",
    "perawi_melayu": "Dikisahkan oleh 'Umar bin al-Khattab bahawa:",
    "english_text": "\"I made a vow during the Ignorance period and I asked the Prophet (ﷺ) (about it) after I became Muslim. He told me to fulfill my vow.\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، قَالَ نَذَرْتُ نَذْرًا فِي الْجَاهِلِيَّةِ فَسَأَلْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ بَعْدَ مَا أَسْلَمْتُ فَأَمَرَنِي أَنْ أُوفِيَ بِنَذْرِي ‏.‏",
    "malay_translation": "\"Aku pernah membuat nazar pada zaman Jahiliyyah. Setelah aku memeluk Islam, aku bertanya kepada Rasulullah SAW tentangnya. Baginda memerintahkan aku untuk menunaikan nazar tersebut.\""
  },
  {
    "id": 31697,
    "hadith_number": 1864,
    "tajuk_hadith": "Memenuhi Nazar dan Menjauhi Amal Jahiliah",
    "perawi_melayu": "Dikisahkan daripada Ibn Abbas bahawa seorang lelaki datang kepada Nabi SAW dan berkata:",
    "english_text": "\"O Messenger of Allah, I vowed to offer a sacrifice at Buwanah.\" He said: \"Do you intend any action of Ignorance period?\" He said: \"No.\" He said: \"Then fulfill your vow.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، وَعَبْدُ اللَّهِ بْنُ إِسْحَاقَ الْجَوْهَرِيُّ، قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ، أَنْبَأَنَا الْمَسْعُودِيُّ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَجُلاً، جَاءَ إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي نَذَرْتُ أَنْ أَنْحَرَ بِبُوَانَةَ فَقَالَ ‏\"‏ فِي نَفْسِكَ شَىْءٌ مِنْ أَمْرِ الْجَاهِلِيَّةِ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ أَوْفِ بِنَذْرِكَ ‏\"‏ ‏.‏",
    "malay_translation": "“Wahai Rasulullah, aku telah bernazar untuk menyembelih korban di Buwanah.” Baginda SAW bertanya, “Adakah ada sesuatu amalan zaman Jahiliah dalam niatmu?” Lelaki itu menjawab, “Tidak.” Baginda SAW bersabda, “Maka tunaikanlah nazarmu.”"
  },
  {
    "id": 31698,
    "hadith_number": 1865,
    "tajuk_hadith": "Mengingatkan Pemenuhan Nuzur (Janji) dan Ketiadaan Berhala di Buwanah",
    "perawi_melayu": "Daripada Maimunah binti Kardam Al-Yasariyyah, bahawa :",
    "english_text": "her father met the Prophet (ﷺ) when she was riding behind him. He said: \"I vowed to offer a sacrifice at Buwanah.\" The Messenger of Allah (ﷺ) said: \"Is there any idol there?\" He said: \"No.\" He said: \" Fulfill your vow.\" (Hasan)Another chain with similar wording.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الطَّائِفِيِّ، عَنْ مَيْمُونَةَ بِنْتِ كَرْدَمٍ الْيَسَارِيَّةِ، أَنَّ أَبَاهَا، لَقِيَ النَّبِيَّ ـ صلى الله عليه وسلم ـ وَهِيَ رَدِيفَةٌ لَهُ فَقَالَ إِنِّي نَذَرْتُ أَنْ أَنْحَرَ بِبُوَانَةَ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ هَلْ بِهَا وَثَنٌ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ أَوْفِ بِنَذْرِكَ ‏\"‏ ‏.‏ \n حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ دُكَيْنٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ يَزِيدَ بْنِ مِقْسَمٍ، عَنْ مَيْمُونَةَ بِنْتِ كَرْدَمٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ بِنَحْوِهِ ‏.‏",
    "malay_translation": "Bapa beliau bertemu dengan Nabi SAW ketika beliau menunggang di belakang baginda. Beliau berkata, \"Saya telah bernazar untuk menyembelih korban di Buwanah.\" Rasulullah SAW bertanya, \"Adakah ada berhala di sana?\" Beliau menjawab, \"Tidak.\" Baginda bersabda, \"Penuhilah nazarmu.\" (Hasan)  Hadis lain dengan lafaz yang serupa."
  },
  {
    "id": 31699,
    "hadith_number": 1866,
    "tajuk_hadith": "Memenuhi Nazar Ibu yang Meninggal Dunia",
    "perawi_melayu": "Dikisahkan oleh Ibn 'Abbas bahawa :",
    "english_text": "Sa'd bin 'Ubadah bertanya kepada Rasulullah SAW tentang suatu nazar yang dibuat oleh ibunya, tetapi beliau meninggal dunia tanpa menunaikannya. Rasulullah SAW bersabda: \"Tunaikanlah nazar itu bagi pihak beliau.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ سَعْدَ بْنَ عُبَادَةَ، اسْتَفْتَى رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ فِي نَذْرٍ كَانَ عَلَى أُمِّهِ تُوُفِّيَتْ وَلَمْ تَقْضِهِ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ اقْضِهِ عَنْهَا ‏\"‏ ‏.‏",
    "malay_translation": "Sa'd bin 'Ubadah bertanya kepada Rasulullah SAW tentang suatu nazar yang dibuat oleh ibunya, tetapi beliau meninggal dunia tanpa menunaikannya. Rasulullah SAW bersabda: \"Tunaikanlah nazar itu bagi pihak beliau.\""
  },
  {
    "id": 31700,
    "hadith_number": 1867,
    "tajuk_hadith": "Kewajiban Wali Mengganti Puasa Orang yang Meninggal",
    "perawi_melayu": "Dikisahkan oleh Jabir bin Abdullah bahawa:",
    "english_text": "a woman came to the Messenger of Allah (ﷺ) and said: \"My mother has died, and she had made a vow to fast, but she died before she could fulfill it. The Messenger of Allah (ﷺ) said: 'Let her guardian fast on her behalf .\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا ابْنُ لَهِيعَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، ‏.‏ أَنَّ امْرَأَةً، أَتَتْ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَتْ إِنَّ أُمِّي تُوُفِّيَتْ وَعَلَيْهَا نَذْرُ صِيَامٍ فَتُوُفِّيَتْ قَبْلَ أَنْ تَقْضِيَهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لِيَصُمْ عَنْهَا الْوَلِيُّ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang wanita datang menemui Rasulullah SAW dan berkata, \"Ibuku telah meninggal dunia, dan dia telah bernazar untuk berpuasa, tetapi beliau meninggal dunia sebelum dapat menunaikan nazarnya. Rasulullah SAW bersabda, 'Hendaklah walinya berpuasa menggantikannya.'\""
  },
  {
    "id": 31701,
    "hadith_number": 1868,
    "tajuk_hadith": "Arahan Kepada Wanita Yang Bernadzar Berjalan Tanpa Alas Kaki Dan Tanpa Tutup Kepala",
    "perawi_melayu": "Daripada Abu Sa'id al-Ru'aini, bahawa Abdullah bin Malik memberitahunya, bahawa 'Uqbah bin 'Amir memberitahunya, bahawa",
    "english_text": "'Uqbah  bin 'Amir told him, that his sister vowed to walk, barefoot and bareheaded, and he mentioned that to the Messenger of Allah (ﷺ) He said: \"Order her to ride and to cover her head, and to fast for three days.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ زَحْرٍ، عَنْ أَبِي سَعِيدٍ الرُّعَيْنِيِّ، أَنَّ عَبْدَ اللَّهِ بْنَ مَالِكٍ، أَخْبَرَهُ أَنَّ عُقْبَةَ بْنَ عَامِرٍ أَخْبَرَهُ أَنَّ أُخْتَهُ نَذَرَتْ أَنْ تَمْشِيَ حَافِيَةً غَيْرَ مُخْتَمِرَةٍ وَأَنَّهُ ذَكَرَ ذَلِكَ لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\n\"‏ مُرْهَا فَلْتَرْكَبْ وَلْتَخْتَمِرْ وَلْتَصُمْ ثَلاَثَةَ أَيَّامٍ ‏\"‏ ‏.‏",
    "malay_translation": "Dikisahkan oleh Abu Sa'id al-Ru'aini, bahawa Abdullah bin Malik memberitahunya, bahawa 'Uqbah bin 'Amir memberitahunya, bahawa saudarinya telah bernadzar untuk berjalan tanpa alas kaki dan tanpa menutup kepala. Kemudian, dia menceritakan perkara ini kepada Rasulullah SAW. Baginda bersabda, \"Suruhlah dia menunggang kenderaan, menutup kepalanya, dan berpuasa selama tiga hari.\""
  },
  {
    "id": 31702,
    "hadith_number": 1869,
    "tajuk_hadith": "Perintah Mengutamakan Kesihatan Orang Tua dalam Melaksanakan Nazar",
    "perawi_melayu": "Dikisahkan oleh Abu Hurairah bahawa:",
    "english_text": "\"The Prophet (ﷺ) saw an old man walking between his two sons, and he said: What is the matter with him?' His sons said: 'A vow, O Messenger of Allah.' He said: 'Let this old man ride, for Allah has no need of you or your vow.\"",
    "arabic_text": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ رَأَى النَّبِيُّ ـ صلى الله عليه وسلم ـ شَيْخًا يَمْشِي بَيْنَ ابْنَيْهِ فَقَالَ ‏\"‏ مَا شَأْنُ هَذَا ‏\"‏ ‏.‏ قَالَ ابْنَاهُ نَذْرٌ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ ارْكَبْ أَيُّهَا الشَّيْخُ فَإِنَّ اللَّهَ غَنِيٌّ عَنْكَ وَعَنْ نَذْرِكَ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW melihat seorang lelaki tua berjalan di antara dua anaknya. Baginda bertanya, \"Apa yang terjadi?\" Anak-anaknya menjawab, \"Bapa kami bernazar, wahai Rasulullah.\" Baginda bersabda, \"Naiklah, wahai lelaki tua, kerana Allah Maha Kaya dan tidak memerlukan nazarmu itu.\""
  },
  {
    "id": 31703,
    "hadith_number": 1870,
    "tajuk_hadith": "Ketetapan Nabi SAW Mengenai Janji Puasa dan Mencari Teduh",
    "perawi_melayu": "Daripada Ibn Abbas, bahawa Rasulullah SAW telah melihat seorang lelaki di Makkah berdiri di bawah terik matahari...",
    "english_text": "Messenger of Allah (ﷺ) passed by a man in Makkah who was standing in the sun. He said: \"What is this?\" They said: \"He vowed to fast and not to seek shade until night comes, and not to speak, and to remain standing.\" He said: \"Let him speak and seek shade and let him sit down, but let him complete his fast.\"Another chain from Ibn 'Abbas, from the Prophet (ﷺ), with similar wording. expiation for breaking an oath.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا إِسْحَاقُ بْنُ مُحَمَّدٍ الْفَرْوِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ مَرَّ بِرَجُلٍ بِمَكَّةَ وَهُوَ قَائِمٌ فِي الشَّمْسِ فَقَالَ ‏\"‏ مَا هَذَا ‏\"‏ ‏.‏ قَالُوا نَذَرَ أَنْ يَصُومَ وَلاَ يَسْتَظِلَّ إِلَى اللَّيْلِ وَلاَ يَتَكَلَّمَ وَلاَ يَزَالَ قَائِمًا ‏.‏ قَالَ ‏\"‏ لِيَتَكَلَّمْ وَلْيَسْتَظِلَّ وَلْيَجْلِسْ وَلْيُتِمَّ صِيَامَهُ ‏\"‏ ‏.‏ \n حَدَّثَنَا الْحُسَيْنُ بْنُ مُحَمَّدِ بْنِ شَنَبَةَ الْوَاسِطِيُّ، حَدَّثَنَا الْعَلاَءُ بْنُ عَبْدِ الْجَبَّارِ، عَنْ وُهَيْبٍ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ نَحْوَهُ وَاللَّهُ أَعْلَمُ ‏.‏",
    "malay_translation": "Rasulullah SAW melihat seorang lelaki di Mekah berdiri di bawah terik matahari. Baginda bertanya, \"Apakah ini?\" Orang ramai menjawab, \"Dia berjanji untuk berpuasa dan tidak mencari tempat teduh sehingga malam tiba, tidak berkata-kata, dan tetap berdiri.\" Baginda bersabda, \"Biarlah dia bercakap, mencari tempat teduh, duduk, dan menyempurnakan puasanya.\"  Hadis lain dari Ibn Abbas dari Nabi SAW turut mengandungi makna yang sama.  (Catatan: Bahagian akhir tentang denda kerana melanggar sumpah tidak terdapat dalam hadith ini.)"
  }
]