[
  {
    "id": 32081,
    "hadith_number": 2248,
    "tajuk_hadith": "Rasulullah SAW Menjual Barang Mudabbar",
    "perawi_melayu": "Dikisahkan daripada Jabir bahawa:",
    "english_text": "the Messenger of Allah (ﷺ) sold a Mudabbar.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ ذصلى الله عليه وسلم بَاعَ الْمُدَبَّرَ ‏.‏",
    "malay_translation": "Daripada Jabir, bahawa Rasulullah SAW telah menjual barang mudabbar."
  },
  {
    "id": 32082,
    "hadith_number": 2249,
    "tajuk_hadith": "Penjualan Hamba Sahaya Oleh Nabi SAW Sebagai Pembebasan Janji",
    "perawi_melayu": "Dikisahkan oleh Jabir bin Abdullah berkata:",
    "english_text": "“A man among us promised freedom to a slave after his death, and he did not have any property other than him (this slave). So the Prophet (ﷺ) sold him, and Ibn (Nahham), a man from Banu 'Adi, bought him.”",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ دَبَّرَ رَجُلٌ مِنَّا غُلاَمًا وَلَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُ فَبَاعَهُ النَّبِيُّ صلى الله عليه وسلم فَاشْتَرَاهُ ابْنُ النَّحَّامِ رَجُلٌ مِنْ بَنِي عَدِيٍّ ‏.‏",
    "malay_translation": "“Seseorang di antara kita telah berjanji untuk membebaskan seorang hamba sahaya setelah kematiannya, dan dia tidak memiliki harta selain hamba sahaya tersebut. Maka Nabi SAW menjual hamba sahaya itu, dan Ibnu Nahham, seorang lelaki daripada Bani ‘Adi, membelinya.”"
  },
  {
    "id": 32083,
    "hadith_number": 2250,
    "tajuk_hadith": "Penjelasan tentang Mudabbar dalam Harta Pusaka",
    "perawi_melayu": "Diceritakan daripada Ibn `Umar bahawa Rasulullah SAW bersabda:",
    "english_text": "“The Mudabbar is part of the one third of the estate.”",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ ظَبْيَانَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ الْمُدَبَّرُ مِنَ الثُّلُثِ ‏\"‏ ‏.‏ قَالَ ابْنُ مَاجَهْ سَمِعْتُ عُثْمَانَ - يَعْنِي ابْنَ أَبِي شَيْبَةَ - يَقُولُ هَذَا خَطَأٌ يَعْنِي حَدِيثَ ‏\"‏ الْمُدَبَّرُ مِنَ الثُّلُثِ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ لَيْسَ لَهُ أَصْلٌ ‏.‏",
    "malay_translation": "\"Mudabbar adalah sebahagian daripada satu pertiga harta pusaka.\""
  },
  {
    "id": 32084,
    "hadith_number": 2251,
    "tajuk_hadith": "Kebebasan Hamba Wanita yang Melahirkan Anak",
    "perawi_melayu": "Daripada Ibnu Abbas, bahawa Rasulullah SAW bersabda:",
    "english_text": "“Any man whose slave won an bears him a child, she will be free after he dies.”",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَمُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا شَرِيكٌ، عَنْ حُسَيْنِ بْنِ عَبْدِ اللَّهِ بْنِ عُبَيْدِ اللَّهِ بْنِ عَبَّاسٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَيُّمَا رَجُلٍ وَلَدَتْ أَمَتُهُ مِنْهُ فَهِيَ مُعْتَقَةٌ عَنْ دُبُرٍ مِنْهُ ‏\"‏ ‏.‏",
    "malay_translation": "“Sesiapa lelaki yang hamba wanitanya melahirkan anak baginya, maka dia dibebaskan daripada perhambaan selepas kematiannya.”"
  },
  {
    "id": 32085,
    "hadith_number": 2252,
    "tajuk_hadith": "Kebebasan Ibu Ibrahim",
    "perawi_melayu": "Dikisahkan oleh Ibn`Abbas bahawa:",
    "english_text": "“Mention was made of the mother of Ibrahim in the presence of the Messenger of Allah (ﷺ), and he said: 'Her son set her free.'”",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُوسُفَ، حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنَا أَبُو بَكْرٍ يَعْنِي النَّهْشَلِيَّ، عَنِ الْحُسَيْنِ بْنِ عَبْدِ اللَّهِ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ ذُكِرَتْ أُمُّ إِبْرَاهِيمَ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَقَالَ ‏\n\"‏ أَعْتَقَهَا وَلَدُهَا ‏\"‏ ‏.‏",
    "malay_translation": "Disebutkan tentang ibu Ibrahim di hadapan Rasulullah SAW. Baginda bersabda, \"Anaknya telah membebaskannya (dari perhambaan).\""
  },
  {
    "id": 32086,
    "hadith_number": 2253,
    "tajuk_hadith": "Perdagangan Hamba dan Ibunda Anak di Zaman Rasulullah SAW",
    "perawi_melayu": "Jabir bin Abdullah telah mendengar berkata:",
    "english_text": "“We used to sell our slave women and the mothers of our children (Umahat Awaldina) when the Prophet (ﷺ) was still living among us, and we did not see anything wrong with that.”",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، وَإِسْحَاقُ بْنُ مَنْصُورٍ، قَالاَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ كُنَّا نَبِيعُ سَرَارِينَا وَأُمَّهَاتِ أَوْلاَدِنَا وَالنَّبِيُّ صلى الله عليه وسلم فِينَا حَىٌّ لاَ نَرَى بِذَلِكَ بَأْسًا ‏.‏",
    "malay_translation": "Kami pernah menjual hamba perempuan dan ibu-ibu anak kami (Umahat Awaldina) ketika Rasulullah SAW masih hidup di kalangan kami, dan kami tidak melihat ada salahnya dalam perkara itu."
  },
  {
    "id": 32087,
    "hadith_number": 2254,
    "tajuk_hadith": "Tiga Golongan yang Mendapat Tuntutan Kebaikan dari Allah",
    "perawi_melayu": "Abu Hurairah (ra) meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "the warrior in the path of Allah, the  mukatab seeking to fulfill (his manumission debt), and the one getting married seeking chastity.\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَبْدُ اللَّهِ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنِ ابْنِ عَجْلاَنَ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ ثَلاَثَةٌ كُلُّهُمْ حَقٌّ عَلَى اللَّهِ عَوْنُهُ الْغَازِي فِي سَبِيلِ اللَّهِ وَالْمُكَاتَبُ الَّذِي يُرِيدُ الأَدَاءَ وَالنَّاكِحُ الَّذِي يُرِيدُ التَّعَفُّفَ ‏\"‏ ‏.‏",
    "malay_translation": "Tiga golongan yang mendapat pertolongan Allah adalah: pejuang di jalan Allah, orang yang sedang membayar hutang (mukatab) dan orang yang ingin menjaga kehormatannya dalam perkahwinan."
  },
  {
    "id": 32088,
    "hadith_number": 2255,
    "tajuk_hadith": "Hukum Perhambaan dalam Pembebasan Diri",
    "perawi_melayu": "Dikisahkan oleh `Amr bin Shu'aib, dari bapanya, dari datuknya bahawa Rasulullah SAW bersabda:",
    "english_text": "“Any slave who has made a contract to buy his freedom for one hundread  Uqiyyah  and pays it all except ten Uqiyyah; he is still a slave.” (One Uqiyyah is equal to 40 Dirham.)",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَمُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ حَجَّاجٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَيُّمَا عَبْدٍ كُوتِبَ عَلَى مِائَةِ أُوقِيَّةٍ فَأَدَّاهَا إِلاَّ عَشْرَ أُوقِيَّاتٍ فَهُوَ رَقِيقٌ ‏\"‏ ‏.‏",
    "malay_translation": "\"Sesiapa hamba yang telah berjanji untuk membeli kebebasannya dengan harga seratus Uqiyyah dan membayar semuanya kecuali sepuluh Uqiyyah, maka dia masih tetap hamba.\" (Satu Uqiyyah bersamaan dengan 40 Dirham.)"
  },
  {
    "id": 32089,
    "hadith_number": 2256,
    "tajuk_hadith": "Kewajipan Berhijab bagi Wanita yang Memiliki Mukatab",
    "perawi_melayu": "Daripada Umm Salamah, bahawa Nabi SAW bersabda:",
    "english_text": "“If anyone of you (women) has a Mukatab, and he has enough (wealth) to pay off (his contact of manumission), she must veil herself from him.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ نَبْهَانَ، - مَوْلَى أُمِّ سَلَمَةَ - عَنْ أُمِّ سَلَمَةَ، أَنَّهَا أَخْبَرَتْ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ إِذَا كَانَ لإِحْدَاكُنَّ مُكَاتَبٌ وَكَانَ عِنْدَهُ مَا يُؤَدِّي فَلْتَحْتَجِبْ مِنْهُ ‏\"‏ ‏.‏",
    "malay_translation": "“Jika ada di antara kamu (wanita) yang mempunyai Mukatab, dan dia mempunyai harta yang mencukupi untuk melunaskan (perjanjian pembebasan), maka hendaklah dia menutup auratnya daripadanya.”"
  },
  {
    "id": 32090,
    "hadith_number": 2257,
    "tajuk_hadith": "Ketetapan Perjanjian Pembebasan Budak dan Kewajipan Kepada Pemilik Asal",
    "perawi_melayu": "Daripada Hisham bin 'Urwah, daripada bapanya, daripada 'Aishah isteri Nabi SAW",
    "english_text": "that  Barirah came to her when she was came to her when she was Muktabah, and her masters had written a contract of manumission for nine Uqiyyah. She (`Aishah) said: “If your masters wish I will pay them that in one sum, and the right of inheritance will belong to me.”\n\nHe said: “So she went to her masters and told them about that, but they insisted that the right of inheritance should belong to them. `Aishah mentioned that to the Prophet (ﷺ) and he said: 'Do it.' Then the Prophet (ﷺ) stood up and addressed the people. He praised and glorified Allah (SWT), then he said: 'What is the matter with some people who stipulated conditions that are not in the Book of Allah (SWT)? Every conditions that is not in the Book of Allah (SWT)  is invalid, even if there are one hundred conditions. The Book of Allah(SWT) is more deserving of being followed and the conditions of Allah (SWT) are more binding. And the Wala belongs to the one who manumits (the slave).”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ بَرِيرَةَ أَتَتْهَا وَهِيَ مُكَاتَبَةٌ قَدْ كَاتَبَهَا أَهْلُهَا عَلَى تِسْعِ أَوَاقٍ فَقَالَتْ لَهَا إِنْ شَاءَ أَهْلُكِ عَدَدْتُ لَهُمْ عَدَّةً وَاحِدَةً وَكَانَ الْوَلاَءُ لِي قَالَ فَأَتَتْ أَهْلَهَا فَذَكَرَتْ ذَلِكَ لَهُمْ فَأَبَوْا إِلاَّ أَنْ تَشْتَرِطَ الْوَلاَءَ لَهُمْ فَذَكَرَتْ عَائِشَةُ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ افْعَلِي ‏\"‏ ‏.‏ قَالَتْ فَقَامَ النَّبِيُّ صلى الله عليه وسلم فَخَطَبَ النَّاسَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏\"‏ مَا بَالُ رِجَالٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ كُلُّ شَرْطٍ لَيْسَ فِي كِتَابِ اللَّهِ فَهُوَ بَاطِلٌ وَإِنْ كَانَ مِائَةَ شَرْطٍ كِتَابُ اللَّهِ أَحَقُّ وَشَرْطُ اللَّهِ أَوْثَقُ وَالْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏ ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Bakar bin Abi Syaibah dan Ali bin Muhammad, keduanya berkata telah menceritakan kepada kami Wakī' daripada Hisham bin 'Urwah daripada bapanya daripada 'Aishah, isteri Nabi SAW, bahawa Barirah telah datang kepadanya ketika beliau dalam keadaan Mukatabah, dan tuan-tuan rumahnya telah mengikat perjanjian pembebasan untuk sembilan uqiyyah.  Lalu beliau (Aishah) berkata, \"Jika tuan-tuan rumah mahu, saya akan membayarnya sekaligus, dan hak waris akan menjadi kepunyaan saya.\"\n\nLalu beliau (Aishah) berkata, \"Maka beliau pergi kepada tuan-tuannya dan memberitahu mereka tentang perkara itu, tetapi mereka enggan melainkan hendak menetapkan hak waris adalah kepunyaan mereka. Aishah menceritakan perkara itu kepada Nabi SAW, dan baginda bersabda, 'Lakukanlah.' Kemudian Nabi SAW bangun dan berucap kepada orang ramai. Baginda memuji dan mengagungkan Allah SWT, kemudian bersabda, 'Apakah yang berlaku kepada segelintir manusia yang menetapkan syarat-syarat yang tidak terdapat dalam Kitab Allah? Setiap syarat yang tidak terdapat dalam Kitab Allah adalah batal, walaupun seratus syarat. Kitab Allah SWT lebih berhak diikuti, dan syarat-syarat Allah SWT lebih kukuh. Dan wala' (pertalian) kepunyaan orang yang membebaskan (hamba itu).\" "
  },
  {
    "id": 32091,
    "hadith_number": 2258,
    "tajuk_hadith": "Membebaskan Seorang Muslim Dari Api Neraka Sebagai Penyelamat",
    "perawi_melayu": "Diriwayatkan bahawa Shurahbil bin Simt berkata:",
    "english_text": "I said to Ka'b bin Murrah, tell us a Hadith from the Messenger of Allah (ﷺ), but be careful. He said: I heard the Messenger of Allah (ﷺ) say: “Whoever frees a Muslim man, he will be his ransom from the Fire; each of his bones will suffice (as a ransom) for each of his bones. Whoever frees two Muslim women, they will be his ransom from the Fire; each of their two bones will suffice (as a ransom) for each of his bones.”",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ شُرَحْبِيلَ بْنِ السِّمْطِ، قَالَ قُلْتُ لِكَعْبٍ يَا كَعْبَ بْنَ مُرَّةَ حَدِّثْنَا عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَاحْذَرْ ‏.‏ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ أَعْتَقَ امْرَأً مُسْلِمًا كَانَ فِكَاكَهُ مِنَ النَّارِ يُجْزِئُ بِكُلِّ عَظْمٍ مِنْهُ عَظْمٌ مِنْهُ وَمَنْ أَعْتَقَ امْرَأَتَيْنِ مُسْلِمَتَيْنِ كَانَتَا فِكَاكَهُ مِنَ النَّارِ يُجْزِئُ بِكُلِّ عَظْمَيْنِ مِنْهُمَا عَظْمٌ مِنْهُ ‏\"‏ ‏.‏",
    "malay_translation": "Aku berkata kepada Ka'b bin Murrah, ceritakan kepada kami sebuah hadis daripada Rasulullah SAW, namun berhati-hatilah. Beliau berkata, \"Aku mendengar Rasulullah SAW bersabda:\" Barangsiapa yang memerdekakan seorang lelaki Muslim, maka pembebasannya itu akan menjadi tebusan daripada api neraka; setiap tulang badannya mencukupi (sebagai tebusan) bagi setiap tulang badannya. Dan barangsiapa yang memerdekakan dua orang wanita Muslim, maka pembebasan mereka itu akan menjadi tebusan daripada api neraka; setiap dua tulang mereka mencukupi (sebagai tebusan) bagi setiap tulang badannya.\""
  },
  {
    "id": 32092,
    "hadith_number": 2259,
    "tajuk_hadith": "Keutamaan Hamba Allah dan Harga Diri",
    "perawi_melayu": "Dikisahkan oleh Abu Dzar bahawa:",
    "english_text": "“I said: 'O Messenger of Allah (ﷺ), which slave is best?' He said: ‘The one who is most precious to his master and most valuable in price.' ”",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ أَبِي مُرَاوِحٍ، عَنْ أَبِي ذَرٍّ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَىُّ الرِّقَابِ أَفْضَلُ قَالَ ‏\n\"‏ أَنْفَسُهَا عِنْدَ أَهْلِهَا وَأَغْلاَهَا ثَمَنًا ‏\"‏ ‏.‏",
    "malay_translation": "“Aku bertanya, 'Wahai Rasulullah, hamba sahaya yang mana paling mulia?' Baginda menjawab, 'Hamba sahaya yang paling berharga di sisi tuannya dan paling mahal harganya.' ”"
  },
  {
    "id": 32093,
    "hadith_number": 2260,
    "tajuk_hadith": "Kebebasan Bagi Yang Merawat Mahram",
    "perawi_melayu": "Daripada Samurah bin Jundub, daripada Nabi saw.",
    "english_text": "“Whoever becomes the master of a Mahram relative (with whom marriage is not lawful), he becomes free.”",
    "arabic_text": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ، وَإِسْحَاقُ بْنُ مَنْصُورٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ قَتَادَةَ، وَعَاصِمٍ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ بْنِ جُنْدُبٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ مَلَكَ ذَا رَحِمٍ مَحْرَمٍ فَهُوَ حُرٌّ ‏\"‏ ‏.‏",
    "malay_translation": "“Barangsiapa yang menjadi penjaga atau wali kepada kerabat mahram (yang haram dinikahi), maka dia bebas.”"
  },
  {
    "id": 32094,
    "hadith_number": 2261,
    "tajuk_hadith": "Kebebasan Orang Yang Memuliakan Kerabat Mahram",
    "perawi_melayu": "Dikisahkan oleh Ibnu Umar bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Whoever becomes the master of a Mahram relative, he becomes free.\"",
    "arabic_text": "حَدَّثَنَا رَاشِدُ بْنُ سَعِيدٍ الرَّمْلِيُّ، وَعُبَيْدُ اللَّهِ بْنُ الْجَهْمِ الأَنْمَاطِيُّ، قَالاَ حَدَّثَنَا ضَمْرَةُ بْنُ رَبِيعَةَ، عَنْ سُفْيَانَ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ مَلَكَ ذَا رَحِمٍ مَحْرَمٍ فَهُوَ حُرٌّ ‏\"‏ ‏.‏",
    "malay_translation": "Sesiapa yang menjaga dan memuliakan kerabat mahramnya, maka dia akan dibebaskan daripada beban tertentu."
  },
  {
    "id": 32095,
    "hadith_number": 2262,
    "tajuk_hadith": "Kebebasan dan Perkhidmatan kepada Rasulullah SAW",
    "perawi_melayu": "Dikatakan oleh Safinah binti Abu Abdurrahman",
    "english_text": "“Umm Salamah membebaskan saya tetapi mewajibkan saya melayani Nabi (ﷺ) selama beliau hidup.”",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُعَاوِيَةَ الْجُمَحِيُّ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ سَعِيدِ بْنِ جُمْهَانَ، عَنْ سَفِينَةَ أَبِي عَبْدِ الرَّحْمَنِ، قَالَ أَعْتَقَتْنِي أُمُّ سَلَمَةَ وَاشْتَرَطَتْ عَلَىَّ أَنْ أَخْدُمَ النَّبِيَّ صلى الله عليه وسلم مَا عَاشَ ‏.‏",
    "malay_translation": "\"Umm Salamah membebaskan saya, tetapi beliau mewajibkan saya untuk berkhidmat kepada Nabi SAW selama hayat baginda.\""
  },
  {
    "id": 32096,
    "hadith_number": 2263,
    "tajuk_hadith": "Membebaskan Hamba yang Dipenggal",
    "perawi_melayu": "Daripada Abu Hurairah bahawa Rasulullah SAW bersabda:",
    "english_text": "“Whoever frees his share of a slave or part of his share, must pay from his wealth if he has any wealth if he has any wealth (in order to buy the rest of the slave's freedom). If he does not have wealth, then the slave should be asked to work for the price (of his freedom), without that causing him too much hardship.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، وَمُحَمَّدُ بْنُ بِشْرٍ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ أَعْتَقَ نَصِيبًا لَهُ فِي مَمْلُوكٍ أَوْ شِقْصًا فَعَلَيْهِ خَلاَصُهُ مِنْ مَالِهِ إِنْ كَانَ لَهُ مَالٌ فَإِنْ لَمْ يَكُنْ لَهُ مَالٌ اسْتُسْعِيَ الْعَبْدُ فِي قِيمَتِهِ غَيْرَ مَشْقُوقٍ عَلَيْهِ ‏\"‏ ‏.‏",
    "malay_translation": "“Barangsiapa yang membebaskan sebahagian daripada hambanya atau sebahagian daripada pegangannya, maka wajiblah atasnya untuk membayar harga pembebasan daripada hartanya jika dia mempunyai harta. Jika dia tidak mempunyai harta, maka hamba itu perlu diminta bekerja untuk harga pembebasannya, tanpa menyebabkan kesusahan yang berlebihan kepadanya.”"
  },
  {
    "id": 32097,
    "hadith_number": 2264,
    "tajuk_hadith": "Membebaskan Hamba Sahaya Bersama-sama",
    "perawi_melayu": "Daripada Ibn Umar, daripada Rasulullah SAW",
    "english_text": "“Whoever frees his share of a slave, the price of the slave should be fairly evaluated, and he (the partner who initiated this process) should free him (in full, by giving the rest of his price to the other co-owners), if he has enough wealth to do so. Otherwise, he will have freed whatever he freed.”",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ أَعْتَقَ شِرْكًا لَهُ فِي عَبْدٍ أُقِيمَ عَلَيْهِ بِقِيمَةِ عَدْلٍ فَأَعْطَى شُرَكَاءَهُ حِصَصَهُمْ إِنْ كَانَ لَهُ مِنَ الْمَالِ مَا يَبْلُغُ ثَمَنَهُ وَعَتَقَ عَلَيْهِ الْعَبْدُ وَإِلاَّ فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ ‏\"‏ ‏.‏",
    "malay_translation": "“Barangsiapa yang membebaskan bahagiannya daripada seorang hamba, maka harga hamba itu hendaklah dinilai secara adil, dan dia (yang memulakan proses ini) hendaklah membebaskan sepenuhnya hamba tersebut (dengan memberikan baki harganya kepada para pemilik bersama yang lain), jika dia mempunyai harta yang mencukupi untuk melakukannya. Jika tidak, maka dia telah membebaskan sebanyak yang telah dibebaskannya.”"
  },
  {
    "id": 32098,
    "hadith_number": 2265,
    "tajuk_hadith": "Kebebasan Membebaskan Hamba dan Harta Kekayaannya",
    "perawi_melayu": "Diceritakan daripada Ibn `Umar bahawa Rasulullah SAW bersabda:",
    "english_text": "“Whoever frees a slave who has some wealth, the slave's wealth belongs to him, unless the master stipulates that it will belong to him.”",
    "arabic_text": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي ابْنُ لَهِيعَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، جَمِيعًا عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ، عَنْ بُكَيْرِ بْنِ الأَشَجِّ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ أَعْتَقَ عَبْدًا وَلَهُ مَالٌ فَمَالُ الْعَبْدِ لَهُ إِلاَّ أَنْ يَشْتَرِطَ السَّيِّدُ مَالَهُ فَيَكُونَ لَهُ ‏\"‏ ‏.‏ وَقَالَ ابْنُ لَهِيعَةَ إِلاَّ أَنْ يَسْتَثْنِيَهُ السَّيِّدُ ‏.‏",
    "malay_translation": "“Barangsiapa yang membebaskan seorang hamba yang memiliki harta, maka harta hamba itu miliknya, melainkan jika tuan menetapkan bahawa hartanya akan menjadi miliknya.”"
  },
  {
    "id": 32099,
    "hadith_number": 2266,
    "tajuk_hadith": "Pembebasan Hamba dan Harta Miliknya",
    "perawi_melayu": "Dikisahkan oleh Ishaq bin Ibrahim, dari datuknya 'Umair, yang merupakan hamba yang dibebaskan oleh Ibn Mas'ud, bahawa `Abdullah berkata kepadanya:",
    "english_text": "“O Umair, I have set you free in a good way. I heard the Messenger of Allah (ﷺ) say: 'Any man who frees a slave and does not say anything about his (the slave's) wealth, it belongs to him (the slave).' So tell me, how much wealth do you have?”\n\nAnother chain reports a similar hadith.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا سَعِيدُ بْنُ مُحَمَّدٍ الْجَرْمِيُّ، حَدَّثَنَا الْمُطَّلِبُ بْنُ زِيَادٍ، عَنْ إِسْحَاقَ بْنِ إِبْرَاهِيمَ، عَنْ جَدِّهِ، عُمَيْرٍ - وَهُوَ مَوْلَى ابْنِ مَسْعُودٍ - أَنَّ عَبْدَ اللَّهِ، قَالَ لَهُ يَا عُمَيْرُ إِنِّي أُعْتِقُكَ عِتْقًا هَنِيئًا إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ أَيُّمَا رَجُلٍ أَعْتَقَ غُلاَمًا وَلَمْ يُسَمِّ مَالَهُ فَالْمَالُ لَهُ ‏\"‏ ‏.‏ فَأَخْبِرْنِي مَا مَالُكَ ‏.‏ \n\n حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا الْمُطَّلِبُ بْنُ زِيَادٍ، عَنْ إِسْحَاقَ بْنِ إِبْرَاهِيمَ، قَالَ قَالَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ لِجَدِّي فَذَكَرَ نَحْوَهُ ‏.‏",
    "malay_translation": "\"Wahai Umair, aku membebaskan engkau dengan cara yang baik. Aku telah mendengar Rasulullah SAW bersabda: 'Sesiapa yang membebaskan hamba dan tidak menyebut tentang hartanya, maka harta itu adalah kepunyaan hamba itu.' Oleh itu, beritahu aku berapa banyak hartanya?'\n\nRiwayat lain turut menceritakan hadith yang serupa."
  },
  {
    "id": 32100,
    "hadith_number": 2267,
    "tajuk_hadith": "Keutamaan Berjuang di Jalan Allah Berbanding Membebaskan Anak Haram",
    "perawi_melayu": "Daripada Maimunah binti Sa`d, hamba sahaya perempuan yang dibebaskan oleh Nabi SAW, yang meriwayatkan:",
    "english_text": "the Messenger of Allah (ﷺ) was asked about illegitimate children. He said: “Two sandals in which I wage Jihad are better than freeing an illegitimate child.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ زَيْدِ بْنِ جُبَيْرٍ، عَنْ أَبِي يَزِيدَ الضِّنِّيِّ، عَنْ مَيْمُونَةَ بِنْتِ سَعْدٍ، - مَوْلاَةِ النَّبِيِّ صلى الله عليه وسلم - أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ عَنْ وَلَدِ الزِّنَا فَقَالَ ‏\n\"‏ نَعْلاَنِ أُجَاهِدُ فِيهِمَا خَيْرٌ مِنْ أَنْ أُعْتِقَ وَلَدَ الزِّنَا ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW ditanya tentang anak haram. Baginda menjawab, \"Dua sandal yang aku gunakan untuk berjihad lebih baik daripada membebaskan anak haram.\""
  },
  {
    "id": 32101,
    "hadith_number": 2268,
    "tajuk_hadith": "Arahan Membebaskan Hamba Lelaki Sebelum Wanita",
    "perawi_melayu": "Dikisahkan bahawa:",
    "english_text": "Aishah had a male slave and a female slave who were married. She said: “O Messenger of Allah (ﷺ), I want to free them both.” The Messenger of Allah (ﷺ) said: “If you free them, then start with the man before the woman.”",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ خَلَفٍ الْعَسْقَلاَنِيُّ، وَإِسْحَاقُ بْنُ مَنْصُورٍ، قَالاَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، أَنَّهَا كَانَ لَهَا غُلاَمٌ وَجَارِيَةٌ زَوْجٌ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي أُرِيدُ أَنْ أُعْتِقَهُمَا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنْ أَعْتَقْتِهِمَا فَابْدَئِي بِالرَّجُلِ قَبْلَ الْمَرْأَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Aishah mempunyai seorang hamba lelaki dan seorang hamba perempuan yang berkahwin. Baginda berkata, \"Wahai Rasulullah, aku ingin membebaskan mereka berdua.\" Rasulullah saw bersabda, \"Jika engkau ingin membebaskan mereka, mulakan dengan lelaki terlebih dahulu sebelum perempuan.\""
  }
]