[
  {
    "id": 31704,
    "hadith_number": 1871,
    "tajuk_hadith": "Keutamaan Makanan Hasil Usaha Sendiri dan Anak Sebagai Sebagian Hasil Usaha",
    "perawi_melayu": "Daripada 'Aisyah, bahawa Rasulullah SAW bersabda:",
    "english_text": "'The best (most pure) food a man consumes is that which he has earned himself, and his child (and his child's wealth) is part of his earnings.\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ بْنِ حَبِيبٍ، قَالُوا حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِنَّ أَطْيَبَ مَا أَكَلَ الرَّجُلُ مِنْ كَسْبِهِ وَإِنَّ وَلَدَهُ مِنْ كَسْبِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Sesungguhnya makanan yang paling baik yang dimakan seseorang ialah yang diperolehnya melalui usahanya sendiri, dan anak-anaknya (serta harta anak-anaknya) adalah sebahagian daripada hasil usahanya."
  },
  {
    "id": 31705,
    "hadith_number": 1872,
    "tajuk_hadith": "Keutamaan Usaha Sendiri dan Pembelanjaan untuk Keluarga",
    "perawi_melayu": "Dari Miqdam bin Ma'dikarib al-Zubaidi, dari Rasulullah SAW.",
    "english_text": "\"No man earns anything better than that which he earns with his own hands, and what a man spends on himself, his wife, his child and his servant, then it is charity.\"",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، عَنْ بَحِيرِ بْنِ سَعْدٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنِ الْمِقْدَامِ بْنِ مَعْدِيكَرِبَ الزُّبَيْدِيِّ، عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَا كَسَبَ الرَّجُلُ كَسْبًا أَطْيَبَ مِنْ عَمَلِ يَدِهِ وَمَا أَنْفَقَ الرَّجُلُ عَلَى نَفْسِهِ وَأَهْلِهِ وَوَلَدِهِ وَخَادِمِهِ فَهُوَ صَدَقَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Tidak ada usaha yang lebih baik bagi seseorang daripada hasil usaha tangannya sendiri. Dan apa yang dibelanjakan seseorang untuk dirinya, keluarganya, anak-anaknya, dan pembantunya, maka ia adalah sedekah."
  },
  {
    "id": 31706,
    "hadith_number": 1873,
    "tajuk_hadith": "Pedagang Yang Amanah Bersama Syuhada pada Hari Kiamat",
    "perawi_melayu": "Dikisahkan daripada Ibn 'Umar bahawa Rasulullah SAW bersabda:",
    "english_text": "'The trustworthy, honest Muslim merchant will be with the martyrs on the Day of Resurrection.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ، حَدَّثَنَا كَثِيرُ بْنُ هِشَامٍ، حَدَّثَنَا كُلْثُومُ بْنُ جَوْشَنٍ الْقُشَيْرِيُّ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ التَّاجِرُ الأَمِينُ الصَّدُوقُ الْمُسْلِمُ مَعَ الشُّهَدَاءِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "“Pedagang yang amanah dan jujur yang Muslim akan bersama syuhada pada Hari Kiamat.”"
  },
  {
    "id": 31707,
    "hadith_number": 1874,
    "tajuk_hadith": "Keutamaan Menolong Janda dan Orang Miskin",
    "perawi_melayu": "Diceritakan daripada Abu Hurairah bahawa Rasulullah SAW bersabda:",
    "english_text": "'The one who strives to support the widow and the poor is like a Mujahid who fights in the cause of Allah, and like one who stands in the night (in voluntary prayer) and fasts by day.\"",
    "arabic_text": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ الدَّرَاوَرْدِيُّ، عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ، عَنْ أَبِي الْغَيْثِ، مَوْلَى ابْنِ مُطِيعٍ عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ السَّاعِي عَلَى الأَرْمَلَةِ وَالْمِسْكِينِ كَالْمُجَاهِدِ فِي سَبِيلِ اللَّهِ وَكَالَّذِي يَقُومُ اللَّيْلَ وَيَصُومُ النَّهَارَ ‏\"‏ ‏.‏",
    "malay_translation": "Orang yang berusaha menolong janda dan orang miskin adalah seperti mujahid yang berjihad di jalan Allah, dan seperti orang yang mendirikan solat malam dan berpuasa pada siang hari."
  },
  {
    "id": 31708,
    "hadith_number": 1875,
    "tajuk_hadith": "Kegembiraan dan Kesihatan yang Baik Lebih Utama daripada Kekayaan",
    "perawi_melayu": "Dikisahkan oleh Mu'adh bin 'Abdullah bin Khubaib daripada bapanya, daripada pakciknya, bahawa:",
    "english_text": "\"We were sitting in a gathering, and the Prophet (ﷺ) came with traces of water on his head. One of us said to him: 'We see that you are of good cheer today.' He said: 'Yes, praise is to Allah.' Then he spoke to the people about being rich. He said: 'There is nothing wrong with being rich for one who has piety, but good health for one who has piety is better than riches, and being of good cheer is a blessing.\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سُلَيْمَانَ، عَنْ مُعَاذِ بْنِ عَبْدِ اللَّهِ بْنِ خُبَيْبٍ، عَنْ أَبِيهِ، عَنْ عَمِّهِ، قَالَ كُنَّا فِي مَجْلِسٍ فَجَاءَ النَّبِيُّ ـ صلى الله عليه وسلم ـ وَعَلَى رَأْسِهِ أَثَرُ مَاءٍ فَقَالَ لَهُ بَعْضُنَا نَرَاكَ الْيَوْمَ طَيِّبَ النَّفْسِ ‏.‏ فَقَالَ ‏\"‏ أَجَلْ وَالْحَمْدُ لِلَّهِ ‏\"‏ ‏.‏ ثُمَّ أَفَاضَ الْقَوْمُ فِي ذِكْرِ الْغِنَى فَقَالَ ‏\"‏ لاَ بَأْسَ بِالْغِنَى لِمَنِ اتَّقَى وَالصِّحَّةُ لِمَنِ اتَّقَى خَيْرٌ مِنَ الْغِنَى وَطِيبُ النَّفْسِ مِنَ النِّعَمِ ‏\"‏ ‏.‏",
    "malay_translation": "Kami duduk dalam suatu majlis, dan Nabi SAW datang dengan kesan air di kepalanya. Salah seorang daripada kami berkata kepadanya, 'Kami melihat bahawa Engkau ceria hari ini.' Baginda menjawab, 'Ya, segala puji bagi Allah.' Kemudian Baginda membicarakan tentang kekayaan kepada orang ramai. Baginda bersabda, 'Tidak mengapa kaya bagi orang yang bertakwa, tetapi kesihatan yang baik bagi orang yang bertakwa lebih baik daripada kekayaan, dan kegembiraan merupakan nikmat.' "
  },
  {
    "id": 31709,
    "hadith_number": 1876,
    "tajuk_hadith": "Kesederhanaan dalam Mencari Duniawi",
    "perawi_melayu": "Diceritakan oleh Abu Humaid As-Sa'idi bahawa Rasulullah SAW bersabda:",
    "english_text": "Be moderate in seeking worldly things, for everyone will be facilitated for which he was created.",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، عَنْ عُمَارَةَ بْنِ غَزِيَّةَ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عَبْدِ الْمَلِكِ بْنِ سَعِيدٍ الأَنْصَارِيِّ، عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ أَجْمِلُوا فِي طَلَبِ الدُّنْيَا فَإِنَّ كُلاًّ مُيَسَّرٌ لِمَا خُلِقَ لَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Hendaklah bersederhana dalam mencari perkara duniawi, kerana setiap orang akan dimudahkan menurut apa yang diciptakan untuknya."
  },
  {
    "id": 31710,
    "hadith_number": 1877,
    "tajuk_hadith": "Keperihatinan Seorang Mukmin Terhadap Dunia dan Akhirat",
    "perawi_melayu": "Daripada Anas bin Malik, bahawa Rasulullah SAW bersabda:",
    "english_text": "The one who has the most concerns is the believer who is concerned about both his worldly affairs and his Hereafter.\"' (Da'if)Abu 'Abdullah said: \"This Hadith is Gharib' Isma'il, alone, has narrated it.\"",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ بَهْرَامَ، حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدِ بْنِ عُثْمَانَ، زَوْجُ بِنْتِ الشَّعْبِيِّ حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ يَزِيدَ الرَّقَاشِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ أَعْظَمُ النَّاسِ هَمًّا الْمُؤْمِنُ الَّذِي يَهُمُّ بِأَمْرِ دُنْيَاهُ وَأَمْرِ آخِرَتِهِ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ هَذَا حَدِيثٌ غَرِيبٌ تَفَرَّدَ بِهِ إِسْمَاعِيلُ ‏.‏",
    "malay_translation": "Orang yang paling banyak bimbang ialah orang mukmin yang bimbang tentang urusan dunianya dan akhiratnya. (Da'if) Abu Abdullah berkata: \"Hadis ini adalah Gharib, Isma'il telah meriwayatkannya secara tunggal.\" "
  },
  {
    "id": 31711,
    "hadith_number": 1878,
    "tajuk_hadith": "Menghindari Kezaliman dalam Pencarian Rezeki dan Menjaga Perkara yang Halal",
    "perawi_melayu": "Daripada Jabir bin Abdullah bahawa Rasulullah SAW bersabda:",
    "english_text": "\"O people, fear Allah and be moderate in seeking a living, for no soul will die until it has received all its provision, even if it is slow in coming. So fear Allah and be moderate in seeking provision; take that which is permissible and leave that which is forbidden. \"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ أَيُّهَا النَّاسُ اتَّقُوا اللَّهَ وَأَجْمِلُوا فِي الطَّلَبِ فَإِنَّ نَفْسًا لَنْ تَمُوتَ حَتَّى تَسْتَوْفِيَ رِزْقَهَا وَإِنْ أَبْطَأَ عَنْهَا فَاتَّقُوا اللَّهَ وَأَجْمِلُوا فِي الطَّلَبِ خُذُوا مَا حَلَّ وَدَعُوا مَا حَرُمَ ‏\"‏ ‏.‏",
    "malay_translation": "Wahai sekalian manusia, bertaqwalah kepada Allah SWT dan bersederhana dalam mencari rezeki. Sesungguhnya, tiada jiwa yang akan mati sehingga ia menerima seluruh rezekinya, walau lambat datangnya. Oleh itu, bertaqwalah kepada Allah SWT dan bersederhana dalam mencari rezeki; ambillah yang halal dan tinggalkan yang haram."
  },
  {
    "id": 31712,
    "hadith_number": 1879,
    "tajuk_hadith": "Petunjuk Rasulullah SAW Mengenai Perniagaan dan Amal Jariah",
    "perawi_melayu": "Dikisahkan oleh Qais bin Abu Gharazah bahawa:",
    "english_text": "\"At the time of the Messenger of Allah (ﷺ) we used to be called brokers, but the Messenger of Allah (ﷺ) passed by us and called by a name that was better than that. He said: 'O merchants, selling involves (false) oaths and idle talk, so mix some charity with it.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ قَيْسِ بْنِ أَبِي غَرَزَةَ، قَالَ كُنَّا نُسَمَّى فِي عَهْدِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ السَّمَاسِرَةَ فَمَرَّ بِنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَسَمَّانَا بِاسْمٍ هُوَ أَحْسَنُ مِنْهُ فَقَالَ ‏\n\"‏ يَا مَعْشَرَ التُّجَّارِ إِنَّ الْبَيْعَ يَحْضُرُهُ الْحَلِفُ وَاللَّغْوُ فَشُوبُوهُ بِالصَّدَقَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Pada zaman Rasulullah SAW, kami dikenali sebagai perantara. Namun, Rasulullah SAW lalu di hadapan kami dan memanggil kami dengan nama yang lebih baik. Baginda bersabda: \"Wahai para pedagang, perniagaan sering diiringi dengan sumpah palsu dan percakapan sia-sia, maka campurkanlah amalan sedekah bersama-sama perniagaan itu.\""
  },
  {
    "id": 31713,
    "hadith_number": 1880,
    "tajuk_hadith": "Penilaian Pedagang di Hari Kiamat",
    "perawi_melayu": "Dikisahkan oleh Ismail bin 'Ubaid bin Rifa'ah, daripada bapanya, daripada datuknya Rifa'ah,",
    "english_text": "\"We went out with the Messenger of Allah (ﷺ)  and the people were trading early in the morning. He called them: 'O merchants!' and when they looked up and craned their necks, he said : 'The merchants will be raised on the Day of Resurrection as immoral people, apart from those who fear Allah and act righteously and speak the truth (i.e. those who are honest).\"",
    "arabic_text": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ الطَّائِفِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ بْنِ خُثَيْمٍ، عَنْ إِسْمَاعِيلَ بْنِ عُبَيْدِ بْنِ رِفَاعَةَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، رِفَاعَةَ قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَإِذَا النَّاسُ يَتَبَايَعُونَ بُكْرَةً فَنَادَاهُمْ ‏\"‏ يَا مَعْشَرَ التُّجَّارِ ‏\"‏ ‏.‏ فَلَمَّا رَفَعُوا أَبْصَارَهُمْ وَمَدُّوا أَعْنَاقَهُمْ قَالَ ‏\"‏ إِنَّ التُّجَّارَ يُبْعَثُونَ يَوْمَ الْقِيَامَةِ فُجَّارًا إِلاَّ مَنِ اتَّقَى اللَّهَ وَبَرَّ وَصَدَقَ ‏\"‏ ‏.‏",
    "malay_translation": "Kami keluar bersama Rasulullah SAW dan mendapati orang ramai sedang berniaga di waktu pagi. Baginda menyeru, 'Wahai para pedagang!'.  Apabila mereka mengangkat pandangan dan memanjangkan leher, Baginda bersabda, 'Sesungguhnya para pedagang akan dibangkitkan pada Hari Kiamat dalam keadaan jahat, kecuali mereka yang bertakwa kepada Allah, berbuat baik dan jujur.'"
  },
  {
    "id": 31714,
    "hadith_number": 1881,
    "tajuk_hadith": "Kepentingan Keteguhan Dalam Usaha",
    "perawi_melayu": "Daripada Anas bin Malik bahawa Rasulullah SAW bersabda:",
    "english_text": "'Barangsiapa yang mencapai sesuatu, hendaklah ia tetap dengannya.'",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا فَرْوَةُ أَبُو يُونُسَ، عَنْ هِلاَلِ بْنِ جُبَيْرٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ أَصَابَ مِنْ شَىْءٍ فَلْيَلْزَمْهُ ‏\"‏ ‏.‏",
    "malay_translation": "'Barangsiapa yang mencapai sesuatu, hendaklah ia tetap dengannya.'"
  },
  {
    "id": 31715,
    "hadith_number": 1882,
    "tajuk_hadith": "Ketetapan Rezeki dan Tidak Meninggalkan Sumbernya",
    "perawi_melayu": "Dikisahkan oleh Nafi',",
    "english_text": "I used to send trade goods to Sham and Egypt, then I prepared to send trade goods to 'Iraq. I went to 'Aishah, the Mother of the Believers, and said to her: \" O Mother of the Believers I used to send trade goods to Sham and I am preparing to send trade goods to 'Iraq.\" She said: \"Do not do that. What is wrong with the way you have been doing it? I heard the Messenger of Allah (ﷺ) say: 'If Allah causes provision to come to one of you through a certain means, he should not leave it unless it changes or deteriorates.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا أَبُو عَاصِمٍ، أَخْبَرَنِي أَبِي، عَنِ الزُّبَيْرِ بْنِ عُبَيْدٍ، عَنْ نَافِعٍ، قَالَ كُنْتُ أُجَهِّزُ إِلَى الشَّامِ وَإِلَى مِصْرَ فَجَهَّزْتُ إِلَى الْعِرَاقِ فَأَتَيْتُ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ فَقُلْتُ لَهَا يَا أُمَّ الْمُؤْمِنِينَ كُنْتُ أُجَهِّزُ إِلَى الشَّامِ فَجَهَّزْتُ إِلَى الْعِرَاقِ ‏.‏ فَقَالَتْ لاَ تَفْعَلْ مَالَكَ وَلِمَتْجَرِكَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ إِذَا سَبَّبَ اللَّهُ لأَحَدِكُمْ رِزْقًا مِنْ وَجْهٍ فَلاَ يَدَعْهُ حَتَّى يَتَغَيَّرَ لَهُ أَوْ يَتَنَكَّرَ لَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Aku pernah menghantar barang dagangan ke Syam dan Mesir, kemudian aku bersedia menghantar barang dagangan ke Iraq. Aku pergi menemui 'Aisyah, Ummul Mukminin, dan berkata kepadanya, \"Wahai Ummul Mukminin, aku pernah menghantar barang dagangan ke Syam dan aku bersedia menghantar ke Iraq.\" Dia berkata, \"Jangan lakukan itu. Apakah yang salah dengan cara kamu melakukannya? Aku mendengar Rasulullah SAW bersabda, 'Jika Allah memberikan rezeki kepada seseorang melalui satu jalan, maka janganlah dia meninggalkannya melainkan jika ia berubah atau buruk.'"
  },
  {
    "id": 31716,
    "hadith_number": 1883,
    "tajuk_hadith": "Rasulullah SAW Seorang Penggembala sebelum Menjadi Utusan Allah",
    "perawi_melayu": "Daripada Abu Hurairah yang meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Allah has not sent any Prophet but he was a shepherd.\" His Companions said to him: \"Even you, O Messenger of Allah?\" He said: \"Even me I used to tend the sheep of the people of Makkah for a few Qirats.\" (Sahih)(One of the narrators) Suwaid said: \" Meaning one Qirat for every sheep.\"",
    "arabic_text": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَمْرُو بْنُ يَحْيَى بْنِ سَعِيدٍ الْقُرَشِيُّ، عَنْ جَدِّهِ، سَعِيدِ بْنِ أَبِي أُحَيْحَةَ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ مَا بَعَثَ اللَّهُ نَبِيًّا إِلاَّ رَاعِيَ غَنَمٍ ‏\"‏ ‏.‏ قَالَ لَهُ أَصْحَابُهُ وَأَنْتَ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ وَأَنَا كُنْتُ أَرْعَاهَا لأَهْلِ مَكَّةَ بِالْقَرَارِيطِ ‏\"‏ ‏.‏ قَالَ سُوَيْدٌ يَعْنِي كُلُّ شَاةٍ بِقِيرَاطٍ ‏.‏",
    "malay_translation": "Rasulullah SAW telah bersabda, \"Allah tidak mengutuskan mana-mana Nabi melainkan dia pernah menjadi seorang penggembala kambing.\" Para sahabatnya bertanya, \"Bahkan engkau, wahai Rasulullah?\" Baginda menjawab, \"Bahkan aku juga pernah menggembala kambing-kambing penduduk Mekah dengan upah beberapa Qirat.\"  (Sahih) Suwaid berkata, \"Maksudnya, setiap seekor kambing dengan satu Qirat."
  },
  {
    "id": 31717,
    "hadith_number": 1884,
    "tajuk_hadith": "Zakaria, Seorang Tukang Kayu",
    "perawi_melayu": "Dikisahkan daripada Abu Hurairah bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Zakariyya adalah seorang tukang kayu.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْخُزَاعِيُّ، وَالْحَجَّاجُ، وَالْهَيْثَمُ بْنُ جَمِيلٍ، قَالُوا حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ كَانَ زَكَرِيَّا نَجَّارًا ‏\"‏ ‏.‏",
    "malay_translation": "Dikatakan bahawa Nabi Zakaria a.s. adalah seorang tukang kayu."
  },
  {
    "id": 31718,
    "hadith_number": 1885,
    "tajuk_hadith": "Azab bagi Pembuat Patung pada Hari Kiamat",
    "perawi_melayu": "Dikisahkan oleh 'Aisyah bahawa Rasulullah SAW bersabda:",
    "english_text": "\"The image-makers will be punished on the Day of Resurrection and will be told: 'Give life to that which you have created.' \"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ نَافِعٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ إِنَّ أَصْحَابَ الصُّوَرِ يُعَذَّبُونَ يَوْمَ الْقِيَامَةِ يُقَالُ لَهُمْ أَحْيُوا مَا خَلَقْتُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Para pembuat patung akan dihukum pada Hari Kiamat, dan mereka akan diperintahkan, 'hidupkanlah ciptaanmu itu.'"
  },
  {
    "id": 31719,
    "hadith_number": 1886,
    "tajuk_hadith": "Kejujuran Orang Yang Berdagang dengan Warna dan Emas",
    "perawi_melayu": "Daripada Abu Hurairah, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"The most dishonest of people are the dyers and the goldsmiths.\"",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، حَدَّثَنَا عُمَرُ بْنُ هَارُونَ، عَنْ هَمَّامٍ، عَنْ فَرْقَدٍ السَّبَخِيِّ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ أَكْذَبُ النَّاسِ الصَّبَّاغُونَ وَالصَّوَّاغُونَ ‏\"‏ ‏.‏",
    "malay_translation": "Orang yang paling dusta di antara manusia adalah tukang celup dan tukang emas."
  },
  {
    "id": 31720,
    "hadith_number": 1887,
    "tajuk_hadith": "Keberkatan bagi Pemasok dan Laknat bagi Penimbun",
    "perawi_melayu": "Dikisahkan oleh Umar bin al-Khattab bahawa Rasulullah SAW bersabda:",
    "english_text": "\"The importer is blessed with provision and the hoarder is cursed.\"",
    "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا أَبُو أَحْمَدَ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ عَلِيِّ بْنِ سَالِمِ بْنِ ثَوْبَانَ، عَنْ عَلِيِّ بْنِ زَيْدِ بْنِ جُدْعَانَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ الْجَالِبُ مَرْزُوقٌ وَالْمُحْتَكِرُ مَلْعُونٌ ‏\"‏ ‏.‏",
    "malay_translation": "“Orang yang membawa barang dagangan (import) akan diberkati rezekinya dan orang yang menimbun barang adalah terkutuk.”"
  },
  {
    "id": 31721,
    "hadith_number": 1888,
    "tajuk_hadith": "Larangan Menghimpun Barang untuk Menguntungkan Diri Sendiri",
    "perawi_melayu": "Daripada Ma'mar bin Abdullah bin Nadlah, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"No one hoards but a sinner.\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ مَعْمَرِ بْنِ عَبْدِ اللَّهِ بْنِ نَضْلَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ يَحْتَكِرُ إِلاَّ خَاطِئٌ ‏\"‏ ‏.‏",
    "malay_translation": "Tidak ada yang menimbun kecuali orang yang berdosa."
  },
  {
    "id": 31722,
    "hadith_number": 1889,
    "tajuk_hadith": "Larangan Menghimpun Makanan Secara Haram",
    "perawi_melayu": "Telah diriwayatkan daripada 'Umar bin al-Khattab bahawa:",
    "english_text": "\"I heard the Messenger of Allah (ﷺ) say: 'Whoever hoards food (and keeps it from) the Muslims, Allah will afflict him with leprosy and bankruptcy.\"'",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ، حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ، حَدَّثَنَا الْهَيْثَمُ بْنُ رَافِعٍ، حَدَّثَنِي أَبُو يَحْيَى الْمَكِّيُّ، عَنْ فَرُّوخَ، مَوْلَى عُثْمَانَ بْنِ عَفَّانَ عَنْ عُمَرَ بْنِ الْخَطَّابِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ مَنِ احْتَكَرَ عَلَى الْمُسْلِمِينَ طَعَامَهُمْ ضَرَبَهُ اللَّهُ بِالْجُذَامِ وَالإِفْلاَسِ ‏\"‏ ‏.‏",
    "malay_translation": "Telah diberitakan kepada kami oleh Nabi SAW:  “Barangsiapa yang menghimpun makanan dan menyimpannya daripada sampai kepada umat Islam, maka Allah akan menimpanya dengan penyakit kusta dan kebankrapan.”"
  },
  {
    "id": 31723,
    "hadith_number": 1890,
    "tajuk_hadith": "Hikmah Menghadapi Permintaan Perawatan dan Pembagian Imbalan",
    "perawi_melayu": "Dikisahkan oleh Abu Sa'id Al-Khudri RA bahawa:",
    "english_text": "\"The Messenger of Allah (ﷺ) sent us, thirty horsemen, on a military campaign. We camped near some people and asked them for hospitality but they refused. Then their leader was stung by a scorpion and they said: 'Is there anyone among you who can recite Ruqyah for a scorpion sting?' I said: 'Yes, I can, but I will not recite Ruqyah for him until you give us some sheep.' They said: 'We will give you thirty sheep.' So we accepted them, and I recited Al-Hamd (i.e. Al-Fatihah) over him seven times. Then he recovered, and I took the sheep. Then some doubts occurred within ourselves. Then we said: 'Let us not hasten (to make a decision concerning the sheep) until we come to the Prophet (ﷺ)' So when we came back: 'I told him what I had done. He said: 'How did you know that it is a Ruqyah? Divide them up and give me a share as well.'\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الأَعْمَشُ، عَنْ جَعْفَرِ بْنِ إِيَاسٍ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ بَعَثَنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ثَلاَثِينَ رَاكِبًا فِي سَرِيَّةٍ فَنَزَلْنَا بِقَوْمٍ فَسَأَلْنَاهُمْ أَنْ يَقْرُونَا فَأَبَوْا فَلُدِغَ سَيِّدُهُمْ فَأَتَوْنَا فَقَالُوا أَفِيكُمْ أَحَدٌ يَرْقِي مِنَ الْعَقْرَبِ فَقُلْتُ نَعَمْ أَنَا وَلَكِنْ لاَ أَرْقِيهِ حَتَّى تُعْطُونَا غَنَمًا ‏.‏ قَالُوا فَإِنَّا نُعْطِيكُمْ ثَلاَثِينَ شَاةً ‏.‏ فَقَبِلْنَاهَا فَقَرَأْتُ عَلَيْهِ ‏(‏ الْحَمْدُ ‏)‏ سَبْعَ مَرَّاتٍ فَبَرِئَ وَقَبَضْنَا الْغَنَمَ فَعَرَضَ فِي أَنْفُسِنَا مِنْهَا شَىْءٌ فَقُلْنَا لاَ تَعْجَلُوا حَتَّى نَأْتِيَ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَلَمَّا قَدِمْنَا ذَكَرْتُ لَهُ الَّذِي صَنَعْتُ فَقَالَ ‏\n\"‏ أَوَ مَا عَلِمْتَ أَنَّهَا رُقْيَةٌ اقْتَسِمُوهَا وَاضْرِبُوا لِي مَعَكُمْ سَهْمًا ‏\"‏ ‏.‏ \n حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا هُشَيْمٌ، حَدَّثَنَا أَبُو بِشْرٍ، عَنْ أَبِي الْمُتَوَكِّلِ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ بِنَحْوِهِ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، عَنْ أَبِي الْمُتَوَكِّلِ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ بِنَحْوِهِ ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ وَالصَّوَابُ هُوَ أَبُو الْمُتَوَكِّلِ إِنْ شَاءَ اللَّهُ ‏.‏",
    "malay_translation": "Daripada Abu Sa'id al-Khudri RA, beliau meriwayatkan bahawa Rasulullah SAW telah menghantar 30 orang pasukan berkuda dalam satu ekspedisi. Mereka menemui suatu kaum dan meminta tetamu dijamu, tetapi permintaan mereka ditolak. Kemudian, pemimpin kaum itu terkena sengatan kalajengking dan mereka bertanya, 'Adakah di antara kamu yang mahir dalam amalan Ruqyah untuk sengatan kalajengking?' Aku menjawab, 'Ya, aku mahir, tetapi aku tidak akan melakukan Ruqyah untuknya sehingga kamu memberikan kami beberapa ekor kambing.' Mereka menjawab, 'Kami akan berikan kamu 30 ekor kambing.' Kami menerimanya, dan aku membacakan Al-Fatihah sebanyak tujuh kali ke atasnya. Kemudian, dia sembuh. Aku mengambil kambing-kambing itu. Kemudian, timbul keraguan dalam hati kami. Kami bersepakat untuk tidak tergesa-gesa membuat keputusan mengenai kambing itu sehingga kami bertemu dengan Rasulullah SAW. Sebaik sampai kepada baginda, aku menceritakan kejadian yang berlaku. Baginda bersabda, 'Apakah kamu tidak tahu bahawa ini adalah amalan Ruqyah? Bagilah kambing itu dan berikan sebahagiannya kepada aku.' "
  },
  {
    "id": 31724,
    "hadith_number": 1891,
    "tajuk_hadith": "Ganjaran Melatih dan Memberi Keutamaan kepada Jalan Allah",
    "perawi_melayu": "'Ubadah bin Samit meriwayatkan:",
    "english_text": "\"I taught people from Ahtus-Suffah\" Qur'an and how to write, and one of them gave me a bow. I said: 'It is not money, and I can shoot (with it) for the sake of Allah., I asked the Messenger of Allah (ﷺ) about it and he said: 'If it would please you to have a necklace of fire placed around your neck, then accept it.'\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَمُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا مُغِيرَةُ بْنُ زِيَادٍ الْمَوْصِلِيُّ، عَنْ عُبَادَةَ بْنِ نُسَىٍّ، عَنِ الأَسْوَدِ بْنِ ثَعْلَبَةَ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ عَلَّمْتُ نَاسًا مِنْ أَهْلِ الصُّفَّةِ الْقُرْآنَ وَالْكِتَابَةَ فَأَهْدَى إِلَىَّ رَجُلٌ مِنْهُمْ قَوْسًا فَقُلْتُ لَيْسَتْ بِمَالٍ وَأَرْمِي عَنْهَا فِي سَبِيلِ اللَّهِ فَسَأَلْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْهَا فَقَالَ ‏\n\"‏ إِنْ سَرَّكَ أَنْ تُطَوَّقَ بِهَا طَوْقًا مِنْ نَارٍ فَاقْبَلْهَا ‏\"‏ ‏.‏",
    "malay_translation": "Aku telah mengajar orang-orang dari kalangan Ahlus-Suffah tentang Al-Quran dan cara menulis. Salah seorang daripada mereka menghadiahkan aku sebutir anak panah. Aku berkata, 'Ini bukan wang, dan aku boleh menggunakannya untuk berjuang di jalan Allah.' Aku bertanya kepada Rasulullah SAW tentangnya, lalu baginda bersabda, 'Jika engkau berminat untuk memakai kalung api di lehermu, maka terimalah.'."
  },
  {
    "id": 31725,
    "hadith_number": 1892,
    "tajuk_hadith": "Larangan Menerima Hadiah Busur Sebagai Balasan Pengajaran Al-Quran",
    "perawi_melayu": "Diceritakan oleh Ubayy bin Ka'b bahawa:",
    "english_text": "\"I taught a man the Qur'an, and he gave me a bow. I mentioned that to the Messenger of Allah (ﷺ) and he said: 'If you accept it you will be accepting a bow of fire.' So I returned it.\"",
    "arabic_text": "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ ثَوْرِ بْنِ يَزِيدَ، حَدَّثَنَا خَالِدُ بْنُ مَعْدَانَ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ سَلْمٍ، عَنْ عَطِيَّةَ الْكَلاَعِيِّ، عَنْ أُبَىِّ بْنِ كَعْبٍ، قَالَ عَلَّمْتُ رَجُلاً الْقُرْآنَ فَأَهْدَى إِلَىَّ قَوْسًا فَذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\n\"‏ إِنْ أَخَذْتَهَا أَخَذْتَ قَوْسًا مِنْ نَارٍ ‏\"‏ ‏.‏ فَرَدَدْتُهَا ‏.‏",
    "malay_translation": "Aku telah mengajarkan Al-Quran kepada seorang lelaki, dan dia menghadiahkan aku sebuah busur. Aku menceritakan hal ini kepada Rasulullah ﷺ, dan Baginda bersabda: ‘Sekiranya engkau menerimanya, engkau telah menerima satu busur api.’ Maka aku mengembalikannya."
  },
  {
    "id": 31726,
    "hadith_number": 1893,
    "tajuk_hadith": "Larangan Bayaran Terhadap Anjing, Pelacur, dan Peramal",
    "perawi_melayu": "Dikisahkan oleh Abu Mas'ud bahawa:",
    "english_text": "the Prophet (ﷺ) forbade the price of a dog, the payment (given to a prostitute) and the payment made to a soothsayer.",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، وَمُحَمَّدُ بْنُ الصَّبَّاحِ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي مَسْعُودٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ نَهَى عَنْ ثَمَنِ الْكَلْبِ وَمَهْرِ الْبَغِيِّ وَحُلْوَانِ الْكَاهِنِ ‏.‏",
    "malay_translation": "Rasulullah SAW melarang bayaran untuk anjing, bayaran kepada wanita pelacur, dan bayaran kepada tukang ramal."
  },
  {
    "id": 31727,
    "hadith_number": 1894,
    "tajuk_hadith": "Larangan Mengenai Harga Anjing dan Menjinakkan Kuda Jantan",
    "perawi_melayu": "Dikatakan oleh Abu Hurairah bahawa:",
    "english_text": "\"The Messenger of Allah (ﷺ) forbade the price of a dog and studding a stallion.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَمُحَمَّدُ بْنُ طَرِيفٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ ثَمَنِ الْكَلْبِ وَعَسْبِ الْفَحْلِ‏.‏",
    "malay_translation": "Rasulullah SAW melarang menjual harga anjing dan menjinakkan kuda jantan."
  },
  {
    "id": 31728,
    "hadith_number": 1895,
    "tajuk_hadith": "Larangan Rasulullah SAW Mengenai Harga Seekor Kucing",
    "perawi_melayu": "Dikisahkan oleh Abu Az-Zubair daripada Jabir, bahawa:",
    "english_text": "\"The Messenger of Allah (ﷺ) forbade the price of a cat.\"",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا الْوَلِيدُ، أَنْبَأَنَا ابْنُ لَهِيعَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ ثَمَنِ السِّنَّوْرِ ‏.‏",
    "malay_translation": "Rasulullah SAW melarang menjual kucing dengan harga tertentu."
  },
  {
    "id": 31729,
    "hadith_number": 1896,
    "tajuk_hadith": "Rasulullah SAW Dihijam dan Membayar Upah Perawat",
    "perawi_melayu": "Dikisahkan oleh Ibnu Abbas bahawa:",
    "english_text": "the Prophet (ﷺ) was treated with cupping and he gave him (the cupper) his wages. (Sahih)Ibn Abu 'Umar was alone in narrating it. That was said by Ibn Majah.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْعَدَنِيُّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ احْتَجَمَ وَأَعْطَاهُ أَجْرَهُ ‏.‏ قَالَ ابْنُ مَاجَهْ تَفَرَّدَ بِهِ ابْنُ أَبِي عُمَرَ وَحْدَهُ ‏.‏",
    "malay_translation": "Rasulullah SAW pernah dihijam (ditempatkan bekam). Baginda memberikan upah kepada orang yang melakukan bekam tersebut. (Sahih) Ibnu Abu 'Umar telah meriwayatkan hadis ini secara sendirian. Ini berdasarkan keterangan Ibnu Majah."
  },
  {
    "id": 31730,
    "hadith_number": 1897,
    "tajuk_hadith": "Rasulullah SAW Dirawat dengan Cupping dan Membayar Upah Pengubat",
    "perawi_melayu": "'Ali r.a. meriwayatkan:",
    "english_text": "\"The Messenger of Allah (ﷺ) was treated with cupping and he told me to give the cupper his wages.\"",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ أَبُو حَفْصٍ الصَّيْرَفِيُّ، حَدَّثَنَا أَبُو دَاوُدَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبَادَةَ الْوَاسِطِيُّ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، قَالاَ حَدَّثَنَا وَرْقَاءُ، عَنْ عَبْدِ الأَعْلَى، عَنْ أَبِي جَمِيلَةَ عَنْ عَلِيٍّ، قَالَ احْتَجَمَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَأَمَرَنِي فَأَعْطَيْتُ الْحَجَّامَ أَجْرَهُ ‏.‏",
    "malay_translation": "\"Rasulullah SAW dirawat dengan cupping dan baginda memerintahkan saya untuk memberi upah kepada pengubat itu.\""
  },
  {
    "id": 31731,
    "hadith_number": 1898,
    "tajuk_hadith": "Rasulullah SAW Dihijam dan Memberi Upah kepada Penghijam",
    "perawi_melayu": "Dikisahkan oleh Anas bin Malik bahawa:",
    "english_text": "the Prophet (ﷺ) was treated with cupping and gave the cupper his wages.",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ بَيَانٍ الْوَاسِطِيُّ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ يُونُسَ، عَنِ ابْنِ سِيرِينَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ احْتَجَمَ وَأَعْطَى الْحَجَّامَ أَجْرَهُ ‏.‏",
    "malay_translation": "Rasulullah SAW telah dihijam dan memberi upah kepada penghijam. Telah menceritakan Anas bin Malik bahawa Nabi SAW dihijam (dilakukan bekam) dan memberikan upah kepada penghijam tersebut."
  },
  {
    "id": 31732,
    "hadith_number": 1899,
    "tajuk_hadith": "Larangan Rasulullah SAW Terhadap Pendapatan Ahli Ketam",
    "perawi_melayu": "Dikatakan oleh Abu Mas'ud, 'Uqbah bin 'Amr, bahawa:",
    "english_text": "\"The Messenger of Allah (ﷺ), forbade the earnings of a cupper.\"",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، حَدَّثَنِي الأَوْزَاعِيُّ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ أَبِي مَسْعُودٍ، عُقْبَةَ بْنِ عَمْرٍو قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ كَسْبِ الْحَجَّامِ ‏.‏",
    "malay_translation": "Rasulullah SAW melarang pendapatan ahli ketam (orang yang mengorek atau mencabut parut/kecacatan)."
  },
  {
    "id": 31733,
    "hadith_number": 1900,
    "tajuk_hadith": "Larangan dan Nasihat Mengenai Pendapatan Tukang Cuci dan Kegunaan Wangnya",
    "perawi_melayu": "Dikisahkan daripada Haram bin Munayyisah bahawa:",
    "english_text": "his father asked the Prophet (ﷺ) about the earnings of a cupper and he forbade him from that. Then he mentioned his need and he said: \"Spend it on feeding your she-camels that draw water.\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنْ حَرَامِ بْنِ مُحَيِّصَةَ، عَنْ أَبِيهِ، أَنَّهُ سَأَلَ النَّبِيَّ ـ صلى الله عليه وسلم ـ عَنْ كَسْبِ الْحَجَّامِ فَنَهَاهُ عَنْهُ فَذَكَرَ لَهُ الْحَاجَةَ فَقَالَ ‏\n\"‏ اعْلِفْهُ نَوَاضِحَكَ ‏\"‏ ‏.‏",
    "malay_translation": "Ayahnya bertanya kepada Nabi SAW tentang pendapatan tukang cuci, dan baginda melarangnya daripada pekerjaan itu. Kemudian ayah tersebut menyebut keperluannya, lalu baginda bersabda:\"Suapkanlah unta betina pengangkut airmu.\""
  },
  {
    "id": 31734,
    "hadith_number": 1901,
    "tajuk_hadith": "Larangan Jual Beli Minuman Keras, Binatang Mati, Babi dan Patung pada Tahun Pembebasan Mekah",
    "perawi_melayu": "Ata' bin Abu Rabah berkata:",
    "english_text": "I heard Jabir bin 'Abdullah say: \"In the Year of the Conquest, while he was in Makkah the Messenger of Allah (ﷺ), said: 'Allah and His Messenger have forbidden the sale of wines, meat of dead animals, pigs and 'idols.' It was said to him: 'O Messenger of Allah, what do you think of the fat of dead animals, for it is used to caulk ships, it is daubed on animal skins and people use it to light their lamps?' He said: 'No, it is unlawful.' Then the Messenger of Allah (ﷺ) said: 'May Allah curse the jews, for Allah forbade them the fat (of animals) but they rendered it, (i.e. melted it) sold it and consumed its price.\"",
    "arabic_text": "حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ الْمِصْرِيُّ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، أَنَّهُ قَالَ قَالَ عَطَاءُ بْنُ أَبِي رَبَاحٍ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَامَ الْفَتْحِ وَهُوَ بِمَكَّةَ ‏\"‏ إِنَّ اللَّهَ وَرَسُولَهُ حَرَّمَ بَيْعَ الْخَمْرِ وَالْمَيْتَةِ وَالْخِنْزِيرِ وَالأَصْنَامِ ‏\"‏ ‏.‏ فَقِيلَ لَهُ عِنْدَ ذَلِكَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ شُحُومَ الْمَيْتَةِ فَإِنَّهُ يُدْهَنُ بِهَا السُّفُنُ وَيُدْهَنُ بِهَا الْجُلُودُ وَيَسْتَصْبِحُ بِهَا النَّاسُ قَالَ ‏\"‏ لاَ هُنَّ حَرَامٌ ‏\"‏ ‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ قَاتَلَ اللَّهُ الْيَهُودَ إِنَّ اللَّهَ حَرَّمَ عَلَيْهِمُ الشُّحُومَ فَأَجْمَلُوهُ ثُمَّ بَاعُوهُ فَأَكَلُوا ثَمَنَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Jabir bin Abdullah berkata: \"Pada Tahun Pembebasan, ketika Baginda Rasulullah SAW berada di Makkah, Baginda bersabda: 'Sesungguhnya Allah dan Rasul-Nya telah mengharamkan jual beli minuman keras, bangkai, babi, dan patung.' Kemudian ditanyakan kepada Baginda: 'Wahai Rasulullah, bagaimana pula dengan lemak bangkai, kerana ia digunakan untuk melapis kapal, menyamak kulit, dan menerangi lampu?' Baginda menjawab: 'Tidak, ia haram.' Kemudian Rasulullah SAW bersabda: 'Semoga Allah melaknat orang Yahudi, kerana Allah telah mengharamkan lemak (binatang) kepada mereka, tetapi mereka mencairkannya, menjualnya, dan memakan hasil jualannya.'"
  },
  {
    "id": 31735,
    "hadith_number": 1902,
    "tajuk_hadith": "Larangan Membeli-Menjual dan Memanfaatkan Perkhidmatan Penari Wanita",
    "perawi_melayu": "Dikatakan oleh Abu Umamah bahawa:",
    "english_text": "\"The Messenger of Allah, forbade selling or buying singing girls, and their wages, and consuming their price.\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ يَحْيَى بْنِ سَعِيدٍ الْقَطَّانُ، حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا أَبُو جَعْفَرٍ الرَّازِيُّ، عَنْ عَاصِمٍ، عَنْ أَبِي الْمُهَلَّبِ، عَنْ عُبَيْدِ اللَّهِ الإِفْرِيقِيِّ، عَنْ أَبِي أُمَامَةَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ بَيْعِ الْمُغَنِّيَاتِ وَعَنْ شِرَائِهِنَّ وَعَنْ كَسْبِهِنَّ وَعَنْ أَكْلِ أَثْمَانِهِنَّ ‏.‏",
    "malay_translation": "Rasulullah SAW melarang menjual atau membeli wanita penyanyi, dan upah mereka, dan memakan upah mereka."
  },
  {
    "id": 31736,
    "hadith_number": 1903,
    "tajuk_hadith": "Larangan Dua Jenis Perniagaan oleh Rasulullah SAW",
    "perawi_melayu": "Dikisahkan oleh Abu Hurairah bahawa:",
    "english_text": "\"The Messenger of Allah (ﷺ) forbade two kinds of transactions: Mulimasah and Mundbadhah.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ بَيْعَتَيْنِ عَنِ الْمُلاَمَسَةِ وَالْمُنَابَذَةِ ‏.‏",
    "malay_translation": "“Nabi SAW melarang dua jenis urus niaga: Mulimasah dan Mundbadhah.”"
  },
  {
    "id": 31737,
    "hadith_number": 1904,
    "tajuk_hadith": "Larangan Mulamasah dan Munabadhah menurut Rasulullah SAW",
    "perawi_melayu": "Daripada Abu Sa'id Al-Khudri.",
    "english_text": "the Messenger of Allah (ﷺ) forbade Mulamasah and Munabadhah. (Sahih) Sahl added: \"Sufyan said: 'Mulamasah means when a man touches something with his hand without seeing it, and Munabadhah means when he says: \"Toss me what you have, and I will toss you what have.\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَسَهْلُ بْنُ أَبِي سَهْلٍ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ نَهَى عَنِ الْمُلاَمَسَةِ وَالْمُنَابَذَةِ ‏.‏ زَادَ سَهْلٌ قَالَ سُفْيَانُ الْمُلاَمَسَةُ أَنْ يَلْمِسَ الرَّجُلُ الشَّىْءَ بِيَدِهِ وَلاَ يَرَاهُ وَالْمُنَابَذَةُ أَنْ يَقُولَ أَلْقِ إِلَىَّ مَا مَعَكَ وَأُلْقِي إِلَيْكَ مَا مَعِي ‏.‏",
    "malay_translation": "Rasulullah SAW melarang Mulamasah dan Munabadhah. (Sahih) Sahl menambah, \"Sufyan berkata, 'Mulamasah bermaksud apabila seseorang menyentuh sesuatu dengan tangannya tanpa melihatnya, dan Munabadhah bermaksud apabila dia berkata, 'Lemparkan padaku apa yang ada padamu, dan aku akan lemparkan padamu apa yang ada padaku.'\""
  },
  {
    "id": 31738,
    "hadith_number": 1905,
    "tajuk_hadith": "Larangan Menjual Dengan Harga Yang Rendah",
    "perawi_melayu": "Daripada Ibnu Umar, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Janganlah sesiapa di antara kamu menjual barang dagangan kepada orang lain dengan harga yang lebih rendah daripada yang sepatutnya.\"",
    "arabic_text": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لاَ يَبِيعُ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah sesiapa di antara kamu menjual barang dagangan kepada orang lain dengan harga yang lebih rendah daripada yang sepatutnya."
  },
  {
    "id": 31739,
    "hadith_number": 1906,
    "tajuk_hadith": "Larangan Menjual Barang dengan Harga Rendah dan Menawar dengan Harga Tinggi Terhadap Saudara Muslim",
    "perawi_melayu": "Daripada Abu Hurairah, bahawa Nabi SAW bersabda:",
    "english_text": "\"A man is not to undersell his brother, nor is he to fry to outhaggle his brother.\"",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لاَ يَبِيعُ الرَّجُلُ عَلَى بَيْعِ أَخِيهِ وَلاَ يَسُومُ عَلَى سَوْمِ أَخِيهِ ‏\"‏ ‏.‏",
    "malay_translation": "Tidak sepatutnya seseorang menjual barang kepada saudaranya dengan harga yang lebih rendah daripada harga yang biasa, dan tidak juga menawar dengan harga yang lebih tinggi daripada harga yang biasa ketika berjual beli dengan saudaranya.  (Daripada Abu Hurairah, bahawa Nabi SAW bersabda:)"
  },
  {
    "id": 31740,
    "hadith_number": 1907,
    "tajuk_hadith": "Larangan Nabi SAW Mengenai Najsy",
    "perawi_melayu": "Daripada Ibn 'Umar bahawa:",
    "english_text": "the Prophet (ﷺ) forbade the Najsh.",
    "arabic_text": "قَرَأْتُ عَلَى مُصْعَبِ بْنِ عَبْدِ اللَّهِ الزُّبَيْرِيِّ عَنْ مَالِكٍ، ح وَحَدَّثَنَا أَبُو حُذَافَةَ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ نَهَى عَنِ النَّجْشِ ‏.‏",
    "malay_translation": "Daripada Ibn 'Umar RA, bahawa Nabi SAW telah melarang amalan najsy."
  },
  {
    "id": 31741,
    "hadith_number": 1908,
    "tajuk_hadith": "Larangan Menjual Beli dengan Najsy",
    "perawi_melayu": "Daripada Abu Hurairah bahawa Nabi saw bersabda:",
    "english_text": "\"Do not practice Najsh.\"",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، وَسَهْلُ بْنُ أَبِي سَهْلٍ، قَالاَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لاَ تَنَاجَشُوا ‏\"‏ ‏.‏",
    "malay_translation": "Jangan melakukan amalan najsy."
  },
  {
    "id": 31742,
    "hadith_number": 1909,
    "tajuk_hadith": "Larangan Penjualaan Orang Bandar kepada Orang Badwi",
    "perawi_melayu": "Diceritakan daripada Abu Hurairah bahawa Rasulullah SAW bersabda:",
    "english_text": "\"A City-dweller should not sell for a Bedouin.\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لاَ يَبِيعُ حَاضِرٌ لِبَادٍ ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah penduduk bandar (orang kota) menjual kepada orang badwi."
  },
  {
    "id": 31743,
    "hadith_number": 1910,
    "tajuk_hadith": "Larangan Penjual Jual Beli Orang Bandar Kepada Pedalaman dan Kebebasan Perniagaan",
    "perawi_melayu": "Diriwayatkan daripada Jabir bin 'Abdullah bahawa Nabi (ﷺ) bersabda:",
    "english_text": "\"A city-dweller should not sell for a Bedouin. Leave people to (engage in trade) and Allah will grant them provision through one another.\"",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لاَ يَبِيعُ حَاضِرٌ لِبَادٍ دَعُوا النَّاسَ يَرْزُقُ اللَّهُ بَعْضَهُمْ مِنْ بَعْضٍ ‏\"‏ ‏.‏",
    "malay_translation": "“Janganlah orang bandar menjual kepada orang pedalaman. Biarlah manusia berurus niaga, dan Allah akan memberikan rezeki antara mereka.”"
  },
  {
    "id": 31744,
    "hadith_number": 1911,
    "tajuk_hadith": "Larangan Penjual Bandar untuk Orang Badwi",
    "perawi_melayu": "Ibn Tawus meriwayatkan daripada bapanya, yang mana Ibn 'Abbas berkata:",
    "english_text": "\"The Messenger of Allah (ﷺ) forbade a city-dweller to sell for a Bedouin.\" (Sahih)I (Tawus) said to Ibn 'Abbas: \"What is meant by the words: 'A city-dweller selling for a Bedouin?' He said: \"He should not be a broker for him.\"",
    "arabic_text": "حَدَّثَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَنْبَأَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ يَبِيعَ حَاضِرٌ لِبَادٍ ‏.‏ قُلْتُ لاِبْنِ عَبَّاسٍ مَا قَوْلُهُ حَاضِرٌ لِبَادٍ قَالَ لاَ يَكُونُ لَهُ سِمْسَارًا ‏.‏",
    "malay_translation": "Rasulullah SAW melarang seorang penduduk bandar (haḍir) daripada menjual kepada penduduk badwi (bāḍ). (Sahih) Aku (Tawus) bertanya kepada Ibn 'Abbas, \"Apakah maksudnya orang bandar menjual untuk orang badwi?\" Dia menjawab, \"Janganlah menjadi ejen baginya.\""
  },
  {
    "id": 31745,
    "hadith_number": 1912,
    "tajuk_hadith": "Larangan Bertemu Pedagang di Jalan dan Pilihan Penjual di Pasar",
    "perawi_melayu": "Daripada Abu Hurairah, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Do not meet the traders on the way, and whoever meets any of them and buys from him, the vendor has the choice of annulling the transaction when he comes to the marketplace.''",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ هِشَامِ بْنِ حَسَّانَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لاَ تَلَقَّوُا الأَجْلاَبَ فَمَنْ تَلَقَّى مِنْهُ شَيْئًا فَاشْتَرَى فَصَاحِبُهُ بِالْخِيَارِ إِذَا أَتَى السُّوقَ ‏\"‏ ‏.‏",
    "malay_translation": "Janganlah kamu bertemu dengan para pedagang di jalan. Barangsiapa yang bertemu dengannya dan membeli sesuatu darinya, maka penjual itu mempunyai pilihan untuk membatalkan transaksi tersebut apabila sampai di pasar."
  },
  {
    "id": 31746,
    "hadith_number": 1913,
    "tajuk_hadith": "Larangan Rasulullah SAW Bertemu Pedagang di Jalan",
    "perawi_melayu": "Telah diriwayatkan oleh Ibn 'Umar bahawa:",
    "english_text": "\"The Messenger of Allah (ﷺ) forbade meeting traders on the way.\"",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ تَلَقِّي الْجَلَبِ ‏.‏",
    "malay_translation": "Rasulullah SAW melarang bertemu dengan para pedagang di jalan."
  },
  {
    "id": 31747,
    "hadith_number": 1914,
    "tajuk_hadith": "Larangan Rasulullah SAW Bertemu Pemilik Barang (Di Luar Pasar)",
    "perawi_melayu": "Dikatakan oleh Abdullah bin Mas'ud, bahawa:",
    "english_text": "\"The Messenger of Allah (ﷺ) forbade. meeting the owners of goods (away from the market).\"",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، وَحَمَّادُ بْنُ مَسْعَدَةَ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ بْنِ حَبِيبِ بْنِ الشَّهِيدِ، حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ سَمِعْتُ أَبِي قَالَ، حَدَّثَنَا أَبُو عُثْمَانَ النَّهْدِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ تَلَقِّي الْبُيُوعِ ‏.‏",
    "malay_translation": "Rasulullah SAW melarang bertemu dengan pemilik barang (di luar pasar). "
  },
  {
    "id": 31748,
    "hadith_number": 1915,
    "tajuk_hadith": "Hukum Perjanjian Dagangan Hingga Kesudahannya",
    "perawi_melayu": "Daripada Abdullah bin Umar, dari Rasulullah SAW",
    "english_text": "\"When two men enter into a transaction, each of them has the choice (of annulling it) so long as they have not yet parted and are still together, or one of them has given the option or choice to the other. Once he has accepted the terms of the other, then the transaction is binding. If they part after concluding the transaction and neither of them has rescinded the transaction then the transaction is binding.”",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ إِذَا تَبَايَعَ الرَّجُلاَنِ فَكُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا وَكَانَا جَمِيعًا أَوْ يُخَيِّرْ أَحَدُهُمَا الآخَرَ فَإِنْ خَيَّرَ أَحَدُهُمَا الآخَرَ فَتَبَايَعَا عَلَى ذَلِكَ فَقَدْ وَجَبَ الْبَيْعُ ‏.‏ وَإِنْ تَفَرَّقَا بَعْدَ أَنْ تَبَايَعَا وَلَمْ يَتْرُكْ وَاحِدٌ مِنْهُمَا الْبَيْعَ فَقَدْ وَجَبَ الْبَيْعُ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila dua orang lelaki melakukan perjanjian jual beli, masing-masing dari mereka mempunyai pilihan (untuk membatalkannya) selagi mereka belum berpisah dan masih bersama-sama, atau salah seorang dari mereka memberi pilihan kepada yang lain. Setelah salah seorang menerima syarat yang diutarakan pihak lain, maka perjanjian itu mengikat. Jika mereka berpisah setelah menyelesaikan perjanjian dan tiada seorangpun dari mereka yang membatalkan perjanjian tersebut, maka perjanjian itu mengikat."
  },
  {
    "id": 31749,
    "hadith_number": 1916,
    "tajuk_hadith": "Perjanjian Perniagaan Masih Boleh Dibatalkan Sehingga Kedua Belah Pihak Belum Berpisah",
    "perawi_melayu": "Dikisahkan oleh Abu Barzah al-Aslami bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Kedua-dua pihak dalam urus niaga mempunyai pilihan (untuk membatalkannya) selagi mereka belum berpisah.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ، وَأَحْمَدُ بْنُ الْمِقْدَامِ، قَالاَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ جَمِيلِ بْنِ مُرَّةَ، عَنْ أَبِي الْوَضِيءِ، عَنْ أَبِي بَرْزَةَ الأَسْلَمِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا ‏\"‏ ‏.‏",
    "malay_translation": "Kedua-dua pihak dalam urus niaga mempunyai pilihan (untuk membatalkannya) selagi mereka belum berpisah."
  },
  {
    "id": 31750,
    "hadith_number": 1917,
    "tajuk_hadith": "Kebebasan Membatalkan Perjanjian Jual Beli",
    "perawi_melayu": "Telah diriwayatkan dari Samurah bahawa Rasulullah SAW bersabda:",
    "english_text": "\"The two parties to a transaction have the choice (of annulling it) so long as they have not yet parted. \"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، وَإِسْحَاقُ بْنُ مَنْصُورٍ، قَالاَ حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا ‏\"‏ ‏.‏",
    "malay_translation": "Kedua-dua pihak dalam sebuah transaksi mempunyai pilihan (untuk membatalkannya) selagi mereka belum berpisah."
  },
  {
    "id": 31751,
    "hadith_number": 1918,
    "tajuk_hadith": "Pertimbangan dan Doa Baginda Rasulullah SAW dalam Satu Perjanjian Perniagaan",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan:",
    "english_text": "\"The Messenger of Allah (ﷺ) bought a load of fodder from a Bedouin man. When the transaction was concluded, the Messenger of Allah (ﷺ) said: 'Choose (either to go ahead or to cancel the transaction).' The Bedouin said: 'May Allah grant you a long life of good transaction!\"",
    "arabic_text": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، وَأَحْمَدُ بْنُ عِيسَى الْمِصْرِيَّانِ، قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي ابْنُ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ اشْتَرَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ مِنْ رَجُلٍ مِنَ الأَعْرَابِ حِمْلَ خَبَطٍ فَلَمَّا وَجَبَ الْبَيْعُ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ اخْتَرْ ‏\"‏ ‏.‏ فَقَالَ الأَعْرَابِيُّ عَمْرَكَ اللَّهَ بَيِّعًا ‏.‏",
    "malay_translation": "Rasulullah SAW membeli sekarung makanan haiwan ternakan daripada seorang lelaki Badwi. Selepas selesai urusan perniagaan, Rasulullah SAW berkata, 'Pilih (sama ada meneruskan atau membatalkan transaksi ini).' Lelaki Badwi itu berkata, 'Semoga Allah panjangkan umurmu dengan urusan perniagaan yang baik!'"
  },
  {
    "id": 31752,
    "hadith_number": 1919,
    "tajuk_hadith": "Perniagaan Berdasarkan Kerelaan",
    "perawi_melayu": "Daripada Dawud bin Salih Al-Madani, yang meriwayatkan daripada bapanya, yang berkata beliau mendengar Abu Sa'id Al-Khudri berkata:",
    "english_text": "I heard Abu Sa'eed Al-Khudri say: \"The Messenger of Allah (ﷺ) said: 'Transactions may only be done by mutual consent.\"'",
    "arabic_text": "حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ الدِّمَشْقِيُّ، حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ دَاوُدَ بْنِ صَالِحٍ الْمَدَنِيِّ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِنَّمَا الْبَيْعُ عَنْ تَرَاضٍ ‏\"‏ ‏.‏",
    "malay_translation": "Saya mendengar Abu Sa'id Al-Khudri berkata: \"Sesungguhnya, Rasulullah SAW bersabda, 'Perniagaan hanya boleh berlaku dengan kerelaan bersama.'\""
  },
  {
    "id": 31753,
    "hadith_number": 1920,
    "tajuk_hadith": "Ketetapan Perbezaan Harga dalam Perjanjian Jual Beli dan Cara Menyelesaikannya",
    "perawi_melayu": "Dikisahkan oleh Qasim bin 'Abdur Rahman dari bapanya, yang menceritakan:",
    "english_text": "Abdullah bin Mas'ud sold one of the slaves from the state to Ash'ath bin Qais, and they differed concerning the price. Ibn Mas'ud said: \"I sold him to you for twenty thousand,' but Ash'ath bin Qais said: \"I bought him from you for ten thousand.\" 'Abdullah said: \"If you want, I will tell you a Hadith which I heard from the Messenger of Allah (ﷺ)\" He said: \"Tell me it.\" He said: \"I heard the Messenger of Allah (ﷺ) say: 'If two parties to a transaction differ, and they have no proof, and the sale item remains (unredeemed), then what the seller says is valid. Or they may cancel the transaction.\" He said: \"I want to cancel the transaction.\" And he cancelled it.",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الصَّبَّاحِ، قَالاَ حَدَّثَنَا هُشَيْمٌ، أَنْبَأَنَا ابْنُ أَبِي لَيْلَى، عَنِ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، بَاعَ مِنَ الأَشْعَثِ بْنِ قَيْسٍ رَقِيقًا مِنْ رَقِيقِ الإِمَارَةِ فَاخْتَلَفَا فِي الثَّمَنِ ‏.‏ فَقَالَ ابْنُ مَسْعُودٍ بِعْتُكَ بِعِشْرِينَ أَلْفًا ‏.‏ وَقَالَ الأَشْعَثُ بْنُ قَيْسٍ إِنَّمَا اشْتَرَيْتُ مِنْكَ بِعَشْرَةِ آلاَفٍ ‏.‏ فَقَالَ عَبْدُ اللَّهِ إِنْ شِئْتَ حَدَّثْتُكَ بِحَدِيثٍ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ فَقَالَ هَاتِهِ ‏.‏ قَالَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ إِذَا اخْتَلَفَ الْبَيِّعَانِ وَلَيْسَ بَيْنَهُمَا بَيِّنَةٌ وَالْبَيْعُ قَائِمٌ بِعَيْنِهِ فَالْقَوْلُ مَا قَالَ الْبَائِعُ أَوْ يَتَرَادَّانِ الْبَيْعَ ‏\"‏ ‏.‏ قَالَ فَإِنِّي أَرَى أَنْ أَرُدَّ الْبَيْعَ ‏.‏ فَرَدَّهُ ‏.‏",
    "malay_translation": "Abdullah bin Mas'ud telah menjual seorang hamba daripada kalangan hamba kerajaan kepada Ash'ath bin Qais. Mereka berselisih mengenai harga. Abdullah bin Mas'ud berkata, \"Aku menjualnya kepadamu dengan harga dua puluh ribu.\" Ash'ath bin Qais berkata, \"Aku membelinya darimu dengan sepuluh ribu.\" Abdullah berkata, \"Jika engkau mahu, aku akan menceritakan sebuah hadis yang aku dengar daripada Rasulullah SAW.\" Ash'ath berkata, \"Ceritakanlah.\" Abdullah berkata, \"Aku mendengar Rasulullah SAW bersabda: 'Jika kedua belah pihak dalam perjanjian jual beli berselisih, dan tiada bukti di antara mereka, dan barang jualan itu masih ada, maka kata-kata penjual adalah sah. Atau mereka boleh membatalkan perjanjian jual beli itu.'\" Ash'ath berkata, \"Aku mahu membatalkan perjanjian jual beli ini.\" Dan dia membatalkannya."
  },
  {
    "id": 31754,
    "hadith_number": 1921,
    "tajuk_hadith": "Larangan Menjual Barang yang Tidak Dimiliki",
    "perawi_melayu": "Hakim bin Hizam meriwayatkan:",
    "english_text": "\"I said: 'O Messenger of Allah, a man is asking me to sell him something that I do not possess; Shall I sell it to him?' He said: 'Do not sell what is not with you.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، قَالَ سَمِعْتُ يُوسُفَ بْنَ مَاهَكَ، يُحَدِّثُ عَنْ حَكِيمِ بْنِ حِزَامٍ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ الرَّجُلُ يَسْأَلُنِي الْبَيْعَ وَلَيْسَ عِنْدِي أَفَأَبِيعُهُ قَالَ ‏\n\"‏ لاَ تَبِعْ مَا لَيْسَ عِنْدَكَ ‏\"‏ ‏.‏",
    "malay_translation": "Saya berkata: ‘Wahai Rasulullah, seorang lelaki meminta saya menjual sesuatu yang tidak ada pada saya; Adakah patut saya jual kepadanya?’ Baginda menjawab: ‘Janganlah engkau menjual apa yang tidak engkau miliki.’"
  },
  {
    "id": 31755,
    "hadith_number": 1922,
    "tajuk_hadith": "Larangan Menjual Barang yang Tidak Dimiliki",
    "perawi_melayu": "Telah diriwayatkan daripada 'Amr bin Shu'aib, daripada bapanya, daripada datuknya, bahawa beliau berkata:",
    "english_text": "\"The Messenger of Allah (ﷺ) said: 'It is not permissible to sell something that is not with you, nor to profit from what  you do not possess.\"'",
    "arabic_text": "حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، قَالاَ حَدَّثَنَا أَيُّوبُ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ يَحِلُّ بَيْعُ مَا لَيْسَ عِنْدَكَ وَلاَ رِبْحُ مَا لَمْ يُضْمَنْ ‏\"‏ ‏.‏",
    "malay_translation": "Pesuruh Allah (ﷺ) bersabda, ‘Tidak dibenarkan menjual sesuatu yang tidak ada di sisi anda, dan tidak dibenarkan memperoleh keuntungan daripada sesuatu yang anda tidak memiliki kepastiannya.’"
  },
  {
    "id": 31756,
    "hadith_number": 1923,
    "tajuk_hadith": "Larangan Memperoleh Untung daripada Barang yang Tidak Dimiliki",
    "perawi_melayu": "Dikisahkan oleh 'Ata bin Abi Rabbah daripada 'Attab bin Asid berkata:",
    "english_text": "When the Messenger of Allah (ﷺ) sent him to Makkah, he forbade him from profiting off of what he did not possess.",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ الْفُضَيْلِ، عَنْ لَيْثٍ، عَنْ عَطَاءٍ، عَنْ عَتَّابِ بْنِ أَسِيدٍ، قَالَ لَمَّا بَعَثَهُ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ إِلَى مَكَّةَ نَهَاهُ عَنْ شِفِّ مَا لَمْ يُضْمَنْ ‏.‏",
    "malay_translation": "Apabila Rasulullah SAW mengutusnya ke Mekah, baginda melarangnya daripada mencari keuntungan daripada sesuatu yang belum dimiliki atau dijamin kepunyaannya."
  },
  {
    "id": 31757,
    "hadith_number": 1924,
    "tajuk_hadith": "Keutamaan Pembeli Pertama dalam Perjanjian Jual Beli",
    "perawi_melayu": "Diceritakan oleh 'Uqbah bin 'Amir atau Samurah bin Jundub daripada Rasulullah SAW.",
    "english_text": "\"Any man who sells to two men, it is for the one who was first.\"",
    "arabic_text": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، أَوْ سَمُرَةَ بْنِ جُنْدُبٍ عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ أَيُّمَا رَجُلٍ بَاعَ بَيْعًا مِنْ رَجُلَيْنِ فَهُوَ لِلأَوَّلِ مِنْهُمَا ‏\"‏ ‏.‏",
    "malay_translation": "Sesiapa lelaki yang menjual kepada dua orang lelaki, maka ia adalah untuk orang pertama di antara mereka."
  },
  {
    "id": 31758,
    "hadith_number": 1925,
    "tajuk_hadith": "Keutamaan Perjanjian Pertama dalam Jual Beli",
    "perawi_melayu": "Diriwayatkan daripada Samurah bahawa Rasulullah SAW bersabda:",
    "english_text": "\"If two (separate) authorized persons make a sale (of the same thing), then the first transaction is the one that is valid.\"",
    "arabic_text": "حَدَّثَنَا الْحُسَيْنُ بْنُ أَبِي السَّرِيِّ الْعَسْقَلاَنِيُّ، وَمُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سَعِيدُ بْنُ بَشِيرٍ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِذَا بَاعَ الْمُجِيزَانِ فَهُوَ لِلأَوَّلِ ‏\"‏ ‏.‏",
    "malay_translation": "\"Jika dua orang yang berkuasa melakukan jual beli (atas barang yang sama), maka transaksi pertama adalah yang sah.\""
  },
  {
    "id": 31759,
    "hadith_number": 1926,
    "tajuk_hadith": "Larangan Perjanjian Jaminan dalam Perniagaan",
    "perawi_melayu": "Daripada 'Amr bin Syu'aib, dari bapanya, dari datuknya, bahawa:",
    "english_text": "Nabi (ﷺ) melarang perjanjian yang melibatkan wang jaminan.",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، قَالَ بَلَغَنِي عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ نَهَى عَنْ بَيْعِ الْعُرْبَانِ ‏.‏",
    "malay_translation": "Rasulullah SAW melarang urus niaga yang melibatkan wang jaminan (‘arban). "
  },
  {
    "id": 31760,
    "hadith_number": 1927,
    "tajuk_hadith": "Larangan Perjanjian Jaminan dalam Perniagaan",
    "perawi_melayu": "Diceritakan oleh 'Amr bin Shu'aib daripada bapanya, daripada datuknya bahawa:",
    "english_text": "the Prophet (ﷺ) forbade the deal involving earnest money. (Hasan)Abu 'Abdullah said: Earnest money refers to when a man buys an animal for one hundred Dinar, then he gives the seller two Dinar in advance and says: \"If I do not buy the animal, then the two Dinar are yours.\"  And it was said that it refers, and Allah knows best, to when a man buys something, and gives the seller a Dirham or less or more, and says: \"If I take it (all well and good), and if I do not, then the Dirham is yours.\"",
    "arabic_text": "حَدَّثَنَا الْفَضْلُ بْنُ يَعْقُوبَ الرُّخَامِيُّ، حَدَّثَنَا حَبِيبُ بْنُ أَبِي حَبِيبٍ أَبُو مُحَمَّدٍ، كَاتِبُ مَالِكِ بْنِ أَنَسٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَامِرٍ الأَسْلَمِيُّ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ نَهَى عَنْ بَيْعِ الْعُرْبَانِ ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ الْعُرْبَانُ أَنْ يَشْتَرِيَ الرَّجُلُ دَابَّةً بِمِائَةِ دِينَارٍ فَيُعْطِيَهُ دِينَارَيْنِ أَرْبُونًا فَيَقُولَ إِنْ لَمْ أَشْتَرِ الدَّابَّةَ فَالدِّينَارَانِ لَكَ ‏.‏",
    "malay_translation": "Rasulullah SAW melarang transaksi jual beli yang melibatkan wang jaminan (ar-rabun).  Abu Abdullah menjelaskan, wang jaminan itu merujuk kepada situasi di mana seseorang membeli seekor haiwan dengan harga seratus dinar, kemudian dia memberikan dua dinar kepada penjual sebagai jaminan awal dan berkata, \"Jika saya tidak membeli haiwan itu, maka dua dinar itu kepunyaanmu.\"  Dan juga dikatakan, dan Allah lebih mengetahui, wang jaminan itu merujuk kepada situasi di mana seseorang membeli sesuatu, dan memberikan dirham atau lebih kurang kepada penjual, dan berkata, \"Jika saya mengambilnya (maka semuanya baik), dan jika tidak, maka dirham itu kepunyaanmu.\""
  },
  {
    "id": 31761,
    "hadith_number": 1928,
    "tajuk_hadith": "Larangan Perniagaan Gharar dan Hasah",
    "perawi_melayu": "Dikatakan oleh Abu Hurairah:",
    "english_text": "\"The Messenger of Allah (ﷺ) forbade Gharar transaction sand Hasah transactions.",
    "arabic_text": "حَدَّثَنَا مُحْرِزُ بْنُ سَلَمَةَ الْعَدَنِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ بَيْعِ الْغَرَرِ وَعَنْ بَيْعِ الْحَصَاةِ ‏.‏",
    "malay_translation": "“Rasulullah SAW melarang urus niaga Gharar dan urus niaga Hasah.”"
  },
  {
    "id": 31762,
    "hadith_number": 1929,
    "tajuk_hadith": "Larangan Perniagaan Gharar oleh Rasulullah SAW",
    "perawi_melayu": "Daripada Ibn 'Abbas, ia berkata:",
    "english_text": "\"The Messenger of Allah (ﷺ) forbade Gharar transactions.\"",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، وَالْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، قَالاَ حَدَّثَنَا الأَسْوَدُ بْنُ عَامِرٍ، حَدَّثَنَا أَيُّوبُ بْنُ عُتْبَةَ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ بَيْعِ الْغَرَرِ ‏.‏",
    "malay_translation": "Rasulullah SAW melarang urus niaga Gharar."
  },
  {
    "id": 31763,
    "hadith_number": 1930,
    "tajuk_hadith": "Larangan Menjual Beberapa Benda Tertentu sebelum Tempoh Tertentu",
    "perawi_melayu": "Telah diriwayatkan bahawa Abu Sa'id al-Khudri berkata:",
    "english_text": "“The Messenger of Allah (ﷺ) forbade selling what is in the wombs of cattle until they give birth, and selling what is in their udders unless it is measured out, and selling a slave who has fled, and selling spoils of war until it has been distributed, and selling Sadaqah until it has been received, and what a diver is going to bring up.\"",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جَهْضَمُ بْنُ عَبْدِ اللَّهِ الْيَمَامِيُّ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ الْبَاهِلِيِّ، عَنْ مُحَمَّدِ بْنِ زَيْدٍ الْعَبْدِيِّ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ شِرَاءِ مَا فِي بُطُونِ الأَنْعَامِ حَتَّى تَضَعَ وَعَمَّا فِي ضُرُوعِهَا إِلاَّ بِكَيْلٍ وَعَنْ شِرَاءِ الْعَبْدِ وَهُوَ آبِقٌ وَعَنْ شِرَاءِ الْمَغَانِمِ حَتَّى تُقْسَمَ وَعَنْ شِرَاءِ الصَّدَقَاتِ حَتَّى تُقْبَضَ وَعَنْ ضَرْبَةِ الْغَائِصِ ‏.‏",
    "malay_translation": "Rasulullah SAW melarang menjual apa yang ada di dalam perut binatang ternakan sehingga ia melahirkan anak, dan menjual apa yang ada di dalam putingnya melainkan dengan ukuran yang tepat, dan menjual hamba yang telah melarikan diri, dan menjual rampasan perang sehingga dibahagikan, dan menjual sedekah sehingga diterima, dan hasil tangkapan penyelam."
  },
  {
    "id": 31764,
    "hadith_number": 1931,
    "tajuk_hadith": "Larangan Menjual Hablul-Habalah",
    "perawi_melayu": "Daripada Ibn 'Umar bahawa:",
    "english_text": "Nabi (ﷺ) melarang menjual Hablul-Habalah.",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ نَهَى عَنْ بَيْعِ حَبَلِ الْحَبَلَةِ ‏.‏",
    "malay_translation": "Daripada Ibn 'Umar, bahawa Nabi (ﷺ) melarang menjual Hablul-Habalah."
  },
  {
    "id": 31765,
    "hadith_number": 1932,
    "tajuk_hadith": "Menjual Barang untuk Memberi Makan Keluarga dan Mengumpulkan Kayu Bakar",
    "perawi_melayu": "Daripada Anas bin Malik bahawa:",
    "english_text": "A man from among the Ansar came to the Prophet (ﷺ) and begged from him. He said, \"Do you have anything in your house?\" He said: \"Yes, a blanket, part of which we cover ourselves with and part we spread beneath us, and a bowl from which we drink water.\" He said: \"Givethem to me.\" So he brought them to him, and the Messenger of Allah (ﷺ) took them in his hand and said, \"Who will by these two things?\" A man said: \"I will by them for one Dirham.\" He said: \"Who will offer more than a Dirham?\" two or three times. A man said: \"I will buy them for two Dirham.\" So he gave them to him and took the two Dirham, which he gave to the Ansari and said: \"Buy food with one of them and give it to your family, and buy an axe with the other and bring it to me.\" So he did that, and the Messenger of Allah (ﷺ) took it and fixed a handle to it, and said: \"Go and gather firewood, and I do not want to see you for fifteen days.\" So he went and gathered firewood and sold it, then he came back, and he had earned ten Dirham. (The Prophet (ﷺ)) said: \"Buy food with some of it and clothes with some.\" Then he said: \"This is better for you than coming with begging (appearing)  as a spot on your face on the Day of Resurrection. Begging is only appropriate for one who is extremely poor or who is in severe debt, or one who must pay painful blood money.”",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا الأَخْضَرُ بْنُ عَجْلاَنَ، حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَجُلاً، مِنَ الأَنْصَارِ جَاءَ إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ يَسْأَلُهُ فَقَالَ ‏\"‏ لَكَ فِي بَيْتِكَ شَىْءٌ ‏\"‏ ‏.‏ قَالَ بَلَى حِلْسٌ نَلْبَسُ بَعْضَهُ وَنَبْسُطُ بَعْضَهُ وَقَدَحٌ نَشْرَبُ فِيهِ الْمَاءَ ‏.‏ قَالَ ‏\"‏ ائْتِنِي بِهِمَا ‏\"‏ ‏.‏ قَالَ فَأَتَاهُ بِهِمَا فَأَخَذَهُمَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ بِيَدِهِ ثُمَّ قَالَ ‏\"‏ مَنْ يَشْتَرِي هَذَيْنِ ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ أَنَا آخُذُهُمَا بِدِرْهَمٍ ‏.‏ قَالَ ‏\"‏ مَنْ يَزِيدُ عَلَى دِرْهَمٍ ‏\"‏ ‏.‏ مَرَّتَيْنِ أَوْ ثَلاَثًا قَالَ رَجُلٌ أَنَا آخُذُهُمَا بِدِرْهَمَيْنِ ‏.‏ فَأَعْطَاهُمَا إِيَّاهُ وَأَخَذَ الدِّرْهَمَيْنِ فَأَعْطَاهُمَا الأَنْصَارِيَّ وَقَالَ ‏\"‏ اشْتَرِ بِأَحَدِهِمَا طَعَامًا فَانْبِذْهُ إِلَى أَهْلِكَ وَاشْتَرِ بِالآخَرِ قَدُومًا فَأْتِنِي بِهِ ‏\"‏ ‏.‏ فَفَعَلَ فَأَخَذَهُ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَشَدَّ فِيهِ عُودًا بِيَدِهِ وَقَالَ ‏\"‏ اذْهَبْ فَاحْتَطِبْ وَلاَ أَرَاكَ خَمْسَةَ عَشَرَ يَوْمًا ‏\"‏ ‏.‏ فَجَعَلَ يَحْتَطِبُ وَيَبِيعُ فَجَاءَ وَقَدْ أَصَابَ عَشْرَةَ دَرَاهِمَ فَقَالَ ‏\"‏ اشْتَرِ بِبَعْضِهَا طَعَامًا وَبِبَعْضِهَا ثَوْبًا ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ هَذَا خَيْرٌ لَكَ مِنْ أَنْ تَجِيءَ وَالْمَسْأَلَةُ نُكْتَةٌ فِي وَجْهِكَ يَوْمَ الْقِيَامَةِ إِنَّ الْمَسْأَلَةَ لاَ تَصْلُحُ إِلاَّ لِذِي فَقْرٍ مُدْقِعٍ أَوْ لِذِي غُرْمٍ مُفْظِعٍ أَوْ دَمٍ مُوجِعٍ ‏\"‏ ‏.‏",
    "malay_translation": "Telah diriwayatkan daripada Anas bin Malik bahawa seorang lelaki daripada kalangan Ansar datang kepada Nabi SAW dan meminta pertolongan. Baginda bertanya, \"Adakah engkau mempunyai sesuatu di rumah?\"  Dia menjawab, \"Ya, selimut yang sebahagiannya kami pakai dan sebahagiannya kami bentangkan, serta mangkuk yang kami gunakan untuk minum air.\" Nabi SAW bersabda, \"Bawakan kedua-duanya kepadaKu.\" Lalu dia membawanya kepada Baginda. Rasulullah SAW mengambil kedua-duanya di tanganNya dan bersabda, \"Siapakah yang ingin membelinya?\" Seorang lelaki berkata, \"Aku akan membelinya dengan satu dirham.\" Baginda bertanya, \"Adakah ada yang mahu menawarkan harga lebih daripada satu dirham?\" (soalan itu ditanyakan dua atau tiga kali). Seorang lagi lelaki berkata, \"Aku akan membelinya dengan dua dirham.\" Lalu Baginda menyerahkannya kepadanya dan mengambil dua dirham. Kemudian Baginda menyerahkan dua dirham itu kepada lelaki Ansar dan bersabda, \"Belilah makanan dengan sebahagiannya dan berikan kepada keluargamu, dan belilah kapak dengan selebihnya dan bawakan kepadaku.\" Lelaki Ansar pun melakukannya. Kemudian, Rasulullah SAW mengambil kapak itu, meletakkan pegangan padanya dan bersabda, \"Pergilah dan kumpul kayu api, dan aku tidak mahu melihatmu selama lima belas hari.\"  Maka lelaki Ansar pergi dan mengumpulkan kayu api, menjualnya dan kembali dengan sepuluh dirham. Rasulullah SAW bersabda, \"Beli makanan dengan sebahagiannya dan beli pakaian dengan sebahagian lagi.\" Kemudian Baginda bersabda, \"Ini lebih baik untukmu daripada datang meminta-minta, yang akan menjadi celaan di wajahmu pada Hari Kiamat. Meminta-minta hanya sesuai untuk mereka yang sangat miskin, atau yang memiliki hutang yang besar, atau yang perlu membayar denda yang berat.\""
  },
  {
    "id": 31766,
    "hadith_number": 1933,
    "tajuk_hadith": "Pengampunan Allah bagi Mereka yang Mengampuni Muslim",
    "perawi_melayu": "Daripada Abu Hurairah, bahawa Rasulullah SAW bersabda:",
    "english_text": "Whoever agrees with a Muslim to cancel a transaction Allah will forgive his sins on the Day of Resurrection.",
    "arabic_text": "حَدَّثَنَا زِيَادُ بْنُ يَحْيَى أَبُو الْخَطَّابِ، حَدَّثَنَا مَالِكُ بْنُ سُعَيْرٍ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ أَقَالَ مُسْلِمًا أَقَالَهُ اللَّهُ عَثْرَتَهُ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa yang bersetuju dengan seorang Muslim untuk membatalkan suatu transaksi, Allah akan mengampunkan dosa-dosanya pada Hari Kiamat."
  },
  {
    "id": 31767,
    "hadith_number": 1934,
    "tajuk_hadith": "Peningkatan Harga dan Kepercayaan Kepada Allah SWT",
    "perawi_melayu": "Diceritakan oleh Anas bin Malik bahawa:",
    "english_text": "\"Prices rose during the time of the Messenger of Allah (ﷺ), and they said: 'O Messenger of Allah, prices have risen, so fix the prices for us.' He said: 'Indeed Allah is the Musa'ir,  the Razzaq (Provider). And I am hopeful that I meet my Lord and none of you are seeking (recompense from) me for an injustice involving blood or wealth.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا حَجَّاجٌ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ قَتَادَةَ، وَحُمَيْدٍ، وَثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ غَلاَ السِّعْرُ عَلَى عَهْدِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالُوا يَا رَسُولَ اللَّهِ قَدْ غَلاَ السِّعْرُ فَسَعِّرْ لَنَا ‏.‏ فَقَالَ ‏\n\"‏ إِنَّ اللَّهَ هُوَ الْمُسَعِّرُ الْقَابِضُ الْبَاسِطُ الرَّازِقُ إِنِّي لأَرْجُو أَنْ أَلْقَى رَبِّي وَلَيْسَ أَحَدٌ يَطْلُبُنِي بِمَظْلَمَةٍ فِي دَمٍ وَلاَ مَالٍ ‏\"‏ ‏.‏",
    "malay_translation": "Harga barang naik pada zaman Rasulullah SAW. Mereka berkata, 'Wahai Rasulullah, harga barang-barang telah melambung tinggi, tetapkanlah harga untuk kami.' Baginda bersabda, 'Sesungguhnya Allah adalah Pemberi Harga, Pemberi Rezeki. Dan aku berharap aku akan menemui Tuhanku, dan tidak seorang pun dari kamu akan meminta balasan atau pembalasan terhadap kezaliman yang melibatkan darah atau harta.'."
  },
  {
    "id": 31768,
    "hadith_number": 1935,
    "tajuk_hadith": "Ketidakpastian Harga dan Tindakan Rasulullah SAW",
    "perawi_melayu": "Dikisahkan oleh Abu Sa'id bin Al-As berkata:",
    "english_text": "\"Prices rose at the time of the Messenger of Allah (ﷺ), and they said: 'Why do you not fix the food prices, O Messenger of Allah?' He said: 'I hope that when I leave you, no one among you will be demanding restitution for a wrong that I have done to him.\"'",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ غَلاَ السِّعْرُ عَلَى عَهْدِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالُوا لَوْ قَوَّمْتَ يَا رَسُولَ اللَّهِ قَالَ ‏\n\"‏ إِنِّي لأَرْجُو أَنْ أُفَارِقَكُمْ وَلاَ يَطْلُبَنِي أَحَدٌ مِنْكُمْ بِمَظْلَمَةٍ ظَلَمْتُهُ ‏\"‏ ‏.‏",
    "malay_translation": "Harga barang-barang meningkat pada zaman Rasulullah SAW. Mereka berkata, 'Mengapa engkau tidak menetapkan harga makanan, wahai Rasulullah?' Baginda menjawab, 'Sesungguhnya aku berharap, apabila aku meninggalkan kamu, tidak ada seorang pun di antara kamu yang akan meminta ganti rugi atas kesalahan yang telah aku lakukan kepadanya.'"
  },
  {
    "id": 31769,
    "hadith_number": 1936,
    "tajuk_hadith": "Perlakuan Baik dalam Perniagaan Mendatangkan Keredhaan Allah",
    "perawi_melayu": "'Uthman bin 'Affan meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "“Allah will admit to Paradise a man who was lenient when he sold and when he bought. \"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبَانَ الْبَلْخِيُّ أَبُو بَكْرٍ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ يُونُسَ بْنِ عُبَيْدٍ، عَنْ عَطَاءِ بْنِ فَرُّوخَ، قَالَ قَالَ عُثْمَانُ بْنُ عَفَّانَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ أَدْخَلَ اللَّهُ رَجُلاً الْجَنَّةَ كَانَ سَهْلاً بَائِعًا وَمُشْتَرِيًا ‏\"‏ ‏.‏",
    "malay_translation": "“Allah akan memasukkan ke dalam Syurga seorang lelaki yang bersikap lemah lembut ketika menjual dan ketika membeli.”"
  },
  {
    "id": 31770,
    "hadith_number": 1937,
    "tajuk_hadith": "Rahmat Allah kepada Orang yang Lembut dalam Perniagaan",
    "perawi_melayu": "Dikisahkan daripada Jabir bin Abdullah bahawa Rasulullah SAW bersabda:",
    "english_text": "\"May Allah have mercy on a person who is lenient when he sells, lenient when he buys, and lenient when he asks for payment.\"",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا أَبُو غَسَّانَ، مُحَمَّدُ بْنُ مُطَرِّفٍ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ رَحِمَ اللَّهُ عَبْدًا سَمْحًا إِذَا بَاعَ سَمْحًا إِذَا اشْتَرَى سَمْحًا إِذَا اقْتَضَى ‏\"‏ ‏.‏",
    "malay_translation": "Semoga Allah merahmati hamba-Nya yang bersifat lemah lembut apabila menjual, lemah lembut apabila membeli, dan lemah lembut apabila menuntut pembayaran. "
  },
  {
    "id": 31771,
    "hadith_number": 1938,
    "tajuk_hadith": "Panduan Perniagaan Bagi Wanita Dalam Islam",
    "perawi_melayu": "Diriwayatkan oleh Qailah Umm Bani Anmar bahawa:",
    "english_text": "\"I came to the Messenger of Allah (ﷺ), during one of his 'Umrah at Marwah and said: 'O Messenger of Allah, I am a woman who buys and sells. When I want to buy something, I state a price less than I want to pay, then I raise it gradually until it reaches the price I want to pay. And when I want to sell something, I state a price more than I want, then I lower it until it reaches the price I want.' The Messenger of Allah (ﷺ) said: 'Do not do that, O Qailah. When you want to buy something, state the price you want, whether it is given or not. And when you want to sell something, state the price you want, whether it is given or not.'\"",
    "arabic_text": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، حَدَّثَنَا يَعْلَى بْنُ شَبِيبٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ بْنِ خُثَيْمٍ، عَنْ قَيْلَةَ أُمِّ بَنِي أَنْمَارٍ، قَالَتْ أَتَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ فِي بَعْضِ عُمَرِهِ عِنْدَ الْمَرْوَةِ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي امْرَأَةٌ أَبِيعُ وَأَشْتَرِي فَإِذَا أَرَدْتُ أَنْ أَبْتَاعَ الشَّىْءَ سُمْتُ بِهِ أَقَلَّ مِمَّا أُرِيدُ ثُمَّ زِدْتُ ثُمَّ زِدْتُ حَتَّى أَبْلُغَ الَّذِي أُرِيدُ وَإِذَا أَرَدْتُ أَنْ أَبِيعَ الشَّىْءَ سُمْتُ بِهِ أَكْثَرَ مِنَ الَّذِي أُرِيدُ ثُمَّ وَضَعْتُ حَتَّى أَبْلُغَ الَّذِي أُرِيدُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ لاَ تَفْعَلِي يَا قَيْلَةُ إِذَا أَرَدْتِ أَنْ تَبْتَاعِي شَيْئًا فَاسْتَامِي بِهِ الَّذِي تُرِيدِينَ أُعْطِيتِ أَوْ مُنِعْتِ ‏\"‏ ‏.‏ وَقَالَ ‏\"‏ إِذَا أَرَدْتِ أَنْ تَبِيعِي شَيْئًا فَاسْتَامِي بِهِ الَّذِي تُرِيدِينَ أَعْطَيْتِ أَوْ مَنَعْتِ ‏\"‏ ‏.‏",
    "malay_translation": "Aku datang kepada Rasulullah SAW semasa salah satu umrah baginda di Marwah dan berkata, 'Wahai Rasulullah, aku adalah seorang wanita yang membeli dan menjual. Apabila aku ingin membeli sesuatu, aku menyebutkan harga yang lebih rendah daripada yang aku inginkan, kemudian aku tambahkan secara berperingkat sehingga mencapai harga yang aku mahu. Dan apabila aku ingin menjual sesuatu, aku menyebutkan harga yang lebih tinggi daripada yang aku mahu, kemudian aku turunkan sehingga mencapai harga yang aku mahu.' Rasulullah SAW bersabda, 'Jangan lakukan begitu, wahai Qailah. Apabila engkau ingin membeli sesuatu, sebutkan harga yang engkau inginkan, sama ada ia diterima atau tidak. Dan apabila engkau ingin menjual sesuatu, sebutkan harga yang engkau inginkan, sama ada ia diterima atau tidak.'"
  },
  {
    "id": 31772,
    "hadith_number": 1939,
    "tajuk_hadith": "Penjualkan Unta dan Ganjaran dari Rampasan Perang",
    "perawi_melayu": "Jabir bin 'Abdullah meriwayatkan:",
    "english_text": "\"I was with the Prophet (ﷺ) on a military campaign, and he said to me: 'Will you sell this camel of yours for a Dinar?' I said: 'O Messenger of Allah, it is yours when I get to Al-Madinah.' He said: 'Then sell it for two Dinar, may Allah forgive you.' And he kept increasing the price for me, saying: 'May Allah forgive you,' each time, until the amount reached twenty Dinar. When I came to Al-Madinah, I took hold of the camel's head and brought it to the Prophet (ﷺ) and he said: 'O Bilal, give him twenty Dinar from the spoils of war.' And he said: 'Take your camel away and go to your people with it.'\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي نَضْرَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كُنْتُ مَعَ النَّبِيِّ ـ صلى الله عليه وسلم ـ فِي غَزْوَةٍ فَقَالَ لِي ‏\"‏ أَتَبِيعُ نَاضِحَكَ هَذَا بِدِينَارٍ وَاللَّهُ يَغْفِرُ لَكَ ‏\"‏ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ هُوَ نَاضِحُكُمْ إِذَا أَتَيْتُ الْمَدِينَةَ ‏.‏ قَالَ ‏\"‏ فَتَبِيعُهُ بِدِينَارَيْنِ وَاللَّهُ يَغْفِرُ لَكَ ‏\"‏ ‏.‏ قَالَ فَمَا زَالَ يَزِيدُنِي دِينَارًا دِينَارًا وَيَقُولُ مَكَانَ كُلِّ دِينَارٍ ‏\"‏ وَاللَّهُ يَغْفِرُ لَكَ ‏\"‏ ‏.‏ حَتَّى بَلَغَ عِشْرِينَ دِينَارًا فَلَمَّا أَتَيْتُ الْمَدِينَةَ أَخَذْتُ بِرَأْسِ النَّاضِحِ فَأَتَيْتُ بِهِ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\"‏ يَا بِلاَلُ أَعْطِهِ مِنَ الْعَيْبَةِ عِشْرِينَ دِينَارًا ‏\"‏ ‏.‏ وَقَالَ ‏\"‏ انْطَلِقْ بِنَاضِحِكَ وَاذْهَبْ بِهِ إِلَى أَهْلِكَ ‏\"‏ ‏.‏",
    "malay_translation": "Saya pernah bersama Nabi (ﷺ) dalam satu ekspedisi ketenteraan, dan baginda bersabda kepadaku, \"Adakah engkau ingin menjual unta milikmu ini dengan harga satu dinar?\"  Aku menjawab, \"Wahai Rasulullah, unta ini kepunyaanmu setelah aku sampai ke Madinah.\" Baginda berkata, \"Maka juallah unta itu dengan harga dua dinar, semoga Allah mengampunimu.\"  Dan baginda terus menambah harga unta itu, setiap kali dengan kata-kata, \"Semoga Allah mengampunimu,\" sehingga jumlahnya mencapai dua puluh dinar.  Apabila aku sampai ke Madinah, aku memegang kepala unta itu dan membawanya kepada Nabi (ﷺ). Baginda bersabda, \"Wahai Bilal, berikan kepadanya dua puluh dinar dari rampasan perang.\" Dan baginda bersabda lagi, \"Bawalah untamu dan pergilah bersama untamu kepada keluargamu.\""
  },
  {
    "id": 31773,
    "hadith_number": 1940,
    "tajuk_hadith": "Larangan Tawar-Menawar dan Sembelih Haiwan Susu sebelum Subuh",
    "perawi_melayu": "Dikatakan oleh 'Ali",
    "english_text": "\"The Messenger of Allah (ﷺ) forbade haggling before sunrise, and (he forbade) slaughtering animals that yield milk.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَسَهْلُ بْنُ أَبِي سَهْلٍ، قَالاَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، أَنْبَأَنَا الرَّبِيعُ بْنُ حَبِيبٍ، عَنْ نَوْفَلِ بْنِ عَبْدِ الْمَلِكِ، عَنْ أَبِيهِ، عَنْ عَلِيٍّ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ السَّوْمِ قَبْلَ طُلُوعِ الشَّمْسِ وَعَنْ ذَبْحِ ذَوَاتِ الدَّرِّ ‏.‏",
    "malay_translation": "Rasulullah SAW melarang tawar-menawar sebelum matahari terbit dan melarang menyembelih haiwan yang menghasilkan susu."
  },
  {
    "id": 31774,
    "hadith_number": 1941,
    "tajuk_hadith": "Tiga Golongan yang Allah Tidak Bicara dan Tidak Melihat Mereka di Hari Kiamat",
    "perawi_melayu": "Daripada Abu Hurairah, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"There are three to whom Allah will not speak on the Day of Resurrection, nor will He look at them or purify them, and theirs will be a painful torment: A man who has surplus water in the desert but refuses to give any to a wayfarer; a man who sells a product to a man after 'Asr and swears by Allah that he bought it for such and such amount, and he believes him, when that is not the case; and a man who swears allegiance to a ruler, and only does so for worldly gains, so if he gives him some of (these worldly benefits) he fulfills his oath of allegiance, and if he is not given anything he does not uphold his oath of allegiance. \"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، وَأَحْمَدُ بْنُ سِنَانٍ، قَالُوا حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ ثَلاَثَةٌ لاَ يُكَلِّمُهُمُ اللَّهُ عَزَّ وَجَلَّ يَوْمَ الْقِيَامَةِ وَلاَ يَنْظُرُ إِلَيْهِمْ وَلاَ يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ رَجُلٌ عَلَى فَضْلِ مَاءٍ بِالْفَلاَةِ يَمْنَعُهُ ابْنَ السَّبِيلِ وَرَجُلٌ بَايَعَ رَجُلاً سِلْعَةً بَعْدَ الْعَصْرِ فَحَلَفَ بِاللَّهِ لأَخَذَهَا بِكَذَا وَكَذَا فَصَدَّقَهُ وَهُوَ عَلَى غَيْرِ ذَلِكَ وَرَجُلٌ بَايَعَ إِمَامًا لاَ يُبَايِعُهُ إِلاَّ لِدُنْيَا فَإِنْ أَعْطَاهُ مِنْهَا وَفَى لَهُ وَإِنْ لَمْ يُعْطِهِ مِنْهَا لَمْ يَفِ لَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Tiga golongan tidak akan dipertuturkan dengan Allah SWT pada hari kiamat, tidak akan dilihat dan tidak akan disucikan, dan mereka akan menerima azab yang pedih: Orang yang mempunyai banyak air di padang pasir tetapi enggan memberikannya kepada pengembara; orang yang menjual barang kepada orang lain setelah waktu 'Asr dan bersumpah dengan nama Allah bahawa dia membelinya dengan harga tertentu, dan yang lain mempercayainya, sedangkan harga sebenar berbeza; dan orang yang bersumpah setia kepada seorang pemimpin tetapi hanya kerana kepentingan duniawi, jika dia menerima sesuatu yang duniawi, maka dia akan memenuhi sumpah setia, dan jika tidak menerima apa-apa, maka dia tidak akan menepati sumpah setia."
  },
  {
    "id": 31775,
    "hadith_number": 1942,
    "tajuk_hadith": "Tiga Golongan yang Tidak Diberi Pertuturan Allah SWT pada Hari Kiamat",
    "perawi_melayu": "Diceritakan daripada Abu Dzar bahawa Rasulullah SAW bersabda:",
    "english_text": "\"There are three to whom Allah will not speak on the Day of Resurrection nor will He look at them or purify them, and theirs will be a painful torment.\" I said: \"Who are they, O Messenger of Allah? For they are indeed losers.\" He said: \"The one who lets his garment hang beneath his ankles, the one who reminds another of what he has given him, and the one who sells his product by means of false oaths.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَمُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنِ الْمَسْعُودِيِّ، عَنْ عَلِيِّ بْنِ مُدْرِكٍ، عَنْ خَرَشَةَ بْنِ الْحُرِّ، عَنْ أَبِي ذَرٍّ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَلِيِّ بْنِ مُدْرِكٍ، عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ، عَنْ خَرَشَةَ بْنِ الْحُرِّ، عَنْ أَبِي ذَرٍّ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ ثَلاَثَةٌ لاَ يُكَلِّمُهُمُ اللَّهُ يَوْمَ الْقِيَامَةِ وَلاَ يَنْظُرُ إِلَيْهِمْ وَلاَ يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ ‏\"‏ ‏.‏ فَقُلْتُ مَنْ هُمْ يَا رَسُولَ اللَّهِ فَقَدْ خَابُوا وَخَسِرُوا ‏.‏ قَالَ ‏\"‏ الْمُسْبِلُ إِزَارَهُ وَالْمَنَّانُ عَطَاءَهُ وَالْمُنَفِّقُ سِلْعَتَهُ بِالْحَلِفِ الْكَاذِبِ ‏\"‏ ‏.‏",
    "malay_translation": "Terdapat tiga golongan yang Allah SWT tidak akan bercakap dengan mereka pada Hari Kiamat, tidak akan melihat mereka, dan tidak akan mensucikan mereka. Bagi mereka ada azab yang pedih. Saya bertanya, \"Wahai Rasulullah, siapakah mereka? Sesungguhnya mereka telah rugi.\" Baginda menjawab, \"Orang yang melepaskan kainnya hingga ke bawah buku lali, orang yang suka mengingatkan pemberiannya kepada orang lain, dan orang yang menjual barangannya dengan sumpah palsu.\""
  },
  {
    "id": 31776,
    "hadith_number": 1943,
    "tajuk_hadith": "Waspada Sumpah dalam Perniagaan",
    "perawi_melayu": "Daripada Abu Qatadah, Rasulullah SAW bersabda:",
    "english_text": "\"Beware of swearing oaths when selling, for it may help you to make a sale but it destroys the blessing.\"",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ، حَدَّثَنَا عَبْدُ الأَعْلَى، ح وَحَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ، عَنْ مَعْبَدِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِي قَتَادَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِيَّاكُمْ وَالْحَلِفَ فِي الْبَيْعِ فَإِنَّهُ يُنَفِّقُ ثُمَّ يَمْحَقُ ‏\"‏ ‏.‏",
    "malay_translation": "“Jauhilah sumpah dalam urusan jual beli, kerana ia mungkin memudahkan urusan tetapi ia akan menghancurkan keberkatan.”"
  },
  {
    "id": 31777,
    "hadith_number": 1944,
    "tajuk_hadith": "Hak Cipta Buah Kelapa yang Dibeli",
    "perawi_melayu": "Daripada Ibn 'Umar, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Whoever buys a palm tree that has been pollinated, its fruits belong to the seller, unless the purchaser stipulated a condition.\" (Sahih)\n\nAnother chain from Ibn 'Umar, from the Prophet (ﷺ), with similar wording.",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَنِ اشْتَرَى نَخْلاً قَدْ أُبِّرَتْ فَثَمَرَتُهَا لِلْبَائِعِ إِلاَّ أَنْ يَشْتَرِطَ الْمُبْتَاعُ ‏\"‏ ‏.‏ \n حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ بِنَحْوِهِ ‏.‏",
    "malay_translation": "Barangsiapa membeli pokok kelapa yang sudah berbunga, maka hasilnya adalah kepunyaan penjual, melainkan jika pembeli telah menetapkan syarat. (Sahih)\n\nSatu lagi sanad daripada Ibn 'Umar, daripada Nabi SAW, dengan lafaz yang serupa."
  },
  {
    "id": 31778,
    "hadith_number": 1945,
    "tajuk_hadith": "Hukum Jual Beli Pokok Palma dan Hamba yang Mempunyai Harta",
    "perawi_melayu": "Dikisahkan daripada Salim bin Abdullah bin Umar, daripada Ibn Umar bahawa:",
    "english_text": "the Messenger of Allah (ﷺ) said: \"Whoever sells a palm tree that has been pollinated, its fruits belong to the seller, unless the purchaser stipulated a condition. And whoever buys a slave who has wealth, his wealth belongs to the seller, unless the purchaser stipulated a condition.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، ح وَحَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، جَمِيعًا عَنِ ابْنِ شِهَابٍ الزُّهْرِيِّ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَنْ بَاعَ نَخْلاً قَدْ أُبِّرَتْ فَثَمَرَتُهَا لِلَّذِي بَاعَهَا إِلاَّ أَنْ يَشْتَرِطَ الْمُبْتَاعُ وَمَنِ ابْتَاعَ عَبْدًا وَلَهُ مَالٌ فَمَالُهُ لِلَّذِي بَاعَهُ إِلاَّ أَنْ يَشْتَرِطَ الْمُبْتَاعُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Barangsiapa menjual pokok palma yang sudah berbuah, maka hasilnya adalah milik penjual, melainkan pembeli telah menetapkan syarat. Dan barangsiapa membeli hamba yang mempunyai harta, maka hartanya adalah milik penjual, melainkan pembeli telah menetapkan syarat.\""
  },
  {
    "id": 31779,
    "hadith_number": 1946,
    "tajuk_hadith": "Larangan Menjual Pokok Palma dan Hamba Serentak",
    "perawi_melayu": "Diceritakan oleh Nafi' daripada Ibn 'Umar bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Whoever sells a palm tree and sells a slave.\" Mentioning both of them together.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْوَلِيدِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ أَنَّهُ قَالَ ‏\n\"‏ مَنْ بَاعَ نَخْلاً وَبَاعَ عَبْدًا جَمَعَهُمَا جَمِيعًا ‏\"‏ ‏.‏",
    "malay_translation": "“Barangsiapa menjual pokok palma dan menjual hamba, maka hendaklah dia menggabungkannya secara bersamaan.”"
  },
  {
    "id": 31780,
    "hadith_number": 1947,
    "tajuk_hadith": "Hak Atas Buah dan Harta Hamba",
    "perawi_melayu": "Dikatakan oleh 'Ubadah bin Samit:",
    "english_text": "\"The Messenger of Allah (ﷺ) ruled that the fruit of a palm tree belongs to the one who pollinated it, and that the wealth of a slave belongs to the one who sold him, unless the purchaser stipulated a condition.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ رَبِّهِ بْنُ خَالِدٍ النُّمَيْرِيُّ أَبُو الْمُغَلِّسِ، حَدَّثَنَا الْفُضَيْلُ بْنُ سُلَيْمَانَ، عَنْ مُوسَى بْنِ عُقْبَةَ، حَدَّثَنِي إِسْحَاقُ بْنُ يَحْيَى بْنِ الْوَلِيدِ بْنِ عُبَادَةَ بْنِ الصَّامِتِ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ قَضَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنَّ ثَمَرَ النَّخْلِ لِمَنْ أَبَّرَهَا إِلاَّ أَنْ يَشْتَرِطَ الْمُبْتَاعُ وَأَنَّ مَالَ الْمَمْلُوكِ لِمَنْ بَاعَهُ إِلاَّ أَنْ يَشْتَرِطَ الْمُبْتَاعُ ‏.‏",
    "malay_translation": "Rasulullah SAW telah memutuskan bahawa hasil buah kurma milik orang yang menanamnya, dan harta hamba milik penjualnya, melainkan pembeli menetapkan syarat yang lain."
  },
  {
    "id": 31781,
    "hadith_number": 1948,
    "tajuk_hadith": "Larangan Menjual Buah Sebelum Matang",
    "perawi_melayu": "Daripada Ibn 'Umar, dari Rasulullah SAW.",
    "english_text": "\"Do not sell fruits until they have ripened.\" And he forbade (both) the seller and the purchaser (to engage in such a transaction).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لاَ تَبِيعُوا الثَّمَرَةَ حَتَّى يَبْدُوَ صَلاَحُهَا ‏\"‏ ‏.‏ نَهَى الْبَائِعَ وَالْمُشْتَرِيَ ‏.‏",
    "malay_translation": "Janganlah menjual buah-buahan sebelum masak. Baginda SAW melarang (kedua-dua) penjual dan pembeli daripada melakukan urusan sedemikian."
  },
  {
    "id": 31782,
    "hadith_number": 1949,
    "tajuk_hadith": "Larangan Menjual Buah sebelum Matang",
    "perawi_melayu": "Daripada Abu Hurairah, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Do not sell fruits until they have ripened.\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عِيسَى الْمِصْرِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ يُونُسَ بْنِ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ تَبِيعُوا الثَّمَرَ حَتَّى يَبْدُوَ صَلاَحُهُ ‏\"‏ ‏.‏",
    "malay_translation": "Jangan menjual buah-buahan sehingga ia masak dan sempurna."
  },
  {
    "id": 31783,
    "hadith_number": 1950,
    "tajuk_hadith": "Larangan Menjual Buah Sebelum Masak",
    "perawi_melayu": "Dikisahkan oleh Jabir bahawa:",
    "english_text": "The Prophet (ﷺ) forbade selling fruits until they have ripened.",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ نَهَى عَنْ بَيْعِ الثَّمَرِ حَتَّى يَبْدُوَ صَلاَحُهُ ‏.‏",
    "malay_translation": "Rasulullah SAW melarang menjual buah-buahan sehingga buah tersebut masak sempurna."
  },
  {
    "id": 31784,
    "hadith_number": 1951,
    "tajuk_hadith": "Larangan Menjual Buah-buahan dan Anggur Sebelum Matang",
    "perawi_melayu": "Daripada Anas bin Malik, bahawa:",
    "english_text": "the Messenger of Allah (ﷺ) forbade selling fruits until they have changed the color, and selling grapes until they have turned black, and selling grains until they have hardened.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا حَجَّاجٌ، حَدَّثَنَا حَمَّادٌ، عَنْ حُمَيْدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ نَهَى عَنْ بَيْعِ الثَّمَرَةِ حَتَّى تَزْهُوَ وَعَنْ بَيْعِ الْعِنَبِ حَتَّى يَسْوَدَّ وَعَنْ بَيْعِ الْحَبِّ حَتَّى يَشْتَدَّ ‏.‏",
    "malay_translation": "Rasulullah SAW melarang menjual buah-buahan sehingga warnanya berubah, dan melarang menjual anggur sehingga menjadi hitam, dan melarang menjual bijirin sehingga menjadi keras."
  },
  {
    "id": 31785,
    "hadith_number": 1952,
    "tajuk_hadith": "Larangan Menjual untuk Tempoh Masa yang Jauh",
    "perawi_melayu": "Dikisahkan oleh Jabir bin Abdullah bahawa:",
    "english_text": "The Messenger of Allah (ﷺ) forbade selling for many years ahead.",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، وَمُحَمَّدُ بْنُ الصَّبَّاحِ، قَالاَ حَدَّثَنَا سُفْيَانُ، عَنْ حُمَيْدٍ الأَعْرَجِ، عَنْ سُلَيْمَانَ بْنِ عَتِيقٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ نَهَى عَنْ بَيْعِ السِّنِينَ ‏.‏",
    "malay_translation": "Rasulullah SAW melarang menjual sesuatu untuk tempoh yang banyak di masa hadapan."
  },
  {
    "id": 31786,
    "hadith_number": 1953,
    "tajuk_hadith": "Larangan Mengambil Harta Saudara Muslim dalam Bencana Tanaman",
    "perawi_melayu": "Jabir bin Abdullah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Whoever sells fruits then the crop fails, should not take any of his brother's money. Why would any of you take the money of his Muslim brother?\"",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، حَدَّثَنَا ثَوْرُ بْنُ يَزِيدَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَنْ بَاعَ ثَمَرًا فَأَصَابَتْهُ جَائِحَةٌ فَلاَ يَأْخُذْ مِنْ مَالِ أَخِيهِ شَيْئًا عَلاَمَ يَأْخُذُ أَحَدُكُمْ مَالَ أَخِيهِ الْمُسْلِمِ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa yang menjual buah-buahan, kemudian tanamannya gagal, maka janganlah dia mengambil harta saudaranya. Mengapa salah seorang daripada kamu akan mengambil harta saudara Muslimnya?"
  },
  {
    "id": 31787,
    "hadith_number": 1954,
    "tajuk_hadith": "Nabi SAW Menasihati Penimbang Bagi Lebih Adil",
    "perawi_melayu": "Suwaid bin Qais meriwayatkan:",
    "english_text": "\"Makhrafah Al' Abdi and I brought linens from Hajar The Messenger of Allah (ﷺ) came to us to bargain with us with some trousers. There was someone with me who weighed (the goods) in exchange for a wage. So the Prophet (ﷺ) said to the one weighing: 'Weigh and add more.'\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، وَمُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالُوا حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ سُوَيْدِ بْنِ قَيْسٍ، قَالَ جَلَبْتُ أَنَا وَمَخْرَفَةُ الْعَبْدِيُّ، بَزًّا مِنْ هَجَرَ فَجَاءَنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَسَاوَمَنَا سَرَاوِيلَ وَعِنْدَنَا وَزَّانٌ يَزِنُ بِالأَجْرِ فَقَالَ لَهُ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\n\"‏ يَا وَزَّانُ زِنْ وَأَرْجِحْ ‏\"‏ ‏.‏",
    "malay_translation": "Suwaid bin Qais meriwayatkan, \"Saya dan Makhrafah Al'Abdi membawa kain dari Hajar.  Kemudian Rasulullah SAW datang kepada kami untuk berunding mengenai beberapa seluar.  Kami mempunyai seorang penimbang yang bekerja untuk upah.  Maka Nabi SAW bersabda kepadanya, 'Wahai penimbang, timbanglah dan tambahkan sedikit.'\""
  },
  {
    "id": 31788,
    "hadith_number": 1955,
    "tajuk_hadith": "Perbelanjaan dan Berat dalam Jual Beli di Zaman Rasulullah SAW",
    "perawi_melayu": "Simak bin Harb meriwayatkan bahawa:",
    "english_text": "\"I heard Malik Abu Safwan bin 'Umairah, say: 'I bought a pair of trousers from the Messenger of Allah (ﷺ) before the Hijrah, and he weighed it for me and allowed more.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَمُحَمَّدُ بْنُ الْوَلِيدِ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، قَالَ سَمِعْتُ مَالِكًا أَبَا صَفْوَانَ بْنَ عُمَيْرَةَ، قَالَ بِعْتُ مِنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ رِجْلَ سَرَاوِيلَ قَبْلَ الْهِجْرَةِ فَوَزَنَ لِي فَأَرْجَحَ لِي ‏.‏",
    "malay_translation": "Aku mendengar Malik Abu Safwan bin 'Umairah berkata, 'Aku membeli sepasang seluar daripada Rasulullah SAW sebelum Hijrah. Baginda menimbangnya untukku dan menambah beratnya bagi kepentinganku.'"
  },
  {
    "id": 31789,
    "hadith_number": 1956,
    "tajuk_hadith": "Keutamaan Memberi Lebih dalam Penimbangan",
    "perawi_melayu": "Daripada Jabir bin Abdullah, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"When you weigh, allow more. \"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَارِبِ بْنِ دِثَارٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِذَا وَزَنْتُمْ فَأَرْجِحُوا ‏\"‏ ‏.‏",
    "malay_translation": "Apabila kamu menimbang, maka berikan lebih.  (Ertinya, dalam urusan jual beli, berikan lebih berat pada pembeli)."
  },
  {
    "id": 31790,
    "hadith_number": 1957,
    "tajuk_hadith": "Ketidakadilan dalam Timbangan dan Sukatan sebelum dan Selepas Kedatangan Rasulullah SAW di Madinah",
    "perawi_melayu": "Dikisahkan bahawa Ibn 'Abbas berkata:",
    "english_text": "\"When the Prophet (ﷺ) came to Al-Madinah, they were the worst people in weights and measures. Then Allah, Glorious is He revealed: \"Woe to the Mutaffifun (those who give less in measure and weight)\", and they were fair in weights and measures after that.",
    "arabic_text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ بِشْرِ بْنِ الْحَكَمِ، وَمُحَمَّدُ بْنُ عَقِيلِ بْنِ خُوَيْلِدٍ، قَالاَ حَدَّثَنَا عَلِيُّ بْنُ الْحُسَيْنِ بْنِ وَاقِدٍ، حَدَّثَنِي أَبِي، حَدَّثَنِي يَزِيدُ النَّحْوِيُّ، أَنَّ عِكْرِمَةَ، حَدَّثَهُ عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمَّا قَدِمَ النَّبِيُّ ـ صلى الله عليه وسلم ـ الْمَدِينَةَ كَانُوا مِنْ أَخْبَثِ النَّاسِ كَيْلاً فَأَنْزَلَ اللَّهُ سُبْحَانَهُ ‏{وَيْلٌ لِلْمُطَفِّفِينَ}‏ فَأَحْسَنُوا الْكَيْلَ بَعْدَ ذَلِكَ ‏.‏",
    "malay_translation": "Apabila Nabi SAW datang ke Madinah, mereka adalah orang-orang yang paling buruk dalam hal timbangan dan ukuran. Kemudian Allah, Maha Suci Dia, menurunkan ayat: \"Celakalah orang-orang yang melakukan penipuan dalam timbangan dan ukuran.\"  Selepas itu, mereka menjadi jujur dalam timbangan dan ukuran."
  },
  {
    "id": 31791,
    "hadith_number": 1958,
    "tajuk_hadith": "Larangan Menipu dalam Perniagaan",
    "perawi_melayu": "Dikatakan oleh Abu Hurairah:",
    "english_text": "\"The Messenger of Allah (ﷺ) passed by a man who was selling food. He put his hand in it and saw that there was something wrong with it. The Messenger of Allah (ﷺ) said, 'He is not one of us who cheats.'\"",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ مَرَّ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ بِرَجُلٍ يَبِيِعُ طَعَامًا فَأَدْخَلَ يَدَهُ فِيهِ فَإِذَا هُوَ مَغْشُوشٌ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لَيْسَ مِنَّا مَنْ غَشَّ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW melewati seorang lelaki yang menjual makanan. Baginda memasukkan tangan ke dalam makanan itu dan mendapati ia tidak berkualiti. Rasulullah SAW bersabda, 'Bukan daripada kalangan kita orang yang menipu.'"
  },
  {
    "id": 31792,
    "hadith_number": 1959,
    "tajuk_hadith": "Larangan Menipu dalam Perbuatan Dagang",
    "perawi_melayu": "Dikatakan oleh Abu Hamra',",
    "english_text": "\"I saw the Messenger of Allah (ﷺ) pass by a man having food in a vessel. He put his hand in it and said: 'Perhaps you are cheating. Whoever cheats us is not one of us.\"'",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَاقَ، عَنْ أَبِي دَاوُدَ، عَنْ أَبِي الْحَمْرَاءِ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ مَرَّ بِجَنَبَاتِ رَجُلٍ عِنْدَهُ طَعَامٌ فِي وِعَاءٍ فَأَدْخَلَ يَدَهُ فِيهِ فَقَالَ ‏\n\"‏ لَعَلَّكَ غَشَشْتَهُ مَنْ غَشَّنَا فَلَيْسَ مِنَّا ‏\"‏ ‏.‏",
    "malay_translation": "Saya melihat Rasulullah SAW melewati seorang lelaki yang mempunyai makanan dalam bekas. Baginda memasukkan tangan ke dalam bekas itu dan bersabda, 'Mungkin engkau telah menipu. Sesiapa yang menipu kita, maka bukanlah dia dari kalangan kita.' "
  },
  {
    "id": 31793,
    "hadith_number": 1960,
    "tajuk_hadith": "Larangan Menjual Makanan Sebelum Menerima sepenuhnya",
    "perawi_melayu": "Dikisahkan daripada Ibn 'Umar bahawa Nabi SAW bersabda:",
    "english_text": "\"Barangsiapa membeli makanan, janganlah dia menjualnya sehingga dia menerimanya sepenuhnya.\"",
    "arabic_text": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَنِ ابْتَاعَ طَعَامًا فَلاَ يَبِعْهُ حَتَّى يَسْتَوْفِيَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa membeli makanan, janganlah dia menjualnya sehingga dia menerimanya sepenuhnya."
  },
  {
    "id": 31794,
    "hadith_number": 1961,
    "tajuk_hadith": "Larangan Menjual Makanan Sebelum Mempunyai Milik Penuh",
    "perawi_melayu": "Telah diriwayatkan oleh Ibn 'Abbas bahawa:",
    "english_text": "\"The Messenger of Allah (ﷺ) said: 'Whoever buys food, let him not sell it until he has taken full possession of it.'\" (Sahih)  In his narration, (one of the narrators) Abu 'Awanah said: \"Ibn 'Abbas said: 'I think everything is like food.\"'",
    "arabic_text": "حَدَّثَنَا عِمْرَانُ بْنُ مُوسَى اللَّيْثِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، ح وَحَدَّثَنَا بِشْرُ بْنُ مُعَاذٍ الضَّرِيرُ، حَدَّثَنَا أَبُو عَوَانَةَ، وَحَمَّادُ بْنُ زَيْدٍ، قَالاَ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنِ ابْتَاعَ طَعَامًا فَلاَ يَبِعْهُ حَتَّى يَسْتَوْفِيَهُ ‏\"‏ ‏.‏ قَالَ أَبُو عَوَانَةَ فِي حَدِيثِهِ قَالَ ابْنُ عَبَّاسٍ وَأَحْسِبُ كُلَّ شَىْءٍ مِثْلَ الطَّعَامِ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, 'Barangsiapa membeli makanan, janganlah dia menjualnya sehingga dia memperolehnya sepenuhnya.' (Sahih)  Dalam riwayatnya, Abu 'Awanah berkata, \"Ibn 'Abbas berkata, 'Saya rasa semua perkara itu seperti makanan.'\""
  },
  {
    "id": 31795,
    "hadith_number": 1962,
    "tajuk_hadith": "Larangan Menjual Makanan Sebelum Dua Sukatan Disahkan",
    "perawi_melayu": "Jabir meriwayatkan:",
    "english_text": "'The Messenger of Allah (ﷺ) forbade selling food bought by measure until two Sa' have been measured - the Sa' of the seller and the Sa' of the buyer.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ بَيْعِ الطَّعَامِ حَتَّى يَجْرِيَ فِيهِ الصَّاعَانِ صَاعُ الْبَائِعِ وَصَاعُ الْمُشْتَرِي ‏.‏",
    "malay_translation": "Rasulullah SAW melarang menjual makanan yang diukur sehingga dua sukatan (sa') telah diukur – sukatan penjual dan sukatan pembeli."
  },
  {
    "id": 31796,
    "hadith_number": 1963,
    "tajuk_hadith": "Larangan Menjual Makanan sebelum Sampai Tujuan",
    "perawi_melayu": "Telah diriwayatkan oleh Ibn 'Umar bahawa:",
    "english_text": "\"Kami biasa membeli makanan daripada rombongan penunggang (iaitu kafilah) tanpa mengetahui kuantitinya, tetapi Rasulullah SAW melarang kami menjualnya sehingga makanan tersebut sampai kepada kami.\"",
    "arabic_text": "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كُنَّا نَشْتَرِي الطَّعَامَ مِنَ الرُّكْبَانِ جِزَافًا فَنَهَانَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ نَبِيعَهُ حَتَّى نَنْقُلَهُ مِنْ مَكَانِهِ ‏.‏",
    "malay_translation": "Kami biasa membeli makanan dari rombongan penunggang (kafilah) tanpa mengetahui kuantitinya.  Rasulullah SAW melarang kami menjualnya sehingga makanan tersebut sampai kepada kami."
  },
  {
    "id": 31797,
    "hadith_number": 1964,
    "tajuk_hadith": "Menentukan Ukuran Jual Beli dengan Tepat",
    "perawi_melayu": "Dikisahkan oleh 'Uthman bin 'Affan, bahawa:",
    "english_text": "\"I used to sell dates in the marketplace, and I would say: 'This was such and such an amount (when I bought it).' I Would give the purchaser a specific amount of dates according to the way it had been measured for me, and take my profit. Then I began to have some doubts about that, so I asked the Messenger of Allah (ﷺ), and he said: ‘When you name the amount, measure it in front of the purchaser.\"'",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مَيْمُونٍ الرَّقِّيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ، عَنِ ابْنِ لَهِيعَةَ، عَنْ مُوسَى بْنِ وَرْدَانَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، قَالَ كُنْتُ أَبِيعُ التَّمْرَ فِي السُّوقِ فَأَقُولُ كِلْتُ فِي وَسْقِي هَذَا كَذَا ‏.‏ فَأَدْفَعُ أَوْسَاقَ التَّمْرِ بِكَيْلِهِ وَآخُذُ شِفِّي فَدَخَلَنِي مِنْ ذَلِكَ شَىْءٌ فَسَأَلْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\n\"‏ إِذَا سَمَّيْتَ الْكَيْلَ فَكِلْهُ ‏\"‏ ‏.‏",
    "malay_translation": "\"Saya biasa menjual kurma di pasar, dan saya akan menyebut: ‘Ini sebanyak sekian (apabila saya membelinya).’ Saya akan memberikan jumlah kurma tertentu kepada pembeli mengikut cara ia diukur untuk saya, dan mengambil keuntungan saya. Kemudian saya mula ragu-ragu tentang hal itu, jadi saya bertanya kepada Rasulullah SAW, dan baginda bersabda: ‘Apabila anda menyebut jumlahnya, ukurlah di hadapan pembeli.’\""
  },
  {
    "id": 31798,
    "hadith_number": 1965,
    "tajuk_hadith": "Mengukur Makanan untuk Mendapatkan Berkat",
    "perawi_melayu": "Dikatakan oleh Abdullah bin Busr Al-Mazini bahawa:",
    "english_text": "\"I heard the Messenger of Allah (ﷺ) say: 'Measure your food, may you be blessed therein.\"'",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الْيَحْصُبِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ الْمَازِنِيِّ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ كِيلُوا طَعَامَكُمْ يُبَارَكْ لَكُمْ فِيهِ ‏\"‏ ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda, 'Ukurlah makanan kamu, agar kamu diberkati di dalamnya.'"
  },
  {
    "id": 31799,
    "hadith_number": 1966,
    "tajuk_hadith": "Pengukuran Makanan untuk Mendapatkan Berkat",
    "perawi_melayu": "Daripada Abu Ayyub, daripada Nabi saw, yang bersabda:",
    "english_text": "\"Measure your food, may you be blessed therein.\"",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ، حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ، عَنْ بَحِيرِ بْنِ سَعْدٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنِ الْمِقْدَامِ بْنِ مَعْدِيكَرِبَ، عَنْ أَبِي أَيُّوبَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ كِيلُوا طَعَامَكُمْ يُبَارَكْ لَكُمْ فِيهِ ‏\"‏ ‏.‏",
    "malay_translation": "Ukurlah makanan kamu, nescaya kamu akan diberkati di dalamnya."
  },
  {
    "id": 31800,
    "hadith_number": 1967,
    "tajuk_hadith": "Pasar Nabit:  Pasar yang ditentukan oleh Rasulullah SAW",
    "perawi_melayu": "Dikisahkan oleh Abu Usaid bahawa:",
    "english_text": "the Messenger of Allah (ﷺ) went to the market of Nabit, and looked at it, and said: \"This is not a market for you.\" Then we went to another market and looked at it, and said: \"This is not a market for you.\" Then he came back to this market and walked around in it then he said: \"This is your market. It will always be your market and no duty will be levied on it.\" (Do,if)",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ، حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ بْنِ سَعِيدٍ، حَدَّثَنِي صَفْوَانُ بْنُ سُلَيْمٍ، حَدَّثَنِي مُحَمَّدٌ، وَعَلِيٌّ، ابْنَا الْحَسَنِ بْنِ أَبِي الْحَسَنِ الْبَرَّادِ أَنَّ الزُّبَيْرَ بْنَ الْمُنْذِرِ بْنِ أَبِي أُسَيْدٍ السَّاعِدِيِّ، حَدَّثَهُمَا أَنَّ أَبَاهُ الْمُنْذِرَ حَدَّثَهُ عَنْ أَبِي أُسَيْدٍ، أَنَّ أَبَا أُسَيْدٍ، حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ ذَهَبَ إِلَى سُوقِ النَّبِيطِ فَنَظَرَ إِلَيْهِ فَقَالَ ‏\"‏ لَيْسَ هَذَا لَكُمْ بِسُوقٍ ‏\"‏ ‏.‏ ثُمَّ ذَهَبَ إِلَى سُوقٍ فَنَظَرَ إِلَيْهِ فَقَالَ ‏\"‏ لَيْسَ هَذَا لَكُمْ بِسُوقٍ ‏\"‏ ‏.‏ ثُمَّ رَجَعَ إِلَى هَذَا السُّوقِ فَطَافَ فِيهِ ثُمَّ قَالَ ‏\"‏ هَذَا سُوقُكُمْ فَلاَ يُنْتَقَصَنَّ وَلاَ يُضْرَبَنَّ عَلَيْهِ خَرَاجٌ ‏\"‏ ‏.‏",
    "malay_translation": "Pesuruhjaya Allah (ﷺ) pergi ke pasar Nabit, memerhatikannya, dan bersabda: \"Ini bukan pasar untuk kamu.\" Kemudian Baginda pergi ke pasar lain dan memerhatikannya, dan bersabda: \"Ini bukan pasar untuk kamu.\" Kemudian Baginda kembali ke pasar ini, berjalan-jalan di dalamnya, dan bersabda: \"Inilah pasar kamu. Ia akan tetap menjadi pasar kamu dan tiada cukai akan dikenakan ke atasnya.\""
  },
  {
    "id": 31801,
    "hadith_number": 1968,
    "tajuk_hadith": "Keutamaan Solat Subuh dan Bahayanya Pergi ke Pasar Awal Pagi",
    "perawi_melayu": "Dikisahkan oleh Salman berkata:",
    "english_text": "\"I heard the Messenger of Allah (ﷺ) saying: 'Whoever goes to the Morning prayer first thing in the morning, he goes out with the banner of faith but whoever goes out to the marketplace first thing in the morning, he goes out under the banner of Iblis (Satan).' \"",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُسْتَمِرِّ الْعُرُوقِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْسُ بْنُ مَيْمُونٍ، حَدَّثَنَا عَوْنٌ الْعُقَيْلِيُّ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ سَلْمَانَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ مَنْ غَدَا إِلَى صَلاَةِ الصُّبْحِ غَدَا بِرَايَةِ الإِيمَانِ وَمَنْ غَدَا إِلَى السُّوقِ غَدَا بِرَايَةِ إِبْلِيسَ ‏\"‏ ‏.‏",
    "malay_translation": "Telah diceritakan bahawa Salman berkata: \"Aku mendengar Rasulullah SAW bersabda, 'Barangsiapa yang pergi ke solat Subuh di awal pagi, maka dia keluar dengan panji iman.  Dan barangsiapa yang pergi ke pasar di awal pagi, maka dia keluar dengan panji Iblis (Syaitan).'"
  },
  {
    "id": 31802,
    "hadith_number": 1969,
    "tajuk_hadith": "Ganjaran Agung Bagi Ucapan Tauhid di Pasaran",
    "perawi_melayu": "Dikisahkan oleh Salim bin 'Abdullah bin 'Umar, daripada bapanya, daripada datuknya, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Whoever says, when he enters the marketplace: 'La ilaha illallah wahdahu la sharika lahu, lahul-mulk wa lahul-hamdu, yuhyi wa yumitu, wa Huwa hayyun la yamutu, bi yadihil-khairu kulluhu, wa Huwa ala kulli shay’in Qadir (None has the right to be worshiped but Allah alone, with no partner, to Him belongs all sovereignty and to Him is the praise, He gives life and gives death, and He is Ever-Living and does not die; in His Hand is all goodness and He is Able to do all things),' Allah will record for him one million good deeds, and will erase from him one million bad deeds, and will build for him a house in Paradise. \"",
    "arabic_text": "حَدَّثَنَا بِشْرُ بْنُ مُعَاذٍ الضَّرِيرُ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، مَوْلَى آلِ الزُّبَيْرِ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ قَالَ حِينَ يَدْخُلُ السُّوقَ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ حَىٌّ لاَ يَمُوتُ بِيَدِهِ الْخَيْرُ كُلُّهُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ - كَتَبَ اللَّهُ لَهُ أَلْفَ أَلْفِ حَسَنَةٍ وَمَحَا عَنْهُ أَلْفَ أَلْفِ سَيِّئَةٍ وَبَنَى لَهُ بَيْتًا فِي الْجَنَّةِ ‏\"‏ ‏.‏",
    "malay_translation": "Barangsiapa yang mengucapkan kalimah syahadah (لا إله إلا الله) ketika memasuki pasar, iaitu:  \"Tiada Tuhan yang berhak disembah melainkan Allah SWT, tiada sekutu bagi-Nya, kepunyaan-Nya kerajaan dan kepunyaan-Nya segala pujian, Dia yang menghidupkan dan mematikan, dan Dia hidup kekal abadi; di tangan-Nya segala kebaikan dan Dia Maha Kuasa atas segala sesuatu,\" Allah akan menulis baginya satu juta amalan baik dan menghapuskan satu juta dosa daripadanya, dan membina untuknya sebuah rumah di Syurga."
  },
  {
    "id": 31803,
    "hadith_number": 1970,
    "tajuk_hadith": "Keberkatan dalam Perbuatan Pagi Hari",
    "perawi_melayu": "Dikisahkan daripada Sakhr Al-Ghamidi bahawa Rasulullah SAW bersabda:",
    "english_text": "\"O Allah, bless my nation in their early mornings (i.e., what they do early in the morning).\" (Hasan)He said: \"When he sent out a raiding party or an army, he would send them at the beginning of the day.\" He said: (1) \"Sakhr was a man engaged in trade, and he used to send his goods out at the beginning of the day, and his wealth grew and increased.\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا هُشَيْمٌ، عَنْ يَعْلَى بْنِ عَطَاءٍ، عَنْ عُمَارَةَ بْنِ حَدِيدٍ، عَنْ صَخْرٍ الْغَامِدِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ اللَّهُمَّ بَارِكْ لأُمَّتِي فِي بُكُورِهَا ‏\"‏ ‏.‏ قَالَ وَكَانَ إِذَا بَعَثَ سَرِيَّةً أَوْ جَيْشًا بَعَثَهُمْ فِي أَوَّلِ النَّهَارِ ‏.‏ قَالَ وَكَانَ صَخْرٌ رَجُلاً تَاجِرًا فَكَانَ يَبْعَثُ تِجَارَتَهُ فِي أَوَّلِ النَّهَارِ فَأَثْرَى وَكَثُرَ مَالُهُ ‏.‏",
    "malay_translation": "“Ya Allah, berkatilah umatku dalam usaha pagi mereka.” (Hasan) Diriwayatkan, baginda (Nabi SAW) akan menghantar pasukan serang atau tentera pada awal pagi. Dikatakan lagi, Sakhr, seorang pedagang,  biasa menghantar barang dagangannya pada awal pagi, dan hartanya bertambah dan bertambah banyak. "
  },
  {
    "id": 31804,
    "hadith_number": 1971,
    "tajuk_hadith": "Doa Berkat untuk Umat pada Waktu Subuh Hari Khamis",
    "perawi_melayu": "Dikisahkan oleh Abu Hurairah bahawa Rasulullah SAW bersabda:",
    "english_text": "\"O Allah, bless my nation early in the morning of Thursday.' \"",
    "arabic_text": "حَدَّثَنَا أَبُو مَرْوَانَ، مُحَمَّدُ بْنُ عُثْمَانَ الْعُثْمَانِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ مَيْمُونٍ الْمَدَنِيُّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي الزِّنَادِ، عَنْ أَبِيهِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ اللَّهُمَّ بَارِكْ لأُمَّتِي فِي بُكُورِهَا يَوْمَ الْخَمِيسِ ‏\"‏ ‏.‏",
    "malay_translation": "“Ya Allah, berkatilah umatku pada waktu awal pagi hari Khamis.”"
  },
  {
    "id": 31805,
    "hadith_number": 1972,
    "tajuk_hadith": "Doa Keselamatan untuk Umat Islam di Waktu Pagi",
    "perawi_melayu": "Diceritakan oleh Ibn Umar bahawa Rasulullah SAW bersabda:",
    "english_text": "\"O Allah, bless my nation early in the morning.' \"",
    "arabic_text": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، حَدَّثَنَا إِسْحَاقُ بْنُ جَعْفَرِ بْنِ مُحَمَّدِ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الْجُدْعَانِيِّ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ اللَّهُمَّ بَارِكْ لأُمَّتِي فِي بُكُورِهَا ‏\"‏ ‏.‏",
    "malay_translation": "\"Ya Allah, limpahkanlah keberkatan kepada umatku pada waktu pagi.\" (riwayat...)"
  },
  {
    "id": 31806,
    "hadith_number": 1973,
    "tajuk_hadith": "Keutamaan dan Pilihan Beli Musarrah (dengan Tempoh Tiga Hari) dan Balasannya",
    "perawi_melayu": "Daripada Abu Hurairah",
    "english_text": "\"O Allah, bless my nation in their early mornings.\". It was narrated from Abu Hurairah that the Prophet (ﷺ) said: \"Whoever buys a Musarrah, he has the choice (of annulling the deal) for three days. If he returns it, then he must also give a Sa' of dates, not Samra'.\" Meaning wheat.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامِ بْنِ حَسَّانَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَنِ ابْتَاعَ مُصَرَّاةً فَهُوَ بِالْخِيَارِ ثَلاَثَةَ أَيَّامٍ فَإِنْ رَدَّهَا رَدَّ مَعَهَا صَاعًا مِنْ تَمْرٍ لاَ سَمْرَاءَ ‏\"‏ ‏.‏ يَعْنِي الْحِنْطَةَ ‏.‏",
    "malay_translation": "\"Ya Allah, limpahkanlah keberkatan kepada umatku pada waktu pagi hari mereka.\". Diriwayatkan daripada Abu Hurairah bahawa Rasulullah SAW bersabda: \"Sesiapa yang membeli Musarrah, maka dia mempunyai pilihan (untuk membatalkan urus niaga) selama tiga hari. Jika dia mengembalikannya, maka dia mestilah memberi satu sa' kurma, bukan kurma Samra'.\" Maksudnya gandum."
  },
  {
    "id": 31807,
    "hadith_number": 1974,
    "tajuk_hadith": "Peraturan Pembelian dan Pengembalian Muhaffalah",
    "perawi_melayu": "'Abdullah bin 'Umar berkata:",
    "english_text": "\"The Messenger of Allah (ﷺ) said: 'Whoever buys a Muhaffalah, (1) he has the choice (of annulling the deal) for three days. If he returns it, then he must also give wheat equal to twice, the amount of its milk, or equal to the amount of its milk.\"'",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا صَدَقَةُ بْنُ سَعِيدٍ الْحَنَفِيُّ، حَدَّثَنَا جُمَيْعُ بْنُ عُمَيْرٍ التَّيْمِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ يَا أَيُّهَا النَّاسُ مَنْ بَاعَ مُحَفَّلَةً فَهُوَ بِالْخِيَارِ ثَلاَثَةَ أَيَّامٍ فَإِنْ رَدَّهَا رَدَّ مَعَهَا مِثْلَىْ لَبَنِهَا - أَوْ قَالَ مِثْلَ لَبَنِهَا - قَمْحًا ‏\"‏ ‏.‏",
    "malay_translation": "'Rasulullah SAW bersabda: 'Wahai sekalian manusia, sesiapa yang membeli Muhaffalah, maka dia berhak memilih untuk membatalkan urus niaga tersebut selama tiga hari. Jika dia mengembalikannya, maka dia mesti memberikan gandum sama dengan dua kali ganda jumlah susu yang dihasilkan olehnya, atau sama dengan jumlah susu yang dihasilkan.'"
  },
  {
    "id": 31808,
    "hadith_number": 1975,
    "tajuk_hadith": "Larangan Menjual Muhaffalah dan Maknanya Khilabah",
    "perawi_melayu": "Dikisahkan bahawa Abdullah bin Mas'ud berkata:",
    "english_text": "\"I bear witness that the true and truly inspired one Abul-Qasim (ﷺ) told us: 'Selling a Muhaffalah is Khilabah, and Khilabah is not lawful for the Muslim.\"' (Ibn Majah said: \" Meaning: 'Deception.\")",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الْمَسْعُودِيُّ، عَنْ جَابِرٍ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، أَنَّهُ قَالَ أَشْهَدُ عَلَى الصَّادِقِ الْمَصْدُوقِ أَبِي الْقَاسِمِ ـ صلى الله عليه وسلم ـ أَنَّهُ حَدَّثَنَا قَالَ ‏\n\"‏ بَيْعُ الْمُحَفَّلاَتِ خِلاَبَةٌ وَلاَ تَحِلُّ الْخِلاَبَةُ لِمُسْلِمٍ ‏\"‏ ‏.‏",
    "malay_translation": "“Aku memberi saksi bahawa junjungan mulia, Al-Sidiq Al-Mashduq, Abul-Qasim (ﷺ) telah memberitahu kami: ‘Menjual barang muhaffalah adalah khilabah, dan khilabah tidak dibenarkan bagi seorang Muslim.’” (Ibn Majah berkata: “Maksudnya: ‘Penipuan.’)”"
  },
  {
    "id": 31809,
    "hadith_number": 1976,
    "tajuk_hadith": "Keputusan Rasulullah SAW Mengenai Pendapatan Hamba",
    "perawi_melayu": "Daripada Aisyah رضي الله عنها :",
    "english_text": "the Messenger of Allah (ﷺ) ruled that what a slave earns belongs to his guarantor.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنْ مَخْلَدِ بْنِ خُفَافِ بْنِ إِيمَاءَ بْنِ رَحَضَةَ الْغِفَارِيِّ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَضَى أَنَّ خَرَاجَ الْعَبْدِ بِضَمَانِهِ ‏.‏",
    "malay_translation": "Rasulullah SAW memutuskan bahawa apa yang diperoleh oleh hamba adalah hak penjaminnya."
  },
  {
    "id": 31810,
    "hadith_number": 1977,
    "tajuk_hadith": "Hukum Pendapatan Hamba dan Penjaminnya",
    "perawi_melayu": "Diceritakan oleh 'Aishah:",
    "english_text": "A man bought a slave and put him to work, then he found some defect in him, so he returned him. He (the seller) said: \"O Messenger of Allah he put my slave to work.\" The Messenger of Allah (ﷺ) said: \"A slave's earnings belong to his guarantor.\"",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا مُسْلِمُ بْنُ خَالِدٍ الزَّنْجِيُّ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ رَجُلاً، اشْتَرَى عَبْدًا فَاسْتَغَلَّهُ ثُمَّ وَجَدَ بِهِ عَيْبًا فَرَدَّهُ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّهُ قَدِ اسْتَغَلَّ غُلاَمِي ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ الْخَرَاجُ بِالضَّمَانِ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki membeli seorang hamba dan menyuruhnya bekerja, kemudian dia mendapati kecacatan pada hamba itu, lalu mengembalikannya. Lelaki itu (penjual) berkata: \"Wahai Rasulullah, hambaku telah bekerja.\" Rasulullah SAW bersabda: \"Pendapatan hamba itu adalah hak penjaminnya.\""
  },
  {
    "id": 31811,
    "hadith_number": 1978,
    "tajuk_hadith": "Tempoh Jaminan Perjanjian untuk Hamba",
    "perawi_melayu": "Dikisahkan oleh Samurah bin Jundub bahawa Rasulullah SAW bersabda:",
    "english_text": "\"The contractual obligation regarding a slave lasts for three days.\" (1)",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، إِنْ شَاءَ اللَّهُ عَنْ سَمُرَةَ بْنِ جُنْدُبٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ عُهْدَةُ الرَّقِيقِ ثَلاَثَةُ أَيَّامٍ ‏\"‏ ‏.‏",
    "malay_translation": "Tempoh tanggungjawab (atau jaminan perjanjian) terhadap seorang hamba adalah selama tiga hari."
  },
  {
    "id": 31812,
    "hadith_number": 1979,
    "tajuk_hadith": "Tidak Ada Ikatan Kontrak Selepas Empat Hari",
    "perawi_melayu": "Diceritakan daripada 'Uqbah bin 'Amir bahawa Rasulullah SAW bersabda:",
    "english_text": "\"There is no contractual obligation after four (days).\"",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، حَدَّثَنَا هُشَيْمٌ، عَنْ يُونُسَ بْنِ عُبَيْدٍ، عَنِ الْحَسَنِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لاَ عُهْدَةَ بَعْدَ أَرْبَعٍ ‏\"‏ ‏.‏",
    "malay_translation": "Tidak ada kewajipan kontrak selepas empat (hari).“"
  },
  {
    "id": 31813,
    "hadith_number": 1980,
    "tajuk_hadith": "Larangan Menjual Barang Cacat kepada Saudara Muslim",
    "perawi_melayu": "Dikisahkan oleh 'Uqbah bin 'Amir",
    "english_text": "\"I heard the Messenger of Allah (ﷺ) say: 'The Muslim is the brother of another Muslim, and it is not permissible for a Muslim to sell his brother goods in which there is a defect, without pointing that out to him.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي، سَمِعْتُ يَحْيَى بْنَ أَيُّوبَ، يُحَدِّثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ شُمَاسَةَ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ الْمُسْلِمُ أَخُو الْمُسْلِمِ وَلاَ يَحِلُّ لِمُسْلِمٍ بَاعَ مِنْ أَخِيهِ بَيْعًا فِيهِ عَيْبٌ إِلاَّ بَيَّنَهُ لَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Telah diceritakan bahawa 'Uqbah bin 'Amir berkata, \"Saya mendengar Rasulullah SAW bersabda: 'Muslim itu adalah saudara kepada Muslim yang lain, dan tidak dibenarkan bagi seorang Muslim menjual barang yang cacat kepada saudaranya tanpa memberitahunya akan kecacatan itu.'"
  },
  {
    "id": 31814,
    "hadith_number": 1981,
    "tajuk_hadith": "Larangan Menjual Barang Cacat Tanpa Memberitahukannya",
    "perawi_melayu": "Telah diriwayatkan oleh Wathilah bin Asqa' bahawa:",
    "english_text": "\"I heard the Messenger of Allah (ﷺ) say: 'Whoever sells defective goods without pointing it out, he will remain subject to the wrath of Allah, and the angels will continue to curse him.'\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ الضَّحَّاكِ، حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ، عَنْ مُعَاوِيَةَ بْنِ يَحْيَى، عَنْ مَكْحُولٍ، وَسُلَيْمَانَ بْنِ مُوسَى، عَنْ وَاثِلَةَ بْنِ الأَسْقَعِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ مَنْ بَاعَ عَيْبًا لَمْ يُبَيِّنْهُ لَمْ يَزَلْ فِي مَقْتٍ مِنَ اللَّهِ وَلَمْ تَزَلِ الْمَلاَئِكَةُ تَلْعَنُهُ ‏\"‏ ‏.‏",
    "malay_translation": "Telah aku dengar Rasulullah SAW bersabda, \"Barangsiapa menjual barang yang cacat tanpa memberitahukan kecacatannya, dia akan kekal dalam kemurkaan Allah dan malaikat akan terus melaknatnya.\""
  },
  {
    "id": 31815,
    "hadith_number": 1982,
    "tajuk_hadith": "Rasulullah SAW Menggabungkan Ahli Keluarga yang Ditawan",
    "perawi_melayu": "Dikisahkan oleh 'Abdullah bin Mas'ud, bahawa:",
    "english_text": "\"When captives were brought to him, the Prophet (ﷺ) would give the members of one family together (to one person), not wanting to separate them.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَمُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ جَابِرٍ، عَنِ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ كَانَ النَّبِيُّ ـ صلى الله عليه وسلم ـ إِذَا أُتِيَ بِالسَّبْىِ أَعْطَى أَهْلَ الْبَيْتِ جَمِيعًا كَرَاهِيَةَ أَنْ يُفَرِّقَ بَيْنَهُمْ ‏.‏",
    "malay_translation": "Dikatakan bahawa Nabi SAW, apabila tawanan perang dibawa kepadanya, beliau akan menyerahkan ahli keluarga secara lengkap (kepada seorang individu), kerana tidak ingin memisahkan mereka."
  },
  {
    "id": 31816,
    "hadith_number": 1983,
    "tajuk_hadith": "Memulangkan Hamba yang Dijual",
    "perawi_melayu": "'Ali berkata:",
    "english_text": "\"The Messenger of Allah (ﷺ) gave me two slaves who were brothers, and I sold one of them. He said: 'What happened with the two slaves?' I said: 'I sold one of them.' He said: 'Take him back.'\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَفَّانُ، عَنْ حَمَّادٍ، أَنْبَأَنَا الْحَجَّاجُ، عَنِ الْحَكَمِ، عَنْ مَيْمُونِ بْنِ أَبِي شَبِيبٍ، عَنْ عَلِيٍّ، قَالَ وَهَبَ لِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ غُلاَمَيْنِ أَخَوَيْنِ فَبِعْتُ أَحَدَهُمَا فَقَالَ ‏\"‏ مَا فَعَلَ الْغُلاَمَانِ ‏\"‏ ‏.‏ قُلْتُ بِعْتُ أَحَدَهُمَا قَالَ ‏\"‏ رُدَّهُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW memberi dua orang hamba yang bersaudara kepada saya. Saya telah menjual salah seorang daripada mereka. Baginda bertanya, \"Apa yang telah kamu lakukan kepada kedua-dua hamba itu?\" Saya menjawab, \"Saya telah menjual salah seorang daripada mereka.\" Baginda memerintahkan, \"Kembalikan dia.\" "
  },
  {
    "id": 31817,
    "hadith_number": 1984,
    "tajuk_hadith": "Kutuk terhadap yang memisahkan ibu dan anak, atau saudara dan adik-beradik",
    "perawi_melayu": "Dikatakan oleh Abu Musa bahawa:",
    "english_text": "\"The Messenger of Allah (ﷺ) cursed the one who separates a mother and her child, or a brother from his brother.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ الْهَيَّاجِ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، أَنْبَأَنَا إِبْرَاهِيمُ بْنُ إِسْمَاعِيلَ، عَنْ طَلِيقِ بْنِ عِمْرَانَ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ لَعَنَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ مَنْ فَرَّقَ بَيْنَ الْوَالِدَةِ وَوَلَدِهَا وَبَيْنَ الأَخِ وَبَيْنَ أَخِيهِ ‏.‏",
    "malay_translation": "“Rasulullah SAW mengutuk sesiapa yang memisahkan seorang ibu dan anaknya, atau seorang saudara dari saudaranya.”"
  },
  {
    "id": 31818,
    "hadith_number": 1985,
    "tajuk_hadith": "Perjanjian Perdagangan Nabi SAW dengan 'Adda' bin Khalid bin Hawdhah",
    "perawi_melayu": "'Abdul-Majid bin Wahb meriwayatkan bahawa",
    "english_text": "\"Adda' bin Khalid bin Hawdhah bertanya kepada saya, 'Adakah saya membacakan surat yang Rasulullah SAW tulis kepada saya?' Saya menjawab, 'Ya.' Maka dia mengeluarkan sepucuk surat. Di dalamnya tertulis: 'Ini adalah apa yang dibeli 'Adda' bin Khalid bin Hawdhah daripada Muhammad Rasulullah SAW. Dia membeli seorang hamba atau seorang wanita hamba, tiada penyakit, tiada pelarian, tiada cacat. Perjualbeli antara orang Islam dengan orang Islam.'\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبَّادُ بْنُ لَيْثٍ، صَاحِبُ الْكَرَابِيسِيِّ حَدَّثَنَا عَبْدُ الْمَجِيدِ بْنُ وَهْبٍ، قَالَ قَالَ لِي الْعَدَّاءُ بْنُ خَالِدِ بْنِ هَوْذَةَ أَلاَ نُقْرِئُكَ كِتَابًا كَتَبَهُ لِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ قَالَ قُلْتُ بَلَى ‏.‏ فَأَخْرَجَ لِي كِتَابًا فَإِذَا فِيهِ ‏\n\"‏ هَذَا مَا اشْتَرَى الْعَدَّاءُ بْنُ خَالِدِ بْنِ هَوْذَةَ مِنْ مُحَمَّدٍ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ اشْتَرَى مِنْهُ عَبْدًا أَوْ أَمَةً لاَ دَاءَ وَلاَ غَائِلَةَ وَلاَ خِبْثَةَ بَيْعَ الْمُسْلِمِ لِلْمُسْلِمِ ‏\"‏ ‏.‏",
    "malay_translation": "Diceritakan bahawa 'Abdul-Majid bin Wahb berkata, 'Adda' bin Khalid bin Hawdhah berkata kepadaku, \"Adakah engkau mahu aku membacakan kepadamu surat yang Rasulullah SAW tulis untukku?\" Aku menjawab, \"Ya.\" Lalu dia mengeluarkan sepucuk surat. Di dalamnya tertulis: \"Ini adalah apa yang dibeli 'Adda' bin Khalid bin Hawdhah dari Muhammad Rasulullah SAW. Dia membeli seorang hamba lelaki atau perempuan, yang tidak berpenyakit, tidak melarikan diri, dan tidak bermasalah.  Perjanjian jual beli antara orang Islam dengan orang Islam.\" "
  },
  {
    "id": 31819,
    "hadith_number": 1986,
    "tajuk_hadith": "Petunjuk dalam Membeli Hamba dan Unta",
    "perawi_melayu": "Diriwayatkan daripada 'Amr bin Syu'aib daripada bapanya bahawa datuknya meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Ketika mana-mana kamu membeli seorang hamba perempuan, hendaklah dia berkata: 'Ya Allah, sesungguhnya aku memohon kebaikan padanya dan kebaikan yang Engkau telah jadikannya, dan aku berlindung kepada-Mu daripada kejahatannya dan kejahatan yang Engkau telah jadikannya.' Dan dia perlu mendoakan keberkatan. Dan jika mana-mana kamu membeli unta, hendaklah dia memegang bonggolnya dan mendoakan keberkatan dan mengucapkan perkataan yang sama.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنِ ابْنِ عَجْلاَنَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِذَا اشْتَرَى أَحَدُكُمُ الْجَارِيَةَ فَلْيَقُلِ اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا وَخَيْرَ مَا جَبَلْتَهَا عَلَيْهِ وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَشَرِّ مَا جَبَلْتَهَا عَلَيْهِ وَلْيَدْعُ بِالْبَرَكَةِ وَإِذَا اشْتَرَى أَحَدُكُمْ بَعِيرًا فَلْيَأْخُذْ بِذِرْوَةِ سَنَامِهِ وَلْيَدْعُ بِالْبَرَكَةِ وَلْيَقُلْ مِثْلَ ذَلِكَ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila seseorang di antara kamu membeli seorang hamba perempuan, hendaklah dia berdoa: \"Ya Allah, sesungguhnya aku memohon kebaikan padanya dan kebaikan yang telah Engkau jadikan padanya, dan aku berlindung kepada-Mu daripada kejahatannya dan kejahatan yang telah Engkau jadikan padanya.\" Dan dia harus mendoakan keberkatan. Dan jika seseorang di antara kamu membeli unta, hendaklah dia memegang puncak bonggolnya dan mendoakan keberkatan, serta mengucapkan doa yang serupa."
  },
  {
    "id": 31820,
    "hadith_number": 1987,
    "tajuk_hadith": "Larangan Ribā dalam Pertukaran Barang Sama Jenis",
    "perawi_melayu": "Dikisahkan oleh Malik bin Aws bin Hadathan al-Nasri, beliau berkata:",
    "english_text": "\"I heard 'Umar bin Al-Khattab say: 'The Messenger of Allah (ﷺ) said: \"Exchanging gold for gold is usury  unless it is done on the spot. (Exchanging) wheat for wheat is usury, unless it is done on the spot. (Exchanging) barley for barley is usury unless it is done on the spot. (Exchanging) dates for dates is usury, unless it is done on the spot.\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، وَهِشَامُ بْنُ عَمَّارٍ، وَنَصْرُ بْنُ عَلِيٍّ، وَمُحَمَّدُ بْنُ الصَّبَّاحِ، قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ النَّصْرِيِّ، قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ، يَقُولُ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ الذَّهَبُ بِالذَّهَبِ رِبًا إِلاَّ هَاءَ وَهَاءَ وَالْبُرُّ بِالْبُرِّ رِبًا إِلاَّ هَاءَ وَهَاءَ وَالشَّعِيرُ بِالشَّعِيرِ رِبًا إِلاَّ هَاءَ وَهَاءَ وَالتَّمْرُ بِالتَّمْرِ رِبًا إِلاَّ هَاءَ وَهَاءَ ‏\"‏ ‏.‏",
    "malay_translation": "Telah diceritakan kepada kami oleh Abu Bakar bin Abi Syaibah, Ali bin Muhammad, Hisyam bin Ammār, Nasr bin Ali dan Muhammad bin al-Shabbah, mereka berkata, telah menceritakan kepada kami Sufian bin Uyainah dari Zuhri daripada Malik bin Aws bin Hadathan al-Nasiri, yang berkata: Aku mendengar Umar bin al-Khattab berkata: Rasulullah SAW bersabda: \"Menukar emas dengan emas adalah riba kecuali dengan jual beli tunai. Menukar gandum dengan gandum adalah riba kecuali dengan jual beli tunai. Menukar barli dengan barli adalah riba kecuali dengan jual beli tunai. Menukar tamar dengan tamar adalah riba kecuali dengan jual beli tunai.\""
  },
  {
    "id": 31821,
    "hadith_number": 1988,
    "tajuk_hadith": "Larangan dan Ketetapan dalam Perniagaan mengikut Sunnah Nabi SAW",
    "perawi_melayu": "Muslim bin Yasar dan Abdullah bin Ubaid melaporkan:",
    "english_text": "\"Ubadah bin Samit and Mu'awiyah happened to meet, either in a church or in a synagogue. 'Ubadah bin Samit narrated to them and said: 'The Messenger of Allah (ﷺ) forbade us from selling silver for silver, gold for gold, wheat for wheat, barley for barley, and dates for dates.'I one of them said: \"And salt for salt,\" but the other did not say it. \"And he commanded us to sell wheat for barley, or barley for wheat, hand-to-hand, however we wished.\"",
    "arabic_text": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ خَالِدِ بْنِ خِدَاشٍ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، قَالاَ حَدَّثَنَا سَلَمَةُ بْنُ عَلْقَمَةَ التَّمِيمِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ سِيرِينَ، أَنَّ مُسْلِمَ بْنَ يَسَارٍ، وَعَبْدَ اللَّهِ بْنَ عُبَيْدٍ، حَدَّثَاهُ قَالاَ، جَمَعَ الْمَنْزِلُ بَيْنَ عُبَادَةَ بْنِ الصَّامِتِ وَمُعَاوِيَةَ إِمَّا فِي كَنِيسَةٍ وَإِمَّا فِي بِيعَةٍ فَحَدَّثَهُمْ عُبَادَةُ بْنُ الصَّامِتِ فَقَالَ نَهَانَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ بَيْعِ الْوَرِقِ بِالْوَرِقِ وَالذَّهَبِ بِالذَّهَبِ وَالْبُرِّ بِالْبُرِّ وَالشَّعِيرِ بِالشَّعِيرِ وَالتَّمْرِ بِالتَّمْرِ - قَالَ أَحَدُهُمَا وَالْمِلْحِ بِالْمِلْحِ وَلَمْ يَقُلْهُ الآخَرُ - وَأَمَرَنَا أَنْ نَبِيعَ الْبُرَّ بِالشَّعِيرِ وَالشَّعِيرَ بِالْبُرِّ يَدًا بِيَدٍ كَيْفَ شِئْنَا ‏.‏",
    "malay_translation": "Daripada Muslim bin Yasar dan Abdullah bin Ubaid, yang meriwayatkan bahawa mereka bertemu dengan Ubadah bin Samit, sama ada di dalam gereja atau sinagog. Ubadah bin Samit telah menceritakan kepada mereka, \"Rasulullah SAW telah melarang kita daripada menjual perak dengan perak, emas dengan emas, gandum dengan gandum, barli dengan barli, dan kurma dengan kurma.\" Salah seorang daripada mereka menambah, \"dan garam dengan garam,\" tetapi yang lain tidak menyebutnya. Dan baginda SAW telah memerintahkan kita untuk menjual gandum dengan barli atau barli dengan gandum secara tunai, dengan cara yang kita inginkan."
  },
  {
    "id": 31822,
    "hadith_number": 1989,
    "tajuk_hadith": "Pedagang yang Adil: Hukum Pertukaran Barang",
    "perawi_melayu": "Dari Abu Hurairah, daripada Nabi SAW",
    "english_text": "'(Sell) silver for silver, gold for gold, barley for barley, wheat for wheat, like for like.\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ، حَدَّثَنَا فُضَيْلُ بْنُ غَزْوَانَ، عَنِ ابْنِ أَبِي نُعْمٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ الْفِضَّةُ بِالْفِضَّةِ وَالذَّهَبُ بِالذَّهَبِ وَالشَّعِيرُ بِالشَّعِيرِ وَالْحِنْطَةُ بِالْحِنْطَةِ مِثْلاً بِمِثْلٍ ‏\"‏ ‏.‏",
    "malay_translation": "Emas dengan emas, perak dengan perak, barli dengan barli, gandum dengan gandum; sebanding dengan sebanding.  Nabi SAW bersabda, \"Pertukaran hendaklah adil. Emas ditukar dengan emas, perak dengan perak, barli dengan barli, dan gandum dengan gandum,  dengan kadar yang sama."
  },
  {
    "id": 31823,
    "hadith_number": 1990,
    "tajuk_hadith": "Larangan Penipuan dalam Perdagangan dan Ketetapan Timbangan",
    "perawi_melayu": "Dikisahkan oleh Abu Sa’eed yang berkata:",
    "english_text": "“The Prophet used to give us dates from the collection (mixed)  The Messenger of Allah said: ‘It is not right to give one Sa of dates for two Sa, nor one Dirham for two Dirham. A Dirham for a Dirham and a Dinar for a Dinar is allowed: the only difference between them is in weight (i.e., the weight must be equal.)’” Sahih",
    "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ كَانَ النَّبِيُّ ـ صلى الله عليه وسلم ـ يَرْزُقُنَا تَمْرًا مِنْ تَمْرِ الْجَمْعِ فَنَسْتَبْدِلُ بِهِ تَمْرًا هُوَ أَطْيَبُ مِنْهُ وَنَزِيدُ فِي السِّعْرِ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ يَصْلُحُ صَاعُ تَمْرٍ بِصَاعَيْنِ وَلاَ دِرْهَمٌ بِدِرْهَمَيْنِ وَالدِّرْهَمُ بِالدِّرْهَمِ وَالدِّينَارُ بِالدِّينَارِ لاَ فَضْلَ بَيْنَهُمَا إِلاَّ وَزْنًا ‏\"‏ ‏.‏",
    "malay_translation": "“Nabi saw biasanya memberi kami kurma campuran. Kemudian, Rasulullah SAW bersabda: ‘Tidak sah ditukar satu saa kurma dengan dua saa, atau satu dirham dengan dua dirham. Satu dirham dengan satu dirham dan satu dinar dengan satu dinar dibenarkan; satu-satunya perbezaan di antara mereka hanyalah dari segi berat (iaitu, berat mesti sama).’” (Sahih)"
  },
  {
    "id": 31824,
    "hadith_number": 1991,
    "tajuk_hadith": "Penjelasan Tentang Ribawi (Riba) dalam Islam",
    "perawi_melayu": "Dikatakan bahawa Abu Hurairah berkata:",
    "english_text": "\"I heard Abu Saeed Al-Khudri say: 'A Dirham for a Dirham and a Dinar for a Dinar.' So I said: 'I heard Ibn 'Abbas say something other than that.' He said: 'But I met Ibn 'Abbas and said: \"Tell me about what you say concerning  exchange is it something that you heard from the Messenger of Allah (ﷺ) or something that You found in the Book of Allah?\" He said: \"I did not find it in the Book of Allah, and I did not hear it from the Messenger of Allah; rather Usamah bin Zaid told me that the Messenger of Allah (ﷺ) said: \"Usury is only in credit.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ الدِّرْهَمُ بِالدِّرْهَمِ وَالدِّينَارُ بِالدِّينَارِ ‏.‏ فَقُلْتُ إِنِّي سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ غَيْرَ ذَلِكَ ‏.‏ قَالَ أَمَا إِنِّي لَقِيتُ ابْنَ عَبَّاسٍ فَقُلْتُ أَخْبِرْنِي عَنْ هَذَا الَّذِي تَقُولُ فِي الصَّرْفِ أَشَىْءٌ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ أَمْ شَىْءٌ وَجَدْتَهُ فِي كِتَابِ اللَّهِ ‏.‏ فَقَالَ مَا وَجَدْتُهُ فِي كِتَابِ اللَّهِ وَلاَ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ وَلَكِنْ أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ إِنَّمَا الرِّبَا فِي النَّسِيئَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Telah diceritakan kepada kami oleh Muhammad bin al-Shabbah, yang telah menceritakan kepada kami Sufian bin Uyainah, daripada Amru bin Dinar, daripada Abu Saalih, daripada Abu Hurairah, katanya: \"Saya mendengar Abu Sa'id al-Khudri berkata, 'Satu dirham dengan satu dirham dan satu dinar dengan satu dinar.' Lalu saya berkata, 'Saya mendengar Ibn Abbas berkata selain itu.' Beliau berkata, 'Sesungguhnya saya telah menemui Ibn Abbas, lalu saya bertanya kepadanya, \"Beritahu saya tentang apa yang anda katakan berkenaan pertukaran; adakah ia sesuatu yang anda dengar daripada Rasulullah SAW atau sesuatu yang anda dapati dalam Kitab Allah?\" Beliau menjawab, \"Saya tidak mendapati dalam Kitab Allah dan tidak mendengarnya daripada Rasulullah SAW. Sebaliknya, Usamah bin Zaid memberitahu saya bahawa Rasulullah SAW bersabda, 'Sesungguhnya riba itu hanyalah dalam tempoh bayaran tangguh.'\""
  },
  {
    "id": 31825,
    "hadith_number": 1992,
    "tajuk_hadith": "Penjelasan Ibn 'Abbas tentang Pertukaran Barang dan Kembali Pendapatnya",
    "perawi_melayu": "Dikatakan oleh Abu al-Jawza':",
    "english_text": "\"I heard him meaning Ibn 'Abbas allowing exchange (of Dirhams for Dirham etc., if extra was given) and that was narrated from him. Then I heard that he has taken back this opinion. I met him in Makkah and said: 'I heard that you had taken back (your opinion).' He said: 'Yes. That was just my own opinion, but Abu Sa'eed narrated from the Messenger of Allah (ﷺ) that he forbade exchange (of like items if extra is given).\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ، أَنْبَأَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ سُلَيْمَانَ بْنِ عَلِيٍّ الرِّبْعِيِّ، عَنْ أَبِي الْجَوْزَاءِ، قَالَ سَمِعْتُهُ يَأْمُرُ، بِالصَّرْفِ - يَعْنِي ابْنَ عَبَّاسٍ - وَيُحَدَّثُ ذَلِكَ عَنْهُ ثُمَّ بَلَغَنِي أَنَّهُ رَجَعَ عَنْ ذَلِكَ فَلَقِيتُهُ بِمَكَّةَ فَقُلْتُ إِنَّهُ بَلَغَنِي أَنَّكَ رَجَعْتَ ‏.‏ قَالَ نَعَمْ إِنَّمَا كَانَ ذَلِكَ رَأْيًا مِنِّي وَهَذَا أَبُو سَعِيدٍ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ أَنَّهُ نَهَى عَنِ الصَّرْفِ ‏.‏",
    "malay_translation": "Telah diceritakan oleh Abu al-Jawza', bahawa beliau mendengar Ibn 'Abbas membenarkan pertukaran (Dirham dengan Dirham dan sebagainya, jika ada tambahan) dan hal itu disampaikan olehnya. Kemudian aku diberitahu bahawa beliau telah menarik balik pendapat itu. Aku bertemu dengannya di Makkah dan aku berkata, 'Aku diberitahu bahawa engkau telah menarik balik pendapatmu.' Beliau menjawab, 'Ya. Itu hanyalah pendapat peribadinya, tetapi Abu Sa'id meriwayatkan daripada Rasulullah SAW bahawa baginda melarang pertukaran (barang sejenis dengan menambahkan sesuatu).'"
  },
  {
    "id": 31826,
    "hadith_number": 1993,
    "tajuk_hadith": "Larangan Ribā dalam Pertukaran Emas dan Perak",
    "perawi_melayu": "Diceritakan bahawa Zuhri mendengar Malik bin Aws bin Hadathan berkata:",
    "english_text": "\"I heard 'Umar say: \"The Messenger of Allah (ﷺ), said: 'Gold for silver is usury, unless it is exchanged on the spot.\"' (Sahih) Abu Bakr bin Abu-Shaibah said: \"I heard sufyan saying: 'Gold for silver.\" memorize (this).",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، سَمِعَ مَالِكَ بْنَ أَوْسِ بْنِ الْحَدَثَانِ، يَقُولُ سَمِعْتُ عُمَرَ، يَقُولُ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ الذَّهَبُ بِالْوَرِقِ رِبًا إِلاَّ هَاءَ وَهَاءَ ‏\"‏ ‏.‏ قَالَ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ سَمِعْتُ سُفْيَانَ يَقُولُ الذَّهَبُ بِالْوَرِقِ احْفَظُوا ‏.‏",
    "malay_translation": "Telah diriwayatkan bahawa Zuhri mendengar Malik bin Aws bin Hadathan berkata, \"Aku mendengar Umar berkata, Rasulullah SAW bersabda, 'Pertukaran emas dengan perak adalah riba kecuali jika ditukar di tempat'.\" Abu Bakar bin Abu Syaibah berkata, \"Aku mendengar Sufyan berkata, 'Emas dengan perak, ingatlah!'"
  },
  {
    "id": 31827,
    "hadith_number": 1994,
    "tajuk_hadith": "Larangan Ribā dalam Pertukaran Emas dan Perak",
    "perawi_melayu": "Dikatakan oleh Malik bin Aws bin Hadathan bahawa:",
    "english_text": "\"I came saying. 'Who will exchange Dirham?' Talhah bin 'Ubaidullah, who was with 'Umar bin Khattab, said: 'Show us your gold, then come to us; when our treasure comes, we will give you your silver.' 'Umar said: 'No, by Allah, you will give him silver (now), or give him back his gold, for the Messenger of Allah (ﷺ) said: \"Silver for gold is usury, unless it is exchanged on the spot.\"'",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ، قَالَ أَقْبَلْتُ أَقُولُ مَنْ يَصْطَرِفُ الدَّرَاهِمَ فَقَالَ طَلْحَةُ بْنُ عُبَيْدِ اللَّهِ وَهُوَ عِنْدَ عُمَرَ بْنِ الْخَطَّابِ أَرِنَا ذَهَبَكَ ثُمَّ ائْتِنَا إِذَا جَاءَ خَازِنُنَا نُعْطِكَ وَرِقَكَ ‏.‏ فَقَالَ عُمَرُ كَلاَّ وَاللَّهِ لَتُعْطِيَنَّهُ وَرِقَهُ أَوْ لَتَرُدَّنَّ إِلَيْهِ ذَهَبَهُ فَإِنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ الْوَرِقُ بِالذَّهَبِ رِبًا إِلاَّ هَاءَ وَهَاءَ ‏\"‏ ‏.‏",
    "malay_translation": "Aku datang bertanya, ‘Siapakah yang mahu menukar dirham?’  Talhah bin ‘Ubaidullah yang bersama ‘Umar bin al-Khattab berkata, ‘Tunjukkan emas kamu, kemudian datanglah kepada kami; apabila bendahari kami datang, kami akan beri perak kamu.’ ‘Umar berkata, ‘Tidak, demi Allah, engkau mesti beri perak (sekarang) kepadanya atau kembalikan emasnya kepadanya. Kerana Rasulullah SAW telah bersabda, “Pertukaran perak dengan emas adalah riba kecuali ditukar secara terus-menerus.”"
  },
  {
    "id": 31828,
    "hadith_number": 1995,
    "tajuk_hadith": "Pedagang Dinar dan Dirham dengan Harga Sama",
    "perawi_melayu": "Dikisahkan daripada Umar bin Muhammad bin Ali bin Abi Talib, daripada bapanya, bahawa datuknya telah berkata:",
    "english_text": "'The Messenger of Allah (ﷺ) said: 'Dinar for Dinar, Dirham for Dirham, with no increase between them. Whoever has need of silver, let him trade gold for it, and whoever has need of gold, let him trade silver for it, and let the transaction be done on the spot.\"'",
    "arabic_text": "حَدَّثَنَا أَبُو إِسْحَاقَ الشَّافِعِيُّ، إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ الْعَبَّاسِ حَدَّثَنِي أَبِي، عَنْ أَبِيهِ الْعَبَّاسِ بْنِ عُثْمَانَ بْنِ شَافِعٍ، عَنْ عُمَرَ بْنِ مُحَمَّدِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ الدِّينَارُ بِالدِّينَارِ وَالدِّرْهَمُ بِالدِّرْهَمِ لاَ فَضْلَ بَيْنَهُمَا فَمَنْ كَانَتْ لَهُ حَاجَةٌ بِوَرِقٍ فَلْيَصْطَرِفْهَا بِذَهَبٍ وَمَنْ كَانَتْ لَهُ حَاجَةٌ بِذَهَبٍ فَلْيَصْطَرِفْهَا بِالْوَرِقِ وَالصَّرْفُ هَاءَ وَهَاءَ ‏\"‏ ‏.‏",
    "malay_translation": "Pesuruh Allah (ﷺ) bersabda: \"Dinar dengan dinar, dirham dengan dirham, tiada kelebihan di antara keduanya. Barangsiapa yang memerlukan perak, hendaklah dia tukar emas dengannya, dan barangsiapa yang memerlukan emas, hendaklah dia tukar perak dengannya, dan hendaklah urusan pertukaran itu dilakukan di tempat itu juga.\""
  },
  {
    "id": 31829,
    "hadith_number": 1996,
    "tajuk_hadith": "Panduan Pertukaran Barang dan Kepastian Transaksi",
    "perawi_melayu": "Daripada Ibn 'Umar r.a.",
    "english_text": "\"Saya pernah menjual unta, dan saya pernah membeli emas dengan perak dan perak dengan emas, dinar dengan dirham dan dirham dengan dinar. Saya bertanya kepada Rasulullah saw tentang hal itu, dan baginda bersabda: 'Jika engkau mengambil salah satunya dan memberikan yang lain, maka janganlah engkau berpisah dengan temanmu sehingga semuanya jelas (iaitu, pertukaran itu selesai).’\" (Hasan) Rantaian lain dengan perkataan yang serupa.",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ بْنِ حَبِيبٍ، وَسُفْيَانُ بْنُ وَكِيعٍ، وَمُحَمَّدُ بْنُ عُبَيْدِ بْنِ ثَعْلَبَةَ الْحِمَّانِيُّ، قَالُوا حَدَّثَنَا عُمَرُ بْنُ عُبَيْدٍ الطَّنَافِسِيُّ، حَدَّثَنَا عَطَاءُ بْنُ السَّائِبِ، أَوْ سِمَاكٌ - وَلاَ أَعْلَمُهُ إِلاَّ سِمَاكًا - عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عُمَرَ قَالَ كُنْتُ أَبِيعُ الإِبِلَ فَكُنْتُ آخُذُ الذَّهَبَ مِنَ الْفِضَّةِ وَالْفِضَّةَ مِنَ الذَّهَبِ وَالدَّنَانِيرَ مِنَ الدَّرَاهِمِ وَالدَّرَاهِمَ مِنَ الدَّنَانِيرِ ‏.‏ فَسَأَلْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\n\"‏ إِذَا أَخَذْتَ أَحَدَهُمَا وَأَعْطَيْتَ الآخَرَ فَلاَ تُفَارِقْ صَاحِبَكَ وَبَيْنَكَ وَبَيْنَهُ لَبْسٌ ‏\"‏ ‏.‏ \n حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِسْحَاقَ، أَنْبَأَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ نَحْوَهُ ‏.‏",
    "malay_translation": "Daripada Ibn 'Umar r.a., beliau berkata, \"Saya pernah membeli-menjual unta, dan pernah membeli emas dengan perak, perak dengan emas, dinar dengan dirham, dan dirham dengan dinar. Kemudian saya bertanya kepada Rasulullah SAW tentang perkara itu, maka baginda bersabda: 'Jika engkau mengambil salah satunya dan memberikan yang lain, maka jangan berpisah dengan temanmu sehingga pertukaran itu selesai sepenuhnya.'\" (Hasan) Ada juga riwayat yang serupa."
  },
  {
    "id": 31830,
    "hadith_number": 1997,
    "tajuk_hadith": "Larangan Memusnahkan Wang Muslimi Tanpa Alasan",
    "perawi_melayu": "Daripada 'Alqamah bin 'Abdullah daripada bapanya",
    "english_text": "\"The Messenger of Allah (ﷺ) forbade breaking the coins of the Muslims that are in circulation among them, without any necessary reason.”(1)",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَسُوَيْدُ بْنُ سَعِيدٍ، وَهَارُونُ بْنُ إِسْحَاقَ، قَالُوا أَنْبَأَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ فَضَاءٍ، عَنْ أَبِيهِ، عَنْ عَلْقَمَةَ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ كَسْرِ سِكَّةِ الْمُسْلِمِينَ الْجَائِزَةِ بَيْنَهُمْ إِلاَّ مِنْ بَأْسٍ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW melarang merosakkan atau menghancurkan wang-wang kaum Muslimin yang sedang beredar di kalangan mereka, melainkan atas sebab yang munasabah."
  },
  {
    "id": 31831,
    "hadith_number": 1998,
    "tajuk_hadith": "Larangan Menukar Kurma Segar dengan Kurma Kering",
    "perawi_melayu": "Dikisahkan oleh Abdullah bin Yazid, bekas hamba abdi Al-Aswad bin Sufyan, bahawa:",
    "english_text": "Zaid, Abu 'Ayyash, the freed slave of Bani Zuhrah, told him that he asked Sa'd bin Abu Waqqas about buying wheat with barley. Sa'd said to him: \"Which of them is better?\" He said: \"Wheat.\" He told him not to do that and said: \"I heard the Messenger of Allah (ﷺ) being asked about buying fresh dates with dried dates, and he said: 'Do fresh dates decrease in weight when they become dry?' They said: 'Yes.' So he told them not to do that.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، وَإِسْحَاقُ بْنُ سُلَيْمَانَ، قَالاَ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، مَوْلَى الأَسْوَدِ بْنِ سُفْيَانَ أَنَّ زَيْدًا أَبَا عَيَّاشٍ، - مَوْلًى لِبَنِي زُهْرَةَ - أَخْبَرَهُ أَنَّهُ، سَأَلَ سَعْدَ بْنَ أَبِي وَقَّاصٍ عَنِ اشْتِرَاءِ الْبَيْضَاءِ، بِالسُّلْتِ فَقَالَ لَهُ سَعْدٌ أَيَّتُهُمَا أَفْضَلُ قَالَ الْبَيْضَاءُ ‏.‏ فَنَهَانِي عَنْهُ وَقَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ سُئِلَ عَنِ اشْتِرَاءِ الرُّطَبِ بِالتَّمْرِ فَقَالَ ‏\n\"‏ أَيَنْقُصُ الرُّطَبُ إِذَا يَبِسَ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ فَنَهَى عَنْ ذَلِكَ ‏.‏",
    "malay_translation": "Dikisahkan bahawa Zaid, Abu 'Ayyash, bekas hamba abdi Bani Zuhrah, bertanya kepada Said bin Abu Waqqas tentang menukar gandum dengan barli. Said bertanya, 'Manakah yang lebih baik?' Zaid menjawab, 'Gandum.' Said melarangnya dan berkata, 'Aku mendengar Rasulullah SAW ditanya tentang menukar kurma segar dengan kurma kering. Baginda bertanya, 'Adakah kurma segar menyusut beratnya jika dikeringkan?' Mereka menjawab, 'Ya.' Maka Baginda melarang perbuatan itu."
  },
  {
    "id": 31832,
    "hadith_number": 1999,
    "tajuk_hadith": "Larangan Perniagaan Muzabanah",
    "perawi_melayu": "Diceritakan oleh 'Abdullah bin 'Umar bahawa:",
    "english_text": "\"The Messenger of Allah (ﷺ) forbade the Muzabanah. The Muzdbanah means when a man sells the dates of his grove when they are still on the tree, for a measure of dty dates; or, if it is grapes, he sells them when they are still on the vine, for a measure of raisins; or if it is a crop, he sells it for food, estimating the amount (of the crop in the field). He forbade all of these things.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ الْمُزَابَنَةِ ‏.‏ وَالْمُزَابَنَةُ أَنْ يَبِيعَ الرَّجُلُ تَمْرَ حَائِطِهِ إِنْ كَانَتْ نَخْلاً بِتَمْرٍ كَيْلاً وَإِنْ كَانَتْ كَرْمًا أَنْ يَبِيعَهُ بِزَبِيبٍ كَيْلاً وَإِنْ كَانَتْ زَرْعًا أَنْ يَبِيعَهُ بِكَيْلِ طَعَامٍ نَهَى عَنْ ذَلِكَ كُلِّهِ ‏.‏",
    "malay_translation": "Rasulullah SAW melarang amalan Muzabanah. Muzabanah bermaksud apabila seseorang menjual buah kurma kebunnya ketika masih tergantung di pokok, dengan ukuran kurma kering; atau jika anggur, dia menjualnya ketika masih tergantung di pokok anggur, dengan ukuran kismis; atau jika tanaman, dia menjualnya dengan ukuran makanan, dikira berdasarkan jumlah tanaman di ladang. Baginda melarang semua amalan ini."
  },
  {
    "id": 31833,
    "hadith_number": 2000,
    "tajuk_hadith": "Larangan Rasulullah SAW Terhadap Perbuatan Muhaqalah dan Muzabanah",
    "perawi_melayu": "Diceritakan oleh Jabir bin Abdullah bahawa:",
    "english_text": "The Messenger of Allah (ﷺ) forbade the Muhaqalah and the Muzabanah.",
    "arabic_text": "حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ أَبِي الزُّبَيْرِ، وَسَعِيدِ بْنِ مِينَاءَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ نَهَى عَنِ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ ‏.‏",
    "malay_translation": "Pesuruhjaya Allah (ﷺ) melarang amalan Muhaqalah dan Muzabanah."
  },
  {
    "id": 31834,
    "hadith_number": 2001,
    "tajuk_hadith": "Larangan Rasulullah SAW terhadap Muhaqalah dan Muzabanah",
    "perawi_melayu": "Dikatakan oleh Rafi bin Khadij",
    "english_text": "\"The Messenger of Allah (ﷺ) forbade the Muhaqalah and the Muzabanah.\"",
    "arabic_text": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ طَارِقِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ ‏.‏",
    "malay_translation": "“Rasulullah SAW melarang Muhaqalah dan Muzabanah.”"
  },
  {
    "id": 31835,
    "hadith_number": 2002,
    "tajuk_hadith": "Perkenan Rasulullah SAW Mengenai Jual Beli ‘Araya",
    "perawi_melayu": "Zaid bin Thabit meriwayatkan kepada saya bahawa Rasulullah SAW telah memberikan keringanan mengenai jual beli ‘Araya.",
    "english_text": "\"Zaid bin Thabit narrated to me that the Messenger of Allah (ﷺ) gave a concession regarding the sale of 'Araya.”",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، وَمُحَمَّدُ بْنُ الصَّبَّاحِ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، حَدَّثَنِي زَيْدُ بْنُ ثَابِتٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ رَخَّصَ فِي الْعَرَايَا ‏.‏",
    "malay_translation": "Zaid bin Thabit meriwayatkan kepadaku bahawa Rasulullah SAW telah memberikan keringanan (atau keizinan) dalam urusan jual beli ‘Araya."
  },
  {
    "id": 31836,
    "hadith_number": 2003,
    "tajuk_hadith": "Peraturan Jual Beli Hasil Menuai 'Araya",
    "perawi_melayu": "'Abdullah bin 'Umar meriwayatkan, katanya:",
    "english_text": "\"Zaid bin Thabit memberitahu saya bahawa Rasulullah SAW memberi keringanan dalam urusan jual beli hasil panen 'Araya dengan pertukaran kurma kering.\" (Sahih) Yahya (salah seorang perawi) berkata: \"'Araya ialah apabila seseorang membeli buah kurma dari pokok untuk makanan keluarganya yang masak dengan menganggar jumlahnya (kurma tersebut).\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ حَدَّثَنِي زَيْدُ بْنُ ثَابِتٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ أَرْخَصَ فِي بَيْعِ الْعَرِيَّةِ بِخَرْصِهَا تَمْرًا ‏.‏ قَالَ يَحْيَى الْعَرِيَّةُ أَنْ يَشْتَرِيَ الرَّجُلُ ثَمَرَ النَّخَلاَتِ بِطَعَامِ أَهْلِهِ رُطَبًا بِخَرْصِهَا تَمْرًا ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Rumh, memberitahu kami Laits bin Sa'ad, dari Yahya bin Sa'id, dari Nafi', dari Abdullah bin 'Umar, bahawa dia berkata, \"Zaid bin Thabit telah menceritakan kepadaku bahawa Rasulullah SAW telah memberikan keringanan dalam urusan jual beli 'Araya dengan menukarkannya dengan kurma kering.\" Yahya berkata, 'Araya itu adalah apabila seseorang membeli buah kurma dari pokok-pokok untuk makanan keluarganya yang masak dengan menganggar jumlahnya."
  },
  {
    "id": 31837,
    "hadith_number": 2004,
    "tajuk_hadith": "Larangan Menjual Haiwan dengan Haiwan Secara Kredit",
    "perawi_melayu": "Daripada Samurah bin Jundub bahawa:",
    "english_text": "the Messenger of Allah (ﷺ) forbade selling animals for animals on credit.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ بْنِ جُنْدُبٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ نَهَى عَنْ بَيْعِ الْحَيَوَانِ بِالْحَيَوَانِ نَسِيئَةً ‏.‏",
    "malay_translation": "Rasulullah SAW melarang menjual haiwan dengan haiwan secara hutang (kredit).  Dikisahkan oleh Samurah bin Jundub."
  },
  {
    "id": 31838,
    "hadith_number": 2005,
    "tajuk_hadith": "Larangan Menjual Haiwan Secara Bayaran Tertangguh",
    "perawi_melayu": "Daripada Jabir, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"There is nothing wrong with selling animals, one for two, hand to hand,\" but he disliked selling them on credit.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، وَأَبُو خَالِدٍ عَنْ حَجَّاجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لاَ بَأْسَ الْحَيَوَانُ بِالْحَيَوَانِ وَاحِدًا بِاثْنَيْنِ يَدًا بِيَدٍ ‏\"‏ ‏.‏ وَكَرِهَهُ نَسِيئَةً ‏.‏",
    "malay_translation": "Tidak mengapa menjual haiwan, seekor dengan dua ekor, secara tunai. Namun baginda (Rasulullah SAW) tidak suka menjualnya secara ansuran."
  },
  {
    "id": 31839,
    "hadith_number": 2006,
    "tajuk_hadith": "Nabiﷺ Membeli Sayyidah Safiyyah dengan Harga Tujuh Budak",
    "perawi_melayu": "Dikatakan oleh Anas bahawa :",
    "english_text": "the Prophet (ﷺ) bought Safiyyah for seven slaves. (Sahih) (One of the narrators) 'Abdur-Rahman said: \"From Dihyah Kalbi.'",
    "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا الْحُسَيْنُ بْنُ عُرْوَةَ، ح وَحَدَّثَنَا أَبُو عُمَرَ، حَفْصُ بْنُ عَمْرٍو حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالاَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ اشْتَرَى صَفِيَّةَ بِسَبْعَةِ أَرْؤُسٍ ‏.‏ قَالَ عَبْدُ الرَّحْمَنِ مِنْ دِحْيَةَ الْكَلْبِيِّ ‏.‏",
    "malay_translation": "Nabi SAW telah membeli Sayyidah Safiyyah dengan harga tujuh orang hamba. (Sahih) (Salah seorang perawi) 'Abdur-Rahman berkata: \"Daripada Dihyah al-Kalbi.\""
  },
  {
    "id": 31840,
    "hadith_number": 2007,
    "tajuk_hadith": "Peringatan Mengenai Amalan Ribawi dan Akibatnya dalam Perjalanan Israk",
    "perawi_melayu": "Dikisahkan daripada Abu Hurairah bahawa Rasulullah SAW bersabda:",
    "english_text": "'\n\"'Pada malam aku diangkat dalam Israk, aku menemui kaum yang perutnya seperti rumah, di dalamnya terdapat ular yang kelihatan dari luar perut mereka. Aku bertanya, 'Siapakah mereka ini, wahai Jibril?' Dia menjawab, 'Mereka ini adalah orang-orang yang memakan riba.'\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ عَلِيِّ بْنِ زَيْدٍ، عَنْ أَبِي الصَّلْتِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ أَتَيْتُ لَيْلَةَ أُسْرِيَ بِي عَلَى قَوْمٍ بُطُونُهُمْ كَالْبُيُوتِ فِيهَا الْحَيَّاتُ تُرَى مِنْ خَارِجِ بُطُونِهِمْ فَقُلْتُ مَنْ هَؤُلاَءِ يَا جِبْرَائِيلُ قَالَ هَؤُلاَءِ أَكَلَةُ الرِّبَا ‏\"‏ ‏.‏",
    "malay_translation": "'Pada malam aku diangkat dalam Israk, aku bertemu dengan sekelompok orang yang perut mereka seperti rumah-rumah, dan di dalamnya terdapat ular-ular yang kelihatan dari luar perut mereka. Aku bertanya, \"Wahai Jibril, siapakah mereka ini?\" Jibril menjawab, \"Mereka ini adalah orang-orang yang memakan riba.\""
  },
  {
    "id": 31841,
    "hadith_number": 2008,
    "tajuk_hadith": "Perbandingan Riba dengan Perzinaan yang Teruk",
    "perawi_melayu": "Dikisahkan daripada Abu Hurairah bahawa Rasulullah SAW bersabda:",
    "english_text": "\"There are seventy degrees of usury, the least of which is equivalent to a man having intercourse with his mother.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ أَبِي مَعْشَرٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ الرِّبَا سَبْعُونَ حُوبًا أَيْسَرُهَا أَنْ يَنْكِحَ الرَّجُلُ أُمَّهُ ‏\"‏ ‏.‏",
    "malay_translation": "Terdapat tujuh puluh darjah riba, yang paling ringan adalah seperti mana seorang lelaki berkahwin dengan ibunya."
  },
  {
    "id": 31842,
    "hadith_number": 2009,
    "tajuk_hadith": "Penjelasan Tentang Berbagai Bentuk Riba",
    "perawi_melayu": "Dikisahkan daripada 'Abdullah bahawa Nabi SAW bersabda:",
    "english_text": "\"Terdapat tujuh puluh tiga jenis riba.\"",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ الصَّيْرَفِيُّ أَبُو حَفْصٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ زُبَيْدٍ، عَنْ إِبْرَاهِيمَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ الرِّبَا ثَلاَثَةٌ وَسَبْعُونَ بَابًا ‏\"‏ ‏.‏",
    "malay_translation": "\"Terdapat tujuh puluh tiga jenis riba.\""
  },
  {
    "id": 31843,
    "hadith_number": 2010,
    "tajuk_hadith": "Penjelasan Akhir Ayat Ribawi dan Larangan Riba",
    "perawi_melayu": "Dikisahkan oleh 'Umar bin al-Khattab",
    "english_text": "\"The last thing to be revealed was the Verse on usury but the Messenger of Allah (ﷺ) died before he had explained it to us. So give up usury (interest) and doubtful things.\"",
    "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، قَالَ إِنَّ آخِرَ مَا نَزَلَتْ آيَةُ الرِّبَا وَإِنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قُبِضَ وَلَمْ يُفَسِّرْهَا لَنَا فَدَعُوا الرِّبَا وَالرِّيبَةَ ‏.‏",
    "malay_translation": "Dikatakan oleh 'Umar bin al-Khattab, \"Ayat tentang riba merupakan ayat terakhir yang diturunkan, namun Rasulullah SAW telah wafat sebelum menerangkannya kepada kita. Oleh itu, jauhilah riba dan perkara yang syak.\""
  },
  {
    "id": 31844,
    "hadith_number": 2011,
    "tajuk_hadith": "Kutuk Nabi SAW Kepada Pengamal Ribawi dan Mereka yang Terlibat",
    "perawi_melayu": "Daripada 'Abdullah bin Mas'ud bahawa:",
    "english_text": "Xthe Messenger of Allah (ﷺ) cursed the one who consumes usury, the one who pays it, those who witness it and the one who writes it down.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا سِمَاكُ بْنُ حَرْبٍ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ عَبْدِ اللَّهِ، يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ لَعَنَ آكِلَ الرِّبَا وَمُوكِلَهُ وَشَاهِدَيْهِ وَكَاتِبَهُ ‏.‏",
    "malay_translation": "Pesuruh Allah SAW telah mengutuk orang yang memakan riba, orang yang membayarnya, saksi-saksi, dan penulisnya."
  },
  {
    "id": 31845,
    "hadith_number": 2012,
    "tajuk_hadith": "Masa Datangnya Riba dan Kesannya",
    "perawi_melayu": "Daripada Abu Hurairah, bahawa Rasulullah SAW bersabda:",
    "english_text": "“There will come a time when there will be no one left who does not consume usury (interest), and whoever does not consume it will nevertheless be affected by it.\"'",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ، عَنْ سَعِيدِ بْنِ أَبِي خَيْرَةَ، عَنِ الْحَسَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لَيَأْتِيَنَّ عَلَى النَّاسِ زَمَانٌ لاَ يَبْقَى مِنْهُمْ أَحَدٌ إِلاَّ أَكَلَ الرِّبَا فَمَنْ لَمْ يَأْكُلْ أَصَابَهُ مِنْ غُبَارِهِ ‏\"‏ ‏.‏",
    "malay_translation": "“Akan datang suatu zaman kepada manusia, tiada seorang pun yang tinggal di antara mereka melainkan memakan riba (bunga). Dan sesiapa yang tidak memakannya, ia tetap akan terkena debu riba itu.”"
  },
  {
    "id": 31846,
    "hadith_number": 2013,
    "tajuk_hadith": "Takdir Orang Yang Banyak Berurusan Dengan Riba",
    "perawi_melayu": "Daripada Ibn Mas'ud, daripada Nabi SAW.",
    "english_text": "\"There is no one who deals in usury a great deal (to increase his wealth) but he will end up with little (i.e., his wealth will be decreased).\"",
    "arabic_text": "حَدَّثَنَا الْعَبَّاسُ بْنُ جَعْفَرٍ، حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، حَدَّثَنَا يَحْيَى بْنُ أَبِي زَائِدَةَ، عَنْ إِسْرَائِيلَ، عَنْ رُكَيْنِ بْنِ الرَّبِيعِ بْنِ عَمِيلَةَ، عَنْ أَبِيهِ، عَنِ ابْنِ مَسْعُودٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَا أَحَدٌ أَكْثَرَ مِنَ الرِّبَا إِلاَّ كَانَ عَاقِبَةُ أَمْرِهِ إِلَى قِلَّةٍ ‏\"‏ ‏.‏",
    "malay_translation": "Tidak ada seorang pun yang banyak berurusan dengan riba melainkan akhirnya akan kekurangan harta."
  },
  {
    "id": 31847,
    "hadith_number": 2014,
    "tajuk_hadith": "Panduan Perniagaan yang Adil dalam Pertukaran Kurma",
    "perawi_melayu": "Dikisahkan oleh Ibn 'Abbas",
    "english_text": "\"When the Prophet (ﷺ) came (to Al-Madinah), they used to pay in advance for dates, two or three years in advance. He said: 'Whoever pays in advance for dates, let him pay for a known amount or a known weight, to be delivered at a known time.’\"",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ عَبْدِ اللَّهِ بْنِ كَثِيرٍ، عَنْ أَبِي الْمِنْهَالِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَدِمَ النَّبِيُّ ـ صلى الله عليه وسلم ـ وَهُمْ يُسْلِفُونَ فِي التَّمْرِ السَّنَتَيْنِ وَالثَّلاَثَ فَقَالَ ‏\n\"‏ مَنْ أَسْلَفَ فِي تَمْرٍ فَلْيُسْلِفْ فِي كَيْلٍ مَعْلُومٍ وَوَزْنٍ مَعْلُومٍ إِلَى أَجَلٍ مَعْلُومٍ ‏\"‏ ‏.‏",
    "malay_translation": "Ketika Rasulullah SAW tiba di Madinah, mereka seringkali membayar tembikai dalam tempoh dua atau tiga tahun lebih awal. Baginda SAW bersabda, \"Barangsiapa yang ingin membayar tembikai secara ansuran, hendaklah ia membayar dengan kuantiti atau berat yang diketahui, dan pada masa yang ditentukan.\" "
  },
  {
    "id": 31848,
    "hadith_number": 2015,
    "tajuk_hadith": "Menguruskan Kebajikan Kaum Yahudi Yang memeluk Islam",
    "perawi_melayu": "Muhammad bin Hamzah bin Yusuf bin 'Abdullah bin Salam, dari bapanya, daripada datuknya 'Abdullah bin Salam berkata:",
    "english_text": "\"A man came to the Prophet (ﷺ) and said, 'The tribe of Banu so-and- so, who were descended from the Jews, have become Muslim, and they are starving, and I am afraid that they may apostatize.' The Prophet (ﷺ) said:  'Who has something with him?' A Jewish man said: 'I have such and such, and he named it, and I think he said three hundred Dinar for such and such 'an amount (of produce) from the garden of the tribe of Banu so-and-so.' The Messenger of Allah (ﷺ) said: 'For such and such a price at such and such a time, but not from the garden of the tribe of Banu so-and- so.\"",
    "arabic_text": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنْ مُحَمَّدِ بْنِ حَمْزَةَ بْنِ يُوسُفَ بْنِ عَبْدِ اللَّهِ بْنِ سَلاَمٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ عَبْدِ اللَّهِ بْنِ سَلاَمٍ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ فَقَالَ إِنَّ بَنِي فُلاَنٍ أَسْلَمُوا - لِقَوْمٍ مِنَ الْيَهُودِ - وَإِنَّهُمْ قَدْ جَاعُوا فَأَخَافُ أَنْ يَرْتَدُّوا ‏.‏ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ مَنْ عِنْدَهُ ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ مِنَ الْيَهُودِ عِنْدِي كَذَا وَكَذَا - لِشَىْءٍ قَدْ سَمَّاهُ أُرَاهُ قَالَ ثَلاَثُمِائَةِ دِينَارٍ بِسِعْرِ كَذَا وَكَذَا مِنْ حَائِطِ بَنِي فُلاَنٍ ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ بِسِعْرِ كَذَا وَكَذَا إِلَى أَجَلِ كَذَا وَكَذَا وَلَيْسَ مِنْ حَائِطِ بَنِي فُلاَنٍ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki datang menemui Nabi SAW dan berkata, 'Kaum Bani Fulanan, yang berasal daripada kaum Yahudi, telah memeluk Islam, dan mereka sedang kelaparan, dan aku takut mereka akan murtad.' Nabi SAW bertanya, 'Siapakah yang mempunyai sesuatu?' Seorang lelaki Yahudi berkata, 'Aku mempunyai ini dan itu -  ia telah menyebut sesuatu, dan saya rasa dia berkata tiga ratus dinar untuk sekian banyak hasil daripada kebun Bani Fulanan.' Rasulullah SAW bersabda, 'Dengan harga ini dan itu, hingga ke tempoh ini dan itu, tetapi bukan daripada kebun Bani Fulanan.'"
  },
  {
    "id": 31849,
    "hadith_number": 2016,
    "tajuk_hadith": "Perselisihan tentang Bayaran Tunai pada Zaman Rasulullah SAW",
    "perawi_melayu": "Dikisahkan oleh Abu Mujalid, bahawa...",
    "english_text": "\"Abdullah bin Shaddad and Abu Barzah had a dispute about paying in advance. They sent me to 'Abdullah bin Abu Awfa to ask him about it. He said: 'We used to make payments in advance at the time of the Messenger of Allah (ﷺ) and the time of Abu Bakr and 'Umar, for wheat, barley, raisins and dates, to people who did not yet possess those things.' I asked Ibn Abza, and he said something similar.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالاَ حَدَّثَنَا شُعْبَةُ، - قَالَ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ أَبِي الْمُجَالِدِ، وَقَالَ عَبْدُ الرَّحْمَنِ، عَنِ ابْنِ أَبِي الْمُجَالِدِ، - قَالَ امْتَرَى عَبْدُ اللَّهِ بْنُ شَدَّادٍ وَأَبُو بُرْدَةَ فِي السَّلَمِ فَأَرْسَلُونِي إِلَى عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى فَسَأَلْتُهُ فَقَالَ كُنَّا نُسْلِمُ عَلَى عَهْدِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَعَهْدِ أَبِي بَكْرٍ وَعُمَرَ فِي الْحِنْطَةِ وَالشَّعِيرِ وَالزَّبِيبِ وَالتَّمْرِ عِنْدَ قَوْمٍ مَا عِنْدَهُمْ ‏.‏ \n فَسَأَلْتُ ابْنَ أَبْزَى فَقَالَ مِثْلَ ذَلِكَ ‏.‏",
    "malay_translation": "Terdapat perselisihan antara Abdullah bin Shaddad dan Abu Barzah mengenai pembayaran tunai. Mereka menghantar saya kepada Abdullah bin Abu Awfa untuk menanyakan perkara tersebut. Beliau berkata: 'Kami biasa membuat pembayaran tunai pada zaman Rasulullah SAW dan zaman Abu Bakar serta Umar untuk gandum, barli, kismis dan kurma, kepada orang yang belum memiliki barang-barang tersebut.' Kemudian, saya bertanya kepada Ibn Abza, dan beliau berkata demikian juga."
  },
  {
    "id": 31850,
    "hadith_number": 2017,
    "tajuk_hadith": "Larangan Menukar Barang yang Sudah Diperolehi Secara Bayaran Awal",
    "perawi_melayu": "Daripada Abu Sa'id, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"When you have paid in advance for something, do not exchange it for something else.\" (Da'if)Another chain with similar wording.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا شُجَاعُ بْنُ الْوَلِيدِ، حَدَّثَنَا زِيَادُ بْنُ خَيْثَمَةَ، عَنْ سَعْدٍ، عَنْ عَطِيَّةَ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِذَا أَسْلَفْتَ فِي شَىْءٍ فَلاَ تَصْرِفْهُ إِلَى غَيْرِهِ ‏\"‏ ‏.‏ \n حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا شُجَاعُ بْنُ الْوَلِيدِ، عَنْ زِيَادِ بْنِ خَيْثَمَةَ، عَنْ عَطِيَّةَ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَذَكَرَ مِثْلَهُ وَلَمْ يَذْكُرْ سَعْدًا ‏.‏",
    "malay_translation": "Telah diriwayatkan daripada Abu Sa'id bahawa Rasulullah SAW bersabda, \"Jika kamu telah membayar sesuatu secara ansuran, janganlah kamu menukarnya dengan sesuatu yang lain.\" (Da'if)  Terdapat juga riwayat yang serupa dengannya."
  },
  {
    "id": 31851,
    "hadith_number": 2018,
    "tajuk_hadith": "Larangan Menjual/Membeli Kelapa Sawit sebelum Berbuah",
    "perawi_melayu": "Dikisahkan oleh Najrani, bahawa...",
    "english_text": "\"I said to 'Abdullah bin 'Umar: 'Can I pay in advance for a date palm before it bears fruit?' He said: 'No.' I said: 'Why not?' He said: 'A man paid in advance for a grove of trees during the time of the Messenger of Allah (ﷺ), before they had produced any fruit, and they did not bear anything that year. The purchaser said: 'They belong to me until they produce but the seller said: 'I only sold the trees to you for this year! They referred their dispute to the Messenger of Allah who said to the seller: 'Did he take anything from your date palms?' He said: 'No.' He said: 'Then why do you regard his wealth as lawful for You? Give back what you took from him, and do not take payment in advance for date palms until their usefulness appears.\"'",
    "arabic_text": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، عَنِ النَّجْرَانِيِّ، قَالَ قُلْتُ لِعَبْدِ اللَّهِ بْنِ عُمَرَ أُسْلِمُ فِي نَخْلٍ قَبْلَ أَنْ يُطْلِعَ قَالَ لاَ ‏.‏ قُلْتُ لِمَ قَالَ إِنَّ رَجُلاً أَسْلَمَ فِي حَدِيقَةِ نَخْلٍ فِي عَهْدِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَبْلَ أَنْ يُطْلِعَ النَّخْلُ فَلَمْ يُطْلِعِ النَّخْلُ شَيْئًا ذَلِكَ الْعَامَ فَقَالَ الْمُشْتَرِي هُوَ لِي حَتَّى يُطْلِعَ ‏.‏ وَقَالَ الْبَائِعُ إِنَّمَا بِعْتُكَ النَّخْلَ هَذِهِ السَّنَةَ ‏.‏ فَاخْتَصَمَا إِلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ لِلْبَائِعِ ‏\"‏ أَخَذَ مِنْ نَخْلِكَ شَيْئًا ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَبِمَ تَسْتَحِلُّ مَالَهُ ارْدُدْ عَلَيْهِ مَا أَخَذْتَ مِنْهُ وَلاَ تُسْلِمُوا فِي نَخْلٍ حَتَّى يَبْدُوَ صَلاَحُهُ ‏\"‏ ‏.‏",
    "malay_translation": "Dikisahkan oleh Najrani, bahawa beliau pernah bertanya kepada Abdullah bin 'Umar, \"Bolehkah saya membayar terlebih dahulu untuk sepohon tamar sebelum ia berbuah?\" Abdullah bin 'Umar menjawab, \"Tidak.\" Saya bertanya lagi, \"Mengapa?\" Beliau menjawab, \"Seseorang pernah membayar terlebih dahulu untuk sebidang kebun tamar pada zaman Rasulullah SAW, sebelum pohon-pohon itu berbuah. Dan pada tahun itu, pohon-pohon tersebut tidak berbuah sama sekali. Pembeli berkata, 'Pohon-pohon itu milik saya sehingga berbuah,' manakala penjual berkata, 'Saya hanya menjual pohon-pohon itu untuk tahun ini.' Mereka membawa perselisihan mereka kepada Rasulullah SAW, lalu baginda bertanya kepada penjual, 'Adakah dia mengambil sesuatu dari pohon tamarmu?' Penjual menjawab, 'Tidak.' Baginda bersabda, 'Maka dengan apa engkau halalkan hartanya? Kembalikan apa yang telah kau ambil daripadanya, dan janganlah engkau menjual atau membeli pohon tamar sehingga kebaikannya nyata (sedia berbuah).\""
  },
  {
    "id": 31852,
    "hadith_number": 2019,
    "tajuk_hadith": "Menunaikan Janji dan Keutamaan Pemulangan Hutang",
    "perawi_melayu": "Diceritakan oleh Abu Rafi':",
    "english_text": "the Prophet (ﷺ) asked a man to give as a loan a young camel and said: “When the camels of the Sadaqah come, we will pay you back.” When the camels came, he said: \" O Abu Rafi', pay this man back for his Young camel.\" But all I could find was a seven-year-old camel or that which is better. I told the Prophet  (ﷺ) and he said: \"Give it to him, for the best of People are those who are best in repaying.\"",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا مُسْلِمُ بْنُ خَالِدٍ، حَدَّثَنَا زَيْدُ بْنُ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي رَافِعٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ اسْتَسْلَفَ مِنْ رَجُلٍ بَكْرًا وَقَالَ ‏\"‏ إِذَا جَاءَتْ إِبِلُ الصَّدَقَةِ قَضَيْنَاكَ ‏\"‏ ‏.‏ فَلَمَّا قَدِمَتْ قَالَ ‏\"‏ يَا أَبَا رَافِعٍ اقْضِ هَذَا الرَّجُلَ بَكْرَهُ ‏\"‏ ‏.‏ فَلَمْ أَجِدْ إِلاَّ رَبَاعِيًا فَصَاعِدًا فَأَخْبَرْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\"‏ أَعْطِهِ فَإِنَّ خَيْرَ النَّاسِ أَحْسَنُهُمْ قَضَاءً ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW meminta seorang lelaki meminjamkan seekor unta muda dan bersabda, \"Apabila unta-unta sedekah datang, kami akan membayar balik kepadamu.\"  Apabila unta-unta tersebut tiba, baginda bersabda, \"Wahai Abu Rafi', bayar kembali unta lelaki ini.\" Namun, yang aku dapati hanyalah seekor unta berusia tujuh tahun atau yang lebih baik darinya.  Aku memberitahu Rasulullah SAW dan baginda bersabda, \"Berikan kepadanya. Sesungguhnya sebaik-baik manusia ialah mereka yang terbaik dalam menunaikan janji dan hutang."
  },
  {
    "id": 31853,
    "hadith_number": 2020,
    "tajuk_hadith": "Keutamaan Orang yang Jujur dalam Pembayaran Hutang",
    "perawi_melayu": "Sa'eed bin Hani' berkata:",
    "english_text": "\"I heard 'Irbad bin Sariyah say: 'I was with the Prophet (ﷺ) and a Bedouin said: \"Pay me back for my young camel, and he gave him an older (i.e., better) camel.\" He said: 'O Messenger of Allah! It is older (i.e., better) than my camel.' The Messenger of Allah (ﷺ) said: 'The best of people are those who are best in repaying.\"'",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ، حَدَّثَنِي سَعِيدُ بْنُ هَانِئٍ، قَالَ سَمِعْتُ الْعِرْبَاضَ بْنَ سَارِيَةَ، يَقُولُ كُنْتُ عِنْدَ النَّبِيِّ ـ صلى الله عليه وسلم ـ فَقَالَ أَعْرَابِيٌّ اقْضِنِي بَكْرِي ‏.‏ فَأَعْطَاهُ بَعِيرًا مُسِنًّا فَقَالَ الأَعْرَابِيُّ يَا رَسُولَ اللَّهِ هَذَا أَسَنُّ مِنْ بَعِيرِي ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ خَيْرُ النَّاسِ خَيْرُهُمْ قَضَاءً ‏\"‏ ‏.‏",
    "malay_translation": "Saya mendengar 'Irbad bin Sariyah berkata, 'Aku pernah bersama Nabi SAW. Seorang pengembara Badwi berkata, \"Bayarlah hutangku atas unta mudaku,\" dan Nabi memberi dia seekor unta yang lebih tua (iaitu lebih baik).  Lalu pengembara itu berkata, \"Wahai Rasulullah, unta ini lebih tua daripada untaku.\"  Rasulullah SAW bersabda, \"Sebaik-baik manusia ialah sebaik-baik mereka dalam menyelesaikan hutang.\""
  },
  {
    "id": 31854,
    "hadith_number": 2021,
    "tajuk_hadith": "Keperluan Kerjasama dan Kesopanan dalam Zaman Jahiliah",
    "perawi_melayu": "Diceritakan oleh Sa'ib kepada Nabi SAW bahawa:",
    "english_text": "\"You were my partner during the Ignorance period and you were the best of partners, you did not contend or dispute.\"",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ، وَأَبُو بَكْرٍ ابْنَا أَبِي شَيْبَةَ قَالاَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ، عَنْ مُجَاهِدٍ، عَنْ قَائِدِ السَّائِبِ، عَنِ السَّائِبِ، قَالَ لِلنَّبِيِّ ـ صلى الله عليه وسلم ـ كُنْتَ شَرِيكِي فِي الْجَاهِلِيَّةِ فَكُنْتَ خَيْرَ شَرِيكٍ كُنْتَ لاَ تُدَارِينِي وَكُنْتَ لاَ تُمَارِينِي ‏.‏",
    "malay_translation": "“Engkau pernah menjadi rakan sepertimiku dalam zaman Jahiliah dan engkau adalah rakan terbaik. Engkau tidak pernah bertengkar atau berbantah denganku.”"
  },
  {
    "id": 31855,
    "hadith_number": 2022,
    "tajuk_hadith": "Perkongsian Harta Rampasan Perang Badar",
    "perawi_melayu": "Dikisahkan oleh 'Abdullah bin 'Abdul-Mutthalib berkata:",
    "english_text": "\"Sa'd, 'Ammar dan aku telah bekerjasama pada hari Badar, (bersetuju untuk berkongsi) apa sahaja yang diperuntukkan kepada kita. 'Ammar dan aku tidak menerima apa-apa, tetapi Sa'd mendapat dua orang hamba.\"",
    "arabic_text": "حَدَّثَنَا أَبُو السَّائِبِ، سَلْمُ بْنُ جُنَادَةَ حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ، عَنْ سُفْيَانَ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي عُبَيْدَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ اشْتَرَكْتُ أَنَا وَسَعْدٌ، وَعَمَّارٌ، يَوْمَ بَدْرٍ فِيمَا نُصِيبُ فَلَمْ أَجِئْ أَنَا وَلاَ عَمَّارٌ بِشَىْءٍ وَجَاءَ سَعْدٌ بِرَجُلَيْنِ ‏.‏",
    "malay_translation": "Telah diceritakan bahawa 'Abdullah berkata, \"Aku, Sa'd, dan 'Ammar telah berkongsi harta rampasan perang pada hari Badar. Aku dan 'Ammar tidak mendapat apa-apa, tetapi Sa'd memperoleh dua orang hamba.\""
  },
  {
    "id": 31856,
    "hadith_number": 2023,
    "tajuk_hadith": "Ketiga perkara yang membawa keberkatan",
    "perawi_melayu": "Dikisahkan oleh Salih bin Suhaib daripada bapanya berkata:",
    "english_text": "\"The Messenger of Allah (ﷺ) said: 'There are three things in which there is blessing: A sale with deferred payment; Muqaradhah (profit sharing); and mixing wheat with barley for one's house, but not for sale.\"'",
    "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، حَدَّثَنَا بِشْرُ بْنُ ثَابِتٍ الْبَزَّارُ، حَدَّثَنَا نَصْرُ بْنُ الْقَاسِمِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ دَاوُدَ، عَنْ صَالِحِ بْنِ صُهَيْبٍ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ ثَلاَثٌ فِيهِنَّ الْبَرَكَةُ الْبَيْعُ إِلَى أَجَلٍ وَالْمُقَارَضَةُ وَإِخْلاَطُ الْبُرِّ بِالشَّعِيرِ لِلْبَيْتِ لاَ لِلْبَيْعِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Terdapat tiga perkara yang membawa keberkatan: jual beli secara ansuran, muqaradah (perkongsian keuntungan), dan mencampurkan gandum dengan barli untuk kegunaan rumah, tetapi bukan untuk dijual."
  },
  {
    "id": 31857,
    "hadith_number": 2024,
    "tajuk_hadith": "Keutamaan Rezeki Usaha Sendiri dan Anak-Anak sebagai Sebagian Rezeki",
    "perawi_melayu": "Dikisahkan oleh 'Aisyah رضي الله عنها, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"The best of your provision is what you earn, and your children are part of what you earn. \"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، عَنِ الأَعْمَشِ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ عَمَّتِهِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِنَّ أَطْيَبَ مَا أَكَلْتُمْ مِنْ كَسْبِكُمْ وَإِنَّ أَوْلاَدَكُمْ مِنْ كَسْبِكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "\"Sesungguhnya sebaik-baik rezeki yang kamu makan ialah hasil usaha kamu sendiri, dan anak-anak kamu adalah sebahagian daripada rezeki kamu.\" (Hadis Riwayat...)"
  },
  {
    "id": 31858,
    "hadith_number": 2025,
    "tajuk_hadith": "Hakikat Warisan dan Kewajipan Kepada Ibu Bapa",
    "perawi_melayu": "Daripada Jabir bin Abdullah, bahawa seorang lelaki berkata:",
    "english_text": "\"O Messenger of Allah, I have wealth and a son, and my father wants to take all my wealth.\" He said: \"You and your wealth belong to your father.\"",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا يُوسُفُ بْنُ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَجُلاً، قَالَ يَا رَسُولَ اللَّهِ إِنَّ لِي مَالاً وَوَلَدًا وَإِنَّ أَبِي يُرِيدُ أَنْ يَجْتَاحَ مَالِي فَقَالَ ‏\n\"‏ أَنْتَ وَمَالُكَ لأَبِيكَ ‏\"‏ ‏.‏",
    "malay_translation": "“Wahai Rasulullah, aku mempunyai harta dan anak, dan bapaku ingin mengambil semua hartanya.” Baginda bersabda: “Engkau dan hartamu kepunyaan bapamu.”"
  },
  {
    "id": 31859,
    "hadith_number": 2026,
    "tajuk_hadith": "Keputusan Mengenai Harta Pusaka dan Anak",
    "perawi_melayu": "Dikisahkan oleh 'Amr bin Shu'aib daripada bapanya, daripada datuknya, bahawa:",
    "english_text": "\"A man came to the Messenger of Allah (ﷺ), and said: 'My father is taking all my wealth.' He said: 'You and your wealth belong to your father.' And the Messenger of Allah (ﷺ) said: 'Your children are among the best of your earnings, so eat from your wealth.’\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، وَيَحْيَى بْنُ حَكِيمٍ، قَالاَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا حَجَّاجٌ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ فَقَالَ إِنَّ أَبِي اجْتَاحَ مَالِي ‏.‏ فَقَالَ ‏\"‏ أَنْتَ وَمَالُكَ لأَبِيكَ ‏\"‏ ‏.‏ وَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِنَّ أَوْلاَدَكُمْ مِنْ أَطْيَبِ كَسْبِكُمْ فَكُلُوا مِنْ أَمْوَالِهِمْ ‏\"‏ ‏.‏",
    "malay_translation": "Seorang lelaki datang menemui Rasulullah SAW, dan berkata, 'Bapa saya mengambil semua harta saya.' Baginda bersabda, 'Engkau dan hartamu kepunyaan bapamu.'  Kemudian Rasulullah SAW bersabda, 'Anak-anak kamu adalah di antara hasil usahamu yang terbaik, maka makanlah dari harta mereka.'"
  },
  {
    "id": 31860,
    "hadith_number": 2027,
    "tajuk_hadith": "Panduan Mengurus Keperluan Keluarga dalam Keadaan Kewangan Terhad",
    "perawi_melayu": "'Aisyah berkata:",
    "english_text": "'Hind came to the Prophet (ﷺ) and said: 'O Messenger of Allah, Abu Sufyan is a stingy man and he does not give me enough for me and my child, except for what I take from his wealth without him realizing.' He said: Take what is sufficient for you and your child, on a reasonable basis.'",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، وَأَبُو عُمَرَ الضَّرِيرُ قَالُوا حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ جَاءَتْ هِنْدٌ إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أَبَا سُفْيَانَ رَجُلٌ شَحِيحٌ وَلاَ يُعْطِينِي مَا يَكْفِينِي وَوَلَدِي إِلاَّ مَا أَخَذْتُ مِنْ مَالِهِ وَهُوَ لاَ يَعْلَمُ ‏.‏ فَقَالَ ‏\n\"‏ خُذِي مَا يَكْفِيكِ وَوَلَدَكِ بِالْمَعْرُوفِ ‏\"‏ ‏.‏",
    "malay_translation": "'Hind datang kepada Rasulullah SAW dan berkata, \"Wahai Rasulullah, Abu Sufyan seorang yang kikir dan tidak memberi nafkah cukup untukku dan anakku melainkan apa yang aku ambil dari hartanya tanpa sepengetahuannya.\" Baginda SAW bersabda, \"Ambillah apa yang mencukupimu dan anakmu dengan cara yang ma'ruf (patut).\" "
  },
  {
    "id": 31861,
    "hadith_number": 2028,
    "tajuk_hadith": "Ganjaran Wanita dan Lelaki yang Bersedekah dan Peniaga yang Beramal Baik",
    "perawi_melayu": "Diceritakan oleh 'Aishah r.a. bahawa Rasulullah SAW bersabda:",
    "english_text": "\"When a woman spends\" and my father said: - \"When a woman feeds (the poor) from her husband's house, without spending too much, she will have her reward, and he will be rewarded likewise because he earned it , and she will be rewarded for what she spent. The same applies to the storekeeper, without anything being detracted from their rewards.”",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي وَأَبُو مُعَاوِيَةَ عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِذَا أَنْفَقَتِ الْمَرْأَةُ - وَقَالَ أَبِي فِي حَدِيثِهِ إِذَا أَطْعَمَتِ الْمَرْأَةُ - مِنْ بَيْتِ زَوْجِهَا غَيْرَ مُفْسِدَةٍ كَانَ لَهَا أَجْرُهَا وَلَهُ مِثْلُهُ بِمَا اكْتَسَبَ وَلَهَا بِمَا أَنْفَقَتْ وَلِلْخَازِنِ مِثْلُ ذَلِكَ مِنْ غَيْرِ أَنْ يَنْقُصَ مِنْ أُجُوِرِهِمْ شَيْئًا ‏\"‏ ‏.‏",
    "malay_translation": "Apabila seorang wanita berbelanja - dan ayahku berkata: - \"Apabila seorang wanita memberi makan (kepada orang miskin) daripada harta suaminya, tanpa membazir, dia akan mendapat pahalanya, dan suaminya akan mendapat pahala yang sama atas usahanya, dan dia akan mendapat pahala atas apa yang dibelanjakannya. Begitu juga dengan peniaga, tanpa mengurangkan pahala mereka."
  },
  {
    "id": 31862,
    "hadith_number": 2029,
    "tajuk_hadith": "Larangan Wanita Mengeluarkan Harta Tanpa Keizinan Suami",
    "perawi_melayu": "Shurahbil bin Muslim Al-Khawlani berkata:",
    "english_text": "I heard Abu Umamah Al-Bahili say: I heard the Messenger of Allah (ﷺ) say: \" No woman should spend anything from her house without her husband's permission.\" They said: \"O Messenger of Allah, not even food?\" He said: \"That is among the best of our wealth.\"",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، حَدَّثَنِي شُرَحْبِيلُ بْنُ مُسْلِمٍ الْخَوْلاَنِيُّ، قَالَ سَمِعْتُ أَبَا أُمَامَةَ الْبَاهِلِيَّ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ لاَ تُنْفِقُ الْمَرْأَةُ مِنْ بَيْتِهَا شَيْئًا إِلاَّ بِإِذْنِ زَوْجِهَا ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَلاَ الطَّعَامَ قَالَ ‏\"‏ ذَلِكَ أَفْضَلُ أَمْوَالِنَا ‏\"‏ ‏.‏",
    "malay_translation": "Saya mendengar Abu Umamah Al-Bahili berkata: Saya mendengar Rasulullah SAW bersabda: \"Wanita tidak boleh membelanjakan sesuatu daripada rumahnya tanpa izin suaminya.\" Mereka bertanya: \"Wahai Rasulullah, termasuk makanan juga kah?\" Baginda menjawab: \"Itu termasuk di antara harta yang paling baik bagi kita.\""
  },
  {
    "id": 31863,
    "hadith_number": 2030,
    "tajuk_hadith": "Rasulullah SAW Menerima Jemputan Hamba",
    "perawi_melayu": "Dikisahkan oleh Muslim Al-Mula'i bahawa beliau mendengar Anas bin Malik berkata:",
    "english_text": "\"The Messenger of Allah (ﷺ) used to accept the invitation of a slave.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا سُفْيَانُ، ح وَحَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، حَدَّثَنَا جَرِيرٌ، عَنْ مُسْلِمٍ الْمُلاَئِيِّ، سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يُجِيبُ دَعْوَةَ الْمَمْلُوكِ ‏.‏",
    "malay_translation": "Nabi SAW biasanya akan menerima jemputan hamba."
  },
  {
    "id": 31864,
    "hadith_number": 2031,
    "tajuk_hadith": "Ganjaran Bagi Pemberian dan Penolakan",
    "perawi_melayu": "'Umair, bekas hamba sahaya Aabi Lahm, meriwayatkan:",
    "english_text": "\"My master used to give me food and I would feed others from it, then he stopped me,\" or he said: \"He beat me. So I asked the Prophet,” -or- \"he asked him and I said: 'I will not stop.' He said: 'Both of you will be rewarded.\"'",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ مُحَمَّدِ بْنِ زَيْدٍ، عَنْ عُمَيْرٍ، - مَوْلَى آبِي اللَّحْمِ - قَالَ كَانَ مَوْلاَىَ يُعْطِينِي الشَّىْءَ فَأُطْعِمُ مِنْهُ فَمَنَعَنِي - أَوْ قَالَ فَضَرَبَنِي - فَسَأَلْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ أَوْ سَأَلَهُ فَقُلْتُ لاَ أَنْتَهِي أَوْ لاَ أَدَعُهُ ‏.‏ فَقَالَ ‏\n\"‏ الأَجْرُ بَيْنَكُمَا ‏\"‏ ‏.‏",
    "malay_translation": "“Tuan saya dahulu memberi makanan kepada saya, dan saya memberi makan kepada orang lain daripadanya, kemudian dia menghentikan saya,” atau dia berkata, “Dia memukul saya. Maka saya bertanya kepada Nabi,” atau “dia bertanya kepadanya, dan saya berkata: 'Saya tidak akan berhenti.' Dia berkata: 'Kedua-duanya akan diberi ganjaran.' ”"
  },
  {
    "id": 31865,
    "hadith_number": 2032,
    "tajuk_hadith": "Kisah Menguruskan Kebuluran dan Keadaan Orang Kelaparan",
    "perawi_melayu": "Diceritakan oleh Abu Bishr Ja'far bin Iyas",
    "english_text": "“I heard 'Abbad bin Shurahbil, a man from Banu Ghubar, say: ‘We suffered a year of famine, and I came to Al-Madinah. I came to one of its gardens and took an ear of corn, I rubbed it, ate some and put the rest in my garment. The owner of the garden came and beat me and took my garment. I came to the Prophet (ﷺ) and told him (what had happened). He said to the man: \"You did not feed him when he was hungry and you did not teach him when he was ignorant.\"' Then the Prophet (ﷺ) told him to give back his garment and ordered that a Wasq or half a Wasq of food be brought to him.\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَمُحَمَّدُ بْنُ الْوَلِيدِ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، جَعْفَرِ بْنِ إِيَاسٍ قَالَ سَمِعْتُ عَبَّادَ بْنَ شُرَحْبِيلَ، - رَجُلاً مِنْ بَنِي غُبَرَ - قَالَ أَصَابَنَا عَامُ مَخْمَصَةٍ فَأَتَيْتُ الْمَدِينَةَ فَأَتَيْتُ حَائِطًا مِنْ حِيطَانِهَا فَأَخَذْتُ سُنْبُلاً فَفَرَكْتُهُ وَأَكَلْتُهُ وَجَعَلْتُهُ فِي كِسَائِي فَجَاءَ صَاحِبُ الْحَائِطِ فَضَرَبَنِي وَأَخَذَ ثَوْبِي فَأَتَيْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَأَخْبَرْتُهُ فَقَالَ لِلرَّجُلِ ‏\n\"‏ مَا أَطْعَمْتَهُ إِذْ كَانَ جَائِعًا أَوْ سَاغِبًا وَلاَ عَلَّمْتَهُ إِذْ كَانَ جَاهِلاً ‏\"‏ ‏.‏ فَأَمَرَهُ النَّبِيُّ ـ صلى الله عليه وسلم ـ فَرَدَّ إِلَيْهِ ثَوْبَهُ وَأَمَرَ لَهُ بِوَسْقٍ مِنْ طَعَامٍ أَوْ نِصْفِ وَسْقٍ ‏.‏",
    "malay_translation": "Diceritakan bahawa Abu Bishr Ja'far bin Iyas mendengar 'Abbad bin Shurahbil, seorang lelaki daripada Bani Ghubar, berkata: 'Kami dilanda tahun kemarau yang teruk. Kemudian, aku pergi ke Madinah. Aku pergi ke salah satu kebun di sana, mengambil sebutir jagung, menggosoknya, memakan sedikit, dan meletakkannya dalam pakaianku. Kemudian, pemilik kebun datang, memukulku dan mengambil pakaianku. Aku datang kepada Nabi SAW dan menceritakan kejadian itu kepadanya. Baginda bersabda kepada lelaki itu: \"Mengapa engkau tidak memberi makan kepadanya ketika dia lapar dan tidak mendidiknya ketika dia jahil?\" Kemudian Nabi SAW memerintahkan lelaki itu mengembalikan pakaiannya dan memerintahkan agar diberi satu Wasq atau separuh Wasq makanan kepadanya."
  },
  {
    "id": 31866,
    "hadith_number": 2033,
    "tajuk_hadith": "Larangan Membuang Batu ke Pokok Kurma dan Kepentingan Bersedekah",
    "perawi_melayu": "Dikisahkan oleh Rafi' bin 'Amr Al-Ghifari berkata:",
    "english_text": "\"When I was a boy, I used to throw stones at our date-palm trees\" - or he said: \"the date-palm trees of the Ansar.\" I was brought to the Prophet (ﷺ) and he said: 'O boy' - (one of the narrators) Ibn Kasib said: He said: 'O my son - why are you throwing stones at the date-palm trees?' I said: 'So I can eat.' He said: 'Do not throw stones at the date-palm trees. Eat from what falls to the ground from them.' Then he patted me on the head and said: 'O Allah give him enough to eat.'",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، وَيَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، قَالاَ حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ سَمِعْتُ ابْنَ أَبِي الْحَكَمِ الْغِفَارِيَّ، قَالَ حَدَّثَتْنِي جَدَّتِي، عَنْ عَمِّ، أَبِيهَا رَافِعِ بْنِ عَمْرٍو الْغِفَارِيِّ قَالَ كُنْتُ وَأَنَا غُلاَمٌ، أَرْمِي نَخْلَنَا - أَوْ قَالَ نَخْلَ الأَنْصَارِ - فَأُتِيَ بِيَ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\"‏ يَا غُلاَمُ - وَقَالَ ابْنُ كَاسِبٍ فَقَالَ يَا بُنَىَّ - لِمَ تَرْمِي النَّخْلَ ‏\"‏ ‏.‏ قَالَ قُلْتُ آكُلُ ‏.‏ قَالَ ‏\"‏ فَلاَ تَرْمِي النَّخْلَ وَكُلْ مِمَّا يَسْقُطُ فِي أَسَافِلِهَا ‏\"‏ ‏.‏ قَالَ ثُمَّ مَسَحَ رَأْسِي وَقَالَ ‏\"‏ اللَّهُمَّ أَشْبِعْ بَطْنَهُ ‏\"‏ ‏.‏",
    "malay_translation": "Ketika kecil, saya suka membuang batu ke pokok kurma kita – atau dikatakan pokok kurma Ansar.  Lalu saya dibawa kepada Nabi saw. Baginda bertanya, \"Wahai anak muda, mengapa engkau membuang batu ke pokok kurma?\" Saya menjawab, \"Supaya aku dapat makan.\" Baginda bersabda, \"Jangan membuang batu ke pokok kurma. Makanlah daripada buah yang gugur dari pokok tersebut.\" Kemudian Baginda mengusap kepala saya dan berdoa, \"Ya Allah, berikanlah dia rezeki yang cukup.\" "
  },
  {
    "id": 31867,
    "hadith_number": 2034,
    "tajuk_hadith": "Panduan Mengambil Dari Haiwan Ternakan dan Tanaman",
    "perawi_melayu": "Diriwayatkan daripada Abu Sa'id bahawa Nabi SAW bersabda:",
    "english_text": "\"When you come to a shepherd, call him three times. If he answers (all well and good), otherwise drink (milk from the flock) without taking advantage. And when you come to a garden call the owner of the garden three times. If he answers (all well and good), otherwise eat (from the produce of the garden) without taking advantage.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا الْجُرَيْرِيُّ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ إِذَا أَتَيْتَ عَلَى رَاعٍ فَنَادِهِ ثَلاَثَ مِرَارٍ فَإِنْ أَجَابَكَ وَإِلاَّ فَاشْرَبْ فِي غَيْرِ أَنْ تُفْسِدَ وَإِذَا أَتَيْتَ عَلَى حَائِطِ بُسْتَانٍ فَنَادِ صَاحِبَ الْبُسْتَانِ ثَلاَثَ مَرَّاتٍ فَإِنْ أَجَابَكَ وَإِلاَّ فَكُلْ فِي أَنْ لاَ تُفْسِدَ ‏\"‏ ‏.‏",
    "malay_translation": "Apabila kamu sampai kepada seorang penggembala, panggil dia tiga kali. Jika dia menjawab (maka baiklah), jika tidak, minum (susu daripada kawanan ternakan) tanpa mengambil kesempatan yang berlebihan. Dan apabila kamu sampai kepada kebun, panggil pemilik kebun tiga kali. Jika dia menjawab (maka baiklah), jika tidak, makan (daripada hasil kebun) tanpa melakukan kerosakan."
  },
  {
    "id": 31868,
    "hadith_number": 2035,
    "tajuk_hadith": "Mengambil Manfaat Dari Taman Dengan Patutan",
    "perawi_melayu": "Daripada Ibn Umar bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Apabila sesiapa di antara kamu lalu di tepi kebun, maka hendaklah dia makan daripadanya, tetapi dia tidak sepatutnya mengambil apa-apa di dalam pakaiannya.\"",
    "arabic_text": "حَدَّثَنَا هَدِيَّةُ بْنُ عَبْدِ الْوَهَّابِ، وَأَيُّوبُ بْنُ حَسَّانَ الْوَاسِطِيُّ، وَعَلِيُّ بْنُ سَلَمَةَ، قَالُوا حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ الطَّائِفِيُّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِذَا مَرَّ أَحَدُكُمْ بِحَائِطٍ فَلْيَأْكُلْ وَلاَ يَتَّخِذْ خُبْنَةً ‏\"‏ ‏.‏",
    "malay_translation": "\"Apabila seseorang dari kamu lalu di sisi kebun, maka hendaklah dia makan daripadanya, tetapi janganlah dia mengambil apa-apa dari padanya untuk dibawa pergi.\" "
  },
  {
    "id": 31869,
    "hadith_number": 2036,
    "tajuk_hadith": "Larangan Menyemai Ternakan Orang Lain Tanpa Keizinan",
    "perawi_melayu": "Daripada Abdullah bin 'Umar, daripada Rasulullah SAW.",
    "english_text": "\"No one of you should milk from the livestock of another man without his permission. Would anyone of you like someone to break into his storeroom and take his food? The udders of their livestock store food for them, so none of you should milk the livestock of another man without his permission.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، قَالَ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ أَنَّهُ قَامَ فَقَالَ ‏\n\"‏ لاَ يَحْتَلِبَنَّ أَحَدُكُمْ مَاشِيَةَ رَجُلٍ بِغَيْرِ إِذْنِهِ أَيُحِبُّ أَحَدُكُمْ أَنْ تُؤْتَى مَشْرُبَتُهُ فَيُكْسَرَ بَابُ خِزَانَتِهِ فَيُنْتَثَلَ طَعَامُهُ فَإِنَّمَا تَخْزُنُ لَهُمْ ضُرُوعُ مَوَاشِيهِمْ أَطْعِمَاتِهِمْ فَلاَ يَحْتَلِبَنَّ أَحَدُكُمْ مَاشِيَةَ امْرِئٍ بِغَيْرِ إِذْنِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Janganlah sesiapa di antara kamu memerah susu ternakan seseorang tanpa izinnya. Adakah seseorang di antara kamu suka jika rumahnya dimasuki dan makanan diambil? Sesungguhnya, puting susu ternakan mereka menyimpan makanan untuk mereka. Oleh itu, janganlah sesiapa di antara kamu memerah susu ternakan seseorang tanpa izinnya.\""
  },
  {
    "id": 31870,
    "hadith_number": 2037,
    "tajuk_hadith": "Larangan Mengambil Makanan dan Minuman Orang Lain",
    "perawi_melayu": "Abu Hurairah berkata:",
    "english_text": "“While we were with the Messenger of Allah (ﷺ) on a journey, we saw some camels with their udders tied, among some thorny trees. We rushed towards it, but the Messenger of Allah (ﷺ) called us and we came back to him. He said: 'These camels belong to a family of Muslims, and this is their support (and blessing) after Allah. Would you be happy if you went back to your vessels and found that what was in them had been taken away? Do you think that is fair?' They said: 'No.' He said: 'This is like that.' We said: 'What do you think if we are in need of food and drink?' He said: 'Eat but do not carry any away: drink but do not carry any away.\"",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ بِشْرِ بْنِ مَنْصُورٍ، حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ، عَنْ حَجَّاجٍ، عَنْ سَلِيطِ بْنِ عَبْدِ اللَّهِ الطُّهَوِيِّ، عَنْ ذُهَيْلِ بْنِ عَوْفِ بْنِ شَمَّاخٍ الطُّهَوِيِّ، حَدَّثَنَا أَبُو هُرَيْرَةَ، قَالَ بَيْنَمَا نَحْنُ مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فِي سَفَرٍ إِذْ رَأَيْنَا إِبِلاً مَصْرُورَةً بِعِضَاهِ الشَّجَرِ فَثُبْنَا إِلَيْهَا فَنَادَانَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَرَجَعْنَا إِلَيْهِ فَقَالَ ‏\"‏ إِنَّ هَذِهِ الإِبِلَ لأَهْلِ بَيْتٍ مِنَ الْمُسْلِمِينَ هُوَ قُوتُهُمْ وَيُمْنُهُمْ بَعْدَ اللَّهِ أَيَسُرُّكُمْ لَوْ رَجَعْتُمْ إِلَى مَزَاوِدِكُمْ فَوَجَدْتُمْ مَا فِيهَا قَدْ ذُهِبَ بِهِ أَتُرَوْنَ ذَلِكَ عَدْلاً ‏\"‏ ‏.‏ قَالُوا لاَ ‏.‏ قَالَ ‏\"‏ فَإِنَّ هَذَا كَذَلِكَ ‏\"‏ ‏.‏ قُلْنَا أَفَرَأَيْتَ إِنِ احْتَجْنَا إِلَى الطَّعَامِ وَالشَّرَابِ فَقَالَ ‏\"‏ كُلْ وَلاَ تَحْمِلْ وَاشْرَبْ وَلاَ تَحْمِلْ ‏\"‏ ‏.‏",
    "malay_translation": "“Ketika kami bersama Rasulullah SAW dalam satu perjalanan, kami melihat beberapa ekor unta yang tali susunya terikat di antara beberapa pokok berduri. Kami bergegas ke arahnya, namun Rasulullah SAW memanggil kami dan kami kembali kepadanya. Baginda bersabda, 'Unta-unta ini kepunyaan sebuah keluarga Muslim, dan ini adalah rezeki dan keberkatan mereka setelah Allah. Adakah kalian gembira jika kembali ke bekal kalian dan mendapati bekal tersebut telah hilang? Adakah kalian anggap itu adil?' Mereka menjawab, 'Tidak.' Baginda bersabda, 'Begitulah.' Kami bertanya, 'Bagaimana jika kami memerlukan makanan dan minuman?' Baginda menjawab, 'Makanlah, tetapi jangan bawa pergi; minumlah, tetapi jangan bawa pergi.'”"
  },
  {
    "id": 31871,
    "hadith_number": 2038,
    "tajuk_hadith": "Keberkatan dalam Ternak Kambing",
    "perawi_melayu": "Daripada Umm Hani', Nabi SAW bersabda:",
    "english_text": "\"Keep sheep, for in them is blessing!'",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ أُمِّ هَانِئٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ لَهَا ‏\n\"‏ اتَّخِذِي غَنَمًا فَإِنَّ فِيهَا بَرَكَةً ‏\"‏ ‏.‏",
    "malay_translation": "“Peliharalah kambing, kerana di dalamnya terdapat keberkatan.”"
  },
  {
    "id": 31872,
    "hadith_number": 2039,
    "tajuk_hadith": "Keunggulan Unta, Berkat Kambing, dan Keistimewaan Kuda",
    "perawi_melayu": "'Urwah Al-Bariqi",
    "english_text": "\"Camels are the pride of their owners, and sheep are a blessing, and goodness is tied to the forelocks of horses until the Day of Resurrection.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ حُصَيْنٍ، عَنْ عَامِرٍ، عَنْ عُرْوَةَ الْبَارِقِيِّ، يَرْفَعُهُ قَالَ ‏\n\"‏ الإِبِلُ عِزٌّ لأَهْلِهَا وَالْغَنَمُ بَرَكَةٌ وَالْخَيْرُ مَعْقُودٌ فِي نَوَاصِي الْخَيْلِ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Unta merupakan kebanggaan bagi pemiliknya, dan kambing merupakan berkat, dan kebaikan terikat pada rambut kuda hingga Hari Kiamat."
  },
  {
    "id": 31873,
    "hadith_number": 2040,
    "tajuk_hadith": "Domba Di Antara Haiwan Syurga",
    "perawi_melayu": "Daripada Ibn Umar رضي الله عنه, bahawa Rasulullah SAW bersabda:",
    "english_text": "\"Sheep are among the animals of Paradise.\"'",
    "arabic_text": "حَدَّثَنَا عِصْمَةُ بْنُ الْفَضْلِ النَّيْسَابُورِيُّ، وَمُحَمَّدُ بْنُ فِرَاسٍ أَبُو هُرَيْرَةَ الصَّيْرَفِيُّ، قَالاَ حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ، حَدَّثَنَا زَرْبِيٌّ، إِمَامُ مَسْجِدِ هِشَامِ بْنِ حَسَّانَ حَدَّثَنَا مُحَمَّدُ بْنُ سِيرِينَ، عَنِ ابْنِ عُمَرَ، رضى الله عنه قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ الشَّاةُ مِنْ دَوَابِّ الْجَنَّةِ ‏\"‏ ‏.‏",
    "malay_translation": "“Domba-domba adalah antara haiwan di Syurga.”"
  },
  {
    "id": 31874,
    "hadith_number": 2041,
    "tajuk_hadith": "Larangan Menggemukkan Ayam bagi Orang Kaya dan Nasihat Rasulullah SAW Kepada Orang Miskin",
    "perawi_melayu": "Diceritakan oleh Abu Hurairah r.a. bahawa:",
    "english_text": "\"The Messenger of Allah (ﷺ) commanded the rich to keep sheep, and he commanded the poor to keep chickens, and he said: 'When the rich keep chickens, then Allah will give permission for the town to be destroyed.\"'",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عُثْمَانُ بْنُ عَبْدِ الرَّحْمَنِ، حَدَّثَنَا عَلِيُّ بْنُ عُرْوَةَ، عَنِ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، رضى الله عنه قَالَ أَمَرَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ الأَغْنِيَاءَ بِاتِّخَاذِ الْغَنَمِ وَأَمَرَ الْفُقَرَاءَ بِاتِّخَاذِ الدَّجَاجِ وَقَالَ ‏\n\"‏ عِنْدَ اتِّخَاذِ الأَغْنِيَاءِ الدَّجَاجَ يَأْذَنُ اللَّهُ بِهَلاَكِ الْقُرَى ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW memerintahkan orang kaya untuk memelihara kambing, dan beliau memerintahkan orang miskin untuk memelihara ayam.  Beliau bersabda, \"Apabila orang kaya memelihara ayam, maka Allah akan mengizinkan kehancuran kampung tersebut.\""
  }
]