[
  {
    "id": 33119,
    "hadith_number": 3286,
    "tajuk_hadith": "Nabi SAW Solat dalam Khamisah Berjalur",
    "perawi_melayu": "Saidatina 'Aishah R.A.",
    "english_text": "“The Messenger of Allah (ﷺ) prayed\nin a Khamisah* that had markings on it. Then he said: ‘These\nmarkings distracted me. Take it to Abu Jahm and bring me an\nAnbijaniyyah.’”**",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ صَلَّى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فِي خَمِيصَةٍ لَهَا أَعْلاَمٌ فَقَالَ ‏\n\"‏ شَغَلَنِي أَعْلاَمُ هَذِهِ اذْهَبُوا بِهَا إِلَى أَبِي جَهْمٍ وَائْتُونِي بِأَنْبِجَانِيَّتِهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah SAW solat di dalam Khamisah* yang mempunyai tanda. Kemudian baginda bersabda: 'Tanda-tanda ini telah mengganggu tumpuan aku. Bawa ia kepada Abu Jahm dan bawakan kepadaku Anbijaniyyah.’”**"
  },
  {
    "id": 33120,
    "hadith_number": 3287,
    "tajuk_hadith": "Rasulullah (ﷺ) Wafat dengan Memakai Pakaian Khas",
    "perawi_melayu": "Abu Burdah",
    "english_text": "“I entered upon ‘Aishah and she\nbrought out to me a thick waist wrap of the type made in Yemen, and\none of these cloaks that are called Mulabbadah,* and she swore to me\nthat the Messenger of Allah (ﷺ) had passed away in them.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، أَخْبَرَنِي سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ أَبِي بُرْدَةَ، قَالَ دَخَلْتُ عَلَى عَائِشَةَ فَأَخْرَجَتْ لِي إِزَارًا غَلِيظًا مِنَ الَّتِي تُصْنَعُ بِالْيَمَنِ وَكِسَاءً مِنْ هَذِهِ الأَكْسِيَةِ الَّتِي تُدْعَى الْمُلَبَّدَةَ وَأَقْسَمَتْ لِي لَقُبِضَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فِيهِمَا ‏.‏",
    "malay_translation": "“Aku masuk menemui ‘Aishah, lalu dia mengeluarkan kepadaku sehelai kain selendang tebal jenis buatan Yaman, dan sehelai lagi selendang yang dikenali sebagai Mulabbadah,* dan dia bersumpah kepadaku bahawa Rasulullah (ﷺ) wafat dalam keadaan memakai kedua-dua pakaian tersebut.”"
  },
  {
    "id": 33121,
    "hadith_number": 3288,
    "tajuk_hadith": "Solat Nabi (ﷺ) dengan Shamlah Berikat",
    "perawi_melayu": "‘Ubadah bin Samit",
    "english_text": "It was narrated from ‘Ubadah bin Samit that the Messenger of Allah\n(ﷺ)\nprayed in a Shamlah tied with a knot.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ ثَابِتٍ الْجَحْدَرِيُّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الأَحْوَصِ بْنِ حَكِيمٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ صَلَّى فِي شَمْلَةٍ قَدْ عَقَدَ عَلَيْهَا ‏.‏",
    "malay_translation": "Diriwayatkan daripada ‘Ubadah bin Samit bahawa Rasulullah (ﷺ) solat dengan shamlah yang diikat."
  },
  {
    "id": 33122,
    "hadith_number": 3289,
    "tajuk_hadith": "Pakaian Nabi (ﷺ) dari Najran",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "\"I was with the Messenger\nof\nAllah (ﷺ) and over him was a Najrani upper wrap with a thick\nborder.\"",
    "arabic_text": "حَدَّثَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنَا مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كُنْتُ مَعَ النَّبِيِّ ـ صلى الله عليه وسلم ـ وَعَلَيْهِ رِدَاءٌ نَجْرَانِيٌّ غَلِيظُ الْحَاشِيَةِ ‏.‏",
    "malay_translation": "Daripada Anas bin Malik berkata: \"Aku bersama Rasulullah (ﷺ) dan baginda memakai selendang Najrani yang tebal tepinya.\""
  },
  {
    "id": 33123,
    "hadith_number": 3290,
    "tajuk_hadith": "Sifat Rasulullah (ﷺ): Tidak Mencela dan Tidak Melipat Pakaian",
    "perawi_melayu": "‘Aishah رضي الله عنها",
    "english_text": "“I never saw the Messenger of\nAllah\n(ﷺ) insulting anyone, and no garment was ever folded up for\nhim.”*",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ مُحَمَّدٍ، حَدَّثَنَا بِشْرُ بْنُ عُمَرَ، حَدَّثَنَا ابْنُ لَهِيعَةَ، حَدَّثَنَا أَبُو الأَسْوَدِ، عَنْ عَاصِمِ بْنِ عُمَرَ بْنِ قَتَادَةَ، عَنْ عَلِيِّ بْنِ الْحُسَيْنِ، عَنْ عَائِشَةَ، قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَسُبُّ أَحَدًا وَلاَ يُطْوَى لَهُ ثَوْبٌ ‏.‏",
    "malay_translation": "“Aku tidak pernah melihat Rasulullah ﷺ mencela sesiapa pun, dan tidak pernah ada pakaian yang dilipat untuknya.”"
  },
  {
    "id": 33124,
    "hadith_number": 3291,
    "tajuk_hadith": "Kisah Kain Shamlah dan Kedermawanan Nabi Muhammad (ﷺ)",
    "perawi_melayu": "Diriwayatkan dari Sahl bin Sa’d Sa’idi",
    "english_text": "* “What\ntype of\nwoven sheet?” He said: “A Shamlah.” She said: “O\nMessenger of Allah, I\nhave woven this with my own hands for you to\nwear.” The Messenger of\nAllah (ﷺ) took it, since he needed it. He\ncame out to us wearing it\nas a lower wrap. So-and-so the son of\nso-and-so.” – a man whose name\nhe told that day – said: “O\nMessenger of Allah, how beautiful this\nsheet is! Let me wear it.”\nHe said: “Yes.” When he went inside he\nfolded it up and sent it\nto him. The people said to him: “By Allah,\nyou have not done well.\nThe Prophet (ﷺ) wore it because he needed\nit, then you asked for\nit, and you knew that he would not refuse\nanyone who asked him for\nsomething.” He said: “By Allah, I did not ask\nfor it so that I\ncould wear it, rather I asked for it so that it could\nbe my shroud.”\nSahl said: “And it became his shroud the day he died.”",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، أَنَّ امْرَأَةً، جَاءَتْ إِلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ بِبُرْدَةٍ - قَالَ وَمَا الْبُرْدَةُ قَالَ الشَّمْلَةُ - قَالَتْ يَا رَسُولَ اللَّهِ إِنِّي نَسَجْتُ هَذِهِ بِيَدِي لأَكْسُوَكَهَا ‏.‏ فَأَخَذَهَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ مُحْتَاجًا إِلَيْهَا فَخَرَجَ عَلَيْنَا فِيهَا وَإِنَّهَا لإِزَارُهُ فَجَاءَ فُلاَنُ بْنُ فُلاَنٍ - رَجُلٌ سَمَّاهُ يَوْمَئِذٍ - فَقَالَ يَا رَسُولَ اللَّهِ مَا أَحْسَنَ هَذِهِ الْبُرْدَةَ اكْسُنِيهَا ‏.‏ قَالَ ‏\n\"‏ نَعَمْ ‏\"‏ ‏.‏ فَلَمَّا دَخَلَ طَوَاهَا وَأَرْسَلَ بِهَا إِلَيْهِ فَقَالَ لَهُ الْقَوْمُ وَاللَّهِ مَا أَحْسَنْتَ كُسِيَهَا النَّبِيُّ ـ صلى الله عليه وسلم ـ مُحْتَاجًا إِلَيْهَا ثُمَّ سَأَلْتَهُ إِيَّاهَا وَقَدْ عَلِمْتَ أَنَّهُ لاَ يَرُدُّ سَائِلاً ‏.‏ فَقَالَ إِنِّي وَاللَّهِ مَا سَأَلْتُهُ إِيَّاهَا لأَلْبَسَهَا وَلَكِنْ سَأَلْتُهُ إِيَّاهَا لِتَكُونَ كَفَنِي ‏.‏ فَقَالَ سَهْلٌ فَكَانَتْ كَفَنَهُ يَوْمَ مَاتَ ‏.‏",
    "malay_translation": "Seorang wanita datang kepada Rasulullah (ﷺ) dengan sehelai kain tenun. Rasulullah (ﷺ) bertanya, “Kain apakah ini?” Wanita itu menjawab, “Shamlah.” Wanita itu berkata, “Wahai Rasulullah, aku telah menenun kain ini dengan tanganku sendiri untuk engkau pakai.” Rasulullah (ﷺ) mengambilnya kerana baginda memerlukannya. Baginda keluar memakai kain itu sebagai selendang bawah. Kemudian seorang lelaki yang disebutkan namanya pada hari itu, berkata, “Wahai Rasulullah, alangkah indahnya kain ini! Izinkanlah saya memakainya.” Baginda menjawab, “Baiklah.” Setelah masuk ke dalam rumah, baginda melipat kain itu dan mengirimkannya kepada lelaki itu. Orang ramai berkata kepadanya, “Demi Allah, engkau tidak melakukan perbuatan yang baik. Nabi (ﷺ) memakainya kerana baginda memerlukannya, kemudian engkau memintanya, sedangkan engkau tahu baginda tidak akan menolak sesiapa sahaja yang memintanya.” Lelaki itu berkata, “Demi Allah, aku tidak memintanya untuk aku pakai, tetapi aku memintanya supaya ia menjadi kain kafanku.” Sahl berkata, “Dan kain itu menjadi kain kafannya pada hari kematiannya."
  },
  {
    "id": 33125,
    "hadith_number": 3292,
    "tajuk_hadith": "Pakaian Rasulullah (ﷺ): Kain Bulu dan Kasut Sandal",
    "perawi_melayu": "Diriwayatkan daripada Anas",
    "english_text": "“The Messenger of Allah (ﷺ) wore\nwool\nand sandals, and he wore coarse, rough garments.”",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ، حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ، عَنْ يُوسُفَ بْنِ أَبِي كَثِيرٍ، عَنْ نُوحِ بْنِ ذَكْوَانَ، عَنِ الْحَسَنِ، عَنْ أَنَسٍ، قَالَ لَبِسَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ الصُّوفَ وَاحْتَذَى الْمَخْصُوفَ وَلَبِسَ ثَوْبًا خَشِنًا خَشِنًا ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) memakai kain daripada bulu dan kasut sandal, dan baginda memakai pakaian yang kasar."
  },
  {
    "id": 33126,
    "hadith_number": 3293,
    "tajuk_hadith": "Doa Memakai Pakaian Baru dan Sedekah Pakaian Lama",
    "perawi_melayu": "Abu Umamah",
    "english_text": "“Umar bin Khattab put on a new\ngarment and said: Al-hamdu lillahil-ladhi kasani ma uwari bihi\n‘awrati, wa atajammalu bihi fi hayati (Praise is to Allah Who has\nclothed me in something with which I conceal my nakedness and adorn\nmyself in my life). Then he said: ‘I heard the Messenger of Allah\n(ﷺ) say: “Whoever puts on a new garment and says: Al-hamdu\nlillahil-\nladhi kasani ma uwari bihi ‘awrati, wa atajammalu bihi fi\nhayati\n(Praise be to Allah Who has clothed me in something with which\nI\nconceal my nakedness and adorn myself in my life), then takes the\ngarment that has worn out, or that he had taken off and gives it in\ncharity, he will be under the shelter, protection and care of Allah,\nwhether he lives or dies.’ He said this three times.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، قَالَ حَدَّثَنَا أَصْبَغُ بْنُ زَيْدٍ، حَدَّثَنَا أَبُو الْعَلاَءِ، عَنْ أَبِي أُمَامَةَ، قَالَ لَبِسَ عُمَرُ بْنُ الْخَطَّابِ ثَوْبًا جَدِيدًا فَقَالَ الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي مَا أُوَارِي بِهِ عَوْرَتِي وَأَتَجَمَّلُ بِهِ فِي حَيَاتِي ثُمَّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ مَنْ لَبِسَ ثَوْبًا جَدِيدًا فَقَالَ الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي مَا أُوَارِي بِهِ عَوْرَتِي وَأَتَجَمَّلُ بِهِ فِي حَيَاتِي ‏.‏ ثُمَّ عَمَدَ إِلَى الثَّوْبِ الَّذِي أَخْلَقَ أَوْ أَلْقَى فَتَصَدَّقَ بِهِ كَانَ فِي كَنَفِ اللَّهِ وَفِي حِفْظِ اللَّهِ وَفِي سِتْرِ اللَّهِ حَيًّا وَمَيِّتًا ‏\"‏ ‏.‏ قَالَهَا ثَلاَثًا ‏.‏",
    "malay_translation": "Umar bin Khattab memakai pakaian baru dan berkata: \"Al-hamdu lillahil-ladhi kasani ma uwari bihi ‘awrati, wa atajammalu bihi fi hayati (Segala puji bagi Allah yang telah memberikan aku pakaian untuk menutup auratku dan berhias diri dalam hidupku).\" Kemudian dia berkata: \"Saya mendengar Rasulullah (ﷺ) bersabda: 'Sesiapa yang memakai pakaian baru lalu mengucapkan: Al-hamdu lillahil-ladhi kasani ma uwari bihi ‘awrati, wa atajammalu bihi fi hayati (Segala puji bagi Allah yang telah memberikan aku pakaian untuk menutup auratku dan berhias diri dalam hidupku), kemudian mengambil pakaian yang sudah lusuh, atau yang telah ditanggalkan, lalu disedekahkan, maka dia akan berada di bawah naungan, perlindungan, dan penjagaan Allah, sama ada dia hidup atau mati.' Beliau mengatakannya tiga kali."
  },
  {
    "id": 33127,
    "hadith_number": 3294,
    "tajuk_hadith": "Doa Nabi kepada Umar (r.a) ketika memakai pakaian baharu",
    "perawi_melayu": "Diriwayatkan daripada Ibnu Umar bahawa Rasulullah (ﷺ) melihat Umar memakai baju putih dan baginda bersabda:",
    "english_text": "“Is this garment of yours washed or a new one?” He said: “Rather it has been washed.” He said: “Ilbas jadida, wa `ish hamida, wa mut shahida (May you wear new clothes, live a good life and die as martyr).”",
    "arabic_text": "حَدَّثَنَا الْحُسَيْنُ بْنُ مَهْدِيٍّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَنْبَأَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ رَأَى عَلَى عُمَرَ قَمِيصًا أَبْيَضَ فَقَالَ ‏\"‏ ثَوْبُكَ هَذَا غَسِيلٌ أَمْ جَدِيدٌ ‏\"‏ ‏.‏ قَالَ لاَ بَلْ غَسِيلٌ ‏.‏ قَالَ ‏\"‏ الْبَسْ جَدِيدًا وَعِشْ حَمِيدًا وَمُتْ شَهِيدًا ‏\"‏ ‏.‏",
    "malay_translation": "“Adakah pakaianmu ini telah dicuci atau baharu?” Beliau menjawab: “Bahkan, telah dicuci.” Baginda bersabda: “Ilbas jadida, wa ‘ish hamida, wa mut shahida (Semoga kamu memakai pakaian baharu, hidup dalam keadaan terpuji, dan mati syahid).”"
  },
  {
    "id": 33128,
    "hadith_number": 3295,
    "tajuk_hadith": "Larangan Nabi (ﷺ) terhadap Dua Jenis Pakaian",
    "perawi_melayu": "Abu Sa’eed Al-Khudri",
    "english_text": "It was\nnarrated from Abu Sa’eed Al-Khudri that the Prophet (ﷺ)\nforbade\ntwo kinds of dress. Those two types of dress are Ishtimalus-\nSamma’*\nand Ihtiba’ in a single garment, with no part of it upon his\nprivate part.**",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ نَهَى عَنْ لِبْسَتَيْنِ فَأَمَّا اللِّبْسَتَانِ فَاشْتِمَالُ الصَّمَّاءِ وَالاِحْتِبَاءُ فِي الثَّوْبِ الْوَاحِدِ لَيْسَ عَلَى فَرْجِهِ مِنْهُ شَىْءٌ ‏.‏",
    "malay_translation": "Diriwayatkan dari Abu Sa’eed Al-Khudri bahawa Nabi (ﷺ) melarang dua jenis pakaian. Dua jenis pakaian tersebut ialah Ishtimalus-Samma’* dan Ihtiba’ dalam sehelai pakaian, dengan tiada sebahagian pun daripadanya menutupi auratnya."
  },
  {
    "id": 33129,
    "hadith_number": 3296,
    "tajuk_hadith": "Larangan Memakai Pakaian yang Menutupi Seluruh Tubuh (Ishtimalus-Samma’) dan Ihtiba’ dengan Mengeluarkan Aurat",
    "perawi_melayu": "Daripada Abu Hurairah radhiyallahu anhu",
    "english_text": "Ishtimalus-Samma’ and Ihtiba’, exposing\none’s\nprivate part to the sky.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ، ‏.‏ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ نَهَى عَنْ لِبْسَتَيْنِ عَنِ اشْتِمَالِ الصَّمَّاءِ وَعَنِ الاِحْتِبَاءِ فِي الثَّوْبِ الْوَاحِدِ يُفْضِي بِفَرْجِهِ إِلَى السَّمَاءِ ‏.‏",
    "malay_translation": "Rasulullah ﷺ melarang dua jenis pakaian: Ishtimalus-Samma’ dan Ihtiba’, iaitu apabila seseorang lelaki memakai sehelai pakaian yang menutupi seluruh tubuhnya dan juga duduk dengan keadaan mengangkat kedua lututnya dengan kain yang menutupi kedua-dua kakinya, sehinggalah auratnya tersingkap ke langit."
  },
  {
    "id": 33130,
    "hadith_number": 3297,
    "tajuk_hadith": "Larangan Dua Bentuk Pakaian oleh Rasulullah (ﷺ)",
    "perawi_melayu": "‘Aishah",
    "english_text": "“The Messenger of Allah (ﷺ)\nforbade\ntwo kinds of dress: Ishtimalus-Samma’ and Ihtiba’ in one\ngarment,\nwhen you are exposing your private part to the sky.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ عَنْ سَعْدِ بْنِ سَعِيدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ لِبْسَتَيْنِ اشْتِمَالِ الصَّمَّاءِ وَالاِحْتِبَاءِ فِي ثَوْبٍ وَاحِدٍ وَأَنْتَ مُفْضٍ فَرْجَكَ إِلَى السَّمَاءِ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) melarang dua jenis pakaian: Ishtimalus-Samma’ dan Ihtiba’ dalam sehelai pakaian, ketika kamu mendedahkan auratmu kepada langit."
  },
  {
    "id": 33131,
    "hadith_number": 3298,
    "tajuk_hadith": "Bau Kami Seperti Kambing Ketika Hujan Bersama Rasulullah (ﷺ)",
    "perawi_melayu": "Diriwayatkan daripada Abu Burdah bahawa bapanya berkata kepadanya:",
    "english_text": "“O my\nson, if\nonly you could have seen us when we were with the Messenger of\nAllah\n(ﷺ), when rain fell on us; you would have thought that we\nsmelled\nlike sheep.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى، عَنْ شَيْبَانَ، عَنْ قَتَادَةَ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ لِي يَا بُنَىَّ لَوْ شَهِدْتَنَا وَنَحْنُ مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ إِذَا أَصَابَتْنَا السَّمَاءُ لَحَسِبْتَ أَنَّ رِيحَنَا رِيحُ الضَّأْنِ ‏.‏",
    "malay_translation": "“Wahai anakku, sekiranya engkau melihat kami ketika bersama Rasulullah (ﷺ) ketika hujan turun ke atas kami, nescaya engkau akan menyangka bahawa bau kami seperti bau kambing.”"
  },
  {
    "id": 33132,
    "hadith_number": 3299,
    "tajuk_hadith": "Rasulullah (ﷺ) Solat Menggunakan Jubah Romawi",
    "perawi_melayu": "Daripada ‘Ubadah bin Samit",
    "english_text": "“The Messenger of Allah\n(ﷺ) came out to us one day, wearing a Roman cloak of wool with\nnarrow sleeves. He led us in prayer wearing that, and nothing else.”",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ بْنِ كَرَامَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا الأَحْوَصُ بْنُ حَكِيمٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ذَاتَ يَوْمٍ وَعَلَيْهِ جُبَّةٌ رُومِيَّةٌ مِنْ صُوفٍ ضَيِّقَةُ الْكُمَّيْنِ فَصَلَّى بِنَا فِيهَا لَيْسَ عَلَيْهِ شَىْءٌ غَيْرُهَا ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) keluar kepada kami pada suatu hari, memakai jubah Romawi daripada bulu dengan lengan yang sempit. Baginda mengimamkan solat bersama kami dengan memakai jubah itu, dan tiada apa pun selain daripadanya."
  },
  {
    "id": 33133,
    "hadith_number": 3300,
    "tajuk_hadith": "Nabi (ﷺ) Membalas Jubah Bulu untuk Mengusap Wajah Selepas Berwudhu",
    "perawi_melayu": "Salman Al-Farisi",
    "english_text": "It was\nnarrated from Salman Farisi that the Messenger of Allah (ﷺ)\nperformed ablution, then he turned his woolen cloak that he was\nwearing inside out and wiped his face with it.",
    "arabic_text": "حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ الدِّمَشْقِيُّ، وَأَحْمَدُ بْنُ الأَزْهَرِ، قَالاَ حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَزِيدُ بْنُ السِّمْطِ، حَدَّثَنِي الْوَضِينُ بْنُ عَطَاءٍ، عَنْ مَحْفُوظِ بْنِ عَلْقَمَةَ، عَنْ سَلْمَانَ الْفَارِسِيِّ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ تَوَضَّأَ فَقَلَبَ جُبَّةَ صُوفٍ كَانَتْ عَلَيْهِ فَمَسَحَ بِهَا وَجْهَهُ ‏.‏",
    "malay_translation": "Diriwayatkan daripada Salman Al-Farisi bahawa Rasulullah (ﷺ) berwudhu', kemudian baginda membalas jubah bulu yang dipakainya dan mengusap wajah baginda dengannya."
  },
  {
    "id": 33134,
    "hadith_number": 3301,
    "tajuk_hadith": "Rasulullah (ﷺ) Menandai Kambing dan Memakai Selendang",
    "perawi_melayu": "Anas bin Malik berkata:",
    "english_text": "“I saw the Messenger of\nAllah\n(ﷺ) marking sheep on their ears, and I saw him wearing a cloak\naround his wrist.”",
    "arabic_text": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا مُوسَى بْنُ الْفَضْلِ، عَنْ شُعْبَةَ، عَنْ هِشَامِ بْنِ زَيْدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَسِمُ غَنَمًا فِي آذَانِهَا وَرَأَيْتُهُ مُتَّزِرًا بِكِسَاءٍ ‏.‏",
    "malay_translation": "Aku melihat Rasulullah (ﷺ) menandai kambing pada telinga mereka, dan aku melihat baginda memakai selendang di pergelangan tangannya."
  },
  {
    "id": 33135,
    "hadith_number": 3302,
    "tajuk_hadith": "Pakaian Terbaik: Putih",
    "perawi_melayu": "Daripada Ibn ‘Abbas bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "“The best of your garments are the white ones, so wear them and\nshroud your dead in them.”",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ الْمَكِّيُّ، عَنِ ابْنِ خُثَيْمٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ خَيْرُ ثِيَابِكُمُ الْبَيَاضُ فَالْبَسُوهَا وَكَفِّنُوا فِيهَا مَوْتَاكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "“Sebaik-baik pakaian kamu adalah yang berwarna putih, maka pakailah ia dan kafankanlah mayat kamu dengannya.”"
  },
  {
    "id": 33136,
    "hadith_number": 3303,
    "tajuk_hadith": "Pakaian Putih Lebih Suci dan Baik",
    "perawi_melayu": "Diriwayatkan dari Samurah bin Jundab bahawa Rasulullah ﷺ bersabda:",
    "english_text": "“Wear white garments, for they are purer and better.”",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ مَيْمُونِ بْنِ أَبِي شَبِيبٍ، عَنْ سَمُرَةَ بْنِ جُنْدَبٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ الْبَسُوا ثِيَابَ الْبَيَاضِ فَإِنَّهَا أَطْهَرُ وَأَطْيَبُ ‏\"‏ ‏.‏",
    "malay_translation": "“Pakailah pakaian putih, kerana ia lebih suci dan lebih baik.”"
  },
  {
    "id": 33137,
    "hadith_number": 3304,
    "tajuk_hadith": "Kebaikan Pakaian Putih Ketika Menziarahi Kubur dan Masjid",
    "perawi_melayu": "Daripada Abu Darda’ r.a. bahawa Rasulullah ﷺ bersabda:",
    "english_text": "“The best of that in which you visit Allah in your graves and\nyour\nmosque is white (garments).”*",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ حَسَّانَ الأَزْرَقُ، حَدَّثَنَا عَبْدُ الْمَجِيدِ بْنُ أَبِي رَوَّادٍ، حَدَّثَنَا مَرْوَانُ بْنُ سَالِمٍ، عَنْ صَفْوَانَ بْنِ عَمْرٍو، عَنْ شُرَيْحِ بْنِ عُبَيْدٍ الْحَضْرَمِيِّ، عَنْ أَبِي الدَّرْدَاءِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِنَّ أَحْسَنَ مَا زُرْتُمُ اللَّهَ بِهِ فِي قُبُورِكُمْ وَمَسَاجِدِكُمُ الْبَيَاضُ ‏\"‏ ‏.‏",
    "malay_translation": "“Sebaik-baiknya sesuatu yang kamu menziarahi Allah dengannya di kubur-kubur kamu dan masjid-masjid kamu ialah (pakaian) putih.”"
  },
  {
    "id": 33138,
    "hadith_number": 3305,
    "tajuk_hadith": "Larangan Mengheret Pakaian Kerana Sombong",
    "perawi_melayu": "Daripada Ibnu 'Umar bahawa Rasulullah ﷺ bersabda:",
    "english_text": "“Whoever lets his garment drag out of pride, Allah will not look\nat\nhim on the Day of Resurrection.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، ح وَحَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، جَمِيعًا عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ إِنَّ الَّذِي يَجُرُّ ثَوْبَهُ مِنَ الْخُيَلاَءِ لاَ يَنْظُرُ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "“Sesiapa yang memanjangkan pakaiannya (mengheretnya) kerana sombong, Allah tidak akan memandangnya pada Hari Kiamat.”"
  },
  {
    "id": 33139,
    "hadith_number": 3306,
    "tajuk_hadith": "Larangan Mengheret Pakaian Kerana Sombong",
    "perawi_melayu": "Diriwayatkan dari ‘Atiyyah, dari Abu Sa’eed",
    "english_text": "“The Messenger\nof\nAllah (ﷺ) said: ‘Whoever lets his lower wrap drag out of pride,\nAllah will not look at him on the Day of Resurrection.” He ( ‘Atiyyah) said \"I met Ibn 'Umar in Al-Balaat so I mentioned Abu Sa'eed's hadith from the Prophet (ﷺ). So he said and pointed to his ears 'My two ears heard it, and my heart preserved it.' \"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ عَطِيَّةَ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ جَرَّ إِزَارَهُ مِنَ الْخُيَلاَءِ لَمْ يَنْظُرِ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ \n قَالَ فَلَقِيتُ ابْنَ عُمَرَ بِالْبَلاَطِ فَذَكَرْتُ لَهُ حَدِيثَ أَبِي سَعِيدٍ عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ فَقَالَ وَأَشَارَ إِلَى أُذُنَيْهِ سَمِعَتْهُ أُذُنَاىَ وَوَعَاهُ قَلْبِي ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda: “Sesiapa yang memanjangkan kainnya kerana sombong, Allah tidak akan memandangnya pada Hari Kiamat.” Beliau (‘Atiyyah) berkata: “Aku bertemu dengan Ibn ‘Umar di Al-Balaat lalu aku menyebutkan hadis Abu Sa’eed daripada Nabi (ﷺ). Maka dia berkata sambil menunjuk ke telinganya: ‘Dua telingaku mendengarnya, dan hatiku memeliharanya.’”"
  },
  {
    "id": 33140,
    "hadith_number": 3307,
    "tajuk_hadith": "Larangan Menyeret Pakaian Kerana Sombong",
    "perawi_melayu": "Abu Hurairah (RA)",
    "english_text": "“O my nephew! I heard the Messenger\nof\nAllah (ﷺ) saying ‘Whoever let his garment drag out of pride,\nAllah will not look at him on the Day of Resurrection.’”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ مَرَّ بِأَبِي هُرَيْرَةَ فَتًى مِنْ قُرَيْشٍ يَجُرُّ سَبَلَهُ فَقَالَ يَا ابْنَ أَخِي إِنِّي سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ مَنْ جَرَّ ثَوْبَهُ مِنَ الْخُيَلاَءِ لَمْ يَنْظُرِ اللَّهُ له يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
    "malay_translation": "“Wahai anak saudaraku! Aku mendengar Rasulullah (ﷺ) bersabda: ‘Sesiapa yang menyeret pakaiannya kerana sombong, Allah tidak akan memandangnya pada Hari Kiamat.’”"
  },
  {
    "id": 33141,
    "hadith_number": 3308,
    "tajuk_hadith": "Kedudukan Kain/Pakaian di Bawah Mata Kaki",
    "perawi_melayu": "Diriwayatkan daripada Huzaifah r.a.",
    "english_text": "“The Messenger of Allah (ﷺ)\ntook\nhold of the lower part of my calf or his calf and said: ‘This is\nwhere the lower wrap should come to. If you insist, then lower, and\nif\nyou insist, then lower, but the lower wrap has no right to (come\nto)\nthe ankle.’”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، عَنْ مُسْلِمِ بْنِ نُذَيْرٍ، عَنْ حُذَيْفَةَ، قَالَ أَخَذَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ بِأَسْفَلِ عَضَلَةِ سَاقِي أَوْ سَاقِهِ فَقَالَ ‏\n\"‏ هَذَا مَوْضِعُ الإِزَارِ فَإِنْ أَبَيْتَ ‏.‏ فَأَسْفَلَ فَإِنْ أَبَيْتَ فَأَسْفَلَ فَإِنْ أَبَيْتَ فَلاَ حَقَّ لِلإِزَارِ فِي الْكَعْبَيْنِ ‏\"‏ ‏.‏ \n حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، حَدَّثَنِي أَبُو إِسْحَاقَ، عَنْ مُسْلِمِ بْنِ نُذَيْرٍ، عَنْ حُذَيْفَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ مِثْلَهُ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) memegang betis bawah saya atau betisnya, lalu bersabda: 'Inilah tempat kain (izār) itu sepatutnya berada. Jika kamu enggan, maka di bawah lagi; jika kamu enggan, maka di bawah lagi, tetapi kain itu tidak ada hak untuk (berada) di bawah buku lali.'"
  },
  {
    "id": 33142,
    "hadith_number": 3309,
    "tajuk_hadith": "Larangan Menjatuhkan Kain di Bawah Buku Lali Kerana Kesombongan",
    "perawi_melayu": "Diriwayatkan daripada ‘Ala bin ‘Abdur-Rahman bahawa bapanya berkata:",
    "english_text": "“Not Available\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، قَالَ قُلْتُ لأَبِي سَعِيدٍ هَلْ سَمِعْتَ مِنْ، رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ شَيْئًا فِي الإِزَارِ قَالَ نَعَمْ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ إِزْرَةُ الْمُؤْمِنِ إِلَى أَنْصَافِ سَاقَيْهِ لاَ جُنَاحَ عَلَيْهِ مَا بَيْنَهُ وَبَيْنَ الْكَعْبَيْنِ وَمَا أَسْفَلَ مِنَ الْكَعْبَيْنِ فِي النَّارِ ‏\"‏ ‏.‏ يَقُولُ ثَلاَثًا ‏\"‏ لاَ يَنْظُرُ اللَّهُ إِلَى مَنْ جَرَّ إِزَارَهُ بَطَرًا ‏\"‏ ‏.‏",
    "malay_translation": "“Aku berkata kepada Abu Sa’eed: ‘Adakah kamu mendengar sesuatu daripada Rasulullah (ﷺ) mengenai kain bawah?’ Beliau berkata: ‘Ya. Aku mendengar Rasulullah (ﷺ) bersabda: ‘Kain bawah seorang mukmin hendaklah sampai ke pertengahan betis, tetapi tiada dosa ke atasnya jika ia sampai di antara itu dan buku lali. Tetapi apa sahaja yang lebih rendah daripada buku lali adalah di dalam neraka.’ Dan beliau berkata tiga kali: ‘Allah tidak akan memandang kepada orang yang menjatuhkan kainnya kerana kesombongan.’”"
  },
  {
    "id": 33143,
    "hadith_number": 3310,
    "tajuk_hadith": "Larangan Mengheret Pakaian di Bawah Buku Lali",
    "perawi_melayu": "Daripada Mughirah bin Shu'bah bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "\"Not Available\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا شَرِيكٌ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ حُصَيْنِ بْنِ قَبِيصَةَ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ يَا سُفْيَانَ بْنَ سَهْلٍ لاَ تُسْبِلْ فَإِنَّ اللَّهَ لاَ يُحِبُّ الْمُسْبِلِينَ ‏\"‏ ‏.‏",
    "malay_translation": "“Wahai Sufyan bin Sahl, janganlah kamu memanjangkan pakaianmu (melebihi buku lali), kerana Allah tidak menyukai orang-orang yang memanjangkan pakaian mereka.”"
  },
  {
    "id": 33144,
    "hadith_number": 3311,
    "tajuk_hadith": "Kemeja Kesukaan Rasulullah (ﷺ)",
    "perawi_melayu": "Umm Salamah berkata:",
    "english_text": "There was no garment more\nbeloved to\nthe Messenger of Allah (ﷺ) than the shirt.",
    "arabic_text": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، حَدَّثَنَا أَبُو تُمَيْلَةَ، عَنْ عَبْدِ الْمُؤْمِنِ بْنِ خَالِدٍ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أُمِّهِ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ لَمْ يَكُنْ ثَوْبٌ أَحَبَّ إِلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ مِنَ الْقَمِيصِ ‏.‏",
    "malay_translation": "Tiada pakaian yang lebih disukai oleh Rasulullah (ﷺ) daripada kemeja."
  },
  {
    "id": 33145,
    "hadith_number": 3312,
    "tajuk_hadith": "Larangan Menyeret Pakaian dengan Sombong",
    "perawi_melayu": "Diriwayatkan daripada Salim, daripada bapanya, bahawa Nabi (ﷺ) bersabda:",
    "english_text": "“Hanging down may apply to the waist wrap, shirt or turban.\nWhoever\nlets any of these drag out of pride, Allah will not look at\nhim on\nthe Day of Resurrection.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْحُسَيْنُ بْنُ عَلِيٍّ، عَنِ ابْنِ أَبِي رَوَّادٍ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ الإِسْبَالُ فِي الإِزَارِ وَالْقَمِيصِ وَالْعِمَامَةِ مَنْ جَرَّ شَيْئًا خُيَلاَءَ لَمْ يَنْظُرِ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ قَالَ أَبُو بَكْرٍ مَا أَغْرَبَهُ ‏.‏",
    "malay_translation": "“Menyeret pakaian (ke bawah) boleh merujuk kepada kain sarung, baju atau serban. Sesiapa yang membiarkan mana-mana daripada ini (pakaian) diseret kerana sombong, Allah tidak akan memandangnya pada Hari Kiamat.”"
  },
  {
    "id": 33146,
    "hadith_number": 3313,
    "tajuk_hadith": "Pakaian Rasulullah (ﷺ) yang Ringkas",
    "perawi_melayu": "Diriwayatkan daripada Ibn ‘Abbas r.a.",
    "english_text": "“The Messenger of Allah (ﷺ)\nused\nto wear a shirt that was short in the sleeves and length.”",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ الأَوْدِيُّ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنَا حَسَنُ بْنُ صَالِحٍ، ح وَحَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ، حَدَّثَنَا أَبِي، عَنِ الْحَسَنِ بْنِ صَالِحٍ، عَنْ مُسْلِمٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَلْبَسُ قَمِيصًا قَصِيرَ الْيَدَيْنِ وَالطُّولِ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) memakai kemeja yang pendek lengan dan panjangnya."
  },
  {
    "id": 33147,
    "hadith_number": 3314,
    "tajuk_hadith": "Ikrar Bai'ah dan Baju Nabi (ﷺ)",
    "perawi_melayu": "Mu’awiyah bin Qurrah meriwayatkan bahawa bapanya berkata:",
    "english_text": "“I came to\nthe\nMessenger of Allah (ﷺ) and gave him my pledge, and the buttons\nof\nhis shirt were undone.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا ابْنُ دُكَيْنٍ، عَنْ زُهَيْرٍ، عَنْ عُرْوَةَ بْنِ عَبْدِ اللَّهِ بْنِ قُشَيْرٍ، حَدَّثَنِي مُعَاوِيَةُ بْنُ قُرَّةَ، عَنْ أَبِيهِ، قَالَ أَتَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ فَبَايَعْتُهُ وَإِنَّ زِرَّ قَمِيصِهِ لَمُطْلَقٌ ‏.‏ قَالَ عُرْوَةُ فَمَا رَأَيْتُ مُعَاوِيَةَ وَلاَ ابْنَهُ فِي شِتَاءٍ وَلاَ صَيْفٍ إِلاَّ مُطْلَقَةً أَزْرَارُهُمَا ‏.‏",
    "malay_translation": "“Saya datang kepada Rasulullah (ﷺ) dan memberikan bai'ah saya kepadanya, dan butang bajunya terbuka.”"
  },
  {
    "id": 33148,
    "hadith_number": 3315,
    "tajuk_hadith": "Nabi ﷺ Menawar Harga Seluar",
    "perawi_melayu": "Diriwayatkan daripada Suwaid bin Qais:",
    "english_text": "“The Prophet (ﷺ) came to\nus\nand haggled with us over the price of trousers.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى، وَعَبْدُ الرَّحْمَنِ، قَالُوا حَدَّثَنَا سُفْيَانُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ سُوَيْدِ بْنِ قَيْسٍ، قَالَ أَتَانَا النَّبِيُّ ـ صلى الله عليه وسلم ـ فَسَاوَمَنَا سَرَاوِيلَ ‏.‏",
    "malay_translation": "Nabi ﷺ datang kepada kami dan menawar harga seluar."
  },
  {
    "id": 33149,
    "hadith_number": 3316,
    "tajuk_hadith": "Panjang Labuh Pakaian Wanita",
    "perawi_melayu": "Umm Salamah berkata:",
    "english_text": "“The Messenger of Allah (ﷺ)\nwas\nasked about how long a woman’s hem should hang down. He said: ‘A\nhand span.’ I said: ‘But then (her legs and feet) will be\nuncovered.’\nHe said: ‘Then a forearm’s length, but no more than\nthat.’”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ سُئِلَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ كَمْ تَجُرُّ الْمَرْأَةُ مِنْ ذَيْلِهَا قَالَ ‏\"‏ شِبْرًا ‏\"‏ ‏.‏ قُلْتُ إِذًا يَنْكَشِفَ عَنْهَا ‏.‏ قَالَ ذِرَاعٌ لاَ تَزِيدُ عَلَيْهِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) ditanya tentang berapa panjang labuh pakaian seorang wanita. Baginda bersabda: ‘Sejengkal.’ Aku berkata: ‘Tetapi (kaki dan tapak kakinya) akan tersingkap.’ Baginda bersabda: ‘Kemudian sehasta, tetapi jangan lebih dari itu.’"
  },
  {
    "id": 33150,
    "hadith_number": 3317,
    "tajuk_hadith": "Kebenaran Isteri Nabi (ﷺ) dalam Panjang Jumbai",
    "perawi_melayu": "Diriwayatkan daripada Ibnu ‘Umar:",
    "english_text": "“The wives of the Prophet (ﷺ) were\nallowed to let their hems hang down, so they used to come to us and\nwe\nwould measure one forearms length for them with a reed.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ زَيْدٍ الْعَمِّيِّ، عَنْ أَبِي الصِّدِّيقِ النَّاجِيِّ، عَنِ ابْنِ عُمَرَ، أَنَّ أَزْوَاجَ النَّبِيِّ، ـ صلى الله عليه وسلم ـ رُخِّصَ لَهُنَّ فِي الذَّيْلِ ذِرَاعًا فَكُنَّ يَأْتِيَنَّا فَنَذْرَعُ لَهُنَّ بِالْقَصَبِ ذِرَاعًا ‏.‏",
    "malay_translation": "“Isteri-isteri Nabi (ﷺ) dibenarkan memanjangkan jumbai pakaian mereka, lalu mereka datang kepada kami dan kami mengukur satu hasta untuk mereka dengan batang.”"
  },
  {
    "id": 33151,
    "hadith_number": 3318,
    "tajuk_hadith": "Arahan Nabi (ﷺ) kepada Fatimah atau Ummu Salamah tentang Labuh Kain",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah",
    "english_text": "\"Not Available\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ أَبِي الْمُهَزِّمِ، عَنْ أَبِي هُرَيْرَةَ، ‏.‏ أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ لِفَاطِمَةَ أَوْ لأُمِّ سَلَمَةَ ‏\n\"‏ ذَيْلُكِ ذِرَاعٌ ‏\"‏ ‏.‏",
    "malay_translation": "Sabda Nabi (ﷺ) kepada Fatimah atau Ummu Salamah: “Labuh kainmu satu ukuran sejengkal.”"
  },
  {
    "id": 33152,
    "hadith_number": 3319,
    "tajuk_hadith": "Panjang Labuh Kain Wanita",
    "perawi_melayu": "Diriwayatkan daripada Aisyah bahawa Nabi (ﷺ) berkata mengenai berapa panjang labuh kain seorang wanita haruslah terjuntai:",
    "english_text": "“A hand span.” ‘Aishah said:\n“This may show her calves.” He said: “Then a forearm’s\nlength.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا حَبِيبٌ الْمُعَلِّمُ، عَنْ أَبِي الْمُهَزِّمِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ فِي ذُيُولِ النِّسَاءِ ‏\"‏ شِبْرًا ‏\"‏ ‏.‏ فَقَالَتْ عَائِشَةُ إِذًا تَخْرُجَ سُوقُهُنَّ ‏.‏ قَالَ ‏\"‏ فَذِرَاعٌ ‏\"‏ ‏.‏",
    "malay_translation": "“Sejengkal tangan.” Aisyah berkata:\n“Ini mungkin menampakkan betis mereka.” Baginda bersabda: “Kemudian sehasta.”"
  },
  {
    "id": 33153,
    "hadith_number": 3320,
    "tajuk_hadith": "Nabi (ﷺ) Berkhutbah dengan Serban Hitam",
    "perawi_melayu": "Diriwayatkan daripada Ja’far bin ‘Amr bin Huraith bahawa bapanya berkata:",
    "english_text": "“I saw the Prophet (ﷺ) delivering a sermon on the pulpit,\nwearing\na black turban.”",
    "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ مُسَاوِرٍ الْوَرَّاقِ، عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ حُرَيْثٍ، عَنْ أَبِيهِ، قَالَ رَأَيْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ يَخْطُبُ عَلَى الْمِنْبَرِ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ ‏.‏",
    "malay_translation": "“Saya melihat Nabi (ﷺ) menyampaikan khutbah di atas mimbar, memakai serban hitam.”"
  },
  {
    "id": 33154,
    "hadith_number": 3321,
    "tajuk_hadith": "Nabi (ﷺ) Memasuki Makkah dengan Serban Hitam",
    "perawi_melayu": "Jabir",
    "english_text": "It was\nnarrated from Jabir that the Prophet (ﷺ) entered Makkah\nwearing a\nblack turban.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ دَخَلَ مَكَّةَ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ ‏.‏",
    "malay_translation": "Diriwayatkan daripada Jabir bahawa Nabi (ﷺ) memasuki Makkah dengan memakai serban hitam."
  },
  {
    "id": 33155,
    "hadith_number": 3322,
    "tajuk_hadith": "Nabi (ﷺ) Memasuki Makkah dengan Serban Hitam",
    "perawi_melayu": "Ibn ‘Umar",
    "english_text": "It was\nnarrated from Ibn ‘Umar that the Prophet (ﷺ) entered\n(Makkah), on\nthe Day of the Conquest of Makkah, wearing a black\nturban.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، أَنْبَأَنَا مُوسَى بْنُ عُبَيْدَةَ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ دَخَلَ يَوْمَ فَتْحِ مَكَّةَ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ ‏.‏",
    "malay_translation": "Diriwayatkan daripada Ibn ‘Umar bahawa Nabi (ﷺ) memasuki (Makkah), pada Hari Pembukaan Makkah, dengan memakai serban hitam."
  },
  {
    "id": 33156,
    "hadith_number": 3323,
    "tajuk_hadith": "Melihat Rasulullah (ﷺ) dengan Serban Hitam",
    "perawi_melayu": "Ja’far bin ‘Amr bin Huraith meriwayatkan bahawa bapanya berkata:",
    "english_text": "“It is as\nif\nI can see the Messenger of Allah (ﷺ), wearing a black turban,\nwith\nthe ends hanging down his shoulders.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ مُسَاوِرٍ، حَدَّثَنِي جَعْفَرُ بْنُ عَمْرِو بْنِ حُرَيْثٍ، عَنْ أَبِيهِ، قَالَ كَأَنِّي أَنْظُرُ إِلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ قَدْ أَرْخَى طَرَفَيْهَا بَيْنَ كَتِفَيْهِ ‏.‏",
    "malay_translation": "“Seolah-olah aku melihat Rasulullah (ﷺ), memakai serban hitam, dengan hujung-hujungnya terjurai di antara bahunya.”"
  },
  {
    "id": 33157,
    "hadith_number": 3324,
    "tajuk_hadith": "Larangan Memakai Sutera di Akhirat",
    "perawi_melayu": "Diriwayatkan daripada Anas bin Malik bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "“Whoever wears silk in this world will not wear it in the\nHereafter.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ لَبِسَ الْحَرِيرَ فِي الدُّنْيَا لَمْ يَلْبَسْهُ فِي الآخِرَةِ ‏\"‏ ‏.‏",
    "malay_translation": "“Sesiapa yang memakai sutera di dunia, dia tidak akan memakainya di akhirat.”"
  },
  {
    "id": 33158,
    "hadith_number": 3325,
    "tajuk_hadith": "Larangan Rasulullah (ﷺ) Mengenai Sutera, Brokat, dan Istabraq",
    "perawi_melayu": "Diriwayatkan dari al-Bara' bin 'Azib",
    "english_text": "“The Messenger of Allah\n(ﷺ) forbade brocade, silk, and embroidered brocade.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الشَّيْبَانِيِّ، عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ، عَنْ مُعَاوِيَةَ بْنِ سُوَيْدٍ، عَنِ الْبَرَاءِ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ الدِّيبَاجِ وَالْحَرِيرِ وَالإِسْتَبْرَقِ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) melarang penggunaan kain dibaj (brokat), sutera, dan istabraq (brokat bersulam)."
  },
  {
    "id": 33159,
    "hadith_number": 3326,
    "tajuk_hadith": "Larangan Memakai Sutera dan Emas",
    "perawi_melayu": "Diriwayatkan daripada Huzaifah r.a.",
    "english_text": "“The Messenger of Allah (ﷺ)\nforbade\nwearing silk and gold. He said: ‘They are for them in this\nworld\nand for us in the Hereafter.’”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنِ الْحَكَمِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ حُذَيْفَةَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ لُبْسِ الْحَرِيرِ وَالذَّهَبِ وَقَالَ ‏\n\"‏ هُوَ لَهُمْ فِي الدُّنْيَا وَلَنَا فِي الآخِرَةِ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) melarang memakai sutera dan emas. Baginda bersabda: 'Ia adalah untuk mereka di dunia dan untuk kita di akhirat.'"
  },
  {
    "id": 33160,
    "hadith_number": 3327,
    "tajuk_hadith": "Pakaian Sutera: Hanya Bagi Mereka yang Tiada Bahagian di Akhirat",
    "perawi_melayu": "Diriwayatkan daripada ‘Abdullah bin ‘Umar bahawa ‘Umar bin Khattab melihat pakaian sutera dua helai (ditawarkan untuk dijual). Beliau berkata:",
    "english_text": "“O\nMessenger\nof Allah, why don’t you buy this two piece suit (to wear\nfor meeting)\nthe delegations, and on Fridays?” The Messenger of\nAllah (ﷺ) said:\n“This is only worn by one who has no share in the\nHereafter.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، أَخْبَرَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ رَأَى حُلَّةً سِيَرَاءَ مِنْ حَرِيرٍ فَقَالَ يَا رَسُولَ اللَّهِ لَوِ ابْتَعْتَ هَذِهِ الْحُلَّةَ لِلْوَفْدِ وَلِيَوْمِ الْجُمُعَةِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِنَّمَا يَلْبَسُ هَذَا مَنْ لاَ خَلاَقَ لَهُ فِي الآخِرَةِ ‏\"‏ ‏.‏",
    "malay_translation": "“Wahai Rasulullah, mengapa tidak Tuan membeli pakaian dua helai ini (untuk dipakai ketika bertemu) dengan delegasi dan pada hari Jumaat?” Rasulullah (ﷺ) bersabda: “Sesungguhnya, pakaian ini hanya dipakai oleh mereka yang tidak mempunyai bahagian di akhirat.”"
  },
  {
    "id": 33161,
    "hadith_number": 3328,
    "tajuk_hadith": "Kelulusan Memakai Sutera Kerana Penyakit",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "It was\nnarrated from Anas bin Malik that the Messenger of Allah (ﷺ)\ngranted a concession to Zubair bin ‘Awwam and ‘Abdur-Rahman bin\n‘Auf,\nallowing them to wear silk shirts, because of a rash they\nwere\nsuffering from.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، ‏.‏ أَنَّ أَنَسَ بْنَ مَالِكٍ، نَبَّأَهُمْ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ رَخَّصَ لِلزُّبَيْرِ بْنِ الْعَوَّامِ وَلِعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ فِي قَمِيصَيْنِ مِنْ حَرِيرٍ مِنْ وَجَعٍ كَانَ بِهِمَا حِكَّةٍ ‏.‏",
    "malay_translation": "Diriwayatkan daripada Anas bin Malik bahawa Rasulullah (ﷺ) memberikan kelonggaran kepada Zubair bin 'Awwam dan 'Abdur-Rahman bin 'Auf untuk memakai kemeja sutera, kerana mereka mengalami penyakit gatal-gatal pada badan mereka."
  },
  {
    "id": 33162,
    "hadith_number": 3329,
    "tajuk_hadith": "Larangan Menggunakan Sutera (Kecuali Seukuran)",
    "perawi_melayu": "Daripada 'Umar",
    "english_text": "Then he gestured with his finger, then\na\nsecond, and a third, and a fourth (i.e., the width of four fingers),\nand he said: “The Messenger of Allah (ﷺ) used to forbid it.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ عَاصِمٍ، عَنْ أَبِي عُثْمَانَ، عَنْ عُمَرَ، أَنَّهُ كَانَ يَنْهَى عَنِ الْحَرِيرِ، وَالدِّيبَاجِ، إِلاَّ مَا كَانَ هَكَذَا ثُمَّ أَشَارَ بِإِصْبَعِهِ ثُمَّ الثَّانِيَةِ ثُمَّ الثَّالِثَةِ ثُمَّ الرَّابِعَةِ فَقَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَنْهَانَا عَنْهُ ‏.‏",
    "malay_translation": "Kemudian dia memberi isyarat dengan jarinya, kemudian yang kedua, ketiga, dan keempat (iaitu selebar empat jari), lalu dia berkata: “Rasulullah (ﷺ) melarangnya.”"
  },
  {
    "id": 33163,
    "hadith_number": 3330,
    "tajuk_hadith": "Ibn 'Umar Membeli Serban Berhias",
    "perawi_melayu": "Abu ‘Umar, hamba Asma’ yang merdeka",
    "english_text": "“Not Available",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ مُغِيرَةَ بْنِ زِيَادٍ، عَنْ أَبِي عُمَرَ، مَوْلَى أَسْمَاءَ قَالَ رَأَيْتُ ابْنَ عُمَرَ اشْتَرَى عِمَامَةً لَهَا عَلَمٌ فَدَعَا بِالْجَلَمَيْنِ فَقَصَّهُ فَدَخَلْتُ عَلَى أَسْمَاءَ فَذَكَرْتُ ذَلِكَ لَهَا فَقَالَتْ بُؤْسًا لِعَبْدِ اللَّهِ يَا جَارِيَةُ هَاتِي جُبَّةَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ فَجَاءَتْ بِجُبَّةٍ مَكْفُوفَةِ الْكُمَّيْنِ وَالْجَيْبِ وَالْفَرْجَيْنِ بِالدِّيبَاجِ ‏.‏",
    "malay_translation": "Diriwayatkan daripada Abu ‘Umar, hamba Asma’, berkata: \"Aku melihat Ibn ‘Umar membeli serban yang ada tanda. Kemudian, dia meminta sepasang gunting lalu memotong tanda itu. Aku masuk menemui Asma’ lalu menceritakan hal itu kepadanya. Dia berkata: 'Celakalah ‘Abdullah, wahai gadis! Berikan kepadaku jubah Rasulullah (ﷺ).' Lalu dibawa jubah yang berhias dengan brokat pada lengan, leher dan bukaan (di bahagian depan dan belakang)."
  },
  {
    "id": 33164,
    "hadith_number": 3331,
    "tajuk_hadith": "Keharaman Sutera dan Emas untuk Lelaki",
    "perawi_melayu": "Ali bin Abu Talib berkata:",
    "english_text": "“The Messenger of Allah (ﷺ) took hold of\nsome\nsilk in his left hand and some gold in his right, then he raised\nhis\nhands and said: ‘These two are forbidden for the males of my\nnation, and permitted to the females.’”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عَبْدِ الْعَزِيزِ بْنِ أَبِي الصَّعْبَةِ، عَنْ أَبِي الأَفْلَحِ الْهَمْدَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ زُرَيْرٍ الْغَافِقِيِّ، سَمِعْتُهُ يَقُولُ سَمِعْتُ عَلِيَّ بْنَ أَبِي طَالِبٍ، يَقُولُ أَخَذَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ حَرِيرًا بِشِمَالِهِ وَذَهَبًا بِيَمِينِهِ ثُمَّ رَفَعَ بِهِمَا يَدَيْهِ فَقَالَ ‏\n\"‏ إِنَّ هَذَيْنِ حَرَامٌ عَلَى ذُكُورِ أُمَّتِي حِلٌّ لإِنَاثِهِمْ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) mengambil sedikit sutera di tangan kirinya dan sedikit emas di tangan kanannya, kemudian baginda mengangkat kedua tangannya dan bersabda: 'Kedua perkara ini diharamkan ke atas lelaki daripada umatku, dan dihalalkan bagi wanita.'"
  },
  {
    "id": 33165,
    "hadith_number": 3332,
    "tajuk_hadith": "Larangan Memakai Pakaian Sutera untuk Lelaki",
    "perawi_melayu": "Daripada ‘Ali",
    "english_text": "“O\nMessenger of Allah, what should I do with these? Shall I wear them?”\nHe said: “No, rather make them into head-cloths and give them to\nthe\nFatimahs.”**",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ أَبِي فَاخِتَةَ، حَدَّثَنِي هُبَيْرَةُ بْنُ يَرِيمَ، عَنْ عَلِيٍّ، أَنَّهُ أُهْدِيَ لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ حُلَّةٌ مَكْفُوفَةٌ بِحَرِيرٍ إِمَّا سَدَاؤُهَا وَإِمَّا لُحْمَتُهَا فَأَرْسَلَ بِهَا إِلَىَّ فَأَتَيْتُهُ فَقُلْتُ يَا رَسُولَ اللَّهِ مَا أَصْنَعُ بِهَا أَلْبَسُهَا قَالَ ‏\n\"‏ لاَ وَلَكِنِ اجْعَلْهَا خُمُرًا بَيْنَ الْفَوَاطِمِ ‏\"‏ ‏.‏",
    "malay_translation": "Daripada ‘Ali r.a., bahawa Rasulullah ﷺ dihadiahkan sepasang pakaian yang dijahit dengan sutera, sama ada pada benang lungsin atau benang pakan. Baginda ﷺ menghantarnya kepada saya (‘Ali). Saya datang kepada baginda ﷺ dan berkata: “Wahai Rasulullah, apakah yang harus saya lakukan dengan pakaian ini? Patutkah saya memakainya?” Baginda ﷺ bersabda: “Tidak, tetapi jadikanlah ia sebagai kain tudung dan berikan kepada Fatimah.”"
  },
  {
    "id": 33166,
    "hadith_number": 3333,
    "tajuk_hadith": "Keharaman Sutera dan Emas bagi Lelaki",
    "perawi_melayu": "Abdullah bin ‘Umar",
    "english_text": "“The Messenger of Allah (ﷺ) came out to us, and in one of his hands was a garment of silk and in the other was some gold. He said: ‘These are forbidden to the males of my nation and permitted to the females.’”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، عَنِ الإِفْرِيقِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ رَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَفِي إِحْدَى يَدَيْهِ ثَوْبٌ مِنْ حَرِيرٍ وَفِي الأُخْرَى ذَهَبٌ فَقَالَ ‏\n\"‏ إِنَّ هَذَيْنِ مُحَرَّمٌ عَلَى ذُكُورِ أُمَّتِي حِلٌّ لإِنَاثِهِمْ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) keluar menemui kami, dan pada salah satu tangannya terdapat sehelai pakaian daripada sutera dan pada tangan yang lain terdapat sedikit emas. Baginda bersabda: 'Kedua-dua ini diharamkan ke atas lelaki daripada umatku dan dihalalkan bagi wanita.'"
  },
  {
    "id": 33167,
    "hadith_number": 3334,
    "tajuk_hadith": "Zainab binti Rasulullah (ﷺ) Memakai Baju Sutera Siyara'",
    "perawi_melayu": "Anas berkata:",
    "english_text": "“I saw Zainab the daughter of the\nMessenger of Allah (ﷺ) wearing a shirt of Siyara’ silk.*",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسٍ، قَالَ رَأَيْتُ عَلَى زَيْنَبَ بِنْتِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَمِيصَ حَرِيرٍ سِيَرَاءَ ‏.‏",
    "malay_translation": "Daripada Anas, beliau berkata: \"Saya melihat Zainab, anak perempuan Rasulullah (ﷺ) memakai baju daripada sutera Siyara'.\""
  },
  {
    "id": 33168,
    "hadith_number": 3335,
    "tajuk_hadith": "Kecantikan Rasulullah (ﷺ) dan Pakaian Merah",
    "perawi_melayu": "Bara’ berkata:",
    "english_text": "“I never saw anyone more handsome\nthen\nthe Messenger of Allah (ﷺ), with his hair combed, wearing a red\ntwo-piece suit.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ الْقَاضِي، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ مَا رَأَيْتُ أَجْمَلَ مِنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ مُتَرَجِّلاً فِي حُلَّةٍ حَمْرَاءَ ‏.‏",
    "malay_translation": "“Saya tidak pernah melihat sesiapa yang lebih tampan daripada Rasulullah (ﷺ), dengan rambutnya yang tersisir rapi, memakai pakaian dua helai berwarna merah.”"
  },
  {
    "id": 33169,
    "hadith_number": 3336,
    "tajuk_hadith": "Rasulullah SAW Berhenti Khutbah Kerana Kasih Sayang kepada Hasan dan Husain",
    "perawi_melayu": "Abdullah bin Buraidah meriwayatkan bahawa bapanya berkata:",
    "english_text": "I saw the\nMessenger of Allah (ﷺ) delivering a sermon, and Hasan and Husain\ncame forward, wearing red shirts, stumbling and getting up again. The\nProphet (ﷺ) stepped down, picked them up and put them in his lap.\nThen he said: “Allah and His Messenger have spoken the truth. ‘Your\nwealth and your children are only a trial.’  I saw these two\nand I could not be patient. Then he resumed his sermon.”",
    "arabic_text": "حَدَّثَنَا أَبُو عَامِرٍ عَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ بَرَّادِ بْنِ يُوسُفَ بْنِ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى الأَشْعَرِيِّ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، حَدَّثَنَا حُسَيْنُ بْنُ وَاقِدٍ، قَاضِي مَرْوَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، أَنَّ أَبَاهُ، حَدَّثَهُ قَالَ رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَخْطُبُ فَأَقْبَلَ حَسَنٌ وَحُسَيْنٌ عَلَيْهِمَا قَمِيصَانِ أَحْمَرَانِ يَعْثُرَانِ وَيَقُومَانِ فَنَزَلَ النَّبِيُّ ـ صلى الله عليه وسلم ـ فَأَخَذَهُمَا فَوَضَعَهُمَا فِي حِجْرِهِ فَقَالَ ‏\"‏ صَدَقَ اللَّهُ وَرَسُولُهُ ‏{إِنَّمَا أَمْوَالُكُمْ وَأَوْلاَدُكُمْ فِتْنَةٌ}‏ رَأَيْتُ هَذَيْنِ فَلَمْ أَصْبِرْ ‏\"‏ ‏.‏ ثُمَّ أَخَذَ فِي خُطْبَتِهِ ‏.‏",
    "malay_translation": "Saya melihat Rasulullah SAW sedang menyampaikan khutbah, lalu Hasan dan Husain datang, memakai baju merah, tersandung dan bangun semula. Nabi SAW turun, mengambil mereka berdua dan meletakkan mereka di ribaan baginda. Kemudian baginda bersabda: \"Allah dan Rasul-Nya telah berkata benar. 'Sesungguhnya harta dan anak-anakmu hanyalah ujian.’ Saya melihat kedua mereka ini dan saya tidak dapat bersabar.\" Kemudian baginda menyambung khutbahnya."
  },
  {
    "id": 33170,
    "hadith_number": 3337,
    "tajuk_hadith": "Nabi SAW Melarang Al-Mufaddam",
    "perawi_melayu": "Diriwayatkan daripada Ibnu 'Umar radiallahu 'anhuma",
    "english_text": "“The Messenger of Allah (ﷺ)\nforbade Al-Mufaddam.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنِ الْحَسَنِ بْنِ سُهَيْلٍ، عَنِ ابْنِ عُمَرَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ الْمُفَدَّمِ ‏.‏ قَالَ يَزِيدُ قُلْتُ لِلْحَسَنِ مَا الْمُفَدَّمُ قَالَ الْمُشْبَعُ بِالْعُصْفُرِ ‏.‏",
    "malay_translation": "Rasulullah ﷺ melarang Al-Mufaddam.  Kata Yazid: Aku bertanya kepada Al-Hasan, 'Apakah Al-Mufaddam itu?'  Dia menjawab: 'Ia adalah makanan yang dicelupkan dengan safron.'"
  },
  {
    "id": 33171,
    "hadith_number": 3338,
    "tajuk_hadith": "Larangan Memakai Pakaian Berwarna Safflower",
    "perawi_melayu": "Diriwayatkan bahawa ‘Abdullah bin Hunain berkata:",
    "english_text": "“I heard ‘Ali say:\n‘The Messenger of Allah (ﷺ) forbade me – and I do not say that\nhe\nforbade you – from wearing clothes dyed with safflower.’”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، عَنْ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ، قَالَ سَمِعْتُ عَلِيًّا، يَقُولُ نَهَانِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ - وَلاَ أَقُولُ نَهَاكُمْ - عَنْ لُبْسِ الْمُعَصْفَرِ ‏.‏",
    "malay_translation": "“Saya mendengar ‘Ali berkata:\n‘Rasulullah (ﷺ) melarangku – dan saya tidak berkata bahawa baginda melarang kamu – daripada memakai pakaian yang diwarnai dengan safflower.’”"
  },
  {
    "id": 33172,
    "hadith_number": 3339,
    "tajuk_hadith": "Larangan Memakai Pakaian Berwarna Safflower untuk Lelaki dan Kebenaran untuk Wanita",
    "perawi_melayu": "Diriwayatkan dari ‘Amr bin Shu’aib, dari ayahnya, bahwa kakeknya berkata:",
    "english_text": "“We came with the Messenger of Allah (ﷺ) was\nThaniyyat Adhakhir. He turned to me, and I was wearing a thin cloak\ndyed with safflower, and said: ‘What is this?’ And I realized\nthat he\ndisliked it. I came to my family when they were heating their\noven and\nthrew it (in the oven). Then I came to him the following day\nand he\nsaid: ‘O ‘Abdullah, what happened to the thin cloak?’ I\ntold him (what\nI had done) and he said: ‘Why did you not give it to\nsome of your\nfamily to wear, for there is nothing wrong with it for\nwomen.’”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنِ هِشَامِ بْنِ الْغَازِ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ أَقْبَلْنَا مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ مِنْ ثَنِيَّةِ أَذَاخِرَ فَالْتَفَتَ إِلَىَّ وَعَلَىَّ رَيْطَةٌ مُضَرَّجَةٌ بِالْعُصْفُرِ فَقَالَ ‏\"‏ مَا هَذِهِ ‏\"‏ ‏.‏ فَعَرَفْتُ مَا كَرِهَ فَأَتَيْتُ أَهْلِي وَهُمْ يَسْجُرُونَ تَنُّورَهُمْ فَقَذَفْتُهَا فِيهِ ثُمَّ أَتَيْتُهُ مِنَ الْغَدِ فَقَالَ ‏\"‏ يَا عَبْدَ اللَّهِ مَا فَعَلَتِ الرَّيْطَةُ ‏\"‏ ‏.‏ فَأَخْبَرْتُهُ فَقَالَ ‏\"‏ أَلاَ كَسَوْتَهَا بَعْضَ أَهْلِكَ فَإِنَّهُ لاَ بَأْسَ بِذَلِكَ لِلنِّسَاءِ ‏\"‏ ‏.‏",
    "malay_translation": "“Kami bersama Rasulullah (ﷺ) dari Thaniyyat Adhakhir. Baginda berpaling kepada saya, dan saya memakai selendang nipis yang diwarnai dengan bunga safflower, dan baginda berkata: ‘Apakah ini?’ Dan saya sedar bahawa baginda tidak menyukainya. Saya pergi kepada keluarga saya ketika mereka sedang memanaskan ketuhar dan membuangnya (ke dalam ketuhar). Kemudian saya datang kepada baginda pada keesokan harinya dan baginda berkata: ‘Wahai ‘Abdullah, apa yang terjadi pada selendang nipis itu?’ Saya memberitahu baginda (apa yang telah saya lakukan) dan baginda berkata: ‘Mengapa kamu tidak memberikannya kepada sebahagian daripada keluargamu untuk memakainya, kerana tiada salahnya bagi wanita.’”"
  },
  {
    "id": 33173,
    "hadith_number": 3340,
    "tajuk_hadith": "Nabi ﷺ Mandi dan Memakai Selimut Kuning",
    "perawi_melayu": "Qais bin Sa’d",
    "english_text": "“The Prophet (ﷺ) came to\nus\nand we gave him some water with which to cool down. He bathed, then\nI\nbrought him a yellow blanket, and I saw the traces of Wars (the\nyellow dye) on the folds of his stomach.”",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ مُحَمَّدِ بْنِ شُرَحْبِيلَ، عَنْ قَيْسِ بْنِ سَعْدٍ، قَالَ أَتَانَا النَّبِيُّ ـ صلى الله عليه وسلم ـ فَوَضَعْنَا لَهُ مَاءً يَتَبَرَّدُ بِهِ فَاغْتَسَلَ ثُمَّ أَتَيْتُهُ بِمِلْحَفَةٍ صَفْرَاءَ فَرَأَيْتُ أَثَرَ الْوَرْسِ عَلَى عُكَنِهِ ‏.‏",
    "malay_translation": "Daripada Qais bin Sa’d berkata: \"Nabi ﷺ datang kepada kami, lalu kami menyediakan air untuk baginda menyejukkan diri. Baginda mandi, kemudian aku membawa selimut kuning, dan aku melihat kesan Wars (pewarna kuning) pada lipatan perut baginda.\""
  },
  {
    "id": 33174,
    "hadith_number": 3341,
    "tajuk_hadith": "Anjuran Rasulullah (ﷺ) tentang Makan, Minum, Sedekah, dan Berpakaian",
    "perawi_melayu": "Diriwayatkan daripada ‘Amr bin Shu’aib, daripada bapanya, bahawa datuknya berkata:",
    "english_text": "“The Messenger of Allah (ﷺ) said: ‘Eat and\ndrink,\ngive charity and wear clothes, as long as that does not\ninvolve any\nextravagance or vanity.’”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ كُلُوا وَاشْرَبُوا وَتَصَدَّقُوا وَالْبَسُوا مَا لَمْ يُخَالِطْهُ إِسْرَافٌ أَوْ مَخِيلَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda: ‘Makan dan minumlah, bersedekahlah dan berpakaianlah selagi ia tidak disertai pembaziran atau kesombongan.’"
  },
  {
    "id": 33175,
    "hadith_number": 3342,
    "tajuk_hadith": "Hukuman Allah bagi yang Memakai Pakaian Kesombongan",
    "perawi_melayu": "Daripada Ibnu 'Umar berkata:",
    "english_text": "“The Messenger of Allah (ﷺ)\nsaid:\n‘Whoever wears a garment of pride and vanity, Allah will clothe\nhim, on the Day of Resurrection, in a garment of humiliation.’”",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبَادَةَ، وَمُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ الْوَاسِطِيَّانِ، قَالاَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا شَرِيكٌ، عَنْ عُثْمَانَ بْنِ أَبِي زُرْعَةَ، عَنْ مُهَاجِرٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ لَبِسَ ثَوْبَ شُهْرَةٍ أَلْبَسَهُ اللَّهُ يَوْمَ الْقِيَامَةِ ثَوْبَ مَذَلَّةٍ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda: 'Sesiapa yang memakai pakaian kesombongan dan keangkuhan, Allah akan memakaikannya pada Hari Kiamat dengan pakaian kehinaan.'"
  },
  {
    "id": 33176,
    "hadith_number": 3343,
    "tajuk_hadith": "Hukuman Bagi Mereka yang Memakai Pakaian Kesombongan",
    "perawi_melayu": "Diriwayatkan daripada ‘Abdullah bin ‘Umar.",
    "english_text": "“The Messenger of\nAllah\n(ﷺ) said: ‘Whoever wears a garment of pride and vanity in this\nworld, Allah will clothe him in a garment of humiliation on the Day\nof\nResurrection, then set it ablaze.’”",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عُثْمَانَ بْنِ الْمُغِيرَةِ، عَنِ الْمُهَاجِرِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ لَبِسَ ثَوْبَ شُهْرَةٍ فِي الدُّنْيَا أَلْبَسَهُ اللَّهُ ثَوْبَ مَذَلَّةٍ يَوْمَ الْقِيَامَةِ ثُمَّ أَلْهَبَ فِيهِ نَارًا ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda: 'Sesiapa yang memakai pakaian kebanggaan dan kesombongan di dunia ini, Allah akan memakaikan kepadanya pakaian kehinaan pada hari Kiamat, kemudian membakarnya dengan api.'"
  },
  {
    "id": 33177,
    "hadith_number": 3344,
    "tajuk_hadith": "Kesan Memakai Pakaian Kesombongan",
    "perawi_melayu": "Diriwayatkan daripada Abu Dharr bahawa Nabi (ﷺ) bersabda:",
    "english_text": "“Whoever\nwears\na garment of pride and vanity, Allah will turn away from him\nuntil he\ntakes it off.”",
    "arabic_text": "حَدَّثَنَا الْعَبَّاسُ بْنُ يَزِيدَ الْبَحْرَانِيُّ، حَدَّثَنَا وَكِيعُ بْنُ مُحْرِزٍ النَّاجِيُّ، حَدَّثَنَا عُثْمَانُ بْنُ جَهْمٍ، عَنْ زِرِّ بْنِ حُبَيْشٍ، عَنْ أَبِي ذَرٍّ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَنْ لَبِسَ ثَوْبَ شُهْرَةٍ أَعْرَضَ اللَّهُ عَنْهُ حَتَّى يَضَعَهُ مَتَى وَضَعَهُ ‏\"‏ ‏.‏",
    "malay_translation": "“Sesiapa yang memakai pakaian kesombongan dan kebanggaan, Allah akan berpaling daripadanya sehingga dia menanggalkannya.”"
  },
  {
    "id": 33178,
    "hadith_number": 3345,
    "tajuk_hadith": "Kulit yang Disamak Menjadi Suci",
    "perawi_melayu": "Daripada Ibnu Abbas",
    "english_text": "“I heard the Messenger of Allah\n(ﷺ) say: ‘Any skin that has been tanned has been purified.’”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ وَعْلَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ أَيُّمَا إِهَابٍ دُبِغَ فَقَدْ طَهُرَ ‏\"‏ ‏.‏",
    "malay_translation": "Saya mendengar Rasulullah (ﷺ) bersabda: “Mana-mana kulit yang telah disamak, maka ia telah suci.”"
  },
  {
    "id": 33179,
    "hadith_number": 3346,
    "tajuk_hadith": "Manfaat Kulit Haiwan Mati (Selain Untuk Dimakan)",
    "perawi_melayu": "Daripada Maimunah",
    "english_text": "“Why don’t they take\nits\nskin and ten it, and make us of it?” They said: “O Messenger of\nAllah, it is dead meat.”* He said: “It is only unlawful to eat\nit.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، أَنَّ شَاةً، لِمَوْلاَةِ مَيْمُونَةَ مَرَّ بِهَا - يَعْنِي النَّبِيَّ ـ صلى الله عليه وسلم ـ - قَدْ أُعْطِيَتْهَا مِنَ الصَّدَقَةِ مَيْتَةً فَقَالَ ‏\"‏ هَلاَّ أَخَذُوا إِهَابَهَا فَدَبَغُوهُ فَانْتَفَعُوا بِهِ ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّهَا مَيْتَةٌ ‏.‏ قَالَ ‏\"‏ إِنَّمَا حَرُمَ أَكْلُهَا ‏\"‏ ‏.‏",
    "malay_translation": "“Mengapa mereka tidak mengambil kulitnya dan menyamaknya, lalu memanfaatkannya?” Mereka berkata: “Wahai Rasulullah, ia adalah bangkai.” Baginda bersabda: “Hanya memakannya sahaja yang haram.”"
  },
  {
    "id": 33180,
    "hadith_number": 3347,
    "tajuk_hadith": "Manfaat Kulit Kambing yang Mati",
    "perawi_melayu": "Salman berkata:",
    "english_text": "“One of the Mothers of the Believers had a sheep that died. The Messenger of Allah (ﷺ) passed by it and said: ‘It would not have harmed its owners if they had made use of its hide.’”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، عَنْ لَيْثٍ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ سَلْمَانَ، قَالَ كَانَ لِبَعْضِ أُمَّهَاتِ الْمُؤْمِنِينَ شَاةٌ فَمَاتَتْ فَمَرَّ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَلَيْهَا فَقَالَ ‏\n\"‏ مَا ضَرَّ أَهْلَ هَذِهِ لَوِ انْتَفَعُوا بِإِهَابِهَا ‏\"‏ ‏.‏",
    "malay_translation": "Salah seorang daripada Ummahatul Mukminin mempunyai seekor kambing yang mati. Rasulullah (ﷺ) lalu di situ lalu bersabda: ‘Tidak akan memudaratkan pemiliknya jika mereka memanfaatkan kulitnya.’"
  },
  {
    "id": 33181,
    "hadith_number": 3348,
    "tajuk_hadith": "Penggunaan Kulit Haiwan Mati yang Disamak",
    "perawi_melayu": "Diriwayatkan daripada Aishah berkata:",
    "english_text": "“The Messenger of Allah (ﷺ)\ncommanded that use should be made of the skins of dead animals, if\nthey were tanned.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ يَزِيدَ بْنِ قُسَيْطٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ، قَالَتْ أَمَرَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ يُسْتَمْتَعَ بِجُلُودِ الْمَيْتَةِ إِذَا دُبِغَتْ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) memerintahkan supaya menggunakan kulit haiwan yang telah mati, jika ia disamak."
  },
  {
    "id": 33182,
    "hadith_number": 3349,
    "tajuk_hadith": "Larangan Menggunakan Kulit dan Urat Haiwan Mati",
    "perawi_melayu": "Abdullah bin ‘Ukaym",
    "english_text": "“There came to us a\nletter from the Prophet (ﷺ) (saying): ‘No not make use of the\nuntanned skin and sinew of dead animals.’”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الشَّيْبَانِيِّ، ح وَحَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، كُلُّهُمْ عَنِ الْحَكَمِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ عَبْدِ اللَّهِ بْنِ عُكَيْمٍ، قَالَ أَتَانَا كِتَابُ النَّبِيِّ ـ صلى الله عليه وسلم ـ ‏\n\"‏ أَنْ لاَ تَنْتَفِعُوا مِنَ الْمَيْتَةِ بِإِهَابٍ وَلاَ عَصَبٍ ‏\"‏ ‏.‏",
    "malay_translation": "“Telah datang kepada kami surat daripada Nabi (ﷺ) (yang mengatakan): ‘Janganlah kamu menggunakan kulit yang belum disamak dan urat daripada haiwan yang telah mati.’”"
  },
  {
    "id": 33183,
    "hadith_number": 3350,
    "tajuk_hadith": "Bentuk Sandal Nabi (ﷺ)",
    "perawi_melayu": "Abdullah bin Abbas",
    "english_text": "“The sandals of the\nProphet (ﷺ) had two thongs doubled around their straps.”",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، عَنْ عَبْدِ اللَّهِ بْنِ الْعَبَّاسِ، قَالَ كَانَ لِنَعْلِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قِبَالاَنِ مَثْنِيٌّ شِرَاكُهُمَا ‏.‏",
    "malay_translation": "“Sandal Nabi (ﷺ) mempunyai dua tali yang dilipat mengelilingi tali sandalnya.”"
  },
  {
    "id": 33184,
    "hadith_number": 3351,
    "tajuk_hadith": "Sandal Nabi (ﷺ) Mempunyai Dua Tali",
    "perawi_melayu": "Anas berkata:",
    "english_text": "“The sandals of the Prophet (ﷺ) had\ntwo\nthongs.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ هَمَّامٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ كَانَ لِنَعْلِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قِبَالاَنِ ‏.‏",
    "malay_translation": "“Sandal Nabi (ﷺ) mempunyai dua tali.”"
  },
  {
    "id": 33185,
    "hadith_number": 3352,
    "tajuk_hadith": "Memakai dan Menanggalkan Sandal dengan Betul",
    "perawi_melayu": "Diriwayatkan dari Abu Hurairah bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "“When anyone of you puts on his sandals, let him start with the\nright, and when he takes them off, let him start with the left.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِذَا انْتَعَلَ أَحَدُكُمْ فَلْيَبْدَأْ بِالْيُمْنَى وَإِذَا خَلَعَ فَلْيَبْدَأْ بِالْيُسْرَى ‏\"‏ ‏.‏",
    "malay_translation": "“Apabila seseorang daripada kamu memakai sandal, hendaklah dia memulakan dengan kaki kanan, dan apabila dia menanggalkannya, hendaklah dia memulakan dengan kaki kiri.”"
  },
  {
    "id": 33186,
    "hadith_number": 3353,
    "tajuk_hadith": "Larangan Berjalan dengan Satu Selipar atau Stokin",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said;“None of you should walk in one sandal or in one leather sock. Let him take them both off or walk in both of them.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنِ ابْنِ عَجْلاَنَ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ يَمْشِي أَحَدُكُمْ فِي نَعْلٍ وَاحِدٍ وَلاَ خُفٍّ وَاحِدٍ لِيَخْلَعْهُمَا جَمِيعًا أَوْ لِيَمْشِ فِيهِمَا جَمِيعًا ‏\"‏ ‏.‏",
    "malay_translation": "Diriwayatkan daripada Abu Hurairah رضي الله عنه, bahawa Rasulullah ﷺ bersabda: \"Janganlah salah seorang daripada kamu berjalan dengan hanya satu selipar atau satu stokin kulit. Hendaklah dia menanggalkannya kedua-duanya sekali, atau berjalan dengan kedua-duanya sekali.\""
  },
  {
    "id": 33187,
    "hadith_number": 3354,
    "tajuk_hadith": "Larangan Memakai Sandal Sambil Berdiri",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "“The Messenger of Allah (ﷺ)\nforbade putting on sandals whilst standing.”",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ يَنْتَعِلَ الرَّجُلُ قَائِمًا ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) melarang seseorang memakai sandal sambil berdiri."
  },
  {
    "id": 33188,
    "hadith_number": 3355,
    "tajuk_hadith": "Larangan Nabi ﷺ Memakai Sandal Sambil Berdiri",
    "perawi_melayu": "Diriwayatkan daripada Ibnu 'Umar",
    "english_text": "“The Prophet (ﷺ) forbade\nputting\non sandals whilst standing.”",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ نَهَى النَّبِيُّ ـ صلى الله عليه وسلم ـ أَنْ يَنْتَعِلَ الرَّجُلُ قَائِمًا ‏.‏",
    "malay_translation": "Nabi ﷺ melarang seseorang memakai sandal sambil berdiri."
  },
  {
    "id": 33189,
    "hadith_number": 3356,
    "tajuk_hadith": "Hadiah Kasut Khuff dari an-Najashi",
    "perawi_melayu": "Ibn Buraidah daripada bapanya",
    "english_text": "It was\nnarrated from Ibn Buraidah, from his father, that an-Najashi\nsent a\npair of pure black Khuff as a gift to the Prophet (ﷺ) of,\nwhich he\nwore.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا دَلْهَمُ بْنُ صَالِحٍ الْكِنْدِيُّ، عَنْ حُجَيْرِ بْنِ عَبْدِ اللَّهِ الْكِنْدِيِّ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، أَنَّ النَّجَاشِيَّ، أَهْدَى لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ خُفَّيْنِ سَاذَجَيْنِ أَسْوَدَيْنِ فَلَبِسَهُمَا ‏.‏",
    "malay_translation": "Diriwayatkan daripada Ibn Buraidah, daripada bapanya, bahawa an-Najashi menghantar sepasang Khuff hitam yang tulen sebagai hadiah kepada Nabi (ﷺ), yang Baginda memakainya."
  },
  {
    "id": 33190,
    "hadith_number": 3357,
    "tajuk_hadith": "Perbezaan dengan Yahudi dan Nasrani dalam Mewarna Rambut",
    "perawi_melayu": "Diriwayatkan bahawa Abu Hurairah meriwayatkan dari Nabi (ﷺ):",
    "english_text": "“The\nJews and the Christians do not dye (their hair), so differ from\nthem.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، سَمِعَ أَبَا سَلَمَةَ، وَسُلَيْمَانَ بْنَ يَسَارٍ، يُخْبِرَانِ عَنْ أَبِي هُرَيْرَةَ، يَبْلُغُ بِهِ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ إِنَّ الْيَهُودَ وَالنَّصَارَى لاَ يَصْبُغُونَ فَخَالِفُوهُمْ ‏\"‏ ‏.‏",
    "malay_translation": "“Sesungguhnya orang Yahudi dan Nasrani tidak mewarnai (rambut) mereka, maka berbezalah daripada mereka.”"
  },
  {
    "id": 33191,
    "hadith_number": 3358,
    "tajuk_hadith": "Mengubah Uban dengan Inai dan Katam",
    "perawi_melayu": "Diriwayatkan daripada Abu Dharr bahawa Rasulullah (ﷺ) bersabda:",
    "english_text": "“The\nbest things with which you change gray hair are henna and\nKatam.”*",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنِ الأَجْلَحِ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ أَبِي الأَسْوَدِ الدِّيلِيِّ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِنَّ أَحْسَنَ مَا غَيَّرْتُمْ بِهِ الشَّيْبَ الْحِنَّاءُ وَالْكَتَمُ ‏\"‏ ‏.‏",
    "malay_translation": "“Perkara terbaik yang kamu boleh gunakan untuk mengubah uban ialah inai dan Katam.”"
  },
  {
    "id": 33192,
    "hadith_number": 3359,
    "tajuk_hadith": "Rambut Nabi (ﷺ) yang Diwarnai",
    "perawi_melayu": "Diriwayatkan bahawa ‘Uthman bin Mawhab berkata:",
    "english_text": "“I entered upon Umm\nSalamah and she brought out for me a hair of the Messenger of Allah\n(ﷺ), which was dyed with henna and Katam.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا سَلاَّمُ بْنُ أَبِي مُطِيعٍ، عَنْ عُثْمَانَ بْنِ مَوْهَبٍ، قَالَ دَخَلْتُ عَلَى أُمِّ سَلَمَةَ ‏.‏ قَالَ فَأَخْرَجَتْ إِلَىَّ شَعَرًا مِنْ شَعَرِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ مَخْضُوبًا بِالْحِنَّاءِ وَالْكَتَمِ ‏.‏",
    "malay_translation": "Saya masuk menemui Ummu Salamah, lalu dia mengeluarkan kepada saya sehelai rambut daripada rambut Rasulullah (ﷺ), yang telah diwarnai dengan inai dan katam."
  },
  {
    "id": 33193,
    "hadith_number": 3360,
    "tajuk_hadith": "Perintah Menghindari Warna Hitam pada Rambut Abu Quhaifah",
    "perawi_melayu": "Diriwayatkan daripada Jabir bahawa dia berkata:",
    "english_text": "“Abu Quhaifah was brought to\nthe\nProphet (ﷺ) on the Day of the Conquest (of Makkah), and his head\nwas all white. The Messenger of Allah (ﷺ) said: ‘Take him to some\nof\nhis womenfolk and let them change this, but avoid black.’”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ لَيْثٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ جِيءَ بِأَبِي قُحَافَةَ يَوْمَ الْفَتْحِ إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ وَكَأَنَّ رَأْسَهُ ثَغَامَةٌ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ اذْهَبُوا بِهِ إِلَى بَعْضِ نِسَائِهِ فَلْتُغَيِّرْهُ وَجَنِّبُوهُ السَّوَادَ ‏\"‏ ‏.‏",
    "malay_translation": "Abu Quhaifah dibawa kepada Nabi (ﷺ) pada Hari Pembukaan (Makkah), dan kepalanya semuanya putih. Rasulullah (ﷺ) bersabda: 'Bawalah dia kepada sebahagian daripada kaum wanitanya dan biarlah mereka mengubahnya, tetapi hindarilah warna hitam.'"
  },
  {
    "id": 33194,
    "hadith_number": 3361,
    "tajuk_hadith": "Keutamaan Mewarnai Rambut dengan Warna Hitam",
    "perawi_melayu": "Diriwayatkan daripada Suhaib Al-Khair:",
    "english_text": "“The Messenger of Allah\n(ﷺ)\nsaid: ‘The best thing with which you can dye your hair is this\nblack (dye). It makes your women desire you and creates fear in the\nhearts of your enemies.’”",
    "arabic_text": "حَدَّثَنَا أَبُو هُرَيْرَةَ الصَّيْرَفِيُّ، مُحَمَّدُ بْنُ فِرَاسٍ حَدَّثَنَا عُمَرُ بْنُ الْخَطَّابِ بْنِ زَكَرِيَّا الرَّاسِبِيُّ، حَدَّثَنَا دَفَّاعُ بْنُ دَغْفَلٍ السَّدُوسِيُّ، عَنْ عَبْدِ الْحَمِيدِ بْنِ صَيْفِيٍّ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، صُهَيْبِ الْخَيْرِ قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِنَّ أَحْسَنَ مَا اخْتَضَبْتُمْ بِهِ لَهَذَا السَّوَادُ أَرْغَبُ لِنِسَائِكُمْ فِيكُمْ وَأَهْيَبُ لَكُمْ فِي صُدُورِ عَدُوِّكُمْ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda: 'Sebaik-baik perkara yang kamu gunakan untuk mewarnai rambut kamu adalah warna hitam ini. Ia membuat isteri-isteri kamu lebih menyukaimu dan menimbulkan rasa gerun di hati musuh-musuh kamu.'"
  },
  {
    "id": 33195,
    "hadith_number": 3362,
    "tajuk_hadith": "Mewarnai Janggut dengan Wars (Tumbuhan Kuning)",
    "perawi_melayu": "Diriwayatkan dari Sa’eed bin Abu Sa’eed bahawa ‘Ubaid bin Juraij bertanya kepada Ibn ‘Umar:",
    "english_text": "“I see that you dye your beard yellow with\nWars.” Ibn\n‘Umar said: “As for my dyeing of my beard yellow\nwith Wars, I saw the\nMessenger of Allah (ﷺ) dyeing his beard\nyellow.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، أَنَّ عُبَيْدَ بْنَ جُرَيْجٍ، سَأَلَ ابْنَ عُمَرَ قَالَ رَأَيْتُكَ تُصَفِّرُ لِحْيَتَكَ بِالْوَرْسِ فَقَالَ ابْنُ عُمَرَ أَمَّا تَصْفِيرِي لِحْيَتِي فَإِنِّي رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يُصَفِّرُ لِحْيَتَهُ ‏.‏",
    "malay_translation": "“Saya melihat kamu mewarnai janggutmu kuning dengan Wars.” Ibn ‘Umar berkata: “Adapun saya mewarnai janggut saya kuning dengan Wars, saya melihat Rasulullah (ﷺ) mewarnai janggutnya kuning.”"
  },
  {
    "id": 33196,
    "hadith_number": 3363,
    "tajuk_hadith": "Kecantikan Rambut yang Diwarnai",
    "perawi_melayu": "Diriwayatkan daripada Ibn ‘Abbas",
    "english_text": "“The Prophet (ﷺ) passed by a\nman\nwho had dyed his hair with henna and said: ‘How handsome this is!’\nThen he passed by another who had dyed his hair with henna and Katam,\nand said: ‘This one is more handsome than that one.’ Then he\npassed by\nanother who had dyed his hair yellow and said: ‘This one\nis more\nhandsome than all of them.’”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا مُحَمَّدُ بْنُ طَلْحَةَ، عَنْ حُمَيْدِ بْنِ وَهْبٍ، عَنِ ابْنِ طَاوُسٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ مَرَّ النَّبِيُّ ـ صلى الله عليه وسلم ـ عَلَى رَجُلٍ قَدْ خَضَبَ بِالْحِنَّاءِ فَقَالَ ‏\"‏ مَا أَحْسَنَ هَذَا ‏\"‏ ‏.‏ ثُمَّ مَرَّ بِآخَرَ قَدْ خَضَبَ بِالْحِنَّاءِ وَالْكَتَمِ فَقَالَ ‏\"‏ هَذَا أَحْسَنُ مِنْ هَذَا ‏\"‏ ‏.‏ ثُمَّ مَرَّ بِآخَرَ قَدْ خَضَبَ بِالصُّفْرَةِ فَقَالَ ‏\"‏ هَذَا أَحْسَنُ مِنْ هَذَا كُلِّهِ ‏\"‏ ‏.‏ قَالَ وَكَانَ طَاوُسٌ يُصَفِّرُ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) melewati seorang lelaki yang mewarnai rambutnya dengan inai dan bersabda: 'Alangkah eloknya ini!' Kemudian baginda melewati lelaki lain yang mewarnai rambutnya dengan inai dan katam, dan bersabda: 'Yang ini lebih elok daripada yang itu.' Kemudian baginda melewati seorang lagi yang mewarnai rambutnya dengan warna kuning dan bersabda: 'Yang ini lebih elok daripada mereka semua.'"
  },
  {
    "id": 33197,
    "hadith_number": 3364,
    "tajuk_hadith": "Rambut Putih Nabi (ﷺ) di antara Bibir Bawah dan Dagu",
    "perawi_melayu": "Abu Juhaifah",
    "english_text": "“I saw the Messenger of Allah\n(ﷺ), and this part of his hair was white” – meaning the tuft of\nhair\nbetween the lower lip and the chin.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا زُهَيْرٌ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي جُحَيْفَةَ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ هَذِهِ مِنْهُ بَيْضَاءُ ‏.‏ يَعْنِي عَنْفَقَتَهُ ‏.‏",
    "malay_translation": "“Saya melihat Rasulullah (ﷺ), dan bahagian rambut baginda ini berwarna putih” – iaitu jambul rambut di antara bibir bawah dan dagu."
  },
  {
    "id": 33198,
    "hadith_number": 3365,
    "tajuk_hadith": "Nabi ﷺ Tidak Mewarnai Rambut dan Mempunyai Sedikit Uban",
    "perawi_melayu": "Humaid",
    "english_text": "“Anas bin Malik was asked: ‘Did the\nMessenger of Allah (ﷺ) dye his hair?’ He said: ‘He did not have\nany\nwhite hair apart from approximately seventeen or twenty hairs at\nthe\nfront of his beard.’”",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، وَابْنُ أَبِي عَدِيٍّ، عَنْ حُمَيْدٍ، قَالَ سُئِلَ أَنَسُ بْنُ مَالِكٍ أَخَضَبَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ إِنَّهُ لَمْ يَرَ مِنَ الشَّيْبِ إِلاَّ نَحْوَ سَبْعَةَ عَشَرَ أَوْ عِشْرِينَ شَعَرَةً فِي مُقَدَّمِ لِحْيَتِهِ ‏.‏",
    "malay_translation": "Anas bin Malik ditanya: 'Adakah Rasulullah ﷺ mewarnai rambutnya?' Dia berkata: 'Baginda tidak mempunyai uban melainkan kira-kira tujuh belas atau dua puluh helai di bahagian hadapan janggutnya.'"
  },
  {
    "id": 33199,
    "hadith_number": 3366,
    "tajuk_hadith": "Bilangan Uban Rasulullah (ﷺ)",
    "perawi_melayu": "Diriwayatkan daripada Ibnu 'Umar",
    "english_text": "\"Not Available\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ الْوَلِيدِ الْكِنْدِيُّ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ شَرِيكٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ شَيْبُ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ نَحْوَ عِشْرِينَ شَعَرَةً ‏.‏",
    "malay_translation": "“Uban Rasulullah (ﷺ) berjumlah lebih kurang dua puluh helai.”"
  },
  {
    "id": 33200,
    "hadith_number": 3367,
    "tajuk_hadith": "Rasulullah (ﷺ) Memasuki Makkah dengan Empat Jalinan Rambut",
    "perawi_melayu": "Mujahid meriwayatkan dari Umm Hani",
    "english_text": "“Umm Hani said: ‘When the\nMessenger\nof Allah (ﷺ) entered Makkah he had four braids.’”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، قَالَ قَالَتْ أُمُّ هَانِئٍ دَخَلَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ مَكَّةَ وَلَهُ أَرْبَعُ غَدَائِرَ ‏.‏ تَعْنِي ضَفَائِرَ ‏.‏",
    "malay_translation": "Umm Hani berkata: 'Ketika Rasulullah (ﷺ) memasuki Makkah, baginda mempunyai empat jalinan rambut.'"
  },
  {
    "id": 33201,
    "hadith_number": 3368,
    "tajuk_hadith": "Cara Rambut Rasulullah ﷺ",
    "perawi_melayu": "Daripada Ibnu Abbas",
    "english_text": "“The People of the Book used to\nlet their hair hang down, and the idolaters used to part their hair.\nThe Messenger of Allah (ﷺ) liked to be more like the People of the\nBook. So the Messenger of Allah (ﷺ) let his forelock hang down,\nthen\nafter that he parted it.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ أَهْلُ الْكِتَابِ يَسْدُلُونَ أَشْعَارَهُمْ وَكَانَ الْمُشْرِكُونَ يَفْرِقُونَ وَكَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يُحِبُّ مُوَافَقَةَ أَهْلِ الْكِتَابِ ‏.‏ قَالَ فَسَدَلَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ نَاصِيَتَهُ ثُمَّ فَرَقَ بَعْدُ ‏.‏",
    "malay_translation": "“Ahli Kitab dahulu membiarkan rambut mereka terurai, dan orang-orang musyrik membelah rambut mereka. Rasulullah ﷺ suka menyerupai Ahli Kitab. Kemudian Rasulullah ﷺ membiarkan jambul rambutnya terurai, kemudian selepas itu baginda membelahnya.”"
  },
  {
    "id": 33202,
    "hadith_number": 3369,
    "tajuk_hadith": "Cara Rambut Rasulullah (ﷺ)",
    "perawi_melayu": "Aisyah (رَضِيَ ٱللَّٰهُ عَنْهَا)",
    "english_text": "“I used to part the hair of the\nMessenger of Allah (ﷺ) behind his crown, and let his forelock hang\ndown.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ، عَنِ ابْنِ إِسْحَاقَ، عَنْ يَحْيَى بْنِ عَبَّادٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أَفْرِقُ خَلْفَ يَافُوخِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ثُمَّ أَسْدِلُ نَاصِيَتَهُ ‏.‏",
    "malay_translation": "Aisyah (رَضِيَ ٱللَّٰهُ عَنْهَا) berkata: \"Aku pernah membelah rambut Rasulullah (ﷺ) di belakang ubun-ubunnya, dan membiarkan jambulnya terjuntai ke bawah.\""
  },
  {
    "id": 33203,
    "hadith_number": 3370,
    "tajuk_hadith": "Rambut Rasulullah (ﷺ) dan Ciri-cirinya",
    "perawi_melayu": "Diriwayatkan daripada Anas",
    "english_text": "“The hair of the Messenger of Allah\n(ﷺ)\nwas wavy, and (hung down) between his ears and his shoulders.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا جَرِيرُ بْنُ حَازِمٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ كَانَ شَعَرُ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ شَعَرًا رَجِلاً بَيْنَ أُذُنَيْهِ وَمَنْكِبَيْهِ.",
    "malay_translation": "Rambut Rasulullah (ﷺ) adalah berombak, dan (terurai) di antara telinga dan bahu baginda."
  },
  {
    "id": 33204,
    "hadith_number": 3371,
    "tajuk_hadith": "Ciri-ciri Rambut Rasulullah (ﷺ)",
    "perawi_melayu": "Diriwayatkan bahawa ‘Aishah berkata:",
    "english_text": "“The Messenger of Allah (ﷺ) had\nhair that came between his earlobes and his shoulders.”",
    "arabic_text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي الزِّنَادِ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ شَعَرٌ دُونَ الْجُمَّةِ وَفَوْقَ الْوَفْرَةِ.‏",
    "malay_translation": "Rasulullah (ﷺ) mempunyai rambut yang berada di antara cuping telinga dan bahunya."
  },
  {
    "id": 33205,
    "hadith_number": 3372,
    "tajuk_hadith": "Nasihat Nabi (ﷺ) Mengenai Rambut Panjang",
    "perawi_melayu": "Diriwayatkan bahawa Wa’il bin Hujr berkata:",
    "english_text": "“The Prophet (ﷺ) saw me\nwhen\nI had long hair. He said: ‘Bad news, bad news!’ So I went away\nand cut it short. Then the Prophet (ﷺ) saw me and said: ‘I did\nnot\nmean you, but this is better.’”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، وَسُفْيَانُ بْنُ عُقْبَةَ، عَنْ سُفْيَانَ، عَنْ عَاصِمِ بْنِ كُلَيْبٍ، عَنْ أَبِيهِ، عَنْ وَائِلِ بْنِ حُجْرٍ، قَالَ رَآنِيَ النَّبِيُّ ـ صلى الله عليه وسلم ـ وَلِي شَعَرٌ طَوِيلٌ فَقَالَ ‏\"‏ ذُبَابٌ ذُبَابٌ ‏\"‏ ‏.‏ فَانْطَلَقْتُ فَأَخَذْتُهُ فَرَآنِيَ النَّبِيُّ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\"‏ إِنِّي لَمْ أَعْنِكَ وَهَذَا أَحْسَنُ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) melihatku ketika rambutku panjang. Baginda bersabda: ‘Berita buruk, berita buruk!’ Maka aku pun pergi dan memotongnya pendek. Kemudian Rasulullah (ﷺ) melihatku dan bersabda: ‘Aku tidak bermaksud kepadamu, tetapi ini lebih baik.’"
  },
  {
    "id": 33206,
    "hadith_number": 3373,
    "tajuk_hadith": "Larangan Qaza' (Menggundul Sebagian Kepala)",
    "perawi_melayu": "Diriwayatkan daripada Nafi' bahawa Ibn 'Umar berkata:",
    "english_text": "“The Messenger of Allah (ﷺ) forbade Qaza’.” He (Nafi’) said: “What is Qaza’?” He said: “It means shaving part of a child’s head and leaving another part.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ عُمَرَ بْنِ نَافِعٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ نَهَى رَسُولُ اللَّهُ ـ صلى الله عليه وسلم ـ عَنِ الْقَزَعِ ‏.‏ قَالَ وَمَا الْقَزَعُ قَالَ أَنْ يُحْلَقَ مِنْ رَأْسِ الصَّبِيِّ مَكَانٌ وَيُتْرَكَ مَكَانٌ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) melarang Qaza'. Beliau (Nafi') berkata: \"Apakah Qaza' itu?\" Beliau berkata: \"Ianya bermaksud mencukur sebahagian kepala kanak-kanak dan membiarkan sebahagian yang lain.\""
  },
  {
    "id": 33207,
    "hadith_number": 3374,
    "tajuk_hadith": "Larangan Qaza' oleh Rasulullah (ﷺ)",
    "perawi_melayu": "Diriwayatkan daripada Ibnu 'Umar",
    "english_text": "“The Messenger of Allah (ﷺ) forbade Qaza’.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ الْقَزَعِ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) melarang Qaza'."
  },
  {
    "id": 33208,
    "hadith_number": 3375,
    "tajuk_hadith": "Nabi ﷺ Memakai Cincin Perak Bertuliskan Muhammad Rasul Allah",
    "perawi_melayu": "Daripada Ibn ‘Umar",
    "english_text": "“The Messenger of Allah (ﷺ)\nwore\na ring of silver, then he had engraved on it (the words)\n‘Muhammad\nRasul Allah’ (Muhammad the Messenger of Allah). And he said:\n‘No\none should have his ring engraved like this ring of mine.’”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَيُّوبَ بْنِ مُوسَى، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ اتَّخَذَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ خَاتَمًا مِنْ وَرِقٍ ثُمَّ نَقَشَ فِيهِ مُحَمَّدٌ رَسُولُ اللَّهِ فَقَالَ ‏\n\"‏ لاَ يَنْقُشْ أَحَدٌ عَلَى نَقْشِ خَاتَمِي هَذَا ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ memakai cincin perak, kemudian Baginda mengukirkan padanya (perkataan) ‘Muhammad Rasul Allah’ (Muhammad Utusan Allah). Dan Baginda bersabda: ‘Tidaklah seorang pun boleh mengukir cincinnya seperti cincin aku ini.’"
  },
  {
    "id": 33209,
    "hadith_number": 3376,
    "tajuk_hadith": "Rasulullah ﷺ Membuat Cincin dan Larangan Membuat Ukiran Serupa",
    "perawi_melayu": "Anas bin Malik berkata:",
    "english_text": "“The Messenger of Allah\n(ﷺ)\nhad a ring made for him, and he said: ‘I have had a ring made\nfor\nme and had it engraved, and no one should make a ring with similar\nengraving.’”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ اصْطَنَعَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ خَاتَمًا فَقَالَ ‏\n\"‏ إِنَّا قَدِ اصْطَنَعْنَا خَاتَمًا وَنَقَشْنَا فِيهِ نَقْشًا فَلاَ يَنْقُشَنَّ عَلَيْهِ أَحَدٌ ‏\"‏ ‏.‏",
    "malay_translation": "Rasulullah ﷺ membuat cincin untuk dirinya dan baginda bersabda: 'Aku telah membuat cincin untuk diriku dan telah mengukirnya, dan tidak seorang pun boleh membuat cincin dengan ukiran yang serupa.'"
  },
  {
    "id": 33210,
    "hadith_number": 3377,
    "tajuk_hadith": "Ukiran Cincin Rasulullah (ﷺ)",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "‘Muhammad Rasul Allah’ (Muhammad the Messenger of\nAllah).”,",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ اتَّخَذَ خَاتَمًا مِنْ فِضَّةٍ لَهُ فَصٌّ حَبَشِيٌّ وَنَقْشُهُ مُحَمَّدٌ رَسُولُ اللَّهِ ‏.‏",
    "malay_translation": "‘Muhammad Rasul Allah’ (Muhammad utusan Allah)."
  },
  {
    "id": 33211,
    "hadith_number": 3378,
    "tajuk_hadith": "Larangan Memakai Cincin Emas",
    "perawi_melayu": "Diriwayatkan daripada ‘Ali r.a.",
    "english_text": "“The Messenger of Allah (ﷺ) forbade\nwearing gold rings.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعِ بْنِ جُبَيْرٍ، مَوْلَى عَلِيٍّ عَنْ عَلِيٍّ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ التَّخَتُّمِ بِالذَّهَبِ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) melarang memakai cincin emas."
  },
  {
    "id": 33212,
    "hadith_number": 3379,
    "tajuk_hadith": "Larangan Nabi ﷺ tentang Cincin Emas",
    "perawi_melayu": "Diriwayatkan daripada Ibnu 'Umar radhiyallahu 'anhuma:",
    "english_text": "“The Messenger of Allah (ﷺ)\nforbade gold rings.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنِ الْحَسَنِ بْنِ سُهَيْلٍ، عَنِ ابْنِ عُمَرَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ خَاتَمِ الذَّهَبِ ‏.‏",
    "malay_translation": "Rasulullah ﷺ melarang daripada memakai cincin emas."
  },
  {
    "id": 33213,
    "hadith_number": 3380,
    "tajuk_hadith": "Hadiah Cincin Emas Najashi kepada Nabi (ﷺ)",
    "perawi_melayu": "Daripada Aisyah Ummul Mukminin r.a.",
    "english_text": "“Najashi\nsent some jewelry as a gift to the Messenger of Allah (ﷺ).\nAmong\nthat was a gold ring with an Ethiopian gemstone. The Messenger\nof\nAllah (ﷺ) picked it up with a stick – as if he found it\ndistasteful – or with one of his fingers, then he called for his\ndaughter, Umamah bint Abul-‘As, and said: ‘Wear this, O my\ndaughter.’”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ يَحْيَى بْنِ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، قَالَتْ أَهْدَى النَّجَاشِيُّ إِلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ حَلْقَةً فِيهَا خَاتَمُ ذَهَبٍ فِيهِ فَصٌّ حَبَشِيٌّ فَأَخَذَهُ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ بِعُودٍ وَإِنَّهُ لَمُعْرِضٌ عَنْهُ أَوْ بِبَعْضِ أَصَابِعِهِ ثُمَّ دَعَا ابْنَةَ ابْنَتِهِ أُمَامَةَ بِنْتَ أَبِي الْعَاصِ فَقَالَ ‏\n\"‏ تَحَلَّىْ بِهَذَا يَا بُنَيَّةُ ‏\"‏ ‏.‏",
    "malay_translation": "Najashi telah mengirimkan beberapa perhiasan sebagai hadiah kepada Rasulullah (ﷺ). Di antaranya adalah cincin emas dengan batu permata Habsyah. Rasulullah (ﷺ) mengambilnya dengan sebatang kayu – seolah-olah baginda tidak menyukainya – atau dengan salah satu jari baginda, kemudian baginda memanggil cucu perempuannya, Umamah binti Abul-‘As, dan berkata: ‘Pakailah ini, wahai anakku.’"
  },
  {
    "id": 33214,
    "hadith_number": 3381,
    "tajuk_hadith": "Cara Nabi ﷺ Memakai Cincin",
    "perawi_melayu": "Ibnu 'Umar",
    "english_text": "It was\nnarrated from Ibn ‘Umar that the Prophet (ﷺ) used to wear\n(his\nring) with the stone nearest his palm.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَيُّوبَ بْنِ مُوسَى، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ يَجْعَلُ فَصَّ خَاتَمِهِ مِمَّا يَلِي كَفَّهُ ‏.‏",
    "malay_translation": "Diriwayatkan daripada Ibnu 'Umar bahawa Nabi ﷺ biasa memakai cincin dengan batu cincinnya berada paling dekat dengan tapak tangan baginda."
  },
  {
    "id": 33215,
    "hadith_number": 3382,
    "tajuk_hadith": "Nabi (ﷺ) Memakai Cincin Perak Berhiaskan Permata Habsyi",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "It was\nnarrated from Anas bin Malik that the Messenger of Allah (ﷺ)\nwore a\nsilver ring with an Ethiopian gemstone, and he used to ear the\nstone\nin towards his palm.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ يُونُسَ بْنِ يَزِيدَ الأَيْلِيِّ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ لَبِسَ خَاتَمَ فِضَّةٍ فِيهِ فَصٌّ حَبَشِيٌّ كَانَ يَجْعَلُ فَصَّهُ فِي بَطْنِ كَفِّهِ ‏.‏",
    "malay_translation": "Diriwayatkan daripada Anas bin Malik bahawa Rasulullah (ﷺ) memakai cincin perak yang berhiaskan permata Habsyi, dan baginda meletakkan permata tersebut menghadap ke dalam tapak tangan baginda."
  },
  {
    "id": 33216,
    "hadith_number": 3383,
    "tajuk_hadith": "Nabi (ﷺ) Memakai Cincin di Tangan Kanan",
    "perawi_melayu": "Abdullah bin Ja’far",
    "english_text": "It was\nnarrated from ‘Abdullah bin Ja’far that the Prophet (ﷺ) used\nto\nwear a ring on his right hand.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ إِبْرَاهِيمَ بْنِ الْفَضْلِ، عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ يَتَخَتَّمُ فِي يَمِينِهِ ‏.‏",
    "malay_translation": "Diriwayatkan daripada Abdullah bin Ja’far bahawa Nabi (ﷺ) memakai cincin di tangan kanan Baginda."
  },
  {
    "id": 33217,
    "hadith_number": 3384,
    "tajuk_hadith": "Larangan Nabi (ﷺ) Memakai Cincin pada Jari Tertentu",
    "perawi_melayu": "Ali (RA)",
    "english_text": "“The Messenger of Allah (ﷺ) forbade\nme\nto wear a ring on this and on this,” meaning the little finger and\nthe thumb.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ عَاصِمٍ، عَنْ أَبِي بُرْدَةَ، عَنْ عَلِيٍّ، قَالَ نَهَانِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ أَتَخَتَّمَ فِي هَذِهِ وَفِي هَذِهِ يَعْنِي الْخِنْصَرَ وَالإِبْهَامَ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) melarangku memakai cincin pada jari ini dan ini,” iaitu jari kelingking dan ibu jari."
  },
  {
    "id": 33218,
    "hadith_number": 3385,
    "tajuk_hadith": "Malaikat Tidak Memasuki Rumah yang Mengandungi Anjing atau Gambar",
    "perawi_melayu": "Diriwayatkan daripada Abu Talhah bahawa Nabi (ﷺ) bersabda:",
    "english_text": "“Not Available\"",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ أَبِي طَلْحَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لاَ تَدْخُلُ الْمَلاَئِكَةُ بَيْتًا فِيهِ كَلْبٌ وَلاَ صُورَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "Malaikat tidak memasuki rumah yang terdapat anjing atau gambar."
  },
  {
    "id": 33219,
    "hadith_number": 3386,
    "tajuk_hadith": "Malaikat Tidak Memasuki Rumah yang Ada Anjing atau Gambar",
    "perawi_melayu": "Diriwayatkan dari ‘Ali bin Abu Talib bahawa Nabi (ﷺ) bersabda:",
    "english_text": "“The\nangels do not enter a house in which there is a dog or an image.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، عَنْ عَلِيِّ بْنِ مُدْرِكٍ، عَنْ أَبِي زُرْعَةَ، عَنْ عَبْدِ اللَّهِ بْنِ نُجَىٍّ، عَنْ أَبِيهِ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ إِنَّ الْمَلاَئِكَةَ لاَ تَدْخُلُ بَيْتًا فِيهِ كَلْبٌ وَلاَ صُورَةٌ ‏\"‏ ‏.‏",
    "malay_translation": "“Sesungguhnya malaikat tidak memasuki rumah yang di dalamnya terdapat anjing atau gambar.”"
  },
  {
    "id": 33220,
    "hadith_number": 3387,
    "tajuk_hadith": "Malaikat Jibril tidak memasuki rumah yang ada anjing atau gambar",
    "perawi_melayu": "Diriwayatkan daripada ‘Aishah",
    "english_text": "“Jibril (as) promised the\nMessenger\nof Allah (ﷺ) that he would come to him at a certain hour,\nbut he\nwas late. The Prophet (ﷺ) went out and there was Jibril\nstanding at\nthe door. He said: ‘What kept you from entering?’ He said:\n‘There\nis a dog in the house, and we do not enter a house in which\nthere is\na dog or an image.’”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، قَالَتْ وَاعَدَ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ جِبْرِيلُ عَلَيْهِ السَّلاَمُ فِي سَاعَةٍ يَأْتِيهِ فِيهَا فَرَاثَ عَلَيْهِ فَخَرَجَ النَّبِيُّ ـ صلى الله عليه وسلم ـ فَإِذَا هُوَ بِجِبْرِيلَ قَائِمٌ عَلَى الْبَابِ فَقَالَ ‏\n\"‏ مَا مَنَعَكَ أَنْ تَدْخُلَ ‏\"‏ ‏.‏ قَالَ إِنَّ فِي الْبَيْتِ كَلْبًا وَإِنَّا لاَ نَدْخُلُ بَيْتًا فِيهِ كَلْبٌ وَلاَ صُورَةٌ ‏.‏",
    "malay_translation": "Malaikat Jibril عليه السلام berjanji dengan Rasulullah ﷺ pada satu waktu tertentu, tetapi dia terlambat. Nabi ﷺ keluar dan mendapati Jibril berdiri di pintu. Baginda ﷺ bertanya: 'Apakah yang menghalangmu daripada masuk?' Jibril menjawab: 'Sesungguhnya di dalam rumah ada anjing, dan kami tidak memasuki rumah yang ada anjing atau gambar.'"
  },
  {
    "id": 33221,
    "hadith_number": 3388,
    "tajuk_hadith": "Larangan Membuat Gambar Pokok Kurma di Rumah",
    "perawi_melayu": "Abu Umamah",
    "english_text": "It was narrated from Abu Umamah that a woman came to the Prophet\n(ﷺ) and\ntold him that her husband was away on some military\ncampaign. She\nasked him for permission to make an image of a palm tree\nin her\nhouse, and he did not let her, or he forbade her.",
    "arabic_text": "حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ، حَدَّثَنَا الْوَلِيدُ، حَدَّثَنَا عُفَيْرُ بْنُ مَعْدَانَ، حَدَّثَنَا سُلَيْمُ بْنُ عَامِرٍ، عَنْ أَبِي أُمَامَةَ، أَنَّ امْرَأَةً، أَتَتِ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَأَخْبَرَتْهُ أَنَّ زَوْجَهَا فِي بَعْضِ الْمَغَازِي فَاسْتَأْذَنَتْهُ أَنْ تُصَوِّرَ فِي بَيْتِهَا نَخْلَةً فَمَنَعَهَا أَوْ نَهَاهَا ‏.‏",
    "malay_translation": "Diriwayatkan daripada Abu Umamah bahawa seorang wanita datang kepada Nabi (ﷺ) dan memberitahu baginda bahawa suaminya sedang dalam kempen ketenteraan. Wanita itu meminta izin daripada baginda untuk membuat gambar pokok kurma di rumahnya, tetapi baginda tidak mengizinkannya, atau baginda melarangnya."
  },
  {
    "id": 33222,
    "hadith_number": 3389,
    "tajuk_hadith": "Nabi (ﷺ) Merobek Tirai Bergambar",
    "perawi_melayu": "Diriwayatkan daripada ‘Aishah berkata:",
    "english_text": "“Not Available”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ سَتَرْتُ سَهْوَةً لِي - تَعْنِي الدَّاخِلَ - بِسِتْرٍ فِيهِ تَصَاوِيرُ فَلَمَّا قَدِمَ النَّبِيُّ ـ صلى الله عليه وسلم ـ هَتَكَهُ فَجَعَلْتُ مِنْهُ مَنْبُوذَتَيْنِ فَرَأَيْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ مُتَّكِئًا عَلَى إِحْدَاهُمَا ‏.‏",
    "malay_translation": "“Aku menutup sebuah bilik kecil milikku, maksudnya, dari bahagian dalam, dengan sehelai langsir yang mempunyai gambar. Apabila Nabi (ﷺ) datang, baginda merobeknya, lalu aku membuat dua bantal daripadanya, dan aku melihat Nabi (ﷺ) bersandar pada salah satu daripadanya.”"
  },
  {
    "id": 33223,
    "hadith_number": 3390,
    "tajuk_hadith": "Larangan Cincin Emas dan Al-Mitharah (Merah)",
    "perawi_melayu": "Ali RA",
    "english_text": "“The Messenger of Allah (ﷺ) forbade\nrings of gold and Al-Mitharah,”* meaning the red ones.",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، عَنْ هُبَيْرَةَ، عَنْ عَلِيٍّ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ خَاتَمِ الذَّهَبِ وَعَنِ الْمِيثَرَةِ يَعْنِي الْحَمْرَاءَ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) melarang cincin emas dan Al-Mitharah,* iaitu yang berwarna merah."
  },
  {
    "id": 33224,
    "hadith_number": 3391,
    "tajuk_hadith": "Larangan Menunggang Kulit Harimau Bintang",
    "perawi_melayu": "Amir Al-Hajri",
    "english_text": "“I heard Abu Raihanah, the\nCompanion of the Prophet (ﷺ) say: ‘The Prophet (ﷺ) used to\nforbid\nriding on leopard skins.’”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، حَدَّثَنِي عَيَّاشُ بْنُ عَبَّاسٍ الْحِمْيَرِيُّ، عَنْ أَبِي حُصَيْنٍ الْحَجْرِيِّ الْهَيْثَمِ، عَنْ عَامِرٍ الْحَجْرِيِّ، قَالَ سَمِعْتُ أَبَا رَيْحَانَةَ، صَاحِبَ النَّبِيِّ ـ صلى الله عليه وسلم ـ يَقُولُ كَانَ النَّبِيُّ ـ صلى الله عليه وسلم ـ يَنْهَى عَنْ رُكُوبِ النُّمُورِ ‏.‏",
    "malay_translation": "Saya mendengar Abu Raihanah, sahabat Nabi (ﷺ) berkata: 'Nabi (ﷺ) melarang menunggang kulit harimau bintang.'"
  },
  {
    "id": 33225,
    "hadith_number": 3392,
    "tajuk_hadith": "Larangan Menunggang Kulit Harimau Kumbang",
    "perawi_melayu": "Diriwayatkan daripada Mu’awiyah",
    "english_text": "“The Messenger of Allah (ﷺ)\nused\nto forbid riding on leopard skins.”",
    "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ أَبِي الْمُعْتَمِرِ، عَنِ ابْنِ سِيرِينَ، عَنْ مُعَاوِيَةَ، قَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَنْهَى عَنْ رُكُوبِ النُّمُورِ ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) melarang menunggang kulit harimau kumbang."
  }
]