[
  {
    "id": 6662,
    "hadith_number": 6662,
    "tajuk_hadith": "Tafsiran Ayat Mengenai Amalan Syirik",
    "perawi_melayu": "Riwayat Abdullah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ لَمَّا نَزَلَتْ هَذِهِ الآيَةُ ‏{‏الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ‏}‏ شَقَّ ذَلِكَ عَلَى أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَقَالُوا أَيُّنَا لَمْ يَلْبِسْ إِيمَانَهُ بِظُلْمٍ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّهُ لَيْسَ بِذَاكَ، أَلاَ تَسْمَعُونَ إِلَى قَوْلِ لُقْمَانَ ‏{‏إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ‏}‏‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah bin Sa’id, telah menceritakan kepada kami Jarir, dari al-A’masy, dari Ibrahim, dari Alqamah, dari Abdullah r.a., dia berkata:  Apabila ayat ini turun: {الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ} (yang beriman dan tidak mencampurkan iman mereka dengan kezaliman),  perkara itu menyusahkan sahabat-sahabat Nabi SAW, lalu mereka berkata: “Siapakah di antara kami yang tidak mencampurkan imannya dengan kezaliman?” Maka Rasulullah SAW bersabda: “Sesungguhnya ia bukanlah seperti itu. Tidakkah kamu mendengar kata-kata Luqman: {إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ} (Sesungguhnya syirik itu adalah kezaliman yang besar).”"
  },
  {
    "id": 6663,
    "hadith_number": 6663,
    "tajuk_hadith": "Dosa-dosa Besar",
    "perawi_melayu": "Riwayat Abu Bakr",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا الْجُرَيْرِيُّ، وَحَدَّثَنِي قَيْسُ بْنُ حَفْصٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا سَعِيدٌ الْجُرَيْرِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرَةَ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ أَكْبَرُ الْكَبَائِرِ الإِشْرَاكُ بِاللَّهِ، وَعُقُوقُ الْوَالِدَيْنِ، وَشَهَادَةُ الزُّورِ، وَشَهَادَةُ الزُّورِ ـ ثَلاَثًا ـ أَوْ قَوْلُ الزُّورِ ‏\"‏‏.‏ فَمَا زَالَ يُكَرِّرُهَا حَتَّى قُلْنَا لَيْتَهُ سَكَتَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Musaddad, telah menceritakan kepada kami Bishr bin Mufaddal, telah menceritakan kepada kami Al-Jurairi, dan telah menceritakan kepadaku Qais bin Hafs, telah menceritakan kepada kami Ismail bin Ibrahim, telah memberitakan kepada kami Said Al-Jurairi, telah menceritakan kepada kami Abdur Rahman bin Abi Bakrah, daripada bapanya - semoga Allah merahmatinya - katanya, Nabi SAW bersabda:  \"Dosa-dosa besar yang paling besar ialah: Syirik kepada Allah, derhaka kepada ibu bapa, dan memberi keterangan palsu.\" Baginda mengulanginya tiga kali, atau Baginda bersabda:  \"...atau berkata-kata palsu.\"  Baginda terus mengulanginya sehingga kami berkata:  Alangkah baiknya jika Baginda berhenti."
  },
  {
    "id": 6664,
    "hadith_number": 6664,
    "tajuk_hadith": "Dosa-dosa Besar Menurut Nabi SAW",
    "perawi_melayu": "Riwayat Abdullah bin Amr:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ الْحُسَيْنِ بْنِ إِبْرَاهِيمَ، أَخْبَرَنَا عُبَيْدُ اللَّهِ، أَخْبَرَنَا شَيْبَانُ، عَنْ فِرَاسٍ، عَنِ الشَّعْبِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ـ رضى الله عنهما ـ قَالَ جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ مَا الْكَبَائِرُ قَالَ ‏\"‏ الإِشْرَاكُ بِاللَّهِ ‏\"‏‏.‏ قَالَ ثُمَّ مَاذَا قَالَ ‏\"‏ ثُمَّ عُقُوقُ الْوَالِدَيْنِ ‏\"‏‏.‏ قَالَ ثُمَّ مَاذَا قَالَ ‏\"‏ الْيَمِينُ الْغَمُوسُ ‏\"‏‏.‏ قُلْتُ وَمَا الْيَمِينُ الْغَمُوسُ قَالَ ‏\"‏ الَّذِي يَقْتَطِعُ مَالَ امْرِئٍ مُسْلِمٍ هُوَ فِيهَا كَاذِبٌ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Muhammad bin Al-Hussein bin Ibrahim, memberitakan kepada kami Ubaidullah, memberitakan kepada kami Syaiban, dari Firas, dari Asy-Sya’bi, dari Abdullah bin Amr r.a., dia berkata: Seorang Badwi datang kepada Nabi SAW lalu bertanya, \"Wahai Rasulullah, apakah dosa-dosa besar itu?\"  Baginda SAW menjawab, \"Syirik kepada Allah.\" Badwi itu bertanya lagi, \"Kemudian apa?\" Baginda SAW menjawab, \"Kemudian derhaka kepada kedua orang tua.\" Badwi itu bertanya lagi, \"Kemudian apa?\" Baginda SAW menjawab, \"Sumpah yang memudaratkan (Al-Ghamus).\"  Aku bertanya, \"Apakah sumpah yang memudaratkan (Al-Ghamus) itu?\" Baginda SAW menjawab, \"Iaitu sumpah palsu yang dengannya seseorang itu merampas harta seorang Muslim.\" "
  },
  {
    "id": 6665,
    "hadith_number": 6665,
    "tajuk_hadith": "Amat dosa lalu dan pahala kini",
    "perawi_melayu": "Riwayat Ibnu Mas'ud:",
    "english_text": "A man said, \"O Allah's Messenger (ﷺ)! Shall we be punished for what we did in the Prelslamic Period of \nignorance?\" The Prophet (ﷺ) said, \"Whoever does good in Islam will not be punished for what he did in \nthe Pre-lslamic Period of ignorance and whoever does evil in Islam will be punished for his former \nand later (bad deeds).",
    "arabic_text": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، وَالأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنِ ابْنِ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَنُؤَاخَذُ بِمَا عَمِلْنَا فِي الْجَاهِلِيَّةِ قَالَ ‏\n\"‏ مَنْ أَحْسَنَ فِي الإِسْلاَمِ لَمْ يُؤَاخَذْ بِمَا عَمِلَ فِي الْجَاهِلِيَّةِ، وَمَنْ أَسَاءَ فِي الإِسْلاَمِ أُخِذَ بِالأَوَّلِ وَالآخِرِ ‏\"‏‏.‏",
    "malay_translation": "Seorang lelaki bertanya, \"Wahai Rasulullah ﷺ! Adakah kami akan dihukum kerana perbuatan kami pada zaman Jahiliyyah?\"  Rasulullah ﷺ bersabda, \"Sesiapa yang berbuat baik dalam Islam, dia tidak akan dihukum kerana perbuatannya pada zaman Jahiliyyah. Dan sesiapa yang berbuat jahat dalam Islam, dia akan dihukum kerana perbuatannya yang dahulu dan kemudian.\" "
  },
  {
    "id": 6666,
    "hadith_number": 6666,
    "tajuk_hadith": "Ali dan Hukuman terhadap Zanadiqa",
    "perawi_melayu": "Riwayat Ikrima:",
    "english_text": "Some Zanadiqa (atheists) were brought to `Ali and he burnt them. The news of this event, reached Ibn \n`Abbas who said, \"If I had been in his place, I would not have burnt them, as Allah's Messenger (ﷺ) forbade \nit, saying, 'Do not punish anybody with Allah's punishment (fire).' I would have killed them according \nto the statement of Allah's Messenger (ﷺ), 'Whoever changed his Islamic religion, then kill him.'\"",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ، مُحَمَّدُ بْنُ الْفَضْلِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، قَالَ أُتِيَ عَلِيٌّ ـ رضى الله عنه ـ بِزَنَادِقَةٍ فَأَحْرَقَهُمْ فَبَلَغَ ذَلِكَ ابْنَ عَبَّاسٍ فَقَالَ لَوْ كُنْتُ أَنَا لَمْ أُحْرِقْهُمْ لِنَهْىِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلَقَتَلْتُهُمْ لِقَوْلِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ بَدَّلَ دِينَهُ فَاقْتُلُوهُ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'man, Muhammad bin al-Fadl, telah menceritakan kepada kami Hammad bin Zaid, dari Ayyub, dari Ikrimah, katanya: Ali r.a. didatangi oleh sekumpulan zanadiqa (orang-orang ateis), lalu dibakar olehnya. Berita ini sampai kepada Ibnu Abbas, lalu beliau berkata: \"Sekiranya aku berada di tempatnya, aku tidak akan membakar mereka, kerana larangan Rasulullah SAW, yang bersabda:  'Janganlah kamu seksa seseorang dengan azab Allah (neraka).'.  Aku akan membunuh mereka berdasarkan sabda Rasulullah SAW: 'Barangsiapa yang menukar agamanya, maka bunuhlah dia.'"
  },
  {
    "id": 6667,
    "hadith_number": 6667,
    "tajuk_hadith": "Pelantikan, Kemurtadan, dan Solat Malam",
    "perawi_melayu": "Riwayat Abu Burdah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ قُرَّةَ بْنِ خَالِدٍ، حَدَّثَنِي حُمَيْدُ بْنُ هِلاَلٍ، حَدَّثَنَا أَبُو بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ أَقْبَلْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم وَمَعِي رَجُلاَنِ مِنَ الأَشْعَرِيِّينَ، أَحَدُهُمَا عَنْ يَمِينِي، وَالآخَرُ عَنْ يَسَارِي وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَسْتَاكُ فَكِلاَهُمَا سَأَلَ‏.‏ فَقَالَ ‏\"‏ يَا أَبَا مُوسَى ‏\"‏‏.‏ أَوْ ‏\"‏ يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ ‏\"‏‏.‏ قَالَ قُلْتُ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا أَطْلَعَانِي عَلَى مَا فِي أَنْفُسِهِمَا، وَمَا شَعَرْتُ أَنَّهُمَا يَطْلُبَانِ الْعَمَلَ‏.‏ فَكَأَنِّي أَنْظُرُ إِلَى سِوَاكِهِ تَحْتِ شَفَتِهِ قَلَصَتْ فَقَالَ ‏\"‏ لَنْ ـ أَوْ ـ لاَ نَسْتَعْمِلُ عَلَى عَمَلِنَا مَنْ أَرَادَهُ، وَلَكِنِ اذْهَبْ أَنْتَ يَا أَبَا مُوسَى ـ أَوْ يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ ـ إِلَى الْيَمَنِ ‏\"‏‏.‏ ثُمَّ أَتْبَعَهُ مُعَاذُ بْنُ جَبَلٍ، فَلَمَّا قَدِمَ عَلَيْهِ أَلْقَى لَهُ وِسَادَةً قَالَ انْزِلْ، وَإِذَا رَجُلٌ عِنْدَهُ مُوثَقٌ‏.‏ قَالَ مَا هَذَا قَالَ كَانَ يَهُودِيًّا فَأَسْلَمَ ثُمَّ تَهَوَّدَ‏.‏ قَالَ اجْلِسْ‏.‏ قَالَ لاَ أَجْلِسُ حَتَّى يُقْتَلَ‏.‏ قَضَاءُ اللَّهِ وَرَسُولِهِ‏.‏ ثَلاَثَ مَرَّاتٍ، فَأَمَرَ بِهِ فَقُتِلَ، ثُمَّ تَذَاكَرْنَا قِيَامَ اللَّيْلِ، فَقَالَ أَحَدُهُمَا أَمَّا أَنَا فَأَقُومُ وَأَنَامُ، وَأَرْجُو فِي نَوْمَتِي مَا أَرْجُو فِي قَوْمَتِي‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Musaddad, telah menceritakan kepada kami Yahya, dari Qurra bin Khalid, telah menceritakan kepadaku Humaid bin Hilal, telah menceritakan kepada kami Abu Burdah, dari Abu Musa, dia berkata, \"Aku datang kepada Nabi ﷺ bersama dua orang lelaki dari puak Asy'ariyin, seorang di sebelah kananku dan seorang lagi di sebelah kirinya, ketika Rasulullah ﷺ sedang membersihkan giginya (dengan siwak), maka kedua-duanya meminta pekerjaan.  Nabi ﷺ bersabda, 'Wahai Abu Musa!' atau 'Wahai Abdullah bin Qais!'. Aku berkata, Demi Allah yang telah mengutusmu dengan kebenaran, mereka berdua tidak memberitahu aku apa yang ada di hati mereka dan aku tidak menyedari bahawa mereka berdua sedang mencari pekerjaan.  Seakan-akan aku masih melihat siwak baginda di bawah bibirnya, lalu baginda bersabda,  'Kami tidak akan melantik sesiapa yang menginginkan jawatan untuk urusan kami. Tetapi pergilah engkau, wahai Abu Musa! atau wahai Abdullah bin Qais! ke Yaman.' Kemudian Mu'adz bin Jabal menyusulnya, maka setelah sampai kepadanya, dia meletakkan bantal untuknya dan berkata, 'Duduklah'.  Dan di situ ada seorang lelaki yang dibelenggu.  Dia bertanya, 'Siapakah ini?'  Abu Musa berkata, 'Dia adalah seorang Yahudi yang memeluk Islam, kemudian murtad.'  Lalu Abu Musa meminta Mu'adz duduk, tetapi Mu'adz berkata, 'Aku tidak akan duduk sehingga dia dibunuh.  Ini adalah hukuman Allah dan Rasul-Nya.' Tiga kali dia mengulanginya. Maka Abu Musa memerintahkan agar lelaki itu dibunuh, dan dia dibunuh. Kemudian kami berbincang tentang solat malam, maka salah seorang daripada kami berkata, 'Adapun aku, aku bersolat dan tidur, dan aku berharap pahala dalam tidurku seperti dalam solatku.'\""
  },
  {
    "id": 6668,
    "hadith_number": 6668,
    "tajuk_hadith": "Perjuangan Abu Bakar al-Siddiq",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ لَمَّا تُوُفِّيَ النَّبِيُّ صلى الله عليه وسلم وَاسْتُخْلِفَ أَبُو بَكْرٍ، وَكَفَرَ مَنْ كَفَرَ مِنَ الْعَرَبِ، قَالَ عُمَرُ يَا أَبَا بَكْرٍ، كَيْفَ تُقَاتِلُ النَّاسَ، وَقَدْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ فَمَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ عَصَمَ مِنِّي مَالَهُ وَنَفْسَهُ، إِلاَّ بِحَقِّهِ، وَحِسَابُهُ عَلَى اللَّهِ ‏\"‏‏.‏   قَالَ أَبُو بَكْرٍ وَاللَّهِ لأُقَاتِلَنَّ مَنْ فَرَّقَ بَيْنَ الصَّلاَةِ وَالزَّكَاةِ، فَإِنَّ الزَّكَاةَ حَقُّ الْمَالِ، وَاللَّهِ لَوْ مَنَعُونِي عَنَاقًا كَانُوا يُؤَدُّونَهَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم لَقَاتَلْتُهُمْ عَلَى مَنْعِهَا‏.‏ قَالَ عُمَرُ فَوَاللَّهِ مَا هُوَ إِلاَّ أَنْ رَأَيْتُ أَنْ قَدْ شَرَحَ اللَّهُ صَدْرَ أَبِي بَكْرٍ لِلْقِتَالِ فَعَرَفْتُ أَنَّهُ الْحَقُّ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Yahya bin Bukair, telah menceritakan kepada kami Al-Laits, dari Uqail, dari Ibnu Syihab, telah memberitakan kepadaku Ubaidullah bin Abdullah bin Utbah, bahawa Abu Hurairah berkata: \"Apabila Nabi SAW telah wafat dan Abu Bakar telah dilantik sebagai khalifah, dan sesetengah orang Arab telah murtad, Umar berkata: \"Wahai Abu Bakar, bagaimana engkau akan memerangi manusia, sedangkan Rasulullah SAW telah bersabda: 'Aku diperintahkan untuk memerangi manusia sehingga mereka mengatakan: Tiada Tuhan melainkan Allah.  Barangsiapa yang mengatakan: Tiada Tuhan melainkan Allah, maka aku akan memelihara hartanya dan dirinya, kecuali dengan haknya, dan perhitungannya adalah di sisi Allah.'\" Abu Bakar berkata: \"Demi Allah, aku pasti akan memerangi sesiapa yang membezakan antara solat dan zakat, kerana sesungguhnya zakat adalah hak daripada harta. Demi Allah, sekiranya mereka menghalang aku daripada seekor kambing yang mereka dahulu beri kepada Rasulullah SAW, nescaya aku akan memerangi mereka kerana menghalangnya.\" Umar berkata: \"Demi Allah, ini hanyalah kerana aku melihat bahawa Allah telah melapangkan dada Abu Bakar untuk berperang, lalu aku pun tahu bahawa itulah yang benar.\""
  },
  {
    "id": 6669,
    "hadith_number": 6669,
    "tajuk_hadith": "Balas Salam Orang Ahli Kitab",
    "perawi_melayu": "Riwayat Anas bin Malik:",
    "english_text": "A Jew passed by Allah's Messenger (ﷺ) and said, \"As-Samu 'Alaika.\" Allah's Messenger (ﷺ) said in reply, \"We 'Alaika.\" Allah's Messenger (ﷺ) then said to his companions, \"Do you know what he (the Jew) has said? He said, 'As-Samu 'Alaika.'\" They said, \"O Allah's Messenger (ﷺ)! Shall we kill him?\" The Prophet, said, \"No. When the people of the Book greet you, say: 'Wa 'Alaikum.'\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا شُعْبَةُ، عَنْ هِشَامِ بْنِ زَيْدِ بْنِ أَنَسِ بْنِ مَالِكٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ مَرَّ يَهُودِيٌّ بِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ السَّامُ عَلَيْكَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَعَلَيْكَ ‏\"‏‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَدْرُونَ مَا يَقُولُ قَالَ السَّامُ عَلَيْكَ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ أَلاَ نَقْتُلُهُ قَالَ ‏\"‏ لاَ، إِذَا سَلَّمَ عَلَيْكُمْ أَهْلُ الْكِتَابِ فَقُولُوا وَعَلَيْكُمْ ‏\"‏‏.‏",
    "malay_translation": "Seorang Yahudi melewati Rasulullah SAW dan berkata, \"As-Samu 'Alaika.\" Rasulullah SAW membalas, \"Wa 'Alaika.\" Kemudian Rasulullah SAW bertanya kepada para sahabatnya, \"Adakah kamu tahu apa yang dikatakannya? Dia berkata, 'As-Samu 'Alaika.'\" Mereka berkata, \"Wahai Rasulullah SAW! Patutkah kami membunuhnya?\" Nabi SAW bersabda, \"Tidak. Apabila ahli kitab memberi salam kepadamu, maka balaslah dengan, 'Wa 'Alaikum.'\""
  },
  {
    "id": 6670,
    "hadith_number": 6670,
    "tajuk_hadith": "Keramahan Nabi SAW",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "A group of Jews asked permission to visit the Prophet (and when they were admitted) they said, \"As- \nSamu 'Alaika (Death be upon you).\" I said (to them), \"But death and the curse of Allah be upon you!\" \nThe Prophet (ﷺ) said, \"O `Aisha! Allah is kind and lenient and likes that one should be kind and lenient in \nall matters.\" I said, \"Haven't you heard what they said?\" He said, \"I said (to them), 'Wa 'Alaikum (and \nupon you).",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، عَنِ ابْنِ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتِ اسْتَأْذَنَ رَهْطٌ مِنَ الْيَهُودِ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالُوا السَّامُ عَلَيْكَ‏.‏ فَقُلْتُ بَلْ عَلَيْكُمُ السَّامُ وَاللَّعْنَةُ‏.‏ فَقَالَ ‏\"‏ يَا عَائِشَةُ إِنَّ اللَّهَ رَفِيقٌ يُحِبُّ الرِّفْقَ فِي الأَمْرِ كُلِّهِ ‏\"‏‏.‏ قُلْتُ أَوَلَمْ تَسْمَعْ مَا قَالُوا قَالَ ‏\"‏ قُلْتُ وَعَلَيْكُمْ ‏\"‏‏.‏",
    "malay_translation": "Sekawanan orang Yahudi meminta izin untuk melawat Nabi SAW.  Apabila dibenarkan, mereka berkata, \"As-Samu 'Alaika (Semoga mati engkau)\".  Aku (Aisyah) berkata kepada mereka, \"Bahkan, semoga mati dan laknat Allah ke atas kamu!\"  Nabi SAW bersabda, \"Wahai Aisyah, sesungguhnya Allah Maha Lembut, Maha Pengasih dan menyukai kelembutan dalam segala urusan.\"  Aku bertanya, \"Bukankah tuan telah mendengar apa yang mereka katakan?\" Baginda menjawab, \"Aku telah membalas mereka, 'Wa 'Alaikum (dan ke atas kamu juga).'\" "
  },
  {
    "id": 6671,
    "hadith_number": 6671,
    "tajuk_hadith": "Balas Salam Orang Yahudi",
    "perawi_melayu": "Riwayat Ibnu Umar:",
    "english_text": "Allah's Messenger (ﷺ) said, \"When the Jews greet anyone of you they say: 'Sam'Alaika (death be upon you); \nso you should say; 'Wa 'Alaika (and upon you).'\"",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، وَمَالِكِ بْنِ أَنَسٍ، قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ الْيَهُودَ إِذَا سَلَّمُوا عَلَى أَحَدِكُمْ إِنَّمَا يَقُولُونَ سَامٌ عَلَيْكَ‏.‏ فَقُلْ عَلَيْكَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Apabila orang Yahudi memberi salam kepada seseorang di antara kamu, mereka hanya berkata, 'Sam'Alaika' (Semoga kematian menimpa kamu). Maka katakanlah, 'Wa 'Alaika' (Dan juga kepadamu).\""
  },
  {
    "id": 6672,
    "hadith_number": 6672,
    "tajuk_hadith": "Doa Nabi untuk Umatnya yang Menzalimi",
    "perawi_melayu": "Riwayat Abdullah:",
    "english_text": "As if I am looking at the Prophet (ﷺ) while he was speaking about one of the prophets whose people have \nbeaten and wounded him, and he was wiping the blood off his face and saying, \"O Lord! Forgive my, \npeople as they do not know.\"",
    "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي شَقِيقٌ، قَالَ قَالَ عَبْدُ اللَّهِ كَأَنِّي أَنْظُرُ إِلَى النَّبِيِّ صلى الله عليه وسلم يَحْكِي نَبِيًّا مِنَ الأَنْبِيَاءِ ضَرَبَهُ قَوْمُهُ فَأَدْمَوْهُ، فَهْوَ يَمْسَحُ الدَّمَ عَنْ وَجْهِهِ وَيَقُولُ رَبِّ اغْفِرْ لِقَوْمِي، فَإِنَّهُمْ لاَ يَعْلَمُونَ‏.‏",
    "malay_translation": "Seakan-akan aku melihat Nabi SAW sedang menceritakan tentang salah seorang nabi yang telah dipukul dan dianiaya oleh kaumnya sehingga berdarah. Nabi itu sedang menyapu darah di wajahnya sambil berdoa, \"Ya Tuhan, ampunkanlah kaumku kerana mereka tidak mengetahui.\" "
  },
  {
    "id": 6673,
    "hadith_number": 6673,
    "tajuk_hadith": "Mengenai Pemuda Yang Murtad Pada Akhir Zaman",
    "perawi_melayu": "Daripada Ali",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا خَيْثَمَةُ، حَدَّثَنَا سُوَيْدُ بْنُ غَفَلَةَ، قَالَ عَلِيٌّ ـ رضى الله عنه ـ إِذَا حَدَّثْتُكُمْ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم حَدِيثًا فَوَاللَّهِ، لأَنْ أَخِرَّ مِنَ السَّمَاءِ أَحَبُّ إِلَىَّ مِنْ أَنْ أَكْذِبَ عَلَيْهِ، وَإِذَا حَدَّثْتُكُمْ فِيمَا بَيْنِي وَبَيْنَكُمْ فَإِنَّ الْحَرْبَ خَدْعَةٌ، وَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ سَيَخْرُجُ قَوْمٌ فِي آخِرِ الزَّمَانِ، حُدَّاثُ الأَسْنَانِ، سُفَهَاءُ الأَحْلاَمِ، يَقُولُونَ مِنْ خَيْرِ قَوْلِ الْبَرِيَّةِ، لاَ يُجَاوِزُ إِيمَانُهُمْ حَنَاجِرَهُمْ، يَمْرُقُونَ مِنَ الدِّينِ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ، فَأَيْنَمَا لَقِيتُمُوهُمْ فَاقْتُلُوهُمْ، فَإِنَّ فِي قَتْلِهِمْ أَجْرًا لِمَنْ قَتَلَهُمْ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Umar bin Hafs bin Ghiyas, telah menceritakan kepada kami ayahku, telah menceritakan kepada kami Al-A’masy, telah menceritakan kepada kami Khaitsamah, telah menceritakan kepada kami Suwaid bin Ghafilah, bahawa Ali r.a. berkata: “Apabila aku menceritakan kepada kamu sebuah hadis daripada Rasulullah SAW, demi Allah, aku lebih rela jatuh dari langit daripada berdusta terhadap baginda.  Dan jika aku menceritakan sesuatu di antara aku dan kamu (bukan hadis), maka sesungguhnya peperangan itu tipu daya. Dan sesungguhnya aku mendengar Rasulullah SAW bersabda: “Akan keluar segolongan manusia pada akhir zaman, muda-muda,  bodoh fikirannya, mereka berkata perkataan-perkataan yang baik, tetapi iman mereka tidak melepasi kerongkong mereka, mereka keluar daripada agama seperti anak panah keluar dari tempat panahan. Maka di mana sahaja kamu menjumpai mereka, bunuhlah mereka, sesungguhnya dalam membunuh mereka terdapat pahala bagi sesiapa yang membunuhnya pada hari kiamat.”"
  },
  {
    "id": 6674,
    "hadith_number": 6674,
    "tajuk_hadith": "Kemunculan Golongan yang Munafik",
    "perawi_melayu": "Riwayat Abdullah bin Amr bin Yasar:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، وَعَطَاءِ بْنِ يَسَارٍ، أَنَّهُمَا أَتَيَا أَبَا سَعِيدٍ الْخُدْرِيَّ فَسَأَلاَهُ عَنِ الْحَرُورِيَّةِ، أَسَمِعْتَ النَّبِيَّ صلى الله عليه وسلم‏.‏ قَالَ لاَ أَدْرِي مَا الْحَرُورِيَّةُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ يَخْرُجُ فِي هَذِهِ الأُمَّةِ ـ وَلَمْ يَقُلْ مِنْهَا ـ قَوْمٌ تَحْقِرُونَ صَلاَتَكُمْ مَعَ صَلاَتِهِمْ، يَقْرَءُونَ الْقُرْآنَ لاَ يُجَاوِزُ حُلُوقَهُمْ ـ أَوْ حَنَاجِرَهُمْ ـ يَمْرُقُونَ مِنَ الدِّينِ مُرُوقَ السَّهْمِ مِنَ الرَّمِيَّةِ، فَيَنْظُرُ الرَّامِي إِلَى سَهْمِهِ إِلَى نَصْلِهِ إِلَى رِصَافِهِ، فَيَتَمَارَى فِي الْفُوقَةِ، هَلْ عَلِقَ بِهَا مِنَ الدَّمِ شَىْءٌ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Al-Mutsanna, telah menceritakan kepada kami Abd Al-Wahhab, dia berkata; aku mendengar Yahya bin Sa'id berkata; telah memberitakan kepadaku Muhammad bin Ibrahim, dari Abi Salamah dan Atha' bin Yasar, bahawa mereka berdua telah datang kepada Abu Said Al-Khudri lalu bertanya kepadanya tentang Al-Haruriyyah, \"Adakah engkau mendengar Nabi SAW menyebut tentang mereka?\" Abu Said berkata; \"Aku tidak tahu apa itu Al-Haruriyyah, tetapi aku mendengar Nabi SAW bersabda: \"Akan muncul dalam umat ini – dan Baginda tidak berkata: dari kalangan mereka – sekumpulan orang yang sembahyangnya akan membuat kamu memandang rendah sembahyang kamu sendiri, mereka membaca Al-Quran tetapi ia tidak melepasi kerongkong mereka – atau tekak mereka – mereka akan keluar dari agama ini seperti anak panah yang meleset daripada sasaran, lalu si pemanah akan melihat anak panah itu pada mata panah, pada bulu-bulunya dan pada bahagian hujungnya, lalu dia memeriksa pada bahagian hujung anak panah itu adakah ada kesan darah atau tidak.\" "
  },
  {
    "id": 6675,
    "hadith_number": 6675,
    "tajuk_hadith": "Mengenai Al-Haruriyyah dan Kemurtadan",
    "perawi_melayu": "Riwayat Abdullah bin Umar",
    "english_text": "Regarding Al-Harauriyya: The Prophet (ﷺ) said, \"They will go out of Islam as an arrow darts out of the \ngame's body.'",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانُ، حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ حَدَّثَنِي عُمَرُ، أَنَّ أَبَاهُ، حَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ وَذَكَرَ الْحَرُورِيَّةَ ـ فَقَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ يَمْرُقُونَ مِنَ الإِسْلاَمِ مُرُوقَ السَّهْمِ مِنَ الرَّمِيَّةِ ‏\"‏‏.‏",
    "malay_translation": "Daripada Abdullah bin Umar, bahawa Nabi SAW bersabda:  “Mereka akan keluar daripada Islam sebagaimana anak panah keluar daripada badan haiwan buruan.”"
  },
  {
    "id": 6676,
    "hadith_number": 6676,
    "tajuk_hadith": "Keadilan Nabi SAW dan Amaran Mengenai Orang Murtad",
    "perawi_melayu": "Riwayat Abu Sa’id:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ بَيْنَا النَّبِيُّ صلى الله عليه وسلم يَقْسِمُ جَاءَ عَبْدُ اللَّهِ بْنُ ذِي الْخُوَيْصِرَةِ التَّمِيمِيُّ فَقَالَ اعْدِلْ يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ ‏\"‏ وَيْلَكَ مَنْ يَعْدِلُ إِذَا لَمْ أَعْدِلْ ‏\"‏‏.‏ قَالَ عُمَرُ بْنُ الْخَطَّابِ دَعْنِي أَضْرِبْ عُنُقَهُ‏.‏ قَالَ ‏\"‏ دَعْهُ فَإِنَّ لَهُ أَصْحَابًا يَحْقِرُ أَحَدُكُمْ صَلاَتَهُ مَعَ صَلاَتِهِ، وَصِيَامَهُ مَعَ صِيَامِهِ، يَمْرُقُونَ مِنَ الدِّينِ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ، يُنْظَرُ فِي قُذَذِهِ فَلاَ يُوجَدُ فِيهِ شَىْءٌ، يُنْظَرُ فِي نَصْلِهِ فَلاَ يُوجَدُ فِيهِ شَىْءٌ، ثُمَّ يُنْظَرُ فِي رِصَافِهِ فَلاَ يُوجَدُ فِيهِ شَىْءٌ، ثُمَّ يُنْظَرُ فِي نَضِيِّهِ فَلاَ يُوجَدُ فِيهِ شَىْءٌ، قَدْ سَبَقَ الْفَرْثَ وَالدَّمَ، آيَتُهُمْ رَجُلٌ إِحْدَى يَدَيْهِ ـ أَوْ قَالَ ثَدْيَيْهِ ـ مِثْلُ ثَدْىِ الْمَرْأَةِ ـ أَوْ قَالَ مِثْلُ الْبَضْعَةِ ـ تَدَرْدَرُ، يَخْرُجُونَ عَلَى حِينِ فُرْقَةٍ مِنَ النَّاسِ ‏\"‏‏.‏ قَالَ أَبُو سَعِيدٍ أَشْهَدُ سَمِعْتُ مِنَ النَّبِيِّ صلى الله عليه وسلم وَأَشْهَدُ أَنَّ عَلِيًّا قَتَلَهُمْ وَأَنَا مَعَهُ، جِيءَ بِالرَّجُلِ عَلَى النَّعْتِ الَّذِي نَعَتَهُ النَّبِيُّ صلى الله عليه وسلم‏.‏ قَالَ فَنَزَلَتْ فِيهِ ‏{‏وَمِنْهُمْ مَنْ يَلْمِزُكَ فِي الصَّدَقَاتِ‏}‏‏.‏",
    "malay_translation": "Ketika Nabi SAW sedang membahagikan sesuatu, datanglah Abdullah bin Dzil Khuwaisirah At-Tamimi lalu berkata, “Beradiluhlah wahai Rasulullah!”  Nabi SAW bersabda, “Celaka engkau! Siapakah yang akan adil jika aku tidak adil?” Umar bin Al-Khattab berkata, “Benarkan aku memenggal lehernya!” Nabi SAW bersabda, “Biarkanlah dia, kerana dia mempunyai pengikut. Salah seorang di antara kamu akan meremehkan solatnya berbanding solat mereka, dan puasanya berbanding puasa mereka. Mereka akan keluar daripada agama ini sebagaimana anak panah yang meleset daripada sasaran.  Jika kita periksa hujung anak panah itu, kita tidak akan menemui apa-apa, jika kita periksa mata panah itu, kita tidak akan menemui apa-apa, begitu juga jika kita periksa bahagian tengahnya dan bahagian pangkal anak panah, kita tidak akan menemui apa-apa. Anak panah itu terlalu pantas hinggakan najis dan darah tidak sempat melekat padanya. Tanda mereka ialah seorang lelaki yang salah satu tangannya (atau dadanya) seperti dada wanita (atau seperti seketul daging yang bergerak). Mereka akan muncul ketika terdapat perselisihan di kalangan manusia (umat Islam).” Abu Said berkata, “Aku bersaksi bahawa aku mendengarnya daripada Nabi SAW dan aku juga bersaksi bahawa Ali telah membunuh mereka ketika aku bersamanya. Lelaki yang mempunyai ciri-ciri seperti yang digambarkan oleh Nabi SAW telah dibawa kepada Ali.  Ayat-ayat berikut diturunkan berkaitan dengan orang tersebut (iaitu Abdullah bin Dzil Khuwaisirah At-Tamimi):  “Dan di antara mereka ada orang-orang yang mencela kamu tentang sedekah…” (9:58)"
  },
  {
    "id": 6677,
    "hadith_number": 6677,
    "tajuk_hadith": "Kemunculan Khawarij di Iraq",
    "perawi_melayu": "Riwayat Yusair bin `Amr:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الشَّيْبَانِيُّ، حَدَّثَنَا يُسَيْرُ بْنُ عَمْرٍو، قَالَ قُلْتُ لِسَهْلِ بْنِ حُنَيْفٍ هَلْ سَمِعْتَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ فِي الْخَوَارِجِ شَيْئًا قَالَ سَمِعْتُهُ يَقُولُ ـ وَأَهْوَى بِيَدِهِ قِبَلَ الْعِرَاقِ ـ ‏\n\"‏ يَخْرُجُ مِنْهُ قَوْمٌ يَقْرَءُونَ الْقُرْآنَ لاَ يُجَاوِزُ تَرَاقِيَهُمْ، يَمْرُقُونَ مِنَ الإِسْلاَمِ مُرُوقَ السَّهْمِ مِنَ الرَّمِيَّةِ ‏\"‏‏.‏",
    "malay_translation": "Kami diberitakan oleh Musa bin Isma'il, yang diberitakan kepadanya oleh Abd Al-Wahid, yang diberitakan kepadanya oleh Asy-Syaibani, yang diberitakan kepadanya oleh Yusir bin Amr, katanya: Aku bertanya kepada Sahl bin Hunayf, \"Adakah engkau mendengar Rasulullah SAW bersabda tentang Khawarij?\" Dia berkata, \"Aku mendengar Baginda bersabda – sambil Baginda menghala tangan Baginda ke arah Iraq –  \"Akan keluar daripadanya (Iraq) segolongan orang yang membaca al-Quran tetapi ia tidak melepasi kerongkong mereka, mereka keluar daripada Islam sebagaimana anak panah meleset daripada buruan.\""
  },
  {
    "id": 6678,
    "hadith_number": 6678,
    "tajuk_hadith": "Pertempuran Dua Kumpulan Sebelum Kiamat",
    "perawi_melayu": "Dari Abu Hurairah",
    "english_text": "Allah's Messenger (ﷺ) said, \"The Hour will not be established till two (huge) groups fight against each other, \ntheir claim being one and the same.\"",
    "arabic_text": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تَقْتَتِلَ فِئَتَانِ دَعْوَاهُمَا وَاحِدَةٌ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Kiamat tidak akan berlaku sehingga dua kumpulan besar berperang antara satu sama lain, dengan dakwaan mereka adalah sama.\""
  },
  {
    "id": 6679,
    "hadith_number": 6679,
    "tajuk_hadith": "Tujuh Qiraat Al-Quran",
    "perawi_melayu": "Umar bin Al-Khattab berkata:",
    "english_text": "",
    "arabic_text": "قَالَ أَبُو عَبْدِ اللَّهِ وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ الْمِسْوَرَ بْنَ مَخْرَمَةَ، وَعَبْدَ الرَّحْمَنِ بْنَ عَبْدٍ الْقَارِيَّ، أَخْبَرَاهُ أَنَّهُمَا، سَمِعَا عُمَرَ بْنَ الْخَطَّابِ، يَقُولُ سَمِعْتُ هِشَامَ بْنَ حَكِيمٍ، يَقْرَأُ سُورَةَ الْفُرْقَانِ فِي حَيَاةِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَاسْتَمَعْتُ لِقِرَاءَتِهِ، فَإِذَا هُوَ يَقْرَؤُهَا عَلَى حُرُوفٍ كَثِيرَةٍ لَمْ يُقْرِئْنِيهَا رَسُولُ اللَّهِ صلى الله عليه وسلم كَذَلِكَ، فَكِدْتُ أُسَاوِرُهُ فِي الصَّلاَةِ فَانْتَظَرْتُهُ حَتَّى سَلَّمَ، ثُمَّ لَبَّبْتُهُ بِرِدَائِهِ أَوْ بِرِدَائِي فَقُلْتُ مَنْ أَقْرَأَكَ هَذِهِ السُّورَةَ قَالَ أَقْرَأَنِيهَا رَسُولُ اللَّهِ صلى الله عليه وسلم قُلْتُ لَهُ كَذَبْتَ فَوَاللَّهِ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَقْرَأَنِي هَذِهِ السُّورَةَ الَّتِي سَمِعْتُكَ تَقْرَؤُهَا‏.‏ فَانْطَلَقْتُ أَقُودُهُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي سَمِعْتُ هَذَا يَقْرَأُ بِسُورَةِ الْفُرْقَانِ عَلَى حُرُوفٍ لَمْ تُقْرِئْنِيهَا، وَأَنْتَ أَقْرَأْتَنِي سُورَةَ الْفُرْقَانِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَرْسِلْهُ يَا عُمَرُ، اقْرَأْ يَا هِشَامُ ‏\"‏‏.‏ فَقَرَأَ عَلَيْهِ الْقِرَاءَةَ الَّتِي سَمِعْتُهُ يَقْرَؤُهَا‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَكَذَا أُنْزِلَتْ ‏\"‏‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اقْرَأْ يَا عُمَرُ ‏\"‏‏.‏ فَقَرَأْتُ فَقَالَ ‏\"‏ هَكَذَا أُنْزِلَتْ ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ إِنَّ هَذَا الْقُرْآنَ أُنْزِلَ عَلَى سَبْعَةِ أَحْرُفٍ فَاقْرَءُوا مَا تَيَسَّرَ مِنْهُ ‏\"‏‏.‏",
    "malay_translation": "Umar bin al-Khattab meriwayatkan bahawa beliau mendengar Hisyam bin Hakim membaca Surah al-Furqan semasa hayat Rasulullah SAW. Beliau mendengar bacaannya dan mendapati Hisyam membacanya dengan beberapa cara yang berbeza daripada cara yang diajarkan oleh Rasulullah SAW kepadanya.  Umar hampir sahaja mahu menghalangnya ketika solat, tetapi beliau menunggu sehingga Hisyam selesai solat. Kemudian Umar memegang Hisyam dan bertanya, \"Siapakah yang mengajar engkau surah ini?\" Hisyam menjawab, \"Rasulullah SAW yang mengajar saya.\" Umar berkata, \"Engkau berdusta! Demi Allah, Rasulullah SAW telah mengajar saya surah ini yang aku dengar engkau bacakan.\"  Kemudian Umar membawa Hisyam kepada Rasulullah SAW dan berkata, \"Wahai Rasulullah, saya mendengar lelaki ini membaca Surah al-Furqan dengan cara yang berbeza daripada cara yang engkau ajar kepadaku, sedangkan engkau telah mengajar saya Surah al-Furqan.\"  Rasulullah SAW bersabda, \"Lepaskan dia wahai Umar. Bacalah wahai Hisyam.\" Hisyam pun membaca di hadapan Rasulullah SAW dengan cara yang sama seperti yang didengar oleh Umar. Rasulullah SAW bersabda, \"Demikianlah ia diturunkan.\" Kemudian Rasulullah SAW bersabda, \"Bacalah wahai Umar.\" Umar pun membacanya. Rasulullah SAW bersabda, \"Demikianlah ia diturunkan.\"  Kemudian baginda menambah, \"Sesungguhnya al-Quran ini diturunkan dalam tujuh bacaan, maka bacalah cara yang paling mudah bagi kamu.\""
  },
  {
    "id": 6680,
    "hadith_number": 6680,
    "tajuk_hadith": "Tafsir Ayat Tentang Mereka Yang Beriman Dan Tidak Mencampuri Iman Mereka Dengan Kezaliman",
    "perawi_melayu": "Riwayat Abdullah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا وَكِيعٌ، ح حَدَّثَنَا يَحْيَى، حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، رضى الله عنه قَالَ لَمَّا نَزَلَتْ هَذِهِ الآيَةُ ‏{‏الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ‏}‏ شَقَّ ذَلِكَ عَلَى أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَقَالُوا أَيُّنَا لَمْ يَظْلِمْ نَفْسَهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَيْسَ كَمَا تَظُنُّونَ‏.‏ إِنَّمَا هُوَ كَمَا قَالَ لُقْمَانُ لاِبْنِهِ ‏{‏يَا بُنَىَّ لاَ تُشْرِكْ بِاللَّهِ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ‏}‏‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ishaq bin Ibrahim, memberitakan kepada kami Waki', telah menceritakan kepada kami Yahya, telah menceritakan kepada kami Waki' dari al-A'masy, dari Ibrahim, dari Alqamah, dari Abdullah r.a. berkata, \"Apabila ayat ini turun: {الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ} (Mereka yang beriman dan tidak mencampuri iman mereka dengan kezaliman), ia menyukarkan sahabat-sahabat Nabi SAW, lalu mereka berkata: \"Siapakah di antara kami yang tidak pernah menganiaya dirinya sendiri?\" Maka Rasulullah SAW bersabda: \"Bukanlah seperti apa yang kamu sangka.  Ia sepertimana yang dikatakan Luqman kepada anaknya: {يَا بُنَيَّ لَا تُشْرِكْ بِاللَّهِ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ} (Wahai anakku, janganlah kamu mempersekutukan Allah, sesungguhnya syirik itu adalah kezaliman yang besar).\""
  },
  {
    "id": 6681,
    "hadith_number": 6681,
    "tajuk_hadith": "Allah Akan Selamatkan Mereka Yang Mengakui Keesaan Allah",
    "perawi_melayu": "Riwayat Itban bin Malik:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي مَحْمُودُ بْنُ الرَّبِيعِ، قَالَ سَمِعْتُ عِتْبَانَ بْنَ مَالِكٍ، يَقُولُ غَدَا عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ رَجُلٌ أَيْنَ مَالِكُ بْنُ الدُّخْشُنِ فَقَالَ رَجُلٌ مِنَّا ذَلِكَ مُنَافِقٌ لاَ يُحِبُّ اللَّهَ وَرَسُولَهُ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَلاَ تَقُولُوهُ يَقُولُ لاَ إِلَهَ إِلاَّ اللَّهُ يَبْتَغِي‏.‏ بِذَلِكَ وَجْهَ اللَّهِ ‏\"‏‏.‏ قَالَ بَلَى‏.‏ قَالَ ‏\"‏ فَإِنَّهُ لاَ يُوَافَى عَبْدٌ يَوْمَ الْقِيَامَةِ بِهِ إِلاَّ حَرَّمَ اللَّهُ عَلَيْهِ النَّارَ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdān, telah memberitakan kepada kami Abdullah, telah memberitakan kepada kami Ma'mar, dari az-Zuhrī, telah memberitakan kepadaku Mahmūd bin ar-Rabi', dia berkata: aku mendengar Itbān bin Mālik berkata:  Rasulullah SAW bersabda kepadaku di waktu pagi.  Lalu seorang lelaki bertanya: \"Di manakah Mālik bin ad-Dukhsun?\"  Seorang lelaki dari kalangan kami menjawab: \"Dia adalah seorang munafik yang tidak mencintai Allah dan Rasul-Nya.\"  Maka Nabi SAW bersabda: \"Tidakkah kamu fikir bahawa dia mengucapkan: Tiada Tuhan melainkan Allah, semata-mata kerana Allah?\"  Mereka menjawab: \"Ya.\"  Nabi SAW bersabda:  \"Sesungguhnya tidak akan seorang hamba pun menemui Allah pada hari kiamat dengan ucapan itu melainkan Allah mengharamkan neraka ke atasnya.\""
  },
  {
    "id": 6682,
    "hadith_number": 6682,
    "tajuk_hadith": "Kisah Hatib bin Abi Balta'ah dan Surat Rahsia",
    "perawi_melayu": "Daripada riwayat...",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ حُصَيْنٍ، عَنْ فُلاَنٍ، قَالَ تَنَازَعَ أَبُو عَبْدِ الرَّحْمَنِ وَحِبَّانُ بْنُ عَطِيَّةَ فَقَالَ أَبُو عَبْدِ الرَّحْمَنِ لِحِبَّانَ لَقَدْ عَلِمْتُ الَّذِي جَرَّأَ صَاحِبَكَ عَلَى الدِّمَاءِ يَعْنِي عَلِيًّا‏.‏ قَالَ مَا هُوَ لاَ أَبَا لَكَ قَالَ شَىْءٌ سَمِعْتُهُ يَقُولُهُ‏.‏ قَالَ مَا هُوَ قَالَ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَالزُّبَيْرَ وَأَبَا مَرْثَدٍ وَكُلُّنَا فَارِسٌ قَالَ ‏\"‏ انْطَلِقُوا حَتَّى تَأْتُوا رَوْضَةَ حَاجٍ ـ قَالَ أَبُو سَلَمَةَ هَكَذَا قَالَ أَبُو عَوَانَةَ حَاجٍ ـ فَإِنَّ فِيهَا امْرَأَةً مَعَهَا صَحِيفَةٌ مِنْ حَاطِبِ بْنِ أَبِي بَلْتَعَةَ إِلَى الْمُشْرِكِينَ فَأْتُونِي بِهَا ‏\"‏‏.‏ فَانْطَلَقْنَا عَلَى أَفْرَاسِنَا حَتَّى أَدْرَكْنَاهَا حَيْثُ قَالَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم تَسِيرُ عَلَى بَعِيرٍ لَهَا، وَكَانَ كَتَبَ إِلَى أَهْلِ مَكَّةَ بِمَسِيرِ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَيْهِمْ‏.‏ فَقُلْنَا أَيْنَ الْكِتَابُ الَّذِي مَعَكِ قَالَتْ مَا مَعِي كِتَابٌ‏.‏ فَأَنَخْنَا بِهَا بَعِيرَهَا، فَابْتَغَيْنَا فِي رَحْلِهَا فَمَا وَجَدْنَا شَيْئًا‏.‏ فَقَالَ صَاحِبِي مَا نَرَى مَعَهَا كِتَابًا‏.‏ قَالَ فَقُلْتُ لَقَدْ عَلِمْنَا مَا كَذَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ حَلَفَ عَلِيٌّ وَالَّذِي يُحْلَفُ بِهِ لَتُخْرِجِنَّ الْكِتَابَ أَوْ لأُجَرِّدَنَّكِ‏.‏ فَأَهْوَتْ إِلَى حُجْزَتِهَا وَهْىَ مُحْتَجِزَةٌ بِكِسَاءٍ فَأَخْرَجَتِ الصَّحِيفَةَ، فَأَتَوْا بِهَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ قَدْ خَانَ اللَّهَ وَرَسُولَهُ وَالْمُؤْمِنِينَ‏.‏ دَعْنِي فَأَضْرِبَ عُنُقَهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا حَاطِبُ مَا حَمَلَكَ عَلَى مَا صَنَعْتَ ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ مَالِي أَنْ لاَ أَكُونَ مُؤْمِنًا بِاللَّهِ وَرَسُولِهِ، وَلَكِنِّي أَرَدْتُ أَنْ يَكُونَ لِي عِنْدَ الْقَوْمِ يَدٌ، يُدْفَعُ بِهَا عَنْ أَهْلِي وَمَالِي، وَلَيْسَ مِنْ أَصْحَابِكَ أَحَدٌ إِلاَّ لَهُ هُنَالِكَ مِنْ قَوْمِهِ مَنْ يَدْفَعُ اللَّهُ بِهِ عَنْ أَهْلِهِ وَمَالِهِ‏.‏ قَالَ ‏\"‏ صَدَقَ، لاَ تَقُولُوا لَهُ إِلاَّ خَيْرًا ‏\"‏‏.‏ قَالَ فَعَادَ عُمَرُ فَقَالَ يَا رَسُولُ اللَّهِ قَدْ خَانَ اللَّهَ وَرَسُولَهُ وَالْمُؤْمِنِينَ، دَعْنِي فَلأَضْرِبَ عُنُقَهُ‏.‏ قَالَ ‏\"‏ أَوَلَيْسَ مِنْ أَهْلِ بَدْرٍ، وَمَا يُدْرِيكَ لَعَلَّ اللَّهَ اطَّلَعَ عَلَيْهِمْ فَقَالَ اعْمَلُوا مَا شِئْتُمْ فَقَدْ أَوْجَبْتُ لَكُمُ الْجَنَّةَ ‏\"‏‏.‏ فَاغْرَوْرَقَتْ عَيْنَاهُ فَقَالَ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏",
    "malay_translation": "Abu Abdur-Rahman dan Hibban bin Atiyyah berselisih faham. Abu Abdur-Rahman berkata kepada Hibban, \"Sesungguhnya aku tahu apa yang menyebabkan sahabatmu (iaitu Ali) berani menumpahkan darah.\" Hibban berkata, \"Apakah itu?\" Abu Abdur-Rahman berkata, \"Sesuatu yang aku dengar dia katakan.\" Hibban berkata, \"Apakah itu?\" Abu Abdur-Rahman berkata, \"Ali berkata, Rasulullah ﷺ telah mengutus aku, Zubair dan Abu Marthad, dan kami semua adalah penunggang kuda, lalu baginda bersabda, 'Pergilah sehingga kamu sampai ke Raudat Hajj (Abu Salamah berkata bahawa Abu 'Awana menyebutnya demikian, iaitu Hajj di mana terdapat seorang wanita yang membawa sepucuk surat daripada Hatib bin Abi Balta'ah kepada orang-orang musyrik (Mekah). Oleh itu bawalah surat itu kepadaku.' Maka kami berangkat menunggang kuda kami sehingga kami mengejarnya di tempat yang Rasulullah ﷺ telah beritahu kami. Dia sedang berjalan dengan untanya. Dalam surat itu, Hatib telah menulis kepada orang-orang Mekah tentang serangan yang dirancang oleh Rasulullah ﷺ terhadap mereka. Kami bertanya kepadanya, 'Di manakah surat yang ada padamu?' Dia menjawab, 'Aku tidak mempunyai surat.' Maka kami meniarapkan untanya dan menggeledah barang-barangnya, tetapi kami tidak menemui apa-apa. Kedua-dua sahabatku berkata, 'Kami rasa dia tidak mempunyai surat.' Aku berkata, 'Kami tahu bahawa Rasulullah ﷺ tidak berdusta.' Kemudian Ali bersumpah dengan berkata, \"Demi Allah yang Maha Esa, engkau mesti mengeluarkan surat itu atau aku akan menanggalkan pakaianmu.\" Wanita itu kemudian menghulurkan tangannya ke pinggangnya dan mengeluarkan kertas (surat) itu. Mereka membawa surat itu kepada Rasulullah ﷺ. Umar berkata, \"Wahai Rasulullah ﷺ! (Hatib) telah mengkhianati Allah, Rasul-Nya dan orang-orang mukmin; izinkan aku memenggal lehernya!\" Rasulullah ﷺ bersabda, \"Wahai Hatib! Apakah yang mendorongmu melakukan apa yang telah kau lakukan?\" Hatib menjawab, \"Wahai Rasulullah ﷺ! Mengapa (untuk sebab apa) aku tidak patut beriman kepada Allah dan Rasul-Nya? Tetapi aku ingin berbuat baik kepada orang-orang (Mekah) supaya keluargaku dan harta bendaku dilindungi, kerana tiada seorang pun di antara sahabatmu melainkan ada ahli keluarganya (saudara-maranya) yang dilindungi oleh Allah untuk keluarganya dan harta bendanya.\" Nabi ﷺ bersabda, \"Dia telah berkata benar; oleh itu, janganlah kamu katakan apa-apa kepadanya kecuali kebaikan.\" Umar sekali lagi berkata, \"Wahai Rasulullah ﷺ! Dia telah mengkhianati Allah, Rasul-Nya dan orang-orang mukmin; izinkan aku memenggal lehernya!\" Nabi ﷺ bersabda, \"Bukankah dia antara mereka yang berperang di Perang Badar? Dan apakah engkau tahu, mungkin Allah telah melihat mereka (pejuang Badar) dan berfirman (kepada mereka), 'Buatlah apa sahaja yang kamu mahu, kerana Aku telah menjanjikan syurga kepada kamu?'\" Melihat itu, mata Umar bergenang air mata dan dia berkata, \"Allah dan Rasul-Nya lebih mengetahui.\""
  }
]
