[
  {
    "id": 5042,
    "hadith_number": 5042,
    "tajuk_hadith": "Hukum Talak Semasa Haid",
    "perawi_melayu": "Diriwayatkan daripada Abdullah bin Umar",
    "english_text": "that he had divorced his wife while she was menstruating during the lifetime of Allah's Messenger (ﷺ) . \n`Umar bin Al-Khattab asked Allah's Messenger (ﷺ) about that. Allah's Messenger (ﷺ) said, \"Order him (your son) to \ntake her back and keep her till she is clean and then to wait till she gets her next period and becomes \nclean again, whereupon, if he wishes to keep her, he can do so, and if he wishes to divorce her he can \ndivorce her before having sexual intercourse with her; and that is the prescribed period which Allah \nhas fixed for the women meant to be divorced.\"",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّهُ طَلَّقَ امْرَأَتَهُ وَهْىَ حَائِضٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَأَلَ عُمَرُ بْنُ الْخَطَّابِ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مُرْهُ فَلْيُرَاجِعْهَا، ثُمَّ لِيُمْسِكْهَا حَتَّى تَطْهُرَ ثُمَّ تَحِيضَ، ثُمَّ تَطْهُرَ، ثُمَّ إِنْ شَاءَ أَمْسَكَ بَعْدُ وَإِنْ شَاءَ طَلَّقَ قَبْلَ أَنْ يَمَسَّ، فَتِلْكَ الْعِدَّةُ الَّتِي أَمَرَ اللَّهُ أَنْ تُطَلَّقَ لَهَا النِّسَاءُ ‏\"‏‏.‏",
    "malay_translation": "Bahawa dia telah menceraikan isterinya semasa isterinya sedang haid pada zaman Rasulullah ﷺ. Umar bin Al-Khattab bertanya kepada Rasulullah ﷺ tentang perkara itu. Rasulullah ﷺ bersabda, \"Perintahkan dia (anakmu) supaya merujuknya kembali dan memegangnya sehingga dia suci, kemudian tunggu sehingga dia mendapat haid yang berikutnya dan menjadi suci semula, apabila dia ingin menyimpannya, dia boleh berbuat demikian, dan jika dia ingin menceraikannya, dia boleh menceraikannya sebelum melakukan persetubuhan dengannya; dan itulah tempoh yang telah ditetapkan oleh Allah bagi wanita yang ingin diceraikan.\""
  },
  {
    "id": 5043,
    "hadith_number": 5043,
    "tajuk_hadith": "Talak Semasa Haid dan Perintah untuk Merujuk Kembali",
    "perawi_melayu": "Diriwayatkan daripada Anas bin Seereen:",
    "english_text": "Ibn `Umar said: \"I divorced my wife while she was menstruating. `Umar mentioned that to the \nProphet . The Prophet (ﷺ) said, (to my father), \"Let your son take her back.\" I asked (Ibn `Umar), \"Is such \na divorce counted (i.e. as one legal divorce)?\" Ibn `Umar said, \"Of course.\" Narrated Yunus bin \nJubair: Ibn `Umar said, \"The Prophet (ﷺ) said to `Umar, 'Order him (Ibn `Umar) to take her back.' \" I \nasked, \"Is such a divorce counted (as one legal divorce)?\" Ibn `Umar said, \"What do you think if \nsomeone becomes helpless and foolish?\"",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَنَسِ بْنِ سِيرِينَ، قَالَ سَمِعْتُ ابْنَ عُمَرَ، قَالَ طَلَّقَ ابْنُ عُمَرَ امْرَأَتَهُ وَهْىَ حَائِضٌ، فَذَكَرَ عُمَرُ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ لِيُرَاجِعْهَا ‏\"‏‏.‏ قُلْتُ تُحْتَسَبُ قَالَ ‏\"‏ فَمَهْ ‏\"‏‏.‏ وَعَنْ قَتَادَةَ عَنْ يُونُسَ بْنِ جُبَيْرٍ عَنِ ابْنِ عُمَرَ قَالَ ‏\"‏ مُرْهُ فَلْيُرَاجِعْهَا ‏\"‏‏.‏ قُلْتُ تُحْتَسَبُ قَالَ أَرَأَيْتَ إِنْ عَجَزَ وَاسْتَحْمَقَ‏.‏",
    "malay_translation": "Ibn `Umar berkata: \"Saya telah mentalak isteri saya semasa dia sedang haid. `Umar menyebutkan hal itu kepada Nabi ﷺ. Nabi ﷺ bersabda (kepada ayah saya), 'Suruhlah anakmu merujuknya kembali.' Saya bertanya (Ibn `Umar), 'Adakah talak seperti itu dikira (iaitu sebagai satu talak yang sah)?' Ibn `Umar menjawab, 'Sudah tentu.' Diriwayatkan daripada Yunus bin Jubair: Ibn `Umar berkata, 'Nabi ﷺ bersabda kepada `Umar, 'Perintahkan dia (Ibn `Umar) untuk merujuknya kembali.' \" Saya bertanya, 'Adakah talak seperti itu dikira (sebagai satu talak yang sah)?' Ibn `Umar menjawab, 'Bagaimana pendapatmu jika seseorang menjadi lemah dan bodoh?'"
  },
  {
    "id": 5044,
    "hadith_number": 5044,
    "tajuk_hadith": "Talak Semasa Haid Dianggap Satu Talak",
    "perawi_melayu": "Diriwayatkan oleh Ibn `Umar:",
    "english_text": "(Divorcing my wife during her menses) was counted as one legal divorce.",
    "arabic_text": "وَقَالَ أَبُو مَعْمَرٍ حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عُمَرَ، قَالَ حُسِبَتْ عَلَىَّ بِتَطْلِيقَةٍ‏.‏",
    "malay_translation": "Talak isteri semasa haid dikira sebagai satu talak."
  },
  {
    "id": 5045,
    "hadith_number": 5045,
    "tajuk_hadith": "Isteri Nabi (ﷺ) Memohon Perlindungan daripada Baginda",
    "perawi_melayu": "Diriwayatkan oleh Al-Awza",
    "english_text": "I asked Az-Zuhri, \"Which of the wives of the Prophet (ﷺ) sought refuge with Allah from him?\" He said \"I \nwas told by 'Urwa that `Aisha said, 'When the daughter of Al-Jaun was brought to Allah's Messenger (ﷺ) (as \nhis bride) and he went near her, she said, \"I seek refuge with Allah from you.\" He said, \"You have \nsought refuge with The Great; return to your family.\"",
    "arabic_text": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا الْوَلِيدُ، حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ سَأَلْتُ الزُّهْرِيَّ أَىُّ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم اسْتَعَاذَتْ مِنْهُ قَالَ أَخْبَرَنِي عُرْوَةُ عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ ابْنَةَ الْجَوْنِ لَمَّا أُدْخِلَتْ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَدَنَا مِنْهَا قَالَتْ أَعُوذُ بِاللَّهِ مِنْكَ‏.‏ فَقَالَ لَهَا ‏\n\"‏ لَقَدْ عُذْتِ بِعَظِيمٍ، الْحَقِي بِأَهْلِكِ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ رَوَاهُ حَجَّاجُ بْنُ أَبِي مَنِيعٍ عَنْ جَدِّهِ عَنِ الزُّهْرِيِّ أَنَّ عُرْوَةَ أَخْبَرَهُ أَنَّ عَائِشَةَ قَالَتْ‏.‏",
    "malay_translation": "Saya bertanya kepada Az-Zuhri, \"Siapakah daripada isteri-isteri Nabi (ﷺ) yang memohon perlindungan kepada Allah daripada baginda?\" Beliau berkata, \"Saya dimaklumkan oleh 'Urwa bahawa `Aisha berkata, 'Apabila anak perempuan Al-Jaun dibawa kepada Rasulullah (ﷺ) (sebagai isterinya) dan baginda mendekatinya, dia berkata, \"Aku berlindung dengan Allah daripada kamu.\" Baginda berkata, \"Kamu telah memohon perlindungan kepada Yang Maha Agung; kembalilah kepada keluargamu.\""
  },
  {
    "id": 5046,
    "hadith_number": 5046,
    "tajuk_hadith": "Kisah Perkahwinan dengan Wanita dari Bani Jaun",
    "perawi_melayu": "Diriwayatkan oleh Abu Usaid:",
    "english_text": "We went out with the Prophet (ﷺ) to a garden called Ash-Shaut till we reached two walls between which \nwe sat down. The Prophet (ﷺ) said, \"Sit here,\" and went in (the garden). The Jauniyya (a lady from Bani \nJaun) had been brought and lodged in a house in a date-palm garden in the home of Umaima bint An- \nNu`man bin Sharahil, and her wet nurse was with her. When the Prophet (ﷺ) entered upon her, he said to \nher, \"Give me yourself (in marriage) as a gift.\" She said, \"Can a princess give herself in marriage to an \nordinary man?\" The Prophet (ﷺ) raised his hand to pat her so that she might become tranquil. She said, \"I \nseek refuge with Allah from you.\" He said, \"You have sought refuge with One Who gives refuge. \nThen the Prophet (ﷺ) came out to us and said, \"O Abu Usaid! Give her two white linen dresses to wear \nand let her go back to her family.\"",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ غَسِيلٍ، عَنْ حَمْزَةَ بْنِ أَبِي أُسَيْدٍ، عَنْ أَبِي أُسَيْدٍ ـ رضى الله عنه ـ قَالَ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم حَتَّى انْطَلَقْنَا إِلَى حَائِطٍ يُقَالُ لَهُ الشَّوْطُ، حَتَّى انْتَهَيْنَا إِلَى حَائِطَيْنِ فَجَلَسْنَا بَيْنَهُمَا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اجْلِسُوا هَا هُنَا ‏\"‏‏.‏ وَدَخَلَ وَقَدْ أُتِيَ بِالْجَوْنِيَّةِ، فَأُنْزِلَتْ فِي بَيْتٍ فِي نَخْلٍ فِي بَيْتٍ أُمَيْمَةُ بِنْتُ النُّعْمَانِ بْنِ شَرَاحِيلَ وَمَعَهَا دَايَتُهَا حَاضِنَةٌ لَهَا، فَلَمَّا دَخَلَ عَلَيْهَا النَّبِيُّ صلى الله عليه وسلم قَالَ ‏\"‏ هَبِي نَفْسَكِ لِي ‏\"‏‏.‏ قَالَتْ وَهَلْ تَهَبُ الْمَلِكَةُ نَفْسَهَا لِلسُّوقَةِ‏.‏ قَالَ فَأَهْوَى بِيَدِهِ يَضَعُ يَدَهُ عَلَيْهَا لِتَسْكُنَ فَقَالَتْ أَعُوذُ بِاللَّهِ مِنْكَ‏.‏ فَقَالَ ‏\"‏ قَدْ عُذْتِ بِمَعَاذٍ ‏\"‏‏.‏ ثُمَّ خَرَجَ عَلَيْنَا، فَقَالَ ‏\"‏ يَا أَبَا أُسَيْدٍ اكْسُهَا رَازِقِيَّتَيْنِ وَأَلْحِقْهَا بِأَهْلِهَا‏\"‏‏.‏",
    "malay_translation": "Kami keluar bersama Nabi (ﷺ) ke sebuah kebun yang dipanggil Ash-Shaut sehingga kami sampai ke dua dinding tempat kami duduk. Nabi (ﷺ) berkata, \"Duduklah di sini,\" lalu baginda masuk (ke dalam kebun). Al-Jauniyya (seorang wanita dari Bani Jaun) telah dibawa dan ditempatkan di sebuah rumah di kebun kurma di rumah Umaima bint An-Nu`man bin Sharahil, dan pengasuhnya ada bersamanya. Ketika Nabi (ﷺ) menemuinya, baginda berkata kepadanya, \"Berikan dirimu (dalam perkahwinan) kepadaku sebagai hadiah.\" Dia berkata, \"Bolehkah seorang puteri memberikan dirinya dalam perkahwinan kepada lelaki biasa?\" Nabi (ﷺ) mengangkat tangannya untuk mengusapnya supaya dia tenang. Dia berkata, \"Aku berlindung kepada Allah daripada kamu.\" Baginda berkata, \"Kamu telah berlindung kepada Yang Memberi Perlindungan. Kemudian Nabi (ﷺ) keluar kepada kami dan berkata, \"Wahai Abu Usaid! Berikan kepadanya dua helai pakaian linen putih untuk dipakai dan biarkan dia kembali kepada keluarganya.\""
  },
  {
    "id": 5047,
    "hadith_number": 5047,
    "tajuk_hadith": "Perkahwinan Nabi ﷺ dan Umaima binti Sharahil",
    "perawi_melayu": "Sahal dan Abu Usaid",
    "english_text": "The Prophet (ﷺ) married Umaima bint \nSharahil, and when she was brought to him, he stretched his hand towards her. It seemed that she \ndisliked that, whereupon the Prophet (ﷺ) ordered Abu Usaid to prepare her and to provide her with two \nwhite linen dresses.",
    "arabic_text": "وَقَالَ الْحُسَيْنُ بْنُ الْوَلِيدِ النَّيْسَابُورِيُّ عَنْ عَبْدِ الرَّحْمَنِ، عَنْ عَبَّاسِ بْنِ سَهْلٍ، عَنْ أَبِيهِ، وَأَبِي، أُسَيْدٍ قَالاَ تَزَوَّجَ النَّبِيُّ صلى الله عليه وسلم أُمَيْمَةَ بِنْتَ شَرَاحِيلَ، فَلَمَّا أُدْخِلَتْ عَلَيْهِ بَسَطَ يَدَهُ إِلَيْهَا فَكَأَنَّهَا كَرِهَتْ ذَلِكَ فَأَمَرَ أَبَا أُسَيْدٍ أَنْ يُجَهِّزَهَا وَيَكْسُوَهَا ثَوْبَيْنِ رَازِقِيَّيْنِ‏.‏",
    "malay_translation": "Nabi ﷺ berkahwin dengan Umaima binti Sharahil. Apabila dia dibawa kepada baginda, baginda menghulurkan tangan kepada Umaima. Nampaknya dia tidak menyukai tindakan itu, lalu Nabi ﷺ memerintahkan Abu Usaid untuk menyediakan Umaima dan memberinya dua helai pakaian linen putih."
  },
  {
    "id": 5048,
    "hadith_number": 5048,
    "tajuk_hadith": "Perawi Sahl bin Sa`d (Sebagaimana di atas)",
    "perawi_melayu": "Sahih bin Sa`d:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَبِي الْوَزِيرِ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ حَمْزَةَ، عَنْ أَبِيهِ، وَعَنْ عَبَّاسِ بْنِ سَهْلِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، بِهَذَا‏.‏",
    "malay_translation": "Diriwayatkan daripada Sahl bin Sa`d: (Sebagaimana di atas - merujuk kepada Hadith 182). Perawi-perawi: Abdullah bin Muhammad, daripada Ibrahim bin Abi Al-Wazir, daripada Abdur-Rahman, daripada Hamzah, daripada ayahnya, dan daripada Abbas bin Sahl bin Sa`d, daripada ayahnya, dengan ini."
  },
  {
    "id": 5049,
    "hadith_number": 5049,
    "tajuk_hadith": "Talak Semasa Haid dan Arahan Nabi (ﷺ)",
    "perawi_melayu": "Diriwayatkan daripada Abi Ghallab Yunus bin Jubair:",
    "english_text": "I asked Ibn `Umar,\"(What is said regarding) a man divorces his wife during her period?\" He said, \"Do \nyou know Ibn `Umar? Ibn `Umar divorced his wife while she was menstruating. `Umar then went to \nthe Prophet (ﷺ) and mentioned that to him. The Prophet (ﷺ) ordered him to take her back and when she \nbecame clean, he could divorce her if he wanted.\" I asked (Ibn `Umar), \"Was that divorce counted as \none legal divorce?\" He said, \"If one becomes helpless and foolish (will he be excused? Of course \nnot). \"",
    "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى، عَنْ قَتَادَةَ، عَنْ أَبِي غَلاَّبٍ، يُونُسَ بْنِ جُبَيْرٍ قَالَ قُلْتُ لاِبْنِ عُمَرَ رَجُلٌ طَلَّقَ امْرَأَتَهُ وَهْىَ حَائِضٌ‏.‏ فَقَالَ تَعْرِفُ ابْنَ عُمَرَ إِنَّ ابْنَ عُمَرَ طَلَّقَ امْرَأَتَهُ وَهْىَ حَائِضٌ فَأَتَى عُمَرُ النَّبِيَّ صلى الله عليه وسلم فَذَكَرَ ذَلِكَ لَهُ فَأَمَرَهُ أَنْ يُرَاجِعَهَا فَإِذَا طَهُرَتْ فَأَرَادَ أَنْ يُطَلِّقَهَا فَلْيُطَلِّقْهَا، قُلْتُ فَهَلْ عَدَّ ذَلِكَ طَلاَقًا قَالَ أَرَأَيْتَ إِنْ عَجَزَ وَاسْتَحْمَقَ‏.‏",
    "malay_translation": "Saya bertanya kepada Ibnu Umar, \"(Apakah pendapat mengenai) seorang lelaki menceraikan isterinya semasa haid?\" Beliau berkata, \"Adakah kamu mengenali Ibnu Umar? Ibnu Umar menceraikan isterinya semasa dia sedang haid. Umar kemudiannya pergi kepada Nabi (ﷺ) dan memberitahunya tentang hal itu. Nabi (ﷺ) memerintahkannya agar merujuk semula isterinya, dan apabila isterinya telah suci, dia boleh menceraikannya jika dia mahu.\" Saya bertanya (kepada Ibnu Umar), \"Adakah talak itu dikira sebagai satu talak yang sah?\" Beliau berkata, \"Jika seseorang menjadi tidak berdaya dan bodoh (adakah dia dimaafkan? Sudah tentu tidak).\""
  },
  {
    "id": 5050,
    "hadith_number": 5050,
    "tajuk_hadith": "Hukum Lian dan Talak dalam Kes Perselingkuhan",
    "perawi_melayu": "Diriwayatkan oleh Sahl bin Sa`d As-Sa`idi:",
    "english_text": "Uwaimir Al-`Ajlani came to `Asim bin Adi Al-Ansari and asked, \"O `Asim! Tell me, if a man sees his \nwife with another man, should he kill him, whereupon you would kill him in Qisas, or what should he \ndo? O `Asim! Please ask Allah's Messenger (ﷺ) about that.\" `Asim asked Allah's Messenger (ﷺ) about that. Allah's \nApostle disliked that question and considered it disgraceful. What `Asim heard from Allah's Messenger (ﷺ) \nwas hard on him. When he returned to his family, 'Uwaimir came to him and said \"O `Asim! What did \nAllah's Messenger (ﷺ) say to you?\" `Asim said, \"You never bring me any good. Allah's Messenger (ﷺ) disliked to \nhear the problem which I asked him about.\" 'Uwaimir said, \"By Allah, I will not leave the matter till I \nask him about it.\" So 'Uwaimir proceeded till he came to Allah's Messenger (ﷺ) who was in the midst of the \npeople and said, \"O Allah's Messenger (ﷺ)! If a man finds with his wife another man, should he kill him, \nwhereupon you would kill him (in Qisas): or otherwise, what should he do?\" Allah's Messenger (ﷺ) said, \n\"Allah has revealed something concerning the question of you and your wife. Go and bring her here.\" \nSo they both carried out the judgment of Lian, while I was present among the people (as a witness). \nWhen both of them had finished, 'Uwaimir said, \"O Allah's Messenger (ﷺ)! If I should now keep my wife \nwith me, then I have told a lie\". Then he pronounced his decision to divorce her thrice before Allah's \nApostle ordered him to do so. (Ibn Shihab said, \"That was the tradition for all those who are involved \nin a case of Lian.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، أَنَّ سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ، أَخْبَرَهُ أَنَّ عُوَيْمِرًا الْعَجْلاَنِيَّ جَاءَ إِلَى عَاصِمِ بْنِ عَدِيٍّ الأَنْصَارِيِّ، فَقَالَ لَهُ يَا عَاصِمُ أَرَأَيْتَ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً، أَيَقْتُلُهُ فَتَقْتُلُونَهُ، أَمْ كَيْفَ يَفْعَلُ سَلْ لِي يَا عَاصِمُ عَنْ ذَلِكَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَسَأَلَ عَاصِمٌ عَنْ ذَلِكَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَكَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَسَائِلَ وَعَابَهَا حَتَّى كَبُرَ عَلَى عَاصِمٍ مَا سَمِعَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا رَجَعَ عَاصِمٌ إِلَى أَهْلِهِ جَاءَ عُوَيْمِرٌ فَقَالَ يَا عَاصِمُ مَاذَا قَالَ لَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ عَاصِمٌ لَمْ تَأْتِنِي بِخَيْرٍ، قَدْ كَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَسْأَلَةَ الَّتِي سَأَلْتُهُ عَنْهَا‏.‏ قَالَ عُوَيْمِرٌ وَاللَّهِ لاَ أَنْتَهِي حَتَّى أَسْأَلَهُ عَنْهَا فَأَقْبَلَ عُوَيْمِرٌ حَتَّى أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم وَسَطَ النَّاسِ فَقَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً، أَيَقْتُلُهُ فَتَقْتُلُونَهُ، أَمْ كَيْفَ يَفْعَلُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ قَدْ أَنْزَلَ اللَّهُ فِيكَ وَفِي صَاحِبَتِكَ فَاذْهَبْ فَأْتِ بِهَا ‏\"‏‏.‏ قَالَ سَهْلٌ فَتَلاَعَنَا وَأَنَا مَعَ النَّاسِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا فَرَغَا قَالَ عُوَيْمِرٌ كَذَبْتُ عَلَيْهَا يَا رَسُولَ اللَّهِ، إِنْ أَمْسَكْتُهَا، فَطَلَّقَهَا ثَلاَثًا قَبْلَ أَنْ يَأْمُرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَ ابْنُ شِهَابٍ فَكَانَتْ تِلْكَ سُنَّةُ الْمُتَلاَعِنَيْنِ‏.‏",
    "malay_translation": "Uwaimir Al-`Ajlani datang kepada `Asim bin Adi Al-Ansari dan bertanya, \"Wahai `Asim! Beritahu saya, jika seorang lelaki melihat isterinya bersama lelaki lain, patutkah dia membunuhnya, yang mana kamu akan membunuhnya dalam Qisas, atau apa yang patut dia lakukan? Wahai `Asim! Sila tanya Rasulullah (ﷺ) tentang itu.\" `Asim bertanya kepada Rasulullah (ﷺ) tentang itu. Rasulullah (ﷺ) tidak menyukai soalan itu dan menganggapnya memalukan. Apa yang `Asim dengar daripada Rasulullah (ﷺ) adalah berat baginya. Apabila dia kembali kepada keluarganya, 'Uwaimir datang kepadanya dan berkata \"Wahai `Asim! Apa yang Rasulullah (ﷺ) katakan kepada kamu?\" `Asim berkata, \"Kamu tidak pernah membawa sebarang kebaikan kepadaku. Rasulullah (ﷺ) tidak suka mendengar masalah yang saya tanya kepadanya.\" 'Uwaimir berkata, \"Demi Allah, saya tidak akan meninggalkan perkara itu sehingga saya bertanya kepadanya tentangnya.\" Jadi 'Uwaimir terus pergi sehingga dia datang kepada Rasulullah (ﷺ) yang berada di tengah-tengah orang ramai dan berkata, \"Wahai Rasulullah (ﷺ)! Jika seorang lelaki mendapati isterinya bersama lelaki lain, patutkah dia membunuhnya, yang mana kamu akan membunuhnya (dalam Qisas): atau sebaliknya, apa yang patut dia lakukan?\" Rasulullah (ﷺ) berkata, \"Allah telah menurunkan sesuatu mengenai soalan kamu dan isteri kamu. Pergi dan bawalah dia ke sini.\" Kemudian mereka berdua melaksanakan hukuman Lian, sementara saya hadir di kalangan orang ramai (sebagai saksi). Apabila mereka berdua telah selesai, 'Uwaimir berkata, \"Wahai Rasulullah (ﷺ)! Jika saya sekarang menjaga isteri saya dengan saya, maka saya telah berkata bohong\". Kemudian dia mengisytiharkan keputusannya untuk menceraikannya tiga kali sebelum Rasulullah (ﷺ) memerintahkannya berbuat demikian. (Ibn Shihab berkata, \"Itu adalah tradisi bagi semua orang yang terlibat dalam kes Lian.\""
  },
  {
    "id": 5051,
    "hadith_number": 5051,
    "tajuk_hadith": "Hukum Kembali ke Suami Pertama Selepas Perceraian",
    "perawi_melayu": "Daripada `Aisha:",
    "english_text": "The wife of Rifa`a Al-Qurazi came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Rifa`a divorced \nme irrevocably. After him I married `Abdur-Rahman bin Az-Zubair Al-Qurazi who proved to be \nimpotent.\" Allah's Messenger (ﷺ) said to her, \"Perhaps you want to return to Rifa`a? Nay (you cannot return \nto Rifa`a) until you and `Abdur-Rahman consummate your marriage.\"",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ أَنَّ امْرَأَةَ رِفَاعَةَ الْقُرَظِيِّ جَاءَتْ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ رِفَاعَةَ طَلَّقَنِي فَبَتَّ طَلاَقِي، وَإِنِّي نَكَحْتُ بَعْدَهُ عَبْدَ الرَّحْمَنِ بْنَ الزَّبِيرِ الْقُرَظِيَّ، وَإِنَّمَا مَعَهُ مِثْلُ الْهُدْبَةِ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَعَلَّكِ تُرِيدِينَ أَنْ تَرْجِعِي إِلَى رِفَاعَةَ، لاَ، حَتَّى يَذُوقَ عُسَيْلَتَكِ وَتَذُوقِي عُسَيْلَتَهُ ‏\"‏‏.‏",
    "malay_translation": "Isteri Rifa`a Al-Qurazi datang kepada Rasulullah (ﷺ) dan berkata, \"Wahai Rasulullah (ﷺ)! Rifa`a telah menceraikan saya secara talak bain (tidak boleh rujuk). Selepas itu saya berkahwin dengan `Abdur-Rahman bin Az-Zubair Al-Qurazi, tetapi dia lemah (tidak mampu melakukan hubungan intim).\" Rasulullah (ﷺ) bersabda kepadanya, \"Mungkin kamu ingin kembali kepada Rifa`a? Tidak (kamu tidak boleh kembali kepada Rifa`a) sehingga kamu dan `Abdur-Rahman menyempurnakan perkahwinan (melakukan hubungan intim).\""
  },
  {
    "id": 5052,
    "hadith_number": 5052,
    "tajuk_hadith": "Hukum Pernikahan Semula Selepas Talak Tiga",
    "perawi_melayu": "Diriwayatkan oleh `Aisha:",
    "english_text": "A man divorced his wife thrice (by expressing his decision to divorce her thrice), then she married \nanother man who also divorced her. The Prophet (ﷺ) was asked if she could legally marry the first \nhusband (or not). The Prophet (ﷺ) replied, \"No, she cannot marry the first husband unless the second \nhusband consummates his marriage with her, just as the first husband had done.\"",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي الْقَاسِمُ بْنُ مُحَمَّدٍ، عَنْ عَائِشَةَ، أَنَّ رَجُلاً، طَلَّقَ امْرَأَتَهُ ثَلاَثًا، فَتَزَوَّجَتْ فَطَلَّقَ فَسُئِلَ النَّبِيُّ صلى الله عليه وسلم أَتَحِلُّ لِلأَوَّلِ قَالَ ‏\n\"‏ لاَ، حَتَّى يَذُوقَ عُسَيْلَتَهَا كَمَا ذَاقَ الأَوَّلُ ‏\"‏‏.‏",
    "malay_translation": "Seorang lelaki telah menceraikan isterinya tiga kali (dengan menyatakan keputusannya untuk menceraikannya tiga kali), kemudian wanita itu berkahwin dengan lelaki lain yang juga menceraikannya. Nabi (ﷺ) ditanya sama ada wanita itu boleh berkahwin semula dengan suami pertama (atau tidak). Nabi (ﷺ) menjawab, \"Tidak, dia tidak boleh berkahwin dengan suami pertama melainkan suami kedua telah melakukan hubungan kelamin dengannya, sebagaimana yang telah dilakukan oleh suami pertama.\""
  },
  {
    "id": 5053,
    "hadith_number": 5053,
    "tajuk_hadith": "Pilihan Isteri Nabi (ﷺ)",
    "perawi_melayu": "Saidatina 'Aishah (r.a.)",
    "english_text": "Allah's Messenger (ﷺ) gave us the option (to remain with him or to be divorced) and we selected Allah and \nHis Apostle . So, giving us that option was not regarded as divorce.",
    "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا مُسْلِمٌ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ خَيَّرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَاخْتَرْنَا اللَّهَ وَرَسُولَهُ، فَلَمْ يَعُدَّ ذَلِكَ عَلَيْنَا شَيْئًا‏.‏",
    "malay_translation": "Rasulullah (ﷺ) memberi kita pilihan (untuk terus bersamanya atau untuk bercerai), dan kami memilih Allah dan Rasul-Nya. Oleh itu, pemberian pilihan itu tidak dianggap sebagai perceraian."
  },
  {
    "id": 5054,
    "hadith_number": 5054,
    "tajuk_hadith": "Pilihan Isteri (Khiyar) Dalam Perkahwinan",
    "perawi_melayu": "Diriwayatkan daripada Masruq:",
    "english_text": "I asked `Aisha about the option: She said, \"The Prophet (ﷺ) gave us the option. Do you think that option was considered as a divorce?\" I said, \"It matters little to me if I give my wife the option once or a hundred times after she has chosen me.\"",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ، حَدَّثَنَا عَامِرٌ، عَنْ مَسْرُوقٍ، قَالَ سَأَلْتُ عَائِشَةَ عَنِ الْخِيَرَةِ،، فَقَالَتْ خَيَّرَنَا النَّبِيُّ صلى الله عليه وسلم أَفَكَانَ طَلاَقًا قَالَ مَسْرُوقٌ لاَ أُبَالِي أَخَيَّرْتُهَا وَاحِدَةً أَوْ مِائَةً بَعْدَ أَنْ تَخْتَارَنِي‏.‏",
    "malay_translation": "Saya bertanya kepada `Aisyah tentang pilihan (khiyar). Beliau berkata, \"Nabi (ﷺ) memberikan kita pilihan (khiyar). Adakah anda berpendapat bahawa pilihan (khiyar) itu dianggap sebagai talak?\" Saya berkata, \"Tidak menjadi masalah bagi saya sama ada saya memberi isteri saya pilihan (khiyar) sekali atau seratus kali selepas dia memilih saya.\""
  },
  {
    "id": 5055,
    "hadith_number": 5055,
    "tajuk_hadith": "Hukum Talak Tiga",
    "perawi_melayu": "Nafi' berkata:",
    "english_text": "When Ibn 'Umar was asked about person who had given three divorces, he said, \"Would that you gave one or two divorces, for the Prophet (ﷺ) ordered me to do so. If you give three divorces then she cannot be lawful for you until she has married another husband (and is divorced by him).\"",
    "arabic_text": "وَقَالَ اللَّيْثُ عَنْ نَافِعٍ، كَانَ ابْنُ عُمَرَ إِذَا سُئِلَ عَمَّنْ طَلَّقَ ثَلاَثًا قَالَ لَوْ طَلَّقْتَ مَرَّةً أَوْ مَرَّتَيْنِ فَإِنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَنِي بِهَذَا، فَإِنْ طَلَّقْتَهَا ثَلاَثًا حَرُمَتْ حَتَّى تَنْكِحَ زَوْجًا غَيْرَكَ‏.‏",
    "malay_translation": "Apabila Ibn 'Umar ditanya tentang seseorang yang telah memberikan talak tiga, beliau berkata, \"Alangkah baiknya jika kamu mentalak satu atau dua kali sahaja, kerana Nabi (ﷺ) memerintahkanku berbuat demikian. Jika kamu mentalaknya tiga kali, maka dia tidak lagi halal bagimu sehingga dia berkahwin dengan suami lain (dan diceraikan olehnya).\""
  },
  {
    "id": 5056,
    "hadith_number": 5056,
    "tajuk_hadith": "Hukum Isteri yang Diceraikan, Berkahwin Semula, dan Kemudian Diceraikan",
    "perawi_melayu": "Diriwayatkan oleh `Aisha:",
    "english_text": "A man divorced his wife and she married another man who proved to be impotent and divorced her. \nShe could not get her satisfaction from him, and after a while he divorced her. Then she came to the \nProphet and said, \"O Allah's Messenger (ﷺ)! My first husband divorced me and then I married another man \nwho entered upon me to consummate his marriage but he proved to be impotent and did not approach \nme except once during which he benefited nothing from me. Can I remarry my first husband in this \ncase?\" Allah's Messenger (ﷺ) said, \"It is unlawful to marry your first husband till the other husband \nconsummates his marriage with you.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ طَلَّقَ رَجُلٌ امْرَأَتَهُ فَتَزَوَّجَتْ زَوْجًا غَيْرَهُ فَطَلَّقَهَا، وَكَانَتْ مَعَهُ مِثْلُ الْهُدْبَةِ فَلَمْ تَصِلْ مِنْهُ إِلَى شَىْءٍ تُرِيدُهُ، فَلَمْ يَلْبَثْ أَنْ طَلَّقَهَا فَأَتَتِ النَّبِيَّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ زَوْجِي طَلَّقَنِي، وَإِنِّي تَزَوَّجْتُ زَوْجًا غَيْرَهُ فَدَخَلَ بِي، وَلَمْ يَكُنْ مَعَهُ إِلاَّ مِثْلُ الْهُدْبَةِ فَلَمْ يَقْرَبْنِي إِلاَّ هَنَةً وَاحِدَةً، لَمْ يَصِلْ مِنِّي إِلَى شَىْءٍ، فَأَحِلُّ لِزَوْجِي الأَوَّلِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَحِلِّينَ لِزَوْجِكِ الأَوَّلِ حَتَّى يَذُوقَ الآخَرُ عُسَيْلَتَكِ، وَتَذُوقِي عُسَيْلَتَهُ ‏\"‏‏.‏",
    "malay_translation": "Seorang lelaki menceraikan isterinya. Kemudian, wanita itu berkahwin dengan lelaki lain yang didapati tidak berupaya dan menceraikannya.\nWanita itu tidak mendapat kepuasan daripadanya, dan selepas beberapa ketika, lelaki itu menceraikannya. Kemudian dia datang kepada Nabi dan berkata, \"Wahai Rasulullah (ﷺ)! Suami pertama saya menceraikan saya, dan kemudian saya berkahwin dengan lelaki lain yang menggauli saya untuk menyempurnakan perkahwinan kami tetapi dia didapati tidak berupaya dan tidak mendekati saya melainkan sekali sahaja yang mana dia tidak mendapat apa-apa manfaat daripada saya. Bolehkah saya berkahwin semula dengan suami pertama saya dalam kes ini?\" Rasulullah (ﷺ) bersabda, \"Tidak halal untuk berkahwin dengan suami pertama kamu sehingga suami yang lain menggauli kamu.\""
  },
  {
    "id": 5057,
    "hadith_number": 5057,
    "tajuk_hadith": "Pengharaman Isteri Tidak Bermakna Talak",
    "perawi_melayu": "Diriwayatkan daripada Sa`id bin Jubair:",
    "english_text": "that he heard Ibn `Abbas saying, \"If a man makes his wife unlawful for him, it does not mean that she \nis divorced.\" He added, \"Indeed in the Messenger of Allah , you have a good example to follow.\"",
    "arabic_text": "حَدَّثَنِي الْحَسَنُ بْنُ صَبَّاحٍ، سَمِعَ الرَّبِيعَ بْنَ نَافِعٍ، حَدَّثَنَا مُعَاوِيَةُ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ يَعْلَى بْنِ حَكِيمٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، أَنَّهُ أَخْبَرَهُ أَنَّهُ، سَمِعَ ابْنَ عَبَّاسٍ، يَقُولُ إِذَا حَرَّمَ امْرَأَتَهُ لَيْسَ بِشَىْءٍ‏.‏ وَقَالَ ‏{‏لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ‏}‏",
    "malay_translation": "Bahawa dia mendengar Ibn `Abbas berkata, \"Jika seorang lelaki mengharamkan isterinya untuk dirinya, itu tidak bermakna isterinya telah ditalak.\" Beliau menambah, \"Sesungguhnya pada Rasulullah ﷺ, kamu mempunyai contoh yang baik untuk diikuti.\""
  },
  {
    "id": 5058,
    "hadith_number": 5058,
    "tajuk_hadith": "Nabi (ﷺ) dan Madu di Rumah Zainab bint Jahsh",
    "perawi_melayu": "Diriwayatkan oleh `Ubaid bin `Umar:",
    "english_text": "I heard `Aisha saying, \"The Prophet (ﷺ) used to stay for a long while with Zanab bint Jahsh and drink \nhoney at her house. So Hafsa and I decided that if the Prophet (ﷺ) came to anyone of us, she should say \nhim, \"I detect the smell of Maghafir (a nasty smelling gum) in you. Have you eaten Maghafir?' \" So \nthe Prophet (ﷺ) visited one of them and she said to him similarly. The Prophet (ﷺ) said, \"Never mind, I have \ntaken some honey at the house of Zainab bint Jahsh, but I shall never drink of it anymore.\" So there \nwas revealed: 'O Prophet ! Why do you ban (for you) that which Allah has made lawful for you . . . If \nyou two (wives of Prophet) turn in repentance to Allah,' (66.1-4) addressing Aisha and Hafsa. 'When \nthe Prophet (ﷺ) disclosed a matter in confidence to some of his wives.' (66.3) namely his saying: But I \nhave taken some honey.\"",
    "arabic_text": "حَدَّثَنِي الْحَسَنُ بْنُ مُحَمَّدِ بْنِ صَبَّاحٍ، حَدَّثَنَا حَجَّاجٌ، عَنِ ابْنِ جُرَيْجٍ، قَالَ زَعَمَ عَطَاءٌ أَنَّهُ سَمِعَ عُبَيْدَ بْنَ عُمَيْرٍ، يَقُولُ سَمِعْتُ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَمْكُثُ عِنْدَ زَيْنَبَ ابْنَةِ جَحْشٍ، وَيَشْرَبُ عِنْدَهَا عَسَلاً، فَتَوَاصَيْتُ أَنَا وَحَفْصَةُ أَنَّ أَيَّتَنَا دَخَلَ عَلَيْهَا النَّبِيُّ صلى الله عليه وسلم فَلْتَقُلْ إِنِّي أَجِدُ مِنْكَ رِيحَ مَغَافِيرَ، أَكَلْتَ مَغَافِيرَ فَدَخَلَ عَلَى إِحْدَاهُمَا فَقَالَتْ لَهُ ذَلِكَ، فَقَالَ ‏\"‏ لاَ بَلْ شَرِبْتُ عَسَلاً عِنْدَ زَيْنَبَ ابْنَةِ جَحْشٍ وَلَنْ أَعُودَ لَهُ ‏\"‏‏.‏ فَنَزَلَتْ ‏{‏يَا أَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَا أَحَلَّ اللَّهُ لَكَ‏}‏ إِلَى ‏{‏إِنْ تَتُوبَا إِلَى اللَّهِ‏}‏ لِعَائِشَةَ وَحَفْصَةَ ‏{‏وَإِذْ أَسَرَّ النَّبِيُّ إِلَى بَعْضِ أَزْوَاجِهِ‏}‏ لِقَوْلِهِ ‏\"‏ بَلْ شَرِبْتُ عَسَلاً ‏\"‏‏.‏",
    "malay_translation": "Saya mendengar `Aisyah berkata, \"Nabi (ﷺ) sering tinggal lama dengan Zainab bint Jahsh dan minum madu di rumahnya. Oleh itu, saya dan Hafsa memutuskan bahawa jika Nabi (ﷺ) datang kepada sesiapa antara kami, dia harus berkata kepada baginda, 'Saya mengesan bau Maghafir (sejenis gam yang berbau busuk) pada diri Tuan. Adakah Tuan telah memakan Maghafir?'\" Kemudian Nabi (ﷺ) melawat salah seorang daripada mereka dan dia berkata kepada baginda perkara yang sama. Nabi (ﷺ) bersabda, \"Tidak mengapa, saya telah meminum madu di rumah Zainab bint Jahsh, tetapi saya tidak akan meminumnya lagi.\" Kemudian turunlah ayat: 'Wahai Nabi! Mengapa kamu mengharamkan (untuk dirimu) apa yang Allah halalkan bagimu... Jika kamu berdua (isteri Nabi) bertaubat kepada Allah,' (66:1-4) yang ditujukan kepada `Aisyah dan Hafsa. 'Ketika Nabi (ﷺ) membicarakan sesuatu secara rahsia kepada sebahagian isterinya.' (66:3) iaitu sabdanya: Tetapi saya telah meminum madu.\""
  },
  {
    "id": 5059,
    "hadith_number": 5059,
    "tajuk_hadith": "Kisah Madu dan Cemburu Isteri Nabi ﷺ",
    "perawi_melayu": "Daripada 'Aishah رضي الله عنها:",
    "english_text": "Allah's Messenger (ﷺ) was fond of honey and sweet edible things and (it was his habit) that after finishing \nthe `Asr prayer he would visit his wives and stay with one of them at that time. Once he went to \nHafsa, the daughter of `Umar and stayed with her more than usual. I got jealous and asked the reason \nfor that. I was told that a lady of her folk had given her a skin filled with honey as a present, and that \nshe made a syrup from it and gave it to the Prophet (ﷺ) to drink (and that was the reason for the delay). I \nsaid, \"By Allah we will play a trick on him (to prevent him from doing so).\" So I said to Sa`da bint \nZam`a \"The Prophet (ﷺ) will approach you, and when he comes near you, say: 'Have you taken Maghafir \n(a bad-smelling gum)?' He will say, 'No.' Then say to him: 'Then what is this bad smell which i smell \nfrom you?' He will say to you, 'Hafsa made me drink honey syrup.' Then say: Perhaps the bees of that \nhoney had sucked the juice of the tree of Al-`Urfut.' I shall also say the same. O you, Safiyya, say the \nsame.\" Later Sa`da said, \"By Allah, as soon as he (the Prophet (ﷺ) ) stood at the door, I was about to say \nto him what you had ordered me to say because I was afraid of you.\" So when the Prophet (ﷺ) came near \nSa`da, she said to him, \"O Allah's Messenger (ﷺ)! Have you taken Maghafir?\" He said, \"No.\" She said. \n\"Then what is this bad smell which I detect on you?\" He said, \"Hafsa made me drink honey syrup.\" \nShe said, \"Perhaps its bees had sucked the juice of Al-`Urfut tree.\" When he came to me, I also said \nthe same, and when he went to Safiyya, she also said the same. And when the Prophet (ﷺ) again went to \nHafsa, she said, 'O Allah's Messenger (ﷺ)! Shall I give you more of that drink?\" He said, \"I am not in need of \nit.\" Sa`da said, \"By Allah, we deprived him (of it).\" I said to her, \"Keep quiet.\" '",
    "arabic_text": "حَدَّثَنَا فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُحِبُّ الْعَسَلَ وَالْحَلْوَاءَ، وَكَانَ إِذَا انْصَرَفَ مِنَ الْعَصْرِ دَخَلَ عَلَى نِسَائِهِ، فَيَدْنُو مِنْ إِحْدَاهُنَّ، فَدَخَلَ عَلَى حَفْصَةَ بِنْتِ عُمَرَ، فَاحْتَبَسَ أَكْثَرَ مَا كَانَ يَحْتَبِسُ، فَغِرْتُ فَسَأَلْتُ عَنْ ذَلِكَ فَقِيلَ لِي أَهْدَتْ لَهَا امْرَأَةٌ مِنْ قَوْمِهَا عُكَّةً مِنْ عَسَلٍ، فَسَقَتِ النَّبِيَّ صلى الله عليه وسلم مِنْهُ شَرْبَةً، فَقُلْتُ أَمَا وَاللَّهِ لَنَحْتَالَنَّ لَهُ‏.‏ فَقُلْتُ لِسَوْدَةَ بِنْتِ زَمْعَةَ إِنَّهُ سَيَدْنُو مِنْكِ، فَإِذَا دَنَا مِنْكِ فَقُولِي أَكَلْتَ مَغَافِيرَ فَإِنَّهُ سَيَقُولُ لَكِ لاَ‏.‏ فَقُولِي لَهُ مَا هَذِهِ الرِّيحُ الَّتِي أَجِدُ مِنْكَ فَإِنَّهُ سَيَقُولُ لَكِ سَقَتْنِي حَفْصَةُ شَرْبَةَ عَسَلٍ فَقُولِي لَهُ جَرَسَتْ نَحْلُهُ الْعُرْفُطَ‏.‏ وَسَأَقُولُ ذَلِكَ، وَقُولِي أَنْتِ يَا صَفِيَّةُ ذَاكِ‏.‏ قَالَتْ تَقُولُ سَوْدَةُ فَوَاللَّهِ مَا هُوَ إِلاَّ أَنْ قَامَ عَلَى الْبَابِ، فَأَرَدْتُ أَنْ أُبَادِيَهُ بِمَا أَمَرْتِنِي بِهِ فَرَقًا مِنْكِ، فَلَمَّا دَنَا مِنْهَا قَالَتْ لَهُ سَوْدَةُ يَا رَسُولَ اللَّهِ أَكَلْتَ مَغَافِيرَ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قَالَتْ فَمَا هَذِهِ الرِّيحُ الَّتِي أَجِدُ مِنْكَ‏.‏ قَالَ ‏\"‏ سَقَتْنِي حَفْصَةُ شَرْبَةَ عَسَلٍ ‏\"‏‏.‏ فَقَالَتْ جَرَسَتْ نَحْلُهُ الْعُرْفُطَ فَلَمَّا دَارَ إِلَىَّ قُلْتُ لَهُ نَحْوَ ذَلِكَ، فَلَمَّا دَارَ إِلَى صَفِيَّةَ قَالَتْ لَهُ مِثْلَ ذَلِكَ فَلَمَّا دَارَ إِلَى حَفْصَةَ قَالَتْ يَا رَسُولَ اللَّهِ أَلاَ أَسْقِيكَ مِنْهُ‏.‏ قَالَ ‏\"‏ لاَ حَاجَةَ لِي فِيهِ ‏\"‏‏.‏ قَالَتْ تَقُولُ سَوْدَةُ وَاللَّهِ لَقَدْ حَرَمْنَاهُ‏.‏ قُلْتُ لَهَا اسْكُتِي‏.‏",
    "malay_translation": "Rasulullah ﷺ amat menyukai madu dan makanan manis. Adalah menjadi kebiasaan Baginda setelah selesai solat Asar akan mengunjungi isteri-isteri Baginda dan bermalam bersama salah seorang daripada mereka. Suatu ketika, Baginda pergi kepada Hafsah, anak perempuan Umar, dan bermalam bersamanya lebih lama daripada biasa. Aku merasa cemburu dan bertanya sebabnya. Aku diberitahu bahawa seorang wanita daripada kaumnya telah menghadiahkan kepadanya sebekas madu, lalu Hafsah menghidangkannya kepada Nabi ﷺ untuk diminum (dan itulah sebab kelewatan Baginda). Aku berkata, \"Demi Allah, kita akan mengenakannya tipu daya (untuk menghalangnya daripada berbuat demikian).\" Lalu aku berkata kepada Saudah binti Zam'ah, \"Rasulullah ﷺ akan mendekatimu, dan apabila Baginda datang dekat kepadamu, katakanlah: 'Adakah engkau memakan Maghafir (sejenis gusi berbau busuk)?' Baginda akan menjawab, 'Tidak.' Kemudian katakanlah kepada Baginda: 'Lalu apakah bau busuk ini yang aku hidu daripadamu?' Baginda akan berkata kepadamu, 'Hafsah telah memberiku minum air madu.' Kemudian katakanlah: 'Mungkin lebah madu itu telah menghisap jus pokok Al-`Urfut.' Aku juga akan mengatakan perkara yang sama. Wahai Safiyyah, katakanlah perkara yang sama juga.\" Kemudian Saudah berkata, \"Demi Allah, sebaik sahaja Baginda (Rasulullah ﷺ) berdiri di pintu, aku hampir-hampir ingin mengatakan kepadanya apa yang kamu perintahkan kepadaku untuk katakan kerana aku takut kepadamu.\" Maka, apabila Rasulullah ﷺ datang dekat dengan Saudah, dia berkata kepada Baginda, \"Wahai Rasulullah ﷺ! Adakah engkau telah memakan Maghafir?\" Baginda menjawab, \"Tidak.\" Dia berkata, \"Lalu apakah bau busuk ini yang aku hidu daripadamu?\" Baginda berkata, \"Hafsah telah memberiku minum air madu.\" Dia berkata, \"Mungkin lebahnya telah menghisap jus pokok Al-`Urfut.\" Apabila Baginda datang kepadaku, aku juga mengatakan perkara yang sama, dan apabila Baginda pergi kepada Safiyyah, dia juga mengatakan perkara yang sama. Dan apabila Rasulullah ﷺ kembali kepada Hafsah, dia berkata, 'Wahai Rasulullah ﷺ! Bolehkah aku memberikanmu minuman itu lagi?' Baginda menjawab, \"Aku tidak memerlukannya.\" Saudah berkata, \"Demi Allah, kami telah menghalangnya (daripada meminumnya).\" Aku berkata kepadanya, \"Diamlah.\""
  },
  {
    "id": 5060,
    "hadith_number": 5060,
    "tajuk_hadith": "Kemaafan Allah Terhadap Niat Jahat yang Terlintas di Fikiran",
    "perawi_melayu": "Diriwayatkan oleh Abu Huraira:",
    "english_text": "The Prophet (ﷺ) said, \"Allah has forgiven my followers the evil thoughts that occur to their minds, as long \nas such thoughts are not put into action or uttered.\" And Qatada said, \"If someone divorces his wife \njust in his mind, such an unuttered divorce has no effect.:",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ اللَّهَ تَجَاوَزَ عَنْ أُمَّتِي مَا حَدَّثَتْ بِهِ أَنْفُسَهَا، مَا لَمْ تَعْمَلْ أَوْ تَتَكَلَّمْ ‏\"‏‏.‏ قَالَ قَتَادَةُ إِذَا طَلَّقَ فِي نَفْسِهِ فَلَيْسَ بِشَىْءٍ‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda, \"Sesungguhnya Allah telah memaafkan umatku (kesalahan) yang terlintas di dalam hati mereka, selama mereka tidak melakukan atau mengucapkannya.\" Dan Qatada berkata, \"Jika seseorang menceraikan isterinya hanya dalam fikirannya, maka perceraian yang tidak diucapkan itu tidak mempunyai kesan.\""
  },
  {
    "id": 5061,
    "hadith_number": 5061,
    "tajuk_hadith": "Lelaki Bani Aslam Mengaku Melakukan Zina di Hadapan Nabi (ﷺ)",
    "perawi_melayu": "Diriwayatkan oleh Jabir:",
    "english_text": "A man from the tribe of Bani Aslam came to the Prophet (ﷺ) while he was in the mosque and said, \"I have \ncommitted illegal sexual intercourse.\" The Prophet (ﷺ) turned his face to the other side. The man turned \ntowards the side towards which the Prophet (ﷺ) had turned his face, and gave four witnesses against \nhimself. On that the Prophet (ﷺ) called him and said, \"Are you insane?\" (He added), \"Are you married?\" \nThe man said, 'Yes.\" On that the Prophet (ﷺ) ordered him to be stoned to the death in the Musalla (a \npraying place). When the stones hit him with their sharp edges and he fled, but he was caught at Al- \nHarra and then killed",
    "arabic_text": "حَدَّثَنَا أَصْبَغُ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، عَنْ جَابِرٍ، أَنَّ رَجُلاً، مِنْ أَسْلَمَ أَتَى النَّبِيَّ صلى الله عليه وسلم وَهْوَ فِي الْمَسْجِدِ فَقَالَ إِنَّهُ قَدْ زَنَى‏.‏ فَأَعْرَضَ عَنْهُ، فَتَنَحَّى لِشِقِّهِ الَّذِي أَعْرَضَ فَشَهِدَ عَلَى نَفْسِهِ أَرْبَعَ شَهَادَاتٍ، فَدَعَاهُ فَقَالَ ‏\n\"‏ هَلْ بِكَ جُنُونٌ هَلْ أُحْصِنْتَ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ فَأَمَرَ بِهِ أَنْ يُرْجَمَ بِالْمُصَلَّى، فَلَمَّا أَذْلَقَتْهُ الْحِجَارَةُ جَمَزَ حَتَّى أُدْرِكَ بِالْحَرَّةِ فَقُتِلَ‏.‏",
    "malay_translation": "Seorang lelaki dari suku Bani Aslam datang kepada Nabi (ﷺ) ketika baginda berada di masjid dan berkata, \"Sesungguhnya aku telah melakukan zina.\" Nabi (ﷺ) memalingkan wajahnya ke arah lain. Lelaki itu berpaling ke arah yang Nabi (ﷺ) palingkan wajahnya, dan memberi empat saksi terhadap dirinya sendiri. Kemudian Nabi (ﷺ) memanggilnya dan bertanya, \"Adakah kamu gila?\" (Baginda menambah), \"Adakah kamu sudah berkahwin?\" Lelaki itu menjawab, 'Ya.' Kemudian Nabi (ﷺ) memerintahkan agar dia direjam sampai mati di Musalla (tempat solat). Apabila batu-batu itu mengenainya dengan tepi yang tajam, dia melarikan diri, tetapi dia ditangkap di Al-Harra dan kemudian dibunuh."
  },
  {
    "id": 5062,
    "hadith_number": 5062,
    "tajuk_hadith": "Lelaki dari Bani Aslam Mengakui Berzina dan Dijatuhkan Hukuman Rejam",
    "perawi_melayu": "Diriwayatkan oleh Abu Huraira:",
    "english_text": "A man from Bani Aslam came to Allah's Messenger (ﷺ) while he was in the mosque and called (the Prophet (ﷺ) ) \nsaying, \"O Allah's Messenger (ﷺ)! I have committed illegal sexual intercourse.\" On that the Prophet (ﷺ) turned \nhis face from him to the other side, whereupon the man moved to the side towards which the Prophet (ﷺ) \nhad turned his face, and said, \"O Allah's Messenger (ﷺ)! I have committed illegal sexual intercourse.\" The \nProphet turned his face (from him) to the other side whereupon the man moved to the side towards \nwhich the Prophet (ﷺ) had turned his face, and repeated his statement. The Prophet (ﷺ) turned his face (from \nhim) to the other side again. The man moved again (and repeated his statement) for the fourth time. So \nwhen the man had given witness four times against himself, the Prophet (ﷺ) called him and said, \"Are you \ninsane?\" He replied, \"No.\" The Prophet (ﷺ) then said (to his companions), \"Go and stone him to death.\" \nThe man was a married one. Jabir bin `Abdullah Al-Ansari said: I was one of those who stoned him. \nWe stoned him at the Musalla (`Id praying place) in Medina. When the stones hit him with their sharp \nedges, he fled, but we caught him at Al-Harra and stoned him till he died.",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، وَسَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ أَتَى رَجُلٌ مِنْ أَسْلَمَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهْوَ فِي الْمَسْجِدِ فَنَادَاهُ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ الأَخِرَ قَدْ زَنَى ـ يَعْنِي نَفْسَهُ ـ فَأَعْرَضَ عَنْهُ فَتَنَحَّى لِشِقِّ وَجْهِهِ الَّذِي أَعْرَضَ قِبَلَهُ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ الأَخِرَ قَدْ زَنَى فَأَعْرَضَ عَنْهُ فَتَنَحَّى لِشِقِّ وَجْهِهِ الَّذِي أَعْرَضَ قِبَلَهُ فَقَالَ لَهُ ذَلِكَ فَأَعْرَضَ عَنْهُ فَتَنَحَّى لَهُ الرَّابِعَةَ، فَلَمَّا شَهِدَ عَلَى نَفْسِهِ أَرْبَعَ شَهَادَاتٍ دَعَاهُ فَقَالَ ‏\"‏ هَلْ بِكَ جُنُونٌ ‏\"‏‏.‏ قَالَ لاَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اذْهَبُوا بِهِ فَارْجُمُوهُ ‏\"‏‏.‏ وَكَانَ قَدْ أُحْصِنَ‏.‏   \nوَعَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي مَنْ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ الأَنْصَارِيَّ، قَالَ كُنْتُ فِيمَنْ رَجَمَهُ فَرَجَمْنَاهُ بِالْمُصَلَّى بِالْمَدِينَةِ، فَلَمَّا أَذْلَقَتْهُ الْحِجَارَةُ جَمَزَ حَتَّى أَدْرَكْنَاهُ بِالْحَرَّةِ، فَرَجَمْنَاهُ حَتَّى مَاتَ‏.‏",
    "malay_translation": "Seorang lelaki dari Bani Aslam datang kepada Rasulullah (ﷺ) ketika baginda berada di dalam masjid dan memanggil (Nabi (ﷺ) ) seraya berkata, \"Wahai Rasulullah (ﷺ)! Sesungguhnya saya telah melakukan perbuatan zina.\" Lalu Nabi (ﷺ) memalingkan wajahnya daripada lelaki itu ke arah lain, lelaki itu kemudiannya berpindah ke arah wajah Nabi (ﷺ) berpaling, dan berkata, \"Wahai Rasulullah (ﷺ)! Sesungguhnya saya telah melakukan perbuatan zina.\" Nabi (ﷺ) memalingkan wajahnya (daripada lelaki itu) ke arah lain, lelaki itu kemudiannya berpindah ke arah wajah Nabi (ﷺ) berpaling, dan mengulangi kata-katanya. Nabi (ﷺ) memalingkan wajahnya (daripada lelaki itu) ke arah lain lagi. Lelaki itu berpindah lagi (dan mengulangi kata-katanya) untuk kali keempat. Maka apabila lelaki itu telah memberi saksi empat kali terhadap dirinya sendiri, Nabi (ﷺ) memanggilnya dan bertanya, \"Adakah kamu gila?\" Dia menjawab, \"Tidak.\" Nabi (ﷺ) kemudian berkata (kepada para sahabatnya), \"Pergilah dan rejam dia sampai mati.\" Lelaki itu adalah seorang yang sudah berkahwin. Jabir bin `Abdullah Al-Ansari berkata: Aku adalah salah seorang yang merejamnya. Kami merejamnya di Musalla (tempat solat `Id) di Madinah. Apabila batu-batu mengenai dirinya dengan tepi yang tajam, dia melarikan diri, tetapi kami menangkapnya di Al-Harra dan merejamnya sehingga dia meninggal dunia."
  },
  {
    "id": 5063,
    "hadith_number": 5063,
    "tajuk_hadith": "Permintaan Cerai Isteri Thabit bin Qais",
    "perawi_melayu": "Diriwayatkan oleh Ibnu `Abbas:",
    "english_text": "The wife of Thabit bin Qais came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! I do not blame Thabit \nfor defects in his character or his religion, but I, being a Muslim, dislike to behave in un-Islamic \nmanner (if I remain with him).\" On that Allah's Messenger (ﷺ) said (to her), \"Will you give back the garden \nwhich your husband has given you (as Mahr)?\" She said, \"Yes.\" Then the Prophet (ﷺ) said to Thabit, \"O \nThabit! Accept your garden, and divorce her once.\"",
    "arabic_text": "حَدَّثَنَا أَزْهَرُ بْنُ جَمِيلٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ،‏.‏ أَنَّ امْرَأَةَ، ثَابِتِ بْنِ قَيْسٍ أَتَتِ النَّبِيَّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ ثَابِتُ بْنُ قَيْسٍ مَا أَعْتُبُ عَلَيْهِ فِي خُلُقٍ وَلاَ دِينٍ، وَلَكِنِّي أَكْرَهُ الْكُفْرَ فِي الإِسْلاَمِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَرُدِّينَ عَلَيْهِ حَدِيقَتَهُ ‏\"‏‏.‏ قَالَتْ نَعَمْ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اقْبَلِ الْحَدِيقَةَ وَطَلِّقْهَا تَطْلِيقَةً ‏\"‏‏.‏   \nقَالَ أَبُو عَبْد اللَّهِ لَا يُتَابَعُ فِيهِ عَنْ ابْنِ عَبَّاسٍ",
    "malay_translation": "Isteri Thabit bin Qais datang kepada Nabi (ﷺ) dan berkata, \"Wahai Rasulullah (ﷺ)! Aku tidak menyalahkan Thabit atas kekurangan akhlak atau agamanya, tetapi aku, sebagai seorang Muslim, tidak suka berkelakuan dengan cara yang tidak Islami (jika aku terus bersamanya).\" Mendengar itu, Rasulullah (ﷺ) berkata kepadanya, \"Adakah engkau akan mengembalikan kebun yang telah diberikan oleh suamimu kepadamu (sebagai mahar)?\" Dia berkata, \"Ya.\" Kemudian Nabi (ﷺ) berkata kepada Thabit, \"Wahai Thabit! Terimalah kebunmu, dan ceraikanlah dia sekali.\""
  },
  {
    "id": 5064,
    "hadith_number": 5064,
    "tajuk_hadith": "Permintaan Nabi (ﷺ) untuk Memulangkan Kebun dan Perintah Cerai",
    "perawi_melayu": "Diriwayatkan daripada 'Ikrima:",
    "english_text": "The sister of `Abdullah bin Ubai narrated (the above narration, 197) with the addition that the Prophet (ﷺ) \nsaid to Thabit's wife, \"Will you return his garden?\" She said, \"Yes,\" and returned it, and (then) the \nProphet ordered Thabit to divorce her.",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ الْوَاسِطِيُّ، حَدَّثَنَا خَالِدٌ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ عِكْرِمَةَ، أَنَّ أُخْتَ عَبْدِ اللَّهِ بْنِ أُبَىٍّ، بِهَذَا، وَقَالَ ‏\n\"‏ تَرُدِّينَ حَدِيقَتَهُ ‏\"‏‏.‏ قَالَتْ نَعَمْ‏.‏ فَرَدَّتْهَا وَأَمَرَهُ يُطَلِّقْهَا‏.‏ وَقَالَ إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ خَالِدٍ عَنْ عِكْرِمَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم وَطَلِّقْهَا‏.‏",
    "malay_translation": "Saudari perempuan `Abdullah bin Ubai meriwayatkan (riwayat di atas, 197) dengan tambahan bahawa Nabi (ﷺ) \nbersabda kepada isteri Thabit, \"Adakah kamu akan memulangkan kebunnya?\" Dia menjawab, \"Ya,\" dan memulangkannya, dan (kemudian) Nabi memerintahkan Thabit untuk menceraikannya."
  },
  {
    "id": 5065,
    "hadith_number": 5065,
    "tajuk_hadith": "Isteri Thabit bin Qais Meminta Cerai",
    "perawi_melayu": "Diriwayatkan oleh Ibnu Abbas:",
    "english_text": "The wife of Thabit bin Qais came to \nAllah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! I do not blame Thabit for any defects in his character or \nhis religion, but I cannot endure to live with him.\" On that Allah's Messenger (ﷺ) said, \"Will you return his \ngarden to him?\" She said, \"Yes.\"",
    "arabic_text": "وَعَنِ ابْنِ أَبِي تَمِيمَةَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ قَالَ جَاءَتِ امْرَأَةُ ثَابِتِ بْنِ قَيْسٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي لاَ أَعْتُبُ عَلَى ثَابِتٍ فِي دِينٍ وَلاَ خُلُقٍ، وَلَكِنِّي لاَ أُطِيقُهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ فَتَرُدِّينَ عَلَيْهِ حَدِيقَتَهُ ‏\"‏‏.‏ قَالَتْ نَعَمْ‏.‏",
    "malay_translation": "Isteri Thabit bin Qais datang kepada Rasulullah ﷺ dan berkata, \"Wahai Rasulullah ﷺ! Saya tidak menyalahkan Thabit atas sebarang kecacatan pada akhlaknya atau agamanya, tetapi saya tidak dapat menanggung untuk hidup bersamanya.\" Mendengar hal itu, Rasulullah ﷺ bersabda, \"Adakah kamu akan mengembalikan kebunnya kepadanya?\" Dia menjawab, \"Ya.\""
  },
  {
    "id": 5066,
    "hadith_number": 5066,
    "tajuk_hadith": "Isteri Thabit bin Qais Memohon Perceraian Kerana Takut Bersikap Kufur",
    "perawi_melayu": "Diriwayatkan oleh Ibnu 'Abbas:",
    "english_text": "The wife of Thabit bin Qais bin Shammas came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! I do not \nblame Thabit for any defects in his character or his religion, but I am afraid that I (being a Muslim) \nmay become unthankful for Allah's Blessings.\" On that, Allah's Messenger (ﷺ) said (to her), 'Will you return \nhis garden to him?\" She said, \"Yes.\" So she returned his garden to him and the Prophet (ﷺ) told him to \ndivorce her.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ الْمُخَرِّمِيُّ، حَدَّثَنَا قُرَادٌ أَبُو نُوحٍ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، رضى الله عنهما قَالَ جَاءَتِ امْرَأَةُ ثَابِتِ بْنِ قَيْسِ بْنِ شَمَّاسٍ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ مَا أَنْقِمُ عَلَى ثَابِتٍ فِي دِينٍ وَلاَ خُلُقٍ، إِلاَّ أَنِّي أَخَافُ الْكُفْرَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ فَتَرُدِّينَ عَلَيْهِ حَدِيقَتَهُ ‏\"‏‏.‏ فَقَالَتْ نَعَمْ‏.‏ فَرَدَّتْ عَلَيْهِ، وَأَمَرَهُ فَفَارَقَهَا‏.‏",
    "malay_translation": "Isteri Thabit bin Qais bin Shammas datang kepada Nabi (ﷺ) dan berkata, \"Wahai Rasulullah (ﷺ)! Saya tidak menyalahkan Thabit atas sebarang kekurangan pada akhlak atau agamanya, tetapi saya khuatir (sebagai seorang Muslim) saya akan menjadi tidak bersyukur atas Nikmat Allah.\" Mendengar itu, Rasulullah (ﷺ) bersabda kepadanya, 'Adakah kamu akan memulangkan kebunnya kepadanya?\" Dia menjawab, \"Ya.\" Maka dia memulangkan kebunnya kepadanya dan Nabi (ﷺ) menyuruhnya untuk menceraikannya."
  },
  {
    "id": 5067,
    "hadith_number": 5067,
    "tajuk_hadith": "Jamila dan Hadith Lengkap",
    "perawi_melayu": "Diriwayatkan daripada 'Ikrima:",
    "english_text": "that Jamila... Then he related the whole ,Hadith, (i.e. 199).",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، أَنَّ جَمِيلَةَ، فَذَكَرَ الْحَدِيثَ‏.‏",
    "malay_translation": "Berkata Jamila... Kemudian beliau meriwayatkan keseluruhan Hadith (iaitu 199)."
  },
  {
    "id": 5068,
    "hadith_number": 5068,
    "tajuk_hadith": "Nabi ﷺ Menolak Permintaan Banu Al-Mughira untuk Perkahwinan Ali",
    "perawi_melayu": "Al-Miswar bin Makhrama Az-Zuhri",
    "english_text": "I heard the Prophet (ﷺ) saying, \"Banu Al-Mughira have asked my leave to let `Ali marry their daughter, \nbut I give no leave to this effect.\"",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ بَنِي الْمُغِيرَةِ اسْتَأْذَنُوا فِي أَنْ يَنْكِحَ عَلِيٌّ ابْنَتَهُمْ، فَلاَ آذَنُ ‏\"‏‏.‏",
    "malay_translation": "Saya mendengar Nabi ﷺ bersabda, \"Banu Al-Mughira telah meminta izin saya untuk membenarkan `Ali mengahwini anak perempuan mereka, tetapi saya tidak memberi izin untuk tujuan ini.\""
  },
  {
    "id": 5069,
    "hadith_number": 5069,
    "tajuk_hadith": "Hukum Berkaitan Barirah (RA)",
    "perawi_melayu": "Saidatina 'Aishah (RA)",
    "english_text": "(the wife of the Prophet) Three traditions were established concerning situations in which Barra was \ninvolved: When she was manumitted, she was given the option to keep her husband or leave him; \nAllah's Messenger (ﷺ) said, \"The wala is for the one who manumits, Once Allah's Messenger (ﷺ) entered the house \nwhile some meat was being cooked in a pot, but only bread and some soup of the house were placed \nbefore, him. He said, \"Don't I see the pot containing meat?\" They said, \"Yes, but that meat was given \nto Barira in charity (by someone), and you do not eat what it given in charity.\"The Prophet (ﷺ) said \"That \nmeat is alms for her, but for us it is a present.\"",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ كَانَ فِي بَرِيرَةَ ثَلاَثُ سُنَنٍ، إِحْدَى السُّنَنِ أَنَّهَا أُعْتِقَتْ، فَخُيِّرَتْ فِي زَوْجِهَا‏.‏ وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ وَدَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالْبُرْمَةُ تَفُورُ بِلَحْمٍ، فَقُرِّبَ إِلَيْهِ خُبْزٌ وَأُدْمٌ مِنْ أُدْمِ الْبَيْتِ فَقَالَ ‏\"‏ أَلَمْ أَرَ الْبُرْمَةَ فِيهَا لَحْمٌ ‏\"‏‏.‏ قَالُوا بَلَى، وَلَكِنْ ذَلِكَ لَحْمٌ تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ، وَأَنْتَ لاَ تَأْكُلُ الصَّدَقَةَ‏.‏ قَالَ ‏\"‏ عَلَيْهَا صَدَقَةٌ، وَلَنَا هَدِيَّةٌ ‏\"‏‏.‏",
    "malay_translation": "Daripada 'Aishah (RA), isteri Nabi (ﷺ), berkata: Terdapat tiga sunnah yang ditetapkan berkaitan Barirah: Apabila dia dimerdekakan, dia diberi pilihan untuk kekal dengan suaminya atau berpisah dengannya; Rasulullah (ﷺ) bersabda, \"Hak wala' (kesetiaan) adalah bagi orang yang memerdekakan.\"  Rasulullah (ﷺ) pernah masuk ke dalam rumah ketika periuk sedang mendidih berisi daging, tetapi yang dihidangkan kepada baginda hanyalah roti dan sedikit kuah dari rumah. Baginda bertanya, \"Tidakkah aku melihat periuk berisi daging?\" Mereka menjawab, \"Ya, tetapi daging itu telah disedekahkan kepada Barirah, dan tuan tidak memakan sedekah.\" Nabi (ﷺ) bersabda, \"Ia adalah sedekah bagi Barirah, tetapi bagi kami ia adalah hadiah.\""
  },
  {
    "id": 5070,
    "hadith_number": 5070,
    "tajuk_hadith": "Status Suami Barirah",
    "perawi_melayu": "Diriwayatkan oleh Ibnu Abbas:",
    "english_text": "I saw him as a slave, (namely, Barira's husband).",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، وَهَمَّامٌ، عَنْ قَتَادَةَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ رَأَيْتُهُ عَبْدًا يَعْنِي زَوْجَ بَرِيرَةَ‏.‏",
    "malay_translation": "Aku melihat dia sebagai seorang hamba, (iaitu suami Barirah)."
  },
  {
    "id": 5071,
    "hadith_number": 5071,
    "tajuk_hadith": "Mughith Mengejar Barira",
    "perawi_melayu": "Diriwayatkan oleh Ibnu Abbas:",
    "english_text": "That was Mughith, the slave of Bani so-and-so, i.e., Barira's husband as if I am now looking at him \nfollowing her (Barira) along the streets of Medina.",
    "arabic_text": "حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ ذَاكَ مُغِيثٌ عَبْدُ بَنِي فُلاَنٍ ـ يَعْنِي زَوْجَ بَرِيرَةَ ـ كَأَنِّي أَنْظُرُ إِلَيْهِ يَتْبَعُهَا فِي سِكَكِ الْمَدِينَةِ، يَبْكِي عَلَيْهَا‏.‏",
    "malay_translation": "Itulah Mughith, hamba Bani Fulan, iaitu suami Barira. Seolah-olah aku melihatnya sekarang mengikutinya (Barira) di lorong-lorong Madinah, sambil menangisinya."
  },
  {
    "id": 5072,
    "hadith_number": 5072,
    "tajuk_hadith": "Kisah Suami Barirah dan Mughith",
    "perawi_melayu": "Diriwayatkan oleh Ibnu 'Abbas:",
    "english_text": "Barira's husband was a black slave called Mughith, the slave of Bani so-and-so-- as if I am seeing him \nnow, walking behind her along the streets of Medina.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ زَوْجُ بَرِيرَةَ عَبْدًا أَسْوَدَ يُقَالُ لَهُ مُغِيثٌ، عَبْدًا لِبَنِي فُلاَنٍ، كَأَنِّي أَنْظُرُ إِلَيْهِ يَطُوفُ وَرَاءَهَا فِي سِكَكِ الْمَدِينَةِ‏.‏",
    "malay_translation": "Suami Barirah adalah seorang hamba sahaya berkulit hitam yang bernama Mughith, hamba kepada Bani Fulan – seolah-olah aku melihatnya sekarang, berjalan di belakangnya di lorong-lorong Madinah."
  },
  {
    "id": 5073,
    "hadith_number": 5073,
    "tajuk_hadith": "Kisah Cinta Mughith dan Barira",
    "perawi_melayu": "Diriwayatkan oleh Ibn `Abbas:",
    "english_text": "Barira's husband was a slave called Mughith, as if I am seeing him now, going behind Barira and \nweeping with his tears flowing down his beard. The Prophet (ﷺ) said to `Abbas, \"O `Abbas ! are you not \nastonished at the love of Mughith for Barira and the hatred of Barira for Mughith?\" The Prophet (ﷺ) then \nsaid to Barira, \"Why don't you return to him?\" She said, \"O Allah's Messenger (ﷺ)! Do you order me to do \nso?\" He said, \"No, I only intercede for him.\" She said, \"I am not in need of him.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ زَوْجَ، بَرِيرَةَ كَانَ عَبْدًا يُقَالُ لَهُ مُغِيثٌ كَأَنِّي أَنْظُرُ إِلَيْهِ يَطُوفُ خَلْفَهَا يَبْكِي، وَدُمُوعُهُ تَسِيلُ عَلَى لِحْيَتِهِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم لِعَبَّاسٍ ‏\"‏ يَا عَبَّاسُ أَلاَ تَعْجَبُ مِنْ حُبِّ مُغِيثٍ بَرِيرَةَ، وَمِنْ بُغْضِ بَرِيرَةَ مُغِيثًا ‏\"‏‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَوْ رَاجَعْتِهِ ‏\"‏‏.‏ قَالَتْ يَا رَسُولَ اللَّهِ تَأْمُرُنِي قَالَ ‏\"‏ إِنَّمَا أَنَا أَشْفَعُ ‏\"‏‏.‏ قَالَتْ لاَ حَاجَةَ لِي فِيهِ‏.‏",
    "malay_translation": "Suami Barira adalah seorang hamba yang bernama Mughith. Seolah-olah aku melihatnya sekarang, berjalan di belakang Barira dan menangis dengan air matanya mengalir di janggutnya. Nabi (ﷺ) bersabda kepada `Abbas, \"Wahai `Abbas! Tidakkah engkau hairan dengan cinta Mughith kepada Barira dan kebencian Barira kepada Mughith?\" Kemudian Nabi (ﷺ) bersabda kepada Barira, \"Mengapa kamu tidak kembali kepadanya?\" Dia berkata, \"Wahai Rasulullah (ﷺ)! Adakah kamu menyuruhku berbuat demikian?\" Baginda bersabda, \"Tidak, aku hanya memberi syafaat kepadanya.\" Dia berkata, \"Aku tidak memerlukannya.\""
  },
  {
    "id": 5074,
    "hadith_number": 5074,
    "tajuk_hadith": "Aisyah Membeli Barirah dan Wala'",
    "perawi_melayu": "Al-Aswad",
    "english_text": "Aisha intended to buy Barira, but her masters stipulated that her wala wound be for them. Aisha mentioned that to the Prophet (ﷺ) who said (to `Aisha), \"Buy and manumit her, for the wala is for the one who manumits.\" Once some meat was brought to the Prophet (ﷺ) and was said, \"This meat was given in charity to Barira. \" The Prophet (ﷺ) said, \"It is an object of charity for Barira and a gift for us.\"\n\n\nNarrated Adam:\nShu`ba related the same Hadith and added: Barira was given the option regarding her husband.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ، أَخْبَرَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، أَنَّ عَائِشَةَ، أَرَادَتْ أَنْ تَشْتَرِيَ، بَرِيرَةَ، فَأَبَى مَوَالِيهَا إِلاَّ أَنْ يَشْتَرِطُوا الْوَلاَءَ، فَذَكَرَتْ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ اشْتَرِيهَا وَأَعْتِقِيهَا، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ وَأُتِيَ النَّبِيُّ صلى الله عليه وسلم بِلَحْمٍ فَقِيلَ إِنَّ هَذَا مَا تُصُدِّقَ عَلَى بَرِيرَةَ، فَقَالَ ‏\"‏ هُوَ لَهَا صَدَقَةٌ، وَلَنَا هَدِيَّةٌ ‏\"‏‏.\nحَدَّثَنَا آدَمُ حَدَّثَنَا شُعْبَةُ وَزَادَ فَخُيِّرَتْ مِنْ زَوْجِهَا‏.‏",
    "malay_translation": "Aisyah radiallahu 'anha bermaksud untuk membeli Barirah, tetapi tuannya menetapkan bahawa wala'nya (hak penjagaan) adalah untuk mereka. Aisyah menyebutkan hal itu kepada Nabi (ﷺ) yang bersabda kepada Aisyah, \"Belilah dia dan merdekakanlah dia, kerana wala' itu adalah untuk orang yang memerdekakan.\" Suatu ketika, beberapa daging dibawa kepada Nabi (ﷺ) dan dikatakan, \"Daging ini diberikan sebagai sedekah kepada Barirah.\" Nabi (ﷺ) bersabda, \"Itu adalah sedekah untuk Barirah dan hadiah untuk kita.\" \n\nDiriwayatkan oleh Adam: \nShu`ba meriwayatkan Hadith yang sama dan menambah: Barirah diberi pilihan mengenai suaminya."
  },
  {
    "id": 5075,
    "hadith_number": 5075,
    "tajuk_hadith": "Hukum Perkahwinan dengan Wanita Ahli Kitab",
    "perawi_melayu": "Diriwayatkan oleh Nafi`:",
    "english_text": "Whenever Ibn `Umar was asked about marrying a Christian lady or a Jewess, he would say: \"Allah \nhas made it unlawful for the believers to marry ladies who ascribe partners in worship to Allah, and I \ndo not know of a greater thing, as regards to ascribing partners in worship, etc. to Allah, than that a \nlady should say that Jesus is her Lord although he is just one of Allah's slaves.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا لَيْثٌ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، كَانَ إِذَا سُئِلَ عَنْ نِكَاحِ النَّصْرَانِيَّةِ، وَالْيَهُودِيَّةِ، قَالَ إِنَّ اللَّهَ حَرَّمَ الْمُشْرِكَاتِ عَلَى الْمُؤْمِنِينَ، وَلاَ أَعْلَمُ مِنَ الإِشْرَاكِ شَيْئًا أَكْبَرَ مِنْ أَنْ تَقُولَ الْمَرْأَةُ رَبُّهَا عِيسَى، وَهْوَ عَبْدٌ مِنْ عِبَادِ اللَّهِ‏.‏",
    "malay_translation": "Apabila Ibn `Umar ditanya tentang perkahwinan dengan wanita Kristian atau Yahudi, beliau berkata: \"Allah telah mengharamkan ke atas orang-orang beriman untuk mengahwini wanita yang menyekutukan Allah dalam ibadah, dan aku tidak mengetahui sesuatu yang lebih besar daripada menyekutukan Allah selain daripada seorang wanita yang mengatakan bahawa Nabi Isa adalah tuhannya sedangkan beliau hanyalah seorang hamba Allah.\""
  },
  {
    "id": 5076,
    "hadith_number": 5076,
    "tajuk_hadith": "Dua Kategori Musyrikin dan Perjanjian dengan Muslimin",
    "perawi_melayu": "Diriwayatkan daripada Ibn 'Abbas:",
    "english_text": "The pagans were of two kinds as regards their relationship to the \n     Prophet and the Believers. Some of them were those with whom the \n     Prophet was at war and used to fight against, and they used to fight \n     him; the others were those with whom the Prophet (ﷺ) made a treaty, and \n     neither did the Prophet (ﷺ) fight them, nor did they fight him. If a lady \n     from the first group of pagans emigrated towards the Muslims, her hand\n     would not be asked in marriage unless she got the menses and then \n     became clean. When she became clean, it would be lawful for her to get\n     married, and if her husband emigrated too before she got married, then\n     she would be returned to him. If any slave or female slave emigrated \n     from them to the Muslims, then they would be considered free persons \n     (not slaves) and they would have the same rights as given to other \n     emigrants. The narrator then mentioned about the pagans involved with \n     the Muslims in a treaty, the same as occurs in Mujahid's narration. If\n     a male slave or a female slave emigrated from such pagans as had made \n     a treaty with the Muslims, they would not be returned, but their \n     prices would be paid (to the pagans).",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنِ ابْنِ جُرَيْجٍ، وَقَالَ، عَطَاءٌ عَنِ ابْنِ عَبَّاسٍ، كَانَ الْمُشْرِكُونَ عَلَى مَنْزِلَتَيْنِ مِنَ النَّبِيِّ صلى الله عليه وسلم وَالْمُؤْمِنِينَ، كَانُوا مُشْرِكِي أَهْلِ حَرْبٍ يُقَاتِلُهُمْ وَيُقَاتِلُونَهُ، وَمُشْرِكِي أَهْلِ عَهْدٍ لاَ يُقَاتِلُهُمْ وَلاَ يُقَاتِلُونَهُ، وَكَانَ إِذَا هَاجَرَتِ امْرَأَةٌ مِنْ أَهْلِ الْحَرْبِ لَمْ تُخْطَبْ حَتَّى تَحِيضَ وَتَطْهُرَ، فَإِذَا طَهُرَتْ حَلَّ لَهَا النِّكَاحُ، فَإِنْ هَاجَرَ زَوْجُهَا قَبْلَ أَنْ تَنْكِحَ رُدَّتْ إِلَيْهِ، وَإِنْ هَاجَرَ عَبْدٌ مِنْهُمْ أَوْ أَمَةٌ فَهُمَا حُرَّانِ وَلَهُمَا مَا لِلْمُهَاجِرِينَ‏.‏ ثُمَّ ذَكَرَ مِنْ أَهْلِ الْعَهْدِ مِثْلَ حَدِيثِ مُجَاهِدٍ وَإِنْ هَاجَرَ عَبْدٌ أَوْ أَمَةٌ لِلْمُشْرِكِينَ أَهْلِ الْعَهْدِ لَمْ يُرَدُّوا، وَرُدَّتْ أَثْمَانُهُمْ‏.‏",
    "malay_translation": "Orang-orang musyrik terbahagi kepada dua kategori berkenaan hubungan mereka dengan Nabi dan orang-orang beriman. Sebahagian daripada mereka adalah golongan yang diperangi oleh Nabi dan mereka juga memerangi baginda; manakala sebahagian yang lain adalah golongan yang mengadakan perjanjian dengan Nabi (ﷺ), dan Nabi (ﷺ) tidak memerangi mereka, dan mereka juga tidak memerangi baginda. Jika seorang wanita daripada golongan musyrik pertama berhijrah ke arah orang Islam, tangannya tidak akan diminta untuk berkahwin melainkan dia telah datang haid dan kemudiannya suci. Apabila dia telah suci, maka halal baginya untuk berkahwin, dan jika suaminya juga berhijrah sebelum dia berkahwin, maka dia akan dikembalikan kepadanya. Jika mana-mana hamba lelaki atau hamba perempuan berhijrah daripada mereka kepada orang Islam, maka mereka akan dianggap sebagai orang merdeka (bukan hamba) dan mereka akan mempunyai hak yang sama seperti yang diberikan kepada penghijrah lain. Perawi kemudiannya menyebut tentang orang-orang musyrik yang terlibat dengan orang Islam dalam suatu perjanjian, sama seperti yang berlaku dalam riwayat Mujahid. Jika seorang hamba lelaki atau seorang hamba perempuan berhijrah daripada orang musyrik yang telah mengadakan perjanjian dengan orang Islam, mereka tidak akan dikembalikan, tetapi harga mereka akan dibayar (kepada orang musyrik)."
  },
  {
    "id": 5077,
    "hadith_number": 5077,
    "tajuk_hadith": "Pernikahan Qariba dan Um Al-Hakam",
    "perawi_melayu": "Diriwayatkan oleh Ibnu 'Abbas",
    "english_text": "Qariba, \n\n     The daughter of Abi Umaiyya, was the wife of 'Umar bin Al-Khattab. \n     'Umar divorced her and then Mu'awiyya bin Abi Sufyan married her. \n     Similarly, Um Al-Hakam, the daughter of Abi Sufyan was the wife of \n     'Iyad bin Ghanm Al-Fihri. He divorced her and then 'Abdullah bin \n     'Uthman Al-Thaqafi married her.",
    "arabic_text": "وَقَالَ عَطَاءٌ عَنِ ابْنِ عَبَّاسٍ، كَانَتْ قَرِيبَةُ بِنْتُ أَبِي أُمَيَّةَ عِنْدَ عُمَرَ بْنِ الْخَطَّابِ فَطَلَّقَهَا، فَتَزَوَّجَهَا مُعَاوِيَةُ بْنُ أَبِي سُفْيَانَ، وَكَانَتْ أُمُّ الْحَكَمِ ابْنَةُ أَبِي سُفْيَانَ تَحْتَ عِيَاضِ بْنِ غَنْمٍ الْفِهْرِيِّ فَطَلَّقَهَا، فَتَزَوَّجَهَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ الثَّقَفِيُّ‏.‏",
    "malay_translation": "Berkata 'Ata' daripada Ibnu 'Abbas, \"Qariba binti Abi Umayyah telah berkahwin dengan 'Umar bin Al-Khattab, lalu dia telah menceraikannya, kemudian Mu'awiyah bin Abi Sufyan mengahwininya. Begitu juga Um Al-Hakam, anak perempuan Abi Sufyan berkahwin dengan 'Iyad bin Ghanm Al-Fihri, lalu dia menceraikannya, kemudian 'Abdullah bin 'Uthman Al-Thaqafi mengahwininya."
  },
  {
    "id": 5078,
    "hadith_number": 5078,
    "tajuk_hadith": "Bai'ah Wanita Beriman",
    "perawi_melayu": "Diriwayatkan oleh 'Aisyah:",
    "english_text": "(the wife of the Prophet) When believing women came to the Prophet (ﷺ) as emigrants, he used to test \nthem in accordance with the order of Allah. 'O you who believe! When believing women come to you \nas emigrants, examine them . . .' (60.10) So if anyone of those believing women accepted the above \nmentioned conditions, she accepted the conditions of faith. When they agreed on those conditions and \nconfessed that with their tongues, Allah's Messenger (ﷺ) would say to them, \"Go, I have accepted your oath \nof allegiance (for Islam). By Allah, and hand of Allah's Messenger (ﷺ) never touched the hand of any \nwoman, but he only used to take their pledge of allegiance orally. By Allah, Allah's Messenger (ﷺ) did not \ntake the pledge of allegiance of the women except in accordance with what Allah had ordered him. \nWhen he accepted their pledge of allegiance he would say to them, \"I have accepted your oath of \nallegiance.\"",
    "arabic_text": "حَدَّثَنَا ابْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ،‏.‏ وَقَالَ إِبْرَاهِيمُ بْنُ الْمُنْذِرِ حَدَّثَنِي ابْنُ وَهْبٍ، حَدَّثَنِي يُونُسُ، قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ كَانَتِ الْمُؤْمِنَاتُ إِذَا هَاجَرْنَ إِلَى النَّبِيِّ صلى الله عليه وسلم يَمْتَحِنُهُنَّ بِقَوْلِ اللَّهِ تَعَالَى ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا جَاءَكُمُ الْمُؤْمِنَاتُ مُهَاجِرَاتٍ فَامْتَحِنُوهُنَّ‏}‏ إِلَى آخِرِ الآيَةِ قَالَتْ عَائِشَةُ فَمَنْ أَقَرَّ بِهَذَا الشَّرْطِ مِنَ الْمُؤْمِنَاتِ فَقَدْ أَقَرَّ بِالْمِحْنَةِ، فَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَقْرَرْنَ بِذَلِكَ مِنْ قَوْلِهِنَّ قَالَ لَهُنَّ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ انْطَلِقْنَ فَقَدْ بَايَعْتُكُنَّ ‏\"‏، لاَ وَاللَّهِ مَا مَسَّتْ يَدُ رَسُولِ اللَّهِ صلى الله عليه وسلم يَدَ امْرَأَةٍ قَطُّ، غَيْرَ أَنَّهُ بَايَعَهُنَّ بِالْكَلاَمِ، وَاللَّهِ مَا أَخَذَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى النِّسَاءِ إِلاَّ بِمَا أَمَرَهُ اللَّهُ يَقُولُ لَهُنَّ إِذَا أَخَذَ عَلَيْهِنَّ ‏\"‏ قَدْ بَايَعْتُكُنَّ ‏\"‏‏.‏ كَلاَمًا‏.‏",
    "malay_translation": "Apabila wanita-wanita yang beriman datang kepada Nabi (ﷺ) sebagai Muhajirat (orang yang berhijrah), Baginda menguji mereka sesuai dengan perintah Allah.  “Wahai orang-orang yang beriman! Apabila datang kepada kamu wanita-wanita yang beriman yang berhijrah, maka hendaklah kamu menguji mereka…” (60:10).  Maka, sesiapa sahaja dari wanita-wanita yang beriman itu menerima syarat-syarat yang disebutkan di atas, maka dia telah menerima syarat-syarat keimanan.  Apabila mereka bersetuju dengan syarat-syarat tersebut dan mengakuinya dengan lisan mereka, Rasulullah (ﷺ) akan berkata kepada mereka, “Pergilah, sesungguhnya aku telah menerima bai’ah (ikrar setia) kamu (untuk Islam).”  Demi Allah, tangan Rasulullah (ﷺ) tidak pernah menyentuh tangan mana-mana wanita, tetapi Baginda hanya mengambil bai'ah mereka secara lisan. Demi Allah, Rasulullah (ﷺ) tidak mengambil bai'ah wanita-wanita itu kecuali sesuai dengan apa yang Allah perintahkan kepada Baginda. Apabila Baginda menerima bai'ah mereka, Baginda akan berkata kepada mereka, “Aku telah menerima bai’ah kamu.”"
  },
  {
    "id": 5079,
    "hadith_number": 5079,
    "tajuk_hadith": "Rasulullah ﷺ Bersumpah untuk Menjauhi Isterinya",
    "perawi_melayu": "Diriwayatkan daripada Anas bin Malik:",
    "english_text": "Allah's Messenger (ﷺ) took an oath that he would abstain from his wives, and at that time his leg had been \nsprained (dislocated). So he stayed in the Mashruba (an attic room) of his for 29 days. Then he came \ndown, and they (the people) said, \"O Allah's Messenger (ﷺ)! You took an oath to abstain from your wives for \none month.\" He said, \"The month is of twenty nine days.\"",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، عَنْ أَخِيهِ، عَنْ سُلَيْمَانَ، عَنْ حُمَيْدٍ الطَّوِيلِ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ آلَى رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ نِسَائِهِ، وَكَانَتِ انْفَكَّتْ رِجْلُهُ فَأَقَامَ فِي مَشْرُبَةٍ لَهُ تِسْعًا وَعِشْرِينَ، ثُمَّ نَزَلَ فَقَالُوا يَا رَسُولَ اللَّهِ آلَيْتَ شَهْرًا‏.‏ فَقَالَ ‏\n\"‏ الشَّهْرُ تِسْعٌ وَعِشْرُونَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah ﷺ bersumpah untuk menjauhi isteri-isterinya, dan pada masa itu kakinya telah terseliuh (terkehel). Baginda kemudian tinggal di dalam Mashruba (bilik loteng) baginda selama 29 hari. Kemudian baginda turun, dan mereka (orang ramai) berkata, \"Wahai Rasulullah ﷺ! Kamu telah bersumpah untuk menjauhi isteri-isteri kamu selama satu bulan.\" Baginda bersabda, \"Bulan itu adalah dua puluh sembilan hari.\""
  },
  {
    "id": 5080,
    "hadith_number": 5080,
    "tajuk_hadith": "Hukum Ila' (Sumpah Tidak Mendekati Isteri)",
    "perawi_melayu": "Diriwayatkan oleh Nafi':",
    "english_text": "Ibn `Umar used to say about the Ila (which Allah defined (in the Holy Book), \"If the period of Ila \nexpires, then the husband has either to retain his wife in a handsome manner or to divorce her as Allah \nhas ordered.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، رضى الله عنهما كَانَ يَقُولُ فِي الإِيلاَءِ الَّذِي سَمَّى اللَّهُ لاَ يَحِلُّ لأَحَدٍ بَعْدَ الأَجَلِ إِلاَّ أَنْ يُمْسِكَ بِالْمَعْرُوفِ، أَوْ يَعْزِمَ بِالطَّلاَقِ، كَمَا أَمَرَ اللَّهُ عَزَّ وَجَلَّ‏.‏",
    "malay_translation": "Ibnu Umar رضي الله عنهما berkata mengenai Ila' (yang Allah tetapkan dalam Al-Quran), \"Apabila tempoh Ila' telah tamat, maka suami sama ada perlu mengekalkan isterinya dengan cara yang baik atau menceraikannya sebagaimana yang Allah perintahkan.\""
  },
  {
    "id": 5081,
    "hadith_number": 5081,
    "tajuk_hadith": "Tempoh Empat Bulan untuk Perceraian",
    "perawi_melayu": "Ibn `Umar",
    "english_text": "\"When the period of four months has expired, the husband should be \nput in prison so that he should divorce his wife, but the divorce does not occur unless the husband \nhimself declares it. This has been mentioned by `Uthman, `Ali, Abu Ad-Darda, `Aisha and twelve \nother companions of the Prophet (ﷺ) .\"",
    "arabic_text": "وَقَالَ لِي إِسْمَاعِيلُ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، إِذَا مَضَتْ أَرْبَعَةُ أَشْهُرٍ يُوقَفُ حَتَّى يُطَلِّقَ، وَلاَ يَقَعُ عَلَيْهِ الطَّلاَقُ حَتَّى يُطَلِّقَ‏.‏ وَيُذْكَرُ ذَلِكَ عَنْ عُثْمَانَ وَعَلِيٍّ وَأَبِي الدَّرْدَاءِ وَعَائِشَةَ وَاثْنَىْ عَشَرَ رَجُلاً مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Apabila tempoh empat bulan telah tamat, suami hendaklah dipenjarakan supaya dia menceraikan isterinya, tetapi perceraian tidak berlaku melainkan suami sendiri mengisytiharkannya. Perkara ini telah disebut oleh `Uthman, `Ali, Abu Ad-Darda, `Aisha dan dua belas orang sahabat Nabi (ﷺ)."
  },
  {
    "id": 5082,
    "hadith_number": 5082,
    "tajuk_hadith": "Hukum Terhadap Haiwan dan Barang Hilang",
    "perawi_melayu": "Diriwayatkan oleh Yazid:",
    "english_text": "(the Maula of Munba'ith) The Prophet (ﷺ) was asked regarding the case of a lost sheep. He said, \"You \nshould take it, because it is for you, or for your brother, or for the wolf.\" Then he was asked about a \nlost camel. He got angry and his face became red and he said (to the questioner), \"You have nothing to \ndo with it; it has its feet and its water container with it; it can go on drinking water and eating trees till \nits owner meets it.\" And then the Prophet (ﷺ) was asked about a Luqata (money found by somebody). He \nsaid, \"Remember and recognize its tying material and its container, and make public announcement \nabout it for one year. If somebody comes and identifies it (then give it to him), otherwise add it to \nyour property.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ يَزِيدَ، مَوْلَى الْمُنْبَعِثِ أَنَّ النَّبِيَّ صلى الله عليه وسلم سُئِلَ عَنْ ضَالَّةِ الْغَنَمِ فَقَالَ ‏\"‏ خُذْهَا، فَإِنَّمَا هِيَ لَكَ أَوْ لأَخِيكَ أَوْ لِلذِّئْبِ ‏\"‏‏.‏ وَسُئِلَ عَنْ ضَالَّةِ الإِبِلِ، فَغَضِبَ وَاحْمَرَّتْ وَجْنَتَاهُ، وَقَالَ ‏\"‏ مَا لَكَ وَلَهَا، مَعَهَا الْحِذَاءُ وَالسِّقَاءُ، تَشْرَبُ الْمَاءَ، وَتَأْكُلُ الشَّجَرَ، حَتَّى يَلْقَاهَا رَبُّهَا ‏\"‏‏.‏ وَسُئِلَ عَنِ اللُّقَطَةِ فَقَالَ ‏\"‏ اعْرِفْ وِكَاءَهَا وَعِفَاصَهَا، وَعَرِّفْهَا سَنَةً، فَإِنْ جَاءَ مَنْ يَعْرِفُهَا، وَإِلاَّ فَاخْلِطْهَا بِمَالِكَ ‏\"‏‏.‏ قَالَ سُفْيَانُ فَلَقِيتُ رَبِيعَةَ بْنَ أَبِي عَبْدِ الرَّحْمَنِ ـ قَالَ سُفْيَانُ وَلَمْ أَحْفَظْ عَنْهُ شَيْئًا غَيْرَ هَذَا ـ فَقُلْتُ أَرَأَيْتَ حَدِيثَ يَزِيدَ مَوْلَى الْمُنْبَعِثِ فِي أَمْرِ الضَّالَّةِ، هُوَ عَنْ زَيْدِ بْنِ خَالِدٍ قَالَ نَعَمْ‏.‏ قَالَ يَحْيَى وَيَقُولُ رَبِيعَةُ عَنْ يَزِيدَ مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ خَالِدٍ‏.‏ قَالَ سُفْيَانُ فَلَقِيتُ رَبِيعَةَ فَقُلْتُ لَهُ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) ditanya tentang kambing yang hilang. Baginda bersabda, \"Ambillah ia, kerana ia adalah milikmu, atau milik saudaramu, atau dimakan oleh serigala.\" Kemudian baginda ditanya tentang unta yang hilang. Baginda berasa marah dan wajah baginda menjadi merah dan bersabda (kepada penanya), \"Kamu tiada kaitan dengannya; ia mempunyai kaki dan bekas airnya bersamanya; ia boleh terus minum air dan memakan pokok sehingga tuannya menemuinya.\" Dan kemudian Rasulullah (ﷺ) ditanya tentang Luqatah (wang yang ditemui oleh seseorang). Baginda bersabda, \"Ingat dan kenali ikatan dan bekasnya, dan war-warkan mengenainya selama satu tahun. Jika seseorang datang dan mengenalinya (maka berikanlah kepadanya), jika tidak, campurkanlah ia dengan hartamu.\""
  },
  {
    "id": 5083,
    "hadith_number": 5083,
    "tajuk_hadith": "Rasulullah ﷺ Melakukan Tawaf Sambil Menunggang Unta",
    "perawi_melayu": "Diriwayatkan oleh Ibnu Abbas:",
    "english_text": "Allah's Messenger (ﷺ) performed the Tawaf (around the Ka`ba while riding his camel, and every time he \nreached the corner (of the Black Stone) he pointed at it with his hand and said, \"Allahu Akbar.\" \n(Zainab said: The Prophet (ﷺ) said, \"An opening has been made in the wall of Gog and Magog like this \nand this,\" forming the number 90 (with his thumb and index finger).",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو عَامِرٍ عَبْدُ الْمَلِكِ بْنُ عَمْرٍو، حَدَّثَنَا إِبْرَاهِيمُ، عَنْ خَالِدٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ طَافَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى بَعِيرِهِ، وَكَانَ كُلَّمَا أَتَى عَلَى الرُّكْنِ أَشَارَ إِلَيْهِ، وَكَبَّرَ‏.‏   \nوَقَالَتْ زَيْنَبُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ فُتِحَ مِنْ رَدْمِ يَأْجُوجَ وَمَأْجُوجَ مِثْلُ هَذِهِ ‏\"‏‏.‏ وَعَقَدَ تِسْعِينَ‏.‏",
    "malay_translation": "Rasulullah ﷺ melakukan Tawaf (mengelilingi Ka'bah) sambil menunggang unta, dan setiap kali Baginda sampai di penjuru (Hajar Aswad), Baginda menunjuk ke arahnya dengan tangan dan berkata, \"Allahu Akbar.\" (Zainab berkata: Nabi ﷺ bersabda, \"Telah dibuatkan bukaan pada dinding Ya'juj dan Ma'juj seperti ini dan ini,\" sambil membentuk angka 90 (dengan ibu jari dan jari telunjuknya)."
  },
  {
    "id": 5084,
    "hadith_number": 5084,
    "tajuk_hadith": "Keistimewaan Waktu di Hari Jumaat",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "Abul Qasim (the Prophet (ﷺ) ) said, \"There is an hour (or a moment) of \n     particular significance on Friday. If it happens that a Muslim is \n     offering a prayer and invoking Allah for some good at that very \n     moment, Allah will grant him his request.\" (The sub-narrator placed \n     the top of his finger on the palm of the other hand between the middle\n     finger and the little one.)",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا سَلَمَةُ بْنُ عَلْقَمَةَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ أَبُو الْقَاسِمِ صلى الله عليه وسلم ‏\n\"‏ فِي الْجُمُعَةِ سَاعَةٌ لاَ يُوَافِقُهَا مُسْلِمٌ قَائِمٌ يُصَلِّي، فَسَأَلَ اللَّهَ خَيْرًا، إِلاَّ أَعْطَاهُ ‏\"‏‏.‏ وَقَالَ بِيَدِهِ، وَوَضَعَ أَنْمَلَتَهُ عَلَى بَطْنِ الْوُسْطَى وَالْخِنْصَرِ‏.‏ قُلْنَا يُزَهِّدُهَا‏.‏",
    "malay_translation": "Abu al-Qasim (Nabi Muhammad ﷺ) bersabda, \"Terdapat satu saat yang istimewa pada hari Jumaat. Sekiranya seorang Muslim menunaikan solat dan memohon kepada Allah kebaikan pada saat itu, nescaya Allah akan mengabulkan permintaannya.\" (Perawi tambahan meletakkan hujung jarinya di tapak tangan yang lain, di antara jari tengah dan jari kelingking.)"
  },
  {
    "id": 5085,
    "hadith_number": 5085,
    "tajuk_hadith": "Seorang Yahudi Membunuh Seorang Gadis",
    "perawi_melayu": "Diriwayatkan oleh Anas bin Malik:",
    "english_text": "During the lifetime of Allah's Messenger (ﷺ) a Jew attacked a girl and took \n     some silver ornaments she was wearing and crushed her head. Her \n     relative brought her to the Prophet (ﷺ) while she was in her last breaths,\n     and she was unable to speak. Allah's Messenger (ﷺ) asked her, \"Who has hit \n     you? So-and so?\", mentioning somebody other than her murderer. She \n     moved her head, indicating denial. The Prophet (ﷺ) mentioned another \n     person other than the murderer, and she again moved her head \n     indicating denial. Then he asked, \"Was it so-and-so?\", mentioning the \n     name of her killer. She nodded, agreeing. Then Allah's Messenger (ﷺ); \n     ordered that the head of that Jew be crushed between two stones.",
    "arabic_text": "وَقَالَ الأُوَيْسِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ شُعْبَةَ بْنِ الْحَجَّاجِ، عَنْ هِشَامِ بْنِ زَيْدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ عَدَا يَهُودِيٌّ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى جَارِيَةٍ، فَأَخَذَ أَوْضَاحًا كَانَتْ عَلَيْهَا وَرَضَخَ رَأْسَهَا، فَأَتَى بِهَا أَهْلُهَا رَسُولَ اللَّهِ صلى الله عليه وسلم وَهْىَ فِي آخِرِ رَمَقٍ، وَقَدْ أُصْمِتَتْ، فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ قَتَلَكِ فُلاَنٌ ‏\"‏‏.‏ لِغَيْرِ الَّذِي قَتَلَهَا، فَأَشَارَتْ بِرَأْسِهَا أَنْ لاَ، قَالَ فَقَالَ لِرَجُلٍ آخَرَ غَيْرِ الَّذِي قَتَلَهَا، فَأَشَارَتْ أَنْ لاَ، فَقَالَ ‏\"‏ فَفُلاَنٌ ‏\"‏‏.‏ لِقَاتِلِهَا فَأَشَارَتْ أَنْ نَعَمْ، فَأَمَرَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَرُضِخَ رَأْسُهُ بَيْنَ حَجَرَيْنِ‏.‏",
    "malay_translation": "Semasa hayat Rasulullah (ﷺ), seorang lelaki Yahudi menyerang seorang gadis dan mengambil beberapa perhiasan perak yang dipakainya lalu memecahkan kepalanya. Saudara-maranya membawa gadis itu kepada Nabi (ﷺ) ketika dia sedang nazak, dan dia tidak dapat bercakap. Rasulullah (ﷺ) bertanya kepadanya, \"Siapakah yang memukul kamu? Si anu?\", menyebut seseorang selain pembunuhnya. Dia mengangguk kepalanya, menunjukkan penolakan. Nabi (ﷺ) menyebut orang lain selain pembunuhnya, dan dia sekali lagi mengangguk kepalanya menunjukkan penolakan. Kemudian dia bertanya, \"Adakah si anu?\", menyebut nama pembunuhnya. Dia mengangguk, bersetuju. Kemudian Rasulullah (ﷺ) memerintahkan agar kepala Yahudi itu dipecahkan di antara dua batu."
  },
  {
    "id": 5086,
    "hadith_number": 5086,
    "tajuk_hadith": "Fitnah Akan Muncul dari Timur",
    "perawi_melayu": "Diriwayatkan oleh Ibnu Umar:",
    "english_text": "I heard the Prophet (ﷺ) saying, \"Afflictions will emerge from here,\" pointing towards the East.",
    "arabic_text": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الْفِتْنَةُ مِنْ هَا هُنَا ‏\"‏‏.‏ وَأَشَارَ إِلَى الْمَشْرِقِ‏.‏",
    "malay_translation": "Saya mendengar Nabi (ﷺ) bersabda, \"Fitnah akan muncul dari sini,\" sambil menunjuk ke arah Timur."
  },
  {
    "id": 5087,
    "hadith_number": 5087,
    "tajuk_hadith": "Waktu Berbuka Puasa: Apabila Malam Muncul dari Timur",
    "perawi_melayu": "Diriwayatkan daripada 'Abdullah bin Abi A'ufa:",
    "english_text": "We were with Allah's Messenger (ﷺ) on a journey, and when the sun set, he said to a man, \"Get down and \nprepare a drink of Sawiq for me.\" The man said, \"O Allah's Messenger (ﷺ)! Will you wait till it is evening?\" \nAllah's Messenger (ﷺ) again said, \"Get down and prepare a drink of Sawiq.\" The man said, \"O Allah's \nApostle! Will you wait till it is evening, for it is still daytime. \" The Prophet (ﷺ) again said, \"Get down \nand prepare a drink of Sawiq.\" So the third time the man got down and prepared a drink of sawiq for \nhim. Allah's Messenger (ﷺ) drank thereof and pointed with his hand towards the East, saying, \"When you see \nthe night falling from this side, then a fasting person should break his fast.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ، عَنْ أَبِي إِسْحَاقَ الشَّيْبَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى، قَالَ كُنَّا فِي سَفَرٍ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا غَرَبَتِ الشَّمْسُ قَالَ لِرَجُلٍ ‏\"‏ انْزِلْ فَاجْدَحْ لِي ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ لَوْ أَمْسَيْتَ‏.‏ ثُمَّ قَالَ ‏\"‏ انْزِلْ فَاجْدَحْ ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ لَوْ أَمْسَيْتَ إِنَّ عَلَيْكَ نَهَارًا‏.‏ ثُمَّ قَالَ ‏\"‏ انْزِلْ فَاجْدَحْ ‏\"‏‏.‏ فَنَزَلَ فَجَدَحَ لَهُ فِي الثَّالِثَةِ، فَشَرِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ أَوْمَأَ بِيَدِهِ إِلَى الْمَشْرِقِ فَقَالَ ‏\"‏ إِذَا رَأَيْتُمُ اللَّيْلَ قَدْ أَقْبَلَ مِنْ هَا هُنَا فَقَدْ أَفْطَرَ الصَّائِمُ ‏\"‏‏.‏",
    "malay_translation": "Kami bersama Rasulullah (ﷺ) dalam suatu perjalanan. Apabila matahari terbenam, Baginda bersabda kepada seorang lelaki, \"Turunlah dan sediakan minuman Sawiq untukku.\" Lelaki itu berkata, \"Wahai Rasulullah (ﷺ)! Adakah baginda akan menunggu sehingga tiba waktu malam?\" Rasulullah (ﷺ) bersabda lagi, \"Turunlah dan sediakan minuman Sawiq.\" Lelaki itu berkata, \"Wahai Rasulullah! Adakah baginda akan menunggu sehingga tiba waktu malam, kerana masih siang?\" Nabi (ﷺ) bersabda lagi, \"Turunlah dan sediakan minuman Sawiq.\" Maka pada kali ketiga, lelaki itu turun dan menyediakan minuman sawiq untuk Baginda. Rasulullah (ﷺ) meminumnya, kemudian Baginda menunjuk dengan tangannya ke arah Timur seraya bersabda, \"Apabila kamu melihat malam muncul dari arah ini, maka orang yang berpuasa hendaklah berbuka puasa.\""
  },
  {
    "id": 5088,
    "hadith_number": 5088,
    "tajuk_hadith": "Adzan Bilal dan Waktu Sahur",
    "perawi_melayu": "Diriwayatkan daripada 'Abdullah bin Mas'ud:",
    "english_text": "The Prophet (ﷺ) said, \"The call (or the Adhan) of Bilal should not stop you from taking the Suhur-meals for Bilal calls (or pronounces the Adhan) so that the one who is offering the night prayer should take a rest, and he does not indicate the daybreak or dawn.\" The narrator, Yazid, described (how dawn breaks) by stretching out his hands and then separating them wide apart.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ أَبِي عُثْمَانَ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ يَمْنَعَنَّ أَحَدًا مِنْكُمْ نِدَاءُ بِلاَلٍ ـ أَوْ قَالَ أَذَانُهُ ـ مِنْ سَحُورِهِ، فَإِنَّمَا يُنَادِي أَوْ قَالَ يُؤَذِّنُ لِيَرْجِعَ قَائِمُكُمْ ‏\"‏‏.‏ وَلَيْسَ أَنْ يَقُولَ كَأَنَّهُ يَعْنِي الصُّبْحَ أَوِ الْفَجْرَ، وَأَظْهَرَ يَزِيدُ يَدَيْهِ ثُمَّ مَدَّ إِحْدَاهُمَا مِنَ الأُخْرَى‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda, \"Panggilan (atau Adzan) Bilal janganlah menghalangimu daripada mengambil makanan sahur. Bilal melaungkan (atau mengumandangkan Adzan) supaya orang yang sedang menunaikan solat malam berehat, dan ia tidak menunjukkan waktu fajar atau subuh.\" Perawi, Yazid, menerangkan (bagaimana fajar menyingsing) dengan merentangkan tangannya dan kemudian memisahkan kedua-duanya."
  },
  {
    "id": 5089,
    "hadith_number": 5089,
    "tajuk_hadith": "Perumpamaan Orang Kedekut dan Pemurah",
    "perawi_melayu": "Diriwayatkan oleh Abu Huraira:",
    "english_text": "Allah's Messenger (ﷺ) said, The example of a miser and a generous person is \n     like that of two persons wearing iron cloaks from the breast upto the \n     neck When the generous person spends, the iron cloak enlarges and \n     spread over his skin so much so that it covers his fingertips and \n     obliterates his tracks. As for the miser, as soon as he thinks of \n     spending every ring of the iron cloak sticks to its place (against his\n     body) and he tries to expand it, but it does not expand. The Prophet (ﷺ) \n     pointed with his hand towards his throat.",
    "arabic_text": "وَقَالَ اللَّيْثُ حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ، سَمِعْتُ أَبَا هُرَيْرَةَ، قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَثَلُ الْبَخِيلِ وَالْمُنْفِقِ كَمَثَلِ رَجُلَيْنِ عَلَيْهِمَا جُبَّتَانِ مِنْ حَدِيدٍ، مِنْ لَدُنْ ثَدْيَيْهِمَا إِلَى تَرَاقِيهِمَا، فَأَمَّا الْمُنْفِقُ فَلاَ يُنْفِقُ شَيْئًا إِلاَّ مَادَّتْ عَلَى جِلْدِهِ حَتَّى تُجِنَّ بَنَانَهُ وَتَعْفُوَ أَثَرَهُ، وَأَمَّا الْبَخِيلُ فَلاَ يُرِيدُ يُنْفِقُ إِلاَّ لَزِمَتْ كُلُّ حَلْقَةٍ مَوْضِعَهَا، فَهْوَ يُوسِعُهَا فَلاَ تَتَّسِعُ ‏\"‏‏.‏ وَيُشِيرُ بِإِصْبَعِهِ إِلَى حَلْقِهِ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda: “Perumpamaan orang yang kedekut dan orang yang pemurah adalah seperti dua orang lelaki yang memakai jubah besi dari dada hingga ke leher. Apabila orang yang pemurah itu membelanjakan (hartanya), jubah besi itu mengembang dan meluas ke atas kulitnya sehingga menutupi hujung jarinya dan menghilangkan kesan langkahnya. Adapun orang yang kedekut, apabila dia berniat untuk membelanjakan (hartanya), setiap gelang jubah besi itu melekat di tempatnya (pada tubuhnya) dan dia cuba untuk mengembangkannya, tetapi ia tidak mengembang.” Nabi (ﷺ) menunjuk dengan tangannya ke arah kerongkongnya."
  },
  {
    "id": 5090,
    "hadith_number": 5090,
    "tajuk_hadith": "Keluarga Terbaik di Kalangan Ansar",
    "perawi_melayu": "Diriwayatkan daripada Anas bin Malik:",
    "english_text": "Allah's Messenger (ﷺ) said, \"Shall I tell you of the best families among the Ansar?\" They (the people) said, \n\"Yes, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) said, \"The best are Banu- An-Najjar, and after them are Banu \n`Abdil Ash-hal, and after them are Banu Al-Harith bin Al-Khazraj, and after them are Banu Sa`ida.\" \nThe Prophet (ﷺ) then moved his hand by closing his fingers and then opening them like one throwing \nsomething, and then said, \"Anyhow, there is good in all the families of the Ansar. \"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا لَيْثٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ الأَنْصَارِيِّ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَلاَ أُخْبِرُكُمْ بِخَيْرِ دُورِ الأَنْصَارِ ‏\"‏‏.‏ قَالُوا بَلَى يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ بَنُو النَّجَّارِ، ثُمَّ الَّذِينَ يَلُونَهُمْ بَنُو عَبْدِ الأَشْهَلِ، ثُمَّ الَّذِينَ يَلُونَهُمْ بَنُو الْحَارِثِ بْنِ الْخَزْرَجِ، ثُمَّ الَّذِينَ يَلُونَهُمْ بَنُو سَاعِدَةَ ‏\"‏‏.‏ ثُمَّ قَالَ بِيَدِهِ، فَقَبَضَ أَصَابِعَهُ، ثُمَّ بَسَطَهُنَّ كَالرَّامِي بِيَدِهِ ثُمَّ قَالَ ‏\"‏ وَفِي كُلِّ دُورِ الأَنْصَارِ خَيْرٌ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda, \"Mahukah aku khabarkan kepada kamu keluarga terbaik di kalangan Ansar?\" Mereka (para sahabat) menjawab, \"Tentu, wahai Rasulullah (ﷺ)!\" Nabi (ﷺ) bersabda, \"Yang terbaik ialah Banu An-Najjar, kemudian Banu `Abdil Ash-hal, kemudian Banu Al-Harith bin Al-Khazraj, dan kemudian Banu Sa`ida.\" Kemudian Nabi (ﷺ) menggerakkan tangannya dengan menggenggam jari-jemarinya, kemudian membukanya seperti orang yang sedang membaling sesuatu, kemudian bersabda, \"Walau bagaimanapun, terdapat kebaikan pada semua keluarga Ansar.\""
  },
  {
    "id": 5091,
    "hadith_number": 5091,
    "tajuk_hadith": "Jarak Antara Kedatangan Nabi (ﷺ) dan Kiamat",
    "perawi_melayu": "Diriwayatkan oleh Sahl bin Sa`d As-Sa`idi:",
    "english_text": "(a companion of Allah's Messenger (ﷺ)) Allah's Messenger (ﷺ), holding out his middle and index fingers, said, \"My \nadvent and the Hour's are like this (or like these),\" namely, the period between his era and the Hour is \nlike the distance between those two fingers, i.e., very short.",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ أَبُو حَازِمٍ سَمِعْتُهُ مِنْ، سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ صَاحِبِ رَسُولِ اللَّهِ صلى الله عليه وسلم يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ بُعِثْتُ أَنَا وَالسَّاعَةَ كَهَذِهِ مِنْ هَذِهِ أَوْ كَهَاتَيْنِ ‏\"‏‏.‏ وَقَرَنَ بَيْنَ السَّبَّابَةِ وَالْوُسْطَى‏.‏",
    "malay_translation": "Seorang sahabat Rasulullah (ﷺ) memegang jari tengah dan jari telunjuknya, lalu bersabda, \"Kedatanganku dan (hari) Kiamat adalah seperti ini (atau seperti ini),\" iaitu tempoh antara zamannya dan Kiamat adalah seperti jarak antara dua jari tersebut, iaitu sangat singkat."
  },
  {
    "id": 5092,
    "hadith_number": 5092,
    "tajuk_hadith": "Bilangan Hari dalam Sebulan",
    "perawi_melayu": "Diriwayatkan oleh Ibn `Umar:",
    "english_text": "The Prophet (holding out his ten fingers thrice), said, \"The month is thus and thus and thus,\" namely \nthirty days. Then (holding out his ten fingers twice and then nine fingers), he said, \"It may be thus and \nthus and thus,\" namely twenty nine days. He meant once thirty days and once twenty nine days.",
    "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا جَبَلَةُ بْنُ سُحَيْمٍ، سَمِعْتُ ابْنَ عُمَرَ، يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ الشَّهْرُ هَكَذَا وَهَكَذَا وَهَكَذَا ‏\"‏‏.‏ يَعْنِي ثَلاَثِينَ، ثُمَّ قَالَ ‏\"‏ وَهَكَذَا وَهَكَذَا وَهَكَذَا ‏\"‏‏.‏ يَعْنِي تِسْعًا وَعِشْرِينَ يَقُولُ، مَرَّةً ثَلاَثِينَ وَمَرَّةً تِسْعًا وَعِشْرِينَ‏.‏",
    "malay_translation": "Nabi (sambil menunjukkan sepuluh jarinya tiga kali) bersabda, \"Bulan itu adalah begini, begini, dan begini,\" iaitu tiga puluh hari. Kemudian (sambil menunjukkan sepuluh jarinya dua kali dan kemudian sembilan jari), Baginda bersabda, \"Ia mungkin begini, begini, dan begini,\" iaitu dua puluh sembilan hari. Baginda bermaksud sekali tiga puluh hari dan sekali dua puluh sembilan hari."
  },
  {
    "id": 5093,
    "hadith_number": 5093,
    "tajuk_hadith": "Iman di Yaman dan Ketegasan di Timur",
    "perawi_melayu": "Diriwayatkan oleh Abu Masud:",
    "english_text": "The Prophet (ﷺ) pointed with his hand towards Yemen and said twice, \"Faith is there,\" and then pointed \ntowards the East, and said, \"Verily, sternness and mercilessness are the qualities of those who are busy \nwith their camels and pay no attention to their religion, where the two sides of the head of Satan will \nappear,\" namely, the tribes of Rabl'a and Muqar.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، عَنْ أَبِي مَسْعُودٍ، قَالَ وَأَشَارَ النَّبِيُّ صلى الله عليه وسلم بِيَدِهِ نَحْوَ الْيَمَنِ ‏\n\"‏ الإِيمَانُ هَا هُنَا ـ مَرَّتَيْنِ ـ أَلاَ وَإِنَّ الْقَسْوَةَ وَغِلَظَ الْقُلُوبِ فِي الْفَدَّادِينَ حَيْثُ يَطْلُعُ قَرْنَا الشَّيْطَانِ رَبِيعَةَ وَمُضَرَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah (ﷺ) menunjuk dengan tangannya ke arah Yaman dan bersabda dua kali, \"Iman di sana,\" kemudian menunjuk ke arah Timur, dan bersabda, \"Sesungguhnya, kekerasan dan kezaliman adalah sifat-sifat mereka yang sibuk dengan unta mereka dan tidak memberi perhatian kepada agama mereka, di mana akan muncul dua sisi kepala syaitan,\" iaitu, kabilah Rabl'a dan Muqar."
  },
  {
    "id": 5094,
    "hadith_number": 5094,
    "tajuk_hadith": "Kedudukan Penjaga Anak Yatim di Syurga",
    "perawi_melayu": "Sahih, diriwayatkan oleh Sahl.",
    "english_text": "Allah's Messenger (ﷺ) said, \"I and the one who looks after an orphan will be like this in Paradise,\" showing \nhis middle and index fingers and separating them.",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ زُرَارَةَ، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلٍ، قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَنَا وَكَافِلُ الْيَتِيمِ فِي الْجَنَّةِ هَكَذَا ‏\"‏‏.‏ وَأَشَارَ بِالسَّبَّابَةِ وَالْوُسْطَى، وَفَرَّجَ بَيْنَهُمَا شَيْئًا‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda, \"Aku dan orang yang menjaga anak yatim akan berada (kedudukannya) di syurga seperti ini,\" sambil menunjukkan jari tengah dan jari telunjuknya dan merenggangkan sedikit antara kedua jarinya."
  },
  {
    "id": 5095,
    "hadith_number": 5095,
    "tajuk_hadith": "Kelahiran Anak Hitam dan Pewarisan Sifat",
    "perawi_melayu": "Diriwayatkan oleh Abu Huraira:",
    "english_text": "A man came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! A black child has been born for me.\" The \nProphet asked him, \"Have you got camels?\" The man said, \"Yes.\" The Prophet (ﷺ) asked him, \"What \ncolor are they?\" The man replied, \"Red.\" The Prophet (ﷺ) said, \"Is there a grey one among them?' The \nman replied, \"Yes.\" The Prophet (ﷺ) said, \"Whence comes that?\" He said, \"May be it is because of \nheredity.\" The Prophet (ﷺ) said, \"May be your latest son has this color because of heredity.\"",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ وُلِدَ لِي غُلاَمٌ أَسْوَدُ‏.‏ فَقَالَ ‏\"‏ هَلْ لَكَ مِنْ إِبِلٍ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ مَا أَلْوَانُهَا ‏\"‏‏.‏ قَالَ حُمْرٌ‏.‏ قَالَ ‏\"‏ هَلْ فِيهَا مِنْ أَوْرَقَ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَأَنَّى ذَلِكَ ‏\"‏‏.‏ قَالَ لَعَلَّهُ نَزَعَهُ عِرْقٌ‏.‏ قَالَ ‏\"‏ فَلَعَلَّ ابْنَكَ هَذَا نَزَعَهُ ‏\"‏‏.‏",
    "malay_translation": "Seorang lelaki datang kepada Nabi (ﷺ) dan berkata, \"Wahai Rasulullah (ﷺ)! Seorang anak hitam telah dilahirkan untukku.\" Nabi bertanya kepadanya, \"Adakah kamu mempunyai unta?\" Lelaki itu berkata, \"Ya.\" Nabi (ﷺ) bertanya kepadanya, \"Apakah warna mereka?\" Lelaki itu menjawab, \"Merah.\" Nabi (ﷺ) berkata, \"Adakah terdapat seekor unta kelabu di kalangan mereka?\" Lelaki itu menjawab, \"Ya.\" Nabi (ﷺ) berkata, \"Dari mana datangnya itu?\" Dia berkata, \"Mungkin ia kerana keturunan.\" Nabi (ﷺ) berkata, \"Mungkin anakmu yang terkini mempunyai warna ini kerana keturunan.\""
  },
  {
    "id": 5096,
    "hadith_number": 5096,
    "tajuk_hadith": "Seorang Lelaki Ansar Menuduh Isterinya (Zina) dan Sumpah Lian",
    "perawi_melayu": "Diriwayatkan oleh Abdullah",
    "english_text": "An Ansari man accused his wife (of committing illegal sexual intercourse). The Prophet (ﷺ) made both of \nthem takes the oath of Lian, and separated them from each other (by divorce).",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلُ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ أَنَّ رَجُلاً مِنَ الأَنْصَارِ قَذَفَ امْرَأَتَهُ فَأَحْلَفَهُمَا النَّبِيُّ صلى الله عليه وسلم ثُمَّ فَرَّقَ بَيْنَهُمَا‏.‏",
    "malay_translation": "Seorang lelaki Ansar menuduh isterinya melakukan persetubuhan haram. Nabi (ﷺ) membuat kedua-dua mereka mengangkat sumpah Lian, dan memisahkan mereka (dengan perceraian)."
  },
  {
    "id": 5097,
    "hadith_number": 5097,
    "tajuk_hadith": "Hilal bin Umaiyya Mendakwa Isterinya dan Kesaksian Lian",
    "perawi_melayu": "Diriwayatkan oleh Ibnu Abbas:",
    "english_text": "Hilal bin Umaiyya accused his wife of illegal sexual intercourse and came to the Prophet (ﷺ) to bear \nwitness (against her), (taking the oath of Lian). The Prophet (ﷺ) was saying, \"Allah knows that either of \nyou is a liar. Will anyone of you repent (to Allah)?\" Then the lady got up and gave her witness.",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ هِشَامِ بْنِ حَسَّانَ، حَدَّثَنَا عِكْرِمَةُ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ هِلاَلَ بْنَ أُمَيَّةَ، قَذَفَ امْرَأَتَهُ، فَجَاءَ فَشَهِدَ وَالنَّبِيُّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ اللَّهَ يَعْلَمُ أَنَّ أَحَدَكُمَا كَاذِبٌ، فَهَلْ مِنْكُمَا تَائِبٌ ‏\"‏‏.‏ ثُمَّ قَامَتْ فَشَهِدَتْ‏.‏",
    "malay_translation": "Hilal bin Umaiyya menuduh isterinya melakukan persetubuhan haram dan datang kepada Nabi (ﷺ) untuk memberi kesaksian (terhadapnya), (mengambil sumpah Lian). Nabi (ﷺ) bersabda, \"Allah mengetahui bahawa salah seorang daripada kamu adalah pendusta. Adakah sesiapa di antara kamu yang bertaubat (kepada Allah)?\" Kemudian wanita itu bangun dan memberi kesaksiannya."
  },
  {
    "id": 5098,
    "hadith_number": 5098,
    "tajuk_hadith": "Kisah 'Uwaimir Al-Ajlani dan Lian",
    "perawi_melayu": "Sahih Sahl bin Sa`d As-Sa`idi:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، أَنَّ سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ، أَخْبَرَهُ أَنَّ عُوَيْمِرًا الْعَجْلاَنِيَّ جَاءَ إِلَى عَاصِمِ بْنِ عَدِيٍّ الأَنْصَارِيِّ فَقَالَ لَهُ يَا عَاصِمُ أَرَأَيْتَ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً، أَيَقْتُلُهُ فَتَقْتُلُونَهُ، أَمْ كَيْفَ يَفْعَلُ سَلْ لِي يَا عَاصِمُ عَنْ ذَلِكَ‏.‏ فَسَأَلَ عَاصِمٌ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَكَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَسَائِلَ وَعَابَهَا، حَتَّى كَبُرَ عَلَى عَاصِمٍ مَا سَمِعَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا رَجَعَ عَاصِمٌ إِلَى أَهْلِهِ جَاءَهُ عُوَيْمِرٌ فَقَالَ يَا عَاصِمُ مَاذَا قَالَ لَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ عَاصِمٌ لِعُوَيْمِرٍ لَمْ تَأْتِنِي بِخَيْرٍ، قَدْ كَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَسْأَلَةَ الَّتِي سَأَلْتُهُ عَنْهَا‏.‏ فَقَالَ عُوَيْمِرٌ وَاللَّهِ لاَ أَنْتَهِي حَتَّى أَسْأَلَهُ عَنْهَا‏.‏ فَأَقْبَلَ عُوَيْمِرٌ حَتَّى جَاءَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَسَطَ النَّاسِ فَقَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً، أَيَقْتُلُهُ فَتَقْتُلُونَهُ أَمْ كَيْفَ يَفْعَلُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ قَدْ أُنْزِلَ فِيكَ وَفِي صَاحِبَتِكَ فَاذْهَبْ فَأْتِ بِهَا ‏\"‏‏.‏ قَالَ سَهْلٌ فَتَلاَعَنَا وَأَنَا مَعَ النَّاسِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا فَرَغَا مِنْ تَلاَعُنِهِمَا قَالَ عُوَيْمِرٌ كَذَبْتُ عَلَيْهَا يَا رَسُولَ اللَّهِ إِنْ أَمْسَكْتُهَا‏.‏ فَطَلَّقَهَا ثَلاَثًا قَبْلَ أَنْ يَأْمُرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَ ابْنُ شِهَابٍ فَكَانَتْ سُنَّةَ الْمُتَلاَعِنَيْنِ‏.‏",
    "malay_translation": "Daripada Sahl bin Sa`d As-Sa`idi, bahawa 'Uwaimir Al-Ajlani datang kepada 'Asim bin Ad Al-Ansari dan berkata kepadanya, \"Wahai 'Asim! Bagaimana jika seorang lelaki melihat lelaki lain bersama isterinya, adakah dia akan membunuhnya dan kamu akan membunuhnya; atau apakah yang harus dia lakukan? Tolonglah, wahai 'Asim, tanyakanlah perkara ini bagi pihakku.\" 'Asim bertanya kepada Rasulullah ﷺ tentangnya. Rasulullah ﷺ tidak menyukai soalan itu dan menganggapnya memalukan. Apa yang didengari 'Asim daripada Rasulullah ﷺ adalah berat baginya. Apabila 'Asim kembali kepada keluarganya, 'Uwaimir datang kepadanya dan berkata, \"Wahai 'Asim! Apakah yang dikatakan oleh Rasulullah ﷺ kepadamu?\" 'Asim berkata kepada 'Uwaimir, \"Kamu tidak pernah membawa sebarang kebaikan kepadaku. Rasulullah ﷺ tidak menyukai masalah yang aku tanyakan kepadanya.\" 'Uwaimir berkata, \"Demi Allah, aku tidak akan berhenti sehingga aku bertanya kepada Nabi ﷺ tentangnya.\" Maka 'Uwaimir pergi sehingga dia datang kepada Rasulullah ﷺ di tengah-tengah orang ramai, dan berkata, \"Wahai Rasulullah ﷺ! Jika seorang lelaki melihat lelaki lain bersama isterinya, adakah dia akan membunuhnya dan kamu akan membunuhnya, atau apakah yang harus dia lakukan?\" Rasulullah ﷺ bersabda, \"Allah telah menurunkan beberapa ketetapan mengenai kamu dan kes isteri kamu. Pergi dan bawalah dia.\" Kemudian mereka melakukan proses Lian sementara aku hadir di kalangan orang ramai bersama Rasulullah ﷺ. Apabila mereka selesai dari Lian mereka, 'Uwaimir berkata, \"Wahai Rasulullah ﷺ! Jika aku sekarang menyimpan dia sebagai isteriku, maka aku telah berdusta.\" Maka dia menceraikannya tiga kali sebelum Rasulullah ﷺ memerintahkannya. (Ibn Shihab berkata: Maka perceraian adalah tradisi bagi semua mereka yang terlibat dalam kes Lian.)"
  },
  {
    "id": 5099,
    "hadith_number": 5099,
    "tajuk_hadith": "Lian: Kisah Seorang Lelaki Ansari dan Istrinya",
    "perawi_melayu": "Diriwayatkan oleh Ibn Juraij:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي ابْنُ شِهَابٍ، عَنِ الْمُلاَعَنَةِ، وَعَنِ السُّنَّةِ، فِيهَا عَنْ حَدِيثِ، سَهْلِ بْنِ سَعْدٍ أَخِي بَنِي سَاعِدَةَ أَنَّ رَجُلاً، مِنَ الأَنْصَارِ جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً، أَيَقْتُلُهُ أَمْ كَيْفَ يَفْعَلُ فَأَنْزَلَ اللَّهُ فِي شَأْنِهِ مَا ذَكَرَ فِي الْقُرْآنِ مِنْ أَمْرِ الْمُتَلاَعِنَيْنِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ قَدْ قَضَى اللَّهُ فِيكَ وَفِي امْرَأَتِكَ ‏\"‏‏.‏ قَالَ فَتَلاَعَنَا فِي الْمَسْجِدِ وَأَنَا شَاهِدٌ، فَلَمَّا فَرَغَا قَالَ كَذَبْتُ عَلَيْهَا يَا رَسُولَ اللَّهِ إِنْ أَمْسَكْتُهَا‏.‏ فَطَلَّقَهَا ثَلاَثًا قَبْلَ أَنْ يَأْمُرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ فَرَغَا مِنَ التَّلاَعُنِ، فَفَارَقَهَا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ ذَاكَ تَفْرِيقٌ بَيْنَ كُلِّ مُتَلاَعِنَيْنِ ‏\"‏‏.‏ قَالَ ابْنُ جُرَيْجٍ قَالَ ابْنُ شِهَابٍ فَكَانَتِ السُّنَّةُ بَعْدَهُمَا أَنْ يُفَرَّقَ بَيْنَ الْمُتَلاَعِنَيْنِ، وَكَانَتْ حَامِلاً، وَكَانَ ابْنُهَا يُدْعَى لأُمِّهِ، قَالَ ثُمَّ جَرَتِ السُّنَّةُ فِي مِيرَاثِهَا أَنَّهَا تَرِثُهُ وَيَرِثُ مِنْهَا مَا فَرَضَ اللَّهُ لَهُ‏.‏ قَالَ ابْنُ جُرَيْجٍ عَنِ ابْنِ شِهَابٍ عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ فِي هَذَا الْحَدِيثِ إِنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنْ جَاءَتْ بِهِ أَحْمَرَ قَصِيرًا كَأَنَّهُ وَحَرَةٌ، فَلاَ أُرَاهَا إِلاَّ قَدْ صَدَقَتْ وَكَذَبَ عَلَيْهَا، وَإِنْ جَاءَتْ بِهِ أَسْوَدَ أَعْيَنَ ذَا أَلْيَتَيْنِ، فَلاَ أُرَاهُ إِلاَّ قَدْ صَدَقَ عَلَيْهَا ‏\"‏‏.‏ فَجَاءَتْ بِهِ عَلَى الْمَكْرُوهِ مِنْ ذَلِكَ‏.‏",
    "malay_translation": "Ibn Shihab mengkhabarkan tentang Lian dan tradisi mengenainya, merujuk kepada riwayat Sahl bin Sa`d, saudara Bani Sa`idi. Beliau berkata, \"Seorang lelaki Ansari datang kepada Rasulullah ﷺ dan berkata, 'Wahai Rasulullah! Jika seseorang lelaki melihat lelaki lain bersama isterinya, patutkah dia membunuhnya, atau apa yang patut dia lakukan?' Maka Allah menurunkan wahyu mengenai urusannya, seperti yang disebutkan dalam Al-Quran tentang urusan mereka yang terlibat dalam kes Lian. Nabi ﷺ bersabda, 'Allah telah menetapkan hukum-Nya terhadap kamu dan isterimu.' Kemudian mereka melakukan Lian di masjid sementara aku hadir di sana. Setelah selesai, lelaki itu berkata, 'Wahai Rasulullah ﷺ! Jika aku terus mengekalkan dia sebagai isteriku sekarang, maka aku telah berdusta terhadapnya.' Kemudian dia menceraikannya tiga kali sebelum Rasulullah ﷺ memerintahkannya, setelah mereka selesai dari proses Lian. Maka dia menceraikannya di hadapan Nabi ﷺ.\" Ibn Shihab menambah, \"Selepas kes mereka, menjadi tradisi bahawa pasangan yang terlibat dalam kes Lian harus dipisahkan melalui perceraian. Wanita itu kemudiannya hamil, dan kemudian anaknya dipanggil dengan nama ibunya. Tradisi mengenai pewarisan mereka adalah dia mewarisi daripadanya, dan dia mewarisi daripadanya bahagian yang telah ditetapkan oleh Allah untuknya.\" Ibn Shihab berkata bahawa Sahl bin Sa`d As'Saidi berkata bahawa Nabi ﷺ bersabda (dalam riwayat di atas), \"Jika wanita itu melahirkan anak kecil berwarna merah seperti cicak, maka wanita itu telah berkata benar dan lelaki itu adalah pendusta, tetapi jika dia melahirkan anak dengan mata hitam dan bibir tebal, maka suaminya telah berkata benar.\" Kemudian dia melahirkannya dalam bentuk yang tidak disukai (kerana ia membuktikan kesalahannya)."
  },
  {
    "id": 5100,
    "hadith_number": 5100,
    "tajuk_hadith": "Kisah Lian dan Penyingkapan Kebenaran",
    "perawi_melayu": "Diriwayatkan oleh Al-Qasim bin Muhammad:",
    "english_text": "Ibn `Abbas; said, \"Once Lian was mentioned before the Prophet (ﷺ) whereupon `Asim bin Adi said \nsomething and went away. Then a man from his tribe came to him, complaining that he had found a \nman with his wife. `Asim said, 'I have not been put to task except for my statement (about Lian).' \n`Asim took the man to the Prophet (ﷺ) and the man told him of the state in which he had found his wife. \nThe man was pale, thin, and of lank hair, while the other man whom he claimed he had seen with his \nwife, was brown, fat and had much flesh on his calves. The Prophet (ﷺ) invoked, saying, 'O Allah! Reveal \nthe truth.' So that lady delivered a child resembling the man whom her husband had mentioned he had \nfound her with. The Prophet (ﷺ) then made them carry out Lian.\" Then a man from that gathering asked \nIbn `Abbas, \"Was she the same lady regarding which the Prophet (ﷺ) had said, 'If I were to stone to death \nsomeone without witness, I would have stoned this lady'?\" Ibn `Abbas said, \"No, that was another \nlady who, though being a Muslim, used to arouse suspicion by her outright misbehavior. \"",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ ذُكِرَ التَّلاَعُنُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ عَاصِمُ بْنُ عَدِيٍّ فِي ذَلِكَ قَوْلاً، ثُمَّ انْصَرَفَ، فَأَتَاهُ رَجُلٌ مِنْ قَوْمِهِ يَشْكُو إِلَيْهِ أَنَّهُ وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً، فَقَالَ عَاصِمٌ مَا ابْتُلِيتُ بِهَذَا إِلاَّ لِقَوْلِي، فَذَهَبَ بِهِ إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَخْبَرَهُ بِالَّذِي وَجَدَ عَلَيْهِ امْرَأَتَهُ وَكَانَ ذَلِكَ الرَّجُلُ مُصْفَرًّا قَلِيلَ اللَّحْمِ سَبْطَ الشَّعَرِ، وَكَانَ الَّذِي ادَّعَى عَلَيْهِ أَنَّهُ وَجَدَهُ عِنْدَ أَهْلِهِ خَدْلاً آدَمَ كَثِيرَ اللَّحْمِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ بَيِّنْ ‏\"‏‏.‏ فَجَاءَتْ شَبِيهًا بِالرَّجُلِ الَّذِي ذَكَرَ زَوْجُهَا أَنَّهُ وَجَدَهُ، فَلاَعَنَ النَّبِيُّ صلى الله عليه وسلم بَيْنَهُمَا‏.‏ قَالَ رَجُلٌ لاِبْنِ عَبَّاسٍ فِي الْمَجْلِسِ هِيَ الَّتِي قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَوْ رَجَمْتُ أَحَدًا بِغَيْرِ بَيِّنَةٍ رَجَمْتُ هَذِهِ ‏\"‏‏.‏ فَقَالَ لاَ تِلْكَ امْرَأَةٌ كَانَتْ تُظْهِرُ فِي الإِسْلاَمِ السُّوءَ قَالَ أَبُو صَالِحٍ وَعَبْدُ اللَّهِ بْنُ يُوسُفَ خَدِلاً‏.‏",
    "malay_translation": "Ibn `Abbas berkata: \"Kisah Lian pernah disebut di hadapan Nabi (ﷺ). `Asim bin Adi berkata sesuatu lalu pergi. Kemudian seorang lelaki dari kaumnya datang kepadanya mengadu bahawa dia telah mendapati seorang lelaki bersama isterinya. `Asim berkata, 'Aku tidak diuji melainkan kerana kata-kataku (tentang Lian).' `Asim membawa lelaki itu kepada Nabi (ﷺ) dan lelaki itu menceritakan kepada baginda keadaan isterinya yang ditemuinya. Lelaki itu pucat, kurus, dan rambutnya lurus, manakala lelaki lain yang didakwanya dilihat bersama isterinya, berkulit sawo matang, gemuk dan mempunyai banyak daging pada betisnya. Nabi (ﷺ) berdoa, 'Ya Allah! Tunjukkanlah kebenaran.' Lalu wanita itu melahirkan seorang anak yang menyerupai lelaki yang disebutkan suaminya bahawa dia telah menemuinya bersama wanita itu. Nabi (ﷺ) kemudian memerintahkan mereka melaksanakan Lian.\" Kemudian seorang lelaki dari majlis itu bertanya kepada Ibn `Abbas, \"Adakah dia wanita yang sama yang Nabi (ﷺ) katakan, 'Jika aku hendak merejam seseorang tanpa saksi, nescaya aku akan merejam wanita ini'?\" Ibn `Abbas berkata, \"Tidak, itu adalah wanita lain yang, walaupun seorang Muslimah, sering menimbulkan syak wasangka kerana kelakuan buruknya.\""
  },
  {
    "id": 5101,
    "hadith_number": 5101,
    "tajuk_hadith": "Hukum Pasangan yang Saling Menuduh Zina",
    "perawi_melayu": "Diriwayatkan oleh Sa`id bin Jubair:",
    "english_text": "I asked Ibn `Umar, \"(What is the verdict if) a man accuses his wife of illegal sexual intercourse?\" Ibn \n`Umar said, \"The Prophet (ﷺ) separated (by divorce) the couple of Bani Al-Ajlan, and said, (to them), \n'Allah knows that one of you two is a liar; so will one of you repent?' But both of them refused. He \nagain said, 'Allah knows that one of you two is a liar; so will one of you repent?' But both of them \nrefused. So he separated them by divorce.\" (Aiyub, a sub-narrator said: `Amr bin Dinar said to me, \n\"There is something else in this Hadith which you have not mentioned. It goes thus: The man said, \n'What about my money (i.e. the Mahr that I have given to my wife)?' It was said, 'You have no right to \nrestore any money, for if you have spoken the truth (as regards the accusation), you have also \nconsummated your marriage with her; and if you have told a lie, you are less rightful to have your \nmoney back.' \")",
    "arabic_text": "حَدَّثَنِي عَمْرُو بْنُ زُرَارَةَ، أَخْبَرَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ قُلْتُ لاِبْنِ عُمَرَ رَجُلٌ قَذَفَ امْرَأَتَهُ فَقَالَ فَرَّقَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ أَخَوَىْ بَنِي الْعَجْلاَنِ، وَقَالَ ‏\"‏ اللَّهُ يَعْلَمُ أَنَّ أَحَدَكُمَا كَاذِبٌ، فَهَلْ مِنْكُمَا تَائِبٌ ‏\"‏‏.‏ فَأَبَيَا‏.‏ وَقَالَ ‏\"‏ اللَّهُ يَعْلَمُ أَنَّ أَحَدَكُمَا كَاذِبٌ، فَهَلْ مِنْكُمَا تَائِبُ ‏\"‏‏.‏ فَأَبَيَا‏.‏ فَقَالَ ‏\"‏ اللَّهُ يَعْلَمُ أَنَّ أَحَدَكُمَا كَاذِبٌ، فَهَلْ مِنْكُمَا تَائِبٌ ‏\"‏ فَأَبَيَا فَفَرَّقَ بَيْنَهُمَا‏.‏ قَالَ أَيُّوبُ فَقَالَ لِي عَمْرُو بْنُ دِينَارٍ إِنَّ فِي الْحَدِيثِ شَيْئًا لاَ أَرَاكَ تُحَدِّثُهُ قَالَ قَالَ الرَّجُلُ مَالِي قَالَ قِيلَ لاَ مَالَ لَكَ، إِنْ كُنْتَ صَادِقًا فَقَدْ دَخَلْتَ بِهَا، وَإِنْ كُنْتَ كَاذِبًا فَهْوَ أَبْعَدُ مِنْكَ‏.‏",
    "malay_translation": "Saya bertanya kepada Ibn `Umar, \"(Apakah hukumnya jika) seorang lelaki menuduh isterinya melakukan persetubuhan haram?\" Ibn `Umar berkata, \"Nabi (ﷺ) memisahkan (melalui perceraian) pasangan Bani Al-Ajlan, dan bersabda (kepada mereka), 'Allah Maha Mengetahui bahawa salah seorang daripada kamu berdua adalah pendusta; adakah sesiapa di antara kamu yang bertaubat?' Tetapi kedua-duanya enggan. Baginda (ﷺ) mengulangi, 'Allah Maha Mengetahui bahawa salah seorang daripada kamu berdua adalah pendusta; adakah sesiapa di antara kamu yang bertaubat?' Tetapi kedua-duanya enggan. Lalu baginda memisahkan mereka melalui perceraian.\" (Aiyub, seorang perawi tambahan berkata: `Amr bin Dinar berkata kepada saya, \"Ada sesuatu lagi dalam Hadith ini yang tidak kamu sebutkan. Ianya berbunyi begini: Lelaki itu berkata, 'Bagaimana pula dengan wang saya (iaitu mahar yang telah saya berikan kepada isteri saya)?' Dikatakan, 'Kamu tidak berhak untuk mendapatkan semula sebarang wang, kerana jika kamu berkata benar (berkenaan tuduhan tersebut), kamu juga telah menyempurnakan perkahwinanmu dengannya; dan jika kamu berdusta, kamu lebih tidak berhak untuk mendapatkan kembali wang kamu.'\")"
  },
  {
    "id": 5102,
    "hadith_number": 5102,
    "tajuk_hadith": "Hukum-hukum Lian (Sumpah Saling Menuduh)",
    "perawi_melayu": "Said bin Jubair",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ عَمْرٌو سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، قَالَ سَأَلْتُ ابْنَ عُمَرَ عَنِ الْمُتَلاَعِنَيْنِ،، فَقَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم لِلْمُتَلاَعِنَيْنِ ‏\"‏ حِسَابُكُمَا عَلَى اللَّهِ أَحَدُكُمَا كَاذِبٌ، لاَ سَبِيلَ لَكَ عَلَيْهَا ‏\"‏‏.‏ قَالَ مَالِي قَالَ ‏\"‏ لاَ مَالَ لَكَ، إِنْ كُنْتَ صَدَقْتَ عَلَيْهَا، فَهْوَ بِمَا اسْتَحْلَلْتَ مِنْ فَرْجِهَا، وَإِنْ كُنْتَ كَذَبْتَ عَلَيْهَا، فَذَاكَ أَبْعَدُ لَكَ ‏\"‏‏.‏ قَالَ سُفْيَانُ حَفِظْتُهُ مِنْ عَمْرٍو‏.‏ وَقَالَ أَيُّوبُ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ قَالَ قُلْتُ لاِبْنِ عُمَرَ رَجُلٌ لاَعَنَ امْرَأَتَهُ فَقَالَ بِإِصْبَعَيْهِ ـ وَفَرَّقَ سُفْيَانُ بَيْنَ إِصْبَعَيْهِ السَّبَّابَةِ وَالْوُسْطَى ـ فَرَّقَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ أَخَوَىْ بَنِي الْعَجْلاَنِ، وَقَالَ ‏\"‏ اللَّهُ يَعْلَمُ إِنَّ أَحَدَكُمَا كَاذِبٌ فَهَلْ مِنْكُمَا تَائِبٌ ‏\"‏‏.‏ ثَلاَثَ مَرَّاتٍ‏.‏ قَالَ سُفْيَانُ حَفِظْتُهُ مِنْ عَمْرٍو وَأَيُّوبَ كَمَا أَخْبَرْتُكَ‏.‏",
    "malay_translation": "Saya bertanya kepada Ibn `Umar tentang mereka yang terlibat dalam kes Lian (sumpah saling menuduh). Beliau berkata, \"Nabi (ﷺ) bersabda kepada mereka yang terlibat dalam kes Lian, 'Perhitungan kamu berdua adalah dengan Allah. Salah seorang daripada kamu berdua adalah pendusta, dan kamu (suami) tidak mempunyai hak ke atasnya (isteri itu telah bercerai).\" Lelaki itu berkata, 'Bagaimana pula dengan harta saya (Mahar)?' Nabi (ﷺ) bersabda, 'Kamu tidak berhak untuk mendapatkan kembali hartamu. Sekiranya kamu berkata benar tentangnya, maka hartamu adalah untuk persetubuhan perkahwinanmu dengannya; dan sekiranya kamu berdusta tentangnya, maka kamu kurang berhak untuk mendapatkan hartamu kembali.'\" Sufyan, seorang perawi kecil berkata: Saya mempelajari Hadith ini daripada `Amr. Diriwayatkan oleh Aiyub: Saya mendengar Sa`id bin Jubair berkata, \"Saya bertanya kepada Ibn `Umar, 'Jika seorang lelaki (menuduh isterinya melakukan persetubuhan haram dan) melaksanakan proses Lian (apa yang akan berlaku)?' Ibn `Umar merenggangkan dua jarinya. (Sufyan merenggangkan jari telunjuk dan jari tengahnya.) Ibn `Umar berkata, 'Nabi (ﷺ) memisahkan pasangan Bani Al-Ajlan dengan perceraian dan bersabda tiga kali, 'Allah mengetahui bahawa salah seorang daripada kamu berdua adalah pendusta; maka adakah salah seorang daripada kamu akan bertaubat (kepada Allah)?'\""
  },
  {
    "id": 5103,
    "hadith_number": 5103,
    "tajuk_hadith": "Rasulullah SAW Memisahkan Pasangan yang Saling Menuduh (Lian)",
    "perawi_melayu": "Diriwayatkan oleh Ibnu 'Umar:",
    "english_text": "Allah's Messenger (ﷺ) separated (divorced) the wife from her husband who accused her for an illegal sexual \nintercourse, and made them take the oath of Lian .",
    "arabic_text": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم فَرَّقَ بَيْنَ رَجُلٍ وَامْرَأَةٍ قَذَفَهَا، وَأَحْلَفَهُمَا‏.‏",
    "malay_translation": "Rasulullah SAW telah memisahkan (menceraikan) isteri daripada suaminya yang menuduhnya melakukan persetubuhan haram, dan Baginda membuat mereka mengambil sumpah Lian."
  },
  {
    "id": 5104,
    "hadith_number": 5104,
    "tajuk_hadith": "Nabi ﷺ Melakukan Lian dan Memisahkan Pasangan Ansar",
    "perawi_melayu": "Diriwayatkan oleh Ibnu `Umar:",
    "english_text": "The Prophet (ﷺ) made an Ansari man and his wife carry out Lian, and then separated them by divorce.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، قَالَ لاَعَنَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ رَجُلٍ وَامْرَأَةٍ مِنَ الأَنْصَارِ، وَفَرَّقَ بَيْنَهُمَا‏.‏",
    "malay_translation": "Nabi ﷺ telah memerintahkan seorang lelaki Ansar dan isterinya untuk melakukan Lian, kemudian memisahkan mereka dengan perceraian."
  },
  {
    "id": 5105,
    "hadith_number": 5105,
    "tajuk_hadith": "Nabi ﷺ Mengadakan Lian dan Menetapkan Hak Penjagaan Anak",
    "perawi_melayu": "Diriwayatkan oleh Ibnu 'Umar:",
    "english_text": "The Prophet (ﷺ) made a man and his wife carry out Lian, and the husband repudiated her child. So the \nProphet got them separated (by divorce) and decided that the child belonged to the mother only.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا مَالِكٌ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم لاَعَنَ بَيْنَ رَجُلٍ وَامْرَأَتِهِ، فَانْتَفَى مِنْ وَلَدِهَا فَفَرَّقَ بَيْنَهُمَا، وَأَلْحَقَ الْوَلَدَ بِالْمَرْأَةِ‏.‏",
    "malay_translation": "Nabi ﷺ telah mengadakan *Lian* (sumpah laknat) antara seorang lelaki dan isterinya, lalu suami itu menafikan anaknya. Kemudian Nabi ﷺ memisahkan mereka (dengan perceraian) dan memutuskan bahawa anak itu adalah hak ibu sahaja."
  },
  {
    "id": 5106,
    "hadith_number": 5106,
    "tajuk_hadith": "Kisah Lian (Sumpah) dan Penjelasan Nabi Muhammad (ﷺ)",
    "perawi_melayu": "Diriwayatkan oleh Ibn `Abbas:",
    "english_text": "Those involved in a case of Lian were mentioned before Allah's Messenger (ﷺ) `Asim bin Adi said \nsomething about that and then left. Later on a man from his tribe came to him and told him that he had \nfound another man with his wife. On that `Asim said, \"I have not been put to task except for what I \nhave said (about Lian).\" `Asim took the man to Allah's Messenger (ﷺ) and he told him of the state in which \nhe found his wife. The man was pale, thin and lank-haired, while the other man whom he had found \nwith his wife was brown, fat with thick calves and curly hair. Allah's Messenger (ﷺ) said, \"O Allah! Reveal \nthe truth.\" Then the lady delivered a child resembling the man whom her husband had mentioned he \nhad found with her. So Allah's Messenger (ﷺ) ordered them to carry out Lien. A man from that gathering said \nto Ibn `Abbas, \"Was she the same lady regarding whom Allah's Messenger (ﷺ) said, 'If I were to stone to \ndeath someone without witnesses, I would have stoned this lady'?\" Ibn `Abbas said, \"No, that was \nanother lady who, though being a Muslim, used to arouse suspicion because of her outright \nmisbehavior.\"",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ قَالَ ذُكِرَ الْمُتَلاَعِنَانِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ عَاصِمُ بْنُ عَدِيٍّ فِي ذَلِكَ قَوْلاً، ثُمَّ انْصَرَفَ فَأَتَاهُ رَجُلٌ مِنْ قَوْمِهِ، فَذَكَرَ لَهُ أَنَّهُ وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً، فَقَالَ عَاصِمٌ مَا ابْتُلِيتُ بِهَذَا الأَمْرِ إِلاَّ لِقَوْلِي‏.‏ فَذَهَبَ بِهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرَهُ بِالَّذِي وَجَدَ عَلَيْهِ امْرَأَتَهُ، وَكَانَ ذَلِكَ الرَّجُلُ مُصْفَرًّا قَلِيلَ اللَّحْمِ سَبْطَ الشَّعَرِ، وَكَانَ الَّذِي وَجَدَ عِنْدَ أَهْلِهِ آدَمَ خَدْلاً كَثِيرَ اللَّحْمِ جَعْدًا قَطَطًا، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ بَيِّنْ ‏\"‏‏.‏ فَوَضَعَتْ شَبِيهًا بِالرَّجُلِ الَّذِي ذَكَرَ زَوْجُهَا أَنَّهُ وَجَدَ عِنْدَهَا، فَلاَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَهُمَا، فَقَالَ رَجُلٌ لاِبْنِ عَبَّاسٍ فِي الْمَجْلِسِ هِيَ الَّتِي قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ رَجَمْتُ أَحَدًا بِغَيْرِ بَيِّنَةٍ لَرَجَمْتُ هَذِهِ ‏\"‏‏.‏ فَقَالَ ابْنُ عَبَّاسٍ لاَ تِلْكَ امْرَأَةٌ كَانَتْ تُظْهِرُ السُّوءَ فِي الإِسْلاَمِ‏.‏",
    "malay_translation": "Kisah mereka yang terlibat dalam kes Lian (sumpah) disebut di hadapan Rasulullah (ﷺ). `Asim bin Adi berkata sesuatu mengenai hal itu kemudian beredar. Kemudian seorang lelaki dari kaumnya datang kepadanya dan memberitahunya bahawa dia telah menemui lelaki lain bersama isterinya. Atas hal itu, `Asim berkata, \"Aku tidak diuji kecuali kerana apa yang telah aku katakan (tentang Lian).\" `Asim membawa lelaki itu kepada Rasulullah (ﷺ) dan dia menceritakan keadaan di mana dia mendapati isterinya. Lelaki itu pucat, kurus dan berambut lurus, sementara lelaki lain yang ditemui bersama isterinya berkulit sawo matang, gemuk dengan betis tebal dan rambut kerinting. Rasulullah (ﷺ) bersabda, \"Ya Allah! Perlihatkanlah kebenaran.\" Kemudian wanita itu melahirkan seorang anak yang menyerupai lelaki yang disebut suaminya telah ditemui bersamanya. Maka Rasulullah (ﷺ) memerintahkan mereka melaksanakan Lian. Seorang lelaki dari perhimpunan itu berkata kepada Ibn `Abbas, \"Adakah dia wanita yang sama yang berkenaan dengannya Rasulullah (ﷺ) bersabda, 'Jika aku harus merejam seseorang tanpa saksi, nescaya aku akan merejam wanita ini'?\" Ibn `Abbas berkata, \"Tidak, itu adalah wanita lain yang, walaupun seorang Muslim, sering menimbulkan syak wasangka kerana kelakuannya yang keterlaluan.\""
  },
  {
    "id": 5107,
    "hadith_number": 5107,
    "tajuk_hadith": "Hukum Perkahwinan Semula Selepas Perceraian dan Kegagalan Suami Kedua",
    "perawi_melayu": "Riwayat `Aisha:",
    "english_text": "Rifa`a Al-Qurazi married a lady and then divorced her whereupon she married another man. She came \nto the Prophet (ﷺ) and said that her new husband did not approach her, and that he was completely \nimpotent. The Prophet (ﷺ) said (to her), \"No (you cannot remarry your first husband) till you taste the \nsecond husband and he tastes you (i.e. till he consummates his marriage with you).",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى، حَدَّثَنَا هِشَامٌ، قَالَ حَدَّثَنِي أَبِي، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ رِفَاعَةَ، الْقُرَظِيَّ تَزَوَّجَ امْرَأَةً، ثُمَّ طَلَّقَهَا فَتَزَوَّجَتْ آخَرَ فَأَتَتِ النَّبِيَّ صلى الله عليه وسلم فَذَكَرَتْ لَهُ أَنَّهُ لاَ يَأْتِيهَا، وَإِنَّهُ لَيْسَ مَعَهُ إِلاَّ مِثْلُ هُدْبَةٍ فَقَالَ ‏\n\"‏ لاَ حَتَّى تَذُوقِي عُسَيْلَتَهُ، وَيَذُوقَ عُسَيْلَتَكِ ‏\"‏‏.‏",
    "malay_translation": "Rifa`a Al-Qurazi mengahwini seorang wanita, kemudian menceraikannya, lalu wanita itu berkahwin dengan lelaki lain. Wanita itu datang kepada Nabi (ﷺ) dan berkata bahawa suaminya yang baharu itu tidak mendekatinya, dan bahawa lelaki itu tidak berupaya sepenuhnya. Nabi (ﷺ) bersabda kepadanya, \"Tidak (kamu tidak boleh berkahwin semula dengan suami pertama kamu) sehingga kamu merasa (bersama) suami kedua, dan dia merasa (bersama) kamu (iaitu sehingga dia menyempurnakan perkahwinannya dengan kamu).\""
  },
  {
    "id": 5108,
    "hadith_number": 5108,
    "tajuk_hadith": "Subai'a, Balu Hamil, dan Perkahwinan Selepas Kelahiran",
    "perawi_melayu": "Diriwayatkan oleh Ummu Salamah:",
    "english_text": "(the wife of the Prophet) A lady from Bani Aslam, called Subai'a, become a widow while she was \npregnant. Abu As-Sanabil bin Ba'kak demanded her hand in marriage, but she refused to marry him \nand said, \"By Allah, I cannot marry him unless I have completed one of the two prescribed periods.\" \nAbout ten days later (after having delivered her child), she went to the Prophet (ﷺ) and he said (to her), \n\"You can marry now.\"",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ الأَعْرَجِ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ زَيْنَبَ ابْنَةَ أَبِي سَلَمَةَ، أَخْبَرَتْهُ عَنْ أُمِّهَا أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ امْرَأَةً مِنْ أَسْلَمَ يُقَالُ لَهَا سُبَيْعَةُ كَانَتْ تَحْتَ زَوْجِهَا، تُوُفِّيَ عَنْهَا وَهْىَ حُبْلَى، فَخَطَبَهَا أَبُو السَّنَابِلِ بْنُ بَعْكَكٍ، فَأَبَتْ أَنْ تَنْكِحَهُ، فَقَالَ وَاللَّهِ مَا يَصْلُحُ أَنْ تَنْكِحِيهِ حَتَّى تَعْتَدِّي آخِرَ الأَجَلَيْنِ‏.‏ فَمَكُثَتْ قَرِيبًا مِنْ عَشْرِ لَيَالٍ ثُمَّ جَاءَتِ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ انْكِحِي ‏\"‏‏.‏",
    "malay_translation": "Seorang wanita dari Bani Aslam, bernama Subai'a, menjadi balu semasa dia hamil. Abu As-Sanabil bin Ba'kak meminangnya untuk berkahwin, tetapi dia enggan berkahwin dengannya dan berkata, \"Demi Allah, aku tidak boleh berkahwin dengannya sehingga aku telah menyelesaikan salah satu daripada dua tempoh yang ditetapkan.\" Kira-kira sepuluh hari kemudian (selepas melahirkan anak), dia pergi kepada Nabi (ﷺ) dan baginda berkata kepadanya, \"Kamu boleh berkahwin sekarang.\""
  },
  {
    "id": 5109,
    "hadith_number": 5109,
    "tajuk_hadith": "Hukum Perkahwinan Selepas Bersalin",
    "perawi_melayu": "Diriwayatkan oleh `Abdullah bin `Abdullah:",
    "english_text": "that his father had written to Ibn Al-Arqam a letter asking him to ask Subai'a Al-Aslamiya how the \nProphet had given her the verdict. She said, \"The Prophet, gave me his verdict that after I gave birth, I \ncould marry.\"",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، عَنِ اللَّيْثِ، عَنْ يَزِيدَ، أَنَّ ابْنَ شِهَابٍ، كَتَبَ إِلَيْهِ أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ، أَخْبَرَهُ عَنْ أَبِيهِ، أَنَّهُ كَتَبَ إِلَى ابْنِ الأَرْقَمِ أَنْ يَسْأَلَ، سُبَيْعَةَ الأَسْلَمِيَّةَ كَيْفَ أَفْتَاهَا النَّبِيُّ صلى الله عليه وسلم فَقَالَتْ أَفْتَانِي إِذَا وَضَعْتُ أَنْ أَنْكِحَ‏.‏",
    "malay_translation": "Bapanya telah menulis surat kepada Ibn Al-Arqam memintanya bertanya kepada Subai'a Al-Aslamiya bagaimana Nabi SAW telah memberikan fatwa kepadanya. Dia berkata, \"Nabi SAW telah memberikan fatwa kepadaku bahawa selepas aku bersalin, aku boleh berkahwin.\""
  },
  {
    "id": 5110,
    "hadith_number": 5110,
    "tajuk_hadith": "Subai'a Al-Aslamiya Dibenarkan Berkahwin Semula Selepas Kematian Suami",
    "perawi_melayu": "Diriwayatkan oleh Al-Miswer bin Makhrama:",
    "english_text": "Subai'a Al-Aslamiya gave birth to a child a few days after the death of her husband. She came to the \nProphet and asked permission to remarry, and the Prophet (ﷺ) gave her permission, and she got married.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، أَنَّ سُبَيْعَةَ الأَسْلَمِيَّةَ، نُفِسَتْ بَعْدَ وَفَاةِ زَوْجِهَا، بِلَيَالٍ فَجَاءَتِ النَّبِيَّ صلى الله عليه وسلم فَاسْتَأْذَنَتْهُ أَنْ تَنْكِحَ، فَأَذِنَ لَهَا، فَنَكَحَتْ‏.‏",
    "malay_translation": "Subai'a Al-Aslamiya melahirkan anak beberapa hari selepas kematian suaminya. Dia datang kepada Nabi dan meminta izin untuk berkahwin semula, dan Nabi (ﷺ) memberinya izin, lalu dia berkahwin."
  },
  {
    "id": 5111,
    "hadith_number": 5111,
    "tajuk_hadith": "Aisyah Meminta Marwan Memulangkan Isteri yang Ditalak",
    "perawi_melayu": "Qasim bin Muhammad dan Sulaiman bin Yasar",
    "english_text": "that Yahya bin Sa`id bin Al-`As divorced the daughter of `Abdur-Rahman bin Al-Hakarn. `Abdur- \nRahman took her to his house. On that `Aisha sent a message to Marwan bin Al-Hakam who was the \nruler of Medina, saying, \"Fear Allah, and urge your brother) to return her to her house.\" Marwan (in \nSulaiman's version) said, \"Abdur-Rahman bin Al-Hakam did not obey me (or had a convincing \nargument).\" (In Al-Qasim's versions Marwan said, \"Have you not heard of the case of Fatima bint \nQais?\" Aisha said, \"The case of Fatima bint Qais is not in your favor.' Marwan bin Al-Hakam said to \n`Aisha, \"The reason that made Fatima bint Qais go to her father's house is just applicable to the \ndaughter of `Abdur-Rahman.\"",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُ سَمِعَهُ يَذْكُرُ، أَنَّ يَحْيَى بْنَ سَعِيدِ بْنِ الْعَاصِ، طَلَّقَ بِنْتَ عَبْدِ الرَّحْمَنِ بْنِ الْحَكَمِ، فَانْتَقَلَهَا عَبْدُ الرَّحْمَنِ، فَأَرْسَلَتْ عَائِشَةُ أُمُّ الْمُؤْمِنِينَ إِلَى مَرْوَانَ وَهْوَ أَمِيرُ الْمَدِينَةِ اتَّقِ اللَّهَ وَارْدُدْهَا إِلَى بَيْتِهَا‏.‏ قَالَ مَرْوَانُ فِي حَدِيثِ سُلَيْمَانَ إِنَّ عَبْدَ الرَّحْمَنِ بْنَ الْحَكَمِ غَلَبَنِي‏.‏ وَقَالَ الْقَاسِمُ بْنُ مُحَمَّدٍ أَوَمَا بَلَغَكِ شَأْنُ فَاطِمَةَ بِنْتِ قَيْسٍ قَالَتْ لاَ يَضُرُّكَ أَنْ لاَ تَذْكُرَ حَدِيثَ فَاطِمَةَ‏.‏ فَقَالَ مَرْوَانُ بْنُ الْحَكَمِ إِنْ كَانَ بِكِ شَرٌّ فَحَسْبُكِ مَا بَيْنَ هَذَيْنِ مِنَ الشَّرِّ‏.‏",
    "malay_translation": "Diriwayatkan bahawa Yahya bin Sa`id bin Al-`As telah menceraikan anak perempuan `Abdur-Rahman bin Al-Hakam. `Abdur-Rahman membawa wanita itu ke rumahnya. Pada ketika itu, `Aisyah menghantar pesanan kepada Marwan bin Al-Hakam yang merupakan pemerintah Madinah, dengan berkata, \"Takutlah kepada Allah, dan desaklah saudara lelaki kamu untuk memulangkannya ke rumahnya.\" Marwan (dalam riwayat Sulaiman) berkata, \"`Abdur-Rahman bin Al-Hakam tidak mematuhi saya (atau mempunyai hujah yang meyakinkan).\" (Dalam riwayat Al-Qasim, Marwan berkata, \"Tidakkah kamu mendengar kes Fatima bint Qais?\" `Aisyah berkata, \"Kes Fatima bint Qais tidak menyebelahi kamu.\" Marwan bin Al-Hakam berkata kepada `Aisyah, \"Alasan yang menyebabkan Fatima bint Qais pergi ke rumah bapanya hanya terpakai kepada anak perempuan `Abdur-Rahman.\""
  },
  {
    "id": 5112,
    "hadith_number": 5112,
    "tajuk_hadith": "Kenyataan Aisyah tentang Fatima dan Hak Wanita yang Diceraikan",
    "perawi_melayu": "Diriwayatkan oleh Al-Qasim:",
    "english_text": "Aisha said, \"What is wrong with Fatima? Why doesn't she fear Allah?\" by saying that a divorced lady \nis not entitled to be provided with residence and sustenance (by her husband).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ مَا لِفَاطِمَةَ أَلاَ تَتَّقِي اللَّهَ، يَعْنِي فِي قَوْلِهَا لاَ سُكْنَى وَلاَ نَفَقَةَ",
    "malay_translation": "Aisyah berkata, \"Apa yang terjadi pada Fatima? Mengapa dia tidak takut kepada Allah?\" dengan mengatakan bahawa seorang wanita yang diceraikan tidak berhak mendapat tempat tinggal dan nafkah (daripada suaminya)."
  },
  {
    "id": 5113,
    "hadith_number": 5113,
    "tajuk_hadith": "Kisah Fatima dan Kebenaran Meninggalkan Rumah Selepas Perceraian",
    "perawi_melayu": "Diriwayatkan oleh Qasim",
    "english_text": "Urwa said to Aisha, \"Do you know so-and-so, the daughter of Al-Hakam? Her husband divorced her \nirrevocably and she left (her husband's house).\" `Aisha said, \"What a bad thing she has done!\" 'Urwa \nsaid (to `Aisha), \"Haven't you heard the statement of Fatima?\" `Aisha replied, \"It is not in her favor to \nmention.\" 'Urwa added, `Aisha reproached (Fatima) severely and said, \"Fatima was in a lonely place, \nand she was prone to danger, so the Prophet (ﷺ) \nallowed her (to go out of her husband's house).",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَبَّاسٍ، حَدَّثَنَا ابْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، قَالَ عُرْوَةُ بْنُ الزُّبَيْرِ لِعَائِشَةَ أَلَمْ تَرَيْنَ إِلَى فُلاَنَةَ بِنْتِ الْحَكَمِ طَلَّقَهَا زَوْجُهَا الْبَتَّةَ فَخَرَجَتْ‏.‏ فَقَالَتْ بِئْسَ مَا صَنَعَتْ‏.‏ قَالَ أَلَمْ تَسْمَعِي فِي قَوْلِ فَاطِمَةَ قَالَتْ أَمَا إِنَّهُ لَيْسَ لَهَا خَيْرٌ فِي ذِكْرِ هَذَا الْحَدِيثِ‏.‏   \nوَزَادَ ابْنُ أَبِي الزِّنَادِ عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَابَتْ عَائِشَةُ أَشَدَّ الْعَيْبِ وَقَالَتْ إِنَّ فَاطِمَةَ كَانَتْ فِي مَكَانٍ وَحِشٍ فَخِيفَ عَلَى نَاحِيَتِهَا، فَلِذَلِكَ أَرْخَصَ لَهَا النَّبِيُّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Urwa berkata kepada Aisyah, \"Adakah kamu tahu si fulanah, anak perempuan Al-Hakam? Suaminya telah menceraikannya secara talak bain (tidak boleh rujuk) dan dia telah keluar (dari rumah suaminya).\" Aisyah berkata, \"Alangkah buruknya perbuatan yang dia lakukan!\" Urwa berkata kepada Aisyah, \"Tidakkah kamu mendengar tentang kenyataan Fatimah?\" Aisyah menjawab, \"Tidak baik untuk menyebutkannya.\" Urwa menambah, Aisyah menegur (Fatimah) dengan keras dan berkata, \"Fatimah berada di tempat yang sunyi dan dia terdedah kepada bahaya, maka Nabi (ﷺ) membenarkannya (keluar dari rumah suaminya)."
  },
  {
    "id": 5114,
    "hadith_number": 5114,
    "tajuk_hadith": "Aisyah Menyanggah Kata-kata Fatimah",
    "perawi_melayu": "Diriwayatkan oleh 'Urwa:",
    "english_text": "Aisha disapproved of what Fatima used to say.'",
    "arabic_text": "وَحَدَّثَنِي حِبَّانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ، أَنْكَرَتْ ذَلِكَ عَلَى فَاطِمَةَ‏.‏",
    "malay_translation": "Aisyah رضي الله عنها tidak menyetujui apa yang dikatakan oleh Fatimah."
  },
  {
    "id": 5115,
    "hadith_number": 5115,
    "tajuk_hadith": "Ucapan Nabi SAW kepada Safiyyah selepas Haji",
    "perawi_melayu": "Diriwayatkan oleh `Aisha:",
    "english_text": "When Allah's Messenger (ﷺ) decided to leave Mecca after the Hajj, he saw Safiyya, sad and standing at the \nentrance of her tent. He said to her, \"Aqr (or) Halq! You will detain us. Did you perform Tawaf-al- \nIfada on the day of Nahr? She said, \"Yes.\" He said, \"Then you can depart.\"",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَمَّا أَرَادَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَنْفِرَ إِذَا صَفِيَّةُ عَلَى باب خِبَائِهَا كَئِيبَةً، فَقَالَ لَهَا ‏\"‏ عَقْرَى ـ أَوْ حَلْقَى ـ إِنَّكِ لَحَابِسَتُنَا أَكُنْتِ أَفَضْتِ يَوْمَ النَّحْرِ ‏\"‏‏.‏ قَالَتْ نَعَمْ‏.‏ قَالَ ‏\"‏ فَانْفِرِي إِذًا ‏\"‏‏.‏",
    "malay_translation": "Apabila Rasulullah (ﷺ) memutuskan untuk meninggalkan Mekah selepas Haji, baginda melihat Safiyyah sedang bersedih dan berdiri di pintu khemahnya. Baginda berkata kepadanya, \"Aqr (atau) Halq! Kamu akan menahan kami. Adakah kamu telah melakukan Tawaf-al-Ifadah pada hari Nahr?\" Dia menjawab, \"Ya.\" Baginda bersabda, \"Kalau begitu, kamu boleh berangkat.\""
  },
  {
    "id": 5116,
    "hadith_number": 5116,
    "tajuk_hadith": "Ma'qil Mengahwinkan Saudarinya dan Kemudian Suaminya Menceraikannya",
    "perawi_melayu": "Diriwayatkan oleh Al-Hasan:",
    "english_text": "Ma'qil gave his sister in marriage and later her husband divorced her once.",
    "arabic_text": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا يُونُسُ، عَنِ الْحَسَنِ، قَالَ زَوَّجَ مَعْقِلٌ أُخْتَهُ فَطَلَّقَهَا تَطْلِيقَةً‏.‏",
    "malay_translation": "Ma'qil mengahwinkan saudarinya, dan kemudian suaminya menceraikannya sekali."
  },
  {
    "id": 5117,
    "hadith_number": 5117,
    "tajuk_hadith": "Larangan Menghalang Wanita yang Ditalak untuk Berkahwin Semula",
    "perawi_melayu": "Diriwayatkan oleh Al-Hasan:",
    "english_text": "The sister of Ma'qil bin Yasar was married to a man and then that man divorced her and remained \naway from her till her period of the 'Iddah expired. Then he demanded for her hand in marriage, but \nMa'qil got angry out of pride and haughtiness and said, \"He kept away from her when he could still \nretain her, and now he demands her hand again?\" So Ma'qil disagreed to remarry her to him. Then \nAllah revealed: 'When you have divorced women and they have fulfilled the term of their prescribed \nperiod, do not prevent them from marrying their (former) husbands.' (2.232) So the Prophet (ﷺ) sent for \nMa'qil and recited to him (Allah's order) and consequently Ma'qil gave up his pride and haughtiness \nand yielded to Allah's order.",
    "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، حَدَّثَنَا الْحَسَنُ، أَنَّ مَعْقِلَ بْنَ يَسَارٍ، كَانَتْ أُخْتُهُ تَحْتَ رَجُلٍ فَطَلَّقَهَا، ثُمَّ خَلَّى عَنْهَا حَتَّى انْقَضَتْ عِدَّتُهَا، ثُمَّ خَطَبَهَا فَحَمِيَ مَعْقِلٌ مِنَ ذَلِكَ أَنَفًا فَقَالَ خَلَّى عَنْهَا وَهْوَ يَقْدِرُ عَلَيْهَا، ثُمَّ يَخْطُبُهَا فَحَالَ بَيْنَهُ وَبَيْنَهَا، فَأَنْزَلَ اللَّهُ ‏{‏وَإِذَا طَلَّقْتُمُ النِّسَاءَ فَبَلَغْنَ أَجَلَهُنَّ فَلاَ تَعْضُلُوهُنَّ‏}‏ إِلَى آخِرِ الآيَةِ، فَدَعَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَرَأَ عَلَيْهِ، فَتَرَكَ الْحَمِيَّةَ وَاسْتَقَادَ لأَمْرِ اللَّهِ‏.‏",
    "malay_translation": "Saudara perempuan Ma'qil bin Yasar telah berkahwin dengan seorang lelaki. Kemudian lelaki itu menceraikannya dan membiarkannya sehingga tamat tempoh 'Iddahnya. Kemudian lelaki itu meminangnya semula, tetapi Ma'qil berasa marah kerana perasaan bangga dan sombong, lalu berkata, \"Dia meninggalkannya ketika dia masih boleh mempertahankannya, dan sekarang dia meminangnya semula?\" Maka Ma'qil enggan mengahwinkannya semula dengan lelaki itu. Kemudian Allah menurunkan firman-Nya: 'Apabila kamu menceraikan isteri-isteri (kamu), lalu mereka telah habis masa iddahnya, maka janganlah kamu (wali-wali) menghalangi mereka berkahwin (semula) dengan (bekas) suami mereka, apabila mereka (lelaki-lelaki itu) redha meredhai antara mereka (untuk berkahwin semula).' (2:232) Maka Nabi (ﷺ) memanggil Ma'qil dan membacakan kepadanya (perintah Allah), dan akibatnya Ma'qil meninggalkan perasaan bangga dan sombongnya, lalu tunduk kepada perintah Allah."
  },
  {
    "id": 5118,
    "hadith_number": 5118,
    "tajuk_hadith": "Arahan Nabi ﷺ Tentang Talak Semasa Haid",
    "perawi_melayu": "Diriwayatkan oleh Nafi`:",
    "english_text": "Ibn `Umar bin Al-Khattab divorced his wife during her menses. Allah's Messenger (ﷺ) ordered him to take \nher back till she became clean, and when she got another period while she was with him, she should \nwait till she became clean again and only then, if he wanted to divorce her, he could do so before \nhaving sexual relations with her. And that is the period Allah has fixed for divorcing women. \nWhenever `Abdullah (bin `Umar) was asked about that, he would say to the questioner, \"If you \ndivorced her thrice, she is no longer lawful for you unless she marries another man (and the other man \ndivorces her in his turn).' Ibn `Umar further said, 'Would that you (people) only give one or two \ndivorces, because the Prophet (ﷺ) has ordered me so.'",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنهما ـ طَلَّقَ امْرَأَةً لَهُ وَهْىَ حَائِضٌ تَطْلِيقَةً وَاحِدَةً، فَأَمَرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُرَاجِعَهَا، ثُمَّ يُمْسِكَهَا حَتَّى تَطْهُرَ، ثُمَّ تَحِيضَ عِنْدَهُ حَيْضَةً أُخْرَى، ثُمَّ يُمْهِلَهَا حَتَّى تَطْهُرَ مِنْ حَيْضِهَا، فَإِنْ أَرَادَ أَنْ يُطَلِّقَهَا فَلْيُطَلِّقْهَا حِينَ تَطْهُرُ مِنْ قَبْلِ أَنْ يُجَامِعَهَا، فَتِلْكَ الْعِدَّةُ الَّتِي أَمَرَ اللَّهُ أَنْ تُطَلَّقَ لَهَا النِّسَاءُ‏.‏ وَكَانَ عَبْدُ اللَّهِ إِذَا سُئِلَ عَنْ ذَلِكَ قَالَ لأَحَدِهِمْ إِنْ كُنْتَ طَلَّقْتَهَا ثَلاَثًا فَقَدْ حَرُمَتْ عَلَيْكَ، حَتَّى تَنْكِحَ زَوْجًا غَيْرَهُ‏.‏ وَزَادَ فِيهِ غَيْرُهُ عَنِ اللَّيْثِ حَدَّثَنِي نَافِعٌ قَالَ ابْنُ عُمَرَ لَوْ طَلَّقْتَ مَرَّةً أَوْ مَرَّتَيْنِ، فَإِنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَنِي بِهَذَا‏.‏",
    "malay_translation": "Ibn `Umar bin Al-Khattab menceraikan isterinya semasa haid. Rasulullah ﷺ memerintahkannya supaya merujuk kembali isterinya sehingga dia suci. Apabila isterinya mendapat haid lagi ketika bersamanya, dia harus menunggu sehingga dia suci semula. Kemudian, jika dia ingin menceraikannya, dia boleh berbuat demikian sebelum melakukan hubungan seksual dengannya. Itulah tempoh yang Allah tetapkan untuk menceraikan wanita. Setiap kali `Abdullah (bin `Umar) ditanya tentang hal itu, dia akan berkata kepada penanya, \"Sekiranya kamu menceraikan isteri tiga kali, dia tidak lagi halal bagimu melainkan dia berkahwin dengan lelaki lain (dan lelaki lain itu menceraikannya pula).\" Ibn `Umar seterusnya berkata, 'Alangkah baiknya jika kamu (orang) hanya memberikan satu atau dua talak sahaja, kerana Nabi ﷺ telah memerintahkan aku berbuat demikian.'"
  },
  {
    "id": 5119,
    "hadith_number": 5119,
    "tajuk_hadith": "Talak Semasa Haid",
    "perawi_melayu": "Diriwayatkan oleh Yunus Ibn Jubair:",
    "english_text": "Ibn `Umar divorced his wife while she was having her menses. `Umar asked the Prophet (ﷺ) who said, \n\"Order him (your son) to take her back, and then divorced her before her period of the 'Iddah has \nelapsed.\" I asked Ibn `Umar, \"Will that divorce (during the menses) be counted?\" He replied, \"If \nsomebody behaves foolishly (will his foolishness be an excuse for his misbehavior)?\"",
    "arabic_text": "حَدَّثَنَا حَجَّاجٌ، حَدَّثَنَا يَزِيدُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا مُحَمَّدُ بْنُ سِيرِينَ، حَدَّثَنِي يُونُسُ بْنُ جُبَيْرٍ، سَأَلْتُ ابْنَ عُمَرَ فَقَالَ طَلَّقَ ابْنُ عُمَرَ امْرَأَتَهُ وَهْىَ حَائِضٌ، فَسَأَلَ عُمَرُ النَّبِيَّ صلى الله عليه وسلم فَأَمَرَهُ أَنْ يُرَاجِعَهَا، ثُمَّ يُطَلِّقَ مِنْ قُبُلِ عِدَّتِهَا، قُلْتُ فَتَعْتَدُّ بِتِلْكَ التَّطْلِيقَةِ قَالَ أَرَأَيْتَ إِنْ عَجَزَ وَاسْتَحْمَقَ‏.‏",
    "malay_translation": "Ibn Umar telah menceraikan isterinya ketika isterinya sedang haid. Umar bertanya kepada Nabi (ﷺ) lalu Baginda bersabda, \"Perintahkan dia (anakmu) untuk merujuknya kembali, kemudian ceraikan dia sebelum tempoh 'Iddahnya selesai.\" Saya bertanya kepada Ibn Umar, \"Adakah talak (semasa haid) itu akan dikira?\" Dia menjawab, \"Jika seseorang bertindak bodoh (adakah kebodohannya itu akan menjadi alasan bagi kelakuannya yang salah)?\""
  },
  {
    "id": 5120,
    "hadith_number": 5120,
    "tajuk_hadith": "Kewajipan Berkabung Wanita Selepas Kematian",
    "perawi_melayu": "Diriwayatkan oleh Humaid bin Nafi`:",
    "english_text": "Zainab bint Abu Salama told me these three narrations: Zainab said: I went to Um Habiba, the wife of \nthe Prophet (ﷺ) when her father, Abu- Sufyan bin Herb had died. Um ,Habiba asked for a perfume which \ncontained yellow scent (Khaluq) or some other scent, and she first perfumed one of the girls with it \nand then rubbed her cheeks with it and said, \"By Allah, I am not in need of perfume, but I have heard \nAllah's Messenger (ﷺ) saying, 'It is not lawful for a lady who believes in Allah and the Last Day to mourn for \na dead person for more than three days unless he is her husband for whom she should mourn for four \nmonths and ten days.'\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ حُمَيْدِ بْنِ نَافِعٍ، عَنْ زَيْنَبَ ابْنَةِ أَبِي سَلَمَةَ، أَنَّهَا أَخْبَرَتْهُ هَذِهِ الأَحَادِيثَ الثَّلاَثَةَ، قَالَتْ زَيْنَبُ دَخَلْتُ عَلَى أُمِّ حَبِيبَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم حِينَ تُوُفِّيَ أَبُوهَا أَبُو سُفْيَانَ بْنُ حَرْبٍ، فَدَعَتْ أُمُّ حَبِيبَةَ بِطِيبٍ فِيهِ صُفْرَةٌ خَلُوقٌ أَوْ غَيْرُهُ فَدَهَنَتْ مِنْهُ جَارِيَةً، ثُمَّ مَسَّتْ بِعَارِضَيْهَا، ثُمَّ قَالَتْ وَاللَّهِ مَا لِي بِالطِّيبِ مِنْ حَاجَةٍ، غَيْرَ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ تُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثِ لَيَالٍ، إِلاَّ عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏‏.‏",
    "malay_translation": "Zainab bint Abu Salama menceritakan kepada saya tiga riwayat ini: Zainab berkata: Saya pergi menemui Ummu Habibah, isteri Nabi (ﷺ) ketika bapanya, Abu Sufyan bin Harb meninggal dunia. Ummu Habibah meminta minyak wangi yang mengandungi warna kuning (Khaluq) atau minyak wangi yang lain, dan dia mula-mula mewangikan salah seorang gadis dengannya dan kemudian menggosok pipinya dengannya dan berkata, \"Demi Allah, saya tidak memerlukan minyak wangi, tetapi saya telah mendengar Rasulullah (ﷺ) bersabda, 'Tidak halal bagi seorang wanita yang beriman kepada Allah dan Hari Akhir untuk berkabung atas kematian seseorang lebih daripada tiga hari kecuali suaminya yang mana dia harus berkabung selama empat bulan dan sepuluh hari.'\""
  },
  {
    "id": 5121,
    "hadith_number": 5121,
    "tajuk_hadith": "Tempoh Berkabung bagi Wanita",
    "perawi_melayu": "Zainab berkata:",
    "english_text": "I want to Zainab bint Jahsh when her brother died. She \nasked for perfume and used some of it and said, \"By Allah, I am not in need of perfume, but I have \nheard Allah's Messenger (ﷺ) saying on the pulpit, 'It is not lawful for a lady who believes in Allah and the \nlast day to mourn for more than three days except for her husband for whom she should mourn for \nfour months and ten days.'\"",
    "arabic_text": "قَالَتْ زَيْنَبُ فَدَخَلْتُ عَلَى زَيْنَبَ ابْنَةِ جَحْشٍ حِينَ تُوُفِّيَ أَخُوهَا، فَدَعَتْ بِطِيبٍ فَمَسَّتْ مِنْهُ، ثُمَّ قَالَتْ أَمَا وَاللَّهِ مَا لِي بِالطِّيبِ مِنْ حَاجَةٍ غَيْرَ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ عَلَى الْمِنْبَرِ ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ تُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثِ لَيَالٍ إِلاَّ عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏‏.‏",
    "malay_translation": "Zainab berkata: Saya berjumpa dengan Zainab binti Jahsh ketika saudaranya meninggal dunia. Dia meminta minyak wangi dan menggunakannya sedikit, kemudian berkata, \"Demi Allah, saya tidak memerlukan minyak wangi, tetapi saya mendengar Rasulullah (ﷺ) bersabda di atas mimbar, 'Tidak halal bagi seorang wanita yang beriman kepada Allah dan hari akhir untuk berkabung lebih dari tiga hari, kecuali bagi suaminya, dia harus berkabung selama empat bulan sepuluh hari.'\""
  },
  {
    "id": 5122,
    "hadith_number": 5122,
    "tajuk_hadith": "Larangan Memakai Celak Bagi Wanita Beriddah",
    "perawi_melayu": "Zainab berkata:",
    "english_text": "\"I heard my mother, Um Salama saying that a woman came to Allah's Messenger (ﷺ) \nand said, \"O Allah's Messenger (ﷺ)! The husband of my daughter has died and she is suffering from an eye \ndisease, can she apply kohl to her eye?\" Allah's Messenger (ﷺ) replied, \"No,\" twice or thrice. (Every time she \nrepeated her question) he said, \"No.\" Then Allah's Messenger (ﷺ) added, \"It is just a matter of four months \nand ten days. In the Pre-Islamic Period of ignorance a widow among you should throw a globe of \ndung when one year has elapsed.\"",
    "arabic_text": "قَالَتْ زَيْنَبُ وَسَمِعْتُ أُمَّ سَلَمَةَ، تَقُولُ جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ ابْنَتِي تُوُفِّيَ عَنْهَا زَوْجُهَا وَقَدِ اشْتَكَتْ عَيْنَهَا أَفَتَكْحُلُهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ ‏\"‏‏.‏ مَرَّتَيْنِ أَوْ ثَلاَثًا كُلَّ ذَلِكَ يَقُولُ لاَ، ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا هِيَ أَرْبَعَةُ أَشْهُرٍ وَعَشْرٌ، وَقَدْ كَانَتْ إِحْدَاكُنَّ فِي الْجَاهِلِيَّةِ تَرْمِي بِالْبَعَرَةِ عَلَى رَأْسِ الْحَوْلِ ‏\"‏‏.‏",
    "malay_translation": "Zainab berkata: “Saya mendengar Ummu Salamah berkata bahawa seorang wanita datang kepada Rasulullah ﷺ dan berkata, “Wahai Rasulullah ﷺ! Suami anak perempuan saya telah meninggal dunia dan dia mengalami sakit mata, bolehkah dia memakai celak pada matanya?” Rasulullah ﷺ menjawab, “Tidak,” dua atau tiga kali. (Setiap kali dia mengulangi soalannya) Baginda bersabda, “Tidak.” Kemudian Rasulullah ﷺ bersabda, “Hanya empat bulan sepuluh hari sahaja. Pada zaman Jahiliyyah dahulu, seorang balu di kalangan kamu akan membuang sebuku tahi (unta) apabila genap setahun.”"
  },
  {
    "id": 5123,
    "hadith_number": 5123,
    "tajuk_hadith": "Larangan Amalan Kuno Selepas Kematian Suami",
    "perawi_melayu": "Zainab (semoga Allah merahmatinya)",
    "english_text": "I (Humaid) said to Zainab, \"What does 'throwing a globe of dung when one \nyear had elapsed' mean?\" Zainab said, \"When a lady was bereaved of her husband, she would live in a \nwretched small room and put on the worst clothes she had and would not touch any scent till one year \nhad elapsed. Then she would bring an animal, e.g. a donkey, a sheep or a bird and rub her body \nagainst it. The animal against which she would rub her body would scarcely survive. Only then she \nwould come out of her room, whereupon she would be given a globe of dung which she would throw \naway and then she would use the scent she liked or the like.\"",
    "arabic_text": "قَالَ حُمَيْدٌ فَقُلْتُ لِزَيْنَبَ وَمَا تَرْمِي بِالْبَعَرَةِ عَلَى رَأْسِ الْحَوْلِ فَقَالَتْ زَيْنَبُ كَانَتِ الْمَرْأَةُ إِذَا تُوُفِّيَ عَنْهَا زَوْجُهَا دَخَلَتْ حِفْشًا، وَلَبِسَتْ شَرَّ ثِيَابِهَا، وَلَمْ تَمَسَّ طِيبًا حَتَّى تَمُرَّ بِهَا سَنَةٌ، ثُمَّ تُؤْتَى بِدَابَّةٍ حِمَارٍ أَوْ شَاةٍ أَوْ طَائِرٍ فَتَفْتَضُّ بِهِ، فَقَلَّمَا تَفْتَضُّ بِشَىْءٍ إِلاَّ مَاتَ، ثُمَّ تَخْرُجُ فَتُعْطَى بَعَرَةً فَتَرْمِي، ثُمَّ تُرَاجِعُ بَعْدُ مَا شَاءَتْ مِنْ طِيبٍ أَوْ غَيْرِهِ‏.‏ سُئِلَ مَالِكٌ مَا تَفْتَضُّ بِهِ قَالَ تَمْسَحُ بِهِ جِلْدَهَا‏.‏",
    "malay_translation": "Humaid berkata kepada Zainab: \"Apakah maksud 'melempar gumpalan najis setelah setahun berlalu'?\" Zainab menjawab: \"Apabila seorang wanita ditinggal mati suaminya, dia akan tinggal di sebuah bilik yang buruk, memakai pakaian yang paling buruk, dan tidak menggunakan sebarang wangian sehingga setahun berlalu. Kemudian, dia akan membawa seekor haiwan, contohnya keldai, biri-biri atau burung, dan menggosokkan badannya padanya. Haiwan yang digosokkan badannya itu jarang dapat bertahan hidup. Hanya selepas itu dia akan keluar dari biliknya, di mana dia akan diberi gumpalan najis yang akan dibuangnya, dan kemudian dia boleh menggunakan wangian yang disukainya atau yang serupa.\""
  },
  {
    "id": 5124,
    "hadith_number": 5124,
    "tajuk_hadith": "Larangan Memakai Celak Ketika Dalam Tempoh Iddah",
    "perawi_melayu": "Diriwayatkan oleh Ummu Salamah:",
    "english_text": "A woman was bereaved of her husband and her relatives worried about \n     her eyes (which were diseased). They came to Allah's Messenger (ﷺ), and \n     asked him to allow them to treat her eyes with kohl, but he said, \"She\n     should not apply kohl to her eyes. (In the Pre-Islamic period of \n     Ignorance) a widowed woman among you would stay in the worst of her \n     clothes (or the worst part of her house) and when a year had elapsed, \n     if a dog passed by her, she would throw a globe of dung, Nay, (she \n     cannot use kohl) till four months and ten days have elapsed.\"",
    "arabic_text": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا حُمَيْدُ بْنُ نَافِعٍ، عَنْ زَيْنَبَ ابْنَةِ أُمِّ سَلَمَةَ، عَنْ أُمِّهَا، أَنَّ امْرَأَةً، تُوُفِّيَ زَوْجُهَا فَخَشُوا عَلَى عَيْنَيْهَا فَأَتَوْا رَسُولَ اللَّهِ صلى الله عليه وسلم فَاسْتَأْذَنُوهُ فِي الْكُحْلِ فَقَالَ ‏\n\"‏ لاَ تَكَحَّلْ قَدْ كَانَتْ إِحْدَاكُنَّ تَمْكُثُ فِي شَرِّ أَحْلاَسِهَا أَوْ شَرِّ بَيْتِهَا، فَإِذَا كَانَ حَوْلٌ فَمَرَّ كَلْبٌ رَمَتْ بِبَعَرَةٍ، فَلاَ حَتَّى تَمْضِيَ أَرْبَعَةُ أَشْهُرٍ وَعَشْرٌ ‏\"‏‏.‏",
    "malay_translation": "Seorang wanita yang ditinggal mati suaminya, keluarga wanitanya khuatir akan keadaan matanya (yang sakit). Mereka menemui Rasulullah ﷺ dan memohon izin untuk merawat matanya dengan celak (kohl), tetapi Baginda bersabda, \"Dia tidak boleh memakai celak. (Pada zaman Jahiliyyah) seorang wanita yang kematian suami dalam kalangan kamu akan tinggal dalam pakaiannya yang paling buruk (atau bahagian rumah yang paling buruk) dan apabila genap setahun, jika seekor anjing lalu di hadapannya, dia akan melempar tahi anjing. Tidak, (dia tidak boleh memakai celak) sehingga empat bulan sepuluh hari berlalu.\""
  },
  {
    "id": 5125,
    "hadith_number": 5125,
    "tajuk_hadith": "Tempoh Berkabung bagi Wanita Muslimah",
    "perawi_melayu": "Diriwayatkan oleh Um Habiba:",
    "english_text": "The Prophet (ﷺ) said, \"It is not lawful for a Muslim \n     woman who believes in Allah and the Last Day to mourn for more than \n     three days, except for her husband, for whom she should mourn for four\n     months and ten days.\"",
    "arabic_text": "وَسَمِعْتُ زَيْنَبَ ابْنَةَ أُمِّ سَلَمَةَ، تُحَدِّثُ عَنْ أُمِّ حَبِيبَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ مُسْلِمَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ تُحِدَّ فَوْقَ ثَلاَثَةِ أَيَّامٍ، إِلاَّ عَلَى زَوْجِهَا أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda, \"Tidak halal bagi seorang wanita Muslimah yang beriman kepada Allah dan Hari Akhir untuk berkabung lebih daripada tiga hari, kecuali bagi suaminya, yang mana dia harus berkabung selama empat bulan sepuluh hari.\""
  },
  {
    "id": 5126,
    "hadith_number": 5126,
    "tajuk_hadith": "Larangan Berkabung Lebih Daripada Tiga Hari",
    "perawi_melayu": "Diriwayatkan oleh Ummu 'Atiyyah:",
    "english_text": "We were forbidden to mourn for more than three days except for a husband.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرٌ، حَدَّثَنَا سَلَمَةُ بْنُ عَلْقَمَةَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، قَالَتْ أُمُّ عَطِيَّةَ نُهِينَا أَنْ نُحِدَّ أَكْثَرَ مِنْ ثَلاَثٍ إِلاَّ بِزَوْجٍ‏.‏",
    "malay_translation": "Kami dilarang berkabung lebih daripada tiga hari kecuali untuk suami."
  },
  {
    "id": 5127,
    "hadith_number": 5127,
    "tajuk_hadith": "Larangan Berkabung Melebihi Tiga Hari Kecuali Suami",
    "perawi_melayu": "Diriwayatkan oleh Ummu 'Atiyyah:",
    "english_text": "We were forbidden to mourn for more than three days for a dead person, except for a husband, for \nwhom a wife should mourn for four months and ten days (while in the mourning period) we were not \nallowed to put kohl in our eyes, nor perfume our-selves, nor wear dyed clothes, except a garment of \n'Asb (special clothes made in Yemen). But it was permissible for us that when one of us became clean \nfrom her menses and took a bath, she could use a piece of a certain kind of incense. And it was \nforbidden for us to follow funeral processions.",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ كُنَّا نُنْهَى أَنْ نُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثٍ، إِلاَّ عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا، وَلاَ نَكْتَحِلَ، وَلاَ نَطَّيَّبَ، وَلاَ نَلْبَسَ ثَوْبًا مَصْبُوغًا، إِلاَّ ثَوْبَ عَصْبٍ، وَقَدْ رُخِّصَ لَنَا عِنْدَ الطُّهْرِ إِذَا اغْتَسَلَتْ إِحْدَانَا مِنْ مَحِيضِهَا فِي نُبْذَةٍ مِنْ كُسْتِ أَظْفَارٍ، وَكُنَّا نُنْهَى عَنِ اتِّبَاعِ الْجَنَائِزِ‏.‏",
    "malay_translation": "Kami dilarang untuk berkabung melebihi tiga hari bagi orang yang meninggal dunia, kecuali bagi suami, di mana seorang isteri harus berkabung selama empat bulan dan sepuluh hari (semasa tempoh berkabung) kami tidak dibenarkan memakai celak mata, tidak memakai wangian, dan tidak memakai pakaian yang berwarna, kecuali pakaian 'Asb (pakaian khas yang dibuat di Yaman). Tetapi dibenarkan bagi kami apabila salah seorang daripada kami suci daripada haid dan mandi, dia boleh menggunakan sejenis kemenyan. Dan kami dilarang mengikuti perarakan pengebumian."
  },
  {
    "id": 5128,
    "hadith_number": 5128,
    "tajuk_hadith": "Tempoh Berkabung untuk Wanita",
    "perawi_melayu": "Diriwayatkan oleh Ummu 'Atiyyah:",
    "english_text": "The Prophet (ﷺ) said, \"It is not lawful for a lady who believes in Allah and the Last Day, to mourn for \nmore than three days for a dead person, except for her husband, in which case she should neither put \nkohl in her eyes, nor perfume herself, nor wear dyed clothes, except a garment of 'Asb\"",
    "arabic_text": "حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ، حَدَّثَنَا عَبْدُ السَّلاَمِ بْنُ حَرْبٍ، عَنْ هِشَامٍ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ تُحِدَّ فَوْقَ ثَلاَثٍ، إِلاَّ عَلَى زَوْجٍ، فَإِنَّهَا لاَ تَكْتَحِلُ وَلاَ تَلْبَسُ ثَوْبًا مَصْبُوغًا إِلاَّ ثَوْبَ عَصْبٍ ‏\"‏‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda, \"Tidak halal bagi seorang wanita yang beriman kepada Allah dan Hari Akhir untuk berkabung lebih daripada tiga hari bagi orang yang meninggal dunia, kecuali bagi suaminya, dalam hal ini dia tidak boleh memakai celak pada matanya, tidak boleh memakai minyak wangi, dan tidak boleh memakai pakaian yang dicelup, kecuali pakaian 'Asb\"."
  },
  {
    "id": 5129,
    "hadith_number": 5129,
    "tajuk_hadith": "Larangan Menggunakan Wangian Semasa Haid",
    "perawi_melayu": "Um 'Atiyya",
    "english_text": "The Prophet (ﷺ) said, \"She should not use perfume except when she becomes clean from her \nmenses whereupon she can use Qust, and Azfar (two kinds of incense).",
    "arabic_text": "وَقَالَ الأَنْصَارِيُّ حَدَّثَنَا هِشَامٌ، حَدَّثَتْنَا حَفْصَةُ، حَدَّثَتْنِي أُمُّ عَطِيَّةَ، نَهَى النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ وَلاَ تَمَسَّ طِيبًا إِلاَّ أَدْنَى طُهْرِهَا إِذَا طَهُرَتْ، نُبْذَةً مِنْ قُسْطٍ وَأَظْفَارٍ ‏\"‏‏.‏\nقَالَ أَبُو عَبْد اللَّهِ الْقُسْطُ وَالْكُسْتُ مِثْلُ الْكَافُورِ وَالْقَافُورِ",
    "malay_translation": "Nabi (ﷺ) bersabda, \"Dia tidak boleh menggunakan minyak wangi kecuali apabila dia telah suci daripada haidnya, selepas itu dia boleh menggunakan Qust, dan Azfar (dua jenis kemenyan).\""
  },
  {
    "id": 5130,
    "hadith_number": 5130,
    "tajuk_hadith": "Tempoh 'Iddah dan Hak Balu",
    "perawi_melayu": "Diriwayatkan oleh Mujahid:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا شِبْلٌ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، ‏{‏وَالَّذِينَ يُتَوَفَّوْنَ مِنْكُمْ وَيَذَرُونَ أَزْوَاجًا‏}‏ قَالَ كَانَتْ هَذِهِ الْعِدَّةُ تَعْتَدُّ عِنْدَ أَهْلِ زَوْجِهَا وَاجِبًا، فَأَنْزَلَ اللَّهُ ‏{‏وَالَّذِينَ يُتَوَفَّوْنَ مِنْكُمْ وَيَذَرُونَ أَزْوَاجًا وَصِيَّةً لأَزْوَاجِهِمْ مَتَاعًا إِلَى الْحَوْلِ غَيْرَ إِخْرَاجٍ فَإِنْ خَرَجْنَ فَلاَ جُنَاحَ عَلَيْكُمْ فِيمَا فَعَلْنَ فِي أَنْفُسِهِنَّ مِنْ مَعْرُوفٍ‏}‏ قَالَ جَعَلَ اللَّهُ لَهَا تَمَامَ السَّنَةِ سَبْعَةَ أَشْهُرٍ وَعِشْرِينَ لَيْلَةً وَصِيَّةً إِنْ شَاءَتْ سَكَنَتْ فِي وَصِيَّتِهَا، وَإِنْ شَاءَتْ خَرَجَتْ، وَهْوَ قَوْلُ اللَّهِ تَعَالَى ‏{‏غَيْرَ إِخْرَاجٍ فَإِنْ خَرَجْنَ فَلاَ جُنَاحَ عَلَيْكُمْ‏}‏ فَالْعِدَّةُ كَمَا هِيَ، وَاجِبٌ عَلَيْهَا، زَعَمَ ذَلِكَ عَنْ مُجَاهِدٍ‏.‏ وَقَالَ عَطَاءٌ قَالَ ابْنُ عَبَّاسٍ نَسَخَتْ هَذِهِ الآيَةُ عِدَّتَهَا عِنْدَ أَهْلِهَا، فَتَعْتَدُّ حَيْثُ شَاءَتْ، وَقَوْلُ اللَّهِ تَعَالَى ‏{‏غَيْرَ إِخْرَاجٍ‏}‏‏.‏ وَقَالَ عَطَاءٌ إِنْ شَاءَتِ اعْتَدَّتْ عِنْدَ أَهْلِهَا، وَسَكَنَتْ فِي وَصِيَّتِهَا، وَإِنْ شَاءَتْ خَرَجَتْ لِقَوْلِ اللَّهِ ‏{‏فَلاَ جُنَاحَ عَلَيْكُمْ فِيمَا فَعَلْنَ‏}‏‏.‏ قَالَ عَطَاءٌ ثُمَّ جَاءَ الْمِيرَاثُ فَنَسَخَ السُّكْنَى، فَتَعْتَدُّ حَيْثُ شَاءَتْ، وَلاَ سُكْنَى لَهَا‏.‏",
    "malay_translation": "Daripada Mujahid, (berkenaan firman Allah): 'Dan orang-orang yang meninggal dunia di antara kamu serta meninggalkan isteri-isteri,' Itulah tempoh 'Iddah yang wajib dilalui oleh seorang balu di rumah suami yang telah meninggal dunia. Kemudian Allah menurunkan: 'Dan orang-orang yang meninggal dunia di antara kamu serta meninggalkan isteri-isteri, hendaklah berwasiat untuk isteri-isteri mereka, (iaitu) diberi nafkah dan tempat tinggal hingga setahun lamanya. (Tetapi) jika mereka keluar (dari rumah itu), maka tidak ada dosa bagi kamu (wahai wali-wali si mati) tentang apa yang mereka lakukan terhadap diri mereka (sesudah habis tempoh iddah) dari perkara yang baik (yang dibenarkan syarak). (2:240) Mujahid berkata: Allah telah memerintahkan supaya seorang balu itu berhak tinggal selama tujuh bulan dua puluh hari bersama keluarga suaminya melalui wasiat suaminya, agar dia melengkapkan tempoh satu tahun ('Iddah). Tetapi balu itu berhak untuk tinggal dalam tempoh tambahan itu atau keluar dari rumah suaminya sebagaimana yang ditunjukkan oleh firman Allah: 'Tetapi jika mereka keluar, maka tidak ada dosa bagi kamu...' (2:240) Ibnu Abbas berkata: Ayat di atas telah memansuhkan perintah untuk menghabiskan tempoh 'Iddah di rumah suaminya yang telah meninggal dunia, dan oleh itu dia boleh menghabiskan tempoh 'Iddahnya di mana sahaja yang dia suka. Dan Allah berfirman: 'Tanpa mengeluarkannya.' 'Ata berkata: Jika dia mahu, dia boleh menghabiskan tempoh 'Iddahnya di rumah suaminya, dan tinggal di sana menurut wasiatnya (suaminya), dan jika dia mahu, dia boleh keluar (dari rumah suaminya) seperti yang Allah firmankan: 'Tidak ada dosa bagi kamu tentang apa yang mereka lakukan terhadap diri mereka.' (2:240) 'Ata menambah: Kemudian ayat-ayat warisan diturunkan dan perintah bermastautin (bagi balu) dibatalkan, dan dia boleh menghabiskan tempoh 'Iddahnya di mana sahaja yang dia suka, dan dia tidak lagi berhak untuk ditempatkan oleh keluarga suaminya."
  },
  {
    "id": 5131,
    "hadith_number": 5131,
    "tajuk_hadith": "Tempoh Berkabung Bagi Wanita",
    "perawi_melayu": "Diriwayatkan oleh Zainab binti Ummu Salamah:",
    "english_text": "When Um Habiba bint Abi Sufyan was informed of her father's death, she asked for perfume and \nrubbed it over her arms and said, \"I am not in need of perfume, but I have heard the Prophet (ﷺ) saying, \n\"It is not lawful for a lady who believes in Allah and the Last Day to mourn for more than three days \nexcept for her husband for whom the (mourning) period is four months and ten days.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، عَنْ سُفْيَانَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ عَمْرِو بْنِ حَزْمٍ، حَدَّثَنِي حُمَيْدُ بْنُ نَافِعٍ، عَنْ زَيْنَبَ ابْنَةِ أُمِّ سَلَمَةَ، عَنْ أُمِّ حَبِيبَةَ ابْنَةِ أَبِي سُفْيَانَ، لَمَّا جَاءَهَا نَعِيُّ أَبِيهَا دَعَتْ بِطِيبٍ، فَمَسَحَتْ ذِرَاعَيْهَا وَقَالَتْ مَا لِي بِالطِّيبِ مِنْ حَاجَةٍ‏.‏ لَوْلاَ أَنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ تُحِدُّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثٍ، إِلاَّ عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏‏.‏",
    "malay_translation": "Apabila Ummu Habibah binti Abi Sufyan dimaklumkan tentang kematian ayahnya, dia meminta minyak wangi dan mengusapkannya pada lengannya, dan berkata, “Aku tidak memerlukan minyak wangi, tetapi aku telah mendengar Nabi (ﷺ) bersabda, ‘Tidak halal bagi seorang wanita yang beriman kepada Allah dan Hari Akhir untuk berkabung melebihi tiga hari, kecuali ke atas suaminya, tempoh (berkabung) adalah empat bulan sepuluh hari.’”"
  },
  {
    "id": 5132,
    "hadith_number": 5132,
    "tajuk_hadith": "Larangan Nabi ﷺ Terhadap Hasil Jualan Anjing, Jasa Tukang Ramal dan Upah Pelacuran",
    "perawi_melayu": "Diriwayatkan oleh Abu Mas`ud:",
    "english_text": "The Prophet (ﷺ) prohibited taking the price of a dog, the earnings of a soothsayer and the money earned \nby prostitution.",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي مَسْعُودٍ ـ رضى الله عنه ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ ثَمَنِ الْكَلْبِ، وَحُلْوَانِ الْكَاهِنِ، وَمَهْرِ الْبَغِيِّ‏.‏",
    "malay_translation": "Rasulullah ﷺ melarang mengambil harga anjing, pendapatan tukang tilik, dan wang yang diperolehi daripada pelacuran."
  },
  {
    "id": 5133,
    "hadith_number": 5133,
    "tajuk_hadith": "Kutukan terhadap Perbuatan Tertentu dan Pengharaman Riba serta Gambar",
    "perawi_melayu": "Diriwayatkan daripada Abu Juhaifa:",
    "english_text": "The Prophet (ﷺ) cursed the lady who practices tattooing and the one who gets herself tattooed, and one \nwho eats (takes) Riba' (usury) and the one who gives it. And he prohibited taking the price of a dog, \nand the money earned by prostitution, and cursed the makers of pictures.",
    "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَوْنُ بْنُ أَبِي جُحَيْفَةَ، عَنْ أَبِيهِ، قَالَ لَعَنَ النَّبِيُّ صلى الله عليه وسلم الْوَاشِمَةَ، وَالْمُسْتَوْشِمَةَ، وَآكِلَ الرِّبَا وَمُوكِلَهُ، وَنَهَى عَنْ ثَمَنِ الْكَلْبِ، وَكَسْبِ الْبَغِيِّ، وَلَعَنَ الْمُصَوِّرِينَ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) melaknat wanita yang mentatu dan wanita yang meminta ditatu, dan orang yang memakan (mengambil) Riba' (riba) dan orang yang memberikannya. Dan baginda melarang mengambil harga anjing, dan wang yang diperoleh daripada pelacuran, dan melaknat pembuat gambar."
  },
  {
    "id": 5134,
    "hadith_number": 5134,
    "tajuk_hadith": "Nabi ﷺ Melarang Pendapatan Hamba Wanita Melalui Pelacuran",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) forbade taking the earnings of a slave girl by prostitution.",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، أَخْبَرَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ جُحَادَةَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ كَسْبِ الإِمَاءِ‏.‏",
    "malay_translation": "Nabi ﷺ melarang mengambil pendapatan seorang hamba wanita melalui pelacuran."
  },
  {
    "id": 5135,
    "hadith_number": 5135,
    "tajuk_hadith": "Keputusan Nabi ﷺ tentang Perceraian Akibat Tuduhan Zina",
    "perawi_melayu": "Diriwayatkan daripada Sa`id bin Jubair:",
    "english_text": "I said to Ibn `Umar, \"If a man accuses his wife of illegal sexual intercourse (what is the judgment)?\" \nHe said, \"Allah's Prophet separated the couple of Bani 'Ajlan (when the husband accused his wife for \nan illegal sexual intercourse). The Prophet (ﷺ) said, 'Allah knows that one of you two IS a liar; so will one \nof you repent?' But they refused. He then again said, 'Allah knows that one of you two is a liar; so will \none of you repent?' But they refused, whereupon he separated them by divorce.\" Aiyub (a subnarrator) \nsaid: `Amr bin Dinar said to me, \"In the narration there is something which I do not see you \nmentioning, i.e. the husband said, \"What about my money (Mahr)?' The Prophet (ﷺ) said, \"You are not \nentitled to take back money, for if you told the truth you have already entered upon her (and \nconsummated your marriage with her) and if you are a liar then you are less entitled to take it back.",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ زُرَارَةَ، أَخْبَرَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ قُلْتُ لاِبْنِ عُمَرَ رَجُلٌ قَذَفَ امْرَأَتَهُ فَقَالَ فَرَّقَ نَبِيُّ اللَّهِ صلى الله عليه وسلم بَيْنَ أَخَوَىْ بَنِي الْعَجْلاَنِ وَقَالَ ‏\"‏ اللَّهُ يَعْلَمُ أَنَّ أَحَدَكُمَا كَاذِبٌ، فَهَلْ مِنْكُمَا تَائِبٌ ‏\"‏‏.‏ فَأَبَيَا، فَقَالَ ‏\"‏ اللَّهُ يَعْلَمُ أَنَّ أَحَدَكُمَا كَاذِبٌ، فَهَلْ مِنْكُمَا تَائِبٌ ‏\"‏‏.‏ فَأَبَيَا، فَفَرَّقَ بَيْنَهُمَا‏.‏ قَالَ أَيُّوبُ فَقَالَ لِي عَمْرُو بْنُ دِينَارٍ فِي الْحَدِيثِ شَىْءٌ لاَ أَرَاكَ تُحَدِّثُهُ قَالَ قَالَ الرَّجُلُ مَالِي‏.‏ قَالَ ‏\"‏ لاَ مَالَ لَكَ، إِنْ كُنْتَ صَادِقًا فَقَدْ دَخَلْتَ بِهَا، وَإِنْ كُنْتَ كَاذِبًا فَهْوَ أَبْعَدُ مِنْكَ ‏\"‏‏.‏",
    "malay_translation": "Saya bertanya kepada Ibn `Umar, \"Jika seorang lelaki menuduh isterinya melakukan persetubuhan haram (apakah hukumnya)?\" Beliau menjawab, \"Nabi Allah memisahkan pasangan Bani 'Ajlan (ketika suami menuduh isterinya melakukan persetubuhan haram). Nabi (ﷺ) bersabda, 'Allah mengetahui bahawa salah seorang daripada kamu berdua adalah pendusta; maka adakah salah seorang daripada kamu bertaubat?' Tetapi mereka enggan. Kemudian baginda bersabda lagi, 'Allah mengetahui bahawa salah seorang daripada kamu berdua adalah pendusta; maka adakah salah seorang daripada kamu bertaubat?' Tetapi mereka enggan, lalu baginda memisahkan mereka dengan perceraian.\" Aiyub (seorang sub-perawi) berkata: `Amr bin Dinar berkata kepada saya, \"Dalam riwayat itu ada sesuatu yang saya tidak lihat kamu sebutkan, iaitu suami berkata, \"Bagaimana dengan wang saya (Mahr)?' Nabi (ﷺ) bersabda, \"Kamu tidak berhak mengambil balik wang itu, kerana jika kamu berkata benar, kamu telahpun menyetubuhinya (dan menyempurnakan perkahwinanmu dengannya) dan jika kamu pendusta, maka kamu lebih tidak berhak mengambilnya balik.\""
  },
  {
    "id": 5136,
    "hadith_number": 5136,
    "tajuk_hadith": "Keputusan Nabi (ﷺ) dalam Kes Lian",
    "perawi_melayu": "Diriwayatkan oleh Ibnu `Umar:",
    "english_text": "The Prophet (ﷺ) said to those who were involved in a case of Lian, \"Your accounts are with Allah. One of \nyou two is a liar. You (husband) have right on her (wife).\" The husband said, \"My money, O Allah's \nApostle!\" The Prophet (ﷺ) \nsaid, \"You are not entitled to take back any money. If you have told the truth, the Mahr that you paid, \nwas for having sexual relations with her lawfully; and if you are a liar, then you are less entitled to get \nit back.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لِلْمُتَلاَعِنَيْنِ ‏\"‏ حِسَابُكُمَا عَلَى اللَّهِ، أَحَدُكُمَا كَاذِبٌ، لاَ سَبِيلَ لَكَ عَلَيْهَا ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ مَالِي‏.‏ قَالَ ‏\"‏ لاَ مَالَ لَكَ، إِنْ كُنْتَ صَدَقْتَ عَلَيْهَا، فَهْوَ بِمَا اسْتَحْلَلْتَ مِنْ فَرْجِهَا، وَإِنْ كُنْتَ كَذَبْتَ عَلَيْهَا، فَذَاكَ أَبْعَدُ وَأَبْعَدُ لَكَ مِنْهَا ‏\"‏‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda kepada mereka yang terlibat dalam kes Lian, \"Perhitungan kamu berdua dengan Allah. Salah seorang daripada kamu adalah pendusta. Kamu (suami) tidak mempunyai hak ke atasnya (isteri).\" Suami berkata, \"Harta saya, wahai Rasulullah!\" Nabi (ﷺ) bersabda, \"Kamu tidak berhak untuk mengambil semula sebarang harta. Jika kamu berkata benar, maka mahar yang kamu bayar adalah untuk hubungan seksual yang halal dengannya; dan jika kamu pendusta, maka kamu lebih tidak berhak untuk mendapatkannya semula.\""
  }
]
