[
  {
    "id": 2176,
    "hadith_number": 2176,
    "tajuk_hadith": "Keutamaan Bendahari yang Amanah",
    "perawi_melayu": "Diriwayatkan oleh Abu Musa Al-Ash'ari:",
    "english_text": "The Prophet (ﷺ) said, \"The honest treasurer who gives willingly what he is ordered to give, is one of the \ntwo charitable persons, (the second being the owner).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي بُرْدَةَ، قَالَ أَخْبَرَنِي جَدِّي أَبُو بُرْدَةَ، عَنْ أَبِيهِ أَبِي مُوسَى الأَشْعَرِيِّ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيَّ صلى الله عليه وسلم ‏\n\"‏ الْخَازِنُ الأَمِينُ الَّذِي يُؤَدِّي مَا أُمِرَ بِهِ طَيِّبَةً نَفْسُهُ أَحَدُ الْمُتَصَدِّقَيْنِ ‏\"‏‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda, \"Bendahari yang amanah yang memberikan dengan rela hati apa yang diperintahkan untuk diberikan, adalah salah seorang daripada dua orang yang bersedekah (yang kedua adalah pemilik harta tersebut).\""
  },
  {
    "id": 2177,
    "hadith_number": 2177,
    "tajuk_hadith": "Larangan Melantik Pekerja yang Meminta Jawatan",
    "perawi_melayu": "Diriwayatkan oleh Abu Musa:",
    "english_text": "I went to the Prophet (ﷺ) with two men from Ash`ari tribe. I said (to the Prophet), \"I do not know that they \nwant employment.\" The Prophet (ﷺ) said, \"No, we do not appoint for our jobs anybody who demands it \nearnestly.\"",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ قُرَّةَ بْنِ خَالِدٍ، قَالَ حَدَّثَنِي حُمَيْدُ بْنُ هِلاَلٍ، حَدَّثَنَا أَبُو بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ أَقْبَلْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم وَمَعِي رَجُلاَنِ مِنَ الأَشْعَرِيِّينَ، فَقُلْتُ مَا عَلِمْتُ أَنَّهُمَا يَطْلُبَانِ الْعَمَلَ‏.‏ فَقَالَ ‏\n\"‏ لَنْ أَوْ لاَ نَسْتَعْمِلُ عَلَى عَمَلِنَا مَنْ أَرَادَهُ ‏\"‏‏.‏",
    "malay_translation": "Saya pergi kepada Nabi (ﷺ) bersama dua orang lelaki dari suku Ash'ari. Saya berkata (kepada Nabi), \"Saya tidak tahu bahawa mereka mahukan pekerjaan.\" Nabi (ﷺ) bersabda, \"Tidak, kami tidak melantik untuk pekerjaan kami sesiapa yang memintanya dengan bersungguh-sungguh.\""
  },
  {
    "id": 2178,
    "hadith_number": 2178,
    "tajuk_hadith": "Setiap Nabi Pernah Mengembala Kambing",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \"Allah did not send any prophet but shepherded sheep.\" His companions asked him, \n\"Did you do the same?\" The Prophet (ﷺ) replied, \"Yes, I used to shepherd the sheep of the people of \nMecca for some Qirats.\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ الْمَكِّيُّ، حَدَّثَنَا عَمْرُو بْنُ يَحْيَى، عَنْ جَدِّهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَا بَعَثَ اللَّهُ نَبِيًّا إِلاَّ رَعَى الْغَنَمَ ‏\"‏‏.‏ فَقَالَ أَصْحَابُهُ وَأَنْتَ فَقَالَ ‏\"‏ نَعَمْ كُنْتُ أَرْعَاهَا عَلَى قَرَارِيطَ لأَهْلِ مَكَّةَ ‏\"‏‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda, \"Allah tidak mengutuskan seorang nabi pun melainkan pernah mengembala kambing.\" Para sahabatnya bertanya kepada baginda, \"Adakah engkau juga (melakukannya)?\" Nabi (ﷺ) menjawab, \"Ya, aku pernah mengembala kambing penduduk Mekah dengan upah beberapa Qirat.\""
  },
  {
    "id": 2179,
    "hadith_number": 2179,
    "tajuk_hadith": "Nabi Muhammad SAW Mengupah Pemandu Kafir dalam Hijrah",
    "perawi_melayu": "Diriwayatkan oleh `Aisha:",
    "english_text": "The Prophet (ﷺ) and Abu Bakr employed a (pagan) man from the tribe of Bani Ad-Dail and the tribe of \nBani 'Abu bin `Adi as a guide. He was an expert guide and he broke the oath contract which he had to \nabide by with the tribe of Al-`Asi bin Wail and he was on the religion of Quraish pagans. The Prophet (ﷺ) \nand Abu Bakr had confidence in him and gave him their riding camels and told him to bring them to \nthe Cave of Thaur after three days. So, he brought them their two riding camels after three days and \nboth of them (The Prophet (ﷺ) and Abu Bakr) set out accompanied by 'Amir bin Fuhaira and the Dili \nguide who guided them below Mecca along the road leading to the sea-shore.",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ وَاسْتَأْجَرَ النَّبِيُّ صلى الله عليه وسلم وَأَبُو بَكْرٍ رَجُلاً مِنْ بَنِي الدِّيلِ ثُمَّ مِنْ بَنِي عَبْدِ بْنِ عَدِيٍّ هَادِيًا خِرِّيتًا ـ الْخِرِّيتُ الْمَاهِرُ بِالْهِدَايَةِ ـ قَدْ غَمَسَ يَمِينَ حِلْفٍ فِي آلِ الْعَاصِ بْنِ وَائِلٍ، وَهْوَ عَلَى دِينِ كُفَّارِ قُرَيْشٍ، فَأَمِنَاهُ فَدَفَعَا إِلَيْهِ رَاحِلَتَيْهِمَا، وَوَعَدَاهُ غَارَ ثَوْرٍ بَعْدَ ثَلاَثِ لَيَالٍ، فَأَتَاهُمَا بِرَاحِلَتَيْهِمَا، صَبِيحَةَ لَيَالٍ ثَلاَثٍ، فَارْتَحَلاَ، وَانْطَلَقَ مَعَهُمَا عَامِرُ بْنُ فُهَيْرَةَ، وَالدَّلِيلُ الدِّيلِيُّ فَأَخَذَ بِهِمْ أَسْفَلَ مَكَّةَ وَهْوَ طَرِيقُ السَّاحِلِ‏.‏",
    "malay_translation": "Nabi (ﷺ) dan Abu Bakr mengupah seorang lelaki (kafir) dari suku Bani Ad-Dail dan suku Bani 'Abu bin 'Adi sebagai pemandu. Dia adalah seorang pemandu yang pakar dan dia telah memungkiri perjanjian sumpah yang harus dia patuhi dengan suku Al-'Asi bin Wail dan dia berada dalam agama kafir Quraisy. Nabi (ﷺ) dan Abu Bakr mempercayainya dan memberi kepadanya unta tunggangan mereka dan menyuruhnya membawa mereka ke Gua Thaur setelah tiga hari. Maka, dia membawa kepada mereka dua unta tunggangan mereka setelah tiga hari dan kedua-duanya (Nabi (ﷺ) dan Abu Bakr) berangkat disertai oleh 'Amir bin Fuhaira dan pemandu Dili yang memandu mereka di bawah Mekah di sepanjang jalan menuju pantai."
  },
  {
    "id": 2180,
    "hadith_number": 2180,
    "tajuk_hadith": "Mengupah Pemandu dari Bani Ad-Dil",
    "perawi_melayu": "Diriwayatkan oleh Aisyah RA:",
    "english_text": "(the wife of the Prophet) Allah's Messenger (ﷺ) and Abu Bakr hired a man from the tribe of Bani-Ad-Dil as \nan expert guide who was a pagan (follower of the religion of the pagans of Quraish). The Prophet (ﷺ) and \nAbu Bakr gave him their two riding camels and took a promise from him to bring their riding camels \nin the morning of the third day to the Cave of Thaur.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، قَالَ ابْنُ شِهَابٍ فَأَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ وَاسْتَأْجَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ رَجُلاً مِنْ بَنِي الدِّيلِ، هَادِيًا خِرِّيتًا وَهْوَ عَلَى دِينِ كُفَّارِ قُرَيْشٍ، فَدَفَعَا إِلَيْهِ رَاحِلَتَيْهِمَا، وَوَاعَدَاهُ غَارَ ثَوْرٍ بَعْدَ ثَلاَثِ لَيَالٍ بِرَاحِلَتَيْهِمَا صُبْحَ ثَلاَثٍ‏.‏",
    "malay_translation": "(Isteri Nabi) Rasulullah (ﷺ) dan Abu Bakr mengupah seorang lelaki dari suku Bani-Ad-Dil sebagai seorang pemandu pakar yang merupakan seorang pagan (pengikut agama berhala Quraisy). Nabi (ﷺ) dan Abu Bakr memberikan kepadanya dua ekor unta tunggangan mereka dan mengambil janji daripadanya untuk membawa unta tunggangan mereka pada pagi hari ketiga ke Gua Thaur."
  },
  {
    "id": 2181,
    "hadith_number": 2181,
    "tajuk_hadith": "Hadis tentang Pertelingkahan dan Gigi yang Patah",
    "perawi_melayu": "Diriwayatkan oleh Ya`la bin Umaiya:",
    "english_text": "I fought in Jaish-al-Usra (Ghazwa of Tabuk) along with the Prophet (ﷺ) and in my opinion that was the \nbest of my deeds. Then I had an employee, who quarrel led with someone and one of the them bit and \ncut the other's finger and caused his own tooth to fall out. He then went to the Prophet (with a \ncomplaint) but the Prophet (ﷺ) canceled the suit and said to the complainant, \"Did you expect him to let \nhis finger in your mouth so that you might snap and cut it (as does a stallion camel)?\" \nNarrated Ibn Juraij from `Abdullah bin Abu Mulaika from his grandfather a similar story: A man bit \nthe hand of another man and caused his own tooth to fall out, but Abu Bakr judged that he had no \nright for compensation (for the broken tooth).",
    "arabic_text": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، عَنْ صَفْوَانَ بْنِ يَعْلَى، عَنْ يَعْلَى بْنِ أُمَيَّةَ ـ رضى الله عنه ـ قَالَ غَزَوْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم جَيْشَ الْعُسْرَةِ فَكَانَ مِنْ أَوْثَقِ أَعْمَالِي فِي نَفْسِي، فَكَانَ لِي أَجِيرٌ، فَقَاتَلَ إِنْسَانًا، فَعَضَّ أَحَدُهُمَا إِصْبَعَ صَاحِبِهِ، فَانْتَزَعَ إِصْبَعَهُ، فَأَنْدَرَ ثَنِيَّتَهُ فَسَقَطَتْ، فَانْطَلَقَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَهْدَرَ ثَنِيَّتَهُ وَقَالَ ‏\n\"‏ أَفَيَدَعُ إِصْبَعَهُ فِي فِيكَ تَقْضَمُهَا ـ قَالَ أَحْسِبُهُ قَالَ ـ كَمَا يَقْضَمُ الْفَحْلُ ‏\"‏‏.‏ قَالَ ابْنُ جُرَيْجٍ وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي مُلَيْكَةَ، عَنْ جَدِّهِ، بِمِثْلِ هَذِهِ الصِّفَةِ أَنَّ رَجُلاً، عَضَّ يَدَ رَجُلٍ، فَأَنْدَرَ ثَنِيَّتَهُ، فَأَهْدَرَهَا أَبُو بَكْرٍ رضى الله عنه‏.‏",
    "malay_translation": "Saya berperang dalam Jaish-al-Usra (Ghazwa Tabuk) bersama Nabi (ﷺ) dan pada pendapat saya itu adalah sebaik-baik amalan saya. Kemudian saya mempunyai seorang pekerja, yang bertengkar dengan seseorang dan salah seorang daripada mereka menggigit dan memutuskan jari yang lain dan menyebabkan giginya sendiri tercabut. Dia kemudian pergi kepada Nabi (dengan aduan) tetapi Nabi (ﷺ) membatalkan tuntutan itu dan berkata kepada pengadu, \"Adakah kamu menjangkakan dia membiarkan jarinya di dalam mulut kamu supaya kamu boleh menggigit dan memotongnya (seperti yang dilakukan oleh unta jantan)?\" Diriwayatkan daripada Ibn Juraij daripada `Abdullah bin Abu Mulaika daripada datuknya cerita yang serupa: Seorang lelaki menggigit tangan seorang lelaki lain dan menyebabkan giginya sendiri tercabut, tetapi Abu Bakr memutuskan bahawa dia tidak berhak mendapat pampasan (untuk gigi yang patah)."
  },
  {
    "id": 2182,
    "hadith_number": 2182,
    "tajuk_hadith": "Kisah Musa dan Al-Khadir Memperbaiki Dinding yang Hampir Roboh",
    "perawi_melayu": "Diriwayatkan oleh Ubai bin Ka'b:",
    "english_text": "Allah's Messenger (ﷺ) said, \"Both of them (Moses and Al-Khadir) proceeded on till they reached a wall \nwhich was about to fall.\" Sa`d said , \"(Al-Khadir pointed) with his hands (towards the \nwall) and then raised his hands and the wall became straightened up.\" Ya`la said, \"I think Sa`id [?? or \nSa`d] said, 'He (Khadir) passed his hand over it and it was straightened up.\" (Moses said to him), \"if \nyou had wanted, you could have taken wages for it.\" Sa`id  said, \"Wages with which to \nbuy food . \"",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي يَعْلَى بْنُ مُسْلِمٍ، وَعَمْرُو بْنُ دِينَارٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، يَزِيدُ أَحَدُهُمَا عَلَى صَاحِبِهِ، وَغَيْرُهُمَا قَالَ قَدْ سَمِعْتُهُ يُحَدِّثُهُ عَنْ سَعِيدٍ قَالَ قَالَ لِي ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ حَدَّثَنِي أُبَىُّ بْنُ كَعْبٍ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَانْطَلَقَا فَوَجَدَا جِدَارًا يُرِيدُ أَنْ يَنْقَضَّ ‏\"‏‏.‏ قَالَ سَعِيدٌ بِيَدِهِ هَكَذَا، وَرَفَعَ يَدَيْهِ فَاسْتَقَامَ، قَالَ يَعْلَى حَسِبْتُ أَنَّ سَعِيدًا قَالَ‏.‏ فَمَسَحَهُ بِيَدِهِ فَاسْتَقَامَ ‏{‏قَالَ‏}‏ ‏\"‏لَوْ شِئْتَ لاَتَّخَذْتَ عَلَيْهِ أَجْرًا ‏\"‏‏.‏ قَالَ سَعِيدٌ أَجْرًا نَأْكُلُهُ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda, \"Kedua-duanya (Musa dan Al-Khadir) meneruskan perjalanan sehingga mereka sampai ke sebuah dinding yang hampir roboh.\" Sa`d berkata, \"(Al-Khadir menunjuk) dengan tangannya (ke arah dinding) dan kemudian mengangkat tangannya dan dinding itu menjadi tegak semula.\" Ya`la berkata, \"Saya rasa Sa`id [?? atau Sa`d] berkata, 'Dia (Khadir) menyapu tangannya ke atasnya dan ia menjadi tegak semula.'\" (Musa berkata kepadanya), \"jika kamu mahu, kamu boleh mengambil upah untuknya.\" Sa`id berkata, \"Upah yang dengannya kita boleh membeli makanan.\""
  },
  {
    "id": 2183,
    "hadith_number": 2183,
    "tajuk_hadith": "Perumpamaan Umat Islam dan Ahli Kitab",
    "perawi_melayu": "Diriwayatkan oleh Ibn Umar:",
    "english_text": "The Prophet (ﷺ) said, \"Your example and the example of the people of the two Scriptures (i.e. Jews and \nChristians) is like the example of a man who employed some laborers and asked them, 'Who will \nwork for me from morning till midday for one Qirat?' The Jews accepted and carried out the work. He \nthen asked, Who will work for me from midday up to the `Asr prayer for one Qirat?' The Christians \naccepted and fulfilled the work. He then said, 'Who will work for me from the `Asr till sunset for two \nQirats?' You, Muslims have accepted the offer. The Jews and the Christians got angry and said, 'Why \nshould we work more and get lesser wages?' (Allah) said, 'Have I withheld part of your right?' They \nreplied in the negative. He said, 'It is My Blessing, I bestow upon whomever I wish .'",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَثَلُكُمْ وَمَثَلُ أَهْلِ الْكِتَابَيْنِ كَمَثَلِ رَجُلٍ اسْتَأْجَرَ أُجَرَاءَ فَقَالَ مَنْ يَعْمَلُ لِي مِنْ غُدْوَةَ إِلَى نِصْفِ النَّهَارِ عَلَى قِيرَاطٍ فَعَمِلَتِ الْيَهُودُ، ثُمَّ قَالَ مَنْ يَعْمَلُ لِي مِنْ نِصْفِ النَّهَارِ إِلَى صَلاَةِ الْعَصْرِ عَلَى قِيرَاطٍ فَعَمِلَتِ النَّصَارَى ثُمَّ، قَالَ مَنْ يَعْمَلُ لِي مِنَ الْعَصْرِ إِلَى أَنْ تَغِيبَ الشَّمْسُ عَلَى قِيرَاطَيْنِ فَأَنْتُمْ هُمْ، فَغَضِبَتِ الْيَهُودُ وَالنَّصَارَى، فَقَالُوا مَا لَنَا أَكْثَرَ عَمَلاً، وَأَقَلَّ عَطَاءً قَالَ هَلْ نَقَصْتُكُمْ مِنْ حَقِّكُمْ قَالُوا لاَ‏.‏ قَالَ فَذَلِكَ فَضْلِي أُوتِيهِ مَنْ أَشَاءُ ‏\"‏‏.‏",
    "malay_translation": "Nabi ﷺ bersabda, \"Perumpamaan kamu dan perumpamaan ahli kitab (iaitu Yahudi dan Kristian) adalah seperti seorang lelaki yang mengupah beberapa orang pekerja dan bertanya kepada mereka, 'Siapa yang mahu bekerja untukku dari pagi hingga tengah hari dengan upah satu Qirat?' Orang Yahudi bersetuju dan melaksanakan pekerjaan itu. Kemudian dia bertanya lagi, 'Siapa yang mahu bekerja untukku dari tengah hari hingga solat Asar dengan upah satu Qirat?' Orang Kristian bersetuju dan melaksanakan pekerjaan itu.  Kemudian dia berkata lagi, 'Siapa yang mahu bekerja untukku dari waktu Asar hingga matahari terbenam dengan upah dua Qirat?' Kamu, umat Islam, telah menerima tawaran ini.\" Orang Yahudi dan Kristian menjadi marah dan berkata, 'Mengapa kami bekerja lebih banyak tetapi mendapat upah yang lebih sedikit?' Allah berfirman, 'Adakah Aku mengurangkan hak kamu?' Mereka menjawab, 'Tidak.' Allah berfirman, 'Itulah kurnia-Ku, Aku berikan kepada sesiapa yang Aku kehendaki.'"
  },
  {
    "id": 2184,
    "hadith_number": 2184,
    "tajuk_hadith": "Perumpamaan Umat Islam, Yahudi dan Nasrani dan Kelebihan Kurniaan Allah",
    "perawi_melayu": "Diriwayatkan oleh Abdullah bin `Umar bin Al-Khattab:",
    "english_text": "Allah's Messenger (ﷺ) said, \"Your example and the example of Jews and Christians is like the example of a \nman who employed some laborers to whom he said, 'Who will work for me up to midday for one \nQirat each?' The Jews carried out the work for one Qirat each; and then the Christians carried out the \nwork up to the `Asr prayer for one Qirat each; and now you Muslims are working from the `Asr \nprayer up to sunset for two Qirats each. The Jews and Christians got angry and said, 'We work more \nand are paid less.' The employer (Allah) asked them, 'Have I usurped some of your right?' They \nreplied in the negative. He said, 'That is My Blessing, I bestow upon whomever I wish.' \"",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، مَوْلَى عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّمَا مَثَلُكُمْ وَالْيَهُودُ وَالنَّصَارَى كَرَجُلٍ اسْتَعْمَلَ عُمَّالاً فَقَالَ مَنْ يَعْمَلُ لِي إِلَى نِصْفِ النَّهَارِ عَلَى قِيرَاطٍ قِيرَاطٍ فَعَمِلَتِ الْيَهُودُ عَلَى قِيرَاطٍ قِيرَاطٍ، ثُمَّ عَمِلَتِ النَّصَارَى عَلَى قِيرَاطٍ قِيرَاطٍ، ثُمَّ أَنْتُمُ الَّذِينَ تَعْمَلُونَ مِنْ صَلاَةِ الْعَصْرِ إِلَى مَغَارِبِ الشَّمْسِ عَلَى قِيرَاطَيْنِ قِيرَاطَيْنِ، فَغَضِبَتِ الْيَهُودُ وَالنَّصَارَى وَقَالُوا نَحْنُ أَكْثَرُ عَمَلاً وَأَقَلُّ عَطَاءً، قَالَ هَلْ ظَلَمْتُكُمْ مِنْ حَقِّكُمْ شَيْئًا قَالُوا لاَ‏.‏ فَقَالَ فَذَلِكَ فَضْلِي أُوتِيهِ مَنْ أَشَاءُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda, \"Perumpamaan kamu dan perumpamaan Yahudi dan Nasrani adalah seperti perumpamaan seorang lelaki yang mengupah beberapa orang pekerja dan berkata kepada mereka, 'Siapa yang mahu bekerja untukku hingga tengah hari dengan upah satu Qirat setiap seorang?' Orang Yahudi bekerja dengan upah satu Qirat setiap seorang; kemudian orang Nasrani bekerja hingga solat Asar dengan upah satu Qirat setiap seorang; dan sekarang kamu umat Islam bekerja dari solat Asar hingga matahari terbenam dengan upah dua Qirat setiap seorang. Orang Yahudi dan Nasrani marah dan berkata, 'Kami bekerja lebih banyak dan dibayar lebih sedikit.' Majikan (Allah) bertanya kepada mereka, 'Adakah Aku telah menzalimi hak kamu sedikit pun?' Mereka menjawab tidak. Dia berfirman, 'Itulah kurniaan-Ku, Aku berikan kepada sesiapa yang Aku kehendaki.' \""
  },
  {
    "id": 2185,
    "hadith_number": 2185,
    "tajuk_hadith": "Tiga Golongan yang Allah Akan Menjadi Musuh Mereka di Hari Kiamat",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \"Allah said, 'I will be an opponent to three types of people on the Day of \nResurrection: \n-1. One who makes a covenant in My Name, but proves treacherous; \n-2. One who sells a free person and eats his price; and \n-3. One who employs a laborer and takes full work from him but does not pay him for his lab our.' \"",
    "arabic_text": "حَدَّثَنَا يُوسُفُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنِي يَحْيَى بْنُ سُلَيْمٍ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ قَالَ اللَّهُ تَعَالَى ثَلاَثَةٌ أَنَا خَصْمُهُمْ يَوْمَ الْقِيَامَةِ رَجُلٌ أَعْطَى بِي ثُمَّ غَدَرَ، وَرَجُلٌ بَاعَ حُرًّا فَأَكَلَ ثَمَنَهُ، وَرَجُلٌ اسْتَأْجَرَ أَجِيرًا فَاسْتَوْفَى مِنْهُ وَلَمْ يُعْطِهِ أَجْرَهُ ‏\"‏‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda, \"Allah berfirman, 'Aku akan menjadi musuh kepada tiga jenis orang pada Hari Kiamat: -1. Seseorang yang membuat perjanjian atas nama-Ku, tetapi mengkhianatinya; -2. Seseorang yang menjual orang merdeka dan memakan harganya; dan -3. Seseorang yang mempekerjakan seorang pekerja dan mengambil pekerjaan penuh darinya tetapi tidak membayarnya upahnya.' \""
  },
  {
    "id": 2186,
    "hadith_number": 2186,
    "tajuk_hadith": "Perumpamaan Orang Islam, Yahudi dan Nasrani",
    "perawi_melayu": "Diriwayatkan oleh Abu Musa:",
    "english_text": "The Prophet (ﷺ) said, \"The example of Muslims, Jews and Christians is like the example of a man who \nemployed laborers to work for him from morning till night for specific wages. They worked till \nmidday and then said, 'We do not need your money which you have fixed for us and let whatever we \nhave done be annulled.' The man said to them, 'Don't quit the work, but complete the rest of it and \ntake your full wages.' But they refused and went away. The man employed another batch after them \nand said to them, 'Complete the rest of the day and yours will be the wages I had fixed for the first \nbatch.' So, they worked till the time of `Asr prayer. Then they said, \"Let what we have done be \nannulled and keep the wages you have promised us for yourself.' The man said to them, 'Complete the \nrest of the work, as only a little of the day remains,' but they refused. Thereafter he employed another \nbatch to work for the rest of the day and they worked for the rest of the day till the sunset, and they \nreceived the wages of the two former batches. So, that was the example of those people (Muslims) and \nthe example of this light (guidance) which they have accepted willingly.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَثَلُ الْمُسْلِمِينَ وَالْيَهُودِ وَالنَّصَارَى كَمَثَلِ رَجُلٍ اسْتَأْجَرَ قَوْمًا يَعْمَلُونَ لَهُ عَمَلاً يَوْمًا إِلَى اللَّيْلِ عَلَى أَجْرٍ مَعْلُومٍ، فَعَمِلُوا لَهُ إِلَى نِصْفِ النَّهَارِ فَقَالُوا لاَ حَاجَةَ لَنَا إِلَى أَجْرِكَ الَّذِي شَرَطْتَ لَنَا، وَمَا عَمِلْنَا بَاطِلٌ، فَقَالَ لَهُمْ لاَ تَفْعَلُوا أَكْمِلُوا بَقِيَّةَ عَمَلِكُمْ، وَخُذُوا أَجْرَكُمْ كَامِلاً، فَأَبَوْا وَتَرَكُوا، وَاسْتَأْجَرَ أَجِيرَيْنِ بَعْدَهُمْ فَقَالَ لَهُمَا أَكْمِلاَ بَقِيَّةَ يَوْمِكُمَا هَذَا، وَلَكُمَا الَّذِي شَرَطْتُ لَهُمْ مِنَ الأَجْرِ‏.‏ فَعَمِلُوا حَتَّى إِذَا كَانَ حِينُ صَلاَةِ الْعَصْرِ قَالاَ لَكَ مَا عَمِلْنَا بَاطِلٌ، وَلَكَ الأَجْرُ الَّذِي جَعَلْتَ لَنَا فِيهِ‏.‏ فَقَالَ لَهُمَا أَكْمِلاَ بَقِيَّةَ عَمَلِكُمَا، فَإِنَّ مَا بَقِيَ مِنَ النَّهَارِ شَىْءٌ يَسِيرٌ‏.‏ فَأَبَيَا، وَاسْتَأْجَرَ قَوْمًا أَنْ يَعْمَلُوا لَهُ بَقِيَّةَ يَوْمِهِمْ، فَعَمِلُوا بَقِيَّةَ يَوْمِهِمْ حَتَّى غَابَتِ الشَّمْسُ، وَاسْتَكْمَلُوا أَجْرَ الْفَرِيقَيْنِ كِلَيْهِمَا، فَذَلِكَ مَثَلُهُمْ وَمَثَلُ مَا قَبِلُوا مِنْ هَذَا النُّورِ ‏\"‏‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda, \"Perumpamaan orang Islam, Yahudi dan Nasrani adalah seperti perumpamaan seorang lelaki yang mengupah pekerja untuk bekerja untuknya dari pagi hingga malam dengan upah yang ditetapkan. Mereka bekerja hingga tengah hari dan kemudian berkata, 'Kami tidak memerlukan wang anda yang telah anda tetapkan untuk kami dan biarkan apa sahaja yang telah kami lakukan dibatalkan.' Lelaki itu berkata kepada mereka, 'Jangan berhenti kerja, tetapi selesaikanlah kerja yang selebihnya dan ambil upah penuh anda.' Tetapi mereka menolak dan pergi. Lelaki itu mengupah kumpulan lain selepas mereka dan berkata kepada mereka, 'Selesaikanlah sisa hari ini dan upah kamu adalah upah yang telah saya tetapkan untuk kumpulan pertama.' Maka, mereka bekerja hingga waktu solat Asar. Kemudian mereka berkata, 'Biarkan apa sahaja yang telah kami lakukan dibatalkan dan simpanlah upah yang telah anda janjikan kepada kami untuk diri anda sendiri.' Lelaki itu berkata kepada mereka, 'Selesaikanlah sisa kerja, kerana hanya sedikit sahaja lagi yang tinggal dari hari ini,' tetapi mereka menolak. Selepas itu dia mengupah kumpulan lain untuk bekerja untuk sisa hari itu dan mereka bekerja untuk sisa hari itu hingga matahari terbenam, dan mereka menerima upah dua kumpulan sebelumnya. Maka, itulah perumpamaan orang-orang itu (Muslim) dan perumpamaan cahaya (petunjuk) ini yang telah mereka terima dengan rela hati.\""
  },
  {
    "id": 2187,
    "hadith_number": 2187,
    "tajuk_hadith": "Kisah Tiga Orang Lelaki yang Terperangkap di Dalam Gua",
    "perawi_melayu": "Diriwayatkan oleh Abdullah bin Umar:",
    "english_text": "I heard Allah's Messenger (ﷺ) saying, \"Three men from among those who were before you, set out together \ntill they reached a cave at night and entered it. A big rock rolled down the mountain and closed the \nmouth of the cave. They said (to each other), Nothing could save you from this rock but to invoke \nAllah by giving reference to the righteous deed which you have done (for Allah's sake only).' So, one \nof them said, 'O Allah! I had old parents and I never provided my family (wife, children etc.) with \nmilk before them. One day, by chance I was delayed, and I came late (at night) while they had slept. I \nmilked the sheep for them and took the milk to them, but I found them sleeping. I disliked to provide \nmy family with the milk before them. I waited for them and the bowl of milk was in my hand and I \nkept on waiting for them to get up till the day dawned. Then they got up and drank the milk. O Allah! \nIf I did that for Your Sake only, please relieve us from our critical situation caused by this rock.' So, \nthe rock shifted a little but they could not get out.\" \nThe Prophet (ﷺ) added, \"The second man said, 'O Allah! I had a cousin who was the dearest of all people \nto me and I wanted to have sexual relations with her but she refused. Later she had a hard time in a \nfamine year and she came to me and I gave her one-hundred-and-twenty Dinars on the condition that \nshe would not resist my desire, and she agreed. When I was about to fulfill my desire, she said: It is \nillegal for you to outrage my chastity except by legitimate marriage. So, I thought it a sin to have \nsexual intercourse with her and left her though she was the dearest of all the people to me, and also I \nleft the gold I had given her. O Allah! If I did that for Your Sake only, please relieve us from the \npresent calamity.' So, the rock shifted a little more but still they could not get out from there.\" \nThe Prophet (ﷺ) added, \"Then the third man said, 'O Allah! I employed few laborers and I paid them their \nwages with the exception of one man who did not take his wages and went away. I invested his wages \nand I got much property thereby. (Then after some time) he came and said to me: O Allah's slave! Pay \nme my wages. I said to him: All the camels, cows, sheep and slaves you see, are yours. He said: O \nAllah's slave! Don't mock at me. I said: I am not mocking at you. So, he took all the herd and drove \nthem away and left nothing. O Allah! If I did that for Your Sake only, please relieve us from the \npresent suffering.' So, that rock shifted completely and they got out walking.",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ انْطَلَقَ ثَلاَثَةُ رَهْطٍ مِمَّنْ كَانَ قَبْلَكُمْ حَتَّى أَوَوُا الْمَبِيتَ إِلَى غَارٍ فَدَخَلُوهُ، فَانْحَدَرَتْ صَخْرَةٌ مِنَ الْجَبَلِ فَسَدَّتْ عَلَيْهِمُ الْغَارَ فَقَالُوا إِنَّهُ لاَ يُنْجِيكُمْ مِنْ هَذِهِ الصَّخْرَةِ إِلاَّ أَنْ تَدْعُوا اللَّهَ بِصَالِحِ أَعْمَالِكُمْ‏.‏ فَقَالَ رَجُلٌ مِنْهُمُ اللَّهُمَّ كَانَ لِي أَبَوَانِ شَيْخَانِ كَبِيرَانِ، وَكُنْتُ لاَ أَغْبِقُ قَبْلَهُمَا أَهْلاً وَلاَ مَالاً، فَنَأَى بِي فِي طَلَبِ شَىْءٍ يَوْمًا، فَلَمْ أُرِحْ عَلَيْهِمَا حَتَّى نَامَا، فَحَلَبْتُ لَهُمَا غَبُوقَهُمَا فَوَجَدْتُهُمَا نَائِمَيْنِ وَكَرِهْتُ أَنْ أَغْبِقَ قَبْلَهُمَا أَهْلاً أَوْ مَالاً، فَلَبِثْتُ وَالْقَدَحُ عَلَى يَدَىَّ أَنْتَظِرُ اسْتِيقَاظَهُمَا حَتَّى بَرَقَ الْفَجْرُ، فَاسْتَيْقَظَا فَشَرِبَا غَبُوقَهُمَا، اللَّهُمَّ إِنْ كُنْتُ فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ فَفَرِّجْ عَنَّا مَا نَحْنُ فِيهِ مِنْ هَذِهِ الصَّخْرَةِ، فَانْفَرَجَتْ شَيْئًا لاَ يَسْتَطِيعُونَ الْخُرُوجَ ‏\"‏‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَقَالَ الآخَرُ اللَّهُمَّ كَانَتْ لِي بِنْتُ عَمٍّ كَانَتْ أَحَبَّ النَّاسِ إِلَىَّ، فَأَرَدْتُهَا عَنْ نَفْسِهَا، فَامْتَنَعَتْ مِنِّي حَتَّى أَلَمَّتْ بِهَا سَنَةٌ مِنَ السِّنِينَ، فَجَاءَتْنِي فَأَعْطَيْتُهَا عِشْرِينَ وَمِائَةَ دِينَارٍ عَلَى أَنْ تُخَلِّيَ بَيْنِي وَبَيْنَ نَفْسِهَا، فَفَعَلَتْ حَتَّى إِذَا قَدَرْتُ عَلَيْهَا قَالَتْ لاَ أُحِلُّ لَكَ أَنْ تَفُضَّ الْخَاتَمَ إِلاَّ بِحَقِّهِ‏.‏ فَتَحَرَّجْتُ مِنَ الْوُقُوعِ عَلَيْهَا، فَانْصَرَفْتُ عَنْهَا وَهْىَ أَحَبُّ النَّاسِ إِلَىَّ وَتَرَكْتُ الذَّهَبَ الَّذِي أَعْطَيْتُهَا، اللَّهُمَّ إِنْ كُنْتُ فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ فَافْرُجْ عَنَّا مَا نَحْنُ فِيهِ‏.‏ فَانْفَرَجَتِ الصَّخْرَةُ، غَيْرَ أَنَّهُمْ لاَ يَسْتَطِيعُونَ الْخُرُوجَ مِنْهَا‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم وَقَالَ الثَّالِثُ اللَّهُمَّ إِنِّي اسْتَأْجَرْتُ أُجَرَاءَ فَأَعْطَيْتُهُمْ أَجْرَهُمْ، غَيْرَ رَجُلٍ وَاحِدٍ تَرَكَ الَّذِي لَهُ وَذَهَبَ فَثَمَّرْتُ أَجْرَهُ حَتَّى كَثُرَتْ مِنْهُ الأَمْوَالُ، فَجَاءَنِي بَعْدَ حِينٍ فَقَالَ يَا عَبْدَ اللَّهِ أَدِّ إِلَىَّ أَجْرِي‏.‏ فَقُلْتُ لَهُ كُلُّ مَا تَرَى مِنْ أَجْرِكَ مِنَ الإِبِلِ وَالْبَقَرِ وَالْغَنَمِ وَالرَّقِيقِ‏.‏ فَقَالَ يَا عَبْدَ اللَّهِ لاَ تَسْتَهْزِئْ بِي‏.‏ فَقُلْتُ إِنِّي لاَ أَسْتَهْزِئُ بِكَ‏.‏ فَأَخَذَهُ كُلَّهُ فَاسْتَاقَهُ فَلَمْ يَتْرُكْ مِنْهُ شَيْئًا، اللَّهُمَّ فَإِنْ كُنْتُ فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ فَافْرُجْ عَنَّا مَا نَحْنُ فِيهِ‏.‏ فَانْفَرَجَتِ الصَّخْرَةُ فَخَرَجُوا يَمْشُونَ ‏\"‏‏.‏",
    "malay_translation": "Saya mendengar Rasulullah (ﷺ) bersabda, \"Tiga orang lelaki dari kalangan orang-orang sebelum kamu, berjalan bersama-sama \nsehingga mereka sampai ke sebuah gua pada waktu malam dan masuk ke dalamnya. Sebuah batu besar menggelongsor dari gunung dan menutup \nmulut gua. Mereka berkata (sesama mereka), 'Tidak ada yang dapat menyelamatkan kamu dari batu ini kecuali kamu berdoa \nkepada Allah dengan menyebut amal soleh yang telah kamu lakukan (ikhlas kerana Allah semata-mata).' Maka, salah seorang \ndari mereka berkata, 'Ya Allah! Aku mempunyai ibu bapa yang sudah tua dan aku tidak pernah memberi makan keluargaku (isteri, anak-anak dll.) dengan \nsusu sebelum mereka. Pada suatu hari, secara kebetulan aku terlewat, dan aku pulang lewat (pada waktu malam) ketika mereka sudah tidur. Aku \nmemerah susu kambing untuk mereka dan membawa susu itu kepada mereka, tetapi aku mendapati mereka sedang tidur. Aku tidak suka memberi makan \nkeluargaku dengan susu sebelum mereka. Aku menunggu mereka dan mangkuk susu berada di tanganku dan aku \nterus menunggu mereka bangun sehingga fajar menyingsing. Kemudian mereka bangun dan minum susu itu. Ya Allah! \nJika aku melakukan itu ikhlas kerana-Mu semata-mata, maka lepaskanlah kami dari keadaan genting yang disebabkan oleh batu ini.' Maka, \nbatu itu berganjak sedikit tetapi mereka tidak dapat keluar.\" \nNabi (ﷺ) menambah, \"Lelaki kedua berkata, 'Ya Allah! Aku mempunyai seorang sepupu perempuan yang paling aku cintai \ndari semua orang dan aku ingin melakukan hubungan seksual dengannya tetapi dia menolak. Kemudian dia mengalami masa sukar pada tahun \nkebuluran dan dia datang kepadaku dan aku memberinya seratus dua puluh Dinar dengan syarat dia \ntidak akan menolak keinginanku, dan dia bersetuju. Apabila aku hendak memenuhi keinginanku, dia berkata: Tidak \nhalal bagimu untuk merosakkan kehormatanku kecuali dengan perkahwinan yang sah. Maka, aku menganggapnya dosa untuk melakukan \nhubungan seksual dengannya dan meninggalkannya walaupun dia adalah orang yang paling aku cintai, dan juga aku \nmeninggalkan emas yang telah aku berikan kepadanya. Ya Allah! Jika aku melakukan itu ikhlas kerana-Mu semata-mata, maka lepaskanlah kami dari \nmusibah yang ada sekarang.' Maka, batu itu berganjak sedikit lagi tetapi mereka masih tidak dapat keluar dari sana.\" \nNabi (ﷺ) menambah, \"Kemudian lelaki ketiga berkata, 'Ya Allah! Aku telah mengambil beberapa orang buruh dan aku telah membayar \ngaji mereka kecuali seorang lelaki yang tidak mengambil gajinya dan pergi. Aku melaburkan gajinya \ndan aku mendapat harta yang banyak daripadanya. (Kemudian selepas beberapa waktu) dia datang dan berkata kepadaku: Wahai hamba Allah! Bayar \ngajiku. Aku berkata kepadanya: Semua unta, lembu, kambing dan hamba yang kamu lihat, adalah milikmu. Dia berkata: Wahai \nhamba Allah! Jangan perolok-olokkan aku. Aku berkata: Aku tidak memperolok-olokkan kamu. Maka, dia mengambil semua ternakan itu dan menghalaunya pergi \ndan tidak meninggalkan apa-apa. Ya Allah! Jika aku melakukan itu ikhlas kerana-Mu semata-mata, maka lepaskanlah kami dari \npenderitaan yang ada sekarang.' Maka, batu itu berganjak sepenuhnya dan mereka keluar berjalan."
  },
  {
    "id": 2188,
    "hadith_number": 2188,
    "tajuk_hadith": "Semangat Sahabat Bersedekah: Dulu dan Kini",
    "perawi_melayu": "Diriwayatkan oleh Abu Mas'ud Al-Ansari:",
    "english_text": "Whenever Allah's Messenger (ﷺ) ordered us to give in charity we would go to the market and work as \nporters to earn a Mudd (two handfuls) (of foodstuff) but now some of us have one-hundred thousand \nDirhams or Diners. (The sub-narrator) Shaqiq said, \"I think Abu Mas`ud meant himself by saying \n(some of us) .",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى بْنِ سَعِيدٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ شَقِيقٍ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ ـ رضى الله عنه ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَمَرَ بِالصَّدَقَةِ انْطَلَقَ أَحَدُنَا إِلَى السُّوقِ فَيُحَامِلُ فَيُصِيبُ الْمُدَّ، وَإِنَّ لِبَعْضِهِمْ لَمِائَةَ أَلْفٍ، قَالَ مَا نُرَاهُ إِلاَّ نَفْسَهُ‏.‏",
    "malay_translation": "Setiap kali Rasulullah (ﷺ) memerintahkan kami untuk bersedekah, kami akan pergi ke pasar dan bekerja sebagai buruh angkut untuk mendapatkan satu Mudd (dua genggam) (bahan makanan). Tetapi sekarang, beberapa dari kami memiliki seratus ribu Dirham atau Dinar. (Sub-periwayat) Shaqiq berkata, \"Saya rasa Abu Mas'ud memaksudkan dirinya sendiri ketika mengatakan (beberapa dari kami).\""
  },
  {
    "id": 2189,
    "hadith_number": 2189,
    "tajuk_hadith": "Larangan Orang Kota Menjual untuk Orang Badwi",
    "perawi_melayu": "Diriwayatkan oleh Tawus:",
    "english_text": "Ibn `Abbas said, \"The Prophet (ﷺ) forbade the meeting of caravans (on the way) and ordained that no \ntownsman is permitted to sell things on behalf of a bedouin.\" I asked Ibn `Abbas, \"What is the \nmeaning of his saying, 'No townsman is permitted to sell things on behalf of a bedouin.' \" He replied, \n\"He should not work as a broker for him.\"",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُتَلَقَّى الرُّكْبَانُ، وَلاَ يَبِيعَ حَاضِرٌ لِبَادٍ‏.‏ قُلْتُ يَا ابْنَ عَبَّاسٍ مَا قَوْلُهُ لاَ يَبِيعُ حَاضِرٌ لِبَادٍ قَالَ لاَ يَكُونُ لَهُ سِمْسَارًا‏.‏",
    "malay_translation": "Ibnu Abbas berkata, \"Nabi (ﷺ) melarang perjumpaan kafilah (di jalan) dan memerintahkan agar tidak seorang pun warga kota dibenarkan menjual barang bagi pihak badwi.\" Saya bertanya kepada Ibnu Abbas, \"Apa maksud perkataannya, 'Tidak seorang pun warga kota dibenarkan menjual barang bagi pihak badwi.' \" Beliau menjawab, \"Dia tidak seharusnya bekerja sebagai broker untuknya.\""
  },
  {
    "id": 2190,
    "hadith_number": 2190,
    "tajuk_hadith": "Penolakan Al-'As bin Wail untuk Membayar Hutang dan Ayat yang Diturunkan",
    "perawi_melayu": "Diriwayatkan oleh Khabbab:",
    "english_text": "I was a blacksmith and did some work for Al-`As bin Wail. When he owed me some money for my \nwork, I went to him to ask for that amount. He said, \"I will not pay you unless you disbelieve in \nMuhammad.\" I said, \"By Allah! I will never do that till you die and be resurrected.\" He said, \"Will I \nbe dead and then resurrected after my death?\" I said, \"Yes.\" He said, \"There I will have property and \noffspring and then I will pay you your due.\" Then Allah revealed. 'Have you seen him who \ndisbelieved in Our signs, and yet says: I will be given property and offspring?' (19.77)",
    "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، حَدَّثَنَا خَبَّابٌ، قَالَ كُنْتُ رَجُلاً قَيْنًا فَعَمِلْتُ لِلْعَاصِ بْنِ وَائِلٍ فَاجْتَمَعَ لِي عِنْدَهُ فَأَتَيْتُهُ أَتَقَاضَاهُ فَقَالَ لاَ وَاللَّهِ لاَ أَقْضِيكَ حَتَّى تَكْفُرَ بِمُحَمَّدٍ‏.‏ فَقُلْتُ أَمَا وَاللَّهِ حَتَّى تَمُوتَ ثُمَّ تُبْعَثَ فَلاَ‏.‏ قَالَ وَإِنِّي لَمَيِّتٌ ثُمَّ مَبْعُوثٌ قُلْتُ نَعَمْ‏.‏ قَالَ فَإِنَّهُ سَيَكُونُ لِي ثَمَّ مَالٌ وَوَلَدٌ فَأَقْضِيكَ‏.‏ فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏أَفَرَأَيْتَ الَّذِي كَفَرَ بِآيَاتِنَا وَقَالَ لأُوتَيَنَّ مَالاً وَوَلَدًا‏}‏",
    "malay_translation": "Saya seorang tukang besi dan telah melakukan beberapa pekerjaan untuk Al-'As bin Wail. Ketika dia berhutang wang kepada saya untuk pekerjaan saya, saya pergi kepadanya untuk meminta jumlah tersebut. Dia berkata, \"Saya tidak akan membayar kamu kecuali kamu mengingkari Muhammad.\" Saya berkata, \"Demi Allah! Saya tidak akan pernah melakukan itu sehingga kamu mati dan dibangkitkan.\" Dia berkata, \"Adakah saya akan mati dan kemudian dibangkitkan setelah kematian saya?\" Saya berkata, \"Ya.\" Dia berkata, \"Di sana nanti saya akan memiliki harta dan anak cucu dan kemudian saya akan membayar hutang kamu.\" Kemudian Allah menurunkan ayat. 'Apakah kamu melihat orang yang mengingkari tanda-tanda Kami, dan berkata: Pasti aku akan diberi harta dan anak?' (19:77)"
  },
  {
    "id": 2191,
    "hadith_number": 2191,
    "tajuk_hadith": "Sahabat Merawat Ketua Suku Arab dengan Ruqyah Surah al-Fatihah",
    "perawi_melayu": "Diriwayatkan oleh Abu Sa'id:",
    "english_text": "Some of the companions of the Prophet (ﷺ) went on a journey till they reached some of the 'Arab tribes (at \nnight). They asked the latter to treat them as their guests but they refused. The chief of that tribe was \nthen bitten by a snake (or stung by a scorpion) and they tried their best to cure him but in vain. Some \nof them said (to the others), \"Nothing has benefited him, will you go to the people who resided here at \nnight, it may be that some of them might possess something (as treatment),\" They went to the group of \nthe companions (of the Prophet (ﷺ) ) and said, \"Our chief has been bitten by a snake (or stung by a \nscorpion) and we have tried everything but he has not benefited. Have you got anything (useful)?\" \nOne of them replied, \"Yes, by Allah! I can recite a Ruqya, but as you have refused to accept us as \nyour guests, I will not recite the Ruqya for you unless you fix for us some wages for it.\" They agrees \nto pay them a flock of sheep. One of them then went and recited (Surat-ul-Fatiha): 'All the praises are \nfor the Lord of the Worlds' and puffed over the chief who became all right as if he was released from a \nchain, and got up and started walking, showing no signs of sickness. \nThey paid them what they agreed to pay. Some of them (i.e. the companions) then suggested to divide \ntheir earnings among themselves, but the one who performed the recitation said, \"Do not divide them \ntill we go to the Prophet (ﷺ) and narrate the whole story to him, and wait for his order.\" So, they went to \nAllah's Messenger (ﷺ) and narrated the story. Allah's Messenger (ﷺ) asked, \"How did you come to know that Suratul- \nFatiha was recited as Ruqya?\" Then he added, \"You have done the right thing. Divide (what you \nhave earned) and assign a share for me as well.\" The Prophet (ﷺ) smiled thereupon.",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ أَبِي الْمُتَوَكِّلِ، عَنْ أَبِي سَعِيدٍ ـ رضى الله عنه ـ قَالَ انْطَلَقَ نَفَرٌ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فِي سَفْرَةٍ سَافَرُوهَا حَتَّى نَزَلُوا عَلَى حَىٍّ مِنْ أَحْيَاءِ الْعَرَبِ فَاسْتَضَافُوهُمْ، فَأَبَوْا أَنْ يُضَيِّفُوهُمْ، فَلُدِغَ سَيِّدُ ذَلِكَ الْحَىِّ، فَسَعَوْا لَهُ بِكُلِّ شَىْءٍ لاَ يَنْفَعُهُ شَىْءٌ، فَقَالَ بَعْضُهُمْ لَوْ أَتَيْتُمْ هَؤُلاَءِ الرَّهْطَ الَّذِينَ نَزَلُوا لَعَلَّهُ أَنْ يَكُونَ عِنْدَ بَعْضِهِمْ شَىْءٌ، فَأَتَوْهُمْ، فَقَالُوا يَا أَيُّهَا الرَّهْطُ، إِنَّ سَيِّدَنَا لُدِغَ، وَسَعَيْنَا لَهُ بِكُلِّ شَىْءٍ لاَ يَنْفَعُهُ، فَهَلْ عِنْدَ أَحَدٍ مِنْكُمْ مِنْ شَىْءٍ فَقَالَ بَعْضُهُمْ نَعَمْ وَاللَّهِ إِنِّي لأَرْقِي، وَلَكِنْ وَاللَّهِ لَقَدِ اسْتَضَفْنَاكُمْ فَلَمْ تُضِيِّفُونَا، فَمَا أَنَا بِرَاقٍ لَكُمْ حَتَّى تَجْعَلُوا لَنَا جُعْلاً‏.‏ فَصَالَحُوهُمْ عَلَى قَطِيعٍ مِنَ الْغَنَمِ، فَانْطَلَقَ يَتْفِلُ عَلَيْهِ وَيَقْرَأُ ‏{‏الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ‏}‏ فَكَأَنَّمَا نُشِطَ مِنْ عِقَالٍ، فَانْطَلَقَ يَمْشِي وَمَا بِهِ قَلَبَةٌ، قَالَ فَأَوْفَوْهُمْ جُعْلَهُمُ الَّذِي صَالَحُوهُمْ عَلَيْهِ، فَقَالَ بَعْضُهُمُ اقْسِمُوا‏.‏ فَقَالَ الَّذِي رَقَى لاَ تَفْعَلُوا، حَتَّى نَأْتِيَ النَّبِيَّ صلى الله عليه وسلم فَنَذْكُرَ لَهُ الَّذِي كَانَ، فَنَنْظُرَ مَا يَأْمُرُنَا‏.‏ فَقَدِمُوا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرُوا لَهُ، فَقَالَ ‏\"‏ وَمَا يُدْرِيكَ أَنَّهَا رُقْيَةٌ ـ ثُمَّ قَالَ ـ قَدْ أَصَبْتُمُ اقْسِمُوا وَاضْرِبُوا لِي مَعَكُمْ سَهْمًا ‏\"‏‏.‏ فَضَحِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ وَقَالَ شُعْبَةُ حَدَّثَنَا أَبُو بِشْرٍ سَمِعْتُ أَبَا الْمُتَوَكِّلِ بِهَذَا‏.‏",
    "malay_translation": "Beberapa orang sahabat Nabi (ﷺ) pergi dalam perjalanan sehingga mereka sampai ke beberapa suku Arab (pada waktu malam). Mereka meminta suku Arab tersebut untuk melayan mereka sebagai tetamu tetapi mereka enggan. Ketua suku itu kemudian dipatuk ular (atau disengat kalajengking) dan mereka cuba sedaya upaya untuk menyembuhkannya tetapi sia-sia. Beberapa daripada mereka berkata (kepada yang lain), \"Tiada apa pun yang memberi manfaat kepadanya, mahukah kamu pergi kepada orang yang tinggal di sini pada waktu malam, mungkin ada di antara mereka yang memiliki sesuatu (sebagai rawatan).\" Mereka pergi kepada kumpulan sahabat (Nabi (ﷺ)) dan berkata, \"Ketua kami telah dipatuk ular (atau disengat kalajengking) dan kami telah mencuba segala-galanya tetapi dia tidak mendapat manfaat. Adakah kamu mempunyai sesuatu (yang berguna)?\" Salah seorang daripada mereka menjawab, \"Ya, demi Allah! Saya boleh membaca Ruqyah, tetapi kerana kamu telah enggan menerima kami sebagai tetamu kamu, saya tidak akan membaca Ruqyah untuk kamu kecuali kamu menetapkan upah untuk kami.\" Mereka bersetuju untuk membayar mereka sekumpulan kambing. Salah seorang daripada mereka kemudian pergi dan membaca (Surat al-Fatihah): 'Segala puji bagi Tuhan semesta alam' dan meniup ke atas ketua itu yang menjadi sembuh seolah-olah dia dibebaskan dari rantai, dan bangun dan mula berjalan, tidak menunjukkan tanda-tanda sakit. Mereka membayar mereka apa yang mereka persetujui untuk dibayar. Beberapa daripada mereka (iaitu sahabat) kemudian mencadangkan untuk membahagikan pendapatan mereka di antara mereka sendiri, tetapi orang yang melakukan bacaan itu berkata, \"Jangan membahagikannya sehingga kita pergi kepada Nabi (ﷺ) dan menceritakan keseluruhan kisah kepadanya, dan menunggu perintahnya.\" Maka, mereka pergi kepada Rasulullah (ﷺ) dan menceritakan kisah itu. Rasulullah (ﷺ) bertanya, \"Bagaimana kamu tahu bahawa Surah al-Fatihah dibaca sebagai Ruqyah?\" Kemudian baginda menambah, \"Kamu telah melakukan perkara yang betul. Bahagikan (apa yang kamu telah peroleh) dan tetapkan bahagian untukku juga.\" Nabi (ﷺ) tersenyum selepas itu."
  },
  {
    "id": 2192,
    "hadith_number": 2192,
    "tajuk_hadith": "Ganjaran Nabi (ﷺ) kepada Abu Taiba yang Membekam Baginda dan Syafaat untuk Mengurangkan Cukai",
    "perawi_melayu": "Diriwayatkan oleh Anas bin Malik:",
    "english_text": "When Abu Taiba cupped the Prophet (ﷺ) and the Prophet (ﷺ) ordered that he be paid one or two Sas of \nfoodstuff and he interceded with his masters to reduce his taxes.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ حَجَمَ أَبُو طَيْبَةَ النَّبِيَّ صلى الله عليه وسلم، فَأَمَرَ لَهُ بِصَاعٍ أَوْ صَاعَيْنِ مِنْ طَعَامٍ، وَكَلَّمَ مَوَالِيَهُ فَخَفَّفَ عَنْ غَلَّتِهِ أَوْ ضَرِيبَتِهِ‏.‏",
    "malay_translation": "Ketika Abu Taiba membekam Nabi (ﷺ) dan Nabi (ﷺ) memerintahkan agar dia dibayar satu atau dua *Sa'* makanan dan baginda (ﷺ) memohon kepada tuan-tuannya untuk mengurangkan cukainya."
  },
  {
    "id": 2193,
    "hadith_number": 2193,
    "tajuk_hadith": "Nabi ﷺ Membayar Upah Pembekam",
    "perawi_melayu": "Ibn Abbas",
    "english_text": "When the Prophet (ﷺ) was cupped, he paid the man who cupped him his wages.",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ احْتَجَمَ النَّبِيُّ صلى الله عليه وسلم، وَأَعْطَى الْحَجَّامَ أَجْرَهُ‏.‏",
    "malay_translation": "Apabila Nabi ﷺ dibekam, baginda membayar upah kepada orang yang membekamnya."
  },
  {
    "id": 2194,
    "hadith_number": 2194,
    "tajuk_hadith": "Nabi ﷺ Membayar Upah Tukang Bekam",
    "perawi_melayu": "Diriwayatkan oleh Ibn `Abbas:",
    "english_text": "When the Prophet (ﷺ) was cupped, he paid the man who cupped him his wages. If it had been undesirable \nhe would not have paid him.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ خَالِدٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ احْتَجَمَ النَّبِيُّ صلى الله عليه وسلم وَأَعْطَى الْحَجَّامَ أَجْرَهُ، وَلَوْ عَلِمَ كَرَاهِيَةً لَمْ يُعْطِهِ‏.‏",
    "malay_translation": "Ketika Nabi ﷺ berbekam, baginda membayar upah kepada orang yang membekamnya. Jika perbuatan itu tidak diingini, baginda tidak akan membayarnya."
  },
  {
    "id": 2195,
    "hadith_number": 2195,
    "tajuk_hadith": "Nabi (ﷺ) Berbekam dan Tidak Menahan Upah Pekerja",
    "perawi_melayu": "Diriwayatkan oleh Anas:",
    "english_text": "The Prophet (ﷺ) used to get cupped and would never withhold the wages of any person .",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مِسْعَرٌ، عَنْ عَمْرِو بْنِ عَامِرٍ، قَالَ سَمِعْتُ أَنَسًا ـ رضى الله عنه ـ يَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم يَحْتَجِمُ، وَلَمْ يَكُنْ يَظْلِمُ أَحَدًا أَجْرَهُ‏.‏",
    "malay_translation": "Nabi (ﷺ) biasa berbekam dan tidak pernah menahan upah seseorang pun."
  },
  {
    "id": 2196,
    "hadith_number": 2196,
    "tajuk_hadith": "Nabi (ﷺ) Membayar Upah Bekam dan Mengurangkan Cukai Hamba",
    "perawi_melayu": "Diriwayatkan oleh Anas bin Malik:",
    "english_text": "The Prophet (ﷺ) sent for a slave who had the profession of cupping, and he cupped him. The Prophet (ﷺ) \nordered that he be paid one or two Sas, or one or two Mudds of foodstuff, and appealed to his masters \nto reduce his taxes:",
    "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ دَعَا النَّبِيُّ صلى الله عليه وسلم غُلاَمًا حَجَّامًا فَحَجَمَهُ، وَأَمَرَ لَهُ بِصَاعٍ أَوْ صَاعَيْنِ، أَوْ مُدٍّ أَوْ مُدَّيْنِ، وَكَلَّمَ فِيهِ فَخُفِّفَ مِنْ ضَرِيبَتِهِ‏.‏",
    "malay_translation": "Nabi (ﷺ) telah memanggil seorang hamba yang mempunyai pekerjaan berbekam, dan baginda berbekam kepadanya. Nabi (ﷺ) memerintahkan agar dia dibayar satu atau dua Sa', atau satu atau dua Mudd bahan makanan, dan meminta kepada tuan-tuannya untuk mengurangkan cukainya:"
  },
  {
    "id": 2197,
    "hadith_number": 2197,
    "tajuk_hadith": "Larangan Harga Anjing, Upah Pelacur, dan Bayaran Tukang Ramal",
    "perawi_melayu": "Diriwayatkan oleh Abu Mas'ud Al-Ansari:",
    "english_text": "Allah's Messenger (ﷺ) regarded illegal the price of a dog, the earnings of a prostitute, and the charges taken \nby a soothsayer.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ ثَمَنِ الْكَلْبِ وَمَهْرِ الْبَغِيِّ وَحُلْوَانِ الْكَاهِنِ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) menganggap haram harga anjing, upah pelacur, dan bayaran yang diambil oleh tukang ramal."
  },
  {
    "id": 2198,
    "hadith_number": 2198,
    "tajuk_hadith": "Larangan Pendapatan Hamba Perempuan Melalui Pelacuran",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) prohibited the earnings of slave girls (through prostitution).",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ جُحَادَةَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ كَسْبِ الإِمَاءِ‏.‏",
    "malay_translation": "Nabi (ﷺ) melarang pendapatan hamba perempuan (melalui pelacuran)."
  },
  {
    "id": 2199,
    "hadith_number": 2199,
    "tajuk_hadith": "Larangan Mengambil Upah untuk Pembiakan Haiwan",
    "perawi_melayu": "Diriwayatkan oleh Ibn `Umar:",
    "english_text": "The Prophet (ﷺ) forbade taking a price for animal copulation.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ، وَإِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ عَلِيِّ بْنِ الْحَكَمِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ عَسْبِ الْفَحْلِ‏.‏",
    "malay_translation": "Nabi (ﷺ) melarang mengambil upah untuk pembiakan haiwan."
  },
  {
    "id": 2200,
    "hadith_number": 2200,
    "tajuk_hadith": "Rasulullah ﷺ Memberikan Tanah Khaibar Kepada Yahudi Untuk Diusahakan Dengan Pembahagian Hasil",
    "perawi_melayu": "Diriwayatkan daripada Abdullah bin Umar:",
    "english_text": "\"Allah's Messenger (ﷺ) gave the land of Khaibar to the Jews to work on and cultivate and take half of its \nyield. Ibn `Umar added, \"The land used to be rented for a certain portion (of its yield).\" Nafi` \nmentioned the amount of the portion but I forgot it. Rafi` bin Khadij said, \"The Prophet (ﷺ) forbade \nrenting farms.\" Narrated 'Ubaidullah Nafi` said: Ibn `Umar said: (The contract of Khaibar continued) \ntill `Umar evacuated the Jews (from Khaibar).",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ أَعْطَى رَسُولُ اللَّهِ صلى الله عليه وسلم خَيْبَرَ أَنْ يَعْمَلُوهَا وَيَزْرَعُوهَا وَلَهُمْ شَطْرُ مَا يَخْرُجُ مِنْهَا، وَأَنَّ ابْنَ عُمَرَ حَدَّثَهُ أَنَّ الْمَزَارِعَ كَانَتْ تُكْرَى عَلَى شَىْءٍ سَمَّاهُ نَافِعٌ لاَ أَحْفَظُهُ‏.‏ وَأَنَّ رَافِعَ بْنَ خَدِيجٍ حَدَّثَ أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ كِرَاءِ الْمَزَارِعِ‏.‏ وَقَالَ عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ حَتَّى أَجْلاَهُمْ عُمَرُ‏.‏",
    "malay_translation": "Rasulullah ﷺ memberikan tanah Khaibar kepada orang Yahudi untuk diusahakan dan ditanam serta mengambil separuh daripada hasilnya. Ibn Umar menambah, \"Tanah itu pernah disewakan dengan bahagian tertentu (dari hasilnya).\" Nafi' menyebutkan jumlah bahagian tersebut tetapi saya lupa. Rafi' bin Khadij berkata, \"Nabi ﷺ melarang menyewakan ladang.\" Diriwayatkan oleh 'Ubaidullah Nafi' berkata: Ibn Umar berkata: (Kontrak Khaibar berterusan) sehingga Umar mengusir orang Yahudi (dari Khaibar)."
  }
]