[
  {
    "id": 6464,
    "hadith_number": 6464,
    "tajuk_hadith": "Kafaarah (Penebusan) Kerana Kutu",
    "perawi_melayu": "Riwayat Ka'b bin 'Ujra:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا أَبُو شِهَابٍ، عَنِ ابْنِ عَوْنٍ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ، قَالَ أَتَيْتُهُ يَعْنِي النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ ادْنُ ‏\"‏‏.‏ فَدَنَوْتُ فَقَالَ ‏\"‏ أَيُؤْذِيكَ هَوَامُّكَ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ فِدْيَةٌ مِنْ صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ ‏\"‏‏.‏ وَأَخْبَرَنِي ابْنُ عَوْنٍ عَنْ أَيُّوبَ قَالَ صِيَامُ ثَلاَثَةِ أَيَّامٍ، وَالنُّسُكُ شَاةٌ، وَالْمَسَاكِينُ سِتَّةٌ‏.‏",
    "malay_translation": "Aku datang kepada Nabi SAW, Baginda bersabda, \"Dekatilah.\" Maka aku mendekatinya, lalu Baginda bertanya, \"Adakah kutu-kutu mengganggumu?\" Jawabku, \"Ya.\" Baginda bersabda, \"(Cukurlah rambutmu dan) lakukan kafaarah dengan berpuasa, bersedekah, atau berkorban.\" (Perawi sub) Ayyub berkata, \"Puasa tiga hari, korban seekor kambing biri-biri, dan sedekah kepada enam orang miskin.\" "
  },
  {
    "id": 6465,
    "hadith_number": 6465,
    "tajuk_hadith": "Kafaarah Hubungan Seksual Ketika Berpuasa",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، قَالَ سَمِعْتُهُ مِنْ، فِيهِ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ هَلَكْتُ‏.‏ قَالَ ‏\"‏ مَا شَأْنُكَ ‏\"‏‏.‏ قَالَ وَقَعْتُ عَلَى امْرَأَتِي فِي رَمَضَانَ‏.‏ قَالَ ‏\"‏ تَسْتَطِيعُ تُعْتِقُ رَقَبَةً ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ فَهَلْ تَسْتَطِيعُ أَنْ تَصُومَ شَهْرَيْنِ مُتَتَابِعَيْنِ ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ فَهَلْ تَسْتَطِيعُ أَنْ تُطْعِمَ سِتِّينَ مِسْكِينًا ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ اجْلِسْ ‏\"‏‏.‏ فَجَلَسَ فَأُتِيَ النَّبِيُّ صلى الله عليه وسلم بِعَرَقٍ فِيهِ تَمْرٌ ـ وَالْعَرَقُ الْمِكْتَلُ الضَّخْمُ ـ قَالَ ‏\"‏ خُذْ هَذَا، فَتَصَدَّقْ بِهِ ‏\"‏‏.‏ قَالَ أَعَلَى أَفْقَرَ مِنَّا، فَضَحِكَ النَّبِيُّ صلى الله عليه وسلم حَتَّى بَدَتْ نَوَاجِذُهُ قَالَ ‏\"‏ أَطْعِمْهُ عِيَالَكَ ‏\"‏‏.‏",
    "malay_translation": "Daripada Ali bin Abdullah, daripada Sufyan, daripada Zuhri, katanya: Aku mendengarnya daripada… di dalamnya daripada Humaid bin Abdur Rahman, daripada Abu Hurairah, katanya:  Seorang lelaki datang kepada Nabi SAW lalu berkata: “Aku telah binasa!”  Nabi SAW bertanya: “Apakah masalahmu?” Lelaki itu menjawab: “Aku telah melakukan hubungan seks dengan isteriku di bulan Ramadan.” Nabi SAW bertanya: “Adakah engkau mampu membebaskan seorang hamba?” Lelaki itu menjawab: “Tidak.” Nabi SAW bertanya: “Bolehkah engkau berpuasa selama dua bulan berturut-turut?” Lelaki itu menjawab: “Tidak.” Nabi SAW bertanya: “Bolehkah engkau memberi makan kepada enam puluh orang miskin?” Lelaki itu menjawab: “Tidak.” Nabi SAW bersabda: “Duduklah.” Lelaki itu pun duduk. Kemudian Nabi SAW diberi sebakul besar tamar. Nabi SAW bersabda: “Ambillah ini dan sedekahkanlah.” Lelaki itu bertanya: “Kepada orang yang lebih miskin daripada kami?”  Maka Nabi SAW tersenyum sehingga kelihatan gigi gerahamnya, lalu bersabda: “Berikanlah kepada keluargamu.”"
  },
  {
    "id": 6466,
    "hadith_number": 6466,
    "tajuk_hadith": "Kafaarah Hubungan Seksual Ketika Berpuasa",
    "perawi_melayu": "Riwayat Abu Hurairah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مَحْبُوبٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ هَلَكْتُ‏.‏ فَقَالَ ‏\"‏ وَمَا ذَاكَ ‏\"‏‏.‏ قَالَ وَقَعْتُ بِأَهْلِي فِي رَمَضَانَ‏.‏ قَالَ ‏\"‏ تَجِدُ رَقَبَةً ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ هَلْ تَسْتَطِيعُ أَنْ تَصُومَ شَهْرَيْنِ مُتَتَابِعَيْنِ ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ فَتَسْتَطِيعُ أَنْ تُطْعِمَ سِتِّينَ مِسْكِينًا ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ فَجَاءَ رَجُلٌ مِنَ الأَنْصَارِ بِعَرَقٍ ـ وَالْعَرَقُ الْمِكْتَلُ فِيهِ تَمْرٌ ـ فَقَالَ ‏\"‏ اذْهَبْ بِهَذَا، فَتَصَدَّقْ بِهِ ‏\"‏‏.‏ قَالَ عَلَى أَحْوَجَ مِنَّا يَا رَسُولَ اللَّهِ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا بَيْنَ لاَبَتَيْهَا أَهْلُ بَيْتٍ أَحْوَجُ مِنَّا‏.‏ ثُمَّ قَالَ ‏\"‏ اذْهَبْ، فَأَطْعِمْهُ أَهْلَكَ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Mahbub, telah menceritakan kepada kami Abdul Wahid, telah menceritakan kepada kami Ma'mar, dari Az Zuhri, dari Humaid bin Abdul Rahman, dari Abu Hurairah r.a., bahawa beliau berkata: Seorang lelaki datang kepada Rasulullah SAW lalu berkata, \"Saya telah binasa!\"  Rasulullah SAW bertanya, \"Apakah itu?\" Lelaki itu menjawab, \"Saya telah melakukan hubungan seks dengan isteri saya di bulan Ramadhan.\" Rasulullah SAW bertanya, \"Adakah engkau mampu membebaskan seorang hamba?\" Lelaki itu menjawab, \"Tidak.\" Rasulullah SAW bertanya lagi, \"Adakah engkau mampu berpuasa dua bulan berturut-turut?\" Lelaki itu menjawab, \"Tidak.\" Rasulullah SAW bertanya lagi, \"Adakah engkau mampu memberi makan kepada enam puluh orang miskin?\" Lelaki itu menjawab, \"Tidak.\" Kemudian datang seorang lelaki Ansar membawa sebuah 'irq (bakul besar berisi tamar). Rasulullah SAW bersabda, \"Ambillah ini dan sedekahkanlah.\" Lelaki itu berkata, \"Kepada orang yang lebih susah daripada kami wahai Rasulullah? Demi Allah yang telah mengutusmu dengan kebenaran, tidak ada rumah di antara dua gunung (Madinah) yang lebih susah daripada kami.\" Maka Rasulullah SAW bersabda, \"Pergilah, dan berikanlah kepada keluargamu.\""
  },
  {
    "id": 6467,
    "hadith_number": 6467,
    "tajuk_hadith": "Kafarah Hubungan Intim Ketika Berpuasa",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ حُمَيْدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ هَلَكْتُ‏.‏ قَالَ ‏\"‏ وَمَا شَأْنُكَ ‏\"‏‏.‏ قَالَ وَقَعْتُ عَلَى امْرَأَتِي فِي رَمَضَانَ‏.‏ قَالَ ‏\"‏ هَلْ تَجِدُ مَا تُعْتِقُ رَقَبَةً ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ فَهَلْ تَسْتَطِيعُ أَنْ تَصُومَ شَهْرَيْنِ مُتَتَابِعَيْنِ ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ فَهَلْ تَسْتَطِيعُ أَنْ تُطْعِمَ سِتِّينَ مِسْكِينًا ‏\"‏‏.‏ قَالَ لاَ أَجِدُ‏.‏ فَأُتِيَ النَّبِيُّ صلى الله عليه وسلم بِعَرَقٍ فِيهِ تَمْرٌ فَقَالَ ‏\"‏ خُذْ هَذَا فَتَصَدَّقْ بِهِ ‏\"‏‏.‏ فَقَالَ أَعَلَى أَفْقَرَ مِنَّا مَا بَيْنَ لاَبَتَيْهَا أَفْقَرُ مِنَّا‏.‏ ثُمَّ قَالَ ‏\"‏ خُذْهُ فَأَطْعِمْهُ أَهْلَكَ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Maslamah, telah menceritakan kepada kami Sufyan, dari az- Zuhri, dari Humaid, dari Abu Hurairah, dia berkata;  Seorang lelaki datang kepada Nabi SAW lalu berkata, \"Aku telah binasa!\"  Nabi SAW bersabda, \"Apakah masalahmu?\"  Dia berkata, \"Aku telah melakukan hubungan intim dengan isteriku di bulan Ramadhan.\"  Nabi SAW bersabda kepadanya, \"Adakah engkau mampu untuk memerdekakan seorang hamba?\" Dia berkata, \"Tidak.\"  Nabi SAW bersabda, \"Maka adakah engkau mampu berpuasa selama dua bulan berturut-turut?\" Dia berkata, \"Tidak.\"  Nabi SAW bersabda, \"Maka adakah engkau mampu memberi makan enam puluh orang miskin?\"  Dia berkata, \"Aku tidak mampu.\"  Kemudian Nabi SAW diberikan sebakul kurma, lalu Nabi SAW bersabda, \"Ambillah ini dan sedekahkanlah.\"  Dia berkata, \"Adakah yang lebih miskin daripada kami?  Sesungguhnya tiada seorang pun di antara dua gunung ini (Madinah) yang lebih miskin daripada kami.\"  Kemudian Nabi SAW bersabda, \"Ambillah dan berikanlah kepada keluargamu.\" "
  },
  {
    "id": 6468,
    "hadith_number": 6468,
    "tajuk_hadith": "Ukuran Sa' pada Zaman Nabi SAW dan Umar bin Abdul Aziz",
    "perawi_melayu": "Riwayat Al-Ju'aid bin `Abdur-Rahman:",
    "english_text": "As-Sa'ib bin Yazid said, \"The Sa' at the time of the Prophet (ﷺ) was equal to one Mudd plus one-third of a \nMudd of your time, and then it was increased in the time of Caliph `Umar bin `Abdul `Aziz.\"",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْقَاسِمُ بْنُ مَالِكٍ الْمُزَنِيُّ، حَدَّثَنَا الْجُعَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، عَنِ السَّائِبِ بْنِ يَزِيدَ، قَالَ كَانَ الصَّاعُ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم مُدًّا وَثُلُثًا بِمُدِّكُمُ الْيَوْمَ فَزِيدَ فِيهِ فِي زَمَنِ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ‏.‏",
    "malay_translation": "Sa'ib bin Yazid berkata, \"Ukuran sa' pada zaman Nabi SAW adalah bersamaan dengan satu mud ditambah satu pertiga mud mengikut ukuran kamu pada hari ini. Kemudian ia ditambah pada zaman Khalifah Umar bin Abdul Aziz.\""
  },
  {
    "id": 6469,
    "hadith_number": 6469,
    "tajuk_hadith": "Zakat Fitrah dan Kafarah Sumpah Mengikut Sukatan Nabi",
    "perawi_melayu": "Daripada Nafi’:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُنْذِرُ بْنُ الْوَلِيدِ الْجَارُودِيُّ، حَدَّثَنَا أَبُو قُتَيْبَةَ ـ وَهْوَ سَلْمٌ ـ حَدَّثَنَا مَالِكٌ، عَنْ نَافِعٍ، قَالَ كَانَ ابْنُ عُمَرَ يُعْطِي زَكَاةَ رَمَضَانَ بِمُدِّ النَّبِيِّ صلى الله عليه وسلم الْمُدِّ الأَوَّلِ، وَفِي كَفَّارَةِ الْيَمِينِ بِمُدِّ النَّبِيِّ صلى الله عليه وسلم‏.‏ قَالَ أَبُو قُتَيْبَةَ قَالَ لَنَا مَالِكٌ مُدُّنَا أَعْظَمُ مِنْ مُدِّكُمْ وَلاَ نَرَى الْفَضْلَ إِلاَّ فِي مُدِّ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ لِي مَالِكٌ لَوْ جَاءَكُمْ أَمِيرٌ فَضَرَبَ مُدًّا أَصْغَرَ مِنْ مُدِّ النَّبِيِّ صلى الله عليه وسلم بِأَىِّ شَىْءٍ كُنْتُمْ تُعْطُونَ قُلْتُ كُنَّا نُعْطِي بِمُدِّ النَّبِيِّ صلى الله عليه وسلم قَالَ أَفَلاَ تَرَى أَنَّ الأَمْرَ إِنَّمَا يَعُودُ إِلَى مُدِّ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Munzir bin Walid Al-Jarudi, telah menceritakan kepada kami Abu Qutaibah - iaitu Salm - telah menceritakan kepada kami Malik, daripada Nafi’, katanya: Ibn Umar memberi zakat Ramadan mengikut mud Nabi SAW, mud yang pertama, dan juga memberi kafarah sumpah mengikut mud Nabi SAW. Abu Qutaibah berkata: Malik berkata kepada kami, \"Sukatan mud kami lebih banyak daripada sukatan mud kamu, dan kami tidak melihat kelebihan kecuali pada mud Nabi SAW.\" Dan Malik berkata kepadaku: \"Sekiranya seorang pemerintah datang kepada kamu dan menetapkan sukatan mud yang lebih kecil daripada mud Nabi SAW, dengan sukatan apakah kamu akan memberi (untuk kafarah atau zakat fitrah)?\" Aku menjawab: \"Kami akan memberi mengikut mud Nabi SAW.\"  Malik berkata: \"Maka, tidakkah kamu nampak bahawa perkara ini akhirnya kembali kepada mud Nabi SAW?\""
  },
  {
    "id": 6470,
    "hadith_number": 6470,
    "tajuk_hadith": "Doa Rasulullah SAW untuk Ukuran Timbangan Orang Madinah",
    "perawi_melayu": "Anas bin Malik meriwayatkan:",
    "english_text": "Allah's Messenger (ﷺ) said, \"O Allah! Bestow Your Blessings on their measures, Sa' and Mudd (i.e., of the \npeople of Medina).",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ اللَّهُمَّ بَارِكْ لَهُمْ فِي مِكْيَالِهِمْ وَصَاعِهِمْ وَمُدِّهِمْ ‏\"‏‏.‏",
    "malay_translation": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda: \"Ya Allah, berkatilah mereka dalam ukuran sukatan mereka (Sa’ dan Mud)."
  },
  {
    "id": 6471,
    "hadith_number": 6471,
    "tajuk_hadith": "Kebebasan Hamba Membebaskan Diri dari Api Neraka",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \"If somebody manumits a Muslim slave, Allah will save from the Fire every part of \nhis body for freeing the corresponding parts of the slave's body, even his private parts will be saved \nfrom the Fire) because of freeing the slave's private parts.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنْ أَبِي غَسَّانَ، مُحَمَّدِ بْنِ مُطَرِّفٍ عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، عَنْ سَعِيدٍ ابْنِ مَرْجَانَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ أَعْتَقَ رَقَبَةً مُسْلِمَةً، أَعْتَقَ اللَّهُ بِكُلِّ عُضْوٍ مِنْهُ عُضْوًا مِنَ النَّارِ، حَتَّى فَرْجَهُ بِفَرْجِهِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Barangsiapa yang memerdekakan seorang hamba sahaya Muslim, maka Allah akan menyelamatkan setiap anggota badannya daripada api neraka,  sepadan dengan setiap anggota badan hamba sahaya yang dibebaskannya; bahkan kemaluannya akan diselamatkan daripada api neraka kerana membebaskan kemaluan hamba sahayanya.\""
  },
  {
    "id": 6472,
    "hadith_number": 6472,
    "tajuk_hadith": "Nabi SAW Membeli Seorang Hamba",
    "perawi_melayu": "Daripada Amr",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ، أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرٍو، عَنْ جَابِرٍ، أَنَّ رَجُلاً، مِنَ الأَنْصَارِ دَبَّرَ مَمْلُوكًا لَهُ، وَلَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُ فَبَلَغَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ مَنْ يَشْتَرِيهِ مِنِّي ‏\"‏‏.‏ فَاشْتَرَاهُ نُعَيْمُ بْنُ النَّحَّامِ بِثَمَانِمِائَةِ دِرْهَمٍ، فَسَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ عَبْدًا قِبْطِيًّا مَاتَ عَامَ أَوَّلَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'man, telah memberitakan kepada kami Hammad bin Zaid, daripada Amr, daripada Jabir, bahawa seorang lelaki dari kalangan Ansar telah menjadikan hambanya sebagai Mudabbar (orang yang diamanahkan), dan dia tidak mempunyai harta lain selain hambanya itu.  Maka sampai berita ini kepada Nabi SAW, lalu Baginda bersabda, \"Siapakah yang ingin membelinya daripada Aku?\"  Maka Nu'aim bin An-Nahham membelinya dengan harga lapan ratus dirham. Aku mendengar Jabir bin Abdullah berkata, \"Hamba itu seorang hamba Qibti yang meninggal dunia pada tahun pertama.\" "
  },
  {
    "id": 6473,
    "hadith_number": 6473,
    "tajuk_hadith": "Pemilikan Hamba dan Wala'",
    "perawi_melayu": "Riwayat Aisyah:",
    "english_text": "that she intended to buy Barira (a slave girl) and her masters stipulated that they would have her \nWala'. When `Aisha mentioned that to the Prophet (ﷺ) ; he said, \"Buy her, for the Wala' is for the one who \nmanumits.\"",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، أَنَّهَا أَرَادَتْ أَنْ تَشْتَرِيَ، بَرِيرَةَ فَاشْتَرَطُوا عَلَيْهَا الْوَلاَءَ، فَذَكَرَتْ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ اشْتَرِيهَا إِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏",
    "malay_translation": "Aisyah r.a. bercerita bahawa beliau ingin membeli Barirah (seorang hamba perempuan), dan tuan-tuan Barirah mensyaratkan bahawa mereka akan memiliki wala' (hak untuk memilih) ke atasnya.  Apabila Aisyah menceritakan hal itu kepada Nabi SAW, Baginda bersabda:  \"Belilah dia, kerana wala' itu adalah hak bagi orang yang memerdekakannya.\""
  },
  {
    "id": 6474,
    "hadith_number": 6474,
    "tajuk_hadith": "Allah SWT Pemberi Rezeki, Bukan Janji Manusia",
    "perawi_melayu": "Riwayat Abu Musa Al-Ash'ari:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَمَّادٌ، عَنْ غَيْلاَنَ بْنِ جَرِيرٍ، عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، قَالَ أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي رَهْطٍ مِنَ الأَشْعَرِيِّينَ أَسْتَحْمِلُهُ فَقَالَ ‏\"‏ وَاللَّهِ لاَ أَحْمِلُكُمْ، مَا عِنْدِي مَا أَحْمِلُكُمْ ‏\"‏‏.‏ ثُمَّ لَبِثْنَا مَا شَاءَ اللَّهُ، فَأُتِيَ بِإِبِلٍ فَأَمَرَ لَنَا بِثَلاَثَةِ ذَوْدٍ، فَلَمَّا انْطَلَقْنَا قَالَ بَعْضُنَا لِبَعْضٍ لاَ يُبَارِكُ اللَّهُ لَنَا، أَتَيْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم نَسْتَحْمِلُهُ فَحَلَفَ أَنْ لاَ يَحْمِلَنَا فَحَمَلَنَا‏.‏ فَقَالَ أَبُو مُوسَى فَأَتَيْنَا النَّبِيَّ صلى الله عليه وسلم فَذَكَرْنَا ذَلِكَ لَهُ فَقَالَ ‏\"‏ مَا أَنَا حَمَلْتُكُمْ بَلِ اللَّهُ حَمَلَكُمْ، إِنِّي وَاللَّهِ إِنْ شَاءَ اللَّهُ لاَ أَحْلِفُ عَلَى يَمِينٍ فَأَرَى غَيْرَهَا خَيْرًا مِنْهَا، إِلاَّ كَفَّرْتُ عَنْ يَمِينِي، وَأَتَيْتُ الَّذِي هُوَ خَيْرٌ وَكَفَّرْتُ ‏\"‏‏.‏",
    "malay_translation": "Kami telah datang kepada Rasulullah SAW bersama sekumpulan orang dari kabilah Asy'ari untuk meminta kenderaan. Baginda SAW bersabda, \"Demi Allah, Aku tidak akan memberikan kamu kenderaan, kerana Aku tidak mempunyai apa-apa untuk memberimu kenderaan.\"  Kemudian kami menunggu seketika mengikut kehendak Allah SWT, lalu beberapa ekor unta dihantar kepada Nabi SAW, dan Baginda memerintahkan agar kami diberi tiga ekor unta. Setelah kami berangkat, sebahagian daripada kami berkata kepada yang lain, \"Allah SWT tidak akan memberkati kami, kerana kami semua telah datang kepada Rasulullah SAW meminta kenderaan, dan walaupun Baginda telah bersumpah bahawa Baginda tidak akan memberi kami kenderaan, Baginda telah memberi kami.\" Maka kami kembali kepada Nabi SAW dan memberitahu Baginda hal tersebut. Baginda bersabda, \"Bukan Aku yang memberi kamu kenderaan, tetapi Allah SWT yang memberi. Demi Allah, jika Aku bersumpah dan kemudian Aku dapati perkara lain lebih baik, nescaya Aku akan menebus sumpahku, dan Aku akan melakukan apa yang lebih baik dan menebus sumpahku.\""
  },
  {
    "id": 6475,
    "hadith_number": 6475,
    "tajuk_hadith": "Kafaarah Sumpah",
    "perawi_melayu": "Riwayat Hammad:",
    "english_text": "the same narration above (i.e. 709), \"I make expiation for my dissolved oath, and I do what is better, or do what is better and make expiation.\"",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادٌ، وَقَالَ، ‏\"‏ إِلاَّ كَفَّرْتُ يَمِينِي، وَأَتَيْتُ الَّذِي هُوَ خَيْرٌ ‏\"‏‏.‏ أَوْ ‏\"‏ أَتَيْتُ الَّذِي هُوَ خَيْرٌ، وَكَفَّرْتُ ‏\"‏‏.‏",
    "malay_translation": "Hadis ini sama seperti hadis sebelumnya (iaitu 709),  \"Aku menebus sumpahku yang telah batal, dan aku melakukan apa yang lebih baik,\" atau \"Aku melakukan apa yang lebih baik, dan aku menebus sumpahku.\""
  },
  {
    "id": 6476,
    "hadith_number": 6476,
    "tajuk_hadith": "Doa Nabi Sulaiman dan Kesannya",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامِ بْنِ حُجَيْرٍ، عَنْ طَاوُسٍ، سَمِعَ أَبَا هُرَيْرَةَ، قَالَ قَالَ سُلَيْمَانُ لأَطُوفَنَّ اللَّيْلَةَ عَلَى تِسْعِينَ امْرَأَةً، كُلٌّ تَلِدُ غُلاَمًا يُقَاتِلُ فِي سَبِيلِ اللَّهِ‏.‏ فَقَالَ لَهُ صَاحِبُهُ ـ قَالَ سُفْيَانُ يَعْنِي الْمَلَكَ ـ قُلْ إِنْ شَاءَ اللَّهُ‏.‏ فَنَسِيَ، فَطَافَ بِهِنَّ، فَلَمْ تَأْتِ امْرَأَةٌ مِنْهُنَّ بِوَلَدٍ، إِلاَّ وَاحِدَةٌ بِشِقِّ غُلاَمٍ‏.‏ فَقَالَ أَبُو هُرَيْرَةَ يَرْوِيهِ قَالَ ‏\"‏ لَوْ قَالَ إِنْ شَاءَ اللَّهُ، لَمْ يَحْنَثْ وَكَانَ دَرَكًا فِي حَاجَتِهِ ‏\"‏‏.‏ وَقَالَ مَرَّةً قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوِ اسْتَثْنَى ‏\"‏‏.‏ وَحَدَّثَنَا أَبُو الزِّنَادِ عَنِ الأَعْرَجِ مِثْلَ حَدِيثِ أَبِي هُرَيْرَةَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ali bin Abdullah, telah menceritakan kepada kami Sufyan, dari Hisyam bin Hujeir, dari Tawus, telah mendengar Abu Hurairah berkata, bahawa Nabi Sulaiman berkata, \"Malam ini aku akan mendatangi sembilan puluh isteri, setiap seorang akan melahirkan anak lelaki yang akan berjuang di jalan Allah.\" Maka sahabatnya – kata Sufyan, maksudnya malaikat – berkata kepadanya, \"Katakanlah, 'Jika Allah berkehendak.'\" Maka Nabi Sulaiman lupa, lalu beliau mendatangi mereka, maka tiada seorang pun isterinya yang melahirkan anak, kecuali seorang yang melahirkan separuh anak lelaki.  Abu Hurairah meriwayatkan bahawa Nabi SAW bersabda, \"Sekiranya dia berkata, 'Jika Allah berkehendak,' nescaya dia tidak akan gagal dan akan mencapai apa yang diinginkannya.\" Dan beliau berkata sekali lagi, bahawa Rasulullah SAW bersabda, \"Sekiranya dia membuat pengecualian.\" Dan telah menceritakan kepada kami Abu Az-Zinad dari Al-A'raj seperti hadis Abu Hurairah."
  },
  {
    "id": 6477,
    "hadith_number": 6477,
    "tajuk_hadith": "Kebolehan Menggantikan Sumpah dengan Perkara yang Lebih Baik",
    "perawi_melayu": "Riwayat Zahdam al-Jarmi:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ أَيُّوبَ، عَنِ الْقَاسِمِ التَّمِيمِيِّ، عَنْ زَهْدَمٍ الْجَرْمِيِّ، قَالَ كُنَّا عِنْدَ أَبِي مُوسَى وَكَانَ بَيْنَنَا وَبَيْنَ هَذَا الْحَىِّ مِنْ جَرْمٍ إِخَاءٌ وَمَعْرُوفٌ ـ قَالَ ـ فَقُدِّمَ طَعَامٌ ـ قَالَ ـ وَقُدِّمَ فِي طَعَامِهِ لَحْمُ دَجَاجٍ ـ قَالَ ـ وَفِي الْقَوْمِ رَجُلٌ مِنْ بَنِي تَيْمِ اللَّهِ أَحْمَرُ كَأَنَّهُ مَوْلًى ـ قَالَ ـ فَلَمْ يَدْنُ فَقَالَ لَهُ أَبُو مُوسَى ادْنُ، فَإِنِّي قَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْكُلُ مِنْهُ‏.‏ قَالَ إِنِّي رَأَيْتُهُ يَأْكُلُ شَيْئًا قَذِرْتُهُ، فَحَلَفْتُ أَنْ لاَ أَطْعَمَهُ أَبَدًا‏.‏ فَقَالَ ادْنُ أُخْبِرْكَ عَنْ ذَلِكَ، أَتَيْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم فِي رَهْطٍ مِنَ الأَشْعَرِيِّينَ أَسْتَحْمِلُهُ، وَهْوَ يُقْسِمُ نَعَمًا مِنْ نَعَمِ الصَّدَقَةِ ـ قَالَ أَيُّوبُ أَحْسِبُهُ قَالَ وَهْوَ غَضْبَانُ ـ قَالَ ‏\"‏ وَاللَّهِ لاَ أَحْمِلُكُمْ، وَمَا عِنْدِي مَا أَحْمِلُكُمْ ‏\"‏‏.‏ قَالَ فَانْطَلَقْنَا فَأُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِنَهْبِ إِبِلٍ، فَقِيلَ أَيْنَ هَؤُلاَءِ الأَشْعَرِيُّونَ فَأَتَيْنَا فَأَمَرَ لَنَا بِخَمْسِ ذَوْدٍ غُرِّ الذُّرَى، قَالَ فَانْدَفَعْنَا فَقُلْتُ لأَصْحَابِي أَتَيْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم نَسْتَحْمِلُهُ، فَحَلَفَ أَنْ لاَ يَحْمِلَنَا، ثُمَّ أَرْسَلَ إِلَيْنَا فَحَمَلَنَا، نَسِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَمِينَهُ، وَاللَّهِ لَئِنْ تَغَفَّلْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم يَمِينَهُ لاَ نُفْلِحُ أَبَدًا، ارْجِعُوا بِنَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَلْنُذَكِّرْهُ يَمِينَهُ‏.‏ فَرَجَعْنَا فَقُلْنَا يَا رَسُولَ اللَّهِ أَتَيْنَاكَ نَسْتَحْمِلُكَ، فَحَلَفْتَ أَنْ لاَ تَحْمِلَنَا ثُمَّ حَمَلْتَنَا فَظَنَنَّا ـ أَوْ فَعَرَفْنَا ـ أَنَّكَ نَسِيتَ يَمِينَكَ‏.‏ قَالَ ‏\"‏ انْطَلِقُوا، فَإِنَّمَا حَمَلَكُمُ اللَّهُ، إِنِّي وَاللَّهِ إِنْ شَاءَ اللَّهُ لاَ أَحْلِفُ عَلَى يَمِينٍ، فَأَرَى غَيْرَهَا خَيْرًا مِنْهَا، إِلاَّ أَتَيْتُ الَّذِي هُوَ خَيْرٌ وَتَحَلَّلْتُهَا ‏\"‏‏.‏\nتَابَعَهُ حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ أَبِي قِلاَبَةَ وَالْقَاسِمِ بْنِ عَاصِمٍ الْكُلَيْبِيِّ‏.‏ حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، وَالْقَاسِمِ التَّمِيمِيِّ عَنْ زَهْدَمٍ، بِهَذَا‏.‏ حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ، عَنِ الْقَاسِمِ، عَنْ زَهْدَمٍ، بِهَذَا‏.‏",
    "malay_translation": "Kami berada di sisi Abu Musa Al-Ash'ari.  Terdapat ikatan persahabatan dan kebaikan di antara kami dan kabilahnya.  Makanan dihidangkan kepadanya, dan di dalamnya ada daging ayam.  Di kalangan orang yang hadir, ada seorang lelaki dari Bani Taim Allah yang berkulit merah seakan-akan seorang hamba sahaya yang dimerdekakan. Lelaki itu tidak mendekati makanan. Abu Musa berkata kepadanya, “Mendekatlah! Sesungguhnya aku telah melihat Rasulullah SAW makan (daging ayam ini).” Lelaki itu berkata, “Aku telah melihatnya (ayam) memakan sesuatu yang aku anggap najis, lalu aku bersumpah bahawa aku tidak akan memakannya lagi.” Abu Musa berkata, “Mendekatlah! Aku akan beritahu engkau tentang hal itu (sumpahmu).  Suatu ketika, kami pergi kepada Rasulullah SAW bersama sekumpulan orang Ash’ari untuk meminta kenderaan tunggangan ketika baginda sedang mengagihkan unta zakat. (Aiyub berkata, “Aku rasa baginda sedang marah pada waktu itu.”) Nabi SAW bersabda, “Demi Allah, aku tidak akan memberikan kamu kenderaan tunggangan, dan aku tidak mempunyai apa-apa untuk ditunggangi kamu.”  Setelah kami pergi, beberapa unta rampasan dibawa kepada Rasulullah SAW, lalu baginda bertanya, “Di manakah orang-orang Ash’ari itu? Di manakah orang-orang Ash’ari itu?”  Maka kami pun pergi (kepada baginda) dan baginda memberikan kami lima ekor unta yang gemuk dan cantik.  Kami pun menunggangnya dan pergi. Kemudian aku berkata kepada sahabat-sahabatku, “Kami pergi kepada Rasulullah SAW untuk meminta kenderaan, tetapi baginda bersumpah bahawa baginda tidak akan memberikannya kepada kami. Kemudian, baginda memanggil kami dan memberikan kenderaan kepada kami. Mungkin Rasulullah SAW telah lupa akan sumpah baginda. Demi Allah, kami tidak akan berjaya jika kami mengambil kesempatan daripada Rasulullah SAW yang lupa akan sumpah baginda. Oleh itu, marilah kita kembali kepada Rasulullah SAW untuk mengingatkan baginda tentang sumpahnya.”  Kami pun kembali dan berkata, “Wahai Rasulullah SAW! Kami datang kepada tuan dan meminta kenderaan tunggangan, tetapi tuan bersumpah bahawa tuan tidak akan memberikannya kepada kami, kemudian tuan memberikannya kepada kami, lalu kami menyangka – atau kami tahu – bahawa tuan telah lupa sumpah tuan.” Nabi SAW bersabda, “Pergilah, kerana Allah telah memberikan kamu kenderaan tunggangan. Demi Allah, jika aku bersumpah kemudian aku dapati sesuatu yang lebih baik daripadanya, nescaya aku akan mengambil yang lebih baik dan bertaubat daripada sumpahku.”"
  },
  {
    "id": 6478,
    "hadith_number": 6478,
    "tajuk_hadith": "Jangan Meminta Jawatan Pemerintahan",
    "perawi_melayu": "Riwayat Abdur-Rahman bin Samura:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ بْنِ فَارِسٍ، أَخْبَرَنَا ابْنُ عَوْنٍ، عَنِ الْحَسَنِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَسْأَلِ الإِمَارَةَ، فَإِنَّكَ إِنْ أُعْطِيتَهَا عَنْ غَيْرِ مَسْأَلَةٍ أُعِنْتَ عَلَيْهَا، وَإِنْ أُعْطِيتَهَا عَنْ مَسْأَلَةٍ وُكِلْتَ إِلَيْهَا، وَإِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا، فَأْتِ الَّذِي هُوَ خَيْرٌ، وَكَفِّرْ عَنْ يَمِينِكَ ‏\"‏‏.‏ تَابَعَهُ أَشْهَلُ عَنِ ابْنِ عَوْنٍ‏.‏ وَتَابَعَهُ يُونُسُ وَسِمَاكُ بْنُ عَطِيَّةَ وَسِمَاكُ بْنُ حَرْبٍ وَحُمَيْدٌ وَقَتَادَةُ وَمَنْصُورٌ وَهِشَامٌ وَالرَّبِيعُ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Muhammad bin Abdullah, telah menceritakan kepada kami Usman bin Umar bin Faris, telah memberitakan kepada kami Ibnu Awn, dari Al-Hasan, dari Abdur-Rahman bin Samurah, dia berkata, Rasulullah SAW bersabda:\n\n\"Janganlah kamu meminta jawatan pemerintahan, kerana sesungguhnya jika engkau diberi jawatan itu tanpa meminta, nescaya engkau akan dibantu padanya, dan jika engkau diberi jawatan itu kerana meminta, maka engkau akan dibebankan tanggungjawab padanya (iaitu Allah SWT tidak akan membantumu). Dan jika engkau telah bersumpah atas sesuatu sumpah, kemudian engkau melihat sesuatu yang lebih baik daripadanya, maka lakukanlah apa yang lebih baik dan tebuslah sumpahmu.\""
  }
]
