[
  {
    "id": 5427,
    "hadith_number": 5427,
    "tajuk_hadith": "Bala Sebagai Penebus Dosa",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "(the wife of the Prophet) Allah's Messenger (ﷺ) said, \"No calamity befalls a Muslim but that Allah expiates \nsome of his sins because of it, even though it were the prick he receives from a thorn.\"",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ الْحَكَمُ بْنُ نَافِعٍ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا مِنْ مُصِيبَةٍ تُصِيبُ الْمُسْلِمَ إِلاَّ كَفَّرَ اللَّهُ بِهَا عَنْهُ، حَتَّى الشَّوْكَةِ يُشَاكُهَا ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: “Tiada satu pun musibah yang menimpa seorang Muslim melainkan Allah akan menghapuskan sebahagian dosanya dengan sebab musibah itu, walaupun hanya disebabkan duri yang menusuknya.”"
  },
  {
    "id": 5428,
    "hadith_number": 5428,
    "tajuk_hadith": "Penghapusan Dosa melalui Musibah",
    "perawi_melayu": "Daripada Abu Said Al-Khudri dan Abu Hurairah",
    "english_text": "The Prophet (ﷺ) said, \"No fatigue, nor disease, nor sorrow, nor sadness, nor hurt, nor distress befalls a \nMuslim, even if it were the prick he receives from a thorn, but that Allah expiates some of his sins for \nthat.\"",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو، حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، وَعَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا يُصِيبُ الْمُسْلِمَ مِنْ نَصَبٍ وَلاَ وَصَبٍ وَلاَ هَمٍّ وَلاَ حُزْنٍ وَلاَ أَذًى وَلاَ غَمٍّ حَتَّى الشَّوْكَةِ يُشَاكُهَا، إِلاَّ كَفَّرَ اللَّهُ بِهَا مِنْ خَطَايَاهُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Tiada keletihan, penyakit, kesedihan, kedukaan, kecederaan, mahupun kesusahan yang menimpa seorang Muslim, walau sekecil mana pun ia, seperti duri yang menusuknya, melainkan Allah akan menghapuskan sebahagian daripada dosanya.\" "
  },
  {
    "id": 5429,
    "hadith_number": 5429,
    "tajuk_hadith": "Perumpamaan Orang Mukmin dan Munafik",
    "perawi_melayu": "Daripada Ka'b:",
    "english_text": "The Prophet (ﷺ) said, \"The example of a believer is that of a fresh tender plant, which the wind bends lt \nsometimes and some other time it makes it straight. And the example of a hypocrite is that of a pine \ntree which keeps straight till once it is uprooted suddenly.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، عَنْ سَعْدٍ، عَنْ عَبْدِ اللَّهِ بْنِ كَعْبٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَثَلُ الْمُؤْمِنِ كَالْخَامَةِ مِنَ الزَّرْعِ تُفَيِّئُهَا الرِّيحُ مَرَّةً، وَتَعْدِلُهَا مَرَّةً، وَمَثَلُ الْمُنَافِقِ كَالأَرْزَةِ لاَ تَزَالُ حَتَّى يَكُونَ انْجِعَافُهَا مَرَّةً وَاحِدَةً ‏\"‏‏.‏ وَقَالَ زَكَرِيَّاءُ حَدَّثَنِي سَعْدٌ، حَدَّثَنَا ابْنُ كَعْبٍ، عَنْ أَبِيهِ، كَعْبٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Perumpamaan orang mukmin seperti anak pokok yang lembut dan segar, yang kadang-kadang ditiup angin lalu membengkokkannya, dan kadang-kadang angin meluruskannya semula.  Dan perumpamaan orang munafik seperti pokok aras yang tetap tegak sehingga tiba-tiba ia tumbang.\" "
  },
  {
    "id": 5430,
    "hadith_number": 5430,
    "tajuk_hadith": "Perumpamaan Orang Mukmin dan Orang Fasik",
    "perawi_melayu": "Dari Abu Hurairah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ فُلَيْحٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ هِلاَلِ بْنِ عَلِيٍّ، مِنْ بَنِي عَامِرِ بْنِ لُؤَىٍّ عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَثَلُ الْمُؤْمِنِ كَمَثَلِ الْخَامَةِ مِنَ الزَّرْعِ مِنْ حَيْثُ أَتَتْهَا الرِّيحُ كَفَأَتْهَا، فَإِذَا اعْتَدَلَتْ تَكَفَّأُ بِالْبَلاَءِ، وَالْفَاجِرُ كَالأَرْزَةِ صَمَّاءَ مُعْتَدِلَةً حَتَّى يَقْصِمَهَا اللَّهُ إِذَا شَاءَ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ibrahim bin al-Munduhir, katanya telah menceritakan kepadaku Muhammad bin Fulaih, katanya telah menceritakan kepadaku bapaku, dari Hilal bin Ali, dari Bani Amir bin Luai dari Ata’ bin Yasar, dari Abu Hurairah r.a., katanya Rasulullah s.a.w. bersabda:  \"Perumpamaan orang mukmin seperti perumpamaan tumbuhan yang muda dan lembut; dari arah mana pun angin bertiup, ia akan membengkok.  Apabila angin reda, ia akan tegak kembali. Begitu juga orang mukmin ditimpa musibah (tetapi dia tetap sabar sehingga Allah menghilangkan kesusahannya). Dan orang yang fasik seperti pokok aras yang tegak lurus sehingga Allah mematahkannya bilamana Dia kehendaki.\""
  },
  {
    "id": 5431,
    "hadith_number": 5431,
    "tajuk_hadith": "Ujian Sebagai Petanda Kebaikan Allah",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "Allah's Messenger (ﷺ) said, \"If Allah wants to do good to somebody, He afflicts him with trials.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ، أَنَّهُ قَالَ سَمِعْتُ سَعِيدَ بْنَ يَسَارٍ أَبَا الْحُبَابِ، يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُصِبْ مِنْهُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Barang siapa yang dikehendaki Allah kebaikan untuknya, nescaya Allah akan mengujinya.\""
  },
  {
    "id": 5432,
    "hadith_number": 5432,
    "tajuk_hadith": "Rasulullah SAW Menderita Sakit",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "I never saw anybody suffering so much from sickness as Allah's Messenger (ﷺ).",
    "arabic_text": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ،‏.‏ حَدَّثَنِي بِشْرُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا رَأَيْتُ أَحَدًا أَشَدَّ عَلَيْهِ الْوَجَعُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Aisyah r.a. berkata: Aku tidak pernah melihat sesiapa yang lebih menderita sakit daripada Rasulullah SAW."
  },
  {
    "id": 5433,
    "hadith_number": 5433,
    "tajuk_hadith": "Ganjaran Pahala Ke Atas Penyakit",
    "perawi_melayu": "Daripada Abdullah:",
    "english_text": "I visited the Prophet (ﷺ) during his ailments and he was suffering from a high fever. I said, \"You have a \nhigh fever. Is it because you will have a double reward for it?\" He said, \"Yes, for no Muslim is \nafflicted with any harm but that Allah will remove his sins as the leaves of a tree fall down.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنِ الْحَارِثِ بْنِ سُوَيْدٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فِي مَرَضِهِ وَهْوَ يُوعَكُ وَعْكًا شَدِيدًا، وَقُلْتُ إِنَّكَ لَتُوعَكُ وَعْكًا شَدِيدًا‏.‏ قُلْتُ إِنَّ ذَاكَ بِأَنَّ لَكَ أَجْرَيْنِ‏.‏ قَالَ ‏\n\"‏ أَجَلْ مَا مِنْ مُسْلِمٍ يُصِيبُهُ أَذًى، إِلاَّ حَاتَّ اللَّهُ عَنْهُ خَطَايَاهُ، كَمَا تَحَاتُّ وَرَقُ الشَّجَرِ ‏\"‏‏.‏",
    "malay_translation": "Aku melawat Nabi SAW ketika baginda sakit demam yang sangat tinggi. Aku berkata, \"Wahai Rasulullah, demam baginda amat tinggi. Adakah ini kerana baginda akan mendapat pahala berganda?\" Baginda menjawab, \"Ya, sesungguhnya tidak ada seorang Muslim pun yang ditimpa sesuatu penyakit melainkan Allah akan menghapuskan dosanya sebagaimana gugurnya daun-daun daripada pokok."
  },
  {
    "id": 5434,
    "hadith_number": 5434,
    "tajuk_hadith": "Ganjaran Pahala Ke Atas Sakit Yang Diderita",
    "perawi_melayu": "Riwayat Abdullah:",
    "english_text": "I visited Allah's Messenger (ﷺ) while he was suffering from a high fever. I said, \"O Allah's Messenger (ﷺ)! You \nhave a high fever.\" He said, \"Yes, I have as much fever as two men of you.\" I said, \"Is it because you \nwill have a double reward?\" He said, \"Yes, it is so. No Muslim is afflicted with any harm, even if it \nwere the prick of a thorn, but that Allah expiates his sins because of that, as a tree sheds its leaves.\"",
    "arabic_text": "حَدَّثَنَا عَبْدَانُ، عَنْ أَبِي حَمْزَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنِ الْحَارِثِ بْنِ سُوَيْدٍ، عَنْ عَبْدِ اللَّهِ، قَالَ دَخَلْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهْوَ يُوعَكُ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّكَ تُوعَكُ وَعْكًا شَدِيدًا‏.‏ قَالَ ‏\"‏ أَجَلْ إِنِّي أُوعَكُ كَمَا يُوعَكُ رَجُلاَنِ مِنْكُمْ ‏\"‏‏.‏ قُلْتُ ذَلِكَ أَنَّ لَكَ أَجْرَيْنِ قَالَ ‏\"‏ أَجَلْ ذَلِكَ كَذَلِكَ، مَا مِنْ مُسْلِمٍ يُصِيبُهُ أَذًى شَوْكَةٌ فَمَا فَوْقَهَا، إِلاَّ كَفَّرَ اللَّهُ بِهَا سَيِّئَاتِهِ، كَمَا تَحُطُّ الشَّجَرَةُ وَرَقَهَا ‏\"‏‏.‏",
    "malay_translation": "Aku melawat Rasulullah SAW ketika baginda demam panas. Aku berkata, \"Wahai Rasulullah SAW! Baginda demam panas.\" Baginda menjawab, \"Ya, aku demam seperti demam dua orang lelaki daripada kalangan kamu.\" Aku bertanya, \"Adakah kerana baginda akan mendapat ganjaran berganda?\" Baginda menjawab, \"Ya, begitulah. Tiada seorang Muslim pun yang ditimpa sebarang penyakit, walau sekecil cucuk duri sekalipun, melainkan Allah akan mengampunkan dosa-dosanya disebabkan penyakit itu, sebagaimana sebatang pokok menggugurkan daun-daunnya."
  },
  {
    "id": 5435,
    "hadith_number": 5435,
    "tajuk_hadith": "Memberi Makan Orang Lapar, Menziarahi Orang Sakit, dan Membebaskan Tawanan",
    "perawi_melayu": "Daripada Abu Muisa Al-Ash`ari:",
    "english_text": "The Prophet (ﷺ) said, \"Feed the hungry, visit the sick, and set free the captives.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَطْعِمُوا الْجَائِعَ، وَعُودُوا الْمَرِيضَ، وَفُكُّوا الْعَانِيَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Berilah makan kepada orang yang lapar, ziarahilah orang yang sakit, dan bebaskanlah tawanan.\""
  },
  {
    "id": 5436,
    "hadith_number": 5436,
    "tajuk_hadith": "Tujuh Perintah dan Tujuh Larangan Rasulullah",
    "perawi_melayu": "Riwayat Al-Bara' bin Azib:",
    "english_text": "Allah's Messenger (ﷺ) ordered us to do seven things and forbade us to do seven other things. He forbade us to wear gold rings, silk, Dibaj, Istabriq, Qissy, and Maithara; and ordered us to accompany funeral processions, visit the sick and greet everybody. (See Hadith No. 104)",
    "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي أَشْعَثُ بْنُ سُلَيْمٍ، قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ سُوَيْدِ بْنِ مُقَرِّنٍ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ ـ رضى الله عنهما ـ قَالَ أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِسَبْعٍ، وَنَهَانَا عَنْ سَبْعٍ، نَهَانَا عَنْ خَاتَمِ الذَّهَبِ، وَلُبْسِ الْحَرِيرِ، وَالدِّيبَاجِ، وَالإِسْتَبْرَقِ، وَعَنِ الْقَسِّيِّ، وَالْمِيثَرَةِ، وَأَمَرَنَا أَنْ نَتْبَعَ الْجَنَائِزَ، وَنَعُودَ الْمَرِيضَ، وَنُفْشِيَ السَّلاَمَ‏.‏",
    "malay_translation": "Rasulullah SAW telah memerintahkan kita untuk melakukan tujuh perkara dan melarang kita daripada melakukan tujuh perkara yang lain. Baginda melarang kita daripada memakai cincin emas, sutera, dibaj, istabriq, qissy, dan maithara; dan memerintahkan kita untuk mengiringi jenazah, melawat orang sakit dan memberi salam kepada semua orang."
  },
  {
    "id": 5437,
    "hadith_number": 5437,
    "tajuk_hadith": "Nabi SAW Menziarah Dan Doa Untuk Orang Sakit",
    "perawi_melayu": "Dari Jabir bin Abdullah",
    "english_text": "Once I fell ill. The Prophet (ﷺ) and Abu Bakr came walking to pay me a visit and found me unconscious. \nThe Prophet (ﷺ) performed ablution and then poured the remaining water on me, and I came to my senses \nto see the Prophet. I said, \"O Allah's Messenger (ﷺ)! What shall I do with my property? How shall I dispose \nof (distribute) my property?\" He did not reply till the Verse of inheritance was revealed.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ الْمُنْكَدِرِ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ يَقُولُ مَرِضْتُ مَرَضًا، فَأَتَانِي النَّبِيُّ صلى الله عليه وسلم يَعُودُنِي وَأَبُو بَكْرٍ وَهُمَا مَاشِيَانِ، فَوَجَدَانِي أُغْمِيَ عَلَىَّ، فَتَوَضَّأَ النَّبِيُّ صلى الله عليه وسلم ثُمَّ صَبَّ وَضُوءَهُ عَلَىَّ، فَأَفَقْتُ فَإِذَا النَّبِيُّ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ كَيْفَ أَصْنَعُ فِي مَالِي كَيْفَ أَقْضِي فِي مَالِي فَلَمْ يُجِبْنِي بِشَىْءٍ حَتَّى نَزَلَتْ آيَةُ الْمِيرَاثِ‏.‏",
    "malay_translation": "Aku pernah sakit tenat.  Nabi SAW dan Abu Bakar datang berjalan kaki melawatku dan mendapati aku pengsan. Nabi SAW berwuduk kemudian menyiramkan air wuduknya ke atasku, lalu aku sedar dan melihat Nabi SAW. Aku bertanya, \"Wahai Rasulullah SAW! Bagaimanakah aku perlu menguruskan harta bendaku? Bagaimanakah aku perlu membahagikan harta bendaku?\" Baginda tidak menjawab sehingga ayat pewarisan diturunkan."
  },
  {
    "id": 5438,
    "hadith_number": 5438,
    "tajuk_hadith": "Wanita Ahli Syurga",
    "perawi_melayu": "Riwayat 'Ata bin Abi Rabah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عِمْرَانَ أَبِي بَكْرٍ، قَالَ حَدَّثَنِي عَطَاءُ بْنُ أَبِي رَبَاحٍ، قَالَ قَالَ لِي ابْنُ عَبَّاسٍ أَلاَ أُرِيكَ امْرَأَةً مِنْ أَهْلِ الْجَنَّةِ قُلْتُ بَلَى‏.‏ قَالَ هَذِهِ الْمَرْأَةُ السَّوْدَاءُ أَتَتِ النَّبِيَّ صلى الله عليه وسلم فَقَالَتْ إِنِّي أُصْرَعُ، وَإِنِّي أَتَكَشَّفُ فَادْعُ اللَّهَ لِي‏.‏ قَالَ ‏\n\"‏ إِنْ شِئْتِ صَبَرْتِ وَلَكِ الْجَنَّةُ وَإِنْ شِئْتِ دَعَوْتُ اللَّهَ أَنْ يُعَافِيَكِ ‏\"‏‏.‏ فَقَالَتْ أَصْبِرُ‏.‏ فَقَالَتْ إِنِّي أَتَكَشَّفُ فَادْعُ اللَّهَ أَنْ لاَ أَتَكَشَّفَ، فَدَعَا لَهَا‏.‏ \nحَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا مَخْلَدٌ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي عَطَاءٌ، أَنَّهُ رَأَى أُمَّ زُفَرَ تِلْكَ، امْرَأَةٌ طَوِيلَةٌ سَوْدَاءُ عَلَى سِتْرِ الْكَعْبَةِ‏.‏",
    "malay_translation": "Musaddad telah meriwayatkan kepada kami, Yahya telah meriwayatkan kepada kami daripada Imran Abi Bakar, katanya, ‘Ata’ bin Abi Rabah telah menceritakan kepadaku, katanya, ‘Ibn Abbas berkata kepadaku, “Adakah aku hendak menunjukkan kepadamu seorang wanita daripada ahli syurga?” Aku menjawab, “Ya.” Dia berkata, “Wanita kulit hitam ini datang kepada Nabi SAW dan berkata, ‘Sesungguhnya aku sering mendapat sawan dan auratku akan terdedah. Maka doakanlah aku kepada Allah.’ Nabi SAW bersabda, ‘Jika engkau mahu, bersabarlah nescaya syurga adalah untukmu, dan jika engkau mahu, aku akan mendoakanmu kepada Allah agar Dia menyembuhkanmu.’ Wanita itu berkata, ‘Aku akan bersabar.’ Kemudian dia berkata, ‘Tetapi auratku sering terdedah. Maka doakanlah aku kepada Allah agar auratku tidak lagi terdedah.’ Maka Nabi SAW mendoakannya.”\n\nMuhammad telah meriwayatkan kepada kami, Makhled telah memberitahu kami daripada Ibn Juraij, Ata’ telah memberitahu aku bahawa dia telah melihat Um Zafar, wanita yang tinggi besar dan berkulit hitam itu, di (memegang) tirai Kaabah."
  },
  {
    "id": 5439,
    "haditi_number": 5439,
    "tajuk_hadith": "Ganjaran Syurga Bagi Mereka Yang Bersabar Kehilangan Dua Benda Tersayang",
    "perawi_melayu": "Anas bin Malik meriwayatkan:",
    "english_text": "I heard Allah's Messenger (ﷺ) saying, \"Allah said, 'If I deprive my slave of his two beloved things (i.e., his eyes) and he remains patient, I will let him enter Paradise in compensation for them.'\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي ابْنُ الْهَادِ، عَنْ عَمْرٍو، مَوْلَى الْمُطَّلِبِ عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ اللَّهَ قَالَ إِذَا ابْتَلَيْتُ عَبْدِي بِحَبِيبَتَيْهِ فَصَبَرَ عَوَّضْتُهُ مِنْهُمَا الْجَنَّةَ ‏\"‏‏.‏ يُرِيدُ عَيْنَيْهِ‏.‏ تَابَعَهُ أَشْعَثُ بْنُ جَابِرٍ وَأَبُو ظِلاَلٍ عَنْ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda, \"Allah SWT berfirman: 'Jika Aku mencabut daripada hambaKu dua perkara yang disayanginya (iaitu matanya) dan dia bersabar, nescaya Aku akan menggantikannya dengan syurga.'\""
  },
  {
    "id": 5440,
    "hadith_number": 5440,
    "tajuk_hadith": "Doa Rasulullah SAW untuk Madinah",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ لَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ وُعِكَ أَبُو بَكْرٍ وَبِلاَلٌ ـ رضى الله عنهما ـ قَالَتْ فَدَخَلْتُ عَلَيْهِمَا قُلْتُ يَا أَبَتِ كَيْفَ تَجِدُكَ وَيَا بِلاَلُ كَيْفَ تَجِدُكَ قَالَتْ وَكَانَ أَبُو بَكْرٍ إِذَا أَخَذَتْهُ الْحُمَّى يَقُولُ كُلُّ امْرِئٍ مُصَبَّحٌ فِي أَهْلِهِ وَالْمَوْتُ أَدْنَى مِنْ شِرَاكِ نَعْلِهِ وَكَانَ بِلاَلٌ إِذَا أَقْلَعَتْ عَنْهُ يَقُولُ أَلاَ لَيْتَ شِعْرِي هَلْ أَبِيتَنَّ لَيْلَةً بَوَادٍ وَحَوْلِي إِذْخِرٌ وَجَلِيلُ وَهَلْ أَرِدَنْ يَوْمًا مِيَاهَ مِجَنَّةٍ وَهَلْ تَبْدُوَنْ لِي شَامَةٌ وَطَفِيلُ قَالَتْ عَائِشَةُ فَجِئْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرْتُهُ فَقَالَ ‏\n\"‏ اللَّهُمَّ حَبِّبْ إِلَيْنَا الْمَدِينَةَ كَحُبِّنَا مَكَّةَ أَوْ أَشَدَّ، اللَّهُمَّ وَصَحِّحْهَا، وَبَارِكْ لَنَا فِي مُدِّهَا وَصَاعِهَا، وَانْقُلْ حُمَّاهَا فَاجْعَلْهَا بِالْجُحْفَةِ ‏\"‏‏.‏",
    "malay_translation": "Aisyah berkata bahawa apabila Rasulullah SAW tiba di Madinah, Abu Bakar dan Bilal jatuh sakit demam.  Aku melawat mereka dan bertanya, \"Wahai ayahku, bagaimana keadaanmu? Wahai Bilal, bagaimana keadaanmu?\"  Apabila Abu Bakar demam, beliau akan membaca syair ini:  'Setiap orang tetap hidup di kalangan keluarganya, namun maut lebih dekat dari tali kasutnya.'  Dan apabila demam Bilal reda, beliau akan membaca syair ini: 'Alangkah baiknya jika aku dapat bermalam di lembah yang dikelilingi oleh tumbuhan Idhkhir dan Jalil (dua jenis tumbuhan wangi). Alangkah baiknya jika aku dapat minum air dari Majanna suatu hari nanti dan adakah gunung Shama dan Tafil (dua gunung di Mekah) akan kelihatan kepadaku.' Kemudian aku menghadap Rasulullah SAW dan menceritakan hal itu.  Baginda bersabda, \"Ya Allah, jadikanlah Madinah dicintai oleh kami sebagaimana kami mencintai Mekah atau lebih daripada itu. Ya Allah,  jadikanlah ia sihat, berkatilah ukuran dan timbangan kami di sini, dan pindahkanlah demamnya ke Al Juhfa.\""
  },
  {
    "id": 5441,
    "hadith_number": 5441,
    "tajuk_hadith": "Rahmat Allah SWT dan Kesabaran",
    "perawi_melayu": "Riwayat Abu 'Uthman:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَاصِمٌ، قَالَ سَمِعْتُ أَبَا عُثْمَانَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ ـ رضى الله عنهما ـ أَنَّ ابْنَةً لِلنَّبِيِّ، صلى الله عليه وسلم أَرْسَلَتْ إِلَيْهِ وَهْوَ مَعَ النَّبِيِّ صلى الله عليه وسلم وَسَعْدٍ وَأُبَىٍّ نَحْسِبُ أَنَّ ابْنَتِي قَدْ حُضِرَتْ فَاشْهَدْنَا فَأَرْسَلَ إِلَيْهَا السَّلاَمَ وَيَقُولُ ‏\"‏ إِنَّ لِلَّهِ مَا أَخَذَ وَمَا أَعْطَى وَكُلُّ شَىْءٍ عِنْدَهُ مُسَمًّى فَلْتَحْتَسِبْ وَلْتَصْبِرْ ‏\"‏‏.‏ فَأَرْسَلَتْ تُقْسِمُ عَلَيْهِ، فَقَامَ النَّبِيُّ صلى الله عليه وسلم وَقُمْنَا، فَرُفِعَ الصَّبِيُّ فِي حَجْرِ النَّبِيِّ صلى الله عليه وسلم وَنَفْسُهُ تَقَعْقَعُ فَفَاضَتْ عَيْنَا النَّبِيِّ صلى الله عليه وسلم فَقَالَ لَهُ سَعْدٌ مَا هَذَا يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ هَذِهِ رَحْمَةٌ وَضَعَهَا اللَّهُ فِي قُلُوبِ مَنْ شَاءَ مِنْ عِبَادِهِ، وَلاَ يَرْحَمُ اللَّهُ مِنْ عِبَادِهِ إِلاَّ الرُّحَمَاءَ ‏\"‏‏.‏",
    "malay_translation": "Kami diberitakan oleh Hajjaj bin Minhal, yang diberitakan kepadanya oleh Syu'bah, yang berkata: “Aku diberitakan oleh ‘Asim, yang berkata: Aku mendengar Abu ‘Utsman dari Usamah bin Zaid r.a. bahawa anak perempuan Nabi SAW telah menghantar utusan kepada baginda ketika baginda SAW bersama Saad dan Ubayy (kami sangka anak perempuanku telah nazak, maka saksikanlah kami). Baginda SAW pun menghantar salam kepadanya dan berkata: “Sesungguhnya milik Allah SWT apa yang diambil-Nya dan apa yang diberikan-Nya, dan setiap sesuatu di sisi-Nya adalah tercatat tempohnya. Oleh itu, hendaklah dia berikhtisab (mengharapkan ganjaran daripada Allah SWT) dan bersabar.” Kemudian dia menghantar utusan lagi dengan bersumpah kepada baginda. Maka Nabi SAW pun bangun, dan kami pun bangun (dan pergi ke sana). Anak kecil itu diletakkan di ribaan Nabi SAW, dan nafasnya tersengal- sengal. Air mata Nabi SAW pun mengalir. Saad bertanya kepada baginda: “Apakah ini ya Rasulullah?” Baginda menjawab: “Ini adalah rahmat yang telah Allah SWT letakkan di dalam hati sesiapa yang dikehendaki-Nya daripada hamba-hamba-Nya; dan Allah SWT tidak akan merahmati daripada hamba-hamba-Nya melainkan orang-orang yang penyayang.”"
  },
  {
    "id": 5442,
    "hadith_number": 5442,
    "tajuk_hadith": "Ziarah Orang Sakit dan Pengampunan Dosa",
    "perawi_melayu": "Riwayat Ibnu Abbas:",
    "english_text": "The Prophet (ﷺ) went to visit a sick bedouin. Whenever the Prophet (ﷺ) went to a patient, he used to say to \nhim, \"Don't worry, if Allah will, it will be expiation (for your sins):\" The bedouin said, \"You say \nexpiation? No, it is but a fever that is boiling or harassing an old man and will lead him to his grave \nwithout his will.\" The Prophet (ﷺ) said, \"Then, yes, it is so.\"",
    "arabic_text": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُخْتَارٍ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَلَى أَعْرَابِيٍّ يَعُودُهُ ـ قَالَ ـ وَكَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا دَخَلَ عَلَى مَرِيضٍ يَعُودُهُ فَقَالَ لَهُ ‏\"‏ لاَ بَأْسَ طَهُورٌ إِنْ شَاءَ اللَّهُ ‏\"‏‏.‏ قَالَ قُلْتَ طَهُورٌ، كَلاَّ بَلْ هِيَ حُمَّى تَفُورُ ـ أَوْ تَثُورُ ـ عَلَى شَيْخٍ كَبِيرٍ، تُزِيرُهُ الْقُبُورَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَنَعَمْ إِذًا ‏\"‏‏.‏",
    "malay_translation": "Baginda Nabi SAW melawat seorang Badwi yang sakit. Setiap kali Baginda SAW melawat pesakit, Baginda akan berkata kepadanya, \"Jangan bimbang, jika Allah SWT menghendaki, ia akan menjadi penyucian (bagi dosa-dosamu):\" Badwi itu berkata, \"Anda mengatakan penyucian? Tidak, ini hanyalah demam yang menggelegak atau mengganggu seorang lelaki tua, dan akan membawanya ke kubur tanpa kehendaknya.\" Baginda Nabi SAW bersabda, \"Maka, ya, begitulah.\""
  },
  {
    "id": 5443,
    "hadith_number": 5443,
    "tajuk_hadith": "Ziarah Nabi SAW kepada Seorang Gadis Yahudi dan Abu Talib",
    "perawi_melayu": "Anas meriwayatkan:",
    "english_text": "A Jewish boy used to serve the Prophet (ﷺ) and became ill. The Prophet (ﷺ) went to pay him a visit and said to him, \"Embrace Islam,\" and he did embrace Islam. Al-Musaiyab said: When Abu Talib was on his deathbed, the Prophet (ﷺ) visited him.",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ غُلاَمًا، لِيَهُودَ كَانَ يَخْدُمُ النَّبِيَّ صلى الله عليه وسلم فَمَرِضَ‏.‏ فَأَتَاهُ النَّبِيُّ صلى الله عليه وسلم يَعُودُهُ فَقَالَ ‏\n\"‏ أَسْلِمْ ‏\"‏‏.‏ فَأَسْلَمَ‏.‏ وَقَالَ سَعِيدُ بْنُ الْمُسَيَّبِ عَنْ أَبِيهِ، لَمَّا حُضِرَ أَبُو طَالِبٍ جَاءَهُ النَّبِيُّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Anas r.a. meriwayatkan bahawa seorang budak lelaki Yahudi yang pernah berkhidmat kepada Nabi SAW telah jatuh sakit.  Nabi SAW telah melawatnya dan bersabda kepadanya, \"Peluklah Islam,\" lalu dia memeluk Islam. Said bin Musayyab berkata:  Apabila Abu Talib hampir meninggal dunia, Nabi SAW telah melawatnya."
  },
  {
    "id": 5444,
    "hadith_number": 5444,
    "tajuk_hadith": "Mengikuti Imam Semasa Solat Duduk",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، حَدَّثَنَا هِشَامٌ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَلَيْهِ نَاسٌ يَعُودُونَهُ فِي مَرَضِهِ فَصَلَّى بِهِمْ جَالِسًا فَجَعَلُوا يُصَلُّونَ قِيَامًا، فَأَشَارَ إِلَيْهِمِ اجْلِسُوا، فَلَمَّا فَرَغَ قَالَ ‏\n\"‏ إِنَّ الإِمَامَ لَيُؤْتَمُّ بِهِ، فَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا رَفَعَ فَارْفَعُوا، وَإِنْ صَلَّى جَالِسًا فَصَلُّوا جُلُوسًا ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ قَالَ الْحُمَيْدِيُّ هَذَا الْحَدِيثُ مَنْسُوخٌ لأَنَّ النَّبِيَّ صلى الله عليه وسلم آخِرَ مَا صَلَّى صَلَّى قَاعِدًا وَالنَّاسُ خَلْفَهُ قِيَامٌ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Al-Mutsanna, telah menceritakan kepada kami Yahya, telah menceritakan kepada kami Hisyam, dia berkata; telah mengkhabarkan kepadaku ayahku, daripada Aisyah r.a. bahawa Nabi SAW ketika sakit didatangi oleh beberapa orang yang melawatnya, lalu baginda menunaikan solat bersama mereka dalam keadaan duduk.  Mereka pula tetap berdiri ketika solat.  Baginda isyarat kepada mereka supaya duduk.  Setelah selesai solat, baginda bersabda:  \"Sesungguhnya Imam itu hendaklah diikuti, maka apabila dia rukuk, maka rukuklah kamu, dan apabila dia mengangkat kepalanya, maka angkatlah kepala kamu, dan jika dia solat dalam keadaan duduk, maka solatlah kamu dalam keadaan duduk.\"  Abu Abdullah berkata, Humaidi berkata, hadis ini telah dimansuhkan kerana Nabi SAW pada solat terakhir baginda, baginda solat dalam keadaan duduk, manakala orang ramai di belakang baginda berdiri."
  },
  {
    "id": 5445,
    "hadith_number": 5445,
    "tajuk_hadith": "Wasiat dan Doa Nabi SAW untuk Kesembuhan Saad",
    "perawi_melayu": "Riwayat Saad",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الْجُعَيْدُ، عَنْ عَائِشَةَ بِنْتِ سَعْدٍ، أَنَّ أَبَاهَا، قَالَ تَشَكَّيْتُ بِمَكَّةَ شَكْوًا شَدِيدًا، فَجَاءَنِي النَّبِيُّ صلى الله عليه وسلم يَعُودُنِي، فَقُلْتُ يَا نَبِيَّ اللَّهِ إِنِّي أَتْرُكُ مَالاً وَإِنِّي لَمْ أَتْرُكْ إِلاَّ ابْنَةً وَاحِدَةً، فَأُوصِي بِثُلُثَىْ مَالِي وَأَتْرُكُ الثُّلُثَ فَقَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ فَأُوصِي بِالنِّصْفِ وَأَتْرُكُ النِّصْفَ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ فَأُوصِي بِالثُّلُثِ وَأَتْرُكُ لَهَا الثُّلُثَيْنِ قَالَ ‏\"‏ الثُّلُثُ وَالثُّلُثُ كَثِيرٌ ‏\"‏‏.‏ ثُمَّ وَضَعَ يَدَهُ عَلَى جَبْهَتِهِ، ثُمَّ مَسَحَ يَدَهُ عَلَى وَجْهِي وَبَطْنِي ثُمَّ قَالَ ‏\"‏ اللَّهُمَّ اشْفِ سَعْدًا وَأَتْمِمْ لَهُ هِجْرَتَهُ ‏\"‏‏.‏ فَمَا زِلْتُ أَجِدُ بَرْدَهُ عَلَى كَبِدِي فِيمَا يُخَالُ إِلَىَّ حَتَّى السَّاعَةِ‏.‏",
    "malay_translation": "Aku jatuh sakit tenat di Mekah, lalu Rasulullah SAW datang menjengukku. Aku berkata, \"Wahai Rasulullah SAW! Aku akan meninggalkan harta, tetapi aku hanya meninggalkan seorang anak perempuan. Bolehkah aku mewakafkan dua pertiga harta kekayaanku dan meninggalkan sepertiga (untuk anakku)?\" Baginda SAW bersabda, \"Tidak.\" Aku berkata, \"Bolehkah aku mewakafkan separuh dan meninggalkan separuh?\" Baginda SAW bersabda, \"Tidak.\" Aku berkata, \"Bolehkah aku mewakafkan sepertiga dan meninggalkan dua pertiga?\" Baginda SAW bersabda, \"Sepertiga itu dibolehkan, walaupun sepertiga itu pun sudah banyak.\" Kemudian Baginda SAW meletakkan tangannya di dahiku, lalu mengusap wajah dan perutku. Kemudian Baginda SAW berdoa, \"Ya Allah, sembuhkan Saad dan sempurnakanlah hijrahnya.\" Sejak itu, aku masih merasakan kesejukan sentuhan tangan Baginda SAW di hatiku sehingga kini."
  },
  {
    "id": 5446,
    "hadith_number": 5446,
    "tajuk_hadith": "Pahala Bagi Orang Sakit",
    "perawi_melayu": "Riwayat Abdullah bin Mas'ud:",
    "english_text": "I visited Allah's Messenger (ﷺ) while he was suffering from a high fever. I touched him with my hand and \nsaid, \"O Allah's Messenger (ﷺ)! You have a high fever.\" Allah's Messenger (ﷺ) said, \"Yes, I have as much fever as \ntwo men of you have.\" I said, \"Is it because you will get a double reward?\" Allah's Messenger (ﷺ) said, \"Yes, \nno Muslim is afflicted with harm because of sickness or some other inconvenience, but that Allah will \nremove his sins for him as a tree sheds its leaves.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنِ الْحَارِثِ بْنِ سُوَيْدٍ، قَالَ قَالَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ دَخَلْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهْوَ يُوعَكُ فَمَسِسْتُهُ بِيَدِي فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّكَ تُوعَكُ وَعْكًا شَدِيدًا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَجَلْ إِنِّي أُوعَكُ كَمَا يُوعَكُ رَجُلاَنِ مِنْكُمْ ‏\"‏‏.‏ فَقُلْتُ ذَلِكَ أَنَّ لَكَ أَجْرَيْنِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَجَلْ ‏\"‏‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا مِنْ مُسْلِمٍ يُصِيبُهُ أَذًى مَرَضٌ فَمَا سِوَاهُ إِلاَّ حَطَّ اللَّهُ لَهُ سَيِّئَاتِهِ كَمَا تَحُطُّ الشَّجَرَةُ وَرَقَهَا ‏\"‏‏.‏",
    "malay_translation": "Aku melawat Rasulullah SAW ketika baginda demam panas. Aku menyentuh baginda dengan tanganku dan berkata, \"Wahai Rasulullah SAW! Baginda demam panas.\" Rasulullah SAW bersabda, \"Ya, aku demam panas seperti demam dua orang lelaki daripada kamu.\" Aku berkata, \"Adakah kerana baginda akan mendapat dua kali ganda pahala?\" Rasulullah SAW bersabda, \"Ya, sesungguhnya setiap Muslim yang ditimpa penyakit atau sebarang kesusahan, nescaya Allah akan menghapuskan dosa-dosanya seperti pokok yang menggugurkan daun-daunnya."
  },
  {
    "id": 5447,
    "hadith_number": 5447,
    "tajuk_hadith": "Pahala Ganda dan Penghapusan Dosa",
    "perawi_melayu": "Riwayat Abdullah:",
    "english_text": "I visited the Prophet (ﷺ) during his illness and touched him while he was having a fever. I said to him, \n\"You have a high fever; is it because you will get a double reward?\" He said, \"Yes. No Muslim is \nafflicted with any harm, but that his sins will be annulled as the leave of a tree fall down.\"",
    "arabic_text": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنِ الْحَارِثِ بْنِ سُوَيْدٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فِي مَرَضِهِ فَمَسِسْتُهُ وَهْوَ يُوعَكُ وَعْكًا شَدِيدًا فَقُلْتُ إِنَّكَ لَتُوعَكُ وَعْكًا شَدِيدًا، وَذَلِكَ أَنَّ لَكَ أَجْرَيْنِ‏.‏ قَالَ ‏\n\"‏ أَجَلْ، وَمَا مِنْ مُسْلِمٍ يُصِيبُهُ أَذًى إِلاَّ حَاتَّتْ عَنْهُ خَطَايَاهُ كَمَا تَحَاتُّ وَرَقُ الشَّجَرِ ‏\"‏‏.‏",
    "malay_translation": "Aku melawat Nabi ﷺ ketika baginda sakit dan menyentuh baginda ketika baginda demam. Aku berkata kepada baginda, \"Demam tuan sangat tinggi; adakah ini kerana tuan akan mendapat pahala berganda?\" Baginda menjawab, \"Ya. Tiada seorang Muslim pun yang ditimpa sesuatu kesusahan melainkan dosa-dosanya akan dihapuskan sebagaimana gugurnya daun-daun dari pohon."
  },
  {
    "id": 5448,
    "hadith_number": 5448,
    "tajuk_hadith": "Penyakit Sebagai Penebus Dosa",
    "perawi_melayu": "Riwayat Ibnu Abbas",
    "english_text": "Allah's Messenger (ﷺ) entered upon sick man to pay him a visit, and said to him, \"Don't worry, Allah willing, \n(your sickness will be) an expiation for your sins.\" The man said, \"No, it is but a fever that is boiling \nwithin an old man and will send him to his grave.\" On that, the Prophet (ﷺ) said, \"Then yes, it is so.\"",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ خَالِدٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ عَلَى رَجُلٍ يَعُودُهُ فَقَالَ ‏\"‏ لاَ بَأْسَ طَهُورٌ إِنْ شَاءَ اللَّهُ ‏\"‏‏.‏ فَقَالَ كَلاَّ بَلْ حُمَّى تَفُورُ عَلَى شَيْخٍ كَبِيرٍ كَيْمَا تُزِيرَهُ الْقُبُورَ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَنَعَمْ إِذًا ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW melawat seorang lelaki yang sakit dan berkata kepadanya, \"Jangan bimbang, insya-Allah, penyakitmu ini akan menjadi penebus dosa-dosamu.\" Lelaki itu berkata, \"Tidak, ini hanyalah demam yang membakar tubuh seorang lelaki tua dan akan membawaku ke liang lahat.\"  Lalu Nabi SAW bersabda, \"Ya, begitulah.\" "
  },
  {
    "id": 5449,
    "hadith_number": 5449,
    "tajuk_hadith": "Kisah Nabi SAW Menziarahi Saad bin Ubadah dan Peristiwa dengan Abdullah bin Ubai",
    "perawi_melayu": "Riwayat Usamah bin Zaid:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّ أُسَامَةَ بْنَ زَيْدٍ، أَخْبَرَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم رَكِبَ عَلَى حِمَارٍ عَلَى إِكَافٍ عَلَى قَطِيفَةٍ فَدَكِيَّةٍ، وَأَرْدَفَ أُسَامَةَ وَرَاءَهُ يَعُودُ سَعْدَ بْنَ عُبَادَةَ قَبْلَ وَقْعَةِ بَدْرٍ فَسَارَ حَتَّى مَرَّ بِمَجْلِسٍ فِيهِ عَبْدُ اللَّهِ بْنُ أُبَىٍّ ابْنُ سَلُولَ وَذَلِكَ قَبْلَ أَنْ يُسْلِمَ عَبْدُ اللَّهِ، وَفِي الْمَجْلِسِ أَخْلاَطٌ مِنَ الْمُسْلِمِينَ وَالْمُشْرِكِينَ عَبَدَةِ الأَوْثَانِ وَالْيَهُودِ، وَفِي الْمَجْلِسِ عَبْدُ اللَّهِ بْنُ رَوَاحَةَ، فَلَمَّا غَشِيَتِ الْمَجْلِسَ عَجَاجَةُ الدَّابَّةِ خَمَّرَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ أَنْفَهُ بِرِدَائِهِ، قَالَ لاَ تُغَيِّرُوا عَلَيْنَا فَسَلَّمَ النَّبِيُّ صلى الله عليه وسلم وَوَقَفَ وَنَزَلَ فَدَعَاهُمْ إِلَى اللَّهِ فَقَرَأَ عَلَيْهِمُ الْقُرْآنَ، فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ أُبَىٍّ يَا أَيُّهَا الْمَرْءُ إِنَّهُ لاَ أَحْسَنَ مِمَّا تَقُولُ إِنْ كَانَ حَقًّا، فَلاَ تُؤْذِنَا بِهِ فِي مَجْلِسِنَا، وَارْجِعْ إِلَى رَحْلِكَ فَمَنْ جَاءَكَ فَاقْصُصْ عَلَيْهِ‏.‏ قَالَ ابْنُ رَوَاحَةَ بَلَى يَا رَسُولَ اللَّهِ فَاغْشَنَا بِهِ فِي مَجَالِسِنَا فَإِنَّا نُحِبُّ ذَلِكَ فَاسْتَبَّ الْمُسْلِمُونَ وَالْمُشْرِكُونَ وَالْيَهُودُ حَتَّى كَادُوا يَتَثَاوَرُونَ فَلَمْ يَزَلِ النَّبِيُّ صلى الله عليه وسلم حَتَّى سَكَتُوا فَرَكِبَ النَّبِيُّ صلى الله عليه وسلم دَابَّتَهُ حَتَّى دَخَلَ عَلَى سَعْدِ بْنِ عُبَادَةَ فَقَالَ لَهُ ‏\n\"‏ أَىْ سَعْدُ أَلَمْ تَسْمَعْ مَا قَالَ أَبُو حُبَابٍ ‏\"‏‏.‏ يُرِيدُ عَبْدَ اللَّهِ بْنَ أُبَىٍّ‏.‏ قَالَ سَعْدٌ يَا رَسُولَ اللَّهِ اعْفُ عَنْهُ وَاصْفَحْ فَلَقَدْ أَعْطَاكَ اللَّهُ مَا أَعْطَاكَ وَلَقَدِ اجْتَمَعَ أَهْلُ هَذِهِ الْبَحْرَةِ أَنْ يُتَوِّجُوهُ فَيُعَصِّبُوهُ فَلَمَّا رَدَّ ذَلِكَ بِالْحَقِّ الَّذِي أَعْطَاكَ شَرِقَ بِذَلِكَ، فَذَلِكَ الَّذِي فَعَلَ بِهِ مَا رَأَيْتَ‏.‏",
    "malay_translation": "Nabi SAW menunggang seekor keldai yang berpelana dan beralas kain baldu Fadakiyyah. Baginda membawa Usamah di belakang baginda ketika melawat Saad bin Ubadah, sebelum peperangan Badar.  Baginda terus berjalan sehingga sampai ke satu majlis yang dihadiri oleh Abdullah bin Ubai bin Salul, sebelum Abdullah memeluk Islam.  Dalam majlis itu terdapat pelbagai golongan, iaitu orang Islam, musyrik penyembah berhala dan Yahudi. Abdullah bin Rawahah turut berada di majlis tersebut. Apabila debu daripada tunggangan baginda meliputi majlis tersebut, Abdullah bin Ubai menutup hidungnya dengan kain dan berkata, \"Jangan ganggu kami dengan debu.\" Nabi SAW memberi salam kepada mereka, berhenti dan turun. Kemudian baginda mengajak mereka kepada Allah (iaitu memeluk Islam) dan membacakan beberapa ayat al-Quran kepada mereka.  Lalu Abdullah bin Ubai berkata, \"Wahai orang, sesungguhnya tiada yang lebih baik daripada apa yang engkau katakan jika ia benar.  Janganlah engkau menyusahkan kami dengannya di majlis kami, dan kembalilah ke tempatmu. Jika ada yang datang kepadamu, maka sampaikanlah kepadanya.\"  Abdullah bin Rawahah berkata, \"Ya, wahai Rasulullah SAW! Sampaikanlah ajaranmu kepada kami di majlis kami kerana kami menyukainya.\" Maka orang Islam, musyrik dan Yahudi mula bertengkar sehingga hampir berlaku pergaduhan. Nabi SAW terus menenangkan mereka sehingga mereka reda.  Kemudian Nabi SAW menunggang kenderaan baginda dan terus ke rumah Saad bin Ubadah.  Baginda berkata kepadanya, \"Wahai Saad, adakah engkau mendengar apa yang dikatakan oleh Abu Hubab?\" (Maksudnya Abdullah bin Ubai). Saad berkata, \"Wahai Rasulullah SAW! Maafkanlah dia dan ampunilah dia, kerana sesungguhnya Allah telah memberikan kepadamu apa yang telah diberikanNya kepadamu.  Sesungguhnya penduduk bandar ini telah bersepakat untuk menjadikan dia sebagai ketua dengan memakai serban di kepalanya, tetapi apabila perkara itu disekat oleh kebenaran yang Allah berikan kepadamu, dia (Abdullah bin Ubai) berasa cemburu dan itulah sebabnya dia berbuat sedemikian rupa.\" "
  },
  {
    "id": 5450,
    "hadith_number": 5450,
    "tajuk_hadith": "Ziarah Nabi SAW ketika Sakit",
    "perawi_melayu": "Dari Jabir:",
    "english_text": "The Prophet (ﷺ) came to visit me (while I was sick) and he was riding neither a mule, nor a horse.",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَبَّاسٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدٍ ـ هُوَ ابْنُ الْمُنْكَدِرِ ـ عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ جَاءَنِي النَّبِيُّ صلى الله عليه وسلم يَعُودُنِي لَيْسَ بِرَاكِبِ بَغْلٍ وَلاَ بِرْذَوْنٍ‏.‏",
    "malay_translation": "Jabir r.a. berkata, “Nabi SAW datang melawatku ketika aku sakit, baginda tidak menunggang keldai mahupun kuda.”"
  },
  {
    "id": 5451,
    "hadith_number": 5451,
    "tajuk_hadith": "Nabi SAW dan Masalah Kutu Kepala",
    "perawi_melayu": "Riwayat Ka'b bin 'Ujara:",
    "english_text": "The Prophet (ﷺ) passed by me while I was kindling a fire under a (cooking) pot. He said, \"Do the lice of \nyour head trouble you?\" I said, \"Yes.\" So he called a barber to shave my head and ordered me to make \nexpiation for that.",
    "arabic_text": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ أَبِي نَجِيحٍ، وَأَيُّوبَ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ ـ رضى الله عنه‏.‏ مَرَّ بِيَ النَّبِيُّ صلى الله عليه وسلم وَأَنَا أُوقِدُ تَحْتَ الْقِدْرِ فَقَالَ ‏\n\"‏ أَيُؤْذِيكَ هَوَامُّ رَأْسِكَ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ فَدَعَا الْحَلاَّقَ فَحَلَقَهُ ثُمَّ أَمَرَنِي بِالْفِدَاءِ‏.‏",
    "malay_translation": "Nabi SAW melalui sebelahku ketika aku sedang menyalakan api di bawah periuk. Baginda bertanya, \"Adakah kutu di kepalamu mengganggu kamu?\" Aku menjawab, \"Ya.\" Maka Baginda memanggil tukang gunting rambut lalu menggundulkan kepalaku dan menyuruhku bertaubat."
  },
  {
    "id": 5452,
    "hadith_number": 5452,
    "tajuk_hadith": "Doa Rasulullah SAW untuk Aisyah yang Mengadu Sakit Kepala",
    "perawi_melayu": "Riwayat Al-Qasim bin Muhammad:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَبُو زَكَرِيَّاءَ، أَخْبَرَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ سَمِعْتُ الْقَاسِمَ بْنَ مُحَمَّدٍ، قَالَ قَالَتْ عَائِشَةُ وَارَأْسَاهْ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ذَاكِ لَوْ كَانَ وَأَنَا حَىٌّ، فَأَسْتَغْفِرُ لَكِ وَأَدْعُو لَكِ ‏\"‏‏.‏ فَقَالَتْ عَائِشَةُ وَاثُكْلِيَاهْ، وَاللَّهِ إِنِّي لأَظُنُّكَ تُحِبُّ مَوْتِي، وَلَوْ كَانَ ذَاكَ لَظَلِلْتَ آخِرَ يَوْمِكَ مُعَرِّسًا بِبَعْضِ أَزْوَاجِكَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ بَلْ أَنَا وَارَأْسَاهْ لَقَدْ هَمَمْتُ أَوْ أَرَدْتُ أَنْ أُرْسِلَ إِلَى أَبِي بَكْرٍ وَابْنِهِ، وَأَعْهَدَ أَنْ يَقُولَ الْقَائِلُونَ أَوْ يَتَمَنَّى الْمُتَمَنُّونَ، ثُمَّ قُلْتُ يَأْبَى اللَّهُ وَيَدْفَعُ الْمُؤْمِنُونَ، أَوْ يَدْفَعُ اللَّهُ وَيَأْبَى الْمُؤْمِنُونَ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Yahya bin Yahya Abu Zakaria, telah memberitakan kepada kami Sulaiman bin Bilal, dari Yahya bin Sa'id, dia berkata: aku mendengar Al-Qasim bin Muhammad berkata: Aisyah berkata, \"Sakit kepalaku!\" Maka Rasulullah SAW bersabda: \"Sekiranya itu terjadi ketika aku masih hidup, nescaya aku memohon ampun untukmu dan berdoa untukmu.\" Maka Aisyah berkata: \"Wa tukliyah! Demi Allah, aku sangka engkau suka aku mati, dan jika itu terjadi, tentu engkau akan menghabiskan waktu petangmu bersama salah seorang isteri-isterimu.\" Maka Nabi SAW bersabda: \"Bukan, aku juga sakit kepala. Aku pernah berniat untuk menghantar utusan kepada Abu Bakar dan anaknya, dan aku wasiatkan agar dia menjadi khalifahku sekiranya ada yang berkata-kata atau menginginkannya, kemudian aku berkata (kepada diriku sendiri): Allah tidak akan membiarkannya terjadi, dan orang-orang mukmin akan mencegahnya.\" "
  },
  {
    "id": 5453,
    "hadith_number": 5453,
    "tajuk_hadith": "Pahala Bagi Penyakit dan Kesusahan",
    "perawi_melayu": "Riwayat Ibnu Mas'ud:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُوسَى، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ، حَدَّثَنَا سُلَيْمَانُ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنِ الْحَارِثِ بْنِ سُوَيْدٍ، عَنِ ابْنِ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ دَخَلْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم وَهْوَ يُوعَكُ فَمَسِسْتُهُ فَقُلْتُ إِنَّكَ لَتُوعَكُ وَعْكًا شَدِيدًا‏.‏ قَالَ ‏\"‏ أَجَلْ كَمَا يُوعَكُ رَجُلاَنِ مِنْكُمْ ‏\"‏‏.‏ قَالَ لَكَ أَجْرَانِ قَالَ ‏\"‏ نَعَمْ مَا مِنْ مُسْلِمٍ يُصِيبُهُ أَذًى مَرَضٌ فَمَا سِوَاهُ إِلاَّ حَطَّ اللَّهُ سَيِّئَاتِهِ كَمَا تَحُطُّ الشَّجَرَةُ وَرَقَهَا ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Musa, telah menceritakan kepada kami Abdul Aziz bin Muslim, telah menceritakan kepada kami Sulaiman, dari Ibrahim Al-Taymi, dari Al-Harits bin Suwaid, dari Ibnu Mas'ud - semoga Allah meridhainya - dia berkata, \"Aku masuk menjenguk Nabi SAW ketika baginda sakit demam. Aku menyentuh baginda lalu berkata, \"Sesungguhnya engkau sangat sakit demam.\" Baginda menjawab, \"Ya, seperti sakit demam dua orang dari kalangan kamu.\" Aku bertanya, \"Adakah engkau akan mendapat dua pahala?\" Baginda menjawab, \"Ya, sesungguhnya tidaklah seorang muslim ditimpa penyakit atau sesuatu kesusahan melainkan Allah akan menghapuskan dosa-dosanya sebagaimana pokok kayu menggugurkan daun-daunnya.\""
  },
  {
    "id": 5454,
    "hadith_number": 5454,
    "tajuk_hadith": "Menafkahkan Harta Untuk Sedekah dan Mewariskan Harta Kepada Waris",
    "perawi_melayu": "Riwayat Sa'd",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ، أَخْبَرَنَا الزُّهْرِيُّ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، قَالَ جَاءَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَعُودُنِي مِنْ وَجَعٍ اشْتَدَّ بِي زَمَنَ حَجَّةِ الْوَدَاعِ فَقُلْتُ بَلَغَ بِي مَا تَرَى وَأَنَا ذُو مَالٍ وَلاَ يَرِثُنِي إِلاَّ ابْنَةٌ لِي أَفَأَتَصَدَّقُ بِثُلُثَىْ مَالِي قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ بِالشَّطْرِ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ الثُّلُثُ قَالَ ‏\"‏ الثُّلُثُ كَثِيرٌ، أَنْ تَدَعَ وَرَثَتَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَذَرَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ وَلَنْ تُنْفِقَ نَفَقَةً تَبْتَغِي بِهَا وَجْهَ اللَّهِ إِلاَّ أُجِرْتَ عَلَيْهَا حَتَّى مَا تَجْعَلُ فِي فِي امْرَأَتِكَ ‏\"‏‏.‏",
    "malay_translation": "Kami diberitakan oleh Musa bin Ismail, yang diberitakan kepadanya oleh Abdul Aziz bin Abdullah bin Abi Salmah, yang memberitakan kepada kami oleh Az- Zuhri, daripada Amir bin Saad, daripada bapanya, bahawa baginda Rasulullah SAW datang melawatku ketika aku sakit teruk pada masa Haji Wida'. Aku berkata: \"Wahai Rasulullah, lihatlah keadaanku sekarang. Aku mempunyai harta tetapi hanya seorang anak perempuan yang mewarisi hartaku. Bolehkah aku bersedekah dengan dua pertiga daripada hartaku?\" Baginda menjawab: \"Tidak.\" Aku bertanya: \"Bagaimana separuh darinya?\" Baginda menjawab: \"Tidak.\" Aku bertanya lagi: \"Bagaimana dengan sepertiga darinya?\" Baginda menjawab: \"Sepertiga itu pun sudah banyak. Lebih baik kamu meninggalkan waris-warismu dalam keadaan kaya daripada meninggalkan mereka dalam keadaan miskin dan meminta-minta kepada orang lain. Sesungguhnya apa jua yang engkau nafkahkan kerana mencari keredaan Allah SWT, nescaya engkau akan mendapat pahala, malah termasuk apa yang engkau berikan kepada isterimu.\""
  },
  {
    "id": 5455,
    "hadith_number": 5455,
    "tajuk_hadith": "Larangan Nabi SAW menulis wasiat ketika sakit tenat",
    "perawi_melayu": "Riwayat Ibnu Abbas:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، حَدَّثَنَا هِشَامٌ، عَنْ مَعْمَرٍ، وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا حُضِرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَفِي الْبَيْتِ رِجَالٌ فِيهِمْ عُمَرُ بْنُ الْخَطَّابِ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هَلُمَّ أَكْتُبْ لَكُمْ كِتَابًا لاَ تَضِلُّوا بَعْدَهُ ‏\"‏‏.‏ فَقَالَ عُمَرُ إِنَّ النَّبِيَّ صلى الله عليه وسلم قَدْ غَلَبَ عَلَيْهِ الْوَجَعُ وَعِنْدَكُمُ الْقُرْآنُ، حَسْبُنَا كِتَابُ اللَّهِ فَاخْتَلَفَ أَهْلُ الْبَيْتِ فَاخْتَصَمُوا، مِنْهُمْ مَنْ يَقُولُ قَرِّبُوا يَكْتُبْ لَكُمُ النَّبِيُّ صلى الله عليه وسلم كِتَابًا لَنْ تَضِلُّوا بَعْدَهُ، وَمِنْهُمْ مَنْ يَقُولُ مَا قَالَ عُمَرُ فَلَمَّا أَكْثَرُوا اللَّغْوَ وَالاِخْتِلاَفَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قُومُوا ‏\"‏‏.‏ قَالَ عُبَيْدُ اللَّهِ فَكَانَ ابْنُ عَبَّاسٍ يَقُولُ إِنَّ الرَّزِيَّةَ كُلَّ الرَّزِيَّةِ مَا حَالَ بَيْنَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَبَيْنَ أَنْ يَكْتُبَ لَهُمْ ذَلِكَ الْكِتَابَ مِنِ اخْتِلاَفِهِمْ وَلَغَطِهِمْ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ibrahim bin Musa, telah menceritakan kepada kami Hisyam, dari Ma'mar, dan telah menceritakan kepadaku Abdullah bin Muhammad, telah menceritakan kepada kami Abdur Razzaq, telah mengabarkan kepada kami Ma'mar, dari Az Zuhri, dari Ubaidillah bin Abdullah, dari Ibnu Abbas r.a., katanya: Ketika Rasulullah SAW hampir meninggal dunia, dan di dalam rumah itu ada beberapa orang lelaki, di antaranya Umar bin Khattab, Nabi SAW bersabda: \"Mari, aku akan tuliskan untuk kamu sebuah kitab supaya kamu tidak sesat sesudah itu.\" Maka Umar berkata: \"Sesungguhnya Nabi SAW telah ditimpa sakit yang hebat, dan kamu ada al-Quran, cukuplah bagi kita kitab Allah.\" Maka berlainan pendapat dan bertengkarlah penghuni rumah itu, sebahagian daripada mereka berkata: \"Dekatilah, supaya Nabi SAW menulis untuk kamu sebuah kitab yang kamu tidak akan sesat sesudah itu,\" dan sebahagian daripada mereka berkata seperti kata Umar. Maka apabila mereka telah banyak berkata-kata dan berselisih pendapat di hadapan Nabi SAW, Rasulullah SAW bersabda: \"Pergilah!\" Ubaidillah berkata: Ibnu Abbas selalu berkata: \"Sesungguhnya bencana yang paling besar ialah apa yang menghalang Rasulullah SAW daripada menulis kitab itu untuk mereka disebabkan perselisihan dan percakapan mereka."
  },
  {
    "id": 5456,
    "hadith_number": 5456,
    "tajuk_hadith": "Doa Nabi SAW untuk Kesembuhan dan Khatam Nubuwah",
    "perawi_melayu": "Daripada As-Sa'ib:",
    "english_text": "My aunt took me to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! My nephew is ill.\" The Prophet (ﷺ) touched my head with his hand and invoked Allah to bless me. He then performed ablution and I drank of the remaining water of his ablution and then stood behind his back and saw \"Khatam An-Nubuwwa\" (The Seal of Prophethood) between his shoulders like a button of a tent.",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ، حَدَّثَنَا حَاتِمٌ ـ هُوَ ابْنُ إِسْمَاعِيلَ ـ عَنِ الْجُعَيْدِ، قَالَ سَمِعْتُ السَّائِبَ، يَقُولُ ذَهَبَتْ بِي خَالَتِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ ابْنَ أُخْتِي وَجِعٌ فَمَسَحَ رَأْسِي وَدَعَا لِي بِالْبَرَكَةِ، ثُمَّ تَوَضَّأَ فَشَرِبْتُ مِنْ وَضُوئِهِ وَقُمْتُ خَلْفَ ظَهْرِهِ فَنَظَرْتُ إِلَى خَاتَمِ النُّبُوَّةِ بَيْنَ كَتِفَيْهِ مِثْلَ زِرِّ الْحَجَلَةِ‏.‏",
    "malay_translation": "Makcik saya membawa saya kepada Rasulullah SAW, lalu berkata, \"Wahai Rasulullah SAW! Anak saudara lelaki saya sakit.\"  Rasulullah SAW menyentuh kepala saya dengan tangan baginda dan berdoa memohon keberkatan untuk saya. Kemudian baginda bersuci, dan saya minum air sisa dari wudhunya. Setelah itu, saya berdiri di belakang baginda dan melihat Khatam An-Nubuwwah (Cap Kenabian) di antara kedua bahu baginda seperti kancing khemah."
  },
  {
    "id": 5457,
    "hadith_number": 5457,
    "tajuk_hadith": "Doa Ketika Menghadapi Musibah",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "The Prophet (ﷺ) said, \"None of you should wish for death because of a calamity befalling him; but if he \nhas to wish for death, he should say: \"O Allah! Keep me alive as long as life is better for me, and let \nme die if death is better for me.' \"",
    "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ يَتَمَنَّيَنَّ أَحَدُكُمُ الْمَوْتَ مِنْ ضُرٍّ أَصَابَهُ، فَإِنْ كَانَ لاَ بُدَّ فَاعِلاً فَلْيَقُلِ اللَّهُمَّ أَحْيِنِي مَا كَانَتِ الْحَيَاةُ خَيْرًا لِي، وَتَوَفَّنِي إِذَا كَانَتِ الْوَفَاةُ خَيْرًا لِي ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Janganlah seorang pun di antara kamu mengharapkan kematian disebabkan oleh musibah yang menimpanya.  Tetapi jika dia terpaksa berdoa untuk kematian, maka hendaklah dia berdoa:  'Ya Allah, hidupkanlah aku selama mana hidup itu lebih baik bagiku, dan wafatkanlah aku jika kematian itu lebih baik bagiku.'\""
  },
  {
    "id": 5458,
    "hadith_number": 5458,
    "tajuk_hadith": "Ganjaran Amal Soleh dan Pembinaan",
    "perawi_melayu": "Riwayat Qais bin Abi Hazim:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، قَالَ دَخَلْنَا عَلَى خَبَّابٍ نَعُودُهُ وَقَدِ اكْتَوَى سَبْعَ كَيَّاتٍ فَقَالَ إِنَّ أَصْحَابَنَا الَّذِينَ سَلَفُوا مَضَوْا وَلَمْ تَنْقُصْهُمُ الدُّنْيَا وَإِنَّا أَصَبْنَا مَا لاَ نَجِدُ لَهُ مَوْضِعًا إِلاَّ التُّرَابَ وَلَوْلاَ أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَانَا أَنْ نَدْعُوَ بِالْمَوْتِ لَدَعَوْتُ بِهِ، ثُمَّ أَتَيْنَاهُ مَرَّةً أُخْرَى وَهْوَ يَبْنِي حَائِطًا لَهُ فَقَالَ إِنَّ الْمُسْلِمَ لَيُوجَرُ فِي كُلِّ شَىْءٍ يُنْفِقُهُ إِلاَّ فِي شَىْءٍ يَجْعَلُهُ فِي هَذَا التُّرَابِ‏.‏",
    "malay_translation": "Kami melawat Khabbab yang ketika itu sakit.  Badannya telah dibakar (dikau ter) di tujuh tempat.  Beliau berkata, \" Sahabat-sahabat kami yang terdahulu telah pergi (meninggal dunia) tanpa pahala mereka berkurang disebabkan nikmat dunia.  Tetapi kami telah mendapat harta yang banyak sehingga kami tidak tahu ke mana hendak menggunakannya melainkan untuk membina bangunan. Sekiranya Nabi SAW tidak melarang kami daripada mendoakan kematian, nescaya aku akan mendoakannya.\" Kemudian kami melawatnya sekali lagi ketika beliau sedang membina tembok rumahnya. Beliau berkata, \"Sesungguhnya seorang Muslim akan mendapat pahala bagi setiap sesuatu yang dibelanjakannya kecuali bagi sesuatu yang dibelanjakannya di atas tanah (harta benda duniawi).\""
  },
  {
    "id": 5459,
    "hadith_number": 5459,
    "tajuk_hadith": "Amal Soleh dan Rahmat Allah",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو عُبَيْدٍ، مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لَنْ يُدْخِلَ أَحَدًا عَمَلُهُ الْجَنَّةَ ‏\"‏‏.‏ قَالُوا وَلاَ أَنْتَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ لاَ، وَلاَ أَنَا إِلاَّ أَنْ يَتَغَمَّدَنِي اللَّهُ بِفَضْلٍ وَرَحْمَةٍ فَسَدِّدُوا وَقَارِبُوا وَلاَ يَتَمَنَّيَنَّ أَحَدُكُمُ الْمَوْتَ إِمَّا مُحْسِنًا فَلَعَلَّهُ أَنْ يَزْدَادَ خَيْرًا، وَإِمَّا مُسِيئًا فَلَعَلَّهُ أَنْ يَسْتَعْتِبَ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Yaman, telah memberitakan kepada kami Syu’aib, dari Az- Zuhri, dia berkata; telah memberitakan kepadaku Abu Ubaid, hamba Abdul Rahman bin Auf bahawa Abu Hurairah berkata; aku mendengar Rasulullah SAW bersabda: \"Tidak akan memasukkan seseorang ke dalam syurga amalannya.\" Mereka berkata: \"Wahai Rasulullah, adakah engkau juga?\" Baginda menjawab: \"Tidak, aku juga tidak melainkan Allah melimpahkan kurnia dan rahmatNya kepadaku. Oleh itu, bersederhanalah kamu dalam beramal dan berusahalah dengan kemampuan kamu. Dan janganlah seorang pun di antara kamu mengharapkan kematian. Jika dia orang yang berbuat baik, mudah-mudahan dia akan bertambah baik, dan jika dia orang yang berbuat jahat, mudah-mudahan dia bertaubat.\" "
  },
  {
    "id": 5460,
    "hadith_number": 5460,
    "tajuk_hadith": "Doa Nabi SAW memohon keampunan dan dihimpunkan bersama para sahabat yang mulia",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "I heard the Prophet (ﷺ) , who was resting against me, saying, \"O Allah! Excuse me and bestow Your \nMercy on me and let me join with the highest companions (in Paradise).\" See Qur'an (4.69)",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، قَالَ سَمِعْتُ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم وَهْوَ مُسْتَنِدٌ إِلَىَّ يَقُولُ ‏\n\"‏ اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَأَلْحِقْنِي بِالرَّفِيقِ الأَعْلَى ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Nabi SAW, ketika baginda bersandar kepadaku, berdoa: \"Ya Allah, ampunilah aku, rahmatilah aku, dan gabungkanlah aku dengan para sahabat yang mulia (di syurga).\"  (Lihat Surah An-Nisaa' 4:69)"
  },
  {
    "id": 5461,
    "hadith_number": 5461,
    "tajuk_hadith": "Doa Rasulullah SAW untuk Pesakit",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "Whenever Allah's Messenger (ﷺ) paid a visit to a patient, or a patient was brought to him, he used to invoke \nAllah, saying, \"Take away the disease, O the Lord of the people! Cure him as You are the One Who \ncures. There is no cure but Yours, a cure that leaves no disease.\"",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا أَتَى مَرِيضًا ـ أَوْ أُتِيَ بِهِ ـ قَالَ ‏\n\"‏ أَذْهِبِ الْبَاسَ رَبَّ النَّاسِ، اشْفِ وَأَنْتَ الشَّافِي لاَ شِفَاءَ إِلاَّ شِفَاؤُكَ، شِفَاءً لاَ يُغَادِرُ سَقَمًا ‏\"‏‏.‏ قَالَ عَمْرُو بْنُ أَبِي قَيْسٍ وَإِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ وَأَبِي الضُّحَى إِذَا أُتِيَ بِالْمَرِيضِ، وَقَالَ جَرِيرٌ عَنْ مَنْصُورٍ عَنْ أَبِي الضُّحَى وَحْدَهُ، وَقَالَ إِذَا أَتَى مَرِيضًا‏.‏",
    "malay_translation": "Apabila Rasulullah SAW melawat orang sakit, atau orang sakit dibawa kepada baginda, baginda akan berdoa kepada Allah SWT dengan berkata, \"Ya Allah, Tuhan sekalian manusia, hilangkanlah penyakit ini. Sembuhkanlah dia kerana Engkaulah yang menyembuhkan. Tiada kesembuhan melainkan kesembuhan daripadaMu, kesembuhan yang tidak meninggalkan sebarang penyakit.\""
  },
  {
    "id": 5462,
    "hadith_number": 5462,
    "tajuk_hadith": "Ziarah Nabi SAW Ketika Sakit dan Ayat Faraid",
    "perawi_melayu": "Dari Jabir bin Abdullah:",
    "english_text": "The Prophet (ﷺ) came to me while I was ill. He performed ablution and threw the remaining water on me \n(or said, \"Pour it on him) \" When I came to my senses I said, \"O Allah's Messenger (ﷺ)! I have no son or \nfather to be my heir, so how will be my inheritance?\" Then the Verse of inheritance was revealed.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ دَخَلَ عَلَىَّ النَّبِيُّ صلى الله عليه وسلم وَأَنَا مَرِيضٌ فَتَوَضَّأَ فَصَبَّ عَلَىَّ أَوْ قَالَ صُبُّوا عَلَيْهِ فَعَقَلْتُ فَقُلْتُ لاَ يَرِثُنِي إِلاَّ كَلاَلَةٌ، فَكَيْفَ الْمِيرَاثُ فَنَزَلَتْ آيَةُ الْفَرَائِضِ‏.‏",
    "malay_translation": "Nabi SAW telah datang menjengukku ketika aku sakit. Baginda berwuduk, kemudian menyiramkan air wuduk yang tinggal kepadaku (atau Baginda bersabda: “Siramkanlah kepadanya”). Setelah sedarku, aku berkata, “Wahai Rasulullah SAW!  Aku tidak mempunyai anak lelaki mahupun bapa untuk mewarisi harta pusakaku, jadi bagaimanakah hukum pewarisan bagiku?” Kemudian turunlah ayat faraid."
  },
  {
    "id": 5463,
    "hadith_number": 5463,
    "tajuk_hadith": "Doa Rasulullah SAW untuk Madinah",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتْ لَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم وُعِكَ أَبُو بَكْرٍ وَبِلاَلٌ قَالَتْ فَدَخَلْتُ عَلَيْهِمَا فَقُلْتُ يَا أَبَتِ كَيْفَ تَجِدُكَ وَيَا بِلاَلُ كَيْفَ تَجِدُكَ قَالَتْ وَكَانَ أَبُو بَكْرٍ إِذَا أَخَذَتْهُ الْحُمَّى يَقُولُ كُلُّ امْرِئٍ مُصَبَّحٌ فِي أَهْلِهِ وَالْمَوْتُ أَدْنَى مِنْ شِرَاكِ نَعْلِهِ وَكَانَ بِلاَلٌ إِذَا أُقْلِعَ عَنْهُ يَرْفَعُ عَقِيرَتَهُ فَيَقُولُ أَلاَ لَيْتَ شِعْرِي هَلْ أَبِيتَنَّ لَيْلَةً بِوَادٍ وَحَوْلِي إِذْخِرٌ وَجَلِيلُ وَهَلْ أَرِدَنْ يَوْمًا مِيَاهَ مِجَنَّةٍ وَهَلْ تَبْدُوَنْ لِي شَامَةٌ وَطَفِيلُ قَالَ قَالَتْ عَائِشَةُ فَجِئْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَخْبَرْتُهُ فَقَالَ ‏\n\"‏ اللَّهُمَّ حَبِّبْ إِلَيْنَا الْمَدِينَةَ كَحُبِّنَا مَكَّةَ أَوْ أَشَدَّ وَصَحِّحْهَا وَبَارِكْ لَنَا فِي صَاعِهَا وَمُدِّهَا وَانْقُلْ حُمَّاهَا فَاجْعَلْهَا بِالْجُحْفَةِ ‏\"‏‏.‏",
    "malay_translation": "Daripada Ismail, telah menceritakan kepadaku Malik, daripada Hisyam bin Urwah, daripada bapanya, daripada Aisyah r.a. bahawa dia berkata: “Apabila Rasulullah SAW tiba di Madinah, Abu Bakar dan Bilal sakit demam. Aku pun masuk menjenguk mereka dan berkata, ‘Wahai ayahku, bagaimana keadaanmu? Wahai Bilal, bagaimana keadaanmu?’  Abu Bakar apabila ditimpa demam selalu berkata, ‘Setiap orang akan kembali kepada keluarganya, dan kematian itu lebih dekat daripada tali kasutnya.’ Dan Bilal apabila demamnya reda, dia akan mengangkat suaranya dan berkata, ‘Alangkah baiknya jika aku dapat bermalam di lembah, dan di sekelilingku terdapat tumbuhan idhkhir dan jalil (dua jenis tumbuhan wangi). Alangkah baiknya jika aku dapat minum air Majanna, dan alangkah baiknya jika aku dapat melihat Syam dan Thafil (dua gunung di Mekah)!’  Aisyah berkata: Aku pun pergi kepada Rasulullah SAW dan memberitahukan baginda. Baginda bersabda, “Ya Allah, jadikanlah Madinah sebagai tempat yang dicintai di hati kami sama seperti Mekah atau lebih daripada itu, dan jadikanlah ia sihat, berkatilah kami dengan sukatan dan muddnya, dan pindahkanlah penyakit demamnya ke Al-Juhafah.”"
  }
]
