[
  {
    "id": 6526,
    "hadith_number": 6526,
    "tajuk_hadith": "Keimanan dan Perbuatan Tercela",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "Allah's Messenger (ﷺ) said, \"When an adulterer commits illegal sexual intercourse, then he is not a believer \nat the time he is doing it; and when somebody drinks an alcoholic drink, then he is not believer at the \ntime of drinking, and when a thief steals, he is not a believer at the time when he is stealing; and when \na robber robs and the people look at him, then he is not a believer at the time of doing it.\" Abu Huraira \nin another narration, narrated the same from the Prophet (ﷺ) with the exclusion of robbery.",
    "arabic_text": "حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَزْنِي الزَّانِي حِينَ يَزْنِي وَهْوَ مُؤْمِنٌ، وَلاَ يَشْرَبُ الْخَمْرَ حِينَ يَشْرَبُ وَهْوَ مُؤْمِنٌ، وَلاَ يَسْرِقُ حِينَ يَسْرِقُ وَهْوَ مُؤْمِنٌ، وَلاَ يَنْتَهِبُ نُهْبَةً يَرْفَعُ النَّاسُ إِلَيْهِ فِيهَا أَبْصَارَهُمْ وَهْوَ مُؤْمِنٌ ‏\"‏‏.‏ وَعَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ، إِلاَّ النُّهْبَةَ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Orang yang berzina ketika dia berzina, dia bukanlah seorang mukmin; dan orang yang meminum arak ketika dia meminumnya, dia bukanlah seorang mukmin; dan orang yang mencuri ketika dia mencuri, dia bukanlah seorang mukmin; dan orang yang merampas harta benda secara terang-terangan sehingga menarik perhatian orang ramai ketika dia merampasnya, dia bukanlah seorang mukmin.\"  Dalam riwayat lain daripada Abu Hurairah, beliau meriwayatkan yang serupa daripada Nabi SAW, kecuali perihal perampasan harta benda."
  },
  {
    "id": 6527,
    "hadith_number": 6527,
    "tajuk_hadith": "Nabi SAW Menyeksa Orang Mabuk",
    "perawi_melayu": "Anas bin Malik:",
    "english_text": "The Prophet (ﷺ) beat a drunk with palm-leaf stalks and shoes. And Abu Bakr gave (such a sinner) forty lashes.",
    "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا هِشَامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم ح حَدَّثَنَا آدَمُ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم ضَرَبَ فِي الْخَمْرِ بِالْجَرِيدِ وَالنِّعَالِ، وَجَلَدَ أَبُو بَكْرٍ أَرْبَعِينَ‏.‏",
    "malay_translation": "Dari Anas bin Malik r.a., bahawa Nabi SAW telah menyeksa orang yang mabuk dengan ranting pelepah kurma dan kasut.  Dan Abu Bakar telah menyeksa (orang yang berbuat dosa sedemikian) dengan empat puluh kali sebatan."
  },
  {
    "id": 6528,
    "hadith_number": 6528,
    "tajuk_hadith": "Pukulan terhadap An-Nu'man atau anaknya kerana mabuk",
    "perawi_melayu": "Riwayat `Uqba bin Al-Harith:",
    "english_text": "An-Nu`man or the son of An-Nu`man was brought to the Prophet (ﷺ) on a charge of drunkenness. So the \nProphet ordered all the men present in the house, to beat him. So all of them beat him, and I was also \none of them who beat him with shoes.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، عَنْ أَيُّوبَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عُقْبَةَ بْنِ الْحَارِثِ، قَالَ جِيءَ بِالنُّعَيْمَانِ أَوْ بِابْنِ النُّعَيْمَانِ شَارِبًا، فَأَمَرَ النَّبِيُّ صلى الله عليه وسلم مَنْ كَانَ بِالْبَيْتِ أَنْ يَضْرِبُوهُ‏.‏ قَالَ فَضَرَبُوهُ، فَكُنْتُ أَنَا فِيمَنْ ضَرَبَهُ بِالنِّعَالِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah, telah menceritakan kepada kami Abd al-Wahhab, dari Ayub, dari Ibnu Abi Malikah, dari Uqbah bin al-Harith, bahawa dia berkata: An-Nu'man atau anak An-Nu'man dibawa kepada Nabi SAW kerana dituduh mabuk. Maka Nabi SAW memerintahkan semua lelaki yang berada di rumah untuk memukulnya. Maka mereka semua memukulnya, dan aku juga antara mereka yang memukulnya dengan kasut."
  },
  {
    "id": 6529,
    "hadith_number": 6529,
    "tajuk_hadith": "Nabi SAW Memarah Orang Mabuk",
    "perawi_melayu": "Riwayat `Uqba bin Al-Harith:",
    "english_text": "An-Nu`man or the son of An-Nu`man was brought to the Prophet (ﷺ) in a state of intoxication. The \nProphet felt it hard (was angry) and ordered all those who were present in the house, to beat him. And \nthey beat him, using palm-leaf stalks and shoes, and I was among those who beat him.",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا وُهَيْبُ بْنُ خَالِدٍ، عَنْ أَيُّوبَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، عَنْ عُقْبَةَ بْنِ الْحَارِثِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أُتِيَ بِنُعَيْمَانَ أَوْ بِابْنِ نُعَيْمَانَ وَهْوَ سَكْرَانُ فَشَقَّ عَلَيْهِ، وَأَمَرَ مَنْ فِي الْبَيْتِ أَنْ يَضْرِبُوهُ، فَضَرَبُوهُ بِالْجَرِيدِ وَالنِّعَالِ، وَكُنْتُ فِيمَنْ ضَرَبَهُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Wahb bin Khalid, dari Ayyub, dari Abdullah bin Abi Malikah, dari Uqbah bin Al-Harith, bahawa Nabi SAW didatangi oleh Nu'aim atau anak Nu'aim dalam keadaan mabuk.  Baginda SAW berasa marah dan memerintahkan semua orang yang berada di rumah itu untuk memukulnya. Maka mereka memukulnya dengan pelepah kurma dan kasut, dan aku termasuk di antara mereka yang memukulnya."
  },
  {
    "id": 6530,
    "hadith_number": 6530,
    "tajuk_hadith": "Baginda SAW dan Abu Bakar Menyeksa Orang Mabuk",
    "perawi_melayu": "Dari Anas:",
    "english_text": "The Prophet (ﷺ) lashed a drunk with dateleaf stalks and shoes. And Abu Bakr gave a drunk forty lashes.",
    "arabic_text": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ، قَالَ جَلَدَ النَّبِيُّ صلى الله عليه وسلم فِي الْخَمْرِ بِالْجَرِيدِ وَالنِّعَالِ، وَجَلَدَ أَبُو بَكْرٍ أَرْبَعِينَ‏.‏",
    "malay_translation": "Dari Anas: Nabi SAW menyeksa orang mabuk dengan ranting kurma dan kasut.  Dan Abu Bakar menyeksa orang mabuk sebanyak empat puluh kali."
  },
  {
    "id": 6531,
    "hadith_number": 6531,
    "tajuk_hadith": " Hukuman Bagi Peminum Arak dan Larangan Mencela",
    "perawi_melayu": "Riwayat Abu Salama:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو ضَمْرَةَ، أَنَسٌ عَنْ يَزِيدَ بْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِرَجُلٍ قَدْ شَرِبَ قَالَ ‏\"‏ اضْرِبُوهُ ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ فَمِنَّا الضَّارِبُ بِيَدِهِ، وَالضَّارِبُ بِنَعْلِهِ، وَالضَّارِبُ بِثَوْبِهِ، فَلَمَّا انْصَرَفَ قَالَ بَعْضُ الْقَوْمِ أَخْزَاكَ اللَّهُ‏.‏ قَالَ ‏\"‏ لاَ تَقُولُوا هَكَذَا لاَ تُعِينُوا عَلَيْهِ الشَّيْطَانَ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah, telah menceritakan kepada kami Abu Dhamrah, Anas daripada Yazid bin Al-Had, daripada Muhammad bin Ibrahim, daripada Abu Salamah, daripada Abu Hurairah r.a., bahawa Nabi SAW didatangi oleh seorang lelaki yang telah meminum arak. Baginda bersabda: \"Pukul dia!\" Abu Hurairah berkata: \"Maka daripada kami ada yang memukulnya dengan tangan, dan ada yang memukulnya dengan kasut, dan ada yang memukulnya dengan kainnya (dengan memusingkannya) seperti cambuk. Kemudian apabila kami telah selesai, sebahagian daripada orang ramai berkata kepadanya: \"Semoga Allah menghinakan kamu!\" Baginda bersabda: \"Janganlah kamu berkata sedemikian, janganlah kamu membantu syaitan terhadapnya.\""
  },
  {
    "id": 6532,
    "hadith_number": 6532,
    "tajuk_hadith": "Hukuman dan Orang Mabuk",
    "perawi_melayu": "Daripada Ali bin Abi Talib:",
    "english_text": "I would not feel sorry for one who dies because of receiving a legal punishment, except the drunk, for if he should die (when being punished), I would give blood money to his family because no fixed punishment has been ordered by Allah's Messenger (ﷺ) for the drunk.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا أَبُو حَصِينٍ، سَمِعْتُ عُمَيْرَ بْنَ سَعِيدٍ النَّخَعِيَّ، قَالَ سَمِعْتُ عَلِيَّ بْنَ أَبِي طَالِبٍ ـ رضى الله عنه ـ قَالَ مَا كُنْتُ لأُقِيمَ حَدًّا عَلَى أَحَدٍ فَيَمُوتَ، فَأَجِدَ فِي نَفْسِي، إِلاَّ صَاحِبَ الْخَمْرِ، فَإِنَّهُ لَوْ مَاتَ وَدَيْتُهُ، وَذَلِكَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يَسُنَّهُ‏.‏",
    "malay_translation": "Aku tidak akan berasa sedih bagi seseorang yang mati akibat menerima hukuman syarak, kecuali bagi peminum arak.  Sekiranya dia mati (ketika dihukum), aku akan membayar diat (wang ganti rugi) kepada keluarganya kerana Rasulullah ﷺ tidak menetapkan hukuman tetap bagi peminum arak."
  },
  {
    "id": 6533,
    "hadith_number": 6533,
    "tajuk_hadith": " Hukuman Bagi Peminum Arak Pada Zaman Rasulullah SAW dan Khulafa' Rasyidin",
    "perawi_melayu": "Riwayat As-Sa'ib bin Yazid:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مَكِّيُّ بْنُ إِبْرَاهِيمَ، عَنِ الْجُعَيْدِ، عَنْ يَزِيدَ بْنِ خُصَيْفَةَ، عَنِ السَّائِبِ بْنِ يَزِيدَ، قَالَ كُنَّا نُؤْتَى بِالشَّارِبِ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَإِمْرَةِ أَبِي بَكْرٍ وَصَدْرًا مِنْ خِلاَفَةِ عُمَرَ، فَنَقُومُ إِلَيْهِ بِأَيْدِينَا وَنِعَالِنَا وَأَرْدِيَتِنَا، حَتَّى كَانَ آخِرُ إِمْرَةِ عُمَرَ، فَجَلَدَ أَرْبَعِينَ، حَتَّى إِذَا عَتَوْا وَفَسَقُوا جَلَدَ ثَمَانِينَ‏.‏",
    "malay_translation": "Kami telah dimaklumkan oleh Makki bin Ibrahim, daripada Al-Ju'aid, daripada Yazid bin Khushaifah, daripada As-Sa'ib bin Yazid, katanya: \"Pada zaman Rasulullah SAW, pemerintahan Abu Bakar dan awal pemerintahan Umar, kami akan menghukum orang yang minum arak dengan tangan, kasut dan pakaian kami (dengan memusingkannya menjadi seperti cambuk).  Namun, pada penghujung pemerintahan Umar, hukumannya ialah sebatan empat puluh kali. Dan apabila mereka (peminum arak) menjadi degil dan melakukan maksiat, hukumannya ialah sebatan lapan puluh kali.\""
  },
  {
    "id": 6534,
    "hadith_number": 6534,
    "tajuk_hadith": "Kecintaan kepada Allah dan Rasul",
    "perawi_melayu": "Riwayat Umar bin Al-Khattab:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي خَالِدُ بْنُ يَزِيدَ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، أَنَّ رَجُلاً، عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم كَانَ اسْمُهُ عَبْدَ اللَّهِ، وَكَانَ يُلَقَّبُ حِمَارًا، وَكَانَ يُضْحِكُ رَسُولَ اللَّهِ صلى الله عليه وسلم، وَكَانَ النَّبِيُّ صلى الله عليه وسلم قَدْ جَلَدَهُ فِي الشَّرَابِ، فَأُتِيَ بِهِ يَوْمًا فَأَمَرَ بِهِ فَجُلِدَ، فَقَالَ رَجُلٌ مِنَ الْقَوْمِ اللَّهُمَّ الْعَنْهُ مَا أَكْثَرَ مَا يُؤْتَى بِهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ تَلْعَنُوهُ، فَوَاللَّهِ مَا عَلِمْتُ أَنَّهُ يُحِبُّ اللَّهَ وَرَسُولَهُ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Yahya bin Bukair, telah menceritakan kepadaku Laits, katanya telah menceritakan kepadaku Khalid bin Yazid, daripada Said bin Abi Hilal, daripada Zaid bin Aslam, daripada bapanya, daripada Umar bin Al-Khattab, bahawa pada zaman Nabi SAW, ada seorang lelaki bernama Abdullah, dan dia digelar Himar (Keldai), dan dia selalu membuat Rasulullah SAW ketawa. Nabi SAW pernah menyebatnya kerana minum arak. Kemudian, pada suatu hari dia dibawa lagi kepada Nabi SAW atas tuduhan yang sama dan disebat. Maka, seorang lelaki daripada orang ramai berkata, \"Ya Allah, laknatkanlah dia! Betapa kerapnya dia dibawa (kepada Nabi SAW atas tuduhan sebegini)!\"  Maka Nabi SAW bersabda, \"Janganlah kamu melaknatinya, demi Allah, sesungguhnya aku tahu bahawa dia mencintai Allah dan Rasul-Nya.\""
  },
  {
    "id": 6535,
    "hadith_number": 6535,
    "tajuk_hadith": "Jangan Membantu Syaitan Terhadap Saudara Muslim",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "A drunk was brought to the Prophet (ﷺ) and he ordered him to be beaten (lashed). Some of us beat him \nwith our hands, and some with their shoes, and some with their garments (twisted in the form of a \nlash). When that drunk had left, a man said, \"What is wrong with him? May Allah disgrace him!\" \nAllah's Messenger (ﷺ) said, \"Do not help Satan against your (Muslim) brother.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، حَدَّثَنَا ابْنُ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِسَكْرَانَ، فَأَمَرَ بِضَرْبِهِ، فَمِنَّا مَنْ يَضْرِبُهُ بِيَدِهِ، وَمِنَّا مَنْ يَضْرِبُهُ بِنَعْلِهِ، وَمِنَّا مَنْ يَضْرِبُهُ بِثَوْبِهِ، فَلَمَّا انْصَرَفَ قَالَ رَجُلٌ مَالَهُ أَخْزَاهُ اللَّهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَكُونُوا عَوْنَ الشَّيْطَانِ عَلَى أَخِيكُمْ ‏\"‏‏.‏",
    "malay_translation": "Seorang yang mabuk dibawa kepada Nabi SAW, lalu baginda memerintahkan supaya dia disebat.  Antara kami ada yang menebasnya dengan tangan, ada yang dengan kasut, dan ada yang dengan kain (dipilin seperti sebatan). Setelah orang mabuk itu pergi, seorang lelaki berkata, \"Apa kesalahannya? Semoga Allah menghinakannya!\" Rasulullah SAW bersabda, \"Janganlah kamu menjadi penolong syaitan terhadap saudaramu.\""
  },
  {
    "id": 6536,
    "hadith_number": 6536,
    "tajuk_hadith": "Keimanan dan Zina serta Kecurian",
    "perawi_melayu": "Riwayat Ibnu Abbas",
    "english_text": "The Prophet (ﷺ) said, \"When (a person) an adulterer commits illegal sexual intercourse then he is not a \nbeliever at the time he is doing it; and when somebody steals, then he is not a believer at the time he is \nstealing.\"",
    "arabic_text": "حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ، حَدَّثَنَا فُضَيْلُ بْنُ غَزْوَانَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَزْنِي الزَّانِي حِينَ يَزْنِي وَهْوَ مُؤْمِنٌ، وَلاَ يَسْرِقُ حِينَ يَسْرِقُ وَهْوَ مُؤْمِنٌ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Seseorang yang berzina ketika dia berzina, dia bukanlah seorang mukmin pada ketika itu; dan seseorang yang mencuri ketika dia mencuri, dia bukanlah seorang mukmin pada ketika itu.\""
  },
  {
    "id": 6537,
    "hadith_number": 6537,
    "tajuk_hadith": "Laknat Allah ke atas Pencuri",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \"Allah curses a man who steals an egg and gets his hand cut off, or steals a rope and \ngets his hands cut off.\" Al-A`mash said, \"People used to interpret the Baida as an iron helmet, and \nthey used to think that the rope may cost a few dirhams.\"",
    "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنِي أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ سَمِعْتُ أَبَا صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَعَنَ اللَّهُ السَّارِقَ، يَسْرِقُ الْبَيْضَةَ فَتُقْطَعُ يَدُهُ، وَيَسْرِقُ الْحَبْلَ فَتُقْطَعُ يَدُهُ ‏\"‏‏.‏ قَالَ الأَعْمَشُ كَانُوا يَرَوْنَ أَنَّهُ بَيْضُ الْحَدِيدِ، وَالْحَبْلُ كَانُوا يَرَوْنَ أَنَّهُ مِنْهَا مَا يَسْوَى دَرَاهِمَ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Allah melaknat orang yang mencuri telur lalu tangannya dipotong, dan orang yang mencuri tali lalu tangannya dipotong.\" Al-A'mash berkata: \"Orang ramai ketika itu mentafsirkan 'Baidhah' sebagai topi besi, dan mereka menyangka tali itu bernilai beberapa dirham.\""
  },
  {
    "id": 6538,
    "hadith_number": 6538,
    "tajuk_hadith": "Bai'ah untuk Tidak Syirik, Mencuri dan Berzina",
    "perawi_melayu": "Riwayat Ubadah bin As-Samit:",
    "english_text": "We were with the Prophet (ﷺ) in a gathering and he said, 'Swear allegiance to me that you will not \nworship anything besides Allah, Will not steal, and will not commit illegal sexual intercourse.\" And \nthen (the Prophet) recited the whole Verse (i.e. 60:12). The Prophet (ﷺ) added, 'And whoever among you \nfulfills his pledge, his reward is with Allah; and whoever commits something of such sins and receives \nthe legal punishment for it, that will be considered as the expiation for that sin, and whoever commits \nsomething of such sins and Allah screens him, it is up to Allah whether to excuse or punish him.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ ـ رضى الله عنه ـ قَالَ كُنَّا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فِي مَجْلِسٍ فَقَالَ ‏\"‏ بَايِعُونِي عَلَى أَنْ لاَ تُشْرِكُوا بِاللَّهِ شَيْئًا وَلاَ تَسْرِقُوا، وَلاَ تَزْنُوا ‏\"‏‏.‏ وَقَرَأَ هَذِهِ الآيَةَ كُلَّهَا ‏\"‏ فَمَنْ وَفَى مِنْكُمْ فَأَجْرُهُ عَلَى اللَّهِ وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا فَعُوقِبَ بِهِ، فَهْوَ كَفَّارَتُهُ، وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا، فَسَتَرَهُ اللَّهُ عَلَيْهِ، إِنْ شَاءَ غَفَرَ لَهُ، وَإِنْ شَاءَ عَذَّبَهُ ‏\"‏‏.‏",
    "malay_translation": "Kami berada bersama Nabi ﷺ dalam satu majlis, baginda bersabda: \"Berjanjilah kamu kepadaku bahawa kamu tidak akan menyekutukan Allah dengan sesuatu pun, tidak akan mencuri, dan tidak akan berzina.\"  Kemudian Nabi ﷺ membacakan seluruh ayat ini (maksudnya 60:12):  \"Maka sesiapa di antara kamu yang menunaikan janjinya, maka pahalanya adalah daripada Allah; dan sesiapa yang melakukan sesuatu daripada dosa-dosa itu dan dikenakan hukuman, maka ia menjadi kafarah baginya; dan sesiapa yang melakukan sesuatu daripada dosa-dosa itu, dan Allah menutup keadaannya, maka adalah hak Allah sama ada mengampunkan atau mengazabnya.\""
  },
  {
    "id": 6539,
    "hadith_number": 6539,
    "tajuk_hadith": "Kesucian Darah, Harta, dan Maruah",
    "perawi_melayu": "Riwayat Abdullah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا عَاصِمُ بْنُ عَلِيٍّ، حَدَّثَنَا عَاصِمُ بْنُ مُحَمَّدٍ، عَنْ وَاقِدِ بْنِ مُحَمَّدٍ، سَمِعْتُ أَبِي قَالَ عَبْدُ اللَّهِ، قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ ‏\"‏ أَلاَ أَىُّ شَهْرٍ تَعْلَمُونَهُ أَعْظَمُ حُرْمَةً ‏\"‏‏.‏ قَالُوا أَلاَ شَهْرُنَا هَذَا‏.‏ قَالَ ‏\"‏ أَلاَ أَىُّ بَلَدٍ تَعْلَمُونَهُ أَعْظَمُ حُرْمَةً ‏\"‏‏.‏ قَالُوا أَلاَ بَلَدُنَا هَذَا‏.‏ قَالَ ‏\"‏ أَلاَ أَىُّ يَوْمٍ تَعْلَمُونَهُ أَعْظَمُ حُرْمَةً ‏\"‏‏.‏ قَالُوا أَلاَ يَوْمُنَا هَذَا‏.‏ قَالَ ‏\"‏ فَإِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَدْ حَرَّمَ دِمَاءَكُمْ وَأَمْوَالَكُمْ وَأَعْرَاضَكُمْ، إِلاَّ بِحَقِّهَا، كَحُرْمَةِ يَوْمِكُمْ هَذَا، فِي بَلَدِكُمْ هَذَا، فِي شَهْرِكُمْ هَذَا، أَلاَ هَلْ بَلَّغْتُ ‏\"‏‏.‏ ـ ثَلاَثًا كُلُّ ذَلِكَ يُجِيبُونَهُ أَلاَ نَعَمْ ـ قَالَ ‏\"‏ وَيْحَكُمْ ـ أَوْ وَيْلَكُمْ ـ لاَ تَرْجِعُنَّ بَعْدِي كُفَّارًا، يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Muhammad bin Abdullah, telah menceritakan kepada kami Ashim bin Ali, telah menceritakan kepada kami Ashim bin Muhammad, dari Wakid bin Muhammad, aku mendengar bapaku berkata, Abdullah berkata, Rasulullah SAW bersabda ketika Haji Wada': \"Wahai manusia, bulan apakah yang paling suci menurut kamu?\" Mereka menjawab, \"Bulan kami ini.\" Baginda bertanya lagi, \"Wahai manusia, kota manakah yang paling suci menurut kamu?\" Mereka menjawab, \"Kota kami ini.\" Baginda bertanya lagi, \"Wahai manusia, hari manakah yang paling suci menurut kamu?\" Mereka menjawab, \"Hari kami ini.\" Baginda bersabda, \"Sesungguhnya Allah SWT telah mengharamkan darah, harta benda dan maruah kamu, kecuali dengan haknya, seperti kesucian hari kamu ini, di kota kamu ini, di bulan kamu ini.  Adakah aku telah menyampaikan (pesan Allah)?\" Baginda mengulangi tiga kali, dan setiap kali mereka menjawab, \"Ya.\" Baginda kemudian bersabda, \"Celaka kamu! Janganlah kamu kembali kepada kekafiran setelah aku, lalu membunuh antara satu sama lain.\""
  },
  {
    "id": 6540,
    "hadith_number": 6540,
    "tajuk_hadith": "Nabi SAW Memilih Perkara Yang Lebih Mudah dan Mencegah Kemungkaran",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "Whenever the Prophet (ﷺ) was given an option between two things, he used to select the easier of the tow \nas long as it was not sinful; but if it was sinful, he would remain far from it. By Allah, he never took \nrevenge for himself concerning any matter that was presented to him, but when Allah's Limits were \ntransgressed, he would take revenge for Allah's Sake.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا خُيِّرَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ أَمْرَيْنِ إِلاَّ اخْتَارَ أَيْسَرَهُمَا، مَا لَمْ يَأْثَمْ، فَإِذَا كَانَ الإِثْمُ كَانَ أَبْعَدَهُمَا مِنْهُ، وَاللَّهِ مَا انْتَقَمَ لِنَفْسِهِ فِي شَىْءٍ يُؤْتَى إِلَيْهِ قَطُّ، حَتَّى تُنْتَهَكَ حُرُمَاتُ اللَّهِ، فَيَنْتَقِمُ لِلَّهِ‏.‏",
    "malay_translation": "Daripada Aisyah r.a. berkata:  Rasulullah SAW jika diberi pilihan antara dua perkara, baginda memilih yang lebih mudah, selagi ia tidak berdosa.  Jika ia melibatkan dosa, baginda akan menjauhinya. Demi Allah, baginda tidak pernah membalas dendam untuk diri baginda sendiri dalam apa jua perkara yang sampai kepada baginda, sehingga batas-batas Allah dilanggar, maka baginda akan membalas dendam kerana Allah."
  },
  {
    "id": 6541,
    "hadith_number": 6541,
    "tajuk_hadith": "Keadilan Hukuman Allah SWT",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "Usama approached the Prophet (ﷺ) on behalf of a woman (who had committed theft). The Prophet (ﷺ) said, \n\"The people before you were destroyed because they used to inflict the legal punishments on the poor \nand forgive the rich. By Him in Whose Hand my soul is! If Fatima (the daughter of the Prophet (ﷺ) ) did \nthat (i.e. stole), I would cut off her hand.\"",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ أُسَامَةَ، كَلَّمَ النَّبِيَّ صلى الله عليه وسلم فِي امْرَأَةٍ فَقَالَ ‏\n\"‏ إِنَّمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ أَنَّهُمْ كَانُوا يُقِيمُونَ الْحَدَّ عَلَى الْوَضِيعِ، وَيَتْرُكُونَ الشَّرِيفَ، وَالَّذِي نَفْسِي بِيَدِهِ لَوْ فَاطِمَةُ فَعَلَتْ ذَلِكَ لَقَطَعْتُ يَدَهَا ‏\"‏‏.‏",
    "malay_translation": "Usamah menghampiri Nabi SAW bagi pihak seorang wanita (yang telah mencuri). Nabi SAW bersabda, \"Sesungguhnya umat-umat sebelum kamu telah binasa kerana mereka telah melaksanakan hukuman hudud ke atas orang yang lemah dan melepaskan orang yang mulia. Demi Zat yang jiwaku berada di tangan-Nya, sekiranya Fatimah pun melakukan perkara itu (iaitu mencuri), nescaya aku akan memotong tangannya.\""
  },
  {
    "id": 6542,
    "hadith_number": 6542,
    "tajuk_hadith": "Keadilan di Hadapan Allah: Tiada Pengecualian",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ قُرَيْشًا، أَهَمَّتْهُمُ الْمَرْأَةُ الْمَخْزُومِيَّةُ الَّتِي سَرَقَتْ فَقَالُوا مَنْ يُكَلِّمُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَمَنْ يَجْتَرِئُ عَلَيْهِ إِلاَّ أُسَامَةُ حِبُّ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَكَلَّمَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَتَشْفَعُ فِي حَدٍّ مِنْ حُدُودِ اللَّهِ ‏\"‏‏.‏ ثُمَّ قَامَ فَخَطَبَ قَالَ ‏\"‏ يَا أَيُّهَا النَّاسُ إِنَّمَا ضَلَّ مَنْ قَبْلَكُمْ أَنَّهُمْ كَانُوا إِذَا سَرَقَ الشَّرِيفُ تَرَكُوهُ، وَإِذَا سَرَقَ الضَّعِيفُ فِيهِمْ أَقَامُوا عَلَيْهِ الْحَدَّ، وَايْمُ اللَّهِ لَوْ أَنَّ فَاطِمَةَ بِنْتَ مُحَمَّدٍ سَرَقَتْ لَقَطَعَ مُحَمَّدٌ يَدَهَا ‏\"‏‏.‏",
    "malay_translation": "Daripada Aisyah r.a. bahawa kaum Quraisy amat bimbang dengan wanita dari kabilah Makhzumiyah yang mencuri. Mereka berkata, \"Siapakah yang berani bercakap dengan Rasulullah SAW? Dan siapakah yang berani melakukannya kecuali Usamah, kesayangan Rasulullah SAW?\" Maka Usamah bercakap dengan Rasulullah SAW, lalu Baginda bertanya, \"Adakah engkau ingin bersyafaat dalam hal hukuman Allah?\" Kemudian Baginda berdiri dan berkhutbah, seraya berkata, \"Wahai manusia! Sesungguhnya umat-umat sebelum kamu sesat kerana apabila orang yang mulia mencuri, mereka membiarkannya, tetapi apabila orang yang lemah mencuri, mereka tetap melaksanakan hukuman. Demi Allah, sekiranya Fatimah binti Muhammad mencuri, nescaya Muhammad akan memotong tangannya!\""
  },
  {
    "id": 6543,
    "hadith_number": 6543,
    "tajuk_hadith": "Hukuman Mencuri",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "The Prophet (ﷺ) said, \"The hand should be cut off for stealing something that is worth a quarter of a Dinar or more.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ تُقْطَعُ الْيَدُ فِي رُبُعِ دِينَارٍ فَصَاعِدًا ‏\"‏‏.‏ تَابَعَهُ عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ وَابْنُ أَخِي الزُّهْرِيِّ وَمَعْمَرٌ عَنِ الزُّهْرِيِّ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Tangan akan dipotong bagi pencuri yang mencuri sesuatu yang bernilai seperempat dinar atau lebih.\""
  },
  {
    "id": 6544,
    "hadith_number": 6544,
    "tajuk_hadith": "Hukuman Potong Tangan Pencuri",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "The Prophet (ﷺ) said, \"The hand of a thief should be cut off for stealing a quarter of a Dinar.\"",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، عَنِ ابْنِ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، وَعَمْرَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ تُقْطَعُ يَدُ السَّارِقِ فِي رُبُعِ دِينَارٍ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Tangan pencuri dipotong kerana mencuri seperempat dinar.\""
  },
  {
    "id": 6545,
    "hadith_number": 6545,
    "tajuk_hadith": "Hukuman Mencuri: Memotong Tangan",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "The Prophet (ﷺ) said, \"The hand should be cut off for stealing a quarter of a Dinar.\"",
    "arabic_text": "حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا الْحُسَيْنُ، عَنْ يَحْيَى، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ الأَنْصَارِيِّ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، حَدَّثَتْهُ أَنَّ عَائِشَةَ ـ رضى الله عنها ـ حَدَّثَتْهُمْ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يُقْطَعُ فِي رُبُعِ دِينَارٍ ‏\"‏‏.‏",
    "malay_translation": "Daripada Aisyah r.a., bahawa Nabi SAW bersabda: \"Tangan dipotong kerana mencuri seperempat dinar.\""
  },
  {
    "id": 6546,
    "hadith_number": 6546,
    "tajuk_hadith": "Pemotongan Tangan Pencuri pada Zaman Nabi SAW",
    "perawi_melayu": "Riwayat Aisyah:",
    "english_text": "The hand of a thief was not cut off during the lifetime of the Prophet (ﷺ) except for stealing something \nequal to a shield in value.\n\n\nA similar hadith is narrated from `Aisha through another chain.",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، قَالَ أَخْبَرَتْنِي عَائِشَةُ، أَنَّ يَدَ السَّارِقِ، لَمْ تُقْطَعْ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم إِلاَّ فِي ثَمَنِ مِجَنٍّ حَجَفَةٍ أَوْ تُرْسٍ‏.‏ \nحَدَّثَنَا عُثْمَانُ، حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، مِثْلَهُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Usman bin Abi Syaibah, telah menceritakan kepada kami Abidah, dari Hisyam, dari bapanya, dia berkata: Aisyah telah memberitakan kepadaku bahawa tangan pencuri tidak dipotong pada zaman Nabi SAW kecuali untuk mencuri sesuatu yang bersamaan dengan nilai perisai.\n\nTelah menceritakan kepada kami Usman, telah menceritakan kepada kami Humaid bin Abdur Rahman, telah menceritakan kepada kami Hisyam, dari bapanya, dari Aisyah, (berisi) yang serupa."
  },
  {
    "id": 6547,
    "hadith_number": 6547,
    "tajuk_hadith": "Tangan Pencuri Tidak Dipotong untuk Mencuri Barang Murah",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "A thief's hand was not cut off for stealing something cheaper than a Hajafa or a Turs (two kinds of shields), each of which was worth a (respectable) price.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ لَمْ تَكُنْ تُقْطَعُ يَدُ السَّارِقِ فِي أَدْنَى مِنْ حَجَفَةٍ أَوْ تُرْسٍ، كُلُّ وَاحِدٍ مِنْهُمَا ذُو ثَمَنٍ‏.‏ رَوَاهُ وَكِيعٌ وَابْنُ إِدْرِيسَ عَنْ هِشَامٍ عَنْ أَبِيهِ مُرْسَلاً‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Muqatil, telah memberitakan kepada kami Abdullah, telah memberitakan kepada kami Hisyam bin Urwah, dari bapanya, dari Aisyah, dia berkata: \"Tangan pencuri tidak dipotong untuk mencuri sesuatu yang lebih murah daripada Hajafah atau Turs (dua jenis perisai), setiap satunya mempunyai harga yang lumayan.\""
  },
  {
    "id": 6548,
    "hadith_number": 6548,
    "tajuk_hadith": "Tangan Pencuri Tidak Dipotong Untuk Kecurian Benda Bernilai Rendah",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "A thief's hand was not cut off for stealing something worth less than the price of a shield, whether a \nTurs or Hajafa (two kinds of shields), each of which was worth a (respectable) price.",
    "arabic_text": "حَدَّثَنِي يُوسُفُ بْنُ مُوسَى، حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ هِشَامُ بْنُ عُرْوَةَ أَخْبَرَنَا عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَمْ تُقْطَعْ يَدُ سَارِقٍ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم فِي أَدْنَى مِنْ ثَمَنِ الْمِجَنِّ، تُرْسٍ أَوْ حَجَفَةٍ، وَكَانَ كُلُّ وَاحِدٍ مِنْهُمَا ذَا ثَمَنٍ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Yusuf bin Musa, telah menceritakan kepada kami Abu Usamah, telah berkata Hisyam bin Urwah, telah memberitakan kepada kami daripada bapanya, daripada Aisyah r.a., katanya: \"Tidak dipotong tangan pencuri pada zaman Nabi SAW bagi sesuatu yang nilainya kurang daripada harga perisai, sama ada Turs atau Hajafah (dua jenis perisai), dan setiap satunya mempunyai harga yang lumayan.\""
  },
  {
    "id": 6549,
    "hadith_number": 6549,
    "tajuk_hadith": "Rasulullah SAW Memotong Tangan Pencuri",
    "perawi_melayu": "Riwayat Ibnu Umar:",
    "english_text": "Allah's Messenger (ﷺ) cut off the hand of a thief for stealing a shield that was worth three Dirhams.",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكُ بْنُ أَنَسٍ، عَنْ نَافِعٍ، مَوْلَى عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَطَعَ فِي مِجَنٍّ ثَمَنُهُ ثَلاَثَةُ دَرَاهِمَ‏.‏ \nتَابَعَهُ مُحَمَّدُ بْنُ إِسْحَاقَ وَقَالَ اللَّيْثُ حَدَّثَنِي نَافِعٌ قِيمَتُهُ",
    "malay_translation": "Telah menceritakan kepada kami Ismail, telah menceritakan kepadaku Malik bin Anas, dari Nafi', hamba Abdullah bin Umar, dari Abdullah bin Umar r.a., bahawa Rasulullah SAW telah memotong tangan seorang pencuri kerana mencuri sebuah perisai yang bernilai tiga dirham.\n Muhammad bin Ishaq turut meriwayatkannya, dan berkata Laits: telah menceritakan kepadaku Nafi', harganya..."
  },
  {
    "id": 6550,
    "hadith_number": 6550,
    "tajuk_hadith": "Pemotongan Tangan Pencuri",
    "perawi_melayu": "Daripada Ibnu Umar:",
    "english_text": "The Prophet (ﷺ) cut off the hand of a thief for stealing a shield that was worth three Dirhams.",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَطَعَ النَّبِيُّ صلى الله عليه وسلم فِي مِجَنٍّ ثَمَنُهُ ثَلاَثَةُ دَرَاهِمَ‏.‏",
    "malay_translation": "Daripada Ibnu Umar, beliau berkata: Rasulullah SAW telah memotong tangan seorang pencuri kerana mencuri perisai yang bernilai tiga dirham."
  },
  {
    "id": 6551,
    "hadith_number": 6551,
    "tajuk_hadith": "Potongan Tangan Pencuri",
    "perawi_melayu": "Riwayat Abdullah bin Umar:",
    "english_text": "The Prophet (ﷺ) cut off the hand of a thief for stealing a shield that was worth three Dirhams.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ، قَالَ قَطَعَ النَّبِيُّ صلى الله عليه وسلم فِي مِجَنٍّ ثَمَنُهُ ثَلاَثَةُ دَرَاهِمَ‏.‏",
    "malay_translation": "Rasulullah SAW telah memotong tangan seorang pencuri kerana mencuri perisai yang bernilai tiga dirham."
  },
  {
    "id": 6552,
    "hadith_number": 6552,
    "tajuk_hadith": "Pemotongan Tangan Pencuri",
    "perawi_melayu": "Riwayat Abdullah bin Umar:",
    "english_text": "The Prophet (ﷺ) cutoff the hand of a thief for stealing a shield that was worth three Dirhams.",
    "arabic_text": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَبُو ضَمْرَةَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَطَعَ النَّبِيُّ صلى الله عليه وسلم يَدَ سَارِقٍ فِي مِجَنٍّ ثَمَنُهُ ثَلاَثَةُ دَرَاهِمَ‏.‏ تَابَعَهُ مُحَمَّدُ بْنُ إِسْحَاقَ، وَقَالَ اللَّيْثُ حَدَّثَنِي نَافِعٌ ‏\n\"‏ قِيمَتُهُ ‏\"‏‏.‏",
    "malay_translation": "Daripada Ibrahim bin Munzir, telah menceritakan kepada kami Abu Dhamrah, telah menceritakan kepada kami Musa bin Uqbah, daripada Nafi', bahawa Abdullah bin Umar r.a. berkata: Nabi SAW telah memotong tangan seorang pencuri kerana mencuri sebuah perisai yang bernilai tiga dirham.  Muhammad bin Ishaq turut meriwayatkannya, dan Laith berkata: Nafi' telah menceritakan kepadaku, “nilainya…”."
  },
  {
    "id": 6553,
    "hadith_number": 6553,
    "tajuk_hadith": "Laknat Allah ke atas Pencuri",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "Allah 's Apostle said, \"Allah curses the thief who steals an egg (or a helmet) for which his hand is to \nbe cut off, or steals a rope, for which his hand is to be cut off.\"",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الأَعْمَشُ، قَالَ سَمِعْتُ أَبَا صَالِحٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَعَنَ اللَّهُ السَّارِقَ، يَسْرِقُ الْبَيْضَةَ فَتُقْطَعُ يَدُهُ، وَيَسْرِقُ الْحَبْلَ فَتُقْطَعُ يَدُهُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Allah melaknat pencuri yang mencuri telur (atau topi keledar) sehingga tangannya dipotong, dan yang mencuri tali sehingga tangannya dipotong.\""
  },
  {
    "id": 6554,
    "hadith_number": 6554,
    "tajuk_hadith": "Taubat Seorang Wanita",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "The Prophet (ﷺ) cut off the hand of a lady, and that lady used to come to me, and I used to convey her \nmessage to the Prophet (ﷺ) and she repented, and her repentance was sincere.",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَطَعَ يَدَ امْرَأَةٍ‏.‏ قَالَتْ عَائِشَةُ وَكَانَتْ تَأْتِي بَعْدَ ذَلِكَ، فَأَرْفَعُ حَاجَتَهَا إِلَى النَّبِيِّ صلى الله عليه وسلم فَتَابَتْ وَحَسُنَتْ تَوْبَتُهَا‏.‏",
    "malay_translation": "Daripada Aisyah r.a., bahawa Nabi SAW telah memotong tangan seorang wanita.  Aisyah berkata, wanita itu datang kepadaku selepas itu, lalu aku sampaikan hajatnya kepada Nabi SAW. Kemudian wanita itu bertaubat dan taubatnya diterima dengan baik."
  },
  {
    "id": 6555,
    "hadith_number": 6555,
    "tajuk_hadith": "Janji Setia dan Pengampunan Allah",
    "perawi_melayu": "Riwayat Ubadah bin As-Samit:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْجُعْفِيُّ، حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي إِدْرِيسَ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ ـ رضى الله عنه ـ قَالَ بَايَعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي رَهْطٍ، فَقَالَ ‏\n\"‏ أُبَايِعُكُمْ عَلَى أَنْ لاَ تُشْرِكُوا بِاللَّهِ شَيْئًا، وَلاَ تَسْرِقُوا، وَلاَ تَقْتُلُوا أَوْلاَدَكُمْ، وَلاَ تَأْتُوا بِبُهْتَانٍ تَفْتَرُونَهُ بَيْنَ أَيْدِيكُمْ وَأَرْجُلِكُمْ، وَلاَ تَعْصُونِي فِي مَعْرُوفٍ، فَمَنْ وَفَى مِنْكُمْ فَأَجْرُهُ عَلَى اللَّهِ، وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا فَأُخِذَ بِهِ فِي الدُّنْيَا فَهْوَ كَفَّارَةٌ لَهُ وَطَهُورٌ، وَمَنْ سَتَرَهُ اللَّهُ فَذَلِكَ إِلَى اللَّهِ، إِنْ شَاءَ عَذَّبَهُ وَإِنْ شَاءَ غَفَرَ لَهُ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ إِذَا تَابَ السَّارِقُ بَعْدَ مَا قُطِعَ يَدُهُ، قُبِلَتْ شَهَادَتُهُ، وَكُلُّ مَحْدُودٍ كَذَلِكَ إِذَا تَابَ قُبِلَتْ شَهَادَتُهُ‏.‏",
    "malay_translation": "Kami telah memberi bai'ah kepada Rasulullah SAW bersama sekumpulan manusia, lalu baginda bersabda: \"Aku mengambil bai'ah kamu supaya kamu tidak menyekutukan Allah dengan sesuatu pun, tidak mencuri, tidak membunuh anak-anak kamu, tidak mengada-adakan tuduhan palsu di antara tangan dan kaki kamu, dan tidak menderhaka kepadaku dalam kebaikan. Barangsiapa di antara kamu yang menunaikan semua ini, maka pahalanya adalah daripada Allah. Dan barangsiapa yang melakukan salah satu dari perkara-perkara itu dan dihukum di dunia, maka ia adalah kafarah dan penyucian baginya. Dan barangsiapa yang Allah menutup keadaannya, maka ia adalah terpulang kepada Allah, jika Allah mahu, Allah akan mengazabnya dan jika Allah mahu, Allah akan mengampuninya.\" Abu Abdullah berkata: \"Jika pencuri bertaubat setelah tangannya dipotong, maka diterima kesaksiannya. Begitu juga, setiap orang yang dikenakan hukuman, jika bertaubat, maka diterima kesaksiannya.\""
  },
  {
    "id": 6556,
    "hadith_number": 6556,
    "tajuk_hadith": "Orang-orang Ukul yang Murtad",
    "perawi_melayu": "Anas meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا الأَوْزَاعِيُّ، حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي أَبُو قِلاَبَةَ الْجَرْمِيُّ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَدِمَ عَلَى النَّبِيِّ صلى الله عليه وسلم نَفَرٌ مِنْ عُكْلٍ، فَأَسْلَمُوا فَاجْتَوَوُا الْمَدِينَةَ، فَأَمَرَهُمْ أَنْ يَأْتُوا إِبِلَ الصَّدَقَةِ، فَيَشْرَبُوا مِنْ أَبْوَالِهَا وَأَلْبَانِهَا، فَفَعَلُوا فَصَحُّوا، فَارْتَدُّوا وَقَتَلُوا رُعَاتَهَا وَاسْتَاقُوا، فَبَعَثَ فِي آثَارِهِمْ فَأُتِيَ بِهِمْ، فَقَطَعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ وَسَمَلَ أَعْيُنَهُمْ، ثُمَّ لَمْ يَحْسِمْهُمْ حَتَّى مَاتُوا‏.‏",
    "malay_translation": "Ali bin Abdullah telah meriwayatkan kepada kami, al-Walid bin Muslim telah meriwayatkan kepada kami, al-Auza'i telah meriwayatkan kepadaku, Yahya bin Abi Katsir telah memberitakan kepadaku, katanya Abu Qilabah al-Jarmi telah menceritakan kepadaku daripada Anas r.a. bahawa telah datang kepada Nabi SAW sekumpulan orang daripada kaum Ukul, lalu mereka memeluk Islam, kemudian mereka tidak sesuai dengan iklim Madinah. Maka Nabi SAW menyuruh mereka supaya datang kepada unta-unta sedekah, lalu mereka minum air kencing dan susu unta-unta itu. Mereka pun berbuat demikian, lalu mereka sembuh. Kemudian mereka murtad dan membunuh gembala unta-unta itu serta merampas unta-unta tersebut. Maka baginda menghantar orang untuk mengejar mereka, lalu mereka ditangkap dan dibawa kepada baginda. Maka Nabi SAW memerintahkan supaya tangan dan kaki mereka dipotong, dan mata mereka dipanaskan dengan besi panas, kemudian luka-luka mereka tidak dibalut sehingga mereka mati."
  },
  {
    "id": 6557,
    "hadith_number": 6557,
    "tajuk_hadith": "Kisah Pemotongan Anggota Badan Kaum `Uraina",
    "perawi_melayu": "Anas meriwayatkan:",
    "english_text": "The Prophet (ﷺ) cut off the hands and feet of the men belonging to the tribe of `Uraina and did not \ncauterise (their bleeding limbs) till they died.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّلْتِ أَبُو يَعْلَى، حَدَّثَنَا الْوَلِيدُ، حَدَّثَنِي الأَوْزَاعِيُّ، عَنْ يَحْيَى، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَطَعَ الْعُرَنِيِّينَ وَلَمْ يَحْسِمْهُمْ حَتَّى مَاتُوا‏.‏",
    "malay_translation": "Anas meriwayatkan bahawa Nabi Muhammad ﷺ telah memotong tangan dan kaki kaum `Uraina dan tidak membalut luka mereka sehingga mereka mati."
  },
  {
    "id": 6558,
    "hadith_number": 6558,
    "tajuk_hadith": "Kisah Puak Ukul dan Hukuman Mereka",
    "perawi_melayu": "Anas meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، عَنْ وُهَيْبٍ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَدِمَ رَهْطٌ مِنْ عُكْلٍ عَلَى النَّبِيِّ صلى الله عليه وسلم كَانُوا فِي الصُّفَّةِ، فَاجْتَوَوُا الْمَدِينَةَ فَقَالُوا يَا رَسُولَ اللَّهِ أَبْغِنَا رِسْلاً‏.‏ فَقَالَ ‏\n\"‏ مَا أَجِدُ لَكُمْ إِلاَّ أَنْ تَلْحَقُوا بِإِبِلِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\"‏‏.‏ فَأَتَوْهَا فَشَرِبُوا مِنْ أَلْبَانِهَا وَأَبْوَالِهَا حَتَّى صَحُّوا وَسَمِنُوا، وَقَتَلُوا الرَّاعِيَ وَاسْتَاقُوا الذَّوْدَ، فَأَتَى النَّبِيَّ صلى الله عليه وسلم الصَّرِيخُ، فَبَعَثَ الطَّلَبَ فِي آثَارِهِمْ، فَمَا تَرَجَّلَ النَّهَارُ حَتَّى أُتِيَ بِهِمْ، فَأَمَرَ بِمَسَامِيرَ فَأُحْمِيَتْ فَكَحَلَهُمْ وَقَطَعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ، وَمَا حَسَمَهُمْ، ثُمَّ أُلْقُوا فِي الْحَرَّةِ يَسْتَسْقُونَ فَمَا سُقُوا حَتَّى مَاتُوا‏.‏ قَالَ أَبُو قِلاَبَةَ سَرَقُوا وَقَتَلُوا وَحَارَبُوا اللَّهَ وَرَسُولَهُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Musa bin Ismā'il, dari Wahb, dari Ayub, dari Abu Qilabah, dari Anas r.a., bahawa telah datang sekumpulan orang dari puak Ukul kepada Nabi SAW. Mereka tinggal di As-Suffa, tetapi mereka jatuh sakit kerana iklim Madinah tidak sesuai dengan mereka.  Maka mereka berkata, \"Wahai Rasulullah SAW! Berikanlah kami sesuatu.\"  Baginda SAW bersabda, \"Aku tidak dapati jalan lain bagi kamu melainkan dengan menggunakan unta-unta Rasulullah SAW.\" Maka mereka pun pergi dan meminum susu dan air kencing unta-unta itu (sebagai ubat) sehingga mereka sembuh dan menjadi gemuk. Kemudian mereka membunuh gembala dan melarikan unta-unta itu.  Maka sampai kepada Rasulullah SAW berita kejadian itu, lalu Baginda menghantar orang untuk memburu mereka. Sebelum siang hari berakhir, mereka telah ditangkap dan dibawa menghadap Baginda.  Baginda memerintahkan supaya beberapa batang besi dipanaskan hingga merah, lalu mata mereka dibakar dengan besi tersebut, dan tangan serta kaki mereka dipotong, tetapi tidak dirawat. Kemudian mereka dibuang ke tempat yang bernama Al-Harrah, dan apabila mereka meminta air, mereka tidak diberi sehingga mereka mati. Abu Qilabah berkata, \"Mereka itu mencuri, membunuh dan memerangi Allah dan Rasul-Nya.\" "
  },
  {
    "id": 6559,
    "hadith_number": 6559,
    "tajuk_hadith": " Hukuman Ke Atas Sekumpulan Orang Yang Ingkar Janji",
    "perawi_melayu": "Anas bin Malik meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَهْطًا، مِنْ عُكْلٍ ـ أَوْ قَالَ عُرَيْنَةَ وَلاَ أَعْلَمُهُ إِلاَّ قَالَ مِنْ عُكْلٍ ـ قَدِمُوا الْمَدِينَةَ، فَأَمَرَ لَهُمُ النَّبِيُّ صلى الله عليه وسلم بِلِقَاحٍ، وَأَمَرَهُمْ أَنْ يَخْرُجُوا فَيَشْرَبُوا مِنْ أَبْوَالِهَا وَأَلْبَانِهَا، فَشَرِبُوا حَتَّى إِذَا بَرِئُوا قَتَلُوا الرَّاعِيَ وَاسْتَاقُوا النَّعَمَ، فَبَلَغَ النَّبِيَّ صلى الله عليه وسلم غُدْوَةً فَبَعَثَ الطَّلَبَ فِي إِثْرِهِمْ، فَمَا ارْتَفَعَ النَّهَارُ حَتَّى جِيءَ بِهِمْ، فَأَمَرَ بِهِمْ فَقَطَعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ وَسَمَرَ أَعْيُنَهُمْ، فَأُلْقُوا بِالْحَرَّةِ يَسْتَسْقُونَ فَلاَ يُسْقَوْنَ‏.‏ قَالَ أَبُو قِلاَبَةَ هَؤُلاَءِ قَوْمٌ سَرَقُوا، وَقَتَلُوا، وَكَفَرُوا بَعْدَ إِيمَانِهِمْ، وَحَارَبُوا اللَّهَ وَرَسُولَهُ‏.‏",
    "malay_translation": "Anas bin Malik meriwayatkan bahawa satu puak daripada suku ‘Ukl – atau mungkin ‘Urainah, aku tidak pasti kecuali jika dikatakan daripada suku ‘Ukl – datang ke Madinah.  Mereka jatuh sakit, lalu Nabi SAW menyuruh mereka pergi ke kawanan unta betina dan memerintahkan mereka untuk minum air kencing dan susu unta sebagai ubat.  Mereka minum sehingga sembuh, kemudian mereka membunuh gembala dan mencuri unta-unta tersebut. Berita ini sampai kepada Nabi SAW pada waktu pagi, lalu baginda menghantar orang untuk mengejar mereka.  Sebelum tengah hari, mereka ditangkap dan dibawa menghadap Nabi SAW.  Baginda memerintahkan agar tangan dan kaki mereka dipotong, mata mereka dipanaskan dengan besi panas, dan mereka dibuang ke Al-Harrah. Mereka meminta air tetapi tidak diberi. Abu Qilabah berkata, “Mereka ini adalah orang-orang yang mencuri, membunuh, murtad setelah beriman, dan memerangi Allah dan Rasul-Nya.”"
  },
  {
    "id": 6560,
    "hadith_number": 6560,
    "tajuk_hadith": "Tujuh Golongan yang Diberi Naungan Allah SWT pada Hari Kiamat",
    "perawi_melayu": "Riwayat Abu Hurairah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ سَبْعَةٌ يُظِلُّهُمُ اللَّهُ يَوْمَ الْقِيَامَةِ فِي ظِلِّهِ، يَوْمَ لاَ ظِلَّ إِلاَّ ظِلُّهُ إِمَامٌ عَادِلٌ، وَشَابٌّ نَشَأَ فِي عِبَادَةِ اللَّهِ، وَرَجُلٌ ذَكَرَ اللَّهَ فِي خَلاَءٍ فَفَاضَتْ عَيْنَاهُ، وَرَجُلٌ قَلْبُهُ مُعَلَّقٌ فِي الْمَسْجِدِ، وَرَجُلاَنِ تَحَابَّا فِي اللَّهِ، وَرَجُلٌ دَعَتْهُ امْرَأَةٌ ذَاتُ مَنْصِبٍ وَجَمَالٍ إِلَى نَفْسِهَا قَالَ إِنِّي أَخَافُ اللَّهَ‏.‏ وَرَجُلٌ تَصَدَّقَ بِصَدَقَةٍ فَأَخْفَاهَا، حَتَّى لاَ تَعْلَمَ شِمَالُهُ مَا صَنَعَتْ يَمِينُهُ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Salam, telah mengkhabar-kan kepada kami Abdullah, dari Ubaidullah bin Umar, dari Khubaib bin Abdurrahman, dari Hafsh bin Ashim, dari Abu Hurairah, dari Nabi SAW, baginda bersabda: \"Tujuh golongan yang akan dinaungi Allah SWT pada hari kiamat di bawah naungan-Nya, iaitu pada hari yang tiada naungan kecuali naungan-Nya; iaitu seorang imam yang adil, seorang pemuda yang dibesarkan dalam ibadah kepada Allah SWT, seorang lelaki yang menyebut Allah SWT secara bersendirian sehingga matanya mengalirkan air mata, seorang lelaki yang hatinya sentiasa terpaut pada masjid (mengerjakan solat fardu berjemaah di masjid), dua orang lelaki yang saling mengasihi kerana Allah SWT, seorang lelaki yang diajak oleh seorang wanita yang berkedudukan tinggi dan cantik untuk berzina dengannya, lalu dia berkata: \"Sesungguhnya aku takut kepada Allah SWT,\" dan seorang lelaki yang bersedekah secara sembunyi sehingga tangan kirinya tidak mengetahui apa yang telah dilakukan oleh tangan kanannya.\""
  },
  {
    "id": 6561,
    "hadith_number": 6561,
    "tajuk_hadith": "Jaminan Syurga Kerana Menjaga Kemaluan dan Lidah",
    "perawi_melayu": "Riwayat Sahl bin Sa'd:",
    "english_text": "The Prophet (ﷺ) said, \"Whoever guarantees me (the chastity of) what is between his legs (i.e. his private parts), and what is between his jaws (i.e., his tongue), I guarantee him Paradise.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ، حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ‏.‏ وَحَدَّثَنِي خَلِيفَةُ، حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ، حَدَّثَنَا أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَنْ تَوَكَّلَ لِي مَا بَيْنَ رِجْلَيْهِ وَمَا بَيْنَ لَحْيَيْهِ، تَوَكَّلْتُ لَهُ بِالْجَنَّةِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Barang siapa yang menjamin aku (kesucian) apa yang berada di antara dua kakinya (iaitu, kemaluannya) dan apa yang berada di antara dua rahangnya (iaitu, lidahnya), Aku menjamin baginya syurga.\""
  },
  {
    "id": 6562,
    "hadith_number": 6562,
    "tajuk_hadith": "Tanda-tanda Kiamat: Hilangnya Ilmu, Peningkatan Kejahatan, dan Ketidakseimbangan Jantina",
    "perawi_melayu": "Riwayat Anas:",
    "english_text": "",
    "arabic_text": "أَخْبَرَنَا دَاوُدُ بْنُ شَبِيبٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، أَخْبَرَنَا أَنَسٌ، قَالَ لأُحَدِّثَنَّكُمْ حَدِيثًا لاَ يُحَدِّثُكُمُوهُ أَحَدٌ بَعْدِي، سَمِعْتُهُ مِنَ النَّبِيِّ صلى الله عليه وسلم سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ ـ وَإِمَّا قَالَ مِنْ أَشْرَاطِ السَّاعَةِ ـ أَنْ يُرْفَعَ الْعِلْمُ وَيَظْهَرَ الْجَهْلُ، وَيُشْرَبَ الْخَمْرُ، وَيَظْهَرَ الزِّنَا، وَيَقِلَّ الرِّجَالُ، وَيَكْثُرَ النِّسَاءُ، حَتَّى يَكُونَ لِلْخَمْسِينَ امْرَأَةً الْقَيِّمُ الْوَاحِدُ ‏\"‏‏.‏",
    "malay_translation": "Aku akan menceritakan kepada kamu satu hadis yang tidak akan diceritakan oleh sesiapa pun kepadamu selepas aku. Aku mendengarnya daripada Nabi SAW. Aku mendengar Nabi SAW bersabda:  \"Kiamat tidak akan berlaku\" atau baginda bersabda: \"Antara tanda-tanda kiamat ialah ilmu akan diangkat (dengan kematian ulama), dan kejahilan akan merebak; arak akan diminum secara meluas, dan zina akan berleluasa, dan lelaki akan berkurangan, dan wanita akan bertambah banyak, sehingga bagi lima puluh wanita hanya ada seorang lelaki untuk menjaga mereka.\""
  },
  {
    "id": 6563,
    "hadith_number": 6563,
    "tajuk_hadith": "Kehilangan Iman Akibat Zina, Mencuri, Minum Arak dan Membunuh",
    "perawi_melayu": "Daripada 'Ikrimah daripada Ibnu 'Abbas:",
    "english_text": "Allah's Messenger (ﷺ)s said, \"When a slave (of Allah) commits illegal sexual\n     intercourse, he is not a believer at the time of committing it; and if\n     he steals, he is not a believer at the time of stealing; and if he \n     drinks an alcoholic drink, when he is not a believer at the time of \n     drinking it; and he is not a believer when he commits a murder,\" \n     'Ikrima said: I asked Ibn Abbas, \"How is faith taken away from him?\" \n     He said, Like this,\" by clasping his hands and then separating them, \n     and added, \"But if he repents, faith returns to him like this, by \n     clasping his hands again.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، أَخْبَرَنَا إِسْحَاقُ بْنُ يُوسُفَ، أَخْبَرَنَا الْفُضَيْلُ بْنُ غَزْوَانَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَزْنِي الْعَبْدُ حِينَ يَزْنِي وَهْوَ مُؤْمِنٌ، وَلاَ يَسْرِقُ حِينَ يَسْرِقُ وَهْوَ مُؤْمِنٌ، وَلاَ يَشْرَبُ حِينَ يَشْرَبُ وَهْوَ مُؤْمِنٌ، وَلاَ يَقْتُلُ وَهْوَ مُؤْمِنٌ ‏\"‏‏.‏ قَالَ عِكْرِمَةُ قُلْتُ لاِبْنِ عَبَّاسٍ كَيْفَ يُنْزَعُ الإِيمَانُ مِنْهُ قَالَ هَكَذَا ـ وَشَبَّكَ بَيْنَ أَصَابِعِهِ ثُمَّ أَخْرَجَهَا ـ فَإِنْ تَابَ عَادَ إِلَيْهِ هَكَذَا وَشَبَّكَ بَيْنَ أَصَابِعِهِ",
    "malay_translation": "Rasulullah SAW bersabda:  \"Seseorang hamba tidak berzina ketika dia berzina dalam keadaan beriman, dan tidak mencuri ketika dia mencuri dalam keadaan beriman, dan tidak meminum arak ketika dia meminumnya dalam keadaan beriman, dan tidak membunuh ketika dia membunuh dalam keadaan beriman.\"  'Ikrimah berkata: Aku bertanya kepada Ibnu Abbas, \"Bagaimanakah iman itu hilang darinya?\"  Beliau menjawab, \"Seperti ini,\" sambil menyatukan jari-jarinya, kemudian memisahkannya.  Lalu beliau menambah, \"Tetapi jika dia bertaubat, iman akan kembali kepadanya seperti ini,\" sambil menyatukan jari-jarinya kembali."
  },
  {
    "id": 6564,
    "hadith_number": 6564,
    "tajuk_hadith": "Taubat Orang Berzina, Mencuri dan Minum Arak",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \"The one who commits an illegal sexual intercourse is not a believer at the time of \ncommitting illegal sexual intercourse and a thief is not a believer at the time of committing theft and a \ndrinker of alcoholic drink is not a believer at the time of drinking. Yet, (the gate of) repentance is open \nthereafter.\"",
    "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، عَنْ ذَكْوَانَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ يَزْنِي الزَّانِي حِينَ يَزْنِي وَهْوَ مُؤْمِنٌ، وَلاَ يَسْرِقُ حِينَ يَسْرِقُ وَهْوَ مُؤْمِنٌ، وَلاَ يَشْرَبُ حِينَ يَشْرَبُهَا وَهْوَ مُؤْمِنٌ، وَالتَّوْبَةُ مَعْرُوضَةٌ بَعْدُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Seseorang yang melakukan zina ketika dia berzina, dia bukanlah seorang mukmin. Dan seseorang yang mencuri ketika dia mencuri, dia bukanlah seorang mukmin. Dan seseorang yang meminum arak ketika dia meminumnya, dia bukanlah seorang mukmin.  Namun, pintu taubat tetap terbuka selepas itu.\""
  },
  {
    "id": 6565,
    "hadith_number": 6565,
    "tajuk_hadith": "Dosa-dosa Besar Menurut Rasulullah SAW",
    "perawi_melayu": "Riwayat Abdullah bin Mas'ud:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى، حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي مَنْصُورٌ، وَسُلَيْمَانُ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مَيْسَرَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَىُّ الذَّنْبِ أَعْظَمُ قَالَ ‏\"‏ أَنْ تَجْعَلَ لِلَّهِ نِدًّا وَهْوَ خَلَقَكَ ‏\"‏‏.‏ قُلْتُ ثُمَّ أَىٌّ قَالَ ‏\"‏ أَنْ تَقْتُلَ وَلَدَكَ مِنْ أَجْلِ أَنْ يَطْعَمَ مَعَكَ ‏\"‏‏.‏ قُلْتُ ثُمَّ أَىٌّ قَالَ ‏\"‏ أَنْ تُزَانِيَ حَلِيلَةَ جَارِكَ ‏\"‏‏.‏   \nقَالَ يَحْيَى وَحَدَّثَنَا سُفْيَانُ، حَدَّثَنِي وَاصِلٌ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قُلْتُ يَا رَسُولَ اللَّهِ، مِثْلَهُ، قَالَ عَمْرٌو فَذَكَرْتُهُ لِعَبْدِ الرَّحْمَنِ وَكَانَ حَدَّثَنَا عَنْ سُفْيَانَ عَنِ الأَعْمَشِ وَمَنْصُورٍ وَوَاصِلٍ عَنْ أَبِي وَائِلٍ عَنْ أَبِي مَيْسَرَةَ قَالَ دَعْهُ دَعْهُ‏.‏",
    "malay_translation": "Aku bertanya, \"Wahai Rasulullah SAW! Apakah dosa yang paling besar?\" Baginda menjawab, \"Menetapkan sekutu bagi Allah SWT, padahal Dialah yang menciptakanmu.\" Aku bertanya lagi, \"Kemudian apakah dosa yang berikutnya?\" Baginda menjawab, \"Membunuh anakmu kerana bimbang dia akan makan bersamamu.\" Aku bertanya lagi, \"Kemudian apakah dosa yang berikutnya?\" Baginda menjawab, \"Berzina dengan isteri jiranmu.\""
  },
  {
    "id": 6566,
    "hadith_number": 6566,
    "tajuk_hadith": "Ali Merajam Seorang Wanita",
    "perawi_melayu": "Daripada Asy-Syu'bi:",
    "english_text": "from `Ali when the latter stoned a lady to death on a Friday. `Ali said, \"I have stoned her according to the tradition of Allah's Messenger (ﷺ).\"",
    "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا سَلَمَةُ بْنُ كُهَيْلٍ، قَالَ سَمِعْتُ الشَّعْبِيَّ، يُحَدِّثُ عَنْ عَلِيٍّ، رضى الله عنه حِينَ رَجَمَ الْمَرْأَةَ يَوْمَ الْجُمُعَةِ وَقَالَ قَدْ رَجَمْتُهَا بِسُنَّةِ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Daripada Adam, telah menceritakan kepada kami Syu'bah, telah menceritakan kepada kami Salamah bin Kuhil, katanya: Aku telah mendengar Asy-Syabi meriwayatkan daripada Ali r.a. ketika beliau merajam seorang wanita pada hari Jumaat, dan beliau berkata: \"Sesungguhnya aku telah merajamnya mengikut sunnah Rasulullah SAW.\""
  },
  {
    "id": 6567,
    "hadith_number": 6567,
    "tajuk_hadith": "Hukum Rajam pada Zaman Rasulullah SAW",
    "perawi_melayu": "Riwayat Asy-Syaibani:",
    "english_text": "I asked `Abdullah bin Abi `Aufa, 'Did Allah's Messenger (ﷺ) carry out the Rajam penalty ( i.e., stoning to \ndeath)?' He said, \"Yes.\" I said, \"Before the revelation of Surat-an-Nur or after it?\" He replied, \"I don't \nKnow.\"",
    "arabic_text": "حَدَّثَنِي إِسْحَاقُ، حَدَّثَنَا خَالِدٌ، عَنِ الشَّيْبَانِيِّ، سَأَلْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى هَلْ رَجَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ‏.‏ قُلْتُ قَبْلَ سُورَةِ النُّورِ أَمْ بَعْدُ قَالَ لاَ أَدْرِي‏.‏",
    "malay_translation": "Aku bertanya kepada Abdullah bin Abi Auf, 'Adakah Rasulullah SAW telah melaksanakan hukuman rajam (iaitu, rejam sehingga mati)?'  Beliau menjawab, \"Ya.\" Aku bertanya lagi, \"Sebelum wahyu surah An-Nur atau selepasnya?\" Beliau menjawab, \"Aku tidak tahu.\""
  },
  {
    "id": 6568,
    "hadith_number": 6568,
    "tajuk_hadith": "Rajam Seorang Lelaki yang Berzina",
    "perawi_melayu": "Dari Jabir bin Abdullah Al-Ansari:",
    "english_text": "A man from the tribe of Bani Aslam came to Allah's Messenger (ﷺ) and Informed him that he had committed \nillegal sexual intercourse and bore witness four times against himself. Allah's Messenger (ﷺ) ordered him to \nbe stoned to death as he was a married Person.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ الأَنْصَارِيِّ، أَنَّ رَجُلاً، مِنْ أَسْلَمَ أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَحَدَّثَهُ أَنَّهُ قَدْ زَنَى، فَشَهِدَ عَلَى نَفْسِهِ أَرْبَعَ شَهَادَاتٍ، فَأَمَرَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَرُجِمَ، وَكَانَ قَدْ أُحْصِنَ‏.‏",
    "malay_translation": "Seorang lelaki dari kabilah Bani Aslam datang kepada Rasulullah SAW dan memberitahu baginda bahawa dia telah melakukan zina dan memberi kesaksian terhadap dirinya sendiri sebanyak empat kali.  Rasulullah SAW memerintahkan supaya dia dirajam hingga mati kerana dia telah berkahwin."
  },
  {
    "id": 6569,
    "hadith_number": 6569,
    "tajuk_hadith": "Rajam Ke Atas Zina",
    "perawi_melayu": "Dari Abu Hurairah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، وَسَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ أَتَى رَجُلٌ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهْوَ فِي الْمَسْجِدِ فَنَادَاهُ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي زَنَيْتُ‏.‏ فَأَعْرَضَ عَنْهُ، حَتَّى رَدَّدَ عَلَيْهِ أَرْبَعَ مَرَّاتٍ، فَلَمَّا شَهِدَ عَلَى نَفْسِهِ أَرْبَعَ شَهَادَاتٍ، دَعَاهُ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَبِكَ جُنُونٌ ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ فَهَلْ أَحْصَنْتَ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اذْهَبُوا بِهِ فَارْجُمُوهُ ‏\"‏‏.‏   قَالَ ابْنُ شِهَابٍ فَأَخْبَرَنِي مَنْ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، قَالَ فَكُنْتُ فِيمَنْ رَجَمَهُ فَرَجَمْنَاهُ بِالْمُصَلَّى، فَلَمَّا أَذْلَقَتْهُ الْحِجَارَةُ هَرَبَ، فَأَدْرَكْنَاهُ بِالْحَرَّةِ فَرَجَمْنَاهُ‏.‏",
    "malay_translation": "Dari Abu Hurairah r.a.: Seorang lelaki datang kepada Rasulullah SAW ketika baginda berada di masjid dan memanggil baginda, lalu berkata, \"Wahai Rasulullah, sesungguhnya aku telah berzina.\"  Rasulullah SAW berpaling daripadanya sehingga lelaki itu mengulanginya sebanyak empat kali. Setelah lelaki itu memberi empat kali pengakuan terhadap dirinya sendiri, Nabi SAW memanggilnya lalu bertanya, \"Adakah engkau gila?\" Lelaki itu menjawab, \"Tidak.\" Baginda bertanya lagi, \"Adakah engkau sudah berkahwin?\" Lelaki itu menjawab, \"Ya.\"  Maka Rasulullah SAW bersabda, \"Bawalah dia dan rajamlah dia.\"  Ibn Syihab berkata:  Seorang yang mendengar Jabir bin Abdullah berkata, Aku berada di antara mereka yang merajamnya. Kami merajamnya di musolla.  Apabila batu-batu itu melukakannya, dia melarikan diri, tetapi kami mengejarnya di Al-Harrah dan merajamnya sehingga mati."
  },
  {
    "id": 6570,
    "hadith_number": 6570,
    "tajuk_hadith": "Hak Penjagaan Anak dan Hukuman Zina",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "Sa`d bin Abi Waqqas and `Abd bin Zam`a quarrelled with each other (regarding a child). The Prophet (ﷺ) \nsaid, \"The boy is for you, O `Abd bin Zam`a, for the boy is for (the owner) of the bed. O Sauda ! \nScreen yourself from the boy.\" The sub-narrator, Al-Laith added (that the Prophet (ﷺ) also said), \"And the \nstone is for the person who commits an illegal sexual intercourse.\"",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتِ اخْتَصَمَ سَعْدٌ وَابْنُ زَمْعَةَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هُوَ لَكَ يَا عَبْدُ بْنَ زَمْعَةَ، الْوَلَدُ لِلْفِرَاشِ، وَاحْتَجِبِي مِنْهُ يَا سَوْدَةُ ‏\"‏‏.‏ زَادَ لَنَا قُتَيْبَةُ عَنِ اللَّيْثِ ‏\"‏ وَلِلْعَاهِرِ الْحَجَرُ ‏\"‏‏.‏",
    "malay_translation": "Sa'd bin Abi Waqqas dan Abd bin Zam'ah bertengkar sesama mereka (mengenai seorang kanak-kanak).  Nabi SAW bersabda, \"Kanak-kanak itu adalah untukmu wahai Abd bin Zam'ah, kerana anak itu adalah untuk pemilik tempat tidur. Wahai Saudah!  Lindungilah dirimu daripadanya.\"  Perawi tambahan, Al-Laith menambah (bahawa Nabi SAW juga bersabda), \"Dan bagi pezina ialah hukuman rejam.\""
  },
  {
    "id": 6571,
    "hadith_number": 6571,
    "tajuk_hadith": "Anak Adalah Hak Pemilik Katil, Dan Bagi Pezina Adalah Batu",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \"The boy is for (the owner of) the bed and the stone is for the person who commits \nillegal sexual intercourse.'",
    "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ الْوَلَدُ لِلْفِرَاشِ، وَلِلْعَاهِرِ الْحَجَرُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Anak adalah untuk pemilik katil, dan bagi pezina adalah batu.\""
  },
  {
    "id": 6572,
    "hadith_number": 6572,
    "tajuk_hadith": "Hukum Rajam dalam Taurat",
    "perawi_melayu": "Riwayat Ibnu Umar:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، عَنْ سُلَيْمَانَ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَهُودِيٍّ وَيَهُودِيَّةٍ قَدْ أَحْدَثَا جَمِيعًا فَقَالَ لَهُمْ ‏\n\"‏ مَا تَجِدُونَ فِي كِتَابِكُمْ ‏\"‏‏.‏ قَالُوا إِنَّ أَحْبَارَنَا أَحْدَثُوا تَحْمِيمَ الْوَجْهِ وَالتَّجْبِيَةَ‏.‏ قَالَ عَبْدُ اللَّهِ بْنُ سَلاَمٍ ادْعُهُمْ يَا رَسُولَ اللَّهِ بِالتَّوْرَاةِ‏.‏ فَأُتِيَ بِهَا فَوَضَعَ أَحَدُهُمْ يَدَهُ عَلَى آيَةِ الرَّجْمِ، وَجَعَلَ يَقْرَأُ مَا قَبْلَهَا وَمَا بَعْدَهَا فَقَالَ لَهُ ابْنُ سَلاَمٍ ارْفَعْ يَدَكَ‏.‏ فَإِذَا آيَةُ الرَّجْمِ تَحْتَ يَدِهِ، فَأَمَرَ بِهِمَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَرُجِمَا‏.‏ قَالَ ابْنُ عُمَرَ فَرُجِمَا عِنْدَ الْبَلاَطِ، فَرَأَيْتُ الْيَهُودِيَّ أَجْنَأَ عَلَيْهَا‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Usman, telah menceritakan kepada kami Khalid bin Makhlad, dari Sulaiman, telah menceritakan kepadaku Abdullah bin Dinar, dari Ibnu Umar r.a., berkata:  Rasulullah SAW didatangi oleh seorang Yahudi lelaki dan seorang Yahudi perempuan yang telah melakukan zina. Maka Rasulullah SAW bertanya kepada mereka, \"Apakah yang kamu dapati dalam kitab kamu?\" Mereka menjawab, \"Sesungguhnya ulama kami telah mengadakan hukum menghitamkan muka dan Tajbiya.\" Abdullah bin Salam berkata, \"Wahai Rasulullah SAW, suruhlah mereka membawa Taurat.\" Maka Taurat itu dibawa, lalu salah seorang daripada mereka meletakkan tangannya di atas ayat rajam, dan membacanya sebelum dan sesudahnya. Lalu Ibnu Salam berkata kepadanya, \"Angkat tanganmu!\" Maka kelihatanlah ayat rajam di bawah tangannya. Maka Rasulullah SAW memerintahkan mereka berdua dirajam, lalu mereka dirajam. Ibnu Umar berkata: Mereka dirajam di Balat, lalu aku melihat orang Yahudi lelaki itu melindungi wanita Yahudi itu."
  },
  {
    "id": 6573,
    "hadith_number": 6573,
    "tajuk_hadith": "Zina dan Hukuman Rajam",
    "perawi_melayu": "Dari Jabir:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مَحْمُودٌ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرٍ، أَنَّ رَجُلاً، مِنْ أَسْلَمَ جَاءَ النَّبِيَّ صلى الله عليه وسلم فَاعْتَرَفَ بِالزِّنَا فَأَعْرَضَ عَنْهُ النَّبِيُّ صلى الله عليه وسلم حَتَّى شَهِدَ عَلَى نَفْسِهِ أَرْبَعَ مَرَّاتٍ‏.‏ قَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَبِكَ جُنُونٌ ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ آحْصَنْتَ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ فَأَمَرَ بِهِ فَرُجِمَ بِالْمُصَلَّى، فَلَمَّا أَذْلَقَتْهُ الْحِجَارَةُ فَرَّ، فَأُدْرِكَ فَرُجِمَ حَتَّى مَاتَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم خَيْرًا وَصَلَّى عَلَيْهِ‏.‏ لَمْ يَقُلْ يُونُسُ وَابْنُ جُرَيْجٍ عَنِ الزُّهْرِيِّ فَصَلَّى عَلَيْهِ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Mahmud, telah menceritakan kepada kami Abdurrazzaq, telah memberitakan kepada kami Ma'mar, dari Az Zuhri, dari Abu Salamah, dari Jabir, bahawa seorang lelaki dari Aslam datang kepada Nabi SAW lalu mengaku berzina.  Maka Nabi SAW berpaling daripadanya sehingga lelaki itu bersaksi terhadap dirinya sebanyak empat kali. Nabi SAW bertanya kepadanya, \"Adakah engkau gila?\" Lelaki itu menjawab, \"Tidak.\" Nabi SAW bertanya lagi, \"Adakah engkau sudah berkahwin?\" Lelaki itu menjawab, \"Ya.\" Maka Nabi SAW memerintahkan supaya lelaki itu dirajam di tempat solat (Musalla).  Apabila batu-batu itu melukakannya, dia melarikan diri, tetapi dia ditangkap dan dirajam sehingga mati.  Kemudian Nabi SAW berkata baik mengenainya dan menunaikan solat jenazah ke atasnya. Yunus dan Ibnu Juraij tidak menyebut bahawa Nabi SAW menunaikan solat jenazah ke atasnya,  dari Az Zuhri."
  },
  {
    "id": 6574,
    "hadith_number": 6574,
    "tajuk_hadith": "Kafarah Jimak di Bulan Ramadan",
    "perawi_melayu": "Riwayat Abu Hurairah",
    "english_text": "A person had sexual relation with his wife in the month of Ramadan \n     (while he was fasting), and he came to Allah's Messenger (ﷺ) seeking his \n     verdict concerning that action. The Prophet (ﷺ) said (to him), \"Can you \n     afford to manumit a slave?\" The man said, \"No.\" The Prophet (ﷺ) said, \"Can\n     you fast for two successive months?\" He said, \"No.\" The Prophet (ﷺ) said, \n     \"Then feed sixty poor persons.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَجُلاً، وَقَعَ بِامْرَأَتِهِ فِي رَمَضَانَ، فَاسْتَفْتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ هَلْ تَجِدُ رَقَبَةً ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ هَلْ تَسْتَطِيعُ صِيَامَ شَهْرَيْنِ ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ فَأَطْعِمْ سِتِّينَ مِسْكِينًا ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qotaibah, telah menceritakan kepada kami Laith, dari Ibnu Syihab, dari Humaid bin Abdurrahman, dari Abu Hurairah r.a. bahawa seorang lelaki telah melakukan hubungan intim dengan isterinya di bulan Ramadan (sedangkan dia berpuasa), lalu dia meminta fatwa kepada Rasulullah SAW. Baginda bertanya, \"Adakah engkau mampu memerdekakan seorang hamba?\" Lelaki itu menjawab, \"Tidak.\" Baginda bertanya lagi, \"Adakah engkau mampu berpuasa dua bulan berturut-turut?\" Jawabnya, \"Tidak.\" Baginda bersabda, \"Maka berilah makan kepada enam puluh orang miskin.\""
  },
  {
    "id": 6575,
    "hadith_number": 6575,
    "tajuk_hadith": "Sedekah Bagi Mereka Yang Berhubungan Intim Ketika Berpuasa",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "",
    "arabic_text": "وَقَالَ اللَّيْثُ عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ الزُّبَيْرِ، عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، أَتَى رَجُلٌ النَّبِيَّ صلى الله عليه وسلم فِي الْمَسْجِدِ قَالَ احْتَرَقْتُ‏.‏ قَالَ ‏\"‏ مِمَّ ذَاكَ ‏\"‏‏.‏ قَالَ وَقَعْتُ بِامْرَأَتِي فِي رَمَضَانَ‏.‏ قَالَ لَهُ ‏\"‏ تَصَدَّقْ ‏\"‏‏.‏ قَالَ مَا عِنْدِي شَىْءٌ‏.‏ فَجَلَسَ وَأَتَاهُ إِنْسَانٌ يَسُوقُ حِمَارًا وَمَعَهُ طَعَامٌ ـ قَالَ عَبْدُ الرَّحْمَنِ مَا أَدْرِي مَا هُوَ ـ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَيْنَ الْمُحْتَرِقُ ‏\"‏‏.‏ فَقَالَ هَا أَنَا ذَا‏.‏ قَالَ ‏\"‏ خُذْ هَذَا فَتَصَدَّقْ بِهِ ‏\"‏‏.‏ قَالَ عَلَى أَحْوَجَ مِنِّي مَا لأَهْلِي طَعَامٌ قَالَ ‏\"‏ فَكُلُوهُ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ الْحَدِيثُ الأَوَّلُ أَبْيَنُ قَوْلُهُ ‏\"‏ أَطْعِمْ أَهْلَكَ ‏\"‏‏.‏",
    "malay_translation": "Seorang lelaki datang kepada Nabi SAW di masjid dan berkata, \"Saya telah terbakar (binasa)!\" Nabi SAW bertanya kepadanya, \"Kerana apa (apa yang telah engkau lakukan)?\" Lelaki itu berkata, \"Saya telah melakukan hubungan intim dengan isteri saya di bulan Ramadan (ketika berpuasa).\" Nabi SAW berkata kepadanya, \"Bersedekahlah.\" Lelaki itu berkata, \"Saya tidak mempunyai apa-apa.\"  Lelaki itu duduk, dan pada masa itu datang seseorang yang menunggang keldai membawa makanan kepada Nabi SAW..... (Perawi sub, Abdur Rahman menambah: Saya tidak tahu apa jenis makanan itu).  Atas perkara itu, Nabi SAW berkata, \"Di manakah orang yang terbakar itu?\" Lelaki itu berkata, \"Saya di sini.\" Nabi SAW berkata kepadanya, \"Ambillah ini (makanan) dan bersedekahlah dengannya.\" Lelaki itu berkata, \"Kepada orang yang lebih susah daripada saya? Keluarga saya tiada makanan.\"  Kemudian Nabi SAW berkata kepadanya, \"Maka makanlah ia sendiri.\""
  },
  {
    "id": 6576,
    "hadith_number": 6576,
    "tajuk_hadith": "Pengampunan Allah SWT melalui Solat",
    "perawi_melayu": "Riwayat Anas bin Malik:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي عَبْدُ الْقُدُّوسِ بْنُ مُحَمَّدٍ، حَدَّثَنِي عَمْرُو بْنُ عَاصِمٍ الْكِلاَبِيُّ، حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى، حَدَّثَنَا إِسْحَاقُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ كُنْتُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَجَاءَهُ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَصَبْتُ حَدًّا فَأَقِمْهُ عَلَىَّ‏.‏ قَالَ وَلَمْ يَسْأَلْهُ عَنْهُ‏.‏ قَالَ وَحَضَرَتِ الصَّلاَةُ فَصَلَّى مَعَ النَّبِيِّ صلى الله عليه وسلم فَلَمَّا قَضَى النَّبِيُّ صلى الله عليه وسلم الصَّلاَةَ قَامَ إِلَيْهِ الرَّجُلُ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَصَبْتُ حَدًّا، فَأَقِمْ فِيَّ كِتَابَ اللَّهِ‏.‏ قَالَ ‏\"‏ أَلَيْسَ قَدْ صَلَّيْتَ مَعَنَا ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَإِنَّ اللَّهَ قَدْ غَفَرَ لَكَ ذَنْبَكَ ‏\"‏‏.‏ أَوْ قَالَ ‏\"‏ حَدَّكَ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Abd al-Quddus bin Muhammad, telah menceritakan kepadaku Amr bin 'Aasim al-Kilabi, telah menceritakan kepada kami Hammam bin Yahya, telah menceritakan kepada kami Ishaq bin Abdullah bin Abi Talhah, dari Anas bin Malik - semoga Allah meridhainya - berkata, \"Aku berada di sisi Nabi ﷺ, maka datanglah seorang lelaki lalu berkata, 'Wahai Rasulullah ﷺ, sesungguhnya aku telah melakukan dosa yang sepatutnya dihukum, maka hukumlah aku!' Beliau tidak menanyakan apa dosanya.  Kemudian tiba waktu solat, maka lelaki itu bersolat bersama Nabi ﷺ. Setelah Nabi ﷺ selesai solat, lelaki itu berdiri di hadapan Baginda lalu berkata, 'Wahai Rasulullah ﷺ, sesungguhnya aku telah melakukan dosa yang sepatutnya dihukum, maka laksanakanlah hukuman Allah ke atasku!' Baginda ﷺ bersabda, 'Bukankah engkau telah bersolat bersama kami?' Lelaki itu menjawab, 'Ya.' Baginda ﷺ bersabda, 'Maka sesungguhnya Allah telah mengampuni dosa kamu,' atau Baginda ﷺ bersabda, '...dosa yang sepatutnya dihukum.'"
  },
  {
    "id": 6577,
    "hadith_number": 6577,
    "tajuk_hadith": "Kisah Ma'iz bin Malik dan Hukuman Rajam",
    "perawi_melayu": "Riwayat Ibnu Abbas:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْجُعْفِيُّ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي قَالَ، سَمِعْتُ يَعْلَى بْنَ حَكِيمٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا أَتَى مَاعِزُ بْنُ مَالِكٍ النَّبِيَّ صلى الله عليه وسلم قَالَ لَهُ ‏\"‏ لَعَلَّكَ قَبَّلْتَ أَوْ غَمَزْتَ أَوْ نَظَرْتَ ‏\"‏‏.‏ قَالَ لاَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ أَنِكْتَهَا ‏\"‏‏.‏ لاَ يَكْنِي‏.‏ قَالَ فَعِنْدَ ذَلِكَ أَمَرَ بِرَجْمِهِ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Abdullah bin Muhammad Al-Ju'fi, telah menceritakan kepada kami Wahb bin Jarir, telah menceritakan kepada kami bapaku, dia berkata; aku mendengar Ya'la bin Hakim dari 'Ikrimah, dari Ibnu Abbas r.a berkata, \"Apabila Ma'iz bin Malik datang kepada Nabi SAW, baginda bertanya kepadanya, 'Mungkin engkau menciumnya, mengedip mata kepadanya, atau memandangnya?' Dia menjawab, 'Tidak, wahai Rasulullah!' Baginda bertanya, 'Adakah engkau bersetubuh dengannya?' Baginda tidak berkias. Maka ketika itu baginda memerintahkan supaya dia dirajam.\""
  },
  {
    "id": 6578,
    "hadith_number": 6578,
    "tajuk_hadith": "Rajam Seorang Lelaki yang Berzina",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ أَنَّ أَبَا هُرَيْرَةَ، قَالَ أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم رَجُلٌ مِنَ النَّاسِ وَهْوَ فِي الْمَسْجِدِ فَنَادَاهُ يَا رَسُولَ اللَّهِ إِنِّي زَنَيْتُ‏.‏ يُرِيدُ نَفْسَهُ، فَأَعْرَضَ عَنْهُ النَّبِيُّ صلى الله عليه وسلم فَتَنَحَّى لِشِقِّ وَجْهِهِ الَّذِي أَعْرَضَ قِبَلَهُ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي زَنَيْتُ‏.‏ فَأَعْرَضَ عَنْهُ، فَجَاءَ لِشِقِّ وَجْهِ النَّبِيِّ صلى الله عليه وسلم الَّذِي أَعْرَضَ عَنْهُ، فَلَمَّا شَهِدَ عَلَى نَفْسِهِ أَرْبَعَ شَهَادَاتٍ دَعَاهُ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَبِكَ جُنُونٌ ‏\"‏‏.‏ قَالَ لاَ يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ ‏\"‏ أَحْصَنْتَ ‏\"‏‏.‏ قَالَ نَعَمْ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ اذْهَبُوا فَارْجُمُوهُ ‏\"‏‏.\nقَالَ ابْنُ شِهَابٍ أَخْبَرَنِي مَنْ، سَمِعَ جَابِرًا، قَالَ فَكُنْتُ فِيمَنْ رَجَمَهُ، فَرَجَمْنَاهُ بِالْمُصَلَّى، فَلَمَّا أَذْلَقَتْهُ الْحِجَارَةُ جَمَزَ حَتَّى أَدْرَكْنَاهُ بِالْحَرَّةِ فَرَجَمْنَاهُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Sa’id bin ‘Ufair, dia berkata; telah menceritakan kepadaku Laits, telah menceritakan kepadaku ‘Abdul Rahman bin Khalid, dari Ibnu Syihab, dari Ibnu Musayyab dan Abu Salamah bahawa Abu Hurairah berkata: Seorang lelaki datang kepada Rasulullah SAW ketika Baginda berada di masjid, lalu dia memanggil Baginda, \"Wahai Rasulullah, sesungguhnya aku telah berzina.\"  Rasulullah SAW berpaling daripadanya. Lelaki itu datang ke arah yang lain daripada yang Baginda berpaling, lalu berkata, \"Wahai Rasulullah, sesungguhnya aku telah berzina.\" Rasulullah SAW berpaling daripadanya lagi. Lelaki itu datang ke arah yang lain yang Baginda berpaling, lalu apabila lelaki itu telah bersaksi ke atas dirinya sebanyak empat kali, Rasulullah SAW memanggilnya dan bertanya, \"Adakah engkau gila?\" Lelaki itu menjawab, \"Tidak, wahai Rasulullah.\"  Baginda bertanya lagi, \"Adakah engkau sudah berkahwin?\" Lelaki itu menjawab, \"Ya, wahai Rasulullah.\" Baginda bersabda, \"Pergilah dan rajamlah dia.\" Ibnu Syihab berkata; ada seorang yang memberitakan kepadaku, yang telah mendengar daripada Jabir, dia berkata: Aku termasuk di antara orang-orang yang merajamnya. Kami merajamnya di tempat solat ‘Id (Musalla). Apabila batu-batu itu telah menimpa dirinya, dia melarikan diri, tetapi kami mengejarnya di Al-Harrah lalu merajamnya sehingga mati."
  },
  {
    "id": 6579,
    "hadith_number": 6579,
    "tajuk_hadith": "Hukum Zina dan Pengadilan Berdasarkan Kitabullah",
    "perawi_melayu": "Riwayat Abu Hurairah dan Zaid bin Khalid:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ حَفِظْنَاهُ مِنْ فِي الزُّهْرِيِّ قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ وَزَيْدَ بْنَ خَالِدٍ قَالاَ كُنَّا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَامَ رَجُلٌ فَقَالَ أَنْشُدُكَ اللَّهَ إِلاَّ قَضَيْتَ بَيْنَنَا بِكِتَابِ اللَّهِ‏.‏ فَقَامَ خَصْمُهُ ـ وَكَانَ أَفْقَهَ مِنْهُ ـ فَقَالَ اقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ وَأْذَنْ لِي‏.‏ قَالَ ‏\"‏ قُلْ ‏\"‏‏.‏ قَالَ إِنَّ ابْنِي كَانَ عَسِيفًا عَلَى هَذَا، فَزَنَى بِامْرَأَتِهِ، فَافْتَدَيْتُ مِنْهُ بِمِائَةِ شَاةٍ وَخَادِمٍ، ثُمَّ سَأَلْتُ رِجَالاً مِنْ أَهْلِ الْعِلْمِ، فَأَخْبَرُونِي أَنَّ عَلَى ابْنِي جَلْدَ مِائَةٍ وَتَغْرِيبَ عَامٍ، وَعَلَى امْرَأَتِهِ الرَّجْمَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ جَلَّ ذِكْرُهُ، الْمِائَةُ شَاةٍ وَالْخَادِمُ رَدٌّ، وَعَلَى ابْنِكَ جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ، وَاغْدُ يَا أُنَيْسُ عَلَى امْرَأَةِ هَذَا، فَإِنِ اعْتَرَفَتْ فَارْجُمْهَا ‏\"‏‏.‏ فَغَدَا عَلَيْهَا فَاعْتَرَفَتْ فَرَجَمَهَا‏.‏ قُلْتُ لِسُفْيَانَ لَمْ يَقُلْ فَأَخْبَرُونِي أَنَّ عَلَى ابْنِي الرَّجْمَ‏.‏ فَقَالَ أَشُكُّ فِيهَا مِنَ الزُّهْرِيِّ، فَرُبَّمَا قُلْتُهَا وَرُبَّمَا سَكَتُّ‏.‏",
    "malay_translation": "Kami berada di sisi Nabi SAW, maka berdirilah seorang lelaki lalu berkata, \"Aku memohon kepadamu demi Allah, agar engkau mengadili kami berdasarkan Kitabullah.\" Kemudian bangunlah pihak lawan lelaki itu – yang lebih faham hukum daripada lelaki pertama – lalu berkata, \"Adililah kami berdasarkan Kitabullah dan izinkan aku (berbicara).\" Baginda SAW bersabda, \"Cakaplah.\" Lelaki itu berkata, \"Anakku bekerja sebagai buruh untuk lelaki ini, lalu dia berzina dengan isterinya. Aku telah membayar tebusan untuk dosa anakku dengan seratus ekor kambing dan seorang hamba. Kemudian aku bertanya kepada beberapa ulama, lalu mereka memberitahu aku bahawa anakku wajib disebat seratus kali dan diasingkan selama setahun, dan isteri lelaki ini wajib dirajam.\" Nabi SAW bersabda, \"Demi Zat yang jiwaku berada di tangan-Nya, sesungguhnya Aku akan mengadili kamu berdua berdasarkan Kitabullah. Seratus ekor kambing dan hamba itu dikembalikan kepadamu, dan anakmu wajib disebat seratus kali dan diasingkan selama setahun. Pergilah wahai Unais kepada isteri lelaki ini, jika dia mengaku, maka rajamlah dia.\" Unais pergi kepadanya, lalu dia mengaku, maka dirajamlah dia."
  },
  {
    "id": 6580,
    "hadith_number": 6580,
    "tajuk_hadith": "Hukum Rajam dalam Islam",
    "perawi_melayu": "Daripada Ibnu Abbas",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ عُمَرُ لَقَدْ خَشِيتُ أَنْ يَطُولَ بِالنَّاسِ زَمَانٌ حَتَّى يَقُولَ قَائِلٌ لاَ نَجِدُ الرَّجْمَ فِي كِتَابِ اللَّهِ‏.‏ فَيَضِلُّوا بِتَرْكِ فَرِيضَةٍ أَنْزَلَهَا اللَّهُ، أَلاَ وَإِنَّ الرَّجْمَ حَقٌّ عَلَى مَنْ زَنَى، وَقَدْ أَحْصَنَ، إِذَا قَامَتِ الْبَيِّنَةُ، أَوْ كَانَ الْحَمْلُ أَوْ الاِعْتِرَافُ ـ قَالَ سُفْيَانُ كَذَا حَفِظْتُ ـ أَلاَ وَقَدْ رَجَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَرَجَمْنَا بَعْدَهُ‏.‏",
    "malay_translation": "Ali bin Abdullah telah meriwayatkan kepada kami, Sufyan telah meriwayatkan kepada kami daripada Az- Zuhri, daripada Ubaidillah, daripada Ibnu Abbas r.a berkata bahawa Umar berkata: \"Sesungguhnya aku bimbang bahawa akan datang suatu masa yang panjang ke atas manusia sehingga ada yang berkata: Kami tidak menemui hukum rajam dalam kitab Allah, lalu mereka sesat dengan meninggalkan suatu kewajipan yang telah Allah turunkan. Ketahuilah bahawa hukum rajam itu adalah benar atas sesiapa yang berzina sedang dia telah berkahwin, jika telah tegak bukti atau terdapat kehamilan atau pengakuan.\" Sufyan berkata: \"Demikianlah yang aku hafal.\" Umar berkata lagi: \"Sesungguhnya Rasulullah SAW telah melaksanakan hukum rajam dan kami juga telah melaksanakannya selepas baginda.\""
  },
  {
    "id": 6581,
    "hadith_number": 6581,
    "tajuk_hadith": "Peristiwa Bai'ah Abu Bakar dan Amaran Umar",
    "perawi_melayu": "Riwayat Ibnu Abbas:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كُنْتُ أُقْرِئُ رِجَالاً مِنَ الْمُهَاجِرِينَ مِنْهُمْ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ، فَبَيْنَمَا أَنَا فِي مَنْزِلِهِ بِمِنًى، وَهْوَ عِنْدَ عُمَرَ بْنِ الْخَطَّابِ فِي آخِرِ حَجَّةٍ حَجَّهَا، إِذْ رَجَعَ إِلَىَّ عَبْدُ الرَّحْمَنِ فَقَالَ لَوْ رَأَيْتَ رَجُلاً أَتَى أَمِيرَ الْمُؤْمِنِينَ الْيَوْمَ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ هَلْ لَكَ فِي فُلاَنٍ يَقُولُ لَوْ قَدْ مَاتَ عُمَرُ لَقَدْ بَايَعْتُ فُلاَنًا، فَوَاللَّهِ مَا كَانَتْ بَيْعَةُ أَبِي بَكْرٍ إِلاَّ فَلْتَةً، فَتَمَّتْ‏.‏ فَغَضِبَ عُمَرُ ثُمَّ قَالَ إِنِّي إِنْ شَاءَ اللَّهُ لَقَائِمٌ الْعَشِيَّةَ فِي النَّاسِ، فَمُحَذِّرُهُمْ هَؤُلاَءِ الَّذِينَ يُرِيدُونَ أَنْ يَغْصِبُوهُمْ أُمُورَهُمْ‏.‏ قَالَ عَبْدُ الرَّحْمَنِ فَقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ لاَ تَفْعَلْ فَإِنَّ الْمَوْسِمَ يَجْمَعُ رَعَاعَ النَّاسِ وَغَوْغَاءَهُمْ، فَإِنَّهُمْ هُمُ الَّذِينَ يَغْلِبُونَ عَلَى قُرْبِكَ حِينَ تَقُومُ فِي النَّاسِ، وَأَنَا أَخْشَى أَنْ تَقُومَ فَتَقُولَ مَقَالَةً يُطَيِّرُهَا عَنْكَ كُلُّ مُطَيِّرٍ، وَأَنْ لاَ يَعُوهَا، وَأَنْ لاَ يَضَعُوهَا عَلَى مَوَاضِعِهَا، فَأَمْهِلْ حَتَّى تَقْدَمَ الْمَدِينَةَ فَإِنَّهَا دَارُ الْهِجْرَةِ وَالسُّنَّةِ، فَتَخْلُصَ بِأَهْلِ الْفِقْهِ وَأَشْرَافِ النَّاسِ، فَتَقُولَ مَا قُلْتَ مُتَمَكِّنًا، فَيَعِي أَهْلُ الْعِلْمِ مَقَالَتَكَ، وَيَضَعُونَهَا عَلَى مَوَاضِعِهَا‏.‏ فَقَالَ عُمَرُ أَمَا وَاللَّهِ إِنْ شَاءَ اللَّهُ لأَقُومَنَّ بِذَلِكَ أَوَّلَ مَقَامٍ أَقُومُهُ بِالْمَدِينَةِ‏.‏ قَالَ ابْنُ عَبَّاسٍ فَقَدِمْنَا الْمَدِينَةَ فِي عَقِبِ ذِي الْحَجَّةِ، فَلَمَّا كَانَ يَوْمُ الْجُمُعَةِ عَجَّلْنَا الرَّوَاحَ حِينَ زَاغَتِ الشَّمْسُ، حَتَّى أَجِدَ سَعِيدَ بْنَ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ جَالِسًا إِلَى رُكْنِ الْمِنْبَرِ، فَجَلَسْتُ حَوْلَهُ تَمَسُّ رُكْبَتِي رُكْبَتَهُ، فَلَمْ أَنْشَبْ أَنْ خَرَجَ عُمَرُ بْنُ الْخَطَّابِ، فَلَمَّا رَأَيْتُهُ مُقْبِلاً قُلْتُ لِسَعِيدِ بْنِ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ، لَيَقُولَنَّ الْعَشِيَّةَ مَقَالَةً لَمْ يَقُلْهَا مُنْذُ اسْتُخْلِفَ، فَأَنْكَرَ عَلَىَّ وَقَالَ مَا عَسَيْتَ أَنْ يَقُولَ مَا لَمْ يَقُلْ‏.‏ قَبْلَهُ فَجَلَسَ عُمَرُ عَلَى الْمِنْبَرِ، فَلَمَّا سَكَتَ الْمُؤَذِّنُونَ قَامَ فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ قَالَ أَمَّا بَعْدُ فَإِنِّي قَائِلٌ لَكُمْ مَقَالَةً قَدْ قُدِّرَ لِي أَنْ أَقُولَهَا، لاَ أَدْرِي لَعَلَّهَا بَيْنَ يَدَىْ أَجَلِي، فَمَنْ عَقَلَهَا وَوَعَاهَا فَلْيُحَدِّثْ بِهَا حَيْثُ انْتَهَتْ بِهِ رَاحِلَتُهُ، وَمَنْ خَشِيَ أَنْ لاَ يَعْقِلَهَا فَلاَ أُحِلُّ لأَحَدٍ أَنْ يَكْذِبَ عَلَىَّ، إِنَّ اللَّهَ بَعَثَ مُحَمَّدًا صلى الله عليه وسلم بِالْحَقِّ وَأَنْزَلَ عَلَيْهِ الْكِتَابَ فَكَانَ مِمَّا أَنْزَلَ اللَّهُ آيَةُ الرَّجْمِ، فَقَرَأْنَاهَا وَعَقَلْنَاهَا وَوَعَيْنَاهَا، رَجَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَرَجَمْنَا بَعْدَهُ، فَأَخْشَى إِنْ طَالَ بِالنَّاسِ زَمَانٌ أَنْ يَقُولَ قَائِلٌ وَاللَّهِ مَا نَجِدُ آيَةَ الرَّجْمِ فِي كِتَابِ اللَّهِ، فَيَضِلُّوا بِتَرْكِ فَرِيضَةٍ أَنْزَلَهَا اللَّهُ، وَالرَّجْمُ فِي كِتَابِ اللَّهِ حَقٌّ عَلَى مَنْ زَنَى إِذَا أُحْصِنَ مِنَ الرِّجَالِ وَالنِّسَاءِ، إِذَا قَامَتِ الْبَيِّنَةُ أَوْ كَانَ الْحَبَلُ أَوْ الاِعْتِرَافُ، ثُمَّ إِنَّا كُنَّا نَقْرَأُ فِيمَا نَقْرَأُ مِنْ كِتَابِ اللَّهِ أَنْ لاَ تَرْغَبُوا عَنْ آبَائِكُمْ، فَإِنَّهُ كُفْرٌ بِكُمْ أَنْ تَرْغَبُوا عَنْ آبَائِكُمْ، أَوْ إِنَّ كُفْرًا بِكُمْ أَنْ تَرْغَبُوا عَنْ آبَائِكُمْ، أَلاَ ثُمَّ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تُطْرُونِي كَمَا أُطْرِيَ عِيسَى ابْنُ مَرْيَمَ وَقُولُوا عَبْدُ اللَّهِ وَرَسُولُهُ ‏\"‏‏.‏ ثُمَّ إِنَّهُ بَلَغَنِي أَنَّ قَائِلاً مِنْكُمْ يَقُولُ وَاللَّهِ لَوْ مَاتَ عُمَرُ بَايَعْتُ فُلاَنًا‏.‏ فَلاَ يَغْتَرَّنَّ امْرُؤٌ أَنْ يَقُولَ إِنَّمَا كَانَتْ بَيْعَةُ أَبِي بَكْرٍ فَلْتَةً وَتَمَّتْ أَلاَ وَإِنَّهَا قَدْ كَانَتْ كَذَلِكَ وَلَكِنَّ اللَّهَ وَقَى شَرَّهَا، وَلَيْسَ مِنْكُمْ مَنْ تُقْطَعُ الأَعْنَاقُ إِلَيْهِ مِثْلُ أَبِي بَكْرٍ، مَنْ بَايَعَ رَجُلاً عَنْ غَيْرِ مَشُورَةٍ مِنَ الْمُسْلِمِينَ فَلاَ يُبَايَعُ هُوَ وَلاَ الَّذِي بَايَعَهُ تَغِرَّةً أَنْ يُقْتَلاَ، وَإِنَّهُ قَدْ كَانَ مِنْ خَبَرِنَا حِينَ تَوَفَّى اللَّهُ نَبِيَّهُ صلى الله عليه وسلم إِلاَّ أَنَّ الأَنْصَارَ خَالَفُونَا وَاجْتَمَعُوا بِأَسْرِهِمْ فِي سَقِيفَةِ بَنِي سَاعِدَةَ، وَخَالَفَ عَنَّا عَلِيٌّ وَالزُّبَيْرُ وَمَنْ مَعَهُمَا، وَاجْتَمَعَ الْمُهَاجِرُونَ إِلَى أَبِي بَكْرٍ فَقُلْتُ لأَبِي بَكْرٍ يَا أَبَا بَكْرٍ انْطَلِقْ بِنَا إِلَى إِخْوَانِنَا هَؤُلاَءِ مِنَ الأَنْصَارِ‏.‏ فَانْطَلَقْنَا نُرِيدُهُمْ فَلَمَّا دَنَوْنَا مِنْهُمْ لَقِيَنَا مِنْهُمْ رَجُلاَنِ صَالِحَانِ، فَذَكَرَا مَا تَمَالَى عَلَيْهِ الْقَوْمُ فَقَالاَ أَيْنَ تُرِيدُونَ يَا مَعْشَرَ الْمُهَاجِرِينَ فَقُلْنَا نُرِيدُ إِخْوَانَنَا هَؤُلاَءِ مِنَ الأَنْصَارِ‏.‏ فَقَالاَ لاَ عَلَيْكُمْ أَنْ لاَ تَقْرَبُوهُمُ اقْضُوا أَمْرَكُمْ‏.‏ فَقُلْتُ وَاللَّهِ لَنَأْتِيَنَّهُمْ‏.‏ فَانْطَلَقْنَا حَتَّى أَتَيْنَاهُمْ فِي سَقِيفَةِ بَنِي سَاعِدَةَ، فَإِذَا رَجُلٌ مُزَمَّلٌ بَيْنَ ظَهْرَانَيْهِمْ فَقُلْتُ مَنْ هَذَا فَقَالُوا هَذَا سَعْدُ بْنُ عُبَادَةَ‏.‏ فَقُلْتُ مَا لَهُ قَالُوا يُوعَكُ‏.‏ فَلَمَّا جَلَسْنَا قَلِيلاً تَشَهَّدَ خَطِيبُهُمْ، فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ أَمَّا بَعْدُ فَنَحْنُ أَنْصَارُ اللَّهِ وَكَتِيبَةُ الإِسْلاَمِ، وَأَنْتُمْ مَعْشَرَ الْمُهَاجِرِينَ رَهْطٌ، وَقَدْ دَفَّتْ دَافَّةٌ مِنْ قَوْمِكُمْ، فَإِذَا هُمْ يُرِيدُونَ أَنْ يَخْتَزِلُونَا مِنْ أَصْلِنَا وَأَنْ يَحْضُنُونَا مِنَ الأَمْرِ‏.‏ فَلَمَّا سَكَتَ أَرَدْتُ أَنْ أَتَكَلَّمَ وَكُنْتُ زَوَّرْتُ مَقَالَةً أَعْجَبَتْنِي أُرِيدُ أَنْ أُقَدِّمَهَا بَيْنَ يَدَىْ أَبِي بَكْرٍ، وَكُنْتُ أُدَارِي مِنْهُ بَعْضَ الْحَدِّ، فَلَمَّا أَرَدْتُ أَنْ أَتَكَلَّمَ قَالَ أَبُو بَكْرٍ عَلَى رِسْلِكَ‏.‏ فَكَرِهْتُ أَنْ أُغْضِبَهُ، فَتَكَلَّمَ أَبُو بَكْرٍ فَكَانَ هُوَ أَحْلَمَ مِنِّي وَأَوْقَرَ، وَاللَّهِ مَا تَرَكَ مِنْ كَلِمَةٍ أَعْجَبَتْنِي فِي تَزْوِيرِي إِلاَّ قَالَ فِي بَدِيهَتِهِ مِثْلَهَا أَوْ أَفْضَلَ مِنْهَا حَتَّى سَكَتَ فَقَالَ مَا ذَكَرْتُمْ فِيكُمْ مِنْ خَيْرٍ فَأَنْتُمْ لَهُ أَهْلٌ، وَلَنْ يُعْرَفَ هَذَا الأَمْرُ إِلاَّ لِهَذَا الْحَىِّ مِنْ قُرَيْشٍ، هُمْ أَوْسَطُ الْعَرَبِ نَسَبًا وَدَارًا، وَقَدْ رَضِيتُ لَكُمْ أَحَدَ هَذَيْنِ الرَّجُلَيْنِ، فَبَايِعُوا أَيَّهُمَا شِئْتُمْ‏.‏ فَأَخَذَ بِيَدِي وَبِيَدِ أَبِي عُبَيْدَةَ بْنِ الْجَرَّاحِ وَهْوَ جَالِسٌ بَيْنَنَا، فَلَمْ أَكْرَهْ مِمَّا قَالَ غَيْرَهَا، كَانَ وَاللَّهِ أَنْ أُقَدَّمَ فَتُضْرَبَ عُنُقِي لاَ يُقَرِّبُنِي ذَلِكَ مِنْ إِثْمٍ، أَحَبَّ إِلَىَّ مِنْ أَنْ أَتَأَمَّرَ عَلَى قَوْمٍ فِيهِمْ أَبُو بَكْرٍ، اللَّهُمَّ إِلاَّ أَنْ تُسَوِّلَ إِلَىَّ نَفْسِي عِنْدَ الْمَوْتِ شَيْئًا لاَ أَجِدُهُ الآنَ‏.‏ فَقَالَ قَائِلٌ مِنَ الأَنْصَارِ أَنَا جُذَيْلُهَا الْمُحَكَّكُ، وَعُذَيْقُهَا الْمُرَجَّبُ، مِنَّا أَمِيرٌ، وَمِنْكُمْ أَمِيرٌ، يَا مَعْشَرَ قُرَيْشٍ‏.‏ فَكَثُرَ اللَّغَطُ، وَارْتَفَعَتِ الأَصْوَاتُ حَتَّى فَرِقْتُ مِنَ الاِخْتِلاَفِ‏.‏ فَقُلْتُ ابْسُطْ يَدَكَ يَا أَبَا بَكْرٍ‏.‏ فَبَسَطَ يَدَهُ فَبَايَعْتُهُ، وَبَايَعَهُ الْمُهَاجِرُونَ، ثُمَّ بَايَعَتْهُ الأَنْصَارُ، وَنَزَوْنَا عَلَى سَعْدِ بْنِ عُبَادَةَ فَقَالَ قَائِلٌ مِنْهُمْ قَتَلْتُمْ سَعْدَ بْنَ عُبَادَةَ‏.‏ فَقُلْتُ قَتَلَ اللَّهُ سَعْدَ بْنَ عُبَادَةَ‏.‏ قَالَ عُمَرُ وَإِنَّا وَاللَّهِ مَا وَجَدْنَا فِيمَا حَضَرْنَا مِنْ أَمْرٍ أَقْوَى مِنْ مُبَايَعَةِ أَبِي بَكْرٍ خَشِينَا إِنْ فَارَقْنَا الْقَوْمَ وَلَمْ تَكُنْ بَيْعَةٌ أَنْ يُبَايِعُوا رَجُلاً مِنْهُمْ بَعْدَنَا، فَإِمَّا بَايَعْنَاهُمْ عَلَى مَا لاَ نَرْضَى، وَإِمَّا نُخَالِفُهُمْ فَيَكُونُ فَسَادٌ، فَمَنْ بَايَعَ رَجُلاً عَلَى غَيْرِ مَشُورَةٍ مِنَ الْمُسْلِمِينَ فَلاَ يُتَابَعُ هُوَ وَلاَ الَّذِي بَايَعَهُ تَغِرَّةً أَنْ يُقْتَلاَ‏.‏",
    "malay_translation": "Kami telah meriwayatkan daripada Abd al-Aziz bin Abdullah, yang telah meriwayatkan daripada Ibrahim bin Saad, daripada Saleh, daripada Ibnu Syihab, daripada Ubaidullah bin Abdullah bin Utbah bin Mas'ud, daripada Ibnu Abbas, katanya: Aku biasa mengajar al-Quran kepada segelintir orang Muhajirin, antaranya ialah Abd al-Rahman bin Auf.  Ketika aku berada di rumahnya di Mina, dan dia bersama Umar bin al-Khattab ketika Haji terakhir Umar, tiba-tiba Abd al-Rahman datang kepadaku dan berkata, “Seandainya engkau melihat seorang lelaki yang datang kepada Amirul Mukminin hari ini dan berkata, ‘Wahai Amirul Mukminin, apakah pandanganmu tentang fulan yang berkata, sekiranya Umar mati, nescaya aku akan memberi bai’ah kepada fulan. Demi Allah, bai’ah Abu Bakar hanyalah satu tindakan secara tiba-tiba, tetapi ia tetap berjaya.’ Umar marah kemudian berkata, ‘Insya-Allah, aku akan berdiri di hadapan orang ramai petang ini, lalu aku akan memberi amaran kepada mereka yang ingin merampas hak mereka (isu kepimpinan).’ Abd al-Rahman berkata, “Lalu aku berkata, ‘Wahai Amirul Mukminin, janganlah engkau lakukan itu, kerana musim haji menghimpunkan orang ramai yang tidak terpelajar dan golongan bawahan. Mereka inilah yang akan berada di sekelilingmu tatkala engkau berdiri di hadapan orang ramai. Aku khuatir engkau akan berucap, lalu ucapanmu itu tersebar luas, tetapi mereka tidak faham maksudnya dan mungkin mereka salah tafsir. Oleh itu, bersabarlah sehingga engkau sampai ke Madinah, kerana ia adalah tempat hijrah dan tempat Sunnah Nabi, di mana engkau boleh berhubung dengan golongan alim ulama dan orang kenamaan, lalu engkau dapat menyampaikan pendapatmu dengan tenang.  Golongan alim ulama akan memahami ucapanmu dan meletakkannya pada tempat yang sepatutnya.’  Atas mendengar itu, Umar berkata, ‘Demi Allah, Insya-Allah aku akan melakukannya pada ucapan pertamaku di Madinah.’ Ibnu Abbas berkata, “Kami sampai di Madinah pada penghujung Zulhijjah. Apabila tiba hari Jumaat, kami bergegas pergi ke masjid sebaik sahaja matahari condong. Aku dapati Said bin Zaid bin Amr bin Nufail duduk di sudut mimbar. Aku duduk di sebelahnya sehingga lututku menyentuh lututnya. Tidak lama kemudian, Umar bin al-Khattab keluar. Tatkala aku melihatnya datang ke arah kami, aku berkata kepada Said bin Zaid bin Amr bin Nufail, ‘Petang ini Umar akan berucap sesuatu yang belum pernah diucapkannya sejak dilantik sebagai Khalifah.’ Said menyangkal ucapanku dengan terkejut dan bertanya, ‘Apakah yang engkau sangka Umar akan ucapkan yang belum pernah diucapkannya sebelum ini?’  Umar duduk di atas mimbar. Setelah para muazin berhenti azan, Umar berdiri lalu memuji Allah SWT sebagaimana yang layak bagi-Nya.  Beliau berkata, ‘Kemudian, sesungguhnya aku akan berkata kepada kamu sesuatu yang telah ditentukan untuk aku ucapkan. Aku tidak tahu, mungkin ini petanda ajalku.  Barangsiapa yang faham dan mengingati, hendaklah menceritakannya ke mana sahaja tunggangannya membawanya.  Manakala sesiapa yang khuatir tidak faham, maka tidak halal bagi sesiapa pun berdusta tentangku.  Sesungguhnya Allah SWT telah mengutus Muhammad SAW dengan kebenaran dan menurunkan Kitab kepadanya.  Antara yang Allah SWT turunkan ialah ayat al-Rajam (rajam bagi lelaki dan perempuan yang berzina yang telah berkahwin),  kami telah membacanya, memahaminya dan mengingatnya. Rasulullah SAW telah melaksanakan hukuman rajam dan begitu juga kami selepas baginda. Aku bimbang sekiranya berlalu masa yang lama, nanti akan ada yang berkata, ‘Demi Allah, kami tidak menemui ayat al-Rajam dalam Kitabullah,’ lalu mereka sesat dengan meninggalkan satu fardhu yang diturunkan Allah SWT. Hukuman rajam itu adalah hak Allah SWT ke atas sesiapa yang berzina jika telah berkahwin, sama ada lelaki atau perempuan, jika ada bukti yang kukuh, atau hamil atau mengaku bersalah.  Kemudian kami membaca dalam Kitabullah: ‘Wahai manusia, janganlah kamu mengaku keturunan selain daripada bapa kamu, kerana sesungguhnya itu adalah kekufuran daripada kamu jika kamu mengaku keturunan selain daripada bapa kamu yang sebenar.’  Kemudian Rasulullah SAW bersabda: ‘Janganlah kamu memuji aku secara berlebihan sebagaimana Isa bin Maryam dipuji, tetapi panggillah aku hamba Allah dan Rasul-Nya.’ Aku telah dimaklumkan bahawa ada di kalangan kamu yang berkata, ‘Demi Allah, sekiranya Umar mati, aku akan memberi bai’ah kepada fulan.’ Janganlah sesiapa merasa yakin dengan mengatakan bai’ah kepada Abu Bakar itu berlaku secara tiba-tiba dan ia berjaya.  Memang benar ia berlaku demikian, tetapi Allah SWT telah menyelamatkan (umat Islam) daripada keburukannya.  Dan tiada sesiapa pun di kalangan kamu yang mempunyai sifat seperti Abu Bakar. Ingatlah, sesiapa yang memberi bai’ah kepada sesiapa sahaja tanpa bermesyuarat dengan orang Islam yang lain, maka orang itu dan juga orang yang dibai’atnya tidak akan disokong,  sehingga mereka berdua akan dibunuh.  Setelah kewafatan Nabi SAW, kami telah mendapat khabar bahawa Ansar tidak setuju dengan kami dan berkumpul di Saqifah Bani Sa’adah. Ali, Zubair dan pengikut mereka menentang kami, sementara Muhajirin berkumpul bersama Abu Bakar. Aku berkata kepada Abu Bakar, ‘Marilah kita pergi kepada saudara-saudara Ansar kita.’ Maka kami pergi menemui mereka. Tatkala kami hampir sampai, dua orang lelaki yang soleh daripada mereka menemui kami dan memberitahu keputusan akhir Ansar. Mereka berkata, ‘Wahai sekalian Muhajirin, ke mana kamu hendak pergi?’ Kami menjawab, ‘Kami hendak pergi kepada saudara-saudara Ansar kami.’ Mereka berkata, ‘Janganlah kamu menghampiri mereka, selesaikan urusan kamu.’ Aku berkata, ‘Demi Allah, kami akan menemui mereka.’ Kami terus pergi sehingga kami sampai di Saqifah Bani Sa’adah.  Ada seorang lelaki berselimut di tengah-tengah mereka. Aku bertanya, ‘Siapakah orang itu?’ Mereka menjawab, ‘Dia ialah Saad bin Ubadah.’ Aku bertanya, ‘Apakah penyakitnya?’ Mereka berkata, ‘Dia sakit.’ Setelah kami duduk sebentar, jurucakap Ansar mengucapkan syahadah dan memuji Allah SWT sebagaimana yang layak bagi-Nya. Kemudian dia berkata, ‘Kemudian, kami adalah Ansar Allah dan tentera Islam, manakala kamu sekalian Muhajirin hanya segelintir, dan ada sebahagian daripada kamu datang dengan niat untuk menghalang kami daripada melaksanakan perkara ini (khalifah) dan merampas hak kami.’ Setelah jurucakap itu berhenti, aku ingin berucap, kerana aku telah menyediakan ucapan yang aku suka dan ingin sampaikan di hadapan Abu Bakar. Aku biasa berhati-hati agar tidak menyinggung perasaannya. Tatkala aku hendak berucap, Abu Bakar berkata, ‘Tunggu sebentar.’ Aku tidak mahu membuatnya marah. Maka Abu Bakar sendiri berucap, dan dia lebih bijaksana dan sabar daripada aku.  Demi Allah, dia tidak meninggalkan satu pun ayat yang aku suka dalam ucapanku yang telah disediakan, sebaliknya dia berucap serupa atau lebih baik secara spontan. Selepas sejenak, dia berkata, ‘Wahai Ansar, kamu layak dengan semua (sifat baik yang kamu sebutkan), tetapi perkara ini (khalifah) hanya untuk Quraisy, kerana mereka adalah yang terbaik di kalangan Arab dari segi keturunan dan tempat tinggal. Aku redha bagi kamu salah seorang daripada dua orang ini, maka bai’atlah siapa yang kamu suka.’ Kemudian Abu Bakar memegang tanganku dan tangan Abu Ubaidah bin al-Jarrah yang duduk di antara kami.  Tiada apa yang aku benci daripada ucapannya melainkan cadangan itu, kerana demi Allah, aku lebih rela dipancung leherku sebagai penebus dosa daripada menjadi pemerintah atas suatu kaum yang di antaranya ialah Abu Bakar, kecuali jika pada saat ajalku nanti, hatiku sendiri menginginkan sesuatu yang aku tidak rasakan sekarang.’  Kemudian seorang daripada Ansar berkata, ‘Aku adalah tiang tempat unta yang berpenyakit kulit menggosokkan diri untuk menghilangkan gatal (iaitu, aku adalah orang yang mulia) dan aku adalah seperti pokok kurma yang tinggi!  Wahai Quraisy, hendaklah ada seorang pemerintah daripada kami dan seorang daripada kamu.’  Kemudian timbul kekecohan, dan suara-suara semakin meninggi, sehingga aku takut akan berlaku perselisihan yang besar.  Aku berkata, ‘Wahai Abu Bakar, hulurkan tanganmu.’ Dia menghulurkan tangannya dan aku memberi bai’ah kepadanya, kemudian semua Muhajirin memberi bai’ah, kemudian Ansar.  Maka kami menang atas Saad bin Ubadah (yang ingin diangkat sebagai pemerintah oleh Ansar).  Seseorang daripada Ansar berkata, ‘Kamu telah membunuh Saad bin Ubadah.’ Aku menjawab, ‘Allah SWT telah membunuh Saad bin Ubadah.’ Umar berkata, ‘Demi Allah, selain daripada tragedi besar yang menimpa kami (iaitu kematian Nabi), tidak ada masalah yang lebih besar daripada bai’ah kepada Abu Bakar, kerana kami khuatir jika kami meninggalkan orang ramai, mereka mungkin akan memberi bai’ah kepada seorang daripada mereka selepas kami.  Maka sama ada kami menerima bai’ah mereka atas sesuatu yang tidak kami redha, atau kami menentang mereka, lalu berlakulah kerosakan.  Oleh itu, sesiapa yang memberi bai’ah kepada seseorang tanpa bermesyuarat dengan orang Islam yang lain, maka orang yang dibai’atnya dan juga pemberi bai’ah itu tidak akan disokong, sehingga mereka berdua akan dibunuh.”"
  },
  {
    "id": 6582,
    "hadith_number": 6582,
    "tajuk_hadith": "Hukuman Zina Bagi Yang Belum Berkahwin",
    "perawi_melayu": "Daripada Zaid bin Khalid Al-Juhani:",
    "english_text": "I heard the Prophet (ﷺ) ordering that an unmarried person guilty of illegal sexual intercourse be flogged one-hundred stripes and be exiled for one year. `Umar bin Al-Khattab also exiled such a person, and this tradition is still valid.",
    "arabic_text": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، أَخْبَرَنَا ابْنُ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَأْمُرُ فِيمَنْ زَنَى وَلَمْ يُحْصَنْ جَلْدَ مِائَةٍ وَتَغْرِيبَ عَامٍ‏.‏   قَالَ ابْنُ شِهَابٍ وَأَخْبَرَنِي عُرْوَةَ بْنُ الزُّبَيْرِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، غَرَّبَ، ثُمَّ لَمْ تَزَلْ تِلْكَ السُّنَّةَ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW memerintahkan bahawa orang yang belum berkahwin yang melakukan zina hendaklah disebat seratus kali dan dibuang negeri selama setahun. Umar bin Al-Khattab juga membuang negeri orang sedemikian, dan sunnah ini masih lagi sah."
  },
  {
    "id": 6583,
    "hadith_number": 6583,
    "tajuk_hadith": "Hukuman Zina Bagi Yang Belum Berkahwin",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "Allah's Messenger (ﷺ) judged that the unmarried person who was guilty of illegal sexual intercourse be exiled for one year and receive the legal punishment (i.e., be flogged with one-hundred stripes).",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى فِيمَنْ زَنَى وَلَمْ يُحْصَنْ بِنَفْىِ عَامٍ بِإِقَامَةِ الْحَدِّ عَلَيْهِ‏.‏",
    "malay_translation": "Rasulullah SAW telah memutuskan hukuman bagi orang yang belum berkahwin yang melakukan zina ialah dibuang negeri selama setahun dan dikenakan hukuman had iaitu disebat seratus kali."
  },
  {
    "id": 6584,
    "hadith_number": 6584,
    "tajuk_hadith": "Laknat ke atas Lelaki Berlaku Seperti Wanita dan Wanita Berlaku Seperti Lelaki",
    "perawi_melayu": "Riwayat Ibnu Abbas:",
    "english_text": "The Prophet (ﷺ) cursed the effeminate men and those women who assume the similitude (manners) of men. He also said, \"Turn them out of your houses.\" He turned such-and-such person out, and `Umar also turned out such-and-such person.",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا يَحْيَى، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَعَنَ النَّبِيُّ صلى الله عليه وسلم الْمُخَنَّثِينَ مِنَ الرِّجَالِ، وَالْمُتَرَجِّلاَتِ مِنَ النِّسَاءِ، وَقَالَ ‏\n\"‏ أَخْرِجُوهُمْ مِنْ بُيُوتِكُمْ ‏\"‏‏.‏ وَأَخْرَجَ فُلاَنًا، وَأَخْرَجَ عُمَرُ فُلاَنًا‏.‏",
    "malay_translation": "Daripada Ibnu Abbas r.a. bahawa Nabi SAW melaknat lelaki yang berkelakuan seperti perempuan dan perempuan yang berkelakuan seperti lelaki. Baginda SAW juga bersabda: \"Keluarkan mereka dari rumah kamu.\" Baginda SAW telah mengeluarkan seseorang, dan Umar juga telah mengeluarkan seseorang."
  },
  {
    "id": 6585,
    "hadith_number": 6585,
    "tajuk_hadith": "Hukum Zina dan Qisas",
    "perawi_melayu": "Riwayat Abu Hurairah dan Zaid bin Khalid:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَاصِمُ بْنُ عَلِيٍّ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ، عَنْ أَبِي هُرَيْرَةَ، وَزَيْدِ بْنِ خَالِدٍ، أَنَّ رَجُلاً، مِنَ الأَعْرَابِ جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم وَهْوَ جَالِسٌ فَقَالَ يَا رَسُولَ اللَّهِ اقْضِ بِكِتَابِ اللَّهِ‏.‏ فَقَامَ خَصْمُهُ فَقَالَ صَدَقَ اقْضِ لَهُ يَا رَسُولَ اللَّهِ بِكِتَابِ اللَّهِ، إِنَّ ابْنِي كَانَ عَسِيفًا عَلَى هَذَا فَزَنَى بِامْرَأَتِهِ فَأَخْبَرُونِي أَنَّ عَلَى ابْنِي الرَّجْمَ، فَافْتَدَيْتُ بِمِائَةٍ مِنَ الْغَنَمِ وَوَلِيدَةٍ، ثُمَّ سَأَلْتُ أَهْلَ الْعِلْمِ، فَزَعَمُوا أَنَّ مَا عَلَى ابْنِي جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ‏.‏ فَقَالَ ‏\n\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ، أَمَّا الْغَنَمُ وَالْوَلِيدَةُ فَرَدٌّ عَلَيْكَ، وَعَلَى ابْنِكَ جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ، وَأَمَّا أَنْتَ يَا أُنَيْسُ فَاغْدُ عَلَى امْرَأَةِ هَذَا فَارْجُمْهَا ‏\"‏‏.‏ فَغَدَا أُنَيْسٌ فَرَجَمَهَا‏.‏",
    "malay_translation": "Telah menceritakan kepada kami, 'Aasim bin 'Ali, telah menceritakan kepada kami, Ibnu Abi Dzi-b, dari Az- Zuhri, dari 'Ubaidillah, dari Abu Hurairah dan Zaid bin Khalid, bahawa seorang lelaki dari kalangan Badwi datang kepada Nabi SAW ketika baginda sedang duduk, lalu berkata, \"Wahai Rasulullah, putuskanlah perkara ini berdasarkan Kitabullah.\" Maka bangunlah pihak yang berlawanan, lalu berkata, \"Dia telah berkata benar, wahai Rasulullah, putuskanlah perkara ini berdasarkan Kitabullah. Sesungguhnya anakku bekerja sebagai pekerja untuk lelaki ini, lalu dia berzina dengan isterinya. Maka mereka memberitahu aku bahawa anakku sepatutnya dirajam. Lalu aku menebus dengan seratus ekor kambing dan seorang hamba perempuan. Kemudian aku bertanya kepada para ulama, maka mereka menyatakan bahawa hukuman ke atas anakku ialah disebat seratus kali dan dibuang negeri selama setahun.\"  Maka Rasulullah SAW bersabda, \"Demi Allah yang jiwaku berada di tangan-Nya, sesungguhnya Aku akan memutuskan di antara kamu berdua berdasarkan Kitabullah. Adapun kambing dan hamba perempuan itu, dikembalikan kepadamu, dan ke atas anakmu ialah hukuman disebat seratus kali dan dibuang negeri selama setahun. Dan adapun engkau wahai Unais, pergilah esok kepada isteri lelaki ini dan rajamlah dia.\" Maka Unais pergi pada keesokan harinya dan merajamnya."
  },
  {
    "id": 6586,
    "hadith_number": 6586,
    "tajuk_hadith": "Hukuman Zina Bagi Hamba Perempuan Yang Belum Menikah",
    "perawi_melayu": "Riwayat Abu Hurairah dan Zaid bin Khalid:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي هُرَيْرَةَ، وَزَيْدِ بْنِ خَالِدٍ، رضى الله عنهما أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ عَنِ الأَمَةِ إِذَا زَنَتْ وَلَمْ تُحْصَنْ قَالَ ‏\n\"‏ إِذَا زَنَتْ فَاجْلِدُوهَا، ثُمَّ إِنْ زَنَتْ فَاجْلِدُوهَا، ثُمَّ إِنْ زَنَتْ فَاجْلِدُوهَا، ثُمَّ بِيعُوهَا وَلَوْ بِضَفِيرٍ ‏\"‏‏.‏ قَالَ ابْنُ شِهَابٍ لاَ أَدْرِي بَعْدَ الثَّالِثَةِ أَوِ الرَّابِعَةِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Yusuf, telah memberitakan kepada kami Malik, dari Ibnu Syihab, dari Ubaidillah bin Abdullah, dari Abu Hurairah dan Zaid bin Khalid, ra bahawa Rasulullah SAW ditanya tentang hamba perempuan jika dia berzina dan belum dikahwinkan. Baginda SAW bersabda: \"Jika dia berzina, maka dera dia (lima puluh sebatan), kemudian jika dia berzina lagi, maka dera dia (lima puluh sebatan), kemudian jika dia berzina lagi, maka dera dia (lima puluh sebatan), kemudian jual dia, walaupun hanya dengan sehelai rambut.\" Ibnu Syihab berkata: \"Aku tidak pasti, selepas kali ketiga atau keempat.\" "
  },
  {
    "id": 6587,
    "hadith_number": 6587,
    "tajuk_hadith": "Hukuman Wanita Hamba Yang Berzina",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \"If a lady slave commits illegal sexual intercourse and she is proved guilty of illegal \nsexual intercourse, then she should be flogged (fifty stripes) but she should not be admonished; and if \nshe commits illegal sexual intercourse again, then she should be flogged again but should not be \nadmonished; and if she commits illegal sexual intercourse for the third time, then she should be sold \neven for a hair rope.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ سَمِعَهُ يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِذَا زَنَتِ الأَمَةُ فَتَبَيَّنَ زِنَاهَا فَلْيَجْلِدْهَا وَلاَ يُثَرِّبْ، ثُمَّ إِنْ زَنَتْ فَلْيَجْلِدْهَا وَلاَ يُثَرِّبْ، ثُمَّ إِنْ زَنَتِ الثَّالِثَةَ فَلْيَبِعْهَا وَلَوْ بِحَبْلٍ مِنْ شَعَرٍ ‏\"‏‏.‏ تَابَعَهُ إِسْمَاعِيلُ بْنُ أُمَيَّةَ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Jika seorang hamba perempuan melakukan zina dan zina itu terbukti, maka hendaklah dia disebat (lima puluh kali) tetapi jangan ditegur. Kemudian jika dia melakukan zina lagi, maka hendaklah dia disebat lagi tetapi jangan ditegur. Kemudian jika dia melakukan zina untuk kali ketiga, maka hendaklah dia dijual, walaupun hanya dengan sehelai tali rambut.\""
  },
  {
    "id": 6588,
    "hadith_number": 6588,
    "tajuk_hadith": "Rajam oleh Nabi SAW",
    "perawi_melayu": "Daripada Asy-Syaibani:",
    "english_text": "I asked `Abdullah bin Abi `Aufa about the Rajam (stoning somebody to death for committing illegal \nsexual intercourse). He replied, \"The Prophet (ﷺ) carried out the penalty of Rajam,\" I asked, \"Was that \nbefore or after the revelation of Surat-an-Nur?\" He replied, \"I do not know.\"",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الشَّيْبَانِيُّ، سَأَلْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى عَنِ الرَّجْمِ، فَقَالَ رَجَمَ النَّبِيُّ صلى الله عليه وسلم‏.‏ فَقُلْتُ أَقَبْلَ النُّورِ أَمْ بَعْدَهُ قَالَ لاَ أَدْرِي‏.‏ تَابَعَهُ عَلِيُّ بْنُ مُسْهِرٍ وَخَالِدُ بْنُ عَبْدِ اللَّهِ وَالْمُحَارِبِيُّ وَعَبِيدَةُ بْنُ حُمَيْدٍ عَنِ الشَّيْبَانِيِّ‏.‏ وَقَالَ بَعْضُهُمُ الْمَائِدَةُ‏.‏ وَالأَوَّلُ أَصَحُّ‏.‏",
    "malay_translation": "Aku bertanya kepada Abdullah bin Abi Aufa tentang hukum rajam (merajam sehingga mati bagi mereka yang melakukan zina).  Beliau menjawab, \"Nabi SAW telah melaksanakan hukuman rajam.\" Aku bertanya lagi, \"Adakah ia sebelum atau selepas wahyu surah An-Nur?\" Beliau menjawab, \"Aku tidak tahu.\""
  },
  {
    "id": 6589,
    "hadith_number": 6589,
    "tajuk_hadith": "Hukuman Rajam dalam Taurat",
    "perawi_melayu": "Riwayat Abdullah bin Umar",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّهُ قَالَ إِنَّ الْيَهُودَ جَاءُوا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرُوا لَهُ أَنَّ رَجُلاً مِنْهُمْ وَامْرَأَةً زَنَيَا فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا تَجِدُونَ فِي التَّوْرَاةِ فِي شَأْنِ الرَّجْمِ ‏\"‏‏.‏ فَقَالُوا نَفْضَحُهُمْ وَيُجْلَدُونَ‏.‏ قَالَ عَبْدُ اللَّهِ بْنُ سَلاَمٍ كَذَبْتُمْ إِنَّ فِيهَا الرَّجْمَ‏.‏ فَأَتَوْا بِالتَّوْرَاةِ فَنَشَرُوهَا، فَوَضَعَ أَحَدُهُمْ يَدَهُ عَلَى آيَةِ الرَّجْمِ فَقَرَأَ مَا قَبْلَهَا وَمَا بَعْدَهَا‏.‏ فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ سَلاَمٍ ارْفَعْ يَدَكَ‏.‏ فَرَفَعَ يَدَهُ فَإِذَا فِيهَا آيَةُ الرَّجْمِ‏.‏ قَالُوا صَدَقَ يَا مُحَمَّدُ فِيهَا آيَةُ الرَّجْمِ‏.‏ فَأَمَرَ بِهِمَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَرُجِمَا، فَرَأَيْتُ الرَّجُلَ يَحْنِي عَلَى الْمَرْأَةِ يَقِيهَا الْحِجَارَةَ‏.‏",
    "malay_translation": "Kami diberitakan oleh Ismail bin Abdullah, yang mana telah menceritakan kepadaku Malik, daripada Nafi', daripada Abdullah bin Umar r.a., bahawa baginda berkata: “Orang-orang Yahudi datang kepada Rasulullah SAW lalu memberitahu baginda bahawa seorang lelaki dan seorang perempuan daripada kalangan mereka telah melakukan zina.  Maka Rasulullah SAW bertanya kepada mereka, “Apakah yang kamu dapati dalam Taurat tentang hukum rajam?” Mereka menjawab, “Kami hanya akan mendedahkan aib mereka dan menyeksa mereka dengan sebatan.” Abdullah bin Salam berkata, “Kamu berdusta! Sesungguhnya hukuman rajam itu ada di dalam Taurat.”  Maka mereka membawa Taurat dan membukanya.  Salah seorang daripada mereka meletakkan tangannya di atas ayat tentang rajam, lalu membaca ayat-ayat sebelum dan sesudahnya. Abdullah bin Salam berkata kepadanya, “Angkat tanganmu!”  Maka dia mengangkat tangannya, dan ternyata di situ ada ayat tentang rajam. Mereka berkata, “Wahai Muhammad! Dia telah berkata benar, sesungguhnya ayat tentang rajam itu ada di dalamnya (Taurat).” Maka Rasulullah SAW memerintahkan supaya kedua-dua orang itu dirajam sehingga mati, dan mereka dirajam.  Aku melihat lelaki itu membongkok ke atas perempuan itu untuk melindunginya daripada terkena batu.”"
  },
  {
    "id": 6590,
    "hadith_number": 6590,
    "tajuk_hadith": "Hukum Allah SWT dalam Penyelesaian Pertikaian",
    "perawi_melayu": "Riwayat Abu Hurairah dan Zaid bin Khalid:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ أَبِي هُرَيْرَةَ، وَزَيْدِ بْنِ خَالِدٍ، أَنَّهُمَا أَخْبَرَاهُ أَنَّ رَجُلَيْنِ اخْتَصَمَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ أَحَدُهُمَا اقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ‏.‏ وَقَالَ الآخَرُ وَهْوَ أَفْقَهُهُمَا أَجَلْ يَا رَسُولَ اللَّهِ فَاقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ، وَأْذَنْ لِي أَنْ أَتَكَلَّمَ‏.‏ قَالَ ‏\"‏ تَكَلَّمْ ‏\"‏‏.‏ قَالَ إِنَّ ابْنِي كَانَ عَسِيفًا عَلَى هَذَا ـ قَالَ مَالِكٌ وَالْعَسِيفُ الأَجِيرُ ـ فَزَنَى بِامْرَأَتِهِ، فَأَخْبَرُونِي أَنَّ عَلَى ابْنِي الرَّجْمَ، فَافْتَدَيْتُ مِنْهُ بِمِائَةِ شَاةٍ وَبِجَارِيَةٍ لِي، ثُمَّ إِنِّي سَأَلْتُ أَهْلَ الْعِلْمِ فَأَخْبَرُونِي أَنَّ مَا عَلَى ابْنِي جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ، وَإِنَّمَا الرَّجْمُ عَلَى امْرَأَتِهِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمَا وَالَّذِي نَفْسِي بِيَدِهِ لأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ، أَمَّا غَنَمُكَ وَجَارِيَتُكَ فَرَدٌّ عَلَيْكَ ‏\"‏‏.‏ وَجَلَدَ ابْنَهُ مِائَةً وَغَرَّبَهُ عَامًا، وَأَمَرَ أُنَيْسًا الأَسْلَمِيَّ أَنْ يَأْتِيَ امْرَأَةَ الآخَرِ، فَإِنِ اعْتَرَفَتْ فَارْجُمْهَا، فَاعْتَرَفَتْ فَرَجَمَهَا‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Yusuf, telah memberitakan kepada kami Malik, dari Ibnu Syihab, dari Ubaidillah bin Abdullah bin Utbah bin Mas'ud, dari Abu Hurairah dan Zaid bin Khalid, bahawa mereka berdua memberitakan kepadanya bahawa dua orang lelaki berselisih faham dan datang kepada Rasulullah SAW.  Salah seorang daripada mereka berkata, \"Putuskanlah di antara kami berdasarkan Kitabullah.\"  Yang seorang lagi, yang lebih faham di antara mereka berdua berkata, \"Ya Rasulullah SAW, putuskanlah di antara kami berdasarkan Kitabullah, dan izinkanlah saya untuk berucap dahulu.\" Baginda SAW bersabda, \"Ucapkanlah.\" Lelaki itu berkata, \"Anak saya bekerja sebagai buruh (ajir) bagi lelaki ini, lalu dia berzina dengan isterinya.  Mereka memberitahu saya bahawa anak saya wajib dirajam, lalu saya menebus dosanya dengan seratus ekor kambing dan seorang hamba perempuan. Kemudian saya bertanya kepada ahli ilmu, lalu mereka memberitahu saya bahawa hukuman bagi anak saya ialah disebat seratus kali dan dibuang negeri selama setahun, dan hanya isteri lelaki ini sahaja yang wajib dirajam.\"  Rasulullah SAW bersabda, \"Demi Allah yang jiwa ku berada di tangan-Nya, Aku pasti akan memutuskan di antara kamu berdua berdasarkan Kitabullah.  Adapun kambing dan hamba perempuanmu, dikembalikan kepadamu.\"  Lalu Baginda SAW menyeksa anak lelaki itu dengan seratus sebatan dan membuangnya negeri selama setahun, dan Baginda SAW memerintahkan Unais Al-Aslami untuk pergi kepada isteri lelaki yang lain itu, jika dia mengaku, maka rajamlah dia.  Dia mengaku, lalu dirajamlah dia."
  },
  {
    "id": 6591,
    "hadith_number": 6591,
    "tajuk_hadith": "Abu Bakar dan Ayat Tayammum",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ جَاءَ أَبُو بَكْرِ ـ رضى الله عنه ـ وَرَسُولُ اللَّهِ صلى الله عليه وسلم وَاضِعٌ رَأْسَهُ عَلَى فَخِذِي فَقَالَ حَبَسْتِ رَسُولَ اللَّهِ صلى الله عليه وسلم وَالنَّاسَ، وَلَيْسُوا عَلَى مَاءٍ‏.‏ فَعَاتَبَنِي، وَجَعَلَ يَطْعُنُ بِيَدِهِ فِي خَاصِرَتِي، وَلاَ يَمْنَعُنِي مِنَ التَّحَرُّكِ إِلاَّ مَكَانُ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَنْزَلَ اللَّهُ آيَةَ التَّيَمُّمِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ismail, telah menceritakan kepadaku Malik, dari Abdul Rahman bin Al-Qasim, dari bapanya, dari Aisyah, dia berkata:  Abu Bakar r.a. datang ketika Rasulullah s.a.w. meletakkan kepalanya di pangkuanku. Maka dia berkata: \"Engkau telah menahan Rasulullah s.a.w. dan orang ramai, padahal mereka tidak mempunyai air.\"  Lalu dia menegurku dan memukul-mukul pinggangku dengan tangannya.  Dan tidak ada yang menghalang aku daripada bergerak kecuali kerana Rasulullah s.a.w. sedang bersandar di pangkuanku.  Kemudian Allah menurunkan ayat Tayammum."
  },
  {
    "id": 6592,
    "hadith_number": 6592,
    "tajuk_hadith": "Abu Bakar Memukul Aisyah Kerana Menahan Orang Ramai",
    "perawi_melayu": "Riwayat Aisyah:",
    "english_text": "Abu Bakr came to towards me and struck me violently with his fist and said, \"You have detained the \npeople because of your necklace.\" But I remained motionless as if I was dead lest I should awake \nAllah's Messenger (ﷺ) although that hit was very painful.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، حَدَّثَنِي ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ، حَدَّثَهُ عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ أَقْبَلَ أَبُو بَكْرٍ فَلَكَزَنِي لَكْزَةً شَدِيدَةً وَقَالَ حَبَسْتِ النَّاسَ فِي قِلاَدَةٍ‏.‏ فَبِي الْمَوْتُ لِمَكَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَقَدْ أَوْجَعَنِي‏.‏ نَحْوَهُ‏.‏ لَكَزَ وَوَكَزَ وَاحِدٌ.",
    "malay_translation": "Aisyah berkata: Abu Bakar datang kepadaku lalu memukulku dengan kuat menggunakan penumbuknya dan berkata, \"Engkau telah menahan orang ramai kerana kalungmu.\"  Aku kekal tidak bergerak seolah-olah aku telah mati, bimbang aku akan mengejutkan Rasulullah ﷺ, walaupun pukulan itu amat menyakitkan."
  },
  {
    "id": 6593,
    "hadith_number": 6593,
    "tajuk_hadith": "Kecemburuan Rasulullah SAW",
    "perawi_melayu": "Riwayat Al-Mughira:",
    "english_text": "Sa`d bin Ubada said, \"If I found a man with my wife, I would kill him with the sharp side of my \nsword.\" When the Prophet (ﷺ) heard that he said, \"Do you wonder at Sa`d's sense of ghira (self-respect)? \nVerily, I have more sense of ghira than Sa`d, and Allah has more sense of ghira than I.\"",
    "arabic_text": "حَدَّثَنَا مُوسَى، حَدَّثَنَا أَبُو عَوَانَةَ، حَدَّثَنَا عَبْدُ الْمَلِكِ، عَنْ وَرَّادٍ، كَاتِبِ الْمُغِيرَةِ عَنِ الْمُغِيرَةِ، قَالَ قَالَ سَعْدُ بْنُ عُبَادَةَ لَوْ رَأَيْتُ رَجُلاً مَعَ امْرَأَتِي لَضَرَبْتُهُ بِالسَّيْفِ غَيْرَ مُصْفَحٍ‏.‏ فَبَلَغَ ذَلِكَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ أَتَعْجَبُونَ مِنْ غَيْرَةِ سَعْدٍ، لأَنَا أَغْيَرُ مِنْهُ، وَاللَّهُ أَغْيَرُ مِنِّي ‏\"‏‏.‏",
    "malay_translation": "Sa'd bin Ubadah berkata, \"Sekiranya aku mendapati seorang lelaki bersama isteriku, nescaya aku akan membunuhnya dengan bahagian mata pedangku.\"  Apabila baginda Nabi SAW mendengarnya, baginda bersabda, \"Adakah kamu merasa hairan dengan perasaan cemburu Sa'd? Sesungguhnya aku lebih cemburu daripada dia, dan Allah SWT lebih cemburu daripada aku.\""
  },
  {
    "id": 6594,
    "hadith_number": 6594,
    "tajuk_hadith": "Keturunan dan Warna Kulit",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم جَاءَهُ أَعْرَابِيٌّ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ امْرَأَتِي وَلَدَتْ غُلاَمًا أَسْوَدَ‏.‏ فَقَالَ ‏\"‏ هَلْ لَكَ مِنْ إِبِلٍ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ مَا أَلْوَانُهَا ‏\"‏‏.‏ قَالَ حُمْرٌ‏.‏ قَالَ ‏\"‏ فِيهَا مِنْ أَوْرَقَ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَأَنَّى كَانَ ذَلِكَ ‏\"‏‏.‏ قَالَ أُرَاهُ عِرْقٌ نَزَعَهُ‏.‏ قَالَ ‏\"‏ فَلَعَلَّ ابْنَكَ هَذَا نَزَعَهُ عِرْقٌ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ismail, telah menceritakan kepadaku Malik, dari Ibnu Syihab, dari Said bin Musayyab, dari Abu Hurairah - radiallahu 'anhu - bahawa Rasulullah ﷺ didatangi seorang Badwi lalu berkata, \"Wahai Rasulullah, isteriku telah melahirkan seorang anak lelaki yang berkulit hitam.\"  Maka baginda bertanya, \"Adakah engkau mempunyai unta?\"  Dia menjawab, \"Ya.\" Baginda bertanya lagi, \"Apakah warna-warna unta-untamu?\" Dia menjawab, \"Merah.\" Baginda bertanya lagi, \"Adakah di antaranya yang berbulu kelabu?\" Dia menjawab, \"Ya.\" Baginda bertanya lagi, \"Bagaimana kelabu itu terjadi?\" Dia menjawab, \"Aku rasa ia pewarisan daripada nenek moyang unta itu.\" Maka baginda berkata, \"Maka mungkin anakmu ini juga mewarisi warna daripada nenek moyangnya.\""
  },
  {
    "id": 6595,
    "hadith_number": 6595,
    "tajuk_hadith": "Hadis Tentang Had Sempadan Sebatan",
    "perawi_melayu": "Riwayat Abu Burdah:",
    "english_text": "The Prophet (ﷺ) used to say, \"Nobody should be flogged more than ten stripes except if he is guilty of a \ncrime, the legal punishment of which is assigned by Allah.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ جَابِرِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي بُرْدَةَ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ يُجْلَدُ فَوْقَ عَشْرِ جَلَدَاتٍ إِلاَّ فِي حَدٍّ مِنْ حُدُودِ اللَّهِ ‏\"‏‏.‏",
    "malay_translation": "Abu Burdah r.a. berkata bahawa Nabi SAW bersabda: “Tiada sesiapa yang boleh disebat melebihi sepuluh kali kecuali bagi kesalahan yang dihukum oleh Allah SWT.”"
  },
  {
    "id": 6596,
    "hadith_number": 6596,
    "tajuk_hadith": "Hadis Tentang Hukuman Sebatan",
    "perawi_melayu": "Daripada Abdur-Rahman bin Jabir:",
    "english_text": "On the authority of others, that the Prophet (ﷺ) said, \"No Punishment exceeds the flogging of the ten \nstripes, except if one is guilty of a crime necessitating a legal punishment prescribed by Allah.\"",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنَا مُسْلِمُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ جَابِرٍ، عَمَّنْ سَمِعَ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ عُقُوبَةَ فَوْقَ عَشْرِ ضَرَبَاتٍ إِلاَّ فِي حَدٍّ مِنْ حُدُودِ اللَّهِ ‏\"‏‏.‏",
    "malay_translation": "Daripada beberapa orang yang lain, bahawa Nabi SAW bersabda:  \"Tiada sebarang hukuman yang melebihi sepuluh sebatan, melainkan bagi kesalahan yang memerlukan hukuman had yang telah ditetapkan oleh Allah.\" "
  },
  {
    "id": 6597,
    "hadith_number": 6597,
    "tajuk_hadith": "Hadis Tentang Had Sempadan Sebatan",
    "perawi_melayu": "Riwayat Abu Burda Al-Ansari:",
    "english_text": "I heard the Prophet (ﷺ) saying, \"Do not flog anyone more than ten stripes except if he is involved in a \ncrime necessitating Allah's legal Punishment.\"",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، حَدَّثَنِي ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، أَنَّ بُكَيْرًا، حَدَّثَهُ قَالَ بَيْنَمَا أَنَا جَالِسٌ، عِنْدَ سُلَيْمَانَ بْنِ يَسَارٍ إِذْ جَاءَ عَبْدُ الرَّحْمَنِ بْنُ جَابِرٍ فَحَدَّثَ سُلَيْمَانَ بْنَ يَسَارٍ، ثُمَّ أَقْبَلَ عَلَيْنَا سُلَيْمَانُ بْنُ يَسَارٍ فَقَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ جَابِرٍ، أَنَّ أَبَاهُ، حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا بُرْدَةَ الأَنْصَارِيَّ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ تَجْلِدُوا فَوْقَ عَشْرَةِ أَسْوَاطٍ إِلاَّ فِي حَدٍّ مِنْ حُدُودِ اللَّهِ ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda:  \"Janganlah kamu menyeksa sesiapa melebihi sepuluh sebatan melainkan bagi kesalahan yang dikenakan hukuman Allah SWT.\""
  },
  {
    "id": 6598,
    "hadith_number": 6598,
    "tajuk_hadith": "Larangan Puasa Berterusan (Al-Wisal)",
    "perawi_melayu": "Riwayat Abu Hurairah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنَا أَبُو سَلَمَةَ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْوِصَالِ فَقَالَ لَهُ رِجَالٌ مِنَ الْمُسْلِمِينَ فَإِنَّكَ يَا رَسُولَ اللَّهِ تُوَاصِلُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَيُّكُمْ مِثْلِي إِنِّي أَبِيتُ يُطْعِمُنِي رَبِّي وَيَسْقِينِ ‏\"‏‏.‏ فَلَمَّا أَبَوْا أَنْ يَنْتَهُوا عَنِ الْوِصَالِ وَاصَلَ بِهِمْ يَوْمًا ثُمَّ يَوْمًا ثُمَّ رَأَوُا الْهِلاَلَ فَقَالَ ‏\"‏ لَوْ تَأَخَّرَ لَزِدْتُكُمْ ‏\"‏‏.‏ كَالْمُنَكِّلِ بِهِمْ حِينَ أَبَوْا‏.‏ تَابَعَهُ شُعَيْبٌ وَيَحْيَى بْنُ سَعِيدٍ وَيُونُسُ عَنِ الزُّهْرِيِّ‏.‏ وَقَالَ عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ عَنِ ابْنِ شِهَابٍ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Yahya bin Bukair, telah menceritakan kepada kami Laits, dari Uqail, dari Ibnu Syihab, telah menceritakan kepada kami Abu Salamah, bahawa Abu Hurairah r.a. berkata, Rasulullah SAW telah melarang al-Wisal (puasa berterusan lebih daripada sehari tanpa makan). Maka ada beberapa orang lelaki daripada kalangan Muslim berkata, \"Wahai Rasulullah, sesungguhnya engkau juga berpuasa berterusan.\"  Rasulullah SAW bersabda, \"Siapakah di antara kamu yang serupa dengan aku?  Sesungguhnya aku tidur, maka Tuhanku memberi aku makan dan minum.\"  Setelah mereka enggan meninggalkan al-Wisal, baginda berpuasa bersama mereka satu hari, kemudian satu hari lagi. Kemudian mereka melihat hilal, lalu baginda bersabda, \"Sekiranya hilal itu lewat (tidak muncul), nescaya aku akan menambahkan lagi (puasa kamu selama sehari lagi).\"  Seolah-olah baginda mahu memberi hukuman kepada mereka kerana mereka enggan meninggalkan al-Wisal.  (Hadis ini) turut diriwayatkan oleh Syu’aib, Yahya bin Said dan Yunus daripada Az- Zuhri. Dan Abdul Rahman bin Khalid meriwayatkan daripada Ibnu Syihab, daripada Sa’id, daripada Abu Hurairah daripada Nabi SAW."
  },
  {
    "id": 6599,
    "hadith_number": 6599,
    "tajuk_hadith": " Hukuman Bagi Mereka Yang Menjual Makanan Secara Sembarangan",
    "perawi_melayu": "Riwayat Abdullah bin Umar:",
    "english_text": "Those people who used to buy foodstuff at random (without weighing or measuring it) were beaten in \nthe lifetime of Allah's Messenger (ﷺ) if they sold it at the very place where they had bought it, till they \ncarried it to their dwelling places.",
    "arabic_text": "حَدَّثَنِي عَيَّاشُ بْنُ الْوَلِيدِ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُمْ كَانُوا يُضْرَبُونَ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذَا اشْتَرَوْا طَعَامًا جِزَافًا أَنْ يَبِيعُوهُ فِي مَكَانِهِمْ حَتَّى يُئْوُوهُ إِلَى رِحَالِهِمْ‏.‏",
    "malay_translation": "Telah menceritakan kepada saya, Ayasy bin Walid, telah menceritakan kepada kami, Abdul A'la, telah menceritakan kepada kami, Ma'mar, dari Az- Zuhri, dari Salim, dari Abdullah bin Umar, bahawa mereka dahulu dipukul pada zaman Rasulullah SAW jika mereka membeli makanan secara rambang (tanpa menimbang atau menyukat) dan menjualnya di tempat yang sama di mana mereka membelinya sehingga mereka membawanya ke rumah mereka."
  },
  {
    "id": 6600,
    "hadith_number": 6600,
    "tajuk_hadith": "Baginda SAW Tidak Membalas Dendam Untuk Diri Sendiri",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "Allah's Messenger (ﷺ) never took revenge for his own self in any matter presented to him till Allah's limits \nwere exceeded, in which case he would take revenge for Allah's sake.",
    "arabic_text": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي عُرْوَةُ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا انْتَقَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِنَفْسِهِ فِي شَىْءٍ يُؤْتَى إِلَيْهِ حَتَّى تُنْتَهَكَ مِنْ حُرُمَاتِ اللَّهِ فَيَنْتَقِمَ لِلَّهِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdān, telah memberitakan kepada kami Abdullah, telah memberitakan kepada kami Yunus, daripada Az- Zuhri, telah memberitakan kepadaku Urwah, daripada Aisyah r.a., katanya:  Rasulullah SAW tidak pernah membalas dendam untuk dirinya sendiri dalam apa jua perkara yang sampai kepadanya sehingga batas-batas Allah SWT dilanggar, maka baginda akan membalas dendam bagi Allah SWT."
  },
  {
    "id": 6601,
    "hadith_number": 6601,
    "tajuk_hadith": "Kes Lian: Perceraian Berdasarkan Tuduhan Zina",
    "perawi_melayu": "Daripada Sahl bin Sa'd:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، قَالَ الزُّهْرِيُّ عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ شَهِدْتُ الْمُتَلاَعِنَيْنِ وَأَنَا ابْنُ خَمْسَ، عَشْرَةَ، فَرَّقَ بَيْنَهُمَا فَقَالَ زَوْجُهَا كَذَبْتُ عَلَيْهَا إِنْ أَمْسَكْتُهَا‏.‏ قَالَ فَحَفِظْتُ ذَاكَ مِنَ الزُّهْرِيِّ ‏\n\"‏ إِنْ جَاءَتْ بِهِ كَذَا وَكَذَا فَهْوَ، وَإِنْ جَاءَتْ بِهِ كَذَا وَكَذَا كَأَنَّهُ وَحَرَةٌ فَهُوَ ‏\"‏‏.‏ وَسَمِعْتُ الزُّهْرِيَّ يَقُولُ جَاءَتْ بِهِ لِلَّذِي يُكْرَهُ",
    "malay_translation": "Telah menceritakan kepada kami Ali, telah menceritakan kepada kami Sufyan, berkata Az- Zuhri daripada Sahl bin Saad, katanya: Aku menyaksikan pasangan yang berlian (bertukar sumpah) ketika aku berusia lima belas tahun.  Rasulullah SAW telah menceraikan mereka.  Lalu suaminya berkata, \"Aku telah berdusta terhadapnya sekiranya aku meneruskannya.\"  Katanya, maka aku telah menghafal daripada Az-Zuhri: \"Sekiranya dia melahirkan anak dengan ciri-ciri begini dan begitu, maka dia benar, dan sekiranya dia melahirkan anak dengan ciri-ciri begini dan begitu seperti serangga Wahrah, maka dia dusta.\" Dan aku mendengar Az-Zuhri berkata: \"Akhirnya dia melahirkan anak yang dibenci oleh suaminya.\""
  },
  {
    "id": 6602,
    "hadith_number": 6602,
    "tajuk_hadith": "Kisah Pasangan yang Bersumpah Lian dan Wanita yang Terdedah",
    "perawi_melayu": "Riwayat Al-Qasim bin Muhammad:",
    "english_text": "Ibn `Abbas mentioned the couple who had taken the oath of Lian. `Abdullah bin Shaddad said (to him), \"Was this woman about whom Allah's Messenger (ﷺ) said, 'If I were ever to stone to death any woman without witnesses. (I would have stoned that woman to death)?' Ibn `Abbas replied,\" No, that lady exposed herself (by her suspicious behavior).",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، قَالَ ذَكَرَ ابْنُ عَبَّاسٍ الْمُتَلاَعِنَيْنِ فَقَالَ عَبْدُ اللَّهِ بْنُ شَدَّادٍ هِيَ الَّتِي قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَوْ كُنْتُ رَاجِمًا امْرَأَةً عَنْ غَيْرِ بَيِّنَةٍ ‏\"‏‏.‏ قَالَ لاَ، تِلْكَ امْرَأَةٌ أَعْلَنَتْ‏.‏",
    "malay_translation": "Ibn Abbas menyebut tentang pasangan suami isteri yang telah bersumpah Lian. Abdullah bin Shaddad bertanya kepadanya, \"Adakah wanita ini yang Rasulullah SAW bersabda, 'Sekiranya aku pernah merajam seorang wanita tanpa bukti, nescaya aku akan merajam wanita itu?'\" Ibn Abbas menjawab, \"Tidak, wanita itu telah mendedahkan dirinya sendiri (melalui tingkah lakunya yang mencurigakan).\""
  },
  {
    "id": 6603,
    "hadith_number": 6603,
    "tajuk_hadith": "Kisah Lian dan Wanita yang Menimbulkan Syak",
    "perawi_melayu": "Riwayat Ibnu Abbas:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمَ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ ذُكِرَ التَّلاَعُنُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ عَاصِمُ بْنُ عَدِيٍّ فِي ذَلِكَ قَوْلاً، ثُمَّ انْصَرَفَ وَأَتَاهُ رَجُلٌ مِنْ قَوْمِهِ يَشْكُو أَنَّهُ وَجَدَ مَعَ أَهْلِهِ فَقَالَ عَاصِمٌ مَا ابْتُلِيتُ بِهَذَا إِلاَّ لِقَوْلِي فَذَهَبَ بِهِ إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَخْبَرَهُ بِالَّذِي وَجَدَ عَلَيْهِ امْرَأَتَهُ، وَكَانَ ذَلِكَ الرَّجُلُ مُصْفَرًّا، قَلِيلَ اللَّحْمِ، سَبِطَ الشَّعَرِ، وَكَانَ الَّذِي ادَّعَى عَلَيْهِ أَنَّهُ وَجَدَهُ عِنْدَ أَهْلِهِ آدَمَ، خَدْلاً، كَثِيرَ اللَّحْمِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ بَيِّنْ ‏\"‏‏.‏ فَوَضَعَتْ شَبِيهًا بِالرَّجُلِ الَّذِي ذَكَرَ زَوْجُهَا أَنَّهُ وَجَدَهُ عِنْدَهَا فَلاَعَنَ النَّبِيُّ صلى الله عليه وسلم بَيْنَهُمَا فَقَالَ رَجُلٌ لاِبْنِ عَبَّاسٍ فِي الْمَجْلِسِ هِيَ الَّتِي قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَوْ رَجَمْتُ أَحَدًا بِغَيْرِ بَيِّنَةٍ رَجَمْتُ هَذِهِ ‏\"‏‏.‏ فَقَالَ لاَ، تِلْكَ امْرَأَةٌ كَانَتْ تُظْهِرُ فِي الإِسْلاَمِ السُّوءَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Yusuf, telah menceritakan kepada kami Laits, telah menceritakan kepada kami Yahya bin Said, dari Abdurrahman bin Al-Qasim, dari Qasim bin Muhammad, dari Ibnu Abbas r.a., bahawa isu li'an disebut di hadapan Nabi SAW.  Maka, Asim bin Adi berkata sesuatu mengenainya, kemudian beliau pergi. Lalu datang seorang lelaki dari kaumnya mengadu bahawa dia telah mendapati seseorang bersama isterinya. Asim berkata, “Aku diuji dengan perkara ini hanya disebabkan ucapanku.” Maka dia membawa lelaki itu kepada Nabi SAW, lalu lelaki itu (suami) menceritakan kejadian yang dialaminya. Lelaki itu (suami) berkulit kuning, kurus, dan rambutnya jarang. Manakala lelaki yang dituduhnya berada bersama isterinya itu berkulit kemerahan, gemuk, berkaki dan badan yang berisi.  Nabi SAW bersabda, “Ya Allah, tampakkanlah (kebenaran).” Kemudian, isteri tersebut melahirkan anak yang rupa parasnya menyerupai lelaki yang dituduh suaminya. Maka Nabi SAW  melaksanakan li'an di antara mereka.  Seorang lelaki bertanya kepada Ibnu Abbas dalam majlis tersebut, “Adakah wanita ini sama dengan wanita yang Nabi SAW katakan, ‘Sekiranya aku merajam seseorang tanpa bukti, nescaya aku akan merajam wanita ini?’” Ibnu Abbas menjawab, “Tidak, itu adalah wanita lain yang menunjukkan sikap buruk dalam Islam.”"
  },
  {
    "id": 6604,
    "hadith_number": 6604,
    "tajuk_hadith": "Tujuh Dosa Besar yang Membinasakan",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُلَيْمَانُ، عَنْ ثَوْرِ بْنِ زَيْدٍ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ اجْتَنِبُوا السَّبْعَ الْمُوبِقَاتِ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَمَا هُنَّ قَالَ ‏\"‏ الشِّرْكُ بِاللَّهِ، وَالسِّحْرُ، وَقَتْلُ النَّفْسِ الَّتِي حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ، وَأَكْلُ الرِّبَا، وَأَكْلُ مَالِ الْيَتِيمِ، وَالتَّوَلِّي يَوْمَ الزَّحْفِ، وَقَذْفُ الْمُحْصَنَاتِ الْمُؤْمِنَاتِ الْغَافِلاَتِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Jauhilah tujuh dosa yang membinasakan.\" Mereka bertanya, \"Wahai Rasulullah, apakah dosa-dosa itu?\" Baginda menjawab, \"Syirik kepada Allah, sihir, membunuh jiwa yang diharamkan Allah kecuali dengan hak, memakan riba, memakan harta anak yatim, melarikan diri daripada medan perang ketika berperang, dan menuduh wanita-wanita yang baik-baik dan memelihara kehormatannya yang beriman dengan perzinaan."
  },
  {
    "id": 6605,
    "hadith_number": 6605,
    "tajuk_hadith": "Fitnah terhadap Hamba",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "I heard Abu-l-Qasim (the Prophet) saying, \"If somebody slanders his slave and the slave is free from \nwhat he says, he will be flogged on the Day of Resurrection unless the slave is really as he has \ndescribed him.\"",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ فُضَيْلِ بْنِ غَزْوَانَ، عَنِ ابْنِ أَبِي نُعْمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ أَبَا الْقَاسِمِ، صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ قَذَفَ مَمْلُوكَهُ وَهْوَ بَرِيءٌ مِمَّا قَالَ، جُلِدَ يَوْمَ الْقِيَامَةِ، إِلاَّ أَنْ يَكُونَ كَمَا قَالَ ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Abu al-Qasim (Nabi SAW) bersabda:  \"Barangsiapa yang memfitnah hambanya, sedangkan hambanya itu bersih daripada apa yang dituduhnya, maka dia akan disebat pada hari kiamat, kecuali jika hambanya itu memang seperti apa yang dituduhnya.\""
  },
  {
    "id": 6606,
    "hadith_number": 6606,
    "tajuk_hadith": "Hukuman Zina Mengikut Hukum Allah",
    "perawi_melayu": "Riwayat Abu Hurairah dan Zaid bin Khalid Al-Juhani:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ أَبِي هُرَيْرَةَ، وَزَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، قَالاَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ أَنْشُدُكَ اللَّهَ إِلاَّ قَضَيْتَ بَيْنَنَا بِكِتَابِ اللَّهِ‏.‏ فَقَامَ خَصْمُهُ وَكَانَ أَفْقَهَ مِنْهُ فَقَالَ صَدَقَ، اقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ، وَأْذَنْ لِي يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ قُلْ ‏\"‏‏.‏ فَقَالَ إِنَّ ابْنِي كَانَ عَسِيفًا فِي أَهْلِ، هَذَا فَزَنَى بِامْرَأَتِهِ، فَافْتَدَيْتُ مِنْهُ بِمِائَةِ شَاةٍ وَخَادِمٍ وَإِنِّي سَأَلْتُ رِجَالاً مِنْ أَهْلِ الْعِلْمِ فَأَخْبَرُونِي أَنَّ عَلَى ابْنِي جَلْدَ مِائَةٍ وَتَغْرِيبَ عَامٍ، وَأَنَّ عَلَى امْرَأَةِ هَذَا الرَّجْمَ‏.‏ فَقَالَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ، الْمِائَةُ وَالْخَادِمُ رَدٌّ عَلَيْكَ، وَعَلَى ابْنِكَ جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ، وَيَا أُنَيْسُ اغْدُ عَلَى امْرَأَةِ هَذَا فَسَلْهَا، فَإِنِ اعْتَرَفَتْ فَارْجُمْهَا ‏\"‏‏.‏ فَاعْتَرَفَتْ فَرَجَمَهَا‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Yusuf, telah menceritakan kepada kami Ibnu Uyainah, dari Az- Zuhri, dari Ubaidillah bin Abdullah bin Utbah, dari Abu Hurairah dan Zaid bin Khalid Al-Juhani, mereka berdua berkata:  Seorang lelaki datang kepada Nabi SAW lalu berkata, \"Aku memohon kepadamu wahai Allah agar engkau memberikan keputusan di antara kami menurut Kitabullah.\" Maka bangunlah pihak lawannya, dan dia lebih memahami hukum daripada lelaki yang pertama, lalu dia berkata, \"Dia telah berkata benar. Berikanlah keputusan di antara kami menurut Kitabullah, dan izinkan aku (berbicara), wahai Rasulullah SAW.\" Maka Nabi SAW bersabda, \"Cakaplah.\" Lelaki itu berkata, \"Sesungguhnya anakku bekerja sebagai buruh di rumah lelaki ini, lalu dia berzina dengan isterinya, maka aku telah menebus anakku dengan seratus ekor kambing dan seorang hamba, dan aku telah bertanya kepada beberapa orang alim, maka mereka memberitahuku bahawa anakku wajib disebat seratus kali dan diasingkan selama setahun, dan isteri lelaki ini wajib dirajam (dibunuh).\"  Maka Nabi SAW bersabda, \"Demi Allah yang jiwa ku berada di tangan-Nya, sesungguhnya Aku akan memberikan keputusan di antara kamu berdua menurut Kitabullah. Seratus ekor kambing dan hamba itu dikembalikan kepadamu, dan anakmu wajib disebat seratus kali dan diasingkan selama setahun, dan wahai Unais! Pergilah esok kepada isteri lelaki ini dan tanyakanlah kepadanya, jika dia mengaku, maka rajamlah dia.\" Maka dia mengaku, lalu dia dirajam."
  }
]
