[
  {
    "id": 59,
    "hadith_number": 59,
    "tajuk_hadith": "Tanda-tanda Kiamat: Hilangnya Amanah dan Urusan Diserahkan kepada yang Tidak Layak",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "While the Prophet (ﷺ) was saying something in a gathering, a Bedouin came and asked him, \"When \nwould the Hour (Doomsday) take place?\" Allah's Messenger (ﷺ) continued his talk, so some people said that \nAllah's Messenger (ﷺ) had heard the question, but did not like what that Bedouin had asked. Some of them \nsaid that Allah's Messenger (ﷺ) had not heard it. When the Prophet (ﷺ) finished his speech, he said, \"Where is \nthe questioner, who inquired about the Hour (Doomsday)?\" The Bedouin said, \"I am here, O Allah's \nApostle .\" Then the Prophet (ﷺ) said, \"When honesty is lost, then wait for the Hour (Doomsday).\" The \nBedouin said, \"How will that be lost?\" The Prophet (ﷺ) said, \"When the power or authority comes in the \nhands of unfit persons, then wait for the Hour (Doomsday.)\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، قَالَ حَدَّثَنَا فُلَيْحٌ، ح وَحَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ فُلَيْحٍ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي هِلاَلُ بْنُ عَلِيٍّ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ بَيْنَمَا النَّبِيُّ صلى الله عليه وسلم فِي مَجْلِسٍ يُحَدِّثُ الْقَوْمَ جَاءَهُ أَعْرَابِيٌّ فَقَالَ مَتَى السَّاعَةُ فَمَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم يُحَدِّثُ، فَقَالَ بَعْضُ الْقَوْمِ سَمِعَ مَا قَالَ، فَكَرِهَ مَا قَالَ، وَقَالَ بَعْضُهُمْ بَلْ لَمْ يَسْمَعْ، حَتَّى إِذَا قَضَى حَدِيثَهُ قَالَ ‏\"‏ أَيْنَ ـ أُرَاهُ ـ السَّائِلُ عَنِ السَّاعَةِ ‏\"‏‏.‏ قَالَ هَا أَنَا يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ فَإِذَا ضُيِّعَتِ الأَمَانَةُ فَانْتَظِرِ السَّاعَةَ ‏\"‏‏.‏ قَالَ كَيْفَ إِضَاعَتُهَا قَالَ ‏\"‏ إِذَا وُسِّدَ الأَمْرُ إِلَى غَيْرِ أَهْلِهِ فَانْتَظِرِ السَّاعَةَ ‏\"‏‏.‏",
    "malay_translation": "Ketika Nabi (ﷺ) sedang berbicara dalam suatu majlis, seorang Badwi datang dan bertanya kepada baginda, \"Bilakah akan terjadi Hari Kiamat?\" Rasulullah (ﷺ) meneruskan pembicaraannya, maka sebahagian orang berkata bahawa Rasulullah (ﷺ) telah mendengar pertanyaan itu, tetapi tidak menyukai apa yang ditanyakan oleh orang Badwi itu. Sebahagian mereka berkata bahawa Rasulullah (ﷺ) tidak mendengarnya. Apabila Nabi (ﷺ) selesai berucap, baginda bersabda, \"Di manakah orang yang bertanya tentang Hari Kiamat?\" Orang Badwi itu berkata, \"Saya di sini, wahai Rasulullah.\" Kemudian Nabi (ﷺ) bersabda, \"Apabila amanah telah hilang, maka tunggulah Hari Kiamat.\" Orang Badwi itu bertanya, \"Bagaimana ia akan hilang?\" Nabi (ﷺ) bersabda, \"Apabila kuasa atau autoriti diserahkan kepada orang yang tidak layak, maka tunggulah Hari Kiamat.\""
  },
  {
    "id": 60,
    "hadith_number": 60,
    "tajuk_hadith": "Ancaman Neraka bagi Tumit yang Tidak Dibasuh Sempurna semasa Wuduk",
    "perawi_melayu": "Diriwayatkan oleh Abdullah bin `Amr:",
    "english_text": "Once the Prophet (ﷺ) remained behind us in a journey. He joined us while we were performing ablution \nfor the prayer which was over-due. We were just passing wet hands over our feet (and not washing \nthem properly) so the Prophet (ﷺ) addressed us in a loud voice and said twice or thrice: \"Save your heels \nfrom the fire.\"",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ، عَارِمُ بْنُ الْفَضْلِ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ يُوسُفَ بْنِ مَاهَكَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ تَخَلَّفَ عَنَّا النَّبِيُّ صلى الله عليه وسلم فِي سَفْرَةٍ سَافَرْنَاهَا، فَأَدْرَكَنَا وَقَدْ أَرْهَقَتْنَا الصَّلاَةُ وَنَحْنُ نَتَوَضَّأُ، فَجَعَلْنَا نَمْسَحُ عَلَى أَرْجُلِنَا، فَنَادَى بِأَعْلَى صَوْتِهِ ‏\n\"‏ وَيْلٌ لِلأَعْقَابِ مِنَ النَّارِ ‏\"‏‏.‏ مَرَّتَيْنِ أَوْ ثَلاَثًا‏.‏",
    "malay_translation": "Suatu ketika Nabi (ﷺ) ketinggalan di belakang kami dalam suatu perjalanan. Baginda menyusul kami ketika kami sedang berwuduk untuk solat yang sudah hampir luput waktunya. Kami hanya menyapu tangan yang basah ke atas kaki kami (dan tidak membasuhnya dengan sempurna), maka Nabi (ﷺ) bersabda dengan suara yang lantang sebanyak dua atau tiga kali: \"Selamatkan tumit-tumit kamu daripada api neraka.\""
  },
  {
    "id": 61,
    "hadith_number": 61,
    "tajuk_hadith": "Perumpamaan Pohon Kurma dengan Seorang Muslim",
    "perawi_melayu": "Diriwayatkan oleh Ibn `Umar:",
    "english_text": "Allah's Messenger (ﷺ) said, \"Amongst the trees, there is a tree, the leaves of which do not fall and is like a \nMuslim. Tell me the name of that tree.\" Everybody started thinking about the trees of the desert areas. \nAnd I thought of the date-palm tree but felt shy to answer the others then asked, \"What is that tree, O \nAllah's Messenger (ﷺ) ?\" He replied, \"It is the date-palm tree.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنَ الشَّجَرِ شَجَرَةً لاَ يَسْقُطُ وَرَقُهَا، وَإِنَّهَا مَثَلُ الْمُسْلِمِ، فَحَدِّثُونِي مَا هِيَ ‏\"‏‏.‏ فَوَقَعَ النَّاسُ فِي شَجَرِ الْبَوَادِي‏.‏ قَالَ عَبْدُ اللَّهِ وَوَقَعَ فِي نَفْسِي أَنَّهَا النَّخْلَةُ، فَاسْتَحْيَيْتُ ثُمَّ قَالُوا حَدِّثْنَا مَا هِيَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ هِيَ النَّخْلَةُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda, \"Di antara pepohonan, terdapat sebuah pohon yang daunnya tidak gugur dan ia seperti seorang Muslim. Beritahuku nama pohon itu.\" Semua orang mulai memikirkan tentang pohon-pohon di kawasan gurun. Dan aku (Ibn Umar) terfikir tentang pohon kurma tetapi berasa malu untuk menjawab. Kemudian mereka bertanya, \"Apakah pohon itu, wahai Rasulullah (ﷺ)?\" Baginda menjawab, \"Ia adalah pohon kurma.\""
  },
  {
    "id": 62,
    "hadith_number": 62,
    "tajuk_hadith": "Perumpamaan Pokok Kurma dengan Seorang Muslim",
    "perawi_melayu": "Diriwayatkan oleh Ibn `Umar:",
    "english_text": "The Prophet (ﷺ) said, \"Amongst the trees, there is a tree, the leaves of which do not fall and is like a \nMuslim. Tell me the name of that tree.\" Everybody started thinking about the trees of the desert areas. \nAnd I thought of the date-palm tree. The others then asked, \"Please inform us what is that tree, O \nAllah's Messenger (ﷺ)?\" He replied, \"It is the date-palm tree.\"",
    "arabic_text": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ مِنَ الشَّجَرِ شَجَرَةً لاَ يَسْقُطُ وَرَقُهَا، وَإِنَّهَا مَثَلُ الْمُسْلِمِ، حَدِّثُونِي مَا هِيَ ‏\"‏‏.‏ قَالَ فَوَقَعَ النَّاسُ فِي شَجَرِ الْبَوَادِي‏.‏ قَالَ عَبْدُ اللَّهِ فَوَقَعَ فِي نَفْسِي أَنَّهَا النَّخْلَةُ، ثُمَّ قَالُوا حَدِّثْنَا مَا هِيَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ هِيَ النَّخْلَةُ ‏\"‏‏.‏",
    "malay_translation": "Nabi ﷺ bersabda, \"Di antara pepohonan, ada sebatang pohon yang daunnya tidak gugur dan ia seperti seorang Muslim. Beritahu Aku nama pohon itu.\" Semua orang mula memikirkan tentang pepohonan di kawasan padang pasir. Dan aku terfikir tentang pokok kurma. Kemudian yang lain bertanya, \"Beritahulah kami apakah pohon itu, wahai Rasulullah ﷺ?\" Baginda menjawab, \"Ia adalah pokok kurma.\""
  },
  {
    "id": 63,
    "hadith_number": 63,
    "tajuk_hadith": "Soalan Dimam bin Tha'laba tentang Rukun Islam",
    "perawi_melayu": "Diriwayatkan oleh Anas bin Malik:",
    "english_text": "While we were sitting with the Prophet (ﷺ) in the mosque, a man came riding on a camel. He made his \ncamel kneel down in the mosque, tied its foreleg and then said: \"Who amongst you is Muhammad?\" \nAt that time the Prophet (ﷺ) was sitting amongst us (his companions) leaning on his arm. We replied, \n\"This white man reclining on his arm.\" The man then addressed him, \"O Son of `Abdul Muttalib.\" \nThe Prophet (ﷺ) said, \"I am here to answer your questions.\" The man said to the Prophet, \"I want to ask \nyou something and will be hard in questioning. So do not get angry.\" The Prophet (ﷺ) said, \"Ask whatever \nyou want.\" The man said, \"I ask you by your Lord, and the Lord of those who were before you, has \nAllah sent you as an Apostle to all the mankind?\" The Prophet (ﷺ) replied, \"By Allah, yes.\" The man \nfurther said, \"I ask you by Allah. Has Allah ordered you to offer five prayers in a day and night (24 \nhours).? He replied, \"By Allah, Yes.\" The man further said, \"I ask you by Allah! Has Allah ordered \nyou to observe fasts during this month of the year (i.e. Ramadan)?\" He replied, \"By Allah, Yes.\" The \nman further said, \"I ask you by Allah. Has Allah ordered you to take Zakat (obligatory charity) from \nour rich people and distribute it amongst our poor people?\" The Prophet (ﷺ) replied, \"By Allah, yes.\" \nThereupon that man said, \"I have believed in all that with which you have been sent, and I have been \nsent by my people as a messenger, and I am Dimam bin Tha`laba from the brothers of Bani Sa`d bin \nBakr.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ سَعِيدٍ ـ هُوَ الْمَقْبُرِيُّ ـ عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ بَيْنَمَا نَحْنُ جُلُوسٌ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي الْمَسْجِدِ، دَخَلَ رَجُلٌ عَلَى جَمَلٍ فَأَنَاخَهُ فِي الْمَسْجِدِ، ثُمَّ عَقَلَهُ، ثُمَّ قَالَ لَهُمْ أَيُّكُمْ مُحَمَّدٌ وَالنَّبِيُّ صلى الله عليه وسلم مُتَّكِئٌ بَيْنَ ظَهْرَانَيْهِمْ‏.‏ فَقُلْنَا هَذَا الرَّجُلُ الأَبْيَضُ الْمُتَّكِئُ‏.‏ فَقَالَ لَهُ الرَّجُلُ ابْنَ عَبْدِ الْمُطَّلِبِ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ قَدْ أَجَبْتُكَ ‏\"‏‏.‏ فَقَالَ الرَّجُلُ لِلنَّبِيِّ صلى الله عليه وسلم إِنِّي سَائِلُكَ فَمُشَدِّدٌ عَلَيْكَ فِي الْمَسْأَلَةِ فَلاَ تَجِدْ عَلَىَّ فِي نَفْسِكَ‏.‏ فَقَالَ ‏\"‏ سَلْ عَمَّا بَدَا لَكَ ‏\"‏‏.‏ فَقَالَ أَسْأَلُكَ بِرَبِّكَ وَرَبِّ مَنْ قَبْلَكَ، آللَّهُ أَرْسَلَكَ إِلَى النَّاسِ كُلِّهِمْ فَقَالَ ‏\"‏ اللَّهُمَّ نَعَمْ ‏\"‏‏.‏ قَالَ أَنْشُدُكَ بِاللَّهِ، آللَّهُ أَمَرَكَ أَنْ نُصَلِّيَ الصَّلَوَاتِ الْخَمْسَ فِي الْيَوْمِ وَاللَّيْلَةِ قَالَ ‏\"‏ اللَّهُمَّ نَعَمْ ‏\"‏‏.‏ قَالَ أَنْشُدُكَ بِاللَّهِ، آللَّهُ أَمَرَكَ أَنْ نَصُومَ هَذَا الشَّهْرَ مِنَ السَّنَةِ قَالَ ‏\"‏ اللَّهُمَّ نَعَمْ ‏\"‏‏.‏ قَالَ أَنْشُدُكَ بِاللَّهِ، آللَّهُ أَمَرَكَ أَنْ تَأْخُذَ هَذِهِ الصَّدَقَةَ مِنْ أَغْنِيَائِنَا فَتَقْسِمَهَا عَلَى فُقَرَائِنَا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ نَعَمْ ‏\"‏‏.‏ فَقَالَ الرَّجُلُ آمَنْتُ بِمَا جِئْتَ بِهِ، وَأَنَا رَسُولُ مَنْ وَرَائِي مِنْ قَوْمِي، وَأَنَا ضِمَامُ بْنُ ثَعْلَبَةَ أَخُو بَنِي سَعْدِ بْنِ بَكْرٍ‏.‏ رَوَاهُ مُوسَى وَعَلِيُّ بْنُ عَبْدِ الْحَمِيدِ عَنْ سُلَيْمَانَ عَنْ ثَابِتٍ عَنْ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا‏.‏",
    "malay_translation": "Ketika kami sedang duduk bersama Nabi (ﷺ) di dalam masjid, seorang lelaki datang menunggang unta. Dia membuat untanya berlutut di dalam masjid, mengikat kaki depannya, dan kemudian berkata: \"Siapakah di antara kamu Muhammad?\" Pada waktu itu Nabi (ﷺ) sedang duduk di antara kami (para sahabatnya) bersandar pada lengannya. Kami menjawab, \"Lelaki berkulit putih ini yang sedang bersandar pada lengannya.\" Lelaki itu kemudian menyapanya, \"Wahai anak `Abdul Muttalib.\" Nabi (ﷺ) bersabda, \"Aku di sini untuk menjawab soalanmu.\" Lelaki itu berkata kepada Nabi, \"Aku ingin bertanya kepadamu sesuatu dan akan bersikap keras dalam pertanyaan. Jadi jangan marah.\" Nabi (ﷺ) bersabda, \"Bertanyalah apa sahaja yang kamu mahu.\" Lelaki itu berkata, \"Aku bertanya kepadamu demi Tuhanmu, dan Tuhan orang-orang sebelummu, adakah Allah telah mengutusmu sebagai Rasul kepada seluruh umat manusia?\" Nabi (ﷺ) menjawab, \"Demi Allah, ya.\" Lelaki itu seterusnya berkata, \"Aku bertanya kepadamu demi Allah. Adakah Allah memerintahkanmu untuk menunaikan solat lima waktu dalam sehari semalam (24 jam)?\" Baginda menjawab, \"Demi Allah, ya.\" Lelaki itu seterusnya berkata, \"Aku bertanya kepadamu demi Allah! Adakah Allah memerintahkanmu untuk berpuasa pada bulan ini (iaitu Ramadan)?\" Baginda menjawab, \"Demi Allah, ya.\" Lelaki itu seterusnya berkata, \"Aku bertanya kepadamu demi Allah. Adakah Allah memerintahkanmu untuk mengambil Zakat (sedekah wajib) daripada orang kaya kami dan mengagihkannya kepada orang miskin kami?\" Nabi (ﷺ) menjawab, \"Demi Allah, ya.\" Kemudian lelaki itu berkata, \"Aku telah beriman dengan semua yang kamu bawa, dan aku telah diutus oleh kaumku sebagai seorang utusan, dan aku adalah Dimam bin Tha'laba dari saudara-saudara Bani Sa`d bin Bakr.\""
  },
  {
    "id": 64,
    "hadith_number": 64,
    "tajuk_hadith": "Surat Rasulullah SAW Dikoyak: Akibat dan Doa Baginda",
    "perawi_melayu": "Diriwayatkan daripada Abdullah bin `Abbas:",
    "english_text": "Once Allah's Messenger (ﷺ) gave a letter to a person and ordered him to go and deliver it to the Governor of \nBahrain. (He did so) and the Governor of Bahrain sent it to Chousroes, who read that letter and then \ntore it to pieces. (The sub-narrator (Ibn Shihab) thinks that Ibn Al-Musaiyab said that Allah's Messenger (ﷺ) \ninvoked Allah against them (saying), \"May Allah tear them into pieces, and disperse them all totally.)\"",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ بِكِتَابِهِ رَجُلاً، وَأَمَرَهُ أَنْ يَدْفَعَهُ إِلَى عَظِيمِ الْبَحْرَيْنِ، فَدَفَعَهُ عَظِيمُ الْبَحْرَيْنِ إِلَى كِسْرَى، فَلَمَّا قَرَأَهُ مَزَّقَهُ‏.‏ فَحَسِبْتُ أَنَّ ابْنَ الْمُسَيَّبِ قَالَ فَدَعَا عَلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُمَزَّقُوا كُلَّ مُمَزَّقٍ‏.‏",
    "malay_translation": "Suatu ketika, Rasulullah SAW memberikan sepucuk surat kepada seseorang dan memerintahkannya untuk pergi dan menyampaikannya kepada Gabenor Bahrain. (Dia melakukannya) dan Gabenor Bahrain mengirimkannya kepada Chousroes, yang membaca surat itu dan kemudian mengoyaknya menjadi beberapa bagian. (Sub-periwayat (Ibn Shihab) berpendapat bahwa Ibn Al-Musaiyab mengatakan bahwa Rasulullah SAW berdoa kepada Allah terhadap mereka (dengan mengatakan), \"Semoga Allah mencabik-cabik mereka menjadi berkeping-keping, dan menghancurkan mereka sepenuhnya.\")"
  },
  {
    "id": 65,
    "hadith_number": 65,
    "tajuk_hadith": "Cincin Nabi Muhammad ﷺ dengan Ukiran 'Muhammad Rasulullah'",
    "perawi_melayu": "Diriwayatkan oleh Anas bin Malik:",
    "english_text": "Once the Prophet (ﷺ) wrote a letter or had an idea of writing a letter. The Prophet (ﷺ) was told that they \n(rulers) would not read letters unless they were sealed. So the Prophet (ﷺ) got a silver ring made with \n\"Muhammad Allah's Messenger (ﷺ)\" engraved on it. As if I were just observing its white glitter in the hand \nof the Prophet.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَتَبَ النَّبِيُّ صلى الله عليه وسلم كِتَابًا ـ أَوْ أَرَادَ أَنْ يَكْتُبَ ـ فَقِيلَ لَهُ إِنَّهُمْ لاَ يَقْرَءُونَ كِتَابًا إِلاَّ مَخْتُومًا‏.‏ فَاتَّخَذَ خَاتَمًا مِنْ فِضَّةٍ نَقْشُهُ مُحَمَّدٌ رَسُولُ اللَّهِ‏.‏ كَأَنِّي أَنْظُرُ إِلَى بَيَاضِهِ فِي يَدِهِ‏.‏ فَقُلْتُ لِقَتَادَةَ مَنْ قَالَ نَقْشُهُ مُحَمَّدٌ رَسُولُ اللَّهِ قَالَ أَنَسٌ‏.‏",
    "malay_translation": "Pada suatu ketika, Nabi ﷺ menulis surat atau mempunyai idea untuk menulis surat. Nabi ﷺ diberitahu bahawa mereka (para pemerintah) tidak akan membaca surat kecuali jika ia dimeteraikan. Oleh itu, Nabi ﷺ membuat cincin perak dengan ukiran \"Muhammad Rasulullah (ﷺ)\" padanya. Seolah-olah saya sedang memerhatikan kilauan putihnya di tangan Nabi ﷺ."
  },
  {
    "id": 66,
    "hadith_number": 66,
    "tajuk_hadith": "Tiga Jenis Orang yang Menghadiri Majlis Rasulullah ﷺ",
    "perawi_melayu": "Diriwayatkan oleh Abu Waqid Al-Laithi:",
    "english_text": "While Allah's Messenger (ﷺ) was sitting in the mosque with some people, three men came. Two of them \ncame in front of Allah's Messenger (ﷺ) and the third one went away. The two persons kept on standing \nbefore Allah's Messenger (ﷺ) for a while and then one of them found a place in the circle and sat there while \nthe other sat behind the gathering, and the third one went away. When Allah's Messenger (ﷺ) finished his \npreaching, he said, \"Shall I tell you about these three persons? One of them betook himself to Allah, \nso Allah took him into His grace and mercy and accommodated him, the second felt shy from Allah, \nso Allah sheltered Him in His mercy (and did not punish him), while the third turned his face from \nAllah and went away, so Allah turned His face from him likewise. \"",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّ أَبَا مُرَّةَ، مَوْلَى عَقِيلِ بْنِ أَبِي طَالِبٍ أَخْبَرَهُ عَنْ أَبِي وَاقِدٍ اللَّيْثِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَيْنَمَا هُوَ جَالِسٌ فِي الْمَسْجِدِ وَالنَّاسُ مَعَهُ، إِذْ أَقْبَلَ ثَلاَثَةُ نَفَرٍ، فَأَقْبَلَ اثْنَانِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَذَهَبَ وَاحِدٌ، قَالَ فَوَقَفَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَمَّا أَحَدُهُمَا فَرَأَى فُرْجَةً فِي الْحَلْقَةِ فَجَلَسَ فِيهَا، وَأَمَّا الآخَرُ فَجَلَسَ خَلْفَهُمْ، وَأَمَّا الثَّالِثُ فَأَدْبَرَ ذَاهِبًا، فَلَمَّا فَرَغَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَلاَ أُخْبِرُكُمْ عَنِ النَّفَرِ الثَّلاَثَةِ أَمَّا أَحَدُهُمْ فَأَوَى إِلَى اللَّهِ، فَآوَاهُ اللَّهُ، وَأَمَّا الآخَرُ فَاسْتَحْيَا، فَاسْتَحْيَا اللَّهُ مِنْهُ، وَأَمَّا الآخَرُ فَأَعْرَضَ، فَأَعْرَضَ اللَّهُ عَنْهُ ‏\"‏‏.‏",
    "malay_translation": "Ketika Rasulullah ﷺ sedang duduk di dalam masjid bersama beberapa orang, datanglah tiga orang lelaki. Dua daripada mereka menghadap Rasulullah ﷺ dan yang ketiga pergi. Kedua-dua orang itu berdiri di hadapan Rasulullah ﷺ seketika, kemudian salah seorang daripada mereka mendapati ruang dalam bulatan dan duduk di situ, manakala seorang lagi duduk di belakang kumpulan itu, dan yang ketiga pergi. Apabila Rasulullah ﷺ selesai berkhutbah, baginda bersabda, \"Mahukah aku beritahu kamu tentang tiga orang ini? Salah seorang daripada mereka mendekatkan diri kepada Allah, maka Allah menerimanya ke dalam rahmat dan kasih sayang-Nya dan menempatkannya, yang kedua berasa malu kepada Allah, maka Allah melindunginya dalam rahmat-Nya (dan tidak menghukumnya), manakala yang ketiga berpaling daripada Allah dan pergi, maka Allah berpaling daripadanya juga.\" "
  },
  {
    "id": 67,
    "hadith_number": 67,
    "tajuk_hadith": "Kehormatan Nyawa, Harta dan Maruah dalam Islam",
    "perawi_melayu": "Diriwayatkan daripada ayah `Abdur-Rahman bin Abi Bakra:",
    "english_text": "Once the Prophet (ﷺ) was riding his camel and a man was holding its rein. The Prophet (ﷺ) asked, \"What is \nthe day today?\" We kept quiet, thinking that he might give that day another name. He said, \"Isn't it the \nday of Nahr (slaughtering of the animals of sacrifice)\" We replied, \"Yes.\" He further asked, \"Which \nmonth is this?\" We again kept quiet, thinking that he might give it another name. Then he said, \"Isn't it \nthe month of Dhul-Hijja?\" We replied, \"Yes.\" He said, \"Verily! Your blood, property and honor are \nsacred to one another (i.e. Muslims) like the sanctity of this day of yours, in this month of yours and in \nthis city of yours. It is incumbent upon those who are present to inform those who are absent because \nthose who are absent might comprehend (what I have said) better than the present audience.\"",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا بِشْرٌ، قَالَ حَدَّثَنَا ابْنُ عَوْنٍ، عَنِ ابْنِ سِيرِينَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، ذَكَرَ النَّبِيَّ صلى الله عليه وسلم قَعَدَ عَلَى بَعِيرِهِ، وَأَمْسَكَ إِنْسَانٌ بِخِطَامِهِ ـ أَوْ بِزِمَامِهِ ـ قَالَ ‏\"‏ أَىُّ يَوْمٍ هَذَا ‏\"‏‏.‏ فَسَكَتْنَا حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ سِوَى اسْمِهِ‏.‏ قَالَ ‏\"‏ أَلَيْسَ يَوْمَ النَّحْرِ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ فَأَىُّ شَهْرٍ هَذَا ‏\"‏‏.‏ فَسَكَتْنَا حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ‏.‏ فَقَالَ ‏\"‏ أَلَيْسَ بِذِي الْحِجَّةِ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ فَإِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ وَأَعْرَاضَكُمْ بَيْنَكُمْ حَرَامٌ كَحُرْمَةِ يَوْمِكُمْ هَذَا، فِي شَهْرِكُمْ هَذَا، فِي بَلَدِكُمْ هَذَا‏.‏ لِيُبَلِّغِ الشَّاهِدُ الْغَائِبَ، فَإِنَّ الشَّاهِدَ عَسَى أَنْ يُبَلِّغَ مَنْ هُوَ أَوْعَى لَهُ مِنْهُ ‏\"‏‏.‏",
    "malay_translation": "Pada suatu ketika, Nabi (ﷺ) sedang menunggang untanya dan seorang lelaki memegang tali kekangnya. Nabi (ﷺ) bertanya, \"Hari apakah ini?\" Kami berdiam diri, menyangka baginda akan menamakannya dengan nama lain. Baginda bersabda, \"Bukankah ini hari Nahr (penyembelihan binatang korban)?\" Kami menjawab, \"Ya.\" Baginda bertanya lagi, \"Bulan apakah ini?\" Kami berdiam diri lagi, menyangka baginda akan menamakannya dengan nama lain. Kemudian baginda bersabda, \"Bukankah ini bulan Dhul-Hijja?\" Kami menjawab, \"Ya.\" Baginda bersabda, \"Sesungguhnya! Darah kamu, harta kamu dan kehormatan kamu adalah suci antara satu sama lain (iaitu umat Islam) seperti kesucian hari kamu ini, dalam bulan kamu ini dan di kota kamu ini. Adalah wajib bagi mereka yang hadir untuk memaklumkan kepada mereka yang tidak hadir kerana mereka yang tidak hadir mungkin memahami (apa yang telah saya katakan) lebih baik daripada hadirin yang hadir.\""
  },
  {
    "id": 68,
    "hadith_number": 68,
    "tajuk_hadith": "Nabi ﷺ Memilih Waktu Sesuai dalam Menyampaikan Nasihat",
    "perawi_melayu": "Diriwayatkan daripada Ibn Mas'ud:",
    "english_text": "The Prophet (ﷺ) used to take care of us in preaching by selecting a suitable time, so that we might not get \nbored. (He abstained from pestering us with sermons and knowledge all the time).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنِ ابْنِ مَسْعُودٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَتَخَوَّلُنَا بِالْمَوْعِظَةِ فِي الأَيَّامِ، كَرَاهَةَ السَّآمَةِ عَلَيْنَا‏.‏",
    "malay_translation": "Nabi ﷺ biasa mengambil berat tentang kami dalam menyampaikan nasihat dengan memilih waktu yang sesuai, supaya kami tidak merasa bosan. (Baginda ﷺ menjauhi daripada terus-menerus mendesak kami dengan khutbah dan ilmu sepanjang masa)."
  },
  {
    "id": 69,
    "hadith_number": 69,
    "tajuk_hadith": "Memudahkan Urusan Agama dan Memberi Khabar Gembira",
    "perawi_melayu": "Diriwayatkan oleh Anas bin Malik:",
    "english_text": "The Prophet (ﷺ) said, \"Facilitate things to people (concerning religious matters), and do not make it hard \nfor them and give them good tidings and do not make them run away (from Islam).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنِي أَبُو التَّيَّاحِ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَسِّرُوا وَلاَ تُعَسِّرُوا، وَبَشِّرُوا وَلاَ تُنَفِّرُوا ‏\"‏‏.‏",
    "malay_translation": "Nabi ﷺ bersabda, \"Permudahkanlah urusan (agama) kepada manusia, dan janganlah kamu menyukarkannya, dan berilah khabar gembira dan janganlah kamu membuat mereka lari (dari Islam).\""
  },
  {
    "id": 70,
    "hadith_number": 70,
    "tajuk_hadith": "Abdullah Berkhutbah pada Hari Khamis Kerana Bimbang Jemu",
    "perawi_melayu": "Diriwayatkan oleh Abu Wail:",
    "english_text": "`Abdullah used to give a religious talk to the people on every Thursday. Once a man said, \"O Aba \n`Abdur-Rahman! (By Allah) I wish if you could preach us daily.\" He replied, \"The only thing which \nprevents me from doing so, is that I hate to bore you, and no doubt I take care of you in preaching by \nselecting a suitable time just as the Prophet (ﷺ) used to do with us, for fear of making us bored.\"",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، قَالَ كَانَ عَبْدُ اللَّهِ يُذَكِّرُ النَّاسَ فِي كُلِّ خَمِيسٍ، فَقَالَ لَهُ رَجُلٌ يَا أَبَا عَبْدِ الرَّحْمَنِ لَوَدِدْتُ أَنَّكَ ذَكَّرْتَنَا كُلَّ يَوْمٍ‏.‏ قَالَ أَمَا إِنَّهُ يَمْنَعُنِي مِنْ ذَلِكَ أَنِّي أَكْرَهُ أَنْ أُمِلَّكُمْ، وَإِنِّي أَتَخَوَّلُكُمْ بِالْمَوْعِظَةِ كَمَا كَانَ النَّبِيُّ صلى الله عليه وسلم يَتَخَوَّلُنَا بِهَا، مَخَافَةَ السَّآمَةِ عَلَيْنَا‏.‏",
    "malay_translation": "Abdullah biasanya menyampaikan ceramah agama kepada orang ramai pada setiap hari Khamis.  Pernah seorang lelaki berkata, \"Wahai Aba `Abdur-Rahman! (Demi Allah) Saya berharap sekiranya anda dapat berkhutbah kepada kami setiap hari.\"  Beliau menjawab, \"Satu-satunya perkara yang menghalang saya daripada berbuat demikian ialah saya benci membuat kamu bosan, dan tidak syak lagi saya mengambil berat tentang kamu dalam berkhutbah dengan memilih masa yang sesuai sama seperti Nabi (ﷺ) biasa lakukan dengan kami, kerana takut membuat kami bosan.\""
  },
  {
    "id": 71,
    "hadith_number": 71,
    "tajuk_hadith": "Keutamaan Memahami Agama dan Ketinggian Umat Islam",
    "perawi_melayu": "Diriwayatkan oleh Muawiyah:",
    "english_text": "I heard Allah's Messenger (ﷺ) saying, \"If Allah wants to do good to a person, He makes him comprehend the \nreligion. I am just a distributor, but the grant is from Allah. (And remember) that this nation (true \nMuslims) will keep on following Allah's teachings strictly and they will not be harmed by any one \ngoing on a different path till Allah's order (Day of Judgment) is established.\"",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ قَالَ حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ سَمِعْتُ مُعَاوِيَةَ، خَطِيبًا يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُفَقِّهْهُ فِي الدِّينِ، وَإِنَّمَا أَنَا قَاسِمٌ وَاللَّهُ يُعْطِي، وَلَنْ تَزَالَ هَذِهِ الأُمَّةُ قَائِمَةً عَلَى أَمْرِ اللَّهِ لاَ يَضُرُّهُمْ مَنْ خَالَفَهُمْ حَتَّى يَأْتِيَ أَمْرُ اللَّهِ ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Rasulullah (ﷺ) bersabda, \"Jika Allah menghendaki kebaikan kepada seseorang, Dia akan memberinya pemahaman tentang agama. Aku hanyalah seorang pembagi, tetapi pemberian itu dari Allah. (Dan ingatlah) bahawa umat ini (Muslim sejati) akan terus mengikuti ajaran Allah dengan teguh dan mereka tidak akan dicederakan oleh sesiapa pun yang menempuh jalan yang berbeza sehingga perintah Allah (Hari Kiamat) ditegakkan.\""
  },
  {
    "id": 72,
    "hadith_number": 72,
    "tajuk_hadith": "Perumpamaan Pokok Kurma Seperti Seorang Muslim",
    "perawi_melayu": "Diriwayatkan oleh Ibn `Umar:",
    "english_text": "We were with the Prophet (ﷺ) and fresh dates of a palm tree were brought to him. On that he said, \n\"Amongst the trees, there is a tree which resembles a Muslim.\" I wanted to say that it was the datepalm \ntree but as I was the youngest of all (of them) I kept quiet. And then the Prophet (ﷺ) said, \"It is the \ndate-palm tree.\"",
    "arabic_text": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، قَالَ قَالَ لِي ابْنُ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ، قَالَ صَحِبْتُ ابْنَ عُمَرَ إِلَى الْمَدِينَةِ فَلَمْ أَسْمَعْهُ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلاَّ حَدِيثًا وَاحِدًا، قَالَ كُنَّا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَأُتِيَ بِجُمَّارٍ فَقَالَ ‏\"‏ إِنَّ مِنَ الشَّجَرِ شَجَرَةً مَثَلُهَا كَمَثَلِ الْمُسْلِمِ ‏\"‏‏.‏ فَأَرَدْتُ أَنْ أَقُولَ هِيَ النَّخْلَةُ، فَإِذَا أَنَا أَصْغَرُ الْقَوْمِ فَسَكَتُّ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هِيَ النَّخْلَةُ ‏\"‏‏.‏",
    "malay_translation": "Kami bersama Nabi (ﷺ) dan buah kurma segar dibawa kepada baginda. Baginda bersabda, \"Di antara pokok-pokok, ada satu pokok yang menyerupai seorang Muslim.\" Saya ingin mengatakan bahawa ia adalah pokok kurma tetapi kerana saya adalah yang termuda di antara mereka semua, saya berdiam diri. Kemudian Nabi (ﷺ) bersabda, \"Ia adalah pokok kurma.\""
  },
  {
    "id": 73,
    "hadith_number": 73,
    "tajuk_hadith": "Larangan Dengki Kecuali dalam Dua Perkara",
    "perawi_melayu": "Diriwayatkan daripada Abdullah bin Mas'ud:",
    "english_text": "The Prophet (ﷺ) said, \"Do not wish to be like anyone except in two cases. (The first is) A person, whom \nAllah has given wealth and he spends it righteously; (the second is) the one whom Allah has given \nwisdom (the Holy Qur'an) and he acts according to it and teaches it to others.\" (Fath-al-Bari page 177 \nVol. 1)",
    "arabic_text": "حَدَّثَنَا الْحُمَيْدِيُّ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، عَلَى غَيْرِ مَا حَدَّثَنَاهُ الزُّهْرِيُّ، قَالَ سَمِعْتُ قَيْسَ بْنَ أَبِي حَازِمٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ حَسَدَ إِلاَّ فِي اثْنَتَيْنِ رَجُلٌ آتَاهُ اللَّهُ مَالاً فَسُلِّطَ عَلَى هَلَكَتِهِ فِي الْحَقِّ، وَرَجُلٌ آتَاهُ اللَّهُ الْحِكْمَةَ، فَهْوَ يَقْضِي بِهَا وَيُعَلِّمُهَا ‏\"‏‏.‏",
    "malay_translation": "Nabi ﷺ bersabda, \"Janganlah kamu bercita-cita menjadi seperti orang lain kecuali dalam dua perkara. (Pertama) Seseorang yang Allah kurniakan harta dan dia membelanjakannya dengan benar; (kedua) seseorang yang Allah kurniakan hikmah (Al-Quran) dan dia bertindak mengikutnya dan mengajarkannya kepada orang lain.\""
  },
  {
    "id": 74,
    "hadith_number": 74,
    "tajuk_hadith": "Perbezaan Pendapat Tentang Sahabat Nabi Musa: Khidir AS",
    "perawi_melayu": "Diriwayatkan oleh Ibn `Abbas:",
    "english_text": "That he differed with Hur bin Qais bin Hisn Al-Fazari regarding the companion of (the Prophet) \nMoses. Ibn `Abbas said that he was Al Khadir. Meanwhile, Ubai bin Ka`b passed by them and Ibn \n`Abbas called him, saying \"My friend (Hur) and I have differed regarding Moses' companion, whom \nMoses asked the way to meet. Have you heard the Prophet (ﷺ) mentioning something about him? He said, \n\"Yes. I heard Allah's Messenger (ﷺ) saying, \"While Moses was sitting in the company of some Israelites, a \nman came and asked him. \"Do you know anyone who is more learned than you? Moses replied: \"No.\" \nSo Allah sent the Divine Inspiration to Moses: 'Yes, Our slave Khadir (is more learned than you.)' \nMoses asked (Allah) how to meet him (Khadir). So Allah made the fish as a sign for him and he was \ntold that when the fish was lost, he should return (to the place where he had lost it) and there he would \nmeet him (Al-Khadir). So Moses went on looking for the sign of the fish in the sea. The servant-boy \nof Moses said to him: Do you remember when we betook ourselves to the rock, I indeed forgot the \nfish, none but Satan made me forget to remember it. On that Moses said: 'That is what we have been \nseeking? (18.64) So they went back retracing their footsteps, and found Khadir. (And) what happened \nfurther to them is narrated in the Holy Qur'an by Allah. (18.54 up to 18.82)",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ غُرَيْرٍ الزُّهْرِيُّ، قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنِي أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، حَدَّثَ أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ أَخْبَرَهُ عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ تَمَارَى هُوَ وَالْحُرُّ بْنُ قَيْسِ بْنِ حِصْنٍ الْفَزَارِيُّ فِي صَاحِبِ مُوسَى قَالَ ابْنُ عَبَّاسٍ هُوَ خَضِرٌ‏.‏ فَمَرَّ بِهِمَا أُبَىُّ بْنُ كَعْبٍ، فَدَعَاهُ ابْنُ عَبَّاسٍ فَقَالَ إِنِّي تَمَارَيْتُ أَنَا وَصَاحِبِي، هَذَا فِي صَاحِبِ مُوسَى الَّذِي سَأَلَ مُوسَى السَّبِيلَ إِلَى لُقِيِّهِ، هَلْ سَمِعْتَ النَّبِيَّ صلى الله عليه وسلم يَذْكُرُ شَأْنَهُ قَالَ نَعَمْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ بَيْنَمَا مُوسَى فِي مَلإٍ مِنْ بَنِي إِسْرَائِيلَ، جَاءَهُ رَجُلٌ فَقَالَ هَلْ تَعْلَمُ أَحَدًا أَعْلَمَ مِنْكَ قَالَ مُوسَى لاَ‏.‏ فَأَوْحَى اللَّهُ إِلَى مُوسَى بَلَى، عَبْدُنَا خَضِرٌ، فَسَأَلَ مُوسَى السَّبِيلَ إِلَيْهِ، فَجَعَلَ اللَّهُ لَهُ الْحُوتَ آيَةً، وَقِيلَ لَهُ إِذَا فَقَدْتَ الْحُوتَ فَارْجِعْ، فَإِنَّكَ سَتَلْقَاهُ، وَكَانَ يَتَّبِعُ أَثَرَ الْحُوتِ فِي الْبَحْرِ، فَقَالَ لِمُوسَى فَتَاهُ أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ فَإِنِّي نَسِيتُ الْحُوتَ، وَمَا أَنْسَانِيهِ إِلاَّ الشَّيْطَانُ أَنْ أَذْكُرَهُ‏.‏ قَالَ ذَلِكَ مَا كُنَّا نَبْغِي، فَارْتَدَّا عَلَى آثَارِهِمَا قَصَصًا، فَوَجَدَا خَضِرًا‏.‏ فَكَانَ مِنْ شَأْنِهِمَا الَّذِي قَصَّ اللَّهُ ـ عَزَّ وَجَلَّ ـ فِي كِتَابِهِ ‏\"‏‏.‏",
    "malay_translation": "Bahawa beliau (Ibn `Abbas) berselisih dengan Hur bin Qais bin Hisn Al-Fazari mengenai sahabat (Nabi) Musa. Ibn `Abbas berkata bahawa dia adalah Al-Khidir. Sementara itu, Ubai bin Ka`b lalu di hadapan mereka dan Ibn `Abbas memanggilnya, berkata, \"Sahabatku (Hur) dan aku berselisih mengenai sahabat Musa, yang Musa bertanya jalan untuk bertemu dengannya. Adakah kamu mendengar Nabi (ﷺ) menyebut sesuatu tentangnya?\" Beliau berkata, \"Ya. Saya mendengar Rasulullah (ﷺ) bersabda, \"Ketika Musa sedang duduk bersama beberapa Bani Israel, seorang lelaki datang dan bertanya kepadanya. \"Adakah kamu tahu sesiapa yang lebih berilmu daripada kamu?\" Musa menjawab: \"Tidak.\" Maka Allah menghantar wahyu kepada Musa: 'Ya, hamba Kami Khidir (lebih berilmu daripada kamu).' Musa bertanya (Allah) bagaimana untuk bertemu dengannya (Khidir). Maka Allah menjadikan ikan sebagai tanda baginya dan dia diberitahu bahawa apabila ikan itu hilang, dia harus kembali (ke tempat dia kehilangannya) dan di sana dia akan bertemu dengannya (Al-Khidir). Maka Musa terus mencari tanda ikan di laut. Budak lelaki Musa berkata kepadanya: Adakah kamu ingat ketika kita mencari perlindungan di batu, sesungguhnya aku terlupa ikan itu, tidak lain hanyalah Syaitan yang membuat aku terlupa untuk mengingatinya. Mengenai hal itu Musa berkata: 'Itulah yang kita cari? (18.64) Maka mereka berdua kembali menelusuri jejak mereka, dan mendapati Khidir. (Dan) apa yang berlaku selanjutnya kepada mereka diriwayatkan dalam Al-Quran oleh Allah. (18.54 hingga 18.82)"
  },
  {
    "id": 75,
    "hadith_number": 75,
    "tajuk_hadith": "Doa Nabi ﷺ untuk Ilmu Al-Quran Ibn `Abbas",
    "perawi_melayu": "Diriwayatkan oleh Ibn `Abbas:",
    "english_text": "Once the Prophet (ﷺ) embraced me and said, \"O Allah! Bestow on him the knowledge of the Book \n(Qur'an).",
    "arabic_text": "حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ ضَمَّنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏\n\"‏ اللَّهُمَّ عَلِّمْهُ الْكِتَابَ ‏\"‏‏.‏",
    "malay_translation": "Pada suatu ketika, Nabi ﷺ memelukku dan bersabda, \"Ya Allah! Kurniakanlah kepadanya ilmu tentang Kitab (Al-Qur'an).\""
  },
  {
    "id": 76,
    "hadith_number": 76,
    "tajuk_hadith": "Melepasi Shaf Ketika Solat di Mina",
    "perawi_melayu": "Diriwayatkan oleh Ibn `Abbas:",
    "english_text": "Once I came riding a she-ass and had (just) attained the age of puberty. Allah's Messenger (ﷺ) was offering \nthe prayer at Mina. There was no wall in front of him and I passed in front of some of the row while \nthey were offering their prayers. There I let the she-ass loose to graze and entered the row, and nobody \nobjected to it.",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، قَالَ أَقْبَلْتُ رَاكِبًا عَلَى حِمَارٍ أَتَانٍ، وَأَنَا يَوْمَئِذٍ قَدْ نَاهَزْتُ الاِحْتِلاَمَ، وَرَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي بِمِنًى إِلَى غَيْرِ جِدَارٍ، فَمَرَرْتُ بَيْنَ يَدَىْ بَعْضِ الصَّفِّ وَأَرْسَلْتُ الأَتَانَ تَرْتَعُ، فَدَخَلْتُ فِي الصَّفِّ، فَلَمْ يُنْكَرْ ذَلِكَ عَلَىَّ‏.‏",
    "malay_translation": "Saya datang menunggang seekor keldai betina dan baru sahaja mencapai usia baligh. Rasulullah (ﷺ) sedang menunaikan solat di Mina. Tidak ada dinding di hadapannya dan saya melintasi di hadapan beberapa saf ketika mereka sedang solat. Di sana saya melepaskan keldai betina itu untuk meragut rumput dan memasuki saf, dan tidak ada seorang pun yang membantahnya."
  },
  {
    "id": 77,
    "hadith_number": 77,
    "tajuk_hadith": "Rasulullah ﷺ Memercikkan Air ke Muka Seorang Budak Kecil",
    "perawi_melayu": "Diriwayatkan oleh Mahmud bin Rabi`a:",
    "english_text": "When I was a boy of five, I remember, the Prophet (ﷺ) took water from a bucket (used for getting water \nout of a well) with his mouth and threw it on my face.",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا أَبُو مُسْهِرٍ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ حَرْبٍ، حَدَّثَنِي الزُّبَيْدِيُّ، عَنِ الزُّهْرِيِّ، عَنْ مَحْمُودِ بْنِ الرَّبِيعِ، قَالَ عَقَلْتُ مِنَ النَّبِيِّ صلى الله عليه وسلم مَجَّةً مَجَّهَا فِي وَجْهِي وَأَنَا ابْنُ خَمْسِ سِنِينَ مِنْ دَلْوٍ‏.‏",
    "malay_translation": "Ketika saya berumur lima tahun, saya ingat, Nabi ﷺ mengambil air dari sebuah timba (yang digunakan untuk mengambil air dari perigi) dengan mulutnya dan memercikkannya ke muka saya."
  },
  {
    "id": 78,
    "hadith_number": 78,
    "tajuk_hadith": "Perbezaan Pendapat Tentang Sahabat Nabi Musa AS dan Pertemuan dengan Khidir AS",
    "perawi_melayu": "Diriwayatkan oleh Ibn `Abbas:",
    "english_text": "that he differed with Hur bin Qais bin Hisn Al-Fazari regarding the companion of the Prophet (ﷺ) Moses. \nMeanwhile, Ubai bin Ka`b passed by them and Ibn `Abbas called him saying, \"My friend (Hur) and I \nhave differed regarding Moses' companion whom Moses asked the way to meet. Have you heard \nAllah's Messenger (ﷺ) mentioning something about him? Ubai bin Ka`b said: \"Yes, I heard the Prophet (ﷺ) \nmentioning something about him (saying) while Moses was sitting in the company of some Israelites, \na man came and asked him: \"Do you know anyone who is more learned than you? Moses replied: \n\"No.\" So Allah sent the Divine Inspiration to Moses: '--Yes, Our slave Khadir is more learned than \nyou. Moses asked Allah how to meet him (Al-Khadir). So Allah made the fish a sign for him and he \nwas told when the fish was lost, he should return (to the place where he had lost it) and there he would \nmeet him (Al-Khadir). So Moses went on looking for the sign of the fish in the sea. The servant-boy \nof Moses said: 'Do you remember when we betook ourselves to the rock, I indeed forgot the fish, none \nbut Satan made me forget to remember it. On that Moses said, 'That is what we have been seeking.' So \nthey went back retracing their footsteps, and found Khadir. (and) what happened further about them is \nnarrated in the Holy Qur'an by Allah.\" (18.54 up to 18.82)",
    "arabic_text": "حَدَّثَنَا أَبُو الْقَاسِمِ، خَالِدُ بْنُ خَلِيٍّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، قَالَ قَالَ الأَوْزَاعِيُّ أَخْبَرَنَا الزُّهْرِيُّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ تَمَارَى هُوَ وَالْحُرُّ بْنُ قَيْسِ بْنِ حِصْنٍ الْفَزَارِيُّ فِي صَاحِبِ مُوسَى، فَمَرَّ بِهِمَا أُبَىُّ بْنُ كَعْبٍ، فَدَعَاهُ ابْنُ عَبَّاسٍ فَقَالَ إِنِّي تَمَارَيْتُ أَنَا وَصَاحِبِي هَذَا فِي صَاحِبِ مُوسَى الَّذِي سَأَلَ السَّبِيلَ إِلَى لُقِيِّهِ، هَلْ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَذْكُرُ شَأْنَهُ فَقَالَ أُبَىٌّ نَعَمْ، سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَذْكُرُ شَأْنَهُ يَقُولُ ‏\n\"‏ بَيْنَمَا مُوسَى فِي مَلإٍ مِنْ بَنِي إِسْرَائِيلَ، إِذْ جَاءَهُ رَجُلٌ فَقَالَ أَتَعْلَمُ أَحَدًا أَعْلَمَ مِنْكَ قَالَ مُوسَى لاَ‏.‏ فَأَوْحَى اللَّهُ عَزَّ وَجَلَّ إِلَى مُوسَى بَلَى، عَبْدُنَا خَضِرٌ، فَسَأَلَ السَّبِيلَ إِلَى لُقِيِّهِ، فَجَعَلَ اللَّهُ لَهُ الْحُوتَ آيَةً، وَقِيلَ لَهُ إِذَا فَقَدْتَ الْحُوتَ فَارْجِعْ، فَإِنَّكَ سَتَلْقَاهُ، فَكَانَ مُوسَى صلى الله عليه وسلم يَتَّبِعُ أَثَرَ الْحُوتِ فِي الْبَحْرِ‏.‏ فَقَالَ فَتَى مُوسَى لِمُوسَى أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ فَإِنِّي نَسِيتُ الْحُوتَ، وَمَا أَنْسَانِيهِ إِلاَّ الشَّيْطَانُ أَنْ أَذْكُرَهُ‏.‏ قَالَ مُوسَى ذَلِكَ مَا كُنَّا نَبْغِي‏.‏ فَارْتَدَّا عَلَى آثَارِهِمَا قَصَصًا، فَوَجَدَا خَضِرًا، فَكَانَ مِنْ شَأْنِهِمَا مَا قَصَّ اللَّهُ فِي كِتَابِهِ ‏\"‏‏.‏",
    "malay_translation": "bahawa dia (Ibn `Abbas) berselisih pendapat dengan Hur bin Qais bin Hisn Al-Fazari mengenai sahabat Nabi Musa (ﷺ). Sementara itu, Ubai bin Ka'b lalu di hadapan mereka dan Ibn `Abbas memanggilnya sambil berkata, \"Saya dan sahabat saya (Hur) telah berselisih pendapat mengenai sahabat Musa yang Musa bertanya jalan untuk bertemu dengannya. Pernahkah anda mendengar Rasulullah (ﷺ) menyebut sesuatu mengenainya?\" Ubai bin Ka'b berkata: \"Ya, saya mendengar Nabi (ﷺ) menyebut sesuatu mengenainya (dengan mengatakan) ketika Musa sedang duduk bersama beberapa orang Bani Israel, seorang lelaki datang dan bertanya kepadanya: \"Adakah anda tahu sesiapa yang lebih berilmu daripada anda?\" Musa menjawab: \"Tidak.\" Maka Allah menghantar Wahyu kepada Musa: '--Ya, hamba Kami Khadir lebih berilmu daripada anda. Musa bertanya kepada Allah bagaimana untuk bertemu dengannya (Al-Khadir). Maka Allah menjadikan ikan sebagai tanda baginya dan dia diberitahu apabila ikan itu hilang, dia harus kembali (ke tempat di mana dia telah kehilangannya) dan di sana dia akan bertemu dengannya (Al-Khadir). Maka Musa terus mencari tanda ikan di laut. Budak suruhan Musa berkata: 'Tahukah kamu ketika kita berlindung di batu, sesungguhnya saya terlupa ikan itu, tidak ada yang membuat saya lupa untuk mengingatinya kecuali Syaitan. Mengenai itu Musa berkata, 'Itulah yang kita cari.' Maka mereka kembali menjejaki jejak mereka, dan menemui Khadir. (dan) apa yang berlaku selanjutnya tentang mereka diriwayatkan dalam Al-Quran oleh Allah.\" (18.54 hingga 18.82)"
  },
  {
    "id": 79,
    "hadith_number": 79,
    "tajuk_hadith": "Perumpamaan Hidayah dan Ilmu yang Dibawa oleh Nabi Muhammad ﷺ",
    "perawi_melayu": "Diriwayatkan oleh Abu Musa:",
    "english_text": "The Prophet (ﷺ) said, \"The example of guidance and knowledge with which Allah has sent me is like \nabundant rain falling on the earth, some of which was fertile soil that absorbed rain water and brought \nforth vegetation and grass in abundance. (And) another portion of it was hard and held the rain water \nand Allah benefited the people with it and they utilized it for drinking, making their animals drink \nfrom it and for irrigation of the land for cultivation. (And) a portion of it was barren which could \nneither hold the water nor bring forth vegetation (then that land gave no benefits). The first is the \nthe example of the person who comprehends Allah's religion and gets benefit (from the knowledge) which \nAllah has revealed through me (the Prophets and learns and then teaches others. The last example is \nthat of a person who does not care for it and does not take Allah's guidance revealed through me (He \nis like that barren land.)\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَثَلُ مَا بَعَثَنِي اللَّهُ بِهِ مِنَ الْهُدَى وَالْعِلْمِ كَمَثَلِ الْغَيْثِ الْكَثِيرِ أَصَابَ أَرْضًا، فَكَانَ مِنْهَا نَقِيَّةٌ قَبِلَتِ الْمَاءَ، فَأَنْبَتَتِ الْكَلأَ وَالْعُشْبَ الْكَثِيرَ، وَكَانَتْ مِنْهَا أَجَادِبُ أَمْسَكَتِ الْمَاءَ، فَنَفَعَ اللَّهُ بِهَا النَّاسَ، فَشَرِبُوا وَسَقَوْا وَزَرَعُوا، وَأَصَابَتْ مِنْهَا طَائِفَةً أُخْرَى، إِنَّمَا هِيَ قِيعَانٌ لاَ تُمْسِكُ مَاءً، وَلاَ تُنْبِتُ كَلأً، فَذَلِكَ مَثَلُ مَنْ فَقِهَ فِي دِينِ اللَّهِ وَنَفَعَهُ مَا بَعَثَنِي اللَّهُ بِهِ، فَعَلِمَ وَعَلَّمَ، وَمَثَلُ مَنْ لَمْ يَرْفَعْ بِذَلِكَ رَأْسًا، وَلَمْ يَقْبَلْ هُدَى اللَّهِ الَّذِي أُرْسِلْتُ بِهِ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ قَالَ إِسْحَاقُ وَكَانَ مِنْهَا طَائِفَةٌ قَيَّلَتِ الْمَاءَ‏.‏ قَاعٌ يَعْلُوهُ الْمَاءُ، وَالصَّفْصَفُ الْمُسْتَوِي مِنَ الأَرْضِ‏.‏",
    "malay_translation": "Nabi ﷺ bersabda, \"Perumpamaan hidayah dan ilmu yang Allah mengutusku dengannya adalah seperti hujan lebat yang menimpa bumi. Sebahagian daripadanya adalah tanah yang subur yang menyerap air hujan lalu menumbuhkan tumbuh-tumbuhan dan rumput yang banyak. (Dan) sebahagian yang lain adalah tanah keras yang menahan air hujan, lalu Allah memberikan manfaat kepada manusia dengannya, maka mereka meminumnya, memberi minum haiwan ternakan mereka daripadanya, dan mengairi tanah untuk bercucuk tanam. (Dan) sebahagian daripadanya adalah tanah tandus yang tidak dapat menahan air mahupun menumbuhkan tumbuh-tumbuhan (maka tanah itu tidak memberikan manfaat). Yang pertama adalah perumpamaan orang yang memahami agama Allah dan mendapat manfaat (daripada ilmu) yang Allah wahyukan melalui aku (para Nabi), lalu dia belajar dan kemudian mengajarkannya kepada orang lain. Contoh terakhir adalah orang yang tidak peduli kepadanya dan tidak menerima petunjuk Allah yang diwahyukan melalui aku (dia seperti tanah tandus itu).\""
  },
  {
    "id": 80,
    "hadith_number": 80,
    "tajuk_hadith": "Tanda-tanda Kiamat: Ilmu Agama Diangkat, Kebodohan Berleluasa, Arak Diminum, dan Zina Bermaharajalela",
    "perawi_melayu": "Diriwayatkan oleh Anas:",
    "english_text": "Allah's Messenger (ﷺ) said, \"From among the portents of the Hour are (the following): \n-1. Religious knowledge will be taken away (by the death of Religious learned men). \n-2. (Religious) ignorance will prevail. \n-3. Drinking of Alcoholic drinks (will be very common). \n-4. There will be prevalence of open illegal sexual intercourse.",
    "arabic_text": "حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ أَبِي التَّيَّاحِ، عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ يُرْفَعَ الْعِلْمُ، وَيَثْبُتَ الْجَهْلُ، وَيُشْرَبَ الْخَمْرُ، وَيَظْهَرَ الزِّنَا ‏\"‏‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda, \"Sesungguhnya di antara tanda-tanda Kiamat adalah: \n-1. Ilmu agama akan diangkat (dengan kematian para ulama). \n-2. Kebodohan (agama) akan berleluasa. \n-3. Minuman beralkohol (arak) akan diminum secara berleluasa. \n-4. Perzinaan secara terang-terangan akan merebak."
  },
  {
    "id": 81,
    "hadith_number": 81,
    "tajuk_hadith": "Tanda-tanda Kiamat: Ilmu Berkurangan, Kejahilan Berleluasa, Zina Bermaharajalela, Wanita Bertambah, Lelaki Berkurangan",
    "perawi_melayu": "Diriwayatkan oleh Anas:",
    "english_text": "I will narrate to you a Hadith and none other than I will tell you about after it. I heard Allah's Messenger (ﷺ) \nsaying: From among the portents of the Hour are (the following): \n-1. Religious knowledge will decrease (by the death of religious learned men). \n-2. Religious ignorance will prevail. \n-3. There will be prevalence of open illegal sexual intercourse. \n-4. Women will increase in number and men will decrease in number so much so that fifty women \nwill be looked after by one man.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ لأُحَدِّثَنَّكُمْ حَدِيثًا لاَ يُحَدِّثُكُمْ أَحَدٌ بَعْدِي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ يَقِلَّ الْعِلْمُ، وَيَظْهَرَ الْجَهْلُ، وَيَظْهَرَ الزِّنَا، وَتَكْثُرَ النِّسَاءُ وَيَقِلَّ الرِّجَالُ، حَتَّى يَكُونَ لِخَمْسِينَ امْرَأَةً الْقَيِّمُ الْوَاحِدُ ‏\"‏‏.‏",
    "malay_translation": "Aku akan meriwayatkan kepada kamu sebuah Hadith, dan tidak ada seorang pun yang akan menceritakan kepadamu selepas ini. Aku mendengar Rasulullah ﷺ bersabda: Antara tanda-tanda Kiamat adalah (seperti berikut):\n-1. Ilmu agama akan berkurangan (dengan kematian para ulama agama).\n-2. Kejahilan agama akan berleluasa.\n-3. Zina secara terbuka akan bermaharajalela.\n-4. Bilangan wanita akan bertambah dan bilangan lelaki akan berkurangan sehingga lima puluh orang wanita akan dijaga oleh seorang lelaki."
  },
  {
    "id": 82,
    "hadith_number": 82,
    "tajuk_hadith": "Mimpi Rasulullah SAW Tentang Susu dan Ilmu",
    "perawi_melayu": "Diriwayatkan oleh Ibn `Umar:",
    "english_text": "Allah's Messenger (ﷺ) said, \"While I was sleeping, I saw that a cup full of milk was brought to me and I \ndrank my fill till I noticed (the milk) its wetness coming out of my nails. Then I gave the remaining \nmilk to `Umar Ibn Al-Khattab\" The companions of the Prophet (ﷺ) asked, \"What have you interpreted \n(about this dream)? \"O Allah's Messenger (ﷺ) ,!\" he replied, \"(It is religious) knowledge.\"",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، عَنْ حَمْزَةَ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ ابْنَ عُمَرَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَا أَنَا نَائِمٌ أُتِيتُ بِقَدَحِ لَبَنٍ، فَشَرِبْتُ حَتَّى إِنِّي لأَرَى الرِّيَّ يَخْرُجُ فِي أَظْفَارِي، ثُمَّ أَعْطَيْتُ فَضْلِي عُمَرَ بْنَ الْخَطَّابِ ‏\"‏‏.‏ قَالُوا فَمَا أَوَّلْتَهُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الْعِلْمَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Ketika saya sedang tidur, saya melihat secawan susu dibawa kepada saya dan saya minum sehingga kenyang sehingga saya melihat (susu) kebasahannya keluar dari kuku saya. Kemudian saya memberikan baki susu itu kepada `Umar Ibn Al-Khattab.\" Para sahabat Nabi SAW bertanya, \"Apakah yang telah anda tafsirkan (tentang mimpi ini)? \"Wahai Rasulullah SAW,!\" baginda menjawab, \"(Ia adalah) ilmu pengetahuan (agama).\""
  },
  {
    "id": 83,
    "hadith_number": 83,
    "tajuk_hadith": "Kelonggaran dalam Melakukan Ibadah Haji Secara Tidak Sengaja Tidak Mengikut Tertib",
    "perawi_melayu": "Diriwayatkan oleh Abdullah bin `Amr bin Al `Aas:",
    "english_text": "Allah's Messenger (ﷺ) stopped (for a while near the Jimar) at Mina during his last Hajj for the people and \nthey were asking him questions. A man came and said, \"I forgot and got my head shaved before \nslaughtering the Hadi (sacrificing animal).\" The Prophet (ﷺ) said, \"There is no harm, go and do the \nslaughtering now.\" Then another person came and said, \"I forgot and slaughtered (the camel) before \nRami (throwing of the pebbles) at the Jamra.\" The Prophet (ﷺ) said, \"Do the Rami now and there is no \nharm.\" \nThe narrator added: So on that day, when the Prophet (ﷺ) was asked about anything (as regards the \nceremonies of Hajj) performed before or after its due time, his reply was: \"Do it (now) and there is no \nharm.\"",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عِيسَى بْنِ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَقَفَ فِي حَجَّةِ الْوَدَاعِ بِمِنًى لِلنَّاسِ يَسْأَلُونَهُ، فَجَاءَهُ رَجُلٌ فَقَالَ لَمْ أَشْعُرْ فَحَلَقْتُ قَبْلَ أَنْ أَذْبَحَ‏.‏ فَقَالَ ‏\"‏ اذْبَحْ وَلاَ حَرَجَ ‏\"‏‏.‏ فَجَاءَ آخَرُ فَقَالَ لَمْ أَشْعُرْ، فَنَحَرْتُ قَبْلَ أَنْ أَرْمِيَ‏.‏ قَالَ ‏\"‏ ارْمِ وَلاَ حَرَجَ ‏\"‏‏.‏ فَمَا سُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنْ شَىْءٍ قُدِّمَ وَلاَ أُخِّرَ إِلاَّ قَالَ افْعَلْ وَلاَ حَرَجَ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) berhenti (sebentar berdekatan Jimar) di Mina semasa Haji terakhir baginda untuk orang ramai dan mereka bertanya soalan kepada baginda. Seorang lelaki datang dan berkata, \"Saya terlupa dan mencukur kepala saya sebelum menyembelih Hadi (binatang korban).\" Nabi (ﷺ) bersabda, \"Tidak mengapa, pergi dan lakukan penyembelihan sekarang.\" Kemudian seorang lagi datang dan berkata, \"Saya terlupa dan menyembelih (unta) sebelum melontar (batu kecil) di Jamrah.\" Nabi (ﷺ) bersabda, \"Lakukan lontaran sekarang dan tidak mengapa.\" Perawi menambah: Maka pada hari itu, apabila Nabi (ﷺ) ditanya tentang apa-apa (berkenaan dengan upacara Haji) yang dilakukan sebelum atau selepas waktunya, jawapan baginda adalah: \"Lakukan (sekarang) dan tidak mengapa.\""
  },
  {
    "id": 84,
    "hadith_number": 84,
    "tajuk_hadith": "Menyembelih sebelum melontar dan bercukur sebelum menyembelih dalam Haji",
    "perawi_melayu": "Diriwayatkan oleh Ibn `Abbas:",
    "english_text": "Somebody said to the Prophet (during his last Hajj), \"I did the slaughtering before doing the Rami.' \nThe Prophet (ﷺ) beckoned with his hand and said, \"There is no harm in that.\" Then another person said. \"I \ngot my head shaved before offering the sacrifice.\" The Prophet (ﷺ) beckoned with his hand saying, \"There \nis no harm in that.\"",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا وُهَيْبٌ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم سُئِلَ فِي حَجَّتِهِ فَقَالَ ذَبَحْتُ قَبْلَ أَنْ أَرْمِيَ، فَأَوْمَأَ بِيَدِهِ قَالَ وَلاَ حَرَجَ‏.‏ قَالَ حَلَقْتُ قَبْلَ أَنْ أَذْبَحَ‏.‏ فَأَوْمَأَ بِيَدِهِ وَلاَ حَرَجَ‏.‏",
    "malay_translation": "Seseorang berkata kepada Nabi (semasa Haji terakhirnya), \"Saya telah melakukan penyembelihan sebelum melakukan melontar.' Nabi (ﷺ) memberi isyarat dengan tangannya dan berkata, \"Tidak mengapa.\" Kemudian orang lain berkata, \"Saya telah mencukur kepala saya sebelum menawarkan korban.\" Nabi (ﷺ) memberi isyarat dengan tangannya sambil berkata, \"Tidak mengapa.\""
  },
  {
    "id": 85,
    "hadith_number": 85,
    "tajuk_hadith": "Ilmu Agama Ditarik, Kejahilan Berleluasa, dan Pembunuhan Meningkat",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \"(Religious) knowledge will be taken away (by the death of religious scholars) \nignorance (in religion) and afflictions will appear; and Harj will increase.\" It was asked, \"What is \nHarj, O Allah's Messenger (ﷺ)?\" He replied by beckoning with his hand indicating \"killing.\" (Fath-al-Bari \nPage 192, Vol. 1)",
    "arabic_text": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، قَالَ أَخْبَرَنَا حَنْظَلَةُ بْنُ أَبِي سُفْيَانَ، عَنْ سَالِمٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يُقْبَضُ الْعِلْمُ، وَيَظْهَرُ الْجَهْلُ وَالْفِتَنُ، وَيَكْثُرُ الْهَرْجُ ‏\"‏‏.‏ قِيلَ يَا رَسُولَ اللَّهِ وَمَا الْهَرْجُ فَقَالَ هَكَذَا بِيَدِهِ، فَحَرَّفَهَا، كَأَنَّهُ يُرِيدُ الْقَتْلَ‏.‏",
    "malay_translation": "Nabi ﷺ bersabda, \"Ilmu (agama) akan ditarik (dengan kematian ulama agama), kejahilan (dalam agama) dan fitnah akan muncul; dan Harj akan meningkat.\" Ditanya, \"Apakah Harj, wahai Rasulullah ﷺ?\" Baginda menjawab dengan memberi isyarat dengan tangannya yang menunjukkan \"pembunuhan.\""
  },
  {
    "id": 86,
    "hadith_number": 86,
    "tajuk_hadith": "Gambaran Syurga dan Neraka serta Fitnah di Kubur",
    "perawi_melayu": "Diriwayatkan oleh Asma':",
    "english_text": "I came to `Aisha while she was praying, and said to her, \"What has happened to the people?\" She \npointed out towards the sky. (I looked towards the mosque), and saw the people offering the prayer. \nAisha said, \"Subhan Allah.\" I said to her, \"Is there a sign?\" She nodded with her head meaning, \"Yes.\" \nI, too, then stood (for the prayer of eclipse) till I became (nearly) unconscious and later on I poured \nwater on my head. After the prayer, the Prophet (ﷺ) praised and glorified Allah and then said, \n\"Just now at this place I have seen what I have never seen before, including Paradise and Hell. No \ndoubt it has been inspired to me that you will be put to trials in your graves and these trials will be like \nthe trials of Masih-ad-Dajjal or nearly like it (the sub narrator is not sure which expression Asma' \nused). You will be asked, 'What do you know about this man (the Prophet (ﷺ) Muhammad)?' Then the \nfaithful believer (or Asma' said a similar word) will reply, 'He is Muhammad Allah's Messenger (ﷺ) who had \ncome to us with clear evidences and guidance and so we accepted his teachings and followed him. \nAnd he is Muhammad.' And he will repeat it thrice. Then the angels will say to him, 'Sleep in peace as \nwe have come to know that you were a faithful believer.' On the other hand, a hypocrite or a doubtful \nperson will reply, 'I do not know, but I heard the people saying something and so I said it.' (the same). \n\"",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا وُهَيْبٌ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ فَاطِمَةَ، عَنْ أَسْمَاءَ، قَالَتْ أَتَيْتُ عَائِشَةَ وَهِيَ تُصَلِّي فَقُلْتُ مَا شَأْنُ النَّاسِ فَأَشَارَتْ إِلَى السَّمَاءِ، فَإِذَا النَّاسُ قِيَامٌ، فَقَالَتْ سُبْحَانَ اللَّهِ‏.‏ قُلْتُ آيَةٌ فَأَشَارَتْ بِرَأْسِهَا، أَىْ نَعَمْ، فَقُمْتُ حَتَّى تَجَلاَّنِي الْغَشْىُ، فَجَعَلْتُ أَصُبُّ عَلَى رَأْسِي الْمَاءَ، فَحَمِدَ اللَّهَ عَزَّ وَجَلَّ النَّبِيُّ صلى الله عليه وسلم وَأَثْنَى عَلَيْهِ، ثُمَّ قَالَ ‏\n\"‏ مَا مِنْ شَىْءٍ لَمْ أَكُنْ أُرِيتُهُ إِلاَّ رَأَيْتُهُ فِي مَقَامِي حَتَّى الْجَنَّةَ وَالنَّارَ، فَأُوحِيَ إِلَىَّ أَنَّكُمْ تُفْتَنُونَ فِي قُبُورِكُمْ، مِثْلَ ـ أَوْ قَرِيبًا لاَ أَدْرِي أَىَّ ذَلِكَ قَالَتْ أَسْمَاءُ ـ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، يُقَالُ مَا عِلْمُكَ بِهَذَا الرَّجُلِ فَأَمَّا الْمُؤْمِنُ ـ أَوِ الْمُوقِنُ لاَ أَدْرِي بِأَيِّهِمَا قَالَتْ أَسْمَاءُ ـ فَيَقُولُ هُوَ مُحَمَّدٌ رَسُولُ اللَّهِ جَاءَنَا بِالْبَيِّنَاتِ وَالْهُدَى، فَأَجَبْنَا وَاتَّبَعْنَا، هُوَ مُحَمَّدٌ‏.‏ ثَلاَثًا، فَيُقَالُ نَمْ صَالِحًا، قَدْ عَلِمْنَا إِنْ كُنْتَ لَمُوقِنًا بِهِ، وَأَمَّا الْمُنَافِقُ ـ أَوِ الْمُرْتَابُ لاَ أَدْرِي أَىَّ ذَلِكَ قَالَتْ أَسْمَاءُ ـ فَيَقُولُ لاَ أَدْرِي، سَمِعْتُ النَّاسَ يَقُولُونَ شَيْئًا فَقُلْتُهُ ‏\"‏‏.‏",
    "malay_translation": "Saya datang kepada Aisyah ketika dia sedang solat, lalu saya bertanya kepadanya, \"Apakah yang terjadi kepada orang ramai?\" Dia menunjuk ke arah langit. (Saya melihat ke arah masjid), dan melihat orang ramai sedang mengerjakan solat. Aisyah berkata, \"Subhan Allah.\" Saya bertanya kepadanya, \"Adakah tanda?\" Dia mengangguk kepalanya bermaksud, \"Ya.\" Saya juga kemudian berdiri (untuk solat gerhana) sehingga saya hampir pengsan, dan kemudian saya menuangkan air ke kepala saya. Selepas solat, Nabi ﷺ memuji dan mengagungkan Allah, kemudian bersabda, \"Baru sahaja di tempat ini saya telah melihat apa yang belum pernah saya lihat sebelum ini, termasuk Syurga dan Neraka. Sesungguhnya telah diwahyukan kepada saya bahawa kamu akan diuji di dalam kubur kamu, dan ujian-ujian ini adalah seperti ujian al-Masih ad-Dajjal atau hampir seperti itu (periwayat tidak pasti ungkapan mana yang digunakan oleh Asma'). Kamu akan ditanya, 'Apakah yang kamu tahu tentang lelaki ini (Nabi Muhammad ﷺ)?' Kemudian orang mukmin yang setia (atau Asma' menyebut perkataan yang serupa) akan menjawab, 'Dia adalah Muhammad Rasulullah ﷺ yang telah datang kepada kami dengan bukti-bukti yang jelas dan petunjuk, maka kami menerima ajarannya dan mengikutinya. Dan dia adalah Muhammad.' Dan dia akan mengulanginya tiga kali. Kemudian para malaikat akan berkata kepadanya, 'Tidurlah dengan tenang, kerana kami telah mengetahui bahawa kamu adalah seorang mukmin yang setia.' Sebaliknya, seorang munafik atau orang yang ragu-ragu akan menjawab, 'Saya tidak tahu, tetapi saya mendengar orang ramai mengatakan sesuatu dan saya pun mengatakannya.' (yang sama)."
  },
  {
    "id": 87,
    "hadith_number": 87,
    "tajuk_hadith": "Kedatangan Delegasi Abdul Qais dan Perintah Nabi Muhammad SAW tentang Keimanan dan Larangan",
    "perawi_melayu": "Diriwayatkan oleh Abu Jamra:",
    "english_text": "I was an interpreter between the people and Ibn `Abbas. Once Ibn `Abbas said that a delegation of the \ntribe of `Abdul Qais came to the Prophet (ﷺ) who asked them, \"Who are the people (i.e. you)? (Or) who \nare the delegates?\" They replied, \"We are from the tribe of Rabi`a.\" Then the Prophet (ﷺ) said to them, \n\"Welcome, O people (or said, \"O delegation (of `Abdul Qais).\") Neither will you have disgrace nor \nwill you regret.\" They said, \"We have come to you from a distant place and there is the tribe of the \ninfidels of Mudar intervening between you and us and we cannot come to you except in the sacred \nmonth. So please order us to do something good (religious deeds) and that we may also inform our \npeople whom we have left behind (at home) and that we may enter Paradise (by acting on them.)\" The \nProphet ordered them to do four things, and forbade them from four things. He ordered them to \nbelieve in Allah Alone, the Honorable the Majestic and said to them, \"Do you know what is meant by \nbelieving in Allah Alone?\" They replied, \"Allah and His Apostle know better.\" Thereupon the Prophet (ﷺ) \nsaid, \"(That means to testify that none has the right to be worshipped but Allah and that Muhammad is \nHis Apostle, to offer prayers perfectly, to pay Zakat, to observe fasts during the month of Ramadan, \n(and) to pay Al-Khumus (one fifth of the booty to be given in Allah's cause).\" Then he forbade them \nfour things, namely Ad-Dubba.' Hantam, Muzaffat (and) An-Naqir or Muqaiyar (These were the \nnames of pots in which alcoholic drinks used to be prepared). The Prophet (ﷺ) further said, \"Memorize \nthem (these instructions) and tell them to the people whom you have left behind.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا غُنْدَرٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي جَمْرَةَ، قَالَ كُنْتُ أُتَرْجِمُ بَيْنَ ابْنِ عَبَّاسٍ وَبَيْنَ النَّاسِ فَقَالَ إِنَّ وَفْدَ عَبْدِ الْقَيْسِ أَتَوُا النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَنِ الْوَفْدُ ـ أَوْ مَنِ الْقَوْمُ ‏\"‏‏.‏ قَالُوا رَبِيعَةُ‏.‏ فَقَالَ ‏\"‏ مَرْحَبًا بِالْقَوْمِ ـ أَوْ بِالْوَفْدِ ـ غَيْرَ خَزَايَا وَلاَ نَدَامَى ‏\"‏‏.‏ قَالُوا إِنَّا نَأْتِيكَ مِنْ شُقَّةٍ بَعِيدَةٍ، وَبَيْنَنَا وَبَيْنَكَ هَذَا الْحَىُّ مِنْ كُفَّارِ مُضَرَ، وَلاَ نَسْتَطِيعُ أَنْ نَأْتِيَكَ إِلاَّ فِي شَهْرٍ حَرَامٍ فَمُرْنَا بِأَمْرٍ نُخْبِرْ بِهِ مَنْ وَرَاءَنَا، نَدْخُلُ بِهِ الْجَنَّةَ‏.‏ فَأَمَرَهُمْ بِأَرْبَعٍ، وَنَهَاهُمْ عَنْ أَرْبَعٍ أَمَرَهُمْ بِالإِيمَانِ بِاللَّهِ عَزَّ وَجَلَّ وَحْدَهُ‏.‏ قَالَ ‏\"‏ هَلْ تَدْرُونَ مَا الإِيمَانُ بِاللَّهِ وَحْدَهُ ‏\"‏‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ شَهَادَةُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَإِقَامُ الصَّلاَةِ، وَإِيتَاءُ الزَّكَاةِ، وَصَوْمُ رَمَضَانَ، وَتُعْطُوا الْخُمُسَ مِنَ الْمَغْنَمِ ‏\"‏‏.‏ وَنَهَاهُمْ عَنِ الدُّبَّاءِ وَالْحَنْتَمِ وَالْمُزَفَّتِ‏.‏ قَالَ شُعْبَةُ رُبَّمَا قَالَ النَّقِيرِ، وَرُبَّمَا قَالَ الْمُقَيَّرِ‏.‏ قَالَ ‏\"‏ احْفَظُوهُ وَأَخْبِرُوهُ مَنْ وَرَاءَكُمْ ‏\"‏‏.‏",
    "malay_translation": "Saya adalah seorang penterjemah antara orang ramai dan Ibn `Abbas. Suatu ketika Ibn `Abbas berkata bahawa delegasi daripada suku `Abdul Qais datang kepada Nabi (ﷺ) yang bertanya kepada mereka, \"Siapakah orang-orang ini (iaitu kamu)? (Atau) siapakah para delegasi ini?\" Mereka menjawab, \"Kami dari suku Rabi`a.\" Kemudian Nabi (ﷺ) bersabda kepada mereka, \"Selamat datang, wahai orang-orang (atau bersabda, \"Wahai delegasi (dari `Abdul Qais).\") Kamu tidak akan mendapat kehinaan dan tidak akan menyesal.\" Mereka berkata, \"Kami datang kepada kamu dari tempat yang jauh, dan antara kami dan kamu terdapat suku kafir Mudar, dan kami tidak dapat datang kepada kamu kecuali pada bulan suci. Jadi, perintahkanlah kami untuk melakukan sesuatu yang baik (amalan agama) dan supaya kami juga dapat memberitahu orang-orang kami yang telah kami tinggalkan (di rumah) dan supaya kami dapat memasuki Syurga (dengan mengamalkannya).\" Nabi memerintahkan mereka untuk melakukan empat perkara, dan melarang mereka daripada empat perkara. Baginda memerintahkan mereka untuk beriman kepada Allah sahaja, Yang Maha Mulia lagi Maha Agung dan bersabda kepada mereka, \"Adakah kamu tahu apa yang dimaksudkan dengan beriman kepada Allah sahaja?\" Mereka menjawab, \"Allah dan Rasul-Nya lebih mengetahui.\" Lalu Nabi (ﷺ) bersabda, \"(Iaitu untuk bersaksi bahawa tiada Tuhan yang berhak disembah melainkan Allah dan bahawa Muhammad adalah Rasul-Nya, untuk mendirikan solat dengan sempurna, untuk membayar Zakat, untuk berpuasa pada bulan Ramadhan, (dan) untuk membayar Al-Khumus (satu perlima daripada harta rampasan perang untuk diberikan untuk jalan Allah).\" Kemudian baginda melarang mereka empat perkara, iaitu Ad-Dubba', Hantam, Muzaffat (dan) An-Naqir atau Muqaiyar (Ini adalah nama-nama bekas di mana minuman beralkohol biasa disediakan). Nabi (ﷺ) selanjutnya bersabda, \"Hafazkanlah mereka (arahan ini) dan beritahu mereka kepada orang-orang yang telah kamu tinggalkan di belakang.\""
  },
  {
    "id": 88,
    "hadith_number": 88,
    "tajuk_hadith": "Perceraian Akibat Persusuan Susuan",
    "perawi_melayu": "Diriwayatkan oleh `Abdullah bin Abi Mulaika:",
    "english_text": "`Uqba bin Al-Harith said that he had married the daughter of Abi Ihab bin `Aziz. Later on a woman \ncame to him and said, \"I have suckled (nursed) `Uqba and the woman whom he married (his wife) at \nmy breast.\" `Uqba said to her, \"Neither I knew that you have suckled (nursed) me nor did you tell \nme.\" Then he rode over to see Allah's Messenger (ﷺ) at Medina, and asked him about it. Allah's Messenger (ﷺ) said, \n\"How can you keep her as a wife when it has been said (that she is your foster-sister)?\" Then `Uqba \ndivorced her, and she married another man.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا عُمَرُ بْنُ سَعِيدِ بْنِ أَبِي حُسَيْنٍ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي مُلَيْكَةَ، عَنْ عُقْبَةَ بْنِ الْحَارِثِ، أَنَّهُ تَزَوَّجَ ابْنَةً لأَبِي إِهَابِ بْنِ عَزِيزٍ، فَأَتَتْهُ امْرَأَةٌ فَقَالَتْ إِنِّي قَدْ أَرْضَعْتُ عُقْبَةَ وَالَّتِي تَزَوَّجَ بِهَا‏.‏ فَقَالَ لَهَا عُقْبَةُ مَا أَعْلَمُ أَنَّكِ أَرْضَعْتِنِي وَلاَ أَخْبَرْتِنِي‏.‏ فَرَكِبَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِالْمَدِينَةِ فَسَأَلَهُ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ كَيْفَ وَقَدْ قِيلَ ‏\"‏‏.‏ فَفَارَقَهَا عُقْبَةُ، وَنَكَحَتْ زَوْجًا غَيْرَهُ‏.‏",
    "malay_translation": "`Uqba bin Al-Harith meriwayatkan bahawa dia telah menikahi puteri Abi Ihab bin `Aziz. Kemudian seorang wanita datang kepadanya dan berkata, \"Aku telah menyusukan `Uqba dan wanita yang dinikahinya (isterinya) di payudaraku.\" `Uqba berkata kepadanya, \"Aku tidak tahu bahawa engkau telah menyusukan aku dan engkau tidak memberitahuku.\" Kemudian dia menunggang kenderaan untuk menemui Rasulullah (ﷺ) di Madinah dan bertanya kepadanya tentang hal itu. Rasulullah (ﷺ) bersabda, \"Bagaimana kamu boleh mengekalkannya sebagai isteri sedangkan telah dikatakan (bahawa dia adalah saudara sesusuanmu)?\" Kemudian `Uqba menceraikannya, dan dia menikahi lelaki lain."
  },
  {
    "id": 89,
    "hadith_number": 89,
    "tajuk_hadith": "Umar Mendengar Berita Perceraian Nabi (ﷺ) dengan Isteri-isterinya",
    "perawi_melayu": "Diriwayatkan oleh `Umar:",
    "english_text": "My Ansari neighbor from Bani Umaiya bin Zaid who used to live at `Awali Al-Medina and used to \nvisit the Prophet (ﷺ) by turns. He used to go one day and I another day. When I went I used to bring the \nnews of that day regarding the Divine Inspiration and other things, and when he went, he used to do \nthe same for me. Once my Ansari friend, in his turn (on returning from the Prophet), knocked \nviolently at my door and asked if I was there.\" I became horrified and came out to him. He said, \n\"Today a great thing has happened.\" I then went to Hafsa and saw her weeping. I asked her, \"Did \nAllah's Messenger (ﷺ) divorce you all?\" She replied, \"I do not know.\" Then, I entered upon the Prophet (ﷺ) and \nsaid while standing, \"Have you divorced your wives?\" The Prophet (ﷺ) replied in the negative. On that I \nsaid, \"Allahu-Akbar (Allah is Greater).\" (See Hadith No. 119, Vol. 3 for details)",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، ح قَالَ أَبُو عَبْدِ اللَّهِ وَقَالَ ابْنُ وَهْبٍ أَخْبَرَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي ثَوْرٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، عَنْ عُمَرَ، قَالَ كُنْتُ أَنَا وَجَارٌ، لِي مِنَ الأَنْصَارِ فِي بَنِي أُمَيَّةَ بْنِ زَيْدٍ، وَهْىَ مِنْ عَوَالِي الْمَدِينَةِ، وَكُنَّا نَتَنَاوَبُ النُّزُولَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم يَنْزِلُ يَوْمًا وَأَنْزِلُ يَوْمًا، فَإِذَا نَزَلْتُ جِئْتُهُ بِخَبَرِ ذَلِكَ الْيَوْمِ مِنَ الْوَحْىِ وَغَيْرِهِ، وَإِذَا نَزَلَ فَعَلَ مِثْلَ ذَلِكَ، فَنَزَلَ صَاحِبِي الأَنْصَارِيُّ يَوْمَ نَوْبَتِهِ، فَضَرَبَ بَابِي ضَرْبًا شَدِيدًا‏.‏ فَقَالَ أَثَمَّ هُوَ فَفَزِعْتُ فَخَرَجْتُ إِلَيْهِ فَقَالَ قَدْ حَدَثَ أَمْرٌ عَظِيمٌ‏.‏ قَالَ فَدَخَلْتُ عَلَى حَفْصَةَ فَإِذَا هِيَ تَبْكِي فَقُلْتُ طَلَّقَكُنَّ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَتْ لاَ أَدْرِي‏.‏ ثُمَّ دَخَلْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقُلْتُ وَأَنَا قَائِمٌ أَطَلَّقْتَ نِسَاءَكَ قَالَ ‏\n\"‏ لاَ ‏\"‏‏.‏ فَقُلْتُ اللَّهُ أَكْبَرُ‏.‏",
    "malay_translation": "Jiran saya dari kalangan Ansar daripada Bani Umaiya bin Zaid yang tinggal di `Awali Al-Madinah biasanya melawat Nabi (ﷺ) secara bergilir. Dia pergi satu hari dan saya satu hari yang lain. Apabila saya pergi, saya akan membawa berita hari itu mengenai Wahyu Ilahi dan perkara-perkara lain, dan apabila dia pergi, dia akan melakukan perkara yang sama untuk saya. Pada suatu hari, rakan Ansar saya, pada gilirannya (setelah kembali dari Nabi), mengetuk pintu saya dengan kuat dan bertanya adakah saya di sana. Saya menjadi terkejut dan keluar menemuinya. Dia berkata, \"Hari ini perkara besar telah berlaku.\" Kemudian, saya pergi kepada Hafsa dan melihatnya menangis. Saya bertanya kepadanya, \"Adakah Rasulullah (ﷺ) menceraikan kamu semua?\" Dia menjawab, \"Saya tidak tahu.\" Kemudian, saya masuk menemui Nabi (ﷺ) dan berkata sambil berdiri, \"Adakah anda telah menceraikan isteri-isteri anda?\" Nabi (ﷺ) menjawab dengan nada negatif. Lalu saya berkata, \"Allahu-Akbar (Allah Maha Besar).\" (Lihat Hadis No. 119, Jil. 3 untuk butiran)"
  },
  {
    "id": 90,
    "hadith_number": 90,
    "tajuk_hadith": "Larangan Memanjangkan Solat Berjemaah Secara Berlebihan",
    "perawi_melayu": "Diriwayatkan oleh Abu Mas'ud Al-Ansari:",
    "english_text": "Once a man said to Allah's Messenger (ﷺ) \"O Allah's Messenger (ﷺ)! I may not attend the (compulsory \ncongregational) prayer because so and so (the Imam) prolongs the prayer when he leads us for it. The \nnarrator added: \"I never saw the Prophet (ﷺ) more furious in giving advice than he was on that day. The \nProphet said, \"O people! Some of you make others dislike good deeds (the prayers). So whoever leads \nthe people in prayer should shorten it because among them there are the sick the weak and the needy \n(having some jobs to do).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ أَخْبَرَنَا سُفْيَانُ، عَنِ ابْنِ أَبِي خَالِدٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ، قَالَ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ، لاَ أَكَادُ أُدْرِكُ الصَّلاَةَ مِمَّا يُطَوِّلُ بِنَا فُلاَنٌ، فَمَا رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم فِي مَوْعِظَةٍ أَشَدَّ غَضَبًا مِنْ يَوْمِئِذٍ فَقَالَ ‏\n\"‏ أَيُّهَا النَّاسُ، إِنَّكُمْ مُنَفِّرُونَ، فَمَنْ صَلَّى بِالنَّاسِ فَلْيُخَفِّفْ، فَإِنَّ فِيهِمُ الْمَرِيضَ وَالضَّعِيفَ وَذَا الْحَاجَةِ ‏\"‏‏.‏",
    "malay_translation": "Seorang lelaki berkata kepada Rasulullah ﷺ, \"Wahai Rasulullah ﷺ! Saya mungkin tidak dapat menghadiri solat (berjemaah wajib) kerana si fulan (Imam) memanjangkan solat ketika dia mengimamkan kami. Perawi menambah: \"Saya tidak pernah melihat Nabi ﷺ begitu marah dalam memberi nasihat seperti pada hari itu. Nabi ﷺ bersabda, \"Wahai manusia! Sesetengah kamu membuat orang lain tidak menyukai amal soleh (solat). Oleh itu, sesiapa yang mengimamkan solat, hendaklah dia memendekkannya kerana di antara mereka ada yang sakit, yang lemah dan yang memerlukan (mempunyai urusan untuk dilakukan)."
  },
  {
    "id": 91,
    "hadith_number": 91,
    "tajuk_hadith": "Hukum Barang Tercicir, Unta Sesat, dan Kambing Sesat",
    "perawi_melayu": "Diriwayatkan oleh Zaid bin Khalid Al-Juhani:",
    "english_text": "A man asked the Prophet (ﷺ) about the picking up of a \"Luqata\" (fallen lost thing). The Prophet (ﷺ) replied, \n\"Recognize and remember its tying material and its container, and make public announcement (about \nit) for one year, then utilize it but give it to its owner if he comes.\" Then the person asked about the \nlost camel. On that, the Prophet (ﷺ) got angry and his cheeks or his Face became red and he said, \"You \nhave no concern with it as it has its water container, and its feet and it will reach water, and eat (the \nleaves) of trees till its owner finds it.\" The man then asked about the lost sheep. The Prophet (ﷺ) replied, \n\"It is either for you, for your brother (another person) or for the wolf.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا أَبُو عَامِرٍ، قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ الْمَدِينِيُّ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ يَزِيدَ، مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم سَأَلَهُ رَجُلٌ عَنِ اللُّقَطَةِ فَقَالَ ‏\"‏ اعْرِفْ وِكَاءَهَا ـ أَوْ قَالَ وِعَاءَهَا ـ وَعِفَاصَهَا، ثُمَّ عَرِّفْهَا سَنَةً، ثُمَّ اسْتَمْتِعْ بِهَا، فَإِنْ جَاءَ رَبُّهَا فَأَدِّهَا إِلَيْهِ ‏\"‏‏.‏ قَالَ فَضَالَّةُ الإِبِلِ فَغَضِبَ حَتَّى احْمَرَّتْ وَجْنَتَاهُ ـ أَوْ قَالَ احْمَرَّ وَجْهُهُ ـ فَقَالَ ‏\"‏ وَمَا لَكَ وَلَهَا مَعَهَا سِقَاؤُهَا وَحِذَاؤُهَا، تَرِدُ الْمَاءَ، وَتَرْعَى الشَّجَرَ، فَذَرْهَا حَتَّى يَلْقَاهَا رَبُّهَا ‏\"‏‏.‏ قَالَ فَضَالَّةُ الْغَنَمِ قَالَ ‏\"‏ لَكَ أَوْ لأَخِيكَ أَوْ لِلذِّئْبِ ‏\"‏‏.‏",
    "malay_translation": "Seorang lelaki bertanya kepada Nabi (ﷺ) tentang拾撿 \"Luqata\" (barang tercicir yang dijumpai). Nabi (ﷺ) menjawab, \"Kenali dan ingat bahan pengikat dan bekasnya, dan buat pengumuman awam (tentangnya) selama setahun, kemudian manfaatkanlah ia, tetapi berikan kepada pemiliknya jika dia datang.\" Kemudian orang itu bertanya tentang unta yang sesat. Mendengar itu, Nabi (ﷺ) marah sehingga pipi atau wajahnya menjadi merah dan baginda bersabda, \"Engkau tidak perlu risau mengenainya kerana ia mempunyai bekas air dan kakinya dan ia akan sampai ke air, dan makan (daun) pokok sehingga pemiliknya menemuinya.\" Lelaki itu kemudian bertanya tentang kambing yang sesat. Nabi (ﷺ) menjawab, \"Ia adalah untukmu, untuk saudaramu (orang lain) atau untuk serigala.\""
  },
  {
    "id": 92,
    "hadith_number": 92,
    "tajuk_hadith": "Nabi ﷺ Menjawab Pertanyaan dengan Marah Ketika Diasak",
    "perawi_melayu": "Diriwayatkan oleh Abu Musa:",
    "english_text": "The Prophet (ﷺ) was asked about things which he did not like, but when the questioners insisted, the \nProphet got angry. He then said to the people, \"Ask me anything you like.\" A man asked, \"Who is my \nfather?\" The Prophet (ﷺ) replied, \"Your father is Hudhafa.\" Then another man got up and said, \"Who is \nmy father, O Allah's Messenger (ﷺ) ?\" He replied, \"Your father is Salim, Maula (the freed slave) of Shaiba.\" \nSo when `Umar saw that (the anger) on the face of the Prophet (ﷺ) he said, \"O Allah's Messenger (ﷺ)! We repent \nto Allah (Our offending you).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ سُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنْ أَشْيَاءَ كَرِهَهَا، فَلَمَّا أُكْثِرَ عَلَيْهِ غَضِبَ، ثُمَّ قَالَ لِلنَّاسِ ‏\"‏ سَلُونِي عَمَّا شِئْتُمْ ‏\"‏‏.‏ قَالَ رَجُلٌ مَنْ أَبِي قَالَ ‏\"‏ أَبُوكَ حُذَافَةُ ‏\"‏‏.‏ فَقَامَ آخَرُ فَقَالَ مَنْ أَبِي يَا رَسُولَ اللَّهِ فَقَالَ ‏\"‏ أَبُوكَ سَالِمٌ مَوْلَى شَيْبَةَ ‏\"‏‏.‏ فَلَمَّا رَأَى عُمَرُ مَا فِي وَجْهِهِ قَالَ يَا رَسُولَ اللَّهِ، إِنَّا نَتُوبُ إِلَى اللَّهِ عَزَّ وَجَلَّ‏.‏",
    "malay_translation": "Nabi ﷺ ditanya tentang perkara-perkara yang baginda tidak sukai, tetapi apabila para penanya mendesak, Nabi ﷺ menjadi marah. Kemudian baginda bersabda kepada orang ramai, \"Tanyalah aku apa sahaja yang kamu suka.\" Seorang lelaki bertanya, \"Siapakah ayahku?\" Nabi ﷺ menjawab, \"Ayahmu adalah Hudhafa.\" Kemudian seorang lelaki lain bangun dan berkata, \"Siapakah ayahku, wahai Rasulullah ﷺ?\" Baginda menjawab, \"Ayahmu adalah Salim, Maula (bekas hamba) dari Shaiba.\" Maka apabila Umar melihat (kemarahan) di wajah Nabi ﷺ, beliau berkata, \"Wahai Rasulullah ﷺ! Kami bertaubat kepada Allah (atas kesalahan kami terhadapmu).\""
  },
  {
    "id": 93,
    "hadith_number": 93,
    "tajuk_hadith": "Pertanyaan Tentang Bapa dan Keredhaan dengan Allah, Islam, dan Nabi Muhammad ﷺ",
    "perawi_melayu": "Diriwayatkan oleh Anas bin Malik:",
    "english_text": "One day Allah's Messenger (ﷺ) came out (before the people) and `Abdullah bin Hudhafa stood up and asked \n(him) \"Who is my father?\" The Prophet (ﷺ) replied, \"Your father is Hudhafa.\" The Prophet (ﷺ) told them \nrepeatedly (in anger) to ask him anything they liked. `Umar knelt down before the Prophet (ﷺ) and said \nthrice, \"We accept Allah as (our) Lord and Islam as (our) religion and Muhammad as (our) Prophet.\" \nAfter that the Prophet (ﷺ) became silent.",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ، فَقَامَ عَبْدُ اللَّهِ بْنُ حُذَافَةَ فَقَالَ مَنْ أَبِي فَقَالَ ‏\"‏ أَبُوكَ حُذَافَةُ ‏\"‏‏.‏ ثُمَّ أَكْثَرَ أَنْ يَقُولَ ‏\"‏ سَلُونِي ‏\"‏‏.‏ فَبَرَكَ عُمَرُ عَلَى رُكْبَتَيْهِ فَقَالَ رَضِينَا بِاللَّهِ رَبًّا، وَبِالإِسْلاَمِ دِينًا، وَبِمُحَمَّدٍ صلى الله عليه وسلم نَبِيًّا، فَسَكَتَ‏.‏",
    "malay_translation": "Pada suatu hari, Rasulullah ﷺ keluar (di hadapan orang ramai) dan Abdullah bin Hudzafah berdiri dan bertanya (kepada baginda), \"Siapakah bapa saya?\" Nabi ﷺ menjawab, \"Bapa kamu adalah Hudzafah.\" Nabi ﷺ kemudiannya berulang kali (dalam keadaan marah) menyuruh mereka bertanya apa sahaja yang mereka suka. Umar kemudian berlutut di hadapan Nabi ﷺ dan berkata sebanyak tiga kali, \"Kami redha Allah sebagai Tuhan kami, Islam sebagai agama kami, dan Muhammad sebagai Nabi kami.\" Selepas itu, Nabi ﷺ berdiam diri."
  },
  {
    "id": 94,
    "hadith_number": 94,
    "tajuk_hadith": "Adab Meminta Izin Masuk dan Mengulangi Perkataan",
    "perawi_melayu": "Diriwayatkan oleh Anas:",
    "english_text": "Whenever the Prophet (ﷺ) asked permission to enter, he knocked the door thrice with greeting and \nwhenever he spoke a sentence (said a thing) he used to repeat it thrice. (See Hadith No. 261, Vol. 8).",
    "arabic_text": "حَدَّثَنَا عَبْدَةُ، قَالَ حَدَّثَنَا عَبْدُ الصَّمَدِ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا ثُمَامَةُ بْنُ عَبْدِ اللَّهِ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ إِذَا سَلَّمَ سَلَّمَ ثَلاَثًا، وَإِذَا تَكَلَّمَ بِكَلِمَةٍ أَعَادَهَا ثَلاَثًا‏.‏",
    "malay_translation": "Apabila Nabi ﷺ meminta izin untuk masuk, baginda mengetuk pintu sebanyak tiga kali dengan memberi salam, dan apabila baginda mengucapkan sesuatu perkataan, baginda akan mengulanginya sebanyak tiga kali. (Rujuk Hadith No. 261, Jilid 8)."
  },
  {
    "id": 95,
    "hadith_number": 95,
    "tajuk_hadith": "Nabi ﷺ Mengulangi Perkataan dan Memberi Salam Tiga Kali",
    "perawi_melayu": "Diriwayatkan oleh Anas:",
    "english_text": "Whenever the Prophet (ﷺ) spoke a sentence (said a thing), he used to repeat it thrice so that the people \ncould understand it properly from him and whenever he asked permission to enter, (he knocked the \ndoor) thrice with greeting.",
    "arabic_text": "حَدَّثَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا عَبْدُ الصَّمَدِ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا ثُمَامَةُ بْنُ عَبْدِ اللَّهِ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ إِذَا تَكَلَّمَ بِكَلِمَةٍ أَعَادَهَا ثَلاَثًا حَتَّى تُفْهَمَ عَنْهُ، وَإِذَا أَتَى عَلَى قَوْمٍ فَسَلَّمَ عَلَيْهِمْ سَلَّمَ عَلَيْهِمْ ثَلاَثًا‏.‏",
    "malay_translation": "Apabila Nabi ﷺ bertutur sesuatu perkataan, baginda akan mengulanginya sebanyak tiga kali supaya orang ramai dapat memahaminya dengan betul. Dan apabila baginda meminta izin untuk masuk, baginda (mengetuk pintu) tiga kali dengan memberi salam."
  },
  {
    "id": 96,
    "hadith_number": 96,
    "tajuk_hadith": "Ancaman Neraka bagi Tumit yang Tidak Dibasuh Sempurna semasa Wuduk",
    "perawi_melayu": "`Abdullah bin `Amr meriwayatkan:",
    "english_text": "Once Allah's Messenger (ﷺ) remained behind us in a journey. He joined us while we were performing \nablution for the `Asr prayer which was over-due. We were just passing wet hands over our feet (not \nwashing them properly) so the Prophet (ﷺ) addressed us in a loud voice and said twice or thrice, \"Save \nyour heels from the fire.\"",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ يُوسُفَ بْنِ مَاهَكَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ تَخَلَّفَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي سَفَرٍ سَافَرْنَاهُ فَأَدْرَكَنَا وَقَدْ أَرْهَقْنَا الصَّلاَةَ صَلاَةَ الْعَصْرِ وَنَحْنُ نَتَوَضَّأُ، فَجَعَلْنَا نَمْسَحُ عَلَى أَرْجُلِنَا، فَنَادَى بِأَعْلَى صَوْتِهِ ‏\n\"‏ وَيْلٌ لِلأَعْقَابِ مِنَ النَّارِ ‏\"‏‏.‏ مَرَّتَيْنِ أَوْ ثَلاَثًا‏.‏",
    "malay_translation": "Pernah Rasulullah (ﷺ) ketinggalan di belakang kami dalam suatu perjalanan. Baginda menyertai kami ketika kami sedang berwuduk untuk solat Asar yang sudah hampir habis waktunya. Kami hanya menyapu air ke atas kaki kami (tidak membasuhnya dengan sempurna), maka Nabi (ﷺ) bersabda dengan suara yang kuat, dua atau tiga kali, \"Selamatkan tumit kamu dari api neraka.\""
  },
  {
    "id": 97,
    "hadith_number": 97,
    "tajuk_hadith": "Ganjaran Berganda Bagi Tiga Golongan",
    "perawi_melayu": "Diriwayatkan daripada bapa Abu Burda:",
    "english_text": "Allah's Messenger (ﷺ) said \"Three persons will have a double reward:\n\n\n     1. A Person from the people of the scriptures who believed in his \n     prophet (Jesus or Moses) and then believed in the Prophet (ﷺ) Muhammad (i \n     .e. has embraced Islam).\n\n\n     2. A slave who discharges his duties to Allah and his master.\n\n\n     3. A master of a woman-slave who teaches her good manners and educates\n     her in the best possible way (the religion) and manumits her and then \n     marries her.\"",
    "arabic_text": "أَخْبَرَنَا مُحَمَّدٌ ـ هُوَ ابْنُ سَلاَمٍ ـ حَدَّثَنَا الْمُحَارِبِيُّ، قَالَ حَدَّثَنَا صَالِحُ بْنُ حَيَّانَ، قَالَ قَالَ عَامِرٌ الشَّعْبِيُّ حَدَّثَنِي أَبُو بُرْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ ثَلاَثَةٌ لَهُمْ أَجْرَانِ رَجُلٌ مِنْ أَهْلِ الْكِتَابِ آمَنَ بِنَبِيِّهِ، وَآمَنَ بِمُحَمَّدٍ صلى الله عليه وسلم وَالْعَبْدُ الْمَمْلُوكُ إِذَا أَدَّى حَقَّ اللَّهِ وَحَقَّ مَوَالِيهِ، وَرَجُلٌ كَانَتْ عِنْدَهُ أَمَةٌ ‏{‏يَطَؤُهَا‏}‏ فَأَدَّبَهَا، فَأَحْسَنَ تَأْدِيبَهَا، وَعَلَّمَهَا فَأَحْسَنَ تَعْلِيمَهَا، ثُمَّ أَعْتَقَهَا فَتَزَوَّجَهَا، فَلَهُ أَجْرَانِ ‏\"‏‏.‏\nثُمَّ قَالَ عَامِرٌ أَعْطَيْنَاكَهَا بِغَيْرِ شَىْءٍ، قَدْ كَانَ يُرْكَبُ فِيمَا دُونَهَا إِلَى الْمَدِينَةِ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda, \"Tiga golongan orang akan mendapat ganjaran berganda:\n\n1.  Seseorang daripada Ahli Kitab yang beriman kepada nabinya (Isa atau Musa) dan kemudian beriman kepada Nabi (ﷺ) Muhammad (iaitu telah memeluk Islam).\n\n2.  Seorang hamba yang melaksanakan kewajibannya kepada Allah dan tuannya.\n\n3.  Seorang tuan kepada hamba perempuan yang mengajarnya adab yang baik dan mendidiknya dengan cara yang terbaik (agama) dan memerdekakannya kemudian menikahinya.\""
  },
  {
    "id": 98,
    "hadith_number": 98,
    "tajuk_hadith": "Rasulullah ﷺ Menasihati Wanita untuk Bersedekah",
    "perawi_melayu": "Diriwayatkan oleh Ibn 'Abbas:",
    "english_text": "Once Allah's Messenger (ﷺ) came out while Bilal was accompanying him. He \n     went towards the women thinking that they had not heard him (i.e. his \n     sermon). So he preached them and ordered them to pay alms. (Hearing \n     that) the women started giving alms; some donated their ear-rings, \n     some gave their rings and Bilal was collecting them in the corner of \n     his garment.",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَيُّوبَ، قَالَ سَمِعْتُ عَطَاءً، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، قَالَ أَشْهَدُ عَلَى النَّبِيِّ صلى الله عليه وسلم ـ أَوْ قَالَ عَطَاءٌ أَشْهَدُ عَلَى ابْنِ عَبَّاسٍ ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ وَمَعَهُ بِلاَلٌ، فَظَنَّ أَنَّهُ لَمْ يُسْمِعِ النِّسَاءَ فَوَعَظَهُنَّ، وَأَمَرَهُنَّ بِالصَّدَقَةِ، فَجَعَلَتِ الْمَرْأَةُ تُلْقِي الْقُرْطَ وَالْخَاتَمَ، وَبِلاَلٌ يَأْخُذُ فِي طَرَفِ ثَوْبِهِ‏.‏\nوَقَالَ إِسْمَاعِيلُ عَنْ أَيُّوبَ عَنْ عَطَاءٍ وَقَالَ عَنِ ابْنِ عَبَّاسٍ أَشْهَدُ عَلَى النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Pada suatu hari, Rasulullah ﷺ keluar bersama Bilal. Baginda pergi ke arah kaum wanita kerana menyangka mereka belum mendengar baginda (iaitu khutbah baginda). Lalu baginda menasihati mereka dan memerintahkan mereka untuk membayar sedekah. (Setelah mendengar itu), para wanita mula memberikan sedekah; ada yang menyumbangkan anting-anting mereka, ada yang memberikan cincin mereka, dan Bilal mengumpulkan sedekah tersebut di hujung pakaiannya."
  },
  {
    "id": 99,
    "hadith_number": 99,
    "tajuk_hadith": "Orang yang Paling Beruntung Mendapat Syafaat Nabi Muhammad SAW pada Hari Kiamat",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "I said: \"O Allah's Messenger (ﷺ)! Who will be the luckiest person, who will gain your intercession on the \nDay of Resurrection?\" Allah's Messenger (ﷺ) said: O Abu Huraira! \"I have thought that none will ask me \nabout it before you as I know your longing for the (learning of) Hadiths. The luckiest person who will \nhave my intercession on the Day of Resurrection will be the one who said sincerely from the bottom \nof his heart \"None has the right to be worshipped but Allah.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي سُلَيْمَانُ، عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ قِيلَ يَا رَسُولَ اللَّهِ، مَنْ أَسْعَدُ النَّاسِ بِشَفَاعَتِكَ يَوْمَ الْقِيَامَةِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَقَدْ ظَنَنْتُ يَا أَبَا هُرَيْرَةَ أَنْ لاَ يَسْأَلَنِي عَنْ هَذَا الْحَدِيثِ أَحَدٌ أَوَّلُ مِنْكَ، لِمَا رَأَيْتُ مِنْ حِرْصِكَ عَلَى الْحَدِيثِ، أَسْعَدُ النَّاسِ بِشَفَاعَتِي يَوْمَ الْقِيَامَةِ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ، خَالِصًا مِنْ قَلْبِهِ أَوْ نَفْسِهِ ‏\"‏‏.‏",
    "malay_translation": "Saya berkata: \"Wahai Rasulullah (ﷺ)! Siapakah orang yang paling beruntung, yang akan mendapat syafaatmu pada Hari Kiamat?\" Rasulullah (ﷺ) bersabda: Wahai Abu Hurairah! \"Aku telah menyangka bahawa tidak ada seorang pun yang akan bertanya kepadaku tentang hal ini sebelum engkau, kerana aku tahu keinginanmu yang besar untuk (mempelajari) Hadis. Orang yang paling beruntung yang akan mendapat syafaatku pada Hari Kiamat adalah orang yang mengucapkan dengan ikhlas dari lubuk hatinya \"Tidak ada Tuhan yang berhak disembah selain Allah.\""
  },
  {
    "id": 100,
    "hadith_number": 100,
    "tajuk_hadith": "Allah Tidak Mengambil Ilmu dengan Menghilangkan dari Hati Manusia, Tetapi dengan Mematikan Ulama",
    "perawi_melayu": "`Abdullah bin `Amr bin Al-`As meriwayatkan:",
    "english_text": "I heard Allah's Messenger (ﷺ) saying, \"Allah does not take away the knowledge, by taking it away from (the \nhearts of) the people, but takes it away by the death of the religious learned men till when none of the \n(religious learned men) remains, people will take as their leaders ignorant persons who when \nconsulted will give their verdict without knowledge. So they will go astray and will lead the people \nastray.\"",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ اللَّهَ لاَ يَقْبِضُ الْعِلْمَ انْتِزَاعًا، يَنْتَزِعُهُ مِنَ الْعِبَادِ، وَلَكِنْ يَقْبِضُ الْعِلْمَ بِقَبْضِ الْعُلَمَاءِ، حَتَّى إِذَا لَمْ يُبْقِ عَالِمًا، اتَّخَذَ النَّاسُ رُءُوسًا جُهَّالاً فَسُئِلُوا، فَأَفْتَوْا بِغَيْرِ عِلْمٍ، فَضَلُّوا وَأَضَلُّوا ‏\"‏‏.\nقَالَ الْفِرَبْرِيُّ حَدَّثَنَا عَبَّاسٌ قَالَ حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا جَرِيرٌ عَنْ هِشَامٍ نَحْوَهُ‏.‏",
    "malay_translation": "Saya mendengar Rasulullah ﷺ bersabda, \"Sesungguhnya Allah tidak mengambil ilmu dengan mencabutnya dari (hati) manusia, tetapi Dia mengambil ilmu dengan mewafatkan para ulama. Sehingga apabila tidak ada lagi ulama yang tersisa, orang-orang akan mengangkat orang-orang bodoh sebagai pemimpin. Apabila mereka ditanya, mereka akan memberi fatwa tanpa ilmu. Maka mereka sesat dan menyesatkan orang lain.\""
  },
  {
    "id": 101,
    "hadith_number": 101,
    "tajuk_hadith": "Keutamaan Wanita yang Kematian Tiga Anak",
    "perawi_melayu": "Diriwayatkan oleh Abu Sa'id Al-Khudri:",
    "english_text": "Some women requested the Prophet (ﷺ) to fix a day for them as the men were taking all his time. On that \nhe promised them one day for religious lessons and commandments. Once during such a lesson the \nProphet said, \"A woman whose three children die will be shielded by them from the Hell fire.\" On that \na woman asked, \"If only two die?\" He replied, \"Even two (will shield her from the Hell-fire).",
    "arabic_text": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنِي ابْنُ الأَصْبَهَانِيِّ، قَالَ سَمِعْتُ أَبَا صَالِحٍ، ذَكْوَانَ يُحَدِّثُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،‏.‏ قَالَتِ النِّسَاءُ لِلنَّبِيِّ صلى الله عليه وسلم غَلَبَنَا عَلَيْكَ الرِّجَالُ، فَاجْعَلْ لَنَا يَوْمًا مِنْ نَفْسِكَ‏.‏ فَوَعَدَهُنَّ يَوْمًا لَقِيَهُنَّ فِيهِ، فَوَعَظَهُنَّ وَأَمَرَهُنَّ، فَكَانَ فِيمَا قَالَ لَهُنَّ ‏\"‏ مَا مِنْكُنَّ امْرَأَةٌ تُقَدِّمُ ثَلاَثَةً مِنْ وَلَدِهَا إِلاَّ كَانَ لَهَا حِجَابًا مِنَ النَّارِ ‏\"‏‏.‏ فَقَالَتِ امْرَأَةٌ وَاثْنَيْنِ فَقَالَ ‏\"‏ وَاثْنَيْنِ ‏\"‏‏.‏",
    "malay_translation": "Beberapa orang wanita meminta kepada Nabi (ﷺ) untuk menetapkan satu hari khusus untuk mereka kerana kaum lelaki telah mengambil semua masa baginda. Baginda (ﷺ) kemudiannya menjanjikan satu hari untuk pelajaran agama dan perintah-perintah. Pada suatu ketika semasa pelajaran tersebut, Nabi (ﷺ) bersabda, \"Seorang wanita yang kematian tiga orang anaknya akan dilindungi oleh mereka daripada api Neraka.\" Seorang wanita bertanya, \"Jika hanya dua yang meninggal dunia?\" Baginda menjawab, \"Bahkan dua (juga akan melindunginya daripada api Neraka)."
  },
  {
    "id": 102,
    "hadith_number": 102,
    "tajuk_hadith": "Kelebihan Kanak-Kanak yang Belum Akil Baligh",
    "perawi_melayu": "Diriwayatkan oleh Abu Sa'id Al-Khudri:",
    "english_text": "as above (the sub narrators are different). Abu Huraira qualified the three children referred to in the \nabove mentioned Hadith as not having reached the age of committing sins (i.e. age of puberty) .",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا غُنْدَرٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَصْبَهَانِيِّ، عَنْ ذَكْوَانَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا‏.‏ وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَصْبَهَانِيِّ، قَالَ سَمِعْتُ أَبَا حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ ‏\n\"‏ ثَلاَثَةً لَمْ يَبْلُغُوا الْحِنْثَ ‏\"‏‏.‏",
    "malay_translation": "Seperti yang di atas (para perawi bawahan adalah berbeza). Abu Hurairah menjelaskan bahawa tiga orang kanak-kanak yang disebut dalam Hadith di atas adalah mereka yang belum mencapai usia melakukan dosa (iaitu usia baligh)."
  },
  {
    "id": 103,
    "hadith_number": 103,
    "tajuk_hadith": "Aisyah Bertanya untuk Memahami Hadis dan Penjelasan Hisab yang Mudah dan Siksaan",
    "perawi_melayu": "Diriwayatkan oleh Ibn Abu Mulaika:",
    "english_text": "Whenever `Aisha (the wife of the Prophet) heard anything which she did not understand, she used to \nask again till she understood it completely. Aisha said: \"Once the Prophet (ﷺ) said, \"Whoever will be \ncalled to account (about his deeds on the Day of Resurrection) will surely be punished.\" I said, \n\"Doesn't Allah say: \"He surely will receive an easy reckoning.\" (84.8) The Prophet (ﷺ) replied, \"This \nmeans only the presentation of the accounts but whoever will be argued about his account, will \ncertainly be ruined.\"",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ أَخْبَرَنَا نَافِعُ بْنُ عُمَرَ، قَالَ حَدَّثَنِي ابْنُ أَبِي مُلَيْكَةَ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَانَتْ لاَ تَسْمَعُ شَيْئًا لاَ تَعْرِفُهُ إِلاَّ رَاجَعَتْ فِيهِ حَتَّى تَعْرِفَهُ، وَأَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ حُوسِبَ عُذِّبَ ‏\"‏‏.‏ قَالَتْ عَائِشَةُ فَقُلْتُ أَوَ لَيْسَ يَقُولُ اللَّهُ تَعَالَى ‏{‏فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا‏}‏ قَالَتْ فَقَالَ ‏\"‏ إِنَّمَا ذَلِكَ الْعَرْضُ، وَلَكِنْ مَنْ نُوقِشَ الْحِسَابَ يَهْلِكْ ‏\"‏‏.‏",
    "malay_translation": "Setiap kali Aisyah (isteri Nabi) mendengar sesuatu yang tidak difahaminya, beliau akan bertanya lagi sehingga beliau memahaminya sepenuhnya. Aisyah berkata: \"Suatu ketika Nabi (ﷺ) bersabda, \"Sesiapa yang akan dihisab (tentang amalannya pada Hari Kiamat) pasti akan dihukum.\" Saya berkata, \"Bukankah Allah berfirman: \"Dia pasti akan menerima perhitungan yang mudah.\" (84:8) Nabi (ﷺ) menjawab, \"Ini bermaksud hanya pembentangan akaun, tetapi sesiapa yang berdebat tentang akaunnya, pasti akan binasa.\""
  },
  {
    "id": 104,
    "hadith_number": 104,
    "tajuk_hadith": "Kehormatan Makkah dan Larangan Menumpahkan Darah atau Menebang Pokok di Dalamnya",
    "perawi_melayu": "Diriwayatkan oleh Sa'id:",
    "english_text": "Abu Shuraih said, \"When `Amr bin Sa`id was sending the troops to Mecca (to fight `Abdullah bin Az- \nZubair) I said to him, 'O chief! Allow me to tell you what the Prophet (ﷺ) said on the day following the \nconquests of Mecca. My ears heard and my heart comprehended, and I saw him with my own eyes, \nwhen he said it. He glorified and praised Allah and then said, \"Allah and not the people has made \nMecca a sanctuary. So anybody who has belief in Allah and the Last Day (i.e. a Muslim) should \nneither shed blood in it nor cut down its trees. If anybody argues that fighting is allowed in Mecca as \nAllah's Messenger (ﷺ) did fight (in Mecca), tell him that Allah gave permission to His Apostle, but He did \nnot give it to you. The Prophet (ﷺ) added: Allah allowed me only for a few hours on that day (of the \nconquest) and today (now) its sanctity is the same (valid) as it was before. So it is incumbent upon \nthose who are present to convey it (this information) to those who are absent.\" Abu- Shuraih was \nasked, \"What did `Amr reply?\" He said `Amr said, \"O Abu Shuraih! I know better than you (in this \nrespect). Mecca does not give protection to one who disobeys (Allah) or runs after committing \nmurder, or theft (and takes refuge in Mecca).",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي سَعِيدٌ، عَنْ أَبِي شُرَيْحٍ، أَنَّهُ قَالَ لِعَمْرِو بْنِ سَعِيدٍ وَهْوَ يَبْعَثُ الْبُعُوثَ إِلَى مَكَّةَ ائْذَنْ لِي أَيُّهَا الأَمِيرُ أُحَدِّثْكَ قَوْلاً قَامَ بِهِ النَّبِيُّ صلى الله عليه وسلم الْغَدَ مِنْ يَوْمِ الْفَتْحِ، سَمِعَتْهُ أُذُنَاىَ وَوَعَاهُ قَلْبِي، وَأَبْصَرَتْهُ عَيْنَاىَ، حِينَ تَكَلَّمَ بِهِ، حَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏\n\"‏ إِنَّ مَكَّةَ حَرَّمَهَا اللَّهُ، وَلَمْ يُحَرِّمْهَا النَّاسُ، فَلاَ يَحِلُّ لاِمْرِئٍ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ يَسْفِكَ بِهَا دَمًا، وَلاَ يَعْضِدَ بِهَا شَجَرَةً، فَإِنْ أَحَدٌ تَرَخَّصَ لِقِتَالِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِيهَا فَقُولُوا إِنَّ اللَّهَ قَدْ أَذِنَ لِرَسُولِهِ، وَلَمْ يَأْذَنْ لَكُمْ‏.‏ وَإِنَّمَا أَذِنَ لِي فِيهَا سَاعَةً مِنْ نَهَارٍ، ثُمَّ عَادَتْ حُرْمَتُهَا الْيَوْمَ كَحُرْمَتِهَا بِالأَمْسِ، وَلْيُبَلِّغِ الشَّاهِدُ الْغَائِبَ ‏\"‏‏.‏ فَقِيلَ لأَبِي شُرَيْحٍ مَا قَالَ عَمْرٌو قَالَ أَنَا أَعْلَمُ مِنْكَ يَا أَبَا شُرَيْحٍ، لاَ يُعِيذُ عَاصِيًا، وَلاَ فَارًّا بِدَمٍ، وَلاَ فَارًّا بِخَرْبَةٍ‏.‏",
    "malay_translation": "Abu Shuraih berkata, \"Ketika `Amr bin Sa`id menghantar pasukan tentera ke Makkah (untuk memerangi `Abdullah bin Az-Zubair) saya berkata kepadanya, 'Wahai ketua! Izinkan saya memberitahu anda apa yang Nabi (ﷺ) sabdakan pada hari selepas penaklukan Makkah. Telinga saya mendengar dan hati saya memahami, dan saya melihatnya dengan mata saya sendiri, ketika baginda bersabda. Baginda memuliakan dan memuji Allah kemudian bersabda, \"Allah dan bukan manusia yang menjadikan Makkah sebagai tanah suci. Oleh itu, sesiapa sahaja yang beriman kepada Allah dan Hari Akhirat (iaitu seorang Muslim) tidak seharusnya menumpahkan darah di dalamnya atau menebang pokok-pokoknya. Jika sesiapa berhujah bahawa peperangan dibenarkan di Makkah seperti yang dilakukan oleh Rasulullah (ﷺ) (di Makkah), beritahu dia bahawa Allah telah memberikan izin kepada Rasul-Nya, tetapi Dia tidak memberikannya kepada kamu. Nabi (ﷺ) menambah: Allah hanya membenarkan saya untuk beberapa jam pada hari itu (penaklukan) dan hari ini (sekarang) kesuciannya adalah sama (sah) seperti sebelumnya. Oleh itu, adalah wajib bagi mereka yang hadir untuk menyampaikan (maklumat ini) kepada mereka yang tidak hadir.\" Abu- Shuraih ditanya, \"Apa yang `Amr balas?\" Dia berkata `Amr berkata, \"Wahai Abu Shuraih! Saya lebih tahu daripada kamu (dalam hal ini). Makkah tidak memberikan perlindungan kepada orang yang mengingkari (Allah) atau melarikan diri setelah melakukan pembunuhan, atau pencurian (dan berlindung di Makkah)."
  },
  {
    "id": 105,
    "hadith_number": 105,
    "tajuk_hadith": "Kehormatan Nyawa, Harta, dan Maruah Sesama Muslim",
    "perawi_melayu": "Diriwayatkan oleh Abu Bakra:",
    "english_text": "The Prophet (ﷺ) said. No doubt your blood, property, the sub-narrator Muhammad thought that Abu \nBakra had also mentioned and your honor (chastity), are sacred to one another as is the sanctity of this \nday of yours in this month of yours. It is incumbent on those who are present to inform those who are \nabsent.\" (Muhammad the Sub-narrator used to say, \"Allah's Messenger (ﷺ) told the truth.\") The Prophet (ﷺ) \nrepeated twice: \"No doubt! Haven't I conveyed Allah's message to you.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنِ ابْنِ أَبِي بَكْرَةَ، عَنْ أَبِي بَكْرَةَ، ذُكِرَ النَّبِيُّ صلى الله عليه وسلم قَالَ ‏\"‏ فَإِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ ـ قَالَ مُحَمَّدٌ وَأَحْسِبُهُ قَالَ وَأَعْرَاضَكُمْ ـ عَلَيْكُمْ حَرَامٌ كَحُرْمَةِ يَوْمِكُمْ هَذَا فِي شَهْرِكُمْ هَذَا، أَلاَ لِيُبَلِّغِ الشَّاهِدُ مِنْكُمُ الْغَائِبَ ‏\"‏‏.‏ وَكَانَ مُحَمَّدٌ يَقُولُ صَدَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم كَانَ ذَلِكَ ‏\"‏ أَلاَ هَلْ بَلَّغْتُ ‏\"‏ مَرَّتَيْنِ‏.‏",
    "malay_translation": "Nabi ﷺ bersabda, “Sesungguhnya darah kamu, harta kamu – Muhammad, perawi bawahan, berpendapat bahawa Abu Bakra juga menyebut – dan kehormatan (kesucian) kamu adalah suci antara satu sama lain, sebagaimana sucinya hari ini (Hari Arafah) dalam bulan ini (bulan Zulhijjah). Wajib bagi mereka yang hadir untuk memaklumkan kepada mereka yang tidak hadir.” Muhammad, perawi bawahan, biasa berkata, “Rasulullah ﷺ telah berkata benar.” Nabi ﷺ mengulangi dua kali: “Sesungguhnya! Bukankah aku telah menyampaikan pesan Allah kepada kamu?”"
  },
  {
    "id": 106,
    "hadith_number": 106,
    "tajuk_hadith": "Larangan Berdusta Atas Nama Nabi ﷺ dan Akibatnya",
    "perawi_melayu": "Diriwayatkan daripada `Ali:",
    "english_text": "The Prophet (ﷺ) said, \"Do not tell a lie against me for whoever tells a lie against me (intentionally) then \nhe will surely enter the Hell-fire.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، قَالَ أَخْبَرَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي مَنْصُورٌ، قَالَ سَمِعْتُ رِبْعِيَّ بْنَ حِرَاشٍ، يَقُولُ سَمِعْتُ عَلِيًّا، يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ تَكْذِبُوا عَلَىَّ، فَإِنَّهُ مَنْ كَذَبَ عَلَىَّ فَلْيَلِجِ النَّارَ ‏\"‏‏.‏",
    "malay_translation": "Nabi ﷺ bersabda, \"Janganlah kamu berdusta terhadapku, kerana sesungguhnya barangsiapa yang berdusta terhadapku (dengan sengaja), maka dia pasti akan masuk neraka.\""
  },
  {
    "id": 107,
    "hadith_number": 107,
    "tajuk_hadith": "Ancaman Bagi Mereka yang Berdusta Atas Nama Nabi Muhammad SAW",
    "perawi_melayu": "Diriwayatkan oleh Abdullah bin Az-Zubair:",
    "english_text": "I said to my father, 'I do not hear from you any narration (Hadith) of Allah s Apostle as I hear (his \nnarration) from so and so?\" Az-Zubair replied. l was always with him (the Prophet) and I heard him \nsaying \"Whoever tells a lie against me (intentionally) then (surely) let him occupy, his seat in Hellfire.",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ جَامِعِ بْنِ شَدَّادٍ، عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ أَبِيهِ، قَالَ قُلْتُ لِلزُّبَيْرِ إِنِّي لاَ أَسْمَعُكَ تُحَدِّثُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم كَمَا يُحَدِّثُ فُلاَنٌ وَفُلاَنٌ‏.‏ قَالَ أَمَا إِنِّي لَمْ أُفَارِقْهُ وَلَكِنْ سَمِعْتُهُ يَقُولُ ‏\n\"‏ مَنْ كَذَبَ عَلَىَّ فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ ‏\"‏‏.‏",
    "malay_translation": "Aku berkata kepada ayahku, 'Aku tidak mendengar daripadamu apa-apa riwayat (Hadith) daripada Rasulullah SAW sebagaimana aku mendengar (riwayatnya) daripada si fulan dan si fulan?' Az-Zubair menjawab, 'Aku sentiasa bersama baginda (Nabi Muhammad SAW) dan aku mendengar baginda bersabda, \"Sesiapa yang berdusta atas namaku (dengan sengaja), maka hendaklah dia menempati tempat duduknya di dalam Neraka.\""
  },
  {
    "id": 108,
    "hadith_number": 108,
    "tajuk_hadith": "Ancaman bagi Mereka yang Sengaja Berdusta Atas Nama Nabi ﷺ",
    "perawi_melayu": "Diriwayatkan oleh Anas:",
    "english_text": "The fact which stops me from narrating a great number of Hadiths to you is that the Prophet (ﷺ) said: \n\"Whoever tells a lie against me intentionally, then (surely) let him occupy his seat in Hell-fire.\"",
    "arabic_text": "حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ، قَالَ أَنَسٌ إِنَّهُ لَيَمْنَعُنِي أَنْ أُحَدِّثَكُمْ حَدِيثًا كَثِيرًا أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ تَعَمَّدَ عَلَىَّ كَذِبًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ ‏\"‏‏.‏",
    "malay_translation": "Perkara yang menghalang saya daripada meriwayatkan banyak Hadith kepada kamu adalah kerana Nabi ﷺ bersabda: \n\"Barangsiapa yang berdusta terhadapku dengan sengaja, maka hendaklah dia menempati tempat duduknya di dalam neraka.\""
  },
  {
    "id": 109,
    "hadith_number": 109,
    "tajuk_hadith": "Ancaman Bagi Mereka yang Mereka-reka Perkataan ke Atas Nabi ﷺ",
    "perawi_melayu": "Diriwayatkan oleh Salama:",
    "english_text": "I heard the Prophet (ﷺ) saying, \"Whoever (intentionally) ascribes to me what I have not said then (surely) \nlet him occupy his seat in Hell-fire.\"",
    "arabic_text": "حَدَّثَنَا مَكِّيُّ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ يَقُلْ عَلَىَّ مَا لَمْ أَقُلْ فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ ‏\"‏‏.‏",
    "malay_translation": "Saya mendengar Nabi ﷺ bersabda, \"Sesiapa yang (dengan sengaja) menisbahkan kepada saya apa yang tidak saya katakan, maka hendaklah dia mempersiapkan tempat duduknya di dalam neraka.\""
  },
  {
    "id": 110,
    "hadith_number": 110,
    "tajuk_hadith": "Larangan Menggunakan Gelaran 'Abul Qasim' dan Keutamaan Melihat Nabi dalam Mimpi",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \"Name yourselves with my name (use my name) but do not name yourselves with \nmy Kunya name (i.e. Abul Qasim). And whoever sees me in a dream then surely he has seen me for \nSatan cannot impersonate me. And whoever tells a lie against me (intentionally), then (surely) let him \noccupy his seat in Hell-fire.\"",
    "arabic_text": "حَدَّثَنَا مُوسَى، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ تَسَمَّوْا بِاسْمِي وَلاَ تَكْتَنُوا بِكُنْيَتِي، وَمَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي، فَإِنَّ الشَّيْطَانَ لاَ يَتَمَثَّلُ فِي صُورَتِي، وَمَنْ كَذَبَ عَلَىَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ ‏\"‏‏.‏",
    "malay_translation": "Nabi ﷺ bersabda, \"Namakan diri kamu dengan nama ku (gunakan nama ku) tetapi jangan namakan diri kamu dengan nama Kunya ku (iaitu Abul Qasim). Dan sesiapa yang melihat ku dalam mimpi maka sesungguhnya dia telah melihat ku, kerana Syaitan tidak dapat menyerupai ku. Dan sesiapa yang berdusta terhadap ku (dengan sengaja), maka (sesungguhnya) biarlah dia menempati tempat duduknya di dalam Neraka.\""
  },
  {
    "id": 111,
    "hadith_number": 111,
    "tajuk_hadith": "Penjelasan 'Ali tentang Ilmu dan Hukum yang Dimilikinya Selain Al-Quran",
    "perawi_melayu": "Diriwayatkan oleh Ash-Shu`bi:",
    "english_text": "Abu Juhaifa said, \"I asked `Ali, 'Have you got any book (which has been revealed to the Prophet (ﷺ) apart \nfrom the Qur'an)?' `Ali replied, 'No, except Allah's Book or the power of understanding which has \nbeen bestowed (by Allah) upon a Muslim or what is (written) in this sheet of paper (with me).' Abu \nJuhaifa said, \"I asked, 'What is (written) in this sheet of paper?' `Ali replied, it deals with The Diyya \n(compensation (blood money) paid by the killer to the relatives of the victim), the ransom for the \nreleasing of the captives from the hands of the enemies, and the law that no Muslim should be killed \nin Qisas (equality in punishment) for the killing of (a disbeliever).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ أَخْبَرَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ مُطَرِّفٍ، عَنِ الشَّعْبِيِّ، عَنْ أَبِي جُحَيْفَةَ، قَالَ قُلْتُ لِعَلِيٍّ هَلْ عِنْدَكُمْ كِتَابٌ قَالَ لاَ، إِلاَّ كِتَابُ اللَّهِ، أَوْ فَهْمٌ أُعْطِيَهُ رَجُلٌ مُسْلِمٌ، أَوْ مَا فِي هَذِهِ الصَّحِيفَةِ‏.‏ قَالَ قُلْتُ فَمَا فِي هَذِهِ الصَّحِيفَةِ قَالَ الْعَقْلُ، وَفَكَاكُ الأَسِيرِ، وَلاَ يُقْتَلُ مُسْلِمٌ بِكَافِرٍ‏.‏",
    "malay_translation": "Abu Juhaifa berkata, \"Saya bertanya kepada `Ali, 'Adakah kamu mempunyai sebarang kitab (yang telah diwahyukan kepada Nabi (ﷺ) selain daripada Al-Quran)?' `Ali menjawab, 'Tidak, kecuali Kitab Allah atau kekuatan pemahaman yang telah dikurniakan (oleh Allah) kepada seorang Muslim atau apa yang (tertulis) di dalam lembaran kertas ini (bersama saya).' Abu Juhaifa berkata, \"Saya bertanya, 'Apa yang (tertulis) di dalam lembaran kertas ini?' `Ali menjawab, ia berkaitan dengan Diyya (pampasan (wang darah) yang dibayar oleh pembunuh kepada keluarga mangsa), tebusan untuk membebaskan tawanan dari tangan musuh, dan hukum bahawa tidak ada seorang Muslim pun yang boleh dibunuh dalam Qisas (persamaan dalam hukuman) kerana membunuh (orang kafir)."
  },
  {
    "id": 112,
    "hadith_number": 112,
    "tajuk_hadith": "Larangan Membunuh di Mekah dan Hak Waris Mangsa",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "In the year of the Conquest of Mecca, the tribe of Khuza`a killed a man from the tribe of Bani Laith in \nrevenge for a killed person, belonging to them. They informed the Prophet (ﷺ) about it. So he rode his \nRahila (she-camel for riding) and addressed the people saying, \"Allah held back the killing from \nMecca. (The sub-narrator is in doubt whether the Prophet (ﷺ) said \"elephant or killing,\" as the Arabic \nwords standing for these words have great similarity in shape), but He (Allah) let His Apostle and the \nbelievers over power the infidels of Mecca. Beware! (Mecca is a sanctuary) Verily! Fighting in Mecca \nwas not permitted for anyone before me nor will it be permitted for anyone after me. It (war) in it was \nmade legal for me for few hours or so on that day. No doubt it is at this moment a sanctuary, it is not \nallowed to uproot its thorny shrubs or to uproot its trees or to pick up its Luqat (fallen things) except \nby a person who will look for its owner (announce it publicly). And if somebody is killed, then his \nclosest relative has the right to choose one of the two-- the blood money (Diyya) or retaliation having \nthe killer killed. In the meantime a man from Yemen came and said, \"O Allah's Messenger (ﷺ)! Get that \nwritten for me.\" The Prophet (ﷺ) ordered his companions to write that for him. Then a man from Quraish \nsaid, \"Except Al-Idhkhir (a type of grass that has good smell) O Allah's Messenger (ﷺ), as we use it in our \nhouses and graves.\" The Prophet (ﷺ) said, \"Except Al-Idhkhir i.e. Al-Idhkhir is allowed to be plucked.\"",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ الْفَضْلُ بْنُ دُكَيْنٍ، قَالَ حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ خُزَاعَةَ، قَتَلُوا رَجُلاً مِنْ بَنِي لَيْثٍ عَامَ فَتْحِ مَكَّةَ بِقَتِيلٍ مِنْهُمْ قَتَلُوهُ، فَأُخْبِرَ بِذَلِكَ النَّبِيُّ صلى الله عليه وسلم فَرَكِبَ رَاحِلَتَهُ، فَخَطَبَ فَقَالَ ‏\"‏ إِنَّ اللَّهَ حَبَسَ عَنْ مَكَّةَ الْقَتْلَ ـ أَوِ الْفِيلَ شَكَّ أَبُو عَبْدِ اللَّهِ ـ وَسَلَّطَ عَلَيْهِمْ رَسُولَ اللَّهِ صلى الله عليه وسلم وَالْمُؤْمِنِينَ، أَلاَ وَإِنَّهَا لَمْ تَحِلَّ لأَحَدٍ قَبْلِي، وَلاَ تَحِلُّ لأَحَدٍ بَعْدِي أَلاَ وَإِنَّهَا حَلَّتْ لِي سَاعَةً مِنْ نَهَارٍ، أَلاَ وَإِنَّهَا سَاعَتِي هَذِهِ حَرَامٌ، لاَ يُخْتَلَى شَوْكُهَا، وَلاَ يُعْضَدُ شَجَرُهَا، وَلاَ تُلْتَقَطُ سَاقِطَتُهَا إِلاَّ لِمُنْشِدٍ، فَمَنْ قُتِلَ فَهُوَ بِخَيْرِ النَّظَرَيْنِ إِمَّا أَنْ يُعْقَلَ، وَإِمَّا أَنْ يُقَادَ أَهْلُ الْقَتِيلِ ‏\"‏‏.‏ فَجَاءَ رَجُلٌ مِنْ أَهْلِ الْيَمَنِ فَقَالَ اكْتُبْ لِي يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ ‏\"‏ اكْتُبُوا لأَبِي فُلاَنٍ ‏\"‏‏.‏ فَقَالَ رَجُلٌ مِنْ قُرَيْشٍ إِلاَّ الإِذْخِرَ يَا رَسُولَ اللَّهِ، فَإِنَّا نَجْعَلُهُ فِي بُيُوتِنَا وَقُبُورِنَا‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِلاَّ الإِذْخِرَ، إِلاَّ الإِذْخِرَ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ يُقَالُ يُقَادُ بِالْقَافِ‏.‏ فَقِيلَ لأَبِي عَبْدِ اللَّهِ أَىُّ شَىْءٍ كَتَبَ لَهُ قَالَ كَتَبَ لَهُ هَذِهِ الْخُطْبَةَ‏.‏",
    "malay_translation": "Pada tahun Pembukaan Kota Mekah, suku Khuza'ah telah membunuh seorang lelaki daripada suku Bani Laith sebagai balasan dendam terhadap kematian seorang daripada mereka. Mereka memaklumkan Nabi (ﷺ) tentang perkara itu. Maka Baginda menunggang Rahilah (unta betina tunggangannya) dan berkhutbah kepada orang ramai, sabdanya, \"Sesungguhnya Allah telah menahan pembunuhan daripada berlaku di Mekah (Perawi ragu-ragu sama ada Nabi (ﷺ) menyebut 'gajah' atau 'pembunuhan,' kerana perkataan Arab bagi kedua-duanya mempunyai persamaan bentuk yang besar), tetapi Dia (Allah) membiarkan Rasul-Nya dan orang-orang beriman mengalahkan orang-orang kafir Mekah. Ketahuilah! (Mekah adalah tanah suci) Sesungguhnya! Peperangan di Mekah tidak dibenarkan bagi sesiapa pun sebelumku dan tidak akan dibenarkan bagi sesiapa pun selepasku. Peperangan di dalamnya (Mekah) dihalalkan bagiku hanya untuk beberapa jam sahaja pada hari itu. Tidak syak lagi, pada saat ini ia adalah tanah suci, tidak dibenarkan mencabut duri-durinya, atau menebang pokok-pokoknya, atau memungut *Luqat* (barang-barang yang jatuh) kecuali oleh seseorang yang akan mencari pemiliknya (mengumumkannya secara terbuka). Dan jika seseorang dibunuh, maka saudara terdekatnya mempunyai hak untuk memilih salah satu daripada dua perkara-- wang tebusan (Diyya) atau membalas dendam dengan membunuh pembunuh itu. Sementara itu, seorang lelaki dari Yaman datang dan berkata, \"Wahai Rasulullah (ﷺ)! Tuliskanlah itu untukku.\" Nabi (ﷺ) memerintahkan para sahabatnya untuk menulisnya untuknya. Kemudian seorang lelaki dari Quraish berkata, \"Kecuali *Al-Idhkhir* (sejenis rumput yang berbau harum) wahai Rasulullah (ﷺ), kerana kami menggunakannya di rumah-rumah kami dan kubur-kubur kami.\" Nabi (ﷺ) bersabda, \"Kecuali *Al-Idhkhir* iaitu *Al-Idhkhir* dibenarkan untuk dipetik.\""
  },
  {
    "id": 113,
    "hadith_number": 113,
    "tajuk_hadith": "Abu Hurairah: Lebih Banyak Hadis Daripada Saya Kecuali Abdullah bin `Amr",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "There is none among the companions of the Prophet (ﷺ) who has narrated more Hadiths than I except \n`Abdullah bin `Amr (bin Al-`As) who used to write them and I never did the same.",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا عَمْرٌو، قَالَ أَخْبَرَنِي وَهْبُ بْنُ مُنَبِّهٍ، عَنْ أَخِيهِ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ مَا مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم أَحَدٌ أَكْثَرَ حَدِيثًا عَنْهُ مِنِّي، إِلاَّ مَا كَانَ مِنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو فَإِنَّهُ كَانَ يَكْتُبُ وَلاَ أَكْتُبُ‏.‏ تَابَعَهُ مَعْمَرٌ عَنْ هَمَّامٍ عَنْ أَبِي هُرَيْرَةَ‏.‏",
    "malay_translation": "Tidak ada seorang pun di antara para sahabat Nabi ﷺ yang meriwayatkan Hadis lebih banyak daripada saya kecuali Abdullah bin `Amr (bin Al-`As) yang biasa menulisnya, dan saya tidak pernah melakukan hal yang sama."
  },
  {
    "id": 114,
    "hadith_number": 114,
    "tajuk_hadith": "Nabi ﷺ Ingin Menulis Wasiat Ketika Sakit",
    "perawi_melayu": "Diriwayatkan oleh 'Ubaidullah bin `Abdullah:",
    "english_text": "Ibn `Abbas said, \"When the ailment of the Prophet (ﷺ) became worse, he said, 'Bring for me (writing) \npaper and I will write for you a statement after which you will not go astray.' But `Umar said, 'The \nProphet is seriously ill, and we have got Allah's Book with us and that is sufficient for us.' But the \ncompanions of the Prophet (ﷺ) differed about this and there was a hue and cry. On that the Prophet (ﷺ) said to \nthem, 'Go away (and leave me alone). It is not right that you should quarrel in front of me.\" Ibn \n`Abbas came out saying, \"It was most unfortunate (a great disaster) that Allah's Messenger (ﷺ) was prevented \nfrom writing that statement for them because of their disagreement and noise. (Note: It is apparent \nfrom this Hadith that Ibn `Abbas had witnessed the event and came out saying this statement. The \ntruth is not so, for Ibn `Abbas used to say this statement on narrating the Hadith and he had not \nwitnessed the event personally. See Fath Al-Bari Vol. 1, p.220 footnote.) (See Hadith No. 228, Vol. \n4).",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمَّا اشْتَدَّ بِالنَّبِيِّ صلى الله عليه وسلم وَجَعُهُ قَالَ ‏\"‏ ائْتُونِي بِكِتَابٍ أَكْتُبُ لَكُمْ كِتَابًا لاَ تَضِلُّوا بَعْدَهُ ‏\"‏‏.‏ قَالَ عُمَرُ إِنَّ النَّبِيَّ صلى الله عليه وسلم غَلَبَهُ الْوَجَعُ وَعِنْدَنَا كِتَابُ اللَّهِ حَسْبُنَا فَاخْتَلَفُوا وَكَثُرَ اللَّغَطُ‏.‏ قَالَ ‏\"‏ قُومُوا عَنِّي، وَلاَ يَنْبَغِي عِنْدِي التَّنَازُعُ ‏\"‏‏.‏ فَخَرَجَ ابْنُ عَبَّاسٍ يَقُولُ إِنَّ الرَّزِيَّةَ كُلَّ الرَّزِيَّةِ مَا حَالَ بَيْنَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَبَيْنَ كِتَابِهِ‏.‏",
    "malay_translation": "Ibnu `Abbas berkata, \"Ketika penyakit Nabi (ﷺ) bertambah parah, baginda bersabda, 'Bawakan aku kertas (untuk menulis) dan aku akan menulis untuk kamu satu pernyataan yang mana kamu tidak akan sesat selepasnya.' Tetapi `Umar berkata, 'Nabi sedang sakit tenat, dan kita mempunyai Kitab Allah bersama kita dan itu sudah memadai bagi kita.' Tetapi para sahabat Nabi (ﷺ) berselisih pendapat tentang hal ini dan berlaku kekecohan. Maka Nabi (ﷺ) bersabda kepada mereka, 'Pergi (dan tinggalkan aku sendiri). Tidak wajar kamu bertengkar di hadapanku.\" Ibnu `Abbas keluar sambil berkata, \"Sungguh malang (bencana besar) bahawa Rasulullah (ﷺ) dihalang daripada menulis pernyataan itu untuk mereka kerana perselisihan dan kebisingan mereka. (Nota: Terzahir daripada Hadis ini bahawa Ibnu `Abbas telah menyaksikan peristiwa itu dan keluar sambil berkata demikian. Hakikatnya tidak demikian, kerana Ibnu `Abbas biasa mengatakan kenyataan ini ketika meriwayatkan Hadis dan dia tidak menyaksikan peristiwa itu secara peribadi. Lihat Fath Al-Bari Jilid 1, hlm.220 nota kaki.) (Lihat Hadis No. 228, Jilid 4)."
  },
  {
    "id": 115,
    "hadith_number": 115,
    "tajuk_hadith": "Peringatan untuk Bangun Malam dan Berwaspada terhadap Fitnah Dunia",
    "perawi_melayu": "Diriwayatkan oleh Ummu Salamah:",
    "english_text": "One night Allah's Messenger (ﷺ) got up and said, \"Subhan Allah! How many afflictions have been descended \ntonight and how many treasures have been disclosed! Go and wake the sleeping lady occupants of \nthese dwellings (his wives) up (for prayers). A well-dressed (soul) in this world may be naked in the \nHereafter. \"",
    "arabic_text": "حَدَّثَنَا صَدَقَةُ، أَخْبَرَنَا ابْنُ عُيَيْنَةَ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ هِنْدٍ، عَنْ أُمِّ سَلَمَةَ، وَعَمْرٍو، وَيَحْيَى بْنِ سَعِيدٍ، عَنِ الزُّهْرِيِّ، عَنْ هِنْدٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتِ اسْتَيْقَظَ النَّبِيُّ صلى الله عليه وسلم ذَاتَ لَيْلَةٍ فَقَالَ ‏\n\"‏ سُبْحَانَ اللَّهِ مَاذَا أُنْزِلَ اللَّيْلَةَ مِنَ الْفِتَنِ وَمَاذَا فُتِحَ مِنَ الْخَزَائِنِ أَيْقِظُوا صَوَاحِبَاتِ الْحُجَرِ، فَرُبَّ كَاسِيَةٍ فِي الدُّنْيَا عَارِيَةٍ فِي الآخِرَةِ ‏\"‏‏.‏",
    "malay_translation": "Pada suatu malam, Rasulullah ﷺ bangun dan bersabda, \"Subhan Allah! Betapa banyak fitnah yang telah diturunkan pada malam ini dan betapa banyak khazanah yang telah dibukakan! Pergilah dan bangunkanlah para wanita (isteri-isteri baginda) yang sedang tidur di bilik-bilik ini (untuk solat). Boleh jadi seorang yang berpakaian lengkap di dunia ini akan telanjang di akhirat kelak.\""
  },
  {
    "id": 116,
    "hadith_number": 116,
    "tajuk_hadith": "Peringatan Nabi ﷺ tentang Jangka Hayat Manusia di Bumi",
    "perawi_melayu": "`Abdullah bin `Umar meriwayatkan:",
    "english_text": "Once the Prophet (ﷺ) led us in the `Isha' prayer during the last days of his life and after finishing it (the \nprayer) (with Taslim) he said: \"Do you realize (the importance of) this night?\" Nobody present on the \nsurface of the earth tonight will be living after the completion of one hundred years from this night.\"",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، وَأَبِي، بَكْرِ بْنِ سُلَيْمَانَ بْنِ أَبِي حَثْمَةَ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ صَلَّى بِنَا النَّبِيُّ صلى الله عليه وسلم الْعِشَاءَ فِي آخِرِ حَيَاتِهِ، فَلَمَّا سَلَّمَ قَامَ فَقَالَ ‏\n\"‏ أَرَأَيْتَكُمْ لَيْلَتَكُمْ هَذِهِ، فَإِنَّ رَأْسَ مِائَةِ سَنَةٍ مِنْهَا لاَ يَبْقَى مِمَّنْ هُوَ عَلَى ظَهْرِ الأَرْضِ أَحَدٌ ‏\"‏‏.‏",
    "malay_translation": "Pada suatu ketika, Nabi ﷺ mengimamkan solat Isyak kami pada hari-hari terakhir hayat baginda. Selepas selesai solat (dengan Taslim), baginda bersabda: \"Adakah kamu sedar (tentang kepentingan) malam ini?\" Tidak seorang pun yang berada di atas muka bumi pada malam ini akan hidup lagi selepas seratus tahun dari malam ini."
  },
  {
    "id": 117,
    "hadith_number": 117,
    "tajuk_hadith": "Nabi Muhammad SAW Solat Malam di Rumah Maimunah dan Kedudukan Ibn Abbas",
    "perawi_melayu": "Diriwayatkan oleh Ibn `Abbas:",
    "english_text": "I stayed overnight in the house of my aunt Maimuna bint Al-Harith (the wife of the Prophet (ﷺ) ) while \nthe Prophet (ﷺ) was there with her during her night turn. The Prophet (ﷺ) offered the `Isha' prayer (in the \nmosque), returned home and after having prayed four rak`at, he slept. Later on he got up at night and \nthen asked whether the boy (or he used a similar word) had slept? Then he got up for the prayer and I \nstood up by his left side but he made me stand to his right and offered five rak`at followed by two \nmore rak`at. Then he slept and I heard him snoring and then (after a while) he left for the (Fajr) \nprayer.",
    "arabic_text": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا الْحَكَمُ، قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ بِتُّ فِي بَيْتِ خَالَتِي مَيْمُونَةَ بِنْتِ الْحَارِثِ زَوْجِ النَّبِيِّ صلى الله عليه وسلم وَكَانَ النَّبِيُّ صلى الله عليه وسلم عِنْدَهَا فِي لَيْلَتِهَا، فَصَلَّى النَّبِيُّ صلى الله عليه وسلم الْعِشَاءَ، ثُمَّ جَاءَ إِلَى مَنْزِلِهِ، فَصَلَّى أَرْبَعَ رَكَعَاتٍ، ثُمَّ نَامَ، ثُمَّ قَامَ، ثُمَّ قَالَ ‏\n\"‏ نَامَ الْغُلَيِّمُ ‏\"‏‏.‏ أَوْ كَلِمَةً تُشْبِهُهَا، ثُمَّ قَامَ فَقُمْتُ عَنْ يَسَارِهِ، فَجَعَلَنِي عَنْ يَمِينِهِ، فَصَلَّى خَمْسَ رَكَعَاتٍ ثُمَّ صَلَّى رَكْعَتَيْنِ، ثُمَّ نَامَ حَتَّى سَمِعْتُ غَطِيطَهُ ـ أَوْ خَطِيطَهُ ـ ثُمَّ خَرَجَ إِلَى الصَّلاَةِ‏.‏",
    "malay_translation": "Saya bermalam di rumah ibu saudara saya, Maimunah binti Al-Harith (isteri Nabi ﷺ) ketika Nabi ﷺ berada di sana bersamanya pada giliran malamnya. Nabi ﷺ menunaikan solat Isyak (di masjid), pulang ke rumah dan setelah menunaikan empat rakaat, baginda tidur. Kemudian baginda bangun pada waktu malam dan bertanya sama ada budak itu (atau baginda menggunakan perkataan yang serupa) sudah tidur? Kemudian baginda bangun untuk solat dan saya berdiri di sebelah kirinya tetapi baginda menjadikan saya berdiri di sebelah kanannya dan menunaikan lima rakaat diikuti dengan dua rakaat lagi. Kemudian baginda tidur dan saya mendengar baginda berdengkur dan kemudian (selepas beberapa ketika) baginda keluar untuk solat Subuh."
  },
  {
    "id": 118,
    "hadith_number": 118,
    "tajuk_hadith": "Keutamaan Abu Hurairah dalam Meriwayatkan Hadith dan Ancaman Menyembunyikan Ilmu",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "People say that I have narrated many Hadiths (The Prophet's narration). Had it not been for two verses \nin the Qur'an, I would not have narrated a single Hadith, and the verses are: \n\"Verily those who conceal the clear sign and the guidance which We have sent down . . . (up to) Most \nMerciful.\" (2:159-160). And no doubt our Muhajir (emigrant) brothers used to be busy in the market \nwith their business (bargains) and our Ansari brothers used to be busy with their property \n(agriculture). But I (Abu Huraira) used to stick to Allah's Messenger (ﷺ) contented with what will fill my \nstomach and I used to attend that which they used not to attend and I used to memorize that which \nthey used not to memorize.",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ إِنَّ النَّاسَ يَقُولُونَ أَكْثَرَ أَبُو هُرَيْرَةَ، وَلَوْلاَ آيَتَانِ فِي كِتَابِ اللَّهِ مَا حَدَّثْتُ حَدِيثًا، ثُمَّ يَتْلُو ‏{‏إِنَّ الَّذِينَ يَكْتُمُونَ مَا أَنْزَلْنَا مِنَ الْبَيِّنَاتِ‏}‏ إِلَى قَوْلِهِ ‏{‏الرَّحِيمُ‏}‏ إِنَّ إِخْوَانَنَا مِنَ الْمُهَاجِرِينَ كَانَ يَشْغَلُهُمُ الصَّفْقُ بِالأَسْوَاقِ، وِإِنَّ إِخْوَانَنَا مِنَ الأَنْصَارِ كَانَ يَشْغَلُهُمُ الْعَمَلُ فِي أَمْوَالِهِمْ، وَإِنَّ أَبَا هُرَيْرَةَ كَانَ يَلْزَمُ رَسُولَ اللَّهِ صلى الله عليه وسلم بِشِبَعِ بَطْنِهِ وَيَحْضُرُ مَا لاَ يَحْضُرُونَ، وَيَحْفَظُ مَا لاَ يَحْفَظُونَ‏.‏",
    "malay_translation": "Orang ramai mengatakan bahawa aku (Abu Hurairah) telah meriwayatkan banyak Hadith (riwayat daripada Nabi ﷺ). Kalaulah tidak kerana dua ayat di dalam Al-Quran, aku tidak akan meriwayatkan satu Hadith pun, dan ayat-ayat itu adalah: \"Sesungguhnya orang-orang yang menyembunyikan keterangan-keterangan yang jelas dan petunjuk yang telah Kami turunkan... (hingga) Maha Penyayang.\" (2:159-160). Sesungguhnya saudara-saudara kami dari kalangan Muhajirin sibuk dengan urusan jual beli di pasar, dan saudara-saudara kami dari kalangan Ansar sibuk dengan pekerjaan di kebun-kebun mereka. Sedangkan aku (Abu Hurairah) sentiasa bersama Rasulullah ﷺ untuk mengisi perutku, menghadiri majlis yang mereka tidak dapat hadiri, dan menghafal apa yang mereka tidak dapat hafal."
  },
  {
    "id": 119,
    "hadith_number": 119,
    "tajuk_hadith": "Doa Rasulullah SAW untuk Kekuatan Ingatan Abu Hurairah RA",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah RA:",
    "english_text": "I said to Allah's Messenger (ﷺ) \"I hear many narrations (Hadiths) from you but I forget them.\" Allah's \nApostle said, \"Spread your Rida' (garment).\" I did accordingly and then he moved his hands as if \nfilling them with something (and emptied them in my Rida') and then said, \"Take and wrap this sheet \nover your body.\" I did it and after that I never forgot any thing.\nNarrated Ibrahim bin Al-Mundhir:\n\nIbn Abi Fudaik narrated the same as above (Hadith...119) but added that the Prophet (ﷺ) had moved his \nhands as if filling them with something and then he emptied them in the Rida' of Abu Huraira.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي بَكْرٍ أَبُو مُصْعَبٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ بْنِ دِينَارٍ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ، إِنِّي أَسْمَعُ مِنْكَ حَدِيثًا كَثِيرًا أَنْسَاهُ‏.‏ قَالَ ‏\"‏ ابْسُطْ رِدَاءَكَ ‏\"‏ فَبَسَطْتُهُ‏.‏ قَالَ فَغَرَفَ بِيَدَيْهِ ثُمَّ قَالَ ‏\"‏ ضُمُّهُ ‏\"‏ فَضَمَمْتُهُ فَمَا نَسِيتُ شَيْئًا بَعْدَهُ‏.\nحَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ قَالَ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ بِهَذَا أَوْ قَالَ غَرَفَ بِيَدِهِ فِيهِ‏.‏",
    "malay_translation": "Aku berkata kepada Rasulullah SAW, \"Aku mendengar banyak riwayat (Hadith) daripadamu tetapi aku melupakannya.\" Rasulullah SAW bersabda, \"Bentangkan rida' (pakaian) kamu.\" Aku pun melakukannya, kemudian baginda menggerakkan tangannya seolah-olah mengisi sesuatu (dan mengosongkannya di ridaku), lalu bersabda, \"Ambil dan balutkan kain ini pada tubuhmu.\" Aku pun melakukannya, dan setelah itu aku tidak pernah melupakan apa pun.\nDiriwayatkan oleh Ibrahim bin Al-Mundzir:\n\nIbn Abi Fudaik meriwayatkan hal yang sama seperti di atas (Hadith...119) tetapi menambahkan bahawa Nabi SAW telah menggerakkan tangannya seolah-olah mengisi sesuatu dan kemudian baginda mengosongkannya di rida' Abu Hurairah RA."
  },
  {
    "id": 120,
    "hadith_number": 120,
    "tajuk_hadith": "Dua Jenis Ilmu yang Dihafal dari Rasulullah SAW",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "I have memorized two kinds of knowledge from Allah's Messenger (ﷺ) . I have propagated one of them to \nyou and if I propagated the second, then my pharynx (throat) would be cut (i.e. killed).",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي أَخِي، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ حَفِظْتُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وِعَاءَيْنِ، فَأَمَّا أَحَدُهُمَا فَبَثَثْتُهُ، وَأَمَّا الآخَرُ فَلَوْ بَثَثْتُهُ قُطِعَ هَذَا الْبُلْعُومُ‏.‏",
    "malay_translation": "Aku telah menghafal dua jenis ilmu daripada Rasulullah SAW. Salah satunya telah aku sebarkan kepada kamu, dan jika aku sebarkan yang kedua, maka kerongkongku ini akan dipotong (iaitu dibunuh)."
  },
  {
    "id": 121,
    "hadith_number": 121,
    "tajuk_hadith": "Larangan Membunuh Sesama Muslim Selepas Kewafatan Nabi",
    "perawi_melayu": "Diriwayatkan oleh Jarir:",
    "english_text": "The Prophet (ﷺ) said to me during Hajjat-al-Wida`: Let the people keep quiet and listen. Then he said \n(addressing the people), \"Do not (become infidels) revert to disbelief after me by striking the necks \n(cutting the throats) of one another (killing each other).",
    "arabic_text": "حَدَّثَنَا حَجَّاجٌ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَلِيُّ بْنُ مُدْرِكٍ، عَنْ أَبِي زُرْعَةَ، عَنْ جَرِيرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لَهُ فِي حَجَّةِ الْوَدَاعِ ‏\"‏ اسْتَنْصِتِ النَّاسَ ‏\"‏ فَقَالَ ‏\"‏ لاَ تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ ‏\"‏‏.‏",
    "malay_translation": "Nabi ﷺ bersabda kepadaku semasa Hajjat-al-Wida': 'Suruh orang ramai diam dan dengar.' Kemudian Baginda bersabda (berucap kepada orang ramai), 'Janganlah kamu (menjadi kafir) kembali kepada kekufuran selepas aku dengan memukul leher (memotong kerongkong) satu sama lain (membunuh satu sama lain).'"
  },
  {
    "id": 122,
    "hadith_number": 122,
    "tajuk_hadith": "Kisah Nabi Musa dan Al-Khidir: Ilmu Allah Yang Maha Luas",
    "perawi_melayu": "Diriwayatkan oleh Sa'id bin Jubair:",
    "english_text": "I said to Ibn `Abbas, \"Nauf-Al-Bakali claims that Moses (the companion of Khadir) was not the \nMoses of Bani Israel but he was another Moses.\" Ibn `Abbas remarked that the enemy of Allah (Nauf) \nwas a liar.\nNarrated Ubai bin Ka`b:\n\nThe Prophet (ﷺ) said, \"Once the Prophet (ﷺ) Moses stood up and addressed Bani Israel. He was asked, \"Who \nis the most learned man amongst the people. He said, \"I am the most learned.\" Allah admonished \nMoses as he did not attribute absolute knowledge to Him (Allah). So Allah inspired to him \"At the \njunction of the two seas there is a slave amongst my slaves who is more learned than you.\" Moses \nsaid, \"O my Lord! How can I meet him?\" Allah said: Take a fish in a large basket (and proceed) and \nyou will find him at the place where you will lose the fish. So Moses set out along with his (servant) \nboy, Yusha` bin Noon and carried a fish in a large basket till they reached a rock, where they laid their \nheads (i.e. lay down) and slept. The fish came out of the basket and it took its way into the sea as in a \ntunnel. So it was an amazing thing for both Moses and his (servant) boy. They proceeded for the rest \nof that night and the following day. When the day broke, Moses said to his (servant) boy: \"Bring us \nour early meal. No doubt, we have suffered much fatigue in this journey.\" Moses did not get tired till \nhe passed the place about which he was told. There the (servant) boy told Moses, \"Do you remember \nwhen we betook ourselves to the rock, I indeed forgot the fish.\" Moses remarked, \"That is what we \nhave been seeking. So they went back retracing their footsteps, till they reached the rock. There they \nsaw a man covered with a garment (or covering himself with his own garment). Moses greeted him. \nAl-Khadir replied saying, \"How do people greet each other in your land?\" \nMoses said, \"I am Moses.\" He asked, \"The Moses of Bani Israel?\" Moses replied in the affirmative \nand added, \"May I follow you so that you teach me of that knowledge which you have been taught.\" \nAl-Khadir replied, \"Verily! You will not be able to remain patient with me, O Moses! I have some of \nthe knowledge of Allah which He has taught me and which you do not know, while you have some \nknowledge which Allah has taught you which I do not know.\" Moses said, \"Allah willing, you will \nfind me patient and I will disobey no order of yours. So both of them set out walking along the \nseashore, as they did not have a boat. In the meantime a boat passed by them and they requested the \ncrew of the boat to take them on board. The crew recognized Al-Khadir and took them on board \nwithout fare. Then a sparrow came and stood on the edge of the boat and dipped its beak once or twice \nin the sea. Al-Khadir said: \"O Moses! My knowledge and your knowledge have not decreased Allah's \nknowledge except as much as this sparrow has decreased the water of the sea with its beak.\" Al- \nKhadir went to one of the planks of the boat and plucked it out. Moses said, \"These people gave us a \nfree lift but you have broken their boat and scuttled it so as to drown its people.\" Al-Khadir replied, \n\"Didn't I tell you that you will not be able to remain patient with me.\" Moses said, \"Call me not to \naccount for what I forgot.\" The first (excuse) of Moses was that he had forgotten. \nThen they proceeded further and found a boy playing with other boys. Al-Khadir took hold of the \nboy's head from the top and plucked it out with his hands (i.e. killed him). Moses said, \"Have you \nkilled an innocent soul who has killed none.\" Al-Khadir replied, \"Did I not tell you that you cannot \nremain patient with me?\" Then they both proceeded till when they came to the people of a town, they \nasked them for food, but they refused to entertain them. Then they found there a wall on the point of \ncollapsing. Al-Khadir repaired it with his own hands. Moses said, \"If you had wished, surely you \ncould have taken wages for it.\" Al-Khadir replied, \"This is the parting between you and me.\" The \nProphet added, \"May Allah be Merciful to Moses! Would that he could have been more patient to \nlearn more about his story with Al-Khadir. \"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا عَمْرٌو، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ جُبَيْرٍ، قَالَ قُلْتُ لاِبْنِ عَبَّاسٍ إِنَّ نَوْفًا الْبِكَالِيَّ يَزْعُمُ أَنَّ مُوسَى لَيْسَ بِمُوسَى بَنِي إِسْرَائِيلَ، إِنَّمَا هُوَ مُوسَى آخَرُ‏.‏ فَقَالَ كَذَبَ عَدُوُّ اللَّهِ، حَدَّثَنَا أُبَىُّ بْنُ كَعْبٍ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ قَامَ مُوسَى النَّبِيُّ خَطِيبًا فِي بَنِي إِسْرَائِيلَ، فَسُئِلَ أَىُّ النَّاسِ أَعْلَمُ فَقَالَ أَنَا أَعْلَمُ‏.‏ فَعَتَبَ اللَّهُ عَلَيْهِ، إِذْ لَمْ يَرُدَّ الْعِلْمَ إِلَيْهِ، فَأَوْحَى اللَّهُ إِلَيْهِ أَنَّ عَبْدًا مِنْ عِبَادِي بِمَجْمَعِ الْبَحْرَيْنِ هُوَ أَعْلَمُ مِنْكَ‏.‏ قَالَ يَا رَبِّ وَكَيْفَ بِهِ فَقِيلَ لَهُ احْمِلْ حُوتًا فِي مِكْتَلٍ فَإِذَا فَقَدْتَهُ فَهْوَ ثَمَّ، فَانْطَلَقَ وَانْطَلَقَ بِفَتَاهُ يُوشَعَ بْنِ نُونٍ، وَحَمَلاَ حُوتًا فِي مِكْتَلٍ، حَتَّى كَانَا عِنْدَ الصَّخْرَةِ وَضَعَا رُءُوسَهُمَا وَنَامَا فَانْسَلَّ الْحُوتُ مِنَ الْمِكْتَلِ فَاتَّخَذَ سَبِيلَهُ فِي الْبَحْرِ سَرَبًا، وَكَانَ لِمُوسَى وَفَتَاهُ عَجَبًا، فَانْطَلَقَا بَقِيَّةَ لَيْلَتِهِمَا وَيَوْمِهِمَا فَلَمَّا أَصْبَحَ قَالَ مُوسَى لِفَتَاهُ آتِنَا غَدَاءَنَا، لَقَدْ لَقِينَا مِنْ سَفَرِنَا هَذَا نَصَبًا، وَلَمْ يَجِدْ مُوسَى مَسًّا مِنَ النَّصَبِ حَتَّى جَاوَزَ الْمَكَانَ الَّذِي أُمِرَ بِهِ‏.‏ فَقَالَ لَهُ فَتَاهُ أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ فَإِنِّي نَسِيتُ الْحُوتَ، قَالَ مُوسَى ذَلِكَ مَا كُنَّا نَبْغِي، فَارْتَدَّا عَلَى آثَارِهِمَا قَصَصًا، فَلَمَّا انْتَهَيَا إِلَى الصَّخْرَةِ إِذَا رَجُلٌ مُسَجًّى بِثَوْبٍ ـ أَوْ قَالَ تَسَجَّى بِثَوْبِهِ ـ فَسَلَّمَ مُوسَى‏.‏ فَقَالَ الْخَضِرُ وَأَنَّى بِأَرْضِكَ السَّلاَمُ فَقَالَ أَنَا مُوسَى‏.‏ فَقَالَ مُوسَى بَنِي إِسْرَائِيلَ قَالَ نَعَمْ‏.‏ قَالَ هَلْ أَتَّبِعُكَ عَلَى أَنْ تُعَلِّمَنِي مِمَّا عُلِّمْتَ رَشَدًا قَالَ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا، يَا مُوسَى إِنِّي عَلَى عِلْمٍ مِنْ عِلْمِ اللَّهِ عَلَّمَنِيهِ لاَ تَعْلَمُهُ أَنْتَ، وَأَنْتَ عَلَى عِلْمٍ عَلَّمَكَهُ لاَ أَعْلَمُهُ‏.‏ قَالَ سَتَجِدُنِي إِنْ شَاءَ اللَّهُ صَابِرًا، وَلاَ أَعْصِي لَكَ أَمْرًا، فَانْطَلَقَا يَمْشِيَانِ عَلَى سَاحِلِ الْبَحْرِ لَيْسَ لَهُمَا سَفِينَةٌ، فَمَرَّتْ بِهِمَا سَفِينَةٌ، فَكَلَّمُوهُمْ أَنْ يَحْمِلُوهُمَا، فَعُرِفَ الْخَضِرُ، فَحَمَلُوهُمَا بِغَيْرِ نَوْلٍ، فَجَاءَ عُصْفُورٌ فَوَقَعَ عَلَى حَرْفِ السَّفِينَةِ، فَنَقَرَ نَقْرَةً أَوْ نَقْرَتَيْنِ فِي الْبَحْرِ‏.‏ فَقَالَ الْخَضِرُ يَا مُوسَى، مَا نَقَصَ عِلْمِي وَعِلْمُكَ مِنْ عِلْمِ اللَّهِ إِلاَّ كَنَقْرَةِ هَذَا الْعُصْفُورِ فِي الْبَحْرِ‏.‏ فَعَمَدَ الْخَضِرُ إِلَى لَوْحٍ مِنْ أَلْوَاحِ السَّفِينَةِ فَنَزَعَهُ‏.‏ فَقَالَ مُوسَى قَوْمٌ حَمَلُونَا بِغَيْرِ نَوْلٍ، عَمَدْتَ إِلَى سَفِينَتِهِمْ فَخَرَقْتَهَا لِتُغْرِقَ أَهْلَهَا قَالَ أَلَمْ أَقُلْ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا قَالَ لاَ تُؤَاخِذْنِي بِمَا نَسِيتُ‏.‏ فَكَانَتِ الأُولَى مِنْ مُوسَى نِسْيَانًا‏.‏ فَانْطَلَقَا فَإِذَا غُلاَمٌ يَلْعَبُ مَعَ الْغِلْمَانِ، فَأَخَذَ الْخَضِرُ بِرَأْسِهِ مِنْ أَعْلاَهُ فَاقْتَلَعَ رَأْسَهُ بِيَدِهِ‏.‏ فَقَالَ مُوسَى أَقَتَلْتَ نَفْسًا زَكِيَّةً بِغَيْرِ نَفْسٍ قَالَ أَلَمْ أَقُلْ لَكَ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا ـ قَالَ ابْنُ عُيَيْنَةَ وَهَذَا أَوْكَدُ ـ فَانْطَلَقَا حَتَّى إِذَا أَتَيَا أَهْلَ قَرْيَةٍ اسْتَطْعَمَا أَهْلَهَا، فَأَبَوْا أَنْ يُضَيِّفُوهُمَا، فَوَجَدَا فِيهَا جِدَارًا يُرِيدُ أَنْ يَنْقَضَّ فَأَقَامَهُ‏.‏ قَالَ الْخَضِرُ بِيَدِهِ فَأَقَامَهُ‏.‏ فَقَالَ لَهُ مُوسَى لَوْ شِئْتَ لاَتَّخَذْتَ عَلَيْهِ أَجْرًا‏.‏ قَالَ هَذَا فِرَاقُ بَيْنِي وَبَيْنِكَ ‏\"‏‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ يَرْحَمُ اللَّهُ مُوسَى، لَوَدِدْنَا لَوْ صَبَرَ حَتَّى يُقَصَّ عَلَيْنَا مِنْ أَمْرِهِمَا ‏\"‏‏.‏",
    "malay_translation": "Saya berkata kepada Ibn `Abbas, \"Nauf-Al-Bakali mendakwa bahawa Musa (sahabat Khadir) bukanlah \nMusa Bani Israel tetapi dia adalah Musa yang lain.\" Ibn `Abbas berkata bahawa musuh Allah (Nauf) \nadalah seorang pembohong.\nDiriwayatkan oleh Ubai bin Ka`b:\n\nNabi (ﷺ) bersabda, \"Pada suatu ketika Nabi Musa (ﷺ) berdiri dan berucap kepada Bani Israel. Baginda ditanya, \"Siapakah \norang yang paling berilmu di antara manusia?\" Baginda menjawab, \"Saya orang yang paling berilmu.\" Allah menegur \nMusa kerana dia tidak mengaitkan ilmu mutlak kepada-Nya (Allah). Maka Allah memberi wahyu kepadanya \"Di \npertemuan dua laut terdapat seorang hamba di antara hamba-hamba-Ku yang lebih berilmu daripada kamu.\" Musa \nberkata, \"Wahai Tuhanku! Bagaimana saya boleh bertemu dengannya?\" Allah berfirman: Bawalah seekor ikan di dalam bakul besar (dan teruskan perjalanan) dan \nkamu akan menemuinya di tempat kamu kehilangan ikan itu. Maka Musa berangkat bersama dengan budaknya, \nYusha` bin Noon dan membawa seekor ikan di dalam bakul besar sehingga mereka sampai di sebuah batu, di mana mereka meletakkan \nkepala mereka (iaitu berbaring) dan tidur. Ikan itu keluar dari bakul dan mengambil jalannya ke laut seperti di dalam \nterowong. Maka ia adalah perkara yang menakjubkan bagi Musa dan budaknya. Mereka meneruskan perjalanan sepanjang \nmalam itu dan hari berikutnya. Apabila siang menjelma, Musa berkata kepada budaknya: \"Bawakan kami \nmakanan pagi kita. Sesungguhnya, kita telah mengalami banyak keletihan dalam perjalanan ini.\" Musa tidak berasa letih sehingga \ndia melepasi tempat yang telah diberitahu kepadanya. Di situ, budak itu berkata kepada Musa, \"Adakah kamu ingat \nketika kita berehat di batu itu, sesungguhnya saya terlupa ikan itu.\" Musa berkata, \"Itulah yang kita \ncari.\" Maka mereka berpatah balik menelusuri jejak mereka, sehingga mereka sampai di batu itu. Di sana mereka \nmelihat seorang lelaki yang ditutupi dengan pakaian (atau menutupi dirinya dengan pakaiannya sendiri). Musa memberi salam kepadanya. \nAl-Khadir menjawab dengan berkata, \"Bagaimana orang memberi salam antara satu sama lain di tanah kamu?\" \nMusa berkata, \"Saya Musa.\" Dia bertanya, \"Musa Bani Israel?\" Musa menjawab dengan mengiyakan \ndan menambah, \"Bolehkah saya mengikuti kamu supaya kamu mengajar saya daripada ilmu yang telah diajarkan kepada kamu.\" \nAl-Khadir menjawab, \"Sesungguhnya! Kamu tidak akan dapat bersabar dengan saya, wahai Musa! Saya mempunyai sebahagian daripada \nilmu Allah yang telah Dia ajarkan kepada saya dan yang kamu tidak tahu, manakala kamu mempunyai sebahagian \nilmu yang telah Allah ajarkan kepada kamu yang saya tidak tahu.\" Musa berkata, \"Insya-Allah, kamu akan \nmenemui saya seorang yang sabar dan saya tidak akan mengingkari perintah kamu.\" Maka kedua-duanya berangkat berjalan di sepanjang \ntepi pantai, kerana mereka tidak mempunyai perahu. Dalam pada itu, sebuah perahu melintasi mereka dan mereka meminta \nkru perahu itu untuk membawa mereka menaiki perahu. Kru itu mengenali Al-Khadir dan membawa mereka menaiki perahu \ntanpa bayaran. Kemudian seekor burung pipit datang dan berdiri di tepi perahu dan mencelupkan paruhnya sekali atau dua kali \ndi laut. Al-Khadir berkata: \"Wahai Musa! Ilmu saya dan ilmu kamu tidak mengurangkan ilmu Allah \nkecuali sebanyak burung pipit ini mengurangkan air laut dengan paruhnya.\" Al- \nKhadir pergi ke salah satu papan perahu dan mencabutnya. Musa berkata, \"Orang-orang ini memberi kita tumpangan \npercuma tetapi kamu telah memecahkan perahu mereka dan menenggelamkannya sehingga menenggelamkan orang-orangnya.\" Al-Khadir menjawab, \n\"Bukankah saya telah memberitahu kamu bahawa kamu tidak akan dapat bersabar dengan saya.\" Musa berkata, \"Janganlah kamu menghukum saya \nkerana apa yang saya terlupa.\" Alasan pertama (alasan) Musa adalah bahawa dia telah terlupa. \nKemudian mereka meneruskan perjalanan dan menemui seorang budak lelaki bermain dengan budak-budak lelaki lain. Al-Khadir memegang \nkepala budak lelaki itu dari atas dan mencabut kepalanya dengan tangannya (iaitu membunuhnya). Musa berkata, \"Adakah kamu \ntelah membunuh jiwa yang tidak bersalah yang tidak membunuh sesiapa pun.\" Al-Khadir menjawab, \"Bukankah saya telah memberitahu kamu bahawa kamu tidak boleh \nbesar dengan saya?\" Kemudian mereka berdua meneruskan perjalanan sehingga apabila mereka sampai kepada penduduk sebuah bandar, mereka \nmeminta makanan daripada penduduknya, tetapi mereka enggan melayan mereka. Kemudian mereka menemui di situ sebuah dinding yang hampir \nruntuh. Al-Khadir membaiki dengan tangannya sendiri. Musa berkata, \"Jika kamu mahu, sesungguhnya kamu \nboleh mengambil upah untuknya.\" Al-Khadir menjawab, \"Inilah perpisahan antara saya dan kamu.\" \nNabi menambah, \"Semoga Allah merahmati Musa! Alangkah baiknya jika dia lebih bersabar untuk \nmempelajari lebih lanjut tentang kisahnya dengan Al-Khadir."
  },
  {
    "id": 123,
    "hadith_number": 123,
    "tajuk_hadith": "Berjuang untuk Meninggikan Kalimah Allah",
    "perawi_melayu": "Diriwayatkan oleh Abu Musa:",
    "english_text": "A man came to the Prophet (ﷺ) and asked, \"O Allah's Messenger (ﷺ)! What kind of fighting is in Allah's cause? \n(I ask this), for some of us fight because of being enraged and angry and some for the sake of his pride \nand haughtiness.\" The Prophet (ﷺ) raised his head (as the questioner was standing) and said, \"He who \nfights so that Allah's Word (Islam) should be superior, then he fights in Allah's cause.\"",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ، قَالَ أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مُوسَى، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ، مَا الْقِتَالُ فِي سَبِيلِ اللَّهِ فَإِنَّ أَحَدَنَا يُقَاتِلُ غَضَبًا، وَيُقَاتِلُ حَمِيَّةً‏.‏ فَرَفَعَ إِلَيْهِ رَأْسَهُ ـ قَالَ وَمَا رَفَعَ إِلَيْهِ رَأْسَهُ إِلاَّ أَنَّهُ كَانَ قَائِمًا ـ فَقَالَ ‏\n\"‏ مَنْ قَاتَلَ لِتَكُونَ كَلِمَةُ اللَّهِ هِيَ الْعُلْيَا فَهُوَ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ ‏\"‏‏.‏",
    "malay_translation": "Seorang lelaki datang kepada Nabi ﷺ dan bertanya, \"Wahai Rasulullah ﷺ! Apakah jenis peperangan yang tergolong dalam perjuangan di jalan Allah? (Saya bertanya demikian), kerana sebahagian daripada kami berperang kerana marah dan berang, dan sebahagian kerana kebanggaan dan kesombongan.\" Nabi ﷺ mengangkat kepalanya (kerana orang yang bertanya itu sedang berdiri) dan bersabda, \"Sesiapa yang berperang agar Kalimah Allah (Islam) menjadi yang tertinggi, maka dia berperang di jalan Allah.\""
  },
  {
    "id": 124,
    "hadith_number": 124,
    "tajuk_hadith": "Melakukan Ibadah Haji Tidak Mengikut Susunan: Tiada Kesalahan",
    "perawi_melayu": "Diriwayatkan oleh Abdullah bin `Ammar:",
    "english_text": "I saw the Prophet (ﷺ) near the Jamra and the people were asking him questions (about religious \nproblems). A man asked, \"O Allah's Messenger (ﷺ)! I have slaughtered the Hadi (animal) before doing the \nRami.\" The Prophet (ﷺ) replied, \"Do the Rami (now) and there is no harm.\" Another person asked, \"O \nAllah's Messenger (ﷺ)! I got my head shaved before slaughtering the animal.\" The Prophet (ﷺ) replied, \"Do the \nslaughtering (now) and there is no harm.\" So on that day, when the Prophet (ﷺ) was asked about anything \nas regards the ceremonies of Hajj performed before or after its due time his reply was, \"Do it (now) \nand there is no harm.\"",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ، عَنِ الزُّهْرِيِّ، عَنْ عِيسَى بْنِ طَلْحَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم عِنْدَ الْجَمْرَةِ وَهُوَ يُسْأَلُ، فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ نَحَرْتُ قَبْلَ أَنْ أَرْمِيَ‏.‏ قَالَ ‏\"‏ ارْمِ وَلاَ حَرَجَ ‏\"‏‏.‏ قَالَ آخَرُ يَا رَسُولَ اللَّهِ حَلَقْتُ قَبْلَ أَنْ أَنْحَرَ‏.‏ قَالَ ‏\"‏ انْحَرْ وَلاَ حَرَجَ ‏\"‏‏.‏ فَمَا سُئِلَ عَنْ شَىْءٍ قُدِّمَ وَلاَ أُخِّرَ إِلاَّ قَالَ افْعَلْ وَلاَ حَرَجَ‏.‏",
    "malay_translation": "Saya melihat Nabi (ﷺ) berdekatan Jamrah dan orang ramai sedang bertanya soalan kepadanya (tentang masalah agama). Seorang lelaki bertanya, \"Wahai Rasulullah (ﷺ)! Saya telah menyembelih Hadyu (binatang korban) sebelum melakukan melontar Jamrah.\" Nabi (ﷺ) menjawab, \"Lontarlah Jamrah (sekarang) dan tidak mengapa.\" Orang lain bertanya, \"Wahai Rasulullah (ﷺ)! Saya telah mencukur kepala saya sebelum menyembelih binatang korban.\" Nabi (ﷺ) menjawab, \"Sembelihlah (sekarang) dan tidak mengapa.\" Maka pada hari itu, apabila Nabi (ﷺ) ditanya tentang apa-apa sahaja berkenaan dengan upacara Haji yang dilakukan sebelum atau selepas waktunya, jawapan baginda adalah, \"Lakukanlah (sekarang) dan tidak mengapa.\""
  },
  {
    "id": 125,
    "hadith_number": 125,
    "tajuk_hadith": "Pertanyaan Yahudi tentang Roh dan Jawapan Nabi Muhammad SAW",
    "perawi_melayu": "Diriwayatkan oleh Abdullah:",
    "english_text": "While I was going with the Prophet (ﷺ) through the ruins of Medina and he was reclining on a date-palm \nleaf stalk, some Jews passed by. Some of them said to the others: Ask him (the Prophet) about the \nspirit. Some of them said that they should not ask him that question as he might give a reply which \nwould displease them. But some of them insisted on asking, and so one of them stood up and asked, \n\"O Abul-Qasim ! What is the spirit?\" The Prophet (ﷺ) remained quiet. I thought he was being inspired \nDivinely. So I stayed till that state of the Prophet (while being inspired) was over. The Prophet (ﷺ) then \nsaid, \"And they ask you (O Muhammad) concerning the spirit --Say: The spirit -- its knowledge is \nwith my Lord. And of knowledge you (mankind) have been given only a little).\" (17.85)",
    "arabic_text": "حَدَّثَنَا قَيْسُ بْنُ حَفْصٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ حَدَّثَنَا الأَعْمَشُ، سُلَيْمَانُ عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ بَيْنَا أَنَا أَمْشِي، مَعَ النَّبِيِّ صلى الله عليه وسلم فِي خَرِبِ الْمَدِينَةِ، وَهُوَ يَتَوَكَّأُ عَلَى عَسِيبٍ مَعَهُ، فَمَرَّ بِنَفَرٍ مِنَ الْيَهُودِ، فَقَالَ بَعْضُهُمْ لِبَعْضٍ سَلُوهُ عَنِ الرُّوحِ‏.‏ وَقَالَ بَعْضُهُمْ لاَ تَسْأَلُوهُ لاَ يَجِيءُ فِيهِ بِشَىْءٍ تَكْرَهُونَهُ‏.‏ فَقَالَ بَعْضُهُمْ لَنَسْأَلَنَّهُ‏.‏ فَقَامَ رَجُلٌ مِنْهُمْ فَقَالَ يَا أَبَا الْقَاسِمِ، مَا الرُّوحُ فَسَكَتَ‏.‏ فَقُلْتُ إِنَّهُ يُوحَى إِلَيْهِ‏.‏ فَقُمْتُ، فَلَمَّا انْجَلَى عَنْهُ، قَالَ ‏{‏وَيَسْأَلُونَكَ عَنِ الرُّوحِ قُلِ الرُّوحُ مِنْ أَمْرِ رَبِّي وَمَا أُوتُيتُمْ مِنَ الْعِلْمِ إِلاَّ قَلِيلاً‏}‏‏.‏ قَالَ الأَعْمَشُ هَكَذَا فِي قِرَاءَتِنَا‏.‏",
    "malay_translation": "Ketika saya berjalan bersama Nabi (ﷺ) melalui runtuhan Madinah dan Baginda bersandar pada pelepah daun kurma, beberapa orang Yahudi lalu. Sebahagian daripada mereka berkata kepada yang lain: Tanyalah dia (Nabi) tentang roh. Sebahagian daripada mereka berkata bahawa mereka tidak sepatutnya menanyakan soalan itu kerana Baginda mungkin memberi jawapan yang akan membuat mereka tidak senang. Tetapi sebahagian daripada mereka berkeras untuk bertanya, dan seorang daripada mereka berdiri dan bertanya, \"Wahai Abul-Qasim! Apakah roh itu?\" Nabi (ﷺ) terdiam. Saya menyangka Baginda sedang menerima wahyu. Jadi saya menunggu sehingga keadaan Nabi (ketika menerima wahyu) itu selesai. Nabi (ﷺ) kemudian bersabda, \"Dan mereka bertanya kepadamu (wahai Muhammad) tentang roh. Katakanlah: Roh itu adalah urusan Tuhanku, dan kamu tidak diberikan ilmu melainkan sedikit sahaja.\" (17:85)"
  },
  {
    "id": 126,
    "hadith_number": 126,
    "tajuk_hadith": "Hasrat Nabi ﷺ Membina Dua Pintu di Kaabah Jika Bukan Kerana Keadaan Masyarakat",
    "perawi_melayu": "Diriwayatkan oleh Aswad:",
    "english_text": "Ibn Az-Zubair said to me, \"Aisha used to tell you secretly a number of things. What did she tell you \nabout the Ka`ba?\" I replied, \"She told me that once the Prophet (ﷺ) said, 'O `Aisha! Had not your people \nbeen still close to the pre-Islamic period of ignorance (infidelity)! I would have dismantled the Ka`ba \nand would have made two doors in it; one for entrance and the other for exit.\" Later on Ibn Az-Zubair \ndid the same.",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ، قَالَ قَالَ لِي ابْنُ الزُّبَيْرِ كَانَتْ عَائِشَةُ تُسِرُّ إِلَيْكَ كَثِيرًا فَمَا حَدَّثَتْكَ فِي الْكَعْبَةِ قُلْتُ قَالَتْ لِي قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ يَا عَائِشَةُ، لَوْلاَ قَوْمُكِ حَدِيثٌ عَهْدُهُمْ ـ قَالَ ابْنُ الزُّبَيْرِ بِكُفْرٍ ـ لَنَقَضْتُ الْكَعْبَةَ فَجَعَلْتُ لَهَا بَابَيْنِ باب يَدْخُلُ النَّاسُ، وَبَابٌ يَخْرُجُونَ ‏\"‏‏.‏ فَفَعَلَهُ ابْنُ الزُّبَيْرِ‏.‏",
    "malay_translation": "Ibnu Az-Zubair berkata kepadaku, \"Aisyah sering memberitahumu banyak perkara secara rahsia. Apa yang dia beritahu kepadamu tentang Kaabah?\" Saya menjawab, \"Dia memberitahu saya bahawa suatu ketika Nabi ﷺ bersabda, 'Wahai Aisyah! Sekiranya kaummu tidaklah baru sahaja meninggalkan zaman jahiliyah (kekufuran), nescaya aku akan meruntuhkan Kaabah dan akan membuat dua pintu padanya; satu untuk masuk dan satu lagi untuk keluar.'\" Kemudian Ibnu Az-Zubair melakukan perkara yang sama."
  },
  {
    "id": 127,
    "hadith_number": 127,
    "tajuk_hadith": "Kenyataan Saidina Ali RA",
    "perawi_melayu": "Diriwayatkan daripada Abu at-Tufail:",
    "english_text": "The above mentioned Statement of `Ali.",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ مَعْرُوفِ بْنِ خَرَّبُوذٍ عَنْ أَبِي الطُّفَيْلِ عَنْ عَلِيٍّ بِذَلِكَ‏.‏",
    "malay_translation": "Kenyataan Saidina Ali RA seperti yang tersebut di atas."
  },
  {
    "id": 128,
    "hadith_number": 128,
    "tajuk_hadith": "Keutamaan Mengucap Syahadat dengan Ikhlas",
    "perawi_melayu": "Diriwayatkan oleh Anas bin Malik:",
    "english_text": "\"Once Mu`adh was along with Allah's Messenger (ﷺ) as a companion rider. Allah's Messenger (ﷺ) said, \"O Mu`adh \nbin Jabal.\" Mu`adh replied, \"Labbaik and Sa`daik. O Allah's Messenger (ﷺ)!\" Again the Prophet (ﷺ) said, \"O \nMu`adh!\" Mu`adh said thrice, \"Labbaik and Sa`daik, O Allah's Messenger (ﷺ)!\" Allah's Messenger (ﷺ) said, \"There \nis none who testifies sincerely that none has the right to be worshipped but Allah and Muhammad is \nhis Apostle, except that Allah, will save him from the Hell-fire.\" Mu`adh said, \"O Allah's Messenger (ﷺ) ! \nShould I not inform the people about it so that they may have glad tidings?\" He replied, \"When the \npeople hear about it, they will solely depend on it.\" Then Mu`adh narrated the above-mentioned \nHadith just before his death, being afraid of committing sin (by not telling the knowledge).",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، قَالَ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم وَمُعَاذٌ رَدِيفُهُ عَلَى الرَّحْلِ قَالَ ‏\"‏ يَا مُعَاذُ بْنَ جَبَلٍ ‏\"‏‏.‏ قَالَ لَبَّيْكَ يَا رَسُولَ اللَّهِ وَسَعْدَيْكَ‏.‏ قَالَ ‏\"‏ يَا مُعَاذُ ‏\"‏‏.‏ قَالَ لَبَّيْكَ يَا رَسُولَ اللَّهِ وَسَعْدَيْكَ‏.‏ ثَلاَثًا‏.‏ قَالَ ‏\"‏ مَا مِنْ أَحَدٍ يَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ صِدْقًا مِنْ قَلْبِهِ إِلاَّ حَرَّمَهُ اللَّهُ عَلَى النَّارِ ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ، أَفَلاَ أُخْبِرُ بِهِ النَّاسَ فَيَسْتَبْشِرُوا قَالَ ‏\"‏ إِذًا يَتَّكِلُوا ‏\"‏‏.‏ وَأَخْبَرَ بِهَا مُعَاذٌ عِنْدَ مَوْتِهِ تَأَثُّمًا ‏.‏",
    "malay_translation": "Pada suatu ketika, Mu'adh bersama Rasulullah (ﷺ) sebagai penunggang yang dibonceng. Rasulullah (ﷺ) bersabda, \"Wahai Mu'adh bin Jabal.\" Mu'adh menjawab, \"Labbaik wa Sa'daik, wahai Rasulullah (ﷺ)!\" Nabi (ﷺ) bersabda lagi, \"Wahai Mu'adh!\" Mu'adh berkata tiga kali, \"Labbaik wa Sa'daik, wahai Rasulullah (ﷺ)!\" Rasulullah (ﷺ) bersabda, \"Tidak ada seorang pun yang bersaksi dengan ikhlas bahawa tidak ada Tuhan yang berhak disembah melainkan Allah dan Muhammad adalah utusan-Nya, kecuali Allah akan menyelamatkannya dari api neraka.\" Mu'adh berkata, \"Wahai Rasulullah (ﷺ)! Tidakkah aku perlu memberitahu orang ramai tentang hal ini supaya mereka bergembira?\" Baginda menjawab, \"Jika orang ramai mendengarnya, mereka hanya akan bergantung kepadanya.\" Kemudian Mu'adh meriwayatkan Hadith yang disebutkan di atas sejurus sebelum kematiannya, kerana takut melakukan dosa (dengan tidak menyampaikan ilmu tersebut)."
  },
  {
    "id": 129,
    "hadith_number": 129,
    "tajuk_hadith": "Ganjaran bagi Mereka yang Tidak Mensyirikkan Allah",
    "perawi_melayu": "Diriwayatkan oleh Anas:",
    "english_text": "I was informed that the Prophet (ﷺ) had said to Mu`adh, \"Whosoever will meet Allah without associating \nanything in worship with Him will go to Paradise.\" Mu`adh asked the Prophet, \"Should I not inform \nthe people of this good news?\" The Prophet (ﷺ) replied, \"No, I am afraid, lest they should depend upon it \n(absolutely).",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ أَبِي قَالَ، سَمِعْتُ أَنَسًا، قَالَ ذُكِرَ لِي أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لِمُعَاذٍ ‏\"‏ مَنْ لَقِيَ اللَّهَ لاَ يُشْرِكُ بِهِ شَيْئًا دَخَلَ الْجَنَّةَ ‏\"‏‏.‏ قَالَ أَلاَ أُبَشِّرُ النَّاسَ قَالَ ‏\"‏ لاَ، إِنِّي أَخَافُ أَنْ يَتَّكِلُوا ‏\"‏‏.‏",
    "malay_translation": "Saya dimaklumkan bahawa Nabi (ﷺ) telah bersabda kepada Mu'adh, \"Sesiapa yang bertemu Allah tanpa menyekutukan sesuatu pun dengan-Nya dalam ibadah, akan masuk Syurga.\" Mu'adh bertanya kepada Nabi, \"Bolehkah saya memberitahu orang ramai tentang berita baik ini?\" Nabi (ﷺ) menjawab, \"Jangan, aku khuatir mereka akan bergantung kepadanya (sepenuhnya).\""
  },
  {
    "id": 130,
    "hadith_number": 130,
    "tajuk_hadith": "Mandi Wajib Selepas Mimpi Basah Bagi Wanita",
    "perawi_melayu": "Diriwayatkan oleh Ummu Salamah:",
    "english_text": "Um-Sulaim came to Allah's Messenger (ﷺ) and said, \"Verily, Allah is not shy of (telling you) the truth. Is it \nnecessary for a woman to take a bath after she has a wet dream (nocturnal sexual discharge?) The \nProphet replied, \"Yes, if she notices a discharge.\" Um Salama, then covered her face and asked, \"O \nAllah's Messenger (ﷺ)! Does a woman get a discharge?\" He replied, \"Yes, let your right hand be in dust (An \nArabic expression you say to a person when you contradict his statement meaning \"you will not \nachieve goodness\"), and that is why the son resembles his mother.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ أَخْبَرَنَا أَبُو مُعَاوِيَةَ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ ابْنَةِ أُمِّ سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ جَاءَتْ أُمُّ سُلَيْمٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ لاَ يَسْتَحْيِي مِنَ الْحَقِّ، فَهَلْ عَلَى الْمَرْأَةِ مِنْ غُسْلٍ إِذَا احْتَلَمَتْ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِذَا رَأَتِ الْمَاءَ ‏\"‏‏.‏ فَغَطَّتْ أُمُّ سَلَمَةَ ـ تَعْنِي وَجْهَهَا ـ وَقَالَتْ يَا رَسُولَ اللَّهِ وَتَحْتَلِمُ الْمَرْأَةُ قَالَ ‏\"‏ نَعَمْ تَرِبَتْ يَمِينُكِ فَبِمَ يُشْبِهُهَا وَلَدُهَا ‏\"‏‏.‏",
    "malay_translation": "Ummu Sulaim datang kepada Rasulullah (ﷺ) dan berkata, \"Sesungguhnya, Allah tidak malu (untuk memberitahu kamu) kebenaran. Adakah wajib bagi seorang wanita untuk mandi wajib setelah dia mengalami mimpi basah (pengeluaran air mani pada waktu malam)?\" Nabi (ﷺ) menjawab, \"Ya, jika dia melihat ada keluar air mani.\" Ummu Salamah kemudian menutup wajahnya dan bertanya, \"Wahai Rasulullah (ﷺ)! Adakah seorang wanita mengalami pengeluaran air mani?\" Baginda menjawab, \"Ya, *taribat yaminuki* (ungkapan Arab yang diucapkan kepada seseorang apabila kamu menyanggah kenyataannya yang bermaksud \"kamu tidak akan mencapai kebaikan\"), dan itulah sebabnya anak itu menyerupai ibunya.\""
  },
  {
    "id": 131,
    "hadith_number": 131,
    "tajuk_hadith": "Perumpamaan Pokok Kurma dengan Seorang Muslim",
    "perawi_melayu": "Diriwayatkan oleh Abdullah bin Umar:",
    "english_text": "Once Allah's Messenger (ﷺ) said, \"Amongst the trees there is a tree, the leaves of which do not fall and is \nlike a Muslim, tell me the name of that tree.\" Everybody started thinking about the trees of the desert \nareas and I thought of the date-palm tree but felt shy (to answer). The others asked, \"O Allah's \nApostle! inform us of it.\" He replied, \"it is the date-palm tree.\" I told my father what had come to my \nmind and on that he said, \"Had you said it I would have preferred it to such and such a thing that I \nmight possess.\"",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ مِنَ الشَّجَرِ شَجَرَةً لاَ يَسْقُطُ وَرَقُهَا، وَهِيَ مَثَلُ الْمُسْلِمِ، حَدِّثُونِي مَا هِيَ ‏\"‏‏.‏ فَوَقَعَ النَّاسُ فِي شَجَرِ الْبَادِيَةِ، وَوَقَعَ فِي نَفْسِي أَنَّهَا النَّخْلَةُ‏.‏ قَالَ عَبْدُ اللَّهِ فَاسْتَحْيَيْتُ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ، أَخْبِرْنَا بِهَا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هِيَ النَّخْلَةُ ‏\"‏‏.‏ قَالَ عَبْدُ اللَّهِ فَحَدَّثْتُ أَبِي بِمَا وَقَعَ فِي نَفْسِي فَقَالَ لأَنْ تَكُونَ قُلْتَهَا أَحَبُّ إِلَىَّ مِنْ أَنْ يَكُونَ لِي كَذَا وَكَذَا‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda, \"Di antara pepohon, ada sebatang pohon yang daunnya tidak gugur dan ia seperti seorang Muslim. Beritahulah Aku, apakah nama pohon itu?\" Semua orang mula memikirkan tentang pepohon di kawasan gurun dan aku terfikir tentang pokok kurma tetapi berasa malu (untuk menjawab). Yang lain bertanya, \"Wahai Rasulullah! Beritahulah kami tentangnya.\" Baginda menjawab, \"Ia adalah pokok kurma.\" Aku memberitahu ayahku apa yang terlintas di fikiranku dan dia berkata, \"Sekiranya engkau mengatakannya, ia lebih aku sukai daripada memiliki itu dan ini.\""
  },
  {
    "id": 132,
    "hadith_number": 132,
    "tajuk_hadith": "Wuduk Selepas Keluar Air Mazi",
    "perawi_melayu": "Diriwayatkan oleh `Ali:",
    "english_text": "I used to get the emotional urethral discharge frequently so I requested Al-Miqdad to ask the Prophet (ﷺ) \nabout it. Al-Miqdad asked him and he replied, \"One has to perform ablution (after it).\" (See Hadith \nNo. 269).",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ، عَنِ الأَعْمَشِ، عَنْ مُنْذِرٍ الثَّوْرِيِّ، عَنْ مُحَمَّدٍ ابْنِ الْحَنَفِيَّةِ، عَنْ عَلِيٍّ، قَالَ كُنْتُ رَجُلاً مَذَّاءً فَأَمَرْتُ الْمِقْدَادَ أَنْ يَسْأَلَ النَّبِيَّ صلى الله عليه وسلم فَسَأَلَهُ فَقَالَ ‏\n\"‏ فِيهِ الْوُضُوءُ ‏\"‏‏.‏",
    "malay_translation": "Saya dahulunya sering mengalami keluar air mazi (cecair urethral yang keluar disebabkan rangsangan). Oleh itu, saya meminta Al-Miqdad untuk bertanya kepada Nabi (ﷺ) tentang perkara ini. Al-Miqdad bertanya kepada baginda, dan baginda menjawab, \"Seseorang perlu melakukan wuduk (selepas itu).\" (Lihat Hadith No. 269)."
  },
  {
    "id": 133,
    "hadith_number": 133,
    "tajuk_hadith": "Tempat Miqat untuk Penduduk Madinah, Syam, Najd dan Yaman",
    "perawi_melayu": "Diriwayatkan oleh Nafi':",
    "english_text": "`Abdullah bin `Umar said: \"A man got up in the mosque and said: O Allah's Messenger (ﷺ) 'At which place \nyou order us that we should assume the Ihram?' Allah's Messenger (ﷺ) replied, 'The residents of Medina \nshould assure the Ihram from Dhil-Hulaifa, the people of Syria from Al-Juhfa and the people of Najd \nfrom Qarn.\" Ibn `Umar further said, \"The people consider that Allah's Messenger (ﷺ) had also said, 'The \nresidents of Yemen should assume Ihram from Yalamlam.' \" Ibn `Umar used to say, \"I do not: \nremember whether Allah's Messenger (ﷺ) had said the last statement or not?\"",
    "arabic_text": "حَدَّثَنِي قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ، قَالَ حَدَّثَنَا نَافِعٌ، مَوْلَى عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ،‏.‏ أَنَّ رَجُلاً، قَامَ فِي الْمَسْجِدِ فَقَالَ يَا رَسُولَ اللَّهِ، مِنْ أَيْنَ تَأْمُرُنَا أَنْ نُهِلَّ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يُهِلُّ أَهْلُ الْمَدِينَةِ مِنْ ذِي الْحُلَيْفَةِ، وَيُهِلُّ أَهْلُ الشَّأْمِ مِنَ الْجُحْفَةِ، وَيُهِلُّ أَهْلُ نَجْدٍ مِنْ قَرْنٍ ‏\"‏‏.‏ وَقَالَ ابْنُ عُمَرَ وَيَزْعُمُونَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ وَيُهِلُّ أَهْلُ الْيَمَنِ مِنْ يَلَمْلَمَ ‏\"‏‏.‏ وَكَانَ ابْنُ عُمَرَ يَقُولُ لَمْ أَفْقَهْ هَذِهِ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
    "malay_translation": "`Abdullah bin `Umar berkata: \"Seorang lelaki bangun di masjid dan berkata: Wahai Rasulullah (ﷺ), 'Di manakah tempat yang engkau perintahkan kami untuk berniat ihram?' Rasulullah (ﷺ) menjawab, 'Penduduk Madinah hendaklah berniat ihram dari Zulhulaifah, penduduk Syam dari Al-Juhfah, dan penduduk Najd dari Qarn.'\" Ibn `Umar selanjutnya berkata, \"Orang ramai beranggapan bahawa Rasulullah (ﷺ) juga bersabda, 'Penduduk Yaman hendaklah berniat ihram dari Yalamlam.'\" Ibn `Umar selalu berkata, \"Saya tidak ingat sama ada Rasulullah (ﷺ) telah mengucapkan pernyataan terakhir itu atau tidak?\""
  },
  {
    "id": 134,
    "hadith_number": 134,
    "tajuk_hadith": "Pakaian yang Dilarang bagi Muhrim",
    "perawi_melayu": "Diriwayatkan oleh Ibn `Umar:",
    "english_text": "A man asked the Prophet (ﷺ) : \"What (kinds of clothes) should a Muhrim (a Muslim intending to perform \n`Umra or Hajj) wear? He replied, \"He should not wear a shirt, a turban, trousers, a head cloak or \ngarment scented with saffron or Wars (kinds of perfumes). And if he has no slippers, then he can use \nKhuffs (socks made from thick fabric or leather) but the socks should be cut short so as to make the \nankles bare.\" (See Hadith No. 615, Vol. 2).",
    "arabic_text": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَعَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَجُلاً سَأَلَهُ مَا يَلْبَسُ الْمُحْرِمُ فَقَالَ ‏\n\"‏ لاَ يَلْبَسِ الْقَمِيصَ وَلاَ الْعِمَامَةَ وَلاَ السَّرَاوِيلَ وَلاَ الْبُرْنُسَ وَلاَ ثَوْبًا مَسَّهُ الْوَرْسُ أَوِ الزَّعْفَرَانُ، فَإِنْ لَمْ يَجِدِ النَّعْلَيْنِ فَلْيَلْبَسِ الْخُفَّيْنِ وَلْيَقْطَعْهُمَا حَتَّى يَكُونَا تَحْتَ الْكَعْبَيْنِ ‏\"‏‏.‏",
    "malay_translation": "Seorang lelaki bertanya kepada Nabi (ﷺ): \"Apakah (jenis pakaian) yang patut dipakai oleh seorang Muhrim (seorang Muslim yang berniat untuk mengerjakan Umrah atau Haji)?\" Baginda menjawab, \"Dia tidak boleh memakai baju, serban, seluar, penutup kepala, atau pakaian yang berbau wangi-wangian seperti za'faran atau Wars (sejenis pewangi). Dan jika dia tidak mempunyai selipar, maka dia boleh menggunakan Khuff (stoking yang diperbuat daripada kain tebal atau kulit), tetapi stoking itu hendaklah dipotong pendek sehingga menampakkan buku lali.\" (Lihat Hadith No. 615, Jilid 2)."
  }
]