[
  {
    "id": 5557,
    "hadith_number": 5557,
    "tajuk_hadith": "Allah SWT Tidak Akan Melihat Orang yang Menyeret Pakaiannya kerana Takabbur",
    "perawi_melayu": "Riwayat Abdullah bin Umar:",
    "english_text": "Allah's Messenger (ﷺ) said, 'Allah will not look at the person who drags his garment (behind him) out of conceit.'",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، وَعَبْدِ اللَّهِ بْنِ دِينَارٍ، وَزَيْدِ بْنِ أَسْلَمَ، يُخْبِرُونَهُ عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَنْظُرُ اللَّهُ إِلَى مَنْ جَرَّ ثَوْبَهُ خُيَلاَءَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Allah SWT tidak akan melihat orang yang menyeret pakaiannya kerana takabbur.\""
  },
  {
    "id": 5558,
    "hadith_number": 5558,
    "tajuk_hadith": "Larangan Menjerebu Jubah kerana Takabbur",
    "perawi_melayu": "Daripada Abdullah bin Umar",
    "english_text": "The Prophet (ﷺ) said Allah will not look, on the Day of Resurrection at the person who drags his garment \n(behind him) out of conceit. On that Abu Bakr said, \"O Allah's Messenger (ﷺ)! One side of my Izar hangs \nlow if I do not take care of it.\" The Prophet (ﷺ) said, 'You are not one of those who do that out of conceit.\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ جَرَّ ثَوْبَهُ خُيَلاَءَ لَمْ يَنْظُرِ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏ قَالَ أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ إِنَّ أَحَدَ شِقَّىْ إِزَارِي يَسْتَرْخِي، إِلاَّ أَنْ أَتَعَاهَدَ ذَلِكَ مِنْهُ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَسْتَ مِمَّنْ يَصْنَعُهُ خُيَلاَءَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Sesiapa yang menjerebu pakaiannya kerana takabbur, maka Allah SWT tidak akan memandangnya pada hari kiamat.\"  Abu Bakar berkata: \"Wahai Rasulullah, salah satu bahagian izar saya akan terjurai jika saya tidak menjaganya.\" Rasulullah SAW bersabda: \"Kamu bukanlah daripada golongan yang berbuat demikian kerana takabbur.\""
  },
  {
    "id": 5559,
    "hadith_number": 5559,
    "tajuk_hadith": "Gerhana Matahari dan Solat Sunat",
    "perawi_melayu": "Riwayat Abu Bakar",
    "english_text": "The solar eclipse occurred while we were sitting with the Prophet (ﷺ) He got up dragging his garment (on \nthe ground) hurriedly till he reached the mosque The people turned (to the mosque) and he offered a \ntwo-rak`at prayer whereupon the eclipse was over and he traced us and said, \"The sun and the moon \nare two signs among the signs of Allah, so if you see a thing like this (eclipse) then offer the prayer \nand invoke Allah till He remove that state.\"",
    "arabic_text": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا عَبْدُ الأَعْلَى، عَنْ يُونُسَ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ ـ رضى الله عنه ـ قَالَ خَسَفَتِ الشَّمْسُ وَنَحْنُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَامَ يَجُرُّ ثَوْبَهُ مُسْتَعْجِلاً، حَتَّى أَتَى الْمَسْجِدَ وَثَابَ النَّاسُ فَصَلَّى رَكْعَتَيْنِ، فَجُلِّيَ عَنْهَا، ثُمَّ أَقْبَلَ عَلَيْنَا وَقَالَ ‏\n\"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ، فَإِذَا رَأَيْتُمْ مِنْهَا شَيْئًا فَصَلُّوا وَادْعُوا اللَّهَ حَتَّى يَكْشِفَهَا ‏\"‏‏.‏",
    "malay_translation": "Telah berlaku gerhana matahari ketika kami duduk bersama Nabi SAW. Baginda bangun sambil menyeret pakaian Baginda dengan tergesa-gesa sehingga sampai ke masjid.  Orang ramai turut bergegas ke masjid, lalu Baginda menunaikan solat dua rakaat. Kemudian gerhana itu hilang.  Setelah itu, Baginda menghadap kami dan bersabda:  \"Sesungguhnya matahari dan bulan adalah dua tanda daripada tanda-tanda Allah.  Oleh itu, jika kamu melihat sesuatu seperti ini (gerhana), maka solatlah dan berdoalah kepada Allah sehingga Allah menghilangkannya.\""
  },
  {
    "id": 5560,
    "hadith_number": 5560,
    "tajuk_hadith": "Solat Nabi SAW di Belakang Tiang",
    "perawi_melayu": "Riwayat Abu Juhaifa:",
    "english_text": "I saw Bilal bringing a short spear (or stick) and fixing it in the ground, and then he proclaimed the \nIqama of the prayer, and I saw Allah's Messenger (ﷺ) coming out, wearing a cloak with its sleeves rolled up. \nHe then offered a two-rak`at prayer while facing the stick, and I saw the people and animals passing in \nfront of him beyond the stick.",
    "arabic_text": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا ابْنُ شُمَيْلٍ، أَخْبَرَنَا عُمَرُ بْنُ أَبِي زَائِدَةَ، أَخْبَرَنَا عَوْنُ بْنُ أَبِي جُحَيْفَةَ، عَنْ أَبِيهِ أَبِي جُحَيْفَةَ، قَالَ فَرَأَيْتُ بِلاَلاً جَاءَ بِعَنَزَةٍ فَرَكَزَهَا، ثُمَّ أَقَامَ الصَّلاَةَ، فَرَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ فِي حُلَّةٍ مُشَمِّرًا، فَصَلَّى رَكْعَتَيْنِ إِلَى الْعَنَزَةِ، وَرَأَيْتُ النَّاسَ وَالدَّوَابَّ يَمُرُّونَ بَيْنَ يَدَيْهِ مِنْ وَرَاءِ الْعَنَزَةِ‏.‏",
    "malay_translation": "Aku melihat Bilal membawa sebatang kayu pendek (atau tombak) dan menancapkannya ke tanah, kemudian Bilal melaungkan iqamah solat.  Aku melihat Rasulullah SAW keluar dengan memakai jubah yang lengannya dilipat. Baginda kemudian menunaikan solat dua rakaat menghadap kayu tersebut, dan aku melihat orang ramai dan binatang melintas di hadapan Baginda di belakang kayu itu."
  },
  {
    "id": 5561,
    "hadith_number": 5561,
    "tajuk_hadith": "Izar yang Melebihi Pergelangan Kaki",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \"The part of an Izar which hangs below the ankles is in the Fire.\"",
    "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي سَعِيدٍ الْمَقْبُرِيُّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا أَسْفَلَ مِنَ الْكَعْبَيْنِ مِنَ الإِزَارِ فَفِي النَّارِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Sebahagian daripada kain izar yang melebihi pergelangan kaki adalah di dalam neraka.\""
  },
  {
    "id": 5562,
    "hadith_number": 5562,
    "tajuk_hadith": "Allah SWT Tidak Akan Melihat Orang Yang Memakai Izar Dengan Sombong Pada Hari Kiamat",
    "perawi_melayu": "Dari Abu Hurairah",
    "english_text": "Allah's Messenger (ﷺ), \"Allah will not look, on the Day of Resurrection, at a person who drags his Izar \n(behind him) out of pride and arrogance.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَنْظُرُ اللَّهُ يَوْمَ الْقِيَامَةِ إِلَى مَنْ جَرَّ إِزَارَهُ بَطَرًا ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Allah SWT tidak akan melihat pada hari kiamat kepada orang yang menyeret kain izarnya kerana takbur (sombong).\""
  },
  {
    "id": 5563,
    "hadith_number": 5563,
    "tajuk_hadith": "Keangkuhan dan Azab Allah",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "The Prophet (or 'Abul Qasim) said, \"While a man was walking, clad in a two-piece garment and proud of himself with his hair well-combed, suddenly Allah made him sink into the earth and he will go on sinking into it till the Day of Resurrection.",
    "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ النَّبِيُّ ـ أَوْ قَالَ أَبُو الْقَاسِمِ ـ صلى الله عليه وسلم ‏\n\"‏ بَيْنَمَا رَجُلٌ يَمْشِي فِي حُلَّةٍ، تُعْجِبُهُ نَفْسُهُ مُرَجِّلٌ جُمَّتَهُ، إِذْ خَسَفَ اللَّهُ بِهِ، فَهْوَ يَتَجَلَّلُ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏‏.‏",
    "malay_translation": "Nabi SAW (atau Abu Qasim) bersabda:  \"Ketika seorang lelaki sedang berjalan dengan memakai pakaian yang indah, berasa bangga dengan dirinya sendiri dan rambutnya tersisir rapi, tiba-tiba Allah SWT menenggelamkannya ke dalam bumi, dan dia akan terus tenggelam sehingga Hari Kiamat.\""
  },
  {
    "id": 5564,
    "hadith_number": 5564,
    "tajuk_hadith": "Azab Bagi Mereka Yang Menyeret Pakaian",
    "perawi_melayu": "Abdullah bin Umar",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ أَبَاهُ، حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ بَيْنَا رَجُلٌ يَجُرُّ إِزَارَهُ، خُسِفَ بِهِ، فَهْوَ يَتَجَلَّلُ فِي الأَرْضِ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏‏.‏ تَابَعَهُ يُونُسُ عَنِ الزُّهْرِيِّ‏.‏ وَلَمْ يَرْفَعْهُ شُعَيْبٌ عَنِ الزُّهْرِيِّ‏.‏ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، أَخْبَرَنَا أَبِي، عَنْ عَمِّهِ، جَرِيرِ بْنِ زَيْدٍ قَالَ كُنْتُ مَعَ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَلَى باب دَارِهِ فَقَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، سَمِعَ النَّبِيَّ صلى الله عليه وسلم نَحْوَهُ‏.‏",
    "malay_translation": "Daripada Said bin Ufair, beliau berkata: Telah menceritakan kepadaku Laits, beliau berkata: Telah menceritakan kepadaku Abdur Rahman bin Khalid, daripada Ibnu Syihab, daripada Salim bin Abdullah, bahawa bapanya telah menceritakan kepadanya bahawa Rasulullah SAW bersabda:  \"Ketika seseorang lelaki itu menarik kain sarungnya di atas bumi, maka dia telah ditenggelamkan ke dalam bumi dan dia akan terus tenggelam di dalamnya sehingga hari kiamat.\" Yunus turut meriwayatkannya daripada Zuhri.  Syuaib pula tidak meriwayatkannya daripada Zuhri. Abdullah bin Muhammad telah menceritakan kepadaku, telah menceritakan kepada kami Wahb bin Jarir, telah memberitakan kepada kami bapaku, daripada bapa saudaranya, Jarir bin Zaid, beliau berkata: Aku berada bersama Salim bin Abdullah bin Umar di pintu rumahnya, maka Salim berkata: Aku telah mendengar Abu Hurairah mendengar Nabi SAW menyebut perkara yang hampir sama."
  },
  {
    "id": 5565,
    "hadith_number": 5565,
    "tajuk_hadith": "Menjerebu Pakaian Kerana Takbur",
    "perawi_melayu": "Riwayat Abdullah bin Umar",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مَطَرُ بْنُ الْفَضْلِ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا شُعْبَةُ، قَالَ لَقِيتُ مُحَارِبَ بْنَ دِثَارٍ عَلَى فَرَسٍ وَهْوَ يَأْتِي مَكَانَهُ الَّذِي يَقْضِي فِيهِ فَسَأَلْتُهُ عَنْ هَذَا الْحَدِيثِ فَحَدَّثَنِي فَقَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ جَرَّ ثَوْبَهُ مَخِيلَةً، لَمْ يَنْظُرِ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏ فَقُلْتُ لِمُحَارِبٍ أَذَكَرَ إِزَارَهُ قَالَ مَا خَصَّ إِزَارًا وَلاَ قَمِيصًا‏.‏ تَابَعَهُ جَبَلَةُ بْنُ سُحَيْمٍ وَزَيْدُ بْنُ أَسْلَمَ وَزَيْدُ بْنُ عَبْدِ اللَّهِ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ اللَّيْثُ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ مِثْلَهُ‏.‏ وَتَابَعَهُ مُوسَى بْنُ عُقْبَةَ وَعُمَرُ بْنُ مُحَمَّدٍ وَقُدَامَةُ بْنُ مُوسَى عَنْ سَالِمٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ مَنْ جَرَّ ثَوْبَهُ ‏\"‏‏.‏",
    "malay_translation": "Daripada Matar bin al-Fazl, telah menceritakan kepada kami Syabahah, telah menceritakan kepada kami Syu’bah, katanya: Aku telah bertemu dengan Muharrib bin Ditsar ketika menunggang kuda menuju ke tempat kediamannya. Lalu aku bertanya kepadanya tentang hadis ini, maka dia menceritakan kepadaku dan berkata: Aku telah mendengar Abdullah bin Umar r.a berkata, Rasulullah s.a.w bersabda: \"Barangsiapa yang menjerebu pakaiannya kerana takbur (keangkuhan), nescaya Allah SWT tidak akan melihatnya pada hari kiamat.\"  Aku bertanya kepada Muharrib, \"Adakah ia menyebut tentang kain sarung?\" Katanya: \"Ia tidak menyebut tentang kain sarung mahupun baju.\"  Jabalah bin Suhaim, Zaid bin Aslam dan Zaid bin Abdullah turut meriwayatkannya daripada Ibnu Umar daripada Nabi s.a.w.  Al-Laits meriwayatkan daripada Nafi’ daripada Ibnu Umar hadis yang sama. Musa bin ‘Uqbah, Umar bin Muhammad dan Qudamah bin Musa turut meriwayatkan daripada Salim daripada Ibnu Umar daripada Nabi s.a.w hadis yang bermaksud:  \"Barangsiapa yang menjerebu pakaiannya…\""
  },
  {
    "id": 5566,
    "hadith_number": 5566,
    "tajuk_hadith": "Perkahwinan dan Talak",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ جَاءَتِ امْرَأَةُ رِفَاعَةَ الْقُرَظِيِّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَأَنَا جَالِسَةٌ وَعِنْدَهُ أَبُو بَكْرٍ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي كُنْتُ تَحْتَ رِفَاعَةَ فَطَلَّقَنِي فَبَتَّ طَلاَقِي، فَتَزَوَّجْتُ بَعْدَهُ عَبْدَ الرَّحْمَنِ بْنَ الزَّبِيرِ، وَإِنَّهُ وَاللَّهِ مَا مَعَهُ يَا رَسُولَ اللَّهِ إِلاَّ مِثْلُ هَذِهِ الْهُدْبَةِ‏.‏ وَأَخَذَتْ هُدْبَةً مِنْ جِلْبَابِهَا، فَسَمِعَ خَالِدُ بْنُ سَعِيدٍ قَوْلَهَا وَهْوَ بِالْبَابِ لَمْ يُؤْذَنْ لَهُ، قَالَتْ فَقَالَ خَالِدٌ يَا أَبَا بَكْرٍ أَلاَ تَنْهَى هَذِهِ عَمَّا تَجْهَرُ بِهِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلاَ وَاللَّهِ مَا يَزِيدُ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى التَّبَسُّمِ، فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَعَلَّكِ تُرِيدِينَ أَنْ تَرْجِعِي إِلَى رِفَاعَةَ، لاَ، حَتَّى يَذُوقَ عُسَيْلَتَكِ وَتَذُوقِي عُسَيْلَتَهُ ‏\"‏‏.‏ فَصَارَ سُنَّةً بَعْدُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Yaman, telah memberitakan kepada kami Syu’aib, dari Az- Zuhri, telah memberitakan kepadaku Urwah bin Az- Zubair, bahawa Aisyah – raḍiyallahu ‘anha – isteri Nabi ṣallallahu ‘alaihi wa sallam berkata: “Datanglah seorang wanita daripada isteri Rifa’ah Al-Qurazi kepada Rasulullah ṣallallahu ‘alaihi wa sallam, ketika aku sedang duduk dan di sisinya ada Abu Bakar.  Lalu wanita itu berkata: ‘Wahai Rasulullah, sesungguhnya aku pernah berada di bawah jagaan Rifa’ah, lalu dia menceraikanku secara tiga kali talak. Kemudian aku berkahwin dengan Abdul Rahman bin Az- Zubair, dan demi Allah, wahai Rasulullah, dia hanya mempunyai sedikit harta seperti ini (sambil menunjukkan hujung kainnya).’ Khalid bin Said mendengar perkataannya, sedang dia berada di pintu dan belum dibenarkan masuk. Lalu Khalid berkata: ‘Wahai Abu Bakar, mengapa engkau tidak melarang wanita ini daripada terus terang berkata-kata seperti itu di hadapan Rasulullah ṣallallahu ‘alaihi wa sallam?’  Tidak demi Allah, Rasulullah ṣallallahu ‘alaihi wa sallam hanya tersenyum sahaja, kemudian baginda berkata kepada wanita itu: ‘Mungkin engkau ingin kembali kepada Rifa’ah? Tidak, sehingga Abdul Rahman merasai nikmatmu dan engkau merasai nikmatnya.’ Kemudian ia menjadi sunnah sesudahnya.”"
  },
  {
    "id": 5567,
    "hadith_number": 5567,
    "tajuk_hadith": "Nabi SAW Memakai Rida dan Mengunjungi Hamza",
    "perawi_melayu": "Riwayat Ali",
    "english_text": "The Prophet (ﷺ) asked for his Rida, put it on and set out walking. Zaid bin Haritha and I followed him till \nhe reached the house where Harnza (bin `Abdul Muttalib) was present and asked for permission to \nenter, and they gave us permission.",
    "arabic_text": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي عَلِيُّ بْنُ حُسَيْنٍ، أَنَّ حُسَيْنَ بْنَ عَلِيٍّ، أَخْبَرَهُ أَنَّ عَلِيًّا ـ رضى الله عنه ـ قَالَ فَدَعَا النَّبِيُّ صلى الله عليه وسلم بِرِدَائِهِ، ثُمَّ انْطَلَقَ يَمْشِي، وَاتَّبَعْتُهُ أَنَا وَزَيْدُ بْنُ حَارِثَةَ، حَتَّى جَاءَ الْبَيْتَ الَّذِي فِيهِ حَمْزَةُ، فَاسْتَأْذَنَ فَأَذِنُوا لَهُمْ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdān, memberitakan kepada kami Abdullah, memberitakan kepada kami Yunus dari Az-Zuhrī, memberitakan kepadaku Ali bin Husain, bahawa Husain bin Ali memberitakan kepadanya bahawa Ali r.a. berkata: Kemudian Nabi SAW meminta jubahnya, lalu Baginda berjalan. Aku dan Zaid bin Haritsah mengikut Baginda sehingga sampai ke rumah yang di dalamnya berada Hamza, lalu Baginda meminta izin untuk masuk dan mereka memberi izin kepada Baginda."
  },
  {
    "id": 5568,
    "hadith_number": 5568,
    "tajuk_hadith": "Pakaian Ihram",
    "perawi_melayu": "Riwayat Ibnu Umar:",
    "english_text": "A man asked, \"O Allah s Apostle What kind of clothes should a Muhrim wear?\" The Prophet, said, \"A \nMuhrim should not wear a shirt, trousers a hooded cloak, or Khuffs (socks made from thick fabric or \nleather) unless he cannot get sandals, in which case he should cut the part (of the Khuff) that covers \nthe ankles.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَجُلاً، قَالَ يَا رَسُولَ اللَّهِ مَا يَلْبَسُ الْمُحْرِمُ مِنَ الثِّيَابِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ يَلْبَسُ الْمُحْرِمُ الْقَمِيصَ، وَلاَ السَّرَاوِيلَ، وَلاَ الْبُرْنُسَ، وَلاَ الْخُفَّيْنِ، إِلاَّ أَنْ لاَ يَجِدَ النَّعْلَيْنِ، فَلْيَلْبَسْ مَا هُوَ أَسْفَلُ مِنَ الْكَعْبَيْنِ ‏\"‏‏.‏",
    "malay_translation": "Seorang lelaki bertanya, \"Wahai Rasulullah, apakah jenis pakaian yang harus dipakai oleh seorang yang berihram?\"  Rasulullah SAW bersabda, \"Orang yang berihram tidak boleh memakai kemeja, seluar, jubah bertopi, atau khuff (stoking daripada kain tebal atau kulit) melainkan jika dia tidak dapat mendapatkan sandal, maka hendaklah dia memotong bahagian khuff yang menutupi buku lali.\""
  },
  {
    "id": 5569,
    "hadith_number": 5569,
    "tajuk_hadith": "Nabi SAW Menziarahi Abdullah bin Ubai",
    "perawi_melayu": "Dari Jabir bin Abdullah:",
    "english_text": "The Prophet (ﷺ) came to visit `Abdullah bin Ubai (bin Salul) after he had been put in his grave. The Prophet (ﷺ) ordered that `Abdullah be taken out. He was taken out and was placed on the knees of the Prophet, who blew his (blessed) breath on him and dressed the body with his own shirt. And Allah knows better.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، أَخْبَرَنَا ابْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ أَتَى النَّبِيُّ صلى الله عليه وسلم عَبْدَ اللَّهِ بْنَ أُبَىٍّ بَعْدَ مَا أُدْخِلَ قَبْرَهُ، فَأَمَرَ بِهِ فَأُخْرِجَ، وَوُضِعَ عَلَى رُكْبَتَيْهِ، وَنَفَثَ عَلَيْهِ مِنْ رِيقِهِ، وَأَلْبَسَهُ قَمِيصَهُ، وَاللَّهُ أَعْلَمُ‏.‏",
    "malay_translation": "Nabi SAW telah melawat Abdullah bin Ubai (bin Salul) selepas beliau dikebumikan. Nabi SAW memerintahkan agar Abdullah dikeluarkan.  Beliau dikeluarkan dan diletakkan di atas riba Nabi SAW, yang kemudian meniupkan nafasnya yang mulia ke atasnya dan mengenakan baju baginda sendiri ke atas jenazah. Dan Allah SWT lebih mengetahui."
  },
  {
    "id": 5570,
    "hadith_number": 5570,
    "tajuk_hadith": "Larangan Solat Jenazah ke atas Orang Munafik",
    "perawi_melayu": "Riwayat Abdullah bin Umar",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا صَدَقَةُ، أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، قَالَ أَخْبَرَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ، قَالَ لَمَّا تُوُفِّيَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ جَاءَ ابْنُهُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَعْطِنِي قَمِيصَكَ أُكَفِّنْهُ فِيهِ، وَصَلِّ عَلَيْهِ، وَاسْتَغْفِرْ لَهُ، فَأَعْطَاهُ قَمِيصَهُ، وَقَالَ ‏\"‏ إِذَا فَرَغْتَ فَآذِنَّا ‏\"‏‏.‏ فَلَمَّا فَرَغَ آذَنَهُ، فَجَاءَ لِيُصَلِّيَ عَلَيْهِ، فَجَذَبَهُ عُمَرُ فَقَالَ أَلَيْسَ قَدْ نَهَاكَ اللَّهُ أَنْ تُصَلِّيَ عَلَى الْمُنَافِقِينَ فَقَالَ ‏{‏اسْتَغْفِرْ لَهُمْ أَوْ لاَ تَسْتَغْفِرْ لَهُمْ إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَنْ يَغْفِرَ اللَّهُ لَهُمْ‏}‏‏.‏ فَنَزَلَتْ ‏{‏وَلاَ تُصَلِّ عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا‏}‏ فَتَرَكَ الصَّلاَةَ عَلَيْهِمْ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Sadakah, telah memberitakan kepada kami Yahya bin Said, dari Ubaidullah, dia berkata; telah memberitakan kepadaku Nafi', dari Abdullah, dia berkata; ketika Abdullah bin Ubay meninggal dunia, anaknya datang kepada Rasulullah SAW lalu berkata, \"Wahai Rasulullah, berikan kepadaku baju kamu supaya aku kafankan ayahku dengannya, dan solatkanlah dia, serta mohonkan ampun baginya.\" Maka Rasulullah SAW memberikan bajunya kepadanya, lalu berkata, \"Apabila kamu selesai, beritahu kami.\"  Maka apabila dia selesai, dia memberitahu baginda. Maka baginda datang untuk men solatkannya, lalu Umar menarik baginda lalu berkata, \"Bukankah Allah telah melarang kamu untuk men solatkan orang-orang munafik? Allah berfirman: (yang bermaksud)  'Dan janganlah engkau (wahai Muhammad) memohon keampunan bagi mereka (orang-orang munafik) atau tidak memohon keampunan bagi mereka (jika engkau memohon keampunan bagi mereka sebanyak tujuh puluh kali, nescaya Allah tidak akan mengampuni mereka.'  Kemudian turun ayat: (yang bermaksud) 'Dan janganlah engkau solatkan sesiapa pun daripada mereka yang mati selama-lamanya'. Maka baginda meninggalkan solat jenazah ke atas mereka."
  },
  {
    "id": 5571,
    "hadith_number": 5571,
    "tajuk_hadith": "Perumpamaan Orang Bakhil dan Dermawan",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "Allah's Messenger (ﷺ) has set forth an example for a miser and a charitable person by comparing them to two \nmen wearing two iron cloaks and their hands are raised to their breasts and necks. Whenever the \ncharitable man tries to give a charitable gift, his iron cloak expands till it becomes so wide that it will \ncover his fingertips and obliterate his tracks And, whenever the miser wants to give a charitable gift, \nhis cloak becomes very tight over him and every ring gets stuck to its place Abu Huraira added; I saw \nAllah's Messenger (ﷺ) putting his finger in the (chest) pocket of his shirt like that If you but saw him trying \nto widen (the opening of his shirt) but it did not widen.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو عَامِرٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ نَافِعٍ، عَنِ الْحَسَنِ، عَنْ طَاوُسٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ ضَرَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَثَلَ الْبَخِيلِ وَالْمُتَصَدِّقِ، كَمَثَلِ رَجُلَيْنِ عَلَيْهِمَا جُبَّتَانِ مِنْ حَدِيدٍ، قَدِ اضْطُرَّتْ أَيْدِيهِمَا إِلَى ثُدِيِّهِمَا وَتَرَاقِيهِمَا، فَجَعَلَ الْمُتَصَدِّقُ كُلَّمَا تَصَدَّقَ بِصَدَقَةٍ انْبَسَطَتْ عَنْهُ حَتَّى تَغْشَى أَنَامِلَهُ وَتَعْفُوَ أَثَرَهُ، وَجَعَلَ الْبَخِيلُ كُلَّمَا هَمَّ بِصَدَقَةٍ قَلَصَتْ، وَأَخَذَتْ كُلُّ حَلْقَةٍ بِمَكَانِهَا‏.‏ قَالَ أَبُو هُرَيْرَةَ فَأَنَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ بِإِصْبَعِهِ هَكَذَا فِي جَيْبِهِ، فَلَوْ رَأَيْتَهُ يُوَسِّعُهَا وَلاَ تَتَوَسَّعُ‏.‏ تَابَعَهُ ابْنُ طَاوُسٍ عَنْ أَبِيهِ وَأَبُو الزِّنَادِ عَنِ الأَعْرَجِ فِي الْجُبَّتَيْنِ‏.‏ وَقَالَ حَنْظَلَةُ سَمِعْتُ طَاوُسًا سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ جُبَّتَانِ‏.‏ وَقَالَ جَعْفَرٌ عَنِ الأَعْرَجِ جُبَّتَانِ‏.‏",
    "malay_translation": "Rasulullah SAW telah memberi contoh tentang orang bakhil dan orang yang suka bersedekah, iaitu seperti dua orang lelaki yang memakai dua jubah besi, tangan mereka terhimpit di dada dan leher. Setiap kali orang yang suka bersedekah itu bersedekah, jubah besi itu akan melonggar sehingga meliputi hujung jari dan menghilangkan kesan (kekurangannya).  Dan setiap kali orang bakhil itu hendak bersedekah, jubahnya akan semakin ketat dan setiap cincin akan tetap di tempatnya. Abu Hurairah menambah, aku melihat Rasulullah SAW memasukkan jarinya ke dalam poket baju seperti itu.  Sekiranya kamu melihat baginda cuba melebarkannya, ia tetap tidak melebarkan."
  },
  {
    "id": 5572,
    "hadith_number": 5572,
    "tajuk_hadith": "Wuduk Nabi SAW Dengan Jubah",
    "perawi_melayu": "Riwayat Al-Mughira bin Shu`ba:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قَيْسُ بْنُ حَفْصٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي أَبُو الضُّحَى، قَالَ حَدَّثَنِي مَسْرُوقٌ، قَالَ حَدَّثَنِي الْمُغِيرَةُ بْنُ شُعْبَةَ، قَالَ انْطَلَقَ النَّبِيُّ صلى الله عليه وسلم لِحَاجَتِهِ ثُمَّ أَقْبَلَ، فَتَلَقَّيْتُهُ بِمَاءٍ، فَتَوَضَّأَ وَعَلَيْهِ جُبَّةٌ شَأْمِيَّةٌ، فَمَضْمَضَ وَاسْتَنْشَقَ وَغَسَلَ وَجْهَهُ، فَذَهَبَ يُخْرِجُ يَدَيْهِ مِنْ كُمَّيْهِ فَكَانَا ضَيِّقَيْنِ، فَأَخْرَجَ يَدَيْهِ مِنْ تَحْتِ الْجُبَّةِ، فَغَسَلَهُمَا وَمَسَحَ بِرَأْسِهِ وَعَلَى خُفَّيْهِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qais bin Hafsh, telah menceritakan kepada kami Abdul Wahid, telah menceritakan kepada kami Al-A’masy, dia berkata telah menceritakan kepadaku Abu Dhuha, dia berkata telah menceritakan kepadaku Masruq, dia berkata telah menceritakan kepadaku Al-Mughirah bin Syu’bah, dia berkata: Nabi SAW pergi untuk membuang hajat, kemudian beliau kembali. Maka aku menyambut baginda dengan air, lalu baginda berwuduk sedangkan baginda memakai jubah dari Syam. Baginda berkumur-kumur, memasukkan air ke dalam hidung dan menghembuskannya, membasuh muka baginda. Kemudian baginda hendak mengeluarkan tangan baginda dari lengan jubah, tetapi ternyata sempit. Maka baginda mengeluarkan tangan baginda dari bawah jubah, lalu membasuhnya dan mengusap kepala dan khuff (kasut) baginda."
  },
  {
    "id": 5573,
    "hadith_number": 5573,
    "tajuk_hadith": "Wuduk Nabi SAW Ketika Musafir",
    "perawi_melayu": "Riwayat Al-Mughira:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا زَكَرِيَّاءُ، عَنْ عَامِرٍ، عَنْ عُرْوَةَ بْنِ الْمُغِيرَةِ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ كُنْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم ذَاتَ لَيْلَةٍ فِي سَفَرٍ فَقَالَ ‏\"‏ أَمَعَكَ مَاءٌ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ فَنَزَلَ عَنْ رَاحِلَتِهِ، فَمَشَى حَتَّى تَوَارَى عَنِّي فِي سَوَادِ اللَّيْلِ، ثُمَّ جَاءَ فَأَفْرَغْتُ عَلَيْهِ الإِدَاوَةَ، فَغَسَلَ وَجْهَهُ وَيَدَيْهِ، وَعَلَيْهِ جُبَّةٌ مِنْ صُوفٍ، فَلَمْ يَسْتَطِعْ أَنْ يُخْرِجَ ذِرَاعَيْهِ مِنْهَا حَتَّى أَخْرَجَهُمَا مِنْ أَسْفَلِ الْجُبَّةِ، فَغَسَلَ ذِرَاعَيْهِ، ثُمَّ مَسَحَ بِرَأْسِهِ، ثُمَّ أَهْوَيْتُ لأَنْزِعَ خُفَّيْهِ فَقَالَ ‏\"‏ دَعْهُمَا، فَإِنِّي أَدْخَلْتُهُمَا طَاهِرَتَيْنِ، فَمَسَحَ عَلَيْهِمَا ‏\"‏‏.‏",
    "malay_translation": "Aku pernah bersama Nabi SAW pada suatu malam ketika dalam perjalanan. Baginda bertanya, \"Adakah engkau ada air?\" Aku menjawab, \"Ya.\" Maka Baginda turun dari kenderaannya, lalu berjalan sehingga hilang dari pandanganku dalam kegelapan malam. Kemudian Baginda datang, maka aku menuangkan air untuk Baginda. Baginda membasuh muka dan tangannya, sedang Baginda memakai jubah bulu, maka Baginda tidak dapat mengeluarkan lengannya dari jubah itu sehingga Baginda mengeluarkannya dari bawah jubah. Kemudian Baginda membasuh lengannya, lalu Baginda mengusap kepalanya. Kemudian aku hendak menanggalkan khuf (kasut) Baginda, maka Baginda bersabda, \"Biarkan sahaja, kerana aku memakainya dalam keadaan suci.\" Maka Baginda mengusap khufnya."
  },
  {
    "id": 5574,
    "hadith_number": 5574,
    "tajuk_hadith": "Rasulullah SAW Menghadiahkan Jubah Kepada Makhramah",
    "perawi_melayu": "Daripada Al-Miswar bin Makhramah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، قَالَ قَسَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَقْبِيَةً، وَلَمْ يُعْطِ مَخْرَمَةَ شَيْئًا فَقَالَ مَخْرَمَةُ يَا بُنَىَّ انْطَلِقْ بِنَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَانْطَلَقْتُ مَعَهُ فَقَالَ ادْخُلْ فَادْعُهُ لِي‏.‏ قَالَ فَدَعَوْتُهُ لَهُ، فَخَرَجَ إِلَيْهِ وَعَلَيْهِ قَبَاءٌ مِنْهَا فَقَالَ ‏\n\"‏ خَبَأْتُ هَذَا لَكَ ‏\"‏‏.‏ قَالَ فَنَظَرَ إِلَيْهِ فَقَالَ رَضِيَ مَخْرَمَةُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah bin Sa'id, telah menceritakan kepada kami Laith, dari Ibnu Abi Malikah, dari Al-Miswar bin Makhramah, dia berkata, Rasulullah SAW telah membahagikan beberapa jubah, dan tidak memberi apa-apa kepada Makhramah. Maka Makhramah berkata, \"Wahai anakku, marilah kita pergi kepada Rasulullah SAW.\" Maka aku pun pergi bersamanya, lalu dia berkata, \"Masuklah dan panggillah baginda untukku.\" Maka aku pun memanggil baginda untuknya, lalu baginda keluar kepadanya, sedang baginda memakai salah satu jubah tersebut, lalu baginda berkata, \"Aku telah menyimpan ini untukmu.\" Maka Makhramah melihatnya lalu berkata, \"Makhramah telah redha.\""
  },
  {
    "id": 5575,
    "hadith_number": 5575,
    "tajuk_hadith": "Larangan Memakai Pakaian Sutera Bagi Orang Bertakwa",
    "perawi_melayu": "Riwayat `Uqba bin `Amir:",
    "english_text": "A silken Farruj was presented to Allah's Messenger (ﷺ) and he put it on and offered the prayer in it. When he \nfinished the prayer, he took it off violently as if he disliked it and said, \"This (garment) does not befit \nthose who fear Allah!\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ ـ رضى الله عنه ـ أَنَّهُ قَالَ أُهْدِيَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَرُّوجُ حَرِيرٍ، فَلَبِسَهُ، ثُمَّ صَلَّى فِيهِ، ثُمَّ انْصَرَفَ فَنَزَعَهُ نَزْعًا شَدِيدًا كَالْكَارِهِ لَهُ ثُمَّ قَالَ ‏\n\"‏ لاَ يَنْبَغِي هَذَا لِلْمُتَّقِينَ ‏\"‏‏.‏ تَابَعَهُ عَبْدُ اللَّهِ بْنُ يُوسُفَ عَنِ اللَّيْثِ، وَقَالَ غَيْرُهُ فَرُّوجٌ حَرِيرٌ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah bin Sa'id, telah menceritakan kepada kami Al-Laith, dari Yazid bin Abi Habib, dari Abi Al-Khair, dari Uqbah bin `Amir - semoga Allah SWT merahmatinya - bahawa beliau berkata: “Telah dihadiahkan kepada Rasulullah SAW sehelai pakaian sutera Farruj, lalu baginda memakainya dan menunaikan solat dengannya. Kemudian baginda menanggalkannya dengan kasar seolah-olah baginda membencinya, lalu baginda bersabda: “Pakaian ini tidak sesuai untuk orang-orang yang bertaqwa.” Abdullah bin Yusuf turut meriwayatkan dari Al-Laith, dan ada yang berkata, ‘pakaian sutera Farruj’.”"
  },
  {
    "id": 5576,
    "hadith_number": 5576,
    "tajuk_hadith": "Anas memakai jubah kuning",
    "perawi_melayu": "Daripada Mu'tamir:",
    "english_text": "I heard my father saying, \"I saw Anas wearing a yellow hooded cloak of Khazz.\"",
    "arabic_text": "وَقَالَ لِي مُسَدَّدٌ حَدَّثَنَا مُعْتَمِرٌ، سَمِعْتُ أَبِي قَالَ، رَأَيْتُ عَلَى أَنَسٍ بُرْنُسًا أَصْفَرَ مِنْ خَزٍّ‏.‏",
    "malay_translation": "Aku mendengar bapaku berkata, \"Aku melihat Anas memakai jubah berhud kuning daripada kain Khazz.\""
  },
  {
    "id": 5577,
    "hadith_number": 5577,
    "tajuk_hadith": "Pakaian Ihram",
    "perawi_melayu": "Riwayat Abdullah bin Umar:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَجُلاً، قَالَ يَا رَسُولَ اللَّهِ مَا يَلْبَسُ الْمُحْرِمُ مِنَ الثِّيَابِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَلْبَسُوا الْقُمُصَ، وَلاَ الْعَمَائِمَ، وَلاَ السَّرَاوِيلاَتِ، وَلاَ الْبَرَانِسَ، وَلاَ الْخِفَافَ، إِلاَّ أَحَدٌ لاَ يَجِدُ النَّعْلَيْنِ، فَلْيَلْبَسْ خُفَّيْنِ، وَلْيَقْطَعْهُمَا أَسْفَلَ مِنَ الْكَعْبَيْنِ، وَلاَ تَلْبَسُوا مِنَ الثِّيَابِ شَيْئًا مَسَّهُ زَعْفَرَانٌ وَلاَ الْوَرْسُ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ismail, katanya telah menceritakan kepadaku Malik, dari Nafi', dari Abdullah bin Umar, bahawa seorang lelaki bertanya, \"Wahai Rasulullah, apakah pakaian yang boleh dipakai oleh orang yang berihram?\" Rasulullah SAW menjawab:  \"Janganlah kamu memakai kemeja, serban, seluar, jubah, dan khuff (kasut yang diperbuat daripada kain tebal atau kulit); kecuali jika seseorang itu tidak menemui kasut, maka bolehlah dia memakai khuff dan hendaklah memendekkannya di bawah buku lali. Dan janganlah kamu memakai pakaian yang terkena pewarna safron atau wars (dua jenis minyak wangi).\""
  },
  {
    "id": 5578,
    "hadith_number": 5578,
    "tajuk_hadith": "Keperluan Pakaian dan Kasut",
    "perawi_melayu": "Daripada Ibnu Abbas",
    "english_text": "The Prophet (ﷺ) said, \"Whoever cannot get an Izar, can wear trousers, and whoever cannot wear sandals can wear Khuffs (socks made from thick fabric or leather).\"",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ جَابِرِ بْنِ زَيْدٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ لَمْ يَجِدْ إِزَارًا فَلْيَلْبَسْ سَرَاوِيلَ، وَمَنْ لَمْ يَجِدْ نَعْلَيْنِ فَلْيَلْبَسْ خُفَّيْنِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Barang siapa yang tidak mendapat kain izar, maka hendaklah dia memakai seluar, dan barang siapa yang tidak mendapat kasut, maka hendaklah dia memakai khuff (stoking daripada kain tebal atau kulit).\""
  },
  {
    "id": 5579,
    "hadith_number": 5579,
    "tajuk_hadith": "Pakaian Ihram",
    "perawi_melayu": "Riwayat Abdullah:",
    "english_text": "A man got up and said, O Allah's Messenger (ﷺ)! What do you order us to wear when we assume the state of \nIhram?\" The Prophet (ﷺ) replied, \"Do not wear shirts, trousers, turbans, hooded cloaks or Khuffs (socks \nmade from thick fabric or leather), but if a man has no sandals, he can wear Khuffs after cutting them \nshort below the ankles; and do not wear clothes touched with (perfumes) of saffron or wars.\"",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ مَا تَأْمُرُنَا أَنْ نَلْبَسَ إِذَا أَحْرَمْنَا‏.‏ قَالَ ‏\n\"‏ لاَ تَلْبَسُوا الْقَمِيصَ، وَالسَّرَاوِيلَ، وَالْعَمَائِمَ وَالْبَرَانِسَ، وَالْخِفَافَ، إِلاَّ أَنْ يَكُونَ رَجُلٌ لَيْسَ لَهُ نَعْلاَنِ، فَلْيَلْبَسِ الْخُفَّيْنِ أَسْفَلَ مِنَ الْكَعْبَيْنِ، وَلاَ تَلْبَسُوا شَيْئًا مِنَ الثِّيَابِ مَسَّهُ زَعْفَرَانٌ وَلاَ وَرْسٌ ‏\"‏‏.‏",
    "malay_translation": "Seorang lelaki bangun dan berkata, \"Wahai Rasulullah ﷺ! Apakah yang tuan perintahkan kami pakai apabila kami berihram?\"  Rasulullah ﷺ menjawab, \"Janganlah kamu memakai kemeja, seluar, serban, jubah bertopi atau khuff (stokin daripada kain tebal atau kulit), tetapi jika seseorang lelaki itu tidak mempunyai sandal, dia boleh memakai khuff setelah memendekkannya di bawah buku lali; dan janganlah kamu memakai pakaian yang terkena pewangi kunyit atau waras.\""
  },
  {
    "id": 5580,
    "hadith_number": 5580,
    "tajuk_hadith": "Larangan Memakai Pakaian Tertentu Bagi Orang Yang Berihram",
    "perawi_melayu": "Riwayat Abdullah bin Umar",
    "english_text": "The Prophet (ﷺ) said, \"A Muhrim should not wear a shirt, a turban, trousers, hooded cloaks, a garment touched with (perfumes) of saffron or wars, or Khuffs (socks made from thick fabric or leather) except if one has no sandals in which case he should cut short the Khuffs below the ankles.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ الزُّهْرِيَّ، قَالَ أَخْبَرَنِي سَالِمٌ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَلْبَسُ الْمُحْرِمُ الْقَمِيصَ، وَلاَ الْعِمَامَةَ، وَلاَ السَّرَاوِيلَ، وَلاَ الْبُرْنُسَ، وَلاَ ثَوْبًا مَسَّهُ زَعْفَرَانٌ، وَلاَ وَرْسٌ، وَلاَ الْخُفَّيْنِ، إِلاَّ لِمَنْ لَمْ يَجِدِ النَّعْلَيْنِ، فَإِنْ لَمْ يَجِدْهُمَا فَلْيَقْطَعْهُمَا أَسْفَلَ مِنَ الْكَعْبَيْنِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Orang yang berihram tidak boleh memakai kemeja, serban, seluar, jubah bertopi, pakaian yang terkena pewangi kunyit atau wars, atau khuffain (kasut yang diperbuat daripada kain tebal atau kulit) kecuali bagi mereka yang tidak mempunyai sandal. Jika mereka tidak mempunyai sandal, hendaklah mereka memotong khuffain itu di bawah buku lali.\""
  },
  {
    "id": 5581,
    "hadith_number": 5581,
    "tajuk_hadith": "Hijrah Nabi SAW dan Abu Bakar ke Gua Tsur",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ هَاجَرَ إِلَى الْحَبَشَةِ نَاسٌ مِنَ الْمُسْلِمِينَ، وَتَجَهَّزَ أَبُو بَكْرٍ مُهَاجِرًا، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ عَلَى رِسْلِكَ، فَإِنِّي أَرْجُو أَنْ يُؤْذَنَ لِي ‏\"‏‏.‏ فَقَالَ أَبُو بَكْرٍ أَوَ تَرْجُوهُ بِأَبِي أَنْتَ قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ فَحَبَسَ أَبُو بَكْرٍ نَفْسَهُ عَلَى النَّبِيِّ صلى الله عليه وسلم لِصُحْبَتِهِ، وَعَلَفَ رَاحِلَتَيْنِ كَانَتَا عِنْدَهُ وَرَقَ السَّمُرِ أَرْبَعَةَ أَشْهُرٍ‏.‏ قَالَ عُرْوَةُ قَالَتْ عَائِشَةُ فَبَيْنَا نَحْنُ يَوْمًا جُلُوسٌ فِي بَيْتِنَا فِي نَحْرِ الظَّهِيرَةِ فَقَالَ قَائِلٌ لأَبِي بَكْرٍ هَذَا رَسُولُ اللَّهِ صلى الله عليه وسلم مُقْبِلاً مُتَقَنِّعًا، فِي سَاعَةٍ لَمْ يَكُنْ يَأْتِينَا فِيهَا‏.‏ قَالَ أَبُو بَكْرٍ فِدًا لَهُ بِأَبِي وَأُمِّي، وَاللَّهِ إِنْ جَاءَ بِهِ فِي هَذِهِ السَّاعَةِ إِلاَّ لأَمْرٍ‏.‏ فَجَاءَ النَّبِيُّ صلى الله عليه وسلم فَاسْتَأْذَنَ، فَأَذِنَ لَهُ فَدَخَلَ، فَقَالَ حِينَ دَخَلَ لأَبِي بَكْرٍ ‏\"‏ أَخْرِجْ مَنْ عِنْدَكَ ‏\"‏‏.‏ قَالَ إِنَّمَا هُمْ أَهْلُكَ بِأَبِي أَنْتَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ فَإِنِّي قَدْ أُذِنَ لِي فِي الْخُرُوجِ ‏\"‏‏.‏ قَالَ فَالصُّحْبَةُ بِأَبِي أَنْتَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ قَالَ فَخُذْ بِأَبِي أَنْتَ يَا رَسُولَ اللَّهِ إِحْدَى رَاحِلَتَىَّ هَاتَيْنِ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ بِالثَّمَنِ ‏\"‏‏.‏ قَالَتْ فَجَهَّزْنَاهُمَا أَحَثَّ الْجِهَازِ، وَضَعْنَا لَهُمَا سُفْرَةً فِي جِرَابٍ، فَقَطَعَتْ أَسْمَاءُ بِنْتُ أَبِي بَكْرٍ قِطْعَةً مِنْ نِطَاقِهَا، فَأَوْكَتْ بِهِ الْجِرَابَ، وَلِذَلِكَ كَانَتْ تُسَمَّى ذَاتَ النِّطَاقِ، ثُمَّ لَحِقَ النَّبِيُّ صلى الله عليه وسلم وَأَبُو بَكْرٍ بِغَارٍ فِي جَبَلٍ يُقَالُ لَهُ ثَوْرٌ، فَمَكُثَ فِيهِ ثَلاَثَ لَيَالٍ يَبِيتُ عِنْدَهُمَا عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ، وَهْوَ غُلاَمٌ شَابٌّ لَقِنٌ ثَقِفٌ، فَيَرْحَلُ مِنْ عِنْدِهِمَا سَحَرًا، فَيُصْبِحُ مَعَ قُرَيْشٍ بِمَكَّةَ كَبَائِتٍ، فَلاَ يَسْمَعُ أَمْرًا يُكَادَانِ بِهِ إِلاَّ وَعَاهُ، حَتَّى يَأْتِيَهُمَا بِخَبَرِ ذَلِكَ حِينَ يَخْتَلِطُ الظَّلاَمُ، وَيَرْعَى عَلَيْهِمَا عَامِرُ بْنُ فُهَيْرَةَ مَوْلَى أَبِي بَكْرٍ مِنْحَةً مِنْ غَنَمٍ، فَيُرِيحُهَا عَلَيْهِمَا حِينَ تَذْهَبُ سَاعَةٌ مِنَ الْعِشَاءِ، فَيَبِيتَانِ فِي رِسْلِهَا حَتَّى يَنْعِقَ بِهَا عَامِرُ بْنُ فُهَيْرَةَ بِغَلَسٍ، يَفْعَلُ ذَلِكَ كُلَّ لَيْلَةٍ مِنْ تِلْكَ اللَّيَالِي الثَّلاَثِ‏.‏",
    "malay_translation": "Beberapa orang Muslim telah berhijrah ke Habsyah, dan Abu Bakar juga telah bersiap untuk berhijrah.  Maka Nabi SAW bersabda, \"Tunggulah, kerana aku berharap Allah akan mengizinkan aku juga untuk berhijrah.\"  Abu Bakar berkata, \"Demi ayah dan ibuku, wahai Rasulullah, adakah baginda mengharapkan (hijrah itu)?\" Nabi bersabda, \"Ya.\" Maka Abu Bakar menunggu untuk menemani Nabi SAW, dan dia memberi makan dua ekor unta betinanya dengan daun pokok Samur selama empat bulan.  Suatu hari, ketika kami sedang duduk di rumah pada tengah hari, seseorang berkata kepada Abu Bakar, \"Rasulullah SAW datang, dengan kepala dan sebahagian wajahnya ditutupi kain, pada waktu yang baginda tidak pernah datang kepada kita.\" Abu Bakar berkata, \"Demi ayah dan ibuku, sesungguhnya Rasulullah SAW tidak datang pada waktu ini melainkan kerana sesuatu yang penting.\" Nabi SAW datang dan meminta izin untuk masuk, lalu diizinkan. Nabi SAW masuk dan berkata kepada Abu Bakar, \"Keluarkanlah orang yang ada bersamamu.\" Abu Bakar menjawab, \"Mereka adalah keluarga baginda, demi ayahku, wahai Rasulullah!\" Nabi SAW bersabda, \"Sesungguhnya aku telah diizinkan untuk keluar (dari Mekah).\" Abu Bakar berkata, \"Aku akan menemani baginda, wahai Rasulullah, demi ayahku!\" Nabi SAW bersabda, \"Ya.\" Abu Bakar berkata, \"Wahai Rasulullah, demi ayahku, ambillah seekor daripada dua ekor unta betinaku ini.\" Nabi SAW bersabda, \"Dengan harganya.\" Maka kami menyediakan bekalan perjalanan mereka dan meletakkan makanan perjalanan mereka di dalam sebuah beg kulit. Asma' binti Abu Bakar memotong sekeping tali pinggangnya dan mengikat mulut beg kulit itu.  Oleh kerana itu, dia dipanggil Dzatun-Nitaqain. Kemudian Nabi SAW dan Abu Bakar pergi ke sebuah gua di sebuah gunung yang bernama Tsur, dan tinggal di sana selama tiga malam. Abdullah bin Abu Bakar, yang merupakan seorang pemuda yang cerdas dan bijak, akan berada bersama mereka pada waktu malam dan akan pergi sebelum fajar, supaya pada waktu pagi, dia berada bersama kaum Quraisy di Mekah seolah-olah dia telah bermalam bersama mereka. Sekiranya dia mendengar sebarang komplot yang dirancang oleh kaum Quraisy terhadap Nabi SAW dan Abu Bakar, dia akan mengetahuinya dan (kembali untuk) memberitahu mereka mengenainya apabila hari telah gelap. 'Amir bin Fuhairah, hamba yang dimerdekakan Abu Bakar, akan menggembalakan sekumpulan kambing biri-biri untuk mereka dan dia akan membawa kambing biri-biri itu kepada mereka setelah lewat satu jam selepas solat Isya'. Mereka akan tidur nyenyak sehingga 'Amir bin Fuhairah membangunkan mereka ketika masih gelap. Dia melakukan perkara itu pada setiap tiga malam tersebut."
  },
  {
    "id": 5582,
    "hadith_number": 5582,
    "tajuk_hadith": "Rasulullah SAW memasuki Mekah ketika Fath Mekah dengan memakai helmet",
    "perawi_melayu": "Anas bin Malik:",
    "english_text": "In the year of the conquest of Mecca the Prophet (ﷺ) entered Mecca, wearing a helmet on his head.",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا مَالِكٌ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ مَكَّةَ عَامَ الْفَتْحِ وَعَلَى رَأْسِهِ الْمِغْفَرُ‏.‏",
    "malay_translation": "Pada tahun penaklukan Mekah, Nabi Muhammad SAW memasuki Mekah dengan memakai helmet di atas kepala baginda."
  },
  {
    "id": 5583,
    "hadith_number": 5583,
    "tajuk_haditi": "Keramahan Rasulullah SAW kepada Seorang Badwi",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "Once I was walking with Allah's Messenger (ﷺ) and he was wearing a Najram Burd with thick margin. A \nbedouin followed him and pulled his Burd so violently that I noticed the side of the shoulder of \nAllah's Messenger (ﷺ) affected by the margin of the Burd because of that violent pull. The Bedouin said, \"O \nMuhammad! Give me some of Allah's wealth which is with you.\" Allah's Messenger (ﷺ) turned and looked \nat him, and smiling, 'he ordered that he be given something.",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كُنْتُ أَمْشِي مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَعَلَيْهِ بُرْدٌ نَجْرَانِيٌّ غَلِيظُ الْحَاشِيَةِ، فَأَدْرَكَهُ أَعْرَابِيٌّ فَجَبَذَهُ بِرِدَائِهِ جَبْذَةً شَدِيدَةً، حَتَّى نَظَرْتُ إِلَى صَفْحَةِ عَاتِقِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَدْ أَثَّرَتْ بِهَا حَاشِيَةُ الْبُرْدِ مِنْ شِدَّةِ جَبْذَتِهِ، ثُمَّ قَالَ يَا مُحَمَّدُ مُرْ لِي مِنْ مَالِ اللَّهِ الَّذِي عِنْدَكَ‏.‏ فَالْتَفَتَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ ضَحِكَ ثُمَّ أَمَرَ لَهُ بِعَطَاءٍ‏.‏",
    "malay_translation": "Pada suatu ketika, aku berjalan bersama Rasulullah SAW. Baginda ketika itu memakai sehelai burdah Najrani dengan pinggiran yang tebal.  Seorang Badwi mengejar baginda lalu menarik burdah itu dengan kuat sehingga aku nampak kesan tarikan itu pada bahu Rasulullah SAW. Badwi itu berkata, \"Wahai Muhammad! Berikan kepadaku sebahagian daripada harta Allah yang ada padamu.\" Rasulullah SAW berpaling, memandangnya, lalu tersenyum dan memerintahkan supaya diberikan sesuatu kepadanya."
  },
  {
    "id": 5584,
    "hadith_number": 5584,
    "tajuk_hadith": "Sehelai Burdah Sebagai Kafan",
    "perawi_melayu": "Riwayat Abu Hazim:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ جَاءَتِ امْرَأَةٌ بِبُرْدَةٍ ـ قَالَ سَهْلٌ هَلْ تَدْرِي مَا الْبُرْدَةُ قَالَ نَعَمْ هِيَ الشَّمْلَةُ، مَنْسُوجٌ فِي حَاشِيَتِهَا ـ قَالَتْ يَا رَسُولَ اللَّهِ إِنِّي نَسَجْتُ هَذِهِ بِيَدِي أَكْسُوكَهَا‏.‏ فَأَخَذَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم مُحْتَاجًا إِلَيْهَا، فَخَرَجَ إِلَيْنَا وَإِنَّهَا لإِزَارُهُ، فَجَسَّهَا رَجُلٌ مِنَ الْقَوْمِ فَقَالَ يَا رَسُولَ اللَّهِ اكْسُنِيهَا‏.‏ قَالَ ‏\n\"‏ نَعَمْ ‏\"‏‏.‏ فَجَلَسَ مَا شَاءَ اللَّهُ فِي الْمَجْلِسِ، ثُمَّ رَجَعَ، فَطَوَاهَا ثُمَّ أَرْسَلَ بِهَا إِلَيْهِ‏.‏ فَقَالَ لَهُ الْقَوْمُ مَا أَحْسَنْتَ، سَأَلْتَهَا إِيَّاهُ وَقَدْ عَرَفْتَ أَنَّهُ لاَ يَرُدُّ سَائِلاً‏.‏ فَقَالَ الرَّجُلُ وَاللَّهِ مَا سَأَلْتُهَا إِلاَّ لِتَكُونَ كَفَنِي يَوْمَ أَمُوتُ‏.‏ قَالَ سَهْلٌ فَكَانَتْ كَفَنَهُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah bin Sa’id, telah menceritakan kepada kami Ya’qub bin Abdur Rahman, dari Abu Hazim, dari Sahl bin Sa’d, dia berkata, “Seorang wanita datang membawa sehelai burdah. Sahl berkata, “Tahukah kamu apa itu burdah?”  Dikatakan, “Ya, ia adalah sehelai kain selendang yang dianyam pada tepinya.” Wanita itu berkata, ‘Wahai Rasulullah, saya telah menenun kain ini dengan tangan saya sendiri untuk Tuan pakai.’ Rasulullah ﷺ menerimanya kerana Baginda memerlukannya. Baginda keluar kepada kami dan burdah itu menjadi kain sarung Baginda.  Seorang lelaki dari kalangan manusia itu menyentuhnya lalu berkata, ‘Wahai Rasulullah, berikanlah kain ini kepada saya untuk dipakai.’ Baginda menjawab, ‘Ya.’ Lelaki itu duduk seketika, kemudian Rasulullah ﷺ pulang ke rumah, melipat kain itu dan menghantarnya kepada lelaki itu.  Orang ramai berkata kepadanya, ‘Engkau tidak berbuat baik. Engkau meminta kain itu daripada Baginda sedangkan engkau tahu Baginda tidak menolak sesiapa yang meminta.’ Lelaki itu berkata, ‘Demi Allah, saya hanya meminta kain itu untuk dijadikan kafan saya apabila saya mati.’ Sahl berkata, ‘Maka kain itu menjadi kafannya.”"
  },
  {
    "id": 5585,
    "hadith_number": 5585,
    "tajuk_hadith": "70,000 Umat Islam Masuk Syurga Tanpa Hisab",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ يَدْخُلُ الْجَنَّةَ مِنْ أُمَّتِي زُمْرَةٌ هِيَ سَبْعُونَ أَلْفًا، تُضِيءُ وُجُوهُهُمْ إِضَاءَةَ الْقَمَرِ ‏\"‏‏.‏ فَقَامَ عُكَاشَةُ بْنُ مِحْصَنٍ الأَسَدِيُّ يَرْفَعُ نَمِرَةً عَلَيْهِ قَالَ ادْعُ اللَّهَ لِي يَا رَسُولَ اللَّهِ أَنْ يَجْعَلَنِي مِنْهُمْ‏.‏ فَقَالَ ‏\"‏ اللَّهُمَّ اجْعَلْهُ مِنْهُمْ ‏\"‏‏.‏ ثُمَّ قَامَ رَجُلٌ مِنَ الأَنْصَارِ فَقَالَ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ‏.‏ فَقَالَ رَسُولُ اللَّهِ ‏\"‏ سَبَقَكَ عُكَاشَةُ ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda: \"Daripada umatku, satu kumpulan (sebanyak 70,000 orang) akan masuk syurga tanpa hisab. Wajah mereka akan bersinar seperti cahaya bulan.\"  Ukasyah bin Mihshan Al-Asadi bangun, sambil mengangkat kain penutupnya dan berkata, \"Wahai Rasulullah SAW, doakanlah saya kepada Allah agar saya termasuk dalam kalangan mereka.\"  Rasulullah SAW bersabda: \"Ya Allah, jadikanlah dia daripada kalangan mereka.\" Kemudian, seorang lelaki daripada kalangan Ansar bangun dan berkata, \"Wahai Rasulullah SAW, doakanlah saya kepada Allah agar saya termasuk dalam kalangan mereka.\"  Rasulullah SAW bersabda: \"Ukasyah telah mendahului kamu.\""
  },
  {
    "id": 5586,
    "hadith_number": 5586,
    "tajuk_hadith": "Pakaian Kegemaran Nabi SAW",
    "perawi_melayu": "Riwayat Qatadah:",
    "english_text": "I asked Anas, \"What kind of clothes was most beloved to the Prophet?\" He replied, \"The Hibra (a kind \nof Yemenese cloth).",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ قُلْتُ لَهُ أَىُّ الثِّيَابِ كَانَ أَحَبَّ إِلَى النَّبِيِّ صلى الله عليه وسلم قَالَ الْحِبَرَةُ‏.‏",
    "malay_translation": "Aku bertanya kepada Anas, \"Apakah jenis pakaian yang paling disukai oleh Nabi?\"  Beliau menjawab, \"Pakaian Hibrah (sejenis kain dari Yaman).\""
  },
  {
    "id": 5587,
    "hadith_number": 5587,
    "tajuk_hadith": "Pakaian Kegemaran Nabi SAW",
    "perawi_melayu": "Anas bin Malik meriwayatkan:",
    "english_text": "The most beloved garment to the Prophet (ﷺ) to wear was the Hibra (a kind of Yemenese cloth).",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي الأَسْوَدِ، حَدَّثَنَا مُعَاذٌ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، رضى الله عنه ـ قَالَ كَانَ أَحَبُّ الثِّيَابِ إِلَى النَّبِيِّ صلى الله عليه وسلم أَنْ يَلْبَسَهَا الْحِبَرَةَ‏.‏",
    "malay_translation": "Anas bin Malik berkata:  Pakaian yang paling disukai oleh Nabi SAW untuk dipakai ialah kain Hibrah (sejenis kain dari Yaman)."
  },
  {
    "id": 5588,
    "hadith_number": 5588,
    "tajuk_hadith": "Kepergian Rasulullah SAW",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "(the wife of the Prophet) When Allah's Messenger (ﷺ) died, he was covered with a Hibra Burd (green square decorated garment).",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حِينَ تُوُفِّيَ سُجِّيَ بِبُرْدٍ حِبَرَةٍ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Yaman, telah memberitakan kepada kami Syu'aib, dari Az-Zuhri, dia berkata: Telah menceritakan kepadaku Abu Salamah bin Abdurrahman bin Auf, bahawa Aisyah - radhiallahu 'anha - isteri Nabi ﷺ telah menceritakan bahawa Rasulullah ﷺ ketika wafat, dikafankan dengan kain Habarah (kain hijau bercorak)."
  },
  {
    "id": 5589,
    "hadith_number": 5589,
    "tajuk_hadith": "Larangan Menjadikan Kubur Nabi Sebagai Tempat Ibadah",
    "perawi_melayu": "Daripada Aisyah dan Abdullah bin Abbas:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ عَائِشَةَ، وَعَبْدَ اللَّهِ بْنَ عَبَّاسٍ، رضى الله عنهم قَالاَ لَمَّا نَزَلَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم طَفِقَ يَطْرَحُ خَمِيصَةً لَهُ عَلَى وَجْهِهِ، فَإِذَا اغْتَمَّ كَشَفَهَا عَنْ وَجْهِهِ، فَقَالَ وَهْوَ كَذَلِكَ ‏\n\"‏ لَعْنَةُ اللَّهِ عَلَى الْيَهُودِ وَالنَّصَارَى اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ ‏\"‏‏.‏ يُحَذِّرُ مَا صَنَعُوا‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Yahya bin Bukhair, telah menceritakan kepada kami Laits, dari Uqaili, dari Ibnu Syihab, dia berkata: telah memberitakan kepadaku Ubaidullah bin Abdullah bin Utbah, bahawa Aisyah dan Abdullah bin Abbas r.a. berkata:  “Apabila penyakit Rasulullah SAW semakin teruk, baginda menutup wajah baginda dengan kain khamisa.  Apabila baginda sesak nafas, baginda akan menanggalkan kain itu dari wajah baginda dan bersabda: “Beginilah keadaannya!  Laknat Allah ke atas Yahudi dan Nasrani, mereka menjadikan kubur-kubur nabi-nabi mereka sebagai tempat beribadah.”  (Baginda) memberi amaran terhadap perbuatan yang mereka lakukan."
  },
  {
    "id": 5590,
    "hadith_number": 5590,
    "tajuk_hadith": "Rasulullah SAW dan Khamisanya yang Bercorak",
    "perawi_melayu": "Riwayat Aisyah:",
    "english_text": "Allah's Messenger (ﷺ) offered prayer while he was wearing a Khamisa of his that had printed marks. He \nlooked at its marks and when he finished prayer, he said, \"Take this Khamisa of mine to Abu Jahm, \nfor it has just now diverted my attention from my prayer, and bring to me the Anbijania (a plain thick \nsheet) of Abu Jahm bin Hudhaifa bin Ghanim who belonged to Bani Adi bin Ka`b.\"",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي خَمِيصَةٍ لَهُ لَهَا أَعْلاَمٌ، فَنَظَرَ إِلَى أَعْلاَمِهَا نَظْرَةً، فَلَمَّا سَلَّمَ قَالَ ‏\n\"‏ اذْهَبُوا بِخَمِيصَتِي هَذِهِ إِلَى أَبِي جَهْمٍ، فَإِنَّهَا أَلْهَتْنِي آنِفًا عَنْ صَلاَتِي، وَائْتُونِي بِأَنْبِجَانِيَّةِ أَبِي جَهْمِ بْنِ حُذَيْفَةَ بْنِ غَانِمٍ مِنْ بَنِي عَدِيِّ بْنِ كَعْبٍ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW menunaikan solat ketika memakai khamisah yang bercorak. Baginda melihat corak tersebut, dan setelah selesai solat, Baginda bersabda: \"Bawalah khamisahku ini kepada Abu Jahm, kerana ia telah mengganggu tumpuan ku daripada solat sebentar tadi, dan bawakan kepadaku kain Anbijaniyyah milik Abu Jahm bin Hudzaifah bin Ghanim daripada Bani Adi bin Ka'ab.\""
  },
  {
    "id": 5591,
    "hadith_number": 5591,
    "tajuk_hadith": "Kemangkatan Nabi SAW",
    "perawi_melayu": "Daripada Abu Burdah:",
    "english_text": "Aisha brought out to us a Kisa and an Izar and said, \"The Prophet (ﷺ) died while wearing these two.\" \n(Kisa, a square black piece of woolen cloth. Izar, a sheet cloth garment covering the lower half of the \nbody).",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا أَيُّوبُ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ أَبِي بُرْدَةَ، قَالَ أَخْرَجَتْ إِلَيْنَا عَائِشَةُ كِسَاءً وَإِزَارًا غَلِيظًا فَقَالَتْ قُبِضَ رُوحُ النَّبِيِّ صلى الله عليه وسلم فِي هَذَيْنِ‏.‏",
    "malay_translation": "Aisyah telah mengeluarkan kepada kami sehelai kain kisah dan sehelai kain izar yang tebal, lalu berkata, \"Roh Nabi SAW telah diambil ketika Baginda memakai kedua-dua kain ini.\" (Kisa' ialah kain persegi hitam daripada bulu. Izar ialah kain sehelai yang menutupi bahagian bawah badan)."
  },
  {
    "id": 5592,
    "hadith_number": 5592,
    "tajuk_hadith": "Larangan Nabi SAW",
    "perawi_melayu": "Riwayat Abu Hurairah",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ خُبَيْبٍ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنِ الْمُلاَمَسَةِ، وَالْمُنَابَذَةِ، وَعَنْ صَلاَتَيْنِ بَعْدَ الْفَجْرِ حَتَّى تَرْتَفِعَ الشَّمْسُ، وَبَعْدَ الْعَصْرِ حَتَّى تَغِيبَ، وَأَنْ يَحْتَبِيَ بِالثَّوْبِ الْوَاحِدِ، لَيْسَ عَلَى فَرْجِهِ مِنْهُ شَىْءٌ بَيْنَهُ وَبَيْنَ السَّمَاءِ، وَأَنْ يَشْتَمِلَ الصَّمَّاءَ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Muhammad bin Basar, telah menceritakan kepada kami Abdul Wahhab, telah menceritakan kepada kami Ubaidullah, daripada Khubayb, daripada Hafs bin Aasim, daripada Abu Hurairah r.a., katanya: Nabi SAW telah melarang daripada mulamaasah dan munabadhah, dan daripada dua solat; satu selepas solat Subuh sehingga matahari terbit, dan satu lagi selepas solat Asar sehingga matahari terbenam.  Dan baginda juga melarang seseorang itu memakai hanya sehelai kain yang tidak menutup auratnya, terdedah di antara dirinya dan langit, dan melarang daripada istimalas-samma'."
  },
  {
    "id": 5593,
    "hadith_number": 5593,
    "tajuk_hadith": "Larangan Rasulullah SAW tentang Dua Cara Berpakaian dan Dua Jenis Perdagangan",
    "perawi_melayu": "Riwayat Abu Sa`id Al-Khudri:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عَامِرُ بْنُ سَعْدٍ، أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ لِبْسَتَيْنِ وَعَنْ بَيْعَتَيْنِ، نَهَى عَنِ الْمُلاَمَسَةِ وَالْمُنَابَذَةِ فِي الْبَيْعِ، وَالْمُلاَمَسَةُ لَمْسُ الرَّجُلِ ثَوْبَ الآخَرِ بِيَدِهِ بِاللَّيْلِ أَوْ بِالنَّهَارِ، وَلاَ يُقَلِّبُهُ إِلاَّ بِذَلِكَ، وَالْمُنَابَذَةُ أَنْ يَنْبِذَ الرَّجُلُ إِلَى الرَّجُلِ بِثَوْبِهِ، وَيَنْبِذَ الآخَرُ ثَوْبَهُ، وَيَكُونَ ذَلِكَ بَيْعَهُمَا، عَنْ غَيْرِ نَظَرٍ وَلاَ تَرَاضٍ، وَاللِّبْسَتَيْنِ اشْتِمَالُ الصَّمَّاءِ، وَالصَّمَّاءُ أَنْ يَجْعَلَ ثَوْبَهُ عَلَى أَحَدِ عَاتِقَيْهِ، فَيَبْدُو أَحَدُ شِقَّيْهِ لَيْسَ عَلَيْهِ ثَوْبٌ، وَاللِّبْسَةُ الأُخْرَى احْتِبَاؤُهُ بِثَوْبِهِ وَهْوَ جَالِسٌ، لَيْسَ عَلَى فَرْجِهِ مِنْهُ شَىْءٌ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Yahya bin Bukair, telah menceritakan kepada kami Laits, dari Yunus, dari Ibnu Syihab, dia berkata; telah memberitakan kepadaku Amir bin Saad bahawa Abu Said Al-Khudri berkata: Rasulullah SAW melarang dua cara berpakaian dan dua jenis jual beli. Baginda melarang jual beli secara Mulamasah dan Munabadzah. Mulamasah ialah seseorang menyentuh kain orang lain pada waktu siang atau malam, dan sentuhan itu mewajibkan dia membelinya. Manakala Munabadzah ialah seseorang melemparkan pakaiannya kepada orang lain, dan orang lain itu membalas dengan melemparkan pakaiannya pula, maka jadilah itu jual beli mereka tanpa melihat dan tanpa persetujuan.  Adapun dua cara berpakaian yang dilarangkan ialah;  Istimal As-Sama’, iaitu memakai pakaian hanya pada sebelah bahu, manakala sebelah lagi terdedah. Dan cara yang lain ialah berselimuti dengan pakaian ketika duduk, tetapi auratnya tidak tertutup."
  },
  {
    "id": 5594,
    "hadith_number": 5594,
    "tajuk_hadith": "Larangan Mengenai Dua Jenis Pakaian",
    "perawi_melayu": "Riwayat Abu Hurairah",
    "english_text": "Allah's Messenger (ﷺ) forbade two types of dresses: (A) To sit in an Ihtiba' posture in one garment nothing of which covers his private parts. (B) to cover one side of his body with one garment and leave the other side bare The Prophet (ﷺ) also forbade the Mulamasa and Munabadha.",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ لِبْسَتَيْنِ أَنْ يَحْتَبِيَ الرَّجُلُ فِي الثَّوْبِ الْوَاحِدِ لَيْسَ عَلَى فَرْجِهِ مِنْهُ شَىْءٌ، وَأَنْ يَشْتَمِلَ بِالثَّوْبِ الْوَاحِدِ، لَيْسَ عَلَى أَحَدِ شِقَّيْهِ، وَعَنِ الْمُلاَمَسَةِ وَالْمُنَابَذَةِ‏.‏",
    "malay_translation": "Rasulullah SAW telah melarang dua jenis pakaian: (A) Memakai hanya sehelai kain ketika duduk dengan cara ihtiba’ yang tidak menutup aurat. (B) Memakai sehelai kain yang hanya menutup sebelah badan sahaja dan meninggalkan sebelah lagi tanpa penutup. Nabi SAW juga melarang perbuatan mulamasa dan munabadha."
  },
  {
    "id": 5595,
    "hadith_number": 5595,
    "tajuk_hadith": "Larangan Mengenai Cara Berpakaian",
    "perawi_melayu": "Daripada Abu Said Al-Khudri:",
    "english_text": "The Prophet (ﷺ) forbade Ishtimal-as-Samma' and that a man should sit in an Ihtiba' posture in one \ngarment, nothing of which covers his private parts.",
    "arabic_text": "حَدَّثَنِي مُحَمَّدٌ، قَالَ أَخْبَرَنِي مَخْلَدٌ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي ابْنُ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ اشْتِمَالِ الصَّمَّاءِ، وَأَنْ يَحْتَبِيَ الرَّجُلُ فِي ثَوْبٍ وَاحِدٍ، لَيْسَ عَلَى فَرْجِهِ مِنْهُ شَىْءٌ‏.‏",
    "malay_translation": "Daripada Abu Said Al-Khudri r.a., bahawa Nabi SAW melarang daripada memakai kain yang nipis dan jarang (Ishtimal-as-Samma’), dan daripada seorang lelaki duduk dengan hanya sehelai kain yang tidak menutup auratnya."
  },
  {
    "id": 5596,
    "hadith_number": 5596,
    "tajuk_hadith": "Pakaian Nabi SAW untuk Um Khalid",
    "perawi_melayu": "Riwayat Um Khalid binti Khalid:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا إِسْحَاقُ بْنُ سَعِيدٍ، عَنْ أَبِيهِ، سَعِيدِ بْنِ فُلاَنٍ ـ هُوَ عَمْرُو بْنُ سَعِيدِ بْنِ الْعَاصِ ـ عَنْ أُمِّ خَالِدٍ بِنْتِ خَالِدٍ، أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِثِيَابٍ فِيهَا خَمِيصَةٌ سَوْدَاءُ صَغِيرَةٌ فَقَالَ ‏\"‏ مَنْ تَرَوْنَ نَكْسُو هَذِهِ ‏\"‏‏.‏ فَسَكَتَ الْقَوْمُ قَالَ ‏\"‏ ائْتُونِي بِأُمِّ خَالِدٍ ‏\"‏‏.‏ فَأُتِيَ بِهَا تُحْمَلُ فَأَخَذَ الْخَمِيصَةَ بِيَدِهِ فَأَلْبَسَهَا وَقَالَ ‏\"‏ أَبْلِي وَأَخْلِقِي ‏\"‏‏.‏ وَكَانَ فِيهَا عَلَمٌ أَخْضَرُ أَوْ أَصْفَرُ فَقَالَ ‏\"‏ يَا أُمَّ خَالِدٍ هَذَا سَنَاهْ ‏\"‏‏.‏ وَسَنَاهْ بِالْحَبَشِيَّةِ حَسَنٌ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Ishaq bin Sa'id, dari bapanya, Sa'id bin Fulan - iaitu Amru bin Sa'id bin al-'Ash - dari Um Khalid binti Khalid, bahawa Nabi SAW telah diberikan beberapa pakaian, antaranya ialah sehelai khamisah berwarna hitam yang kecil.  Lalu Baginda bertanya, \"Siapakah yang kamu fikir patut kami berikan pakaian ini?\"  Maka orang ramai terdiam.  Baginda bersabda, \"Bawalah Um Khalid kepadaku.\"  Lalu Um Khalid dibawa, ketika itu dia masih kecil dan dipangku.  Baginda mengambil khamisah itu dengan tangan Baginda sendiri lalu memakaikannya kepada Um Khalid dan bersabda, \"Semoga kamu panjang umur sehingga pakaian ini haus dan kamu menjahitnya berkali-kali.\"  Dan pada khamisah itu terdapat corak hijau atau kuning.  Lalu Baginda bersabda, \"Wahai Um Khalid, ini adalah Sanah.\"  Dan Sanah dalam bahasa Habsyi bermaksud cantik."
  },
  {
    "id": 5597,
    "hadith_number": 5597,
    "tajuk_hadith": "Tahnik Bayi oleh Nabi SAW",
    "perawi_melayu": "Riwayat Anas:",
    "english_text": "When Um Sulaim gave birth to a child. she said to me, \"O Anas! Watch this boy carefully and do not \ngive him anything to eat or drink until you have taken him to the Prophet (ﷺ) tomorrow morning for the \nTahnik.\" So the next morning I took the child to the Prophet (ﷺ) who was sitting in a garden and was \nwearing a Huraithiya Khamisa and was branding the she-camel on which he had come during the \nConquest of Mecca.",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنِي ابْنُ أَبِي عَدِيٍّ، عَنِ ابْنِ عَوْنٍ، عَنْ مُحَمَّدٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ لَمَّا وَلَدَتْ أُمُّ سُلَيْمٍ قَالَتْ لِي يَا أَنَسُ انْظُرْ هَذَا الْغُلاَمَ فَلاَ يُصِيبَنَّ شَيْئًا حَتَّى تَغْدُوَ بِهِ إِلَى النَّبِيِّ صلى الله عليه وسلم يُحَنِّكُهُ‏.‏ فَغَدَوْتُ بِهِ، فَإِذَا هُوَ فِي حَائِطٍ وَعَلَيْهِ خَمِيصَةٌ حُرَيْثِيَّةٌ، وَهْوَ يَسِمُ الظَّهْرَ الَّذِي قَدِمَ عَلَيْهِ فِي الْفَتْحِ‏.‏",
    "malay_translation": "Apabila Ummu Sulaim melahirkan anak, dia berkata kepadaku, \"Wahai Anas! Jagalah kanak-kanak lelaki ini dengan teliti dan jangan berikan dia apa-apa makanan atau minuman sehingga engkau membawanya kepada Nabi SAW esok pagi untuk Tahnik.\" Maka keesokan paginya aku membawa kanak-kanak itu kepada Nabi SAW yang ketika itu sedang duduk di dalam sebuah kebun dan memakai kemeja Huraithiya, sedang menanda unta betina yang ditungganginya ketika Fathu Makkah."
  },
  {
    "id": 5598,
    "hadith_number": 5598,
    "tajuk_hadith": "Perkahwinan Semula Selepas Talak dan Keupayaan Suami",
    "perawi_melayu": "Riwayat `Ikrimah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، أَخْبَرَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، أَنَّ رِفَاعَةَ، طَلَّقَ امْرَأَتَهُ، فَتَزَوَّجَهَا عَبْدُ الرَّحْمَنِ بْنُ الزَّبِيرِ الْقُرَظِيُّ، قَالَتْ عَائِشَةُ وَعَلَيْهَا خِمَارٌ أَخْضَرُ‏.‏ فَشَكَتْ إِلَيْهَا، وَأَرَتْهَا خُضْرَةً بِجِلْدِهَا، فَلَمَّا جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالنِّسَاءُ يَنْصُرُ بَعْضُهُنَّ بَعْضًا قَالَتْ عَائِشَةُ مَا رَأَيْتُ مِثْلَ مَا يَلْقَى الْمُؤْمِنَاتُ، لَجِلْدُهَا أَشَدُّ خُضْرَةً مِنْ ثَوْبِهَا‏.‏ قَالَ وَسَمِعَ أَنَّهَا قَدْ أَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَجَاءَ وَمَعَهُ ابْنَانِ لَهُ مِنْ غَيْرِهَا‏.‏ قَالَتْ وَاللَّهِ مَا لِي إِلَيْهِ مِنْ ذَنْبٍ، إِلاَّ أَنَّ مَا مَعَهُ لَيْسَ بِأَغْنَى عَنِّي مِنْ هَذِهِ‏.‏ وَأَخَذَتْ هُدْبَةً مِنْ ثَوْبِهَا، فَقَالَ كَذَبَتْ وَاللَّهِ يَا رَسُولَ اللَّهِ، إِنِّي لأَنْفُضُهَا نَفْضَ الأَدِيمِ، وَلَكِنَّهَا نَاشِزٌ تُرِيدُ رِفَاعَةَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَإِنْ كَانَ ذَلِكَ لَمْ تَحِلِّي لَهُ ـ أَوْ لَمْ تَصْلُحِي لَهُ ـ حَتَّى يَذُوقَ مِنْ عُسَيْلَتِكِ ‏\"‏‏.‏ قَالَ وَأَبْصَرَ مَعَهُ ابْنَيْنِ فَقَالَ ‏\"‏ بَنُوكَ هَؤُلاَءِ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ هَذَا الَّذِي تَزْعُمِينَ مَا تَزْعُمِينَ، فَوَاللَّهِ لَهُمْ أَشْبَهُ بِهِ مِنَ الْغُرَابِ بِالْغُرَابِ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Bashar, telah menceritakan kepada kami Abd al-Wahhab, telah memberitakan kepada kami Ayyub, dari Ikrimah, bahawa Rifa'ah menceraikan isterinya, lalu Abdur Rahman bin az-Zubair al-Qurazi mengahwininya.  Aisyah berkata, (isteri itu) memakai khimar hijau.  Lalu dia mengadu kepada Aisyah, dan menunjukkan kepadanya kesan lebam hijau di kulitnya.  Apabila Rasulullah SAW datang, dan para wanita saling membantu sesama sendiri, Aisyah berkata, \"Aku tidak pernah melihat wanita yang menanggung derita seperti wanita yang beriman.  Lihatlah! Kulitnya lebih hijau daripada pakaiannya!\"  (Kemudian) dia mendengar bahawa isterinya telah menemui Rasulullah SAW, lalu dia datang bersama dua orang anaknya dari isteri yang lain.  (Isteri itu) berkata, \"Demi Allah, aku tidak berbuat salah kepadanya, melainkan dia tidak berupaya melakukan hubungan suami isteri dan tidak berguna bagiku seperti ini.\"  (Dia mengambil) hujung kainnya.  Lalu (suami) berkata, \"Dia berdusta demi Allah, wahai Rasulullah SAW!  Sesungguhnya aku mampu melakukan hubungan suami isteri, tetapi dia derhaka dan mahu kembali kepada Rifa'ah.\"  Lalu Rasulullah SAW bersabda, \"Jika begitulah niatmu, maka ketahuilah bahawa kamu tidak halal baginya sehingga dia melakukan hubungan suami isteri denganmu.\"  Lalu Nabi SAW melihat dua orang anak lelaki bersamanya, lalu bertanya, \"Adakah ini anak-anakmu?\"  Dia menjawab, \"Ya.\"  Rasulullah SAW bersabda, \"Inilah yang engkau dakwa? Demi Allah, mereka lebih mirip dengannya daripada seekor gagak kepada gagak yang lain.\""
  },
  {
    "id": 5599,
    "hadith_number": 5599,
    "tajuk_hadith": "Dua Lelaki Berpakaian Putih di Perang Uhud",
    "perawi_melayu": "Daripada Saad",
    "english_text": "On the day of the battle of Uhud, on the right and on the left of the Prophet (ﷺ) were two men wearing \nwhite clothes, and I had neither seen them before, nor did I see them afterwards.",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا مِسْعَرٌ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِيهِ، عَنْ سَعْدٍ، قَالَ رَأَيْتُ بِشِمَالِ النَّبِيِّ صلى الله عليه وسلم وَبِيَمِينِهِ رَجُلَيْنِ عَلَيْهِمَا ثِيَابٌ بِيضٌ يَوْمَ أُحُدٍ، مَا رَأَيْتُهُمَا قَبْلُ وَلاَ بَعْدُ‏.‏",
    "malay_translation": "Pada hari Perang Uhud, di sebelah kanan dan kiri Nabi SAW, terdapat dua orang lelaki yang memakai pakaian putih. Aku tidak pernah melihat mereka sebelum ini dan selepas itu."
  },
  {
    "id": 5600,
    "hadith_number": 5600,
    "tajuk_hadith": "Syurga Bagi Sesiapa Yang Mengakui Keesaan Allah",
    "perawi_melayu": "Riwayat Abu Dzar:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنِ الْحُسَيْنِ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ يَحْيَى بْنِ يَعْمَرَ، حَدَّثَهُ أَنَّ أَبَا الأَسْوَدِ الدِّيلِيَّ حَدَّثَهُ أَنَّ أَبَا ذَرٍّ ـ رضى الله عنه ـ حَدَّثَهُ قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم وَعَلَيْهِ ثَوْبٌ أَبْيَضُ وَهْوَ نَائِمٌ، ثُمَّ أَتَيْتُهُ وَقَدِ اسْتَيْقَظَ فَقَالَ ‏\"‏ مَا مِنْ عَبْدٍ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ ثُمَّ مَاتَ عَلَى ذَلِكَ، إِلاَّ دَخَلَ الْجَنَّةَ ‏\"‏‏.‏ قُلْتُ وَإِنْ زَنَى وَإِنْ سَرَقَ قَالَ ‏\"‏ وَإِنْ زَنَى وَإِنْ سَرَقَ ‏\"‏‏.‏ قُلْتُ وَإِنْ زَنَى وَإِنْ سَرَقَ قَالَ ‏\"‏ وَإِنْ زَنَى وَإِنْ سَرَقَ ‏\"‏‏.‏ قُلْتُ وَإِنْ زَنَى وَإِنْ سَرَقَ قَالَ ‏\"‏ وَإِنْ زَنَى وَإِنْ سَرَقَ عَلَى رَغْمِ أَنْفِ أَبِي ذَرٍّ ‏\"‏‏.‏ وَكَانَ أَبُو ذَرٍّ إِذَا حَدَّثَ بِهَذَا قَالَ وَإِنْ رَغِمَ أَنْفُ أَبِي ذَرٍّ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ هَذَا عِنْدَ الْمَوْتِ أَوْ قَبْلَهُ، إِذَا تَابَ وَنَدِمَ وَقَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ غُفِرَ لَهُ‏.‏",
    "malay_translation": "Aku datang kepada Nabi SAW ketika baginda sedang tidur memakai pakaian putih. Kemudian aku datang lagi kepada baginda setelah baginda bangun dari tidur. Baginda bersabda, \"Tidak ada seorang hamba pun yang berkata: 'Tiada Tuhan melainkan Allah,' kemudian dia mati dalam keadaan beriman dengan kalimah itu, melainkan dia akan masuk syurga.\" Aku bertanya, \"Walaupun dia berzina dan mencuri?\" Baginda menjawab, \"Walaupun dia berzina dan mencuri.\" Aku bertanya lagi, \"Walaupun dia berzina dan mencuri?\" Baginda menjawab lagi, \"Walaupun dia berzina dan mencuri.\" Aku bertanya lagi, \"Walaupun dia berzina dan mencuri?\" Baginda menjawab, \"Walaupun dia berzina dan mencuri, meskipun Abu Dzar tidak menyukainya.\"  Abu Dzar apabila menceritakan hadis ini berkata, \"walaupun Abu Dzar membencinya.\"  Abu Abdullah berkata, \"Ini adalah pada saat mati atau sebelumnya, jika dia bertaubat dan menyesal, lalu berkata 'Tiada Tuhan melainkan Allah,' maka dosanya akan diampunkan.\""
  },
  {
    "id": 5601,
    "hadith_number": 5601,
    "tajuk_hadith": "Larangan Penggunaan Sutera",
    "perawi_melayu": "Riwayat Abu Uthman An-Nahdi:",
    "english_text": "While we were with `Utba bin Farqad at Adharbijan, there came `Umar's letter indicating that Allah's Apostle had forbidden the use of silk except this much, then he pointed with his index and middle fingers. To our knowledge, by that he meant embroidery.",
    "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا قَتَادَةُ، قَالَ سَمِعْتُ أَبَا عُثْمَانَ النَّهْدِيَّ، أَتَانَا كِتَابُ عُمَرَ وَنَحْنُ مَعَ عُتْبَةَ بْنِ فَرْقَدٍ بِأَذْرَبِيجَانَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْحَرِيرِ، إِلاَّ هَكَذَا، وَأَشَارَ بِإِصْبَعَيْهِ اللَّتَيْنِ تَلِيَانِ الإِبْهَامَ قَالَ فِيمَا عَلِمْنَا أَنَّهُ يَعْنِي الأَعْلاَمَ‏.‏",
    "malay_translation": "Ketika kami bersama Utba bin Farqad di Azerbaijan, sampai surat daripada Umar yang menyatakan bahawa Rasulullah SAW telah melarang penggunaan sutera kecuali sedikit sahaja, lalu Baginda menunjukkan dengan jari telunjuk dan jari tengah Baginda.  Sepengetahuan kami, yang dimaksudkan Baginda ialah sulaman."
  },
  {
    "id": 5602,
    "hadith_number": 5602,
    "tajuk_hadith": "Larangan Memakai Sutera",
    "perawi_melayu": "Daripada Abu Uthman:",
    "english_text": "While we were at Adharbijan, `Umar wrote to us: 'Allah's Messenger (ﷺ) forbade wearing silk except this \nmuch. Then the Prophet (ﷺ) approximated his two fingers (index and middle fingers) (to illustrate that) to \nus.' Zuhair (the sub-narrator) raised up his middle and index fingers.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا عَاصِمٌ، عَنْ أَبِي عُثْمَانَ، قَالَ كَتَبَ إِلَيْنَا عُمَرُ وَنَحْنُ بِأَذْرَبِيجَانَ أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ لُبْسِ الْحَرِيرِ إِلاَّ هَكَذَا، وَصَفَّ لَنَا النَّبِيُّ صلى الله عليه وسلم إِصْبَعَيْهِ‏.‏ وَرَفَعَ زُهَيْرٌ الْوُسْطَى وَالسَّبَّابَةَ‏.‏",
    "malay_translation": "Ketika kami berada di Azerbaijan, Umar menulis kepada kami: “Rasulullah SAW melarang memakai sutera kecuali sebanyak ini.” Kemudian Nabi SAW menunjukkan kepada kami dengan menggunakan dua jarinya (jari telunjuk dan jari tengah). Zuhair (perawi seterusnya) mengangkat jari tengah dan jari telunjuknya."
  },
  {
    "id": 5603,
    "hadith_number": 5603,
    "tajuk_hadith": "Larangan Memakai Sutera",
    "perawi_melayu": "Daripada Abu Uthman:",
    "english_text": "While we were with `Utba. `Umar wrote to us: The Prophet (ﷺ) said, \"There is none who wears silk in this \nworld except that he will wear nothing of it in the Hereafter.\" ' Abu `Uthman pointed out with his \nmiddle and index fingers.\n\nThis hadith has also been narrated by Abu `Uthman.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنِ التَّيْمِيِّ، عَنْ أَبِي عُثْمَانَ، قَالَ كُنَّا مَعَ عُتْبَةَ فَكَتَبَ إِلَيْهِ عُمَرُ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يُلْبَسُ الْحَرِيرُ فِي الدُّنْيَا، إِلاَّ لَمْ يُلْبَسْ فِي الآخِرَةِ مِنْهُ ‏\"‏‏.‏ \nحَدَّثَنَا الْحَسَنُ بْنُ عُمَرَ، حَدَّثَنَا مُعْتَمِرٌ، حَدَّثَنَا أَبِي، حَدَّثَنَا أَبُو عُثْمَانَ،، وَأَشَارَ أَبُو عُثْمَانَ، بِإِصْبَعَيْهِ الْمُسَبِّحَةِ وَالْوُسْطَى‏.‏",
    "malay_translation": "Kami berada bersama Utba ketika Umar menulis kepada kami: Rasulullah SAW bersabda, \"Sesiapa yang memakai sutera di dunia, nescaya dia tidak akan memakainya di akhirat.\" Abu Uthman menunjukkan dengan jari telunjuk dan jari tengahnya.\n\nHadis ini juga diriwayatkan oleh Abu Uthman."
  },
  {
    "id": 5604,
    "hadith_number": 5604,
    "tajuk_hadith": "Larangan Menggunakan Emas, Perak, Sutera dan Di'baj di Dunia",
    "perawi_melayu": "Riwayat Ibnu Abi Laila:",
    "english_text": "While Hudhaifa was at Al-Madain, he asked for water whereupon the chief of the village brought him \nwater in a silver cup. Hudhaifa threw it at him and said, \"I have thrown it only because I have \nforbidden him to use it, but he does not stop using it. Allah's Messenger (ﷺ) said, 'Gold, silver, silk and Dibaj \n(a kind of silk) are for them (unbelievers) in this world and for you (Muslims) in the hereafter.'",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنِ ابْنِ أَبِي لَيْلَى، قَالَ كَانَ حُذَيْفَةُ بِالْمَدَايِنِ فَاسْتَسْقَى، فَأَتَاهُ دِهْقَانٌ بِمَاءٍ فِي إِنَاءٍ مِنْ فِضَّةٍ فَرَمَاهُ بِهِ وَقَالَ إِنِّي لَمْ أَرْمِهِ إِلاَّ أَنِّي نَهَيْتُهُ فَلَمْ يَنْتَهِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الذَّهَبُ وَالْفِضَّةُ وَالْحَرِيرُ وَالدِّيبَاجُ هِيَ لَهُمْ فِي الدُّنْيَا، وَلَكُمْ فِي الآخِرَةِ ‏\"‏‏.‏",
    "malay_translation": "Ketika Hudzaifah berada di Al-Madain, beliau meminta air lalu ketua kampung itu membawakan air kepadanya di dalam cawan perak. Hudzaifah membaling cawan itu ke arahnya dan berkata, \"Aku membalingnya kerana aku telah melarangnya daripada menggunakannya, tetapi dia tidak berhenti menggunakannya.\" Rasulullah SAW bersabda, \"Emas, perak, sutera dan dibaj (sejenis sutera) adalah untuk mereka (kafir) di dunia, dan untuk kamu (orang Islam) di akhirat.\""
  },
  {
    "id": 5605,
    "hadith_number": 5605,
    "tajuk_hadith": "Larangan Memakai Sutera di Akhirat",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "The Prophet (ﷺ) said, Whoever wears silk in this world shall not wear it in the Hereafter.",
    "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ ـ قَالَ شُعْبَةُ فَقُلْتُ أَعَنِ النَّبِيِّ صلى الله عليه وسلم فَقَالَ شَدِيدًا عَنِ النَّبِيِّ صلى الله عليه وسلم ـ فَقَالَ ‏\n\"‏ مَنْ لَبِسَ الْحَرِيرَ فِي الدُّنْيَا فَلَنْ يَلْبَسَهُ فِي الآخِرَةِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Barangsiapa yang memakai sutera di dunia, nescaya dia tidak akan memakainya di akhirat.\" "
  },
  {
    "id": 5606,
    "hadith_number": 5606,
    "tajuk_hadith": "Larangan Memakai Sutera di Akhirat",
    "perawi_melayu": "Daripada Thabit:",
    "english_text": "I heard Ibn Az-Zubair delivering a sermon, saying, \"Muhammad said, 'Whoever wears silk in this \nworld, shall not wear it in the Hereafter.\"",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، قَالَ سَمِعْتُ ابْنَ الزُّبَيْرِ، يَخْطُبُ يَقُولُ قَالَ مُحَمَّدٌ صلى الله عليه وسلم ‏\n\"‏ مَنْ لَبِسَ الْحَرِيرَ فِي الدُّنْيَا لَمْ يَلْبَسْهُ فِي الآخِرَةِ ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Ibnu Zubair menyampaikan khutbah, katanya, \"Muhammad s.a.w. bersabda, 'Barangsiapa yang memakai sutera di dunia, nescaya dia tidak akan memakainya di akhirat.'"
  },
  {
    "id": 5607,
    "hadith_number": 5607,
    "tajuk_hadith": "Larangan Memakai Sutera di Akhirat",
    "perawi_melayu": "Daripada Ibnu Az-Zubair:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، أَخْبَرَنَا شُعْبَةُ، عَنْ أَبِي ذُبْيَانَ، خَلِيفَةَ بْنِ كَعْبٍ قَالَ سَمِعْتُ ابْنَ الزُّبَيْرِ، يَقُولُ سَمِعْتُ عُمَرَ، يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَنْ لَبِسَ الْحَرِيرَ فِي الدُّنْيَا لَمْ يَلْبَسْهُ فِي الآخِرَةِ ‏\"‏‏.‏ وَقَالَ لَنَا أَبُو مَعْمَرٍ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ يَزِيدَ، قَالَتْ مُعَاذَةُ أَخْبَرَتْنِي أُمُّ عَمْرٍو بِنْتُ عَبْدِ اللَّهِ، سَمِعْتُ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ، سَمِعَ عُمَرَ، سَمِعَ النَّبِيَّ صلى الله عليه وسلم‏ نَحْوَهُ.",
    "malay_translation": "Telah menceritakan kepada kami Ali bin Al-Ja'd, telah memberitakan kepada kami Syu'bah, daripada Abi Dzuhayan, Khalifah bin Ka'ab, dia berkata: Aku mendengar Ibnu Az-Zubair berkata: Aku mendengar Umar berkata: Rasulullah SAW bersabda: \"Barangsiapa memakai sutera di dunia, nescaya dia tidak akan memakainya di akhirat.\"  Dan telah menceritakan kepada kami Abu Ma'mar, telah menceritakan kepada kami Abdul Warits, daripada Yazid, Mu'adz berkata: telah memberitakan kepadaku Umm Amru binti Abdullah, aku mendengar Abdullah Ibnu Az-Zubair, mendengar Umar, mendengar Nabi SAW (yang bermaksud) seumpamanya."
  },
  {
    "id": 5608,
    "hadith_number": 5608,
    "tajuk_hadith": "Larangan Memakai Sutera",
    "perawi_melayu": "Riwayat Umar bin Al-Khattab (r.a.):",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عِمْرَانَ بْنِ حِطَّانَ، قَالَ سَأَلْتُ عَائِشَةَ عَنِ الْحَرِيرِ، فَقَالَتِ ائْتِ ابْنَ عَبَّاسٍ فَسَلْهُ‏.‏ قَالَ فَسَأَلْتُهُ فَقَالَ سَلِ ابْنَ عُمَرَ‏.‏ قَالَ فَسَأَلْتُ ابْنَ عُمَرَ فَقَالَ أَخْبَرَنِي أَبُو حَفْصٍ ـ يَعْنِي عُمَرَ بْنَ الْخَطَّابِ ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّمَا يَلْبَسُ الْحَرِيرَ فِي الدُّنْيَا مَنْ لاَ خَلاَقَ لَهُ فِي الآخِرَةِ ‏\"‏‏.‏ فَقُلْتُ صَدَقَ وَمَا كَذَبَ أَبُو حَفْصٍ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ وَقَالَ عَبْدُ اللَّهِ بْنُ رَجَاءٍ حَدَّثَنَا حَرْبٌ عَنْ يَحْيَى حَدَّثَنِي عِمْرَانُ‏.‏ وَقَصَّ الْحَدِيثَ‏.‏",
    "malay_translation": "Daripada Muhammad bin Bashar, telah menceritakan kepada kami Usman bin Umar, telah menceritakan kepada kami Ali bin Mubarak, daripada Yahya bin Abi Katsir, daripada Imran bin Hitthan, katanya: Aku bertanya kepada Aisyah tentang sutera, maka dia berkata: Pergilah kepada Ibnu Abbas dan tanyakanlah kepadanya. Katanya: Maka aku bertanya kepadanya, lalu dia berkata: Tanya Ibnu Umar. Katanya: Maka aku bertanya kepada Ibnu Umar, lalu dia berkata: Abu Hafs – iaitu Umar bin Al-Khattab – telah memberitakan kepadaku bahawa Rasulullah SAW bersabda:  \"Sesungguhnya hanya orang yang tidak mempunyai bahagian di akhirat sajalah yang memakai sutera di dunia.\"  Maka aku berkata: Benarlah dia, dan Abu Hafs tidak berdusta terhadap Rasulullah SAW.  Dan Abdullah bin Raja’ berkata: Harb telah menceritakan kepada kami daripada Yahya, Imran telah menceritakan kepadaku. Dan dia menceritakan hadis tersebut."
  },
  {
    "id": 5609,
    "hadith_number": 5609,
    "tajuk_hadith": "Keutamaan Saad bin Muaz",
    "perawi_melayu": "Riwayat Al-Bara’",
    "english_text": "The Prophet (ﷺ) was given a silk garment as a gift and we started touching it with our hands and admiring it. On that the Prophet (ﷺ) said, \"Do you wonder at this?\" We said, \"Yes.\" He said, \"The handkerchiefs of Sa`d bin Mu`adh in Paradise are better than this.\"",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ أُهْدِيَ لِلنَّبِيِّ صلى الله عليه وسلم ثَوْبُ حَرِيرٍ، فَجَعَلْنَا نَلْمُسُهُ، وَنَتَعَجَّبُ مِنْهُ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَتَعْجَبُونَ مِنْ هَذَا ‏\"‏‏.‏ قُلْنَا نَعَمْ‏.‏ قَالَ ‏\"‏ مَنَادِيلُ سَعْدِ بْنِ مُعَاذٍ فِي الْجَنَّةِ خَيْرٌ مِنْ هَذَا ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW telah diberi sehelai kain sutera sebagai hadiah, maka kami pun menyentuhnya dan merasa kagum akannya.  Lalu Rasulullah SAW bersabda, \"Adakah kamu merasa kagum akan ini?\" Kami menjawab, \"Ya.\" Baginda SAW bersabda, \"Sapu tangan Saad bin Muaz di syurga adalah lebih baik daripada ini.\""
  },
  {
    "id": 5610,
    "hadith_number": 5610,
    "tajuk_hadith": "Larangan Nabi SAW Mengenai Penggunaan Emas dan Perak",
    "perawi_melayu": "Riwayat Hudzaifah:",
    "english_text": "The Prophet (ﷺ) forbade us to drink out of gold and silver vessels, or eat in it, Ann also forbade the \nwearing of silk and Dibaj or sitting on it.",
    "arabic_text": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي قَالَ، سَمِعْتُ ابْنَ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ حُذَيْفَةَ ـ رضى الله عنه ـ قَالَ نَهَانَا النَّبِيُّ صلى الله عليه وسلم أَنْ نَشْرَبَ فِي آنِيَةِ الذَّهَبِ وَالْفِضَّةِ، وَأَنْ نَأْكُلَ فِيهَا، وَعَنْ لُبْسِ الْحَرِيرِ وَالدِّيبَاجِ، وَأَنْ نَجْلِسَ عَلَيْهِ‏.‏",
    "malay_translation": "Daripada Hudzaifah r.a. berkata: Nabi SAW melarang kami daripada minum menggunakan bekas emas dan perak, dan daripada makan menggunakannya.  Baginda juga melarang daripada memakai sutera dan dibaj, serta daripada duduk di atasnya."
  },
  {
    "id": 5611,
    "hadith_number": 5611,
    "tajuk_hadith": "Larangan Menggunakan Mayathir Merah dan Al-Qassiy",
    "perawi_melayu": "Riwayat Ibnu Azib:",
    "english_text": "The Prophet (ﷺ) forbade us to use the red Mayathir and to use Al-Qassiy.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا سُفْيَانُ، عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ، حَدَّثَنَا مُعَاوِيَةُ بْنُ سُوَيْدِ بْنِ مُقَرِّنٍ، عَنِ ابْنِ عَازِبٍ، قَالَ نَهَانَا النَّبِيُّ صلى الله عليه وسلم عَنِ الْمَيَاثِرِ الْحُمْرِ وَالْقَسِّيِّ‏.‏",
    "malay_translation": "Rasulullah SAW melarang kita daripada menggunakan Mayathir merah dan Al-Qassiy."
  },
  {
    "id": 5612,
    "hadith_number": 5612,
    "tajuk_hadith": "Keizinan Nabi SAW untuk Az-Zubair dan Abdur-Rahman Memakai Sutera",
    "perawi_melayu": "Dari Anas:",
    "english_text": "The Prophet (ﷺ) allowed Az-Zubair and `Abdur-Rahman to wear silk because they were suffering from an itch.",
    "arabic_text": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا وَكِيعٌ، أَخْبَرَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ رَخَّصَ النَّبِيُّ صلى الله عليه وسلم لِلزُّبَيْرِ وَعَبْدِ الرَّحْمَنِ فِي لُبْسِ الْحَرِيرِ لِحِكَّةٍ بِهِمَا‏.‏",
    "malay_translation": "Telah menceritakan kepada saya Muhammad, memberitakan kepada kami Waki', memberitakan kepada kami Syu'bah, dari Qatadah, dari Anas, dia berkata, \"Nabi SAW telah memberi keizinan kepada Az-Zubair dan Abdur-Rahman untuk memakai sutera kerana mereka mengalami penyakit gatal.\""
  },
  {
    "id": 5613,
    "hadith_number": 5613,
    "tajuk_hadith": "Ali dan Baju Sutera",
    "perawi_melayu": "Daripada Ali bin Abi Talib:",
    "english_text": "The Prophet (ﷺ) gave me a silk suit. I went out wearing it, but seeing the signs of anger on his face, I tore it and distributed it among my wives.",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ بْنِ مَيْسَرَةَ، عَنْ زَيْدِ بْنِ وَهْبٍ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ كَسَانِي النَّبِيُّ صلى الله عليه وسلم حُلَّةً سِيَرَاءَ، فَخَرَجْتُ فِيهَا، فَرَأَيْتُ الْغَضَبَ فِي وَجْهِهِ، فَشَقَّقْتُهَا بَيْنَ نِسَائِي‏.‏",
    "malay_translation": "Rasulullah ﷺ memberikan aku sehelai pakaian sutera. Aku keluar memakainya, tetapi melihat tanda-tanda kemarahan di wajah baginda, maka aku mengoyakkan pakaian itu dan membahagikannya kepada isteri-isteriku."
  },
  {
    "id": 5614,
    "hadith_number": 5614,
    "tajuk_hadith": "Larangan Memakai Sutera Bagi Lelaki",
    "perawi_melayu": "Riwayat Abdullah bin Umar",
    "english_text": "`Umar saw a silk suit being sold, so he said, \"O Allah's Messenger (ﷺ)! Why don't you buy it so that you may \nwear it when delegates come to you, and also on Fridays?\" The Prophet (ﷺ) said, \"This is worn only by \nhim who has no share in the Hereafter.\" Afterwards the Prophet (ﷺ) sent to `Umar a silk suit suitable for \nwearing. `Umar said to the Prophet, \"You have given it to me to wear, yet I have heard you saying \nabout it what you said?\" The Prophet (ﷺ) said, \"I sent it to you so that you might either sell it or give it to \nsomebody else to wear.\"",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنِي جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، أَنَّ عُمَرَ ـ رضى الله عنه ـ رَأَى حُلَّةً سِيَرَاءَ تُبَاعُ فَقَالَ يَا رَسُولَ اللَّهِ لَوِ ابْتَعْتَهَا، تَلْبَسُهَا لِلْوَفْدِ إِذَا أَتَوْكَ وَالْجُمُعَةِ‏.‏ قَالَ ‏\"‏ إِنَّمَا يَلْبَسُ هَذِهِ مَنْ لاَ خَلاَقَ لَهُ ‏\"‏‏.‏ وَأَنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَ بَعْدَ ذَلِكَ إِلَى عُمَرَ حُلَّةَ سِيَرَاءَ حَرِيرٍ، كَسَاهَا إِيَّاهُ فَقَالَ عُمَرُ كَسَوْتَنِيهَا وَقَدْ سَمِعْتُكَ تَقُولُ فِيهَا مَا قُلْتَ فَقَالَ ‏\"‏ إِنَّمَا بَعَثْتُ إِلَيْكَ لِتَبِيعَهَا أَوْ تَكْسُوَهَا ‏\"‏‏.‏",
    "malay_translation": "Umar melihat sehelai pakaian sutera dijual, lalu beliau berkata, \"Wahai Rasulullah ﷺ! Mengapakah baginda tidak membelinya supaya baginda dapat memakainya ketika tetamu datang kepada baginda, dan juga pada hari Jumaat?\"  Rasulullah ﷺ bersabda, \"Pakaian ini hanya dipakai oleh mereka yang tiada bahagian di akhirat.\"  Kemudian, Rasulullah ﷺ menghantar kepada Umar sehelai pakaian sutera yang sesuai untuk dipakai. Umar berkata kepada Nabi, \"Baginda telah memberikannya kepada saya untuk dipakai, sedangkan saya telah mendengar baginda bersabda tentangnya apa yang baginda telah sabdakan?\" Rasulullah ﷺ bersabda, \"Aku menghantarnya kepadamu supaya engkau menjualnya atau memberikannya kepada orang lain untuk dipakai.\""
  },
  {
    "id": 5615,
    "hadith_number": 5615,
    "tajuk_hadith": "Pakaian Sutera Merah Ummi Kulthum",
    "perawi_melayu": "Anas bin Malik meriwayatkan:",
    "english_text": "that he had seen Um Kulthum, the daughter of Allah's Messenger (ﷺ) , wearing a red silk garment.",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّهُ رَأَى عَلَى أُمِّ كُلْثُومٍ ـ عَلَيْهَا السَّلاَمُ ـ بِنْتِ رَسُولِ اللَّهِ صلى الله عليه وسلم بُرْدَ حَرِيرٍ سِيَرَاءَ‏.‏",
    "malay_translation": "Anas bin Malik meriwayatkan bahawa beliau telah melihat Ummi Kulthum, puteri Rasulullah SAW, memakai sehelai kain sutera merah."
  },
  {
    "id": 5616,
    "hadith_number": 5616,
    "tajuk_hadith": "Kisah Umar dan Peristiwa Talak Nabi SAW",
    "perawi_melayu": "Riwayat Ibnu Abbas:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عُبَيْدِ بْنِ حُنَيْنٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَبِثْتُ سَنَةً وَأَنَا أُرِيدُ أَنْ أَسْأَلَ عُمَرَ عَنِ الْمَرْأَتَيْنِ اللَّتَيْنِ تَظَاهَرَتَا عَلَى النَّبِيِّ صلى الله عليه وسلم فَجَعَلْتُ أَهَابُهُ، فَنَزَلَ يَوْمًا مَنْزِلاً فَدَخَلَ الأَرَاكَ، فَلَمَّا خَرَجَ سَأَلْتُهُ فَقَالَ عَائِشَةُ وَحَفْصَةُ ـ ثُمَّ قَالَ ـ كُنَّا فِي الْجَاهِلِيَّةِ لاَ نَعُدُّ النِّسَاءَ شَيْئًا، فَلَمَّا جَاءَ الإِسْلاَمُ وَذَكَرَهُنَّ اللَّهُ، رَأَيْنَا لَهُنَّ بِذَلِكَ عَلَيْنَا حَقًّا، مِنْ غَيْرِ أَنْ نُدْخِلَهُنَّ فِي شَىْءٍ مِنْ أُمُورِنَا، وَكَانَ بَيْنِي وَبَيْنَ امْرَأَتِي كَلاَمٌ فَأَغْلَظَتْ لِي فَقُلْتُ لَهَا وَإِنَّكِ لَهُنَاكِ‏.‏ قَالَتْ تَقُولُ هَذَا لِي وَابْنَتُكَ تُؤْذِي النَّبِيَّ صلى الله عليه وسلم فَأَتَيْتُ حَفْصَةَ فَقُلْتُ لَهَا إِنِّي أُحَذِّرُكِ أَنْ تَعْصِي اللَّهَ وَرَسُولَهُ‏.‏ وَتَقَدَّمْتُ إِلَيْهَا فِي أَذَاهُ، فَأَتَيْتُ أُمَّ سَلَمَةَ فَقُلْتُ لَهَا‏.‏ فَقَالَتْ أَعْجَبُ مِنْكَ يَا عُمَرُ قَدْ دَخَلْتَ فِي أُمُورِنَا، فَلَمْ يَبْقَ إِلاَّ أَنْ تَدْخُلَ بَيْنَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَزْوَاجِهِ، فَرَدَّدَتْ، وَكَانَ رَجُلٌ مِنَ الأَنْصَارِ إِذَا غَابَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَشَهِدْتُهُ أَتَيْتُهُ بِمَا يَكُونُ، وَإِذَا غِبْتُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَشَهِدَ أَتَانِي بِمَا يَكُونُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَكَانَ مَنْ حَوْلَ رَسُولِ اللَّهِ صلى الله عليه وسلم قَدِ اسْتَقَامَ لَهُ، فَلَمْ يَبْقَ إِلاَّ مَلِكُ غَسَّانَ بِالشَّأْمِ، كُنَّا نَخَافُ أَنْ يَأْتِيَنَا، فَمَا شَعَرْتُ إِلاَّ بِالأَنْصَارِيِّ وَهْوَ يَقُولُ إِنَّهُ قَدْ حَدَثَ أَمْرٌ‏.‏ قُلْتُ لَهُ وَمَا هُوَ أَجَاءَ الْغَسَّانِيُّ قَالَ أَعْظَمُ مِنْ ذَاكَ، طَلَّقَ رَسُولُ اللَّهِ صلى الله عليه وسلم نِسَاءَهُ‏.‏ فَجِئْتُ فَإِذَا الْبُكَاءُ مِنْ حُجَرِهَا كُلِّهَا، وَإِذَا النَّبِيُّ صلى الله عليه وسلم قَدْ صَعِدَ فِي مَشْرُبَةٍ لَهُ، وَعَلَى باب الْمَشْرُبَةِ وَصِيفٌ فَأَتَيْتُهُ فَقُلْتُ اسْتَأْذِنْ لِي‏.‏ فَدَخَلْتُ فَإِذَا النَّبِيُّ صلى الله عليه وسلم عَلَى حَصِيرٍ قَدْ أَثَّرَ فِي جَنْبِهِ، وَتَحْتَ رَأْسِهِ مِرْفَقَةٌ مِنْ أَدَمٍ، حَشْوُهَا لِيفٌ، وَإِذَا أُهُبٌ مُعَلَّقَةٌ وَقَرَظٌ، فَذَكَرْتُ الَّذِي قُلْتُ لِحَفْصَةَ وَأُمِّ سَلَمَةَ، وَالَّذِي رَدَّتْ عَلَىَّ أُمُّ سَلَمَةَ، فَضَحِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَبِثَ تِسْعًا وَعِشْرِينَ لَيْلَةً، ثُمَّ نَزَلَ‏.‏",
    "malay_translation": "Aku telah menunggu selama setahun untuk bertanya kepada Umar tentang dua orang wanita yang bersatu menentang Nabi SAW, tetapi aku takut kepadanya.  Suatu hari, beliau turun dari kenderaan tunggangannya dan masuk ke kawasan pokok-pokok Arak untuk membuang air, dan setelah beliau keluar, aku bertanya kepadanya, lalu beliau berkata, \"(Mereka adalah) Aisyah dan Hafsah.\" Kemudian beliau menambah, \"Pada zaman Jahiliyyah, kami tidak mementingkan wanita, tetapi setelah datangnya Islam dan Allah SWT menyebut hak-hak mereka, kami telah memberikan hak-hak mereka tetapi tidak membenarkan mereka campur tangan dalam urusan kami.  \n\nAda suatu perselisihan di antara aku dan isteriku, lalu dia meninggikan suaranya kepadaku. Aku berkata kepadanya, 'Aneh! Engkau berani menjawabku begini?' Dia berkata, 'Ya. Adakah engkau berkata begini kepadaku sedangkan anak perempuanmu menyusahkan Rasulullah SAW?'  Maka aku pergi kepada Hafsah dan berkata kepadanya, 'Aku memperingatkan engkau agar jangan menderhakai Allah SWT dan Rasul-Nya.' Aku pergi dahulu kepada Hafsah, kemudian kepada Ummu Salamah dan berkata yang sama kepadanya. Dia berkata kepadaku, 'Wahai Umar! Aku hairan dengan kamu, engkau terlalu banyak campur tangan dalam urusan kami, sehingga engkau mahu mencampuri urusan Rasulullah SAW dan isteri-isterinya.' Lalu dia menolak nasihatku.  \n\nAda seorang lelaki Ansar; setiap kali dia tidak bersama Rasulullah SAW dan aku ada di sana, aku menyampaikan kepadanya apa yang telah berlaku (pada hari itu), dan jika aku tidak bersama Rasulullah SAW dan dia ada di sana, dia akan menyampaikan kepadaku apa yang telah berlaku mengenai berita dari Rasulullah SAW.  \n\nPada waktu itu, semua pemerintah di negeri-negeri sekitar telah menyerah kepada Rasulullah SAW kecuali Raja Ghassan di Syam, dan kami bimbang dia akan menyerang kami. Tiba-tiba orang Ansar itu datang dan berkata, 'Satu peristiwa besar telah berlaku!' Aku bertanya kepadanya, 'Apakah itu? Adakah Raja Ghassan telah datang?' Dia berkata, 'Lebih besar daripada itu! Rasulullah SAW telah menceraikan isteri-isterinya!' Aku pergi kepada mereka dan mendapati mereka semua menangis di rumah masing-masing, dan Nabi SAW telah naik ke sebuah bilik di atas. Di pintu bilik itu ada seorang hamba, lalu aku menghampirinya dan berkata, \"Minta izin untukku masuk.\" Dia membenarkan aku dan aku masuk untuk melihat Nabi SAW sedang berbaring di atas tikar yang telah meninggalkan kesan pada rusuknya. Di bawah kepalanya ada bantal kulit yang berisi pelepah kurma.  Ruang itu juga terdapat beberapa kulit dan rumput untuk penyamakan kulit. Kemudian aku menceritakan apa yang telah aku katakan kepada Hafsah dan Ummu Salamah dan jawapan yang diberikan oleh Ummu Salamah kepadaku. Rasulullah SAW tersenyum dan tinggal di situ selama dua puluh sembilan hari, kemudian turun."
  },
  {
    "id": 5617,
    "hadith_number": 5617,
    "tajuk_hadith": "Kehidupan Dunia dan Akhirat",
    "perawi_melayu": "Riwayat Ummu Salamah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَتْنِي هِنْدُ بِنْتُ الْحَارِثِ، عَنْ أُمِّ سَلَمَةَ، قَالَتِ اسْتَيْقَظَ النَّبِيُّ صلى الله عليه وسلم مِنَ اللَّيْلِ وَهْوَ يَقُولُ ‏\n\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ، مَاذَا أُنْزِلَ اللَّيْلَةَ مِنَ الْفِتْنَةِ، مَاذَا أُنْزِلَ مِنَ الْخَزَائِنِ، مَنْ يُوقِظُ صَوَاحِبَ الْحُجُرَاتِ، كَمْ مِنْ كَاسِيَةٍ فِي الدُّنْيَا عَارِيَةٍ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏ قَالَ الزُّهْرِيُّ وَكَانَتْ هِنْدٌ لَهَا أَزْرَارٌ فِي كُمَّيْهَا بَيْنَ أَصَابِعِهَا‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Muhammad, telah menceritakan kepada kami Hisyam, telah memberitakan kepada kami Ma’mar, dari Az-Zuhri, telah menceritakan kepadaku Hind binti Al-Harits, dari Ummu Salamah, dia berkata: Rasulullah SAW terjaga pada waktu malam sambil bersabda: \"Tiada Tuhan melainkan Allah. Apakah yang telah diturunkan pada malam ini berupa fitnah, apakah yang telah diturunkan berupa khazanah? Siapakah yang akan membangunkan penghuni-penghuni bilik-bilik ini? Betapa banyaknya wanita yang berpakaian indah di dunia tetapi akan telanjang pada hari kiamat.\" Az-Zuhri berkata: Dan Hind mempunyai kancing pada lengan bajunya di antara jarinya."
  },
  {
    "id": 5618,
    "hadith_number": 5618,
    "tajuk_hadith": "Rasulullah SAW Menganugerahkan Khamisah Kepada Um Khalid",
    "perawi_melayu": "Riwayat Um Khalid binti Khalid:",
    "english_text": "Some clothes were presented to Allah's Messenger (ﷺ) as a gift and there was a black Khamisa with it. The \nProphet asked (his companions), \"To whom do you suggest we give this Khamisa?\" The people kept \nquiet. Then he said, \"Bring me Um Khalid,\" So I was brought to him and he dressed me with it with \nhis own hands and said twice, \"May you live so long that you will wear out many garments.\" He then \nstarted looking at the embroidery of that Khamisa and said, \"O Um Khalid! This is Sana!\" (Sana in \nEthiopian language means beautiful.) 'Is-haq, a sub-narrator, said: A woman of my family had told me \nthat she had seen the Khamisa worn by Um Khalid.",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا إِسْحَاقُ بْنُ سَعِيدِ بْنِ عَمْرِو بْنِ سَعِيدِ بْنِ الْعَاصِ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَتْنِي أُمُّ خَالِدٍ بِنْتُ خَالِدٍ، قَالَتْ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِثِيَابٍ فِيهَا خَمِيصَةٌ سَوْدَاءُ قَالَ ‏\"‏ مَنْ تَرَوْنَ نَكْسُوهَا هَذِهِ الْخَمِيصَةَ ‏\"‏‏.‏ فَأُسْكِتَ الْقَوْمُ‏.‏ قَالَ ‏\"‏ ائْتُونِي بِأُمِّ خَالِدٍ ‏\"‏‏.‏ فَأُتِيَ بِي النَّبِيُّ صلى الله عليه وسلم فَأَلْبَسَهَا بِيَدِهِ وَقَالَ ‏\"‏ أَبْلِي وَأَخْلِقِي ‏\"‏‏.‏ مَرَّتَيْنِ فَجَعَلَ يَنْظُرُ إِلَى عَلَمِ الْخَمِيصَةِ، وَيُشِيرُ بِيَدِهِ إِلَىَّ وَيَقُولُ ‏\"‏ يَا أُمَّ خَالِدٍ هَذَا سَنَا ‏\"‏‏.‏ وَالسَّنَا بِلِسَانِ الْحَبَشِيَّةِ الْحَسَنُ‏.‏ قَالَ إِسْحَاقُ حَدَّثَتْنِي امْرَأَةٌ مِنْ أَهْلِي أَنَّهَا رَأَتْهُ عَلَى أُمِّ خَالِدٍ‏.‏",
    "malay_translation": "Baginda Rasulullah SAW menerima hadiah pakaian, antaranya ialah sehelai khamisah berwarna hitam. Baginda bertanya kepada para sahabat, \"Kepada siapakah patut kita berikan khamisah ini?\" Para sahabat hanya mendiamkan diri. Kemudian Baginda bersabda, \"Bawalah Um Khalid kepadaku.\" Maka, saya dibawa menghadap Baginda dan Baginda sendiri yang memakaikan khamisah itu kepada saya seraya bersabda dua kali, \"Semoga engkau hidup panjang sehingga dapat menghabisi banyak pakaian.\" Kemudian Baginda memandang sulaman khamisah itu dan bersabda, \"Wahai Um Khalid! Ini adalah Sana!\" (Sana dalam bahasa Habsyi bermaksud cantik.) Ishaq, seorang perawi sub, berkata: Seorang wanita daripada keluarga saya memberitahu saya bahawa dia telah melihat khamisah itu dipakai oleh Um Khalid."
  },
  {
    "id": 5619,
    "hadith_number": 5619,
    "tajuk_hadith": "Larangan Menggunakan Kunyit Bagi Lelaki",
    "perawi_melayu": "Anas meriwayatkan:",
    "english_text": "The Prophet (ﷺ) forbade men to use saffron.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ، قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ يَتَزَعْفَرَ الرَّجُلُ‏.‏",
    "malay_translation": "Anas meriwayatkan bahawa Nabi SAW melarang lelaki daripada menggunakan kunyit."
  },
  {
    "id": 5620,
    "hadith_number": 5620,
    "tajuk_hadith": "Larangan Memakai Pakaian Berwarna Bagi Orang Yang Berihram",
    "perawi_melayu": "Riwayat Ibnu Umar:",
    "english_text": "The Prophet (ﷺ) forbade Muhrims to wear clothes dyed with Wars or saffron.",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ يَلْبَسَ الْمُحْرِمُ ثَوْبًا مَصْبُوغًا بِوَرْسٍ أَوْ بِزَعْفَرَانٍ‏.‏",
    "malay_translation": "Rasulullah SAW melarang orang yang berihram memakai pakaian yang diwarnakan dengan wars atau kunyit."
  },
  {
    "id": 5621,
    "hadith_number": 5621,
    "tajuk_hadith": "Ketampanan Rasulullah SAW",
    "perawi_melayu": "Riwayat Al-Bara’",
    "english_text": "The Prophet (ﷺ) was of a modest height. I saw him wearing a red suit, and I did not see anything better than him.",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، سَمِعَ الْبَرَاءَ ـ رضى الله عنه ـ يَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم مَرْبُوعًا، وَقَدْ رَأَيْتُهُ فِي حُلَّةٍ حَمْرَاءَ مَا رَأَيْتُ شَيْئًا أَحْسَنَ مِنْهُ‏.‏",
    "malay_translation": "Rasulullah SAW  mempunyai tubuh yang sederhana.  Aku pernah melihat baginda memakai jubah merah, dan aku tidak pernah melihat apa-apa yang lebih tampan daripada baginda."
  },
  {
    "id": 5622,
    "hadith_number": 5622,
    "tajuk_hadith": "Tujuh Perkara Yang Diperintahkan dan Dilarang oleh Nabi SAW",
    "perawi_melayu": "Daripada Al-Bara' رضي الله عنه",
    "english_text": "The Prophet (ﷺ) ordered us to observe seven things: To visit the sick; follow funeral processions; say \n'May Allah bestow His Mercy on you', to the sneezer if he says, 'Praise be to Allah!; He forbade us to \nwear silk, Dibaj, Qassiy and Istibarq (various kinds of silken clothes); or to use red Mayathir (silkcushions). \n(See Hadith No. 253 A, Vol. 8).",
    "arabic_text": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ أَشْعَثَ، عَنْ مُعَاوِيَةَ بْنِ سُوَيْدِ بْنِ مُقَرِّنٍ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ أَمَرَنَا النَّبِيُّ صلى الله عليه وسلم بِسَبْعٍ عِيَادَةِ الْمَرِيضِ، وَاتِّبَاعِ الْجَنَائِزِ، وَتَشْمِيتِ الْعَاطِسِ، وَنَهَانَا عَنْ لُبْسِ الْحَرِيرِ، وَالدِّيبَاجِ، وَالْقَسِّيِّ، وَالإِسْتَبْرَقِ، وَمَيَاثِرِ الْحُمْرِ‏.‏",
    "malay_translation": "Daripada Al-Bara' رضي الله عنه,  berkata: Nabi ﷺ memerintahkan kita terhadap tujuh perkara: melawat orang sakit, mengiringi jenazah, mengucapkan 'Yarhamukallah' kepada orang yang bersin sekiranya dia mengucapkan 'Alhamdulillah', dan melarang kita daripada memakai sutera, dibaj, qassi dan istibraq (pelbagai jenis pakaian sutera), dan daripada menggunakan mi'athil merah (kusyen sutera)."
  },
  {
    "id": 5623,
    "hadith_number": 5623,
    "tajuk_hadith": "Nabi SAW Menunaikan Solat Dengan Memakai Kasut",
    "perawi_melayu": "Riwayat Sa'id Abu Maslama:",
    "english_text": "I asked Anas (bin Malik), \"Did the Prophet (ﷺ) use to offer the prayers with his shoes on?\" He said, \n\"Yes.\"",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ سَعِيدٍ أَبِي مَسْلَمَةَ، قَالَ سَأَلْتُ أَنَسًا أَكَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي فِي نَعْلَيْهِ قَالَ نَعَمْ‏.‏",
    "malay_translation": "Aku bertanya kepada Anas (bin Malik), \"Adakah Nabi SAW pernah menunaikan solat dengan memakai kasut?\" Jawabnya, \"Ya.\""
  },
  {
    "id": 5624,
    "hadith_number": 5624,
    "tajuk_hadith": "Amalan Abdullah bin Umar Berdasarkan Teladan Rasulullah SAW",
    "perawi_melayu": "Riwayat Sa`id Al-Maqburi:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ عُبَيْدِ بْنِ جُرَيْجٍ، أَنَّهُ قَالَ لِعَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ رَأَيْتُكَ تَصْنَعُ أَرْبَعًا لَمْ أَرَ أَحَدًا مِنْ أَصْحَابِكَ يَصْنَعُهَا‏.‏ قَالَ مَا هِيَ يَا ابْنَ جُرَيْجٍ قَالَ رَأَيْتُكَ لاَ تَمَسُّ مِنَ الأَرْكَانِ إِلاَّ الْيَمَانِيَيْنِ، وَرَأَيْتُكَ تَلْبَسُ النِّعَالَ السِّبْتِيَّةَ، وَرَأَيْتُكَ تَصْبُغُ بِالصُّفْرَةِ، وَرَأَيْتُكَ إِذَا كُنْتَ بِمَكَّةَ أَهَلَّ النَّاسُ إِذَا رَأَوُا الْهِلاَلَ، وَلَمْ تُهِلَّ أَنْتَ حَتَّى كَانَ يَوْمَ التَّرْوِيَةِ‏.‏ فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ عُمَرَ أَمَّا الأَرْكَانُ فَإِنِّي لَمْ أَرَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَمَسُّ إِلاَّ الْيَمَانِيَيْنِ، وَأَمَّا النِّعَالُ السِّبْتِيَّةُ فَإِنِّي رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَلْبَسُ النِّعَالَ الَّتِي لَيْسَ فِيهَا شَعَرٌ وَيَتَوَضَّأُ فِيهَا فَأَنَا أُحِبُّ أَنْ أَلْبَسَهَا، وَأَمَّا الصُّفْرَةُ فَإِنِّي رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَصْبُغُ بِهَا، فَأَنَا أُحِبُّ أَنْ أَصْبُغَ بِهَا وَأَمَّا الإِهْلاَلُ فَإِنِّي لَمْ أَرَ رَسُولَ اللَّهِ صلى الله عليه وسلم يُهِلُّ حَتَّى تَنْبَعِثَ بِهِ رَاحِلَتُهُ‏.‏",
    "malay_translation": "Ubaid bin Juraij berkata kepada Abdullah bin Umar, \"Saya melihat engkau melakukan empat perkara yang tidak saya lihat dilakukan oleh sahabat-sahabatmu.\" Ibn Umar bertanya, \"Apakah itu, wahai Ibnu Juraij?\" Jawabnya, \"Saya melihat engkau hanya menyentuh dua sudut Kaabah dari arah Yaman ketika tawaf; saya melihat engkau memakai kasut Sabtiyya; saya melihat engkau mewarnakan rambut dengan sufara; dan saya melihat apabila engkau berada di Mekah, orang ramai berihram sebaik sahaja melihat hilal (pada hari pertama Zulhijjah), tetapi engkau tidak berihram sehingga hari Tarwiyah (8 Zulhijjah).\" Abdullah bin Umar menjawab, \"Adapun berkenaan sudut-sudut Kaabah, saya tidak pernah melihat Rasulullah SAW menyentuh selain dua sudut dari arah Yaman. Adapun kasut Sabtiyya, saya pernah melihat Rasulullah SAW memakai kasut kulit yang tidak berbulu dan baginda berwuduk dengan memakainya, maka saya suka memakainya. Adapun mewarnakan rambut dengan sufara, saya pernah melihat Rasulullah SAW mewarnakan rambut baginda dengannya, maka saya suka mewarnakan rambut saya dengannya. Adapun berihram, saya tidak pernah melihat Rasulullah SAW berihram sehingga untanya berangkat (pada 8 Zulhijjah).\""
  },
  {
    "id": 5625,
    "hadith_number": 5625,
    "tajuk_hadith": "Larangan Memakai Pakaian Berwarna dan Panduan Mengenai Kasut untuk Muḥrim",
    "perawi_melayu": "Riwayat Ibnu Umar:",
    "english_text": "Allah's Messenger (ﷺ) forbade that a Muhrim should wear clothes dyed with Saffron or Wars, and said, \n\"Whoever has no shoes can put on Khuffs (socks made from thick fabric or leather) after cutting it \nbelow the ankles.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَلْبَسَ الْمُحْرِمُ ثَوْبًا مَصْبُوغًا بِزَعْفَرَانٍ أَوْ وَرْسٍ، وَقَالَ ‏\n\"‏ مَنْ لَمْ يَجِدْ نَعْلَيْنِ فَلْيَلْبَسْ خُفَّيْنِ، وَلْيَقْطَعْهُمَا أَسْفَلَ مِنَ الْكَعْبَيْنِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW melarang orang yang berihram memakai pakaian yang dicelup dengan kunyit atau warna merah tua. Baginda bersabda:  \"Barangsiapa yang tidak mendapat kasut, maka hendaklah dia memakai khuff (stokin daripada kain tebal atau kulit) dan hendaklah memotongnya di bawah buku lali.\""
  },
  {
    "id": 5626,
    "hadith_number": 5626,
    "tajuk_hadith": "Pakaian Pengganti Izar dan Kasut",
    "perawi_melayu": "Riwayat Ibnu Abbas:",
    "english_text": "The Prophet (ﷺ) said, \"Whoever has no Izar (waist sheet), can wear trousers; and whoever has no sandals, can wear Khuffs (socks made from thick fabric or leather, but cut them short below the ankles).\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرِ بْنِ زَيْدٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَنْ لَمْ يَكُنْ لَهُ إِزَارٌ فَلْيَلْبَسِ السَّرَاوِيلَ، وَمَنْ لَمْ يَكُنْ لَهُ نَعْلاَنِ فَلْيَلْبَسْ خُفَّيْنِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Barangsiapa yang tidak mempunyai izar (kain sarung), maka hendaklah dia memakai seluar; dan barangsiapa yang tidak mempunyai kasut, maka hendaklah dia memakai khuff (stoking daripada kain tebal atau kulit, tetapi hendaklah dipotong pendek di bawah buku lali).\""
  },
  {
    "id": 5627,
    "hadith_number": 5627,
    "tajuk_hadith": "Keutamaan Memulakan dari Sebelah Kanan",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "The Prophet (ﷺ) used to like starting from the right in performing ablution, combing his hair and putting on his shoes.",
    "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي أَشْعَثُ بْنُ سُلَيْمٍ، سَمِعْتُ أَبِي يُحَدِّثُ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُحِبُّ التَّيَمُّنَ فِي طُهُورِهِ وَتَرَجُّلِهِ وَتَنَعُّلِهِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami, Hajjaj bin Minhal, telah menceritakan kepada kami, Syu'bah, berkata: Telah memberitakan kepadaku, Asy'ats bin Sulaim, aku mendengar bapaku menceritakan, daripada Masruq, daripada Aisyah - radiallahu 'anha - berkata: Nabi ﷺ menyukai memulai dari sebelah kanan dalam bersuci, memakai pakaian, dan memakai kasut."
  },
  {
    "id": 5628,
    "hadith_number": 5628,
    "tajuk_hadith": "Cara Memakai Kasut",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "Allah's Messenger (ﷺ) said, \"If you want to put on your shoes, put on the right shoe first; and if you want to \ntake them off, take the left one first. Let the right shoe be the first to be put on and the last to be taken \noff.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا انْتَعَلَ أَحَدُكُمْ فَلْيَبْدَأْ بِالْيَمِينِ وَإِذَا نَزَعَ فَلْيَبْدَأْ بِالشِّمَالِ، لِتَكُنِ الْيُمْنَى أَوَّلَهُمَا تُنْعَلُ وَآخِرَهُمَا تُنْزَعُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Apabila kamu hendak memakai kasut, maka pakailah kasut sebelah kanan terlebih dahulu. Dan apabila kamu hendak menanggalkan kasut, maka tanggalkan kasut sebelah kiri terlebih dahulu. Hendaklah kasut sebelah kanan menjadi yang pertama dipakai dan yang terakhir ditanggalkan.\""
  },
  {
    "id": 5629,
    "hadith_number": 5629,
    "tajuk_hadith": "Larangan Memakai Kasut Sebiji",
    "perawi_melayu": "Dari Abu Hurairah",
    "english_text": "Allah's Messenger (ﷺ) said, \"None of you should walk, wearing one shoe only; he should either put on both \nshoes or put on no shoes whatsoever.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَمْشِي أَحَدُكُمْ فِي نَعْلٍ وَاحِدَةٍ لِيُحْفِهِمَا جَمِيعًا، أَوْ لِيَنْعَلْهُمَا جَمِيعًا ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Janganlah sesiapa di antara kamu berjalan dengan memakai hanya sebelah kasut sahaja; hendaklah dia memakai kedua-dua kasut atau tidak memakai kasut langsung.\""
  },
  {
    "id": 5630,
    "hadith_number": 5630,
    "tajuk_hadith": "Kasut Nabi SAW Mempunyai Dua Tali",
    "perawi_melayu": "Anas meriwayatkan:",
    "english_text": "The sandal of the Prophet (ﷺ) had two straps.",
    "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسٌ ـ رضى الله عنه ـ أَنَّ نَعْلَ، النَّبِيِّ صلى الله عليه وسلم كَانَ لَهَا قِبَالاَنِ‏.‏",
    "malay_translation": "Anas r.a. meriwayatkan bahawa kasut Nabi SAW mempunyai dua tali."
  },
  {
    "id": 5631,
    "hadith_number": 5631,
    "tajuk_hadith": "Kasut Nabi SAW",
    "perawi_melayu": "Daripada Isaa bin Tahman:",
    "english_text": "Anas bin Malik brought out for us, two sandals having two straps. Thabit Al-Banani said, \"These were \nthe sandals of the Prophet (ﷺ) .\"",
    "arabic_text": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا عِيسَى بْنُ طَهْمَانَ، قَالَ خَرَجَ إِلَيْنَا أَنَسُ بْنُ مَالِكٍ بِنَعْلَيْنِ لَهُمَا قِبَالاَنِ، فَقَالَ ثَابِتٌ الْبُنَانِيُّ هَذِهِ نَعْلُ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Anas bin Malik telah mengeluarkan untuk kami dua pasang sandal yang mempunyai dua tali. Thabit Al-Banani berkata, \"Ini adalah sandal Nabi Muhammad ﷺ.\""
  },
  {
    "id": 5632,
    "hadith_number": 5632,
    "tajuk_hadith": "Air Wudhu Rasulullah SAW",
    "perawi_melayu": "Riwayat Abu Juhaifa:",
    "english_text": "I came to the Prophet (ﷺ) while he was inside a red leather tent, and I saw Bilal taking the remaining \nwater of the ablution of the Prophet, and the people were taking of that water and rubbing it on their \nfaces; and whoever could not get anything of it, would share the moisture of the hand of his \ncompanion (and then rub it on his face).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ، قَالَ حَدَّثَنِي عُمَرُ بْنُ أَبِي زَائِدَةَ، عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ، عَنْ أَبِيهِ، قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم وَهْوَ فِي قُبَّةٍ حَمْرَاءَ مِنْ أَدَمٍ، وَرَأَيْتُ بِلاَلاً أَخَذَ وَضُوءَ النَّبِيِّ صلى الله عليه وسلم وَالنَّاسُ يَبْتَدِرُونَ الْوَضُوءَ، فَمَنْ أَصَابَ مِنْهُ شَيْئًا تَمَسَّحَ بِهِ، وَمَنْ لَمْ يُصِبْ مِنْهُ شَيْئًا أَخَذَ مِنْ بَلَلِ يَدِ صَاحِبِهِ‏.‏",
    "malay_translation": "Aku datang kepada Nabi ﷺ ketika Baginda berada di dalam khemah merah diperbuat daripada kulit, dan aku melihat Bilal mengambil air wudhu Nabi ﷺ yang tinggal, dan orang ramai mengambil air tersebut dan mengusapkannya ke muka mereka; dan sesiapa yang tidak mendapat sebarang air, akan berkongsi kelembapan tangan sahabatnya (dan kemudian mengusapkannya ke mukanya)."
  },
  {
    "id": 5633,
    "hadith_number": 5633,
    "tajuk_hadith": "Rasulullah SAW Mengumpulkan Ansar",
    "perawi_melayu": "Anas bin Malik:",
    "english_text": "The Prophet (ﷺ) called for the Ansar and gathered them in a leather tent.",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، ح وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ قَالَ أَرْسَلَ النَّبِيُّ صلى الله عليه وسلم إِلَى الأَنْصَارِ، وَجَمَعَهُمْ فِي قُبَّةٍ مِنْ أَدَمٍ‏.‏",
    "malay_translation": "Anas bin Malik meriwayatkan: Nabi Muhammad SAW telah memanggil orang-orang Ansar dan mengumpulkan mereka di dalam sebuah khemah yang diperbuat daripada kulit."
  },
  {
    "id": 5634,
    "hadith_number": 5634,
    "tajuk_hadith": "Amal Ibadah Yang Berterusan",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرٍ، حَدَّثَنَا مُعْتَمِرٌ، عَنْ عُبَيْدِ اللَّهِ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَحْتَجِرُ حَصِيرًا بِاللَّيْلِ فَيُصَلِّي، وَيَبْسُطُهُ بِالنَّهَارِ فَيَجْلِسُ عَلَيْهِ، فَجَعَلَ النَّاسُ يَثُوبُونَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَيُصَلُّونَ بِصَلاَتِهِ حَتَّى كَثُرُوا فَأَقْبَلَ فَقَالَ ‏\n\"‏ يَا أَيُّهَا النَّاسُ خُذُوا مِنَ الأَعْمَالِ مَا تُطِيقُونَ، فَإِنَّ اللَّهَ لاَ يَمَلُّ حَتَّى تَمَلُّوا، وَإِنَّ أَحَبَّ الأَعْمَالِ إِلَى اللَّهِ مَا دَامَ وَإِنْ قَلَّ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Muhammad bin Abi Bakar, telah menceritakan kepada kami Mu'tamir, daripada Ubaidillah, daripada Said bin Abi Said, daripada Abu Salamah bin Abdur Rahman, daripada Aisyah r.a. bahawa Nabi SAW biasa menghamparkan tikar pada waktu malam untuk solat, dan melebarkannya pada siang hari lalu duduk di atasnya.  Kemudian orang ramai mula datang kepada Nabi SAW untuk menunaikan solat berjemaah di belakang baginda sehingga mereka ramai. Maka baginda berpaling dan berkata, \"Wahai sekalian manusia, ambillah amalan-amalan yang mampu kamu lakukan, kerana sesungguhnya Allah tidak jemu sehingga kamu jemu, dan sesungguhnya amalan yang paling disukai oleh Allah ialah amalan yang berterusan walaupun sedikit.\""
  },
  {
    "id": 5635,
    "hadith_number": 5635,
    "tajuk_hadith": "Nabi SAW Memberi Jubah Kepada Makhramah",
    "perawi_melayu": "Riwayat Al-Miswar bin Makhramah:",
    "english_text": "My father, Makhrama said to me, \"I have come to know that some cloaks have come to the Prophet (ﷺ) and he is distributing them. So O my son! take me to him.\" We went to the Prophet (ﷺ) and found him in the house. My father said to me, \"O my son! Call the Prophet (ﷺ) for me.\" I found it hard to do so, so I said surprisingly, \"Shall I call Allah's Messenger (ﷺ) for you ?\" My father said, \"O mu son! He is not a tyrant.\" So I called him and he came out wearing a Dibaj cloak having gold buttons, and said: \"O Makhrama, I kept this for you.\" The Prophet (ﷺ) then gave it to him.",
    "arabic_text": "وَقَالَ اللَّيْثُ حَدَّثَنِي ابْنُ أَبِي مُلَيْكَةَ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، أَنَّ أَبَاهُ، مَخْرَمَةَ قَالَ لَهُ يَا بُنَىَّ إِنَّهُ بَلَغَنِي أَنَّ النَّبِيَّ صلى الله عليه وسلم قَدِمَتْ عَلَيْهِ أَقْبِيَةٌ فَهْوَ يَقْسِمُهَا، فَاذْهَبْ بِنَا إِلَيْهِ، فَذَهَبْنَا فَوَجَدْنَا النَّبِيَّ صلى الله عليه وسلم فِي مَنْزِلِهِ، فَقَالَ لِي يَا بُنَىَّ ادْعُ لِي النَّبِيَّ صلى الله عليه وسلم فَأَعْظَمْتُ ذَلِكَ‏.‏ فَقُلْتُ أَدْعُو لَكَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا بُنَىَّ إِنَّهُ لَيْسَ بِجَبَّارٍ‏.‏ فَدَعَوْتُهُ فَخَرَجَ وَعَلَيْهِ قَبَاءٌ مِنْ دِيبَاجٍ مُزَرَّرٌ بِالذَّهَبِ، فَقَالَ ‏\n\"‏ يَا مَخْرَمَةُ هَذَا خَبَأْنَاهُ لَكَ ‏\"‏‏.‏ فَأَعْطَاهُ إِيَّاهُ‏.‏",
    "malay_translation": "Bapa saya, Makhramah berkata kepada saya, \"Aku telah mendapat khabar bahawa beberapa jubah telah sampai kepada Nabi SAW dan baginda sedang mengagihkannya. Oleh itu, wahai anakku! bawalah aku kepada baginda.\" Kami pergi kepada Nabi SAW dan mendapati baginda di rumah. Bapa saya berkata kepada saya, \"Wahai anakku! Panggillah Nabi SAW untukku.\" Aku merasa sukar untuk berbuat demikian, lalu aku berkata dengan hairan, \"Patutkah aku memanggil Rasulullah SAW untukmu?\" Bapa saya berkata, \"Wahai anakku! Baginda bukanlah seorang yang zalim.\" Lalu aku memanggil baginda, dan baginda keluar dengan memakai jubah dibaj yang berkancing emas, dan berkata: \"Wahai Makhramah, ini telah kusimpan untukmu.\" Kemudian Nabi SAW memberikannya kepadanya."
  },
  {
    "id": 5636,
    "hadith_number": 5636,
    "tajuk_hadith": "Larangan dan Perintah Nabi SAW",
    "perawi_melayu": "Riwayat Al-Bara' bin Azib:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا أَشْعَثُ بْنُ سُلَيْمٍ، قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ سُوَيْدِ بْنِ مُقَرِّنٍ، قَالَ سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ ـ رضى الله عنهما ـ يَقُولُ نَهَانَا النَّبِيُّ صلى الله عليه وسلم عَنْ سَبْعٍ نَهَى عَنْ خَاتَمِ الذَّهَبِ ـ أَوْ قَالَ حَلْقَةِ الذَّهَبِ ـ وَعَنِ الْحَرِيرِ، وَالإِسْتَبْرَقِ، وَالدِّيبَاجِ، وَالْمِيثَرَةِ الْحَمْرَاءِ، وَالْقَسِّيِّ، وَآنِيَةِ الْفِضَّةِ، وَأَمَرَنَا بِسَبْعٍ بِعِيَادَةِ الْمَرِيضِ، وَاتِّبَاعِ الْجَنَائِزِ، وَتَشْمِيتِ الْعَاطِسِ، وَرَدِّ السَّلاَمِ، وَإِجَابَةِ الدَّاعِي، وَإِبْرَارِ الْمُقْسِمِ، وَنَصْرِ الْمَظْلُومِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Adam, telah menceritakan kepada kami Syu'bah, telah menceritakan kepada kami Asy'ats bin Sulaim, dia berkata: Aku mendengar Muawiyah bin Suwaid bin Muqarrin berkata: Aku mendengar Al-Bara' bin Azib r.a. berkata: Nabi SAW melarang kami daripada tujuh perkara:  Nabi SAW melarang daripada cincin emas – atau baginda berkata gelang emas – dan daripada sutera, istabraq, dibaj, mayathir merah, al-qassiy, dan bekas perak. Dan baginda memerintahkan kami untuk tujuh perkara iaitu melawat orang sakit, mengiringi jenazah, mendoakan orang yang bersin, membalas salam, menerima undangan, menunaikan janji, dan menolong orang yang dizalimi."
  },
  {
    "id": 5637,
    "hadith_number": 5637,
    "tajuk_hadith": "Larangan Memakai Cincin Emas",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) forbade the wearing of a gold ring.",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ نَهَى عَنْ خَاتَمِ الذَّهَبِ‏.‏ وَقَالَ عَمْرٌو أَخْبَرَنَا شُعْبَةُ عَنْ قَتَادَةَ سَمِعَ النَّضْرَ سَمِعَ بَشِيرًا مِثْلَهُ‏.‏",
    "malay_translation": "Rasulullah SAW melarang memakai cincin emas."
  },
  {
    "id": 5638,
    "hadith_number": 5638,
    "tajuk_hadith": "Cincin Rasulullah SAW",
    "perawi_melayu": "Daripada Abdullah:",
    "english_text": "Allah's Messenger (ﷺ) wore a gold or silver .. ring and placed its stone towards the palm of his hand. The \npeople also started wearing gold rings like it, but when the Prophet (ﷺ) saw them wearing such rings, he \nthrew away that golden ring and then wore a silver ring.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اتَّخَذَ خَاتَمًا مِنْ ذَهَبٍ، وَجَعَلَ فَصَّهُ مِمَّا يَلِي كَفَّهُ، فَاتَّخَذَهُ النَّاسُ، فَرَمَى بِهِ، وَاتَّخَذَ خَاتَمًا مِنْ وَرِقٍ أَوْ فِضَّةٍ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Musaddad, telah menceritakan kepada kami Yahya, dari Ubaidillah, dia berkata; telah menceritakan kepadaku Nafi', daripada Abdullah r.a., bahawa Rasulullah SAW memakai cincin daripada emas, dan beliau meletakkan batu permatanya menghadap tapak tangan. Kemudian, orang ramai pun turut memakai cincin emas yang serupa.  Apabila Nabi SAW melihat mereka memakai cincin seumpama itu, baginda pun membuang cincin emas tersebut dan kemudian memakai cincin perak."
  },
  {
    "id": 5639,
    "hadith_number": 5639,
    "tajuk_hadith": "Cincin Rasulullah SAW",
    "perawi_melayu": "Riwayat Ibnu Umar:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اتَّخَذَ خَاتَمًا مِنْ ذَهَبٍ أَوْ فِضَّةٍ، وَجَعَلَ فَصَّهُ مِمَّا يَلِي كَفَّهُ، وَنَقَشَ فِيهِ مُحَمَّدٌ رَسُولُ اللَّهِ‏.‏ فَاتَّخَذَ النَّاسُ مِثْلَهُ، فَلَمَّا رَآهُمْ قَدِ اتَّخَذُوهَا رَمَى بِهِ، وَقَالَ ‏\n\"‏ لاَ أَلْبَسُهُ أَبَدًا ‏\"‏‏.‏ ثُمَّ اتَّخَذَ خَاتَمًا مِنْ فِضَّةٍ، فَاتَّخَذَ النَّاسُ خَوَاتِيمَ الْفِضَّةِ‏.‏ قَالَ ابْنُ عُمَرَ فَلَبِسَ الْخَاتَمَ بَعْدَ النَّبِيِّ صلى الله عليه وسلم أَبُو بَكْرٍ ثُمَّ عُمَرُ ثُمَّ عُثْمَانُ، حَتَّى وَقَعَ مِنْ عُثْمَانَ فِي بِئْرِ أَرِيسَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Yusuf bin Musa, telah menceritakan kepada kami Abu Usamah, telah menceritakan kepada kami Ubaidullah, dari Nafi', dari Ibnu Umar - semoga Allah SWT meridhai mereka berdua - bahawa Rasulullah SAW memakai cincin emas atau perak, dan beliau meletakkan batu permatanya menghadap tapak tangan, dan diukir padanya Muhammad Rasulullah.  Maka orang ramai pun memakai cincin yang serupa.  Setelah melihat mereka memakai cincin sedemikian, baginda membuang cincin itu dan bersabda: \"Aku tidak akan memakainya lagi.\" Kemudian baginda memakai cincin perak, maka orang ramai pun memakai cincin perak.  Ibnu Umar berkata: Selepas Nabi SAW, Abu Bakar memakai cincin itu, kemudian Umar, kemudian Uthman, sehingga cincin itu jatuh ke dalam perigi Aris daripada Uthman."
  },
  {
    "id": 5640,
    "hadith_number": 5640,
    "tajuk_hadith": "Rasulullah SAW Meletakkan Cincin Emas",
    "perawi_melayu": "Riwayat Abdullah bin Umar:",
    "english_text": "Allah's Messenger (ﷺ) wore a gold \nring, then he threw it and said, \"I will never wear it.\" The people also threw their (gold) rings.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَلْبَسُ خَاتَمًا مِنْ ذَهَبٍ فَنَبَذَهُ فَقَالَ ‏\n\"‏ لاَ أَلْبَسُهُ أَبَدًا ‏\"‏‏.‏ فَنَبَذَ النَّاسُ خَوَاتِيمَهُمْ‏.‏",
    "malay_translation": "Daripada Abdullah bin Umar r.a. berkata, Rasulullah SAW pernah memakai cincin emas, kemudian baginda membuangnya dan bersabda: “Aku tidak akan memakainya lagi.” Maka, orang ramai pun membuang cincin-cincin mereka."
  },
  {
    "id": 5641,
    "hadith_number": 5641,
    "tajuk_hadith": "Cincin Perak Rasulullah SAW",
    "perawi_melayu": "Anas bin Malik meriwayatkan:",
    "english_text": "that he saw a silver ring on the hand of Allah's Messenger (ﷺ) for one day only. Then the people had silver \nrings made for themselves and wore it. On that, Allah's Messenger (ﷺ) threw away their rings as well. (For \nthe details of this Hadith, see Fath-ul-Bari, Vol. 12, page 438).",
    "arabic_text": "حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ أَنَّهُ رَأَى فِي يَدِ رَسُولِ اللَّهِ صلى الله عليه وسلم خَاتَمًا مِنْ وَرِقٍ يَوْمًا وَاحِدًا، ثُمَّ إِنَّ النَّاسَ اصْطَنَعُوا الْخَوَاتِيمَ مِنْ وَرِقٍ وَلَبِسُوهَا، فَطَرَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم خَاتَمَهُ، فَطَرَحَ النَّاسُ خَوَاتِيمَهُمْ‏.‏ تَابَعَهُ إِبْرَاهِيمُ بْنُ سَعْدٍ وَزِيَادٌ وَشُعَيْبٌ عَنِ الزُّهْرِيِّ‏.‏ وَقَالَ ابْنُ مُسَافِرٍ عَنِ الزُّهْرِيِّ أَرَى خَاتَمًا مِنْ وَرِقٍ‏.‏",
    "malay_translation": "Anas bin Malik berkata bahawa beliau melihat cincin perak di jari Rasulullah SAW hanya untuk satu hari sahaja. Kemudian, orang ramai membuat cincin perak untuk diri mereka sendiri dan memakainya.  Atas sebab itu, Rasulullah SAW membuang cincin baginda, lalu orang ramai turut membuang cincin mereka. (Untuk maklumat lanjut mengenai hadis ini, sila rujuk Fath-ul-Bari, Jilid 12, muka surat 438)."
  },
  {
    "id": 5642,
    "hadith_number": 5642,
    "tajuk_hadith": "Cincin Nabi SAW",
    "perawi_melayu": "Riwayat Humaid:",
    "english_text": "Anas was asked, \"Did the Prophet (ﷺ) wear a ring?\" Anas said, \"Once he delayed the: `Isha' prayer till \nmidnight. Then he came, facing us ..... as if l am now Looking at the glitter of his ring ..... and said, \n\"The people have offered their prayers and slept but you have been in prayer as you have been waiting \nfor it.\"",
    "arabic_text": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا يَزِيدُ بْنُ زُرَيْعٍ، أَخْبَرَنَا حُمَيْدٌ، قَالَ سُئِلَ أَنَسٌ هَلِ اتَّخَذَ النَّبِيُّ صلى الله عليه وسلم خَاتَمًا قَالَ أَخَّرَ لَيْلَةً صَلاَةَ الْعِشَاءِ إِلَى شَطْرِ اللَّيْلِ، ثُمَّ أَقْبَلَ عَلَيْنَا بِوَجْهِهِ، فَكَأَنِّي أَنْظُرُ إِلَى وَبِيصِ خَاتَمِهِ‏.‏ قَالَ ‏\n\"‏ إِنَّ النَّاسَ قَدْ صَلَّوْا وَنَامُوا، وَإِنَّكُمْ لَمْ تَزَالُوا فِي صَلاَةٍ مَا انْتَظَرْتُمُوهَا ‏\"‏‏.‏",
    "malay_translation": "Anas ditanya, \"Adakah Nabi SAW memakai cincin?\" Anas berkata, \"Pada suatu malam, Baginda SAW menangguhkan solat Isya' sehingga tengah malam. Kemudian Baginda datang menghadap kami… seakan-akan aku masih melihat kilauan cincin Baginda… dan Baginda bersabda, \"Sesungguhnya manusia telah menunaikan solat dan tidur, dan kamu sekalian tetap berada dalam solat kerana kamu menantikannya.\""
  },
  {
    "id": 5643,
    "hadith_number": 5643,
    "tajuk_hadith": "Cincin Rasulullah SAW",
    "perawi_melayu": "Anas meriwayatkan:",
    "english_text": "The ring of the Prophet (ﷺ) was of silver, and its stone was of silver too.",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ حُمَيْدًا، يُحَدِّثُ عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ خَاتَمُهُ مِنْ فِضَّةٍ وَكَانَ فَصُّهُ مِنْهُ‏.‏ وَقَالَ يَحْيَى بْنُ أَيُّوبَ حَدَّثَنِي حُمَيْدٌ سَمِعَ أَنَسًا عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Dari Anas r.a., bahawa cincin Nabi SAW adalah daripada perak, dan batu cincin itu pun daripada perak."
  },
  {
    "id": 5644,
    "hadith_number": 5644,
    "tajuk_hadith": "Perkahwinan Berlandaskan Al-Quran",
    "perawi_melayu": "Riwayat Sahl:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ سَهْلاً، يَقُولُ جَاءَتِ امْرَأَةٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ جِئْتُ أَهَبُ نَفْسِي‏.‏ فَقَامَتْ طَوِيلاً فَنَظَرَ وَصَوَّبَ، فَلَمَّا طَالَ مُقَامُهَا فَقَالَ رَجُلٌ زَوِّجْنِيهَا، إِنْ لَمْ تَكُنْ لَكَ بِهَا حَاجَةٌ‏.‏ قَالَ ‏\"‏ عِنْدَكَ شَىْءٌ تُصْدِقُهَا ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ انْظُرْ ‏\"‏‏.‏ فَذَهَبَ ثُمَّ رَجَعَ فَقَالَ وَاللَّهِ إِنْ وَجَدْتُ شَيْئًا‏.‏ قَالَ ‏\"‏ اذْهَبْ فَالْتَمِسْ وَلَوْ خَاتَمًا مِنْ حَدِيدٍ ‏\"‏‏.‏ فَذَهَبَ ثُمَّ رَجَعَ قَالَ لاَ وَاللَّهِ وَلاَ خَاتَمًا مِنْ حَدِيدٍ‏.‏ وَعَلَيْهِ إِزَارٌ مَا عَلَيْهِ رِدَاءٌ‏.‏ فَقَالَ أُصْدِقُهَا إِزَارِي فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِزَارُكَ إِنْ لَبِسَتْهُ لَمْ يَكُنْ عَلَيْكَ مِنْهُ شَىْءٌ، وَإِنْ لَبِسْتَهُ لَمَ يَكُنْ عَلَيْهَا مِنْهُ شَىْءٌ ‏\"‏‏.‏ فَتَنَحَّى الرَّجُلُ فَجَلَسَ فَرَآهُ النَّبِيُّ صلى الله عليه وسلم مُوَلِّيًا فَأَمَرَ بِهِ فَدُعِيَ فَقَالَ ‏\"‏ مَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏ قَالَ سُورَةُ كَذَا وَكَذَا لِسُوَرٍ عَدَّدَهَا‏.‏ قَالَ ‏\"‏ قَدْ مَلَّكْتُكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Maslamah, telah menceritakan kepada kami Abdul Aziz bin Abi Hazim, dari bapanya, bahawa dia mendengar Sahl berkata: Seorang wanita datang kepada Nabi SAW lalu berkata, \"Saya datang untuk menyerahkan diri saya (untuk dinikahi).\" Wanita itu berdiri lama, Nabi SAW memandangnya dengan teliti. Setelah lama wanita itu berdiri, seorang lelaki berkata kepada Nabi SAW, \"Jika baginda tidak memerlukannya, nikahkanlah dia dengan saya.\" Nabi SAW bertanya, \"Adakah engkau mempunyai sesuatu untuk menjadi mas kahwinnya?\" Lelaki itu menjawab, \"Tidak.\" Nabi SAW berkata, \"Carilah.\" Lelaki itu pergi kemudian kembali dan berkata, \"Demi Allah, saya tidak menemui apa-apa.\" Nabi SAW berkata, \"Pergilah dan carilah, walaupun hanya sebentuk cincin besi.\" Lelaki itu pergi kemudian kembali dan berkata, \"Tidak, demi Allah, saya tidak menemui walaupun sebentuk cincin besi.\" Lelaki itu hanya memakai kain sarung (Izar) dan tidak berbaju (Rida'). Dia berkata, \"Saya akan memberikan kain sarung saya sebagai mas kahwin.\" Nabi SAW bersabda, \"Kain sarungmu? Jika dia memakainya, tidak akan ada apa-apa padamu, dan jika engkau memakainya, tidak akan ada apa-apa padanya.\" Lelaki itu berpindah dan duduk. Nabi SAW melihatnya pergi, lalu menyuruh memanggilnya. Kemudian baginda bertanya, \"Berapa banyak al-Quran yang engkau hafal?\" Lelaki itu menjawab, \"Saya hafal surah begini dan begini,\" sambil menyebut beberapa surah. Nabi SAW bersabda, \"Aku nikahkan dia denganmu berdasarkan jumlah ayat al-Quran yang kau hafal.\""
  },
  {
    "id": 5645,
    "hadith_number": 5645,
    "tajuk_hadith": "Cincin Rasulullah SAW",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "Allah's Messenger (ﷺ) wanted to write a letter to a group of people or some non-Arabs. It was said to him, \n\"They do not accept any letter unless it is stamped.\" So the Prophet (ﷺ) had a silver ring made for himself, \nand on it was engraved: 'Muhammad, the Messenger of Allah'. .. as if I am now looking at the glitter of \nthe ring on the finger (or in the palm) of the Prophet (ﷺ) .",
    "arabic_text": "حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم أَرَادَ أَنْ يَكْتُبَ إِلَى رَهْطٍ أَوْ أُنَاسٍ مِنَ الأَعَاجِمِ، فَقِيلَ لَهُ إِنَّهُمْ لاَ يَقْبَلُونَ كِتَابًا إِلاَّ عَلَيْهِ خَاتَمٌ، فَاتَّخَذَ النَّبِيُّ صلى الله عليه وسلم خَاتَمًا مِنْ فِضَّةٍ نَقْشُهُ مُحَمَّدٌ رَسُولُ اللَّهِ فَكَأَنِّي بِوَبِيصِ أَوْ بِبَصِيصِ الْخَاتَمِ فِي إِصْبَعِ النَّبِيِّ صلى الله عليه وسلم أَوْ فِي كَفِّهِ‏.‏",
    "malay_translation": "Rasulullah SAW ingin menulis surat kepada sekumpulan orang atau beberapa orang bukan Arab. Baginda diberitahu, \"Mereka tidak akan menerima sebarang surat melainkan yang mempunyai cop mohor.\"  Maka, Nabi SAW membuat sebuah cincin perak untuk diri baginda, dan diukir padanya: 'Muhammad, Rasulullah'.  Seolah-olah aku masih lagi melihat kilauan cincin itu di jari (atau di tapak tangan) Nabi SAW."
  },
  {
    "id": 5646,
    "hadith_number": 5646,
    "tajuk_hadith": "Cincin Perak Rasulullah SAW",
    "perawi_melayu": "Riwayat Ibnu Umar:",
    "english_text": "Allah's Messenger (ﷺ) had a silver ring made for himself and it was worn by him on his hand. Afterwards it \nwas worn by Abu Bakr, and then by `Umar, and then by `Uthman till it fell in the Aris well. (On that \nring) was engraved: 'Muhammad, the Messenger of Allah.'",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ اتَّخَذَ رَسُولُ اللَّهِ صلى الله عليه وسلم خَاتَمًا مِنْ وَرِقٍ، وَكَانَ فِي يَدِهِ، ثُمَّ كَانَ بَعْدُ فِي يَدِ أَبِي بَكْرٍ، ثُمَّ كَانَ بَعْدُ فِي يَدِ عُمَرَ، ثُمَّ كَانَ بَعْدُ فِي يَدِ عُثْمَانَ، حَتَّى وَقَعَ بَعْدُ فِي بِئْرِ أَرِيسَ، نَقْشُهُ مُحَمَّدٌ رَسُولُ اللَّهِ‏.‏",
    "malay_translation": "Rasulullah SAW telah membuat sebuah cincin perak untuk diri baginda dan memakainya di jari baginda. Kemudian cincin itu dipakai oleh Abu Bakar, kemudian Umar, dan kemudian Uthman sehingga ia jatuh ke dalam perigi Aris.  (Pada cincin itu) terukir: 'Muhammad, Rasulullah.'"
  },
  {
    "id": 5647,
    "hadith_number": 5647,
    "tajuk_hadith": "Cincin Nabi SAW dan Ukirannya",
    "perawi_melayu": "Anas meriwayatkan:",
    "english_text": "The Prophet (ﷺ) got a ring made for himself and said, \"I have got a ring made (for myself) and engraved a certain engraving on it so none of you should get such an engraving on his ring.\" I saw the glitter of the ring on his little finger.",
    "arabic_text": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ صَنَعَ النَّبِيُّ صلى الله عليه وسلم خَاتَمًا قَالَ ‏\n\"‏ إِنَّا اتَّخَذْنَا خَاتَمًا، وَنَقَشْنَا فِيهِ نَقْشًا، فَلاَ يَنْقُشْ عَلَيْهِ أَحَدٌ ‏\"‏‏.‏ قَالَ فَإِنِّي لأَرَى بَرِيقَهُ فِي خِنْصَرِهِ‏.‏",
    "malay_translation": "Anas r.a. meriwayatkan bahawa Nabi SAW telah membuat sebuah cincin dan bersabda:  \"Sesungguhnya kami telah membuat sebuah cincin dan mengukir sesuatu di atasnya, maka janganlah sesiapa pun mengukir seumpama itu pada cincinnya.\"  Kemudian Anas berkata:  \"Aku melihat cahaya cincin itu di jari kelingking baginda.\""
  },
  {
    "id": 5648,
    "hadith_number": 5648,
    "tajuk_hadith": "Cincirin Nabi SAW untuk Surat kepada Orang Rom",
    "perawi_melayu": "Anas bin Malik:",
    "english_text": "When the Prophet (ﷺ) intended to write to the Byzantines, it was said to him, \"Those people do not \nread your letter unless it is stamped.\" So the Prophet (ﷺ) took a silver ring and got 'Muhammad, the \nApostle of Allah' engraved on it .... as if I am now looking at its glitter in his hand.",
    "arabic_text": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ لَمَّا أَرَادَ النَّبِيُّ صلى الله عليه وسلم أَنْ يَكْتُبَ إِلَى الرُّومِ قِيلَ لَهُ إِنَّهُمْ لَنْ يَقْرَءُوا كِتَابَكَ إِذَا لَمْ يَكُنْ مَخْتُومًا‏.‏ فَاتَّخَذَ خَاتَمًا مِنْ فِضَّةٍ، وَنَقْشُهُ مُحَمَّدٌ رَسُولُ اللَّهِ‏.‏ فَكَأَنَّمَا أَنْظُرُ إِلَى بَيَاضِهِ فِي يَدِهِ‏.‏",
    "malay_translation": "Ketika Nabi SAW hendak menulis surat kepada orang Rom, baginda diberitahu, \"Mereka tidak akan membaca suratmu jika tidak bermeterai.\"  Maka Nabi SAW mengambil cincin perak dan mengukir padanya, 'Muhammad, Rasulullah.'  Seolah-olah aku masih melihat kilauannya di tangan baginda."
  },
  {
    "id": 5649,
    "hadith_number": 5649,
    "tajuk_hadith": "Nabi SAW dan Cincin Emas",
    "perawi_melayu": "Riwayat Abdullah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ، حَدَّثَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم اصْطَنَعَ خَاتَمًا مِنْ ذَهَبٍ، جَعَلَ فَصَّهُ فِي بَطْنِ كَفِّهِ إِذَا لَبِسَهُ، فَاصْطَنَعَ النَّاسُ خَوَاتِيمَ مِنْ ذَهَبٍ، فَرَقِيَ الْمِنْبَرَ، فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ فَقَالَ ‏\n\"‏ إِنِّي كُنْتُ اصْطَنَعْتُهُ، وَإِنِّي لاَ أَلْبَسُهُ ‏\"‏‏.‏ فَنَبَذَهُ فَنَبَذَ النَّاسُ‏.‏ قَالَ جُوَيْرِيَةُ وَلاَ أَحْسِبُهُ إِلاَّ قَالَ فِي يَدِهِ الْيُمْنَى‏.‏",
    "malay_translation": "Kami diberitakan oleh Musa bin Ismail, yang telah diberitakan kepadanya oleh Juwairiyah, daripada Nafi', bahawa Abdullah telah menceritakan kepadanya bahawa Nabi SAW telah membuat sebuah cincin daripada emas, dan apabila baginda memakainya, baginda meletakkan batu cincin itu di tapak tangan baginda. Maka orang ramai pun membuat cincin daripada emas.  Kemudian baginda naik mimbar, lalu memuji dan mensyukuri Allah SWT, kemudian bersabda:  \"Sesungguhnya aku pernah membuatnya, dan sesungguhnya aku tidak akan memakainya lagi.\"  Lalu baginda membuangnya, maka orang ramai pun membuang cincin mereka. Juwairiyah berkata:  Dan aku tidak menyangka melainkan baginda berkata: Di tangan kanannya."
  },
  {
    "id": 5650,
    "hadith_number": 5650,
    "tajuk_hadith": "Cincin Rasulullah SAW dan Larangan Meniru Ukirannya",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "Allah's Messenger (ﷺ) took a silver ring and had 'Muhammad, the Apostle' of Allah' engraved on it. The \nProphet then said (to us), 'I have a silver ring with 'Muhammad, the Messenger of Allah engraved on it, \nso none of you should have the same engraving on his ring.'",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادٌ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اتَّخَذَ خَاتَمًا مِنْ فِضَّةٍ، وَنَقَشَ فِيهِ، مُحَمَّدٌ رَسُولُ اللَّهِ‏.‏ وَقَالَ ‏\n\"‏ إِنِّي اتَّخَذْتُ خَاتَمًا مِنْ وَرِقٍ، وَنَقَشْتُ فِيهِ، مُحَمَّدٌ رَسُولُ اللَّهِ‏.‏ فَلاَ يَنْقُشَنَّ أَحَدٌ عَلَى نَقْشِهِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW mengambil sebentuk cincin perak dan mengukir di atasnya, ‘Muhammad, Rasulullah.’ Kemudian Nabi SAW bersabda, ‘Aku telah membuat sebentuk cincin daripada perak dan mengukir padanya, ‘Muhammad, Rasulullah.’ Oleh itu, jangan sesiapa pun mengukir seperti ukiran ini.’"
  },
  {
    "id": 5651,
    "haditi_number": 5651,
    "tajuk_hadith": "Ukiran Cincin Nabi Muhammad SAW",
    "perawi_melayu": "Anas meriwayatkan:",
    "english_text": "that when Abu Bakr became the Caliph, he wrote a letter to him (and stamped it with the Prophet's \nring) and the engraving of the ring was in three lines: Muhammad in one line, 'Apostle' in another line, \nand 'Allah' in a third line.",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ، قَالَ حَدَّثَنِي أَبِي، عَنْ ثُمَامَةَ، عَنْ أَنَسٍ، أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ لَمَّا اسْتُخْلِفَ كَتَبَ لَهُ، وَكَانَ نَقْشُ الْخَاتَمِ ثَلاَثَةَ أَسْطُرٍ‏.‏ مُحَمَّدٌ سَطْرٌ، وَرَسُولُ سَطْرٌ، وَاللَّهِ سَطْرٌ‏.‏",
    "malay_translation": "Anas meriwayatkan bahawa apabila Abu Bakar menjadi Khalifah, beliau menulis surat kepadanya dan membubuhkan cap cincin Nabi SAW. Ukiran pada cincin itu terdiri daripada tiga baris: Muhammad pada satu baris, Rasul pada satu baris lagi, dan Allah pada baris yang ketiga."
  },
  {
    "id": 5652,
    "hadith_number": 5652,
    "tajuk_hadith": "Cincin Nabi SAW dan Kisah di Perigi Aris",
    "perawi_melayu": "Anas menambah:",
    "english_text": "The ring of the Prophet (ﷺ) was in his hand, and after him, in \nAbu Bakr's hand, and then in `Umar's hand after Abu Bakr. When `Uthman was the Caliph, once he \nwas sitting at the well of Aris. He removed the ring from his hand and while he was trifling with it, \ndropped into the well. We kept on going to the well with `Uthman for three days looking for the ring, \nand finally the well was drained, but the ring was not found.",
    "arabic_text": "وَزَادَنِي أَحْمَدُ حَدَّثَنَا الأَنْصَارِيُّ، قَالَ حَدَّثَنِي أَبِي، عَنْ ثُمَامَةَ، عَنْ أَنَسٍ، قَالَ كَانَ خَاتَمُ النَّبِيِّ صلى الله عليه وسلم فِي يَدِهِ، وَفِي يَدِ أَبِي بَكْرٍ بَعْدَهُ، وَفِي يَدِ عُمَرَ بَعْدَ أَبِي بَكْرٍ، فَلَمَّا كَانَ عُثْمَانُ جَلَسَ عَلَى بِئْرِ أَرِيسَ ـ قَالَ ـ فَأَخْرَجَ الْخَاتَمَ، فَجَعَلَ يَعْبَثُ بِهِ فَسَقَطَ قَالَ فَاخْتَلَفْنَا ثَلاَثَةَ أَيَّامٍ مَعَ عُثْمَانَ فَنَنْزَحُ الْبِئْرَ فَلَمْ نَجِدْهُ‏.‏",
    "malay_translation": "Cincin Nabi SAW berada di tangan Baginda, kemudian di tangan Abu Bakar setelah Baginda, dan kemudian di tangan Umar setelah Abu Bakar. Ketika Uthman menjadi Khalifah, suatu ketika Baginda duduk di perigi Aris. Baginda menanggalkan cincin daripada tangan Baginda dan ketika bermain-main dengannya, cincin itu terjatuh ke dalam perigi. Kami bersama Uthman pergi ke perigi selama tiga hari untuk mencari cincin itu, dan akhirnya perigi itu dikuras, tetapi cincin itu tidak dijumpai."
  },
  {
    "id": 5653,
    "hadith_number": 5653,
    "tajuk_hadith": "Solat Hari Raya Aidilfitri Sebelum Khutbah dan Sedekah Wanita",
    "perawi_melayu": "Riwayat Ibnu Abbas:",
    "english_text": "I offered the `Id prayer with the Prophet (ﷺ) and he offered prayer before the Khutba (sermon). ibn `Abbas \nadded: After the prayer the Prophet (ﷺ) came towards (the rows of) the women and ordered them to give \nalms, and the women started putting their big and small rings in the garment of Bilal.",
    "arabic_text": "حَدَّثَنَا أَبُو عَاصِمٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنَا الْحَسَنُ بْنُ مُسْلِمٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ شَهِدْتُ الْعِيدَ مَعَ النَّبِيِّ صلى الله عليه وسلم فَصَلَّى قَبْلَ الْخُطْبَةِ‏.‏ وَزَادَ ابْنُ وَهْبٍ عَنِ ابْنِ جُرَيْجٍ فَأَتَى النِّسَاءَ فَجَعَلْنَ يُلْقِينَ الْفَتَخَ وَالْخَوَاتِيمَ فِي ثَوْبِ بِلاَلٍ‏.‏",
    "malay_translation": "Aku menunaikan solat Hari Raya bersama Nabi ﷺ, dan baginda menunaikan solat sebelum khutbah. Ibnu Abbas menambah: Selepas solat, Nabi ﷺ menghampiri para wanita dan menyuruh mereka memberi sedekah, lalu para wanita memasukkan cincin-cincin besar dan kecil mereka ke dalam kain Bilal."
  },
  {
    "id": 5654,
    "hadith_number": 5654,
    "tajuk_hadith": "Solat Hari Raya dan Sedekah Wanita",
    "perawi_melayu": "Riwayat Ibnu Abbas:",
    "english_text": "The Prophet (ﷺ) came out on the day of `Id and offered a two-rak`at prayer, and he did not pray any \nrak`a before it, nor after it. Then he went towards the women and ordered them to give alms. The \nwomen started donating their earring and necklaces.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ عِيدٍ فَصَلَّى رَكْعَتَيْنِ، لَمْ يُصَلِّ قَبْلُ وَلاَ بَعْدُ، ثُمَّ أَتَى النِّسَاءَ فَأَمَرَهُنَّ بِالصَّدَقَةِ، فَجَعَلَتِ الْمَرْأَةُ تَصَدَّقُ بِخُرْصِهَا وَسِخَابِهَا‏.‏",
    "malay_translation": "Dari Ibnu Abbas r.a. berkata: Nabi SAW pada hari raya keluar lalu mendirikan solat dua rakaat. Baginda tidak mendirikan solat sebelum atau sesudahnya. Kemudian Baginda pergi kepada kaum wanita lalu menyuruh mereka memberi sedekah. Maka para wanita itu mula bersedekah dengan anting-anting dan gelang mereka."
  },
  {
    "id": 5655,
    "hadith_number": 5655,
    "tajuk_hadith": "Tayammum disebabkan Kehilangan Kalung",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "A necklace belonging to Asma' was lost, and the Prophet (ﷺ) sent men in its search. The time for the \nprayer became due and they were without ablution and they could not find water; therefore they \nprayed without ablution, They mentioned that to the Prophet (ﷺ) . Then Allah revealed the Verse of \nTayammum. (`Aisha added: that she had borrowed (the necklace) from Asma').",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا عَبْدَةُ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ هَلَكَتْ قِلاَدَةٌ لأَسْمَاءَ، فَبَعَثَ النَّبِيُّ صلى الله عليه وسلم فِي طَلَبِهَا رِجَالاً، فَحَضَرَتِ الصَّلاَةُ وَلَيْسُوا عَلَى وُضُوءٍ وَلَمْ يَجِدُوا مَاءً، فَصَلَّوْا وَهُمْ عَلَى غَيْرِ وُضُوءٍ، فَذَكَرُوا ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَأَنْزَلَ اللَّهُ آيَةَ التَّيَمُّمِ‏.‏ زَادَ ابْنُ نُمَيْرٍ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ اسْتَعَارَتْ مِنْ أَسْمَاءَ‏.‏",
    "malay_translation": "Seutas kalung kepunyaan Asma’ hilang, lalu Nabi ﷺ mengutus beberapa orang lelaki untuk mencarinya.  Waktu solat telah tiba, dan mereka tidak berwuduk serta tidak menemui air. Oleh itu, mereka menunaikan solat tanpa berwuduk. Mereka menceritakan perkara itu kepada Nabi ﷺ. Kemudian Allah SWT menurunkan ayat Tayammum. (Aisyah menambah: bahawa dia meminjam kalung itu daripada Asma’)."
  },
  {
    "id": 5656,
    "hadith_number": 5656,
    "tajuk_hadith": "Solat Hari Raya dan Sedekah Wanita",
    "perawi_melayu": "Riwayat Ibnu Abbas:",
    "english_text": "\"The Prophet (ﷺ) offered a two-rak`at prayer on `Id day and he did not offer any (Nawafil prayer) \nbefore or after it. He then went towards the women, and Bilal was accompanying him, and ordered \nthem to give alms. And so the women started giving their earrings (etc .).",
    "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَدِيٌّ، قَالَ سَمِعْتُ سَعِيدًا، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى يَوْمَ الْعِيدِ رَكْعَتَيْنِ، لَمْ يُصَلِّ قَبْلَهَا وَلاَ بَعْدَهَا ثُمَّ أَتَى النِّسَاءَ وَمَعَهُ بِلاَلٌ فَأَمَرَهُنَّ بِالصَّدَقَةِ، فَجَعَلَتِ الْمَرْأَةُ تُلْقِي قُرْطَهَا‏.‏",
    "malay_translation": "Daripada Ibnu Abbas r.a., bahawa Nabi SAW menunaikan solat dua rakaat pada hari raya, baginda tidak menunaikan solat sunat sebelum dan selepasnya. Kemudian baginda pergi kepada kaum wanita, bersama Bilal, lalu memerintahkan mereka memberi sedekah. Maka para wanita mula memberikan anting-anting (dan sebagainya)."
  },
  {
    "id": 5657,
    "hadith_number": 5657,
    "tajuk_hadith": "Cinta Rasulullah SAW kepada Al-Hasan bin Ali",
    "perawi_melayu": "Riwayat Abu Hurairah",
    "english_text": "I was with Allah's Messenger (ﷺ) in one of the Markets of Medina. He left (the market) and so did I. Then he \nasked thrice, \"Where is the small (child)?\" Then he said, \"Call Al-Hasan bin `Ali.\" So Al-Hasan bin \n`Ali got up and started walking with a necklace (of beads) around his neck. The Prophet (ﷺ) stretched \nhis hand out like this, and Al-Hasan did the same. The Prophet (ﷺ) embraced him and said, \"0 Allah! l \nlove him, so please love him and love those who love him.\" Since Allah's Messenger (ﷺ) said that. nothing \nhas been dearer to me than Al-Hasan.",
    "arabic_text": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا وَرْقَاءُ بْنُ عُمَرَ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ، عَنْ نَافِعِ بْنِ جُبَيْرٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ كُنْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي سُوقٍ مِنْ أَسْوَاقِ الْمَدِينَةِ فَانْصَرَفَ فَانْصَرَفْتُ فَقَالَ ‏\"‏ أَيْنَ لُكَعُ ـ ثَلاَثًا ـ ادْعُ الْحَسَنَ بْنَ عَلِيٍّ ‏\"‏‏.‏ فَقَامَ الْحَسَنُ بْنُ عَلِيٍّ يَمْشِي وَفِي عُنُقِهِ السِّخَابُ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم بِيَدِهِ هَكَذَا، فَقَالَ الْحَسَنُ بِيَدِهِ، هَكَذَا فَالْتَزَمَهُ فَقَالَ ‏\"‏ اللَّهُمَّ إِنِّي أُحِبُّهُ، فَأَحِبَّهُ، وَأَحِبَّ مَنْ يُحِبُّهُ ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ فَمَا كَانَ أَحَدٌ أَحَبَّ إِلَىَّ مِنَ الْحَسَنِ بْنِ عَلِيٍّ بَعْدَ مَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَا قَالَ‏.‏",
    "malay_translation": "Aku berada bersama Rasulullah SAW di salah satu pasar Madinah. Baginda meninggalkan pasar dan aku pun turut berbuat demikian. Kemudian Baginda bertanya tiga kali, \"Di manakah anak kecil itu?\" Kemudian Baginda bersabda, \"Panggil Al-Hasan bin Ali.\" Maka Al-Hasan bin Ali bangun dan berjalan dengan seutas kalung di lehernya. Nabi SAW mengulurkan tangan Baginda seperti ini, dan Al-Hasan pun berbuat demikian juga. Nabi SAW memeluknya dan bersabda, \"Ya Allah, sesungguhnya aku mencintainya, maka cintai dia dan cintai orang-orang yang mencintainya.\" Sejak Rasulullah SAW bersabda demikian, tiada seorang pun yang lebih aku cintai melainkan Al-Hasan."
  },
  {
    "id": 5658,
    "hadith_number": 5658,
    "tajuk_hadith": "Laknat ke atas mereka yang menyerupai jantina yang bertentangan",
    "perawi_melayu": "Riwayat Ibnu Abbas:",
    "english_text": "Allah's Messenger (ﷺ) cursed those men who are in the similitude (assume the manners) of women and those women who are in the similitude (assume the manners) of men.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمُتَشَبِّهِينَ مِنَ الرِّجَالِ بِالنِّسَاءِ، وَالْمُتَشَبِّهَاتِ مِنَ النِّسَاءِ بِالرِّجَالِ‏.‏ تَابَعَهُ عَمْرٌو أَخْبَرَنَا شُعْبَةُ‏.‏",
    "malay_translation": "Rasulullah SAW melaknat lelaki yang menyerupai perempuan dan perempuan yang menyerupai lelaki."
  },
  {
    "id": 5659,
    "hadith_number": 5659,
    "tajuk_hadith": "Larangan Terhadap Lelaki Berlaku Seperti Wanita dan Sebaliknya",
    "perawi_melayu": "Daripada Ibnu Abbas:",
    "english_text": "The Prophet (ﷺ) cursed effeminate men (those men who are in the similitude (assume the manners of \nwomen) and those women who assume the manners of men, and he said, \"Turn them out of your \nhouses .\" The Prophet (ﷺ) turned out such-and-such man, and `Umar turned out such-and-such woman.",
    "arabic_text": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَعَنَ النَّبِيُّ صلى الله عليه وسلم الْمُخَنَّثِينَ مِنَ الرِّجَالِ، وَالْمُتَرَجِّلاَتِ مِنَ النِّسَاءِ وَقَالَ ‏\n\"‏ أَخْرِجُوهُمْ مِنْ بُيُوتِكُمْ ‏\"‏‏.‏ قَالَ فَأَخْرَجَ النَّبِيُّ صلى الله عليه وسلم فُلاَنًا، وَأَخْرَجَ عُمَرُ فُلاَنًا‏.‏",
    "malay_translation": "Daripada Ibnu Abbas, bahawa Nabi SAW melaknat lelaki yang berkelakuan seperti perempuan dan perempuan yang berkelakuan seperti lelaki. Baginda bersabda: \"Keluarkanlah mereka dari rumah kamu.\" Nabi SAW telah mengeluarkan seseorang lelaki, dan Umar telah mengeluarkan seseorang perempuan."
  },
  {
    "id": 5660,
    "hadith_number": 5660,
    "tajuk_hadith": "Larangan Kemasukan Lelaki Berwatak Wanita ke Rumah Para Isteri Nabi",
    "perawi_melayu": "Riwayat Um Salamah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، أَنَّ عُرْوَةَ، أَخْبَرَهُ أَنَّ زَيْنَبَ ابْنَةَ أَبِي سَلَمَةَ أَخْبَرَتْهُ أَنَّ أُمَّ سَلَمَةَ أَخْبَرَتْهَا أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ عِنْدَهَا وَفِي الْبَيْتِ مُخَنَّثٌ، فَقَالَ لِعَبْدِ اللَّهِ أَخِي أُمِّ سَلَمَةَ يَا عَبْدَ اللَّهِ إِنْ فُتِحَ لَكُمْ غَدًا الطَّائِفُ، فَإِنِّي أَدُلُّكَ عَلَى بِنْتِ غَيْلاَنَ، فَإِنَّهَا تُقْبِلُ بِأَرْبَعٍ وَتُدْبِرُ بِثَمَانٍ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ يَدْخُلَنَّ هَؤُلاَءِ عَلَيْكُنَّ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ تُقْبِلُ بِأَرْبَعٍ وَتُدْبِرُ بِثَمَانٍ يَعْنِي أَرْبَعَ عُكَنِ بَطْنِهَا، فَهْىَ تُقْبِلُ بِهِنَّ، وَقَوْلُهُ وَتُدْبِرُ بِثَمَانٍ‏.‏ يَعْنِي أَطْرَافَ هَذِهِ الْعُكَنِ الأَرْبَعِ، لأَنَّهَا مُحِيطَةٌ بِالْجَنْبَيْنِ حَتَّى لَحِقَتْ وَإِنَّمَا قَالَ بِثَمَانٍ‏.‏ وَلَمْ يَقُلْ بِثَمَانِيَةٍ‏.‏ وَوَاحِدُ الأَطْرَافِ وَهْوَ ذَكَرٌ، لأَنَّهُ لَمْ يَقُلْ ثَمَانِيَةَ أَطْرَافٍ‏.‏",
    "malay_translation": "Malik bin Ismail telah meriwayatkan daripada Zuhari, yang meriwayatkan daripada Hisyam bin Urwah, bahawa Urwah telah memberitahu bahawa Zainab binti Abi Salamah telah memberitahunya bahawa Um Salamah telah memberitahunya bahawa Nabi SAW berada di rumahnya, dan di dalam rumah itu ada seorang lelaki yang berwatak wanita.  Lelaki itu berkata kepada Abdullah, adik Um Salamah, \"Wahai Abdullah! Jika Taif ditawan esok, maka aku akan menunjukkan kepadamu anak perempuan Ghailan, kerana dia sangat gemuk sehingga dia mempunyai empat lekuk di bahagian hadapan (perutnya) dan lapan di bahagian belakang.\" Maka Nabi SAW bersabda kepada isteri-isterinya,  \"Janganlah lelaki-lelaki seperti ini masuk kepada kamu (rumah kamu).\" Abu Abdullah berkata, \"Empat di hadapan dan lapan di belakang\" bermaksud empat lekuk di perutnya, dan dia menghadap dengannya.  Dan firmannya, \"lapan di belakang\", bermaksud hujung daripada empat lekuk itu, kerana ia menyelubungi kedua-dua sisi sehingga sampai.  Dan baginda hanya berkata \"lapan\", dan tidak berkata \"lapan (buah)\". Dan perkataan \"hujung\" adalah tunggal, kerana baginda tidak berkata \"lapan (buah) hujung\"."
  },
  {
    "id": 5661,
    "hadith_number": 5661,
    "tajuk_hadith": "Memangkas Misai Adalah Ciri Fitrah",
    "perawi_melayu": "Riwayat Ibnu Umar:",
    "english_text": "The Prophet (ﷺ) said, \"To get the moustaches cut 'short is characteristic of the Fitra.\"",
    "arabic_text": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، عَنْ حَنْظَلَةَ، عَنْ نَافِعٍ، قَالَ أَصْحَابُنَا عَنِ الْمَكِّيِّ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مِنَ الْفِطْرَةِ قَصُّ الشَّارِبِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Memangkas pendek misai adalah ciri fitrah.\""
  },
  {
    "id": 5662,
    "hadith_number": 5662,
    "tajuk_hadith": "Lima Amalan Sunnah Fitrah",
    "perawi_melayu": "Riwayat Abu Hurairah",
    "english_text": "Allah's Messenger (ﷺ) said, \"Five practices are characteristics of the Fitra: circumcision, shaving the \npubic region, clipping the nails and cutting the moustaches short.\"",
    "arabic_text": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، قَالَ الزُّهْرِيُّ حَدَّثَنَا عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، رِوَايَةً ‏\n\"‏ الْفِطْرَةُ خَمْسٌ ـ أَوْ خَمْسٌ مِنَ الْفِطْرَةِ ـ الْخِتَانُ، وَالاِسْتِحْدَادُ، وَنَتْفُ الإِبْطِ، وَتَقْلِيمُ الأَظْفَارِ، وَقَصُّ الشَّارِبِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Lima perkara adalah ciri-ciri fitrah: berkhatan, mencukur bulu kemaluan, mencabut bulu ketiak, memotong kuku dan memendekkan misai.\""
  },
  {
    "id": 5663,
    "hadith_number": 5663,
    "tajuk_hadith": "Mencukur Rambut Kemaluan, Memotong Kuku, dan Memangkas Misai Adalah Sebahagian daripada Fitrah",
    "perawi_melayu": "Daripada Ibnu Umar",
    "english_text": "Allah's Messenger (ﷺ) said, \"To shave the pubic hair. to clip the nails and to cut the moustaches short, are \ncharacteristics of the Fitra.\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي رَجَاءٍ، حَدَّثَنَا إِسْحَاقُ بْنُ سُلَيْمَانَ، قَالَ سَمِعْتُ حَنْظَلَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مِنَ الْفِطْرَةِ حَلْقُ الْعَانَةِ، وَتَقْلِيمُ الأَظْفَارِ، وَقَصُّ الشَّارِبِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Mencukur rambut kemaluan, memotong kuku, dan memangkas misai adalah ciri-ciri fitrah.\""
  },
  {
    "id": 5664,
    "hadith_number": 5664,
    "tajuk_hadith": "Lima Amalan Sunnah Berdasarkan Fitrah",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "I heard the Prophet (ﷺ) saying. \"Five practices are characteristics of the Fitra: circumcision, shaving the \npubic hair, cutting the moustaches short, clipping the nails, and depilating the hair of the armpits.\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الْفِطْرَةُ خَمْسٌ الْخِتَانُ، وَالاِسْتِحْدَادُ، وَقَصُّ الشَّارِبِ، وَتَقْلِيمُ الأَظْفَارِ، وَنَتْفُ الآبَاطِ ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda: \"Fitrah itu ada lima: berkhatan, mencukur bulu kemaluan, memendekkan misai, memotong kuku, dan mencabut bulu ketiak.\""
  },
  {
    "id": 5665,
    "hadith_number": 5665,
    "tajuk_hadith": "Menyisir Janggut dan Memangkas Misai",
    "perawi_melayu": "Daripada Nafi’",
    "english_text": "Ibn `Umar said, The Prophet (ﷺ) said, 'Do the opposite of what the pagans do. Keep the beards and cut the \nmoustaches short.' Whenever Ibn `Umar performed the Hajj or `Umra, he used to hold his beard with \nhis hand and cut whatever remained outside his hold.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مِنْهَالٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا عُمَرُ بْنُ مُحَمَّدِ بْنِ زَيْدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ خَالِفُوا الْمُشْرِكِينَ، وَفِّرُوا اللِّحَى، وَأَحْفُوا الشَّوَارِبَ ‏\"‏‏.‏ وَكَانَ ابْنُ عُمَرَ إِذَا حَجَّ أَوِ اعْتَمَرَ قَبَضَ عَلَى لِحْيَتِهِ، فَمَا فَضَلَ أَخَذَهُ‏.‏",
    "malay_translation": "Ibn Umar berkata, Rasulullah SAW bersabda: “Berbezaanlah dengan orang-orang musyrik, biarkan janggut kamu tumbuh lebat dan pendekkan misai kamu.” Dan Ibn Umar, apabila menunaikan haji atau umrah, akan memegang janggutnya, kemudian memotong apa sahaja yang melebihi pegangannya."
  },
  {
    "id": 5666,
    "hadith_number": 5666,
    "tajuk_hadith": "Memendekkan Misai dan Membiarkan Janggut",
    "perawi_melayu": "Daripada Ibnu Umar:",
    "english_text": "Allah's Messenger (ﷺ) said, \"Cut the moustaches short and leave the beard (as it is).",
    "arabic_text": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا عَبْدَةُ، أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ انْهَكُوا الشَّوَارِبَ، وَأَعْفُوا اللِّحَى ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Pendekkanlah misai dan biarkan janggut.\" "
  },
  {
    "id": 5667,
    "hadith_number": 5667,
    "tajuk_hadith": "Nabi SAW dan Rambut Beruban",
    "perawi_melayu": "Riwayat Muhammad bin Sirin:",
    "english_text": "I asked Anas, \"Did the Prophet (ﷺ) dye his hair?\" Anas replied, \"The Prophet (ﷺ) did not have except a few \ngrey hairs.\"",
    "arabic_text": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا وُهَيْبٌ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، قَالَ سَأَلْتُ أَنَسًا أَخَضَبَ النَّبِيُّ صلى الله عليه وسلم قَالَ لَمْ يَبْلُغِ الشَّيْبَ إِلاَّ قَلِيلاً‏.‏",
    "malay_translation": "Aku bertanya kepada Anas, \"Adakah Nabi SAW mewarnakan rambut baginda?\" Anas menjawab, \"Nabi SAW tidak mempunyai rambut beruban melainkan sedikit sahaja.\""
  },
  {
    "id": 5668,
    "hadith_number": 5668,
    "tajuk_hadith": "Nabi SAW dan Pewarna Rambut",
    "perawi_melayu": "Daripada Thabit:",
    "english_text": "Anas was asked whether the Prophet (ﷺ) used a a hair dye or not. He replied, \"The Prophet (ﷺ) did not have enough grey hair to dye, (such that) if I wanted to count the fading hairs in his beard (I could have).\"",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، قَالَ سُئِلَ أَنَسٌ عَنْ خِضَابِ النَّبِيِّ، صلى الله عليه وسلم فَقَالَ إِنَّهُ لَمْ يَبْلُغْ مَا يَخْضِبُ، لَوْ شِئْتُ أَنْ أَعُدَّ شَمَطَاتِهِ فِي لِحْيَتِهِ‏.‏",
    "malay_translation": "Anas ditanya sama ada Nabi SAW menggunakan pewarna rambut atau tidak.  Beliau menjawab, \"Rambut Nabi SAW yang beruban tidaklah banyak sehingga perlu diwarnakan. Sekiranya saya mahu, saya mampu mengira rambut-rambut putih di janggut baginda.\""
  },
  {
    "id": 5669,
    "hadith_number": 5669,
    "tajuk_hadith": "Rambut Nabi SAW Digunakan untuk Rawatan",
    "perawi_melayu": "Dari Isra'il:",
    "english_text": "`Uthman bin `Abdullah bin Mauhab said, \"My people sent me with a bowl of water to Um Salama.\" \nIsra'il approximated three fingers ('indicating the small size of the container in which there was some \nhair of the Prophet. `Uthman added, \"If any person suffered from evil eye or some other disease, he \nwould send a vessel (containing water) to Um Salama. I looked into the container (that held the hair \nof the Prophet) and saw a few red hairs in it,\"",
    "arabic_text": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ، قَالَ أَرْسَلَنِي أَهْلِي إِلَى أُمِّ سَلَمَةَ بِقَدَحٍ مِنْ مَاءٍ ـ وَقَبَضَ إِسْرَائِيلُ ثَلاَثَ أَصَابِعَ ـ مِنْ فِضَّةٍ فِيهِ شَعَرٌ مِنْ شَعَرِ النَّبِيِّ صلى الله عليه وسلم وَكَانَ إِذَا أَصَابَ الإِنْسَانَ عَيْنٌ أَوْ شَىْءٌ بَعَثَ إِلَيْهَا مِخْضَبَهُ، فَاطَّلَعْتُ فِي الْجُلْجُلِ فَرَأَيْتُ شَعَرَاتٍ حُمْرًا‏.‏",
    "malay_translation": "Uthman bin Abdullah bin Mauhab berkata, \"Keluargaku menghantar aku kepada Ummu Salamah dengan sebuah bekas air.\"  Isra'il menunjukkan dengan tiga jari (menunjukkan betapa kecilnya bekas yang mengandungi sedikit rambut Nabi SAW). Uthman menambah, \"Jika seseorang ditimpa penyakit ain atau penyakit lain, dia akan menghantar bekas (mengandungi air) kepada Ummu Salamah. Aku melihat ke dalam bekas (yang berisi rambut Nabi SAW) dan melihat beberapa helai rambut merah di dalamnya.\""
  },
  {
    "id": 5670,
    "hadith_number": 5670,
    "tajuk_hadith": "Rambut Nabi SAW yang Berinai",
    "perawi_melayu": "Riwayat Uthman bin Abdullah bin Mauhab:",
    "english_text": "I went to Um Salama and she brought out for us some of the dyed hair of the Prophet.",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا سَلاَّمٌ، عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ، قَالَ دَخَلْتُ عَلَى أُمِّ سَلَمَةَ فَأَخْرَجَتْ إِلَيْنَا شَعَرًا مِنْ شَعَرِ النَّبِيِّ صلى الله عليه وسلم مَخْضُوبًا‏.‏",
    "malay_translation": "Aku telah mengunjungi Ummu Salamah, lalu beliau mengeluarkan kepada kami sebahagian rambut Nabi SAW yang telah diwarnakan."
  },
  {
    "id": 5671,
    "hadith_number": 5671,
    "tajuk_hadith": "Rambut Merah Nabi SAW",
    "perawi_melayu": "Ibn Mauhab (melalui periwayat Abu Nu'aim dan Nusir bin Abi al-Asy'ats)",
    "english_text": "",
    "arabic_text": "وَقَالَ لَنَا أَبُو نُعَيْمٍ حَدَّثَنَا نُصَيْرُ بْنُ أَبِي الأَشْعَثِ، عَنِ ابْنِ مَوْهَبٍ، أَنَّ أُمَّ سَلَمَةَ، أَرَتْهُ شَعَرَ النَّبِيِّ صلى الله عليه وسلم أَحْمَرَ‏.‏",
    "malay_translation": "Abu Nu'aim telah memberitahu kami, dan Nusir bin Abi al-Asy'ats telah meriwayatkan daripada Ibn Mauhab bahawa Ummi Salamah telah menunjukkan kepadanya rambut Nabi SAW yang berwarna merah."
  },
  {
    "id": 5672,
    "hadith_number": 5672,
    "tajuk_hadith": "Mencelah Amalan Yahudi dan Nasrani",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \"Jews and Christians do not dye their hair so you should do the opposite of what \nthey do.",
    "arabic_text": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الزُّهْرِيُّ، عَنْ أَبِي سَلَمَةَ، وَسُلَيْمَانَ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِنَّ الْيَهُودَ وَالنَّصَارَى لاَ يَصْبُغُونَ فَخَالِفُوهُمْ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Sesungguhnya Yahudi dan Nasrani tidak mewarnakan rambut mereka, maka hendaklah kamu berbeza dengan mereka.\""
  },
  {
    "id": 5673,
    "hadith_number": 5673,
    "tajuk_hadith": "Sifat Fizikal Rasulullah SAW",
    "perawi_melayu": "Anas bin Malik meriwayatkan:",
    "english_text": "The Prophet (ﷺ) was neither conspicuously tall, nor short; neither, very white, nor tawny. His hair was \nneither much curled, nor very straight. Allah sent him (as an Apostle) at the age of forty (and after \nthat) he stayed for ten years in Mecca, and for ten more years in Medina. Allah took him unto Him at \nthe age of sixty, and he scarcely had ten white hairs on his head and in his beard.",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكُ بْنُ أَنَسٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّهُ سَمِعَهُ يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيْسَ بِالطَّوِيلِ الْبَائِنِ، وَلاَ بِالْقَصِيرِ، وَلَيْسَ بِالأَبْيَضِ الأَمْهَقِ، وَلَيْسَ بِالآدَمِ، وَلَيْسَ بِالْجَعْدِ الْقَطَطِ، وَلاَ بِالسَّبْطِ، بَعَثَهُ اللَّهُ عَلَى رَأْسِ أَرْبَعِينَ سَنَةً، فَأَقَامَ بِمَكَّةَ عَشْرَ سِنِينَ، وَبِالْمَدِينَةِ عَشْرَ سِنِينَ، وَتَوَفَّاهُ اللَّهُ عَلَى رَأْسِ سِتِّينَ سَنَةً، وَلَيْسَ فِي رَأْسِهِ وَلِحْيَتِهِ عِشْرُونَ شَعَرَةً بَيْضَاءَ‏.‏",
    "malay_translation": "Anas bin Malik berkata bahawa baginda Rasulullah SAW bukanlah seorang yang terlalu tinggi atau terlalu rendah, tidak juga terlalu putih atau terlalu sawo matang. Rambut baginda tidak terlalu kerinting mahupun terlalu lurus. Allah SWT mengutus baginda sebagai Rasul pada usia empat puluh tahun, kemudian baginda tinggal di Mekah selama sepuluh tahun dan di Madinah selama sepuluh tahun lagi. Allah SWT mengambil nyawa baginda pada usia enam puluh tahun, dan pada ketika itu, rambut putih di kepala dan janggut baginda hampir tidak sampai sepuluh helai."
  },
  {
    "id": 5674,
    "hadith_number": 5674,
    "tajuk_hadith": "Ketampanan Nabi SAW dalam Jubah Merah dan Rambut Baginda",
    "perawi_melayu": "Riwayat Al-Bara’",
    "english_text": "I did not see anybody in a red cloak looking more handsome than the Prophet.\nNarrated Malik: The \nhair of the Prophet (ﷺ) used to hang near his shoulders. Abu Ishaq said, \"I heard him relate it more than once. He always laughed when he related it.\" \nNarrated Shu`ba: The hair of the Prophet (ﷺ) used to \nhang down to the earlobes.",
    "arabic_text": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، سَمِعْتُ الْبَرَاءَ، يَقُولُ مَا رَأَيْتُ أَحَدًا أَحْسَنَ فِي حُلَّةٍ حَمْرَاءَ مِنَ النَّبِيِّ صلى الله عليه وسلم‏.‏ قَالَ بَعْضُ أَصْحَابِي عَنْ مَالِكٍ إِنَّ جُمَّتَهُ لَتَضْرِبُ قَرِيبًا مِنْ مَنْكِبَيْهِ‏.‏ قَالَ أَبُو إِسْحَاقَ سَمِعْتُهُ يُحَدِّثُهُ غَيْرَ مَرَّةٍ، مَا حَدَّثَ بِهِ قَطُّ إِلاَّ ضَحِكَ‏.‏ تَابَعَهُ شُعْبَةُ شَعَرُهُ يَبْلُغُ شَحْمَةَ أُذُنَيْهِ‏.‏",
    "malay_translation": "Aku tidak pernah melihat sesiapa yang lebih tampan daripada Nabi SAW dalam jubah merah.\nRiwayat Malik: Rambut Nabi SAW biasanya terletak hampir ke bahu Baginda. Abu Ishaq berkata, \"Aku mendengar Baginda meriwayatkannya lebih daripada sekali. Baginda sentiasa ketawa apabila meriwayatkannya.\" \nRiwayat Syu'bah: Rambut Nabi SAW biasanya terletak hingga ke cuping telinga Baginda."
  },
  {
    "id": 5675,
    "hadith_number": 5675,
    "tajuk_hadith": "Mimpi Rasulullah SAW Mengenai Isa a.s dan Dajjal",
    "perawi_melayu": "Riwayat Abdullah bin Umar:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أُرَانِي اللَّيْلَةَ عِنْدَ الْكَعْبَةِ، فَرَأَيْتُ رَجُلاً آدَمَ كَأَحْسَنِ مَا أَنْتَ رَاءٍ مِنْ أُدْمِ الرِّجَالِ، لَهُ لِمَّةٌ كَأَحْسَنِ مَا أَنْتَ رَاءٍ مِنَ اللِّمَمِ، قَدْ رَجَّلَهَا، فَهْىَ تَقْطُرُ مَاءً مُتَّكِئًا عَلَى رَجُلَيْنِ، أَوْ عَلَى عَوَاتِقِ رَجُلَيْنِ، يَطُوفُ بِالْبَيْتِ فَسَأَلْتُ مَنْ هَذَا فَقِيلَ الْمَسِيحُ ابْنُ مَرْيَمَ‏.‏ وَإِذَا أَنَا بِرَجُلٍ جَعْدٍ، قَطَطٍ، أَعْوَرِ الْعَيْنِ الْيُمْنَى كَأَنَّهَا عِنَبَةٌ طَافِيَةٌ، فَسَأَلْتُ مَنْ هَذَا فَقِيلَ الْمَسِيحُ الدَّجَّالُ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Yusuf, telah memberitakan kepada kami Malik, dari Nafi', dari Abdullah bin Umar - semoga Allah meridhai mereka berdua - bahawa Rasulullah SAW bersabda: \"Malam ini aku bermimpi di dekat Kaabah, lalu aku melihat seorang lelaki berkulit sawo matang, setampan-tampan lelaki berkulit sawo matang yang pernah kamu lihat. Rambutnya yang panjang hingga ke cuping telinga amat indah, kemas dan dibasahkan air, dia sedang tawaf mengelilingi Kaabah sambil bersandar pada dua orang lelaki atau pada bahu dua orang lelaki. Aku bertanya, \"Siapakah ini?\" Dikatakan, \"Isa Almasih, anak Maryam.\" Kemudian aku melihat seorang lelaki berambut kerinting, buta sebelah mata kanan, yang seolah-olah seperti sebiji buah anggur yang menonjol keluar. Aku bertanya, \"Siapakah ini?\" Dikatakan, \"Dia adalah Dajjal.\""
  },
  {
    "id": 5676,
    "hadith_number": 5676,
    "tajuk_hadith": "Rambut Rasulullah SAW",
    "perawi_melayu": "Anas meriwayatkan:",
    "english_text": "The hair of the Prophet (ﷺ)   used to hang down up to his shoulders.",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا حَبَّانُ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، حَدَّثَنَا أَنَسٌ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَضْرِبُ شَعَرُهُ مَنْكِبَيْهِ‏.‏",
    "malay_translation": "Anas meriwayatkan bahawa rambut Nabi Muhammad SAW  biasa sampai ke bahu baginda."
  },
  {
    "id": 5677,
    "hadith_number": 5677,
    "tajuk_hadith": "Rambut Nabi SAW Sampai Ke Bahu",
    "perawi_melayu": "Anas meriwayatkan:",
    "english_text": "The head-hair of the Prophet (ﷺ) used to hang down to his shoulders.",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، كَانَ يَضْرِبُ شَعَرُ النَّبِيِّ صلى الله عليه وسلم مَنْكِبَيْهِ‏.‏",
    "malay_translation": "Anas meriwayatkan bahawa rambut Nabi SAW biasanya sampai ke bahu."
  },
  {
    "id": 5678,
    "hadith_number": 5678,
    "tajuk_hadith": "Rambut Rasulullah SAW",
    "perawi_melayu": "Riwayat Qatadah:",
    "english_text": "l asked Anas bin Malik about the hair of Allah's Messenger (ﷺ). He said, \"The hair of Allah's Messenger (ﷺ) \nwas neither much straight, nor much curly, and it used to hang down till between his shoulders and his \nearlobes.",
    "arabic_text": "حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ عَنْ شَعَرِ، رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ كَانَ شَعَرُ رَسُولِ اللَّهِ صلى الله عليه وسلم رَجِلاً، لَيْسَ بِالسَّبِطِ، وَلاَ الْجَعْدِ، بَيْنَ أُذُنَيْهِ وَعَاتِقِهِ‏.‏",
    "malay_translation": "Aku bertanya kepada Anas bin Malik tentang rambut Rasulullah SAW.  Beliau berkata, \"Rambut Rasulullah SAW sederhana, tidak terlalu lurus dan tidak terlalu kerinting, dan ia menjuntai hingga di antara telinga dan bahunya.\""
  },
  {
    "id": 5679,
    "hadith_number": 5679,
    "tajuk_hadith": "Tangan dan Rambut Rasulullah SAW",
    "perawi_melayu": "Anas meriwayatkan:",
    "english_text": "The Prophet (ﷺ) had big hands, and I have never seen anybody like him after him. The hair of the \nProphet was wavy, neither curly nor straight.",
    "arabic_text": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا جَرِيرٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم ضَخْمَ الْيَدَيْنِ، لَمْ أَرَ بَعْدَهُ مِثْلَهُ، وَكَانَ شَعَرُ النَّبِيِّ صلى الله عليه وسلم رَجِلاً، لاَ جَعْدَ، وَلاَ سَبِطَ‏.‏",
    "malay_translation": "Anas berkata: Rasulullah SAW mempunyai tangan yang besar. Aku tidak pernah melihat sesiapa pun seperti baginda selepas baginda. Dan rambut Rasulullah SAW adalah beralun, tidak kerinting dan tidak lurus."
  },
  {
    "id": 5680,
    "hadith_number": 5680,
    "tajuk_hadith": "Tangan dan Kaki Rasulullah SAW",
    "perawi_melayu": "Anas r.a.",
    "english_text": "The Prophet (ﷺ) had big hands and feet, and I have not seen anybody like him, neither before nor after \nhim, and his palms were soft.",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم ضَخْمَ الْيَدَيْنِ وَالْقَدَمَيْنِ حَسَنَ الْوَجْهِ، لَمْ أَرَ بَعْدَهُ وَلاَ قَبْلَهُ مِثْلَهُ، وَكَانَ بَسِطَ الْكَفَّيْنِ‏.‏",
    "malay_translation": "Anas r.a. berkata: Rasulullah SAW mempunyai tangan dan kaki yang besar, muka yang tampan. Aku tidak pernah melihat sesiapa pun yang serupa dengan baginda, baik sebelum mahupun selepas baginda. Tapak tangan baginda juga lembut."
  },
  {
    "id": 5681,
    "hadith_number": 5681,
    "tajuk_hadith": "Kaki dan Wajah Nabi SAW",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) had big feet and a good-looking face and l have not seen anybody like him after him.",
    "arabic_text": "حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا مُعَاذُ بْنُ هَانِئٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسِ بْنِ مَالِكٍ،‏.‏ أَوْ عَنْ رَجُلٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم ضَخْمَ الْقَدَمَيْنِ، حَسَنَ الْوَجْهِ، لَمْ أَرَ بَعْدَهُ مِثْلَهُ‏.‏",
    "malay_translation": "Daripada Anas bin Malik - atau daripada seorang lelaki, daripada Abu Hurairah - berkata: Nabi SAW mempunyai tapak kaki yang besar dan wajah yang tampan. Aku tidak pernah melihat sesiapa yang seperti baginda selepas baginda."
  },
  {
    "id": 5682,
    "hadith_number": 5682,
    "tajuk_hadith": "Kaki dan Tangan Nabi SAW yang Besar",
    "perawi_melayu": "Dari Anas:",
    "english_text": "The Prophet (ﷺ) had big feet and hands.",
    "arabic_text": "وَقَالَ هِشَامٌ عَنْ مَعْمَرٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، كَانَ النَّبِيُّ صلى الله عليه وسلم شَثْنَ الْقَدَمَيْنِ وَالْكَفَّيْنِ‏.‏",
    "malay_translation": "Dari Anas, bahawa Nabi Muhammad SAW mempunyai kaki dan tangan yang besar."
  },
  {
    "id": 5683,
    "hadith_number": 5683,
    "tajuk_hadith": "Tangan dan Kaki Rasulullah SAW",
    "perawi_melayu": "Anas atau Jabir bin Abdullah meriwayatkan:",
    "english_text": "The Prophet (ﷺ) \nhad big hands and feet and I have not seen anybody like him after him.",
    "arabic_text": "وَقَالَ أَبُو هِلاَلٍ حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ،‏.‏ أَوْ جَابِرِ بْنِ عَبْدِ اللَّهِ كَانَ النَّبِيُّ صلى الله عليه وسلم ضَخْمَ الْكَفَّيْنِ وَالْقَدَمَيْنِ، لَمْ أَرَ بَعْدَهُ شَبَهًا لَهُ‏.‏",
    "malay_translation": "Abu Hilal berkata, daripada Qatadah, daripada Anas atau Jabir bin Abdullah: Nabi Muhammad SAW mempunyai tapak tangan dan kaki yang besar. Aku tidak pernah melihat sesiapa yang serupa dengan baginda selepas baginda."
  },
  {
    "id": 5684,
    "hadith_number": 5684,
    "tajuk_hadith": "Keterangan Mengenai Dajjal dan Nabi Musa",
    "perawi_melayu": "Daripada Mujahid:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنِي ابْنُ أَبِي عَدِيٍّ، عَنِ ابْنِ عَوْنٍ، عَنْ مُجَاهِدٍ، قَالَ كُنَّا عِنْدَ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ فَذَكَرُوا الدَّجَّالَ فَقَالَ إِنَّهُ مَكْتُوبٌ بَيْنَ عَيْنَيْهِ كَافِرٌ‏.‏ وَقَالَ ابْنُ عَبَّاسٍ لَمْ أَسْمَعْهُ قَالَ ذَاكَ وَلَكِنَّهُ قَالَ ‏\n\"‏ أَمَّا إِبْرَاهِيمُ فَانْظُرُوا إِلَى صَاحِبِكُمْ، وَأَمَّا مُوسَى فَرَجُلٌ آدَمُ جَعْدٌ، عَلَى جَمَلٍ أَحْمَرَ مَخْطُومٍ بِخُلْبَةٍ، كَأَنِّي أَنْظُرُ إِلَيْهِ إِذِ انْحَدَرَ فِي الْوَادِي يُلَبِّي ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Al-Mutsanna, katanya; telah menceritakan kepadaku Ibnu Abi ‘Udy, dari Ibnu ‘Aun, daripada Mujahid, katanya; Kami berada di sisi Ibnu Abbas - semoga Allah SWT meridhai mereka berdua -, maka mereka menyebut tentang Dajjal. Lalu dikatakan bahawa tertulis di antara kedua matanya ‘Kafir’. Dan Ibnu Abbas berkata; Aku tidak pernah mendengar Baginda Nabi SAW bersabda demikian, tetapi Baginda bersabda:  \"Adapun Ibrahim, maka lihatlah kepada sahabat kamu (yakni Nabi Muhammad SAW), dan adapun Musa, dia adalah seorang lelaki berkulit sawo matang, berambut kerinting, menunggang unta berwarna merah yang diikat dengan tali rami yang kuat, seakan-akan aku melihatnya ketika dia turun di lembah sambil mengucapkan ‘Labbaik’."
  },
  {
    "id": 5685,
    "hadith_number": 5685,
    "tajuk_hadith": "Mencukur Rambut Semasa Ihram",
    "perawi_melayu": "Daripada Abdullah bin Umar:",
    "english_text": "I heard `Umar saying, \"Whoever braids his hair should shave it (on finishing lhram). You'd better not do, something like Talbid.\" Ibn `Umar used to say: \"I saw Allah's Messenger (ﷺ) with his hair stuck together with gum.\"",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ سَمِعْتُ عُمَرَ ـ رضى الله عنه ـ يَقُولُ مَنْ ضَفَّرَ فَلْيَحْلِقْ، وَلاَ تَشَبَّهُوا بِالتَّلْبِيدِ‏.‏ وَكَانَ ابْنُ عُمَرَ يَقُولُ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم مُلَبِّدًا‏.‏",
    "malay_translation": "Aku mendengar Umar berkata, \"Barangsiapa yang menganyam rambutnya hendaklah mencukur habis (selepas tamat ihram).  Janganlah kamu meniru perbuatan Talbid.\"  Ibn Umar berkata: \"Sesungguhnya aku telah melihat Rasulullah ﷺ dengan rambut baginda yang bercantum kerana disapu dengan gam.\""
  },
  {
    "id": 5686,
    "hadith_number": 5686,
    "tajuk_hadith": "Doa Haji Rasulullah SAW",
    "perawi_melayu": "Riwayat Ibnu Umar:",
    "english_text": "I heard Allah's Messenger (ﷺ), while he was in the state of Ihram and his hair was stuck together with gum, saying, \"Labbaik, Allahumma Labbaik, Labbaik La Sharika laka Labbaik. Inn-al-Hamda Wan-Ni'mata Laka wal-Mulk, La Sharika Lak.\" He did not add anything to those words.",
    "arabic_text": "حَدَّثَنِي حِبَّانُ بْنُ مُوسَى، وَأَحْمَدُ بْنُ مُحَمَّدٍ، قَالاَ أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُهِلُّ مُلَبِّدًا يَقُولُ ‏\n\"‏ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لاَ شَرِيكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ لاَ شَرِيكَ لَكَ ‏\"‏‏.‏ لاَ يَزِيدُ عَلَى هَؤُلاَءِ الْكَلِمَاتِ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW, ketika dalam keadaan ihram dan rambut baginda bercantum kerana gam, bersabda:  \"Labbaik, Allahumma Labbaik, Labbaik La Sharika laka Labbaik. Inn-al-Hamda Wan-Ni'mata Laka wal-Mulk, La Sharika Lak.\" Baginda tidak menambah apa-apa perkataan selain daripada itu."
  },
  {
    "id": 5687,
    "hadith_number": 5687,
    "tajuk_hadith": "Rasulullah SAW Melakukan Talbiyah dan Menghias Hedinya",
    "perawi_melayu": "Daripada Hafsah",
    "english_text": "(the wife of the Prophet) I said, \"O Allah's Messenger (ﷺ)! Why have the people finished their Ihram after \nperforming the `Umra while you have not finished your lhram after your `Umra?\" He said, \"I have \ndone Talbid (of my hair) and have decorated my Hadis with garlands, so I shall not finish my lhram \ntill l have slaughtered my Hadi (animal for sacrifice).",
    "arabic_text": "حَدَّثَنِي إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ حَفْصَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ مَا شَأْنُ النَّاسِ حَلُّوا بِعُمْرَةٍ، وَلَمْ تَحْلِلْ أَنْتَ مِنْ عُمْرَتِكَ قَالَ ‏\n\"‏ إِنِّي لَبَّدْتُ رَأْسِي، وَقَلَّدْتُ هَدْيِي، فَلاَ أَحِلُّ حَتَّى أَنْحَرَ ‏\"‏‏.‏",
    "malay_translation": "Aku berkata kepada Rasulullah SAW, \"Wahai Rasulullah, mengapa orang ramai telah menamatkan ihram mereka selepas menunaikan umrah, sedangkan Baginda belum menamatkan ihram Baginda selepas umrah?\" Baginda menjawab, \"Kerana aku telah melakukan talbiyah (mempersiapkan rambutku) dan telah menghiasi haiwan hadyiku, maka aku tidak akan menamatkan ihramku sehingga aku menyembelihnya.\""
  },
  {
    "id": 5688,
    "hadith_number": 5688,
    "tajuk_hadith": "Rasulullah SAW Mengikuti Amalan Ahli Kitab",
    "perawi_melayu": "Riwayat Ibnu Abbas:",
    "english_text": "The Prophet (ﷺ) used to copy the people of the Scriptures in matters in which there was no order from \nAllah. The people of the Scripture used to let their hair hang down while the pagans used to part their \nhair. So the Prophet (ﷺ) let his hair hang down first, but later on he parted it.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُحِبُّ مُوَافَقَةَ أَهْلِ الْكِتَابِ فِيمَا لَمْ يُؤْمَرْ فِيهِ، وَكَانَ أَهْلُ الْكِتَابِ يَسْدِلُونَ أَشْعَارَهُمْ، وَكَانَ الْمُشْرِكُونَ يَفْرُقُونَ رُءُوسَهُمْ، فَسَدَلَ النَّبِيُّ صلى الله عليه وسلم نَاصِيَتَهُ، ثُمَّ فَرَقَ بَعْدُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Yunus, telah menceritakan kepada kami Ibrahim bin Saad, telah menceritakan kepada kami Ibnu Syihab, daripada Ubaidillah bin Abdullah, daripada Ibnu Abbas r.a., katanya: Nabi SAW pernah mencontohi amalan Ahli Kitab dalam perkara yang tidak diperintahkan oleh Allah. Ahli Kitab membiarkan rambut mereka terurai, manakala orang musyrik pula membelah rambut mereka. Maka, Nabi SAW mula-mula membiarkan rambutnya terurai, kemudian baginda membelah rambutnya setelah itu."
  },
  {
    "id": 5689,
    "hadith_number": 5689,
    "tajuk_hadith": "Rambut Nabi SAW Ketika Ihram",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "As if I am now looking at the shine of the hair parting of the Prophet (ﷺ) while he was in the state of \nlhram.",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، وَعَبْدُ اللَّهِ بْنُ رَجَاءٍ، قَالاَ حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَأَنِّي أَنْظُرُ إِلَى وَبِيصِ الطِّيبِ فِي مَفَارِقِ النَّبِيِّ صلى الله عليه وسلم وَهْوَ مُحْرِمٌ‏.‏ قَالَ عَبْدُ اللَّهِ فِي مَفْرِقِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Seakan-akan aku masih melihat kilauan minyak wangi pada belahan rambut Nabi SAW ketika baginda dalam keadaan ihram."
  },
  {
    "id": 5690,
    "hadith_number": 5690,
    "tajuk_hadith": "Rasulullah SAW dan Solat Malam di Rumah Maimunah",
    "perawi_melayu": "Riwayat Ibnu Abbas",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا الْفَضْلُ بْنُ عَنْبَسَةَ، أَخْبَرَنَا هُشَيْمٌ، أَخْبَرَنَا أَبُو بِشْرٍ، ح وَحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا هُشَيْمٌ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ بِتُّ لَيْلَةً عِنْدَ مَيْمُونَةَ بِنْتِ الْحَارِثِ خَالَتِي، وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم عِنْدَهَا فِي لَيْلَتِهَا ـ قَالَ ـ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي مِنَ اللَّيْلِ، فَقُمْتُ عَنْ يَسَارِهِ ـ قَالَ ـ فَأَخَذَ بِذُؤَابَتِي فَجَعَلَنِي عَنْ يَمِينِهِ‏.‏ حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا أَبُو بِشْرٍ، بِهَذَا، وَقَالَ بِذُؤَابَتِي أَوْ بِرَأْسِي‏.‏",
    "malay_translation": "Kami telah diberitakan oleh Ali bin Abdullah, yang telah diberitakan kepadanya oleh Al-Fazl bin 'Unabasah, yang telah memberitakan kepadanya oleh Hushaim, yang telah memberitakan kepadanya oleh Abu Bishr, dan kami juga telah diberitakan oleh Qutaibah, yang telah diberitakan kepadanya oleh Hushaim, daripada Abu Bishr, daripada Sa'id bin Jubair, daripada Ibnu Abbas r.a., yang berkata: Aku bermalam suatu malam di rumah Maimunah binti Al-Harith, iaitu mak saudara perempuan aku.  Pada malam itu Rasulullah SAW berada di rumahnya.  Lalu Rasulullah SAW bangun untuk mendirikan solat malam.  Aku berdiri di sebelah kirinya, maka baginda memegang rambutku lalu meletakkan aku di sebelah kanannya.  Kami telah diberitakan oleh 'Amr bin Muhammad, yang telah diberitakan kepadanya oleh Hushaim, yang telah memberitakan kepadanya oleh Abu Bishr, dengan periwayat yang sama, dan dia berkata, 'dengan rambutku' atau 'dengan kepalaku'."
  },
  {
    "id": 5691,
    "hadith_number": 5691,
    "tajuk_hadith": "Larangan Membiarkan Rambut Berumbai (Al-Qaza')",
    "perawi_melayu": "Riwayat Ubaidullah bin Hafs:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مُحَمَّدٌ، قَالَ أَخْبَرَنِي مَخْلَدٌ، قَالَ أَخْبَرَنِي ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ حَفْصٍ، أَنَّ عُمَرَ بْنَ نَافِعٍ، أَخْبَرَهُ عَنْ نَافِعٍ، مَوْلَى عَبْدِ اللَّهِ أَنَّهُ سَمِعَ ابْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَنْهَى عَنِ الْقَزَعِ‏.‏ قَالَ عُبَيْدُ اللَّهِ قُلْتُ وَمَا الْقَزَعُ فَأَشَارَ لَنَا عُبَيْدُ اللَّهِ قَالَ إِذَا حَلَقَ الصَّبِيَّ وَتَرَكَ هَا هُنَا شَعَرَةً وَهَا هُنَا وَهَا هُنَا‏.‏ فَأَشَارَ لَنَا عُبَيْدُ اللَّهِ إِلَى نَاصِيَتِهِ وَجَانِبَىْ رَأْسِهِ‏.‏ قِيلَ لِعُبَيْدِ اللَّهِ فَالْجَارِيَةُ وَالْغُلاَمُ قَالَ لاَ أَدْرِي هَكَذَا قَالَ الصَّبِيِّ‏.‏ قَالَ عُبَيْدُ اللَّهِ وَعَاوَدْتُهُ فَقَالَ أَمَّا الْقُصَّةُ وَالْقَفَا لِلْغُلاَمِ فَلاَ بَأْسَ بِهِمَا وَلَكِنَّ الْقَزَعَ أَنْ يُتْرَكَ بِنَاصِيَتِهِ شَعَرٌ، وَلَيْسَ فِي رَأْسِهِ غَيْرُهُ، وَكَذَلِكَ شَقُّ رَأْسِهِ هَذَا وَهَذَا‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Muhammad, katanya: telah memberitakan kepadaku Makhalad, katanya: telah memberitakan kepadaku Ibnu Juraij, katanya: telah memberitakan kepadaku Ubaidullah bin Hafsh, bahawa Umar bin Nafi’ telah memberitakan kepadanya daripada Nafi’, hamba Abdullah bahawa dia telah mendengar Ibnu Umar berkata: Aku telah mendengar Rasulullah SAW melarang al-qaza’. Ubaidullah berkata: Aku bertanya, Apakah al-qaza’? Maka Ubaidullah menunjukkan kepada kami (ke arah kepalanya), katanya: jika seorang kanak-kanak lelaki itu dicukur kepalanya dan ditinggalkan sehelai rambut di sini, sehelai rambut di sini dan sehelai rambut di sini. Maka Ubaidullah menunjukkan kepada kami ke bahagian ubun-ubun dan tepi kepalanya. Dikatakan kepada Ubaidullah: Bagaimana pula dengan kanak-kanak perempuan dan lelaki? Katanya: Aku tidak tahu, seperti itulah yang dikatakan mengenai kanak-kanak lelaki. Ubaidullah berkata: Aku bertanya kepadanya lagi, maka dia berkata: Adapun menggunting rambut di bahagian pelipis dan belakang kepala kanak-kanak lelaki, maka tidak mengapa, tetapi al-qaza’ ialah jika ditinggalkan rambut di bahagian ubun-ubunnya sahaja, sedang bahagian kepala yang lain tidak berambut, dan begitu juga dengan bahagian tepi kepalanya."
  },
  {
    "id": 5692,
    "hadith_number": 5692,
    "tajuk_hadith": "Larangan Membiarkan Rambut Tersebar Selepas Bercukur",
    "perawi_melayu": "Daripada Abdullah bin Umar:",
    "english_text": "Allah's Messenger (ﷺ) forbade Al-Qaza' (leaving a tuft of hair here and there after shaving one's head.)",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُثَنَّى بْنِ عَبْدِ اللَّهِ بْنِ أَنَسِ بْنِ مَالِكٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْقَزَعِ‏.‏",
    "malay_translation": "Rasulullah SAW melarang amalan al-qaza’ (iaitu meninggalkan sedikit rambut di sana sini selepas mencukur kepala)."
  },
  {
    "id": 5693,
    "hadith_number": 5693,
    "tajuk_hadith": "Menyium Wangi Nabi SAW Sebelum Ihram dan di Mina",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "I applied perfume to the Prophet (ﷺ) with my own hands when he wanted to assume the state of Ihram, \nand I also perfumed him at Mina before he departed from there (to perform Tawaf-al-Ifada).",
    "arabic_text": "حَدَّثَنِي أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ، أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ طَيَّبْتُ النَّبِيَّ صلى الله عليه وسلم بِيَدِي لِحُرْمِهِ، وَطَيَّبْتُهُ بِمِنًى قَبْلَ أَنْ يُفِيضَ‏.‏",
    "malay_translation": "Aku sendiri menyapukan minyak wangi ke atas Nabi SAW ketika baginda hendak berihram, dan aku juga menyapukan minyak wangi ke atas baginda di Mina sebelum baginda berangkat dari situ (untuk melakukan Tawaf al-Ifadah)."
  },
  {
    "id": 5694,
    "haditi_number": 5694,
    "tajuk_hadith": "Menyemburkan Wangian Kepada Rasulullah SAW",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "I used to perfume Allah's Messenger (ﷺ) with the best scent available till I saw the shine of the scent on his \nhead and beard.",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ نَصْرٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَسْوَدِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أُطَيِّبُ النَّبِيَّ صلى الله عليه وسلم بِأَطْيَبِ مَا يَجِدُ، حَتَّى أَجِدَ وَبِيصَ الطِّيبِ فِي رَأْسِهِ وَلِحْيَتِهِ‏.‏",
    "malay_translation": "Aku selalu menyuraikan minyak wangi yang terbaik kepada Rasulullah SAW sehingga aku nampak kilauan minyak wangi itu di kepala dan janggut baginda."
  },
  {
    "id": 5695,
    "hadith_number": 5695,
    "tajuk_hadith": "Keperluan Meminta Izin Sebelum Melihat",
    "perawi_melayu": "Riwayat Sa'd",
    "english_text": "A man peeped into the house of the Prophet (ﷺ) through a hole while the Prophet (ﷺ) was scratching his head \nwith a Midrai (a certain kind of comb). On that the Prophet (ﷺ) said (to him), \"If I had known you had \nbeen looking, then I would have pierced your eye with that instrument, because the asking of \npermission has been ordained so that one would not see things unlawfully.\"",
    "arabic_text": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنْ سَهْلِ بْنِ سَعْدٍ، أَنَّ رَجُلاً، اطَّلَعَ مِنْ جُحْرٍ فِي دَارِ النَّبِيِّ صلى الله عليه وسلم وَالنَّبِيُّ صلى الله عليه وسلم يَحُكُّ رَأْسَهُ بِالْمِدْرَى فَقَالَ ‏\n\"‏ لَوْ عَلِمْتُ أَنَّكَ تَنْظُرُ لَطَعَنْتُ بِهَا فِي عَيْنِكَ، إِنَّمَا جُعِلَ الإِذْنُ مِنْ قِبَلِ الأَبْصَارِ ‏\"‏‏.‏",
    "malay_translation": "Seorang lelaki mengintai ke dalam rumah Nabi ﷺ melalui lubang ketika Nabi ﷺ sedang menggaru kepala baginda dengan midrai (sejenis sikat).  Lalu Nabi ﷺ bersabda kepadanya, \"Sekiranya Aku tahu engkau sedang melihat, nescaya Aku akan menusuk matamu dengannya. Sesungguhnya meminta izin itu telah diwajibkan supaya seseorang tidak melihat perkara yang haram.\""
  },
  {
    "id": 5696,
    "hadith_number": 5696,
    "tajuk_hadith": "Aisyah Merawat Rambut Rasulullah SAW Ketika Haid",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "I used to comb the hair of Allah's Messenger (ﷺ) during my periods.\n\nThis hadith also reaches us through another chain",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كُنْتُ أُرَجِّلُ رَأْسَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَنَا حَائِضٌ‏.‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، مِثْلَهُ‏.‏",
    "malay_translation": "Aisyah berkata:  Aku biasa menyisir rambut Rasulullah SAW ketika aku dalam keadaan haid.  Hadis ini juga sampai kepada kita melalui sanad yang lain."
  },
  {
    "id": 5697,
    "hadith_number": 5697,
    "tajuk_hadith": "Keutamaan Memulakan Dari Sebelah Kanan",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "The Prophet (ﷺ) used to like to start from the right side as far as possible in combing and in performing \nablution.",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ أَشْعَثَ بْنِ سُلَيْمٍ، عَنْ أَبِيهِ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ يُعْجِبُهُ التَّيَمُّنُ مَا اسْتَطَاعَ فِي تَرَجُّلِهِ وَوُضُوئِهِ‏.‏",
    "malay_translation": "Daripada Aisyah, bahawa Nabi SAW menyukai untuk memulakan dari sebelah kanan sedaya mungkin ketika bersisir rambut dan berwuduk."
  },
  {
    "id": 5698,
    "hadith_number": 5698,
    "tajuk_hadith": "Ganjaran Puasa",
    "perawi_melayu": "Riwayat Abu Hurairah",
    "english_text": "The Prophet (ﷺ) said, \"(Allah said), 'Every good deed of Adam's son is for him except fasting; it is for \nMe. and I shall reward (the fasting person) for it.' Verily, the smell of the mouth of a fasting person is \nbetter to Allah than the smell of musk.\"",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ كُلُّ عَمَلِ ابْنِ آدَمَ لَهُ، إِلاَّ الصَّوْمَ فَإِنَّهُ لِي، وَأَنَا أَجْزِي بِهِ، وَلَخَلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"(Allah SWT berfirman), 'Setiap amal anak Adam adalah untuknya, kecuali puasa. Puasa itu untuk-Ku, dan Aku sendiri akan memberi ganjaran kepadanya.' Sesungguhnya, bau mulut orang yang berpuasa lebih harum di sisi Allah daripada bau kasturi.\""
  },
  {
    "id": 5699,
    "hadith_number": 5699,
    "tajuk_hadith": "Menyediakan Wangian Terbaik untuk Nabi SAW Semasa Ihram",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "used to perfume the Prophet (ﷺ) before his assuming the state of with the best scent available.",
    "arabic_text": "حَدَّثَنَا مُوسَى، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا هِشَامٌ، عَنْ عُثْمَانَ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كُنْتُ أُطَيِّبُ النَّبِيَّ صلى الله عليه وسلم عِنْدَ إِحْرَامِهِ بِأَطْيَبِ مَا أَجِدُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Musa, telah menceritakan kepada kami Wahb, telah menceritakan kepada kami Hisyam, daripada Usman bin Urwah, daripada bapanya, daripada Aisyah r.a., katanya: Aku biasa menwangikan Nabi SAW ketika baginda hendak berihram dengan wangian yang paling harum yang aku jumpai."
  },
  {
    "id": 5700,
    "hadith_number": 5700,
    "tajuk_hadith": "Anas dan Baginda SAW Tidak Menolak Wangian",
    "perawi_melayu": "Daripada Thu'amah bin Abdullah; dari Anas r.a.",
    "english_text": "Anas never used to refuse (a gift of) scent and used to say that the Prophet (ﷺ) never used to refuse (a gift of) scent.",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عَزْرَةُ بْنُ ثَابِتٍ الأَنْصَارِيُّ، قَالَ حَدَّثَنِي ثُمَامَةُ بْنُ عَبْدِ اللَّهِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّهُ كَانَ لاَ يَرُدُّ الطِّيبَ، وَزَعَمَ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ لاَ يَرُدُّ الطِّيبَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Azrah bin Tsabit al-Anshari, katanya: Telah menceritakan kepadaku Thu'amah bin Abdullah daripada Anas r.a. bahawa beliau tidak menolak pemberian wangi-wangian, dan beliau mengatakan bahawa Nabi SAW juga tidak menolak pemberian wangi-wangian."
  },
  {
    "id": 5701,
    "haditi_number": 5701,
    "tajuk_hadith": "Mengenai Pewangi Rasulullah SAW Semasa Haji Wada'",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "During Hajjat-al-Wada`, I perfumed Allah's Messenger (ﷺ) with Dharira with my own hands, both on his \nassuming Ihram and on finishing it.",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ الْهَيْثَمِ، أَوْ مُحَمَّدٌ عَنْهُ عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي عُمَرُ بْنُ عَبْدِ اللَّهِ بْنِ عُرْوَةَ، سَمِعَ عُرْوَةَ، وَالْقَاسِمَ، يُخْبِرَانِ عَنْ عَائِشَةَ، قَالَتْ طَيَّبْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم بِيَدَىَّ بِذَرِيرَةٍ فِي حَجَّةِ الْوَدَاعِ، لِلْحِلِّ وَالإِحْرَامِ‏.‏",
    "malay_translation": "Aku telah menyiram baginda Rasulullah SAW dengan minyak wangi Dharirah dengan tanganku sendiri semasa Haji Wada', baik ketika baginda memakai ihram mahupun ketika baginda selesai daripada mengerjakannya."
  },
  {
    "id": 5702,
    "hadith_number": 5702,
    "tajuk_hadith": "Laknat Allah ke atas Wanita yang Menyukainya Kecantikan",
    "perawi_melayu": "Daripada Abdullah:",
    "english_text": "Allah has cursed those women who practise tattooing and those who get themselves tattooed, and \nthose who remove their face hairs, and those who create a space between their teeth artificially to look \nbeautiful, and such women as change the features created by Allah. Why then should I not curse those \nwhom the Prophet (ﷺ) has cursed? And that is in Allah's Book. i.e. His Saying: 'And what the Apostle \ngives you take it and what he forbids you abstain (from it).' (59.7)",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، لَعَنَ اللَّهُ الْوَاشِمَاتِ، وَالْمُسْتَوْشِمَاتِ، وَالْمُتَنَمِّصَاتِ وَالْمُتَفَلِّجَاتِ لِلْحُسْنِ، الْمُغَيِّرَاتِ خَلْقَ اللَّهِ تَعَالَى، مَالِي لاَ أَلْعَنُ مَنْ لَعَنَ النَّبِيُّ صلى الله عليه وسلم وَهْوَ فِي كِتَابِ اللَّهِ ‏{‏وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ‏}‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Usman, telah menceritakan kepada kami Jarir, dari Mansur, dari Ibrahim, dari Alqamah, dari Abdullah: Allah melaknat wanita-wanita yang membuat tatu dan wanita-wanita yang ditatu, dan wanita-wanita yang mencabut bulu muka mereka, dan wanita-wanita yang menjarangkan gigi mereka secara buatan untuk kecantikan, dan wanita-wanita yang mengubah ciptaan Allah. Maka mengapakah aku tidak akan melaknat sesiapa yang telah dilaknat oleh Nabi SAW? Dan ia terdapat dalam kitab Allah: {Dan apa sahaja yang diberikan Rasul kepadamu, maka terimalah; dan apa sahaja yang dilarangnya kepadamu, maka tinggalkanlah.} (At-Taghabun: 7)"
  },
  {
    "id": 5703,
    "hadith_number": 5703,
    "tajuk_hadith": "Larangan Memakai Rambut Palsu",
    "perawi_melayu": "Riwayat Humaid bin Abdur-Rahman bin Auf:",
    "english_text": "that in the year he performed Hajj. he heard Mu'awiya bin Abi Sufyan, who was on the pulpit and was \ntaking a tuft of hair from one of his guards, saying, \"Where are your religious learned men? I heard \nAllah's Messenger (ﷺ) forbidding this (false hair) and saying, 'The children of Israel were destroyed when \ntheir women started using this.'\"",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّهُ سَمِعَ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ، عَامَ حَجَّ وَهْوَ عَلَى الْمِنْبَرِ، وَهْوَ يَقُولُ ـ وَتَنَاوَلَ قُصَّةً مِنْ شَعَرٍ كَانَتْ بِيَدِ حَرَسِيٍّ ـ أَيْنَ عُلَمَاؤُكُمْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَنْهَى عَنْ مِثْلِ هَذِهِ وَيَقُولُ ‏\n\"‏ إِنَّمَا هَلَكَتْ بَنُو إِسْرَائِيلَ حِينَ اتَّخَذَ هَذِهِ نِسَاؤُهُمْ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ismail, katanya telah menceritakan kepadaku Malik, dari Ibnu Syihab, dari Humaid bin Abdur-Rahman bin Auf, bahawa dia mendengar Muawiyah bin Abi Sufyan, pada tahun haji dan dia berada di atas mimbar, sambil berkata – dan dia mengambil segumpal rambut yang berada di tangan pengawalnya – “Di manakah para ulama kamu? Aku mendengar Rasulullah SAW melarang perkara seumpama ini dan baginda bersabda:  “Sesungguhnya Bani Israil telah binasa apabila wanita-wanita mereka mula menggunakannya.”"
  },
  {
    "id": 5704,
    "hadith_number": 5704,
    "tajuk_hadith": "Laknat Allah ke atas Wanita yang Memanjangkan Rambut dan Bertatu",
    "perawi_melayu": "Dari Abu Hurairah",
    "english_text": "The Prophet (ﷺ) said, \"Allah has cursed the \nlady who artificially lengthens (her or someone else's) hair and the one who gets her hair lengthened \nand the One who tattoos (herself or someone else) and the one who gets herself tattooed\"",
    "arabic_text": "وَقَالَ ابْنُ أَبِي شَيْبَةَ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا فُلَيْحٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَعَنَ اللَّهُ الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ، وَالْوَاشِمَةَ وَالْمُسْتَوْشِمَةَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Allah melaknat perempuan yang memanjangkan rambutnya (dengan cara buatan) dan perempuan yang menyuruh memanjangkan rambutnya, dan perempuan yang membuat tatu dan perempuan yang meminta dibuat tatu.\""
  },
  {
    "id": 5705,
    "hadith_number": 5705,
    "tajuk_hadith": "Larangan Menyambung Rambut",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "An Ansari girl was married and she became sick and all her hair fell out intending to provide her \nwith false hair. They asked the Prophet (ﷺ) who said, \"Allah has cursed the lady who artificially \nlengthens (her or someone else's) hair and also the one who gets her hair lengthened.\"",
    "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، قَالَ سَمِعْتُ الْحَسَنَ بْنَ مُسْلِمِ بْنِ يَنَّاقٍ، يُحَدِّثُ عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ جَارِيَةً، مِنَ الأَنْصَارِ تَزَوَّجَتْ، وَأَنَّهَا مَرِضَتْ فَتَمَعَّطَ شَعَرُهَا، فَأَرَادُوا أَنْ يَصِلُوهَا فَسَأَلُوا النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ لَعَنَ اللَّهُ الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ ‏\"‏‏.‏ تَابَعَهُ ابْنُ إِسْحَاقَ عَنْ أَبَانَ بْنِ صَالِحٍ عَنِ الْحَسَنِ عَنْ صَفِيَّةَ عَنْ عَائِشَةَ‏.‏",
    "malay_translation": "Seorang gadis Ansar telah berkahwin, kemudian dia jatuh sakit dan semua rambutnya gugur. Mereka ingin menyambung rambutnya, lalu mereka bertanya kepada Nabi ﷺ. Baginda bersabda:  \"Allah melaknat perempuan yang menyambung rambut dan perempuan yang meminta rambutnya disambung.\""
  },
  {
    "id": 5706,
    "hadith_number": 5706,
    "tajuk_hadith": "Larangan Menyambung Rambut",
    "perawi_melayu": "Riwayat Asma' binti Abu Bakar",
    "english_text": "(the daughter of Abu' Bakr) A woman came to Allah's Messenger (ﷺ) and said, \"I married my daughter to \nsomeone, but she became sick and all her hair fell out, and (because of that) her husband does not like \nher. May I let her use false hair?\" On that the Prophet (ﷺ) cursed such a lady as artificially lengthening \n(her or someone else's) hair or got her hair lengthened artificially.",
    "arabic_text": "حَدَّثَنِي أَحْمَدُ بْنُ الْمِقْدَامِ، حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنَا مَنْصُورُ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَتْنِي أُمِّي، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ ـ رضى الله عنهما ـ أَنَّ امْرَأَةً، جَاءَتْ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ إِنِّي أَنْكَحْتُ ابْنَتِي، ثُمَّ أَصَابَهَا شَكْوَى فَتَمَرَّقَ رَأْسُهَا، وَزَوْجُهَا يَسْتَحِثُّنِي بِهَا أَفَأَصِلُ رَأْسَهَا فَسَبَّ رَسُولُ اللَّهِ صلى الله عليه وسلم الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ‏.‏",
    "malay_translation": "Telah menceritakan kepada saya Ahmad bin Al-Miqdam, telah menceritakan kepada kami Fudhail bin Sulaiman, telah menceritakan kepada kami Mansur bin Abdurrahman, dia berkata: Telah menceritakan kepadaku ibuku, daripada Asma' binti Abu Bakar r.a., bahawa seorang wanita datang kepada Rasulullah s.a.w. lalu berkata: \"Sesungguhnya aku telah menikahkan anak perempuanku, kemudian dia ditimpa penyakit lalu rambutnya gugur, dan suaminya tidak menyukainya. Bolehkah aku menyambung rambutnya?\" Maka Rasulullah s.a.w. melaknat wanita yang menyambung rambutnya atau menyuruh menyambung rambutnya."
  },
  {
    "id": 5707,
    "hadith_number": 5707,
    "tajuk_hadith": "Laknat Ke Atas Wanita Yang Memanjangkan Rambut",
    "perawi_melayu": "Riwayat Asma'",
    "english_text": "(the daughter of Abu Bakr) Allah's Messenger (ﷺ) has cursed such a lady as artificially lengthening (her or someone else's) hair or gets her hair lengthened.",
    "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنِ امْرَأَتِهِ، فَاطِمَةَ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، قَالَتْ لَعَنَ النَّبِيُّ صلى الله عليه وسلم الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Adam, telah menceritakan kepada kami Syu’bah, dari Hisyam bin Urwah, dari isterinya, Fatimah dari Asma’ binti Abu Bakar, katanya: Rasulullah SAW melaknat wanita yang memanjangkan rambutnya dan wanita yang menyuruh memanjangkan rambutnya."
  },
  {
    "id": 5708,
    "hadith_number": 5708,
    "tajuk_hadith": "Laknat Allah ke atas Wanita yang Memanjangkan Rambut dan Bertatu",
    "perawi_melayu": "Riwayat Ibnu Umar:",
    "english_text": "Allah's Messenger (ﷺ) said, \"Allah has cursed such a lady as lengthens (her or someone else's) hair artificially or gets it lengthened, and also a lady who tattoos (herself or someone else) or gets herself tattooed.",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَعَنَ اللَّهُ الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ، وَالْوَاشِمَةَ وَالْمُسْتَوْشِمَةَ ‏\"‏‏.‏ قَالَ نَافِعٌ الْوَشْمُ فِي اللِّثَةِ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Allah melaknat wanita yang memanjangkan rambutnya atau menyuruh orang memanjangkan rambutnya secara buatan, dan wanita yang membuat tatu atau menyuruh orang membuat tatu pada dirinya.\""
  },
  {
    "id": 5709,
    "hadith_number": 5709,
    "tajuk_hadith": "Larangan Memakai Rambut Palsu",
    "perawi_melayu": "Riwayat Sa`id bin Al-Musaiyab:",
    "english_text": "Mu'awiya came to Medina for the last time and delivered a sermon. He took out a tuft of hair and said, \n\"I thought that none used to do this (i.e. use false hair) except Jews. The Prophet (ﷺ) labelled such \npractice, (i.e. the use of false hair), as cheating.",
    "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَمْرُو بْنُ مُرَّةَ، سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، قَالَ قَدِمَ مُعَاوِيَةُ الْمَدِينَةَ آخِرَ قَدْمَةٍ قَدِمَهَا، فَخَطَبَنَا فَأَخْرَجَ كُبَّةً مِنْ شَعَرٍ قَالَ مَا كُنْتُ أَرَى أَحَدًا يَفْعَلُ هَذَا غَيْرَ الْيَهُودِ، إِنَّ النَّبِيَّ صلى الله عليه وسلم سَمَّاهُ الزُّورَ‏.‏ يَعْنِي الْوَاصِلَةَ فِي الشَّعَرِ‏.‏",
    "malay_translation": "Muawiyah datang ke Madinah buat kali terakhir dan menyampaikan khutbah.  Baginda mengeluarkan segumpal rambut dan berkata, \"Aku fikir tiada siapa yang melakukan perkara ini (iaitu, memakai rambut palsu) kecuali orang Yahudi.  Rasulullah ﷺ melabelkan amalan sebegini (iaitu, memakai rambut palsu) sebagai penipuan.\""
  },
  {
    "id": 5710,
    "hadith_number": 5710,
    "tajuk_hadith": "Larangan Mengubah Ciptaan Allah",
    "perawi_melayu": "Riwayat Alqama",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، قَالَ لَعَنَ عَبْدُ اللَّهِ الْوَاشِمَاتِ، وَالْمُتَنَمِّصَاتِ، وَالْمُتَفَلِّجَاتِ لِلْحُسْنِ، الْمُغَيِّرَاتِ خَلْقَ اللَّهِ‏.‏ فَقَالَتْ أُمُّ يَعْقُوبَ مَا هَذَا قَالَ عَبْدُ اللَّهِ وَمَا لِيَ لاَ أَلْعَنُ مَنْ لَعَنَ رَسُولُ اللَّهِ، وَفِي كِتَابِ اللَّهِ‏.‏ قَالَتْ وَاللَّهِ لَقَدْ قَرَأْتُ مَا بَيْنَ اللَّوْحَيْنِ فَمَا وَجَدْتُهُ‏.‏ قَالَ وَاللَّهِ لَئِنْ قَرَأْتِيهِ لَقَدْ وَجَدْتِيهِ ‏{‏وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانْتَهُوا‏}‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ishaq bin Ibrahim, memberitakan kepada kami Jarir, daripada Mansur, daripada Ibrahim, daripada Alqama, katanya: Abdullah melaknat perempuan-perempuan yang membuat tatu, dan perempuan-perempuan yang mencabut bulu muka mereka, dan perempuan-perempuan yang menjarangkan gigi mereka untuk kecantikan, iaitu mereka yang mengubah ciptaan Allah. Maka berkata Ummu Ya’qub: Apakah ini? Kata Abdullah: Mengapa aku tidak melaknat mereka yang telah dilaknat oleh Rasulullah SAW dan terdapat dalam kitab Allah? Dia berkata: Demi Allah, sesungguhnya aku telah membaca seluruh Al-Quran, tetapi aku tidak menjumpainya. Kata Abdullah: Demi Allah, sekiranya engkau membacanya (dengan teliti), nescaya engkau akan menjumpainya.  (Allah SWT berfirman): \"Dan apa jua yang diberikan Rasul kepadamu, maka terimalah; dan apa jua yang dilarangnya daripada kamu, maka tinggalkanlah.\" (At-Taubah: 7)"
  },
  {
    "id": 5711,
    "hadith_number": 5711,
    "tajuk_hadith": "Larangan Menyambung Rambut dan Mencucuk Ikat",
    "perawi_melayu": "Riwayat Ibnu Umar",
    "english_text": "The Prophet (ﷺ) has cursed the lady who lengthens her hair artificially and the one who gets her hair \nlengthened, and also the lady who tattoos (herself or others) and the one who gets herself tattooed.",
    "arabic_text": "حَدَّثَنِي مُحَمَّدٌ، حَدَّثَنَا عَبْدَةُ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ لَعَنَ النَّبِيُّ صلى الله عليه وسلم الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ، وَالْوَاشِمَةَ وَالْمُسْتَوْشِمَةَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad, telah menceritakan kepada kami Abidah, dari Ubaidillah, dari Nafi', dari Ibnu Umar r.a., bahawa Nabi SAW telah melaknat perempuan yang menyambung rambutnya dan perempuan yang meminta rambutnya disambung, dan perempuan yang menindik serta perempuan yang meminta ditindik."
  },
  {
    "id": 5712,
    "hadith_number": 5712,
    "tajuk_hadith": "Larangan Memanjangkan Rambut Secara Buatan",
    "perawi_melayu": "Riwayat Asma':",
    "english_text": "A woman asked the Prophet (ﷺ) saying, \"0 Allah's Messenger (ﷺ)! My daughter got measles and her hair fell out. Now that I got her married, may I let her use false hair?\" He said (to her), \"Allah has cursed the lady who lengthens hair artificially and the one who gets her hair lengthened artificially.\"",
    "arabic_text": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا هِشَامٌ، أَنَّهُ سَمِعَ فَاطِمَةَ بِنْتَ الْمُنْذِرِ، تَقُولُ سَمِعْتُ أَسْمَاءَ، قَالَتْ سَأَلَتِ امْرَأَةٌ النَّبِيَّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ ابْنَتِي أَصَابَتْهَا الْحَصْبَةُ، فَامَّرَقَ شَعَرُهَا، وَإِنِّي زَوَّجْتُهَا أَفَأَصِلُ فِيهِ فَقَالَ ‏\n\"‏ لَعَنَ اللَّهُ الْوَاصِلَةَ وَالْمَوْصُولَةَ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Al-Humaidi, telah menceritakan kepada kami Sufian, telah menceritakan kepada kami Hisyam, bahawa dia mendengar Fatimah binti Al-Munduir berkata, aku mendengar Asma’ berkata, seorang wanita bertanya kepada Nabi SAW, katanya: \"Wahai Rasulullah, anak perempuanku dijangkiti penyakit campak lalu rambutnya gugur.  Kini aku telah menikahkannya, bolehkah aku menyambung rambutnya?\"  Baginda menjawab:  \"Allah melaknat wanita yang menyambung rambut dan wanita yang meminta rambutnya disambung.\""
  },
  {
    "id": 5713,
    "hadith_number": 5713,
    "tajuk_hadith": "Laknat ke atas Wanita yang Membuat dan Menerima Tatu serta Memanjangkan Rambut",
    "perawi_melayu": "Riwayat Ibnu Umar:",
    "english_text": "I heard the Prophet (ﷺ) saying, (or the Prophet (ﷺ) said), \"Allah has cursed the lady who practices tattooing and that who gets it done for herself, and also the lady who lengthens hair artificially and that who gets her hair lengthened artificially.\" The Prophet (ﷺ) has cursed such ladies.",
    "arabic_text": "حَدَّثَنِي يُوسُفُ بْنُ مُوسَى، حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ، حَدَّثَنَا صَخْرُ بْنُ جُوَيْرِيَةَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم أَوْ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ الْوَاشِمَةُ وَالْمُوتَشِمَةُ، وَالْوَاصِلَةُ وَالْمُسْتَوْصِلَةُ ‏\"‏‏.‏ يَعْنِي لَعَنَ النَّبِيُّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Aku mendengar Nabi SAW bersabda (atau Nabi SAW bersabda), \"Allah melaknat wanita yang membuat tatu dan wanita yang meminta ditatu, dan juga wanita yang memanjangkan rambut secara buatan dan wanita yang meminta rambutnya dipanjangkan secara buatan.\"  Nabi SAW melaknat wanita-wanita sedemikian."
  },
  {
    "id": 5714,
    "hadith_number": 5714,
    "tajuk_hadith": "Laknat Allah ke atas Wanita yang Mencucuk, Mencabut Bulu, dan Mengubah Ciptaan Allah",
    "perawi_melayu": "Riwayat Ibn Mas'ud:",
    "english_text": "Allah has cursed those women who practise tattooing or get it done for themselves, and those who \nremove hair from their faces, and those who create spaces between their teeth artificially to look \nbeautiful, such ladies as change the features created by Allah. Why then shall I not curse those whom \nAllah's Messenger (ﷺ) has cursed and who are cursed in Allah's Book too?",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنِ ابْنِ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ لَعَنَ اللَّهُ الْوَاشِمَاتِ، وَالْمُسْتَوْشِمَاتِ، وَالْمُتَنَمِّصَاتِ وَالْمُتَفَلِّجَاتِ لِلْحُسْنِ، الْمُغَيِّرَاتِ خَلْقَ اللَّهِ، مَا لِي لاَ أَلْعَنُ مَنْ لَعَنَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهْوَ فِي كِتَابِ اللَّهِ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Muhammad bin Muqatil, memberitakan kepada kami Abdullah, memberitakan kepada kami Sufyan, daripada Mansur, daripada Ibrahim, daripada Alqamah, daripada Ibnu Mas'ud - r.a. - bahawa Baginda berkata: Allah melaknat wanita-wanita yang menindik, yang meminta ditindik, yang mencabut bulu muka dan yang menjarangkan gigi untuk kecantikan, iaitu mereka yang mengubah ciptaan Allah. Maka mengapakah aku tidak melaknat mereka yang telah dilaknat oleh Rasulullah SAW dan yang dilaknat dalam Kitabullah."
  },
  {
    "id": 5715,
    "hadith_number": 5715,
    "tajuk_hadith": "Mata Jahat dan Larangan Menatu",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "Allah's Messenger (ﷺ) said, \"The evil eye is a fact,\" and he forbade tattooing.",
    "arabic_text": "حَدَّثَنِي يَحْيَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْعَيْنُ حَقٌّ ‏\"‏‏.‏ وَنَهَى عَنِ الْوَشْمِ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Mata jahat itu adalah satu hakikat.\" Baginda juga melarang amalan menatu."
  },
  {
    "id": 5716,
    "hadith_number": 5716,
    "tajuk_hadith": "Riwayat Abdullah tentang Hadis dari Ummu Ya'qub",
    "perawi_melayu": "Dari Abdullah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي ابْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، قَالَ ذَكَرْتُ لِعَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ حَدِيثَ مَنْصُورٍ عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ،، فَقَالَ سَمِعْتُهُ مِنْ أُمِّ يَعْقُوبَ، عَنْ عَبْدِ اللَّهِ، مِثْلَ حَدِيثِ مَنْصُورٍ‏.‏",
    "malay_translation": "Ibn Bashar telah meriwayatkan kepadaku, Ibn Mahdi telah meriwayatkan kepada kami, Sufyan telah meriwayatkan kepada kami, katanya: Aku telah menyebutkan kepada Abdur Rahman bin Abas hadis Mansur daripada Ibrahim, daripada Alqamah, daripada Abdullah. Kemudian katanya: Aku telah mendengarnya daripada Ummu Ya'qub, daripada Abdullah, seperti hadis Mansur."
  },
  {
    "id": 5717,
    "hadith_number": 5717,
    "tajuk_hadith": "Larangan Nabi SAW terhadap Beberapa Perkara",
    "perawi_melayu": "Riwayat Abu Juhaifa:",
    "english_text": "The Prophet (ﷺ) forbade the use of the price of blood and the price of a dog, the one who takes (eats) usury the one who gives usury, the woman who practises tattooing and the woman who gets herself tattooed.",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ، قَالَ رَأَيْتُ أَبِي فَقَالَ إِنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ ثَمَنِ الدَّمِ، وَثَمَنِ الْكَلْبِ، وَآكِلِ الرِّبَا وَمُوكِلِهِ، وَالْوَاشِمَةِ وَالْمُسْتَوْشِمَةِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Sulaiman bin Harb, telah menceritakan kepada kami Syu’bah, daripada Aun bin Abi Juhaifah, dia berkata: Aku telah melihat bapaku, lalu dia berkata: Sesungguhnya Nabi SAW telah melarang daripada mengambil harga darah, dan harga anjing, dan orang yang memakan riba dan yang memberi riba, dan perempuan yang membuat tatu dan perempuan yang membuat dirinya ditatu."
  },
  {
    "id": 5718,
    "hadith_number": 5718,
    "tajuk_hadith": "Larangan Mencucuk dan Mencucukkan Tatu",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "A woman who used to practise tattooing was brought to `Umar. `Umar got up and said, \"I beseech you \nby Allah, which of you heard the Prophet (ﷺ) saying something about tattooing?\" l got up and said, \"0 \nchief of the Believers! l heard something.\" He said, \"What did you hear?\" I said, \"I heard the \nProphet (addressing the ladies), saying, 'Do not practise tattooing and do not get yourselves tattooed.'\"",
    "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عُمَارَةَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أُتِيَ عُمَرُ بِامْرَأَةٍ تَشِمُ فَقَامَ فَقَالَ أَنْشُدُكُمْ بِاللَّهِ مَنْ سَمِعَ مِنَ النَّبِيِّ صلى الله عليه وسلم فِي الْوَشْمِ فَقَالَ أَبُو هُرَيْرَةَ فَقُمْتُ فَقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ أَنَا سَمِعْتُ‏.‏ قَالَ مَا سَمِعْتَ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ تَشِمْنَ وَلاَ تَسْتَوْشِمْنَ ‏\"‏‏.‏",
    "malay_translation": "Seorang wanita yang biasa melakukan seni menatu dibawa menghadap Umar. Umar bangun dan berkata, \"Aku bersumpah demi Allah, siapakah di antara kamu yang mendengar Rasulullah SAW bersabda tentang menatu?\" Lalu aku bangun dan berkata, \"Wahai Amirul Mukminin, aku mendengarnya.\"  Beliau bertanya, \"Apakah yang engkau dengar?\" Aku menjawab, \"Aku mendengar Rasulullah SAW bersabda (kepada kaum wanita), 'Janganlah kamu menatu dan janganlah kamu minta ditatu.'\""
  },
  {
    "id": 5719,
    "hadith_number": 5719,
    "tajuk_hadith": "Larangan Nabi SAW terhadap Wanita yang Memanjangkan Rambut dan Bertatu",
    "perawi_melayu": "Riwayat Ibn Umar:",
    "english_text": "The Prophet (ﷺ) has cursed the lady who lengthens hair artificially and that who gets her hair lengthened \nin such away, and the lady who practises tattooing and that who gets it done for herself.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، قَالَ لَعَنَ النَّبِيُّ صلى الله عليه وسلم الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ، وَالْوَاشِمَةَ وَالْمُسْتَوْشِمَةَ‏.‏",
    "malay_translation": "Rasulullah SAW melaknat wanita yang memanjangkan rambut secara buatan dan wanita yang menyuruh memanjangkan rambutnya, serta wanita yang membuat tatu dan wanita yang meminta orang lain membuat tatu untuknya."
  },
  {
    "id": 5720,
    "hadith_number": 5720,
    "tajuk_hadith": "Laknat Allah ke atas Wanita yang Mencucuk, Mencukur, dan Mengubah Ciptaan Allah",
    "perawi_melayu": "Riwayat Abdullah",
    "english_text": "Allah has cursed those women who practise tattooing and those who get it done for themselves, and \nthose who remove hair from their faces, and those who artificially create spaces between their teeth to \nlook beautiful, such women as alter the features created by Allah. Why should I not then curse those \nwhom Allah's Messenger (ﷺ) has cursed and that is in Allah's Book?",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ لَعَنَ اللَّهُ الْوَاشِمَاتِ وَالْمُسْتَوْشِمَاتِ، وَالْمُتَنَمِّصَاتِ وَالْمُتَفَلِّجَاتِ لِلْحُسْنِ، الْمُغَيِّرَاتِ خَلْقَ اللَّهِ‏.‏ مَا لِي لاَ أَلْعَنُ مَنْ لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهْوَ فِي كِتَابِ اللَّهِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin al-Mutsanna, telah menceritakan kepada kami Abdurrahman, dari Sufyan, dari Manshur, dari Ibrahim, dari Alqamah, dari Abdullah - semoga Allah meridhainya - Allah melaknat perempuan-perempuan yang menindik, yang meminta ditindik, yang mencabut bulu hidung dan yang menjarangkan gigi demi kecantikan, iaitu mereka yang mengubah ciptaan Allah. Mengapa aku tidak melaknat mereka yang telah dilaknat oleh Rasulullah ﷺ, sedangkan ia terdapat dalam Kitabullah."
  },
  {
    "id": 5721,
    "hadith_number": 5721,
    "tajuk_hadith": "Malaikat Tidak Masuk Rumah yang Ada Anjing atau Gambar",
    "perawi_melayu": "Daripada Abu Talhah",
    "english_text": "The Prophet (ﷺ) said, \"Angels do not enter a house in which there is a dog or there are pictures.\"",
    "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنْ أَبِي طَلْحَةَ ـ رضى الله عنهم ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ تَدْخُلُ الْمَلاَئِكَةُ بَيْتًا فِيهِ كَلْبٌ وَلاَ تَصَاوِيرُ ‏\"‏‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُبَيْدُ اللَّهِ، سَمِعَ ابْنَ عَبَّاسٍ، سَمِعْتُ أَبَا طَلْحَةَ، سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Malaikat tidak akan masuk ke dalam rumah yang terdapat anjing atau gambar.\""
  },
  {
    "id": 5722,
    "hadith_number": 5722,
    "tajuk_hadith": "Azab Berat Bagi Mereka Yang Membuat Gambar",
    "perawi_melayu": "Riwayat Muslim:",
    "english_text": "We were with Masruq at the house of Yasar bin Numair. Masruq saw pictures on his terrace and said, \n\"I heard `Abdullah saying that he heard the Prophet (ﷺ) saying, \"The people who will receive the severest \npunishment from Allah will be the picture makers.'\"",
    "arabic_text": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الأَعْمَشُ، عَنْ مُسْلِمٍ، قَالَ كُنَّا مَعَ مَسْرُوقٍ فِي دَارِ يَسَارِ بْنِ نُمَيْرٍ، فَرَأَى فِي صُفَّتِهِ تَمَاثِيلَ فَقَالَ سَمِعْتُ عَبْدَ اللَّهِ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ أَشَدَّ النَّاسِ عَذَابًا عِنْدَ اللَّهِ يَوْمَ الْقِيَامَةِ الْمُصَوِّرُونَ ‏\"‏‏.‏",
    "malay_translation": "Kami bersama Masruq di rumah Yasar bin Numair. Masruq melihat gambar di serambinya dan berkata, \"Saya mendengar Abdullah berkata bahawa dia mendengar Nabi ﷺ bersabda, \"Sesungguhnya orang yang paling berat azabnya di sisi Allah pada hari kiamat ialah mereka yang membuat gambar.\""
  },
  {
    "id": 5723,
    "hadith_number": 5723,
    "tajuk_hadith": "Azab Bagi Mereka Yang Mencipta Gambar",
    "perawi_melayu": "Riwayat Abdullah bin Umar",
    "english_text": "Allah's Messenger (ﷺ) said, \"Those who make these pictures will be punished on the Day of Resurrection, \nand it will be said to them. 'Make alive what you have created.'\"",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الَّذِينَ يَصْنَعُونَ هَذِهِ الصُّوَرَ يُعَذَّبُونَ يَوْمَ الْقِيَامَةِ يُقَالُ لَهُمْ أَحْيُوا مَا خَلَقْتُمْ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Sesungguhnya orang-orang yang membuat gambar-gambar ini akan diazab pada hari kiamat. Mereka akan disuruh: Hidupkanlah apa yang kamu telah ciptakan.\""
  },
  {
    "id": 5724,
    "hadith_number": 5724,
    "tajuk_hadith": "Larangan Rasulullah SAW terhadap Arca dan Salib di Rumah",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "I never used to leave in the Prophet (ﷺ) house anything carrying images or crosses but he obliterated it.",
    "arabic_text": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ عِمْرَانَ بْنِ حِطَّانَ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ حَدَّثَتْهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم لَمْ يَكُنْ يَتْرُكُ فِي بَيْتِهِ شَيْئًا فِيهِ تَصَالِيبُ إِلاَّ نَقَضَهُ‏.‏",
    "malay_translation": "Aisyah r.a. telah meriwayatkan bahawa Rasulullah SAW tidak pernah membiarkan apa-apa yang mengandungi gambar atau salib di rumahnya, melainkan baginda akan memusnahkannya."
  },
  {
    "id": 5725,
    "hadith_number": 5725,
    "tajuk_hadith": "Mencipta Seperti Ciptaan Allah dan Batasan Wuduk",
    "perawi_melayu": "Riwayat Abu Zur'a:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُوسَى، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا عُمَارَةُ، حَدَّثَنَا أَبُو زُرْعَةَ، قَالَ دَخَلْتُ مَعَ أَبِي هُرَيْرَةَ دَارًا بِالْمَدِينَةِ فَرَأَى أَعْلاَهَا مُصَوِّرًا يُصَوِّرُ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ وَمَنْ أَظْلَمُ مِمَّنْ ذَهَبَ يَخْلُقُ كَخَلْقِي، فَلْيَخْلُقُوا حَبَّةً، وَلْيَخْلُقُوا ذَرَّةً ‏\"‏‏.‏ ثُمَّ دَعَا بِتَوْرٍ مِنْ مَاءٍ فَغَسَلَ يَدَيْهِ حَتَّى بَلَغَ إِبْطَهُ فَقُلْتُ يَا أَبَا هُرَيْرَةَ أَشَىْءٌ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ مُنْتَهَى الْحِلْيَةِ‏.‏",
    "malay_translation": "Kami telah diberitakan oleh Musa, yang telah diberitakan kepadanya oleh Abdul Wahid, yang telah diberitakan kepadanya oleh Umarah, yang telah diberitakan kepadanya oleh Abu Zur'ah, bahawa dia berkata: Aku masuk bersama Abu Hurairah ke sebuah rumah di Madinah, lalu dia melihat di bahagian atas rumah itu seorang pelukis sedang melukis. Dia berkata: Aku mendengar Rasulullah SAW bersabda:  \"Siapakah yang lebih zalim daripada orang yang cuba mencipta seperti ciptaan-Ku? Biarlah mereka mencipta sebutir bijian, dan biarlah mereka mencipta seekor nyamuk.\" Kemudian dia meminta bekas berisi air lalu membasuh kedua-dua tangannya sehingga ke ketiak. Maka aku berkata: Wahai Abu Hurairah, adakah ini sesuatu yang engkau dengar daripada Rasulullah SAW? Dia berkata: Ini adalah batasan untuk perhiasan."
  },
  {
    "id": 5726,
    "hadith_number": 5726,
    "tajuk_hadith": "Larangan Menyerupai Ciptaan Allah",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ ـ وَمَا بِالْمَدِينَةِ يَوْمَئِذٍ أَفْضَلُ مِنْهُ ـ قَالَ سَمِعْتُ أَبِي قَالَ سَمِعْتُ عَائِشَةَ ـ رضى الله عنها ـ قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ سَفَرٍ وَقَدْ سَتَرْتُ بِقِرَامٍ لِي عَلَى سَهْوَةٍ لِي فِيهَا تَمَاثِيلُ، فَلَمَّا رَآهُ رَسُولُ اللَّهِ صلى الله عليه وسلم هَتَكَهُ وَقَالَ ‏\n\"‏ أَشَدُّ النَّاسِ عَذَابًا يَوْمَ الْقِيَامَةِ الَّذِينَ يُضَاهُونَ بِخَلْقِ اللَّهِ ‏\"‏‏.‏ قَالَتْ فَجَعَلْنَاهُ وِسَادَةً أَوْ وِسَادَتَيْنِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ali bin Abdullah, telah menceritakan kepada kami Sufyan, dia berkata; aku mendengar Abdul Rahman bin Al-Qasim - dan pada hari itu tiada yang lebih baik di Madinah daripada dia - berkata; aku mendengar ayahku berkata; aku mendengar Aisyah - radiallahu 'anha - berkata; Rasulullah SAW pulang dari perjalanan, dan aku telah menutupi sebuah ruangku dengan kain yang bergambar.  Apabila Rasulullah SAW melihatnya, baginda mencabiknya dan bersabda:  \"Orang yang paling berat azabnya pada hari kiamat ialah mereka yang menyamai ciptaan Allah.\"  Dia (Aisyah) berkata: maka kami jadikannya sebagai bantal atau dua bantal."
  },
  {
    "id": 5727,
    "hadith_number": 5727,
    "tajuk_hadith": "Larangan Memajang Gambar",
    "perawi_melayu": "Riwayat Aisyah:",
    "english_text": "The Prophet (ﷺ) returned from a journey when I had hung a thick curtain having pictures (in front of a \ndoor). He ordered me to remove it and I removed it.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ قَدِمَ النَّبِيُّ صلى الله عليه وسلم مِنْ سَفَرٍ، وَعَلَّقْتُ دُرْنُوكًا فِيهِ تَمَاثِيلُ، فَأَمَرَنِي أَنْ أَنْزِعَهُ، فَنَزَعْتُهُ‏.‏",
    "malay_translation": "Rasulullah SAW pulang dari perjalanan. Ketika itu, aku telah menggantung langsir tebal yang bergambar di hadapan pintu. Baginda menyuruhku menurunkannya, lalu aku menurunkannya."
  },
  {
    "id": 5728,
    "hadith_number": 5728,
    "tajuk_hadith": "Bersama Rasulullah SAW Menggunakan Satu Bekas Air untuk Mandi",
    "perawi_melayu": "Aisyah menambah:",
    "english_text": "The Prophet (ﷺ) and I used to take a \nbath from one container (of water).",
    "arabic_text": "وَكُنْتُ أَغْتَسِلُ أَنَا وَالنَّبِيُّ، صلى الله عليه وسلم مِنْ إِنَاءٍ وَاحِدٍ‏.‏",
    "malay_translation": "Aku dan Nabi SAW pernah menggunakan satu bekas air untuk mandi."
  },
  {
    "id": 5729,
    "hadith_number": 5729,
    "tajuk_hadith": "Larangan Gambar dalam Rumah",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا اشْتَرَتْ نُمْرُقَةً فِيهَا تَصَاوِيرُ، فَقَامَ النَّبِيُّ صلى الله عليه وسلم بِالْبَابِ فَلَمْ يَدْخُلْ‏.‏ فَقُلْتُ أَتُوبُ إِلَى اللَّهِ مِمَّا أَذْنَبْتُ‏.‏ قَالَ ‏\"‏ مَا هَذِهِ النُّمْرُقَةُ ‏\"‏‏.‏ قُلْتُ لِتَجْلِسَ عَلَيْهَا وَتَوَسَّدَهَا‏.‏ قَالَ ‏\"‏ إِنَّ أَصْحَابَ هَذِهِ الصُّوَرِ يُعَذَّبُونَ يَوْمَ الْقِيَامَةِ، يُقَالُ لَهُمْ أَحْيُوا مَا خَلَقْتُمْ‏.‏ وَإِنَّ الْمَلاَئِكَةَ لاَ تَدْخُلُ بَيْتًا فِيهِ الصُّورَةُ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Hajjaj bin Minhal, telah menceritakan kepada kami Juwairiah, daripada Nafi', daripada al-Qasim, daripada Aisyah - radiallahu 'anha - bahawa dia telah membeli sebuah alas duduk yang mempunyai gambar di atasnya. Maka Nabi sallallahu 'alaihi wasallam berdiri di pintu tetapi tidak masuk.  Maka aku berkata, \"Aku bertaubat kepada Allah daripada apa yang telah aku lakukan.\" Baginda berkata, \"Apakah alas duduk ini?\" Aku berkata, \"Untuk baginda duduk dan bersandar.\" Baginda berkata, \"Sesungguhnya pemilik gambar-gambar ini akan diseksa pada hari kiamat, dan akan dikatakan kepada mereka, 'Hidupkan apa yang kamu telah ciptakan.' Dan sesungguhnya malaikat tidak akan masuk ke rumah yang terdapat gambar di dalamnya.\""
  },
  {
    "id": 5730,
    "hadith_number": 5730,
    "tajuk_hadith": "Malaikat Tidak Masuk Rumah Yang Ada Gambar",
    "perawi_melayu": "Abu Talhah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ بُكَيْرٍ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ زَيْدِ بْنِ خَالِدٍ، عَنْ أَبِي طَلْحَةَ، صَاحِبِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الْمَلاَئِكَةَ لاَ تَدْخُلُ بَيْتًا فِيهِ الصُّورَةُ ‏\"‏‏.‏ قَالَ بُسْرٌ ثُمَّ اشْتَكَى زَيْدٌ فَعُدْنَاهُ، فَإِذَا عَلَى بَابِهِ سِتْرٌ فِيهِ صُورَةٌ فَقُلْتُ لِعُبَيْدِ اللَّهِ رَبِيبِ مَيْمُونَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَلَمْ يُخْبِرْنَا زَيْدٌ عَنِ الصُّوَرِ يَوْمَ الأَوَّلِ‏.‏ فَقَالَ عُبَيْدُ اللَّهِ أَلَمْ تَسْمَعْهُ حِينَ قَالَ إِلاَّ رَقْمًا فِي ثَوْبٍ‏.‏ وَقَالَ ابْنُ وَهْبٍ أَخْبَرَنَا عَمْرٌو ـ هُوَ ابْنُ الْحَارِثِ ـ حَدَّثَهُ بُكَيْرٌ، حَدَّثَهُ بُسْرٌ، حَدَّثَهُ زَيْدٌ، حَدَّثَهُ أَبُو طَلْحَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qotaibah, telah menceritakan kepada kami Laits, dari Bukhair, dari Busr bin Sa’id, dari Zaid bin Khalid, dari Abu Thalhah, sahabat Rasulullah SAW, bahawa Rasulullah SAW bersabda:  \"Sesungguhnya malaikat tidak memasuki rumah yang ada gambar di dalamnya.\" Busr berkata: Kemudian Zaid sakit lalu kami melawatnya, maka kelihatan di pintu rumahnya ada langsir yang mempunyai gambar. Maka aku berkata kepada Ubaidillah, anak angkat Maimunah isteri Nabi SAW: Bukankah Zaid memberitahu kita tentang gambar tempoh hari?  Maka Ubaidillah berkata: Bukankah kamu mendengarnya ketika dia berkata: Kecuali corak pada kain?"
  },
  {
    "id": 5731,
    "hadith_number": 5731,
    "tajuk_hadith": "Larangan Gambar dalam Rumah",
    "perawi_melayu": "Riwayat Anas:",
    "english_text": "Aisha had a thick curtain (having pictures on it) and she screened the side of her house with it. \nThe Prophet (ﷺ) said to her, \"Remove it from my sight, for its pictures are still coming to my mind in \nmy prayers.\"",
    "arabic_text": "حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كَانَ قِرَاَمٌ لِعَائِشَةَ سَتَرَتْ بِهِ جَانِبَ بَيْتِهَا، فَقَالَ لَهَا النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ أَمِيطِي عَنِّي، فَإِنَّهُ لاَ تَزَالُ تَصَاوِيرُهُ تَعْرِضُ لِي فِي صَلاَتِي ‏\"‏‏.‏",
    "malay_translation": "Anas r.a. meriwayatkan bahawa Aisyah mempunyai langsir tebal yang bergambar dan beliau menggunakannya untuk menutupi sebahagian rumahnya.  Nabi SAW bersabda kepadanya, \"Singkirkanlah ia dari pandangan ku, kerana gambar-gambar itu sentiasa mengganggu fikiran ku ketika solat.\""
  },
  {
    "id": 5732,
    "hadith_number": 5732,
    "tajuk_hadith": "Kehadiran Jibril dan Larangan Gambar dan Anjing",
    "perawi_melayu": "Daripada bapa Salim:",
    "english_text": "Once Gabriel promised to visit the Prophet (ﷺ) but he delayed and the Prophet (ﷺ) got worried about that. At \nlast he came out and found Gabriel and complained to him of his grief (for his delay). Gabriel said to \nhim, \"We do not enter a place in which there is a picture or a dog.\"",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ حَدَّثَنِي عُمَرُ ـ هُوَ ابْنُ مُحَمَّدٍ ـ عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ وَعَدَ النَّبِيَّ صلى الله عليه وسلم جِبْرِيلُ فَرَاثَ عَلَيْهِ حَتَّى اشْتَدَّ عَلَى النَّبِيِّ صلى الله عليه وسلم فَخَرَجَ النَّبِيُّ صلى الله عليه وسلم فَلَقِيَهُ، فَشَكَا إِلَيْهِ مَا وَجَدَ، فَقَالَ لَهُ ‏\n\"‏ إِنَّا لاَ نَدْخُلُ بَيْتًا فِيهِ صُورَةٌ وَلاَ كَلْبٌ ‏\"‏‏.‏",
    "malay_translation": "Jibril telah berjanji untuk melawat Nabi SAW, tetapi beliau telah lewat sehingga Nabi SAW merasa bimbang. Akhirnya, Nabi SAW keluar dan bertemu Jibril, lalu mengadu kepadanya tentang kebimbangannya. Jibril berkata kepada Baginda, \"Sesungguhnya kami tidak memasuki rumah yang terdapat gambar atau anjing di dalamnya.\""
  },
  {
    "id": 5733,
    "hadith_number": 5733,
    "tajuk_hadith": "Larangan Gambar Lukisan",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا أَخْبَرَتْهُ أَنَّهَا اشْتَرَتْ نُمْرُقَةً فِيهَا تَصَاوِيرُ، فَلَمَّا رَآهَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَامَ عَلَى الْبَابِ فَلَمْ يَدْخُلْ، فَعَرَفَتْ فِي وَجْهِهِ الْكَرَاهِيَةَ قَالَتْ يَا رَسُولَ اللَّهِ أَتُوبُ إِلَى اللَّهِ وَإِلَى رَسُولِهِ، مَاذَا أَذْنَبْتُ قَالَ ‏\"‏ مَا بَالُ هَذِهِ النُّمْرُقَةِ ‏\"‏‏.‏ فَقَالَتِ اشْتَرَيْتُهَا لِتَقْعُدَ عَلَيْهَا وَتَوَسَّدَهَا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ أَصْحَابَ هَذِهِ الصُّوَرِ يُعَذَّبُونَ يَوْمَ الْقِيَامَةِ، وَيُقَالُ لَهُمْ أَحْيُوا مَا خَلَقْتُمْ ـ وَقَالَ ـ إِنَّ الْبَيْتَ الَّذِي فِيهِ الصُّوَرُ لاَ تَدْخُلُهُ الْمَلاَئِكَةُ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Maslamah, dari Malik, dari Nafi', dari Qasim bin Muhammad, dari Aisyah - ra - isteri Nabi SAW bahawa beliau memberitahu bahawa beliau telah membeli sebuah kusyen yang mempunyai gambar-gambar di atasnya.  Maka apabila Rasulullah SAW melihatnya, baginda berdiri di pintu dan tidak masuk.  Aisyah menyedari rasa tidak senang di wajah baginda.  Beliau berkata, \"Wahai Rasulullah, saya bertaubat kepada Allah dan Rasul-Nya. Apakah dosa yang telah saya lakukan?\" Baginda berkata, \"Apakah perihal kusyen ini?\"  Aisyah menjawab, \"Saya membelinya untuk baginda duduk dan bersandar.\"  Rasulullah SAW bersabda, \"Sesungguhnya orang-orang yang membuat gambar-gambar ini akan diseksa pada hari kiamat, dan akan dikatakan kepada mereka, 'Hidupkanlah apa yang kamu ciptakan.'\" Baginda menambah, \"Sesungguhnya rumah yang mempunyai gambar-gambar, malaikat tidak akan memasukinya.\""
  },
  {
    "id": 5734,
    "hadith_number": 5734,
    "tajuk_hadith": "Larangan Rasulullah SAW terhadap beberapa perkara",
    "perawi_melayu": "Riwayat Abu Juhaifa:",
    "english_text": "that he had bought a slave whose profession was cupping. The Prophet (ﷺ) forbade taking the price of \nblood and the price of a dog and the earnings of a prostitute, and cursed the one who took or gave \n(Riba') usury, and the lady who tattooed others or got herself tattooed, and the picture-maker.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنِي غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ، عَنْ أَبِيهِ، أَنَّهُ اشْتَرَى غُلاَمًا حَجَّامًا فَقَالَ إِنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ ثَمَنِ الدَّمِ، وَثَمَنِ الْكَلْبِ، وَكَسْبِ الْبَغِيِّ، وَلَعَنَ آكِلَ الرِّبَا وَمُوكِلَهُ وَالْوَاشِمَةَ وَالْمُسْتَوْشِمَةَ وَالْمُصَوِّرَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin al-Muthanna, katanya telah menceritakan kepadaku Ghandar, telah menceritakan kepada kami Syu'bah, daripada Aun bin Abi Juhaifa, daripada bapanya, bahawa dia telah membeli seorang hamba lelaki yang berkerja sebagai tukang bekam. Maka Baginda Rasulullah SAW telah melarang mengambil harga darah, harga anjing, dan pendapatan pelacur, dan Baginda melaknat orang yang memakan riba dan yang memberi riba, dan perempuan yang membuat tatu dan yang ditatu, dan juga pelukis."
  },
  {
    "id": 5735,
    "hadith_number": 5735,
    "tajuk_hadith": "Tanggungjawab Mencipta Gambar pada Hari Kiamat",
    "perawi_melayu": "Riwayat Ibnu Abbas:",
    "english_text": "I heard Muhammad saying, \"Whoever makes a picture in this world will be asked to put life into it on \nthe Day of Resurrection, but he will not be able to do so.\"",
    "arabic_text": "حَدَّثَنَا عَيَّاشُ بْنُ الْوَلِيدِ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدٌ، قَالَ سَمِعْتُ النَّضْرَ بْنَ أَنَسِ بْنِ مَالِكٍ، يُحَدِّثُ قَتَادَةَ قَالَ كُنْتُ عِنْدَ ابْنِ عَبَّاسٍ وَهُمْ يَسْأَلُونَهُ وَلاَ يَذْكُرُ النَّبِيَّ صلى الله عليه وسلم حَتَّى سُئِلَ فَقَالَ سَمِعْتُ مُحَمَّدًا صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ صَوَّرَ صُورَةً فِي الدُّنْيَا كُلِّفَ يَوْمَ الْقِيَامَةِ أَنْ يَنْفُخَ فِيهَا الرُّوحَ، وَلَيْسَ بِنَافِخٍ ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Rasulullah Muhammad SAW bersabda,  \"Barangsiapa yang melukis gambar di dunia, maka dia akan dibebankan pada hari kiamat untuk meniupkan roh ke dalamnya, dan dia tidak akan mampu melakukannya.\""
  },
  {
    "id": 5736,
    "hadith_number": 5736,
    "tajuk_hadith": "Rasulullah SAW Menunggang Keldai Dengan Usama di Belakang",
    "perawi_melayu": "Daripada Usamah bin Zaid:",
    "english_text": "Allah's Messenger (ﷺ) rode a donkey saddled with a saddle covered with a Fadakiyya velvet sheet, and he \nmade me ride behind him.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو صَفْوَانَ، عَنْ يُونُسَ بْنِ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَكِبَ عَلَى حِمَارٍ، عَلَى إِكَافٍ عَلَيْهِ قَطِيفَةٌ فَدَكِيَّةٌ، وَأَرْدَفَ أُسَامَةَ وَرَاءَهُ‏.‏",
    "malay_translation": "Rasulullah SAW menunggang seekor keldai yang berpelana, dan pelana itu dibaluti dengan kain baldu Fadakiyyah. Baginda membawa Usamah di belakang baginda."
  },
  {
    "id": 5737,
    "hadith_number": 5737,
    "tajuk_hadith": "Ketibaan Nabi SAW di Mekah dan Sambutan Bani Abdul Muttalib",
    "perawi_melayu": "Riwayat Ibnu Abbas:",
    "english_text": "When the Prophet (ﷺ) arrived at Mecca, the children of Bani `Abdul Muttalib received him. He then \nmounted one of them in front of him and the other behind him.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا قَدِمَ النَّبِيُّ صلى الله عليه وسلم مَكَّةَ اسْتَقْبَلَهُ أُغَيْلِمَةُ بَنِي عَبْدِ الْمُطَّلِبِ، فَحَمَلَ وَاحِدًا بَيْنَ يَدَيْهِ وَالآخَرَ خَلْفَهُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Musaddad, telah menceritakan kepada kami Yazid bin Zurai’, telah menceritakan kepada kami Khalid, daripada ‘Ikrimah, daripada Ibnu Abbas r.a., bahawa baginda Nabi SAW ketika tiba di Mekah telah disambut oleh sekumpulan anak-anak Bani Abdul Muttalib. Baginda kemudiannya menaikkan seorang daripada mereka di hadapan baginda dan seorang lagi di belakang baginda."
  },
  {
    "id": 5738,
    "hadith_number": 5738,
    "tajuk_hadith": "Ketiga Penunggang Seekor Haiwan",
    "perawi_melayu": "Riwayat Aiyub:",
    "english_text": "The worst of three (persons riding one, animal) was mentioned in `Ikrima's presence `Ikrima said, \n\"Ibn `Abbas said, '(In the year of the conquest of Mecca) the Prophet (ﷺ) came and mounted Qutham \nin front of him and Al-Fadl behind him, or Qutham behind him and Al-Fadl in front of him.' Now \nwhich of them was the worst off and which was the best?\"",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا أَيُّوبُ، ذُكِرَ الأَشَرُّ الثَّلاَثَةُ عِنْدَ عِكْرِمَةَ فَقَالَ قَالَ ابْنُ عَبَّاسٍ أَتَى رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَدْ حَمَلَ قُثَمَ بَيْنَ يَدَيْهِ، وَالْفَضْلَ خَلْفَهُ، أَوْ قُثَمَ خَلْفَهُ، وَالْفَضْلَ بَيْنَ يَدَيْهِ، فَأَيُّهُمْ شَرٌّ أَوْ أَيُّهُمْ خَيْرٌ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Muhammad bin Bashar, telah menceritakan kepada kami Abd al-Wahhab, telah menceritakan kepada kami Aiyub,  disebutkan tentang keadaan yang paling buruk daripada tiga orang (yang menunggang seekor haiwan) di hadapan Ikrimah. Maka beliau berkata: Ibn Abbas berkata:  'Pada tahun penaklukan Mekah, Nabi ﷺ datang dan telah menunggang Qutham di hadapan Baginda, dan al-Fadl di belakang Baginda, atau Qutham di belakang Baginda dan al-Fadl di hadapan Baginda.' Maka siapakah di antara mereka yang paling buruk keadaannya dan siapakah yang paling baik keadaannya."
  },
  {
    "id": 5739,
    "hadith_number": 5739,
    "tajuk_hadith": "Hak Allah dan Hak Hamba",
    "perawi_melayu": "Riwayat Mu'adz bin Jabal:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، عَنْ مُعَاذِ بْنِ جَبَلٍ ـ رضى الله عنه ـ قَالَ بَيْنَا أَنَا رَدِيفُ النَّبِيِّ، صلى الله عليه وسلم لَيْسَ بَيْنِي وَبَيْنَهُ إِلاَّ أَخِرَةُ الرَّحْلِ فَقَالَ ‏\"‏ يَا مُعَاذُ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ رَسُولَ اللَّهِ وَسَعْدَيْكَ‏.‏ ثُمَّ سَارَ سَاعَةً ثُمَّ قَالَ ‏\"‏ يَا مُعَاذُ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ رَسُولَ اللَّهِ وَسَعْدَيْكَ‏.‏ ثُمَّ سَارَ سَاعَةً ثُمَّ قَالَ ‏\"‏ يَا مُعَاذُ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ رَسُولَ اللَّهِ وَسَعْدَيْكَ‏.‏ قَالَ ‏\"‏ هَلْ تَدْرِي مَا حَقُّ اللَّهِ عَلَى عِبَادِهِ ‏\"‏‏.‏ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ حَقُّ اللَّهِ عَلَى عِبَادِهِ أَنْ يَعْبُدُوهُ وَلاَ يُشْرِكُوا بِهِ شَيْئًا ‏\"‏‏.‏ ثُمَّ سَارَ سَاعَةً ثُمَّ قَالَ ‏\"‏ يَا مُعَاذُ بْنَ جَبَلٍ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ رَسُولَ اللَّهِ وَسَعْدَيْكَ‏.‏ فَقَالَ ‏\"‏ هَلْ تَدْرِي مَا حَقُّ الْعِبَادِ عَلَى اللَّهِ إِذَا فَعَلُوهُ ‏\"‏‏.‏ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ حَقُّ الْعِبَادِ عَلَى اللَّهِ أَنْ لاَ يُعَذِّبَهُمْ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Hudbah bin Khalid, telah menceritakan kepada kami Hammam, telah menceritakan kepada kami Qatadah, telah menceritakan kepada kami Anas bin Malik, dari Mu'adz bin Jabal - semoga Allah meridhainya - berkata, \"Ketika aku sedang menunggang di belakang Nabi SAW, dan antara aku dan baginda hanya terdapat bahagian belakang pelana, Baginda bersabda: \"Wahai Mu'adz!\" Aku menjawab, \"Labbaik, wahai Rasulullah SAW, dan Sa'daik!\" Kemudian Baginda berjalan seketika, lalu bersabda: \"Wahai Mu'adz!\" Aku menjawab, \"Labbaik, wahai Rasulullah SAW, dan Sa'daik!\" Kemudian Baginda berjalan seketika, lalu bersabda: \"Wahai Mu'adz!\" Aku menjawab, \"Labbaik, wahai Rasulullah SAW, dan Sa'daik!\" Baginda bertanya: \"Tahukah engkau apakah hak Allah ke atas hamba-hambaNya?\" Aku menjawab, \"Allah dan Rasul-Nya lebih mengetahui.\" Baginda bersabda: \"Hak Allah ke atas hamba-hambaNya ialah supaya mereka menyembahNya sahaja dan tidak menyekutukanNya dengan sesuatu pun.\" Kemudian Baginda berjalan seketika, lalu bersabda: \"Wahai Mu'adz bin Jabal!\" Aku menjawab, \"Labbaik, wahai Rasulullah SAW, dan Sa'daik!\" Baginda bertanya: \"Tahukah engkau apakah hak hamba-hamba ke atas Allah apabila mereka melakukan perkara itu?\" Aku menjawab, \"Allah dan Rasul-Nya lebih mengetahui.\" Baginda bersabda: \"Hak hamba-hamba ke atas Allah ialah Allah tidak akan menyeksa mereka.\""
  },
  {
    "id": 5740,
    "hadith_number": 5740,
    "tajuk_hadith": "Kepulangan Rasulullah SAW dari Khaibar dan Doa Baginda",
    "perawi_melayu": "Anas bin Malik meriwayatkan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدِ بْنِ صَبَّاحٍ، حَدَّثَنَا يَحْيَى بْنُ عَبَّادٍ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنِي يَحْيَى بْنُ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ قَالَ أَقْبَلْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ خَيْبَرَ، وَإِنِّي لَرَدِيفُ أَبِي طَلْحَةَ وَهْوَ يَسِيرُ وَبَعْضُ نِسَاءِ رَسُولِ اللَّهِ صلى الله عليه وسلم رَدِيفُ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ عَثَرَتِ النَّاقَةُ فَقُلْتُ الْمَرْأَةَ‏.‏ فَنَزَلْتُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّهَا أُمُّكُمْ ‏\"‏‏.‏ فَشَدَدْتُ الرَّحْلَ وَرَكِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمَّا دَنَا أَوْ رَأَى الْمَدِينَةَ قَالَ ‏\"‏ آيِبُونَ تَائِبُونَ، عَابِدُونَ لِرَبِّنَا، حَامِدُونَ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Al-Hasan bin Muhammad bin Sabbah, telah menceritakan kepada kami Yahya bin Abbad, telah menceritakan kepada kami Syu'bah, telah memberitakan kepadaku Yahya bin Abi Ishaq, dia berkata; aku mendengar Anas bin Malik r.a berkata, \"Kami pulang bersama Rasulullah SAW dari Khaibar, dan aku sedang menunggang di belakang Abu Talhah ketika dia berjalan kaki, dan salah seorang isteri Rasulullah SAW menunggang di belakang Rasulullah SAW. Tiba-tiba unta itu tersandung, maka aku berkata, \"Wanita itu!\" lalu aku turun. Maka Rasulullah SAW bersabda, \"Sesungguhnya dia adalah ibumu.\" Lalu aku mengikat kembali pelana, dan Rasulullah SAW naik. Kemudian apabila Baginda hampir atau melihat Madinah, Baginda bersabda, \"Kami kembali bertaubat, beribadah kepada Tuhan kami, dan bertasbih.\" "
  },
  {
    "id": 5741,
    "hadith_number": 5741,
    "tajuk_hadith": "Nabi SAW Berbaring di Masjid",
    "perawi_melayu": "Daripada bapa saudara `Abbad bin Tamim:",
    "english_text": "I saw the Prophet (ﷺ) lying-down in the mosque and placing one leg on the other.",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَمِّهِ، أَنَّهُ أَبْصَرَ النَّبِيَّ صلى الله عليه وسلم يَضْطَجِعُ فِي الْمَسْجِدِ، رَافِعًا إِحْدَى رِجْلَيْهِ عَلَى الأُخْرَى‏.‏",
    "malay_translation": "Aku melihat Nabi SAW berbaring di masjid, meletakkan sebelah kakinya di atas kaki yang satu lagi."
  }
]
