[
  {
    "id": 2626,
    "hadith_number": 2626,
    "tajuk_hadith": "Keharusan Menyediakan Wasiat bagi Muslim yang Mempunyai Harta",
    "perawi_melayu": "Dikisahkan oleh Abdullah bin Umar:",
    "english_text": "Rasulullah SAW bersabda, \"Tidak halal bagi seorang Muslim yang mempunyai harta untuk diwasiatkan, tinggal dua malam tanpa mewasiatkan dan menyimpan wasiatnya bersamanya.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا حَقُّ امْرِئٍ مُسْلِمٍ لَهُ شَىْءٌ، يُوصِي فِيهِ يَبِيتُ لَيْلَتَيْنِ، إِلاَّ وَوَصِيَّتُهُ مَكْتُوبَةٌ عِنْدَهُ ‏\"‏‏.‏ تَابَعَهُ مُحَمَّدُ بْنُ مُسْلِمٍ عَنْ عَمْرٍو عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Baginda Rasulullah SAW bersabda, \"Tidak halal bagi seorang Muslim yang mempunyai harta untuk diwasiatkan, tinggal dua malam tanpa membuat wasiat dan menyimpan wasiat tersebut bersamanya.\"  "
  },
  {
    "id": 2627,
    "hadith_number": 2627,
    "tajuk_hadith": "Pewarisan Rasulullah SAW yang Sederhana",
    "perawi_melayu": "Dikisahkan oleh `Amr bin Al-Harith",
    "english_text": "(The brother of the wife of Allah's Messenger (ﷺ). Juwaira bint Al-Harith) When Allah's Messenger (ﷺ) died, he did \nnot leave any Dirham or Dinar (i.e. money), a slave or a slave woman or anything else except his \nwhite mule, his arms and a piece of land which he had given in charity .",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْحَارِثِ، حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ، حَدَّثَنَا زُهَيْرُ بْنُ مُعَاوِيَةَ الْجُعْفِيُّ، حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ عَمْرِو بْنِ الْحَارِثِ، خَتَنِ رَسُولِ اللَّهِ صلى الله عليه وسلم أَخِي جُوَيْرِيَةَ بِنْتِ الْحَارِثِ قَالَ مَا تَرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم عِنْدَ مَوْتِهِ دِرْهَمًا وَلاَ دِينَارًا وَلاَ عَبْدًا وَلاَ أَمَةً وَلاَ شَيْئًا، إِلاَّ بَغْلَتَهُ الْبَيْضَاءَ وَسِلاَحَهُ وَأَرْضًا جَعَلَهَا صَدَقَةً‏.‏",
    "malay_translation": "Daripada saudara isteri Rasulullah SAW, Juwaira binti Al-Harith, yang meriwayatkan:  Rasulullah SAW tidak meninggalkan sebarang dirham atau dinar (wang), hamba sahaya atau hamba perempuan, atau apa-apa pun kecuali tunggangan putihnya, persenjataannya dan sebidang tanah yang telah beliau wakafkan.  Ini mencerminkan kesederhanaan dan pengabdian Rasulullah SAW dalam hidupnya dan warisannya. "
  },
  {
    "id": 2628,
    "hadith_number": 2628,
    "tajuk_hadith": "wasiat Nabi SAW dengan Kalamullah",
    "perawi_melayu": "Dikisahkan oleh Talha bin Musarrif",
    "english_text": "I asked `Abdullah bin Abu `Aufa \"Did the Prophet (ﷺ) make a will?\" He replied, \"No,\" I asked him, \"How \nis it then that the making of a will has been enjoined on people, (or that they are ordered to make a \nwill)?\" He replied, \"The Prophet (ﷺ) bequeathed Allah's Book (i.e. Qur'an).",
    "arabic_text": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، حَدَّثَنَا مَالِكٌ، حَدَّثَنَا طَلْحَةُ بْنُ مُصَرِّفٍ، قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى ـ رضى الله عنهما ـ هَلْ كَانَ النَّبِيُّ صلى الله عليه وسلم أَوْصَى فَقَالَ لاَ‏.‏ فَقُلْتُ كَيْفَ كُتِبَ عَلَى النَّاسِ الْوَصِيَّةُ أَوْ أُمِرُوا بِالْوَصِيَّةِ قَالَ أَوْصَى بِكِتَابِ اللَّهِ‏.‏",
    "malay_translation": "Aku bertanya kepada `Abdullah bin Abu `Aufa, \"Adakah Nabi SAW membuat wasiat?\" Beliau menjawab, \"Tidak.\" Aku bertanya lagi, \"Lalu, mengapakah wasiat itu diperintahkan kepada manusia?\" Beliau menjawab, \"Nabi SAW mewasiatkan Kitab Allah (iaitu al-Quran).\""
  },
  {
    "id": 2629,
    "hadith_number": 2629,
    "tajuk_hadith": "Perihal Ketetapan Pewaris Nabi SAW dan Keadaan Wafatnya",
    "perawi_melayu": "Diceritakan oleh Al-Aswad:",
    "english_text": "In the presence of `Aisha some people mentioned that the Prophet (ﷺ) had appointed `Ali by will as his \nsuccessor. `Aisha said, \"When did he appoint him by will? Verily when he died he was resting against \nmy chest (or said: in my lap) and he asked for a wash-basin and then collapsed while in that state, and \nI could not even perceive that he had died, so when did he appoint him by will?\"",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ زُرَارَةَ، أَخْبَرَنَا إِسْمَاعِيلُ، عَنِ ابْنِ عَوْنٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، قَالَ ذَكَرُوا عِنْدَ عَائِشَةَ أَنَّ عَلِيًّا ـ رضى الله عنهما ـ كَانَ وَصِيًّا‏.‏ فَقَالَتْ مَتَى أَوْصَى إِلَيْهِ وَقَدْ كُنْتُ مُسْنِدَتَهُ إِلَى صَدْرِي ـ أَوْ قَالَتْ حَجْرِي ـ فَدَعَا بِالطَّسْتِ، فَلَقَدِ انْخَنَثَ فِي حَجْرِي، فَمَا شَعَرْتُ أَنَّهُ قَدْ مَاتَ، فَمَتَى أَوْصَى إِلَيْهِ",
    "malay_translation": "Di hadapan `Aisyah, ada segolongan orang yang menyebut bahawa Nabi SAW telah melantik `Ali sebagai pewarisnya melalui wasiat. `Aisyah berkata, \"Bilakah baginda melantiknya melalui wasiat? Sesungguhnya ketika baginda wafat, baginda bersandar di dadaku (atau katanya: di pangkuanku) dan meminta dulang. Kemudian, baginda rebah dalam keadaan demikian, dan aku tidak sedar bahawa baginda telah meninggal dunia. Jadi, bilakah baginda melantiknya melalui wasiat?\" "
  },
  {
    "id": 2630,
    "hadith_number": 2630,
    "tajuk_hadith": "Petunjuk Rasulullah SAW Mengenai Pewarisan dan Sedekah",
    "perawi_melayu": "Dikisahkan oleh Sa'd bin Abi Waqqas:",
    "english_text": "The Prophet (ﷺ) came visiting me while I was (sick) in Mecca, ('Amir the sub-narrator said, and he \ndisliked to die in the land, whence he had already migrated). He (i.e. the Prophet) said, \"May Allah \nbestow His Mercy on Ibn Afra (Sa`d bin Khaula).\" I said, \"O Allah's Messenger (ﷺ)! May I will all my \nproperty (in charity)?\" He said, \"No.\" I said, \"Then may I will half of it?\" He said, \"No\". I said, \"One \nthird?\" He said: \"Yes, one third, yet even one third is too much. It is better for you to leave your \ninheritors wealthy than to leave them poor begging others, and whatever you spend for Allah's sake \nwill be considered as a charitable deed even the handful of food you put in your wife's mouth. Allah \nmay lengthen your age so that some people may benefit by you, and some others be harmed by you.\" \nAt that time Sa`d had only one daughter.",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ ـ رضى الله عنه ـ قَالَ جَاءَ النَّبِيُّ صلى الله عليه وسلم يَعُودُنِي وَأَنَا بِمَكَّةَ، وَهْوَ يَكْرَهُ أَنْ يَمُوتَ بِالأَرْضِ الَّتِي هَاجَرَ مِنْهَا قَالَ ‏\"‏ يَرْحَمُ اللَّهُ ابْنَ عَفْرَاءَ ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ، أُوصِي بِمَالِي كُلِّهِ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ فَالشَّطْرُ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ الثُّلُثُ‏.‏ قَالَ ‏\"‏ فَالثُّلُثُ، وَالثُّلُثُ كَثِيرٌ، إِنَّكَ أَنْ تَدَعَ وَرَثَتَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَدَعَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ فِي أَيْدِيهِمْ، وَإِنَّكَ مَهْمَا أَنْفَقْتَ مِنْ نَفَقَةٍ فَإِنَّهَا صَدَقَةٌ، حَتَّى اللُّقْمَةُ الَّتِي تَرْفَعُهَا إِلَى فِي امْرَأَتِكَ، وَعَسَى اللَّهُ أَنْ يَرْفَعَكَ فَيَنْتَفِعَ بِكَ نَاسٌ وَيُضَرَّ بِكَ آخَرُونَ ‏\"‏‏.‏ وَلَمْ يَكُنْ لَهُ يَوْمَئِذٍ إِلاَّ ابْنَةٌ‏.‏",
    "malay_translation": "Rasulullah SAW pernah melawat saya ketika saya sakit di Mekah.  Baginda tidak menyukai kematian di tanah yang telah dihijrahinya.  Baginda bersabda, \"Semoga Allah merahmati Ibn Afra (Sa'd bin Khaula).\" Saya bertanya, \"Ya Rasulullah, bolehkah saya wasiatkan seluruh harta saya (untuk sedekah)?\" Baginda menjawab, \"Tidak.\"  Saya bertanya lagi, \"Bolehkah separuh harta?\" Baginda menjawab, \"Tidak.\" Saya bertanya, \"Sepertiga?\" Baginda menjawab, \"Ya, sepertinya. Namun, sepertinya itu pun terlalu banyak. Lebih baik engkau tinggalkan warismu dalam keadaan kaya daripada miskin meminta-minta kepada orang lain. Apa sahaja yang engkau belanjakan bagi Allah, ia adalah sedekah, bahkan sesuap makanan yang engkau berikan kepada isterimu juga dianggap sedekah. Semoga Allah memanjangkan umurmu supaya ada yang mendapat manfaat darimu, dan ada pula yang terjejas akibatmu.\" Pada masa itu, Sa'd hanya mempunyai seorang anak perempuan."
  },
  {
    "id": 2631,
    "hadith_number": 2631,
    "tajuk_hadith": "Disyorkan Mengurangkan Nisbah Harta Warisan Kepada Satu Perempat",
    "perawi_melayu": "Dikisahkan oleh Ibn `Abbas:",
    "english_text": "I recommend that people reduce the proportion of what they bequeath by will to the fourth (of the \nwhole legacy), for Allah's Messenger (ﷺ) said, \"One-third, yet even one third is too much.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَوْ غَضَّ النَّاسُ إِلَى الرُّبْعِ، لأَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الثُّلُثُ، وَالثُّلُثُ كَثِيرٌ أَوْ كَبِيرٌ ‏\"‏‏.‏",
    "malay_translation": "Saya cadangkan agar orang ramai mengurangkan bahagian harta pusaka yang diwasiatkan kepada seperempat (daripada keseluruhan harta pusaka), kerana Rasulullah SAW bersabda, \"Sepertiga, namun sepertiga itu juga terlalu banyak.\""
  },
  {
    "id": 2632,
    "hadith_number": 2632,
    "tajuk_hadith": "Ketetapan Pewarisan dan Pengorbanan Harta dalam Islam",
    "perawi_melayu": "Diceritakan oleh Sa'd bin Abi Waqqas:",
    "english_text": "I fell sick and the Prophet (ﷺ) paid me a visit. I said to him, \"O Allah's Messenger (ﷺ)! I invoke Allah that He \nmay not let me expire in the land whence I migrated (i.e. Mecca).\" He said, \"May Allah give you \nhealth and let the people benefit by you.\" I said, \"I want to will my property, and I have only one \ndaughter and I want to will half of my property (to be given in charity).\" He said,\" Half is too much.\" I \nsaid, \"Then I will one third.\" He said, \"One-third, yet even one-third is too much.\" (The narrator \nadded, \"So the people started to will one third of their property and that was Permitted for them.\")",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ عَدِيٍّ، حَدَّثَنَا مَرْوَانُ، عَنْ هَاشِمِ بْنِ هَاشِمٍ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ مَرِضْتُ فَعَادَنِي النَّبِيُّ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ أَنْ لاَ يَرُدَّنِي عَلَى عَقِبِي‏.‏ قَالَ ‏\"‏ لَعَلَّ اللَّهَ يَرْفَعُكَ وَيَنْفَعُ بِكَ نَاسًا ‏\"‏‏.‏ قُلْتُ أُرِيدُ أَنْ أُوصِيَ، وَإِنَّمَا لِي ابْنَةٌ ـ قُلْتُ ـ أُوصِي بِالنِّصْفِ قَالَ ‏\"‏ النِّصْفُ كَثِيرٌ ‏\"‏‏.‏ قُلْتُ فَالثُّلُثِ‏.‏ قَالَ ‏\"‏ الثُّلُثُ، وَالثُّلُثُ كَثِيرٌ أَوْ كَبِيرٌ ‏\"‏‏.‏ قَالَ فَأَوْصَى النَّاسُ بِالثُّلُثِ، وَجَازَ ذَلِكَ لَهُمْ‏.‏",
    "malay_translation": "Aku jatuh sakit dan Nabi SAW melawat aku. Aku berkata kepadanya, \"Wahai Rasulullah! Aku memohon kepada Allah agar Dia tidak memulangkan aku ke tempat asal perhijrahanku (iaitu Mekah).\" Baginda menjawab, \"Semoga Allah memberi kesihatan kepadamu dan menjadikanmu bermanfaat kepada orang ramai.\" Aku berkata, \"Aku ingin membuat wasiat hartaku, dan aku hanya mempunyai seorang anak perempuan dan aku ingin mewasiatkan separuh hartaku (untuk sedekah).\" Baginda bersabda, \"Separuh itu terlalu banyak.\" Aku berkata, \"Maka satu pertiga.\" Baginda menjawab, \"Satu pertiga, dan satu pertiga itu pun terlalu banyak.\" (Perawi menambah, \"Oleh itu, orang ramai mula mewasiatkan satu pertiga harta mereka dan itu dibenarkan bagi mereka.\")"
  },
  {
    "id": 2633,
    "hadith_number": 2633,
    "tajuk_hadith": "Perkara Perwarisan Anak dan Kewajipan Rasulullah SAW",
    "perawi_melayu": "Dikisahkan oleh `Aishah:",
    "english_text": "(the wife of the Prophet) `Utba bin Abi Waqqas entrusted (his son) to his brother Sa`d bin Abi \nWaqqas saying, \"The son of the slave-girl of Zam`a is my (illegal) son, take him into your custody.\" \nSo during the year of the Conquest (of Mecca) Sa`d took the boy and said, \"This is my brother's son \nwhom my brother entrusted to me.\" 'Abu bin Zam's got up and said, \"He is my brother and the son of \nthe slave girl of my father and was born on my father's bed.\" Then both of them came to Allah's \nApostle and Sa`d said, \"O Allah's Messenger (ﷺ)! This is my brother's son whom my brother entrusted to \nme.\" \nThen 'Abu bin Zam`a got up and said, \"This is my brother and the son of the slave-girl of my father.\" \nAllah's Messenger (ﷺ) said, \"O Abu bin Zam`a! This boy is for you as the boy belongs to the bed (where he \nwas born), and for the adulterer is the stone (i.e. deprivation).\" Then the Prophet (ﷺ) said to his wife \nSauda bint Zam`a, \"Screen yourself from this boy,\" when he saw the boy's resemblance to `Utba. \nSince then the boy did not see Sauda till he died.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ كَانَ عُتْبَةُ بْنُ أَبِي وَقَّاصٍ عَهِدَ إِلَى أَخِيهِ سَعْدِ بْنِ أَبِي وَقَّاصٍ أَنَّ ابْنَ وَلِيدَةِ زَمْعَةَ مِنِّي، فَاقْبِضْهُ إِلَيْكَ‏.‏ فَلَمَّا كَانَ عَامُ الْفَتْحِ أَخَذَهُ سَعْدٌ فَقَالَ ابْنُ أَخِي، قَدْ كَانَ عَهِدَ إِلَىَّ فِيهِ‏.‏ فَقَامَ عَبْدُ بْنُ زَمْعَةَ فَقَالَ أَخِي، وَابْنُ أَمَةِ أَبِي، وُلِدَ عَلَى فِرَاشِهِ‏.‏ فَتَسَاوَقَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَقَالَ سَعْدٌ يَا رَسُولَ اللَّهِ، ابْنُ أَخِي، كَانَ عَهِدَ إِلَىَّ فِيهِ‏.‏ فَقَالَ عَبْدُ بْنُ زَمْعَةَ أَخِي وَابْنُ وَلِيدَةِ أَبِي‏.‏ وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هُوَ لَكَ يَا عَبْدُ ابْنَ زَمْعَةَ، الْوَلَدُ لِلْفِرَاشِ، وَلِلْعَاهِرِ الْحَجَرُ ‏\"‏‏.‏ ثُمَّ قَالَ لِسَوْدَةَ بِنْتِ زَمْعَةَ ‏\"‏ احْتَجِبِي مِنْهُ ‏\"‏‏.‏ لِمَا رَأَى مِنْ شَبَهِهِ بِعُتْبَةَ، فَمَا رَآهَا حَتَّى لَقِيَ اللَّهَ‏.‏",
    "malay_translation": "Hadis ini menceritakan kisah perselisihan tentang anak seorang hamba perempuan Zam'a.  `Utba bin Abi Waqqas telah menyerahkan anak ini kepada saudaranya, Sa'd bin Abi Waqqas.  Ketika tahun penaklukan Mekah, Sa'd mengambil anak itu dan mengatakan bahawa anak tersebut adalah anak saudaranya yang telah diamanahkan kepadanya.  Abdul bin Zam'a bangun dan berkata anak tersebut adalah adiknya dan anak hamba perempuan bapanya yang lahir di atas tilam bapanya. Kedua-dua pihak kemudian pergi kepada Rasulullah SAW. Sa'd berkata, \"Wahai Rasulullah, anak ini adalah anak saudara saya yang diamanahkan kepadaku.\" Abdul bin Zam'a berkata, \"Adik saya, anak perempuan hamba saya.\"  Rasulullah SAW bersabda, \"Wahai Abdul bin Zam'a, anak ini kepunyaanmu, anak adalah mengikut tilam, dan bagi pezina adalah batu (maknanya kekecewaan).\" Kemudian Rasulullah SAW memerintahkan Sauda binti Zam'a untuk menjauhkan diri daripada anak tersebut, disebabkan persamaannya dengan `Utba. Sejak itu, anak itu tidak pernah melihat Sauda sehingga ia meninggal dunia."
  },
  {
    "id": 2634,
    "hadith_number": 2634,
    "tajuk_hadith": "Menghancurkan Kepala Seorang Yahudi dengan Batu",
    "perawi_melayu": "Dikisahkan oleh Anas",
    "english_text": "A Jew crushed the head of a girl between two stones. She was asked, \"Who has done so to you, soand- \nso? So-and-so?\" Till the name of the Jew was mentioned, whereupon she nodded (in agreement). \nSo the Jew was brought and was questioned till he confessed. The Prophet (ﷺ) then ordered that his head \nbe crushed with stones.",
    "arabic_text": "حَدَّثَنَا حَسَّانُ بْنُ أَبِي عَبَّادٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ يَهُوِدِيًّا، رَضَّ رَأْسَ جَارِيَةٍ بَيْنَ حَجَرَيْنِ، فَقِيلَ لَهَا مَنْ فَعَلَ بِكِ، أَفُلاَنٌ أَوْ فُلاَنٌ حَتَّى سُمِّيَ الْيَهُودِيُّ، فَأَوْمَأَتْ بِرَأْسِهَا، فَجِيءَ بِهِ، فَلَمْ يَزَلْ حَتَّى اعْتَرَفَ، فَأَمَرَ النَّبِيُّ صلى الله عليه وسلم فَرُضَّ رَأْسُهُ بِالْحِجَارَةِ‏.‏",
    "malay_translation": "Seorang Yahudi menghancurkan kepala seorang gadis di antara dua batu.  Gadis itu ditanya, \"Siapakah yang telah melakukan ini kepadamu, si fulan atau si fulan?\"  Sehingga nama Yahudi itu disebut, lalu gadis itu menganggukkan kepalanya (sebagai persetujuan). Maka Yahudi itu dibawa dan terus diinterogasi sehingga dia mengaku.  Kemudian Rasulullah saw. memerintahkan agar kepalanya dihancurkan dengan batu."
  },
  {
    "id": 2635,
    "hadith_number": 2635,
    "tajuk_hadith": "Ketentuan Pewarisan dalam Islam dan Perubahannya",
    "perawi_melayu": "Diriwayatkan oleh Ibn `Abbas:",
    "english_text": "The custom (in old days) was that the property of the deceased would be inherited by his offspring; as \nfor the parents (of the deceased), they would inherit by the will of the deceased. Then Allah cancelled \nfrom that custom whatever He wished and fixed for the male double the amount inherited by the \nfemale, and for each parent a sixth (of the whole legacy) and for the wife an eighth or a fourth and for \nthe husband a half or a fourth.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، عَنْ وَرْقَاءَ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ الْمَالُ لِلْوَلَدِ، وَكَانَتِ الْوَصِيَّةُ لِلْوَالِدَيْنِ، فَنَسَخَ اللَّهُ مِنْ ذَلِكَ مَا أَحَبَّ، فَجَعَلَ لِلذَّكَرِ مِثْلَ حَظِّ الأُنْثَيَيْنِ، وَجَعَلَ لِلأَبَوَيْنِ لِكُلِّ وَاحِدٍ مِنْهُمَا السُّدُسَ، وَجَعَلَ لِلْمَرْأَةِ الثُّمُنَ وَالرُّبْعَ، وَلِلزَّوْجِ الشَّطْرَ وَالرُّبُعَ‏.‏",
    "malay_translation": "Adat zaman dahulu, harta pusaka warisan si mati akan diwarisi oleh anak-anaknya; sedangkan ibu bapa (si mati) akan menerima harta melalui wasiat si mati. Kemudian Allah SWT mengubah adat tersebut seperti yang dikehendaki-Nya dan menetapkan bagi lelaki bahagian dua kali ganda daripada bahagian wanita, dan bagi setiap ibu bapa satu perenam (daripada keseluruhan pusaka), dan bagi isteri satu per-lapan atau satu per-empat, dan bagi suami separuh atau satu per-empat."
  },
  {
    "id": 2636,
    "hadith_number": 2636,
    "tajuk_hadith": "Keutamaan Sedekah dan Menolong di Waktu Sihat",
    "perawi_melayu": "Daripada Abu Hurairah:",
    "english_text": "A man asked the Prophet, \"O Allah's Messenger (ﷺ)! What kind of charity is the best?\" He replied. \"To give \nin charity when you are healthy and greedy hoping to be wealthy and afraid of becoming poor. Don't \ndelay giving in charity till the time when you are on the death bed when you say, 'Give so much to soand- \nso and so much to so-and so,' and at that time the property is not yours but it belongs to so-and-so \n(i.e. your inheritors).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ سُفْيَانَ، عَنْ عُمَارَةَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَجُلٌ لِلنَّبِيِّ صلى الله عليه وسلم يَا رَسُولَ اللَّهِ، أَىُّ الصَّدَقَةِ أَفْضَلُ قَالَ ‏\n\"‏ أَنْ تَصَدَّقَ وَأَنْتَ صَحِيحٌ حَرِيصٌ‏.‏ تَأْمُلُ الْغِنَى، وَتَخْشَى الْفَقْرَ، وَلاَ تُمْهِلْ حَتَّى إِذَا بَلَغَتِ الْحُلْقُومَ قُلْتَ لِفُلاَنٍ كَذَا وَلِفُلاَنٍ كَذَا، وَقَدْ كَانَ لِفُلاَنٍ ‏\"‏‏.‏",
    "malay_translation": "Seseorang bertanya kepada Nabi SAW, \"Wahai Rasulullah, sedekah yang mana paling utama?\" Baginda menjawab, \"Bersedekahlah ketika engkau sihat dan berhasrat untuk kaya raya, dan takut menjadi miskin. Jangan menangguhkan sedekah sehingga saat kematian, apabila engkau berkata, 'Berilah sebegini kepada si fulan dan sebegitu kepada si fulan.' Pada saat itu, harta itu bukan milikmu lagi, tetapi milik warismu.\""
  },
  {
    "id": 2637,
    "hadith_number": 2637,
    "tajuk_hadith": "Tanda-tanda Munafik",
    "perawi_melayu": "Dikisahkan oleh Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \"The signs of a hypocrite are three: Whenever he speaks he tells a lie; whenever he \nis entrusted he proves dishonest; whenever he promises he breaks his promise.\"",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ أَبُو الرَّبِيعِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، حَدَّثَنَا نَافِعُ بْنُ مَالِكِ بْنِ أَبِي عَامِرٍ أَبُو سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ آيَةُ الْمُنَافِقِ ثَلاَثٌ، إِذَا حَدَّثَ كَذَبَ، وَإِذَا اؤْتُمِنَ خَانَ، وَإِذَا وَعَدَ أَخْلَفَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Tanda-tanda seorang munafik ada tiga: Jika dia berbicara, dia berdusta; jika dia dipercayakan, dia khianat; dan jika dia berjanji, dia mengingkarinya.\""
  },
  {
    "id": 2638,
    "hadith_number": 2638,
    "tajuk_hadith": "Kebaikan Bersedekah dan Menolak Hadiah yang Tidak Diinginkan",
    "perawi_melayu": "Dikisahkan oleh `Urwa bin Az-Zubair",
    "english_text": "Hakim bin Hizam berkata, \"Saya meminta sesuatu kepada Rasulullah SAW, dan baginda memberinya kepada saya, kemudian saya meminta lagi dan baginda memberinya dan bersabda, 'Wahai Hakim, harta ini hijau dan manis (iaitu, sedap seperti buah-buahan), dan sesiapa yang menerimanya dengan kerelaan hati, maka diberkatilah ia di dalamnya, dan sesiapa yang menerimanya dengan ketamakan, maka tidak diberkatilah ia di dalamnya, dan dia seperti orang yang makan tetapi tidak kenyang. Tangan yang memberi lebih baik daripada tangan yang menerima.'\" Hakim menambahkan, \"Saya berkata, Wahai Rasulullah SAW, demi Dia yang mengutuskan Engkau dengan kebenaran, saya tidak akan meminta sesuatu daripada sesiapa pun setelah Engkau sehingga saya meninggal dunia.\" Kemudian Abu Bakar sering memanggil Hakim untuk memberikan sesuatu kepadanya tetapi Hakim menolak menerimanya. Kemudian Umar memanggilnya untuk memberikan sesuatu kepadanya tetapi dia menolak. Kemudian Umar berkata, \"Wahai umat Islam, saya menawarkan kepadanya haknya yang telah ditetapkan oleh Allah untuknya dari rampasan perang ini, tetapi dia menolak menerimanya.\" Oleh itu, Hakim tidak meminta apa-apa daripada sesiapa pun selepas Nabi SAW sehingga dia meninggal dunia – semoga Allah merahmati beliau.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا الأَوْزَاعِيُّ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَعُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّ حَكِيمَ بْنَ حِزَامٍ ـ رضى الله عنه ـ قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَعْطَانِي، ثُمَّ سَأَلْتُهُ فَأَعْطَانِي ثُمَّ قَالَ لِي ‏\n\"‏ يَا حَكِيمُ، إِنَّ هَذَا الْمَالَ خَضِرٌ حُلْوٌ، فَمَنْ أَخَذَهُ بِسَخَاوَةِ نَفْسٍ بُورِكَ لَهُ فِيهِ، وَمَنْ أَخَذَهُ بِإِشْرَافِ نَفْسٍ لَمْ يُبَارَكْ لَهُ فِيهِ، وَكَانَ كَالَّذِي يَأْكُلُ وَلاَ يَشْبَعُ، وَالْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى ‏\"‏‏.‏ قَالَ حَكِيمٌ فَقُلْتُ يَا رَسُولَ اللَّهِ، وَالَّذِي بَعَثَكَ بِالْحَقِّ لاَ أَرْزَأُ أَحَدًا بَعْدَكَ شَيْئًا حَتَّى أُفَارِقَ الدُّنْيَا‏.‏ فَكَانَ أَبُو بَكْرٍ يَدْعُو حَكِيمًا لِيُعْطِيَهُ الْعَطَاءَ فَيَأْبَى أَنْ يَقْبَلَ مِنْهُ شَيْئًا، ثُمَّ إِنَّ عُمَرَ دَعَاهُ لِيُعْطِيَهُ فَيَأْبَى أَنْ يَقْبَلَهُ فَقَالَ يَا مَعْشَرَ الْمُسْلِمِينَ، إِنِّي أَعْرِضُ عَلَيْهِ حَقَّهُ الَّذِي قَسَمَ اللَّهُ لَهُ مِنْ هَذَا الْفَىْءِ فَيَأْبَى أَنْ يَأْخُذَهُ‏.‏ فَلَمْ يَرْزَأْ حَكِيمٌ أَحَدًا مِنَ النَّاسِ بَعْدَ النَّبِيِّ صلى الله عليه وسلم حَتَّى تُوُفِّيَ رَحِمَهُ اللَّهُ‏.‏",
    "malay_translation": "Hadis ini menceritakan kisah Hakim bin Hizam yang meminta sesuatu daripada Rasulullah SAW, dan baginda memberi kepadanya. Dia meminta lagi, dan baginda memberi lagi. Baginda bersabda, \"Wahai Hakim, harta ini seperti buah-buahan yang hijau dan manis.  Sesiapa yang menerimanya dengan hati yang lapang, ia akan diberkati.  Tetapi sesiapa yang menerimanya dengan ketamakan, ia tidak akan diberkati. Dia seperti orang yang makan tetapi tidak kenyang. Tangan yang memberi lebih baik daripada tangan yang menerima.\"  Hakim menjawab, \"Wahai Rasulullah, demi Dia yang mengutuskan Engkau dengan kebenaran, saya tidak akan meminta sesuatu daripada sesiapa pun setelah Engkau sehingga ajal tiba.\"  Selepas itu, Abu Bakar dan Umar kerap mengajak Hakim untuk menerima pemberian, tetapi dia menolak.  Umar pun berkata kepada orang ramai, \"Aku telah menawarkannya haknya daripada rampasan perang ini, tetapi dia menolaknya.\"  Hakim tidak menerima sesuatu daripada sesiapa pun selepas Rasulullah SAW sehingga meninggal dunia. Semoga Allah merahmati beliau."
  },
  {
    "id": 2639,
    "hadith_number": 2639,
    "tajuk_hadith": "Tanggungjawab dan Perlindungan Terhadap Orang Lain",
    "perawi_melayu": "Diceritakan oleh Ibn `Umar:",
    "english_text": "I heard Allah's Messenger (ﷺ) saying, \"All of you are guardians and responsible for your charges: the Ruler \n(i.e. Imam) is a guardian and responsible for his subjects; and a man is a guardian of his family and is \nresponsible for his charges; and a lady is a guardian in the house of her husband and is responsible for \nher charge; and a servant is a guardian of the property of his master and is responsible for his charge.\" \nI think he also said, \"And a man is a guardian of the property of his father.\"",
    "arabic_text": "حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ السَّخْتِيَانِيُّ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ كُلُّكُمْ رَاعٍ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ، وَالإِمَامُ رَاعٍ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ، وَالرَّجُلُ رَاعٍ فِي أَهْلِهِ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ، وَالْمَرْأَةُ فِي بَيْتِ زَوْجِهَا رَاعِيَةٌ وَمَسْئُولَةٌ عَنْ رَعِيَّتِهَا، وَالْخَادِمُ فِي مَالِ سَيِّدِهِ رَاعٍ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ ‏\"‏‏.‏ قَالَ وَحَسِبْتُ أَنْ قَدْ قَالَ ‏\"‏ وَالرَّجُلُ رَاعٍ فِي مَالِ أَبِيهِ ‏\"‏‏.‏",
    "malay_translation": "Saya mendengar Rasulullah SAW bersabda, \"Setiap kamu adalah penjaga dan bertanggungjawab terhadap yang dijaga: Pemimpin (iaitu Imam) adalah penjaga dan bertanggungjawab terhadap rakyatnya; dan seorang lelaki adalah penjaga keluarganya dan bertanggungjawab terhadap mereka; dan seorang wanita di rumah suaminya adalah penjaga dan bertanggungjawab terhadap yang dijaganya; dan seorang hamba adalah penjaga harta tuannya dan bertanggungjawab terhadapnya.\"  Saya rasa baginda juga bersabda, \"Dan seorang lelaki adalah penjaga harta bapanya.\""
  },
  {
    "id": 2640,
    "hadith_number": 2640,
    "tajuk_hadith": "Pengagihan Harta dan Nasihat Nabi SAW Kepada Kerabat",
    "perawi_melayu": "Dikisahkan oleh Anas:",
    "english_text": "The Prophet (ﷺ) said to Abu Talha, \"I recommend that you divide (this garden) amongst your relatives.\" \nAbu Talha said, \"O Allah's Messenger (ﷺ)! I will do the same.\" So Abu Talha divided it among his relatives \nand cousins. \nIbn 'Abbes said, \"When the Qur'anic Verse: \n\"Warn your nearest kinsmen.\" (26.214) \nWas revealed, the Prophet (ﷺ) started calling the various big families of Quraish, \"O Bani Fihr! O Bani \nAdi!\". \nAbu Huraira said, \"When the Verse: \"Warn your nearest kinsmen\" was revealed, the Prophet (ﷺ) said (in a \nloud voice), \"O people of Quraish!\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسًا ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم لأَبِي طَلْحَةَ ‏\"‏ أَرَى أَنْ تَجْعَلَهَا فِي الأَقْرَبِينَ ‏\"‏‏.‏ قَالَ أَبُو طَلْحَةَ أَفْعَلُ يَا رَسُولَ اللَّهِ‏.‏ فَقَسَمَهَا أَبُو طَلْحَةَ فِي أَقَارِبِهِ وَبَنِي عَمِّهِ‏.‏ وَقَالَ ابْنُ عَبَّاسٍ لَمَّا نَزَلَتْ ‏{‏وَأَنْذِرْ عَشِيرَتَكَ الأَقْرَبِينَ‏}‏ جَعَلَ النَّبِيُّ صلى الله عليه وسلم يُنَادِي ‏\"‏ يَا بَنِي فِهْرٍ، يَا بَنِي عَدِيٍّ ‏\"‏‏.‏ لِبُطُونِ قُرَيْشٍ‏.‏ وَقَالَ أَبُو هُرَيْرَةَ لَمَّا نَزَلَتْ ‏{‏وَأَنْذِرْ عَشِيرَتَكَ الأَقْرَبِينَ‏}‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ يَا مَعْشَرَ قُرَيْشٍ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW menasihati Abu Talha untuk membahagikan kebunnya kepada kerabatnya. Abu Talha menjawab, \"Ya Rasulullah, saya akan melakukannya.\" Lalu Abu Talha membahagikannya kepada kerabat dan saudara-saudaranya.  Ibnu Abbas menceritakan, ketika ayat \"Dan berilah peringatan kepada kaum keluargamu yang terdekat.\" (26.214) turun, Rasulullah SAW mula memanggil kaum Quraisy yang besar, \"Wahai Bani Fihr! Wahai Bani Adi!\"  Abu Hurairah menceritakan, ketika ayat \"Dan berilah peringatan kepada kaum keluargamu yang terdekat\" turun, Rasulullah SAW berseru dengan lantang, \"Wahai kaum Quraisy!\"."
  },
  {
    "id": 2641,
    "hadith_number": 2641,
    "tajuk_hadith": "Seruan Rasulullah SAW kepada Kaum Kerabatnya untuk Menyelamatkan Diri",
    "perawi_melayu": "Dikisahkan oleh Abu Hurairah:",
    "english_text": "When Allah revealed the Verse: \"Warn your nearest kinsmen,\" Allah's Messenger (ﷺ) got up and said, \"O \npeople of Quraish (or said similar words)! Buy (i.e. save) yourselves (from the Hellfire) as I cannot \nsave you from Allah's Punishment; O Bani `Abd Manaf! I cannot save you from Allah's Punishment, \nO Safiya, the Aunt of Allah's Messenger (ﷺ)! I cannot save you from Allah's Punishment; O Fatima bint \nMuhammad! Ask me anything from my wealth, but I cannot save you from Allah's Punishment.\"",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏وَأَنْذِرْ عَشِيرَتَكَ الأَقْرَبِينَ ‏}‏ قَالَ ‏\"‏ يَا مَعْشَرَ قُرَيْشٍ ـ أَوْ كَلِمَةً نَحْوَهَا ـ اشْتَرُوا أَنْفُسَكُمْ، لاَ أُغْنِي عَنْكُمْ مِنَ اللَّهِ شَيْئًا، يَا بَنِي عَبْدِ مَنَافٍ لاَ أُغْنِي عَنْكُمْ مِنَ اللَّهِ شَيْئًا، يَا عَبَّاسُ بْنَ عَبْدِ الْمُطَّلِبِ لاَ أُغْنِي عَنْكَ مِنَ اللَّهِ شَيْئًا، وَيَا صَفِيَّةُ عَمَّةَ رَسُولِ اللَّهِ لاَ أُغْنِي عَنْكِ مِنَ اللَّهِ شَيْئًا، وَيَا فَاطِمَةُ بِنْتَ مُحَمَّدٍ سَلِينِي مَا شِئْتِ مِنْ مَالِي لاَ أُغْنِي عَنْكِ مِنَ اللَّهِ شَيْئًا ‏\"‏‏.‏ تَابَعَهُ أَصْبَغُ عَنِ ابْنِ وَهْبٍ عَنْ يُونُسَ عَنِ ابْنِ شِهَابٍ‏.‏",
    "malay_translation": "Apabila Allah menurunkan ayat, \"Dan berilah peringatan kepada kaum kerabatmu yang terdekat,\" Rasulullah SAW bangun dan berkata, \"Wahai kaum Quraisy – atau perkataan yang seumpamanya – belilah dirimu (dengan taubat dan amal soleh), aku tidak dapat menyelamatkanmu daripada azab Allah. Wahai Bani Abd Manaf, aku tidak dapat menyelamatkanmu daripada azab Allah. Wahai Safiyyah, bibi Rasulullah SAW, aku tidak dapat menyelamatkanmu daripada azab Allah. Wahai Fatimah binti Muhammad, mintalah apa sahaja dari hartaku, namun aku tidak dapat menyelamatkanmu daripada azab Allah.\""
  },
  {
    "id": 2642,
    "hadith_number": 2642,
    "tajuk_hadith": "Ketetapan Nabi SAW mengenai Menaiki Unta Kurban",
    "perawi_melayu": "Dikisahkan oleh Anas bin Malik r.a.",
    "english_text": "The Prophet (ﷺ) saw a man driving a Badana (i.e. camel for sacrifice) and said to him, \"Ride on it.\" The \nman said, \"O Allah's Messenger (ﷺ)! It is a Bandana.\" (The Prophet (ﷺ) repeated his order) and on the third or \nfourth time he said, \"Ride it, (woe to you\" or said: \"May Allah be merciful to you).",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى رَجُلاً يَسُوقُ بَدَنَةً، فَقَالَ لَهُ ‏\"‏ ارْكَبْهَا ‏\"‏‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّهَا بَدَنَةٌ‏.‏ قَالَ فِي الثَّالِثَةِ أَوِ الرَّابِعَةِ ‏\"‏ ارْكَبْهَا، وَيْلَكَ، أَوْ وَيْحَكَ ‏\"‏‏.‏",
    "malay_translation": "Nabi SAW melihat seorang lelaki sedang mengiring seekor unta (badana) yang bertujuan untuk korban. Baginda bersabda, \"Naikilah ia.\" Lelaki itu menjawab, \"Wahai Rasulullah, ia adalah unta korban.\"  Nabi SAW mengulangi arahan tersebut.  Pada kali ketiga atau keempat, Baginda bersabda, \"Naikilah ia, celaka kamu!\" atau, \"Semoga Allah merahmati kamu.\"."
  },
  {
    "id": 2643,
    "hadith_number": 2643,
    "tajuk_hadith": "Larangan Mengabaikan Perintah dan Nasihat Nabi SAW dalam Perlakuan Mengendalikan Haiwan",
    "perawi_melayu": "Dikisahkan oleh Abu Hurairah:",
    "english_text": "Allah's Messenger (ﷺ) saw a man driving a Badana and said to him, \"Ride on it,\" and on the second or the \nthird time he added, \"Woe to you.\"",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَأَى رَجُلاً يَسُوقُ بَدَنَةً، فَقَالَ ‏\"‏ ارْكَبْهَا ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ إِنَّهَا بَدَنَةٌ‏.‏ قَالَ ‏\"‏ ارْكَبْهَا، وَيْلَكَ ‏\"‏‏.‏ فِي الثَّانِيَةِ أَوْ فِي الثَّالِثَةِ‏.‏",
    "malay_translation": "Rasulullah SAW melihat seorang lelaki sedang mengendalikan seekor Badana (jenis lembu). Baginda bersabda, \"Naikilah ia.\"  Lelaki itu berkata, \"Ya Rasulullah, ia seekor Badana.\" Baginda bersabda lagi, \"Naikilah ia, celaka engkau.\" Ini diulangi pada kali kedua atau ketiga."
  },
  {
    "id": 2644,
    "hadith_number": 2644,
    "tajuk_hadith": "Kebaikan Sedekah bagi Ibu yang Meninggal dalam Keadaan Tidak Hadir Anaknya",
    "perawi_melayu": "Diceritakan oleh Ibn `Abbas:",
    "english_text": "The mother of Sa`d bin 'Ubada died in his absence. He said, \"O Allah's Messenger (ﷺ)! My mother died in \nmy absence; will it be of any benefit for her if I give Sadaqa on her behalf?\" The Prophet (ﷺ) said, \"Yes,\" \nSa`d said, \"I make you a witness that I gave my garden called Al Makhraf in charity on her behalf.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا مَخْلَدُ بْنُ يَزِيدَ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي يَعْلَى، أَنَّهُ سَمِعَ عِكْرِمَةَ، يَقُولُ أَنْبَأَنَا ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ سَعْدَ بْنَ عُبَادَةَ ـ رضى الله عنه ـ تُوُفِّيَتْ أُمُّهُ وَهْوَ غَائِبٌ عَنْهَا، فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أُمِّي تُوُفِّيَتْ وَأَنَا غَائِبٌ عَنْهَا، أَيَنْفَعُهَا شَىْءٌ إِنْ تَصَدَّقْتُ بِهِ عَنْهَا قَالَ ‏\n\"‏ نَعَمْ ‏\"‏‏.‏ قَالَ فَإِنِّي أُشْهِدُكَ أَنَّ حَائِطِي الْمِخْرَافَ صَدَقَةٌ عَلَيْهَا‏.‏",
    "malay_translation": "Ibu Sa`d bin 'Ubada meninggal dunia ketika beliau tidak berada di sisi.  Beliau berkata, \"Wahai Rasulullah! Ibuku telah meninggal dunia sedangkan aku tidak berada di sisinya.  Adakah sedekah yang aku berikan untuknya akan memberikan manfaat kepadanya?\" Nabi saw. menjawab, \"Ya.\"  Sa'd berkata, \"Aku saksikan kepadamu bahawa aku telah memberikan taman yang bernama Al Makhraf sebagai sedekah untuk ibunya.\""
  },
  {
    "id": 2645,
    "hadith_number": 2645,
    "tajuk_hadith": "Keutamaan Memegang Sebahagian Harta untuk Diri Sendiri",
    "perawi_melayu": "Dikisahkan oleh Ka'b bin Malik:",
    "english_text": "I said, \"O Allah's Messenger (ﷺ)! For the acceptance of my repentance I wish to give all my property in \ncharity for Allah's sake through His Apostle .\" He said, \"It is better for you to keep some of the \nproperty for yourself.\" I said, \"Then I will keep my share in Khaibar.\"",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبٍ، أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبٍ، قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ ـ رضى الله عنه‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ، إِنَّ مِنْ تَوْبَتِي أَنْ أَنْخَلِعَ مِنْ مَالِي صَدَقَةً إِلَى اللَّهِ وَإِلَى رَسُولِهِ صلى الله عليه وسلم‏.‏ قَالَ ‏\n\"‏ أَمْسِكْ عَلَيْكَ بَعْضَ مَالِكَ فَهُوَ خَيْرٌ لَكَ ‏\"‏‏.‏ قُلْتُ فَإِنِّي أُمْسِكُ سَهْمِي الَّذِي بِخَيْبَرَ‏.‏",
    "malay_translation": "Aku berkata, \"Wahai Rasulullah! Dalam penyesalan dan taubatku, aku ingin menyumbangkan seluruh hartanya untuk Allah dan Rasul-Nya.\" Baginda bersabda, \"Lebih baik engkau menyimpan sebahagian dari hartanya untuk dirimu.\" Aku berkata, \"Kalau begitu, aku akan menyimpan bahagianku di Khaibar.\""
  },
  {
    "id": 2646,
    "hadith_number": 2646,
    "tajuk_hadith": "Pengorbanan Harta Tersayang dan Keputusan Rasulullah SAW",
    "perawi_melayu": "Diceritakan oleh Anas (r.a.):",
    "english_text": "When the Holy Verse: 'By no means shall you attain Al-Birr (piety, righteousness, it means here Allah's Reward i.e., Paradise), unless you spend of that which you love..', (V 3:92) was revealed, Abu Talha went to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger ! Allah, the Blessed, the Superior stated in His book: 'By no means shall you attain Birr, unless you spend of that which you love....' (V 3:92) and the most beloved property to me is Bairuha' (which was a garden where Allah's Messenger (ﷺ) used to go to sit in its shade and drink from its water). I gave it to the Allah and His Messenger (ﷺ) hoping for Allah's Reward in the Hereafter. So, Ao Allah's Messenger ! Use it as Allah orders you to use it.\" Allah's Messenger (ﷺ) said, \"Bravo! O Abu Talha, it is fruitful property. We have accepted it from you and now we return it to you. Distribute it amongst you relatives.\" So, Abu Talha distributed it amongst his relatives, amongst whom were Ubai and Hassan. When Hassan sold his share of that garden to Mu'awiyya, he was asked, \"How do you see Abu Talha's Sadaqa?\" He replied, \"Who should not I sell a Sa' of date for Sa' of money ?\" The garden was situated on the courtyard of the palace of Bani Jadila built by Mu'awiya.",
    "arabic_text": "وَقَالَ إِسْمَاعِيلُ أَخْبَرَنِي عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ،، لاَ أَعْلَمُهُ إِلاَّ عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ لَمَّا نَزَلَتْ ‏{‏لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ‏}‏ جَاءَ أَبُو طَلْحَةَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ يَقُولُ اللَّهُ تَبَارَكَ وَتَعَالَى فِي كِتَابِهِ ‏{‏لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ‏}‏ وَإِنَّ أَحَبَّ أَمْوَالِي إِلَىَّ بِيرُحَاءَ ـ قَالَ وَكَانَتْ حَدِيقَةً كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدْخُلُهَا وَيَسْتَظِلُّ بِهَا وَيَشْرَبُ مِنْ مَائِهَا ـ فَهِيَ إِلَى اللَّهِ عَزَّ وَجَلَّ وَإِلَى رَسُولِهِ صلى الله عليه وسلم أَرْجُو بِرَّهُ وَذُخْرَهُ، فَضَعْهَا أَىْ رَسُولَ اللَّهِ حَيْثُ أَرَاكَ اللَّهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بَخْ يَا أَبَا طَلْحَةَ، ذَلِكَ مَالٌ رَابِحٌ، قَبِلْنَاهُ مِنْكَ وَرَدَدْنَاهُ عَلَيْكَ، فَاجْعَلْهُ فِي الأَقْرَبِينَ ‏\"‏‏.‏ فَتَصَدَّقَ بِهِ أَبُو طَلْحَةَ عَلَى ذَوِي رَحِمِهِ، قَالَ وَكَانَ مِنْهُمْ أُبَىٌّ وَحَسَّانُ، قَالَ وَبَاعَ حَسَّانُ حِصَّتَهُ مِنْهُ مِنْ مُعَاوِيَةَ، فَقِيلَ لَهُ تَبِيعُ صَدَقَةَ أَبِي طَلْحَةَ فَقَالَ أَلاَ أَبِيعُ صَاعًا مِنْ تَمْرٍ بِصَاعٍ مِنْ دَرَاهِمَ قَالَ وَكَانَتْ تِلْكَ الْحَدِيقَةُ فِي مَوْضِعِ قَصْرِ بَنِي حُدَيْلَةَ الَّذِي بَنَاهُ مُعَاوِيَةُ‏.‏",
    "malay_translation": "Telah diceritakan oleh Anas (r.a.) bahawa apabila ayat suci Al-Quran, \"Demi sesungguhnya, kamu tidak akan mencapai kebaikan (al-birr) sehingga kamu membelanjakan sebahagian dari apa yang kamu sayangi.\" (Surah Ali 'Imran, ayat 92) diturunkan, Abu Talha datang kepada Rasulullah SAW dan berkata, \"Wahai Rasulullah! Allah SWT berfirman dalam kitab-Nya, \"Demi sesungguhnya, kamu tidak akan mencapai kebaikan (al-birr) sehingga kamu membelanjakan sebahagian dari apa yang kamu sayangi.\" (Surah Ali 'Imran, ayat 92) dan harta yang paling aku sayangi ialah kebun Bairuha', (yang merupakan sebuah kebun di mana Rasulullah SAW sering duduk dan minum airnya). Aku mendermakan kebun itu kepada Allah dan Rasulullah SAW dengan harapan pahala di akhirat. Oleh itu, wahai Rasulullah, gunakanlah kebun itu sebagaimana yang diperintahkan Allah kepada-Mu.\" Rasulullah SAW menjawab, \"Bagus, wahai Abu Talha. Itulah harta yang mendatangkan kebaikan. Kami telah menerimanya dari kamu dan mengembalikannya kepadamu. Bagikan kepada kaum kerabatmu.\" Oleh itu, Abu Talha menghadiahkannya kepada kaum kerabatnya, di antaranya Ubai dan Hassan. Kemudian Hassan menjual bahagiannya di kebun itu kepada Mu'awiyah. Ia ditanya, \"Bagaimana pendapatmu tentang sedekah Abu Talha?\" Hassan menjawab, \"Mengapa aku tidak menjual satu 'sa' kurma dengan satu 'sa' dirham?\" Kebun tersebut terletak di halaman istana Bani Jadilah yang dibina oleh Mu'awiyah."
  },
  {
    "id": 2647,
    "hadith_number": 2647,
    "tajuk_hadith": "Penjelasan tentang Kewarisan dan Perlindungan Orang Yatim Piatu",
    "perawi_melayu": "Dikisahkan oleh Ibn `Abbas:",
    "english_text": "Some people claim that the order in the above Verse is cancelled, by Allah, it is not cancelled, but the \npeople have stopped acting on it. There are two kinds of guardians (who are in charge of the \ninheritance): One is that who inherits; such a person should give (of what he inherits to the relatives, \nthe orphans and the needy, etc.), the other is that who does not inherit (e.g. the guardian of the \norphans): such a person should speak kindly and say (to those who are present at the time of \ndistribution), \"I can not give it to you (as the wealth belongs to the orphans).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْفَضْلِ أَبُو النُّعْمَانِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ إِنَّ نَاسًا يَزْعُمُونَ أَنَّ هَذِهِ الآيَةَ نُسِخَتْ، وَلاَ وَاللَّهِ مَا نُسِخَتْ، وَلَكِنَّهَا مِمَّا تَهَاوَنَ النَّاسُ، هُمَا وَالِيَانِ وَالٍ يَرِثُ، وَذَاكَ الَّذِي يَرْزُقُ، وَوَالٍ لاَ يَرِثُ، فَذَاكَ الَّذِي يَقُولُ بِالْمَعْرُوفِ، يَقُولُ لاَ أَمْلِكُ لَكَ أَنْ أُعْطِيَكَ‏.‏",
    "malay_translation": "Sesetengah orang mendakwa bahawa perintah dalam Ayat di atas telah dimansuhkan, demi Allah, ia tidak dimansuhkan, tetapi manusia telah berhenti mengamalkannya. Terdapat dua jenis wali (yang bertanggungjawab terhadap warisan): Satu ialah yang mewarisi; individu tersebut perlu memberi (daripada apa yang diwarisinya kepada ahli keluarga, anak yatim dan orang miskin, dan sebagainya), yang lain ialah yang tidak mewarisi (contohnya, penjaga anak yatim): individu tersebut harus berkata dengan baik dan berkata (kepada mereka yang hadir semasa pengagihan), \"Saya tidak mampu memberikannya kepada anda (kerana harta itu kepunyaan anak yatim).\""
  },
  {
    "id": 2648,
    "hadith_number": 2648,
    "tajuk_hadith": "Memberi Sedekah Bagi Ibu yang Meninggal Mendadak",
    "perawi_melayu": "Dikisahkan oleh `Aishah رضي الله عنها",
    "english_text": "A man said to the Prophet, \"My mother died suddenly, and I think that if she could speak, she would \nhave given in charity. May I give in charity on her behalf?\" He said, \"Yes! Give in charity on her \nbehalf.\"",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، رضى الله عنها أَنَّ رَجُلاً، قَالَ لِلنَّبِيِّ صلى الله عليه وسلم إِنَّ أُمِّي افْتُلِتَتْ نَفْسَهَا، وَأُرَاهَا لَوْ تَكَلَّمَتْ تَصَدَّقَتْ، أَفَأَتَصَدَّقُ عَنْهَا قَالَ ‏\n\"‏ نَعَمْ، تَصَدَّقْ عَنْهَا ‏\"‏‏.‏",
    "malay_translation": "Seorang lelaki berkata kepada Rasulullah SAW, \"Ibu saya meninggal dunia dengan tiba-tiba, dan saya rasa sekiranya dia mampu berkata-kata, pastilah dia akan bersedekah. Bolehkah saya bersedekah atas namanya?\" Baginda menjawab, \"Ya! Bersedekahlah atas namanya.\""
  },
  {
    "id": 2649,
    "hadith_number": 2649,
    "tajuk_hadith": "Menunaikan Nazar Ibu yang Meninggal",
    "perawi_melayu": "Diriwayatkan oleh Ibnu Abbas:",
    "english_text": "Sa`d bin Ubada berjumpa Rasulullah SAW dan bertanya, \"Ibu saya telah meninggal dunia dan beliau ada nazar yang belum ditunaikan.\" \nRasulullah SAW bersabda, \"Tunaikanlah nazar itu untuknya.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ سَعْدَ بْنَ عُبَادَةَ ـ رضى الله عنه ـ اسْتَفْتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنَّ أُمِّي مَاتَتْ وَعَلَيْهَا نَذْرٌ‏.‏ فَقَالَ ‏\n\"‏ اقْضِهِ عَنْهَا ‏\"‏‏.‏",
    "malay_translation": "Sa'd bin Ubadah menemui Rasulullah SAW dan bertanya, \"Ibu saya telah meninggal dunia dan beliau mempunyai nazar yang belum ditunaikan.\" Rasulullah SAW bersabda, \"Tunaikanlah nazar itu untuknya.\""
  },
  {
    "id": 2650,
    "hadith_number": 2650,
    "tajuk_hadith": "Keutamaan Bersedekah Bagi Ibu yang Meninggal dalam Ketiadaan Anak",
    "perawi_melayu": "Diceritakan oleh Ibn `Abbas:",
    "english_text": "That the mother of Sa`d bin Ubada the brother of Bani Saida died in Sa`d's absence, so he came to the Prophet saying, \"O Allah's Messenger (ﷺ)! My mother died in my absence, will it benefit her if I give in charity on her behalf?\" The Prophet (ﷺ) said, \"Yes.\" Sa`d said, \"I take you as my witness that I give my garden Al-Makhraf in charity on her behalf.\"",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي يَعْلَى، أَنَّهُ سَمِعَ عِكْرِمَةَ، مَوْلَى ابْنِ عَبَّاسٍ يَقُولُ أَنْبَأَنَا ابْنُ عَبَّاسٍ، أَنَّ سَعْدَ بْنَ عُبَادَةَ ـ رضى الله عنهم ـ أَخَا بَنِي سَاعِدَةَ تُوُفِّيَتْ أُمُّهُ وَهْوَ غَائِبٌ، فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أُمِّي تُوُفِّيَتْ وَأَنَا غَائِبٌ عَنْهَا، فَهَلْ يَنْفَعُهَا شَىْءٌ إِنْ تَصَدَّقْتُ بِهِ عَنْهَا قَالَ ‏\n\"‏ نَعَمْ ‏\"‏‏.‏ قَالَ فَإِنِّي أُشْهِدُكَ أَنَّ حَائِطِي الْمِخْرَافَ صَدَقَةٌ عَلَيْهَا‏.‏",
    "malay_translation": "Telah diceritakan oleh Ibn `Abbas bahawa ibu Said bin Ubada, saudara Bani Saida, meninggal dunia ketika Said sedang berhalangan. Said datang kepada Rasulullah SAW dan bertanya, \"Ya Rasulullah, ibu saya meninggal dunia ketika saya berhalangan, adakah sedekah yang saya berikan atas namanya akan memberi manfaat kepadanya?\" Rasulullah SAW menjawab, \"Ya.\" Said berkata, \"Saya saksikan kepada kamu bahawa taman Al-Makhraf saya menjadi sedekah untuknya.\""
  },
  {
    "id": 2651,
    "hadith_number": 2651,
    "tajuk_hadith": "Penjelasan Ayat Al-Quran Tentang Perkahwinan dengan Anak Yatim dan Penentuan Mas Kawin",
    "perawi_melayu": "Diriwayatkan oleh Az-Zuhri",
    "english_text": "`Urwa bin Az-Zubair said that he asked `Aisha about the meaning of the Qur'anic Verse:-- \n\"And if you fear that you will not deal fairly with the orphan girls then marry (other) women of your \nchoice.\" (4.2-3) \nAisha said, \"It is about a female orphan under the guardianship of her guardian who is inclined \ntowards her because of her beauty and wealth, and likes to marry her with a Mahr less than what is \ngiven to women of her standard. So they (i.e. guardians) were forbidden to marry the orphans unless \nthey paid them a full appropriate Mahr (otherwise) they were ordered to marry other women instead of \nthem. Later on the people asked Allah's Messenger (ﷺ) about it. So Allah revealed the following Verse:-- \n\"They ask your instruction (O Muhammad!) regarding women. Say: Allah instructs you regarding \nthem...\" (4.127) \nand in this Verse Allah indicated that if the orphan girl was beautiful and wealthy, her guardian would \nhave the desire to marry her without giving her an appropriate Mahr equal to what her peers could get, \nbut if she was undesirable for lack of beauty or wealth, then he would not marry her, but seek to marry \nsome other woman instead of her. So, since he did not marry her when he had no inclination towards \nher, he had not the right to marry her when he had an interest in her, unless he treated her justly by \ngiving her a full Mahr and securing all her rights.",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ كَانَ عُرْوَةُ بْنُ الزُّبَيْرِ يُحَدِّثُ أَنَّهُ سَأَلَ عَائِشَةَ ـ رضى الله عنها – ‏{‏وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ‏}‏ قَالَتْ هِيَ الْيَتِيمَةُ فِي حَجْرِ وَلِيِّهَا، فَيَرْغَبُ فِي جَمَالِهَا وَمَالِهَا، وَيُرِيدُ أَنْ يَتَزَوَّجَهَا بِأَدْنَى مِنْ سُنَّةِ نِسَائِهَا، فَنُهُوا عَنْ نِكَاحِهِنَّ، إِلاَّ أَنْ يُقْسِطُوا لَهُنَّ فِي إِكْمَالِ الصَّدَاقِ، وَأُمِرُوا بِنِكَاحِ مَنْ سِوَاهُنَّ مِنَ النِّسَاءِ قَالَتْ عَائِشَةُ ثُمَّ اسْتَفْتَى النَّاسُ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعْدُ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏وَيَسْتَفْتُونَكَ فِي النِّسَاءِ قُلِ اللَّهُ يُفْتِيكُمْ فِيهِنَّ‏}‏ قَالَتْ فَبَيَّنَ اللَّهُ فِي هَذِهِ أَنَّ الْيَتِيمَةَ إِذَا كَانَتْ ذَاتَ جَمَالٍ وَمَالٍ رَغِبُوا فِي نِكَاحِهَا، وَلَمْ يُلْحِقُوهَا بِسُنَّتِهَا بِإِكْمَالِ الصَّدَاقِ، فَإِذَا كَانَتْ مَرْغُوبَةً عَنْهَا فِي قِلَّةِ الْمَالِ وَالْجَمَالِ تَرَكُوهَا وَالْتَمَسُوا غَيْرَهَا مِنَ النِّسَاءِ، قَالَ فَكَمَا يَتْرُكُونَهَا حِينَ يَرْغَبُونَ عَنْهَا فَلَيْسَ لَهُمْ أَنْ يَنْكِحُوهَا إِذَا رَغِبُوا فِيهَا إِلاَّ أَنْ يُقْسِطُوا لَهَا الأَوْفَى مِنَ الصَّدَاقِ وَيُعْطُوهَا حَقَّهَا‏.‏",
    "malay_translation": "Urwa bin Az-Zubair meriwayatkan bahawa dia bertanya kepada 'Aishah tentang maksud ayat al-Quran:\n\"Dan jika kamu khuatir tidak dapat berlaku adil kepada anak-anak yatim perempuan, maka kawinilah wanita-wanita yang kamu sukai.\" (4:2-3)\n'Aishah berkata, \"Ini mengenai anak yatim perempuan yang berada di bawah jagaan wali yang tertarik kepadanya kerana kecantikannya dan hartanya, dan dia ingin menikahkannya dengan mas kawin yang kurang daripada mas kawin wanita-wanita sebayanya. Oleh itu, mereka (iaitu wali) dilarang mengahwini mereka kecuali mereka membayar mas kawin yang penuh dan sempurna, dan mereka diperintahkan untuk mengahwini wanita lain selain mereka. Kemudian, orang ramai meminta pandangan Rasulullah SAW mengenai perkara ini. Lalu Allah menurunkan ayat berikut:\n\"Mereka bertanya kepadamu (wahai Muhammad) tentang wanita. Katakanlah: Allah memberi keterangan kepadamu tentang mereka…\" (4:127)\nDalam ayat ini, Allah menjelaskan bahawa jika anak yatim perempuan itu cantik dan kaya, walinya mungkin ingin mengahwininya tanpa memberikannya mas kawin yang sepadan dengan wanita lain sebayanya. Tetapi jika dia kurang menarik kerana kurangnya kecantikan atau harta, maka dia tidak akan mengahwininya dan akan mencari wanita lain. Oleh itu, kerana dia tidak mengahwininya ketika dia tidak tertarik, maka dia tidak berhak mengahwininya jika dia berminat, kecuali dia berlaku adil dengan memberikan mas kawin yang penuh dan memenuhi semua haknya.\""
  },
  {
    "id": 2652,
    "hadith_number": 2652,
    "tajuk_hadith": "Sebutan tentang sedekah harta milik Umar al-Khattab yang berharga",
    "perawi_melayu": "Diceritakan oleh Ibn Umar",
    "english_text": "In the lifetime of Allah's Messenger (ﷺ) , `Umar gave in charity some of his property, a garden of date-palms \ncalled Thamgh. `Umar said, \"O Allah's Messenger (ﷺ)! I have some property which I prize highly and I want \nto give it in charity.\" The Prophet; said, \"Give it in charity (i.e. as an endowment) with its land and \ntrees on the condition that the land and trees will neither be sold nor given as a present, nor \nbequeathed, but the fruits are to be spent in charity.\" So `Umar gave it in charity, and it was for \nAllah's Cause, the emancipation of slaves, for the poor, for guests, for travelers, and for kinsmen. The \nperson acting as its administrator could eat from it reasonably and fairly, and could let a friend of his \neat from it provided he had no intention of becoming wealthy by its means.",
    "arabic_text": "حَدَّثَنَا هَارُونُ، حَدَّثَنَا أَبُو سَعِيدٍ، مَوْلَى بَنِي هَاشِمٍ حَدَّثَنَا صَخْرُ بْنُ جُوَيْرِيَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ عُمَرَ، تَصَدَّقَ بِمَالٍ لَهُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَكَانَ يُقَالُ لَهُ ثَمْغٌ، وَكَانَ نَخْلاً، فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ إِنِّي اسْتَفَدْتُ مَالاً وَهُوَ عِنْدِي نَفِيسٌ فَأَرَدْتُ أَنْ أَتَصَدَّقَ بِهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ تَصَدَّقْ بِأَصْلِهِ، لاَ يُبَاعُ وَلاَ يُوهَبُ وَلاَ يُورَثُ، وَلَكِنْ يُنْفَقُ ثَمَرُهُ ‏\"‏‏.‏ فَتَصَدَّقَ بِهِ عُمَرُ، فَصَدَقَتُهُ ذَلِكَ فِي سَبِيلِ اللَّهِ وَفِي الرِّقَابِ وَالْمَسَاكِينِ وَالضَّيْفِ وَابْنِ السَّبِيلِ وَلِذِي الْقُرْبَى، وَلاَ جُنَاحَ عَلَى مَنْ وَلِيَهُ أَنْ يَأْكُلَ مِنْهُ بِالْمَعْرُوفِ، أَوْ يُوكِلَ صَدِيقَهُ غَيْرَ مُتَمَوِّلٍ بِهِ‏.‏",
    "malay_translation": "Pada zaman Rasulullah SAW, Umar al-Khattab telah bersedekah sebahagian hartanya, iaitu sebuah kebun kurma yang dikenali sebagai Thamgh. Umar berkata, \"Wahai Rasulullah! Aku mempunyai harta yang sangat aku hargai dan aku ingin bersedekah dengannya.\"  Nabi SAW bersabda, \"Sedekahkanlah pokoknya, tanahnya, dan pokok-pokoknya dengan syarat tanah dan pokok tidak dijual, dihadiahkan atau diwarisi, tetapi hasilnya hendaklah dibelanjakan untuk sedekah.\"  Maka Umar bersedekah dengannya, dan sedekahnya itu untuk jalan Allah, membebaskan hamba abdi, untuk fakir miskin, tetamu, musafir, dan kerabat.  Tidak mengapa bagi orang yang menguruskannya untuk makan daripadanya dengan cara yang baik, atau mempercayakannya kepada kawannya yang tidak bertujuan untuk mengkaya dengannya."
  },
  {
    "id": 2653,
    "hadith_number": 2653,
    "tajuk_hadith": "Panduan Kewangan Wali terhadap Anak Yatim",
    "perawi_melayu": "Dikisahkan oleh `Aisha:",
    "english_text": "The following Verse:-- \n\"If a guardian is well-off, let him claim no remuneration (i.e. wages), but if he is poor, let him have for \nhimself what is just and reasonable.\" (4.6) \nwas revealed in connection with the guardian of an orphan, and it means that if he is poor he can have \nfor himself (from the orphan's wealth) what is just and reasonable according to the orphan's share of \nthe inheritance.",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها – ‏{‏وَمَنْ كَانَ غَنِيًّا فَلْيَسْتَعْفِفْ وَمَنْ كَانَ فَقِيرًا فَلْيَأْكُلْ بِالْمَعْرُوفِ‏}‏‏.‏ قَالَتْ أُنْزِلَتْ فِي وَالِي الْيَتِيمِ أَنْ يُصِيبَ مِنْ مَالِهِ إِذَا كَانَ مُحْتَاجًا بِقَدْرِ مَالِهِ بِالْمَعْرُوفِ‏.‏",
    "malay_translation": "Ayat berikut:\n\"Jika seorang wali kaya, janganlah dia meminta upah, tetapi jika dia miskin, hendaklah dia mengambil bahagian yang adil dan munasabah baginya.\" (4.6) \ntelah diturunkan berkaitan dengan wali anak yatim, dan maksudnya jika dia miskin, dia boleh mengambil bahagian yang adil dan munasabah dari harta anak yatim mengikut bahagian warisannya."
  },
  {
    "id": 2654,
    "hadith_number": 2654,
    "tajuk_hadith": "Menjauhi Tujuh Dosa Besar yang Memusnahkan",
    "perawi_melayu": "Dikisahkan oleh Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \"Avoid the seven great destructive sins.\" The people enquire, \"O Allah's Messenger (ﷺ)! \nWhat are they? \"He said, \"To join others in worship along with Allah, to practice sorcery, to kill the \nlife which Allah has forbidden except for a just cause, (according to Islamic law), to eat up Riba \n(usury), to eat up an orphan's wealth, to give back to the enemy and fleeing from the battlefield at the \ntime of fighting, and to accuse, chaste women, who never even think of anything touching chastity \nand are good believers.",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ ثَوْرِ بْنِ زَيْدٍ الْمَدَنِيِّ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ اجْتَنِبُوا السَّبْعَ الْمُوبِقَاتِ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ، وَمَا هُنَّ قَالَ ‏\"‏ الشِّرْكُ بِاللَّهِ، وَالسِّحْرُ، وَقَتْلُ النَّفْسِ الَّتِي حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ، وَأَكْلُ الرِّبَا، وَأَكْلُ مَالِ الْيَتِيمِ، وَالتَّوَلِّي يَوْمَ الزَّحْفِ، وَقَذْفُ الْمُحْصَنَاتِ الْمُؤْمِنَاتِ الْغَافِلاَتِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Jauhilah tujuh dosa besar yang membawa kebinasaan.\" Para sahabat bertanya, \"Wahai Rasulullah, apakah dosa-dosa itu?\" Baginda menjawab, \"Syirik kepada Allah, sihir, membunuh nyawa yang diharamkan Allah kecuali dengan alasan yang dibenarkan (menurut syariat Islam), memakan riba, memakan harta anak yatim, berpaling (tidak membantu) pada hari peperangan, dan menuduh wanita-wanita yang suci dan beriman yang tidak pernah terpikirkan untuk melakukan perbuatan yang menyinggung kehormatan mereka.\""
  },
  {
    "id": 2655,
    "hadith_number": 2655,
    "tajuk_hadith": "Panduan Penjagaan Harta Anak Yatim dan Kebajikan Mereka",
    "perawi_melayu": "Nafi' berkata:",
    "english_text": "\"Ibn 'Umar never refused to be appointed as guardian.\" The most beloved thing to Ibn Sirin concerning an orphan's wealth was that the orphan's advisor and guardians would assemble to decide what is best for him. When Tawus was asked about something concerning an orphan's affairs, he would recite: '...And Allah knows him who means mischief from him who means good...' (V 2:220). 'Ata said concerning some orphans, \"The guardian is to provide for the young and the old orphans according to their needs from their shares.\"",
    "arabic_text": "وَقَالَ لَنَا سُلَيْمَانُ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، قَالَ مَا رَدَّ ابْنُ عُمَرَ عَلَى أَحَدٍ وَصِيَّةً‏.‏ وَكَانَ ابْنُ سِيرِينَ أَحَبَّ الأَشْيَاءِ إِلَيْهِ فِي مَالِ الْيَتِيمِ أَنْ يَجْتَمِعَ إِلَيْهِ نُصَحَاؤُهُ وَأَوْلِيَاؤُهُ فَيَنْظُرُوا الَّذِي هُوَ خَيْرٌ لَهُ‏.‏ وَكَانَ طَاوُسٌ إِذَا سُئِلَ عَنْ شَىْءٍ مِنْ أَمْرِ الْيَتَامَى قَرَأَ ‏{‏وَاللَّهُ يَعْلَمُ الْمُفْسِدَ مِنَ الْمُصْلِحِ‏}‏‏.‏ وَقَالَ عَطَاءٌ فِي يَتَامَى الصَّغِيرُ وَالْكَبِيرُ يُنْفِقُ الْوَلِيُّ عَلَى كُلِّ إِنْسَانٍ بِقَدْرِهِ مِنْ حِصَّتِهِ‏.‏",
    "malay_translation": "\"Ibn 'Umar tidak pernah menolak untuk dilantik sebagai penjaga.\"  Yang paling disukai oleh Ibn Sirin berkenaan harta anak yatim ialah berkumpulnya penasihat dan wali anak yatim untuk memutuskan apa yang terbaik untuknya. Apabila Tawus ditanya mengenai sesuatu berkaitan urusan anak yatim, beliau akan membaca,  '...dan Allah mengetahui orang yang berniat jahat daripada orang yang berniat baik...' (Surah Al-Baqarah, ayat 220). 'Ata' berkata mengenai anak yatim, \"Penjaga perlu menyediakan keperluan anak yatim kecil dan besar mengikut keperluan masing-masing daripada bahagian mereka.\""
  },
  {
    "id": 2656,
    "hadith_number": 2656,
    "tajuk_hadith": "Pengabdian Anas bin Malik Kepada Rasulullah SAW",
    "perawi_melayu": "Anas bin Malik رضي الله عنه",
    "english_text": "When Allah's Messenger (ﷺ) came to Medina; he did not have any servant. Abu Talha (Anas' step-father) \ntook me to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Anas is a wise boy, so let him serve you.\" \nSo, I served him at home and on journeys. If I did anything, he never asked me why I did it, and if I \nrefrained from doing anything, he never asked me why I refrained from doing it.",
    "arabic_text": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ كَثِيرٍ، حَدَّثَنَا ابْنُ عُلَيَّةَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ لَيْسَ لَهُ خَادِمٌ، فَأَخَذَ أَبُو طَلْحَةَ بِيَدِي، فَانْطَلَقَ بِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أَنَسًا غُلاَمٌ كَيِّسٌ، فَلْيَخْدُمْكَ‏.‏ قَالَ فَخَدَمْتُهُ فِي السَّفَرِ وَالْحَضَرِ، مَا قَالَ لِي لِشَىْءٍ صَنَعْتُهُ لِمَ صَنَعْتَ هَذَا هَكَذَا وَلاَ لِشَىْءٍ لَمْ أَصْنَعْهُ لِمَ لَمْ تَصْنَعْ هَذَا هَكَذَا",
    "malay_translation": "Ketika Rasulullah SAW tiba di Madinah, baginda tidak mempunyai hamba. Abu Talhah (bapa tirinya Anas) membawa saya kepada Rasulullah SAW dan berkata, \"Wahai Rasulullah, Anas adalah seorang anak muda yang bijaksana, jadi biarkan dia melayani tuan.\"  Lalu, saya melayani baginda di rumah dan ketika bepergian. Jika saya melakukan sesuatu, baginda tidak pernah bertanya mengapa saya melakukannya, dan jika saya tidak melakukan sesuatu, baginda tidak pernah bertanya mengapa saya tidak melakukannya."
  },
  {
    "id": 2657,
    "hadith_number": 2657,
    "tajuk_hadith": "Keutamaan Bersedekah Harta yang Disayangi dan Pembahagiannya Kepada Kerabat",
    "perawi_melayu": "Diceritakan oleh Anas bin Malik:",
    "english_text": "Abu Talha had the greatest wealth of date-palms amongst the Ansar in Medina, and he prized above all his wealth (his garden) Bairuha', which was situated opposite the Mosque (of the Prophet (ﷺ) ). The Prophet used to enter It and drink from its fresh water. When the following Divine Verse came:-- \"By no means shall you attain piety until you spend of what you love,\" (3.92) Abu Talha got up saying. \"O Allah's Messenger (ﷺ)! Allah says, 'You will not attain piety until you spend of what you love,' and I prize above all my wealth, Bairuha' which I want to give in charity for Allah's Sake, hoping for its reward from Allah. So you can use it as Allah directs you.\" On that the Prophet (ﷺ) said, \"Bravo! It is a profitable (or perishable) property. (Ibn Maslama is not sure as to which word is right, i.e. profitable or perishable.) I have heard what you have said, and I recommend that you distribute this amongst your relatives.\" On that Abu Talha said, \"O Allah's Messenger (ﷺ)! I will do (as you have suggested).\" So, Abu Talha distributed that garden amongst his relatives and cousins.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ يَقُولُ كَانَ أَبُو طَلْحَةَ أَكْثَرَ أَنْصَارِيٍّ بِالْمَدِينَةِ مَالاً مِنْ نَخْلٍ، وَكَانَ أَحَبُّ مَالِهِ إِلَيْهِ بَيْرَحَاءَ مُسْتَقْبِلَةَ الْمَسْجِدِ، وَكَانَ النَّبِيُّ صلى الله عليه وسلم يَدْخُلُهَا وَيَشْرَبُ مِنْ مَاءٍ فِيهَا طَيِّبٍ‏.‏ قَالَ أَنَسٌ فَلَمَّا نَزَلَتْ ‏{‏لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ‏}‏ قَامَ أَبُو طَلْحَةَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ يَقُولُ ‏{‏لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ‏}‏ وَإِنَّ أَحَبَّ أَمْوَالِي إِلَىَّ بِيرُحَاءَ، وَإِنَّهَا صَدَقَةٌ لِلَّهِ أَرْجُو بِرَّهَا وَذُخْرَهَا عِنْدَ اللَّهِ، فَضَعْهَا حَيْثُ أَرَاكَ اللَّهُ‏.‏ فَقَالَ ‏\"‏ بَخْ، ذَلِكَ مَالٌ رَابِحٌ ـ أَوْ رَايِحٌ ـ شَكَّ ابْنُ مَسْلَمَةَ وَقَدْ سَمِعْتُ مَا قُلْتَ، وَإِنِّي أَرَى أَنْ تَجْعَلَهَا فِي الأَقْرَبِينَ ‏\"‏‏.‏ قَالَ أَبُو طَلْحَةَ أَفْعَلُ ذَلِكَ يَا رَسُولَ اللَّهِ‏.‏ فَقَسَمَهَا أَبُو طَلْحَةَ فِي أَقَارِبِهِ وَفِي بَنِي عَمِّهِ‏.‏ وَقَالَ إِسْمَاعِيلُ وَعَبْدُ اللَّهِ بْنُ يُوسُفَ وَيَحْيَى بْنُ يَحْيَى عَنْ مَالِكٍ ‏\"‏ رَايِحٌ ‏\"‏‏.‏",
    "malay_translation": "Diceritakan bahawa Abu Talha, antara orang Ansar yang paling kaya di Madinah, memiliki kebun kurma yang amat berharga, iaitu Bairuha', yang terletak di hadapan Masjid Nabi. Baginda Rasulullah SAW sering mengunjungi dan menikmati airnya yang segar.  Ketika ayat suci berikut turun, \"Demi tiada sekali-kali kamu mencapai kebaikan (ketakwaan) sehingga kamu membelanjakan dari apa yang kamu sayangi,\" (3.92), Abu Talha berdiri dan berkata, \"Wahai Rasulullah! Allah berfirman, 'Kamu tidak akan mencapai ketakwaan melainkan dengan membelanjakan dari apa yang kamu sayangi.' Dan kebun kurma Bairuha' adalah harta yang paling aku sayangi. Aku ingin bersedekahkannya untuk Allah, berharap ganjaran-Nya.  Tempatkanlah ia sebagaimana yang Allah kehendaki.\"\" Baginda Rasulullah SAW menjawab, \"Bagus! Ini adalah harta yang menguntungkan (atau akan habis). (Ibn Maslama tidak pasti sama ada menguntungkan atau akan habis).  Aku telah mendengar apa yang kamu katakan, dan aku menasihati agar kamu membagikannya kepada kerabatmu.\" Abu Talha menjawab, \"Wahai Rasulullah! Aku akan melakukannya.\"  Lalu, Abu Talha membagi-bagikan kebun kurmanya kepada kerabat dan saudara-saudaranya."
  },
  {
    "id": 2658,
    "hadith_number": 2658,
    "tajuk_hadith": "Keberkatan Sedekah Bagi Ibu yang Telah Meninggal",
    "perawi_melayu": "Dikisahkan oleh Ibn `Abbas:",
    "english_text": "A man said to Allah's Messenger (ﷺ) , \"My mother died, will it benefit her if I give in charity on her behalf?\" \nThe Prophet (ﷺ) replied in the affirmative. The man said, \"I have a garden and I make you a witness that I \ngive it in charity on her behalf.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ إِسْحَاقَ، قَالَ حَدَّثَنِي عَمْرُو بْنُ دِينَارٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما أَنَّ رَجُلاً، قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِنَّ أُمَّهُ تُوُفِّيَتْ أَيَنْفَعُهَا إِنْ تَصَدَّقْتُ عَنْهَا قَالَ ‏\n\"‏ نَعَمْ ‏\"‏‏.‏ قَالَ فَإِنَّ لِي مِخْرَافًا وَأُشْهِدُكَ أَنِّي قَدْ تَصَدَّقْتُ عَنْهَا‏.‏",
    "malay_translation": "Seseorang lelaki bertanya kepada Rasulullah SAW, \"Ibu saya telah meninggal dunia, adakah ia memberi manfaat kepadanya sekiranya saya bersedekah atas namanya?\" Nabi SAW menjawab, \"Ya.\" Lelaki itu berkata, \"Saya mempunyai sebuah kebun dan saya saksikan kepada Anda bahawa saya telah bersedekah atas namanya."
  },
  {
    "id": 2659,
    "hadith_number": 2659,
    "tajuk_hadith": "Permintaan Harga Tanah untuk Masjid",
    "perawi_melayu": "Dikisahkan oleh Anas bin Malik:",
    "english_text": "When the Prophet (ﷺ) ordered that the mosque be built, he said, \"O Bani An-Najjar! Suggest to me a price \nfor this garden of yours.\" They replied, \"By Allah! We will demand its price from none but Allah.\"",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ أَبِي التَّيَّاحِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ أَمَرَ النَّبِيُّ صلى الله عليه وسلم بِبِنَاءِ الْمَسْجِدِ فَقَالَ ‏\n\"‏ يَا بَنِي النَّجَّارِ ثَامِنُونِي بِحَائِطِكُمْ هَذَا ‏\"‏‏.‏ قَالُوا لاَ‏.‏ وَاللَّهِ لاَ نَطْلُبُ ثَمَنَهُ إِلاَّ إِلَى اللَّهِ‏.‏",
    "malay_translation": "Apabila Rasulullah SAW memerintahkan pembinaan masjid, baginda bersabda, \"Wahai Bani An-Najjar, beritahukan kepada saya harga kebun kamu ini.\" Mereka menjawab, \"Demi Allah! Kami tidak akan meminta harganya melainkan daripada Allah semata-mata.\""
  },
  {
    "id": 2660,
    "hadith_number": 2660,
    "tajuk_hadith": "Penggunaan Tanah Khaibar Sebagai Wakaf",
    "perawi_melayu": "Diceritakan oleh Ibnu Umar:",
    "english_text": "When `Umar got a piece of land in Khaibar, he came to the Prophet (ﷺ) saying, \"I have got a piece of \nland, better than which I have never got. So what do you advise me regarding it?\" The Prophet (ﷺ) said, \n\"If you wish you can keep it as an endowment to be used for charitable purposes.\" So, `Umar gave the \nland in charity (i.e. as an endowments on the condition that the land would neither be sold nor given \nas a present, nor bequeathed, (and its yield) would be used for the poor, the kinsmen, the emancipation \nof slaves, Jihad, and for guests and travelers; and its administrator could eat in a reasonable just \nmanner, and he also could feed his friends without intending to be wealthy by its means.\"",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ أَصَابَ عُمَرُ بِخَيْبَرَ أَرْضًا فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ أَصَبْتُ أَرْضًا لَمْ أُصِبْ مَالاً قَطُّ أَنْفَسَ مِنْهُ، فَكَيْفَ تَأْمُرُنِي بِهِ قَالَ ‏\n\"‏ إِنْ شِئْتَ حَبَّسْتَ أَصْلَهَا، وَتَصَدَّقْتَ بِهَا ‏\"‏‏.‏ فَتَصَدَّقَ عُمَرُ أَنَّهُ لاَ يُبَاعُ أَصْلُهَا وَلاَ يُوهَبُ وَلاَ يُورَثُ، فِي الْفُقَرَاءِ وَالْقُرْبَى وَالرِّقَابِ وَفِي سَبِيلِ اللَّهِ وَالضَّيْفِ وَابْنِ السَّبِيلِ، وَلاَ جُنَاحَ عَلَى مَنْ وَلِيَهَا أَنْ يَأْكُلَ مِنْهَا بِالْمَعْرُوفِ، أَوْ يُطْعِمَ صَدِيقًا غَيْرَ مُتَمَوِّلٍ فِيهِ‏.‏",
    "malay_translation": "Ketika `Umar memperoleh sebidang tanah di Khaibar, beliau datang kepada Rasulullah SAW dan berkata, \"Saya telah memperoleh sebidang tanah yang lebih baik daripada harta yang pernah saya miliki. Apakah nasihat baginda tentangnya?\" Rasulullah SAW bersabda, \"Jika engkau mahu, engkau boleh menjadikan tanah itu sebagai wakaf untuk tujuan kebajikan.\" Lalu `Umar berwakafkan tanah itu dengan syarat tanah tersebut tidak boleh dijual, dihadiahkan, atau diwariskan.  Hasil tanah itu akan digunakan untuk fakir miskin, kerabat, membebaskan hamba, jihad, tetamu dan musafir.  Tidak mengapa bagi penjaga wakaf untuk makan daripadanya secara berpatutan dan memberi makan kepada teman-temannya tanpa berniat untuk menjadi kaya daripadanya."
  },
  {
    "id": 2661,
    "hadith_number": 2661,
    "tajuk_hadith": "Umar bin al-Khattab dan Sedekah Harta Khaibar",
    "perawi_melayu": "Diceritakan oleh Ibn `Umar:",
    "english_text": "`Umar mendapat beberapa harta di Khaibar dan dia datang kepada Nabi (ﷺ) dan memberitahunya mengenainya. Nabi bersabda kepadanya, \"Jika engkau mahu, engkau boleh mendermakannya.\" Maka `Umar mendermakannya (iaitu sebagai wakaf) yang hasilnya akan digunakan untuk kebajikan orang miskin, orang susah, kaum kerabat dan tetamu.",
    "arabic_text": "حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عُمَرَ، رضى الله عنه وَجَدَ مَالاً بِخَيْبَرَ، فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَأَخْبَرَهُ، قَالَ ‏\n\"‏ إِنْ شِئْتَ تَصَدَّقْتَ بِهَا ‏\"‏‏.‏ فَتَصَدَّقَ بِهَا فِي الْفُقَرَاءِ وَالْمَسَاكِينِ وَذِي الْقُرْبَى وَالضَّيْفِ‏.‏",
    "malay_translation": "`Umar mendapat beberapa harta di Khaibar, dan baginda datang kepada Nabi (ﷺ) dan memberitahu tentang hal itu. Nabi bersabda kepadanya, \"Jika engkau mahu, engkau boleh mendermakannya.\" Maka `Umar mendermakannya (iaitu sebagai wakaf), hasil daripada wakaf itu akan diagihkan kepada golongan fakir miskin, orang susah, ahli keluarga dan tetamu."
  },
  {
    "id": 2662,
    "hadith_number": 2662,
    "tajuk_hadith": "Perintah Rasulullah SAW Membina Masjid dan Sikap Bani Najjar",
    "perawi_melayu": "Diceritakan oleh Anas bin Malik:",
    "english_text": "When Allah's Messenger (ﷺ) came to Medina, he ordered that a mosque be built. He said, \"O Bani An- \nNajjar! Suggest me a price for the garden of yours.\" They replied, \"By Allah, we will not ask its price \nexcept from Allah.\"",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا عَبْدُ الصَّمَدِ، قَالَ سَمِعْتُ أَبِي، حَدَّثَنَا أَبُو التَّيَّاحِ، قَالَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ لَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ أَمَرَ بِالْمَسْجِدِ وَقَالَ ‏\n\"‏ يَا بَنِي النَّجَّارِ ثَامِنُونِي بِحَائِطِكُمْ هَذَا ‏\"‏‏.‏ قَالُوا لاَ وَاللَّهِ لاَ نَطْلُبُ ثَمَنَهُ إِلاَّ إِلَى اللَّهِ‏.‏",
    "malay_translation": "Apabila Rasulullah SAW datang ke Madinah, baginda memerintahkan pembinaan sebuah masjid. Baginda bersabda, \"Wahai Bani An-Najjar! Berikan aku cadangan harga untuk taman kamu.\" Mereka menjawab, \"Demi Allah, kami tidak akan meminta harganya melainkan dari Allah.\" "
  },
  {
    "id": 2663,
    "hadith_number": 2663,
    "tajuk_hadith": "Larangan Membeli Kembali Sebarang Sedekah",
    "perawi_melayu": "Diceritakan oleh Ibnu Umar:",
    "english_text": "Once `Umar gave a horse in charity to be used in holy fighting. It had been given to him by Allah's \nApostle . `Umar gave it to another man to ride. Then `Umar was informed that the man put the horse \nfor sale, so he asked Allah's Messenger (ﷺ) whether he could buy it. Allah's Messenger (ﷺ) replied, \"You should not \nbuy it, for you should not take back what you have given in charity.\"",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، حَدَّثَنَا عُبَيْدُ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ عُمَرَ، حَمَلَ عَلَى فَرَسٍ لَهُ فِي سَبِيلِ اللَّهِ أَعْطَاهَا رَسُولَ اللَّهِ صلى الله عليه وسلم لِيَحْمِلَ عَلَيْهَا رَجُلاً، فَأُخْبِرَ عُمَرُ أَنَّهُ قَدْ وَقَفَهَا يَبِيعُهَا، فَسَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنْ يَبْتَاعَهَا فَقَالَ ‏\n\"‏ لاَ تَبْتَعْهَا، وَلاَ تَرْجِعَنَّ فِي صَدَقَتِكَ ‏\"‏‏.‏",
    "malay_translation": "Suatu ketika, `Umar menderma seekor kuda untuk berperang di jalan Allah. Kuda tersebut diberikan kepadanya oleh Rasulullah. `Umar kemudian menyerahkan kuda itu kepada seorang lelaki untuk menungganginya. Kemudian, `Umar diberitahu bahawa lelaki tersebut telah meletakkan kuda itu untuk dijual. Lalu, `Umar bertanya kepada Rasulullah SAW apakah beliau boleh membelinya. Rasulullah SAW menjawab, \"Jangan beli. Jangan mengambil kembali sedekah yang telah engkau berikan.\" "
  },
  {
    "id": 2664,
    "hadith_number": 2664,
    "tajuk_hadith": "Pewarisan Rasulullah SAW dan Sedekah",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "Pesuruh Allah (ﷺ) bersabda, \"Pewaris-warisku tidak akan mewarisi Dinar atau Dirham (iaitu wang), kerana apa yang aku tinggalkan (kecuali nafkah isteri-isteriku dan upah pekerja-pekerjaku) adalah sedekah.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَقْتَسِمْ وَرَثَتِي دِينَارًا، مَا تَرَكْتُ بَعْدَ نَفَقَةِ نِسَائِي وَمَئُونَةِ عَامِلِي فَهْوَ صَدَقَةٌ ‏\"‏‏.‏",
    "malay_translation": "Pesuruh Allah (ﷺ) bersabda, \"Pewaris-warisku tidak akan mewarisi Dinar atau Dirham (iaitu wang), kerana apa yang aku tinggalkan (kecuali nafkah isteri-isteriku dan upah pekerja-pekerjaku) adalah sedekah.\""
  },
  {
    "id": 2665,
    "hadith_number": 2665,
    "tajuk_hadith": "Syarat Wakaf Khalifah Umar Al-Khattab",
    "perawi_melayu": "Dikisahkan oleh Ibn `Umar:",
    "english_text": "When `Umar founded an endowment he stipulated that its administrator could eat from it and also\nfeed his friend on the condition that he would not store anything for himself from it.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ عُمَرَ، اشْتَرَطَ فِي وَقْفِهِ أَنْ يَأْكُلَ مَنْ وَلِيَهُ وَيُوكِلَ صَدِيقَهُ غَيْرَ مُتَمَوِّلٍ مَالاً‏.‏",
    "malay_translation": "Apabila `Umar mendirikan wakaf, beliau mensyaratkan bahawa pentadbir wakaf tersebut boleh makan daripadanya dan juga memberi makan kepada kawannya dengan syarat pentadbir tersebut tidak menyimpan sebarang harta untuk dirinya sendiri daripada wakaf tersebut."
  },
  {
    "id": 2666,
    "hadith_number": 2666,
    "tajuk_hadith": "Jannah Bagi Yang Menggalakkan Pasukan dan Mengorek Perigi Ruma",
    "perawi_melayu": "Abu 'Abdur-Rahman meriwayatkan:",
    "english_text": "When 'Uthman (ra) was circled (by the rebels), he looked upon them from above and said, \"I swear to Allah, I ask no one but the Companions of the Prophet (ﷺ), don't you know that Allah's Messenger (ﷺ) said, 'Whoever will (buy and) dig the well of Ruma will be granted Paradise,' and I (bought and) dug it? Don't you know that he said. 'Whoever equip the army of 'Usra (i.e., Tabuk's Ghazwa) will be granted Paradise,' and I equipped it ?\" They attested whatever he said.\nWhen 'Umar founded his endowment he said, \"Its administrator can eat from it.\" The management of the endowment can be taken over by the founder himself or any other person, for both cases are permissible.",
    "arabic_text": "وَقَالَ عَبْدَانُ أَخْبَرَنِي أَبِي، عَنْ شُعْبَةَ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّ عُثْمَانَ ـ رضى الله عنه ـ حَيْثُ حُوصِرَ أَشْرَفَ عَلَيْهِمْ وَقَالَ أَنْشُدُكُمْ وَلاَ أَنْشُدُ إِلاَّ أَصْحَابَ النَّبِيِّ صلى الله عليه وسلم، أَلَسْتُمْ تَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ حَفَرَ رُومَةَ فَلَهُ الْجَنَّةُ ‏\"‏‏.‏ فَحَفَرْتُهَا، أَلَسْتُمْ تَعْلَمُونَ أَنَّهُ قَالَ ‏\"‏ مَنْ جَهَّزَ جَيْشَ الْعُسْرَةِ فَلَهُ الْجَنَّةُ ‏\"‏‏.‏ فَجَهَّزْتُهُمْ‏.‏ قَالَ فَصَدَّقُوهُ بِمَا قَالَ‏.‏ وَقَالَ عُمَرُ فِي وَقْفِهِ لاَ جُنَاحَ عَلَى مَنْ وَلِيَهُ أَنْ يَأْكُلَ‏.‏ وَقَدْ يَلِيهِ الْوَاقِفُ وَغَيْرُهُ فَهْوَ وَاسِعٌ لِكُلٍّ‏.‏",
    "malay_translation": "Telah meriwayatkan Abu 'Abdur-Rahman bahawa apabila 'Uthman bin Affan (رضي الله عنه) dikepung, beliau melihat mereka dari atas dan berkata, \"Aku bersumpah dengan Allah, aku tidak bertanya kepada sesiapa melainkan sahabat-sahabat Nabi (ﷺ), tidakkah kamu mengetahui bahawa Rasulullah (ﷺ) bersabda, 'Barangsiapa yang menggali perigi Ruma, maka baginya Syurga,' dan aku telah menggali perigi itu? Tidakkah kamu mengetahui bahawa baginda bersabda, 'Barangsiapa yang menyediakan pasukan 'Usra (iaitu Ghazwah Tabuk), maka baginya Syurga,' dan aku telah menyediakan mereka?\" Maka mereka membenarkan apa yang dikatakannya.\nKemudian, 'Umar bin Al-Khattab (رضي الله عنه) dalam wasiatnya berkata, \"Tiada dosa bagi yang menguruskan wakaf ini untuk makan daripadanya.\"  Pengurusan wakaf boleh diuruskan oleh pendiri wakaf sendiri atau orang lain, kerana kedua-dua cara adalah dibolehkan."
  },
  {
    "id": 2667,
    "hadith_number": 2667,
    "tajuk_hadith": "Cadangan Harga Taman Daripada Bani Najjar Kepada Nabi SAW",
    "perawi_melayu": "Dikisahkan oleh Anas bin Malik:",
    "english_text": "The Prophet (ﷺ) said (at the time of building the Mosque), \"O Ban, An-Najjar! Suggest to me a price for \nyour garden.\" They replied, \"We do not ask its price except from Allah.\"",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ أَبِي التَّيَّاحِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ يَا بَنِي النَّجَّارِ ثَامِنُونِي بِحَائِطِكُمْ ‏\"‏‏.‏ قَالُوا لاَ نَطْلُبُ ثَمَنَهُ إِلاَّ إِلَى اللَّهِ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda (pada masa pembinaan Masjid), \"Wahai Bani Najjar! Cadangkan harga untuk taman kamu.\" Mereka menjawab, \"Kami tidak meminta harga selain daripada Allah.\" "
  },
  {
    "id": 2668,
    "hadith_number": 2668,
    "tajuk_hadith": "Kisah Mangsa Maut Tanpa Muslim dan Pemulangan Harta Pusaka",
    "perawi_melayu": "Ibn 'Abbas (رضي الله عنهما)",
    "english_text": "Ibn 'Abbas (ra) said, \"A man from the tribe of Bani Sahm went out in the company of Tamim Ad-Dari and 'Adi bin Badda'. The man of Bani Sahm died in a land where there was no Muslim. When Tamim and 'Adi returned conveying the property of the deceased, they claimed that they had lost a silver bowl with gold engraving. Allah's Messenger (ﷺ) made them take an oath (to confirm their claim), and then the bowl was found in Makkah with some people who claimed that they had bought it from Tamim and 'Adu, Then two witnesses from the relatives of the deceased got up and swore that their witnesses were more valid than the witnesses of  'Adi and Tamim, and that the bowl belonged to their deceased fellow. So, this verse was revealed in connection with this case ; 'O you who believe! When death approached any of you ...',\" (V 5:106)",
    "arabic_text": "وَقَالَ لِي عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، عَنْ مُحَمَّدِ بْنِ أَبِي الْقَاسِمِ، عَنْ عَبْدِ الْمَلِكِ بْنِ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ خَرَجَ رَجُلٌ مِنْ بَنِي سَهْمٍ مَعَ تَمِيمٍ الدَّارِيِّ وَعَدِيِّ بْنِ بَدَّاءٍ فَمَاتَ السَّهْمِيُّ بِأَرْضٍ لَيْسَ بِهَا مُسْلِمٌ، فَلَمَّا قَدِمَا بِتَرِكَتِهِ فَقَدُوا جَامًا مِنْ فِضَّةٍ مُخَوَّصًا مِنْ ذَهَبٍ، فَأَحْلَفَهُمَا رَسُولُ اللَّهِ صلى الله عليه وسلم، ثُمَّ وُجِدَ الْجَامُ بِمَكَّةَ فَقَالُوا ابْتَعْنَاهُ مِنْ تَمِيمٍ وَعَدِيٍّ‏.‏ فَقَامَ رَجُلاَنِ مِنْ أَوْلِيَائِهِ، فَحَلَفَا لَشَهَادَتُنَا أَحَقُّ مِنْ شَهَادَتِهِمَا، وَإِنَّ الْجَامَ لِصَاحِبِهِمْ‏.‏ قَالَ وَفِيهِمْ نَزَلَتْ هَذِهِ الآيَةُ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا شَهَادَةُ بَيْنِكُمْ ‏إِذَا حَضَرَ أَحَدَكُمُ الْمَوْتُ}‏",
    "malay_translation": "Ibnu 'Abbas (رضي الله عنهما) berkata, \"Seorang lelaki daripada kaum Bani Sahm keluar bersama Tamim Ad-Dari dan 'Adi bin Badda'. Lelaki Bani Sahm itu meninggal dunia di sebuah negeri yang tidak terdapat Muslim. Apabila Tamim dan 'Adi pulang membawa harta pusaka yang ditinggalkan, mereka mendakwa kehilangan sebuah mangkuk perak yang diukir emas. Rasulullah SAW mengisytiharkan sumpah kepada mereka untuk mengesahkan dakwaan mereka, kemudian mangkuk tersebut ditemui di Mekah dengan sebilangan orang yang mendakwa membelinya daripada Tamim dan 'Adi. Kemudian, dua orang saksi daripada ahli keluarga orang yang meninggal tampil dan bersumpah bahawa kesaksian mereka lebih sah daripada kesaksian Tamim dan 'Adi, dan bahawa mangkuk itu kepunyaan saudara mereka yang telah meninggal dunia. Ayat ini diturunkan berkaitan dengan kejadian tersebut: 'Wahai orang-orang yang beriman!  Apabila kematian hampir menghampiri mana-mana dari kamu...'\" (Surah Al-Ma'idah, Ayat 106)."
  },
  {
    "id": 2669,
    "hadith_number": 2669,
    "tajuk_hadith": "Pembayaran Hutang Bapa Yang Syahid dan Kebajikan Nabi SAW",
    "perawi_melayu": "Diceritakan oleh Jabir bin `Abdullah Al-Ansari:",
    "english_text": "My father was martyred on the day (of the Ghazwa) of Uhud and left six daughters and some debts to \nbe paid. When the time of plucking the date-fruits came, I went to Allah's Messenger (ﷺ) and said, \"O Allah's \nApostle! you know that my father was martyred on Uhud's day and owed much debt, and I wish that \nthe creditors would see you.\" The Prophet (ﷺ) said, \"Go and collect the various kinds of dates and place \nthem separately in heaps\"' I did accordingly and called him. On seeing him, the creditors started \nclaiming their rights pressingly at that time. When the Prophet (ﷺ) saw how they behaved, he went round \nthe biggest heap for three times and sat over it and said, \"Call your companions (i.e. the creditors).\" \nThen he kept on measuring and giving them, till Allah cleared all my father's debts. By Allah, it would \nhave pleased me that Allah would clear the debts of my father even though I had not taken a single \ndate to my sisters. But by Allah, all the heaps were complete, (as they were) and I looked at the heap \nwhere Allah's Messenger (ﷺ) was sitting and noticed as if not a single date had been taken thereof.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سَابِقٍ، أَوِ الْفَضْلُ بْنُ يَعْقُوبَ عَنْهُ حَدَّثَنَا شَيْبَانُ أَبُو مُعَاوِيَةَ، عَنْ فِرَاسٍ، قَالَ قَالَ الشَّعْبِيُّ حَدَّثَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ ـ رضى الله عنهما ـ أَنَّ أَبَاهُ اسْتُشْهِدَ يَوْمَ أُحُدٍ، وَتَرَكَ سِتَّ بَنَاتٍ، وَتَرَكَ عَلَيْهِ دَيْنًا، فَلَمَّا حَضَرَ جِدَادُ النَّخْلِ أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ قَدْ عَلِمْتَ أَنَّ وَالِدِي اسْتُشْهِدَ يَوْمَ أُحُدٍ وَتَرَكَ عَلَيْهِ دَيْنًا كَثِيرًا، وَإِنِّي أُحِبُّ أَنْ يَرَاكَ الْغُرَمَاءُ قَالَ ‏\"‏ اذْهَبْ فَبَيْدِرْ كُلَّ تَمْرٍ عَلَى نَاحِيَتِهِ ‏\"‏‏.‏ فَفَعَلْتُ ثُمَّ دَعَوْتُهُ، فَلَمَّا نَظَرُوا إِلَيْهِ أُغْرُوا بِي تِلْكَ السَّاعَةَ، فَلَمَّا رَأَى مَا يَصْنَعُونَ أَطَافَ حَوْلَ أَعْظَمِهَا بَيْدَرًا ثَلاَثَ مَرَّاتٍ ثُمَّ جَلَسَ عَلَيْهِ ثُمَّ قَالَ ‏\"‏ ادْعُ أَصْحَابَكَ ‏\"‏‏.‏ فَمَا زَالَ يَكِيلُ لَهُمْ حَتَّى أَدَّى اللَّهُ أَمَانَةَ وَالِدِي، وَأَنَا وَاللَّهِ رَاضٍ أَنْ يُؤَدِّيَ اللَّهُ أَمَانَةَ وَالِدِي وَلاَ أَرْجِعَ إِلَى أَخَوَاتِي بِتَمْرَةٍ، فَسَلِمَ وَاللَّهِ الْبَيَادِرُ كُلُّهَا حَتَّى أَنِّي أَنْظُرُ إِلَى الْبَيْدَرِ الَّذِي عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم كَأَنَّهُ لَمْ يَنْقُصْ تَمْرَةً وَاحِدَةً‏.‏   \nقَالَ أَبُو عَبْد اللَّهِ أُغْرُوا بِي يَعْنِي هِيجُوا بِي  فَأَغْرَيْنَا بَيْنَهُمْ الْعَدَاوَةَ وَالْبَغْضَاءَ",
    "malay_translation": "Kisah tentang seorang ayah yang syahid pada Perang Uhud dan meninggalkan enam orang anak perempuan serta hutang. Apabila tiba musim menuai buah kurma, beliau menemui Rasulullah SAW dan menceritakan kesusahannya. Baginda SAW kemudian memberikan arahan untuk mengumpulkan pelbagai jenis kurma dan menaruhnya secara berasingan dalam timbunan. Beliau melakukan seperti yang diarahkan dan memanggil para pemberi hutang.  Apabila para pemberi hutang melihat Rasulullah SAW, mereka meminta hak mereka segera. Melihat keadaan itu, Rasulullah SAW mengitari timbunan kurma yang terbesar sebanyak tiga kali, duduk di atasnya dan memanggil para pemberi hutang. Kemudian, baginda terus mengukur dan memberikan kurma kepada mereka sehingga semua hutang ayah beliau dijelaskan oleh Allah SWT. Demi Allah, saya rela hutang ayah saya dijelaskan meskipun saya tidak memberikan sebutir kurma pun kepada adik-adik perempuan saya.  Alhamdulillah, semua timbunan kurma tetap lengkap. Saya melihat timbunan di mana Rasulullah SAW duduk, seolah-olah tiada sebutir kurma pun yang diambil darinya."
  }
]