[
  {
    "id": 6173,
    "hadith_number": 6173,
    "tajuk_hadith": "Nikmat Sihat dan Masa Lapang",
    "perawi_melayu": "Riwayat Ibnu Abbas",
    "english_text": "The Prophet (ﷺ) said: \"There are two blessings that many people are deceived into losing: health and free time.\"",
    "arabic_text": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ ـ هُوَ ابْنُ أَبِي هِنْدٍ ـ عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ نِعْمَتَانِ مَغْبُونٌ فِيهِمَا كَثِيرٌ مِنَ النَّاسِ، الصِّحَّةُ وَالْفَرَاغُ ‏\"‏‏.‏\nقَالَ عَبَّاسٌ الْعَنْبَرِيُّ حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى، عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ أَبِي هِنْدٍ، عَنْ أَبِيهِ، سَمِعْتُ ابْنَ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Dua nikmat yang sering disia-siakan oleh kebanyakan manusia ialah kesihatan dan masa lapang.\""
  },
  {
    "id": 6174,
    "hadith_number": 6174,
    "tajuk_hadith": "Kehidupan Akhirat dan Doa untuk Ansar dan Muhajirin",
    "perawi_melayu": "Anas meriwayatkan:",
    "english_text": "The Prophet (ﷺ) said, \"O Allah! There is no life worth living except the life of the Hereafter, so (please) \nmake righteous the Ansar and the Emigrants.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ اللَّهُمَّ لاَ عَيْشَ إِلاَّ عَيْشُ الآخِرَة، فَأَصْلِحِ الأَنْصَارَ وَالْمُهَاجِرَة ‏\"‏‏.‏",
    "malay_translation": "Nabi SAW bersabda: \"Ya Allah, tidak ada kehidupan yang bernilai kecuali kehidupan akhirat. Oleh itu, perbaikilah keadaan orang-orang Ansar dan Muhajirin.\""
  },
  {
    "id": 6175,
    "hadith_number": 6175,
    "tajuk_hadith": "Doa Rasulullah SAW di Perang Khandaq",
    "perawi_melayu": "Riwayat Sahl bin Sa'd As-Sa'idi:",
    "english_text": "We were in the company of Allah's Messenger (ﷺ) in (the battle of) Al-Khandaq, and he was digging the \ntrench while we were carrying the earth away. He looked at us and said, \"O Allah! There is no life \nworth living except the life of the Hereafter, so (please) forgive the Ansar and the Emigrants.\"",
    "arabic_text": "حَدَّثَنِي أَحْمَدُ بْنُ الْمِقْدَامِ، حَدَّثَنَا الْفُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنَا أَبُو حَازِمٍ، حَدَّثَنَا سَهْلُ بْنُ سَعْدٍ السَّاعِدِيُّ، كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الْخَنْدَقِ وَهْوَ يَحْفِرُ وَنَحْنُ نَنْقُلُ التُّرَابَ وَيَمُرُّ بِنَا فَقَالَ ‏\n\"‏ اللَّهُمَّ لاَ عَيْشَ إِلاَّ عَيْشُ الآخِرَهْ، فَاغْفِرْ لِلأَنْصَارِ وَالْمُهَاجِرَهْ ‏\"‏‏.‏ تَابَعَهُ سَهْلُ بْنُ سَعْدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ‏.‏",
    "malay_translation": "Kami berada bersama Rasulullah SAW semasa Perang Khandaq. Baginda menggali parit, manakala kami memindahkan tanah. Baginda memandang kami dan berdoa, \"Ya Allah, tiada kehidupan yang bernilai melainkan kehidupan akhirat. Oleh itu, ampunkanlah kaum Ansar dan Muhajirin.\""
  },
  {
    "id": 6176,
    "hadith_number": 6176,
    "tajuk_hadith": "Keutamaan Sekeping Tempat di Syurga dan Perjalanan di Jalan Allah",
    "perawi_melayu": "Daripada Sahl:",
    "english_text": "I heard the Prophet (ﷺ) saying, \"A (small) place equal to an area occupied by a whip in Paradise is better \nthan the (whole) world and whatever is in it; and an undertaking (journey) in the forenoon or in the \nafternoon for Allah's Cause, is better than the whole world and whatever is in it.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَوْضِعُ سَوْطٍ فِي الْجَنَّةِ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا، وَلَغَدْوَةٌ فِي سَبِيلِ اللَّهِ أَوْ رَوْحَةٌ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda: \"Sekeping tempat seluas tapak cambuk di syurga adalah lebih baik daripada dunia dan seisinya.  Begitu juga, perjalanan pada waktu pagi atau petang di jalan Allah adalah lebih baik daripada dunia dan seisinya.\""
  },
  {
    "id": 6177,
    "hadith_number": 6177,
    "tajuk_hadith": "Hidup di Dunia Seperti Orang Asing atau Musafir",
    "perawi_melayu": "Riwayat Mujahid:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ أَبُو الْمُنْذِرِ الطُّفَاوِيُّ، عَنْ سُلَيْمَانَ الأَعْمَشِ، قَالَ حَدَّثَنِي مُجَاهِدٌ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ أَخَذَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمَنْكِبِي فَقَالَ ‏\n\"‏ كُنْ فِي الدُّنْيَا كَأَنَّكَ غَرِيبٌ، أَوْ عَابِرُ سَبِيلٍ ‏\"‏‏.‏ وَكَانَ ابْنُ عُمَرَ يَقُولُ إِذَا أَمْسَيْتَ فَلاَ تَنْتَظِرِ الصَّبَاحَ، وَإِذَا أَصْبَحْتَ فَلاَ تَنْتَظِرِ الْمَسَاءَ، وَخُذْ مِنْ صِحَّتِكَ لِمَرَضِكَ، وَمِنْ حَيَاتِكَ لِمَوْتِكَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ali bin Abdullah, telah menceritakan kepada kami Muhammad bin Abdurrahman Abu Munzir al-Tufawi, dari Sulaiman al-A'masy, katanya; telah menceritakan kepadaku Mujahid, dari Abdullah bin Umar - semoga Allah merahmati mereka berdua - katanya: Rasulullah SAW memegang bahuku lalu bersabda: \"Hendaklah engkau di dunia ini seolah-olah engkau seorang pendatang atau orang yang sedang melalui perjalanan.\" Dan Ibnu Umar berkata: \"Apabila engkau telah sampai ke petang, janganlah engkau menantikan pagi, dan apabila engkau telah sampai ke pagi, janganlah engkau menantikan petang, dan ambillah dari kesihatanmu untuk penyakitmu, dan dari hidupmu untuk kematianmu.\""
  },
  {
    "id": 6178,
    "hadith_number": 6178,
    "tajuk_hadith": "Umur Manusia dan Musibah",
    "perawi_melayu": "Riwayat Abdullah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ، أَخْبَرَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي أَبِي، عَنْ مُنْذِرٍ، عَنْ رَبِيعِ بْنِ خُثَيْمٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ خَطَّ النَّبِيُّ صلى الله عليه وسلم خَطًّا مُرَبَّعًا، وَخَطَّ خَطًّا فِي الْوَسَطِ خَارِجًا مِنْهُ، وَخَطَّ خُطُطًا صِغَارًا إِلَى هَذَا الَّذِي فِي الْوَسَطِ، مِنْ جَانِبِهِ الَّذِي فِي الْوَسَطِ وَقَالَ ‏\n\"‏ هَذَا الإِنْسَانُ، وَهَذَا أَجَلُهُ مُحِيطٌ بِهِ ـ أَوْ قَدْ أَحَاطَ بِهِ ـ وَهَذَا الَّذِي هُوَ خَارِجٌ أَمَلُهُ، وَهَذِهِ الْخُطُطُ الصِّغَارُ الأَعْرَاضُ، فَإِنْ أَخْطَأَهُ هَذَا نَهَشَهُ هَذَا، وَإِنْ أَخْطَأَهُ هَذَا نَهَشَهُ هَذَا ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Sadakah bin al-Fazl, telah memberitakan kepada kami Yahya, dari Sufyan, dia berkata: telah menceritakan kepadaku ayahku, dari Munzir, dari Rabiah bin Khutsaim, dari Abdullah r.a., dia berkata: Nabi SAW telah melukis satu bentuk segi empat, kemudian melukis satu garis di tengahnya dan memanjangkannya di luar segi empat itu, dan kemudian melukis beberapa garis kecil yang bersambung dengan garis tengah itu, dan baginda berkata: \"Ini adalah manusia, dan ini adalah ajalnya yang melingkungi dia – atau telah melingkungi dia – dan ini yang di luar (segi empat) adalah harapannya, dan garis-garis kecil ini adalah musibah. Jika satu musibah terlepas daripadanya, musibah lain akan menimpanya, dan jika musibah itu terlepas daripadanya, musibah yang lain pula akan menimpanya.\""
  },
  {
    "id": 6179,
    "hadith_number": 6179,
    "tajuk_hadith": "Harapan dan Ajalku",
    "perawi_melayu": "Anas bin Malik meriwayatkan:",
    "english_text": "The Prophet (ﷺ) drew a few lines and said, \"This is (man's) hope, and this is the instant of his death, and \nwhile he is in this state (of hope), the nearer line (death) comes to Him.\"",
    "arabic_text": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا هَمَّامٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسٍ، قَالَ خَطَّ النَّبِيُّ صلى الله عليه وسلم خُطُوطًا فَقَالَ ‏\n\"‏ هَذَا الأَمَلُ وَهَذَا أَجَلُهُ، فَبَيْنَمَا هُوَ كَذَلِكَ إِذْ جَاءَهُ الْخَطُّ الأَقْرَبُ ‏\"‏‏.‏",
    "malay_translation": "Anas meriwayatkan bahawa Nabi SAW telah melukis beberapa garisan dan bersabda: \"Inilah harapan, dan inilah ajalnya.  Sedang dia dalam keadaan sedemikian, maka datanglah ajal yang lebih dekat.\" "
  },
  {
    "id": 6180,
    "hadith_number": 6180,
    "tajuk_hadith": "Allah Tidak Menerima Uzur Setelah Usia 60 Tahun",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \"Allah will not accept the excuse of any person whose instant of death is delayed till \nhe is sixty years of age.\"",
    "arabic_text": "حَدَّثَنِي عَبْدُ السَّلاَمِ بْنُ مُطَهَّرٍ، حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ، عَنْ مَعْنِ بْنِ مُحَمَّدٍ الْغِفَارِيِّ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ أَعْذَرَ اللَّهُ إِلَى امْرِئٍ أَخَّرَ أَجَلَهُ حَتَّى بَلَّغَهُ سِتِّينَ سَنَةً ‏\"‏‏.‏ تَابَعَهُ أَبُو حَازِمٍ وَابْنُ عَجْلاَنَ عَنِ الْمَقْبُرِيِّ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Allah SWT tidak akan menerima alasan bagi sesiapa yang ajalnya ditangguhkan sehingga mencapai usia enam puluh tahun.\""
  },
  {
    "id": 6181,
    "hadith_number": 6181,
    "tajuk_hadith": "Hati Orang Tua yang Tetap Muda",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "I heard Allah's Messenger (ﷺ) saying, \"The heart of an old man remains young in two respects, i.e., his love \nfor the world (its wealth, amusements and luxuries) and his incessant hope.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا أَبُو صَفْوَانَ عَبْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ يَزَالُ قَلْبُ الْكَبِيرِ شَابًّا فِي اثْنَتَيْنِ فِي حُبِّ الدُّنْيَا، وَطُولِ الأَمَلِ ‏\"‏‏.‏ قَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ وَابْنُ وَهْبٍ عَنْ يُونُسَ عَنِ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي سَعِيدٌ وَأَبُو سَلَمَةَ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda: \"Hati orang tua tetap muda dalam dua perkara iaitu kecintaan kepada dunia (kekayaan, hiburan dan kesenangannya) dan harapan yang panjang.\""
  },
  {
    "id": 6182,
    "hadith_number": 6182,
    "tajuk_hadith": "Kecintaan kepada Harta dan Umur Panjang",
    "perawi_melayu": "Anas bin Malik:",
    "english_text": "Allah's Messenger (ﷺ) said, \"The son of Adam (i.e. man) grows old and so also two (desires) grow old with him, i.e., love for wealth and (a wish for) a long life.\"",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَكْبَرُ ابْنُ آدَمَ وَيَكْبَرُ مَعَهُ اثْنَانِ حُبُّ الْمَالِ، وَطُولُ الْعُمُرِ ‏\"‏‏.‏ رَوَاهُ شُعْبَةُ عَنْ قَتَادَةَ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Anak Adam semakin tua, begitu juga dua (keinginan) yang semakin tua bersamanya, iaitu kecintaan kepada harta dan keinginan untuk hidup panjang.\""
  },
  {
    "id": 6183,
    "hadith_number": 6183,
    "tajuk_hadith": "Rasulullah SAW Mencurahkan Air ke Muka",
    "perawi_melayu": "Riwayat Mahmud bin Ar-Rabi'",
    "english_text": "I remember that the Allah's Messenger (ﷺ) took water from a bucket (which was in our home used for getting water out of well) with his mouth (and threw it on my face).",
    "arabic_text": "حَدَّثَنَا مُعَاذُ بْنُ أَسَدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي مَحْمُودُ بْنُ الرَّبِيعِ، وَزَعَمَ، مَحْمُودٌ أَنَّهُ عَقَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَقَالَ وَعَقَلَ مَجَّةً مَجَّهَا مِنْ دَلْوٍ كَانَتْ فِي دَارِهِمْ‏.‏",
    "malay_translation": "Aku ingat bahawa Rasulullah SAW mengambil air dari sebuah timba (yang berada di rumah kami, digunakan untuk menimba air dari perigi) dengan mulut baginda (dan memercikkannya ke muka aku)."
  },
  {
    "id": 6184,
    "hadith_number": 6184,
    "tajuk_hadith": "Janji Allah kepada Mereka yang Mengakui Keesaan-Nya",
    "perawi_melayu": "Riwayat Utban bin Malik Al-Ansari:",
    "english_text": "who was one of the men of the tribe of Bani Salim: Allah's Messenger (ﷺ) came to me and said, \"If anybody \ncomes on the Day of Resurrection who has said: La ilaha illal-lah, sincerely, with the intention to win \nAllah's Pleasure, Allah will make the Hell-Fire forbidden for him.\"",
    "arabic_text": "قَالَ سَمِعْتُ عِتْبَانَ بْنَ مَالِكٍ الأَنْصَارِيَّ، ثُمَّ أَحَدَ بَنِي سَالِمٍ قَالَ غَدَا عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ لَنْ يُوَافِيَ عَبْدٌ يَوْمَ الْقِيَامَةِ يَقُولُ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ يَبْتَغِي بِهِ وَجْهَ اللَّهِ، إِلاَّ حَرَّمَ اللَّهُ عَلَيْهِ النَّارَ ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Utban bin Malik Al-Ansari, yang juga daripada Bani Salim berkata, “Rasulullah SAW telah datang kepadaku dan bersabda:  'Sesiapa yang datang pada hari kiamat dengan mengucapkan La ilaha illallah dengan ikhlas kerana mengharapkan keredaan Allah, nescaya Allah akan mengharamkan neraka ke atasnya.'"
  },
  {
    "id": 6185,
    "hadith_number": 6185,
    "tajuk_hadith": "Ganjaran Syurga untuk Hamba yang Bersabar",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "Allah's Messenger (ﷺ) said, \"Allah says, 'I have nothing to give but Paradise as a reward to my believer slave, who, if I cause his dear friend (or relative) to die, remains patient (and hopes for Allah's Reward).",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ عَمْرٍو، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَقُولُ اللَّهُ تَعَالَى مَا لِعَبْدِي الْمُؤْمِنِ عِنْدِي جَزَاءٌ، إِذَا قَبَضْتُ صَفِيَّهُ مِنْ أَهْلِ الدُّنْيَا، ثُمَّ احْتَسَبَهُ إِلاَّ الْجَنَّةُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Allah SWT berfirman: 'Tidak ada balasan bagi hambaKu yang beriman melainkan syurga sahaja, jika Aku mencabut nyawa orang yang disayanginya daripada dunia ini, kemudian dia bersabar dan bertawakkal kepada-Ku.'\""
  },
  {
    "id": 6186,
    "hadith_number": 6186,
    "tajuk_hadith": "Kekayaan Duniawi dan Amaran Kepada Para Sahabat",
    "perawi_melayu": "Riwayat Amr bin Auf:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ بْنِ عُقْبَةَ، عَنْ مُوسَى بْنِ عُقْبَةَ، قَالَ ابْنُ شِهَابٍ حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ الْمِسْوَرَ بْنَ مَخْرَمَةَ، أَخْبَرَهُ أَنَّ عَمْرَو بْنَ عَوْفٍ وَهْوَ حَلِيفٌ لِبَنِي عَامِرِ بْنِ لُؤَىٍّ كَانَ شَهِدَ بَدْرًا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ إِلَى الْبَحْرَيْنِ يَأْتِي بِجِزْيَتِهَا، وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم هُوَ صَالَحَ أَهْلَ الْبَحْرَيْنِ، وَأَمَّرَ عَلَيْهِمُ الْعَلاَءَ بْنَ الْحَضْرَمِيِّ، فَقَدِمَ أَبُو عُبَيْدَةَ بِمَالٍ مِنَ الْبَحْرَيْنِ، فَسَمِعَتِ الأَنْصَارُ بِقُدُومِهِ فَوَافَتْهُ صَلاَةَ الصُّبْحِ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا انْصَرَفَ تَعَرَّضُوا لَهُ فَتَبَسَّمَ حِينَ رَآهُمْ وَقَالَ ‏\"‏ أَظُنُّكُمْ سَمِعْتُمْ بِقُدُومِ أَبِي عُبَيْدَةَ، وَأَنَّهُ جَاءَ بِشَىْءٍ ‏\"‏‏.‏ قَالُوا أَجَلْ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ فَأَبْشِرُوا وَأَمِّلُوا مَا يَسُرُّكُمْ، فَوَاللَّهِ مَا الْفَقْرَ أَخْشَى عَلَيْكُمْ، وَلَكِنْ أَخْشَى عَلَيْكُمْ أَنْ تُبْسَطَ عَلَيْكُمُ الدُّنْيَا، كَمَا بُسِطَتْ عَلَى مَنْ كَانَ قَبْلَكُمْ، فَتَنَافَسُوهَا كَمَا تَنَافَسُوهَا وَتُلْهِيَكُمْ كَمَا أَلْهَتْهُمْ ‏\"‏‏.‏",
    "malay_translation": "Kami diberitakan oleh Ismail bin Abdullah, katanya, aku diberitakan oleh Ismail bin Ibrahim bin Uqbah, daripada Musa bin Uqbah, katanya, Ibn Syihab memberitakan kepadaku daripada Urwah bin Zubair, bahawa Miswar bin Makhramah, memberitakan kepadanya bahawa Amr bin Auf, iaitu seorang sekutu Bani Amir bin Luai yang telah menyaksikan perang Badar bersama Rasulullah SAW, memberitakan kepadanya bahawa Rasulullah SAW telah menghantar Abu Ubaidah bin al-Jarrah ke Bahrain untuk membawa jizyahnya.  Rasulullah SAW sendirilah yang telah berdamai dengan penduduk Bahrain, dan telah melantik al-Ala' bin al-Hadrami sebagai ketua mereka. Maka Abu Ubaidah tiba membawa wang dari Bahrain.  Para Ansar mendengar tentang kedatangannya, lalu mereka mendatanginya ketika solat Subuh bersama Rasulullah SAW.  Apabila selesai solat, mereka menghampiri baginda. Baginda tersenyum apabila melihat mereka, dan bersabda, \"Aku kira kamu telah mendengar tentang kedatangan Abu Ubaidah, dan bahawa dia telah membawa sesuatu.\" Mereka menjawab, \"Ya, wahai Rasulullah!\" Baginda bersabda, \"Maka gembirakanlah diri kamu dan berharaplah kepada apa yang menyenangkan kamu. Demi Allah, aku tidak takut akan kemiskinan menimpa kamu, tetapi aku takut akan kekayaan dunia diberikan kepada kamu dengan melimpah ruah sepertimana yang telah diberikan kepada umat sebelum kamu, lalu kamu akan berlumba-lumba memperebutkannya sepertimana mereka berlumba-lumba memperebutkannya, dan ia akan melalaikan kamu sepertimana ia telah melalaikan mereka.\""
  },
  {
    "id": 6187,
    "hadith_number": 6187,
    "tajuk_hadith": "Wasat Nabi SAW Selepas Perang Uhud",
    "perawi_melayu": "Riwayat Uqba bin Amir:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ يَوْمًا فَصَلَّى عَلَى أَهْلِ أُحُدٍ صَلاَتَهُ عَلَى الْمَيِّتِ، ثُمَّ انْصَرَفَ إِلَى الْمِنْبَرِ فَقَالَ ‏\n\"‏ إِنِّي فَرَطُكُمْ وَأَنَا شَهِيدٌ عَلَيْكُمْ، وَإِنِّي وَاللَّهِ لأَنْظُرُ إِلَى حَوْضِي الآنَ، وَإِنِّي قَدْ أُعْطِيتُ مَفَاتِيحَ خَزَائِنِ الأَرْضِ ـ أَوْ مَفَاتِيحَ الأَرْضِ ـ وَإِنِّي وَاللَّهِ مَا أَخَافُ عَلَيْكُمْ أَنْ تُشْرِكُوا بَعْدِي، وَلَكِنِّي أَخَافُ عَلَيْكُمْ أَنْ تَنَافَسُوا فِيهَا ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah bin Sa'id, telah menceritakan kepada kami Al-Laith, dari Yazid bin Abi Habib, dari Abu Al-Khayr, dari Uqbah bin Amir, bahawa Rasulullah SAW keluar pada suatu hari dan menunaikan solat jenazah ke atas penduduk Uhud, kemudian baginda berpindah ke mimbar lalu bersabda:  \"Sesungguhnya aku adalah pemimpin kamu dan aku adalah saksi ke atas kamu. Demi Allah, sesungguhnya aku sedang melihat telagaKu (Al-Kauthar) sekarang ini, dan sesungguhnya aku telah diberi kunci-kunci khazanah bumi – atau kunci-kunci bumi – dan demi Allah, aku tidak takut bahawa kamu akan mempersekutukan Allah selepas aku, tetapi aku takut bahawa kamu akan berlumba-lumba (berebut) di dalamnya.\""
  },
  {
    "id": 6188,
    "hadith_number": 6188,
    "tajuk_hadith": "Ketakutan Rasulullah SAW akan Kekayaan Dunia",
    "perawi_melayu": "Riwayat Abu Sa`id Al-Khudri:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ أَكْثَرَ مَا أَخَافُ عَلَيْكُمْ مَا يُخْرِجُ اللَّهُ لَكُمْ مِنْ بَرَكَاتِ الأَرْضِ ‏\"‏‏.‏ قِيلَ وَمَا بَرَكَاتُ الأَرْضِ قَالَ ‏\"‏ زَهْرَةُ الدُّنْيَا ‏\"‏‏.‏ فَقَالَ لَهُ رَجُلٌ هَلْ يَأْتِي الْخَيْرُ بِالشَّرِّ فَصَمَتَ النَّبِيُّ صلى الله عليه وسلم حَتَّى ظَنَنَّا أَنَّهُ يُنْزَلُ عَلَيْهِ، ثُمَّ جَعَلَ يَمْسَحُ عَنْ جَبِينِهِ فَقَالَ ‏\"‏ أَيْنَ السَّائِلُ ‏\"‏‏.‏ قَالَ أَنَا‏.‏ قَالَ أَبُو سَعِيدٍ لَقَدْ حَمِدْنَاهُ حِينَ طَلَعَ ذَلِكَ‏.‏ قَالَ ‏\"‏ لاَ يَأْتِي الْخَيْرُ إِلاَّ بِالْخَيْرِ، إِنَّ هَذَا الْمَالَ خَضِرَةٌ حُلْوَةٌ، وَإِنَّ كُلَّ مَا أَنْبَتَ الرَّبِيعُ يَقْتُلُ حَبَطًا أَوْ يُلِمُّ، إِلاَّ آكِلَةَ الْخَضِرَةِ، أَكَلَتْ حَتَّى إِذَا امْتَدَّتْ خَاصِرَتَاهَا اسْتَقْبَلَتِ الشَّمْسَ، فَاجْتَرَّتْ وَثَلَطَتْ وَبَالَتْ، ثُمَّ عَادَتْ فَأَكَلَتْ، وَإِنَّ هَذَا الْمَالَ حُلْوَةٌ، مَنْ أَخَذَهُ بِحَقِّهِ وَوَضَعَهُ فِي حَقِّهِ، فَنِعْمَ الْمَعُونَةُ هُوَ، وَمَنْ أَخَذَهُ بِغَيْرِ حَقِّهِ، كَانَ الَّذِي يَأْكُلُ وَلاَ يَشْبَعُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Sesungguhnya yang paling aku khuatirkan terhadap kamu semua ialah nikmat-nikmat dunia yang Allah kurniakan kepada kamu.\"  Ditanya, \"Apakah nikmat-nikmat dunia itu?\" Baginda SAW menjawab, \"Keindahan dunia.\"  Lalu seorang lelaki bertanya, \"Adakah kebaikan itu mendatangkan keburukan?\" Nabi SAW berdiam seketika sehingga kami menyangka wahyu diturunkan kepadanya. Kemudian baginda mula menyapu peluh di dahinya lalu bertanya, \"Di manakah orang yang bertanya itu?\" Lelaki itu menjawab, \"Saya di sini.\" Abu Sa`id berkata: Kami memuji lelaki itu setelah mengetahui jawapannya. Baginda SAW bersabda, \"Kebaikan tidak mendatangkan melainkan kebaikan. Sesungguhnya harta dunia ini seperti tumbuhan yang hijau dan manis, dan setiap tumbuhan yang tumbuh pada musim bunga sama ada membunuh atau mencederakan haiwan yang memakannya terlalu banyak, kecuali haiwan yang memakan tumbuhan Khadira. Haiwan itu makan sehingga kenyang, kemudian menghadap matahari, mengunyah semula, membuang najis dan air kencing, kemudian makan semula. Dan sesungguhnya harta dunia ini seperti buah yang manis. Barangsiapa yang memperolehnya dengan cara yang halal dan membelanjakannya dengan cara yang halal, maka ia adalah penolong yang baik. Dan barangsiapa yang memperolehnya dengan cara yang haram, maka ia seperti orang yang makan tetapi tidak pernah kenyang.\""
  },
  {
    "id": 6189,
    "hadith_number": 6189,
    "tajuk_hadith": "Generasi Terbaik dan Ciri-ciri Generasi Akan Datang",
    "perawi_melayu": "Riwayat Zahdam bin Mudarrib:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ أَبَا جَمْرَةَ، قَالَ حَدَّثَنِي زَهْدَمُ بْنُ مُضَرِّبٍ، قَالَ سَمِعْتُ عِمْرَانَ بْنَ حُصَيْنٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ خَيْرُكُمْ قَرْنِي، ثُمَّ الَّذِينَ يَلُونَهُمْ، ثُمَّ الَّذِينَ يَلُونَهُمْ ‏\"‏‏.‏ قَالَ عِمْرَانُ فَمَا أَدْرِي قَالَ النَّبِيُّ صلى الله عليه وسلم بَعْدَ قَوْلِهِ مَرَّتَيْنِ أَوْ ثَلاَثًا ‏\"‏ ثُمَّ يَكُونُ بَعْدَهُمْ قَوْمٌ يَشْهَدُونَ وَلاَ يُسْتَشْهَدُونَ، وَيَخُونُونَ وَلاَ يُؤْتَمَنُونَ، وَيَنْذِرُونَ وَلاَ يَفُونَ وَيَظْهَرُ فِيهِمُ السِّمَنُ ‏\"‏‏.‏",
    "malay_translation": "Muhammad bin Bashar telah meriwayatkan dariku, Ghandar telah meriwayatkan dariku, Syu'bah berkata: Aku mendengar daripada Abu Jamrah, yang berkata: Zahdam bin Mudarrib telah meriwayatkan kepadaku, yang berkata: Aku mendengar Imran bin Husain – semoga Allah merahmati mereka berdua – daripada Nabi SAW, baginda bersabda:  \"Sebaik-baik kamu ialah generasi ku, kemudian generasi yang selepasnya, kemudian generasi yang selepasnya.\" Imran berkata: Aku tidak pasti sama ada Nabi SAW mengulang perkataan itu dua atau tiga kali. Nabi SAW menambah: \"Kemudian selepas mereka akan datang satu kaum yang memberi keterangan tetapi tidak diminta keterangannya, mereka berkhianat dan tidak boleh dipercayai, mereka berjanji tetapi tidak menepati janji, dan kegemukan akan menonjol pada mereka.\""
  },
  {
    "id": 6190,
    "hadith_number": 6190,
    "tajuk_hadith": "Generasi Terbaik Ummat",
    "perawi_melayu": "Riwayat Abdullah",
    "english_text": "The Prophet (ﷺ) said, \"The best people are those of my generation, and then those who will come after \nthem (the next generation), and then those who will come after them (i.e. the next generation), and \nthen after them, there will come people whose witness will precede their oaths, and whose oaths will \nprecede their witness.\"",
    "arabic_text": "حَدَّثَنَا عَبْدَانُ، عَنْ أَبِي حَمْزَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَبِيدَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ خَيْرُ النَّاسِ قَرْنِي، ثُمَّ الَّذِينَ يَلُونَهُمْ، ثُمَّ الَّذِينَ يَلُونَهُمْ، ثُمَّ يَجِيءُ مِنْ بَعْدِهِمْ قَوْمٌ تَسْبِقُ شَهَادَتُهُمْ أَيْمَانَهُمْ وَأَيْمَانُهُمْ شَهَادَتَهُمْ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Generasi terbaik adalah generasiku, kemudian generasi sesudah mereka, kemudian generasi sesudah mereka.  Kemudian setelah mereka akan datang suatu kaum yang kesaksian mereka mendahului sumpah mereka, dan sumpah mereka mendahului kesaksian mereka.\""
  },
  {
    "id": 6191,
    "hadith_number": 6191,
    "tajuk_hadith": "Keinginan Khābbab untuk Mati Syahid",
    "perawi_melayu": "Riwayat Qais:",
    "english_text": "I heard Khabbab, who had branded his `Abdomen with seven brands, saying, \"Had Allah's Messenger (ﷺ) not \nforbidden us to invoke Allah for death, I would have invoked Allah for death. The companions of \nMuhammad have left this world without taking anything of their reward in it (i.e., they will have \nperfect reward in the Hereafter), but we have collected of the worldly wealth what we cannot spend \nbut on earth (i.e. on building houses).",
    "arabic_text": "حَدَّثَنِي يَحْيَى بْنُ مُوسَى، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ قَيْسٍ، قَالَ سَمِعْتُ خَبَّابًا، وَقَدِ اكْتَوَى يَوْمَئِذٍ سَبْعًا فِي بَطْنِهِ وَقَالَ لَوْلاَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَانَا أَنْ نَدْعُوَ بِالْمَوْتِ لَدَعَوْتُ بِالْمَوْتِ، إِنَّ أَصْحَابَ مُحَمَّدٍ صلى الله عليه وسلم مَضَوْا وَلَمْ تَنْقُصْهُمُ الدُّنْيَا بِشَىْءٍ، وَإِنَّا أَصَبْنَا مِنَ الدُّنْيَا مَا لاَ نَجِدُ لَهُ مَوْضِعًا إِلاَّ التُّرَابَ‏.‏",
    "malay_translation": "Aku mendengar Khābbab, yang pada hari itu telah dibakar perutnya sebanyak tujuh kali, berkata, \"Sekiranya Rasulullah ﷺ tidak melarang kita daripada berdoa memohon mati, nescaya aku akan berdoa memohon mati.  Para sahabat Muhammad ﷺ telah meninggalkan dunia ini tanpa kekurangan sedikit pun daripada ganjaran mereka (iaitu, mereka akan mendapat ganjaran sempurna di akhirat), tetapi kita telah mengumpulkan harta duniawi yang tidak kita temukan tempat penggunaannya melainkan di bumi (iaitu, untuk membina rumah)."
  },
  {
    "id": 6192,
    "hadith_number": 6192,
    "tajuk_hadith": "Kehidupan Sahabat Setelah Kematian",
    "perawi_melayu": "Riwayat Qais:",
    "english_text": "I came to Khabbab while he was building a wall, and he (Khabbab) said, \"Our companions who have \nleft this world, did not enjoy anything of their reward therein, while we have collected after them, \nmuch wealth that we cannot spend but on earth (i.e., on building).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ، قَالَ حَدَّثَنِي قَيْسٌ، قَالَ أَتَيْتُ خَبَّابًا وَهْوَ يَبْنِي حَائِطًا لَهُ فَقَالَ إِنَّ أَصْحَابَنَا الَّذِينَ مَضَوْا لَمْ تَنْقُصْهُمُ الدُّنْيَا شَيْئًا، وَإِنَّا أَصَبْنَا مِنْ بَعْدِهِمْ شَيْئًا، لاَ نَجِدُ لَهُ مَوْضِعًا إِلاَّ التُّرَابَ‏.‏",
    "malay_translation": "Aku datang kepada Khabbab ketika dia sedang membina tembok, lalu dia (Khabbab) berkata, \"Sahabat-sahabat kita yang telah meninggal dunia, tidak menikmati apa-apa daripada ganjaran mereka di dunia ini, sedangkan kita telah mengumpulkan kekayaan selepas mereka, dan kita tidak menemui tempat untuk membelanjakannya kecuali di atas bumi (iaitu, untuk membina)."
  },
  {
    "id": 6193,
    "hadith_number": 6193,
    "tajuk_hadith": "Hijrah Bersama Rasulullah",
    "perawi_melayu": "Riwayat Khabbāb:",
    "english_text": "We migrated with the Prophet..(This narration is related in the chapter of migration).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، عَنْ سُفْيَانَ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ خَبَّاب ٍ ـ رضى الله عنه ـ قَالَ هَاجَرْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Khabbāb r.a. berkata, \"Kami berhijrah bersama Rasulullah SAW.\" (Hadith ini diriwayatkan dalam bab hijrah)."
  },
  {
    "id": 6194,
    "hadith_number": 6194,
    "tajuk_hadith": "Pengampunan Dosa dengan Wudhu, Solat Dua Rakaat, dan Menunggu Solat Jemaah",
    "perawi_melayu": "Daripada Ibnu Abbas",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعْدُ بْنُ حَفْصٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ الْقُرَشِيِّ، قَالَ أَخْبَرَنِي مُعَاذُ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ ابْنَ أَبَانَ، أَخْبَرَهُ قَالَ أَتَيْتُ عُثْمَانَ بِطَهُورٍ وَهْوَ جَالِسٌ عَلَى الْمَقَاعِدِ، فَتَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم تَوَضَّأَ وَهْوَ فِي هَذَا الْمَجْلِسِ، فَأَحْسَنَ الْوُضُوءَ ثُمَّ قَالَ ‏\"‏ مَنْ تَوَضَّأَ مِثْلَ هَذَا الْوُضُوءِ، ثُمَّ أَتَى الْمَسْجِدَ فَرَكَعَ رَكْعَتَيْنِ، ثُمَّ جَلَسَ، غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏‏.‏ قَالَ وَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ تَغْتَرُّوا ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Saad bin Hafsh, telah menceritakan kepada kami Syaiban, dari Yahya, dari Muhammad bin Ibrahim al-Qurasyi, dia berkata:  Mu'adz bin Abdurrahman memberitahu aku bahawa Ibnu Aban memberitahunya bahawa: Aku membawa air wudhu kepada Uthman ketika dia sedang duduk di atas tempat duduk.  Maka dia berwudu dengan sempurna, kemudian berkata: Aku melihat Nabi SAW berwudu di tempat ini, dan baginda berwudu dengan sempurna, kemudian baginda bersabda: \"Barangsiapa berwudu seperti wudhu ini, kemudian pergi ke masjid dan menunaikan solat dua rakaat, kemudian duduk (menunggu solat fardu jemaah), maka diampunkanlah dosa-dosanya yang telah lalu.\" Baginda SAW bersabda lagi:  \"Janganlah kamu terlalu yakin (berfikir bahawa dosa-dosamu akan diampunkan kerana solatmu).\""
  },
  {
    "id": 6195,
    "hadith_number": 6195,
    "tajuk_hadith": "Kematian Orang Soleh dan Sisa Umat",
    "perawi_melayu": "Riwayat Mirdas Al-Aslami:",
    "english_text": "The Prophet (ﷺ) said, \"The righteous (pious people will depart (die) in succession one after the other, and \nthere will remain (on the earth) useless people like the useless husk of barley seeds or bad dates.",
    "arabic_text": "حَدَّثَنِي يَحْيَى بْنُ حَمَّادٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ بَيَانٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، عَنْ مِرْدَاسٍ الأَسْلَمِيِّ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ يَذْهَبُ الصَّالِحُونَ الأَوَّلُ فَالأَوَّلُ، وَيَبْقَى حُفَالَةٌ كَحُفَالَةِ الشَّعِيرِ أَوِ التَّمْرِ، لاَ يُبَالِيهِمُ اللَّهُ بَالَةً ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ يُقَالُ حُفَالَةٌ وَحُثَالَةٌ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Orang-orang yang soleh akan meninggal dunia secara berturut-turut, dan akan tinggal (di muka bumi) sekumpulan manusia yang tidak berguna, seperti sekam jelai atau tamar yang buruk. Allah SWT tidak akan mempedulikan mereka.\"  Abu Abdullah berkata:  \"Dikatakan Hufalah dan Hutsalah.\""
  },
  {
    "id": 6196,
    "hadith_number": 6196,
    "tajuk_hadith": "Celaka Hamba Kepada Dinar, Dirham, dan Harta Dunia",
    "perawi_melayu": "Dari Abu Hurairah",
    "english_text": "The Prophet (ﷺ) said, \"Perish the slave of Dinar, Dirham, Qatifa (thick soft cloth), and Khamisa (a garment), for if he is given, he is pleased; otherwise he is dissatisfied.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى بْنُ يُوسُفَ، أَخْبَرَنَا أَبُو بَكْرٍ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ تَعِسَ عَبْدُ الدِّينَارِ وَالدِّرْهَمِ وَالْقَطِيفَةِ وَالْخَمِيصَةِ، إِنْ أُعْطِيَ رَضِيَ، وَإِنْ لَمْ يُعْطَ لَمْ يَرْضَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Celakalah hamba yang menjadi tawanan dinar, dirham, kain baldu tebal (qatifah), dan pakaian halus (khamisah). Jika diberi, dia akan redha; tetapi jika tidak diberi, dia tidak akan redha.\""
  },
  {
    "id": 6197,
    "hadith_number": 6197,
    "tajuk_hadith": "Keinginan Manusia yang Tidak Berpenghujung",
    "perawi_melayu": "Daripada Ibnu Abbas:",
    "english_text": "I heard the Prophet (ﷺ) saying, \"If the son of Adam (the human being) had two valleys of money, he would \nwish for a third, for nothing can fill the belly of Adam's son except dust, and Allah forgives him who \nrepents to Him.\"",
    "arabic_text": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لَوْ كَانَ لاِبْنِ آدَمَ وَادِيَانِ مِنْ مَالٍ لاَبْتَغَى ثَالِثًا، وَلاَ يَمْلأُ جَوْفَ ابْنِ آدَمَ إِلاَّ التُّرَابُ، وَيَتُوبُ اللَّهُ عَلَى مَنْ تَابَ ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda: \"Sekiranya anak Adam memiliki dua lembah harta, nescaya dia akan menginginkan lembah ketiga. Tiada apa yang dapat memenuhi perut anak Adam melainkan tanah.  Allah SWT akan mengampunkan sesiapa yang bertaubat kepada-Nya.\""
  },
  {
    "id": 6198,
    "hadith_number": 6198,
    "tajuk_hadith": "Keinginan Manusia yang Tidak Berpenghujung",
    "perawi_melayu": "Riwayat Ibnu Abbas:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا مَخْلَدٌ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ سَمِعْتُ عَطَاءً، يَقُولُ سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لَوْ أَنَّ لاِبْنِ آدَمَ مِثْلَ وَادٍ مَالاً لأَحَبَّ أَنَّ لَهُ إِلَيْهِ مِثْلَهُ، وَلاَ يَمْلأُ عَيْنَ ابْنِ آدَمَ إِلاَّ التُّرَابُ، وَيَتُوبُ اللَّهُ عَلَى مَنْ تَابَ ‏\"‏‏.‏ قَالَ ابْنُ عَبَّاسٍ فَلاَ أَدْرِي مِنَ الْقُرْآنِ هُوَ أَمْ لاَ‏.‏ قَالَ وَسَمِعْتُ ابْنَ الزُّبَيْرِ يَقُولُ ذَلِكَ عَلَى الْمِنْبَرِ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Muhammad, memberitakan kepada kami Makhalad, memberitakan kepada kami Ibnu Juraij, dia berkata: Aku mendengar ‘Ata’ berkata: Aku mendengar Ibnu Abbas berkata: Aku mendengar Rasulullah SAW bersabda:  “Sekiranya anak Adam memiliki harta sepenuh lembah, nescaya dia menginginkan lembah yang sama banyaknya lagi. Tiada apa yang dapat memuaskan mata anak Adam melainkan tanah. Dan Allah SWT menerima taubat orang yang bertaubat.” Ibnu Abbas berkata: Aku tidak tahu sama ada ini adalah dari al-Quran atau bukan. Dia berkata: Dan aku mendengar Ibnu Zubair menyebutkannya di atas mimbar."
  },
  {
    "id": 6199,
    "hadith_number": 6199,
    "tajuk_hadith": "Keinginan Manusia yang Tidak Berpenghujung",
    "perawi_melayu": "Daripada Sahl bin Sa`d:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سُلَيْمَانَ بْنِ الْغَسِيلِ، عَنْ عَبَّاسِ بْنِ سَهْلِ بْنِ سَعْدٍ، قَالَ سَمِعْتُ ابْنَ الزُّبَيْرِ، عَلَى الْمِنْبَرِ بِمَكَّةَ فِي خُطْبَتِهِ يَقُولُ يَا أَيُّهَا النَّاسُ إِنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقُولُ ‏\n\"‏ لَوْ أَنَّ ابْنَ آدَمَ أُعْطِيَ وَادِيًا مَلأً مِنْ ذَهَبٍ أَحَبَّ إِلَيْهِ ثَانِيًا، وَلَوْ أُعْطِيَ ثَانِيًا أَحَبَّ إِلَيْهِ ثَالِثًا، وَلاَ يَسُدُّ جَوْفَ ابْنِ آدَمَ إِلاَّ التُّرَابُ، وَيَتُوبُ اللَّهُ عَلَى مَنْ تَابَ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'aim, telah menceritakan kepada kami Abdurrahman bin Sulaiman bin Al-Ghasil, daripada Abbas bin Sahl bin Sa'ad, katanya: Aku mendengar Ibnu Zubair, di atas mimbar di Mekah dalam khutbahnya berkata: Wahai manusia! Sesungguhnya Nabi SAW bersabda: \"Sekiranya anak Adam diberi lembah yang penuh dengan emas, nescaya dia akan menginginkan lembah yang kedua; dan sekiranya dia diberi lembah yang kedua, nescaya dia akan menginginkan lembah yang ketiga. Dan tidak akan merasa kenyang perut anak Adam melainkan dengan tanah.  Dan Allah SWT menerima taubat orang yang bertaubat.\"."
  },
  {
    "id": 6200,
    "hadith_number": 6200,
    "tajuk_hadith": "Keinginan Manusia yang Tidak Berpenghujung",
    "perawi_melayu": "Riwayat Anas bin Malik:",
    "english_text": "Allah's Messenger (ﷺ) said, \"If Adam's son had a valley full of gold, he would like to have two valleys, for \nnothing fills his mouth except dust. And Allah forgives him who repents to Him.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَوْ أَنَّ لاِبْنِ آدَمَ وَادِيًا مِنْ ذَهَبٍ أَحَبَّ أَنْ يَكُونَ لَهُ وَادِيَانِ، وَلَنْ يَمْلأَ فَاهُ إِلاَّ التُّرَابُ، وَيَتُوبُ اللَّهُ عَلَى مَنْ تَابَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Sekiranya anak Adam memiliki lembah yang penuh dengan emas, nescaya dia menginginkan dua lembah.  Dan tidak akan memenuhi mulutnya kecuali debu. Allah mengampunkan sesiapa yang bertaubat kepada-Nya.\""
  },
  {
    "id": 6201,
    "hadith_number": 6201,
    "tajuk_hadith": "Persaingan Duniawi dan Ayat Al-Takātsur",
    "perawi_melayu": "Ubayy berkata (merujuk kepada hadis di atas), \"Kami menganggap ini sebagai satu ayat daripada Al-Quran sehingga turunnya Surah (yang bermula dengan):",
    "english_text": "\"The mutual rivalry (for piling up of worldly things) diverts you' (102:1) was revealed.\"",
    "arabic_text": "وَقَالَ لَنَا أَبُو الْوَلِيدِ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، عَنْ أُبَىٍّ، قَالَ كُنَّا نَرَى هَذَا مِنَ الْقُرْآنِ حَتَّى نَزَلَتْ ‏{‏أَلْهَاكُمُ التَّكَاثُرُ‏}‏",
    "malay_translation": "Abu al-Walid memberitahu kami, Hammad bin Salamah meriwayatkan daripada Thaabit, daripada Anas, daripada Ubayy, katanya: \"Kami menganggap ini sebagai sebahagian daripada al-Quran sehingga turunnya ayat: {أَلْهَاكُمُ التَّكَاثُرُ} (Al-Takātsur).\"  Maksudnya, persaingan sesama manusia dalam mengumpul harta benda telah didedahkan sebagai sesuatu yang melalaikan."
  },
  {
    "id": 6202,
    "hadith_number": 6202,
    "tajuk_hadith": "Keberkatan Rezeki dan Kebaikan Memberi",
    "perawi_melayu": "Riwayat Hakim bin Hizam:",
    "english_text": "I asked the Prophet (for some money) and he gave me, and then again I asked him and he gave me, \nand then again I asked him and he gave me and he then said, \"This wealth is (like) green and sweet \n(fruit), and whoever takes it without greed, Allah will bless it for him, but whoever takes it with greed, \nAllah will not bless it for him, and he will be like the one who eats but is never satisfied. And the \nupper (giving) hand is better than the lower (taking) hand.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ الزُّهْرِيَّ، يَقُولُ أَخْبَرَنِي عُرْوَةُ، وَسَعِيدُ بْنُ الْمُسَيَّبِ، عَنْ حَكِيمِ بْنِ حِزَامٍ، قَالَ سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم فَأَعْطَانِي، ثُمَّ سَأَلْتُهُ فَأَعْطَانِي، ثُمَّ سَأَلْتُهُ فَأَعْطَانِي، ثُمَّ قَالَ ‏\n\"‏ هَذَا الْمَالُ ـ وَرُبَّمَا قَالَ سُفْيَانُ قَالَ لِي يَا حَكِيمُ ـ إِنَّ هَذَا الْمَالَ خَضِرَةٌ حُلْوَةٌ، فَمَنْ أَخَذَهُ بِطِيبِ نَفْسٍ بُورِكَ لَهُ فِيهِ، وَمَنْ أَخَذَهُ بِإِشْرَافِ نَفْسٍ لَمْ يُبَارَكْ لَهُ فِيهِ، وَكَانَ كَالَّذِي يَأْكُلُ وَلاَ يَشْبَعُ، وَالْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى ‏\"‏‏.‏",
    "malay_translation": "Aku meminta kepada Nabi SAW (sedikit wang) dan Baginda memberi kepadaku, kemudian aku meminta lagi dan Baginda memberi kepadaku, kemudian aku meminta lagi dan Baginda memberi kepadaku.  Kemudian Baginda bersabda:  \"Harta ini ibarat buah-buahan yang hijau dan manis. Barangsiapa yang mengambilnya dengan hati yang ikhlas, nescaya Allah akan memberkatinya baginya. Dan barangsiapa yang mengambilnya dengan hati yang tamak, nescaya Allah tidak akan memberkatinya baginya, dan dia akan seperti orang yang makan tetapi tidak pernah kenyang. Dan tangan yang memberi itu lebih baik daripada tangan yang menerima.\""
  },
  {
    "id": 6203,
    "hadith_number": 6203,
    "tajuk_hadith": "Kekayaan Diri Sendiri dan Harta Pusaka",
    "perawi_melayu": "Riwayat Abdullah:",
    "english_text": "The Prophet (ﷺ) said, \"Who among you considers the wealth of his heirs dearer to him than his own \nwealth?\" They replied, \"O Allah's Messenger (ﷺ)! There is none among us but loves his own wealth more.\" \nThe Prophet (ﷺ) said, \"So his wealth is whatever he spends (in Allah's Cause) during his life (on good \ndeeds) while the wealth of his heirs is whatever he leaves after his death.\"",
    "arabic_text": "حَدَّثَنِي عُمَرُ بْنُ حَفْصٍ، حَدَّثَنِي أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ التَّيْمِيُّ، عَنِ الْحَارِثِ بْنِ سُوَيْدٍ، قَالَ عَبْدُ اللَّهِ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَيُّكُمْ مَالُ وَارِثِهِ أَحَبُّ إِلَيْهِ مِنْ مَالِهِ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ مَا مِنَّا أَحَدٌ إِلاَّ مَالُهُ أَحَبُّ إِلَيْهِ‏.‏ قَالَ ‏\"‏ فَإِنَّ مَالَهُ مَا قَدَّمَ، وَمَالُ وَارِثِهِ مَا أَخَّرَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Siapakah di antara kamu yang menganggap harta pusaka warisnya lebih disayangi daripada hartanya sendiri?\" Mereka menjawab, \"Wahai Rasulullah SAW! Tiada seorang pun di antara kami melainkan hartanya sendiri lebih disayangi.\" Rasulullah SAW bersabda, \"Maka hartanya ialah apa yang telah dibelanjakannya (di jalan Allah) semasa hidupnya (untuk amal soleh), manakala harta pusaka warisnya ialah apa yang ditinggalkannya setelah kematiannya.\""
  },
  {
    "id": 6204,
    "hadith_number": 6204,
    "tajuk_hadith": "Syurga Bagi Mereka Yang Meninggal Tanpa Syirik",
    "perawi_melayu": "Riwayat Abu Dzar:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، عَنْ زَيْدِ بْنِ وَهْبٍ، عَنْ أَبِي ذَرٍّ ـ رضى الله عنه ـ قَالَ خَرَجْتُ لَيْلَةً مِنَ اللَّيَالِي فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَمْشِي وَحْدَهُ، وَلَيْسَ مَعَهُ إِنْسَانٌ ـ قَالَ ـ فَظَنَنْتُ أَنَّهُ يَكْرَهُ أَنْ يَمْشِيَ مَعَهُ أَحَدٌ ـ قَالَ ـ فَجَعَلْتُ أَمْشِي فِي ظِلِّ الْقَمَرِ فَالْتَفَتَ فَرَآنِي فَقَالَ ‏\"‏ مَنْ هَذَا ‏\"‏‏.‏ قُلْتُ أَبُو ذَرٍّ جَعَلَنِي اللَّهُ فِدَاءَكَ‏.‏ قَالَ ‏\"‏ يَا أَبَا ذَرٍّ تَعَالَهْ ‏\"‏‏.‏ قَالَ فَمَشَيْتُ مَعَهُ سَاعَةً فَقَالَ ‏\"‏ إِنَّ الْمُكْثِرِينَ هُمُ الْمُقِلُّونَ يَوْمَ الْقِيَامَةِ، إِلاَّ مَنْ أَعْطَاهُ اللَّهُ خَيْرًا، فَنَفَحَ فِيهِ يَمِينَهُ وَشِمَالَهُ وَبَيْنَ يَدَيْهِ وَوَرَاءَهُ، وَعَمِلَ فِيهِ خَيْرًا ‏\"‏‏.‏ قَالَ فَمَشَيْتُ مَعَهُ سَاعَةً فَقَالَ لِي ‏\"‏ اجْلِسْ هَا هُنَا ‏\"‏‏.‏ قَالَ فَأَجْلَسَنِي فِي قَاعٍ حَوْلَهُ حِجَارَةٌ فَقَالَ لِي ‏\"‏ اجْلِسْ هَا هُنَا حَتَّى أَرْجِعَ إِلَيْكَ ‏\"‏‏.‏ قَالَ فَانْطَلَقَ فِي الْحَرَّةِ حَتَّى لاَ أَرَاهُ فَلَبِثَ عَنِّي فَأَطَالَ اللُّبْثَ، ثُمَّ إِنِّي سَمِعْتُهُ وَهْوَ مُقْبِلٌ وَهْوَ يَقُولُ ‏\"‏ وَإِنْ سَرَقَ وَإِنْ زَنَى ‏\"‏‏.‏ قَالَ فَلَمَّا جَاءَ لَمْ أَصْبِرْ حَتَّى قُلْتُ يَا نَبِيَّ اللَّهِ جَعَلَنِي اللَّهُ فِدَاءَكَ مَنْ تُكَلِّمُ فِي جَانِبِ الْحَرَّةِ مَا سَمِعْتُ أَحَدًا يَرْجِعُ إِلَيْكَ شَيْئًا‏.‏ قَالَ ‏\"‏ ذَلِكَ جِبْرِيلُ ـ عَلَيْهِ السَّلاَمُ ـ عَرَضَ لِي فِي جَانِبِ الْحَرَّةِ، قَالَ بَشِّرْ أُمَّتَكَ أَنَّهُ مَنْ مَاتَ لاَ يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ الْجَنَّةَ، قُلْتُ يَا جِبْرِيلُ وَإِنْ سَرَقَ وَإِنْ زَنَى قَالَ نَعَمْ‏.‏ قَالَ قُلْتُ وَإِنْ سَرَقَ وَإِنْ زَنَى قَالَ نَعَمْ، وَإِنْ شَرِبَ الْخَمْرَ. قَالَ النَّضْرُ أَخْبَرَنَا شُعْبَةُ، وَحَدَّثَنَا حَبِيبُ بْنُ أَبِي ثَابِتٍ، وَالأَعْمَشُ، وَعَبْدُ الْعَزِيزِ بْنُ رُفَيْعٍ، حَدَّثَنَا زَيْدُ بْنُ وَهْبٍ، بِهَذَا‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ حَدِيثُ أَبِي صَالِحٍ عَنْ أَبِي الدَّرْدَاءِ، مُرْسَلٌ، لاَ يَصِحُّ، إِنَّمَا أَرَدْنَا لِلْمَعْرِفَةِ، وَالصَّحِيحُ حَدِيثُ أَبِي ذَرٍّ‏.‏ قِيلَ لأَبِي عَبْدِ اللَّهِ حَدِيثُ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي الدَّرْدَاءِ قَالَ مُرْسَلٌ أَيْضًا لاَ يَصِحُّ، وَالصَّحِيحُ حَدِيثُ أَبِي ذَرٍّ‏.‏ وَقَالَ اضْرِبُوا عَلَى حَدِيثِ أَبِي الدَّرْدَاءِ هَذَا‏.‏ إِذَا مَاتَ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ عِنْدَ الْمَوْتِ‏.‏",
    "malay_translation": "Aku keluar pada suatu malam.  Ketika itu, aku melihat Rasulullah SAW berjalan sendirian, tanpa ditemani sesiapa. Aku menyangka baginda tidak suka jika ditemani orang. Maka aku berjalan di bawah cahaya bulan yang redup.  Rasulullah SAW berpaling dan melihatku lalu bertanya, \"Siapakah itu?\" Aku menjawab, \"Abu Dzar, semoga Allah merahmati tuan!\" Baginda bersabda, \"Wahai Abu Dzar, marilah ke sini!\"  Maka aku berjalan bersama baginda seketika. Kemudian baginda bersabda, \"Sesungguhnya orang yang banyak harta adalah golongan yang sedikit pahalanya pada hari kiamat, kecuali orang yang diberi Allah kebaikan lalu dia sedekahkan ke kanan, ke kiri, ke hadapan dan ke belakangnya, dan dia beramal soleh dengannya.\"  Aku berjalan lagi seketika bersama baginda. Kemudian baginda bersabda kepadaku, \"Duduklah di sini.\"  Baginda menyuruhku duduk di tempat lapang yang dikelilingi batu, lalu bersabda, \"Duduklah di sini sehingga aku kembali kepadamu.\" Baginda pergi ke arah Al-Harrah sehingga aku tidak dapat melihat baginda. Baginda berlama-lama di sana, kemudian aku mendengar baginda sedang menghampiriku sambil bersabda, \"Walaupun dia mencuri, dan walaupun dia berzina.\"  Setelah baginda tiba, aku tidak dapat menahan diri dan bertanya, \"Wahai Nabi Allah, semoga Allah merahmati tuan!  Dengan siapakah tuan bercakap di tepi Al-Harrah?  Aku tidak mendengar sesiapa menjawab tuan.\" Baginda menjawab, \"Itu Jibril AS. Dia menemuiku di tepi Al-Harrah dan berkata, 'Sampaikan khabar gembira kepada umatmu bahawa sesiapa yang mati tanpa menyekutukan Allah dengan sesuatu akan masuk syurga.' Aku bertanya, 'Wahai Jibril, walaupun dia mencuri dan berzina?' Jibril menjawab, 'Ya.' Aku bertanya lagi, 'Walaupun dia mencuri dan berzina?' Jibril menjawab, 'Ya.' Aku bertanya lagi, 'Walaupun dia mencuri dan berzina?' Jibril menjawab, 'Ya.'"
  },
  {
    "id": 6205,
    "hadith_number": 6205,
    "tajuk_hadith": "Keutamaan Sedekah dan Janji Syurga",
    "perawi_melayu": "Riwayat Abu Dzar:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ الرَّبِيعِ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنِ الأَعْمَشِ، عَنْ زَيْدِ بْنِ وَهْبٍ، قَالَ قَالَ أَبُو ذَرٍّ كُنْتُ أَمْشِي مَعَ النَّبِيِّ صلى الله عليه وسلم فِي حَرَّةِ الْمَدِينَةِ فَاسْتَقْبَلَنَا أُحُدٌ فَقَالَ ‏\"‏ يَا أَبَا ذَرٍّ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ مَا يَسُرُّنِي أَنَّ عِنْدِي مِثْلَ أُحُدٍ هَذَا ذَهَبًا، تَمْضِي عَلَىَّ ثَالِثَةٌ وَعِنْدِي مِنْهُ دِينَارٌ، إِلاَّ شَيْئًا أُرْصِدُهُ لِدَيْنٍ، إِلاَّ أَنْ أَقُولَ بِهِ فِي عِبَادِ اللَّهِ هَكَذَا وَهَكَذَا وَهَكَذَا ‏\"‏‏.‏ عَنْ يَمِينِهِ وَعَنْ شِمَالِهِ وَمِنْ خَلْفِهِ‏.‏ ثُمَّ مَشَى فَقَالَ ‏\"‏ إِنَّ الأَكْثَرِينَ هُمُ الأَقَلُّونَ يَوْمَ الْقِيَامَةِ إِلاَّ مَنْ قَالَ هَكَذَا وَهَكَذَا وَهَكَذَا ـ عَنْ يَمِينِهِ وَعَنْ شِمَالِهِ وَمِنْ خَلْفِهِ ـ وَقَلِيلٌ مَا هُمْ ‏\"‏‏.‏ ثُمَّ قَالَ لِي ‏\"‏ مَكَانَكَ لاَ تَبْرَحْ حَتَّى آتِيَكَ ‏\"‏‏.‏ ثُمَّ انْطَلَقَ فِي سَوَادِ اللَّيْلِ حَتَّى تَوَارَى فَسَمِعْتُ صَوْتًا قَدِ ارْتَفَعَ، فَتَخَوَّفْتُ أَنْ يَكُونَ قَدْ عَرَضَ لِلنَّبِيِّ صلى الله عليه وسلم فَأَرَدْتُ أَنْ آتِيَهُ فَذَكَرْتُ قَوْلَهُ لِي ‏\"‏ لاَ تَبْرَحْ حَتَّى آتِيَكَ ‏\"‏ فَلَمْ أَبْرَحْ حَتَّى أَتَانِي، قُلْتُ يَا رَسُولَ اللَّهِ لَقَدْ سَمِعْتُ صَوْتًا تَخَوَّفْتُ، فَذَكَرْتُ لَهُ فَقَالَ ‏\"‏ وَهَلْ سَمِعْتَهُ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ ذَاكَ جِبْرِيلُ أَتَانِي فَقَالَ مَنْ مَاتَ مِنْ أُمَّتِكَ لاَ يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ الْجَنَّةَ ‏\"‏‏.‏ قُلْتُ وَإِنْ زَنَى وَإِنْ سَرَقَ قَالَ ‏\"‏ وَإِنْ زَنَى وَإِنْ سَرَقَ ‏\"‏‏.‏",
    "malay_translation": "Aku berjalan bersama Nabi SAW di Harrah Madinah, lalu kami terlihat Gunung Uhud.  Nabi SAW bersabda, \"Wahai Abu Dzar!\" Aku menjawab, \"Saya di sini, wahai Rasulullah!\" Baginda bersabda, \"Aku tidak rela memiliki emas sepenuh Gunung Uhud ini, melainkan jika ia habis dalam tempoh tiga hari, kecuali sedikit yang kusimpan untuk membayar hutang. Aku akan membelanjakannya untuk hamba Allah begini, begini, dan begini,\" sambil menunjuk ke arah kanan, kiri dan belakang. Baginda meneruskan perjalanan dan bersabda, \"Orang-orang kaya sebenarnya adalah orang-orang yang paling miskin pahalanya pada Hari Kiamat, kecuali mereka yang bersedekah begini, begini, dan begini, iaitu ke arah kanan, kiri dan belakang, tetapi mereka amat sedikit.\" Kemudian baginda bersabda kepadaku, \"Tetaplah di tempatmu, jangan kau tinggalkan sehingga aku kembali.\" Baginda kemudian pergi dalam kegelapan malam sehingga hilang dari pandangan. Lalu aku terdengar suara yang kuat, aku khuatir sesuatu telah menimpa Nabi SAW. Aku ingin menemuinya, tetapi aku teringat pesanan baginda, \"Jangan kau tinggalkan tempatmu sehingga aku kembali.\" Maka aku tetap di tempatku sehingga baginda kembali. Aku berkata, \"Wahai Rasulullah! Aku mendengar suara dan aku khuatir.\" Aku menceritakan semuanya kepada baginda. Baginda bersabda, \"Adakah engkau mendengarnya?\" Jawabku, \"Ya.\" Baginda bersabda, \"Itu Jibril datang kepadaku dan berkata, 'Sesiapa yang mati dari umatmu tanpa syirik kepada Allah, akan masuk syurga.' Aku bertanya (kepada Jibril), 'Walaupun dia mencuri atau berzina?' Jibril menjawab, 'Walaupun dia mencuri atau berzina.'"
  },
  {
    "id": 6206,
    "hadith_number": 6206,
    "tajuk_hadith": "Keutamaan Bersedekah dan Membayar Hutang",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "Allah Apostle said, \"If I had gold equal to the mountain of Uhud, it would not please me that anything \nof it should remain with me after three nights (i.e., I would spend all of it in Allah's Cause) except \nwhat I would keep for repaying debts.\"",
    "arabic_text": "حَدَّثَنِي أَحْمَدُ بْنُ شَبِيبٍ، حَدَّثَنَا أَبِي، عَنْ يُونُسَ،‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَوْ كَانَ لِي مِثْلُ أُحُدٍ ذَهَبًا لَسَرَّنِي أَنْ لاَ تَمُرَّ عَلَىَّ ثَلاَثُ لَيَالٍ وَعِنْدِي مِنْهُ شَىْءٌ، إِلاَّ شَيْئًا أُرْصِدُهُ لِدَيْنٍ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Sekiranya aku memiliki emas sepenuh Gunung Uhud, aku lebih gembira sekiranya tidak tinggal sedikit pun pada malam ketiga (iaitu, aku akan membelanjakan semuanya di jalan Allah) kecuali sebahagian yang aku sisihkan untuk membayar hutang.\""
  },
  {
    "id": 6207,
    "hadith_number": 6207,
    "tajuk_hadith": "Kekayaan Sebenar Adalah Kekayaan Jiwa",
    "perawi_melayu": "Dari Abu Hurairah",
    "english_text": "The Prophet (ﷺ) said, \"Wealth is not in having many possessions, but rather (true) wealth is feeling sufficiency in the soul.\"",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا أَبُو حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَيْسَ الْغِنَى عَنْ كَثْرَةِ الْعَرَضِ، وَلَكِنَّ الْغِنَى غِنَى النَّفْسِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Kekayaan bukanlah disebabkan banyaknya harta benda, tetapi kekayaan yang sebenar adalah merasa cukup dengan apa yang ada dalam jiwa.\""
  },
  {
    "id": 6208,
    "hadith_number": 6208,
    "tajuk_hadith": "Kebaikan Orang Miskin Berbanding Orang Kaya",
    "perawi_melayu": "Daripada Sahl bin Sa`d As-Sa`id:",
    "english_text": "A man passed by Allah's Messenger (ﷺ) and the Prophet (ﷺ) asked a man sitting beside him, \"What is your \nopinion about this (passer-by)?\" He replied, \"This (passer-by) is from the noble class of people. By \nAllah, if he should ask for a lady's hand in marriage, he ought to be given her in marriage, and if he \nintercedes for somebody, his intercession will be accepted. Allah's Messenger (ﷺ) kept quiet, and then \nanother man passed by and Allah's Messenger (ﷺ) asked the same man (his companion) again, \"What is your \nopinion about this (second) one?\" He said, \"O Allah's Messenger (ﷺ)! This person is one of the poor \nMuslims. If he should ask a lady's hand in marriage, no-one will accept him, and if he intercedes for \nsomebody, no one will accept his intercession, and if he talks, no-one will listen to his talk.\" Then \nAllah's Messenger (ﷺ) said, \"This (poor man) is better than such a large number of the first type (i.e. rich \nmen) as to fill the earth.\"",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، أَنَّهُ قَالَ مَرَّ رَجُلٌ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لِرَجُلٍ عِنْدَهُ جَالِسٍ ‏\"‏ مَا رَأْيُكَ فِي هَذَا ‏\"‏‏.‏ فَقَالَ رَجُلٌ مِنْ أَشْرَافِ النَّاسِ، هَذَا وَاللَّهِ حَرِيٌّ إِنْ خَطَبَ أَنْ يُنْكَحَ، وَإِنْ شَفَعَ أَنْ يُشَفَّعَ‏.‏ قَالَ فَسَكَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ مَرَّ رَجُلٌ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا رَأْيُكَ فِي هَذَا ‏\"‏‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ هَذَا رَجُلٌ مِنْ فُقَرَاءِ الْمُسْلِمِينَ، هَذَا حَرِيٌّ إِنْ خَطَبَ أَنْ لاَ يُنْكَحَ، وَإِنْ شَفَعَ أَنْ لاَ يُشَفَّعَ، وَإِنْ قَالَ أَنْ لاَ يُسْمَعَ لِقَوْلِهِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَذَا خَيْرٌ مِنْ مِلْءِ الأَرْضِ مِثْلَ هَذَا ‏\"‏‏.‏",
    "malay_translation": "Seorang lelaki lalu di hadapan Rasulullah SAW.  Rasulullah SAW bertanya kepada seorang lelaki yang duduk di sisi baginda, \"Apakah pendapatmu tentang orang ini?\" Lelaki itu menjawab, \"Dia adalah dari kalangan orang-orang mulia. Demi Allah, sekiranya dia meminang wanita, nescaya dia akan diterima, dan sekiranya dia bersyafaat, nescaya syafaatnya akan diterima.\" Rasulullah SAW  berdiam diri. Kemudian, seorang lagi lelaki lalu di hadapan baginda. Rasulullah SAW bertanya kepada lelaki yang sama (sahabat baginda), \"Apakah pendapatmu tentang orang ini?\"  Jawabnya, \"Wahai Rasulullah SAW! Ini adalah seorang lelaki daripada kalangan fakir miskin umat Islam. Sekiranya dia meminang wanita, nescaya dia akan ditolak, dan sekiranya dia bersyafaat, nescaya syafaatnya tidak akan diterima, dan sekiranya dia berkata-kata, nescaya tidak seorang pun akan mendengar kata-katanya.\"  Lalu Rasulullah SAW bersabda, \"Lelaki miskin ini lebih baik daripada jumlah yang ramai seperti lelaki kaya tadi sehingga memenuhi muka bumi ini.\""
  },
  {
    "id": 6209,
    "hadith_number": 6209,
    "tajuk_hadith": "Penghijrahan dan Ganjaran Akhirat",
    "perawi_melayu": "Riwayat Abu Wail:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الأَعْمَشُ، قَالَ سَمِعْتُ أَبَا وَائِلٍ، قَالَ عُدْنَا خَبَّابًا فَقَالَ هَاجَرْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم نُرِيدُ وَجْهَ اللَّهِ، فَوَقَعَ أَجْرُنَا عَلَى اللَّهِ، فَمِنَّا مَنْ مَضَى لَمْ يَأْخُذْ مِنْ أَجْرِهِ، مِنْهُمْ مُصْعَبُ بْنُ عُمَيْرٍ قُتِلَ يَوْمَ أُحُدٍ، وَتَرَكَ نَمِرَةً فَإِذَا غَطَّيْنَا رَأْسَهُ بَدَتْ رِجْلاَهُ، وَإِذَا غَطَّيْنَا رِجْلَيْهِ بَدَا رَأْسُهُ، فَأَمَرَنَا النَّبِيُّ صلى الله عليه وسلم أَنْ نُغَطِّيَ رَأْسَهُ، وَنَجْعَلَ عَلَى رِجْلَيْهِ مِنَ الإِذْخِرِ، وَمِنَّا مَنْ أَيْنَعَتْ لَهُ ثَمَرَتُهُ فَهْوَ يَهْدُبُهَا‏.‏",
    "malay_translation": "Kami telah melawat Khabbab yang ketika itu sakit, lalu dia berkata, \"Kami berhijrah bersama Nabi ﷺ kerana mengharapkan keredaan Allah, maka ganjaran kami terletak di sisi Allah.  Antara kami ada yang telah meninggal dunia tanpa menerima ganjarannya, antaranya Mus'ab bin Umair yang syahid pada hari perang Uhud, dan hanya meninggalkan sehelai kain kapan.  Jika kami menutup kepalanya, kakinya terdedah, dan jika kami menutup kakinya, kepalanya terdedah. Maka Nabi ﷺ memerintahkan kami untuk menutup kepalanya dan meletakkan rumput Idhkhir di atas kakinya. Dan di antara kami juga ada yang telah menuai hasil amalan baiknya dan sedang menikmatinya di dunia ini.\""
  },
  {
    "id": 6210,
    "hadith_number": 6210,
    "tajuk_hadith": "Penduduk Syurga dan Neraka",
    "perawi_melayu": "Daripada Imran bin Husain:",
    "english_text": "The Prophet (ﷺ) said, \"I looked into Paradise and found that the majority of its dwellers were the poor \npeople, and I looked into the (Hell) Fire and found that the majority of its dwellers were women.\"",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا سَلْمُ بْنُ زَرِيرٍ، حَدَّثَنَا أَبُو رَجَاءٍ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ اطَّلَعْتُ فِي الْجَنَّةِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا الْفُقَرَاءَ، وَاطَّلَعْتُ فِي النَّارِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ ‏\"‏‏.‏ تَابَعَهُ أَيُّوبُ وَعَوْفٌ، وَقَالَ صَخْرٌ وَحَمَّادُ بْنُ نَجِيحٍ عَنْ أَبِي رَجَاءٍ عَنِ ابْنِ عَبَّاسٍ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Aku melihat ke dalam Syurga, lalu aku mendapati bahawa kebanyakan penduduknya ialah orang-orang miskin. Dan aku melihat ke dalam Neraka, lalu aku mendapati bahawa kebanyakan penduduknya ialah wanita.\""
  },
  {
    "id": 6211,
    "hadith_number": 6211,
    "tajuk_hadith": "Rasulullah SAW Tidak Makan di Meja dan Roti Halus Sehingga Wafat",
    "perawi_melayu": "Riwayat Anas:",
    "english_text": "The Prophet (ﷺ) did not eat at a table till he died, and he did not eat a thin nicely baked wheat bread till he died.",
    "arabic_text": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ لَمْ يَأْكُلِ النَّبِيُّ صلى الله عليه وسلم عَلَى خِوَانٍ حَتَّى مَاتَ، وَمَا أَكَلَ خُبْزًا مُرَقَّقًا حَتَّى مَاتَ‏.‏",
    "malay_translation": "Anas r.a. berkata, Nabi SAW tidak makan di atas meja sehingga baginda wafat, dan baginda tidak makan roti gandum yang nipis dan halus sehingga baginda wafat."
  },
  {
    "id": 6212,
    "hadith_number": 6212,
    "tajuk_hadith": "Kehidupan Sederhana Aisyah Selepas Wafatnya Nabi SAW",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "When the Prophet (ﷺ) died, nothing which can be eaten by a living creature was left on my shelf except \nsome barley grain. I ate of it for a period and when I measured it, it finished.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَقَدْ تُوُفِّيَ النَّبِيُّ صلى الله عليه وسلم وَمَا فِي رَفِّي مِنْ شَىْءٍ يَأْكُلُهُ ذُو كَبِدٍ، إِلاَّ شَطْرُ شَعِيرٍ فِي رَفٍّ لِي، فَأَكَلْتُ مِنْهُ حَتَّى طَالَ عَلَىَّ، فَكِلْتُهُ، فَفَنِيَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Abi Syaibah, telah menceritakan kepada kami Abu Usamah, telah menceritakan kepada kami Hisyam, daripada bapanya, daripada Aisyah -radiallahu ‘anha- berkata, \"Sesungguhnya Nabi shallallahu ‘alaihi wasallam telah wafat, dan tidak ada dalam rakku sesuatu yang boleh dimakan oleh makhluk yang bernyawa, melainkan sedikit sahaja barli di dalam rakku. Maka aku memakannya sehingga lama, kemudian aku menimbangnya, dan ia telah habis.\""
  },
  {
    "id": 6213,
    "hadith_number": 6213,
    "tajuk_hadith": "Kebaikan Rasulullah SAW kepada Abu Hurairah dan Ahli Suffah",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي أَبُو نُعَيْمٍ، بِنَحْوٍ مِنْ نِصْفِ هَذَا الْحَدِيثِ حَدَّثَنَا عُمَرُ بْنُ ذَرٍّ، حَدَّثَنَا مُجَاهِدٌ، أَنَّ أَبَا هُرَيْرَةَ، كَانَ يَقُولُ آللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ إِنْ كُنْتُ لأَعْتَمِدُ بِكَبِدِي عَلَى الأَرْضِ مِنَ الْجُوعِ، وَإِنْ كُنْتُ لأَشُدُّ الْحَجَرَ عَلَى بَطْنِي مِنَ الْجُوعِ، وَلَقَدْ قَعَدْتُ يَوْمًا عَلَى طَرِيقِهِمُ الَّذِي يَخْرُجُونَ مِنْهُ، فَمَرَّ أَبُو بَكْرٍ، فَسَأَلْتُهُ عَنْ آيَةٍ مِنْ كِتَابِ اللَّهِ، مَا سَأَلْتُهُ إِلاَّ لِيُشْبِعَنِي، فَمَرَّ وَلَمْ يَفْعَلْ، ثُمَّ مَرَّ بِي عُمَرُ فَسَأَلْتُهُ عَنْ آيَةٍ مِنْ كِتَابِ اللَّهِ، مَا سَأَلْتُهُ إِلاَّ لِيُشْبِعَنِي، فَمَرَّ فَلَمْ يَفْعَلْ، ثُمَّ مَرَّ بِي أَبُو الْقَاسِمِ صلى الله عليه وسلم فَتَبَسَّمَ حِينَ رَآنِي وَعَرَفَ، مَا فِي نَفْسِي وَمَا فِي وَجْهِي ثُمَّ قَالَ ‏\"‏ أَبَا هِرٍّ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ الْحَقْ ‏\"‏‏.‏ وَمَضَى فَتَبِعْتُهُ، فَدَخَلَ فَاسْتَأْذَنَ، فَأَذِنَ لِي، فَدَخَلَ فَوَجَدَ لَبَنًا فِي قَدَحٍ فَقَالَ ‏\"‏ مِنْ أَيْنَ هَذَا اللَّبَنُ ‏\"‏‏.‏ قَالُوا أَهْدَاهُ لَكَ فُلاَنٌ أَوْ فُلاَنَةُ‏.‏ قَالَ ‏\"‏ أَبَا هِرٍّ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ الْحَقْ إِلَى أَهْلِ الصُّفَّةِ فَادْعُهُمْ لِي ‏\"‏‏.‏ قَالَ وَأَهْلُ الصُّفَّةِ أَضْيَافُ الإِسْلاَمِ، لاَ يَأْوُونَ إِلَى أَهْلٍ وَلاَ مَالٍ، وَلاَ عَلَى أَحَدٍ، إِذَا أَتَتْهُ صَدَقَةٌ بَعَثَ بِهَا إِلَيْهِمْ، وَلَمْ يَتَنَاوَلْ مِنْهَا شَيْئًا، وَإِذَا أَتَتْهُ هَدِيَّةٌ أَرْسَلَ إِلَيْهِمْ، وَأَصَابَ مِنْهَا وَأَشْرَكَهُمْ فِيهَا، فَسَاءَنِي ذَلِكَ فَقُلْتُ وَمَا هَذَا اللَّبَنُ فِي أَهْلِ الصُّفَّةِ كُنْتُ أَحَقُّ أَنَا أَنْ أُصِيبَ مِنْ هَذَا اللَّبَنِ شَرْبَةً أَتَقَوَّى بِهَا، فَإِذَا جَاءَ أَمَرَنِي فَكُنْتُ أَنَا أُعْطِيهِمْ، وَمَا عَسَى أَنْ يَبْلُغَنِي مِنْ هَذَا اللَّبَنِ، وَلَمْ يَكُنْ مِنْ طَاعَةِ اللَّهِ وَطَاعَةِ رَسُولِهِ صلى الله عليه وسلم بُدٌّ، فَأَتَيْتُهُمْ فَدَعَوْتُهُمْ فَأَقْبَلُوا، فَاسْتَأْذَنُوا فَأَذِنَ لَهُمْ، وَأَخَذُوا مَجَالِسَهُمْ مِنَ الْبَيْتِ قَالَ ‏\"‏ يَا أَبَا هِرٍّ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ خُذْ فَأَعْطِهِمْ ‏\"‏‏.‏ قَالَ فَأَخَذْتُ الْقَدَحَ فَجَعَلْتُ أُعْطِيهِ الرَّجُلَ فَيَشْرَبُ حَتَّى يَرْوَى، ثُمَّ يَرُدُّ عَلَىَّ الْقَدَحَ، فَأُعْطِيهِ الرَّجُلَ فَيَشْرَبُ حَتَّى يَرْوَى، ثُمَّ يَرُدُّ عَلَىَّ الْقَدَحَ فَيَشْرَبُ حَتَّى يَرْوَى، ثُمَّ يَرُدُّ عَلَىَّ الْقَدَحَ، حَتَّى انْتَهَيْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم وَقَدْ رَوِيَ الْقَوْمُ كُلُّهُمْ، فَأَخَذَ الْقَدَحَ فَوَضَعَهُ عَلَى يَدِهِ فَنَظَرَ إِلَىَّ فَتَبَسَّمَ فَقَالَ ‏\"‏ أَبَا هِرٍّ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ بَقِيتُ أَنَا وَأَنْتَ ‏\"‏‏.‏ قُلْتُ صَدَقْتَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ اقْعُدْ فَاشْرَبْ ‏\"‏‏.‏ فَقَعَدْتُ فَشَرِبْتُ‏.‏ فَقَالَ ‏\"‏ اشْرَبْ ‏\"‏‏.‏ فَشَرِبْتُ، فَمَا زَالَ يَقُولُ ‏\"‏ اشْرَبْ ‏\"‏‏.‏ حَتَّى قُلْتُ لاَ وَالَّذِي بَعَثَكَ بِالْحَقِّ، مَا أَجِدُ لَهُ مَسْلَكًا‏.‏ قَالَ ‏\"‏ فَأَرِنِي ‏\"‏‏.‏ فَأَعْطَيْتُهُ الْقَدَحَ فَحَمِدَ اللَّهَ وَسَمَّى، وَشَرِبَ الْفَضْلَةَ‏.‏",
    "malay_translation": "Abu Hurairah berkata: Demi Allah SWT yang tiada Tuhan melainkan Dia, aku pernah bersandar dengan hatiku ke tanah kerana kelaparan, dan aku pernah mengikat batu ke perutku kerana kelaparan.  Suatu hari, aku duduk di jalan yang mereka (Nabi SAW dan para sahabat) laluinya. Lalu Abu Bakar lalu, maka aku bertanya kepadanya tentang satu ayat dari Kitab Allah, aku tidak bertanya kepadanya melainkan untuk mengenyangkan perutku, tetapi beliau lalu tanpa berbuat demikian. Kemudian Umar lalu, maka aku bertanya kepadanya tentang satu ayat dari Kitab Allah, aku tidak bertanya kepadanya melainkan untuk mengenyangkan perutku, tetapi beliau lalu tanpa berbuat demikian. Kemudian Abu Qasim (Nabi SAW) lalu, lalu Baginda tersenyum melihatku, kerana Baginda mengetahui apa yang ada di hati dan wajahku.  Kemudian Baginda berkata, \"Wahai Abu Hurairah!\" Aku menjawab, \"Labbaik, ya Rasulullah!\" Baginda bersabda, \"Ikutlah aku.\" Baginda pun pergi dan aku mengikutinya.  Baginda masuk ke rumah dan aku meminta izin untuk masuk, lalu aku diizinkan.  Baginda dapati susu dalam sebuah cawan, lalu Baginda bertanya, \"Dari manakah susu ini?\" Mereka menjawab, \"Ia dihadiahkan kepada tuan oleh si fulan atau si fulanah.\" Baginda bersabda, \"Wahai Abu Hurairah!\" Aku menjawab, \"Labbaik, ya Rasulullah!\" Baginda bersabda, \"Pergi panggil ahli Suffah kepadaku.\"  Ahli Suffah adalah tetamu Islam yang tidak mempunyai keluarga, harta, dan tidak bergantung kepada sesiapa.  Apabila ada sedekah yang sampai kepada Nabi SAW, Baginda akan menghantarnya kepada mereka dan tidak mengambil sesuatu pun darinya.  Apabila ada hadiah yang sampai kepada Baginda, Baginda akan menghantar sebahagiannya kepada mereka dan mengambil sebahagian untuk diri Baginda.  Perkara itu membuatku sedih, lalu aku berkata dalam hati, \"Bagaimanakah sedikit susu ini mencukupi untuk ahli Suffah?  Sedangkan aku lebih berhak meminum susu itu untuk menguatkan diriku.\" Tetapi rupa-rupanya Nabi SAW menyuruhku memberi susu itu kepada mereka.  Aku tertanya-tanya, berapakah yang akan tinggal untukku?  Tetapi bagaimanapun, aku tidak dapat melainkan taat kepada Allah dan Rasul-Nya.  Maka aku pergi kepada ahli Suffah dan memanggil mereka, lalu mereka datang dan meminta izin kepada Nabi SAW untuk masuk.  Mereka diizinkan dan duduk dalam rumah.  Nabi SAW bersabda, \"Wahai Abu Hurairah!\" Aku menjawab, \"Labbaik, ya Rasulullah!\" Baginda bersabda, \"Ambil dan berikan kepada mereka.\" Maka aku mengambil cawan (susu) itu dan mula memberi kepada seorang demi seorang sehingga mereka kenyang, kemudian mereka mengembalikan cawan itu kepadaku.  Akhirnya, setelah semua orang kenyang, aku sampai kepada Nabi SAW. Baginda mengambil cawan itu dan meletakkannya di tangan Baginda, lalu Baginda memandangku dan tersenyum sambil bersabda, \"Wahai Abu Hurairah!\" Aku menjawab, \"Labbaik, ya Rasulullah!\" Baginda bersabda, \"Tinggal aku dan engkau.\" Aku berkata, \"Benar, ya Rasulullah!\" Baginda bersabda, \"Duduk dan minum.\" Aku duduk dan minum.  Baginda bersabda, \"Minumlah.\" Aku pun minum. Baginda terus-menerus menyuruhku minum sehingga aku berkata, \"Tidak, demi Allah yang mengutusmu dengan kebenaran, aku tidak lagi mampu meminumnya.\"  Baginda bersabda, \"Berikan kepadaku.\"  Setelah aku memberikan cawan itu kepada Baginda, Baginda memuji Allah SWT, menyebut nama Allah SWT, dan meminum baki susu itu."
  },
  {
    "id": 6214,
    "hadith_number": 6214,
    "tajuk_hadith": "Pengorbanan Sahabat dan Kehilangan Nilai",
    "perawi_melayu": "Daripada Sa`d:",
    "english_text": "I was the first man among the Arabs to throw an arrow for Allah's Cause. We used to fight in Allah's \nCause while we had nothing to eat except the leaves of the Hubla and the Sumur trees (desert trees) so \nthat we discharged excrement like that of sheep (i.e. unmixed droppings). Today the (people of the) \ntribe of Bani Asad teach me the laws of Islam. If so, then I am lost, and all my efforts of that hard time \nhad gone in vain.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ، حَدَّثَنَا قَيْسٌ، قَالَ سَمِعْتُ سَعْدًا، يَقُولُ إِنِّي لأَوَّلُ الْعَرَبِ رَمَى بِسَهْمٍ فِي سَبِيلِ اللَّهِ، وَرَأَيْتُنَا نَغْزُو، وَمَا لَنَا طَعَامٌ إِلاَّ وَرَقُ الْحُبْلَةِ وَهَذَا السَّمُرُ، وَإِنَّ أَحَدَنَا لَيَضَعُ كَمَا تَضَعُ الشَّاةُ، مَا لَهُ خِلْطٌ، ثُمَّ أَصْبَحَتْ بَنُو أَسَدٍ تُعَزِّرُنِي عَلَى الإِسْلاَمِ، خِبْتُ إِذًا وَضَلَّ سَعْيِي‏.‏",
    "malay_translation": "Akulah orang Arab pertama yang memanah demi jalan Allah.  Kami pernah berjihad di jalan Allah, dan makanan kami hanyalah daun-daun pohon Hublah dan Samur (pohon-pohon padang pasir), sehingga najis kami seperti najis kambing (iaitu, najis yang tidak bercampur).  Kini, Bani Asad pula yang mengajar aku hukum-hukum Islam. Jika begitu, maka aku telah rugi, dan segala usahaku pada masa susah itu telah sia-sia."
  },
  {
    "id": 6215,
    "hadith_number": 6215,
    "tajuk_hadith": "Keluarga Nabi Muhammad SAW dan Makanan Roti Gandum",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "The family of Muhammad had never eaten their fill of wheat bread for three successive days since \nthey had migrated to Medina till the death of the Prophet.",
    "arabic_text": "حَدَّثَنِي عُثْمَانُ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ مَا شَبِعَ آلُ مُحَمَّدٍ صلى الله عليه وسلم مُنْذُ قَدِمَ الْمَدِينَةَ مِنْ طَعَامِ بُرٍّ ثَلاَثَ لَيَالٍ تِبَاعًا حَتَّى قُبِضَ‏.‏",
    "malay_translation": "Aisyah berkata:  Sejak hijrah ke Madinah sehingga wafatnya Nabi SAW, keluarga Muhammad SAW tidak pernah kenyang makan roti gandum selama tiga hari berturut-turut."
  },
  {
    "id": 6216,
    "hadith_number": 6216,
    "tajuk_hadith": "Keluarga Muhammad SAW Hanya Makan Satu Hidangan Sehari",
    "perawi_melayu": "Daripada Aisyah r.a.",
    "english_text": "The family of Muhammad did not eat two meals on one day, but one of the two was of dates.",
    "arabic_text": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ، حَدَّثَنَا إِسْحَاقُ ـ هُوَ الأَزْرَقُ ـ عَنْ مِسْعَرِ بْنِ كِدَامٍ، عَنْ هِلاَلٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا أَكَلَ آلُ مُحَمَّدٍ صلى الله عليه وسلم أَكْلَتَيْنِ فِي يَوْمٍ، إِلاَّ إِحْدَاهُمَا تَمْرٌ‏.‏",
    "malay_translation": "Aisyah r.a. berkata, \"Keluarga Muhammad SAW tidak pernah makan dua kali dalam sehari, melainkan salah satu hidangannya adalah kurma.\""
  },
  {
    "id": 6217,
    "hadith_number": 6217,
    "tajuk_hadith": "Tilam Rasulullah SAW",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "The bed mattress of the Prophet (ﷺ) was made of a leather case stuffed with palm fibres.",
    "arabic_text": "حَدَّثَنِي أَحْمَدُ بْنُ أَبِي رَجَاءٍ، حَدَّثَنَا النَّضْرُ، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ، قَالَتْ كَانَ فِرَاشُ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ أَدَمٍ، وَحَشْوُهُ مِنْ لِيفٍ‏.‏",
    "malay_translation": "Aisyah berkata: “Tilam Rasulullah SAW diperbuat daripada kulit, dan isinya daripada serat pelepah kurma.”"
  },
  {
    "id": 6218,
    "hadith_number": 6218,
    "tajuk_hadith": "Kesederhanaan Kehidupan Nabi SAW",
    "perawi_melayu": "Riwayat Qatadah:",
    "english_text": "We used to go to Anas bin Malik and see his baker standing (preparing the bread). Anas said, \"Eat. I \nhave not known that the Prophet (ﷺ) ever saw a thin well-baked loaf of bread till he died, and he never \nsaw a roasted sheep with his eyes.\"",
    "arabic_text": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى، حَدَّثَنَا قَتَادَةُ، قَالَ كُنَّا نَأْتِي أَنَسَ بْنَ مَالِكٍ وَخَبَّازُهُ قَائِمٌ وَقَالَ كُلُوا فَمَا أَعْلَمُ النَّبِيَّ صلى الله عليه وسلم رَأَى رَغِيفًا مُرَقَّقًا، حَتَّى لَحِقَ بِاللَّهِ، وَلاَ رَأَى شَاةً سَمِيطًا بِعَيْنِهِ قَطُّ‏.‏",
    "malay_translation": "Kami selalu mengunjungi Anas bin Malik dan melihat tukang roti baginda sedang membuat roti. Anas berkata, \"Makanlah.  Aku tidak pernah tahu bahawa Nabi SAW pernah melihat roti yang nipis dan masak elok sehingga baginda wafat, dan baginda juga tidak pernah melihat kambing yang dipanggang dengan matanya sendiri.\""
  },
  {
    "id": 6219,
    "hadith_number": 6219,
    "tajuk_hadith": "Kehidupan Sederhana Sahabat",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "A complete month would pass by during which we would not make a fire (for cooking), and our food \nused to be only dates and water unless we were given a present of some meat.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، حَدَّثَنَا هِشَامٌ، أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ يَأْتِي عَلَيْنَا الشَّهْرُ مَا نُوقِدُ فِيهِ نَارًا، إِنَّمَا هُوَ التَّمْرُ وَالْمَاءُ، إِلاَّ أَنْ نُؤْتَى بِاللُّحَيْمِ‏.‏",
    "malay_translation": "Aisyah r.a. berkata: “Kadang-kadang sebulan berlalu tanpa kami menyalakan api untuk memasak. Makanan kami hanyalah tamar dan air, kecuali jika kami diberi daging sebagai hadiah.”"
  },
  {
    "id": 6220,
    "hadith_number": 6220,
    "tajuk_hadith": "Kehidupan Sederhana Rasulullah SAW",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ الأُوَيْسِيُّ، حَدَّثَنِي ابْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ يَزِيدَ بْنِ رُومَانَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ لِعُرْوَةَ ابْنَ أُخْتِي إِنْ كُنَّا لَنَنْظُرُ إِلَى الْهِلاَلِ ثَلاَثَةَ أَهِلَّةٍ فِي شَهْرَيْنِ، وَمَا أُوقِدَتْ فِي أَبْيَاتِ رَسُولِ اللَّهِ صلى الله عليه وسلم نَارٌ‏.‏ فَقُلْتُ مَا كَانَ يُعِيشُكُمْ قَالَتِ الأَسْوَدَانِ التَّمْرُ وَالْمَاءُ إِلاَّ أَنَّهُ قَدْ كَانَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم جِيرَانٌ مِنَ الأَنْصَارِ كَانَ لَهُمْ مَنَائِحُ، وَكَانُوا يَمْنَحُونَ رَسُولَ اللَّهِ صلى الله عليه وسلم مِنْ أَبْيَاتِهِمْ، فَيَسْقِينَاهُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abd al-'Aziz bin Abd Allah al-Uwaisi, telah menceritakan kepadaku Ibnu Abi Hazim, dari bapanya, dari Yazid bin Ruman, dari Urwah, dari Aisyah, bahawa dia berkata kepada Urwah, anak saudara perempuan saya: \"Kami pernah melihat tiga anak bulan dalam tempoh dua bulan, dan tidak pernah ada api yang dinyalakan di rumah Rasulullah SAW.\"  Maka aku bertanya, \"Apakah yang menjadi makanan kamu?\"  Dia menjawab, \"Dua benda yang hitam iaitu tamar dan air, kecuali bahawa Rasulullah SAW mempunyai jiran-jiran daripada kalangan Ansar yang mempunyai unta-unta betina yang memberi susu, dan mereka memberi susu kepada Rasulullah SAW dari rumah mereka, lalu baginda memberi minuman kepada kami.\""
  },
  {
    "id": 6221,
    "hadith_number": 6221,
    "tajuk_hadith": "Doa Rasulullah untuk Keluarga Baginda",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "Allah's Messenger (ﷺ) said, \"O Allah! Give food to the family of Muhammad.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنْ عُمَارَةَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اللَّهُمَّ ارْزُقْ آلَ مُحَمَّدٍ قُوتًا ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Ya Allah, berikanlah rezeki makanan kepada keluarga Muhammad.\""
  },
  {
    "id": 6222,
    "hadith_number": 6222,
    "tajuk_hadith": "Amalan Yang Paling Disukai Nabi SAW",
    "perawi_melayu": "Riwayat Masruq:",
    "english_text": "I asked `Aisha \"What deed was the most beloved to the Prophet?\" She said, \"The regular constant \none.\" I said, \"At what time did he use to get up at night (for the Tahajjud night prayer)?' She said, \"He \nused to get up on hearing (the crowing of) the cock (the last third of the night).",
    "arabic_text": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا أَبِي، عَنْ شُعْبَةَ، عَنْ أَشْعَثَ، قَالَ سَمِعْتُ أَبِي قَالَ، سَمِعْتُ مَسْرُوقًا، قَالَ سَأَلْتُ عَائِشَةَ ـ رضى الله عنها ـ أَىُّ الْعَمَلِ كَانَ أَحَبَّ إِلَى النَّبِيِّ صلى الله عليه وسلم قَالَتِ الدَّائِمُ‏.‏ قَالَ قُلْتُ فَأَىَّ حِينٍ كَانَ يَقُومُ قَالَتْ كَانَ يَقُومُ إِذَا سَمِعَ الصَّارِخَ‏.‏",
    "malay_translation": "Aku bertanya kepada Aisyah, \"Amalan apakah yang paling disukai oleh Nabi?\"  Beliau menjawab, \"Amalan yang berterusan.\" Aku bertanya lagi, \"Pada bilakah baginda bangun pada waktu malam (untuk solat Tahajjud)?\" Beliau menjawab, \"Baginda bangun apabila mendengar bunyi ayam jantan (pada sepertiga malam yang akhir).\""
  },
  {
    "id": 6223,
    "hadith_number": 6223,
    "tajuk_hadith": "Amalan Yang Paling Disukai Allah",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "The most beloved action to Allah's Messenger (ﷺ) was that whose doer did it continuously and regularly.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ كَانَ أَحَبُّ الْعَمَلِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم الَّذِي يَدُومُ عَلَيْهِ صَاحِبُهُ‏.‏",
    "malay_translation": "Daripada Aisyah r.a. berkata: Amalan yang paling disukai oleh Rasulullah SAW ialah amalan yang dilakukan secara berterusan dan istiqamah."
  },
  {
    "id": 6224,
    "hadith_number": 6224,
    "tajuk_hadith": "Amalan Tidak Mencukupi Tanpa Rahmat Allah",
    "perawi_melayu": "Riwayat Abu Hurairah",
    "english_text": "Allah's Messenger (ﷺ) said, \"The deeds of anyone of you will not save you (from the (Hell) Fire).\"",
    "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَنْ يُنَجِّيَ أَحَدًا مِنْكُمْ عَمَلُهُ ‏\"‏‏.‏ قَالُوا وَلاَ أَنْتَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَلاَ أَنَا، إِلاَّ أَنْ يَتَغَمَّدَنِي اللَّهُ بِرَحْمَةٍ، سَدِّدُوا وَقَارِبُوا، وَاغْدُوا وَرُوحُوا، وَشَىْءٌ مِنَ الدُّلْجَةِ‏.‏ وَالْقَصْدَ الْقَصْدَ تَبْلُغُوا ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Amalan seseorang di antara kamu tidak akan menyelamatkannya (dari api neraka).\" Mereka bertanya, \"Bahkan engkau juga wahai Rasulullah?\" Baginda menjawab, \"Bahkan aku pun tidak, kecuali jika Allah SWT melimpahkan rahmat-Nya kepadaku. Oleh itu, lakukanlah amal dengan ikhlas dan sederhana, serta beribadah kepada Allah SWT di waktu pagi, petang dan sebahagian daripada waktu malam. Sentiasalah bersederhana dan konsisten, nescaya kamu akan mencapai matlamat (syurga).\""
  },
  {
    "id": 6225,
    "hadith_number": 6225,
    "tajuk_haditi": "Amalan yang Diterima Allah",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "Allah's Messenger (ﷺ) said, \"Do good deeds properly, sincerely and moderately and know that your deeds \nwill not make you enter Paradise, and that the most beloved deed to Allah is the most regular and \nconstant even if it were little.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُلَيْمَانُ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ سَدِّدُوا وَقَارِبُوا، وَاعْلَمُوا أَنْ لَنْ يُدْخِلَ أَحَدَكُمْ عَمَلُهُ الْجَنَّةَ، وَأَنَّ أَحَبَّ الأَعْمَالِ أَدْوَمُهَا إِلَى اللَّهِ، وَإِنْ قَلَّ ‏\"‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Lakukan amal soleh dengan cara yang betul, ikhlas dan sederhana. Ketahuilah bahawa amalan kamu tidak akan memasukkan kamu ke dalam syurga. Dan amal yang paling disukai oleh Allah ialah amal yang paling istiqamah walaupun sedikit.\""
  },
  {
    "id": 6226,
    "hadith_number": 6226,
    "tajuk_hadith": "Amalan Yang Paling Dicintai Allah",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "The Prophet (ﷺ) was asked, \"What deeds are loved most by Allah?\" He said, \"The most regular constant \ndeeds even though they may be few.\" He added, 'Don't take upon yourselves, except the deeds which \nare within your ability.\"",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ عَرْعَرَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتْ سُئِلَ النَّبِيُّ صلى الله عليه وسلم أَىُّ الأَعْمَالِ أَحَبُّ إِلَى اللَّهِ قَالَ ‏\"‏ أَدْوَمُهَا وَإِنْ قَلَّ ‏\"‏‏.‏ وَقَالَ ‏\"‏ اكْلَفُوا مِنَ الأَعْمَالِ مَا تُطِيقُونَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW ditanya, \"Amalan apakah yang paling dicintai oleh Allah?\" Baginda menjawab, \"Amalan yang paling istiqamah, walaupun sedikit.\" Baginda menambah, \"Lakukanlah amalan yang mampu kamu lakukan.\""
  },
  {
    "id": 6227,
    "hadith_number": 6227,
    "tajuk_hadith": "Amalan Nabi SAW Yang Tetap Dan Istiqamah",
    "perawi_melayu": "Riwayat Alqamah",
    "english_text": "I asked `Aisha, mother of the believers, \"O mother of the believers! How were the deeds of the \nProphet? Did he use to do extra deeds of worship on special days?\" She said, \"No, but his deeds were \nregular and constant, and who among you is able to do what the Prophet (ﷺ) was able to do (i.e. in \nworshipping Allah)?\"",
    "arabic_text": "حَدَّثَنِي عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، قَالَ سَأَلْتُ أُمَّ الْمُؤْمِنِينَ عَائِشَةَ قُلْتُ يَا أُمَّ الْمُؤْمِنِينَ كَيْفَ كَانَ عَمَلُ النَّبِيِّ صلى الله عليه وسلم هَلْ كَانَ يَخُصُّ شَيْئًا مِنَ الأَيَّامِ قَالَتْ لاَ، كَانَ عَمَلُهُ دِيمَةً، وَأَيُّكُمْ يَسْتَطِيعُ مَا كَانَ النَّبِيُّ صلى الله عليه وسلم يَسْتَطِيعُ‏.‏",
    "malay_translation": "Aku bertanya kepada Ummu al-Mu'minin Aisyah, \"Wahai Ummu al-Mu'minin! Bagaimanakah amalan Nabi SAW? Adakah baginda melakukan amalan ibadah tambahan pada hari-hari tertentu?\"  Jawabnya, \"Tidak, amalan baginda tetap dan istiqamah, dan siapakah di antara kamu yang mampu melakukan apa yang mampu dilakukan oleh Nabi SAW (iaitu dalam beribadah kepada Allah)?\""
  },
  {
    "id": 6228,
    "hadith_number": 6228,
    "tajuk_hadith": "Amal Soleh dan Rahmat Allah",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُحَمَّدُ بْنُ الزِّبْرِقَانِ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ سَدِّدُوا وَقَارِبُوا، وَأَبْشِرُوا، فَإِنَّهُ لاَ يُدْخِلُ أَحَدًا الْجَنَّةَ عَمَلُهُ ‏\"‏‏.‏ قَالُوا وَلاَ، أَنْتَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَلاَ أَنَا إِلاَّ أَنْ يَتَغَمَّدَنِي اللَّهُ بِمَغْفِرَةٍ وَرَحْمَةٍ ‏\"‏‏.‏ قَالَ أَظُنُّهُ عَنْ أَبِي النَّضْرِ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ‏.‏   \nوَقَالَ عَفَّانُ حَدَّثَنَا وُهَيْبٌ، عَنْ مُوسَى بْنِ عُقْبَةَ، قَالَ سَمِعْتُ أَبَا سَلَمَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ سَدِّدُوا وَأَبْشِرُوا ‏\"‏‏.‏ وَقَالَ مُجَاهِدٌ ‏{‏قَوْلاً سَدِيدًا‏}‏ وَسَدَادًا صِدْقًا‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ali bin Abdullah, telah menceritakan kepada kami Muhammad bin Az-Zubaiqan, telah menceritakan kepada kami Musa bin Aqabah, dari Abu Salamah bin Abdurrahman, dari Aisyah, dari Nabi SAW, baginda bersabda:  \"Lakukanlah amal soleh dengan betul, ikhlas dan sederhana, dan bergembiralah, kerana sesungguhnya amalan seseorang tidak akan memasukkannya ke dalam syurga.\" Mereka bertanya, \"Bahkan engkau wahai Rasulullah?\" Baginda menjawab, \"Bahkan aku, melainkan jika Allah SWT melimpahkan keampunan dan rahmat kepada ku.\"  Ia berkata, aku menyangka ia dari Abu Nadhr, dari Abu Salamah, dari Aisyah.\nDan telah berkata 'Affan, telah menceritakan kepada kami Wahhab, dari Musa bin Aqabah, katanya aku mendengar Abu Salamah, dari Aisyah, dari Nabi SAW:  \"Lakukanlah dengan betul dan bergembiralah.\" Dan Mujahid berkata: {Perkataan yang benar} dan kesungguhan adalah kejujuran."
  },
  {
    "id": 6229,
    "hadith_number": 6229,
    "tajuk_hadith": "Penglihatan Syurga dan Neraka",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا مُحَمَّدُ بْنُ فُلَيْحٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ هِلاَلِ بْنِ عَلِيٍّ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ سَمِعْتُهُ يَقُولُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى لَنَا يَوْمًا الصَّلاَةَ، ثُمَّ رَقِيَ الْمِنْبَرَ فَأَشَارَ بِيَدِهِ قِبَلَ قِبْلَةِ الْمَسْجِدِ، فَقَالَ ‏\n\"‏ قَدْ أُرِيتُ الآنَ ـ مُنْذُ صَلَّيْتُ لَكُمُ الصَّلاَةَ ـ الْجَنَّةَ وَالنَّارَ مُمَثَّلَتَيْنِ فِي قُبُلِ هَذَا الْجِدَارِ، فَلَمْ أَرَ كَالْيَوْمِ فِي الْخَيْرِ وَالشَّرِّ، فَلَمْ أَرَ كَالْيَوْمِ فِي الْخَيْرِ وَالشَّرِّ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ibrahim bin al-Mundzir, telah menceritakan kepada kami Muhammad bin Fulaih, dia berkata; telah menceritakan kepadaku ayahku, daripada Hilal bin Ali, daripada Anas bin Malik - raḍiyallāhu ‘anhu - dia berkata: Aku mendengar baginda berkata: Sesungguhnya Rasulullah ﷺ telah mengetuai kami solat suatu hari, kemudian baginda naik mimbar lalu baginda menunjuk dengan tangan baginda ke arah kiblat masjid, lalu baginda bersabda: \"Sesungguhnya aku telah diperlihatkan ketika aku mengetuai kamu solat tadi, syurga dan neraka, dua-duanya di hadapan tembok ini. Maka aku tidak pernah melihat seperti hari ini dari segi kebaikan dan kejahatan, aku tidak pernah melihat seperti hari ini dari segi kebaikan dan kejahatan.\""
  },
  {
    "id": 6230,
    "hadith_number": 6230,
    "tajuk_hadith": "Rahmat Allah yang Melimpah Ruah",
    "perawi_melayu": "Riwayat Abu Hurairah",
    "english_text": "I heard Allah's Messenger (ﷺ) saying, Verily Allah created Mercy. The day He created it, He made it into one \nhundred parts. He withheld with Him ninety-nine parts, and sent its one part to all His creatures. Had \nthe non-believer known of all the Mercy which is in the Hands of Allah, he would not lose hope of \nentering Paradise, and had the believer known of all the punishment which is present with Allah, he \nwould not consider himself safe from the Hell-Fire.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ اللَّهَ خَلَقَ الرَّحْمَةَ يَوْمَ خَلَقَهَا مِائَةَ رَحْمَةٍ، فَأَمْسَكَ عِنْدَهُ تِسْعًا وَتِسْعِينَ رَحْمَةً، وَأَرْسَلَ فِي خَلْقِهِ كُلِّهِمْ رَحْمَةً وَاحِدَةً، فَلَوْ يَعْلَمُ الْكَافِرُ بِكُلِّ الَّذِي عِنْدَ اللَّهِ مِنَ الرَّحْمَةِ لَمْ يَيْأَسْ مِنَ الْجَنَّةِ، وَلَوْ يَعْلَمُ الْمُؤْمِنُ بِكُلِّ الَّذِي عِنْدَ اللَّهِ مِنَ الْعَذَابِ لَمْ يَأْمَنْ مِنَ النَّارِ ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda, “Sesungguhnya Allah SWT menciptakan rahmat pada hari Dia menciptakannya sebanyak seratus bahagian.  Dia menyimpan sebanyak sembilan puluh sembilan bahagian dan menghantar satu bahagian kepada seluruh makhluk-Nya. Sekiranya orang kafir mengetahui seluruh rahmat yang ada pada sisi Allah SWT, nescaya dia tidak akan putus asa daripada syurga. Dan sekiranya orang mukmin mengetahui seluruh azab yang ada pada sisi Allah SWT, nescaya dia tidak akan merasa selamat daripada neraka.”"
  },
  {
    "id": 6231,
    "hadith_number": 6231,
    "tajuk_hadith": "Keberkatan Kesabaran dan Keikhlasan dalam Memberi",
    "perawi_melayu": "Riwayat Abu Sa`id:",
    "english_text": "Some people from the Ansar asked Allah's Messenger (ﷺ) (to give them something) and he gave to everyone of them, who asked him, until all that he had was finished. When everything was finished and he had spent all that was in his hand, he said to them, '\"(Know) that if I have any wealth, I will not withhold it from you (to keep for somebody else); And (know) that he who refrains from begging others (or doing prohibited deeds), Allah will make him contented and not in need of others; and he who remains patient, Allah will bestow patience upon him, and he who is satisfied with what he has, Allah will make him self-sufficient. And there is no gift better and vast (you may be given) than patience.\"",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عَطَاءُ بْنُ يَزِيدَ، أَنَّ أَبَا سَعِيدٍ، أَخْبَرَهُ أَنَّ أُنَاسًا مِنَ الأَنْصَارِ سَأَلُوا رَسُولَ اللَّهِ صلى الله عليه وسلم فَلَمْ يَسْأَلْهُ أَحَدٌ مِنْهُمْ إِلاَّ أَعْطَاهُ حَتَّى نَفِدَ مَا عِنْدَهُ فَقَالَ لَهُمْ حِينَ نَفِدَ كُلُّ شَىْءٍ أَنْفَقَ بِيَدَيْهِ ‏\n\"‏ مَا يَكُنْ عِنْدِي مِنْ خَيْرٍ لاَ أَدَّخِرْهُ عَنْكُمْ، وَإِنَّهُ مَنْ يَسْتَعِفَّ يُعِفُّهُ اللَّهُ، وَمَنْ يَتَصَبَّرْ يُصَبِّرْهُ اللَّهُ، وَمَنْ يَسْتَغْنِ يُغْنِهِ اللَّهُ، وَلَنْ تُعْطَوْا عَطَاءً خَيْرًا وَأَوْسَعَ مِنَ الصَّبْرِ ‏\"‏‏.‏",
    "malay_translation": "Beberapa orang daripada kalangan Ansar meminta kepada Rasulullah SAW, dan baginda memberi kepada setiap orang yang meminta sehingga habis segala yang ada pada baginda.  Apabila semuanya telah habis dan baginda telah menghabiskan segala yang ada di tangan baginda, baginda bersabda kepada mereka,  \"Ketahuilah, jika aku mempunyai harta, aku tidak akan menyimpannya daripada kamu; dan sesungguhnya sesiapa yang menahan diri daripada meminta-minta (atau melakukan perkara-perkara yang haram), Allah akan memberinya kecukupan dan tidak memerlukan orang lain; dan sesiapa yang bersabar, Allah akan menganugerahkan kesabaran kepadanya; dan sesiapa yang redha dengan apa yang dimilikinya, Allah akan menjadikan dirinya cukup. Dan tidak ada pemberian yang lebih baik dan luas daripada kesabaran.\""
  },
  {
    "id": 6232,
    "hadith_number": 6232,
    "tajuk_hadith": "Solat Nabi SAW dan Kesyukuran",
    "perawi_melayu": "Riwayat Al-Mughira bin Shu`ba:",
    "english_text": "The Prophet (ﷺ) used to pray so much that his feet used to become edematous or swollen, and when he \nwas asked as to why he prays so much, he would say, \"Shall I not be a thankful slave (to Allah)?\"",
    "arabic_text": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، حَدَّثَنَا مِسْعَرٌ، حَدَّثَنَا زِيَادُ بْنُ عِلاَقَةَ، قَالَ سَمِعْتُ الْمُغِيرَةَ بْنَ شُعْبَةَ، يَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي حَتَّى تَرِمَ ـ أَوْ تَنْتَفِخَ ـ قَدَمَاهُ فَيُقَالُ لَهُ، فَيَقُولُ ‏\n\"‏ أَفَلاَ أَكُونُ عَبْدًا شَكُورًا ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Khallad bin Yahya, telah menceritakan kepada kami Mis`ar, telah menceritakan kepada kami Ziad bin `Ilaqah, dia berkata: aku mendengar Al-Mughirah bin Syu`bah berkata: Nabi SAW sentiasa menunaikan solat sehingga kedua kakinya bengkak.  Lalu Baginda ditanya, maka Baginda menjawab: \"Bukankah aku sepatutnya menjadi hamba yang bersyukur?\""
  },
  {
    "id": 6233,
    "hadith_number": 6233,
    "tajuk_hadith": "Tujuh Puluh Ribu Umat Tanpa Hisab",
    "perawi_melayu": "Daripada Ibnu Abbas",
    "english_text": "Allah's Messenger (ﷺ) said, \"Seventy thousand people of my followers will enter Paradise without accounts, \nand they are those who do not practice Ar-Ruqya and do not see an evil omen in things, and put their \ntrust in their Lord.",
    "arabic_text": "حَدَّثَنِي إِسْحَاقُ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ حُصَيْنَ بْنَ عَبْدِ الرَّحْمَنِ، قَالَ كُنْتُ قَاعِدًا عِنْدَ سَعِيدِ بْنِ جُبَيْرٍ فَقَالَ عَنِ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَدْخُلُ الْجَنَّةَ مِنْ أُمَّتِي سَبْعُونَ أَلْفًا بِغَيْرِ حِسَابٍ، هُمُ الَّذِينَ لاَ يَسْتَرْقُونَ، وَلاَ يَتَطَيَّرُونَ، وَعَلَى رَبِّهِمْ يَتَوَكَّلُونَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Tujuh puluh ribu umatku akan masuk syurga tanpa hisab. Mereka ialah orang-orang yang tidak mengamalkan ar-ruqyah, tidak mempercayai petanda buruk, dan bertawakkal kepada Tuhan mereka.\""
  },
  {
    "id": 6234,
    "hadith_number": 6234,
    "tajuk_hadith": "Doa Selepas Solat dan Larangan Rasulullah SAW",
    "perawi_melayu": "Riwayat Warrad:",
    "english_text": "(the clerk of Al-Mughira bin Shu`ba) Muawiya wrote to Al-Mughira: \"Write to me a narration you \nhave heard from Allah's Messenger (ﷺ).\" So Al-Mughira wrote to him, \"I heard him saying the following \nafter each prayer: 'La ilaha illal-lahu wahdahu la sharika lahu, lahu-l-mulk wa lahuI-hamd, wa huwa \n'ala kulli Shai-in qadir.' He also used to forbid idle talk, asking too many questions (in religion), \nwasting money, preventing what should be given, and asking others for something (except in great \nneed), being undutiful to mothers, and burying one's little daughters (alive).",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُسْلِمٍ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا غَيْرُ، وَاحِدٍ، مِنْهُمْ مُغِيرَةُ وَفُلاَنٌ وَرَجُلٌ ثَالِثٌ أَيْضًا عَنِ الشَّعْبِيِّ عَنْ وَرَّادٍ كَاتِبِ الْمُغِيرَةِ بْنِ شُعْبَةَ أَنَّ مُعَاوِيَةَ كَتَبَ إِلَى الْمُغِيرَةِ أَنِ اكْتُبْ إِلَىَّ بِحَدِيثٍ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ فَكَتَبَ إِلَيْهِ الْمُغِيرَةُ أَنِّي سَمِعْتُهُ يَقُولُ عِنْدَ انْصِرَافِهِ مِنَ الصَّلاَةِ ‏\n\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ، وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهْوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ ‏\"‏‏.‏ ثَلاَثَ مَرَّاتٍ قَالَ وَكَانَ يَنْهَى عَنْ قِيلَ وَقَالَ وَكَثْرَةِ السُّؤَالِ، وَإِضَاعَةِ الْمَالِ، وَمَنْعٍ وَهَاتِ، وَعُقُوقِ الأُمَّهَاتِ، وَوَأْدِ الْبَنَاتِ‏.‏ وَعَنْ هُشَيْمٍ أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ قَالَ سَمِعْتُ وَرَّادًا يُحَدِّثُ هَذَا الْحَدِيثَ عَنِ الْمُغِيرَةِ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Muawiyah menulis kepada Al-Mughirah: \"Tuliskan kepadaku sebuah hadis yang engkau telah dengar daripada Rasulullah SAW.\" Maka Al-Mughirah menulis kepadanya, \"Saya mendengar Baginda bersabda setelah setiap solat: 'La ilaha illallah wahdahu la sharika lah, lahul mulk wa lahul hamd, wa huwa 'ala kulli syai'in qadir.' Baginda juga melarang bercakap kosong, banyak bertanya (dalam agama), membazirkan harta, menghalang pemberian, meminta-minta (kecuali dalam keadaan sangat memerlukan), derhaka kepada ibu bapa, dan menguburkan anak perempuan hidup-hidup."
  },
  {
    "id": 6235,
    "hadith_number": 6235,
    "tajuk_hadith": "Jaminan Syurga bagi yang Menjaga Lidah dan Kemaluan",
    "perawi_melayu": "Riwayat Sahl bin Sa'd:",
    "english_text": "Allah's Messenger (ﷺ) said, \"Whoever can guarantee (the chastity of) what is between his two jaw-bones and \nwhat is between his two legs (i.e. his tongue and his private parts), I guarantee Paradise for him.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ، سَمِعَ أَبَا حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ يَضْمَنْ لِي مَا بَيْنَ لَحْيَيْهِ وَمَا بَيْنَ رِجْلَيْهِ أَضْمَنْ لَهُ الْجَنَّةَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Barang siapa yang dapat menjamin (kesucian) apa yang berada di antara dua tulang rahangnya dan apa yang berada di antara dua kakinya (iaitu lidahnya dan kemaluannya), Aku jamin syurga baginya.\""
  },
  {
    "id": 6236,
    "hadith_number": 6236,
    "tajuk_hadith": "Kepercayaan, Perkataan Baik, Jiran, dan Tetamu",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "Allah's Messenger (ﷺ) said, \"Whoever believes in Allah and the Last Day should talk what is good or keep \nquiet, and whoever believes in Allah and the Last Day should not hurt (or insult) his neighbor; and \nwhoever believes in Allah and the Last Day, should entertain his guest generously.\"",
    "arabic_text": "حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا، أَوْ لِيَصْمُتْ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلاَ يُؤْذِ جَارَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Barang siapa yang beriman kepada Allah dan hari akhirat, maka hendaklah dia berkata baik atau diam. Dan barang siapa yang beriman kepada Allah dan hari akhirat, maka janganlah dia menyakiti jirannya. Dan barang siapa yang beriman kepada Allah dan hari akhirat, maka hendaklah dia memuliakan tetamunya.\""
  },
  {
    "id": 6237,
    "hadith_number": 6237,
    "tajuk_hadith": "Tempoh Menjamu Tetamu dan Ganjarannya",
    "perawi_melayu": "Riwayat Abu Shuraih Al-Khuza`i:",
    "english_text": "My ears heard and my heart grasped (the statement which) the Prophet (ﷺ) said, \"The period for keeping \none's guest is three days (and don't forget) his reward.\" It was asked, \"What is his reward?\" He said, \n\"In the first night and the day he should be given a high class quality of meals; and whoever believes \nin Allah and the Last Day, should entertain his guest generously; and whoever believes in Allah and \nthe Last Day should talk what is good (sense) or keep quiet.\"",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا لَيْثٌ، حَدَّثَنَا سَعِيدٌ الْمَقْبُرِيُّ، عَنْ أَبِي شُرَيْحٍ الْخُزَاعِيِّ، قَالَ سَمِعَ أُذُنَاىَ، وَوَعَاهُ، قَلْبِي النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏ الضِّيَافَةُ ثَلاَثَةُ أَيَّامٍ جَائِزَتُهُ ‏\"‏‏.‏ قِيلَ مَا جَائِزَتُهُ قَالَ ‏\"‏ يَوْمٌ وَلَيْلَةٌ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا، أَوْ لِيَسْكُتْ ‏\"‏‏.‏",
    "malay_translation": "Telinga aku mendengar dan hatiku memahami sabda Nabi ﷺ: \"Tempoh menjamu tetamu ialah tiga hari, dan ganjarannya.\" Ditanya, \"Apakah ganjarannya?\" Baginda menjawab, \"Pada malam dan siang pertama, hendaklah diberikan makanan yang berkualiti tinggi; dan sesiapa yang beriman kepada Allah dan hari akhirat, hendaklah memuliakan tetamunya; dan sesiapa yang beriman kepada Allah dan hari akhirat, hendaklah berkata baik atau diam.\""
  },
  {
    "id": 6238,
    "hadith_number": 6238,
    "tajuk_hadith": "Perkataan yang Menjatuhkan ke Neraka",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "That he heard Allah's Messenger (ﷺ) saying, \"A slave of Allah may utter a word without thinking whether it is right or wrong, he may slip down in the Fire as far away a distance equal to that between the east.\"",
    "arabic_text": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ حَمْزَةَ، حَدَّثَنِي ابْنُ أَبِي حَازِمٍ، عَنْ يَزِيدَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ عِيسَى بْنِ طَلْحَةَ التَّيْمِيِّ، عَنْ أَبِي هُرَيْرَةَ، سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ الْعَبْدَ لَيَتَكَلَّمُ بِالْكَلِمَةِ مَا يَتَبَيَّنُ فِيهَا، يَزِلُّ بِهَا فِي النَّارِ أَبْعَدَ مِمَّا بَيْنَ الْمَشْرِقِ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Ibrahim bin Hamza, telah menceritakan kepadaku Ibnu Abi Hazim, daripada Yazid, daripada Muhammad bin Ibrahim, daripada Isa bin Thalhah Al-Timi, daripada Abu Hurairah, bahawa baginda Rasulullah SAW telah bersabda: \"Sesungguhnya seorang hamba Allah itu boleh sahaja menyebut satu perkataan tanpa memikirkan sama ada ia benar atau salah, lalu ia akan tergelincir disebabkan perkataan itu ke dalam neraka sejauh jarak antara timur (dan barat).\""
  },
  {
    "id": 6239,
    "hadith_number": 6239,
    "tajuk_hadith": "Sebab-sebab Kenaikan dan Kejatuhan Darjat",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "The Prophet; said, \"A slave (of Allah) may utter a word which pleases Allah without giving it much \nimportance, and because of that Allah will raise him to degrees (of reward): a slave (of Allah) may \nutter a word (carelessly) which displeases Allah without thinking of its gravity and because of that he \nwill be thrown into the Hell-Fire.\"",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُنِيرٍ، سَمِعَ أَبَا النَّضْرِ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ ـ يَعْنِي ابْنَ دِينَارٍ ـ عَنْ أَبِيهِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الْعَبْدَ لَيَتَكَلَّمُ بِالْكَلِمَةِ مِنْ رِضْوَانِ اللَّهِ لاَ يُلْقِي لَهَا بَالاً، يَرْفَعُ اللَّهُ بِهَا دَرَجَاتٍ، وَإِنَّ الْعَبْدَ لَيَتَكَلَّمُ بِالْكَلِمَةِ مِنْ سَخَطِ اللَّهِ لاَ يُلْقِي لَهَا بَالاً يَهْوِي بِهَا فِي جَهَنَّمَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Sesungguhnya seorang hamba itu boleh sahaja menyebut satu perkataan yang Allah redhai tanpa menghiraukannya, maka disebabkan perkataan itu Allah akan meninggikan darjatnya. Dan sesungguhnya seorang hamba itu boleh sahaja menyebut satu perkataan yang Allah murkai tanpa menghiraukannya, maka disebabkan perkataan itu dia akan jatuh ke dalam neraka.\" "
  },
  {
    "id": 6240,
    "hadith_number": 6240,
    "tajuk_hadith": "Tujuh Golongan yang Diberi Naungan Allah SWT.",
    "perawi_melayu": "Riwayat Abu Hurairah",
    "english_text": "The Prophet (ﷺ) said Allah will give shade to seven (types of people) under His Shade (on the Day of \nResurrection). (one of them will be) a person who remembers Allah and his eyes are then flooded with \ntears.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي خُبَيْبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ سَبْعَةٌ يُظِلُّهُمُ اللَّهُ، رَجُلٌ ذَكَرَ اللَّهَ فَفَاضَتْ عَيْنَاهُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Tujuh golongan yang akan dinaungi Allah SWT pada hari kiamat; antaranya ialah orang yang mengingati Allah sehingga matanya berlinang air mata.\""
  },
  {
    "id": 6241,
    "hadith_number": 6241,
    "tajuk_hadith": "Pengampunan Allah SWT kepada Seorang Lelaki yang Takut Akan-Nya",
    "perawi_melayu": "Riwayat Hudzaifah",
    "english_text": "The Prophet (ﷺ) said, \"There was a man amongst the people who had suspicion as to the righteousness of \nhis deeds. Therefore he said to his family, 'If I die, take me and burn my corpse and throw my ashes \ninto the sea on a hot (or windy) day.' They did so, but Allah, collected his particles and asked (him), \nWhat made you do what you did?' He replied, 'The only thing that made me do it, was that I was \nafraid of You.' So Allah forgave him.\"",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ رِبْعِيٍّ، عَنْ حُذَيْفَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ كَانَ رَجُلٌ مِمَّنْ كَانَ قَبْلَكُمْ يُسِيءُ الظَّنَّ بِعَمَلِهِ، فَقَالَ لأَهْلِهِ إِذَا أَنَا مُتُّ فَخُذُونِي فَذَرُّونِي، فِي الْبَحْرِ فِي يَوْمٍ صَائِفٍ، فَفَعَلُوا بِهِ، فَجَمَعَهُ اللَّهُ ثُمَّ قَالَ مَا حَمَلَكَ عَلَى الَّذِي صَنَعْتَ قَالَ مَا حَمَلَنِي إِلاَّ مَخَافَتُكَ‏.‏ فَغَفَرَ لَهُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Dahulu kala, ada seorang lelaki yang buruk sangka terhadap amal perbuatannya.  Lalu dia berkata kepada keluarganya, ‘Apabila aku mati, ambillah aku, bakarlah mayatku, dan lemparkan abu tulangku ke laut pada hari yang panas.’  Mereka pun berbuat demikian.  Kemudian Allah SWT mengumpulkan kembali jasadnya dan bertanya, ‘Apakah yang mendorongmu melakukan perbuatan itu?’  Jawab lelaki itu, ‘Tiada apa yang mendorongku melainkan rasa takutku kepada-Mu.’  Maka Allah SWT mengampuninya.\""
  },
  {
    "id": 6242,
    "hadith_number": 6242,
    "tajuk_hadith": "Ketakutan kepada Allah SWT",
    "perawi_melayu": "Riwayat Abu Sa`id",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُوسَى، حَدَّثَنَا مُعْتَمِرٌ، سَمِعْتُ أَبِي، حَدَّثَنَا قَتَادَةُ، عَنْ عُقْبَةَ بْنِ عَبْدِ الْغَافِرِ، عَنْ أَبِي سَعِيدٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\n\"‏ذَكَرَ رَجُلاً فِيمَنْ كَانَ سَلَفَ أَوْ قَبْلَكُمْ آتَاهُ اللَّهُ مَالاً وَوَلَدًا ـ يَعْنِي أَعْطَاهُ قَالَ ـ فَلَمَّا حُضِرَ قَالَ لِبَنِيهِ أَىَّ أَبٍ كُنْتُ قَالُوا خَيْرَ أَبٍ‏.‏ قَالَ فَإِنَّهُ لَمْ يَبْتَئِرْ عِنْدَ اللَّهِ خَيْرًا ـ فَسَّرَهَا قَتَادَةُ لَمْ يَدَّخِرْ ـ وَإِنْ يَقْدَمْ عَلَى اللَّهِ يُعَذِّبْهُ فَانْظُرُوا، فَإِذَا مُتُّ فَأَحْرِقُونِي، حَتَّى إِذَا صِرْتُ فَحْمًا فَاسْحَقُونِي ـ أَوْ قَالَ فَاسْهَكُونِي ـ ثُمَّ إِذَا كَانَ رِيحٌ عَاصِفٌ فَأَذْرُونِي فِيهَا‏.‏ فَأَخَذَ مَوَاثِيقَهُمْ عَلَى ذَلِكَ وَرَبِّي فَفَعَلُوا فَقَالَ اللَّهُ كُنْ‏.‏ فَإِذَا رَجُلٌ قَائِمٌ، ثُمَّ قَالَ أَىْ عَبْدِي مَا حَمَلَكَ عَلَى مَا فَعَلْتَ قَالَ مَخَافَتُكَ ـ أَوْ فَرَقٌ مِنْكَ ـ فَمَا تَلاَفَاهُ أَنْ رَحِمَهُ اللَّهُ ‏\"‏‏.‏ فَحَدَّثْتُ أَبَا عُثْمَانَ فَقَالَ سَمِعْتُ سَلْمَانَ غَيْرَ أَنَّهُ زَادَ فَأَذْرُونِي فِي الْبَحْرِ‏.‏ أَوْ كَمَا حَدَّثَ‏.‏ وَقَالَ مُعَاذٌ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، سَمِعْتُ عُقْبَةَ، سَمِعْتُ أَبَا سَعِيدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Musa, telah menceritakan kepada kami Mu'tamir, aku mendengar daripada bapaku, telah menceritakan kepada kami Qatadah, daripada Uqbah bin Abdil Ghafir, daripada Abu Said r.a daripada Nabi SAW. Baginda menyebut seorang lelaki daripada generasi terdahulu atau sebelum kamu, yang Allah SWT telah menganugerahkan kepadanya harta dan anak.  Apabila ajalnya hampir, dia bertanya kepada anak-anaknya, \"Apakah jenis bapa yang aku kepada kamu?\" Mereka menjawab, \"Engkau adalah bapa yang baik.\" Dia berkata, \"Tetapi sesungguhnya aku tidak menyimpan sebarang amal soleh di sisi Allah SWT (untuk akhirat). Sekiranya aku menghadap Allah SWT, nescaya Allah SWT akan mengazabku. Oleh itu, perhatikanlah, apabila aku mati, bakarlah aku sehingga aku menjadi arang, kemudian tumbuklah aku menjadi debu, dan apabila ada angin ribut, campaklah aku (abu ku) ke dalamnya.\" Maka dia mengambil ikrar daripada anak-anaknya untuk melakukan demikian. Dan demi Allah, mereka (anak-anaknya) telah melakukannya. Kemudian Allah SWT berfirman, \"Jadilah.\" Maka tiba-tiba lelaki itu berdiri tegak. Kemudian Allah SWT bertanya, \"Wahai hambaKu, apakah yang mendorongmu melakukan apa yang engkau lakukan?\" Lelaki itu menjawab, \"Ketakutan kepadaMu.\" Maka Allah SWT mengampuninya."
  },
  {
    "id": 6243,
    "hadith_number": 6243,
    "tajuk_hadith": "Perumpamaan Rasulullah SAW dan Risalah Baginda",
    "perawi_melayu": "Riwayat Abu Musa:",
    "english_text": "Allah's Messenger (ﷺ) said. \"My example and the example of the message with which Allah has sent me is \nlike that of a man who came to some people and said, \"I have seen with my own eyes the enemy \nforces, and I am a naked warner (to you) so save yourself, save yourself! A group of them obeyed him \nand went out at night, slowly and stealthily and were safe, while another group did not believe him \nand thus the army took them in the morning and destroyed them.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَثَلِي وَمَثَلُ مَا بَعَثَنِي اللَّهُ كَمَثَلِ رَجُلٍ أَتَى قَوْمًا فَقَالَ رَأَيْتُ الْجَيْشَ بِعَيْنَىَّ، وَإِنِّي أَنَا النَّذِيرُ الْعُرْيَانُ فَالنَّجَا النَّجَاءَ‏.‏ فَأَطَاعَتْهُ طَائِفَةٌ فَأَدْلَجُوا عَلَى مَهْلِهِمْ فَنَجَوْا، وَكَذَّبَتْهُ طَائِفَةٌ فَصَبَّحَهُمُ الْجَيْشُ فَاجْتَاحَهُمْ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Perumpamaanku dan perumpamaan risalah yang Allah utus kepadaku adalah seperti seorang lelaki yang datang kepada suatu kaum lalu berkata, 'Aku telah melihat dengan mataku sendiri tentera musuh, dan sesungguhnya aku adalah seorang penyampai amaran yang telanjang (tanpa senjata), maka selamatkanlah diri kamu, selamatkanlah diri kamu!' Maka satu kumpulan daripada mereka mematuhinya lalu mereka keluar pada waktu malam, perlahan-lahan dan secara sembunyi, lalu mereka selamat.  Manakala satu kumpulan lagi mendustakannya, maka tentera itu datang menyerang mereka di waktu pagi dan membinasakan mereka.\""
  },
  {
    "id": 6244,
    "hadith_number": 6244,
    "tajuk_hadith": "Perumpamaan Rasulullah SAW dan Umat",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنْ عَبْدِ الرَّحْمَنِ، أَنَّهُ حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّمَا مَثَلِي وَمَثَلُ النَّاسِ كَمَثَلِ رَجُلٍ اسْتَوْقَدَ نَارًا، فَلَمَّا أَضَاءَتْ مَا حَوْلَهُ جَعَلَ الْفَرَاشُ وَهَذِهِ الدَّوَابُّ الَّتِي تَقَعُ فِي النَّارِ يَقَعْنَ فِيهَا، فَجَعَلَ يَنْزِعُهُنَّ وَيَغْلِبْنَهُ فَيَقْتَحِمْنَ فِيهَا، فَأَنَا آخُذُ بِحُجَزِكُمْ عَنِ النَّارِ، وَأَنْتُمْ تَقْتَحِمُونَ فِيهَا ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Yaman, telah memberitakan kepada kami Syu'aib, telah menceritakan kepada kami Abu Zinad, daripada Abdul Rahman, bahawa dia telah menceritakan kepadanya bahawa dia telah mendengar Abu Hurairah r.a. bahawa dia telah mendengar Rasulullah SAW bersabda:  \"Sesungguhnya perumpamaanku dan perumpamaan manusia adalah seperti perumpamaan seseorang yang menyalakan api. Apabila api itu menyala dan menerangi sekelilingnya, maka rama-rama dan serangga lain yang jatuh ke dalam api, akan terus jatuh ke dalamnya.  Lalu orang itu cuba mengeluarkannya, tetapi ia diatasi oleh serangga-serangga itu yang terus terjun ke dalam api.  Maka Aku pun memegang tali pinggang kamu untuk menghalang kamu daripada jatuh ke dalam neraka, tetapi kamu tetap menerjunkan diri ke dalamnya.\""
  },
  {
    "id": 6245,
    "hadith_number": 6245,
    "tajuk_hadith": "Definisi Muslim dan Muhajir",
    "perawi_melayu": "Riwayat Abdullah bin Amr:",
    "english_text": "The Prophet (ﷺ) said, \"A Muslim is the one who avoids harming Muslims with his tongue or his hands. \nAnd a Muhajir (an emigrant) is the one who gives up (abandons) all what Allah has forbidden.\"",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا زَكَرِيَّاءُ، عَنْ عَامِرٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرٍو، يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ الْمُسْلِمُ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ، وَالْمُهَاجِرُ مَنْ هَجَرَ مَا نَهَى اللَّهُ عَنْهُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Seorang Muslim ialah orang yang memelihara keselamatan orang Islam lain daripada lidah dan tangannya. Dan seorang Muhajir ialah orang yang meninggalkan segala apa yang Allah SWT telah larang.\""
  },
  {
    "id": 6246,
    "hadith_number": 6246,
    "tajuk_hadith": "Ketawa Sedikit, Menangis Banyak",
    "perawi_melayu": "Dari Abu Hurairah",
    "english_text": "Allah's Messenger (ﷺ) said, \"If you knew that which I know you would laugh little and weep much.\"",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ كَانَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَضَحِكْتُمْ قَلِيلاً، وَلَبَكَيْتُمْ كَثِيرًا ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Sekiranya kamu mengetahui apa yang aku ketahui, nescaya kamu akan sedikit ketawa dan banyak menangis.\""
  },
  {
    "id": 6247,
    "hadith_number": 6247,
    "tajuk_hadith": "Sedikit Ketawa, Banyak Tangisan",
    "perawi_melayu": "Anas meriwayatkan:",
    "english_text": "The Prophet (ﷺ) said, \"If you knew that which I know, you would laugh little and weep much.\"",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ مُوسَى بْنِ أَنَسٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَضَحِكْتُمْ قَلِيلاً وَلَبَكَيْتُمْ كَثِيرًا‏\"‏",
    "malay_translation": "Anas r.a. meriwayatkan bahawa Nabi SAW bersabda:  \"Sekiranya kamu mengetahui apa yang aku ketahui, nescaya kamu akan sedikit ketawa dan banyak menangis.\""
  },
  {
    "id": 6248,
    "hadith_number": 6248,
    "tajuk_hadith": "Neraka Dijaga oleh Syahwat, Syurga Dijaga oleh Perkara-Perkara yang Dibenci",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "Allah's Messenger (ﷺ) said, \"The (Hell) Fire is surrounded by all kinds of desires and passions, while \nParadise is surrounded by all kinds of disliked undesirable things.\"",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ حُجِبَتِ النَّارُ بِالشَّهَوَاتِ، وَحُجِبَتِ الْجَنَّةُ بِالْمَكَارِهِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Neraka dihalangi oleh syahwat, dan syurga dihalangi oleh perkara-perkara yang dibenci.\""
  },
  {
    "id": 6249,
    "hadith_number": 6249,
    "tajuk_hadith": "Syurga dan Neraka: Lebih Dekat Daripada Bayangan",
    "perawi_melayu": "Riwayat Abdullah",
    "english_text": "The Prophet (ﷺ) said, \"Paradise is nearer to any of you than the Shirak (leather strap) of his shoe, and so is \nthe (Hell) Fire.",
    "arabic_text": "حَدَّثَنِي مُوسَى بْنُ مَسْعُودٍ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، وَالأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ الْجَنَّةُ أَقْرَبُ إِلَى أَحَدِكُمْ مِنْ شِرَاكِ نَعْلِهِ، وَالنَّارُ مِثْلُ ذَلِكَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Syurga itu lebih dekat kepada kamu daripada tali kasut kamu, dan begitu juga neraka.\""
  },
  {
    "id": 6250,
    "hadith_number": 6250,
    "tajuk_hadith": "Bait Puisi Yang Paling Benar",
    "perawi_melayu": "Dari Abu Hurairah",
    "english_text": "The Prophet (ﷺ) said, \"The truest poetic verse ever said by a poet, is: Indeed! Everything except Allah, is perishable.\"",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَصْدَقُ بَيْتٍ قَالَهُ الشَّاعِرُ أَلاَ كُلُّ شَىْءٍ مَا خَلاَ اللَّهَ بَاطِلُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Bait puisi yang paling benar yang pernah diucapkan oleh seorang penyair ialah:  Sesungguhnya, setiap sesuatu kecuali Allah SWT adalah fana.\""
  },
  {
    "id": 6251,
    "hadith_number": 6251,
    "tajuk_hadith": "Menghindari Iri Hati dengan Melihat Keadaan Orang Lain",
    "perawi_melayu": "Dari Abu Hurairah",
    "english_text": "Allah's Messenger (ﷺ) said, \"If anyone of you looked at a person who was made superior to him in property and (in good) appearance, then he should also look at the one who is inferior to him.",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا نَظَرَ أَحَدُكُمْ إِلَى مَنْ فُضِّلَ عَلَيْهِ فِي الْمَالِ وَالْخَلْقِ، فَلْيَنْظُرْ إِلَى مَنْ هُوَ أَسْفَلَ مِنْهُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  “Jika seseorang di antara kamu melihat orang yang lebih baik darinya dari segi harta dan rupa paras, maka hendaklah dia melihat juga kepada orang yang lebih rendah darinya.”"
  },
  {
    "id": 6252,
    "hadith_number": 6252,
    "tajuk_hadith": "Pahal dan Dosa: Niat dan Amalan",
    "perawi_melayu": "Daripada Ibnu Abbas",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا جَعْدٌ أَبُو عُثْمَانَ، حَدَّثَنَا أَبُو رَجَاءٍ الْعُطَارِدِيُّ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم فِيمَا يَرْوِي عَنْ رَبِّهِ عَزَّ وَجَلَّ قَالَ قَالَ ‏\n\"‏ إِنَّ اللَّهَ كَتَبَ الْحَسَنَاتِ وَالسَّيِّئَاتِ، ثُمَّ بَيَّنَ ذَلِكَ فَمَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللَّهُ لَهُ عِنْدَهُ حَسَنَةً كَامِلَةً، فَإِنْ هُوَ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللَّهُ لَهُ عِنْدَهُ عَشْرَ حَسَنَاتٍ إِلَى سَبْعِمِائَةِ ضِعْفٍ إِلَى أَضْعَافٍ كَثِيرَةٍ، وَمَنْ هَمَّ بِسَيِّئَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللَّهُ لَهُ عِنْدَهُ حَسَنَةً كَامِلَةً، فَإِنْ هُوَ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللَّهُ لَهُ سَيِّئَةً وَاحِدَةً ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Ma'mar, telah menceritakan kepada kami Abdul Warits, telah menceritakan kepada kami Ja'd Abu Utsman, telah menceritakan kepada kami Abu Roja' al-'Utaridi, daripada Ibnu Abbas - semoga Allah merahmati mereka berdua - daripada Nabi SAW,  berkenaan apa yang Baginda ceritakan daripada Tuhannya - Yang Maha Mulia dan Maha Agung - Baginda bersabda:  \"Sesungguhnya Allah telah menulis kebaikan dan kejahatan, kemudian Allah menjelaskan perkara itu. Maka sesiapa yang berniat melakukan kebaikan tetapi tidak melakukannya, maka Allah akan menulis baginya di sisi-Nya satu kebaikan yang sempurna.  Dan jika dia berniat dan melakukannya, maka Allah akan menulis baginya di sisi-Nya sepuluh kebaikan sehingga tujuh ratus kali ganda, bahkan gandaan yang banyak lagi. Dan sesiapa yang berniat melakukan kejahatan tetapi tidak melakukannya, maka Allah akan menulis baginya di sisi-Nya satu kebaikan yang sempurna. Dan jika dia berniat dan melakukannya, maka Allah akan menulis baginya satu kejahatan.\" "
  },
  {
    "id": 6253,
    "hadith_number": 6253,
    "tajuk_hadith": "Perbuatan Kecil di Mata Manusia, Dosa Besar di Sisi Allah",
    "perawi_melayu": "Riwayat Ghailan:",
    "english_text": "Anas said \"You people do (bad) deeds (commit sins) which seem in your eyes as tiny (minute) than \nhair while we used to consider those (very deeds) during the life-time of the Prophet (ﷺ) as destructive \nsins.\"",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا مَهْدِيٌّ، عَنْ غَيْلاَنَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ إِنَّكُمْ لَتَعْمَلُونَ أَعْمَالاً هِيَ أَدَقُّ فِي أَعْيُنِكُمْ مِنَ الشَّعَرِ، إِنْ كُنَّا نَعُدُّهَا عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم الْمُوبِقَاتِ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ يَعْنِي بِذَلِكَ الْمُهْلِكَاتِ‏.‏",
    "malay_translation": "Anas r.a. berkata, \"Sesungguhnya kamu melakukan perbuatan-perbuatan yang di matamu lebih halus daripada rambut, sedangkan pada zaman Nabi SAW, kami menganggapnya sebagai dosa yang membinasakan.\""
  },
  {
    "id": 6254,
    "hadith_number": 6254,
    "tajuk_hadith": "Amal Akhir Menentukan",
    "perawi_melayu": "Riwayat Sa`d bin Sahl As-Sa`idi:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، قَالَ نَظَرَ النَّبِيُّ صلى الله عليه وسلم إِلَى رَجُلٍ يُقَاتِلُ الْمُشْرِكِينَ، وَكَانَ مِنْ أَعْظَمِ الْمُسْلِمِينَ غَنَاءً عَنْهُمْ فَقَالَ ‏\"‏ مَنْ أَحَبَّ أَنْ يَنْظُرَ إِلَى رَجُلٍ مِنْ أَهْلِ النَّارِ فَلْيَنْظُرْ إِلَى هَذَا ‏\"‏‏.‏ فَتَبِعَهُ رَجُلٌ فَلَمْ يَزَلْ عَلَى ذَلِكَ حَتَّى جُرِحَ، فَاسْتَعْجَلَ الْمَوْتَ‏.‏ فَقَالَ بِذُبَابَةِ سَيْفِهِ، فَوَضَعَهُ بَيْنَ ثَدْيَيْهِ، فَتَحَامَلَ عَلَيْهِ، حَتَّى خَرَجَ مِنْ بَيْنِ كَتِفَيْهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ الْعَبْدَ لَيَعْمَلُ فِيمَا يَرَى النَّاسُ عَمَلَ أَهْلِ الْجَنَّةِ، وَإِنَّهُ لَمِنْ أَهْلِ النَّارِ، وَيَعْمَلُ فِيمَا يَرَى النَّاسُ عَمَلَ أَهْلِ النَّارِ وَهْوَ مِنْ أَهْلِ الْجَنَّةِ، وَإِنَّمَا الأَعْمَالُ بِخَوَاتِيمِهَا ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ali bin Ayasy, telah menceritakan kepada kami Abu Ghasan, berkata; telah menceritakan kepadaku Abu Hazim, dari Sahl bin Sa’d As-Sa’idi, ia berkata: Nabi ﷺ melihat seorang lelaki yang sedang memerangi orang-orang musyrik, dan dia merupakan salah seorang di antara kaum muslimin yang paling gagah berani dalam peperangan itu. Maka baginda bersabda: “Barangsiapa yang ingin melihat seorang lelaki dari kalangan ahli neraka, hendaklah dia melihat lelaki ini.” Kemudian seorang lelaki mengikutinya, dan terus mengikutinya sehingga dia (si pejuang) tercedera. Lalu dia tergesa-gesa meminta mati, dengan hujung pedangnya, diletakkan di antara dadanya, lalu dihayunkannya sehingga tembus ke bahunya (iaitu membunuh diri). Kemudian Nabi ﷺ bersabda: “Sesungguhnya seorang hamba itu melakukan amal yang menurut pandangan manusia adalah amal ahli syurga, padahal sebenarnya dia termasuk ahli neraka. Dan seorang hamba melakukan amal yang menurut pandangan manusia adalah amal ahli neraka, padahal sebenarnya dia termasuk ahli syurga. Sesungguhnya amal itu dinilai berdasarkan kesudahannya.”"
  },
  {
    "id": 6255,
    "hadith_number": 6255,
    "tajuk_hadith": "Orang yang Terbaik",
    "perawi_melayu": "Riwayat Abu Sa`id Al-Khudri:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي عَطَاءُ بْنُ يَزِيدَ، أَنَّ أَبَا سَعِيدٍ، حَدَّثَهُ قَالَ قِيلَ يَا رَسُولَ اللَّهِ‏.‏ وَقَالَ مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا الأَوْزَاعِيُّ حَدَّثَنَا الزُّهْرِيُّ عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَىُّ النَّاسِ خَيْرٌ قَالَ ‏\n\"‏ رَجُلٌ جَاهَدَ بِنَفْسِهِ وَمَالِهِ، وَرَجُلٌ فِي شِعْبٍ مِنَ الشِّعَابِ يَعْبُدُ رَبَّهُ، وَيَدَعُ النَّاسَ مِنْ شَرِّهِ ‏\"‏‏.‏ تَابَعَهُ الزُّبَيْدِيُّ وَسُلَيْمَانُ بْنُ كَثِيرٍ وَالنُّعْمَانُ عَنِ الزُّهْرِيِّ‏.‏ وَقَالَ مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ عَطَاءٍ أَوْ عُبَيْدِ اللَّهِ عَنْ أَبِي سَعِيدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ يُونُسُ وَابْنُ مُسَافِرٍ وَيَحْيَى بْنُ سَعِيدٍ عَنِ ابْنِ شِهَابٍ عَنْ عَطَاءٍ عَنْ بَعْضِ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Seorang Badwi datang kepada Nabi SAW dan bertanya, \"Wahai Rasulullah SAW! Siapakah manusia yang terbaik?\" Nabi SAW menjawab, \"Seorang lelaki yang berjihad dengan jiwa dan hartanya, dan seorang lelaki yang menyendiri di suatu lembah di antara lembah-lembah untuk beribadah kepada Tuhannya dan menjauhkan manusia daripada kejahatannya.\""
  },
  {
    "id": 6256,
    "hadith_number": 6256,
    "tajuk_hadith": "Harta Terbaik di Akhir Zaman",
    "perawi_melayu": "Riwayat Abu Sa`id:",
    "english_text": "I heard from the Prophet (ﷺ) saying, \"There will come a time upon the people when the best property of a \nMuslim will be sheep which he will take to the tops of mountains and to the places of rainfall, run \naway with his religion (in order to save it) from afflictions.\"",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا الْمَاجِشُونُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ، أَنَّهُ سَمِعَهُ يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ يَأْتِي عَلَى النَّاسِ زَمَانٌ خَيْرُ مَالِ الرَّجُلِ الْمُسْلِمِ الْغَنَمُ، يَتْبَعُ بِهَا شَعَفَ الْجِبَالِ وَمَوَاقِعَ الْقَطْرِ، يَفِرُّ بِدِينِهِ مِنَ الْفِتَنِ ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar daripada Nabi SAW bersabda:  \"Akan datang suatu masa ke atas manusia, harta yang terbaik bagi seorang Muslim ialah kambing biri-biri.  Dia akan membawanya ke puncak gunung dan ke tempat-tempat yang banyak hujan, bagi menyelamatkan agamanya daripada fitnah.\""
  },
  {
    "id": 6257,
    "hadith_number": 6257,
    "tajuk_hadith": "Kehilangan Amanah dan Tanda Kiamat",
    "perawi_melayu": "Dari Abu Hurairah",
    "english_text": "Allah's Messenger (ﷺ) said, \"When honesty is lost, then wait for the Hour.\" It was asked, \"How will honesty \nbe lost, O Allah's Messenger (ﷺ)?\" He said, \"When authority is given to those who do not deserve it, then \nwait for the Hour.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، حَدَّثَنَا هِلاَلُ بْنُ عَلِيٍّ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا ضُيِّعَتِ الأَمَانَةُ فَانْتَظِرِ السَّاعَةَ ‏\"‏‏.‏ قَالَ كَيْفَ إِضَاعَتُهَا يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ إِذَا أُسْنِدَ الأَمْرُ إِلَى غَيْرِ أَهْلِهِ، فَانْتَظِرِ السَّاعَةَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Apabila amanah telah hilang, maka tunggulah kedatangan hari kiamat.\"  Lalu ditanya, \"Bagaimana hilangnya amanah itu, wahai Rasulullah SAW?\"  Baginda menjawab: \"Apabila suatu urusan diserahkan kepada orang yang tidak layak menerimanya, maka tunggulah kedatangan hari kiamat.\""
  },
  {
    "id": 6258,
    "hadith_number": 6258,
    "tajuk_hadith": "Kehilangan Amanah",
    "perawi_melayu": "Riwayat Hudzaifah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، حَدَّثَنَا الأَعْمَشُ، عَنْ زَيْدِ بْنِ وَهْبٍ، حَدَّثَنَا حُذَيْفَةُ، قَالَ حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم حَدِيثَيْنِ رَأَيْتُ أَحَدَهُمَا وَأَنَا أَنْتَظِرُ الآخَرَ، حَدَّثَنَا ‏\"‏ أَنَّ الأَمَانَةَ نَزَلَتْ فِي جَذْرِ قُلُوبِ الرِّجَالِ، ثُمَّ عَلِمُوا مِنَ الْقُرْآنِ، ثُمَّ عَلِمُوا مِنَ السُّنَّةِ ‏\"‏‏.‏ وَحَدَّثَنَا عَنْ رَفْعِهَا قَالَ ‏\"‏ يَنَامُ الرَّجُلُ النَّوْمَةَ فَتُقْبَضُ الأَمَانَةُ مِنْ قَلْبِهِ، فَيَظَلُّ أَثَرُهَا مِثْلَ أَثَرِ الْوَكْتِ، ثُمَّ يَنَامُ النَّوْمَةَ فَتُقْبَضُ فَيَبْقَى أَثَرُهَا مِثْلَ الْمَجْلِ، كَجَمْرٍ دَحْرَجْتَهُ عَلَى رِجْلِكَ فَنَفِطَ، فَتَرَاهُ مُنْتَبِرًا، وَلَيْسَ فِيهِ شَىْءٌ، فَيُصْبِحُ النَّاسُ يَتَبَايَعُونَ فَلاَ يَكَادُ أَحَدٌ يُؤَدِّي الأَمَانَةَ، فَيُقَالُ إِنَّ فِي بَنِي فُلاَنٍ رَجُلاً أَمِينًا‏.‏ وَيُقَالُ لِلرَّجُلِ مَا أَعْقَلَهُ وَمَا أَظْرَفَهُ وَمَا أَجْلَدَهُ‏.‏ وَمَا فِي قَلْبِهِ مِثْقَالُ حَبَّةِ خَرْدَلٍ مِنْ إِيمَانٍ، وَلَقَدْ أَتَى عَلَىَّ زَمَانٌ وَمَا أُبَالِي أَيَّكُمْ بَايَعْتُ لَئِنْ كَانَ مُسْلِمًا رَدَّهُ الإِسْلاَمُ، وَإِنْ كَانَ نَصْرَانِيًّا رَدَّهُ عَلَىَّ سَاعِيهِ، فَأَمَّا الْيَوْمَ فَمَا كُنْتُ أُبَايِعُ إِلاَّ فُلاَنًا وَفُلاَنًا ‏\"‏‏.‏ قَالَ الْفِرَبْرِيُّ قَالَ أَبُو جَعْفَرٍ حَدَّثْتُ أَبَا عَبْدِ اللَّهِ فَقَالَ سَمِعْتُ أَحْمَدَ بْنَ عَاصِمٍ يَقُولُ سَمِعْتُ أَبَا عُبَيْدٍ يَقُولُ قَالَ الأَصْمَعِيُّ وَأَبُو عَمْرٍو وَغَيْرُهُمَا جَذْرُ قُلُوبِ الرِّجَالِ الْجَذْرُ الأَصْلُ مِنْ كُلِّ شَىْءٍ، وَالْوَكْتُ أَثَرُ الشَّىْءِ الْيَسِيرُ مِنْهُ، وَالْمَجْلُ أَثَرُ الْعَمَلِ فِي الْكَفِّ إِذَا غَلُظَ‏.‏",
    "malay_translation": "Muhammad bin Katsir meriwayatkan daripada Sufian, yang meriwayatkan daripada al-A’masy, daripada Zaid bin Wahb, yang meriwayatkan daripada Hudzaifah, katanya: Rasulullah SAW telah menceritakan dua kisah kepadaku. Aku telah menyaksikan salah satunya dan aku sedang menantikan yang satu lagi. Baginda menceritakan bahawa amanah itu tertanam di dalam akar hati manusia, kemudian mereka mempelajarinya daripada al-Quran, kemudian daripada sunnah. Baginda juga menceritakan tentang hilangnya amanah itu. Baginda berkata: “Seseorang itu tidur sekali, lalu amanah itu diambil daripada hatinya, lalu tinggallah kesan-kesannya seperti kesan kayu bakar yang telah padam. Kemudian dia tidur sekali lagi, lalu amanah itu diambil lagi, dan tinggallah kesannya seperti kesan melepuh seperti bara api yang terkena di kaki, nampak terkeluar sedikit tetapi tidak ada apa-apa isinya. Maka kelak manusia akan berjual beli, tetapi hampir tidak ada seorang pun yang amanah. Maka dikatakan, ‘Di kalangan Bani Fulan terdapat seorang lelaki yang amanah.’ Dan seseorang lelaki itu dipuji kerana akalnya, kelakuannya yang sopan dan kegagahannya, padahal dalam hatinya tidak ada iman sepenimbang biji sawi. Aku pernah melalui zaman di mana aku tidak kisah dengan siapa aku berurus niaga, kerana jika dia seorang Muslim, agamanya akan menghalangnya daripada menipu, dan jika dia seorang Kristian, pemerintah Muslim akan menghalangnya daripada menipu. Tetapi hari ini, aku tidak berurus niaga kecuali dengan si fulan dan si fulan.” Al-Firabri berkata, Abu Ja’far berkata: Aku telah menceritakan kepada Abu Abdullah, lalu katanya: Aku telah mendengar Ahmad bin Aasim berkata: Aku telah mendengar Abu Ubaid berkata: Al-Asma’i dan Abu ‘Amr dan selain mereka berkata: Akar hati manusia ialah asal usul sesuatu. Kayu bakar yang padam ialah kesan sedikit sahaja sesuatu itu, manakala kesan melepuh ialah kesan kerja di tapak tangan apabila menjadi kasar."
  },
  {
    "id": 6259,
    "hadith_number": 6259,
    "tajuk_hadith": "Keumpamaan Manusia Seperti Unta",
    "perawi_melayu": "Riwayat Abdullah bin Umar:",
    "english_text": "I heard Allah's Messenger (ﷺ) saying, \"People are just like camels, out of one hundred, one can hardly find a \nsingle camel suitable to ride.\"",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّمَا النَّاسُ كَالإِبِلِ الْمِائَةُ لاَ تَكَادُ تَجِدُ فِيهَا رَاحِلَةً ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda:  \"Sesungguhnya manusia itu seperti unta, daripada seratus ekor unta, kamu hampir tidak akan menjumpai seekor pun yang sesuai untuk ditunggang.\""
  },
  {
    "id": 6260,
    "hadith_number": 6260,
    "tajuk_hadith": "Menunjukkan Amal Soleh dan Riak",
    "perawi_melayu": "Daripada Jundub:",
    "english_text": "The Prophet (ﷺ) said, \"He who lets the people hear of his good deeds intentionally, to win their praise, \nAllah will let the people know his real intention (on the Day of Resurrection), and he who does good \nthings in public to show off and win the praise of the people, Allah will disclose his real intention (and \nhumiliate him).",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، حَدَّثَنِي سَلَمَةُ بْنُ كُهَيْلٍ،‏.‏ وَحَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ سَلَمَةَ، قَالَ سَمِعْتُ جُنْدَبًا، يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم وَلَمْ أَسْمَعْ أَحَدًا يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم غَيْرَهُ فَدَنَوْتُ مِنْهُ فَسَمِعْتُهُ يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَنْ سَمَّعَ سَمَّعَ اللَّهُ بِهِ، وَمَنْ يُرَائِي يُرَائِي اللَّهُ بِهِ ‏\"‏‏.‏",
    "malay_translation": "Daripada Jundub; Baginda Nabi SAW bersabda:  \"Barangsiapa yang sengaja memberitahu orang ramai tentang kebaikan amalnya untuk mendapat pujian mereka, Allah SWT akan mendedahkan niat sebenarnya (pada Hari Kiamat). Dan barangsiapa yang berbuat kebaikan di khalayak ramai untuk bermegah-megah dan mendapat pujian manusia, Allah SWT akan mendedahkan niat sebenarnya (dan akan menghinakannya).\""
  },
  {
    "id": 6261,
    "hadith_number": 6261,
    "tajuk_hadith": "Hak Allah dan Hak Hamba",
    "perawi_melayu": "Riwayat Mu'az bin Jabal:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، عَنْ مُعَاذِ بْنِ جَبَلٍ ـ رضى الله عنه ـ قَالَ بَيْنَمَا أَنَا رَدِيفُ النَّبِيِّ، صلى الله عليه وسلم لَيْسَ بَيْنِي وَبَيْنَهُ إِلاَّ آخِرَةُ الرَّحْلِ فَقَالَ ‏\"‏ يَا مُعَاذُ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ وَسَعْدَيْكَ، ثُمَّ سَارَ سَاعَةً ثُمَّ قَالَ ‏\"‏ يَا مُعَاذُ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ رَسُولَ اللَّهِ وَسَعْدَيْكَ، ثُمَّ سَارَ سَاعَةً ثُمَّ قَالَ ‏\"‏ يَا مُعَاذُ بْنَ جَبَلٍ ‏\"‏‏.‏ قُلْتُ‏:‏ لَبَّيْكَ رَسُولَ اللَّهِ وَسَعْدَيْكَ‏.‏ قَالَ ‏\"‏ هَلْ تَدْرِي مَا حَقُّ اللَّهِ عَلَى عِبَادِهِ ‏\"‏‏.‏ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ حَقُّ اللَّهِ عَلَى عِبَادِهِ أَنْ يَعْبُدُوهُ، وَلاَ يُشْرِكُوا بِهِ شَيْئًا ‏\"‏‏.‏ ثُمَّ سَارَ سَاعَةً ثُمَّ قَالَ ‏\"‏ يَا مُعَاذُ بْنَ جَبَلٍ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ رَسُولَ اللَّهِ وَسَعْدَيْكَ‏.‏ قَالَ ‏\"‏ هَلْ تَدْرِي مَا حَقُّ الْعِبَادِ عَلَى اللَّهِ إِذَا فَعَلُوهُ ‏\"‏‏.‏ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ حَقُّ الْعِبَادِ عَلَى اللَّهِ أَنْ لاَ يُعَذِّبَهُمْ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Hudabah bin Khalid, telah menceritakan kepada kami Hammam, telah menceritakan kepada kami Qatadah, telah menceritakan kepada kami Anas bin Malik, dari Mu'az bin Jabal r.a., dia berkata:  Ketika aku sedang menunggang di belakang Nabi SAW, dan tidak ada apa-apa di antara aku dan baginda kecuali hujung pelana, maka baginda bersabda, \"Wahai Mu'az!\" Aku menjawab, \"Labbaik, ya Rasulullah SAW, dan saya sedia taat!\" Kemudian baginda berjalan sebentar, lalu bersabda, \"Wahai Mu'az!\" Aku menjawab, \"Labbaik, ya Rasulullah SAW, dan saya sedia taat!\" Kemudian baginda berjalan sebentar lagi, lalu bersabda, \"Wahai Mu'az bin Jabal!\" Aku menjawab, \"Labbaik, ya Rasulullah SAW, dan saya sedia taat!\" Baginda bersabda, \"Tahukah engkau apakah hak Allah ke atas hamba-hambaNya?\" Aku menjawab, \"Allah dan RasulNya lebih mengetahui.\" Baginda bersabda, \"Hak Allah ke atas hamba-hambaNya ialah supaya mereka menyembahNya dan tidak menyekutukanNya dengan sesuatu pun.\" Kemudian baginda berjalan sebentar, lalu bersabda, \"Wahai Mu'az bin Jabal!\" Aku menjawab, \"Labbaik, ya Rasulullah SAW, dan saya sedia taat!\" Baginda bersabda, \"Tahukah engkau apakah hak hamba-hamba (manusia) ke atas Allah sekiranya mereka berbuat demikian?\" Aku menjawab, \"Allah dan RasulNya lebih mengetahui.\" Baginda bersabda, \"Hak hamba-hamba ke atas Allah ialah Allah tidak akan menyeksa mereka (jika mereka berbuat demikian)."
  },
  {
    "id": 6262,
    "hadith_number": 6262,
    "tajuk_hadith": "Keangkuhan Duniawi dan Kerendahan Allah",
    "perawi_melayu": "Riwayat Anas:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا حُمَيْدٌ، عَنْ أَنَسٍ ـ رضى الله عنه ـ كَانَ لِلنَّبِيِّ صلى الله عليه وسلم نَاقَةٌ‏.‏ قَالَ وَحَدَّثَنِي مُحَمَّدٌ أَخْبَرَنَا الْفَزَارِيُّ وَأَبُو خَالِدٍ الأَحْمَرُ عَنْ حُمَيْدٍ الطَّوِيلِ عَنْ أَنَسٍ قَالَ كَانَتْ نَاقَةٌ لِرَسُولِ اللَّهِ صلى الله عليه وسلم تُسَمَّى الْعَضْبَاءَ، وَكَانَتْ لاَ تُسْبَقُ، فَجَاءَ أَعْرَابِيٌّ عَلَى قَعُودٍ لَهُ فَسَبَقَهَا، فَاشْتَدَّ ذَلِكَ عَلَى الْمُسْلِمِينَ وَقَالُوا سُبِقَتِ الْعَضْبَاءُ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ حَقًّا عَلَى اللَّهِ أَنْ لاَ يَرْفَعَ شَيْئًا مِنَ الدُّنْيَا إِلاَّ وَضَعَهُ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Malik bin Ismail, telah menceritakan kepada kami Zuhri, telah menceritakan kepada kami Humaid, daripada Anas - radhiallahu 'anhu - bahawa Nabi SAW mempunyai seekor unta betina.  (Malik berkata): Dan telah menceritakan kepadaku Muhammad, memberitahu kami Al-Fazari dan Abu Khalid Al-Ahmar daripada Humaid Ath-Thawil daripada Anas, katanya:  Unta betina itu bernama Al-'Adba', dan ia tidak pernah dikalahkan dalam perlumbaan. Kemudian datanglah seorang Badwi dengan untanya sendiri lalu mengalahkannya.  Perkara ini amat menyedihkan orang Islam, lalu mereka berkata, \"Al-'Adba telah dikalahkan!\"  Maka Rasulullah SAW bersabda:  \"Sesungguhnya adalah hak Allah SWT bahawa Dia tidak meninggikan sesuatu di dunia melainkan Dia akan merendahkannya.\""
  },
  {
    "id": 6263,
    "hadith_number": 6263,
    "tajuk_hadith": "Perang Allah terhadap Mereka yang Memusuhi Wali Allah",
    "perawi_melayu": "Daripada Abu Hurairah",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ عُثْمَانَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، حَدَّثَنِي شَرِيكُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ، عَنْ عَطَاءٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ اللَّهَ قَالَ مَنْ عَادَى لِي وَلِيًّا فَقَدْ آذَنْتُهُ بِالْحَرْبِ، وَمَا تَقَرَّبَ إِلَىَّ عَبْدِي بِشَىْءٍ أَحَبَّ إِلَىَّ مِمَّا افْتَرَضْتُ عَلَيْهِ، وَمَا يَزَالُ عَبْدِي يَتَقَرَّبُ إِلَىَّ بِالنَّوَافِلِ حَتَّى أُحِبَّهُ، فَإِذَا أَحْبَبْتُهُ كُنْتُ سَمْعَهُ الَّذِي يَسْمَعُ بِهِ، وَبَصَرَهُ الَّذِي يُبْصِرُ بِهِ، وَيَدَهُ الَّتِي يَبْطُشُ بِهَا وَرِجْلَهُ الَّتِي يَمْشِي بِهَا، وَإِنْ سَأَلَنِي لأُعْطِيَنَّهُ، وَلَئِنِ اسْتَعَاذَنِي لأُعِيذَنَّهُ، وَمَا تَرَدَّدْتُ عَنْ شَىْءٍ أَنَا فَاعِلُهُ تَرَدُّدِي عَنْ نَفْسِ الْمُؤْمِنِ، يَكْرَهُ الْمَوْتَ وَأَنَا أَكْرَهُ مَسَاءَتَهُ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Muhammad bin Utsman, telah menceritakan kepada kami Khalid bin Makhlad, telah menceritakan kepada kami Sulaiman bin Bilal, telah menceritakan kepadaku Syarik bin Abdullah bin Abi Namir, daripada Ata', daripada Abu Hurairah, dia berkata, Rasulullah SAW bersabda:  \"Sesungguhnya Allah SWT berfirman: 'Barangsiapa yang memusuhi wali-Ku, maka Aku telah mengisytiharkan perang terhadapnya. Dan tidaklah hamba-Ku mendekatkan diri kepada-Ku dengan sesuatu yang lebih Aku cintai daripada apa yang telah Aku wajibkan kepadanya. Dan hamba-Ku terus mendekatkan diri kepada-Ku dengan amalan sunat sehingga Aku mencintainya. Maka apabila Aku mencintainya, Aku menjadi pendengarannya yang dengannya dia mendengar, penglihatannya yang dengannya dia melihat, tangannya yang dengannya dia memegang, dan kakinya yang dengannya dia berjalan. Dan jika dia meminta kepada-Ku, nescaya Aku akan memberinya, dan jika dia meminta perlindungan kepada-Ku, nescaya Aku akan melindunginya. Dan Aku tidak pernah ragu-ragu untuk melakukan sesuatu yang Aku akan lakukan seperti keraguan-Ku untuk mencabut nyawa orang mukmin, kerana dia membenci kematian dan Aku membenci untuk mengecewakannya.\""
  },
  {
    "id": 6264,
    "hadith_number": 6264,
    "tajuk_hadith": "Kedekatan Kerasulan dan Kiamat",
    "perawi_melayu": "Daripada Sahl",
    "english_text": "Allah's Messenger (ﷺ) said, \"I have been sent and the Hour (is at hand) as these two,\" showing his two fingers and sticking (separating) them out.",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، حَدَّثَنَا أَبُو حَازِمٍ، عَنْ سَهْلٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ بُعِثْتُ أَنَا وَالسَّاعَةَ هَكَذَا ‏\"‏‏.‏ وَيُشِيرُ بِإِصْبَعَيْهِ فَيَمُدُّ بِهِمَا‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Aku diutus dan Kiamat itu (hampir) seperti ini,\" sambil Baginda menunjukkan dua jari Baginda dan merenggangkannya."
  },
  {
    "id": 6265,
    "hadith_number": 6265,
    "tajuk_hadith": "Ketibaan Kiamat",
    "perawi_melayu": "Anas meriwayatkan:",
    "english_text": "Allah's Messenger (ﷺ) said, \"I have been sent and the Hour (is at hand) as these two (fingers).",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ ـ هُوَ الْجُعْفِيُّ ـ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، وَأَبِي التَّيَّاحِ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ بُعِثْتُ أَنَا وَالسَّاعَةَ كَهَاتَيْنِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Aku telah diutus dan kiamat itu seperti dua jari ini.\""
  },
  {
    "id": 6266,
    "hadith_number": 6266,
    "tajuk_hadith": "Kedekatan Nabi SAW dengan Hari Kiamat",
    "perawi_melayu": "Dari Abu Hurairah",
    "english_text": "The Prophet (ﷺ) said, \"I have been sent and the Hour (is at hand) as these two (fingers).",
    "arabic_text": "حَدَّثَنِي يَحْيَى بْنُ يُوسُفَ، أَخْبَرَنَا أَبُو بَكْرٍ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ بُعِثْتُ أَنَا وَالسَّاعَةَ كَهَاتَيْنِ ‏\"‏‏.‏ يَعْنِي إِصْبَعَيْنِ‏.‏ تَابَعَهُ إِسْرَائِيلُ عَنْ أَبِي حَصِينٍ‏.‏",
    "malay_translation": "Nabi SAW bersabda: \"Aku diutus dan hari kiamat itu sedekat dua jari ini.\"  Maksudnya: dua jari."
  },
  {
    "id": 6267,
    "hadith_number": 6267,
    "tajuk_hadith": "Tanda-tanda Kiamat",
    "perawi_melayu": "Daripada Abu Hurairah",
    "english_text": "Allah's Messenger (ﷺ) said, \"The Hour will not be established till the sun rises from the west, and when it \nrises (from the west) and the people see it, then all of them will believe (in Allah). But that will be the \ntime when 'No good it will do to a soul to believe then. If it believed not before..\"' (6.158) \nThe Hour will be established (so suddenly) that two persons spreading a garment between them will \nnot be able to finish their bargain, nor will they be able to fold it up. The Hour will be established \nwhile a man is carrying the milk of his she-camel, but cannot drink it; and the Hour will be established \nwhen someone is not able to prepare the tank to water his livestock from it; and the Hour will be \nestablished when some of you has raised his food to his mouth but cannot eat it.",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنْ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا، فَإِذَا طَلَعَتْ فَرَآهَا النَّاسُ آمَنُوا أَجْمَعُونَ، فَذَلِكَ حِينَ لاَ يَنْفَعُ نَفْسًا إِيمَانُهَا، لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ، أَوْ كَسَبَتْ فِي إِيمَانِهَا خَيْرًا، وَلَتَقُومَنَّ السَّاعَةُ وَقَدْ نَشَرَ الرَّجُلاَنِ ثَوْبَهُمَا بَيْنَهُمَا فَلاَ يَتَبَايَعَانِهِ وَلاَ يَطْوِيَانِهِ، وَلَتَقُومَنَّ السَّاعَةُ وَقَدِ انْصَرَفَ الرَّجُلُ بِلَبَنِ لِقْحَتِهِ فَلاَ يَطْعَمُهُ، وَلَتَقُومَنَّ السَّاعَةُ وَهْوَ يَلِيطُ حَوْضَهُ فَلاَ يَسْقِي فِيهِ، وَلَتَقُومَنَّ السَّاعَةُ وَقَدْ رَفَعَ أُكْلَتَهُ إِلَى فِيهِ فَلاَ يَطْعَمُهَا ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Hari Kiamat tidak akan tiba sehingga matahari terbit dari barat. Apabila ia terbit dan manusia melihatnya, maka mereka semua akan beriman. Tetapi pada ketika itu, iman seseorang tidak akan memberi manfaat kepadanya jika dia tidak beriman sebelum itu atau tidak melakukan amal soleh dalam keimanannya.\"  Hari Kiamat akan tiba dengan begitu tiba-tiba sehingga dua orang yang sedang menentangkan kain di antara mereka tidak sempat menyelesaikan jual beli mereka mahupun melipatnya. Hari Kiamat akan tiba ketika seseorang membawa susu untanya tetapi tidak sempat meminumnya. Hari Kiamat akan tiba ketika seseorang sedang membaiki telaga tetapi tidak sempat menyiram ternakannya. Hari Kiamat akan tiba ketika seseorang telah mengangkat makanan ke mulutnya tetapi tidak sempat memakannya."
  },
  {
    "id": 6268,
    "hadith_number": 6268,
    "tajuk_hadith": "Cinta dan Benci Bertemu Allah",
    "perawi_melayu": "Riwayat Ubadah bin As-Samit",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَجَّاجٌ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ، وَمَنْ كَرِهَ لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ ‏\"‏‏.‏ قَالَتْ عَائِشَةُ أَوْ بَعْضُ أَزْوَاجِهِ إِنَّا لَنَكْرَهُ الْمَوْتَ‏.‏ قَالَ ‏\"‏ لَيْسَ ذَاكَ، وَلَكِنَّ الْمُؤْمِنَ إِذَا حَضَرَهُ الْمَوْتُ بُشِّرَ بِرِضْوَانِ اللَّهِ وَكَرَامَتِهِ، فَلَيْسَ شَىْءٌ أَحَبَّ إِلَيْهِ مِمَّا أَمَامَهُ، فَأَحَبَّ لِقَاءَ اللَّهِ وَأَحَبَّ اللَّهُ لِقَاءَهُ، وَإِنَّ الْكَافِرَ إِذَا حُضِرَ بُشِّرَ بِعَذَابِ اللَّهِ وَعُقُوبَتِهِ، فَلَيْسَ شَىْءٌ أَكْرَهَ إِلَيْهِ مِمَّا أَمَامَهُ، كَرِهَ لِقَاءَ اللَّهِ وَكَرِهَ اللَّهُ لِقَاءَهُ ‏\"‏‏.‏ اخْتَصَرَهُ أَبُو دَاوُدَ وَعَمْرٌو عَنْ شُعْبَةَ‏.‏ وَقَالَ سَعِيدٌ عَنْ قَتَادَةَ عَنْ زُرَارَةَ عَنْ سَعْدٍ عَنْ عَائِشَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Sabda Nabi SAW: \"Barangsiapa yang mencintai pertemuan dengan Allah, maka Allah pun mencintai pertemuan dengannya. Dan barangsiapa yang membenci pertemuan dengan Allah, maka Allah pun membenci pertemuan dengannya.\"  Aisyah atau salah seorang isterinya berkata: \"Sesungguhnya kami memang membenci mati.\" Baginda bersabda: \"Bukan begitu maksudnya.  Akan tetapi, apabila seorang mukmin hampir ajalnya, maka dia akan digembirakan dengan keredaan Allah dan kurniaNya, lalu tiada sesuatu yang lebih dicintainya daripada apa yang ada di hadapannya, maka dia mencintai pertemuan dengan Allah dan Allah pun mencintai pertemuan dengannya.  Dan apabila seorang kafir hampir ajalnya, maka dia akan diberitakan dengan azab Allah dan seksanya, lalu tiada sesuatu yang lebih dibencinya daripada apa yang ada di hadapannya, maka dia membenci pertemuan dengan Allah dan Allah pun membenci pertemuan dengannya.\""
  },
  {
    "id": 6269,
    "hadith_number": 6269,
    "tajuk_hadith": "Cinta dan Benci Bertemu Allah",
    "perawi_melayu": "Daripada Abu Musa",
    "english_text": "The Prophet (ﷺ) said: \"Whoever loves to meet  Allah, Allah loves to meet him; and whoever hates to meet Allah, Allah hates to meet him.\"",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ، وَمَنْ كَرِهَ لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Barang siapa yang mencintai pertemuan dengan Allah, nescaya Allah mencintai pertemuan dengannya; dan barang siapa yang membenci pertemuan dengan Allah, nescaya Allah membenci pertemuan dengannya.\""
  },
  {
    "id": 6270,
    "hadith_number": 6270,
    "tajuk_hadith": "Peristiwa Kematian Nabi SAW dan Doa Akhir Baginda",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، وَعُرْوَةُ بْنُ الزُّبَيْرِ، فِي رِجَالٍ مِنْ أَهْلِ الْعِلْمِ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقُولُ وَهْوَ صَحِيحٌ ‏\"‏ إِنَّهُ لَمْ يُقْبَضْ نَبِيٌّ قَطُّ حَتَّى يَرَى مَقْعَدَهُ مِنَ الْجَنَّةِ ثُمَّ يُخَيَّرُ ‏\"‏‏.‏ فَلَمَّا نَزَلَ بِهِ، وَرَأْسُهُ عَلَى فَخِذِي، غُشِيَ عَلَيْهِ سَاعَةً، ثُمَّ أَفَاقَ، فَأَشْخَصَ بَصَرَهُ إِلَى السَّقْفِ ثُمَّ قَالَ ‏\"‏ اللَّهُمَّ الرَّفِيقَ الأَعْلَى ‏\"‏‏.‏ قُلْتُ إِذًا لاَ يَخْتَارُنَا، وَعَرَفْتُ أَنَّهُ الْحَدِيثُ الَّذِي كَانَ يُحَدِّثُنَا بِهِ ـ قَالَتْ ـ فَكَانَتْ تِلْكَ آخِرَ كَلِمَةٍ تَكَلَّمَ بِهَا النَّبِيُّ صلى الله عليه وسلم قَوْلُهُ ‏\"‏ اللَّهُمَّ الرَّفِيقَ الأَعْلَى ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Yahya bin Bukair, telah menceritakan kepada kami Laits, dari Ukayl, dari Ibnu Syihab, telah memberitakan kepadaku Sa'id bin Musayyab dan Urwah bin Zubair, di kalangan beberapa orang ahli ilmu bahawa Aisyah, isteri Nabi SAW berkata: Rasulullah SAW ketika sihat selalu berkata, \"Sesungguhnya tidaklah seorang nabi pun diambil nyawanya sehingga dia melihat tempat duduknya di syurga, kemudian diberi pilihan.\" Maka ketika ajal menimpanya, dan kepalanya di atas pahaku, baginda pengsan seketika, kemudian sedar, lalu baginda memandang ke atas, kemudian berkata, \"Ya Allah, (tempat bersama) para sahabat yang tinggi darjatnya.\" Aku berkata: \"Maka, Baginda tidak akan memilih kita.\" Dan aku tahu bahawa itulah hadis yang biasa Baginda ceritakan kepada kami.  Beliau berkata, dan itulah kalimah terakhir yang diucapkan oleh Nabi SAW iaitu, \"Ya Allah, (tempat bersama) para sahabat yang tinggi darjatnya.\""
  },
  {
    "id": 6271,
    "hadith_number": 6271,
    "tajuk_hadith": "Kemangkatan Rasulullah SAW",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ عُبَيْدِ بْنِ مَيْمُونٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ عُمَرَ بْنِ سَعِيدٍ، قَالَ أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ، أَنَّ أَبَا عَمْرٍو، ذَكْوَانَ مَوْلَى عَائِشَةَ أَخْبَرَهُ أَنَّ عَائِشَةَ ـ رضى الله عنها ـ كَانَتْ تَقُولُ إِنَّ رَسُولَ اللَّهَ صلى الله عليه وسلم كَانَ بَيْنَ يَدَيْهِ رَكْوَةٌ ـ أَوْ عُلْبَةٌ فِيهَا مَاءٌ، يَشُكُّ عُمَرُ ـ فَجَعَلَ يُدْخِلُ يَدَيْهِ فِي الْمَاءِ، فَيَمْسَحُ بِهِمَا وَجْهَهُ وَيَقُولُ ‏\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ، إِنَّ لِلْمَوْتِ سَكَرَاتٍ ‏\"‏‏.‏ ثُمَّ نَصَبَ يَدَهُ فَجَعَلَ يَقُولُ ‏\"‏ فِي الرَّفِيقِ الأَعْلَى ‏\"‏‏.‏ حَتَّى قُبِضَ وَمَالَتْ يَدُهُ‏.‏   \nقَالَ أَبُو عَبْد اللَّهِ الْعُلْبَةُ مِنْ الْخَشَبِ وَالرَّكْوَةُ مِنْ الْأَدَمِ.",
    "malay_translation": "Telah menceritakan kepadaku Muhammad bin Ubaid bin Maimun, telah menceritakan kepada kami Isa bin Yunus, dari Umar bin Sa'id, dia berkata; telah memberitakan kepadaku Ibnu Abi Mualikah, bahawa Abu Amru, Zakwan maula Aisyah memberitakan kepadanya bahawa Aisyah r.a. berkata: Sesungguhnya Rasulullah SAW di hadapan baginda ada bekas kulit atau bekas kayu yang berisi air. Umar merasa ragu-ragu. Maka Baginda memasukkan tangan baginda ke dalam air, kemudian Baginda mengusap muka baginda dengannya sambil berkata: \"Tiada Tuhan melainkan Allah, sesungguhnya kematian itu mempunyai kesakitan\". Kemudian Baginda menegakkan tangannya dan terus berkata: \"Semoga aku bersama sahabat yang paling tinggi darjatnya\". Sehingga Baginda wafat dan tangan baginda jatuh. Abu Abdullah berkata: Bekas kayu daripada kayu dan bekas kulit daripada kulit."
  },
  {
    "id": 6272,
    "hadith_number": 6272,
    "tajuk_hadith": "Kedatangan Kiamat dan Kematian",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "Some rough bedouins used to visit the Prophet (ﷺ) and ask him, \"When will the Hour be?\" He would look at the youngest of all of them and say, \"If this should live till he is very old, your Hour (the death of the people addressed) will take place.\" Hisham said that he meant (by the Hour), their death.",
    "arabic_text": "حَدَّثَنِي صَدَقَةُ، أَخْبَرَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رِجَالٌ مِنَ الأَعْرَابِ جُفَاةً يَأْتُونَ النَّبِيَّ صلى الله عليه وسلم فَيَسْأَلُونَهُ مَتَى السَّاعَةُ، فَكَانَ يَنْظُرُ إِلَى أَصْغَرِهِمْ فَيَقُولُ ‏\n\"‏ إِنْ يَعِشْ هَذَا لاَ يُدْرِكْهُ الْهَرَمُ حَتَّى تَقُومَ عَلَيْكُمْ سَاعَتُكُمْ ‏\"‏‏.‏ قَالَ هِشَامٌ يَعْنِي مَوْتَهُمْ‏.‏",
    "malay_translation": "Beberapa orang Badwi yang kasar selalu mengunjungi Nabi ﷺ dan bertanya, \"Bilakah Hari Kiamat?\" Baginda akan memandang orang yang paling muda di antara mereka dan berkata, \"Sekiranya orang ini hidup sehingga tua, maka Kiamat kamu (maksudnya kematian orang-orang yang ditanya) akan tiba.\" Hisyam berkata bahawa yang dimaksudkan Baginda (dengan Kiamat) ialah kematian mereka."
  },
  {
    "id": 6273,
    "hadith_number": 6273,
    "tajuk_hadith": "Kebebasan dan Kelegaan dalam Kematian",
    "perawi_melayu": "Riwayat Abu Qatadah bin Rib'i Al-Ansari:",
    "english_text": "A funeral procession passed by Allah's Messenger (ﷺ) who said, \"Relieved or relieving?\" The people asked, \n\"O Allah's Messenger (ﷺ)! What is relieved and relieving?\" He said, \"A believer is relieved (by death) from \nthe troubles and hardships of the world and leaves for the Mercy of Allah, while (the death of) a \nwicked person relieves the people, the land, the trees, (and) the animals from him.\"",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ، عَنْ مَعْبَدِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِي قَتَادَةَ بْنِ رِبْعِيٍّ الأَنْصَارِيِّ، أَنَّهُ كَانَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مُرَّ عَلَيْهِ بِجِنَازَةٍ فَقَالَ ‏\"‏ مُسْتَرِيحٌ، وَمُسْتَرَاحٌ مِنْهُ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ مَا الْمُسْتَرِيحُ وَالْمُسْتَرَاحُ مِنْهُ قَالَ ‏\"‏ الْعَبْدُ الْمُؤْمِنُ يَسْتَرِيحُ مِنْ نَصَبِ الدُّنْيَا وَأَذَاهَا إِلَى رَحْمَةِ اللَّهِ، وَالْعَبْدُ الْفَاجِرُ يَسْتَرِيحُ مِنْهُ الْعِبَادُ وَالْبِلاَدُ وَالشَّجَرُ وَالدَّوَابُّ ‏\"‏‏.‏",
    "malay_translation": "Satu jenazah telah lalu di hadapan Rasulullah SAW, baginda bertanya, \"Yang mendapat kelegaan atau yang dilepaskan daripada kelegaan?\"  Para sahabat bertanya, \"Wahai Rasulullah SAW! Apakah maksud yang mendapat kelegaan dan yang dilepaskan daripada kelegaan itu?\" Baginda menjawab, \"Seorang hamba yang beriman mendapat kelegaan daripada kesusahan dan penderitaan dunia, menuju rahmat Allah SWT.  Manakala kematian seorang hamba yang fasik pula, akan melepaskan manusia, bumi, pohon-pohon, dan binatang daripada kejahatannya.\""
  },
  {
    "id": 6274,
    "hadith_number": 6274,
    "tajuk_hadith": "Kebebasan dan Kelegaan Orang Mukmin",
    "perawi_melayu": "Daripada Abu Qatadah",
    "english_text": "The Prophet (ﷺ) said, \"Relieved or relieving. And a believer is relieved (by death).",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ، حَدَّثَنِي ابْنُ كَعْبٍ، عَنْ أَبِي قَتَادَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مُسْتَرِيحٌ، وَمُسْتَرَاحٌ مِنْهُ، الْمُؤْمِنُ يَسْتَرِيحُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"(Kematian adalah) sesuatu yang memberikan kelegaan atau sesuatu yang mendapat kelegaan darinya.  Orang beriman akan mendapat kelegaan (dengan kematian).\""
  },
  {
    "id": 6275,
    "hadith_number": 6275,
    "tajuk_hadith": "Amalan yang Kekal Bersama Jenazah",
    "perawi_melayu": "Anas bin Malik meriwayatkan:",
    "english_text": "Allah's Messenger (ﷺ) said, \"When carried to his grave, a dead person is followed by three, two of which \nreturn (after his burial) and one remains with him: his relative, his property, and his deeds follow him; \nrelatives and his property go back while his deeds remain with him.\"",
    "arabic_text": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي بَكْرِ بْنِ عَمْرِو بْنِ حَزْمٍ، سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ رَسُولُ اللَّهُ صلى الله عليه وسلم ‏\n\"‏ يَتْبَعُ الْمَيِّتَ ثَلاَثَةٌ، فَيَرْجِعُ اثْنَانِ وَيَبْقَى مَعَهُ وَاحِدٌ، يَتْبَعُهُ أَهْلُهُ وَمَالُهُ وَعَمَلُهُ، فَيَرْجِعُ أَهْلُهُ وَمَالُهُ، وَيَبْقَى عَمَلُهُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Apabila jenazah dibawa ke kuburnya, ia diikuti oleh tiga perkara, dua daripadanya akan kembali (selepas pengebumian) dan satu lagi kekal bersamanya: iaitu keluarganya, hartanya dan amalannya. Keluarganya dan hartanya akan kembali, manakala amalannya kekal bersamanya.\""
  },
  {
    "id": 6276,
    "hadith_number": 6276,
    "tajuk_hadith": "Tempat Akhir Setelah Kematian",
    "perawi_melayu": "Riwayat Ibnu Umar",
    "english_text": "Allah's Messenger (ﷺ) said, \"When anyone of you dies, his destination is displayed before him in the \nforenoon and in the afternoon, either in the (Hell) Fire or in Paradise, and it is said to him, \"That is \nyour place till you are resurrected and sent to it.\"",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا مَاتَ أَحَدُكُمْ عُرِضَ عَلَيْهِ مَقْعَدُهُ غُدْوَةً وَعَشِيًّا، إِمَّا النَّارُ وَإِمَّا الْجَنَّةُ، فَيُقَالُ هَذَا مَقْعَدُكَ حَتَّى تُبْعَثَ ‏إِلَيْهِ\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Apabila seseorang di antara kamu mati, maka tempat duduknya akan ditunjukkan kepadanya pada waktu pagi dan petang, sama ada di neraka atau di syurga.  Lalu dikatakan kepadanya: 'Inilah tempat dudukmu sehingga engkau dibangkitkan dan dikembalikan ke tempat ini.'\""
  },
  {
    "id": 6277,
    "hadith_number": 6277,
    "tajuk_hadith": "Jangan Mencaci Orang yang Telah Meninggal Dunia",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "The Prophet (ﷺ) said, \"Do not abuse the dead, for they have reached the result of what they have done.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، أَخْبَرَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، عَنْ مُجَاهِدٍ، عَنْ عَائِشَةَ، قَالَتْ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ تَسُبُّوا الأَمْوَاتَ، فَإِنَّهُمْ قَدْ أَفْضَوْا إِلَى مَا قَدَّمُوا ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Janganlah kamu mencaci orang-orang yang telah meninggal dunia, kerana sesungguhnya mereka telah sampai kepada balasan daripada apa yang telah mereka lakukan.\""
  },
  {
    "id": 6278,
    "hadith_number": 6278,
    "tajuk_hadith": "Jangan Membandingkan Rasulullah dengan Nabi Musa",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، وَالأَعْرَجِ، أَنَّهُمَا حَدَّثَاهُ أَنَّ أَبَا هُرَيْرَةَ قَالَ اسْتَبَّ رَجُلاَنِ، رَجُلٌ مِنَ الْمُسْلِمِينَ وَرَجُلٌ مِنَ الْيَهُودِ فَقَالَ الْمُسْلِمُ وَالَّذِي اصْطَفَى مُحَمَّدًا عَلَى الْعَالَمِينَ‏.‏ فَقَالَ الْيَهُودِيُّ وَالَّذِي اصْطَفَى مُوسَى عَلَى الْعَالَمِينَ، قَالَ فَغَضِبَ الْمُسْلِمُ عِنْدَ ذَلِكَ، فَلَطَمَ وَجْهَ الْيَهُودِيِّ، فَذَهَبَ الْيَهُودِيُّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرَهُ بِمَا كَانَ مِنْ أَمْرِهِ وَأَمْرِ الْمُسْلِمِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تُخَيِّرُونِي عَلَى مُوسَى، فَإِنَّ النَّاسَ يَصْعَقُونَ يَوْمَ الْقِيَامَةِ، فَأَكُونُ فِي أَوَّلِ مَنْ يُفِيقُ، فَإِذَا مُوسَى بَاطِشٌ بِجَانِبِ الْعَرْشِ، فَلاَ أَدْرِي أَكَانَ مُوسَى فِيمَنْ صَعِقَ فَأَفَاقَ قَبْلِي، أَوْ كَانَ مِمَّنِ اسْتَثْنَى اللَّهُ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Abdul Aziz bin Abdullah, dia berkata; Telah menceritakan kepadaku Ibrahim bin Saad, dari Ibnu Syihab, dari Abu Salamah bin Abdurrahman dan Al-A'raj, bahawa mereka berdua menceritakan kepadanya bahawa Abu Hurairah berkata: Dua orang lelaki, seorang daripada kalangan orang Islam dan seorang daripada kalangan orang Yahudi telah bertengkar. Lelaki Islam itu berkata: Demi Zat yang telah memilih Muhammad di atas seluruh alam. Kemudian lelaki Yahudi itu berkata: Demi Zat yang telah memilih Musa di atas seluruh alam. Maka marahlah lelaki Islam itu lalu menampar muka lelaki Yahudi itu. Maka pergilah lelaki Yahudi itu kepada Rasulullah SAW lalu memberitahu baginda tentang apa yang telah berlaku di antara dirinya dan lelaki Islam itu. Maka Rasulullah SAW bersabda: \"Janganlah kamu mendahulukan aku ke atas Musa. Sesungguhnya manusia akan pengsan pada hari kiamat, maka aku adalah orang yang pertama kali sedar. Kemudian aku lihat Musa sedang memegang sisi Arasy. Maka aku tidak tahu adakah Musa termasuk di kalangan mereka yang pengsan kemudian sedar sebelumku atau dia termasuk di kalangan mereka yang dikecualikan oleh Allah.\" "
  },
  {
    "id": 6279,
    "hadith_number": 6279,
    "tajuk_hadith": "Keadaan Nabi SAW pada Hari Kiamat",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \"The people will fall down unconscious at the time when they should fall down (i.e., on the Day of Resurrection), and then I will be the first man to get up, and behold, Moses will be there holding (Allah's) Throne. I will not know whether he has been amongst those who have fallen unconscious.\"",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ يَصْعَقُ النَّاسُ حِينَ يَصْعَقُونَ، فَأَكُونُ أَوَّلَ مَنْ قَامَ، فَإِذَا مُوسَى آخِذٌ بِالْعَرْشِ، فَمَا أَدْرِي أَكَانَ فِيمَنْ صَعِقَ ‏\"‏‏.‏ رَوَاهُ أَبُو سَعِيدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Manusia akan pengsan pada saat mereka sepatutnya pengsan (iaitu pada Hari Kiamat), dan aku akan menjadi orang pertama yang bangun.  Kemudian, aku lihat Musa memegang Arasy.  Aku tidak tahu sama ada Musa termasuk di antara mereka yang pengsan.\""
  },
  {
    "id": 6280,
    "hadith_number": 6280,
    "tajuk_hadith": "Allah SWT Raja Segala-galanya",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \"Allah will take the whole earth (in His Hand) and will roll up the Heaven in His \nright Hand, and then He will say, \"I am King! Where are the kings of the earth ? \"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَقْبِضُ اللَّهُ الأَرْضَ، وَيَطْوِي السَّمَاءَ بِيَمِينِهِ، ثُمَّ يَقُولُ أَنَا الْمَلِكُ أَيْنَ مُلُوكُ الأَرْضِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Allah SWT akan menggenggam bumi dan melipat langit dengan tangan kanan-Nya, kemudian Allah SWT berfirman:  ‘Akulah Raja! Di manakah raja-raja bumi?’\""
  },
  {
    "id": 6281,
    "hadith_number": 6281,
    "tajuk_hadith": "Makanan Ahli Syurga pada Hari Kiamat",
    "perawi_melayu": "Riwayat Abu Sa`id Al-Khudri:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ خَالِدٍ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ تَكُونُ الأَرْضُ يَوْمَ الْقِيَامَةِ خُبْزَةً وَاحِدَةً، يَتَكَفَّؤُهَا الْجَبَّارُ بِيَدِهِ، كَمَا يَكْفَأُ أَحَدُكُمْ خُبْزَتَهُ فِي السَّفَرِ، نُزُلاً لأَهْلِ الْجَنَّةِ ‏\"‏‏.‏ فَأَتَى رَجُلٌ مِنَ الْيَهُودِ فَقَالَ بَارَكَ الرَّحْمَنُ عَلَيْكَ يَا أَبَا الْقَاسِمِ، أَلاَ أُخْبِرُكَ بِنُزُلِ أَهْلِ الْجَنَّةِ يَوْمَ الْقِيَامَةِ قَالَ ‏\"‏ بَلَى ‏\"‏‏.‏ قَالَ تَكُونُ الأَرْضُ خُبْزَةً وَاحِدَةً كَمَا قَالَ النَّبِيُّ صلى الله عليه وسلم فَنَظَرَ النَّبِيُّ صلى الله عليه وسلم إِلَيْنَا، ثُمَّ ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ ثُمَّ قَالَ أَلاَ أُخْبِرُكَ بِإِدَامِهِمْ قَالَ إِدَامُهُمْ بَالاَمٌ وَنُونٌ‏.‏ قَالُوا وَمَا هَذَا قَالَ ثَوْرٌ وَنُونٌ يَأْكُلُ مِنْ زَائِدَةِ كَبِدِهِمَا سَبْعُونَ أَلْفًا‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Yahya bin Bukair, telah menceritakan kepada kami Al-Laits, dari Khalid, dari Sa'id bin Abi Hilal, dari Zaid bin Aslam, dari Ath-Thaa bin Yasar, dari Abu Sa'id Al-Khudri, bahawa Nabi SAW bersabda: \"Pada hari kiamat, bumi akan menjadi satu roti, Yang Maha Kuasa akan menggoncangkannya dengan tangan-Nya, sebagaimana salah seorang daripada kamu menggoncangkan rotinya ketika dalam perjalanan, sebagai hidangan untuk ahli syurga.\"  Kemudian datang seorang lelaki dari kalangan Yahudi lalu berkata: \"Semoga Allah Yang Maha Pemurah memberkati engkau, wahai Abu Al-Qasim.  Bolehkan aku memberitahu engkau tentang hidangan ahli syurga pada hari kiamat?\" Baginda SAW bersabda: \"Ya.\" Lelaki Yahudi itu berkata: \"Bumi akan menjadi satu roti,\" sebagaimana yang telah disebutkan oleh Nabi SAW. Maka Nabi SAW memandang kami, kemudian Baginda tersenyum sehingga kelihatan gigi taring Baginda. Kemudian lelaki Yahudi itu berkata lagi: \"Bolehkan aku memberitahu engkau tentang lauk-pauk mereka bersama roti itu?\"  Dia menambah: \"Lauk-pauk mereka ialah Balam dan Nun.\" Mereka bertanya: \"Apakah itu?\" Dia menjawab: \"Ia adalah lembu jantan dan ikan, dan tujuh puluh ribu orang akan memakan daripada bahagian tambahan hati mereka.\" "
  },
  {
    "id": 6282,
    "hadith_number": 6282,
    "tajuk_hadith": "Kejadian di Hari Kiamat",
    "perawi_melayu": "Daripada Sahl bin Sa'd:",
    "english_text": "I heard the Prophet (ﷺ) saying, \"The people will be gathered on the Day of Resurrection on reddish white \nland like a pure loaf of bread (made of pure fine flour).\" Sahl added: That land will have no landmarks \nfor anybody (to make use of).",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، قَالَ سَمِعْتُ سَهْلَ بْنَ سَعْدٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ يُحْشَرُ النَّاسُ يَوْمَ الْقِيَامَةِ عَلَى أَرْضٍ بَيْضَاءَ عَفْرَاءَ كَقُرْصَةِ نَقِيٍّ ‏\"‏‏.‏ قَالَ سَهْلٌ أَوْ غَيْرُهُ لَيْسَ فِيهَا مَعْلَمٌ لأَحَدٍ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda, \" Manusia akan dikumpulkan pada hari kiamat di atas tanah yang putih kemerahan seperti sekeping roti yang suci (dibuat daripada tepung yang halus dan suci).\" Sahl menambah: Tanah itu tidak mempunyai sebarang tanda bagi sesiapa pun (untuk digunakan)."
  },
  {
    "id": 6283,
    "hadith_number": 6283,
    "tajuk_hadith": "Penghimpunan Manusia pada Hari Kiamat",
    "perawi_melayu": "Dari Abu Hurairah",
    "english_text": "The Prophet (ﷺ) said, \"The people will be gathered in three ways: (The first way will be of) those who \nwill wish or have a hope (for Paradise) and will have a fear (of punishment), (The second batch will \nbe those who will gather) riding two on a camel or three on a camel or ten on a camel. (The third \nbatch) the rest of the people will be urged to gather by the Fire which will accompany them at the time \nof their afternoon nap and stay with them where they will spend the night, and will be with them in the \nmorning wherever they may be then, and will be with them in the afternoon wherever they may be \nthen.\"",
    "arabic_text": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا وُهَيْبٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يُحْشَرُ النَّاسُ عَلَى ثَلاَثِ طَرَائِقَ، رَاغِبِينَ رَاهِبِينَ وَاثْنَانِ عَلَى بَعِيرٍ، وَثَلاَثَةٌ عَلَى بَعِيرٍ، وَأَرْبَعَةٌ عَلَى بَعِيرٍ، وَعَشَرَةٌ عَلَى بَعِيرٍ وَيَحْشُرُ بَقِيَّتَهُمُ النَّارُ، تَقِيلُ مَعَهُمْ حَيْثُ قَالُوا، وَتَبِيتُ مَعَهُمْ حَيْثُ بَاتُوا، وَتُصْبِحُ مَعَهُمْ حَيْثُ أَصْبَحُوا، وَتُمْسِي مَعَهُمْ حَيْثُ أَمْسَوْا ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Manusia akan dikumpulkan dengan tiga cara: (Cara pertama ialah) mereka yang menginginkan dan mengharapkan syurga serta takut akan azab. (Kumpulan kedua ialah) mereka yang berkumpul dengan dua orang atau tiga orang atau sepuluh orang menaiki seekor unta. (Kumpulan ketiga) selebihnya akan dikumpulkan oleh api neraka, yang akan bersama mereka ketika waktu rehat tengah hari, dan bersama mereka di mana sahaja mereka bermalam, dan bersama mereka di mana sahaja mereka berada di waktu pagi, dan bersama mereka di mana sahaja mereka berada di waktu petang.\""
  },
  {
    "id": 6284,
    "hadith_number": 6284,
    "tajuk_hadith": "Kemampuan Allah Membangkitkan Kaum Kafir",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ الْبَغْدَادِيُّ، حَدَّثَنَا شَيْبَانُ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه أَنَّ رَجُلاً، قَالَ يَا نَبِيَّ اللَّهِ كَيْفَ يُحْشَرُ الْكَافِرُ عَلَى وَجْهِهِ قَالَ ‏\n\"‏ أَلَيْسَ الَّذِي أَمْشَاهُ عَلَى الرِّجْلَيْنِ فِي الدُّنْيَا قَادِرًا عَلَى أَنَّ يُمْشِيَهُ عَلَى وَجْهِهِ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏ قَالَ قَتَادَةُ بَلَى وَعِزَّةِ رَبِّنَا‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Muhammad, telah menceritakan kepada kami Yunus bin Muhammad Al-Baghdadi, telah menceritakan kepada kami Syaiban, dari Qatadah, telah menceritakan kepada kami Anas bin Malik - semoga Allah meridhainya - bahawa seorang lelaki telah bertanya, \"Wahai Nabi Allah, bagaimanakah kaum kafir akan dihimpunkan (dibangkitkan) dengan keadaan tertelungkup?\"  Baginda SAW bersabda, \"Bukankah Dia Yang telah menjadikan mereka berjalan dengan dua kaki di dunia ini, mampu untuk menjadikan mereka berjalan dengan muka mereka pada hari kiamat?\"  Qatadah berkata, \"Ya, demi keagungan Tuhan kami!\""
  },
  {
    "id": 6285,
    "hadith_number": 6285,
    "tajuk_hadith": "Menghadap Allah SWT dalam Keadaan Telanjang",
    "perawi_melayu": "Daripada Ibnu Abbas",
    "english_text": "The Prophet (ﷺ) said, \"You will meet Allah barefooted, naked, walking on feet, and uncircumcised.\"",
    "arabic_text": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، قَالَ عَمْرٌو سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، سَمِعْتُ ابْنَ عَبَّاسٍ، سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّكُمْ مُلاَقُو اللَّهِ حُفَاةً عُرَاةً مُشَاةً غُرْلاً ‏\"‏‏.‏ قَالَ سُفْيَانُ هَذَا مِمَّا نَعُدُّ أَنَّ ابْنَ عَبَّاسٍ سَمِعَهُ مِنَ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Sesungguhnya kamu akan menemui Allah SWT dalam keadaan tanpa alas kaki, telanjang, berjalan kaki, dan tidak bersunat.\""
  },
  {
    "id": 6286,
    "hadith_number": 6286,
    "tajuk_hadith": "Menemui Allah SWT dalam Keadaan Telanjang",
    "perawi_melayu": "Daripada Ibnu Abbas",
    "english_text": "I heard Allah's Messenger (ﷺ) while he was delivering a sermon on a pulpit, saying, \"You will meet Allah \nbarefooted, naked, and uncircumcised.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَخْطُبُ عَلَى الْمِنْبَرِ يَقُولُ ‏\n\"‏ إِنَّكُمْ مُلاَقُو اللَّهِ حُفَاةً عُرَاةً غُرْلاً ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW ketika menyampaikan khutbah di atas mimbar, bersabda: \"Sesungguhnya kamu akan menemui Allah SWT dalam keadaan tanpa alas kaki, telanjang dan tidak bersunat.\""
  },
  {
    "id": 6287,
    "hadith_number": 6287,
    "tajuk_hadith": "Keadaan Manusia pada Hari Kiamat",
    "perawi_melayu": "Riwayat Ibnu Abbas",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنِ الْمُغِيرَةِ بْنِ النُّعْمَانِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَامَ فِينَا النَّبِيُّ صلى الله عليه وسلم يَخْطُبُ فَقَالَ ‏\"‏ إِنَّكُمْ مَحْشُورُونَ حُفَاةً عُرَاةً ‏{‏كَمَا بَدَأْنَا أَوَّلَ خَلْقٍ نُعِيدُهُ‏}‏ الآيَةَ، وَإِنَّ أَوَّلَ الْخَلاَئِقِ يُكْسَى يَوْمَ الْقِيَامَةِ إِبْرَاهِيمُ، وَإِنَّهُ سَيُجَاءُ بِرِجَالٍ مِنْ أُمَّتِي، فَيُؤْخَذُ بِهِمْ ذَاتَ الشِّمَالِ‏.‏ فَأَقُولُ يَا رَبِّ أُصَيْحَابِي‏.‏ فَيَقُولُ إِنَّكَ لاَ تَدْرِي مَا أَحْدَثُوا بَعْدَكَ‏.‏ فَأَقُولُ كَمَا قَالَ الْعَبْدُ الصَّالِحُ ‏{‏وَكُنْتُ عَلَيْهِمْ شَهِيدًا مَا دُمْتُ فِيهِمْ‏}‏ إِلَى قَوْلِهِ ‏{‏الْحَكِيمُ‏}‏ قَالَ فَيُقَالُ إِنَّهُمْ لَمْ يَزَالُوا مُرْتَدِّينَ عَلَى أَعْقَابِهِمْ ‏\"‏‏.‏",
    "malay_translation": "Muhammad bin Bashar telah meriwayatkan daripada Gundar, yang meriwayatkan daripada Syu’bah, daripada Mughirah bin Nu’man, daripada Sa’id bin Jubair, daripada Ibnu Abbas, katanya: Nabi SAW telah berdiri di hadapan kami menyampaikan khutbah, lalu baginda bersabda:  \"Sesungguhnya kamu akan dikumpulkan dalam keadaan tanpa alas kaki, tanpa pakaian dan tidak bersunat, sebagaimana firman Allah SWT: {‘Sebagaimana Kami mulakan penciptaan yang pertama, Kami akan mengulanginya’} (al-Taha: 21:104). Dan sesungguhnya orang yang pertama kali akan diberi pakaian pada hari kiamat ialah Nabi Ibrahim.  Dan sesungguhnya akan didatangkan beberapa orang lelaki daripada umatku, lalu mereka akan dibawa ke sebelah kiri (iaitu ke neraka). Maka aku akan berkata: ‘Ya Allah, sahabat-sahabatku.’ Allah SWT akan berfirman: ‘Sesungguhnya engkau tidak mengetahui apa yang telah mereka lakukan setelah engkau meninggalkan mereka.’ Maka aku akan berkata sepertimana yang telah dikatakan oleh hamba yang soleh: {‘Dan aku sentiasa menjadi saksi ke atas mereka selagi aku berada di kalangan mereka’} hingga ke firman Allah SWT: {‘Yang Maha Bijaksana’}. (al-Maidah: 5:117-118).  Kemudian dikatakan bahawa mereka itu tetap kembali kepada kekafiran."
  },
  {
    "id": 6288,
    "hadith_number": 6288,
    "tajuk_hadith": "Keadaan Manusia di Hari Kiamat",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "Allah's Messenger (ﷺ) said, \"The people will be gathered barefooted, naked, and uncircumcised.\" I said, \"O \nAllah's Messenger (ﷺ)! Will the men and the women look at each other?\" He said, \"The situation will be too \nhard for them to pay attention to that.\"",
    "arabic_text": "حَدَّثَنَا قَيْسُ بْنُ حَفْصٍ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا حَاتِمُ بْنُ أَبِي صَغِيرَةَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، قَالَ حَدَّثَنِي الْقَاسِمُ بْنُ مُحَمَّدِ بْنِ أَبِي بَكْرٍ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تُحْشَرُونَ حُفَاةً عُرَاةً غُرْلاً ‏\"‏ قَالَتْ عَائِشَةُ فَقُلْتُ يَا رَسُولَ اللَّهِ الرِّجَالُ وَالنِّسَاءُ يَنْظُرُ بَعْضُهُمْ إِلَى بَعْضٍ‏.‏ فَقَالَ ‏\"‏ الأَمْرُ أَشَدُّ مِنْ أَنْ يُهِمَّهُمْ ذَاكِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Kamu semua akan dikumpulkan dalam keadaan tanpa alas kaki, telanjang, dan tidak bersunat.\"  Aku bertanya, \"Wahai Rasulullah SAW! Adakah lelaki dan perempuan akan saling memandang?\" Baginda menjawab: \"Keadaan pada ketika itu terlalu dahsyat sehingga mereka tidak akan mempedulikan perkara itu.\""
  },
  {
    "id": 6289,
    "hadith_number": 6289,
    "tajuk_hadith": "Separuh Ahli Syurga",
    "perawi_melayu": "Riwayat Abdullah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، عَنْ عَبْدِ اللَّهِ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي قُبَّةٍ فَقَالَ ‏\"‏ أَتَرْضَوْنَ أَنْ تَكُونُوا رُبُعَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ قُلْنَا نَعَمْ‏.‏ قَالَ ‏\"‏ تَرْضَوْنَ أَنْ تَكُونُوا ثُلُثَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ قُلْنَا نَعَمْ‏.‏ قَالَ ‏\"‏ أَتَرْضَوْنَ أَنْ تَكُونُوا شَطْرَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ قُلْنَا نَعَمْ‏.‏ قَالَ ‏\"‏ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ إِنِّي لأَرْجُو أَنْ تَكُونُوا نِصْفَ أَهْلِ الْجَنَّةِ، وَذَلِكَ أَنَّ الْجَنَّةَ لاَ يَدْخُلُهَا إِلاَّ نَفْسٌ مُسْلِمَةٌ، وَمَا أَنْتُمْ فِي أَهْلِ الشِّرْكِ إِلاَّ كَالشَّعْرَةِ الْبَيْضَاءِ فِي جِلْدِ الثَّوْرِ الأَسْوَدِ أَوْ كَالشَّعْرَةِ السَّوْدَاءِ فِي جِلْدِ الثَّوْرِ الأَحْمَرِ ‏\"‏‏.‏",
    "malay_translation": "Kami berada bersama Nabi SAW di dalam sebuah khemah. Baginda bertanya, \"Adakah kamu semua redha jika menjadi seperempat daripada ahli syurga?\" Kami menjawab, \"Ya.\" Baginda bertanya lagi, \"Adakah kamu semua redha jika menjadi sepertiga daripada ahli syurga?\" Kami menjawab, \"Ya.\" Baginda bertanya lagi, \"Adakah kamu semua redha jika menjadi separuh daripada ahli syurga?\" Kami menjawab, \"Ya.\" Baginda bersabda, \"Demi jiwa Muhammad yang berada di tangan-Nya, sesungguhnya aku berharap kamu semua akan menjadi separuh daripada ahli syurga. Ini kerana syurga itu tidak akan dimasuki melainkan oleh jiwa yang beriman, dan kamu semua berbanding dengan mereka yang mempersekutukan Allah SWT adalah seperti sehelai bulu putih di atas kulit lembu hitam, atau sehelai bulu hitam di atas kulit lembu merah.\""
  },
  {
    "id": 6290,
    "hadith_number": 6290,
    "tajuk_hadith": "Adam dan Ummat Nabi SAW pada Hari Kiamat",
    "perawi_melayu": "Riwayat Abu Hurairah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ ثَوْرٍ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ أَوَّلُ مَنْ يُدْعَى يَوْمَ الْقِيَامَةِ آدَمُ، فَتَرَاءَى ذُرِّيَّتُهُ فَيُقَالُ هَذَا أَبُوكُمْ آدَمُ‏.‏ فَيَقُولُ لَبَّيْكَ وَسَعْدَيْكَ‏.‏ فَيَقُولُ أَخْرِجْ بَعْثَ جَهَنَّمَ مِنْ ذُرِّيَّتِكَ‏.‏ فَيَقُولُ يَا رَبِّ كَمْ أُخْرِجُ فَيَقُولُ أَخْرِجْ مِنْ كُلِّ مِائَةٍ تِسْعَةً وَتِسْعِينَ ‏\"‏‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ إِذَا أُخِذَ مِنَّا مِنْ كُلِّ مِائَةٍ تِسْعَةٌ وَتِسْعُونَ، فَمَاذَا يَبْقَى مِنَّا قَالَ ‏\"‏ إِنَّ أُمَّتِي فِي الأُمَمِ كَالشَّعَرَةِ الْبَيْضَاءِ فِي الثَّوْرِ الأَسْوَدِ ‏\"‏‏.‏",
    "malay_translation": "Daripada Ismail, yang memberitakan kepadaku saudaraku, daripada Sulaiman, daripada Tsaur, daripada Abi Al-Ghaits, daripada Abu Hurairah, bahawa Nabi SAW bersabda: \"Orang pertama yang akan dipanggil pada hari kiamat ialah Adam.  Maka zuriatnya akan dapat melihat satu sama lain, dan dikatakan: \"Inilah bapa kamu, Adam.\" Maka Adam akan berkata: \"Labbaik wa Sa'daik.\"  Kemudian Allah SWT akan berfirman: \"Keluarkanlah ahli neraka daripada zuriatmu.\" Maka Adam berkata: \"Ya Tuhanku, berapakah bilangan yang harus ku keluarkan?\"  Allah SWT berfirman: \"Keluarkanlah sembilan puluh sembilan daripada setiap seratus.\"  Lalu mereka berkata: \"Wahai Rasulullah, jika sembilan puluh sembilan daripada setiap seratus daripada kami diambil, maka apakah yang akan tinggal daripada kami?\"  Baginda SAW bersabda: \"Sesungguhnya umatku di kalangan umat-umat lain adalah seperti rambut putih pada lembu hitam.\""
  },
  {
    "id": 6291,
    "hadith_number": 6291,
    "tajuk_hadith": "Janji Nabi SAW tentang umat Islam di Syurga",
    "perawi_melayu": "Riwayat Abu Sa`id:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يُوسُفُ بْنُ مُوسَى، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَقُولُ اللَّهُ يَا آدَمُ‏.‏ فَيَقُولُ لَبَّيْكَ وَسَعْدَيْكَ وَالْخَيْرُ فِي يَدَيْكَ‏.‏ قَالَ يَقُولُ أَخْرِجْ بَعْثَ النَّارِ‏.‏ قَالَ وَمَا بَعْثُ النَّارِ قَالَ مِنْ كُلِّ أَلْفٍ تِسْعَمِائَةٍ وَتِسْعَةً وَتِسْعِينَ‏.‏ فَذَاكَ حِينَ يَشِيبُ الصَّغِيرُ، وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا، وَتَرَى النَّاسَ سَكْرَى وَمَا هُمْ بِسَكْرَى وَلَكِنَّ عَذَابَ اللَّهِ شَدِيدٌ ‏\"‏‏.‏ فَاشْتَدَّ ذَلِكَ عَلَيْهِمْ فَقَالُوا يَا رَسُولُ اللَّهِ أَيُّنَا الرَّجُلُ قَالَ ‏\"‏ أَبْشِرُوا، فَإِنَّ مِنْ يَأْجُوجَ وَمَأْجُوجَ أَلْفٌ وَمِنْكُمْ رَجُلٌ ـ ثُمَّ قَالَ ـ وَالَّذِي نَفْسِي فِي يَدِهِ إِنِّي لأَطْمَعُ أَنْ تَكُونُوا ثُلُثَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ قَالَ فَحَمِدْنَا اللَّهَ وَكَبَّرْنَا، ثُمَّ قَالَ ‏\"‏ وَالَّذِي نَفْسِي فِي يَدِهِ إِنِّي لأَطْمَعُ أَنْ تَكُونُوا شَطْرَ أَهْلِ الْجَنَّةِ، إِنَّ مَثَلَكُمْ فِي الأُمَمِ كَمَثَلِ الشَّعَرَةِ الْبَيْضَاءِ فِي جِلْدِ الثَّوْرِ الأَسْوَدِ أَوِ الرَّقْمَةِ فِي ذِرَاعِ الْحِمَارِ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Yusuf bin Musa, telah menceritakan kepada kami Jarir, dari Al-A'masy, dari Abu Shalih, dari Abu Said, dia berkata: Rasulullah SAW bersabda: \"Allah SWT akan berfirman, 'Wahai Adam!' Maka Adam menjawab, 'Aku sambut seruan-Mu dan aku patuh kepada perintah-Mu, dan kebaikan itu berada di tangan-Mu!' Allah SWT berfirman, 'Keluarkanlah penghuni neraka.' Adam bertanya, 'Siapakah penghuni neraka itu?' Allah SWT berfirman, 'Dari setiap seribu, sembilan ratus sembilan puluh sembilan orang.' Pada masa itu, kanak-kanak akan beruban, setiap wanita hamil akan keguguran, dan kamu akan melihat manusia seperti orang mabuk, padahal mereka bukan mabuk. Namun azab Allah SWT amatlah berat.\"  Berita itu amat menggoncangkan para sahabat, lalu mereka bertanya, \"Wahai Rasulullah SAW! Siapakah di antara kami yang akan diselamatkan (daripada neraka)?\" Baginda SAW menjawab, \"Bersukacitalah, sesungguhnya dari golongan Ya'juj dan Ma'juj pun ada seribu orang, dan daripada kamu seorang.\" Kemudian Baginda SAW bersabda, \"Demi Allah yang jiwa ku ada di tangan-Nya, sesungguhnya aku berharap kamu akan menjadi sepertiga penghuni syurga.\"  Lalu kami memuji Allah SWT dan bertakbir. Kemudian Baginda SAW bersabda, \"Demi Allah yang jiwa ku ada di tangan-Nya, sesungguhnya aku berharap kamu akan menjadi separuh penghuni syurga. Sesungguhnya perumpamaan kamu di kalangan umat lain adalah seperti sehelai rambut putih pada kulit lembu hitam, atau seperti satu tompok kecil yang tidak berbulu pada kaki keldai.\""
  },
  {
    "id": 6292,
    "hadith_number": 6292,
    "tajuk_hadith": "Kejadian Pada Hari Kiamat",
    "perawi_melayu": "Riwayat Ibnu Umar",
    "english_text": "The Prophet (ﷺ) said (regarding the Verse), \"A Day when all mankind will stand before the Lord of the \nWorlds,' (that day) they will stand, drowned in their sweat up to the middle of their ears.\"",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبَانَ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ ‏{‏يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ‏}‏ قَالَ ‏\"‏ يَقُومُ أَحَدُهُمْ فِي رَشْحِهِ إِلَى أَنْصَافِ أُذُنَيْهِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda (berkenaan ayat), \"Pada hari manusia berdiri di hadapan Tuhan sekalian alam,\" (pada hari itu) mereka akan berdiri, tenggelam dalam peluh mereka sehingga paras tengah telinga."
  },
  {
    "id": 6293,
    "hadith_number": 6293,
    "tajuk_hadith": "Peluh pada Hari Kiamat",
    "perawi_melayu": "Dari Abu Hurairah",
    "english_text": "Allah's Messenger (ﷺ) said, \"The people will sweat so profusely on the Day of Resurrection that their sweat \nwill sink seventy cubits deep into the earth, and it will rise up till it reaches the people's mouths and \nears.\"",
    "arabic_text": "حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي سُلَيْمَانُ، عَنْ ثَوْرِ بْنِ زَيْدٍ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَعْرَقُ النَّاسُ يَوْمَ الْقِيَامَةِ حَتَّى يَذْهَبَ عَرَقُهُمْ فِي الأَرْضِ سَبْعِينَ ذِرَاعًا، وَيُلْجِمُهُمْ حَتَّى يَبْلُغَ آذَانَهُمْ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Pada Hari Kiamat, manusia akan berpeluh dengan sangat banyak sehingga peluh mereka akan meresap ke dalam bumi sedalam tujuh puluh hasta, dan akan naik sehingga mencapai mulut dan telinga mereka.\""
  },
  {
    "id": 6294,
    "hadith_number": 6294,
    "tajuk_hadith": "Pembalasan Pertama di Hari Kiamat: Kes-kes Pembunuhan",
    "perawi_melayu": "Riwayat Abdullah:",
    "english_text": "The Prophet (ﷺ) said, \"The cases which will be decided first (on the Day of Resurrection) will be the cases of blood-shedding. \"",
    "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنِي شَقِيقٌ، سَمِعْتُ عَبْدَ اللَّهِ ـ رضى الله عنه ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ أَوَّلُ مَا يُقْضَى بَيْنَ النَّاسِ بِالدِّمَاءِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Perkara pertama yang akan diputuskan di antara manusia pada Hari Kiamat ialah kes-kes pembunuhan.\""
  },
  {
    "id": 6295,
    "hadith_number": 6295,
    "tajuk_hadith": "Mencari Maaf Sebelum Mati",
    "perawi_melayu": "Riwayat Abu Hurairah",
    "english_text": "Allah's Messenger (ﷺ) said, \"Whoever has wronged his brother, should ask for his pardon (before his death), \nas (in the Hereafter) there will be neither a Dinar nor a Dirham. (He should secure pardon in this life) \nbefore some of his good deeds are taken and paid to his brother, or, if he has done no good deeds, \nsome of the bad deeds of his brother are taken to be loaded on him (in the Hereafter).",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ كَانَتْ عِنْدَهُ مَظْلَمَةٌ لأَخِيهِ فَلْيَتَحَلَّلْهُ مِنْهَا، فَإِنَّهُ لَيْسَ ثَمَّ دِينَارٌ وَلاَ دِرْهَمٌ مِنْ قَبْلِ أَنْ يُؤْخَذَ لأَخِيهِ مِنْ حَسَنَاتِهِ، فَإِنْ لَمْ يَكُنْ لَهُ حَسَنَاتٌ أُخِذَ مِنْ سَيِّئَاتِ أَخِيهِ، فَطُرِحَتْ عَلَيْهِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: “Barangsiapa yang telah menzalimi saudaranya, maka hendaklah dia meminta maaf kepadanya sebelum mati, kerana di akhirat nanti tidak ada dinar mahupun dirham. (Hendaklah dia mendapat kemaafan di dunia ini) sebelum sebahagian daripada amalan baiknya diambil dan diberikan kepada saudaranya, atau jika dia tidak mempunyai amalan baik, maka sebahagian daripada amalan buruk saudaranya akan diambil dan dibebankan kepadanya (di akhirat nanti).”"
  },
  {
    "id": 6296,
    "hadith_number": 6296,
    "tajuk_hadith": "Orang Beriman Di Jembatan Antara Syurga dan Neraka",
    "perawi_melayu": "Daripada Abu Sa`id Al-Khudri:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي الصَّلْتُ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، ‏{‏وَنَزَعْنَا مَا فِي صُدُورِهِمْ مِنْ غِلٍّ‏}‏ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَبِي الْمُتَوَكِّلِ النَّاجِيِّ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَخْلُصُ الْمُؤْمِنُونَ مِنَ النَّارِ، فَيُحْبَسُونَ عَلَى قَنْطَرَةٍ بَيْنَ الْجَنَّةِ وَالنَّارِ، فَيُقَصُّ لِبَعْضِهِمْ مِنْ بَعْضٍ، مَظَالِمُ كَانَتْ بَيْنَهُمْ فِي الدُّنْيَا، حَتَّى إِذَا هُذِّبُوا وَنُقُّوا أُذِنَ لَهُمْ فِي دُخُولِ الْجَنَّةِ، فَوَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لأَحَدُهُمْ أَهْدَى بِمَنْزِلِهِ فِي الْجَنَّةِ مِنْهُ بِمَنْزِلِهِ كَانَ فِي الدُّنْيَا ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Orang-orang mukmin akan diselamatkan daripada api neraka, kemudian mereka akan ditahan di atas sebuah jambatan di antara syurga dan neraka.  Maka, antara mereka akan dibalas kesalahan yang pernah berlaku di antara mereka di dunia, sehingga apabila mereka telah disucikan dan dibersihkan, mereka dibenarkan masuk ke dalam syurga. Demi Allah yang jiwa Muhammad berada di tangan-Nya, sesungguhnya setiap seorang daripada mereka akan lebih mengetahui tempat tinggalnya di syurga daripada tempat tinggalnya di dunia.\""
  },
  {
    "id": 6297,
    "hadith_number": 6297,
    "tajuk_hadith": "Hisab dan Azab",
    "perawi_melayu": "Riwayat Ibnu Abi Mulaikah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ عُثْمَانَ بْنِ الأَسْوَدِ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ نُوقِشَ الْحِسَابَ عُذِّبَ ‏\"‏‏.‏ قَالَتْ قُلْتُ أَلَيْسَ يَقُولُ اللَّهُ تَعَالَى ‏{‏فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا‏}‏‏.‏ قَالَ ‏\"‏ ذَلِكِ الْعَرْضُ ‏\"‏‏.‏   حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى، عَنْ عُثْمَانَ بْنِ الأَسْوَدِ، سَمِعْتُ ابْنَ أَبِي مُلَيْكَةَ، قَالَ سَمِعْتُ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم مِثْلَهُ‏.‏ وَتَابَعَهُ ابْنُ جُرَيْجٍ وَمُحَمَّدُ بْنُ سُلَيْمٍ وَأَيُّوبُ وَصَالِحُ بْنُ رُسْتُمٍ عَنِ ابْنِ أَبِي مُلَيْكَةَ عَنْ عَائِشَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ubaidullah bin Musa, dari Usman bin Aswad, dari Ibnu Abi Mulaikah, dari Aisyah, dari Nabi SAW, baginda bersabda:  \"Barangsiapa yang dipersoalkan hisabnya, nescaya dia akan diazab.\"  Aisyah berkata: Saya bertanya, \"Bukankah Allah SWT berfirman:  {Kemudian dia akan dihisab dengan hisab yang mudah}?\" Baginda menjawab: \"Itulah (maksudnya)  pemeriksaan (hisab) sahaja.\"  Telah menceritakan kepadaku Amru bin Ali, telah menceritakan kepada kami Yahya, dari Usman bin Aswad, saya mendengar Ibnu Abi Mulaikah berkata, saya mendengar Aisyah r.a. berkata, saya mendengar Nabi SAW menyebut yang serupa. Dan turut meriwayatkannya Ibnu Juraij, Muhammad bin Sulaim, Ayyub dan Shalih bin Rustum dari Ibnu Abi Mulaikah, dari Aisyah, dari Nabi SAW."
  },
  {
    "id": 6298,
    "hadith_number": 6298,
    "tajuk_hadith": "Hisab pada Hari Kiamat",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا حَاتِمُ بْنُ أَبِي صَغِيرَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي مُلَيْكَةَ، حَدَّثَنِي الْقَاسِمُ بْنُ مُحَمَّدٍ، حَدَّثَتْنِي عَائِشَةُ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لَيْسَ أَحَدٌ يُحَاسَبُ يَوْمَ الْقِيَامَةِ إِلاَّ هَلَكَ ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ أَلَيْسَ قَدْ قَالَ اللَّهُ تَعَالَى ‏{‏فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ * فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا‏}‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا ذَلِكِ الْعَرْضُ، وَلَيْسَ أَحَدٌ يُنَاقَشُ الْحِسَابَ يَوْمَ الْقِيَامَةِ إِلاَّ عُذِّبَ ‏\"‏‏.‏",
    "malay_translation": "Aku diberitahu oleh Ishak bin Mansur, yang diberitahu oleh Ruh bin Ubadah, yang diberitahu oleh Hatim bin Abi Shagirah, yang diberitahu oleh Abdullah bin Abi Mualikah, yang diberitahu oleh Qasim bin Muhammad, yang diberitahu oleh Aisyah bahawa Rasulullah SAW bersabda:  \"Tiada seorang pun yang akan dihisab pada hari kiamat melainkan dia akan binasa.\" Maka aku berkata, \"Wahai Rasulullah, bukankah Allah SWT telah berfirman: {Maka adapun orang yang diberi kitabnya di tangan kanannya, nescaya dia akan dihisab dengan hisab yang mudah} (Al-Insyirah: 7-8)?\"  Rasulullah SAW bersabda: \"Itu hanyalah penyampaian (kiraan), dan tiada seorang pun yang dipersoalkan hisabnya pada hari kiamat melainkan dia akan di azab.\""
  },
  {
    "id": 6299,
    "hadith_number": 6299,
    "tajuk_hadith": "Kesempatan Yang Lebih Mudah",
    "perawi_melayu": "Anas bin Malik:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم وَحَدَّثَنِي مُحَمَّدُ بْنُ مَعْمَرٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم كَانَ يَقُولُ ‏\n\"‏ يُجَاءُ بِالْكَافِرِ يَوْمَ الْقِيَامَةِ فَيُقَالُ لَهُ أَرَأَيْتَ لَوْ كَانَ لَكَ مِلْءُ الأَرْضِ ذَهَبًا أَكُنْتَ تَفْتَدِي بِهِ فَيَقُولُ نَعَمْ‏.‏ فَيُقَالُ لَهُ قَدْ كُنْتَ سُئِلْتَ مَا هُوَ أَيْسَرُ مِنْ ذَلِكَ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ali bin Abdullah, telah menceritakan kepada kami Mu'adz bin Hisyam, katanya telah menceritakan kepadaku ayahku, daripada Qatadah, daripada Anas, daripada Nabi SAW. Dan telah menceritakan kepadaku Muhammad bin Ma'mar, telah menceritakan kepada kami Ruh bin Ubadah, telah menceritakan kepada kami Sa'id, daripada Qatadah, telah menceritakan kepada kami Anas bin Malik - r.a - bahawa Nabi Allah SAW  berkata:  \"Orang kafir akan dibawa pada hari kiamat, lalu dikatakan kepadanya:  'Bagaimana jika engkau memiliki emas sepenuh bumi, adakah engkau akan menebus dirimu dengannya?'  Dia akan menjawab: 'Ya.'  Lalu dikatakan kepadanya:  'Engkau telah ditanya sesuatu yang lebih mudah daripada itu.'"
  },
  {
    "id": 6300,
    "hadith_number": 6300,
    "tajuk_hadith": "Percakapan Langsung dengan Allah pada Hari Kiamat",
    "perawi_melayu": "Riwayat Adi bin Hatim",
    "english_text": "The Prophet (ﷺ) said, \"There will be none among you but will be talked to by Allah on the Day of \nResurrection, without there being an interpreter between him and Him (Allah) . He will look and see \nnothing ahead of him, and then he will look (again for the second time) in front of him, and the (Hell) \nFire will confront him. So, whoever among you can save himself from the Fire, should do so even \nwith one half of a date (to give in charity).",
    "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي قَالَ، حَدَّثَنِي الأَعْمَشُ، قَالَ حَدَّثَنِي خَيْثَمَةُ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَا مِنْكُمْ مِنْ أَحَدٍ إِلاَّ وَسَيُكَلِّمُهُ اللَّهُ يَوْمَ الْقِيَامَةِ، لَيْسَ بَيْنَ اللَّهِ وَبَيْنَهُ تُرْجُمَانٌ، ثُمَّ يَنْظُرُ فَلاَ يَرَى شَيْئًا قُدَّامَهُ، ثُمَّ يَنْظُرُ بَيْنَ يَدَيْهِ فَتَسْتَقْبِلُهُ النَّارُ، فَمَنِ اسْتَطَاعَ مِنْكُمْ أَنْ يَتَّقِيَ النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Tiada seorang pun di antara kamu melainkan akan diajak bercakap oleh Allah SWT pada hari kiamat, tanpa seorang penterjemah pun di antara Allah SWT dan dirinya.  Kemudian dia akan melihat, lalu tidak akan melihat apa-apa di hadapannya. Kemudian dia akan melihat lagi ke hadapannya, maka api neraka akan menghadapinya. Oleh itu, sesiapa di antara kamu yang mampu menyelamatkan dirinya daripada api neraka, walaupun hanya dengan separuh biji tamar (sebagai sedekah), hendaklah dia berbuat demikian.\""
  },
  {
    "id": 6301,
    "hadith_number": 6301,
    "tajuk_hadith": "Mencegah Diri daripada Api Neraka",
    "perawi_melayu": "Riwayat `Adi bin Hatim:",
    "english_text": "The Prophet (ﷺ) said, \"Protect yourself from the Fire.\" He then turned his face aside (as if he were looking at it) and said again, \"Protect yourself from the Fire,\" and then turned his face aside (as if he were looking at it), and he said so for the third time till we thought he was looking at it. He then said, \"Protect yourselves from the Fire, even if with one half of a date and he who hasn't got even this, (should do so) by (saying) a good, pleasant word.'",
    "arabic_text": "قَالَ الأَعْمَشُ حَدَّثَنِي عَمْرٌو، عَنْ خَيْثَمَةَ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اتَّقُوا النَّارَ ‏\"‏‏.‏ ثُمَّ أَعْرَضَ وَأَشَاحَ، ثُمَّ قَالَ ‏\"‏ اتَّقُوا النَّارَ ‏\"‏‏.‏ ثُمَّ أَعْرَضَ وَأَشَاحَ ثَلاَثًا، حَتَّى ظَنَنَّا أَنَّهُ يَنْظُرُ إِلَيْهَا، ثُمَّ قَالَ ‏\"‏ اتَّقُوا النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ، فَمَنْ لَمْ يَجِدْ فَبِكَلِمَةٍ طَيِّبَةٍ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Lindungilah diri kamu daripada api neraka.\"  Kemudian Baginda berpaling (seolah-olah Baginda memandang ke arahnya) dan bersabda lagi, \"Lindungilah diri kamu daripada api neraka.\" Kemudian Baginda berpaling (seolah-olah Baginda memandang ke arahnya), dan Baginda bersabda demikian untuk kali ketiga sehingga kami menyangka Baginda sedang memandang ke arahnya. Kemudian Baginda bersabda, \"Lindungilah diri kamu daripada api neraka, walaupun hanya dengan separuh biji tamar; dan bagi sesiapa yang tidak mempunyai pun ini, (hendaklah melakukannya) dengan (mengatakan) kata-kata yang baik dan menyenangkan.\""
  },
  {
    "id": 6302,
    "hadith_number": 6302,
    "tajuk_hadith": "Ummat Nabi SAW dan 70,000 Orang yang Terhindar Hisab",
    "perawi_melayu": "Riwayat Ibnu Abbas",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ، حَدَّثَنَا ابْنُ فُضَيْلٍ، حَدَّثَنَا حُصَيْنٌ،‏.‏ وَحَدَّثَنِي أَسِيدُ بْنُ زَيْدٍ، حَدَّثَنَا هُشَيْمٌ، عَنْ حُصَيْنٍ، قَالَ كُنْتُ عِنْدَ سَعِيدِ بْنِ جُبَيْرٍ فَقَالَ حَدَّثَنِي ابْنُ عَبَّاسٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ عُرِضَتْ عَلَىَّ الأُمَمُ، فَأَخَذَ النَّبِيُّ يَمُرُّ مَعَهُ الأُمَّةُ، وَالنَّبِيُّ يَمُرُّ مَعَهُ النَّفَرُ، وَالنَّبِيُّ يَمُرُّ مَعَهُ الْعَشَرَةُ، وَالنَّبِيُّ يَمُرُّ مَعَهُ الْخَمْسَةُ، وَالنَّبِيُّ يَمُرُّ وَحْدَهُ، فَنَظَرْتُ فَإِذَا سَوَادٌ كَثِيرٌ قُلْتُ يَا جِبْرِيلُ هَؤُلاَءِ أُمَّتِي قَالَ لاَ وَلَكِنِ انْظُرْ إِلَى الأُفُقِ‏.‏ فَنَظَرْتُ فَإِذَا سَوَادٌ كَثِيرٌ‏.‏ قَالَ هَؤُلاَءِ أُمَّتُكَ، وَهَؤُلاَءِ سَبْعُونَ أَلْفًا قُدَّامَهُمْ، لاَ حِسَابَ عَلَيْهِمْ وَلاَ عَذَابَ‏.‏ قُلْتُ وَلِمَ قَالَ كَانُوا لاَ يَكْتَوُونَ، وَلاَ يَسْتَرْقُونَ، وَلاَ يَتَطَيَّرُونَ، وَعَلَى رَبِّهِمْ يَتَوَكَّلُونَ ‏\"‏‏.‏ فَقَامَ إِلَيْهِ عُكَّاشَةُ بْنُ مِحْصَنٍ فَقَالَ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ‏.‏ قَالَ ‏\"‏ اللَّهُمَّ اجْعَلْهُ مِنْهُمْ ‏\"‏‏.‏ ثُمَّ قَامَ إِلَيْهِ رَجُلٌ آخَرُ قَالَ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ‏.‏ قَالَ ‏\"‏ سَبَقَكَ بِهَا عُكَّاشَةُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Ummat-ummat telah ditunjukkan kepadaku. Aku melihat seorang Nabi lalu dengan pengikutnya yang ramai, dan seorang Nabi lalu dengan beberapa orang sahaja, dan seorang Nabi lalu dengan sepuluh orang sahaja, dan seorang Nabi lalu dengan lima orang sahaja, dan seorang Nabi lalu sendirian.  Kemudian aku melihat suatu kumpulan yang ramai, maka aku bertanya kepada Jibril, \"Adakah ini ummatku?\" Jibril menjawab, \"Tidak, tetapi lihatlah ke ufuk.\" Aku melihat suatu kumpulan yang sangat ramai. Jibril berkata, \"Mereka itu adalah ummatmu, dan tujuh puluh ribu orang di hadapan mereka, mereka tidak akan dihisab dan tidak akan diazab.\" Aku bertanya, \"Mengapa?\" Jibril menjawab, \"Kerana mereka tidak melakukan kauterisasi (rawatan membakar), tidak berubat dengan ruqyah, tidak mempercayai petanda buruk, dan mereka bertawakkal kepada Tuhan mereka.\" Maka berdirilah kepada baginda Ukkasyah bin Mihshan lalu berkata, \"Doakanlah Allah SWT agar menjadikan aku sebahagian daripada mereka.\" Nabi SAW bersabda, \"Ya Allah, jadikanlah dia sebahagian daripada mereka.\" Kemudian berdirilah seorang lelaki lain lalu berkata, \"Doakanlah Allah SWT agar menjadikan aku sebahagian daripada mereka.\" Baginda SAW bersabda, \"Ukkasyah mendahului kamu.\""
  },
  {
    "id": 6303,
    "hadith_number": 6303,
    "tajuk_hadith": "Tujuh Puluh Ribu Umat Yang Masuk Syurga",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُعَاذُ بْنُ أَسَدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، حَدَّثَهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ يَدْخُلُ مِنْ أُمَّتِي زُمْرَةٌ هُمْ سَبْعُونَ أَلْفًا، تُضِيءُ وُجُوهُهُمْ إِضَاءَةَ الْقَمَرِ لَيْلَةَ الْبَدْرِ ‏\"‏‏.‏ وَقَالَ أَبُو هُرَيْرَةَ فَقَامَ عُكَّاشَةُ بْنُ مِحْصَنٍ الأَسَدِيُّ يَرْفَعُ نَمِرَةً عَلَيْهِ فَقَالَ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ‏.‏ قَالَ ‏\"‏ اللَّهُمَّ اجْعَلْهُ مِنْهُمْ ‏\"‏‏.‏ ثُمَّ قَامَ رَجُلٌ مِنَ الأَنْصَارِ فَقَالَ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ‏.‏ فَقَالَ ‏\"‏ سَبَقَكَ عُكَّاشَةُ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Mu'adz bin Asad, telah memberitakan kepada kami Abdullah, telah memberitakan kepada kami Yunus daripada Az- Zuhri, dia berkata; telah menceritakan kepadaku Sa'id bin Al-Musayyab bahawa Abu Hurairah telah menceritakan kepadanya, bahawa dia mendengar Rasulullah SAW bersabda: \"Daripada umatku akan masuk syurga satu kumpulan seramai tujuh puluh ribu orang, muka mereka akan bersinar seperti cahaya bulan pada malam purnama.\" Dan Abu Hurairah berkata: Maka berdirilah Ukasyah bin Mihshan Al-Asadi sambil mengangkat kainnya lalu berkata: \"Wahai Rasulullah, mohonkanlah kepada Allah agar menjadikan aku salah seorang daripada mereka.\" Baginda bersabda: \"Ya Allah, jadikanlah dia salah seorang daripada mereka.\" Kemudian berdirilah seorang lelaki daripada kalangan Ansar lalu berkata: \"Wahai Rasulullah, mohonkanlah kepada Allah agar menjadikan aku salah seorang daripada mereka.\" Baginda bersabda: \"Ukasyah telah mendahului kamu.\""
  },
  {
    "id": 6304,
    "hadith_number": 6304,
    "tajuk_hadith": "Tujuh Puluh Ribu atau Tujuh Ratus Ribu Pengikut Nabi SAW Masuk Syurga",
    "perawi_melayu": "Daripada Sahl bin Sa'd:",
    "english_text": "The Prophet (ﷺ) said, \"Seventy-thousand or seven-hundred thousand of my followers (the narrator is in \ndoubt as to the correct number) will enter Paradise holding each other till the first and the last of them \nenter Paradise at the same time, and their faces will have a glitter like that of the moon at night when it \nis full.\"",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لَيَدْخُلَنَّ الْجَنَّةَ مِنْ أُمَّتِي سَبْعُونَ أَلْفًا أَوْ سَبْعُمِائَةِ أَلْفٍ ـ شَكَّ فِي أَحَدِهِمَا ـ مُتَمَاسِكِينَ، آخِذٌ بَعْضُهُمْ بِبَعْضٍ، حَتَّى يَدْخُلَ أَوَّلُهُمْ وَآخِرُهُمُ الْجَنَّةَ، وَوُجُوهُهُمْ عَلَى ضَوْءِ الْقَمَرِ لَيْلَةَ الْبَدْرِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Tujuh puluh ribu atau tujuh ratus ribu pengikutku (perawi ragu-ragu tentang nombor yang tepat) akan masuk syurga dengan bergandengan tangan, sehingga yang pertama dan yang terakhir daripada mereka akan masuk syurga pada masa yang sama, dan wajah mereka akan bersinar seperti cahaya bulan pada malam purnama.\""
  },
  {
    "id": 6305,
    "hadith_number": 6305,
    "tajuk_hadith": "Kekekalan di Syurga dan Neraka",
    "perawi_melayu": "Riwayat Ibnu Umar:",
    "english_text": "The Prophet; said, \"The people of Paradise will enter Paradise, and the people of the (Hell) Fire will \nenter the (Hell) Fire: then a call-maker will get up (and make an announcement) among them, 'O the \npeople of the (Hell) Fire! No death anymore ! And O people of Paradise! No death (anymore) but \nEternity.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، حَدَّثَنَا نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا دَخَلَ أَهْلُ الْجَنَّةِ الْجَنَّةَ، وَأَهْلُ النَّارِ النَّارَ، ثُمَّ يَقُومُ مُؤَذِّنٌ بَيْنَهُمْ يَا أَهْلَ النَّارِ لاَ مَوْتَ، وَيَا أَهْلَ الْجَنَّةِ لاَ مَوْتَ، خُلُودٌ ‏\"‏‏.‏",
    "malay_translation": "Sabda Nabi SAW:  “Apabila penduduk syurga telah masuk syurga dan penduduk neraka telah masuk neraka, maka seorang penyeru akan berdiri di antara mereka lalu menyeru: Wahai penduduk neraka! Tiada lagi kematian! Dan wahai penduduk syurga! Tiada lagi kematian, hanya kekekalan.”"
  },
  {
    "id": 6306,
    "hadith_number": 6306,
    "tajuk_hadith": "Kekekalan di Syurga dan Neraka",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \" It will be said to the people of Paradise, 'O people of Paradise! Eternity (for you) \nand no death,' and to the people of the Fire, 'O people of the Fire, eternity (for you) and no death!'\"",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ يُقَالُ لأَهْلِ الْجَنَّةِ خُلُودٌ لاَ مَوْتَ‏.‏ وَلأَهْلِ النَّارِ يَا أَهْلَ النَّارِ خُلُودٌ لاَ مَوْتَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Dikatakan kepada penghuni syurga, 'Wahai penghuni syurga! Kekekalan (untuk kamu) dan tiada kematian,' dan kepada penghuni neraka, 'Wahai penghuni neraka, kekekalan (untuk kamu) dan tiada kematian!'"
  },
  {
    "id": 6307,
    "hadith_number": 6307,
    "tajuk_hadith": "Kebanyakan Ahli Syurga dan Neraka",
    "perawi_melayu": "Riwayat Imran",
    "english_text": "The Prophet (ﷺ) said, \"I looked into paradise and saw that the majority of its people were the poor, and I looked into the Fire and found that the majority of its people were women.\"",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ الْهَيْثَمِ، حَدَّثَنَا عَوْفٌ، عَنْ أَبِي رَجَاءٍ، عَنْ عِمْرَانَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ اطَّلَعْتُ فِي الْجَنَّةِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا الْفُقَرَاءَ وَاطَّلَعْتُ فِي النَّارِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Aku melihat ke dalam syurga dan aku lihat kebanyakan penduduknya adalah orang-orang miskin, dan aku melihat ke dalam neraka dan aku lihat kebanyakan penduduknya adalah perempuan.\""
  },
  {
    "id": 6308,
    "hadith_number": 6308,
    "tajuk_hadith": "Kebanyakan penghuni syurga adalah golongan miskin, dan kebanyakan penghuni neraka adalah wanita",
    "perawi_melayu": "Daripada Usamah",
    "english_text": "The Prophet (ﷺ) said, \"I stood at the gate of Paradise and saw that the majority of the people who had \nentered it were poor people, while the rich were forbidden (to enter along with the poor, because they \nwere waiting the reckoning of their accounts), but the people of the Fire had been ordered to be driven \nto the Fire. And I stood at the gate of the Fire and found that the majority of the people entering it \nwere women.\"",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا إِسْمَاعِيلُ، أَخْبَرَنَا سُلَيْمَانُ التَّيْمِيُّ، عَنْ أَبِي عُثْمَانَ، عَنْ أُسَامَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ قُمْتُ عَلَى باب الْجَنَّةِ فَكَانَ عَامَّةُ مَنْ دَخَلَهَا الْمَسَاكِينَ، وَأَصْحَابُ الْجَدِّ مَحْبُوسُونَ، غَيْرَ أَنَّ أَصْحَابَ النَّارِ قَدْ أُمِرَ بِهِمْ إِلَى النَّارِ، وَقُمْتُ عَلَى باب النَّارِ فَإِذَا عَامَّةُ مَنْ دَخَلَهَا النِّسَاءُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Aku berdiri di pintu syurga, dan aku mendapati kebanyakan orang yang memasukinya adalah orang-orang miskin.  Manakala orang-orang kaya ditahan (daripada memasuki syurga bersama orang miskin kerana mereka menunggu hisab akaun mereka).  Dan aku berdiri di pintu neraka, maka aku dapati kebanyakan orang yang memasukinya adalah wanita.\""
  },
  {
    "id": 6309,
    "hadith_number": 6309,
    "tajuk_hadith": "Kematian Setelah Masuk Syurga dan Neraka",
    "perawi_melayu": "Riwayat Ibnu Umar:",
    "english_text": "Allah's Messenger (ﷺ) said, \"When the people of Paradise have entered Paradise and the people of the Fire \nhave entered the Fire, death will be brought and will be placed between the Fire and Paradise, and \nthen it will be slaughtered, and a call will be made (that), 'O people of Paradise, no more death ! O \npeople of the Fire, no more death ! ' So the people of Paradise will have happiness added to their \nprevious happiness, and the people of the Fire will have sorrow added to their previous sorrow.\"",
    "arabic_text": "حَدَّثَنَا مُعَاذُ بْنُ أَسَدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا عُمَرُ بْنُ مُحَمَّدِ بْنِ زَيْدٍ، عَنْ أَبِيهِ، أَنَّهُ حَدَّثَهُ عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا صَارَ أَهْلُ الْجَنَّةِ إِلَى الْجَنَّةِ، وَأَهْلُ النَّارِ إِلَى النَّارِ، جِيءَ بِالْمَوْتِ حَتَّى يُجْعَلَ بَيْنَ الْجَنَّةِ وَالنَّارِ، ثُمَّ يُذْبَحُ، ثُمَّ يُنَادِي مُنَادٍ يَا أَهْلَ الْجَنَّةِ لاَ مَوْتَ، يَا أَهْلَ النَّارِ لاَ مَوْتَ، فَيَزْدَادُ أَهْلُ الْجَنَّةِ فَرَحًا إِلَى فَرَحِهِمْ‏.‏ وَيَزْدَادُ أَهْلُ النَّارِ حُزْنًا إِلَى حُزْنِهِمْ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Apabila penduduk syurga telah masuk ke dalam syurga dan penduduk neraka telah masuk ke dalam neraka, maka kematian akan dibawa dan diletakkan di antara syurga dan neraka, kemudian ia disembelih.  Lalu seorang penyeru akan menyeru, ‘Wahai penduduk syurga, tidak ada lagi kematian! Wahai penduduk neraka, tidak ada lagi kematian!’ Maka penduduk syurga akan bertambah gembira di atas kegembiraan mereka, dan penduduk neraka akan bertambah sedih di atas kesedihan mereka.\""
  },
  {
    "id": 6310,
    "hadith_number": 6310,
    "tajuk_hadith": "Keredaan Allah SWT Ke Atas Ahli Syurga",
    "perawi_melayu": "Riwayat Abu Sa`id Al-Khudri:",
    "english_text": "Allah's Messenger (ﷺ) said, \"Allah will say to the people of Paradise, 'O the people of Paradise!' They will \nsay, 'Labbaik, O our Lord, and Sa`daik!' Allah will say, 'Are you pleased?\" They will say, 'Why \nshould we not be pleased since You have given us what You have not given to anyone of Your \ncreation?' Allah will say, 'I will give you something better than that.' They will reply, 'O our Lord! \nAnd what is better than that?' Allah will say, 'I will bestow My pleasure and contentment upon you so \nthat I will never be angry with you after for-ever.' \"",
    "arabic_text": "حَدَّثَنَا مُعَاذُ بْنُ أَسَدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ اللَّهَ يَقُولُ لأَهْلِ الْجَنَّةِ يَا أَهْلَ الْجَنَّةِ‏.‏ يَقُولُونَ لَبَّيْكَ رَبَّنَا وَسَعْدَيْكَ‏.‏ فَيَقُولُ هَلْ رَضِيتُمْ فَيَقُولُونَ وَمَا لَنَا لاَ نَرْضَى وَقَدْ أَعْطَيْتَنَا مَا لَمْ تُعْطِ أَحَدًا مِنْ خَلْقِكَ‏.‏ فَيَقُولُ أَنَا أُعْطِيكُمْ أَفْضَلَ مِنْ ذَلِكَ‏.‏ قَالُوا يَا رَبِّ وَأَىُّ شَىْءٍ أَفْضَلُ مِنْ ذَلِكَ فَيَقُولُ أُحِلُّ عَلَيْكُمْ رِضْوَانِي فَلاَ أَسْخَطُ عَلَيْكُمْ بَعْدَهُ أَبَدًا ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Allah SWT akan berfirman kepada ahli syurga, ‘Wahai ahli syurga!’ Mereka akan menjawab, ‘Labbaik, ya Tuhan kami, dan Sa’daik!’ Allah SWT akan berfirman, ‘Adakah kamu semua reda?’ Mereka akan menjawab, ‘Mengapa kami tidak reda sedangkan Engkau telah memberikan kepada kami apa yang tidak Engkau berikan kepada sesiapa pun daripada makhluk Engkau?’ Allah SWT akan berfirman, ‘Aku akan memberikan kepada kamu sesuatu yang lebih baik daripada itu.’ Mereka akan bertanya, ‘Ya Tuhan kami! Apakah yang lebih baik daripada itu?’ Allah SWT akan berfirman, ‘Aku akan limpahkan keredaan-Ku ke atas kamu, maka Aku tidak akan murka kepada kamu lagi selama-lamanya.’\""
  },
  {
    "id": 6311,
    "hadith_number": 6311,
    "tajuk_hadith": "Syurga Firdaus untuk Haritha",
    "perawi_melayu": "Riwayat Anas:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ حُمَيْدٍ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ أُصِيبَ حَارِثَةُ يَوْمَ بَدْرٍ وَهْوَ غُلاَمٌ، فَجَاءَتْ أُمُّهُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ قَدْ عَرَفْتَ مَنْزِلَةَ حَارِثَةَ مِنِّي، فَإِنْ يَكُ فِي الْجَنَّةِ أَصْبِرْ وَأَحْتَسِبْ، وَإِنْ تَكُنِ الأُخْرَى تَرَى مَا أَصْنَعُ‏.‏ فَقَالَ ‏\n\"‏ وَيْحَكِ ـ أَوَهَبِلْتِ ـ أَوَجَنَّةٌ وَاحِدَةٌ هِيَ جِنَانٌ كَثِيرَةٌ، وَإِنَّهُ لَفِي جَنَّةِ الْفِرْدَوْسِ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Abdullah bin Muhammad, telah menceritakan kepada kami Muawiyah bin Amr, telah menceritakan kepada kami Abu Ishaq, dari Humaid, dia berkata: Aku mendengar Anas berkata: Haritha gugur syahid pada perang Badar ketika dia masih muda. Maka datanglah ibunya kepada Nabi SAW lalu berkata: Wahai Rasulullah, engkau tahu kedudukan Haritha di hatiku. Jika dia di syurga, aku akan bersabar dan bertawakkal kepada Allah. Tetapi jika tidak, engkau akan melihat apa yang akan aku lakukan.  Lalu Nabi SAW bersabda: “Celakalah kamu! Apakah kamu telah hilang akal? Adakah hanya satu syurga? Syurga itu banyak, dan sesungguhnya dia berada di syurga Firdaus.”"
  },
  {
    "id": 6312,
    "hadith_number": 6312,
    "tajuk_hadith": "Lebar Bahu Orang Kafir",
    "perawi_melayu": "Dari Abu Hurairah",
    "english_text": "The Prophet (ﷺ) said, \"The width between the two shoulders of a Kafir \n     (disbeliever) will be equal to the distance covered by a fast rider in\n     three days.\"",
    "arabic_text": "حَدَّثَنَا مُعَاذُ بْنُ أَسَدٍ، أَخْبَرَنَا الْفَضْلُ بْنُ مُوسَى، أَخْبَرَنَا الْفُضَيْلُ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏مَا بَيْنَ مَنْكِبَىِ الْكَافِرِ مَسِيرَةُ ثَلاَثَةِ أَيَّامٍ لِلرَّاكِبِ الْمُسْرِعِ‏\"‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Lebar antara dua bahu orang kafir adalah sejauh perjalanan penunggang kuda yang laju selama tiga hari.\""
  },
  {
    "id": 6313,
    "hadith_number": 6313,
    "tajuk_hadith": "Pokok Yang Sangat Besar di Syurga",
    "perawi_melayu": "Riwayat Sahl bin Sa'd:",
    "english_text": "Allah's Messenger (ﷺ) said, \"In Paradise there is a tree so big that in its \n     shade a rider may travel for one hundred years without being able to \n     cross it.\"",
    "arabic_text": "وَقَالَ إِسْحَاقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا الْمُغِيرَةُ بْنُ سَلَمَةَ، حَدَّثَنَا وُهَيْبٌ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ فِي الْجَنَّةِ لَشَجَرَةً يَسِيرُ الرَّاكِبُ فِي ظِلِّهَا مِائَةَ عَامٍ، لاَ يَقْطَعُهَا ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Sesungguhnya di dalam syurga ada sebuah pohon yang amat besar, sehingga seorang penunggang kuda dapat menunggang di bawah naungannya selama seratus tahun tanpa dapat sampai ke hujungnya.\""
  },
  {
    "id": 6314,
    "hadith_number": 6314,
    "tajuk_hadith": "Pokok di Syurga",
    "perawi_melayu": "Riwayat Abu Sa'id:",
    "english_text": "The Prophet (ﷺ) said: There is a tree in Paradise (so huge) that a fast \n     (or a trained) rider may travel: for one hundred years without being \n     able to cross it.",
    "arabic_text": "قَالَ أَبُو حَازِمٍ فَحَدَّثْتُ بِهِ النُّعْمَانَ بْنَ أَبِي عَيَّاشٍ، فَقَالَ حَدَّثَنِي أَبُو سَعِيدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ فِي الْجَنَّةِ لَشَجَرَةً يَسِيرُ الرَّاكِبُ الْجَوَادَ الْمُضَمَّرَ السَّرِيعَ مِائَةَ عَامٍ، مَا يَقْطَعُهَا ‏\"‏‏.‏",
    "malay_translation": "Abu Hazim berkata, lalu aku menceritakannya kepada Nu'man bin Abi Ayyasy, lalu dia berkata, \"Abu Sa’id menceritakan kepadaku, daripada Nabi SAW bahawa baginda bersabda: \"Sesungguhnya di dalam syurga itu ada sebatang pohon yang besar, penunggang kuda yang terpantas sekalipun akan mengambil masa seratus tahun untuk melintasinya.\""
  },
  {
    "id": 6315,
    "hadith_number": 6315,
    "tajuk_hadith": "Tujuh Puluh atau Tujuh Ratus Ribu Umat Nabi SAW Masuk Syurga",
    "perawi_melayu": "Daripada Sahl bin Sa'd:",
    "english_text": "Allah's Messenger (ﷺ) said, \"Seventy thousand or seven hundred thousand of my followers will enter \nParadise. (Abu Hazim, the sub-narrator, is not sure as to which of the two numbers is correct.) They \nwill be holding on to each other, the first will not entering the last one does, their faces like the moon \non a full moon night.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَيَدْخُلَنَّ الْجَنَّةَ مِنْ أُمَّتِي سَبْعُونَ أَوْ سَبْعُمِائَةِ أَلْفٍ ـ لاَ يَدْرِي أَبُو حَازِمٍ أَيُّهُمَا قَالَ ـ مُتَمَاسِكُونَ، آخِذٌ بَعْضُهُمْ بَعْضًا، لاَ يَدْخُلُ أَوَّلُهُمْ حَتَّى يَدْخُلَ آخِرُهُمْ، وُجُوهُهُمْ عَلَى صُورَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Sesungguhnya akan masuk syurga daripada umatku tujuh puluh ribu atau tujuh ratus ribu – Abu Hazim tidak pasti mana satu daripada dua nombor ini yang benar – mereka berganding bahu, saling berpegang, yang terawal tidak akan masuk sehingga yang terakhir masuk, wajah-wajah mereka seperti wajah bulan pada malam purnama.\""
  },
  {
    "id": 6316,
    "hadith_number": 6316,
    "tajuk_hadith": "Keindahan Ghuraf di Syurga",
    "perawi_melayu": "Riwayat Sahl:",
    "english_text": "The Prophet (ﷺ) said, \"The people of Paradise will see the Ghuraf (special abodes) in Paradise as you see \na star in the sky.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَبِيهِ، عَنْ سَهْلٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏إِنَّ أَهْلَ الْجَنَّةِ لَيَتَرَاءَوْنَ الْغُرَفَ فِي الْجَنَّةِ كَمَا تَتَرَاءَوْنَ الْكَوْكَبَ فِي السَّمَاءِ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Sesungguhnya penduduk syurga akan melihat Ghuraf (kandang-kandang istimewa) di syurga sebagaimana kamu melihat bintang di langit.\""
  },
  {
    "id": 6317,
    "hadith_number": 6317,
    "tajuk_hadith": "Keadaan Manusia di Akhirat",
    "perawi_melayu": "Abu Said menambahkan:",
    "english_text": "\"As you see a glittering star remaining in the eastern horizon and \nthe western horizon.\"",
    "arabic_text": "قَالَ أَبِي فَحَدَّثْتُ النُّعْمَانَ بْنَ أَبِي عَيَّاشٍ، فَقَالَ أَشْهَدُ لَسَمِعْتُ أَبَا سَعِيدٍ يُحَدِّثُ وَيَزِيدُ فِيهِ ‏\n\"‏ كَمَا تَرَاءَوْنَ الْكَوْكَبَ الْغَارِبَ فِي الأُفُقِ الشَّرْقِيِّ وَالْغَرْبِيِّ ‏\"‏‏.‏",
    "malay_translation": "Sepertimana kamu melihat bintang yang berkelip-kelip di ufuk timur dan barat."
  },
  {
    "id": 6318,
    "hadith_number": 6318,
    "tajuk_hadith": "Allah SWT dan Azab Neraka bagi yang paling ringan azabnya",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "The Prophet (ﷺ) said, \"Allah will say to the person who will have the minimum punishment in the Fire on \nthe Day of Resurrection, 'If you had things equal to whatever is on the earth, would you ransom \nyourself (from the punishment) with it?' He will reply, Yes. Allah will say, 'I asked you a much easier \nthing than this while you were in the backbone of Adam, that is, not to worship others besides Me, but \nyou refused and insisted to worship others besides Me.\"'",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي عِمْرَانَ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَقُولُ اللَّهُ تَعَالَى لأَهْوَنِ أَهْلِ النَّارِ عَذَابًا يَوْمَ الْقِيَامَةِ لَوْ أَنَّ لَكَ مَا فِي الأَرْضِ مِنْ شَىْءٍ أَكُنْتَ تَفْتَدِي بِهِ فَيَقُولُ نَعَمْ‏.‏ فَيَقُولُ أَرَدْتُ مِنْكَ أَهْوَنَ مِنْ هَذَا وَأَنْتَ فِي صُلْبِ آدَمَ أَنْ لاَ تُشْرِكَ بِي شَيْئًا فَأَبَيْتَ إِلاَّ أَنْ تُشْرِكَ بِي ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Allah SWT akan berfirman kepada penghuni neraka yang paling ringan azabnya pada Hari Kiamat, ‘Sekiranya kamu memiliki semua yang ada di bumi, adakah kamu akan menebus dirimu (dari azab) dengannya?’ Dia akan menjawab, ‘Ya.’ Allah SWT akan berfirman, ‘Aku telah meminta sesuatu yang lebih mudah daripada ini kepadamu ketika engkau berada di tulang belakang Adam, iaitu janganlah kamu menyekutukan-Ku dengan sesuatu, tetapi engkau enggan dan tetap mahu menyekutukan-Ku.\""
  },
  {
    "id": 6319,
    "hadith_number": 6319,
    "tajuk_hadith": "Mereka yang Keluar dari Neraka Melalui Syafaat",
    "perawi_melayu": "Riwayat Hammad daripada `Amr daripada Jabir:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادٌ، عَنْ عَمْرٍو، عَنْ جَابِرٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ يَخْرُجُ مِنَ النَّارِ بِالشَّفَاعَةِ كَأَنَّهُمُ الثَّعَارِيرُ ‏\"‏‏.‏ قُلْتُ مَا الثَّعَارِيرُ قَالَ الضَّغَابِيسُ‏.‏ وَكَانَ قَدْ سَقَطَ فَمُهُ فَقُلْتُ لِعَمْرِو بْنِ دِينَارٍ أَبَا مُحَمَّدٍ سَمِعْتَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏ يَخْرُجُ بِالشَّفَاعَةِ مِنَ النَّارِ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'man, telah menceritakan kepada kami Hammad, dari `Amr, dari Jabir r.a. bahawa Nabi SAW bersabda:  \"Segelintir manusia akan keluar dari neraka melalui syafaat, seakan-akan mereka adalah Tha'ariir.\" Aku bertanya: Apakah Tha'ariir itu?  Dia menjawab: Ad-Dhaghabis.  Ketika itu, dia telah kehilangan giginya.  Lalu aku bertanya kepada `Amr bin Dinar: Wahai Abu Muhammad, adakah engkau mendengar Jabir bin Abdullah berkata: Aku mendengar Nabi SAW bersabda: \"Segelintir manusia akan keluar dari neraka melalui syafaat?\"  Dia menjawab: Ya."
  },
  {
    "id": 6320,
    "hadith_number": 6320,
    "tajuk_hadith": "Orang-orang yang Keluar dari Neraka",
    "perawi_melayu": "Anas bin Malik meriwayatkan:",
    "english_text": "The Prophet (ﷺ) said, \"Some people will come out of the Fire after they have received a touch of the Fire, \nchanging their color, and they will enter Paradise, and the people of Paradise will name them 'Al- \nJahannamiyin' the (Hell) Fire people.\"",
    "arabic_text": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَخْرُجُ قَوْمٌ مِنَ النَّارِ بَعْدَ مَا مَسَّهُمْ مِنْهَا سَفْعٌ، فَيَدْخُلُونَ الْجَنَّةَ، فَيُسَمِّيهِمْ أَهْلُ الْجَنَّةِ الْجَهَنَّمِيِّينَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Sesungguhnya akan keluar segolongan manusia daripada neraka setelah mereka merasai sedikit azab api neraka, lalu mereka akan masuk syurga.  Dan penduduk syurga akan menamakan mereka sebagai al-Jahannamiyin (penduduk neraka).\""
  },
  {
    "id": 6321,
    "hadith_number": 6321,
    "tajuk_hadith": "Rahmat Allah SWT kepada Hamba yang Beriman",
    "perawi_melayu": "Riwayat Abu Sa`id Al-Khudri:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُوسَى، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَمْرُو بْنُ يَحْيَى، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا دَخَلَ أَهْلُ الْجَنَّةِ الْجَنَّةَ، وَأَهْلُ النَّارِ النَّارَ يَقُولُ اللَّهُ مَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنْ خَرْدَلٍ مِنْ إِيمَانٍ فَأَخْرِجُوهُ‏.‏ فَيُخْرَجُونَ قَدِ امْتُحِشُوا وَعَادُوا حُمَمًا، فَيُلْقَوْنَ فِي نَهَرِ الْحَيَاةِ، فَيَنْبُتُونَ كَمَا تَنْبُتُ الْحِبَّةُ فِي حَمِيلِ السَّيْلِ ـ أَوْ قَالَ ـ حَمِيَّةِ السَّيْلِ ‏\"‏‏.‏ وَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَلَمْ تَرَوْا أَنَّهَا تَنْبُتُ صَفْرَاءَ مُلْتَوِيَةً ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Apabila penduduk syurga telah masuk syurga, dan penduduk neraka telah masuk neraka, Allah SWT akan berfirman: 'Keluarkanlah sesiapa yang ada dalam hatinya iman seberat biji sawi.' Mereka akan dikeluarkan, ketika itu mereka telah hangus dan menjadi seperti bara api, kemudian mereka akan dilemparkan ke dalam sungai kehidupan, lalu mereka akan tumbuh sebagaimana tumbuhnya biji benih di tebing aliran air hujan - atau baginda berkata - di kawasan aliran air hujan.\"  Baginda SAW bersabda lagi: \"Tidakkah kamu melihat bahawa ia tumbuh berwarna kuning dan berpintal?\""
  },
  {
    "id": 6322,
    "hadith_number": 6322,
    "tajuk_hadith": "Azab Paling Ringan di Neraka",
    "perawi_melayu": "Riwayat An-Nu'man:",
    "english_text": "I heard the Prophet (ﷺ) saying, \"The person who will have the least punishment from amongst the Hell Fire people on the Day of Resurrection, will be a man under whose arch of the feet a smoldering ember will be placed so that his brain will boil because of it.\"",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ أَبَا إِسْحَاقَ، قَالَ سَمِعْتُ النُّعْمَانَ، سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏إِنَّ أَهْوَنَ أَهْلِ النَّارِ عَذَابًا يَوْمَ الْقِيَامَةِ لَرَجُلٌ تُوضَعُ فِي أَخْمَصِ قَدَمَيْهِ جَمْرَةٌ يَغْلِي مِنْهَا دِمَاغُهُ‏\"‏.‏",
    "malay_translation": "Aku mendengar Nabi SAW bersabda, \"Sesungguhnya orang yang paling ringan azabnya di neraka pada hari kiamat ialah seorang lelaki yang diletakkan bara api di tapak kakinya sehingga otaknya mendidih karenanya.\""
  },
  {
    "id": 6323,
    "hadith_number": 6323,
    "tajuk_hadith": "Azab Neraka Bagi Penghuni Neraka yang Paling Ringan",
    "perawi_melayu": "Daripada An-Nu`man bin Bashir:",
    "english_text": "I heard the Prophet (ﷺ) saying, \"The least punished person of the (Hell) Fire people on the Day of \nResurrection will be a man under whose arch of the feet two smoldering embers will be placed, \nbecause of which his brain will boil just like Al-Mirjal (copper vessel) or a Qum-qum (narrow-necked \nvessel) is boiling with water.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ أَهْوَنَ أَهْلِ النَّارِ عَذَابًا يَوْمَ الْقِيَامَةِ رَجُلٌ عَلَى أَخْمَصِ قَدَمَيْهِ جَمْرَتَانِ يَغْلِي مِنْهُمَا دِمَاغُهُ، كَمَا يَغْلِي الْمِرْجَلُ وَالْقُمْقُمُ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Nabi ﷺ bersabda, \"Sesungguhnya orang yang paling ringan azabnya di neraka pada hari kiamat ialah seorang lelaki yang di bawah tapak kakinya diletakkan dua bara api yang menyebabkan otaknya mendidih seperti mendidihnya periuk tembaga atau periuk bertutup sempit berisi air.\""
  },
  {
    "id": 6324,
    "hadith_number": 6324,
    "tajuk_hadith": "Menjauhi Api Neraka Walaupun Dengan Sebiji Kurma",
    "perawi_melayu": "Daripada Adi bin Hatim",
    "english_text": "The Prophet (ﷺ) mentioned the Fire and turned his face aside and asked for Allah's protection from it, and \nthen again he mentioned the Fire and turned his face aside and asked for Allah's protection from it and \nsaid, \"Protect yourselves from the Hell-Fire, even if with one half of a date, and he who cannot afford \nthat, then (let him do so) by (saying) a good, pleasant word.\"",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرٍو، عَنْ خَيْثَمَةَ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم ذَكَرَ النَّارَ فَأَشَاحَ بِوَجْهِهِ فَتَعَوَّذَ مِنْهَا، ثُمَّ ذَكَرَ النَّارَ فَأَشَاحَ بِوَجْهِهِ فَتَعَوَّذَ مِنْهَا، ثُمَّ قَالَ ‏\n\"‏ اتَّقُوا النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ، فَمَنْ لَمْ يَجِدْ فَبِكَلِمَةٍ طَيِّبَةٍ ‏\"‏‏.‏",
    "malay_translation": "Daripada Adi bin Hatim;  Nabi Muhammad SAW menyebut tentang api neraka lalu baginda berpaling muka dan memohon perlindungan daripada Allah SWT daripadanya. Kemudian baginda sekali lagi menyebut tentang api neraka, berpaling muka dan memohon perlindungan daripada Allah SWT daripadanya.  Kemudian baginda bersabda: \"Jauhilah api neraka, walaupun hanya dengan separuh biji kurma. Dan bagi sesiapa yang tidak mampu (berbuat demikian), maka (lakukanlah) dengan kata-kata yang baik dan menyenangkan.\""
  },
  {
    "id": 6325,
    "hadith_number": 6325,
    "tajuk_hadith": "Syafaat Rasulullah SAW untuk Bapa Saudaranya, Abu Talib",
    "perawi_melayu": "Daripada Abu Sa`id Al-Khudri:",
    "english_text": "I heard Allah's Messenger (ﷺ)s when his uncle, Abu Talib had been mentioned in his presence, saying, \"May \nbe my intercession will help him (Abu Talib) on the Day of Resurrection so that he may be put in a \nshallow place in the Fire, with fire reaching his ankles and causing his brain to boil.\"",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ، حَدَّثَنَا ابْنُ أَبِي حَازِمٍ، وَالدَّرَاوَرْدِيُّ، عَنْ يَزِيدَ، عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَذُكِرَ عِنْدَهُ عَمُّهُ أَبُو طَالِبٍ فَقَالَ ‏\n\"‏ لَعَلَّهُ تَنْفَعُهُ شَفَاعَتِي يَوْمَ الْقِيَامَةِ فَيُجْعَلُ فِي ضَحْضَاحٍ مِنَ النَّارِ، يَبْلُغُ كَعْبَيْهِ، يَغْلِي مِنْهُ أُمُّ دِمَاغِهِ ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW, ketika bapa saudaranya, Abu Talib disebut di hadapan baginda, bersabda: \"Mudah-mudahan syafaatku akan bermanfaat baginya (Abu Talib) pada Hari Kiamat, lalu dia diletakkan di tempat yang cetek dalam api neraka, yang mencapai buku lali sahaja, dan otaknya mendidih.\" "
  },
  {
    "id": 6326,
    "hadith_number": 6326,
    "tajuk_hadith": "Syafaat Nabi Muhammad SAW pada Hari Kiamat",
    "perawi_melayu": "Dari Anas",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَجْمَعُ اللَّهُ النَّاسَ يَوْمَ الْقِيَامَةِ فَيَقُولُونَ لَوِ اسْتَشْفَعْنَا عَلَى رَبِّنَا حَتَّى يُرِيحَنَا مِنْ مَكَانِنَا‏.‏ فَيَأْتُونَ آدَمَ فَيَقُولُونَ أَنْتَ الَّذِي خَلَقَكَ اللَّهُ بِيَدِهِ، وَنَفَخَ فِيكَ مِنْ رُوحِهِ، وَأَمَرَ الْمَلاَئِكَةَ فَسَجَدُوا لَكَ، فَاشْفَعْ لَنَا عِنْدَ رَبِّنَا‏.‏ فَيَقُولُ لَسْتُ هُنَاكُمْ ـ وَيَذْكُرُ خَطِيئَتَهُ وَيَقُولُ ـ ائْتُوا نُوحًا أَوَّلَ رَسُولٍ بَعَثَهُ اللَّهُ‏.‏ فَيَأْتُونَهُ فَيَقُولُ لَسْتُ هُنَاكُمْ ـ وَيَذْكُرُ خَطِيئَتَهُ ـ ائْتُوا إِبْرَاهِيمَ الَّذِي اتَّخَذَهُ اللَّهُ خَلِيلاً‏.‏ فَيَأْتُونَهُ، فَيَقُولُ لَسْتُ هُنَاكُمْ ـ وَيَذْكُرُ خَطِيئَتَهُ ـ ائْتُوا مُوسَى الَّذِي كَلَّمَهُ اللَّهُ فَيَأْتُونَهُ فَيَقُولُ لَسْتُ هُنَاكُمْ، فَيَذْكُرُ خَطِيئَتَهُ ـ ائْتُوا عِيسَى فَيَأْتُونَهُ فَيَقُولُ لَسْتُ هُنَاكُمْ، ائْتُوا مُحَمَّدًا صلى الله عليه وسلم فَقَدْ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَا تَأَخَّرَ فَيَأْتُونِي فَأَسْتَأْذِنُ عَلَى رَبِّي، فَإِذَا رَأَيْتُهُ وَقَعْتُ سَاجِدًا، فَيَدَعُنِي مَا شَاءَ اللَّهُ، ثُمَّ يُقَالُ ارْفَعْ رَأْسَكَ، سَلْ تُعْطَهْ، وَقُلْ يُسْمَعْ، وَاشْفَعْ تُشَفَّعْ‏.‏ فَأَرْفَعُ رَأْسِي، فَأَحْمَدُ رَبِّي بِتَحْمِيدٍ يُعَلِّمُنِي، ثُمَّ أَشْفَعُ فَيَحُدُّ لِي حَدًّا، ثُمَّ أُخْرِجُهُمْ مِنَ النَّارِ، وَأُدْخِلُهُمُ الْجَنَّةَ، ثُمَّ أَعُودُ فَأَقَعُ سَاجِدًا مِثْلَهُ فِي الثَّالِثَةِ أَوِ الرَّابِعَةِ حَتَّى مَا بَقِيَ فِي النَّارِ إِلاَّ مَنْ حَبَسَهُ الْقُرْآنُ ‏\"‏‏.‏ وَكَانَ قَتَادَةُ يَقُولُ عِنْدَ هَذَا أَىْ وَجَبَ عَلَيْهِ الْخُلُودُ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Allah SWT akan mengumpulkan semua manusia pada Hari Kiamat, lalu mereka akan berkata, 'Alangkah baiknya jika kita meminta syafaat kepada Tuhan kita supaya Dia melepaskan kita dari tempat kita ini.'  Kemudian mereka akan menghampiri Adam dan berkata, 'Engkaulah yang diciptakan Allah SWT dengan tangan-Nya sendiri, dan ditiupkan-Nya ruh ke dalam dirimu, dan diperintahkan-Nya para malaikat untuk sujud kepadamu, maka mohonlah syafaat untuk kami kepada Tuhan kami.' Adam akan menjawab, 'Aku tidak layak untuk melakukan ini,' dan dia akan mengingati dosanya, lalu berkata, 'Pergilah kepada Nuh, rasul pertama yang diutus oleh Allah SWT.' Mereka akan menghampirinya, lalu dia akan berkata, 'Aku tidak layak untuk melakukan ini,' dan dia akan mengingati dosanya, lalu berkata, 'Pergilah kepada Ibrahim yang Allah SWT jadikan sebagai Khalil (sahabat karib).' Mereka akan menghampirinya dan meminta (syafaat). Dia akan menjawab, 'Aku tidak layak untuk melakukan ini,' dan dia akan mengingati dosanya, lalu berkata, 'Pergilah kepada Musa yang Allah SWT bercakap langsung kepadanya.' Mereka akan menghampirinya, lalu dia akan berkata, 'Aku tidak layak untuk melakukan ini,' dan dia akan mengingati dosanya, lalu berkata, 'Pergilah kepada Isa.' Mereka akan menghampirinya, lalu dia akan berkata, 'Aku tidak layak untuk melakukan ini, pergilah kepada Muhammad SAW kerana sesungguhnya dosanya yang lalu dan yang akan datang telah diampunkan.' Mereka akan datang kepadaku, maka aku akan memohon izin kepada Tuhanku. Apabila aku melihat-Nya, aku akan sujud. Maka Dia akan membiarkan aku dalam keadaan itu selama yang dikehendaki Allah SWT. Kemudian akan dikatakan, 'Angkatlah kepalamu (wahai Muhammad)! Minta, nescaya engkau akan diberi, katakan, nescaya engkau akan didengar, mohon syafaat, nescaya syafaatmu akan diterima.'  Lalu aku akan mengangkat kepalaku, kemudian aku akan memuji Tuhanku dengan pujian yang diajarkan-Nya kepadaku. Kemudian aku akan memohon syafaat, maka Allah SWT akan menetapkan had bagiku (iaitu jenis-jenis manusia tertentu yang boleh aku syafaatkan), kemudian aku akan mengeluarkan mereka dari neraka dan memasukkan mereka ke dalam syurga. Kemudian aku akan kembali (kepada Allah SWT) dan sujud, dan aku akan melakukan perkara yang sama untuk kali ketiga atau keempat sehingga tidak ada lagi yang tinggal di dalam neraka kecuali mereka yang dikurung di dalamnya oleh al-Quran.\" (Qatadah berkata pada ketika itu, “...mereka yang diwajibkan ke atas mereka azab kekal.”) "
  },
  {
    "id": 6327,
    "hadith_number": 6327,
    "tajuk_hadith": "Kumpulan yang Dikeluarkan dari Neraka Melalui Syafaat Nabi Muhammad SAW",
    "perawi_melayu": "Riwayat Imran bin Husain:",
    "english_text": "The Prophet (ﷺ) said, \"Some people will be taken out of the Fire through the intercession of Muhammad \nthey will enter Paradise and will be called Al-Jahannamiyin (the Hell Fire people).",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنِ الْحَسَنِ بْنِ ذَكْوَانَ، حَدَّثَنَا أَبُو رَجَاءٍ، حَدَّثَنَا عِمْرَانُ بْنُ حُصَيْن ٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَخْرُجُ قَوْمٌ مِنَ النَّارِ بِشَفَاعَةِ مُحَمَّدٍ صلى الله عليه وسلم فَيَدْخُلُونَ الْجَنَّةَ، يُسَمَّوْنَ الْجَهَنَّمِيِّينَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Segelintir manusia akan dikeluarkan daripada api neraka melalui syafaat Muhammad SAW. Mereka akan masuk syurga dan digelar Al-Jahannamiyin (penduduk neraka).\""
  },
  {
    "id": 6328,
    "hadith_number": 6328,
    "tajuk_hadith": "Syurga Firdaus dan Keindahannya",
    "perawi_melayu": "Riwayat Anas:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، أَنَّ أُمَّ حَارِثَةَ، أَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم وَقَدْ هَلَكَ حَارِثَةُ يَوْمَ بَدْرٍ، أَصَابَهُ غَرْبُ سَهْمٍ‏.‏ فَقَالَتْ يَا رَسُولَ اللَّهِ قَدْ عَلِمْتَ مَوْقِعَ حَارِثَةَ مِنْ قَلْبِي، فَإِنْ كَانَ فِي الْجَنَّةِ لَمْ أَبْكِ عَلَيْهِ، وَإِلاَّ سَوْفَ تَرَى مَا أَصْنَعُ‏.‏ فَقَالَ لَهَا ‏\n\"‏ هَبِلْتِ، أَجَنَّةٌ وَاحِدَةٌ هِيَ إِنَّهَا جِنَانٌ كَثِيرَةٌ، وَإِنَّهُ فِي الْفِرْدَوْسِ الأَعْلَى ‏\"‏‏.‏ (وَقَالَ ‏:‏غَدْوَةٌ فِي سَبِيلِ اللَّهِ أَوْ رَوْحَةٌ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا، وَلَقَابُ قَوْسِ أَحَدِكُمْ أَوْ مَوْضِعُ قَدَمٍ مِنَ الْجَنَّةِ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا، وَلَوْ أَنَّ امْرَأَةً مِنْ نِسَاءِ أَهْلِ الْجَنَّةِ اطَّلَعَتْ إِلَى الأَرْضِ، لأَضَاءَتْ مَا بَيْنَهُمَا، وَلَمَلأَتْ مَا بَيْنَهُمَا رِيحًا، وَلَنَصِيفُهَا ـ يَعْنِي الْخِمَارَ ـ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا‏)‏‏.‏",
    "malay_translation": "Umm Harithah datang kepada Rasulullah SAW setelah Harithah syahid pada Perang Badar terkena panah yang tidak diketahui pelakunya.  Beliau berkata, \"Wahai Rasulullah SAW, tuan mengetahui kedudukan Harithah di hatiku (betapa sayangnya aku kepadanya). Jika dia di syurga, aku tidak akan meratapi kematiannya. Jika tidak, tuan akan melihat apa yang akan kulakukan.\"  Rasulullah SAW bersabda, \"Engkau keliru. Adakah hanya satu syurga sahaja?  Sesungguhnya syurga itu banyak, dan dia berada di Firdaus yang paling tinggi.\" Rasulullah SAW menambah, \"Perjalanan pagi atau petang di jalan Allah lebih baik daripada seluruh dunia dan apa yang ada di dalamnya. Dan tempat seluas tapak anak panah seseorang di antara kamu, atau tempat seluas tapak kaki di syurga lebih baik daripada seluruh dunia dan apa yang ada di dalamnya. Sekiranya seorang wanita daripada wanita penghuni syurga memandang ke bumi, nescaya akan menerangi ruang di antara keduanya (bumi dan langit), dan memenuhi ruang di antara keduanya dengan wangian, dan hijabnya (tudungnya) lebih baik daripada seluruh dunia dan apa yang ada di dalamnya.\""
  },
  {
    "id": 6329,
    "hadith_number": 6329,
    "tajuk_hadith": "Kedudukan di Syurga dan Neraka",
    "perawi_melayu": "Riwayat Abu Hurairah",
    "english_text": "The Prophet (ﷺ) said, \"None will enter Paradise but will be shown the place he would have occupied in \nthe (Hell) Fire if he had rejected faith, so that he may be more thankful; and none will enter the (Hell) \nFire but will be shown the place he would have occupied in Paradise if he had faith, so that may be a \ncause of sorrow for him.\"",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ يَدْخُلُ أَحَدٌ الْجَنَّةَ إِلاَّ أُرِيَ مَقْعَدَهُ مِنَ النَّارِ، لَوْ أَسَاءَ، لِيَزْدَادَ شُكْرًا، وَلاَ يَدْخُلُ النَّارَ أَحَدٌ إِلاَّ أُرِيَ مَقْعَدَهُ مِنَ الْجَنَّةِ، لَوْ أَحْسَنَ، لِيَكُونَ عَلَيْهِ حَسْرَةً ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Tiada seorang pun akan masuk syurga melainkan akan ditunjukkan tempat duduknya di neraka jika dia kufur, supaya dia bertambah bersyukur. Dan tiada seorang pun akan masuk neraka melainkan akan ditunjukkan tempat duduknya di syurga jika dia beriman, supaya menjadi sebab kesedihan baginya.\""
  },
  {
    "id": 6330,
    "hadith_number": 6330,
    "tajuk_hadith": "Orang yang Paling Beruntung Mendapat Syafaat Nabi SAW",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "I said, \"O Allah's Messenger (ﷺ)! Who will be the luckiest person who will gain your intercession on the Day of Resurrection?\" The Prophet (ﷺ) said, \"O Abu Huraira! I have thought that none will ask me about this Hadith before you, as I know your longing for the (learning of) Hadiths. The luckiest person who will have my intercession on the Day of Resurrection will be the one who said, 'None has the right to be worshipped but Allah,' sincerely from the bottom of his heart.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عَمْرٍو، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ مَنْ أَسْعَدُ النَّاسِ بِشَفَاعَتِكَ يَوْمَ الْقِيَامَةِ فَقَالَ ‏\n\"‏ لَقَدْ ظَنَنْتُ يَا أَبَا هُرَيْرَةَ أَنْ لاَ يَسْأَلَنِي عَنْ هَذَا الْحَدِيثِ أَحَدٌ أَوَّلُ مِنْكَ، لِمَا رَأَيْتُ مِنْ حِرْصِكَ عَلَى الْحَدِيثِ، أَسْعَدُ النَّاسِ بِشَفَاعَتِي يَوْمَ الْقِيَامَةِ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ خَالِصًا مِنْ قِبَلِ نَفْسِهِ ‏\"‏‏.‏",
    "malay_translation": "Aku berkata, \"Wahai Rasulullah ﷺ! Siapakah orang yang paling beruntung mendapat syafaat tuan pada Hari Kiamat?\"  Nabi ﷺ bersabda, \"Wahai Abu Hurairah! Aku sangka tiada seorang pun yang akan bertanya kepadaku tentang hadis ini sebelum engkau, kerana aku tahu betapa engkau mendambakan ilmu hadis. Orang yang paling beruntung mendapat syafaatku pada Hari Kiamat ialah orang yang berkata, 'Tiada Tuhan melainkan Allah,' dengan ikhlas dari lubuk hatinya.\""
  },
  {
    "id": 6331,
    "hadith_number": 6331,
    "tajuk_hadith": "Orang Terakhir Keluar dari Neraka dan Masuk Syurga",
    "perawi_melayu": "Riwayat Abdullah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَبِيدَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِنِّي لأَعْلَمُ آخِرَ أَهْلِ النَّارِ خُرُوجًا مِنْهَا، وَآخِرَ أَهْلِ الْجَنَّةِ دُخُولاً رَجُلٌ يَخْرُجُ مِنَ النَّارِ كَبْوًا، فَيَقُولُ اللَّهُ اذْهَبْ فَادْخُلِ الْجَنَّةَ‏.‏ فَيَأْتِيهَا فَيُخَيَّلُ إِلَيْهِ أَنَّهَا مَلأَى، فَيَرْجِعُ فَيَقُولُ يَا رَبِّ وَجَدْتُهَا مَلأَى، فَيَقُولُ اذْهَبْ فَادْخُلِ الْجَنَّةَ‏.‏ فَيَأْتِيهَا فَيُخَيَّلُ إِلَيْهِ أَنَّهَا مَلأَى‏.‏ فَيَقُولُ يَا رَبِّ وَجَدْتُهَا مَلأَى، فَيَقُولُ اذْهَبْ فَادْخُلِ الْجَنَّةَ، فَإِنَّ لَكَ مِثْلَ الدُّنْيَا وَعَشَرَةَ أَمْثَالِهَا‏.‏ أَوْ إِنَّ لَكَ مِثْلَ عَشَرَةِ أَمْثَالِ الدُّنْيَا‏.‏ فَيَقُولُ تَسْخَرُ مِنِّي، أَوْ تَضْحَكُ مِنِّي وَأَنْتَ الْمَلِكُ ‏\"‏‏.‏ فَلَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ، وَكَانَ يُقَالُ ذَلِكَ أَدْنَى أَهْلِ الْجَنَّةِ مَنْزِلَةً‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Sesungguhnya aku mengetahui orang yang terakhir keluar dari neraka dan orang yang terakhir masuk syurga.  Dia adalah seorang lelaki yang keluar dari neraka dengan merangkak, lalu Allah SWT berfirman kepadanya, 'Pergilah dan masuklah ke syurga.' Maka dia pun pergi ke syurga, tetapi dia menyangka bahawa syurga itu telah penuh, lalu dia kembali dan berkata, 'Ya Tuhan, aku mendapati ia telah penuh.' Allah SWT berfirman, 'Pergilah dan masuklah ke syurga. Sesungguhnya kamu akan mendapat seperti dunia dan sepuluh kali ganda darinya,' atau, 'Sesungguhnya kamu akan mendapat sepuluh kali ganda seperti dunia.' Maka dia berkata, 'Adakah Engkau mempermainkan aku, atau Engkau mentertawakan aku sedangkan Engkau adalah Raja?' Aku telah melihat Rasulullah SAW tersenyum sehingga kelihatan gigi gerahamnya. Dan dikatakan bahawa dia adalah penghuni syurga yang paling rendah darjatnya.\""
  },
  {
    "id": 6332,
    "hadith_number": 6332,
    "tajuk_hadith": "Adakah Baginda Nabi SAW Membantu Abu Talib?",
    "perawi_melayu": "Riwayat Abbas:",
    "english_text": "that he said to the Prophet (ﷺ) \"Did you benefit Abu Talib with anything?\"",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ، عَنِ الْعَبَّاسِ ـ رضى الله عنه ـ أَنَّهُ قَالَ لِلنَّبِيِّ صلى الله عليه وسلم هَلْ نَفَعْتَ أَبَا طَالِبٍ بِشَىْءٍ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Musaddad, telah menceritakan kepada kami Abu 'Awana, dari 'Abd al-Malik, dari Abdullah bin al-Harits bin Nawfal, dari Abbas r.a. bahawa dia berkata kepada Nabi SAW, \"Adakah engkau memberi manfaat kepada Abu Talib dengan sesuatu?\"."
  },
  {
    "id": 6333,
    "hadith_number": 6333,
    "tajuk_hadith": "Melihat Allah SWT pada Hari Kiamat dan Jembatan Sirat",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي سَعِيدٌ، وَعَطَاءُ بْنُ يَزِيدَ، أَنَّ أَبَا هُرَيْرَةَ، أَخْبَرَهُمَا عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَحَدَّثَنِي مَحْمُودٌ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ أُنَاسٌ يَا رَسُولَ اللَّهِ هَلْ نَرَى رَبَّنَا يَوْمَ الْقِيَامَةِ فَقَالَ ‏\"‏ هَلْ تُضَارُّونَ فِي الشَّمْسِ، لَيْسَ دُونَهَا سَحَابٌ ‏\"‏‏.‏ قَالُوا لاَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ هَلْ تُضَارُّونَ فِي الْقَمَرِ لَيْلَةَ الْبَدْرِ، لَيْسَ دُونَهُ سَحَابٌ ‏\"‏‏.‏ قَالُوا لاَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ فَإِنَّكُمْ تَرَوْنَهُ يَوْمَ الْقِيَامَةِ كَذَلِكَ، يَجْمَعُ اللَّهُ النَّاسَ فَيَقُولُ مَنْ كَانَ يَعْبُدُ شَيْئًا فَلْيَتَّبِعْهُ، فَيَتْبَعُ مَنْ كَانَ يَعْبُدُ الشَّمْسَ، وَيَتْبَعُ مَنْ كَانَ يَعْبُدُ الْقَمَرَ، وَيَتْبَعُ مَنْ كَانَ يَعْبُدُ الطَّوَاغِيتَ، وَتَبْقَى هَذِهِ الأُمَّةُ فِيهَا مُنَافِقُوهَا، فَيَأْتِيهِمُ اللَّهُ فِي غَيْرِ الصُّورَةِ الَّتِي يَعْرِفُونَ فَيَقُولُ أَنَا رَبُّكُمْ‏.‏ فَيَقُولُونَ نَعُوذُ بِاللَّهِ مِنْكَ، هَذَا مَكَانُنَا حَتَّى يَأْتِيَنَا رَبُّنَا، فَإِذَا أَتَانَا رَبُّنَا عَرَفْنَاهُ فَيَأْتِيهِمُ اللَّهُ فِي الصُّورَةِ الَّتِي يَعْرِفُونَ فَيَقُولُ أَنَا رَبُّكُمْ‏.‏ فَيَقُولُونَ أَنْتَ رَبُّنَا، فَيَتْبَعُونَهُ وَيُضْرَبُ جِسْرُ جَهَنَّمَ ‏\"‏‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَأَكُونُ أَوَّلَ مَنْ يُجِيزُ، وَدُعَاءُ الرُّسُلِ يَوْمَئِذٍ اللَّهُمَّ سَلِّمْ سَلِّمْ، وَبِهِ كَلاَلِيبُ مِثْلُ شَوْكِ السَّعْدَانِ، أَمَا رَأَيْتُمْ شَوْكَ السَّعْدَانِ ‏\"‏‏.‏ قَالُوا بَلَى يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ فَإِنَّهَا مِثْلُ شَوْكِ السَّعْدَانِ، غَيْرَ أَنَّهَا لاَ يَعْلَمُ قَدْرَ عِظَمِهَا إِلاَّ اللَّهُ، فَتَخْطَفُ النَّاسَ بِأَعْمَالِهِمْ، مِنْهُمُ الْمُوبَقُ، بِعَمَلِهِ وَمِنْهُمُ الْمُخَرْدَلُ، ثُمَّ يَنْجُو، حَتَّى إِذَا فَرَغَ اللَّهُ مِنَ الْقَضَاءِ بَيْنَ عِبَادِهِ، وَأَرَادَ أَنْ يُخْرِجَ مِنَ النَّارِ مَنْ أَرَادَ أَنْ يُخْرِجَ، مِمَّنْ كَانَ يَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ، أَمَرَ الْمَلاَئِكَةَ أَنْ يُخْرِجُوهُمْ، فَيَعْرِفُونَهُمْ بِعَلاَمَةِ آثَارِ السُّجُودِ، وَحَرَّمَ اللَّهُ عَلَى النَّارِ أَنْ تَأْكُلَ مِنِ ابْنِ آدَمَ أَثَرَ السُّجُودِ، فَيُخْرِجُونَهُمْ قَدِ امْتُحِشُوا، فَيُصَبُّ عَلَيْهِمْ مَاءٌ يُقَالُ لَهُ مَاءُ الْحَيَاةِ، فَيَنْبُتُونَ نَبَاتَ الْحِبَّةِ فِي حَمِيلِ السَّيْلِ، وَيَبْقَى رَجُلٌ مُقْبِلٌ بِوَجْهِهِ عَلَى النَّارِ فَيَقُولُ يَا رَبِّ قَدْ قَشَبَنِي رِيحُهَا وَأَحْرَقَنِي ذَكَاؤُهَا، فَاصْرِفْ وَجْهِي عَنِ النَّارِ فَلاَ يَزَالُ يَدْعُو اللَّهَ‏.‏ فَيَقُولُ لَعَلَّكَ إِنْ أَعْطَيْتُكَ أَنْ تَسْأَلَنِي غَيْرَهُ‏.‏ فَيَقُولُ لاَ وَعِزَّتِكَ لاَ أَسْأَلُكَ غَيْرَهُ‏.‏ فَيَصْرِفُ وَجْهَهُ عَنِ النَّارِ، ثُمَّ يَقُولُ بَعْدَ ذَلِكَ يَا رَبِّ قَرِّبْنِي إِلَى باب الْجَنَّةِ‏.‏ فَيَقُولُ أَلَيْسَ قَدْ زَعَمْتَ أَنْ لاَ تَسْأَلْنِي غَيْرَهُ، وَيْلَكَ ابْنَ آدَمَ مَا أَغْدَرَكَ‏.‏ فَلاَ يَزَالُ يَدْعُو‏.‏ فَيَقُولُ لَعَلِّي إِنْ أَعْطَيْتُكَ ذَلِكَ تَسْأَلَنِي غَيْرَهُ‏.‏ فَيَقُولُ لاَ وَعِزَّتِكَ لاَ أَسْأَلُكَ غَيْرَهُ‏.‏ فَيُعْطِي اللَّهَ مِنْ عُهُودٍ وَمَوَاثِيقَ أَنْ لاَ يَسْأَلَهُ غَيْرَهُ، فَيُقَرِّبُهُ إِلَى باب الْجَنَّةِ، فَإِذَا رَأَى مَا فِيهَا سَكَتَ مَا شَاءَ اللَّهُ أَنْ يَسْكُتَ، ثُمَّ يَقُولُ رَبِّ أَدْخِلْنِي الْجَنَّةَ‏.‏ ثُمَّ يَقُولُ أَوَلَيْسَ قَدْ زَعَمْتَ أَنْ لاَ تَسْأَلَنِي غَيْرَهُ، وَيْلَكَ يَا ابْنَ آدَمَ مَا أَغْدَرَكَ فَيَقُولُ يَا رَبِّ لاَ تَجْعَلْنِي أَشْقَى خَلْقِكَ‏.‏ فَلاَ يَزَالُ يَدْعُو حَتَّى يَضْحَكَ، فَإِذَا ضَحِكَ مِنْهُ أَذِنَ لَهُ بِالدُّخُولِ فِيهَا، فَإِذَا دَخَلَ فِيهَا قِيلَ تَمَنَّ مِنْ كَذَا‏.‏ فَيَتَمَنَّى، ثُمَّ يُقَالُ لَهُ تَمَنَّ مِنْ كَذَا‏.‏ فَيَتَمَنَّى حَتَّى تَنْقَطِعَ بِهِ الأَمَانِيُّ فَيَقُولُ لَهُ هَذَا لَكَ وَمِثْلُهُ مَعَهُ ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ وَذَلِكَ الرَّجُلُ آخِرُ أَهْلِ الْجَنَّةِ دُخُولاً‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Yaman, telah menceritakan kepada kami Syu’aib, dari Az Zuhri, telah menceritakan kepadaku Sa’id dan ‘Atha’ bin Yazid bahawa Abu Hurairah telah menceritakan kepada mereka berdua daripada Nabi SAW. Dan telah menceritakan kepadaku Mahmud, telah menceritakan kepada kami Abdur Razzaq, telah menceritakan kepada kami Ma’mar, dari Az Zuhri, dari ‘Atha’ bin Yazid Al Laitsy, dari Abu Hurairah, katanya: Sesetengah orang berkata, “Wahai Rasulullah, adakah kami akan melihat Tuhan kami pada hari kiamat?” Baginda bersabda: “Adakah kamu saling berhimpit-himpit dan berdesak-desakan untuk melihat matahari ketika matahari tidak tertutup oleh awan?” Mereka menjawab, “Tidak, wahai Rasulullah.” Baginda bersabda, “Adakah kamu saling berhimpit-himpit dan berdesak-desakan untuk melihat bulan pada malam purnama, ketika bulan tidak tertutup oleh awan?” Mereka menjawab, “Tidak, wahai Rasulullah.” Baginda bersabda, “Maka sesungguhnya kamu akan melihatNya (Tuhan kamu) pada hari kiamat seperti itu juga. Allah SWT akan mengumpulkan manusia kemudian berfirman, ‘Barangsiapa yang menyembah sesuatu, maka hendaklah ia mengikutinya.’ Maka orang yang menyembah matahari akan mengikutinya, dan orang yang menyembah bulan akan mengikutinya, dan orang yang menyembah berhala-berhala akan mengikutinya; dan akan tinggallah umat ini (iaitu, umat Islam) termasuk orang-orang munafiknya.  Kemudian Allah SWT akan datang kepada mereka dalam rupa yang tidak mereka kenali, lalu Allah SWT berfirman, ‘Aku adalah Tuhan kamu.’ Mereka akan berkata, ‘Kami berlindung kepada Allah SWT daripada engkau. Inilah tempat kami sehingga Tuhan kami datang kepada kami, maka apabila Tuhan kami datang kepada kami nescaya kami akan mengenalinya.’ Kemudian Allah SWT akan datang kepada mereka dalam rupa yang mereka kenali, lalu berfirman, ‘Aku adalah Tuhan kamu.’ Mereka akan berkata, ‘Engkaulah Tuhan kami,’ lalu mereka akan mengikutinya. Dan akan dibentangkan jambatan neraka.” Rasulullah SAW menambah, “Akulah orang yang pertama kali akan melaluinya. Dan doa para rasul pada hari itu ialah, ‘Allahumma sallim, sallim (Ya Allah selamatkanlah kami, selamatkanlah kami!),’ dan di atas jambatan itu terdapat cangkuk-cangkuk seperti duri pokok As Sa’dan. Adakah kamu pernah melihat duri pokok As Sa’dan?” Para sahabat menjawab, “Ya, wahai Rasulullah.” Baginda menambah, “Maka cangkuk-cangkuk di atas jambatan itu adalah seperti duri pokok As Sa’dan, cuma hanya Allah SWT sahaja yang mengetahui betapa besarnya. Cangkuk-cangkuk itu akan merampas manusia berdasarkan amalan mereka. Ada di antara mereka yang akan binasa disebabkan oleh kejahatan amalannya, dan ada di antara mereka yang akan dipotong-potong dan jatuh ke dalam neraka, tetapi akan diselamatkan kemudiannya, apabila Allah SWT telah selesai membuat perhitungan di antara hamba-hambaNya, dan berkehendak mengeluarkan daripada neraka sesiapa yang dikehendakiNya daripada orang-orang yang telah bersaksi bahawa tiada Tuhan melainkan Allah SWT. Kami akan memerintahkan para malaikat untuk mengeluarkan mereka, dan para malaikat akan mengenali mereka dengan tanda kesan sujud (di dahi mereka), kerana Allah SWT mengharamkan api neraka daripada memakan kesan sujud daripada anak Adam. Maka mereka akan dikeluarkan, sedang mereka telah hangus (seperti arang), kemudian akan disiramkan kepada mereka air yang dinamakan Air Kehidupan, lalu mereka akan tumbuh seperti biji benih tumbuh di tepi aliran air hujan, dan akan tinggal seorang lelaki yang mukanya menghadap neraka lalu berkata, ‘Ya Tuhanku, baunya telah mencekikku dan apinya telah membakar ku, maka palingkanlah wajahku daripada neraka.’ Dia terus berdoa kepada Allah SWT. Maka Allah SWT berfirman, ‘Mungkin jika Aku berikan kepadamu apa yang engkau minta, engkau akan meminta yang lain pula?’ Lelaki itu berkata, ‘Tidak, demi keagunganMu, aku tidak akan meminta yang lain.’ Maka Allah SWT akan memalingkan wajahnya daripada neraka. Kemudian selepas itu dia berkata, ‘Ya Tuhanku, dekatkanlah aku ke pintu syurga.’ Allah SWT berfirman, ‘Bukankah engkau telah berjanji bahawa engkau tidak akan meminta yang lain? Celaka engkau wahai anak Adam, betapa khianatnya engkau!’ Dia terus berdoa. Maka Allah SWT berfirman, ‘Mungkin jika Aku berikan kepadamu itu, engkau akan meminta yang lain?’ Lelaki itu berkata, ‘Tidak demi keagunganMu, aku tidak akan meminta yang lain.’ Dia berjanji kepada Allah SWT dan memberi ikrar bahawa dia tidak akan meminta yang lain selepas itu. Maka Allah SWT akan mendekatkannya ke pintu syurga, maka apabila dia melihat apa yang ada di dalamnya, dia akan terdiam selama mana Allah SWT mahu dia terdiam, kemudian dia berkata, ‘Ya Tuhanku, masukkanlah aku ke dalam syurga.’ Allah SWT berfirman, ‘Bukankah engkau telah berjanji bahawa engkau tidak akan meminta kepadaKu selain daripada itu? Celaka engkau wahai anak Adam, betapa khianatnya engkau!’ Atas perkara itu, lelaki itu berkata, ‘Ya Tuhanku, janganlah Engkau jadikan aku sebagai makhluk Engkau yang paling sengsara,’ dan dia terus berdoa kepada Allah SWT sehingga Allah SWT tersenyum, maka apabila Allah SWT tersenyum kerana dia, maka Allah SWT akan mengizinkan dia untuk masuk ke dalam syurga, dan apabila dia masuk ke dalam syurga, dia akan disuruh, ‘Minta daripada …. (sesuatu).’ Dia akan meminta, kemudian dia akan disuruh, ‘Minta daripada …. (sesuatu).’ Dia akan meminta sehingga permintaannya putus, maka Allah SWT berfirman kepadanya, ‘Ini untukmu dan sebanyak ini juga.’ Kata Abu Hurairah, dan lelaki itulah orang yang terakhir daripada penduduk syurga masuk ke dalamnya."
  },
  {
    "id": 6334,
    "hadith_number": 6334,
    "tajuk_hadith": "Perbezaan Riwayat Mengenai Ganjaran Pahala",
    "perawi_melayu": "Riwayat 'Ata' (ketika Abu Hurairah meriwayatkan (lihat hadis sebelumnya)):",
    "english_text": "",
    "arabic_text": "قَالَ عَطَاءٌ وَأَبُو سَعِيدٍ الْخُدْرِيُّ جَالِسٌ مَعَ أَبِي هُرَيْرَةَ، لاَ يُغَيِّرُ عَلَيْهِ شَيْئًا مِنْ حَدِيثِهِ حَتَّى انْتَهَى إِلَى قَوْلِهِ ‏\"‏ هَذَا لَكَ وَمِثْلُهُ مَعَهُ ‏\"‏‏.‏ قَالَ أَبُو سَعِيدٍ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ هَذَا لَكَ وَعَشَرَةُ أَمْثَالِهِ ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ حَفِظْتُ ‏\"‏ مِثْلُهُ مَعَهُ ‏\"‏‏.‏",
    "malay_translation": "'Ata' berkata, dan Abu Said al-Khudri sedang duduk bersama Abu Hurairah.  Abu Said tidak mengubah apa-apa daripada riwayat Abu Hurairah sehingga sampai kepada ucapan Abu Hurairah, \"Ini untukmu dan yang serupa dengannya.\"  Abu Said berkata, \"Aku mendengar Rasulullah ﷺ bersabda, \"Ini untukmu dan sepuluh kali ganda daripadanya.\" Abu Hurairah berkata, \"Yang aku hafal ialah,  \"dan yang serupa dengannya.\""
  },
  {
    "id": 6335,
    "hadith_number": 6335,
    "tajuk_hadith": "Nabi SAW sebagai Pemimpin di Telaga Hawd",
    "perawi_melayu": "Daripada Abdullah:",
    "english_text": "The Prophet (ﷺ) said, \"I am your predecessor at the Lake-Fount.\"",
    "arabic_text": "حَدَّثَنِي يَحْيَى بْنُ حَمَّادٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سُلَيْمَانَ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\n\"‏ أَنَا فَرَطُكُمْ، عَلَى الْحَوْضِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Aku adalah pemimpin kamu di Telaga Hawd.\""
  },
  {
    "id": 6336,
    "hadith_number": 6336,
    "tajuk_hadith": "Nabi SAW sebagai Pemimpin di Telaga Hawd",
    "perawi_melayu": "Abdullah menambah:",
    "english_text": "The Prophet (ﷺ) said, \"I \nam your predecessor at the Lake-Fount, and some of you will be brought in front of me till I will see \nthem and then they will be taken away from me and I will say, 'O Lord, my companions!' It will be \nsaid, 'You do not know what they did after you had left.'",
    "arabic_text": "وَحَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الْمُغِيرَةِ، قَالَ سَمِعْتُ أَبَا وَائِلٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏أَنَا فَرَطُكُمْ، عَلَى الْحَوْضِ، وَلَيُرْفَعَنَّ رِجَالٌ مِنْكُمْ ثُمَّ لَيُخْتَلَجُنَّ دُونِي فَأَقُولُ يَا رَبِّ أَصْحَابِي‏.‏ فَيُقَالُ إِنَّكَ لاَ تَدْرِي مَا أَحْدَثُوا بَعْدَكَ‏\"‏.‏ تَابَعَهُ عَاصِمٌ عَنْ أَبِي وَائِلٍ‏.‏ وَقَالَ حُصَيْنٌ عَنْ أَبِي وَائِلٍ عَنْ حُذَيْفَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Aku adalah pemimpin kamu di Telaga Hawd, dan sesungguhnya sebahagian daripada kamu akan di bawa ke hadapanKu sehingga Aku melihat mereka, kemudian mereka akan dijauhkan daripadaKu, lalu Aku akan berkata, 'Ya Allah, sahabat-sahabatku!' Maka dikatakan, 'Sesungguhnya Engkau tidak mengetahui apa yang mereka telah lakukan setelah kepergianmu.'"
  },
  {
    "id": 6337,
    "hadith_number": 6337,
    "tajuk_hadith": "Kolam di Hari Kiamat",
    "perawi_melayu": "Riwayat Ibnu Umar:",
    "english_text": "The Prophet (ﷺ) said, \"There will be a tank (Lake-Fount) in front of you as large as the distance between \nJarba and Adhruh (two towns in Sham).",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَمَامَكُمْ حَوْضٌ كَمَا بَيْنَ جَرْبَاءَ وَأَذْرُحَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Di hadapan kamu ada sebuah kolam yang sebesar jarak antara Jarba dan Adhruh (dua buah bandar di Syam).\""
  },
  {
    "id": 6338,
    "hadith_number": 6338,
    "tajuk_hadith": "Maksud Al-Kauthar: Kebaikan yang Melimpah Ruah",
    "perawi_melayu": "Daripada Ibnu Abbas",
    "english_text": "The word 'Al-Kauthar' means the abundant good which Allah gave to him (the Prophet (ﷺ) Muhammad). \nAbu Bishr said: I said to Sa`id, \"Some people claim that it (Al-Kauthar) is a river in Paradise.\" Sa`id \nreplied, \"The river which is in Paradise is one item of that good which Allah has bestowed upon him \n(Muhammad).",
    "arabic_text": "حَدَّثَنِي عَمْرُو بْنُ مُحَمَّدٍ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا أَبُو بِشْرٍ، وَعَطَاءُ بْنُ السَّائِبِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنه ـ قَالَ الْكَوْثَرُ الْخَيْرُ الْكَثِيرُ الَّذِي أَعْطَاهُ اللَّهُ إِيَّاهُ‏.‏ قَالَ أَبُو بِشْرٍ قُلْتُ لِسَعِيدٍ إِنَّ أُنَاسًا يَزْعُمُونَ أَنَّهُ نَهَرٌ فِي الْجَنَّةِ‏.‏ فَقَالَ سَعِيدٌ النَّهَرُ الَّذِي فِي الْجَنَّةِ مِنَ الْخَيْرِ الَّذِي أَعْطَاهُ اللَّهُ إِيَّاهُ‏.‏",
    "malay_translation": "Kata Al-Kauthar bermaksud kebaikan yang melimpah ruah yang Allah SWT berikan kepada Nabi Muhammad ﷺ.  Abu Bishr berkata: Aku berkata kepada Said, \"Sesetengah orang mendakwa bahawa ia (Al-Kauthar) adalah sungai di syurga.\" Said menjawab, \"Sungai yang berada di syurga adalah sebahagian daripada kebaikan yang Allah SWT telah kurniakan kepadanya (Muhammad).\""
  },
  {
    "id": 6339,
    "hadith_number": 6339,
    "tajuk_hadith": "Hauz Nabi SAW: Telaga yang Mengalirkan Kesegaran Abadi",
    "perawi_melayu": "Riwayat Abdullah bin Amr:",
    "english_text": "The Prophet (ﷺ) said, \"My Lake-Fount is (so large that it takes) a month's journey to cross it. Its water is \nwhiter than milk, and its smell is nicer than musk (a kind of Perfume), and its drinking cups are (as \nnumerous) as the (number of) stars of the sky; and whoever drinks from it, will never be thirsty.\"",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا نَافِعُ بْنُ عُمَرَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، قَالَ قَالَ عَبْدُ اللَّهِ بْنُ عَمْرٍو قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ حَوْضِي مَسِيرَةُ شَهْرٍ، مَاؤُهُ أَبْيَضُ مِنَ اللَّبَنِ، وَرِيحُهُ أَطْيَبُ مِنَ الْمِسْكِ، وَكِيزَانُهُ كَنُجُومِ السَّمَاءِ، مَنْ شَرِبَ مِنْهَا فَلاَ يَظْمَأُ أَبَدًا ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Hauzku (telaga bagiku) seluas perjalanan sebulan. Airnya lebih putih daripada susu, baunya lebih harum daripada kasturi, dan cawan-cawannya seperti bintang-bintang di langit. Sesiapa yang meminumnya, dia tidak akan dahaga selama-lamanya.\""
  },
  {
    "id": 6340,
    "hadith_number": 6340,
    "tajuk_hadith": "Keluasan Telaga Rasulullah SAW",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "Allah's Messenger (ﷺ) said, \"The width of my Lake-Fount is equal to the distance between Aila (a town in \nSham) and Sana' (the capital of Yemen) and it has as many (numerous) jugs as the number of stars of \nthe sky.\"",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، عَنْ يُونُسَ، قَالَ ابْنُ شِهَابٍ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏(‏إِنَّ قَدْرَ حَوْضِي كَمَا بَيْنَ أَيْلَةَ وَصَنْعَاءَ مِنَ الْيَمَنِ، وَإِنَّ فِيهِ مِنَ الأَبَارِيقِ كَعَدَدِ نُجُومِ السَّمَاءِ‏)‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Sesungguhnya, keluasan telaga aku (di akhirat) sama seperti jarak antara Aila (sebuah bandar di Syam) dan Sana’a (ibu negeri Yaman). Dan di dalamnya terdapat cawan-cawan sebanyak bilangan bintang-bintang di langit.\""
  },
  {
    "id": 6341,
    "hadith_number": 6341,
    "tajuk_hadith": "Sungai Kauthar di Syurga",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَحَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ بَيْنَمَا أَنَا أَسِيرُ فِي الْجَنَّةِ إِذَا أَنَا بِنَهَرٍ حَافَتَاهُ قِبَابُ الدُّرِّ الْمُجَوَّفِ قُلْتُ مَا هَذَا يَا جِبْرِيلُ قَالَ هَذَا الْكَوْثَرُ الَّذِي أَعْطَاكَ رَبُّكَ‏.‏ فَإِذَا طِينُهُ ـ أَوْ طِيبُهُ ـ مِسْكٌ أَذْفَرُ ‏\"‏‏.‏ شَكَّ هُدْبَةُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Al-Walid, telah menceritakan kepada kami Hammam, dari Qatadah, dari Anas, dari Nabi SAW. Dan telah menceritakan kepada kami Hudabah bin Khalid, telah menceritakan kepada kami Hammam, telah menceritakan kepada kami Qatadah, telah menceritakan kepada kami Anas bin Malik, dari Nabi SAW, baginda bersabda:  \"Ketika aku berjalan di syurga, tiba-tiba aku melihat sebuah sungai, di kedua tepiannya terdapat khemah-khemah yang diperbuat daripada mutiara berongga. Aku bertanya, \"Apakah ini wahai Jibril?\"  Jibril menjawab, \"Ini adalah Sungai Kauthar yang telah diberikan oleh Tuhanmu kepadamu.\"  Maka, bau tanahnya – atau harumannya – adalah kasturi yang harum mewangi.\"  Hudabah ragu-ragu tentang ungkapan yang tepat."
  },
  {
    "id": 6342,
    "hadith_number": 6342,
    "tajuk_hadith": "Sahabat yang Tersesat di Hari Kiamat",
    "perawi_melayu": "Anas meriwayatkan:",
    "english_text": "The Prophet (ﷺ) said, \"Some of my companions will come to me at my Lake Fount, and after I recognize them, they will then be taken away from me, whereupon I will say, 'My companions!' Then it will be said, 'You do not know what they innovated (new things) in the religion after you.\"",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَيَرِدَنَّ عَلَىَّ نَاسٌ مِنْ أَصْحَابِي الْحَوْضَ، حَتَّى عَرَفْتُهُمُ اخْتُلِجُوا دُونِي، فَأَقُولُ أَصْحَابِي‏.‏ فَيَقُولُ لاَ تَدْرِي مَا أَحْدَثُوا بَعْدَكَ ‏\"‏‏.‏",
    "malay_translation": "Nabi SAW bersabda: \"Sesungguhnya akan datang kepadaKu di telagaKu segolongan daripada sahabat-sahabatKu, sehingga Aku mengenali mereka, kemudian mereka ditolak daripadaKu. Maka Aku akan berkata: Sahabat-sahabatKu!  Lalu dikatakan: Engkau tidak mengetahui apa yang mereka telah mengadakan (bid’ah) sesudah engkau.\""
  },
  {
    "id": 6343,
    "hadith_number": 6343,
    "tajuk_hadith": "Rasulullah SAW sebagai Pemimpin di Telaga Hawd",
    "perawi_melayu": "Dari Abu Hazim daripada Sahl bin Sa'd:",
    "english_text": "The Prophet (ﷺ) said, \"I am your predecessor (forerunner) at the Lake-Fount, and whoever will pass by \nthere, he will drink from it and whoever will drink from it, he will never be thirsty. There will come to \nme some people whom I will recognize, and they will recognize me, but a barrier will be placed \nbetween me and them.\"",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا مُحَمَّدُ بْنُ مُطَرِّفٍ، حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِنِّي فَرَطُكُمْ عَلَى الْحَوْضِ، مَنْ مَرَّ عَلَىَّ شَرِبَ، وَمَنْ شَرِبَ لَمْ يَظْمَأْ أَبَدًا، لَيَرِدَنَّ عَلَىَّ أَقْوَامٌ أَعْرِفُهُمْ وَيَعْرِفُونِي، ثُمَّ يُحَالُ بَيْنِي وَبَيْنَهُمْ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Aku adalah pemimpin kamu di Telaga Hawd. Sesiapa yang melalui aku, dia akan minum darinya, dan sesiapa yang minum darinya, dia tidak akan dahaga selama-lamanya. Akan datang kepadaku beberapa orang yang aku kenali dan mereka mengenali aku, tetapi kemudian penghalang akan diletakkan di antara aku dan mereka.\""
  },
  {
    "id": 6344,
    "hadith_number": 6344,
    "tajuk_hadith": "Rasulullah SAW Mengenai Pengikut-pengikut yang Menyeleweng",
    "perawi_melayu": "Abu Hazim menambahkan:",
    "english_text": "",
    "arabic_text": "قَالَ أَبُو حَازِمٍ فَسَمِعَنِي النُّعْمَانُ بْنُ أَبِي عَيَّاشٍ، فَقَالَ هَكَذَا سَمِعْتَ مِنْ، سَهْلٍ فَقُلْتُ نَعَمْ‏.‏ فَقَالَ أَشْهَدُ عَلَى أَبِي سَعِيدٍ الْخُدْرِيِّ لَسَمِعْتُهُ وَهْوَ يَزِيدُ فِيهَا ‏\n\"‏ فَأَقُولُ إِنَّهُمْ مِنِّي‏.‏ فَيُقَالُ إِنَّكَ لاَ تَدْرِي مَا أَحْدَثُوا بَعْدَكَ‏.‏ فَأَقُولُ سُحْقًا سُحْقًا لِمَنْ غَيَّرَ بَعْدِي ‏\"‏‏.‏ وَقَالَ ابْنُ عَبَّاسٍ سُحْقًا بُعْدًا، يُقَالُ سَحِيقٌ بَعِيدٌ، وَأَسْحَقَهُ أَبْعَدَهُ‏.‏",
    "malay_translation": "Abu Hazim berkata, kemudian Nu'man bin Abi Aiyasy mendengar aku, lalu dia berkata, \"Begitulah yang engkau dengar daripada Sahl?\" Aku berkata, \"Ya.\" Lalu dia berkata, \"Aku menjadi saksi bahawa aku mendengar Abu Said Al-Khudri berkata demikian, dan dia menambah di dalamnya, \"Maka aku akan berkata: Mereka adalah daripada golonganku.  Kemudian akan dikatakan: Sesungguhnya engkau tidak mengetahui apa yang mereka telah mengadakan (perkara-perkara baru) selepas kewafatanmu. Maka aku akan berkata: Celaka, celaka bagi mereka yang telah mengubah (agama) selepas aku.\"  Dan Ibnu Abbas berkata: \"Celaka, jauhkanlah (dari rahmat), dikatakan sahiq ba'id, dan ashaqahu ab'adahu."
  },
  {
    "id": 6345,
    "hadith_number": 6345,
    "tajuk_hadith": "Golongan Sahabat yang Tersisih di Hari Kiamat",
    "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:",
    "english_text": "\"On the Day of Resurrection a group of companions will come to me, \nbut will be driven away from the Lake-Fount, and I will say, 'O Lord (those are) my companions!' It \nwill be said, 'You have no knowledge as to what they innovated after you left; they turned apostate as \nrenegades (reverted from Islam).\"",
    "arabic_text": "وَقَالَ أَحْمَدُ بْنُ شَبِيبِ بْنِ سَعِيدٍ الْحَبَطِيُّ حَدَّثَنَا أَبِي، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ كَانَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَرِدُ عَلَىَّ يَوْمَ الْقِيَامَةِ رَهْطٌ مِنْ أَصْحَابِي فَيُحَلَّئُونَ عَنِ الْحَوْضِ فَأَقُولُ يَا رَبِّ أَصْحَابِي‏.‏ فَيَقُولُ إِنَّكَ لاَ عِلْمَ لَكَ بِمَا أَحْدَثُوا بَعْدَكَ، إِنَّهُمُ ارْتَدُّوا عَلَى أَدْبَارِهِمُ الْقَهْقَرَى ‏\"‏‏.‏",
    "malay_translation": "Pada hari kiamat, akan datang kepada-Ku segolongan sahabat-sahabatKu, tetapi mereka akan ditolak daripada telaga (al-Hauḍ). Maka Aku akan berkata, ‘Ya Allah, mereka ini sahabat-sahabatKu!’ Allah akan berfirman, ‘Sesungguhnya Engkau tidak mengetahui apa yang mereka telah lakukan setelah kepergianmu.  Sesungguhnya mereka telah murtad dan kembali ke belakang (dari Islam).’"
  },
  {
    "id": 6346,
    "hadith_number": 6346,
    "tajuk_hadith": "Sahabat yang Murtad",
    "perawi_melayu": "Riwayat Ibnu Musaiyab:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيَّبِ، أَنَّهُ كَانَ يُحَدِّثُ عَنْ أَصْحَابِ النَّبِيِّ، صلى الله عليه وسلم أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَرِدُ عَلَى الْحَوْضِ رِجَالٌ مِنْ أَصْحَابِي فَيُحَلَّئُونَ عَنْهُ فَأَقُولُ يَا رَبِّ أَصْحَابِي‏.‏ فَيَقُولُ إِنَّكَ لاَ عِلْمَ لَكَ بِمَا أَحْدَثُوا بَعْدَكَ، إِنَّهُمُ ارْتَدُّوا عَلَى أَدْبَارِهِمُ الْقَهْقَرَى ‏\"‏‏.‏ وَقَالَ شُعَيْبٌ عَنِ الزُّهْرِيِّ كَانَ أَبُو هُرَيْرَةَ يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم فَيُجْلَوْنَ‏.‏ وَقَالَ عُقَيْلٌ فَيُحَلَّئُونَ‏.‏ وَقَالَ الزُّبَيْدِيُّ عَنِ الزُّهْرِيِّ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Saleh, telah menceritakan kepada kami Ibnu Wahb, katanya; telah memberitakan kepadaku Yunus, dari Ibnu Syihab, dari Ibnu Musaiyab, bahawa baginda biasa menceritakan dari sahabat-sahabat Nabi SAW bahawa Nabi SAW bersabda:  \"Akan datang kepada telaga (Hawd) itu segolongan dari kalangan sahabatku, lalu mereka akan ditolak darinya. Maka aku akan berkata: Ya Tuhanku, sahabat-sahabatku!  Maka Allah SWT akan berfirman: Sesungguhnya engkau tidak mengetahui apa yang mereka telah lakukan setelah engkau, sesungguhnya mereka telah kembali ke belakang (murtad).\"  Dan Shu’aib berkata dari Az- Zuhri, bahawa Abu Hurairah menceritakan dari Nabi SAW, lalu mereka dihalau. Dan Uqaail berkata, lalu mereka ditolak. Dan Az-Zubaidi berkata dari Az-Zuhri dari Muhammad bin Ali dari Ubaidillah bin Abi Rafi’ dari Abu Hurairah dari Nabi SAW."
  },
  {
    "id": 6347,
    "hadith_number": 6347,
    "tajuk_hadith": "Kumpulan yang Murtad Selepas Kemangkatan Nabi SAW",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا مُحَمَّدُ بْنُ فُلَيْحٍ، حَدَّثَنَا أَبِي قَالَ، حَدَّثَنِي هِلاَلٌ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ بَيْنَا أَنَا قَائِمٌ إِذَا زُمْرَةٌ، حَتَّى إِذَا عَرَفْتُهُمْ خَرَجَ رَجُلٌ مِنْ بَيْنِي وَبَيْنِهِمْ فَقَالَ هَلُمَّ‏.‏ فَقُلْتُ أَيْنَ قَالَ إِلَى النَّارِ وَاللَّهِ‏.‏ قُلْتُ وَمَا شَأْنُهُمْ قَالَ إِنَّهُمُ ارْتَدُّوا بَعْدَكَ عَلَى أَدْبَارِهِمُ الْقَهْقَرَى‏.‏ ثُمَّ إِذَا زُمْرَةٌ حَتَّى إِذَا عَرَفْتُهُمْ خَرَجَ رَجُلٌ مِنْ بَيْنِي وَبَيْنِهِمْ فَقَالَ هَلُمَّ‏.‏ قُلْتُ أَيْنَ قَالَ إِلَى النَّارِ وَاللَّهِ‏.‏ قُلْتُ مَا شَأْنُهُمْ قَالَ إِنَّهُمُ ارْتَدُّوا بَعْدَكَ عَلَى أَدْبَارِهِمُ الْقَهْقَرَى‏.‏ فَلاَ أُرَاهُ يَخْلُصُ مِنْهُمْ إِلاَّ مِثْلُ هَمَلِ النَّعَمِ ‏\"‏‏.‏",
    "malay_translation": "Aku bermimpi, sekumpulan umatku dihadapkan kepadaku. Setelah aku mengenali mereka, seorang lelaki (malaikat) keluar dari antara aku dan mereka lalu berkata, \"Mari.\" Aku bertanya, \"Ke mana?\" Jawabnya, \"Ke neraka, demi Allah.\" Aku bertanya lagi, \"Apakah kesalahan mereka?\" Jawabnya, \"Mereka murtad selepas kewafatanmu.\" Kemudian, sekumpulan umatku yang lain dihadapkan kepadaku. Setelah aku mengenali mereka, seorang lelaki (malaikat) keluar dari antara aku dan mereka lalu berkata, \"Mari.\" Aku bertanya, \"Ke mana?\" Jawabnya, \"Ke neraka, demi Allah.\" Aku bertanya lagi, \"Apakah kesalahan mereka?\" Jawabnya, \"Mereka murtad selepas kewafatanmu.\"  Maka, aku tidak nampak sesiapa pun daripada mereka yang terselamat melainkan segelintir sahaja seperti unta yang kehilangan gembala."
  },
  {
    "id": 6348,
    "hadith_number": 6348,
    "tajuk_hadith": "Syurga di antara Rumah dan Mimbar Nabi",
    "perawi_melayu": "Dari Abu Hurairah",
    "english_text": "Allah's Messenger (ﷺ) said, \"Between my house and my pulpit there is a garden from amongst the gardens of Paradise, and my pulpit is over my Lake-Fount.\"",
    "arabic_text": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ خُبَيْبٍ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا بَيْنَ بَيْتِي وَمِنْبَرِي رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ، وَمِنْبَرِي عَلَى حَوْضِي ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Antara rumahku dan mimbarku adalah sebuah taman daripada taman-taman syurga, dan mimbarku berada di atas telaga (Hauḍ)ku.\""
  },
  {
    "id": 6349,
    "hadith_number": 6349,
    "tajuk_hadith": "Nabi Muhammad SAW Pemimpin di Telaga Al-Kauthar",
    "perawi_melayu": "Daripada Jundab:",
    "english_text": "I heard the Prophet, saying, \"I am your predecessor at the Lake-Fount. (Al-Kauthar) .",
    "arabic_text": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنِي أَبِي، عَنْ شُعْبَةَ، عَنْ عَبْدِ الْمَلِكَ، قَالَ سَمِعْتُ جُنْدَبًا، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ أَنَا فَرَطُكُمْ، عَلَى الْحَوْضِ ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Nabi SAW bersabda: \"Aku adalah pemimpin kamu di Telaga Al-Kauthar.\""
  },
  {
    "id": 6350,
    "hadith_number": 6350,
    "tajuk_hadith": "Wasiah Nabi SAW tentang Perselisihan Duniawi",
    "perawi_melayu": "Riwayat Uqba bin Amir:",
    "english_text": "Once the Prophet (ﷺ) went out and offered the funeral prayers for the martyrs of Uhud, and then went to \nthe pulpit and said, \"I am a predecessor for you and I am a witness for you: and by Allah, I am looking \nat my Fount just now, and the keys of the treasures of the earth (or the keys of the earth) have been \ngiven to me: and by Allah, I am not afraid that you will worship others besides Allah after me, but I \nam afraid that you will strive and struggle against each other over these treasures of the world.\"",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ يَوْمًا فَصَلَّى عَلَى أَهْلِ أُحُدٍ صَلاَتَهُ عَلَى الْمَيِّتِ، ثُمَّ انْصَرَفَ عَلَى الْمِنْبَرِ فَقَالَ ‏\n\"‏ إِنِّي فَرَطٌ لَكُمْ، وَأَنَا شَهِيدٌ عَلَيْكُمْ، وَإِنِّي وَاللَّهِ لأَنْظُرُ إِلَى حَوْضِي الآنَ، وَإِنِّي أُعْطِيتُ مَفَاتِيحَ خَزَائِنِ الأَرْضِ ـ أَوْ مَفَاتِيحَ الأَرْضِ ـ وَإِنِّي وَاللَّهِ مَا أَخَافُ عَلَيْكُمْ أَنْ تُشْرِكُوا بَعْدِي، وَلَكِنْ أَخَافُ عَلَيْكُمْ أَنْ تَنَافَسُوا فِيهَا ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Amru bin Khalid, telah menceritakan kepada kami Laits, dari Yazid, dari Abu Al-Khair, dari Uqba -رضي الله عنه- bahawa Nabi SAW suatu hari keluar menunaikan solat jenazah ke atas penduduk Uhud, kemudian baginda naik mimbar lalu bersabda:  \"Sesungguhnya aku adalah pendahulu kamu, dan aku adalah saksi ke atas kamu. Demi Allah, sesungguhnya aku melihat telaga airku sekarang, dan aku telah diberikan kunci-kunci khazanah bumi -atau kunci-kunci bumi-.  Demi Allah, aku tidak takut kamu akan syirik selepas aku, tetapi aku takut kamu akan bertelagah sesama sendiri kerana harta benda dunia.\" "
  },
  {
    "id": 6351,
    "hadith_number": 6351,
    "tajuk_hadith": "Saiz Telaga Kautsar",
    "perawi_melayu": "Daripada Haritsah bin Wahb:",
    "english_text": "I heard the Prophet (ﷺ) mentioning the Lake-Fount (Al-Kauthar), saying, \"(The width of the Lake-Fount) \nis equal to the distance between Medina and Sana' (capital of Yemen).\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ مَعْبَدِ بْنِ خَالِدٍ، أَنَّهُ سَمِعَ حَارِثَةَ بْنَ وَهْبٍ، يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم وَذَكَرَ الْحَوْضَ فَقَالَ ‏\n\"‏ كَمَا بَيْنَ الْمَدِينَةِ وَصَنْعَاءَ ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Nabi SAW menyebut tentang Telaga Kautsar, baginda bersabda:  \"Lebar Telaga Kautsar itu sama dengan jarak antara Madinah dan Sana'a (ibu kota Yaman).\""
  },
  {
    "id": 6352,
    "hadith_number": 6352,
    "tajuk_hadith": "Saiz Hauz Nabi SAW",
    "perawi_melayu": "Haritha, melalui riwayat Ma'bad bin Khalid, daripada Syu'bah, dan tambahan daripada Ibnu Abi 'Adiyy",
    "english_text": "",
    "arabic_text": "وَزَادَ ابْنُ أَبِي عَدِيٍّ عَنْ شُعْبَةَ، عَنْ مَعْبَدِ بْنِ خَالِدٍ، عَنْ حَارِثَةَ، سَمِعَ النَّبِيَّ صلى الله عليه وسلم قَوْلَهُ حَوْضُهُ مَا بَيْنَ صَنْعَاءَ وَالْمَدِينَةِ‏.‏ فَقَالَ لَهُ الْمُسْتَوْرِدُ أَلَمْ تَسْمَعْهُ قَالَ الأَوَانِي‏.‏ قَالَ لاَ‏.‏ قَالَ الْمُسْتَوْرِدُ تُرَى فِيهِ الآنِيَةُ مِثْلَ الْكَوَاكِبِ‏.‏",
    "malay_translation": "Ibnu Abi 'Adiyy menambah daripada Syu'bah, daripada Ma'bad bin Khalid, daripada Haritha, bahawa dia mendengar Nabi SAW bersabda, \"Hauz-Ku seluas jarak antara Sana'a dan Madinah.\"  Kemudian Al-Mustaurid bertanya kepadanya, \"Bukankah engkau mendengar baginda menyebut periuk-periuk?\"  Dia menjawab, \"Tidak.\" Al-Mustaurid berkata, \"Periuk-periuk itu akan kelihatan di dalamnya seperti bintang-bintang.\" "
  },
  {
    "id": 6353,
    "hadith_number": 6353,
    "tajuk_hadith": "Di Tasik Al-Hawd: Nabi SAW Menunggu Umatnya",
    "perawi_melayu": "Daripada Asma' binti Abu Bakar",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، عَنْ نَافِعِ بْنِ عُمَرَ، قَالَ حَدَّثَنِي ابْنُ أَبِي مُلَيْكَةَ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ ـ رضى الله عنهما ـ قَالَتْ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنِّي عَلَى الْحَوْضِ حَتَّى أَنْظُرُ مَنْ يَرِدُ عَلَىَّ مِنْكُمْ، وَسَيُؤْخَذُ نَاسٌ دُونِي فَأَقُولُ يَا رَبِّ مِنِّي وَمِنْ أُمَّتِي‏.‏ فَيُقَالُ هَلْ شَعَرْتَ مَا عَمِلُوا بَعْدَكَ وَاللَّهِ مَا بَرِحُوا يَرْجِعُونَ عَلَى أَعْقَابِهِمْ ‏\"‏‏.‏ فَكَانَ ابْنُ أَبِي مُلَيْكَةَ يَقُولُ اللَّهُمَّ إِنَّا نَعُوذُ بِكَ أَنْ نَرْجِعَ عَلَى أَعْقَابِنَا أَوْ نُفْتَنَ عَنْ دِينِنَا‏.‏ ‏{‏أَعْقَابِكُمْ تَنْكِصُونَ‏}‏ تَرْجِعُونَ عَلَى الْعَقِبِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Sa’id bin Abi Maryam, dari Naafi’ bin Umar, dia berkata; Telah menceritakan kepadaku Ibnu Abi Mulaykah, dari Asma’ binti Abu Bakar – semoga Allah merahmati mereka berdua – dia berkata; Rasulullah SAW bersabda: “Sesungguhnya aku berada di sisi telaga (Al-Hawd) sehingga aku melihat siapakah di antara kamu yang datang kepadaku. Dan sesungguhnya akan diambil sebahagian manusia sebelum sampai kepadaku, lalu aku akan berkata: ‘Ya Rabb, mereka adalah dariku dan dari umatku.’ Maka dikatakan: ‘Adakah engkau sedar apa yang mereka lakukan setelahmu? Demi Allah, mereka terus-menerus berpaling ke belakang (murtad).’” Maka Ibnu Abi Mulaykah selalu berdoa: “Ya Allah, sesungguhnya kami berlindung kepada-Mu daripada berpaling ke belakang (murtad) atau diuji dalam agama kami.” {Ayat: “Tumit-tumit kamu itu yang kamu tolak.”}  Berpaling ke belakang."
  }
]
