[
  {
    "id": 5159,
    "hadith_number": 5159,
    "tajuk_hadith": "Anjuran Memberi Makan, Melawat Orang Sakit, dan Membebaskan Tawanan",
    "perawi_melayu": "Diriwayatkan daripada Abu Musa Al-Ash`ari:",
    "english_text": "The Prophet (ﷺ) said, \"Give food to the hungry, pay a visit to the sick and release (set free) the one in \ncaptivity (by paying his ransom).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مُوسَى الأَشْعَرِي ِّ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَطْعِمُوا الْجَائِعَ، وَعُودُوا الْمَرِيضَ، وَفُكُّوا الْعَانِيَ ‏\"‏‏.‏ قَالَ سُفْيَانُ وَالْعَانِي الأَسِيرُ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda, \"Berilah makan kepada orang yang lapar, ziarahilah orang sakit, dan bebaskanlah tawanan (dengan membayar tebusan).\""
  },
  {
    "id": 5160,
    "hadith_number": 5160,
    "tajuk_hadith": "Keluarga Nabi Muhammad (ﷺ) Tidak Pernah Kenyang Selama Tiga Hari Berturut-turut",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "The family of Muhammad did not eat their fill for three successive \n     days till he died.",
    "arabic_text": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ مَا شَبِعَ آلُ مُحَمَّدٍ صلى الله عليه وسلم مِنْ طَعَامٍ ثَلاَثَةَ أَيَّامٍ حَتَّى قُبِضَ‏.‏",
    "malay_translation": "Keluarga Muhammad (ﷺ) tidak pernah makan sehingga kenyang selama tiga hari berturut-turut sehingga baginda wafat."
  },
  {
    "id": 5161,
    "hadith_number": 5161,
    "tajuk_hadith": "Rasulullah ﷺ Membantu Abu Hurairah yang Kelaparan",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "Once while I was in a state of fatigue (because of severe hunger), I \n     met 'Umar bin Al-Khattab, so I asked him to recite a verse from \n     Allah's Book to me. He entered his house and interpreted it to me. \n     (Then I went out and) after walking for a short distance, I fell on my\n     face because of fatigue and severe hunger. Suddenly I saw Allah's \n     Apostle  standing by my head. He said, \"O Abu Huraira!\" I replied, \n     \"Labbaik, O Allah's Messenger (ﷺ), and Sadaik!\" Then he held me by the hand,\n     and made me get up. Then he came to know what I was suffering from. He\n     took me to his house, and ordered a big bowl of milk for me. I drank \n     thereof and he said, \"Drink more, O Abu Hirr!\" So I drank again, \n     whereupon he again said, \"Drink more.\" So I drank more till my belly \n     became full and looked like a bowl. Afterwards I met 'Umar and \n     mentioned to him what had happened to me, and said to him, \"Somebody, \n     who had more right than you, O 'Umar, took over the case. By Allah, I \n     asked you to recite a Verse to me while I knew it better than you.\" On\n     that Umar said to me, \"By Allah, if I admitted and entertained you, it\n     would have been dearer to me than having nice red camels.",
    "arabic_text": "وَعَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، أَصَابَنِي جَهْدٌ شَدِيدٌ فَلَقِيتُ عُمَرَ بْنَ الْخَطَّابِ، فَاسْتَقْرَأْتُهُ آيَةً مِنْ كِتَابِ اللَّهِ، فَدَخَلَ دَارَهُ وَفَتَحَهَا عَلَىَّ، فَمَشَيْتُ غَيْرَ بَعِيدٍ، فَخَرَرْتُ لِوَجْهِي مِنَ الْجَهْدِ وَالْجُوعِ فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَائِمٌ عَلَى رَأْسِي فَقَالَ ‏\"‏ يَا أَبَا هُرَيْرَةَ ‏\"‏‏.‏ فَقُلْتُ لَبَّيْكَ رَسُولَ اللَّهِ وَسَعْدَيْكَ‏.‏ فَأَخَذَ بِيَدِي فَأَقَامَنِي، وَعَرَفَ الَّذِي بِي، فَانْطَلَقَ بِي إِلَى رَحْلِهِ، فَأَمَرَ لِي بِعُسٍّ مِنْ لَبَنٍ فَشَرِبْتُ مِنْهُ، ثُمَّ قَالَ ‏\"‏ عُدْ يَا أَبَا هِرٍّ ‏\"‏‏.‏ فَعُدْتُ فَشَرِبْتُ، ثُمَّ قَالَ ‏\"‏ عُدْ ‏\"‏‏.‏ فَعُدْتُ فَشَرِبْتُ حَتَّى اسْتَوَى بَطْنِي فَصَارَ كَالْقِدْحِ ـ قَالَ ـ فَلَقِيتُ عُمَرَ وَذَكَرْتُ لَهُ الَّذِي كَانَ مِنْ أَمْرِي وَقُلْتُ لَهُ تَوَلَّى اللَّهُ ذَلِكَ مَنْ كَانَ أَحَقَّ بِهِ مِنْكَ يَا عُمَرُ، وَاللَّهِ لَقَدِ اسْتَقْرَأْتُكَ الآيَةَ وَلأَنَا أَقْرَأُ لَهَا مِنْكَ‏.‏ قَالَ عُمَرُ وَاللَّهِ لأَنْ أَكُونَ أَدْخَلْتُكَ أَحَبُّ إِلَىَّ مِنْ أَنْ يَكُونَ لِي مِثْلُ حُمْرِ النَّعَمِ‏.‏",
    "malay_translation": "Daripada Abu Hazim, daripada Abu Hurairah, berkata: “Aku ditimpa kepayahan yang sangat, lalu aku bertemu Umar bin Al-Khattab, kemudian aku meminta dia membacakan ayat daripada Kitab Allah kepadaku. Lalu dia masuk ke rumahnya dan menafsirkannya kepadaku. Kemudian aku berjalan tidak jauh, lalu aku tersungkur atas wajahku kerana kepayahan dan kelaparan. Tiba-tiba Rasulullah ﷺ berdiri di atas kepalaku lalu bersabda: “Wahai Abu Hurairah!” Aku menjawab: “Labbaik (aku memenuhi panggilan-Mu), wahai Rasulullah dan Sa’daik (kebahagiaan-Mu). Lalu Baginda memegang tanganku dan menegakkanku. Baginda mengetahui apa yang aku alami. Baginda membawaku ke rumahnya, lalu Baginda meminta diberikan kepadaku semangkuk besar susu. Lalu aku meminumnya. Kemudian Baginda bersabda: “Minumlah lagi wahai Abu Hirr!” Maka aku meminumnya lagi, kemudian Baginda bersabda lagi: “Minumlah lagi.” Maka aku meminumnya lagi sehingga perutku menjadi kenyang dan kelihatan seperti bekas minuman. Selepas itu, aku bertemu Umar dan menceritakan kepadanya apa yang telah berlaku kepadaku, dan aku berkata kepadanya: “Seseorang, yang lebih berhak daripadamu, wahai Umar, telah menguruskan hal itu. Demi Allah, aku meminta kamu membacakan ayat kepadaku padahal aku lebih tahu mengenainya daripada kamu.” Maka Umar berkata kepadaku: “Demi Allah, sekiranya aku menerimamu (menjamu kamu), sesungguhnya lebih aku sukai daripada aku memiliki unta merah yang terbaik.”"
  },
  {
    "id": 5162,
    "hadith_number": 5162,
    "tajuk_hadith": "Adab Makan: Mengingati Nama Allah dan Makan dengan Tangan Kanan",
    "perawi_melayu": "Diriwayatkan oleh 'Umar bin Abi Salama:",
    "english_text": "I was a boy under the care of Allah's Messenger (ﷺ) and my hand used to go around the dish while I was \neating. So Allah's Messenger (ﷺ) said to me, 'O boy! Mention the Name of Allah and eat with your right \nhand, and eat of the dish what is nearer to you.\" Since then I have applied those instructions when \neating.",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، أَخْبَرَنَا سُفْيَانُ، قَالَ الْوَلِيدُ بْنُ كَثِيرٍ أَخْبَرَنِي أَنَّهُ، سَمِعَ وَهْبَ بْنَ كَيْسَانَ، أَنَّهُ سَمِعَ عُمَرَ بْنَ أَبِي سَلَمَةَ، يَقُولُ كُنْتُ غُلاَمًا فِي حَجْرِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَكَانَتْ يَدِي تَطِيشُ فِي الصَّحْفَةِ فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَا غُلاَمُ سَمِّ اللَّهَ، وَكُلْ بِيَمِينِكَ وَكُلْ مِمَّا يَلِيكَ ‏\"‏‏.‏ فَمَا زَالَتْ تِلْكَ طِعْمَتِي بَعْدُ‏.‏",
    "malay_translation": "Aku adalah seorang budak lelaki di bawah jagaan Rasulullah (ﷺ), dan tanganku sering bergerak ke merata tempat di dalam hidangan semasa aku makan. Maka Rasulullah (ﷺ) bersabda kepadaku, 'Wahai anak! Sebutlah nama Allah, makanlah dengan tangan kananmu, dan makanlah dari apa yang ada di hadapanmu.' Sejak itu, aku mengamalkan arahan tersebut ketika makan."
  },
  {
    "id": 5163,
    "hadith_number": 5163,
    "tajuk_hadith": "Adab Makan: Makan dari Bahagian Berdekatan",
    "perawi_melayu": "Diriwayatkan daripada 'Umar bin Abi Salamah",
    "english_text": "Who was the son of Um Salama, the wife of the Prophet: \nOnce I ate a meal with Allah's Messenger (ﷺ) and I was eating from all sides of the dish. So Allah's Messenger (ﷺ) \nsaid to me, \"Eat of the dish what is nearer to you.\"",
    "arabic_text": "حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ الدِّيلِيِّ، عَنْ وَهْبِ بْنِ كَيْسَانَ أَبِي نُعَيْمٍ، عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ ـ وَهْوَ ابْنُ أُمِّ سَلَمَةَ ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَ أَكَلْتُ يَوْمًا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم طَعَامًا فَجَعَلْتُ آكُلُ مِنْ نَوَاحِي الصَّحْفَةِ فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ كُلْ مِمَّا يَلِيكَ ‏\"‏‏.‏",
    "malay_translation": "Siapakah anak Ummu Salamah, isteri Nabi (ﷺ):\nSuatu ketika saya makan bersama Rasulullah (ﷺ) dan saya makan dari sekeliling hidangan. Lalu Rasulullah (ﷺ) bersabda kepada saya, \"Makanlah dari bahagian hidangan yang dekat denganmu.\""
  },
  {
    "id": 5164,
    "hadith_number": 5164,
    "tajuk_hadith": "Adab Makan: Menyebut Nama Allah dan Makan dari Depan",
    "perawi_melayu": "Diriwayatkan oleh Wahb bin Kaisan Abi Nu'aim:",
    "english_text": "A meal was brought to Allah's Messenger (ﷺ) while his step-son, `Umar bin Abi Salama was with him. \nAllah's Messenger (ﷺ) said to him, \"Mention the Name of Allah and eat of the dish what is nearer to you.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ وَهْبِ بْنِ كَيْسَانَ أَبِي نُعَيْمٍ، قَالَ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِطَعَامٍ وَمَعَهُ رَبِيبُهُ عُمَرُ بْنُ أَبِي سَلَمَةَ فَقَالَ ‏\n\"‏ سَمِّ اللَّهَ، وَكُلْ مِمَّا يَلِيكَ ‏\"‏‏.‏",
    "malay_translation": "Suatu hidangan dibawa kepada Rasulullah (ﷺ) ketika anak tirinya, `Umar bin Abi Salama berada bersama baginda. Rasulullah (ﷺ) bersabda kepadanya, \"Sebutlah nama Allah dan makanlah dari hidangan yang paling dekat denganmu.\""
  },
  {
    "id": 5165,
    "hadith_number": 5165,
    "tajuk_hadith": "Nabi SAW Mengambil Makanan Gourd (Labu)",
    "perawi_melayu": "Diriwayatkan oleh Anas bin Malik:",
    "english_text": "A tailor invited Allah's Messenger (ﷺ) to a meal which he had prepared. I went along with Allah's Messenger (ﷺ) \nand saw him seeking to eat the pieces of gourd from the various sides of the dish. Since that day I \nhave liked to eat gourd. `Umar bin Abi Salama said: The Prophet, said to me, \"Eat with your right \nhand.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ إِنَّ خَيَّاطًا دَعَا رَسُولَ اللَّهِ صلى الله عليه وسلم لِطَعَامٍ صَنَعَهُ ـ قَالَ أَنَسٌ ـ فَذَهَبْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَرَأَيْتُهُ يَتَتَبَّعُ الدُّبَّاءَ مِنْ حَوَالَىِ الْقَصْعَةِ ـ قَالَ ـ فَلَمْ أَزَلْ أُحِبُّ الدُّبَّاءَ مِنْ يَوْمِئِذٍ‏.‏",
    "malay_translation": "Seorang tukang jahit telah menjemput Rasulullah ﷺ ke satu jamuan yang telah disediakan. Aku pergi bersama Rasulullah ﷺ dan melihat baginda mencari-cari untuk makan potongan labu dari pelbagai sisi hidangan. Sejak hari itu, aku suka makan labu. 'Umar bin Abi Salama berkata: Nabi ﷺ berkata kepada saya, \"Makanlah dengan tangan kananmu.\""
  },
  {
    "id": 5166,
    "hadith_number": 5166,
    "tajuk_hadith": "Kecintaan Nabi (ﷺ) Terhadap Memulakan Segala Sesuatu dari Sebelah Kanan",
    "perawi_melayu": "Diriwayatkan oleh `Aisha:",
    "english_text": "The Prophet (ﷺ) used to love to start doing things from the right side whenever possible, in performing \nablution, putting on his shoes, and combing his hair. (Al-Ash'ath said: The Prophet (ﷺ) used to do so in all \nhis affairs.)",
    "arabic_text": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا شُعْبَةُ، عَنْ أَشْعَثَ، عَنْ أَبِيهِ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُحِبُّ التَّيَمُّنَ مَا اسْتَطَاعَ فِي طُهُورِهِ وَتَنَعُّلِهِ وَتَرَجُّلِهِ‏.‏ وَكَانَ قَالَ بِوَاسِطٍ قَبْلَ هَذَا فِي شَأْنِهِ كُلِّهِ‏.‏",
    "malay_translation": "Nabi (ﷺ) sangat suka memulakan sesuatu dari sebelah kanan sebisa mungkin, dalam berwudhu', memakai kasut, dan menyisir rambutnya. (Al-Ash'ath berkata: Nabi (ﷺ) melakukan hal demikian dalam semua urusannya.)"
  },
  {
    "id": 5167,
    "hadith_number": 5167,
    "tajuk_hadith": "Mukjizat Nabi Muhammad SAW: Makanan yang Mencukupi 80 Orang",
    "perawi_melayu": "Diriwayatkan daripada Anas bin Malik",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ أَبُو طَلْحَةَ لأُمِّ سُلَيْمٍ لَقَدْ سَمِعْتُ صَوْتَ، رَسُولِ اللَّهِ صلى الله عليه وسلم ضَعِيفًا أَعْرِفُ فِيهِ الْجُوعَ، فَهَلْ عِنْدَكِ مِنْ شَىْءٍ فَأَخْرَجَتْ أَقْرَاصًا مِنْ شَعِيرٍ، ثُمَّ أَخْرَجَتْ خِمَارًا لَهَا فَلَفَّتِ الْخُبْزَ بِبَعْضِهِ، ثُمَّ دَسَّتْهُ تَحْتَ ثَوْبِي وَرَدَّتْنِي بِبَعْضِهِ، ثُمَّ أَرْسَلَتْنِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ فَذَهَبْتُ بِهِ فَوَجَدْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي الْمَسْجِدِ وَمَعَهُ النَّاسُ، فَقُمْتُ عَلَيْهِمْ فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَرْسَلَكَ أَبُو طَلْحَةَ ‏\"‏‏.‏ فَقُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ بِطَعَامٍ ‏\"‏‏.‏ قَالَ فَقُلْتُ نَعَمْ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِمَنْ مَعَهُ ‏\"‏ قُومُوا ‏\"‏‏.‏ فَانْطَلَقَ وَانْطَلَقْتُ بَيْنَ أَيْدِيهِمْ حَتَّى جِئْتُ أَبَا طَلْحَةَ، فَقَالَ أَبُو طَلْحَةَ يَا أُمَّ سُلَيْمٍ قَدْ جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالنَّاسِ، وَلَيْسَ عِنْدَنَا مِنَ الطَّعَامِ مَا نُطْعِمُهُمْ‏.‏ فَقَالَتِ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ فَانْطَلَقَ أَبُو طَلْحَةَ حَتَّى لَقِيَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَقْبَلَ أَبُو طَلْحَةَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى دَخَلاَ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلُمِّي يَا أُمَّ سُلَيْمٍ مَا عِنْدَكِ ‏\"‏‏.‏ فَأَتَتْ بِذَلِكَ الْخُبْزِ فَأَمَرَ بِهِ فَفُتَّ وَعَصَرَتْ أُمُّ سُلَيْمٍ عُكَّةً لَهَا فَأَدَمَتْهُ، ثُمَّ قَالَ فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم مَا شَاءَ اللَّهُ أَنْ يَقُولَ ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ ‏\"‏‏.‏ فَأَذِنَ لَهُمْ، فَأَكَلُوا حَتَّى شَبِعُوا، ثُمَّ خَرَجُوا، ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ ‏\"‏‏.‏ فَأَذِنَ لَهُمْ فَأَكَلُوا حَتَّى شَبِعُوا، ثُمَّ خَرَجُوا، ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ ‏\"‏‏.‏ فَأَذِنَ لَهُمْ فَأَكَلُوا حَتَّى شَبِعُوا ثُمَّ خَرَجُوا، ثُمَّ أَذِنَ لِعَشَرَةٍ، فَأَكَلَ الْقَوْمُ كُلُّهُمْ وَشَبِعُوا، وَالْقَوْمُ ثَمَانُونَ رَجُلاً‏.‏",
    "malay_translation": "Abu Talhah berkata kepada Ummu Sulaim, \"Aku telah mendengar suara Rasulullah ﷺ yang lemah, dan aku rasa baginda lapar. Adakah kamu ada sesuatu (untuk dimakan)?\" Dia mengeluarkan beberapa roti barli, kemudian mengambil tudung kepalanya dan membungkus roti itu dengan sebahagian daripadanya, dan menyelipkannya di bawah pakaianku dan mengarahkan aku membawa sebahagiannya lagi. Kemudian dia menghantarku kepada Rasulullah ﷺ. Aku pergi dengan membawa roti itu, dan mendapati Rasulullah ﷺ di masjid bersama beberapa orang. Aku berdiri berhampiran mereka, dan Rasulullah ﷺ bertanya kepadaku, \"Adakah kamu dihantar oleh Abu Talhah?\" Aku berkata, \"Ya.\" Baginda bertanya, \"Dengan sedikit makanan (untuk kami)?\" Aku berkata, \"Ya.\" Kemudian Rasulullah ﷺ berkata kepada semua yang bersamanya, \"Bangunlah!\" Baginda berangkat (dan semua orang mengikutinya) dan aku berjalan di hadapan mereka sehingga aku sampai kepada Abu Talhah. Abu Talhah kemudian berkata, \"Wahai Ummu Sulaim! Rasulullah ﷺ telah tiba bersama orang ramai, dan kita tidak mempunyai makanan yang cukup untuk memberi makan kepada mereka semua.\" Dia berkata, \"Allah dan Rasul-Nya lebih mengetahui.\" Jadi, Abu Talhah keluar sehingga dia bertemu Rasulullah ﷺ. Kemudian Abu Talhah dan Rasulullah ﷺ datang dan masuk ke dalam rumah. Rasulullah ﷺ berkata, \"Ummu Sulaim! Bawalah apa yang kamu ada.\" Dia membawa roti itu. Nabi ﷺ memerintahkan agar ia dihancurkan menjadi kepingan kecil, dan Ummu Sulaim menekan kulit mentega di atasnya. Kemudian Rasulullah ﷺ berkata apa sahaja yang Allah kehendaki baginda katakan (untuk memberkati makanan) dan kemudian menambah, \"Benarkan sepuluh (orang).\" Jadi, mereka dibenarkan masuk, makan sehingga kenyang dan keluar. Nabi ﷺ kemudian berkata, \"Benarkan sepuluh (lagi).\" Mereka dibenarkan masuk, makan sehingga kenyang, dan keluar. Baginda kemudian berkata lagi, \"Benarkan sepuluh lagi!\" Mereka dibenarkan masuk, makan sehingga kenyang, dan keluar. Baginda membenarkan sepuluh lagi, dan begitu semua orang itu makan sehingga kenyang, dan mereka adalah lapan puluh orang."
  },
  {
    "id": 5168,
    "hadith_number": 5168,
    "tajuk_hadith": "Kisah Makanan yang Mencukupi untuk Seratus Tiga Puluh Orang",
    "perawi_melayu": "`Abdur-Rahman bin Abu Bakr",
    "english_text": "We were one hundred and thirty men sitting with the Prophet. The Prophet (ﷺ) said, \"Have anyone of you \nany food with him?\" It happened that one man had one Sa of wheat flour (or so) which was turned \ninto dough then. After a while a tall lanky pagan came, driving some sheep. The Prophet (ﷺ) asked, 'Will \nyou sell us (a sheep), or give (it to) us as a gift?\" The pagan said, \"No, but I will sell it \" So the \nProphet bought from him a sheep which was slaughtered, and then the Prophet (ﷺ) ordered that the liver, \nthe kidneys, lungs and heart, etc., of that sheep be roasted. By Allah, none of those one hundred and \nthirty men but had his share of those things. The Prophet (ﷺ) gave to those who were present, and also \nkept a share for those who were absent He then served that cooked sheep in two big trays and we all \nate together our fill; yet there remained a part of it in those two trays which I carried on the camel.",
    "arabic_text": "حَدَّثَنَا مُوسَى، حَدَّثَنَا مُعْتَمِرٌ، عَنْ أَبِيهِ، قَالَ وَحَدَّثَ أَبُو عُثْمَانَ، أَيْضًا عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ ـ رضى الله عنهما ـ قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم ثَلاَثِينَ وَمِائَةً، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هَلْ مَعَ أَحَدٍ مِنْكُمْ طَعَامٌ ‏\"‏‏.‏ فَإِذَا مَعَ رَجُلٍ صَاعٌ مِنْ طَعَامٍ أَوْ نَحْوُهُ، فَعُجِنَ، ثُمَّ جَاءَ رَجُلٌ مُشْرِكٌ مُشْعَانٌّ طَوِيلٌ بِغَنَمٍ يَسُوقُهَا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَبَيْعٌ أَمْ عَطِيَّةٌ أَوْ ـ قَالَ ـ هِبَةٌ ‏\"‏‏.‏ قَالَ لاَ بَلْ بَيْعٌ‏.‏ قَالَ فَاشْتَرَى مِنْهُ شَاةً فَصُنِعَتْ، فَأَمَرَ نَبِيُّ اللَّهِ صلى الله عليه وسلم بِسَوَادِ الْبَطْنِ يُشْوَى، وَايْمُ اللَّهِ مَا مِنَ الثَّلاَثِينَ وَمِائَةٍ إِلاَّ قَدْ حَزَّ لَهُ حُزَّةً مِنْ سَوَادِ بَطْنِهَا، إِنْ كَانَ شَاهِدًا أَعْطَاهَا إِيَّاهُ، وَإِنْ كَانَ غَائِبًا خَبَأَهَا لَهُ، ثُمَّ جَعَلَ فِيهَا قَصْعَتَيْنِ فَأَكَلْنَا أَجْمَعُونَ وَشَبِعْنَا، وَفَضَلَ فِي الْقَصْعَتَيْنِ، فَحَمَلْتُهُ عَلَى الْبَعِيرِ‏.‏ أَوْ كَمَا قَالَ‏.‏",
    "malay_translation": "Kami bersama seratus tiga puluh orang lelaki sedang duduk bersama Nabi. Nabi ﷺ bertanya, \"Adakah sesiapa di antara kamu mempunyai makanan?\" Tiba-tiba seorang lelaki mempunyai satu *sa'* tepung gandum (atau lebih kurang) yang kemudian diuli menjadi doh. Selepas beberapa ketika, datang seorang lelaki pagan yang tinggi lampai, sedang menggiring beberapa ekor kambing. Nabi ﷺ bertanya, 'Adakah kamu mahu menjual kambing itu kepada kami, atau memberikannya sebagai hadiah?\" Lelaki pagan itu berkata, \"Tidak, tetapi saya akan menjualnya.\" Maka Nabi membeli seekor kambing daripadanya yang kemudian disembelih, dan Nabi ﷺ memerintahkan agar hati, buah pinggang, paru-paru dan jantung, dan lain-lain, kambing itu dipanggang. Demi Allah, tiada seorang pun daripada seratus tiga puluh lelaki itu melainkan mendapat bahagiannya daripada makanan tersebut. Nabi ﷺ memberi kepada mereka yang hadir, dan juga menyimpan bahagian untuk mereka yang tidak hadir. Kemudian Baginda menghidangkan kambing yang telah dimasak itu dalam dua dulang besar dan kami semua makan bersama sehingga kenyang; namun begitu, masih ada sebahagian daripadanya yang tinggal dalam dua dulang itu yang saya bawa di atas unta."
  },
  {
    "id": 5169,
    "hadith_number": 5169,
    "tajuk_hadith": "Nabi ﷺ Wafat Ketika Kami Kenyang dengan Kurma dan Air",
    "perawi_melayu": "Diriwayatkan oleh 'Aishah:",
    "english_text": "The Prophet (ﷺ) died when we had satisfied our hunger with the two black things, i.e. dates and water.",
    "arabic_text": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا مَنْصُورٌ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ تُوُفِّيَ النَّبِيُّ صلى الله عليه وسلم حِينَ شَبِعْنَا مِنَ الأَسْوَدَيْنِ التَّمْرِ وَالْمَاءِ‏.‏",
    "malay_translation": "Nabi ﷺ wafat ketika kami telah menghilangkan rasa lapar kami dengan dua perkara yang hitam, iaitu kurma dan air."
  },
  {
    "id": 5170,
    "hadith_number": 5170,
    "tajuk_hadith": "Nabi SAW Menunaikan Solat Maghrib Selepas Makan Sawiq Tanpa Wudhu",
    "perawi_melayu": "Diriwayatkan oleh Suwaid bin An-Nu`man:",
    "english_text": "We went out with Allah's Messenger (ﷺ) to Khaibar, and when we were at As-Sahba', (Yahya, a sub-narrator \nsaid, \"As-Sahba' is a place at a distance of one day's journey to Khaibar).\" Allah's Messenger (ﷺ) asked the \npeople to bring their food, but there was nothing with the people except Sawiq. So we all chewed and \nate of it. Then the Prophet (ﷺ) asked for some water and he rinsed his mouth, and we too, rinsed our \nmouths. Then he led us in the Maghrib prayer without performing ablution (again).",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ يَحْيَى بْنُ سَعِيدٍ سَمِعْتُ بُشَيْرَ بْنَ يَسَارٍ، يَقُولُ حَدَّثَنَا سُوَيْدُ بْنُ النُّعْمَانِ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى خَيْبَرَ، فَلَمَّا كُنَّا بِالصَّهْبَاءِ ـ قَالَ يَحْيَى وَهْىَ مِنْ خَيْبَرَ عَلَى رَوْحَةٍ ـ دَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِطَعَامٍ، فَمَا أُتِيَ إِلاَّ بِسَوِيقٍ، فَلُكْنَاهُ فَأَكَلْنَا مِنْهُ، ثُمَّ دَعَا بِمَاءٍ فَمَضْمَضَ وَمَضْمَضْنَا، فَصَلَّى بِنَا الْمَغْرِبَ وَلَمْ يَتَوَضَّأْ‏.‏ قَالَ سُفْيَانُ سَمِعْتُهُ مِنْهُ عَوْدًا وَبَدْءًا‏.‏",
    "malay_translation": "Kami keluar bersama Rasulullah ﷺ ke Khaibar, dan ketika kami berada di As-Sahba', (Yahya, seorang perawi tambahan berkata, \"As-Sahba' adalah tempat yang jaraknya perjalanan sehari ke Khaibar).\" Rasulullah ﷺ meminta orang ramai membawa makanan mereka, tetapi tidak ada apa-apa pada orang ramai kecuali Sawiq. Jadi, kami semua mengunyah dan memakannya. Kemudian Nabi ﷺ meminta sedikit air dan dia berkumur, dan kami juga berkumur. Kemudian dia memimpin kami dalam solat Maghrib tanpa mengambil wuduk (lagi)."
  },
  {
    "id": 5171,
    "hadith_number": 5171,
    "tajuk_hadith": "Nabi ﷺ Tidak Pernah Makan Roti Tipis dan Kambing Panggang (Masmutah)",
    "perawi_melayu": "Qatada",
    "english_text": "We were in the company of Anas whose baker was with him. Anas said, The Prophet (ﷺ) did not eat thin \nbread, or a roasted sheep till he met Allah (died).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، قَالَ كُنَّا عِنْدَ أَنَسٍ وَعِنْدَهُ خَبَّازٌ لَهُ فَقَالَ مَا أَكَلَ النَّبِيُّ صلى الله عليه وسلم خُبْزًا مُرَقَّقًا وَلاَ شَاةً مَسْمُوطَةً حَتَّى لَقِيَ اللَّهَ‏.‏",
    "malay_translation": "Kami bersama Anas yang tukang roti nya bersamanya. Anas berkata, Nabi ﷺ tidak pernah makan roti yang nipis, atau kambing panggang (masmutah) sehingga baginda bertemu Allah (wafat)."
  },
  {
    "id": 5172,
    "hadith_number": 5172,
    "tajuk_hadith": "Cara Makan Nabi (ﷺ)",
    "perawi_melayu": "Diriwayatkan oleh Anas:",
    "english_text": "To the best of my knowledge, the Prophet (ﷺ) did not take his meals in a big tray at all, nor did he ever eat \nwell-baked thin bread, nor did he ever eat at a dining table.",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ يُونُسَ ـ قَالَ عَلِيٌّ هُوَ الإِسْكَافُ ـ عَنْ قَتَادَةَ، عَنْ أَنَسٍ، رضى الله عنه قَالَ مَا عَلِمْتُ النَّبِيَّ صلى الله عليه وسلم أَكَلَ عَلَى سُكُرُّجَةٍ قَطُّ، وَلاَ خُبِزَ لَهُ مُرَقَّقٌ قَطُّ، وَلاَ أَكَلَ عَلَى خِوَانٍ‏.‏ قِيلَ لِقَتَادَةَ فَعَلَى مَا كَانُوا يَأْكُلُونَ قَالَ عَلَى السُّفَرِ‏.‏",
    "malay_translation": "Setakat pengetahuan saya, Nabi (ﷺ) tidak pernah makan di atas dulang besar, tidak pernah makan roti nipis yang dibakar sempurna, dan tidak pernah makan di atas meja makan."
  },
  {
    "id": 5173,
    "hadith_number": 5173,
    "tajuk_hadith": "Perkahwinan Nabi ﷺ dengan Safiyyah dan Jamuan Walimah",
    "perawi_melayu": "Diriwayatkan oleh Anas:",
    "english_text": "The Prophet (ﷺ) halted to consummate his marriage with Safiyya. I invited the Muslims to his wedding \nbanquet. He ordered that leather dining sheets be spread. Then dates, dried yoghurt and butter were \nput on those sheets. Anas added: The Prophet (ﷺ) consummated his marriage with Safiyya (during a \njourney) whereupon Hais (sweet dish) was served on a leather dining sheet.",
    "arabic_text": "حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، أَخْبَرَنِي حُمَيْدٌ، أَنَّهُ سَمِعَ أَنَسًا، يَقُولُ قَامَ النَّبِيُّ صلى الله عليه وسلم يَبْنِي بِصَفِيَّةَ فَدَعَوْتُ الْمُسْلِمِينَ إِلَى وَلِيمَتِهِ أَمَرَ بِالأَنْطَاعِ فَبُسِطَتْ فَأُلْقِيَ عَلَيْهَا التَّمْرُ وَالأَقِطُ وَالسَّمْنُ‏.‏ وَقَالَ عَمْرٌو عَنْ أَنَسٍ بَنَى بِهَا النَّبِيُّ صلى الله عليه وسلم ثُمَّ صَنَعَ حَيْسًا فِي نِطَعٍ‏.‏",
    "malay_translation": "Nabi ﷺ berhenti untuk menyempurnakan perkahwinan baginda dengan Safiyyah. Saya menjemput umat Islam ke jamuan walimah perkahwinan baginda. Baginda memerintahkan agar hamparan kulit dibentangkan. Kemudian, kurma, yogurt kering dan mentega diletakkan di atas hamparan tersebut. Anas menambah: Nabi ﷺ menyempurnakan perkahwinan baginda dengan Safiyyah (semasa dalam perjalanan) di mana Hais (hidangan manis) dihidangkan di atas hamparan kulit."
  },
  {
    "id": 5174,
    "hadith_number": 5174,
    "tajuk_hadith": "Kisah Asma' Mengikat Bekas Air dan Makanan Rasulullah ﷺ dengan Tali Pinggangnya",
    "perawi_melayu": "Diriwayatkan oleh Wahb bin Kaisan",
    "english_text": "The People of Sham taunted `Abdullah bin Az-Zubair by calling him \"The son of Dhatin-Nataqain\" \n(the woman who has two waist-belts). (His mother) (Asma, said to him, \"O my son! They taunt you \nwith \"Nataqain\". Do you know what the Nataqain were? That was my waist-belt which I divided in \ntwo parts. I tied the water skin of Allah's Messenger (ﷺ) with one part, and with the other part I tied his food \ncontainer.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، وَعَنْ وَهْبِ بْنِ كَيْسَانَ، قَالَ كَانَ أَهْلُ الشَّأْمِ يُعَيِّرُونَ ابْنَ الزُّبَيْرِ يَقُولُونَ يَا ابْنَ ذَاتِ النِّطَاقَيْنِ‏.‏ فَقَالَتْ لَهُ أَسْمَاءُ يَا بُنَىَّ إِنَّهُمْ يُعَيِّرُونَكَ بِالنِّطَاقَيْنِ، هَلْ تَدْرِي مَا كَانَ النِّطَاقَانِ إِنَّمَا كَانَ نِطَاقِي شَقَقْتُهُ نِصْفَيْنِ، فَأَوْكَيْتُ قِرْبَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِأَحَدِهِمَا، وَجَعَلْتُ فِي سُفْرَتِهِ آخَرَ، قَالَ فَكَانَ أَهْلُ الشَّأْمِ إِذَا عَيَّرُوهُ بِالنِّطَاقَيْنِ يَقُولُ إِيهًا وَالإِلَهْ‏.‏ تِلْكَ شَكَاةٌ ظَاهِرٌ عَنْكَ عَارُهَا‏.‏",
    "malay_translation": "Orang-orang Syam mengejek `Abdullah bin Az-Zubair dengan memanggilnya \"Anak Dhatin-Nataqain\" (wanita yang mempunyai dua tali pinggang). (Ibunya) (Asma, berkata kepadanya, \"Wahai anakku! Mereka mengejekmu dengan \"Nataqain\". Tahukah kamu apakah Nataqain itu? Itulah tali pinggangku yang telah aku belah kepada dua bahagian. Aku mengikat bekas air Rasulullah (ﷺ) dengan satu bahagian, dan dengan bahagian yang satu lagi aku mengikat bekas makanan Baginda.\""
  },
  {
    "id": 5175,
    "hadith_number": 5175,
    "tajuk_hadith": "Kisah Hidangan Mentega, Yogurt Kering, dan Mastigures yang Dihadiahkan kepada Nabi (ﷺ)",
    "perawi_melayu": "Diriwayatkan oleh Ibnu Abbas:",
    "english_text": "that his aunt, Um Hufaid bint Al-Harith bin Hazn, presented to the Prophet (ﷺ) butter, dried yoghurt and \nmastigures. The Prophet (ﷺ) invited the people to those mastigures and they were eaten on his dining \nsheet, but the Prophet (ﷺ) did not eat of it, as if he disliked it. Nevertheless. if it was unlawful to eat that, \nthe people would not have eaten it on the dining sheet of the Prophet (ﷺ) nor would he have ordered that \nthey be eaten.",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ أُمَّ حُفَيْدٍ بِنْتَ الْحَارِثِ بْنِ حَزْن ٍ ـ خَالَةَ ابْنِ عَبَّاسٍ ـ أَهْدَتْ إِلَى النَّبِيِّ صلى الله عليه وسلم سَمْنًا وَأَقِطًا وَأَضُبًّا، فَدَعَا بِهِنَّ فَأُكِلْنَ عَلَى مَائِدَتِهِ، وَتَرَكَهُنَّ النَّبِيُّ صلى الله عليه وسلم كَالْمُسْتَقْذِرِ لَهُنَّ، وَلَوْ كُنَّ حَرَامًا مَا أُكِلْنَ عَلَى مَائِدَةِ النَّبِيِّ صلى الله عليه وسلم وَلاَ أَمَرَ بِأَكْلِهِنَّ‏.‏",
    "malay_translation": "Bahawa ibu saudaranya, Ummu Hufaid binti Al-Harith bin Hazn, menghadiahkan kepada Nabi (ﷺ) mentega, yogurt kering, dan mastigures (sejenis biawak gurun). Nabi (ﷺ) menjemput orang ramai untuk memakan mastigures tersebut, dan mereka memakannya di atas hamparan hidangannya, tetapi Nabi (ﷺ) tidak memakannya, seolah-olah baginda tidak menyukainya. Walau bagaimanapun, jika makanan itu haram dimakan, sudah pasti orang ramai tidak akan memakannya di atas hamparan hidangan Nabi (ﷺ), dan baginda juga tidak akan memerintahkan mereka memakannya."
  },
  {
    "id": 5176,
    "hadith_number": 5176,
    "tajuk_hadith": "Nabi SAW Makan Sawiq dan Solat Tanpa Berwudhu' di As-Sahba'",
    "perawi_melayu": "Diriwayatkan oleh Suwaid bin An-Nu`man:",
    "english_text": "that while they were with the Prophet (ﷺ) at As-Sahba' which was at a distance of one day's journey from \nKhaibar the prayer became due, and the Prophet (ﷺ) asked the people for food but there was nothing with \nthe people except Sawiq. He ate of it and we ate along with him, and then he asked for water and \nrinsed his mouth (with it), and then offered the (Maghrib) prayer and we too offered the prayer but the \nProphet did not perform ablution (again after eating the Sawiq.).",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ يَحْيَى، عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ سُوَيْدِ بْنِ النُّعْمَانِ، أَنَّهُ أَخْبَرَهُ أَنَّهُمْ، كَانُوا مَعَ النَّبِيِّ صلى الله عليه وسلم بِالصَّهْبَاءِ ـ وَهْىَ عَلَى رَوْحَةٍ مِنْ خَيْبَرَ ـ فَحَضَرَتِ الصَّلاَةُ، فَدَعَا بِطَعَامٍ فَلَمْ يَجِدْهُ إِلاَّ سَوِيقًا، فَلاَكَ مِنْهُ فَلُكْنَا مَعَهُ، ثُمَّ دَعَا بِمَاءٍ فَمَضْمَضَ، ثُمَّ صَلَّى وَصَلَّيْنَا، وَلَمْ يَتَوَضَّأْ‏.‏",
    "malay_translation": "Daripada Suwaid bin An-Nu`man: Ketika mereka bersama Nabi (ﷺ) di As-Sahba' yang terletak sejauh perjalanan sehari dari Khaibar, waktu solat telah tiba. Nabi (ﷺ) meminta makanan daripada orang ramai tetapi tiada apa-apa melainkan Sawiq. Baginda memakannya dan kami juga makan bersama baginda. Kemudian, baginda meminta air dan berkumur, lalu menunaikan solat (Maghrib) dan kami juga menunaikan solat, tetapi Nabi tidak berwudhu' (semula selepas makan Sawiq)."
  },
  {
    "id": 5177,
    "hadith_number": 5177,
    "tajuk_hadith": "Kisah Nabi Muhammad (ﷺ) dan Mastigure Panggang",
    "perawi_melayu": "Diriwayatkan oleh Khalid bin Al-Walid:",
    "english_text": "That he went with Allah's Messenger (ﷺ) to the house of Maimuna, who was his and Ibn `Abbas' aunt. He \nfound with her a roasted mastigure which her sister Hufaida bint Al-Harith had brought from Najd. \nMaimuna presented the mastigure before Allah's Messenger (ﷺ) who rarely started eating any (unfamiliar) \nfood before it was described and named for him. (But that time) Allah's Messenger (ﷺ) stretched his hand \ntowards the (meat of the) mastigure whereupon a lady from among those who were present, said, \n\"You should inform Allah's Messenger (ﷺ) of what you have presented to him. O Allah's Messenger (ﷺ)! It is the \nmeat of a mastigure.\" (On learning that) Allah's Messenger (ﷺ) withdrew his hand from the meat of the \nmastigure. Khalid bin Al-Walid said, \"O Allah's Messenger (ﷺ)! Is this unlawful to eat?\" Allah's Messenger (ﷺ) \nreplied, \"No, but it is not found in the land of my people, so I do not like it.\" Khalid said, \"Then I \npulled the mastigure (meat) towards me and ate it while Allah's Messenger (ﷺ) was looking at me.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو أُمَامَةَ بْنُ سَهْلِ بْنِ حُنَيْفٍ الأَنْصَارِيُّ، أَنَّ ابْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّ خَالِدَ بْنَ الْوَلِيدِ الَّذِي يُقَالُ لَهُ سَيْفُ اللَّهِ أَخْبَرَهُ أَنَّهُ، دَخَلَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى مَيْمُونَةَ ـ وَهْىَ خَالَتُهُ وَخَالَةُ ابْنِ عَبَّاسٍ ـ فَوَجَدَ عِنْدَهَا ضَبًّا مَحْنُوذًا، قَدِمَتْ بِهِ أُخْتُهَا حُفَيْدَةُ بِنْتُ الْحَارِثِ مِنْ نَجْدٍ، فَقَدَّمَتِ الضَّبَّ لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَكَانَ قَلَّمَا يُقَدِّمُ يَدَهُ لِطَعَامٍ حَتَّى يُحَدَّثَ بِهِ وَيُسَمَّى لَهُ، فَأَهْوَى رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ إِلَى الضَّبِّ، فَقَالَتِ امْرَأَةٌ مِنَ النِّسْوَةِ الْحُضُورِ أَخْبِرْنَ رَسُولَ اللَّهِ صلى الله عليه وسلم مَا قَدَّمْتُنَّ لَهُ، هُوَ الضَّبُّ يَا رَسُولَ اللَّهِ‏.‏ فَرَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ عَنِ الضَّبِّ، فَقَالَ خَالِدُ بْنُ الْوَلِيدِ أَحَرَامٌ الضَّبُّ يَا رَسُولَ اللَّهِ قَالَ ‏\n\"‏ لاَ وَلَكِنْ لَمْ يَكُنْ بِأَرْضِ قَوْمِي فَأَجِدُنِي أَعَافُهُ ‏\"‏‏.‏ قَالَ خَالِدٌ فَاجْتَرَرْتُهُ فَأَكَلْتُهُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَنْظُرُ إِلَىَّ‏.‏",
    "malay_translation": "Beliau (Khalid bin Al-Walid) berkata bahawa beliau pergi bersama Rasulullah ﷺ ke rumah Maimuna, yang merupakan ibu saudara beliau dan Ibn `Abbas. Beliau mendapati ada mastigure panggang bersamanya yang dibawa oleh saudara perempuannya, Hufaida bint Al-Harith, dari Najd. Maimuna menghidangkan mastigure tersebut di hadapan Rasulullah ﷺ, di mana Baginda jarang memulakan makan sebarang makanan (yang tidak dikenali) sebelum ia diterangkan dan dinamakan untuknya. (Tetapi pada masa itu) Rasulullah ﷺ menghulurkan tangan ke arah (daging) mastigure tersebut, maka seorang wanita dari kalangan yang hadir berkata, \"Kamu harus memaklumkan kepada Rasulullah ﷺ apa yang telah kamu hidangkan kepadanya. Wahai Rasulullah ﷺ! Itu adalah daging mastigure.\" (Setelah mengetahui hal itu) Rasulullah ﷺ menarik tangannya dari daging mastigure. Khalid bin Al-Walid berkata, \"Wahai Rasulullah ﷺ! Adakah ini haram dimakan?\" Rasulullah ﷺ menjawab, \"Tidak, tetapi ia tidak terdapat di negeri kaumku, jadi aku tidak menyukainya.\" Khalid berkata, \"Kemudian aku menarik mastigure (daging) ke arahku dan memakannya sementara Rasulullah ﷺ memerhatikan aku."
  },
  {
    "id": 5178,
    "hadith_number": 5178,
    "tajuk_hadith": "Kecukupan Makanan untuk Beberapa Orang",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "Allah's Messenger (ﷺ) said, \"The food for two persons is sufficient for three, and the food of three persons is \nsufficient for four persons.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، وَحَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ طَعَامُ الاِثْنَيْنِ كَافِي الثَّلاَثَةِ، وَطَعَامُ الثَّلاَثَةِ كَافِي الأَرْبَعَةِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda, \"Makanan untuk dua orang mencukupi untuk tiga orang, dan makanan tiga orang mencukupi untuk empat orang.\""
  },
  {
    "id": 5179,
    "hadith_number": 5179,
    "tajuk_hadith": "Seorang Mukmin Makan dalam Satu Usus",
    "perawi_melayu": "Diriwayatkan oleh Nafi`:",
    "english_text": "Ibn `Umar never used to take his meal unless a poor man was called to eat with him. One day I \nbrought a poor man to eat with him, the man ate too much, whereupon Ibn `Umar said, \"O Nafi`! \nDon't let this man enter my house, for I heard the Prophet (ﷺ) saying, \"A believer eats in one intestine (is \nsatisfied with a little food), and a kafir (unbeliever) eats in seven intestines (eats much food).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا شُعْبَةُ، عَنْ وَاقِدِ بْنِ مُحَمَّدٍ، عَنْ نَافِعٍ، قَالَ كَانَ ابْنُ عُمَرَ لاَ يَأْكُلُ حَتَّى يُؤْتَى بِمِسْكِينٍ يَأْكُلُ مَعَهُ، فَأَدْخَلْتُ رَجُلاً يَأْكُلُ مَعَهُ فَأَكَلَ كَثِيرًا فَقَالَ يَا نَافِعُ لاَ تُدْخِلْ هَذَا عَلَىَّ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الْمُؤْمِنُ يَأْكُلُ فِي مِعًى وَاحِدٍ وَالْكَافِرُ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ ‏\"‏‏.‏",
    "malay_translation": "Ibn `Umar tidak pernah makan melainkan jika seorang miskin dipanggil untuk makan bersamanya. Pada suatu hari, saya membawa seorang miskin untuk makan bersamanya, dan orang itu makan terlalu banyak. Lalu Ibn `Umar berkata, \"Wahai Nafi`! Jangan biarkan orang ini masuk ke rumahku, kerana aku mendengar Nabi (ﷺ) bersabda, \"Seorang mukmin makan dalam satu usus (cukup dengan sedikit makanan), dan seorang kafir (orang yang tidak beriman) makan dalam tujuh usus (makan terlalu banyak makanan).\""
  },
  {
    "id": 5180,
    "hadith_number": 5180,
    "tajuk_hadith": "Orang Mukmin Makan dengan Satu Perut, Orang Kafir dengan Tujuh Perut",
    "perawi_melayu": "Diriwayatkan oleh Ibn `Umar:",
    "english_text": "Allah's Messenger (ﷺ) said, \"A believer eats in one intestine (is satisfied with a little food), and a kafir \n(unbeliever) or a hypocrite eats in seven intestines (eats too much).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا عَبْدَةُ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ الْمُؤْمِنَ يَأْكُلُ فِي مِعًى وَاحِدٍ، وَإِنَّ الْكَافِرَ ـ أَوِ الْمُنَافِقَ فَلاَ أَدْرِي أَيَّهُمَا قَالَ عُبَيْدُ اللَّهِ ـ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ ‏\"‏‏.‏ وَقَالَ ابْنُ بُكَيْرٍ حَدَّثَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda, \"Seorang mukmin makan dengan satu perut (berpuas dengan sedikit makanan), dan seorang kafir (orang yang tidak beriman) atau munafik makan dengan tujuh perut (makan terlalu banyak).\""
  },
  {
    "id": 5181,
    "hadith_number": 5181,
    "tajuk_hadith": "Seorang Kafir Makan dengan Tujuh Usus",
    "perawi_melayu": "Diriwayatkan oleh 'Amr:",
    "english_text": "Abu Nahik was avaricious eater. Ibn `Umar said to him, \"Allah's Messenger (ﷺ) said, \"A Kafir (unbeliever) \neats in seven intestines (eats much).\" On that Abu Nahik said, \"But I believe in Allah and His Apostle \n.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، قَالَ كَانَ أَبُو نَهِيكٍ رَجُلاً أَكُولاً فَقَالَ لَهُ ابْنُ عُمَرَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الْكَافِرَ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ ‏\"‏‏.‏ فَقَالَ فَأَنَا أُومِنُ بِاللَّهِ وَرَسُولِهِ‏.‏",
    "malay_translation": "Abu Nahik adalah seorang yang kuat makan. Ibnu 'Umar berkata kepadanya, \"Rasulullah (ﷺ) bersabda, 'Seorang kafir (orang yang tidak beriman) makan dengan tujuh usus (makan banyak).'\" Mendengar itu, Abu Nahik berkata, \"Tetapi aku beriman kepada Allah dan Rasul-Nya.\""
  },
  {
    "id": 5182,
    "hadith_number": 5182,
    "tajuk_hadith": "Seorang Muslim Makan dengan Satu Perut, Manakala Kafir dengan Tujuh Perut",
    "perawi_melayu": "Diriwayatkan oleh Abu Huraira",
    "english_text": "Allah's Messenger (ﷺ) said, \"A Muslim eats in one intestine (i.e. he is satisfied with a little food) while a \nKafir (unbeliever) eats in seven intestines (eats much).",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَأْكُلُ الْمُسْلِمُ فِي مِعًى وَاحِدٍ، وَالْكَافِرُ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda, \"Seorang Muslim makan dengan satu perut (iaitu dia berasa puas dengan sedikit makanan), manakala seorang Kafir (orang yang tidak beriman) makan dengan tujuh perut (makan banyak).\""
  },
  {
    "id": 5183,
    "hadith_number": 5183,
    "tajuk_hadith": "Perbezaan Pemakanan antara Mukmin dan Kafir",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "A man used to eat much, but when he embraced Islam, he started eating less. That was mentioned to the Prophet (ﷺ) who then said, \"A believer eats in one intestine (is satisfied with a little food) and a Kafir eats in seven intestines (eats much). \"",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً، كَانَ يَأْكُلُ أَكْلاً كَثِيرًا، فَأَسْلَمَ فَكَانَ يَأْكُلُ أَكْلاً قَلِيلاً، فَذُكِرَ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ إِنَّ الْمُؤْمِنَ يَأْكُلُ فِي مِعًى وَاحِدٍ، وَالْكَافِرَ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ ‏\"‏‏.‏",
    "malay_translation": "Seorang lelaki dahulunya makan dengan banyak, tetapi apabila dia memeluk Islam, dia mula makan dengan sedikit. Perkara itu diceritakan kepada Nabi (ﷺ) lalu baginda bersabda, \"Seorang mukmin makan dalam satu perut (berasa cukup dengan sedikit makanan) dan seorang kafir makan dalam tujuh perut (makan dengan banyak).\""
  },
  {
    "id": 5184,
    "hadith_number": 5184,
    "tajuk_hadith": "Nabi SAW Tidak Makan Sambil Bersandar",
    "perawi_melayu": "Diriwayatkan oleh Abu Juhaifa:",
    "english_text": "Allah's Messenger (ﷺ) said, \"I do not take my meals while leaning (against something).",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مِسْعَرٌ، عَنْ عَلِيِّ بْنِ الأَقْمَرِ، سَمِعْتُ أَبَا جُحَيْفَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ آكُلُ مُتَّكِئًا ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Aku tidak makan sambil bersandar (pada sesuatu).\""
  },
  {
    "id": 5185,
    "hadith_number": 5185,
    "tajuk_hadith": "Nabi SAW Tidak Makan Sambil Bersandar",
    "perawi_melayu": "Abu Juhaifa (RA)",
    "english_text": "While I was with the Prophet (ﷺ) he said to a man who was with him, \"I do not take my meals while \nleaning.\"",
    "arabic_text": "حَدَّثَنِي عُثْمَانُ بْنُ أَبِي شَيْبَةَ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ عَلِيِّ بْنِ الأَقْمَرِ، عَنْ أَبِي جُحَيْفَةَ، قَالَ كُنْتُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ لِرَجُلٍ عِنْدَهُ ‏\n\"‏ لاَ آكُلُ وَأَنَا مُتَّكِئٌ ‏\"‏‏.‏",
    "malay_translation": "Semasa aku bersama Nabi (ﷺ), baginda bersabda kepada seorang lelaki yang ada bersama baginda, \"Aku tidak makan sambil bersandar.\""
  },
  {
    "id": 5186,
    "hadith_number": 5186,
    "tajuk_hadith": "Nabi ﷺ Enggan Makan Mastigure",
    "perawi_melayu": "Diriwayatkan oleh Khalid bin Al-Walid:",
    "english_text": "\"A roasted mastigure was brought to the Prophet (ﷺ) who stretched his hand towards it to eat it. But it was \nsaid to him, \"It is a mastigure.\" So he withdrew his hand. Khalid asked, \"Is it unlawful to eat?\" the \nProphet said, \"No, but it is not found in the land of my people and that is why I do not like eating it.\" \nSo Khalid started eating (it) while Allah's Messenger (ﷺ) was looking at him. An-Nadr said: 'Al-Khazira' (is \nprepared) from bran while 'Al-Harira' is prepared from milk.",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ خَالِدِ بْنِ الْوَلِيدِ، قَالَ أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِضَبٍّ مَشْوِيٍّ، فَأَهْوَى إِلَيْهِ لِيَأْكُلَ فَقِيلَ لَهُ إِنَّهُ ضَبٌّ، فَأَمْسَكَ يَدَهُ، فَقَالَ خَالِدٌ أَحَرَامٌ هُوَ قَالَ ‏\n\"‏ لاَ، وَلَكِنَّهُ لاَ يَكُونُ بِأَرْضِ قَوْمِي، فَأَجِدُنِي أَعَافُهُ ‏\"‏‏.‏ فَأَكَلَ خَالِدٌ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَنْظُرُ‏.‏ قَالَ مَالِكٌ عَنِ ابْنِ شِهَابٍ بِضَبٍّ مَحْنُوذٍ‏.‏",
    "malay_translation": "Satu ekor mastigure panggang dibawa kepada Nabi ﷺ. Baginda menghulurkan tangan untuk memakannya. Tetapi dikatakan kepada baginda, \"Itu mastigure.\" Lalu baginda menarik balik tangan baginda. Khalid bertanya, \"Adakah ia haram dimakan?\" Nabi ﷺ bersabda, \"Tidak, tetapi ia tidak terdapat di tanah kaumku dan itulah sebabnya aku tidak suka memakannya.\" Lalu Khalid pun memakannya sementara Rasulullah ﷺ melihatnya. An-Nadr berkata: 'Al-Khazira' (disediakan) daripada dedak sementara 'Al-Harira' disediakan daripada susu."
  },
  {
    "id": 5187,
    "hadith_number": 5187,
    "tajuk_hadith": "Keutamaan Mengucap Kalimah Syahadah",
    "perawi_melayu": "Daripada 'Itban bin Malik:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي مَحْمُودُ بْنُ الرَّبِيعِ الأَنْصَارِيُّ، أَنَّ عِتْبَانَ بْنَ مَالِكٍ ـ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم مِمَّنْ شَهِدَ بَدْرًا مِنَ الأَنْصَارِ ـ أَنَّهُ أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَنْكَرْتُ بَصَرِي وَأَنَا أُصَلِّي لِقَوْمِي، فَإِذَا كَانَتِ الأَمْطَارُ سَالَ الْوَادِي الَّذِي بَيْنِي وَبَيْنَهُمْ، لَمْ أَسْتَطِعْ أَنْ آتِيَ مَسْجِدَهُمْ فَأُصَلِّيَ لَهُمْ، فَوَدِدْتُ يَا رَسُولَ اللَّهِ أَنَّكَ تَأْتِي فَتُصَلِّي فِي بَيْتِي، فَأَتَّخِذُهُ مُصَلًّى‏.‏ فَقَالَ ‏\"‏ سَأَفْعَلُ إِنْ شَاءَ اللَّهُ ‏\"‏‏.‏ قَالَ عِتْبَانُ فَغَدَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ حِينَ ارْتَفَعَ النَّهَارُ، فَاسْتَأْذَنَ النَّبِيُّ صلى الله عليه وسلم فَأَذِنْتُ لَهُ فَلَمْ يَجْلِسْ حَتَّى دَخَلَ الْبَيْتَ، ثُمَّ قَالَ لِي ‏\"‏ أَيْنَ تُحِبُّ أَنْ أُصَلِّيَ مِنْ بَيْتِكَ ‏\"‏‏.‏ فَأَشَرْتُ إِلَى نَاحِيَةٍ مِنَ الْبَيْتِ فَقَامَ النَّبِيُّ صلى الله عليه وسلم فَكَبَّرَ، فَصَفَفْنَا، فَصَلَّى رَكْعَتَيْنِ، ثُمَّ سَلَّمَ وَحَبَسْنَاهُ عَلَى خَزِيرٍ صَنَعْنَاهُ، فَثَابَ فِي الْبَيْتِ رِجَالٌ مِنْ أَهْلِ الدَّارِ ذَوُو عَدَدٍ فَاجْتَمَعُوا، فَقَالَ قَائِلٌ مِنْهُمْ أَيْنَ مَالِكُ بْنُ الدُّخْشُنِ فَقَالَ بَعْضُهُمْ ذَلِكَ مُنَافِقٌ لاَ يُحِبُّ اللَّهَ وَرَسُولَهُ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ تَقُلْ، أَلاَ تَرَاهُ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ يُرِيدُ بِذَلِكَ وَجْهَ اللَّهِ ‏\"‏‏.‏ قَالَ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ قُلْنَا فَإِنَّا نَرَى وَجْهَهُ وَنَصِيحَتَهُ إِلَى الْمُنَافِقِينَ‏.‏ فَقَالَ ‏\"‏ فَإِنَّ اللَّهَ حَرَّمَ عَلَى النَّارِ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ يَبْتَغِي بِذَلِكَ وَجْهَ اللَّهِ ‏\"‏‏.‏ قَالَ ابْنُ شِهَابٍ ثُمَّ سَأَلْتُ الْحُصَيْنَ بْنَ مُحَمَّدٍ الأَنْصَارِيَّ أَحَدَ بَنِي سَالِمٍ وَكَانَ مِنْ سَرَاتِهِمْ عَنْ حَدِيثِ مَحْمُودٍ فَصَدَّقَهُ‏.‏",
    "malay_translation": "Daripada 'Itban bin Malik رضي الله عنه, yang turut serta dalam peperangan Badr dan dari kalangan Ansar, bahawa dia datang kepada Nabi ﷺ dan berkata, “Wahai Rasulullah! Sesungguhnya penglihatan saya telah hilang, dan saya mengimami kaum saya dalam solat. Apabila hujan turun, lembah di antara saya dan kaum saya dipenuhi air, dan saya tidak dapat pergi ke masjid mereka untuk mengimami mereka dalam solat. Wahai Rasulullah ﷺ! Saya berharap agar Tuan dapat datang dan solat di rumah saya agar saya boleh menjadikannya sebagai tempat solat.” Nabi ﷺ bersabda, “Insya-Allah, akan saya lakukan.” Pada keesokan harinya, tidak lama selepas matahari terbit, Rasulullah ﷺ datang bersama Abu Bakr. Nabi ﷺ meminta izin untuk masuk, dan saya mengizinkannya. Nabi ﷺ belum duduk lagi sehinggalah baginda masuk ke dalam rumah dan berkata kepada saya, “Di manakah kamu mahu saya solat di dalam rumahmu?” Saya menunjuk ke suatu tempat di dalam rumah saya. Baginda berdiri dan mengucapkan, “Allahu Akbar.” Kami berbaris di belakang baginda, dan baginda solat dua rakaat dan mengakhirinya dengan Taslim. Kemudian kami memintanya untuk tinggal untuk menikmati hidangan khas Khazirah yang telah kami sediakan. Sejumlah besar lelaki dari kawasan berdekatan berkumpul di rumah tersebut. Salah seorang daripada mereka berkata, “Di manakah Malik bin Ad-Dukhshun?” Lelaki lain berkata, “Dia seorang munafik dan tidak mencintai Allah dan Rasul-Nya.” Nabi ﷺ bersabda, “Janganlah berkata demikian. Tidakkah kamu melihatnya berkata: ‘Tiada Tuhan yang berhak disembah melainkan Allah,’ dengan mencari keredhaan Allah?” Lelaki itu berkata, “Allah dan Rasul-Nya lebih mengetahui, tetapi kami sentiasa melihatnya bergaul dengan orang munafik dan memberi mereka nasihat.” Nabi ﷺ bersabda, “Sesungguhnya Allah mengharamkan (Api Neraka) bagi mereka yang bersaksi bahawa tiada Tuhan yang berhak disembah melainkan Allah, dengan mencari keredhaan Allah.”"
  },
  {
    "id": 5188,
    "hadith_number": 5188,
    "tajuk_hadith": "Nabi ﷺ Menerima Mastigures, Iqt dan Susu daripada Mak Cik Baginda",
    "perawi_melayu": "Diriwayatkan oleh Ibnu Abbas:",
    "english_text": "My aunt presented (roasted) mastigures, Iqt and milk to the Prophet (ﷺ) . The mastigures were put on his \ndining sheet, and if it was unlawful to eat, it would not have been put there. The Prophet (ﷺ) drank the \nmilk and ate the Iqt only.",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ أَهْدَتْ خَالَتِي إِلَى النَّبِيِّ صلى الله عليه وسلم ضِبَابًا وَأَقِطًا وَلَبَنًا، فَوُضِعَ الضَّبُّ عَلَى مَائِدَتِهِ، فَلَوْ كَانَ حَرَامًا لَمْ يُوضَعْ وَشَرِبَ اللَّبَنَ، وَأَكَلَ الأَقِطَ‏.‏",
    "malay_translation": "Mak saudara saya menghadiahkan mastigures (dipanggang), Iqt dan susu kepada Nabi (ﷺ). Mastigures tersebut diletakkan di atas hamparan makanan baginda, dan jika haram untuk dimakan, ia tidak akan diletakkan di situ. Nabi (ﷺ) meminum susu dan hanya memakan Iqt."
  },
  {
    "id": 5189,
    "hadith_number": 5189,
    "tajuk_hadith": "Kegembiraan Kami pada Hari Jumaat",
    "perawi_melayu": "Diriwayatkan oleh Sahl bin Sa`d:",
    "english_text": "We used to be happy on Fridays, for there was an old lady who used to pull out the roots of Silq and \nput it in a cooking pot with some barley. When we had finished the prayer, we would visit her and she \nwould present that dish before us. So we used to be happy on Fridays because of that, and we never \nused to take our meals or have a mid-day nap except after the Friday prayer. By Allah, that meal \ncontained no fat.",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ إِنْ كُنَّا لَنَفْرَحُ بِيَوْمِ الْجُمُعَةِ، كَانَتْ لَنَا عَجُوزٌ تَأْخُذُ أُصُولَ السِّلْقِ، فَتَجْعَلُهُ فِي قِدْرٍ لَهَا، فَتَجْعَلُ فِيهِ حَبَّاتٍ مِنْ شَعِيرٍ، إِذَا صَلَّيْنَا زُرْنَاهَا فَقَرَّبَتْهُ إِلَيْنَا، وَكُنَّا نَفْرَحُ بِيَوْمِ الْجُمُعَةِ مِنْ أَجْلِ ذَلِكَ، وَمَا كُنَّا نَتَغَدَّى وَلاَ نَقِيلُ إِلاَّ بَعْدَ الْجُمُعَةِ، وَاللَّهِ مَا فِيهِ شَحْمٌ وَلاَ وَدَكٌ‏.‏",
    "malay_translation": "Kami dahulu bergembira pada hari Jumaat, kerana ada seorang nenek yang biasa mencabut akar Silq dan meletakkannya di dalam periuk dengan sedikit barli. Apabila kami selesai solat, kami akan menziarahinya dan dia akan menghidangkan hidangan itu kepada kami. Maka kami bergembira pada hari Jumaat kerana hal itu, dan kami tidak pernah makan atau tidur tengah hari kecuali selepas solat Jumaat. Demi Allah, hidangan itu tidak mengandungi lemak."
  },
  {
    "id": 5190,
    "hadith_number": 5190,
    "tajuk_hadith": "Nabi ﷺ Makan Daging Bahu dan Solat Tanpa Berwudhu' Semula",
    "perawi_melayu": "Diriwayatkan oleh Ibn 'Abbas:",
    "english_text": "The Prophet (ﷺ) ate of the meat of a shoulder (by cutting the meat with \n     his teeth), and then got up and offered the prayer without performing \n     the ablution anew.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ تَعَرَّقَ رَسُولُ اللَّهِ صلى الله عليه وسلم كَتِفًا، ثُمَّ قَامَ فَصَلَّى، وَلَمْ يَتَوَضَّأْ‏.‏",
    "malay_translation": "Nabi ﷺ telah makan daging bahu (dengan mengoyakkannya dengan gigi), kemudian bangun dan menunaikan solat tanpa berwudhu' semula."
  },
  {
    "id": 5191,
    "hadith_number": 5191,
    "tajuk_hadith": "Nabi ﷺ Makan Daging dari Periuk Kemudian Solat Tanpa Wuduk Semula",
    "perawi_melayu": "Diriwayatkan oleh Ibnu 'Abbas:",
    "english_text": "The Prophet (ﷺ) took out a bone \n     with meat on it from a cooking pot and ate of it, and then offered the\n     prayer without performing ablution anew.",
    "arabic_text": "وَعَنْ أَيُّوبَ، وَعَاصِمٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ انْتَشَلَ النَّبِيُّ صلى الله عليه وسلم عَرْقًا مِنْ قِدْرٍ فَأَكَلَ، ثُمَّ صَلَّى، وَلَمْ يَتَوَضَّأْ‏.‏",
    "malay_translation": "Nabi ﷺ mengeluarkan tulang dengan daging daripadanya dari periuk memasak dan memakannya, kemudian menunaikan solat tanpa mengambil wuduk semula."
  },
  {
    "id": 5192,
    "hadith_number": 5192,
    "tajuk_hadith": "Berangkat ke Mekah Bersama Nabi",
    "perawi_melayu": "Diriwayatkan oleh Abu Qatada:",
    "english_text": "We went out towards Mecca with the Prophet.",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنِي عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا فُلَيْحٌ، حَدَّثَنَا أَبُو حَازِمٍ الْمَدَنِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، قَالَ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم نَحْوَ مَكَّةَ‏.‏",
    "malay_translation": "Kami keluar menuju ke Mekah bersama Nabi ﷺ."
  },
  {
    "id": 5193,
    "hadith_number": 5193,
    "tajuk_hadith": "Kisah Memburu Onager Semasa dalam Ihram",
    "perawi_melayu": "Diriwayatkan daripada Abu Qatada:",
    "english_text": "Once, while I was sitting with the companions of the Prophet (ﷺ) at a station on the road to Mecca and \nAllah's Messenger (ﷺ) was stationing ahead of us and all the people were assuming Ihram while I was not. \nMy companion, saw an onager while I was busy Mending my shoes. They did not Inform me of the \nonager but they wished that I would see it Suddenly I looked and saw the onager Then I headed \ntowards my horse, saddled it and rode, but I forgot to take the lash and the spear. So I said to them my \ncompanions), \"Give me the lash and the spear.\" But they said, \"No, by Allah we will not help you in \nany way to hunt it ' I got angry, dismounted, took it the spear and the lash), rode (the horse chased the \nonager and wounded it Then I brought it when it had dyed. My companions started eating of its \n(cooked) meat, but they suspected that it might be unlawful to eat of its meat while they were in a \nstate of Ihram Then I proceeded further and I kept one of its forelegs with me. When we met Allah's \nApostle we asked him about that. He said, \"Have you some of its meat with you?\" I gave him that \nforeleg and he ate the meat till he stripped the bone of its flesh although he was in a state of Ihram.",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ أَبِي حَازِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ السَّلَمِيِّ، عَنْ أَبِيهِ، أَنَّهُ قَالَ كُنْتُ يَوْمًا جَالِسًا مَعَ رِجَالٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فِي مَنْزِلٍ فِي طَرِيقِ مَكَّةَ، وَرَسُولُ اللَّهِ صلى الله عليه وسلم نَازِلٌ أَمَامَنَا، وَالْقَوْمُ مُحْرِمُونَ وَأَنَا غَيْرُ مُحْرِمٍ، فَأَبْصَرُوا حِمَارًا وَحْشِيًّا وَأَنَا مَشْغُولٌ أَخْصِفُ نَعْلِي، فَلَمْ يُؤْذِنُونِي لَهُ، وَأَحَبُّوا لَوْ أَنِّي أَبْصَرْتُهُ، فَالْتَفَتُّ فَأَبْصَرْتُهُ فَقُمْتُ إِلَى الْفَرَسِ فَأَسْرَجْتُهُ‏.‏ ثُمَّ رَكِبْتُ وَنَسِيتُ السَّوْطَ وَالرُّمْحَ فَقُلْتُ لَهُمْ نَاوِلُونِي السَّوْطَ وَالرُّمْحَ‏.‏ فَقَالُوا لاَ وَاللَّهِ لاَ نُعِينُكَ عَلَيْهِ بِشَىْءٍ‏.‏ فَغَضِبْتُ فَنَزَلْتُ فَأَخَذْتُهُمَا، ثُمَّ رَكِبْتُ فَشَدَدْتُ عَلَى الْحِمَارِ فَعَقَرْتُهُ، ثُمَّ جِئْتُ بِهِ وَقَدْ مَاتَ فَوَقَعُوا فِيهِ يَأْكُلُونَهُ، ثُمَّ إِنَّهُمْ شَكُّوا فِي أَكْلِهِمْ إِيَّاهُ وَهُمْ حُرُمٌ، فَرُحْنَا وَخَبَأْتُ الْعَضُدَ مَعِي، فَأَدْرَكْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَسَأَلْنَاهُ عَنْ ذَلِكَ فَقَالَ ‏\n\"‏ مَعَكُمْ مِنْهُ شَىْءٌ ‏\"‏‏.‏ فَنَاوَلْتُهُ الْعَضُدَ فَأَكَلَهَا حَتَّى تَعَرَّقَهَا، وَهْوَ مُحْرِمٌ‏.‏ قَالَ ابْنُ جَعْفَرٍ وَحَدَّثَنِي زَيْدُ بْنُ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي قَتَادَةَ مِثْلَهُ‏.‏",
    "malay_translation": "Pada suatu hari, ketika aku sedang duduk bersama para sahabat Nabi (ﷺ) di sebuah tempat dalam perjalanan ke Mekah, Rasulullah (ﷺ) berada di hadapan kami, dan semua orang dalam keadaan ber-Ihram, sementara aku tidak. Sahabatku, melihat seekor onager ketika aku sedang sibuk membaiki kasutku. Mereka tidak memaklumkan kepadaku tentang onager itu tetapi mereka berharap aku akan melihatnya. Tiba-tiba aku memandang dan melihat onager itu. Kemudian aku menuju ke arah kudaku, memasangnya pelana dan menungganginya, tetapi aku terlupa untuk mengambil cambuk dan lembing. Jadi aku berkata kepada mereka (sahabatku), \"Berikan aku cambuk dan lembing.\" Tetapi mereka berkata, \"Tidak, demi Allah kami tidak akan membantumu dalam apa jua cara untuk memburunya.\" Aku marah, turun dari kuda, mengambil lembing dan cambuk, menunggang (kuda itu mengejar onager dan mencederakannya) Kemudian aku membawanya ketika ia telah mati. Sahabatku mula memakan dagingnya (yang dimasak), tetapi mereka mengesyaki bahawa adalah haram untuk memakan dagingnya ketika mereka dalam keadaan ber-Ihram. Kemudian aku meneruskan perjalanan dan aku menyimpan salah satu kaki depannya bersamaku. Apabila kami bertemu dengan Rasulullah (ﷺ) kami bertanya kepadanya tentang perkara itu. Baginda bersabda, \"Adakah kamu mempunyai sedikit dagingnya bersamamu?\" Aku memberikan kaki depan itu kepada baginda dan baginda memakan daging itu sehingga baginda mengikis tulang daripada isinya walaupun baginda dalam keadaan ber-Ihram."
  },
  {
    "id": 5194,
    "hadith_number": 5194,
    "tajuk_hadith": "Nabi (ﷺ) Memegang Bahu Kambing dan Bersolat Tanpa Wuduk Semula",
    "perawi_melayu": "Diriwayatkan oleh `Amr bin Umaiyya",
    "english_text": "that he saw the Prophet (ﷺ) holding a shoulder piece of mutton in his hand and cutting part of it with a \nknife. Then he was called for the prayer whereupon he put down the shoulder piece and the knife with \nwhich he was cutting it, and then stood for prayer without performing ablution again.",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي جَعْفَرُ بْنُ عَمْرِو بْنِ أُمَيَّةَ، أَنَّ أَبَاهُ، عَمْرَو بْنَ أُمَيَّةَ أَخْبَرَهُ أَنَّهُ، رَأَى النَّبِيَّ صلى الله عليه وسلم يَحْتَزُّ مِنْ كَتِفِ شَاةٍ فِي يَدِهِ، فَدُعِيَ إِلَى الصَّلاَةِ فَأَلْقَاهَا وَالسِّكِّينَ الَّتِي يَحْتَزُّ بِهَا، ثُمَّ قَامَ فَصَلَّى، وَلَمْ يَتَوَضَّأْ‏.‏",
    "malay_translation": "Bahawa dia melihat Nabi (ﷺ) memegang sepotong bahu kambing dalam tangannya dan memotong sebahagian daripadanya dengan pisau. Kemudian beliau dipanggil untuk solat, maka baginda meletakkan potongan bahu dan pisau yang digunakan untuk memotongnya, kemudian berdiri untuk solat tanpa berwuduk semula."
  },
  {
    "id": 5195,
    "hadith_number": 5195,
    "tajuk_hadith": "Sifat Nabi ﷺ dalam Menghadapi Makanan",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) never criticized any food (he was invited to) but he used to eat if he liked the food, and \nleave it if he disliked it.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ مَا عَابَ النَّبِيُّ صلى الله عليه وسلم طَعَامًا قَطُّ، إِنِ اشْتَهَاهُ أَكَلَهُ، وَإِنْ كَرِهَهُ تَرَكَهُ‏.‏",
    "malay_translation": "Nabi ﷺ tidak pernah mencela sebarang makanan (yang dihidangkan kepadanya). Baginda akan makan jika menyukai makanan tersebut, dan meninggalkannya jika tidak menyukainya."
  },
  {
    "id": 5196,
    "hadith_number": 5196,
    "tajuk_hadith": "Penggunaan Tepung Semasa Zaman Nabi (ﷺ)",
    "perawi_melayu": "Diriwayatkan oleh Abu Hazim:",
    "english_text": "that he asked Sahl, \"Did you use white flour during the lifetime of the Prophet (ﷺ) ?\" Sahl replied, \"No. \nHazim asked, \"Did you use to sift barley flour?\" He said, \"No, but we used to blow off the husk (of \nthe barley).",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، أَنَّهُ سَأَلَ سَهْلاً هَلْ رَأَيْتُمْ فِي زَمَانِ النَّبِيِّ صلى الله عليه وسلم النَّقِيَّ قَالَ لاَ‏.‏ فَقُلْتُ فَهَلْ كُنْتُمْ تَنْخُلُونَ الشَّعِيرَ قَالَ لاَ وَلَكِنْ كُنَّا نَنْفُخُهُ‏.‏",
    "malay_translation": "Bahawa dia bertanya kepada Sahl, \"Adakah kamu menggunakan tepung putih semasa zaman Nabi (ﷺ)?\" Sahl menjawab, \"Tidak.\nHazim bertanya, \"Adakah kamu pernah menapis tepung barli?\" Dia berkata, \"Tidak, tetapi kami meniup hampas (barli) untuk memisahkannya."
  },
  {
    "id": 5197,
    "hadith_number": 5197,
    "tajuk_hadith": "Kisah Nabi (ﷺ) Mengagihkan Kurma",
    "perawi_melayu": "Diriwayatkan oleh Abu Huraira:",
    "english_text": "Once the Prophet (ﷺ) distributed dates among his companions and gave each one seven dates. He gave me \nseven dates too, one of which was dry and hard, but none of the other dates was more liked by me \nthan that one, for it prolonged my chewing it.",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَبَّاسٍ الْجُرَيْرِيِّ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَسَمَ النَّبِيُّ صلى الله عليه وسلم يَوْمًا بَيْنَ أَصْحَابِهِ تَمْرًا، فَأَعْطَى كُلَّ إِنْسَانٍ سَبْعَ تَمَرَاتٍ، فَأَعْطَانِي سَبْعَ تَمَرَاتٍ إِحْدَاهُنَّ حَشَفَةٌ، فَلَمْ يَكُنْ فِيهِنَّ تَمْرَةٌ أَعْجَبَ إِلَىَّ مِنْهَا، شَدَّتْ فِي مَضَاغِي‏.‏",
    "malay_translation": "Pada suatu ketika, Nabi (ﷺ) mengagihkan kurma kepada para sahabatnya dan memberi setiap orang tujuh biji kurma. Baginda juga memberi saya tujuh biji kurma, salah satunya kering dan keras, tetapi tidak ada kurma lain yang lebih saya sukai daripada yang itu, kerana ia memanjangkan waktu saya mengunyahnya."
  },
  {
    "id": 5198,
    "hadith_number": 5198,
    "tajuk_hadith": "Kesukaran Hidup di Awal Islam dan Pengajaran Sa`d",
    "perawi_melayu": "Sahabat Sa`d r.a.",
    "english_text": "I was one of (the first) seven (who had embraced Islam) with Allah's Messenger (ﷺ) and we had nothing to \neat then, except the leaves of the Habala or Hubula tree, so that our stool used to be similar to that of \nsheep. Now the tribe of Bani Asad wants to teach me Islam; I would be a loser and all my efforts \nwould be in vain (if I learn Islam anew from them).",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، عَنْ سَعْدٍ، قَالَ رَأَيْتُنِي سَابِعَ سَبْعَةٍ مَعَ النَّبِيِّ صلى الله عليه وسلم مَا لَنَا طَعَامٌ إِلاَّ وَرَقُ الْحُبْلَةِ ـ أَوِ الْحَبَلَةِ ـ حَتَّى يَضَعَ أَحَدُنَا مَا تَضَعُ الشَّاةُ، ثُمَّ أَصْبَحَتْ بَنُو أَسَدٍ تُعَزِّرُنِي عَلَى الإِسْلاَمِ، خَسِرْتُ إِذًا وَضَلَّ سَعْيِي‏.‏",
    "malay_translation": "Saya adalah salah seorang daripada tujuh orang pertama yang memeluk Islam bersama Rasulullah ﷺ. Ketika itu, kami tidak mempunyai makanan melainkan daun pokok Habala atau Hubula, sehingga najis kami menyerupai najis kambing. Sekarang, kaum Bani Asad mahu mengajar saya tentang Islam; saya akan menjadi orang yang rugi dan segala usaha saya akan sia-sia (jika saya mempelajari Islam semula daripada mereka)."
  },
  {
    "id": 5199,
    "hadith_number": 5199,
    "tajuk_hadith": "Rasulullah (ﷺ) Tidak Pernah Makan Tepung Putih yang Diayak",
    "perawi_melayu": "Diriwayatkan oleh Abu Hazim:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، عَنْ أَبِي حَازِمٍ، قَالَ سَأَلْتُ سَهْلَ بْنَ سَعْدٍ فَقُلْتُ هَلْ أَكَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم النَّقِيَّ فَقَالَ سَهْلٌ مَا رَأَى رَسُولُ اللَّهِ صلى الله عليه وسلم النَّقِيَّ مِنْ حِينَ ابْتَعَثَهُ اللَّهُ حَتَّى قَبَضَهُ اللَّهُ‏.‏ قَالَ فَقُلْتُ هَلْ كَانَتْ لَكُمْ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم مَنَاخِلُ قَالَ مَا رَأَى رَسُولُ اللَّهِ صلى الله عليه وسلم مُنْخُلاً مِنْ حِينَ ابْتَعَثَهُ اللَّهُ حَتَّى قَبَضَهُ‏.‏ قَالَ قُلْتُ كَيْفَ كُنْتُمْ تَأْكُلُونَ الشَّعِيرَ غَيْرَ مَنْخُولٍ قَالَ كُنَّا نَطْحَنُهُ وَنَنْفُخُهُ، فَيَطِيرُ مَا طَارَ وَمَا بَقِيَ ثَرَّيْنَاهُ فَأَكَلْنَاهُ‏.‏",
    "malay_translation": "Saya bertanya kepada Sahl bin Sa`d, \"Adakah Rasulullah (ﷺ) pernah makan tepung putih?\" Sahl menjawab, \"Rasulullah (ﷺ) tidak pernah melihat tepung putih sejak Allah mengutusnya sebagai Rasul sehingga Allah mewafatkannya.\" Saya bertanya, \"Adakah orang ramai mempunyai (menggunakan) ayak semasa zaman Rasulullah (ﷺ)?\" Sahl berkata, \"Rasulullah (ﷺ) tidak pernah melihat (menggunakan) ayak sejak Allah mengutusnya sebagai Rasul sehingga Allah mewafatkannya.\" Saya bertanya, \"Bagaimanakah kamu makan barli yang tidak diayak?\" Beliau berkata, \"Kami mengisarnya dan kemudian meniup kulitnya, dan selepas kulitnya terbang, kami menyediakan doh (membakar) dan memakannya.\""
  },
  {
    "id": 5200,
    "hadith_number": 5200,
    "tajuk_hadith": "Rasulullah ﷺ Meninggal Dunia Tanpa Merasa Kenyang Dengan Roti Barli",
    "perawi_melayu": "Diriwayatkan daripada Abu Hurairah:",
    "english_text": "that he passed by a group of people in front of whom there was a roasted sheep. They invited him but \nhe refused to eat and said, \"Allah's Messenger (ﷺ) left this world without satisfying his hunger even with \nbarley bread.\"",
    "arabic_text": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ مَرَّ بِقَوْمٍ بَيْنَ أَيْدِيهِمْ شَاةٌ مَصْلِيَّةٌ، فَدَعَوْهُ فَأَبَى أَنْ يَأْكُلَ قَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنَ الدُّنْيَا وَلَمْ يَشْبَعْ مِنَ الْخُبْزِ الشَّعِيرِ‏.‏",
    "malay_translation": "Bahawa dia (Abu Hurairah) melalui sekumpulan orang yang di hadapan mereka terdapat seekor kambing panggang. Mereka menjemputnya (Abu Hurairah), tetapi dia enggan makan dan berkata, \"Rasulullah (ﷺ) meninggalkan dunia ini tanpa merasa kenyang walaupun dengan roti barli.\""
  },
  {
    "id": 5201,
    "hadith_number": 5201,
    "tajuk_hadith": "Cara Nabi ﷺ Makan",
    "perawi_melayu": "Diriwayatkan daripada Anas bin Malik:",
    "english_text": "The Prophet (ﷺ) never took his meals at a dining table, nor in small plates, and he never ate thin wellbaked \nbread. (The sub-narrator asked Qatada, \"Over what did they use to take their meals?\" Qatada \nsaid, \"On leather dining sheets.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي الأَسْوَدِ، حَدَّثَنَا مُعَاذٌ، حَدَّثَنِي أَبِي، عَنْ يُونُسَ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ مَا أَكَلَ النَّبِيُّ صلى الله عليه وسلم عَلَى خِوَانٍ، وَلاَ فِي سُكْرُجَةٍ، وَلاَ خُبِزَ لَهُ مُرَقَّقٌ‏.‏ قُلْتُ لِقَتَادَةَ عَلَى مَا يَأْكُلُونَ قَالَ عَلَى السُّفَرِ‏.‏",
    "malay_translation": "Nabi ﷺ tidak pernah makan di atas meja makan, atau di dalam pinggan kecil, dan baginda tidak pernah makan roti yang nipis dan dibakar dengan baik. (Perawi tambahan bertanya kepada Qatada, \"Di atas apa mereka makan?\" Qatada berkata, \"Di atas hamparan kulit.\")"
  },
  {
    "id": 5202,
    "hadith_number": 5202,
    "tajuk_hadith": "Keluarga Nabi Muhammad ﷺ Tidak Pernah Kenyang dengan Roti Gandum selama Tiga Hari Berturut-turut",
    "perawi_melayu": "Telah diriwayatkan daripada `Aisha رضي الله عنها:",
    "english_text": "The family of Muhammad had not eaten wheat bread to their satisfaction for three consecutive days \nsince his arrival at Medina till he died.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا شَبِعَ آلُ مُحَمَّدٍ صلى الله عليه وسلم مُنْذُ قَدِمَ الْمَدِينَةَ مِنْ طَعَامِ الْبُرِّ ثَلاَثَ لَيَالٍ تِبَاعًا، حَتَّى قُبِضَ‏.‏",
    "malay_translation": "Keluarga Muhammad ﷺ tidak pernah makan roti gandum sehingga kenyang selama tiga malam berturut-turut sejak kedatangan baginda ke Madinah sehinggalah baginda wafat."
  },
  {
    "id": 5203,
    "hadith_number": 5203,
    "tajuk_hadith": "Talbina Melegakan Hati Pesakit",
    "perawi_melayu": "Diriwayatkan daripada `Aisha:",
    "english_text": "(the wife of the Prophet) that whenever one of her relatives died, the women assembled and then \ndispersed (returned to their houses) except her relatives and close friends. She would order that a pot \nof Talbina be cooked. Then Tharid (a dish prepared from meat and bread) would be prepared and the \nTalbina would be poured on it. `Aisha would say (to the women),\"Eat of it, for I heard Allah's Messenger (ﷺ) \nsaying, 'The Talbina soothes the heart of the patient and relieves him from some of his sadness.' \"",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا كَانَتْ إِذَا مَاتَ الْمَيِّتُ مِنْ أَهْلِهَا فَاجْتَمَعَ لِذَلِكَ النِّسَاءُ، ثُمَّ تَفَرَّقْنَ، إِلاَّ أَهْلَهَا وَخَاصَّتَهَا، أَمَرَتْ بِبُرْمَةٍ مِنْ تَلْبِينَةٍ فَطُبِخَتْ، ثُمَّ صُنِعَ ثَرِيدٌ فَصُبَّتِ التَّلْبِينَةُ عَلَيْهَا ثُمَّ قَالَتْ كُلْنَ مِنْهَا فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ التَّلْبِينَةُ مَجَمَّةٌ لِفُؤَادِ الْمَرِيضِ، تَذْهَبُ بِبَعْضِ الْحُزْنِ ‏\"‏‏.‏",
    "malay_translation": "Daripada 'Aisha (isteri Nabi) bahawa apabila salah seorang daripada kaum keluarganya meninggal dunia, kaum wanita berkumpul kemudian bersurai (pulang ke rumah masing-masing) kecuali kaum keluarganya dan sahabat-sahabat karibnya. Beliau akan memerintahkan supaya dimasak satu periuk Talbina. Kemudian Tharid (hidangan yang disediakan daripada daging dan roti) akan disediakan dan Talbina akan dituang ke atasnya. 'Aisha akan berkata (kepada wanita-wanita itu), \"Makanlah daripadanya, kerana aku mendengar Rasulullah ﷺ bersabda, 'Talbina melegakan hati orang yang sakit dan menghilangkan sebahagian daripada kesedihannya.'\""
  },
  {
    "id": 5204,
    "hadith_number": 5204,
    "tajuk_hadith": "Kesempurnaan Wanita: Maryam dan Asia",
    "perawi_melayu": "Diriwayatkan oleh Abu Musa Al-Ash'ari:",
    "english_text": "The Prophet (ﷺ) said, \"Many men reached perfection but none among the women reached perfection \nexcept Mary, the daughter of ' `Imran, and Asia, Pharoah's wife. And the superiority of `Aisha to other \nwomen is like the superiority of Tharid to other kinds of food.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ الْجَمَلِيِّ، عَنْ مُرَّةَ الْهَمْدَانِيِّ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ كَمَلَ مِنَ الرِّجَالِ كَثِيرٌ، وَلَمْ يَكْمُلْ مِنَ النِّسَاءِ إِلاَّ مَرْيَمُ بِنْتُ عِمْرَانَ وَآسِيَةُ امْرَأَةُ فِرْعَوْنَ، وَفَضْلُ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda, \"Ramai lelaki mencapai kesempurnaan tetapi tiada seorang pun dalam kalangan wanita yang mencapai kesempurnaan kecuali Maryam, anak perempuan 'Imran, dan Asia, isteri Firaun. Dan kelebihan 'Aishah ke atas wanita lain adalah seperti kelebihan Tharid ke atas jenis makanan lain."
  },
  {
    "id": 5205,
    "hadith_number": 5205,
    "tajuk_hadith": "Keutamaan Aisyah di antara Wanita",
    "perawi_melayu": "Diriwayatkan oleh Anas:",
    "english_text": "The Prophet (ﷺ) said, \"The superiority of `Aisha to other women is like the superiority of Tharid to other \nkinds of food . \"",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ أَبِي طُوَالَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ فَضْلُ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda, \"Keutamaan Aisyah ke atas wanita lain adalah seperti keutamaan Tharid ke atas jenis makanan yang lain.\""
  },
  {
    "id": 5206,
    "hadith_number": 5206,
    "tajuk_hadith": "Kecintaan Nabi (ﷺ) terhadap Labu",
    "perawi_melayu": "Diriwayatkan daripada Anas:",
    "english_text": "I went along with the Prophet (ﷺ) to the house of a young tailor of his. The tailor presented a dish of \nTharid to the Prophet (ﷺ) and resumed his work. The Prophet (ﷺ) started picking the pieces of gourd and I too, \nstarted picking them and putting it before him. Since then I have always loved (to eat) gourd.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُنِيرٍ، سَمِعَ أَبَا حَاتِمٍ الأَشْهَلَ بْنَ حَاتِمٍ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ ثُمَامَةَ بْنِ أَنَسٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ دَخَلْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم عَلَى غُلاَمٍ لَهُ خَيَّاطٍ، فَقَدَّمَ إِلَيْهِ قَصْعَةً فِيهَا ثَرِيدٌ ـ قَالَ ـ وَأَقْبَلَ عَلَى عَمَلِهِ ـ قَالَ ـ فَجَعَلَ النَّبِيُّ صلى الله عليه وسلم يَتَتَبَّعُ الدُّبَّاءَ ـ قَالَ ـ فَجَعَلْتُ أَتَتَبَّعُهُ فَأَضَعُهُ بَيْنَ يَدَيْهِ ـ قَالَ ـ فَمَا زِلْتُ بَعْدُ أُحِبُّ الدُّبَّاءَ‏.‏",
    "malay_translation": "Aku telah pergi bersama Nabi (ﷺ) ke rumah seorang tukang jahit muda. Tukang jahit itu menghidangkan semangkuk Tharid kepada Nabi (ﷺ) dan meneruskan kerjanya. Nabi (ﷺ) mula mengambil kepingan labu dan aku juga mula mengambilnya dan meletakkannya di hadapan baginda. Sejak itu aku sentiasa sukakan (memakan) labu."
  },
  {
    "id": 5207,
    "hadith_number": 5207,
    "tajuk_hadith": "Kehidupan Sederhana Nabi Muhammad (ﷺ)",
    "perawi_melayu": "Diriwayatkan oleh Qatada:",
    "english_text": "We used to visit Anas bin Malik while his baker was standing (and baking). Anas would say, \"Eat! I \ndo not know that the Prophet (ﷺ) had ever seen well-baked bread till he met Allah, nor had he ever seen a \nroasted sheep with his own eyes.\"",
    "arabic_text": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى، عَنْ قَتَادَةَ، قَالَ كُنَّا نَأْتِي أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ وَخَبَّازُهُ قَائِمٌ قَالَ كُلُوا فَمَا أَعْلَمُ النَّبِيَّ صلى الله عليه وسلم رَأَى رَغِيفًا مُرَقَّقًا حَتَّى لَحِقَ بِاللَّهِ، وَلاَ رَأَى شَاةً سَمِيطًا بِعَيْنِهِ قَطُّ‏.‏",
    "malay_translation": "Kami sering mengunjungi Anas bin Malik ketika tukang rotinya sedang berdiri (dan membakar roti). Anas akan berkata, \"Makanlah! Saya tidak tahu bahawa Nabi (ﷺ) pernah melihat roti yang dibakar dengan baik sehinggalah baginda bertemu Allah, dan baginda juga tidak pernah melihat kambing panggang dengan mata baginda sendiri.\""
  },
  {
    "id": 5208,
    "hadith_number": 5208,
    "tajuk_hadith": "Nabi ﷺ Makan Daging Kambing dan Solat Tanpa Wudhu' Baru",
    "perawi_melayu": "Daripada `Amr bin Umaiyay Ad-Damri:",
    "english_text": "I saw Allah's Messenger (ﷺ) cutting part of the shoulder of mutton with a knife. He ate of it and then was \ncalled for prayer whereupon he got up and put down the knife and offered the prayer without \nperforming new ablution.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ، عَنْ أَبِيهِ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَحْتَزُّ مِنْ كَتِفِ شَاةٍ، فَأَكَلَ مِنْهَا، فَدُعِيَ إِلَى الصَّلاَةِ، فَقَامَ فَطَرَحَ السِّكِّينَ فَصَلَّى، وَلَمْ يَتَوَضَّأْ‏.‏",
    "malay_translation": "Aku melihat Rasulullah ﷺ memotong sebahagian bahu kambing dengan pisau. Baginda memakannya, kemudian dipanggil untuk solat. Baginda bangun, meletakkan pisau dan menunaikan solat tanpa mengambil wudhu' baru."
  },
  {
    "id": 5209,
    "hadith_number": 5209,
    "tajuk_hadith": "Larangan Memakan Daging Korban Melebihi Tiga Hari",
    "perawi_melayu": "Diriwayatkan oleh `Abis:",
    "english_text": "I asked `Aisha \"Did the Prophet (ﷺ) forbid eating the meat of sacrifices offered on `Id-ul-Adha for more \nthan three days\" She said, \"The Prophet (ﷺ) did not do this except in the year when the people were \nhungry, so he wanted the rich to feed the poor. But later we used to store even a trotter of a sheep to \neat it fifteen days later.\" She was asked, \"What compelled you to do so?\" She smiled and said, \"The \nfamily of Muhammad did not eat to their satisfaction white bread with meat soup for three successive \ndays till he met Allah.\"",
    "arabic_text": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ، عَنْ أَبِيهِ، قَالَ قُلْتُ لِعَائِشَةَ أَنَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ تُؤْكَلَ لُحُومُ الأَضَاحِيِّ فَوْقَ ثَلاَثٍ قَالَتْ مَا فَعَلَهُ إِلاَّ فِي عَامٍ جَاعَ النَّاسُ فِيهِ، فَأَرَادَ أَنْ يُطْعِمَ الْغَنِيُّ الْفَقِيرَ، وَإِنْ كُنَّا لَنَرْفَعُ الْكُرَاعَ فَنَأْكُلُهُ بَعْدَ خَمْسَ عَشْرَةَ‏.‏ قِيلَ مَا اضْطَرَّكُمْ إِلَيْهِ فَضَحِكَتْ قَالَتْ مَا شَبِعَ آلُ مُحَمَّدٍ صلى الله عليه وسلم مِنْ خُبْزِ بُرٍّ مَأْدُومٍ ثَلاَثَةَ أَيَّامٍ حَتَّى لَحِقَ بِاللَّهِ‏.‏ وَقَالَ ابْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَابِسٍ بِهَذَا‏.‏",
    "malay_translation": "Aku bertanya kepada `Aisyah: \"Adakah Nabi (ﷺ) melarang memakan daging korban `Id-ul-Adha melebihi tiga hari?\" Dia berkata: \"Nabi (ﷺ) tidak berbuat demikian kecuali pada tahun ketika manusia kelaparan, maka baginda ingin orang kaya memberi makan kepada orang miskin. Tetapi kemudian kami menyimpan walaupun kaki kambing untuk memakannya lima belas hari kemudian.\" Dia ditanya, \"Apakah yang memaksa kamu berbuat demikian?\" Dia tersenyum dan berkata, \"Keluarga Muhammad tidak pernah makan roti putih bersama sup daging sehingga kenyang selama tiga hari berturut-turut sehingga baginda bertemu Allah.\""
  },
  {
    "id": 5210,
    "hadith_number": 5210,
    "tajuk_hadith": "Membawa Daging Haiwan Korban ke Madinah",
    "perawi_melayu": "Diriwayatkan oleh Jabir:",
    "english_text": "We used to carry the meat of the Hadis (sacrificed animals) to Medina during the life-time of the Prophet .",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ كُنَّا نَتَزَوَّدُ لُحُومَ الْهَدْىِ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم إِلَى الْمَدِينَةِ‏.‏ تَابَعَهُ مُحَمَّدٌ عَنِ ابْنِ عُيَيْنَةَ‏.‏ وَقَالَ ابْنُ جُرَيْجٍ قُلْتُ لِعَطَاءٍ أَقَالَ حَتَّى جِئْنَا الْمَدِينَةَ قَالَ لاَ‏.‏",
    "malay_translation": "Kami dahulu membawa daging haiwan korban (Hadis) ke Madinah pada zaman Nabi ﷺ."
  },
  {
    "id": 5211,
    "hadith_number": 5211,
    "tajuk_hadith": "Permintaan Rasulullah ﷺ kepada Abu Talha dan Perkahwinan dengan Safiyyah bint Huyai",
    "perawi_melayu": "Diriwayatkan oleh Anas bin Malik:",
    "english_text": "Allah's Messenger (ﷺ) said to Abu Talha, \"Seek one of your boys to serve me.\" Abu Talha mounted me \nbehind him (on his riding animal) and took me (to the Prophet (ﷺ) ). So I used to serve Allah's Messenger (ﷺ) \nwhenever he dismounted (to stay somewhere). I used to hear him saying very often, \"O Allah! I seek \nrefuge with You from, having worries sadness, helplessness, laziness, miserliness, cowardice, from \nbeing heavily in debt and from being overpowered by other persons unjustly.\" I kept on serving till we \n-returned from the battle of Khaibar. The Prophet (ﷺ) then brought Safiyya bint Huyai whom he had won \nfrom the war booty. I saw him folding up a gown or a garment for her to sit on behind him (on his shecamel). \nWhen he reached As-Sahba', he prepared Hais and placed it on a dining sheet. Then he sent \nme to invite men, who (came and) ate; and that was his and Safiyya's wedding banquet. Then the \nProphet proceeded, and when he saw (noticed) the mountain of Uhud, he said, \"This mountain loves \nus, and we love it.\" When we approached Medina, he said, \"O Allah! I make the area between its two \nmountains a sanctuary as Abraham has made Mecca a sanctuary. O Allah! Bless their Mudd and Sa \n(special kinds of measure).",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو، مَوْلَى الْمُطَّلِبِ بْنِ عَبْدِ اللَّهِ بْنِ حَنْطَبٍ أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لأَبِي طَلْحَةَ ‏\"‏ الْتَمِسْ غُلاَمًا مِنْ غِلْمَانِكُمْ يَخْدُمُنِي ‏\"‏‏.‏ فَخَرَجَ بِي أَبُو طَلْحَةَ، يُرْدِفُنِي وَرَاءَهُ، فَكُنْتُ أَخْدُمُ رَسُولَ اللَّهِ صلى الله عليه وسلم كُلَّمَا نَزَلَ، فَكُنْتُ أَسْمَعُهُ يُكْثِرُ أَنْ يَقُولَ ‏\"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ وَضَلَعِ الدَّيْنِ، وَغَلَبَةِ الرِّجَالِ ‏\"‏‏.‏ فَلَمْ أَزَلْ أَخْدُمُهُ حَتَّى أَقْبَلْنَا مِنْ خَيْبَرَ، وَأَقْبَلَ بِصَفِيَّةَ بِنْتِ حُيَىٍّ قَدْ حَازَهَا، فَكُنْتُ أَرَاهُ يُحَوِّي وَرَاءَهُ بِعَبَاءَةٍ أَوْ بِكِسَاءٍ، ثُمَّ يُرْدِفُهَا وَرَاءَهُ، حَتَّى إِذَا كُنَّا بِالصَّهْبَاءِ صَنَعَ حَيْسًا فِي نِطَعٍ، ثُمَّ أَرْسَلَنِي فَدَعَوْتُ رِجَالاً فَأَكَلُوا، وَكَانَ ذَلِكَ بِنَاءَهُ بِهَا، ثُمَّ أَقْبَلَ حَتَّى إِذَا بَدَا لَهُ أُحُدٌ قَالَ ‏\"‏ هَذَا جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ ‏\"‏‏.‏ فَلَمَّا أَشْرَفَ عَلَى الْمَدِينَةِ قَالَ ‏\"‏ اللَّهُمَّ إِنِّي أُحَرِّمُ مَا بَيْنَ جَبَلَيْهَا مِثْلَ مَا حَرَّمَ بِهِ إِبْرَاهِيمُ مَكَّةَ، اللَّهُمَّ بَارِكْ لَهُمْ فِي مُدِّهِمْ وَصَاعِهِمْ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah ﷺ bersabda kepada Abu Talha, “Carilah salah seorang daripada anak-anakmu untuk berkhidmat kepadaku.” Abu Talha membawaku di belakangnya (di atas tunggangannya) dan membawaku (kepada Nabi ﷺ). Maka aku berkhidmat kepada Rasulullah ﷺ setiap kali baginda turun (untuk singgah di sesuatu tempat). Aku sering mendengar baginda berkata, “Ya Allah! Sesungguhnya aku berlindung kepada-Mu daripada kebimbangan, kesedihan, kelemahan, kemalasan, kedekut, pengecut, bebanan hutang yang berat, dan daripada ditindas oleh orang lain dengan zalim.” Aku terus berkhidmat sehingga kami pulang dari peperangan Khaibar. Kemudian Nabi ﷺ membawa Safiyyah bint Huyai yang telah baginda perolehi daripada rampasan perang. Aku melihat baginda melipat kain atau selimut untuk diduduki olehnya di belakangnya (di atas unta betinanya). Apabila baginda sampai di As-Sahba', baginda menyediakan Hais dan meletakkannya di atas hamparan makan. Kemudian baginda mengutus aku untuk menjemput orang ramai, yang (datang dan) makan; dan itulah walimah perkahwinan baginda dengan Safiyyah. Kemudian Nabi ﷺ meneruskan perjalanan, dan apabila baginda melihat (perasan) Gunung Uhud, baginda bersabda, “Gunung ini mencintai kita, dan kita mencintainya.” Apabila kami menghampiri Madinah, baginda bersabda, “Ya Allah! Aku menjadikan kawasan di antara dua gunungnya sebagai tempat suci sebagaimana Ibrahim telah menjadikan Mekah sebagai tempat suci. Ya Allah! Berkatilah mereka dalam Mudd dan Sa (ukuran khas).”"
  },
  {
    "id": 5212,
    "hadith_number": 5212,
    "tajuk_hadith": "Larangan Menggunakan Sutera, Emas, dan Perak",
    "perawi_melayu": "Diriwayatkan daripada 'Abdur-Rahman bin Abi Laila:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سَيْفُ بْنُ أَبِي سُلَيْمَانَ، قَالَ سَمِعْتُ مُجَاهِدًا، يَقُولُ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي لَيْلَى، أَنَّهُمْ كَانُوا عِنْدَ حُذَيْفَةَ فَاسْتَسْقَى فَسَقَاهُ مَجُوسِيٌّ‏.‏ فَلَمَّا وَضَعَ الْقَدَحَ فِي يَدِهِ رَمَاهُ بِهِ وَقَالَ لَوْلاَ أَنِّي نَهَيْتُهُ غَيْرَ مَرَّةٍ وَلاَ مَرَّتَيْنِ‏.‏ كَأَنَّهُ يَقُولُ لَمْ أَفْعَلْ هَذَا، وَلَكِنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ تَلْبَسُوا الْحَرِيرَ وَلاَ الدِّيبَاجَ وَلاَ تَشْرَبُوا فِي آنِيَةِ الذَّهَبِ وَالْفِضَّةِ، وَلاَ تَأْكُلُوا فِي صِحَافِهَا، فَإِنَّهَا لَهُمْ فِي الدُّنْيَا وَلَنَا فِي الآخِرَةِ ‏\"‏‏.‏",
    "malay_translation": "Kami sedang duduk bersama Hudhaifa, lalu dia meminta air dan seorang Majusi membawakan air kepadanya. Tetapi apabila dia meletakkan cawan itu di tangannya, dia membalingnya kepadanya dan berkata, \"Sekiranya aku tidak melarangnya melakukan perkara itu lebih daripada sekali atau dua kali?\" Dia bermaksud berkata, \"Aku tidak akan melakukan sedemikian,\" sambil menambah, \"tetapi aku mendengar Nabi ﷺ bersabda, \"Janganlah kamu memakai sutera atau Dibaja, dan janganlah kamu minum di dalam bekas emas atau perak, dan janganlah kamu makan di dalam pinggan yang diperbuat daripada logam-logam tersebut, kerana perkara-perkara tersebut adalah untuk orang-orang yang tidak beriman di dunia ini dan untuk kita di Akhirat.\""
  },
  {
    "id": 5213,
    "hadith_number": 5213,
    "tajuk_hadith": "Perumpamaan Orang Mukmin dan Munafik dalam Membaca Al-Quran",
    "perawi_melayu": "Diriwayatkan oleh Abu Musa Al-Ash`ari:",
    "english_text": "Allah's Messenger (ﷺ) said, \"The example of a Believer who recites the Qur'an, is that of a citron which \nsmells good and tastes good; And the example of a Believer who does not recite the Qur'an, is that of \na date which has no smell but tastes sweet; and the example of a hypocrite who recites the Qur'an, is \nthat of an aromatic plant which smells good but tastes bitter; and the example of a hypocrite who does \nnot recite the Qur'an, is that of a colocynth plant which has no smell and is bitter in taste.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏مَثَلُ الْمُؤْمِنِ الَّذِي يَقْرَأُ الْقُرْآنَ كَمَثَلِ الأُتْرُجَّةِ، رِيحُهَا طَيِّبٌ وَطَعْمُهَا طَيِّبٌ، وَمَثَلُ الْمُؤْمِنِ الَّذِي لاَ يَقْرَأُ الْقُرْآنَ كَمَثَلِ التَّمْرَةِ لاَ رِيحَ لَهَا وَطَعْمُهَا حُلْوٌ، وَمَثَلُ الْمُنَافِقِ الَّذِي يَقْرَأُ الْقُرْآنَ مَثَلُ الرَّيْحَانَةِ، رِيحُهَا طَيِّبٌ وَطَعْمُهَا مُرٌّ، وَمَثَلُ الْمُنَافِقِ الَّذِي لاَ يَقْرَأُ الْقُرْآنَ كَمَثَلِ الْحَنْظَلَةِ، لَيْسَ لَهَا رِيحٌ وَطَعْمُهَا مُرٌّ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda, \"Perumpamaan seorang Mukmin yang membaca Al-Quran adalah seperti buah utrujjah (sitrus) yang baunya harum dan rasanya sedap; dan perumpamaan seorang Mukmin yang tidak membaca Al-Quran adalah seperti buah tamar yang tidak berbau tetapi rasanya manis; dan perumpamaan seorang munafik yang membaca Al-Quran adalah seperti tumbuhan reihanah (sejenis tumbuhan harum) yang baunya harum tetapi rasanya pahit; dan perumpamaan seorang munafik yang tidak membaca Al-Quran adalah seperti buah hanzhalah (colocynth) yang tidak berbau dan rasanya pahit.\""
  },
  {
    "id": 5214,
    "hadith_number": 5214,
    "tajuk_hadith": "Keutamaan Aisyah (RA) Berbanding Wanita Lain",
    "perawi_melayu": "Diriwayatkan oleh Anas:",
    "english_text": "The Prophet (ﷺ) said, \"The superiority of `Aisha to other ladies is like the superiority of Tharid to other \nkinds of food.\"",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا خَالِدٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ فَضْلُ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda, \"Keutamaan Aisyah berbanding wanita lain adalah seperti keutamaan Tharid berbanding makanan yang lain.\""
  },
  {
    "id": 5215,
    "hadith_number": 5215,
    "tajuk_hadith": "Musafir Itu Sebahagian Daripada Azab",
    "perawi_melayu": "Diriwayatkan oleh Abu Huraira:",
    "english_text": "The Prophet (ﷺ) said, \"Traveling is a kind of torture, as it prevents one from sleeping and eating! So when \none has finished his job, he should return quickly to his family.\"",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مَالِكٌ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ السَّفَرُ قِطْعَةٌ مِنَ الْعَذَابِ، يَمْنَعُ أَحَدَكُمْ نَوْمَهُ وَطَعَامَهُ، فَإِذَا قَضَى نَهْمَتَهُ مِنْ وَجْهِهِ فَلْيُعَجِّلْ إِلَى أَهْلِهِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda, \"Musafir itu sebahagian daripada azab, ia menghalang seseorang daripada tidur dan makan! Maka apabila seseorang telah selesai urusannya, hendaklah dia segera kembali kepada keluarganya.\""
  },
  {
    "id": 5216,
    "hadith_number": 5216,
    "tajuk_hadith": "Tradisi Berkaitan Barirah (RA) dan Hukum Makanan Sedekah",
    "perawi_melayu": "Diriwayatkan oleh Qasim bin Muhammad:",
    "english_text": "Three traditions have been established because of Barira: `Aisha intended to buy her and set her free, \nbut Barira's masters said, \"Her wala' will be for us.\" `Aisha mentioned that to Allah's Messenger (ﷺ) who \nsaid, \"You could accept their condition if you wished, for the wala is for the one who manumits the \nslave.\" Barira was manumitted, then she was given the choice either to stay with her husband or leave \nhim; One day Allah's Messenger (ﷺ) entered `Aisha's house while there was a cooking pot of food boiling on \nthe fire. The Prophet (ﷺ) asked for lunch, and he was presented with bread and some extra food from the \nhome-made Udm (e.g. soup). He asked, \"Don't I see meat (being cooked)?\" They said, \"Yes, O Allah's \nApostle! But it is the meat that has been given to Barira in charity and she has given it to us as a \npresent.\" He said, \"For Barira it is alms, but for us it is a present.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ رَبِيعَةَ، أَنَّهُ سَمِعَ الْقَاسِمَ بْنَ مُحَمَّدٍ، يَقُولُ كَانَ فِي بَرِيرَةَ ثَلاَثُ سُنَنٍ، أَرَادَتْ عَائِشَةُ أَنْ تَشْتَرِيَهَا فَتُعْتِقَهَا، فَقَالَ أَهْلُهَا، وَلَنَا الْوَلاَءُ، فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ لَوْ شِئْتِ شَرَطْتِيهِ لَهُمْ، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ قَالَ وَأُعْتِقَتْ فَخُيِّرَتْ فِي أَنْ تَقِرَّ تَحْتَ زَوْجِهَا أَوْ تُفَارِقَهُ، وَدَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمًا بَيْتَ عَائِشَةَ وَعَلَى النَّارِ بُرْمَةٌ تَفُورُ، فَدَعَا بِالْغَدَاءِ فَأُتِيَ بِخُبْزٍ وَأُدْمٍ مِنْ أُدْمِ الْبَيْتِ فَقَالَ ‏\"‏ أَلَمْ أَرَ لَحْمًا ‏\"‏‏.‏ قَالُوا بَلَى يَا رَسُولَ اللَّهِ، وَلَكِنَّهُ لَحْمٌ تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ، فَأَهْدَتْهُ لَنَا‏.‏ فَقَالَ‏\"‏ هُوَ صَدَقَةٌ عَلَيْهَا، وَهَدِيَّةٌ لَنَا ‏\"‏‏.‏",
    "malay_translation": "Tiga tradisi telah ditetapkan berkaitan Barirah: Aisyah (RA) berniat untuk membelinya dan membebaskannya, tetapi tuan-tuan Barirah berkata, \"Hak wala' (kesetiaan)nya adalah untuk kami.\" Aisyah menyebutkan hal itu kepada Rasulullah (ﷺ) yang bersabda, \"Kamu boleh menerima syarat mereka jika kamu mahu, kerana wala' adalah bagi orang yang membebaskan hamba.\" Barirah dibebaskan, kemudian dia diberi pilihan sama ada untuk tinggal bersama suaminya atau meninggalkannya; Pada suatu hari, Rasulullah (ﷺ) memasuki rumah Aisyah (RA) ketika terdapat periuk makanan yang sedang mendidih di atas api. Nabi (ﷺ) meminta makan tengah hari, dan dia dihidangkan dengan roti dan sedikit makanan tambahan dari Udm (contohnya, sup) yang dibuat di rumah. Baginda bertanya, \"Tidakkah aku melihat daging (sedang dimasak)?\" Mereka berkata, \"Ya, wahai Rasulullah! Tetapi itu adalah daging yang telah diberikan kepada Barirah sebagai sedekah dan dia telah memberikannya kepada kami sebagai hadiah.\" Baginda bersabda, \"Bagi Barirah, itu adalah sedekah, tetapi bagi kami, itu adalah hadiah.\""
  },
  {
    "id": 5217,
    "hadith_number": 5217,
    "tajuk_hadith": "Kecintaan Rasulullah ﷺ terhadap Makanan Manis dan Madu",
    "perawi_melayu": "Diriwayatkan oleh `Aisha:",
    "english_text": "Allah's Messenger (ﷺ) used to love sweet edible things and honey.",
    "arabic_text": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، عَنْ أَبِي أُسَامَةَ، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُحِبُّ الْحَلْوَاءَ وَالْعَسَلَ‏.‏",
    "malay_translation": "Rasulullah ﷺ sangat menyukai makanan manis dan madu."
  },
  {
    "id": 5218,
    "hadith_number": 5218,
    "tajuk_hadith": "Kesusahan Sahabat Rasulullah ﷺ dan Kemurahan Hati Ja'far bin Abi Talib",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "I used to accompany Allah's Messenger (ﷺ) to fill my stomach; and that was when I did not eat baked bread, \nnor wear silk. Neither a male nor a female slave used to serve me, and I used to bind stones over my \nbelly and ask somebody to recite a Qur'anic Verse for me though I knew it, so that he might take me \nto his house and feed me. Ja`far bin Abi Talib was very kind to the poor, and he used to take us and \nfeed us with what ever was available in his house, (and if nothing was available), he used to give us \nthe empty (honey or butter) skin which we would tear and lick whatever was in it.",
    "arabic_text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ شَيْبَةَ، قَالَ أَخْبَرَنِي ابْنُ أَبِي الْفُدَيْكِ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنِ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كُنْتُ أَلْزَمُ النَّبِيَّ صلى الله عليه وسلم لِشِبَعِ بَطْنِي حِينَ لاَ آكُلُ الْخَمِيرَ، وَلاَ أَلْبَسُ الْحَرِيرَ، وَلاَ يَخْدُمُنِي فُلاَنٌ وَلاَ فُلاَنَةُ، وَأُلْصِقُ بَطْنِي بِالْحَصْبَاءِ، وَأَسْتَقْرِئُ الرَّجُلَ الآيَةَ وَهْىَ مَعِي كَىْ يَنْقَلِبَ بِي فَيُطْعِمَنِي، وَخَيْرُ النَّاسِ لِلْمَسَاكِينِ جَعْفَرُ بْنُ أَبِي طَالِبٍ، يَنْقَلِبُ بِنَا فَيُطْعِمُنَا مَا كَانَ فِي بَيْتِهِ، حَتَّى إِنْ كَانَ لَيُخْرِجُ إِلَيْنَا الْعُكَّةَ لَيْسَ فِيهَا شَىْءٌ، فَنَشْتَقُّهَا فَنَلْعَقُ مَا فِيهَا‏.‏",
    "malay_translation": "Aku sering menemani Rasulullah ﷺ untuk mengisi perutku; dan ketika itu aku tidak makan roti yang dibakar, tidak memakai sutera. Tidak ada hamba lelaki mahupun perempuan yang melayanku, dan aku mengikat batu di perutku dan meminta seseorang membaca ayat Al-Quran untukku walaupun aku sudah menghafalnya, supaya dia membawaku ke rumahnya dan memberiku makan. Ja'far bin Abi Talib sangat baik hati kepada orang miskin, dan dia sering membawa kami dan memberi kami makan apa sahaja yang ada di rumahnya, (dan jika tiada apa-apa), dia akan memberi kami kulit (madu atau mentega) yang kosong yang akan kami koyak dan jilat apa sahaja yang ada di dalamnya."
  },
  {
    "id": 5219,
    "hadith_number": 5219,
    "tajuk_hadith": "Kecintaan Nabi (ﷺ) Terhadap Labu",
    "perawi_melayu": "Diriwayatkan Anas:",
    "english_text": "Allah's Messenger (ﷺ) went to (the house of) his slave tailor, and he was offered (a dish of) gourd of which \nhe started eating. I have loved to eat gourd since I saw Allah's Messenger (ﷺ) eating it.",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا أَزْهَرُ بْنُ سَعْدٍ، عَنِ ابْنِ عَوْنٍ، عَنْ ثُمَامَةَ بْنِ أَنَسٍ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَتَى مَوْلًى لَهُ خَيَّاطًا، فَأُتِيَ بِدُبَّاءٍ، فَجَعَلَ يَأْكُلُهُ، فَلَمْ أَزَلْ أُحِبُّهُ مُنْذُ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْكُلُهُ‏.‏",
    "malay_translation": "Rasulullah (ﷺ) pergi ke (rumah) hamba tukangnya, dan baginda dihidangkan (hidangan) labu yang mana baginda mula memakannya. Saya amat suka makan labu sejak saya melihat Rasulullah (ﷺ) memakannya."
  },
  {
    "id": 5220,
    "hadith_number": 5220,
    "tajuk_hadith": "Adab Mengundang Tetamu: Pengajaran Daripada Rasulullah (ﷺ)",
    "perawi_melayu": "Diriwayatkan oleh Abu Mas`ud Al-Ansari:",
    "english_text": "There was a man called Abu Shu'aib, and he had a slave who was a butcher. He said (to his slave), \n\"Prepare a meal to which I may invite Allah's Messenger (ﷺ) along with four other men.\" So he invited \nAllah's Messenger (ﷺ) and four other men, but another man followed them whereupon the Prophet (ﷺ) said, \n\"You have invited me as one of five guests, but now another man has followed us. If you wish you \ncan admit him, and if you wish you can refuse him.\" On that the host said, \"But I admit him.\" \nNarrated Muhammad bin Isma`il: If guests are sitting at a dining table, they do not have the right to \ncarry food from other tables to theirs, but they can pass on food from their own table to each other; \notherwise they should leave it.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ، قَالَ كَانَ مِنَ الأَنْصَارِ رَجُلٌ يُقَالُ لَهُ أَبُو شُعَيْبٍ، وَكَانَ لَهُ غُلاَمٌ لَحَّامٌ فَقَالَ اصْنَعْ لِي طَعَامًا أَدْعُو رَسُولَ اللَّهِ صلى الله عليه وسلم خَامِسَ خَمْسَةٍ، فَدَعَا رَسُولَ اللَّهِ صلى الله عليه وسلم خَامِسَ خَمْسَةٍ، فَتَبِعَهُمْ رَجُلٌ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِنَّكَ دَعَوْتَنَا خَامِسَ خَمْسَةٍ وَهَذَا رَجُلٌ قَدْ تَبِعَنَا، فَإِنْ شِئْتَ أَذِنْتَ لَهُ، وَإِنْ شِئْتَ تَرَكْتَهُ ‏\"‏‏.‏ قَالَ بَلْ أَذِنْتُ لَهُ‏.‏ \nقَالَ مُحَمَّدُ بْنُ يُوسُفَ سَمِعْتُ مُحَمَّدَ بْنَ إِسْمَاعِيْلَ يَقُولُ إِذَا كَانَ الْقَوْمُ عَلَى الْمَائِدَةِ لَيْسَ لَهُمْ أَنْ يُنَاوِلُوا مِنْ مَائِدَةٍ إِلَى مَائِدَةٍ أُخْرَى وَلَكِنْ يُنَاوِلُ بَعْضُهُمْ بَعْضًا فِي تِلْكَ الْمَائِدَةِ أَوْ يَدَعُ",
    "malay_translation": "Seorang lelaki bernama Abu Shu'aib, mempunyai seorang hamba lelaki yang bekerja sebagai tukang daging. Dia berkata (kepada hambanya), \"Sediakanlah makanan yang akan aku jemput Rasulullah (ﷺ) bersama empat orang lelaki yang lain.\" Lalu dia menjemput Rasulullah (ﷺ) dan empat orang lelaki yang lain, tetapi seorang lelaki lain mengikuti mereka. Maka Nabi (ﷺ) bersabda, \"Kamu telah menjemputku sebagai seorang daripada lima orang tetamu, tetapi sekarang seorang lelaki lain telah mengikuti kami. Jika kamu mahu, kamu boleh membenarkannya masuk, dan jika kamu mahu, kamu boleh menolaknya.\" Mendengar itu, tuan rumah berkata, \"Tetapi aku benarkannya masuk.\" \n\nDiriwayatkan oleh Muhammad bin Isma`il: Jika para tetamu sedang duduk di meja makan, mereka tidak berhak untuk mengambil makanan dari meja lain ke meja mereka, tetapi mereka boleh menghulurkan makanan dari meja mereka sendiri kepada satu sama lain; jika tidak, mereka harus membiarkannya."
  },
  {
    "id": 5221,
    "hadith_number": 5221,
    "tajuk_hadith": "Kecintaan Nabi ﷺ terhadap Labu",
    "perawi_melayu": "Diriwayatkan oleh Anas:",
    "english_text": "I was a young boy when I once was walking with Allah's Messenger (ﷺ) . Allah's Messenger (ﷺ) entered the house \nof his slave tailor and the latter brought a dish filled with food covered with pieces of gourd. Allah's \nApostle started picking and eating the gourd. When I saw that, I started collecting and placing the \ngourd before him. Then the slave returned to his work. Anas added: I have kept on loving gourd since \nI saw Allah's Messenger (ﷺ) doing what he was doing.",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُنِيرٍ، سَمِعَ النَّضْرَ، أَخْبَرَنَا ابْنُ عَوْنٍ، قَالَ أَخْبَرَنِي ثُمَامَةُ بْنُ عَبْدِ اللَّهِ بْنِ أَنَسٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كُنْتُ غُلاَمًا أَمْشِي مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَدَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى غُلاَمٍ لَهُ خَيَّاطٍ، فَأَتَاهُ بِقَصْعَةٍ فِيهَا طَعَامٌ وَعَلَيْهِ دُبَّاءٌ، فَجَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَتَتَبَّعُ الدُّبَّاءَ ـ قَالَ ـ فَلَمَّا رَأَيْتُ ذَلِكَ جَعَلْتُ أَجْمَعُهُ بَيْنَ يَدَيْهِ ـ قَالَ ـ فَأَقْبَلَ الْغُلاَمُ عَلَى عَمَلِهِ‏.‏ قَالَ أَنَسٌ لاَ أَزَالُ أُحِبُّ الدُّبَّاءَ بَعْدَ مَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم صَنَعَ مَا صَنَعَ‏.‏",
    "malay_translation": "Aku adalah seorang budak lelaki muda ketika aku berjalan bersama Rasulullah ﷺ. Rasulullah ﷺ memasuki rumah tukang jahit hambanya dan tukang jahit itu membawakan sebuah hidangan yang berisi makanan yang ditutup dengan kepingan labu. Rasulullah ﷺ mula mengambil dan memakan labu tersebut. Apabila aku melihat itu, aku mula mengumpul dan meletakkan labu itu di hadapannya. Kemudian hamba itu kembali kepada pekerjaannya. Anas menambahkan: Aku terus menyukai labu sejak aku melihat Rasulullah ﷺ melakukan apa yang telah dilakukannya."
  },
  {
    "id": 5222,
    "hadith_number": 5222,
    "tajuk_hadith": "Kisah Nabi (ﷺ) Menggemari Labu dalam Makanan",
    "perawi_melayu": "Diriwayatkan oleh Anas bin Malik:",
    "english_text": "A tailor invited the Prophet (ﷺ) to a meal which he had prepared, and I went along with the Prophet (ﷺ) . The \ntailor presented barley bread and soup containing gourd and cured meat. I saw the Prophet (ﷺ) picking the \npieces of gourd from around the dish, and since then I have kept on liking gourd.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، أَنَّ خَيَّاطًا، دَعَا النَّبِيَّ صلى الله عليه وسلم لِطَعَامٍ صَنَعَهُ، فَذَهَبْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم فَقَرَّبَ خُبْزَ شَعِيرٍ وَمَرَقًا فِيهِ دُبَّاءٌ وَقَدِيدٌ، فَرَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَتَتَبَّعُ الدُّبَّاءَ مِنْ حَوَالَىِ الْقَصْعَةِ، فَلَمْ أَزَلْ أُحِبُّ الدُّبَّاءَ بَعْدَ يَوْمِئِذٍ‏.‏",
    "malay_translation": "Seorang tukang jahit menjemput Nabi (ﷺ) ke suatu hidangan yang telah disediakannya, dan saya pergi bersama Nabi (ﷺ). Tukang jahit itu menghidangkan roti barli dan sup yang mengandungi labu dan daging yang diawet. Saya melihat Nabi (ﷺ) mengambil potongan-potongan labu dari sekeliling hidangan tersebut, dan sejak itu saya terus menyukai labu."
  },
  {
    "id": 5223,
    "hadith_number": 5223,
    "tajuk_hadith": "Nabi ﷺ Memakan Labu dalam Sup",
    "perawi_melayu": "Diriwayatkan oleh Anas:",
    "english_text": "I saw the Prophet (ﷺ) being served with soup and containing gourd and cured meat, and I saw him picking \nand eating the pieces of gourd.",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم أُتِيَ بِمَرَقَةٍ فِيهَا دُبَّاءٌ وَقَدِيدٌ، فَرَأَيْتُهُ يَتَتَبَّعُ الدُّبَّاءَ يَأْكُلُهَا‏.‏",
    "malay_translation": "Saya melihat Nabi ﷺ dihidangkan dengan sup yang mengandungi labu dan daging kering, dan saya melihat baginda memilih dan memakan potongan labu tersebut."
  },
  {
    "id": 5224,
    "hadith_number": 5224,
    "tajuk_hadith": "Larangan Menyimpan Daging Korban dan Kehidupan Keluarga Nabi",
    "perawi_melayu": "Saidatina 'Aisyah رضي الله عنها",
    "english_text": "The Prophet (ﷺ) did not do that (i.e., forbade the storage of the meat of sacrifices for three days) except \n(he did so) so that the rich would feed the poor. But later we used to keep even trotters to cook, fifteen \ndays later. The family of Muhammad did not eat wheat bread with meat or soup to their satisfaction \nfor three successive days.",
    "arabic_text": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا فَعَلَهُ إِلاَّ فِي عَامٍ جَاعَ النَّاسُ، أَرَادَ أَنْ يُطْعِمَ الْغَنِيُّ الْفَقِيرَ، وَإِنْ كُنَّا لَنَرْفَعُ الْكُرَاعَ بَعْدَ خَمْسَ عَشْرَةَ، وَمَا شَبِعَ آلُ مُحَمَّدٍ صلى الله عليه وسلم مَنْ خُبْزِ بُرٍّ مَأْدُومٍ ثَلاَثًا‏.‏",
    "malay_translation": "Nabi ﷺ tidak melakukan hal itu (yakni, melarang penyimpanan daging korban selama tiga hari) kecuali (baginda melakukannya) agar orang kaya memberi makan kepada orang miskin. Tetapi kemudian kami biasa menyimpan tungkai untuk dimasak, lima belas hari kemudian. Keluarga Muhammad tidak pernah makan roti gandum dengan daging atau sup sampai kenyang selama tiga hari berturut-turut."
  },
  {
    "id": 5225,
    "hadith_number": 5225,
    "tajuk_hadith": "Rasulullah ﷺ Menerima Jemputan Tukang Jahit dan Kegemarannya terhadap Labu",
    "perawi_melayu": "Diriwayatkan oleh Anas bin Malik:",
    "english_text": "A tailor invited Allah's Messenger (ﷺ) to a meal which he had prepared. I went with Allah's Messenger (ﷺ) to that \nmeal, and the tailor served the Prophet (ﷺ) with barley bread and soup of gourd and cured meat. I saw \nAllah's Messenger (ﷺ) picking the pieces of gourd from around the dish, and since then I have kept on liking \ngourd.",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ إِنَّ خَيَّاطًا دَعَا رَسُولَ اللَّهِ صلى الله عليه وسلم لِطَعَامٍ صَنَعَهُ ـ قَالَ أَنَسٌ ـ فَذَهَبْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى ذَلِكَ الطَّعَامِ، فَقَرَّبَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم خُبْزًا مِنْ شَعِيرٍ وَمَرَقًا فِيهِ دُبَّاءٌ وَقَدِيدٌ ـ قَالَ أَنَسٌ ـ فَرَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَتَتَبَّعُ الدُّبَّاءَ مِنْ حَوْلِ الصَّحْفَةِ، فَلَمْ أَزَلْ أُحِبُّ الدُّبَّاءَ مِنْ يَوْمِئِذٍ‏.‏ وَقَالَ ثُمَامَةُ عَنْ أَنَسٍ، فَجَعَلْتُ أَجْمَعُ الدُّبَّاءَ بَيْنَ يَدَيْهِ‏.‏",
    "malay_translation": "Seorang tukang jahit telah menjemput Rasulullah ﷺ ke satu hidangan yang telah disediakan. Aku pergi bersama Rasulullah ﷺ ke hidangan tersebut, dan tukang jahit itu menghidangkan kepada Nabi ﷺ roti barli dan sup labu serta daging kering. Aku melihat Rasulullah ﷺ mengambil potongan-potongan labu dari sekeliling hidangan, dan sejak itu aku mula menyukai labu."
  },
  {
    "id": 5226,
    "hadith_number": 5226,
    "tajuk_hadith": "Nabi ﷺ Makan Tamar Basah Bersama Timun",
    "perawi_melayu": "Diriwayatkan oleh Abdullah bin Ja`far bin Abi Talib:",
    "english_text": "I saw Allah's Messenger (ﷺ) eating fresh dates with snake cucumber.",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرِ بْنِ أَبِي طَالِبٍ ـ رضى الله عنهما ـ قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَأْكُلُ الرُّطَبَ بِالْقِثَّاءِ‏.‏",
    "malay_translation": "Saya melihat Rasulullah ﷺ memakan tamar basah bersama timun."
  },
  {
    "id": 5227,
    "hadith_number": 5227,
    "tajuk_hadith": "Abu Hurairah dan Pembahagian Kurma",
    "perawi_melayu": "Abu `Uthman",
    "english_text": "I was a guest of Abu Huraira for seven days. Abu Huraira, his wife and his slave used to get up and\nremain awake for one-third of the night by turns. Each would offer the night prayer and then awaken\nthe other. I heard Abu Huraira saying, \"Allah's Messenger (ﷺ) distributed dates among his companions and\nmy share was seven dates, one of which was a Hashafa (a date which dried on the tree before it was\nfully ripe).",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَبَّاسٍ الْجُرَيْرِيِّ، عَنْ أَبِي عُثْمَانَ، قَالَ تَضَيَّفْتُ أَبَا هُرَيْرَةَ سَبْعًا، فَكَانَ هُوَ وَامْرَأَتُهُ وَخَادِمُهُ يَعْتَقِبُونَ اللَّيْلَ أَثْلاَثًا، يُصَلِّي هَذَا، ثُمَّ يُوقِظُ هَذَا‏.‏ وَسَمِعْتُهُ يَقُولُ قَسَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنِ أَصْحَابِهِ تَمْرًا، فَأَصَابَنِي سَبْعُ تَمَرَاتٍ إِحْدَاهُنَّ حَشَفَةٌ‏.‏",
    "malay_translation": "Aku adalah tetamu Abu Hurairah selama tujuh hari. Abu Hurairah, isterinya dan hambanya bangun dan berjaga secara bergilir-gilir selama satu pertiga malam. Masing-masing menunaikan solat malam, kemudian membangunkan yang lain. Aku mendengar Abu Hurairah berkata, \"Rasulullah (ﷺ) membahagikan kurma di kalangan sahabatnya dan bahagianku adalah tujuh biji kurma, salah satunya adalah Hashafa (kurma yang kering di pokok sebelum masak sepenuhnya)."
  },
  {
    "id": 5228,
    "hadith_number": 5228,
    "tajuk_hadith": "Pembahagian Kurma oleh Nabi (ﷺ)",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) distributed dates among us, and my share was five dates, four of which were good, and \none was a ,Hashafa, and I found the Hashafa the hardest for my teeth.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّاءَ، عَنْ عَاصِمٍ، عَنْ أَبِي عُثْمَانَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَسَمَ النَّبِيُّ صلى الله عليه وسلم بَيْنَنَا تَمْرًا فَأَصَابَنِي مِنْهُ خَمْسٌ أَرْبَعُ تَمَرَاتٍ وَحَشَفَةٌ، ثُمَّ رَأَيْتُ الْحَشَفَةَ هِيَ أَشَدُّهُنَّ لِضِرْسِي‏.‏",
    "malay_translation": "Nabi (ﷺ) mengagihkan kurma di antara kami, dan bahagian saya adalah lima biji kurma, empat daripadanya baik, dan sebiji adalah Hashafa (kurma kering yang keras), dan saya mendapati Hashafa itu paling keras untuk gigi saya."
  },
  {
    "id": 5229,
    "hadith_number": 5229,
    "tajuk_hadith": "Kecukupan dengan Kurma dan Air",
    "perawi_melayu": "Aishah (ra)",
    "english_text": "Aishah (ra) said, \"When Allah's Messenger (ﷺ) died, we had been satisfied by the two black things, i.e., dates and water.\"",
    "arabic_text": "وَقَالَ مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ، عَنْ مَنْصُورِ ابْنِ صَفِيَّةَ، حَدَّثَتْنِي أُمِّي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَدْ شَبِعْنَا مِنَ الأَسْوَدَيْنِ التَّمْرِ وَالْمَاءِ‏.‏",
    "malay_translation": "Aishah (ra) berkata, \"Ketika Rasulullah (ﷺ) wafat, kami telah berpuas dengan dua perkara hitam, iaitu kurma dan air.\""
  },
  {
    "id": 5230,
    "hadith_number": 5230,
    "tajuk_hadith": "Kisah Nabi (ﷺ) Membantu Jabir dalam Melunaskan Hutang",
    "perawi_melayu": "Jabir bin `Abdullah:",
    "english_text": "There was a Jew in Medina who used to lend me money up to the season of plucking dates. (Jabir had \na piece of land which was on the way to Ruma). That year the land was not promising, so the payment \nof the debt was delayed one year. The Jew came to me at the time of plucking, but gathered nothing \nfrom my land. I asked him to give me one year respite, but he refused. This news reached the Prophet (ﷺ) \nwhereupon he said to his companions, \"Let us go and ask the Jew for respite for Jabir.\" All of them \ncame to me in my garden, and the Prophet (ﷺ) started speaking to the Jew, but he Jew said, \"O Abu \nQasim! I will not grant him respite.\" When the Prophet (ﷺ) saw the Jew's attitude, he stood up and walked \nall around the garden and came again and talked to the Jew, but the Jew refused his request. I got up \nand brought some ripe fresh dates and put it in front of the Prophet. He ate and then said to me, \n\"Where is your hut, O Jabir?\" I informed him, and he said, \"Spread out a bed for me in it.\" I spread \nout a bed, and he entered and slept. When he woke up, I brought some dates to him again and he ate of \nit and then got up and talked to the Jew again, but the Jew again refused his request. Then the Prophet (ﷺ) \ngot up for the second time amidst the palm trees loaded with fresh dates, and said, \"O Jabir! Pluck \ndates to repay your debt.\" The Jew remained with me while I was plucking the dates, till I paid him all \nhis right, yet there remained extra quantity of dates. So I went out and proceeded till I reached the \nProphet and informed him of the good news, whereupon he said, \"I testify that I am Allah's Messenger (ﷺ).\"",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي رَبِيعَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، رضى الله عنهما قَالَ كَانَ بِالْمَدِينَةِ يَهُودِيٌّ وَكَانَ يُسْلِفُنِي فِي تَمْرِي إِلَى الْجِدَادِ، وَكَانَتْ لِجَابِرٍ الأَرْضُ الَّتِي بِطَرِيقِ رُومَةَ فَجَلَسَتْ، فَخَلاَ عَامًا فَجَاءَنِي الْيَهُودِيُّ عِنْدَ الْجَدَادِ، وَلَمْ أَجُدَّ مِنْهَا شَيْئًا، فَجَعَلْتُ أَسْتَنْظِرُهُ إِلَى قَابِلٍ فَيَأْبَى، فَأُخْبِرَ بِذَلِكَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ لأَصْحَابِهِ ‏\"‏ امْشُوا نَسْتَنْظِرْ لِجَابِرٍ مِنَ الْيَهُودِيِّ ‏\"‏‏.‏ فَجَاءُونِي فِي نَخْلِي فَجَعَلَ النَّبِيُّ صلى الله عليه وسلم يُكَلِّمُ الْيَهُودِيَّ فَيَقُولُ أَبَا الْقَاسِمِ لاَ أُنْظِرُهُ‏.‏ فَلَمَّا رَأَى النَّبِيُّ صلى الله عليه وسلم قَامَ فَطَافَ فِي النَّخْلِ، ثُمَّ جَاءَهُ فَكَلَّمَهُ فَأَبَى فَقُمْتُ فَجِئْتُ بِقَلِيلِ رُطَبٍ فَوَضَعْتُهُ بَيْنَ يَدَىِ النَّبِيِّ صلى الله عليه وسلم فَأَكَلَ ثُمَّ قَالَ ‏\"‏ أَيْنَ عَرِيشُكَ يَا جَابِرُ ‏\"‏‏.‏ فَأَخْبَرْتُهُ فَقَالَ ‏\"‏ افْرُشْ لِي فِيهِ ‏\"‏‏.‏ فَفَرَشْتُهُ فَدَخَلَ فَرَقَدَ، ثُمَّ اسْتَيْقَظَ فَجِئْتُهُ بِقَبْضَةٍ أُخْرَى فَأَكَلَ مِنْهَا، ثُمَّ قَامَ فَكَلَّمَ الْيَهُودِيَّ فَأَبَى عَلَيْهِ فَقَامَ فِي الرِّطَابِ فِي النَّخْلِ الثَّانِيَةَ ثُمَّ قَالَ ‏\"‏ يَا جَابِرُ جُدَّ وَاقْضِ ‏\"‏‏.‏ فَوَقَفَ فِي الْجَدَادِ فَجَدَدْتُ مِنْهَا مَا قَضَيْتُهُ وَفَضَلَ مِنْهُ فَخَرَجْتُ حَتَّى جِئْتُ النَّبِيَّ صلى الله عليه وسلم فَبَشَّرْتُهُ فَقَالَ ‏\"‏ أَشْهَدُ أَنِّي رَسُولُ اللَّهِ ‏\"‏‏.‏ \nعُرُوشٌ وَعَرِيشٌ بِنَاءٌ وَقَالَ ابْنُ عَبَّاسٍ  مَعْرُوشَاتٍ  مَا يُعَرَّشُ مِنْ الْكُرُومِ وَغَيْرِ ذَلِكَ يُقَالُ عُرُوشُهَا أَبْنِيَتُهَا",
    "malay_translation": "Terdapat seorang Yahudi di Madinah yang biasa meminjamkan saya wang sehingga musim memetik kurma. (Jabir mempunyai sebidang tanah yang terletak di jalan ke Ruma). Tahun itu, tanah itu tidak menguntungkan, jadi pembayaran hutang ditangguhkan selama satu tahun. Yahudi itu datang kepada saya pada waktu memetik kurma, tetapi tidak mendapat apa-apa dari tanah saya. Saya meminta dia untuk memberi saya tempoh tangguh selama satu tahun, tetapi dia menolak. Berita ini sampai kepada Nabi (ﷺ) lalu baginda bersabda kepada para sahabatnya, \"Marilah kita pergi dan meminta Yahudi itu memberi tangguh kepada Jabir.\" Mereka semua datang kepada saya di kebun saya, dan Nabi (ﷺ) mula bercakap dengan Yahudi itu, tetapi Yahudi itu berkata, \"Wahai Abu Qasim! Saya tidak akan memberinya tangguh.\" Apabila Nabi (ﷺ) melihat sikap Yahudi itu, baginda berdiri dan berjalan mengelilingi kebun dan datang lagi dan bercakap dengan Yahudi itu, tetapi Yahudi itu menolak permintaannya. Saya bangun dan membawa beberapa buah kurma segar yang masak dan meletakkannya di hadapan Nabi. Baginda makan dan kemudian berkata kepada saya, \"Di manakah pondokmu, wahai Jabir?\" Saya memberitahunya, dan baginda berkata, \"Hamparkanlah sebuah katil untukku di dalamnya.\" Saya menghamparkan sebuah katil, dan baginda masuk dan tidur. Apabila baginda bangun, saya membawakan beberapa buah kurma lagi kepada baginda dan baginda memakannya dan kemudian bangun dan bercakap dengan Yahudi itu lagi, tetapi Yahudi itu sekali lagi menolak permintaannya. Kemudian Nabi (ﷺ) bangun untuk kali kedua di tengah-tengah pokok kurma yang sarat dengan buah kurma segar, dan berkata, \"Wahai Jabir! Petiklah kurma untuk membayar hutangmu.\" Yahudi itu kekal bersama saya ketika saya memetik kurma, sehingga saya membayarnya semua haknya, namun masih terdapat lebihan kuantiti kurma. Jadi saya keluar dan pergi sehingga saya sampai kepada Nabi dan memberitahunya tentang berita gembira itu, lalu baginda bersabda, \"Saya bersaksi bahawa saya adalah Rasulullah (ﷺ).\""
  },
  {
    "id": 5231,
    "hadith_number": 5231,
    "tajuk_hadith": "Pohon Kurma: Pohon yang Diberkati Seperti Seorang Muslim",
    "perawi_melayu": "Diriwayatkan daripada Abdullah bin 'Umar:",
    "english_text": "While we were sitting with the Prophet, fresh dates were brought to him. The Prophet (ﷺ) said, \"There is a \ntree among the trees which is as blessed as a Muslim\" I thought that it was the date palm tree and \nintended to say, \"It is the date-palm tree, O Allah's Messenger (ﷺ)!\" but I looked behind to see that I was the \ntenth and youngest of ten men present there, so I kept quiet' Then the Prophet (ﷺ) said, \"It is the datepalm \ntree.\"",
    "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي مُجَاهِدٌ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ بَيْنَا نَحْنُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم جُلُوسٌ إِذْ أُتِيَ بِجُمَّارِ نَخْلَةٍ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنَ الشَّجَرِ لَمَا بَرَكَتُهُ كَبَرَكَةِ الْمُسْلِمِ ‏\"‏‏.‏ فَظَنَنْتُ أَنَّهُ يَعْنِي النَّخْلَةَ، فَأَرَدْتُ أَنْ أَقُولَ هِيَ النَّخْلَةُ يَا رَسُولَ اللَّهِ‏.‏ ثُمَّ الْتَفَتُّ فَإِذَا أَنَا عَاشِرُ عَشَرَةٍ أَنَا أَحْدَثُهُمْ فَسَكَتُّ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هِيَ النَّخْلَةُ ‏\"‏‏.‏",
    "malay_translation": "Ketika kami sedang duduk bersama Nabi (ﷺ), kurma segar dibawa kepada baginda. Nabi (ﷺ) bersabda, “Sesungguhnya ada sebatang pohon daripada pokok-pokok yang keberkatannya seperti keberkatan seorang Muslim.” Saya menyangka ia adalah pohon kurma dan bercadang untuk berkata, “Ia adalah pohon kurma, wahai Rasulullah (ﷺ)!” tetapi saya menoleh ke belakang dan mendapati saya adalah orang kesepuluh dan yang paling muda dalam kalangan sepuluh orang lelaki yang hadir di situ, maka saya berdiam diri. Kemudian Nabi (ﷺ) bersabda, “Ia adalah pohon kurma.”"
  },
  {
    "id": 5232,
    "hadith_number": 5232,
    "tajuk_hadith": "Keutamaan Memakan Tujuh Biji Kurma 'Ajwa Setiap Pagi",
    "perawi_melayu": "Diriwayatkan daripada Sa`d:",
    "english_text": "Allah's Messenger (ﷺ) said, \"He who eats seven 'Ajwa dates every morning, will not be affected by poison or \nmagic on the day he eats them.\"",
    "arabic_text": "حَدَّثَنَا جُمْعَةُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مَرْوَانُ، أَخْبَرَنَا هَاشِمُ بْنُ هَاشِمٍ، أَخْبَرَنَا عَامِرُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ تَصَبَّحَ كُلَّ يَوْمٍ سَبْعَ تَمَرَاتٍ عَجْوَةً لَمْ يَضُرُّهُ فِي ذَلِكَ الْيَوْمِ سُمٌّ وَلاَ سِحْرٌ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda, \"Sesiapa yang memakan tujuh biji kurma 'Ajwa setiap pagi, dia tidak akan terpengaruh oleh racun atau sihir pada hari dia memakannya.\""
  },
  {
    "id": 5233,
    "hadith_number": 5233,
    "tajuk_hadith": "Larangan Makan Dua Kurma Sekaligus Kecuali Mendapat Kebenaran",
    "perawi_melayu": "Diriwayatkan oleh Jabala bin Suhaim.",
    "english_text": "At the time of Ibn Az-Zubair, we were struck with famine, and he provided us with dates for our food. \n`Abdullah bin `Umar used to pass by us while we were eating, and say, \"Do not eat two dates together \nat a time, for the Prophet (ﷺ) forbade the taking of two dates together at a time (in a gathering).\" Ibn \n`Umar used to add, \"Unless one takes the permission of one's companions.\"",
    "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا جَبَلَةُ بْنُ سُحَيْمٍ، قَالَ أَصَابَنَا عَامُ سَنَةٍ مَعَ ابْنِ الزُّبَيْرِ فَرَزَقَنَا تَمْرًا، فَكَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ يَمُرُّ بِنَا وَنَحْنُ نَأْكُلُ وَيَقُولُ لاَ تُقَارِنُوا فَإِنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ الْقِرَانِ‏.‏ ثُمَّ يَقُولُ إِلاَّ أَنْ يَسْتَأْذِنَ الرَّجُلُ أَخَاهُ‏.‏ قَالَ شُعْبَةُ الإِذْنُ مِنْ قَوْلِ ابْنِ عُمَرَ‏.‏",
    "malay_translation": "Semasa zaman Ibn Az-Zubair, kami dilanda kebuluran, dan beliau menyediakan kami dengan kurma sebagai makanan. Abdullah bin Umar sering lalu di hadapan kami semasa kami sedang makan, dan berkata, \"Jangan makan dua biji kurma sekaligus, kerana Nabi (ﷺ) melarang makan dua biji kurma sekaligus (dalam satu majlis).\" Ibn Umar menambah, \"Kecuali seseorang itu mendapat kebenaran daripada sahabatnya.\""
  },
  {
    "id": 5234,
    "hadith_number": 5234,
    "tajuk_hadith": "Nabi (ﷺ) Makan Kurma Segar Bersama Timun Ular",
    "perawi_melayu": "Diriwayatkan daripada Abdullah bin Ja`far:",
    "english_text": "I saw the Prophet (ﷺ) eating fresh dates with snake cucumbers.",
    "arabic_text": "حَدَّثَنِي إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ جَعْفَرٍ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَأْكُلُ الرُّطَبَ بِالْقِثَّاءِ‏.‏",
    "malay_translation": "Aku melihat Nabi (ﷺ) memakan kurma segar bersama timun ular."
  },
  {
    "id": 5235,
    "hadith_number": 5235,
    "tajuk_hadith": "Pokok Kurma: Kiasan Sifat Seorang Muslim",
    "perawi_melayu": "Diriwayatkan oleh Ibnu `Umar:",
    "english_text": "The Prophet (ﷺ) said, \"There is a tree among the trees which is similar to a Muslim (in goodness), and that \nis the date palm tree.\"",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مُحَمَّدُ بْنُ طَلْحَةَ، عَنْ زُبَيْدٍ، عَنْ مُجَاهِدٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏مِنَ الشَّجَرِ شَجَرَةٌ تَكُونُ مِثْلَ الْمُسْلِمِ، وَهْىَ النَّخْلَةُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda, \"Sesungguhnya di antara pokok terdapat satu pokok yang menyamai seorang Muslim (dalam kebaikan), iaitu pokok kurma.\""
  },
  {
    "id": 5236,
    "hadith_number": 5236,
    "tajuk_hadith": "Rasulullah (ﷺ) Makan Kurma Segar Bersama Timun Ular",
    "perawi_melayu": "Diriwayatkan oleh Abdullah bin Ja'far:",
    "english_text": "I saw Allah's Messenger (ﷺ) eating fresh dates with snake cucumbers.",
    "arabic_text": "حَدَّثَنَا ابْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ ـ رضى الله عنهما ـ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْكُلُ الرُّطَبَ بِالْقِثَّاءِ‏.‏",
    "malay_translation": "Saya melihat Rasulullah (ﷺ) makan kurma segar bersama timun ular."
  },
  {
    "id": 5237,
    "hadith_number": 5237,
    "tajuk_hadith": "Keajaiban Rezeki: Hidangan Ummu Sulaim",
    "perawi_melayu": "Diriwayatkan oleh Anas:",
    "english_text": "My mother, Um Sulaim, took a Mudd of barley grain, ground it and made porridge from it, and \npressed (over it), a butter skin she had with her. Then she sent me to the Prophet, and I reached him \nwhile he was sitting with his companions. I invited him, whereupon he said, \"And those who are with \nme?' I returned and said, \"He says, 'And those who are with me?\" Abu Talha went out to him and said, \n\"O Allah's Messenger (ﷺ)! It is just a meal prepared by Um Sulaim.\" The Prophet (ﷺ) entered and the food was \nbrought to him. He said, \"Let ten persons enter upon me.\" Those ten entered and ate their fill. Again \nhe said, 'Let ten (more) enter upon me.\" Those ten entered and ate their fill. Then he said, \"Let ten \n(more) enter upon me.\" He called forty persons in all Then Allah's Messenger (ﷺ) ate and got up. I started \nlooking (at the food) to see if it decreased or not.",
    "arabic_text": "حَدَّثَنَا الصَّلْتُ بْنُ مُحَمَّدٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنِ الْجَعْدِ أَبِي عُثْمَانَ، عَنْ أَنَسٍ،‏.‏ وَعَنْ هِشَامٍ، عَنْ مُحَمَّدٍ، عَنْ أَنَسٍ،‏.‏ وَعَنْ سِنَانٍ أَبِي رَبِيعَةَ، عَنْ أَنَسٍ، أَنَّ أُمَّ سُلَيْمٍ، أُمَّهُ عَمَدَتْ إِلَى مُدٍّ مِنْ شَعِيرٍ، جَشَّتْهُ وَجَعَلَتْ مِنْهُ خَطِيفَةً، وَعَصَرَتْ عُكَّةً عِنْدَهَا، ثُمَّ بَعَثَتْنِي إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَتَيْتُهُ وَهْوَ فِي أَصْحَابِهِ فَدَعَوْتُهُ قَالَ ‏\"‏ وَمَنْ مَعِي ‏\"‏‏.‏ فَجِئْتُ فَقُلْتُ إِنَّهُ يَقُولُ، وَمَنْ مَعِي، فَخَرَجَ إِلَيْهِ أَبُو طَلْحَةَ قَالَ يَا رَسُولَ اللَّهِ إِنَّمَا هُوَ شَىْءٌ صَنَعَتْهُ أُمُّ سُلَيْمٍ، فَدَخَلَ فَجِيءَ بِهِ وَقَالَ ‏\"‏ أَدْخِلْ عَلَىَّ عَشَرَةً ‏\"‏‏.‏ فَدَخَلُوا فَأَكَلُوا حَتَّى شَبِعُوا، ثُمَّ قَالَ ‏\"‏ أَدْخِلْ عَلَىَّ عَشَرَةً ‏\"‏‏.‏ فَدَخَلُوا فَأَكَلُوا حَتَّى شَبِعُوا، ثُمَّ قَالَ ‏\"‏ أَدْخِلْ عَلَىَّ عَشَرَةً ‏\"‏‏.‏ حَتَّى عَدَّ أَرْبَعِينَ، ثُمَّ أَكَلَ النَّبِيُّ صلى الله عليه وسلم ثُمَّ قَامَ، فَجَعَلْتُ أَنْظُرُ هَلْ نَقَصَ مِنْهَا شَىْءٌ‏.‏",
    "malay_translation": "Ibuku, Ummu Sulaim, mengambil segenggam gandum barli, mengisarnya dan membuat bubur daripadanya, dan meletakkan (di atasnya), kulit mentega yang ada padanya. Kemudian dia menghantarku kepada Nabi, dan aku tiba kepada baginda semasa baginda sedang duduk bersama para sahabatnya. Aku menjemputnya, lalu baginda bersabda, \"Dan orang yang bersamaku?\" Aku kembali dan berkata, \"Baginda bersabda, 'Dan orang yang bersamaku?\" Abu Talhah keluar kepada baginda dan berkata, \"Wahai Rasulullah (ﷺ)! Ia hanyalah hidangan yang disediakan oleh Ummu Sulaim.\" Nabi (ﷺ) masuk dan makanan itu dibawa kepadanya. Baginda bersabda, \"Biarkan sepuluh orang masuk kepadaku.\" Sepuluh orang itu masuk dan makan sehingga kenyang. Kemudian baginda bersabda lagi, 'Biarkan sepuluh (lagi) masuk kepadaku.\" Sepuluh orang itu masuk dan makan sehingga kenyang. Kemudian baginda bersabda, \"Biarkan sepuluh (lagi) masuk kepadaku.\" Baginda memanggil empat puluh orang semuanya. Kemudian Rasulullah (ﷺ) makan dan bangun. Aku mula melihat (pada makanan) untuk melihat sama ada ia berkurangan atau tidak."
  },
  {
    "id": 5238,
    "hadith_number": 5238,
    "tajuk_hadith": "Larangan Mendekati Masjid Setelah Memakan Bawang Putih",
    "perawi_melayu": "Diriwayatkan oleh 'Abdul 'Aziz:",
    "english_text": "It was said to Anas \"What did you hear the Prophet (ﷺ) saying about garlic?\" Anas replied, \"Whoever has \neaten (garlic) should not approach our mosque.\"",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ، قَالَ قِيلَ لأَنَسٍ مَا سَمِعْتَ النَّبِيَّ صلى الله عليه وسلم فِي الثُّومِ فَقَالَ ‏\n\"‏ مَنْ أَكَلَ فَلاَ يَقْرَبَنَّ مَسْجِدَنَا ‏\"‏‏.‏",
    "malay_translation": "Dikatakan kepada Anas, \"Apakah yang kamu dengar daripada Nabi (ﷺ) mengenai bawang putih?\" Anas menjawab, \"Sesiapa yang memakannya, janganlah dia menghampiri masjid kami.\""
  },
  {
    "id": 5239,
    "hadith_number": 5239,
    "tajuk_hadith": "Larangan Mendekati Masjid Setelah Memakan Bawang Putih atau Bawang Merah",
    "perawi_melayu": "Diriwayatkan oleh Jabir bin Abdullah:",
    "english_text": "The Prophet (ﷺ) said, \"Whoever has eaten garlic or onion should keep away from us (or should keep away \nfrom our mosque).\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا أَبُو صَفْوَانَ عَبْدُ اللَّهِ بْنُ سَعِيدٍ، أَخْبَرَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي عَطَاءٌ، أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ زَعَمَ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ أَكَلَ ثُومًا أَوْ بَصَلاً فَلْيَعْتَزِلْنَا، أَوْ لِيَعْتَزِلْ مَسْجِدَنَا ‏\"‏‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda, \"Sesiapa yang memakan bawang putih atau bawang merah, hendaklah menjauhi kami (atau menjauhi masjid kami).\""
  },
  {
    "id": 5240,
    "hadith_number": 5240,
    "tajuk_hadith": "Mengumpul Al-Kabath di Mar-Az-Zahran",
    "perawi_melayu": "Diriwayatkan oleh Jabir bin `Abdullah:",
    "english_text": "We were with Allah's Messenger (ﷺ) collecting Al-Kabath at Mar-Az-Zahran. The Prophet (ﷺ) said, \"Collect the \nblack ones, for they are better.\" Somebody said, (O Allah's Messenger (ﷺ)!) Have you ever shepherded \nsheep?\" He said, \"There has been no prophet but has shepherded them. \"",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، قَالَ أَخْبَرَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِمَرِّ الظَّهْرَانِ نَجْنِي الْكَبَاثَ فَقَالَ ‏\"‏ عَلَيْكُمْ بِالأَسْوَدِ مِنْهُ، فَإِنَّهُ أَيْطَبُ ‏\"‏‏.‏ فَقَالَ أَكُنْتَ تَرْعَى الْغَنَمَ قَالَ ‏\"‏ نَعَمْ، وَهَلْ مِنْ نَبِيٍّ إِلاَّ رَعَاهَا ‏\"‏‏.‏",
    "malay_translation": "Kami bersama Rasulullah ﷺ sedang mengumpul Al-Kabath di Mar-Az-Zahran. Nabi ﷺ bersabda, \"Kumpulkan yang berwarna hitam, kerana ia lebih baik.\" Seseorang bertanya, \"Wahai Rasulullah ﷺ! Adakah engkau pernah menggembala kambing?\" Baginda menjawab, \"Tiada seorang nabi pun melainkan pernah menggembala kambing.\""
  },
  {
    "id": 5241,
    "hadith_number": 5241,
    "tajuk_hadith": "Peristiwa Makan Sawiq dan Solat di Khaibar",
    "perawi_melayu": "Diriwayatkan oleh Suwaid bin An Nu`man:",
    "english_text": "We went out with Allah's Messenger (ﷺ) to Khaibar, and when we reached As-Sahba', the Prophet (ﷺ) asked for \nfood, and he was offered nothing but Sawiq. We ate, and then Allah's Messenger (ﷺ) stood up for the prayer. \nHe rinsed his mouth with water, and we too, rinsed our mouths.",
    "arabic_text": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ سُوَيْدِ بْنِ النُّعْمَانِ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى خَيْبَرَ، فَلَمَّا كُنَّا بِالصَّهْبَاءِ دَعَا بِطَعَامٍ فَمَا أُتِيَ إِلاَّ بِسَوِيقٍ، فَأَكَلْنَا فَقَامَ إِلَى الصَّلاَةِ، فَتَمَضْمَضَ وَمَضْمَضْنَا‏.‏",
    "malay_translation": "Kami keluar bersama Rasulullah (ﷺ) ke Khaibar, dan ketika kami tiba di As-Sahba', Nabi (ﷺ) meminta makanan, dan tidak ada yang dihidangkan kecuali Sawiq. Kami makan, kemudian Rasulullah (ﷺ) bangun untuk solat. Baginda berkumur dengan air, dan kami juga berkumur."
  },
  {
    "id": 5242,
    "hadith_number": 5242,
    "tajuk_hadith": "Nabi (ﷺ) Solat Maghrib Tanpa Berwuduk Selepas Makan Sawiq di Khaibar",
    "perawi_melayu": "Diriwayatkan oleh Suwaid:",
    "english_text": "We went out with \nAllah's Messenger (ﷺ) to Khaibar. and when we reached As-Sahba', which (Yahya says) is one day' journey \nfrom Khaibar, the Prophet (ﷺ) asked for food, and he was offered nothing but Sawiq which we chewed \nand ate. Then the Prophet (ﷺ) asked for water and rinsed his mouth, and we too, rinsed our mouths along \nwith him. He then led us in the Maghrib prayer without performing ablution again.",
    "arabic_text": "قَالَ يَحْيَى سَمِعْتُ بُشَيْرًا، يَقُولُ حَدَّثَنَا سُوَيْدٌ، خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى خَيْبَرَ، فَلَمَّا كُنَّا بِالصَّهْبَاءِ ـ قَالَ يَحْيَى وَهْىَ مِنْ خَيْبَرَ عَلَى رَوْحَةٍ ـ دَعَا بِطَعَامٍ فَمَا أُتِيَ إِلاَّ بِسَوِيقٍ، فَلُكْنَاهُ فَأَكَلْنَا مَعَهُ، ثُمَّ دَعَا بِمَاءٍ فَمَضْمَضَ وَمَضْمَضْنَا مَعَهُ، ثُمَّ صَلَّى بِنَا الْمَغْرِبَ وَلَمْ يَتَوَضَّأْ‏.‏ وَقَالَ سُفْيَانُ كَأَنَّكَ تَسْمَعُهُ مِنْ يَحْيَى‏.‏",
    "malay_translation": "Kami keluar bersama Rasulullah ﷺ ke Khaibar. Apabila kami sampai di As-Sahba', yang (Yahya berkata) adalah perjalanan sehari dari Khaibar, Nabi ﷺ meminta makanan, dan tidak ada yang ditawarkan melainkan Sawiq yang kami kunyah dan makan. Kemudian Nabi ﷺ meminta air dan berkumur, dan kami juga berkumur bersama Baginda. Kemudian Baginda memimpin kami solat Maghrib tanpa berwuduk semula."
  },
  {
    "id": 5243,
    "hadith_number": 5243,
    "tajuk_hadith": "Adab Makan: Jangan Mengelap Tangan Sebelum Menjilat atau Dijilat",
    "perawi_melayu": "Diriwayatkan oleh Ibnu Abbas:",
    "english_text": "The Prophet (ﷺ) said, 'When you eat, do not wipe your hands till you have licked it, or had it licked by \nsomebody else.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا أَكَلَ أَحَدُكُمْ فَلاَ يَمْسَحْ يَدَهُ حَتَّى يَلْعَقَهَا أَوْ يُلْعِقَهَا ‏\"‏‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda, \"Apabila seseorang daripada kamu makan, janganlah dia mengelap tangannya sehingga dia menjilatnya atau menyuruh orang lain menjilatnya.\""
  },
  {
    "id": 5244,
    "hadith_number": 5244,
    "tajuk_hadith": "Tidak Wajib Wuduk Selepas Makan Makanan Dimasak",
    "perawi_melayu": "Diriwayatkan daripada Sa`id bin Al-Harith:",
    "english_text": "that he asked Jabir bin `Abdullah about performing ablution after taking a cooked meal. He replied, \"It \nis not essential,\" and added, \"We never used to get such kind of food during the lifetime of the \nProphet except rarely; and if at all we got such a dish, we did not have any handkerchiefs to wipe our \nhands with except the palms of our hands, our forearms and our feet. We would perform the prayer \nthereafter with-out performing new ablution.\"",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ فُلَيْحٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ سَعِيدِ بْنِ الْحَارِثِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّهُ سَأَلَهُ عَنِ الْوُضُوءِ مِمَّا مَسَّتِ النَّارُ، فَقَالَ لاَ قَدْ كُنَّا زَمَانَ النَّبِيِّ صلى الله عليه وسلم لاَ نَجِدُ مِثْلَ ذَلِكَ مِنَ الطَّعَامِ إِلاَّ قَلِيلاً، فَإِذَا نَحْنُ وَجَدْنَاهُ لَمْ يَكُنْ لَنَا مَنَادِيلُ، إِلاَّ أَكُفَّنَا وَسَوَاعِدَنَا وَأَقْدَامَنَا، ثُمَّ نُصَلِّي وَلاَ نَتَوَضَّأُ‏.‏",
    "malay_translation": "Hadith ini menceritakan tentang Jabir bin `Abdullah yang ditanya mengenai berwuduk selepas makan makanan yang dimasak. Beliau menjawab, \"Ia tidak wajib,\" dan menambah, \"Kami tidak pernah mendapat makanan seperti itu semasa hayat Nabi ﷺ kecuali jarang sekali; dan jika kami mendapat hidangan sedemikian, kami tidak mempunyai sebarang sapu tangan untuk mengelap tangan kami kecuali tapak tangan kami, lengan bawah kami dan kaki kami. Kami akan menunaikan solat selepas itu tanpa mengambil wuduk baru.\""
  },
  {
    "id": 5245,
    "hadith_number": 5245,
    "tajuk_hadith": "Doa Selepas Makan Rasulullah (ﷺ)",
    "perawi_melayu": "Riwayat Abu Umama:",
    "english_text": "Whenever the dining sheet of the Prophet (ﷺ) was taken away (i.e., whenever he finished his meal), he \nused to say: \"Al-hamdu li l-lah kathiran taiyiban mubarakan fihi ghaira makfiy wala muWada` wala \nmustaghna'anhu Rabbuna.\"",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ ثَوْرٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ أَبِي أُمَامَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا رَفَعَ مَائِدَتَهُ قَالَ ‏\n\"‏ الْحَمْدُ لِلَّهِ كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ، غَيْرَ مَكْفِيٍّ، وَلاَ مُوَدَّعٍ وَلاَ مُسْتَغْنًى عَنْهُ، رَبَّنَا ‏\"‏‏.‏",
    "malay_translation": "Apabila hidangan makan Nabi (ﷺ) diangkat (iaitu, apabila baginda selesai makan), baginda biasa mengucapkan: \"Al-hamdu lillahi kathiran taiyiban mubarakan fihi ghaira makfiy wala muWada` wala mustaghna'anhu Rabbuna.\" (Segala puji bagi Allah, pujian yang banyak, yang baik, yang diberkati padanya, tidak terhingga, tidak ditinggalkan, dan tidak dapat ditinggalkan, Tuhan kami)."
  },
  {
    "id": 5246,
    "hadith_number": 5246,
    "tajuk_hadith": "Doa Selepas Makan",
    "perawi_melayu": "Diriwayatkan oleh Abu Umama:",
    "english_text": "Whenever the Prophet (ﷺ) finished his meals (or when his dining sheet was taken away), he used to say. \n\"Praise be to Allah Who has satisfied our needs and quenched our thirst. Your favor cannot by \ncompensated or denied.\" Once he said, upraise be to You, O our Lord! Your favor cannot be \ncompensated, nor can be left, nor can be dispensed with, O our Lord!\"",
    "arabic_text": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ ثَوْرِ بْنِ يَزِيدَ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ أَبِي أُمَامَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا فَرَغَ مِنْ طَعَامِهِ ـ وَقَالَ مَرَّةً إِذَا رَفَعَ مَائِدَتَهُ ـ قَالَ ‏\n\"‏ الْحَمْدُ لِلَّهِ الَّذِي كَفَانَا وَأَرْوَانَا، غَيْرَ مَكْفِيٍّ، وَلاَ مَكْفُورٍ ـ وَقَالَ مَرَّةً الْحَمْدُ لِلَّهِ رَبِّنَا، غَيْرَ مَكْفِيٍّ، وَلاَ مُوَدَّعٍ ـ وَلاَ مُسْتَغْنًى، رَبَّنَا ‏\"‏‏.‏",
    "malay_translation": "Apabila Nabi (ﷺ) selesai makan (atau apabila hamparan hidangan diangkat), baginda selalu mengucapkan:\n\"Segala puji bagi Allah yang telah mencukupi keperluan kami dan menghilangkan dahaga kami. Nikmat-Mu tidak dapat dibalas atau dinafikan.\" Baginda juga pernah bersabda: \"Segala puji bagi-Mu, Ya Tuhan kami! Nikmat-Mu tidak dapat dibalas, tidak dapat ditinggalkan, dan tidak dapat diabaikan, Ya Tuhan kami!\""
  },
  {
    "id": 5247,
    "hadith_number": 5247,
    "tajuk_hadith": "Kebaikan Terhadap Pembantu Dalam Menyediakan Makanan",
    "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \"When your servant brings your food to you, if you do not ask him to join you, then \nat least ask him to take one or two handfuls, for he has suffered from its heat (while cooking it) and \nhas taken pains to cook it nicely.\"",
    "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدٍ ـ هُوَ ابْنُ زِيَادٍ ـ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا أَتَى أَحَدَكُمْ خَادِمُهُ بِطَعَامِهِ، فَإِنْ لَمْ يُجْلِسْهُ مَعَهُ فَلْيُنَاوِلْهُ أُكْلَةً أَوْ أُكْلَتَيْنِ، أَوْ لُقْمَةً أَوْ لُقْمَتَيْنِ، فَإِنَّهُ وَلِيَ حَرَّهُ وَعِلاَجَهُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda, \"Apabila pembantu kamu membawakan makanan kepadamu, jika kamu tidak mengajaknya makan bersama, maka berilah dia makanan satu atau dua suapan, kerana dia telah menderita kepanasan (semasa memasaknya) dan telah bersusah payah memasaknya dengan baik.\""
  },
  {
    "id": 5248,
    "hadith_number": 5248,
    "tajuk_hadith": "Abu Shu'aib Menjamu Rasulullah (ﷺ) dan Sahabat",
    "perawi_melayu": "Diriwayatkan oleh Abu Mas`ud Al-Ansari:",
    "english_text": "There was an Ansari man nicknamed, Abu Shu'aib, who had a slave who was a butcher. He came to \nthe Prophet (ﷺ) while he was sitting with his companions and noticed the signs of hunger on the face of \nthe Prophet (ﷺ) . So he went to his butcher slave and said, \"Prepare for me a meal sufficient for five \npersons so that I may invite the Prophet (ﷺ) along with four other men.\" He had the meal prepared for him \nand invited him. A (sixth) man followed them. The Prophet (ﷺ) said, \"O Abu Shu'aib! Another man has \nfollowed us. If you wish, you may invite him; and if you wish, you may refuse him.\" Abu Shu'aib \nsaid, \"No, I will admit him.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي الأَسْوَدِ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا شَقِيقٌ، حَدَّثَنَا أَبُو مَسْعُودٍ الأَنْصَارِيُّ، قَالَ كَانَ رَجُلٌ مِنَ الأَنْصَارِ يُكْنَى أَبَا شُعَيْبٍ، وَكَانَ لَهُ غُلاَمٌ لَحَّامٌ، فَأَتَى النَّبِيَّ صلى الله عليه وسلم وَهْوَ فِي أَصْحَابِهِ، فَعَرَفَ الْجُوعَ فِي وَجْهِ النَّبِيِّ صلى الله عليه وسلم فَذَهَبَ إِلَى غُلاَمِهِ اللَّحَّامِ فَقَالَ اصْنَعْ لِي طَعَامًا يَكْفِي خَمْسَةً، لَعَلِّي أَدْعُو النَّبِيَّ صلى الله عليه وسلم خَامِسَ خَمْسَةٍ‏.‏ فَصَنَعَ لَهُ طُعَيِّمًا، ثُمَّ أَتَاهُ فَدَعَاهُ، فَتَبِعَهُمْ رَجُلٌ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ يَا أَبَا شُعَيْبٍ إِنَّ رَجُلاً تَبِعَنَا فَإِنْ شِئْتَ أَذِنْتَ لَهُ، وَإِنْ شِئْتَ تَرَكْتَهُ ‏\"‏‏.‏ قَالَ لاَ بَلْ أَذِنْتُ لَهُ‏.‏",
    "malay_translation": "Seorang lelaki Ansar bernama Abu Shu'aib mempunyai seorang hamba yang merupakan seorang tukang daging. Dia menemui Nabi (ﷺ) semasa baginda sedang duduk bersama para sahabat, dan perasan tanda-tanda kelaparan pada wajah Nabi (ﷺ). Lalu dia pergi kepada hambanya yang merupakan tukang daging itu dan berkata, \"Sediakan untukku makanan yang mencukupi untuk lima orang supaya aku dapat menjemput Nabi (ﷺ) bersama empat orang lagi.\" Dia menyediakan makanan untuknya lalu menjemput Nabi (ﷺ). Seorang lelaki (keenam) mengikuti mereka. Nabi (ﷺ) bersabda, \"Wahai Abu Shu'aib! Seorang lagi lelaki telah mengikuti kita. Jika kamu mahu, kamu boleh menjemputnya; dan jika kamu mahu, kamu boleh menolaknya.\" Abu Shu'aib berkata, \"Tidak, aku akan menerimanya.\""
  },
  {
    "id": 5249,
    "hadith_number": 5249,
    "tajuk_hadith": "Rasulullah (ﷺ) Memotong Daging Kambing dan Solat Tanpa Wuduk Baru",
    "perawi_melayu": "Diriwayatkan oleh 'Amr bin Umaiyya",
    "english_text": "That he saw Allah's Messenger (ﷺ) cutting a piece of mutton from its shoulder part he was carrying in his \nhand. When he was called for prayer, he put it down and the knife with which he was cutting it. Then \nhe stood up and offered the prayer without performing new ablution.",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ،‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي جَعْفَرُ بْنُ عَمْرِو بْنِ أُمَيَّةَ، أَنَّ أَبَاهُ، عَمْرَو بْنَ أُمَيَّةَ أَخْبَرَهُ أَنَّهُ، رَأَى رَسُولَ اللَّهِ صلى الله عليه وسلم يَحْتَزُّ مِنْ كَتِفِ شَاةٍ فِي يَدِهِ، فَدُعِيَ إِلَى الصَّلاَةِ فَأَلْقَاهَا وَالسِّكِّينَ الَّتِي كَانَ يَحْتَزُّ بِهَا، ثُمَّ قَامَ فَصَلَّى، وَلَمْ يَتَوَضَّأْ‏.‏",
    "malay_translation": "Bahawa dia melihat Rasulullah (ﷺ) memotong sekeping daging kambing dari bahagian bahunya yang sedang dipegangnya. Apabila beliau dipanggil untuk solat, beliau meletakkannya dan pisau yang digunakan untuk memotongnya. Kemudian beliau bangun dan menunaikan solat tanpa mengambil wuduk baru."
  },
  {
    "id": 5250,
    "hadith_number": 5250,
    "tajuk_hadith": "Keutamaan Makan Malam Sebelum Solat Isyak",
    "perawi_melayu": "Diriwayatkan daripada Anas bin Malik:",
    "english_text": "The Prophet (ﷺ) said, If supper is served and the Iqama for (Isha) prayer \n     is proclaimed, start with you supper first.\"",
    "arabic_text": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا وُهَيْبٌ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا وُضِعَ الْعَشَاءُ وَأُقِيمَتِ الصَّلاَةُ فَابْدَءُوا بِالْعَشَاءِ ‏\"‏‏.‏",
    "malay_translation": "Nabi (ﷺ) bersabda: “Jika makan malam telah dihidangkan dan iqamah untuk solat Isyak telah dilaungkan, maka mulakanlah dengan makan malam terlebih dahulu.”"
  },
  {
    "id": 5251,
    "hadith_number": 5251,
    "tajuk_hadith": "Ibn Umar Menjamu Selera Sambil Mendengar Bacaan Imam",
    "perawi_melayu": "Diriwayatkan oleh Nafi'",
    "english_text": "Once Ibn Umar was taking his supper while he was listening to the \n     recitation of (Quran by) the Imam (in the Isha prayer).",
    "arabic_text": "وَعَنْ أَيُّوبَ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ‏.‏\nوَعَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ تَعَشَّى مَرَّةً وَهْوَ يَسْمَعُ قِرَاءَةَ الإِمَامِ‏.‏",
    "malay_translation": "Suatu ketika, Ibn Umar sedang menjamu selera makan malamnya sementara beliau mendengar bacaan (al-Quran) oleh Imam (dalam solat Isyak)."
  },
  {
    "id": 5252,
    "hadith_number": 5252,
    "tajuk_hadith": "Makan Malam Dahulu Sebelum Solat Isyak Jika Sudah Dihidangkan",
    "perawi_melayu": "Riwayat Aishah:",
    "english_text": "The Prophet (ﷺ) said, \"If the Iqama for (`Isha') prayer is proclaimed and supper is served, take your supper \nfirst.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا أُقِيمَتِ الصَّلاَةُ وَحَضَرَ الْعَشَاءُ فَابْدَءُوا بِالْعَشَاءِ ‏\"‏‏.‏ قَالَ وُهَيْبٌ وَيَحْيَى بْنُ سَعِيدٍ عَنْ هِشَامٍ ‏\"‏ إِذَا وُضِعَ الْعَشَاءُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah (ﷺ) bersabda, \"Apabila iqamat solat Isyak telah dilaungkan dan makan malam telah dihidangkan, maka makanlah makan malam dahulu.\""
  },
  {
    "id": 5253,
    "hadith_number": 5253,
    "tajuk_hadith": "Kisah Penurunan Ayat Hijab",
    "perawi_melayu": "Diriwayatkan oleh Anas",
    "english_text": "I know (about) the Hijab (the order of veiling of women) more than anybody else. Ubai bin Ka`b used \nto ask me about it. Allah's Messenger (ﷺ) became the bridegroom of Zainab bint Jahsh whom he married at \nMedina. After the sun had risen high in the sky, the Prophet (ﷺ) invited the people to a meal. Allah's \nApostle remained sitting and some people remained sitting with him after the other guests had left. \nThen Allah's Messenger (ﷺ) got up and went away, and I too, followed him till he reached the door of \n`Aisha's room. Then he thought that the people must have left the place by then, so he returned and I \nalso returned with him. Behold, the people were still sitting at their places. So he went back again for \nthe second time, and I went along with him too. When we reached the door of `Aisha's room, he \nreturned and I also returned with him to see that the people had left. Thereupon the Prophet (ﷺ) hung a \ncurtain between me and him and the Verse regarding the order for (veiling of women) Hijab was \nrevealed.",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنِي أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ أَنَسًا، قَالَ أَنَا أَعْلَمُ النَّاسِ، بِالْحِجَابِ كَانَ أُبَىُّ بْنُ كَعْبٍ يَسْأَلُنِي عَنْهُ، أَصْبَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَرُوسًا بِزَيْنَبَ ابْنَةِ جَحْشٍ وَكَانَ تَزَوَّجَهَا بِالْمَدِينَةِ، فَدَعَا النَّاسَ لِلطَّعَامِ بَعْدَ ارْتِفَاعِ النَّهَارِ، فَجَلَسَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَجَلَسَ مَعَهُ رِجَالٌ بَعْدَ مَا قَامَ الْقَوْمُ، حَتَّى قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَمَشَى وَمَشَيْتُ مَعَهُ، حَتَّى بَلَغَ باب حُجْرَةِ عَائِشَةَ، ثُمَّ ظَنَّ أَنَّهُمْ خَرَجُوا فَرَجَعْتُ مَعَهُ، فَإِذَا هُمْ جُلُوسٌ مَكَانَهُمْ، فَرَجَعَ وَرَجَعْتُ مَعَهُ الثَّانِيَةَ، حَتَّى بَلَغَ باب حُجْرَةِ عَائِشَةَ فَرَجَعَ وَرَجَعْتُ مَعَهُ، فَإِذَا هُمْ قَامُوا، فَضَرَبَ بَيْنِي وَبَيْنَهُ سِتْرًا، وَأُنْزِلَ الْحِجَابُ‏.‏",
    "malay_translation": "Saya tahu (tentang) Hijab (perintah menutup aurat wanita) lebih daripada orang lain. Ubai bin Ka`b selalu bertanya kepada saya tentangnya. Rasulullah ﷺ menjadi pengantin lelaki kepada Zainab binti Jahsh yang dikahwininya di Madinah. Selepas matahari naik tinggi di langit, Nabi ﷺ menjemput orang ramai ke jamuan makan. Rasulullah ﷺ terus duduk dan beberapa orang terus duduk bersamanya selepas tetamu lain telah beredar. Kemudian Rasulullah ﷺ bangun dan pergi, dan saya juga mengikutnya sehingga beliau sampai ke pintu bilik `Aisha. Kemudian beliau menyangka orang ramai pasti telah meninggalkan tempat itu, jadi beliau kembali dan saya juga kembali bersamanya. Lihatlah, orang ramai masih duduk di tempat mereka. Jadi beliau kembali lagi untuk kali kedua, dan saya mengikutnya juga. Apabila kami sampai ke pintu bilik `Aisha, beliau kembali dan saya juga kembali bersamanya untuk melihat bahawa orang ramai telah pergi. Selepas itu Nabi ﷺ memasang tirai antara saya dan beliau dan ayat tentang perintah (menutup aurat wanita) Hijab telah diturunkan."
  }
]
