[
  {
    "id": 6479,
    "hadith_number": 6479,
    "tajuk_hadith": "Lawatan Rasulullah SAW dan Abu Bakar serta Wahyu tentang Pewarisan",
    "perawi_melayu": "Riwayat Jabir bin Abdullah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ يَقُولُ مَرِضْتُ فَعَادَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ وَهُمَا مَاشِيَانِ، فَأَتَانِي وَقَدْ أُغْمِيَ عَلَىَّ فَتَوَضَّأَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَبَّ عَلَىَّ وَضُوءَهُ فَأَفَقْتُ‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ كَيْفَ أَصْنَعُ فِي مَالِي، كَيْفَ أَقْضِي فِي مَالِي فَلَمْ يُجِبْنِي بِشَىْءٍ حَتَّى نَزَلَتْ آيَةُ الْمَوَارِيثِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah bin Sa'id, telah menceritakan kepada kami Sufyan, dari Muhammad bin Munkidir, telah mendengar Jabir bin Abdullah r.a berkata, \"Aku sakit, maka Rasulullah SAW dan Abu Bakar melawatku dengan berjalan kaki. Mereka datang ketika aku telah pengsan.  Rasulullah SAW berwuduk, lalu menyiramkan air wuduknya kepadaku, maka aku sedar.  Lalu aku berkata, \"Wahai Rasulullah, bagaimanakah aku harus berbuat dengan hartaku? Bagaimanakah aku membahagikan hartaku?\" Baginda tidak menjawab apa-apa sehingga turun ayat-ayat tentang pewarisan."
  },
  {
    "id": 6480,
    "hadith_number": 6480,
    "tajuk_hadith": "Amaran Mengenai Syak, Mencari Kesalahan Orang Lain, dan Permusuhan",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "Allah's Messenger (ﷺ) said, 'Beware of suspicion, for it is the worst of false tales and don't look for the \nother's faults and don't spy and don't hate each other, and don't desert (cut your relations with) one \nanother O Allah's slaves, be brothers!\" (See Hadith No. 90)",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِيَّاكُمْ وَالظَّنَّ فَإِنَّ الظَّنَّ أَكْذَبُ الْحَدِيثِ، وَلاَ تَحَسَّسُوا، وَلاَ تَجَسَّسُوا، وَلاَ تَبَاغَضُوا، وَلاَ تَدَابَرُوا، وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: “Jauhilah sangkaan kerana sangkaan itu adalah  jenis berita palsu yang paling buruk. Janganlah kamu mencari-cari kesalahan orang lain, jangan kamu mengintip, jangan kamu bermusuhan, dan jangan kamu memutuskan hubungan sesama kamu. Wahai hamba-hamba Allah, jadilah kamu semua sebagai saudara!” (Rujuk Hadis No. 90)"
  },
  {
    "id": 6481,
    "hadith_number": 6481,
    "tajuk_hadith": "Warisan Rasulullah SAW dan Harta Fadak",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ فَاطِمَةَ، وَالْعَبَّاسَ ـ عَلَيْهِمَا السَّلاَمُ ـ أَتَيَا أَبَا بَكْرٍ يَلْتَمِسَانِ مِيرَاثَهُمَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُمَا حِينَئِذٍ يَطْلُبَانِ أَرْضَيْهِمَا مِنْ فَدَكَ، وَسَهْمَهُمَا مِنْ خَيْبَرَ‏.‏   فَقَالَ لَهُمَا أَبُو بَكْرٍ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ نُورَثُ، مَا تَرَكْنَا صَدَقَةٌ، إِنَّمَا يَأْكُلُ آلُ مُحَمَّدٍ مِنْ هَذَا الْمَالِ ‏\"‏‏.‏ قَالَ أَبُو بَكْرٍ وَاللَّهِ لاَ أَدَعُ أَمْرًا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَصْنَعُهُ فِيهِ إِلاَّ صَنَعْتُهُ‏.‏ قَالَ فَهَجَرَتْهُ فَاطِمَةُ، فَلَمْ تُكَلِّمْهُ حَتَّى مَاتَتْ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Muhammad, telah menceritakan kepada kami Hisyam, telah memberitakan kepada kami Ma'mar, dari Az- Zuhri, dari Urwah, dari Aisyah, bahawa Fatimah dan Abbas - semoga Allah merahmati mereka berdua - telah datang kepada Abu Bakar untuk meminta bahagian pusaka mereka daripada Rasulullah SAW. Ketika itu, mereka berdua meminta tanah mereka di Fadak dan bahagian mereka dari Khaibar.\n\nMaka Abu Bakar berkata kepada mereka berdua: \"Saya telah mendengar Rasulullah SAW bersabda: ‘Kami tidak diwarisi, apa yang kami tinggalkan adalah sedekah, hanya keluarga Muhammad sahaja yang boleh mengambil keperluan mereka dari harta ini.’\"\n\nAbu Bakar berkata: \"Demi Allah, saya tidak akan meninggalkan sesuatu perkara yang saya telah lihat Rasulullah SAW melakukannya terhadap harta ini melainkan saya akan melakukannya juga.\"  Maka Fatimah memboikot Abu Bakar dan tidak bercakap dengannya sehingga beliau meninggal dunia."
  },
  {
    "id": 6482,
    "hadith_number": 6482,
    "tajuk_hadith": "Harta Nabi Tidak Diwarisi",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "The Prophet (ﷺ) said, \"Our (Apostles') property should not be inherited, and whatever we leave, is to be spent in charity.\"",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبَانَ، أَخْبَرَنَا ابْنُ الْمُبَارَكِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ نُورَثُ مَا تَرَكْنَا صَدَقَةٌ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Kami (para Rasul) tidak diwarisi harta kami, dan apa sahaja yang kami tinggalkan adalah sedekah.\""
  },
  {
    "id": 6483,
    "hadith_number": 6483,
    "tajuk_hadith": "Pengurusan Harta Pusaka Rasulullah SAW",
    "perawi_melayu": "Daripada Malik bin Aus",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي مَالِكُ بْنُ أَوْسِ بْنِ الْحَدَثَانِ،، وَكَانَ، مُحَمَّدُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍ ذَكَرَ لِي مِنْ حَدِيثِهِ ذَلِكَ، فَانْطَلَقْتُ حَتَّى دَخَلْتُ عَلَيْهِ فَسَأَلْتُهُ فَقَالَ انْطَلَقْتُ حَتَّى أَدْخُلَ عَلَى عُمَرَ فَأَتَاهُ حَاجِبُهُ يَرْفَأُ فَقَالَ هَلْ لَكَ فِي عُثْمَانَ وَعَبْدِ الرَّحْمَنِ وَالزُّبَيْرِ وَسَعْدٍ قَالَ نَعَمْ‏.‏ فَأَذِنَ لَهُمْ، ثُمَّ قَالَ هَلْ لَكَ فِي عَلِيٍّ وَعَبَّاسٍ قَالَ نَعَمْ‏.‏ قَالَ عَبَّاسٌ يَا أَمِيرَ الْمُؤْمِنِينَ اقْضِ بَيْنِي وَبَيْنَ هَذَا‏.‏ قَالَ أَنْشُدُكُمْ بِاللَّهِ الَّذِي بِإِذْنِهِ تَقُومُ السَّمَاءُ وَالأَرْضُ هَلْ تَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ نُورَثُ مَا تَرَكْنَا صَدَقَةٌ ‏\"‏‏.‏ يُرِيدُ رَسُولُ اللَّهِ صلى الله عليه وسلم نَفْسَهُ‏.‏ فَقَالَ الرَّهْطُ قَدْ قَالَ ذَلِكَ‏.‏ فَأَقْبَلَ عَلَى عَلِيٍّ وَعَبَّاسٍ فَقَالَ هَلْ تَعْلَمَانِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ذَلِكَ قَالاَ قَدْ قَالَ ذَلِكَ‏.‏ قَالَ عُمَرُ فَإِنِّي أُحَدِّثُكُمْ عَنْ هَذَا الأَمْرِ، إِنَّ اللَّهَ قَدْ كَانَ خَصَّ رَسُولَهُ صلى الله عليه وسلم فِي هَذَا الْفَىْءِ بِشَىْءٍ لَمْ يُعْطِهِ أَحَدًا غَيْرَهُ، فَقَالَ عَزَّ وَجَلَّ ‏{‏مَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ‏}‏ إِلَى قَوْلِهِ ‏{‏قَدِيرٌ‏}‏ فَكَانَتْ خَالِصَةً لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَاللَّهِ مَا احْتَازَهَا دُونَكُمْ، وَلاَ اسْتَأْثَرَ بِهَا عَلَيْكُمْ، لَقَدْ أَعْطَاكُمُوهُ وَبَثَّهَا فِيكُمْ، حَتَّى بَقِيَ مِنْهَا هَذَا الْمَالُ، فَكَانَ النَّبِيُّ صلى الله عليه وسلم يُنْفِقُ عَلَى أَهْلِهِ مِنْ هَذَا الْمَالِ نَفَقَةَ سَنَتِهِ، ثُمَّ يَأْخُذُ مَا بَقِيَ فَيَجْعَلُهُ مَجْعَلَ مَالِ اللَّهِ، فَعَمِلَ بِذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَيَاتَهُ، أَنْشُدُكُمْ بِاللَّهِ هَلْ تَعْلَمُونَ ذَلِكَ قَالُوا نَعَمْ‏.‏ ثُمَّ قَالَ لِعَلِيٍّ وَعَبَّاسٍ أَنْشُدُكُمَا بِاللَّهِ هَلْ تَعْلَمَانِ ذَلِكَ قَالاَ نَعَمْ‏.‏ فَتَوَفَّى اللَّهُ نَبِيَّهُ صلى الله عليه وسلم فَقَالَ أَبُو بَكْرٍ أَنَا وَلِيُّ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَبَضَهَا فَعَمِلَ بِمَا عَمِلَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ تَوَفَّى اللَّهُ أَبَا بَكْرٍ فَقُلْتُ أَنَا وَلِيُّ وَلِيِّ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَبَضْتُهَا سَنَتَيْنِ أَعْمَلُ فِيهَا مَا عَمِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ، ثُمَّ جِئْتُمَانِي وَكَلِمَتُكُمَا وَاحِدَةٌ، وَأَمْرُكُمَا جَمِيعٌ، جِئْتَنِي تَسْأَلُنِي نَصِيبَكَ مِنِ ابْنِ أَخِيكَ، وَأَتَانِي هَذَا يَسْأَلُنِي نَصِيبَ امْرَأَتِهِ مِنْ أَبِيهَا فَقُلْتُ إِنْ شِئْتُمَا دَفَعْتُهَا إِلَيْكُمَا بِذَلِكَ، فَتَلْتَمِسَانِ مِنِّي قَضَاءً غَيْرَ ذَلِكَ، فَوَاللَّهِ الَّذِي بِإِذْنِهِ تَقُومُ السَّمَاءُ وَالأَرْضُ، لاَ أَقْضِي فِيهَا قَضَاءً غَيْرَ ذَلِكَ حَتَّى تَقُومَ السَّاعَةُ، فَإِنْ عَجَزْتُمَا فَادْفَعَاهَا إِلَىَّ، فَأَنَا أَكْفِيكُمَاهَا‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Yahya bin Bukair, telah menceritakan kepada kami Laits, dari Uqail, dari Ibnu Syihab, dia berkata; Malik bin Aus bin Al-Hadatsani telah memberitakan kepadaku, dan Muhammad bin Jubair bin Mu'tim telah menceritakan kepadaku dari haditsnya, maka aku pun pergi sehingga aku masuk kepada Umar, maka datanglah kepada Umar pengawalnya, Yarfa', lalu dia berkata, \"Adakah engkau ingin bertemu dengan Uthman, Abdurrahman, Az-Zubair dan Saad?\" Umar berkata, \"Ya.\" Maka dia pun mengizinkan mereka, kemudian dia berkata lagi, \"Adakah engkau ingin bertemu dengan Ali dan Abbas?\" Umar berkata, \"Ya.\" Abbas berkata, \"Wahai Amirul Mukminin, putuskanlah perkara di antara aku dan orang ini (Ali).\" Umar berkata, \"Aku bersumpah kepadamu dengan Allah SWT yang dengan izin-Nya langit dan bumi berdiri tegak, adakah kamu sekalian mengetahui bahawa Rasulullah SAW telah bersabda: \"Kami (para rasul) tidak mewarisi harta, dan apa yang kami tinggalkan adalah sedekah.\" Rasulullah SAW bermaksud dirinya sendiri.\" Maka para sahabat itu berkata, \"Sesungguhnya beliau telah bersabda demikian.\" Maka Umar pun berpaling kepada Ali dan Abbas, lalu berkata, \"Adakah kamu berdua mengetahui bahawa Rasulullah SAW telah bersabda demikian?\" Mereka berdua menjawab, \"Sesungguhnya beliau telah bersabda demikian.\" Umar berkata, \"Maka aku akan bercerita kepadamu tentang perkara ini. Sesungguhnya Allah SWT telah mengkhususkan Rasul-Nya SAW dalam fai' ini dengan sesuatu yang tidak diberikan-Nya kepada orang lain selainnya. Allah SWT berfirman: {Apa yang Allah berikan kepada Rasul-Nya...} sehingga firman-Nya {Yang Maha Kuasa}. Maka harta itu adalah khusus untuk Rasulullah SAW, dan demi Allah, baginda tidak mengambilnya untuk diri baginda sendiri dan tidak pula menahannya dari kamu sekalian, sesungguhnya baginda telah memberikannya kepada kamu dan membahagikannya di kalangan kamu sehingga tinggallah harta ini, maka Nabi SAW membelanjakan dari harta ini nafkah setahun untuk keluarganya, kemudian apa yang tinggal, baginda jadikannya seperti harta Allah SWT. Demikianlah yang dikerjakan oleh Rasulullah SAW sepanjang hayat baginda. Aku bersumpah kepadamu dengan Allah SWT, adakah kamu sekalian mengetahui hal itu?\" Mereka berkata, \"Ya.\" Kemudian Umar berkata kepada Ali dan Abbas, \"Aku bersumpah kepadamu berdua dengan Allah SWT, adakah kamu berdua mengetahui hal itu?\" Mereka berdua berkata, \"Ya.\" Kemudian Allah SWT menjemput Nabi-Nya SAW, maka Abu Bakar berkata, \"Akulah wali kepada Rasulullah SAW,\" maka dia pun mengambil harta itu dan menguruskannya sepertimana yang dikerjakan oleh Rasulullah SAW. Kemudian Allah SWT menjemput Abu Bakar, maka aku berkata, \"Akulah wali kepada wali Rasulullah SAW,\" maka aku pun mengambil harta itu selama dua tahun, aku menguruskannya sepertimana yang dikerjakan oleh Rasulullah SAW dan Abu Bakar. Kemudian kamu berdua datang kepadaku, perkataan dan urusan kamu berdua sama, kamu datang kepadaku meminta bahagianmu dari harta anak saudara lelaki kamu, dan orang ini (Ali) datang kepadaku meminta bahagian isterinya dari harta bapanya. Maka aku berkata, \"Jika kamu berdua menghendaki, aku akan menyerahkannya kepadamu dengan cara demikian (seperti cara Rasulullah SAW, Abu Bakar dan Umar).\" Maka kamu berdua meminta keputusan daripadaku selain dari itu. Demi Allah SWT yang dengan izin-Nya langit dan bumi berdiri tegak, aku tidak akan memberikan keputusan selain dari itu sehingga hari kiamat. Jika kamu berdua tidak mampu menguruskannya, maka serahkanlah ia kepadaku, maka aku akan cukup menguruskannya bagi kamu berdua.\""
  },
  {
    "id": 6484,
    "hadith_number": 6484,
    "tajuk_hadith": "Harta Rasulullah SAW Disedekahkan",
    "perawi_melayu": "Dari Abu Hurairah",
    "english_text": "Allah's Messenger (ﷺ) said, \"Not even a single Dinar of my property should be distributed (after my death) to my inheritors, but whatever I leave excluding the provision for my wives and my servants, should be spent in charity.\"",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَقْتَسِمُ وَرَثَتِي دِينَارًا، مَا تَرَكْتُ بَعْدَ نَفَقَةِ نِسَائِي وَمُؤْنَةِ عَامِلِي فَهْوَ صَدَقَةٌ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Harta peninggalan saya, tidak sepeser pun dinar akan dibahagikan kepada waris-waris saya. Apa sahaja yang saya tinggalkan selepas perbelanjaan untuk isteri-isteri dan pekerja-pekerja saya, hendaklah disedekahkan.\""
  },
  {
    "id": 6485,
    "hadith_number": 6485,
    "tajuk_hadith": "Harta Nabi Tidak Diwarisi",
    "perawi_melayu": "Riwayat Urwah",
    "english_text": "`Aisha said, \"When Allah's Messenger (ﷺ) died, his wives intended to send `Uthman to Abu Bakr asking him \nfor their share of the inheritance.\" Then `Aisha said to them, \"Didn't Allah's Messenger (ﷺ) say, 'Our \n(Apostles') property is not to be inherited, and whatever we leave is to be spent in charity?'\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ أَزْوَاجَ، النَّبِيِّ صلى الله عليه وسلم حِينَ تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَرَدْنَ أَنْ يَبْعَثْنَ عُثْمَانَ إِلَى أَبِي بَكْرٍ يَسْأَلْنَهُ مِيرَاثَهُنَّ‏.‏ فَقَالَتْ عَائِشَةُ أَلَيْسَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ نُورَثُ مَا تَرَكْنَا صَدَقَةٌ ‏\"‏‏.‏",
    "malay_translation": "Aisyah berkata, \"Ketika Rasulullah ﷺ wafat, isteri-isterinya berniat untuk menghantar Uthman kepada Abu Bakar untuk meminta bahagian pusaka mereka.\" Kemudian Aisyah berkata kepada mereka, \"Bukankah Rasulullah ﷺ telah bersabda, 'Kami (para Rasul) tidak diwarisi, dan apa sahaja yang kami tinggalkan adalah sedekah?'\""
  },
  {
    "id": 6486,
    "hadith_number": 6486,
    "tajuk_hadith": "Keutamaan Nabi SAW terhadap Umat dan Tanggungjawab Hutang",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \"I am more closer to the believers than their own selves, so whoever (of them) dies \nwhile being in debt and leaves nothing for its repayment, then we are to pay his debts on his behalf \nand whoever (among the believers) dies leaving some property, then that property is for his heirs.\"",
    "arabic_text": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي أَبُو سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَنَا أَوْلَى، بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ، فَمَنْ مَاتَ وَعَلَيْهِ دَيْنٌ، وَلَمْ يَتْرُكْ وَفَاءً، فَعَلَيْنَا قَضَاؤُهُ، وَمَنْ تَرَكَ مَالاً فَلِوَرَثَتِهِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Aku lebih dekat kepada orang-orang beriman daripada diri mereka sendiri.  Oleh itu, sesiapa yang mati dalam keadaan berhutang dan tidak meninggalkan harta untuk membayarnya, maka kami akan membayar hutangnya bagi pihak mereka. Dan sesiapa yang mati meninggalkan harta, maka harta itu adalah untuk warisnya.\""
  },
  {
    "id": 6487,
    "hadith_number": 6487,
    "tajuk_hadith": "Pembahagian Faraid dan Baki Harta Pusaka",
    "perawi_melayu": "Riwayat Ibnu Abbas:",
    "english_text": "The Prophet (ﷺ) said, \"Give the Fara'id (the shares of the inheritance that are prescribed in the Qur'an) to \nthose who are entitled to receive it. Then whatever remains, should be given to the closest male \nrelative of the deceased .\"",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا، فَمَا بَقِيَ فَهْوَ لأَوْلَى رَجُلٍ ذَكَرٍ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Berikan faraid (pembahagian harta pusaka yang telah ditetapkan di dalam Al-Quran) kepada mereka yang berhak menerimanya. Kemudian apa yang tinggal, berikanlah kepada kaum kerabat lelaki yang terdekat dengan si mati.\""
  },
  {
    "id": 6488,
    "hadith_number": 6488,
    "tajuk_hadith": "Wakaf dan Hijrah Selepas Kematian Nabi SAW",
    "perawi_melayu": "Riwayat Sa'd bin Abi Waqqas:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الزُّهْرِيُّ، قَالَ أَخْبَرَنِي عَامِرُ بْنُ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِيهِ، قَالَ مَرِضْتُ بِمَكَّةَ مَرَضًا، فَأَشْفَيْتُ مِنْهُ عَلَى الْمَوْتِ، فَأَتَانِي النَّبِيُّ صلى الله عليه وسلم يَعُودُنِي فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ لِي مَالاً كَثِيرًا، وَلَيْسَ يَرِثُنِي إِلاَّ ابْنَتِي، أَفَأَتَصَدَّقُ بِثُلُثَىْ مَالِي قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قَالَ قُلْتُ فَالشَّطْرُ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ الثُّلُثُ قَالَ ‏\"‏ الثُّلُثُ كَبِيرٌ إِنَّكَ إِنْ تَرَكْتَ وَلَدَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَتْرُكَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ، وَإِنَّكَ لَنْ تُنْفِقَ نَفَقَةً إِلاَّ أُجِرْتَ عَلَيْهَا، حَتَّى اللُّقْمَةَ تَرْفَعُهَا إِلَى فِي امْرَأَتِكَ ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ أَأُخَلَّفُ عَنْ هِجْرَتِي فَقَالَ ‏\"‏ لَنْ تُخَلَّفَ بَعْدِي فَتَعْمَلَ عَمَلاً تُرِيدُ بِهِ وَجْهَ اللَّهِ، إِلاَّ ازْدَدْتَ بِهِ رِفْعَةً وَدَرَجَةً، وَلَعَلَّ أَنْ تُخَلَّفَ بَعْدِي حَتَّى يَنْتَفِعَ بِكَ أَقْوَامٌ وَيُضَرَّ بِكَ آخَرُونَ، لَكِنِ الْبَائِسُ سَعْدُ ابْنُ خَوْلَةَ يَرْثِي لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ مَاتَ بِمَكَّةَ ‏\"‏‏.‏ قَالَ سُفْيَانُ وَسَعْدُ بْنُ خَوْلَةَ رَجُلٌ مِنْ بَنِي عَامِرِ بْنِ لُؤَىٍّ‏.‏",
    "malay_translation": "Kami telah diberitakan oleh Al- Humaidi, yang telah diberitakan kepadanya oleh Sufyan, yang telah diberitakan kepadanya oleh Az- Zuhri, katanya: Amir bin Sa'd bin Abi Waqqas telah menceritakan kepadaku daripada bapanya, katanya: Aku telah sakit di Mekah dengan penyakit yang hampir membawa maut. Maka Nabi SAW datang melawatku. Aku berkata: Wahai Rasulullah, sesungguhnya aku mempunyai harta yang banyak, dan tiada yang mewarisi aku melainkan anak perempuanku seorang. Adakah aku bersedekah dengan dua pertiga daripada hartaku? Baginda menjawab: \"Tidak\". Aku bertanya: Bagaimana separuh darinya? Baginda menjawab: \"Tidak\". Aku bertanya: Bagaimana sepertiga darinya? Baginda menjawab: \"Sepertiga adalah banyak, sesungguhnya jika engkau meninggalkan anak-anakmu dalam keadaan kaya adalah lebih baik daripada meninggalkan mereka dalam keadaan miskin, meminta-minta kepada orang lain. Dan sesungguhnya engkau tidak akan membelanjakan sesuatu pun melainkan engkau akan diberi pahala ke atasnya, bahkan sesuap makanan yang engkau berikan kepada isterimu.\" Aku berkata: Wahai Rasulullah, adakah aku akan ketinggalan daripada hijrahku? Baginda menjawab: \"Engkau tidak akan ketinggalan sesudahku, kemudian engkau melakukan sesuatu amalan yang diniatkan kerana Allah SWT, melainkan engkau akan bertambah ketinggian dan darjat. Dan mungkin engkau akan ditinggalkan sesudahku sehingga orang ramai akan mendapat manfaat darimu dan orang lain akan mendapat mudarat darimu. Tetapi yang malang ialah Sa'd bin Khawlah, Rasulullah SAW meratapi kematiannya di Mekah.\" Sufyan berkata: Sa'd bin Khawlah adalah seorang lelaki daripada Bani Amir bin Luai."
  },
  {
    "id": 6489,
    "hadith_number": 6489,
    "tajuk_hadith": "Pengagihan Harta Pusaka: Anak Perempuan dan Kakak Perempuan",
    "perawi_melayu": "Riwayat Al-Aswad bin Yazid:",
    "english_text": "Mu`adh bin Jabal came to us in Yemen as a tutor and a ruler, and we (the people of Yemen) asked him \nabout (the distribution of the property of ) a man who had died leaving a daughter and a sister. Mu`adh \ngave the daughter one-half of the property and gave the sister the other half.",
    "arabic_text": "حَدَّثَنِي مَحْمُودٌ، حَدَّثَنَا أَبُو النَّضْرِ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، شَيْبَانُ عَنْ أَشْعَثَ، عَنِ الأَسْوَدِ بْنِ يَزِيدَ، قَالَ أَتَانَا مُعَاذُ بْنُ جَبَلٍ بِالْيَمَنِ مُعَلِّمًا وَأَمِيرًا، فَسَأَلْنَاهُ عَنْ رَجُلٍ، تُوُفِّيَ وَتَرَكَ ابْنَتَهُ وَأُخْتَهُ، فَأَعْطَى الاِبْنَةَ النِّصْفَ وَالأُخْتَ النِّصْفَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Mahmud, telah menceritakan kepada kami Abu Nadhr, telah menceritakan kepada kami Abu Muawiyah, Syiban daripada Asy’ats, daripada Al-Aswad bin Yazid, katanya:  “Telah datang kepada kami Mu’adz bin Jabal di Yaman sebagai guru dan pemerintah. Maka kami bertanya kepadanya tentang seorang lelaki yang meninggal dunia dan meninggalkan seorang anak perempuan dan seorang kakak perempuan.  Maka Mu’adz memberi kepada anak perempuan itu separuh harta dan kepada kakak perempuan itu separuh harta.”"
  },
  {
    "id": 6490,
    "hadith_number": 6490,
    "tajuk_hadith": "Pembahagian Faraid dan Baki Harta Pusaka",
    "perawi_melayu": "Daripada Ibnu Abbas",
    "english_text": "Allah's Messenger (ﷺ) said, \"Give the Fara'id (shares prescribed in the Qur'an) to those who are entitled to receive it; and whatever remains, should be given to the closest male relative of the deceased.'",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا فَمَا بَقِيَ فَهْوَ لأَوْلَى رَجُلٍ ذَكَرٍ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Berikan faraid (pembahagian harta pusaka seperti yang telah ditetapkan di dalam al-Quran) kepada mereka yang berhak menerimanya.  Apa yang tinggal selebihnya, berikan kepada waris lelaki terdekat daripada si mati.\""
  },
  {
    "id": 6491,
    "hadith_number": 6491,
    "tajuk_hadith": "Pengagihan Harta Pusaka: Pendapat Abu Musa dan Ibn Mas'ud",
    "perawi_melayu": "Riwayat Huzail bin Syurahbil:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا أَبُو قَيْسٍ، سَمِعْتُ هُزَيْلَ بْنَ شُرَحْبِيلَ، قَالَ سُئِلَ أَبُو مُوسَى عَنِ ابْنَةٍ وَابْنَةِ ابْنٍ وَأُخْتٍ، فَقَالَ لِلاِبْنَةِ النِّصْفُ وَلِلأُخْتِ النِّصْفُ، وَأْتِ ابْنَ مَسْعُودٍ فَسَيُتَابِعُنِي‏.‏ فَسُئِلَ ابْنُ مَسْعُودٍ وَأُخْبِرَ بِقَوْلِ أَبِي مُوسَى، فَقَالَ لَقَدْ ضَلَلْتُ إِذًا وَمَا أَنَا مِنَ الْمُهْتَدِينَ،، أَقْضِي فِيهَا بِمَا قَضَى النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لِلاِبْنَةِ النِّصْفُ، وَلاِبْنَةِ ابْنٍ السُّدُسُ تَكْمِلَةَ الثُّلُثَيْنِ، وَمَا بَقِيَ فَلِلأُخْتِ ‏\"‏‏.‏ فَأَتَيْنَا أَبَا مُوسَى فَأَخْبَرْنَاهُ بِقَوْلِ ابْنِ مَسْعُودٍ، فَقَالَ لاَ تَسْأَلُونِي مَا دَامَ هَذَا الْحَبْرُ فِيكُمْ‏.‏",
    "malay_translation": "Kami telah diberitakan oleh Adam, yang telah diberitakan kepadanya oleh Syu'bah, yang telah diberitakan kepadanya oleh Abu Qais, bahawa aku telah mendengar Huzail bin Syurahbil berkata: Abu Musa ditanya tentang bahagian pusaka seorang anak perempuan, anak perempuan daripada anak lelaki, dan seorang adik perempuan. Maka beliau berkata: \"Bagi anak perempuan, separuh; dan bagi adik perempuan, separuh.\" Pergilah kepada Ibn Mas'ud, nescaya dia akan mengesahkan pendapatku.  Kemudian Ibn Mas'ud ditanya dan diberitahu tentang pendapat Abu Musa. Maka beliau berkata: \"Sekiranya aku memberikan keputusan yang sama, nescaya aku telah sesat dan aku bukanlah daripada golongan yang mendapat petunjuk.\" Aku akan memutuskan perkara ini berdasarkan keputusan Nabi ﷺ iaitu: bagi anak perempuan, separuh; dan bagi anak perempuan daripada anak lelaki, sepetis (seperenam), melengkapi dua pertiga daripada keseluruhan harta; dan baki harta adalah bagi adik perempuan.  Kemudian kami menemui Abu Musa dan memberitahunya tentang keputusan Ibn Mas'ud. Maka beliau berkata: \"Janganlah kamu bertanya kepadaku selagi ulama' yang berilmu ini masih berada di kalangan kamu.\""
  },
  {
    "id": 6492,
    "hadith_number": 6492,
    "tajuk_hadith": "Pembahagian Faraid dan Baki Harta Pusaka",
    "perawi_melayu": "Daripada Ibnu Abbas:",
    "english_text": "The Prophet (ﷺ) said, \"Give the Fara'id, (the shares prescribed in the Qur'an) to those who are entitled to \nreceive it, and then whatever remains, should be given to the closest male relative of the deceased.\"",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا وُهَيْبٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا فَمَا بَقِيَ فَلأَوْلَى رَجُلٍ ذَكَرٍ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Berikanlah faraid (pembahagian harta pusaka yang telah ditetapkan di dalam al-Quran) kepada mereka yang berhak menerimanya, dan apa yang tinggal selebihnya, hendaklah diberikan kepada saudara lelaki terdekat yang masih hidup daripada si mati.\""
  },
  {
    "id": 6493,
    "hadith_number": 6493,
    "tajuk_hadith": "Persaudaraan Islam Lebih Utama",
    "perawi_melayu": "Riwayat Ibnu Abbas:",
    "english_text": "The person about whom Allah's Messenger (ﷺ) said, \"If I were to take a Khalil from this nation (my \nfollowers), then I would have taken him (i.e., Abu Bakr), but the Islamic Brotherhood is better (or \nsaid: good),\" regarded a grandfather as the father himself (in inheritance).",
    "arabic_text": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أَمَّا الَّذِي قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ كُنْتُ مُتَّخِذًا مِنْ هَذِهِ الأُمَّةِ خَلِيلاً لاَتَّخَذْتُهُ، وَلَكِنْ خُلَّةُ الإِسْلاَمِ أَفْضَلُ ‏\"‏‏.‏ أَوْ قَالَ ‏\"‏ خَيْرٌ ‏\"‏‏.‏ فَإِنَّهُ أَنْزَلَهُ أَبًا‏.‏ أَوْ قَالَ قَضَاهُ أَبًا‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Ma'mar, telah menceritakan kepada kami Abdul Warits, telah menceritakan kepada kami Ayyub, dari 'Ikrimah, dari Ibnu Abbas, dia berkata: Adapun orang yang mengenai dirinya Rasulullah SAW telah bersabda: \"Sekiranya aku hendak mengambil seorang khalil daripada umat ini, nescaya aku akan mengambilnya (iaitu Abu Bakar), tetapi persaudaraan Islam itu lebih baik.\" atau baginda bersabda: \"Lebih baik.\" Maka sesungguhnya dia telah menganggap datuknya sebagai bapanya sendiri (dalam hal pusaka)."
  },
  {
    "id": 6494,
    "hadith_number": 6494,
    "tajuk_hadith": "Penggantian Hukum Pewarisan",
    "perawi_melayu": "Riwayat Ibnu Abbas:",
    "english_text": "(During the early days of Islam), the inheritance used to be given to one's offspring and legacy used to \nbe bequeathed to the parents, then Allah cancelled what He wished from that order and decreed that \nthe male should be given the equivalent of the portion of two females, and for the parents one-sixth \nfor each of them, and for one's wife one-eighth (if the deceased has children) and one-fourth (if he has \nno children), for one's husband one-half (if the deceased has no children) and one-fourth (if she has \nchildren).",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، عَنْ وَرْقَاءَ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ الْمَالُ لِلْوَلَدِ، وَكَانَتِ الْوَصِيَّةُ لِلْوَالِدَيْنِ، فَنَسَخَ اللَّهُ مِنْ ذَلِكَ مَا أَحَبَّ، فَجَعَلَ لِلذَّكَرِ مِثْلَ حَظِّ الأُنْثَيَيْنِ، وَجَعَلَ لِلأَبَوَيْنِ لِكُلِّ وَاحِدٍ مِنْهُمَا السُّدُسُ، وَجَعَلَ لِلْمَرْأَةِ الثُّمُنَ وَالرُّبُعَ، وَلِلزَّوْجِ الشَّطْرَ وَالرُّبُعَ‏.‏",
    "malay_translation": "Pada zaman awal Islam, harta pusaka diberikan kepada anak-anak, dan wasiat diberikan kepada ibu bapa. Kemudian Allah SWT telah mensahkan apa yang Dia kehendaki daripada hukum tersebut dan menetapkan bahawa bahagian lelaki adalah dua kali ganda bahagian perempuan.  Bagi ibu bapa, masing-masing mendapat satu per enam, manakala isteri mendapat satu per lapan (jika si mati meninggalkan anak) dan satu per empat (jika si mati tidak meninggalkan anak).  Suami pula mendapat separuh (jika si mati tidak meninggalkan anak) dan satu per empat (jika si mati meninggalkan anak)."
  },
  {
    "id": 6495,
    "hadith_number": 6495,
    "tajuk_hadith": "Qisas Keguguran dan Pewarisan Harta",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "Allah's Messenger (ﷺ) gave the judgment that a male or female slave should be given in Qisas for an abortion case of a woman from the tribe of Bani Lihyan (as blood money for the fetus) but the lady on whom the penalty had been imposed died, so the Prophets ordered that her property be inherited by her offspring and her husband and that the penalty be paid by her Asaba.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي جَنِينِ امْرَأَةٍ مِنْ بَنِي لَحْيَانَ سَقَطَ مَيِّتًا بِغُرَّةٍ عَبْدٍ أَوْ أَمَةٍ‏.‏ ثُمَّ إِنَّ الْمَرْأَةَ الَّتِي قَضَى عَلَيْهَا بِالْغُرَّةِ تُوُفِّيَتْ، فَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ بِأَنَّ مِيرَاثَهَا لِبَنِيهَا وَزَوْجِهَا، وَأَنَّ الْعَقْلَ عَلَى عَصَبَتِهَا ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah, telah menceritakan kepada kami Laith, dari Ibnu Syihab, dari Ibnu Musayyab, dari Abu Hurairah, bahawa beliau berkata: Rasulullah SAW telah memutuskan hukum bagi janin wanita dari Bani Lihyan yang gugur mati, iaitu dibayar dengan seorang hamba lelaki atau perempuan (sebagai diyat). Kemudian, wanita yang dijatuhkan hukuman diyat itu meninggal dunia. Maka Rasulullah SAW memutuskan bahawa hartanya diwarisi oleh anak-anak dan suaminya, dan diyat dibayar oleh ahli warisnya."
  },
  {
    "id": 6496,
    "hadith_number": 6496,
    "tajuk_hadith": "Keputusan Mu'adz bin Jabal Mengenai Pembahagian Pusaka",
    "perawi_melayu": "Riwayat Al-Aswad:",
    "english_text": "Mu`adh bin Jabal gave this verdict for us in the lifetime of Allah's Messenger (ﷺ). One-half of the inheritance is to be given to the daughter and the other half to the sister. Sulaiman said: Mu`adh gave a verdict for us, but he did not mention that it was so in the lifetime of Allah's Messenger (ﷺ).",
    "arabic_text": "حَدَّثَنَا بِشْرُ بْنُ خَالِدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، قَالَ قَضَى فِينَا مُعَاذُ بْنُ جَبَلٍ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم النِّصْفُ لِلاِبْنَةِ وَالنِّصْفُ لِلأُخْتِ‏.‏ ثُمَّ قَالَ سُلَيْمَانُ قَضَى فِينَا‏.‏ وَلَمْ يَذْكُرْ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Mu'adz bin Jabal telah memberi keputusan di kalangan kami pada zaman Rasulullah SAW. Separuh daripada harta pusaka diberikan kepada anak perempuan dan separuh lagi kepada adik perempuan. Sulaiman berkata: Mu'adz telah memberi keputusan di kalangan kami, tetapi beliau tidak menyebut bahawa ia adalah semasa zaman Rasulullah SAW."
  },
  {
    "id": 6497,
    "hadith_number": 6497,
    "tajuk_hadith": "Pengagihan Harta Pusaka Mengikut Sunnah Nabi",
    "perawi_melayu": "Riwayat Huzail:",
    "english_text": "`Abdullah said, \"The judgment I will give in this matter will be like the judgment of the Prophet, i.e. \none-half is for the daughter and one-sixth for the son's daughter and the rest of the inheritance for the \nsister.\"",
    "arabic_text": "حَدَّثَنِي عَمْرُو بْنُ عَبَّاسٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي قَيْسٍ، عَنْ هُزَيْلٍ، قَالَ قَالَ عَبْدُ اللَّهِ لأَقْضِيَنَّ فِيهَا بِقَضَاءِ النَّبِيِّ صلى الله عليه وسلم لِلاِبْنَةِ النِّصْفُ، وَلاِبْنَةِ الاِبْنِ السُّدُسُ، وَمَا بَقِيَ فَلِلأُخْتِ‏.‏",
    "malay_translation": "Abdullah berkata, \"Aku akan menghakimi perkara ini sepertimana penghakiman Nabi SAW, iaitu: separuh untuk anak perempuan, se-perenam untuk anak perempuan daripada anak lelaki, dan selebihnya untuk adik perempuan.\""
  },
  {
    "id": 6498,
    "hadith_number": 6498,
    "tajuk_hadith": "Air Wudhuk Nabi SAW dan Ayat Faraid",
    "perawi_melayu": "Dari Jabir:",
    "english_text": "While I was sick, the Prophet (ﷺ) entered upon me and asked for some water to perform ablution, and \nafter he had finished his ablution, he sprinkled some water of his ablution over me, whereupon I \nbecame conscious and said, \"O Allah's Messenger (ﷺ)! I have sisters.\" Then the Divine Verses regarding the \nlaws of inheritance were revealed.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، قَالَ سَمِعْتُ جَابِرًا ـ رضى الله عنه ـ قَالَ دَخَلَ عَلَىَّ النَّبِيُّ صلى الله عليه وسلم وَأَنَا مَرِيضٌ، فَدَعَا بِوَضُوءٍ فَتَوَضَّأَ، ثُمَّ نَضَحَ عَلَىَّ مِنْ وَضُوئِهِ فَأَفَقْتُ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّمَا لِي أَخَوَاتٌ‏.‏ فَنَزَلَتْ آيَةُ الْفَرَائِضِ‏.‏",
    "malay_translation": "Ketika aku sakit, Nabi SAW masuk menjengukku dan meminta air untuk berwuduk.  Setelah selesai berwuduk, baginda menyiramkan sedikit air wuduknya ke atasku.  Maka aku sedar dan berkata, \"Wahai Rasulullah, saya hanya mempunyai beberapa orang kakak perempuan.\"  Kemudian turunlah ayat-ayat mengenai hukum faraid (pembahagian harta pusaka)."
  },
  {
    "id": 6499,
    "hadith_number": 6499,
    "tajuk_hadith": "Ayat Akhir Yang Diturunkan",
    "perawi_melayu": "Daripada Al-Bara’",
    "english_text": "The last Qur'anic Verse that was revealed (to the Prophet) was the final Verse of Surat-an-Nisa, i.e., \n'They ask you for a legal verdict Say: Allah directs (thus) About those who leave No descendants or \nascendants as heirs....' (4.176)",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ آخِرُ آيَةٍ نَزَلَتْ خَاتِمَةُ سُورَةِ النِّسَاءِ ‏{‏يَسْتَفْتُونَكَ قُلِ اللَّهُ يُفْتِيكُمْ فِي الْكَلاَلَةِ‏}‏",
    "malay_translation": "Telah menceritakan kepada kami Ubaidullah bin Musa, dari Israil, dari Abu Ishaq, daripada Al-Bara’ r.a., dia berkata: Ayat yang terakhir diturunkan ialah ayat akhir Surah An-Nisa’ iaitu: {Mereka meminta fatwa kepadamu. Katakanlah: Allah memberi fatwa kepadamu tentang perkara orang-orang yang tiada waris keturunan dan ibu bapa.}"
  },
  {
    "id": 6500,
    "hadith_number": 6500,
    "tajuk_hadith": "Rasulullah SAW: Lebih Dekat Daripada Diri Sendiri",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "Allah's Messenger (ﷺ) said, \"I am more closer to the believers than their ownselves, so whoever (among \nthem) dies leaving some inheritance, his inheritance will be given to his 'Asaba, and whoever dies \nleaving a debt or dependants or destitute children, then I am their supporter.\"",
    "arabic_text": "حَدَّثَنَا مَحْمُودٌ، أَخْبَرَنَا عُبَيْدُ اللَّهِ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَنَا أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ، فَمَنْ مَاتَ وَتَرَكَ مَالاً فَمَالُهُ لِمَوَالِي الْعَصَبَةِ، وَمَنْ تَرَكَ كَلاًّ أَوْ ضَيَاعًا، فَأَنَا وَلِيُّهُ فَلأُدْعَى لَهُ ‏\"‏‏.‏ لكل: العيال",
    "malay_translation": "Rasulullah SAW bersabda: \"Aku lebih dekat kepada orang-orang beriman daripada diri mereka sendiri.  Oleh itu, sesiapa yang meninggal dunia dan meninggalkan harta, hartanya akan diberikan kepada ahli warisnya (Asabah). Dan sesiapa yang meninggal dunia dan meninggalkan hutang, tanggungan atau anak-anak yang miskin, maka Akulah penolong mereka.\""
  },
  {
    "id": 6501,
    "hadith_number": 6501,
    "tajuk_hadith": "Pengagihan Faraid dan Harta Pusaka",
    "perawi_melayu": "Daripada Ibnu Abbas",
    "english_text": "The Prophet (ﷺ) said, \"Give the Fara'id (the shares of the inheritance that are prescribed in the Qur'an) to \nthose who are entitled to receive it; and whatever is left should be given to the closest male relative of \nthe deceased.\"",
    "arabic_text": "حَدَّثَنَا أُمَيَّةُ بْنُ بِسْطَامٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ رَوْحٍ، عَنْ عَبْدِ اللَّهِ بْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا، فَمَا تَرَكَتِ الْفَرَائِضُ فَلأَوْلَى رَجُلٍ ذَكَرٍ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Berikanlah faraid (pembahagian harta pusaka yang telah ditetapkan di dalam al-Quran) kepada mereka yang berhak menerimanya, dan apa yang tinggal selepas faraid diberikan, hendaklah diberikan kepada saudara lelaki terdekat yang masih hidup daripada si mati.\""
  },
  {
    "id": 6502,
    "hadith_number": 6502,
    "tajuk_hadith": "Pewarisan dan Ikatan Persaudaraan",
    "perawi_melayu": "Riwayat Ibnu Abbas",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ قُلْتُ لأَبِي أُسَامَةَ حَدَّثَكُمْ إِدْرِيسُ، حَدَّثَنَا طَلْحَةُ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، ‏{‏وَلِكُلٍّ جَعَلْنَا مَوَالِيَ‏}‏ ‏{‏وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ‏}‏ قَالَ كَانَ الْمُهَاجِرُونَ حِينَ قَدِمُوا الْمَدِينَةَ يَرِثُ الأَنْصَارِيُّ الْمُهَاجِرِيَّ دُونَ ذَوِي رَحِمِهِ لِلأُخُوَّةِ الَّتِي آخَى النَّبِيُّ صلى الله عليه وسلم بَيْنَهُمْ فَلَمَّا نَزَلَتْ ‏{‏جَعَلْنَا مَوَالِيَ‏}‏ قَالَ نَسَخَتْهَا ‏{‏وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ‏}‏",
    "malay_translation": "Daripada Ishak bin Ibrahim, katanya: Aku berkata kepada bapaku Usamah, telah menceritakan kepada kamu Idris, telah menceritakan kepada kami Thalhah, daripada Sa'id bin Jubair, daripada Ibnu Abbas,  {وَلِكُلٍّ جَعَلْنَا مَوَالِيَ} {وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ}.  Baginda berkata: Ketika Muhajirin tiba di Madinah, orang Ansar mewarisi Muhajirin tanpa mengambil kira kaum kerabat sendiri, kerana ikatan persaudaraan yang telah dijalinkan Nabi SAW di antara mereka.  Setelah ayat {جَعَلْنَا مَوَالِيَ} turun, maka ia telah mansukhkan ayat {وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ}."
  },
  {
    "id": 6503,
    "hadith_number": 6503,
    "tajuk_hadith": "Perceraian dan Hak Penjagaan Anak Akibat Lian",
    "perawi_melayu": "Riwayat Ibnu Umar:",
    "english_text": "A man and his wife had a case of Lian (or Mula'ana) during the lifetime of the Prophet (ﷺ) and the man denied the paternity of her child. The Prophet (ﷺ) gave his verdict for their separation (divorce) and then the child was regarded as belonging to the wife only.",
    "arabic_text": "حَدَّثَنِي يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما أَنَّ رَجُلاً، لاَعَنَ امْرَأَتَهُ فِي زَمَنِ النَّبِيِّ صلى الله عليه وسلم وَانْتَفَى مِنْ وَلَدِهَا فَفَرَّقَ النَّبِيُّ صلى الله عليه وسلم بَيْنَهُمَا، وَأَلْحَقَ الْوَلَدَ بِالْمَرْأَةِ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Yahya bin Qaz’ah, telah menceritakan kepada kami Malik, dari Nafi’, dari Ibnu Umar r.a. bahawa seorang lelaki telah melakukan li’an (menuduh isterinya berzina) terhadap isterinya pada zaman Nabi SAW, dan dia menafikan anak tersebut anaknya. Maka Nabi SAW telah menceraikan mereka berdua, dan menisbatkan anak tersebut kepada isterinya."
  },
  {
    "id": 6504,
    "hadith_number": 6504,
    "tajuk_hadith": "Hak Penjagaan Anak Luar Nikah",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ عُتْبَةُ عَهِدَ إِلَى أَخِيهِ سَعْدٍ أَنَّ ابْنَ وَلِيدَةِ زَمْعَةَ مِنِّي، فَاقْبِضْهُ إِلَيْكَ‏.‏ فَلَمَّا كَانَ عَامَ الْفَتْحِ أَخَذَهُ سَعْدٌ فَقَالَ ابْنُ أَخِي عَهِدَ إِلَىَّ فِيهِ‏.‏ فَقَامَ عَبْدُ بْنُ زَمْعَةَ فَقَالَ أَخِي وَابْنُ وَلِيدَةِ أَبِي، وُلِدَ عَلَى فِرَاشِهِ‏.‏ فَتَسَاوَقَا إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ سَعْدٌ يَا رَسُولَ اللَّهِ ابْنُ أَخِي قَدْ كَانَ عَهِدَ إِلَىَّ فِيهِ‏.‏ فَقَالَ عَبْدُ بْنُ زَمْعَةَ أَخِي وَابْنُ وَلِيدَةِ أَبِي، وُلِدَ عَلَى فِرَاشِهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هُوَ لَكَ يَا عَبْدُ بْنَ زَمْعَةَ، الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ ‏\"‏‏.‏ ثُمَّ قَالَ لِسَوْدَةَ بِنْتِ زَمْعَةَ ‏\"‏ احْتَجِبِي مِنْهُ ‏\"‏‏.‏ لِمَا رَأَى مِنْ شَبَهِهِ بِعُتْبَةَ، فَمَا رَآهَا حَتَّى لَقِيَ اللَّهَ‏.‏",
    "malay_translation": "Utba telah mewasiatkan kepada saudaranya, Saad, agar menjaga anak perempuan hamba Zam’ah, iaitu anaknya.  Ketika tahun penaklukan Mekah, Saad membawa anak itu dan berkata, “Dia adalah anak saudara saya, dan abang saya telah mewasiatkan saya untuk menjaganya.”  Kemudian, Abd bin Zam’ah bangun dan berkata, “Tetapi anak itu adalah adik saya, anak perempuan hamba bapa saya, yang dilahirkan di atas katilnya.”  Mereka berdua pergi menghadap Nabi SAW. Saad berkata, “Wahai Rasulullah SAW! Anak ini adalah anak saudara saya dan abang saya telah mewasiatkan saya untuk menjaganya.”  Kemudian Abd bin Zam’ah berkata, “Anak ini adalah adik saya dan anak perempuan hamba bapa saya, yang dilahirkan di atas katilnya.”  Nabi SAW bersabda, “Anak ini adalah untukmu wahai Abd bin Zam’ah. Anak itu mengikut pemilik katil dan bagi pezina, hukumannya adalah rejam.” Kemudian baginda memerintahkan Saudah binti Zam’ah, “Tutup auratmu darinya” kerana baginda melihat persamaan rupa anak itu dengan Utba. Sejak itu, anak tersebut tidak pernah melihat Saudah sehingga dia meninggal dunia."
  },
  {
    "id": 6505,
    "hadith_number": 6505,
    "tajuk_hadith": "Anak Kepada Pemilik Katil",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \"The boy is for the owner of the bed.\"",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، عَنْ يَحْيَى، عَنْ شُعْبَةَ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْوَلَدُ لِصَاحِبِ الْفِرَاشِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Anak itu adalah milik pemilik katil.\""
  },
  {
    "id": 6506,
    "hadith_number": 6506,
    "tajuk_hadith": "Pembelian Barira dan Hukum Wali",
    "perawi_melayu": "Riwayat `Aisyah",
    "english_text": "I bought Barira (a female slave). The Prophet (ﷺ) said (to me), \"Buy her as the Wala' is for the \nmanumitted.\" Once she was given a sheep (in charity). The Prophet (ﷺ) said, \"It (the sheep) is a charitable \ngift for her (Barira) and a gift for us.\" Al-Hakam said, \"Barira's husband was a free man.\" Ibn `Abbas \nsaid, 'When I saw him, he was a slave.\"",
    "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتِ اشْتَرَيْتُ بَرِيرَةَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اشْتَرِيهَا، فَإِنَّ الْوَلاَءَ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ وَأُهْدِيَ لَهَا شَاةٌ فَقَالَ ‏\"‏ هُوَ لَهَا صَدَقَةٌ، وَلَنَا هَدِيَّةٌ ‏\"‏‏.‏ قَالَ الْحَكَمُ وَكَانَ زَوْجُهَا حُرًّا، وَقَوْلُ الْحَكَمِ مُرْسَلٌ‏.‏ وَقَالَ ابْنُ عَبَّاسٍ رَأَيْتُهُ عَبْدًا‏.‏",
    "malay_translation": "Aku membeli Barirah (seorang hamba perempuan).  Rasulullah ﷺ bersabda kepadaku, \"Belilah dia, kerana wala' (hak ke atasnya) adalah untuk orang yang memerdekakannya.\"  Kemudian, seekor kambing diberikan kepadanya (sebagai sedekah). Rasulullah ﷺ bersabda, \"Ia (kambing itu) adalah sedekah baginya (Barirah) dan hadiah untuk kita.\" Al-Hakam berkata, \"Suami Barirah adalah seorang lelaki yang merdeka.\" Ibn Abbas berkata, 'Ketika aku melihatnya, dia adalah seorang hamba.'"
  },
  {
    "id": 6507,
    "hadith_number": 6507,
    "tajuk_hadith": "Ikatan Kesetiaan Kepada Yang Memerdekakan",
    "perawi_melayu": "Daripada Ibnu Umar:",
    "english_text": "The Prophet (ﷺ) said, \"The Wala' is for the manumitted (of the slave).",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Sesungguhnya wala' (ikatan kesetiaan) hanya untuk orang yang telah memerdekakan (hamba sahaya).\""
  },
  {
    "id": 6508,
    "hadith_number": 6508,
    "tajuk_hadith": "Membebaskan Hamba Secara Sa'iba",
    "perawi_melayu": "Dari Abdullah:",
    "english_text": "The Muslims did not free slaves as Sa'iba, but the People of the Pre-lslamic Period of Ignorance used to do so.",
    "arabic_text": "حَدَّثَنَا قَبِيصَةُ بْنُ عُقْبَةَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي قَيْسٍ، عَنْ هُزَيْلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ إِنَّ أَهْلَ الإِسْلاَمِ لا يُسَيِّبُونَ، وَإِنَّ أَهْلَ الْجَاهِلِيَّةِ كَانُوا يُسَيِّبُونَ‏.‏",
    "malay_translation": "Abdullah berkata: Orang Islam tidak melepaskan hamba sebagai Sa’iba, tetapi orang-orang jahiliyyah dahulu melakukannya."
  },
  {
    "id": 6509,
    "hadith_number": 6509,
    "tajuk_hadith": "Hamba yang Dibebaskan dan Pilihannya",
    "perawi_melayu": "Riwayat Al-Aswad:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُوسَى، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ اشْتَرَتْ بَرِيرَةَ، لِتُعْتِقَهَا، وَاشْتَرَطَ أَهْلُهَا وَلاَءَهَا فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي اشْتَرَيْتُ بَرِيرَةَ لأُعْتِقَهَا، وَإِنَّ أَهْلَهَا يَشْتَرِطُونَ وَلاَءَهَا‏.‏ فَقَالَ ‏\"‏ أَعْتِقِيهَا فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ أَوْ قَالَ ‏\"‏ أَعْطَى الثَّمَنَ ‏\"‏‏.‏ قَالَ فَاشْتَرَتْهَا فَأَعْتَقَتْهَا‏.‏ قَالَ وَخُيِّرَتْ فَاخْتَارَتْ نَفْسَهَا وَقَالَتْ لَوْ أُعْطِيتُ كَذَا وَكَذَا مَا كُنْتُ مَعَهُ‏.‏ قَالَ الأَسْوَدُ وَكَانَ زَوْجُهَا حُرًّا‏.‏ قَوْلُ الأَسْوَدِ مُنْقَطِعٌ، وَقَوْلُ ابْنِ عَبَّاسٍ رَأَيْتُهُ عَبْدًا‏.‏ أَصَحُّ‏.‏",
    "malay_translation": "Kami diberitakan oleh Musa, yang diberitakan oleh Abu 'Awana, daripada Mansur, daripada Ibrahim, daripada Al-Aswad, bahawa Aisyah - radhiallahu 'anha - telah membeli Barirah untuk membebaskannya, dan keluarga Barirah mensyaratkan kesetiaannya (wala'). Maka Aisyah berkata, \"Wahai Rasulullah, sesungguhnya saya telah membeli Barirah untuk membebaskannya, dan keluarganya mensyaratkan kesetiaannya.\" Maka Baginda SAW bersabda, \"Bebaskanlah dia, kerana kesetiaan itu adalah untuk orang yang membebaskannya,\" atau Baginda bersabda, \"yang membayar tebusannya.\" Maka Aisyah membelinya dan membebaskannya.  Kemudian Barirah diberi pilihan (oleh Nabi SAW) (sama ada untuk tinggal bersama suaminya atau meninggalkannya).  Dia berkata, \"Sekiranya dia memberi saya sekian-sekian (wang), saya tidak akan tinggal bersamanya.\"  Kata Al-Aswad, dan suaminya adalah seorang yang merdeka.  Riwayat Al-Aswad terputus, dan riwayat Ibnu Abbas, iaitu, ketika saya melihatnya dia adalah seorang hamba, adalah lebih sahih."
  },
  {
    "id": 6510,
    "hadith_number": 6510,
    "tajuk_hadith": "Madinah Sebagai Tanah Haram dan Hukuman Bagi Pelaku Kejahatan",
    "perawi_melayu": "Riwayat Ali",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ، قَالَ قَالَ عَلِيٌّ ـ رضى الله عنه مَا عِنْدَنَا كِتَابٌ نَقْرَؤُهُ إِلاَّ كِتَابُ اللَّهِ، غَيْرَ هَذِهِ الصَّحِيفَةِ‏.‏ قَالَ فَأَخْرَجَهَا فَإِذَا فِيهَا أَشْيَاءُ مِنَ الْجِرَاحَاتِ وَأَسْنَانِ الإِبِلِ‏.‏ قَالَ وَفِيهَا الْمَدِينَةُ حَرَمٌ مَا بَيْنَ عَيْرٍ إِلَى ثَوْرٍ، فَمَنْ أَحْدَثَ فِيهَا حَدَثًا، أَوْ آوَى مُحْدِثًا، فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يُقْبَلُ مِنْهُ يَوْمَ الْقِيَامَةِ صَرْفٌ وَلاَ عَدْلٌ، وَمَنْ وَالَى قَوْمًا بِغَيْرِ إِذْنِ مَوَالِيهِ، فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يُقْبَلُ مِنْهُ يَوْمَ الْقِيَامَةِ صَرْفٌ وَلاَ عَدْلٌ، وَذِمَّةُ الْمُسْلِمِينَ وَاحِدَةٌ، يَسْعَى بِهَا أَدْنَاهُمْ فَمَنْ أَخْفَرَ مُسْلِمًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يُقْبَلُ مِنْهُ يَوْمَ الْقِيَامَةِ صَرْفٌ وَلاَ عَدْلٌ‏.‏",
    "malay_translation": "Kami telah dimaklumkan oleh Qotaibah bin Sa'id, yang telah dimaklumkan kepadanya oleh Jarir, daripada al-A'masy, daripada Ibrahim al-Taymi, daripada bapanya, bahawa Ali r.a. berkata: \"Kami tidak mempunyai kitab yang kami baca kecuali kitab Allah SWT, selain daripada lembaran ini.\" Beliau mengeluarkannya, lalu didapati di dalamnya terdapat perkara-perkara berkaitan dengan kecederaan dan umur unta (untuk membayar zakat atau diyat).  Di dalamnya juga tertulis: \"Madinah adalah tanah haram di antara bukit 'Air' hingga ke bukit 'Thawr.' Oleh itu sesiapa yang melakukan sesuatu yang baru (bid'ah) di dalamnya, atau melindungi seseorang yang melakukan perkara baru (bid'ah) itu, maka ke atasnya laknat Allah SWT, malaikat dan semua manusia. Amal ibadahnya yang wajib mahupun sunat tidak akan diterima pada hari kiamat. Dan sesiapa yang berkawan dengan orang lain tanpa izin daripada tuan-tuan mereka yang sebenar, maka ke atasnya laknat Allah SWT, malaikat dan semua manusia. Amal ibadahnya yang wajib mahupun sunat tidak akan diterima pada hari kiamat. Dan jaminan orang Islam adalah satu, orang yang paling rendah taraf sekalipun boleh memberikan jaminan. Sesiapa yang mengkhianati seorang Muslim dalam hal ini, maka ke atasnya laknat Allah SWT, malaikat dan semua manusia. Amal ibadahnya yang wajib mahupun sunat tidak akan diterima pada hari kiamat.\""
  },
  {
    "id": 6511,
    "hadith_number": 6511,
    "tajuk_hadith": "Larangan Menjual atau Memberi Wala'",
    "perawi_melayu": "Riwayat Ibnu Umar:",
    "english_text": "The Prophet (ﷺ) forbade the selling of the Wala' (of slaves) or giving it as a present.",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ بَيْعِ الْوَلاَءِ وَعَنْ هِبَتِهِ‏.‏",
    "malay_translation": "Rasulullah SAW melarang penjualan wala’ (ikatan setia hamba sahaya) dan juga pemberiannya sebagai hadiah."
  },
  {
    "id": 6512,
    "hadith_number": 6512,
    "tajuk_hadith": "Aishah dan Pembebasan Hamba Sahaya",
    "perawi_melayu": "Riwayat Ibnu Umar:",
    "english_text": "That Aisha, the mother of the Believers, intended to buy a slave girl in order to manumit her. The \nslave girl's master said, \"We are ready to sell her to you on the condition that her Wala should be for \nus.\" Aisha mentioned that to Allah's Messenger (ﷺ) who said, \"This (condition) should not prevent you from \nbuying her, for the Wala is for the one who manumits (the slave).\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ، أَرَادَتْ أَنْ تَشْتَرِيَ جَارِيَةً تُعْتِقُهَا فَقَالَ أَهْلُهَا نَبِيعُكِهَا عَلَى أَنَّ وَلاَءَهَا لَنَا‏.‏ فَذَكَرَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ لاَ يَمْنَعُكِ ذَلِكِ، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏",
    "malay_translation": "Ibnu Umar meriwayatkan bahawa Aisyah, ibu kepada orang-orang beriman, berhasrat untuk membeli seorang hamba perempuan untuk dibebaskan.  Tuan hamba perempuan itu berkata, \"Kami sanggup menjualnya kepadamu dengan syarat kesetiaan (wala') akan menjadi milik kami.\" Aisyah menceritakan perkara itu kepada Rasulullah ﷺ, lalu baginda bersabda, \"Syarat itu tidak menghalangmu daripada membelinya, kerana kesetiaan (wala') adalah untuk orang yang membebaskannya.\""
  },
  {
    "id": 6513,
    "hadith_number": 6513,
    "tajuk_hadith": "Hukum Pembebasan Hamba dan Pilihan Barirah",
    "perawi_melayu": "Riwayat Al-Aswad:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتِ اشْتَرَيْتُ بَرِيرَةَ فَاشْتَرَطَ أَهْلُهَا وَلاَءَهَا، فَذَكَرَتْ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ أَعْتِقِيهَا فَإِنَّ الْوَلاَءَ لِمَنْ أَعْطَى الْوَرِقَ ‏\"‏‏.‏ قَالَتْ فَأَعْتَقْتُهَا ـ قَالَتْ ـ فَدَعَاهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَخَيَّرَهَا مِنْ زَوْجِهَا فَقَالَتْ لَوْ أَعْطَانِي كَذَا وَكَذَا مَا بِتُّ عِنْدَهُ‏.‏ فَاخْتَارَتْ نَفْسَهَا‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad, memberitakan kepada kami Jarir, dari Manshur, dari Ibrahim, dari Aswad, dari Aisyah r.a. berkata: Aku membeli Barirah, maka keluarganya mensyaratkan kesetiaannya (wala'). Maka Aisyah menceritakan hal itu kepada Nabi SAW, lalu Baginda bersabda: \"Bebaskanlah dia, kerana kesetiaan itu adalah untuk orang yang memberi wang.\" Aisyah berkata: Maka aku membebaskannya.  Rasulullah SAW memanggilnya (Barirah) lalu memberikan pilihan kepadanya tentang suaminya. Barirah berkata: Sekalipun dia memberikan sejumlah wang kepadaku, aku tidak akan tinggal bersamanya. Maka dia memilih dirinya sendiri (iaitu menolak untuk kembali kepada suaminya)."
  },
  {
    "id": 6514,
    "hadith_number": 6514,
    "tajuk_hadith": "Hak Wali Setelah Membebaskan Hamba",
    "perawi_melayu": "Riwayat Ibnu Umar:",
    "english_text": "When Aisha intended to buy Barira, she said to the Prophet, \"Barira's masters stipulated that they will \nhave the Wala.\" The Prophet (ﷺ) said (to Aisha), \"Buy her, as the Wala is for the one who manumits.\"",
    "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا هَمَّامٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ أَرَادَتْ عَائِشَةُ أَنْ تَشْتَرِيَ بَرِيرَةَ فَقَالَتْ لِلنَّبِيِّ صلى الله عليه وسلم إِنَّهُمْ يَشْتَرِطُونَ الْوَلاَءَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ اشْتَرِيهَا، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏",
    "malay_translation": "Apabila Aisyah ingin membeli Barirah, dia berkata kepada Nabi SAW, \"Tuan Barirah mensyaratkan bahawa mereka akan mendapat hak wala’.\"  Nabi SAW bersabda (kepada Aisyah), \"Belilah dia, kerana hak wala’ adalah untuk orang yang memerdekakannya.\""
  },
  {
    "id": 6515,
    "hadith_number": 6515,
    "tajuk_hadith": "Hak Wali (Penjaga) dalam Pembebasan Hamba",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "Allah's Messenger (ﷺ) said, \"The wala is for the one who gives the silver (pays the price) and does the favor (of manumission after paying the price).",
    "arabic_text": "حَدَّثَنَا ابْنُ سَلاَمٍ، أَخْبَرَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْوَلاَءُ لِمَنْ أَعْطَى الْوَرِقَ، وَوَلِيَ النِّعْمَةَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Hak wali (penjaga) adalah bagi orang yang membayar wang tebusan dan yang memberi pertolongan (pembebasan selepas membayar tebusan).\""
  },
  {
    "id": 6516,
    "hadith_number": 6516,
    "tajuk_hadith": "Hak Milik Hamba Bebas",
    "perawi_melayu": "Anas bin Malik:",
    "english_text": "The Prophet (ﷺ) said, \"The freed slave belongs to the people who have freed him,\" or said something similar.",
    "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا مُعَاوِيَةُ بْنُ قُرَّةَ، وَقَتَادَةُ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَوْلَى الْقَوْمِ مِنْ أَنْفُسِهِمْ ‏\"‏‏.‏ أَوْ كَمَا قَالَ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Hamba yang dimerdekakan adalah milik orang yang memardekakannya,\" atau sabda yang serupa."
  },
  {
    "id": 6517,
    "hadith_number": 6517,
    "tajuk_hadith": "Anak Saudara Perempuan",
    "perawi_melayu": "Anas bin Malik meriwayatkan:",
    "english_text": "The Prophet (ﷺ) said, \"The son of the sister of some people is from them or from their own selves.\"",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ ابْنُ أُخْتِ الْقَوْمِ مِنْهُمْ ‏\"‏‏.‏ أَوْ ‏\"‏ مِنْ أَنْفُسِهِمْ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Anak saudara perempuan daripada kalangan sesuatu kaum itu adalah daripada kalangan mereka atau daripada diri mereka sendiri.\""
  },
  {
    "id": 6518,
    "hadith_number": 6518,
    "tajuk_hadith": "Pewarisan Harta dan Tanggungjawab Muslim",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \" If somebody dies (among the Muslims) leaving some property, the property will go to his heirs; and if he leaves a debt or dependants, we will take care of them.\"",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيٍّ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ تَرَكَ مَالاً فَلِوَرَثَتِهِ، وَمَنْ تَرَكَ كَلاًّ فَإِلَيْنَا ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Barang siapa yang meninggal dunia (di kalangan umat Islam) meninggalkan harta, maka harta itu akan menjadi milik warisnya; dan barang siapa yang meninggalkan hutang atau tanggungan, maka kami akan menanggungnya.\""
  },
  {
    "id": 6519,
    "hadith_number": 6519,
    "tajuk_hadith": "Pewarisan Antara Muslim dan Kafir",
    "perawi_melayu": "Daripada Usamah bin Zaid:",
    "english_text": "the Prophet (ﷺ) said, \"A Muslim cannot be the heir of a disbeliever, nor can a disbeliever be the heir of a Muslim.\"",
    "arabic_text": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، عَنْ عَمْرِو بْنِ عُثْمَانَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَرِثُ الْمُسْلِمُ الْكَافِرَ، وَلاَ الْكَافِرُ الْمُسْلِمَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Orang Islam tidak akan mewarisi orang kafir, dan orang kafir tidak akan mewarisi orang Islam.\""
  },
  {
    "id": 6520,
    "hadith_number": 6520,
    "tajuk_hadith": "Pertikaian Anak Lelaki dan Hukumnya",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتِ اخْتَصَمَ سَعْدُ بْنُ أَبِي وَقَّاصٍ وَعَبْدُ بْنُ زَمْعَةَ فِي غُلاَمٍ فَقَالَ سَعْدٌ هَذَا يَا رَسُولَ اللَّهِ ابْنُ أَخِي عُتْبَةَ بْنِ أَبِي وَقَّاصٍ عَهِدَ إِلَىَّ أَنَّهُ ابْنُهُ، انْظُرْ إِلَى شَبَهِهِ‏.‏ وَقَالَ عَبْدُ بْنُ زَمْعَةَ هَذَا أَخِي يَا رَسُولَ اللَّهِ، وُلِدَ عَلَى فِرَاشِ أَبِي مِنْ وَلِيدَتِهِ‏.‏ فَنَظَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى شَبَهِهِ فَرَأَى شَبَهًا بَيِّنًا بِعُتْبَةَ فَقَالَ ‏\n\"‏ هُوَ لَكَ يَا عَبْدُ، الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ، وَاحْتَجِبِي مِنْهُ يَا سَوْدَةُ بِنْتَ زَمْعَةَ ‏\"‏‏.‏ قَالَتْ فَلَمْ يَرَ سَوْدَةَ قَطُّ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah bin Sa'id, telah menceritakan kepada kami Laith, dari Ibnu Syihab, dari Urwah, dari Aisyah r.a. bahawa dia berkata: Saad bin Abi Waqqas dan Abd bin Zam'ah berselisih faham mengenai seorang budak lelaki. Saad berkata: \"Wahai Rasulullah, ini anak saudara lelaki saya, Utbah bin Abi Waqqas, telah mewasiatkan kepadaku bahawa dia adalah anaknya, lihatlah kepada persamaannya.\"  Dan Abd bin Zam'ah berkata: \"Wahai Rasulullah, ini adalah adik saya, dia dilahirkan di atas katil ayah saya daripada hamba perempuannya.\"  Maka Rasulullah s.a.w. melihat kepada persamaan budak lelaki itu dan melihat persamaan yang jelas dengan Utbah, lalu baginda bersabda:  \"Dia adalah untukmu wahai Abd, anak itu adalah untuk pemilik katil dan bagi pezina adalah hukuman batu.  Jauhkanlah dirimu darinya wahai Saudah binti Zam'ah.\"  Aisyah berkata:  Sejak itu, baginda tidak pernah lagi melihat Saudah."
  },
  {
    "id": 6521,
    "hadith_number": 6521,
    "tajuk_hadith": "Larangan Mengaku Anak Orang Lain",
    "perawi_melayu": "Daripada Saad",
    "english_text": "I heard the Prophet (ﷺ) saying, \"Whoever claims to be the son of a person other than his father, and he \nknows that person is not his father, then Paradise will be forbidden for him.\" I mentioned that to Abu \nBakra, and he said, \"My ears heard that and my heart memorized it from Allah's Messenger (ﷺ).",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا خَالِدٌ ـ هُوَ ابْنُ عَبْدِ اللَّهِ ـ حَدَّثَنَا خَالِدٌ، عَنْ أَبِي عُثْمَانَ، عَنْ سَعْدٍ ـ رضى الله عنه ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنِ ادَّعَى إِلَى غَيْرِ أَبِيهِ، وَهْوَ يَعْلَمُ أَنَّهُ غَيْرُ أَبِيهِ، فَالْجَنَّةُ عَلَيْهِ حَرَامٌ ‏\"‏‏.‏   فَذَكَرْتُهُ لأَبِي بَكْرَةَ فَقَالَ وَأَنَا سَمِعَتْهُ أُذُنَاىَ، وَوَعَاهُ، قَلْبِي مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Aku mendengar Nabi SAW bersabda:  \"Barangsiapa yang mengaku anak kepada orang lain selain bapanya, sedangkan dia mengetahui bahawa orang itu bukanlah bapanya, maka syurga haram baginya.\" Aku menyebutkannya kepada Abu Bakrah, lalu dia berkata: \"Telingaku mendengarnya dan hatiku mengingatnya daripada Rasulullah SAW.\""
  },
  {
    "id": 6522,
    "hadith_number": 6522,
    "tajuk_hadith": "Larangan Menafikan Bapa",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \"Do not deny your fathers (i.e. claim to be the sons of persons other than your fathers), and whoever denies his father, is charged with disbelief.\"",
    "arabic_text": "حَدَّثَنَا أَصْبَغُ بْنُ الْفَرَجِ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنْ عِرَاكٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَرْغَبُوا عَنْ آبَائِكُمْ، فَمَنْ رَغِبَ عَنْ أَبِيهِ فَهُوَ كُفْرٌ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Janganlah kamu menafikan bapa kamu (iaitu mengaku anak kepada orang lain selain bapa kamu), dan sesiapa yang menafikan bapanya, maka dia telah melakukan kekufuran.\""
  },
  {
    "id": 6523,
    "hadith_number": 6523,
    "tajuk_hadith": "Hikmah Kisah Dua Wanita dan Anaknya",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، قَالَ حَدَّثَنَا أَبُو الزِّنَادِ، عَنْ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ كَانَتِ امْرَأَتَانِ مَعَهُمَا ابْنَاهُمَا، جَاءَ الذِّئْبُ فَذَهَبَ بِابْنِ إِحْدَاهُمَا فَقَالَتْ لِصَاحِبَتِهَا إِنَّمَا ذَهَبَ بِابْنِكِ‏.‏ وَقَالَتِ الأُخْرَى إِنَّمَا ذَهَبَ بِابْنِكِ‏.‏ فَتَحَاكَمَتَا إِلَى دَاوُدَ ـ عَلَيْهِ السَّلاَمُ ـ فَقَضَى بِهِ لِلْكُبْرَى، فَخَرَجَتَا عَلَى سُلَيْمَانَ بْنِ دَاوُدَ ـ عَلَيْهِمَا السَّلاَمُ ـ فَأَخْبَرَتَاهُ فَقَالَ ائْتُونِي بِالسِّكِّينِ أَشُقُّهُ بَيْنَهُمَا‏.‏ فَقَالَتِ الصُّغْرَى لاَ تَفْعَلْ يَرْحَمُكَ اللَّهُ‏.‏ هُوَ ابْنُهَا‏.‏ فَقَضَى بِهِ لِلصُّغْرَى ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ وَاللَّهِ إِنْ سَمِعْتُ بِالسِّكِّينِ قَطُّ إِلاَّ يَوْمَئِذٍ، وَمَا كُنَّا نَقُولُ إِلاَّ الْمُدْيَةَ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Dahulu ada dua orang perempuan, masing-masing mempunyai seorang anak lelaki. Seekor serigala datang lalu membawa lari anak salah seorang daripada mereka. Maka perempuan itu berkata kepada sahabatnya, ‘Serigala itu telah membawa lari anakmu.’  Perempuan yang lain pula berkata, ‘Tidak, serigala itu telah membawa lari anakmu.’  Kemudian kedua-dua mereka membawa perkara ini kepada Nabi Daud a.s., lalu Nabi Daud a.s. memutuskan bahawa anak itu diserahkan kepada perempuan yang lebih tua.  Kemudian mereka berdua pergi kepada Nabi Sulaiman a.s., anak Nabi Daud a.s., dan menceritakan perkara itu kepadanya.  Nabi Sulaiman a.s. berkata, ‘Bawalah kepadaku pisau, supaya aku membelah anak itu dua bahagian dan memberi separuh kepada setiap kamu.’  Maka perempuan yang lebih muda berkata, ‘Jangan tuan lakukan demikian, semoga Allah merahmati tuan! Dia adalah anaknya.’  Maka Nabi Sulaiman a.s. memutuskan bahawa anak itu diserahkan kepada perempuan yang lebih muda.\" Abu Hurairah berkata, Demi Allah! Aku tidak pernah mendengar perkataan ‘sakkin’ (pisau) melainkan pada hari itu, dan kami biasa menyebutnya ‘mudya’."
  },
  {
    "id": 6524,
    "hadith_number": 6524,
    "tajuk_hadith": "Kegembiraan Rasulullah SAW dan Persamaan Tapak Kaki Usama dan Bapanya",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "Allah's Messenger (ﷺ) once entered upon me in a very happy mood, with his features glittering with joy, and \nsaid, \"O `Aisha! won't you see that Mujazziz (a Qa'if) looked just now at Zaid bin Haritha and Usama \nbin Zaid and said, 'These feet (of Usama and his father) belong to each other.\" (See Hadith No. 755, \nVol. 4)",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ عَلَىَّ مَسْرُورًا تَبْرُقُ أَسَارِيرُ وَجْهِهِ فَقَالَ ‏\n\"‏ أَلَمْ تَرَىْ أَنَّ مُجَزِّزًا نَظَرَ آنِفًا إِلَى زَيْدِ بْنِ حَارِثَةَ وَأُسَامَةَ بْنِ زَيْدٍ، فَقَالَ إِنَّ هَذِهِ الأَقْدَامَ بَعْضُهَا مِنْ بَعْضٍ ‏\"‏‏.‏",
    "malay_translation": "Aisyah r.a. berkata bahawa Rasulullah SAW telah masuk menjengukku dalam keadaan gembira sekali, wajah baginda berseri-seri. Baginda bersabda: \"Wahai Aisyah, adakah engkau tidak nampak bahawa Mujazziz (seorang yang pandai melihat ciri-ciri keturunan) baru sahaja melihat Zaid bin Harithah dan Usamah bin Zaid, lalu berkata: \"Sesungguhnya tapak kaki ini sepadan antara satu sama lain.\" "
  },
  {
    "id": 6525,
    "hadith_number": 6525,
    "tajuk_hadith": "Kegembiraan Rasulullah SAW dan Kisah Mujazziz Al-Mudliji",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "Once Allah's Messenger (ﷺ) entered upon me and he was in a very happy mood and said, \"O `Aisha: Don't \nyou know that Mujazziz Al-Mudliji entered and saw Usama and Zaid with a velvet covering on them \nand their heads were covered while their feet were uncovered. He said, 'These feet belong to each \nother.'",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ وَهْوَ مَسْرُورٌ فَقَالَ ‏\n\"‏ يَا عَائِشَةُ أَلَمْ تَرَىْ أَنَّ مُجَزِّزًا الْمُدْلِجِيَّ دَخَلَ فَرَأَى أُسَامَةَ وَزَيْدًا وَعَلَيْهِمَا قَطِيفَةٌ، قَدْ غَطَّيَا رُءُوسَهُمَا وَبَدَتْ أَقْدَامُهُمَا، فَقَالَ إِنَّ هَذِهِ الأَقْدَامَ بَعْضُهَا مِنْ بَعْضٍ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW suatu hari telah masuk menjengukku dalam keadaan gembira, lalu baginda bersabda, \"Wahai Aisyah, tidakkah engkau lihat bahawa Mujazziz Al-Mudliji telah masuk dan melihat Usamah dan Zaid yang sedang berselimutkan kain baldu, kepala mereka tertutup tetapi kaki mereka terdedah. Lalu dia berkata, 'Kaki-kaki ini adalah sepasang.'\""
  }
]
