[
  {
    "id": 5464,
    "hadith_number": 5464,
    "tajuk_hadith": "Penawar untuk Setiap Penyakit",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \"There is no disease that Allah has created, except that He also has created its \ntreatment.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا عُمَرُ بْنُ سَعِيدِ بْنِ أَبِي حُسَيْنٍ، قَالَ حَدَّثَنِي عَطَاءُ بْنُ أَبِي رَبَاحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا أَنْزَلَ اللَّهُ دَاءً إِلاَّ أَنْزَلَ لَهُ شِفَاءً ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Allah SWT tidak menurunkan sebarang penyakit melainkan Dia juga telah menurunkan penawarnya.\""
  },
  {
    "id": 5465,
    "hadith_number": 5465,
    "tajuk_hadith": "Perkhidmatan Para Wanita Sahabat dalam Ekspedisi Perang",
    "perawi_melayu": "Riwayat Rubai binti Mu'adz bin Afran",
    "english_text": "We used to go for Military expeditions along with Allah's Messenger (ﷺ) and provide the people with water, \nserve them and bring the dead and the wounded back to Medina.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ خَالِدِ بْنِ ذَكْوَانَ، عَنْ رُبَيِّعَ بِنْتِ مُعَوِّذٍ ابْنِ عَفْرَاءَ، قَالَتْ كُنَّا نَغْزُو مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم نَسْقِي الْقَوْمَ، وَنَخْدُمُهُمْ، وَنَرُدُّ الْقَتْلَى وَالْجَرْحَى إِلَى الْمَدِينَةِ‏.‏",
    "malay_translation": "Kami pernah menyertai ekspedisi tentera bersama Rasulullah ﷺ.  Kami memberi air kepada orang ramai, melayan mereka, dan membawa pulang syuhada dan yang cedera ke Madinah."
  },
  {
    "id": 5466,
    "hadith_number": 5466,
    "tajuk_hadith": "Penawar Dalam Tiga Perkara",
    "perawi_melayu": "Riwayat Ibnu Abbas",
    "english_text": "(The Prophet (ﷺ) said), \"Healing is in three things: A gulp of honey, cupping, and branding with fire \n(cauterizing).\" But I forbid my followers to use (cauterization) branding with fire.",
    "arabic_text": "حَدَّثَنِي الْحُسَيْنُ، حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا مَرْوَانُ بْنُ شُجَاعٍ، حَدَّثَنَا سَالِمٌ الأَفْطَسُ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ ‏\n\"‏ الشِّفَاءُ فِي ثَلاَثَةٍ شَرْبَةِ عَسَلٍ، وَشَرْطَةِ مِحْجَمٍ، وَكَيَّةِ نَارٍ، وَأَنْهَى أُمَّتِي عَنِ الْكَىِّ ‏\"‏‏.‏ رَفَعَ الْحَدِيثَ وَرَوَاهُ الْقُمِّيُّ عَنْ لَيْثٍ عَنْ مُجَاهِدٍ عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي الْعَسَلِ وَالْحَجْمِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Al-Husain, telah menceritakan kepada kami Ahmad bin Mani', telah menceritakan kepada kami Marwan bin Syuja', telah menceritakan kepada kami Salim Al-Afthas, dari Said bin Jubair, dari Ibnu Abbas r.a., katanya: \"Penyembuhan terdapat dalam tiga perkara: Tegukan madu, bekam, dan kauterisasi dengan api.  Dan aku melarang umatku daripada kauterisasi.\"  Hadis ini diriwayatkan oleh Al-Qummi daripada Laits daripada Mujahid daripada Ibnu Abbas daripada Nabi SAW berkaitan madu dan bekam."
  },
  {
    "id": 5467,
    "hadith_number": 5467,
    "tajuk_hadith": "Penyembuhan dalam Tiga Perkara",
    "perawi_melayu": "Daripada Ibnu Abbas",
    "english_text": "The Prophet (ﷺ) said, \"Healing is in three things: cupping, a gulp of honey or cauterization, (branding with fire) but I forbid my followers to use cauterization (branding with fire).",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، أَخْبَرَنَا سُرَيْجُ بْنُ يُونُسَ أَبُو الْحَارِثِ، حَدَّثَنَا مَرْوَانُ بْنُ شُجَاعٍ، عَنْ سَالِمٍ الأَفْطَسِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الشِّفَاءُ فِي ثَلاَثَةٍ شَرْطَةِ مِحْجَمٍ، أَوْ شَرْبَةِ عَسَلٍ، أَوْ كَيَّةٍ بِنَارٍ، وَأَنْهَى أُمَّتِي عَنِ الْكَىِّ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Penyembuhan terdapat dalam tiga perkara: bekam, tegukan madu, atau kauter (dengan api).  Namun, aku melarang umatku daripada kauter (dengan api).\""
  },
  {
    "id": 5468,
    "hadith_number": 5468,
    "tajuk_hadith": "Rasulullah SAW menyukai makanan dan madu yang manis",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "The Prophet (ﷺ) used to like sweet edible things and honey.",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ أَخْبَرَنِي هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُعْجِبُهُ الْحَلْوَاءُ وَالْعَسَلُ‏.‏",
    "malay_translation": "Aisyah r.a. berkata: Nabi Muhammad SAW menyukai makanan yang manis dan madu."
  },
  {
    "id": 5469,
    "hadith_number": 5469,
    "tajuk_hadith": "Keberkesanan Bekam, Madu, dan Kauter",
    "perawi_melayu": "Daripada Jabir bin Abdullah:",
    "english_text": "I heard the Prophet (ﷺ) saying, \"If there is any healing in your medicines, then it is in cupping, a gulp of \nhoney or branding with fire (cauterization) that suits the ailment, but I don't like to be (cauterized) \nbranded with fire.\"",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْغَسِيلِ، عَنْ عَاصِمِ بْنِ عُمَرَ بْنِ قَتَادَةَ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنْ كَانَ فِي شَىْءٍ مِنْ أَدْوِيَتِكُمْ ـ أَوْ يَكُونُ فِي شَىْءٍ مِنْ أَدْوِيَتِكُمْ ـ خَيْرٌ فَفِي شَرْطَةِ مِحْجَمٍ، أَوْ شَرْبَةِ عَسَلٍ، أَوْ لَذْعَةٍ بِنَارٍ تُوَافِقُ الدَّاءَ، وَمَا أُحِبُّ أَنْ أَكْتَوِيَ ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda:  \"Sekiranya terdapat kebaikan dalam ubat-ubatan kamu, maka ia adalah dalam bekam, tegukan madu, atau kauter dengan api yang sesuai dengan penyakit.  Namun, aku tidak suka dikauter dengan api.\""
  },
  {
    "id": 5470,
    "hadith_number": 5470,
    "tajuk_hadith": "Penggunaan Madu untuk Masalah Perut",
    "perawi_melayu": "Riwayat Abu Sa`id Al-Khudri:",
    "english_text": "A man came to the Prophet (ﷺ) and said, \"My brother has some Abdominal trouble.\" The Prophet (ﷺ) said to \nhim \"Let him drink honey.\" The man came for the second time and the Prophet (ﷺ) said to him, 'Let him \ndrink honey.\" He came for the third time and the Prophet (ﷺ) said, \"Let him drink honey.\" He returned \nagain and said, \"I have done that ' The Prophet (ﷺ) then said, \"Allah has said the truth, but your brother's \n`Abdomen has told a lie. Let him drink honey.\" So he made him drink honey and he was cured.",
    "arabic_text": "حَدَّثَنَا عَيَّاشُ بْنُ الْوَلِيدِ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَبِي الْمُتَوَكِّلِ، عَنْ أَبِي سَعِيدٍ، أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ أَخِي يَشْتَكِي بَطْنَهُ‏.‏ فَقَالَ ‏\"‏ اسْقِهِ عَسَلاً ‏\"‏‏.‏ ثُمَّ أَتَى الثَّانِيَةَ فَقَالَ ‏\"‏ اسْقِهِ عَسَلاً ‏\"‏‏.‏ ثُمَّ أَتَاهُ فَقَالَ فَعَلْتُ‏.‏ فَقَالَ ‏\"‏ صَدَقَ اللَّهُ، وَكَذَبَ بَطْنُ أَخِيكَ، اسْقِهِ عَسَلاً ‏\"‏‏.‏ فَسَقَاهُ فَبَرَأَ‏.‏",
    "malay_translation": "Seorang lelaki datang kepada Nabi SAW dan berkata, \"Adik saya mengalami masalah perut.\" Nabi SAW bersabda kepadanya, \"Berikan dia madu untuk diminum.\" Lelaki itu datang untuk kali kedua dan Nabi SAW bersabda kepadanya, \"Berikan dia madu untuk diminum.\"  Dia datang untuk kali ketiga dan Nabi SAW bersabda, \"Berikan dia madu untuk diminum.\" Dia kembali lagi dan berkata, \"Saya telah melakukannya.\" Nabi SAW kemudian bersabda, \"Allah Maha Benar, tetapi perut adik kamu telah berdusta. Berikan dia madu untuk diminum.\" Maka dia memberikan madu kepadanya dan dia sembuh."
  },
  {
    "id": 5471,
    "hadith_number": 5471,
    "tajuk_hadith": "Orang Sakit, Pengkhianatan, dan Hukuman",
    "perawi_melayu": "Riwayat Anas:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا سَلاَّمُ بْنُ مِسْكِينٍ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، أَنَّ نَاسًا، كَانَ بِهِمْ سَقَمٌ قَالُوا يَا رَسُولَ اللَّهِ آوِنَا وَأَطْعِمْنَا فَلَمَّا صَحُّوا قَالُوا إِنَّ الْمَدِينَةَ وَخِمَةٌ‏.‏ فَأَنْزَلَهُمُ الْحَرَّةَ فِي ذَوْدٍ لَهُ فَقَالَ ‏\n\"‏ اشْرَبُوا أَلْبَانَهَا ‏\"‏‏.‏ فَلَمَّا صَحُّوا قَتَلُوا رَاعِيَ النَّبِيِّ صلى الله عليه وسلم وَاسْتَاقُوا ذَوْدَهُ، فَبَعَثَ فِي آثَارِهِمْ، فَقَطَعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ، وَسَمَرَ أَعْيُنَهُمْ، فَرَأَيْتُ الرَّجُلَ مِنْهُمْ يَكْدُمُ الأَرْضَ بِلِسَانِهِ حَتَّى يَمُوتَ‏.‏ قَالَ سَلاَّمٌ فَبَلَغَنِي أَنَّ الْحَجَّاجَ قَالَ لأَنَسٍ حَدِّثْنِي بِأَشَدِّ عُقُوبَةٍ عَاقَبَهُ النَّبِيُّ صلى الله عليه وسلم فَحَدَّثَهُ بِهَذَا‏.‏ فَبَلَغَ الْحَسَنَ فَقَالَ وَدِدْتُ أَنَّهُ لَمْ يُحَدِّثْهُ‏ بِهَذَا",
    "malay_translation": "Telah menceritakan kepada kami Muslim bin Ibrahim, telah menceritakan kepada kami Sallam bin Miskin, telah menceritakan kepada kami Tsabit, dari Anas, bahawa ada segolongan orang yang sakit, lalu mereka berkata, \"Wahai Rasulullah, tempatkanlah kami dan beri kami makan.\"  Setelah mereka sembuh, mereka berkata, \"Sesungguhnya cuaca Madinah tidak sesuai untuk kami.\" Maka Rasulullah menurunkan mereka ke Al-Harrah dengan beberapa ekor unta betina milik baginda, lalu baginda bersabda, \"Minumlah susu mereka.\"  Setelah mereka sembuh, mereka membunuh gembala Nabi ﷺ dan mencuri unta-unta baginda. Maka baginda menghantar orang untuk mengejar mereka, lalu baginda memerintahkan supaya tangan dan kaki mereka dipotong, dan mata mereka dipanaskan dengan besi yang dipanaskan.  Aku melihat seorang daripada mereka menjilat bumi dengan lidahnya sehingga dia mati. Sallam berkata, “Sampai kepadaku bahawa Al-Hajjaj berkata kepada Anas, “Ceritakan kepadaku tentang hukuman yang paling berat yang dikenakan oleh Nabi ﷺ.” Lalu Anas menceritakan kepadanya kisah ini.  Perkara ini sampai kepada Al-Hasan, lalu dia berkata, “Aku berharap dia tidak menceritakannya kepadanya.”"
  },
  {
    "id": 5472,
    "hadith_number": 5472,
    "tajuk_hadith": "Rawatan dan Hukuman di Madinah",
    "perawi_melayu": "Anas r.a.",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ نَاسًا، اجْتَوَوْا فِي الْمَدِينَةِ فَأَمَرَهُمُ النَّبِيُّ صلى الله عليه وسلم أَنْ يَلْحَقُوا بِرَاعِيهِ ـ يَعْنِي الإِبِلَ ـ فَيَشْرَبُوا مِنْ أَلْبَانِهَا وَأَبْوَالِهَا، فَلَحِقُوا بِرَاعِيهِ فَشَرِبُوا مِنْ أَلْبَانِهَا وَأَبْوَالِهَا، حَتَّى صَلَحَتْ أَبْدَانُهُمْ فَقَتَلُوا الرَّاعِيَ وَسَاقُوا الإِبِلَ، فَبَلَغَ النَّبِيَّ صلى الله عليه وسلم فَبَعَثَ فِي طَلَبِهِمْ، فَجِيءَ بِهِمْ فَقَطَعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ، وَسَمَرَ أَعْيُنَهُمْ‏.‏ قَالَ قَتَادَةُ فَحَدَّثَنِي مُحَمَّدُ بْنُ سِيرِينَ أَنَّ ذَلِكَ كَانَ قَبْلَ أَنْ تَنْزِلَ الْحُدُودُ‏.‏",
    "malay_translation": "Kami diberitakan oleh Musa bin Isma'il, yang mana kami diberitakan oleh Hammam, daripada Qatadah, daripada Anas r.a., bahawa ada segolongan manusia yang menghidap penyakit di Madinah. Maka Nabi SAW menyuruh mereka supaya mengikut gembala baginda – iaitu unta – dan minum susu dan air kencingnya (sebagai ubat). Maka mereka pun mengikut gembala itu, iaitu unta-unta tersebut, dan minum susu dan air kencingnya sehingga badan mereka sembuh. Kemudian mereka membunuh gembala itu dan membawa lari unta-unta tersebut.  Berita itu sampai kepada Nabi SAW, lalu baginda menghantar orang untuk menjejaki mereka. Apabila mereka ditangkap, baginda memotong tangan dan kaki mereka, dan membakar mata mereka dengan besi yang dipanaskan. Qatadah berkata: Muhammad bin Sirin telah menceritakan kepadaku bahawa perkara itu berlaku sebelum hukum-hukum (syarak) diturunkan."
  },
  {
    "id": 5473,
    "hadith_number": 5473,
    "tajuk_hadith": "Kegunaan Habbatussauda (Jintan Hitam)",
    "perawi_melayu": "Riwayat Khalid bin Sa'd:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ مَنْصُورٍ، عَنْ خَالِدِ بْنِ سَعْدٍ، قَالَ خَرَجْنَا وَمَعَنَا غَالِبُ بْنُ أَبْجَرَ فَمَرِضَ فِي الطَّرِيقِ، فَقَدِمْنَا الْمَدِينَةَ وَهْوَ مَرِيضٌ، فَعَادَهُ ابْنُ أَبِي عَتِيقٍ فَقَالَ لَنَا عَلَيْكُمْ بِهَذِهِ الْحُبَيْبَةِ السَّوْدَاءِ، فَخُذُوا مِنْهَا خَمْسًا أَوْ سَبْعًا فَاسْحَقُوهَا، ثُمَّ اقْطُرُوهَا فِي أَنْفِهِ بِقَطَرَاتِ زَيْتٍ فِي هَذَا الْجَانِبِ وَفِي هَذَا الْجَانِبِ، فَإِنَّ عَائِشَةَ حَدَّثَتْنِي أَنَّهَا سَمِعَتِ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ هَذِهِ الْحَبَّةَ السَّوْدَاءَ شِفَاءٌ مِنْ كُلِّ دَاءٍ إِلاَّ مِنَ السَّامِ ‏\"‏‏.‏ قُلْتُ وَمَا السَّامُ قَالَ الْمَوْتُ‏.‏",
    "malay_translation": "Kami telah bertolak dan bersama kami ialah Ghalib bin Abjar. Dia jatuh sakit di perjalanan, dan apabila kami sampai di Madinah, dia masih sakit.  Ibn Abi ‘Atiq datang melawatnya dan berkata kepada kami, “Gunakanlah habatussauda ini. Ambillah lima atau tujuh biji, tumbuklah ia, kemudian titikkan ke dalam hidungnya dengan sedikit minyak, di sebelah sini dan di sebelah sini. Sesungguhnya Aisyah telah bercerita kepadaku bahawa dia telah mendengar Rasulullah SAW bersabda:  “Sesungguhnya habatussauda ini adalah penawar bagi segala penyakit kecuali kematian.” Aku bertanya, “Apakah kematian itu?”  Baginda menjawab, “Kematian.”"
  },
  {
    "id": 5474,
    "hadith_number": 5474,
    "tajuk_hadith": "Kegunaan Habbatussauda'",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "I heard Allah's Messenger (ﷺ) saying, \"There is healing in black cumin for all diseases except death.\"",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، وَسَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، أَخْبَرَهُمَا أَنَّهُ، سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ فِي الْحَبَّةِ السَّوْدَاءِ شِفَاءٌ مِنْ كُلِّ دَاءٍ إِلاَّ السَّامَ ‏\"‏‏.‏ قَالَ ابْنُ شِهَابٍ وَالسَّامُ الْمَوْتُ، وَالْحَبَّةُ السَّوْدَاءُ الشُّونِيزُ‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda: \"Dalam Habbatussauda' terdapat penyembuhan bagi semua penyakit kecuali kematian.\""
  },
  {
    "id": 5475,
    "hadith_number": 5475,
    "tajuk_hadith": "Keberkesanan Talbina untuk Pesakit dan Mereka yang Berduka",
    "perawi_melayu": "Riwayat Urwa",
    "english_text": "Aisha used to recommend at-Talbina for the sick and for such a person as grieved over a dead person. \nShe used to say, \"I heard Allah's Messenger (ﷺ) saying, 'at-Talbina gives rest to the heart of the patient and \nmakes it active and relieves some of his sorrow and grief.'\"",
    "arabic_text": "حَدَّثَنَا حِبَّانُ بْنُ مُوسَى، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ بْنُ يَزِيدَ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا كَانَتْ تَأْمُرُ بِالتَّلْبِينِ لِلْمَرِيضِ وَلِلْمَحْزُونِ عَلَى الْهَالِكِ، وَكَانَتْ تَقُولُ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ التَّلْبِينَةَ تُجِمُّ فُؤَادَ الْمَرِيضِ، وَتَذْهَبُ بِبَعْضِ الْحُزْنِ ‏\"‏‏.‏",
    "malay_translation": "Aisyah radhiallahuanha selalu mengesyorkan talbina untuk pesakit dan mereka yang berduka cita atas kematian seseorang.  Beliau berkata, \"Saya mendengar Rasulullah SAW bersabda, 'Sesungguhnya talbina menenangkan hati orang sakit, dan menghilangkan sebahagian daripada kesedihannya.'\""
  },
  {
    "id": 5476,
    "hadith_number": 5476,
    "tajuk_hadith": "Aisyah dan Cadangan Talbinah",
    "perawi_melayu": "Daripada bapa Hisyam",
    "english_text": "`Aisha used to recommend at-Talbina and used to say, \"It is disliked (by the patient) although it is beneficial.''",
    "arabic_text": "حَدَّثَنَا فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا كَانَتْ تَأْمُرُ بِالتَّلْبِينَةِ وَتَقُولُ هُوَ الْبَغِيضُ النَّافِعُ‏.‏",
    "malay_translation": "Aisyah pernah mengesyorkan talbinah dan berkata, \"Ia adalah minuman yang tidak digemari (oleh orang sakit) walaupun ia bermanfaat.\""
  },
  {
    "id": 5477,
    "hadith_number": 5477,
    "tajuk_hadith": "Rasulullah ﷺ Berurut dan Memberi Upah",
    "perawi_melayu": "Riwayat Ibnu Abbas:",
    "english_text": "The Prophet (ﷺ) was cupped and he paid the wages to the one who had cupped him and then took Su'ut \n(Medicine sniffed by nose).",
    "arabic_text": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا وُهَيْبٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم احْتَجَمَ وَأَعْطَى الْحَجَّامَ أَجْرَهُ وَاسْتَعَطَ‏.‏",
    "malay_translation": "Rasulullah ﷺ menjalani rawatan bekam dan baginda telah membayar upah kepada tukang bekam tersebut, kemudian baginda mengambil Su'ut (ubat yang disedut melalui hidung)."
  },
  {
    "id": 5478,
    "hadith_number": 5478,
    "tajuk_hadith": "Kegunaan Ubat Herba India dan Rawatan Nabi SAW",
    "perawi_melayu": "Riwayat Um Qais binti Mihsan:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ، أَخْبَرَنَا ابْنُ عُيَيْنَةَ، قَالَ سَمِعْتُ الزُّهْرِيَّ، عَنْ عُبَيْدِ اللَّهِ، عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ، قَالَتْ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ عَلَيْكُمْ بِهَذَا الْعُودِ الْهِنْدِيِّ، فَإِنَّ فِيهِ سَبْعَةَ أَشْفِيَةٍ‏.‏ يُسْتَعَطُ بِهِ مِنَ الْعُذْرَةِ، وَيُلَدُّ بِهِ مِنْ ذَاتِ الْجَنْبِ ‏\"‏‏.‏   وَدَخَلْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم بِابْنٍ لِي لَمْ يَأْكُلِ الطَّعَامَ فَبَالَ عَلَيْهِ، فَدَعَا بِمَاءٍ فَرَشَّ عَلَيْهِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Sadakah bin al-Fadl, telah memberitakan kepada kami Ibnu Uyainah, katanya: Aku mendengar az-Zuhiri, daripada Ubaidillah, daripada Ummi Qais binti Mihsan, katanya: Aku mendengar Nabi SAW bersabda:  \"Hendaklah kamu menggunakan kayu gaharu India ini, kerana ia mengandungi tujuh jenis penyembuhan. Ia dihidu bagi merawat sakit tekak dan diletakkan pada bahagian mulut bagi merawat penyakit radang selaput dada.\"  Aku pernah datang kepada Nabi SAW dengan anakku yang tidak mahu makan dan anakku itu membuang air kecil ke atasnya, lalu Baginda meminta air dan menyiramkannya ke tempat air kencing itu."
  },
  {
    "id": 5479,
    "hadith_number": 5479,
    "tajuk_hadith": "Nabi SAW Berbekam Ketika Berpuasa",
    "perawi_melayu": "Daripada Ibnu Abbas:",
    "english_text": "The Prophet (ﷺ) was cupped while he was fasting.",
    "arabic_text": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ احْتَجَمَ النَّبِيُّ صلى الله عليه وسلم وَهْوَ صَائِمٌ‏.‏",
    "malay_translation": "Daripada Ibnu Abbas, beliau berkata: Nabi SAW berbekam ketika berpuasa."
  },
  {
    "id": 5480,
    "hadith_number": 5480,
    "tajuk_hadith": "Rasulullah ﷺ Berbekam dalam Keadaan Ihram",
    "perawi_melayu": "Daripada Ibnu Abbas:",
    "english_text": "The Prophet (ﷺ) was cupped while he was in a state of Ihram.",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ طَاوُسٍ، وَعَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ احْتَجَمَ النَّبِيُّ صلى الله عليه وسلم وَهْوَ مُحْرِمٌ‏.‏",
    "malay_translation": "Daripada Ibnu Abbas, beliau berkata: Nabi Muhammad ﷺ telah berbekam ketika dalam keadaan ihram."
  },
  {
    "id": 5481,
    "hadith_number": 5481,
    "tajuk_hadith": "Upah Tukang Berbekam dan Rawatan Terbaik",
    "perawi_melayu": "Riwayat Anas:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا حُمَيْدٌ الطَّوِيلُ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّهُ سُئِلَ عَنْ أَجْرِ الْحَجَّامِ، فَقَالَ احْتَجَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَجَمَهُ أَبُو طَيْبَةَ، وَأَعْطَاهُ صَاعَيْنِ مِنْ طَعَامٍ، وَكَلَّمَ مَوَالِيَهُ فَخَفَّفُوا عَنْهُ، وَقَالَ ‏\"‏ إِنَّ أَمْثَلَ مَا تَدَاوَيْتُمْ بِهِ الْحِجَامَةُ وَالْقُسْطُ الْبَحْرِيُّ ‏\"‏‏.‏ وَقَالَ ‏\"‏ لاَ تُعَذِّبُوا صِبْيَانَكُمْ بِالْغَمْزِ مِنَ الْعُذْرَةِ، وَعَلَيْكُمْ بِالْقُسْطِ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Muqatil, telah memberitakan kepada kami Abdullah, telah memberitakan kepada kami Humaid ath-Thawail, dari Anas - semoga Allah meridhainya - bahawa baginda ditanya tentang upah tukang berbekam, lalu baginda berkata: Rasulullah SAW telah berbekam, dibekam oleh Abu Thaibah, dan baginda memberi kepadanya dua sha makanan, dan baginda bercakap dengan tuan-tuannya lalu mereka meringankan bebannya, dan baginda bersabda:  \"Sesungguhnya sebaik-baik rawatan yang kamu gunakan ialah berbekam dan kasturi laut.\" Dan baginda bersabda: \"Janganlah kamu menyeksa anak-anak kamu dengan menekan (mengait) tonsil, dan hendaklah kamu menggunakan kasturi.\" "
  },
  {
    "id": 5482,
    "hadith_number": 5482,
    "tajuk_hadith": "Keberkatan Bekam",
    "perawi_melayu": "Jabir bin Abdullah",
    "english_text": "that he paid Al-Muqanna a visit during his illness and said, \"I will not leave till he gets cupped, for I \nheard Allah's Messenger (ﷺ) saying, \"There is healing in cupping.\"",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ تَلِيدٍ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرٌو، وَغَيْرُهُ، أَنَّ بُكَيْرًا، حَدَّثَهُ أَنَّ عَاصِمَ بْنَ عُمَرَ بْنِ قَتَادَةَ حَدَّثَهُ أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ عَادَ الْمُقَنَّعَ ثُمَّ قَالَ لاَ أَبْرَحُ حَتَّى تَحْتَجِمَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ فِيهِ شِفَاءً ‏\"‏‏.‏",
    "malay_translation": "Jabir bin Abdullah telah melawat Al-Muqanna ketika sakit dan berkata, \"Aku tidak akan pergi sehingga dia dibekam, kerana aku mendengar Rasulullah SAW bersabda, \"Sesungguhnya di dalamnya terdapat kesembuhan.\""
  },
  {
    "id": 5483,
    "hadith_number": 5483,
    "tajuk_hadith": "Rasulullah ﷺ Berbekam di Kepala",
    "perawi_melayu": "Riwayat Abdullah bin Buhaina",
    "english_text": "Allah's Messenger (ﷺ) was cupped on the middle of his head at Lahl Jamal on his way to Mecca while he \nwas in a state of Ihram. Narrated Ibn `Abbas: Allah's Messenger (ﷺ) was cupped on his head.",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي سُلَيْمَانُ، عَنْ عَلْقَمَةَ، أَنَّهُ سَمِعَ عَبْدَ الرَّحْمَنِ الأَعْرَجَ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ ابْنَ بُحَيْنَةَ، يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم احْتَجَمَ بِلَحْىِ جَمَلٍ مِنْ طَرِيقِ مَكَّةَ، وَهْوَ مُحْرِمٌ، فِي وَسَطِ رَأْسِهِ‏.‏   وَقَالَ الأَنْصَارِيُّ أَخْبَرَنَا هِشَامُ بْنُ حَسَّانَ، حَدَّثَنَا عِكْرِمَةُ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم احْتَجَمَ فِي رَأْسِهِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ismail, katanya; telah menceritakan kepadaku Sulaiman, dari Alqamah, bahawa dia mendengar Abdur Rahman Al-A'raj, bahawa dia mendengar Abdullah bin Buhaina, bercerita bahawa Rasulullah ﷺ telah berbekam di Lahl Jamal dalam perjalanan ke Mekah ketika dalam keadaan ihram, di bahagian tengah kepalanya.  Dan telah menceritakan kepada kami Al-Ansari, telah menceritakan kepada kami Hisyam bin Hassan, telah menceritakan kepada kami Ikrimah, dari Ibnu Abbas r.a. bahawa Rasulullah ﷺ telah berbekam di kepalanya."
  },
  {
    "id": 5484,
    "hadith_number": 5484,
    "tajuk_hadith": "Rasulullah ﷺ Berbekam Ketika Ihram",
    "perawi_melayu": "Riwayat Ibnu Abbas:",
    "english_text": "The Prophet (ﷺ) was cupped on his head for an ailment he was suffering from while he was in a state of \nIhram. at a water place called Lahl Jamal. Ibn `Abbas further said: Allah s Apostle was cupped on his \nhead for unilateral headache while he was in a state of Ihram .",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ هِشَامٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، احْتَجَمَ النَّبِيُّ صلى الله عليه وسلم فِي رَأْسِهِ وَهْوَ مُحْرِمٌ مِنْ وَجَعٍ كَانَ بِهِ بِمَاءٍ يُقَالُ لَهُ لَحْىُ جَمَلٍ‏.‏   وَقَالَ مُحَمَّدُ بْنُ سَوَاءٍ أَخْبَرَنَا هِشَامٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم احْتَجَمَ وَهْوَ مُحْرِمٌ فِي رَأْسِهِ مِنْ شَقِيقَةٍ كَانَتْ بِهِ‏.‏",
    "malay_translation": "Daripada Muhammad bin Bashar, telah menceritakan kepada kami Ibnu Abi Udy, daripada Hisyam, daripada Ikrimah, daripada Ibnu Abbas, bahawa Nabi ﷺ telah berbekam di kepalanya ketika dalam keadaan ihram kerana sakit yang dideritainya di tempat air yang dinamakan Lahl Jamal. Dan Muhammad bin Suwa berkata: telah menceritakan kepada kami Hisyam, daripada Ikrimah, daripada Ibnu Abbas, bahawa Rasulullah ﷺ telah berbekam di kepalanya ketika dalam keadaan ihram kerana sakit kepala sebelah."
  },
  {
    "id": 5485,
    "hadith_number": 5485,
    "tajuk_hadith": "Kebaikan dalam Perubatan: Madu, Bekam, dan Kayau",
    "perawi_melayu": "Jabir bin Abdullah",
    "english_text": "I heard the Prophet (ﷺ) saying, \"If there is any good in your medicines, then it is in a gulp of honey, a \ncupping operation, or branding (cauterization), but I do not like to be (cauterized) branded.",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبَانَ، حَدَّثَنَا ابْنُ الْغَسِيلِ، قَالَ حَدَّثَنِي عَاصِمُ بْنُ عُمَرَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنْ كَانَ فِي شَىْءٍ مِنْ أَدْوِيَتِكُمْ خَيْرٌ فَفِي شَرْبَةِ عَسَلٍ أَوْ شَرْطَةِ مِحْجَمٍ أَوْ لَذْعَةٍ مِنْ نَارٍ، وَمَا أُحِبُّ أَنْ أَكْتَوِيَ ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Nabi ﷺ bersabda, \"Sekiranya terdapat kebaikan dalam ubat-ubatan kamu, maka ia terdapat dalam tegukan madu, atau bekam, atau kauter, tetapi aku tidak suka dikauter.\""
  },
  {
    "id": 5486,
    "hadith_number": 5486,
    "tajuk_hadith": "Kaedah Penebusan Hukuman Atas Ketidakselesaan Akibat Kutu",
    "perawi_melayu": "Riwayat Ka'b bin Ujrah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، قَالَ سَمِعْتُ مُجَاهِدًا، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ كَعْبٍ، هُوَ ابْنُ عُجْرَةَ قَالَ أَتَى عَلَىَّ النَّبِيُّ صلى الله عليه وسلم زَمَنَ الْحُدَيْبِيَةِ، وَأَنَا أُوقِدُ تَحْتَ بُرْمَةٍ، وَالْقَمْلُ يَتَنَاثَرُ عَنْ رَأْسِي فَقَالَ ‏\"‏ أَيُؤْذِيكَ هَوَامُّكَ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ فَاحْلِقْ وَصُمْ ثَلاَثَةَ أَيَّامٍ، أَوْ أَطْعِمْ سِتَّةً، أَوِ انْسُكْ نَسِيكَةً ‏\"‏‏.‏ قَالَ أَيُّوبُ لاَ أَدْرِي بِأَيَّتِهِنَّ بَدَأَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Musaddad, telah menceritakan kepada kami Hammad, dari Ayub, dia berkata; aku mendengar Mujahid, dari Ibnu Abi Laila, dari Ka'b, iaitu Ibnu Ujrah, dia berkata; Nabi SAW telah datang kepadaku pada zaman Hudaybiyyah, ketika aku sedang menyalakan api di bawah periuk, dan kutu-kutu bertebaran dari kepalaku. Maka Baginda bertanya, \"Adakah kutu-kutu itu mengganggu kamu?\" Aku menjawab, \"Ya.\" Baginda bersabda, \"Maka bercukurlah dan berpuasalah selama tiga hari, atau beri makan kepada enam orang miskin, atau sembelih seekor haiwan sebagai korban.\" Ayub berkata; aku tidak tahu dengan mana satu daripada amalan tersebut Baginda mulakan."
  },
  {
    "id": 5487,
    "hadith_number": 5487,
    "tajuk_hadith": "Keberkesanan Bekam dan Kauterisasi",
    "perawi_melayu": "Dari Jabir:",
    "english_text": "The Prophet (ﷺ) said, \"If there is any healing in your medicines then it is a cupping operation, or branding \n(cauterization), but I do not like to be (cauterized) branded.\"",
    "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، هِشَامُ بْنُ عَبْدِ الْمَلِكِ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سُلَيْمَانَ بْنِ الْغَسِيلِ، حَدَّثَنَا عَاصِمُ بْنُ عُمَرَ بْنِ قَتَادَةَ، قَالَ سَمِعْتُ جَابِرًا، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنْ كَانَ فِي شَىْءٍ مِنْ أَدْوِيَتِكُمْ شِفَاءٌ فَفِي شَرْطَةِ مِحْجَمٍ أَوْ لَذْعَةٍ بِنَارٍ، وَمَا أُحِبُّ أَنْ أَكْتَوِيَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Sekiranya terdapat sebarang penyembuhan dalam ubat-ubatan kamu, maka ia adalah dalam bekam atau kauterisasi dengan api.  Namun, aku tidak suka untuk dikauterisasi.\""
  },
  {
    "id": 5488,
    "hadith_number": 5488,
    "tajuk_hadith": "Tujuh Puluh Ribu Umat Tanpa Hisab",
    "perawi_melayu": "Riwayat Ibnu Abbas:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ، حَدَّثَنَا ابْنُ فُضَيْلٍ، حَدَّثَنَا حُصَيْنٌ، عَنْ عَامِرٍ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ ـ رضى الله عنهما ـ قَالَ لاَ رُقْيَةَ إِلاَّ مِنْ عَيْنٍ أَوْ حُمَةٍ‏.‏ فَذَكَرْتُهُ لِسَعِيدِ بْنِ جُبَيْرٍ فَقَالَ حَدَّثَنَا ابْنُ عَبَّاسٍ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ عُرِضَتْ عَلَىَّ الأُمَمُ، فَجَعَلَ النَّبِيُّ وَالنَّبِيَّانِ يَمُرُّونَ مَعَهُمُ الرَّهْطُ، وَالنَّبِيُّ لَيْسَ مَعَهُ أَحَدٌ، حَتَّى رُفِعَ لِي سَوَادٌ عَظِيمٌ، قُلْتُ مَا هَذَا أُمَّتِي هَذِهِ قِيلَ هَذَا مُوسَى وَقَوْمُهُ‏.‏ قِيلَ انْظُرْ إِلَى الأُفُقِ‏.‏ فَإِذَا سَوَادٌ يَمْلأُ الأُفُقَ، ثُمَّ قِيلَ لِي انْظُرْ هَا هُنَا وَهَا هُنَا فِي آفَاقِ السَّمَاءِ فَإِذَا سَوَادٌ قَدْ مَلأَ الأُفُقَ قِيلَ هَذِهِ أُمَّتُكَ وَيَدْخُلُ الْجَنَّةَ مِنْ هَؤُلاَءِ سَبْعُونَ أَلْفًا بِغَيْرِ حِسَابٍ، ثُمَّ دَخَلَ وَلَمْ يُبَيِّنْ لَهُمْ فَأَفَاضَ الْقَوْمُ وَقَالُوا نَحْنُ الَّذِينَ آمَنَّا بِاللَّهِ، وَاتَّبَعْنَا رَسُولَهُ، فَنَحْنُ هُمْ أَوْ أَوْلاَدُنَا الَّذِينَ وُلِدُوا فِي الإِسْلاَمِ فَإِنَّا وُلِدْنَا فِي الْجَاهِلِيَّةِ‏.‏ فَبَلَغَ النَّبِيَّ صلى الله عليه وسلم فَخَرَجَ فَقَالَ هُمُ الَّذِينَ لاَ يَسْتَرْقُونَ، وَلاَ يَتَطَيَّرُونَ، وَلاَ يَكْتَوُونَ وَعَلَى رَبِّهِمْ يَتَوَكَّلُونَ ‏\"‏‏.‏ فَقَالَ عُكَّاشَةُ بْنُ مِحْصَنٍ أَمِنْهُمْ أَنَا يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ فَقَامَ آخَرُ فَقَالَ أَمِنْهُمْ أَنَا قَالَ ‏\"‏ سَبَقَكَ عُكَّاشَةُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, “Kumpulan umat telah ditunjukkan kepadaku. Ada nabi dan dua orang nabi yang datang dengan pengikut mereka yang sedikit, dan ada juga nabi yang datang tanpa seorang pun bersamanya.  Kemudian aku melihat satu kumpulan yang sangat ramai, lalu aku bertanya, “Siapakah mereka? Adakah mereka umatku?” Dijawab, “Tidak, itu ialah Musa dan kaumnya.” Kemudian aku disuruh melihat ke ufuk. Maka aku melihat kumpulan manusia yang memenuhi ufuk. Kemudian aku disuruh melihat ke sana dan ke sini di seluruh langit.  Maka aku melihat kumpulan manusia yang memenuhi ufuk.  Kemudian aku diberitahu, “Inilah umatmu, dan daripada mereka akan masuk syurga tujuh puluh ribu orang tanpa hisab.”  Kemudian baginda masuk ke rumahnya tanpa menjelaskan kepada mereka siapakah mereka (70,000 orang itu).  Maka orang ramai mula berbincang dan berkata, “Kami adalah mereka yang beriman kepada Allah dan mengikuti Rasul-Nya.  Jadi, mereka itu adalah kami atau anak-anak kami yang dilahirkan dalam Islam, kerana kami dilahirkan pada zaman Jahiliyyah.”  Apabila hal ini sampai kepada Rasulullah SAW, baginda keluar dan bersabda, “Mereka itu ialah orang-orang yang tidak berurut, tidak mempercayai ramalan buruk atau baik (daripada burung dll), tidak melakukan kauter, dan mereka bertawakal kepada Tuhan mereka.” Kemudian Ukkasyah bin Mihshan berkata, “Adakah aku termasuk dalam kalangan mereka, wahai Rasulullah SAW?” Baginda menjawab, “Ya.” Kemudian seorang lagi bangun dan berkata, “Adakah aku termasuk dalam kalangan mereka?” Baginda menjawab, “Ukkasyah telah mendahului kamu.”"
  },
  {
    "id": 5489,
    "hadith_number": 5489,
    "tajuk_hadith": "Iddah Wanita Setelah Kehilangan Suami",
    "perawi_melayu": "Riwayat Ummu Salamah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، قَالَ حَدَّثَنِي حُمَيْدُ بْنُ نَافِعٍ، عَنْ زَيْنَبَ، عَنْ أُمِّ سَلَمَةَ ـ رضى الله عنها ـ أَنَّ امْرَأَةً تُوُفِّيَ زَوْجُهَا فَاشْتَكَتْ عَيْنَهَا، فَذَكَرُوهَا لِلنَّبِيِّ صلى الله عليه وسلم وَذَكَرُوا لَهُ الْكُحْلَ، وَأَنَّهُ يُخَافُ عَلَى عَيْنِهَا، فَقَالَ ‏\n\"‏ لَقَدْ كَانَتْ إِحْدَاكُنَّ تَمْكُثُ فِي بَيْتِهَا فِي شَرِّ أَحْلاَسِهَا ـ أَوْ فِي أَحْلاَسِهَا فِي شَرِّ بَيْتِهَا ـ فَإِذَا مَرَّ كَلْبٌ رَمَتْ بَعْرَةً، فَلاَ، أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Musaddad, telah menceritakan kepada kami Yahya, dari Syu’bah, dia berkata; telah menceritakan kepadaku Humaid bin Nafi’, dari Zainab, dari Ummu Salamah r.a., bahawa seorang wanita telah meninggal dunia suaminya, lalu matanya sakit. Maka mereka menceritakan hal itu kepada Nabi SAW dan menyebut tentang penggunaan kohl, kerana dikhuatiri akan membahayakan matanya. Maka baginda bersabda: \"Dahulu, salah seorang daripada kamu akan tinggal di rumahnya dalam keadaan yang paling buruk – atau dalam keadaan yang paling buruk di rumahnya – maka jika ada anjing lalu, dia akan membaling najis. Tidak (begitu), empat bulan sepuluh hari.\" "
  },
  {
    "id": 5490,
    "hadith_number": 5490,
    "tajuk_hadith": "Tiada Penularan Penyakit, Ramalan Buruk, atau Kesialan",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "Allah's Messenger (ﷺ) said, \"(There is) no 'Adwa (no contagious disease is conveyed without Allah's permission). nor is there any bad omen (from birds), nor is there any Hamah, nor is there any bad omen in the month of Safar, and one should run away from the leper as one runs away from a lion.\"\n\n\n\nNote: The majority of scholars interpret this to mean that these things in and of themselves do not transmit or cause harm through supernatural or hidden means but that Allah is ultimately in control and any fearful superstition around these is false.",
    "arabic_text": "وَقَالَ عَفَّانُ حَدَّثَنَا سَلِيمُ بْنُ حَيَّانَ، حَدَّثَنَا سَعِيدُ بْنُ مِينَاءَ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ عَدْوَى وَلاَ طِيَرَةَ وَلاَ هَامَةَ وَلاَ صَفَرَ، وَفِرَّ مِنَ الْمَجْذُومِ كَمَا تَفِرُّ مِنَ الأَسَدِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Tiada penularan penyakit (tanpa izin Allah), tiada petanda buruk (daripada burung), tiada hama, tiada pula kesialan pada bulan Safar. Dan hendaklah kamu lari daripada orang kusta sebagaimana kamu lari daripada singa.\"\n\nNota: Kebanyakan ulama mentafsirkan hadis ini bermaksud bahawa perkara-perkara ini sendiri tidak menular atau menyebabkan kemudaratan melalui cara ghaib atau tersembunyi, tetapi Allah SWT sentiasa mengawal segalanya dan sebarang kepercayaan tahyul yang berkaitan dengannya adalah salah."
  },
  {
    "id": 5491,
    "hadith_number": 5491,
    "tajuk_hadith": "Kegunaan Truffle Menurut Nabi SAW",
    "perawi_melayu": "Daripada Said bin Zaid:",
    "english_text": "I heard the Prophet (ﷺ) saying, \"Truffles are like Manna (i.e. they grow naturally without man's care) and \ntheir water heals eye diseases.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ، سَمِعْتُ عَمْرَو بْنَ حُرَيْثٍ، قَالَ سَمِعْتُ سَعِيدَ بْنَ زَيْدٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الْكَمْأَةُ مِنَ الْمَنِّ، وَمَاؤُهَا شِفَاءٌ لِلْعَيْنِ ‏\"‏‏.‏ قَالَ شُعْبَةُ وَأَخْبَرَنِي الْحَكَمُ بْنُ عُتَيْبَةَ عَنِ الْحَسَنِ الْعُرَنِيِّ عَنْ عَمْرِو بْنِ حُرَيْثٍ عَنْ سَعِيدِ بْنِ زَيْدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ قَالَ شُعْبَةُ لَمَّا حَدَّثَنِي بِهِ الْحَكَمُ لَمْ أُنْكِرْهُ مِنْ حَدِيثِ عَبْدِ الْمَلِكِ‏.‏",
    "malay_translation": "Aku mendengar Nabi SAW bersabda: \"Truffle adalah seperti manna (iaitu, ia tumbuh secara semula jadi tanpa penjagaan manusia) dan airnya adalah penawar bagi penyakit mata.\""
  },
  {
    "id": 5492,
    "hadith_number": 5492,
    "tajuk_hadith": "Ciuman Abu Bakar dan Rawatan Nabi SAW",
    "perawi_melayu": "Daripada Ibnu Abbas dan Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي مُوسَى بْنُ أَبِي عَائِشَةَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، وَعَائِشَةَ، أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ قَبَّلَ النَّبِيَّ صلى الله عليه وسلم وَهْوَ مَيِّتٌ‏.‏   قَالَ وَقَالَتْ عَائِشَةُ لَدَدْنَاهُ فِي مَرَضِهِ، فَجَعَلَ يُشِيرُ إِلَيْنَا، أَنْ لاَ تَلُدُّونِي‏.‏ فَقُلْنَا كَرَاهِيَةُ الْمَرِيضِ لِلدَّوَاءِ‏.‏ فَلَمَّا أَفَاقَ قَالَ ‏\"‏ أَلَمْ أَنْهَكُمْ أَنْ تَلُدُّونِي ‏\"‏‏.‏ قُلْنَا كَرَاهِيَةَ الْمَرِيضِ لِلدَّوَاءِ‏.‏ فَقَالَ ‏\"‏ لاَ يَبْقَى فِي الْبَيْتِ أَحَدٌ إِلاَّ لُدَّ ـ وَأَنَا أَنْظُرُ ـ إِلاَّ الْعَبَّاسَ فَإِنَّهُ لَمْ يَشْهَدْكُمْ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ali bin Abdullah, telah menceritakan kepada kami Yahya bin Said, telah menceritakan kepada kami Sufian, dia berkata telah menceritakan kepadaku Musa bin Abi Aisyah, daripada Ubaidillah bin Abdullah, daripada Ibnu Abbas dan Aisyah, bahawa Abu Bakar - radhiallahu 'anhu - mencium Nabi SAW ketika baginda telah meninggal dunia.  Aisyah berkata, “Ketika baginda sakit, kami memasukkan ubat ke dalam mulut baginda, lalu baginda memberi isyarat kepada kami supaya jangan memaksa baginda. Kami berkata, “Ini kerana rasa tidak suka orang sakit kepada ubat.”  Setelah baginda sedar, baginda bertanya, “Bukankah aku telah melarang kamu daripada memaksa aku minum ubat?” Kami menjawab, “Kami menyangka baginda tidak suka kerana ia adalah kebiasaan orang sakit.” Baginda berkata, “Tiada seorang pun yang tinggal di rumah ini melainkan akan dipaksa minum ubat di bawah pengawasanku, kecuali Abbas, kerana dia tidak menyaksikan perbuatan kamu.”"
  },
  {
    "id": 5493,
    "hadith_number": 5493,
    "tajuk_hadith": "Penggunaan Ud Al-Hindi untuk merawat penyakit tekak dan tonsilitis",
    "perawi_melayu": "Riwayat Um Qais:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي عُبَيْدُ اللَّهِ، عَنْ أُمِّ قَيْسٍ، قَالَتْ دَخَلْتُ بِابْنٍ لِي عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَقَدْ أَعْلَقْتُ عَلَيْهِ مِنَ الْعُذْرَةِ فَقَالَ ‏\n\"‏ عَلَى مَا تَدْغَرْنَ أَوْلاَدَكُنَّ بِهَذَا الْعِلاَقِ عَلَيْكُنَّ بِهَذَا الْعُودِ الْهِنْدِيِّ، فَإِنَّ فِيهِ سَبْعَةَ أَشْفِيَةٍ، مِنْهَا ذَاتُ الْجَنْبِ يُسْعَطُ مِنَ الْعُذْرَةِ، وَيُلَدُّ مِنْ ذَاتِ الْجَنْبِ ‏\"‏‏.‏ فَسَمِعْتُ الزُّهْرِيَّ يَقُولُ بَيَّنَ لَنَا اثْنَيْنِ وَلَمْ يُبَيِّنْ لَنَا خَمْسَةً‏.‏ قُلْتُ لِسُفْيَانَ فَإِنَّ مَعْمَرًا يَقُولُ أَعْلَقْتُ عَلَيْهِ‏.‏ قَالَ لَمْ يَحْفَظْ أَعْلَقْتُ عَنْهُ، حَفِظْتُهُ مِنْ فِي الزُّهْرِيِّ‏.‏ وَوَصَفَ سُفْيَانُ الْغُلاَمَ يُحَنَّكُ بِالإِصْبَعِ وَأَدْخَلَ سُفْيَانُ فِي حَنَكِهِ، إِنَّمَا يَعْنِي رَفْعَ حَنَكِهِ بِإِصْبَعِهِ، وَلَمْ يَقُلْ أَعْلِقُوا عَنْهُ شَيْئًا‏.‏",
    "malay_translation": "Aku telah datang kepada Rasulullah ﷺ bersama anakku yang mana aku telah menekan lelangit dan tonsilnya dengan jariku sebagai rawatan untuk penyakit (tekak dan tonsil). Nabi ﷺ bersabda, \"Mengapa kamu menyakiti anak-anakmu dengan menekan tekak mereka! Gunakanlah Ud Al-Hindi (sejenis kayu wangi India), kerana ia menyembuhkan tujuh penyakit, salah satunya ialah radang selaput dada. Ia digunakan sebagai serbuk sedut untuk merawat penyakit tekak dan tonsil dan ia dimasukkan ke dalam satu sisi mulut bagi mereka yang menghidap radang selaput dada.\""
  },
  {
    "id": 5494,
    "hadith_number": 5494,
    "tajuk_hadith": "Keadaan Rasulullah SAW Ketika Sakit Berat dan Khutbah Akhir",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، وَيُونُسُ، قَالَ الزُّهْرِيُّ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ لَمَّا ثَقُلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَاشْتَدَّ وَجَعُهُ، اسْتَأْذَنَ أَزْوَاجَهُ فِي أَنْ يُمَرَّضَ فِي بَيْتِي، فَأَذِنَّ، فَخَرَجَ بَيْنَ رَجُلَيْنِ، تَخُطُّ رِجْلاَهُ فِي الأَرْضِ بَيْنَ عَبَّاسٍ وَآخَرَ‏.‏ فَأَخْبَرْتُ ابْنَ عَبَّاسٍ قَالَ هَلْ تَدْرِي مَنِ الرَّجُلُ الآخَرُ الَّذِي لَمْ تُسَمِّ عَائِشَةُ قُلْتُ لاَ‏.‏ قَالَ هُوَ عَلِيٌّ‏.‏ قَالَتْ عَائِشَةُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم بَعْدَ مَا دَخَلَ بَيْتَهَا وَاشْتَدَّ بِهِ وَجَعُهُ ‏\n\"‏ هَرِيقُوا عَلَىَّ مِنْ سَبْعِ قِرَبٍ لَمْ تُحْلَلْ أَوْكِيَتُهُنَّ، لَعَلِّي أَعْهَدُ إِلَى النَّاسِ ‏\"‏‏.‏ قَالَتْ فَأَجْلَسْنَاهُ فِي مِخْضَبٍ لِحَفْصَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم ثُمَّ طَفِقْنَا نَصُبُّ عَلَيْهِ مِنْ تِلْكَ الْقِرَبِ، حَتَّى جَعَلَ يُشِيرُ إِلَيْنَا أَنْ قَدْ فَعَلْتُنَّ‏.‏ قَالَتْ وَخَرَجَ إِلَى النَّاسِ فَصَلَّى لَهُمْ وَخَطَبَهُمْ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Bishr bin Muhammad, telah memberitakan kepada kami Abdullah, telah memberitakan kepada kami Ma’mar dan Yunus, berkata az- Zuhri telah memberitakan kepadaku Ubaidullah bin Abdullah bin Utbah, bahawa Aisyah – raḍiyallāhu ‘anhā – isteri Nabi ﷺ berkata: “Apabila Rasulullah ﷺ sakit tenat dan penyakitnya semakin teruk, baginda meminta izin kepada isteri-isterinya untuk dirawat di rumahku, maka mereka memberi izin. Maka baginda keluar di antara dua orang lelaki, kakinya terseret di atas tanah di antara Abbas dan seorang lagi.  Maka aku memberitahu Ibnu Abbas, lalu dia berkata: “Adakah engkau tahu siapakah lelaki yang lain yang tidak disebut oleh Aisyah?” Aku berkata: “Tidak.” Dia berkata: “Dia ialah Ali.”  Aisyah berkata: Kemudian Nabi ﷺ setelah masuk ke rumahnya dan penyakitnya semakin teruk, baginda bersabda: “Tuangkan ke atasku dari tujuh kulit air yang tali ikatnya belum dibuka, agar aku dapat menyampaikan wasiat kepada manusia.”  Maka kami dudukkan baginda di dalam bekas mandi milik Hafsah isteri Nabi ﷺ, kemudian kami menuangkan air ke atas baginda dari kulit-kulit air itu sehingga baginda memberi isyarat kepada kami untuk berhenti. Kemudian baginda keluar kepada manusia lalu solat dan berkhutbah kepada mereka.”"
  },
  {
    "id": 5495,
    "hadith_number": 5495,
    "tajuk_hadith": "Rawatan Batuk dengan Ud Hindi",
    "perawi_melayu": "Riwayat Ummu Qais:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، أَنَّ أُمَّ قَيْسٍ بِنْتَ مِحْصَنٍ الأَسَدِيَّةَ ـ أَسَدَ خُزَيْمَةَ، وَكَانَتْ مِنَ الْمُهَاجِرَاتِ الأُوَلِ اللاَّتِي بَايَعْنَ النَّبِيَّ صلى الله عليه وسلم وَهْىَ أُخْتُ عُكَّاشَةَ ـ أَخْبَرَتْهُ أَنَّهَا أَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم بِابْنٍ لَهَا، قَدْ أَعْلَقَتْ عَلَيْهِ مِنَ الْعُذْرَةِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ عَلَى مَا تَدْغَرْنَ أَوْلاَدَكُنَّ بِهَذَا الْعِلاَقِ عَلَيْكُمْ بِهَذَا الْعُودِ الْهِنْدِيِّ، فَإِنَّ فِيهِ سَبْعَةَ أَشْفِيَةٍ مِنْهَا ذَاتُ الْجَنْبِ ‏\"‏‏.‏ يُرِيدُ الْكُسْتَ، وَهْوَ الْعُودُ الْهِنْدِيُّ‏.‏ وَقَالَ يُونُسُ وَإِسْحَاقُ بْنُ رَاشِدٍ عَنِ الزُّهْرِيِّ عَلَّقَتْ عَلَيْهِ‏.‏",
    "malay_translation": "Abu Yaman telah meriwayatkan kepada kami, Syu’aib telah memberitakan kepada kami daripada Az Zuhri, katanya: Ubaidullah bin Abdullah telah memberitakan kepadaku bahawa Ummu Qais binti Mihshan Al-Asadiyyah – daripada puak Asad Khuzaimah, dan beliau adalah antara golongan Muhajirin awal yang telah memberi bai’ah kepada Nabi SAW, dan beliau adalah adik perempuan kepada Ukkashah – telah memberitakan kepadanya bahawa dia telah datang kepada Rasulullah SAW dengan anaknya yang telah dirawat dengan kaedah menekan lelangitnya kerana sakit tekak.  Maka Nabi SAW bersabda:  “Mengapa kamu semua menyakiti anak-anak kamu dengan kaedah menekan lelangit ini? Gunakanlah kayu gaharu India ini, kerana ia mengubati tujuh penyakit, antaranya ialah penyakit radang selaput dada.”  Maksudnya ialah kasturi, dan ia juga dikenali sebagai kayu gaharu India.  Yunus dan Ishak bin Rashid pula telah berkata daripada Az Zuhri: (Dia) telah merawatnya (dengan menekan lelangit)."
  },
  {
    "id": 5496,
    "hadith_number": 5496,
    "tajuk_hadith": "Madu untuk Cirit-birit",
    "perawi_melayu": "Riwayat Abu Sa`id:",
    "english_text": "A man came to the prophet and said, 'My brother has got loose motions. The Prophet (ﷺ) said, Let him drink honey.\" The man again (came) and said, 'I made him drink (honey) but that made him worse.' The Prophet (ﷺ) said, 'Allah has said the Truth, and the `Abdomen of your brother has told a lie.\" (See Hadith No. 88)",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَبِي الْمُتَوَكِّلِ، عَنْ أَبِي سَعِيدٍ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ إِنَّ أَخِي اسْتَطْلَقَ بَطْنُهُ‏.‏ فَقَالَ ‏\"‏ اسْقِهِ عَسَلاً ‏\"‏‏.‏ فَسَقَاهُ‏.‏ فَقَالَ إِنِّي سَقَيْتُهُ فَلَمْ يَزِدْهُ إِلاَّ اسْتِطْلاَقًا‏.‏ فَقَالَ ‏\"‏ صَدَقَ اللَّهُ وَكَذَبَ بَطْنُ أَخِيكَ ‏\"‏‏.‏ تَابَعَهُ النَّضْرُ عَنْ شُعْبَةَ‏.‏",
    "malay_translation": "Seorang lelaki datang kepada Nabi SAW dan berkata, \"Saudara saya mengalami cirit-birit.\"  Nabi SAW bersabda, \"Berikan dia madu.\" Lelaki itu datang lagi dan berkata, \"Saya telah memberinya madu, tetapi keadaannya menjadi lebih teruk.\" Nabi SAW bersabda, \"Allah SWT berfirman benar, dan perut saudaramu telah berdusta.\""
  },
  {
    "id": 5497,
    "hadith_number": 5497,
    "tajuk_hadith": "Penularan Penyakit dan Kehendak Allah",
    "perawi_melayu": "Dari Abu Hurairah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، وَغَيْرُهُ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ عَدْوَى وَلاَ صَفَرَ وَلاَ هَامَةَ ‏\"‏‏.‏ فَقَالَ أَعْرَابِيٌّ يَا رَسُولَ اللَّهِ فَمَا بَالُ إِبِلِي تَكُونُ فِي الرَّمْلِ كَأَنَّهَا الظِّبَاءُ فَيَأْتِي الْبَعِيرُ الأَجْرَبُ فَيَدْخُلُ بَيْنَهَا فَيُجْرِبُهَا‏.‏ فَقَالَ ‏\"‏ فَمَنْ أَعْدَى الأَوَّلَ ‏\"‏‏.‏ رَوَاهُ الزُّهْرِيُّ عَنْ أَبِي سَلَمَةَ وَسِنَانِ بْنِ أَبِي سِنَانٍ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abd al-'Aziz bin Abdillah, telah menceritakan kepada kami Ibrahim bin Sa'd, dari Shalih, dari Ibnu Syihab, dia berkata; telah memberitakan kepadaku Abu Salamah bin Abdurrahman dan selainnya, bahawa Abu Hurairah r.a. berkata: Sesungguhnya Rasulullah SAW telah bersabda: \"Tiada penularan penyakit, tiada penyakit kuning, dan tiada penyakit kudis.\"  Kemudian seorang Badwi berkata: \"Wahai Rasulullah, bagaimanakah hal unta-unta saya yang berada di pasir seperti rusa, kemudian datang unta yang berkudis lalu bercampur dengannya, lalu semuanya menjadi berkudis?\"  Baginda SAW bersabda: \"Lalu siapakah yang menularkan penyakit kepada unta yang pertama?\" Riwayat Az- Zuhri dari Abu Salamah dan Sinan bin Abi Sinan."
  },
  {
    "id": 5498,
    "hadith_number": 5498,
    "tajuk_hadith": "Larangan Mencederakan Anak dan Khasiat Ud Al-Hindi",
    "perawi_melayu": "Riwayat Ummu Qais",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا عَتَّابُ بْنُ بَشِيرٍ، عَنْ إِسْحَاقَ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، أَنَّ أُمَّ قَيْسٍ بِنْتَ مِحْصَنٍ،، وَكَانَتْ، مِنَ الْمُهَاجِرَاتِ الأُوَلِ اللاَّتِي بَايَعْنَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهْىَ أُخْتُ عُكَّاشَةَ بْنِ مِحْصَنٍ أَخْبَرَتْهُ أَنَّهَا أَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم بِابْنٍ لَهَا قَدْ عَلَّقَتْ عَلَيْهِ مِنَ الْعُذْرَةِ فَقَالَ ‏\n\"‏ اتَّقُوا اللَّهَ، عَلَى مَا تَدْغَرُونَ أَوْلاَدَكُمْ بِهَذِهِ الأَعْلاَقِ عَلَيْكُمْ بِهَذَا الْعُودِ الْهِنْدِيِّ، فَإِنَّ فِيهِ سَبْعَةَ أَشْفِيَةٍ، مِنْهَا ذَاتُ الْجَنْبِ ‏\"‏‏.‏ يُرِيدُ الْكُسْتَ يَعْنِي الْقُسْطَ، قَالَ وَهْىَ لُغَةٌ‏.‏",
    "malay_translation": "Muhammad telah meriwayatkan kepada aku, Ataab bin Basir memberitakan kepada kami, dari Ishak, dari Az- Zuhri, katanya: Ubaidullah bin Abdullah telah memberitakan kepadaku bahawa Ummu Qais binti Mihshan, iaitu dari kalangan Muhajirah yang terawal yang telah berbai’ah kepada Rasulullah SAW dan beliau adalah saudara perempuan Ukasyah bin Mihshan telah memberitakan kepadanya bahawa beliau telah datang kepada Rasulullah SAW dengan membawa anaknya yang telah beliau lakukan rawatan mencengkam pada tekaknya. Maka Baginda SAW bersabda: “Bertaqwalah kepada Allah, mengapa kamu menyakiti anak-anak kamu dengan cara mencengkam tekak mereka sedemikian? Gunakanlah kayu Hindi ini, kerana di dalamnya terdapat tujuh jenis penyembuhan, antaranya ialah penyakit radang selaput dada.” Maksudnya penyakit kusta, iaitu penyakit qust, katanya, dan ia merupakan satu dialek."
  },
  {
    "id": 5499,
    "hadith_number": 5499,
    "tajuk_hadith": "Keizinan Rawatan Ruqyah dan Kauterisasi",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "Allah's Messenger (ﷺ) allowed one of the Ansar families to treat persons who have taken poison and also \nwho are suffering from ear ailment with Ruqya. Anas added: I got myself branded cauterized) for \npleurisy, when Allah's Messenger (ﷺ) was still alive. Abu Talha, Anas bin An-Nadr and Zaid bin Thabit \nwitnessed that, and it was Abu Talha who branded (cauterized) me.",
    "arabic_text": "حَدَّثَنَا عَارِمٌ، حَدَّثَنَا حَمَّادٌ، قَالَ قُرِئَ عَلَى أَيُّوبَ مِنْ كُتُبِ أَبِي قِلاَبَةَ، مِنْهُ مَا حَدَّثَ بِهِ وَمِنْهُ مَا قُرِئَ عَلَيْهِ، وَكَانَ هَذَا فِي الْكِتَابِ عَنْ أَنَسٍ أَنَّ أَبَا طَلْحَةَ وَأَنَسَ بْنَ النَّضْرِ كَوَيَاهُ، وَكَوَاهُ أَبُو طَلْحَةَ بِيَدِهِ‏.‏ وَقَالَ عَبَّادُ بْنُ مَنْصُورٍ عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ أَذِنَ رَسُولُ اللَّهِ صلى الله عليه وسلم لأَهْلِ بَيْتٍ مِنَ الأَنْصَارِ أَنْ يَرْقُوا مِنَ الْحُمَةِ وَالأُذُنِ‏.‏ قَالَ أَنَسٌ كُوِيتُ مِنْ ذَاتِ الْجَنْبِ وَرَسُولُ اللَّهِ صلى الله عليه وسلم حَىٌّ، وَشَهِدَنِي أَبُو طَلْحَةَ وَأَنَسُ بْنُ النَّضْرِ وَزَيْدُ بْنُ ثَابِتٍ، وَأَبُو طَلْحَةَ كَوَانِي‏.‏",
    "malay_translation": "Rasulullah SAW membenarkan salah sebuah keluarga Ansar merawat individu yang telah memakan racun dan juga mereka yang mengalami penyakit telinga dengan rawatan Ruqyah. Anas menambah: Saya telah dirawat dengan kauterisasi (dibakar) untuk penyakit radang selaput dada ketika Rasulullah SAW masih hidup. Abu Talhah, Anas bin An-Nadhr dan Zaid bin Thabit menjadi saksi, dan Abu Talhah sendiri yang melakukan kauterisasi (pembakaran) itu kepada saya."
  },
  {
    "id": 5500,
    "hadith_number": 5500,
    "tajuk_hadith": "Fatima merawat kecederaan Rasulullah SAW di Perang Uhud",
    "perawi_melayu": "Riwayat Sahl bin Saad As-Sa'idi:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي سَعِيدُ بْنُ عُفَيْرٍ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ الْقَارِيُّ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، قَالَ لَمَّا كُسِرَتْ عَلَى رَأْسِ رَسُولِ اللَّهِ صلى الله عليه وسلم الْبَيْضَةُ، وَأُدْمِيَ وَجْهُهُ، وَكُسِرَتْ رَبَاعِيَتُهُ، وَكَانَ عَلِيٌّ يَخْتَلِفُ بِالْمَاءِ فِي الْمِجَنِّ، وَجَاءَتْ فَاطِمَةُ تَغْسِلُ عَنْ وَجْهِهِ الدَّمَ، فَلَمَّا رَأَتْ فَاطِمَةُ ـ عَلَيْهَا السَّلاَمُ ـ الدَّمَ يَزِيدُ عَلَى الْمَاءِ كَثْرَةً عَمَدَتْ إِلَى حَصِيرٍ فَأَحْرَقَتْهَا وَأَلْصَقَتْهَا عَلَى جُرْحِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَرَقَأَ الدَّمُ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Said bin Ufair, telah menceritakan kepada kami Ya'qub bin Abdurrahman Al-Qari, dari Abi Hazim, dari Sahl bin Saad As-Sa'idi, dia berkata: \"Ketika helm Rasulullah SAW pecah di kepalanya, dan wajah Baginda berlumuran darah, dan salah satu gigi seri Baginda patah (yakni ketika Perang Uhud), Ali RA selalu membawa air dalam perisainya, dan Fatimah RA datang untuk membasuh darah dari wajah Baginda.  Ketika Fatimah RA melihat darah semakin banyak daripada air, maka dia mengambil tikar (dari daun kurma), membakarnya, dan menempelkan (abunya yang terbakar) pada luka Rasulullah SAW, lalu darah pun berhenti mengalir.\""
  },
  {
    "id": 5501,
    "hadith_number": 5501,
    "tajuk_hadith": "Demam Daripada Api Neraka",
    "perawi_melayu": "Riwayat Nafi'",
    "english_text": "`Abdullah bin `Umar said, \"The Prophet (ﷺ) said, 'Fever is from the heat of Hell, so put it out (cool it) \nwith water.' \" Nafi` added: `Abdullah used to say, \"O Allah! Relieve us from the punishment,\" (when \nhe suffered from fever).",
    "arabic_text": "حَدَّثَنِي يَحْيَى بْنُ سُلَيْمَانَ، حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ فَأَطْفِئُوهَا بِالْمَاءِ ‏\"‏‏.‏ قَالَ نَافِعٌ وَكَانَ عَبْدُ اللَّهِ يَقُولُ اكْشِفْ عَنَّا الرِّجْزَ‏.‏",
    "malay_translation": "Abdullah bin Umar berkata, \"Rasulullah SAW bersabda, 'Demam adalah daripada bahang neraka Jahannam, maka padamkanlah (sejukkanya) dengan air.'\" Nafi' menambah: Abdullah selalu berdoa, \"Ya Allah! Hilangkanlah bala bencana daripada kami,\" (apabila dia demam)."
  },
  {
    "id": 5502,
    "hadith_number": 5502,
    "tajuk_hadith": "Mengubati Demam dengan Air",
    "perawi_melayu": "Daripada Fatimah binti Al-Mundzir:",
    "english_text": "Whenever a lady suffering from fever was brought to Asma' bint Abu Bakr, she used to invoke Allah \nfor her and then sprinkle some water on her body, at the chest and say, \"Allah's Messenger (ﷺ) used to order \nus to abate fever with water.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ هِشَامٍ، عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ، أَنَّ أَسْمَاءَ بِنْتَ أَبِي بَكْرٍ ـ رضى الله عنهما ـ كَانَتْ إِذَا أُتِيَتْ بِالْمَرْأَةِ قَدْ حُمَّتْ تَدْعُو لَهَا، أَخَذَتِ الْمَاءَ فَصَبَّتْهُ بَيْنَهَا وَبَيْنَ جَيْبِهَا قَالَتْ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَأْمُرُنَا أَنْ نَبْرُدَهَا بِالْمَاءِ‏.‏",
    "malay_translation": "Daripada Fatimah binti Al-Mundzir, bahawa Asma' binti Abu Bakar r.a. jika didatangi oleh seorang wanita yang demam, akan berdoa untuknya, mengambil air lalu menyiramkannya pada tubuh wanita itu, di bahagian dada, dan berkata, \"Rasulullah SAW  pernah memerintahkan kami untuk menurunkan demam dengan air.\""
  },
  {
    "id": 5503,
    "hadith_number": 5503,
    "tajuk_hadith": "Demam Daripada Panas Neraka",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "The Prophet (ﷺ) said, \"Fever is from the heat of Hell, so abate fever with water.\"",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، حَدَّثَنَا هِشَامٌ، أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ فَابْرُدُوهَا بِالْمَاءِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Demam adalah daripada bahang neraka Jahannam, maka redakanlah ia dengan air.\""
  },
  {
    "id": 5504,
    "hadith_number": 5504,
    "tajuk_hadith": "Demam: Habaan Neraka dan Rawatannya",
    "perawi_melayu": "Riwayat Rafi` bin Khadij:",
    "english_text": "I heard Allah's Messenger (ﷺ) saying, \"Fever is from the heat of Hell, so abate fever with water.\"",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو الأَحْوَصِ، حَدَّثَنَا سَعِيدُ بْنُ مَسْرُوقٍ، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ، عَنْ جَدِّهِ، رَافِعِ بْنِ خَدِيجٍ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الْحُمَّى مِنْ فَوْحِ جَهَنَّمَ، فَابْرُدُوهَا بِالْمَاءِ ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda, \"Demam adalah daripada bahang Neraka Jahannam, maka redakanlah demam itu dengan air.\""
  },
  {
    "id": 5505,
    "hadith_number": 5505,
    "tajuk_hadith": "Balasan Orang Murtad dari Suku 'Ukl dan 'Urainah",
    "perawi_melayu": "Riwayat Anas bin Malik:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، حَدَّثَنَا قَتَادَةُ، أَنَّ أَنَسَ بْنَ مَالِكٍ، حَدَّثَهُمْ أَنَّ نَاسًا أَوْ رِجَالاً مِنْ عُكْلٍ وَعُرَيْنَةَ قَدِمُوا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَتَكَلَّمُوا بِالإِسْلاَمِ وَقَالُوا يَا نَبِيَّ اللَّهِ إِنَّا كُنَّا أَهْلَ ضَرْعٍ، وَلَمْ نَكُنْ أَهْلَ رِيفٍ، وَاسْتَوْخَمُوا الْمَدِينَةَ فَأَمَرَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم بِذَوْدٍ وَبِرَاعٍ وَأَمَرَهُمْ، أَنْ يَخْرُجُوا فِيهِ فَيَشْرَبُوا مِنْ أَلْبَانِهَا وَأَبْوَالِهَا، فَانْطَلَقُوا حَتَّى كَانُوا نَاحِيَةَ الْحَرَّةِ، كَفَرُوا بَعْدَ إِسْلاَمِهِمْ، وَقَتَلُوا رَاعِيَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَاسْتَاقُوا الذَّوْدَ فَبَلَغَ النَّبِيَّ صلى الله عليه وسلم فَبَعَثَ الطَّلَبَ فِي آثَارِهِمْ، وَأَمَرَ بِهِمْ فَسَمَرُوا أَعْيُنَهُمْ وَقَطَعُوا أَيْدِيَهُمْ وَتُرِكُوا فِي نَاحِيَةِ الْحَرَّةِ حَتَّى مَاتُوا عَلَى حَالِهِمْ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abd al-A'la bin Hammad, telah menceritakan kepada kami Yazid bin Zurai', telah menceritakan kepada kami Sa'id, telah menceritakan kepada kami Qatadah, bahawa Anas bin Malik telah menceritakan kepada mereka bahawa beberapa orang atau lelaki dari suku 'Ukl dan 'Urainah datang kepada Rasulullah SAW dan mereka mengucapkan kalimah syahadah serta memeluk Islam. Mereka berkata, \"Wahai Nabi Allah, kami adalah penternak, dan bukan petani.\" Mereka mendapati iklim Madinah tidak sesuai untuk mereka. Maka Rasulullah SAW memerintahkan agar mereka diberi beberapa ekor unta dan seorang gembala, dan memerintahkan mereka untuk keluar bersama unta-unta itu dan meminum susu dan air kencingnya. Maka mereka pun berangkat, sehingga sampai ke kawasan al-Harrah, mereka murtad selepas memeluk Islam, dan membunuh gembala Rasulullah SAW serta melarikan unta-unta tersebut. Berita itu sampai kepada Nabi SAW, maka baginda menghantar orang untuk mengejar mereka (dan mereka ditangkap serta dibawa). Nabi SAW memerintahkan agar mata mereka dipanaskan dengan besi yang dipanaskan dan tangan mereka dipotong, dan mereka dibiarkan di kawasan al-Harrah sehingga mereka mati dalam keadaan sedemikian."
  },
  {
    "id": 5506,
    "hadith_number": 5506,
    "tajuk_hadith": "Larangan Masuk dan Keluar dari Tempat Wabak",
    "perawi_melayu": "Riwayat Saud:",
    "english_text": "The Prophet (ﷺ) said, \"If you hear of an outbreak of plague in a land, do not enter it; but if the plague \nbreaks out in a place while you are in it, do not leave that place.\"",
    "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي حَبِيبُ بْنُ أَبِي ثَابِتٍ، قَالَ سَمِعْتُ إِبْرَاهِيمَ بْنَ سَعْدٍ، قَالَ سَمِعْتُ أُسَامَةَ بْنَ زَيْدٍ، يُحَدِّثُ سَعْدًا عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا سَمِعْتُمْ بِالطَّاعُونِ بِأَرْضٍ فَلاَ تَدْخُلُوهَا، وَإِذَا وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلاَ تَخْرُجُوا مِنْهَا ‏\"‏‏.‏ فَقُلْتُ أَنْتَ سَمِعْتَهُ يُحَدِّثُ سَعْدًا وَلاَ يُنْكِرُهُ قَالَ نَعَمْ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Jika kamu mendengar tentang wabak penyakit di suatu tempat, maka janganlah kamu memasukinya.  Tetapi jika wabak itu telah berlaku di suatu tempat sedang kamu berada di situ, maka janganlah kamu keluar dari tempat itu.\""
  },
  {
    "id": 5507,
    "hadith_number": 5507,
    "tajuk_hadith": "Wabah di Syam dan Pandangan Umar bin al-Khattab",
    "perawi_melayu": "Riwayat Abdullah bin Abbas:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الْحَمِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ زَيْدِ بْنِ الْخَطَّابِ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ خَرَجَ إِلَى الشَّأْمِ حَتَّى إِذَا كَانَ بِسَرْغَ لَقِيَهُ أُمَرَاءُ الأَجْنَادِ أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ وَأَصْحَابُهُ، فَأَخْبَرُوهُ أَنَّ الْوَبَاءَ قَدْ وَقَعَ بِأَرْضِ الشَّأْمِ‏.‏ قَالَ ابْنُ عَبَّاسٍ فَقَالَ عُمَرُ ادْعُ لِي الْمُهَاجِرِينَ الأَوَّلِينَ‏.‏ فَدَعَاهُمْ فَاسْتَشَارَهُمْ وَأَخْبَرَهُمْ أَنَّ الْوَبَاءَ قَدْ وَقَعَ بِالشَّأْمِ فَاخْتَلَفُوا‏.‏ فَقَالَ بَعْضُهُمْ قَدْ خَرَجْتَ لأَمْرٍ، وَلاَ نَرَى أَنْ تَرْجِعَ عَنْهُ‏.‏ وَقَالَ بَعْضُهُمْ مَعَكَ بَقِيَّةُ النَّاسِ وَأَصْحَابُ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلاَ نَرَى أَنْ تُقْدِمَهُمْ عَلَى هَذَا الْوَبَاءِ‏.‏ فَقَالَ ارْتَفِعُوا عَنِّي‏.‏ ثُمَّ قَالَ ادْعُوا لِي الأَنْصَارَ‏.‏ فَدَعَوْتُهُمْ فَاسْتَشَارَهُمْ، فَسَلَكُوا سَبِيلَ الْمُهَاجِرِينَ، وَاخْتَلَفُوا كَاخْتِلاَفِهِمْ، فَقَالَ ارْتَفِعُوا عَنِّي‏.‏ ثُمَّ قَالَ ادْعُ لِي مَنْ كَانَ هَا هُنَا مِنْ مَشْيَخَةِ قُرَيْشٍ مِنْ مُهَاجِرَةِ الْفَتْحِ‏.‏ فَدَعَوْتُهُمْ، فَلَمْ يَخْتَلِفْ مِنْهُمْ عَلَيْهِ رَجُلاَنِ، فَقَالُوا نَرَى أَنْ تَرْجِعَ بِالنَّاسِ، وَلاَ تُقْدِمَهُمْ عَلَى هَذَا الْوَبَاءِ، فَنَادَى عُمَرُ فِي النَّاسِ، إِنِّي مُصَبِّحٌ عَلَى ظَهْرٍ، فَأَصْبِحُوا عَلَيْهِ‏.‏ قَالَ أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ أَفِرَارًا مِنْ قَدَرِ اللَّهِ فَقَالَ عُمَرُ لَوْ غَيْرُكَ قَالَهَا يَا أَبَا عُبَيْدَةَ، نَعَمْ نَفِرُّ مِنْ قَدَرِ اللَّهِ إِلَى قَدَرِ اللَّهِ، أَرَأَيْتَ لَوْ كَانَ لَكَ إِبِلٌ هَبَطَتْ وَادِيًا لَهُ عُدْوَتَانِ، إِحْدَاهُمَا خَصِبَةٌ، وَالأُخْرَى جَدْبَةٌ، أَلَيْسَ إِنْ رَعَيْتَ الْخَصْبَةَ رَعَيْتَهَا بِقَدَرِ اللَّهِ، وَإِنْ رَعَيْتَ الْجَدْبَةَ رَعَيْتَهَا بِقَدَرِ اللَّهِ قَالَ فَجَاءَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ، وَكَانَ مُتَغَيِّبًا فِي بَعْضِ حَاجَتِهِ فَقَالَ إِنَّ عِنْدِي فِي هَذَا عِلْمًا سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِذَا سَمِعْتُمْ بِهِ بِأَرْضٍ فَلاَ تَقْدَمُوا عَلَيْهِ، وَإِذَا وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلاَ تَخْرُجُوا فِرَارًا مِنْهُ ‏\"‏‏.‏ قَالَ فَحَمِدَ اللَّهَ عُمَرُ ثُمَّ انْصَرَفَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Yusuf, telah memberitakan kepada kami Malik, dari Ibnu Syihab, dari Abd al-Hamid bin Abd al-Rahman bin Zaid bin al-Khattab, dari Abdullah bin Abdullah bin al-Harits bin Nawfal, dari Abdullah bin Abbas, bahawa Umar bin al-Khattab - semoga Allah merahmatinya - telah keluar ke Syam sehingga apabila dia berada di Sargh, telah menemuinya ketua-ketua tentera, Abu Ubaidah bin al-Jarrah dan sahabat-sahabatnya, lalu mereka memberitahunya bahawa wabak telah berlaku di bumi Syam.  Ibnu Abbas berkata, lalu Umar berkata, “Panggilkan kepadaku para Muhajirin yang terawal.” Maka dia memanggil mereka, lalu bermesyuarat dengan mereka dan memberitahu mereka bahawa wabak telah berlaku di Syam, lalu mereka berbeza pendapat. Sebahagian daripada mereka berkata, “Sesungguhnya engkau telah keluar untuk suatu urusan, dan kami tidak melihat bahawa engkau perlu kembali darinya.” Dan sebahagian daripada mereka berkata, “Bersamamu ada orang ramai yang lain dan sahabat-sahabat Rasulullah SAW, dan kami tidak melihat bahawa engkau perlu membawa mereka ke wabak ini.” Maka Umar berkata kepada mereka, “Tinggalkan aku.” Kemudian dia berkata, “Panggilkan kepadaku kaum Ansar.” Maka aku memanggil mereka, lalu dia bermesyuarat dengan mereka, maka mereka mengambil jalan para Muhajirin dan berbeza pendapat sebagaimana perbezaan mereka. Maka dia berkata, “Tinggalkan aku.” Kemudian dia berkata, “Panggilkan kepadaku orang-orang tua Quraisy yang berhijrah pada tahun Fath Mekah.” Maka aku memanggil mereka, lalu tidak ada perselisihan di antara mereka, lalu mereka berkata, “Kami melihat bahawa engkau perlu kembali bersama orang ramai dan janganlah engkau membawa mereka ke wabak ini.” Maka Umar mengumumkan di kalangan manusia, “Sesungguhnya aku akan kembali ke Madinah pada waktu pagi, maka kembali jugalah kamu.” Abu Ubaidah bin al-Jarrah berkata, “Apakah ini melarikan diri daripada takdir Allah?” Maka Umar berkata, “Seandainya bukan kamu yang berkata demikian, wahai Abu Ubaidah! Ya, kami melarikan diri daripada takdir Allah kepada takdir Allah. Apakah engkau melihat sekiranya engkau mempunyai unta yang turun ke lembah yang mempunyai dua tempat, salah satunya subur dan yang lain tandus, bukankah sekiranya engkau menggembala di tempat yang subur itu, engkau menggembalanya dengan takdir Allah, dan sekiranya engkau menggembala di tempat yang tandus itu, engkau menggembalanya dengan takdir Allah?”  Lalu datang Abd al-Rahman bin Auf, dan dia telah tidak hadir kerana urusan tertentu, lalu dia berkata, “Sesungguhnya aku mempunyai ilmu dalam hal ini. Aku telah mendengar Rasulullah SAW bersabda, ‘Jika kamu mendengar tentang wabak di suatu negeri, maka janganlah kamu pergi ke situ; tetapi jika wabak itu berlaku di negeri yang kamu berada di dalamnya, maka janganlah kamu keluar melarikan diri darinya.’” Maka Umar memuji Allah, kemudian dia berpatah balik."
  },
  {
    "id": 5508,
    "hadith_number": 5508,
    "tajuk_hadith": "Larangan Meninggalkan Tempat Wabak",
    "perawi_melayu": "Riwayat Abdullah bin Amir:",
    "english_text": "`Umar went to Sham and when he reached Sargh, he got the news that an epidemic (of plague) had \nbroken out in Sham. `Abdur-Rahman bin `Auf told him that Allah's Messenger (ﷺ) said, \"If you hear that it \n(plague) has broken out in a land, do not go to it; but if it breaks out in a land where you are present, \ndo not go out escaping from it.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَامِرٍ، أَنَّ عُمَرَ، خَرَجَ إِلَى الشَّأْمِ، فَلَمَّا كَانَ بِسَرْغَ بَلَغَهُ أَنَّ الْوَبَاءَ قَدْ وَقَعَ بِالشَّأْمِ، فَأَخْبَرَهُ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا سَمِعْتُمْ بِهِ بِأَرْضٍ فَلاَ تَقْدَمُوا عَلَيْهِ وَإِذَا وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلاَ تَخْرُجُوا فِرَارًا مِنْهُ ‏\"‏‏.‏",
    "malay_translation": "Umar telah pergi ke Syam. Ketika sampai di Sargh, baginda mendapat berita bahawa wabak penyakit telah merebak di Syam. Abdur-Rahman bin Auf memberitahu baginda bahawa Rasulullah SAW bersabda:  \"Jika kamu mendengar tentang wabak di suatu tempat, janganlah kamu pergi ke situ; dan jika ia telah merebak di tempat kamu berada, janganlah kamu lari meninggalkannya.\""
  },
  {
    "id": 5509,
    "hadith_number": 5509,
    "tajuk_hadith": "Madinah Terpelihara Dari Dajjal dan Wabak",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "Allah's Messenger (ﷺ) said, \"Neither Messiah (Ad-Dajjal) nor plague will enter Medina.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نُعَيْمٍ الْمُجْمِرِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَدْخُلُ الْمَدِينَةَ الْمَسِيحُ وَلاَ الطَّاعُونُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Madinah tidak akan dimasuki oleh Dajjal dan wabak.\""
  },
  {
    "id": 5510,
    "hadith_number": 5510,
    "tajuk_hadith": "Syahid Akibat Wabak",
    "perawi_melayu": "Anas bin Malik:",
    "english_text": "Allah's Messenger (ﷺ) said, \"(Death from) plague is martyrdom for every Muslim.\"",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا عَاصِمٌ، حَدَّثَتْنِي حَفْصَةُ بِنْتُ سِيرِينَ، قَالَتْ قَالَ لِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ يَحْيَى بِمَا مَاتَ قُلْتُ مِنَ الطَّاعُونِ‏.‏ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الطَّاعُونُ شَهَادَةٌ لِكُلِّ مُسْلِمٍ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Wabah penyakit merupakan syahid bagi setiap Muslim.\""
  },
  {
    "id": 5511,
    "hadith_number": 5511,
    "tajuk_hadith": "Syahid Akibat Penyakit Perut dan Wabak",
    "perawi_melayu": "Dari Abu Hurairah",
    "english_text": "The Prophet (ﷺ) said, \"He (a Muslim) who dies of an abdominal disease is a martyr, and he who dies of \nplague is a martyr.\"",
    "arabic_text": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ مَالِكٍ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْمَبْطُونُ شَهِيدٌ، وَالْمَطْعُونُ شَهِيدٌ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Sesiapa yang mati disebabkan penyakit perut, dia adalah syahid, dan sesiapa yang mati disebabkan penyakit wabak, dia juga adalah syahid.\""
  },
  {
    "id": 5512,
    "hadith_number": 5512,
    "tajuk_hadith": "Ganjaran Sabar Menghadapi Wabak",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "(the wife of the Prophet) that she asked Allah's Messenger (ﷺ) about plague, and Allah's Messenger (ﷺ) informed \nher saying, \"Plague was a punishment which Allah used to send on whom He wished, but Allah made \nit a blessing for the believers. None (among the believers) remains patient in a land in which plague \nhas broken out and considers that nothing will befall him except what Allah has ordained for him, but \nthat Allah will grant him a reward similar to that of a martyr.\"",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا حَبَّانُ، حَدَّثَنَا دَاوُدُ بْنُ أَبِي الْفُرَاتِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، عَنْ يَحْيَى بْنِ يَعْمَرَ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا أَخْبَرَتْنَا أَنَّهَا سَأَلَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الطَّاعُونِ فَأَخْبَرَهَا نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَنَّهُ كَانَ عَذَابًا يَبْعَثُهُ اللَّهُ عَلَى مَنْ يَشَاءُ، فَجَعَلَهُ اللَّهُ رَحْمَةً لِلْمُؤْمِنِينَ، فَلَيْسَ مِنْ عَبْدٍ يَقَعُ الطَّاعُونُ فَيَمْكُثُ فِي بَلَدِهِ صَابِرًا، يَعْلَمُ أَنَّهُ لَنْ يُصِيبَهُ إِلاَّ مَا كَتَبَ اللَّهُ لَهُ، إِلاَّ كَانَ لَهُ مِثْلُ أَجْرِ الشَّهِيدِ ‏\"‏‏.‏ تَابَعَهُ النَّضْرُ عَنْ دَاوُدَ‏.‏",
    "malay_translation": "Daripada Aisyah, isteri Nabi SAW, bahawa beliau bertanya kepada Rasulullah SAW tentang wabak penyakit. Rasulullah SAW memberitahu beliau: \"Wabak itu adalah azab yang Allah SWT kirimkan kepada sesiapa yang Dia kehendaki.  Namun, Allah SWT menjadikannya rahmat kepada orang-orang yang beriman.  Sesiapa yang sabar di tempat wabak itu melanda, dan yakin bahawa apa yang menimpanya hanyalah ketentuan Allah SWT, maka baginya pahala seperti pahala syahid.\""
  },
  {
    "id": 5513,
    "hadith_number": 5513,
    "tajuk_hadith": "Nabi SAW Membaca Mu'awwidzatain dan Menghembus Nafas Ketika Sakit",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "During the Prophet's fatal illness, he used to recite the Mu'auwidhat (Surat An-Nas and Surat Al- \nFalaq) and then blow his breath over his body. When his illness was aggravated, I used to recite those \ntwo Suras and blow my breath over him and make him rub his body with his own hand for its \nblessings.\" (Ma`mar asked Az-Zuhri: How did the Prophet (ﷺ) use to blow? Az-Zuhri said: He used to \nblow on his hands and then passed them over his face.)",
    "arabic_text": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَنْفُثُ عَلَى نَفْسِهِ فِي الْمَرَضِ الَّذِي مَاتَ فِيهِ بِالْمُعَوِّذَاتِ، فَلَمَّا ثَقُلَ كُنْتُ أَنْفِثُ عَلَيْهِ بِهِنَّ، وَأَمْسَحُ بِيَدِ نَفْسِهِ لِبَرَكَتِهَا‏.‏ فَسَأَلْتُ الزُّهْرِيَّ كَيْفَ يَنْفِثُ قَالَ كَانَ يَنْفِثُ عَلَى يَدَيْهِ، ثُمَّ يَمْسَحُ بِهِمَا وَجْهَهُ‏.‏",
    "malay_translation": "Ketika sakit yang menyebabkan baginda wafat, Nabi SAW selalu membaca Mu'awwidzatain (Surah Al-Falaq dan An-Nas) kemudian menghembuskannya ke atas dirinya.  Apabila penyakit baginda semakin teruk, saya membacakan dua surah tersebut dan menghembuskannya ke atas baginda serta menyuruh baginda menggosok badannya sendiri untuk mendapat keberkatan. (Ma'mar bertanya kepada Az- Zuhri: Bagaimanakah cara Nabi SAW menghembus? Az-Zuhri menjawab: Baginda menghembus ke atas kedua belah tangannya, kemudian menggosok wajah dengan kedua tangan itu.)"
  },
  {
    "id": 5514,
    "hadith_number": 5514,
    "tajuk_hadith": "Rawatan Dengan Al-Fatihah dan Ganjarannya",
    "perawi_melayu": "Riwayat Abu Sa`id Al-Khudri:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، عَنْ أَبِي الْمُتَوَكِّلِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ أَنَّ نَاسًا مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم أَتَوْا عَلَى حَىٍّ مِنْ أَحْيَاءِ الْعَرَبِ فَلَمْ يَقْرُوهُمْ، فَبَيْنَمَا هُمْ كَذَلِكَ إِذْ لُدِغَ سَيِّدُ أُولَئِكَ فَقَالُوا هَلْ مَعَكُمْ مِنْ دَوَاءٍ أَوْ رَاقٍ فَقَالُوا إِنَّكُمْ لَمْ تَقْرُونَا، وَلاَ نَفْعَلُ حَتَّى تَجْعَلُوا لَنَا جُعْلاً‏.‏ فَجَعَلُوا لَهُمْ قَطِيعًا مِنَ الشَّاءِ، فَجَعَلَ يَقْرَأُ بِأُمِّ الْقُرْآنِ، وَيَجْمَعُ بُزَاقَهُ، وَيَتْفِلُ، فَبَرَأَ، فَأَتَوْا بِالشَّاءِ، فَقَالُوا لاَ نَأْخُذُهُ حَتَّى نَسْأَلَ النَّبِيَّ صلى الله عليه وسلم فَسَأَلُوهُ فَضَحِكَ وَقَالَ ‏\n\"‏ وَمَا أَدْرَاكَ أَنَّهَا رُقْيَةٌ، خُذُوهَا، وَاضْرِبُوا لِي بِسَهْمٍ ‏\"‏‏.‏",
    "malay_translation": "Daripada Muhammad bin Bashar, daripada Ghundar, daripada Syu`bah, daripada Abu Basyr, daripada Abu Al-Mutawakkil, daripada Abu Sa`id Al-Khudri r.a., bahawa sekumpulan sahabat Nabi SAW sampai di suatu kaum daripada kaum Arab, dan kaum itu tidak melayan mereka.  Ketika mereka berada dalam keadaan sedemikian, tiba-tiba ketua kaum itu digigit ular (atau disengat kala jengking). Mereka berkata kepada sahabat-sahabat Nabi SAW, \"Adakah kamu ada ubat atau perawat (yang mengamalkan rawatan ruqyah)?\" Sahabat-sahabat Nabi SAW menjawab, \"Kamu tidak melayan kami, dan kami tidak akan merawat (ketua kamu) sehingga kamu memberikan kami upah.\" Maka mereka memberikan kepada mereka seekor kambing.  Salah seorang daripada mereka (sahabat Nabi SAW) mula membaca Surah Al-Fatihah, mengumpulkan air liurnya, dan meludahinya (pada tempat gigitan ular).  Pesakit itu sembuh, lalu mereka membawa kambing itu.  Mereka berkata, \"Kami tidak akan menerimanya sehingga kami bertanya kepada Nabi SAW.\"  Lalu mereka bertanya kepada Nabi SAW, Baginda tersenyum dan bersabda, \"Bagaimana kamu tahu bahawa Al-Fatihah itu adalah rawatan ruqyah? Ambillah (kambing itu), dan berikan sebahagiannya untukku.\" "
  },
  {
    "id": 5515,
    "hadith_number": 5515,
    "tajuk_hadith": "Upah Membaca Ruqyah dengan Kitabullah",
    "perawi_melayu": "Riwayat Ibnu Abbas",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي سِيدَانُ بْنُ مُضَارِبٍ أَبُو مُحَمَّدٍ الْبَاهِلِيُّ، حَدَّثَنَا أَبُو مَعْشَرٍ الْبَصْرِيُّ ـ هُوَ صَدُوقٌ ـ يُوسُفُ بْنُ يَزِيدَ الْبَرَّاءُ قَالَ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ الأَخْنَسِ أَبُو مَالِكٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ نَفَرًا، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم مَرُّوا بِمَاءٍ فِيهِمْ لَدِيغٌ ـ أَوْ سَلِيمٌ ـ فَعَرَضَ لَهُمْ رَجُلٌ مِنْ أَهْلِ الْمَاءِ فَقَالَ هَلْ فِيكُمْ مِنْ رَاقٍ إِنَّ فِي الْمَاءِ رَجُلاً لَدِيغًا أَوْ سَلِيمًا‏.‏ فَانْطَلَقَ رَجُلٌ مِنْهُمْ فَقَرَأَ بِفَاتِحَةِ الْكِتَابِ عَلَى شَاءٍ، فَبَرَأَ، فَجَاءَ بِالشَّاءِ إِلَى أَصْحَابِهِ فَكَرِهُوا ذَلِكَ وَقَالُوا أَخَذْتَ عَلَى كِتَابِ اللَّهِ أَجْرًا‏.‏ حَتَّى قَدِمُوا الْمَدِينَةَ فَقَالُوا يَا رَسُولَ اللَّهِ أَخَذَ عَلَى كِتَابِ اللَّهِ أَجْرًا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ أَحَقَّ مَا أَخَذْتُمْ عَلَيْهِ أَجْرًا كِتَابُ اللَّهِ ‏\"‏‏.‏",
    "malay_translation": "Daripada Ibnu Abbas r.a., bahawa sekumpulan sahabat Nabi SAW. melalui suatu tempat yang terdapat air. Di kalangan mereka ada seorang yang terkena sengatan kala jengking.  Seorang lelaki dari penduduk tempat itu menghampiri mereka lalu berkata, \"Adakah di kalangan kamu ada yang boleh merawat dengan ruqyah? Di sini ada seseorang yang terkena sengatan kala jengking.\" Maka seorang daripada mereka pergi dan membaca surah al-Fatihah,  dengan bayaran seekor kambing.  Pesakit itu sembuh, lalu lelaki itu membawa kambing itu kepada sahabat-sahabatnya. Mereka tidak suka akan perbuatannya dan berkata, \"Engkau mengambil upah dengan membaca Kitab Allah.\"  Setibanya mereka di Madinah, mereka berkata, \"Wahai Rasulullah SAW., dia telah mengambil upah dengan membaca Kitab Allah.\"  Maka Rasulullah SAW. bersabda,  \"Sesungguhnya, yang paling berhak kamu ambil upah ialah dengan Kitabullah.\""
  },
  {
    "id": 5516,
    "hadith_number": 5516,
    "tajuk_hadith": "Rasulullah SAW Menerima Rawatan Ruqyah dari Mata Jahat",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "The Prophet (ﷺ) ordered me or somebody else to do Ruqya (if there was danger) from an evil eye.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، قَالَ حَدَّثَنِي مَعْبَدُ بْنُ خَالِدٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ شَدَّادٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ أَمَرَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم أَوْ أَمَرَ أَنْ يُسْتَرْقَى مِنَ الْعَيْنِ‏.‏",
    "malay_translation": "Rasulullah SAW telah memerintahkan saya, atau orang lain, untuk melakukan rawatan ruqyah sekiranya terdapat bahaya daripada mata jahat."
  },
  {
    "id": 5517,
    "hadith_number": 5517,
    "tajuk_hadith": "Rawatan Ruqyah untuk Mata Jahat",
    "perawi_melayu": "Daripada Ummu Salamah",
    "english_text": "that the Prophet (ﷺ) saw in her house a girl whose face had a black spot. He said. \"She is under the effect of an evil eye; so treat her with a Ruqya.\"",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ خَالِدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ وَهْبِ بْنِ عَطِيَّةَ الدِّمَشْقِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، حَدَّثَنَا مُحَمَّدُ بْنُ الْوَلِيدِ الزُّبَيْدِيُّ، أَخْبَرَنَا الزُّهْرِيُّ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ زَيْنَبَ ابْنَةِ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى فِي بَيْتِهَا جَارِيَةً فِي وَجْهِهَا سَفْعَةٌ فَقَالَ ‏\n\"‏ اسْتَرْقُوا لَهَا، فَإِنَّ بِهَا النَّظْرَةَ ‏\"‏‏.‏ وَقَالَ عُقَيْلٌ عَنِ الزُّهْرِيِّ أَخْبَرَنِي عُرْوَةُ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ تَابَعَهُ عَبْدُ اللَّهِ بْنُ سَالِمٍ عَنِ الزُّبَيْدِيِّ‏.‏",
    "malay_translation": "Daripada Ummu Salamah r.a. bahawa Nabi SAW melihat di rumahnya seorang hamba perempuan yang mempunyai tompok hitam di mukanya. Baginda bersabda: \"Bacakan rawatan Ruqyah untuknya, kerana dia terkena pandangan mata jahat.\""
  },
  {
    "id": 5518,
    "hadith_number": 5518,
    "tajuk_hadith": "Kesan Mata Hasad dan Larangan Mencucuk",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \"The effect of an evil eye is a fact.\" And he prohibited tattooing.",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ نَصْرٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْعَيْنُ حَقٌّ ‏\"‏‏.‏ وَنَهَى عَنِ الْوَشْمِ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Mata hasad itu adalah suatu hakikat.\"  Baginda juga melarang perbuatan mencucuk (meletakkan tatu)."
  },
  {
    "id": 5519,
    "hadith_number": 5519,
    "tajuk_hadith": "Keperluan Ruqyah untuk Sengatan Berbisa",
    "perawi_melayu": "Riwayat Al-Aswad:",
    "english_text": "I asked `Aisha about treating poisonous stings (a snake-bite or a scorpion sting) with a Ruqya. She \nsaid, \"The Prophet (ﷺ) allowed the treatment of poisonous sting with Ruqya.\"",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا سُلَيْمَانُ الشَّيْبَانِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الأَسْوَدِ، عَنْ أَبِيهِ، قَالَ سَأَلْتُ عَائِشَةَ عَنِ الرُّقْيَةِ، مِنَ الْحُمَةِ فَقَالَتْ رَخَّصَ النَّبِيُّ صلى الله عليه وسلم الرُّقْيَةَ مِنْ كُلِّ ذِي حُمَةٍ‏.‏",
    "malay_translation": "Aku bertanya kepada Aisyah tentang rawatan sengatan berbisa (gigitan ular atau sengatan kala jengking) dengan Ruqyah.  Beliau berkata, \"Rasulullah SAW membenarkan rawatan sengatan berbisa dengan Ruqyah.\""
  },
  {
    "id": 5520,
    "hadith_number": 5520,
    "tajuk_hadith": "Rawatan Ruqyah daripada Anas bin Malik",
    "perawi_melayu": "Riwayat Abdul Aziz:",
    "english_text": "Thabit and I went to Anas bin Malik. Thabit said, \"O Abu Hamza! I am sick.\" On that Anas said, \n\"Shall I treat you with the Ruqya of Allah's Messenger (ﷺ)?\" Thabit said, \"Yes,\" Anas recited, \"O Allah! The \nLord of the people, the Remover of trouble! (Please) cure (Heal) (this patient), for You are the Healer. \nNone brings about healing but You; a healing that will leave behind no ailment.\"",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ، قَالَ دَخَلْتُ أَنَا وَثَابِتٌ، عَلَى أَنَسِ بْنِ مَالِكٍ فَقَالَ ثَابِتٌ يَا أَبَا حَمْزَةَ اشْتَكَيْتُ‏.‏ فَقَالَ أَنَسٌ أَلاَ أَرْقِيكَ بِرُقْيَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ بَلَى‏.‏ قَالَ ‏\n\"‏ اللَّهُمَّ رَبَّ النَّاسِ مُذْهِبَ الْبَاسِ اشْفِ أَنْتَ الشَّافِي لاَ شَافِيَ إِلاَّ أَنْتَ، شِفَاءً لاَ يُغَادِرُ سَقَمًا ‏\"‏‏.‏",
    "malay_translation": "Aku dan Thabit telah mengunjungi Anas bin Malik. Thabit berkata, \"Wahai Abu Hamza! Saya sakit.\"  Lalu Anas berkata, \"Bagaimana jika saya merawatmu dengan ruqyah daripada Rasulullah ﷺ?\" Thabit menjawab, \"Ya.\" Anas kemudian membaca, \"Ya Allah, Tuhan sekalian manusia, yang menghilangkan penyakit, sembuhkanlah (pesakit ini), kerana Engkaulah Yang Maha Menyembuhkan. Tiada yang menyembuhkan melainkan Engkau; kesembuhan yang tidak meninggalkan sebarang penyakit.\""
  },
  {
    "id": 5521,
    "hadith_number": 5521,
    "tajuk_hadith": "Doa Nabi SAW untuk Kesembuhan",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "The Prophet (ﷺ) used to treat some of his wives by passing his right hand over the place of ailment and \nused to say, \"O Allah, the Lord of the people! Remove the trouble and heal the patient, for You are the \nHealer. No healing is of any avail but Yours; healing that will leave behind no ailment.\"",
    "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى، حَدَّثَنَا سُفْيَانُ، حَدَّثَنِي سُلَيْمَانُ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُعَوِّذُ بَعْضَ أَهْلِهِ، يَمْسَحُ بِيَدِهِ الْيُمْنَى وَيَقُولُ ‏\n\"‏ اللَّهُمَّ رَبَّ النَّاسِ أَذْهِبِ الْبَاسَ، اشْفِهِ وَأَنْتَ الشَّافِي، لاَ شِفَاءَ إِلاَّ شِفَاؤُكَ، شِفَاءً لاَ يُغَادِرُ سَقَمًا ‏\"‏‏.‏ قَالَ سُفْيَانُ حَدَّثْتُ بِهِ مَنْصُورًا فَحَدَّثَنِي عَنْ إِبْرَاهِيمَ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ نَحْوَهُ‏.‏",
    "malay_translation": "Daripada Aisyah r.a., bahawa Nabi SAW biasa merawat sebahagian daripada isteri-isterinya dengan melepasi tangan kanannya di bahagian yang sakit dan baginda berdoa, \"Ya Allah, Tuhan sekalian manusia, hilangkanlah penyakit ini, sembuhkanlah dia, kerana Engkaulah Yang Maha Menyembuhkan. Tiada kesembuhan melainkan kesembuhan daripadaMu, kesembuhan yang tidak meninggalkan sebarang penyakit.\""
  },
  {
    "id": 5522,
    "hadith_number": 5522,
    "tajuk_hadith": "Rawatan Ruqyah Rasulullah SAW",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "Allah's Messenger (ﷺ) used to treat with a Ruqya saying, \"O the Lord of the people! Remove the trouble The \ncure is in Your Hands, and there is none except You who can remove it (the disease) . \"",
    "arabic_text": "حَدَّثَنِي أَحْمَدُ بْنُ أَبِي رَجَاءٍ، حَدَّثَنَا النَّضْرُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَرْقِي يَقُولُ ‏\n\"‏ امْسَحِ الْبَاسَ رَبَّ النَّاسِ، بِيَدِكَ الشِّفَاءُ، لاَ كَاشِفَ لَهُ إِلاَّ أَنْتَ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Ahmad bin Abi Raja', telah menceritakan kepada kami Nadhr, dari Hisyam bin Urwah, dia berkata: telah memberitakan kepadaku ayahku, dari Aisyah, bahawa Rasulullah SAW biasa melakukan rawatan ruqyah dengan membaca, \"Hilangkanlah penyakit ini, wahai Tuhan sekalian manusia, di tangan-Mu lah kesembuhan, tiada yang dapat menghilangkannya melainkan Engkau.\""
  },
  {
    "id": 5523,
    "hadith_number": 5523,
    "tajuk_hadith": "Doa Nabi SAW untuk Orang Sakit",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "The Prophet (ﷺ) used to say to the patient, \"In the Name of Allah The earth of our land and the saliva of \nsome of us cure our patient.\"",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي عَبْدُ رَبِّهِ بْنُ سَعِيدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقُولُ لِلْمَرِيضِ ‏\n\"‏ بِسْمِ اللَّهِ، تُرْبَةُ أَرْضِنَا‏.‏ بِرِيقَةِ بَعْضِنَا، يُشْفَى سَقِيمُنَا بِإِذْنِ رَبِّنَا ‏\"‏‏.‏",
    "malay_translation": "Daripada Aisyah r.a., bahawa Nabi SAW bersabda kepada orang yang sakit:  \"Bismillah, tanah bumi kita, dan air liur sebahagian daripada kita, semoga menyembuhkan orang sakit kita dengan izin Tuhan kita.\" "
  },
  {
    "id": 5524,
    "hadith_number": 5524,
    "tajuk_hadith": "Doa Nabi SAW untuk Ruqyah",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "Allah's Messenger (ﷺ) used to read in his Ruqya, \"In the Name of Allah\" The earth of our land and the saliva \nof some of us cure our patient with the permission of our Lord.\" with a slight shower of saliva) while \ntreating with a Ruqya.",
    "arabic_text": "حَدَّثَنِي صَدَقَةُ بْنُ الْفَضْلِ، أَخْبَرَنَا ابْنُ عُيَيْنَةَ، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ فِي الرُّقْيَةِ ‏\n\"‏ تُرْبَةُ أَرْضِنَا، وَرِيقَةُ بَعْضِنَا، يُشْفَى سَقِيمُنَا، بِإِذْنِ رَبِّنَا ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Sadakah bin Fadhl, telah memberitakan kepada kami Ibnu Uyainah, daripada Abd Rabbih bin Said, daripada Amrah, daripada Aisyah, katanya: Rasulullah SAW berdoa ketika melakukan ruqyah,  \"Dengan nama Allah, tanah di bumi kita, dan air liur sebahagian daripada kita, menyembuhkan orang sakit kita, dengan izin Tuhan kita.\""
  },
  {
    "id": 5525,
    "hadith_number": 5525,
    "tajuk_hadith": "Mimpi Baik dan Mimpi Buruk",
    "perawi_melayu": "Riwayat Abu Qatadah:",
    "english_text": "I heard the Prophet (ﷺ) saying, \"A good dream is from Allah, and a bad dream is from Satan. So if anyone of you sees (in a dream) something he dislikes, when he gets up he should blow thrice (on his left side) and seek refuge with Allah from its evil for then it will not harm him.\"",
    "arabic_text": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ سَمِعْتُ أَبَا سَلَمَةَ، قَالَ سَمِعْتُ أَبَا قَتَادَةَ، يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الرُّؤْيَا مِنَ اللَّهِ، وَالْحُلْمُ مِنَ الشَّيْطَانِ، فَإِذَا رَأَى أَحَدُكُمْ شَيْئًا يَكْرَهُهُ فَلْيَنْفِثْ حِينَ يَسْتَيْقِظُ ثَلاَثَ مَرَّاتٍ وَيَتَعَوَّذْ مِنْ شَرِّهَا، فَإِنَّهَا لاَ تَضُرُّهُ ‏\"‏‏.‏ وَقَالَ أَبُو سَلَمَةَ وَإِنْ كُنْتُ لأَرَى الرُّؤْيَا أَثْقَلَ عَلَىَّ مِنَ الْجَبَلِ، فَمَا هُوَ إِلاَّ أَنْ سَمِعْتُ هَذَا الْحَدِيثَ فَمَا أُبَالِيهَا‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda, \"Mimpi baik adalah dari Allah, dan mimpi buruk adalah dari syaitan.  Oleh itu, jika seseorang di antara kamu melihat sesuatu yang dibencinya (dalam mimpi), maka apabila dia bangun, hendaklah dia berhembus tiga kali (ke sebelah kirinya) dan memohon perlindungan kepada Allah daripada kejahatannya, kerana ia tidak akan memudaratkannya.\""
  },
  {
    "id": 5526,
    "hadith_number": 5526,
    "tajuk_hadith": "Amalan Rasulullah SAW Sebelum Tidur",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "Whenever Allah's Messenger (ﷺ) went to bed, he used to recite Surat-al-Ikhlas, Surat-al-Falaq and Surat-an-Nas and then blow on his palms and pass them over his face and those parts of his body that his hands could reach. And when he fell ill, he used to order me to do like that for him.",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ الأُوَيْسِيُّ، حَدَّثَنَا سُلَيْمَانُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَوَى إِلَى فِرَاشِهِ نَفَثَ فِي كَفَّيْهِ بِقُلْ هُوَ اللَّهُ أَحَدٌ وَبِالْمُعَوِّذَتَيْنِ جَمِيعًا، ثُمَّ يَمْسَحُ بِهِمَا وَجْهَهُ، وَمَا بَلَغَتْ يَدَاهُ مِنْ جَسَدِهِ‏.‏ قَالَتْ عَائِشَةُ فَلَمَّا اشْتَكَى كَانَ يَأْمُرُنِي أَنْ أَفْعَلَ ذَلِكَ بِهِ‏.‏ قَالَ يُونُسُ كُنْتُ أَرَى ابْنَ شِهَابٍ يَصْنَعُ ذَلِكَ إِذَا أَتَى إِلَى فِرَاشِهِ‏.‏",
    "malay_translation": "Rasulullah SAW apabila hendak tidur, baginda akan membaca Surah Al-Ikhlas, Surah Al-Falaq dan Surah An-Nas, kemudian meniup kedua tapak tangan baginda dan mengusapnya ke muka dan anggota badan yang dapat dicapai oleh tangan baginda.  Apabila baginda sakit, baginda akan menyuruhku melakukan perkara yang sama untuk baginda."
  },
  {
    "id": 5527,
    "hadith_number": 5527,
    "tajuk_hadith": "Rawatan Ruqyah dan Keutamaan Surat al-Fatihah",
    "perawi_melayu": "Riwayat Abu Sa`id:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ أَبِي الْمُتَوَكِّلِ، عَنْ أَبِي سَعِيدٍ، أَنَّ رَهْطًا، مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم انْطَلَقُوا فِي سَفْرَةٍ سَافَرُوهَا، حَتَّى نَزَلُوا بِحَىٍّ مِنْ أَحْيَاءِ الْعَرَبِ فَاسْتَضَافُوهُمْ، فَأَبَوْا أَنْ يُضَيِّفُوهُمْ، فَلُدِغَ سَيِّدُ ذَلِكَ الْحَىِّ، فَسَعَوْا لَهُ بِكُلِّ شَىْءٍ لاَ يَنْفَعُهُ شَىْءٌ، فَقَالَ بَعْضُهُمْ لَوْ أَتَيْتُمْ هَؤُلاَءِ الرَّهْطَ الَّذِينَ قَدْ نَزَلُوا بِكُمْ، لَعَلَّهُ أَنْ يَكُونَ عِنْدَ بَعْضِهِمْ شَىْءٌ‏.‏ فَأَتَوْهُمْ فَقَالُوا يَا أَيُّهَا الرَّهْطُ إِنَّ سَيِّدَنَا لُدِغَ، فَسَعَيْنَا لَهُ بِكُلِّ شَىْءٍ، لاَ يَنْفَعُهُ شَىْءٌ، فَهَلْ عِنْدَ أَحَدٍ مِنْكُمْ شَىْءٌ فَقَالَ بَعْضُهُمْ نَعَمْ، وَاللَّهِ إِنِّي لَرَاقٍ، وَلَكِنْ وَاللَّهِ لَقَدِ اسْتَضَفْنَاكُمْ فَلَمْ تُضَيِّفُونَا، فَمَا أَنَا بِرَاقٍ لَكُمْ حَتَّى تَجْعَلُوا لَنَا جُعْلاً‏.‏ فَصَالَحُوهُمْ عَلَى قَطِيعٍ مِنَ الْغَنَمِ، فَانْطَلَقَ فَجَعَلَ يَتْفُلُ وَيَقْرَأُ ‏{‏الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ‏}‏ حَتَّى لَكَأَنَّمَا نُشِطَ مِنْ عِقَالٍ، فَانْطَلَقَ يَمْشِي مَا بِهِ قَلَبَةٌ‏.‏ قَالَ فَأَوْفَوْهُمْ جُعْلَهُمُ الَّذِي صَالَحُوهُمْ عَلَيْهِ، فَقَالَ بَعْضُهُمُ اقْسِمُوا‏.‏ فَقَالَ الَّذِي رَقَى لاَ تَفْعَلُوا حَتَّى نَأْتِيَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَنَذْكُرَ لَهُ الَّذِي كَانَ، فَنَنْظُرَ مَا يَأْمُرُنَا‏.‏ فَقَدِمُوا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرُوا لَهُ فَقَالَ ‏\"‏ وَمَا يُدْرِيكَ أَنَّهَا رُقْيَةٌ أَصَبْتُمُ اقْسِمُوا وَاضْرِبُوا لِي مَعَكُمْ بِسَهْمٍ ‏\"‏‏.‏",
    "malay_translation": "Sekawanan sahabat Rasulullah SAW dalam perjalanan mereka, singgah di sebuah kawasan suku Arab. Mereka meminta tumpangan, tetapi ditolak. Kemudian, ketua suku itu digigit ular (atau dipatuk kala jengking) dan telah dirawat pelbagai cara, namun tidak berkesan. Ada yang mencadangkan, \"Bagaimana jika kita pergi kepada kumpulan yang singgah di sini, mungkin ada di antara mereka yang mempunyai sesuatu yang bermanfaat?\" Mereka pun pergi dan berkata, \"Wahai kumpulan, ketua kami digigit ular (atau dipatuk kala jengking), kami telah merawatnya dengan pelbagai cara, tetapi tidak berhasil. Adakah di antara kamu ada yang mempunyai sesuatu yang bermanfaat?\" Seorang daripada mereka menjawab, \"Ya, demi Allah, aku tahu cara merawat dengan Ruqyah. Tetapi, demi Allah, kami telah meminta tumpangan daripada kamu, tetapi kamu menolak. Aku tidak akan merawat pesakit kamu dengan Ruqyah sehingga kamu memberikan kami upah.\"  Mereka pun bersetuju memberikan seekor kawanan kambing. Lelaki itu pergi bersama mereka dan mula meludah (pada tempat gigitan) serta membaca Surah al-Fatihah sehingga pesakit itu sembuh dan berjalan seperti tidak pernah sakit. Setelah suku itu memberikan upah yang telah dipersetujui, sebahagian daripada sahabat Nabi SAW berkata, \"Bahagikanlah (kambing itu).\" Tetapi, orang yang merawat dengan Ruqyah itu berkata, \"Jangan lakukan itu sehingga kami bertemu Rasulullah SAW dan menceritakan perkara ini kepadanya, dan kita lihat apa yang akan diperintahkan oleh baginda.\"  Maka mereka pergi kepada Rasulullah SAW dan menceritakan kisah itu kepada baginda. Baginda bertanya, \"Bagaimana kamu tahu bahawa Surah al-Fatihah adalah Ruqyah? Kamu telah melakukan perkara yang betul. Bahagikanlah (apa yang kamu perolehi) dan berikan bahagian untukku bersama kamu.\""
  },
  {
    "id": 5528,
    "hadith_number": 5528,
    "tajuk_hadith": "Doa Nabi SAW untuk Kesembuhan",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "The Prophet (ﷺ) used to treat some of his wives by passing his right hand over the place of ailment and \nused to say, \"O Lord of the people! Remove the difficulty and bring about healing as You are the \nHealer. There is no healing but Your Healing, a healing that will leave no ailment.\"",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، عَنِ الأَعْمَشِ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُعَوِّذُ بَعْضَهُمْ يَمْسَحُهُ بِيَمِينِهِ ‏\n\"‏ أَذْهِبِ الْبَاسَ رَبَّ النَّاسِ، وَاشْفِ أَنْتَ الشَّافِي، لاَ شِفَاءَ إِلاَّ شِفَاؤُكَ، شِفَاءً لاَ يُغَادِرُ سَقَمًا ‏\"‏‏.‏ فَذَكَرْتُهُ لِمَنْصُورٍ فَحَدَّثَنِي عَنْ إِبْرَاهِيمَ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ بِنَحْوِهِ‏.‏",
    "malay_translation": "Aisyah r.a. berkata, Rasulullah SAW  menyembuhkan sebahagian daripada isteri-isterinya dengan cara meletakkan tangan kanannya di tempat yang sakit dan berdoa, \"Wahai Tuhan sekalian manusia! Hilangkanlah kesakitan ini dan berilah kesembuhan, kerana Engkaulah Yang Maha Menyembuhkan. Tiada kesembuhan melainkan kesembuhan daripada-Mu, iaitu kesembuhan yang tidak meninggalkan sebarang penyakit.\" "
  },
  {
    "id": 5529,
    "hadith_number": 5529,
    "tajuk_hadith": "Nabi SAW Membaca Mu'awwidzat Ketika Sakit",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْجُعْفِيُّ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَنْفِثُ عَلَى نَفْسِهِ فِي مَرَضِهِ الَّذِي قُبِضَ فِيهِ بِالْمُعَوِّذَاتِ، فَلَمَّا ثَقُلَ كُنْتُ أَنَا أَنْفِثُ عَلَيْهِ بِهِنَّ، فَأَمْسَحُ بِيَدِ نَفْسِهِ لِبَرَكَتِهَا‏.‏ فَسَأَلْتُ ابْنَ شِهَابٍ كَيْفَ كَانَ يَنْفِثُ قَالَ يَنْفِثُ عَلَى يَدَيْهِ، ثُمَّ يَمْسَحُ بِهِمَا وَجْهَهُ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Abdullah bin Muhammad al-Ju'fi, telah menceritakan kepada kami Hisyam, telah memberitakan kepada kami Ma'mar, dari az- Zuhri, dari Urwah, dari Aisyah r.a., bahawa Nabi SAW ketika sakitnya yang menyebabkan baginda wafat, biasa membaca Mu'awwidzat (surah al-Falaq dan an-Nas) sambil meniup pada tangan baginda kemudian mengusapkannya ke tubuh baginda.  Apabila penyakit baginda semakin teruk, akulah yang membacakan Mu'awwidzat untuk baginda dan meniup (ke tangan baginda) lalu baginda mengusapkan ke tubuhnya sendiri untuk mendapat keberkatannya.  Kemudian aku bertanya kepada Ibnu Syihab: Bagaimanakah cara baginda meniup?  Jawabnya: Baginda meniup ke tapak tangannya, kemudian mengusapkannya ke wajahnya."
  },
  {
    "id": 5530,
    "hadith_number": 5530,
    "tajuk_hadith": "70,000 Umat yang Masuk Syurga Tanpa Hisab",
    "perawi_melayu": "Riwayat Ibnu Abbas",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حُصَيْنُ بْنُ نُمَيْرٍ، عَنْ حُصَيْنِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ خَرَجَ عَلَيْنَا النَّبِيُّ صلى الله عليه وسلم يَوْمًا فَقَالَ ‏\"‏ عُرِضَتْ عَلَىَّ الأُمَمُ فَجَعَلَ يَمُرُّ النَّبِيُّ مَعَهُ الرَّجُلُ وَالنَّبِيُّ مَعَهُ الرَّجُلاَنِ، وَالنَّبِيُّ مَعَهُ الرَّهْطُ، وَالنَّبِيُّ لَيْسَ مَعَهُ أَحَدٌ، وَرَأَيْتُ سَوَادًا كَثِيرًا سَدَّ الأُفُقَ فَرَجَوْتُ أَنْ يَكُونَ أُمَّتِي، فَقِيلَ هَذَا مُوسَى وَقَوْمُهُ‏.‏ ثُمَّ قِيلَ لِي انْظُرْ‏.‏ فَرَأَيْتُ سَوَادًا كَثِيرًا سَدَّ الأُفُقَ فَقِيلَ لِي انْظُرْ هَكَذَا وَهَكَذَا‏.‏ فَرَأَيْتُ سَوَادًا كَثِيرًا سَدَّ الأُفُقَ فَقِيلَ هَؤُلاَءِ أُمَّتُكَ، وَمَعَ هَؤُلاَءِ سَبْعُونَ أَلْفًا يَدْخُلُونَ الْجَنَّةَ بِغَيْرِ حِسَابٍ ‏\"‏‏.‏ فَتَفَرَّقَ النَّاسُ وَلَمْ يُبَيَّنْ لَهُمْ، فَتَذَاكَرَ أَصْحَابُ النَّبِيِّ صلى الله عليه وسلم فَقَالُوا أَمَّا نَحْنُ فَوُلِدْنَا فِي الشِّرْكِ، وَلَكِنَّا آمَنَّا بِاللَّهِ وَرَسُولِهِ، وَلَكِنْ هَؤُلاَءِ هُمْ أَبْنَاؤُنَا، فَبَلَغَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ هُمُ الَّذِينَ لاَ يَتَطَيَّرُونَ، وَلاَ يَسْتَرْقُونَ، وَلاَ يَكْتَوُونَ، وَعَلَى رَبِّهِمْ يَتَوَكَّلُونَ ‏\"‏‏.‏ فَقَامَ عُكَّاشَةُ بْنُ مِحْصَنٍ فَقَالَ أَمِنْهُمْ أَنَا يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ فَقَامَ آخَرُ فَقَالَ أَمِنْهُمْ أَنَا فَقَالَ ‏\"‏ سَبَقَكَ بِهَا عُكَّاشَةُ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Musaddad, telah menceritakan kepada kami Husain bin Numair, dari Husain bin Abdurrahman, dari Sa'id bin Jubair, dari Ibnu Abbas r.a, dia berkata: Nabi SAW suatu hari keluar menemui kami lalu bersabda, \"Telah ditunjukkan kepadaku pelbagai umat. Ada nabi yang hanya diikuti seorang lelaki, dan ada nabi yang diikuti dua orang lelaki, dan ada nabi yang diikuti sekumpulan orang, dan ada nabi yang tidak diikuti sesiapa pun. Aku melihat sekumpulan besar manusia yang memenuhi ufuk, maka aku berharap mereka adalah umatku. Maka dikatakan kepadaku, 'Ini adalah Musa dan kaumnya.' Kemudian dikatakan kepadaku, 'Lihatlah.' Maka aku melihat sekumpulan besar manusia yang memenuhi ufuk. Kemudian dikatakan kepadaku, 'Lihatlah ke sana dan ke sini.' Maka aku melihat sekumpulan besar manusia yang memenuhi ufuk. Kemudian dikatakan kepadaku, 'Mereka adalah umatmu, dan bersama mereka 70,000 orang yang akan masuk syurga tanpa hisab.' Kemudian orang ramai bersurai dan baginda tidak menjelaskan siapakah 70,000 orang tersebut. Maka sahabat-sahabat Nabi SAW mula berbincang tentang hal tersebut, lalu mereka berkata, \"Adapun kami, kami dilahirkan dalam zaman syirik, tetapi kami telah beriman kepada Allah dan Rasul-Nya. Akan tetapi, 70,000 orang itu ialah keturunan kami.\" Perkara tersebut sampai kepada Nabi SAW, lalu baginda bersabda, \"Mereka ialah orang-orang yang tidak berburuk sangka (dengan melihat burung), dan tidak melakukan rawatan dengan cara menoreh tubuh, dan tidak berubat dengan rajah, tetapi mereka bertawakal hanya kepada Tuhan mereka.\" Maka bangunlah Ukkasyah bin Mihshan lalu berkata, \"Wahai Rasulullah, adakah saya termasuk dalam kalangan mereka?\" Baginda bersabda, \"Ya.\" Kemudian bangunlah seorang lagi lalu berkata, \"Wahai Rasulullah, adakah saya termasuk dalam kalangan mereka?\" Baginda bersabda, \"Ukkasyah telah mendahului engkau.\" "
  },
  {
    "id": 5531,
    "hadith_number": 5531,
    "tajuk_hadith": "Tiada Penularan Penyakit dan Petanda Buruk",
    "perawi_melayu": "Daripada Abdullah bin Umar:",
    "english_text": "Allah's Messenger (ﷺ) said, \"There is neither 'Adwa (no contagious disease is conveyed to others without \nAllah's permission) nor Tiyara, but an evil omen may be in three a woman, a house or an animal.\"",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ عَدْوَى وَلاَ طِيَرَةَ، وَالشُّؤْمُ فِي ثَلاَثٍ فِي الْمَرْأَةِ، وَالدَّارِ، وَالدَّابَّةِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Tidak ada penularan penyakit dan tiada petanda buruk, tetapi perkara yang membawa petanda buruk itu ada tiga: wanita, rumah, dan binatang.\""
  },
  {
    "id": 5532,
    "hadith_number": 5532,
    "tajuk_hadith": "Tiada Petanda Buruk, Petanda Baik Adalah Kata-Kata Baik",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "I heard Allah's Messenger (ﷺ) saying, \"There is no Tiyara, and the best omen is the Fal.\" They asked, \"What is the Fal?\" He said, \"A good word that one of you hears (and takes as a good omen).",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ طِيَرَةَ، وَخَيْرُهَا الْفَأْلُ ‏\"‏‏.‏ قَالُوا وَمَا الْفَأْلُ قَالَ ‏\"‏ الْكَلِمَةُ الصَّالِحَةُ يَسْمَعُهَا أَحَدُكُمْ ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda: \"Tiada tiyara (petanda buruk), dan yang terbaik adalah fal (petanda baik).\" Mereka bertanya: \"Apakah fal itu?\" Baginda menjawab: \"Perkataan yang baik yang didengar oleh seorang di antara kamu.\""
  },
  {
    "id": 5533,
    "hadith_number": 5533,
    "tajuk_hadith": "Tiada Tiyara, Kebaikan dalam Petanda Baik",
    "perawi_melayu": "Riwayat Abu Hurairah",
    "english_text": "The Prophet (ﷺ) said, \"There is no Tiyara and the best omen is the Fal,\" Somebody said, \"What is the Fal, \nO Allah's Messenger (ﷺ)?\" He said, \"A good word that one of you hears (and takes as a good omen).",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، أَخْبَرَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ طِيَرَةَ، وَخَيْرُهَا الْفَأْلُ ‏\"‏‏.‏ قَالَ وَمَا الْفَأْلُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الْكَلِمَةُ الصَّالِحَةُ يَسْمَعُهَا أَحَدُكُمْ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Tiada tiyara, dan yang terbaik adalah fal.\"  Seseorang bertanya, \"Apakah fal itu, wahai Rasulullah SAW?\"  Baginda menjawab, \"Perkataan yang baik yang didengar oleh seseorang di antara kamu (dan diambil sebagai petanda baik).\""
  },
  {
    "id": 5534,
    "hadith_number": 5534,
    "tajuk_hadith": "Tiada Penularan Penyakit dan Ramalan Tanpa Izin Allah",
    "perawi_melayu": "Anas r.a.",
    "english_text": "The Prophet (ﷺ) said, \"No 'Adwa (no contagious disease is conveyed to others without Allah's permission), \nnor Tiyara, but I like the good Fal, i.e., the good word.\"",
    "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ عَدْوَى وَلاَ طِيَرَةَ، وَيُعْجِبُنِي الْفَأْلُ الصَّالِحُ، الْكَلِمَةُ الْحَسَنَةُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Tiada penyakit berjangkit dan tiada ramalan (yang membawa nasib malang) melainkan dengan izin Allah.  Namun, aku menyukai firasat yang baik, iaitu kata-kata yang baik.\""
  },
  {
    "id": 5535,
    "hadith_number": 5535,
    "tajuk_hadith": "Tiada Penyakit Berjangkit, Ramalan, Sihir, atau Kejahatan",
    "perawi_melayu": "Dari Abu Hurairah",
    "english_text": "The Prophet (ﷺ) said, \"There is no 'Adwa, nor Tiyara, nor Hama, nor Safar.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْحَكَمِ، حَدَّثَنَا النَّضْرُ، أَخْبَرَنَا إِسْرَائِيلُ، أَخْبَرَنَا أَبُو حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ عَدْوَى، وَلاَ طِيَرَةَ، وَلاَ هَامَةَ، وَلاَ صَفَرَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Tiada penyakit berjangkit (adwa), tiada ramalan (ṭiyara), tiada sihir (hama), dan tiada kejahatan (ṣafar).\""
  },
  {
    "id": 5536,
    "hadith_number": 5536,
    "tajuk_hadith": "Hukum Diat Janin yang Gugur Akibat Pergaduhan",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى فِي امْرَأَتَيْنِ مِنْ هُذَيْلٍ اقْتَتَلَتَا، فَرَمَتْ إِحْدَاهُمَا الأُخْرَى بِحَجَرٍ، فَأَصَابَ بَطْنَهَا وَهْىَ حَامِلٌ، فَقَتَلَتْ وَلَدَهَا الَّذِي فِي بَطْنِهَا فَاخْتَصَمُوا إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَضَى أَنَّ دِيَةَ مَا فِي بَطْنِهَا غُرَّةٌ عَبْدٌ أَوْ أَمَةٌ، فَقَالَ وَلِيُّ الْمَرْأَةِ الَّتِي غَرِمَتْ كَيْفَ أَغْرَمُ يَا رَسُولَ اللَّهِ مَنْ لاَ شَرِبَ، وَلاَ أَكَلَ، وَلاَ نَطَقَ، وَلاَ اسْتَهَلَّ، فَمِثْلُ ذَلِكَ يُطَلّ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِنَّمَا هَذَا مِنْ إِخْوَانِ الْكُهَّانِ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Sa'id bin Ufair, telah menceritakan kepada kami Laits, katanya; telah menceritakan kepada kami Abdurrahman bin Khalid, dari Ibnu Syihab, dari Abu Salamah, dari Abu Hurairah, bahawa Rasulullah SAW telah memberi keputusan di antara dua orang perempuan dari kabilah Hudhail yang bergaduh. Salah seorang dari mereka telah melempar yang lain dengan batu, lalu terkena perutnya sedang dia hamil, lalu terbunuhlah anaknya yang di dalam perutnya. Maka mereka berbalah kepada Nabi SAW, lalu Nabi SAW memutuskan bahawa diat bagi apa yang di dalam perutnya ialah seorang hamba sahaya lelaki atau perempuan. Maka wali perempuan yang di kenakan denda berkata: \"Wahai Rasulullah, bagaimanakah aku dikenakan denda, sedangkan dia (janin) tidak minum, tidak makan, tidak berkata-kata dan tidak menangis? Perkara seumpama ini sepatutnya diabaikan.\" Maka Nabi SAW bersabda: \"Sesungguhnya ini adalah daripada golongan ahli nujum.\""
  },
  {
    "id": 5537,
    "hadith_number": 5537,
    "tajuk_hadith": "Hukum Keguguran Janin Akibat Pergaduhan",
    "perawi_melayu": "Riwayat Abu Hurairah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ امْرَأَتَيْنِ، رَمَتْ إِحْدَاهُمَا الأُخْرَى بِحَجَرٍ فَطَرَحَتْ جَنِينَهَا، فَقَضَى فِيهِ النَّبِيُّ صلى الله عليه وسلم بِغُرَّةٍ عَبْدٍ أَوْ وَلِيدَةٍ‏.‏   وَعَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى فِي الْجَنِينِ يُقْتَلُ فِي بَطْنِ أُمِّهِ بِغُرَّةٍ عَبْدٍ أَوْ وَلِيدَةٍ‏.‏ فَقَالَ الَّذِي قُضِيَ عَلَيْهِ كَيْفَ أَغْرَمُ مَنْ لاَ أَكَلَ، وَلاَ شَرِبَ، وَلاَ نَطَقَ، وَلاَ اسْتَهَلَّ، وَمِثْلُ ذَلِكَ بَطَلْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّمَا هَذَا مِنْ إِخْوَانِ الْكُهَّانِ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah, dari Malik, dari Ibnu Syihab, dari Abu Salamah, dari Abu Hurairah r.a. bahawa dua orang perempuan, salah seorang dari mereka telah melempar yang lain dengan batu lalu gugurlah kandungannya. Maka Nabi SAW telah menetapkan di atasnya diat (tebusan) seorang hamba lelaki atau perempuan.\n\nDan dari Ibnu Syihab, dari Sa’id bin al-Musayyab, bahawa Rasulullah SAW telah menetapkan bagi janin yang dibunuh di dalam perut ibunya dengan diat seorang hamba lelaki atau perempuan.  Maka orang yang dijatuhkan hukuman itu berkata: “Bagaimanakah aku boleh didenda kerana membunuh seseorang yang tidak makan, tidak minum, tidak berkata-kata dan tidak menangis?  Sesuatu yang sebegini patutlah ditolak.”  Maka Rasulullah SAW bersabda:  “Sesungguhnya ini adalah daripada golongan ahli nujum.”"
  },
  {
    "id": 5538,
    "hadith_number": 5538,
    "tajuk_hadith": "Larangan Rasulullah SAW Mengenai Harga Anjing, Upah Pelacur, dan Ganjaran Ahli Nujum",
    "perawi_melayu": "Riwayat Abu Mas`ud:",
    "english_text": "The Prophet (ﷺ) forbade the utilization of the price of a dog, the earnings of prostitute and the earnings of \na foreteller.",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ، عَنْ أَبِي مَسْعُودٍ، قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ ثَمَنِ الْكَلْبِ، وَمَهْرِ الْبَغِيِّ، وَحُلْوَانِ الْكَاهِنِ‏.‏",
    "malay_translation": "Rasulullah SAW melarang penggunaan harga anjing, upah pelacur, dan ganjaran ahli nujum."
  },
  {
    "id": 5539,
    "hadith_number": 5539,
    "tajuk_hadith": "Perihal Tukang Ramal",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ يَحْيَى بْنِ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم نَاسٌ عَنِ الْكُهَّانِ‏.‏ فَقَالَ ‏\"‏ لَيْسَ بِشَىْءٍ ‏\"‏‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّهُمْ يُحَدِّثُونَا أَحْيَانًا بِشَىْءٍ فَيَكُونُ حَقًّا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تِلْكَ الْكَلِمَةُ مِنَ الْحَقِّ، يَخْطَفُهَا مِنَ الْجِنِّيِّ، فَيَقُرُّهَا فِي أُذُنِ وَلِيِّهِ، فَيَخْلِطُونَ مَعَهَا مِائَةَ كَذْبَةٍ ‏\"‏‏.‏ قَالَ عَلِيٌّ قَالَ عَبْدُ الرَّزَّاقِ مُرْسَلٌ، الْكَلِمَةُ مِنَ الْحَقِّ‏.‏ ثُمَّ بَلَغَنِي أَنَّهُ أَسْنَدَهُ بَعْدَهُ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ali bin Abdullah, telah menceritakan kepada kami Hisyam bin Yusuf, telah memberitakan kepada kami Ma'mar, dari Az- Zuhri, dari Yahya bin Urwah bin Az-Zubair, dari Urwah, dari Aisyah r.a., dia berkata, “Seorang kaum bertanya kepada Rasulullah SAW tentang tukang ramal. Maka Baginda SAW bersabda, \"Mereka itu bukan apa-apa.\" Mereka berkata, \"Wahai Rasulullah SAW, sesungguhnya kadang-kadang mereka menceritakan kepada kami sesuatu, lalu ternyata benar.\" Rasulullah SAW bersabda, \"Itu adalah satu kalimat kebenaran yang direbut oleh jin, kemudian dibisikkannya ke telinga sahabatnya, lalu mereka mencampurkannya dengan seratus kepalsuan.\""
  },
  {
    "id": 5540,
    "hadith_number": 5540,
    "tajuk_hadith": "Sihir ke atas Rasulullah SAW",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ سَحَرَ رَسُولَ اللَّهِ صلى الله عليه وسلم رَجُلٌ مِنْ بَنِي زُرَيْقٍ يُقَالُ لَهُ لَبِيدُ بْنُ الأَعْصَمِ، حَتَّى كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُخَيَّلُ إِلَيْهِ أَنَّهُ يَفْعَلُ الشَّىْءَ وَمَا فَعَلَهُ، حَتَّى إِذَا كَانَ ذَاتَ يَوْمٍ أَوْ ذَاتَ لَيْلَةٍ وَهْوَ عِنْدِي لَكِنَّهُ دَعَا وَدَعَا ثُمَّ قَالَ ‏\"‏ يَا عَائِشَةُ، أَشَعَرْتِ أَنَّ اللَّهَ أَفْتَانِي فِيمَا اسْتَفْتَيْتُهُ فِيهِ، أَتَانِي رَجُلاَنِ فَقَعَدَ أَحَدُهُمَا عِنْدَ رَأْسِي، وَالآخَرُ عِنْدَ رِجْلَىَّ، فَقَالَ أَحَدُهُمَا لِصَاحِبِهِ مَا وَجَعُ الرَّجُلِ فَقَالَ مَطْبُوبٌ‏.‏ قَالَ مَنْ طَبَّهُ قَالَ لَبِيدُ بْنُ الأَعْصَمِ‏.‏ قَالَ فِي أَىِّ شَىْءٍ قَالَ فِي مُشْطٍ وَمُشَاطَةٍ، وَجُفِّ طَلْعِ نَخْلَةٍ ذَكَرٍ‏.‏ قَالَ وَأَيْنَ هُوَ قَالَ فِي بِئْرِ ذَرْوَانَ ‏\"‏‏.‏ فَأَتَاهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي نَاسٍ مِنْ أَصْحَابِهِ فَجَاءَ فَقَالَ ‏\"‏ يَا عَائِشَةُ كَأَنَّ مَاءَهَا نُقَاعَةُ الْحِنَّاءِ، أَوْ كَأَنَّ رُءُوسَ نَخْلِهَا رُءُوسُ الشَّيَاطِينِ ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ أَفَلاَ أَسْتَخْرِجُهُ قَالَ ‏\"‏ قَدْ عَافَانِي اللَّهُ، فَكَرِهْتُ أَنْ أُثَوِّرَ عَلَى النَّاسِ فِيهِ شَرًّا ‏\"‏‏.‏ فَأَمَرَ بِهَا فَدُفِنَتْ‏.‏ تَابَعَهُ أَبُو أُسَامَةَ وَأَبُو ضَمْرَةَ وَابْنُ أَبِي الزِّنَادِ عَنْ هِشَامٍ‏.‏ وَقَالَ اللَّيْثُ وَابْنُ عُيَيْنَةَ عَنْ هِشَامٍ فِي مُشْطٍ وَمُشَاقَةٍ‏.‏ يُقَالُ الْمُشَاطَةُ مَا يَخْرُجُ مِنَ الشَّعَرِ إِذَا مُشِطَ، وَالْمُشَاقَةُ مِنْ مُشَاقَةِ الْكَتَّانِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ibrahim bin Musa, memberitakan kepada kami Isa bin Yunus, dari Hisyam, dari bapanya, dari Aisyah r.a., dia berkata: Rasulullah SAW telah disihir oleh seorang lelaki dari Bani Zuraiq yang bernama Labid bin Al-A'sam, sehingga Rasulullah SAW berasa seolah-olah dia melakukan sesuatu sedangkan dia sebenarnya tidak melakukannya.  Suatu hari atau suatu malam ketika baginda berada di sisi saya, baginda berdoa dan berdoa dengan lama, kemudian berkata, \"Wahai Aisyah, tahukah engkau bahawa Allah telah memberi penjelasan kepadaku tentang perkara yang aku tanyakan kepada-Nya? Dua orang lelaki datang kepadaku, seorang duduk di dekat kepalaku dan seorang lagi di dekat kakiku.  Salah seorang daripada mereka berkata kepada temannya, \"Apakah penyakit lelaki ini?\"  Yang lain menjawab, \"Dia terkena sihir.\" Yang pertama bertanya, \"Siapakah yang menyihirnya?\" Yang lain menjawab, \"Labid bin Al-A'sam.\"  Yang pertama bertanya, \"Dengan apa dia menyihirnya?\" Yang lain menjawab, \"Dengan sikat dan rambut yang melekat padanya, dan kulit pelepah kurma jantan.\" Yang pertama bertanya, \"Di manakah ia?\"  Yang lain menjawab, \"Di dalam perigi Dharwan.\" Maka Rasulullah SAW bersama beberapa orang sahabatnya pergi ke situ, lalu baginda kembali dan berkata, \"Wahai Aisyah, airnya seakan-akan air rendaman inai, dan pucuk-pucuk pokok kurma di sekitarnya seakan-akan kepala-kepala syaitan.\" Aku bertanya, \"Wahai Rasulullah, mengapa baginda tidak menunjukkannya (kepada orang ramai)?\"  Baginda menjawab, \"Kerana Allah telah menyembuhkan aku, maka aku tidak suka menyebarkan kejahatan di kalangan manusia.\" Kemudian baginda memerintahkan supaya perigi itu ditimbun."
  },
  {
    "id": 5541,
    "hadith_number": 5541,
    "tajuk_hadith": "Menjauhi Perkara-Perkara yang Membinasakan",
    "perawi_melayu": "Riwayat Abu Hurairah",
    "english_text": "Allah's Messenger (ﷺ) said, \"Avoid the Mubiqat, i.e., shirk and witchcraft.\"",
    "arabic_text": "حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي سُلَيْمَانُ، عَنْ ثَوْرِ بْنِ زَيْدٍ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ اجْتَنِبُوا الْمُوبِقَاتِ الشِّرْكُ بِاللَّهِ، وَالسِّحْرُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Jauhilah perkara-perkara yang membinasakan, iaitu syirik kepada Allah dan sihir.\""
  },
  {
    "id": 5542,
    "hadith_number": 5542,
    "tajuk_hadith": "Sihir yang Menimpa Rasulullah SAW",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ سَمِعْتُ ابْنَ عُيَيْنَةَ، يَقُولُ أَوَّلُ مَنْ حَدَّثَنَا بِهِ ابْنُ جُرَيْجٍ، يَقُولُ حَدَّثَنِي آلُ، عُرْوَةَ عَنْ عُرْوَةَ، فَسَأَلْتُ هِشَامًا عَنْهُ فَحَدَّثَنَا عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم سُحِرَ حَتَّى كَانَ يَرَى أَنَّهُ يَأْتِي النِّسَاءَ وَلاَ يَأْتِيهِنَّ‏.‏ قَالَ سُفْيَانُ وَهَذَا أَشَدُّ مَا يَكُونُ مِنَ السِّحْرِ إِذَا كَانَ كَذَا‏.‏ فَقَالَ ‏\"‏ يَا عَائِشَةُ أَعَلِمْتِ أَنَّ اللَّهَ قَدْ أَفْتَانِي فِيمَا اسْتَفْتَيْتُهُ فِيهِ، أَتَانِي رَجُلاَنِ فَقَعَدَ أَحَدُهُمَا عِنْدَ رَأْسِي، وَالآخَرُ عِنْدَ رِجْلَىَّ، فَقَالَ الَّذِي عِنْدَ رَأْسِي لِلآخَرِ مَا بَالُ الرَّجُلِ قَالَ مَطْبُوبٌ‏.‏ قَالَ وَمَنْ طَبَّهُ قَالَ لَبِيدُ بْنُ أَعْصَمَ، رَجُلٌ مِنْ بَنِي زُرَيْقٍ حَلِيفٌ لِيَهُودَ، كَانَ مُنَافِقًا‏.‏ قَالَ وَفِيمَ قَالَ فِي مُشْطٍ وَمُشَاقَةٍ‏.‏ قَالَ وَأَيْنَ قَالَ فِي جُفِّ طَلْعَةٍ ذَكَرٍ، تَحْتَ رَعُوفَةٍ، فِي بِئْرِ ذَرْوَانَ ‏\"‏‏.‏ قَالَتْ فَأَتَى النَّبِيُّ صلى الله عليه وسلم الْبِئْرَ حَتَّى اسْتَخْرَجَهُ فَقَالَ ‏\"‏ هَذِهِ الْبِئْرُ الَّتِي أُرِيتُهَا، وَكَأَنَّ مَاءَهَا نُقَاعَةُ الْحِنَّاءِ، وَكَأَنَّ نَخْلَهَا رُءُوسُ الشَّيَاطِينِ ‏\"‏‏.‏ قَالَ فَاسْتُخْرِجَ، قَالَتْ فَقُلْتُ أَفَلاَ أَىْ تَنَشَّرْتَ‏.‏ فَقَالَ ‏\"‏ أَمَا وَاللَّهِ فَقَدْ شَفَانِي، وَأَكْرَهُ أَنْ أُثِيرَ عَلَى أَحَدٍ مِنَ النَّاسِ شَرًّا ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Abdullah bin Muhammad, katanya: Aku mendengar Ibnu Uyainah berkata: Orang pertama yang menceritakannya kepadaku ialah Ibnu Juraij, katanya: Telah menceritakan kepadaku Al-Uruwah dari Urusyah, kemudian aku bertanya kepada Hisyam mengenai hal itu maka dia menceritakan kepada kami dari ayahnya, dari Aisyah r.a., katanya: Rasulullah SAW telah disihir sehingga baginda menyangka baginda telah menggauli isteri-isterinya, padahal baginda tidak melakukannya. Kata Sufyan: Inilah sihir yang paling hebat, jika keadaannya seperti itu.  Maka Baginda berkata, \"Wahai Aisyah, tahukah engkau bahawa Allah telah memberi petunjuk kepadaku tentang apa yang aku tanyakan kepada-Nya? Dua orang lelaki telah datang kepadaku, seorang duduk di kepalaku dan seorang lagi di kakiku.  Maka orang yang di kepalaku bertanya kepada yang seorang lagi: Apa keadaannya orang ini? Dia menjawab: Dia terkena sihir.  Dia bertanya: Siapa yang menyihirnya? Dia menjawab: Labid binul A'sam, seorang lelaki dari Bani Zuraiq yang bersekutu dengan orang Yahudi, dan dia adalah seorang munafik.  Dia bertanya: Dengan apa dia menyihirnya? Dia menjawab: Dengan sikat dan rambut yang melekat padanya.  Dia bertanya: Di manakah ia? Dia menjawab: Di dalam kulit pohon kurma jantan, di bawah batu di perigi Dharwan.\" Maka Nabi SAW pergi ke perigi itu sehingga mengeluarkannya.  Maka Baginda bersabda: \"Inilah perigi yang aku telah diperlihatkan (dalam mimpi). Airnya seakan-akan air rendaman inai, dan pokok kurma-kurmanya seakan-akan kepala syaitan.\"  Baginda bersabda: Kemudian benda itu dikeluarkan.  Aku (Aisyah) berkata: Mengapa Baginda tidak berubat dengan berbekam? Baginda bersabda: Demi Allah, aku telah disembuhkan, dan aku benci menimbulkan kemudaratan kepada sesiapa pun daripada manusia.\" "
  },
  {
    "id": 5543,
    "hadith_number": 5543,
    "tajuk_hadith": "Sihir ke atas Rasulullah SAW dan Kesembuhannya",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ سُحِرَ النَّبِيُّ صلى الله عليه وسلم حَتَّى إِنَّهُ لَيُخَيَّلُ إِلَيْهِ أَنَّهُ يَفْعَلُ الشَّىْءَ وَمَا فَعَلَهُ، حَتَّى إِذَا كَانَ ذَاتَ يَوْمٍ وَهْوَ عِنْدِي دَعَا اللَّهَ وَدَعَاهُ، ثُمَّ قَالَ ‏\"‏ أَشَعَرْتِ يَا عَائِشَةُ أَنَّ اللَّهَ قَدْ أَفْتَانِي فِيمَا اسْتَفْتَيْتُهُ فِيهِ ‏\"‏‏.‏ قُلْتُ وَمَا ذَاكَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ جَاءَنِي رَجُلاَنِ، فَجَلَسَ أَحَدُهُمَا عِنْدَ رَأْسِي وَالآخَرُ عِنْدَ رِجْلَىَّ، ثُمَّ قَالَ أَحَدُهُمَا لِصَاحِبِهِ مَا وَجَعُ الرَّجُلِ قَالَ مَطْبُوبٌ‏.‏ قَالَ وَمَنْ طَبَّهُ قَالَ لَبِيدُ بْنُ الأَعْصَمِ، الْيَهُودِيُّ مِنْ بَنِي زُرَيْقٍ‏.‏ قَالَ فِيمَا ذَا قَالَ فِي مُشْطٍ وَمُشَاطَةٍ، وَجُفِّ طَلْعَةٍ ذَكَرٍ‏.‏ قَالَ فَأَيْنَ هُوَ قَالَ فِي بِئْرِ ذِي أَرْوَانَ ‏\"‏‏.‏ قَالَ فَذَهَبَ النَّبِيُّ صلى الله عليه وسلم فِي أُنَاسٍ مِنْ أَصْحَابِهِ إِلَى الْبِئْرِ، فَنَظَرَ إِلَيْهَا وَعَلَيْهَا نَخْلٌ، ثُمَّ رَجَعَ إِلَى عَائِشَةَ فَقَالَ ‏\"‏ وَاللَّهِ لَكَأَنَّ مَاءَهَا نُقَاعَةُ الْحِنَّاءِ، وَلَكَأَنَّ نَخْلَهَا رُءُوسُ الشَّيَاطِينِ ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ أَفَأَخْرَجْتَهُ قَالَ ‏\"‏ لاَ، أَمَّا أَنَا فَقَدْ عَافَانِي اللَّهُ وَشَفَانِي، وَخَشِيتُ أَنْ أُثَوِّرَ عَلَى النَّاسِ مِنْهُ شَرًّا ‏\"‏‏.‏ وَأَمَرَ بِهَا فَدُفِنَتْ‏.‏",
    "malay_translation": "Rasulullah SAW telah disihir sehingga baginda menyangka baginda melakukan sesuatu sedangkan baginda tidak melakukannya.  Suatu hari, ketika baginda bersamaku, baginda berdoa kepada Allah SWT dengan lama, kemudian bersabda, \"Wahai Aisyah, adakah engkau tahu bahawa Allah SWT telah memberi petunjuk kepadaku tentang perkara yang aku tanyakan kepada-Nya?\" Aku bertanya, \"Apakah itu, wahai Rasulullah SAW?\" Baginda menjawab, \"Dua orang lelaki datang kepadaku, seorang duduk di kepalaku dan seorang lagi di kakiku. Kemudian seorang daripada mereka bertanya kepada temannya, 'Apakah penyakit lelaki ini?' Temannya menjawab, 'Dia terkena sihir.'  Yang pertama bertanya, 'Siapakah yang menyihirnya?' Yang lain menjawab, 'Labid bin Al-A'sam, seorang Yahudi dari Bani Zuraiq.'  Yang pertama bertanya, 'Dengan apakah dia disihir?' Yang lain menjawab, 'Dengan sikat dan rambut yang melekat padanya, dan kulit serbuk debunga kurma jantan.' Yang pertama bertanya, 'Di manakah ia?' Yang lain menjawab, 'Di dalam perigi Dzi Arwan.'  Maka Nabi SAW pergi bersama beberapa sahabatnya ke perigi itu, lalu melihatnya. Di situ terdapat pokok kurma. Kemudian baginda kembali kepadaku dan berkata, \"Demi Allah, airnya seakan-akan air rendaman inai, dan pokok kurmanya seakan-akan kepala syaitan.\" Aku bertanya, \"Wahai Rasulullah SAW, adakah baginda mengeluarkan bahan-bahan itu?\" Baginda menjawab, \"Tidak.  Adapun aku, Allah SWT telah menyembuhkanku, dan aku bimbang akan menimbulkan kemudaratan kepada manusia.\" Lalu baginda memerintahkan agar perigi itu ditimbus, dan ia pun ditimbus."
  },
  {
    "id": 5544,
    "hadith_number": 5544,
    "tajuk_hadith": "Kehebatan Bicara yang Fasih",
    "perawi_melayu": "Daripada Abdullah bin Umar:",
    "english_text": "Two men came from the East and addressed the people who wondered at their eloquent speeches On \nthat Allah's Messenger (ﷺ) said. Some eloquent speech is as effective as magic.'",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما أَنَّهُ قَدِمَ رَجُلاَنِ مِنَ الْمَشْرِقِ، فَخَطَبَا، فَعَجِبَ النَّاسُ لِبَيَانِهِمَا، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ مِنَ الْبَيَانِ لَسِحْرًا ـ أَوْ ـ إِنَّ بَعْضَ الْبَيَانِ لَسِحْرٌ ‏\"‏‏.‏",
    "malay_translation": "Telah datang dua orang lelaki dari timur dan menyampaikan khutbah.  Orang ramai kagum dengan kefasihan mereka.  Maka Rasulullah SAW bersabda:  \"Sesungguhnya sebahagian daripada kefasihan bicara itu adalah seperti sihir.\""
  },
  {
    "id": 5545,
    "hadith_number": 5545,
    "tajuk_hadith": "Keistimewaan Kurma Ajwa",
    "perawi_melayu": "Riwayat Saud:",
    "english_text": "The Prophet (ﷺ) said, \"If somebody takes some `Ajwa dates every morning, he will not be affected by \npoison or magic on that day till night.\" (Another narrator said seven dates).",
    "arabic_text": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا مَرْوَانُ، أَخْبَرَنَا هَاشِمٌ، أَخْبَرَنَا عَامِرُ بْنُ سَعْدٍ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَنِ اصْطَبَحَ كُلَّ يَوْمٍ تَمَرَاتٍ عَجْوَةً، لَمْ يَضُرُّهُ سَمٌّ وَلاَ سِحْرٌ ذَلِكَ الْيَوْمَ إِلَى اللَّيْلِ ‏\"‏‏.‏ وَقَالَ غَيْرُهُ ‏\"‏ سَبْعَ تَمَرَاتٍ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Barangsiapa memakan beberapa biji kurma Ajwa setiap pagi, maka dia tidak akan terjejas oleh racun atau sihir pada hari itu sehingga malam.\" (Seorang perawi lain menyebut tujuh biji kurma)."
  },
  {
    "id": 5546,
    "hadith_number": 5546,
    "tajuk_hadith": "Khasiat Kurma Ajwa",
    "perawi_melayu": "Riwayat Saud:",
    "english_text": "I heard Allah's Messenger (ﷺ) saying, \"If Somebody takes seven 'Ajwa dates in the morning, neither magic \nnor poison will hurt him that day.\"",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا أَبُو أُسَامَةَ، حَدَّثَنَا هَاشِمُ بْنُ هَاشِمٍ، قَالَ سَمِعْتُ عَامِرَ بْنَ سَعْدٍ، سَمِعْتُ سَعْدًا ـ رضى الله عنه ـ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ تَصَبَّحَ سَبْعَ تَمَرَاتٍ عَجْوَةً، لَمْ يَضُرُّهُ ذَلِكَ الْيَوْمَ سَمٌّ وَلاَ سِحْرٌ ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda: \"Barang siapa memakan tujuh biji kurma Ajwa pada waktu pagi, maka pada hari itu dia tidak akan ditimpa mudarat oleh racun mahupun sihir.\""
  },
  {
    "id": 5547,
    "hadith_number": 5547,
    "tajuk_hadith": "Tiada Penularan Penyakit Tanpa Izin Allah",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, 'No 'Adwa (i.e. no contagious disease is conveyed to\n     others without Allah's permission); nor (any evil omen in the month of)\n     Safar; nor Hama\" A bedouin said, \"O Allah's Messenger (ﷺ)! What about the \n     camels which, when on the sand (desert) look like deers, but when a \n     mangy camel mixes with them they all get infected with mange?\" On that\n     Allah s Apostle said, \"Then who conveyed the (mange) disease to the \n     first (mangy) camel?\"",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ عَدْوَى، وَلاَ صَفَرَ، وَلاَ هَامَةَ ‏\"‏‏.‏ فَقَالَ أَعْرَابِيٌّ يَا رَسُولَ اللَّهِ فَمَا بَالُ الإِبِلِ تَكُونُ فِي الرَّمْلِ كَأَنَّهَا الظِّبَاءُ، فَيُخَالِطُهَا الْبَعِيرُ الأَجْرَبُ فَيُجْرِبُهَا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَمَنْ أَعْدَى الأَوَّلَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Tiada penularan penyakit, tiada (kejahatan pada bulan) Safar, dan tiada hama.\"  Seorang Badwi berkata, \"Wahai Rasulullah SAW! Bagaimana pula dengan unta-unta yang di padang pasir kelihatan seperti kijang, tetapi apabila seekor unta yang berpenyakit kurap bercampur dengannya, kesemuanya dijangkiti kurap?\"  Maka Rasulullah SAW bersabda, \"Maka siapakah yang menjangkiti unta pertama itu?\"."
  },
  {
    "id": 5548,
    "hadith_number": 5548,
    "tajuk_hadith": "Pemisahan Haiwan Sakit dan Sihat",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "Allah's Messenger (ﷺ) said: The cattle (sheep, cows, camels, etc.) suffering\n     from a disease should not be mixed up with healthy cattle, (or said: \n     \"Do not put a patient with a healthy person ). \" (as a precaution).",
    "arabic_text": "وَعَنْ أَبِي سَلَمَةَ، سَمِعَ أَبَا هُرَيْرَةَ، بَعْدُ يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ يُورِدَنَّ مُمْرِضٌ عَلَى مُصِحٍّ ‏\"‏‏.‏ وَأَنْكَرَ أَبُو هُرَيْرَةَ حَدِيثَ الأَوَّلِ قُلْنَا أَلَمْ تُحَدِّثْ أَنَّهُ لاَ عَدْوَى فَرَطَنَ بِالْحَبَشِيَّةِ‏.‏ قَالَ أَبُو سَلَمَةَ فَمَا رَأَيْتُهُ نَسِيَ حَدِيثًا غَيْرَهُ‏.‏",
    "malay_translation": "Daripada Abu Salamah, bahawa dia mendengar Abu Hurairah berkata, bahawa Nabi SAW bersabda:  \"Janganlah ditempatkan haiwan yang sakit bersama haiwan yang sihat.\"  Abu Hurairah menafikan hadis sebelumnya. Kami bertanya, \"Bukankah engkau telah meriwayatkan bahawa tiada penularan penyakit?\"  Dia teragak-agak (kerana) wanita Habsyi. Abu Salamah berkata, \"Aku tidak pernah melihatnya melupakan hadis selain hadis ini.\""
  },
  {
    "id": 5549,
    "hadith_number": 5549,
    "tajuk_hadith": "Tiada Penyakit Berjangkit dan Ramalan Buruk",
    "perawi_melayu": "Riwayat Abdullah bin Umar:",
    "english_text": "Allah's Messenger (ﷺ) said, \"there is neither 'Adwa nor Tiyara, and an evil omen is only in three: a horse, a \nwoman and a house.\"",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، وَحَمْزَةُ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ عَدْوَى، وَلاَ طِيَرَةَ، إِنَّمَا الشُّؤْمُ فِي ثَلاَثٍ فِي الْفَرَسِ، وَالْمَرْأَةِ، وَالدَّارِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Tiada penyakit berjangkit (Adwa) dan tiada petanda buruk (Tiyara).  Petanda buruk hanya terdapat pada tiga perkara: kuda, wanita, dan rumah.\""
  },
  {
    "id": 5550,
    "hadith_number": 5550,
    "tajuk_hadith": "Tiada Penularan Penyakit",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ عَدْوَى ‏\"‏‏.‏   قَالَ أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ سَمِعْتُ أَبَا هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تُورِدُوا الْمُمْرِضَ عَلَى الْمُصِحِّ ‏\"‏‏.‏   وَعَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سِنَانُ بْنُ أَبِي سِنَانٍ الدُّؤَلِيُّ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ عَدْوَى ‏\"‏‏.‏ فَقَامَ أَعْرَابِيٌّ فَقَالَ أَرَأَيْتَ الإِبِلَ تَكُونُ فِي الرِّمَالِ أَمْثَالَ الظِّبَاءِ فَيَأْتِيهِ الْبَعِيرُ الأَجْرَبُ فَتَجْرَبُ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَمَنْ أَعْدَى الأَوَّلَ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Yaman, memberitakan kepada kami Syu’aib, daripada az- Zuhri, katanya: Telah menceritakan kepadaku Abu Salamah bin Abdur Rahman bahawa Abu Hurairah berkata bahawa Rasulullah SAW bersabda:  \"Tiada penularan penyakit.\" Abu Salamah bin Abdur Rahman berkata: Aku mendengar Abu Hurairah daripada Nabi SAW bersabda:  \"Janganlah kamu mencampurkan haiwan yang sakit dengan yang sihat.\" Dan daripada az-Zuhri, katanya: Telah memberitakan kepadaku Sinan bin Abi Sinan ad-Du’ali, bahawa Abu Hurairah r.a berkata bahawa Rasulullah SAW bersabda: \"Tiada penularan penyakit.\" Maka berdirilah seorang Badwi lalu berkata: “Adakah engkau melihat unta-unta yang berada di kawasan pasir seperti rusa, lalu datanglah unta yang berpenyakit kudis, maka ia menjangkiti unta-unta yang lain?” Rasulullah SAW bersabda: “Maka siapakah yang menjangkiti unta yang pertama?”"
  },
  {
    "id": 5551,
    "hadith_number": 5551,
    "tajuk_hadith": "Tiada Penyakit Berjangkit atau Ramalan Buruk, Melainkan Firasat Baik",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "The Prophet (ﷺ) said, \"No 'Adwa nor Tiyara; but I like Fal.\" They said, \"What is the Fal?\" He said, \"A good word.\"",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ عَدْوَى، وَلاَ طِيَرَةَ، وَيُعْجِبُنِي الْفَأْلُ ‏\"‏‏.‏ قَالُوا وَمَا الْفَأْلُ قَالَ ‏\"‏ كَلِمَةٌ طَيِّبَةٌ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Tiada penyakit berjangkit (Adwa), dan tiada ramalan buruk (Tiyara); tetapi aku menyukai firasat baik (Fal).\" Mereka bertanya: \"Apakah firasat baik itu?\" Baginda menjawab:  \"Satu perkataan yang baik.\""
  },
  {
    "id": 5552,
    "hadith_number": 5552,
    "tajuk_hadith": "Ujian Racun di Khaibar",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ لَمَّا فُتِحَتْ خَيْبَرُ أُهْدِيَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم شَاةٌ فِيهَا سَمٌّ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اجْمَعُوا لِي مَنْ كَانَ هَا هُنَا مِنَ الْيَهُودِ ‏\"‏‏.‏ فَجُمِعُوا لَهُ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنِّي سَائِلُكُمْ عَنْ شَىْءٍ فَهَلْ أَنْتُمْ صَادِقِيَّ عَنْهُ ‏\"‏‏.‏ فَقَالُوا نَعَمْ يَا أَبَا الْقَاسِمِ‏.‏ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَبُوكُمْ ‏\"‏‏.‏ قَالُوا أَبُونَا فُلاَنٌ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَذَبْتُمْ بَلْ أَبُوكُمْ فُلاَنٌ ‏\"‏‏.‏ فَقَالُوا صَدَقْتَ وَبَرِرْتَ‏.‏ فَقَالَ ‏\"‏ هَلْ أَنْتُمْ صَادِقِيَّ عَنْ شَىْءٍ إِنْ سَأَلْتُكُمْ عَنْهُ ‏\"‏‏.‏ فَقَالُوا نَعَمْ يَا أَبَا الْقَاسِمِ، وَإِنْ كَذَبْنَاكَ عَرَفْتَ كَذِبَنَا كَمَا عَرَفْتَهُ فِي أَبِينَا‏.‏ قَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَهْلُ النَّارِ ‏\"‏‏.‏ فَقَالُوا نَكُونُ فِيهَا يَسِيرًا، ثُمَّ تَخْلُفُونَنَا فِيهَا‏.‏ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اخْسَئُوا فِيهَا، وَاللَّهِ لاَ نَخْلُفُكُمْ فِيهَا أَبَدًا ‏\"‏‏.‏ ثُمَّ قَالَ لَهُمْ ‏\"‏ فَهَلْ أَنْتُمْ صَادِقِيَّ عَنْ شَىْءٍ إِنْ سَأَلْتُكُمْ عَنْهُ ‏\"‏‏.‏ قَالُوا نَعَمْ‏.‏ فَقَالَ ‏\"‏ هَلْ جَعَلْتُمْ فِي هَذِهِ الشَّاةِ سُمًّا ‏\"‏‏.‏ فَقَالُوا نَعَمْ‏.‏ فَقَالَ ‏\"‏ مَا حَمَلَكُمْ عَلَى ذَلِكَ ‏\"‏‏.‏ فَقَالُوا أَرَدْنَا إِنْ كُنْتَ كَذَّابًا نَسْتَرِيحُ مِنْكَ، وَإِنْ كُنْتَ نَبِيًّا لَمْ يَضُرَّكَ‏.‏",
    "malay_translation": "Ketika Khaibar ditawan, Rasulullah ﷺ dihadiahkan seekor kambing yang telah diracun.  Rasulullah ﷺ bersabda, \"Kumpulkan untukku semua orang Yahudi yang berada di sini.\"  Mereka dikumpulkan, lalu Rasulullah ﷺ bertanya kepada mereka, \"Aku akan bertanya sesuatu kepadamu, adakah kamu akan jujur kepadaku?\" Mereka menjawab, \"Ya, wahai Aba Qasim!\" Rasulullah ﷺ bertanya, \"Siapakah bapa kamu?\" Mereka menjawab, \"Bapa kami ialah fulan.\" Rasulullah ﷺ bersabda, \"Kamu berbohong!  Bapa kamu sebenarnya ialah fulan.\" Mereka berkata, \"Benar, engkau telah berkata benar dan adil.\"  Rasulullah ﷺ bertanya lagi, \"Adakah kamu akan jujur jika aku bertanya sesuatu kepadamu?\" Mereka menjawab, \"Ya, wahai Aba Qasim! Dan jika kami berbohong, engkau akan mengetahuinya seperti mana engkau mengetahui tentang bapa kami.\" Rasulullah ﷺ bertanya, \"Siapakah penghuni neraka?\" Mereka menjawab, \"Kami akan berada di dalamnya sebentar, kemudian kamu (orang Islam) akan menggantikan kami.\" Rasulullah ﷺ bersabda, \"Kalian akan kekal di dalamnya dalam kehinaan. Demi Allah, kami tidak akan pernah menggantikan kalian di dalamnya selamanya!\" Kemudian baginda bertanya lagi, \"Adakah kamu akan jujur jika aku bertanya sesuatu kepadamu?\" Mereka menjawab, \"Ya.\" Baginda bertanya, \"Adakah kamu telah meracuni kambing panggang ini?\" Mereka menjawab, \"Ya.\" Baginda bertanya, \"Apakah yang mendorong kamu berbuat demikian?\" Mereka menjawab, \"Kami ingin mengetahui, jika engkau pendusta maka kami akan terlepas dari engkau, dan jika engkau seorang nabi, maka ia tidak akan membahayakan engkau.\""
  },
  {
    "id": 5553,
    "hadith_number": 5553,
    "tajuk_hadith": "Azab Neraka Bagi Mereka Yang Bunuh Diri",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \"Whoever purposely throws himself from a mountain and kills himself, will be in \nthe (Hell) Fire falling down into it and abiding therein perpetually forever; and whoever drinks poison \nand kills himself with it, he will be carrying his poison in his hand and drinking it in the (Hell) Fire \nwherein he will abide eternally forever; and whoever kills himself with an iron weapon, will be \ncarrying that weapon in his hand and stabbing his `Abdomen with it in the (Hell) Fire wherein he will \nabide eternally forever.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، قَالَ سَمِعْتُ ذَكْوَانَ، يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ تَرَدَّى مِنْ جَبَلٍ فَقَتَلَ نَفْسَهُ، فَهْوَ فِي نَارِ جَهَنَّمَ، يَتَرَدَّى فِيهِ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا، وَمَنْ تَحَسَّى سَمًّا فَقَتَلَ نَفْسَهُ، فَسَمُّهُ فِي يَدِهِ، يَتَحَسَّاهُ فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا، وَمَنْ قَتَلَ نَفْسَهُ بِحَدِيدَةٍ، فَحَدِيدَتُهُ فِي يَدِهِ، يَجَأُ بِهَا فِي بَطْنِهِ فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Barangsiapa sengaja terjun dari gunung lalu membunuh dirinya sendiri, maka dia akan berada di dalam api neraka Jahanam, terus-menerus jatuh ke dalamnya dan kekal di dalamnya selama-lamanya. Dan barangsiapa meminum racun lalu membunuh dirinya sendiri dengannya, maka racun itu akan berada di tangannya, lalu dia akan meminumnya di dalam api neraka Jahanam, kekal dan terus-menerus di dalamnya selama-lamanya. Dan barangsiapa membunuh dirinya sendiri dengan senjata tajam, maka senjata tajam itu akan berada di tangannya, lalu dia akan menikam perutnya dengannya di dalam api neraka Jahanam, kekal dan terus-menerus di dalamnya selama-lamanya.\""
  },
  {
    "id": 5554,
    "hadith_number": 5554,
    "tajuk_hadith": "Kebaikan Kurma Ajwa",
    "perawi_melayu": "Riwayat Sa'd:",
    "english_text": "I heard Allah's Messenger (ﷺ) saying, \"Whoever takes seven 'Ajwa dates in the morning will not be effected \nby magic or poison on that day.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا أَحْمَدُ بْنُ بَشِيرٍ أَبُو بَكْرٍ، أَخْبَرَنَا هَاشِمُ بْنُ هَاشِمٍ، قَالَ أَخْبَرَنِي عَامِرُ بْنُ سَعْدٍ، قَالَ سَمِعْتُ أَبِي يَقُولُ، سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنِ اصْطَبَحَ بِسَبْعِ تَمَرَاتٍ عَجْوَةٍ لَمْ يَضُرَّهُ ذَلِكَ الْيَوْمَ سَمٌّ وَلاَ سِحْرٌ ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda:  \"Barangsiapa memakan tujuh biji kurma Ajwa pada pagi hari, maka dia tidak akan tercedera oleh racun atau sihir pada hari itu.\""
  },
  {
    "id": 5555,
    "hadith_number": 5555,
    "tajuk_hadith": "Larangan Makan Haiwan Liar Berbisa",
    "perawi_melayu": "Riwayat Abu Tha`laba Al-Khushani:",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ، عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ، رضى الله عنه قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ أَكْلِ كُلِّ ذِي نَابٍ مِنَ السَّبُعِ‏.‏ قَالَ الزُّهْرِيُّ وَلَمْ أَسْمَعْهُ حَتَّى أَتَيْتُ الشَّأْمَ‏.‏   وَزَادَ اللَّيْثُ قَالَ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ وَسَأَلْتُهُ هَلْ نَتَوَضَّأُ أَوْ نَشْرَبُ أَلْبَانَ الأُتُنِ أَوْ مَرَارَةَ السَّبُعِ أَوْ أَبْوَالَ الإِبِلِ‏.‏ قَالَ قَدْ كَانَ الْمُسْلِمُونَ يَتَدَاوَوْنَ بِهَا، فَلاَ يَرَوْنَ بِذَلِكَ بَأْسًا، فَأَمَّا أَلْبَانُ الأُتُنِ فَقَدْ بَلَغَنَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ لُحُومِهَا، وَلَمْ يَبْلُغْنَا عَنْ أَلْبَانِهَا أَمْرٌ وَلاَ نَهْىٌ، وَأَمَّا مَرَارَةُ السَّبُعِ قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي أَبُو إِدْرِيسَ الْخَوْلاَنِيُّ أَنَّ أَبَا ثَعْلَبَةَ الْخُشَنِيَّ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ أَكْلِ كُلِّ ذِي نَابٍ مِنَ السَّبُعِ‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Abdullah bin Muhammad, telah menceritakan kepada kami Sufyan, dari Az- Zuhri, dari Abu Idris Al-Khaulani, dari Abu Ts’alabah Al-Khushani r.a., bahawa Nabi SAW melarang memakan semua haiwan buas yang mempunyai taring. Az-Zuhri berkata: Aku tidak pernah mendengar hadis ini sehingga aku sampai ke Syam.  Dan menambahkan Al-Laits berkata: Telah menceritakan kepadaku Yunus, dari Ibnu Syihab, berkata: Aku bertanya kepadanya, \"Bolehkah kita berwuduk atau minum susu keldai betina atau hempedu haiwan buas atau air kencing unta?\" Dia menjawab: \"Orang Islam dahulu biasa berubat dengannya, dan mereka tidak melihat apa-apa kemudaratan padanya. Adapun susu keldai betina, telah sampai kepada kami bahawa Rasulullah SAW melarang memakan dagingnya, dan tidak sampai kepada kami tentang susunya sama ada diharuskan atau dilarangkan.\" Adapun hempedu haiwan buas, Ibnu Syihab berkata: Abu Idris Al-Khaulani memberitahu aku bahawa Abu Ts’alabah Al-Khushani memberitahu dia bahawa Rasulullah SAW melarang memakan semua haiwan buas yang mempunyai taring."
  },
  {
    "id": 5556,
    "hadith_number": 5556,
    "tajuk_hadith": "Lalat yang Jatuh ke dalam Minuman",
    "perawi_melayu": "Riwayat Abu Hurairah",
    "english_text": "Allah's Messenger (ﷺ) said, \"If a fly falls in the vessel of any of you, let him dip all of it (into the vessel) and \nthen throw it away, for in one of its wings there is a disease and in the other there is healing (antidote \nfor it) i e. the treatment for that disease.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عُتْبَةَ بْنِ مُسْلِمٍ، مَوْلَى بَنِي تَيْمٍ عَنْ عُبَيْدِ بْنِ حُنَيْنٍ، مَوْلَى بَنِي زُرَيْقٍ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا وَقَعَ الذُّبَابُ فِي إِنَاءِ أَحَدِكُمْ، فَلْيَغْمِسْهُ كُلَّهُ، ثُمَّ لْيَطْرَحْهُ، فَإِنَّ فِي أَحَدِ جَنَاحَيْهِ شِفَاءً وَفِي الآخَرِ دَاءً ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Jika lalat jatuh ke dalam bekas minuman kamu, celupkan seluruhnya (ke dalam bekas itu), kemudian buangkanlah.  Kerana pada salah satu sayapnya terdapat penyakit dan pada sayap yang lain terdapat penawarnya (ubat bagi penyakit itu).\""
  }
]
