[
  {
    "id": 6380,
    "hadith_number": 6380,
    "tajuk_hadith": "Abu Bakar As-Siddiq dan Kefaraan Sumpah",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "Abu Bakr As-Siddiq had never broken his oaths till Allah revealed the expiation for the oaths. Then he \nsaid, \"If I take an oath to do something and later on I find something else better than the first one, then \nI do what is better and make expiation for my oath.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ لَمْ يَكُنْ يَحْنَثُ فِي يَمِينٍ قَطُّ، حَتَّى أَنْزَلَ اللَّهُ كَفَّارَةَ الْيَمِينِ وَقَالَ لاَ أَحْلِفُ عَلَى يَمِينٍ فَرَأَيْتُ غَيْرَهَا خَيْرًا مِنْهَا، إِلاَّ أَتَيْتُ الَّذِي هُوَ خَيْرٌ، وَكَفَّرْتُ عَنْ يَمِينِي‏.‏",
    "malay_translation": "Aisyah meriwayatkan bahawa Abu Bakar As-Siddiq tidak pernah mengingkari sumpahnya sehingga Allah SWT menurunkan hukum kafarah (tebusan) bagi sumpah.  Kemudian beliau berkata, \"Sekiranya aku bersumpah untuk melakukan sesuatu, dan kemudian aku dapati sesuatu yang lain lebih baik daripadanya, maka aku akan melakukan apa yang lebih baik dan menunaikan kafarah bagi sumpahku.\""
  },
  {
    "id": 6381,
    "hadith_number": 6381,
    "tajuk_hadith": "Jangan Meminta Jawatan Kepimpinan",
    "perawi_melayu": "Riwayat Abdur-Rahman bin Samura:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ، مُحَمَّدُ بْنُ الْفَضْلِ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، حَدَّثَنَا الْحَسَنُ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَمُرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ يَا عَبْدَ الرَّحْمَنِ بْنَ سَمُرَةَ لاَ تَسْأَلِ الإِمَارَةَ، فَإِنَّكَ إِنْ أُوتِيتَهَا عَنْ مَسْأَلَةٍ وُكِلْتَ إِلَيْهَا، وَإِنْ أُوتِيتَهَا مِنْ غَيْرِ مَسْأَلَةٍ أُعِنْتَ عَلَيْهَا، وَإِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا، فَكَفِّرْ عَنْ يَمِينِكَ، وَأْتِ الَّذِي هُوَ خَيْرٌ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Nu'man, Muhammad bin Fadhl, telah menceritakan kepada kami Jarir bin Hazim, telah menceritakan kepada kami Al-Hasan, telah menceritakan kepada kami Abdur-Rahman bin Samurah, dia berkata, Rasulullah SAW bersabda: \"Wahai Abdur-Rahman bin Samurah, janganlah engkau meminta jawatan kepimpinan, kerana jika engkau diberi jawatan itu kerana permintaanmu, maka engkau akan dipertanggungjawabkan ke atasnya, dan jika engkau diberi jawatan itu tanpa meminta, maka engkau akan dibantu (oleh Allah) di dalamnya. Dan jika engkau telah bersumpah atas sesuatu, kemudian engkau melihat sesuatu yang lain lebih baik daripadanya, maka tebuslah sumpahmu dan lakukanlah apa yang lebih baik.\""
  },
  {
    "id": 6382,
    "hadith_number": 6382,
    "tajuk_hadith": "Nabi SAW dan Sumpah Mengenai Kenderaan",
    "perawi_melayu": "Riwayat Abu Musa",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ غَيْلاَنَ بْنِ جَرِيرٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فِي رَهْطٍ مِنَ الأَشْعَرِيِّينَ أَسْتَحْمِلُهُ فَقَالَ ‏\"‏ وَاللَّهِ لاَ أَحْمِلُكُمْ، وَمَا عِنْدِي مَا أَحْمِلُكُمْ عَلَيْهِ ‏\"‏‏.‏ قَالَ ثُمَّ لَبِثْنَا مَا شَاءَ اللَّهُ أَنْ نَلْبَثَ، ثُمَّ أُتِيَ بِثَلاَثِ ذَوْدٍ غُرِّ الذُّرَى فَحَمَلَنَا عَلَيْهَا فَلَمَّا انْطَلَقْنَا قُلْنَا أَوْ قَالَ بَعْضُنَا وَاللَّهِ لاَ يُبَارَكُ لَنَا، أَتَيْنَا النَّبِيَّ صلى الله عليه وسلم نَسْتَحْمِلُهُ، فَحَلَفَ أَنْ لاَ يَحْمِلَنَا ثُمَّ حَمَلَنَا، فَارْجِعُوا بِنَا إِلَى النَّبِيِّ صلى الله عليه وسلم فَنُذَكِّرُهُ، فَأَتَيْنَاهُ فَقَالَ ‏\"‏ مَا أَنَا حَمَلْتُكُمْ، بَلِ اللَّهُ حَمَلَكُمْ، وَإِنِّي وَاللَّهِ إِنْ شَاءَ اللَّهُ لاَ أَحْلِفُ عَلَى يَمِينٍ فَأَرَى غَيْرَهَا خَيْرًا مِنْهَا، إِلاَّ كَفَّرْتُ عَنْ يَمِينِي، وَأَتَيْتُ الَّذِي هُوَ خَيْرٌ ‏\"‏‏.‏ أَوْ ‏\"‏ أَتَيْتُ الَّذِي هُوَ خَيْرٌ وَكَفَّرْتُ عَنْ يَمِينِي ‏\"‏‏.‏",
    "malay_translation": "Kami telah datang kepada Nabi SAW bersama sekumpulan orang Asy'ari untuk meminta kenderaan. Baginda berkata, \"Demi Allah, aku tidak akan memberikan kamu kenderaan, dan aku tidak mempunyai apa-apa untuk memberikan kamu kenderaan.\" Kemudian kami menunggu seketika lamanya sebagaimana Allah kehendaki. Kemudian, tiga ekor unta betina yang cantik dibawa kepada baginda, lalu baginda memberikan kami kenderaan.  Setelah kami berlalu, kami, atau sebahagian daripada kami, berkata, \"Demi Allah, kami tidak akan diberkati kerana kami datang kepada Nabi SAW untuk meminta kenderaan, lalu baginda bersumpah tidak akan memberikan kami, tetapi kemudian baginda memberikannya. Oleh itu, marilah kita kembali kepada Nabi SAW dan mengingatkan baginda (tentang sumpahnya).\" Setelah kami kembali kepada baginda, baginda berkata, \"Bukan aku yang memberikan kamu kenderaan, tetapi Allah yang memberikannya. Demi Allah, jika Allah menghendaki, aku tidak akan bersumpah atas sesuatu sumpah lalu aku melihat yang lain lebih baik darinya, melainkan aku akan menebus sumpahku dan melakukan perkara yang lebih baik.\" Atau, \"aku akan melakukan perkara yang lebih baik dan menebus sumpahku.\""
  },
  {
    "id": 6383,
    "hadith_number": 6383,
    "tajuk_hadith": "Keutamaan Umat Islam di Hari Kiamat",
    "perawi_melayu": "Dari Abu Hurairah",
    "english_text": "The Prophet (ﷺ) said, \"We (Muslims) are the last in the world, but will be foremost on the Day of Resurrection.\"",
    "arabic_text": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ نَحْنُ الآخِرُونَ السَّابِقُونَ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Kita (umat Islam) adalah umat yang terakhir muncul di dunia, tetapi kita akan menjadi yang terawal di hari kiamat.\""
  },
  {
    "id": 6384,
    "hadith_number": 6384,
    "tajuk_hadith": "Sumpah Yang Memudaratkan Keluarga",
    "perawi_melayu": "Rasulullah SAW bersabda:",
    "english_text": "\"By Allah, if anyone of you insists on fulfilling an oath by \nwhich he may harm his family, he commits a greater sin in Allah's sight than that of dissolving his \noath and making expiation for it.\"",
    "arabic_text": "فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ وَاللَّهِ لأَنْ يَلِجَّ أَحَدُكُمْ بِيَمِينِهِ فِي أَهْلِهِ آثَمُ لَهُ عِنْدَ اللَّهِ مِنْ أَنْ يُعْطِيَ كَفَّارَتَهُ الَّتِي افْتَرَضَ اللَّهُ عَلَيْهِ ‏\"‏‏.‏",
    "malay_translation": "Demi Allah, jika seseorang di antara kamu berkeras untuk menunaikan sumpah yang boleh memudaratkan keluarganya, maka dosanya di sisi Allah lebih besar daripada dia memutuskan sumpahnya dan membayar kafaratnya."
  },
  {
    "id": 6385,
    "hadith_number": 6385,
    "tajuk_hadith": "Sumpah Yang Merugikan Keluarga",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "Allah's Messenger (ﷺ) said, \"Anyone who takes an oath through which his family may be harmed, and insists on keeping it, he surely commits a sin greater (than that of dissolving his oath). He should rather compensate for that oath by making expiation.\"",
    "arabic_text": "حَدَّثَنِي إِسْحَاقُ يَعْنِي ابْنَ إِبْرَاهِيمَ، حَدَّثَنَا يَحْيَى بْنُ صَالِحٍ، حَدَّثَنَا مُعَاوِيَةُ، عَنْ يَحْيَى، عَنْ عِكْرِمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنِ اسْتَلَجَّ فِي أَهْلِهِ بِيَمِينٍ فَهْوَ أَعْظَمُ إِثْمًا، لِيَبَرَّ ‏\"‏‏.‏ يَعْنِي الْكَفَّارَةَ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Barangsiapa bersumpah dengan sumpah yang boleh mendatangkan kemudaratan kepada keluarganya, dan dia tetap berkeras untuk menunaikannya, maka sesungguhnya dia telah melakukan dosa yang lebih besar (daripada membatalkan sumpahnya). Sebaiknya dia menebus sumpah itu dengan melakukan kafarah (kafarat).\""
  },
  {
    "id": 6386,
    "hadith_number": 6386,
    "tajuk_hadith": "Kepemimpinan Usamah bin Zaid",
    "perawi_melayu": "Riwayat Ibnu Umar:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ إِسْمَاعِيلَ بْنِ جَعْفَرٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَعْثًا وَأَمَّرَ عَلَيْهِمْ أُسَامَةَ بْنَ زَيْدٍ، فَطَعَنَ بَعْضُ النَّاسِ فِي إِمْرَتِهِ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ إِنْ كُنْتُمْ تَطْعَنُونَ فِي إِمْرَتِهِ فَقَدْ كُنْتُمْ تَطْعَنُونَ، فِي إِمْرَةِ أَبِيهِ مِنْ قَبْلُ، وَايْمُ اللَّهِ إِنْ كَانَ لَخَلِيقًا لِلإِمَارَةِ، وَإِنْ كَانَ لَمِنْ أَحَبِّ النَّاسِ إِلَىَّ، وَإِنَّ هَذَا لَمِنْ أَحَبِّ النَّاسِ إِلَىَّ بَعْدَهُ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Qutaibah bin Sa'id, dari Ismail bin Ja'far, dari Abdullah bin Dinar, dari Ibnu Umar r.a., bahawa Rasulullah SAW telah menghantar satu pasukan tentera dan telah melantik Usamah bin Zaid sebagai panglima.  Maka sebahagian daripada orang ramai telah mempertikaikan kepemimpinannya.  Lalu Rasulullah SAW bangun dan bersabda:  \"Jika kamu mempertikaikan kepemimpinannya, maka sesungguhnya kamu juga telah mempertikaikan kepemimpinan bapanya sebelum ini.  Demi Allah, sesungguhnya Zaid memang layak menjadi pemimpin, dan dia adalah antara orang yang paling aku cintai, dan Usamah ini adalah antara orang yang paling aku cintai selepasnya.\""
  },
  {
    "id": 6387,
    "hadith_number": 6387,
    "tajuk_hadith": "Sumpah Nabi SAW",
    "perawi_melayu": "Riwayat Ibn Umar:",
    "english_text": "The oath of the Prophet (ﷺ) used to be: \"No, by Him who turns the hearts.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، عَنْ سُفْيَانَ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَتْ يَمِينُ النَّبِيِّ صلى الله عليه وسلم ‏\n\"‏ لاَ وَمُقَلِّبِ الْقُلُوبِ ‏\"‏‏.‏",
    "malay_translation": "Ibn Umar berkata: Sumpah Nabi SAW adalah: \"Tidak, demi Allah yang membolak-balikkan hati.\""
  },
  {
    "id": 6388,
    "hadith_number": 6388,
    "tajuk_hadith": "Kehancuran Kaisar dan Kisra dan Pembelanjaan Harta Mereka di Jalan Allah",
    "perawi_melayu": "Dari Jabir bin Samurah:",
    "english_text": "The Prophet (ﷺ) said, \"If Caesar is ruined, there will be no Caesar after him; and if Khosrau is ruined, \nthere will be no Khosrau, after him; and, by Him in Whose Hand my soul is, surely you will spend \ntheir treasures in Allah's Cause.\"",
    "arabic_text": "حَدَّثَنَا مُوسَى، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ، عَنْ جَابِرِ بْنِ سَمُرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا هَلَكَ قَيْصَرُ فَلاَ قَيْصَرَ بَعْدَهُ، وَإِذَا هَلَكَ كِسْرَى فَلاَ كِسْرَى بَعْدَهُ، وَالَّذِي نَفْسِي بِيَدِهِ لَتُنْفَقَنَّ كُنُوزُهُمَا فِي سَبِيلِ اللَّهِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Sekiranya Kaisar binasa, nescaya tidak akan ada Kaisar selepasnya; dan sekiranya Kisra binasa, nescaya tidak akan ada Kisra selepasnya; dan demi Zat yang jiwaku berada di tangan-Nya, sesungguhnya harta benda mereka akan dibelanjakan di jalan Allah.\""
  },
  {
    "id": 6389,
    "hadith_number": 6389,
    "tajuk_hadith": "Kehancuran Kisra dan Qaisar dan Pembelanjaan Harta Mereka",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "Allah's Messenger (ﷺ) said, \"If Khosrau is ruined, there will be no Khosrau after him; and if Caesar is ruined, there will be no Caesar after him. By Him in Whose Hand Muhammad's soul is, surely you will spend their treasures in Allah's Cause.\"",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا هَلَكَ كِسْرَى فَلاَ كِسْرَى بَعْدَهُ، وَإِذَا هَلَكَ قَيْصَرُ فَلاَ قَيْصَرَ بَعْدَهُ، وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَتُنْفَقَنَّ كُنُوزُهُمَا فِي سَبِيلِ اللَّهِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Sekiranya Kisra binasa, nescaya tiada lagi Kisra selepasnya; dan sekiranya Qaisar binasa, nescaya tiada lagi Qaisar selepasnya. Demi Zat yang jiwa Muhammad berada di tanganNya, sesungguhnya harta benda mereka akan dibelanjakan di jalan Allah.\""
  },
  {
    "id": 6390,
    "hadith_number": 6390,
    "tajuk_hadith": "Tangisan dan Ketawa Umat Muhammad",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "The Prophet (ﷺ) said, \"O followers of Muhammad! By Allah, if you knew what I know, you would weep much and laugh little.\"",
    "arabic_text": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا عَبْدَةُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ يَا أُمَّةَ مُحَمَّدٍ وَاللَّهِ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَبَكَيْتُمْ كَثِيرًا، وَلَضَحِكْتُمْ قَلِيلاً ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Wahai umat Muhammad! Demi Allah, sekiranya kamu mengetahui apa yang aku ketahui, nescaya kamu akan menangis banyak dan ketawa sedikit.\""
  },
  {
    "id": 6391,
    "hadith_number": 6391,
    "tajuk_hadith": "Keutamaan Nabi SAW dalam Iman",
    "perawi_melayu": "Riwayat Abdullah bin Hisham:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي حَيْوَةُ، قَالَ حَدَّثَنِي أَبُو عَقِيلٍ، زُهْرَةُ بْنُ مَعْبَدٍ أَنَّهُ سَمِعَ جَدَّهُ عَبْدَ اللَّهِ بْنَ هِشَامٍ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم وَهْوَ آخِذٌ بِيَدِ عُمَرَ بْنِ الْخَطَّابِ فَقَالَ لَهُ عُمَرُ يَا رَسُولَ اللَّهِ لأَنْتَ أَحَبُّ إِلَىَّ مِنْ كُلِّ شَىْءٍ إِلاَّ مِنْ نَفْسِي‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ وَالَّذِي نَفْسِي بِيَدِهِ حَتَّى أَكُونَ أَحَبَّ إِلَيْكَ مِنْ نَفْسِكَ ‏\"‏‏.‏ فَقَالَ لَهُ عُمَرُ فَإِنَّهُ الآنَ وَاللَّهِ لأَنْتَ أَحَبُّ إِلَىَّ مِنْ نَفْسِي‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ الآنَ يَا عُمَرُ ‏\"‏‏.‏",
    "malay_translation": "Kami bersama Nabi SAW, baginda memegang tangan Umar bin al-Khattab. Umar berkata kepada baginda, \"Wahai Rasulullah, anda lebih aku cintai daripada segala sesuatu kecuali diriku sendiri.\" Nabi SAW bersabda, \"Tidak, demi Allah yang jiwa ku berada di tangan-Nya, sehingga aku lebih engkau cintai daripada dirimu sendiri.\" Kemudian Umar berkata, \"Namun, sekarang demi Allah, anda lebih aku cintai daripada diriku sendiri.\" Nabi SAW bersabda, \"Sekarang, wahai Umar (kini engkau beriman).\""
  },
  {
    "id": 6392,
    "hadith_number": 6392,
    "tajuk_hadith": "Hukuman Zina: Keadilan dan Undang-Undang Allah",
    "perawi_melayu": "Riwayat Abu Hurairah dan Zaid bin Khalid:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ أَبِي هُرَيْرَةَ، وَزَيْدِ بْنِ خَالِدٍ، أَنَّهُمَا أَخْبَرَاهُ أَنَّ رَجُلَيْنِ اخْتَصَمَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ أَحَدُهُمَا اقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ‏.‏ وَقَالَ الآخَرُ وَهْوَ أَفْقَهُهُمَا أَجَلْ يَا رَسُولَ اللَّهِ فَاقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ، وَائْذَنْ لِي أَنْ أَتَكَلَّمَ‏.‏ قَالَ ‏\"‏ تَكَلَّمْ ‏\"‏‏.‏ قَالَ إِنَّ ابْنِي كَانَ عَسِيفًا عَلَى هَذَا ـ قَالَ مَالِكٌ وَالْعَسِيفُ الأَجِيرُ ـ زَنَى بِامْرَأَتِهِ، فَأَخْبَرُونِي أَنَّ عَلَى ابْنِي الرَّجْمَ، فَافْتَدَيْتُ مِنْهُ بِمِائَةِ شَاةٍ وَجَارِيَةٍ لِي، ثُمَّ إِنِّي سَأَلْتُ أَهْلَ الْعِلْمِ فَأَخْبَرُونِي أَنَّ مَا عَلَى ابْنِي جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ، وَإِنَّمَا الرَّجْمُ عَلَى امْرَأَتِهِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمَا وَالَّذِي نَفْسِي بِيَدِهِ لأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ، أَمَّا غَنَمُكَ وَجَارِيَتُكَ فَرَدٌّ عَلَيْكَ ‏\"‏‏.‏ وَجَلَدَ ابْنَهُ مِائَةً وَغَرَّبَهُ عَامًا، وَأُمِرَ أُنَيْسٌ الأَسْلَمِيُّ أَنْ يَأْتِيَ امْرَأَةَ الآخَرِ، فَإِنِ اعْتَرَفَتْ رَجَمَهَا، فَاعْتَرَفَتْ فَرَجَمَهَا‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ismail, katanya telah menceritakan kepadaku Malik, dari Ibnu Syihab, dari Ubaidullah bin Abdullah bin Utbah bin Mas'ud, dari Abu Hurairah dan Zaid bin Khalid, bahawa mereka berdua memberitahunya bahawa dua orang lelaki berselisih kepada Rasulullah SAW.  Maka salah seorang daripada mereka berkata, \"Putuskanlah di antara kami mengikut Kitabullah.\"  Dan yang seorang lagi, iaitu yang lebih faham di antara mereka berdua berkata, \"Ya, wahai Rasulullah, putuskanlah di antara kami mengikut Kitabullah dan izinkanlah aku untuk berkata.\" Baginda SAW bersabda, \"Berkatakanlah.\" Katanya, \"Sesungguhnya anakku bekerja sebagai buruh (ajir) kepada orang ini dan dia telah berzina dengan isterinya.  Mereka memberitahuku bahawa anakku sepatutnya direjam, maka aku tebus dia dengan seratus ekor kambing dan seorang hamba perempuan. Kemudian aku bertanya kepada orang-orang yang berilmu, maka mereka memberitahuku bahawa hukuman untuk anakku ialah disebat seratus kali dan dibuang negeri selama setahun, dan hukuman rejam hanya untuk isteri orang itu.\"  Maka Rasulullah SAW bersabda, \"Demi Zat yang jiwaku berada di tangan-Nya, sesungguhnya Aku akan memutuskan di antara kamu berdua mengikut Kitabullah.  Adapun kambing-kambingmu dan hamba perempuanmu, maka ia dikembalikan kepadamu.\"  Lalu Baginda menyeksa anaknya dengan seratus kali sebatan dan membuangnya selama setahun. Kemudian Unais Al-Aslami diperintahkan untuk pergi kepada isteri lelaki yang lain itu.  Jika dia mengaku, maka rejamlah dia. Maka dia mengaku, lalu direjamlah dia."
  },
  {
    "id": 6393,
    "hadith_number": 6393,
    "tajuk_hadith": "Keutamaan Sesetengah Kabilah",
    "perawi_melayu": "Riwayat Abu Bakra:",
    "english_text": "The Prophet (ﷺ) said, \"Do you think if the tribes of Aslam, Ghifar, Muzaina and Juhaina are better than \nthe tribes of Tamim, 'Amir bin Sa'sa'a, Ghatfan and Asad, they (the second group) are despairing and \nlosing?\" They (the Prophet's companions) said, \"Yes, (they are).\" He said, \"By Him in Whose Hand \nmy soul is, they (the first group) are better than them (the second group).",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَهْبٌ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ أَبِي يَعْقُوبَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ أَرَأَيْتُمْ إِنْ كَانَ أَسْلَمُ وَغِفَارُ وَمُزَيْنَةُ وَجُهَيْنَةُ خَيْرًا مِنْ تَمِيمٍ وَعَامِرِ بْنِ صَعْصَعَةَ وَغَطَفَانَ وَأَسَدٍ، خَابُوا وَخَسِرُوا ‏\"‏‏.‏ قَالُوا نَعَمْ‏.‏ فَقَالَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّهُمْ خَيْرٌ مِنْهُمْ ‏\"‏‏.‏",
    "malay_translation": "Baginda Nabi SAW bersabda, \"Bagaimana pendapat kamu sekiranya kaum Aslam, Ghifar, Muzainah dan Juhainah lebih baik daripada kaum Tamim, Amir bin Sa'sa'ah, Ghatafan dan Asad, adakah mereka (kumpulan kedua) akan berputus asa dan merugi?\" Mereka (para sahabat Baginda) menjawab, \"Ya.\" Baginda bersabda, \"Demi Zat yang jiwaku berada di tangan-Nya, sesungguhnya mereka (kumpulan pertama) lebih baik daripada mereka (kumpulan kedua).\""
  },
  {
    "id": 6394,
    "hadith_number": 6394,
    "tajuk_hadith": "Akibat Pengkhianatan Amanah Zakat",
    "perawi_melayu": "Riwayat Abu Humaid As-Sa`idi:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ، عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ، أَنَّهُ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَعْمَلَ عَامِلاً فَجَاءَهُ الْعَامِلُ حِينَ فَرَغَ مِنْ عَمَلِهِ فَقَالَ يَا رَسُولَ اللَّهِ هَذَا لَكُمْ، وَهَذَا أُهْدِيَ لِي‏.‏ فَقَالَ لَهُ ‏\"‏ أَفَلاَ قَعَدْتَ فِي بَيْتِ أَبِيكَ وَأُمِّكَ فَنَظَرْتَ أَيُهْدَى لَكَ أَمْ لاَ ‏\"‏‏.‏ ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَشِيَّةً بَعْدَ الصَّلاَةِ فَتَشَهَّدَ وَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ، فَمَا بَالُ الْعَامِلِ نَسْتَعْمِلُهُ، فَيَأْتِينَا فَيَقُولُ هَذَا مِنْ عَمَلِكُمْ، وَهَذَا أُهْدِيَ لِي‏.‏ أَفَلاَ قَعَدَ فِي بَيْتِ أَبِيهِ وَأُمِّهِ فَنَظَرَ هَلْ يُهْدَى لَهُ أَمْ لاَ، فَوَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لاَ يَغُلُّ أَحَدُكُمْ مِنْهَا شَيْئًا، إِلاَّ جَاءَ بِهِ يَوْمَ الْقِيَامَةِ يَحْمِلُهُ عَلَى عُنُقِهِ، إِنْ كَانَ بَعِيرًا جَاءَ بِهِ لَهُ رُغَاءٌ، وَإِنْ كَانَتْ بَقَرَةً جَاءَ بِهَا لَهَا خُوَارٌ، وَإِنْ كَانَتْ شَاةً جَاءَ بِهَا تَيْعَرُ، فَقَدْ بَلَّغْتُ ‏\"‏‏.‏ فَقَالَ أَبُو حُمَيْدٍ ثُمَّ رَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ حَتَّى إِنَّا لَنَنْظُرُ إِلَى عُفْرَةِ إِبْطَيْهِ‏.‏ قَالَ أَبُو حُمَيْدٍ وَقَدْ سَمِعَ ذَلِكَ مَعِي زَيْدُ بْنُ ثَابِتٍ مِنَ النَّبِيِّ صلى الله عليه وسلم فَسَلُوهُ‏.‏",
    "malay_translation": "Rasulullah SAW telah melantik seorang pekerja untuk mengutip zakat.  Pekerja itu datang setelah selesai tugasnya dan berkata, \"Wahai Rasulullah SAW! Ini untuk tuan, dan ini diberikan kepada saya sebagai hadiah.\"  Rasulullah SAW bersabda kepadanya, \"Mengapa engkau tidak duduk di rumah ayah dan ibumu dan melihat sama ada engkau akan diberi hadiah atau tidak?\" Kemudian, Rasulullah SAW bangun pada waktu petang selepas solat, setelah bersaksi bahawa tiada yang berhak disembah melainkan Allah dan memuji serta mengagungkan Allah sebagaimana yang layak bagi-Nya, baginda bersabda, \"Sekarang, bagaimana pula dengan pekerja yang kami lantik, kemudian dia datang kepada kami dan berkata, 'Ini daripada hasil kerja kamu, dan ini diberikan kepadaku sebagai hadiah.' Mengapa dia tidak duduk di rumah ayahnya dan ibunya untuk melihat sama ada dia akan diberi hadiah atau tidak? Demi Allah yang jiwa Muhammad berada di tangan-Nya, sesiapa di antara kamu yang melakukan pengkhianatan terhadap zakat, nescaya dia akan membawanya pada Hari Kiamat dengan memikulnya di atas lehernya. Jika ia berupa unta, ia akan membawanya sambil unta itu meragut, dan jika ia berupa lembu, ia akan membawanya sambil lembu itu mengembik; dan jika ia berupa kambing, ia akan membawanya sambil kambing itu mengembek.\" Rasulullah SAW menambah, \"Aku telah menyampaikan (pesan Allah).\" Abu Humaid berkata, \"Kemudian Rasulullah SAW mengangkat tangannya sehingga kami melihat keputihan ketiaknya.\""
  },
  {
    "id": 6395,
    "hadith_number": 6395,
    "tajuk_hadith": "Tangisan dan Ketawa",
    "perawi_melayu": "Dari Abu Hurairah",
    "english_text": "Abu-l-Qasim (the Prophet) said, \"By Him in Whose Hand Muhammad's soul is, if you know that \nwhich I know, you would weep much and laugh little.\"",
    "arabic_text": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَام ٌ ـ هُوَ ابْنُ يُوسُفَ ـ عَنْ مَعْمَرٍ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ أَبُو الْقَاسِمِ صلى الله عليه وسلم ‏\n\"‏ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَبَكَيْتُمْ كَثِيرًا، وَلَضَحِكْتُمْ قَلِيلاً ‏\"‏‏.‏",
    "malay_translation": "Abu al-Qasim (Nabi SAW) bersabda, \"Demi Zat yang di tangan-Nya terletak nyawa Muhammad, sekiranya kamu mengetahui apa yang aku ketahui, nescaya kamu akan menangis banyak dan ketawa sedikit.\""
  },
  {
    "id": 6396,
    "hadith_number": 6396,
    "tajuk_hadith": "Orang Kaya Yang Merugi",
    "perawi_melayu": "Riwayat Abu Dzar:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنِ الْمَعْرُورِ، عَنْ أَبِي ذَرٍّ، قَالَ انْتَهَيْتُ إِلَيْهِ وَهُوَ يَقُولُ فِي ظِلِّ الْكَعْبَةِ ‏\"‏ هُمُ الأَخْسَرُونَ وَرَبِّ الْكَعْبَةِ، هُمُ الأَخْسَرُونَ وَرَبِّ الْكَعْبَةِ ‏\"‏ قُلْتُ مَا شَأْنِي أَيُرَى فِيَّ شَىْءٌ مَا شَأْنِي فَجَلَسْتُ إِلَيْهِ وَهْوَ يَقُولُ، فَمَا اسْتَطَعْتُ أَنْ أَسْكُتَ، وَتَغَشَّانِي مَا شَاءَ اللَّهُ، فَقُلْتُ مَنْ هُمْ بِأَبِي أَنْتَ وَأُمِّي يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الأَكْثَرُونَ أَمْوَالاً، إِلاَّ مَنْ قَالَ هَكَذَا وَهَكَذَا وَهَكَذَا ‏\"‏‏.‏",
    "malay_translation": "Aku sampai kepadanya (Nabi SAW) ketika baginda berada di bawah naungan Kaabah; baginda sedang berkata, \"Mereka adalah orang-orang yang rugi, demi Tuhan Kaabah! Mereka adalah orang-orang yang rugi, demi Tuhan Kaabah!\" Aku berkata (dalam hati), \"Apakah kesalahanku? Adakah sesuatu yang tidak patut dikesan pada diriku? Apakah kesalahanku? Kemudian aku duduk di sebelahnya dan baginda terus mengulangi perkataan tersebut. Aku tidak mampu untuk terus diam, dan Allah mengetahui betapa sedihnya aku pada masa itu. Maka aku berkata, 'Siapakah mereka (orang-orang yang rugi)? Semoga ayah dan ibuku dikorbankan untukmu, wahai Rasulullah SAW!' Baginda berkata, \"Mereka adalah orang-orang yang kaya raya, kecuali orang yang berbuat sebegini dan sebegini dan sebegini (iaitu, bersedekah dari hartanya di jalan Allah).\""
  },
  {
    "id": 6397,
    "hadith_number": 6397,
    "tajuk_hadith": "Doa Soloman dan Kesannya",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ قَالَ سُلَيْمَانُ لأَطُوفَنَّ اللَّيْلَةَ عَلَى تِسْعِينَ امْرَأَةً، كُلُّهُنَّ تَأْتِي بِفَارِسٍ يُجَاهِدُ فِي سَبِيلِ اللَّهِ‏.‏ فَقَالَ لَهُ صَاحِبُهُ إِنْ شَاءَ اللَّهُ‏.‏ فَلَمْ يَقُلْ إِنْ شَاءَ اللَّهُ‏.‏ فَطَافَ عَلَيْهِنَّ جَمِيعًا، فَلَمْ تَحْمِلْ مِنْهُنَّ إِلاَّ امْرَأَةٌ وَاحِدَةٌ، جَاءَتْ بِشِقِّ رَجُلٍ، وَايْمُ الَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَوْ قَالَ إِنْ شَاءَ اللَّهُ‏.‏ لَجَاهَدُوا فِي سَبِيلِ اللَّهِ فُرْسَانًا أَجْمَعُونَ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Sulaiman berkata, 'Pada malam ini aku akan mendatangi sembilan puluh orang wanita, dan setiap seorang daripada mereka akan melahirkan seorang pahlawan yang akan berjihad di jalan Allah.'  Sahabatnya berkata kepadanya, 'Insya-Allah.'  Tetapi Sulaiman tidak menyebut 'Insya-Allah'.  Maka dia pun mendatangi kesemua wanita itu.  Tiada seorang pun daripada mereka yang hamil kecuali seorang wanita sahaja, dan dia melahirkan seorang anak yang separuh manusia.  Demi Allah yang memegang nyawa Muhammad, sekiranya dia berkata 'Insya-Allah', nescaya mereka semua akan berjihad di jalan Allah sebagai pahlawan.\" "
  },
  {
    "id": 6398,
    "hadith_number": 6398,
    "tajuk_hadith": "Kehebatan Sapu Tangan Saad di Syurga",
    "perawi_melayu": "Riwayat Al-Bara' bin Azib:",
    "english_text": "A piece of silken cloth was given to the Prophet (ﷺ) as a present and the people handed it over amongst \nthemselves and were astonished at its beauty and softness. Allah's Messenger (ﷺ) said, \"Are you astonished \nat it?\" They said, \"Yes, O Allah's Messenger (ﷺ)!\" He said, \"By Him in Whose Hand my soul is, the \nhandkerchiefs of Sa`d in Paradise are better than it.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ أُهْدِيَ إِلَى النَّبِيِّ صلى الله عليه وسلم سَرَقَةٌ مِنْ حَرِيرٍ، فَجَعَلَ النَّاسُ يَتَدَاوَلُونَهَا بَيْنَهُمْ، وَيَعْجَبُونَ مِنْ حُسْنِهَا وَلِينِهَا، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَعْجَبُونَ مِنْهَا ‏\"‏‏.‏ قَالُوا نَعَمْ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لَمَنَادِيلُ سَعْدٍ فِي الْجَنَّةِ خَيْرٌ مِنْهَا ‏\"‏‏.‏ لَمْ يَقُلْ شُعْبَةُ وَإِسْرَائِيلُ عَنْ أَبِي إِسْحَاقَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ ‏\"‏‏.‏",
    "malay_translation": "Sehelai kain sutera dihadiahkan kepada Nabi SAW.  Orang ramai lalu saling bertukar-tukar melihatnya dan kagum akan keindahan dan kelembutannya.  Rasulullah SAW bersabda, \"Adakah kamu kagum dengannya?\" Mereka menjawab, \"Ya, wahai Rasulullah SAW!\" Baginda bersabda, \"Demi Zat yang jiwa ku berada di tanganNya, sapu tangan Saad di Syurga adalah lebih baik daripadanya.\""
  },
  {
    "id": 6399,
    "hadith_number": 6399,
    "tajuk_hadith": "Penyesalan Hind dan Hukum Memberi Makan Anak",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ إِنَّ هِنْدَ بِنْتَ عُتْبَةَ بْنِ رَبِيعَةَ قَالَتْ يَا رَسُولَ اللَّهِ مَا كَانَ مِمَّا عَلَى ظَهْرِ الأَرْضِ أَهْلُ أَخْبَاءٍ ـ أَوْ خِبَاءٍ ـ أَحَبَّ إِلَىَّ أَنْ يَذِلُّوا مِنْ أَهْلِ أَخْبَائِكَ ـ أَوْ خِبَائِكَ، شَكَّ يَحْيَى ـ ثُمَّ مَا أَصْبَحَ الْيَوْمَ أَهْلُ أَخْبَاءٍ ـ أَوْ خِبَاءٍ ـ أَحَبَّ إِلَىَّ مِنْ أَنْ يَعِزُّوا مِنْ أَهْلِ أَخْبَائِكَ أَوْ خِبَائِكَ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَأَيْضًا وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ ‏\"‏‏.‏ قَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أَبَا سُفْيَانَ رَجُلٌ مِسِّيكٌ، فَهَلْ عَلَىَّ حَرَجٌ أَنْ أُطْعِمَ مِنَ الَّذِي لَهُ قَالَ ‏\"‏ لاَ إِلاَّ بِالْمَعْرُوفِ ‏\"‏‏.‏",
    "malay_translation": "Yahya bin Bukair telah meriwayatkan daripada Laits, daripada Yunus, daripada Ibnu Syihab, daripada Urwah bin Zubair bahawa Aisyah r.a. berkata:  Hind binti Utbah bin Rabi’ah berkata, \"Wahai Rasulullah, dahulu, tidak ada satu keluarga pun di muka bumi ini yang lebih aku ingin melihat mereka kehinaan daripada keluarga kamu. Tetapi hari ini, tidak ada satu keluarga pun yang lebih aku ingin melihat mereka mendapat kemuliaan daripada keluargamu.\" Rasulullah s.a.w. bersabda, \"Aku juga berpendapat sedemikian, demi Allah yang memegang jiwa Muhammad!\"  Hind berkata, \"Wahai Rasulullah, sesungguhnya Abu Sufyan adalah seorang yang bakhil. Adakah aku berdosa jika aku memberi makan anak-anakku daripada hartanya?\" Nabi s.a.w. bersabda, \"Tidak, kecuali jika engkau mengambilnya secara melampau.\" "
  },
  {
    "id": 6400,
    "hadith_number": 6400,
    "tajuk_hadith": "Rasulullah SAW Mendoakan Sahabat Menjadi Separuh Ahli Syurga",
    "perawi_melayu": "Riwayat Abdullah bin Masud",
    "english_text": "While Allah's Messenger (ﷺ) was sitting, reclining his back against a Yemenite leather tent he said to his \ncompanions, \"Will you be pleased to be one-fourth of the people of Paradise?\" They said, 'Yes.' He \nsaid \"Won't you be pleased to be one-third of the people of Paradise\" They said, \"Yes.\" He said, \"By \nHim in Whose Hand Muhammad's soul is, I hope that you will be one-half of the people of Paradise.\"",
    "arabic_text": "حَدَّثَنِي أَحْمَدُ بْنُ عُثْمَانَ، حَدَّثَنَا شُرَيْحُ بْنُ مَسْلَمَةَ، حَدَّثَنَا إِبْرَاهِيمُ، عَنْ أَبِيهِ، عَنْ أَبِي إِسْحَاقَ، سَمِعْتُ عَمْرَو بْنَ مَيْمُونٍ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ بَيْنَمَا رَسُولُ اللَّهِ صلى الله عليه وسلم مُضِيفٌ ظَهْرَهُ إِلَى قُبَّةٍ مِنْ أَدَمٍ يَمَانٍ إِذْ قَالَ لأَصْحَابِهِ ‏\"‏ أَتَرْضَوْنَ أَنْ تَكُونُوا رُبُعَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ قَالُوا بَلَى‏.‏ قَالَ ‏\"‏ أَفَلَمْ تَرْضَوْا أَنْ تَكُونُوا ثُلُثَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ قَالُوا بَلَى‏.‏ قَالَ ‏\"‏ فَوَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ، إِنِّي لأَرْجُو أَنْ تَكُونُوا نِصْفَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏",
    "malay_translation": "Ketika Rasulullah SAW sedang duduk bersandar kepada khemah kulit Yaman, baginda berkata kepada para sahabat baginda, \"Adakah kamu semua redha jika menjadi seperempat daripada ahli syurga?\" Mereka menjawab, \"Ya.\" Baginda berkata, \"Adakah kamu semua tidak redha jika menjadi sepertiga daripada ahli syurga?\" Mereka menjawab, \"Ya.\" Baginda berkata, \"Demi Allah yang memegang jiwa Muhammad, aku berharap kamu semua akan menjadi separuh daripada ahli syurga.\""
  },
  {
    "id": 6401,
    "hadith_number": 6401,
    "tajuk_hadith": "Keutamaan Surah Al-Ikhlas",
    "perawi_melayu": "Riwayat Abu Sa`id Al-Khudri:",
    "english_text": "A man heard another man reciting: Surat-ul-Ikhlas (The Unity) 'Say: He is Allah, the One (112) and \nhe was repeating it. The next morning he came to Allah's Messenger (ﷺ) and mentioned the whole story to \nhim as if he regarded the recitation of that Sura as insufficient On that, Allah's Messenger (ﷺ) said, \"By Him \nin Whose Hand my soul is! That (Sura No. 112) equals one-third of the Qur'an.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ، أَنَّ رَجُلاً، سَمِعَ رَجُلاً، يَقْرَأُ ‏{‏قُلْ هُوَ اللَّهُ أَحَدٌ‏}‏ يُرَدِّدُهَا، فَلَمَّا أَصْبَحَ جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ ذَلِكَ لَهُ، وَكَأَنَّ الرَّجُلَ يَتَقَالُّهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّهَا لَتَعْدِلُ ثُلُثَ الْقُرْآنِ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Maslamah, dari Malik, dari Abdurrahman bin Abdullah bin Abdurrahman, dari bapanya, dari Abu Said, bahawa seorang lelaki mendengar seorang lelaki yang lain membaca Surah Al-Ikhlas, {قُلْ هُوَ اللَّهُ أَحَدٌ} dan mengulang-ulanginya.  Maka apabila pagi tiba, dia datang kepada Rasulullah ﷺ dan menceritakan hal itu kepadanya, seolah-olah lelaki itu menganggap bacaan surah tersebut sebagai bacaan yang kurang. Maka Rasulullah ﷺ bersabda: \"Demi Zat yang jiwaku berada di tangan-Nya, sesungguhnya surah ini (Surah Al-Ikhlas) sama nilainya dengan sepertiga Al-Quran.\""
  },
  {
    "id": 6402,
    "hadith_number": 6402,
    "tajuk_hadith": "Kesempurnaan Ruku dan Sujud",
    "perawi_melayu": "Anas bin Malik",
    "english_text": "I heard the Prophet (ﷺ) saying, \"Perform the bowing and the prostration properly (with peace of mind), \nfor, by Him in Whose Hand my soul is, I see you from behind my back when you bow and when you \nprostrate.\"",
    "arabic_text": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا حَبَّانُ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ أَتِمُّوا الرُّكُوعَ وَالسُّجُودَ، فَوَالَّذِي نَفْسِي بِيَدِهِ إِنِّي لأَرَاكُمْ مِنْ بَعْدِ ظَهْرِي إِذَا مَا رَكَعْتُمْ وَإِذَا مَا سَجَدْتُمْ ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Nabi ﷺ bersabda: \" Sempurnakanlah rukuk dan sujud kamu. Demi Zat yang jiwaku berada di tangan-Nya, sesungguhnya Aku melihat kamu dari belakangku ketika kamu rukuk dan ketika kamu sujud.\""
  },
  {
    "id": 6403,
    "hadith_number": 6403,
    "tajuk_hadith": "Kecintaan Nabi SAW kepada Wanita Ansar",
    "perawi_melayu": "Riwayat Anas bin Malik:",
    "english_text": "An Ansari woman came to the Prophet (ﷺ) in the company of her children, and the Prophet (ﷺ) said to her, \n\"By Him in Whose Hand my soul is, you are the most beloved people to me!\" And he repeated the \nstatement thrice.",
    "arabic_text": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، أَخْبَرَنَا شُعْبَةُ، عَنْ هِشَامِ بْنِ زَيْدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ امْرَأَةً، مِنَ الأَنْصَارِ أَتَتِ النَّبِيَّ صلى الله عليه وسلم مَعَهَا أَوْلاَدٌ لَهَا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّكُمْ لأَحَبُّ النَّاسِ إِلَىَّ ‏\"‏‏.‏ قَالَهَا ثَلاَثَ مِرَارٍ‏.‏",
    "malay_translation": "Seorang wanita Ansar datang kepada Nabi SAW bersama anak-anaknya.  Nabi SAW bersabda kepadanya, \"Demi Zat yang jiwaku berada di tangan-Nya, sesungguhnya kamu adalah orang yang paling aku cintai!\" Baginda mengulang sabdanya itu sebanyak tiga kali."
  },
  {
    "id": 6404,
    "hadith_number": 6404,
    "tajuk_hadith": "Larangan Bersumpah dengan Nama Bapa",
    "perawi_melayu": "Riwayat Ibnu Umar",
    "english_text": "Allah's Messenger (ﷺ) met `Umar bin Al-Khattab while the latter was going with a group of camel-riders, and he was swearing by his father. The Prophet (ﷺ) said, \"Lo! Allah forbids you to swear by your fathers, so whoever has to take an oath, he should swear by Allah or keep quiet.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَدْرَكَ عُمَرَ بْنَ الْخَطَّابِ وَهْوَ يَسِيرُ فِي رَكْبٍ يَحْلِفُ بِأَبِيهِ فَقَالَ ‏\n\"‏ أَلاَ إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ، مَنْ كَانَ حَالِفًا فَلْيَحْلِفْ بِاللَّهِ، أَوْ لِيَصْمُتْ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bertemu Umar bin al-Khattab ketika beliau sedang dalam perjalanan bersama sekumpulan penunggang unta, dan beliau bersumpah dengan nama bapanya.  Rasulullah SAW bersabda, \"Ketahuilah, sesungguhnya Allah melarang kamu bersumpah dengan nama bapa-bapa kamu.  Barangsiapa yang hendak bersumpah, hendaklah bersumpah dengan nama Allah, atau diam.\" "
  },
  {
    "id": 6405,
    "hadith_number": 6405,
    "tajuk_hadith": "Larangan Bersumpah dengan Nama Bapa",
    "perawi_melayu": "Riwayat Ibnu Umar",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ قَالَ سَالِمٌ قَالَ ابْنُ عُمَرَ سَمِعْتُ عُمَرَ، يَقُولُ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ ‏\"‏‏.‏ قَالَ عُمَرُ فَوَاللَّهِ مَا حَلَفْتُ بِهَا مُنْذُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم ذَاكِرًا وَلاَ آثِرًا‏.‏ قَالَ مُجَاهِدٌ ‏{‏أَوْ أَثَرَةٍ مِنْ عِلْمٍ‏}‏ يَأْثُرُ عِلْمًا‏.‏ تَابَعَهُ عُقَيْلٌ وَالزُّبَيْدِيُّ وَإِسْحَاقُ الْكَلْبِيُّ عَنِ الزُّهْرِيِّ‏.‏ وَقَالَ ابْنُ عُيَيْنَةَ وَمَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ سَالِمٍ عَنِ ابْنِ عُمَرَ سَمِعَ النَّبِيُّ صلى الله عليه وسلم عُمَرَ‏.‏",
    "malay_translation": "Kami diberitakan oleh Said bin Ufair, yang diberitakan kepadanya oleh Ibnu Wahb, daripada Yunus, daripada Ibnu Syihab, katanya: Salim berkata, Ibnu Umar berkata: Aku mendengar Umar berkata: Rasulullah SAW bersabda kepadaku, \"Sesungguhnya Allah melarang kamu bersumpah dengan nama bapa-bapa kamu.\" Umar berkata: Demi Allah, aku tidak pernah bersumpah dengannya sejak aku mendengar sabda Nabi SAW itu, sama ada dengan sengaja mahupun secara tidak sengaja (mengulangi sumpah orang lain)."
  },
  {
    "id": 6406,
    "hadith_number": 6406,
    "tajuk_hadith": "Larangan Bersumpah dengan Nama Bapa",
    "perawi_melayu": "Daripada Abdullah bin Umar",
    "english_text": "Allah's Messenger (ﷺ) said, \"Do not swear by your fathers.\"",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ قَالَ رَسُولُ اللَّهُ صلى الله عليه وسلم ‏\n\"‏ لاَ تَحْلِفُوا بِآبَائِكُمْ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Janganlah kamu bersumpah dengan nama bapa-bapa kamu.\""
  },
  {
    "id": 6407,
    "hadith_number": 6407,
    "tajuk_hadith": "Nazar dan Pilihan yang Lebih Baik",
    "perawi_melayu": "Riwayat Zahdam:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، وَالْقَاسِمِ التَّمِيمِيِّ، عَنْ زَهْدَمٍ، قَالَ كَانَ بَيْنَ هَذَا الْحَىِّ مِنْ جَرْمٍ وَبَيْنَ الأَشْعَرِيِّينَ وُدٌّ وَإِخَاءٌ، فَكُنَّا عِنْدَ أَبِي مُوسَى الأَشْعَرِيِّ، فَقُرِّبَ إِلَيْهِ طَعَامٌ فِيهِ لَحْمُ دَجَاجٍ وَعِنْدَهُ رَجُلٌ مِنْ بَنِي تَيْمِ اللَّهِ أَحْمَرُ كَأَنَّهُ مِنَ الْمَوَالِي، فَدَعَاهُ إِلَى الطَّعَامِ فَقَالَ إِنِّي رَأَيْتُهُ يَأْكُلُ شَيْئًا فَقَذِرْتُهُ، فَحَلَفْتُ أَنْ لاَ آكُلَهُ‏.‏ فَقَالَ قُمْ فَلأُحَدِّثَنَّكَ عَنْ ذَاكَ، إِنِّي أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي نَفَرٍ مِنَ الأَشْعَرِيِّينَ نَسْتَحْمِلُهُ فَقَالَ ‏\"‏ وَاللَّهِ لاَ أَحْمِلُكُمْ، وَمَا عِنْدِي مَا أَحْمِلُكُمْ ‏\"‏‏.‏ فَأُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِنَهْبِ إِبِلٍ فَسَأَلَ عَنَّا‏.‏ فَقَالَ ‏\"‏ أَيْنَ النَّفَرُ الأَشْعَرِيُّونَ ‏\"‏‏.‏ فَأَمَرَ لَنَا بِخَمْسِ ذَوْدٍ غُرِّ الذُّرَى، فَلَمَّا انْطَلَقْنَا قُلْنَا مَا صَنَعْنَا حَلَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم لاَ يَحْمِلُنَا وَمَا عِنْدَهُ مَا يَحْمِلُنَا ثُمَّ حَمَلَنَا، تَغَفَّلْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم يَمِينَهُ، وَاللَّهِ لاَ نُفْلِحُ أَبَدًا، فَرَجَعْنَا إِلَيْهِ فَقُلْنَا لَهُ إِنَّا أَتَيْنَاكَ لِتَحْمِلَنَا فَحَلَفْتَ أَنْ لاَ تَحْمِلَنَا، وَمَا عِنْدَكَ مَا تَحْمِلُنَا‏.‏ فَقَالَ ‏\"‏ إِنِّي لَسْتُ أَنَا حَمَلْتُكُمْ، وَلَكِنَّ اللَّهَ حَمَلَكُمْ، وَاللَّهِ لاَ أَحْلِفُ عَلَى يَمِينٍ فَأَرَى غَيْرَهَا خَيْرًا مِنْهَا، إِلاَّ أَتَيْتُ الَّذِي هُوَ خَيْرٌ وَتَحَلَّلْتُهَا ‏\"‏‏.‏",
    "malay_translation": "Kami telah diberitakan oleh Qotaibah, yang telah diberitakan kepadanya oleh Abd al-Wahhab, daripada Ayub, daripada Abi Qilabah dan al-Qasim al-Tamimi, daripada Zahdam.  Beliau berkata, “Terdapat hubungan persahabatan dan persaudaraan antara puak Jarm dan Asy’ariyin.  Kami berada di sisi Abu Musa al-Asy’ari, lalu dihidangkan makanan yang mengandungi daging ayam.  Di sana ada seorang lelaki dari Bani Taim Allah yang berkulit merah seakan-akan daripada kalangan hamba sahaya yang dimerdekakan. Abu Musa mempelawaknya makan. Lelaki itu berkata, “Aku pernah melihat ayam memakan benda-benda yang kotor, maka aku menganggapnya najis dan aku bersumpah bahawa aku tidak akan memakannya.”  Abu Musa berkata, “Bangunlah, aku akan ceritakan kepadamu tentang hal itu.  Sekumpulan daripada Asy’ariyin dan aku telah datang kepada Rasulullah ﷺ memohon kenderaan tunggangan, lalu Baginda berkata, ‘Demi Allah, aku tidak akan memberi kamu tunggangan, dan aku tidak mempunyai apa-apa untuk ditunggangi oleh kamu.’  Kemudian Rasulullah ﷺ diberi rampasan berupa unta, lalu Baginda bertanya tentang kami. Baginda bertanya, ‘Di mana puak Asy’ariyin?’  Lalu Baginda memerintahkan lima ekor unta yang bagus diberikan kepada kami.  Apabila kami telah berangkat, kami berkata, ‘Apakah yang telah kami lakukan? Rasulullah ﷺ telah bersumpah bahawa Baginda tidak akan memberi kami tunggangan, dan Baginda tidak mempunyai apa-apa untuk kami tunggang, tetapi kemudian Baginda memberi kami tunggangan. Adakah kami mengambil kesempatan daripada kelupaan Rasulullah ﷺ terhadap sumpahnya?  Demi Allah, kami tidak akan berjaya selama-lamanya.’  Maka kami kembali kepada Baginda dan berkata kepada Baginda, ‘Kami datang kepada Baginda untuk meminta kenderaan tunggangan, lalu Baginda bersumpah bahawa Baginda tidak akan memberi kami tunggangan, dan Baginda tidak mempunyai apa-apa untuk ditunggangi oleh kami.’  Baginda berkata, ‘Aku bukanlah yang memberi kamu tunggangan, tetapi Allah yang memberi kamu. Demi Allah, aku tidak akan bersumpah atas suatu sumpah, lalu aku dapati sesuatu yang lebih baik darinya, melainkan aku akan melakukan yang lebih baik itu dan aku akan menebus sumpahku.’” "
  },
  {
    "id": 6408,
    "hadith_number": 6408,
    "tajuk_hadith": "Sumpah dan Judi",
    "perawi_melayu": "Riwayat Abu Hurairah",
    "english_text": "The Prophet (ﷺ) said, \"Whoever swears saying in his oath. 'By Al-Lat and Al-`Uzza,' should say, 'None \nhas the right to be worshipped but Allah; and whoever says to his friend, 'Come, let me gamble with \nyou,' should give something in charity.\"",
    "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ حَلَفَ فَقَالَ فِي حَلِفِهِ بِاللاَّتِ وَالْعُزَّى‏.‏ فَلْيَقُلْ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ وَمَنْ قَالَ لِصَاحِبِهِ تَعَالَ أُقَامِرْكَ‏.‏ فَلْيَتَصَدَّقْ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Barang siapa yang bersumpah dengan menyebut Al-Lat dan Al-'Uzza, maka hendaklah dia berkata, 'Tiada Tuhan melainkan Allah.' Dan barang siapa yang berkata kepada sahabatnya, 'Marilah kita berjudi,' maka hendaklah dia bersedekah.\""
  },
  {
    "id": 6409,
    "hadith_number": 6409,
    "tajuk_hadith": "Rasulullah SAW Meletakkan Cincin Emas",
    "perawi_melayu": "Riwayat Ibn Umar:",
    "english_text": "Allah's Messenger (ﷺ) had a gold ring made for himself, and he used to wear it with the stone towards the \ninner part of his hand. Consequently, the people had similar rings made for themselves. Afterwards \nthe Prophet; sat on the pulpit and took it off, saying, \"I used to wear this ring and keep its stone \ntowards the palm of my hand.\" He then threw it away and said, \"By Allah, I will never wear it.\" \nTherefore all the people threw away their rings as well.",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اصْطَنَعَ خَاتَمًا مِنْ ذَهَبٍ وَكَانَ يَلْبَسُهُ، فَيَجْعَلُ فَصَّهُ فِي بَاطِنِ كَفِّهِ، فَصَنَعَ النَّاسُ خَوَاتِيمَ ثُمَّ إِنَّهُ جَلَسَ عَلَى الْمِنْبَرِ فَنَزَعَهُ، فَقَالَ ‏\"‏ إِنِّي كُنْتُ أَلْبَسُ هَذَا الْخَاتِمَ وَأَجْعَلُ فَصَّهُ مِنْ دَاخِلٍ ‏\"‏‏.‏ فَرَمَى بِهِ ثُمَّ قَالَ ‏\"‏ وَاللَّهِ لاَ أَلْبَسُهُ أَبَدًا ‏\"‏‏.‏ فَنَبَذَ النَّاسُ خَوَاتِيمَهُمْ‏.‏",
    "malay_translation": "Rasulullah SAW telah membuat sebuah cincin emas untuk dirinya sendiri, dan baginda memakainya dengan batu permata menghadap ke bahagian dalam tapak tangan.  Akibatnya, orang ramai pun membuat cincin yang serupa. Kemudian, baginda duduk di atas mimbar dan menanggalkan cincin itu, sambil bersabda, “Aku pernah memakai cincin ini dan meletakkan batu permatanya menghadap ke tapak tangan.”  Kemudian baginda membuangnya dan bersabda, “Demi Allah, aku tidak akan memakainya lagi.”  Oleh itu, semua orang pun membuang cincin mereka."
  },
  {
    "id": 6410,
    "hadith_number": 6410,
    "tajuk_hadith": "Sumpah, Bunuh Diri, Mencaci, dan Menuduh Kafir",
    "perawi_melayu": "Riwayat Thabit bin Ad-Dahhak:",
    "english_text": "The Prophet (ﷺ) said, \"Whoever swears by a religion other than Islam, is, as he says; and whoever \ncommits suicide with something, will be punished with the same thing in the (Hell) Fire; and cursing a \nbeliever is like murdering him; and whoever accuses a believer of disbelief, then it is as if he had \nkilled him.\"",
    "arabic_text": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا وُهَيْبٌ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ ثَابِتِ بْنِ الضَّحَّاكِ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَنْ حَلَفَ بِغَيْرِ مِلَّةِ الإِسْلاَمِ فَهْوَ كَمَا قَالَ ـ قَالَ ـ وَمَنْ قَتَلَ نَفْسَهُ بِشَىْءٍ عُذِّبَ بِهِ فِي نَارِ جَهَنَّمَ، وَلَعْنُ الْمُؤْمِنِ كَقَتْلِهِ، وَمَنْ رَمَى مُؤْمِنًا بِكُفْرٍ فَهْوَ كَقَتْلِهِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Barangsiapa bersumpah dengan selain agama Islam, maka dia seperti apa yang telah diucapkannya. Dan barangsiapa membunuh dirinya sendiri dengan sesuatu, maka dia akan di azab dengan azab yang sama di dalam neraka Jahannam. Dan melaknat seorang mukmin adalah seperti membunuhnya, dan barangsiapa menuduh seorang mukmin dengan kekufuran, maka ia seperti membunuhnya.\""
  },
  {
    "id": 6411,
    "hadith_number": 6411,
    "tajuk_hadith": "Ujian Allah ke atas Tiga Orang Bani Israel",
    "perawi_melayu": "Abu Hurairah",
    "english_text": "",
    "arabic_text": "وَقَالَ عَمْرُو بْنُ عَاصِمٍ حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا إِسْحَاقُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَمْرَةَ، أَنَّ أَبَا هُرَيْرَةَ، حَدَّثَهُ أَنَّهُ، سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ ثَلاَثَةً فِي بَنِي إِسْرَائِيلَ أَرَادَ اللَّهُ أَنْ يَبْتَلِيَهُمْ، فَبَعَثَ مَلَكًا فَأَتَى الأَبْرَصَ فَقَالَ تَقَطَّعَتْ بِي الْحِبَالُ، فَلاَ بَلاَغَ لِي إِلاَّ بِاللَّهِ، ثُمَّ بِكَ ‏\"‏‏.‏ فَذَكَرَ الْحَدِيثَ‏.‏",
    "malay_translation": "Amru bin Aasim berkata, “Hammām telah meriwayatkan kepada kami, Ishaq bin Abdullah telah meriwayatkan kepada kami, Abdur Rahman bin Abi ‘Amrah telah meriwayatkan kepada kami bahawa Abu Hurairah telah meriwayatkan kepadanya bahawa dia telah mendengar Nabi SAW bersabda:  \"Sesungguhnya Allah SWT berkehendak menguji tiga orang daripada Bani Israel. Maka Allah SWT telah mengutus seorang malaikat. Malaikat itu datang kepada orang yang berpenyakit kusta lalu berkata: ‘Aku seorang musafir yang telah putus bekal dan aku tidak mempunyai sesiapa yang dapat menolongku melainkan Allah SWT, kemudian engkau.’ Kemudian Abu Hurairah menyebut keseluruhan riwayat.”"
  },
  {
    "id": 6412,
    "hadith_number": 6412,
    "tajuk_hadith": "Menolong Memenuhi Sumpah",
    "perawi_melayu": "Daripada Al-Bara' رضي الله عنه",
    "english_text": "The Prophet (ﷺ) ordered us to help others to fulfill the oaths.",
    "arabic_text": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ أَشْعَثَ، عَنْ مُعَاوِيَةَ بْنِ سُوَيْدِ بْنِ مُقَرِّنٍ، عَنِ الْبَرَاءِ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَحَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَشْعَثَ، عَنْ مُعَاوِيَةَ بْنِ سُوَيْدِ بْنِ مُقَرِّنٍ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ أَمَرَنَا النَّبِيُّ صلى الله عليه وسلم بِإِبْرَارِ الْمُقْسِمِ‏.‏",
    "malay_translation": "Daripada Al-Bara’ رضي الله عنه, beliau berkata: Nabi ﷺ memerintahkan kami untuk membantu orang lain menunaikan sumpah mereka."
  },
  {
    "id": 6413,
    "hadith_number": 6413,
    "tajuk_hadith": "Rahmat Allah SWT dan Kesabaran",
    "perawi_melayu": "Daripada Usama",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنَا عَاصِمٌ الأَحْوَلُ، سَمِعْتُ أَبَا عُثْمَانَ، يُحَدِّثُ عَنْ أُسَامَةَ، أَنَّ ابْنَةً لِرَسُولِ اللَّهِ، صلى الله عليه وسلم أَرْسَلَتْ إِلَيْهِ وَمَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم أُسَامَةُ بْنُ زَيْدٍ وَسَعْدٌ وَأُبَىٌّ أَنَّ ابْنِي قَدِ احْتُضِرَ فَاشْهَدْنَا‏.‏ فَأَرْسَلَ يَقْرَأُ السَّلاَمَ وَيَقُولُ ‏\"‏ إِنَّ لِلَّهِ مَا أَخَذَ وَمَا أَعْطَى وَكُلُّ شَىْءٍ عِنْدَهُ مُسَمًّى فَلْتَصْبِرْ وَتَحْتَسِبْ ‏\"‏‏.‏ فَأَرْسَلَتْ إِلَيْهِ تُقْسِمُ عَلَيْهِ، فَقَامَ وَقُمْنَا مَعَهُ، فَلَمَّا قَعَدَ رُفِعَ إِلَيْهِ، فَأَقْعَدَهُ فِي حَجْرِهِ وَنَفْسُ الصَّبِيِّ تَقَعْقَعُ، فَفَاضَتْ عَيْنَا رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ سَعْدٌ مَا هَذَا يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ هَذَا رَحْمَةٌ يَضَعُهَا اللَّهُ فِي قُلُوبِ مَنْ يَشَاءُ مِنْ عِبَادِهِ، وَإِنَّمَا يَرْحَمُ اللَّهُ مِنْ عِبَادِهِ الرُّحَمَاءَ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Hafs bin Umar, telah menceritakan kepada kami Syu’bah, telah memberitakan kepada kami Asim al-Ahwal, aku mendengar Abu Usman menceritakan daripada Usama bahawa anak perempuan Rasulullah SAW telah menghantar utusan kepada Baginda, dan bersama Rasulullah SAW ketika itu ialah Usamah bin Zaid, Saad dan Ubai bahawa anaknya hampir meninggal dunia, maka saksikanlah kami.  Maka Baginda menghantar utusan menyampaikan salam dan berkata, “Sesungguhnya milik Allah SWT apa yang diambil-Nya dan apa yang diberikan-Nya dan setiap sesuatu di sisi-Nya adalah ditetapkan tempohnya, maka hendaklah kamu bersabar dan berhusnuzon (dengan ganjaran Allah SWT).” Maka anak perempuan Baginda menghantar utusan lagi dengan bersumpah agar Baginda datang, maka Baginda bangun dan kami pun bangun bersama Baginda.  Setelah Baginda duduk, anak itu di bawa kepada Baginda, maka Baginda mendudukannya di pangkuan Baginda sementara nafas anak itu tersengal-sengal. Maka mengalirlah air mata Rasulullah SAW.  Saad bertanya, “Apakah ini ya Rasulullah?” Baginda menjawab, “Ini adalah rahmat yang Allah SWT letakkan di dalam hati sesiapa yang dikehendaki-Nya daripada hamba-hamba-Nya, dan sesungguhnya Allah SWT hanya akan merahmati daripada hamba-hamba-Nya mereka yang penyayang (kepada orang lain).”"
  },
  {
    "id": 6414,
    "hadith_number": 6414,
    "tajuk_hadith": "Anak yang Meninggal Dunia dan Neraka",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "Allah's Messenger (ﷺ) said, \"Any Muslim who has lost three of his children will not be touched by the Fire \nexcept that which will render Allah's oath fulfilled.\"",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَمُوتُ لأَحَدٍ مِنَ الْمُسْلِمِينَ ثَلاَثَةٌ مِنَ الْوَلَدِ، تَمَسُّهُ النَّارُ، إِلاَّ تَحِلَّةَ الْقَسَمِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Tidak akan disentuh api neraka bagi seorang Muslim yang telah kehilangan tiga orang anaknya, kecuali disebabkan sumpah Allah SWT.\""
  },
  {
    "id": 6415,
    "hadith_number": 6415,
    "tajuk_hadith": "Ahli Syurga dan Ahli Neraka",
    "perawi_melayu": "Daripada Harithah bin Wahb:",
    "english_text": "I heard the Prophet (ﷺ) saying, \"Shall I tell you of the people of Paradise? They comprise every poor \nhumble person, and if he swears by Allah to do something, Allah will fulfill it; while the people of the \nfire comprise every violent, cruel arrogant person.\"",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ مَعْبَدِ بْنِ خَالِدٍ، سَمِعْتُ حَارِثَةَ بْنَ وَهْبٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ أَلاَ أَدُلُّكُمْ عَلَى أَهْلِ الْجَنَّةِ، كُلُّ ضَعِيفٍ مُتَضَعَّفٍ، لَوْ أَقْسَمَ عَلَى اللَّهِ لأَبَرَّهُ، وَأَهْلِ النَّارِ كُلُّ جَوَّاظٍ عُتُلٍّ مُسْتَكْبِرٍ ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda: \"Inginkah aku tunjukkan kepada kamu akan ahli syurga? Mereka terdiri daripada setiap orang yang lemah dan hina, sekiranya dia bersumpah dengan nama Allah untuk melakukan sesuatu, nescaya Allah akan mengabulkannya.  Dan ahli neraka pula terdiri daripada setiap orang yang zalim, kejam dan sombong.\""
  },
  {
    "id": 6416,
    "hadith_number": 6416,
    "tajuk_hadith": "Generasi Terbaik Ummat",
    "perawi_melayu": "Riwayat Abdullah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا سَعْدُ بْنُ حَفْصٍ، حَدَّثَنَا شَيْبَانُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَبِيدَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ سُئِلَ النَّبِيُّ صلى الله عليه وسلم أَىُّ النَّاسِ خَيْرٌ قَالَ ‏\n\"‏ قَرْنِي، ثُمَّ الَّذِينَ يَلُونَهُمْ، ثُمَّ الَّذِينَ يَلُونَهُمْ، ثُمَّ يَجِيءُ قَوْمٌ تَسْبِقُ شَهَادَةُ أَحَدِهِمْ يَمِينَهُ، وَيَمِينُهُ شَهَادَتَهُ ‏\"‏‏.‏ قَالَ إِبْرَاهِيمُ وَكَانَ أَصْحَابُنَا يَنْهَوْنَا وَنَحْنُ غِلْمَانٌ أَنْ نَحْلِفَ بِالشَّهَادَةِ وَالْعَهْدِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Sa'ad bin Hafsh, telah menceritakan kepada kami Syaiban, dari Mansur, dari Ibrahim, dari Ubaidah, dari Abdullah, katanya: Nabi ﷺ ditanya, \"Siapakah manusia yang terbaik?\" Baginda menjawab: \"Generasi ku, kemudian generasi yang mengikutinya, kemudian generasi yang mengikutinya. Kemudian akan datang suatu kaum yang sumpah seseorang mendahului kesaksiannya, dan kesaksiannya mendahului sumpahnya.\" Ibrahim berkata: \"Ketika kami masih muda, sahabat-sahabat kami melarang kami bersumpah dengan berkata: 'Aku bersaksi dengan bersumpah demi Allah atau dengan perjanjian Allah.'"
  },
  {
    "id": 6417,
    "hadith_number": 6417,
    "tajuk_hadith": "Sumpah Palsu untuk Mendapatkan Harta",
    "perawi_melayu": "Riwayat Abdullah",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، وَمَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ حَلَفَ عَلَى يَمِينٍ كَاذِبَةٍ، لِيَقْتَطِعَ بِهَا مَالَ رَجُلٍ مُسْلِمٍ أَوْ قَالَ أَخِيهِ لَقِيَ اللَّهَ وَهْوَ عَلَيْهِ غَضْبَانُ ‏\"‏‏.‏ فَأَنْزَلَ اللَّهُ تَصْدِيقَهُ ‏{‏إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ‏}‏  \nقَالَ سُلَيْمَانُ فِي حَدِيثِهِ فَمَرَّ الأَشْعَثُ بْنُ قَيْسٍ فَقَالَ مَا يُحَدِّثُكُمْ عَبْدُ اللَّهِ قَالُوا لَهُ فَقَالَ الأَشْعَثُ نَزَلَتْ فِيَّ، وَفِي صَاحِبٍ لِي، فِي بِئْرٍ كَانَتْ بَيْنَنَا‏.‏",
    "malay_translation": "Telah menceritakan kepadaku Muhammad bin Bashar, telah menceritakan kepada kami Ibnu Abi ‘Adiy, dari Syu’bah, dari Sulaiman dan Manshur, dari Abi Wa’il, dari Abdullah r.a., dari Nabi SAW, baginda bersabda:  \"Barangsiapa bersumpah palsu untuk merampas harta seorang Muslim, atau saudaranya, maka dia akan menemui Allah SWT dalam keadaan murkaNya.\"  Kemudian Allah SWT menurunkan ayat sebagai pengesahannya:  {Sesungguhnya orang-orang yang membeli janji Allah…}  Sulaiman berkata dalam hadisnya, lalu berlalu Al-Asy’ats bin Qais, lalu dia bertanya: Apakah yang diceritakan oleh Abdullah kepada kamu? Mereka menjawab, lalu Al-Asy’ats berkata: Ayat itu diturunkan kepadaku dan kepada temanku, mengenai sebuah perigi yang menjadi perselisihan di antara kami."
  },
  {
    "id": 6418,
    "hadith_number": 6418,
    "tajuk_hadith": "Neraka Jahanam dan Kekuasaan Allah",
    "perawi_melayu": "Anas bin Malik meriwayatkan:",
    "english_text": "The Prophet (ﷺ) said, \"The Hell Fire will keep on saying: 'Are there anymore (people to come)?' Till the \nLord of Power and Honor will put His Foot over it and then it will say, 'Qat! Qat! (sufficient! \nsufficient!) by Your Power and Honor. And its various sides will come close to each other (i.e., it will \ncontract). \"",
    "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شَيْبَانُ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ تَزَالُ جَهَنَّمُ تَقُولُ هَلْ مِنْ مَزِيدٍ حَتَّى يَضَعَ رَبُّ الْعِزَّةِ فِيهَا قَدَمَهُ فَتَقُولُ قَطْ قَطْ وَعِزَّتِكَ‏.‏ وَيُزْوَى بَعْضُهَا إِلَى بَعْضٍ ‏\"‏‏.‏ رَوَاهُ شُعْبَةُ عَنْ قَتَادَةَ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Neraka Jahanam sentiasa berkata: 'Adakah lagi (orang yang akan datang)?' Sehingga Tuhan Yang Maha Berkuasa dan Mulia meletakkan kaki-Nya ke atasnya, maka ia akan berkata, 'Cukup! Cukup! Demi kemuliaan-Mu!' Dan bahagian-bahagiannya akan saling mendekat (iaitu, ia akan mengecut).\""
  },
  {
    "id": 6419,
    "hadith_number": 6419,
    "tajuk_hadith": "Kisah Fitnah terhadap Aisyah dan Pembelaan Rasulullah SAW",
    "perawi_melayu": "Daripada Az-Zuhri:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الأُوَيْسِيُّ، حَدَّثَنَا إِبْرَاهِيمُ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، ح وَحَدَّثَنَا حَجَّاجٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ النُّمَيْرِيُّ، حَدَّثَنَا يُونُسُ، قَالَ سَمِعْتُ الزُّهْرِيَّ، قَالَ سَمِعْتُ عُرْوَةَ بْنَ الزُّبَيْرِ، وَسَعِيدَ بْنَ الْمُسَيَّبِ، وَعَلْقَمَةَ بْنَ وَقَّاصٍ، وَعُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ، عَنْ حَدِيثِ، عَائِشَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم حِينَ قَالَ لَهَا أَهْلُ الإِفْكِ مَا قَالُوا، فَبَرَّأَهَا اللَّهُ، وَكُلٌّ حَدَّثَنِي طَائِفَةً مِنَ الْحَدِيثِ ـ فَقَامَ النَّبِيُّ صلى الله عليه وسلم فَاسْتَعْذَرَ مِنْ عَبْدِ اللَّهِ بْنِ أُبَىٍّ، فَقَامَ أُسَيْدُ بْنُ حُضَيْرٍ فَقَالَ لِسَعْدِ بْنِ عُبَادَةَ لَعَمْرُ اللَّهِ لَنَقْتُلَنَّهُ‏.‏",
    "malay_translation": "Kami telah diberitakan oleh Al-Uwaisi, yang telah diberitakan kepadanya oleh Ibrahim, daripada Saleh, daripada Ibnu Syihab. Dan kami telah diberitakan oleh Hajjaj, yang telah diberitakan kepadanya oleh Abdullah bin Umar An-Numairi, yang telah diberitakan kepadanya oleh Yunus, katanya: Aku telah mendengar Az- Zuhri berkata: Aku telah mendengar Urwah bin Az- Zubair, Said bin Al-Musayyab, Al-Aqamah bin Waqqas dan Ubaidullah bin Abdullah, daripada hadis Aisyah, isteri Nabi SAW, ketika orang-orang yang menuduhnya dengan tuduhan palsu telah berkata kepadanya apa yang mereka katakan, lalu Allah membersihkannya (daripada tuduhan itu). Dan setiap seorang daripada mereka telah menceritakan kepadaku sebahagian daripada hadis itu. Maka Nabi SAW berdiri lalu memohon perlindungan daripada Abdullah bin Ubayy. Maka berdirilah Usayd bin Hudhair lalu berkata kepada Saad bin Ubadah: Demi Allah, nescaya kami akan membunuhnya."
  },
  {
    "id": 6420,
    "hadith_number": 6420,
    "tajuk_hadith": "Sumpah Tidak Sengaja",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "regarding: 'Allah will not call you to account for that which is unintentional in your oaths...' (2.225) \nThis Verse was revealed concerning such oath formulas as: 'No, by Allah!' and 'Yes, by Allah!' \nsomething against his oath due to forgetfulness should he make expiation?). And the Statement of \nAllah: 'And there is no blame on you if you make a mistake therein.' (33.5) And Allah said:-- '(Moses \nsaid to Khadir): Call me not to account for what I forgot.' (18.73)",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ‏{‏لاَ يُؤَاخِذُكُمُ اللَّهُ بِاللَّغْوِ‏}‏ قَالَ قَالَتْ أُنْزِلَتْ فِي قَوْلِهِ لاَ، وَاللَّهِ بَلَى وَاللَّهِ‏.‏",
    "malay_translation": "Daripada Muhammad bin Muthanna, telah meriwayatkan kepada kami Yahya, daripada Hisyam, katanya: “Bapaku telah memberitahu aku daripada Aisyah r.a bahawa ayat: {لَا يُؤَاخِذُكُمُ اللهُ بِاللَّغْوِ} diturunkan berkenaan dengan ucapan: ‘Tidak, demi Allah!’ dan ‘Ya, demi Allah!’  Aisyah berkata: Ayat ini diturunkan berkaitan dengan sumpah yang tidak disengajakan.  Allah SWT berfirman:  ‘Dan tidak ada kesalahan ke atas kamu sekiranya kamu tersilap di dalamnya.’ (Surah Al-Ahzab 33:5) Dan Allah SWT juga berfirman:  ‘(Musa berkata kepada Khidir): Janganlah engkau meminta pertanggungjawaban aku terhadap apa yang telah aku lupakan.’ (Surah Al-Kahfi 18:73)"
  },
  {
    "id": 6421,
    "hadith_number": 6421,
    "tajuk_hadith": "Pengampunan Allah SWT terhadap Bisikan Jahat",
    "perawi_melayu": "Dari Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \"Allah forgives my followers those (evil deeds) their souls may whisper or suggest to them as long as they do not act (on it) or speak.\"",
    "arabic_text": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، حَدَّثَنَا مِسْعَرٌ، حَدَّثَنَا قَتَادَةُ، حَدَّثَنَا زُرَارَةُ بْنُ أَوْفَى، عَنْ أَبِي هُرَيْرَةَ، يَرْفَعُهُ قَالَ ‏\n\"‏ إِنَّ اللَّهَ تَجَاوَزَ لأُمَّتِي عَمَّا وَسْوَسَتْ أَوْ حَدَّثَتْ بِهِ أَنْفُسَهَا، مَا لَمْ تَعْمَلْ بِهِ أَوْ تَكَلَّمْ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Sesungguhnya Allah SWT mengampunkan umatku dari apa yang dibisikkan atau dicadangkan oleh hati mereka sendiri, selagi mereka tidak melakukannya atau menyebutkannya.\""
  },
  {
    "id": 6422,
    "hadith_number": 6422,
    "tajuk_hadith": "Kebebasan Beramal Pada Hari Raya Haji",
    "perawi_melayu": "Riwayat Abdullah bin Amr bin Al-As",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ الْهَيْثَمِ، أَوْ مُحَمَّدٌ عَنْهُ عَنِ ابْنِ جُرَيْجٍ، قَالَ سَمِعْتُ ابْنَ شِهَابٍ، يَقُولُ حَدَّثَنِي عِيسَى بْنُ طَلْحَةَ، أَنَّ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ، حَدَّثَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم بَيْنَمَا هُوَ يَخْطُبُ يَوْمَ النَّحْرِ إِذْ قَامَ إِلَيْهِ رَجُلٌ فَقَالَ كُنْتُ أَحْسِبُ يَا رَسُولَ اللَّهِ كَذَا وَكَذَا قَبْلَ كَذَا وَكَذَا‏.‏ ثُمَّ قَامَ آخَرُ فَقَالَ يَا رَسُولَ اللَّهِ كُنْتُ أَحْسِبُ كَذَا وَكَذَا لِهَؤُلاَءِ الثَّلاَثِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ افْعَلْ وَلاَ حَرَجَ ‏\"‏ لَهُنَّ كُلِّهِنَّ يَوْمَئِذٍ، فَمَا سُئِلَ يَوْمَئِذٍ عَنْ شَىْءٍ إِلاَّ قَالَ ‏\"‏ افْعَلْ وَلاَ حَرَجَ ‏\"‏‏.‏",
    "malay_translation": "Kami diberitakan oleh Usman bin Al-Haytham, atau Muhammad daripada baginda, daripada Ibnu Juraij, katanya, aku mendengar Ibnu Syihab berkata, Isa bin Thalhah telah memberitakan kepadaku bahawa Abdullah bin Amr bin Al-As telah memberitakan kepadanya bahawa Nabi SAW ketika sedang menyampaikan khutbah pada Hari Raya Haji, tiba-tiba seorang lelaki bangun lalu berkata, \"Wahai Rasulullah, saya menyangka begini dan begitu sebelum begini dan begitu.\" Kemudian, seorang lagi bangun dan berkata, \"Wahai Rasulullah, saya menyangka begini dan begitu untuk ketiga-tiga perkara ini.\"  Maka Nabi SAW bersabda, \"Buatlah, tiada halangan,\" kepada semua perkara itu pada hari itu.  Maka pada hari itu, apa sahaja yang ditanyakan kepada baginda, Baginda SAW bersabda, \"Buatlah, tiada halangan.\" "
  },
  {
    "id": 6423,
    "hadith_number": 6423,
    "tajuk_hadith": "Tiada Larangan Melakukan Tawaf, Mencukur Rambut, atau Menyembelih Sebelum Rami",
    "perawi_melayu": "Riwayat Ibnu Abbas:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا أَبُو بَكْرٍ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ رَجُلٌ لِلنَّبِيِّ صلى الله عليه وسلم زُرْتُ قَبْلَ أَنْ أَرْمِيَ‏.‏ قَالَ ‏\"‏ لاَ حَرَجَ ‏\"‏‏.‏ قَالَ آخَرُ حَلَقْتُ قَبْلَ أَنْ أَذْبَحَ‏.‏ قَالَ ‏\"‏ لاَ حَرَجَ ‏\"‏‏.‏ قَالَ آخَرُ ذَبَحْتُ قَبْلَ أَنْ أَرْمِيَ‏.‏ قَالَ ‏\"‏ لاَ حَرَجَ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Yunus, telah menceritakan kepada kami Abu Bakar, dari Abdul Aziz bin Rufaie', dari Ata', dari Ibnu Abbas r.a., bahawa seorang lelaki berkata kepada Nabi SAW ketika beliau menyampaikan khutbah pada hari Nahr, \"Saya telah melakukan tawaf di Kaabah sebelum melontar jamrah.\" Nabi SAW bersabda, \"Tiada apa-apa halangan.\" Lelaki lain berkata, \"Saya telah mencukur kepala saya sebelum menyembelih korban.\" Nabi SAW bersabda, \"Tiada apa-apa halangan.\" Lelaki yang ketiga berkata, \"Saya telah menyembelih korban sebelum melontar jamrah.\" Nabi SAW bersabda, \"Tiada apa-apa halangan.\""
  },
  {
    "id": 6424,
    "hadith_number": 6424,
    "tajuk_hadith": "Cara Solat yang Benar",
    "perawi_melayu": "Riwayat Abu Hurairah",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً، دَخَلَ الْمَسْجِدَ يُصَلِّي وَرَسُولُ اللَّهِ صلى الله عليه وسلم فِي نَاحِيَةِ الْمَسْجِدِ، فَجَاءَ فَسَلَّمَ عَلَيْهِ فَقَالَ لَهُ ‏\"‏ ارْجِعْ فَصَلِّ، فَإِنَّكَ لَمْ تُصَلِّ ‏\"‏‏.‏ فَرَجَعَ فَصَلَّى، ثُمَّ سَلَّمَ فَقَالَ ‏\"‏ وَعَلَيْكَ، ارْجِعْ فَصَلِّ، فَإِنَّكَ لَمْ تُصَلِّ ‏\"‏‏.‏ قَالَ فِي الثَّالِثَةِ فَأَعْلِمْنِي‏.‏ قَالَ ‏\"‏ إِذَا قُمْتَ إِلَى الصَّلاَةِ فَأَسْبِغِ الْوُضُوءَ، ثُمَّ اسْتَقْبِلِ الْقِبْلَةَ فَكَبِّرْ، وَاقْرَأْ بِمَا تَيَسَّرَ مَعَكَ مِنَ الْقُرْآنِ، ثُمَّ ارْكَعْ حَتَّى تَطْمَئِنَّ رَاكِعًا، ثُمَّ ارْفَعْ رَأْسَكَ حَتَّى تَعْتَدِلَ قَائِمًا، ثُمَّ اسْجُدْ حَتَّى تَطْمَئِنَّ، سَاجِدًا ثُمَّ ارْفَعْ حَتَّى تَسْتَوِيَ وَتَطْمَئِنَّ جَالِسًا، ثُمَّ اسْجُدْ حَتَّى تَطْمَئِنَّ سَاجِدًا، ثُمَّ ارْفَعْ حَتَّى تَسْتَوِيَ قَائِمًا، ثُمَّ افْعَلْ ذَلِكَ فِي صَلاَتِكَ كُلِّهَا ‏\"‏‏.‏",
    "malay_translation": "Seorang lelaki masuk masjid dan mula menunaikan solat ketika Rasulullah SAW berada di suatu sudut masjid.  Kemudian (selepas selesai solat), lelaki itu menghampiri Nabi SAW dan memberi salam. Nabi SAW bersabda kepadanya, \"Kembali dan solatlah, kerana kamu belum menunaikan solat.\" Lelaki itu kembali dan menunaikan solat, kemudian memberi salam. Nabi SAW membalas salamnya dan berkata, \"Kembali dan solatlah, kerana kamu belum menunaikan solat.\" Pada kali ketiga, lelaki itu berkata, \"Wahai Rasulullah SAW! Ajarkanlah saya (cara menunaikan solat).\" Nabi SAW bersabda, \"Apabila kamu bangun untuk menunaikan solat, sempurnakanlah wuduk, kemudian menghadap kiblat, lalu takbir (Allahu Akbar), dan bacalah apa yang mudah bagimu daripada al-Quran, kemudian rukuk sehingga kamu tenang dalam keadaan rukuk, kemudian angkat kepalamu sehingga kamu tegak berdiri, kemudian sujud sehingga kamu tenang dalam keadaan sujud, kemudian duduk sehingga kamu tenang dalam keadaan duduk, kemudian sujud lagi sehingga kamu tenang dalam keadaan sujud, kemudian bangun sehingga kamu tegak berdiri, kemudian lakukanlah semua itu dalam keseluruhan solatmu.\""
  },
  {
    "id": 6425,
    "hadith_number": 6425,
    "tajuk_hadith": "Kekalahan di Uhud dan Pengampunan Hudhaifah",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ هُزِمَ الْمُشْرِكُونَ يَوْمَ أُحُدٍ هَزِيمَةً تُعْرَفُ فِيهِمْ، فَصَرَخَ إِبْلِيسُ أَىْ عِبَادَ اللَّهِ أُخْرَاكُمْ، فَرَجَعَتْ أُولاَهُمْ فَاجْتَلَدَتْ هِيَ وَأُخْرَاهُمْ، فَنَظَرَ حُذَيْفَةُ بْنُ الْيَمَانِ فَإِذَا هُوَ بِأَبِيهِ فَقَالَ أَبِي أَبِي‏.‏ قَالَتْ فَوَاللَّهِ مَا انْحَجَزُوا حَتَّى قَتَلُوهُ، فَقَالَ حُذَيْفَةُ غَفَرَ اللَّهُ لَكُمْ‏.‏ قَالَ عُرْوَةُ فَوَاللَّهِ مَا زَالَتْ فِي حُذَيْفَةَ مِنْهَا بَقِيَّةٌ حَتَّى لَقِيَ اللَّهَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Farwah bin Abi al-Magrah, telah menceritakan kepada kami Ali bin Mushir, dari Hisyam bin Urwah, dari bapanya, dari Aisyah r.a., dia berkata: “Orang-orang musyrik dikalahkan pada hari Uhud dengan kekalahan yang nyata di kalangan mereka. Maka Iblis menjerit, “Wahai hamba-hamba Allah! Belakang kamu!” Maka barisan hadapan mereka berpatah balik lalu bertempur antara barisan hadapan dan barisan belakang. Hudzaifah bin al-Yaman melihat, maka dia mendapati bapanya, lalu dia berkata, “Bapa! Bapa!”  Dia (Aisyah) berkata, “Demi Allah! Mereka tidak berhenti sehingga membunuh bapanya.” Maka Hudzaifah berkata, “Semoga Allah mengampunkan kamu.” Urwah berkata, “Demi Allah!  Hudzaifah sentiasa memohon keampunan bagi pembunuh bapanya sehingga dia bertemu Allah (sehingga dia meninggal dunia).”"
  },
  {
    "id": 6426,
    "hadith_number": 6426,
    "tajuk_hadith": "Berbuka Puasa Secara Tidak Sengaja",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "The Prophet (ﷺ) said, \"If somebody eats something forgetfully while he is fasting, then he should \ncomplete his fast, for Allah has made him eat and drink.\"",
    "arabic_text": "حَدَّثَنِي يُوسُفُ بْنُ مُوسَى، حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ حَدَّثَنِي عَوْفٌ، عَنْ خِلاَسٍ، وَمُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَنْ أَكَلَ نَاسِيًا وَهْوَ صَائِمٌ فَلْيُتِمَّ صَوْمَهُ، فَإِنَّمَا أَطْعَمَهُ اللَّهُ وَسَقَاهُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Barangsiapa yang makan ketika berpuasa kerana lupa, maka hendaklah dia menyempurnakan puasanya.  Sesungguhnya Allah SWT yang memberi makan dan minum kepadanya.\""
  },
  {
    "id": 6427,
    "hadith_number": 6427,
    "tajuk_hadith": "Sujud Sahu Rasulullah SAW",
    "perawi_melayu": "Riwayat Abdullah bin Buhaina:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنِ الأَعْرَجِ، عَنْ عَبْدِ اللَّهِ ابْنِ بُحَيْنَةَ، قَالَ صَلَّى بِنَا النَّبِيُّ صلى الله عليه وسلم فَقَامَ فِي الرَّكْعَتَيْنِ الأُولَيَيْنِ قَبْلَ أَنْ يَجْلِسَ، فَمَضَى فِي صَلاَتِهِ، فَلَمَّا قَضَى صَلاَتَهُ انْتَظَرَ النَّاسُ تَسْلِيمَهُ، وَسَجَدَ قَبْلَ أَنْ يُسَلِّمَ، ثُمَّ رَفَعَ رَأْسَهُ، ثُمَّ كَبَّرَ وَسَجَدَ، ثُمَّ رَفَعَ رَأْسَهُ وَسَلَّمَ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Adam bin Abi Iyas, telah menceritakan kepada kami Ibnu Abi Dzib, dari Az Zuhri, dari Al A'raj, dari Abdullah bin Buhaina, dia berkata: Nabi SAW telah mengetuai solat kami, kemudian baginda berdiri ketika dua rakaat pertama sebelum duduk, lalu baginda meneruskan solatnya. Setelah selesai solatnya, manusia menunggu salam baginda, tetapi sebelum memberi salam, baginda bersujud (sujud sahu), kemudian mengangkat kepalanya, kemudian baginda bertakbir dan bersujud, kemudian mengangkat kepalanya dan memberi salam."
  },
  {
    "id": 6428,
    "hadith_number": 6428,
    "tajuk_hadith": "Solat Zuhur dan Dua Sujud",
    "perawi_melayu": "Riwayat Ibnu Mas'ud",
    "english_text": "",
    "arabic_text": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ، سَمِعَ عَبْدَ الْعَزِيزِ بْنَ عَبْدِ الصَّمَدِ، حَدَّثَنَا مَنْصُورٌ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنِ ابْنِ مَسْعُودٍ ـ رضى الله عنه أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم صَلَّى بِهِمْ صَلاَةَ الظُّهْرِ، فَزَادَ أَوْ نَقَصَ مِنْهَا ـ قَالَ مَنْصُورٌ لاَ أَدْرِي إِبْرَاهِيمُ وَهِمَ أَمْ عَلْقَمَةُ ـ قَالَ قِيلَ يَا رَسُولَ اللَّهِ أَقَصُرَتِ الصَّلاَةُ أَمْ نَسِيتَ قَالَ ‏\"‏ وَمَا ذَاكَ ‏\"‏‏.‏ قَالُوا صَلَّيْتَ كَذَا وَكَذَا‏.‏ قَالَ فَسَجَدَ بِهِمْ سَجْدَتَيْنِ ثُمَّ قَالَ ‏\"‏ هَاتَانِ السَّجْدَتَانِ لِمَنْ لاَ يَدْرِي، زَادَ فِي صَلاَتِهِ أَمْ نَقَصَ، فَيَتَحَرَّى الصَّوَابَ، فَيُتِمُّ مَا بَقِيَ، ثُمَّ يَسْجُدُ سَجْدَتَيْنِ ‏\"‏‏.‏",
    "malay_translation": "Aku telah diberitakan oleh Ishak bin Ibrahim, yang telah mendengar daripada Abdul Aziz bin Abdul Samad, yang telah meriwayatkan daripada Mansur, daripada Ibrahim, daripada Alqamah, daripada Ibnu Mas’ud r.a. bahawa Nabi SAW telah menunaikan solat Zuhur bersama mereka, lalu baginda menambah atau mengurangkan rakaatnya. Mansur berkata, “Aku tidak pasti sama ada Ibrahim atau Alqamah yang keliru.”  Dikatakan, “Wahai Rasulullah, adakah solat itu dipendekkan atau adakah baginda lupa?” Baginda bertanya, “Apakah itu?” Mereka berkata, “Baginda telah menunaikan begitu dan begitu banyak rakaat.”  Lalu baginda bersujud dua kali bersama mereka, kemudian bersabda, “Dua sujud ini adalah untuk sesiapa yang tidak pasti sama ada dia telah menambah atau mengurangkan rakaat dalam solatnya, maka hendaklah dia berusaha mencari kebenaran, kemudian sempurnakan apa yang tinggal, lalu bersujud dua kali.”"
  },
  {
    "id": 6429,
    "hadith_number": 6429,
    "tajuk_hadith": "Alasan Pertama Musa: Kelupaan",
    "perawi_melayu": "Riwayat Ubai bin Ka'b:",
    "english_text": "that he heard Allah's Messenger (ﷺ) saying, \"(Moses) said, 'Call me not to \n     account for what I forget and be not hard upon me for my affair (with \n     you)' (18.73) the first excuse of Moses was his forgetfulness.",
    "arabic_text": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، أَخْبَرَنِي سَعِيدُ بْنُ جُبَيْرٍ، قَالَ قُلْتُ لاِبْنِ عَبَّاسٍ فَقَالَ حَدَّثَنَا أُبَىُّ بْنُ كَعْبٍ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏{‏لاَ تُؤَاخِذْنِي بِمَا نَسِيتُ وَلاَ تُرْهِقْنِي مِنْ أَمْرِي عُسْرًا‏}‏ قَالَ ‏\"‏ كَانَتِ الأُولَى مِنْ مُوسَى نِسْيَانًا ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Al-Humaidi, telah menceritakan kepada kami Sufian, telah menceritakan kepada kami Amru bin Dinar, telah memberitakan kepadaku Sa’id bin Jubair, katanya: Aku bertanya kepada Ibnu Abbas, lalu dia berkata: Telah menceritakan kepada kami Ubai bin Ka’ab bahawa dia mendengar Rasulullah SAW bersabda:  \"(Musa berkata), ‘Janganlah Engkau mempersalahkan aku atas apa yang aku lupakan dan janganlah Engkau membebankan aku dengan kesusahan dalam urusanku (dengan-Mu).’ (Surah Al-Kahfi 18:73).  Rasulullah SAW bersabda:  “Alasan pertama Musa ialah kelupaan.”"
  },
  {
    "id": 6430,
    "hadith_number": 6430,
    "tajuk_hadith": "Qurban Sebelum Solat Raya Aidiladha",
    "perawi_melayu": "Al-Bara' bin Azib",
    "english_text": "",
    "arabic_text": "قَالَ أَبُو عَبْدِ اللَّهِ كَتَبَ إِلَىَّ مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنِ الشَّعْبِيِّ، قَالَ قَالَ الْبَرَاءُ بْنُ عَازِبٍ وَكَانَ عِنْدَهُمْ ضَيْفٌ لَهُمْ فَأَمَرَ أَهْلَهُ أَنْ يَذْبَحُوا قَبْلَ أَنْ يَرْجِعَ، لِيَأْكُلَ ضَيْفُهُمْ، فَذَبَحُوا قَبْلَ الصَّلاَةِ، فَذَكَرُوا ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَأَمَرَهُ أَنْ يُعِيدَ الذَّبْحَ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ عِنْدِي عَنَاقٌ جَذَعٌ، عَنَاقُ لَبَنٍ هِيَ خَيْرٌ مِنْ شَاتَىْ لَحْمٍ‏.‏ فَكَانَ ابْنُ عَوْنٍ يَقِفُ فِي هَذَا الْمَكَانِ عَنْ حَدِيثِ الشَّعْبِيِّ، وَيُحَدِّثُ عَنْ مُحَمَّدِ بْنِ سِيرِينَ بِمِثْلِ هَذَا الْحَدِيثِ، وَيَقِفُ فِي هَذَا الْمَكَانِ وَيَقُولُ لاَ أَدْرِي أَبَلَغَتِ الرُّخْصَةُ غَيْرَهُ أَمْ لاَ‏.‏ رَوَاهُ أَيُّوبُ عَنِ ابْنِ سِيرِينَ عَنْ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Abu Abdullah meriwayatkan, Muhammad bin Bashar telah memberitahu saya, Muaz bin Muaz telah memberitahu kami, Ibnu Aun telah memberitahu kami daripada As-Sya'bi, katanya: Al-Bara' bin Azib berkata, “Kami mempunyai seorang tetamu. Maka saya menyuruh keluarga saya untuk menyembelih haiwan korban sebelum saya pulang dari solat (Raya Aidiladha) supaya tetamu kami dapat makan. Maka mereka menyembelih sebelum solat. Kemudian mereka menceritakan perkara itu kepada Nabi SAW, maka Baginda menyuruhnya untuk mengulang penyembelihan.  Saya berkata, “Wahai Rasulullah, saya mempunyai seekor kambing betina muda yang menghasilkan susu, ia lebih baik daripada dua ekor biri-biri untuk disembelih.” Ibnu Aun akan berhenti di sini menceritakan hadis daripada As-Sya’bi dan meriwayatkan daripada Muhammad bin Sirin dengan hadis yang sama, dan dia akan berhenti di sini dan berkata: “Aku tidak tahu sama ada keizinan ini diberikan kepada orang lain selainnya atau tidak.” Diriwayatkan oleh Ayyub daripada Ibnu Sirin daripada Anas daripada Nabi SAW."
  },
  {
    "id": 6431,
    "hadith_number": 6431,
    "tajuk_hadith": "Hukum Penyembelihan Qurban Sebelum Solat Raya",
    "perawi_melayu": "Daripada Jundub:",
    "english_text": "I witnessed the Prophet (ﷺ) offering the `Id prayer (and after finishing it) he delivered a sermon and said, \n\"Whoever has slaughtered his sacrifice (before the prayer) should make up for it (i.e. slaughter another \nanimal) and whoever has not slaughtered his sacrifice yet, should slaughter it by mentioning Allah's \nName over it.\"",
    "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَسْوَدِ بْنِ قَيْسٍ، قَالَ سَمِعْتُ جُنْدَبًا، قَالَ شَهِدْتُ النَّبِيَّ صلى الله عليه وسلم صَلَّى يَوْمَ عِيدٍ ثُمَّ خَطَبَ ثُمَّ قَالَ ‏\n\"‏ مَنْ ذَبَحَ فَلْيُبَدِّلْ مَكَانَهَا، وَمَنْ لَمْ يَكُنْ ذَبَحَ فَلْيَذْبَحْ بِاسْمِ اللَّهِ ‏\"‏‏.‏",
    "malay_translation": "Aku menyaksikan Nabi SAW menunaikan solat Hari Raya, kemudian baginda menyampaikan khutbah dan bersabda:  \"Barangsiapa yang telah menyembelih korbannya sebelum solat, hendaklah ia menggantikannya (iaitu menyembelih seekor haiwan lain), dan barangsiapa yang belum menyembelih korbannya, hendaklah ia menyembelihnya dengan menyebut nama Allah.\" "
  },
  {
    "id": 6432,
    "hadith_number": 6432,
    "tajuk_hadith": "Dosa-dosa Besar Menurut Nabi SAW",
    "perawi_melayu": "Riwayat Abdullah bin Amr:",
    "english_text": "The Prophet (ﷺ) said, \"The biggest sins are: To join others in worship with Allah; to be undutiful to one's parents; to kill somebody unlawfully; and to take an oath Al-Ghamus.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا النَّضْرُ، أَخْبَرَنَا شُعْبَةُ، حَدَّثَنَا فِرَاسٌ، قَالَ سَمِعْتُ الشَّعْبِيَّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْكَبَائِرُ الإِشْرَاكُ بِاللَّهِ، وَعُقُوقُ الْوَالِدَيْنِ، وَقَتْلُ النَّفْسِ، وَالْيَمِينُ الْغَمُوسُ ‏\"‏‏.‏",
    "malay_translation": "Nabi SAW bersabda:  \"Dosa-dosa besar ialah: Syirik kepada Allah, derhaka kepada ibu bapa, membunuh jiwa secara zalim, dan sumpah palsu yang membinasakan.\""
  },
  {
    "id": 6433,
    "hadith_number": 6433,
    "tajuk_hadith": "Sumpah Palsu untuk Merampas Harta Muslim",
    "perawi_melayu": "Riwayat Abdullah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ حَلَفَ عَلَى يَمِينِ صَبْرٍ، يَقْتَطِعُ بِهَا مَالَ امْرِئٍ مُسْلِمٍ، لَقِيَ اللَّهَ وَهْوَ عَلَيْهِ غَضْبَانُ ‏\"‏‏.‏ فَأَنْزَلَ اللَّهُ تَصْدِيقَ ذَلِكَ ‏{‏إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلاً‏}‏ إِلَى آخِرِ الآيَةِ‏.‏   فَدَخَلَ الأَشْعَثُ بْنُ قَيْسٍ فَقَالَ مَا حَدَّثَكُمْ أَبُو عَبْدِ الرَّحْمَنِ، فَقَالُوا كَذَا وَكَذَا‏.‏ قَالَ فِيَّ أُنْزِلَتْ، كَانَتْ لِي بِئْرٌ فِي أَرْضِ ابْنِ عَمٍّ لِي فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ بَيِّنَتُكَ أَوْ يَمِينُهُ ‏\"‏‏.‏ قُلْتُ إِذًا يَحْلِفُ عَلَيْهَا يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ حَلَفَ عَلَى يَمِينِ صَبْرٍ، وَهْوَ فِيهَا فَاجِرٌ، يَقْتَطِعُ بِهَا مَالَ امْرِئٍ مُسْلِمٍ، لَقِيَ اللَّهَ يَوْمَ الْقِيَامَةِ، وَهْوَ عَلَيْهِ غَضْبَانُ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Musa bin Ismail, telah menceritakan kepada kami Abu 'Awana, dari al-A'masy, dari Abu Wa'il, dari Abdullah r.a., dia berkata, Rasulullah SAW bersabda: \"Barangsiapa bersumpah dengan sumpah palsu untuk merampas harta seorang Muslim, maka dia akan menemui Allah dalam keadaan murka Allah.\"  Kemudian Allah menurunkan ayat sebagai penegasan akan hal itu: {Sesungguhnya orang-orang yang menjual janji Allah dan sumpah mereka dengan harga yang sedikit...} hingga akhir ayat.  Kemudian masuklah al-Asy'ats bin Qais lalu berkata, \"Apakah yang telah diceritakan Abu Abdur Rahman kepada kalian?\" Mereka menjawab, \"Begini dan begitu.\"  Dia berkata, \"Ayat ini diturunkan kerana aku. Aku mempunyai sebuah perigi di tanah sepupuku, lalu kami berselisih faham mengenainya. Aku mengadu kepada Rasulullah SAW, lalu Baginda bersabda, \"Buktikanlah atau sumpahnya.\" Aku berkata, \"Maka dia akan bersumpah, wahai Rasulullah.\" Rasulullah SAW bersabda, \"Barangsiapa bersumpah dengan sumpah palsu dan dia berbuat fasik di dalamnya untuk merampas harta seorang Muslim, maka dia akan menemui Allah pada hari kiamat dalam keadaan murka Allah.\""
  },
  {
    "id": 6434,
    "hadith_number": 6434,
    "tajuk_hadith": "Janji Rasulullah SAW Mengenai Kenderaan",
    "perawi_melayu": "Riwayat Abu Musa:",
    "english_text": "My companions sent me to the Prophet (ﷺ) to ask him for some mounts. He said, \"By Allah! I will not \nmount you on anything!\" When I met him, he was in an angry mood, but when I met him (again), he \nsaid, \"Tell your companions that Allah or Allah's Messenger (ﷺ) will provide you with mounts.\"",
    "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ أَرْسَلَنِي أَصْحَابِي إِلَى النَّبِيِّ صلى الله عليه وسلم أَسْأَلُهُ الْحُمْلاَنَ فَقَالَ ‏\"‏ وَاللَّهِ لاَ أَحْمِلُكُمْ عَلَى شَىْءٍ ‏\"‏‏.‏ وَوَافَقْتُهُ وَهْوَ غَضْبَانُ فَلَمَّا أَتَيْتُهُ قَالَ ‏\"‏ انْطَلِقْ إِلَى أَصْحَابِكَ فَقُلْ إِنَّ اللَّهَ ـ أَوْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ـ يَحْمِلُكُمْ ‏\"‏‏.‏",
    "malay_translation": "Sahabat-sahabatku menghantar aku kepada Nabi SAW untuk meminta baginda menyediakan kenderaan. Baginda bersabda, \"Demi Allah! Aku tidak akan menyediakan kenderaan untuk kamu!\"  Ketika aku bertemu baginda, baginda sedang marah.  Tetapi apabila aku bertemu baginda (sekali lagi), baginda bersabda, \"Pergilah kepada sahabat-sahabatmu dan beritahukan bahawa Allah SWT atau Rasulullah SAW akan menyediakan kenderaan untuk kamu.\""
  },
  {
    "id": 6435,
    "hadith_number": 6435,
    "tajuk_hadith": "Pembersihan Diri Aisyah dan Ketaatan Abu Bakar",
    "perawi_melayu": "Daripada Az-Zuhri:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ، حَدَّثَنَا إِبْرَاهِيمُ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، ح وَحَدَّثَنَا الْحَجَّاجُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ النُّمَيْرِيُّ، حَدَّثَنَا يُونُسُ بْنُ يَزِيدَ الأَيْلِيُّ، قَالَ سَمِعْتُ الزُّهْرِيَّ، قَالَ سَمِعْتُ عُرْوَةَ بْنَ الزُّبَيْرِ، وَسَعِيدَ بْنَ الْمُسَيَّبِ، وَعَلْقَمَةَ بْنَ وَقَّاصٍ، وَعُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ حَدِيثِ، عَائِشَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم حِينَ قَالَ لَهَا أَهْلُ الإِفْكِ مَا قَالُوا، فَبَرَّأَهَا اللَّهُ مِمَّا قَالُوا ـ كُلٌّ حَدَّثَنِي طَائِفَةً مِنَ الْحَدِيثِ ـ فَأَنْزَلَ اللَّهُ ‏{‏إِنَّ الَّذِينَ جَاءُوا بِالإِفْكِ‏}‏ الْعَشْرَ الآيَاتِ كُلَّهَا فِي بَرَاءَتِي‏.‏ فَقَالَ أَبُو بَكْرٍ الصِّدِّيقُ ـ وَكَانَ يُنْفِقُ عَلَى مِسْطَحٍ لِقَرَابَتِهِ مِنْهُ ـ وَاللَّهِ لاَ أُنْفِقُ عَلَى مِسْطَحٍ شَيْئًا أَبَدًا، بَعْدَ الَّذِي قَالَ لِعَائِشَةَ‏.‏ فَأَنْزَلَ اللَّهُ ‏{‏وَلاَ يَأْتَلِ أُولُو الْفَضْلِ مِنْكُمْ وَالسَّعَةِ أَنْ يُؤْتُوا أُولِي الْقُرْبَى‏}‏ الآيَةَ‏.‏ قَالَ أَبُو بَكْرٍ بَلَى وَاللَّهِ إِنِّي لأُحِبُّ أَنْ يَغْفِرَ اللَّهُ لِي‏.‏ فَرَجَعَ إِلَى مِسْطَحٍ النَّفَقَةَ الَّتِي كَانَ يُنْفِقُ عَلَيْهِ وَقَالَ وَاللَّهِ لاَ أَنْزِعُهَا عَنْهُ أَبَدًا‏.‏",
    "malay_translation": "Kami telah mendengar daripada Abdul Aziz, yang meriwayatkan daripada Ibrahim, daripada Shalih, daripada Ibnu Syihab. Dan kami juga telah mendengar daripada Al-Hajjaj, yang meriwayatkan daripada Abdullah bin Umar An-Numairi, yang meriwayatkan daripada Yunus bin Yazid Al-Ayli, berkata: Saya mendengar Az-Zuhri berkata: Saya telah mendengar daripada Urwah bin Az-Zubair, Said bin Al-Musayyab, Alqamah bin Waqqas, dan Ubaidullah bin Abdullah bin Utbah, meriwayatkan dari hadis Aisyah, isteri Nabi ﷺ, ketika orang-orang yang menyebarkan fitnah itu berkata apa yang mereka katakan, maka Allah membersihkan Aisyah daripada apa yang mereka katakan. Masing-masing meriwayatkan sebahagian daripada hadis itu kepada saya. Maka Allah menurunkan ayat (yang bermaksud):  \"Sesungguhnya orang-orang yang membawa berita bohong itu...\". Sepuluh ayat itu semuanya sebagai bukti untuk membersihkan diriku. Maka Abu Bakar As-Siddiq – yang ketika itu memberi bantuan kewangan kepada Mistah kerana hubungan kekeluargaan – berkata: Demi Allah, aku tidak akan lagi memberi apa-apa kepada Mistah selepas apa yang telah dia katakan tentang Aisyah. Maka Allah menurunkan ayat (yang bermaksud): \"Dan janganlah orang-orang yang mempunyai kelebihan dan keluasan harta di kalangan kamu enggan memberi bantuan kepada kaum kerabat mereka…\". Abu Bakar berkata: Ya, demi Allah, sesungguhnya aku suka jika Allah mengampunkan dosa-dosaku. Maka dia meneruskan pemberian bantuan kewangan kepada Mistah seperti biasa dan berkata: Demi Allah, aku tidak akan pernah menghentikannya.\" "
  },
  {
    "id": 6436,
    "hadith_number": 6436,
    "tajuk_hadith": "Nabi SAW Mengutamakan Amalan Yang Lebih Baik Daripada Sumpah",
    "perawi_melayu": "Riwayat Abu Musa Al-Ash`ari:",
    "english_text": "I went along with some men from the Ash-ariyin to Allah's Messenger (ﷺ) and it happened that I met him \nwhile he was in an angry mood. We asked him to provide us with mounts, but he swore that he would \nnot give us any. Later on he said, \"By Allah, Allah willing, if ever I take an oath (to do something) \nand later on I find something else better than the first, then I do the better one and give expiation for \nthe dissolution of my oath.\"",
    "arabic_text": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ، عَنِ الْقَاسِمِ، عَنْ زَهْدَمٍ، قَالَ كُنَّا عِنْدَ أَبِي مُوسَى الأَشْعَرِيِّ قَالَ أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي نَفَرٍ مِنَ الأَشْعَرِيِّينَ، فَوَافَقْتُهُ وَهْوَ غَضْبَانُ فَاسْتَحْمَلْنَاهُ، فَحَلَفَ أَنْ لاَ يَحْمِلَنَا ثُمَّ قَالَ ‏\n\"‏ وَاللَّهِ إِنْ شَاءَ اللَّهُ لاَ أَحْلِفُ عَلَى يَمِينٍ فَأَرَى غَيْرَهَا خَيْرًا مِنْهَا، إِلاَّ أَتَيْتُ الَّذِي هُوَ خَيْرٌ وَتَحَلَّلْتُهَا ‏\"‏‏.‏",
    "malay_translation": "Kami bersama beberapa orang lelaki dari kalangan Asy'ariyyah telah pergi menghadap Rasulullah SAW.  Ketika itu, kami mendapati baginda dalam keadaan marah.  Kami memohon agar baginda memberi kami kenderaan, tetapi baginda bersumpah bahawa baginda tidak akan memberi. Kemudian baginda berkata, \"Demi Allah, jika Allah berkehendak, aku tidak akan bersumpah atas sesuatu sumpah, kemudian aku mendapati perkara lain yang lebih baik daripadanya, melainkan aku akan melakukan perkara yang lebih baik itu dan menebus sumpahku.\""
  },
  {
    "id": 6437,
    "hadith_number": 6437,
    "tajuk_hadith": "Syafaat Nabi SAW untuk Abu Talib",
    "perawi_melayu": "Riwayat Al-Musaiyab:",
    "english_text": "When the death of Abu Talib approached, Allah's Messenger (ﷺ) came to him and said, \"Say: La ilaha illallah, a word with which I will be able to defend you before Allah.\"",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، عَنْ أَبِيهِ، قَالَ لَمَّا حَضَرَتْ أَبَا طَالِبٍ الْوَفَاةُ جَاءَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ قُلْ لاَ إِلَهَ إِلاَّ اللَّهُ كَلِمَةً‏.‏ أُحَاجُّ لَكَ بِهَا عِنْدَ اللَّهِ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abu Yaman, telah memberitakan kepada kami Syu'aib, dari Az Zuhri, dia berkata; telah memberitakan kepadaku Said bin Al Musayyab, dari bapanya, dia berkata: ketika kematian telah hampir menghampiri Abu Talib, maka datanglah Rasulullah SAW kepadanya lalu bersabda: \"Ucapkanlah: La ilaha illa Allah, iaitu satu kalimah yang akan aku gunakan untuk membela engkau di sisi Allah.\" "
  },
  {
    "id": 6438,
    "hadith_number": 6438,
    "tajuk_hadith": "Dua Kalimat yang Ringan di Lidah, Berat di Timbangan",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "Allah's Messenger (ﷺ) said, \"(The following are) two words (sentences or utterances) that are very easy for the tongue to say, and very heavy in the balance (of reward), and most beloved to the Gracious Almighty (And they are): Subhan Allahi wa bi-hamdihi; Subhan Allahi-l-'Adhim\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، حَدَّثَنَا عُمَارَةُ بْنُ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ كَلِمَتَانِ خَفِيفَتَانِ عَلَى اللِّسَانِ، ثَقِيلَتَانِ فِي الْمِيزَانِ، حَبِيبَتَانِ إِلَى الرَّحْمَنِ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ، سُبْحَانَ اللَّهِ الْعَظِيمِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Dua kalimat yang ringan di lidah, berat di timbangan (pahala), dan sangat disukai oleh Allah SWT, iaitu: Subhanallah wa bihamdihi, Subhanallahil-'Azim.\""
  },
  {
    "id": 6439,
    "hadith_number": 6439,
    "tajuk_hadith": "Kematian dalam Syirik dan Tauhid",
    "perawi_melayu": "Riwayat Abdullah",
    "english_text": "Allah's Messenger (ﷺ) said a sentence and I said another. He said, \"Whoever dies while he is setting up rivals \nalong with Allah (i.e. worshipping others along with Allah) shall be admitted into the (Hell) Fire.\" \nAnd I said the other: \"Whoever dies while he is not setting up rivals along with Allah (i.e. \nworshipping none except Allah) shall be admitted into Paradise.\"",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الأَعْمَشُ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم كَلِمَةً وَقُلْتُ أُخْرَى ‏\n\"‏ مَنْ مَاتَ يَجْعَلُ لِلَّهِ نِدًّا أُدْخِلَ النَّارَ ‏\"‏‏.‏ وَقُلْتُ أُخْرَى مَنْ مَاتَ لاَ يَجْعَلُ لِلَّهِ نِدًّا أُدْخِلَ الْجَنَّةَ‏.‏",
    "malay_translation": "Rasulullah SAW bersabda satu kalimat dan aku bersabda satu lagi. Baginda bersabda, \"Barangsiapa yang mati dalam keadaan menyekutukan Allah (iaitu, menyembah selain Allah), nescaya dia akan dimasukkan ke dalam neraka.\" Dan aku bersabda satu lagi, \"Barangsiapa yang mati dalam keadaan tidak menyekutukan Allah (iaitu, hanya menyembah Allah), nescaya dia akan dimasukkan ke dalam syurga.\""
  },
  {
    "id": 6440,
    "hadith_number": 6440,
    "tajuk_hadith": "Sumpah Rasulallah SAW Berpuasa Daripada Isteri-isteri Baginda dan Panjangnya Bulan",
    "perawi_melayu": "Anas meriwayatkan:",
    "english_text": "Allah's Messenger (ﷺ) took an oath for abstention from his wives (for one month), and during those days he \nhad a sprain in his foot. He stayed in a Mashrubah (an upper room) for twenty-nine nights and then \ncame down. Then the people said, \"O Allah's Messenger (ﷺ)! You took an oath for abstention (from your \nwives) for one month.\" On that he said, \"A (lunar) month can be of twenty-nine days.\"",
    "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ آلَى رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ نِسَائِهِ، وَكَانَتِ انْفَكَّتْ رِجْلُهُ، فَأَقَامَ فِي مَشْرُبَةٍ تِسْعًا وَعِشْرِينَ لَيْلَةً، ثُمَّ نَزَلَ فَقَالُوا يَا رَسُولَ اللَّهِ آلَيْتَ شَهْرًا‏.‏ فَقَالَ ‏{‏إِنَّ الشَّهْرَ يَكُونُ تِسْعًا وَعِشْرِينَ‏}‏",
    "malay_translation": "Anas r.a. berkata: Rasulullah SAW bersumpah untuk menjauhi isteri-isteri baginda selama sebulan.  Pada ketika itu, baginda mengalami terkilir kaki. Baginda tinggal di sebuah mashrubah (bilik atas) selama dua puluh sembilan malam, kemudian turun. Lalu, orang ramai berkata, \"Wahai Rasulullah SAW!  Anda bersumpah menjauhi isteri-isteri baginda selama sebulan.\" Baginda menjawab, \"Sesungguhnya bulan itu boleh jadi terdiri daripada dua puluh sembilan hari.\""
  },
  {
    "id": 6441,
    "hadith_number": 6441,
    "tajuk_hadith": "Minuman di Majlis Perkahwinan Sahabat",
    "perawi_melayu": "Riwayat Abu Hazim:",
    "english_text": "Sahl bin Sa`d said, \"Abu Usaid, the companion of the Prophet, got married, so he invited the Prophet (ﷺ) to his wedding party, and the bride herself served them. Sahl said to the People, 'Do you know what drink she served him with? She infused some dates in a pot at night and the next morning she served him with the infusion.\"",
    "arabic_text": "حَدَّثَنِي عَلِيٌّ، سَمِعَ عَبْدَ الْعَزِيزِ بْنَ أَبِي حَازِمٍ، أَخْبَرَنِي أَبِي، عَنْ سَهْلِ بْنِ سَعْدٍ، أَنَّ أَبَا أُسَيْدٍ، صَاحِبَ النَّبِيِّ صلى الله عليه وسلم أَعْرَسَ فَدَعَا النَّبِيَّ صلى الله عليه وسلم لِعُرْسِهِ، فَكَانَتِ الْعَرُوسُ خَادِمَهُمْ‏.‏ فَقَالَ سَهْلٌ لِلْقَوْمِ هَلْ تَدْرُونَ مَا سَقَتْهُ قَالَ أَنْقَعَتْ لَهُ تَمْرًا فِي تَوْرٍ مِنَ اللَّيْلِ، حَتَّى أَصْبَحَ عَلَيْهِ فَسَقَتْهُ إِيَّاهُ‏.‏",
    "malay_translation": "Sahl bin Saad berkata, \"Abu Usayd, sahabat Nabi ﷺ, berkahwin lalu menjemput Nabi ﷺ ke majlis perkahwinannya.  Pengantin perempuan sendiri yang melayan mereka. Sahl berkata kepada orang ramai, 'Adakah kamu tahu minuman apakah yang dihidangkan kepadanya? Dia telah merendam beberapa biji tamar dalam periuk pada waktu malam, dan pada pagi berikutnya dia menghidangkannya kepada Nabi ﷺ.'\" "
  },
  {
    "id": 6442,
    "hadith_number": 6442,
    "tajuk_hadith": "Kisah Kambing Mati dan Kulitnya Digunakan Sebagai Kulit Air",
    "perawi_melayu": "Riwayat Sauda:",
    "english_text": "(the wife of the Prophet) One of our sheep died and we tanned its skin and kept on infusing dates in it \ntill it was a worn out water skin.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، عَنِ الشَّعْبِيِّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنْ سَوْدَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ مَاتَتْ لَنَا شَاةٌ فَدَبَغْنَا مَسْكَهَا ثُمَّ مَا زِلْنَا نَنْبِذُ فِيهِ حَتَّى صَارَتْ شَنًّا‏.‏",
    "malay_translation": "Daripada Sauda, isteri Nabi SAW, beliau berkata: “Seekor kambing kami mati, lalu kami menyamak kulitnya dan kami terus menggunakannya untuk menyimpan tamar sehingga ia menjadi usang.”"
  },
  {
    "id": 6443,
    "hadith_number": 6443,
    "tajuk_hadith": "Keluarga Nabi Muhammad SAW Tidak Pernah Kenyang Makan Roti Gandum Dengan Daging Selama Tiga Hari Berturut-turut",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "The family of (the Prophet) Muhammad never ate wheat-bread with meat for three consecutive days to their fill, till he met Allah.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا شَبِعَ آلُ مُحَمَّدٍ صلى الله عليه وسلم مِنْ خُبْزِ بُرٍّ مَأْدُومٍ ثَلاَثَةَ أَيَّامٍ حَتَّى لَحِقَ بِاللَّهِ‏.‏   \nوَقَالَ ابْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ أَبِيهِ، أَنَّهُ قَالَ لِعَائِشَةَ بِهَذَا‏.‏",
    "malay_translation": "Aisyah r.a. berkata, \"Keluarga Nabi Muhammad SAW tidak pernah merasa kenyang makan roti gandum dengan daging selama tiga hari berturut-turut sehingga Baginda bertemu dengan Allah SWT.\""
  },
  {
    "id": 6444,
    "hadith_number": 6444,
    "tajuk_hadith": "Keberkatan Roti Sedikit",
    "perawi_melayu": "Riwayat Anas bin Malik:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، قَالَ قَالَ أَبُو طَلْحَةَ لأُمِّ سُلَيْمٍ لَقَدْ سَمِعْتُ صَوْتَ، رَسُولِ اللَّهِ صلى الله عليه وسلم ضَعِيفًا أَعْرِفُ فِيهِ الْجُوعَ، فَهَلْ عِنْدَكِ مِنْ شَىْءٍ فَقَالَتْ نَعَمْ‏.‏ فَأَخْرَجَتْ أَقْرَاصًا مِنْ شَعِيرٍ، ثُمَّ أَخَذَتْ خِمَارًا لَهَا، فَلَفَّتِ الْخُبْزَ بِبَعْضِهِ، ثُمَّ أَرْسَلَتْنِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَهَبْتُ فَوَجَدْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي الْمَسْجِدِ وَمَعَهُ النَّاسُ، فَقُمْتُ عَلَيْهِمْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَرْسَلَكَ أَبُو طَلْحَةَ ‏\"‏‏.‏ فَقُلْتُ نَعَمْ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِمَنْ مَعَهُ ‏\"‏ قُومُوا ‏\"‏‏.‏ فَانْطَلَقُوا، وَانْطَلَقْتُ بَيْنَ أَيْدِيهِمْ حَتَّى جِئْتُ أَبَا طَلْحَةَ فَأَخْبَرْتُهُ‏.‏ فَقَالَ أَبُو طَلْحَةَ يَا أُمَّ سُلَيْمٍ قَدْ جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَلَيْسَ عِنْدَنَا مِنَ الطَّعَامِ مَا نُطْعِمُهُمْ‏.‏ فَقَالَتِ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ فَانْطَلَقَ أَبُو طَلْحَةَ حَتَّى لَقِيَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَقْبَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو طَلْحَةَ حَتَّى دَخَلاَ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلُمِّي يَا أُمَّ سُلَيْمٍ مَا عِنْدَكِ ‏\"‏‏.‏ فَأَتَتْ بِذَلِكَ الْخُبْزِ ـ قَالَ ـ فَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِذَلِكَ الْخُبْزِ فَفُتَّ، وَعَصَرَتْ أُمُّ سُلَيْمٍ عُكَّةً لَهَا فَأَدَمَتْهُ، ثُمَّ قَالَ فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم مَا شَاءَ اللَّهُ أَنْ يَقُولَ، ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ ‏\"‏‏.‏ فَأَذِنَ لَهُمْ فَأَكَلُوا حَتَّى شَبِعُوا، ثُمَّ خَرَجُوا، ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ ‏\"‏‏.‏ فَأَذِنَ لَهُمْ، فَأَكَلَ الْقَوْمُ كُلُّهُمْ وَشَبِعُوا، وَالْقَوْمُ سَبْعُونَ أَوْ ثَمَانُونَ رَجُلاً‏.‏",
    "malay_translation": "Abu Talhah memberitahu Um Sulaim, \"Aku mendengar suara Rasulullah SAW agak lemah, dan aku tahu bahawa ia disebabkan oleh kelaparan. Adakah engkau mempunyai apa-apa (untuk diberikan kepada Nabi)?\" Jawab Um Sulaim, \"Ya.\" Kemudian dia mengeluarkan beberapa keping roti barli dan mengambil selendangnya, lalu membalut roti itu dengan sebahagiannya dan menyuruhku pergi kepada Rasulullah SAW. Aku pergi dan mendapati Rasulullah SAW sedang duduk di masjid bersama beberapa orang. Aku berdiri di hadapan baginda. Rasulullah SAW bertanya kepadaku, \"Adakah Abu Talhah yang menghantarmu?\" Aku menjawab, \"Ya.\" Kemudian Rasulullah SAW bersabda kepada mereka yang berada bersama baginda, \"Bangunlah.\" Aku berjalan di hadapan mereka sehingga sampai ke tempat Abu Talhah dan memaklumkannya. Abu Talhah berkata, \"Wahai Um Sulaim! Rasulullah SAW telah datang dan kita tidak mempunyai makanan untuk memberi mereka.\" Um Sulaim menjawab, \"Allah dan Rasul-Nya lebih mengetahui.\" Maka Abu Talhah keluar (untuk menyambut mereka) sehingga dia bertemu Rasulullah SAW. Rasulullah SAW datang bersama Abu Talhah dan mereka masuk ke rumah. Rasulullah SAW bersabda, \"Wahai Um Sulaim! Bawalah apa sahaja yang ada padamu.\" Maka dia membawa roti barli itu dan Rasulullah SAW memerintahkan supaya roti itu dipotong kecil-kecil, kemudian Um Sulaim menuangkan sedikit mentega dari bekas kulit ke atasnya, lalu Rasulullah SAW memanjatkan doa seperti yang dikehendaki Allah SWT. Kemudian Rasulullah SAW bersabda, \"Izinkan sepuluh orang masuk.\" Abu Talhah mengizinkan mereka dan mereka makan sehingga kenyang, kemudian keluar. Baginda kemudian bersabda lagi, \"Izinkan sepuluh orang masuk.\" Dia mengizinkan mereka, dan dengan cara ini semua orang makan sehingga kenyang, dan jumlah mereka adalah tujuh puluh atau lapan puluh orang."
  },
  {
    "id": 6445,
    "hadith_number": 6445,
    "tajuk_hadith": "Niat dalam Amalan",
    "perawi_melayu": "Riwayat Umar bin al-Khattab:",
    "english_text": "I heard Allah's Messenger (ﷺ) saying, \"The (reward of) deeds, depend upon the intentions and every person \nwill get the reward according to what he has intended. So whoever emigrated for the sake of Allah and \nHis Apostle, then his emigration will be considered to be for Allah and His Apostle, and whoever \nemigrated for the sake of worldly gain or for a woman to marry, then his emigration will be \nconsidered to be for what he emigrated for.\"",
    "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، يَقُولُ أَخْبَرَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ، أَنَّهُ سَمِعَ عَلْقَمَةَ بْنَ وَقَّاصٍ اللَّيْثِيَّ، يَقُولُ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّمَا الأَعْمَالُ بِالنِّيَّةِ، وَإِنَّمَا لاِمْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ، وَمَنْ كَانَتْ هِجْرَتُهُ إِلَى دُنْيَا يُصِيبُهَا أَوِ امْرَأَةٍ يَتَزَوَّجُهَا، فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ ‏\"‏‏.‏",
    "malay_translation": "Aku mendengar Rasulullah SAW bersabda, \"Sesungguhnya amalan-amalan itu bergantung kepada niat, dan seseorang itu akan mendapat balasan menurut apa yang diniatkannya.  Oleh itu, sesiapa yang berhijrah kerana Allah dan Rasul-Nya, maka hijrahnya itu adalah kerana Allah dan Rasul-Nya. Dan sesiapa yang berhijrah kerana mencari keuntungan duniawi atau kerana seorang wanita yang ingin dinikahinya, maka hijrahnya itu adalah kerana apa yang diniatkannya.\" "
  },
  {
    "id": 6446,
    "hadith_number": 6446,
    "tajuk_hadith": "Mengenai Tobat Ka'b bin Malik dan Nasihat Nabi SAW",
    "perawi_melayu": "Riwayat Ka'b bin Malik:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عَبْدُ الرَّحْمَنِ، عَنْ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ، وَكَانَ، قَائِدَ كَعْبٍ مِنْ بَنِيهِ حِينَ عَمِيَ ـ قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ، فِي حَدِيثِهِ ‏{‏َعَلَى الثَّلاَثَةِ الَّذِينَ خُلِّفُوا‏}‏ َقَالَ فِي آخِرِ حَدِيثِهِ إِنَّ مِنْ تَوْبَتِي أَنِّي أَنْخَلِعُ مِنْ مَالِي صَدَقَةً إِلَى اللَّهِ وَرَسُولِهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَمْسِكْ عَلَيْكَ بَعْضَ مَالِكَ فَهْوَ خَيْرٌ لَكَ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Ahmad bin Shaleh, telah menceritakan kepada kami Ibnu Wahb, telah memberitakan kepadaku Yunus, dari Ibnu Syihab, telah memberitakan kepadaku Abdurrahman, dari Abdullah bin Ka'ab bin Malik, dan beliau adalah pemimpin Ka'ab daripada anak-anaknya ketika beliau buta -  beliau berkata: Aku mendengar Ka'ab bin Malik, di dalam hadisnya {tentang tiga orang yang tertinggal}, beliau berkata di penghujung hadisnya: Bahawa sebahagian daripada taubatku ialah aku akan menyedekahkan semua hartaku kepada Allah dan Rasul-Nya. Maka Nabi SAW bersabda: \"Simpanlah sebahagian daripada hartamu, kerana ia lebih baik bagimu.\""
  },
  {
    "id": 6447,
    "hadith_number": 6447,
    "tajuk_hadith": "Larangan Nabi SAW Minum Madu dan Ayat Al-Quran yang Diturunkan",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدٍ، حَدَّثَنَا الْحَجَّاجُ، عَنِ ابْنِ جُرَيْجٍ، قَالَ زَعَمَ عَطَاءٌ أَنَّهُ سَمِعَ عُبَيْدَ بْنَ عُمَيْرٍ، يَقُولُ سَمِعْتُ عَائِشَةَ، تَزْعُمُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَمْكُثُ عِنْدَ زَيْنَبَ بِنْتِ جَحْشٍ، وَيَشْرَبُ عِنْدَهَا عَسَلاً، فَتَوَاصَيْتُ أَنَا وَحَفْصَةُ أَنَّ أَيَّتَنَا دَخَلَ عَلَيْهَا النَّبِيُّ صلى الله عليه وسلم فَلْتَقُلْ إِنِّي أَجِدُ مِنْكَ رِيحَ مَغَافِيرَ، أَكَلْتَ مَغَافِيرَ فَدَخَلَ عَلَى إِحْدَاهُمَا فَقَالَتْ ذَلِكَ لَهُ‏.‏ فَقَالَ ‏\"‏ لاَ بَلْ شَرِبْتُ عَسَلاً عِنْدَ زَيْنَبَ بِنْتِ جَحْشٍ، وَلَنْ أَعُودَ لَهُ ‏\"‏‏.‏ فَنَزَلَتْ ‏{‏يَا أَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَا أَحَلَّ اللَّهُ لَكَ‏}‏، ‏{‏إِنْ تَتُوبَا إِلَى اللَّهِ‏}‏، لِعَائِشَةَ وَحَفْصَةَ، ‏{‏وَإِذْ أَسَرَّ النَّبِيُّ إِلَى بَعْضِ أَزْوَاجِهِ حَدِيثًا‏}‏ لِقَوْلِهِ ‏\"‏ بَلْ شَرِبْتُ عَسَلاً ‏\"‏‏.‏   \nوَقَالَ لِي إِبْرَاهِيمُ بْنُ مُوسَى عَنْ هِشَامٍ، ‏\"‏ وَلَنْ أَعُودَ لَهُ، وَقَدْ حَلَفْتُ، فَلاَ تُخْبِرِي بِذَلِكَ أَحَدًا ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Al-Hasan bin Muhammad, telah menceritakan kepada kami Al-Hajjaj, dari Ibnu Juraij, dia berkata, Ata’ berpendapat bahawa dia mendengar Ubaid bin Umayr berkata: Aku mendengar Aisyah mengatakan bahawa Nabi SAW biasa menetap di rumah Zainab binti Jahsy dan minum madu di rumahnya. Maka aku dan Hafsah telah bersepakat bahawa sesiapa di antara kami yang didatangi Nabi SAW, hendaklah berkata: “Wahai Rasulullah, aku merasa bau Maghafir (anggur kering yang berbau busuk) daripada tuan. Adakah tuan memakan Maghafir?” Apabila baginda masuk kepada salah seorang daripada kami, maka dia pun berkata demikian kepada baginda. Maka baginda menjawab: “Tidak, tetapi aku telah minum madu di rumah Zainab binti Jahsy, dan aku tidak akan meminumnya lagi.” Maka turunlah ayat: {Wahai Nabi, mengapakah engkau mengharamkan apa yang telah dihalalkan Allah untukmu?}…{jika kamu berdua bertaubat kepada Allah}. Ayat ini ditujukan kepada Aisyah dan Hafsah. {Dan (ingatlah) ketika Nabi membisikkan sesuatu rahsia kepada isterinya}. Ini merujuk kepada perkataan baginda: “Tetapi aku telah minum madu.” Hisyam berkata: Ia juga bermaksud perkataan baginda: “Dan aku tidak akan meminumnya lagi, dan aku telah bersumpah, maka janganlah engkau beritahu sesiapa pun tentang perkara ini.”"
  },
  {
    "id": 6448,
    "hadith_number": 6448,
    "tajuk_hadith": "Larangan Bernazar",
    "perawi_melayu": "Daripada Said bin Al-Harith:",
    "english_text": "that he heard Ibn `Umar saying, \"Weren't people forbidden to make vows?\" The Prophet (ﷺ) said, 'A vow \nneither hastens nor delays anything, but by the making of vows, some of the wealth of a miser is taken \nout.\"",
    "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ صَالِحٍ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، حَدَّثَنَا سَعِيدُ بْنُ الْحَارِثِ، أَنَّهُ سَمِعَ ابْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ أَوَلَمْ يُنْهَوْا عَنِ النَّذْرِ إِنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ النَّذْرَ لاَ يُقَدِّمُ شَيْئًا، وَلاَ يُؤَخِّرُ، وَإِنَّمَا يُسْتَخْرَجُ بِالنَّذْرِ مِنَ الْبَخِيلِ ‏\"‏‏.‏",
    "malay_translation": "Daripada Said bin Al-Harith; bahawa dia mendengar Ibnu Umar berkata, \"Bukankah manusia dilarang daripada bernazar?\" Nabi ﷺ bersabda, \"Sesungguhnya nazar itu tidak akan mempercepatkan sesuatu pun dan tidak akan menangguhkannya, tetapi dengan nazar itu, harta orang bakhil dikeluarkan.\""
  },
  {
    "id": 6449,
    "hadith_number": 6449,
    "tajuk_hadith": "Larangan Bernazar",
    "perawi_melayu": "Daripada Abdullah bin Umar:",
    "english_text": "The Prophet (ﷺ) forbade the making of vows and said, \"It (a vow) does not prevent anything (that has to \ntake place), but the property of a miser is spent (taken out) with it.\"",
    "arabic_text": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُرَّةَ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، نَهَى النَّبِيُّ صلى الله عليه وسلم عَنِ النَّذْرِ وَقَالَ ‏\n\"‏ إِنَّهُ لاَ يَرُدُّ شَيْئًا، وَلَكِنَّهُ يُسْتَخْرَجُ بِهِ مِنَ الْبَخِيلِ ‏\"‏‏.‏",
    "malay_translation": "Daripada Abdullah bin Umar, bahawa Nabi SAW melarang daripada bernazar dan baginda bersabda:  \"Sesungguhnya ia (nazar) tidak dapat menolak sesuatu pun, tetapi dengannya harta orang kedekut dikeluarkan.\""
  },
  {
    "id": 6450,
    "hadith_number": 6450,
    "tajuk_hadith": "Nazir dan Qadar Allah",
    "perawi_melayu": "Riwayat Abu Hurairah",
    "english_text": "The Prophet (ﷺ) said, \"Allah says, 'The vow, does not bring about for the son of Adam anything I have not \ndecreed for him, but his vow may coincide with what has been decided for him, and by this way I \ncause a miser to spend of his wealth. So he gives Me (spends in charity) for the fulfillment of what has \nbeen decreed for him what he would not give Me before but for his vow.\"",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ يَأْتِي ابْنَ آدَمَ النَّذْرُ بِشَىْءٍ لَمْ يَكُنْ قُدِّرَ لَهُ، وَلَكِنْ يُلْقِيهِ النَّذْرُ إِلَى الْقَدَرِ قَدْ قُدِّرَ لَهُ، فَيَسْتَخْرِجُ اللَّهُ بِهِ مِنَ الْبَخِيلِ، فَيُؤْتِي عَلَيْهِ مَا لَمْ يَكُنْ يُؤْتِي عَلَيْهِ مِنْ قَبْلُ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda, \"Allah SWT berfirman: 'Nazir (sumpah) tidak akan mendatangkan sesuatu kepada anak Adam melainkan apa yang telah Aku takdirkan baginya. Akan tetapi, nazir itu mungkin bertepatan dengan apa yang telah ditakdirkan baginya. Dengan cara inilah Aku mengeluarkan harta daripada orang yang bakhil.  Maka, dia memberi kepada-Ku (bersedekah) untuk menunaikan apa yang telah Aku takdirkan baginya, sesuatu yang tidak akan pernah diberikannya kepada-Ku sebelum ini melainkan kerana nazirnya.'\""
  },
  {
    "id": 6451,
    "hadith_number": 6451,
    "tajuk_hadith": "Generasi Terbaik dan Ciri-ciri Generasi Kemudian",
    "perawi_melayu": "Riwayat Zahdam bin Mudarrab:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، عَنْ يَحْيَى، عَنْ شُعْبَةَ، قَالَ حَدَّثَنِي أَبُو جَمْرَةَ، حَدَّثَنَا زَهْدَمُ بْنُ مُضَرِّبٍ، قَالَ سَمِعْتُ عِمْرَانَ بْنَ حُصَيْنٍ، يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ خَيْرُكُمْ قَرْنِي، ثُمَّ الَّذِينَ يَلُونَهُمْ، ثُمَّ الَّذِينَ يَلُونَهُمْ ـ قَالَ عِمْرَانُ لاَ أَدْرِي ذَكَرَ ثِنْتَيْنِ أَوْ ثَلاَثًا بَعْدَ قَرْنِهِ ـ ثُمَّ يَجِيءُ قَوْمٌ يَنْذُرُونَ وَلاَ يَفُونَ، وَيَخُونُونَ وَلاَ يُؤْتَمَنُونَ، وَيَشْهَدُونَ وَلاَ يُسْتَشْهَدُونَ، وَيَظْهَرُ فِيهِمُ السِّمَنُ ‏\"‏‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Musaddad, dari Yahya, dari Syu’bah, dia berkata: Telah menceritakan kepadaku Abu Jamrah, telah menceritakan kepada kami Zahdam bin Mudarrib, dia berkata: Aku mendengar Imran bin Husain menceritakan dari Nabi SAW, baginda bersabda: \"Sebaik-baik kamu ialah generasiku, kemudian generasi selepas mereka, kemudian generasi selepas mereka.\" Imran berkata: Aku tidak ingat sama ada baginda menyebut dua atau tiga generasi selepas generasinya. Kemudian akan datang suatu kaum yang bernazar tetapi tidak menunaikannya, mereka khianat dan tidak boleh dipercayai, mereka memberi keterangan tanpa diminta memberi keterangan, dan kegemukan akan menonjol di kalangan mereka."
  },
  {
    "id": 6452,
    "hadith_number": 6452,
    "tajuk_hadith": "Menepati Nazar Kepada Allah",
    "perawi_melayu": "Riwayat Aisyah",
    "english_text": "The Prophet (ﷺ) said, \"Whoever vows that he will be obedient to Allah, should remain obedient to Him; and whoever made a vow that he will disobey Allah, should not disobey Him.\"",
    "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مَالِكٌ، عَنْ طَلْحَةَ بْنِ عَبْدِ الْمَلِكِ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ نَذَرَ أَنْ يُطِيعَ اللَّهَ فَلْيُطِعْهُ، وَمَنْ نَذَرَ أَنْ يَعْصِيَهُ فَلاَ يَعْصِهِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda: \"Barang siapa yang bernazar akan mentaati Allah, maka hendaklah dia mentaati-Nya; dan barang siapa yang bernazar akan menderhakai-Nya, maka janganlah dia menderhakai-Nya.\""
  },
  {
    "id": 6453,
    "hadith_number": 6453,
    "tajuk_hadith": "Menunaikan Nazar Itikaf",
    "perawi_melayu": "Riwayat Ibnu Umar:",
    "english_text": "`Umar said \"O Allah's Messenger (ﷺ)! I vowed to perform I`tikaf for one night in Al-Masjid-al-Haram, \nduring the Pre-Islamic Period of ignorance (before embracing Islam). \"The Prophet (ﷺ) said, \"Fulfill your \nvow.\" Ibn `Umar said to the lady, \"Pray on her behalf.\" Ibn `Abbas said the same.",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عُمَرَ، قَالَ يَا رَسُولَ اللَّهِ إِنِّي نَذَرْتُ فِي الْجَاهِلِيَّةِ أَنْ أَعْتَكِفَ لَيْلَةً فِي الْمَسْجِدِ الْحَرَامِ‏.‏ قَالَ ‏\n\"‏ أَوْفِ بِنَذْرِكَ ‏\"‏‏.‏",
    "malay_translation": "Umar berkata, \"Wahai Rasulullah ﷺ, saya telah bernazar di zaman Jahiliyyah untuk beritikaf satu malam di Masjidil Haram.\"  Baginda SAW bersabda, \"Tunaikanlah nazarmu.\" Ibnu Umar berkata kepada wanita itu, \"Doakanlah untuknya.\" Ibnu Abbas juga berkata sedemikian."
  },
  {
    "id": 6454,
    "hadith_number": 6454,
    "tajuk_hadith": "Menunaikan Nazar Ibu yang Telah Meninggal Dunia",
    "perawi_melayu": "Riwayat Sa'id bin 'Ubada Al-Ansari:",
    "english_text": "that he consulted the Prophet (ﷺ) about a vow that had been made by his mother who died without \nfulfilling it. The Prophet (ﷺ) gave his verdict that he should fulfill it on her behalf. The verdict became \nSunna (i.e. the Prophet's tradition).",
    "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّ سَعْدَ بْنَ عُبَادَةَ الأَنْصَارِيَّ اسْتَفْتَى النَّبِيَّ صلى الله عليه وسلم فِي نَذْرٍ كَانَ عَلَى أُمِّهِ، فَتُوُفِّيَتْ قَبْلَ أَنْ تَقْضِيَهُ‏.‏ فَأَفْتَاهُ أَنْ يَقْضِيَهُ عَنْهَا، فَكَانَتْ سُنَّةً بَعْدُ‏.‏",
    "malay_translation": "Sa'id bin 'Ubada Al-Ansari telah bertanya kepada Nabi SAW tentang satu nazar yang telah dibuat oleh ibunya yang telah meninggal dunia sebelum sempat menunaikannya. Nabi SAW  memberi keputusan bahawa beliau harus menunaikannya bagi pihak ibunya. Keputusan itu kemudiannya menjadi Sunnah (iaitu tradisi Nabi)."
  },
  {
    "id": 6455,
    "hadith_number": 6455,
    "tajuk_hadith": "Menunaikan Nazar Orang Yang Meninggal Dunia",
    "perawi_melayu": "Riwayat Ibnu Abbas:",
    "english_text": "A man came to the Prophet (ﷺ) and said to him, \"My sister vowed to perform the Hajj, but she died \n(before fulfilling it).\" The Prophet (ﷺ) said, \"Would you not have paid her debts if she had any?\" The man \nsaid, \"Yes.\" The Prophet (ﷺ) said, \"So pay Allah's Rights, as He is more entitled to receive His rights.\"",
    "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ أَتَى رَجُلٌ النَّبِيَّ صلى الله عليه وسلم فَقَالَ لَهُ إِنَّ أُخْتِي نَذَرَتْ أَنْ تَحُجَّ وَإِنَّهَا مَاتَتْ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَوْ كَانَ عَلَيْهَا دَيْنٌ أَكُنْتَ قَاضِيَهُ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَاقْضِ اللَّهَ، فَهْوَ أَحَقُّ بِالْقَضَاءِ ‏\"‏‏.‏",
    "malay_translation": "Seorang lelaki datang kepada Nabi SAW dan berkata, \"Kakak saya telah bernazar untuk menunaikan haji, tetapi dia telah meninggal dunia (sebelum menunaikannya).\"  Nabi SAW bertanya, \"Andainya dia mempunyai hutang, adakah kamu akan membayarnya?\" Lelaki itu menjawab, \"Ya.\" Nabi SAW bersabda, \"Maka tunaikanlah hak Allah, kerana Dia lebih berhak untuk menerima hak-Nya.\""
  },
  {
    "id": 6456,
    "hadith_number": 6456,
    "tajuk_hadith": "Menepati Nazar Kepada Allah",
    "perawi_melayu": "Daripada Aisyah",
    "english_text": "The Prophet (ﷺ) said, \"Whoever vowed to be obedient to Allah, must be obedient to Him; and whoever vowed to be disobedient to Allah, should not be disobedient to Him.\"",
    "arabic_text": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ مَالِكٍ، عَنْ طَلْحَةَ بْنِ عَبْدِ الْمَلِكِ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَنْ نَذَرَ أَنْ يُطِيعَ اللَّهَ فَلْيُطِعْهُ، وَمَنْ نَذَرَ أَنْ يَعْصِيَهُ فَلاَ يَعْصِهِ ‏\"‏‏.‏",
    "malay_translation": "Rasulullah SAW bersabda:  \"Barangsiapa yang bernazar untuk mentaati Allah, maka hendaklah dia mentaati-Nya; dan barangsiapa yang bernazar untuk menderhaka kepada-Nya, maka janganlah dia menderhaka kepada-Nya.\""
  },
  {
    "id": 6457,
    "hadith_number": 6457,
    "tajuk_hadith": "Allah Tidak Memerlukan Azab Diri Sendiri",
    "perawi_melayu": "Anas meriwayatkan:",
    "english_text": "The Prophet (ﷺ) said, \"Allah is not in need of this man) torturing himself,\" when he saw the man walking \nbetween his two sons (who were supporting him).",
    "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ حُمَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ اللَّهَ لَغَنِيٌّ عَنْ تَعْذِيبِ هَذَا نَفْسَهُ ‏\"‏‏.‏ وَرَآهُ يَمْشِي بَيْنَ ابْنَيْهِ‏.‏   \nوَقَالَ الْفَزَارِيُّ عَنْ حُمَيْدٍ حَدَّثَنِي ثَابِتٌ عَنْ أَنَسٍ",
    "malay_translation": "Nabi SAW bersabda, \"Sesungguhnya Allah Maha Kaya (tidak memerlukan) azab yang dilakukan oleh orang ini terhadap dirinya sendiri.\"  Baginda melihat seorang lelaki berjalan di antara dua orang anaknya (yang menyokongnya)."
  },
  {
    "id": 6458,
    "hadith_number": 6458,
    "tajuk_hadith": "Nabi SAW Memutuskan Tali Orang Yang Bertawaf",
    "perawi_melayu": "Riwayat Ibnu Abbas",
    "english_text": "The Prophet (ﷺ) saw a man performing Tawaf around the Ka`ba, tied with a rope or something else (while \nanother person was holding him). The Prophet (ﷺ) cut that rope off.",
    "arabic_text": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ سُلَيْمَانَ الأَحْوَلِ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى رَجُلاً يَطُوفُ بِالْكَعْبَةِ بِزِمَامٍ أَوْ غَيْرِهِ، فَقَطَعَهُ‏.‏",
    "malay_translation": "Daripada Abu ‘Asim, daripada Ibnu Juraij, daripada Sulaiman Al-Ahwal, daripada Tauus, daripada Ibnu Abbas, bahawa Nabi SAW melihat seorang lelaki sedang tawaf di Kaabah dengan tali atau sebagainya, lalu baginda memotongnya."
  },
  {
    "id": 6459,
    "hadith_number": 6459,
    "tajuk_hadith": "Rasulullah SAW Membebaskan Seorang Lelaki yang Diikat dengan Tali di Hidung",
    "perawi_melayu": "Daripada Ibnu Abbas:",
    "english_text": "While performing the Tawaf around the Ka`ba, the Prophet (ﷺ) passed by a person leading another person \nby a hair-rope nose-ring in his nose. The Prophet (ﷺ) cut the hair-rope nose-ring off with his hand and \nordered the man to lead him by the hand.",
    "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي سُلَيْمَانُ الأَحْوَلُ، أَنَّ طَاوُسًا، أَخْبَرَهُ عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم مَرَّ وَهْوَ يَطُوفُ بِالْكَعْبَةِ بِإِنْسَانٍ يَقُودُ إِنْسَانًا بِخِزَامَةٍ فِي أَنْفِهِ، فَقَطَعَهَا النَّبِيُّ صلى الله عليه وسلم بِيَدِهِ، ثُمَّ أَمَرَهُ أَنْ يَقُودَهُ بِيَدِهِ",
    "malay_translation": "Ketika melakukan tawaf di sekitar Kaabah, Nabi SAW melewati seorang lelaki yang sedang memimpin orang lain dengan menggunakan tali yang diikat pada cincin hidungnya. Nabi SAW memotong tali cincin hidung itu dengan tangan Baginda, kemudian Baginda menyuruh lelaki itu memimpin orang tersebut dengan tangannya."
  },
  {
    "id": 6460,
    "hadith_number": 6460,
    "tajuk_hadith": "Nazar Abu Israil dan Nasihat Nabi",
    "perawi_melayu": "Riwayat Ibnu Abbas:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ بَيْنَا النَّبِيُّ صلى الله عليه وسلم يَخْطُبُ إِذَا هُوَ بِرَجُلٍ قَائِمٍ فَسَأَلَ عَنْهُ فَقَالُوا أَبُو إِسْرَائِيلَ نَذَرَ أَنْ يَقُومَ وَلاَ يَقْعُدَ وَلاَ يَسْتَظِلَّ وَلاَ يَتَكَلَّمَ وَيَصُومَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مُرْهُ فَلْيَتَكَلَّمْ وَلْيَسْتَظِلَّ وَلْيَقْعُدْ وَلْيُتِمَّ صَوْمَهُ ‏\"‏‏.‏   \nقَالَ عَبْدُ الْوَهَّابِ حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Musa bin Ismail, telah menceritakan kepada kami Wuhaib, telah menceritakan kepada kami Ayyub, dari Ikrimah, dari Ibnu Abbas, katanya:  Ketika Nabi SAW sedang menyampaikan khutbah, baginda melihat seorang lelaki berdiri. Maka baginda bertanya tentang lelaki itu. Mereka berkata, \"Dia ialah Abu Israil. Dia telah bernazar untuk berdiri dan tidak duduk, tidak berlindung dari panas, tidak bercakap dan berpuasa.\"  Maka Nabi SAW bersabda:  \"Suruhlah dia supaya bercakap, berlindung dari panas, duduk, dan sempurnakan puasanya.\""
  },
  {
    "id": 6461,
    "hadith_number": 6461,
    "tajuk_hadith": "Puasa pada Hari Raya Aidil Adha dan Aidilfitri",
    "perawi_melayu": "Riwayat Abdullah bin Umar:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، حَدَّثَنَا حَكِيمُ بْنُ أَبِي حُرَّةَ الأَسْلَمِيُّ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ سُئِلَ عَنْ رَجُلٍ، نَذَرَ أَنْ لاَ، يَأْتِيَ عَلَيْهِ يَوْمٌ إِلاَّ صَامَ، فَوَافَقَ يَوْمَ أَضْحًى أَوْ فِطْرٍ‏.‏ فَقَالَ لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ، لَمْ يَكُنْ يَصُومُ يَوْمَ الأَضْحَى وَالْفِطْرِ، وَلاَ يَرَى صِيَامَهُمَا‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Muhammad bin Abi Bakar al-Muqaddami, telah menceritakan kepada kami Fudhail bin Sulaiman, telah menceritakan kepada kami Musa bin Uqbah, telah menceritakan kepada kami Hakim bin Abi Hurrah al-Aslami, bahawa dia telah mendengar Abdullah bin Umar - semoga Allah meridhai mereka berdua - ditanya tentang seorang lelaki yang telah bernazar bahawa dia tidak akan meninggalkan sehari pun tanpa berpuasa, lalu ia bertepatan dengan hari raya Aidil Adha atau Aidilfitri. Maka beliau berkata: “Sesungguhnya telah menjadi teladan yang baik bagi kamu dari Rasulullah SAW, baginda tidak berpuasa pada hari raya Aidil Adha dan Aidilfitri, dan baginda tidak menyukai puasa pada kedua-dua hari itu.”"
  },
  {
    "id": 6462,
    "hadith_number": 6462,
    "tajuk_hadith": "Nazar Puasa dan Hari Raya Korban",
    "perawi_melayu": "Riwayat Ziyad bin Jubair:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ يُونُسَ، عَنْ زِيَادِ بْنِ جُبَيْرٍ، قَالَ كُنْتُ مَعَ ابْنِ عُمَرَ فَسَأَلَهُ رَجُلٌ فَقَالَ نَذَرْتُ أَنْ أَصُومَ كُلَّ يَوْمِ ثَلاَثَاءَ أَوْ أَرْبِعَاءَ مَا عِشْتُ، فَوَافَقْتُ هَذَا الْيَوْمَ يَوْمَ النَّحْرِ‏.‏ فَقَالَ أَمَرَ اللَّهُ بِوَفَاءِ النَّذْرِ، وَنُهِينَا أَنْ نَصُومَ يَوْمَ النَّحْرِ‏.‏ فَأَعَادَ عَلَيْهِ فَقَالَ مِثْلَهُ، لاَ يَزِيدُ عَلَيْهِ‏.‏",
    "malay_translation": "Telah menceritakan kepada kami Abdullah bin Maslamah, telah menceritakan kepada kami Yazid bin Zurai', dari Yunus, dari Ziyad bin Jubair, katanya: Aku bersama Ibnu Umar, lalu seorang lelaki bertanya kepadanya, \"Aku telah bernazar akan berpuasa setiap hari Selasa atau Rabu sepanjang hayatku, dan hari puasaku ini bertepatan dengan hari Nahr (hari raya korban). Apakah yang harus aku lakukan?\" Ibnu Umar menjawab, \"Allah SWT telah memerintahkan untuk menunaikan nazar, dan kita dilarang berpuasa pada hari Nahr.\" Lelaki itu mengulang soalannya, dan Ibnu Umar mengulangi jawapannya yang sama tanpa menambah apa-apa."
  },
  {
    "id": 6463,
    "hadith_number": 6463,
    "tajuk_hadith": "Balasan Bagi Pencuri Ghani'mah di Perang Khaibar",
    "perawi_melayu": "Riwayat Abu Hurairah:",
    "english_text": "",
    "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ، عَنْ أَبِي الْغَيْثِ، مَوْلَى ابْنِ مُطِيعٍ عَنْ أَبِي هُرَيْرَةَ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ خَيْبَرَ فَلَمْ نَغْنَمْ ذَهَبًا وَلاَ فِضَّةً إِلاَّ الأَمْوَالَ وَالثِّيَابَ وَالْمَتَاعَ، فَأَهْدَى رَجُلٌ مِنْ بَنِي الضُّبَيْبِ يُقَالُ لَهُ رِفَاعَةُ بْنُ زَيْدٍ لِرَسُولِ اللَّهِ صلى الله عليه وسلم غُلاَمًا يُقَالُ لَهُ مِدْعَمٌ، فَوَجَّهَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى وَادِي الْقُرَى حَتَّى إِذَا كَانَ بِوَادِي الْقُرَى بَيْنَمَا مِدْعَمٌ يَحُطُّ رَحْلاً لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِذَا سَهْمٌ عَائِرٌ فَقَتَلَهُ، فَقَالَ النَّاسُ هَنِيئًا لَهُ الْجَنَّةُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَلاَّ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّ الشَّمْلَةَ الَّتِي أَخَذَهَا يَوْمَ خَيْبَرَ مِنَ الْمَغَانِمِ، لَمْ تُصِبْهَا الْمَقَاسِمُ، لَتَشْتَعِلُ عَلَيْهِ نَارًا ‏\"‏‏.‏ فَلَمَّا سَمِعَ ذَلِكَ النَّاسُ جَاءَ رَجُلٌ بِشِرَاكٍ أَوْ شِرَاكَيْنِ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ شِرَاكٌ مِنْ نَارٍ ـ أَوْ ـ شِرَاكَانِ مِنْ نَارٍ ‏\"‏‏.‏",
    "malay_translation": "Kami keluar bersama Rasulullah SAW pada hari Khaibar. Kami tidak memperoleh emas atau perak sebagai ghanimah, tetapi hanya harta benda, pakaian dan perkakas.  Kemudian, seorang lelaki dari Bani Dhubayb bernama Rifaah bin Zaid menghadiahkan seorang hamba bernama Mid’am kepada Rasulullah SAW. Rasulullah SAW menuju ke Wadi al-Qura. Ketika berada di Wadi al-Qura, ketika Mid’am sedang menundukkan unta Rasulullah SAW, tiba-tiba anak panah yang tidak diketahui asalnya mengenai dan membunuhnya.  Orang ramai berkata, \"Tahniah kepadanya (hamba itu) kerana mendapat syurga.\" Rasulullah SAW bersabda, \"Tidak! Demi Allah yang memegang jiwaku,  sesungguhnya kain yang dicurinya pada hari Khaibar daripada ghanimah sebelum pembahagian, akan membakarnya di neraka.\" Setelah orang ramai mendengarnya, seorang lelaki membawa satu atau dua shirak (tali kasut daripada kulit) kepada Nabi SAW. Nabi SAW bersabda, \"Satu shirak daripada api, atau dua shirak daripada api.\""
  }
]
